<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#20154;&#24037;&#26234;&#33021;&#22312;&#37329;&#34701;&#30417;&#31649;&#26041;&#38754;&#30340;&#24212;&#29992;&#26377;&#21161;&#20110;&#24494;&#35266;&#30417;&#31649;&#65292;&#20294;&#23545;&#20110;&#23439;&#35266;&#30417;&#31649;&#26469;&#35828;&#23384;&#22312;&#25361;&#25112;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#30001;&#20110;&#25104;&#26412;&#25928;&#30410;&#21644;&#20934;&#30830;&#24615;&#30340;&#20248;&#21183;&#65292;AI&#24456;&#21487;&#33021;&#21462;&#20195;&#39640;&#27700;&#24179;&#30340;&#24314;&#35758;&#21644;&#20915;&#31574;&#12290;</title><link>http://arxiv.org/abs/2310.11293</link><description>&lt;p&gt;
&#20851;&#20110;&#20154;&#24037;&#26234;&#33021;&#22312;&#37329;&#34701;&#30417;&#31649;&#20013;&#30340;&#24212;&#29992;&#21450;&#23545;&#37329;&#34701;&#31283;&#23450;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
On the use of artificial intelligence in financial regulations and the impact on financial stability. (arXiv:2310.11293v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.11293
&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#22312;&#37329;&#34701;&#30417;&#31649;&#26041;&#38754;&#30340;&#24212;&#29992;&#26377;&#21161;&#20110;&#24494;&#35266;&#30417;&#31649;&#65292;&#20294;&#23545;&#20110;&#23439;&#35266;&#30417;&#31649;&#26469;&#35828;&#23384;&#22312;&#25361;&#25112;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#30001;&#20110;&#25104;&#26412;&#25928;&#30410;&#21644;&#20934;&#30830;&#24615;&#30340;&#20248;&#21183;&#65292;AI&#24456;&#21487;&#33021;&#21462;&#20195;&#39640;&#27700;&#24179;&#30340;&#24314;&#35758;&#21644;&#20915;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#27491;&#22312;&#37329;&#34701;&#30417;&#31649;&#39046;&#22495;&#36805;&#36895;&#21457;&#23637;&#12290;&#23545;&#20110;&#24494;&#35266;&#30417;&#31649;&#65288;&#22914;&#28040;&#36153;&#32773;&#20445;&#25252;&#21644;&#24120;&#35268;&#38134;&#34892;&#30417;&#31649;&#65289;&#26469;&#35828;&#65292;&#30001;&#20110;&#25968;&#25454;&#20016;&#23500;&#12289;&#26102;&#38388;&#21608;&#26399;&#30701;&#12289;&#30446;&#26631;&#26126;&#30830;&#21644;&#37325;&#22797;&#20915;&#31574;&#65292;AI&#23558;&#21463;&#30410;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#20851;&#27880;&#25972;&#20010;&#37329;&#34701;&#31995;&#32479;&#31283;&#23450;&#30340;&#23439;&#35266;&#30417;&#31649;&#26469;&#35828;&#65292;&#30001;&#20110;&#19981;&#32463;&#24120;&#21457;&#29983;&#19988;&#22823;&#22810;&#25968;&#26159;&#29420;&#29305;&#20107;&#20214;&#65292;AI&#23398;&#20064;&#21463;&#21040;&#25361;&#25112;&#12290;&#22312;&#26497;&#24230;&#21387;&#21147;&#19979;&#65292;&#20998;&#24067;&#24335;&#30340;&#20154;&#31867;&#20915;&#31574;&#27604;&#38598;&#20013;&#24335;&#30340;AI&#20915;&#31574;&#26356;&#20855;&#20248;&#21183;&#65292;&#32780;&#19988;&#30001;&#20110;&#24040;&#22823;&#30340;&#38169;&#35823;&#25104;&#26412;&#65292;&#36825;&#20063;&#24341;&#21457;&#20102;&#23545;&#20110;&#23439;&#35266;&#30417;&#31649;&#20013;AI&#20351;&#29992;&#30340;&#36136;&#30097;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#30001;&#20110;&#25104;&#26412;&#25928;&#30410;&#12289;&#31283;&#20581;&#24615;&#21644;&#20934;&#30830;&#24615;&#20248;&#20110;&#20154;&#31867;&#30417;&#31649;&#32773;&#65292;AI&#24456;&#21487;&#33021;&#24708;&#28982;&#21462;&#20195;&#36234;&#26469;&#36234;&#39640;&#27700;&#24179;&#30340;&#24314;&#35758;&#21644;&#20915;&#31574;&#32780;&#34987;&#24191;&#27867;&#20351;&#29992;&#12290;&#25105;&#20204;&#25552;&#20986;&#20845;&#20010;&#21028;&#26029;AI&#20351;&#29992;&#36866;&#21512;&#24615;&#30340;&#26631;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;
Artificial intelligence (AI) is making rapid inroads in financial regulations. It will benefit micro regulations, concerned with issues like consumer protection and routine banking regulations, because of ample data, short time horizons, clear objectives, and repeated decisions that leave plenty of data for AI to train on. It is different with macro regulations focused on the stability of the entire financial system. Here, infrequent and mostly unique events frustrate AI learning. Distributed human decision making in times of extreme stress has strong advantages over centralised AI decisions, which, coupled with the catastrophic cost of mistakes, raises questions about AI used in macro regulations. However, AI will likely become widely used by stealth as it takes over increasingly high level advice and decisions, driven by significant cost efficiencies, robustness and accuracy compared to human regulators. We propose six criteria against which to judge the suitability of AI use by the 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21033;&#29992;&#22823;&#35268;&#27169;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#21152;&#36895;&#25968;&#25454;&#20013;&#24515;&#30740;&#21457;&#21608;&#26399;&#30340;&#28508;&#21147;&#12290;&#36890;&#36807;&#35780;&#20272;&#25968;&#25454;&#20013;&#24515;&#30740;&#21457;&#30340;&#22522;&#26412;&#35201;&#32032;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;LLMs&#22312;&#29702;&#35299;&#39046;&#22495;&#35201;&#27714;&#12289;&#29983;&#25104;&#24819;&#27861;&#12289;&#21033;&#29992;&#24037;&#20855;&#36827;&#34892;&#23454;&#39564;&#24182;&#24212;&#23545;&#26032;&#25361;&#25112;&#31561;&#26041;&#38754;&#30340;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2310.11249</link><description>&lt;p&gt;
&#21033;&#29992;&#22823;&#35268;&#27169;&#35821;&#35328;&#27169;&#22411;&#33258;&#21160;&#28436;&#36827;&#24037;&#19994;&#25968;&#25454;&#20013;&#24515;&#30740;&#21457;&#21608;&#26399;
&lt;/p&gt;
&lt;p&gt;
Leveraging Large Language Model for Automatic Evolving of Industrial Data-Centric R&amp;D Cycle. (arXiv:2310.11249v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.11249
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21033;&#29992;&#22823;&#35268;&#27169;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#21152;&#36895;&#25968;&#25454;&#20013;&#24515;&#30740;&#21457;&#21608;&#26399;&#30340;&#28508;&#21147;&#12290;&#36890;&#36807;&#35780;&#20272;&#25968;&#25454;&#20013;&#24515;&#30740;&#21457;&#30340;&#22522;&#26412;&#35201;&#32032;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;LLMs&#22312;&#29702;&#35299;&#39046;&#22495;&#35201;&#27714;&#12289;&#29983;&#25104;&#24819;&#27861;&#12289;&#21033;&#29992;&#24037;&#20855;&#36827;&#34892;&#23454;&#39564;&#24182;&#24212;&#23545;&#26032;&#25361;&#25112;&#31561;&#26041;&#38754;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#19981;&#26029;&#36827;&#34892;&#30340;&#25968;&#23383;&#36716;&#22411;&#20013;&#65292;&#25968;&#25454;&#39537;&#21160;&#30340;&#35299;&#20915;&#26041;&#26696;&#27491;&#22312;&#25104;&#20026;&#35299;&#20915;&#21508;&#31181;&#24037;&#19994;&#20219;&#21153;&#30340;&#24378;&#22823;&#24037;&#20855;&#65292;&#22914;&#39044;&#27979;&#12289;&#24322;&#24120;&#26816;&#27979;&#12289;&#35268;&#21010;&#65292;&#29978;&#33267;&#22797;&#26434;&#30340;&#20915;&#31574;&#12290;&#34429;&#28982;&#25968;&#25454;&#20013;&#24515;&#30340;&#30740;&#21457;&#22312;&#21033;&#29992;&#36825;&#20123;&#35299;&#20915;&#26041;&#26696;&#26041;&#38754;&#36215;&#30528;&#20851;&#38190;&#20316;&#29992;&#65292;&#20294;&#22312;&#20154;&#21147;&#12289;&#35745;&#31639;&#21644;&#26102;&#38388;&#36164;&#28304;&#26041;&#38754;&#24448;&#24448;&#38656;&#35201;&#20184;&#20986;&#24040;&#22823;&#30340;&#20195;&#20215;&#12290;&#26412;&#25991;&#28145;&#20837;&#25506;&#35752;&#20102;&#22823;&#35268;&#27169;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#22312;&#21152;&#36895;&#25968;&#25454;&#20013;&#24515;&#30740;&#21457;&#30340;&#28436;&#36827;&#21608;&#26399;&#26041;&#38754;&#30340;&#28508;&#21147;&#12290;&#36890;&#36807;&#35780;&#20272;&#25968;&#25454;&#20013;&#24515;&#30740;&#21457;&#30340;&#22522;&#26412;&#35201;&#32032;&#65292;&#21253;&#25324;&#24322;&#26500;&#20219;&#21153;&#30456;&#20851;&#25968;&#25454;&#12289;&#22810;&#38754;&#21521;&#39046;&#22495;&#30693;&#35782;&#21644;&#22810;&#26679;&#21270;&#30340;&#35745;&#31639;&#21151;&#33021;&#24037;&#20855;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;LLMs&#33021;&#22815;&#22810;&#22909;&#22320;&#29702;&#35299;&#29305;&#23450;&#39046;&#22495;&#30340;&#35201;&#27714;&#65292;&#29983;&#25104;&#19987;&#19994;&#30340;&#24819;&#27861;&#65292;&#21033;&#29992;&#39046;&#22495;&#29305;&#23450;&#24037;&#20855;&#36827;&#34892;&#23454;&#39564;&#65292;&#35299;&#37322;&#32467;&#26524;&#65292;&#24182;&#34701;&#20837;&#20174;&#36807;&#21435;&#30340;&#21162;&#21147;&#20013;&#33719;&#24471;&#30340;&#30693;&#35782;&#26469;&#24212;&#23545;&#26032;&#30340;&#25361;&#25112;&#12290;&#20197;&#37327;&#21270;&#25237;&#36164;&#30740;&#31350;&#20026;&#20856;&#22411;&#20363;&#23376;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#23454;&#35777;&#30740;&#31350;&#65292;&#35777;&#26126;&#20102;LLMs&#22312;&#21152;&#36895;&#25968;&#25454;&#20013;&#24515;&#30740;&#21457;&#30340;&#28436;&#36827;&#20013;&#30340;&#28508;&#21147;&#21644;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the wake of relentless digital transformation, data-driven solutions are emerging as powerful tools to address multifarious industrial tasks such as forecasting, anomaly detection, planning, and even complex decision-making. Although data-centric R&amp;D has been pivotal in harnessing these solutions, it often comes with significant costs in terms of human, computational, and time resources. This paper delves into the potential of large language models (LLMs) to expedite the evolution cycle of data-centric R&amp;D. Assessing the foundational elements of data-centric R&amp;D, including heterogeneous task-related data, multi-facet domain knowledge, and diverse computing-functional tools, we explore how well LLMs can understand domain-specific requirements, generate professional ideas, utilize domain-specific tools to conduct experiments, interpret results, and incorporate knowledge from past endeavors to tackle new challenges. We take quantitative investment research as a typical example of indus
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;&#20840;&#38754;&#24615;&#20581;&#24247;&#25945;&#32946;&#23545;&#20010;&#20307;&#29983;&#21629;&#21608;&#26399;&#30340;&#24433;&#21709;&#65292;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#35813;&#25945;&#32946;&#25913;&#38761;&#23545;&#30007;&#24615;&#21644;&#22899;&#24615;&#20135;&#29983;&#20102;&#31215;&#26497;&#30340;&#24433;&#21709;&#65292;&#38477;&#20302;&#20102;&#24615;&#21035;&#19981;&#24179;&#31561;&#65292;&#21516;&#26102;&#20063;&#40723;&#21169;&#20102;&#19979;&#19968;&#20195;&#22899;&#24615;&#30340;&#26426;&#20250;&#21644;&#33258;&#20027;&#26435;&#12290;</title><link>http://arxiv.org/abs/2310.11151</link><description>&lt;p&gt;
&#20840;&#38754;&#24615;&#20581;&#24247;&#25945;&#32946;&#30340;&#29983;&#21629;&#21608;&#26399;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Life-Cycle Effects of Comprehensive Sex Education. (arXiv:2310.11151v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.11151
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;&#20840;&#38754;&#24615;&#20581;&#24247;&#25945;&#32946;&#23545;&#20010;&#20307;&#29983;&#21629;&#21608;&#26399;&#30340;&#24433;&#21709;&#65292;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#35813;&#25945;&#32946;&#25913;&#38761;&#23545;&#30007;&#24615;&#21644;&#22899;&#24615;&#20135;&#29983;&#20102;&#31215;&#26497;&#30340;&#24433;&#21709;&#65292;&#38477;&#20302;&#20102;&#24615;&#21035;&#19981;&#24179;&#31561;&#65292;&#21516;&#26102;&#20063;&#40723;&#21169;&#20102;&#19979;&#19968;&#20195;&#22899;&#24615;&#30340;&#26426;&#20250;&#21644;&#33258;&#20027;&#26435;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24615;&#25945;&#32946;&#21487;&#20197;&#24433;&#21709;&#23398;&#29983;&#30340;&#24615;&#34892;&#20026;&#65292;&#24182;&#20256;&#36798;&#26377;&#20851;&#23478;&#24237;&#24418;&#25104;&#21644;&#36131;&#20219;&#30340;&#31038;&#20250;&#35268;&#33539;&#65292;&#36825;&#23545;&#20182;&#20204;&#30340;&#26410;&#26469;&#20135;&#29983;&#37325;&#35201;&#24433;&#21709;&#12290;&#20026;&#20102;&#30740;&#31350;&#31038;&#20250;&#35268;&#33539;&#20256;&#36882;&#30340;&#29983;&#21629;&#21608;&#26399;&#25928;&#24212;&#65292;&#26412;&#30740;&#31350;&#21033;&#29992;&#29790;&#20856;&#23567;&#23398;40&#24180;&#20195;&#33267;50&#24180;&#20195;&#24341;&#20837;&#20840;&#38754;&#24615;&#20581;&#24247;&#25945;&#32946;&#30340;&#24773;&#20917;&#36827;&#34892;&#20102;&#35843;&#26597;&#12290;&#22312;&#36825;&#19968;&#26102;&#26399;&#65292;&#21463;&#21040;&#31038;&#20250;&#27665;&#20027;&#20215;&#20540;&#35266;&#30340;&#21551;&#21457;&#65292;&#24615;&#25945;&#32946;&#25945;&#23548;&#23398;&#29983;&#20851;&#20110;&#31105;&#27442;&#12289;&#29702;&#24615;&#30340;&#23478;&#24237;&#35745;&#21010;&#36873;&#25321;&#20197;&#21450;&#23545;&#20010;&#20154;&#20915;&#31574;&#25215;&#25285;&#31038;&#20250;&#36131;&#20219;&#30340;&#37325;&#35201;&#24615;&#12290;&#35813;&#30740;&#31350;&#36816;&#29992;&#20102;&#19968;&#31181;&#20808;&#36827;&#30340;&#8220;&#24046;&#24322;&#21644;&#24046;&#24322;&#8221;&#26041;&#27861;&#26469;&#35780;&#20272;&#30007;&#24615;&#21644;&#22899;&#24615;&#22312;&#25972;&#20010;&#29983;&#21629;&#21608;&#26399;&#20013;&#21508;&#31181;&#32467;&#26524;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#25913;&#38761;&#23545;&#30007;&#24615;&#21644;&#22899;&#24615;&#30340;&#22823;&#22810;&#25968;&#39044;&#26399;&#32467;&#26524;&#20135;&#29983;&#24433;&#21709;&#65292;&#26368;&#32456;&#38477;&#20302;&#20102;&#25910;&#20837;&#26041;&#38754;&#30340;&#24615;&#21035;&#19981;&#24179;&#31561;&#12290;&#35813;&#25913;&#38761;&#30340;&#24433;&#21709;&#20063;&#24310;&#20280;&#21040;&#20102;&#19979;&#19968;&#20195;&#22899;&#24615;&#65292;&#40723;&#21169;&#22905;&#20204;&#25317;&#26377;&#26356;&#22810;&#30340;&#26426;&#20250;&#21644;&#33258;&#20027;&#26435;&#12290;
&lt;/p&gt;
&lt;p&gt;
Sex education can impact pupils sexual activity and convey the social norms regarding family formation and responsibility, which can have significant consequences to their future. To investigate the life-cycle effects of social norm transmission, this study drew on the introduction of comprehensive sex education in the curriculum of Swedish primary schools during the 1940s to the 1950s. Inspired by social-democratic values, sex education during this period taught students about abstinence, rational family planning choices, and the importance of taking social responsibility for their personal decisions. The study applied a state-of-the-art estimator of the difference-in-differences method to various outcomes of men and women throughout the life cycle. The results showed that the reform affected most intended outcomes for men and women, ultimately decreasing gender inequality in earnings. The effects of the reform also extended to the succeding generation of girls, encouraging them to ch
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22312;&#24191;&#20041;&#26684;&#28857;&#24066;&#22330;&#20013;&#30340;&#31283;&#20581;&#20132;&#26131;&#26041;&#27861;&#65292;&#36890;&#36807;&#32771;&#34385;&#36830;&#32493;&#30456;&#20851;&#30340;&#25910;&#30410;&#21644;&#36164;&#20135;&#30456;&#20851;&#24615;&#65292;&#25552;&#20986;&#20102;&#22810;&#37325;&#32447;&#24615;&#31574;&#30053;&#12290;&#22312;&#21442;&#25968;&#24050;&#30693;&#30340;&#24773;&#20917;&#19979;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#30830;&#20445;&#29983;&#23384;&#21644;&#27010;&#29575;&#19978;&#30340;&#27491;&#24615;&#65292;&#24182;&#33021;&#22312;&#26080;&#21033;&#21487;&#22270;&#30340;&#23545;&#31216;&#26684;&#28857;&#24066;&#22330;&#20013;&#32500;&#25345;&#27491;&#26399;&#26395;&#21033;&#28070;&#12290;</title><link>http://arxiv.org/abs/2310.11023</link><description>&lt;p&gt;
&#19968;&#20010;&#24191;&#20041;&#26684;&#28857;&#24066;&#22330;&#20013;&#30340;&#31283;&#20581;&#20132;&#26131;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Robust Trading in a Generalized Lattice Market. (arXiv:2310.11023v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.11023
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22312;&#24191;&#20041;&#26684;&#28857;&#24066;&#22330;&#20013;&#30340;&#31283;&#20581;&#20132;&#26131;&#26041;&#27861;&#65292;&#36890;&#36807;&#32771;&#34385;&#36830;&#32493;&#30456;&#20851;&#30340;&#25910;&#30410;&#21644;&#36164;&#20135;&#30456;&#20851;&#24615;&#65292;&#25552;&#20986;&#20102;&#22810;&#37325;&#32447;&#24615;&#31574;&#30053;&#12290;&#22312;&#21442;&#25968;&#24050;&#30693;&#30340;&#24773;&#20917;&#19979;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#30830;&#20445;&#29983;&#23384;&#21644;&#27010;&#29575;&#19978;&#30340;&#27491;&#24615;&#65292;&#24182;&#33021;&#22312;&#26080;&#21033;&#21487;&#22270;&#30340;&#23545;&#31216;&#26684;&#28857;&#24066;&#22330;&#20013;&#32500;&#25345;&#27491;&#26399;&#26395;&#21033;&#28070;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#31283;&#20581;&#20132;&#26131;&#33539;&#24335;&#65292;&#31216;&#20026;"&#22810;&#37325;&#32447;&#24615;&#31574;&#30053;"&#65292;&#24182;&#24212;&#29992;&#20110;&#19968;&#20010;&#24191;&#20041;&#26684;&#28857;&#24066;&#22330;&#20013;&#12290;&#19982;&#22823;&#22810;&#25968;&#29616;&#26377;&#30340;&#31283;&#20581;&#20132;&#26131;&#31574;&#30053;&#19981;&#21516;&#30340;&#26159;&#65292;&#25105;&#20204;&#30340;&#26694;&#26550;&#19981;&#20877;&#23616;&#38480;&#20110;&#21333;&#20010;&#25110;&#25104;&#23545;&#36164;&#20135;&#65292;&#24182;&#19988;&#36890;&#24120;&#23558;&#36164;&#20135;&#30456;&#20851;&#24615;&#23884;&#20837;&#21040;&#20132;&#26131;&#31574;&#30053;&#26412;&#36523;&#20013;&#65292;&#32780;&#19981;&#26159;&#20316;&#20026;&#24066;&#22330;&#30340;&#22266;&#26377;&#29305;&#24449;&#12290;&#25105;&#20204;&#30340;&#24191;&#20041;&#26684;&#28857;&#24066;&#22330;&#27169;&#22411;&#36890;&#36807;&#26465;&#20214;&#27010;&#29575;&#27169;&#22411;&#21516;&#26102;&#32771;&#34385;&#36830;&#32493;&#30456;&#20851;&#30340;&#25910;&#30410;&#21644;&#36164;&#20135;&#30456;&#20851;&#24615;&#12290;&#22312;&#21442;&#25968;&#24050;&#30693;&#30340;&#27491;&#24120;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#25152;&#25552;&#20986;&#30340;&#31574;&#30053;&#33021;&#22815;&#30830;&#20445;&#29983;&#23384;&#21644;&#27010;&#29575;&#19978;&#30340;&#27491;&#24615;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#26368;&#22351;&#24773;&#20917;&#19979;&#30340;&#39044;&#26399;&#25910;&#30410;&#25439;&#22833;&#30340;&#35299;&#26512;&#34920;&#36798;&#65292;&#24182;&#35777;&#26126;&#20102;&#25152;&#25552;&#20986;&#30340;&#31574;&#30053;&#33021;&#22815;&#22312;&#30475;&#20284;&#26080;&#21033;&#21487;&#22270;&#30340;&#23545;&#31216;&#26684;&#28857;&#24066;&#22330;&#20013;&#32500;&#25345;&#27491;&#26399;&#26395;&#21033;&#28070;&#30340;&#20805;&#20998;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper introduces a novel robust trading paradigm, called \textit{multi-double linear policies}, situated within a \textit{generalized} lattice market. Distinctively, our framework departs from most existing robust trading strategies, which are predominantly limited to single or paired assets and typically embed asset correlation within the trading strategy itself, rather than as an inherent characteristic of the market. Our generalized lattice market model incorporates both serially correlated returns and asset correlation through a conditional probabilistic model. In the nominal case, where the parameters of the model are known, we demonstrate that the proposed policies ensure survivability and probabilistic positivity. We then derive an analytic expression for the worst-case expected gain-loss and prove sufficient conditions that the proposed policies can maintain a \textit{positive expected profits}, even within a seemingly nonprofitable symmetric lattice market. When the param
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#23545;&#21360;&#24230;&#20799;&#31461;&#23398;&#20064;&#33521;&#35821;&#30340;&#25945;&#32946;&#24212;&#29992;&#31243;&#24207;&#36827;&#34892;&#20102;&#22522;&#20110;&#31454;&#36187;&#30340;&#24178;&#39044;&#65292;&#20197;&#24110;&#21161;&#20182;&#20204;&#24314;&#31435;&#23398;&#20064;&#20064;&#24815;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#31454;&#36187;&#32467;&#26463;&#21518;&#30340;12&#21608;&#65292;&#27835;&#30103;&#32452;&#32487;&#32493;&#20445;&#25345;&#23545;&#24212;&#29992;&#31243;&#24207;&#30340;&#21442;&#19982;&#12290;</title><link>http://arxiv.org/abs/2310.10850</link><description>&lt;p&gt;
&#22312;&#25945;&#32946;&#25216;&#26415;&#20013;&#30340;&#25968;&#23383;&#24178;&#39044;&#21644;&#20064;&#24815;&#24418;&#25104;
&lt;/p&gt;
&lt;p&gt;
Digital interventions and habit formation in educational technology. (arXiv:2310.10850v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.10850
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#23545;&#21360;&#24230;&#20799;&#31461;&#23398;&#20064;&#33521;&#35821;&#30340;&#25945;&#32946;&#24212;&#29992;&#31243;&#24207;&#36827;&#34892;&#20102;&#22522;&#20110;&#31454;&#36187;&#30340;&#24178;&#39044;&#65292;&#20197;&#24110;&#21161;&#20182;&#20204;&#24314;&#31435;&#23398;&#20064;&#20064;&#24815;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#31454;&#36187;&#32467;&#26463;&#21518;&#30340;12&#21608;&#65292;&#27835;&#30103;&#32452;&#32487;&#32493;&#20445;&#25345;&#23545;&#24212;&#29992;&#31243;&#24207;&#30340;&#21442;&#19982;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#22312;&#32447;&#25945;&#32946;&#25216;&#26415;&#20135;&#21697;&#36234;&#26469;&#36234;&#24120;&#35265;&#65292;&#22823;&#37327;&#35777;&#25454;&#25351;&#20986;&#65292;&#23398;&#20064;&#32773;&#24448;&#24448;&#24456;&#38590;&#24314;&#31435;&#35268;&#24459;&#30340;&#23398;&#20064;&#20064;&#24815;&#24182;&#23436;&#25104;&#20182;&#20204;&#30340;&#35838;&#31243;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#38754;&#21521;&#23089;&#20048;&#21644;&#31038;&#20132;&#20114;&#21160;&#30340;&#22312;&#32447;&#20135;&#21697;&#26377;&#26102;&#22312;&#22686;&#21152;&#29992;&#25143;&#21442;&#19982;&#24230;&#21644;&#21019;&#36896;&#39057;&#32321;&#20351;&#29992;&#20064;&#24815;&#26041;&#38754;&#38750;&#24120;&#26377;&#25928;&#65292;&#21364;&#26080;&#24847;&#20013;&#23548;&#33268;&#25968;&#23383;&#19978;&#30270;&#65292;&#29305;&#21035;&#26159;&#22312;&#38738;&#23569;&#24180;&#20013;&#12290;&#22312;&#36825;&#20010;&#39033;&#30446;&#20013;&#65292;&#25105;&#20204;&#22312;&#19968;&#20010;&#29992;&#20110;&#21360;&#24230;&#20799;&#31461;&#23398;&#20064;&#33521;&#35821;&#30340;&#25945;&#32946;&#24212;&#29992;&#31243;&#24207;&#19978;&#36827;&#34892;&#20102;&#22522;&#20110;&#31454;&#36187;&#30340;&#24178;&#39044;&#65292;&#36825;&#22312;&#23089;&#20048;&#29615;&#22659;&#20013;&#24456;&#24120;&#35265;&#12290;&#22823;&#32422;&#19968;&#19975;&#21517;&#38543;&#26426;&#36873;&#25321;&#30340;&#23398;&#20064;&#32773;&#21442;&#21152;&#20102;&#19968;&#20010;&#20026;&#26399;100&#22825;&#30340;&#38405;&#35835;&#31454;&#36187;&#12290;&#22914;&#26524;&#20182;&#20204;&#22312;&#22522;&#20110;&#23398;&#20064;&#20869;&#23481;&#28040;&#32791;&#37327;&#30340;&#25490;&#34892;&#27036;&#19978;&#25490;&#21517;&#36275;&#22815;&#39640;&#65292;&#20182;&#20204;&#23558;&#36194;&#24471;&#19968;&#22871;&#23454;&#20307;&#20070;&#31821;&#20316;&#20026;&#22870;&#21697;&#12290;&#27604;&#36187;&#32467;&#26463;&#21518;&#30340;12&#21608;&#65292;&#24403;&#27835;&#30103;&#32452;&#27809;&#26377;&#39069;&#22806;&#30340;&#28608;&#21169;&#20351;&#29992;&#35813;&#24212;&#29992;&#31243;&#24207;&#26102;&#65292;&#20182;&#20204;&#32487;&#32493;&#21442;&#19982;&#20854;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
As online educational technology products have become increasingly prevalent, rich evidence indicates that learners often find it challenging to establish regular learning habits and complete their programs. Concurrently, online products geared towards entertainment and social interactions are sometimes so effective in increasing user engagement and creating frequent usage habits that they inadvertently lead to digital addiction, especially among youth. In this project, we carry out a contest-based intervention, common in the entertainment context, on an educational app for Indian children learning English. Approximately ten thousand randomly selected learners entered a 100-day reading contest. They would win a set of physical books if they ranked sufficiently high on a leaderboard based on the amount of educational content consumed. Twelve weeks after the end of the contest, when the treatment group had no additional incentives to use the app, they continued their engagement with it a
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#32508;&#21512;&#30340;&#39118;&#38505;&#31649;&#29702;&#26694;&#26550;&#65292;&#36890;&#36807;&#24212;&#29992;&#20256;&#32479;&#30340;&#39118;&#38505;&#31649;&#29702;&#20998;&#31867;&#27861;&#65292;&#35299;&#20915;&#20102;&#34987;&#24573;&#35270;&#30340;&#21306;&#22359;&#38142;&#21327;&#35758;&#39118;&#38505;&#65292;&#20174;&#32780;&#25552;&#20379;&#20102;&#19968;&#31181;&#32467;&#26500;&#21270;&#30340;&#26041;&#24335;&#26469;&#35782;&#21035;&#12289;&#34913;&#37327;&#12289;&#30417;&#25511;&#21644;&#25253;&#21578;&#36825;&#20123;&#39118;&#38505;&#12290;&#36890;&#36807;&#23454;&#38469;&#26696;&#20363;&#65292;&#23637;&#31034;&#20102;&#35813;&#26694;&#26550;&#30340;&#23454;&#29992;&#24615;&#21644;&#23454;&#26045;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2310.10797</link><description>&lt;p&gt;
&#29702;&#35299;&#21644;&#31649;&#29702;&#21306;&#22359;&#38142;&#21327;&#35758;&#39118;&#38505;
&lt;/p&gt;
&lt;p&gt;
Understanding and managing blockchain protocol risks. (arXiv:2310.10797v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.10797
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#32508;&#21512;&#30340;&#39118;&#38505;&#31649;&#29702;&#26694;&#26550;&#65292;&#36890;&#36807;&#24212;&#29992;&#20256;&#32479;&#30340;&#39118;&#38505;&#31649;&#29702;&#20998;&#31867;&#27861;&#65292;&#35299;&#20915;&#20102;&#34987;&#24573;&#35270;&#30340;&#21306;&#22359;&#38142;&#21327;&#35758;&#39118;&#38505;&#65292;&#20174;&#32780;&#25552;&#20379;&#20102;&#19968;&#31181;&#32467;&#26500;&#21270;&#30340;&#26041;&#24335;&#26469;&#35782;&#21035;&#12289;&#34913;&#37327;&#12289;&#30417;&#25511;&#21644;&#25253;&#21578;&#36825;&#20123;&#39118;&#38505;&#12290;&#36890;&#36807;&#23454;&#38469;&#26696;&#20363;&#65292;&#23637;&#31034;&#20102;&#35813;&#26694;&#26550;&#30340;&#23454;&#29992;&#24615;&#21644;&#23454;&#26045;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#21306;&#22359;&#38142;&#21327;&#35758;&#39118;&#38505;&#36825;&#19968;&#24433;&#21709;&#20998;&#24067;&#24335;&#36134;&#26412;&#25216;&#26415;&#65288;DLT&#65289;&#30340;&#22522;&#30784;&#24615;&#39118;&#38505;&#31867;&#21035;&#65292;&#35813;&#25216;&#26415;&#25903;&#25745;&#25968;&#23383;&#36164;&#20135;&#12289;&#26234;&#33021;&#21512;&#32422;&#21644;&#21435;&#20013;&#24515;&#21270;&#24212;&#29992;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#19982;&#37329;&#34701;&#26426;&#26500;&#12289;&#21306;&#22359;&#38142;&#24320;&#21457;&#22242;&#38431;&#21644;&#30417;&#31649;&#26426;&#26500;&#21512;&#20316;&#24320;&#21457;&#30340;&#32508;&#21512;&#39118;&#38505;&#31649;&#29702;&#26694;&#26550;&#65292;&#35813;&#26694;&#26550;&#24212;&#29992;&#20256;&#32479;&#30340;&#39118;&#38505;&#31649;&#29702;&#20998;&#31867;&#27861;&#26469;&#24212;&#23545;&#26576;&#20123;&#34987;&#24573;&#35270;&#30340;&#21306;&#22359;&#38142;&#21327;&#35758;&#39118;&#38505;&#12290;&#35813;&#26041;&#27861;&#25552;&#20379;&#20102;&#19968;&#31181;&#32467;&#26500;&#21270;&#30340;&#26041;&#24335;&#26469;&#35782;&#21035;&#12289;&#34913;&#37327;&#12289;&#30417;&#25511;&#21644;&#25253;&#21578;&#21306;&#22359;&#38142;&#21327;&#35758;&#39118;&#38505;&#12290;&#26412;&#25991;&#36890;&#36807;&#30495;&#23454;&#19990;&#30028;&#26696;&#20363;&#23637;&#31034;&#20102;&#25152;&#25552;&#35758;&#30340;&#26694;&#26550;&#30340;&#23454;&#29992;&#24615;&#21644;&#23454;&#26045;&#24773;&#20917;&#12290;&#36825;&#39033;&#24037;&#20316;&#30340;&#21457;&#29616;&#26377;&#21161;&#20110;&#19981;&#26029;&#21457;&#23637;&#23545;&#21306;&#22359;&#38142;&#21327;&#35758;&#39118;&#38505;&#30340;&#29702;&#35299;&#65292;&#24182;&#20026;&#37329;&#34701;&#26426;&#26500;&#37319;&#29992;DLT&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#27934;&#35265;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper addresses the issue of blockchain protocol risks, a foundational category of risks affecting Distributed Ledger Technology (DLT) which underpins digital assets, smart contracts, and decentralised applications. It presents a comprehensive risk management framework developed in collaboration with financial institutions, blockchain development teams and regulators that applies a traditional risk management taxonomy to address certain overlooked blockchain protocol risks. The approach offers a structured way to identify, measure, monitor and report blockchain protocol risks. The paper provides real-world use cases to demonstrate the practicality and implementation of the proposed framework. The findings of this work contribute to the evolving understanding of blockchain protocol risks and provide valuable insights on how these risks affect the adoption of DLT by financial institutions.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#20351;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20943;&#23569;&#20174;&#36130;&#21153;&#25253;&#21578;&#20013;&#25552;&#21462;&#20449;&#24687;&#26102;&#30340;&#38169;&#35823;&#30340;&#26041;&#27861;&#65292;&#24182;&#19988;&#36890;&#36807;&#26816;&#32034;&#22686;&#24378;&#29983;&#25104;&#25216;&#26415;&#21644;&#20803;&#25968;&#25454;&#30340;&#32467;&#21512;&#65292;&#23454;&#29616;&#20102;&#39640;&#31934;&#24230;&#30340;&#20449;&#24687;&#25552;&#21462;&#36807;&#31243;&#12290;</title><link>http://arxiv.org/abs/2310.10760</link><description>&lt;p&gt;
&#20351;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20943;&#23569;&#20174;&#36130;&#21153;&#25253;&#21578;&#20013;&#25552;&#21462;&#20449;&#24687;&#20013;&#30340;&#38169;&#35823;
&lt;/p&gt;
&lt;p&gt;
Towards reducing hallucination in extracting information from financial reports using Large Language Models. (arXiv:2310.10760v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.10760
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#20351;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20943;&#23569;&#20174;&#36130;&#21153;&#25253;&#21578;&#20013;&#25552;&#21462;&#20449;&#24687;&#26102;&#30340;&#38169;&#35823;&#30340;&#26041;&#27861;&#65292;&#24182;&#19988;&#36890;&#36807;&#26816;&#32034;&#22686;&#24378;&#29983;&#25104;&#25216;&#26415;&#21644;&#20803;&#25968;&#25454;&#30340;&#32467;&#21512;&#65292;&#23454;&#29616;&#20102;&#39640;&#31934;&#24230;&#30340;&#20449;&#24687;&#25552;&#21462;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#36130;&#21153;&#20998;&#26512;&#24072;&#26469;&#35828;&#65292;&#20844;&#21496;&#36130;&#21153;&#25253;&#21578;&#30340;&#38382;&#31572;&#65288;Q&amp;A&#65289;&#37096;&#20998;&#26159;&#36827;&#34892;&#21508;&#31181;&#20998;&#26512;&#21644;&#25237;&#36164;&#20915;&#31574;&#30340;&#20851;&#38190;&#20449;&#24687;&#12290;&#28982;&#32780;&#65292;&#20174;&#38382;&#31572;&#37096;&#20998;&#20013;&#25552;&#21462;&#26377;&#20215;&#20540;&#30340;&#35265;&#35299;&#38754;&#20020;&#30528;&#24456;&#22823;&#30340;&#25361;&#25112;&#65292;&#22240;&#20026;&#20256;&#32479;&#30340;&#26041;&#27861;&#22914;&#35814;&#32454;&#38405;&#35835;&#21644;&#35760;&#31508;&#35760;&#32570;&#20047;&#21487;&#25193;&#23637;&#24615;&#65292;&#24182;&#23481;&#26131;&#21463;&#21040;&#20154;&#20026;&#38169;&#35823;&#30340;&#24433;&#21709;&#65292;&#32780;&#20809;&#23398;&#23383;&#31526;&#35782;&#21035;&#65288;OCR&#65289;&#21644;&#31867;&#20284;&#25216;&#26415;&#22312;&#20934;&#30830;&#22788;&#29702;&#26080;&#32467;&#26500;&#21270;&#30340;&#25991;&#23383;&#36716;&#24405;&#26102;&#36935;&#21040;&#22256;&#38590;&#65292;&#24120;&#24120;&#38169;&#36807;&#39537;&#21160;&#25237;&#36164;&#32773;&#20915;&#31574;&#30340;&#24494;&#22937;&#30340;&#35821;&#35328;&#32454;&#24494;&#24046;&#21035;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#28436;&#31034;&#20102;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#39640;&#25928;&#24555;&#36895;&#22320;&#20174;&#25910;&#30410;&#25253;&#21578;&#36716;&#24405;&#20013;&#25552;&#21462;&#20449;&#24687;&#65292;&#21516;&#26102;&#36890;&#36807;&#32467;&#21512;&#26816;&#32034;&#22686;&#24378;&#29983;&#25104;&#25216;&#26415;&#20197;&#21450;&#20803;&#25968;&#25454;&#26469;&#30830;&#20445;&#39640;&#31934;&#24230;&#30340;&#36716;&#21270;&#36807;&#31243;&#65292;&#24182;&#20943;&#23569;&#20102;&#38169;&#35823;&#30340;&#21457;&#29983;&#12290;
&lt;/p&gt;
&lt;p&gt;
For a financial analyst, the question and answer (Q\&amp;A) segment of the company financial report is a crucial piece of information for various analysis and investment decisions. However, extracting valuable insights from the Q\&amp;A section has posed considerable challenges as the conventional methods such as detailed reading and note-taking lack scalability and are susceptible to human errors, and Optical Character Recognition (OCR) and similar techniques encounter difficulties in accurately processing unstructured transcript text, often missing subtle linguistic nuances that drive investor decisions. Here, we demonstrate the utilization of Large Language Models (LLMs) to efficiently and rapidly extract information from earnings report transcripts while ensuring high accuracy transforming the extraction process as well as reducing hallucination by combining retrieval-augmented generation technique as well as metadata. We evaluate the outcomes of various LLMs with and without using our pro
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#22312;&#21152;&#23494;&#36164;&#20135;&#30417;&#31649;&#20013;&#30340;&#24212;&#29992;&#65292;&#24182;&#25552;&#20986;&#20102;&#20004;&#20010;&#36129;&#29486;&#12290;&#39318;&#20808;&#65292;&#35843;&#26597;&#20102;&#23545;&#26410;&#21463;&#30417;&#31649;&#30340;&#21152;&#23494;&#36164;&#20135;&#30333;&#30382;&#20070;&#36827;&#34892;&#25991;&#26412;&#20998;&#26512;&#30340;&#29616;&#26377;&#24212;&#29992;&#65292;&#24182;&#21457;&#29616;&#20102;&#30740;&#31350;&#31354;&#30333;&#12290;&#28982;&#21518;&#65292;&#20998;&#26512;&#20102;&#27431;&#30431;&#30340;&#21152;&#23494;&#36164;&#20135;&#24066;&#22330;&#27861;&#35268;&#24341;&#20837;&#30340;&#21464;&#21270;&#65292;&#25506;&#35752;&#20102;&#22312;&#26032;&#30340;&#30417;&#31649;&#26694;&#26550;&#20869;&#25972;&#21512;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#30340;&#26426;&#36935;&#21644;&#25361;&#25112;&#12290;&#36825;&#20123;&#21457;&#29616;&#20026;&#26410;&#26469;&#30340;&#30740;&#31350;&#25552;&#20379;&#20102;&#22522;&#30784;&#65292;&#26377;&#28508;&#21147;&#20351;&#30417;&#31649;&#26426;&#26500;&#12289;&#21152;&#23494;&#36164;&#20135;&#21457;&#34892;&#32773;&#21644;&#25237;&#36164;&#32773;&#21463;&#30410;&#12290;</title><link>http://arxiv.org/abs/2310.10333</link><description>&lt;p&gt;
&#21306;&#22359;&#38142;&#36164;&#20135;&#30417;&#31649;&#30340;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#65306;&#19968;&#20221;&#36335;&#32447;&#22270;
&lt;/p&gt;
&lt;p&gt;
NLP for Crypto-Asset Regulation: A Roadmap. (arXiv:2310.10333v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.10333
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#22312;&#21152;&#23494;&#36164;&#20135;&#30417;&#31649;&#20013;&#30340;&#24212;&#29992;&#65292;&#24182;&#25552;&#20986;&#20102;&#20004;&#20010;&#36129;&#29486;&#12290;&#39318;&#20808;&#65292;&#35843;&#26597;&#20102;&#23545;&#26410;&#21463;&#30417;&#31649;&#30340;&#21152;&#23494;&#36164;&#20135;&#30333;&#30382;&#20070;&#36827;&#34892;&#25991;&#26412;&#20998;&#26512;&#30340;&#29616;&#26377;&#24212;&#29992;&#65292;&#24182;&#21457;&#29616;&#20102;&#30740;&#31350;&#31354;&#30333;&#12290;&#28982;&#21518;&#65292;&#20998;&#26512;&#20102;&#27431;&#30431;&#30340;&#21152;&#23494;&#36164;&#20135;&#24066;&#22330;&#27861;&#35268;&#24341;&#20837;&#30340;&#21464;&#21270;&#65292;&#25506;&#35752;&#20102;&#22312;&#26032;&#30340;&#30417;&#31649;&#26694;&#26550;&#20869;&#25972;&#21512;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#30340;&#26426;&#36935;&#21644;&#25361;&#25112;&#12290;&#36825;&#20123;&#21457;&#29616;&#20026;&#26410;&#26469;&#30340;&#30740;&#31350;&#25552;&#20379;&#20102;&#22522;&#30784;&#65292;&#26377;&#28508;&#21147;&#20351;&#30417;&#31649;&#26426;&#26500;&#12289;&#21152;&#23494;&#36164;&#20135;&#21457;&#34892;&#32773;&#21644;&#25237;&#36164;&#32773;&#21463;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#24555;&#36895;&#21457;&#23637;&#30340;&#21306;&#22359;&#38142;&#36164;&#20135;&#39046;&#22495;&#65292;&#30333;&#30382;&#20070;&#26159;&#25237;&#36164;&#32773;&#25351;&#23548;&#30340;&#37325;&#35201;&#25991;&#20214;&#65292;&#22312;&#27431;&#30431;&#30340;&#21152;&#23494;&#36164;&#20135;&#24066;&#22330;&#27861;&#35268;&#65288;MiCAR&#65289;&#19979;&#65292;&#23427;&#20204;&#29616;&#22312;&#38754;&#20020;&#21069;&#25152;&#26410;&#26377;&#30340;&#20869;&#23481;&#35201;&#27714;&#12290;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#21487;&#20197;&#20316;&#20026;&#20998;&#26512;&#36825;&#20123;&#25991;&#20214;&#21644;&#21327;&#21161;&#30417;&#31649;&#21512;&#35268;&#30340;&#24378;&#22823;&#24037;&#20855;&#12290;&#26412;&#25991;&#20026;&#35813;&#20027;&#39064;&#25552;&#20379;&#20102;&#20004;&#20010;&#36129;&#29486;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35843;&#26597;&#20102;&#23545;&#26410;&#21463;&#30417;&#31649;&#30340;&#21306;&#22359;&#38142;&#36164;&#20135;&#30333;&#30382;&#20070;&#36827;&#34892;&#25991;&#26412;&#20998;&#26512;&#30340;&#29616;&#26377;&#24212;&#29992;&#65292;&#21457;&#29616;&#20102;&#21487;&#20197;&#36890;&#36807;&#36328;&#23398;&#31185;&#21512;&#20316;&#26469;&#22635;&#34917;&#30740;&#31350;&#31354;&#30333;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#23545;MiCAR&#24341;&#20837;&#30340;&#21464;&#21270;&#36827;&#34892;&#20102;&#20998;&#26512;&#65292;&#31361;&#20986;&#20102;&#22312;&#26032;&#30340;&#30417;&#31649;&#26694;&#26550;&#20869;&#25972;&#21512;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#30340;&#26426;&#36935;&#21644;&#25361;&#25112;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#20026;&#36827;&#19968;&#27493;&#30340;&#30740;&#31350;&#22880;&#23450;&#20102;&#22522;&#30784;&#65292;&#24182;&#26377;&#28508;&#21147;&#20351;&#30417;&#31649;&#26426;&#26500;&#12289;&#21306;&#22359;&#38142;&#36164;&#20135;&#21457;&#34892;&#32773;&#21644;&#25237;&#36164;&#32773;&#21463;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the rapidly evolving field of crypto-assets, white papers are essential documents for investor guidance, and are now subject to unprecedented content requirements under the EU's Markets in Crypto-Assets Regulation (MiCAR). Natural Language Processing can serve as a powerful tool for both analyzing these documents and assisting in regulatory compliance. This paper delivers two contributions to the topic. First, we survey existing applications of textual analysis to unregulated crypto-asset white papers, uncovering a research gap that could be bridged with interdisciplinary collaboration. We then conduct an analysis of the changes introduced by MiCAR, highlighting the opportunities and challenges of integrating NLP within the new regulatory framework. Our findings set the stage for further research, with the potential to benefit regulators, crypto-asset issuers, and investors.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#35780;&#20272;&#20102;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#22312;&#32929;&#24066;&#20215;&#26684;&#39044;&#27979;&#20013;&#30340;&#24615;&#33021;&#65292;&#36890;&#36807;&#36873;&#25321;&#26368;&#20339;&#30340;&#25216;&#26415;&#25351;&#26631;&#32452;&#21512;&#26469;&#23454;&#29616;&#26368;&#23569;&#35823;&#24046;&#30340;&#39044;&#27979;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#19981;&#21516;&#30340;&#21253;&#35013;&#22120;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#22312;&#19981;&#21516;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#20013;&#20855;&#26377;&#19981;&#21516;&#30340;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2310.09903</link><description>&lt;p&gt;
&#35780;&#20272;&#29305;&#24449;&#36873;&#25321;&#22312;&#32929;&#24066;&#20215;&#26684;&#39044;&#27979;&#20013;&#30340;&#24615;&#33021;&#65292;&#20197;&#30830;&#23450;&#26368;&#26377;&#25928;&#30340;&#25216;&#26415;&#25351;&#26631;
&lt;/p&gt;
&lt;p&gt;
Evaluation of feature selection performance for identification of best effective technical indicators on stock market price prediction. (arXiv:2310.09903v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09903
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35780;&#20272;&#20102;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#22312;&#32929;&#24066;&#20215;&#26684;&#39044;&#27979;&#20013;&#30340;&#24615;&#33021;&#65292;&#36890;&#36807;&#36873;&#25321;&#26368;&#20339;&#30340;&#25216;&#26415;&#25351;&#26631;&#32452;&#21512;&#26469;&#23454;&#29616;&#26368;&#23569;&#35823;&#24046;&#30340;&#39044;&#27979;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#19981;&#21516;&#30340;&#21253;&#35013;&#22120;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#22312;&#19981;&#21516;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#20013;&#20855;&#26377;&#19981;&#21516;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37492;&#20110;&#25216;&#26415;&#25351;&#26631;&#23545;&#32929;&#24066;&#39044;&#27979;&#30340;&#24433;&#21709;&#65292;&#29305;&#24449;&#36873;&#25321;&#23545;&#36873;&#25321;&#26368;&#20339;&#25351;&#26631;&#33267;&#20851;&#37325;&#35201;&#12290;&#19968;&#31181;&#32771;&#34385;&#22312;&#29305;&#24449;&#36873;&#25321;&#36807;&#31243;&#20013;&#27169;&#22411;&#24615;&#33021;&#30340;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#26159;&#21253;&#35013;&#22120;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#36890;&#36807;&#29305;&#24449;&#36873;&#25321;&#37492;&#23450;&#20986;&#26368;&#23569;&#35823;&#24046;&#30340;&#39044;&#27979;&#32929;&#24066;&#20215;&#26684;&#30340;&#26368;&#20339;&#32929;&#24066;&#25351;&#26631;&#32452;&#21512;&#12290;&#20026;&#35780;&#20272;&#21253;&#35013;&#22120;&#29305;&#24449;&#36873;&#25321;&#25216;&#26415;&#23545;&#32929;&#24066;&#39044;&#27979;&#30340;&#24433;&#21709;&#65292;&#26412;&#25991;&#22312;&#36807;&#21435;10&#24180;&#33529;&#26524;&#20844;&#21496;&#30340;&#25968;&#25454;&#19978;&#20351;&#29992;&#20102;10&#20010;&#35780;&#20272;&#22120;&#21644;123&#20010;&#25216;&#26415;&#25351;&#26631;&#36827;&#34892;&#20102;SFS&#21644;SBS&#30340;&#32771;&#23519;&#12290;&#27492;&#22806;&#65292;&#36890;&#36807;&#25552;&#20986;&#30340;&#26041;&#27861;&#65292;&#23558;&#30001;3&#22825;&#26102;&#38388;&#31383;&#21475;&#21019;&#24314;&#30340;&#25968;&#25454;&#36716;&#21270;&#20026;&#36866;&#29992;&#20110;&#22238;&#24402;&#26041;&#27861;&#30340;&#36755;&#20837;&#12290;&#20174;&#35266;&#23519;&#32467;&#26524;&#21487;&#20197;&#24471;&#20986;&#65306;&#65288;1&#65289;&#27599;&#31181;&#21253;&#35013;&#22120;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#22312;&#19981;&#21516;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#20013;&#20855;&#26377;&#19981;&#21516;&#30340;&#32467;&#26524;&#65292;&#27599;&#31181;&#26041;&#27861;&#22312;&#19981;&#21516;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#19978;&#20063;&#26377;&#25152;&#19981;&#21516;&#12290;
&lt;/p&gt;
&lt;p&gt;
Due to the influence of many factors, including technical indicators on stock market prediction, feature selection is important to choose the best indicators. One of the feature selection methods that consider the performance of models during feature selection is the wrapper feature selection method. The aim of this research is to identify a combination of the best stock market indicators through feature selection to predict the stock market price with the least error. In order to evaluate the impact of wrapper feature selection techniques on stock market prediction, in this paper SFS and SBS with 10 estimators and 123 technical indicators have been examined on the last 10 years of Apple Company. Also, by the proposed method, the data created by the 3-day time window were converted to the appropriate input for regression methods. Based on the results observed: (1) Each wrapper feature selection method has different results with different machine learning methods, and each method is mor
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35752;&#35770;&#20102;&#31185;&#23398;&#30740;&#31350;&#21644;&#31454;&#20105;&#32972;&#26223;&#19979;&#21331;&#36234;&#30340;&#27010;&#24565;&#12290;</title><link>http://arxiv.org/abs/2310.09588</link><description>&lt;p&gt;
"&#20851;&#20110;&#31185;&#23398;&#21331;&#36234;&#19982;&#31454;&#20105;&#30340;&#35770;&#25991;"
&lt;/p&gt;
&lt;p&gt;
\"Uber wissenschaftliche Exzellenz und Wettbewerb. (arXiv:2310.09588v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09588
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#31185;&#23398;&#30740;&#31350;&#21644;&#31454;&#20105;&#32972;&#26223;&#19979;&#21331;&#36234;&#30340;&#27010;&#24565;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36861;&#27714;&#21331;&#36234;&#20284;&#20046;&#26159;&#23398;&#26415;&#30028;&#30340;&#30495;&#27491;&#30446;&#26631;&#12290;&#21331;&#36234;&#26159;&#20160;&#20040;&#24847;&#24605;&#65311;&#33021;&#21542;&#34913;&#37327;&#21331;&#36234;&#65311;&#26412;&#25991;&#35752;&#35770;&#20102;&#22312;&#30740;&#31350;&#21644;&#31454;&#20105;&#30340;&#32972;&#26223;&#19979;&#21331;&#36234;&#30340;&#27010;&#24565;&#12290;
&lt;/p&gt;
&lt;p&gt;
The pursuit of excellence seems to be the True North of academia. What is meant by excellence? Can excellence be measured? This article discusses the concept of excellence in the context of research and competition.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#38024;&#23545;&#20844;&#21496;&#20538;&#21048;&#24066;&#22330;&#30340;&#27969;&#21160;&#24615;&#24314;&#27169;&#26041;&#27861;&#65292;&#25552;&#20986;&#20102;&#24494;&#35266;&#20215;&#26684;&#21644;&#20844;&#24179;&#36716;&#35753;&#20215;&#26684;&#30340;&#27010;&#24565;&#65292;&#29992;&#20110;&#35299;&#20915;&#24066;&#22330;&#19981;&#27969;&#21160;&#25110;&#36235;&#20110;&#21333;&#36793;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2309.04216</link><description>&lt;p&gt;
&#22312;&#20844;&#21496;&#20538;&#21048;&#24066;&#22330;&#20013;&#24314;&#27169;&#27969;&#21160;&#24615;&#65306;&#20215;&#26684;&#35843;&#25972;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Modeling liquidity in corporate bond markets: applications to price adjustments. (arXiv:2309.04216v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04216
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#38024;&#23545;&#20844;&#21496;&#20538;&#21048;&#24066;&#22330;&#30340;&#27969;&#21160;&#24615;&#24314;&#27169;&#26041;&#27861;&#65292;&#25552;&#20986;&#20102;&#24494;&#35266;&#20215;&#26684;&#21644;&#20844;&#24179;&#36716;&#35753;&#20215;&#26684;&#30340;&#27010;&#24565;&#65292;&#29992;&#20110;&#35299;&#20915;&#24066;&#22330;&#19981;&#27969;&#21160;&#25110;&#36235;&#20110;&#21333;&#36793;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20026;&#25237;&#36164;&#32452;&#21512;&#20998;&#37197;&#20215;&#20540;&#26102;&#65292;&#36890;&#24120;&#20351;&#29992;&#29616;&#26102;&#20215;&#26684;&#12290;&#28982;&#32780;&#65292;&#24403;&#35777;&#21048;&#19981;&#22815;&#27969;&#21160;&#26102;&#24212;&#22914;&#20309;&#22788;&#29702;&#65311;&#24403;&#20132;&#26131;&#20215;&#26684;&#31232;&#32570;&#26102;&#65292;&#22914;&#20309;&#21033;&#29992;&#20854;&#20182;&#21487;&#29992;&#30340;&#23454;&#26102;&#20449;&#24687;&#65311;&#22312;&#26412;&#19987;&#27880;&#20110;&#20844;&#21496;&#20538;&#21048;&#30340;&#25991;&#31456;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;&#26368;&#36817;&#22312;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#25991;&#29486;&#20013;&#24341;&#20837;&#30340;&#24494;&#35266;&#20215;&#26684;&#27010;&#24565;&#30340;&#25299;&#23637;&#65292;&#24182;&#21442;&#32771;&#20102;&#26368;&#36817;&#26377;&#20851;&#22330;&#22806;&#24066;&#22330;&#20570;&#24066;&#30340;&#25991;&#29486;&#20013;&#30340;&#24605;&#24819;&#65292;&#26469;&#22238;&#31572;&#36825;&#20123;&#38382;&#39064;&#12290;&#20026;&#20102;&#35299;&#20915;&#22330;&#22806;&#24066;&#22330;&#20013;&#30340;&#27969;&#21160;&#24615;&#19981;&#24179;&#34913;&#38382;&#39064;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#19968;&#31181;&#22522;&#20110;Markov&#35843;&#21046;&#27850;&#26494;&#36807;&#31243;&#30340;&#26032;&#26041;&#27861;&#12290;&#38500;&#20102;&#23558;&#24494;&#35266;&#20215;&#26684;&#27010;&#24565;&#25512;&#24191;&#21040;&#20844;&#21496;&#20538;&#21048;&#39046;&#22495;&#20043;&#22806;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20844;&#24179;&#36716;&#35753;&#20215;&#26684;&#30340;&#26032;&#27010;&#24565;&#65292;&#35813;&#27010;&#24565;&#21487;&#20197;&#29992;&#20110;&#22312;&#24066;&#22330;&#19981;&#22815;&#27969;&#21160;&#21644;/&#25110;&#36235;&#21521;&#20110;&#21333;&#36793;&#30340;&#24773;&#20917;&#19979;&#20844;&#27491;&#22320;&#35780;&#20272;&#25110;&#36716;&#35753;&#35777;&#21048;&#12290;
&lt;/p&gt;
&lt;p&gt;
To assign a value to a portfolio, it is common to use Mark-to-Market prices. But how to proceed when the securities are illiquid? When transaction prices are scarce, how to use other available real-time information? In this article dedicated to corporate bonds, we address these questions using an extension of the concept of micro-price recently introduced for assets exchanged on limit order books in the market microstructure literature and ideas coming from the recent literature on OTC market making. To account for liquidity imbalances in OTC markets, we use a novel approach based on Markov-modulated Poisson processes. Beyond an extension to corporate bonds of the concept of micro-price, we coin the new concept of Fair Transfer Price that can be used to value or transfer securities in a fair manner even when the market is illiquid and/or tends to be one-sided.
&lt;/p&gt;</description></item><item><title>DeepVol&#26159;&#19968;&#31181;&#29992;&#20110;&#36890;&#29992;&#36164;&#20135;&#27874;&#21160;&#24615;&#24314;&#27169;&#30340;&#28145;&#24230;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#19968;&#20010;&#36890;&#29992;&#27169;&#22411;&#26377;&#25928;&#22320;&#25429;&#25417;&#21644;&#24314;&#27169;&#25152;&#26377;&#37329;&#34701;&#36164;&#20135;&#30340;&#27874;&#21160;&#24615;&#21160;&#24577;&#65292;&#21487;&#33021;&#25913;&#21464;&#23545;&#27874;&#21160;&#24615;&#30340;&#29702;&#35299;&#21644;&#39044;&#27979;&#26041;&#24335;&#12290;</title><link>http://arxiv.org/abs/2309.02072</link><description>&lt;p&gt;
DeepVol&#65306;&#19968;&#31181;&#29992;&#20110;&#36890;&#29992;&#36164;&#20135;&#27874;&#21160;&#24615;&#24314;&#27169;&#30340;&#28145;&#24230;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
DeepVol: A Deep Transfer Learning Approach for Universal Asset Volatility Modeling. (arXiv:2309.02072v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.02072
&lt;/p&gt;
&lt;p&gt;
DeepVol&#26159;&#19968;&#31181;&#29992;&#20110;&#36890;&#29992;&#36164;&#20135;&#27874;&#21160;&#24615;&#24314;&#27169;&#30340;&#28145;&#24230;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#19968;&#20010;&#36890;&#29992;&#27169;&#22411;&#26377;&#25928;&#22320;&#25429;&#25417;&#21644;&#24314;&#27169;&#25152;&#26377;&#37329;&#34701;&#36164;&#20135;&#30340;&#27874;&#21160;&#24615;&#21160;&#24577;&#65292;&#21487;&#33021;&#25913;&#21464;&#23545;&#27874;&#21160;&#24615;&#30340;&#29702;&#35299;&#21644;&#39044;&#27979;&#26041;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#28145;&#24230;&#23398;&#20064;&#27874;&#21160;&#24615;&#27169;&#22411;DeepVol&#65292;&#23427;&#22312;&#27169;&#22411;&#30340;&#24191;&#27867;&#24615;&#26041;&#38754;&#20248;&#20110;&#20256;&#32479;&#30340;&#35745;&#37327;&#32463;&#27982;&#27169;&#22411;&#12290;DeepVol&#21033;&#29992;&#36801;&#31227;&#23398;&#20064;&#30340;&#33021;&#21147;&#65292;&#36890;&#36807;&#19968;&#20010;&#36890;&#29992;&#27169;&#22411;&#26377;&#25928;&#22320;&#25429;&#25417;&#21644;&#24314;&#27169;&#25152;&#26377;&#37329;&#34701;&#36164;&#20135;&#30340;&#27874;&#21160;&#24615;&#21160;&#24577;&#65292;&#21253;&#25324;&#20197;&#21069;&#26410;&#35265;&#36807;&#30340;&#36164;&#20135;&#12290;&#36825;&#19982;&#35745;&#37327;&#32463;&#27982;&#23398;&#25991;&#29486;&#20013;&#30340;&#20027;&#27969;&#20570;&#27861;&#24418;&#25104;&#40092;&#26126;&#23545;&#27604;&#65292;&#21518;&#32773;&#38656;&#35201;&#20026;&#19981;&#21516;&#25968;&#25454;&#38598;&#35757;&#32451;&#21333;&#29420;&#30340;&#27169;&#22411;&#12290;&#24341;&#20837;DeepVol&#20026;&#37329;&#34701;&#34892;&#19994;&#30340;&#27874;&#21160;&#24615;&#24314;&#27169;&#21644;&#39044;&#27979;&#24320;&#36767;&#20102;&#26032;&#30340;&#36884;&#24452;&#65292;&#21487;&#33021;&#20250;&#25913;&#21464;&#23545;&#27874;&#21160;&#24615;&#30340;&#29702;&#35299;&#21644;&#39044;&#27979;&#26041;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper introduces DeepVol, a promising new deep learning volatility model that outperforms traditional econometric models in terms of model generality. DeepVol leverages the power of transfer learning to effectively capture and model the volatility dynamics of all financial assets, including previously unseen ones, using a single universal model. This contrasts to the prevailing practice in econometrics literature, which necessitates training separate models for individual datasets. The introduction of DeepVol opens up new avenues for volatility modeling and forecasting in the finance industry, potentially transforming the way volatility is understood and predicted.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#37327;&#21270;&#21160;&#24577;&#29615;&#22659;&#20013;&#19981;&#30830;&#23450;&#24615;&#20256;&#25773;&#30340;&#26694;&#26550;&#12290;&#23427;&#23450;&#20041;&#20102;&#19987;&#38376;&#38024;&#23545;&#26377;&#38480;&#26102;&#38388;&#27573;&#20869;&#30340;&#31163;&#25955;&#38543;&#26426;&#36807;&#31243;&#32780;&#35774;&#35745;&#30340;&#21160;&#24577;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#65292;&#20197;&#25429;&#25417;&#22260;&#32469;&#38543;&#26426;&#36807;&#31243;&#21644;&#27169;&#22411;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#35770;&#25991;&#36824;&#25506;&#35752;&#20102;&#23548;&#33268;&#21160;&#24577;&#31283;&#20581;&#39118;&#38505;&#24230;&#37327;&#30340;&#19968;&#20123;&#24050;&#30693;&#24615;&#36136;&#30340;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#30340;&#26465;&#20214;&#65292;&#24182;&#21457;&#29616;&#30001;$f$-divergences&#24341;&#36215;&#30340;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#23548;&#33268;&#36739;&#24378;&#30340;&#26102;&#38388;&#19968;&#33268;&#24615;&#12290;</title><link>http://arxiv.org/abs/2308.12856</link><description>&lt;p&gt;
&#19981;&#30830;&#23450;&#24615;&#20256;&#25773;&#21644;&#21160;&#24577;&#31283;&#20581;&#39118;&#38505;&#24230;&#37327;
&lt;/p&gt;
&lt;p&gt;
Uncertainty Propagation and Dynamic Robust Risk Measures. (arXiv:2308.12856v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.12856
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#37327;&#21270;&#21160;&#24577;&#29615;&#22659;&#20013;&#19981;&#30830;&#23450;&#24615;&#20256;&#25773;&#30340;&#26694;&#26550;&#12290;&#23427;&#23450;&#20041;&#20102;&#19987;&#38376;&#38024;&#23545;&#26377;&#38480;&#26102;&#38388;&#27573;&#20869;&#30340;&#31163;&#25955;&#38543;&#26426;&#36807;&#31243;&#32780;&#35774;&#35745;&#30340;&#21160;&#24577;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#65292;&#20197;&#25429;&#25417;&#22260;&#32469;&#38543;&#26426;&#36807;&#31243;&#21644;&#27169;&#22411;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#35770;&#25991;&#36824;&#25506;&#35752;&#20102;&#23548;&#33268;&#21160;&#24577;&#31283;&#20581;&#39118;&#38505;&#24230;&#37327;&#30340;&#19968;&#20123;&#24050;&#30693;&#24615;&#36136;&#30340;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#30340;&#26465;&#20214;&#65292;&#24182;&#21457;&#29616;&#30001;$f$-divergences&#24341;&#36215;&#30340;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#23548;&#33268;&#36739;&#24378;&#30340;&#26102;&#38388;&#19968;&#33268;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#29992;&#20110;&#37327;&#21270;&#21160;&#24577;&#29615;&#22659;&#20013;&#19981;&#30830;&#23450;&#24615;&#20256;&#25773;&#30340;&#26694;&#26550;&#12290;&#20855;&#20307;&#22320;&#65292;&#25105;&#20204;&#23450;&#20041;&#20102;&#19987;&#38376;&#38024;&#23545;&#26377;&#38480;&#26102;&#38388;&#27573;&#20869;&#30340;&#31163;&#25955;&#38543;&#26426;&#36807;&#31243;&#32780;&#35774;&#35745;&#30340;&#21160;&#24577;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#12290;&#36825;&#20123;&#21160;&#24577;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#25429;&#25417;&#20102;&#22260;&#32469;&#38543;&#26426;&#36807;&#31243;&#21644;&#27169;&#22411;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#21253;&#25324;&#20998;&#24067;&#27169;&#31946;&#31561;&#22240;&#32032;&#12290;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#30340;&#20363;&#23376;&#21253;&#25324;&#30001;Wasserstein&#36317;&#31163;&#21644;$f$-divergences&#24341;&#36215;&#30340;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#23558;&#21160;&#24577;&#31283;&#20581;&#39118;&#38505;&#24230;&#37327;&#23450;&#20041;&#20026;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#20869;&#25152;&#26377;&#20505;&#36873;&#39118;&#38505;&#30340;&#19978;&#30830;&#30028;&#12290;&#25105;&#20204;&#20197;&#20844;&#29702;&#21270;&#30340;&#26041;&#24335;&#35752;&#35770;&#20102;&#23548;&#33268;&#21160;&#24577;&#31283;&#20581;&#39118;&#38505;&#24230;&#37327;&#30340;&#19968;&#20123;&#24050;&#30693;&#24615;&#36136;&#65288;&#22914;&#20984;&#24615;&#21644;&#19968;&#33268;&#24615;&#65289;&#30340;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#30340;&#26465;&#20214;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#35752;&#35770;&#20102;&#23548;&#33268;&#31283;&#20581;&#21160;&#24577;&#39118;&#38505;&#24230;&#37327;&#26102;&#38388;&#19968;&#33268;&#24615;&#30340;&#21160;&#24577;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#29305;&#24615;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#30001;$f$-divergences&#24341;&#36215;&#30340;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#23548;&#33268;&#36739;&#24378;&#30340;&#26102;&#38388;&#19968;&#33268;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a framework for quantifying propagation of uncertainty arising in a dynamic setting. Specifically, we define dynamic uncertainty sets designed explicitly for discrete stochastic processes over a finite time horizon. These dynamic uncertainty sets capture the uncertainty surrounding stochastic processes and models, accounting for factors such as distributional ambiguity. Examples of uncertainty sets include those induced by the Wasserstein distance and $f$-divergences.  We further define dynamic robust risk measures as the supremum of all candidates' risks within the uncertainty set. In an axiomatic way, we discuss conditions on the uncertainty sets that lead to well-known properties of dynamic robust risk measures, such as convexity and coherence. Furthermore, we discuss the necessary and sufficient properties of dynamic uncertainty sets that lead to time-consistencies of robust dynamic risk measures. We find that uncertainty sets stemming from $f$-divergences lead to stro
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#20123;&#22269;&#23478;&#27861;&#24459;&#23545;&#39640;&#21033;&#24687;&#36151;&#27454;&#30340;&#38480;&#21046;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#25193;&#23637;&#38480;&#21046;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#35777;&#26126;&#36825;&#20010;&#25193;&#23637;&#19982;&#19968;&#32452;&#33258;&#28982;&#20844;&#29702;&#30456;&#19968;&#33268;&#12290;</title><link>http://arxiv.org/abs/2307.08861</link><description>&lt;p&gt;
&#19968;&#39033;&#25918;&#36151;&#27861;&#24459;&#65306;&#19968;&#20010;&#28548;&#28165;
&lt;/p&gt;
&lt;p&gt;
A usury law: a clarification. (arXiv:2307.08861v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.08861
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#20123;&#22269;&#23478;&#27861;&#24459;&#23545;&#39640;&#21033;&#24687;&#36151;&#27454;&#30340;&#38480;&#21046;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#25193;&#23637;&#38480;&#21046;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#35777;&#26126;&#36825;&#20010;&#25193;&#23637;&#19982;&#19968;&#32452;&#33258;&#28982;&#20844;&#29702;&#30456;&#19968;&#33268;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#20123;&#22269;&#23478;&#30340;&#22269;&#23478;&#27861;&#24459;&#31105;&#27490;&#20197;&#39640;&#21033;&#24687;&#36151;&#27454;&#12290;&#22823;&#22810;&#25968;&#22269;&#23478;&#38480;&#21046;&#26377;&#25928;&#21033;&#29575;&#65288;&#32780;&#19981;&#20165;&#20165;&#26159;&#21517;&#20041;&#21033;&#29575;&#65289;&#65292;&#20854;&#20013;&#21253;&#25324;&#25152;&#26377;&#21487;&#33021;&#19982;&#36151;&#27454;&#30456;&#20851;&#30340;&#20323;&#37329;&#21644;&#36153;&#29992;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#23545;&#20110;&#29616;&#37329;&#27969;&#27809;&#26377;&#20869;&#37096;&#22238;&#25253;&#29575;&#30340;&#36151;&#27454;&#65292;&#38480;&#21046;&#19981;&#26126;&#30830;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#23558;&#27492;&#38480;&#21046;&#25193;&#23637;&#21040;&#25152;&#26377;&#36151;&#27454;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#23384;&#22312;&#19968;&#20010;&#29420;&#29305;&#30340;&#25193;&#23637;&#65292;&#19982;&#19968;&#32452;&#33258;&#28982;&#20844;&#29702;&#19968;&#33268;&#12290;
&lt;/p&gt;
&lt;p&gt;
The national legislation of some countries prohibits lending money at a usurious interest rate. Most countries restrict the effective (rather than nominal) interest rate, which includes all commissions and fees that may come with a loan. In this case, the restriction is vague for loans whose cash flow steams have no internal rate of return. In this note, we show how to extend this restriction to all loans. We prove that there is a unique such extension consistent with a set of natural axioms.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;&#22810;&#20803;&#27010;&#29575;CRPS&#23398;&#20064;&#26041;&#27861;&#65292;&#24212;&#29992;&#20110;&#26085;&#21069;&#30005;&#20215;&#39044;&#27979;&#20013;&#65292;&#30456;&#27604;&#20110;&#32479;&#19968;&#32452;&#21512;&#22312;CRPS&#26041;&#38754;&#21462;&#24471;&#20102;&#26174;&#33879;&#25913;&#36827;&#12290;</title><link>http://arxiv.org/abs/2303.10019</link><description>&lt;p&gt;
&#22810;&#20803;&#27010;&#29575;CRPS&#23398;&#20064;&#21450;&#20854;&#22312;&#26085;&#21069;&#30005;&#20215;&#39044;&#27979;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Multivariate Probabilistic CRPS Learning with an Application to Day-Ahead Electricity Prices. (arXiv:2303.10019v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10019
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;&#22810;&#20803;&#27010;&#29575;CRPS&#23398;&#20064;&#26041;&#27861;&#65292;&#24212;&#29992;&#20110;&#26085;&#21069;&#30005;&#20215;&#39044;&#27979;&#20013;&#65292;&#30456;&#27604;&#20110;&#32479;&#19968;&#32452;&#21512;&#22312;CRPS&#26041;&#38754;&#21462;&#24471;&#20102;&#26174;&#33879;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#32771;&#34385;&#20998;&#20301;&#25968;&#21644;&#21327;&#21464;&#37327;&#20381;&#36182;&#20851;&#31995;&#30340;&#22810;&#20803;&#27010;&#29575;&#39044;&#27979;&#30340;&#32467;&#21512;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#24179;&#28369;&#36807;&#31243;&#20801;&#35768;&#22312;&#32447;&#23398;&#20064;&#12290;&#36890;&#36807;&#32500;&#25968;&#38477;&#20302;&#21644;&#32602;&#20989;&#25968;&#24179;&#28369;&#31561;&#20004;&#31181;&#24179;&#28369;&#26041;&#27861;&#26469;&#23558;&#26631;&#20934;CRPS&#23398;&#20064;&#26694;&#26550;&#25512;&#24191;&#21040;&#22810;&#20803;&#32500;&#24230;&#20013;&#12290;&#23558;&#35813;&#26041;&#27861;&#24212;&#29992;&#20110;&#39044;&#27979;&#26085;&#21069;&#30005;&#20215;&#65292;&#30456;&#27604;&#20110;&#32479;&#19968;&#32452;&#21512;&#65292;&#22312;CRPS&#26041;&#38754;&#21462;&#24471;&#20102;&#26174;&#33879;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a new method for combining (or aggregating or ensembling) multivariate probabilistic forecasts, taking into account dependencies between quantiles and covariates through a smoothing procedure that allows for online learning. Two smoothing methods are discussed: dimensionality reduction using Basis matrices and penalized smoothing. The new online learning algorithm generalizes the standard CRPS learning framework into multivariate dimensions. It is based on Bernstein Online Aggregation (BOA) and yields optimal asymptotic learning properties. We provide an in-depth discussion on possible extensions of the algorithm and several nested cases related to the existing literature on online forecast combination. The methodology is applied to forecasting day-ahead electricity prices, which are 24-dimensional distributional forecasts. The proposed method yields significant improvements over uniform combination in terms of continuous ranked probability score (CRPS). We discuss 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#24555;&#36895;&#24182;&#34892;&#31639;&#27861;&#26469;&#35299;&#20915;&#32654;&#24335;&#26399;&#26435;&#23450;&#20215;&#38382;&#39064;&#65292;&#22312;&#20108;&#39033;&#24335;&#12289;&#19977;&#39033;&#24335;&#21644;Black-Scholes-Merton&#27169;&#22411;&#20013;&#65292;&#31639;&#27861;&#30340;&#36816;&#34892;&#26102;&#38388;&#26174;&#33879;&#20248;&#20110;&#29616;&#26377;&#31639;&#27861;&#65292;&#24182;&#19988;&#22312;&#23454;&#38469;&#20013;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#24615;&#33021;&#25552;&#21319;&#12290;</title><link>http://arxiv.org/abs/2303.02317</link><description>&lt;p&gt;
&#20351;&#29992;&#38750;&#32447;&#24615;&#27169;&#26495;&#30340;&#24555;&#36895;&#32654;&#24335;&#26399;&#26435;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
Fast American Option Pricing using Nonlinear Stencils. (arXiv:2303.02317v2 [cs.CE] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.02317
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#24555;&#36895;&#24182;&#34892;&#31639;&#27861;&#26469;&#35299;&#20915;&#32654;&#24335;&#26399;&#26435;&#23450;&#20215;&#38382;&#39064;&#65292;&#22312;&#20108;&#39033;&#24335;&#12289;&#19977;&#39033;&#24335;&#21644;Black-Scholes-Merton&#27169;&#22411;&#20013;&#65292;&#31639;&#27861;&#30340;&#36816;&#34892;&#26102;&#38388;&#26174;&#33879;&#20248;&#20110;&#29616;&#26377;&#31639;&#27861;&#65292;&#24182;&#19988;&#22312;&#23454;&#38469;&#20013;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#24615;&#33021;&#25552;&#21319;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#20108;&#39033;&#24335;&#12289;&#19977;&#39033;&#24335;&#21644;Black-Scholes-Merton&#27169;&#22411;&#30340;&#26399;&#26435;&#23450;&#20215;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#22312;&#20108;&#39033;&#24335;&#21644;&#19977;&#39033;&#24335;&#27169;&#22411;&#19979;&#30340;&#32654;&#24335;&#35748;&#36141;&#26399;&#26435;&#23450;&#20215;&#20197;&#21450;&#22312;Black-Scholes-Merton&#27169;&#22411;&#19979;&#30340;&#32654;&#24335;&#35748;&#27837;&#26399;&#26435;&#23450;&#20215;&#30340;&#24555;&#36895;&#24182;&#34892;&#31163;&#25955;&#26102;&#38388;&#26377;&#38480;&#24046;&#20998;&#31639;&#27861;&#12290;&#23545;&#20110;$T$&#27493;&#26377;&#38480;&#24046;&#20998;&#65292;&#27599;&#20010;&#31639;&#27861;&#22312;$p$&#20010;&#22788;&#29702;&#26680;&#24515;&#19978;&#22312;&#36138;&#23146;&#35843;&#24230;&#22120;&#19979;&#36816;&#34892;&#26102;&#38388;&#20026;$O(\left(T\log^2{T}\right)/p + T)$&#65292;&#36825;&#27604;&#30456;&#24212;&#30340;&#26368;&#20808;&#36827;&#24182;&#34892;&#31639;&#27861;&#25152;&#33457;&#36153;&#30340;$\Theta({T^2}/{p}) + \Omega(T\log{T})$&#26102;&#38388;&#26174;&#33879;&#25913;&#36827;&#12290;&#21363;&#20351;&#22312;&#21333;&#26680;&#24515;&#19978;&#36816;&#34892;&#65292;&#25105;&#20204;&#30340;&#31639;&#27861;&#25152;&#33457;&#36153;&#30340;$O(T\log^2{T})$&#26102;&#38388;&#22312;&#28176;&#36827;&#19978;&#36828;&#23567;&#20110;&#26368;&#24555;&#24050;&#30693;&#20018;&#34892;&#31639;&#27861;&#30340;$\Theta(T^2)$&#36816;&#34892;&#26102;&#38388;&#12290;&#25105;&#20204;&#31639;&#27861;&#30340;&#23454;&#29616;&#22312;&#23454;&#38469;&#20013;&#26126;&#26174;&#20248;&#20110;&#29616;&#26377;&#31639;&#27861;&#30340;&#26368;&#24555;&#23454;&#29616;&#65292;&#20363;&#22914;&#65292;&#22312;48&#26680;&#24515;&#26426;&#22120;&#19978;&#36816;&#34892;$T \approx 1000$&#27493;&#26102;&#65292;&#25105;&#20204;&#30340;&#20108;&#39033;&#24335;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the binomial, trinomial, and Black-Scholes-Merton models of option pricing. We present fast parallel discrete-time finite-difference algorithms for American call option pricing under the binomial and trinomial models and American put option pricing under the Black-Scholes-Merton model. For $T$-step finite differences, each algorithm runs in $O(\left(T\log^2{T}\right)/p + T)$ time under a greedy scheduler on $p$ processing cores, which is a significant improvement over the $\Theta({T^2}/{p}) + \Omega(T\log{T})$ time taken by the corresponding state-of-the-art parallel algorithm. Even when run on a single core, the $O(T\log^2{T})$ time taken by our algorithms is asymptotically much smaller than the $\Theta(T^2)$ running time of the fastest known serial algorithms. Implementations of our algorithms significantly outperform the fastest implementations of existing algorithms in practice, e.g., when run for $T \approx 1000$ steps on a 48-core machine, our algorithm for the binomial 
&lt;/p&gt;</description></item><item><title>&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#65288;LSTM&#65289;&#21644;&#23454;&#29616;&#27874;&#21160;&#29575;&#27979;&#37327;&#30340;&#26032;&#26694;&#26550;&#33021;&#22815;&#20849;&#21516;&#24314;&#27169;&#25910;&#30410;&#21644;&#23454;&#29616;&#27874;&#21160;&#29575;&#27979;&#37327;&#65292;&#22312;&#32479;&#35745;&#25512;&#26029;&#21644;&#39044;&#27979;&#26041;&#38754;&#20855;&#26377;&#20986;&#33394;&#30340;&#24615;&#33021;&#65292;&#24182;&#19988;&#33021;&#22815;&#36866;&#24212;&#27874;&#21160;&#29575;&#30340;&#23450;&#24335;&#20107;&#23454;&#12290;</title><link>http://arxiv.org/abs/2302.08002</link><description>&lt;p&gt;
&#28145;&#24230;&#23398;&#20064;&#22686;&#24378;&#30340;&#23454;&#29616;GARCH&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Deep Learning Enhanced Realized GARCH. (arXiv:2302.08002v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.08002
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#65288;LSTM&#65289;&#21644;&#23454;&#29616;&#27874;&#21160;&#29575;&#27979;&#37327;&#30340;&#26032;&#26694;&#26550;&#33021;&#22815;&#20849;&#21516;&#24314;&#27169;&#25910;&#30410;&#21644;&#23454;&#29616;&#27874;&#21160;&#29575;&#27979;&#37327;&#65292;&#22312;&#32479;&#35745;&#25512;&#26029;&#21644;&#39044;&#27979;&#26041;&#38754;&#20855;&#26377;&#20986;&#33394;&#30340;&#24615;&#33021;&#65292;&#24182;&#19988;&#33021;&#22815;&#36866;&#24212;&#27874;&#21160;&#29575;&#30340;&#23450;&#24335;&#20107;&#23454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#27874;&#21160;&#29575;&#24314;&#27169;&#26041;&#27861;&#65292;&#23558;&#28145;&#24230;&#23398;&#20064;&#65288;LSTM&#65289;&#21644;&#23454;&#29616;&#27874;&#21160;&#29575;&#27979;&#37327;&#32467;&#21512;&#36215;&#26469;&#12290;&#36825;&#31181;LSTM&#22686;&#24378;&#30340;&#23454;&#29616;GARCH&#26694;&#26550;&#34701;&#21512;&#20102;&#37329;&#34701;&#35745;&#37327;&#23398;&#12289;&#39640;&#39057;&#20132;&#26131;&#25968;&#25454;&#21644;&#28145;&#24230;&#23398;&#20064;&#30340;&#24314;&#27169;&#36827;&#23637;&#12290;&#36890;&#36807;&#39034;&#24207;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#37319;&#29992;&#36125;&#21494;&#26031;&#25512;&#26029;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#21644;&#39044;&#27979;&#12290;&#26032;&#30340;&#26694;&#26550;&#33021;&#22815;&#20849;&#21516;&#24314;&#27169;&#25910;&#30410;&#21644;&#23454;&#29616;&#27874;&#21160;&#29575;&#27979;&#37327;&#65292;&#20855;&#26377;&#38750;&#24120;&#22909;&#30340;&#20869;&#26679;&#26412;&#25311;&#21512;&#21644;&#36229;&#36807;&#20960;&#20010;&#22522;&#20934;&#27169;&#22411;&#30340;&#39044;&#27979;&#24615;&#33021;&#65292;&#21516;&#26102;&#33021;&#22815;&#24456;&#22909;&#22320;&#36866;&#24212;&#27874;&#21160;&#29575;&#30340;&#23450;&#24335;&#20107;&#23454;&#12290;&#20351;&#29992;&#24191;&#27867;&#20132;&#26131;&#30340;31&#20010;&#32929;&#31080;&#25351;&#25968;&#36827;&#34892;&#20102;&#20840;&#38754;&#23454;&#35777;&#30740;&#31350;&#65292;&#28085;&#30422;&#20102;&#21253;&#25324;COVID-19&#22823;&#27969;&#34892;&#22312;&#20869;&#30340;&#26102;&#38388;&#27573;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a new approach to volatility modeling by combining deep learning (LSTM) and realized volatility measures. This LSTM-enhanced realized GARCH framework incorporates and distills modeling advances from financial econometrics, high frequency trading data and deep learning. Bayesian inference via the Sequential Monte Carlo method is employed for statistical inference and forecasting. The new framework can jointly model the returns and realized volatility measures, has an excellent in-sample fit and superior predictive performance compared to several benchmark models, while being able to adapt well to the stylized facts in volatility. The performance of the new framework is tested using a wide range of metrics, from marginal likelihood, volatility forecasting, to tail risk forecasting and option pricing. We report on a comprehensive empirical study using 31 widely traded stock indices over a time period that includes COVID-19 pandemic.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#33258;&#21160;&#20570;&#24066;&#21830;&#26426;&#21046;&#65292;&#20854;&#20013;&#20215;&#26684;&#21457;&#29616;&#19981;&#20165;&#20165;&#20381;&#36182;&#20110;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65292;&#36824;&#20381;&#36182;&#20110;&#22806;&#37096;&#27719;&#29575;&#25110;&#20215;&#26684;&#39044;&#35328;&#26426;&#12290;&#21516;&#26102;&#65292;&#36890;&#36807;&#22343;&#20540;/&#26041;&#24046;&#20998;&#26512;&#65292;&#23558;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#19982;&#25345;&#26377;&#33258;&#21160;&#20570;&#24066;&#21830;&#20197;&#22806;&#36164;&#20135;&#30340;&#20195;&#29702;&#20154;&#36827;&#34892;&#27604;&#36739;&#65292;&#20197;&#35780;&#20272;&#20854;&#30408;&#20111;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2212.00336</link><description>&lt;p&gt;
&#33258;&#21160;&#20570;&#24066;&#21830;&#65306;LP&#30340;&#25910;&#30410;&#30340;&#22343;&#20540;&#26041;&#24046;&#20998;&#26512;&#21644;&#23450;&#20215;&#20989;&#25968;&#30340;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Automated Market Makers: Mean-Variance Analysis of LPs Payoffs and Design of Pricing Functions. (arXiv:2212.00336v3 [q-fin.TR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.00336
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#33258;&#21160;&#20570;&#24066;&#21830;&#26426;&#21046;&#65292;&#20854;&#20013;&#20215;&#26684;&#21457;&#29616;&#19981;&#20165;&#20165;&#20381;&#36182;&#20110;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65292;&#36824;&#20381;&#36182;&#20110;&#22806;&#37096;&#27719;&#29575;&#25110;&#20215;&#26684;&#39044;&#35328;&#26426;&#12290;&#21516;&#26102;&#65292;&#36890;&#36807;&#22343;&#20540;/&#26041;&#24046;&#20998;&#26512;&#65292;&#23558;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#19982;&#25345;&#26377;&#33258;&#21160;&#20570;&#24066;&#21830;&#20197;&#22806;&#36164;&#20135;&#30340;&#20195;&#29702;&#20154;&#36827;&#34892;&#27604;&#36739;&#65292;&#20197;&#35780;&#20272;&#20854;&#30408;&#20111;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#21435;&#20013;&#24515;&#21270;&#37329;&#34701;&#30340;&#20986;&#29616;&#65292;&#20986;&#29616;&#20102;&#26032;&#30340;&#20132;&#26131;&#26426;&#21046;&#31216;&#20026;&#33258;&#21160;&#20570;&#24066;&#21830;&#12290;&#26368;&#27969;&#34892;&#30340;&#33258;&#21160;&#20570;&#24066;&#21830;&#26159;&#24120;&#37327;&#20989;&#25968;&#20570;&#24066;&#21830;&#12290;&#23427;&#20204;&#24050;&#32463;&#22312;&#29702;&#35770;&#21644;&#23454;&#35777;&#26041;&#38754;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;&#29305;&#21035;&#26159;&#65292;&#20986;&#29616;&#20102;&#38750;&#27704;&#20037;&#24615;&#25439;&#22833;&#30340;&#27010;&#24565;&#65292;&#35299;&#37322;&#20102;&#24120;&#37327;&#20989;&#25968;&#20570;&#24066;&#21830;&#20013;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#37096;&#20998;&#30408;&#20111;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#21478;&#19968;&#31181;&#26426;&#21046;&#65292;&#20854;&#20013;&#20215;&#26684;&#21457;&#29616;&#19981;&#20165;&#20165;&#20381;&#36182;&#20110;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65292;&#36824;&#20381;&#36182;&#20110;&#22806;&#37096;&#27719;&#29575;&#25110;&#20215;&#26684;&#39044;&#35328;&#26426;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20351;&#29992;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#25910;&#30410;&#30340;&#22343;&#20540;/&#26041;&#24046;&#20998;&#26512;&#19982;&#33258;&#21160;&#20570;&#24066;&#21830;&#20043;&#22806;&#25345;&#26377;&#36164;&#20135;&#30340;&#20195;&#29702;&#20154;&#30340;&#25910;&#30410;/&#25439;&#22833;&#36827;&#34892;&#27604;&#36739;&#12290;&#29305;&#21035;&#26159;&#65292;&#21463;&#39532;&#31185;&#32500;&#33576;&#29616;&#20195;&#25237;&#36164;&#32452;&#21512;&#29702;&#35770;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#25104;&#21151;&#33719;&#24471;&#20102;&#22312;&#29702;&#24819;&#24773;&#20917;&#19979;&#30340;&#23436;&#32654;&#39044;&#35328;&#26426;&#30340;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#34920;&#29616;&#30340;&#26377;&#25928;&#21069;&#27839;&#12290;
&lt;/p&gt;
&lt;p&gt;
With the emergence of decentralized finance, new trading mechanisms called Automated Market Makers have appeared. The most popular Automated Market Makers are Constant Function Market Makers. They have been studied both theoretically and empirically. In particular, the concept of impermanent loss has emerged and explains part of the profit and loss of liquidity providers in Constant Function Market Makers. In this paper, we propose another mechanism in which price discovery does not solely rely on liquidity takers but also on an external exchange rate or price oracle. We also propose to compare the different mechanisms from the point of view of liquidity providers by using a mean / variance analysis of their profit and loss compared to that of agents holding assets outside of Automated Market Makers. In particular, inspired by Markowitz' modern portfolio theory, we manage to obtain an efficient frontier for the performance of liquidity providers in the idealized case of a perfect oracl
&lt;/p&gt;</description></item></channel></rss>