<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#30740;&#31350;&#20316;&#32773;&#36890;&#36807;&#24046;&#24322;&#20998;&#26512;&#33258;&#28982;&#23454;&#39564;&#21457;&#29616;&#65292;&#38750;&#27954;&#28023;&#24213;&#20114;&#32852;&#32593;&#30005;&#32518;&#30340;&#21040;&#26469;&#23545;&#20010;&#20154;&#21644;&#20225;&#19994;&#32423;&#23601;&#19994;&#20197;&#21450;&#22812;&#38388;&#20809;&#29031;&#25490;&#25918;&#20135;&#29983;&#20102;&#27491;&#38754;&#24433;&#21709;&#65292;&#20294;&#36825;&#20123;&#24433;&#21709;&#20027;&#35201;&#30001;&#20110;&#22320;&#29702;&#32534;&#30721;&#38169;&#35823;&#12289;&#21355;&#26143;&#26356;&#25442;&#24341;&#36215;&#30340;&#38388;&#26029;&#20197;&#21450;&#23545;&#24453;&#30103;&#21306;&#30340;&#23450;&#20041;&#19981;&#20934;&#30830;&#31561;&#21407;&#22240;&#32780;&#20135;&#29983;&#12290;</title><link>http://arxiv.org/abs/2401.13694</link><description>&lt;p&gt;
&#24555;&#36895;&#20114;&#32852;&#32593;&#30340;&#21040;&#26469;&#19982;&#38750;&#27954;&#23601;&#19994;&#65306;&#35780;&#35770;
&lt;/p&gt;
&lt;p&gt;
The Arrival of Fast Internet and Employment in Africa: Comment. (arXiv:2401.13694v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.13694
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20316;&#32773;&#36890;&#36807;&#24046;&#24322;&#20998;&#26512;&#33258;&#28982;&#23454;&#39564;&#21457;&#29616;&#65292;&#38750;&#27954;&#28023;&#24213;&#20114;&#32852;&#32593;&#30005;&#32518;&#30340;&#21040;&#26469;&#23545;&#20010;&#20154;&#21644;&#20225;&#19994;&#32423;&#23601;&#19994;&#20197;&#21450;&#22812;&#38388;&#20809;&#29031;&#25490;&#25918;&#20135;&#29983;&#20102;&#27491;&#38754;&#24433;&#21709;&#65292;&#20294;&#36825;&#20123;&#24433;&#21709;&#20027;&#35201;&#30001;&#20110;&#22320;&#29702;&#32534;&#30721;&#38169;&#35823;&#12289;&#21355;&#26143;&#26356;&#25442;&#24341;&#36215;&#30340;&#38388;&#26029;&#20197;&#21450;&#23545;&#24453;&#30103;&#21306;&#30340;&#23450;&#20041;&#19981;&#20934;&#30830;&#31561;&#21407;&#22240;&#32780;&#20135;&#29983;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Hjort&#21644;Poulsen&#65288;2019&#65289;&#23558;&#20844;&#20803;2010&#24180;&#21069;&#21518;&#38750;&#27954;&#28023;&#23736;&#19978;&#30340;&#28023;&#24213;&#20114;&#32852;&#32593;&#30005;&#32518;&#30340;&#38169;&#20301;&#21040;&#36798;&#20316;&#20026;&#19968;&#31181;&#24046;&#24322;&#20998;&#26512;&#33258;&#28982;&#23454;&#39564;&#65292;&#30740;&#31350;&#20102;&#23485;&#24102;&#25509;&#20837;&#23545;&#20010;&#20154;&#21644;&#20225;&#19994;&#32423;&#23601;&#19994;&#20197;&#21450;&#22812;&#38388;&#20809;&#29031;&#25490;&#25918;&#30340;&#27491;&#38754;&#24433;&#21709;&#12290;&#26412;&#35770;&#25991;&#21457;&#29616;&#36825;&#20123;&#32467;&#26524;&#20027;&#35201;&#30001;&#20110;&#22320;&#29702;&#32534;&#30721;&#38169;&#35823;&#12289;2009&#24180;&#24213;&#21355;&#26143;&#26356;&#25442;&#24341;&#36215;&#30340;&#38388;&#26029;&#20197;&#21450;&#19968;&#20010;&#23545;&#24453;&#30103;&#21306;&#30340;&#23450;&#20041;&#19981;&#28165;&#26224;&#30340;&#25216;&#26415;&#22522;&#30784;&#12289;&#27604;&#20960;&#20046;&#25152;&#26377;&#25968;&#25454;&#26469;&#28304;&#30340;&#31354;&#38388;&#20998;&#36776;&#29575;&#31364;&#65292;&#19988;&#23545;&#23485;&#24102;&#21487;&#29992;&#24615;&#22320;&#29702;&#20998;&#24067;&#30340;&#20195;&#34920;&#24615;&#36739;&#24369;&#12290;
&lt;/p&gt;
&lt;p&gt;
Hjort and Poulsen (2019) frames the staggered arrival of submarine Internet cables on the shores of Africa circa 2010 as a difference-in-differences natural experiment in broadband access. The paper finds positive impacts on individual- and firm-level employment and nighttime light emissions. These results are largely ascribable to geocoding errors; to discontinuities from a satellite changeover at end-2009; and to a definition of the treated zone that has unclear technological basis, is narrower than the spatial resolution of nearly all the data sources, and is weakly representative of the geography of broadband availability.
&lt;/p&gt;</description></item></channel></rss>