<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#25552;&#20986;&#32463;&#27982;&#25968;&#25454;&#25345;&#20037;&#24615;&#30340;&#24179;&#28369;&#21464;&#21270;&#27169;&#22411;&#65292;&#36890;&#36807;&#23616;&#37096;&#22238;&#24402;&#20174;&#25968;&#25454;&#20013;&#30830;&#23450;&#20016;&#23500;&#30340;&#25345;&#20037;&#24615;&#32467;&#26500;&#12290;&#30740;&#31350;&#21457;&#29616;&#36825;&#31181;&#21160;&#24577;&#25345;&#32493;&#24615;&#33258;&#28982;&#32780;&#28982;&#22320;&#26469;&#28304;&#20110;&#19981;&#21516;&#25345;&#32493;&#24615;&#30340;&#32463;&#27982;&#20914;&#20987;&#65292;&#21253;&#25324;&#25919;&#31574;&#21046;&#23450;&#20013;&#36215;&#20851;&#38190;&#20316;&#29992;&#30340;&#36890;&#36135;&#33192;&#32960;&#21644;&#23545;&#20110;&#39118;&#38505;&#21644;&#24066;&#22330;&#20998;&#26512;&#33267;&#20851;&#37325;&#35201;&#30340;&#32929;&#31080;&#27874;&#21160;&#29575;&#12290;</title><link>http://arxiv.org/abs/2306.01511</link><description>&lt;p&gt;
&#32463;&#27982;&#20914;&#20987;&#30340;&#21160;&#24577;&#25345;&#20037;&#24615;
&lt;/p&gt;
&lt;p&gt;
The Dynamic Persistence of Economic Shocks. (arXiv:2306.01511v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.01511
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#32463;&#27982;&#25968;&#25454;&#25345;&#20037;&#24615;&#30340;&#24179;&#28369;&#21464;&#21270;&#27169;&#22411;&#65292;&#36890;&#36807;&#23616;&#37096;&#22238;&#24402;&#20174;&#25968;&#25454;&#20013;&#30830;&#23450;&#20016;&#23500;&#30340;&#25345;&#20037;&#24615;&#32467;&#26500;&#12290;&#30740;&#31350;&#21457;&#29616;&#36825;&#31181;&#21160;&#24577;&#25345;&#32493;&#24615;&#33258;&#28982;&#32780;&#28982;&#22320;&#26469;&#28304;&#20110;&#19981;&#21516;&#25345;&#32493;&#24615;&#30340;&#32463;&#27982;&#20914;&#20987;&#65292;&#21253;&#25324;&#25919;&#31574;&#21046;&#23450;&#20013;&#36215;&#20851;&#38190;&#20316;&#29992;&#30340;&#36890;&#36135;&#33192;&#32960;&#21644;&#23545;&#20110;&#39118;&#38505;&#21644;&#24066;&#22330;&#20998;&#26512;&#33267;&#20851;&#37325;&#35201;&#30340;&#32929;&#31080;&#27874;&#21160;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#29992;&#20110;&#24179;&#28369;&#21464;&#21270;&#30340;&#32463;&#27982;&#25968;&#25454;&#25345;&#20037;&#24615;&#12290;&#25105;&#20204;&#35748;&#20026;&#36825;&#31181;&#21160;&#24577;&#25345;&#32493;&#24615;&#33258;&#28982;&#32780;&#28982;&#22320;&#26469;&#28304;&#20110;&#19981;&#21516;&#25345;&#32493;&#24615;&#32463;&#27982;&#20914;&#20987;&#30340;&#21160;&#24577;&#29305;&#24615;&#12290;&#36890;&#36807;&#20351;&#29992;&#23616;&#37096;&#22238;&#24402;&#20174;&#25968;&#25454;&#20013;&#30830;&#23450;&#36825;&#31181;&#21160;&#24577;&#25345;&#32493;&#24615;&#12290;&#32463;&#39564;&#35777;&#26126;&#65292;&#22312;&#20004;&#20010;&#37325;&#35201;&#25968;&#25454;&#38598;&#65288;&#25919;&#31574;&#21046;&#23450;&#20013;&#36215;&#20851;&#38190;&#20316;&#29992;&#30340;&#36890;&#36135;&#33192;&#32960;&#21644;&#23545;&#20110;&#39118;&#38505;&#21644;&#24066;&#22330;&#20998;&#26512;&#33267;&#20851;&#37325;&#35201;&#30340;&#32929;&#31080;&#27874;&#21160;&#29575;&#65289;&#20013;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#24179;&#31283;&#21464;&#21270;&#30340;&#20016;&#23500;&#25345;&#32493;&#24615;&#32467;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a model for smoothly varying heterogeneous persistence of economic data. We argue that such dynamics arise naturally from the dynamic nature of economic shocks with various degree of persistence. The identification of such dynamics from data is done using localised regressions. Empirically, we identify rich persistence structures that change smoothly over time in two important data sets: inflation, which plays a key role in policy formulation, and stock volatility, which is crucial for risk and market analysis.
&lt;/p&gt;</description></item></channel></rss>