<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#27979;&#35797;&#20102; CryptoPunks &#21644; NFT&#24066;&#22330;&#20013;&#30340;&#31181;&#26063;&#21644;&#24615;&#21035;&#20559;&#35265;&#12290;&#32467;&#26524;&#21457;&#29616;&#23384;&#22312;&#31181;&#26063;&#20559;&#35265;&#32780;&#38750;&#24615;&#21035;&#20559;&#35265;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#24102;&#26377;&#24615;&#21035;&#26631;&#31614;&#30340;NFT&#33402;&#26415;&#21697;&#25968;&#25454;&#38598;&#65292;&#20197;&#20419;&#36827;&#36825;&#20010;&#26032;&#20852;&#24066;&#22330;&#30340;&#31038;&#20250;&#24179;&#31561;&#30740;&#31350;&#12290;</title><link>http://arxiv.org/abs/2304.06484</link><description>&lt;p&gt;
&#25506;&#32034;NFT&#24066;&#22330;&#20013;&#30340;&#24615;&#21035;&#21644;&#31181;&#26063;&#20559;&#35265;
&lt;/p&gt;
&lt;p&gt;
Exploring Gender and Race Biases in the NFT Market. (arXiv:2304.06484v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.06484
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#27979;&#35797;&#20102; CryptoPunks &#21644; NFT&#24066;&#22330;&#20013;&#30340;&#31181;&#26063;&#21644;&#24615;&#21035;&#20559;&#35265;&#12290;&#32467;&#26524;&#21457;&#29616;&#23384;&#22312;&#31181;&#26063;&#20559;&#35265;&#32780;&#38750;&#24615;&#21035;&#20559;&#35265;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#24102;&#26377;&#24615;&#21035;&#26631;&#31614;&#30340;NFT&#33402;&#26415;&#21697;&#25968;&#25454;&#38598;&#65292;&#20197;&#20419;&#36827;&#36825;&#20010;&#26032;&#20852;&#24066;&#22330;&#30340;&#31038;&#20250;&#24179;&#31561;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38750;&#21516;&#36136;&#21270;&#20195;&#24065;(NFTs)&#26159;&#25351;&#37027;&#20123;&#36890;&#24120;&#23384;&#20648;&#22312;&#21306;&#22359;&#38142;&#19978;&#30340;&#38750;&#21487;&#26367;&#20195;&#24615;&#36164;&#20135;&#65292;&#36890;&#24120;&#26159;&#25968;&#23383;&#33402;&#26415;&#12290;&#21021;&#27493;&#30740;&#31350;&#21457;&#29616;&#65292;&#22899;&#24615;&#21644;&#36739;&#28145;&#32932;&#33394;&#30340;NFTs&#30340;&#20215;&#20540;&#20302;&#20110;&#30007;&#24615;&#21644;&#36739;&#27973;&#32932;&#33394;&#30340;&#20316;&#21697;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#30740;&#31350;&#20165;&#20998;&#26512;&#20102;CryptoPunks&#33402;&#26415;&#21697;&#25910;&#34255;&#12290;&#25105;&#20204;&#27979;&#35797;&#20102;CryptoPunks&#20215;&#26684;&#20013;&#30340;&#31181;&#26063;&#21644;&#24615;&#21035;&#20559;&#35265;&#30340;&#32479;&#35745;&#26174;&#33879;&#24615;&#65292;&#24182;&#39318;&#27425;&#30740;&#31350;&#20102;NFT&#24066;&#22330;&#30340;&#24615;&#21035;&#20559;&#35265;&#12290;&#25105;&#20204;&#21457;&#29616;&#35777;&#25454;&#25903;&#25345;&#23384;&#22312;&#31181;&#26063;&#20559;&#35265;&#32780;&#38750;&#24615;&#21035;&#20559;&#35265;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#36824;&#24341;&#20837;&#20102;&#19968;&#20010;&#24102;&#26377;&#24615;&#21035;&#26631;&#31614;&#30340;NFT&#33402;&#26415;&#21697;&#25968;&#25454;&#38598;&#65292;&#20197;&#25512;&#36827;&#23545;&#20110;&#36825;&#20010;&#26032;&#20852;&#24066;&#22330;&#30340;&#31038;&#20250;&#24179;&#31561;&#24615;&#30340;&#26356;&#24191;&#27867;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Non-Fungible Tokens (NFTs) are non-interchangeable assets, usually digital art, which are stored on the blockchain. Preliminary studies find that female and darker-skinned NFTs are valued less than their male and lighter-skinned counterparts. However, these studies analyze only the CryptoPunks collection. We test the statistical significance of race and gender biases in the prices of CryptoPunks and present the first study of gender bias in the broader NFT market. We find evidence of racial bias but not gender bias. Our work also introduces a dataset of gender-labeled NFT collections to advance the broader study of social equity in this emerging market.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19977;&#20010;&#23618;&#27425;&#30340;&#24066;&#22330;&#32479;&#35745;&#37327;&#25551;&#36848;&#25237;&#36164;&#32773;&#24066;&#22330;&#38144;&#21806;&#20013;&#33719;&#24471;&#30340;&#8220;&#23454;&#38469;&#8221;&#25910;&#30410;&#65292;&#19982;&#20256;&#32479;&#30340;&#26102;&#38388;&#24207;&#21015;&#20998;&#26512;&#19981;&#21516;&#12290;&#36825;&#20123;&#32479;&#35745;&#37327;&#32771;&#34385;&#20102;&#20132;&#26131;&#38144;&#21806;&#20215;&#20540;&#12289;&#36141;&#20080;&#20215;&#20540;&#21644;&#32929;&#31080;&#25968;&#37327;&#65292;&#24182;&#19988;&#25105;&#20204;&#25512;&#23548;&#20102;&#23427;&#20204;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2304.06466</link><description>&lt;p&gt;
&#25237;&#36164;&#32773;&#8220;&#23454;&#38469;&#8221;&#25910;&#30410;&#30340;&#24066;&#22330;&#32479;&#35745;&#37327;&#65306;&#32479;&#19968;&#29702;&#35770;&#25551;&#36848;
&lt;/p&gt;
&lt;p&gt;
The Market-Based Statistics of "Actual" Returns of Investors. (arXiv:2304.06466v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.06466
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19977;&#20010;&#23618;&#27425;&#30340;&#24066;&#22330;&#32479;&#35745;&#37327;&#25551;&#36848;&#25237;&#36164;&#32773;&#24066;&#22330;&#38144;&#21806;&#20013;&#33719;&#24471;&#30340;&#8220;&#23454;&#38469;&#8221;&#25910;&#30410;&#65292;&#19982;&#20256;&#32479;&#30340;&#26102;&#38388;&#24207;&#21015;&#20998;&#26512;&#19981;&#21516;&#12290;&#36825;&#20123;&#32479;&#35745;&#37327;&#32771;&#34385;&#20102;&#20132;&#26131;&#38144;&#21806;&#20215;&#20540;&#12289;&#36141;&#20080;&#20215;&#20540;&#21644;&#32929;&#31080;&#25968;&#37327;&#65292;&#24182;&#19988;&#25105;&#20204;&#25512;&#23548;&#20102;&#23427;&#20204;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#38024;&#23545;&#25237;&#36164;&#32773;&#24066;&#22330;&#38144;&#21806;&#20013;&#33719;&#24471;&#30340;&#8220;&#23454;&#38469;&#8221;&#25910;&#30410;&#30340;&#19977;&#20010;&#23618;&#27425;&#30340;&#24066;&#22330;&#32479;&#35745;&#37327;&#30340;&#32479;&#19968;&#29702;&#35770;&#25551;&#36848;&#12290;&#36825;&#20123;&#24066;&#22330;&#32479;&#35745;&#37327;&#32771;&#34385;&#20102;&#20132;&#26131;&#38144;&#21806;&#20215;&#20540;&#30340;&#22823;&#23567;&#12289;&#36141;&#20080;&#20215;&#20540;&#21644;&#32929;&#31080;&#25968;&#37327;&#65292;&#19982;&#22522;&#20110;&#25910;&#30410;&#26102;&#38388;&#24207;&#21015;&#39057;&#29575;&#20998;&#26512;&#30340;&#20256;&#32479;&#24120;&#35268;&#32479;&#35745;&#23398;&#19981;&#21516;&#12290;&#25105;&#20204;&#39318;&#20808;&#25551;&#36848;&#20102;&#25237;&#36164;&#32773;&#36890;&#36807;&#36807;&#21435;&#30340;&#22810;&#27425;&#36141;&#20080;&#33719;&#24471;&#21333;&#27425;&#38144;&#21806;&#30340;&#32479;&#35745;&#25910;&#30410;&#29575;&#12290;&#31532;&#20108;&#20010;&#23618;&#27425;&#25551;&#36848;&#20102;&#25237;&#36164;&#32773;&#22312;&#8220;&#20132;&#26131;&#26085;&#8221;&#36827;&#34892;&#22810;&#27425;&#24066;&#22330;&#38144;&#21806;&#26102;&#33719;&#24471;&#30340;&#25910;&#30410;&#32479;&#35745;&#12290;&#31532;&#19977;&#20010;&#23618;&#27425;&#25551;&#36848;&#20102;&#22312;&#8220;&#20132;&#26131;&#26085;&#8221;&#26399;&#38388;&#19981;&#21516;&#25237;&#36164;&#32773;&#33719;&#24471;&#30340;&#25910;&#30410;&#32479;&#35745;&#12290;&#25105;&#20204;&#25512;&#23548;&#20986;&#25910;&#30410;&#30340;&#32479;&#35745;&#37327;&#23545;&#24066;&#22330;&#38144;&#21806;&#20215;&#20540;&#12289;&#36141;&#20080;&#20215;&#20540;&#21644;&#32929;&#31080;&#25968;&#37327;&#30340;&#32479;&#35745;&#37327;&#30340;&#20381;&#36182;&#20851;&#31995;&#12290;&#21453;&#36807;&#26469;&#65292;&#20132;&#26131;&#20215;&#20540;&#21644;&#36141;&#20080;&#37327;&#30340;&#32479;&#35745;&#37327;&#21462;&#20915;&#20110;&#32479;&#35745;&#25910;&#30410;&#29575;&#30340;&#32479;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
The paper presents the unified theoretical description of three levels of the market-based statistical moments of "actual" returns, which Investors gain within their market sales. The market-based statistics of "actual" returns takes into account the size of the trade sale values, purchased values and volumes of stocks and that differs it from conventional regular statistics based on frequency analysis of returns time-series. We start with description of statistical moments of returns, which Investor gains via a single sale due to his multiple purchases in the past. The second level describes statistics of returns, which Investor gains performing numerous market sales during the "trading day". The third level describes statistics of returns that different Investors gain during the "trading day". We derive dependence of statistical moments of returns on statistical moments of market sale values, purchased values and volumes of stocks. In its turn, statistical moments of trade values and
&lt;/p&gt;</description></item><item><title>&#32654;&#22269;&#20844;&#31435;&#23398;&#26657;&#24341;&#20837;&#30340;&#39044;&#27979;&#31639;&#27861;&#65288;EWS&#65289;&#26410;&#33021;&#25552;&#39640;&#27605;&#19994;&#29575;&#65292;EWS&#20934;&#30830;&#24615;&#39640;&#65292;&#20294;&#29615;&#22659;&#22240;&#32032;&#24433;&#21709;&#26356;&#22823;&#12290;</title><link>http://arxiv.org/abs/2304.06205</link><description>&lt;p&gt;
&#23041;&#26031;&#24247;&#26143;&#20844;&#31435;&#23398;&#26657;&#31038;&#20132;&#39044;&#27979;&#30340;&#22256;&#38590;&#25945;&#35757;
&lt;/p&gt;
&lt;p&gt;
Difficult Lessons on Social Prediction from Wisconsin Public Schools. (arXiv:2304.06205v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.06205
&lt;/p&gt;
&lt;p&gt;
&#32654;&#22269;&#20844;&#31435;&#23398;&#26657;&#24341;&#20837;&#30340;&#39044;&#27979;&#31639;&#27861;&#65288;EWS&#65289;&#26410;&#33021;&#25552;&#39640;&#27605;&#19994;&#29575;&#65292;EWS&#20934;&#30830;&#24615;&#39640;&#65292;&#20294;&#29615;&#22659;&#22240;&#32032;&#24433;&#21709;&#26356;&#22823;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32654;&#22269;&#20844;&#31435;&#23398;&#26657;&#36817;&#26399;&#24341;&#20837;&#20102;&#39044;&#27979;&#31639;&#27861;&#65288;EWS&#65289;&#26469;&#25552;&#39640;&#27605;&#19994;&#29575;&#12290;&#36825;&#20123;&#31995;&#32479;&#36890;&#36807;&#39044;&#27979;&#21738;&#20123;&#23398;&#29983;&#21487;&#33021;&#36864;&#23398;&#65292;&#24110;&#21161;&#23545;&#20010;&#20307;&#23398;&#29983;&#36827;&#34892;&#24178;&#39044;&#12290;&#34429;&#28982;&#25237;&#36164;&#24040;&#22823;&#65292;&#24471;&#21040;&#24191;&#27867;&#24212;&#29992;&#65292;&#20294;&#23545;EWS&#26377;&#25928;&#24615;&#30340;&#29702;&#35299;&#20173;&#28982;&#23384;&#22312;&#37325;&#22823;&#24046;&#36317;&#12290;&#26412;&#30740;&#31350;&#21033;&#29992;&#23041;&#26031;&#24247;&#26143;&#20840;&#21306;&#30340;&#36817;&#21313;&#24180;&#25968;&#25454;&#65292;&#39318;&#27425;&#23545;EWS&#23545;&#27605;&#19994;&#29575;&#30340;&#38271;&#26399;&#24433;&#21709;&#36827;&#34892;&#22823;&#35268;&#27169;&#35780;&#20272;&#12290;&#25105;&#20204;&#25552;&#20379;&#35777;&#25454;&#34920;&#26126;&#39044;&#27979;&#31995;&#32479;&#25152;&#20570;&#30340;&#39118;&#38505;&#35780;&#20272;&#38750;&#24120;&#20934;&#30830;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#26469;&#33258;&#36793;&#32536;&#21270;&#32972;&#26223;&#30340;&#23398;&#29983;&#12290;&#23613;&#31649;&#35813;&#31995;&#32479;&#20934;&#30830;&#24615;&#39640;&#24182;&#19988;&#24471;&#21040;&#24191;&#27867;&#24212;&#29992;&#65292;&#20294;&#25105;&#20204;&#21457;&#29616;&#27809;&#26377;&#35777;&#25454;&#34920;&#26126;&#23427;&#20250;&#23548;&#33268;&#27605;&#19994;&#29575;&#30340;&#25552;&#39640;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#24378;&#22823;&#30340;&#32479;&#35745;&#27169;&#24335;&#65292;&#21487;&#20197;&#35299;&#37322;&#20026;&#20160;&#20040;&#36825;&#20123;&#30475;&#20284;&#30683;&#30462;&#30340;&#35265;&#35299;&#23384;&#22312;&#65292;&#21363;&#29615;&#22659;&#22240;&#32032;&#65292;&#20363;&#22914;&#23398;&#29983;&#25152;&#22312;&#23398;&#26657;&#25110;&#31038;&#21306;&#30340;&#36136;&#37327;&#65292;&#28153;&#27809;&#20102;EWS&#23545;&#27605;&#19994;&#29575;&#21487;&#33021;&#20135;&#29983;&#30340;&#20219;&#20309;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Early warning systems (EWS) are prediction algorithms that have recently taken a central role in efforts to improve graduation rates in public schools across the US. These systems assist in targeting interventions at individual students by predicting which students are at risk of dropping out. Despite significant investments and adoption, there remain significant gaps in our understanding of the efficacy of EWS. In this work, we draw on nearly a decade's worth of data from a system used throughout Wisconsin to provide the first large-scale evaluation of the long-term impact of EWS on graduation outcomes.  We present evidence that risk assessments made by the prediction system are highly accurate, including for students from marginalized backgrounds. Despite the system's accuracy and widespread use, we find no evidence that it has led to improved graduation rates. We surface a robust statistical pattern that can explain why these seemingly contradictory insights hold. Namely, environmen
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#36339;-&#25193;&#25955;&#24066;&#22330;&#20013;&#65292;&#36890;&#36807;&#36807;&#28388;&#32553;&#20943;&#21644;&#19968;&#33268;&#24615;&#27010;&#24565;&#33719;&#24471;&#21807;&#19968;&#31561;&#20215;&#38789;&#27979;&#24230;&#30340;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2304.06202</link><description>&lt;p&gt;
&#36339;-&#25193;&#25955;&#27169;&#22411;&#20013;&#30340;&#36807;&#28388;&#32553;&#20943;&#19982;&#23436;&#22791;&#24615;
&lt;/p&gt;
&lt;p&gt;
Filtration Reduction and Completeness in Jump-Diffusion Models. (arXiv:2304.06202v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.06202
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#36339;-&#25193;&#25955;&#24066;&#22330;&#20013;&#65292;&#36890;&#36807;&#36807;&#28388;&#32553;&#20943;&#21644;&#19968;&#33268;&#24615;&#27010;&#24565;&#33719;&#24471;&#21807;&#19968;&#31561;&#20215;&#38789;&#27979;&#24230;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#25705;&#25830;&#26080;&#38480;&#21644;&#31454;&#20105;&#20294;&#19981;&#23436;&#20840;&#30340;&#36339;-&#25193;&#25955;&#24066;&#22330;&#20013;&#30340;&#34893;&#29983;&#21697;&#23450;&#20215;&#21644;&#23545;&#20914;&#12290;&#36890;&#36807;&#23558;&#24066;&#22330;&#32553;&#20943;&#21040;&#19968;&#20010;&#34394;&#26500;&#30340;&#23436;&#20840;&#24066;&#22330;&#65292;&#24471;&#21040;&#20102;&#19968;&#20010;&#29420;&#29305;&#30340;&#31561;&#20215;&#38789;&#27979;&#24230;&#65288;EMM&#65289;&#12290;&#20351;&#29992;&#19968;&#33268;&#24615;&#27010;&#24565;&#23558;&#34394;&#26500;&#24066;&#22330;&#20013;&#30340;&#21807;&#19968;EMM&#24212;&#29992;&#20110;&#21407;&#22987;&#32463;&#27982;&#20307;&#12290;&#20986;&#20110;&#25945;&#23398;&#30446;&#30340;&#65292;&#20174;&#31616;&#21333;&#30340;&#35774;&#32622;&#24320;&#22987;&#36880;&#28176;&#25193;&#23637;&#21040;&#36880;&#28176;&#22686;&#21152;&#19968;&#33324;&#24615;&#30340;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies the pricing and hedging of derivatives in frictionless and competitive, but incomplete jump-diffusion markets. A unique equivalent martingale measure (EMM) is obtained using filtration reduction to a fictitious complete market. This unique EMM in the fictitious market is uplifted to the original economy using the notion of consistency. For pedagogical purposes, we begin with simple setups and progressively extend to models of increasing generality.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#24378;&#21270;&#23398;&#20064;&#22312;&#37327;&#21270;&#20132;&#26131;&#20013;&#30340;&#36816;&#29992;&#65292;&#25581;&#31034;&#20102;&#22522;&#20110; RL &#30340;&#20132;&#26131;&#31639;&#27861;&#30340;&#26696;&#20363;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#23427;&#26377;&#28508;&#21147;&#20248;&#20110;&#20256;&#32479;&#30340;&#20132;&#26131;&#31639;&#27861;&#12290;&#36825;&#19968;&#30740;&#31350;&#20195;&#34920;&#20102;&#19968;&#20010;&#26377;&#24076;&#26395;&#30340;&#30740;&#31350;&#39046;&#22495;&#65292;&#21487;&#20197;&#28508;&#22312;&#22320;&#24341;&#23548;&#26356;&#20026;&#22797;&#26434;&#21644;&#26377;&#25928;&#30340;&#20132;&#26131;&#31995;&#32479;&#30340;&#24320;&#21457;&#12290;</title><link>http://arxiv.org/abs/2304.06037</link><description>&lt;p&gt;
&#20351;&#29992;&#28145;&#24230; Q &#23398;&#20064;&#36827;&#34892;&#37327;&#21270;&#20132;&#26131;&#12290;
&lt;/p&gt;
&lt;p&gt;
Quantitative Trading using Deep Q Learning. (arXiv:2304.06037v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.06037
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#24378;&#21270;&#23398;&#20064;&#22312;&#37327;&#21270;&#20132;&#26131;&#20013;&#30340;&#36816;&#29992;&#65292;&#25581;&#31034;&#20102;&#22522;&#20110; RL &#30340;&#20132;&#26131;&#31639;&#27861;&#30340;&#26696;&#20363;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#23427;&#26377;&#28508;&#21147;&#20248;&#20110;&#20256;&#32479;&#30340;&#20132;&#26131;&#31639;&#27861;&#12290;&#36825;&#19968;&#30740;&#31350;&#20195;&#34920;&#20102;&#19968;&#20010;&#26377;&#24076;&#26395;&#30340;&#30740;&#31350;&#39046;&#22495;&#65292;&#21487;&#20197;&#28508;&#22312;&#22320;&#24341;&#23548;&#26356;&#20026;&#22797;&#26434;&#21644;&#26377;&#25928;&#30340;&#20132;&#26131;&#31995;&#32479;&#30340;&#24320;&#21457;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24378;&#21270;&#23398;&#20064;&#26159;&#26426;&#22120;&#23398;&#20064;&#30340;&#19968;&#20010;&#20998;&#25903;&#65292;&#24050;&#34987;&#29992;&#20110;&#26426;&#22120;&#20154;&#25216;&#26415;&#12289;&#28216;&#25103;&#29609;&#27861;&#21644;&#33258;&#20027;&#31995;&#32479;&#31561;&#22810;&#31181;&#24212;&#29992;&#12290;&#36817;&#24180;&#26469;&#65292;&#20154;&#20204;&#36234;&#26469;&#36234;&#20851;&#27880;&#24378;&#21270;&#23398;&#20064;&#22312;&#37327;&#21270;&#20132;&#26131;&#39046;&#22495;&#30340;&#24212;&#29992;&#65292;&#26088;&#22312;&#22312;&#37329;&#34701;&#24066;&#22330;&#19978;&#36827;&#34892;&#30408;&#21033;&#20132;&#26131;&#12290;&#26412;&#35770;&#25991;&#25506;&#35752;&#20102; RL &#22312;&#37327;&#21270;&#20132;&#26131;&#20013;&#30340;&#20351;&#29992;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#20110; RL &#30340;&#20132;&#26131;&#31639;&#27861;&#30340;&#26696;&#20363;&#30740;&#31350;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;RL &#21487;&#20197;&#25104;&#20026;&#37327;&#21270;&#20132;&#26131;&#30340;&#24378;&#26377;&#21147;&#24037;&#20855;&#65292;&#24182;&#19988;&#23427;&#26377;&#28508;&#21147;&#20248;&#20110;&#20256;&#32479;&#30340;&#20132;&#26131;&#31639;&#27861;&#12290;&#22312;&#37327;&#21270;&#20132;&#26131;&#20013;&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#20195;&#34920;&#30528;&#19968;&#20010;&#26377;&#24076;&#26395;&#30340;&#30740;&#31350;&#39046;&#22495;&#65292;&#21487;&#20197;&#28508;&#22312;&#22320;&#24341;&#23548;&#26356;&#20026;&#22797;&#26434;&#21644;&#26377;&#25928;&#30340;&#20132;&#26131;&#31995;&#32479;&#30340;&#24320;&#21457;&#12290;&#26410;&#26469;&#30340;&#24037;&#20316;&#21487;&#20197;&#25506;&#32034;&#20351;&#29992;&#26367;&#20195;&#30340;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#65292;&#25972;&#21512;&#20854;&#20182;&#25968;&#25454;&#26469;&#28304;&#65292;&#24182;&#22312;&#19981;&#21516;&#30340;&#36164;&#20135;&#31867;&#21035;&#19978;&#27979;&#35797;&#35813;&#31995;&#32479;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#35777;&#26126;&#20102;&#23427;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
Reinforcement learning (RL) is a branch of machine learning that has been used in a variety of applications such as robotics, game playing, and autonomous systems. In recent years, there has been growing interest in applying RL to quantitative trading, where the goal is to make profitable trades in financial markets. This paper explores the use of RL in quantitative trading and presents a case study of a RL-based trading algorithm. The results show that RL can be a powerful tool for quantitative trading, and that it has the potential to outperform traditional trading algorithms. The use of reinforcement learning in quantitative trading represents a promising area of research that can potentially lead to the development of more sophisticated and effective trading systems. Future work could explore the use of alternative reinforcement learning algorithms, incorporate additional data sources, and test the system on different asset classes. Overall, our research demonstrates the potential 
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#19968;&#31181;&#30417;&#31649;&#24066;&#22330;&#30340;&#27010;&#24565;&#65292;&#21363;&#25919;&#24220;&#35201;&#27714;&#21463;&#30417;&#31649;&#23545;&#35937;&#20174;&#31169;&#20154;&#30417;&#31649;&#26426;&#26500;&#36141;&#20080;&#30417;&#31649;&#26381;&#21153;&#65292;&#20197;&#20811;&#26381;&#36807;&#24230;&#20381;&#36182;&#34892;&#19994;&#33258;&#24459;&#21644;&#31435;&#27861;&#26426;&#26500;&#32570;&#20047;&#19987;&#19994;&#30693;&#35782;&#30340;&#23616;&#38480;&#24615;&#65292;&#20174;&#32780;&#36880;&#27493;&#23454;&#29616;&#20154;&#24037;&#26234;&#33021;&#30340;&#24688;&#24403;&#30417;&#31649;&#12290;</title><link>http://arxiv.org/abs/2304.04914</link><description>&lt;p&gt;
&#30417;&#31649;&#24066;&#22330;&#65306;&#20154;&#24037;&#26234;&#33021;&#27835;&#29702;&#30340;&#26410;&#26469;
&lt;/p&gt;
&lt;p&gt;
Regulatory Markets: The Future of AI Governance. (arXiv:2304.04914v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.04914
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#19968;&#31181;&#30417;&#31649;&#24066;&#22330;&#30340;&#27010;&#24565;&#65292;&#21363;&#25919;&#24220;&#35201;&#27714;&#21463;&#30417;&#31649;&#23545;&#35937;&#20174;&#31169;&#20154;&#30417;&#31649;&#26426;&#26500;&#36141;&#20080;&#30417;&#31649;&#26381;&#21153;&#65292;&#20197;&#20811;&#26381;&#36807;&#24230;&#20381;&#36182;&#34892;&#19994;&#33258;&#24459;&#21644;&#31435;&#27861;&#26426;&#26500;&#32570;&#20047;&#19987;&#19994;&#30693;&#35782;&#30340;&#23616;&#38480;&#24615;&#65292;&#20174;&#32780;&#36880;&#27493;&#23454;&#29616;&#20154;&#24037;&#26234;&#33021;&#30340;&#24688;&#24403;&#30417;&#31649;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24688;&#24403;&#22320;&#30417;&#31649;&#20154;&#24037;&#26234;&#33021;&#26159;&#19968;&#20010;&#26085;&#30410;&#32039;&#36843;&#30340;&#25919;&#31574;&#25361;&#25112;&#12290;&#31435;&#27861;&#26426;&#26500;&#21644;&#30417;&#31649;&#26426;&#26500;&#32570;&#20047;&#32763;&#35793;&#20844;&#20247;&#38656;&#27714;&#20026;&#27861;&#24459;&#35201;&#27714;&#25152;&#38656;&#30340;&#19987;&#19994;&#30693;&#35782;&#12290;&#36807;&#24230;&#20381;&#36182;&#34892;&#19994;&#33258;&#24459;&#26410;&#33021;&#20351;AI&#31995;&#32479;&#30340;&#29983;&#20135;&#32773;&#21644;&#20351;&#29992;&#32773;&#23545;&#27665;&#20027;&#35201;&#27714;&#36127;&#36131;&#12290;&#25552;&#20986;&#20102;&#30417;&#31649;&#24066;&#22330;&#30340;&#27010;&#24565;&#65292;&#21363;&#25919;&#24220;&#35201;&#27714;&#21463;&#30417;&#31649;&#23545;&#35937;&#20174;&#31169;&#20154;&#30417;&#31649;&#26426;&#26500;&#36141;&#20080;&#30417;&#31649;&#26381;&#21153;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#20811;&#26381;&#21629;&#20196;&#21644;&#25511;&#21046;&#30417;&#31649;&#21644;&#33258;&#25105;&#30417;&#31649;&#30340;&#23616;&#38480;&#24615;&#12290;&#30417;&#31649;&#24066;&#22330;&#21487;&#20197;&#20351;&#25919;&#24220;&#20026;AI&#30417;&#31649;&#24314;&#31435;&#25919;&#31574;&#20248;&#20808;&#32423;&#65292;&#21516;&#26102;&#20381;&#38752;&#24066;&#22330;&#21147;&#37327;&#21644;&#34892;&#19994;&#30740;&#21457;&#21162;&#21147;&#26469;&#24320;&#21019;&#26368;&#33021;&#23454;&#29616;&#25919;&#31574;&#21046;&#23450;&#32773;&#22768;&#26126;&#30446;&#26631;&#30340;&#30417;&#31649;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Appropriately regulating artificial intelligence is an increasingly urgent policy challenge. Legislatures and regulators lack the specialized knowledge required to best translate public demands into legal requirements. Overreliance on industry self-regulation fails to hold producers and users of AI systems accountable to democratic demands. Regulatory markets, in which governments require the targets of regulation to purchase regulatory services from a private regulator, are proposed. This approach to AI regulation could overcome the limitations of both command-and-control regulation and self-regulation. Regulatory market could enable governments to establish policy priorities for the regulation of AI, whilst relying on market forces and industry R&amp;D efforts to pioneer the methods of regulation that best achieve policymakers' stated objectives.
&lt;/p&gt;</description></item></channel></rss>