<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#22312;&#35780;&#20272;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#32463;&#27982;&#21512;&#29702;&#24615;&#26041;&#38754;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#36890;&#36807;&#37327;&#21270;&#35780;&#20998;&#27169;&#22411;&#22312;&#21508;&#20010;&#35201;&#32032;&#19978;&#30340;&#34920;&#29616;&#24182;&#32467;&#21512;&#29992;&#25143;&#25552;&#20379;&#30340;&#35780;&#20998;&#26631;&#20934;&#65292;&#29983;&#25104;&#19968;&#20221;"&#29702;&#24615;&#25253;&#21578;&#21345;"&#65292;&#20197;&#30830;&#23450;&#20195;&#29702;&#20154;&#26159;&#21542;&#36275;&#22815;&#21487;&#38752;&#12290;</title><link>https://arxiv.org/abs/2402.09552</link><description>&lt;p&gt;
&#29702;&#24615;&#25253;&#21578;&#21345;&#65306;&#35780;&#20272;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#32463;&#27982;&#21512;&#29702;&#24615;
&lt;/p&gt;
&lt;p&gt;
Rationality Report Cards: Assessing the Economic Rationality of Large Language Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09552
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#35780;&#20272;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#32463;&#27982;&#21512;&#29702;&#24615;&#26041;&#38754;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#36890;&#36807;&#37327;&#21270;&#35780;&#20998;&#27169;&#22411;&#22312;&#21508;&#20010;&#35201;&#32032;&#19978;&#30340;&#34920;&#29616;&#24182;&#32467;&#21512;&#29992;&#25143;&#25552;&#20379;&#30340;&#35780;&#20998;&#26631;&#20934;&#65292;&#29983;&#25104;&#19968;&#20221;"&#29702;&#24615;&#25253;&#21578;&#21345;"&#65292;&#20197;&#30830;&#23450;&#20195;&#29702;&#20154;&#26159;&#21542;&#36275;&#22815;&#21487;&#38752;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36234;&#26469;&#36234;&#22810;&#30340;&#20154;&#23545;&#23558;LLM&#29992;&#20316;&#20915;&#31574;"&#20195;&#29702;&#20154;"&#20852;&#36259;&#26085;&#30410;&#22686;&#21152;&#12290;&#36825;&#21253;&#25324;&#24456;&#22810;&#33258;&#30001;&#24230;&#65306;&#24212;&#35813;&#20351;&#29992;&#21738;&#20010;&#27169;&#22411;&#65307;&#22914;&#20309;&#36827;&#34892;&#25552;&#31034;&#65307;&#26159;&#21542;&#35201;&#27714;&#20854;&#36827;&#34892;&#20869;&#30465;&#12289;&#36827;&#34892;&#24605;&#32771;&#38142;&#31561;&#12290;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65288;&#26356;&#24191;&#27867;&#22320;&#35828;&#65292;&#30830;&#23450;LLM&#20195;&#29702;&#20154;&#26159;&#21542;&#36275;&#22815;&#21487;&#38752;&#20197;&#20415;&#33719;&#24471;&#20449;&#20219;&#65289;&#38656;&#35201;&#19968;&#31181;&#35780;&#20272;&#36825;&#31181;&#20195;&#29702;&#20154;&#32463;&#27982;&#21512;&#29702;&#24615;&#30340;&#26041;&#27861;&#35770;&#65292;&#22312;&#26412;&#25991;&#20013;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#26041;&#27861;&#12290;&#25105;&#20204;&#39318;&#20808;&#23545;&#29702;&#24615;&#20915;&#31574;&#30340;&#32463;&#27982;&#25991;&#29486;&#36827;&#34892;&#20102;&#35843;&#30740;&#12289;&#23558;&#20195;&#29702;&#20154;&#24212;&#35813;&#23637;&#29616;&#30340;&#22823;&#37327;&#32454;&#31890;&#24230;"&#35201;&#32032;"&#36827;&#34892;&#20998;&#31867;&#65292;&#24182;&#30830;&#23450;&#20102;&#23427;&#20204;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20934;&#20998;&#24067;&#65292;&#20197;&#23450;&#37327;&#35780;&#20998;LLM&#22312;&#36825;&#20123;&#35201;&#32032;&#19978;&#30340;&#34920;&#29616;&#65292;&#24182;&#32467;&#21512;&#29992;&#25143;&#25552;&#20379;&#30340;&#35780;&#20998;&#26631;&#20934;&#65292;&#29983;&#25104;&#19968;&#20221;"&#29702;&#24615;&#25253;&#21578;&#21345;"&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#25551;&#36848;&#20102;&#19982;14&#31181;&#19981;&#21516;&#30340;LLM&#36827;&#34892;&#30340;&#22823;&#35268;&#27169;&#23454;&#35777;&#23454;&#39564;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09552v1 Announce Type: new  Abstract: There is increasing interest in using LLMs as decision-making "agents." Doing so includes many degrees of freedom: which model should be used; how should it be prompted; should it be asked to introspect, conduct chain-of-thought reasoning, etc? Settling these questions -- and more broadly, determining whether an LLM agent is reliable enough to be trusted -- requires a methodology for assessing such an agent's economic rationality. In this paper, we provide one. We begin by surveying the economic literature on rational decision making, taxonomizing a large set of fine-grained "elements" that an agent should exhibit, along with dependencies between them. We then propose a benchmark distribution that quantitatively scores an LLMs performance on these elements and, combined with a user-provided rubric, produces a "rationality report card." Finally, we describe the results of a large-scale empirical experiment with 14 different LLMs, characte
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26102;&#38388;&#21464;&#21270;&#26041;&#27861;&#26469;&#30740;&#31350;&#38544;&#21547;&#27874;&#21160;&#29575;&#24494;&#31505;&#30340;&#24418;&#24577;&#12290;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#24120;&#35265;&#30340;&#21322;&#38808;&#27169;&#22411;&#65292;&#25913;&#36827;&#20102;&#22522;&#20110;&#30697;&#30340;&#20844;&#24335;&#26469;&#36817;&#20284;&#24179;&#20215;&#36873;&#25321;&#26435;&#30340;&#20559;&#26012;&#21644;&#26354;&#29575;&#65292;&#36890;&#36807;&#26126;&#30830;&#35745;&#31639;&#20986;&#36825;&#20123;&#30697;&#65292;&#32771;&#34385;&#20102;&#20960;&#20010;&#27169;&#22411;&#30340;&#26497;&#38480;&#20559;&#26012;&#21644;&#26354;&#29575;&#65292;&#24182;&#36890;&#36807;&#25968;&#20540;&#26041;&#27861;&#21644;&#23454;&#35777;&#25968;&#25454;&#36827;&#34892;&#20102;&#27979;&#35797;&#65292;&#26368;&#21518;&#24212;&#29992;&#20110;&#26657;&#20934;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2401.03776</link><description>&lt;p&gt;
&#20998;&#35299;&#24494;&#31505;&#65306;&#19968;&#31181;&#26102;&#38388;&#21464;&#21270;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Decomposing Smiles: A Time Change Approach. (arXiv:2401.03776v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.03776
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26102;&#38388;&#21464;&#21270;&#26041;&#27861;&#26469;&#30740;&#31350;&#38544;&#21547;&#27874;&#21160;&#29575;&#24494;&#31505;&#30340;&#24418;&#24577;&#12290;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#24120;&#35265;&#30340;&#21322;&#38808;&#27169;&#22411;&#65292;&#25913;&#36827;&#20102;&#22522;&#20110;&#30697;&#30340;&#20844;&#24335;&#26469;&#36817;&#20284;&#24179;&#20215;&#36873;&#25321;&#26435;&#30340;&#20559;&#26012;&#21644;&#26354;&#29575;&#65292;&#36890;&#36807;&#26126;&#30830;&#35745;&#31639;&#20986;&#36825;&#20123;&#30697;&#65292;&#32771;&#34385;&#20102;&#20960;&#20010;&#27169;&#22411;&#30340;&#26497;&#38480;&#20559;&#26012;&#21644;&#26354;&#29575;&#65292;&#24182;&#36890;&#36807;&#25968;&#20540;&#26041;&#27861;&#21644;&#23454;&#35777;&#25968;&#25454;&#36827;&#34892;&#20102;&#27979;&#35797;&#65292;&#26368;&#21518;&#24212;&#29992;&#20110;&#26657;&#20934;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#37319;&#29992;&#19968;&#31181;&#26032;&#39062;&#30340;&#26102;&#38388;&#21464;&#21270;&#26041;&#27861;&#26469;&#30740;&#31350;&#38544;&#21547;&#27874;&#21160;&#29575;&#24494;&#31505;&#30340;&#24418;&#29366;&#12290;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#24120;&#35265;&#30340;&#21322;&#38808;&#27169;&#22411;&#65292;&#21253;&#25324;&#36339;&#36291;&#25193;&#25955;&#27169;&#22411;&#12289;&#31895;&#31961;&#27874;&#21160;&#27169;&#22411;&#21644;&#26080;&#38480;&#27963;&#21160;&#27169;&#22411;&#12290;&#25105;&#20204;&#29992;&#25913;&#36827;&#30340;&#22522;&#20110;&#30697;&#30340;&#20844;&#24335;&#36817;&#20284;&#24179;&#20215;&#36873;&#25321;&#26435;&#30340;&#20559;&#26012;&#21644;&#26354;&#29575;&#12290;&#22312;&#26102;&#38388;&#21464;&#21270;&#26694;&#26550;&#19979;&#26126;&#30830;&#35745;&#31639;&#20986;&#36825;&#20123;&#30697;&#12290;&#23545;&#20110;&#20960;&#20010;&#27169;&#22411;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#26497;&#38480;&#30340;&#20559;&#26012;&#21644;&#26354;&#29575;&#12290;&#25105;&#20204;&#36824;&#36890;&#36807;&#25968;&#20540;&#26041;&#27861;&#21644;&#23454;&#35777;&#25968;&#25454;&#23545;&#30701;&#26399;&#36924;&#36817;&#32467;&#26524;&#30340;&#20934;&#30830;&#24615;&#36827;&#34892;&#20102;&#27979;&#35797;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#35813;&#26041;&#27861;&#24212;&#29992;&#20110;&#26657;&#20934;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a novel time-change approach to study the shape of implied volatility smiles. The method is applicable to common semimartingale models, including jump-diffusion, rough volatility and infinite activity models. We approximate the at-the-money skew and curvature with an improved moment-based formula. The moments are further explicitly computed under a time change framework. The limiting skew and curvature for several models are considered. We also test the accuracy of the short-term approximation results on models via numerical methods and on empirical data. Finally, we apply the method to the calibration problem.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#30340;&#35777;&#26126;&#65292;&#36890;&#36807;&#26500;&#36896;&#23450;&#29702;&#26469;&#30830;&#23450;&#26032;&#23450;&#20041;&#20013;&#30340;&#25928;&#29992;&#26354;&#32447;&#24418;&#29366;&#12290;&#19982;&#26631;&#20934;&#29702;&#35770;&#19981;&#21516;&#65292;&#26032;&#23450;&#20041;&#20013;&#20986;&#29616;&#20102;&#20005;&#26684;&#20985;&#24615;&#12289;&#20005;&#26684;&#20984;&#24615;&#25110;&#32447;&#24615;&#30340;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2309.03003</link><description>&lt;p&gt;
&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#30340;&#35777;&#26126;
&lt;/p&gt;
&lt;p&gt;
Proofs for the New Definitions in Financial Markets. (arXiv:2309.03003v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.03003
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#30340;&#35777;&#26126;&#65292;&#36890;&#36807;&#26500;&#36896;&#23450;&#29702;&#26469;&#30830;&#23450;&#26032;&#23450;&#20041;&#20013;&#30340;&#25928;&#29992;&#26354;&#32447;&#24418;&#29366;&#12290;&#19982;&#26631;&#20934;&#29702;&#35770;&#19981;&#21516;&#65292;&#26032;&#23450;&#20041;&#20013;&#20986;&#29616;&#20102;&#20005;&#26684;&#20985;&#24615;&#12289;&#20005;&#26684;&#20984;&#24615;&#25110;&#32447;&#24615;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26500;&#36896;&#23450;&#29702;&#21487;&#20197;&#24110;&#21161;&#30830;&#23450;&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#20013;&#26500;&#25104;&#30340;&#26576;&#20123;&#25928;&#29992;&#26354;&#32447;&#30340;&#24418;&#29366;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#20026;&#36825;&#20123;&#23450;&#29702;&#25552;&#20379;&#35777;&#26126;&#12290;&#23613;&#31649;&#39118;&#38505;&#21388;&#24694;&#12289;&#39118;&#38505;&#29233;&#22909;&#21644;&#39118;&#38505;&#20013;&#24615;&#31561;&#26415;&#35821;&#22312;&#26631;&#20934;&#29702;&#35770;&#20013;&#20998;&#21035;&#31561;&#21516;&#20110;&#20005;&#26684;&#20985;&#24615;&#12289;&#20005;&#26684;&#20984;&#24615;&#21644;&#32447;&#24615;&#65292;&#20294;&#26576;&#20123;&#26032;&#23450;&#20041;&#28385;&#36275;&#20005;&#26684;&#20985;&#24615;&#25110;&#20005;&#26684;&#20984;&#24615;&#65292;&#25110;&#32447;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Constructing theorems can help to determine the shape of certain utility curves that make up the new definitions in financial markets. The aim of this study was to present proofs for these theorems. Although the terms of risk-averse, risk-loving, and risk-neutral are equivalent to strict concavity, strict convexity, and linearity, respectively, in standard theory, certain new definitions satisfy strict concavity or strict convexity, or linearity.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#35777;&#23454;&#20102;&#26032;&#30340;&#37329;&#34701;&#24066;&#22330;&#23450;&#20041;&#20934;&#30830;&#21453;&#26144;&#20102;&#25237;&#36164;&#32773;&#34892;&#20026;&#65292;&#24182;&#25552;&#20379;&#20102;&#25237;&#36164;&#31574;&#30053;&#26041;&#38754;&#30340;&#24314;&#35758;&#12290;</title><link>http://arxiv.org/abs/2305.03468</link><description>&lt;p&gt;
&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#30340;&#32463;&#39564;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Empirical Evidence for the New Definitions in Financial Markets. (arXiv:2305.03468v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.03468
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#35777;&#23454;&#20102;&#26032;&#30340;&#37329;&#34701;&#24066;&#22330;&#23450;&#20041;&#20934;&#30830;&#21453;&#26144;&#20102;&#25237;&#36164;&#32773;&#34892;&#20026;&#65292;&#24182;&#25552;&#20379;&#20102;&#25237;&#36164;&#31574;&#30053;&#26041;&#38754;&#30340;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32473;&#20986;&#20102;&#25903;&#25345;&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#30340;&#32463;&#39564;&#35777;&#25454;&#12290;&#20998;&#26512;&#20102;1889-1978&#24180;&#32654;&#22269;&#37329;&#34701;&#24066;&#22330;&#25237;&#36164;&#32773;&#30340;&#39118;&#38505;&#24577;&#24230;&#65292;&#32467;&#26524;&#34920;&#26126;&#65292;1977&#24180;&#22312;&#25237;&#36164;&#32508;&#21512;S&#65286;P 500&#25351;&#25968;&#30340;&#32929;&#31080;&#25237;&#36164;&#32773;&#26159;&#39118;&#38505;&#35268;&#36991;&#32773;&#12290;&#30456;&#21453;&#65292;&#25237;&#36164;&#32654;&#22269;&#22269;&#20538;&#30340;&#26080;&#39118;&#38505;&#36164;&#20135;&#25237;&#36164;&#32773;&#21017;&#34920;&#29616;&#20986;&#19981;&#36275;&#30340;&#39118;&#38505;&#20559;&#29233;&#65292;&#36825;&#21487;&#20197;&#34987;&#35748;&#20026;&#26159;&#19968;&#31181;&#39118;&#38505;&#35268;&#36991;&#34892;&#20026;&#12290;&#36825;&#20123;&#21457;&#29616;&#34920;&#26126;&#65292;&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#20934;&#30830;&#21453;&#26144;&#20102;&#25237;&#36164;&#32773;&#30340;&#34892;&#20026;&#65292;&#24212;&#32771;&#34385;&#22312;&#25237;&#36164;&#31574;&#30053;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study presents empirical evidence to support the validity of new definitions in financial markets. The risk attitudes of investors in US financial markets from 1889-1978 are analyzed and the results indicate that equity investors who invested in the composite S&amp;P 500 index were risk-averse in 1977. Conversely, risk-free asset investors who invested in US Treasury bills were found to exhibit not enough risk-loving behavior, which can be considered a type of risk-averse behavior. These findings suggest that the new definitions in financial markets accurately reflect the behavior of investors and should be considered in investment strategies.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#24120;&#37327;&#20989;&#25968;&#24066;&#22330;&#21046;&#36896;&#32773;&#65288;CFMM&#65289;&#30340;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#65292;&#21457;&#29616;CFMM&#34920;&#29616;&#19981;&#22914;&#20877;&#24179;&#34913;&#31574;&#30053;&#65292;&#25552;&#20986;&#20102;&#25439;&#22833;&#19982;&#20877;&#24179;&#34913;(LVR)&#30340;&#27010;&#24565;&#65292;&#21487;&#29992;&#20110;&#35780;&#20272;&#25237;&#36164;&#20915;&#31574;&#21644;&#25351;&#23548;&#21327;&#35758;&#35774;&#35745;&#12290;</title><link>http://arxiv.org/abs/2208.06046</link><description>&lt;p&gt;
&#33258;&#21160;&#21270;&#24066;&#22330;&#20570;&#24066;&#21830;&#21450;&#25439;&#22833;&#19982;&#20877;&#24179;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;
Automated Market Making and Loss-Versus-Rebalancing. (arXiv:2208.06046v3 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.06046
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#24120;&#37327;&#20989;&#25968;&#24066;&#22330;&#21046;&#36896;&#32773;&#65288;CFMM&#65289;&#30340;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#65292;&#21457;&#29616;CFMM&#34920;&#29616;&#19981;&#22914;&#20877;&#24179;&#34913;&#31574;&#30053;&#65292;&#25552;&#20986;&#20102;&#25439;&#22833;&#19982;&#20877;&#24179;&#34913;(LVR)&#30340;&#27010;&#24565;&#65292;&#21487;&#29992;&#20110;&#35780;&#20272;&#25237;&#36164;&#20915;&#31574;&#21644;&#25351;&#23548;&#21327;&#35758;&#35774;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20174;&#34987;&#21160;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#35282;&#24230;&#32771;&#34385;&#20102;&#24120;&#37327;&#20989;&#25968;&#24066;&#22330;&#21046;&#36896;&#32773;&#65288;CFMM&#65289;&#30340;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#12290;&#22312;Black-Scholes&#24773;&#22659;&#19979;&#65292;&#25105;&#20204;&#27604;&#36739;CFMM&#30340;&#34920;&#29616;&#19982;&#20877;&#24179;&#34913;&#31574;&#30053;&#30340;&#34920;&#29616;&#65292;&#35813;&#31574;&#30053;&#22312;&#24066;&#22330;&#20215;&#26684;&#19978;&#22797;&#21046;CFMM&#30340;&#20132;&#26131;&#12290;&#30001;&#20110;CFMM&#20197;&#27604;&#24066;&#22330;&#20215;&#26684;&#26356;&#24046;&#30340;&#20215;&#26684;&#25191;&#34892;&#25152;&#26377;&#20132;&#26131;&#65292;&#22240;&#27492;CFMM&#31995;&#32479;&#22320;&#34920;&#29616;&#19981;&#20339;&#12290;&#20004;&#31181;&#31574;&#30053;&#20043;&#38388;&#30340;&#32489;&#25928;&#24046;&#24322;&#8220;&#25439;&#22833;&#19982;&#20877;&#24179;&#34913;&#8221;&#65288;LVR&#65292;&#21457;&#38899;&#20026;&#8220;lever&#8221;&#65289;&#21462;&#20915;&#20110;&#22522;&#30784;&#36164;&#20135;&#30340;&#27874;&#21160;&#29575;&#21644;CFMM bonding&#20989;&#25968;&#30340;&#36793;&#38469;&#27969;&#21160;&#24615;&#12290;&#25105;&#20204;&#27169;&#22411;&#20013;&#30340;CFMM&#25439;&#22833;&#34920;&#36798;&#24335;&#19982;Uniswap v2 WETH-USDC&#23545;&#30340;&#23454;&#38469;&#25439;&#22833;&#30456;&#21305;&#37197;&#12290;LVR&#20026;CFMM&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#25237;&#36164;&#20915;&#31574;&#30340;&#21069;&#21518;&#35780;&#20272;&#25552;&#20379;&#20102;&#21487;&#20132;&#26131;&#30340;&#35265;&#35299;&#65292;&#24182;&#19988;&#36824;&#21487;&#20197;&#25351;&#23548;CFMM&#21327;&#35758;&#30340;&#35774;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the market microstructure of constant function market makers (CFMMs) from the perspective of passive liquidity providers (LPs). In a Black-Scholes setting, we compare the CFMM's performance to that of a rebalancing strategy, which replicates the CFMM's trades at market prices. The CFMM systematically underperforms the rebalancing strategy, because it executes all trades at worse-than-market prices. The performance gap between the two strategies, "loss-versus-rebalancing" (LVR, pronounced "lever"), depends on the volatility of the underlying asset and the marginal liquidity of the CFMM bonding function. Our model's expressions for CFMM losses match actual losses from the Uniswap v2 WETH-USDC pair. LVR provides tradeable insight in both the ex ante and ex post assessment of CFMM LP investment decisions, and can also inform the design of CFMM protocols.
&lt;/p&gt;</description></item></channel></rss>