<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#21151;&#33021;&#24615;&#36755;&#20837;&#31070;&#32463;&#32593;&#32476;&#65292;&#21487;&#20197;&#22312;&#24102;&#26435;&#37325;&#31354;&#38388;&#19978;&#23436;&#25104;&#20840;&#23616;&#20989;&#25968;&#36924;&#36817;&#12290;&#36825;&#19968;&#26041;&#27861;&#36866;&#29992;&#20110;&#36830;&#32493;&#20989;&#25968;&#30340;&#25512;&#24191;&#65292;&#36824;&#21487;&#29992;&#20110;&#36335;&#24452;&#31354;&#38388;&#20989;&#25968;&#30340;&#36924;&#36817;&#65292;&#21516;&#26102;&#20063;&#21487;&#20197;&#36924;&#36817;&#32447;&#24615;&#20989;&#25968;&#31614;&#21517;&#12290;</title><link>http://arxiv.org/abs/2306.03303</link><description>&lt;p&gt;
&#24102;&#26435;&#37325;&#31354;&#38388;&#19978;&#21151;&#33021;&#24615;&#36755;&#20837;&#26144;&#23556;&#30340;&#20840;&#23616;&#26222;&#36866;&#36924;&#36817;
&lt;/p&gt;
&lt;p&gt;
Global universal approximation of functional input maps on weighted spaces. (arXiv:2306.03303v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.03303
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#21151;&#33021;&#24615;&#36755;&#20837;&#31070;&#32463;&#32593;&#32476;&#65292;&#21487;&#20197;&#22312;&#24102;&#26435;&#37325;&#31354;&#38388;&#19978;&#23436;&#25104;&#20840;&#23616;&#20989;&#25968;&#36924;&#36817;&#12290;&#36825;&#19968;&#26041;&#27861;&#36866;&#29992;&#20110;&#36830;&#32493;&#20989;&#25968;&#30340;&#25512;&#24191;&#65292;&#36824;&#21487;&#29992;&#20110;&#36335;&#24452;&#31354;&#38388;&#20989;&#25968;&#30340;&#36924;&#36817;&#65292;&#21516;&#26102;&#20063;&#21487;&#20197;&#36924;&#36817;&#32447;&#24615;&#20989;&#25968;&#31614;&#21517;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#25152;&#35859;&#30340;&#21151;&#33021;&#24615;&#36755;&#20837;&#31070;&#32463;&#32593;&#32476;&#65292;&#23450;&#20041;&#22312;&#21487;&#33021;&#26159;&#26080;&#38480;&#32500;&#24102;&#26435;&#37325;&#31354;&#38388;&#19978;&#65292;&#20854;&#20540;&#20063;&#22312;&#21487;&#33021;&#26159;&#26080;&#38480;&#32500;&#30340;&#36755;&#20986;&#31354;&#38388;&#20013;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#20351;&#29992;&#19968;&#20010;&#21152;&#24615;&#26063;&#20316;&#20026;&#38544;&#34255;&#23618;&#26144;&#23556;&#65292;&#20197;&#21450;&#19968;&#20010;&#38750;&#32447;&#24615;&#28608;&#27963;&#20989;&#25968;&#24212;&#29992;&#20110;&#27599;&#20010;&#38544;&#34255;&#23618;&#12290;&#20381;&#38752;&#24102;&#26435;&#37325;&#31354;&#38388;&#19978;&#30340;Stone-Weierstrass&#23450;&#29702;&#65292;&#25105;&#20204;&#21487;&#20197;&#35777;&#26126;&#36830;&#32493;&#20989;&#25968;&#30340;&#25512;&#24191;&#30340;&#20840;&#23616;&#26222;&#36866;&#36924;&#36817;&#32467;&#26524;&#65292;&#36229;&#36234;&#20102;&#24120;&#35268;&#32039;&#38598;&#36924;&#36817;&#12290;&#36825;&#29305;&#21035;&#36866;&#29992;&#20110;&#36890;&#36807;&#21151;&#33021;&#24615;&#36755;&#20837;&#31070;&#32463;&#32593;&#32476;&#36924;&#36817;&#65288;&#38750;&#20808;&#35265;&#20043;&#26126;&#30340;&#65289;&#36335;&#24452;&#31354;&#38388;&#20989;&#25968;&#12290;&#20316;&#20026;&#24102;&#26435;Stone-Weierstrass&#23450;&#29702;&#30340;&#36827;&#19968;&#27493;&#24212;&#29992;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#32447;&#24615;&#20989;&#25968;&#31614;&#21517;&#30340;&#20840;&#23616;&#26222;&#36866;&#36924;&#36817;&#32467;&#26524;&#12290;&#25105;&#20204;&#36824;&#22312;&#36825;&#20010;&#35774;&#32622;&#20013;&#24341;&#20837;&#20102;&#39640;&#26031;&#36807;&#31243;&#22238;&#24402;&#30340;&#35266;&#28857;&#65292;&#24182;&#23637;&#31034;&#20102;&#31614;&#21517;&#20869;&#26680;&#30340;&#20877;&#29983;&#26680;&#24076;&#23572;&#20271;&#29305;&#31354;&#38388;&#26159;&#26576;&#20123;&#39640;&#26031;&#36807;&#31243;&#30340;Cameron-Martin&#31354;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce so-called functional input neural networks defined on a possibly infinite dimensional weighted space with values also in a possibly infinite dimensional output space. To this end, we use an additive family as hidden layer maps and a non-linear activation function applied to each hidden layer. Relying on Stone-Weierstrass theorems on weighted spaces, we can prove a global universal approximation result for generalizations of continuous functions going beyond the usual approximation on compact sets. This then applies in particular to approximation of (non-anticipative) path space functionals via functional input neural networks. As a further application of the weighted Stone-Weierstrass theorem we prove a global universal approximation result for linear functions of the signature. We also introduce the viewpoint of Gaussian process regression in this setting and show that the reproducing kernel Hilbert space of the signature kernels are Cameron-Martin spaces of certain Gauss
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMMs&#65289;&#30340;&#20844;&#29702;&#26694;&#26550;&#65292;&#36890;&#36807;&#23545;&#24213;&#23618;&#25928;&#29992;&#20989;&#25968;&#26045;&#21152;&#21512;&#29702;&#30340;&#20844;&#29702;&#65292;&#25551;&#36848;&#20102;&#36164;&#20135;&#20114;&#25442;&#35268;&#27169;&#21644;&#32467;&#26524;&#23450;&#20215;&#39044;&#27979;&#30340;&#29305;&#24615;&#65292;&#24182;&#23450;&#20041;&#20102;&#19968;&#31181;&#26032;&#30340;&#20215;&#26684;&#24433;&#21709;&#24230;&#37327;&#26041;&#27861;&#12290;&#20998;&#26512;&#34920;&#26126;&#65292;&#22823;&#22810;&#25968;&#29616;&#26377;&#30340;AMMs&#28385;&#36275;&#36825;&#20123;&#20844;&#29702;&#12290;&#27492;&#22806;&#65292;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#36153;&#29992;&#32467;&#26500;&#65292;&#20351;&#24471;AMM&#23545;&#20132;&#26131;&#25286;&#20998;&#19981;&#25935;&#24863;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#20855;&#26377;&#33391;&#22909;&#20998;&#26512;&#29305;&#24615;&#24182;&#25552;&#20379;&#36739;&#22823;&#33539;&#22260;&#20869;&#26080;&#21457;&#25955;&#25439;&#22833;&#30340;&#26032;&#22411;AMM&#12290;</title><link>http://arxiv.org/abs/2210.01227</link><description>&lt;p&gt;
&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#30340;&#20844;&#29702;&#65306;&#37329;&#34701;&#31185;&#25216;&#21644;&#21435;&#20013;&#24515;&#21270;&#37329;&#34701;&#39046;&#22495;&#30340;&#25968;&#23398;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
Axioms for Automated Market Makers: A Mathematical Framework in FinTech and Decentralized Finance. (arXiv:2210.01227v2 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.01227
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMMs&#65289;&#30340;&#20844;&#29702;&#26694;&#26550;&#65292;&#36890;&#36807;&#23545;&#24213;&#23618;&#25928;&#29992;&#20989;&#25968;&#26045;&#21152;&#21512;&#29702;&#30340;&#20844;&#29702;&#65292;&#25551;&#36848;&#20102;&#36164;&#20135;&#20114;&#25442;&#35268;&#27169;&#21644;&#32467;&#26524;&#23450;&#20215;&#39044;&#27979;&#30340;&#29305;&#24615;&#65292;&#24182;&#23450;&#20041;&#20102;&#19968;&#31181;&#26032;&#30340;&#20215;&#26684;&#24433;&#21709;&#24230;&#37327;&#26041;&#27861;&#12290;&#20998;&#26512;&#34920;&#26126;&#65292;&#22823;&#22810;&#25968;&#29616;&#26377;&#30340;AMMs&#28385;&#36275;&#36825;&#20123;&#20844;&#29702;&#12290;&#27492;&#22806;&#65292;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#36153;&#29992;&#32467;&#26500;&#65292;&#20351;&#24471;AMM&#23545;&#20132;&#26131;&#25286;&#20998;&#19981;&#25935;&#24863;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#20855;&#26377;&#33391;&#22909;&#20998;&#26512;&#29305;&#24615;&#24182;&#25552;&#20379;&#36739;&#22823;&#33539;&#22260;&#20869;&#26080;&#21457;&#25955;&#25439;&#22833;&#30340;&#26032;&#22411;AMM&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMMs&#65289;&#30340;&#20844;&#29702;&#26694;&#26550;&#12290;&#36890;&#36807;&#23545;&#24213;&#23618;&#25928;&#29992;&#20989;&#25968;&#26045;&#21152;&#21512;&#29702;&#30340;&#20844;&#29702;&#65292;&#25105;&#20204;&#33021;&#22815;&#25551;&#36848;&#36164;&#20135;&#20114;&#25442;&#30340;&#35268;&#27169;&#21644;&#32467;&#26524;&#23450;&#20215;&#39044;&#27979;&#30340;&#29305;&#24615;&#12290;&#36890;&#36807;&#25552;&#20379;&#36825;&#20123;&#36890;&#29992;&#30340;AMM&#20844;&#29702;&#65292;&#25105;&#20204;&#23450;&#20041;&#20102;&#19968;&#31181;&#26032;&#30340;&#20215;&#26684;&#24433;&#21709;&#24230;&#37327;&#26041;&#27861;&#65292;&#21487;&#20197;&#29992;&#26469;&#37327;&#21270;&#19981;&#21516;&#26500;&#36896;&#20043;&#38388;&#30340;&#25104;&#26412;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#35768;&#22810;&#29616;&#26377;&#30340;AMMs&#65292;&#24182;&#35777;&#26126;&#20102;&#20854;&#20013;&#22823;&#22810;&#25968;&#28385;&#36275;&#25105;&#20204;&#30340;&#20844;&#29702;&#12290;&#25105;&#20204;&#36824;&#32771;&#34385;&#20102;&#36153;&#29992;&#21644;&#21457;&#25955;&#25439;&#22833;&#30340;&#38382;&#39064;&#12290;&#22312;&#27492;&#36807;&#31243;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#36153;&#29992;&#32467;&#26500;&#65292;&#20351;&#24471;AMM&#23545;&#20132;&#26131;&#25286;&#20998;&#19981;&#25935;&#24863;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20855;&#26377;&#33391;&#22909;&#20998;&#26512;&#29305;&#24615;&#24182;&#25552;&#20379;&#36739;&#22823;&#33539;&#22260;&#20869;&#26080;&#21457;&#25955;&#25439;&#22833;&#30340;&#26032;&#22411;AMM&#12290;
&lt;/p&gt;
&lt;p&gt;
Within this work we consider an axiomatic framework for Automated Market Makers (AMMs). By imposing reasonable axioms on the underlying utility function, we are able to characterize the properties of the swap size of the assets and of the resulting pricing oracle. In providing these general AMM axioms, we define a novel measure of price impacts that can be used to quantify those costs between different constructions. We have analyzed many existing AMMs and shown that the vast majority of them satisfy our axioms. We have also considered the question of fees and divergence loss. In doing so, we have proposed a new fee structure so as to make the AMM indifferent to transaction splitting. Finally, we have proposed a novel AMM that has nice analytical properties and provides a large range over which there is no divergence loss.
&lt;/p&gt;</description></item></channel></rss>