<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#22312;&#19968;&#33324;&#30340;&#26102;&#38388;&#38750;&#40784;&#27425;&#30701;&#26399;&#21033;&#29575;&#25193;&#25955;&#36807;&#31243;&#19979;&#23450;&#20215;&#20538;&#21048;&#65292;&#21253;&#25324;&#20538;&#21048;&#12289;&#20538;&#21048;&#26399;&#26435;&#12289;&#21487;&#36174;&#22238;/&#21487;&#20080;&#20837;&#20538;&#21048;&#21644;&#21487;&#36716;&#25442;&#20538;&#21048;&#65307;&#36890;&#36807;CTMC&#36817;&#20284;&#33719;&#24471;&#20102;&#38381;&#24335;&#30697;&#38453;&#34920;&#36798;&#24335;&#26469;&#36817;&#20284;&#35745;&#31639;&#20538;&#21048;&#21644;&#20538;&#21048;&#26399;&#26435;&#20215;&#26684;&#65307;&#24320;&#21457;&#20102;&#29992;&#20110;&#23450;&#20215;&#21487;&#36174;&#22238;/&#21487;&#20080;&#20837;&#20538;&#21153;&#30340;&#31616;&#21333;&#39640;&#25928;&#31639;&#27861;&#65307;&#21487;&#20197;&#23558;&#36817;&#20284;&#27169;&#22411;&#23436;&#32654;&#25311;&#21512;&#21040;&#24403;&#21069;&#24066;&#22330;&#21033;&#29575;&#26399;&#38480;&#32467;&#26500;&#12290;</title><link>https://arxiv.org/abs/2403.06303</link><description>&lt;p&gt;
&#19968;&#31181;&#20851;&#20110;&#20538;&#21048;&#23450;&#20215;&#30340;&#32479;&#19968;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Unifying Approach for the Pricing of Debt Securities
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.06303
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#22312;&#19968;&#33324;&#30340;&#26102;&#38388;&#38750;&#40784;&#27425;&#30701;&#26399;&#21033;&#29575;&#25193;&#25955;&#36807;&#31243;&#19979;&#23450;&#20215;&#20538;&#21048;&#65292;&#21253;&#25324;&#20538;&#21048;&#12289;&#20538;&#21048;&#26399;&#26435;&#12289;&#21487;&#36174;&#22238;/&#21487;&#20080;&#20837;&#20538;&#21048;&#21644;&#21487;&#36716;&#25442;&#20538;&#21048;&#65307;&#36890;&#36807;CTMC&#36817;&#20284;&#33719;&#24471;&#20102;&#38381;&#24335;&#30697;&#38453;&#34920;&#36798;&#24335;&#26469;&#36817;&#20284;&#35745;&#31639;&#20538;&#21048;&#21644;&#20538;&#21048;&#26399;&#26435;&#20215;&#26684;&#65307;&#24320;&#21457;&#20102;&#29992;&#20110;&#23450;&#20215;&#21487;&#36174;&#22238;/&#21487;&#20080;&#20837;&#20538;&#21153;&#30340;&#31616;&#21333;&#39640;&#25928;&#31639;&#27861;&#65307;&#21487;&#20197;&#23558;&#36817;&#20284;&#27169;&#22411;&#23436;&#32654;&#25311;&#21512;&#21040;&#24403;&#21069;&#24066;&#22330;&#21033;&#29575;&#26399;&#38480;&#32467;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#22312;&#19968;&#33324;&#30340;&#26102;&#38388;&#38750;&#40784;&#27425;&#30701;&#26399;&#21033;&#29575;&#25193;&#25955;&#36807;&#31243;&#19979;&#23450;&#20215;&#20538;&#21048;&#12290;&#28085;&#30422;&#20102;&#20538;&#21048;&#12289;&#20538;&#21048;&#26399;&#26435;&#12289;&#21487;&#36174;&#22238;/&#21487;&#20080;&#20837;&#20538;&#21048;&#21644;&#21487;&#36716;&#25442;&#20538;&#21048;(CBs)&#30340;&#23450;&#20215;&#12290;&#36890;&#36807;&#36830;&#32493;&#26102;&#38388;&#39532;&#23572;&#21487;&#22827;&#38142; (CTMC) &#36817;&#20284;&#65292;&#25105;&#20204;&#33719;&#24471;&#20102;&#29992;&#20110;&#22312;&#19968;&#33324;&#19968;&#32500;&#30701;&#26399;&#21033;&#29575;&#36807;&#31243;&#19979;&#36817;&#20284;&#35745;&#31639;&#20538;&#21048;&#21644;&#20538;&#21048;&#26399;&#26435;&#20215;&#26684;&#30340;&#38381;&#24335;&#30697;&#38453;&#34920;&#36798;&#24335;&#12290;&#36824;&#24320;&#21457;&#20102;&#19968;&#31181;&#31616;&#21333;&#19988;&#39640;&#25928;&#30340;&#31639;&#27861;&#26469;&#23450;&#20215;&#21487;&#36174;&#22238;/&#21487;&#20080;&#20837;&#20538;&#21153;&#12290;&#38646;&#24687;&#20538;&#21048;&#20215;&#26684;&#30340;&#38381;&#24335;&#34920;&#36798;&#24335;&#30340;&#21487;&#29992;&#24615;&#20801;&#35768;&#23558;&#36817;&#20284;&#27169;&#22411;&#23436;&#32654;&#25311;&#21512;&#21040;&#24403;&#21069;&#24066;&#22330;&#21033;&#29575;&#26399;&#38480;&#32467;&#26500;&#65292;&#26080;&#35770;&#25152;&#36873;&#30340;&#22522;&#30784;&#25193;&#25955;&#36807;&#31243;&#30340;&#22797;&#26434;&#24615;&#22914;&#20309;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#32771;&#34385;&#20102;&#22312;&#19968;&#33324;&#30340;&#21452;&#21521;&#26102;&#38388;&#38750;&#40784;&#27425;&#25193;&#25955;&#36807;&#31243;&#19979;&#23545;&#21487;&#36716;&#25442;&#20538;&#21048;&#65288;CBs&#65289;&#30340;&#23450;&#20215;&#65292;&#20197;&#24314;&#27169;&#32929;&#31080;&#21644;&#30701;&#26399;&#21033;&#29575;&#21160;&#21147;&#23398;&#12290;&#20063;&#32771;&#34385;&#20102;&#20449;&#29992;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06303v1 Announce Type: new  Abstract: We propose a unifying framework for the pricing of debt securities under general time-inhomogeneous short-rate diffusion processes. The pricing of bonds, bond options, callable/putable bonds, and convertible bonds (CBs) are covered. Using continuous-time Markov chain (CTMC) approximation, we obtain closed-form matrix expressions to approximate the price of bonds and bond options under general one-dimensional short-rate processes. A simple and efficient algorithm is also developed to price callable/putable debts. The availability of a closed-form expression for the price of zero-coupon bonds allows for the perfect fit of the approximated model to the current market term structure of interest rates, regardless of the complexity of the underlying diffusion process selected. We further consider the pricing of CBs under general bi-dimensional time-inhomogeneous diffusion processes to model equity and short-rate dynamics. Credit risk is also i
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20351;&#29992;&#38543;&#26426;&#21270;&#25311;&#33945;&#29305;&#21345;&#27931;&#31215;&#20998;&#26469;&#25552;&#39640;&#20613;&#37324;&#21494;&#26041;&#27861;&#22312;&#39640;&#32500;&#24773;&#22659;&#19979;&#30340;&#21487;&#25193;&#23637;&#24615;&#65292;&#20197;&#35299;&#20915;&#39640;&#25928;&#23450;&#20215;&#22810;&#36164;&#20135;&#26399;&#26435;&#30340;&#25361;&#25112;&#12290;</title><link>https://arxiv.org/abs/2403.02832</link><description>&lt;p&gt;
&#39640;&#25928;&#20613;&#37324;&#21494;&#23450;&#20215;&#22810;&#36164;&#20135;&#26399;&#26435;&#30340;&#25311;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Quasi-Monte Carlo for Efficient Fourier Pricing of Multi-Asset Options
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.02832
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20351;&#29992;&#38543;&#26426;&#21270;&#25311;&#33945;&#29305;&#21345;&#27931;&#31215;&#20998;&#26469;&#25552;&#39640;&#20613;&#37324;&#21494;&#26041;&#27861;&#22312;&#39640;&#32500;&#24773;&#22659;&#19979;&#30340;&#21487;&#25193;&#23637;&#24615;&#65292;&#20197;&#35299;&#20915;&#39640;&#25928;&#23450;&#20215;&#22810;&#36164;&#20135;&#26399;&#26435;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#23450;&#37327;&#37329;&#34701;&#20013;&#65292;&#39640;&#25928;&#23450;&#20215;&#22810;&#36164;&#20135;&#26399;&#26435;&#26159;&#19968;&#20010;&#37325;&#35201;&#25361;&#25112;&#12290;&#33945;&#29305;&#21345;&#27931;&#65288;MC&#65289;&#26041;&#27861;&#20173;&#28982;&#26159;&#23450;&#20215;&#24341;&#25806;&#30340;&#20027;&#35201;&#36873;&#25321;&#65307;&#28982;&#32780;&#65292;&#20854;&#25910;&#25947;&#36895;&#24230;&#24930;&#38459;&#30861;&#20102;&#20854;&#23454;&#38469;&#24212;&#29992;&#12290;&#20613;&#37324;&#21494;&#26041;&#27861;&#21033;&#29992;&#29305;&#24449;&#20989;&#25968;&#30340;&#30693;&#35782;&#65292;&#20934;&#30830;&#24555;&#36895;&#22320;&#20272;&#20540;&#22810;&#36798;&#20004;&#20010;&#36164;&#20135;&#30340;&#26399;&#26435;&#12290;&#28982;&#32780;&#65292;&#22312;&#39640;&#32500;&#35774;&#32622;&#20013;&#65292;&#30001;&#20110;&#24120;&#29992;&#30340;&#31215;&#20998;&#25216;&#26415;&#20855;&#26377;&#24352;&#37327;&#31215;&#65288;TP&#65289;&#32467;&#26500;&#65292;&#23427;&#20204;&#38754;&#20020;&#38556;&#30861;&#12290;&#26412;&#25991;&#20027;&#24352;&#20351;&#29992;&#38543;&#26426;&#21270;&#25311;&#33945;&#29305;&#21345;&#27931;&#65288;RQMC&#65289;&#31215;&#20998;&#26469;&#25913;&#21892;&#39640;&#32500;&#20613;&#37324;&#21494;&#26041;&#27861;&#30340;&#21487;&#25193;&#23637;&#24615;&#12290;RQMC&#25216;&#26415;&#21463;&#30410;&#20110;&#34987;&#31215;&#20989;&#25968;&#30340;&#20809;&#28369;&#24615;&#65292;&#32531;&#35299;&#20102;&#32500;&#24230;&#28798;&#38590;&#65292;&#21516;&#26102;&#25552;&#20379;&#20102;&#23454;&#29992;&#30340;&#35823;&#24046;&#20272;&#35745;&#12290;&#28982;&#32780;&#65292;RQMC&#22312;&#26080;&#30028;&#22495;$\mathbb{R}^d$&#19978;&#30340;&#36866;&#29992;&#24615;&#38656;&#35201;&#23558;&#22495;&#36716;&#25442;&#20026;$[0,1]^d$&#65292;&#36825;&#21487;&#33021;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.02832v1 Announce Type: new  Abstract: Efficiently pricing multi-asset options poses a significant challenge in quantitative finance. The Monte Carlo (MC) method remains the prevalent choice for pricing engines; however, its slow convergence rate impedes its practical application. Fourier methods leverage the knowledge of the characteristic function to accurately and rapidly value options with up to two assets. Nevertheless, they face hurdles in the high-dimensional settings due to the tensor product (TP) structure of commonly employed quadrature techniques. This work advocates using the randomized quasi-MC (RQMC) quadrature to improve the scalability of Fourier methods with high dimensions. The RQMC technique benefits from the smoothness of the integrand and alleviates the curse of dimensionality while providing practical error estimates. Nonetheless, the applicability of RQMC on the unbounded domain, $\mathbb{R}^d$, requires a domain transformation to $[0,1]^d$, which may r
&lt;/p&gt;</description></item><item><title>&#20004;&#31181;&#20135;&#21697;&#21487;&#20197;&#25104;&#20026;&#28040;&#36153;&#32773;&#30340;&#20114;&#34917;&#21697;&#20294;&#23545;&#20013;&#38388;&#21830;&#26469;&#35828;&#26159;&#26367;&#20195;&#21697;&#65292;&#20174;&#32780;&#23548;&#33268;&#20215;&#26684;&#19978;&#28072;&#12290;</title><link>https://arxiv.org/abs/2402.12575</link><description>&lt;p&gt;
&#20849;&#21516;&#39038;&#23458;&#30340;&#36328;&#24066;&#22330;&#24182;&#36141;&#65306;&#20309;&#26102;&#65288;&#20197;&#21450;&#20026;&#20160;&#20040;&#65289;&#20250;&#22686;&#21152;&#35848;&#21028;&#20215;&#26684;&#65311;
&lt;/p&gt;
&lt;p&gt;
Cross-Market Mergers with Common Customers: When (and Why) Do They Increase Negotiated Prices?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12575
&lt;/p&gt;
&lt;p&gt;
&#20004;&#31181;&#20135;&#21697;&#21487;&#20197;&#25104;&#20026;&#28040;&#36153;&#32773;&#30340;&#20114;&#34917;&#21697;&#20294;&#23545;&#20013;&#38388;&#21830;&#26469;&#35828;&#26159;&#26367;&#20195;&#21697;&#65292;&#20174;&#32780;&#23548;&#33268;&#20215;&#26684;&#19978;&#28072;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#30740;&#31350;&#20102;&#20379;&#24212;&#21830;&#21040;&#20013;&#38388;&#21830;&#30340;&#36328;&#24066;&#22330;&#24182;&#36141;&#23545;&#20026;&#28040;&#36153;&#32773;&#25414;&#32465;&#20135;&#21697;&#30340;&#24433;&#21709;&#12290;&#36825;&#20123;&#24182;&#36141;&#22791;&#21463;&#20105;&#35758;&#12290;&#19968;&#20123;&#20154;&#35748;&#20026;&#20379;&#24212;&#21830;&#30340;&#20135;&#21697;&#20250;&#25104;&#20026;&#20013;&#38388;&#21830;&#30340;&#26367;&#20195;&#21697;&#65292;&#23613;&#31649;&#19981;&#26159;&#28040;&#36153;&#32773;&#30340;&#26367;&#20195;&#21697;&#12290;&#20854;&#20182;&#20154;&#35748;&#20026;&#65292;&#30001;&#20110;&#25414;&#32465;&#20351;&#20135;&#21697;&#25104;&#20026;&#28040;&#36153;&#32773;&#30340;&#20114;&#34917;&#20135;&#21697;&#65292;&#20135;&#21697;&#24517;&#39035;&#25104;&#20026;&#20013;&#38388;&#21830;&#30340;&#20114;&#34917;&#20135;&#21697;&#12290;&#25105;&#36890;&#36807;&#23637;&#31034;&#24403;&#20135;&#21697;&#22312;&#21560;&#24341;&#28040;&#36153;&#32773;&#36141;&#20080;&#25414;&#32465;&#21253;&#26102;&#21457;&#25381;&#31867;&#20284;&#20316;&#29992;&#26102;&#65292;&#20004;&#31181;&#20135;&#21697;&#21487;&#20197;&#25104;&#20026;&#28040;&#36153;&#32773;&#30340;&#20114;&#34917;&#21697;&#20294;&#23545;&#20013;&#38388;&#21830;&#26469;&#35828;&#26159;&#26367;&#20195;&#21697;&#65292;&#20026;&#36825;&#19968;&#36777;&#35770;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;&#36825;&#19968;&#32467;&#26524;&#24102;&#26469;&#20102;&#26032;&#30340;&#24314;&#35758;&#65292;&#24182;&#26377;&#21161;&#20110;&#35299;&#37322;&#20026;&#20160;&#20040;&#36328;&#24066;&#22330;&#21307;&#38498;&#24182;&#36141;&#20250;&#25552;&#39640;&#20215;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12575v1 Announce Type: new  Abstract: I examine the implications of cross-market mergers of suppliers to intermediaries that bundle products for consumers. These mergers are controversial. Some argue that suppliers' products will be substitutes for intermediaries, despite not being substitutes for consumers. Others contend that because bundling makes products complements for consumers, products must be complements for intermediaries. I contribute to this debate by showing that two products can be complements for consumers but substitutes for intermediaries when the products serve a similar role in attracting consumers to purchase the bundle. This result leads to new recommendations and helps explain why cross-market hospital mergers raise prices.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#31038;&#20250;&#30899;&#25104;&#26412;&#20272;&#35745;&#20803;&#20998;&#26512;&#25968;&#25454;&#24211;&#30340;&#26032;&#29256;&#26412;&#65292;&#26032;&#22686;&#20102;&#20851;&#20110;&#27668;&#20505;&#21464;&#21270;&#24433;&#21709;&#21644;&#31119;&#21033;&#20989;&#25968;&#24418;&#29366;&#30340;&#23383;&#27573;&#65292;&#24182;&#25193;&#23637;&#20102;&#21512;&#20316;&#32773;&#21644;&#24341;&#29992;&#32593;&#32476;&#12290;</title><link>https://arxiv.org/abs/2402.09125</link><description>&lt;p&gt;
&#31038;&#20250;&#30899;&#25104;&#26412;&#30340;&#20803;&#20998;&#26512;&#25968;&#25454;&#24211; (v2024.0)
&lt;/p&gt;
&lt;p&gt;
Database for the meta-analysis of the social cost of carbon (v2024.0)
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09125
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#31038;&#20250;&#30899;&#25104;&#26412;&#20272;&#35745;&#20803;&#20998;&#26512;&#25968;&#25454;&#24211;&#30340;&#26032;&#29256;&#26412;&#65292;&#26032;&#22686;&#20102;&#20851;&#20110;&#27668;&#20505;&#21464;&#21270;&#24433;&#21709;&#21644;&#31119;&#21033;&#20989;&#25968;&#24418;&#29366;&#30340;&#23383;&#27573;&#65292;&#24182;&#25193;&#23637;&#20102;&#21512;&#20316;&#32773;&#21644;&#24341;&#29992;&#32593;&#32476;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#31038;&#20250;&#30899;&#25104;&#26412;&#20272;&#35745;&#20803;&#20998;&#26512;&#25968;&#25454;&#24211;&#30340;&#26032;&#29256;&#26412;&#12290;&#26032;&#22686;&#20102;&#35760;&#24405;&#65292;&#24182;&#28155;&#21152;&#20102;&#20851;&#20110;&#27668;&#20505;&#21464;&#21270;&#24433;&#21709;&#21644;&#31119;&#21033;&#20989;&#25968;&#24418;&#29366;&#30340;&#26032;&#23383;&#27573;&#12290;&#35813;&#25968;&#25454;&#24211;&#36824;&#25193;&#23637;&#20102;&#21512;&#20316;&#32773;&#21644;&#24341;&#29992;&#32593;&#32476;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09125v1 Announce Type: new Abstract: A new version of the database for the meta-analysis of estimates of the social cost of carbon is presented. New records were added, and new fields on the impact of climate change and the shape of the welfare function. The database was extended to co-author and citation networks.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#32473;&#20986;&#20102;&#22312;&#23567;&#22411;&#21644;&#22823;&#22411;&#37329;&#34701;&#24066;&#22330;&#20013;&#65292;&#24403;&#22238;&#25253;&#21521;&#37327;&#36981;&#24490;&#27491;&#24577;&#22343;&#20540;&#26041;&#24046;&#28151;&#21512;&#27169;&#22411;&#26102;&#65292;&#26368;&#22823;&#21270;&#25351;&#25968;&#25928;&#29992;&#30340;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#30340;&#38381;&#21512;&#24418;&#24335;&#65292;&#24182;&#35777;&#26126;&#22312;&#25351;&#25968;&#25928;&#29992;&#19979;&#65292;&#23567;&#22411;&#24066;&#22330;&#30340;&#26368;&#20248;&#25928;&#29992;&#23558;&#25910;&#25947;&#21040;&#22823;&#22411;&#24066;&#22330;&#30340;&#26368;&#20248;&#25928;&#29992;&#12290;</title><link>https://arxiv.org/abs/2208.06549</link><description>&lt;p&gt;
&#23567;/&#22823;&#22411;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#25351;&#25968;&#25928;&#29992;&#26368;&#22823;&#21270;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Exponential utility maximization in small/large financial markets
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2208.06549
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32473;&#20986;&#20102;&#22312;&#23567;&#22411;&#21644;&#22823;&#22411;&#37329;&#34701;&#24066;&#22330;&#20013;&#65292;&#24403;&#22238;&#25253;&#21521;&#37327;&#36981;&#24490;&#27491;&#24577;&#22343;&#20540;&#26041;&#24046;&#28151;&#21512;&#27169;&#22411;&#26102;&#65292;&#26368;&#22823;&#21270;&#25351;&#25968;&#25928;&#29992;&#30340;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#30340;&#38381;&#21512;&#24418;&#24335;&#65292;&#24182;&#35777;&#26126;&#22312;&#25351;&#25968;&#25928;&#29992;&#19979;&#65292;&#23567;&#22411;&#24066;&#22330;&#30340;&#26368;&#20248;&#25928;&#29992;&#23558;&#25910;&#25947;&#21040;&#22823;&#22411;&#24066;&#22330;&#30340;&#26368;&#20248;&#25928;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#22238;&#25253;&#21521;&#37327;&#36981;&#24490;&#27604;&#27491;&#24577;&#20998;&#24067;&#26356;&#19968;&#33324;&#30340;&#20998;&#24067;&#26102;&#65292;&#22312;&#38381;&#21512;&#24418;&#24335;&#20013;&#33719;&#24471;&#26368;&#22823;&#25928;&#29992;&#30340;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#26159;&#19968;&#20010;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#38382;&#39064;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#32473;&#20986;&#20102;&#22312;&#20165;&#22522;&#20110;&#26377;&#38480;&#36164;&#20135;&#30340;&#24066;&#22330;&#20013;&#65292;&#24403;&#22238;&#25253;&#21521;&#37327;&#36981;&#24490;&#27491;&#24577;&#22343;&#20540;&#26041;&#24046;&#28151;&#21512;&#27169;&#22411;&#26102;&#65292;&#26368;&#22823;&#21270;&#26399;&#26395;&#25351;&#25968;&#25928;&#29992;&#30340;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#30340;&#38381;&#21512;&#24418;&#24335;&#34920;&#36798;&#24335;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#36824;&#32771;&#34385;&#20102;&#22522;&#20110;&#27491;&#24577;&#22343;&#20540;&#26041;&#24046;&#28151;&#21512;&#27169;&#22411;&#30340;&#22823;&#22411;&#37329;&#34701;&#24066;&#22330;&#65292;&#24182;&#35777;&#26126;&#22312;&#25351;&#25968;&#25928;&#29992;&#19979;&#65292;&#22522;&#20110;&#23567;&#22411;&#24066;&#22330;&#30340;&#26368;&#20248;&#25928;&#29992;&#20250;&#25910;&#25947;&#21040;&#22823;&#22411;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#26368;&#20248;&#25928;&#29992;&#12290;&#35813;&#32467;&#26524;&#29305;&#21035;&#34920;&#26126;&#65292;&#20026;&#20102;&#36798;&#21040;&#26368;&#20248;&#25928;&#29992;&#27700;&#24179;&#65292;&#25237;&#36164;&#32773;&#38656;&#35201;&#36890;&#36807;&#23558;&#26080;&#38480;&#22810;&#30340;&#36164;&#20135;&#21253;&#21547;&#22312;&#20854;&#25237;&#36164;&#32452;&#21512;&#20013;&#36827;&#34892;&#22810;&#26679;&#21270;&#65292;&#24182;&#19988;&#22522;&#20110;&#20165;&#26377;&#26377;&#38480;&#36164;&#20135;&#38598;&#21512;&#30340;&#25237;&#36164;&#32452;&#21512;&#65292;&#20182;&#20204;&#27704;&#36828;&#26080;&#27861;&#36798;&#21040;&#26368;&#20248;&#25928;&#29992;&#27700;&#24179;&#12290;&#26412;&#25991;&#36824;&#32771;&#34385;&#20102;&#26356;&#21152;&#22797;&#26434;&#30340;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
Obtaining utility maximizing optimal portfolios in closed form is a challenging issue when the return vector follows a more general distribution than the normal one. In this note, we give closed form expressions, in markets based on finitely many assets, for optimal portfolios that maximize the expected exponential utility when the return vector follows normal mean-variance mixture models. We then consider large financial markets based on normal mean-variance mixture models also and show that, under exponential utility, the optimal utilities based on small markets converge to the optimal utility in the large financial market. This result shows, in particular, that to reach optimal utility level investors need to diversify their portfolios to include infinitely many assets into their portfolio and with portfolios based on any set of only finitely many assets, they never be able to reach optimum level of utility. In this paper, we also consider portfolio optimization problems with more g
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#29992;&#20110;&#39118;&#38505;&#20215;&#20540;&#65288;VaR&#65289;&#21644;CoVaR&#30340;&#32852;&#21512;&#21160;&#24577;&#39044;&#27979;&#27169;&#22411;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#65292;&#24182;&#22312;&#32654;&#22269;&#22823;&#22411;&#38134;&#34892;&#30340;&#23454;&#35777;&#20998;&#26512;&#20013;&#23637;&#31034;&#20102;&#20854;&#20248;&#36234;&#24615;&#12290;</title><link>https://arxiv.org/abs/2206.14275</link><description>&lt;p&gt;
&#21160;&#24577;CoVaR&#24314;&#27169;
&lt;/p&gt;
&lt;p&gt;
Dynamic CoVaR Modeling
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2206.14275
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#29992;&#20110;&#39118;&#38505;&#20215;&#20540;&#65288;VaR&#65289;&#21644;CoVaR&#30340;&#32852;&#21512;&#21160;&#24577;&#39044;&#27979;&#27169;&#22411;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#65292;&#24182;&#22312;&#32654;&#22269;&#22823;&#22411;&#38134;&#34892;&#30340;&#23454;&#35777;&#20998;&#26512;&#20013;&#23637;&#31034;&#20102;&#20854;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
CoVaR&#65288;&#26465;&#20214;&#39118;&#38505;&#20215;&#20540;&#65289;&#26159;&#19968;&#31181;&#27969;&#34892;&#30340;&#31995;&#32479;&#39118;&#38505;&#24230;&#37327;&#26041;&#27861;&#65292;&#22312;&#32463;&#27982;&#23398;&#21644;&#37329;&#34701;&#39046;&#22495;&#34987;&#24191;&#27867;&#20351;&#29992;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#29992;&#20110;&#39118;&#38505;&#20215;&#20540;&#65288;VaR&#65289;&#21644;CoVaR&#30340;&#32852;&#21512;&#21160;&#24577;&#39044;&#27979;&#27169;&#22411;&#12290;&#25105;&#20204;&#36824;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#26368;&#36817;&#25552;&#20986;&#30340;VaR&#21644;CoVaR&#23545;&#30340;&#21452;&#21464;&#37327;&#35780;&#20998;&#20989;&#25968;&#30340;&#27169;&#22411;&#21442;&#25968;&#30340;&#20004;&#27493;M&#20272;&#35745;&#37327;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#21442;&#25968;&#20272;&#35745;&#37327;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#65292;&#24182;&#20998;&#26512;&#20102;&#23427;&#22312;&#27169;&#25311;&#20013;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#36136;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#21160;&#24577;&#39044;&#27979;&#27169;&#22411;&#30340;&#19968;&#20010;&#29305;&#23450;&#23376;&#31867;&#24212;&#29992;&#20110;&#32654;&#22269;&#22823;&#22411;&#38134;&#34892;&#30340;&#23545;&#25968;&#25910;&#30410;&#29575;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;CoCAViaR&#27169;&#22411;&#20135;&#29983;&#30340;CoVaR&#39044;&#27979;&#20248;&#20110;&#24403;&#21069;&#22522;&#20934;&#27169;&#22411;&#21457;&#24067;&#30340;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2206.14275v3 Announce Type: replace  Abstract: The popular systemic risk measure CoVaR (conditional Value-at-Risk) is widely used in economics and finance. Formally, it is defined as a large quantile of one variable (e.g., losses in the financial system) conditional on some other variable (e.g., losses in a bank's shares) being in distress. In this article, we propose joint dynamic forecasting models for the Value-at-Risk (VaR) and CoVaR. We also introduce a two-step M-estimator for the model parameters drawing on recently proposed bivariate scoring functions for the pair (VaR, CoVaR). We prove consistency and asymptotic normality of our parameter estimator and analyze its finite-sample properties in simulations. Finally, we apply a specific subclass of our dynamic forecasting models, which we call CoCAViaR models, to log-returns of large US banks. It is shown that our CoCAViaR models generate CoVaR predictions that are superior to forecasts issued from current benchmark models.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#31639;&#27861;&#23398;&#20064;&#31454;&#26631;&#26102;&#19981;&#21516;&#25903;&#20184;&#35268;&#21017;&#23545;&#25928;&#29575;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#25903;&#20184;&#35268;&#21017;&#23545;&#31454;&#25293;&#25928;&#29575;&#33267;&#20851;&#37325;&#35201;&#12290;</title><link>http://arxiv.org/abs/2306.09437</link><description>&lt;p&gt;
&#24403;&#31639;&#27861;&#23398;&#20064;&#31454;&#26631;&#26102;&#30340;&#25293;&#21334;&#35774;&#35745;&#65306;&#25903;&#20184;&#35268;&#21017;&#30340;&#37325;&#35201;&#20316;&#29992;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Designing Auctions when Algorithms Learn to Bid: The critical role of Payment Rules. (arXiv:2306.09437v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09437
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31639;&#27861;&#23398;&#20064;&#31454;&#26631;&#26102;&#19981;&#21516;&#25903;&#20184;&#35268;&#21017;&#23545;&#25928;&#29575;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#25903;&#20184;&#35268;&#21017;&#23545;&#31454;&#25293;&#25928;&#29575;&#33267;&#20851;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31639;&#27861;&#23398;&#20064;&#31454;&#26631;&#26102;&#19981;&#21516;&#25903;&#20184;&#35268;&#21017;&#23545;&#25928;&#29575;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#20010;&#23436;&#20840;&#38543;&#26426;&#23454;&#39564;&#65292;&#36827;&#34892;&#20102;427&#27425;&#35797;&#39564;&#65292;&#20854;&#20013;Q-learning&#30340;&#31454;&#26631;&#32773;&#21442;&#21152;&#20102;&#39640;&#36798;250,000&#27425;&#20851;&#20110;&#20849;&#21516;&#35780;&#20272;&#39033;&#30340;&#31454;&#25293;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#21457;&#29616;&#65292;&#31532;&#19968;&#20215;&#26684;&#25293;&#21334;&#65292;&#21363;&#32988;&#21033;&#32773;&#25903;&#20184;&#33719;&#32988;&#20986;&#20215;&#65292;&#23481;&#26131;&#21463;&#21040;&#21327;&#35843;&#31454;&#26631;&#21387;&#21046;&#65292;&#32988;&#20986;&#20986;&#20215;&#24179;&#22343;&#20302;&#20110;&#30495;&#23454;&#20215;&#20540;&#32422;20%&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#31532;&#20108;&#20215;&#26684;&#25293;&#21334;&#65292;&#21363;&#32988;&#21033;&#32773;&#25903;&#20184;&#31532;&#20108;&#39640;&#20986;&#20215;&#65292;&#20351;&#33719;&#32988;&#20986;&#20215;&#19982;&#23454;&#38469;&#20215;&#20540;&#19968;&#33268;&#65292;&#20943;&#23569;&#23398;&#20064;&#26399;&#38388;&#30340;&#27874;&#21160;&#24182;&#21152;&#24555;&#25910;&#25947;&#36895;&#24230;&#12290;&#22238;&#24402;&#20998;&#26512;&#32771;&#34385;&#20102;&#35832;&#22914;&#25903;&#20184;&#35268;&#21017;&#12289;&#21442;&#19982;&#20154;&#25968;&#12289;&#25240;&#25187;&#21644;&#23398;&#20064;&#29575;&#31561;&#31639;&#27861;&#22240;&#32032;&#12289;&#24322;&#27493;/&#21516;&#27493;&#26356;&#26032;&#12289;&#21453;&#39304;&#21644;&#25506;&#32034;&#31574;&#30053;&#31561;&#35774;&#35745;&#22240;&#32032;&#65292;&#21457;&#29616;&#25903;&#20184;&#35268;&#21017;&#23545;&#25928;&#29575;&#33267;&#20851;&#37325;&#35201;&#12290;&#27492;&#22806;&#65292;&#26426;&#22120;&#23398;&#20064;&#20272;&#35745;&#22120;&#21457;&#29616;&#65292;&#25903;&#20184;&#35268;&#21017;&#29978;&#33267;&#27604;&#20854;&#20182;&#22240;&#32032;&#26356;&#21152;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper examines the impact of different payment rules on efficiency when algorithms learn to bid. We use a fully randomized experiment of 427 trials, where Q-learning bidders participate in up to 250,000 auctions for a commonly valued item. The findings reveal that the first price auction, where winners pay the winning bid, is susceptible to coordinated bid suppression, with winning bids averaging roughly 20% below the true values. In contrast, the second price auction, where winners pay the second highest bid, aligns winning bids with actual values, reduces the volatility during learning and speeds up convergence. Regression analysis, incorporating design elements such as payment rules, number of participants, algorithmic factors including the discount and learning rate, asynchronous/synchronous updating, feedback, and exploration strategies, discovers the critical role of payment rules on efficiency. Furthermore, machine learning estimators find that payment rules matter even mor
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#37319;&#29992;&#22810;&#20803;&#36164;&#20135;&#27169;&#22411;&#22522;&#20110;L&#233;vy&#36807;&#31243;&#65292;&#29992;&#20110;&#23450;&#20215;&#24322;&#31867;&#34893;&#29983;&#21697;&#65292;&#30528;&#37325;&#32771;&#34385;&#27169;&#22411;&#25429;&#25417;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#20381;&#36182;&#30340;&#33021;&#21147;&#12290;&#36890;&#36807;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#36827;&#34892;&#20272;&#20540;&#12290;</title><link>http://arxiv.org/abs/2303.13346</link><description>&lt;p&gt;
&#22810;&#20803;L&#233;vy&#27169;&#22411;&#65306;&#26657;&#20934;&#19982;&#23450;&#20215;&#12290;
&lt;/p&gt;
&lt;p&gt;
Multivariate L\'evy Models: Calibration and Pricing. (arXiv:2303.13346v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.13346
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#37319;&#29992;&#22810;&#20803;&#36164;&#20135;&#27169;&#22411;&#22522;&#20110;L&#233;vy&#36807;&#31243;&#65292;&#29992;&#20110;&#23450;&#20215;&#24322;&#31867;&#34893;&#29983;&#21697;&#65292;&#30528;&#37325;&#32771;&#34385;&#27169;&#22411;&#25429;&#25417;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#20381;&#36182;&#30340;&#33021;&#21147;&#12290;&#36890;&#36807;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#36827;&#34892;&#20272;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#37319;&#29992;&#22522;&#20110;L&#233;vy&#36807;&#31243;&#30340;&#22810;&#20803;&#36164;&#20135;&#27169;&#22411;&#65292;&#29992;&#20110;&#23450;&#20215;&#24322;&#31867;&#34893;&#29983;&#21697;&#12290;&#25105;&#20204;&#27604;&#36739;&#23427;&#20204;&#25311;&#21512;&#24066;&#22330;&#25968;&#25454;&#21644;&#22797;&#21046;&#20215;&#26684;&#22522;&#20934;&#30340;&#33021;&#21147;&#65292;&#35780;&#20272;&#23427;&#20204;&#22312;&#21442;&#25968;&#21270;&#21644;&#20381;&#36182;&#32467;&#26500;&#26041;&#38754;&#30340;&#28789;&#27963;&#24615;&#12290;&#25105;&#20204;&#22238;&#39038;&#20102;&#26368;&#36817;&#22312;&#22810;&#20803;&#35774;&#23450;&#20013;&#30340;&#39118;&#38505;&#20013;&#24615;&#26657;&#20934;&#26041;&#27861;&#21644;&#25216;&#26415;&#65292;&#24182;&#25552;&#20379;&#20102;&#22312;&#23454;&#38469;&#24773;&#20917;&#19979;&#20570;&#20986;&#26126;&#26234;&#20915;&#31574;&#30340;&#24037;&#20855;&#12290;&#29305;&#21035;&#20851;&#27880;&#27169;&#22411;&#25429;&#25417;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#20381;&#36182;&#30340;&#33021;&#21147;&#65292;&#23545;&#20854;&#23450;&#20215;&#24615;&#33021;&#20135;&#29983;&#24433;&#21709;&#12290;&#37492;&#20110;&#20998;&#26512;&#34893;&#29983;&#21697;&#30340;&#24322;&#31867;&#29305;&#24615;&#65292;&#20272;&#20540;&#26159;&#36890;&#36807;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#36827;&#34892;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this research we employ a range of multivariate asset models based on L\'evy processes to price exotic derivatives. We compare their ability to fit market data and replicate price benchmarks, and evaluate their flexibility in terms of parametrization and dependence structure. We review recent risk-neutral calibration approaches and techniques in the multivariate setting, and provide tools to make well-informed decisions in a practical context. A special focus is given to the ability of the models to capture linear and nonlinear dependence, with implications on their pricing performance. Given the exotic features of the analyzed derivatives, valuation is carried out through Monte Carlo methods.
&lt;/p&gt;</description></item></channel></rss>