<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#24503;&#22269;&#30005;&#21147;&#24066;&#22330;&#30740;&#31350;&#20102;&#21306;&#22495;&#21644;&#33410;&#28857;&#23450;&#20215;&#27169;&#22411;&#30340;&#27604;&#36739;&#65292;&#21457;&#29616;&#19981;&#21516;&#37197;&#32622;&#19979;&#30340;&#24179;&#22343;&#20215;&#26684;&#24046;&#24322;&#23567;&#65292;&#24635;&#25104;&#26412;&#30456;&#20284;&#12290;</title><link>https://arxiv.org/abs/2403.09265</link><description>&lt;p&gt;
&#21306;&#22495;vs. &#33410;&#28857;&#23450;&#20215;&#65306;&#24503;&#22269;&#26085;&#21069;&#24066;&#22330;&#19981;&#21516;&#23450;&#20215;&#35268;&#21017;&#30340;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Zonal vs. Nodal Pricing: An Analysis of Different Pricing Rules in the German Day-Ahead Market
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09265
&lt;/p&gt;
&lt;p&gt;
&#24503;&#22269;&#30005;&#21147;&#24066;&#22330;&#30740;&#31350;&#20102;&#21306;&#22495;&#21644;&#33410;&#28857;&#23450;&#20215;&#27169;&#22411;&#30340;&#27604;&#36739;&#65292;&#21457;&#29616;&#19981;&#21516;&#37197;&#32622;&#19979;&#30340;&#24179;&#22343;&#20215;&#26684;&#24046;&#24322;&#23567;&#65292;&#24635;&#25104;&#26412;&#30456;&#20284;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27431;&#27954;&#30005;&#21147;&#24066;&#22330;&#22522;&#20110;&#25317;&#26377;&#32479;&#19968;&#26085;&#21069;&#20215;&#26684;&#30340;&#22823;&#22411;&#23450;&#20215;&#21306;&#22495;&#12290;&#33021;&#28304;&#36716;&#22411;&#23548;&#33268;&#20379;&#38656;&#21464;&#21270;&#21644;&#20877;&#35843;&#24230;&#25104;&#26412;&#22686;&#21152;&#12290;&#20026;&#20102;&#30830;&#20445;&#24066;&#22330;&#28165;&#31639;&#39640;&#25928;&#21644;&#25317;&#22622;&#31649;&#29702;&#65292;&#27431;&#30431;&#22996;&#21592;&#20250;&#22996;&#25176;&#36827;&#34892;&#20986;&#20215;&#21306;&#22495;&#23457;&#26597;&#65288;BZR&#65289;&#20197;&#37325;&#26032;&#35780;&#20272;&#27431;&#27954;&#20986;&#20215;&#21306;&#22495;&#30340;&#37197;&#32622;&#12290;&#22522;&#20110;BZR&#32972;&#26223;&#19979;&#20844;&#24067;&#30340;&#29420;&#29305;&#25968;&#25454;&#38598;&#65292;&#25105;&#20204;&#27604;&#36739;&#20102;&#24503;&#22269;&#30005;&#21147;&#24066;&#22330;&#30340;&#21508;&#31181;&#23450;&#20215;&#35268;&#21017;&#12290;&#25105;&#20204;&#27604;&#36739;&#20102;&#22269;&#20869;&#12289;&#21306;&#22495;&#21644;&#33410;&#28857;&#27169;&#22411;&#30340;&#24066;&#22330;&#28165;&#31639;&#21644;&#23450;&#20215;&#65292;&#21253;&#25324;&#23427;&#20204;&#30340;&#21457;&#30005;&#25104;&#26412;&#21644;&#30456;&#20851;&#30340;&#20877;&#35843;&#24230;&#25104;&#26412;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#19981;&#21516;&#30340;&#38750;&#32479;&#19968;&#23450;&#20215;&#35268;&#21017;&#21450;&#20854;&#23545;&#24503;&#22269;&#30005;&#21147;&#24066;&#22330;&#30340;&#32463;&#27982;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#19981;&#21516;&#21306;&#22495;&#30340;&#24179;&#22343;&#20215;&#26684;&#24046;&#24322;&#36739;&#23567;&#12290;&#19981;&#21516;&#37197;&#32622;&#19979;&#30340;&#24635;&#25104;&#26412;&#30456;&#20284;&#65292;&#38477;&#20302;&#20102;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09265v1 Announce Type: new  Abstract: The European electricity market is based on large pricing zones with a uniform day-ahead price. The energy transition leads to shifts in supply and demand and increasing redispatch costs. In an attempt to ensure efficient market clearing and congestion management, the EU Commission has mandated the Bidding Zone Review (BZR) to reevaluate the configuration of European bidding zones. Based on a unique data set published in the context of the BZR, we compare various pricing rules for the German power market. We compare market clearing and pricing for national, zonal, and nodal models, including their generation costs and associated redispatch costs. Moreover, we investigate different non-uniform pricing rules and their economic implications for the German electricity market. Our results indicate that the differences in the average prices in different zones are small. The total costs across different configurations are similar and the reduct
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#26080;&#30417;&#30563;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#21033;&#29992;&#20027;&#25104;&#20998;&#20998;&#26512;&#21644;&#33258;&#21160;&#32534;&#30721;&#22120;&#20316;&#20026;&#38477;&#32500;&#25216;&#26415;&#65292;&#29992;&#20110;&#25903;&#25345;&#24066;&#22330;&#30417;&#25511;&#20197;&#35782;&#21035;&#28508;&#22312;&#20869;&#24149;&#20132;&#26131;&#27963;&#21160;&#12290;</title><link>https://arxiv.org/abs/2403.00707</link><description>&lt;p&gt;
&#38477;&#32500;&#25216;&#26415;&#29992;&#20110;&#25903;&#25345;&#20869;&#24149;&#20132;&#26131;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
Dimensionality reduction techniques to support insider trading detection
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.00707
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#26080;&#30417;&#30563;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#21033;&#29992;&#20027;&#25104;&#20998;&#20998;&#26512;&#21644;&#33258;&#21160;&#32534;&#30721;&#22120;&#20316;&#20026;&#38477;&#32500;&#25216;&#26415;&#65292;&#29992;&#20110;&#25903;&#25345;&#24066;&#22330;&#30417;&#25511;&#20197;&#35782;&#21035;&#28508;&#22312;&#20869;&#24149;&#20132;&#26131;&#27963;&#21160;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35782;&#21035;&#24066;&#22330;&#28389;&#29992;&#26159;&#19968;&#39033;&#38750;&#24120;&#22797;&#26434;&#30340;&#27963;&#21160;&#65292;&#38656;&#35201;&#20998;&#26512;&#22823;&#37327;&#22797;&#26434;&#30340;&#25968;&#25454;&#38598;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26080;&#30417;&#30563;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#19978;&#19979;&#25991;&#24322;&#24120;&#26816;&#27979;&#65292;&#21487;&#20197;&#25903;&#25345;&#26088;&#22312;&#35782;&#21035;&#28508;&#22312;&#20869;&#24149;&#20132;&#26131;&#27963;&#21160;&#30340;&#24066;&#22330;&#30417;&#25511;&#12290;&#35813;&#26041;&#27861;&#22522;&#20110;&#37325;&#24314;&#33539;&#24335;&#65292;&#37319;&#29992;&#20027;&#25104;&#20998;&#20998;&#26512;&#21644;&#33258;&#21160;&#32534;&#30721;&#22120;&#20316;&#20026;&#38477;&#32500;&#25216;&#26415;&#12290;&#35813;&#26041;&#27861;&#30340;&#21807;&#19968;&#36755;&#20837;&#26159;&#27599;&#20301;&#25237;&#36164;&#32773;&#22312;&#23545;&#25105;&#20204;&#20855;&#26377;&#20215;&#26684;&#25935;&#24863;&#20107;&#20214;&#65288;PSE&#65289;&#30340;&#36164;&#20135;&#19978;&#30340;&#20132;&#26131;&#20301;&#32622;&#12290;&#22312;&#30830;&#23450;&#19982;&#20132;&#26131;&#37197;&#32622;&#25991;&#20214;&#30456;&#20851;&#30340;&#37325;&#24314;&#38169;&#35823;&#21518;&#65292;&#25105;&#20204;&#20250;&#26045;&#21152;&#20960;&#20010;&#26465;&#20214;&#65292;&#20197;&#35782;&#21035;&#37027;&#20123;&#34892;&#20026;&#21487;&#30097;&#30340;&#25237;&#36164;&#32773;&#65292;&#20854;&#34892;&#20026;&#21487;&#33021;&#28041;&#21450;&#19982;PSE&#26377;&#20851;&#30340;&#20869;&#24149;&#20132;&#26131;&#12290;&#20316;&#20026;&#26696;&#20363;&#30740;&#31350;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#26041;&#27861;&#24212;&#29992;&#20110;&#22260;&#32469;&#25910;&#36141;&#35201;&#32422;&#30340;&#24847;&#22823;&#21033;&#32929;&#31080;&#30340;&#25237;&#36164;&#32773;&#35299;&#26512;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.00707v1 Announce Type: new  Abstract: Identification of market abuse is an extremely complicated activity that requires the analysis of large and complex datasets. We propose an unsupervised machine learning method for contextual anomaly detection, which allows to support market surveillance aimed at identifying potential insider trading activities. This method lies in the reconstruction-based paradigm and employs principal component analysis and autoencoders as dimensionality reduction techniques. The only input of this method is the trading position of each investor active on the asset for which we have a price sensitive event (PSE). After determining reconstruction errors related to the trading profiles, several conditions are imposed in order to identify investors whose behavior could be suspicious of insider trading related to the PSE. As a case study, we apply our method to investor resolved data of Italian stocks around takeover bids.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#36866;&#29992;&#20110;&#39640;&#39057;&#20215;&#26684;&#30340;&#26085;&#20869;GARCH&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#32771;&#34385;&#20102;&#19981;&#35268;&#21017;&#26102;&#38388;&#38388;&#38548;&#35266;&#27979;&#12289;&#21516;&#26102;&#20132;&#26131;&#12289;&#20215;&#26684;&#31163;&#25955;&#24615;&#21644;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#22122;&#22768;&#12290;&#36890;&#36807;&#20351;&#29992;&#24179;&#28369;&#26679;&#26465;&#25429;&#25417;&#20132;&#26131;&#25345;&#32493;&#26102;&#38388;&#19982;&#20215;&#26684;&#27874;&#21160;&#24615;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#24182;&#19988;&#20351;&#29992;&#38646;&#33192;&#32960;Skellam&#20998;&#24067;&#30340;&#24471;&#20998;&#39537;&#21160;&#26694;&#26550;&#65292;&#35813;&#27169;&#22411;&#21487;&#20197;&#24456;&#22909;&#22320;&#25311;&#21512;&#25968;&#25454;&#65292;&#24182;&#19988;&#21487;&#20197;&#29992;&#20110;&#27979;&#37327;&#27599;&#26085;&#23454;&#29616;&#27874;&#21160;&#24615;&#12290;</title><link>http://arxiv.org/abs/2211.12376</link><description>&lt;p&gt;
&#19968;&#31181;&#36866;&#29992;&#20110;&#31163;&#25955;&#20215;&#26684;&#21464;&#21160;&#21644;&#19981;&#35268;&#21017;&#26102;&#38388;&#38388;&#38548;&#35266;&#27979;&#30340;&#26085;&#20869;GARCH&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
An Intraday GARCH Model for Discrete Price Changes and Irregularly Spaced Observations. (arXiv:2211.12376v3 [q-fin.ST] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.12376
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#36866;&#29992;&#20110;&#39640;&#39057;&#20215;&#26684;&#30340;&#26085;&#20869;GARCH&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#32771;&#34385;&#20102;&#19981;&#35268;&#21017;&#26102;&#38388;&#38388;&#38548;&#35266;&#27979;&#12289;&#21516;&#26102;&#20132;&#26131;&#12289;&#20215;&#26684;&#31163;&#25955;&#24615;&#21644;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#22122;&#22768;&#12290;&#36890;&#36807;&#20351;&#29992;&#24179;&#28369;&#26679;&#26465;&#25429;&#25417;&#20132;&#26131;&#25345;&#32493;&#26102;&#38388;&#19982;&#20215;&#26684;&#27874;&#21160;&#24615;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#24182;&#19988;&#20351;&#29992;&#38646;&#33192;&#32960;Skellam&#20998;&#24067;&#30340;&#24471;&#20998;&#39537;&#21160;&#26694;&#26550;&#65292;&#35813;&#27169;&#22411;&#21487;&#20197;&#24456;&#22909;&#22320;&#25311;&#21512;&#25968;&#25454;&#65292;&#24182;&#19988;&#21487;&#20197;&#29992;&#20110;&#27979;&#37327;&#27599;&#26085;&#23454;&#29616;&#27874;&#21160;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22522;&#20110;&#35266;&#27979;&#30340;&#39640;&#39057;&#20215;&#26684;&#27169;&#22411;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#19981;&#35268;&#21017;&#26102;&#38388;&#38388;&#38548;&#35266;&#27979;&#12289;&#21516;&#26102;&#20132;&#26131;&#12289;&#20215;&#26684;&#31163;&#25955;&#24615;&#21644;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#22122;&#22768;&#12290;&#20351;&#29992;&#24179;&#28369;&#26679;&#26465;&#25429;&#25417;&#20132;&#26131;&#25345;&#32493;&#26102;&#38388;&#19982;&#20215;&#26684;&#27874;&#21160;&#24615;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#20197;&#21450;&#20132;&#26131;&#25345;&#32493;&#26102;&#38388;&#21644;&#20215;&#26684;&#27874;&#21160;&#24615;&#30340;&#26085;&#20869;&#27169;&#24335;&#12290;&#21160;&#24577;&#27169;&#22411;&#22522;&#20110;&#20855;&#26377;&#26102;&#38388;&#21464;&#21270;&#27874;&#21160;&#24615;&#30340;&#38646;&#33192;&#32960;Skellam&#20998;&#24067;&#30340;&#24471;&#20998;&#39537;&#21160;&#26694;&#26550;&#12290;&#36890;&#36807;&#21253;&#25324;&#31227;&#21160;&#24179;&#22343;&#20998;&#37327;&#26469;&#28388;&#38500;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#22122;&#22768;&#12290;&#35813;&#27169;&#22411;&#37319;&#29992;&#26368;&#22823;&#20284;&#28982;&#26041;&#27861;&#36827;&#34892;&#20272;&#35745;&#12290;&#22312;&#23545;IBM&#32929;&#31080;&#30340;&#23454;&#35777;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#35813;&#27169;&#22411;&#23545;&#25968;&#25454;&#25311;&#21512;&#36739;&#22909;&#12290;&#38500;&#20102;&#23545;&#26085;&#20869;&#27874;&#21160;&#24615;&#24314;&#27169;&#22806;&#65292;&#23427;&#36824;&#21487;&#20197;&#29992;&#20110;&#27979;&#37327;&#27599;&#26085;&#23454;&#29616;&#27874;&#21160;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a novel observation-driven model for high-frequency prices. We account for irregularly spaced observations, simultaneous transactions, discreteness of prices, and market microstructure noise. The relation between trade durations and price volatility, as well as intraday patterns of trade durations and price volatility, is captured using smoothing splines. The dynamic model is based on the zero-inflated Skellam distribution with time-varying volatility in a score-driven framework. Market microstructure noise is filtered by including a moving average component. The model is estimated by the maximum likelihood method. In an empirical study of the IBM stock, we demonstrate that the model provides a good fit to the data. Besides modeling intraday volatility, it can also be used to measure daily realized volatility.
&lt;/p&gt;</description></item></channel></rss>