<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#21463;&#30123;&#24773;&#24433;&#21709;&#65292;&#35843;&#26597;&#26174;&#31034;&#20154;&#20204;&#26356;&#23481;&#24525;&#22522;&#20110;&#25104;&#26412;&#20914;&#20987;&#32780;&#38750;&#38656;&#27714;&#20914;&#20987;&#30340;&#20215;&#26684;&#19978;&#28072;&#65292;&#19981;&#36807;&#19981;&#21516;&#31181;&#32676;&#21450;&#21830;&#21697;&#20043;&#38388;&#23384;&#22312;&#36739;&#22823;&#24046;&#24322;&#12290;</title><link>https://arxiv.org/abs/2403.07617</link><description>&lt;p&gt;
&#30123;&#24773;&#20013;&#30340;&#20215;&#26684;&#25805;&#32437;&#36824;&#26159;&#24066;&#22330;&#21147;&#37327;&#65311;&#20844;&#27491;&#24863;&#30693;&#19982;&#20215;&#26684;&#19978;&#28072;&#30340;&#20851;&#31995;
&lt;/p&gt;
&lt;p&gt;
Price Gouging or Market Forces? Fairness Perceptions of Price Hikes in the Pandemic
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07617
&lt;/p&gt;
&lt;p&gt;
&#21463;&#30123;&#24773;&#24433;&#21709;&#65292;&#35843;&#26597;&#26174;&#31034;&#20154;&#20204;&#26356;&#23481;&#24525;&#22522;&#20110;&#25104;&#26412;&#20914;&#20987;&#32780;&#38750;&#38656;&#27714;&#20914;&#20987;&#30340;&#20215;&#26684;&#19978;&#28072;&#65292;&#19981;&#36807;&#19981;&#21516;&#31181;&#32676;&#21450;&#21830;&#21697;&#20043;&#38388;&#23384;&#22312;&#36739;&#22823;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25253;&#21578;&#20102;&#25105;&#20204;&#22312;2020&#24180;&#22312;&#32654;&#22269;&#21644;&#20197;&#33394;&#21015;&#36827;&#34892;&#30340;&#35843;&#26597;&#32467;&#26524;&#65292;&#24403;&#26102;&#38543;&#30528;&#30123;&#24773;&#20256;&#25773;&#65292;&#35768;&#22810;&#20215;&#26684;&#20986;&#29616;&#20102;&#19978;&#28072;&#12290;&#20026;&#20102;&#35780;&#20272;&#21463;&#35775;&#32773;&#23545;&#20215;&#26684;&#19978;&#28072;&#30340;&#30475;&#27861;&#65292;&#25105;&#20204;&#20851;&#27880;&#20102;&#22312;&#30123;&#24773;&#26399;&#38388;&#20215;&#26684;&#19978;&#28072;&#30340;&#21830;&#21697;&#65292;&#21253;&#25324;&#19968;&#20123;&#24517;&#38656;&#21697;&#12290;&#19982;&#21452;&#37325;&#26435;&#21033;&#21407;&#21017;&#19968;&#33268;&#65292;&#25105;&#20204;&#21457;&#29616;&#22914;&#26524;&#20215;&#26684;&#19978;&#28072;&#26159;&#30001;&#25104;&#26412;&#20914;&#20987;&#24341;&#36215;&#30340;&#65292;&#21463;&#35775;&#32773;&#35748;&#20026;&#36825;&#31181;&#24773;&#20917;&#26356;&#20026;&#21487;&#25509;&#21463;&#65292;&#32780;&#22914;&#26524;&#26159;&#30001;&#38656;&#27714;&#20914;&#20987;&#23548;&#33268;&#30340;&#65292;&#21017;&#35748;&#20026;&#19981;&#22826;&#21487;&#25509;&#21463;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#36824;&#21457;&#29616;&#20004;&#20010;&#31181;&#32676;&#20197;&#21450;&#21830;&#21697;&#20043;&#38388;&#23384;&#22312;&#24456;&#22823;&#30340;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07617v1 Announce Type: new  Abstract: We report the results of surveys we conducted in the US and Israel in 2020, a time when many prices increased following the spread of the pandemic. To assess respondents perceptions of price increases, we focus on goods whose prices have increased during the pandemic, including some essential goods. Consistent with the principle of dual entitlement, we find that respondents perceive price increases as more acceptable if they are due to cost shocks than if they are due to demand shocks. However, we also find large differences across the two populations, as well as across goods.
&lt;/p&gt;</description></item><item><title>&#19981;&#21516;&#32789;&#20316;&#23454;&#36341;&#22914;&#26377;&#26426;&#32789;&#20316;&#12289;&#35206;&#30422;&#20316;&#29289;&#12289;&#20445;&#25252;&#32789;&#20316;&#21644;&#20892;&#26519;&#22797;&#21512;&#23545;&#25552;&#39640;&#22303;&#22756;&#26377;&#26426;&#30899;&#21547;&#37327;&#36215;&#30528;&#37325;&#35201;&#20316;&#29992;&#65292;&#36890;&#36807;&#22686;&#21152;&#24494;&#29983;&#29289;&#27963;&#24615;&#12289;&#20445;&#25345;&#22303;&#22756;&#32467;&#26500;&#21644;&#21152;&#24555;&#20859;&#20998;&#24490;&#29615;&#31561;&#26041;&#24335;&#26469;&#21487;&#25345;&#32493;&#22686;&#21152;&#22303;&#22756;SOC&#21547;&#37327;&#12290;</title><link>https://arxiv.org/abs/2403.07530</link><description>&lt;p&gt;
&#19981;&#21516;&#20892;&#19994;&#23454;&#36341;&#23545;&#32789;&#20316;&#22303;&#22756;&#30340;&#30899;&#32463;&#27982;&#23398;
&lt;/p&gt;
&lt;p&gt;
Carbon Economics of Different Agricultural Practices for Farming Soil
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07530
&lt;/p&gt;
&lt;p&gt;
&#19981;&#21516;&#32789;&#20316;&#23454;&#36341;&#22914;&#26377;&#26426;&#32789;&#20316;&#12289;&#35206;&#30422;&#20316;&#29289;&#12289;&#20445;&#25252;&#32789;&#20316;&#21644;&#20892;&#26519;&#22797;&#21512;&#23545;&#25552;&#39640;&#22303;&#22756;&#26377;&#26426;&#30899;&#21547;&#37327;&#36215;&#30528;&#37325;&#35201;&#20316;&#29992;&#65292;&#36890;&#36807;&#22686;&#21152;&#24494;&#29983;&#29289;&#27963;&#24615;&#12289;&#20445;&#25345;&#22303;&#22756;&#32467;&#26500;&#21644;&#21152;&#24555;&#20859;&#20998;&#24490;&#29615;&#31561;&#26041;&#24335;&#26469;&#21487;&#25345;&#32493;&#22686;&#21152;&#22303;&#22756;SOC&#21547;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22303;&#22756;&#26377;&#26426;&#30899;&#65288;SOC&#65289;&#30340;&#27969;&#22833;&#23545;&#19990;&#30028;&#21508;&#22320;&#30340;&#20892;&#19994;&#21487;&#25345;&#32493;&#24615;&#26500;&#25104;&#20005;&#37325;&#21361;&#38505;&#12290;&#26412;&#32508;&#36848;&#32771;&#23519;&#20102;&#21508;&#31181;&#32789;&#20316;&#23454;&#36341;&#21450;&#20854;&#23545;&#22303;&#22756;&#26377;&#26426;&#30899;&#20648;&#23384;&#30340;&#24433;&#21709;&#12290;&#22312;&#20180;&#32454;&#23457;&#38405;&#25991;&#29486;&#21518;&#65292;&#22823;&#37096;&#20998;&#30740;&#31350;&#34920;&#26126;&#65292;&#26377;&#26426;&#32789;&#20316;&#12289;&#35206;&#30422;&#20316;&#29289;&#12289;&#20445;&#25252;&#32789;&#20316;&#21644;&#20892;&#26519;&#22797;&#21512;&#31561;&#19981;&#21516;&#32789;&#20316;&#23454;&#36341;&#22312;&#21487;&#25345;&#32493;&#22686;&#21152;&#22303;&#22756;SOC&#21547;&#37327;&#20013;&#21457;&#25381;&#30528;&#37325;&#35201;&#20316;&#29992;&#12290;&#35206;&#30422;&#20316;&#29289;&#30340;&#26681;&#31995;&#20998;&#27852;&#29289;&#22686;&#21152;&#20102;&#24494;&#29983;&#29289;&#27963;&#24615;&#65292;&#24182;&#26377;&#21161;&#20110;&#23558;&#22797;&#26434;&#26377;&#26426;&#21270;&#21512;&#29289;&#20998;&#35299;&#20026;&#26377;&#26426;&#30899;&#12290;&#20445;&#25252;&#32789;&#20316;&#22686;&#24378;&#20102;&#22303;&#22756;&#32467;&#26500;&#65292;&#24182;&#22312;&#19981;&#25200;&#20081;&#22303;&#22756;&#30340;&#24773;&#20917;&#19979;&#20445;&#25345;&#30899;&#20648;&#23384;&#12290;&#20892;&#26519;&#22797;&#21512;&#31995;&#32479;&#22686;&#21152;&#26377;&#26426;&#30899;&#36755;&#20837;&#65292;&#21152;&#24555;&#20859;&#20998;&#24490;&#29615;&#65292;&#22240;&#20026;&#26641;&#26408;&#21644;&#20316;&#29289;&#20855;&#26377;&#20849;&#29983;&#20851;&#31995;&#12290;&#38388;&#20316;&#21644;&#36718;&#20316;&#22312;&#25913;&#21464;&#26893;&#29289;&#27531;&#20307;&#32452;&#25104;&#21644;&#20419;&#36827;&#30899;&#20648;&#23384;&#26041;&#38754;&#21457;&#25381;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07530v1 Announce Type: new  Abstract: The loss of soil organic carbon (SOC) poses a severe danger to agricultural sustainability around the World. This review examines various farming practices and their impact on soil organic carbon storage. After a careful review of the literature, most of the research indicated that different farming practices, such as organic farming, cover crops, conservation tillage, and agroforestry, play vital roles in increasing the SOC content of the soil sustainably. Root exudation from cover crops increases microbial activity and helps break down complex organic compounds into organic carbon. Conservation tillage enhances the soil structure and maintains carbon storage without disturbing the soil. Agroforestry systems boost organic carbon input and fasten nutrient cycling because the trees and crops have symbiotic relationships. Intercropping and crop rotations have a role in changing the composition of plant residues and promoting carbon storage
&lt;/p&gt;</description></item><item><title>&#22823;&#25968;&#25454;&#38761;&#26032;&#20102;&#20250;&#35745;&#21644;&#23457;&#35745;&#39046;&#22495;&#65292;&#19987;&#19994;&#20154;&#22763;&#38656;&#35201;&#21033;&#29992;&#20154;&#24037;&#26234;&#33021;&#21644;&#26426;&#22120;&#23398;&#20064;&#36827;&#34892;&#25968;&#25454;&#20998;&#26512;&#21644;&#24322;&#24120;&#26816;&#27979;&#65292;&#20197;&#30830;&#20445;&#36130;&#21153;&#25253;&#21578;&#30340;&#20934;&#30830;&#24615;&#21644;&#36879;&#26126;&#24230;&#12290;</title><link>https://arxiv.org/abs/2403.07180</link><description>&lt;p&gt;
&#22823;&#25968;&#25454;&#26102;&#20195;&#23545;&#20250;&#35745;&#21644;&#23457;&#35745;&#30340;&#24433;&#21709;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Study of the Impact of the Big Data Era on Accounting and Auditing
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07180
&lt;/p&gt;
&lt;p&gt;
&#22823;&#25968;&#25454;&#38761;&#26032;&#20102;&#20250;&#35745;&#21644;&#23457;&#35745;&#39046;&#22495;&#65292;&#19987;&#19994;&#20154;&#22763;&#38656;&#35201;&#21033;&#29992;&#20154;&#24037;&#26234;&#33021;&#21644;&#26426;&#22120;&#23398;&#20064;&#36827;&#34892;&#25968;&#25454;&#20998;&#26512;&#21644;&#24322;&#24120;&#26816;&#27979;&#65292;&#20197;&#30830;&#20445;&#36130;&#21153;&#25253;&#21578;&#30340;&#20934;&#30830;&#24615;&#21644;&#36879;&#26126;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#25968;&#25454;&#38761;&#26032;&#20102;&#20250;&#35745;&#21644;&#23457;&#35745;&#65292;&#25552;&#20379;&#20102;&#28145;&#21051;&#30340;&#35265;&#35299;&#65292;&#21516;&#26102;&#20063;&#24102;&#26469;&#20102;&#35832;&#22914;&#25968;&#25454;&#38544;&#31169;&#21644;&#23433;&#20840;&#31561;&#25361;&#25112;&#12290;&#38543;&#30528;&#26469;&#33258;&#29289;&#32852;&#32593;&#12289;&#31038;&#20132;&#23186;&#20307;&#21644;&#20132;&#26131;&#30340;&#25968;&#25454;&#65292;&#20256;&#32479;&#23454;&#36341;&#27491;&#22312;&#21457;&#29983;&#21464;&#21270;&#12290;&#19987;&#19994;&#20154;&#22763;&#24517;&#39035;&#36866;&#24212;&#36825;&#20123;&#21464;&#21270;&#65292;&#21033;&#29992;&#20154;&#24037;&#26234;&#33021;&#21644;&#26426;&#22120;&#23398;&#20064;&#36827;&#34892;&#39640;&#25928;&#30340;&#25968;&#25454;&#20998;&#26512;&#21644;&#24322;&#24120;&#26816;&#27979;&#12290;&#20811;&#26381;&#36825;&#20123;&#25361;&#25112;&#30340;&#20851;&#38190;&#22312;&#20110;&#22686;&#24378;&#30340;&#20998;&#26512;&#24037;&#20855;&#12289;&#25345;&#32493;&#23398;&#20064;&#21644;&#34892;&#19994;&#21512;&#20316;&#12290;&#36890;&#36807;&#35299;&#20915;&#36825;&#20123;&#39046;&#22495;&#65292;&#20250;&#35745;&#21644;&#23457;&#35745;&#39046;&#22495;&#21487;&#20197;&#21033;&#29992;&#22823;&#25968;&#25454;&#30340;&#28508;&#21147;&#65292;&#21516;&#26102;&#30830;&#20445;&#36130;&#21153;&#25253;&#21578;&#30340;&#20934;&#30830;&#24615;&#12289;&#36879;&#26126;&#24230;&#21644;&#23436;&#25972;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07180v1 Announce Type: new  Abstract: Big data revolutionizes accounting and auditing, offering deep insights but also introducing challenges like data privacy and security. With data from IoT, social media, and transactions, traditional practices are evolving. Professionals must adapt to these changes, utilizing AI and machine learning for efficient data analysis and anomaly detection. Key to overcoming these challenges are enhanced analytics tools, continuous learning, and industry collaboration. By addressing these areas, the accounting and auditing fields can harness big data's potential while ensuring accuracy, transparency, and integrity in financial reporting. Keywords: Big Data, Accounting, Audit, Data Privacy, AI, Machine Learning, Transparency.
&lt;/p&gt;</description></item><item><title>&#23567;&#24133;&#20215;&#26684;&#21464;&#21160;&#19982;&#38144;&#21806;&#25968;&#37327;&#30456;&#20851;&#65292;&#39640;&#38144;&#21806;&#37327;&#20135;&#21697;&#26356;&#23481;&#26131;&#20986;&#29616;&#23567;&#24133;&#20215;&#26684;&#21464;&#21160;&#65292;&#36825;&#19968;&#21457;&#29616;&#22312;&#19981;&#21516;&#23618;&#38754;&#19978;&#37117;&#24471;&#21040;&#39564;&#35777;&#12290;</title><link>https://arxiv.org/abs/2403.07166</link><description>&lt;p&gt;
&#23567;&#24133;&#20215;&#26684;&#21464;&#21160;&#12289;&#38144;&#21806;&#25968;&#37327;&#21644;&#33756;&#21333;&#25104;&#26412;
&lt;/p&gt;
&lt;p&gt;
Small Price Changes, Sales Volume, and Menu Cost
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07166
&lt;/p&gt;
&lt;p&gt;
&#23567;&#24133;&#20215;&#26684;&#21464;&#21160;&#19982;&#38144;&#21806;&#25968;&#37327;&#30456;&#20851;&#65292;&#39640;&#38144;&#21806;&#37327;&#20135;&#21697;&#26356;&#23481;&#26131;&#20986;&#29616;&#23567;&#24133;&#20215;&#26684;&#21464;&#21160;&#65292;&#36825;&#19968;&#21457;&#29616;&#22312;&#19981;&#21516;&#23618;&#38754;&#19978;&#37117;&#24471;&#21040;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#38646;&#21806;&#20215;&#26684;&#25968;&#25454;&#38598;&#20013;&#21457;&#29616;&#23567;&#24133;&#20215;&#26684;&#21464;&#21160;&#30340;&#29616;&#35937;&#36890;&#24120;&#34987;&#35270;&#20026;&#19968;&#20010;&#35868;&#39064;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#19968;&#20010;&#21487;&#33021;&#30340;&#35299;&#37322;&#65292;&#21363;&#23567;&#24133;&#20215;&#26684;&#21464;&#21160;&#23384;&#22312;&#30340;&#19968;&#20010;&#21407;&#22240;&#19982;&#38144;&#21806;&#25968;&#37327;&#26377;&#20851;&#65292;&#36825;&#19968;&#35266;&#23519;&#22312;&#29616;&#26377;&#25991;&#29486;&#20013;&#34987;&#24573;&#35270;&#12290;&#36890;&#36807;&#20998;&#26512;&#19968;&#20010;&#21253;&#21547;&#20215;&#26684;&#21644;&#38144;&#21806;&#25968;&#37327;&#20449;&#24687;&#30340;&#22823;&#22411;&#38646;&#21806;&#25195;&#25551;&#20202;&#20215;&#26684;&#25968;&#25454;&#38598;&#65292;&#25105;&#20204;&#21457;&#29616;&#24403;&#20135;&#21697;&#38144;&#21806;&#25968;&#37327;&#36739;&#39640;&#26102;&#65292;&#23567;&#24133;&#20215;&#26684;&#21464;&#21160;&#26356;&#20026;&#39057;&#32321;&#12290;&#36825;&#19968;&#21457;&#29616;&#22312;&#20135;&#21697;&#31867;&#21035;&#20043;&#38388;&#12289;&#20135;&#21697;&#31867;&#21035;&#20869;&#37096;&#20197;&#21450;&#21333;&#20010;&#20135;&#21697;&#26041;&#38754;&#37117;&#25104;&#31435;&#65292;&#19988;&#23545;&#20110;&#21508;&#31181;&#25935;&#24863;&#24615;&#20998;&#26512;&#37117;&#20855;&#26377;&#31283;&#20581;&#24615;&#65292;&#20363;&#22914;&#27979;&#37327;&#35823;&#24046;&#12289;&#23567;&#24133;&#20215;&#26684;&#21464;&#21160;&#30340;&#23450;&#20041;&#12289;&#20215;&#26684;&#21516;&#27493;&#24230;&#30340;&#21152;&#20837;&#12289;&#29983;&#20135;&#32773;&#35268;&#27169;&#12289;&#29992;&#20110;&#35745;&#31639;&#24179;&#22343;&#38144;&#21806;&#25968;&#37327;&#30340;&#26102;&#38388;&#36328;&#24230;&#12289;&#25910;&#20837;&#12289;&#31454;&#20105;&#12289;&#36141;&#29289;&#32773;&#29305;&#24449;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07166v1 Announce Type: new  Abstract: The finding of small price changes in many retail price datasets is often viewed as a puzzle. We show that a possible explanation for the presence of small price changes is related to sales volume, an observation that has been overlooked in the existing literature. Analyzing a large retail scanner price dataset that contains information on both prices and sales volume, we find that small price changes are more frequent when products sales volume is high. This finding holds across product categories, within product categories, and for individual products. It is also robust to various sensitivity analyses such as measurement errors, the definition of small price changes, the inclusion of measures of price synchronization, the size of producers, the time horizon used to compute the average sales volume, the revenues, the competition, shoppers characteristics, etc.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#25506;&#35752;&#27700;&#21361;&#26426;&#30340;&#21407;&#22240;&#65292;&#21253;&#25324;&#20154;&#21475;&#22686;&#38271;&#12289;&#27668;&#20505;&#21464;&#21270;&#21644;&#27700;&#31649;&#29702;&#25216;&#26415;&#65292;&#24182;&#25552;&#20986;&#25913;&#21892;&#21355;&#29983;&#21644;&#21355;&#29983;&#31243;&#24207;&#12289;&#27700;&#31649;&#29702;&#21644;&#20445;&#25252;&#25216;&#26415;&#31561;&#22810;&#31181;&#26041;&#27861;&#20197;&#20943;&#36731;&#27700;&#36164;&#28304;&#21294;&#20047;&#23545;&#20154;&#31867;&#20581;&#24247;&#30340;&#28508;&#22312;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2403.07019</link><description>&lt;p&gt;
&#27700;&#21361;&#26426;&#21450;&#20854;&#28508;&#22312;&#20581;&#24247;&#24433;&#21709;&#30340;&#21407;&#22240;
&lt;/p&gt;
&lt;p&gt;
Reasons behind the Water Crisis and its Potential Health Outcomes
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07019
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#25506;&#35752;&#27700;&#21361;&#26426;&#30340;&#21407;&#22240;&#65292;&#21253;&#25324;&#20154;&#21475;&#22686;&#38271;&#12289;&#27668;&#20505;&#21464;&#21270;&#21644;&#27700;&#31649;&#29702;&#25216;&#26415;&#65292;&#24182;&#25552;&#20986;&#25913;&#21892;&#21355;&#29983;&#21644;&#21355;&#29983;&#31243;&#24207;&#12289;&#27700;&#31649;&#29702;&#21644;&#20445;&#25252;&#25216;&#26415;&#31561;&#22810;&#31181;&#26041;&#27861;&#20197;&#20943;&#36731;&#27700;&#36164;&#28304;&#21294;&#20047;&#23545;&#20154;&#31867;&#20581;&#24247;&#30340;&#28508;&#22312;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#33539;&#22260;&#20869;&#65292;&#27700;&#21361;&#26426;&#24050;&#25104;&#20026;&#24433;&#21709;&#21457;&#23637;&#20013;&#22269;&#23478;&#21644;&#24037;&#19994;&#21270;&#22269;&#23478;&#30340;&#37325;&#22823;&#38382;&#39064;&#12290;&#32570;&#27700;&#20250;&#36890;&#36807;&#22686;&#21152;&#24863;&#26579;&#27700;&#20256;&#25773;&#30142;&#30149;&#12289;&#33073;&#27700;&#21644;&#33829;&#20859;&#19981;&#33391;&#30340;&#21487;&#33021;&#24615;&#26469;&#21361;&#23475;&#20844;&#20849;&#20581;&#24247;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#30740;&#31350;&#27700;&#38382;&#39064;&#30340;&#21407;&#22240;&#21450;&#20854;&#23545;&#20154;&#31867;&#20581;&#24247;&#30340;&#21487;&#33021;&#24433;&#21709;&#12290;&#30740;&#31350;&#23457;&#35270;&#20102;&#23548;&#33268;&#27700;&#21361;&#26426;&#30340;&#21407;&#22240;&#65292;&#21253;&#25324;&#20154;&#21475;&#22686;&#38271;&#12289;&#27668;&#20505;&#21464;&#21270;&#21644;&#20302;&#25928;&#30340;&#27700;&#31649;&#29702;&#25216;&#26415;&#12290;&#30740;&#31350;&#36824;&#25581;&#31034;&#20102;&#27700;&#36164;&#28304;&#21294;&#20047;&#23545;&#20154;&#31867;&#20581;&#24247;&#30340;&#32467;&#26524;&#65292;&#22914;&#20256;&#26579;&#30149;&#30340;&#20256;&#25773;&#12289;&#26356;&#39640;&#30340;&#39269;&#39295;&#21644;&#33073;&#27700;&#39118;&#38505;&#65292;&#20197;&#21450;&#24515;&#29702;&#21387;&#21147;&#12290;&#30740;&#31350;&#36827;&#19968;&#27493;&#25552;&#20986;&#20102;&#24212;&#23545;&#27700;&#24773;&#20917;&#24182;&#20943;&#36731;&#20854;&#23545;&#20154;&#31867;&#20581;&#24247;&#28508;&#22312;&#24433;&#21709;&#30340;&#20960;&#31181;&#26041;&#27861;&#12290;&#36825;&#20123;&#30103;&#27861;&#21253;&#25324;&#25913;&#21892;&#21355;&#29983;&#21644;&#21355;&#29983;&#31243;&#24207;&#12289;&#27700;&#31649;&#29702;&#21644;&#20445;&#25252;&#25216;&#26415;&#65292;&#22914;&#38632;&#27700;&#25910;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07019v1 Announce Type: new  Abstract: Globally, the water crisis has become a significant problem that affects developing and industrialized nations. Water shortage can harm public health by increasing the chance of contracting water-borne diseases, dehydration, and malnutrition. This study aims to examine the causes of the water problem and its likely effects on human health. The study scrutinizes the reasons behind the water crisis, including population increase, climate change, and inefficient water management techniques. The results of a lack of water on human health, such as the spread of infectious diseases, a higher risk of starvation and dehydration, and psychological stress, are also concealed in the study. The research further suggests several ways to deal with the water situation and lessen its potential outcomes on human health. These remedies include enhanced sanitation and hygiene procedures, water management, and conservation techniques like rainwater gatherin
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#39640;&#32500;&#21521;&#37327;&#35823;&#24046;&#20462;&#27491;&#27169;&#22411;&#30340;&#36125;&#21494;&#26031;&#20998;&#26512;&#26041;&#27861;&#65292;&#36890;&#36807;&#20998;&#26512;&#21327;&#25972;&#30697;&#38453;&#26469;&#30830;&#23450;&#21327;&#25972;&#31209;&#65292;&#20855;&#26377;&#36739;&#39640;&#25928;&#29575;&#21644;&#24212;&#29992;&#21069;&#26223;&#65292;&#33021;&#26377;&#25928;&#30740;&#31350;S&amp;P 500&#25351;&#25968;&#30340;&#26500;&#25104;&#37096;&#20998;&#65292;&#23588;&#20854;&#22312;&#20302;&#27874;&#21160;&#29575;&#32452;&#21512;&#30340;&#35782;&#21035;&#26041;&#38754;&#20855;&#26377;&#20248;&#21183;&#12290;</title><link>https://arxiv.org/abs/2312.17061</link><description>&lt;p&gt;
&#39640;&#32500;&#21521;&#37327;&#35823;&#24046;&#20462;&#27491;&#27169;&#22411;&#30340;&#36125;&#21494;&#26031;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Bayesian Analysis of High Dimensional Vector Error Correction Model
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.17061
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#39640;&#32500;&#21521;&#37327;&#35823;&#24046;&#20462;&#27491;&#27169;&#22411;&#30340;&#36125;&#21494;&#26031;&#20998;&#26512;&#26041;&#27861;&#65292;&#36890;&#36807;&#20998;&#26512;&#21327;&#25972;&#30697;&#38453;&#26469;&#30830;&#23450;&#21327;&#25972;&#31209;&#65292;&#20855;&#26377;&#36739;&#39640;&#25928;&#29575;&#21644;&#24212;&#29992;&#21069;&#26223;&#65292;&#33021;&#26377;&#25928;&#30740;&#31350;S&amp;P 500&#25351;&#25968;&#30340;&#26500;&#25104;&#37096;&#20998;&#65292;&#23588;&#20854;&#22312;&#20302;&#27874;&#21160;&#29575;&#32452;&#21512;&#30340;&#35782;&#21035;&#26041;&#38754;&#20855;&#26377;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21521;&#37327;&#35823;&#24046;&#20462;&#27491;&#27169;&#22411;(VECM)&#26159;&#20998;&#26512;&#22810;&#20803;&#38750;&#24179;&#31283;&#26102;&#38388;&#24207;&#21015;&#20043;&#38388;&#21327;&#25972;&#20851;&#31995;&#30340;&#32463;&#20856;&#26041;&#27861;&#12290;&#26412;&#25991;&#30528;&#37325;&#20110;&#39640;&#32500;&#35774;&#32622;&#65292;&#23547;&#27714;&#19968;&#31181;&#26679;&#26412;&#22823;&#23567;&#26377;&#25928;&#30340;&#26041;&#27861;&#26469;&#30830;&#23450;&#21327;&#25972;&#27700;&#24179;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#38598;&#20013;&#22312;&#36125;&#21494;&#26031;&#26041;&#27861;&#19978;&#65292;&#20998;&#26512;&#21327;&#25972;&#30697;&#38453;&#65292;&#20174;&#32780;&#30830;&#23450;&#21327;&#25972;&#31209;&#12290;&#25105;&#20204;&#35774;&#35745;&#20102;&#20004;&#31181;&#31639;&#27861;&#65292;&#24182;&#23558;&#23427;&#20204;&#24212;&#29992;&#20110;&#27169;&#25311;&#31034;&#20363;&#20013;&#65292;&#22312;&#22788;&#29702;&#39640;&#25968;&#37327;&#21464;&#37327;&#21644;&#30456;&#23545;&#20302;&#25968;&#37327;&#35266;&#27979;&#26102;&#20135;&#29983;&#20102;&#26377;&#24076;&#26395;&#30340;&#32467;&#26524;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23558;&#36825;&#31181;&#26041;&#27861;&#25193;&#23637;&#21040;&#23454;&#35777;&#35843;&#26597;&#26631;&#20934;&#26222;&#23572;500&#25351;&#25968;&#30340;&#32452;&#25104;&#37096;&#20998;&#65292;&#21487;&#22312;&#26679;&#26412;&#20869;&#35757;&#32451;&#21644;&#26679;&#26412;&#22806;&#27979;&#35797;&#26399;&#38388;&#25214;&#21040;&#20302;&#27874;&#21160;&#29575;&#32452;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.17061v2 Announce Type: replace-cross  Abstract: Vector Error Correction Model (VECM) is a classic method to analyse cointegration relationships amongst multivariate non-stationary time series. In this paper, we focus on high dimensional setting and seek for sample-size-efficient methodology to determine the level of cointegration. Our investigation centres at a Bayesian approach to analyse the cointegration matrix, henceforth determining the cointegration rank. We design two algorithms and implement them on simulated examples, yielding promising results particularly when dealing with high number of variables and relatively low number of observations. Furthermore, we extend this methodology to empirically investigate the constituents of the S&amp;P 500 index, where low-volatility portfolios can be found during both in-sample training and out-of-sample testing periods.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#20998;&#26512;&#31185;&#23398;&#23478;&#30340;&#26102;&#38388;&#21033;&#29992;&#35843;&#26597;&#25968;&#25454;&#65292;&#21457;&#29616;&#31185;&#23398;&#23478;&#22312;&#31609;&#27454;&#21644;&#30740;&#31350;&#19978;&#30340;&#26102;&#38388;&#20998;&#37197;&#34920;&#29616;&#20986;&#27491;&#21521;&#21162;&#21147;&#22806;&#37096;&#24615;&#65292;&#21363;&#36861;&#27714;&#36192;&#27454;&#26102;&#20135;&#29983;&#30340;&#31038;&#20250;&#20215;&#20540;&#65292;&#20174;&#32780;&#25913;&#21464;&#20102;&#31454;&#20105;&#19982;&#36192;&#27454;&#31454;&#36187;&#30340;&#24635;&#20307;&#29983;&#20135;&#21147;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2207.02379</link><description>&lt;p&gt;
&#31454;&#20105;&#23545;&#36192;&#27454;&#31454;&#36187;&#30340;&#19968;&#20123;&#26435;&#34913;
&lt;/p&gt;
&lt;p&gt;
Some Tradeoffs of Competition in Grant Contests
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2207.02379
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#20998;&#26512;&#31185;&#23398;&#23478;&#30340;&#26102;&#38388;&#21033;&#29992;&#35843;&#26597;&#25968;&#25454;&#65292;&#21457;&#29616;&#31185;&#23398;&#23478;&#22312;&#31609;&#27454;&#21644;&#30740;&#31350;&#19978;&#30340;&#26102;&#38388;&#20998;&#37197;&#34920;&#29616;&#20986;&#27491;&#21521;&#21162;&#21147;&#22806;&#37096;&#24615;&#65292;&#21363;&#36861;&#27714;&#36192;&#27454;&#26102;&#20135;&#29983;&#30340;&#31038;&#20250;&#20215;&#20540;&#65292;&#20174;&#32780;&#25913;&#21464;&#20102;&#31454;&#20105;&#19982;&#36192;&#27454;&#31454;&#36187;&#30340;&#24635;&#20307;&#29983;&#20135;&#21147;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36164;&#21161;&#20844;&#20849;&#21697;&#26102;&#65292;&#36164;&#28304;&#36890;&#24120;&#36890;&#36807;&#31867;&#20284;&#31454;&#36187;&#30340;&#26426;&#21046;&#20998;&#37197;&#65292;&#23588;&#20854;&#26159;&#22312;&#30740;&#31350;&#36164;&#21161;&#26041;&#38754;&#12290;&#23545;&#36825;&#20123;&#31454;&#36187;&#30340;&#24120;&#35265;&#25209;&#35780;&#26159;&#23427;&#20204;&#20250;&#24341;&#36215;&#21442;&#19982;&#32773;&#8220;&#20184;&#20986;&#36807;&#22810;&#8221;&#30340;&#21162;&#21147;&#12290;&#20294;&#22914;&#26524;&#31454;&#36187;&#20013;&#30340;&#21162;&#21147;&#26412;&#36523;&#26159;&#20026;&#20102;&#20844;&#20849;&#21033;&#30410;&#65292;&#23601;&#26410;&#24517;&#27491;&#30830;&#12290;&#26412;&#25991;&#20998;&#26512;&#20102;&#31185;&#23398;&#23478;&#26102;&#38388;&#21033;&#29992;&#30340;&#35843;&#26597;&#25968;&#25454;&#65292;&#24182;&#21457;&#29616;&#31185;&#23398;&#23478;&#22312;&#26102;&#38388;&#20998;&#37197;&#19978;&#34920;&#29616;&#20986;&#19982;&#31609;&#27454;&#21162;&#21147;&#65288;&#20363;&#22914;&#25776;&#20889;&#36192;&#27454;&#30003;&#35831;&#65289;&#20855;&#26377;&#22266;&#26377;&#31185;&#23398;&#20215;&#20540;&#30340;&#19968;&#33268;&#24615;--&#21363;&#20351;&#22312;&#25511;&#21046;&#28151;&#26434;&#22240;&#32032;&#21518;&#65292;&#33457;&#26356;&#22810;&#26102;&#38388;&#31609;&#27454;&#30340;&#31185;&#23398;&#23478;&#22312;&#30740;&#31350;&#19978;&#20063;&#27809;&#26377;&#26126;&#26174;&#20943;&#23569;&#26102;&#38388;&#12290;&#36890;&#36807;&#31454;&#36187;&#30340;&#29702;&#35770;&#27169;&#22411;&#34920;&#26126;&#20102;&#36825;&#31181;&#27491;&#21521;&#21162;&#21147;&#22806;&#37096;&#24615;&#30340;&#23384;&#22312;&#65292;&#31185;&#23398;&#23478;&#22312;&#36861;&#27714;&#36192;&#27454;&#26102;&#20135;&#29983;&#31038;&#20250;&#20215;&#20540;&#65292;&#20250;&#25913;&#21464;&#31454;&#20105;&#19982;&#36192;&#27454;&#31454;&#36187;&#30340;&#24635;&#20307;&#29983;&#20135;&#21147;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2207.02379v2 Announce Type: replace  Abstract: When funding public goods, resources are often allocated via mechanisms that resemble contests, especially in the case of research grants. A common critique of these contests is that they induce ``too much'' effort from participants. This need not be true if the effort in the contest is itself directed towards the public good. This papers analyzes survey data on scientists' time use and finds that scientists allocate their time in a way that is consistent with fundraising effort (e.g., grant writing) having inherent scientific value -- scientists who spend more time fundraising do not spent significantly less time on research even after conditioning on confounding factors. Theoretical models of contests are used to show that the presence of such a positive effort externality, where scientists generate social value when pursuing grants, changes the relationship between competition and the aggregate productivity of a grant contest. Ens
&lt;/p&gt;</description></item></channel></rss>