<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#32447;&#25237;&#36164;&#32452;&#21512;&#20998;&#37197;&#26041;&#26696;&#65292;&#20351;&#29992;&#22240;&#23376;&#21152;&#26435;&#26469;&#20135;&#29983;&#20248;&#20110;&#22343;&#21248;&#20998;&#37197;&#30340;&#25237;&#36164;&#32452;&#21512;&#65292;&#36890;&#36807;&#29702;&#35770;&#21644;&#23454;&#35777;&#20998;&#26512;&#35777;&#26126;&#20102;&#20854;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2308.07763</link><description>&lt;p&gt;
&#22312;&#32447;&#36890;&#29992;&#29380;&#21033;&#20811;&#38647;&#22240;&#23376;&#25237;&#36164;&#32452;&#21512;
&lt;/p&gt;
&lt;p&gt;
Online Universal Dirichlet Factor Portfolios. (arXiv:2308.07763v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.07763
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#32447;&#25237;&#36164;&#32452;&#21512;&#20998;&#37197;&#26041;&#26696;&#65292;&#20351;&#29992;&#22240;&#23376;&#21152;&#26435;&#26469;&#20135;&#29983;&#20248;&#20110;&#22343;&#21248;&#20998;&#37197;&#30340;&#25237;&#36164;&#32452;&#21512;&#65292;&#36890;&#36807;&#29702;&#35770;&#21644;&#23454;&#35777;&#20998;&#26512;&#35777;&#26126;&#20102;&#20854;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#37325;&#26032;&#23457;&#35270;&#20102;&#22312;&#32447;&#25237;&#36164;&#32452;&#21512;&#20998;&#37197;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20351;&#29992;&#22240;&#23376;&#21152;&#26435;&#26469;&#20135;&#29983;&#20248;&#20110;&#22343;&#21248;&#29380;&#21033;&#20811;&#38647;&#20998;&#37197;&#26041;&#26696;&#30340;&#25237;&#36164;&#32452;&#21512;&#12290;&#25105;&#20204;&#22312;&#25910;&#30410;&#24050;&#30693;&#36981;&#24490;&#22240;&#23376;&#27169;&#22411;&#30340;&#24773;&#20917;&#19979;&#65292;&#35777;&#26126;&#20102;&#25237;&#36164;&#32452;&#21512;&#22686;&#38271;&#30340;&#19979;&#30028;&#12290;&#25105;&#20204;&#36824;&#36890;&#36807;&#23454;&#35777;&#30740;&#31350;&#35777;&#26126;&#65292;&#22240;&#23376;&#21152;&#26435;&#30340;&#29380;&#21033;&#20811;&#38647;&#25277;&#26679;&#32452;&#21512;&#20248;&#20110;&#22343;&#21248;&#25277;&#26679;&#30340;&#29380;&#21033;&#20811;&#38647;&#32452;&#21512;&#25152;&#20135;&#29983;&#30340;&#36130;&#23500;&#12290;
&lt;/p&gt;
&lt;p&gt;
We revisit the online portfolio allocation problem and propose universal portfolios that use factor weighing to produce portfolios that out-perform uniform dirichlet allocation schemes. We show a few analytical results on the lower bounds of portfolio growth when the returns are known to follow a factor model. We also show analytically that factor weighted dirichlet sampled portfolios dominate the wealth generated by uniformly sampled dirichlet portfolios. We corroborate our analytical results with empirical studies on equity markets that are known to be driven by factors.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#21457;&#29616;&#65292;&#36873;&#20030;&#21046;&#24230;&#20013;&#30340;&#27604;&#20363;&#20195;&#34920;&#26041;&#27861;&#21487;&#20197;&#26367;&#20195;&#32929;&#31080;&#20132;&#26131;&#25152;&#20013;&#30340;&#25353;&#27604;&#20363;&#20998;&#37197;&#39034;&#24207;&#30340;&#21305;&#37197;&#31639;&#27861;&#65292;&#25552;&#20379;&#26356;&#25509;&#36817;&#27604;&#20363;&#20998;&#37197;&#30340;&#35746;&#21333;&#20998;&#37197;&#12290;</title><link>http://arxiv.org/abs/2303.09652</link><description>&lt;p&gt;
&#20351;&#29992;&#27604;&#20363;&#20195;&#34920;&#21046;&#26041;&#27861;&#26367;&#20195;&#32929;&#31080;&#20132;&#26131;&#25152;&#20013;&#22522;&#20110;&#27604;&#20363;&#20998;&#37197;&#39034;&#24207;&#30340;&#21305;&#37197;&#31639;&#27861;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On Using Proportional Representation Methods as Alternatives to Pro-Rata Based Order Matching Algorithms in Stock Exchanges. (arXiv:2303.09652v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09652
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21457;&#29616;&#65292;&#36873;&#20030;&#21046;&#24230;&#20013;&#30340;&#27604;&#20363;&#20195;&#34920;&#26041;&#27861;&#21487;&#20197;&#26367;&#20195;&#32929;&#31080;&#20132;&#26131;&#25152;&#20013;&#30340;&#25353;&#27604;&#20363;&#20998;&#37197;&#39034;&#24207;&#30340;&#21305;&#37197;&#31639;&#27861;&#65292;&#25552;&#20379;&#26356;&#25509;&#36817;&#27604;&#20363;&#20998;&#37197;&#30340;&#35746;&#21333;&#20998;&#37197;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30701;&#25991;&#30340;&#20027;&#35201;&#35266;&#23519;&#26159;&#65292;&#29992;&#20110;&#30830;&#23450;&#36873;&#20030;&#21046;&#24230;&#20013;&#27604;&#20363;&#20195;&#34920;&#30340;&#26041;&#27861;&#21487;&#20197;&#20316;&#20026;&#26367;&#20195;&#32929;&#31080;&#20132;&#26131;&#25152;&#20013;&#20351;&#29992;&#30340;&#25353;&#27604;&#20363;&#20998;&#37197;&#35746;&#21333;&#30340;&#21305;&#37197;&#31639;&#27861;&#30340;&#36873;&#25321;&#12290;&#25105;&#20204;&#30340;&#27169;&#25311;&#30740;&#31350;&#24378;&#26377;&#21147;&#22320;&#35777;&#26126;&#65292;&#26480;&#26000;&#36874;/&#24503;&#27721;&#29305;&#21644;&#38886;&#20271;&#26031;&#29305;/&#22307;&#25289;&#26684;&#27604;&#20363;&#20195;&#34920;&#26041;&#27861;&#25552;&#20379;&#30340;&#35746;&#21333;&#20998;&#37197;&#27604;&#25353;&#27604;&#20363;&#20998;&#37197;&#31639;&#27861;&#33719;&#24471;&#30340;&#35746;&#21333;&#20998;&#37197;&#26356;&#25509;&#36817;&#27604;&#20363;&#20998;&#37197;&#12290;
&lt;/p&gt;
&lt;p&gt;
The main observation of this short note is that methods for determining proportional representation in electoral systems may be suitable as alternatives to the pro-rata order matching algorithm used in stock exchanges. Our simulation studies provide strong evidence that the Jefferson/D'Hondt and the Webster/Saint-Lagu\"{e} proportional representation methods provide order allocations which are closer to proportionality than the order allocations obtained from the pro-rata algorithm.
&lt;/p&gt;</description></item></channel></rss>