<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#21333;&#22240;&#32032;&#39532;&#23572;&#21487;&#22827;&#26694;&#26550;&#30340;&#22810;&#26399;&#27431;&#24335;&#26399;&#26435;&#30340;&#38745;&#24577;&#23545;&#20914;&#65292;&#24182;&#23545;&#30456;&#23545;&#24615;&#33021;&#36827;&#34892;&#20102;&#23454;&#39564;&#27604;&#36739;&#12290;</title><link>http://arxiv.org/abs/2310.01104</link><description>&lt;p&gt;
&#22810;&#26399;&#27431;&#24335;&#26399;&#26435;&#30340;&#38745;&#24577;&#23545;&#20914;
&lt;/p&gt;
&lt;p&gt;
Multi-period static hedging of European options. (arXiv:2310.01104v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.01104
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#21333;&#22240;&#32032;&#39532;&#23572;&#21487;&#22827;&#26694;&#26550;&#30340;&#22810;&#26399;&#27431;&#24335;&#26399;&#26435;&#30340;&#38745;&#24577;&#23545;&#20914;&#65292;&#24182;&#23545;&#30456;&#23545;&#24615;&#33021;&#36827;&#34892;&#20102;&#23454;&#39564;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#22312;&#22522;&#30784;&#36164;&#20135;&#20215;&#26684;&#36981;&#24490;&#21333;&#22240;&#32032;&#39532;&#23572;&#21487;&#22827;&#26694;&#26550;&#30340;&#24773;&#20917;&#19979;&#23545;&#27431;&#24335;&#26399;&#26435;&#36827;&#34892;&#23545;&#20914;&#12290;Carr&#21644;Wu [1]&#22312;&#36825;&#26679;&#30340;&#35774;&#32622;&#19979;&#65292;&#23548;&#20986;&#20102;&#32473;&#23450;&#26399;&#26435;&#19982;&#22312;&#21516;&#19968;&#36164;&#20135;&#19978;&#20889;&#30340;&#19968;&#31995;&#21015;&#36739;&#30701;&#26399;&#38480;&#26399;&#26435;&#20043;&#38388;&#30340;&#36328;&#24230;&#20851;&#31995;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23558;&#20182;&#20204;&#30340;&#26041;&#27861;&#25193;&#23637;&#21040;&#21516;&#26102;&#21253;&#25324;&#22810;&#20010;&#30701;&#26399;&#21040;&#26399;&#30340;&#26399;&#26435;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#20351;&#29992;&#39640;&#26031;&#27714;&#31215;&#26041;&#27861;&#36890;&#36807;&#26377;&#38480;&#30340;&#19968;&#32452;&#30701;&#26399;&#26399;&#26435;&#30830;&#23450;&#23545;&#20914;&#35823;&#24046;&#30340;&#23454;&#38469;&#23454;&#29616;&#12290;&#25105;&#20204;&#23545;\textit{Black-Scholes}&#21644;\textit{Merton Jump Diffusion}&#27169;&#22411;&#36827;&#34892;&#20102;&#24191;&#27867;&#30340;&#23454;&#39564;&#65292;&#23637;&#31034;&#20102;&#36825;&#20004;&#31181;&#26041;&#27861;&#30340;&#27604;&#36739;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the hedging of European options when the price of the underlying asset follows a single-factor Markovian framework. By working in such a setting, Carr and Wu \cite{carr2014static} derived a spanning relation between a given option and a continuum of shorter-term options written on the same asset. In this paper, we have extended their approach to simultaneously include options over multiple short maturities. We then show a practical implementation of this with a finite set of shorter-term options to determine the hedging error using a Gaussian Quadrature method. We perform a wide range of experiments for both the \textit{Black-Scholes} and \textit{Merton Jump Diffusion} models, illustrating the comparative performance of the two methods.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#32508;&#36848;&#20102;&#36830;&#32493;&#27874;&#21160;&#29575;&#27169;&#22411;&#30340;&#21457;&#23637;&#21644;&#20851;&#38190;&#20107;&#23454;&#65292;&#37325;&#28857;&#20171;&#32461;&#20102;&#20998;&#25968;&#21644;&#31895;&#31961;&#26041;&#27861;&#30340;&#27169;&#22411;&#65292;&#24182;&#35752;&#35770;&#20102;VIX&#24314;&#27169;&#38382;&#39064;&#21644;SPX-VIX&#32852;&#21512;&#26657;&#20934;&#38590;&#39064;&#30340;&#26368;&#26032;&#36827;&#23637;&#12290;</title><link>http://arxiv.org/abs/2309.01033</link><description>&lt;p&gt;
&#20174;&#24658;&#23450;&#21040;&#31895;&#31961;&#65306;&#36830;&#32493;&#27874;&#21160;&#29575;&#24314;&#27169;&#30340;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
From constant to rough: A survey of continuous volatility modeling. (arXiv:2309.01033v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.01033
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32508;&#36848;&#20102;&#36830;&#32493;&#27874;&#21160;&#29575;&#27169;&#22411;&#30340;&#21457;&#23637;&#21644;&#20851;&#38190;&#20107;&#23454;&#65292;&#37325;&#28857;&#20171;&#32461;&#20102;&#20998;&#25968;&#21644;&#31895;&#31961;&#26041;&#27861;&#30340;&#27169;&#22411;&#65292;&#24182;&#35752;&#35770;&#20102;VIX&#24314;&#27169;&#38382;&#39064;&#21644;SPX-VIX&#32852;&#21512;&#26657;&#20934;&#38590;&#39064;&#30340;&#26368;&#26032;&#36827;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20840;&#38754;&#35843;&#26597;&#20102;&#36830;&#32493;&#38543;&#26426;&#27874;&#21160;&#29575;&#27169;&#22411;&#65292;&#24182;&#35752;&#35770;&#20102;&#23427;&#20204;&#30340;&#21382;&#21490;&#21457;&#23637;&#21644;&#39537;&#21160;&#35813;&#39046;&#22495;&#30340;&#20851;&#38190;&#20107;&#23454;&#12290;&#25105;&#20204;&#29305;&#21035;&#20851;&#27880;&#20998;&#25968;&#21644;&#31895;&#31961;&#26041;&#27861;&#65306;&#25105;&#20204;&#27010;&#36848;&#20102;&#23427;&#20204;&#32972;&#21518;&#30340;&#21160;&#26426;&#65292;&#24182;&#23545;&#19968;&#20123;&#37324;&#31243;&#30865;&#24335;&#27169;&#22411;&#36827;&#34892;&#20102;&#34920;&#24449;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#31616;&#35201;&#35752;&#35770;&#20102;VIX&#24314;&#27169;&#30340;&#38382;&#39064;&#20197;&#21450;SPX-VIX&#32852;&#21512;&#26657;&#20934;&#38590;&#39064;&#30340;&#26368;&#26032;&#36827;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we present a comprehensive survey of continuous stochastic volatility models, discussing their historical development and the key stylized facts that have driven the field. Special attention is dedicated to fractional and rough methods: we outline the motivation behind them and characterize some landmark models. In addition, we briefly touch the problem of VIX modeling and recent advances in the SPX-VIX joint calibration puzzle.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20351;&#29992;&#36125;&#21494;&#26031;&#32593;&#32476;&#26041;&#27861;&#65292;&#20174;&#22240;&#26524;&#20998;&#26512;&#30340;&#35282;&#24230;&#30740;&#31350;&#20102;&#24433;&#21709;&#26367;&#20195;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#30340;&#22240;&#32032;&#65292;&#21253;&#25324;&#20116;&#31181;&#20027;&#35201;&#26367;&#20195;&#21152;&#23494;&#36135;&#24065;&#12289;&#20256;&#32479;&#37329;&#34701;&#36164;&#20135;&#21644;&#31038;&#20132;&#23186;&#20307;&#65292;&#25552;&#20379;&#20102;&#19968;&#31181;&#35299;&#20915;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#39044;&#27979;&#38382;&#39064;&#30340;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2303.16148</link><description>&lt;p&gt;
&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#22240;&#32032;&#30340;&#24314;&#27169;&#65306;&#19968;&#31181;&#36125;&#21494;&#26031;&#32593;&#32476;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Modelling Determinants of Cryptocurrency Prices: A Bayesian Network Approach. (arXiv:2303.16148v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.16148
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#36125;&#21494;&#26031;&#32593;&#32476;&#26041;&#27861;&#65292;&#20174;&#22240;&#26524;&#20998;&#26512;&#30340;&#35282;&#24230;&#30740;&#31350;&#20102;&#24433;&#21709;&#26367;&#20195;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#30340;&#22240;&#32032;&#65292;&#21253;&#25324;&#20116;&#31181;&#20027;&#35201;&#26367;&#20195;&#21152;&#23494;&#36135;&#24065;&#12289;&#20256;&#32479;&#37329;&#34701;&#36164;&#20135;&#21644;&#31038;&#20132;&#23186;&#20307;&#65292;&#25552;&#20379;&#20102;&#19968;&#31181;&#35299;&#20915;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#39044;&#27979;&#38382;&#39064;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24066;&#22330;&#24635;&#20540;&#21644;&#26367;&#20195;&#27604;&#29305;&#24065;&#30340;&#21152;&#23494;&#36135;&#24065;&#25968;&#37327;&#30340;&#22686;&#38271;&#25552;&#20379;&#20102;&#25237;&#36164;&#26426;&#20250;&#65292;&#21516;&#26102;&#20063;&#22686;&#21152;&#20102;&#39044;&#27979;&#20854;&#20215;&#26684;&#27874;&#21160;&#30340;&#22797;&#26434;&#24230;&#12290;&#22312;&#36825;&#20010;&#27874;&#21160;&#24615;&#30456;&#23545;&#36739;&#24369;&#30340;&#24066;&#22330;&#20013;&#65292;&#39044;&#27979;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#30340;&#19968;&#20010;&#37325;&#35201;&#25361;&#25112;&#26159;&#38656;&#35201;&#30830;&#23450;&#24433;&#21709;&#20215;&#26684;&#30340;&#22240;&#32032;&#12290;&#26412;&#30740;&#31350;&#30340;&#37325;&#28857;&#26159;&#20174;&#22240;&#26524;&#20998;&#26512;&#30340;&#35282;&#24230;&#30740;&#31350;&#24433;&#21709;&#26367;&#20195;&#27604;&#29305;&#24065;&#20215;&#26684;&#30340;&#22240;&#32032;&#65292;&#29305;&#21035;&#22320;&#65292;&#30740;&#31350;&#20102;&#20116;&#20010;&#20027;&#35201;&#30340;&#26367;&#20195;&#21152;&#23494;&#36135;&#24065;&#65292;&#21253;&#25324;&#40644;&#37329;&#12289;&#30707;&#27833;&#21644;&#26631;&#20934;&#26222;&#23572;500&#25351;&#25968;&#31561;&#20256;&#32479;&#37329;&#34701;&#36164;&#20135;&#20197;&#21450;&#31038;&#20132;&#23186;&#20307;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;&#20026;&#20102;&#22238;&#31572;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#21019;&#24314;&#20102;&#30001;&#20116;&#20010;&#20256;&#32479;&#37329;&#34701;&#36164;&#20135;&#30340;&#21382;&#21490;&#20215;&#26684;&#25968;&#25454;&#12289;&#31038;&#20132;&#23186;&#20307;&#25968;&#25454;&#21644;&#26367;&#20195;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#25968;&#25454;&#26500;&#25104;&#30340;&#22240;&#26524;&#32593;&#32476;&#65292;&#36825;&#20123;&#32593;&#32476;&#29992;&#20110;&#22240;&#26524;&#25512;&#29702;&#21644;&#35786;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;
The growth of market capitalisation and the number of altcoins (cryptocurrencies other than Bitcoin) provide investment opportunities and complicate the prediction of their price movements. A significant challenge in this volatile and relatively immature market is the problem of predicting cryptocurrency prices which needs to identify the factors influencing these prices. The focus of this study is to investigate the factors influencing altcoin prices, and these factors have been investigated from a causal analysis perspective using Bayesian networks. In particular, studying the nature of interactions between five leading altcoins, traditional financial assets including gold, oil, and S\&amp;P 500, and social media is the research question. To provide an answer to the question, we create causal networks which are built from the historic price data of five traditional financial assets, social media data, and price data of altcoins. The ensuing networks are used for causal reasoning and diag
&lt;/p&gt;</description></item></channel></rss>