<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#20351;&#29992;FinBERT&#36827;&#34892;&#36130;&#32463;&#24773;&#32490;&#20998;&#26512;&#65292;&#26500;&#24314;&#20102;&#22522;&#20110;LSTM&#30340;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#26469;&#39044;&#27979;&#24066;&#22330;&#36816;&#21160;&#65292;&#21457;&#29616;&#24773;&#32490;&#26159;&#39044;&#27979;&#24066;&#22330;&#36816;&#21160;&#30340;&#26377;&#25928;&#22240;&#32032;&#65292;&#24182;&#25552;&#20986;&#20102;&#25913;&#36827;&#27169;&#22411;&#30340;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2306.02136</link><description>&lt;p&gt;
&#20351;&#29992;FinBERT&#36827;&#34892;&#36130;&#32463;&#24773;&#32490;&#20998;&#26512;&#21450;&#24212;&#29992;&#20110;&#32929;&#31080;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Financial sentiment analysis using FinBERT with application in predicting stock movement. (arXiv:2306.02136v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.02136
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;FinBERT&#36827;&#34892;&#36130;&#32463;&#24773;&#32490;&#20998;&#26512;&#65292;&#26500;&#24314;&#20102;&#22522;&#20110;LSTM&#30340;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#26469;&#39044;&#27979;&#24066;&#22330;&#36816;&#21160;&#65292;&#21457;&#29616;&#24773;&#32490;&#26159;&#39044;&#27979;&#24066;&#22330;&#36816;&#21160;&#30340;&#26377;&#25928;&#22240;&#32032;&#65292;&#24182;&#25552;&#20986;&#20102;&#25913;&#36827;&#27169;&#22411;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20351;&#29992;FinBERT&#36827;&#34892;&#36130;&#32463;&#24773;&#32490;&#20998;&#26512;&#65292;&#24182;&#26500;&#24314;&#20102;&#22522;&#20110;LSTM&#30340;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#26469;&#39044;&#27979;&#37329;&#34701;&#24066;&#22330;&#30340;&#36816;&#21160;&#12290;&#25105;&#20204;&#23558;&#36825;&#20010;&#27169;&#22411;&#24212;&#29992;&#20110;&#32929;&#31080;&#26032;&#38395;&#25968;&#25454;&#38598;&#65292;&#24182;&#23558;&#20854;&#26377;&#25928;&#24615;&#19982;BERT&#65292;LSTM&#21644;&#32463;&#20856;&#30340;ARIMA&#27169;&#22411;&#36827;&#34892;&#27604;&#36739;&#12290;&#25105;&#20204;&#21457;&#29616;&#24773;&#32490;&#26159;&#39044;&#27979;&#24066;&#22330;&#36816;&#21160;&#30340;&#26377;&#25928;&#22240;&#32032;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#20960;&#31181;&#25913;&#36827;&#27169;&#22411;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
We apply sentiment analysis in financial context using FinBERT, and build a deep neural network model based on LSTM to predict the movement of financial market movement. We apply this model on stock news dataset, and compare its effectiveness to BERT, LSTM and classical ARIMA model. We find that sentiment is an effective factor in predicting market movement. We also propose several method to improve the model.
&lt;/p&gt;</description></item></channel></rss>