<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#20851;&#20110;&#27604;&#36739;&#22797;&#26434;&#24615;&#30340;&#29702;&#35770;&#65292;&#24182;&#35777;&#26126;&#20102;&#27604;&#36739;&#22797;&#26434;&#24615;&#23548;&#33268;&#36873;&#25321;&#38169;&#35823;&#21644;&#31995;&#32479;&#24615;&#38169;&#35823;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#34920;&#26126;&#65292;&#36873;&#39033;&#30340;&#30456;&#20284;&#24615;&#21644;&#25509;&#36817;&#25903;&#37197;&#24230;&#26159;&#24433;&#21709;&#27604;&#36739;&#22797;&#26434;&#24615;&#30340;&#20004;&#20010;&#37325;&#35201;&#22240;&#32032;&#12290;&#35813;&#30740;&#31350;&#30340;&#23454;&#35777;&#32467;&#26524;&#36824;&#34920;&#26126;&#65292;&#27604;&#36739;&#22797;&#26434;&#24615;&#24230;&#37327;&#21487;&#20197;&#39044;&#27979;&#36873;&#25321;&#38169;&#35823;&#12289;&#36873;&#25321;&#19981;&#19968;&#33268;&#20197;&#21450;&#35748;&#30693;&#19981;&#30830;&#23450;&#24615;&#65292;&#24182;&#21487;&#20197;&#35299;&#37322;&#36873;&#25321;&#21644;&#35780;&#20272;&#20013;&#30340;&#32463;&#20856;&#24322;&#24120;&#29616;&#35937;&#12290;</title><link>https://arxiv.org/abs/2401.17578</link><description>&lt;p&gt;
&#30456;&#20284;&#24615;&#21644;&#27604;&#36739;&#30340;&#22797;&#26434;&#24615;
&lt;/p&gt;
&lt;p&gt;
Similarity and Comparison Complexity
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2401.17578
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#20851;&#20110;&#27604;&#36739;&#22797;&#26434;&#24615;&#30340;&#29702;&#35770;&#65292;&#24182;&#35777;&#26126;&#20102;&#27604;&#36739;&#22797;&#26434;&#24615;&#23548;&#33268;&#36873;&#25321;&#38169;&#35823;&#21644;&#31995;&#32479;&#24615;&#38169;&#35823;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#34920;&#26126;&#65292;&#36873;&#39033;&#30340;&#30456;&#20284;&#24615;&#21644;&#25509;&#36817;&#25903;&#37197;&#24230;&#26159;&#24433;&#21709;&#27604;&#36739;&#22797;&#26434;&#24615;&#30340;&#20004;&#20010;&#37325;&#35201;&#22240;&#32032;&#12290;&#35813;&#30740;&#31350;&#30340;&#23454;&#35777;&#32467;&#26524;&#36824;&#34920;&#26126;&#65292;&#27604;&#36739;&#22797;&#26434;&#24615;&#24230;&#37327;&#21487;&#20197;&#39044;&#27979;&#36873;&#25321;&#38169;&#35823;&#12289;&#36873;&#25321;&#19981;&#19968;&#33268;&#20197;&#21450;&#35748;&#30693;&#19981;&#30830;&#23450;&#24615;&#65292;&#24182;&#21487;&#20197;&#35299;&#37322;&#36873;&#25321;&#21644;&#35780;&#20272;&#20013;&#30340;&#32463;&#20856;&#24322;&#24120;&#29616;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#20123;&#36873;&#25321;&#36873;&#39033;&#27604;&#20854;&#20182;&#36873;&#39033;&#26356;&#38590;&#27604;&#36739;&#12290;&#26412;&#25991;&#24314;&#31435;&#20102;&#19968;&#20010;&#20851;&#20110;&#20160;&#20040;&#23548;&#33268;&#27604;&#36739;&#22797;&#26434;&#20197;&#21450;&#27604;&#36739;&#22797;&#26434;&#22914;&#20309;&#22312;&#36873;&#25321;&#20013;&#20135;&#29983;&#31995;&#32479;&#24615;&#38169;&#35823;&#30340;&#29702;&#35770;&#12290;&#22312;&#25105;&#20204;&#30340;&#27169;&#22411;&#20013;&#65292;&#24403;&#36873;&#39033;&#20849;&#20139;&#30456;&#20284;&#29305;&#24449;&#65288;&#22312;&#22266;&#23450;&#20215;&#20540;&#24046;&#24322;&#30340;&#24773;&#20917;&#19979;&#65289;&#19988;&#26356;&#25509;&#36817;&#25903;&#37197;&#26102;&#65292;&#27604;&#36739;&#26356;&#23481;&#26131;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#22312;&#22810;&#23646;&#24615;&#12289;&#24425;&#31080;&#21644;&#26102;&#38388;&#38388;&#38548;&#36873;&#25321;&#39046;&#22495;&#36890;&#36807;&#36825;&#20004;&#20010;&#20551;&#35774;&#24471;&#20986;&#21487;&#25805;&#20316;&#30340;&#27604;&#36739;&#22797;&#26434;&#24615;&#24230;&#37327;&#12290;&#20351;&#29992;&#20851;&#20110;&#20108;&#20803;&#36873;&#25321;&#30340;&#23454;&#39564;&#25968;&#25454;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#22797;&#26434;&#24615;&#24230;&#37327;&#21487;&#20197;&#39044;&#27979;&#36873;&#25321;&#38169;&#35823;&#12289;&#36873;&#25321;&#19981;&#19968;&#33268;&#20197;&#21450;&#35748;&#30693;&#19981;&#30830;&#23450;&#24615;&#22312;&#36825;&#19977;&#20010;&#39046;&#22495;&#20013;&#30340;&#23384;&#22312;&#12290;&#28982;&#21518;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#36873;&#25321;&#21644;&#35780;&#20272;&#20013;&#30340;&#32463;&#20856;&#24322;&#24120;&#29616;&#35937;&#65292;&#35832;&#22914;&#24773;&#22659;&#25928;&#24212;&#12289;&#20559;&#22909;&#36870;&#36716;&#20197;&#21450;&#22312;&#23545;&#20882;&#38505;&#21644;&#26102;&#38388;&#38388;&#38548;&#21069;&#26223;&#30340;&#35780;&#20272;&#20013;&#34920;&#29616;&#20986;&#30340;&#26126;&#26174;&#27010;&#29575;&#21152;&#26435;&#21644;&#26102;&#38388;&#20559;&#24046;&#65292;&#21487;&#20197;&#34987;&#29702;&#35299;&#20026;&#23545;&#27604;&#36739;&#22797;&#26434;&#24615;&#30340;&#21453;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
Some choice options are more difficult to compare than others. This paper develops a theory of what makes a comparison complex, and how comparison complexity generates systematic mistakes in choice. In our model, options are easier to compare when they 1) share similar features, holding fixed their value difference, and 2) are closer to dominance. We show how these two postulates yield tractable measures of comparison complexity in the domains of multiattribute, lottery, and intertemporal choice. Using experimental data on binary choices, we demonstrate that our complexity measures predict choice errors, choice inconsistency, and cognitive uncertainty across all three domains. We then show how canonical anomalies in choice and valuation, such as context effects, preference reversals, and apparent probability weighting and present bias in the valuation of risky and intertemporal prospects, can be understood as responses to comparison complexity.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#24341;&#20837;&#36164;&#20135;&#22240;&#26524;&#32422;&#26463;&#65292;&#25552;&#20986;&#20102;&#40614;&#31185;&#23494;&#20811;&#26494;&#26368;&#20339;&#20256;&#36755;&#27169;&#22411;&#65288;McCormick MOT&#65289;&#65292;&#36890;&#36807;&#40614;&#31185;&#23494;&#20811;&#26494;&#26494;&#24347;&#26469;&#32531;&#35299;&#35745;&#31639;&#19978;&#30340;&#25361;&#25112;&#65292;&#24182;&#19988;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#20854;&#33021;&#22815;&#32553;&#23567;&#20215;&#26684;&#30028;&#38480;&#65292;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#38477;&#20302;&#12290;</title><link>http://arxiv.org/abs/2401.15552</link><description>&lt;p&gt;
McCormick&#39532;&#19969;&#26684;&#23572;&#26368;&#20339;&#20256;&#36755;
&lt;/p&gt;
&lt;p&gt;
The McCormick martingale optimal transport. (arXiv:2401.15552v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.15552
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#24341;&#20837;&#36164;&#20135;&#22240;&#26524;&#32422;&#26463;&#65292;&#25552;&#20986;&#20102;&#40614;&#31185;&#23494;&#20811;&#26494;&#26368;&#20339;&#20256;&#36755;&#27169;&#22411;&#65288;McCormick MOT&#65289;&#65292;&#36890;&#36807;&#40614;&#31185;&#23494;&#20811;&#26494;&#26494;&#24347;&#26469;&#32531;&#35299;&#35745;&#31639;&#19978;&#30340;&#25361;&#25112;&#65292;&#24182;&#19988;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#20854;&#33021;&#22815;&#32553;&#23567;&#20215;&#26684;&#30028;&#38480;&#65292;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#38477;&#20302;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39532;&#19969;&#26684;&#23572;&#26368;&#20339;&#20256;&#36755;&#65288;MOT&#65289;&#36890;&#24120;&#20026;&#26399;&#26435;&#25552;&#20379;&#24191;&#27867;&#30340;&#20215;&#26684;&#30028;&#38480;&#65292;&#38480;&#21046;&#20102;&#23427;&#20204;&#30340;&#23454;&#38469;&#36866;&#29992;&#24615;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#36890;&#36807;&#24341;&#20837;&#36164;&#20135;&#20043;&#38388;&#30340;&#22240;&#26524;&#32422;&#26463;&#65292;&#25193;&#23637;&#20102;MOT&#65292;&#28789;&#24863;&#26469;&#33258;&#38543;&#26426;&#36807;&#31243;&#30340;&#38750;&#39044;&#26399;&#24615;&#26465;&#20214;&#12290;&#28982;&#32780;&#65292;&#36825;&#24341;&#20837;&#20102;&#19968;&#20010;&#35745;&#31639;&#19978;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#21452;&#32447;&#24615;&#35268;&#21010;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#40614;&#31185;&#23494;&#20811;&#26494;&#26494;&#24347;&#26469;&#32531;&#35299;&#21452;&#22240;&#26524;&#24418;&#24335;&#65292;&#24182;&#23558;&#20854;&#31216;&#20026;&#40614;&#31185;&#23494;&#20811;&#26494;MOT&#12290;&#22312;&#26631;&#20934;&#20551;&#35774;&#19979;&#65292;&#24314;&#31435;&#20102;&#40614;&#31185;&#23494;&#20811;&#26494;MOT&#30340;&#21407;&#22987;&#23454;&#29616;&#21644;&#24378;&#23545;&#20598;&#24615;&#12290;&#23454;&#35777;&#32467;&#26524;&#26174;&#31034;&#65292;&#40614;&#31185;&#23494;&#20811;&#26494;MOT&#33021;&#22815;&#32553;&#23567;&#20215;&#26684;&#30028;&#38480;&#65292;&#24179;&#22343;&#38477;&#20302;&#20102;1&#65285;&#25110;4&#65285;&#12290;&#25913;&#21892;&#31243;&#24230;&#21462;&#20915;&#20110;&#26399;&#26435;&#30340;&#22238;&#25253;&#21644;&#30456;&#20851;&#39321;&#33609;&#26399;&#26435;&#30340;&#27969;&#21160;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Martingale optimal transport (MOT) often yields broad price bounds for options, constraining their practical applicability. In this study, we extend MOT by incorporating causality constraints among assets, inspired by the nonanticipativity condition of stochastic processes. However, this introduces a computationally challenging bilinear program. To tackle this issue, we propose McCormick relaxations to ease the bicausal formulation and refer to it as McCormick MOT. The primal attainment and strong duality of McCormick MOT are established under standard assumptions. Empirically, McCormick MOT demonstrates the capability to narrow price bounds, achieving an average reduction of 1% or 4%. The degree of improvement depends on the payoffs of the options and the liquidity of the relevant vanilla options.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35777;&#26126;&#20102;&#31070;&#32463;&#32593;&#32476;&#21487;&#20197;&#26816;&#27979;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#26080;&#27169;&#22411;&#38745;&#24577;&#22871;&#21033;&#26426;&#20250;&#65292;&#24182;&#21487;&#24212;&#29992;&#20110;&#20132;&#26131;&#35777;&#21048;&#25968;&#37327;&#36739;&#22810;&#30340;&#37329;&#34701;&#24066;&#22330;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20855;&#26377;&#26131;&#22788;&#29702;&#24615;&#12289;&#26377;&#25928;&#24615;&#21644;&#31283;&#20581;&#24615;&#65292;&#24182;&#20351;&#29992;&#30495;&#23454;&#37329;&#34701;&#25968;&#25454;&#36827;&#34892;&#20102;&#31034;&#20363;&#39564;&#35777;&#12290;</title><link>http://arxiv.org/abs/2306.16422</link><description>&lt;p&gt;
&#31070;&#32463;&#32593;&#32476;&#21487;&#20197;&#26816;&#27979;&#26080;&#27169;&#22411;&#38745;&#24577;&#22871;&#21033;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Neural networks can detect model-free static arbitrage strategies. (arXiv:2306.16422v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.16422
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35777;&#26126;&#20102;&#31070;&#32463;&#32593;&#32476;&#21487;&#20197;&#26816;&#27979;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#26080;&#27169;&#22411;&#38745;&#24577;&#22871;&#21033;&#26426;&#20250;&#65292;&#24182;&#21487;&#24212;&#29992;&#20110;&#20132;&#26131;&#35777;&#21048;&#25968;&#37327;&#36739;&#22810;&#30340;&#37329;&#34701;&#24066;&#22330;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20855;&#26377;&#26131;&#22788;&#29702;&#24615;&#12289;&#26377;&#25928;&#24615;&#21644;&#31283;&#20581;&#24615;&#65292;&#24182;&#20351;&#29992;&#30495;&#23454;&#37329;&#34701;&#25968;&#25454;&#36827;&#34892;&#20102;&#31034;&#20363;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;&#29702;&#35770;&#21644;&#25968;&#20540;&#26041;&#27861;&#35777;&#26126;&#20102;&#31070;&#32463;&#32593;&#32476;&#21487;&#20197;&#22312;&#24066;&#22330;&#23384;&#22312;&#22871;&#21033;&#26426;&#20250;&#26102;&#26816;&#27979;&#20986;&#26080;&#27169;&#22411;&#38745;&#24577;&#22871;&#21033;&#26426;&#20250;&#12290;&#30001;&#20110;&#20351;&#29992;&#20102;&#31070;&#32463;&#32593;&#32476;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#21487;&#20197;&#24212;&#29992;&#20110;&#20132;&#26131;&#35777;&#21048;&#25968;&#37327;&#36739;&#22810;&#30340;&#37329;&#34701;&#24066;&#22330;&#65292;&#24182;&#30830;&#20445;&#30456;&#24212;&#20132;&#26131;&#31574;&#30053;&#30340;&#20960;&#20046;&#21363;&#26102;&#25191;&#34892;&#12290;&#20026;&#20102;&#35777;&#26126;&#20854;&#26131;&#22788;&#29702;&#24615;&#12289;&#26377;&#25928;&#24615;&#21644;&#31283;&#20581;&#24615;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#20351;&#29992;&#30495;&#23454;&#37329;&#34701;&#25968;&#25454;&#30340;&#31034;&#20363;&#12290;&#20174;&#25216;&#26415;&#35282;&#24230;&#26469;&#30475;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#21333;&#20010;&#31070;&#32463;&#32593;&#32476;&#21487;&#20197;&#36817;&#20284;&#35299;&#20915;&#19968;&#31867;&#20984;&#21322;&#26080;&#38480;&#35268;&#21010;&#38382;&#39064;&#65292;&#36825;&#26159;&#25512;&#23548;&#20986;&#25105;&#20204;&#30340;&#29702;&#35770;&#32467;&#26524;&#30340;&#20851;&#38190;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper we demonstrate both theoretically as well as numerically that neural networks can detect model-free static arbitrage opportunities whenever the market admits some. Due to the use of neural networks, our method can be applied to financial markets with a high number of traded securities and ensures almost immediate execution of the corresponding trading strategies. To demonstrate its tractability, effectiveness, and robustness we provide examples using real financial data. From a technical point of view, we prove that a single neural network can approximately solve a class of convex semi-infinite programs, which is the key result in order to derive our theoretical results that neural networks can detect model-free static arbitrage strategies whenever the financial market admits such opportunities.
&lt;/p&gt;</description></item></channel></rss>