<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#36890;&#36807;&#27888;&#21202;&#35268;&#21017;&#65292;&#30740;&#31350;&#20102;1990-2020&#24180;&#32654;&#22269;&#21644;&#33521;&#22269;&#30340;&#36135;&#24065;&#25919;&#31574;&#19982;&#32929;&#31080;&#24066;&#22330;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#20197;&#21450;&#36135;&#24065;&#25919;&#31574;&#19982;&#36164;&#20135;&#20215;&#26684;&#27874;&#21160;&#20043;&#38388;&#30340;&#32852;&#31995;&#65292;&#24182;&#27604;&#36739;&#20102;&#32654;&#22269;&#21644;&#33521;&#22269;&#30340;&#25919;&#31574;&#20915;&#31574;&#21487;&#29992;&#27888;&#21202;&#35268;&#21017;&#35299;&#37322;&#30340;&#31243;&#24230;&#12290;</title><link>http://arxiv.org/abs/2305.13930</link><description>&lt;p&gt;
&#36135;&#24065;&#25919;&#31574;&#19982;&#32929;&#31080;&#24066;&#22330;
&lt;/p&gt;
&lt;p&gt;
Monetary Policy &amp; Stock Market. (arXiv:2305.13930v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.13930
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#27888;&#21202;&#35268;&#21017;&#65292;&#30740;&#31350;&#20102;1990-2020&#24180;&#32654;&#22269;&#21644;&#33521;&#22269;&#30340;&#36135;&#24065;&#25919;&#31574;&#19982;&#32929;&#31080;&#24066;&#22330;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#20197;&#21450;&#36135;&#24065;&#25919;&#31574;&#19982;&#36164;&#20135;&#20215;&#26684;&#27874;&#21160;&#20043;&#38388;&#30340;&#32852;&#31995;&#65292;&#24182;&#27604;&#36739;&#20102;&#32654;&#22269;&#21644;&#33521;&#22269;&#30340;&#25919;&#31574;&#20915;&#31574;&#21487;&#29992;&#27888;&#21202;&#35268;&#21017;&#35299;&#37322;&#30340;&#31243;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#27888;&#21202;&#35268;&#21017;&#20844;&#24335;&#65292;&#35780;&#20272;&#20102;1990&#24180;&#33267;2020&#24180;&#32654;&#22269;&#21644;&#33521;&#22269;&#22830;&#34892;&#25919;&#31574;&#21033;&#29575;&#12289;&#36890;&#32960;&#29575;&#21644;&#20135;&#20986;&#32570;&#21475;&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;&#21516;&#26102;&#65292;&#20351;&#29992;&#22686;&#24378;&#30340;&#27888;&#21202;&#35268;&#21017;&#20998;&#26512;&#20102;&#36135;&#24065;&#25919;&#31574;&#19982;&#36164;&#20135;&#20215;&#26684;&#27874;&#21160;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#26412;&#25991;&#26816;&#39564;&#20102;&#26041;&#31243;&#31995;&#25968;&#30340;&#31283;&#23450;&#24615;&#20197;&#21450;&#22312;&#19981;&#21516;&#24773;&#24418;&#19979;&#30340;&#40065;&#26834;&#24615;&#12290;&#32467;&#26524;&#21457;&#29616;&#32654;&#22269;&#21644;&#33521;&#22269;&#30340;&#25919;&#31574;&#20915;&#31574;&#37117;&#21487;&#29992;&#27888;&#21202;&#35268;&#21017;&#35299;&#37322;&#65292;&#21516;&#26102;&#25991;&#31456;&#20063;&#25506;&#35752;&#20102;&#36164;&#20135;&#20215;&#26684;&#29992;&#20110;&#35780;&#20272;&#22830;&#34892;&#36135;&#24065;&#25919;&#31574;&#20915;&#31574;&#30340;&#25928;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper assesses the link between central bank's policy rate, inflation rate and output gap through Taylor rule equation in both United States and United Kingdom from 1990 to 2020. Also, it analyses the relationship between monetary policy and asset price volatility using an augmented Taylor rule. According to the literature, there has been a discussion about the utility of using asset prices to evaluate central bank monetary policy decisions. First, I derive the equation coefficients and examine the stability of the relationship over the shocking period. Test the model with actual data to see its robustness. I add asset price to the equation in the next step, and then test the relationship by Normality, Newey-West, and GMM estimator tests. Lastly, I conduct comparison between USA and UK results to find out which country's policy decisions can be explained better through Taylor rule.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25512;&#24191;&#20102;&#23616;&#37096;&#27874;&#21160;&#20285;&#39532;&#27169;&#22411;&#65292;&#20351;&#29992;&#20998;&#27573;&#20108;&#27425;&#23616;&#37096;&#27874;&#21160;&#20989;&#25968;&#23454;&#29616;&#20102;$\mathcal{C}^3$&#32423;&#21035;&#30340;&#26080;&#22871;&#21033;&#31867;&#25554;&#20540;&#65292;&#24182;&#33021;&#22815;&#22312;&#25554;&#20540;&#26102;&#20943;&#23569;&#33410;&#28857;&#25968;&#37327;&#26469;&#38477;&#20302;&#35745;&#31639;&#25104;&#26412;&#12290;</title><link>http://arxiv.org/abs/2305.13791</link><description>&lt;p&gt;
&#20108;&#27425;&#23616;&#37096;&#27874;&#21160;&#20285;&#39532;&#27169;&#22411;&#65306;&#29992;&#20110;&#26399;&#26435;&#20215;&#26684;&#30340;&#26080;&#22871;&#21033;&#31867;$\mathcal{C}^3$&#25554;&#20540;&#30340;&#25512;&#24191;
&lt;/p&gt;
&lt;p&gt;
The Quadratic Local Variance Gamma Model: an arbitrage-free interpolation of class $\mathcal{C}^3$ for option prices. (arXiv:2305.13791v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.13791
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25512;&#24191;&#20102;&#23616;&#37096;&#27874;&#21160;&#20285;&#39532;&#27169;&#22411;&#65292;&#20351;&#29992;&#20998;&#27573;&#20108;&#27425;&#23616;&#37096;&#27874;&#21160;&#20989;&#25968;&#23454;&#29616;&#20102;$\mathcal{C}^3$&#32423;&#21035;&#30340;&#26080;&#22871;&#21033;&#31867;&#25554;&#20540;&#65292;&#24182;&#33021;&#22815;&#22312;&#25554;&#20540;&#26102;&#20943;&#23569;&#33410;&#28857;&#25968;&#37327;&#26469;&#38477;&#20302;&#35745;&#31639;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23558;Carr&#21644;Nadtochiy&#30340;&#23616;&#37096;&#27874;&#21160;&#20285;&#39532;&#27169;&#22411;&#25512;&#24191;&#21040;&#20998;&#27573;&#20108;&#27425;&#23616;&#37096;&#27874;&#21160;&#20989;&#25968;&#12290;&#35813;&#20844;&#24335;&#21253;&#25324;&#20998;&#27573;&#32447;&#24615;Bachelier&#21644;&#20998;&#27573;&#32447;&#24615;Black&#23616;&#37096;&#27874;&#21160;&#20285;&#39532;&#27169;&#22411;&#12290;&#20108;&#27425;&#23616;&#37096;&#27874;&#21160;&#20989;&#25968;&#23548;&#33268;&#20102;$\mathcal{C}^3$&#32423;&#21035;&#30340;&#26080;&#22871;&#21033;&#31867;&#25554;&#20540;&#12290;&#30456;&#36739;&#20110;&#20998;&#27573;&#24120;&#25968;&#21644;&#20998;&#27573;&#32447;&#24615;&#34920;&#31034;&#65292;&#22686;&#21152;&#30340;&#24179;&#28369;&#24230;&#22312;&#25554;&#20540;&#21407;&#22987;&#24066;&#22330;&#25253;&#20215;&#26102;&#20801;&#35768;&#20943;&#23569;&#33410;&#28857;&#25968;&#37327;&#65292;&#20174;&#32780;&#25552;&#20379;&#20102;&#19968;&#20010;&#26377;&#36259;&#30340;&#27491;&#21017;&#21270;&#26367;&#20195;&#26041;&#26696;&#21516;&#26102;&#38477;&#20302;&#35745;&#31639;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper generalizes the local variance gamma model of Carr and Nadtochiy, to a piecewise quadratic local variance function. The formulation encompasses the piecewise linear Bachelier and piecewise linear Black local variance gamma models. The quadratic local variance function results in an arbitrage-free interpolation of class $\mathcal{C}^3$. The increased smoothness over the piecewise-constant and piecewise-linear representation allows to reduce the number of knots when interpolating raw market quotes, thus providing an interesting alternative to regularization while reducing the computational cost.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21487;&#20197;&#21033;&#29992;&#26080;&#30417;&#30563;&#34920;&#31034;&#23398;&#20064;&#25216;&#26415;&#24314;&#31435;&#39640;&#36136;&#37327;&#30340;&#34892;&#19994;&#21644;&#20135;&#21697;/&#26381;&#21153;&#20195;&#30721;&#20998;&#31867;&#31995;&#32479;&#30340;&#26041;&#27861;&#65292;&#21516;&#26102;&#20063;&#30830;&#20445;&#20102;&#37329;&#34701;&#39046;&#22495;&#20869;&#30340;&#39640;&#31934;&#24230;&#32467;&#26524;&#12290;&#32463;&#36807;&#35780;&#20272;&#65292;&#22312;&#36229;&#36807;20,000&#23478;&#20844;&#21496;&#30340;&#25968;&#25454;&#38598;&#19978;&#23454;&#29616;&#20102;&#36229;&#36807;92%&#30340;&#20998;&#31867;&#31934;&#24230;&#12290;</title><link>http://arxiv.org/abs/2305.13532</link><description>&lt;p&gt;
InProC: &#24037;&#19994;&#21644;&#20135;&#21697;/&#26381;&#21153;&#32534;&#30721;&#20998;&#31867;
&lt;/p&gt;
&lt;p&gt;
InProC: Industry and Product/Service Code Classification. (arXiv:2305.13532v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.13532
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21487;&#20197;&#21033;&#29992;&#26080;&#30417;&#30563;&#34920;&#31034;&#23398;&#20064;&#25216;&#26415;&#24314;&#31435;&#39640;&#36136;&#37327;&#30340;&#34892;&#19994;&#21644;&#20135;&#21697;/&#26381;&#21153;&#20195;&#30721;&#20998;&#31867;&#31995;&#32479;&#30340;&#26041;&#27861;&#65292;&#21516;&#26102;&#20063;&#30830;&#20445;&#20102;&#37329;&#34701;&#39046;&#22495;&#20869;&#30340;&#39640;&#31934;&#24230;&#32467;&#26524;&#12290;&#32463;&#36807;&#35780;&#20272;&#65292;&#22312;&#36229;&#36807;20,000&#23478;&#20844;&#21496;&#30340;&#25968;&#25454;&#38598;&#19978;&#23454;&#29616;&#20102;&#36229;&#36807;92%&#30340;&#20998;&#31867;&#31934;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30830;&#23450;&#20844;&#21496;&#30340;&#34892;&#19994;&#21644;&#20135;&#21697;/&#26381;&#21153;&#20195;&#30721;&#26159;&#19968;&#39033;&#37325;&#35201;&#30340;&#23454;&#38469;&#20219;&#21153;&#65292;&#36890;&#24120;&#36153;&#29992;&#24456;&#39640;&#65292;&#22240;&#20026;&#23427;&#28041;&#21450;&#23545;&#20844;&#21496;&#25968;&#25454;&#30340;&#25163;&#21160;&#25972;&#29702;&#12290;&#26500;&#24314;&#19968;&#20010;&#21487;&#20197;&#33258;&#21160;&#39044;&#27979;&#36825;&#20123;&#20195;&#30721;&#30340;&#20154;&#24037;&#26234;&#33021;&#20195;&#29702;&#21487;&#20197;&#26174;&#33879;&#24110;&#21161;&#20943;&#23569;&#25104;&#26412;&#65292;&#24182;&#28040;&#38500;&#20154;&#31867;&#20559;&#35265;&#21644;&#38169;&#35823;&#12290;&#28982;&#32780;&#65292;&#26631;&#35760;&#25968;&#25454;&#38598;&#30340;&#19981;&#21487;&#29992;&#24615;&#20197;&#21450;&#22312;&#37329;&#34701;&#39046;&#22495;&#20869;&#38656;&#35201;&#39640;&#31934;&#24230;&#32467;&#26524;&#20351;&#24471;&#36825;&#26159;&#19968;&#20010;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#38382;&#39064;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20998;&#23618;&#30340;&#22810;&#31867;&#34892;&#19994;&#20195;&#30721;&#20998;&#31867;&#22120;&#65292;&#20854;&#20013;&#21253;&#25324;&#19968;&#20010;&#38024;&#23545;&#22810;&#26631;&#31614;&#20135;&#21697;/&#26381;&#21153;&#20195;&#30721;&#20998;&#31867;&#22120;&#65292;&#21033;&#29992;&#20102;&#26080;&#30417;&#30563;&#34920;&#31034;&#23398;&#20064;&#25216;&#26415;&#30340;&#36827;&#23637;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#20351;&#29992;&#26497;&#23569;&#37327;&#30340;&#26631;&#35760;&#25968;&#25454;&#38598;&#26500;&#24314;&#39640;&#36136;&#37327;&#30340;&#34892;&#19994;&#21644;&#20135;&#21697;/&#26381;&#21153;&#20195;&#30721;&#20998;&#31867;&#31995;&#32479;&#12290;&#25105;&#20204;&#22312;&#36229;&#36807;20,000&#23478;&#20844;&#21496;&#30340;&#25968;&#25454;&#38598;&#19978;&#35780;&#20272;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#24182;&#21462;&#24471;&#20102;&#36229;&#36807;92&#65285;&#30340;&#20998;&#31867;&#31934;&#24230;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#27604;&#36739;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;...
&lt;/p&gt;
&lt;p&gt;
Determining industry and product/service codes for a company is an important real-world task and is typically very expensive as it involves manual curation of data about the companies. Building an AI agent that can predict these codes automatically can significantly help reduce costs, and eliminate human biases and errors. However, unavailability of labeled datasets as well as the need for high precision results within the financial domain makes this a challenging problem. In this work, we propose a hierarchical multi-class industry code classifier with a targeted multi-label product/service code classifier leveraging advances in unsupervised representation learning techniques. We demonstrate how a high quality industry and product/service code classification system can be built using extremely limited labeled dataset. We evaluate our approach on a dataset of more than 20,000 companies and achieved a classification accuracy of more than 92\%. Additionally, we also compared our approach
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31867;&#21463;&#24322;&#26041;&#24046;&#22122;&#22768;&#25200;&#21160;&#30340;&#21333;&#23792;&#24179;&#28369;&#26144;&#23556;&#30340;&#25968;&#23398;&#24615;&#36136;&#65292;&#24182;&#24212;&#29992;&#20110;&#37329;&#34701;&#31995;&#32479;&#20013;&#30340;&#31995;&#32479;&#24615;&#39118;&#38505;&#21644;&#26464;&#26438;&#21608;&#26399;&#37329;&#34701;&#27010;&#24565;&#12290;&#36890;&#36807;&#39532;&#23572;&#21487;&#22827;&#38142;&#36827;&#34892;&#20998;&#26512;&#65292;&#24471;&#20986;&#20102;&#20013;&#24515;&#26497;&#38480;&#23450;&#29702;&#65292;&#22823;&#20559;&#24046;&#21407;&#29702;&#21644;Berry-Ess \ 'een&#19981;&#31561;&#24335;&#65292;&#35777;&#26126;&#20102;Gumbel&#23450;&#24459;&#31561;&#32467;&#35770;&#12290;</title><link>http://arxiv.org/abs/2305.13475</link><description>&lt;p&gt;
&#21463;&#24322;&#26041;&#24046;&#22122;&#22768;&#25200;&#21160;&#30340;&#21333;&#23792;&#26144;&#23556;&#65306;&#23545;&#37329;&#34701;&#31995;&#32479;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Unimodal maps perturbed by heteroscedastic noise: an application to a financial systems. (arXiv:2305.13475v1 [math.DS])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.13475
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31867;&#21463;&#24322;&#26041;&#24046;&#22122;&#22768;&#25200;&#21160;&#30340;&#21333;&#23792;&#24179;&#28369;&#26144;&#23556;&#30340;&#25968;&#23398;&#24615;&#36136;&#65292;&#24182;&#24212;&#29992;&#20110;&#37329;&#34701;&#31995;&#32479;&#20013;&#30340;&#31995;&#32479;&#24615;&#39118;&#38505;&#21644;&#26464;&#26438;&#21608;&#26399;&#37329;&#34701;&#27010;&#24565;&#12290;&#36890;&#36807;&#39532;&#23572;&#21487;&#22827;&#38142;&#36827;&#34892;&#20998;&#26512;&#65292;&#24471;&#20986;&#20102;&#20013;&#24515;&#26497;&#38480;&#23450;&#29702;&#65292;&#22823;&#20559;&#24046;&#21407;&#29702;&#21644;Berry-Ess \ 'een&#19981;&#31561;&#24335;&#65292;&#35777;&#26126;&#20102;Gumbel&#23450;&#24459;&#31561;&#32467;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#24182;&#35777;&#26126;&#20102;&#19968;&#31867;&#21463;&#24322;&#26041;&#24046;&#22122;&#22768;&#25200;&#21160;&#30340;&#21333;&#23792;&#24179;&#28369;&#26144;&#23556;&#30340;&#25968;&#23398;&#24615;&#36136;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#30456;&#20851;&#39532;&#23572;&#21487;&#22827;&#38142;&#30340;&#31283;&#23450;&#24615;&#65292;&#35777;&#26126;&#20102;&#21807;&#19968;&#31283;&#24577;&#27979;&#24230;&#24369;&#25910;&#25947;&#21040;&#26144;&#23556;&#30340;&#19981;&#21464;&#27979;&#24230;&#65292;&#24182;&#35777;&#26126;&#20102;&#24179;&#22343;&#26446;&#38597;&#26222;&#35834;&#22827;&#25351;&#25968;&#36830;&#32493;&#20381;&#36182;&#20110;&#39532;&#23572;&#21487;&#22827;&#38142;&#21442;&#25968;&#12290;&#36890;&#36807;&#29992;&#38543;&#26426;&#21464;&#25442;&#34920;&#31034;&#39532;&#23572;&#21487;&#22827;&#38142;&#65292;&#25105;&#20204;&#33021;&#22815;&#38472;&#36848;&#21644;&#35777;&#26126;&#20013;&#24515;&#26497;&#38480;&#23450;&#29702;&#65292;&#22823;&#20559;&#24046;&#21407;&#29702;&#21644;Berry-Ess \ 'een&#19981;&#31561;&#24335;&#12290;&#25105;&#20204;&#20026;&#19981;&#21464;&#21644;&#31283;&#24577;&#27979;&#24230;&#36827;&#34892;&#22810;&#37325;&#20998;&#24418;&#20998;&#26512;&#65292;&#24182;&#35777;&#26126;&#20102;&#26497;&#20540;&#25351;&#25968;&#31561;&#20110;1&#30340;&#39532;&#23572;&#21487;&#22827;&#38142;&#30340;Gumbel&#23450;&#24459;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#19982;&#31995;&#32479;&#24615;&#39118;&#38505;&#21644;&#26464;&#26438;&#21608;&#26399;&#37329;&#34701;&#27010;&#24565;&#30456;&#20851;&#30340;&#31034;&#20363;&#65292;&#24182;&#20351;&#29992;&#35813;&#27169;&#22411;&#30740;&#31350;&#20102;&#25105;&#20204;&#28176;&#36817;&#32467;&#26524;&#30340;&#26377;&#38480;&#26679;&#26412;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate and prove the mathematical properties of a general class of one-dimensional unimodal smooth maps perturbed with a heteroscedastic noise. Specifically, we investigate the stability of the associated Markov chain, show the weak convergence of the unique stationary measure to the invariant measure of the map, and show that the average Lyapunov exponent depends continuously on the Markov chain parameters. Representing the Markov chain in terms of random transformation enables us to state and prove the Central Limit Theorem, the large deviation principle, and the Berry-Ess\`een inequality. We perform a multifractal analysis for the invariant and the stationary measures, and we prove Gumbel's law for the Markov chain with an extreme index equal to 1. In addition, we present an example linked to the financial concept of systemic risk and leverage cycle, and we use the model to investigate the finite sample properties of our asymptotic results.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;E-&#20540;&#21644;E-&#36807;&#31243;&#25216;&#26415;&#30340;ES&#39044;&#27979;&#26080;&#27169;&#22411;&#22238;&#27979;&#31243;&#24207;&#65292;&#21487;&#20197;&#33258;&#28982;&#22320;&#24212;&#29992;&#20110;&#35768;&#22810;&#20854;&#20182;&#39118;&#38505;&#24230;&#37327;&#21644;&#32479;&#35745;&#37327;&#12290;</title><link>http://arxiv.org/abs/2209.00991</link><description>&lt;p&gt;
E-backtesting&#8212;&#8212;&#19968;&#31181;ES&#39044;&#27979;&#30340;&#26080;&#27169;&#22411;&#22238;&#27979;&#31243;&#24207;
&lt;/p&gt;
&lt;p&gt;
E-backtesting. (arXiv:2209.00991v2 [q-fin.RM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.00991
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;E-&#20540;&#21644;E-&#36807;&#31243;&#25216;&#26415;&#30340;ES&#39044;&#27979;&#26080;&#27169;&#22411;&#22238;&#27979;&#31243;&#24207;&#65292;&#21487;&#20197;&#33258;&#28982;&#22320;&#24212;&#29992;&#20110;&#35768;&#22810;&#20854;&#20182;&#39118;&#38505;&#24230;&#37327;&#21644;&#32479;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26368;&#36817;&#30340;&#24052;&#22622;&#23572;&#21327;&#35758;&#20013;&#65292;&#39044;&#26399;&#25439;&#22833;&#65288;ES&#65289;&#21462;&#20195;&#20102;&#20215;&#20540;&#25439;&#22833;&#65288;VaR&#65289;&#25104;&#20026;&#38134;&#34892;&#19994;&#24066;&#22330;&#39118;&#38505;&#30340;&#26631;&#20934;&#39118;&#38505;&#24230;&#37327;&#65292;&#20351;&#23427;&#25104;&#20026;&#37329;&#34701;&#30417;&#31649;&#20013;&#26368;&#37325;&#35201;&#30340;&#39118;&#38505;&#24230;&#37327;&#12290;&#39118;&#38505;&#24314;&#27169;&#23454;&#36341;&#20013;&#26368;&#20855;&#25361;&#25112;&#24615;&#30340;&#20219;&#21153;&#20043;&#19968;&#26159;&#22238;&#27979;&#37329;&#34701;&#26426;&#26500;&#25552;&#20379;&#30340;ES&#39044;&#27979;&#12290;&#20026;&#20102;&#35774;&#35745;&#19968;&#31181;ES&#30340;&#26080;&#27169;&#22411;&#22238;&#27979;&#31243;&#24207;&#65292;&#25105;&#20204;&#21033;&#29992;&#20102;&#26368;&#36817;&#21457;&#23637;&#30340;E-&#20540;&#21644;E-&#36807;&#31243;&#25216;&#26415;&#12290;&#24341;&#20837;&#20102;&#26080;&#27169;&#22411;E-&#32479;&#35745;&#37327;&#26469;&#21046;&#23450;&#39118;&#38505;&#24230;&#37327;&#39044;&#27979;&#30340;E-&#36807;&#31243;&#65292;&#24182;&#21033;&#29992;&#37492;&#21035;&#20989;&#25968;&#30340;&#26368;&#26032;&#32467;&#26524;&#20026;VaR&#21644;ES&#30340;&#26080;&#27169;&#22411;E-&#32479;&#35745;&#37327;&#30830;&#23450;&#20102;&#29420;&#29305;&#30340;&#24418;&#24335;&#12290;&#23545;&#20110;&#32473;&#23450;&#30340;&#26080;&#27169;&#22411;E-&#32479;&#35745;&#37327;&#65292;&#30740;&#31350;&#20102;&#26500;&#24314;E-&#36807;&#31243;&#30340;&#26368;&#20248;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#33258;&#28982;&#22320;&#24212;&#29992;&#20110;&#35768;&#22810;&#20854;&#20182;&#39118;&#38505;&#24230;&#37327;&#21644;&#32479;&#35745;&#37327;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#22823;&#37327;&#30340;&#27169;&#25311;&#30740;&#31350;&#21644;&#25968;&#25454;&#20998;&#26512;&#65292;&#20197;&#35828;&#26126;&#26080;&#27169;&#22411;&#26041;&#27861;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the recent Basel Accords, the Expected Shortfall (ES) replaces the Value-at-Risk (VaR) as the standard risk measure for market risk in the banking sector, making it the most important risk measure in financial regulation. One of the most challenging tasks in risk modeling practice is to backtest ES forecasts provided by financial institutions. To design a model-free backtesting procedure for ES, we make use of the recently developed techniques of e-values and e-processes. Model-free e-statistics are introduced to formulate e-processes for risk measure forecasts, and unique forms of model-free e-statistics for VaR and ES are characterized using recent results on identification functions. For a given model-free e-statistic, optimal ways of constructing the e-processes are studied. The proposed method can be naturally applied to many other risk measures and statistical quantities. We conduct extensive simulation studies and data analysis to illustrate the advantages of the model-free b
&lt;/p&gt;</description></item></channel></rss>