<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#39034;&#24207;&#25293;&#21334;&#26426;&#21046;&#30340;&#32463;&#27982;DAO&#27835;&#29702;&#26032;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;DAO&#38754;&#20020;&#30340;&#25511;&#21046;&#38382;&#39064;&#65292;&#26082;&#36991;&#20813;&#20102;&#20844;&#20849;&#36873;&#25321;&#38382;&#39064;&#65292;&#21448;&#33021;&#20419;&#36827;&#20215;&#20540;&#22686;&#38271;&#21644;&#25237;&#36164;&#12290;</title><link>https://arxiv.org/abs/2403.16980</link><description>&lt;p&gt;
&#32463;&#27982;DAO&#27835;&#29702;&#65306;&#19968;&#31181;&#21487;&#20105;&#22842;&#25511;&#21046;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Economic DAO Governance: A Contestable Control Approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16980
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#39034;&#24207;&#25293;&#21334;&#26426;&#21046;&#30340;&#32463;&#27982;DAO&#27835;&#29702;&#26032;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;DAO&#38754;&#20020;&#30340;&#25511;&#21046;&#38382;&#39064;&#65292;&#26082;&#36991;&#20813;&#20102;&#20844;&#20849;&#36873;&#25321;&#38382;&#39064;&#65292;&#21448;&#33021;&#20419;&#36827;&#20215;&#20540;&#22686;&#38271;&#21644;&#25237;&#36164;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#24418;&#24335;&#30340;DAO&#27835;&#29702;&#65292;&#21033;&#29992;&#39034;&#24207;&#25293;&#21334;&#26426;&#21046;&#26469;&#20811;&#26381;DAO&#20986;&#29616;&#30340;&#26681;&#28145;&#33922;&#22266;&#30340;&#25511;&#21046;&#38382;&#39064;&#65292;&#36890;&#36807;&#21019;&#24314;&#19968;&#20010;&#20020;&#26102;&#21487;&#20105;&#22842;&#25511;&#21046;&#30340;&#21046;&#24230;&#12290;&#36825;&#31181;&#26426;&#21046;&#36991;&#20813;&#20102;&#25237;&#31080;&#26041;&#27861;&#22266;&#26377;&#30340;&#28508;&#22312;&#20844;&#20849;&#36873;&#25321;&#38382;&#39064;&#65292;&#21516;&#26102;&#25552;&#20379;&#20102;&#19968;&#20010;&#21487;&#20197;&#22686;&#24378;&#21644;&#30830;&#20445;DAO&#25237;&#31080;&#21644;&#20854;&#20182;DAO&#38750;&#24066;&#22330;&#27835;&#29702;&#31243;&#24207;&#22266;&#26377;&#20215;&#20540;&#30340;&#24037;&#20855;&#12290;&#23427;&#23545;&#31354;&#22836;&#25237;&#31080;&#20855;&#26377;&#40065;&#26834;&#24615;&#65292;&#19988;&#20195;&#30721;&#21487;&#34892;&#12290;&#23427;&#20419;&#36827;&#20102;DAO&#22312;&#38754;&#23545;&#19981;&#21516;&#30417;&#31649;&#26041;&#27861;&#26102;&#23454;&#29616;&#20854;&#35268;&#33539;&#21644;&#36816;&#33829;&#30446;&#26631;&#30340;&#33021;&#21147;&#12290;&#35774;&#35745;&#26159;&#23558;&#25511;&#21046;&#26435;&#36716;&#31227;&#32473;&#25317;&#26377;&#26368;&#26377;&#21069;&#36884;&#21830;&#19994;&#35745;&#21010;&#30340;&#19968;&#26041;&#65292;&#21516;&#26102;&#20197;&#19968;&#31181;&#26377;&#21033;&#20110;&#20419;&#36827;&#20854;&#20182;&#26041;&#25237;&#36164;&#30340;&#26041;&#24335;&#20998;&#37197;&#21097;&#20313;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16980v1 Announce Type: cross  Abstract: In this article, we propose a new form of DAO governance that uses a sequential auction mechanism to overcome entrenched control issues that have emerged for DAOs by creating a regime of temporary contestable control. The mechanism avoids potential public choice problems inherent in voting approaches but at the same time provides a vehicle that can enhance and secure value than inheres to DAO voting and other DAO non-market governance procedures. It is robust to empty voting and is code feasible. It facilitates the ability of DAOs to meet their normative and operational goals in the face of diverse regulatory approaches. Designed to shift control to the party with the most promising business plan, at the same time it distributes surplus in a way that tends to promote investment by other parties.
&lt;/p&gt;</description></item><item><title>&#24052;&#35199;&#22996;&#20869;&#29790;&#25289;&#38590;&#27665;&#21361;&#26426;&#23545;&#32599;&#36182;&#39532;&#24030;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#24433;&#21709;&#34920;&#26126;&#65292;&#34429;&#28982;&#24052;&#35199;&#20154;&#30340;&#26376;&#24037;&#36164;&#22686;&#21152;&#32422;2&#65285;&#65292;&#20294;&#20027;&#35201;&#21463;&#26080;&#38590;&#27665;&#21442;&#19982;&#30340;&#37096;&#38376;&#21644;&#32844;&#19994;&#24433;&#21709;&#65292;&#21516;&#26102;&#38750;&#27491;&#35268;&#24066;&#22330;&#20013;&#30340;&#31227;&#27665;&#25269;&#28040;&#20102;&#27491;&#35268;&#24066;&#22330;&#30340;&#26367;&#20195;&#25928;&#24212;&#12290;</title><link>https://arxiv.org/abs/2302.04201</link><description>&lt;p&gt;
&#24052;&#35199;&#22996;&#20869;&#29790;&#25289;&#38590;&#27665;&#21361;&#26426;&#23545;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Labor Market Effects of the Venezuelan Refugee Crisis in Brazil
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2302.04201
&lt;/p&gt;
&lt;p&gt;
&#24052;&#35199;&#22996;&#20869;&#29790;&#25289;&#38590;&#27665;&#21361;&#26426;&#23545;&#32599;&#36182;&#39532;&#24030;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#24433;&#21709;&#34920;&#26126;&#65292;&#34429;&#28982;&#24052;&#35199;&#20154;&#30340;&#26376;&#24037;&#36164;&#22686;&#21152;&#32422;2&#65285;&#65292;&#20294;&#20027;&#35201;&#21463;&#26080;&#38590;&#27665;&#21442;&#19982;&#30340;&#37096;&#38376;&#21644;&#32844;&#19994;&#24433;&#21709;&#65292;&#21516;&#26102;&#38750;&#27491;&#35268;&#24066;&#22330;&#20013;&#30340;&#31227;&#27665;&#25269;&#28040;&#20102;&#27491;&#35268;&#24066;&#22330;&#30340;&#26367;&#20195;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#21033;&#29992;&#24052;&#35199;&#27491;&#24335;&#24037;&#20154;&#26222;&#36941;&#20351;&#29992;&#30340;&#34892;&#25919;&#38754;&#26495;&#25968;&#25454;&#65292;&#30740;&#31350;&#20102;&#22996;&#20869;&#29790;&#25289;&#21361;&#26426;&#23545;&#24052;&#35199;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#24433;&#21709;&#65292;&#37325;&#28857;&#20851;&#27880;&#36793;&#22659;&#24030;&#32599;&#36182;&#39532;&#12290;&#24046;&#24322;&#22788;&#29702;&#32467;&#26524;&#34920;&#26126;&#65292;&#32599;&#36182;&#39532;&#24030;&#30340;&#24052;&#35199;&#20154;&#26376;&#24037;&#36164;&#22686;&#38271;&#20102;&#32422;2&#65285;&#65292;&#20027;&#35201;&#26159;&#30001;&#37027;&#20123;&#20174;&#20107;&#27809;&#26377;&#38590;&#27665;&#21442;&#19982;&#30340;&#37096;&#38376;&#21644;&#32844;&#19994;&#30340;&#20154;&#39537;&#21160;&#30340;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#24052;&#35199;&#20154;&#20960;&#20046;&#27809;&#26377;&#22833;&#19994;&#65292;&#20294;&#21457;&#29616;&#26412;&#22320;&#24037;&#20154;&#36716;&#31227;&#21040;&#27809;&#26377;&#31227;&#27665;&#30340;&#32844;&#19994;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#38750;&#27491;&#35268;&#24066;&#22330;&#20013;&#30340;&#31227;&#27665;&#25269;&#28040;&#20102;&#27491;&#35268;&#24066;&#22330;&#20013;&#30340;&#26367;&#20195;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2302.04201v2 Announce Type: replace  Abstract: We use administrative panel data on the universe of Brazilian formal workers to investigate the labor market effects of the Venezuelan crisis in Brazil, focusing on the border state of Roraima. The results using difference-in-differences show that the monthly wages of Brazilians in Roraima increased by around 2 percent, which was mostly driven by those working in sectors and occupations with no refugee involvement. The study finds negligible job displacement for Brazilians but finds evidence of native workers moving to occupations without immigrants. We also find that immigrants in the informal market offset the substitution effects in the formal market.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20102;&#30005;&#21160;&#20844;&#36335;&#31995;&#32479;&#21644;&#30005;&#27744;&#30005;&#21160;&#36710;&#30340;&#26367;&#20195;&#26041;&#26696;&#23545;&#20110;&#30005;&#21147;&#37096;&#38376;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#21487;&#28789;&#27963;&#20805;&#30005;&#30340;&#36710;&#36742;&#20849;&#20139;BEV&#30340;&#30005;&#21147;&#37096;&#38376;&#25104;&#26412;&#26368;&#20302;&#65292;&#32780;&#20351;&#29992;&#30005;&#21147;&#29123;&#26009;&#30340;&#37325;&#22411;&#36710;&#36742;&#30340;&#25104;&#26412;&#26368;&#39640;&#12290;</title><link>http://arxiv.org/abs/2303.16629</link><description>&lt;p&gt;
&#37325;&#22411;&#36710;&#36742;&#30005;&#27668;&#21270;&#30340;&#26367;&#20195;&#26041;&#26696;&#30340;&#30005;&#21147;&#37096;&#38376;&#24433;&#21709;:&#30005;&#27668;&#21270;&#21644;&#26234;&#33021;&#20805;&#30005;
&lt;/p&gt;
&lt;p&gt;
Power sector effects of alternative options for electrifying heavy-duty vehicles: go electric, and charge smartly. (arXiv:2303.16629v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.16629
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#30005;&#21160;&#20844;&#36335;&#31995;&#32479;&#21644;&#30005;&#27744;&#30005;&#21160;&#36710;&#30340;&#26367;&#20195;&#26041;&#26696;&#23545;&#20110;&#30005;&#21147;&#37096;&#38376;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#21487;&#28789;&#27963;&#20805;&#30005;&#30340;&#36710;&#36742;&#20849;&#20139;BEV&#30340;&#30005;&#21147;&#37096;&#38376;&#25104;&#26412;&#26368;&#20302;&#65292;&#32780;&#20351;&#29992;&#30005;&#21147;&#29123;&#26009;&#30340;&#37325;&#22411;&#36710;&#36742;&#30340;&#25104;&#26412;&#26368;&#39640;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20056;&#29992;&#36710;&#39046;&#22495;&#65292;&#30005;&#27744;&#30005;&#21160;&#36710;(BEV)&#24050;&#25104;&#20026;&#21435;&#30899;&#21270;&#20132;&#36890;&#30340;&#26368;&#26377;&#21069;&#36884;&#30340;&#36873;&#25321;&#12290;&#23545;&#20110;&#37325;&#22411;&#36710;&#36742;(HDV)&#65292;&#25216;&#26415;&#39046;&#22495;&#20284;&#20046;&#26356;&#20026;&#24320;&#25918;&#12290;&#38500;&#20102;BEV&#22806;&#65292;&#36824;&#35752;&#35770;&#20102;&#29992;&#20110;&#21160;&#24577;&#20379;&#30005;&#30340;&#30005;&#21160;&#20844;&#36335;&#31995;&#32479;(ERS)&#65292;&#20197;&#21450;&#20351;&#29992;&#27682;&#29123;&#26009;&#30005;&#27744;&#25110;&#30005;&#21147;&#29123;&#26009;&#30340;&#21345;&#36710;&#38388;&#25509;&#30005;&#27668;&#21270;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#36825;&#20123;&#26367;&#20195;&#26041;&#26696;&#30340;&#30005;&#21147;&#37096;&#38376;&#24433;&#21709;&#12290;&#25105;&#20204;&#23558;&#22522;&#20110;&#26410;&#26469;&#24503;&#22269;&#39640;&#21487;&#20877;&#29983;&#33021;&#28304;&#20221;&#39069;&#30340;&#24773;&#26223;&#65292;&#24212;&#29992;&#19968;&#20010;&#24320;&#28304;&#30340;&#23481;&#37327;&#25193;&#23637;&#27169;&#22411;&#65292;&#21033;&#29992;&#35814;&#32454;&#30340;&#20197;&#36335;&#32447;&#20026;&#22522;&#30784;&#30340;&#21345;&#36710;&#20132;&#36890;&#25968;&#25454;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#21487;&#28789;&#27963;&#20805;&#30005;&#30340;&#36710;&#36742;&#20849;&#20139;BEV&#30340;&#30005;&#21147;&#37096;&#38376;&#25104;&#26412;&#26368;&#20302;&#65292;&#32780;&#20351;&#29992;&#30005;&#21147;&#29123;&#26009;&#30340;&#37325;&#22411;&#36710;&#36742;&#30340;&#25104;&#26412;&#26368;&#39640;&#12290;&#22914;&#26524;BEV&#21644;ERS-BEV&#27809;&#26377;&#20197;&#20248;&#21270;&#30340;&#26041;&#24335;&#20805;&#30005;&#65292;&#30005;&#21147;&#37096;&#38376;&#25104;&#26412;&#20250;&#22686;&#21152;&#65292;&#20294;&#20173;&#36828;&#20302;&#20110;&#20351;&#29992;&#27682;&#25110;&#30005;&#21147;&#29123;&#26009;&#30340;&#24773;&#26223;&#12290;&#36825;&#26159;&#30456;&#23545;&#36739;&#23567;&#30005;&#27744;&#12289;&#39640;&#24230;&#28789;&#27963;&#30340;BEV&#22312;&#30701;&#36884;&#21644;&#20013;&#36884;&#27493;&#39588;&#36716;&#31227;&#21644;&#36229;&#20986;&#36947;&#36335;&#24191;&#27867;&#20351;&#29992;&#30340;&#20248;&#21183;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the passenger car segment, battery-electric vehicles (BEV) have emerged as the most promising option to decarbonize transportation. For heavy-duty vehicles (HDV), the technology space still appears to be more open. Aside from BEV, electric road systems (ERS) for dynamic power transfer are discussed, as well as indirect electrification with trucks that use hydrogen fuel cells or e-fuels. Here we investigate the power sector implications of these alternative options. We apply an open-source capacity expansion model to future scenarios of Germany with high renewable energy shares, drawing on detailed route-based truck traffic data. Results show that power sector costs are lowest for flexibly charged BEV that also carry out vehicle-to-grid operations, and highest for HDV using e-fuels. If BEV and ERS-BEV are not charged in an optimized way, power sector costs increase, but are still substantially lower than in scenarios with hydrogen or e-fuels. This is a consequence of the relatively p
&lt;/p&gt;</description></item></channel></rss>