<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#37096;&#20998;&#24459;&#27861;&#19981;&#21464;&#24615;&#30340;&#27010;&#24565;&#65292;&#36890;&#36807;&#21051;&#30011;&#37096;&#20998;&#24459;&#27861;&#19981;&#21464;&#30340;&#19968;&#33268;&#39118;&#38505;&#24230;&#37327;&#30340;&#34920;&#31034;&#20844;&#24335;&#65292;&#23558;&#20915;&#31574;&#29702;&#35770;&#21644;&#37329;&#34701;&#39118;&#38505;&#31649;&#29702;&#30340;&#25991;&#29486;&#32852;&#31995;&#36215;&#26469;&#65292;&#25552;&#20986;&#20102;&#26032;&#30340;&#39118;&#38505;&#24230;&#37327;&#65292;&#24182;&#22312;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#30340;&#39118;&#38505;&#35780;&#20272;&#20013;&#23637;&#31034;&#20102;&#20854;&#24212;&#29992;&#12290;</title><link>http://arxiv.org/abs/2401.17265</link><description>&lt;p&gt;
&#37096;&#20998;&#24459;&#27861;&#19981;&#21464;&#39118;&#38505;&#24230;&#37327;
&lt;/p&gt;
&lt;p&gt;
Partially Law-Invariant Risk Measures. (arXiv:2401.17265v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.17265
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#37096;&#20998;&#24459;&#27861;&#19981;&#21464;&#24615;&#30340;&#27010;&#24565;&#65292;&#36890;&#36807;&#21051;&#30011;&#37096;&#20998;&#24459;&#27861;&#19981;&#21464;&#30340;&#19968;&#33268;&#39118;&#38505;&#24230;&#37327;&#30340;&#34920;&#31034;&#20844;&#24335;&#65292;&#23558;&#20915;&#31574;&#29702;&#35770;&#21644;&#37329;&#34701;&#39118;&#38505;&#31649;&#29702;&#30340;&#25991;&#29486;&#32852;&#31995;&#36215;&#26469;&#65292;&#25552;&#20986;&#20102;&#26032;&#30340;&#39118;&#38505;&#24230;&#37327;&#65292;&#24182;&#22312;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#30340;&#39118;&#38505;&#35780;&#20272;&#20013;&#23637;&#31034;&#20102;&#20854;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#37096;&#20998;&#24459;&#27861;&#19981;&#21464;&#24615;&#30340;&#27010;&#24565;&#65292;&#25512;&#24191;&#20102;&#32479;&#35745;&#21644;&#37329;&#34701;&#24212;&#29992;&#20013;&#24191;&#27867;&#20351;&#29992;&#30340;&#24459;&#27861;&#19981;&#21464;&#39118;&#38505;&#24230;&#37327;&#30340;&#27010;&#24565;&#12290;&#36825;&#20010;&#26032;&#27010;&#24565;&#26159;&#30001;&#20915;&#31574;&#29702;&#35770;&#21644;&#37329;&#34701;&#39118;&#38505;&#31649;&#29702;&#30340;&#23454;&#38469;&#32771;&#34385;&#25152;&#28608;&#21457;&#30340;&#65292;&#20174;&#32780;&#36830;&#25509;&#20102;&#20915;&#31574;&#29702;&#35770;&#21644;&#37329;&#34701;&#39118;&#38505;&#31649;&#29702;&#30340;&#25991;&#29486;&#12290;&#25105;&#20204;&#36890;&#36807;&#19968;&#31181;&#26032;&#39062;&#30340;&#34920;&#31034;&#20844;&#24335;&#20805;&#20998;&#22320;&#21051;&#30011;&#20102;&#37096;&#20998;&#24459;&#27861;&#19981;&#21464;&#30340;&#19968;&#33268;&#39118;&#38505;&#24230;&#37327;&#65292;&#36825;&#20010;&#34920;&#31034;&#20844;&#24335;&#19982;&#24459;&#27861;&#19981;&#21464;&#30340;&#19968;&#33268;&#39118;&#38505;&#24230;&#37327;&#30340;&#32463;&#20856;&#20844;&#24335;&#20960;&#20046;&#27809;&#26377;&#30456;&#20284;&#20043;&#22788;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#24378;&#37096;&#20998;&#24459;&#27861;&#19981;&#21464;&#24615;&#30340;&#27010;&#24565;&#65292;&#20174;&#32780;&#21487;&#20197;&#24471;&#21040;&#19982;&#32463;&#20856;&#20844;&#24335;&#31867;&#20284;&#30340;&#34920;&#31034;&#20844;&#24335;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20960;&#31867;&#26032;&#30340;&#39118;&#38505;&#24230;&#37327;&#65292;&#21253;&#25324;&#39044;&#26399;&#25439;&#22833;&#21644;&#29109;&#39118;&#38505;&#24230;&#37327;&#30340;&#37096;&#20998;&#24459;&#27861;&#19981;&#21464;&#29256;&#26412;&#65292;&#24182;&#19988;&#23637;&#31034;&#20102;&#23427;&#20204;&#22312;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#30340;&#39118;&#38505;&#35780;&#20272;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce the concept of partial law invariance, generalizing the concept of law-invariant risk measures widely used in statistical and financial applications. This new concept is motivated by practical considerations of decision-making under uncertainty, thus connecting the literature on decision theory and that on financial risk management. We fully characterize partially law-invariant coherent risk measures via a novel representation formula, which, surprisingly, has little resemblance to the classical formula for law-invariant coherent risk measures. A notion of strong partial law invariance is introduced, allowing for a representation formula akin to the classical one. We propose a few classes of new risk measures, including partially law-invariant versions of the Expected Shortfall and the entropic risk measures, and illustrate their applications in risk assessment under model uncertainty.
&lt;/p&gt;</description></item></channel></rss>