<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#22522;&#20110;&#36229;&#27169;&#24615;&#25490;&#24207;&#29305;&#24615;&#65292;&#35813;&#35770;&#25991;&#35777;&#26126;&#20102;&#20449;&#29992;&#25439;&#22833;&#30340;&#20984;&#39118;&#38505;&#27979;&#24230;&#30456;&#23545;&#20110;&#26925;&#22278;&#20998;&#24067;&#28508;&#22312;&#22240;&#32032;&#30340;&#20449;&#29992;-&#20449;&#29992;&#21644;&#20449;&#29992;-&#24066;&#22330;&#21327;&#26041;&#24046;&#26159;&#38750;&#36882;&#20943;&#30340;&#65292;&#36825;&#23545;&#20110;&#35745;&#31639;&#20449;&#29992;&#25320;&#22791;&#12289;&#32463;&#27982;&#36164;&#26412;&#12289;&#21387;&#21147;&#27979;&#35797;&#21644;&#39118;&#38505;&#31649;&#29702;&#20998;&#26512;&#38750;&#24120;&#26377;&#24110;&#21161;&#12290;</title><link>http://arxiv.org/abs/2401.07728</link><description>&lt;p&gt;
&#20449;&#29992;&#25439;&#22833;&#30340;&#26465;&#27454;&#21644;&#32463;&#27982;&#36164;&#26412;
&lt;/p&gt;
&lt;p&gt;
Provisions and Economic Capital for Credit Losses. (arXiv:2401.07728v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.07728
&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#36229;&#27169;&#24615;&#25490;&#24207;&#29305;&#24615;&#65292;&#35813;&#35770;&#25991;&#35777;&#26126;&#20102;&#20449;&#29992;&#25439;&#22833;&#30340;&#20984;&#39118;&#38505;&#27979;&#24230;&#30456;&#23545;&#20110;&#26925;&#22278;&#20998;&#24067;&#28508;&#22312;&#22240;&#32032;&#30340;&#20449;&#29992;-&#20449;&#29992;&#21644;&#20449;&#29992;-&#24066;&#22330;&#21327;&#26041;&#24046;&#26159;&#38750;&#36882;&#20943;&#30340;&#65292;&#36825;&#23545;&#20110;&#35745;&#31639;&#20449;&#29992;&#25320;&#22791;&#12289;&#32463;&#27982;&#36164;&#26412;&#12289;&#21387;&#21147;&#27979;&#35797;&#21644;&#39118;&#38505;&#31649;&#29702;&#20998;&#26512;&#38750;&#24120;&#26377;&#24110;&#21161;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#36229;&#27169;&#24615;&#25490;&#24207;&#29305;&#24615;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20449;&#29992;&#25439;&#22833;&#30340;&#20984;&#39118;&#38505;&#27979;&#24230;&#30456;&#23545;&#20110;&#26925;&#22278;&#20998;&#24067;&#28508;&#22312;&#22240;&#32032;&#30340;&#20449;&#29992;-&#20449;&#29992;&#21644;&#38169;&#35823;&#39118;&#38505;&#35774;&#32622;&#19979;&#30340;&#20449;&#29992;-&#24066;&#22330;&#21327;&#26041;&#24046;&#26159;&#38750;&#36882;&#20943;&#30340;&#12290;&#36825;&#20123;&#32467;&#26524;&#25903;&#25345;&#20351;&#29992;&#36825;&#26679;&#30340;&#35774;&#32622;&#26469;&#35745;&#31639;&#20449;&#29992;&#25320;&#22791;&#21644;&#32463;&#27982;&#36164;&#26412;&#65292;&#36827;&#34892;&#21387;&#21147;&#27979;&#35797;&#21644;&#39118;&#38505;&#31649;&#29702;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
Based on supermodularity ordering properties, we show that convex risk measures of credit losses are nondecreasing w.r.t. credit-credit and, in a wrong-way risk setup, credit-market, covariances of elliptically distributed latent factors. These results support the use of such setups for computing credit provisions and economic capital or for conducting stress test exercises and risk management analysis.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20351;&#29992;&#36335;&#24452;&#31215;&#20998;&#26041;&#27861;&#30740;&#31350;&#20102;Vasicek&#27169;&#22411;&#20013;&#30340;&#38556;&#30861;&#26399;&#26435;&#23450;&#20215;&#38382;&#39064;&#65292;&#36890;&#36807;&#31867;&#27604;&#37327;&#23376;&#29702;&#35770;&#20013;&#30340;&#25955;&#23556;&#38382;&#39064;&#21644;&#26041;&#21183;&#20117;&#38382;&#39064;&#65292;&#23548;&#20986;&#20102;&#23450;&#20215;&#26680;&#21644;&#26399;&#26435;&#20215;&#26684;&#34920;&#36798;&#24335;&#65292;&#24182;&#32473;&#20986;&#20102;&#26631;&#30340;&#36164;&#20135;&#20215;&#26684;&#21464;&#21270;&#23545;&#26399;&#26435;&#20215;&#26684;&#30340;&#25968;&#20540;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2307.07103</link><description>&lt;p&gt;
&#20351;&#29992;&#36335;&#24452;&#31215;&#20998;&#26041;&#27861;&#23545;Vasicek&#27169;&#22411;&#20013;&#30340;&#38556;&#30861;&#26399;&#26435;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
Path Integral Method for Barrier Option Pricing Under Vasicek Model. (arXiv:2307.07103v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.07103
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20351;&#29992;&#36335;&#24452;&#31215;&#20998;&#26041;&#27861;&#30740;&#31350;&#20102;Vasicek&#27169;&#22411;&#20013;&#30340;&#38556;&#30861;&#26399;&#26435;&#23450;&#20215;&#38382;&#39064;&#65292;&#36890;&#36807;&#31867;&#27604;&#37327;&#23376;&#29702;&#35770;&#20013;&#30340;&#25955;&#23556;&#38382;&#39064;&#21644;&#26041;&#21183;&#20117;&#38382;&#39064;&#65292;&#23548;&#20986;&#20102;&#23450;&#20215;&#26680;&#21644;&#26399;&#26435;&#20215;&#26684;&#34920;&#36798;&#24335;&#65292;&#24182;&#32473;&#20986;&#20102;&#26631;&#30340;&#36164;&#20135;&#20215;&#26684;&#21464;&#21270;&#23545;&#26399;&#26435;&#20215;&#26684;&#30340;&#25968;&#20540;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37327;&#23376;&#29702;&#35770;&#20013;&#30340;&#36335;&#24452;&#31215;&#20998;&#26041;&#27861;&#20026;&#38543;&#26102;&#38388;&#21464;&#21270;&#30340;&#26399;&#26435;&#23450;&#20215;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;&#24605;&#36335;&#12290;&#23545;&#20110;&#38556;&#30861;&#26399;&#26435;&#65292;&#26399;&#26435;&#20215;&#26684;&#21464;&#21270;&#36807;&#31243;&#31867;&#20284;&#20110;&#37327;&#23376;&#21147;&#23398;&#20013;&#30340;&#26080;&#31351;&#39640;&#21183;&#22418;&#25955;&#23556;&#38382;&#39064;&#65307;&#23545;&#20110;&#21452;&#38556;&#30861;&#26399;&#26435;&#65292;&#26399;&#26435;&#20215;&#26684;&#21464;&#21270;&#36807;&#31243;&#31867;&#20284;&#20110;&#31890;&#23376;&#22312;&#19968;&#20010;&#26080;&#31351;&#26041;&#21183;&#20117;&#20013;&#36816;&#21160;&#12290;&#21033;&#29992;&#36335;&#24452;&#31215;&#20998;&#26041;&#27861;&#65292;&#21487;&#20197;&#23548;&#20986;Vasicek&#38543;&#26426;&#21033;&#29575;&#27169;&#22411;&#19979;&#30340;&#23450;&#20215;&#26680;&#21644;&#26399;&#26435;&#20215;&#26684;&#34920;&#36798;&#24335;&#12290;&#21516;&#26102;&#36824;&#23637;&#31034;&#20102;&#26399;&#26435;&#20215;&#26684;&#38543;&#26631;&#30340;&#36164;&#20135;&#20215;&#26684;&#21464;&#21270;&#30340;&#25968;&#20540;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
Path integral method in quantum theory provides a new thinking for time dependent option pricing. For barrier options, the option price changing process is similar to the infinite high barrier scattering problem in quantum mechanics; for double barrier options, the option price changing process is analogous to a particle moving in a infinite square potential well. Using path integral method, the expressions of pricing kernel and option price under Vasicek stochastic interest rate model could be derived. Numerical results of options price as functions of underlying prices are also shown.
&lt;/p&gt;</description></item></channel></rss>