<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#27431;&#20803;&#21306;&#19981;&#21516;&#22269;&#23478;&#20013;&#25910;&#20837;&#19982;&#20928;&#36130;&#23500;&#20043;&#38388;&#30340;&#20381;&#36182;&#31243;&#24230;&#21644;&#19981;&#24179;&#31561;&#24615;&#65292;&#24182;&#25506;&#35752;&#20102;&#36135;&#24065;&#25919;&#31574;&#25514;&#26045;&#23545;&#20854;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2304.14264</link><description>&lt;p&gt;
&#36135;&#24065;&#25919;&#31574;&#19982;&#25910;&#20837;&#36130;&#23500;&#32852;&#21512;&#20998;&#24067;&#65306;&#27431;&#20803;&#21306;&#24322;&#36136;&#24615;&#24773;&#20917;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Monetary policy and the joint distribution of income and wealth: The heterogeneous case of the euro area. (arXiv:2304.14264v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.14264
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#27431;&#20803;&#21306;&#19981;&#21516;&#22269;&#23478;&#20013;&#25910;&#20837;&#19982;&#20928;&#36130;&#23500;&#20043;&#38388;&#30340;&#20381;&#36182;&#31243;&#24230;&#21644;&#19981;&#24179;&#31561;&#24615;&#65292;&#24182;&#25506;&#35752;&#20102;&#36135;&#24065;&#25919;&#31574;&#25514;&#26045;&#23545;&#20854;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26088;&#22312;&#30830;&#23450;&#27431;&#20803;&#21306;&#26576;&#20123;&#22269;&#23478;&#20013;&#25910;&#20837;&#12289;&#20928;&#36130;&#23500;&#21450;&#20854;&#32852;&#21512;&#20998;&#24067;&#20043;&#38388;&#30340;&#32463;&#39564;&#20851;&#31995;&#12290;&#20316;&#32773;&#20351;&#29992;&#21322;&#21442;&#25968;&#20272;&#35745;Copula&#26041;&#27861;&#20272;&#31639;&#20102;&#25910;&#20837;&#21644;&#20928;&#36130;&#23500;&#20043;&#38388;&#30340;&#20381;&#36182;&#31243;&#24230;&#24182;&#35745;&#31639;&#20102;&#21452;&#21464;&#37327;&#22522;&#23612;&#31995;&#25968;&#12290;&#36890;&#36807;&#23558;&#26469;&#33258;&#23439;&#35266;&#27700;&#24179;&#21521;&#37327;&#33258;&#22238;&#24402;&#30340;&#32467;&#26500;&#24615;&#25512;&#26029;&#19982;&#20351;&#29992;&#24494;&#35266;&#32463;&#27982;&#25968;&#25454;&#30340;&#27169;&#25311;&#30456;&#32467;&#21512;&#65292;&#20316;&#32773;&#30740;&#31350;&#20102;&#20256;&#32479;&#21644;&#38750;&#20256;&#32479;&#36135;&#24065;&#25919;&#31574;&#25514;&#26045;&#23545;&#32852;&#21512;&#20998;&#24067;&#30340;&#24433;&#21709;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#36135;&#24065;&#25919;&#31574;&#30340;&#24433;&#21709;&#22312;&#19981;&#21516;&#22269;&#23478;&#20043;&#38388;&#39640;&#24230;&#24322;&#36136;&#24615;&#65292;&#22312;&#25910;&#20837;&#21644;&#20928;&#36130;&#23500;&#30340;&#20381;&#36182;&#24615;&#20197;&#21450;&#19981;&#24179;&#31561;&#26041;&#38754;&#37117;&#26159;&#22914;&#27492;&#12290;
&lt;/p&gt;
&lt;p&gt;
This papers aims to establish the empirical relationship between income, net wealth and their joint distribution in a selected group of euro area countries. I estimate measures of dependence between income and net wealth using a semiparametric copula approach and calculate a bivariate Gini coefficient. By combining structural inference from vector autoregressions on the macroeconomic level with a simulation using microeconomic data, I investigate how conventional and unconventional monetary policy measures affect the joint distribution. Results indicate that effects of monetary policy are highly heterogeneous across different countries, both in terms of the dependence of income and net wealth on each other, and in terms of inequality in both income and net wealth.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20174;&#20449;&#24687;&#35770;&#30340;&#35282;&#24230;&#25506;&#35752;&#20102;&#26368;&#20248;&#21327;&#26041;&#24046;&#28165;&#38500;&#29702;&#35770;&#22312;&#37325;&#23614;&#20998;&#24067;&#19979;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2304.14098</link><description>&lt;p&gt;
&#20174;&#20449;&#24687;&#29702;&#35770;&#30340;&#35282;&#24230;&#25506;&#35752;&#37325;&#23614;&#20998;&#24067;&#19979;&#30340;&#26368;&#20248;&#21327;&#26041;&#24046;&#28165;&#38500;
&lt;/p&gt;
&lt;p&gt;
Optimal Covariance Cleaning for Heavy-Tailed Distributions: Insights from Information Theory. (arXiv:2304.14098v1 [cs.IT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.14098
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20174;&#20449;&#24687;&#35770;&#30340;&#35282;&#24230;&#25506;&#35752;&#20102;&#26368;&#20248;&#21327;&#26041;&#24046;&#28165;&#38500;&#29702;&#35770;&#22312;&#37325;&#23614;&#20998;&#24067;&#19979;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26368;&#20248;&#21327;&#26041;&#24046;&#28165;&#38500;&#29702;&#35770;&#20013;&#65292;&#26368;&#23567;&#21270;&#30495;&#23454;&#24635;&#20307;&#21327;&#26041;&#24046;&#30697;&#38453;&#19982;&#26059;&#36716;&#19981;&#21464;&#20272;&#35745;&#37327;&#20043;&#38388;&#30340;Frobenius&#33539;&#25968;&#26159;&#19968;&#20010;&#20851;&#38190;&#27493;&#39588;&#12290;&#21487;&#20197;&#22312;&#22823;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#28176;&#36827;&#24773;&#20917;&#19979;&#33719;&#24471;&#35813;&#20272;&#35745;&#37327;&#65292;&#32780;&#26080;&#38656;&#30693;&#36947;&#30495;&#23454;&#30340;&#21327;&#26041;&#24046;&#30697;&#38453;&#12290;&#26412;&#30740;&#31350;&#35777;&#26126;&#65292;&#23545;&#20110;&#27491;&#24577;&#22810;&#20803;&#21464;&#37327;&#65292;&#36825;&#31181;&#26368;&#23567;&#21270;&#38382;&#39064;&#31561;&#25928;&#20110;&#26368;&#23567;&#21270;&#30495;&#23454;&#24635;&#20307;&#21327;&#26041;&#24046;&#21644;&#26059;&#36716;&#19981;&#21464;&#20272;&#35745;&#37327;&#20043;&#38388;&#30340;&#20449;&#24687;&#25439;&#22833;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#23398;&#29983;t&#20998;&#24067;&#65292;&#22312;&#26377;&#38480;&#22823;&#23567;&#30340;&#30697;&#38453;&#20013;&#65292;&#26368;&#23567;&#21270;Frobenius&#33539;&#25968;&#24182;&#19981;&#19968;&#23450;&#33021;&#26368;&#23567;&#21270;&#20449;&#24687;&#25439;&#22833;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#22312;&#22823;&#30697;&#38453;&#30340;&#28176;&#36817;&#24773;&#20917;&#19979;&#65292;&#36825;&#31181;&#20559;&#24046;&#20250;&#28040;&#22833;&#65292;&#36825;&#21487;&#33021;&#20250;&#23558;&#38543;&#26426;&#30697;&#38453;&#29702;&#35770;&#30340;&#32467;&#26524;&#24212;&#29992;&#20110;&#23398;&#29983;t&#20998;&#24067;&#12290;&#36825;&#20123;&#20998;&#24067;&#20855;&#26377;&#37325;&#23614;&#29305;&#24449;&#65292;&#22312;&#37329;&#34701;&#12289;&#28237;&#27969;&#25110;&#26680;&#29289;&#29702;&#31561;&#23454;&#38469;&#24212;&#29992;&#20013;&#32463;&#24120;&#36935;&#21040;&#12290;
&lt;/p&gt;
&lt;p&gt;
In optimal covariance cleaning theory, minimizing the Frobenius norm between the true population covariance matrix and a rotational invariant estimator is a key step. This estimator can be obtained asymptotically for large covariance matrices, without knowledge of the true covariance matrix. In this study, we demonstrate that this minimization problem is equivalent to minimizing the loss of information between the true population covariance and the rotational invariant estimator for normal multivariate variables. However, for Student's t distributions, the minimal Frobenius norm does not necessarily minimize the information loss in finite-sized matrices. Nevertheless, such deviations vanish in the asymptotic regime of large matrices, which might extend the applicability of random matrix theory results to Student's t distributions. These distributions are characterized by heavy tails and are frequently encountered in real-world applications such as finance, turbulence, or nuclear physic
&lt;/p&gt;</description></item><item><title>STraM&#20026;&#38271;&#26399;&#35268;&#21010;&#25552;&#20379;&#20102;&#26356;&#20855;&#21160;&#24577;&#24615;&#30340;&#22269;&#23478;&#36135;&#36816;&#36816;&#36755;&#24314;&#27169;&#26694;&#26550;&#65292;&#21487;&#20197;&#35780;&#20272;&#25919;&#31574;&#21644;&#25237;&#36164;&#25514;&#26045;&#23545;&#29615;&#22659;&#12289;&#33021;&#28304;&#21644;&#32463;&#27982;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2304.14001</link><description>&lt;p&gt;
STraM: &#19968;&#20010;&#25112;&#30053;&#24615;&#22269;&#23478;&#36135;&#36816;&#36816;&#36755;&#24314;&#27169;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
STraM: a framework for strategic national freight transport modeling. (arXiv:2304.14001v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.14001
&lt;/p&gt;
&lt;p&gt;
STraM&#20026;&#38271;&#26399;&#35268;&#21010;&#25552;&#20379;&#20102;&#26356;&#20855;&#21160;&#24577;&#24615;&#30340;&#22269;&#23478;&#36135;&#36816;&#36816;&#36755;&#24314;&#27169;&#26694;&#26550;&#65292;&#21487;&#20197;&#35780;&#20272;&#25919;&#31574;&#21644;&#25237;&#36164;&#25514;&#26045;&#23545;&#29615;&#22659;&#12289;&#33021;&#28304;&#21644;&#32463;&#27982;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20026;&#20102;&#23454;&#29616;&#20840;&#29699;&#30899;&#25490;&#25918;&#30446;&#26631;&#65292;&#36135;&#36816;&#36816;&#36755;&#37096;&#38376;&#30340;&#33073;&#30899;&#23558;&#26159;&#19968;&#20010;&#37325;&#35201;&#22240;&#32032;&#12290;&#20026;&#27492;&#65292;&#21508;&#22269;&#25919;&#24220;&#24517;&#39035;&#21046;&#23450;&#35745;&#21010;&#20197;&#20419;&#36827;&#36825;&#19968;&#36716;&#21464;&#12290;&#22269;&#23478;&#36135;&#36816;&#36816;&#36755;&#27169;&#22411;&#26159;&#35780;&#20272;&#21508;&#31181;&#25919;&#31574;&#21644;&#25237;&#36164;&#21487;&#33021;&#20135;&#29983;&#30340;&#24433;&#21709;&#30340;&#26377;&#29992;&#24037;&#20855;&#12290;&#29616;&#26377;&#25216;&#26415;&#27700;&#24179;&#21253;&#25324;&#38750;&#24120;&#35814;&#32454;&#30340;&#38745;&#24577;&#27169;&#22411;&#12290;&#34429;&#28982;&#23545;&#20110;&#30701;&#26399;&#25919;&#31574;&#35780;&#20272;&#26377;&#29992;&#65292;&#20294;&#36825;&#20123;&#27169;&#22411;&#19981;&#22826;&#36866;&#21512;&#20026;&#20419;&#36827;&#26410;&#26469;&#25968;&#21313;&#24180;&#30340;&#20302;&#30899;&#20132;&#36890;&#36716;&#22411;&#25152;&#24517;&#38656;&#30340;&#38271;&#26399;&#35268;&#21010;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#36890;&#36807;&#24320;&#21457;&#19968;&#20010;&#21517;&#20026;STraM&#30340;&#25112;&#30053;&#24615;&#22269;&#23478;&#36135;&#36816;&#36816;&#36755;&#24314;&#27169;&#26694;&#26550;&#26469;&#22635;&#34917;&#36825;&#19968;&#24046;&#36317;&#65292;&#20854;&#21487;&#34987;&#25551;&#36848;&#20026;&#22522;&#20110;&#22810;&#27169;&#24335;&#36135;&#36816;&#36816;&#36755;&#20844;&#24335;&#30340;&#22810;&#26399;&#38543;&#26426;&#32593;&#32476;&#35774;&#35745;&#27169;&#22411;&#12290;&#22312;STraM&#20013;&#65292;&#25105;&#20204;&#26126;&#30830;&#21253;&#21547;&#20102;&#20960;&#20010;&#29616;&#26377;&#22269;&#23478;&#36135;&#36816;&#36816;&#36755;&#27169;&#22411;&#32570;&#20047;&#30340;&#26041;&#38754;&#65306;&#36135;&#29289;&#27969;&#30340;&#21160;&#24577;&#24615;&#21644;&#23427;&#23545;&#29615;&#22659;&#12289;&#33021;&#28304;&#21644;&#32463;&#27982;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
To achieve carbon emission targets worldwide, decarbonization of the freight transport sector will be an important factor. To this end, national governments must make plans that facilitate this transition. National freight transport models are a useful tool to assess what the effects of various policies and investments may be. The state of the art consists of very detailed, static models. While useful for short-term policy assessment, these models are less suitable for the long-term planning necessary to facilitate the transition to low-carbon transportation in the upcoming decades.  In this paper, we fill this gap by developing a framework for strategic national freight transport modeling, which we call STraM, and which can be characterized as a multi-period stochastic network design model, based on a multimodal freight transport formulation. In STraM, we explicitly include several aspects that are lacking in state-of-the art national freight transport models: the dynamic nature of lo
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#20869;&#24149;&#20132;&#26131;&#32773;&#19982;&#33021;&#22815;&#39044;&#27979;&#20854;&#35746;&#21333;&#30340;&#39640;&#39057;&#20132;&#26131;&#32773;&#20043;&#38388;&#30340;&#20114;&#21160;&#65292;&#21457;&#29616;&#39640;&#39057;&#20132;&#26131;&#32773;&#30340;&#31574;&#30053;&#19982;&#24211;&#23384;&#21388;&#24694;&#12289;&#39044;&#27979;&#20934;&#30830;&#24615;&#21644;&#24066;&#22330;&#27963;&#36291;&#24230;&#26377;&#20851;&#65292;&#32780;&#20854;&#34892;&#20026;&#23545;&#22823;&#20132;&#26131;&#32773;&#26377;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2304.13985</link><description>&lt;p&gt;
&#39640;&#39057;&#39044;&#27979;&#20132;&#26131;&#21450;&#20854;&#24433;&#21709;&#65306;&#23567;&#20869;&#24149;&#20132;&#26131;&#32773;&#23545;&#21387;&#36724;&#32773;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
High-frequency Anticipatory Trading and Its Influences: Small Informed Trader vs. Front-runner. (arXiv:2304.13985v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.13985
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#20869;&#24149;&#20132;&#26131;&#32773;&#19982;&#33021;&#22815;&#39044;&#27979;&#20854;&#35746;&#21333;&#30340;&#39640;&#39057;&#20132;&#26131;&#32773;&#20043;&#38388;&#30340;&#20114;&#21160;&#65292;&#21457;&#29616;&#39640;&#39057;&#20132;&#26131;&#32773;&#30340;&#31574;&#30053;&#19982;&#24211;&#23384;&#21388;&#24694;&#12289;&#39044;&#27979;&#20934;&#30830;&#24615;&#21644;&#24066;&#22330;&#27963;&#36291;&#24230;&#26377;&#20851;&#65292;&#32780;&#20854;&#34892;&#20026;&#23545;&#22823;&#20132;&#26131;&#32773;&#26377;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#20869;&#24149;&#20132;&#26131;&#32773;(IT)&#19982;&#33021;&#22815;&#39044;&#27979;&#21069;&#32773;&#21363;&#23558;&#21040;&#26469;&#35746;&#21333;&#30340;&#39640;&#39057;&#20132;&#26131;&#32773;(HFT)&#22312;&#25193;&#23637;&#30340;Kyle(1985)&#27169;&#22411;&#19979;&#30340;&#20114;&#21160;&#12290;&#35752;&#35770;&#20102;&#19981;&#21516;&#24773;&#20917;&#19979;&#30340;&#22343;&#34913;&#12290;&#20381;&#38752;&#36895;&#24230;&#20248;&#21183;&#65292;HFT&#24635;&#26159;&#25552;&#21069;&#21644;&#22823;&#21333;&#20132;&#26131;&#21516;&#21521;&#12290;&#28982;&#32780;&#65292;&#22905;&#26159;&#21542;&#25552;&#20379;&#27969;&#21160;&#24615;&#21462;&#20915;&#20110;&#22905;&#30340;&#24211;&#23384;&#21388;&#24694;&#12289;&#39044;&#27979;&#20934;&#30830;&#24615;&#21644;&#24066;&#22330;&#27963;&#36291;&#24230;&#12290;&#22905;&#21487;&#33021;&#20250;&#22238;&#39304;&#27969;&#21160;&#24615;(&#20805;&#24403;&#21387;&#36724;&#32773;)&#25110;&#32487;&#32493;&#24102;&#36208;&#27969;&#21160;&#24615;(&#27492;&#26102;&#25105;&#20204;&#31216;&#22905;&#20026;&#23567;IT)&#12290;&#23567;IT&#24635;&#26159;&#20260;&#23475;&#22823;&#20132;&#26131;&#32773;&#65292;&#32780;&#21387;&#36724;&#32773;&#21487;&#33021;&#20351;&#22905;&#21463;&#30410;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#24778;&#22855;&#22320;&#21457;&#29616;(1)&#22686;&#21152;HFT&#20449;&#21495;&#20013;&#30340;&#22122;&#22768;&#23454;&#38469;&#19978;&#21487;&#33021;&#20250;&#38477;&#20302;IT&#30340;&#21033;&#28070;;(2)&#23613;&#31649;&#25552;&#20379;&#27969;&#21160;&#24615;&#65292;&#21387;&#36724;&#32773;&#21487;&#33021;&#27604;&#23567;&#20869;&#24149;&#20132;&#26131;&#32773;&#26356;&#21152;&#20260;&#23475;IT&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, the interactions between a large informed trader (IT, for short) and a high-frequency trader (HFT, for short) who can anticipate the former's incoming order are studied in an extended Kyle's (1985) model. Equilibria under various specific situations are discussed. Relying on the speed advantage, HFT always trades in the same direction as the large order in advance. However, whether or not she provides liquidity depends on her inventory aversion, the prediction accuracy, and the market activeness. She may supply liquidity back (act as a front-runner) or continue to take it away (in this case we call her a small IT). Small IT always harms the large trader while front-runner may benefit her. Besides, we find surprisingly that (1) increasing the noise in HFT's signal may in fact decrease IT's profit; (2) although providing liquidity, a front-runner may harm IT more than a small IT.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20998;&#26512;&#20102;&#24052;&#35199;&#39640;&#31561;&#25945;&#32946;&#31995;&#32479;&#20013;&#24179;&#34913;&#37197;&#39069;&#21046;&#30340;&#23454;&#26045;&#26041;&#27861;&#21644;&#23454;&#35777;&#35777;&#25454;&#65292;&#21457;&#29616;&#22522;&#20110;&#31181;&#26063;&#30340;&#24179;&#34913;&#37197;&#39069;&#21046;&#24230;&#21487;&#25552;&#39640;&#40657;&#20154;&#23398;&#29983;&#22312;&#32852;&#37030;&#22823;&#23398;&#30340;&#27604;&#20363;&#65292;&#21516;&#26102;&#23545;&#21171;&#21160;&#21147;&#24066;&#22330;&#20135;&#29983;&#27491;&#38754;&#24433;&#21709;&#65292;&#23545;&#21463;&#30410;&#32773;&#24102;&#26469;&#38271;&#26399;&#31119;&#21033;&#65292;&#27809;&#26377;&#36127;&#38754;&#21518;&#26524;&#12290;</title><link>http://arxiv.org/abs/2304.13936</link><description>&lt;p&gt;
&#24052;&#35199;&#39640;&#31561;&#25945;&#32946;&#25307;&#29983;&#20013;&#30340;&#31181;&#26063;&#21644;&#25910;&#20837;&#20542;&#26012;&#24179;&#34913;&#65306;&#32463;&#39564;&#25945;&#35757;&#12290;
&lt;/p&gt;
&lt;p&gt;
Racial and income-based affirmative action in higher education admissions: lessons from the Brazilian experience. (arXiv:2304.13936v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.13936
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;&#24052;&#35199;&#39640;&#31561;&#25945;&#32946;&#31995;&#32479;&#20013;&#24179;&#34913;&#37197;&#39069;&#21046;&#30340;&#23454;&#26045;&#26041;&#27861;&#21644;&#23454;&#35777;&#35777;&#25454;&#65292;&#21457;&#29616;&#22522;&#20110;&#31181;&#26063;&#30340;&#24179;&#34913;&#37197;&#39069;&#21046;&#24230;&#21487;&#25552;&#39640;&#40657;&#20154;&#23398;&#29983;&#22312;&#32852;&#37030;&#22823;&#23398;&#30340;&#27604;&#20363;&#65292;&#21516;&#26102;&#23545;&#21171;&#21160;&#21147;&#24066;&#22330;&#20135;&#29983;&#27491;&#38754;&#24433;&#21709;&#65292;&#23545;&#21463;&#30410;&#32773;&#24102;&#26469;&#38271;&#26399;&#31119;&#21033;&#65292;&#27809;&#26377;&#36127;&#38754;&#21518;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35813;&#25991;&#31456;&#36890;&#36807;&#20998;&#26512;&#24052;&#35199;&#39640;&#31561;&#25945;&#32946;&#31995;&#32479;&#20013;&#23454;&#29616;&#26041;&#27861;&#21644;&#23454;&#35777;&#35777;&#25454;&#30340;&#20351;&#29992;&#24773;&#20917;&#65292;&#25552;&#20379;&#20102;&#26377;&#20851;&#24179;&#34913;&#37197;&#39069;&#21046;&#26410;&#26469;&#30340;&#28145;&#20837;&#35265;&#35299;&#12290;&#33258;2012&#24180;&#20197;&#26469;&#65292;&#24052;&#35199;&#25152;&#26377;&#32852;&#37030;&#22823;&#23398;&#37117;&#35201;&#27714;&#25910;&#20837;&#21644;&#31181;&#26063;&#37197;&#39069;&#12290;&#22312;&#24052;&#35199;&#65292;&#32852;&#37030;&#22823;&#23398;&#30340;&#24179;&#34913;&#37197;&#39069;&#21046;&#24230;&#26159;&#20840;&#22269;&#32479;&#19968;&#30340;&#65292;&#36825;&#20351;&#20854;&#25928;&#26524;&#35780;&#20272;&#23588;&#20854;&#26377;&#20215;&#20540;&#12290;&#24179;&#34913;&#37197;&#39069;&#21046;&#25913;&#21892;&#20102;&#30446;&#26631;&#23398;&#29983;&#30340;&#25104;&#26524;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#22522;&#20110;&#31181;&#26063;&#30340;&#37197;&#39069;&#21046;&#25552;&#39640;&#20102;&#22312;&#32852;&#37030;&#22823;&#23398;&#23601;&#35835;&#30340;&#40657;&#20154;&#23398;&#29983;&#27604;&#20363;&#65292;&#36825;&#31181;&#25928;&#26524;&#26080;&#27861;&#20165;&#36890;&#36807;&#22522;&#20110;&#25910;&#20837;&#30340;&#24179;&#34913;&#37197;&#39069;&#23454;&#29616;&#12290;&#24179;&#34913;&#37197;&#39069;&#21046;&#23545;&#21171;&#21160;&#21147;&#24066;&#22330;&#20135;&#29983;&#27491;&#38754;&#24433;&#21709;&#65292;&#24182;&#20026;&#25928;&#30410;&#21463;&#30410;&#32773;&#24102;&#26469;&#20102;&#38271;&#26399;&#31119;&#21033;&#12290;&#27809;&#26377;&#35777;&#25454;&#34920;&#26126;&#23545;&#30446;&#26631;&#23398;&#29983;&#30340;&#21516;&#40836;&#20154;&#26377;&#35823;&#21305;&#37197;&#25110;&#36127;&#38754;&#21518;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
This survey article provides insights regarding the future of affirmative action by analyzing the implementation methods and the empirical evidence on the use of placement quotas in the Brazilian higher education system. All federal universities have required income and racial-based quotas in Brazil since 2012. Affirmative action in federal universities is uniformly applied across the country, which makes evaluating its effects particularly valuable. Affirmative action improves the outcomes of targeted students. Specifically, race-based quotas raise the share of black students in federal universities, an effect not observed with income-based quotas alone. Affirmative action has downstream positive consequences for labor market outcomes. The results suggest that income and race-based quotas beneficiaries experience substantial long-term welfare benefits. There is no evidence of mismatching or negative consequences for targeted students' peers.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#37319;&#29992;&#22522;&#20110;Gordon&#27169;&#22411;&#30340;&#32508;&#21512;&#35780;&#20272;&#19982;&#22810;&#25351;&#26631;&#27169;&#31946;&#20915;&#31574;&#26041;&#27861;&#65292;&#22312;&#22810;&#20262;&#22810;&#35777;&#21048;&#20132;&#26131;&#25152;&#36873;&#21462;&#39640;&#25928;&#29575;&#26368;&#20248;&#32929;&#31080;&#32452;&#21512;&#30340;&#26631;&#20934;&#12290;</title><link>http://arxiv.org/abs/2304.13818</link><description>&lt;p&gt;
&#22522;&#20110;Gordon&#27169;&#22411;&#25321;&#20248;&#36873;&#25321;&#21487;&#25345;&#32493;&#32929;&#31080;&#30340;&#22810;&#25351;&#26631;&#27169;&#31946;&#20915;&#31574;&#26041;&#27861;&#65306;&#20197;&#22810;&#20262;&#22810;&#35777;&#21048;&#20132;&#26131;&#25152;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
Selecting Sustainable Optimal Stock by Using Multi-Criteria Fuzzy Decision-Making Approaches Based on the Development of the Gordon Model: A case study of the Toronto Stock Exchange. (arXiv:2304.13818v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.13818
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37319;&#29992;&#22522;&#20110;Gordon&#27169;&#22411;&#30340;&#32508;&#21512;&#35780;&#20272;&#19982;&#22810;&#25351;&#26631;&#27169;&#31946;&#20915;&#31574;&#26041;&#27861;&#65292;&#22312;&#22810;&#20262;&#22810;&#35777;&#21048;&#20132;&#26131;&#25152;&#36873;&#21462;&#39640;&#25928;&#29575;&#26368;&#20248;&#32929;&#31080;&#32452;&#21512;&#30340;&#26631;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36873;&#25321;&#20855;&#26377;&#26368;&#39640;&#25928;&#29575;&#30340;&#27491;&#30830;&#32929;&#31080;&#32452;&#21512;&#19968;&#30452;&#26159;&#31934;&#20934;&#21644;&#21512;&#27861;&#25237;&#36164;&#32773;&#20851;&#27880;&#30340;&#38382;&#39064;&#12290;&#22240;&#27492;&#65292;&#26412;&#25991;&#26088;&#22312;&#21033;&#29992;DEMATEL&#27169;&#22411;&#21644;&#22522;&#20110;Gordon&#27169;&#22411;&#21457;&#23637;&#30340;&#22810;&#25351;&#26631;&#27169;&#31946;&#20915;&#31574;&#26041;&#27861;&#65292;&#30830;&#23450;&#36873;&#21462;&#20855;&#26377;&#39640;&#25928;&#29575;&#29575;&#30340;&#26368;&#20339;&#32929;&#31080;&#32452;&#21512;&#30340;&#26631;&#20934;&#65292;&#20197;&#22312;&#22810;&#20262;&#22810;&#35777;&#21048;&#20132;&#26131;&#25152;&#23637;&#24320;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Choosing the right stock portfolio with the highest efficiencies has always concerned accurate and legal investors. Investors have always been concerned about the accuracy and legitimacy of choosing the right stock portfolio with high efficiency. Therefore, this paper aims to determine the criteria for selecting an optimal stock portfolio with a high-efficiency ratio in the Toronto Stock Exchange using the integrated evaluation and decision-making trial laboratory (DEMATEL) model and Multi-Criteria Fuzzy decision-making approaches regarding the development of the Gordon model. In the current study, results obtained using combined multi-criteria fuzzy decision-making approaches, the practical factors, the relative weight of dividends, discount rate, and dividend growth rate have been comprehensively illustrated using combined multi-criteria fuzzy decision-making approaches. A group of 10 experts with at least a ten-year of experience in the stock exchange field was formed to review the 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21457;&#29616;&#23381;&#26399;&#26292;&#38706;&#20110;&#29615;&#22659;&#20013;&#30340;&#27694;&#27687;&#21270;&#29289;&#20250;&#23545;&#20986;&#29983;&#32467;&#26524;&#20135;&#29983;&#36127;&#38754;&#24433;&#21709;&#65292;&#32780;&#20854;&#20182;&#30340;&#22823;&#27668;&#27745;&#26579;&#29289;&#21017;&#22312;&#25386;&#23041;&#30340;&#32974;&#20799;&#22788;&#20110;&#23433;&#20840;&#27700;&#24179;&#12290;&#19981;&#20165;&#22914;&#27492;&#65292;&#23381;&#26399;&#26292;&#38706;&#20110;&#27694;&#27687;&#21270;&#29289;&#30340;&#36127;&#38754;&#25928;&#24212;&#23545;&#22788;&#20110;&#21155;&#21183;&#23478;&#38271;&#30340;&#26032;&#29983;&#20799;&#26356;&#20026;&#20005;&#37325;&#12290;</title><link>http://arxiv.org/abs/2208.06271</link><description>&lt;p&gt;
&#25386;&#23041;&#22823;&#27668;&#27745;&#26579;&#23545;&#20986;&#29983;&#32467;&#26524;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The effect of ambient air pollution on birth outcomes in Norway. (arXiv:2208.06271v5 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.06271
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21457;&#29616;&#23381;&#26399;&#26292;&#38706;&#20110;&#29615;&#22659;&#20013;&#30340;&#27694;&#27687;&#21270;&#29289;&#20250;&#23545;&#20986;&#29983;&#32467;&#26524;&#20135;&#29983;&#36127;&#38754;&#24433;&#21709;&#65292;&#32780;&#20854;&#20182;&#30340;&#22823;&#27668;&#27745;&#26579;&#29289;&#21017;&#22312;&#25386;&#23041;&#30340;&#32974;&#20799;&#22788;&#20110;&#23433;&#20840;&#27700;&#24179;&#12290;&#19981;&#20165;&#22914;&#27492;&#65292;&#23381;&#26399;&#26292;&#38706;&#20110;&#27694;&#27687;&#21270;&#29289;&#30340;&#36127;&#38754;&#25928;&#24212;&#23545;&#22788;&#20110;&#21155;&#21183;&#23478;&#38271;&#30340;&#26032;&#29983;&#20799;&#26356;&#20026;&#20005;&#37325;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#27668;&#27745;&#26579;&#21363;&#20351;&#22312;&#27745;&#26579;&#36739;&#20302;&#30340;&#22269;&#23478;&#20063;&#23545;&#32974;&#20799;&#26377;&#23475;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#27668;&#27745;&#26579;&#23545;&#25386;&#23041;&#20986;&#29983;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#23381;&#26399;&#26292;&#38706;&#20110;&#27694;&#27687;&#21270;&#29289;&#20250;&#23548;&#33268;&#26174;&#33879;&#30340;&#20986;&#29983;&#20307;&#37325;&#21644;&#20986;&#29983;&#38271;&#24230;&#32570;&#22833;&#65292;&#32780;&#20854;&#20182;&#30340;&#22823;&#27668;&#27745;&#26579;&#29289;&#22914;&#20108;&#27687;&#21270;&#27694;&#21644;&#20108;&#27687;&#21270;&#30827;&#21017;&#20284;&#20046;&#22312;&#25386;&#23041;&#30340;&#32974;&#20799;&#22788;&#20110;&#23433;&#20840;&#27700;&#24179;&#12290;&#19981;&#20165;&#22914;&#27492;&#65292;&#23381;&#26399;&#26292;&#38706;&#20110;&#27694;&#27687;&#21270;&#29289;&#30340;&#36127;&#38754;&#25928;&#24212;&#23545;&#22788;&#20110;&#21155;&#21183;&#23478;&#38271;&#30340;&#26032;&#29983;&#20799;&#26356;&#20026;&#20005;&#37325;&#12290;&#24179;&#22343;&#27987;&#24230;&#21644;&#20598;&#21457;&#39640;&#27987;&#24230;&#20107;&#20214;&#37117;&#20250;&#23545;&#20986;&#29983;&#32467;&#26524;&#20135;&#29983;&#19981;&#21033;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Ambient air pollution is harmful to the fetus even in countries with relatively low levels of pollution. In this paper, I examine the effects of ambient air pollution on birth outcomes in Norway. I find that prenatal exposure to ambient nitric oxide in the last trimester causes significant birth weight and birth length loss under the same sub-postcode fixed effects and calendar month fixed effects, whereas other ambient air pollutants such as nitrogen dioxide and sulfur dioxide appear to be at safe levels for the fetus in Norway. In addition, the marginal adverse effect of ambient nitric oxide is larger for newborns with disadvantaged parents. Both average concentrations of nitric oxide and occasional high concentration events can adversely affect birth outcomes. The contributions of my work include: first, my finding that prenatal exposure to environmental nitric oxide has an adverse effect on birth outcomes fills a long-standing knowledge gap. Second, with the large sample size and g
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#37096;&#20998;&#35266;&#27979;&#25193;&#25955;&#36807;&#31243;&#30340;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#19968;&#33268;&#24615;&#30340;&#36275;&#22815;&#26465;&#20214;&#65292;&#24182;&#22312;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#24314;&#27169;&#20013;&#23454;&#29616;&#20102;&#35813;&#27169;&#22411;&#30340;&#26410;&#30693;&#21442;&#25968;&#30340;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#37327;&#30340;&#19968;&#33268;&#24615;&#12290;</title><link>http://arxiv.org/abs/2201.07656</link><description>&lt;p&gt;
&#37096;&#20998;&#35266;&#27979;&#25193;&#25955;&#36807;&#31243;&#30340;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#19968;&#33268;&#24615;&#21450;&#22312;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#24314;&#27169;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Consistency of MLE for partially observed diffusions, with application in market microstructure modeling. (arXiv:2201.07656v2 [math.ST] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.07656
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#37096;&#20998;&#35266;&#27979;&#25193;&#25955;&#36807;&#31243;&#30340;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#19968;&#33268;&#24615;&#30340;&#36275;&#22815;&#26465;&#20214;&#65292;&#24182;&#22312;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#24314;&#27169;&#20013;&#23454;&#29616;&#20102;&#35813;&#27169;&#22411;&#30340;&#26410;&#30693;&#21442;&#25968;&#30340;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#37327;&#30340;&#19968;&#33268;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26131;&#20110;&#22788;&#29702;&#30340;&#36275;&#22815;&#26465;&#20214;&#65292;&#29992;&#20110;&#25551;&#36848;&#19982;&#23436;&#20840;&#35266;&#27979;&#30340;&#25193;&#25955;&#36807;&#31243;&#30456;&#20851;&#30340;&#31283;&#24577;&#20998;&#24067;&#65292;&#20174;&#32780;&#24471;&#20986;&#22312;&#26410;&#30693;&#21442;&#25968;&#20540;&#26377;&#38480;&#30340;&#24773;&#20917;&#19979;&#65292;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#37327;&#30340;&#19968;&#33268;&#24615;&#26465;&#20214;&#12290;&#25105;&#20204;&#23558;&#35813;&#36275;&#22815;&#26465;&#20214;&#24212;&#29992;&#20110;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#30340;&#28508;&#22312;&#20215;&#26684;&#27169;&#22411;&#20013;&#65292;&#24182;&#39564;&#35777;&#20102;&#35813;&#27169;&#22411;&#19979;&#26410;&#30693;&#21442;&#25968;&#30340;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#37327;&#30340;&#19968;&#33268;&#24615;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#21033;&#29992;&#32435;&#26031;&#36798;&#20811;&#20132;&#26131;&#25152;&#30340;&#21382;&#21490;&#37329;&#34701;&#25968;&#25454;&#35745;&#31639;&#20102;&#36825;&#20123;&#20272;&#35745;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a tractable sufficient condition for the consistency of maximum likelihood estimators (MLEs) in partially observed diffusion models, stated in terms of stationary distribution of the associated fully observed diffusion, under the assumption that the set of unknown parameter values is finite. This sufficient condition is then verified in the context of a latent price model of market microstructure, yielding consistency of maximum likelihood estimators of the unknown parameters in this model. Finally, we compute the latter estimators using historical financial data taken from the NASDAQ exchange.
&lt;/p&gt;</description></item></channel></rss>