<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#38598;&#20013;&#27969;&#21160;&#24615;&#30340;&#24120;&#37327;&#20135;&#21697;&#24066;&#22330;&#65292;&#23545;&#21160;&#24577;&#35843;&#25972;&#27969;&#21160;&#24615;&#30340;&#25112;&#30053;&#24615;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#36130;&#23500;&#21160;&#24577;&#36827;&#34892;&#20102;&#25551;&#36848;&#12290;&#36890;&#36807;&#25512;&#23548;&#20986;&#33258;&#34701;&#36164;&#21644;&#23553;&#38381;&#24418;&#24335;&#30340;&#26368;&#20248;&#27969;&#21160;&#24615;&#25552;&#20379;&#31574;&#30053;&#65292;&#32467;&#21512;&#30408;&#21033;&#33021;&#21147;&#12289;&#39044;&#27979;&#25439;&#22833;&#21644;&#38598;&#20013;&#39118;&#38505;&#65292;&#21487;&#20197;&#36890;&#36807;&#35843;&#25972;&#27969;&#21160;&#24615;&#33539;&#22260;&#26469;&#22686;&#21152;&#36153;&#29992;&#25910;&#20837;&#24182;&#20174;&#36793;&#38469;&#29575;&#30340;&#39044;&#26399;&#21464;&#21270;&#20013;&#33719;&#21033;&#12290;</title><link>http://arxiv.org/abs/2309.08431</link><description>&lt;p&gt;
&#21435;&#20013;&#24515;&#21270;&#37329;&#34701;&#19982;&#33258;&#21160;&#21270;&#24066;&#22330;&#20570;&#24066;&#65306;&#21487;&#39044;&#27979;&#30340;&#25439;&#22833;&#21644;&#26368;&#20248;&#27969;&#21160;&#24615;&#25552;&#20379;
&lt;/p&gt;
&lt;p&gt;
Decentralised Finance and Automated Market Making: Predictable Loss and Optimal Liquidity Provision. (arXiv:2309.08431v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.08431
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#38598;&#20013;&#27969;&#21160;&#24615;&#30340;&#24120;&#37327;&#20135;&#21697;&#24066;&#22330;&#65292;&#23545;&#21160;&#24577;&#35843;&#25972;&#27969;&#21160;&#24615;&#30340;&#25112;&#30053;&#24615;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#36130;&#23500;&#21160;&#24577;&#36827;&#34892;&#20102;&#25551;&#36848;&#12290;&#36890;&#36807;&#25512;&#23548;&#20986;&#33258;&#34701;&#36164;&#21644;&#23553;&#38381;&#24418;&#24335;&#30340;&#26368;&#20248;&#27969;&#21160;&#24615;&#25552;&#20379;&#31574;&#30053;&#65292;&#32467;&#21512;&#30408;&#21033;&#33021;&#21147;&#12289;&#39044;&#27979;&#25439;&#22833;&#21644;&#38598;&#20013;&#39118;&#38505;&#65292;&#21487;&#20197;&#36890;&#36807;&#35843;&#25972;&#27969;&#21160;&#24615;&#33539;&#22260;&#26469;&#22686;&#21152;&#36153;&#29992;&#25910;&#20837;&#24182;&#20174;&#36793;&#38469;&#29575;&#30340;&#39044;&#26399;&#21464;&#21270;&#20013;&#33719;&#21033;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#23545;&#21160;&#24577;&#35843;&#25972;&#20854;&#22312;&#38598;&#20013;&#27969;&#21160;&#24615;&#27744;&#20013;&#25552;&#20379;&#27969;&#21160;&#24615;&#33539;&#22260;&#30340;&#25112;&#30053;&#24615;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#36830;&#32493;&#26102;&#38388;&#36130;&#23500;&#21160;&#24577;&#36827;&#34892;&#20102;&#34920;&#24449;&#12290;&#20182;&#20204;&#30340;&#36130;&#23500;&#26469;&#33258;&#25163;&#32493;&#36153;&#25910;&#20837;&#21644;&#20182;&#20204;&#22312;&#27744;&#20013;&#25345;&#26377;&#30340;&#36164;&#20135;&#30340;&#20215;&#20540;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#20102;&#19968;&#31181;&#33258;&#34701;&#36164;&#21644;&#23553;&#38381;&#24418;&#24335;&#30340;&#26368;&#20248;&#27969;&#21160;&#24615;&#25552;&#20379;&#31574;&#30053;&#65292;&#20854;&#20013;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#33539;&#22260;&#23485;&#24230;&#30001;&#27744;&#30340;&#30408;&#21033;&#33021;&#21147;&#65288;&#25552;&#20379;&#36153;&#29992;&#20943;&#21435;&#29123;&#27668;&#36153;&#29992;&#65289;&#12289;&#21487;&#39044;&#27979;&#25439;&#22833;&#65288;&#25345;&#20179;&#30340;&#25439;&#22833;&#65289;&#21644;&#38598;&#20013;&#39118;&#38505;&#20915;&#23450;&#12290;&#38598;&#20013;&#39118;&#38505;&#26159;&#25351;&#22914;&#26524;&#27744;&#20013;&#30340;&#36793;&#38469;&#20817;&#25442;&#29575;&#65288;&#31867;&#20284;&#20110;&#38480;&#20215;&#35746;&#21333;&#31807;&#20013;&#30340;&#20013;&#38388;&#20215;&#65289;&#36229;&#20986;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#33539;&#22260;&#65292;&#36153;&#29992;&#25910;&#20837;&#20250;&#19979;&#38477;&#12290;&#24403;&#36793;&#38469;&#20817;&#25442;&#29575;&#30001;&#38543;&#26426;&#28418;&#31227;&#39537;&#21160;&#26102;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#36890;&#36807;&#26368;&#20248;&#35843;&#25972;&#27969;&#21160;&#24615;&#33539;&#22260;&#26469;&#22686;&#21152;&#36153;&#29992;&#25910;&#20837;&#24182;&#20174;&#36793;&#38469;&#29575;&#30340;&#39044;&#26399;&#21464;&#21270;&#20013;&#33719;&#21033;&#12290;
&lt;/p&gt;
&lt;p&gt;
Constant product markets with concentrated liquidity (CL) are the most popular type of automated market makers. In this paper, we characterise the continuous-time wealth dynamics of strategic LPs who dynamically adjust their range of liquidity provision in CL pools. Their wealth results from fee income and the value of their holdings in the pool. Next, we derive a self-financing and closed-form optimal liquidity provision strategy where the width of the LP's liquidity range is determined by the profitability of the pool (provision fees minus gas fees), the predictable losses (PL) of the LP's position, and concentration risk. Concentration risk refers to the decrease in fee revenue if the marginal exchange rate (akin to the midprice in a limit order book) in the pool exits the LP's range of liquidity. When the marginal rate is driven by a stochastic drift, we show how to optimally skew the range of liquidity to increase fee revenue and profit from the expected changes in the marginal ra
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#23454;&#39564;&#30740;&#31350;&#20102;&#20154;&#24037;&#26234;&#33021;&#31639;&#27861;&#22312;&#21452;&#37325;&#21512;&#21516;&#38382;&#39064;&#20013;&#33021;&#22815;&#33258;&#20027;&#35774;&#35745;&#28608;&#21169;&#30456;&#23481;&#30340;&#21512;&#21516;&#65292;&#26080;&#38656;&#22806;&#37096;&#24341;&#23548;&#25110;&#36890;&#20449;&#65292;&#24182;&#19988;&#19981;&#21516;AI&#31639;&#27861;&#25903;&#25345;&#30340;&#22996;&#25176;&#20154;&#21487;&#20197;&#37319;&#29992;&#28151;&#21512;&#21644;&#38646;&#21644;&#21338;&#24328;&#34892;&#20026;&#65292;&#26356;&#20855;&#26234;&#33021;&#30340;&#22996;&#25176;&#20154;&#24448;&#24448;&#20250;&#21464;&#24471;&#21512;&#20316;&#12290;</title><link>http://arxiv.org/abs/2303.12350</link><description>&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#19982;&#21452;&#37325;&#21512;&#21516;
&lt;/p&gt;
&lt;p&gt;
Artificial Intelligence and Dual Contract. (arXiv:2303.12350v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.12350
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#23454;&#39564;&#30740;&#31350;&#20102;&#20154;&#24037;&#26234;&#33021;&#31639;&#27861;&#22312;&#21452;&#37325;&#21512;&#21516;&#38382;&#39064;&#20013;&#33021;&#22815;&#33258;&#20027;&#35774;&#35745;&#28608;&#21169;&#30456;&#23481;&#30340;&#21512;&#21516;&#65292;&#26080;&#38656;&#22806;&#37096;&#24341;&#23548;&#25110;&#36890;&#20449;&#65292;&#24182;&#19988;&#19981;&#21516;AI&#31639;&#27861;&#25903;&#25345;&#30340;&#22996;&#25176;&#20154;&#21487;&#20197;&#37319;&#29992;&#28151;&#21512;&#21644;&#38646;&#21644;&#21338;&#24328;&#34892;&#20026;&#65292;&#26356;&#20855;&#26234;&#33021;&#30340;&#22996;&#25176;&#20154;&#24448;&#24448;&#20250;&#21464;&#24471;&#21512;&#20316;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#20154;&#24037;&#26234;&#33021;&#31639;&#27861;&#30340;&#24555;&#36895;&#36827;&#27493;&#65292;&#20154;&#20204;&#24076;&#26395;&#31639;&#27861;&#24456;&#24555;&#23601;&#33021;&#22312;&#21508;&#20010;&#39046;&#22495;&#21462;&#20195;&#20154;&#31867;&#20915;&#31574;&#32773;&#65292;&#20363;&#22914;&#21512;&#21516;&#35774;&#35745;&#12290;&#25105;&#20204;&#36890;&#36807;&#23454;&#39564;&#30740;&#31350;&#20102;&#30001;&#20154;&#24037;&#26234;&#33021;&#65288;&#22810;&#26234;&#33021;&#20307;Q&#23398;&#20064;&#65289;&#39537;&#21160;&#30340;&#31639;&#27861;&#22312;&#21452;&#37325;&#22996;&#25176;-&#20195;&#29702;&#38382;&#39064;&#30340;&#32463;&#20856;&#8220;&#21452;&#37325;&#21512;&#21516;&#8221;&#27169;&#22411;&#20013;&#30340;&#34892;&#20026;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#36825;&#20123;AI&#31639;&#27861;&#21487;&#20197;&#33258;&#20027;&#23398;&#20064;&#35774;&#35745;&#21512;&#36866;&#30340;&#28608;&#21169;&#30456;&#23481;&#21512;&#21516;&#65292;&#32780;&#26080;&#38656;&#22806;&#37096;&#24341;&#23548;&#25110;&#32773;&#23427;&#20204;&#20043;&#38388;&#30340;&#36890;&#20449;&#12290;&#25105;&#20204;&#24378;&#35843;&#65292;&#30001;&#19981;&#21516;AI&#31639;&#27861;&#25903;&#25345;&#30340;&#22996;&#25176;&#20154;&#21487;&#20197;&#37319;&#29992;&#28151;&#21512;&#21644;&#38646;&#21644;&#21338;&#24328;&#34892;&#20026;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#26356;&#20855;&#26234;&#33021;&#30340;&#22996;&#25176;&#20154;&#24448;&#24448;&#20250;&#21464;&#24471;&#21512;&#20316;&#65292;&#32780;&#26234;&#33021;&#36739;&#20302;&#30340;&#22996;&#25176;&#20154;&#21017;&#20250;&#20986;&#29616;&#20869;&#29983;&#24615;&#36817;&#35270;&#24182;&#20542;&#21521;&#20110;&#31454;&#20105;&#12290;&#22312;&#26368;&#20248;&#21512;&#21516;&#19979;&#65292;&#20195;&#29702;&#30340;&#36739;&#20302;&#21512;&#21516;&#28608;&#21169;&#30001;&#22996;&#25176;&#20154;&#20043;&#38388;&#30340;&#21246;&#32467;&#31574;&#30053;&#32500;&#25345;&#12290;
&lt;/p&gt;
&lt;p&gt;
With the dramatic progress of artificial intelligence algorithms in recent times, it is hoped that algorithms will soon supplant human decision-makers in various fields, such as contract design. We analyze the possible consequences by experimentally studying the behavior of algorithms powered by Artificial Intelligence (Multi-agent Q-learning) in a workhorse \emph{dual contract} model for dual-principal-agent problems. We find that the AI algorithms autonomously learn to design incentive-compatible contracts without external guidance or communication among themselves. We emphasize that the principal, powered by distinct AI algorithms, can play mixed-sum behavior such as collusion and competition. We find that the more intelligent principals tend to become cooperative, and the less intelligent principals are endogenizing myopia and tend to become competitive. Under the optimal contract, the lower contract incentive to the agent is sustained by collusive strategies between the principals
&lt;/p&gt;</description></item></channel></rss>