<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#36890;&#36807;&#26681;&#25454;&#35009;&#21028;&#22312;&#27599;&#20010;&#22238;&#21512;&#20013;&#30340;&#32988;&#32773;&#26469;&#20915;&#23450;&#32988;&#21033;&#32773;&#30340;&#35780;&#20998;&#26041;&#27861;&#65292;&#21487;&#20197;&#20943;&#23569;&#25331;&#20987;&#35009;&#21028;&#30340;&#20559;&#35265;&#23545;&#27604;&#36187;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2402.06594</link><description>&lt;p&gt;
&#20182;&#20204;&#34987;&#25250;&#21163;&#20102;&#65281;&#36890;&#36807;&#20013;&#38388;&#20540;&#35780;&#20998;&#20943;&#23569;&#25331;&#20987;&#35009;&#21028;&#30340;&#20559;&#35265;
&lt;/p&gt;
&lt;p&gt;
They were robbed! Scoring by the middlemost to attenuate biased judging in boxing
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.06594
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#26681;&#25454;&#35009;&#21028;&#22312;&#27599;&#20010;&#22238;&#21512;&#20013;&#30340;&#32988;&#32773;&#26469;&#20915;&#23450;&#32988;&#21033;&#32773;&#30340;&#35780;&#20998;&#26041;&#27861;&#65292;&#21487;&#20197;&#20943;&#23569;&#25331;&#20987;&#35009;&#21028;&#30340;&#20559;&#35265;&#23545;&#27604;&#36187;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25331;&#20987;&#38271;&#26399;&#23384;&#22312;&#30528;&#20559;&#35265;&#35780;&#21028;&#30340;&#38382;&#39064;&#65292;&#19981;&#20165;&#24433;&#21709;&#32844;&#19994;&#25331;&#20987;&#36187;&#20107;&#65292;&#20063;&#24433;&#21709;&#22885;&#36816;&#27604;&#36187;&#12290;&#25152;&#35859;&#30340;&#8220;&#25250;&#21163;&#8221;&#29616;&#35937;&#35753;&#25331;&#20987;&#36816;&#21160;&#30340;&#31881;&#19997;&#21644;&#36816;&#21160;&#21592;&#20204;&#23545;&#27492;&#20135;&#29983;&#20102;&#30097;&#34385;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21270;&#30340;&#25331;&#20987;&#35780;&#20998;&#35843;&#25972;&#26041;&#27861;&#65306;&#26681;&#25454;&#35009;&#21028;&#22312;&#27599;&#20010;&#22238;&#21512;&#20013;&#30340;&#32988;&#32773;&#26469;&#20915;&#23450;&#32988;&#21033;&#32773;&#65292;&#32780;&#19981;&#26159;&#20381;&#38752;&#35009;&#21028;&#23545;&#25972;&#22330;&#27604;&#36187;&#30340;&#24635;&#20307;&#35780;&#20998;&#12290;&#36825;&#31181;&#26041;&#27861;&#22522;&#20110;&#31038;&#20250;&#36873;&#25321;&#29702;&#35770;&#65292;&#37319;&#29992;&#22810;&#25968;&#35268;&#21017;&#21644;&#20013;&#38388;&#20540;&#32858;&#21512;&#20989;&#25968;&#65292;&#23545;&#20559;&#34962;&#35009;&#21028;&#26500;&#25104;&#21327;&#35843;&#38382;&#39064;&#65292;&#20943;&#24369;&#20854;&#24433;&#21709;&#21147;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#20998;&#26512;&#21644;&#27169;&#25311;&#32467;&#26524;&#34920;&#26126;&#65292;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#26174;&#33879;&#20943;&#23569;&#20559;&#34962;&#35009;&#21028;&#24433;&#21709;&#27604;&#36187;&#32467;&#26524;&#30340;&#21487;&#33021;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Boxing has a long-standing problem with biased judging, impacting both professional and Olympic bouts. ''Robberies'', where boxers are widely seen as being denied rightful victories, threaten to drive fans and athletes away from the sport. To tackle this problem, we propose a minimalist adjustment in how boxing is scored: the winner would be decided by the majority of round-by-round victories according to the judges, rather than relying on the judges' overall bout scores. This approach, rooted in social choice theory and utilising majority rule and middlemost aggregation functions, creates a coordination problem for partisan judges and attenuates their influence. Our model analysis and simulations demonstrate the potential to significantly decrease the likelihood of a partisan judge swaying the result of a bout.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#20248;&#21270;&#29616;&#26377;&#30340;NFT&#28608;&#21169;&#26426;&#21046;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#21442;&#32771;&#28608;&#21169;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#36890;&#36807;&#26368;&#22823;&#21270;NFT&#20043;&#38388;&#30340;&#36830;&#25509;&#65292;&#20351;&#27599;&#20010;&#23396;&#31435;&#30340;NFT&#33021;&#22815;&#25193;&#23637;&#20854;&#32593;&#32476;&#24182;&#33719;&#24471;&#22870;&#21169;&#12290;</title><link>https://arxiv.org/abs/2402.06459</link><description>&lt;p&gt;
&#26368;&#22823;&#21270;NFT&#28608;&#21169;&#65306;&#21442;&#32771;&#35753;&#20320;&#21464;&#23500;
&lt;/p&gt;
&lt;p&gt;
Maximizing NFT Incentives: References Make You Rich
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.06459
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#20248;&#21270;&#29616;&#26377;&#30340;NFT&#28608;&#21169;&#26426;&#21046;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#21442;&#32771;&#28608;&#21169;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#36890;&#36807;&#26368;&#22823;&#21270;NFT&#20043;&#38388;&#30340;&#36830;&#25509;&#65292;&#20351;&#27599;&#20010;&#23396;&#31435;&#30340;NFT&#33021;&#22815;&#25193;&#23637;&#20854;&#32593;&#32476;&#24182;&#33719;&#24471;&#22870;&#21169;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#22914;&#20309;&#20248;&#21270;&#29616;&#26377;&#30340;&#38750;&#21516;&#36136;&#21270;&#20195;&#24065;&#65288;NFT&#65289;&#28608;&#21169;&#26426;&#21046;&#12290;&#36890;&#36807;&#23545;&#22823;&#37327;NFT&#30456;&#20851;&#26631;&#20934;&#21644;&#30495;&#23454;&#39033;&#30446;&#30340;&#25506;&#32034;&#65292;&#25105;&#20204;&#21457;&#29616;&#20102;&#19968;&#20010;&#24847;&#24819;&#19981;&#21040;&#30340;&#21457;&#29616;&#12290;&#24403;&#21069;&#30340;NFT&#28608;&#21169;&#26426;&#21046;&#36890;&#24120;&#32452;&#32455;&#25104;&#19968;&#31181;&#23396;&#31435;&#30340;&#12289;&#19968;&#27425;&#24615;&#20351;&#29992;&#30340;&#26041;&#24335;&#65292;&#24448;&#24448;&#24573;&#35270;&#20102;&#23427;&#20204;&#22312;&#21487;&#25193;&#23637;&#32452;&#32455;&#32467;&#26500;&#26041;&#38754;&#30340;&#28508;&#21147;&#12290;&#25105;&#20204;&#25552;&#20986;&#12289;&#20998;&#26512;&#21644;&#23454;&#29616;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#21442;&#32771;&#28608;&#21169;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#22522;&#20110;&#26377;&#21521;&#26080;&#29615;&#22270;&#65288;DAG&#65289;&#30340;NFT&#32593;&#32476;&#32467;&#26500;&#12290;&#36825;&#20010;&#27169;&#22411;&#26088;&#22312;&#26368;&#22823;&#21270;NFT&#20043;&#38388;&#30340;&#36830;&#25509;&#65288;&#25110;&#21442;&#32771;&#65289;&#65292;&#20351;&#27599;&#20010;&#23396;&#31435;&#30340;NFT&#33021;&#22815;&#25193;&#23637;&#20854;&#32593;&#32476;&#65292;&#24182;&#31215;&#32047;&#26469;&#33258;&#21518;&#32493;&#25110;&#35746;&#38405;NFT&#30340;&#22870;&#21169;&#12290;&#25105;&#20204;&#23545;&#35813;&#27169;&#22411;&#36827;&#34892;&#20102;&#29702;&#35770;&#21644;&#23454;&#36341;&#20998;&#26512;&#65292;&#23637;&#31034;&#20102;&#20854;&#26368;&#20248;&#25928;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we study how to optimize existing Non-Fungible Token (NFT) incentives. Upon exploring a large number of NFT-related standards and real-world projects, we come across an unexpected finding. That is, the current NFT incentive mechanisms, often organized in an isolated and one-time-use fashion, tend to overlook their potential for scalable organizational structures.   We propose, analyze, and implement a novel reference incentive model, which is inherently structured as a Directed Acyclic Graph (DAG)-based NFT network. This model aims to maximize connections (or references) between NFTs, enabling each isolated NFT to expand its network and accumulate rewards derived from subsequent or subscribed ones. We conduct both theoretical and practical analyses of the model, demonstrating its optimal utility.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#36890;&#36807;&#20998;&#26512;&#25991;&#29486;&#21644;&#31995;&#32479;&#32508;&#36848;&#65292;&#30740;&#31350;&#20102;&#21487;&#25345;&#32493;&#20379;&#24212;&#38142;&#21644;&#22797;&#21512;&#26448;&#26009;&#20043;&#38388;&#30340;&#20132;&#21449;&#28857;&#65292;&#25552;&#20379;&#20102;&#20851;&#20110;&#24037;&#19994;5.0&#20013;&#21487;&#25345;&#32493;&#21644;&#32511;&#33394;&#22797;&#21512;&#26448;&#26009;&#20379;&#24212;&#38142;&#30340;&#29616;&#29366;&#12289;&#30740;&#31350;&#32570;&#21475;&#21644;&#26410;&#26469;&#30740;&#31350;&#26426;&#20250;&#30340;&#32508;&#21512;&#27010;&#36848;&#12290;</title><link>https://arxiv.org/abs/2402.06100</link><description>&lt;p&gt;
&#36808;&#21521;&#24037;&#19994;5.0&#65306;&#21487;&#25345;&#32493;&#21644;&#32511;&#33394;&#22797;&#21512;&#26448;&#26009;&#20379;&#24212;&#38142;&#30340;&#31995;&#32479;&#25991;&#29486;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
Towards Industry 5.0: A Systematic Literature Review on Sustainable and Green Composite Materials Supply Chains
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.06100
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#36890;&#36807;&#20998;&#26512;&#25991;&#29486;&#21644;&#31995;&#32479;&#32508;&#36848;&#65292;&#30740;&#31350;&#20102;&#21487;&#25345;&#32493;&#20379;&#24212;&#38142;&#21644;&#22797;&#21512;&#26448;&#26009;&#20043;&#38388;&#30340;&#20132;&#21449;&#28857;&#65292;&#25552;&#20379;&#20102;&#20851;&#20110;&#24037;&#19994;5.0&#20013;&#21487;&#25345;&#32493;&#21644;&#32511;&#33394;&#22797;&#21512;&#26448;&#26009;&#20379;&#24212;&#38142;&#30340;&#29616;&#29366;&#12289;&#30740;&#31350;&#32570;&#21475;&#21644;&#26410;&#26469;&#30740;&#31350;&#26426;&#20250;&#30340;&#32508;&#21512;&#27010;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21487;&#25345;&#32493;&#20379;&#24212;&#38142;&#31649;&#29702;&#26159;&#24037;&#19994;5.0&#30340;&#20851;&#38190;&#30446;&#26631;&#65292;&#21033;&#29992;&#23454;&#26102;&#25968;&#25454;&#20998;&#26512;&#12289;&#36830;&#25509;&#24615;&#21644;&#26234;&#33021;&#33258;&#21160;&#21270;&#31561;&#25216;&#26415;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#22797;&#21512;&#26448;&#26009;&#20855;&#26377;&#36731;&#36136;&#32467;&#26500;&#31561;&#20248;&#28857;&#65292;&#23545;&#20110;&#20943;&#23569;&#29123;&#27833;&#28040;&#32791;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#30740;&#31350;&#36890;&#36807;&#23545;&#22797;&#21512;&#26448;&#26009;&#20379;&#24212;&#38142;&#29616;&#29366;&#12289;&#30740;&#31350;&#32570;&#21475;&#12289;&#26041;&#27861;&#35770;&#21644;&#26410;&#26469;&#30740;&#31350;&#26426;&#20250;&#36827;&#34892;&#35745;&#37327;&#20998;&#26512;&#21644;&#31995;&#32479;&#32508;&#36848;&#65292;&#25506;&#35752;&#20102;&#21487;&#25345;&#32493;&#20379;&#24212;&#38142;&#19982;&#22797;&#21512;&#26448;&#26009;&#20043;&#38388;&#30340;&#20132;&#21449;&#28857;&#12290;&#37319;&#29992;&#31995;&#32479;&#25991;&#29486;&#32508;&#36848;&#26041;&#27861;&#20998;&#26512;Scopus&#21644;Web of Science (WOS)&#25968;&#25454;&#24211;&#65292;&#25552;&#20379;&#20102;&#29616;&#26377;&#25991;&#29486;&#30340;&#20840;&#38754;&#27010;&#36848;&#12290;&#36890;&#36807;&#35745;&#37327;&#20998;&#26512;&#65292;&#30740;&#31350;&#35843;&#26597;&#20102;&#20803;&#25968;&#25454;&#20013;&#30340;&#22269;&#23478;&#12289;&#20316;&#32773;&#12289;&#24341;&#29992;&#12289;&#20851;&#38190;&#35789;&#12289;&#23398;&#31185;&#39046;&#22495;&#21644;&#25991;&#31456;&#20027;&#39064;&#65292;&#20197;&#25552;&#20379;&#39069;&#22806;&#30340;&#32972;&#26223;&#20449;&#24687;&#12290;&#22312;&#23545;30&#31687;&#36873;&#23450;&#35770;&#25991;&#30340;&#28145;&#20837;&#20998;&#26512;&#20013;&#65292;
&lt;/p&gt;
&lt;p&gt;
Sustainable supply chain management is a key objective of Industry 5.0, leveraging technologies like real-time data analytics, connectivity, and intelligent automation. At the same time, composite materials present benefits such as lightweight structures, crucial for reducing fuel consumption. This study investigates the intersection between sustainable supply chains and composites by analyzing the current status, research gaps, methodologies, and future research opportunities through bibliometric analysis and a systematic review of the state of the art in the composite materials supply chain. A systematic literature review approach is employed to analyze the Scopus and Web of Science (WOS) databases, offering a comprehensive overview of the existing literature. Through bibliometric analysis, the study investigates countries, authors, citations, keywords, subject areas, and article themes within the metadata to provide additional context. An in-depth analysis of thirty selected papers 
&lt;/p&gt;</description></item><item><title>&#20256;&#32479;&#30340;&#22522;&#20110;&#30456;&#20851;&#24615;&#30340;&#39118;&#38505;&#35780;&#20272;&#26041;&#27861;&#22312;&#24066;&#22330;&#27874;&#21160;&#21644;&#22806;&#37096;&#20914;&#20987;&#19979;&#38590;&#20197;&#24212;&#23545;&#65292;&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;Causal-NECO VaR&#30340;&#22240;&#26524;&#32593;&#32476;&#20256;&#26579;&#39118;&#38505;&#20215;&#20540;&#35780;&#20272;&#26041;&#27861;&#65292;&#23427;&#33021;&#22815;&#20174;&#35266;&#27979;&#25968;&#25454;&#20013;&#25512;&#23548;&#36164;&#20135;&#20043;&#38388;&#30340;&#26041;&#21521;&#24615;&#24433;&#21709;&#65292;&#25552;&#20379;&#31283;&#20581;&#30340;&#39118;&#38505;&#39044;&#27979;&#12290;</title><link>https://arxiv.org/abs/2402.06032</link><description>&lt;p&gt;
&#24212;&#23545;&#24066;&#22330;&#21160;&#33633;&#65306;&#22240;&#26524;&#32593;&#32476;&#20256;&#26579;&#39118;&#38505;&#20215;&#20540;&#35780;&#20272;&#30340;&#27934;&#23519;
&lt;/p&gt;
&lt;p&gt;
Navigating Market Turbulence: Insights from Causal Network Contagion Value at Risk
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.06032
&lt;/p&gt;
&lt;p&gt;
&#20256;&#32479;&#30340;&#22522;&#20110;&#30456;&#20851;&#24615;&#30340;&#39118;&#38505;&#35780;&#20272;&#26041;&#27861;&#22312;&#24066;&#22330;&#27874;&#21160;&#21644;&#22806;&#37096;&#20914;&#20987;&#19979;&#38590;&#20197;&#24212;&#23545;&#65292;&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;Causal-NECO VaR&#30340;&#22240;&#26524;&#32593;&#32476;&#20256;&#26579;&#39118;&#38505;&#20215;&#20540;&#35780;&#20272;&#26041;&#27861;&#65292;&#23427;&#33021;&#22815;&#20174;&#35266;&#27979;&#25968;&#25454;&#20013;&#25512;&#23548;&#36164;&#20135;&#20043;&#38388;&#30340;&#26041;&#21521;&#24615;&#24433;&#21709;&#65292;&#25552;&#20379;&#31283;&#20581;&#30340;&#39118;&#38505;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20934;&#30830;&#23450;&#20041;&#12289;&#34913;&#37327;&#21644;&#32531;&#35299;&#39118;&#38505;&#26159;&#37329;&#34701;&#39118;&#38505;&#31649;&#29702;&#30340;&#22522;&#30707;&#65292;&#23588;&#20854;&#26159;&#22312;&#37329;&#34701;&#20256;&#26579;&#23384;&#22312;&#30340;&#24773;&#20917;&#19979;&#12290;&#20256;&#32479;&#30340;&#22522;&#20110;&#30456;&#20851;&#24615;&#30340;&#39118;&#38505;&#35780;&#20272;&#26041;&#27861;&#22312;&#24066;&#22330;&#27874;&#21160;&#26465;&#20214;&#19979;&#24120;&#24120;&#38590;&#20197;&#24212;&#23545;&#65292;&#29305;&#21035;&#26159;&#38754;&#23545;&#22806;&#37096;&#20914;&#20987;&#26102;&#65292;&#20984;&#26174;&#20102;&#23545;&#26356;&#24378;&#22823;&#21644;&#19981;&#21464;&#30340;&#39044;&#27979;&#26041;&#27861;&#30340;&#38656;&#27714;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;&#22240;&#26524;&#32593;&#32476;&#20256;&#26579;&#39118;&#38505;&#20215;&#20540;&#35780;&#20272;&#65288;Causal-NECO VaR&#65289;&#30340;&#26032;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22312;&#37329;&#34701;&#39118;&#38505;&#20998;&#26512;&#20013;&#26174;&#33879;&#25512;&#36827;&#20102;&#22240;&#26524;&#25512;&#26029;&#12290;&#36825;&#31181;&#26041;&#27861;&#37319;&#29992;&#22240;&#26524;&#32593;&#32476;&#26694;&#26550;&#65292;&#24039;&#22937;&#22320;&#25429;&#25417;&#24182;&#20998;&#26512;&#27874;&#21160;&#25928;&#24212;&#21644;&#28322;&#20986;&#25928;&#24212;&#65292;&#26377;&#25928;&#22320;&#20351;&#20854;&#19982;&#20256;&#32479;&#30340;&#20256;&#26579;&#24615;VaR&#27169;&#22411;&#21306;&#21035;&#24320;&#26469;&#12290;Causal-NECO VaR&#30340;&#20851;&#38190;&#21019;&#26032;&#22312;&#20110;&#23427;&#33021;&#22815;&#20174;&#35266;&#27979;&#25968;&#25454;&#20013;&#25512;&#23548;&#36164;&#20135;&#20043;&#38388;&#30340;&#26041;&#21521;&#24615;&#24433;&#21709;&#65292;&#20174;&#32780;&#25552;&#20379;&#31283;&#20581;&#30340;&#39118;&#38505;&#39044;&#27979;&#65292;&#20351;&#20854;&#23545;&#24066;&#22330;&#20914;&#20987;&#21644;&#31995;&#32479;&#21464;&#21270;&#20445;&#25345;&#19981;&#21464;&#12290;
&lt;/p&gt;
&lt;p&gt;
Accurately defining, measuring and mitigating risk is a cornerstone of financial risk management, especially in the presence of financial contagion. Traditional correlation-based risk assessment methods often struggle under volatile market conditions, particularly in the face of external shocks, highlighting the need for a more robust and invariant predictive approach.   This paper introduces the Causal Network Contagion Value at Risk (Causal-NECO VaR), a novel methodology that significantly advances causal inference in financial risk analysis. Embracing a causal network framework, this method adeptly captures and analyses volatility and spillover effects, effectively setting it apart from conventional contagion-based VaR models. Causal-NECO VaR's key innovation lies in its ability to derive directional influences among assets from observational data, thereby offering robust risk predictions that remain invariant to market shocks and systemic changes.   A comprehensive simulation study
&lt;/p&gt;</description></item><item><title>&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#21487;&#20197;&#26174;&#33879;&#36129;&#29486;&#20110;&#31185;&#23398;&#21644;&#26356;&#24191;&#27867;&#30340;&#24433;&#21709;&#65292;&#24182;&#20419;&#36827;&#31185;&#23398;&#30340;&#36827;&#27493;&#12290;</title><link>https://arxiv.org/abs/2402.05024</link><description>&lt;p&gt;
&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#26159;&#21542;&#26377;&#21161;&#20110;&#26356;&#22823;&#30340;&#31185;&#23398;&#24433;&#21709;&#21147;&#65311;
&lt;/p&gt;
&lt;p&gt;
Does the Use of Unusual Combinations of Datasets Contribute to Greater Scientific Impact?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.05024
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#21487;&#20197;&#26174;&#33879;&#36129;&#29486;&#20110;&#31185;&#23398;&#21644;&#26356;&#24191;&#27867;&#30340;&#24433;&#21709;&#65292;&#24182;&#20419;&#36827;&#31185;&#23398;&#30340;&#36827;&#27493;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31185;&#23398;&#25968;&#25454;&#38598;&#22312;&#24403;&#20195;&#25968;&#25454;&#39537;&#21160;&#30740;&#31350;&#20013;&#36215;&#30528;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#65292;&#23427;&#20204;&#36890;&#36807;&#20419;&#36827;&#26032;&#27169;&#24335;&#21644;&#29616;&#35937;&#30340;&#21457;&#29616;&#65292;&#25512;&#21160;&#31185;&#23398;&#30340;&#36827;&#27493;&#12290;&#36825;&#31181;&#23545;&#23454;&#35777;&#30740;&#31350;&#30340;&#19981;&#26029;&#38656;&#27714;&#24341;&#21457;&#20102;&#20851;&#20110;&#22914;&#20309;&#22312;&#30740;&#31350;&#39033;&#30446;&#20013;&#25112;&#30053;&#24615;&#22320;&#21033;&#29992;&#25968;&#25454;&#20197;&#20419;&#36827;&#31185;&#23398;&#36827;&#27493;&#30340;&#37325;&#35201;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#22522;&#20110;&#37325;&#32452;&#29702;&#35770;&#25552;&#20986;&#20102;&#19968;&#20010;&#20551;&#35774;&#65292;&#21363;&#21019;&#26032;&#24615;&#22320;&#32452;&#21512;&#29616;&#26377;&#30693;&#35782;&#65292;&#21253;&#25324;&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#65292;&#21487;&#20197;&#23548;&#33268;&#39640;&#24433;&#21709;&#30340;&#21457;&#29616;&#12290;&#25105;&#20204;&#35843;&#26597;&#20102;&#36229;&#36807;30,000&#31687;&#25991;&#31456;&#20013;&#20351;&#29992;&#20102;&#36229;&#36807;6,000&#20010;&#25968;&#25454;&#38598;&#30340;&#31038;&#20250;&#31185;&#23398;&#25968;&#25454;&#24211;ICPSR&#20013;&#36825;&#31181;&#38750;&#20856;&#22411;&#25968;&#25454;&#32452;&#21512;&#30340;&#31185;&#23398;&#25104;&#26524;&#12290;&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#22235;&#20010;&#37325;&#35201;&#30340;&#35265;&#35299;&#12290;&#39318;&#20808;&#65292;&#32452;&#21512;&#25968;&#25454;&#38598;&#65292;&#29305;&#21035;&#26159;&#37027;&#20123;&#19981;&#24120;&#35265;&#30340;&#32452;&#21512;&#65292;&#23545;&#31185;&#23398;&#21644;&#26356;&#24191;&#27867;&#30340;&#24433;&#21709;&#65288;&#20363;&#22914;&#21521;&#19968;&#33324;&#20844;&#20247;&#20256;&#25773;&#65289;&#37117;&#26377;&#26174;&#33879;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;
Scientific datasets play a crucial role in contemporary data-driven research, as they allow for the progress of science by facilitating the discovery of new patterns and phenomena. This mounting demand for empirical research raises important questions on how strategic data utilization in research projects can stimulate scientific advancement. In this study, we examine the hypothesis inspired by the recombination theory, which suggests that innovative combinations of existing knowledge, including the use of unusual combinations of datasets, can lead to high-impact discoveries. We investigate the scientific outcomes of such atypical data combinations in more than 30,000 publications that leverage over 6,000 datasets curated within one of the largest social science databases, ICPSR. This study offers four important insights. First, combining datasets, particularly those infrequently paired, significantly contributes to both scientific and broader impacts (e.g., dissemination to the genera
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20998;&#26512;&#20102;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#24179;&#21488;&#19978;&#30340;&#20020;&#26102;&#25439;&#22833;&#38382;&#39064;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#20215;&#26684;&#21464;&#21160;&#19981;&#19968;&#23450;&#23548;&#33268;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#25439;&#22833;&#65292;&#20132;&#26131;&#32773;&#21644;&#22871;&#21033;&#32773;&#25903;&#20184;&#30340;&#36153;&#29992;&#21516;&#26679;&#37325;&#35201;&#12290;&#22312;&#22871;&#21033;&#21451;&#22909;&#30340;&#29615;&#22659;&#19979;&#65292;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#21463;&#30410;&#12290;</title><link>http://arxiv.org/abs/2401.07689</link><description>&lt;p&gt;
&#20020;&#26102;&#25439;&#22833;&#26465;&#20214;&#65306;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#24179;&#21488;&#30340;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Impermanent Loss Conditions: An Analysis of Decentralized Exchange Platforms. (arXiv:2401.07689v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.07689
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20998;&#26512;&#20102;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#24179;&#21488;&#19978;&#30340;&#20020;&#26102;&#25439;&#22833;&#38382;&#39064;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#20215;&#26684;&#21464;&#21160;&#19981;&#19968;&#23450;&#23548;&#33268;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#25439;&#22833;&#65292;&#20132;&#26131;&#32773;&#21644;&#22871;&#21033;&#32773;&#25903;&#20184;&#30340;&#36153;&#29992;&#21516;&#26679;&#37325;&#35201;&#12290;&#22312;&#22871;&#21033;&#21451;&#22909;&#30340;&#29615;&#22659;&#19979;&#65292;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#21463;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#26159;&#24191;&#27867;&#20351;&#29992;&#30340;&#21152;&#23494;&#36164;&#20135;&#20132;&#26131;&#24179;&#21488;&#12290;&#26368;&#24120;&#35265;&#30340;&#31867;&#22411;&#20351;&#29992;&#33258;&#21160;&#20570;&#24066;&#21830;&#65288;AMM&#65289;&#65292;&#20801;&#35768;&#20132;&#26131;&#32773;&#22312;&#19981;&#38656;&#35201;&#25214;&#21040;&#21305;&#37197;&#30340;&#20132;&#26131;&#23545;&#26041;&#30340;&#24773;&#20917;&#19979;&#20132;&#25442;&#36164;&#20135;&#12290;&#22240;&#27492;&#65292;&#20132;&#26131;&#32773;&#19982;&#30001;&#26234;&#33021;&#21512;&#32422;&#31649;&#29702;&#30340;&#36164;&#20135;&#20648;&#22791;&#36827;&#34892;&#20132;&#25442;&#12290;&#36825;&#20123;&#36164;&#20135;&#30001;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#25552;&#20379;&#65292;&#20197;&#25442;&#21462;&#36153;&#29992;&#12290;&#38745;&#24577;&#20998;&#26512;&#34920;&#26126;&#65292;&#20854;&#20013;&#19968;&#31181;&#36164;&#20135;&#30340;&#23567;&#24133;&#20215;&#26684;&#21464;&#21160;&#21487;&#33021;&#20250;&#23548;&#33268;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#36973;&#21463;&#25439;&#22833;&#12290;&#23613;&#31649;AMM&#21462;&#24471;&#20102;&#25104;&#21151;&#65292;&#20294;&#22768;&#31216;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#32463;&#24120;&#36973;&#21463;&#25439;&#22833;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#25991;&#29486;&#23545;&#38543;&#26102;&#38388;&#25512;&#31227;&#30340;&#36153;&#29992;&#21160;&#24577;&#25928;&#24212;&#27809;&#26377;&#20805;&#20998;&#32771;&#34385;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#20351;&#29992;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#30740;&#31350;&#20102;&#21160;&#24577;&#35774;&#32622;&#20013;&#30340;&#20020;&#26102;&#25439;&#22833;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#20215;&#26684;&#21464;&#21160;&#19981;&#19968;&#23450;&#23548;&#33268;&#25439;&#22833;&#12290;&#20132;&#26131;&#32773;&#21644;&#22871;&#21033;&#32773;&#25903;&#20184;&#30340;&#36153;&#29992;&#21516;&#26679;&#37325;&#35201;&#12290;&#22312;&#36825;&#26041;&#38754;&#65292;&#25105;&#20204;&#21487;&#20197;&#35777;&#26126;&#23545;&#22871;&#21033;&#21451;&#22909;&#30340;&#29615;&#22659;&#26377;&#30410;&#20110;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#12290;
&lt;/p&gt;
&lt;p&gt;
Decentralized exchanges are widely used platforms for trading crypto assets. The most common types work with automated market makers (AMM), allowing traders to exchange assets without needing to find matching counterparties. Thereby, traders exchange against asset reserves managed by smart contracts. These assets are provided by liquidity providers in exchange for a fee. Static analysis shows that small price changes in one of the assets can result in losses for liquidity providers. Despite the success of AMMs, it is claimed that liquidity providers often suffer losses. However, the literature does not adequately consider the dynamic effects of fees over time. Therefore, we investigate the impermanent loss problem in a dynamic setting using Monte Carlo simulations. Our findings indicate that price changes do not necessarily lead to losses. Fees paid by traders and arbitrageurs are equally important. In this respect, we can show that an arbitrage-friendly environment benefits the liquid
&lt;/p&gt;</description></item><item><title>&#22885;&#22320;&#21033;&#25512;&#20986;&#30340;&#20840;&#22269;KlimaTicket&#24265;&#20215;&#36890;&#31080;&#23545;&#20844;&#20849;&#20132;&#36890;&#38656;&#27714;&#20135;&#29983;&#20102;&#31245;&#24494;&#22686;&#38271;&#30340;&#30701;&#26399;&#24433;&#21709;&#65292;&#22312;COVID-19&#30123;&#24773;&#21518;&#30340;&#22686;&#38271;&#25928;&#24212;&#20855;&#26377;&#32479;&#35745;&#23398;&#24847;&#20041;&#12290;</title><link>http://arxiv.org/abs/2401.06835</link><description>&lt;p&gt;
&#22885;&#22320;&#21033;&#30340;KlimaTicket: &#35780;&#20272;&#24265;&#20215;&#20840;&#22269;&#26053;&#34892;&#36890;&#31080;&#23545;&#38656;&#27714;&#30340;&#30701;&#26399;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Austria's KlimaTicket: Assessing the short-term impact of a cheap nationwide travel pass on demand. (arXiv:2401.06835v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.06835
&lt;/p&gt;
&lt;p&gt;
&#22885;&#22320;&#21033;&#25512;&#20986;&#30340;&#20840;&#22269;KlimaTicket&#24265;&#20215;&#36890;&#31080;&#23545;&#20844;&#20849;&#20132;&#36890;&#38656;&#27714;&#20135;&#29983;&#20102;&#31245;&#24494;&#22686;&#38271;&#30340;&#30701;&#26399;&#24433;&#21709;&#65292;&#22312;COVID-19&#30123;&#24773;&#21518;&#30340;&#22686;&#38271;&#25928;&#24212;&#20855;&#26377;&#32479;&#35745;&#23398;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20943;&#23569;&#20132;&#36890;&#30456;&#20851;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30340;&#25514;&#26045;&#23545;&#25919;&#31574;&#21046;&#23450;&#32773;&#33267;&#20851;&#37325;&#35201;&#12290;&#26368;&#36817;&#30340;&#19968;&#20010;&#20363;&#23376;&#23601;&#26159;&#22885;&#22320;&#21033;&#30340;&#20840;&#22269;KlimaTicket&#65292;&#36825;&#26159;&#19968;&#20010;&#20132;&#36890;&#30456;&#20851;&#25490;&#25918;&#27604;&#20363;&#30456;&#23545;&#36739;&#39640;&#30340;&#22269;&#23478;&#12290;2021&#24180;10&#26376;&#24341;&#20837;&#30340;&#24265;&#20215;&#24180;&#31080;&#21487;&#26080;&#38480;&#21046;&#20351;&#29992;&#22885;&#22320;&#21033;&#30340;&#20844;&#20849;&#20132;&#36890;&#32593;&#32476;&#12290;&#25105;&#20351;&#29992;&#21512;&#25104;&#23545;&#29031;&#21644;&#21512;&#25104;&#24046;&#24322;&#27861;&#65292;&#36890;&#36807;&#26500;&#24314;&#22522;&#20110;&#27431;&#27954;&#38081;&#36335;&#20844;&#21496;&#30340;&#25968;&#25454;&#39537;&#21160;&#23545;&#27604;&#20107;&#23454;&#65292;&#27169;&#25311;&#22312;&#27809;&#26377;KlimaTicket&#30340;&#24773;&#20917;&#19979;&#22885;&#22320;&#21033;&#32852;&#37030;&#38081;&#36335;&#30340;&#20056;&#23458;&#25968;&#37327;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#19982;&#27809;&#26377;KlimaTicket&#30340;&#24773;&#20917;&#30456;&#27604;&#65292;&#22885;&#22320;&#21033;&#30340;&#20844;&#20849;&#20132;&#36890;&#38656;&#27714;&#22686;&#38271;&#36895;&#24230;&#31245;&#24555;&#65292;&#21363;&#22686;&#38271;&#20102;3.3&#25110;6.8&#20010;&#30334;&#20998;&#28857;&#65292;&#20855;&#20307;&#21462;&#20915;&#20110;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#22312;COVID-19&#30123;&#24773;&#21518;&#30340;&#22686;&#38271;&#25928;&#24212;&#21482;&#26377;&#22312;&#24212;&#29992;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#26102;&#25165;&#20855;&#26377;&#32479;&#35745;&#23398;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
Measures to reduce transport-related greenhouse gas emissions are of great importance to policy-makers. A recent example is the nationwide KlimaTicket in Austria, a country with a relatively high share of transport-related emissions. The cheap yearly season ticket introduced in October 2021 allows unlimited access to Austria's public transport network. Using the synthetic control and synthetic difference-in-differences methods, I assess the causal effect of this policy on public transport demand by constructing a data-driven counterfactual out of European railway companies to mimic the number of passengers of the Austrian Federal Railways without the KlimaTicket. The results indicate public transport demand grew slightly faster in Austria, i.e., 3.3 or 6.8 percentage points, depending on the method, than it would have in the absence of the KlimaTicket. However, the growth effect after the COVID-19 pandemic appears only statistically significant when applying the synthetic control metho
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21457;&#29616;&#22312;&#25919;&#27835;&#20809;&#35889;&#19978;&#65292;&#25919;&#20826;&#24847;&#35782;&#24418;&#24577;&#19982;&#27169;&#31946;&#24615;&#20043;&#38388;&#23384;&#22312;&#30528;&#24378;&#28872;&#30340;&#38750;&#21333;&#35843;&#20851;&#31995;&#12290;&#20013;&#38388;&#27966;&#25919;&#20826;&#30456;&#27604;&#26497;&#31471;&#20027;&#20041;&#25919;&#20826;&#34987;&#36873;&#27665;&#35270;&#20026;&#39118;&#38505;&#36739;&#23567;&#65292;&#22240;&#27492;&#23427;&#20204;&#26356;&#23481;&#26131;&#21033;&#29992;&#27169;&#31946;&#24615;&#21560;&#24341;&#26356;&#22810;&#36873;&#27665;&#12290;&#36825;&#19968;&#32467;&#35770;&#24471;&#21040;&#20102;&#36873;&#20030;&#32467;&#26524;&#21644;&#21508;&#20010;&#25919;&#20826;&#25152;&#22312;&#22269;&#23478;&#30340;&#32463;&#27982;&#25351;&#26631;&#30340;&#25903;&#25345;&#12290;</title><link>http://arxiv.org/abs/2308.05912</link><description>&lt;p&gt;
&#24847;&#35782;&#24418;&#24577;&#27169;&#31946;&#19982;&#25919;&#27835;&#20809;&#35889;&#30340;&#20851;&#31995;
&lt;/p&gt;
&lt;p&gt;
Ideological Ambiguity and Political Spectrum. (arXiv:2308.05912v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.05912
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21457;&#29616;&#22312;&#25919;&#27835;&#20809;&#35889;&#19978;&#65292;&#25919;&#20826;&#24847;&#35782;&#24418;&#24577;&#19982;&#27169;&#31946;&#24615;&#20043;&#38388;&#23384;&#22312;&#30528;&#24378;&#28872;&#30340;&#38750;&#21333;&#35843;&#20851;&#31995;&#12290;&#20013;&#38388;&#27966;&#25919;&#20826;&#30456;&#27604;&#26497;&#31471;&#20027;&#20041;&#25919;&#20826;&#34987;&#36873;&#27665;&#35270;&#20026;&#39118;&#38505;&#36739;&#23567;&#65292;&#22240;&#27492;&#23427;&#20204;&#26356;&#23481;&#26131;&#21033;&#29992;&#27169;&#31946;&#24615;&#21560;&#24341;&#26356;&#22810;&#36873;&#27665;&#12290;&#36825;&#19968;&#32467;&#35770;&#24471;&#21040;&#20102;&#36873;&#20030;&#32467;&#26524;&#21644;&#21508;&#20010;&#25919;&#20826;&#25152;&#22312;&#22269;&#23478;&#30340;&#32463;&#27982;&#25351;&#26631;&#30340;&#25903;&#25345;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#25919;&#20826;&#24847;&#35782;&#24418;&#24577;&#19982;&#27169;&#31946;&#24615;&#22312;&#25919;&#27835;&#20809;&#35889;&#19978;&#30340;&#20851;&#31995;&#12290;&#25105;&#20204;&#22312;202&#20010;&#27431;&#27954;&#25919;&#20826;&#30340;&#26679;&#26412;&#20013;&#21457;&#29616;&#65292;&#25919;&#20826;&#24847;&#35782;&#24418;&#24577;&#19982;&#27169;&#31946;&#24615;&#20043;&#38388;&#23384;&#22312;&#30528;&#24378;&#28872;&#30340;&#38750;&#21333;&#35843;&#65288;&#20498;U&#22411;&#65289;&#20851;&#31995;&#12290;&#36825;&#31181;&#27169;&#24335;&#22312;&#25968;&#25454;&#25152;&#28085;&#30422;&#30340;&#25152;&#26377;&#24847;&#35782;&#24418;&#24577;&#32500;&#24230;&#19978;&#37117;&#26377;&#35266;&#23519;&#21040;&#12290;&#20026;&#20102;&#35299;&#37322;&#36825;&#31181;&#27169;&#24335;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#29702;&#35770;&#65292;&#35748;&#20026;&#30456;&#27604;&#26497;&#31471;&#20027;&#20041;&#25919;&#20826;&#65292;&#20013;&#38388;&#27966;&#25919;&#20826;&#34987;&#36873;&#27665;&#35270;&#20026;&#39118;&#38505;&#36739;&#23567;&#65292;&#22240;&#27492;&#22312;&#21033;&#29992;&#27169;&#31946;&#24615;&#21560;&#24341;&#26356;&#22810;&#36873;&#27665;&#26102;&#20855;&#26377;&#26356;&#22823;&#30340;&#20248;&#21183;&#12290;&#25105;&#20204;&#36890;&#36807;&#36873;&#20030;&#32467;&#26524;&#21644;&#21508;&#20010;&#25919;&#20826;&#25152;&#22312;&#22269;&#23478;&#30340;&#32463;&#27982;&#25351;&#26631;&#25552;&#20379;&#20102;&#39069;&#22806;&#30340;&#35777;&#25454;&#26469;&#25903;&#25345;&#25105;&#20204;&#30340;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study examines the relationship between ambiguity and the ideological positioning of political parties across the political spectrum. We identify a strong non-monotonic (inverted U-shaped) relationship between party ideology and ambiguity within a sample of 202 European political parties. This pattern is observed across all ideological dimensions covered in the data. To explain this pattern, we propose a novel theory that suggests centrist parties are perceived as less risky by voters compared to extremist parties, giving them an advantage in employing ambiguity to attract more voters at a lower cost. We support our explanation with additional evidence from electoral outcomes and economic indicators in the respective party countries.
&lt;/p&gt;</description></item></channel></rss>