<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#22312;&#20960;&#20309;&#22343;&#20540;&#24066;&#22330; Maker &#20013;&#65292;&#36890;&#36807;&#26080;&#27169;&#22411;&#20877;&#24179;&#34913;&#31574;&#30053;&#21487;&#20197;&#23545;&#36229;&#32423;&#23545;&#20914;&#36827;&#34892;&#23545;&#20914;&#65292;&#32780;&#20132;&#25442;&#29575;&#26159;&#26377;&#38480;&#21464;&#21270;&#30340;&#65292;&#22240;&#27492;&#25439;&#22833;&#21487;&#20197;&#28040;&#22833;&#12290;</title><link>http://arxiv.org/abs/2303.11118</link><description>&lt;p&gt;
&#22312;&#20960;&#20309;&#22343;&#20540;&#24066;&#22330; Maker &#20013;&#26080;&#27169;&#22411;&#23545;&#19981;&#21487;&#36870;&#25439;&#22833;&#36827;&#34892;&#23545;&#20914;
&lt;/p&gt;
&lt;p&gt;
Model-free Hedging of Impermanent Loss in Geometric Mean Market Makers. (arXiv:2303.11118v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.11118
&lt;/p&gt;
&lt;p&gt;
&#22312;&#20960;&#20309;&#22343;&#20540;&#24066;&#22330; Maker &#20013;&#65292;&#36890;&#36807;&#26080;&#27169;&#22411;&#20877;&#24179;&#34913;&#31574;&#30053;&#21487;&#20197;&#23545;&#36229;&#32423;&#23545;&#20914;&#36827;&#34892;&#23545;&#20914;&#65292;&#32780;&#20132;&#25442;&#29575;&#26159;&#26377;&#38480;&#21464;&#21270;&#30340;&#65292;&#22240;&#27492;&#25439;&#22833;&#21487;&#20197;&#28040;&#22833;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#19968;&#31181;&#29305;&#27530;&#31867;&#22411;&#30340;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#8212;&#20960;&#20309;&#22343;&#20540;&#24066;&#22330; Maker&#65292;&#23427;&#26377;&#20004;&#31181;&#29992;&#25143;&#31867;&#22411;&#65306;&#27969;&#21160;&#24615;&#25509;&#21463;&#32773;&#21644;&#22871;&#21033;&#32773;&#12290;&#27969;&#21160;&#24615;&#25509;&#21463;&#32773;&#30340;&#20132;&#26131;&#20215;&#26684;&#21487;&#33021;&#20250;&#20135;&#29983;&#22871;&#21033;&#26426;&#20250;&#65292;&#32780;&#22871;&#21033;&#32773;&#21017;&#20250;&#23558;&#20132;&#26131;&#25152;&#20215;&#26684;&#19982;&#22806;&#37096;&#24066;&#22330;&#20215;&#26684;&#23545;&#40784;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#20960;&#20309;&#22343;&#20540;&#24066;&#22330; Maker &#20013;&#65292;&#36890;&#36807;&#26080;&#27169;&#22411;&#20877;&#24179;&#34913;&#31574;&#30053;&#21487;&#20197;&#23545;&#36229;&#32423;&#23545;&#20914;&#36827;&#34892;&#23545;&#20914;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#35777;&#26126;&#65292;&#22312;&#36825;&#26679;&#30340;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#20013;&#65292;&#20132;&#25442;&#29575;&#26159;&#26377;&#38480;&#21464;&#21270;&#30340;&#65292;&#25152;&#20197;&#25552;&#20379;&#27969;&#21160;&#24615;&#19982;&#30456;&#24212;&#30340;&#24120;&#25968;&#26435;&#37325;&#32452;&#21512;&#20043;&#38388;&#30340;&#25439;&#22833;&#21487;&#20197;&#28040;&#22833;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider Geometric Mean Market Makers -- a special type of Decentralized Exchange -- with two types of users: liquidity takers and arbitrageurs. Liquidity takers trade at prices that can create arbitrage opportunities, while arbitrageurs align the exchange's price with the external market price. We show that in Geometric Mean Market Makers charging proportional transaction fees, Impermanent Loss can be super-hedged by a model-free rebalancing strategy. Moreover, we demonstrate that in such a DEX, the exchange rate is of finite variation, so that loss-versus-rebalancing (the shortfall of providing liquidity versus the corresponding constant-weights portfolio) vanishes.
&lt;/p&gt;</description></item><item><title>&#19968;&#31181;&#26032;&#22411;&#21160;&#24577;&#32593;&#32476;&#33258;&#22238;&#24402;&#26465;&#20214;&#24322;&#26041;&#24046;(ARCH)&#27169;&#22411;&#34987;&#29992;&#20110;&#39044;&#27979;&#32654;&#22269;&#32929;&#24066;&#27874;&#21160;&#29575;&#65292;&#24182;&#21033;&#29992;&#26102;&#38388;&#28382;&#21518;&#27874;&#21160;&#29575;&#20449;&#24687;&#21644;&#30456;&#37051;&#33410;&#28857;&#30340;&#20449;&#24687;&#25552;&#39640;&#39044;&#27979;&#31934;&#24230;&#65292;&#29305;&#21035;&#36866;&#29992;&#20110;&#39640;&#32500;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2303.11064</link><description>&lt;p&gt;
&#32593;&#32476;&#26085;&#24535;ARCH&#27169;&#22411;&#39044;&#27979;&#32929;&#24066;&#27874;&#21160;&#24615;
&lt;/p&gt;
&lt;p&gt;
Network log-ARCH models for forecasting stock market volatility. (arXiv:2303.11064v1 [stat.AP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.11064
&lt;/p&gt;
&lt;p&gt;
&#19968;&#31181;&#26032;&#22411;&#21160;&#24577;&#32593;&#32476;&#33258;&#22238;&#24402;&#26465;&#20214;&#24322;&#26041;&#24046;(ARCH)&#27169;&#22411;&#34987;&#29992;&#20110;&#39044;&#27979;&#32654;&#22269;&#32929;&#24066;&#27874;&#21160;&#29575;&#65292;&#24182;&#21033;&#29992;&#26102;&#38388;&#28382;&#21518;&#27874;&#21160;&#29575;&#20449;&#24687;&#21644;&#30456;&#37051;&#33410;&#28857;&#30340;&#20449;&#24687;&#25552;&#39640;&#39044;&#27979;&#31934;&#24230;&#65292;&#29305;&#21035;&#36866;&#29992;&#20110;&#39640;&#32500;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#22411;&#30340;&#21160;&#24577;&#32593;&#32476;&#33258;&#22238;&#24402;&#26465;&#20214;&#24322;&#26041;&#24046;(ARCH)&#27169;&#22411;&#65292;&#22522;&#20110;&#26102;&#31354;ARCH&#27169;&#22411;&#65292;&#29992;&#20110;&#39044;&#27979;&#32654;&#22269;&#32929;&#24066;&#30340;&#27874;&#21160;&#29575;&#12290;&#35813;&#27169;&#22411;&#21033;&#29992;&#26102;&#38388;&#28382;&#21518;&#27874;&#21160;&#29575;&#20449;&#24687;&#21644;&#30456;&#37051;&#33410;&#28857;&#30340;&#20449;&#24687;&#25552;&#39640;&#20102;&#39044;&#27979;&#31934;&#24230;&#65292;&#29305;&#21035;&#36866;&#29992;&#20110;&#39640;&#32500;&#24773;&#20917;&#12290;&#26412;&#25991;&#27604;&#36739;&#20102;&#35813;&#26032;&#26041;&#27861;&#19982;&#29420;&#31435;&#30340;&#21333;&#21464;&#37327;&#23545;&#25968;ARCH&#27169;&#22411;&#30340;&#25928;&#26524;&#65292;&#24182;&#37327;&#21270;&#20102;&#30001;&#20110;&#30636;&#26102;&#32593;&#32476;ARCH&#25928;&#24212;&#30340;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a novel dynamic network autoregressive conditional heteroscedasticity (ARCH) model based on spatiotemporal ARCH models to forecast volatility in the US stock market. To improve the forecasting accuracy, the model integrates temporally lagged volatility information and information from adjacent nodes, which may instantaneously spill across the entire network. The model is also suitable for high-dimensional cases where multivariate ARCH models are typically no longer applicable. We adopt the theoretical foundations from spatiotemporal statistics and transfer the dynamic ARCH model for processes to networks. This new approach is compared with independent univariate log-ARCH models. We could quantify the improvements due to the instantaneous network ARCH effects, which are studied for the first time in this paper. The edges are determined based on various distance and correlation measures between the time series. The performances of the alternative networks' definitions
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22269;&#38469;&#20892;&#20135;&#21697;&#26399;&#36135;&#21644;&#29616;&#36135;&#24066;&#22330;&#30340;&#39118;&#38505;&#28322;&#20986;&#25928;&#24212;&#65292;&#32467;&#26524;&#34920;&#26126;&#27599;&#20010;&#20892;&#20135;&#21697;&#26399;&#36135;&#24066;&#22330;&#23545;&#29616;&#36135;&#24066;&#22330;&#37117;&#26377;&#26174;&#33879;&#30340;&#26497;&#31471;&#39118;&#38505;&#28322;&#20986;&#25928;&#24212;&#65292;&#32780;&#22823;&#35910;&#21644;&#29577;&#31859;&#30340;&#19979;&#34892;&#39118;&#38505;&#28322;&#20986;&#25928;&#24212;&#26174;&#33879;&#24378;&#20110;&#30456;&#24212;&#30340;&#19978;&#34892;&#39118;&#38505;&#28322;&#20986;&#25928;&#24212;&#65292;&#20026;&#21046;&#23450;&#20840;&#29699;&#31918;&#39135;&#36152;&#26131;&#25919;&#31574;&#25552;&#20379;&#20102;&#29702;&#35770;&#22522;&#30784;&#12290;</title><link>http://arxiv.org/abs/2303.11030</link><description>&lt;p&gt;
&#22269;&#38469;&#20892;&#20135;&#21697;&#26399;&#36135;&#21644;&#29616;&#36135;&#24066;&#22330;&#30340;&#23614;&#37096;&#20381;&#36182;&#32467;&#26500;&#21644;&#26497;&#31471;&#39118;&#38505;&#28322;&#20986;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
Tail dependence structure and extreme risk spillover effects between the international agricultural futures and spot markets. (arXiv:2303.11030v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.11030
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22269;&#38469;&#20892;&#20135;&#21697;&#26399;&#36135;&#21644;&#29616;&#36135;&#24066;&#22330;&#30340;&#39118;&#38505;&#28322;&#20986;&#25928;&#24212;&#65292;&#32467;&#26524;&#34920;&#26126;&#27599;&#20010;&#20892;&#20135;&#21697;&#26399;&#36135;&#24066;&#22330;&#23545;&#29616;&#36135;&#24066;&#22330;&#37117;&#26377;&#26174;&#33879;&#30340;&#26497;&#31471;&#39118;&#38505;&#28322;&#20986;&#25928;&#24212;&#65292;&#32780;&#22823;&#35910;&#21644;&#29577;&#31859;&#30340;&#19979;&#34892;&#39118;&#38505;&#28322;&#20986;&#25928;&#24212;&#26174;&#33879;&#24378;&#20110;&#30456;&#24212;&#30340;&#19978;&#34892;&#39118;&#38505;&#28322;&#20986;&#25928;&#24212;&#65292;&#20026;&#21046;&#23450;&#20840;&#29699;&#31918;&#39135;&#36152;&#26131;&#25919;&#31574;&#25552;&#20379;&#20102;&#29702;&#35770;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23558;Copula-CoVaR&#26041;&#27861;&#19982;ARMA-GARCH-&#20559;&#24577;&#23398;&#29983;t&#27169;&#22411;&#30456;&#32467;&#21512;&#65292;&#20197;&#22823;&#35910;&#12289;&#29577;&#31859;&#12289;&#23567;&#40614;&#21644;&#31291;&#31859;&#20026;&#20363;&#65292;&#30740;&#31350;&#22269;&#38469;&#20892;&#20135;&#21697;&#26399;&#36135;&#21644;&#29616;&#36135;&#24066;&#22330;&#20043;&#38388;&#30340;&#23614;&#37096;&#20381;&#36182;&#32467;&#26500;&#21644;&#26497;&#31471;&#39118;&#38505;&#28322;&#20986;&#25928;&#24212;&#12290;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;&#22235;&#20010;&#26399;&#36135;-&#29616;&#36135;&#23545;&#30340;&#23614;&#37096;&#20381;&#36182;&#32467;&#26500;&#24046;&#24322;&#24456;&#22823;&#65292;&#32780;&#19988;&#27599;&#20010;&#32467;&#26500;&#37117;&#34920;&#29616;&#20986;&#19968;&#23450;&#30340;&#19981;&#23545;&#31216;&#24615;&#12290;&#27492;&#22806;&#65292;&#27599;&#31181;&#20892;&#20135;&#21697;&#30340;&#26399;&#36135;&#24066;&#22330;&#23545;&#29616;&#36135;&#24066;&#22330;&#37117;&#26377;&#26174;&#33879;&#21644;&#31283;&#20581;&#30340;&#26497;&#31471;&#39118;&#38505;&#28322;&#20986;&#25928;&#24212;&#12290;&#32780;&#19988;&#22823;&#35910;&#21644;&#29577;&#31859;&#30340;&#19979;&#34892;&#39118;&#38505;&#28322;&#20986;&#25928;&#24212;&#26174;&#33879;&#24378;&#20110;&#20854;&#30456;&#24212;&#30340;&#19978;&#34892;&#39118;&#38505;&#28322;&#20986;&#25928;&#24212;&#65292;&#32780;&#23567;&#40614;&#21644;&#31291;&#31859;&#30340;&#20004;&#20010;&#39118;&#38505;&#28322;&#20986;&#25928;&#24212;&#20043;&#38388;&#27809;&#26377;&#26174;&#33879;&#30340;&#24378;&#24230;&#24046;&#24322;&#12290;&#26412;&#30740;&#31350;&#20026;&#21152;&#24378;&#20840;&#29699;&#31918;&#39135;&#36152;&#26131;&#25919;&#31574;&#30340;&#21046;&#23450;&#25552;&#20379;&#20102;&#29702;&#35770;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper combines the Copula-CoVaR approach with the ARMA-GARCH-skewed Student-t model to investigate the tail dependence structure and extreme risk spillover effects between the international agricultural futures and spot markets, taking four main agricultural commodities, namely soybean, maize, wheat, and rice as examples. The empirical results indicate that the tail dependence structures for the four futures-spot pairs are quite different, and each of them exhibits a certain degree of asymmetry. In addition, the futures market for each agricultural commodity has significant and robust extreme downside and upside risk spillover effects on the spot market, and the downside risk spillover effects for both soybeans and maize are significantly stronger than their corresponding upside risk spillover effects, while there is no significant strength difference between the two risk spillover effects for wheat, and rice. This study provides a theoretical basis for strengthening global food c
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25506;&#35752;&#20102;&#24433;&#21709;&#39118;&#38505;&#25237;&#36164;&#22522;&#37329;&#22238;&#25253;&#21644;&#26368;&#20339;&#25237;&#36164;&#32452;&#21512;&#35268;&#27169;&#30340;&#19981;&#21516;&#22240;&#32032;&#65292;&#36825;&#26159;&#19968;&#20010;&#28041;&#21450;&#22810;&#31181;&#22240;&#32032;&#30340;&#26102;&#24120;&#20105;&#35758;&#35805;&#39064;&#65292;&#24456;&#38590;&#25214;&#21040;&#19968;&#20010;&#36866;&#29992;&#20110;&#25152;&#26377;&#24773;&#20917;&#30340;&#36890;&#29992;&#20844;&#24335;&#12290;</title><link>http://arxiv.org/abs/2303.11013</link><description>&lt;p&gt;
&#39118;&#38505;&#25237;&#36164;&#25237;&#36164;&#32452;&#21512;&#26500;&#24314;&#21450;&#24433;&#21709;&#26368;&#20339;&#31574;&#30053;&#30340;&#20027;&#35201;&#22240;&#32032;
&lt;/p&gt;
&lt;p&gt;
Venture Capital Portfolio Construction and the Main Factors Impacting the Optimal Strategy. (arXiv:2303.11013v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.11013
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25506;&#35752;&#20102;&#24433;&#21709;&#39118;&#38505;&#25237;&#36164;&#22522;&#37329;&#22238;&#25253;&#21644;&#26368;&#20339;&#25237;&#36164;&#32452;&#21512;&#35268;&#27169;&#30340;&#19981;&#21516;&#22240;&#32032;&#65292;&#36825;&#26159;&#19968;&#20010;&#28041;&#21450;&#22810;&#31181;&#22240;&#32032;&#30340;&#26102;&#24120;&#20105;&#35758;&#35805;&#39064;&#65292;&#24456;&#38590;&#25214;&#21040;&#19968;&#20010;&#36866;&#29992;&#20110;&#25152;&#26377;&#24773;&#20917;&#30340;&#36890;&#29992;&#20844;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39118;&#38505;&#25237;&#36164;&#65288;VC&#65289;&#22522;&#37329;&#30340;&#26368;&#20339;&#25237;&#36164;&#32452;&#21512;&#35268;&#27169;&#24448;&#24448;&#26159;&#19968;&#20010;&#22791;&#21463;&#20105;&#35758;&#30340;&#35805;&#39064;&#65292;&#20294;&#24182;&#19981;&#23384;&#22312;&#26368;&#20339;&#31574;&#30053;&#30340;&#20849;&#35782;&#12290;&#36825;&#26159;&#22240;&#20026;&#23427;&#28041;&#21450;&#22810;&#31181;&#22240;&#32032;&#12290;&#24456;&#38590;&#25214;&#21040;&#19968;&#20010;&#36866;&#29992;&#20110;&#25152;&#26377;&#24773;&#20917;&#30340;&#36890;&#29992;&#20844;&#24335;&#65292;&#23427;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#21462;&#20915;&#20110;&#22522;&#37329;&#30340;&#30446;&#26631;&#12290;&#22312;&#26412;&#25253;&#21578;&#20013;&#65292;&#25105;&#20204;&#23558;&#36880;&#27493;&#36890;&#36807;&#30740;&#31350;&#19981;&#21516;&#22240;&#32032;&#65292;&#20174;&#19968;&#20123;&#22522;&#26412;&#20551;&#35774;&#24320;&#22987;&#65292;&#28982;&#21518;&#22686;&#21152;&#27169;&#22411;&#30340;&#22797;&#26434;&#24615;&#26469;&#25506;&#35752;&#23427;&#20204;&#22914;&#20309;&#24433;&#21709;&#22522;&#37329;&#22238;&#25253;&#21644;&#26368;&#20339;&#25237;&#36164;&#32452;&#21512;&#35268;&#27169;&#12290;
&lt;/p&gt;
&lt;p&gt;
The optimal portfolio size for a venture capital (VC) fund is a topic often debated, but there is no consensus on the best strategy. This is because it is a function of many factors. It is not easy to find a general formula that can be applied to all situations, and it largely depends on the goal of the fund. In this report, we will go through the different factors step by step, studying how they affect fund returns and the optimal portfolio size, starting with some basic assumptions and then increasing the complexity of the model.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#26088;&#22312;&#20102;&#35299;&#36130;&#21153;&#32467;&#26500;&#23545;&#20869;&#32599;&#27605;&#35777;&#21048;&#20132;&#26131;&#25152;&#19978;&#24066;&#30340;&#38750;&#37329;&#34701;&#20844;&#21496;&#30340;&#36130;&#21153;&#22686;&#38271;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2303.10910</link><description>&lt;p&gt;
&#38750;&#37329;&#34701;&#20844;&#21496;&#30340;&#36130;&#21153;&#32467;&#26500;&#12289;&#20844;&#21496;&#35268;&#27169;&#21644;&#36130;&#21153;&#22686;&#38271;&#65306;&#20197;&#20869;&#32599;&#27605;&#35777;&#21048;&#20132;&#26131;&#25152;&#19978;&#24066;&#20844;&#21496;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
Financial Structure, Firm Size and Financial Growth of Non-Financial Firms Listed at the Nairobi Securities Exchange. (arXiv:2303.10910v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10910
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26088;&#22312;&#20102;&#35299;&#36130;&#21153;&#32467;&#26500;&#23545;&#20869;&#32599;&#27605;&#35777;&#21048;&#20132;&#26131;&#25152;&#19978;&#24066;&#30340;&#38750;&#37329;&#34701;&#20844;&#21496;&#30340;&#36130;&#21153;&#22686;&#38271;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20869;&#32599;&#27605;&#35777;&#21048;&#20132;&#26131;&#25152;&#19978;&#24066;&#30340;&#22823;&#37327;&#38750;&#37329;&#34701;&#20844;&#21496;&#30340;&#36130;&#21153;&#34920;&#29616;&#21644;&#36130;&#21153;&#22686;&#38271;&#19968;&#30452;&#22312;&#19979;&#38477;&#65292;&#36825;&#38459;&#30861;&#20102;&#25237;&#36164;&#32773;&#23545;&#36825;&#26679;&#30340;&#20844;&#21496;&#30340;&#25237;&#36164;&#12290;&#22240;&#27492;&#65292;&#36825;&#39033;&#30740;&#31350;&#26088;&#22312;&#30830;&#23450;&#36130;&#21153;&#32467;&#26500;&#23545;&#20869;&#32599;&#27605;&#35777;&#21048;&#20132;&#26131;&#25152;&#19978;&#24066;&#38750;&#37329;&#34701;&#20844;&#21496;&#30340;&#36130;&#21153;&#22686;&#38271;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
A significant number of the non-financial firms listed at the Nairobi Securities Exchange have been experiencing declining financial performance and financial growth, which deter investors from investing in such firms. Hence, the study aimed at establishing the effect of financial structure on the financial growth of non-financial firms listed at the Nairobi Securities Exchange.
&lt;/p&gt;</description></item><item><title>&#21457;&#24067;&#32773;&#22312;&#36861;&#36394;&#29992;&#25143;&#26102;&#20026;&#24191;&#21578;&#24102;&#26469;&#30340;&#25910;&#30410;&#23558;&#22823;&#24133;&#19979;&#38477;&#65292;&#23545;&#22823;&#22810;&#25968;&#21457;&#24067;&#32773;&#26469;&#35828;&#65292;&#29992;&#25143;&#36861;&#36394;&#38480;&#21046;&#20250;&#20351;&#20215;&#26684;&#38477;&#20302;&#65292;&#25552;&#20379;&#24191;&#27867;&#20869;&#23481;&#30340;&#21457;&#24067;&#32773;&#21463;&#24433;&#21709;&#26368;&#22823;&#12290;</title><link>http://arxiv.org/abs/2303.10906</link><description>&lt;p&gt;
&#21457;&#24067;&#32773;&#29992;&#25143;&#36861;&#36394;&#30340;&#32463;&#27982;&#20215;&#20540;
&lt;/p&gt;
&lt;p&gt;
The Economic Value of User Tracking for Publishers. (arXiv:2303.10906v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10906
&lt;/p&gt;
&lt;p&gt;
&#21457;&#24067;&#32773;&#22312;&#36861;&#36394;&#29992;&#25143;&#26102;&#20026;&#24191;&#21578;&#24102;&#26469;&#30340;&#25910;&#30410;&#23558;&#22823;&#24133;&#19979;&#38477;&#65292;&#23545;&#22823;&#22810;&#25968;&#21457;&#24067;&#32773;&#26469;&#35828;&#65292;&#29992;&#25143;&#36861;&#36394;&#38480;&#21046;&#20250;&#20351;&#20215;&#26684;&#38477;&#20302;&#65292;&#25552;&#20379;&#24191;&#27867;&#20869;&#23481;&#30340;&#21457;&#24067;&#32773;&#21463;&#24433;&#21709;&#26368;&#22823;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20026;&#20102;&#20445;&#25252;&#29992;&#25143;&#30340;&#22312;&#32447;&#38544;&#31169;&#65292;&#30417;&#31649;&#26426;&#26500;&#21644;&#27983;&#35272;&#22120;&#36234;&#26469;&#36234;&#38480;&#21046;&#29992;&#25143;&#36861;&#36394;&#12290;&#36825;&#31181;&#38480;&#21046;&#23545;&#21334;&#24191;&#21578;&#31354;&#38388;&#20197;&#36164;&#21161;&#19994;&#21153;&#12289;&#21253;&#25324;&#20869;&#23481;&#30340;&#21457;&#24067;&#32773;&#26377;&#32463;&#27982;&#24433;&#21709;&#12290;&#26681;&#25454;&#23545;111&#23478;&#21457;&#34892;&#21830;&#28041;&#21450;4200&#19975;&#27425;&#24191;&#21578;&#23637;&#31034;&#30340;&#20998;&#26512;&#65292;&#24403;&#29992;&#25143;&#36861;&#36394;&#19981;&#21487;&#29992;&#26102;&#65292;&#21457;&#24067;&#32773;&#20026;&#24191;&#21578;&#23637;&#31034;&#25152;&#25910;&#21040;&#30340;&#21407;&#22987;&#20215;&#26684;&#19979;&#38477;&#20102;&#32422;60&#65285;&#12290;&#22312;&#25511;&#21046;&#29992;&#25143;&#12289;&#24191;&#21578;&#21830;&#21644;&#21457;&#24067;&#32773;&#30340;&#24046;&#24322;&#21518;&#65292;&#36825;&#31181;&#19979;&#38477;&#20173;&#28982;&#24456;&#22823;&#65292;&#20026;18&#65285;&#12290;&#36229;&#36807;90&#65285;&#30340;&#21457;&#24067;&#32773;&#24863;&#21040;&#24403;&#20182;&#20204;&#26080;&#27861;&#36827;&#34892;&#29992;&#25143;&#36861;&#36394;&#26102;&#65292;&#20215;&#26684;&#21464;&#20302;&#12290;&#25552;&#20379;&#24191;&#27867;&#20869;&#23481;&#30340;&#21457;&#24067;&#32773;&#65288;&#22914;&#26032;&#38395;&#32593;&#31449;&#65289;&#27604;&#25552;&#20379;&#20027;&#39064;&#20869;&#23481;&#30340;&#21457;&#24067;&#32773;&#26356;&#21463;&#29992;&#25143;&#36861;&#36394;&#38480;&#21046;&#30340;&#24433;&#21709;&#12290;&#25910;&#38598;&#29992;&#25143;&#27983;&#35272;&#21382;&#21490;&#35760;&#24405;&#34987;&#35748;&#20026;&#26222;&#36941;&#20855;&#26377;&#20405;&#20837;&#24615;&#65292;&#23545;&#21457;&#24067;&#32773;&#30340;&#20215;&#20540;&#24494;&#19981;&#36275;&#36947;&#12290;&#36825;&#20123;&#32467;&#26524;&#35777;&#23454;&#20102;&#20445;&#25252;&#29992;&#25143;&#22312;&#32447;&#38544;&#31169;&#23558;&#23545;&#21457;&#24067;&#32773;&#30340;&#32463;&#27982;&#21033;&#30410;&#20135;&#29983;&#37325;&#22823;&#24433;&#21709;&#30340;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
Regulators and browsers increasingly restrict user tracking to protect users privacy online. Such restrictions also have economic implications for publishers that rely on selling advertising space to finance their business, including their content. According to an analysis of 42 million ad impressions related to 111 publishers, when user tracking is unavailable, the raw price paid to publishers for ad impressions decreases by about -60%. After controlling for differences in users, advertisers, and publishers, this decrease remains substantial, at -18%. More than 90% of the publishers realize lower prices when prevented from engaging in user tracking. Publishers offering broad content, such as news websites, suffer more from user tracking restrictions than publishers with thematically focused content. Collecting a users browsing history, perceived as generally intrusive to most users, generates negligible value for publishers. These results affirm the prediction that ensuring user priva
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19977;&#31181;&#31867;&#20284;&#20110;&#20915;&#31574;&#24066;&#22330;&#30340;&#26426;&#21046;&#65292;&#37319;&#29992;&#30830;&#23450;&#24615;&#20915;&#31574;&#35268;&#21017;&#65292;&#36991;&#20813;&#20102;&#38543;&#26426;&#20915;&#31574;&#35268;&#21017;&#21487;&#33021;&#23548;&#33268;&#27425;&#20248;&#20915;&#31574;&#30340;&#38382;&#39064;&#12290;&#36825;&#20123;&#26426;&#21046;&#20445;&#25345;&#20102;&#28608;&#21169;&#20860;&#23481;&#24615;&#65292;&#24182;&#37319;&#29992;&#20195;&#29702;&#26041;&#27861;&#35780;&#20272;&#39044;&#27979;&#12290;</title><link>http://arxiv.org/abs/2303.10857</link><description>&lt;p&gt;
&#20915;&#31574;&#24066;&#22330;&#20013;&#36991;&#20813;&#20351;&#29992;&#38543;&#26426;&#20915;&#31574;&#35268;&#21017;&#30340;&#25237;&#24433;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Proxy Forecasting to Avoid Stochastic Decision Rules in Decision Markets. (arXiv:2303.10857v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10857
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19977;&#31181;&#31867;&#20284;&#20110;&#20915;&#31574;&#24066;&#22330;&#30340;&#26426;&#21046;&#65292;&#37319;&#29992;&#30830;&#23450;&#24615;&#20915;&#31574;&#35268;&#21017;&#65292;&#36991;&#20813;&#20102;&#38543;&#26426;&#20915;&#31574;&#35268;&#21017;&#21487;&#33021;&#23548;&#33268;&#27425;&#20248;&#20915;&#31574;&#30340;&#38382;&#39064;&#12290;&#36825;&#20123;&#26426;&#21046;&#20445;&#25345;&#20102;&#28608;&#21169;&#20860;&#23481;&#24615;&#65292;&#24182;&#37319;&#29992;&#20195;&#29702;&#26041;&#27861;&#35780;&#20272;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20915;&#31574;&#20013;&#28041;&#21450;&#30340;&#20449;&#24687;&#36890;&#24120;&#26159;&#20998;&#24067;&#30340;&#65292;&#24182;&#30001;&#33258;&#21033;&#20195;&#29702;&#25345;&#26377;&#12290;&#20915;&#31574;&#24066;&#22330;&#21487;&#29992;&#20110;&#32858;&#21512;&#20449;&#24687;&#65292;&#20294;&#20381;&#36182;&#38543;&#26426;&#20915;&#31574;&#35268;&#21017;&#65292;&#23548;&#33268;&#26377;&#26102;&#24517;&#39035;&#37319;&#21462;&#27425;&#20248;&#34892;&#21160;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19977;&#31181;&#31867;&#20284;&#20110;&#20915;&#31574;&#24066;&#22330;&#30340;&#26426;&#21046;&#65292;&#20294;&#20351;&#29992;&#30830;&#23450;&#24615;&#20915;&#31574;&#35268;&#21017;&#65292;&#20855;&#26377;&#28608;&#21169;&#20860;&#23481;&#24615;&#12290;&#37319;&#29992;&#20195;&#29702;&#26041;&#27861;&#35780;&#20272;&#39044;&#27979;&#65292;&#32780;&#19981;&#26159;&#35266;&#23519;&#21040;&#30340;&#26410;&#26469;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
Information that is of relevance for decision-making is often distributed, and held by self-interested agents. Decision markets are well-suited mechanisms to elicit such information and aggregate it into conditional forecasts that can be used for decision-making. However, for incentive-compatible elicitation, decision markets rely on stochastic decision rules which entails that sometimes actions have to be taken that have been predicted to be sub-optimal. In this work, we propose three closely related mechanisms that elicit and aggregate information similar to a decision market, but are incentive compatible despite using a deterministic decision rule. Following ideas from peer prediction mechanisms, proxies rather than observed future outcomes are used to score predictions. The first mechanism requires the principal to have her own signal, which is then used as a proxy to elicit information from a group of self-interested agents. The principal then deterministically maps the aggregated
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#20975;&#24681;&#26031;&#20132;&#21449;&#27169;&#22411;&#65292;&#36890;&#36807;&#20998;&#26512;&#25919;&#24220;&#25903;&#20986;&#19982;&#32463;&#27982;&#22343;&#34913;&#29366;&#24577;&#20043;&#38388;&#30340;&#21160;&#24577;&#20851;&#31995;&#65292;&#20998;&#31867;&#19981;&#21516;&#25919;&#24220;&#25903;&#20986;&#24773;&#20917;&#19979;&#32463;&#27982;&#22343;&#34913;&#29366;&#24577;&#30340;&#31283;&#23450;&#24615;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#25919;&#24220;&#25903;&#20986;&#23545;&#22269;&#27665;&#32463;&#27982;&#20135;&#29983;&#26174;&#33879;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2303.10835</link><description>&lt;p&gt;
&#20975;&#24681;&#26031;&#20132;&#21449;&#27169;&#22411;&#30340;&#20998;&#23700;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Bifurcation analysis of the Keynesian cross model. (arXiv:2303.10835v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10835
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#20975;&#24681;&#26031;&#20132;&#21449;&#27169;&#22411;&#65292;&#36890;&#36807;&#20998;&#26512;&#25919;&#24220;&#25903;&#20986;&#19982;&#32463;&#27982;&#22343;&#34913;&#29366;&#24577;&#20043;&#38388;&#30340;&#21160;&#24577;&#20851;&#31995;&#65292;&#20998;&#31867;&#19981;&#21516;&#25919;&#24220;&#25903;&#20986;&#24773;&#20917;&#19979;&#32463;&#27982;&#22343;&#34913;&#29366;&#24577;&#30340;&#31283;&#23450;&#24615;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#25919;&#24220;&#25903;&#20986;&#23545;&#22269;&#27665;&#32463;&#27982;&#20135;&#29983;&#26174;&#33879;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#22269;&#27665;&#32463;&#27982;&#30340;&#20975;&#24681;&#26031;&#20132;&#21449;&#27169;&#22411;&#20013;&#30740;&#31350;&#20102;&#25919;&#24220;&#25903;&#20986;&#21644;&#32463;&#27982;&#22343;&#34913;&#20043;&#38388;&#30340;&#21160;&#24577;&#20851;&#31995;&#12290;&#35813;&#27169;&#22411;&#30001;&#20004;&#20010;&#26222;&#36890;&#24494;&#20998;&#26041;&#31243;&#32452;&#25104;&#65292;&#28041;&#21450;&#22269;&#27665;&#25910;&#20837;&#21464;&#21270;&#29575;&#21644;&#28040;&#36153;&#25903;&#20986;&#21464;&#21270;&#29575;&#12290;&#30740;&#31350;&#20102;&#22269;&#27665;&#25910;&#20837;&#19982;&#25919;&#24220;&#25903;&#20986;&#20043;&#38388;&#30340;&#19977;&#31181;&#21160;&#24577;&#20851;&#31995;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#36890;&#36807;&#35752;&#35770;&#19981;&#21516;&#25919;&#24220;&#25903;&#20986;&#30340;&#24773;&#20917;&#65292;&#23545;&#32463;&#27982;&#22343;&#34913;&#29366;&#24577;&#30340;&#31283;&#23450;&#24615;&#36827;&#34892;&#20998;&#31867;&#12290;&#27492;&#22806;&#65292;&#22522;&#20110;&#27599;&#31181;&#24773;&#26223;&#19979;&#30340;&#30456;&#22270;&#21644;&#21160;&#24577;&#31995;&#32479;&#30340;&#20998;&#23700;&#20998;&#26512;&#65292;&#25506;&#35752;&#20102;&#25919;&#24220;&#25903;&#20986;&#23545;&#22269;&#27665;&#32463;&#27982;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study rigorously investigates the Keynesian cross model of a national economy with a focus on the dynamic relationship between government spending and economic equilibrium. The model consists of two ordinary differential equations regarding the rate of change of national income and the rate of consumer spending. Three dynamic relationships between national income and government spending are studied. This study aims to classify the stabilities of equilibrium states for the economy by discussing different cases of government spending. Furthermore, the implication of government spending on the national economy is investigated based on phase portraits and bifurcation analysis of the dynamical system in each scenario.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#30417;&#31649;&#20013;&#23384;&#22312;&#30340;&#36164;&#26412;&#25104;&#26412;&#38382;&#39064;&#65292;&#25351;&#20986;&#20102;&#21333;&#19968;&#36164;&#26412;&#25104;&#26412;&#30340;&#24490;&#29615;&#24615;&#38382;&#39064;&#21644;&#22522;&#20110;&#20844;&#21496;&#20538;&#21048;&#25910;&#30410;&#29575;&#20272;&#35745;&#20538;&#21153;&#25104;&#26412;&#30340;&#19981;&#21487;&#38752;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#21487;&#33021;&#30340;&#30417;&#31649;&#25913;&#38761;&#26041;&#21521;&#12290;</title><link>http://arxiv.org/abs/2303.10818</link><description>&lt;p&gt;
&#37325;&#26032;&#23457;&#35270;&#29992;&#20110;&#30417;&#31649;&#30446;&#30340;&#30340;&#36164;&#26412;&#25104;&#26412;&#30340;&#22522;&#30784;
&lt;/p&gt;
&lt;p&gt;
A Re-Examination of the Foundations of Cost of Capital for Regulatory Purposes. (arXiv:2303.10818v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10818
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#30417;&#31649;&#20013;&#23384;&#22312;&#30340;&#36164;&#26412;&#25104;&#26412;&#38382;&#39064;&#65292;&#25351;&#20986;&#20102;&#21333;&#19968;&#36164;&#26412;&#25104;&#26412;&#30340;&#24490;&#29615;&#24615;&#38382;&#39064;&#21644;&#22522;&#20110;&#20844;&#21496;&#20538;&#21048;&#25910;&#30410;&#29575;&#20272;&#35745;&#20538;&#21153;&#25104;&#26412;&#30340;&#19981;&#21487;&#38752;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#21487;&#33021;&#30340;&#30417;&#31649;&#25913;&#38761;&#26041;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#30417;&#31649;&#31243;&#24207;&#20013;&#65292;&#24456;&#23569;&#26377;&#38382;&#39064;&#27604;&#36164;&#26412;&#25104;&#26412;&#26356;&#21152;&#20105;&#35758;&#12290;&#26412;&#25991;&#27491;&#24335;&#30830;&#35748;&#20102;&#30417;&#31649;&#30446;&#30340;&#30340;&#36164;&#26412;&#25104;&#26412;&#20272;&#35745;&#30340;&#29702;&#35770;&#22522;&#30784;&#12290;&#19968;&#20123;&#24120;&#35265;&#30340;&#30417;&#31649;&#24815;&#20363;&#22312;&#29702;&#35770;&#19978;&#32570;&#20047;&#22362;&#23454;&#30340;&#22522;&#30784;&#12290;&#20363;&#22914;&#65292;&#20026;&#21463;&#30417;&#31649;&#20225;&#19994;&#20272;&#35745;&#21333;&#19968;&#30340;&#36164;&#26412;&#25104;&#26412;&#24120;&#24120;&#23384;&#22312;&#24490;&#29615;&#24615;&#38382;&#39064;&#65292;&#29305;&#21035;&#26159;&#22312;&#22810;&#24180;&#30417;&#31649;&#26399;&#38388;&#12290;&#27492;&#22806;&#65292;&#30456;&#20851;&#30340;&#20538;&#21153;&#25104;&#26412;&#19981;&#33021;&#20351;&#29992;&#20844;&#21496;&#20538;&#21048;&#30340;&#21040;&#26399;&#25910;&#30410;&#29575;&#26469;&#20272;&#35745;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#21487;&#33021;&#30340;&#36164;&#26412;&#25104;&#26412;&#30417;&#31649;&#25913;&#38761;&#26041;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;
In regulatory proceedings, few issues are more hotly debated than the cost of capital. This article formalises the theoretical foundation of cost of capital estimation for regulatory purposes. Several common regulatory practices lack a solid foundation in the theory. For example, the common practice of estimating a single cost of capital for the regulated firm suffers from a circularity problem, especially in the context of a multi-year regulatory period. In addition, the relevant cost of debt cannot be estimated using the yield-to-maturity on a corporate bond. We suggest possible directions for reform of cost of capital practices in regulatory proceedings.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#24341;&#20837;&#26102;&#38388;&#21464;&#21270;&#26435;&#37325;&#30340;&#21452;&#32447;&#24615;&#31574;&#30053;&#65292;&#24182;&#30740;&#31350;&#20102;&#20854;&#22312;&#31163;&#25955;&#26102;&#38388;&#24773;&#20917;&#19979;&#30340;&#31283;&#20581;&#27491;&#26399;&#26395;&#23646;&#24615;&#12290;&#37319;&#29992;&#20803;&#32032;&#23545;&#31216;&#22810;&#39033;&#24335;&#34920;&#24449;&#26041;&#27861;&#35777;&#26126;&#20102;RPE&#23646;&#24615;&#25104;&#31435;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#39044;&#26399;&#32047;&#35745;&#25910;&#30410;&#25439;&#22833;&#20989;&#25968;&#21450;&#20854;&#26041;&#24046;&#30340;&#26174;&#24335;&#34920;&#36798;&#24335;&#12290;&#36890;&#36807;&#24191;&#27867;&#30340;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#39564;&#35777;&#20102;&#35813;&#29702;&#35770;&#65292;&#24182;&#23637;&#31034;&#20102;&#23558;&#35813;&#31574;&#30053;&#19982;&#26631;&#20934;&#25216;&#26415;&#20998;&#26512;&#25216;&#26415;&#26377;&#26426;&#32467;&#21512;&#30340;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2303.10806</link><description>&lt;p&gt;
&#20851;&#20110;&#26102;&#38388;&#21464;&#21270;&#26435;&#37325;&#19979;&#21452;&#32447;&#24615;&#31574;&#30053;&#30340;&#31283;&#20581;&#24615;
&lt;/p&gt;
&lt;p&gt;
On Robustness of Double Linear Policy with Time-Varying Weights. (arXiv:2303.10806v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10806
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#24341;&#20837;&#26102;&#38388;&#21464;&#21270;&#26435;&#37325;&#30340;&#21452;&#32447;&#24615;&#31574;&#30053;&#65292;&#24182;&#30740;&#31350;&#20102;&#20854;&#22312;&#31163;&#25955;&#26102;&#38388;&#24773;&#20917;&#19979;&#30340;&#31283;&#20581;&#27491;&#26399;&#26395;&#23646;&#24615;&#12290;&#37319;&#29992;&#20803;&#32032;&#23545;&#31216;&#22810;&#39033;&#24335;&#34920;&#24449;&#26041;&#27861;&#35777;&#26126;&#20102;RPE&#23646;&#24615;&#25104;&#31435;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#39044;&#26399;&#32047;&#35745;&#25910;&#30410;&#25439;&#22833;&#20989;&#25968;&#21450;&#20854;&#26041;&#24046;&#30340;&#26174;&#24335;&#34920;&#36798;&#24335;&#12290;&#36890;&#36807;&#24191;&#27867;&#30340;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#39564;&#35777;&#20102;&#35813;&#29702;&#35770;&#65292;&#24182;&#23637;&#31034;&#20102;&#23558;&#35813;&#31574;&#30053;&#19982;&#26631;&#20934;&#25216;&#26415;&#20998;&#26512;&#25216;&#26415;&#26377;&#26426;&#32467;&#21512;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23558;&#26102;&#38388;&#21464;&#21270;&#26435;&#37325;&#24341;&#20837;&#29616;&#26377;&#30340;&#21452;&#32447;&#24615;&#31574;&#30053;&#65292;&#24182;&#22312;&#31163;&#25955;&#26102;&#38388;&#24773;&#20917;&#19979;&#30740;&#31350;&#20102;&#19968;&#31181;&#31216;&#20026;&#31283;&#20581;&#27491;&#26399;&#26395;&#65288;RPE&#65289;&#30340;&#31283;&#20581;&#24615;&#36136;&#12290;&#25105;&#20204;&#37319;&#29992;&#19968;&#31181;&#26032;&#39062;&#30340;&#20803;&#32032;&#23545;&#31216;&#22810;&#39033;&#24335;&#34920;&#24449;&#26041;&#27861;&#35777;&#26126;RPE&#23646;&#24615;&#25104;&#31435;&#65292;&#24182;&#24471;&#20986;&#39044;&#26399;&#32047;&#35745;&#25910;&#30410;&#25439;&#22833;&#20989;&#25968;&#21450;&#20854;&#26041;&#24046;&#30340;&#26174;&#24335;&#34920;&#36798;&#24335;&#12290;&#20026;&#39564;&#35777;&#25105;&#20204;&#30340;&#29702;&#35770;&#65292;&#25105;&#20204;&#20351;&#29992;&#21508;&#31181;&#26435;&#37325;&#20989;&#25968;&#36827;&#34892;&#20102;&#24191;&#27867;&#30340;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#28436;&#31034;&#20102;&#22914;&#20309;&#20351;&#29992;&#31227;&#21160;&#24179;&#22343;&#32447;&#20316;&#20026;&#20132;&#26131;&#20449;&#21495;&#65292;&#23558;&#27492;&#31574;&#30053;&#26377;&#25928;&#22320;&#19982;&#26631;&#20934;&#25216;&#26415;&#20998;&#26512;&#25216;&#26415;&#32467;&#21512;&#36215;&#26469;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we extend the existing double linear policy by incorporating time-varying weights instead of constant weights and study a certain robustness property, called robust positive expectation (RPE), in a discrete-time setting. We prove that the RPE property holds by employing a novel elementary symmetric polynomials characterization approach and derive an explicit expression for both the expected cumulative gain-loss function and its variance. To validate our theory, we perform extensive Monte Carlo simulations using various weighting functions. Furthermore, we demonstrate how this policy can be effectively incorporated with standard technical analysis techniques, using the moving average as a trading signal.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#33631;&#33795;&#20998;&#26512;&#20102;&#30111;&#30142;&#21270;&#23398;&#39044;&#38450;&#23545;&#25945;&#32946;&#25104;&#26524;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#20854;&#22312;&#25913;&#21892;&#23398;&#29983;&#35748;&#30693;&#33021;&#21147;&#26041;&#38754;&#20855;&#26377;&#26497;&#39640;&#25104;&#26412;&#25928;&#30410;&#12290;</title><link>http://arxiv.org/abs/2303.10684</link><description>&lt;p&gt;
&#22522;&#20110;&#23398;&#26657;&#30340;&#30111;&#30142;&#21270;&#23398;&#39044;&#38450;&#26159;&#19968;&#31181;&#25552;&#39640;&#35748;&#30693;&#21644;&#25945;&#32946;&#25104;&#26524;&#30340;&#25104;&#26412;&#25928;&#30410;&#26041;&#27861;&#65306;&#19968;&#39033;&#33631;&#33795;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
School-based malaria chemoprevention as a cost-effective approach to improve cognitive and educational outcomes: a meta-analysis. (arXiv:2303.10684v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10684
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#33631;&#33795;&#20998;&#26512;&#20102;&#30111;&#30142;&#21270;&#23398;&#39044;&#38450;&#23545;&#25945;&#32946;&#25104;&#26524;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#20854;&#22312;&#25913;&#21892;&#23398;&#29983;&#35748;&#30693;&#33021;&#21147;&#26041;&#38754;&#20855;&#26377;&#26497;&#39640;&#25104;&#26412;&#25928;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30446;&#21069;&#26377;&#38480;&#30340;&#35777;&#25454;&#34920;&#26126;&#65292;&#20581;&#24247;&#24178;&#39044;&#23545;&#35748;&#30693;&#21151;&#33021;&#21644;&#25945;&#32946;&#25104;&#26524;&#30340;&#24433;&#21709;&#24456;&#23567;&#12290;&#26412;&#25991;&#22312;&#20004;&#39033;&#20808;&#21069;&#30340;&#31995;&#32479;&#35780;&#20215;&#22522;&#30784;&#19978;&#36827;&#34892;&#33631;&#33795;&#20998;&#26512;&#65292;&#25506;&#35752;&#30111;&#30142;&#21270;&#23398;&#39044;&#38450;&#36825;&#19968;&#26368;&#37325;&#35201;&#30340;&#20581;&#24247;&#24178;&#39044;&#23545;&#25945;&#32946;&#25104;&#26524;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#27719;&#38598;&#20102;&#26469;&#33258;&#22235;&#20010;&#22269;&#23478;&#30340;&#20061;&#20010;&#30740;&#31350;&#27835;&#30103;&#32452;&#65288;N=4,075&#65289;&#30340;&#25968;&#25454;&#21644;&#32467;&#26524;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#20302;&#25104;&#26412;&#30340;&#30111;&#30142;&#21270;&#23398;&#39044;&#38450;&#23545;&#23398;&#29983;&#30340;&#35748;&#30693;&#21151;&#33021;&#26377;&#31215;&#26497;&#24433;&#21709;&#65288;Cohen's d = 0.12, 95% CI [0.08, 0.16]&#65289;&#12290;&#36825;&#20123;&#32467;&#26524;&#34920;&#26126;&#65292;&#30111;&#30142;&#21270;&#23398;&#39044;&#38450;&#22312;&#25552;&#39640;&#26576;&#20123;&#35748;&#30693;&#25216;&#33021;&#65288;&#22914;&#25345;&#32493;&#27880;&#24847;&#21147;&#65289;&#26041;&#38754;&#20855;&#26377;&#26497;&#39640;&#30340;&#25104;&#26412;&#25928;&#30410;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#20351;&#29992;&#19968;&#31181;&#26032;&#30340;&#20844;&#20849;&#24230;&#37327;&#65288;&#23398;&#20064;&#35843;&#25972;&#21457;&#23637;&#24180;&#38480;&#65289;&#36827;&#34892;&#27169;&#25311;&#65292;&#20197;&#27604;&#36739;&#21508;&#31181;&#24178;&#39044;&#25514;&#26045;&#30340;&#25104;&#26412;&#25928;&#30410;&#12290;&#23613;&#31649;&#25105;&#20204;&#21487;&#33021;&#26399;&#26395;&#20256;&#32479;&#30340;&#25945;&#32946;&#24178;&#39044;&#25514;&#26045;&#25552;&#20379;&#31435;&#21363;&#30340;&#23398;&#20064;&#25910;&#30410;&#65292;&#20294;&#20687;&#30111;&#30142;&#39044;&#38450;&#36825;&#26679;&#30340;&#20581;&#24247;&#24178;&#39044;&#25514;&#26045;&#22312;&#25945;&#32946;&#25104;&#26524;&#26041;&#38754;&#20855;&#26377;&#24778;&#20154;&#30340;&#25104;&#26412;&#25928;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;
There is limited evidence of health interventions impact on cognitive function and educational outcomes. We build on two prior systematic reviews to conduct a meta-analysis, exploring the effects of one of the most consequential health interventions, malaria chemoprevention, on education outcomes. We pool data from nine study treatment groups (N=4,075) and outcomes across four countries. We find evidence of a positive effect (Cohen's d = 0.12, 95% CI [0.08, 0.16]) on student cognitive function, achieved at low cost. These results show that malaria chemoprevention can be highly cost effective in improving some cognitive skills, such as sustained attention. Moreover, we conduct simulations using a new common metric (learning-adjusted years of development) to compare cost-effectiveness across diverse interventions. While we might expect that traditional education interventions provide an immediate learning gain, health interventions such as malaria prevention can have surprisingly cost-ef
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#30456;&#20851;&#30697;&#38453;&#21644;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#26500;&#24314;&#20102;&#19968;&#20010;&#39044;&#27979;&#27169;&#22411;&#65292;&#20197;&#39044;&#27979;&#36135;&#24065;&#24066;&#22330;&#24037;&#20855;&#30340;&#20132;&#26131;&#37327;&#65292;&#24182;&#25506;&#35752;&#20102;&#36135;&#24065;&#24066;&#22330;&#19982;&#36164;&#26412;&#24066;&#22330;&#22312;&#21360;&#24230;&#32463;&#27982;&#20013;&#30340;&#20849;&#29983;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2303.10481</link><description>&lt;p&gt;
&#22522;&#20110;&#36164;&#26412;&#24066;&#22330;&#21644;&#38134;&#34892;&#21033;&#29575;&#27604;&#29575;&#30340;&#36135;&#24065;&#24066;&#22330;&#24037;&#20855;&#39044;&#27979;&#20248;&#21270;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Predictive Optimized Model on Money Markets Instruments With Capital Market and Bank Rates Ratio. (arXiv:2303.10481v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10481
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#30456;&#20851;&#30697;&#38453;&#21644;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#26500;&#24314;&#20102;&#19968;&#20010;&#39044;&#27979;&#27169;&#22411;&#65292;&#20197;&#39044;&#27979;&#36135;&#24065;&#24066;&#22330;&#24037;&#20855;&#30340;&#20132;&#26131;&#37327;&#65292;&#24182;&#25506;&#35752;&#20102;&#36135;&#24065;&#24066;&#22330;&#19982;&#36164;&#26412;&#24066;&#22330;&#22312;&#21360;&#24230;&#32463;&#27982;&#20013;&#30340;&#20849;&#29983;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21360;&#24230;&#37329;&#34701;&#24066;&#22330;&#30340;&#36135;&#24065;&#24066;&#22330;&#21644;&#36164;&#26412;&#24066;&#22330;&#22312;&#21360;&#24230;&#32463;&#27982;&#30340;&#21457;&#23637;&#20013;&#26377;&#30528;&#20849;&#29983;&#20851;&#31995;&#12290;&#24066;&#22330;&#30340;&#24615;&#36136;&#21644;&#29305;&#28857;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#19981;&#21516;&#65292;&#36135;&#24065;&#24066;&#22330;&#36890;&#36807;&#30417;&#31649;&#26426;&#26500;&#30340;&#36135;&#24065;&#25919;&#31574;&#30830;&#20445;&#31995;&#32479;&#20013;&#30340;&#27969;&#21160;&#24615;&#65307;&#36164;&#26412;&#24066;&#22330;&#21017;&#38271;&#26399;&#25512;&#21160;&#21644;&#25285;&#20219;&#32463;&#27982;&#24341;&#25806;&#39537;&#21160;&#22120;&#12290;&#22240;&#27492;&#65292;&#32463;&#27982;&#30340;&#26368;&#32456;&#21534;&#21520;&#37327;&#26159;&#20004;&#20010;&#24066;&#22330;&#30340;&#36755;&#20986;&#20043;&#21644;&#12290;&#36825;&#26159;&#21542;&#24847;&#21619;&#30528;&#20004;&#20010;&#24066;&#22330;&#30340;&#21457;&#23637;&#26159;&#24182;&#34892;&#30340;&#65292;&#25110;&#32773;&#20219;&#20309;&#19968;&#20010;&#24066;&#22330;&#20248;&#20110;&#21478;&#19968;&#20010;&#24066;&#22330;&#65292;&#25110;&#32773;&#23427;&#20204;&#31454;&#20105;&#65311;&#20026;&#20102;&#20102;&#35299;&#19968;&#20010;&#24066;&#22330;&#23545;&#21478;&#19968;&#20010;&#24066;&#22330;&#30340;&#24433;&#21709;&#65292;&#26412;&#30740;&#31350;&#36890;&#36807;&#30456;&#20851;&#30697;&#38453;&#21644;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;&#36827;&#19968;&#27493;&#26500;&#24314;&#20102;&#19968;&#20010;&#22522;&#20110;14&#22825;&#21382;&#21490;&#30340;&#39044;&#27979;&#27169;&#22411;&#65292;&#29992;&#20110;&#39044;&#27979;&#36135;&#24065;&#24066;&#22330;&#24037;&#20855;&#30340;&#20132;&#26131;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
The money market and the capital market of the Indian financial markets have a symbiotic relationship in the development of the Indian economy. The nature and the characteristics of the markets differ to a large extent as the money market ensures liquidity in the system through the monetary policy by the regulators; capital markets propel and act as the engine driver for the economy in the long term. Therefore, the final throughput of the economy is the aggregation of the output of both the markets. Does that imply that the development of both markets is parallel in nature or is any one superior to the other or are they competitors? To understand the influence of one over the other the research was undertaken through a correlation matrix and time series model. A predictive model was further constructed for predicting the volume of money market instrument on the basis of fourteen days historical.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#21033;&#29992;&#21326;&#30427;&#39039;&#24030;&#30340;&#22823;&#40635;&#25195;&#25551;&#25968;&#25454;&#30740;&#31350;&#20102;&#26368;&#20302;&#24037;&#36164;&#23545;&#25209;&#21457;&#21644;&#38646;&#21806;&#20215;&#26684;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#19968;&#26086;&#32771;&#34385;&#21040;&#25209;&#21457;&#25104;&#26412;&#25928;&#24212;&#65292;&#38646;&#21806;&#20215;&#26684;&#24377;&#24615;&#20250;&#22686;&#21152;&#19968;&#20493;&#20197;&#19978;&#12290;&#38646;&#21806;&#21830;&#23436;&#20840;&#36716;&#23233;&#20102;&#25104;&#26412;&#12290;</title><link>http://arxiv.org/abs/2303.10367</link><description>&lt;p&gt;
&#26368;&#20302;&#24037;&#36164;&#23545;&#25209;&#21457;&#21644;&#38646;&#21806;&#20215;&#26684;&#30340;&#24433;&#21709;&#65306;&#22522;&#20110;&#22823;&#40635;&#25195;&#25551;&#25968;&#25454;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Minimum Wage Pass-through to Wholesale and Retail Prices: Evidence from Cannabis Scanner Data. (arXiv:2303.10367v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10367
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;&#21326;&#30427;&#39039;&#24030;&#30340;&#22823;&#40635;&#25195;&#25551;&#25968;&#25454;&#30740;&#31350;&#20102;&#26368;&#20302;&#24037;&#36164;&#23545;&#25209;&#21457;&#21644;&#38646;&#21806;&#20215;&#26684;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#19968;&#26086;&#32771;&#34385;&#21040;&#25209;&#21457;&#25104;&#26412;&#25928;&#24212;&#65292;&#38646;&#21806;&#20215;&#26684;&#24377;&#24615;&#20250;&#22686;&#21152;&#19968;&#20493;&#20197;&#19978;&#12290;&#38646;&#21806;&#21830;&#23436;&#20840;&#36716;&#23233;&#20102;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36234;&#26469;&#36234;&#22810;&#30340;&#23454;&#35777;&#25991;&#29486;&#21457;&#29616;&#65292;&#20225;&#19994;&#36890;&#36807;&#25552;&#39640;&#38646;&#21806;&#20215;&#23558;&#26368;&#20302;&#24037;&#36164;&#19978;&#28072;&#30340;&#25104;&#26412;&#36716;&#23233;&#32473;&#28040;&#36153;&#32773;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#24456;&#23569;&#20102;&#35299;&#26368;&#20302;&#24037;&#36164;&#23545;&#25209;&#21457;&#20215;&#26684;&#30340;&#24433;&#21709;&#20197;&#21450;&#38646;&#21806;&#21830;&#26159;&#21542;&#38754;&#23545;&#38500;&#21171;&#21160;&#25104;&#26412;&#20914;&#20987;&#22806;&#30340;&#25209;&#21457;&#25104;&#26412;&#20914;&#20987;&#12290;&#26412;&#25991;&#21033;&#29992;&#21326;&#30427;&#39039;&#24030;&#21512;&#27861;&#30340;&#20241;&#38386;&#22823;&#40635;&#20135;&#19994;&#30340;&#29420;&#29305;&#24066;&#22330;&#32467;&#26500;&#65292;&#30740;&#31350;&#26368;&#20302;&#24037;&#36164;&#23545;&#25209;&#21457;&#21644;&#38646;&#21806;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#22312;&#19968;&#20010;&#21160;&#24577;&#24046;&#20998;&#24046;&#24322;&#26550;&#26500;&#20013;&#65292;&#21033;&#29992;&#20379;&#24212;&#38142;&#19978;60&#20159;&#32654;&#20803;&#20132;&#26131;&#30340;&#25195;&#25551;&#25968;&#25454;&#65292;&#24182;&#21033;&#29992;&#22312;2018&#24180;&#33267;2021&#24180;&#20043;&#38388;&#20845;&#27425;&#26368;&#20302;&#24037;&#36164;&#30340;&#28072;&#24133;&#20013;&#20225;&#19994;&#26368;&#20302;&#24037;&#36164;&#26333;&#38706;&#30340;&#22320;&#29702;&#24046;&#24322;&#12290;&#24403;&#24573;&#30053;&#25209;&#21457;&#25104;&#26412;&#25928;&#24212;&#26102;&#65292;&#25105;&#21457;&#29616;&#38646;&#21806;&#20215;&#26684;&#24377;&#24615;&#19982;&#29616;&#26377;&#25991;&#29486;&#19968;&#33268;&#65292;&#20294;&#19968;&#26086;&#32771;&#34385;&#21040;&#25209;&#21457;&#25104;&#26412;&#25928;&#24212;&#65292;&#38646;&#21806;&#20215;&#26684;&#24377;&#24615;&#20250;&#22686;&#21152;&#19968;&#20493;&#20197;&#19978;&#12290;&#38646;&#21806;&#21033;&#28070;&#29575;&#19981;&#20250;&#35843;&#25972;&#20197;&#36866;&#24212;&#25209;&#21457;&#25104;&#26412;&#20914;&#20987;&#65292;&#34920;&#26126;&#23436;&#20840;&#36716;&#23233;&#20102;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
A growing empirical literature finds that firms pass the cost of minimum wage hikes onto consumers via higher retail prices. Yet, little is known about minimum wage effects on wholesale prices and whether retailers face a wholesale cost shock in addition to the labor cost shock. I exploit the unique market structure of Washington state's legal recreational cannabis industry to investigate minimum wage pass-through to wholesale and retail prices. In a dynamic difference-in-differences framework, I utilize scanner data on $6 billion of transactions across the supply chain and leverage geographic variation in firms' minimum wage exposure across six minimum wage hikes between 2018 and 2021. When ignoring wholesale cost effects, I find retail pass-through elasticities consistent with existing literature -- yet retail pass-through elasticities more than double once wholesale cost effects are accounted for. Retail markups do not adjust to the wholesale cost shock, indicating a full pass-throu
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;GPT&#65288;&#22823;&#35821;&#35328;&#27169;&#22411;&#65289;&#21644;&#30456;&#20851;&#25216;&#26415;&#23545;&#32654;&#22269;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#28508;&#22312;&#24433;&#21709;&#65292;&#21457;&#29616;&#22823;&#32422;80%&#30340;&#32654;&#22269;&#21171;&#21160;&#21147;&#21487;&#33021;&#20250;&#21463;&#21040;10%&#30340;&#24037;&#20316;&#20219;&#21153;&#30340;&#24433;&#21709;&#65292;&#28085;&#30422;&#20102;&#25152;&#26377;&#24037;&#36164;&#27700;&#24179;&#21644;&#21508;&#34892;&#21508;&#19994;&#65292;&#39044;&#31034;&#30528;&#36825;&#20123;&#27169;&#22411;&#21487;&#33021;&#20855;&#26377;&#26174;&#33879;&#30340;&#32463;&#27982;&#12289;&#31038;&#20250;&#21644;&#25919;&#31574;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2303.10130</link><description>&lt;p&gt;
GPT&#26159;GPT&#65306;&#22823;&#35821;&#35328;&#27169;&#22411;&#23545;&#21171;&#21160;&#21147;&#24066;&#22330;&#24433;&#21709;&#30340;&#26089;&#26399;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
GPTs are GPTs: An Early Look at the Labor Market Impact Potential of Large Language Models. (arXiv:2303.10130v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10130
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;GPT&#65288;&#22823;&#35821;&#35328;&#27169;&#22411;&#65289;&#21644;&#30456;&#20851;&#25216;&#26415;&#23545;&#32654;&#22269;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#28508;&#22312;&#24433;&#21709;&#65292;&#21457;&#29616;&#22823;&#32422;80%&#30340;&#32654;&#22269;&#21171;&#21160;&#21147;&#21487;&#33021;&#20250;&#21463;&#21040;10%&#30340;&#24037;&#20316;&#20219;&#21153;&#30340;&#24433;&#21709;&#65292;&#28085;&#30422;&#20102;&#25152;&#26377;&#24037;&#36164;&#27700;&#24179;&#21644;&#21508;&#34892;&#21508;&#19994;&#65292;&#39044;&#31034;&#30528;&#36825;&#20123;&#27169;&#22411;&#21487;&#33021;&#20855;&#26377;&#26174;&#33879;&#30340;&#32463;&#27982;&#12289;&#31038;&#20250;&#21644;&#25919;&#31574;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#29983;&#25104;&#39044;&#35757;&#32451;&#21464;&#21387;&#22120;&#65288;GPT&#65289;&#27169;&#22411;&#21644;&#30456;&#20851;&#25216;&#26415;&#23545;&#32654;&#22269;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#28508;&#22312;&#24433;&#21709;&#12290;&#20351;&#29992;&#26032;&#30340;&#26631;&#20934;&#65292;&#25105;&#20204;&#35780;&#20272;&#32844;&#19994;&#19982;GPT&#33021;&#21147;&#30340;&#23545;&#24212;&#20851;&#31995;&#65292;&#32467;&#21512;&#20154;&#31867;&#19987;&#19994;&#30693;&#35782;&#21644;GPT-4&#30340;&#20998;&#31867;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#32422;80%&#30340;&#32654;&#22269;&#21171;&#21160;&#21147;&#21487;&#33021;&#20250;&#33267;&#23569;&#26377;10%&#30340;&#24037;&#20316;&#20219;&#21153;&#21463;&#21040;GPT&#24341;&#20837;&#30340;&#24433;&#21709;&#65292;&#32780;&#32422;19%&#30340;&#24037;&#20154;&#21487;&#33021;&#20250;&#30475;&#21040;&#33267;&#23569;50%&#30340;&#20219;&#21153;&#21463;&#21040;&#24433;&#21709;&#12290;&#24433;&#21709;&#33539;&#22260;&#28085;&#30422;&#20102;&#25152;&#26377;&#24037;&#36164;&#27700;&#24179;&#65292;&#39640;&#25910;&#20837;&#24037;&#20316;&#21487;&#33021;&#38754;&#20020;&#26356;&#22823;&#30340;&#39118;&#38505;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#24433;&#21709;&#24182;&#19981;&#23616;&#38480;&#20110;&#26368;&#36817;&#29983;&#20135;&#29575;&#22686;&#38271;&#36739;&#39640;&#30340;&#34892;&#19994;&#12290;&#25105;&#20204;&#24471;&#20986;&#32467;&#35770;&#65292;&#29983;&#25104;&#39044;&#35757;&#32451;&#21464;&#21387;&#22120;&#20855;&#26377;&#36890;&#29992;&#25216;&#26415;&#65288;GPT&#65289;&#30340;&#29305;&#24615;&#65292;&#34920;&#26126;&#36825;&#20123;&#27169;&#22411;&#21487;&#33021;&#20855;&#26377;&#26174;&#33879;&#30340;&#32463;&#27982;&#12289;&#31038;&#20250;&#21644;&#25919;&#31574;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate the potential implications of Generative Pre-trained Transformer (GPT) models and related technologies on the U.S. labor market. Using a new rubric, we assess occupations based on their correspondence with GPT capabilities, incorporating both human expertise and classifications from GPT-4. Our findings indicate that approximately 80% of the U.S. workforce could have at least 10% of their work tasks affected by the introduction of GPTs, while around 19% of workers may see at least 50% of their tasks impacted. The influence spans all wage levels, with higher-income jobs potentially facing greater exposure. Notably, the impact is not limited to industries with higher recent productivity growth. We conclude that Generative Pre-trained Transformers exhibit characteristics of general-purpose technologies (GPTs), suggesting that as these models could have notable economic, social, and policy implications.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#26041;&#27861;&#31995;&#32479;&#35780;&#20272;&#20102;&#32844;&#19994;&#21644;&#34892;&#19994;&#23545;&#20154;&#24037;&#26234;&#33021;&#35821;&#35328;&#24314;&#27169;&#25216;&#26415;&#36827;&#27493;&#30340;&#26292;&#38706;&#31243;&#24230;&#65292;&#32467;&#26524;&#21457;&#29616;&#30005;&#35805;&#38144;&#21806;&#21592;&#12289;&#33521;&#35821;&#35821;&#35328;&#21644;&#25991;&#23398;&#12289;&#22806;&#35821;&#21644;&#25991;&#23398;&#12289;&#21382;&#21490;&#31561;&#39640;&#31561;&#25945;&#32946;&#25945;&#24072;&#26159;&#26368;&#21463;&#24433;&#21709;&#30340;&#32844;&#19994;&#65292;&#27861;&#24459;&#26381;&#21153;&#12289;&#35777;&#21048;&#12289;&#21830;&#21697;&#21644;&#25237;&#36164;&#26159;&#26368;&#21463;&#24433;&#21709;&#30340;&#34892;&#19994;&#65307;&#32780;&#24037;&#36164;&#19982;&#26292;&#38706;&#24230;&#23384;&#22312;&#27491;&#30456;&#20851;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2303.01157</link><description>&lt;p&gt;
&#35821;&#35328;&#27169;&#22411;&#65288;&#22914;ChatGPT&#65289;&#23558;&#22914;&#20309;&#24433;&#21709;&#32844;&#19994;&#21644;&#34892;&#19994;&#65311;
&lt;/p&gt;
&lt;p&gt;
How will Language Modelers like ChatGPT Affect Occupations and Industries?. (arXiv:2303.01157v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.01157
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#26041;&#27861;&#31995;&#32479;&#35780;&#20272;&#20102;&#32844;&#19994;&#21644;&#34892;&#19994;&#23545;&#20154;&#24037;&#26234;&#33021;&#35821;&#35328;&#24314;&#27169;&#25216;&#26415;&#36827;&#27493;&#30340;&#26292;&#38706;&#31243;&#24230;&#65292;&#32467;&#26524;&#21457;&#29616;&#30005;&#35805;&#38144;&#21806;&#21592;&#12289;&#33521;&#35821;&#35821;&#35328;&#21644;&#25991;&#23398;&#12289;&#22806;&#35821;&#21644;&#25991;&#23398;&#12289;&#21382;&#21490;&#31561;&#39640;&#31561;&#25945;&#32946;&#25945;&#24072;&#26159;&#26368;&#21463;&#24433;&#21709;&#30340;&#32844;&#19994;&#65292;&#27861;&#24459;&#26381;&#21153;&#12289;&#35777;&#21048;&#12289;&#21830;&#21697;&#21644;&#25237;&#36164;&#26159;&#26368;&#21463;&#24433;&#21709;&#30340;&#34892;&#19994;&#65307;&#32780;&#24037;&#36164;&#19982;&#26292;&#38706;&#24230;&#23384;&#22312;&#27491;&#30456;&#20851;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#20154;&#24037;&#26234;&#33021;&#35821;&#35328;&#24314;&#27169;&#33021;&#21147;&#30340;&#24613;&#21095;&#25552;&#39640;&#24341;&#21457;&#20102;&#20851;&#20110;&#36825;&#20123;&#25216;&#26415;&#23545;&#32463;&#27982;&#30340;&#24433;&#21709;&#30340;&#35768;&#22810;&#38382;&#39064;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#26469;&#31995;&#32479;&#35780;&#20272;&#32844;&#19994;&#12289;&#34892;&#19994;&#21644;&#22320;&#22495;&#23545;&#20154;&#24037;&#26234;&#33021;&#35821;&#35328;&#24314;&#27169;&#33021;&#21147;&#36827;&#27493;&#30340;&#26292;&#38706;&#31243;&#24230;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#26368;&#21463;&#35821;&#35328;&#24314;&#27169;&#24433;&#21709;&#30340;&#32844;&#19994;&#21253;&#25324;&#30005;&#35805;&#38144;&#21806;&#21592;&#21644;&#21508;&#31181;&#39640;&#31561;&#25945;&#32946;&#25945;&#24072;&#65292;&#20363;&#22914;&#33521;&#35821;&#35821;&#35328;&#21644;&#25991;&#23398;&#12289;&#22806;&#35821;&#21644;&#25991;&#23398;&#20197;&#21450;&#21382;&#21490;&#25945;&#24072;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#26368;&#21463;&#35821;&#35328;&#24314;&#27169;&#24433;&#21709;&#30340;&#34892;&#19994;&#26159;&#27861;&#24459;&#26381;&#21153;&#21644;&#35777;&#21048;&#12289;&#21830;&#21697;&#21644;&#25237;&#36164;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#24037;&#36164;&#19982;&#20154;&#24037;&#26234;&#33021;&#35821;&#35328;&#24314;&#27169;&#26292;&#38706;&#24230;&#20043;&#38388;&#23384;&#22312;&#27491;&#30456;&#20851;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recent dramatic increases in AI language modeling capabilities has led to many questions about the effect of these technologies on the economy. In this paper we present a methodology to systematically assess the extent to which occupations, industries and geographies are exposed to advances in AI language modeling capabilities. We find that the top occupations exposed to language modeling include telemarketers and a variety of post-secondary teachers such as English language and literature, foreign language and literature, and history teachers. We find the top industries exposed to advances in language modeling are legal services and securities, commodities, and investments. We also find a positive correlation between wages and exposure to AI language modeling.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#20004;&#37096;&#38376;&#20869;&#29983;&#22686;&#38271;&#27169;&#22411;&#65292;&#35777;&#26126;&#20102;&#22312;&#23485;&#26494;&#30340;&#37329;&#34701;&#26465;&#20214;&#19979;&#29702;&#24615;&#36164;&#20135;&#20215;&#26684;&#27873;&#27819;&#26159;&#19981;&#21487;&#36991;&#20813;&#30340;&#65292;&#23427;&#23384;&#22312;&#20110;&#20855;&#26377;&#26356;&#24555;&#32463;&#27982;&#22686;&#38271;&#30340;&#22810;&#37096;&#38376;&#32463;&#27982;&#20307;&#20013;&#12290;</title><link>http://arxiv.org/abs/2211.13100</link><description>&lt;p&gt;
&#20004;&#37096;&#38376;&#22686;&#38271;&#32463;&#27982;&#20307;&#20013;&#29702;&#24615;&#36164;&#20135;&#20215;&#26684;&#27873;&#27819;&#30340;&#24517;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Necessity of Rational Asset Price Bubbles in Two-Sector Growth Economies. (arXiv:2211.13100v4 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.13100
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#20004;&#37096;&#38376;&#20869;&#29983;&#22686;&#38271;&#27169;&#22411;&#65292;&#35777;&#26126;&#20102;&#22312;&#23485;&#26494;&#30340;&#37329;&#34701;&#26465;&#20214;&#19979;&#29702;&#24615;&#36164;&#20135;&#20215;&#26684;&#27873;&#27819;&#26159;&#19981;&#21487;&#36991;&#20813;&#30340;&#65292;&#23427;&#23384;&#22312;&#20110;&#20855;&#26377;&#26356;&#24555;&#32463;&#27982;&#22686;&#38271;&#30340;&#22810;&#37096;&#38376;&#32463;&#27982;&#20307;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#21512;&#29702;&#30340;&#32463;&#27982;&#27169;&#22411;&#65292;&#20854;&#20013;&#23384;&#22312;&#20855;&#26377;&#29702;&#24615;&#36164;&#20135;&#20215;&#26684;&#27873;&#27819;&#30340;&#22343;&#34913;&#65292;&#20294;&#36164;&#20135;&#20215;&#26684;&#31561;&#20110;&#22522;&#26412;&#20215;&#20540;&#30340;&#22343;&#34913;&#19981;&#23384;&#22312;&#12290;&#36825;&#20123;&#32463;&#27982;&#20307;&#20855;&#26377;&#27604;&#32929;&#21033;&#22686;&#38271;&#26356;&#24555;&#30340;&#22810;&#20010;&#37096;&#38376;&#30340;&#22686;&#38271;&#12290;&#22312;&#25105;&#20204;&#30340;&#20004;&#37096;&#38376;&#20869;&#29983;&#22686;&#38271;&#27169;&#22411;&#20013;&#65292;&#21019;&#19994;&#32773;&#21487;&#20197;&#33719;&#24471;&#21463;&#29305;&#24322;&#24615;&#25237;&#36164;&#39118;&#38505;&#65288;&#25216;&#26415;&#37096;&#38376;&#65289;&#24433;&#21709;&#30340;&#29983;&#20135;&#25216;&#26415;&#65292;&#24182;&#20132;&#26131;&#25903;&#20184;&#32929;&#24687;&#30340;&#36164;&#20135;&#65288;&#22303;&#22320;&#65289;&#12290;&#24403;&#26464;&#26438;&#36229;&#36807;&#20020;&#30028;&#20540;&#26102;&#65292;&#21807;&#19968;&#30340;&#36235;&#21183;&#31283;&#24577;&#22343;&#34913;&#34920;&#29616;&#20986;&#20174;&#22522;&#26412;&#29366;&#24577;&#21040;&#20855;&#26377;&#22686;&#38271;&#30340;&#27873;&#27819;&#29366;&#24577;&#30340;&#30456;&#21464;&#65292;&#36825;&#24847;&#21619;&#30528;&#22312;&#23485;&#26494;&#30340;&#37329;&#34701;&#26465;&#20214;&#19979;&#27873;&#27819;&#30340;&#19981;&#21487;&#36991;&#20813;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present plausible economic models in which an equilibrium with rational asset price bubbles exists but equilibria with asset prices equal to fundamental values do not. These economies feature multiple sectors with faster economic growth than dividend growth. In our two-sector endogenous growth model, entrepreneurs have access to a production technology subject to idiosyncratic investment risk (tech sector) and trade a dividend-paying asset (land). When leverage is relaxed beyond a critical value, the unique trend stationary equilibrium exhibits a phase transition from the fundamental regime to the bubbly regime with growth, implying the inevitability of bubbles with loose financial conditions.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#33021;&#22815;&#39640;&#25928;&#22788;&#29702;&#23616;&#37096;&#34892;&#20026;&#31867;&#20284;&#20110;&#31283;&#23450;L&#233;vy&#36807;&#31243;&#30340;&#36339;&#36291;&#34892;&#20026;&#30340;It&#244;&#21322;&#38789;&#30340;&#27874;&#21160;&#29575;&#20272;&#35745;&#65292;&#35813;&#26041;&#27861;&#22522;&#20110;&#19968;&#20010;&#20004;&#27493;&#21435;&#20559;&#35823;&#31243;&#24207;&#65292;&#36866;&#29992;&#20110;&#36339;&#36291;&#26159;&#26080;&#30028;&#21464;&#21270;&#30340;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2209.10128</link><description>&lt;p&gt;
&#21033;&#29992;&#21435;&#20559;&#25130;&#26029;&#23454;&#29616;&#27874;&#21160;&#29575;&#20272;&#35745;&#22788;&#29702;&#26080;&#38480;&#21464;&#21270;&#36339;&#36291;&#30340;&#39640;&#25928;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Efficient Integrated Volatility Estimation in the Presence of Infinite Variation Jumps via Debiased Truncated Realized Variations. (arXiv:2209.10128v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.10128
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#33021;&#22815;&#39640;&#25928;&#22788;&#29702;&#23616;&#37096;&#34892;&#20026;&#31867;&#20284;&#20110;&#31283;&#23450;L&#233;vy&#36807;&#31243;&#30340;&#36339;&#36291;&#34892;&#20026;&#30340;It&#244;&#21322;&#38789;&#30340;&#27874;&#21160;&#29575;&#20272;&#35745;&#65292;&#35813;&#26041;&#27861;&#22522;&#20110;&#19968;&#20010;&#20004;&#27493;&#21435;&#20559;&#35823;&#31243;&#24207;&#65292;&#36866;&#29992;&#20110;&#36339;&#36291;&#26159;&#26080;&#30028;&#21464;&#21270;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#39640;&#39057;&#35266;&#27979;&#30340;&#38543;&#26426;&#36807;&#31243;&#30340;&#32479;&#35745;&#25512;&#26029;&#24050;&#32463;&#26159;&#19968;&#20010;&#27963;&#36291;&#30340;&#30740;&#31350;&#39046;&#22495;&#36229;&#36807;&#20108;&#21313;&#24180;&#20102;&#12290;&#20854;&#20013;&#19968;&#20010;&#26368;&#20026;&#33879;&#21517;&#21644;&#24191;&#27867;&#30740;&#31350;&#30340;&#38382;&#39064;&#26159;&#20272;&#35745;&#24102;&#36339;&#36291;&#20998;&#37327;&#30340;It&#244;&#21322;&#38789;&#30340;&#20108;&#27425;&#21464;&#21270;&#37327;&#12290;&#22312;&#36339;&#36291;&#20998;&#37327;&#26159;&#26377;&#30028;&#21464;&#21270;&#30340;&#24773;&#20917;&#19979;&#65292;&#25991;&#29486;&#20013;&#24050;&#32463;&#25552;&#20986;&#20102;&#20960;&#31181;&#36895;&#29575;&#21644;&#26041;&#24046;&#39640;&#25928;&#30340;&#20272;&#35745;&#22120;&#12290;&#28982;&#32780;&#65292;&#21040;&#30446;&#21069;&#20026;&#27490;&#65292;&#20960;&#20046;&#27809;&#26377;&#26041;&#27861;&#21487;&#20197;&#22788;&#29702;&#26080;&#30028;&#21464;&#21270;&#30340;&#36339;&#36291;&#12290;&#36890;&#36807;&#24320;&#21457;&#26576;&#20123;&#23616;&#37096;&#31283;&#23450;L&#233;vy&#36807;&#31243;&#30340;&#25130;&#26029;&#30697;&#30340;&#26032;&#30340;&#39640;&#38454;&#23637;&#24320;&#65292;&#25105;&#20204;&#20026;&#19968;&#31867;It&#244;&#21322;&#38789;&#26500;&#24314;&#20102;&#19968;&#31181;&#26032;&#30340;&#36895;&#29575;&#21644;&#26041;&#24046;&#39640;&#25928;&#30340;&#27874;&#21160;&#29575;&#20272;&#35745;&#22120;&#65292;&#20854;&#20013;&#36339;&#36291;&#34892;&#20026;&#22312;&#23616;&#37096;&#19978;&#31867;&#20284;&#20110;Blumenthal-Getoor&#25351;&#25968;&#20026;$Y\in(1,8/5)$&#65288;&#22240;&#27492;&#26159;&#26080;&#30028;&#21464;&#21270;&#30340;&#65289;&#30340;&#31283;&#23450;L&#233;vy&#36807;&#31243;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#22522;&#20110;&#19968;&#20010;&#20004;&#27493;&#30340;&#21435;&#20559;&#35823;&#31243;&#24207;&#65292;&#29992;&#20110;&#35813;&#36807;&#31243;&#30340;&#25130;&#26029;&#23454;&#29616;&#30340;&#20108;&#27425;&#21464;&#21270;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
Statistical inference for stochastic processes based on high-frequency observations has been an active research area for more than two decades. One of the most well-known and widely studied problems is the estimation of the quadratic variation of the continuous component of an It\^o semimartingale with jumps. Several rate- and variance-efficient estimators have been proposed in the literature when the jump component is of bounded variation. However, to date, very few methods can deal with jumps of unbounded variation. By developing new high-order expansions of the truncated moments of a locally stable L\'evy process, we construct a new rate- and variance-efficient volatility estimator for a class of It\^o semimartingales whose jumps behave locally like those of a stable L\'evy process with Blumenthal-Getoor index $Y\in (1,8/5)$ (hence, of unbounded variation). The proposed method is based on a two-step debiasing procedure for the truncated realized quadratic variation of the process. O
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#29702;&#35770;&#30740;&#31350;&#20102;&#22810;&#36164;&#20135;&#22343;&#34913;&#27169;&#22411;&#20013;&#20215;&#26684;&#27873;&#27819;&#21644;&#23849;&#28291;&#24418;&#25104;&#30340;&#38382;&#39064;&#65292;&#25512;&#23548;&#20102;&#19981;&#21516;&#26234;&#33021;&#20307;&#27169;&#22411;&#30340;&#24179;&#22343;&#22343;&#34913;&#20215;&#26684;&#21160;&#24577;&#30340;&#23384;&#22312;&#26465;&#20214;&#65292;&#24182;&#25351;&#20986;&#20855;&#26377;&#27491;&#32929;&#24687;&#30340;&#36164;&#20135;&#22312;&#22343;&#34913;&#20215;&#26684;&#19978;&#34920;&#29616;&#20986;&#20856;&#22411;&#30340;&#39548;&#23792;&#27873;&#27819;&#24418;&#24577;&#12290;&#24403;&#24066;&#22330;&#26411;&#26399;&#20986;&#29616;&#24613;&#21095;&#19979;&#36300;&#26102;&#65292;&#20250;&#35302;&#21457;&#36164;&#20135;&#30340;&#38169;&#35823;&#20272;&#20540;&#25928;&#24212;&#12290;</title><link>http://arxiv.org/abs/2206.01468</link><description>&lt;p&gt;
&#22810;&#36164;&#20135;&#27873;&#27819;&#22343;&#34913;&#20215;&#26684;&#21160;&#21147;&#23398;
&lt;/p&gt;
&lt;p&gt;
Multi-Asset Bubbles Equilibrium Price Dynamics. (arXiv:2206.01468v6 [q-fin.TR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.01468
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#29702;&#35770;&#30740;&#31350;&#20102;&#22810;&#36164;&#20135;&#22343;&#34913;&#27169;&#22411;&#20013;&#20215;&#26684;&#27873;&#27819;&#21644;&#23849;&#28291;&#24418;&#25104;&#30340;&#38382;&#39064;&#65292;&#25512;&#23548;&#20102;&#19981;&#21516;&#26234;&#33021;&#20307;&#27169;&#22411;&#30340;&#24179;&#22343;&#22343;&#34913;&#20215;&#26684;&#21160;&#24577;&#30340;&#23384;&#22312;&#26465;&#20214;&#65292;&#24182;&#25351;&#20986;&#20855;&#26377;&#27491;&#32929;&#24687;&#30340;&#36164;&#20135;&#22312;&#22343;&#34913;&#20215;&#26684;&#19978;&#34920;&#29616;&#20986;&#20856;&#22411;&#30340;&#39548;&#23792;&#27873;&#27819;&#24418;&#24577;&#12290;&#24403;&#24066;&#22330;&#26411;&#26399;&#20986;&#29616;&#24613;&#21095;&#19979;&#36300;&#26102;&#65292;&#20250;&#35302;&#21457;&#36164;&#20135;&#30340;&#38169;&#35823;&#20272;&#20540;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#19968;&#20010;&#21452;&#36164;&#20135;&#22343;&#34913;&#27169;&#22411;&#20013;&#65292;&#29702;&#35770;&#30740;&#31350;&#20102;&#20215;&#26684;&#27873;&#27819;&#21644;&#23849;&#28291;&#36807;&#31243;&#30340;&#24418;&#25104;&#12290;&#25512;&#23548;&#20102;&#19981;&#21516;&#22522;&#20110;&#26234;&#33021;&#20307;&#30340;&#27169;&#22411;&#30340;&#24179;&#22343;&#22343;&#34913;&#20215;&#26684;&#21160;&#24577;&#30340;&#23384;&#22312;&#30340;&#20805;&#20998;&#24517;&#35201;&#26465;&#20214;&#65292;&#20854;&#20013;&#20195;&#29702;&#20154;&#26681;&#25454;&#22240;&#23376;&#21644;&#25237;&#36164;&#20132;&#26131;&#31574;&#30053;&#36827;&#34892;&#21306;&#20998;&#12290;&#19982;&#23454;&#39564;&#32467;&#26524;&#19968;&#33268;&#65292;&#25105;&#20204;&#34920;&#26126;&#65292;&#20855;&#26377;&#27491;&#24179;&#22343;&#32929;&#24687;&#30340;&#36164;&#20135;&#65288;&#21363;&#65292;&#20855;&#26377;&#20005;&#26684;&#19979;&#38477;&#30340;&#22522;&#26412;&#20215;&#20540;&#65289;&#22312;&#22343;&#34913;&#20215;&#26684;&#19978;&#26174;&#31034;&#20986;&#23454;&#39564;&#36164;&#20135;&#24066;&#22330;&#20013;&#20856;&#22411;&#30340;&#39548;&#23792;&#24418;&#27873;&#27819;&#12290;&#27492;&#22806;&#65292;&#24403;&#24066;&#22330;&#26411;&#26399;&#20986;&#29616;&#24613;&#21095;&#30340;&#20215;&#26684;&#19979;&#36300;&#26102;&#65292;&#24341;&#21457;&#20102;&#20855;&#26377;&#24658;&#23450;&#22522;&#26412;&#20215;&#20540;&#30340;&#36164;&#20135;&#20197;&#21450;&#26174;&#31034;&#20215;&#26684;&#27873;&#27819;&#24418;&#29366;&#30340;&#20854;&#20182;&#36164;&#20135;&#30340;&#38169;&#35823;&#35780;&#20272;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
The price-bubble and crash process formation is theoretically investigated in a two-asset equilibrium model. Sufficient and necessary conditions are derived for the existence of average equilibrium price dynamics of different agent-based models, where agents are distinguished in terms of factor and investment trading strategies. In line with experimental results, we show that assets with a positive average dividend, i.e., with a strictly declining fundamental value, display at the equilibrium price the typical hump-shaped bubble observed in experimental asset markets. Moreover, a misvaluation effect is observed in the asset with a constant fundamental value, triggered by the other asset that displays the price bubble shape when a sharp price decline is exhibited at the end of the market.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#24066;&#22330;&#24433;&#21709;&#21338;&#24328;&#20013;&#30340;&#32435;&#20160;&#22343;&#34913;&#65292;&#20174;&#20013;&#21457;&#29616;&#20102;&#38544;&#21547;&#30340;&#30636;&#24577;&#24433;&#21709;&#65292;&#25581;&#31034;&#20102;&#30636;&#24577;&#24433;&#21709;&#27169;&#22411;&#30340;&#34928;&#20943;&#26680;&#20989;&#25968;&#30340;&#20989;&#25968;&#24418;&#24335;&#12290;</title><link>http://arxiv.org/abs/2205.00494</link><description>&lt;p&gt;
&#19968;&#31687;&#20851;&#20110;&#27704;&#20037;&#24066;&#22330;&#24433;&#21709;&#21338;&#24328;&#32435;&#20160;&#22343;&#34913;&#30340;&#30636;&#24577;&#24433;&#21709;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Transient impact from the Nash equilibrium of a permanent market impact game. (arXiv:2205.00494v2 [q-fin.TR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.00494
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24066;&#22330;&#24433;&#21709;&#21338;&#24328;&#20013;&#30340;&#32435;&#20160;&#22343;&#34913;&#65292;&#20174;&#20013;&#21457;&#29616;&#20102;&#38544;&#21547;&#30340;&#30636;&#24577;&#24433;&#21709;&#65292;&#25581;&#31034;&#20102;&#30636;&#24577;&#24433;&#21709;&#27169;&#22411;&#30340;&#34928;&#20943;&#26680;&#20989;&#25968;&#30340;&#20989;&#25968;&#24418;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#37327;&#23454;&#35777;&#25991;&#29486;&#34920;&#26126;&#65292;&#37329;&#34701;&#20215;&#26684;&#30340;&#24066;&#22330;&#24433;&#21709;&#26159;&#30701;&#26242;&#30340;&#65292;&#20294;&#20174;&#29702;&#35770;&#19978;&#35762;&#65292;&#36825;&#31181;&#20020;&#26102;&#24615;&#30340;&#21407;&#22240;&#20173;&#19981;&#28165;&#26970;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#22266;&#23450;&#21644;&#27704;&#20037;&#24433;&#21709;&#30340;&#24066;&#22330;&#24433;&#21709;&#21338;&#24328;&#20013;&#30340;&#26041;&#21521;&#20132;&#26131;&#32773;&#21644;&#22871;&#21033;&#20132;&#26131;&#32773;&#20043;&#38388;&#30340;&#32435;&#20160;&#22343;&#34913;&#65292;&#21457;&#29616;&#38544;&#21547;&#30340;&#30636;&#24577;&#24433;&#21709;&#26469;&#33258;&#20110;&#26041;&#21521;&#20132;&#26131;&#32773;&#30340;&#20132;&#26131;&#31574;&#30053;&#21644;&#20215;&#26684;&#23545;&#35746;&#21333;&#27969;&#30340;&#21453;&#24212;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#26041;&#27861;&#26469;&#25512;&#23548;&#30636;&#24577;&#24433;&#21709;&#27169;&#22411;&#30340;&#34928;&#20943;&#26680;&#20989;&#25968;&#30340;&#20989;&#25968;&#24418;&#24335;&#65292;&#31532;&#19968;&#31181;&#26041;&#27861;&#22522;&#20110;&#36807;&#21435;&#30340;&#35746;&#21333;&#27969;&#21644;&#26410;&#26469;&#30340;&#20215;&#26684;&#21464;&#21270;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#32780;&#31532;&#20108;&#31181;&#26041;&#27861;&#21017;&#35299;&#20915;&#20102;&#19968;&#31181;&#36870;&#26368;&#20248;&#25191;&#34892;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
A large body of empirical literature has shown that market impact of financial prices is transient. However, from a theoretical standpoint, the origin of this temporary nature is still unclear. We show that an implied transient impact arises from the Nash equilibrium between a directional trader and one arbitrageur in a market impact game with fixed and permanent impact. The implied impact is the one that can be empirically inferred from the directional trader's trading profile and price reaction to order flow. Specifically, we propose two approaches to derive the functional form of the decay kernel of the Transient Impact Model, one of the most popular empirical models for transient impact, from the behaviour of the directional trader at the Nash equilibrium. The first is based on the relationship between past order flow and future price change, while in the second we solve an inverse optimal execution problem. We show that in the first approach the implied kernel is unique, while in 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20027;&#35201;&#30740;&#31350;&#20102;&#20351;&#29992;&#24773;&#24863;&#20449;&#21495;&#39044;&#27979;&#21152;&#23494;&#36135;&#24065;&#22238;&#25253;&#30340;&#26041;&#27861;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#24369;&#30417;&#30563;&#23398;&#20064;&#30340;NLP&#26041;&#27861;&#26469;&#35299;&#20915;&#25991;&#26412;&#25968;&#25454;&#26080;&#26631;&#31614;&#30340;&#38382;&#39064;&#65292;&#24182;&#35777;&#23454;&#23427;&#33021;&#25552;&#39640;&#39044;&#27979;&#20215;&#20540;&#21644;&#20934;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2204.05781</link><description>&lt;p&gt;
&#20174;&#24773;&#24863;&#20449;&#21495;&#39044;&#27979;&#21152;&#23494;&#36135;&#24065;&#22238;&#25253;&#65306;BERT&#20998;&#31867;&#22120;&#21644;&#24369;&#30417;&#30563;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Forecasting Cryptocurrency Returns from Sentiment Signals: An Analysis of BERT Classifiers and Weak Supervision. (arXiv:2204.05781v3 [q-fin.ST] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2204.05781
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20027;&#35201;&#30740;&#31350;&#20102;&#20351;&#29992;&#24773;&#24863;&#20449;&#21495;&#39044;&#27979;&#21152;&#23494;&#36135;&#24065;&#22238;&#25253;&#30340;&#26041;&#27861;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#24369;&#30417;&#30563;&#23398;&#20064;&#30340;NLP&#26041;&#27861;&#26469;&#35299;&#20915;&#25991;&#26412;&#25968;&#25454;&#26080;&#26631;&#31614;&#30340;&#38382;&#39064;&#65292;&#24182;&#35777;&#23454;&#23427;&#33021;&#25552;&#39640;&#39044;&#27979;&#20215;&#20540;&#21644;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#39044;&#27979;&#20013;&#39044;&#27979;&#37329;&#34701;&#24066;&#22330;&#20215;&#26684;&#21464;&#21160;&#26159;&#19968;&#20010;&#21463;&#25345;&#32493;&#20851;&#27880;&#30340;&#35805;&#39064;&#12290;&#38543;&#30528;&#28145;&#24230;&#23398;&#20064;&#21644;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#65288;NLP&#65289;&#30340;&#36827;&#27493;&#20197;&#21450;&#20197;&#26032;&#38395;&#25991;&#31456;&#12289;&#31038;&#20132;&#23186;&#20307;&#24086;&#23376;&#31561;&#24418;&#24335;&#25552;&#20379;&#30340;&#22823;&#37327;&#25991;&#26412;&#25968;&#25454;&#30340;&#21487;&#29992;&#24615;&#65292;&#36234;&#26469;&#36234;&#22810;&#30340;&#30740;&#31350;&#23558;&#22522;&#20110;&#25991;&#26412;&#30340;&#39044;&#27979;&#22240;&#32032;&#32435;&#20837;&#39044;&#27979;&#27169;&#22411;&#20013;&#12290;&#25105;&#20204;&#36890;&#36807;&#24341;&#20837;&#24369;&#30417;&#30563;&#23398;&#20064;&#65292;&#19968;&#31181;&#26368;&#36817;&#25552;&#20986;&#30340;NLP&#26041;&#27861;&#26469;&#35299;&#20915;&#25991;&#26412;&#25968;&#25454;&#26080;&#26631;&#31614;&#30340;&#38382;&#39064;&#65292;&#20026;&#36825;&#20010;&#39046;&#22495;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;&#27809;&#26377;&#20381;&#36182;&#21464;&#37327;&#65292;&#23601;&#19981;&#21487;&#33021;&#22312;&#33258;&#23450;&#20041;&#35821;&#26009;&#24211;&#19978;&#24494;&#35843;&#39044;&#35757;&#32451;&#30340;NLP&#27169;&#22411;&#12290;&#25105;&#20204;&#35777;&#23454;&#20102;&#20351;&#29992;&#24369;&#26631;&#31614;&#24494;&#35843;&#30340;&#25991;&#26412;&#29305;&#24449;&#22686;&#24378;&#20102;&#39044;&#27979;&#20215;&#20540;&#65292;&#24182;&#25552;&#39640;&#20102;&#39044;&#27979;&#21152;&#23494;&#36135;&#24065;&#25910;&#30410;&#30340;&#20934;&#30830;&#24615;&#12290;&#26356;&#22522;&#26412;&#30340;&#26159;&#65292;&#25105;&#20204;&#25152;&#25552;&#20986;&#30340;&#24314;&#27169;&#33539;&#24335;&#8212;&#8212;&#24369;&#26631;&#35760;&#29305;&#23450;&#39046;&#22495;&#25991;&#26412;&#21644;&#24494;&#35843;&#39044;&#35757;&#32451;&#30340;NLP&#27169;&#22411;&#8212;&#8212;&#22312;&#65288;&#37329;&#34701;&#65289;&#39044;&#27979;&#20013;&#26222;&#36866;&#36866;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Anticipating price developments in financial markets is a topic of continued interest in forecasting. Funneled by advancements in deep learning and natural language processing (NLP) together with the availability of vast amounts of textual data in form of news articles, social media postings, etc., an increasing number of studies incorporate text-based predictors in forecasting models. We contribute to this literature by introducing weak learning, a recently proposed NLP approach to address the problem that text data is unlabeled. Without a dependent variable, it is not possible to finetune pretrained NLP models on a custom corpus. We confirm that finetuning using weak labels enhances the predictive value of text-based features and raises forecast accuracy in the context of predicting cryptocurrency returns. More fundamentally, the modeling paradigm we present, weak labeling domain-specific text and finetuning pretrained NLP models, is universally applicable in (financial) forecasting 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#21033;&#29992;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#25552;&#20986;&#26657;&#20934;&#34893;&#29983;&#21697;&#23450;&#20215;&#27169;&#22411;&#38382;&#39064;&#30340;&#21338;&#24328;&#35770;&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#24076;&#26395;&#35813;&#26041;&#27861;&#21487;&#29992;&#20110;&#35299;&#20915;&#20854;&#20182;&#37329;&#34701;&#39046;&#22495;&#30340;&#38382;&#39064;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#35813;&#31639;&#27861;&#33021;&#22815;&#23398;&#20064;&#23616;&#37096;&#27874;&#21160;&#29575;&#20197;&#21450;&#26368;&#23567;&#21270;&#30334;&#24917;&#22823;&#26399;&#26435;&#20215;&#26684;&#25152;&#38656;&#30340;&#36335;&#24452;&#20381;&#36182;&#24615;&#12290;</title><link>http://arxiv.org/abs/2203.06865</link><description>&lt;p&gt;
&#34893;&#29983;&#21697;&#23450;&#20215;&#27169;&#22411;&#30340;&#26657;&#20934;&#65306;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#35266;&#28857;
&lt;/p&gt;
&lt;p&gt;
Calibration of Derivative Pricing Models: a Multi-Agent Reinforcement Learning Perspective. (arXiv:2203.06865v3 [q-fin.CP] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.06865
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#25552;&#20986;&#26657;&#20934;&#34893;&#29983;&#21697;&#23450;&#20215;&#27169;&#22411;&#38382;&#39064;&#30340;&#21338;&#24328;&#35770;&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#24076;&#26395;&#35813;&#26041;&#27861;&#21487;&#29992;&#20110;&#35299;&#20915;&#20854;&#20182;&#37329;&#34701;&#39046;&#22495;&#30340;&#38382;&#39064;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#35813;&#31639;&#27861;&#33021;&#22815;&#23398;&#20064;&#23616;&#37096;&#27874;&#21160;&#29575;&#20197;&#21450;&#26368;&#23567;&#21270;&#30334;&#24917;&#22823;&#26399;&#26435;&#20215;&#26684;&#25152;&#38656;&#30340;&#36335;&#24452;&#20381;&#36182;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#37327;&#21270;&#37329;&#34701;&#20013;&#26368;&#22522;&#26412;&#30340;&#38382;&#39064;&#20043;&#19968;&#26159;&#23384;&#22312;&#36866;&#21512;&#32473;&#23450;&#19968;&#32452;&#26399;&#26435;&#24066;&#22330;&#20215;&#26684;&#30340;&#36830;&#32493;&#26102;&#38388;&#25193;&#25955;&#27169;&#22411;&#12290;&#20256;&#32479;&#19978;&#65292;&#20154;&#20204;&#20351;&#29992;&#30452;&#35273;&#12289;&#29702;&#35770;&#21644;&#32463;&#39564;&#20998;&#26512;&#30340;&#28151;&#21512;&#26041;&#27861;&#26469;&#23547;&#25214;&#23454;&#29616;&#31934;&#30830;&#25110;&#36817;&#20284;&#21305;&#37197;&#30340;&#27169;&#22411;&#12290;&#25105;&#20204;&#30340;&#36129;&#29486;&#22312;&#20110;&#23637;&#31034;&#22914;&#20309;&#36890;&#36807;&#36866;&#24403;&#30340;&#21338;&#24328;&#29702;&#35770;&#24418;&#24335;&#21270;&#38382;&#39064;&#65292;&#20511;&#21161;&#29616;&#20195;&#28145;&#24230;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#30340;&#29616;&#26377;&#36827;&#23637;&#26469;&#25628;&#32034;&#38543;&#26426;&#36807;&#31243;&#31354;&#38388;&#65292;&#20197;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#25105;&#20204;&#24076;&#26395;&#25105;&#20204;&#30340;&#25216;&#26415;&#21487;&#20197;&#34987;&#31038;&#21306;&#21033;&#29992;&#21644;&#25193;&#23637;&#65292;&#20197;&#35299;&#20915;&#35813;&#39046;&#22495;&#30340;&#37325;&#35201;&#38382;&#39064;&#65292;&#22914;&#32852;&#21512;SPX-VIX&#26657;&#20934;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#34920;&#26126;&#65292;&#25105;&#20204;&#33021;&#22815;&#23398;&#20064;&#23616;&#37096;&#27874;&#21160;&#29575;&#20197;&#21450;&#22312;&#27874;&#21160;&#29575;&#36807;&#31243;&#20013;&#25152;&#38656;&#30340;&#36335;&#24452;&#20381;&#36182;&#24615;&#65292;&#20197;&#26368;&#23567;&#21270;&#30334;&#24917;&#22823;&#26399;&#26435;&#30340;&#20215;&#26684;&#12290;&#25105;&#20204;&#30340;&#31639;&#27861;&#21487;&#20197;&#30475;&#20316;&#26159;&#19968;&#31181;&#31890;&#23376;&#26041;&#27861;&#65292;&#31867;&#20284;&#20110;Guyon et Henry-Labordere&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
One of the most fundamental questions in quantitative finance is the existence of continuous-time diffusion models that fit market prices of a given set of options. Traditionally, one employs a mix of intuition, theoretical and empirical analysis to find models that achieve exact or approximate fits. Our contribution is to show how a suitable game theoretical formulation of this problem can help solve this question by leveraging existing developments in modern deep multi-agent reinforcement learning to search in the space of stochastic processes. More importantly, we hope that our techniques can be leveraged and extended by the community to solve important problems in that field, such as the joint SPX-VIX calibration problem. Our experiments show that we are able to learn local volatility, as well as path-dependence required in the volatility process to minimize the price of a Bermudan option. Our algorithm can be seen as a particle method \`{a} la Guyon et Henry-Labordere where partic
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#40065;&#26834;&#20248;&#21270;&#30340;&#26080;&#21442;&#25968;&#31639;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#35745;&#31639;&#23494;&#38598;&#22411;&#38543;&#26426;&#26368;&#20248;&#20572;&#26102;&#38382;&#39064;&#65292;&#35813;&#26041;&#27861;&#20351;&#29992;&#27169;&#25311;&#26500;&#36896;&#40065;&#26834;&#20248;&#21270;&#38382;&#39064;&#20197;&#36924;&#36817;&#38543;&#26426;&#26368;&#20248;&#20572;&#26102;&#38382;&#39064;&#65292;&#24182;&#36890;&#36807;&#35299;&#20915;&#40065;&#26834;&#20248;&#21270;&#38382;&#39064;&#33719;&#24471;&#20960;&#20046;&#26368;&#20248;&#30340;&#39532;&#23572;&#31185;&#22827;&#20572;&#26102;&#35268;&#21017;&#29992;&#20110;&#35299;&#20915;&#38543;&#26426;&#26368;&#20248;&#20572;&#26102;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2103.03300</link><description>&lt;p&gt;
&#22522;&#20110;&#40065;&#26834;&#20248;&#21270;&#30340;&#26080;&#21442;&#25968;&#31639;&#27861;&#27714;&#35299;&#26368;&#20248;&#20572;&#26102;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
A nonparametric algorithm for optimal stopping based on robust optimization. (arXiv:2103.03300v4 [math.OC] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2103.03300
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#40065;&#26834;&#20248;&#21270;&#30340;&#26080;&#21442;&#25968;&#31639;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#35745;&#31639;&#23494;&#38598;&#22411;&#38543;&#26426;&#26368;&#20248;&#20572;&#26102;&#38382;&#39064;&#65292;&#35813;&#26041;&#27861;&#20351;&#29992;&#27169;&#25311;&#26500;&#36896;&#40065;&#26834;&#20248;&#21270;&#38382;&#39064;&#20197;&#36924;&#36817;&#38543;&#26426;&#26368;&#20248;&#20572;&#26102;&#38382;&#39064;&#65292;&#24182;&#36890;&#36807;&#35299;&#20915;&#40065;&#26834;&#20248;&#21270;&#38382;&#39064;&#33719;&#24471;&#20960;&#20046;&#26368;&#20248;&#30340;&#39532;&#23572;&#31185;&#22827;&#20572;&#26102;&#35268;&#21017;&#29992;&#20110;&#35299;&#20915;&#38543;&#26426;&#26368;&#20248;&#20572;&#26102;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#20248;&#20572;&#26102;&#38382;&#39064;&#26159;&#19968;&#31867;&#22522;&#26412;&#30340;&#38543;&#26426;&#21160;&#24577;&#20248;&#21270;&#38382;&#39064;&#65292;&#22312;&#37329;&#34701;&#21644;&#36816;&#33829;&#31649;&#29702;&#20013;&#26377;&#35768;&#22810;&#24212;&#29992;&#12290;&#26412;&#25991;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#26469;&#35299;&#20915;&#20855;&#26377;&#24050;&#30693;&#27010;&#29575;&#20998;&#24067;&#30340;&#35745;&#31639;&#23494;&#38598;&#22411;&#38543;&#26426;&#26368;&#20248;&#20572;&#26102;&#38382;&#39064;&#12290;&#35813;&#26041;&#27861;&#20351;&#29992;&#27169;&#25311;&#26500;&#36896;&#19968;&#20010;&#40065;&#26834;&#20248;&#21270;&#38382;&#39064;&#65292;&#20197;&#20219;&#24847;&#31934;&#24230;&#36924;&#36817;&#38543;&#26426;&#26368;&#20248;&#20572;&#26102;&#38382;&#39064;&#65307;&#28982;&#21518;&#35299;&#20915;&#40065;&#26834;&#20248;&#21270;&#38382;&#39064;&#65292;&#20197;&#33719;&#24471;&#20960;&#20046;&#26368;&#20248;&#30340;&#39532;&#23572;&#21487;&#22827;&#20572;&#26102;&#35268;&#21017;&#65292;&#29992;&#20110;&#35299;&#20915;&#38543;&#26426;&#26368;&#20248;&#20572;&#26102;&#38382;&#39064;&#12290;&#26412;&#25991;&#37325;&#28857;&#35774;&#35745;&#20102;&#27714;&#35299;&#36924;&#36817;&#38543;&#26426;&#26368;&#20248;&#20572;&#26102;&#38382;&#39064;&#30340;&#40065;&#26834;&#20248;&#21270;&#31639;&#27861;&#12290;&#30001;&#20110;&#36825;&#20123;&#40065;&#26834;&#20248;&#21270;&#38382;&#39064;&#38656;&#35201;&#22312;&#25152;&#26377;&#39532;&#23572;&#21487;&#22827;&#20572;&#26102;&#35268;&#21017;&#30340;&#26080;&#38480;&#32500;&#31354;&#38388;&#19978;&#36827;&#34892;&#20248;&#21270;&#65292;&#22240;&#27492;&#23427;&#20204;&#24456;&#38590;&#27714;&#35299;&#12290;&#25105;&#20204;&#36890;&#36807;&#34920;&#24449;&#38543;&#26426;&#26368;&#20248;&#20572;&#26102;&#38382;&#39064;&#30340;&#26368;&#20248;&#39532;&#23572;&#21487;&#22827;&#20572;&#26102;&#35268;&#21017;&#30340;&#32467;&#26500;&#26469;&#20811;&#26381;&#36825;&#19968;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
Optimal stopping is a fundamental class of stochastic dynamic optimization problems with numerous applications in finance and operations management. We introduce a new approach for solving computationally-demanding stochastic optimal stopping problems with known probability distributions. The approach uses simulation to construct a robust optimization problem that approximates the stochastic optimal stopping problem to any arbitrary accuracy; we then solve the robust optimization problem to obtain near-optimal Markovian stopping rules for the stochastic optimal stopping problem.  In this paper, we focus on designing algorithms for solving the robust optimization problems that approximate the stochastic optimal stopping problems. These robust optimization problems are challenging to solve because they require optimizing over the infinite-dimensional space of all Markovian stopping rules. We overcome this challenge by characterizing the structure of optimal Markovian stopping rules for t
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#32463;&#27982;&#32593;&#32476;&#20013;&#26368;&#20248;&#24178;&#39044;&#30340;&#38382;&#39064;&#65292;&#21457;&#29616;&#35813;&#38382;&#39064;&#26159;NP&#38590;&#65292;&#20294;&#38543;&#26426;&#21270;&#22833;&#36133;&#38408;&#20540;&#21487;&#20197;&#20351;&#38382;&#39064;&#21464;&#20026;&#21333;&#35843;&#23376;&#27169;&#22359;&#21270;&#30340;&#24418;&#24335;&#65292;&#20174;&#32780;&#20351;&#29992;&#29616;&#26377;&#30340;&#22810;&#39033;&#24335;&#26102;&#38388;&#24378;&#36817;&#20284;&#31639;&#27861;&#12290;&#21516;&#26102;&#65292;&#22312;&#20854;&#20182;&#32463;&#27982;&#32593;&#32476;&#38382;&#39064;&#26041;&#38754;&#65292;&#35813;&#35770;&#25991;&#20063;&#21457;&#29616;&#35745;&#31639;&#32463;&#27982;&#32593;&#32476;&#26399;&#26395;&#20215;&#20540;&#20855;&#26377;&#35745;&#31639;&#22797;&#26434;&#24615;&#65292;&#20294;&#24433;&#21709;&#21147;&#26368;&#22823;&#21270;&#31639;&#27861;&#21487;&#20197;&#23454;&#29616;&#26377;&#25928;&#30340;&#36827;&#21475;&#12290;</title><link>http://arxiv.org/abs/2102.01800</link><description>&lt;p&gt;
&#20351;&#29992;&#24433;&#21709;&#21147;&#26368;&#22823;&#21270;&#26041;&#27861;&#36827;&#34892;&#32463;&#27982;&#32593;&#32476;&#20013;&#30340;&#26368;&#20248;&#24178;&#39044;
&lt;/p&gt;
&lt;p&gt;
Optimal Intervention in Economic Networks using Influence Maximization Methods. (arXiv:2102.01800v2 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2102.01800
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#32463;&#27982;&#32593;&#32476;&#20013;&#26368;&#20248;&#24178;&#39044;&#30340;&#38382;&#39064;&#65292;&#21457;&#29616;&#35813;&#38382;&#39064;&#26159;NP&#38590;&#65292;&#20294;&#38543;&#26426;&#21270;&#22833;&#36133;&#38408;&#20540;&#21487;&#20197;&#20351;&#38382;&#39064;&#21464;&#20026;&#21333;&#35843;&#23376;&#27169;&#22359;&#21270;&#30340;&#24418;&#24335;&#65292;&#20174;&#32780;&#20351;&#29992;&#29616;&#26377;&#30340;&#22810;&#39033;&#24335;&#26102;&#38388;&#24378;&#36817;&#20284;&#31639;&#27861;&#12290;&#21516;&#26102;&#65292;&#22312;&#20854;&#20182;&#32463;&#27982;&#32593;&#32476;&#38382;&#39064;&#26041;&#38754;&#65292;&#35813;&#35770;&#25991;&#20063;&#21457;&#29616;&#35745;&#31639;&#32463;&#27982;&#32593;&#32476;&#26399;&#26395;&#20215;&#20540;&#20855;&#26377;&#35745;&#31639;&#22797;&#26434;&#24615;&#65292;&#20294;&#24433;&#21709;&#21147;&#26368;&#22823;&#21270;&#31639;&#27861;&#21487;&#20197;&#23454;&#29616;&#26377;&#25928;&#30340;&#36827;&#21475;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#22312;Elliott-Golub-Jackson&#32593;&#32476;&#27169;&#22411;&#20013;&#36827;&#34892;&#26368;&#20248;&#24178;&#39044;&#65292;&#24182;&#23637;&#31034;&#20854;&#21487;&#36716;&#21270;&#20026;&#31867;&#20284;&#20110;&#24433;&#21709;&#21147;&#26368;&#22823;&#21270;&#30340;&#24418;&#24335;&#65292;&#34987;&#35299;&#37322;&#20026;&#40664;&#35748;&#32423;&#32852;&#30340;&#21453;&#21521;&#12290;&#25105;&#20204;&#23558;&#26368;&#20248;&#24178;&#39044;&#38382;&#39064;&#30340;&#20998;&#26512;&#25193;&#23637;&#21040;&#32463;&#27982;&#32593;&#32476;&#35774;&#32622;&#20013;&#65292;&#24182;&#35777;&#26126;&#20960;&#20010;&#20851;&#20110;&#26368;&#20248;&#24178;&#39044;&#30340;&#32467;&#35770;&#65306;&#23427;&#26159;NP&#38590;&#30340;&#65292;&#24182;&#19988;&#19981;&#33021;&#22312;&#22810;&#39033;&#24335;&#26102;&#38388;&#20869;&#20197;&#24120;&#25968;&#36817;&#20284;&#12290;&#21453;&#36807;&#26469;&#65292;&#25105;&#20204;&#23637;&#31034;&#38543;&#26426;&#21270;&#22833;&#36133;&#38408;&#20540;&#23548;&#33268;&#20102;&#38382;&#39064;&#30340;&#19968;&#20010;&#29256;&#26412;&#65292;&#35813;&#29256;&#26412;&#26159;&#21333;&#35843;&#23376;&#27169;&#22359;&#21270;&#30340;&#65292;&#29616;&#26377;&#30340;&#22810;&#39033;&#24335;&#26102;&#38388;&#24378;&#36817;&#20284;&#21487;&#20197;&#24212;&#29992;&#20110;&#35813;&#38382;&#39064;&#12290;&#38500;&#20102;&#26368;&#20248;&#24178;&#39044;&#20043;&#22806;&#65292;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#25105;&#20204;&#20998;&#26512;&#22312;&#20854;&#20182;&#32463;&#27982;&#32593;&#32476;&#38382;&#39064;&#26041;&#38754;&#30340;&#23454;&#38469;&#24433;&#21709;&#65306;&#65288;1&#65289;&#35745;&#31639;&#32463;&#27982;&#32593;&#32476;&#30340;&#26399;&#26395;&#20215;&#20540;&#20855;&#26377;&#35745;&#31639;&#22797;&#26434;&#24615;&#65292;&#65288;2&#65289;&#24433;&#21709;&#21147;&#26368;&#22823;&#21270;&#31639;&#27861;&#21487;&#20197;&#23454;&#29616;&#26377;&#25928;&#30340;&#36827;&#21475;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider optimal intervention in the Elliott-Golub-Jackson network model \cite{jackson14} and we show that it can be transformed into an influence maximization-like form, interpreted as the reverse of a default cascade. Our analysis of the optimal intervention problem extends well-established targeting results to the economic network setting, which requires additional theoretical steps. We prove several results about optimal intervention: it is NP-hard and cannot be approximated to a constant factor in polynomial time. In turn, we show that randomizing failure thresholds leads to a version of the problem which is monotone submodular, for which existing powerful approximations in polynomial time can be applied. In addition to optimal intervention, we also show practical consequences of our analysis to other economic network problems: (1) it is computationally hard to calculate expected values in the economic network, and (2) influence maximization algorithms can enable efficient impo
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#19968;&#31181;&#22312;&#24130;&#24459;&#20998;&#24067;&#19979;&#30340;&#23614;&#37096;&#26399;&#26435;&#23450;&#20215;&#30340;&#26041;&#27861;&#65292;&#20197;&#21333;&#19968;&#21442;&#25968;&#23614;&#25351;&#25968;&#945;&#20316;&#20026;&#21807;&#19968;&#21464;&#37327;&#12290;&#35813;&#26041;&#27861;&#33021;&#22815;&#36328;&#36234;&#38271;&#26102;&#38388;&#25193;&#23637;&#26399;&#38388;&#26469;&#35745;&#31639;&#26399;&#26435;&#20215;&#26684;&#65292;&#24182;&#26816;&#39564;&#30456;&#23545;&#23614;&#37096;&#26399;&#26435;&#28322;&#20215;&#30340;&#22810;&#31181;&#29702;&#35770;&#12290;</title><link>http://arxiv.org/abs/1908.02347</link><description>&lt;p&gt;
&#24130;&#24459;&#20998;&#24067;&#19979;&#30340;&#23614;&#37096;&#26399;&#26435;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
Tail Option Pricing Under Power Laws. (arXiv:1908.02347v3 [q-fin.PR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1908.02347
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#19968;&#31181;&#22312;&#24130;&#24459;&#20998;&#24067;&#19979;&#30340;&#23614;&#37096;&#26399;&#26435;&#23450;&#20215;&#30340;&#26041;&#27861;&#65292;&#20197;&#21333;&#19968;&#21442;&#25968;&#23614;&#25351;&#25968;&#945;&#20316;&#20026;&#21807;&#19968;&#21464;&#37327;&#12290;&#35813;&#26041;&#27861;&#33021;&#22815;&#36328;&#36234;&#38271;&#26102;&#38388;&#25193;&#23637;&#26399;&#38388;&#26469;&#35745;&#31639;&#26399;&#26435;&#20215;&#26684;&#65292;&#24182;&#26816;&#39564;&#30456;&#23545;&#23614;&#37096;&#26399;&#26435;&#28322;&#20215;&#30340;&#22810;&#31181;&#29702;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#32473;&#23450;&#23614;&#37096;&#34892;&#26435;&#20215;&#26684;K&#30340;&#24773;&#20917;&#19979;&#23545;&#26399;&#26435;&#20215;&#26684;&#36827;&#34892;&#25193;&#23637;&#65288;&#23545;&#20110;&#30475;&#28072;&#26399;&#26435;&#65292;&#25152;&#26377;&#34892;&#26435;&#20215;&gt; K&#65307;&#23545;&#20110;&#30475;&#36300;&#26399;&#26435;&#65292;&#25152;&#26377;&#34892;&#26435;&#20215;&lt; K&#65289;&#65292;&#24182;&#20551;&#35774;&#24310;&#32493;&#37096;&#20998;&#36981;&#24490;&#25105;&#20204;&#23450;&#20041;&#30340;&#8220;Karamata Constant&#8221;&#65292;&#22312;&#27492;&#20043;&#19978;&#24378;&#21183; Pareto &#23450;&#24459;&#25104;&#31435;&#12290;&#35813;&#21551;&#21457;&#24335;&#26041;&#27861;&#22312;&#19968;&#20123;&#28201;&#21644;&#30340;&#22871;&#21033;&#32422;&#26463;&#26465;&#20214;&#19979;&#29992;&#23614;&#25351;&#25968;&#945;&#20316;&#20026;&#21807;&#19968;&#21442;&#25968;&#26469;&#20135;&#29983;&#26399;&#26435;&#30340;&#30456;&#23545;&#20215;&#26684;&#12290; &#19981;&#38656;&#35201;&#20687;&#26041;&#24046;&#26377;&#38480;&#31561;&#24120;&#35265;&#38480;&#21046;&#12290;&#35813;&#26041;&#27861;&#20801;&#35768;&#25105;&#20204;&#20180;&#32454;&#30740;&#31350;&#27874;&#21160;&#29575;&#26354;&#38754;&#24182;&#26816;&#39564;&#30456;&#23545;&#23614;&#37096;&#26399;&#26435;&#28322;&#20215;&#30340;&#21508;&#31181;&#29702;&#35770;&#65288;&#36890;&#24120;&#22522;&#20110;&#32454;&#23614;&#27169;&#22411;&#21644;&#23545;Black-Scholes&#20844;&#24335;&#30340;&#36731;&#24494;&#20462;&#25913;/&#20020;&#26102;&#22788;&#29702;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
We build a methodology that takes a given option price in the tails with strike $K$ and extends (for calls, all strikes &gt; $K$, for puts all strikes $&lt; K$) assuming the continuation falls into what we define as "Karamata Constant" over which the strong Pareto law holds. The heuristic produces relative prices for options, with for sole parameter the tail index $\alpha$, under some mild arbitrage constraints.  Usual restrictions such as finiteness of variance are not required.  The methodology allows us to scrutinize the volatility surface and test various theories of relative tail option overpricing (usually built on thin tailed models and minor modifications/fudging of the Black-Scholes formula).
&lt;/p&gt;</description></item></channel></rss>