<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#30740;&#31350;&#21457;&#29616;&#65292;&#26032;&#38395;&#30340;&#26032;&#39062;&#24615;&#22686;&#21152;&#20250;&#39044;&#27979;&#32929;&#24066;&#22238;&#25253;&#21644;&#23439;&#35266;&#32463;&#27982;&#32467;&#26524;&#30340;&#19979;&#38477;&#12290;&#36890;&#36807;&#35745;&#31639;&#26032;&#38395;&#30340;&#29109;&#65292;&#25105;&#20204;&#21457;&#29616;&#29109;&#26159;&#27604;&#26631;&#20934;&#25351;&#26631;&#26356;&#22909;&#30340;&#24066;&#22330;&#22238;&#25253;&#39044;&#27979;&#25351;&#26631;&#12290;&#29109;&#39118;&#38505;&#19981;&#33021;&#34987;&#29616;&#26377;&#30340;&#22810;&#31354;&#22240;&#23376;&#35299;&#37322;&#12290;</title><link>http://arxiv.org/abs/2309.05560</link><description>&lt;p&gt;
&#26032;&#38395;&#30340;&#26032;&#39062;&#24615;&#22686;&#21152;&#39044;&#27979;&#32929;&#24066;&#22238;&#25253;&#21644;&#23439;&#35266;&#32463;&#27982;&#32467;&#26524;&#30340;&#19979;&#38477;
&lt;/p&gt;
&lt;p&gt;
New News is Bad News. (arXiv:2309.05560v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.05560
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21457;&#29616;&#65292;&#26032;&#38395;&#30340;&#26032;&#39062;&#24615;&#22686;&#21152;&#20250;&#39044;&#27979;&#32929;&#24066;&#22238;&#25253;&#21644;&#23439;&#35266;&#32463;&#27982;&#32467;&#26524;&#30340;&#19979;&#38477;&#12290;&#36890;&#36807;&#35745;&#31639;&#26032;&#38395;&#30340;&#29109;&#65292;&#25105;&#20204;&#21457;&#29616;&#29109;&#26159;&#27604;&#26631;&#20934;&#25351;&#26631;&#26356;&#22909;&#30340;&#24066;&#22330;&#22238;&#25253;&#39044;&#27979;&#25351;&#26631;&#12290;&#29109;&#39118;&#38505;&#19981;&#33021;&#34987;&#29616;&#26377;&#30340;&#22810;&#31354;&#22240;&#23376;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#23545;&#22823;&#37327;&#26032;&#38395;&#35821;&#26009;&#24211;&#36816;&#29992;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#35745;&#31639;&#29109;&#27979;&#37327;&#65292;&#25105;&#20204; quantified news novelty &#30340;&#21464;&#21270;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#26032;&#38395;&#30340;&#29109;&#26159;&#24066;&#22330;&#22238;&#25253;&#30340;&#26356;&#22909;&#30340;&#22806;&#26679;&#26412;&#39044;&#27979;&#25351;&#26631;&#65292;&#20854;&#21464;&#21270;&#19982;&#32929;&#24066;&#22238;&#25253;&#21644;&#23439;&#35266;&#32463;&#27982;&#32467;&#26524;&#21576;&#36127;&#30456;&#20851;&#12290;&#27492;&#22806;&#65292;&#29109;&#39118;&#38505;&#35828;&#26126;&#20102;&#19982;&#26032;&#38395;&#35821;&#35328;&#36716;&#21464;&#30456;&#20851;&#30340;&#25972;&#20307;&#39118;&#38505;&#12290;&#24050;&#26377;&#30340;&#22810;&#31354;&#22240;&#23376;&#26080;&#27861;&#35299;&#37322;&#29109;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;
An increase in the novelty of news predicts negative stock market returns and negative macroeconomic outcomes over the next year. We quantify news novelty changes in the distribution of news text - through an entropy measure, calculated using a recurrent neural network applied to a large news corpus. Entropy is a better out-of-sample predictor of market returns than a collection of standard measures. Cross-sectional entropy exposure carries a negative risk premium, suggesting that assets that positively covary with entropy hedge the aggregate risk associated with shifting news language. Entropy risk cannot be explained by existing long-short factors.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22343;&#20540;&#22238;&#24402;&#20215;&#24046;&#20132;&#26131;&#30340;&#22522;&#20110;L&#233;vy&#39537;&#21160;&#30340;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#26694;&#26550;&#65292;&#36890;&#36807;&#20351;&#29992;&#26041;&#24046;&#20285;&#39532;&#39537;&#21160;&#36807;&#31243;&#21644;&#26080;&#31351;&#27963;&#21160;&#30340;&#32431;&#36339;&#36291;&#36807;&#31243;&#24314;&#31435;&#28789;&#27963;&#30340;&#20215;&#26684;&#20215;&#24046;&#27169;&#22411;&#12290;&#36890;&#36807;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#65292;&#24182;&#24320;&#21457;&#19968;&#31181;&#26041;&#24046;&#20943;&#23569;&#25216;&#26415;&#65292;&#30830;&#23450;&#26368;&#20339;&#20132;&#26131;&#27700;&#24179;&#21644;&#30740;&#31350;&#21442;&#25968;&#23545;&#26368;&#20339;&#20132;&#26131;&#31574;&#30053;&#30340;&#24433;&#21709;&#12290;&#27492;&#22806;&#65292;&#36824;&#23558;&#26041;&#27861;&#25193;&#23637;&#21040;&#20102;&#21452;&#21464;&#37327;&#20215;&#24046;&#65292;&#24182;&#25506;&#32034;&#20102;&#30456;&#20851;&#24615;&#23545;&#20132;&#26131;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2309.05512</link><description>&lt;p&gt;
&#22522;&#20110;L&#233;vy&#39537;&#21160;&#30340;&#22343;&#20540;&#22238;&#24402;&#26694;&#26550;&#19979;&#30340;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#20132;&#26131;
&lt;/p&gt;
&lt;p&gt;
Monte Carlo Simulation for Trading Under a L\'evy-Driven Mean-Reverting Framework. (arXiv:2309.05512v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.05512
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22343;&#20540;&#22238;&#24402;&#20215;&#24046;&#20132;&#26131;&#30340;&#22522;&#20110;L&#233;vy&#39537;&#21160;&#30340;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#26694;&#26550;&#65292;&#36890;&#36807;&#20351;&#29992;&#26041;&#24046;&#20285;&#39532;&#39537;&#21160;&#36807;&#31243;&#21644;&#26080;&#31351;&#27963;&#21160;&#30340;&#32431;&#36339;&#36291;&#36807;&#31243;&#24314;&#31435;&#28789;&#27963;&#30340;&#20215;&#26684;&#20215;&#24046;&#27169;&#22411;&#12290;&#36890;&#36807;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#65292;&#24182;&#24320;&#21457;&#19968;&#31181;&#26041;&#24046;&#20943;&#23569;&#25216;&#26415;&#65292;&#30830;&#23450;&#26368;&#20339;&#20132;&#26131;&#27700;&#24179;&#21644;&#30740;&#31350;&#21442;&#25968;&#23545;&#26368;&#20339;&#20132;&#26131;&#31574;&#30053;&#30340;&#24433;&#21709;&#12290;&#27492;&#22806;&#65292;&#36824;&#23558;&#26041;&#27861;&#25193;&#23637;&#21040;&#20102;&#21452;&#21464;&#37327;&#20215;&#24046;&#65292;&#24182;&#25506;&#32034;&#20102;&#30456;&#20851;&#24615;&#23545;&#20132;&#26131;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#26694;&#26550;&#65292;&#29992;&#20110;&#22522;&#20110;L&#233;vy&#39537;&#21160;&#30340;Ornstein-Uhlenbeck&#36807;&#31243;&#24314;&#27169;&#30340;&#22343;&#20540;&#22238;&#24402;&#20215;&#24046;&#23545;&#20132;&#26131;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#30528;&#37325;&#20351;&#29992;&#26041;&#24046;&#20285;&#39532;&#39537;&#21160;&#36807;&#31243;&#65292;&#19968;&#31181;&#26080;&#31351;&#27963;&#21160;&#30340;&#32431;&#36339;&#36291;&#36807;&#31243;&#65292;&#20197;&#23454;&#29616;&#27604;&#32463;&#20856;&#27169;&#22411;&#20013;&#26356;&#28789;&#27963;&#30340;&#20215;&#26684;&#20215;&#24046;&#27169;&#22411;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#27867;&#21270;&#30340;&#20195;&#20215;&#26159;&#27809;&#26377;&#35299;&#26512;&#20844;&#24335;&#65292;&#25152;&#20197;&#25105;&#20204;&#24212;&#29992;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#26469;&#30830;&#23450;&#26368;&#20339;&#20132;&#26131;&#27700;&#24179;&#65292;&#24182;&#24320;&#21457;&#19968;&#31181;&#20351;&#29992;&#25511;&#21046;&#21464;&#37327;&#30340;&#26041;&#24046;&#20943;&#23569;&#25216;&#26415;&#12290;&#22312;&#36825;&#20010;&#26694;&#26550;&#20869;&#65292;&#25105;&#20204;&#25968;&#20540;&#22320;&#30740;&#31350;&#20102;&#27169;&#22411;&#21442;&#25968;&#23545;&#26368;&#20339;&#20132;&#26131;&#31574;&#30053;&#30340;&#24433;&#21709;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#26041;&#27861;&#25193;&#23637;&#21040;&#20102;&#20351;&#29992;&#24369;&#26041;&#24046;&#945;-&#947;&#39537;&#21160;&#36807;&#31243;&#24314;&#27169;&#30340;&#21452;&#21464;&#37327;&#20215;&#24046;&#65292;&#24182;&#25506;&#32034;&#20102;&#30456;&#20851;&#24615;&#23545;&#36825;&#20123;&#20132;&#26131;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a Monte Carlo framework for pairs trading on mean-reverting spreads modeled by L\'evy-driven Ornstein-Uhlenbeck processes. Specifically, we focus on using a variance gamma driving process, an infinite activity pure jump process to allow for more flexible models of the price spread than is available in the classical model. However, this generalization comes at the cost of not having analytic formulas, so we apply Monte Carlo methods to determine optimal trading levels, and develop a variance reduction technique using control variates. Within this framework, we numerically examine how the optimal trading strategies are affected by the parameters of the model. In addition, we extend our method to bivariate spreads modeled using a weak variance alpha-gamma driving process, and explore the effect of correlation on these trades.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20351;&#29992;&#31895;&#36335;&#24452;&#29702;&#35770;&#26469;&#22788;&#29702;&#31163;&#25955;&#26102;&#38388;&#30340;Gamma&#23545;&#20914;&#31574;&#30053;&#65292;&#34920;&#26126;&#21482;&#35201;&#26631;&#30340;&#36164;&#20135;&#20215;&#26684;&#36335;&#24452;&#36275;&#22815;&#35268;&#21017;&#65292;&#35813;&#31574;&#30053;&#21487;&#20197;&#22797;&#21046;&#20854;&#20182;&#27431;&#24335;&#26399;&#26435;&#65292;&#26080;&#38656;&#28385;&#36275;&#23450;&#20215;&#27169;&#22411;&#30340;&#20108;&#27425;&#21464;&#21270;&#26465;&#20214;&#12290;</title><link>http://arxiv.org/abs/2309.05054</link><description>&lt;p&gt;
Gamma&#23545;&#20914;&#21644;&#31895;&#36335;&#24452;&#29702;&#35770;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Gamma Hedging and Rough Paths. (arXiv:2309.05054v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.05054
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20351;&#29992;&#31895;&#36335;&#24452;&#29702;&#35770;&#26469;&#22788;&#29702;&#31163;&#25955;&#26102;&#38388;&#30340;Gamma&#23545;&#20914;&#31574;&#30053;&#65292;&#34920;&#26126;&#21482;&#35201;&#26631;&#30340;&#36164;&#20135;&#20215;&#26684;&#36335;&#24452;&#36275;&#22815;&#35268;&#21017;&#65292;&#35813;&#31574;&#30053;&#21487;&#20197;&#22797;&#21046;&#20854;&#20182;&#27431;&#24335;&#26399;&#26435;&#65292;&#26080;&#38656;&#28385;&#36275;&#23450;&#20215;&#27169;&#22411;&#30340;&#20108;&#27425;&#21464;&#21270;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#36816;&#29992;&#31895;&#36335;&#24452;&#29702;&#35770;&#30740;&#31350;&#31163;&#25955;&#26102;&#38388;&#30340;Gamma&#23545;&#20914;&#31574;&#30053;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#26524;&#20132;&#26131;&#21592;&#30693;&#36947;&#19968;&#32452;&#27431;&#24335;&#26399;&#26435;&#30340;&#24066;&#22330;&#20215;&#26684;&#23558;&#36981;&#24490;&#25193;&#25955;&#23450;&#20215;&#27169;&#22411;&#65292;&#37027;&#20040;&#31163;&#25955;&#26102;&#38388;&#30340;Gamma&#23545;&#20914;&#31574;&#30053;&#23558;&#20351;&#20854;&#33021;&#22815;&#22797;&#21046;&#20854;&#20182;&#27431;&#24335;&#26399;&#26435;&#65292;&#21482;&#35201;&#26631;&#30340;&#36164;&#20135;&#20215;&#26684;&#36335;&#24452;&#36275;&#22815;&#35268;&#21017;&#12290;&#36825;&#26159;&#19968;&#20010;&#30830;&#20991;&#30340;&#32467;&#26524;&#65292;&#24182;&#19988;&#19981;&#38656;&#35201;&#26631;&#30340;&#36164;&#20135;&#20215;&#26684;&#36335;&#24452;&#26377;&#19982;&#23450;&#20215;&#27169;&#22411;&#30456;&#23545;&#24212;&#30340;&#20108;&#27425;&#21464;&#21270;&#37327;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#23558;&#36825;&#20010;&#32467;&#26524;&#25512;&#24191;&#21040;&#24322;otic&#34893;&#29983;&#21697;&#65292;&#24403;Gamma&#34987;&#23450;&#20041;&#20026;&#36890;&#36807;&#23548;&#25968;&#24471;&#21040;&#30340;Gubinelli&#23548;&#25968;&#26102;&#65292;&#36890;&#36807;&#25512;&#23548;&#30830;&#20445;&#30340;&#31895;&#36335;&#24452;&#29256;&#26412;&#30340;Clark-Ocone&#20844;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
We apply rough path theory to study the discrete-time gamma-hedging strategy. We show that if a trader knows that the market price of a set of European options will be given by a diffusive pricing model, then the discrete-time gamma-hedging strategy will enable them to replicate other European options so long as the underlying price path is sufficiently regular. This is a sure result and does not require that the underlying price path has a quadratic variation corresponding to the pricing model. We show how to generalise this result to exotic derivatives when the gamma is defined to be the Gubinelli derivative of the delta by deriving rough-path versions of the Clark--Ocone formula which hold surely.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#24102;&#38750;&#39532;&#23572;&#31185;&#22827;&#36716;&#25442;&#30340;&#20004;&#20154;&#38646;&#21644;&#32447;&#24615;&#20108;&#27425;&#38543;&#26426;&#24494;&#20998;&#21338;&#24328;&#38382;&#39064;&#65292;&#36890;&#36807;&#24341;&#20837;&#26032;&#30340;&#22810;&#32500;&#24230;&#19981;&#23450;&#38543;&#26426;Riccati&#26041;&#31243;&#21644;&#22810;&#32500;&#32447;&#24615;&#21453;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65292;&#25552;&#20986;&#20102;&#20004;&#21517;&#29609;&#23478;&#30340;&#26368;&#20248;&#21453;&#39304;&#25511;&#21046;&#31574;&#30053;&#23545;&#65292;&#24182;&#35777;&#26126;&#20102;&#26032;&#22411;&#22810;&#32500;&#24230;&#19981;&#23450;SRE&#30340;&#23384;&#22312;&#24615;&#21644;&#21807;&#19968;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.05003</link><description>&lt;p&gt;
&#22810;&#32500;&#19981;&#23450;&#38543;&#26426;Riccati&#26041;&#31243;&#21644;&#24102;&#38750;&#39532;&#23572;&#31185;&#22827;&#36716;&#25442;&#30340;&#38646;&#21644;&#32447;&#24615;&#20108;&#27425;&#38543;&#26426;&#24494;&#20998;&#21338;&#24328;
&lt;/p&gt;
&lt;p&gt;
Multidimensional indefinite stochastic Riccati equations and zero-sum linear-quadratic stochastic differential games with non-markovian regime switching. (arXiv:2309.05003v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.05003
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24102;&#38750;&#39532;&#23572;&#31185;&#22827;&#36716;&#25442;&#30340;&#20004;&#20154;&#38646;&#21644;&#32447;&#24615;&#20108;&#27425;&#38543;&#26426;&#24494;&#20998;&#21338;&#24328;&#38382;&#39064;&#65292;&#36890;&#36807;&#24341;&#20837;&#26032;&#30340;&#22810;&#32500;&#24230;&#19981;&#23450;&#38543;&#26426;Riccati&#26041;&#31243;&#21644;&#22810;&#32500;&#32447;&#24615;&#21453;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65292;&#25552;&#20986;&#20102;&#20004;&#21517;&#29609;&#23478;&#30340;&#26368;&#20248;&#21453;&#39304;&#25511;&#21046;&#31574;&#30053;&#23545;&#65292;&#24182;&#35777;&#26126;&#20102;&#26032;&#22411;&#22810;&#32500;&#24230;&#19981;&#23450;SRE&#30340;&#23384;&#22312;&#24615;&#21644;&#21807;&#19968;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#24102;&#26377;&#36716;&#25442;&#27169;&#22411;&#30340;&#20004;&#20154;&#38646;&#21644;&#32447;&#24615;&#20108;&#27425;&#38543;&#26426;&#24494;&#20998;&#21338;&#24328;&#12290;&#25152;&#25511;&#21046;&#30340;&#38750;&#40784;&#27425;&#31995;&#32479;&#31995;&#25968;&#20381;&#36182;&#20110;&#24213;&#23618;&#22122;&#22768;&#65292;&#22240;&#27492;&#23646;&#20110;&#38750;&#39532;&#23572;&#31185;&#22827;&#36716;&#25442;&#27169;&#22411;&#12290;&#22522;&#20110;&#19968;&#31181;&#26032;&#22411;&#30340;&#22810;&#32500;&#24230;&#19981;&#23450;&#38543;&#26426;Riccati&#26041;&#31243;&#65288;SRE&#65289;&#21644;&#20855;&#26377;&#26080;&#30028;&#31995;&#25968;&#30340;&#22810;&#32500;&#32447;&#24615;&#21453;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65288;BSDE&#65289;&#65292;&#25105;&#20204;&#21487;&#20197;&#20197;&#38381;&#29615;&#24418;&#24335;&#20026;&#20004;&#21517;&#29609;&#23478;&#25552;&#20379;&#26368;&#20248;&#21453;&#39304;&#25511;&#21046;&#31574;&#30053;&#23545;&#12290;&#26412;&#25991;&#30340;&#20027;&#35201;&#36129;&#29486;&#65292;&#22312;BSDE&#29702;&#35770;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#26159;&#35777;&#26126;&#20102;&#26032;&#22411;&#22810;&#32500;&#24230;&#19981;&#23450;SRE&#30340;&#23384;&#22312;&#24615;&#21644;&#21807;&#19968;&#24615;&#12290;&#26377;&#36259;&#30340;&#26159;&#65292;&#35299;&#30340;&#21508;&#20010;&#20998;&#37327;&#21516;&#26102;&#21487;&#20197;&#21462;&#27491;&#12289;&#38646;&#21644;&#36127;&#20540;&#12290;&#25105;&#20204;&#36824;&#22312;&#23553;&#38381;&#20984;&#38181;&#25511;&#21046;&#32422;&#26463;&#19979;&#33719;&#24471;&#20102;&#23545;&#24212;&#30340;&#40784;&#27425;&#31995;&#32479;&#30340;&#26368;&#20248;&#21453;&#39304;&#25511;&#21046;&#31574;&#30053;&#23545;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper is concerned with two-player zero-sum linear-quadratic stochastic differential games in a regime switching model. The controlled inhomogeneous system coefficients depend on the underlying noises, so it is a non-Markovian regime switching model. Based on a new kind of multidimensional indefinite stochastic Riccati equation (SRE) and a multidimensional linear backward stochastic differential equation (BSDE) with unbounded coefficients, we can provide optimal feedback control-strategy pairs for the two players in a closed-loop form. The main contribution of this paper, which is important in its own right from the BSDE theory point of view, is to prove the existence and uniqueness of the new kind of multidimensional indefinite SRE. Interestingly, the components of the solution can take positive, zero and negative values simultaneously. We also obtain the corresponding optimal feedback control-strategy pairs for homogeneous systems under closed convex cone control constraints. Fi
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21521;&#37327;&#38789;&#26368;&#20248;&#20256;&#36755;&#38382;&#39064;&#21644;&#40065;&#26834;&#26399;&#26435;&#23450;&#20215;&#38382;&#39064;&#65292;&#21457;&#29616;&#31354;&#38388;&#32500;&#24230;&#21644;&#25104;&#26412;&#20989;&#25968;&#36229;&#27169;&#24615;&#23545;&#38382;&#39064;&#35299;&#30340;&#20960;&#20309;&#23398;&#26377;&#22797;&#26434;&#30340;&#24433;&#21709;&#65292;&#24182;&#35777;&#26126;&#20102;&#36890;&#36807;&#21333;&#35843;&#24615;&#24341;&#36215;&#30340;&#38477;&#32500;&#21487;&#20197;&#25913;&#36827;&#35745;&#31639;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2309.04947</link><description>&lt;p&gt;
&#21521;&#37327;&#38789;&#26368;&#20248;&#20256;&#36755;&#21644;&#40065;&#26834;&#26399;&#26435;&#23450;&#20215;&#30340;&#20960;&#20309;&#23398;
&lt;/p&gt;
&lt;p&gt;
Geometry of vectorial martingale optimal transport and robust option pricing. (arXiv:2309.04947v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04947
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21521;&#37327;&#38789;&#26368;&#20248;&#20256;&#36755;&#38382;&#39064;&#21644;&#40065;&#26834;&#26399;&#26435;&#23450;&#20215;&#38382;&#39064;&#65292;&#21457;&#29616;&#31354;&#38388;&#32500;&#24230;&#21644;&#25104;&#26412;&#20989;&#25968;&#36229;&#27169;&#24615;&#23545;&#38382;&#39064;&#35299;&#30340;&#20960;&#20309;&#23398;&#26377;&#22797;&#26434;&#30340;&#24433;&#21709;&#65292;&#24182;&#35777;&#26126;&#20102;&#36890;&#36807;&#21333;&#35843;&#24615;&#24341;&#36215;&#30340;&#38477;&#32500;&#21487;&#20197;&#25913;&#36827;&#35745;&#31639;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#40065;&#26834;&#37329;&#34701;&#38382;&#39064;&#65292;&#21363;&#32771;&#34385;&#24066;&#22330;&#30340;&#19981;&#30830;&#23450;&#24615;&#30340;&#27169;&#22411;&#21644;&#26041;&#27861;&#30340;&#21457;&#23637;&#12290;&#20855;&#20307;&#22320;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#21521;&#37327;&#38789;&#26368;&#20248;&#20256;&#36755;&#65288;VMOT&#65289;&#38382;&#39064;&#30340;&#20960;&#20309;&#23398;&#21450;&#20854;&#22312;&#37329;&#34701;&#20013;&#40065;&#26834;&#26399;&#26435;&#23450;&#20215;&#38382;&#39064;&#20013;&#30340;&#24212;&#29992;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#20004;&#26399;&#24066;&#22330;&#27169;&#22411;&#65292;&#24182;&#35777;&#26126;&#24403;&#31354;&#38388;&#32500;&#24230;$d$&#65288;&#22522;&#30784;&#36164;&#20135;&#30340;&#25968;&#37327;&#65289;&#20026;2&#26102;&#65292;&#24125;&#24335;&#26399;&#26435;&#30340;&#26497;&#20540;&#27169;&#22411;&#21487;&#20197;&#21270;&#31616;&#20026;&#31532;&#19968;&#26399;&#30340;&#21333;&#22240;&#23376;&#27169;&#22411;&#65292;&#20294;&#26159;&#24403;$d&gt;2$&#26102;&#24182;&#19981;&#19968;&#23450;&#25104;&#31435;&#12290;&#36825;&#20010;&#32467;&#26524;&#23637;&#31034;&#20102;&#31354;&#38388;&#32500;&#24230;&#12289;&#25104;&#26412;&#20989;&#25968;&#36229;&#27169;&#24615;&#20197;&#21450;&#23427;&#20204;&#23545;VMOT&#38382;&#39064;&#35299;&#30340;&#20960;&#20309;&#23398;&#30340;&#24433;&#21709;&#20043;&#38388;&#30340;&#22797;&#26434;&#20851;&#31995;&#12290;&#25105;&#20204;&#36824;&#30740;&#31350;&#20102;&#27169;&#22411;&#22312;&#37329;&#34701;&#38382;&#39064;&#20013;&#30340;&#24212;&#29992;&#65292;&#24182;&#28436;&#31034;&#20102;&#36890;&#36807;&#21333;&#35843;&#24615;&#24341;&#36215;&#30340;&#38477;&#32500;&#22914;&#20309;&#29992;&#20110;&#25913;&#36827;&#29616;&#26377;&#30340;&#35745;&#31639;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper addresses robust finance, which is concerned with the development of models and approaches that account for market uncertainties. Specifically, we investigate the Vectorial Martingale Optimal Transport (VMOT) problem, the geometry of its solutions, and its application with robust option pricing problems in finance. To this end, we consider two-period market models and show that when the spatial dimension $d$ (the number of underlying assets) is 2, the extremal model for the cap option with a sub- or super-modular payout reduces to a single factor model in the first period, but not in general when $d &gt; 2$. The result demonstrates a subtle relationship between spatial dimension, cost function supermodularity, and their effect on the geometry of solutions to the VMOT problem. We investigate applications of the model to financial problems and demonstrate how the dimensional reduction caused by monotonicity can be used to improve existing computational methods.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#31616;&#21333;&#35299;&#37322;&#20132;&#26131;&#32773;&#23545;&#26032;&#38395;&#30340;&#24577;&#24230;&#65292;&#35299;&#37322;&#20102;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#20004;&#20010;&#35268;&#24459;&#65306;&#23614;&#37325;&#20998;&#24067;&#21644;&#27874;&#21160;&#32858;&#31867;&#12290;</title><link>http://arxiv.org/abs/2309.04876</link><description>&lt;p&gt;
&#26032;&#38395;&#39537;&#21160;&#30340;&#26399;&#26395;&#19982;&#27874;&#21160;&#32858;&#31867;
&lt;/p&gt;
&lt;p&gt;
News-driven Expectations and Volatility Clustering. (arXiv:2309.04876v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04876
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#31616;&#21333;&#35299;&#37322;&#20132;&#26131;&#32773;&#23545;&#26032;&#38395;&#30340;&#24577;&#24230;&#65292;&#35299;&#37322;&#20102;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#20004;&#20010;&#35268;&#24459;&#65306;&#23614;&#37325;&#20998;&#24067;&#21644;&#27874;&#21160;&#32858;&#31867;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37329;&#34701;&#27874;&#21160;&#36981;&#24490;&#20004;&#20010;&#24341;&#20154;&#27880;&#30446;&#30340;&#32463;&#39564;&#35268;&#24459;&#65292;&#36866;&#29992;&#20110;&#21508;&#31181;&#36164;&#20135;&#12289;&#21508;&#20010;&#24066;&#22330;&#21644;&#21508;&#20010;&#26102;&#38388;&#23610;&#24230;&#65306;&#23427;&#26159;&#23614;&#37325;&#30340;&#65288;&#26356;&#20934;&#30830;&#22320;&#35828;&#26159;&#31526;&#21512;&#24130;&#24459;&#20998;&#24067;&#65289;&#65292;&#24182;&#19988;&#22312;&#26102;&#38388;&#19978;&#20542;&#21521;&#20110;&#32858;&#31867;&#12290;&#35768;&#22810;&#26377;&#36259;&#30340;&#27169;&#22411;&#24050;&#34987;&#25552;&#20986;&#26469;&#35299;&#37322;&#36825;&#20123;&#35268;&#24459;&#65292;&#29305;&#21035;&#26159;&#22522;&#20110;&#20195;&#29702;&#20154;&#30340;&#27169;&#22411;&#65292;&#36890;&#36807;&#19968;&#31181;&#22797;&#26434;&#30340;&#38750;&#32447;&#24615;&#26426;&#21046;&#26469;&#27169;&#25311;&#36825;&#20004;&#20010;&#32463;&#39564;&#23450;&#24459;&#65292;&#20363;&#22914;&#20132;&#26131;&#32773;&#22312;&#39640;&#24230;&#38750;&#32447;&#24615;&#30340;&#26041;&#24335;&#19979;&#22312;&#20132;&#26131;&#31574;&#30053;&#20043;&#38388;&#30340;&#20999;&#25442;&#12290;&#26412;&#25991;&#31616;&#21333;&#22320;&#35299;&#37322;&#20102;&#36825;&#20004;&#20010;&#35268;&#24459;&#65292;&#21482;&#28041;&#21450;&#20132;&#26131;&#32773;&#23545;&#26032;&#38395;&#30340;&#24577;&#24230;&#65292;&#36825;&#31181;&#35299;&#37322;&#20960;&#20046;&#26159;&#26681;&#25454;&#37329;&#34701;&#24066;&#22330;&#21442;&#19982;&#32773;&#30340;&#20256;&#32479;&#20108;&#20998;&#27861;&#26469;&#23450;&#20041;&#30340;&#65292;&#25237;&#36164;&#32773;&#19982;&#25237;&#26426;&#32773;&#65292;&#20182;&#20204;&#30340;&#34892;&#20026;&#34987;&#31616;&#21270;&#20026;&#26368;&#31616;&#21333;&#30340;&#24418;&#24335;&#12290;&#20551;&#35774;&#38271;&#26399;&#25237;&#36164;&#32773;&#23545;&#36164;&#20135;&#30340;&#20272;&#20540;&#36981;&#24490;&#22522;&#20110;&#26032;&#38395;&#30340;&#38543;&#26426;&#28459;&#27493;&#65292;&#22240;&#27492;&#25429;&#25417;&#21040;&#20102;&#25237;&#36164;&#32773;&#23545;&#22522;&#26412;&#26032;&#38395;&#30340;&#25345;&#20037;&#12289;&#38271;&#26399;&#30340;&#35760;&#24518;&#12290;
&lt;/p&gt;
&lt;p&gt;
Financial volatility obeys two fascinating empirical regularities that apply to various assets, on various markets, and on various time scales: it is fat-tailed (more precisely power-law distributed) and it tends to be clustered in time. Many interesting models have been proposed to account for these regularities, notably agent-based models, which mimic the two empirical laws through a complex mix of nonlinear mechanisms such as traders' switching between trading strategies in highly nonlinear way. This paper explains the two regularities simply in terms of traders' attitudes towards news, an explanation that follows almost by definition of the traditional dichotomy of financial market participants, investors versus speculators, whose behaviors are reduced to their simplest forms. Long-run investors' valuations of an asset are assumed to follow a news-driven random walk, thus capturing the investors' persistent, long memory of fundamental news. Short-term speculators' anticipated retur
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36951;&#25022;&#26368;&#20248;&#31639;&#27861;&#30340;&#36845;&#20195;&#26041;&#26696;&#65292;&#29992;&#20110;&#32852;&#37030;&#36801;&#31227;&#23398;&#20064;&#65292;&#22312;&#26680;&#22238;&#24402;&#27169;&#22411;&#20013;&#20855;&#20307;&#21270;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#20960;&#20046;&#36951;&#25022;&#26368;&#20248;&#30340;&#21551;&#21457;&#24335;&#31639;&#27861;&#65292;&#21487;&#20197;&#20943;&#23567;&#29983;&#25104;&#21442;&#25968;&#19982;&#19987;&#38376;&#21442;&#25968;&#20043;&#38388;&#30340;&#32047;&#31215;&#20559;&#24046;&#12290;</title><link>http://arxiv.org/abs/2309.04557</link><description>&lt;p&gt;
&#29992;&#20110;&#26680;&#22238;&#24402;&#30340;&#36951;&#25022;&#26368;&#20248;&#32852;&#37030;&#36801;&#31227;&#23398;&#20064;&#21450;&#20854;&#22312;&#32654;&#24335;&#26399;&#26435;&#23450;&#20215;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Regret-Optimal Federated Transfer Learning for Kernel Regression with Applications in American Option Pricing. (arXiv:2309.04557v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04557
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36951;&#25022;&#26368;&#20248;&#31639;&#27861;&#30340;&#36845;&#20195;&#26041;&#26696;&#65292;&#29992;&#20110;&#32852;&#37030;&#36801;&#31227;&#23398;&#20064;&#65292;&#22312;&#26680;&#22238;&#24402;&#27169;&#22411;&#20013;&#20855;&#20307;&#21270;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#20960;&#20046;&#36951;&#25022;&#26368;&#20248;&#30340;&#21551;&#21457;&#24335;&#31639;&#27861;&#65292;&#21487;&#20197;&#20943;&#23567;&#29983;&#25104;&#21442;&#25968;&#19982;&#19987;&#38376;&#21442;&#25968;&#20043;&#38388;&#30340;&#32047;&#31215;&#20559;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26368;&#20248;&#30340;&#36845;&#20195;&#26041;&#26696;&#65292;&#29992;&#20110;&#32852;&#37030;&#36801;&#31227;&#23398;&#20064;&#65292;&#20854;&#20013;&#20013;&#24515;&#35745;&#21010;&#32773;&#21487;&#20197;&#35775;&#38382;&#21516;&#19968;&#23398;&#20064;&#27169;&#22411; $f_{\theta}$ &#30340;&#25968;&#25454;&#38598; ${\cal D}_1,\dots,{\cal D}_N$&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#22312;&#23562;&#37325;&#27169;&#22411; $f_{\theta(T)}$ &#30340;&#25439;&#22833;&#20989;&#25968;&#30340;&#24773;&#20917;&#19979;&#65292;&#23613;&#37327;&#20943;&#23567;&#29983;&#25104;&#21442;&#25968; $\{\theta_i(t)\}_{t=0}^T$ &#22312;&#25152;&#26377; $T$ &#27425;&#36845;&#20195;&#20013;&#19982;&#27599;&#20010;&#25968;&#25454;&#38598;&#24471;&#21040;&#30340;&#19987;&#38376;&#21442;&#25968;$\theta^\star_{1},\ldots,\theta^\star_N$ &#30340;&#32047;&#31215;&#20559;&#24046;&#12290;&#25105;&#20204;&#20165;&#20801;&#35768;&#27599;&#20010;&#19987;&#38376;&#27169;&#22411;&#65288;&#33410;&#28857;/&#20195;&#29702;&#65289;&#21644;&#20013;&#24515;&#35745;&#21010;&#32773;&#65288;&#26381;&#21153;&#22120;&#65289;&#22312;&#27599;&#27425;&#36845;&#20195;&#65288;&#36718;&#65289;&#20043;&#38388;&#36827;&#34892;&#25345;&#32493;&#36890;&#20449;&#12290;&#23545;&#20110;&#27169;&#22411; $f_{\theta}$ &#26159;&#26377;&#38480;&#31209;&#26680;&#22238;&#24402;&#30340;&#24773;&#20917;&#65292;&#25105;&#20204;&#24471;&#20986;&#20102;&#36951;&#25022;&#26368;&#20248;&#31639;&#27861;&#30340;&#26174;&#24335;&#26356;&#26032;&#20844;&#24335;&#12290;&#36890;&#36807;&#21033;&#29992;&#36951;&#25022;&#26368;&#20248;&#31639;&#27861;&#20013;&#30340;&#23545;&#31216;&#24615;&#65292;&#25105;&#20204;&#36827;&#19968;&#27493;&#24320;&#21457;&#20102;&#19968;&#31181;&#20960;&#20046;&#36951;&#25022;&#26368;&#20248;&#30340;&#21551;&#21457;&#24335;&#31639;&#27861;&#65292;&#20854;&#36816;&#34892;&#38656;&#35201;&#36739;&#23569;&#30340; $\mathcal{O}(Np^2)$ &#20010;&#22522;&#26412;&#36816;&#31639;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose an optimal iterative scheme for federated transfer learning, where a central planner has access to datasets ${\cal D}_1,\dots,{\cal D}_N$ for the same learning model $f_{\theta}$. Our objective is to minimize the cumulative deviation of the generated parameters $\{\theta_i(t)\}_{t=0}^T$ across all $T$ iterations from the specialized parameters $\theta^\star_{1},\ldots,\theta^\star_N$ obtained for each dataset, while respecting the loss function for the model $f_{\theta(T)}$ produced by the algorithm upon halting. We only allow for continual communication between each of the specialized models (nodes/agents) and the central planner (server), at each iteration (round). For the case where the model $f_{\theta}$ is a finite-rank kernel regression, we derive explicit updates for the regret-optimal algorithm. By leveraging symmetries within the regret-optimal algorithm, we further develop a nearly regret-optimal heuristic that runs with $\mathcal{O}(Np^2)$ fewer elementary operati
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#21457;&#29616;&#20102;&#37329;&#34701;&#24037;&#31243;&#12289;&#27969;&#20307;&#21147;&#23398;&#21644;&#20998;&#23376;&#29289;&#29702;&#23398;&#20043;&#38388;&#30340;&#20851;&#32852;&#65292;&#24182;&#24314;&#31435;&#20102;&#19968;&#20010;&#25968;&#23398;&#26694;&#26550;&#26469;&#25551;&#36848;&#36825;&#20123;&#20851;&#32852;&#12290;&#36825;&#20123;&#20851;&#32852;&#21253;&#25324;&#20102;Kevin&#27874;&#12289;Klein-Kramers&#21644;Kolmogorov&#26041;&#31243;&#20197;&#21450;&#20223;&#23556;&#24494;&#20998;&#26041;&#31243;&#31561;&#20869;&#23481;&#12290;</title><link>http://arxiv.org/abs/2309.04547</link><description>&lt;p&gt;
Kelvin&#27874;&#12289;Klein-Kramers&#21644;Kolmogorov&#26041;&#31243;&#65292;&#36335;&#24452;&#20381;&#36182;&#37329;&#34701;&#24037;&#20855;&#65306;&#35843;&#26597;&#21644;&#26032;&#32467;&#26524;&#30340;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
Kelvin Waves, Klein-Kramers and Kolmogorov Equations, Path-Dependent Financial Instruments: Survey and New Results. (arXiv:2309.04547v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04547
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#21457;&#29616;&#20102;&#37329;&#34701;&#24037;&#31243;&#12289;&#27969;&#20307;&#21147;&#23398;&#21644;&#20998;&#23376;&#29289;&#29702;&#23398;&#20043;&#38388;&#30340;&#20851;&#32852;&#65292;&#24182;&#24314;&#31435;&#20102;&#19968;&#20010;&#25968;&#23398;&#26694;&#26550;&#26469;&#25551;&#36848;&#36825;&#20123;&#20851;&#32852;&#12290;&#36825;&#20123;&#20851;&#32852;&#21253;&#25324;&#20102;Kevin&#27874;&#12289;Klein-Kramers&#21644;Kolmogorov&#26041;&#31243;&#20197;&#21450;&#20223;&#23556;&#24494;&#20998;&#26041;&#31243;&#31561;&#20869;&#23481;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#21457;&#29616;&#37329;&#34701;&#24037;&#31243;&#20013;&#30475;&#20284;&#26080;&#20851;&#30340;&#22522;&#30784;&#38382;&#39064;&#21644;&#27969;&#20307;&#21147;&#23398;&#20197;&#21450;&#20998;&#23376;&#29289;&#29702;&#23398;&#20013;&#30340;&#22522;&#26412;&#38382;&#39064;&#20043;&#38388;&#23384;&#22312;&#30528;&#19968;&#20123;&#20196;&#20154;&#24778;&#35766;&#30340;&#20851;&#31995;&#12290;&#22312;&#25152;&#26377;&#36825;&#20123;&#39046;&#22495;&#20013;&#65292;&#35299;&#20915;&#26041;&#26696;&#37117;&#21487;&#20197;&#24402;&#32467;&#20026;&#35299;&#20915;&#20851;&#20110;&#27169;&#25311;&#21160;&#24577;&#31995;&#32479;&#24120;&#29992;&#30340;&#20223;&#23556;&#24494;&#20998;&#26041;&#31243;&#12290;&#25105;&#20204;&#21457;&#29616;&#20102;&#36825;&#20123;&#30475;&#36215;&#26469;&#19981;&#30456;&#20851;&#30340;&#39046;&#22495;&#20043;&#38388;&#30340;&#32852;&#31995;&#65292;&#23558;&#22312;&#27969;&#20307;&#21147;&#23398;&#20013;&#25551;&#36848;&#30340;Kevin&#27874;&#20013;&#30340;&#32447;&#24615;&#27969;&#30340;&#23567;&#27874;&#29366;&#25200;&#21160;&#19982;&#22312;&#20998;&#23376;&#29289;&#29702;&#23398;&#20013;&#25551;&#36848;&#30340;&#33258;&#30001;&#31890;&#23376;&#21644;&#35856;&#32422;&#26463;&#31890;&#23376;&#30340;&#36816;&#21160;&#20197;&#21450;&#37329;&#34701;&#24037;&#31243;&#20013;&#20135;&#29983;&#30340;&#39640;&#26031;&#21644;&#38750;&#39640;&#26031;&#20223;&#23556;&#36807;&#31243;&#65288;&#22914;Ornstein-Uhlenbeck&#21644;Feller&#36807;&#31243;&#65289;&#32852;&#31995;&#36215;&#26469;&#12290;&#20026;&#20102;&#36827;&#19968;&#27493;&#24378;&#35843;&#36825;&#20123;&#39046;&#22495;&#20043;&#38388;&#30340;&#31867;&#20284;&#20043;&#22788;&#65292;&#25105;&#20204;&#20351;&#29992;Kevin&#27874;&#26500;&#24314;&#20102;&#19968;&#20010;&#19968;&#33268;&#30340;&#25968;&#23398;&#26694;&#26550;&#26469;&#26500;&#24314;&#36716;&#31227;&#27010;&#29575;&#23494;&#24230;&#20989;&#25968;
&lt;/p&gt;
&lt;p&gt;
We discover several surprising relationships between large classes of seemingly unrelated foundational problems of financial engineering and fundamental problems of hydrodynamics and molecular physics. Solutions in all these domains can be reduced to solving affine differential equations commonly used in various mathematical and scientific disciplines to model dynamic systems. We have identified connections in these seemingly disparate areas as we link together small wave-like perturbations of linear flows in ideal and viscous fluids described in hydrodynamics by Kevin waves to motions of free and harmonically bound particles described in molecular physics by Klein-Kramers and Kolmogorov equations to Gaussian and non-Gaussian affine processes, e.g., Ornstein-Uhlenbeck and Feller, arising in financial engineering. To further emphasize the parallels between these diverse fields, we build a coherent mathematical framework using Kevin waves to construct transition probability density funct
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#20351;&#29992;&#36335;&#24452;&#31614;&#21517;&#26469;&#29983;&#25104;&#36924;&#36817;&#23454;&#38469;&#25968;&#25454;&#30340;&#37329;&#34701;&#20215;&#26684;&#36335;&#24452;&#65292;&#24182;&#24212;&#29992;&#20110;&#23450;&#20215;&#22238;&#25764;&#20445;&#38505;&#26399;&#26435;&#21644;&#25237;&#36164;&#32452;&#21512;&#22238;&#25764;&#25511;&#21046;&#31574;&#30053;&#12290;</title><link>http://arxiv.org/abs/2309.04507</link><description>&lt;p&gt;
&#20351;&#29992;&#36335;&#24452;&#31614;&#21517;&#29983;&#25104;&#36924;&#36817;&#23454;&#38469;&#25968;&#25454;&#30340;&#37329;&#34701;&#20215;&#26684;&#36335;&#24452;
&lt;/p&gt;
&lt;p&gt;
Generating drawdown-realistic financial price paths using path signatures. (arXiv:2309.04507v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04507
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#20351;&#29992;&#36335;&#24452;&#31614;&#21517;&#26469;&#29983;&#25104;&#36924;&#36817;&#23454;&#38469;&#25968;&#25454;&#30340;&#37329;&#34701;&#20215;&#26684;&#36335;&#24452;&#65292;&#24182;&#24212;&#29992;&#20110;&#23450;&#20215;&#22238;&#25764;&#20445;&#38505;&#26399;&#26435;&#21644;&#25237;&#36164;&#32452;&#21512;&#22238;&#25764;&#25511;&#21046;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#29983;&#25104;&#24335;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#27169;&#25311;&#20855;&#26377;&#25509;&#36817;&#23454;&#38469;&#25968;&#25454;&#30340;&#22238;&#25764;&#30340;&#37329;&#34701;&#20215;&#26684;&#24207;&#21015;&#12290;&#24212;&#29992;&#22330;&#26223;&#22914;&#23450;&#20215;&#22238;&#25764;&#20445;&#38505;&#26399;&#26435;&#25110;&#24320;&#21457;&#25237;&#36164;&#32452;&#21512;&#22238;&#25764;&#25511;&#21046;&#31574;&#30053;&#38656;&#35201;&#20351;&#29992;&#25509;&#36817;&#30495;&#23454;&#30340;&#22238;&#25764;&#36335;&#24452;&#12290;&#21382;&#21490;&#24773;&#26223;&#21487;&#33021;&#19981;&#36275;&#20197;&#26377;&#25928;&#35757;&#32451;&#21644;&#22238;&#27979;&#31574;&#30053;&#65292;&#32780;&#26631;&#20934;&#30340;&#21442;&#25968;&#21270;&#33945;&#29305;&#21345;&#32599;&#26041;&#27861;&#26080;&#27861;&#20805;&#20998;&#20445;&#30041;&#22238;&#25764;&#12290;&#25105;&#20204;&#25552;&#20513;&#19968;&#31181;&#38750;&#21442;&#25968;&#21270;&#33945;&#29305;&#21345;&#32599;&#26041;&#27861;&#65292;&#23558;&#21464;&#20998;&#33258;&#32534;&#30721;&#29983;&#25104;&#27169;&#22411;&#19982;&#22238;&#25764;&#37325;&#24314;&#25439;&#22833;&#20989;&#25968;&#30456;&#32467;&#21512;&#12290;&#20026;&#20102;&#20811;&#26381;&#25968;&#20540;&#22797;&#26434;&#24615;&#21644;&#38750;&#21487;&#24494;&#24615;&#38382;&#39064;&#65292;&#25105;&#20204;&#23558;&#22238;&#25764;&#36817;&#20284;&#20026;&#36335;&#24452;&#30340;&#30697;&#20989;&#25968;&#65292;&#21363;&#36335;&#24452;&#31614;&#21517;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22238;&#25764;&#20989;&#25968;&#30340;&#25152;&#38656;&#27491;&#21017;&#24615;&#21644;&#36817;&#20284;&#30340;&#19968;&#33268;&#24615;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#20351;&#29992;&#32447;&#24615;&#22238;&#24402;&#33719;&#24471;&#20102;&#25509;&#36817;&#30340;&#25968;&#20540;&#36817;&#20284;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
A novel generative machine learning approach for the simulation of sequences of financial price data with drawdowns quantifiably close to empirical data is introduced. Applications such as pricing drawdown insurance options or developing portfolio drawdown control strategies call for a host of drawdown-realistic paths. Historical scenarios may be insufficient to effectively train and backtest the strategy, while standard parametric Monte Carlo does not adequately preserve drawdowns. We advocate a non-parametric Monte Carlo approach combining a variational autoencoder generative model with a drawdown reconstruction loss function. To overcome issues of numerical complexity and non-differentiability, we approximate drawdown as a linear function of the moments of the path, known in the literature as path signatures. We prove the required regularity of drawdown function and consistency of the approximation. Furthermore, we obtain close numerical approximations using linear regression for fr
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#38543;&#26426;&#27604;&#20363;&#30340;&#20445;&#38505;&#21512;&#21516;&#25968;&#37327;&#26469;&#24314;&#27169;&#20445;&#38505;&#19994;&#20013;&#30340;&#32034;&#36180;&#39057;&#29575;&#21644;&#32034;&#36180;&#37329;&#39069;&#20998;&#24067;&#65292;&#24182;&#21487;&#20197;&#36827;&#34892;&#20998;&#24067;&#36866;&#37197;&#24615;&#26816;&#39564;&#12290;</title><link>http://arxiv.org/abs/2309.04483</link><description>&lt;p&gt;
&#20445;&#38505;&#19994;&#20013;&#39057;&#29575;&#24314;&#27169;&#30340;&#26032;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Ein neuer Ansatz zur Frequenzmodellierung im Versicherungswesen (A new Approach to frequency modeling in risk theory). (arXiv:2309.04483v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04483
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#38543;&#26426;&#27604;&#20363;&#30340;&#20445;&#38505;&#21512;&#21516;&#25968;&#37327;&#26469;&#24314;&#27169;&#20445;&#38505;&#19994;&#20013;&#30340;&#32034;&#36180;&#39057;&#29575;&#21644;&#32034;&#36180;&#37329;&#39069;&#20998;&#24067;&#65292;&#24182;&#21487;&#20197;&#36827;&#34892;&#20998;&#24067;&#36866;&#37197;&#24615;&#26816;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38598;&#20307;&#39118;&#38505;&#27169;&#22411;&#36890;&#24120;&#21306;&#20998;&#32034;&#36180;&#39057;&#29575;&#65288;&#21450;&#20854;&#20998;&#24067;&#65289;&#21644;&#32034;&#36180;&#37329;&#39069;&#65288;&#21450;&#20854;&#20998;&#24067;&#65289;&#12290;&#23545;&#20110;&#32034;&#36180;&#39057;&#29575;&#65292;&#36890;&#24120;&#32771;&#34385;&#20256;&#32479;&#30340;&#31163;&#25955;&#20998;&#24067;&#65292;&#22914;&#20108;&#39033;&#24335;&#20998;&#24067;&#12289;&#36127;&#20108;&#39033;&#24335;&#20998;&#24067;&#25110;&#27850;&#26494;&#20998;&#24067;&#12290;&#30001;&#20110;&#36825;&#20123;&#20998;&#24067;&#26377;&#26102;&#19981;&#22826;&#36866;&#29992;&#20110;&#25968;&#25454;&#65292;&#25105;&#20204;&#22312;&#36825;&#37324;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#38543;&#26426;&#27604;&#20363;&#30340;&#20445;&#38505;&#21512;&#21516;&#25968;&#37327;&#26469;&#24314;&#27169;&#32034;&#36180;&#39057;&#29575;&#30340;&#19981;&#21516;&#26041;&#27861;&#12290;&#36825;&#31181;&#26041;&#27861;&#36824;&#21487;&#20197;&#36890;&#36807;&#20998;&#20301;&#25968;&#22270;&#36827;&#34892;&#32479;&#35745;&#36866;&#37197;&#24615;&#26816;&#39564;&#65292;&#24182;&#21487;&#20197;&#21516;&#26679;&#24212;&#29992;&#20110;&#32034;&#36180;&#37329;&#39069;&#20998;&#24067;&#30340;&#24314;&#27169;&#12290;
&lt;/p&gt;
&lt;p&gt;
The collective risk model differentiates usually between claims frequencies (and their distribution) and claim sizes (and their distribution). For the claims frequencies typically classical discrete distributions are considered, such as Binomial-, Negative binomial- or Poisson distributions. Since these distributions sometimes do not really fit to the data we propose a different approach here for claim frequencies via random proportions of the number of insurance contracts. This approach also allows for a statistical goodness-of-fit test via quantile-quantile-plots and can likewise be applied to the modelling of claim size distributions.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#38454;&#26102;&#38388;&#33258;&#36866;&#24212;&#26041;&#26696;&#65292;&#29992;&#20110;&#23450;&#20215;CEV&#27169;&#22411;&#30340;&#32806;&#21512;&#31995;&#32479;&#65292;&#24182;&#36890;&#36807;&#23616;&#37096;&#32593;&#26684;&#21152;&#23494;&#26469;&#25552;&#39640;&#26041;&#27861;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2309.03984</link><description>&lt;p&gt;
&#20351;&#29992;&#39640;&#38454;&#32039;&#33268;&#26041;&#26696;&#21644;&#33258;&#36866;&#24212;&#26102;&#38388;&#27493;&#38271;&#25552;&#39640;&#35299;&#20915;&#32654;&#22269;CEV&#27169;&#22411;&#30340;&#20934;&#30830;&#24615;
&lt;/p&gt;
&lt;p&gt;
Enhancing accuracy for solving American CEV model with high-order compact scheme and adaptive time stepping. (arXiv:2309.03984v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.03984
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#38454;&#26102;&#38388;&#33258;&#36866;&#24212;&#26041;&#26696;&#65292;&#29992;&#20110;&#23450;&#20215;CEV&#27169;&#22411;&#30340;&#32806;&#21512;&#31995;&#32479;&#65292;&#24182;&#36890;&#36807;&#23616;&#37096;&#32593;&#26684;&#21152;&#23494;&#26469;&#25552;&#39640;&#26041;&#27861;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#30740;&#31350;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#38454;&#26102;&#38388;&#33258;&#36866;&#24212;&#26041;&#26696;&#65292;&#29992;&#20110;&#23450;&#20215;&#22266;&#23450;-&#33258;&#30001;&#36793;&#30028;&#24658;&#23450;&#24377;&#24615;&#21464;&#24046;(CEV)&#27169;&#22411;&#30340;&#32806;&#21512;&#31995;&#32479;&#65292;&#21253;&#25324;&#31561;&#36317;&#21644;&#23616;&#37096;&#32454;&#21270;&#30340;&#31354;&#38388;&#32593;&#26684;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22823;&#24133;&#25552;&#39640;&#20102;&#27169;&#22411;&#20013;&#22266;&#26377;&#30340;&#21644;&#35825;&#23548;&#30340;&#38750;&#35268;&#21017;&#24615;&#12290;&#27492;&#22806;&#65292;&#32806;&#21512;&#30340;&#20559;&#24494;&#20998;&#26041;&#31243;&#32452;&#26159;&#24378;&#38750;&#32447;&#24615;&#30340;&#65292;&#28041;&#21450;&#20960;&#20010;&#26102;&#21464;&#31995;&#25968;&#65292;&#21253;&#25324;&#25552;&#21069;&#34892;&#26435;&#36793;&#30028;&#30340;&#19968;&#38454;&#23548;&#25968;&#12290;&#36825;&#20123;&#31995;&#25968;&#26159;&#20174;&#19968;&#20010;&#22235;&#38454;&#35299;&#26512;&#36924;&#36817;&#20013;&#24471;&#21040;&#30340;&#65292;&#35813;&#36924;&#36817;&#20351;&#29992;&#20102;&#19968;&#20010;&#27491;&#21017;&#21270;&#30340;&#24179;&#26041;&#26681;&#20989;&#25968;&#12290;&#26399;&#26435;&#20215;&#20540;&#21644;delta&#25935;&#24863;&#24615;&#30340;&#21322;&#31163;&#25955;&#26041;&#31243;&#26469;&#33258;&#20110;&#38750;&#22343;&#21248;&#22235;&#38454;&#32039;&#33268;&#26377;&#38480;&#24046;&#20998;&#26041;&#26696;&#12290;&#20351;&#29992;&#20116;&#38454;5(4) Dormand-Prince&#26102;&#38388;&#31215;&#20998;&#26041;&#27861;&#26469;&#35299;&#20915;&#31163;&#25955;&#26041;&#31243;&#30340;&#32806;&#21512;&#31995;&#32479;&#12290;&#36890;&#36807;&#23616;&#37096;&#32593;&#26684;&#21152;&#23494;&#26469;&#25552;&#39640;&#25105;&#20204;&#25552;&#20986;&#30340;&#26041;&#27861;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this research work, we propose a high-order time adapted scheme for pricing a coupled system of fixed-free boundary constant elasticity of variance (CEV) model on both equidistant and locally refined space-grid. The performance of our method is substantially enhanced to improve irregularities in the model which are both inherent and induced. Furthermore, the system of coupled PDEs is strongly nonlinear and involves several time-dependent coefficients that include the first-order derivative of the early exercise boundary. These coefficients are approximated from a fourth-order analytical approximation which is derived using a regularized square-root function. The semi-discrete equation for the option value and delta sensitivity is obtained from a non-uniform fourth-order compact finite difference scheme. Fifth-order 5(4) Dormand-Prince time integration method is used to solve the coupled system of discrete equations. Enhancing the performance of our proposed method with local mesh re
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#32771;&#34385;&#20102;&#19977;&#20010;&#25110;&#26356;&#22810;&#20505;&#36873;&#20154;&#21442;&#21152;&#36873;&#20030;&#30340;&#24773;&#20917;&#19979;&#65292;&#33719;&#32988;&#30340;&#27010;&#29575;&#22914;&#20309;&#38543;&#26102;&#38388;&#21464;&#21270;&#65292;&#21457;&#29616;&#23545;&#20110;&#25511;&#21046;&#20449;&#24687;&#30340;&#26368;&#20339;&#31574;&#30053;&#21487;&#33021;&#26159;&#38169;&#32508;&#22797;&#26434;&#30340;&#12290;</title><link>http://arxiv.org/abs/2305.00693</link><description>&lt;p&gt;
&#19977;&#20010;&#20505;&#36873;&#20154;&#36873;&#20030;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Three candidate election strategy. (arXiv:2305.00693v1 [math.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.00693
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#34385;&#20102;&#19977;&#20010;&#25110;&#26356;&#22810;&#20505;&#36873;&#20154;&#21442;&#21152;&#36873;&#20030;&#30340;&#24773;&#20917;&#19979;&#65292;&#33719;&#32988;&#30340;&#27010;&#29575;&#22914;&#20309;&#38543;&#26102;&#38388;&#21464;&#21270;&#65292;&#21457;&#29616;&#23545;&#20110;&#25511;&#21046;&#20449;&#24687;&#30340;&#26368;&#20339;&#31574;&#30053;&#21487;&#33021;&#26159;&#38169;&#32508;&#22797;&#26434;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#34385;&#20102;&#19977;&#20010;&#25110;&#26356;&#22810;&#20505;&#36873;&#20154;&#21442;&#21152;&#36873;&#20030;&#30340;&#24773;&#20917;&#19979;&#65292;&#20505;&#36873;&#20154;&#33719;&#32988;&#30340;&#27010;&#29575;&#22914;&#20309;&#38543;&#26102;&#38388;&#21464;&#21270;&#12290;&#35813;&#27010;&#29575;&#30340;&#21464;&#21270;&#19982;&#24403;&#21069;&#27599;&#20010;&#20505;&#36873;&#20154;&#30340;&#25903;&#25345;&#29575;&#12289;&#20505;&#36873;&#20154;&#22312;&#25919;&#27835;&#20809;&#35889;&#20013;&#30340;&#30456;&#23545;&#20301;&#32622;&#12289;&#36317;&#31163;&#36873;&#20030;&#26085;&#21097;&#20313;&#30340;&#26102;&#38388;&#20197;&#21450;&#30452;&#21040;&#36873;&#20030;&#26085;&#20844;&#20247;&#33719;&#24471;&#26377;&#22122;&#22768;&#30340;&#20449;&#24687;&#30340;&#36895;&#29575;&#26377;&#20851;&#12290;&#29305;&#21035;&#26159;&#65292;&#26412;&#30740;&#31350;&#21457;&#29616;&#23545;&#20110;&#25511;&#21046;&#20449;&#24687;&#30340;&#26368;&#20339;&#31574;&#30053;&#21487;&#33021;&#26159;&#38169;&#32508;&#22797;&#26434;&#30340;&#65292;&#24182;&#38750;&#20004;&#20010;&#20505;&#36873;&#20154;&#22330;&#26223;&#19979;&#30340;&#31616;&#21333;&#30452;&#35273;&#12290;&#26377;&#36259;&#30340;&#26159;&#65292;&#22312;&#23384;&#22312;&#20004;&#20010;&#26497;&#31471;&#30340;&#36873;&#27665;&#30340;&#36873;&#20030;&#31454;&#20105;&#20013;&#65292;&#22914;&#26524;&#20505;&#36873;&#20154;&#22788;&#20110;&#20013;&#38388;&#20301;&#32622;&#65292;&#26576;&#20123;&#31574;&#30053;&#23558;&#20351;&#24471;&#35813;&#20505;&#36873;&#20154;&#30340;&#33719;&#32988;&#27010;&#29575;&#23436;&#20840;&#28040;&#22833;&#12290;
&lt;/p&gt;
&lt;p&gt;
The probability of a given candidate winning a future election is worked out in closed form as a function of (i) the current support rates for each candidate, (ii) the relative positioning of the candidates within the political spectrum, (iii) the time left to the election, and (iv) the rate at which noisy information is revealed to the electorate from now to the election day, when there are three or more candidates. It is shown, in particular, that the optimal strategy for controlling information can be intricate and nontrivial, in contrast to a two-candidate race. A surprising finding is that for a candidate taking the centre ground in an electoral competition among a polarised electorate, certain strategies are fatal in that the resulting winning probability for that candidate vanishes identically.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#31350;&#20102;&#20351;&#29992;ChatGPT&#21450;&#20854;&#20182;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#39044;&#27979;&#32929;&#24066;&#22238;&#25253;&#30340;&#28508;&#21147;&#65292;&#21457;&#29616;ChatGPT&#30340;&#39044;&#27979;&#34920;&#29616;&#20248;&#20110;&#20256;&#32479;&#24773;&#24863;&#20998;&#26512;&#26041;&#27861;&#65292;&#32780;&#22522;&#30784;&#27169;&#22411;&#26080;&#27861;&#20934;&#30830;&#39044;&#27979;&#32929;&#31080;&#20215;&#26684;&#21464;&#21270;&#65292;&#34920;&#26126;&#22797;&#26434;&#27169;&#22411;&#21487;&#39044;&#27979;&#33021;&#21147;&#30340;&#23835;&#36215;&#12290;&#36825;&#34920;&#26126;&#22312;&#25237;&#36164;&#20915;&#31574;&#36807;&#31243;&#20013;&#24341;&#20837;&#20808;&#36827;&#30340;&#35821;&#35328;&#27169;&#22411;&#21487;&#20197;&#25552;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#24182;&#22686;&#24378;&#23450;&#37327;&#20132;&#26131;&#31574;&#30053;&#30340;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2304.07619</link><description>&lt;p&gt;
ChatGPT&#26159;&#21542;&#33021;&#22815;&#39044;&#27979;&#32929;&#31080;&#20215;&#26684;&#27874;&#21160;&#65311;&#22238;&#25253;&#21487;&#39044;&#27979;&#24615;&#19982;&#22823;&#35821;&#35328;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
Can ChatGPT Forecast Stock Price Movements? Return Predictability and Large Language Models. (arXiv:2304.07619v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.07619
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#31350;&#20102;&#20351;&#29992;ChatGPT&#21450;&#20854;&#20182;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#39044;&#27979;&#32929;&#24066;&#22238;&#25253;&#30340;&#28508;&#21147;&#65292;&#21457;&#29616;ChatGPT&#30340;&#39044;&#27979;&#34920;&#29616;&#20248;&#20110;&#20256;&#32479;&#24773;&#24863;&#20998;&#26512;&#26041;&#27861;&#65292;&#32780;&#22522;&#30784;&#27169;&#22411;&#26080;&#27861;&#20934;&#30830;&#39044;&#27979;&#32929;&#31080;&#20215;&#26684;&#21464;&#21270;&#65292;&#34920;&#26126;&#22797;&#26434;&#27169;&#22411;&#21487;&#39044;&#27979;&#33021;&#21147;&#30340;&#23835;&#36215;&#12290;&#36825;&#34920;&#26126;&#22312;&#25237;&#36164;&#20915;&#31574;&#36807;&#31243;&#20013;&#24341;&#20837;&#20808;&#36827;&#30340;&#35821;&#35328;&#27169;&#22411;&#21487;&#20197;&#25552;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#24182;&#22686;&#24378;&#23450;&#37327;&#20132;&#26131;&#31574;&#30053;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;&#24773;&#24863;&#20998;&#26512;&#39044;&#27979;&#32929;&#24066;&#22238;&#25253;&#30340;&#28508;&#21147;&#65292;&#25506;&#35752;&#20102;&#20351;&#29992;ChatGPT&#20197;&#21450;&#20854;&#20182;&#22823;&#35821;&#35328;&#27169;&#22411;&#22312;&#39044;&#27979;&#32929;&#24066;&#22238;&#25253;&#26041;&#38754;&#30340;&#34920;&#29616;&#12290;&#25105;&#20204;&#20351;&#29992;ChatGPT&#21028;&#26029;&#26032;&#38395;&#26631;&#39064;&#23545;&#20844;&#21496;&#32929;&#31080;&#20215;&#26684;&#26159;&#22909;&#28040;&#24687;&#12289;&#22351;&#28040;&#24687;&#25110;&#26080;&#20851;&#28040;&#24687;&#12290;&#36890;&#36807;&#35745;&#31639;&#25968;&#23383;&#20998;&#25968;&#65292;&#25105;&#20204;&#21457;&#29616;&#36825;&#20123;"ChatGPT&#20998;&#25968;"&#21644;&#38543;&#21518;&#30340;&#26085;&#24120;&#32929;&#31080;&#24066;&#22330;&#22238;&#25253;&#20043;&#38388;&#23384;&#22312;&#27491;&#30456;&#20851;&#24615;&#12290;&#32780;&#19988;&#65292;ChatGPT&#30340;&#34920;&#29616;&#20248;&#20110;&#20256;&#32479;&#30340;&#24773;&#24863;&#20998;&#26512;&#26041;&#27861;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#21457;&#29616;GPT-1&#12289;GPT-2&#21644;BERT&#31561;&#22522;&#30784;&#27169;&#22411;&#26080;&#27861;&#20934;&#30830;&#39044;&#27979;&#22238;&#25253;&#65292;&#36825;&#34920;&#26126;&#22238;&#25253;&#21487;&#39044;&#27979;&#24615;&#26159;&#22797;&#26434;&#27169;&#22411;&#30340;&#19968;&#31181;&#26032;&#20852;&#33021;&#21147;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#23558;&#20808;&#36827;&#30340;&#35821;&#35328;&#27169;&#22411;&#32435;&#20837;&#25237;&#36164;&#20915;&#31574;&#36807;&#31243;&#21487;&#20197;&#20135;&#29983;&#26356;&#20934;&#30830;&#30340;&#39044;&#27979;&#65292;&#24182;&#25552;&#39640;&#23450;&#37327;&#20132;&#26131;&#31574;&#30053;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
We examine the potential of ChatGPT, and other large language models, in predicting stock market returns using sentiment analysis of news headlines. We use ChatGPT to indicate whether a given headline is good, bad, or irrelevant news for firms' stock prices. We then compute a numerical score and document a positive correlation between these ``ChatGPT scores'' and subsequent daily stock market returns. Further, ChatGPT outperforms traditional sentiment analysis methods. We find that more basic models such as GPT-1, GPT-2, and BERT cannot accurately forecast returns, indicating return predictability is an emerging capacity of complex models. Our results suggest that incorporating advanced language models into the investment decision-making process can yield more accurate predictions and enhance the performance of quantitative trading strategies.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#37319;&#29992; Numerai &#25968;&#25454;&#31185;&#23398;&#31454;&#36187;&#30340;&#25968;&#25454;&#65292;&#25506;&#31350;&#20102;&#22810;&#21464;&#37327;&#26102;&#38388;&#24207;&#21015;&#24314;&#27169;&#20013;&#19981;&#21516;&#29305;&#24449;&#24037;&#31243;&#21644;&#38477;&#32500;&#26041;&#27861;&#30340;&#24212;&#29992;&#65307;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#38598;&#25104;&#26041;&#27861;&#65292;&#29992;&#20110;&#39640;&#32500;&#26102;&#38388;&#24207;&#21015;&#24314;&#27169;&#65292;&#35813;&#26041;&#27861;&#22312;&#36890;&#29992;&#24615;&#12289;&#40065;&#26834;&#24615;&#21644;&#25928;&#29575;&#19978;&#20248;&#20110;&#19968;&#20123;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2303.07925</link><description>&lt;p&gt;
&#36890;&#36807; Numerai &#25968;&#25454;&#31185;&#23398;&#31454;&#36187;&#26696;&#20363;&#65292;&#29702;&#35299;&#26102;&#38388;&#34920;&#26684;&#21644;&#22810;&#21464;&#37327;&#26102;&#38388;&#24207;&#21015;&#30340;&#27169;&#22411;&#22797;&#26434;&#24230;
&lt;/p&gt;
&lt;p&gt;
Understanding Model Complexity for temporal tabular and multi-variate time series, case study with Numerai data science tournament. (arXiv:2303.07925v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.07925
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37319;&#29992; Numerai &#25968;&#25454;&#31185;&#23398;&#31454;&#36187;&#30340;&#25968;&#25454;&#65292;&#25506;&#31350;&#20102;&#22810;&#21464;&#37327;&#26102;&#38388;&#24207;&#21015;&#24314;&#27169;&#20013;&#19981;&#21516;&#29305;&#24449;&#24037;&#31243;&#21644;&#38477;&#32500;&#26041;&#27861;&#30340;&#24212;&#29992;&#65307;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#38598;&#25104;&#26041;&#27861;&#65292;&#29992;&#20110;&#39640;&#32500;&#26102;&#38388;&#24207;&#21015;&#24314;&#27169;&#65292;&#35813;&#26041;&#27861;&#22312;&#36890;&#29992;&#24615;&#12289;&#40065;&#26834;&#24615;&#21644;&#25928;&#29575;&#19978;&#20248;&#20110;&#19968;&#20123;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#31350;&#20102;&#22312;&#22810;&#21464;&#37327;&#26102;&#38388;&#24207;&#21015;&#24314;&#27169;&#20013;&#20351;&#29992;&#19981;&#21516;&#29305;&#24449;&#24037;&#31243;&#21644;&#38477;&#32500;&#26041;&#27861;&#30340;&#24212;&#29992;&#12290;&#21033;&#29992;&#20174; Numerai &#25968;&#25454;&#31454;&#36187;&#21019;&#24314;&#30340;&#29305;&#24449;&#30446;&#26631;&#20132;&#21449;&#30456;&#20851;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#38598;&#65292;&#25105;&#20204;&#35777;&#26126;&#22312;&#36807;&#24230;&#21442;&#25968;&#21270;&#30340;&#24773;&#20917;&#19979;&#65292;&#19981;&#21516;&#29305;&#24449;&#24037;&#31243;&#26041;&#27861;&#30340;&#24615;&#33021;&#19982;&#39044;&#27979;&#20250;&#25910;&#25947;&#21040;&#21487;&#30001;&#20877;&#29983;&#26680;&#24076;&#23572;&#20271;&#29305;&#31354;&#38388;&#21051;&#30011;&#30340;&#30456;&#21516;&#24179;&#34913;&#24577;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#38598;&#25104;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#32467;&#21512;&#20102;&#19981;&#21516;&#30340;&#38543;&#26426;&#38750;&#32447;&#24615;&#21464;&#25442;&#65292;&#38543;&#21518;&#37319;&#29992;&#23725;&#22238;&#24402;&#27169;&#22411;&#36827;&#34892;&#39640;&#32500;&#26102;&#38388;&#24207;&#21015;&#24314;&#27169;&#12290;&#19982;&#19968;&#20123;&#24120;&#29992;&#30340;&#29992;&#20110;&#24207;&#21015;&#24314;&#27169;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65288;&#22914; LSTM &#21644; transformer&#65289;&#30456;&#27604;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#26356;&#21152;&#40065;&#26834;&#65288;&#22312;&#19981;&#21516;&#30340;&#38543;&#26426;&#31181;&#23376;&#19979;&#20855;&#26377;&#36739;&#20302;&#30340;&#27169;&#22411;&#26041;&#24046;&#65292;&#19988;&#23545;&#26550;&#26500;&#30340;&#36873;&#25321;&#19981;&#22826;&#25935;&#24863;&#65289;&#65292;&#24182;&#19988;&#26356;&#26377;&#25928;&#29575;&#12290;&#25105;&#20204;&#26041;&#27861;&#30340;&#21478;&#19968;&#20010;&#20248;&#21183;&#22312;&#20110;&#27169;&#22411;&#30340;&#31616;&#21333;&#24615;&#65292;&#22240;&#20026;&#27809;&#26377;&#24517;&#35201;&#20351;&#29992;&#22797;&#26434;&#30340;&#28145;&#24230;&#23398;&#20064;&#26694;&#26550;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we explore the use of different feature engineering and dimensionality reduction methods in multi-variate time-series modelling. Using a feature-target cross correlation time series dataset created from Numerai tournament, we demonstrate under over-parameterised regime, both the performance and predictions from different feature engineering methods converge to the same equilibrium, which can be characterised by the reproducing kernel Hilbert space. We suggest a new Ensemble method, which combines different random non-linear transforms followed by ridge regression for modelling high dimensional time-series. Compared to some commonly used deep learning models for sequence modelling, such as LSTM and transformers, our method is more robust (lower model variance over different random seeds and less sensitive to the choice of architecture) and more efficient. An additional advantage of our method is model simplicity as there is no need to use sophisticated deep learning frame
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;</title><link>http://arxiv.org/abs/2302.13426</link><description>&lt;p&gt;
&#26399;&#26435;&#30340;&#20215;&#26684;&#21457;&#29616;
&lt;/p&gt;
&lt;p&gt;
Price Discovery for Derivatives. (arXiv:2302.13426v5 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13426
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#19968;&#20010;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#31169;&#26377;&#20449;&#24687;&#21644;&#39640;&#38454;&#20449;&#24687;&#23545;&#26399;&#26435;&#24066;&#22330;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#27169;&#22411;&#20801;&#35768;&#26377;&#31169;&#26377;&#20449;&#24687;&#30340;&#20132;&#26131;&#32773;&#22312;&#29366;&#24577;-&#32034;&#36180;&#38598;&#24066;&#22330;&#19978;&#20132;&#26131;&#12290;&#31561;&#20215;&#30340;&#26399;&#26435;&#24418;&#24335;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#25317;&#26377;&#20851;&#20110;&#22522;&#30784;&#36164;&#20135;&#25910;&#30410;&#30340;&#20998;&#24067;&#30340;&#31169;&#26377;&#20449;&#24687;&#65292;&#24182;&#20801;&#35768;&#20132;&#26131;&#20219;&#24847;&#26399;&#26435;&#32452;&#21512;&#30340;&#25805;&#32437;&#32773;&#12290;&#25105;&#20204;&#24471;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#65292;&#36825;&#20123;&#35299;&#25552;&#20379;&#20102;&#20851;&#20110;&#20869;&#24149;&#20132;&#26131;&#30340;&#39640;&#38454;&#20449;&#24687;&#65292;&#22914;&#20219;&#20309;&#32473;&#23450;&#30340;&#26102;&#21051;&#20132;&#26131;&#26399;&#26435;&#31574;&#30053;&#65292;&#24182;&#23558;&#36825;&#20123;&#31574;&#30053;&#27867;&#21270;&#21040;&#20102;&#27874;&#21160;&#29575;&#20132;&#26131;&#31561;&#23454;&#36341;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;
We obtain a basic theory of price discovery across derivative markets with respect to higher-order information, using a model where an agent with general private information regarding state probabilities is allowed to trade arbitrary portfolios of state-contingent claims. In an equivalent options formulation, the informed agent has private information regarding arbitrary aspects of the payoff distribution of an underlying asset and is allowed to trade arbitrary option portfolios. We characterize, in closed form, the informed demand, price impact, and information efficiency of prices. Our results offer a theory of insider trading on higher moments of the underlying payoff as a special case. The informed demand formula prescribes option strategies for trading on any given moment and extends those used in practice for, e.g. volatility trading.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#39046;&#22495;&#33258;&#36866;&#24212;&#23398;&#20064;&#21644;&#27169;&#20223;&#30340;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#30005;&#21147;&#22871;&#21033;&#20132;&#26131;&#12290;&#36890;&#36807;&#21033;&#29992;&#22870;&#21169;&#24037;&#31243;&#21644;&#35746;&#21333;&#20998;&#27573;&#30340;&#26041;&#24335;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#25552;&#39640;&#35757;&#32451;&#30340;&#25910;&#25947;&#24615;&#65292;&#22686;&#21152;&#31454;&#26631;&#25104;&#21151;&#29575;&#65292;&#24182;&#26174;&#33879;&#25552;&#39640;&#21033;&#28070;&#21644;&#25439;&#22833;&#12290;</title><link>http://arxiv.org/abs/2301.08360</link><description>&lt;p&gt;
&#39046;&#22495;&#33258;&#36866;&#24212;&#23398;&#20064;&#21644;&#27169;&#20223;&#65306;&#29992;&#20110;&#30005;&#21147;&#22871;&#21033;&#30340;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Domain-adapted Learning and Imitation: DRL for Power Arbitrage. (arXiv:2301.08360v2 [q-fin.TR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.08360
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#39046;&#22495;&#33258;&#36866;&#24212;&#23398;&#20064;&#21644;&#27169;&#20223;&#30340;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#30005;&#21147;&#22871;&#21033;&#20132;&#26131;&#12290;&#36890;&#36807;&#21033;&#29992;&#22870;&#21169;&#24037;&#31243;&#21644;&#35746;&#21333;&#20998;&#27573;&#30340;&#26041;&#24335;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#25552;&#39640;&#35757;&#32451;&#30340;&#25910;&#25947;&#24615;&#65292;&#22686;&#21152;&#31454;&#26631;&#25104;&#21151;&#29575;&#65292;&#24182;&#26174;&#33879;&#25552;&#39640;&#21033;&#28070;&#21644;&#25439;&#22833;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#33655;&#20848;&#30005;&#21147;&#24066;&#22330;&#65292;&#30001;&#26085;&#21069;&#24066;&#22330;&#21644;&#21363;&#26102;&#24179;&#34913;&#24066;&#22330;&#32452;&#25104;&#65292;&#24182;&#19988;&#36816;&#20316;&#26041;&#24335;&#31867;&#20284;&#25293;&#21334;&#12290;&#30001;&#20110;&#20379;&#38656;&#27874;&#21160;&#65292;&#36890;&#24120;&#23384;&#22312;&#19981;&#24179;&#34913;&#23548;&#33268;&#20004;&#20010;&#24066;&#22330;&#20215;&#26684;&#19981;&#21516;&#65292;&#20174;&#32780;&#25552;&#20379;&#22871;&#21033;&#26426;&#20250;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#23545;&#38382;&#39064;&#36827;&#34892;&#20102;&#37325;&#26500;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#21327;&#20316;&#24335;&#21452;&#20195;&#29702;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#27431;&#27954;&#30005;&#21147;&#22871;&#21033;&#20132;&#26131;&#30340;&#21452;&#23618;&#20223;&#30495;&#19982;&#20248;&#21270;&#12290;&#25105;&#20204;&#36824;&#24341;&#20837;&#20102;&#20004;&#31181;&#26032;&#30340;&#23454;&#29616;&#26041;&#24335;&#65292;&#36890;&#36807;&#27169;&#20223;&#30005;&#21147;&#20132;&#26131;&#21592;&#30340;&#20132;&#26131;&#34892;&#20026;&#26469;&#34701;&#20837;&#39046;&#22495;&#29305;&#23450;&#30693;&#35782;&#12290;&#36890;&#36807;&#21033;&#29992;&#22870;&#21169;&#24037;&#31243;&#26469;&#27169;&#20223;&#39046;&#22495;&#19987;&#19994;&#30693;&#35782;&#65292;&#25105;&#20204;&#33021;&#22815;&#37325;&#26032;&#35774;&#35745;&#24378;&#21270;&#23398;&#20064;&#20195;&#29702;&#30340;&#22870;&#21169;&#31995;&#32479;&#65292;&#25913;&#21892;&#35757;&#32451;&#20013;&#30340;&#25910;&#25947;&#24615;&#24182;&#25552;&#39640;&#25972;&#20307;&#24615;&#33021;&#12290;&#27492;&#22806;&#65292;&#35746;&#21333;&#20998;&#27573;&#22686;&#21152;&#20102;&#31454;&#26631;&#25104;&#21151;&#29575;&#65292;&#26174;&#33879;&#25552;&#39640;&#20102;&#21033;&#28070;&#21644;&#25439;&#22833;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#28436;&#31034;&#20102;&#36890;&#36807;&#39046;&#22495;&#33258;&#36866;&#24212;&#23398;&#20064;&#21644;&#27169;&#20223;&#30340;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#22312;&#30005;&#21147;&#22871;&#21033;&#20013;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we discuss the Dutch power market, which is comprised of a day-ahead market and an intraday balancing market that operates like an auction. Due to fluctuations in power supply and demand, there is often an imbalance that leads to different prices in the two markets, providing an opportunity for arbitrage. To address this issue, we restructure the problem and propose a collaborative dual-agent reinforcement learning approach for this bi-level simulation and optimization of European power arbitrage trading. We also introduce two new implementations designed to incorporate domain-specific knowledge by imitating the trading behaviours of power traders. By utilizing reward engineering to imitate domain expertise, we are able to reform the reward system for the RL agent, which improves convergence during training and enhances overall performance. Additionally, the tranching of orders increases bidding success rates and significantly boosts profit and loss (P&amp;L). Our study demo
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#23454;&#38469;&#30340;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#22312;&#22825;&#28982;&#27668;&#26399;&#36135;&#21512;&#32422;&#20132;&#26131;&#20013;&#30340;&#24212;&#29992;&#65292;&#25552;&#39640;&#20102;&#20132;&#26131;&#24615;&#33021;&#24182;&#38477;&#20302;&#20102;&#20132;&#26131;&#25104;&#26412;&#12290;&#21516;&#26102;&#65292;&#36890;&#36807;&#25552;&#20986;&#30340;&#38598;&#25104;&#23398;&#20064;&#26041;&#26696;&#65292;&#25552;&#39640;&#20102;&#27169;&#22411;&#31283;&#23450;&#24615;&#21644;&#40065;&#26834;&#24615;&#12290;</title><link>http://arxiv.org/abs/2301.08359</link><description>&lt;p&gt;
&#39046;&#22495;&#33258;&#36866;&#24212;&#23398;&#20064;&#19982;&#21487;&#35299;&#37322;&#24615;&#65306;&#22825;&#28982;&#27668;&#20132;&#26131;&#30340;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Domain-adapted Learning and Interpretability: DRL for Gas Trading. (arXiv:2301.08359v2 [q-fin.TR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.08359
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#23454;&#38469;&#30340;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#22312;&#22825;&#28982;&#27668;&#26399;&#36135;&#21512;&#32422;&#20132;&#26131;&#20013;&#30340;&#24212;&#29992;&#65292;&#25552;&#39640;&#20102;&#20132;&#26131;&#24615;&#33021;&#24182;&#38477;&#20302;&#20102;&#20132;&#26131;&#25104;&#26412;&#12290;&#21516;&#26102;&#65292;&#36890;&#36807;&#25552;&#20986;&#30340;&#38598;&#25104;&#23398;&#20064;&#26041;&#26696;&#65292;&#25552;&#39640;&#20102;&#27169;&#22411;&#31283;&#23450;&#24615;&#21644;&#40065;&#26834;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#65288;Deep RL&#65289;&#24050;&#32463;&#22312;&#37329;&#34701;&#21644;&#32929;&#31080;&#20132;&#26131;&#31561;&#24456;&#22810;&#24212;&#29992;&#20013;&#24471;&#21040;&#20102;&#25506;&#32034;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#23454;&#38469;&#30340;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#22312;&#22825;&#28982;&#27668;&#26399;&#36135;&#21512;&#32422;&#20132;&#26131;&#20013;&#30340;&#24212;&#29992;&#12290;&#25152;&#24471;&#21040;&#30340;&#22799;&#26222;&#27604;&#29575;&#36229;&#36807;&#20102;&#36235;&#21183;&#36319;&#36394;&#21644;&#22343;&#20540;&#22238;&#24402;&#31574;&#30053;&#25552;&#20379;&#30340;&#22522;&#20934;&#21450;&#25991;&#29486;&#20013;&#30340;&#32467;&#26524;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#31616;&#21333;&#32780;&#26377;&#25928;&#30340;&#38598;&#25104;&#23398;&#20064;&#26041;&#26696;&#65292;&#36890;&#36807;&#25552;&#39640;&#27169;&#22411;&#30340;&#31283;&#23450;&#24615;&#21644;&#40065;&#26834;&#24615;&#20197;&#21450;&#38477;&#20302;&#25442;&#25163;&#29575;&#21644;&#20132;&#26131;&#25104;&#26412;&#26469;&#26174;&#33879;&#25552;&#39640;&#24615;&#33021;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102; resulting Deep RL &#31574;&#30053;&#30340;&#27169;&#22411;&#21487;&#35299;&#37322;&#24615;&#12289;&#20132;&#26131;&#39057;&#29575;&#21644;&#39118;&#38505;&#24230;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
Deep Reinforcement Learning (Deep RL) has been explored for a number of applications in finance and stock trading. In this paper, we present a practical implementation of Deep RL for trading natural gas futures contracts. The Sharpe Ratio obtained exceeds benchmarks given by trend following and mean reversion strategies as well as results reported in literature. Moreover, we propose a simple but effective ensemble learning scheme for trading, which significantly improves performance through enhanced model stability and robustness as well as lower turnover and hence lower transaction cost. We discuss the resulting Deep RL strategy in terms of model explainability, trading frequency and risk measures.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#20174;&#23395;&#24230;&#30005;&#35805;&#20250;&#35758;&#25991;&#26412;&#20013;&#25552;&#21462;&#20449;&#29992;&#30456;&#20851;&#20449;&#24687;&#30340;&#26032;&#25216;&#26415;&#65292;&#35813;&#20449;&#24687;&#33021;&#22815;&#39044;&#27979;&#26410;&#26469;&#20449;&#29992;&#21033;&#24046;&#21464;&#21270;&#65292;&#24182;&#34920;&#26126;&#25237;&#36164;&#32773;&#27809;&#26377;&#20805;&#20998;&#21033;&#29992;&#30005;&#35805;&#20250;&#35758;&#20013;&#30340;&#20449;&#29992;&#30456;&#20851;&#20449;&#24687;&#12290;</title><link>http://arxiv.org/abs/2209.11914</link><description>&lt;p&gt;
&#30005;&#35805;&#20250;&#35758;&#20013;&#30340;&#20449;&#29992;&#20449;&#24687;
&lt;/p&gt;
&lt;p&gt;
Credit Information in Earnings Calls. (arXiv:2209.11914v2 [q-fin.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.11914
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#20174;&#23395;&#24230;&#30005;&#35805;&#20250;&#35758;&#25991;&#26412;&#20013;&#25552;&#21462;&#20449;&#29992;&#30456;&#20851;&#20449;&#24687;&#30340;&#26032;&#25216;&#26415;&#65292;&#35813;&#20449;&#24687;&#33021;&#22815;&#39044;&#27979;&#26410;&#26469;&#20449;&#29992;&#21033;&#24046;&#21464;&#21270;&#65292;&#24182;&#34920;&#26126;&#25237;&#36164;&#32773;&#27809;&#26377;&#20805;&#20998;&#21033;&#29992;&#30005;&#35805;&#20250;&#35758;&#20013;&#30340;&#20449;&#29992;&#30456;&#20851;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#20174;&#23395;&#24230;&#30005;&#35805;&#20250;&#35758;&#30340;&#25991;&#26412;&#20013;&#25552;&#21462;&#19982;&#20449;&#29992;&#30456;&#20851;&#20449;&#24687;&#30340;&#26032;&#25216;&#26415;&#12290;&#36825;&#20123;&#20449;&#24687;&#19981;&#21463;&#22522;&#26412;&#21464;&#37327;&#25110;&#24066;&#22330;&#21464;&#37327;&#30340;&#24433;&#21709;&#65292;&#24182;&#19988;&#21487;&#20197;&#39044;&#27979;&#26410;&#26469;&#30340;&#20449;&#29992;&#21033;&#24046;&#21464;&#21270;&#12290;&#25105;&#20204;&#30340;&#22522;&#20110;&#25991;&#26412;&#30340;&#25351;&#26631;&#33021;&#22815;&#39044;&#27979;&#26410;&#26469;&#30340;&#20449;&#29992;&#21033;&#24046;&#39118;&#38505;&#21644;&#20844;&#21496;&#30408;&#21033;&#33021;&#21147;&#65292;&#20174;&#32780;&#22686;&#21152;&#20102;&#25105;&#20204;&#25351;&#26631;&#23545;&#21033;&#24046;&#21464;&#21270;&#30340;&#39044;&#27979;&#33021;&#21147;&#30340;&#22797;&#26434;&#24615;&#12290;&#25105;&#20204;&#30340;&#26679;&#26412;&#22806;&#25237;&#36164;&#32452;&#21512;&#27979;&#35797;&#26174;&#31034;&#65292;&#25105;&#20204;&#30340;&#25351;&#26631;&#20013;&#30340;&#20449;&#24687;&#23545;&#25237;&#36164;&#32773;&#26377;&#20215;&#20540;&#12290;&#36825;&#20004;&#20010;&#32467;&#26524;&#34920;&#26126;&#65292;&#25237;&#36164;&#32773;&#24182;&#26410;&#20805;&#20998;&#20869;&#21270;&#21253;&#21547;&#22312;&#30005;&#35805;&#20250;&#35758;&#20013;&#30340;&#19982;&#20449;&#29992;&#30456;&#20851;&#30340;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a novel technique to extract credit-relevant information from the text of quarterly earnings calls. This information is not spanned by fundamental or market variables and forecasts future credit spread changes. One reason for such forecastability is that our text-based measure predicts future credit spread risk and firm profitability. More firm- and call-level complexity increase the forecasting power of our measure for spread changes. Out-of-sample portfolio tests show the information in our measure is valuable for investors. Both results suggest that investors do not fully internalize the credit-relevant information contained in earnings calls.
&lt;/p&gt;</description></item><item><title>&#25991;&#31456;&#20351;&#29992;&#32929;&#19996;&#22823;&#20250;&#26102;&#38388;&#24046;&#24322;&#30340;&#26041;&#27861;&#30740;&#31350;&#20102;&#32929;&#19996;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#20294;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#36825;&#31181;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;</title><link>http://arxiv.org/abs/2103.12138</link><description>&lt;p&gt;
&#36861;&#27714;&#32929;&#19996;&#20215;&#20540;&#30340;&#20849;&#21516;&#25104;&#26412;
&lt;/p&gt;
&lt;p&gt;
The Shared Cost of Pursuing Shareholder Value. (arXiv:2103.12138v9 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2103.12138
&lt;/p&gt;
&lt;p&gt;
&#25991;&#31456;&#20351;&#29992;&#32929;&#19996;&#22823;&#20250;&#26102;&#38388;&#24046;&#24322;&#30340;&#26041;&#27861;&#30740;&#31350;&#20102;&#32929;&#19996;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#20294;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#36825;&#31181;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37319;&#29992;&#20934;&#23454;&#39564;&#24615;&#30340;&#26041;&#27861;&#65292;&#26681;&#25454;&#20844;&#21496;&#32929;&#19996;&#22823;&#20250;&#65288;AGMs&#65289;&#30340;&#26102;&#38388;&#24046;&#24322;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#21487;&#31227;&#26893;&#30340;&#26694;&#26550;&#65292;&#25512;&#26029;&#32929;&#19996;&#30340;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;covid&#30456;&#20851;&#25424;&#36192;&#12289;&#26368;&#36817;&#38024;&#23545;&#20420;&#32599;&#26031;&#30340;&#31169;&#20154;&#21046;&#35009;&#20197;&#21450;&#20844;&#21496;2012-19&#24180;&#30340;&#21033;&#20182;&#31435;&#22330;&#12290;AGMs&#30340;&#23186;&#20307;&#26333;&#20809;&#24102;&#26469;&#30340;&#24418;&#35937;&#25910;&#30410;&#65292;&#20351;&#24471;&#19982;&#20844;&#21496;&#21516;&#20041;&#30340;&#32929;&#19996;&#65288;&#22914;&#23494;&#20999;&#30456;&#20851;&#30340;&#20010;&#20154;&#65289;&#25903;&#25345;&#26114;&#36149;&#30340;&#21033;&#20182;&#21464;&#38761;&#65292;&#32780;&#20854;&#20182;&#32929;&#19996;&#65288;&#22914;&#37329;&#34701;&#20844;&#21496;&#65289;&#21453;&#23545;&#36825;&#20123;&#21464;&#38761;&#12290;&#25903;&#25345;&#36825;&#20123;&#21464;&#38761;&#30340;&#24433;&#21709;&#20351;&#25910;&#30410;&#19979;&#38477;&#20102;30&#65285;&#65306;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
Using quasi-experimental variations from the timing of firms' Annual General Meetings (AGMs), we propose a portable framework to infer shareholders' preferences and influences on firms' prosocial decisions and apply it to covid-related donations, recent private sanctions on Russia, and firms' prosocial stances over 2012-19. Image gains from AGMs' media exposure drive shareholders synonymous with a firm, like closely-connected individuals, to support costly prosocial changes, while others, like financial corporations, oppose them. Influence supporting these changes lowers earnings by 30\%: pursuing the values of (some) shareholders has distributional costs, which the monitoring of large shareholders motivated by heterogeneous preferences could prevent.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#26377;&#20215;&#20540;&#30340;&#36135;&#24065;&#36827;&#34892;&#26377;&#25928;&#36135;&#29289;&#20132;&#25442;&#30340;&#26426;&#21046;&#65292;&#22312;&#31995;&#32479;&#20013;&#24341;&#20837;&#20195;&#24065;&#24182;&#37319;&#21462;&#36141;&#20080;&#31246;&#31561;&#25514;&#26045;&#26469;&#25511;&#21046;&#36135;&#24065;&#30340;&#27969;&#21160;&#65292;&#23454;&#29616;&#20102;&#36135;&#24065;&#30340;&#30830;&#23450;&#27491;&#20540;&#12290;</title><link>http://arxiv.org/abs/1510.07888</link><description>&lt;p&gt;
&#20351;&#29992;&#26377;&#20215;&#20540;&#30340;&#36135;&#24065;&#36827;&#34892;&#36135;&#29289;&#20132;&#25442;
&lt;/p&gt;
&lt;p&gt;
Exchanging Goods Using Valuable Money. (arXiv:1510.07888v3 [q-fin.EC] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1510.07888
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#26377;&#20215;&#20540;&#30340;&#36135;&#24065;&#36827;&#34892;&#26377;&#25928;&#36135;&#29289;&#20132;&#25442;&#30340;&#26426;&#21046;&#65292;&#22312;&#31995;&#32479;&#20013;&#24341;&#20837;&#20195;&#24065;&#24182;&#37319;&#21462;&#36141;&#20080;&#31246;&#31561;&#25514;&#26045;&#26469;&#25511;&#21046;&#36135;&#24065;&#30340;&#27969;&#21160;&#65292;&#23454;&#29616;&#20102;&#36135;&#24065;&#30340;&#30830;&#23450;&#27491;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#32676;&#20154;&#24076;&#26395;&#22312;&#22810;&#20010;&#26102;&#38388;&#27573;&#20869;&#20351;&#29992;&#36135;&#24065;&#39640;&#25928;&#22320;&#36827;&#34892;&#36135;&#29289;&#20132;&#25442;&#12290;&#28982;&#32780;&#65292;&#20351;&#29992;&#20219;&#20309;&#36135;&#29289;&#20316;&#20026;&#36135;&#24065;&#37117;&#26377;&#32570;&#28857;&#65292;&#32780;&#19988;&#20197;&#32440;&#24065;&#25110;&#30828;&#24065;&#24418;&#24335;&#21457;&#34892;&#30340;&#27861;&#23450;&#36135;&#24065;&#22312;&#26368;&#21518;&#19968;&#20010;&#26102;&#38388;&#27573;&#23558;&#21464;&#24471;&#27627;&#26080;&#20215;&#20540;&#65292;&#22240;&#27492;&#22312;&#25152;&#26377;&#36739;&#26089;&#30340;&#26102;&#38388;&#27573;&#20063;&#23558;&#22914;&#27492;&#12290;&#27492;&#22806;&#65292;&#29926;&#23572;&#25289;&#26031;&#24066;&#22330;&#20215;&#26684;&#20165;&#30001;&#20219;&#24847;&#37325;&#26032;&#32553;&#25918;&#30830;&#23450;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#21487;&#20197;&#35774;&#35745;&#19968;&#31181;&#31995;&#32479;&#65292;&#35813;&#31995;&#32479;&#20351;&#29992;&#36135;&#24065;&#26469;&#20132;&#25442;&#36135;&#29289;&#65292;&#36135;&#24065;&#20855;&#26377;&#30830;&#23450;&#30340;&#27491;&#20540;&#12290;&#22312;&#36825;&#20010;&#31995;&#32479;&#20013;&#65292;&#20013;&#22830;&#26426;&#26500;&#26368;&#21021;&#21521;&#25152;&#26377;&#20132;&#26131;&#21830;&#25552;&#20379;&#20195;&#24065;&#65292;&#24182;&#36890;&#36807;&#36141;&#20080;&#31246;&#26469;&#22238;&#25910;&#12290;&#25152;&#26377;&#20132;&#26131;&#24517;&#39035;&#20351;&#29992;&#20195;&#24065;&#25110;&#20195;&#24065;&#30340;&#25903;&#20184;&#25215;&#35834;&#36827;&#34892;&#12290;&#36825;&#31181;&#26426;&#21046;&#25511;&#21046;&#30340;&#26159;&#36135;&#24065;&#30340;&#27969;&#21160;&#32780;&#19981;&#26159;&#23384;&#37327;&#65306;&#23427;&#24341;&#20837;&#20102;&#19968;&#20123;&#20132;&#26131;&#25705;&#25830;&#12289;&#19968;&#20123;&#36130;&#23500;&#20877;&#20998;&#37197;&#21644;&#19968;&#20123;&#20215;&#26684;&#25197;&#26354;&#65292;&#20294;&#36825;&#20123;&#24433;&#21709;&#37117;&#21487;&#20197;&#24456;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;
A group of people wishes to use money to exchange goods efficiently over several time periods. However, there are disadvantages to using any of the goods as money, and in addition fiat money issued in the form of notes or coins will be valueless in the final time period, and hence in all earlier periods. Also, Walrasian market prices are determined only up to an arbitrary rescaling. Nevertheless we show that it is possible to devise a system which uses money to exchange goods and in which money has a determinate positive value. In this system, tokens are initially supplied to all traders by a central authority and recovered by a purchase tax. All trades must be made using tokens or promissory notes for tokens. This mechanism controls the flow rather than the stock of money: it introduces some trading frictions, some redistribution of wealth, and some distortion of prices, but these effects can all be made small.
&lt;/p&gt;</description></item></channel></rss>