<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#35770;&#25991;&#25506;&#35752;&#20102;&#21306;&#22359;&#38142;&#37329;&#34701;&#20013;&#30340;&#24066;&#22330;&#19981;&#31471;&#34892;&#20026;&#65288;DeFi&#65289;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#20840;&#38754;&#23450;&#20041;&#21644;&#20998;&#31867;&#65292;&#36890;&#36807;&#27604;&#36739;&#20998;&#26512;&#21644;&#23454;&#35777;&#30740;&#31350;&#25581;&#31034;&#20102;&#20854;&#29305;&#28857;&#21644;&#31038;&#20250;&#24433;&#21709;&#65292;&#21516;&#26102;&#25506;&#35752;&#20102;DeFi&#30417;&#31649;&#26694;&#26550;&#25152;&#38754;&#20020;&#30340;&#25361;&#25112;&#12290;</title><link>https://arxiv.org/abs/2311.17715</link><description>&lt;p&gt;
&#21306;&#22359;&#38142;&#37329;&#34701;&#20013;&#30340;&#24066;&#22330;&#19981;&#31471;&#34892;&#20026;&#65288;DeFi&#65289;&#65306;&#20998;&#26512;&#12289;&#30417;&#31649;&#25361;&#25112;&#21644;&#25919;&#31574;&#24847;&#20041;
&lt;/p&gt;
&lt;p&gt;
Market Misconduct in Decentralized Finance (DeFi): Analysis, Regulatory Challenges and Policy Implications
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.17715
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25506;&#35752;&#20102;&#21306;&#22359;&#38142;&#37329;&#34701;&#20013;&#30340;&#24066;&#22330;&#19981;&#31471;&#34892;&#20026;&#65288;DeFi&#65289;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#20840;&#38754;&#23450;&#20041;&#21644;&#20998;&#31867;&#65292;&#36890;&#36807;&#27604;&#36739;&#20998;&#26512;&#21644;&#23454;&#35777;&#30740;&#31350;&#25581;&#31034;&#20102;&#20854;&#29305;&#28857;&#21644;&#31038;&#20250;&#24433;&#21709;&#65292;&#21516;&#26102;&#25506;&#35752;&#20102;DeFi&#30417;&#31649;&#26694;&#26550;&#25152;&#38754;&#20020;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25216;&#26415;&#36827;&#27493;&#25512;&#21160;&#37329;&#34701;&#21019;&#26032;&#65292;&#37325;&#22609;&#20102;&#20256;&#32479;&#37329;&#34701;&#26684;&#23616;&#65292;&#37325;&#26032;&#23450;&#20041;&#20102;&#29992;&#25143;&#19982;&#24066;&#22330;&#20043;&#38388;&#30340;&#20114;&#21160;&#12290;&#21306;&#22359;&#38142;&#21644;&#21435;&#20013;&#24515;&#21270;&#37329;&#34701;&#65288;DeFi&#65289;&#30340;&#20852;&#36215;&#24432;&#26174;&#20102;&#25216;&#26415;&#21644;&#37329;&#34701;&#20132;&#32455;&#21457;&#23637;&#30340;&#36827;&#31243;&#12290;&#34429;&#28982;DeFi&#24102;&#26469;&#20102;&#20196;&#20154;&#20852;&#22859;&#30340;&#26426;&#36935;&#65292;&#20063;&#20351;&#29983;&#24577;&#31995;&#32479;&#26292;&#38706;&#20110;&#26032;&#24418;&#24335;&#30340;&#24066;&#22330;&#19981;&#31471;&#34892;&#20026;&#20043;&#20013;&#12290;&#26412;&#25991;&#26088;&#22312;&#36890;&#36807;&#25506;&#35752;DeFi&#20013;&#30340;&#24066;&#22330;&#19981;&#31471;&#34892;&#20026;&#26469;&#24357;&#21512;&#23398;&#26415;&#30028;&#21644;&#30417;&#31649;&#30028;&#30340;&#24046;&#36317;&#65292;&#35299;&#20915;DeFi&#24066;&#22330;&#19981;&#31471;&#34892;&#20026;&#30340;&#20851;&#38190;&#30740;&#31350;&#38382;&#39064;&#12290;&#25105;&#20204;&#39318;&#20808;&#35752;&#35770;&#21306;&#22359;&#38142;&#25216;&#26415;&#22914;&#20309;&#28508;&#22312;&#22320;&#20419;&#20351;&#26032;&#24418;&#24335;&#30340;&#24066;&#22330;&#19981;&#31471;&#34892;&#20026;&#20986;&#29616;&#12290;&#28982;&#21518;&#20026;&#29702;&#35299;DeFi&#24066;&#22330;&#19981;&#31471;&#34892;&#20026;&#25552;&#20379;&#20840;&#38754;&#30340;&#23450;&#20041;&#21644;&#20998;&#31867;&#27861;&#12290;&#36890;&#36807;&#27604;&#36739;&#20998;&#26512;&#21644;&#23454;&#35777;&#27979;&#37327;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;DeFi&#20013;&#30340;&#26032;&#24418;&#24335;&#19981;&#31471;&#34892;&#20026;&#65292;&#38416;&#26126;&#20102;&#23427;&#20204;&#30340;&#29305;&#24449;&#21644;&#31038;&#20250;&#24433;&#21709;&#12290;&#38543;&#21518;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;&#26500;&#24314;DeFi&#30417;&#31649;&#26694;&#26550;&#25152;&#38754;&#20020;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.17715v2 Announce Type: replace  Abstract: Technological advancement drives financial innovation, reshaping the traditional finance landscape and redefining user-market interactions. The rise of blockchain and Decentralized Finance (DeFi) underscores this intertwined evolution of technology and finance. While DeFi has introduced exciting opportunities, it has also exposed the ecosystem to new forms of market misconduct. This paper aims to bridge the academic and regulatory gaps by addressing key research questions about market misconduct in DeFi. We begin by discussing how blockchain technology can potentially enable the emergence of novel forms of market misconduct. We then offer a comprehensive definition and taxonomy for understanding DeFi market misconduct. Through comparative analysis and empirical measurements, we examine the novel forms of misconduct in DeFi, shedding light on their characteristics and social impact. Subsequently, we investigate the challenges of build
&lt;/p&gt;</description></item></channel></rss>