<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#21608;&#26399;&#24615;&#22686;&#38271;&#36807;&#31243;&#20013;&#65292;&#36164;&#26412;&#21270;&#30340;&#26399;&#26395;&#20540;&#21462;&#20915;&#20110;&#36335;&#24452;&#65292;&#20174;&#32780;&#23548;&#33268;&#36164;&#26412;&#30340;&#22238;&#25253;&#29575;&#21644;&#26102;&#38388;&#24179;&#22343;&#22238;&#25253;&#29575;&#21462;&#20915;&#20110;&#36335;&#24452;&#65292;&#19988;&#20869;&#37096;&#25910;&#30410;&#29575;&#19982;&#36164;&#26412;&#22238;&#25253;&#29575;&#30340;&#26399;&#26395;&#20540;&#19981;&#21516;&#12290;</title><link>https://arxiv.org/abs/2403.08678</link><description>&lt;p&gt;
&#36164;&#26412;&#22238;&#25253;&#22312;&#21608;&#26399;&#24615;&#22686;&#38271;&#36807;&#31243;&#20013;&#30340;&#36335;&#24452;&#20381;&#36182;&#24615;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Path-dependency of capital return in periodic growth processes
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.08678
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#21608;&#26399;&#24615;&#22686;&#38271;&#36807;&#31243;&#20013;&#65292;&#36164;&#26412;&#21270;&#30340;&#26399;&#26395;&#20540;&#21462;&#20915;&#20110;&#36335;&#24452;&#65292;&#20174;&#32780;&#23548;&#33268;&#36164;&#26412;&#30340;&#22238;&#25253;&#29575;&#21644;&#26102;&#38388;&#24179;&#22343;&#22238;&#25253;&#29575;&#21462;&#20915;&#20110;&#36335;&#24452;&#65292;&#19988;&#20869;&#37096;&#25910;&#30410;&#29575;&#19982;&#36164;&#26412;&#22238;&#25253;&#29575;&#30340;&#26399;&#26395;&#20540;&#19981;&#21516;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#21608;&#26399;&#24615;&#22686;&#38271;&#36807;&#31243;&#12290;&#26681;&#25454;&#24212;&#35745;&#22522;&#30784;&#65292;&#21033;&#28070;&#29575;&#30340;&#26399;&#26395;&#20540;&#26082;&#19981;&#30452;&#25509;&#21462;&#20915;&#20110;&#20943;&#20540;&#65292;&#20063;&#19981;&#21462;&#20915;&#20110;&#36164;&#26412;&#21270;&#36335;&#24452;&#12290;&#36164;&#26412;&#21270;&#30340;&#26399;&#26395;&#20540;&#26159;&#36335;&#24452;&#20381;&#36182;&#30340;&#12290;&#30001;&#20110;&#20381;&#36182;&#36335;&#24452;&#30340;&#36164;&#26412;&#21270;&#65292;&#36164;&#26412;&#30340;&#22238;&#25253;&#29575;&#20063;&#26159;&#36335;&#24452;&#20381;&#36182;&#30340;&#65292;&#32780;&#36164;&#26412;&#30340;&#26102;&#38388;&#24179;&#22343;&#22238;&#25253;&#29575;&#19982;&#22686;&#38271;&#21608;&#26399;&#30340;&#26399;&#26395;&#20540;&#22238;&#25253;&#29575;&#19981;&#21516;&#12290;&#22312;&#27809;&#26377;&#20013;&#38388;&#20943;&#20540;&#30340;&#24773;&#20917;&#19979;&#65292;&#20869;&#37096;&#25910;&#30410;&#29575;&#26159;&#36335;&#24452;&#26080;&#20851;&#30340;&#65292;&#22240;&#27492;&#19982;&#36164;&#26412;&#22238;&#25253;&#29575;&#30340;&#26399;&#26395;&#20540;&#19981;&#21516;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#20351;&#26435;&#30410;&#22238;&#25253;&#29575;&#26368;&#22823;&#21270;&#30340;&#26059;&#36716;&#21608;&#26399;&#38271;&#24230;&#19982;&#24066;&#22330;&#21033;&#29575;&#26080;&#20851;&#12290;&#26464;&#26438;&#25928;&#24212;&#36890;&#36807;&#19968;&#20010;&#21333;&#29420;&#30340;&#26464;&#26438;&#26041;&#31243;&#36827;&#20837;&#22686;&#38271;&#36807;&#31243;&#30340;&#24494;&#35266;&#32463;&#27982;&#23398;&#20013;&#65292;&#26464;&#26438;&#31995;&#25968;&#21487;&#33021;&#36798;&#21040;&#27491;&#20540;&#25110;&#36127;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.08678v1 Announce Type: new  Abstract: Periodic growth processes are investigated. The expected value of the profit rate, on accrual basis, does not directly depend on divestments, neither on the capitalization path. The expected value of capitalization is path dependent. Because of the path-dependent capitalization, the return rate on capital is path-dependent, and the time-average return rate on capital differs from the expected-value return rate on capital for the growth cycle. In the absence of intermediate divestments, the internal rate of return is path-independent, thereby differing from the expected value of the rate of return on capital. It is shown that the rotation cycle length maximizing the return rate on equity is independent of market interest rate. Leveraging effect enters the microeconomics of the growth processes through a separate leveraging equation, where the leverage coefficient may reach positive or negative values. Correspondingly, from the viewpoint o
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#22343;&#22330;&#24494;&#27491;&#21017;&#26799;&#24230;&#19979;&#38477;&#26041;&#27861;&#65292;&#36890;&#36807;&#21516;&#26102;&#37319;&#26679;&#22810;&#20010;&#24369;&#32806;&#21512;&#25968;&#25454;&#28857;&#65292;&#22312;&#25511;&#21046;&#29109;&#25439;&#22833;&#30340;&#21516;&#26102;&#22312;&#20284;&#28982;&#25311;&#21512;&#26041;&#38754;&#34920;&#29616;&#33391;&#22909;&#12290;</title><link>https://arxiv.org/abs/2403.08362</link><description>&lt;p&gt;
&#22343;&#22330;&#24494;&#27491;&#21017;&#26799;&#24230;&#19979;&#38477;
&lt;/p&gt;
&lt;p&gt;
Mean-Field Microcanonical Gradient Descent
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.08362
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#22343;&#22330;&#24494;&#27491;&#21017;&#26799;&#24230;&#19979;&#38477;&#26041;&#27861;&#65292;&#36890;&#36807;&#21516;&#26102;&#37319;&#26679;&#22810;&#20010;&#24369;&#32806;&#21512;&#25968;&#25454;&#28857;&#65292;&#22312;&#25511;&#21046;&#29109;&#25439;&#22833;&#30340;&#21516;&#26102;&#22312;&#20284;&#28982;&#25311;&#21512;&#26041;&#38754;&#34920;&#29616;&#33391;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24494;&#27491;&#21017;&#26799;&#24230;&#19979;&#38477;&#26159;&#19968;&#31181;&#33021;&#37327;&#27169;&#22411;&#30340;&#37319;&#26679;&#36807;&#31243;&#65292;&#21487;&#23454;&#29616;&#39640;&#32500;&#20998;&#24067;&#30340;&#39640;&#25928;&#37319;&#26679;&#65292;&#36890;&#36807;&#26799;&#24230;&#19979;&#38477;&#23558;&#26679;&#26412;&#20174;&#39640;&#29109;&#20998;&#24067;&#65288;&#22914;&#39640;&#26031;&#30333;&#22122;&#22768;&#65289;&#36716;&#36816;&#33267;&#20302;&#33021;&#21306;&#22495;&#12290;&#25105;&#20204;&#23558;&#36825;&#19968;&#27169;&#22411;&#32622;&#20110;&#27491;&#21017;&#21270;&#27969;&#30340;&#26694;&#26550;&#20013;&#65292;&#26174;&#31034;&#23427;&#36890;&#24120;&#20250;&#30001;&#20110;&#22312;&#19979;&#38477;&#36807;&#31243;&#20013;&#22833;&#21435;&#19981;&#24517;&#35201;&#30340;&#29109;&#32780;&#36807;&#24230;&#25311;&#21512;&#12290;&#20026;&#35299;&#20915;&#36825;&#19968;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22343;&#22330;&#24494;&#27491;&#21017;&#26799;&#24230;&#19979;&#38477;&#65292;&#21516;&#26102;&#37319;&#26679;&#22810;&#20010;&#24369;&#32806;&#21512;&#25968;&#25454;&#28857;&#65292;&#20801;&#35768;&#26356;&#22909;&#22320;&#25511;&#21046;&#29109;&#25439;&#22833;&#65292;&#21516;&#26102;&#22312;&#20284;&#28982;&#25311;&#21512;&#26041;&#38754;&#20184;&#20986;&#36739;&#23567;&#20195;&#20215;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#27169;&#22411;&#24212;&#29992;&#20110;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#30340;&#32972;&#26223;&#20013;&#65292;&#23637;&#31034;&#20102;&#22312;&#21512;&#25104;&#21644;&#30495;&#23454;&#25968;&#25454;&#19978;&#30340;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.08362v1 Announce Type: cross  Abstract: Microcanonical gradient descent is a sampling procedure for energy-based models allowing for efficient sampling of distributions in high dimension. It works by transporting samples from a high-entropy distribution, such as Gaussian white noise, to a low-energy region using gradient descent. We put this model in the framework of normalizing flows, showing how it can often overfit by losing an unnecessary amount of entropy in the descent. As a remedy, we propose a mean-field microcanonical gradient descent that samples several weakly coupled data points simultaneously, allowing for better control of the entropy loss while paying little in terms of likelihood fit. We study these models in the context of financial time series, illustrating the improvements on both synthetic and real data.
&lt;/p&gt;</description></item><item><title>&#20844;&#20132;&#36208;&#24266;&#19978;&#24418;&#25104;&#30340;&#24694;&#24615;&#24490;&#29615;&#20250;&#23548;&#33268;&#20844;&#20132;&#36710;&#22836;&#36710;&#38388;&#38548;&#30340;&#19981;&#26029;&#22686;&#22823;&#65292;&#24310;&#35823;&#36880;&#28176;&#31215;&#32047;&#65292;&#37319;&#29992;&#19968;&#31181;&#31616;&#21333;&#30340;&#37322;&#25918;&#31574;&#30053;&#21487;&#20197;&#26377;&#25928;&#20943;&#36731;&#20844;&#20132;&#36710;&#24310;&#35823;&#12290;</title><link>https://arxiv.org/abs/2403.08230</link><description>&lt;p&gt;
&#27839;&#32321;&#24537;&#20844;&#20132;&#36208;&#24266;&#30340;&#24694;&#24615;&#24490;&#29615;&#21450;&#20854;&#32531;&#35299;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A vicious cycle along busy bus corridors and how to abate it
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.08230
&lt;/p&gt;
&lt;p&gt;
&#20844;&#20132;&#36208;&#24266;&#19978;&#24418;&#25104;&#30340;&#24694;&#24615;&#24490;&#29615;&#20250;&#23548;&#33268;&#20844;&#20132;&#36710;&#22836;&#36710;&#38388;&#38548;&#30340;&#19981;&#26029;&#22686;&#22823;&#65292;&#24310;&#35823;&#36880;&#28176;&#31215;&#32047;&#65292;&#37319;&#29992;&#19968;&#31181;&#31616;&#21333;&#30340;&#37322;&#25918;&#31574;&#30053;&#21487;&#20197;&#26377;&#25928;&#20943;&#36731;&#20844;&#20132;&#36710;&#24310;&#35823;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25581;&#31034;&#20102;&#19968;&#20010;&#20197;&#24448;&#26410;&#25253;&#21578;&#30340;&#24694;&#24615;&#24490;&#29615;&#29616;&#35937;&#65292;&#21363;&#22312;&#36208;&#24266;&#27839;&#32447;&#30340;&#36335;&#36793;&#31449;&#28857;&#24418;&#25104;&#20844;&#20132;&#36710;&#38431;&#21015;&#26102;&#21487;&#20197;&#20135;&#29983;&#12290;&#34987;&#22256;&#22312;&#35813;&#24490;&#29615;&#20013;&#30340;&#20844;&#20132;&#36710;&#22312;&#20174;&#19968;&#20010;&#31449;&#28857;&#21040;&#21478;&#19968;&#20010;&#31449;&#28857;&#30340;&#34892;&#39542;&#36807;&#31243;&#20013;&#65292;&#20986;&#29616;&#22836;way&#30340;&#21464;&#21270;&#12290;&#20844;&#20132;&#36710;&#65288;&#20197;&#21450;&#20056;&#23458;&#65289;&#30340;&#24310;&#35823;&#20063;&#20197;&#31867;&#20284;&#26041;&#24335;&#31215;&#32047;&#65292;&#24182;&#19988;&#22312;&#38271;&#36317;&#31163;&#12289;&#32321;&#24537;&#30340;&#36208;&#24266;&#19978;&#21487;&#33021;&#20250;&#21464;&#24471;&#24456;&#22823;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#21487;&#20197;&#36890;&#36807;&#31616;&#21333;&#26041;&#24335;&#20943;&#36731;&#36825;&#31181;&#26377;&#23475;&#24490;&#29615;&#30340;&#26041;&#27861;&#12290;&#30446;&#21069;&#30340;&#35299;&#20915;&#26041;&#26696;&#21253;&#25324;&#22312;&#36208;&#24266;&#20837;&#21475;&#22788;&#26242;&#20572;&#20844;&#20132;&#36710;&#65292;&#24182;&#25353;&#29031;&#25991;&#29486;&#20013;&#25552;&#20986;&#30340;&#21508;&#31181;&#31574;&#30053;&#37322;&#25918;&#23427;&#20204;&#12290;&#25105;&#20204;&#20171;&#32461;&#20102;&#23545;&#26368;&#31616;&#21333;&#31574;&#30053;&#30340;&#19968;&#31181;&#23567;&#22411;&#21464;&#20307;&#12290;&#23427;&#20197;&#30053;&#23567;&#20110;&#25110;&#31561;&#20110;&#35745;&#21010;&#20540;&#30340;&#22836;&#36710;&#38388;&#38548;&#37322;&#25918;&#20844;&#20132;&#36710;&#12290;&#20107;&#23454;&#35777;&#26126;&#65292;&#21608;&#26399;&#24615;&#22320;&#20197;&#31245;&#23569;&#30340;&#22836;&#36710;&#38388;&#38548;&#37322;&#25918;&#20844;&#20132;&#36710;&#21487;&#20197;&#22823;&#24133;&#20943;&#23569;&#30001;&#20110;&#26242;&#20572;&#32780;&#36896;&#25104;&#30340;&#20844;&#20132;&#36710;&#24310;&#35823;&#65292;&#22240;&#27492;&#22312;&#21253;&#21547;&#36275;&#22815;&#25968;&#37327;&#20018;&#34892;&#20844;&#20132;&#31449;&#28857;&#30340;&#36208;&#24266;&#20013;&#65292;&#30410;&#22788;&#21487;&#20197;&#26356;&#24555;&#22320;&#36229;&#36807;&#25104;&#26412;&#12290;&#36825;&#31181;&#31616;&#21333;&#30340;&#21464;&#20307;&#24050;&#34987;&#35777;&#26126;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.08230v1 Announce Type: new  Abstract: We unveil that a previously-unreported vicious cycle can be created when bus queues form at curbside stops along a corridor. Buses caught in this cycle exhibit growing variation in headways as they travel from stop to stop. Bus (and patron) delays accumulate in like fashion and can grow large on long, busy corridors. We show that this damaging cycle can be abated in simple ways. Present solutions entail holding buses at a corridor entrance and releasing them as per various strategies proposed in the literature. We introduce a modest variant to the simplest of these strategies. It releases buses at headways that are slightly less than, or equal to, the scheduled values. It turns out that periodically releasing buses at slightly smaller headways can substantially reduce bus delays caused by holding so that benefits can more readily outweigh costs in corridors that contain a sufficient number of serial bus stops. The simple variant is shown
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20102;&#19968;&#20010;&#24066;&#22330;&#20013;&#65292;&#23384;&#22312;&#22810;&#20010;&#39640;&#39057;&#39044;&#27979;&#20132;&#26131;&#32773;&#30340;&#24773;&#20917;&#19979;&#65292;&#25552;&#20986;&#20102;&#20869;&#24149;&#20132;&#26131;&#32773;&#30340;&#38543;&#26426;&#21270;&#31574;&#30053;&#24314;&#35758;&#65292;&#21457;&#29616;&#25552;&#39640;&#39044;&#27979;&#20132;&#26131;&#32773;&#30340;&#36895;&#24230;&#25110;&#26356;&#31934;&#30830;&#30340;&#39044;&#27979;&#21487;&#33021;&#26377;&#21161;&#20110;&#20869;&#24149;&#20132;&#26131;&#32773;&#12290;</title><link>https://arxiv.org/abs/2403.08202</link><description>&lt;p&gt;
&#22312;&#23384;&#22312;&#22810;&#20010;&#39640;&#39057;&#39044;&#27979;&#20132;&#26131;&#32773;&#30340;&#24773;&#20917;&#19979;&#20132;&#26131;&#22823;&#39069;&#35746;&#21333;
&lt;/p&gt;
&lt;p&gt;
Trading Large Orders in the Presence of Multiple High-Frequency Anticipatory Traders
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.08202
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#19968;&#20010;&#24066;&#22330;&#20013;&#65292;&#23384;&#22312;&#22810;&#20010;&#39640;&#39057;&#39044;&#27979;&#20132;&#26131;&#32773;&#30340;&#24773;&#20917;&#19979;&#65292;&#25552;&#20986;&#20102;&#20869;&#24149;&#20132;&#26131;&#32773;&#30340;&#38543;&#26426;&#21270;&#31574;&#30053;&#24314;&#35758;&#65292;&#21457;&#29616;&#25552;&#39640;&#39044;&#27979;&#20132;&#26131;&#32773;&#30340;&#36895;&#24230;&#25110;&#26356;&#31934;&#30830;&#30340;&#39044;&#27979;&#21487;&#33021;&#26377;&#21161;&#20110;&#20869;&#24149;&#20132;&#26131;&#32773;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#24066;&#22330;&#65292;&#20854;&#20013;&#26377;&#19968;&#20010;&#20351;&#29992;&#28151;&#21512;&#31574;&#30053;&#30340;&#27491;&#24120;&#36895;&#24230;&#20869;&#24149;&#20132;&#26131;&#32773;&#65288;IT&#65289;&#65292;&#20197;&#21450;&#22810;&#20010;&#22788;&#20110;&#19981;&#21516;&#24211;&#23384;&#21387;&#21147;&#19979;&#30340;&#39640;&#39057;&#39044;&#27979;&#20132;&#26131;&#32773;&#65288;HFTs&#65289;&#65292;&#22312;&#19968;&#20010;&#19977;&#26399;&#30340;Kyle&#27169;&#22411;&#20013;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#32431;&#31574;&#30053;&#21644;&#28151;&#21512;&#31574;&#30053;&#22343;&#34913;&#65292;&#24182;&#26681;&#25454;&#19981;&#21516;&#25968;&#37327;&#30340;HFTs&#20026;IT&#30340;&#38543;&#26426;&#21270;&#31574;&#30053;&#25552;&#20379;&#24314;&#35758;&#12290;&#19968;&#20123;&#20851;&#20110;&#25237;&#36164;&#32773;&#21033;&#28070;&#30340;&#20196;&#20154;&#24778;&#35766;&#30340;&#32467;&#26524;&#20986;&#29616;&#65306;&#25552;&#39640;&#39044;&#27979;&#20132;&#26131;&#32773;&#30340;&#36895;&#24230;&#25110;&#26356;&#31934;&#30830;&#30340;&#39044;&#27979;&#21487;&#33021;&#20250;&#20260;&#23475;&#20182;&#20204;&#33258;&#24049;&#65292;&#20294;&#26377;&#21161;&#20110;IT&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.08202v1 Announce Type: new  Abstract: We investigate a market with a normal-speed informed trader (IT) who may employ mixed strategy and multiple anticipatory high-frequency traders (HFTs) who are under different inventory pressures, in a three-period Kyle's model. The pure- and mixed-strategy equilibria are considered and the results provide recommendations for IT's randomization strategy with different numbers of HFTs. Some surprising results about investors' profits arise: the improvement of anticipatory traders' speed or a more precise prediction may harm themselves but help IT.
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#22270;&#24418;&#21305;&#37197;&#26041;&#27861;&#36873;&#21462;&#20855;&#26377;&#24378;&#21327;&#25972;&#24615;&#30340;&#37197;&#23545;&#65292;&#20197;&#35299;&#20915;&#20256;&#32479;&#37197;&#23545;&#20132;&#26131;&#20013;&#38598;&#20013;&#22312;&#23569;&#25968;&#39640;&#21327;&#25972;&#36164;&#20135;&#30340;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2403.07998</link><description>&lt;p&gt;
&#20351;&#29992;&#26032;&#39062;&#30340;&#22270;&#24418;&#21305;&#37197;&#26041;&#27861;&#36827;&#34892;&#37197;&#23545;&#20132;&#26131;
&lt;/p&gt;
&lt;p&gt;
Pairs Trading Using a Novel Graphical Matching Approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07998
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#22270;&#24418;&#21305;&#37197;&#26041;&#27861;&#36873;&#21462;&#20855;&#26377;&#24378;&#21327;&#25972;&#24615;&#30340;&#37197;&#23545;&#65292;&#20197;&#35299;&#20915;&#20256;&#32479;&#37197;&#23545;&#20132;&#26131;&#20013;&#38598;&#20013;&#22312;&#23569;&#25968;&#39640;&#21327;&#25972;&#36164;&#20135;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37197;&#23545;&#20132;&#26131;&#26159;&#19968;&#31181;&#21033;&#29992;&#30001;&#30456;&#20284;&#22240;&#32032;&#39537;&#21160;&#30340;&#36164;&#20135;&#23545;&#20215;&#26684;&#27874;&#21160;&#32780;&#33719;&#21033;&#30340;&#31574;&#30053;&#65292;&#22312;&#20132;&#26131;&#32773;&#20013;&#38388;&#24191;&#21463;&#27426;&#36814;&#12290;&#36890;&#24120;&#20570;&#27861;&#26159;&#36873;&#25321;&#39640;&#24230;&#21327;&#25972;&#30340;&#37197;&#23545;&#32452;&#25104;&#25237;&#36164;&#32452;&#21512;&#65292;&#36825;&#24448;&#24448;&#23548;&#33268;&#21253;&#21547;&#22810;&#20010;&#20849;&#20139;&#30456;&#21516;&#36164;&#20135;&#30340;&#37197;&#23545;&#12290;&#34429;&#28982;&#36825;&#31181;&#26041;&#27861;&#30452;&#35266;&#65292;&#20294;&#19981;&#32463;&#24847;&#38388;&#25552;&#39640;&#20102;&#25237;&#36164;&#32452;&#21512;&#30340;&#26041;&#24046;&#65292;&#38477;&#20302;&#20102;&#39118;&#38505;&#35843;&#25972;&#21518;&#30340;&#25910;&#30410;&#65292;&#22240;&#20026;&#23427;&#38598;&#20013;&#22312;&#23569;&#25968;&#39640;&#24230;&#21327;&#25972;&#30340;&#36164;&#20135;&#19978;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#31181;&#21019;&#26032;&#30340;&#37197;&#23545;&#36873;&#25321;&#26041;&#27861;&#65292;&#37319;&#29992;&#20102;&#26088;&#22312;&#35299;&#20915;&#36825;&#19968;&#25361;&#25112;&#30340;&#22270;&#24418;&#21305;&#37197;&#12290;&#25105;&#20204;&#20351;&#29992;&#24102;&#26435;&#22270;&#26469;&#23545;&#25152;&#26377;&#36164;&#20135;&#21450;&#20854;&#21327;&#25972;&#27700;&#24179;&#36827;&#34892;&#24314;&#27169;&#65292;&#20854;&#20013;&#36793;&#34920;&#31034;&#37197;&#23545;&#65292;&#26435;&#37325;&#34920;&#31034;&#21327;&#25972;&#31243;&#24230;&#12290;&#37197;&#23545;&#32452;&#21512;&#26159;&#35813;&#22270;&#30340;&#23376;&#22270;&#12290;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#20197;&#35813;&#22270;&#30340;&#26368;&#22823;&#21152;&#26435;&#21305;&#37197;&#20026;&#22522;&#30784;&#30340;&#25237;&#36164;&#32452;&#21512;&#65292;&#20197;&#36873;&#21462;&#20855;&#26377;&#36739;&#24378;&#21327;&#25972;&#24615;&#30340;&#37197;&#23545;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07998v1 Announce Type: cross  Abstract: Pairs trading, a strategy that capitalizes on price movements of asset pairs driven by similar factors, has gained significant popularity among traders. Common practice involves selecting highly cointegrated pairs to form a portfolio, which often leads to the inclusion of multiple pairs sharing common assets. This approach, while intuitive, inadvertently elevates portfolio variance and diminishes risk-adjusted returns by concentrating on a small number of highly cointegrated assets. Our study introduces an innovative pair selection method employing graphical matchings designed to tackle this challenge. We model all assets and their cointegration levels with a weighted graph, where edges signify pairs and their weights indicate the extent of cointegration. A portfolio of pairs is a subgraph of this graph. We construct a portfolio which is a maximum weighted matching of this graph to select pairs which have strong cointegration while sim
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#20851;&#20110;&#38134;&#34892;&#32489;&#25928;&#20915;&#23450;&#22240;&#32032;&#30340;&#26368;&#26032;&#32508;&#36848;&#65292;&#37492;&#20110;&#29616;&#26377;&#25991;&#29486;&#30340;&#37325;&#35201;&#24615;&#65292;&#23545;&#20110;&#38134;&#34892;&#32463;&#29702;&#12289;&#30417;&#31649;&#26426;&#26500;&#21644;&#23398;&#32773;&#26469;&#35828;&#65292;&#23545;&#36825;&#20123;&#20915;&#23450;&#22240;&#32032;&#30340;&#28145;&#20837;&#29702;&#35299;&#20173;&#28982;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#65292;&#23588;&#20854;&#26159;&#22312;COVID-19&#21644;&#25968;&#23383;&#21270;&#36716;&#22411;&#24102;&#26469;&#30340;&#26032;&#21464;&#21270;&#32972;&#26223;&#19979;&#12290;</title><link>http://arxiv.org/abs/2311.08617</link><description>&lt;p&gt;
&#38134;&#34892;&#32489;&#25928;&#20915;&#23450;&#22240;&#32032;&#65306;&#29616;&#29366;&#19982;&#26410;&#26469;&#30740;&#31350;&#36884;&#24452;
&lt;/p&gt;
&lt;p&gt;
Bank Performance Determinants: State of the Art and Future Research Avenues. (arXiv:2311.08617v2 [q-fin.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.08617
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#20851;&#20110;&#38134;&#34892;&#32489;&#25928;&#20915;&#23450;&#22240;&#32032;&#30340;&#26368;&#26032;&#32508;&#36848;&#65292;&#37492;&#20110;&#29616;&#26377;&#25991;&#29486;&#30340;&#37325;&#35201;&#24615;&#65292;&#23545;&#20110;&#38134;&#34892;&#32463;&#29702;&#12289;&#30417;&#31649;&#26426;&#26500;&#21644;&#23398;&#32773;&#26469;&#35828;&#65292;&#23545;&#36825;&#20123;&#20915;&#23450;&#22240;&#32032;&#30340;&#28145;&#20837;&#29702;&#35299;&#20173;&#28982;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#65292;&#23588;&#20854;&#26159;&#22312;COVID-19&#21644;&#25968;&#23383;&#21270;&#36716;&#22411;&#24102;&#26469;&#30340;&#26032;&#21464;&#21270;&#32972;&#26223;&#19979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38134;&#34892;&#30340;&#32489;&#25928;&#23545;&#20110;&#19987;&#19994;&#20154;&#22763;&#21644;&#30740;&#31350;&#20154;&#21592;&#26469;&#35828;&#26159;&#19968;&#20010;&#37325;&#35201;&#30340;&#20027;&#39064;&#12290;&#37492;&#20110;&#36825;&#20010;&#35838;&#39064;&#30340;&#37325;&#35201;&#25991;&#29486;&#65292;&#26412;&#25991;&#26088;&#22312;&#25552;&#20379;&#19968;&#20221;&#26368;&#26032;&#21644;&#26377;&#32452;&#32455;&#30340;&#20851;&#20110;&#38134;&#34892;&#32489;&#25928;&#20915;&#23450;&#22240;&#32032;&#30340;&#25991;&#29486;&#32508;&#36848;&#12290;&#26412;&#25991;&#35752;&#35770;&#20102;&#22609;&#36896;&#38134;&#34892;&#32489;&#25928;&#35752;&#35770;&#21450;&#20854;&#20915;&#23450;&#22240;&#32032;&#30340;&#20027;&#35201;&#26041;&#27861;&#12290;&#23545;&#36825;&#20123;&#20915;&#23450;&#22240;&#32032;&#30340;&#28145;&#20837;&#29702;&#35299;&#21487;&#20197;&#19968;&#26041;&#38754;&#24110;&#21161;&#38134;&#34892;&#32463;&#29702;&#21644;&#30417;&#31649;&#26426;&#26500;&#25552;&#39640;&#34892;&#19994;&#25928;&#29575;&#65292;&#24182;&#24212;&#23545;&#22609;&#36896;&#34892;&#19994;&#26410;&#26469;&#30340;&#26032;&#36235;&#21183;&#65307;&#21478;&#19968;&#26041;&#38754;&#65292;&#21487;&#20197;&#24110;&#21161;&#23398;&#32773;&#20016;&#23500;&#30740;&#31350;&#21644;&#30693;&#35782;&#39046;&#22495;&#12290;&#36890;&#36807;&#23545;42&#20010;&#21516;&#34892;&#35780;&#23457;&#26399;&#21002;&#19978;&#21457;&#34920;&#30340;54&#20010;&#30740;&#31350;&#36827;&#34892;&#20998;&#26512;&#65292;&#25105;&#20204;&#21457;&#29616;&#23613;&#31649;&#29616;&#26377;&#25991;&#29486;&#30340;&#37325;&#35201;&#24615;&#65292;&#20851;&#20110;&#38134;&#34892;&#32489;&#25928;&#22240;&#32032;&#30340;&#30740;&#31350;&#20173;&#28982;&#27809;&#26377;&#25581;&#31034;&#20986;&#25152;&#26377;&#30340;&#31192;&#23494;&#65292;&#20173;&#28982;&#26159;&#19968;&#20010;&#23500;&#26377;&#20105;&#35758;&#30340;&#30740;&#31350;&#39046;&#22495;&#65292;&#29305;&#21035;&#26159;&#32771;&#34385;&#21040;COVID-19&#20197;&#21450;&#25968;&#23383;&#21270;&#36716;&#22411;&#21147;&#24230;&#30340;&#19981;&#26029;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;
Banks' performance is an important topic for both professionals and researchers. Given the important literature on this subject, this paper aims to bring an up-to-date and organized review of literature on the determinants of banks performance. This paper discusses the main approaches that molded the debate on banks performance and their main determinants. An in-depth understanding of these latter may allow on the one hand, bank managers and regulators to improve the sector efficiency and to deal with the new trends shaping the future of their industry and on the other hand, academicians to enrich research and knowledge on this field. Through the analysis of 54 studies published in 42 peer-reviewed journals, we show that despite the importance of the existent literature, the subject of bank performance factors did not reveal all its secrets and still constitute a fertile field for critical debates, especially since the COVID-19 and the increasingly pressing rise in power of digital tra
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#39640;&#26031;&#26694;&#26550;&#19979;&#30340;&#21033;&#29575;&#20984;&#24615;&#65292;&#25552;&#20986;&#20102;&#30001;&#39640;&#26031;Volterra&#36807;&#31243;&#39537;&#21160;&#30340;&#30701;&#26399;&#21033;&#29575;&#27169;&#22411;&#65292;&#24182;&#32473;&#20986;&#20102;&#20984;&#24615;&#35843;&#25972;&#30340;&#26174;&#24335;&#20844;&#24335;&#12290;</title><link>http://arxiv.org/abs/2307.14218</link><description>&lt;p&gt;
&#39640;&#26031;&#26694;&#26550;&#19979;&#30340;&#21033;&#29575;&#20984;&#24615;
&lt;/p&gt;
&lt;p&gt;
Interest rate convexity in a Gaussian framework. (arXiv:2307.14218v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.14218
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#39640;&#26031;&#26694;&#26550;&#19979;&#30340;&#21033;&#29575;&#20984;&#24615;&#65292;&#25552;&#20986;&#20102;&#30001;&#39640;&#26031;Volterra&#36807;&#31243;&#39537;&#21160;&#30340;&#30701;&#26399;&#21033;&#29575;&#27169;&#22411;&#65292;&#24182;&#32473;&#20986;&#20102;&#20984;&#24615;&#35843;&#25972;&#30340;&#26174;&#24335;&#20844;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30340;&#36129;&#29486;&#26377;&#20004;&#20010;&#65306;&#25105;&#20204;&#23450;&#20041;&#24182;&#30740;&#31350;&#20102;&#30001;&#19968;&#33324;&#39640;&#26031;Volterra&#36807;&#31243;&#39537;&#21160;&#30340;&#30701;&#26399;&#21033;&#29575;&#27169;&#22411;&#30340;&#24615;&#36136;&#65292;&#24182;&#22312;&#20934;&#30830;&#23450;&#20041;&#20984;&#24615;&#35843;&#25972;&#30340;&#22522;&#30784;&#19978;&#65292;&#25512;&#23548;&#20102;&#20854;&#26174;&#24335;&#30340;&#20844;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
The contributions of this paper are twofold: we define and investigate the properties of a short rate model driven by a general Gaussian Volterra process and, after defining precisely a notion of convexity adjustment, derive explicit formulae for it.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#21457;&#29616;&#65292;&#21152;&#26435;&#24179;&#22343;iid&#26497;&#37325;&#23614;Pareto&#25439;&#22833;&#22312;&#31532;&#19968;&#39034;&#24207;&#38543;&#26426;&#20248;&#21183;&#24847;&#20041;&#19979;&#22823;&#20110;&#21333;&#19968;&#25439;&#22833;&#12290;&#36890;&#36807;&#22343;&#34913;&#20998;&#26512;&#35777;&#26126;&#65292;&#22810;&#26679;&#21270;&#23558;&#22686;&#21152;&#32452;&#21512;&#39118;&#38505;&#65292;&#25317;&#26377;&#26497;&#37325;&#23614;Pareto&#25439;&#22833;&#30340;&#21442;&#19982;&#32773;&#22312;&#24066;&#22330;&#22343;&#34913;&#20013;&#23558;&#19981;&#20250;&#20998;&#20139;&#39118;&#38505;&#12290;</title><link>http://arxiv.org/abs/2208.08471</link><description>&lt;p&gt;
&#19968;&#20010;&#20986;&#20046;&#24847;&#26009;&#30340;&#38543;&#26426;&#20248;&#21183;&#65306;&#24085;&#32047;&#25176;&#20998;&#24067;&#12289;&#28798;&#38590;&#21644;&#39118;&#38505;&#20132;&#25442;
&lt;/p&gt;
&lt;p&gt;
An unexpected stochastic dominance: Pareto distributions, catastrophes, and risk exchange. (arXiv:2208.08471v2 [q-fin.RM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.08471
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#21457;&#29616;&#65292;&#21152;&#26435;&#24179;&#22343;iid&#26497;&#37325;&#23614;Pareto&#25439;&#22833;&#22312;&#31532;&#19968;&#39034;&#24207;&#38543;&#26426;&#20248;&#21183;&#24847;&#20041;&#19979;&#22823;&#20110;&#21333;&#19968;&#25439;&#22833;&#12290;&#36890;&#36807;&#22343;&#34913;&#20998;&#26512;&#35777;&#26126;&#65292;&#22810;&#26679;&#21270;&#23558;&#22686;&#21152;&#32452;&#21512;&#39118;&#38505;&#65292;&#25317;&#26377;&#26497;&#37325;&#23614;Pareto&#25439;&#22833;&#30340;&#21442;&#19982;&#32773;&#22312;&#24066;&#22330;&#22343;&#34913;&#20013;&#23558;&#19981;&#20250;&#20998;&#20139;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23637;&#31034;&#20102;&#19968;&#20010;&#25110;&#35768;&#20196;&#20154;&#24778;&#35766;&#30340;&#19981;&#31561;&#24335;&#65306;&#21152;&#26435;&#24179;&#22343;iid&#26497;&#37325;&#23614;&#65288;&#21363;&#26080;&#31351;&#22823;&#22343;&#20540;&#65289;&#30340; Pareto &#25439;&#22833;&#22312;&#31532;&#19968;&#39034;&#24207;&#38543;&#26426;&#20248;&#21183;&#24847;&#20041;&#19979;&#22823;&#20110;&#21333;&#19968;&#25439;&#22833;&#12290;&#27492;&#32467;&#26524;&#34987;&#36827;&#19968;&#27493;&#25512;&#24191;&#21040; Pareto &#39118;&#38505;, &#24182;&#22312;&#36127;&#30456;&#20851;&#12289;&#20984;&#36716;&#25442;&#12289;&#38543;&#26426;&#27714;&#21644;&#21644;&#26435;&#37325;&#65292;&#20197;&#21450;&#28798;&#38590;&#20107;&#20214;&#35302;&#21457;&#30340;&#25439;&#22833;&#32972;&#26223;&#19979;&#36827;&#34892;&#25506;&#35752;&#12290;&#36890;&#36807;&#39118;&#38505;&#20132;&#25442;&#24066;&#22330;&#20013;&#30340;&#22343;&#34913;&#20998;&#26512;&#65292;&#25105;&#20204;&#35752;&#35770;&#20102;&#36825;&#20123;&#32467;&#26524;&#30340;&#20960;&#20010;&#24433;&#21709;&#12290;&#39318;&#20808;&#65292;&#26497;&#37325;&#23614; Pareto &#25439;&#22833;&#30340;&#22810;&#26679;&#21270;&#22686;&#21152;&#20102;&#32452;&#21512;&#39118;&#38505;&#65292;&#22240;&#27492;&#23384;&#22312;&#22810;&#26679;&#21270;&#24809;&#32602;&#12290;&#20854;&#27425;&#65292;&#25317;&#26377;&#26497;&#37325;&#23614; Pareto &#25439;&#22833;&#30340;&#21442;&#19982;&#32773;&#23558;&#19981;&#20250;&#22312;&#24066;&#22330;&#22343;&#34913;&#20013;&#20998;&#20139;&#39118;&#38505;&#12290;&#31532;&#19977;&#65292;&#23558;&#25215;&#25285; Pareto &#25439;&#22833;&#30340;&#21442;&#19982;&#32773;&#30340;&#25439;&#22833;&#36716;&#31227;&#21040;&#27809;&#26377;&#20219;&#20309;&#25439;&#22833;&#30340;&#22806;&#37096;&#26041;&#65292;&#21487;&#20197;&#23454;&#29616;&#20351;&#27599;&#19968;&#26041;&#37117;&#21463;&#30410;&#30340;&#22343;&#34913;&#12290;&#25105;&#20204;&#30340;&#23454;&#35777;&#30740;&#31350;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#26032;&#19981;&#31561;&#24335;&#21487;&#20197;&#22312;&#23454;&#38469;&#25968;&#25454;&#20013;&#34987;&#35266;&#23519;&#21040;&#12290;
&lt;/p&gt;
&lt;p&gt;
We show the perhaps surprising inequality that the weighted average of iid extremely heavy-tailed (i.e., infinite mean) Pareto losses is larger than a standalone loss in the sense of first-order stochastic dominance. This result is further generalized to Pareto risks in the context of negative dependence, convex transformations, random summation and weights, and losses triggered by catastrophic events. We discuss several implications of these results via an equilibrium analysis in a risk exchange market. First, diversification of extremely heavy-tailed Pareto losses increases portfolio risk, and thus a diversification penalty exists. Second, agents with extremely heavy-tailed Pareto losses will not share risks in a market equilibrium. Third, transferring losses from agents bearing Pareto losses to external parties without any losses may arrive at an equilibrium which benefits every party involved. The empirical studies show that our new inequality can be observed empirically for real d
&lt;/p&gt;</description></item></channel></rss>