<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#24320;&#28304;&#30340;&#30005;&#21147;&#37096;&#38376;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;2030&#24180;&#24503;&#22269;&#22823;&#35268;&#27169;&#25193;&#24352;&#20998;&#25955;&#24335;&#28909;&#27893;&#23545;&#30005;&#21147;&#37096;&#38376;&#30340;&#24433;&#21709;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#28909;&#27893;&#30340;&#25512;&#24191;&#21487;&#20197;&#36890;&#36807;&#22826;&#38451;&#33021;&#20809;&#20239;&#31561;&#21487;&#20877;&#29983;&#33021;&#28304;&#23454;&#29616;&#65292;&#19988;&#39069;&#22806;&#30340;&#22791;&#29992;&#23481;&#37327;&#21644;&#30005;&#21147;&#20648;&#23384;&#38656;&#27714;&#26377;&#38480;&#12290;</title><link>http://arxiv.org/abs/2307.12918</link><description>&lt;p&gt;
&#28789;&#27963;&#30340;&#28909;&#27893;&#65306;&#22312;&#21487;&#20877;&#29983;&#33021;&#28304;&#39046;&#22495;&#20013;&#30340;&#30005;&#21147;&#37096;&#38376;&#20013;&#26159;&#24517;&#38656;&#36824;&#26159;&#21487;&#36873;&#65311;
&lt;/p&gt;
&lt;p&gt;
Flexible heat pumps: must-have or nice to have in a power sector with renewables?. (arXiv:2307.12918v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.12918
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#24320;&#28304;&#30340;&#30005;&#21147;&#37096;&#38376;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;2030&#24180;&#24503;&#22269;&#22823;&#35268;&#27169;&#25193;&#24352;&#20998;&#25955;&#24335;&#28909;&#27893;&#23545;&#30005;&#21147;&#37096;&#38376;&#30340;&#24433;&#21709;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#28909;&#27893;&#30340;&#25512;&#24191;&#21487;&#20197;&#36890;&#36807;&#22826;&#38451;&#33021;&#20809;&#20239;&#31561;&#21487;&#20877;&#29983;&#33021;&#28304;&#23454;&#29616;&#65292;&#19988;&#39069;&#22806;&#30340;&#22791;&#29992;&#23481;&#37327;&#21644;&#30005;&#21147;&#20648;&#23384;&#38656;&#27714;&#26377;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28909;&#27893;&#26159;&#20943;&#23569;&#20379;&#26262;&#39046;&#22495;&#21270;&#30707;&#29123;&#26009;&#20351;&#29992;&#30340;&#20851;&#38190;&#25216;&#26415;&#12290;&#21521;&#28909;&#27893;&#30340;&#36716;&#21464;&#24847;&#21619;&#30528;&#20908;&#23395;&#23506;&#20919;&#26376;&#20221;&#30005;&#21147;&#38656;&#27714;&#30340;&#22686;&#21152;&#12290;&#20351;&#29992;&#24320;&#28304;&#30340;&#30005;&#21147;&#37096;&#38376;&#27169;&#22411;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;2030&#24180;&#24503;&#22269;&#30340;&#20998;&#25955;&#24335;&#28909;&#27893;&#22823;&#35268;&#27169;&#25193;&#24352;&#23545;&#30005;&#21147;&#37096;&#38376;&#30340;&#24433;&#21709;&#65292;&#32467;&#21512;&#19981;&#21516;&#35268;&#27169;&#30340;&#32531;&#20914;&#28909;&#23384;&#20648;&#12290;&#20551;&#35774;&#28909;&#27893;&#39069;&#22806;&#20351;&#29992;&#30340;&#30005;&#21147;&#22312;&#24180;&#24230;&#24179;&#34913;&#20013;&#24517;&#39035;&#23436;&#20840;&#30001;&#21487;&#20877;&#29983;&#33021;&#28304;&#35206;&#30422;&#65292;&#25105;&#20204;&#37327;&#21270;&#20102;&#21487;&#20877;&#29983;&#33021;&#28304;&#25152;&#38656;&#30340;&#39069;&#22806;&#25237;&#36164;&#12290;&#22914;&#26524;&#39118;&#21147;&#25193;&#24352;&#28508;&#21147;&#26377;&#38480;&#65292;&#28909;&#27893;&#30340;&#25512;&#24191;&#20063;&#21487;&#20197;&#36890;&#36807;&#22826;&#38451;&#33021;&#20809;&#20239;&#22312;&#27431;&#27954;&#20114;&#32852;&#36830;&#25509;&#30340;&#24773;&#20917;&#19979;&#20316;&#20026;&#38468;&#21152;&#25104;&#26412;&#36739;&#23567;&#30340;&#36873;&#25321;&#12290;&#21363;&#20351;&#22312;&#26102;&#38388;&#19978;&#19981;&#28789;&#27963;&#30340;&#28909;&#27893;&#30340;&#24773;&#20917;&#19979;&#65292;&#23545;&#39069;&#22806;&#22791;&#29992;&#23481;&#37327;&#21644;&#30005;&#21147;&#20648;&#23384;&#30340;&#38656;&#27714;&#36890;&#24120;&#20173;&#28982;&#26377;&#38480;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#21457;&#29616;&#65292;&#22312;2&#33267;6&#23567;&#26102;&#30340;&#36739;&#23567;&#28909;&#23384;&#20648;&#23481;&#37327;&#19979;&#65292;&#31995;&#32479;&#30340;&#20379;&#38656;&#24179;&#34913;&#20173;&#28982;&#33021;&#22815;&#24471;&#21040;&#28385;&#36275;&#12290;
&lt;/p&gt;
&lt;p&gt;
Heat pumps are a key technology for reducing fossil fuel use in the heating sector. A transition to heat pumps implies an increase in electricity demand, especially in cold winter months. Using an open-source power sector model, we examine the power sector impacts of a massive expansion of decentralized heat pumps in Germany in 2030, combined with buffer heat storage of different sizes. Assuming that the additional electricity used by heat pumps has to be fully covered by renewable energies in a yearly balance, we quantify the required additional investments in renewable energy sources. If wind power expansion potentials are limited, the roll-out of heat pumps can also be accompanied by solar PV with little additional costs, making use of the European interconnection. The need for additional firm capacity and electricity storage generally remains limited even in the case of temporally inflexible heat pumps. We further find that relatively small heat storage capacities of 2 to 6 hours c
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#36890;&#36807;&#29983;&#21629;&#21608;&#26399;&#25104;&#26412;&#20998;&#26512;&#65292;&#30740;&#31350;&#20102;&#26234;&#33021;&#36947;&#36335;&#36793;&#32536;&#22522;&#30784;&#35774;&#26045;&#20256;&#24863;&#22120;&#23545;&#36830;&#36890;&#21644;&#33258;&#21160;&#39550;&#39542;&#30340;&#32463;&#27982;&#25928;&#30410;&#65292;&#19981;&#21516;&#29992;&#25143;&#38656;&#27714;&#21644;&#20256;&#24863;&#22120;&#25968;&#25454;&#36136;&#37327;&#12290;</title><link>http://arxiv.org/abs/2307.12893</link><description>&lt;p&gt;
&#26234;&#33021;&#36947;&#36335;&#36793;&#32536;&#22522;&#30784;&#35774;&#26045;&#20256;&#24863;&#22120;&#23545;&#36830;&#36890;&#21644;&#33258;&#21160;&#39550;&#39542;&#30340;&#32463;&#27982;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Economic Analysis of Smart Roadside Infrastructure Sensors for Connected and Automated Mobility. (arXiv:2307.12893v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.12893
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#36890;&#36807;&#29983;&#21629;&#21608;&#26399;&#25104;&#26412;&#20998;&#26512;&#65292;&#30740;&#31350;&#20102;&#26234;&#33021;&#36947;&#36335;&#36793;&#32536;&#22522;&#30784;&#35774;&#26045;&#20256;&#24863;&#22120;&#23545;&#36830;&#36890;&#21644;&#33258;&#21160;&#39550;&#39542;&#30340;&#32463;&#27982;&#25928;&#30410;&#65292;&#19981;&#21516;&#29992;&#25143;&#38656;&#27714;&#21644;&#20256;&#24863;&#22120;&#25968;&#25454;&#36136;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26234;&#33021;&#36947;&#36335;&#36793;&#32536;&#22522;&#30784;&#35774;&#26045;&#20256;&#24863;&#22120;&#20197;&#26234;&#33021;&#20132;&#36890;&#31995;&#32479;&#31449;&#65288;ITS-Ss&#65289;&#30340;&#24418;&#24335;&#22312;&#20840;&#29699;&#33539;&#22260;&#20869;&#36234;&#26469;&#36234;&#22810;&#22320;&#37096;&#32626;&#22312;&#30456;&#20851;&#20132;&#36890;&#33410;&#28857;&#19978;&#12290;&#23454;&#26102;&#25968;&#25454;&#65292;&#20294;&#26159;ITS-Ss&#30340;&#24314;&#31435;&#21644;&#36816;&#33829;&#25104;&#26412;&#38750;&#24120;&#39640;&#26114;&#12290;&#20256;&#24863;&#22120;&#25216;&#26415;&#30340;&#36873;&#25321;&#20063;&#23545;&#24635;&#20307;&#25104;&#26412;&#21644;&#25968;&#25454;&#36136;&#37327;&#20135;&#29983;&#24433;&#21709;&#12290;&#21040;&#30446;&#21069;&#20026;&#27490;&#65292;&#23545;&#20110;&#19981;&#21516;ITS-S &#25645;&#24314;&#30340;&#20855;&#20307;&#36153;&#29992;&#20102;&#35299;&#19981;&#36275;&#12290;&#26412;&#30740;&#31350;&#20351;&#29992;&#23551;&#21629;&#21608;&#26399;&#25104;&#26412;&#20998;&#26512;&#65288;LCCA&#65289;&#30740;&#31350;&#20102;&#22810;&#20010;&#27169;&#22359;&#21270;&#22522;&#30784;&#35774;&#26045;&#20256;&#24863;&#22120;&#35774;&#32622;&#12290;&#32467;&#21512;&#38745;&#24577;&#25104;&#26412;&#27169;&#22411;&#65292;&#36827;&#34892;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#20197;&#32771;&#34385;&#20854;&#32463;&#27982;&#25928;&#30410;&#65292;&#19981;&#21516;&#29992;&#25143;&#38656;&#27714;&#21644;&#20256;&#24863;&#22120;&#25968;&#25454;&#36136;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
Smart roadside infrastructure sensors in the form of intelligent transportation system stations (ITS-Ss) are increasingly deployed worldwide at relevant traffic nodes. The resulting digital twins of the real environment are suitable for developing and validating connected and automated driving functions and for increasing the operational safety of intelligent vehicles by providing ITS-S real-time data. However, ITS-Ss are very costly to establish and operate. The choice of sensor technology also has an impact on the overall costs as well as on the data quality. So far, there is only insufficient knowledge about the concrete expenses that arise with the construction of different ITS-S setups. Within this work, multiple modular infrastructure sensor setups are investigated with the help of a life cycle cost analysis (LCCA). Their economic efficiency, different user requirements and sensor data qualities are considered. Based on the static cost model, a Monte Carlo simulation is performed
&lt;/p&gt;</description></item><item><title>&#22810;&#32500;COS&#26041;&#27861;&#26159;&#19968;&#31181;&#29992;&#20110;&#23450;&#20215;&#20381;&#36182;&#20110;&#22810;&#20010;&#26631;&#30340;&#30340;&#37329;&#34701;&#26399;&#26435;&#30340;&#25968;&#20540;&#24037;&#20855;&#12290;&#26412;&#25991;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#25910;&#25947;&#24615;&#65292;&#24182;&#20998;&#26512;&#20102;&#25968;&#20540;&#19981;&#30830;&#23450;&#24230;&#23545;&#35813;&#26041;&#27861;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2307.12843</link><description>&lt;p&gt;
&#22810;&#32500;COS&#26041;&#27861;&#29992;&#20110;&#26399;&#26435;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
The multidimensional COS method for option pricing. (arXiv:2307.12843v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.12843
&lt;/p&gt;
&lt;p&gt;
&#22810;&#32500;COS&#26041;&#27861;&#26159;&#19968;&#31181;&#29992;&#20110;&#23450;&#20215;&#20381;&#36182;&#20110;&#22810;&#20010;&#26631;&#30340;&#30340;&#37329;&#34701;&#26399;&#26435;&#30340;&#25968;&#20540;&#24037;&#20855;&#12290;&#26412;&#25991;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#25910;&#25947;&#24615;&#65292;&#24182;&#20998;&#26512;&#20102;&#25968;&#20540;&#19981;&#30830;&#23450;&#24230;&#23545;&#35813;&#26041;&#27861;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#32500;COS&#26041;&#27861;&#26159;&#19968;&#31181;&#29992;&#20110;&#23450;&#20215;&#20381;&#36182;&#20110;&#22810;&#20010;&#26631;&#30340;&#30340;&#37329;&#34701;&#26399;&#26435;&#30340;&#25968;&#20540;&#24037;&#20855;&#12290;&#35813;&#26041;&#27861;&#21033;&#29992;&#26631;&#30340;&#30340;&#23545;&#25968;&#25910;&#30410;&#29575;&#30340;&#29305;&#24449;&#20989;&#25968;&#966;&#65292;&#24182;&#19988;&#24403;&#25903;&#20184;&#20989;&#25968;&#30340;&#20613;&#37324;&#21494;&#20313;&#24358;&#31995;&#25968;v_k&#20197;&#38381;&#24335;&#24418;&#24335;&#32473;&#23450;&#26102;&#65292;&#20855;&#26377;&#20248;&#21183;&#12290;&#28982;&#32780;&#65292;&#22312;&#37325;&#35201;&#24773;&#20917;&#19979;&#65292;&#966;&#21644;v_k&#37117;&#27809;&#26377;&#35299;&#26512;&#22320;&#32473;&#20986;&#65292;&#32780;&#38656;&#35201;&#36890;&#36807;&#25968;&#20540;&#26041;&#27861;&#24674;&#22797;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22810;&#32500;COS&#26041;&#27861;&#30340;&#25910;&#25947;&#24615;&#65292;&#21253;&#25324;&#23545;&#966;&#21644;v_k&#30340;&#25968;&#20540;&#19981;&#30830;&#23450;&#24230;&#30340;&#32771;&#34385;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#26377;&#21161;&#20110;&#29702;&#35299;COS&#26041;&#27861;&#20013;&#23545;&#966;&#21644;v_k&#30340;&#36817;&#20284;&#35823;&#24046;&#22914;&#20309;&#20256;&#25773;&#12290;
&lt;/p&gt;
&lt;p&gt;
The multidimensional COS method is a numerical tool to price financial options, which depend on several underlyings. The method makes use of the characteristic function $\varphi$ of the logarithmic returns of the underlyings and it is advantageous if the Fourier-cosine coefficients $v_{\boldsymbol{k}}$ of the payoff function are given in closed-form. However, in important cases, neither $\varphi$ nor $v_{\boldsymbol{k}}$ are given analytically but need to be recovered numerically. In this article, we prove the convergence of the multidimensional COS method including numerical uncertainty on $\varphi$ and $v_{\boldsymbol{k}}$. Our analysis helps to understand how the approximation errors on $\varphi$ and $v_{\boldsymbol{k}}$ propagate in the COS method.
&lt;/p&gt;</description></item><item><title>&#29983;&#25104;&#24335;AI&#33021;&#22815;&#20934;&#30830;&#39044;&#27979;&#20154;&#31867;&#22312;&#20915;&#31574;&#20013;&#24179;&#34913;&#33258;&#36523;&#21033;&#30410;&#19982;&#20182;&#20154;&#21033;&#30410;&#30340;&#34892;&#20026;&#27169;&#24335;&#65292;&#20294;&#23384;&#22312;&#39640;&#20272;&#20182;&#20154;&#20851;&#27880;&#34892;&#20026;&#30340;&#20542;&#21521;&#65292;&#36825;&#23545;AI&#30340;&#24320;&#21457;&#32773;&#21644;&#29992;&#25143;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;</title><link>http://arxiv.org/abs/2307.12776</link><description>&lt;p&gt;
&#39044;&#27979;&#20154;&#31867;&#22914;&#20309;&#22312;&#33258;&#36523;&#21033;&#30410;&#19982;&#20182;&#20154;&#21033;&#30410;&#20043;&#38388;&#24179;&#34913;&#30340;&#21487;&#39044;&#27979;&#24615;
&lt;/p&gt;
&lt;p&gt;
Predict-AI-bility of how humans balance self-interest with the interest of others. (arXiv:2307.12776v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.12776
&lt;/p&gt;
&lt;p&gt;
&#29983;&#25104;&#24335;AI&#33021;&#22815;&#20934;&#30830;&#39044;&#27979;&#20154;&#31867;&#22312;&#20915;&#31574;&#20013;&#24179;&#34913;&#33258;&#36523;&#21033;&#30410;&#19982;&#20182;&#20154;&#21033;&#30410;&#30340;&#34892;&#20026;&#27169;&#24335;&#65292;&#20294;&#23384;&#22312;&#39640;&#20272;&#20182;&#20154;&#20851;&#27880;&#34892;&#20026;&#30340;&#20542;&#21521;&#65292;&#36825;&#23545;AI&#30340;&#24320;&#21457;&#32773;&#21644;&#29992;&#25143;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#20855;&#26377;&#38761;&#21629;&#24615;&#30340;&#28508;&#21147;&#65292;&#21487;&#20197;&#25913;&#21464;&#20174;&#26085;&#24120;&#29983;&#27963;&#21040;&#39640;&#39118;&#38505;&#22330;&#26223;&#30340;&#20915;&#31574;&#36807;&#31243;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#35768;&#22810;&#20915;&#31574;&#20855;&#26377;&#31038;&#20250;&#24433;&#21709;&#65292;&#20026;&#20102;&#20351;AI&#33021;&#22815;&#25104;&#20026;&#21487;&#38752;&#30340;&#20915;&#31574;&#21161;&#25163;&#65292;&#23427;&#24517;&#39035;&#33021;&#22815;&#25429;&#25417;&#33258;&#36523;&#21033;&#30410;&#19982;&#20182;&#20154;&#21033;&#30410;&#20043;&#38388;&#30340;&#24179;&#34913;&#12290;&#25105;&#20204;&#23545;&#19977;&#31181;&#26368;&#20808;&#36827;&#30340;&#32842;&#22825;&#26426;&#22120;&#20154;&#23545;&#26469;&#33258;12&#20010;&#22269;&#23478;&#30340;78&#20010;&#23454;&#39564;&#30340;&#29420;&#35009;&#32773;&#28216;&#25103;&#20915;&#31574;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#21482;&#26377;GPT-4&#65288;&#32780;&#19981;&#26159;Bard&#25110;Bing&#65289;&#33021;&#22815;&#27491;&#30830;&#25429;&#25417;&#21040;&#34892;&#20026;&#27169;&#24335;&#30340;&#23450;&#24615;&#29305;&#24449;&#65292;&#35782;&#21035;&#20986;&#19977;&#31181;&#20027;&#35201;&#30340;&#34892;&#20026;&#31867;&#21035;&#65306;&#33258;&#31169;&#30340;&#12289;&#19981;&#20844;&#24179;&#21388;&#24694;&#30340;&#21644;&#23436;&#20840;&#26080;&#31169;&#30340;&#12290;&#28982;&#32780;&#65292;GPT-4&#19968;&#30452;&#39640;&#20272;&#20102;&#20182;&#20154;&#20851;&#27880;&#34892;&#20026;&#65292;&#22840;&#22823;&#20102;&#19981;&#20844;&#24179;&#21388;&#24694;&#21644;&#23436;&#20840;&#26080;&#31169;&#21442;&#19982;&#32773;&#30340;&#27604;&#20363;&#12290;&#36825;&#31181;&#20559;&#35265;&#23545;&#20110;AI&#24320;&#21457;&#20154;&#21592;&#21644;&#29992;&#25143;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
Generative artificial intelligence holds enormous potential to revolutionize decision-making processes, from everyday to high-stake scenarios. However, as many decisions carry social implications, for AI to be a reliable assistant for decision-making it is crucial that it is able to capture the balance between self-interest and the interest of others. We investigate the ability of three of the most advanced chatbots to predict dictator game decisions across 78 experiments with human participants from 12 countries. We find that only GPT-4 (not Bard nor Bing) correctly captures qualitative behavioral patterns, identifying three major classes of behavior: self-interested, inequity-averse, and fully altruistic. Nonetheless, GPT-4 consistently overestimates other-regarding behavior, inflating the proportion of inequity-averse and fully altruistic participants. This bias has significant implications for AI developers and users.
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#30740;&#31350;&#20102;&#30899;&#31246;&#22312;&#20449;&#36151;&#32452;&#21512;&#20013;&#30340;&#20256;&#25773;&#65292;&#36890;&#36807;&#32771;&#34385;&#23439;&#35266;&#32463;&#27982;&#22240;&#32032;&#65292;&#25551;&#36848;&#20102;&#30899;&#31246;&#23545;&#20844;&#21496;&#20215;&#20540;&#21644;&#20449;&#36151;&#39118;&#38505;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2307.12695</link><description>&lt;p&gt;
&#30899;&#31246;&#22312;&#20449;&#36151;&#32452;&#21512;&#20013;&#30340;&#20256;&#25773;&#36890;&#36807;&#23439;&#35266;&#32463;&#27982;&#22240;&#32032;
&lt;/p&gt;
&lt;p&gt;
Propagation of carbon tax in credit portfolio through macroeconomic factors. (arXiv:2307.12695v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.12695
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#30899;&#31246;&#22312;&#20449;&#36151;&#32452;&#21512;&#20013;&#30340;&#20256;&#25773;&#65292;&#36890;&#36807;&#32771;&#34385;&#23439;&#35266;&#32463;&#27982;&#22240;&#32032;&#65292;&#25551;&#36848;&#20102;&#30899;&#31246;&#23545;&#20844;&#21496;&#20215;&#20540;&#21644;&#20449;&#36151;&#39118;&#38505;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#30899;&#31246;&#22312;&#23553;&#38381;&#32463;&#27982;&#20013;&#22914;&#20309;&#22312;&#20449;&#36151;&#32452;&#21512;&#20013;&#20256;&#25773;&#65292;&#24182;&#20934;&#30830;&#25551;&#36848;&#20102;&#30899;&#31246;&#21160;&#24577;&#22914;&#20309;&#24433;&#21709;&#20844;&#21496;&#20215;&#20540;&#21644;&#20449;&#36151;&#39118;&#38505;&#24230;&#37327;&#12290;&#25105;&#20204;&#37319;&#29992;&#38543;&#26426;&#22810;&#37096;&#38376;&#27169;&#22411;&#26469;&#32771;&#34385;&#30899;&#31246;&#23545;&#37096;&#38376;&#20844;&#21496;&#29983;&#20135;&#21644;&#23478;&#24237;&#28040;&#36153;&#30340;&#24433;&#21709;&#12290;&#31246;&#25910;&#26681;&#25454;NGFS&#24773;&#26223;&#25552;&#20379;&#30340;&#30899;&#20215;&#26684;&#36827;&#34892;&#26657;&#20934;&#65292;&#20197;&#21450;&#37096;&#38376;&#23478;&#24237;&#28040;&#36153;&#21644;&#20844;&#21496;&#29983;&#20135;&#20197;&#21450;&#20854;&#30456;&#20851;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#12290;&#23545;&#20110;&#27599;&#20010;&#37096;&#38376;&#65292;&#36825;&#20135;&#29983;&#20102;&#20844;&#21496;&#29983;&#20135;&#21644;&#23478;&#24237;&#28040;&#36153;&#23545;&#30899;&#31246;&#30340;&#25935;&#24863;&#24230;&#20197;&#21450;&#37096;&#38376;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#20801;&#35768;&#25105;&#20204;&#20998;&#26512;&#30701;&#26399;&#30899;&#31246;&#30340;&#24433;&#21709;&#65292;&#19982;&#26631;&#20934;&#30340;&#25972;&#20307;&#35780;&#20272;&#27169;&#22411;&#30456;&#21453;&#65292;&#21518;&#32773;&#26082;&#26159;&#30830;&#23450;&#24615;&#30340;&#65292;&#21448;&#21482;&#33021;&#25429;&#25417;&#27668;&#20505;&#36807;&#28193;&#25919;&#31574;&#30340;&#38271;&#26399;&#36235;&#21183;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#20351;&#29992;&#25240;&#29616;&#29616;&#37329;&#27969;&#37327;&#27861;&#26469;&#35745;&#31639;&#20844;&#21496;&#30340;&#20215;&#20540;&#65292;&#28982;&#21518;&#29992;&#23427;&#26469;&#36827;&#34892;&#36164;&#20135;&#23450;&#20215;&#21644;&#20449;&#29992;&#39118;&#38505;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study how the introduction of carbon taxes in a closed economy propagate in a credit portfolio and precisely describe how carbon taxes dynamics affect the firm value and credit risk measures. We adapt a stochastic multisectoral model to take into account carbon taxes on both sectoral firms' production and household's consumption. Taxes are calibrated on carbon prices, provided by the NGFS scenarios, as well as on sectoral households' consumption and firms' production, together with their related greenhouse gases emissions. For each sector, this yields the sensitivity of firms' production and households' consumption to carbon taxes and the relationships between sectors. Our model allows us to analyze the short-term effects of carbon taxes as opposed to standard Integrated Assessment Models, which are not only deterministic but also only capture long-term trends of climate transition policy. Finally, we use a Discounted Cash Flows methodology to compute firms' values which we then use
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#32508;&#36848;&#20102;&#20113;&#25104;&#26412;&#20248;&#21270;&#30340;&#21508;&#31181;&#25216;&#26415;&#21644;&#26696;&#20363;&#30740;&#31350;&#65292;&#26174;&#31034;&#32452;&#32455;&#36890;&#36807;&#37319;&#29992;&#36825;&#20123;&#25216;&#26415;&#21487;&#20197;&#23454;&#29616;&#26174;&#33879;&#30340;&#25104;&#26412;&#33410;&#32422;&#12290;</title><link>http://arxiv.org/abs/2307.12479</link><description>&lt;p&gt;
&#20113;&#25104;&#26412;&#20248;&#21270;&#65306;&#31574;&#30053;&#21644;&#26696;&#20363;&#30740;&#31350;&#30340;&#20840;&#38754;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
Cloud Cost Optimization: A Comprehensive Review of Strategies and Case Studies. (arXiv:2307.12479v1 [cs.DC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.12479
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32508;&#36848;&#20102;&#20113;&#25104;&#26412;&#20248;&#21270;&#30340;&#21508;&#31181;&#25216;&#26415;&#21644;&#26696;&#20363;&#30740;&#31350;&#65292;&#26174;&#31034;&#32452;&#32455;&#36890;&#36807;&#37319;&#29992;&#36825;&#20123;&#25216;&#26415;&#21487;&#20197;&#23454;&#29616;&#26174;&#33879;&#30340;&#25104;&#26412;&#33410;&#32422;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20113;&#35745;&#31639;&#24050;&#32463;&#24443;&#24213;&#25913;&#21464;&#20102;&#32452;&#32455;&#31649;&#29702;&#20854;IT&#22522;&#30784;&#35774;&#26045;&#30340;&#26041;&#24335;&#65292;&#20294;&#20063;&#24102;&#26469;&#20102;&#26032;&#30340;&#25361;&#25112;&#65292;&#27604;&#22914;&#31649;&#29702;&#20113;&#25104;&#26412;&#12290;&#26412;&#25991;&#25506;&#35752;&#20102;&#20113;&#25104;&#26412;&#20248;&#21270;&#30340;&#21508;&#31181;&#25216;&#26415;&#65292;&#21253;&#25324;&#20113;&#23450;&#20215;&#12289;&#20998;&#26512;&#20197;&#21450;&#36164;&#28304;&#20998;&#37197;&#30340;&#31574;&#30053;&#12290;&#36824;&#25552;&#20379;&#20102;&#36825;&#20123;&#25216;&#26415;&#30340;&#23454;&#38469;&#26696;&#20363;&#30740;&#31350;&#65292;&#24182;&#23545;&#20854;&#26377;&#25928;&#24615;&#21644;&#35201;&#28857;&#36827;&#34892;&#20102;&#35752;&#35770;&#12290;&#26412;&#25991;&#30340;&#20998;&#26512;&#34920;&#26126;&#65292;&#37319;&#29992;&#20113;&#25104;&#26412;&#20248;&#21270;&#25216;&#26415;&#21487;&#20197;&#20351;&#32452;&#32455;&#23454;&#29616;&#26174;&#33879;&#30340;&#25104;&#26412;&#33410;&#32422;&#12290;&#27492;&#22806;&#65292;&#36824;&#25552;&#20986;&#20102;&#26410;&#26469;&#30740;&#31350;&#26041;&#21521;&#65292;&#20197;&#25512;&#21160;&#36825;&#19968;&#37325;&#35201;&#39046;&#22495;&#30340;&#21457;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;
Cloud computing has revolutionized the way organizations manage their IT infrastructure, but it has also introduced new challenges, such as managing cloud costs. This paper explores various techniques for cloud cost optimization, including cloud pricing, analysis, and strategies for resource allocation. Real-world case studies of these techniques are presented, along with a discussion of their effectiveness and key takeaways. The analysis conducted in this paper reveals that organizations can achieve significant cost savings by adopting cloud cost optimization techniques. Additionally, future research directions are proposed to advance the state of the art in this important field.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#27874;&#20848;&#30899;&#26519;&#20013;&#20351;&#29992;&#27694;&#32933;&#20316;&#20026;&#30899;&#22266;&#23450;&#24037;&#20855;&#30340;&#24494;&#35266;&#32463;&#27982;&#23398;&#25928;&#24212;&#12290;&#21457;&#29616;&#26089;&#26399;&#26045;&#32933;&#21644;&#31532;&#20108;&#27425;&#38388;&#20240;&#21518;&#26045;&#32933;&#20250;&#32553;&#30701;&#36718;&#25442;&#26399;&#24182;&#20943;&#23569;&#26408;&#26448;&#21644;&#30899;&#20648;&#23384;&#65292;&#32780;&#22312;&#26519;&#22320;&#25104;&#29087;&#21069;&#21313;&#24180;&#26045;&#32933;&#21487;&#20197;&#22686;&#21152;&#26408;&#26448;&#24211;&#23384;&#65292;&#25104;&#29087;&#26519;&#22320;&#26045;&#32933;&#21487;&#20197;&#22686;&#21152;&#30899;&#24211;&#23384;&#12290;&#26045;&#32933;&#21487;&#20197;&#22686;&#21152;&#30408;&#21033;&#33021;&#21147;&#65292;&#32780;&#19981;&#20165;&#20165;&#26159;&#24310;&#38271;&#36718;&#25442;&#26399;&#12290;</title><link>http://arxiv.org/abs/2307.12362</link><description>&lt;p&gt;
&#27874;&#20848;&#30899;&#26519;&#20013;&#30340;&#27694;&#32933;&#24494;&#35266;&#32463;&#27982;&#23398;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Microeconomics of nitrogen fertilization in boreal carbon forestry. (arXiv:2307.12362v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.12362
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#27874;&#20848;&#30899;&#26519;&#20013;&#20351;&#29992;&#27694;&#32933;&#20316;&#20026;&#30899;&#22266;&#23450;&#24037;&#20855;&#30340;&#24494;&#35266;&#32463;&#27982;&#23398;&#25928;&#24212;&#12290;&#21457;&#29616;&#26089;&#26399;&#26045;&#32933;&#21644;&#31532;&#20108;&#27425;&#38388;&#20240;&#21518;&#26045;&#32933;&#20250;&#32553;&#30701;&#36718;&#25442;&#26399;&#24182;&#20943;&#23569;&#26408;&#26448;&#21644;&#30899;&#20648;&#23384;&#65292;&#32780;&#22312;&#26519;&#22320;&#25104;&#29087;&#21069;&#21313;&#24180;&#26045;&#32933;&#21487;&#20197;&#22686;&#21152;&#26408;&#26448;&#24211;&#23384;&#65292;&#25104;&#29087;&#26519;&#22320;&#26045;&#32933;&#21487;&#20197;&#22686;&#21152;&#30899;&#24211;&#23384;&#12290;&#26045;&#32933;&#21487;&#20197;&#22686;&#21152;&#30408;&#21033;&#33021;&#21147;&#65292;&#32780;&#19981;&#20165;&#20165;&#26159;&#24310;&#38271;&#36718;&#25442;&#26399;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20197;&#24494;&#35266;&#32463;&#27982;&#23398;&#30340;&#35282;&#24230;&#30740;&#31350;&#20102;&#22312;&#27874;&#20848;&#26862;&#26519;&#20013;&#20351;&#29992;&#27694;&#32933;&#20316;&#20026;&#30899;&#22266;&#23450;&#24037;&#20855;&#12290;&#36890;&#36807;&#22522;&#20110;&#24211;&#23384;&#30340;&#29983;&#38271;&#27169;&#22411;&#65292;&#22312;&#19968;&#32452;&#21322;&#32933;&#27779;&#12289;&#20197;&#20113;&#26441;&#20026;&#20027;&#30340;&#27874;&#20848;&#26519;&#22320;&#20013;&#65292;&#30740;&#31350;&#20102;&#27694;&#32933;&#26045;&#29992;&#26102;&#38388;&#23545;&#36164;&#26412;&#22238;&#25253;&#29575;&#21644;&#39044;&#26399;&#30340;&#26408;&#26448;&#24211;&#23384;&#20215;&#20540;&#30340;&#24433;&#21709;&#12290;&#26089;&#26399;&#26045;&#32933;&#20542;&#21521;&#20110;&#32553;&#30701;&#36718;&#25442;&#26399;&#65292;&#20943;&#23569;&#26408;&#26448;&#24211;&#23384;&#21644;&#30899;&#20648;&#23384;&#12290;&#23545;&#31532;&#20108;&#27425;&#38388;&#20240;&#21518;&#26045;&#32933;&#20063;&#21516;&#26679;&#36866;&#29992;&#12290;&#22312;&#26519;&#22320;&#25104;&#29087;&#21069;&#21313;&#24180;&#26045;&#32933;&#26159;&#26377;&#21033;&#21487;&#22270;&#30340;&#65292;&#33021;&#22686;&#21152;&#26408;&#26448;&#24211;&#23384;&#65292;&#20294;&#21518;&#32773;&#25928;&#26524;&#36739;&#23567;&#12290;&#23545;&#25104;&#29087;&#26519;&#22320;&#26045;&#32933;&#65292;&#23558;&#36718;&#25442;&#26399;&#24310;&#38271;&#21313;&#24180;&#65292;&#33021;&#26377;&#25928;&#22686;&#21152;&#30899;&#24211;&#23384;&#12290;&#30408;&#21033;&#33021;&#21147;&#26377;&#25152;&#24046;&#24322;&#65292;&#20294;&#26045;&#32933;&#21487;&#20197;&#22686;&#21152;&#30408;&#21033;&#33021;&#21147;&#65292;&#32780;&#19981;&#20165;&#20165;&#26159;&#24310;&#38271;&#36718;&#25442;&#26399;&#12290;
&lt;/p&gt;
&lt;p&gt;
Nitrogen fertilization of boreal forests is investigated in terms of microeconomics, as a tool for carbon sequestration. The effects of nitrogen fertilization's timing on the return rate on capital and the expected value of the timber stock are investigated within a set of semi-fertile, spruce-dominated boreal stands, using an inventory-based growth model. Early fertilization tends to shorten rotations, reducing timber stock and carbon storage. The same applies to fertilization after the second thinning. Fertilization applied ten years before stand maturity is profitable and increases the timber stock, but the latter effect is small. Fertilization of mature stands, extending any rotation by ten years, effectively increases the carbon stock. Profitability varies but is increased by fertilization, instead of merely extending the rotation.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#39044;&#26399;&#22810;&#20803;&#25928;&#29992;&#20998;&#26512;&#26041;&#27861;&#65292;&#20801;&#35768;ESG&#25237;&#36164;&#32773;&#26681;&#25454;&#39118;&#38505;&#35268;&#36991;&#27700;&#24179;&#36866;&#24212;&#20854;&#23545;&#32511;&#33394;&#25237;&#36164;&#30340;&#20559;&#22909;&#65292;&#24182;&#25214;&#21040;&#20102;&#26368;&#20248;&#37197;&#32622;&#21644;&#20215;&#20540;&#20989;&#25968;&#30340;&#35299;&#12290;&#23454;&#35777;&#20998;&#26512;&#34920;&#26126;&#65292;ESG&#25935;&#24863;&#30340;&#25237;&#36164;&#32773;&#22312;&#36873;&#25321;&#39640;&#35780;&#32423;ESG&#32929;&#31080;&#26102;&#36130;&#23500;&#37197;&#32622;&#26174;&#33879;&#22686;&#21152;&#12290;</title><link>http://arxiv.org/abs/2307.12161</link><description>&lt;p&gt;
&#25581;&#31034;&#21487;&#25345;&#32493;&#21457;&#23637;&#19982;&#22238;&#25253;&#20043;&#38388;&#30340;&#26435;&#34913;&#65306;&#19968;&#31181;&#22810;&#20803;&#25928;&#29992;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Unraveling the Trade-off between Sustainability and Returns: A Multivariate Utility Analysis. (arXiv:2307.12161v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.12161
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#39044;&#26399;&#22810;&#20803;&#25928;&#29992;&#20998;&#26512;&#26041;&#27861;&#65292;&#20801;&#35768;ESG&#25237;&#36164;&#32773;&#26681;&#25454;&#39118;&#38505;&#35268;&#36991;&#27700;&#24179;&#36866;&#24212;&#20854;&#23545;&#32511;&#33394;&#25237;&#36164;&#30340;&#20559;&#22909;&#65292;&#24182;&#25214;&#21040;&#20102;&#26368;&#20248;&#37197;&#32622;&#21644;&#20215;&#20540;&#20989;&#25968;&#30340;&#35299;&#12290;&#23454;&#35777;&#20998;&#26512;&#34920;&#26126;&#65292;ESG&#25935;&#24863;&#30340;&#25237;&#36164;&#32773;&#22312;&#36873;&#25321;&#39640;&#35780;&#32423;ESG&#32929;&#31080;&#26102;&#36130;&#23500;&#37197;&#32622;&#26174;&#33879;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;ESG&#25237;&#36164;&#32773;&#30340;&#39044;&#26399;&#22810;&#20803;&#25928;&#29992;&#20998;&#26512;&#65292;&#20854;&#20013;&#23558;&#32511;&#33394;&#32929;&#31080;&#12289;&#35088;&#33394;&#32929;&#31080;&#21644;&#24066;&#22330;&#25351;&#25968;&#24314;&#27169;&#20026;&#21333;&#22240;&#32032;&#30340;CAPM&#32467;&#26500;&#12290;&#35813;&#27169;&#22411;&#20801;&#35768;&#25237;&#36164;&#32773;&#26681;&#25454;&#36866;&#24403;&#30340;&#39118;&#38505;&#35268;&#36991;&#27700;&#24179;&#36866;&#24212;&#20854;&#23545;&#32511;&#33394;&#25237;&#36164;&#30340;&#20559;&#22909;&#12290;&#25105;&#20204;&#25214;&#21040;&#20102;&#26368;&#20248;&#37197;&#32622;&#12289;&#36130;&#23500;&#21644;&#20215;&#20540;&#20989;&#25968;&#30340;&#23553;&#38381;&#35299;&#12290;&#20316;&#20026;&#21103;&#20135;&#21697;&#65292;&#25105;&#20204;&#39318;&#20808;&#35777;&#26126;&#25237;&#36164;&#32773;&#19981;&#38656;&#35201;&#20943;&#23569;&#32463;&#27982;&#28385;&#24847;&#24230;&#20197;&#22686;&#21152;&#32511;&#33394;&#25237;&#36164;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21442;&#25968;&#21270;&#26041;&#27861;&#26469;&#25429;&#25417;&#25237;&#36164;&#32773;&#23545;&#32511;&#33394;&#36164;&#20135;&#30340;&#20559;&#22909;&#65292;&#19982;&#32489;&#25928;&#26080;&#20851;&#12290;&#26412;&#25991;&#20351;&#29992;2010&#24180;&#33267;2020&#24180;&#32654;&#22269;&#32929;&#31080;&#30340;RepRisk&#35780;&#32423;&#26469;&#36873;&#25321;&#20195;&#34920;&#21508;&#31181;ESG&#35780;&#32423;&#30340;&#20844;&#21496;&#12290;&#25105;&#20204;&#30340;&#23454;&#35777;&#20998;&#26512;&#26174;&#31034;&#65292;&#23545;&#20110;ESG&#25935;&#24863;&#30340;&#25237;&#36164;&#32773;&#65292;&#21521;&#39640;&#35780;&#32423;ESG&#32929;&#31080;&#30340;&#36130;&#23500;&#37197;&#32622;&#20986;&#29616;&#20102;&#24613;&#21095;&#22686;&#21152;&#65307;&#21363;&#20351;&#22312;&#32463;&#27982;&#28385;&#24847;&#24230;&#24635;&#20307;&#27700;&#24179;&#38477;&#20302;&#30340;&#24773;&#20917;&#19979;&#65292;&#36825;&#19968;&#36235;&#21183;&#20173;&#28982;&#25345;&#32493;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes an expected multivariate utility analysis for ESG investors in which green stocks, brown stocks, and a market index are modeled in a one-factor, CAPM-type structure. This setting allows investors to accommodate their preferences for green investments according to proper risk aversion levels. We find closed-form solutions for optimal allocations, wealth and value functions. As by-products, we first demonstrate that investors do not need to reduce their pecuniary satisfaction in order to increase green investments. Secondly, we propose a parameterization to capture investors' preferences for green assets over brown or market assets, independent of performance. The paper uses the RepRisk Rating of U.S. stocks from 2010 to 2020 to select companies that are representative of various ESG ratings. Our empirical analysis reveals drastic increases in wealth allocation toward high-rated ESG stocks for ESG-sensitive investors; this holds even as the overall level of pecuniary 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#23558;&#21453;&#20107;&#23454;&#36951;&#25022;&#26368;&#23567;&#21270;&#31639;&#27861;&#24212;&#29992;&#20110;&#20004;&#20154;&#40635;&#23558;&#65292;&#24182;&#36890;&#36807;&#20998;&#23618;&#31574;&#30053;&#25277;&#35937;&#23454;&#29616;&#20102;&#28216;&#25103;&#35770;&#20998;&#26512;&#65292;&#35813;&#26694;&#26550;&#21487;&#25512;&#24191;&#21040;&#20854;&#20182;&#19981;&#23436;&#20840;&#20449;&#24687;&#28216;&#25103;&#12290;</title><link>http://arxiv.org/abs/2307.12087</link><description>&lt;p&gt;
CFR-p: &#24102;&#26377;&#20998;&#23618;&#31574;&#30053;&#25277;&#35937;&#30340;&#21453;&#20107;&#23454;&#36951;&#25022;&#26368;&#23567;&#21270;&#31639;&#27861;&#21450;&#20854;&#22312;&#20004;&#20154;&#40635;&#23558;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
CFR-p: Counterfactual Regret Minimization with Hierarchical Policy Abstraction, and its Application to Two-player Mahjong. (arXiv:2307.12087v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.12087
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23558;&#21453;&#20107;&#23454;&#36951;&#25022;&#26368;&#23567;&#21270;&#31639;&#27861;&#24212;&#29992;&#20110;&#20004;&#20154;&#40635;&#23558;&#65292;&#24182;&#36890;&#36807;&#20998;&#23618;&#31574;&#30053;&#25277;&#35937;&#23454;&#29616;&#20102;&#28216;&#25103;&#35770;&#20998;&#26512;&#65292;&#35813;&#26694;&#26550;&#21487;&#25512;&#24191;&#21040;&#20854;&#20182;&#19981;&#23436;&#20840;&#20449;&#24687;&#28216;&#25103;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21453;&#20107;&#23454;&#36951;&#25022;&#26368;&#23567;&#21270;(CFR)&#31639;&#27861;&#22312;&#24503;&#24030;&#25169;&#20811;&#20013;&#21462;&#24471;&#20102;&#25104;&#21151;&#12290;&#25105;&#20204;&#23558;&#35813;&#31639;&#27861;&#24212;&#29992;&#20110;&#21478;&#19968;&#31181;&#27969;&#34892;&#30340;&#19981;&#23436;&#20840;&#20449;&#24687;&#28216;&#25103;&#65292;&#40635;&#23558;&#12290;&#19982;&#25169;&#20811;&#28216;&#25103;&#30456;&#27604;&#65292;&#40635;&#23558;&#26356;&#21152;&#22797;&#26434;&#65292;&#26377;&#35768;&#22810;&#21464;&#20307;&#12290;&#25105;&#20204;&#36890;&#36807;&#36827;&#34892;&#21338;&#24328;&#35770;&#20998;&#26512;&#24182;&#22522;&#20110;&#33719;&#32988;&#31574;&#30053;&#23545;CFR&#36827;&#34892;&#20998;&#23618;&#25277;&#35937;&#65292;&#30740;&#31350;&#20102;&#20004;&#20154;&#40635;&#23558;&#12290;&#36825;&#20010;&#26694;&#26550;&#21487;&#20197;&#25512;&#24191;&#21040;&#20854;&#20182;&#19981;&#23436;&#20840;&#20449;&#24687;&#28216;&#25103;&#12290;
&lt;/p&gt;
&lt;p&gt;
Counterfactual Regret Minimization(CFR) has shown its success in Texas Hold'em poker. We apply this algorithm to another popular incomplete information game, Mahjong. Compared to the poker game, Mahjong is much more complex with many variants. We study two-player Mahjong by conducting game theoretical analysis and making a hierarchical abstraction to CFR based on winning policies. This framework can be generalized to other imperfect information games.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#30340;&#31163;&#25955;&#26102;&#38388;&#26368;&#20248;&#25237;&#36164;&#38382;&#39064;&#65292;&#21033;&#29992;&#21407;&#22987;&#26041;&#27861;&#35777;&#26126;&#20102;&#23384;&#22312;&#19968;&#20010;&#26368;&#20248;&#25237;&#36164;&#31574;&#30053;&#65292;&#24182;&#24341;&#20837;&#20102;&#31867;&#22411;(A)&#30340;&#25928;&#29992;&#20989;&#25968;&#12290;</title><link>http://arxiv.org/abs/2307.11919</link><description>&lt;p&gt;
&#22312;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#30340;&#31163;&#25955;&#26102;&#38388;&#26368;&#20248;&#25237;&#36164;
&lt;/p&gt;
&lt;p&gt;
Discrete time optimal investment under model uncertainty. (arXiv:2307.11919v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.11919
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#30340;&#31163;&#25955;&#26102;&#38388;&#26368;&#20248;&#25237;&#36164;&#38382;&#39064;&#65292;&#21033;&#29992;&#21407;&#22987;&#26041;&#27861;&#35777;&#26126;&#20102;&#23384;&#22312;&#19968;&#20010;&#26368;&#20248;&#25237;&#36164;&#31574;&#30053;&#65292;&#24182;&#24341;&#20837;&#20102;&#31867;&#22411;(A)&#30340;&#25928;&#29992;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#22312;&#19968;&#33324;&#31163;&#25955;&#26102;&#38388;&#26080;&#25705;&#25830;&#24066;&#22330;&#20013;&#30340;&#40065;&#26834;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#65292;&#20854;&#20013;&#20551;&#35774;&#25237;&#36164;&#32773;&#23545;&#25972;&#20010;&#23454;&#25968;&#32447;&#19978;&#30340;&#38543;&#26426;&#20985;&#25928;&#29992;&#20989;&#25968;&#36827;&#34892;&#23450;&#20041;&#12290;&#22905;&#36824;&#38754;&#20020;&#23545;&#24066;&#22330;&#30340;&#20449;&#24565;&#30340;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#65292;&#35813;&#19981;&#30830;&#23450;&#24615;&#36890;&#36807;&#19968;&#32452;&#20808;&#39564;&#27169;&#22411;&#36827;&#34892;&#24314;&#27169;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#20351;&#29992;&#21407;&#22987;&#26041;&#27861;&#20165;&#38656;&#35201;&#23384;&#22312;&#19968;&#20010;&#26368;&#20248;&#25237;&#36164;&#31574;&#30053;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#20551;&#35774;&#24066;&#22330;&#21644;&#38543;&#26426;&#25928;&#29992;&#20989;&#25968;&#20855;&#26377;&#32463;&#20856;&#20551;&#35774;&#65292;&#20855;&#26377;&#28176;&#36827;&#24377;&#24615;&#32422;&#26463;&#12290;&#25105;&#20204;&#30340;&#20854;&#20182;&#22823;&#22810;&#25968;&#20551;&#35774;&#26159;&#22522;&#20110;&#36880;&#21069;&#20551;&#35774;&#30340;&#65292;&#24182;&#23545;&#24066;&#22330;&#26080;&#19981;&#30830;&#23450;&#24615;&#30340;&#25991;&#29486;&#20013;&#30340;&#26222;&#36941;&#25509;&#21463;&#20551;&#35774;&#30456;&#23545;&#24212;&#12290;&#25105;&#20204;&#36824;&#24341;&#20837;&#20102;&#31867;&#22411;(A)&#30340;&#25928;&#29992;&#20989;&#25968;&#65292;&#20854;&#21253;&#25324;&#20855;&#26377;&#22522;&#20934;&#30340;&#25928;&#29992;&#20989;&#25968;&#65292;&#25105;&#20204;&#30340;&#20551;&#35774;&#24456;&#23481;&#26131;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a robust utility maximization problem in a general discrete-time frictionless market under quasi-sure no-arbitrage. The investor is assumed to have a random and concave utility function defined on the whole real-line. She also faces model ambiguity on her beliefs about the market, which is modeled through a set of priors. We prove the existence of an optimal investment strategy using only primal methods. For that we assume classical assumptions on the market and on the random utility function as asymptotic elasticity constraints. Most of our other assumptions are stated on a prior-by-prior basis and correspond to generally accepted assumptions in the literature on markets without ambiguity. We also introduce utility functions of type (A), which include utility functions with benchmark and for which our assumptions are easily checked.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#31038;&#20132;&#21644;&#20010;&#20307;&#23398;&#20064;&#22312;&#37329;&#34701;&#24066;&#22330;&#27169;&#22411;&#20013;&#30340;&#20316;&#29992;&#65292;&#21457;&#29616;&#31038;&#20132;&#23398;&#20064;&#20250;&#21066;&#24369;&#24066;&#22330;&#25928;&#29575;&#65292;&#32780;&#20010;&#20307;&#23398;&#20064;&#21017;&#21487;&#20197;&#25327;&#25937;&#20174;&#31038;&#20132;&#23398;&#20064;&#20013;&#38519;&#20837;&#20302;&#25928;&#29366;&#24577;&#30340;&#20154;&#32676;&#12290;</title><link>http://arxiv.org/abs/2307.11846</link><description>&lt;p&gt;
&#8220;&#23569;&#25968;&#27966;&#28216;&#25103;&#20013;&#30340;&#31038;&#20250;&#21644;&#20010;&#20307;&#23398;&#20064;&#8221;
&lt;/p&gt;
&lt;p&gt;
Social and individual learning in the Minority Game. (arXiv:2307.11846v1 [physics.soc-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.11846
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#31038;&#20132;&#21644;&#20010;&#20307;&#23398;&#20064;&#22312;&#37329;&#34701;&#24066;&#22330;&#27169;&#22411;&#20013;&#30340;&#20316;&#29992;&#65292;&#21457;&#29616;&#31038;&#20132;&#23398;&#20064;&#20250;&#21066;&#24369;&#24066;&#22330;&#25928;&#29575;&#65292;&#32780;&#20010;&#20307;&#23398;&#20064;&#21017;&#21487;&#20197;&#25327;&#25937;&#20174;&#31038;&#20132;&#23398;&#20064;&#20013;&#38519;&#20837;&#20302;&#25928;&#29366;&#24577;&#30340;&#20154;&#32676;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31038;&#20132;&#21644;&#20010;&#20307;&#23398;&#20064;&#22312;&#37329;&#34701;&#24066;&#22330;&#27169;&#22411;&#8212;&#8212;&#23569;&#25968;&#27966;&#28216;&#25103;&#20013;&#30340;&#20316;&#29992;&#12290;&#31038;&#20132;&#23398;&#20064;&#26159;&#25351;&#20195;&#29702;&#20154;&#37319;&#32435;&#20854;&#31038;&#20132;&#32593;&#32476;&#20013;&#37051;&#23621;&#30340;&#31574;&#30053;&#65292;&#32780;&#20010;&#20307;&#23398;&#20064;&#21017;&#26159;&#25351;&#20195;&#29702;&#20154;&#22312;&#27809;&#26377;&#20854;&#20182;&#20195;&#29702;&#20154;&#30340;&#21442;&#19982;&#19979;&#25913;&#21464;&#31574;&#30053;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#31038;&#20132;&#23398;&#20064;&#22914;&#20309;&#36890;&#36807;&#36127;&#39057;&#29575;&#20381;&#36182;&#36873;&#25321;&#21644;&#31574;&#30053;&#22810;&#26679;&#24615;&#30340;&#20007;&#22833;&#26469;&#21066;&#24369;&#24066;&#22330;&#30340;&#25928;&#29575;&#12290;&#21518;&#32773;&#21487;&#20197;&#23558;&#20154;&#32676;&#22256;&#22312;&#19968;&#31181;&#26497;&#20302;&#25928;&#30340;&#29366;&#24577;&#20013;&#12290;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#20010;&#20307;&#23398;&#20064;&#22914;&#20309;&#20174;&#36825;&#20123;&#20302;&#25928;&#20013;&#25327;&#25937;&#31038;&#20132;&#23398;&#20064;&#20013;&#30340;&#20154;&#32676;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the roles of social and individual learning on outcomes of the Minority Game model of a financial market. Social learning occurs via agents adopting the strategies of their neighbours within a social network, while individual learning results in agents changing their strategies without input from other agents. In particular, we show how social learning can undermine efficiency of the market due to negative frequency dependent selection and loss of strategy diversity. The latter of which can lock the population into a maximally inefficient state. We show how individual learning can rescue a population engaged in social learning from such inefficiencies.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#32858;&#28966;&#20110;&#24212;&#23545;&#37329;&#34701;&#31185;&#25216;&#31454;&#20105;&#21644;&#25552;&#39640;&#38134;&#34892;&#19994;&#21153;&#36816;&#33829;&#25928;&#29575;&#30340;&#38656;&#27714;&#65292;&#36890;&#36807;&#22810;&#27169;&#24335;&#27169;&#22411;&#29305;&#21035;&#26159;&#20808;&#36827;&#30340;&#25991;&#26723;&#20998;&#26512;&#25216;&#26415;&#65292;&#30740;&#31350;&#20102;&#38134;&#34892;&#27969;&#31243;&#20013;&#30340;&#28508;&#21147;&#21644;&#26426;&#20250;&#65292;&#24182;&#23637;&#31034;&#20102;LayoutXLM&#31561;&#27169;&#22411;&#22312;&#20998;&#26512;&#38134;&#34892;&#25991;&#26723;&#20013;&#30340;&#28508;&#21147;&#21644;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2307.11845</link><description>&lt;p&gt;
&#38754;&#21521;&#38134;&#34892;&#27969;&#31243;&#33258;&#21160;&#21270;&#30340;&#22810;&#27169;&#24335;&#25991;&#26723;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Multimodal Document Analytics for Banking Process Automation. (arXiv:2307.11845v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.11845
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32858;&#28966;&#20110;&#24212;&#23545;&#37329;&#34701;&#31185;&#25216;&#31454;&#20105;&#21644;&#25552;&#39640;&#38134;&#34892;&#19994;&#21153;&#36816;&#33829;&#25928;&#29575;&#30340;&#38656;&#27714;&#65292;&#36890;&#36807;&#22810;&#27169;&#24335;&#27169;&#22411;&#29305;&#21035;&#26159;&#20808;&#36827;&#30340;&#25991;&#26723;&#20998;&#26512;&#25216;&#26415;&#65292;&#30740;&#31350;&#20102;&#38134;&#34892;&#27969;&#31243;&#20013;&#30340;&#28508;&#21147;&#21644;&#26426;&#20250;&#65292;&#24182;&#23637;&#31034;&#20102;LayoutXLM&#31561;&#27169;&#22411;&#22312;&#20998;&#26512;&#38134;&#34892;&#25991;&#26723;&#20013;&#30340;&#28508;&#21147;&#21644;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38024;&#23545;&#37329;&#34701;&#31185;&#25216;&#31454;&#20105;&#30340;&#22686;&#38271;&#21644;&#25552;&#39640;&#36816;&#33829;&#25928;&#29575;&#30340;&#38656;&#27714;&#65292;&#26412;&#30740;&#31350;&#20851;&#27880;&#20110;&#29702;&#35299;&#22312;&#38134;&#34892;&#27969;&#31243;&#20013;&#21033;&#29992;&#22810;&#27169;&#24335;&#27169;&#22411;&#29305;&#21035;&#26159;&#20808;&#36827;&#30340;&#25991;&#26723;&#20998;&#26512;&#30340;&#28508;&#21147;&#12290;&#25105;&#20204;&#23545;&#22810;&#26679;&#21270;&#30340;&#38134;&#34892;&#25991;&#26723;&#39046;&#22495;&#36827;&#34892;&#20102;&#20840;&#38754;&#20998;&#26512;&#65292;&#31361;&#20986;&#20102;&#36890;&#36807;&#33258;&#21160;&#21270;&#21644;&#20808;&#36827;&#30340;&#20998;&#26512;&#25216;&#26415;&#22312;&#23458;&#25143;&#19994;&#21153;&#20013;&#25552;&#39640;&#25928;&#29575;&#30340;&#26426;&#20250;&#12290;&#22522;&#20110;&#24555;&#36895;&#21457;&#23637;&#30340;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#65288;NLP&#65289;&#39046;&#22495;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#35832;&#22914;LayoutXLM&#36825;&#26679;&#30340;&#27169;&#22411;&#30340;&#28508;&#21147;&#65292;&#23427;&#26159;&#19968;&#31181;&#36328;&#35821;&#35328;&#12289;&#22810;&#27169;&#24335;&#12289;&#39044;&#35757;&#32451;&#27169;&#22411;&#65292;&#29992;&#20110;&#20998;&#26512;&#38134;&#34892;&#19994;&#20013;&#21508;&#31181;&#19981;&#21516;&#30340;&#25991;&#26723;&#12290;&#35813;&#27169;&#22411;&#23545;&#24503;&#22269;&#20844;&#21496;&#30331;&#35760;&#25552;&#21462;&#30340;&#25991;&#26412;&#26631;&#35760;&#20998;&#31867;&#20855;&#26377;&#22823;&#32422;80%&#30340;F1&#24471;&#20998;&#24615;&#33021;&#12290;&#25105;&#20204;&#30340;&#23454;&#35777;&#35777;&#25454;&#35777;&#23454;&#20102;&#24067;&#23616;&#20449;&#24687;&#22312;&#25552;&#39640;&#27169;&#22411;&#24615;&#33021;&#26041;&#38754;&#30340;&#20851;&#38190;&#20316;&#29992;&#65292;&#24182;&#36827;&#19968;&#27493;&#24378;&#35843;&#20102;&#25972;&#21512;&#22270;&#20687;&#20449;&#24687;&#30340;&#22909;&#22788;&#12290;
&lt;/p&gt;
&lt;p&gt;
In response to growing FinTech competition and the need for improved operational efficiency, this research focuses on understanding the potential of advanced document analytics, particularly using multimodal models, in banking processes. We perform a comprehensive analysis of the diverse banking document landscape, highlighting the opportunities for efficiency gains through automation and advanced analytics techniques in the customer business. Building on the rapidly evolving field of natural language processing (NLP), we illustrate the potential of models such as LayoutXLM, a cross-lingual, multimodal, pre-trained model, for analyzing diverse documents in the banking sector. This model performs a text token classification on German company register extracts with an overall F1 score performance of around 80\%. Our empirical evidence confirms the critical role of layout information in improving model performance and further underscores the benefits of integrating image information. Inte
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#30456;&#23545;&#32489;&#25928;&#26631;&#20934;&#19979;&#30340;&#26368;&#20248;&#25237;&#36164;&#30340;&#22343;&#20540;&#22330;&#21338;&#24328;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#35299;&#20915;&#26041;&#26696;&#65292;&#35814;&#32454;&#35828;&#26126;&#20102;CRRA&#25928;&#29992;&#24773;&#20917;&#19979;&#30340;&#26368;&#20248;&#31574;&#30053;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;CARA&#25928;&#29992;&#24773;&#20917;&#19979;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290; (arXiv:2307.10540v1 [q-fin.MF])</title><link>http://arxiv.org/abs/2307.10540</link><description>&lt;p&gt;
&#30456;&#23545;&#32489;&#25928;&#26631;&#20934;&#19979;&#30340;&#26368;&#20248;&#25237;&#36164;&#30340;&#22343;&#20540;&#22330;&#21338;&#24328;
&lt;/p&gt;
&lt;p&gt;
Mean Field Games for Optimal Investment Under Relative Performance Criteria. (arXiv:2307.10540v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10540
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#30456;&#23545;&#32489;&#25928;&#26631;&#20934;&#19979;&#30340;&#26368;&#20248;&#25237;&#36164;&#30340;&#22343;&#20540;&#22330;&#21338;&#24328;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#35299;&#20915;&#26041;&#26696;&#65292;&#35814;&#32454;&#35828;&#26126;&#20102;CRRA&#25928;&#29992;&#24773;&#20917;&#19979;&#30340;&#26368;&#20248;&#31574;&#30053;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;CARA&#25928;&#29992;&#24773;&#20917;&#19979;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290; (arXiv:2307.10540v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;Lacker&#21644;Soret&#25552;&#20986;&#30340;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#12290;&#20182;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26377;&#38480;&#26102;&#38388;&#27573;&#27169;&#22411;&#65292;&#20801;&#35768;&#20195;&#29702;&#20154;&#36890;&#36807;&#19982;&#20854;&#20182;&#20195;&#29702;&#20154;&#24179;&#22343;&#27700;&#24179;&#30340;&#30456;&#23545;&#34920;&#29616;&#26469;&#34913;&#37327;&#25928;&#29992;&#65292;&#32780;&#19981;&#20165;&#20165;&#26159;&#32477;&#23545;&#36130;&#23500;&#12290;&#34429;&#28982;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#26377;&#38480;&#20154;&#21475;&#25110;&#32773;n-&#20154;&#21338;&#24328;&#26159;&#21487;&#22788;&#29702;&#30340;&#65292;&#20294;&#20316;&#32773;&#25552;&#20986;&#20102;&#22343;&#20540;&#22330;&#21338;&#24328;&#26694;&#26550;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#24076;&#26395;&#21033;&#29992;&#36825;&#20010;&#26694;&#26550;&#35814;&#32454;&#35828;&#26126;CRRA&#25928;&#29992;&#24773;&#20917;&#19979;&#30340;&#26368;&#20248;&#25237;&#36164;&#21644;&#28040;&#36153;&#31574;&#30053;&#65292;&#22914;Lacker&#21644;Soret&#31616;&#35201;&#27010;&#36848;&#30340;&#37027;&#26679;&#65292;&#20294;&#20063;&#35201;&#25512;&#23548;&#20986;CARA&#25928;&#29992;&#24773;&#20917;&#19979;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we study the portfolio optimization problem formulated by Lacker and Soret. They formulate a finite time horizon model that allows agents to be competitive, measuring their utility not only by their absolute wealth but also relative performance compared to the average of other agents. While the finite population or $n$-player game is tractable in some cases, the authors present the Mean Field Game framework to solve this problem. Here, we seek to use this framework to clearly detail the optimal investment and consumption strategies in the CRRA utility case as was briefly outlined in Lacker and Soret, but also derive a solution in the CARA utility case.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#25512;&#23548;&#25968;&#23398;&#34920;&#36798;&#24335;&#65292;&#30740;&#31350;&#20102;&#30830;&#23450;&#31561;&#20215;&#27604;&#29575;&#22312;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#24212;&#29992;&#65292;&#24182;&#36890;&#36807;&#23454;&#35777;&#30740;&#31350;&#20102;&#35299;&#37322;&#20102;&#35813;&#25968;&#20540;&#30340;&#21547;&#20041;&#12290;&#32467;&#26524;&#24212;&#29992;&#20110;&#30005;&#21160;&#27773;&#36710;&#34892;&#19994;&#12290;</title><link>http://arxiv.org/abs/2307.08675</link><description>&lt;p&gt;
Put-Call Parity&#30340;&#30830;&#23450;&#31561;&#20215;&#27604;&#29575;&#21644;&#38544;&#21547;&#30340;Put-Call Parity&#30830;&#23450;&#31561;&#20215;&#27604;&#29575;&#26354;&#38754;
&lt;/p&gt;
&lt;p&gt;
The Put-Call Parity Certainty Equivalent Rate and the Implied Put-Call Parity Certainty Equivalent Rate Surface. (arXiv:2307.08675v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.08675
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#25512;&#23548;&#25968;&#23398;&#34920;&#36798;&#24335;&#65292;&#30740;&#31350;&#20102;&#30830;&#23450;&#31561;&#20215;&#27604;&#29575;&#22312;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#24212;&#29992;&#65292;&#24182;&#36890;&#36807;&#23454;&#35777;&#30740;&#31350;&#20102;&#35299;&#37322;&#20102;&#35813;&#25968;&#20540;&#30340;&#21547;&#20041;&#12290;&#32467;&#26524;&#24212;&#29992;&#20110;&#30005;&#21160;&#27773;&#36710;&#34892;&#19994;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#29616;&#23454;&#37329;&#34701;&#24066;&#22330;&#20013;&#65292;&#30830;&#23450;&#31561;&#20215;&#27604;&#29575;&#26159;&#25237;&#36164;&#32773;&#32771;&#34385;&#30340;&#37325;&#35201;&#22240;&#32032;&#12290;&#36890;&#36807;&#19968;&#20010;&#29305;&#23450;&#20844;&#21496;&#30340;&#30830;&#23450;&#31561;&#20215;&#27604;&#29575;&#30340;&#25968;&#20540;&#65292;&#25237;&#36164;&#32773;&#21487;&#20197;&#21028;&#26029;&#36825;&#20010;&#20844;&#21496;&#26159;&#21542;&#20540;&#24471;&#25237;&#36164;&#12290;&#26412;&#25991;&#23558;&#25506;&#35752;&#22914;&#20309;&#33719;&#24471;&#30830;&#23450;&#31561;&#20215;&#27604;&#29575;&#30340;&#25968;&#20540;&#65292;&#20197;&#20415;&#35780;&#20272;&#32473;&#23450;&#20844;&#21496;&#30340;&#20215;&#20540;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#23558;&#20171;&#32461;&#26412;&#25991;&#30340;&#29702;&#35770;&#25903;&#25345;&#65292;&#21363;Put-Call Parity&#12290;&#26681;&#25454;Put-Call Parity&#65292;&#25105;&#20204;&#23558;&#25512;&#23548;&#20986;&#30830;&#23450;&#31561;&#20215;&#27604;&#29575;&#30340;&#25968;&#23398;&#34920;&#36798;&#24335;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#23558;&#20351;&#29992;&#30830;&#23450;&#31561;&#20215;&#27604;&#29575;&#30340;&#25968;&#23398;&#34920;&#36798;&#24335;&#36827;&#34892;&#23454;&#35777;&#30740;&#31350;&#12290;&#25105;&#20204;&#23558;&#32771;&#34385;&#19968;&#20123;&#26497;&#31471;&#20363;&#23376;&#65292;&#21253;&#25324;&#21040;2023&#24180;&#20026;&#27490;&#34920;&#29616;&#26368;&#20339;&#21644;&#26368;&#24046;&#30340;&#32929;&#31080;&#12290;&#22522;&#20110;&#36825;&#20123;&#32929;&#31080;&#30340;&#25968;&#25454;&#65292;&#25105;&#20204;&#23558;&#21487;&#35270;&#21270;&#23637;&#31034;&#36825;&#20123;&#32929;&#31080;&#30340;&#34920;&#29616;&#65292;&#24182;&#35299;&#37322;&#25968;&#25454;&#30340;&#21547;&#20041;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#25226;&#32467;&#26524;&#24212;&#29992;&#21040;&#19968;&#20010;&#38750;&#24120;&#21463;&#27426;&#36814;&#30340;&#34892;&#19994;&#8212;&#8212;&#30005;&#21160;&#27773;&#36710;&#34892;&#19994;&#12290;
&lt;/p&gt;
&lt;p&gt;
In real financial markets, the certainty equivalent rate is an important factor for investors to consider. From the value of a specific company's certainty equivalent rate, investors can judge if this company is worth investing in. In this paper, we will explore how to obtain the value of the certainty equivalent rate so that we can evaluate a given company. First, we will introduce the theoretical support of this paper, which is put-call parity. From put-call parity, we will derive the mathematical expression for the certainty equivalent rate. Second, we will use the mathematical expression for the certainty equivalent rate to perform an empirical study. We will consider some extreme examples, including some of the best- and worst-performing stocks up to this point in 2023. Based on these stocks' data, we will visualize the performance of these stocks and explain the meaning of the data. Finally, we will apply the results to a very popular industry -- the electric vehicle industry -- 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#22312;&#25289;&#26222;&#25289;&#26031;&#27169;&#22411;&#20013;&#30740;&#31350;&#20102;&#27431;&#24335;&#26399;&#26435;&#20013;&#24076;&#33098;&#23383;&#27597;Speed&#30340;&#35299;&#26512;&#34920;&#36798;&#24335;&#65292;&#24182;&#25552;&#20379;&#20102;COS&#26041;&#27861;&#36817;&#20284;Speed&#25152;&#38656;&#28385;&#36275;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#23454;&#39564;&#35777;&#26126;&#26410;&#28385;&#36275;&#26465;&#20214;&#26102;&#32467;&#26524;&#21487;&#33021;&#19981;&#20934;&#30830;&#12290;</title><link>http://arxiv.org/abs/2306.08421</link><description>&lt;p&gt;
&#25289;&#26222;&#25289;&#26031;&#27169;&#22411;&#20013;COS&#26041;&#27861;&#20013;&#24076;&#33098;&#23383;&#27597;&#30340;&#38519;&#38449;
&lt;/p&gt;
&lt;p&gt;
Greeks' pitfalls for the COS method in the Laplace model. (arXiv:2306.08421v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08421
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#25289;&#26222;&#25289;&#26031;&#27169;&#22411;&#20013;&#30740;&#31350;&#20102;&#27431;&#24335;&#26399;&#26435;&#20013;&#24076;&#33098;&#23383;&#27597;Speed&#30340;&#35299;&#26512;&#34920;&#36798;&#24335;&#65292;&#24182;&#25552;&#20379;&#20102;COS&#26041;&#27861;&#36817;&#20284;Speed&#25152;&#38656;&#28385;&#36275;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#23454;&#39564;&#35777;&#26126;&#26410;&#28385;&#36275;&#26465;&#20214;&#26102;&#32467;&#26524;&#21487;&#33021;&#19981;&#20934;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24076;&#33098;&#23383;&#27597;Delta&#65292;Gamma&#21644;Speed&#26159;&#27431;&#24335;&#26399;&#26435;&#30456;&#23545;&#20110;&#26631;&#30340;&#36164;&#20135;&#24403;&#21069;&#20215;&#26684;&#30340;&#19968;&#38454;&#12289;&#20108;&#38454;&#21644;&#19977;&#38454;&#23548;&#25968;&#12290;&#20613;&#37324;&#21494;&#20313;&#24358;&#32423;&#25968;&#23637;&#24320;&#27861;&#65288;COS &#26041;&#27861;&#65289;&#26159;&#19968;&#31181;&#25968;&#20540;&#26041;&#27861;&#65292;&#29992;&#20110;&#36817;&#20284;&#27431;&#24335;&#26399;&#26435;&#30340;&#20215;&#26684;&#21644;&#24076;&#33098;&#23383;&#27597;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#25289;&#26222;&#25289;&#26031;&#27169;&#22411;&#20013;&#21508;&#31181;&#27431;&#24335;&#26399;&#26435;&#30340;Speed&#30340;&#38381;&#21512;&#24418;&#24335;&#34920;&#36798;&#24335;&#65292;&#24182;&#25552;&#20379;&#20102;COS&#26041;&#27861;&#36817;&#20284;Speed&#25152;&#38656;&#28385;&#36275;&#30340;&#20805;&#20998;&#26465;&#20214;&#12290;&#25105;&#20204;&#23454;&#35777;&#34920;&#26126;&#65292;&#22914;&#26524;&#36825;&#20123;&#20805;&#20998;&#26465;&#20214;&#19981;&#28385;&#36275;&#65292;COS&#26041;&#27861;&#21487;&#33021;&#20250;&#20135;&#29983;&#25968;&#23383;&#19978;&#27809;&#26377;&#24847;&#20041;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Greeks Delta, Gamma and Speed are the first, second and third derivative of a European option with respect to the current price of the underlying. The Fourier cosine series expansion method (COS method) is a numerical method for approximating the price and the Greeks of European options. We develop a closed-form expression of Speed of various European options in the Laplace model and we provide sufficient conditions for the COS method to approximate Speed. We show empirically that the COS method may produce numerically nonsensical results if theses sufficient conditions are not met.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21435;&#20013;&#24515;&#21270;&#25215;&#35834;&#23545;&#27665;&#20027;&#20915;&#31574;&#30340;&#24433;&#21709;&#12290;&#22312;&#25237;&#31080;&#21069;&#65292;&#22996;&#21592;&#20250;&#25104;&#21592;&#21487;&#20197;&#36827;&#34892;&#21487;&#25191;&#34892;&#30340;&#25215;&#35834;&#12290;&#21487;&#33021;&#38656;&#35201;&#36328;&#36234;&#38453;&#33829;&#36827;&#34892;&#25215;&#35834;&#65292;&#20197;&#23454;&#29616;&#25913;&#38761;&#30340;&#23454;&#26045;&#65292;&#21516;&#26102;&#38656;&#35201;&#25490;&#38500;&#26368;&#19981;&#28909;&#34935;&#20110;&#25913;&#38761;&#30340;&#25903;&#25345;&#32773;&#34987;&#35825;&#23548;&#25512;&#32763;&#20915;&#23450;&#12290;</title><link>http://arxiv.org/abs/2304.08008</link><description>&lt;p&gt;
&#22522;&#20110;&#25237;&#31080;&#32467;&#26524;&#30340;&#21435;&#20013;&#24515;&#21270;&#25215;&#35834;&#23545;&#27665;&#20027;&#20915;&#31574;&#30340;&#24433;&#21709;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Democratic Policy Decisions with Decentralized Promises Contingent on Vote Outcome. (arXiv:2304.08008v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.08008
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21435;&#20013;&#24515;&#21270;&#25215;&#35834;&#23545;&#27665;&#20027;&#20915;&#31574;&#30340;&#24433;&#21709;&#12290;&#22312;&#25237;&#31080;&#21069;&#65292;&#22996;&#21592;&#20250;&#25104;&#21592;&#21487;&#20197;&#36827;&#34892;&#21487;&#25191;&#34892;&#30340;&#25215;&#35834;&#12290;&#21487;&#33021;&#38656;&#35201;&#36328;&#36234;&#38453;&#33829;&#36827;&#34892;&#25215;&#35834;&#65292;&#20197;&#23454;&#29616;&#25913;&#38761;&#30340;&#23454;&#26045;&#65292;&#21516;&#26102;&#38656;&#35201;&#25490;&#38500;&#26368;&#19981;&#28909;&#34935;&#20110;&#25913;&#38761;&#30340;&#25903;&#25345;&#32773;&#34987;&#35825;&#23548;&#25512;&#32763;&#20915;&#23450;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#21435;&#20013;&#24515;&#21270;&#30340;&#25928;&#29992;&#36716;&#31227;&#25215;&#35834;&#22914;&#20309;&#24433;&#21709;&#25237;&#31080;&#26041;&#24335;&#30340;&#38598;&#20307;&#20915;&#31574;&#12290;&#22312;&#25237;&#31080;&#21069;&#65292;&#25903;&#25345;&#21644;&#21453;&#23545;&#39640;&#25928;&#25913;&#38761;&#30340;&#22996;&#21592;&#20250;&#25104;&#21592;&#21487;&#20197;&#36827;&#34892;&#21487;&#25191;&#34892;&#30340;&#25215;&#35834;&#12290;&#19968;&#20010;&#22343;&#34913;&#38656;&#35201;&#31283;&#23450;&#24615;&#21644;&#26368;&#23567;&#21270;&#30340;&#25215;&#35834;&#12290;&#24179;&#34913;&#25215;&#35834;&#26159;&#23384;&#22312;&#19988;&#19981;&#30830;&#23450;&#30340;&#65292;&#20294;&#20855;&#26377;&#35768;&#22810;&#20849;&#21516;&#30340;&#29305;&#24449;&#12290;&#38656;&#35201;&#39640;&#24378;&#24230;&#25104;&#21592;&#21521;&#20302;&#24378;&#24230;&#25104;&#21592;&#25552;&#20379;&#36716;&#31227;&#25215;&#35834;&#65292;&#24182;&#23548;&#33268;&#25913;&#38761;&#30340;&#23454;&#26045;&#12290;&#24403;&#25913;&#38761;&#25903;&#25345;&#32773;&#32570;&#20047;&#36275;&#22815;&#30340;&#25237;&#31080;&#26435;&#26102;&#65292;&#25215;&#35834;&#24517;&#39035;&#36328;&#36234;&#38453;&#33829;&#12290;&#21363;&#20351;&#25913;&#38761;&#25903;&#25345;&#32773;&#30340;&#32852;&#30431;&#26159;&#20915;&#23450;&#24615;&#30340;&#65292;&#25215;&#35834;&#20063;&#24517;&#39035;&#25490;&#38500;&#26368;&#19981;&#28909;&#34935;&#20110;&#25913;&#38761;&#30340;&#25903;&#25345;&#32773;&#34987;&#35825;&#23548;&#25512;&#32763;&#20915;&#23450;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#24179;&#34913;&#30340;&#25215;&#35834;&#19981;&#38656;&#35201;&#36328;&#36234;&#38453;&#33829;&#12290;&#25105;&#20204;&#36824;&#35752;&#35770;&#20102;&#19968;&#31995;&#21015;&#26377;&#38480;&#30340;&#25215;&#35834;&#65292;&#23454;&#29616;&#36798;&#21040;&#19968;&#20010;&#24179;&#34913;&#30340;&#29366;&#24577;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study how decentralized utility transfer promises affect collective decision-making by voting. Committee members with varying levels of support and opposition for an efficient reform can make enforceable promises before voting. An equilibrium requires stability and minimal promises. Equilibrium promises exist and are indeterminate, but do share several key characteristics. Equilibria require transfer promises from high to low intensity members and result in enacting the reform. When reform supporters lack sufficient voting power, promises must reach across the aisle. Even if the coalition of reform supporters is decisive, promises must preclude the least enthusiastic supporters of the reform from being enticed to overturn the decision. In that case, equilibrium promises do not need to reach across the aisle. We also discuss a finite sequence of promises that achieve an equilibrium.
&lt;/p&gt;</description></item><item><title>&#20171;&#32461;&#20102;&#29992;&#20110;&#27431;&#24335;&#26399;&#26435;&#23450;&#20215;&#30340; Fourier&#20313;&#24358;&#23637;&#24320; (COS) &#26041;&#27861;&#65292;&#36890;&#36807;&#25351;&#23450;&#25130;&#26029;&#33539;&#22260;&#21644;&#39033;&#25968;N&#36827;&#34892;&#36924;&#36817;&#65292;&#25991;&#31456;&#25552;&#20986;&#26126;&#30830;&#30340;N&#30340;&#19978;&#30028;&#65292;&#23545;&#23494;&#24230;&#24179;&#28369;&#24182;&#25351;&#25968;&#34928;&#20943;&#30340;&#24773;&#20917;&#65292;COS&#26041;&#27861;&#30340;&#25910;&#25947;&#38454;&#25968;&#33267;&#23569;&#26159;&#25351;&#25968;&#25910;&#25947;&#38454;&#25968;&#12290;</title><link>http://arxiv.org/abs/2303.16012</link><description>&lt;p&gt;
&#22914;&#20309;&#22788;&#29702;&#29992;&#20110;&#26399;&#26435;&#23450;&#20215;&#30340; COS &#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
How to handle the COS method for option pricing. (arXiv:2303.16012v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.16012
&lt;/p&gt;
&lt;p&gt;
&#20171;&#32461;&#20102;&#29992;&#20110;&#27431;&#24335;&#26399;&#26435;&#23450;&#20215;&#30340; Fourier&#20313;&#24358;&#23637;&#24320; (COS) &#26041;&#27861;&#65292;&#36890;&#36807;&#25351;&#23450;&#25130;&#26029;&#33539;&#22260;&#21644;&#39033;&#25968;N&#36827;&#34892;&#36924;&#36817;&#65292;&#25991;&#31456;&#25552;&#20986;&#26126;&#30830;&#30340;N&#30340;&#19978;&#30028;&#65292;&#23545;&#23494;&#24230;&#24179;&#28369;&#24182;&#25351;&#25968;&#34928;&#20943;&#30340;&#24773;&#20917;&#65292;COS&#26041;&#27861;&#30340;&#25910;&#25947;&#38454;&#25968;&#33267;&#23569;&#26159;&#25351;&#25968;&#25910;&#25947;&#38454;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Fourier&#20313;&#24358;&#23637;&#24320;&#65288;COS&#65289;&#26041;&#27861;&#29992;&#20110;&#39640;&#25928;&#22320;&#35745;&#31639;&#27431;&#24335;&#26399;&#26435;&#20215;&#26684;&#12290;&#35201;&#24212;&#29992;COS&#26041;&#27861;&#65292;&#24517;&#39035;&#25351;&#23450;&#20004;&#20010;&#21442;&#25968;&#65306;&#23545;&#25968;&#25910;&#30410;&#29575;&#23494;&#24230;&#30340;&#25130;&#26029;&#33539;&#22260;&#21644;&#29992;&#20313;&#24358;&#32423;&#25968;&#36924;&#36817;&#25130;&#26029;&#23494;&#24230;&#30340;&#39033;&#25968;N&#12290;&#22914;&#20309;&#36873;&#25321;&#25130;&#26029;&#33539;&#22260;&#24050;&#32463;&#20026;&#20154;&#25152;&#30693;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#36824;&#33021;&#25214;&#21040;&#19968;&#20010;&#26126;&#30830;&#30340;&#24182;&#19988;&#26377;&#29992;&#30340;&#39033;&#25968;N&#30340;&#30028;&#38480;&#12290;&#25105;&#20204;&#36824;&#36827;&#19968;&#27493;&#34920;&#26126;&#65292;&#22914;&#26524;&#23494;&#24230;&#26159;&#24179;&#28369;&#30340;&#24182;&#19988;&#21576;&#25351;&#25968;&#34928;&#20943;&#65292;&#21017;COS&#26041;&#27861;&#33267;&#23569;&#20855;&#26377;&#25351;&#25968;&#25910;&#25947;&#38454;&#25968;&#12290;&#20294;&#26159;&#65292;&#22914;&#26524;&#23494;&#24230;&#24179;&#28369;&#20294;&#26377;&#37325;&#23614;&#24052;&#65292;&#23601;&#20687;&#22312;&#26377;&#38480;&#30697;&#38453;log&#31283;&#23450;&#27169;&#22411;&#20013;&#19968;&#26679;&#65292;&#21017;COS&#26041;&#27861;&#27809;&#26377;&#25351;&#25968;&#25910;&#25947;&#38454;&#25968;&#12290;&#25968;&#20540;&#23454;&#39564;&#30830;&#35748;&#20102;&#29702;&#35770;&#21457;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Fourier cosine expansion (COS) method is used for pricing European options numerically very efficiently. To apply the COS method, one has to specify two parameters: a truncation range for the density of the log-returns and a number of terms N to approximate the truncated density by a cosine series. How to choose the truncation range is already known. Here, we are able to find an explicit and useful bound for N as well. We further show that the COS method has at least an exponential order of convergence if the density is smooth and decays exponentially. But, if the density is smooth and has heavy tails like in the Finite Moment Log Stable model, the COS method has not an exponential order of convergence. Numerical experiments confirm the theoretical findings.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#21270;&#23614;&#20381;&#36182;&#31995;&#25968;&#20272;&#35745;&#22120;&#30340;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#24179;&#34913;&#20559;&#24046;&#21644;&#26041;&#24046;&#26469;&#36873;&#25321;&#38408;&#20540;&#65292;&#32467;&#21512;&#29702;&#35770;&#22343;&#26041;&#35823;&#24046;&#21644;&#23614;&#37096;&#35266;&#27979;&#20540;&#30340;&#21442;&#25968;&#20272;&#35745;&#12290;&#20223;&#30495;&#23454;&#39564;&#34920;&#26126;&#65292;&#36825;&#31181;&#21322;&#21442;&#25968;&#21270;&#26041;&#27861;&#27604;&#25991;&#29486;&#20013;&#25552;&#20986;&#30340;&#20854;&#20182;&#26041;&#27861;&#25928;&#26524;&#26356;&#22909;&#12290;</title><link>http://arxiv.org/abs/2111.11128</link><description>&lt;p&gt;
&#38750;&#21442;&#25968;&#21270;&#23614;&#20381;&#36182;&#31995;&#25968;&#20272;&#35745;&#22120;&#65306;&#24179;&#34913;&#20559;&#24046;&#21644;&#26041;&#24046;
&lt;/p&gt;
&lt;p&gt;
Nonparametric estimator of the tail dependence coefficient: balancing bias and variance. (arXiv:2111.11128v4 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2111.11128
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#21270;&#23614;&#20381;&#36182;&#31995;&#25968;&#20272;&#35745;&#22120;&#30340;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#24179;&#34913;&#20559;&#24046;&#21644;&#26041;&#24046;&#26469;&#36873;&#25321;&#38408;&#20540;&#65292;&#32467;&#21512;&#29702;&#35770;&#22343;&#26041;&#35823;&#24046;&#21644;&#23614;&#37096;&#35266;&#27979;&#20540;&#30340;&#21442;&#25968;&#20272;&#35745;&#12290;&#20223;&#30495;&#23454;&#39564;&#34920;&#26126;&#65292;&#36825;&#31181;&#21322;&#21442;&#25968;&#21270;&#26041;&#27861;&#27604;&#25991;&#29486;&#20013;&#25552;&#20986;&#30340;&#20854;&#20182;&#26041;&#27861;&#25928;&#26524;&#26356;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25512;&#23548;&#20102;&#19968;&#20010;&#29702;&#35770;&#34920;&#36798;&#24335;&#26469;&#34913;&#37327;&#38750;&#21442;&#25968;&#21270;&#23614;&#20381;&#36182;&#31995;&#25968;&#20272;&#35745;&#22120;&#30340;&#22343;&#26041;&#35823;&#24046;&#65292;&#35813;&#35823;&#24046;&#21462;&#20915;&#20110;&#23450;&#20041;&#21738;&#20010;&#25490;&#20301;&#30028;&#23450;&#20998;&#24067;&#30340;&#23614;&#37096;&#30340;&#38408;&#20540;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#20248;&#21270;&#36873;&#25321;&#36825;&#20010;&#38408;&#20540;&#65292;&#23427;&#23558;&#20272;&#35745;&#22120;&#30340;&#29702;&#35770;&#22343;&#26041;&#35823;&#24046;&#19982;&#22312;&#23614;&#37096;&#38142;&#25509;&#35266;&#27979;&#20540;&#30340;&#21442;&#25968;&#20272;&#35745;&#30340;&#27169;&#25311;&#30456;&#32467;&#21512;&#12290;&#36890;&#36807;&#20223;&#30495;&#65292;&#25105;&#20204;&#23558;&#36825;&#31181;&#21322;&#21442;&#25968;&#21270;&#26041;&#27861;&#19982;&#25991;&#29486;&#20013;&#25552;&#20986;&#30340;&#20854;&#20182;&#26041;&#27861;&#36827;&#34892;&#20102;&#27604;&#36739;&#65292;&#21253;&#25324;&#23547;&#25214;&#24179;&#21488;&#30340;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
A theoretical expression is derived for the mean squared error of a nonparametric estimator of the tail dependence coefficient, depending on a threshold that defines which rank delimits the tails of a distribution. We propose a new method to optimally select this threshold. It combines the theoretical mean squared error of the estimator with a parametric estimation of the copula linking observations in the tails. Using simulations, we compare this semiparametric method with other approaches proposed in the literature, including the plateau-finding algorithm.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#31350;&#20102;&#27604;&#29305;&#24065;&#24066;&#22330;&#20013;&#25237;&#36164;&#32773;&#30340;&#22788;&#32622;&#25928;&#24212;&#65292;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#27604;&#29305;&#24065;&#25237;&#36164;&#32773;&#26222;&#36941;&#34920;&#29616;&#20986;&#36825;&#31181;&#38750;&#29702;&#24615;&#34892;&#20026;&#65292;&#20854;&#24378;&#24230;&#21644;&#26222;&#36941;&#24615;&#38543;&#26102;&#38388;&#21464;&#21270;&#12290;&#36825;&#19968;&#21457;&#29616;&#25581;&#31034;&#20102;&#22312;&#38750;&#20856;&#22411;&#24066;&#22330;&#20013;&#20063;&#23384;&#22312;&#30528;&#38750;&#29702;&#24615;&#30340;&#25237;&#36164;&#34892;&#20026;&#12290;</title><link>http://arxiv.org/abs/2010.12415</link><description>&lt;p&gt;
&#25506;&#32034;&#27604;&#29305;&#24065;&#25237;&#36164;&#32773;&#34892;&#20026;&#65306;&#19968;&#39033;&#20851;&#20110;&#22788;&#32622;&#25928;&#24212;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Exploring investor behavior in Bitcoin: a study of the disposition effect. (arXiv:2010.12415v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2010.12415
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#31350;&#20102;&#27604;&#29305;&#24065;&#24066;&#22330;&#20013;&#25237;&#36164;&#32773;&#30340;&#22788;&#32622;&#25928;&#24212;&#65292;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#27604;&#29305;&#24065;&#25237;&#36164;&#32773;&#26222;&#36941;&#34920;&#29616;&#20986;&#36825;&#31181;&#38750;&#29702;&#24615;&#34892;&#20026;&#65292;&#20854;&#24378;&#24230;&#21644;&#26222;&#36941;&#24615;&#38543;&#26102;&#38388;&#21464;&#21270;&#12290;&#36825;&#19968;&#21457;&#29616;&#25581;&#31034;&#20102;&#22312;&#38750;&#20856;&#22411;&#24066;&#22330;&#20013;&#20063;&#23384;&#22312;&#30528;&#38750;&#29702;&#24615;&#30340;&#25237;&#36164;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25237;&#36164;&#32773;&#26222;&#36941;&#34920;&#29616;&#20986;&#22788;&#32622;&#25928;&#24212;&#65292;&#21363;&#22312;&#21334;&#20986;&#36194;&#21033;&#30340;&#25237;&#36164;&#26102;&#24773;&#32490;&#19978;&#30340;&#20542;&#21521;&#65292;&#32780;&#22362;&#25345;&#25345;&#26377;&#20111;&#25439;&#30340;&#25237;&#36164;&#12290;&#34429;&#28982;&#36825;&#31181;&#29616;&#35937;&#24050;&#22312;&#35768;&#22810;&#20256;&#32479;&#24066;&#22330;&#20013;&#34987;&#35266;&#23519;&#21040;&#65292;&#20294;&#19981;&#28165;&#26970;&#23427;&#26159;&#21542;&#20063;&#36866;&#29992;&#20110;&#20687;&#21152;&#23494;&#36164;&#20135;&#36825;&#26679;&#30340;&#38750;&#20856;&#22411;&#24066;&#22330;&#12290;&#26412;&#25991;&#20351;&#29992;&#38024;&#23545;&#21152;&#23494;&#36164;&#20135;&#20132;&#26131;&#25152;&#30340;&#20132;&#26131;&#20316;&#20026;&#21334;&#20986;&#20132;&#26131;&#30340;&#26367;&#20195;&#21697;&#65292;&#30740;&#31350;&#20102;&#27604;&#29305;&#24065;&#20013;&#22788;&#32622;&#25928;&#24212;&#30340;&#26222;&#36941;&#24615;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#27604;&#29305;&#24065;&#25237;&#36164;&#32773;&#30830;&#23454;&#21463;&#21040;&#22788;&#32622;&#25928;&#24212;&#30340;&#24433;&#21709;&#65292;&#20294;&#20854;&#24378;&#24230;&#21508;&#19981;&#30456;&#21516;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#36824;&#21457;&#29616;&#22788;&#32622;&#25928;&#24212;&#22312;&#35266;&#23519;&#26399;&#20869;&#24182;&#19981;&#19968;&#30452;&#23384;&#22312;&#65292;&#23427;&#22312;2017&#24180;&#20197;&#21518;&#30340;&#32321;&#33635;&#19982;&#20302;&#36855;&#24180;&#20221;&#26356;&#20026;&#26174;&#33879;&#65292;&#24471;&#21040;&#20102;&#21508;&#31181;&#25216;&#26415;&#25351;&#26631;&#30340;&#35777;&#23454;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#34920;&#26126;&#65292;&#38750;&#29702;&#24615;&#25237;&#36164;&#32773;&#34892;&#20026;&#20063;&#23384;&#22312;&#20110;&#20687;&#27604;&#29305;&#24065;&#36825;&#26679;&#30340;&#38750;&#20856;&#22411;&#24066;&#22330;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
Investors commonly exhibit the disposition effect - the irrational tendency to sell their winning investments and hold onto their losing ones. While this phenomenon has been observed in many traditional markets, it remains unclear whether it also applies to atypical markets like cryptoassets. This paper investigates the prevalence of the disposition effect in Bitcoin using transactions targeting cryptoasset exchanges as proxies for selling transactions. Our findings suggest that investors in Bitcoin were indeed subject to the disposition effect, with varying intensity. They also show that the disposition effect was not consistently present throughout the observation period. Its prevalence was more evident from the boom and bust year 2017 onwards, as confirmed by various technical indicators. Our study suggests irrational investor behavior is also present in atypical markets like Bitcoin.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#23545;&#24847;&#22823;&#21033;&#20892;&#22330;&#30340;&#35745;&#37327;&#32463;&#27982;&#20998;&#26512;&#65292;&#21457;&#29616;CAP&#30340;&#25903;&#25345;&#36890;&#36807;&#27491;&#21521;&#24433;&#21709;&#20892;&#22330;&#25910;&#20837;&#21644;&#36164;&#26412;&#20197;&#21450;&#36127;&#21521;&#24433;&#21709;&#21171;&#21160;&#21147;&#20351;&#29992;&#65292;&#20174;&#32780;&#30452;&#25509;&#21644;&#38388;&#25509;&#22320;&#20419;&#36827;&#20102;&#20892;&#22330;&#25910;&#20837;&#30340;&#22686;&#21152;&#12290;</title><link>http://arxiv.org/abs/2009.07684</link><description>&lt;p&gt;
CAP&#25903;&#25345;&#23545;&#20892;&#22330;&#25910;&#20837;&#22686;&#21152;&#30340;&#30452;&#25509;&#21644;&#38388;&#25509;&#24433;&#21709;&#65306;&#22522;&#20110;&#20892;&#22330;&#30340;&#35745;&#37327;&#32463;&#27982;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
The direct and indirect effect of CAP support on farm income enhancement:a farm-based econometric analysis. (arXiv:2009.07684v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2009.07684
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#23545;&#24847;&#22823;&#21033;&#20892;&#22330;&#30340;&#35745;&#37327;&#32463;&#27982;&#20998;&#26512;&#65292;&#21457;&#29616;CAP&#30340;&#25903;&#25345;&#36890;&#36807;&#27491;&#21521;&#24433;&#21709;&#20892;&#22330;&#25910;&#20837;&#21644;&#36164;&#26412;&#20197;&#21450;&#36127;&#21521;&#24433;&#21709;&#21171;&#21160;&#21147;&#20351;&#29992;&#65292;&#20174;&#32780;&#30452;&#25509;&#21644;&#38388;&#25509;&#22320;&#20419;&#36827;&#20102;&#20892;&#22330;&#25910;&#20837;&#30340;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35780;&#20272;&#20102;&#21521;&#20892;&#27665;&#25552;&#20379;&#30340;CAP&#25903;&#25345;&#19982;&#20892;&#22330;&#25910;&#20837;&#12289;&#36164;&#26412;&#21644;&#21171;&#21160;&#21147;&#20351;&#29992;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#24182;&#24212;&#29992;&#19977;&#20010;&#22238;&#24402;&#27169;&#22411;&#23545;&#24847;&#22823;&#21033;FADN&#20892;&#22330;&#36827;&#34892;&#25511;&#21046;&#12290;CAP&#24180;&#24230;&#25903;&#20184;&#19982;&#20892;&#22330;&#25910;&#20837;&#21644;&#36164;&#26412;&#21576;&#27491;&#30456;&#20851;&#65292;&#20294;&#19982;&#21171;&#21160;&#21147;&#20351;&#29992;&#21576;&#36127;&#30456;&#20851;&#12290;&#36890;&#36807;RDP&#25514;&#26045;&#25552;&#20379;&#30340;&#20892;&#22330;&#25237;&#36164;&#25903;&#25345;&#19982;&#36164;&#26412;&#25968;&#37327;&#21576;&#27491;&#30456;&#20851;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;CAP&#23545;&#20892;&#22330;&#25910;&#20837;&#30340;&#24433;&#21709;&#26082;&#26159;&#30452;&#25509;&#30340;&#65292;&#20063;&#26159;&#36890;&#36807;&#25903;&#25345;&#21171;&#21160;&#21147;&#19982;&#36164;&#26412;&#30340;&#26367;&#20195;&#32780;&#38388;&#25509;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We assess the correlation between CAP support provided to farmers and their income and use of capital and labour in the first year of the new CAP regime. This is done applying three regression models on the Italian FADN farms controlling for other farm characteristics. CAP annual payments are positively correlated with farm income and capital but are negatively correlated with labour use. Farm investment support provided by RDP measures is positively correlated to the amount of capital. Results suggest that CAP is positively affecting farm income directly but also indirectly by supporting the substitution of labour with capital
&lt;/p&gt;</description></item></channel></rss>