<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#32654;&#22269;&#23485;&#24102;&#22522;&#30784;&#35774;&#26045;&#34917;&#36148;&#21644;&#25237;&#36164;&#35745;&#21010;&#23545;&#22269;&#20869;&#29983;&#20135;&#24635;&#20540;&#30340;&#36129;&#29486;&#12290;&#36890;&#36807;&#25237;&#20837;&#20135;&#20986;&#27169;&#22411;&#25506;&#32034;&#20102;&#23485;&#24102;&#25903;&#20986;&#23545;&#23439;&#35266;&#32463;&#27982;&#30340;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2311.02431</link><description>&lt;p&gt;
&#32654;&#22269;&#23485;&#24102;&#22522;&#30784;&#35774;&#26045;&#34917;&#36148;&#21644;&#25237;&#36164;&#35745;&#21010;&#23545;&#22269;&#20869;&#29983;&#20135;&#24635;&#20540;&#30340;&#36129;&#29486;&#65306;&#22522;&#20110;&#25237;&#20837;&#20135;&#20986;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
The contribution of US broadband infrastructure subsidy and investment programs to GDP using input-output modeling
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.02431
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#32654;&#22269;&#23485;&#24102;&#22522;&#30784;&#35774;&#26045;&#34917;&#36148;&#21644;&#25237;&#36164;&#35745;&#21010;&#23545;&#22269;&#20869;&#29983;&#20135;&#24635;&#20540;&#30340;&#36129;&#29486;&#12290;&#36890;&#36807;&#25237;&#20837;&#20135;&#20986;&#27169;&#22411;&#25506;&#32034;&#20102;&#23485;&#24102;&#25903;&#20986;&#23545;&#23439;&#35266;&#32463;&#27982;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#34987;&#20844;&#35748;&#20026;&#19968;&#31181;&#37325;&#35201;&#30340;&#31119;&#21033;&#65292;&#36229;&#36807;&#20116;&#20998;&#20043;&#19968;&#30340;&#32654;&#22269;&#20154;&#21475;&#27809;&#26377;&#35746;&#38405;&#22266;&#23450;&#23485;&#24102;&#26381;&#21153;&#12290;&#20363;&#22914;&#65292;&#23613;&#31649;&#24180;&#25910;&#20837;&#36229;&#36807;7&#19975;&#32654;&#20803;&#30340;&#24066;&#27665;&#20013;&#21482;&#26377;&#19981;&#21040;4%&#27809;&#26377;&#23485;&#24102;&#65292;&#20294;&#25910;&#20837;&#20302;&#20110;2&#19975;&#32654;&#20803;&#30340;&#24066;&#27665;&#20013;&#26377;26%&#27809;&#26377;&#23485;&#24102;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25308;&#30331;&#25919;&#24220;&#36890;&#36807;&#12298;&#20004;&#20826;&#22522;&#30784;&#35774;&#26045;&#27861;&#12299;&#23454;&#26045;&#20102;&#26377;&#21490;&#20197;&#26469;&#35268;&#27169;&#26368;&#22823;&#30340;&#23485;&#24102;&#25237;&#36164;&#35745;&#21010;&#65292;&#26088;&#22312;&#35299;&#20915;&#36825;&#31181;&#24046;&#36317;&#65292;&#24182;&#23558;&#23485;&#24102;&#36830;&#25509;&#25193;&#23637;&#21040;&#25152;&#26377;&#20844;&#27665;&#12290;&#25903;&#25345;&#32773;&#34920;&#31034;&#65292;&#36825;&#23558;&#20174;&#26681;&#26412;&#19978;&#20943;&#23569;&#32654;&#22269;&#30340;&#25968;&#23383;&#40511;&#27807;&#12290;&#28982;&#32780;&#65292;&#25209;&#35780;&#32773;&#35748;&#20026;&#65292;&#35813;&#35745;&#21010;&#23548;&#33268;&#32463;&#27982;&#21608;&#26399;&#30340;&#21518;&#26399;&#20986;&#29616;&#20102;&#21069;&#25152;&#26410;&#26377;&#30340;&#20511;&#36151;&#65292;&#30041;&#19979;&#20102;&#24456;&#23569;&#30340;&#36130;&#25919;&#20313;&#22320;&#12290;&#22240;&#27492;&#65292;&#22312;&#36825;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#23558;&#30740;&#31350;&#23485;&#24102;&#30340;&#21487;&#29992;&#24615;&#12289;&#37319;&#29992;&#24773;&#20917;&#21644;&#38656;&#27714;&#65292;&#28982;&#21518;&#26500;&#24314;&#19968;&#20010;&#25237;&#20837;&#20135;&#20986;&#27169;&#22411;&#65292;&#20197;&#25506;&#32034;&#23485;&#24102;&#25903;&#20986;&#23545;&#22269;&#20869;&#29983;&#20135;&#24635;&#20540;&#65288;GDP&#65289;&#30340;&#23439;&#35266;&#32463;&#27982;&#24433;&#21709;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#37327;&#21270;&#20102;&#37096;&#38376;&#38388;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
More than one-fifth of the US population does not subscribe to a fixed broadband service despite being a recognized merit good. For example, less than 4% of citizens earning more than US \$70k annually do not have broadband, compared to 26% of those earning below US \$20k annually. To address this, the Biden Administration has undertaken one of the largest broadband investment programs ever via The Bipartisan Infrastructure Law, with the aim of addressing this disparity and expanding broadband connectivity to all citizens. Proponents state this will reduce the US digital divide once-and-for-all. However, detractors say the program leads to unprecedented borrowing at a late stage of the economic cycle, leaving little fiscal headroom. Subsequently, in this paper, we examine broadband availability, adoption, and need and then construct an input-output model to explore the macroeconomic impacts of broadband spending in Gross Domestic Product (GDP) terms. Finally, we quantify inter-sectoral
&lt;/p&gt;</description></item></channel></rss>