<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#20811;&#26381;&#27668;&#20505;&#25919;&#31574;&#38459;&#25376;&#20027;&#20041;&#30340;&#20116;&#31181;&#31574;&#30053;&#65306;&#23433;&#25242;&#12289;&#20849;&#21516;&#21457;&#36215;&#21464;&#38761;&#12289;&#21046;&#24230;&#20027;&#20041;&#12289;&#23545;&#25239;&#21644;&#25269;&#28040;&#12290;</title><link>http://arxiv.org/abs/2304.14960</link><description>&lt;p&gt;
&#20811;&#26381;&#27668;&#20505;&#25919;&#31574;&#38459;&#25376;&#30340;&#25919;&#27835;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Political Strategies to Overcome Climate Policy Obstructionism. (arXiv:2304.14960v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.14960
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#20811;&#26381;&#27668;&#20505;&#25919;&#31574;&#38459;&#25376;&#20027;&#20041;&#30340;&#20116;&#31181;&#31574;&#30053;&#65306;&#23433;&#25242;&#12289;&#20849;&#21516;&#21457;&#36215;&#21464;&#38761;&#12289;&#21046;&#24230;&#20027;&#20041;&#12289;&#23545;&#25239;&#21644;&#25269;&#28040;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20276;&#38543;&#30528;&#22823;&#22411;&#31038;&#20250;&#32463;&#27982;&#36716;&#22411;&#65292;&#26576;&#20123;&#34892;&#19994;&#30340;&#34928;&#33853;&#21644;&#20854;&#20182;&#34892;&#19994;&#30340;&#23835;&#36215;&#26159;&#19981;&#21487;&#36991;&#20813;&#30340;&#12290;&#36755;&#25481;&#36825;&#22330;&#36716;&#22411;&#30340;&#19968;&#26041;&#24448;&#24448;&#20250;&#37319;&#21462;&#21508;&#31181;&#31574;&#30053;&#26469;&#38459;&#25376;&#21464;&#38761;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#25919;&#27835;&#32463;&#27982;&#27169;&#22411;&#26469;&#20998;&#26512;&#21033;&#30410;&#38598;&#22242;&#30340;&#31454;&#20105;&#65292;&#24182;&#39564;&#35777;&#20102;&#22312;&#20840;&#29699;&#27668;&#20505;&#36816;&#21160;&#20013;&#37319;&#29992;&#30340;&#31574;&#30053;&#12290;&#25105;&#20204;&#24402;&#32435;&#20986;&#20811;&#26381;&#38459;&#25376;&#20027;&#20041;&#30340;&#20116;&#31181;&#31574;&#30053;&#65306;&#65288;1&#65289;&#23433;&#25242;&#65292;&#21363;&#23545;&#36755;&#23478;&#36827;&#34892;&#34917;&#20607;&#65307;&#65288;2&#65289;&#20849;&#21516;&#21457;&#36215;&#21464;&#38761;&#65292;&#19982;&#29616;&#26377;&#20225;&#19994;&#21512;&#20316;&#23454;&#29616;&#21464;&#38761;&#65307;&#65288;3&#65289;&#21046;&#24230;&#20027;&#20041;&#65292;&#36890;&#36807;&#25913;&#21464;&#20844;&#20849;&#26426;&#26500;&#26469;&#25903;&#25345;&#33073;&#30899;&#65307;&#65288;4&#65289;&#23545;&#25239;&#65292;&#21363;&#36890;&#36807;&#22768;&#35465;&#25110;&#35785;&#35772;&#25104;&#26412;&#26469;&#21046;&#34913;&#19981;&#20316;&#20026;&#65307;&#65288;5&#65289;&#25269;&#28040;&#65292;&#21363;&#20351;&#20302;&#30899;&#26367;&#20195;&#21697;&#26356;&#20855;&#31454;&#20105;&#21147;&#12290;&#25105;&#20204;&#35748;&#20026;&#27599;&#31181;&#31574;&#30053;&#20174;&#19981;&#21516;&#30340;&#35282;&#24230;&#35299;&#20915;&#20102;&#38459;&#25376;&#38382;&#39064;&#65292;&#21453;&#26144;&#20102;&#22810;&#26679;&#21270;&#30340;&#34892;&#21160;&#12290;
&lt;/p&gt;
&lt;p&gt;
Great socio-economic transitions see the demise of certain industries and the rise of others. The losers of the transition tend to deploy a variety of tactics to obstruct change. We develop a political-economy model of interest group competition and garner evidence of tactics deployed in the global climate movement. From this we deduce a set of strategies for how the climate movement competes against entrenched hydrocarbon interests. Five strategies for overcoming obstructionism emerge: (1) Appeasement, which involves compensating the losers; (2) Co-optation, which seeks to instigate change by working with incumbents; (3) Institutionalism, which involves changes to public institutions to support decarbonization; (4) Antagonism, which creates reputational or litigation costs to inaction; and (5) Countervailance, which makes low-carbon alternatives more competitive. We argue that each strategy addresses the problem of obstructionism through a different lens, reflecting a diversity of act
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#21360;&#24230;&#30340;CBAA&#27861;&#24459;&#65292;&#35813;&#27861;&#24459;&#27809;&#26377;&#20805;&#20998;&#32771;&#34385;&#31038;&#20250;&#21644;&#29615;&#22659;&#25104;&#26412;&#65292;&#32473;&#29028;&#28845;&#24320;&#21457;&#24102;&#26469;&#19981;&#24403;&#20248;&#21183;&#12290;&#20316;&#32773;&#24314;&#35758;&#26356;&#26032;&#22303;&#22320;&#25910;&#36141;&#27861;&#24459;&#20197;&#25552;&#39640;&#36879;&#26126;&#24230;&#21644;&#20445;&#25252;&#29615;&#22659;&#12290;</title><link>http://arxiv.org/abs/2304.14941</link><description>&lt;p&gt;
&#32511;&#33394;&#27861;&#24459;&#65306;&#20462;&#35746;&#21360;&#24230;&#29028;&#30719;&#22303;&#22320;&#25910;&#36141;&#27861;&#24459;
&lt;/p&gt;
&lt;p&gt;
Greening our Laws: Revising Land Acquisition Law for Coal Mining in India. (arXiv:2304.14941v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.14941
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#21360;&#24230;&#30340;CBAA&#27861;&#24459;&#65292;&#35813;&#27861;&#24459;&#27809;&#26377;&#20805;&#20998;&#32771;&#34385;&#31038;&#20250;&#21644;&#29615;&#22659;&#25104;&#26412;&#65292;&#32473;&#29028;&#28845;&#24320;&#21457;&#24102;&#26469;&#19981;&#24403;&#20248;&#21183;&#12290;&#20316;&#32773;&#24314;&#35758;&#26356;&#26032;&#22303;&#22320;&#25910;&#36141;&#27861;&#24459;&#20197;&#25552;&#39640;&#36879;&#26126;&#24230;&#21644;&#20445;&#25252;&#29615;&#22659;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31649;&#29702;&#22303;&#22320;&#25910;&#36141;&#30340;&#27861;&#24459;&#21487;&#33021;&#20250;&#38145;&#23450;&#26087;&#30340;&#33539;&#20363;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#36825;&#26679;&#30340;&#20363;&#23376;&#65292;&#21363;1957&#24180;&#30340;&#29028;&#28845;&#39046;&#22495;&#27861;&#26696;&#65288;CBAA&#65289;&#65292;&#23427;&#25552;&#20379;&#20102;&#26368;&#23569;&#30340;&#31038;&#20250;&#21644;&#29615;&#22659;&#20445;&#25252;&#65292;&#19982;2013&#24180;&#20844;&#24179;&#34917;&#20607;&#21644;&#22303;&#22320;&#25910;&#36141;&#36879;&#26126;&#24230;&#27861;&#65288;LARR&#65289;&#23384;&#22312;&#37325;&#35201;&#24046;&#24322;&#12290;CBAA&#32570;&#20047;&#23613;&#32844;&#35843;&#26597;&#21327;&#35758;&#65292;&#20351;&#24471;&#29028;&#28845;&#24320;&#21457;&#20855;&#26377;&#19981;&#24403;&#30340;&#27604;&#36739;&#20248;&#21183;&#65292;&#36825;&#19982;&#21360;&#24230;&#20027;&#24352;&#36880;&#27493;&#20943;&#23569;&#29028;&#28845;&#20351;&#29992;&#12289;&#38477;&#20302;&#31354;&#27668;&#27745;&#26579;&#12289;&#25512;&#36827;&#29616;&#20195;&#33021;&#28304;&#30340;&#31435;&#22330;&#19981;&#19968;&#33268;&#12290;&#25105;&#20204;&#35748;&#20026;&#65292;&#21382;&#21490;&#19978;CBAA&#34987;&#35777;&#26126;&#26159;&#21512;&#29702;&#30340;&#21069;&#25552;&#24050;&#19981;&#20877;&#26377;&#25928;&#65292;&#22240;&#20026;&#24403;&#22320;&#29615;&#22659;&#21644;&#31038;&#20250;&#25104;&#26412;&#26356;&#21152;&#26174;&#33879;&#65292;&#24066;&#22330;&#19978;&#26377;&#26356;&#20026;&#28165;&#27905;&#30340;&#33021;&#28304;&#26367;&#20195;&#21697;&#65292;&#25104;&#26412;&#20855;&#26377;&#31454;&#20105;&#21147;&#12290;&#25105;&#20204;&#24314;&#35758;&#26356;&#26032;&#22303;&#22320;&#25910;&#36141;&#27861;&#24459;&#65292;&#23558;&#29028;&#28845;&#32435;&#20837;LARR&#30340;&#24635;&#20307;&#30417;&#31649;&#33539;&#22260;&#65292;&#25110;&#33267;&#23569;&#20462;&#25913;CBAA&#20197;&#20415;&#24314;&#31435;&#26356;&#36879;&#26126;&#30340;&#31243;&#24207;&#26469;&#20445;&#35777;&#31038;&#20250;&#21644;&#29615;&#22659;&#20445;&#25252;&#12290;
&lt;/p&gt;
&lt;p&gt;
Laws that govern land acquisition can lock in old paradigms. We study one such case, the Coal Bearing Areas Act of 1957 (CBAA) which provides minimal social and environmental safegaurds, and deviates in important ways from the Right to Fair Compensation and Transparency in Land Acquisition, Rehabilitation and Resettlement Act 2013 (LARR). The lack of due diligence protocol in the CBAA confers an undue comparative advantage to coal development, which is inconsistent with India's stance to phase down coal use, reduce air pollution, and advance modern sources of energy. We argue that the premise under which the CBAA was historically justified is no longer valid due to a significant change in the local context. Namely, the environmental and social costs of coal energy are far more salient and the market has cleaner energy alternatives that are cost competitive. We recommend updating land acquisition laws to bring coal under the general purview of LARR or, at minimum, amending the CBAA to e
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#36827;&#34892;&#35757;&#32451;&#21644;&#20132;&#26131;&#30340;&#26041;&#26696;&#65292;DeepStock&#36890;&#36807;&#26597;&#30475;&#32929;&#31080;&#20215;&#26684;&#30340;&#36807;&#21435;&#25968;&#25454;&#65292;&#24182;&#20351;&#29992;Resnet&#21644;logits&#26469;&#39044;&#27979;&#32929;&#31080;&#20215;&#26684;&#22312;&#26410;&#26469;D&#22825;&#20869;&#26159;&#21542;&#20250;&#21319;&#38477;&#19968;&#23450;&#30334;&#20998;&#27604;&#65292;&#24182;&#22312;&#38889;&#22269;&#21644;&#32654;&#22269;&#24066;&#22330;&#19978;&#21462;&#24471;&#20102;&#36229;&#36807;&#24066;&#22330;&#22238;&#25253;&#30340;&#21033;&#28070;&#12290;</title><link>http://arxiv.org/abs/2304.14870</link><description>&lt;p&gt;
Deep Stock: &#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#36827;&#34892;&#35757;&#32451;&#21644;&#20132;&#26131;&#30340;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
Deep Stock: training and trading scheme using deep learning. (arXiv:2304.14870v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.14870
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#36827;&#34892;&#35757;&#32451;&#21644;&#20132;&#26131;&#30340;&#26041;&#26696;&#65292;DeepStock&#36890;&#36807;&#26597;&#30475;&#32929;&#31080;&#20215;&#26684;&#30340;&#36807;&#21435;&#25968;&#25454;&#65292;&#24182;&#20351;&#29992;Resnet&#21644;logits&#26469;&#39044;&#27979;&#32929;&#31080;&#20215;&#26684;&#22312;&#26410;&#26469;D&#22825;&#20869;&#26159;&#21542;&#20250;&#21319;&#38477;&#19968;&#23450;&#30334;&#20998;&#27604;&#65292;&#24182;&#22312;&#38889;&#22269;&#21644;&#32654;&#22269;&#24066;&#22330;&#19978;&#21462;&#24471;&#20102;&#36229;&#36807;&#24066;&#22330;&#22238;&#25253;&#30340;&#21033;&#28070;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#26377;&#25928;&#24066;&#22330;&#20551;&#35828;&#23384;&#22312;&#65292;&#20294;&#35768;&#22810;&#30740;&#31350;&#34920;&#26126;&#32929;&#31080;&#24066;&#22330;&#23384;&#22312;&#22833;&#28789;&#29616;&#35937;&#65292;&#23548;&#33268;&#20986;&#29616;&#20102;&#19968;&#20123;&#33021;&#22815;&#33719;&#24471;&#36229;&#36807;&#24066;&#22330;&#22238;&#25253;&#30340;&#25216;&#26415;&#65292;&#21363;alpha&#12290;&#36817;&#20960;&#21313;&#24180;&#26469;&#65292;&#31995;&#32479;&#24615;&#20132;&#26131;&#24050;&#32463;&#21462;&#24471;&#20102;&#37325;&#22823;&#36827;&#23637;&#65292;&#28145;&#24230;&#23398;&#20064;&#20316;&#20026;&#20998;&#26512;&#21644;&#39044;&#27979;&#24066;&#22330;&#34892;&#20026;&#30340;&#24378;&#22823;&#24037;&#20855;&#24050;&#32463;&#24320;&#22987;&#23853;&#38706;&#22836;&#35282;&#12290;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21463;&#19987;&#19994;&#20132;&#26131;&#21592;&#21551;&#21457;&#30340;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#26597;&#30475;&#20808;&#21069;&#30340;600&#22825;&#30340;&#32929;&#31080;&#20215;&#26684;&#65292;&#24182;&#39044;&#27979;&#32929;&#31080;&#20215;&#26684;&#22312;&#25509;&#19979;&#26469;D&#22825;&#20869;&#26159;&#21542;&#20250;&#21319;&#38477;&#19968;&#23450;&#30334;&#20998;&#27604;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#31216;&#20026;DeepStock&#65292;&#20351;&#29992;Resnet&#30340;&#36339;&#36291;&#36830;&#25509;&#21644;logits&#26469;&#22686;&#21152;&#27169;&#22411;&#22312;&#20132;&#26131;&#26041;&#26696;&#20013;&#30340;&#27010;&#29575;&#12290;&#25105;&#20204;&#22312;&#38889;&#22269;&#21644;&#32654;&#22269;&#32929;&#31080;&#24066;&#22330;&#19978;&#27979;&#35797;&#20102;&#25105;&#20204;&#30340;&#27169;&#22411;&#65292;&#24182;&#22312;&#38889;&#22269;&#24066;&#22330;&#19978;&#33719;&#24471;&#20102;N&#65285;&#30340;&#21033;&#28070;&#65292;&#36229;&#36807;&#24066;&#22330;&#22238;&#25253;M&#65285;&#65292;&#24182;&#22312;&#32654;&#22269;&#24066;&#22330;&#19978;&#33719;&#24471;&#20102;A&#65285;&#30340;&#21033;&#28070;&#65292;&#36229;&#36807;&#24066;&#22330;&#22238;&#25253;B&#65285;&#12290;
&lt;/p&gt;
&lt;p&gt;
Despite the efficient market hypothesis, many studies suggest the existence of inefficiencies in the stock market, leading to the development of techniques to gain above-market returns, known as alpha. Systematic trading has undergone significant advances in recent decades, with deep learning emerging as a powerful tool for analyzing and predicting market behavior. In this paper, we propose a model inspired by professional traders that look at stock prices of the previous 600 days and predicts whether the stock price rises or falls by a certain percentage within the next D days. Our model, called DeepStock, uses Resnet's skip connections and logits to increase the probability of a model in a trading scheme. We test our model on both the Korean and US stock markets and achieve a profit of N\% on Korea market, which is M\% above the market return, and profit of A\% on US market, which is B\% above the market return.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20174;&#20449;&#24687;&#35770;&#30340;&#35282;&#24230;&#25506;&#35752;&#20102;&#26368;&#20248;&#21327;&#26041;&#24046;&#28165;&#38500;&#29702;&#35770;&#22312;&#37325;&#23614;&#20998;&#24067;&#19979;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2304.14098</link><description>&lt;p&gt;
&#20174;&#20449;&#24687;&#29702;&#35770;&#30340;&#35282;&#24230;&#25506;&#35752;&#37325;&#23614;&#20998;&#24067;&#19979;&#30340;&#26368;&#20248;&#21327;&#26041;&#24046;&#28165;&#38500;
&lt;/p&gt;
&lt;p&gt;
Optimal Covariance Cleaning for Heavy-Tailed Distributions: Insights from Information Theory. (arXiv:2304.14098v1 [cs.IT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.14098
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20174;&#20449;&#24687;&#35770;&#30340;&#35282;&#24230;&#25506;&#35752;&#20102;&#26368;&#20248;&#21327;&#26041;&#24046;&#28165;&#38500;&#29702;&#35770;&#22312;&#37325;&#23614;&#20998;&#24067;&#19979;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26368;&#20248;&#21327;&#26041;&#24046;&#28165;&#38500;&#29702;&#35770;&#20013;&#65292;&#26368;&#23567;&#21270;&#30495;&#23454;&#24635;&#20307;&#21327;&#26041;&#24046;&#30697;&#38453;&#19982;&#26059;&#36716;&#19981;&#21464;&#20272;&#35745;&#37327;&#20043;&#38388;&#30340;Frobenius&#33539;&#25968;&#26159;&#19968;&#20010;&#20851;&#38190;&#27493;&#39588;&#12290;&#21487;&#20197;&#22312;&#22823;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#28176;&#36827;&#24773;&#20917;&#19979;&#33719;&#24471;&#35813;&#20272;&#35745;&#37327;&#65292;&#32780;&#26080;&#38656;&#30693;&#36947;&#30495;&#23454;&#30340;&#21327;&#26041;&#24046;&#30697;&#38453;&#12290;&#26412;&#30740;&#31350;&#35777;&#26126;&#65292;&#23545;&#20110;&#27491;&#24577;&#22810;&#20803;&#21464;&#37327;&#65292;&#36825;&#31181;&#26368;&#23567;&#21270;&#38382;&#39064;&#31561;&#25928;&#20110;&#26368;&#23567;&#21270;&#30495;&#23454;&#24635;&#20307;&#21327;&#26041;&#24046;&#21644;&#26059;&#36716;&#19981;&#21464;&#20272;&#35745;&#37327;&#20043;&#38388;&#30340;&#20449;&#24687;&#25439;&#22833;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#23398;&#29983;t&#20998;&#24067;&#65292;&#22312;&#26377;&#38480;&#22823;&#23567;&#30340;&#30697;&#38453;&#20013;&#65292;&#26368;&#23567;&#21270;Frobenius&#33539;&#25968;&#24182;&#19981;&#19968;&#23450;&#33021;&#26368;&#23567;&#21270;&#20449;&#24687;&#25439;&#22833;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#22312;&#22823;&#30697;&#38453;&#30340;&#28176;&#36817;&#24773;&#20917;&#19979;&#65292;&#36825;&#31181;&#20559;&#24046;&#20250;&#28040;&#22833;&#65292;&#36825;&#21487;&#33021;&#20250;&#23558;&#38543;&#26426;&#30697;&#38453;&#29702;&#35770;&#30340;&#32467;&#26524;&#24212;&#29992;&#20110;&#23398;&#29983;t&#20998;&#24067;&#12290;&#36825;&#20123;&#20998;&#24067;&#20855;&#26377;&#37325;&#23614;&#29305;&#24449;&#65292;&#22312;&#37329;&#34701;&#12289;&#28237;&#27969;&#25110;&#26680;&#29289;&#29702;&#31561;&#23454;&#38469;&#24212;&#29992;&#20013;&#32463;&#24120;&#36935;&#21040;&#12290;
&lt;/p&gt;
&lt;p&gt;
In optimal covariance cleaning theory, minimizing the Frobenius norm between the true population covariance matrix and a rotational invariant estimator is a key step. This estimator can be obtained asymptotically for large covariance matrices, without knowledge of the true covariance matrix. In this study, we demonstrate that this minimization problem is equivalent to minimizing the loss of information between the true population covariance and the rotational invariant estimator for normal multivariate variables. However, for Student's t distributions, the minimal Frobenius norm does not necessarily minimize the information loss in finite-sized matrices. Nevertheless, such deviations vanish in the asymptotic regime of large matrices, which might extend the applicability of random matrix theory results to Student's t distributions. These distributions are characterized by heavy tails and are frequently encountered in real-world applications such as finance, turbulence, or nuclear physic
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#34920;&#26126;&#65292;&#27668;&#20505;&#19981;&#30830;&#23450;&#24615;&#26159;&#23548;&#33268;&#30899;&#31038;&#20250;&#25104;&#26412;&#21644;&#26368;&#20248;CO$_2$&#20943;&#25490;&#37327;&#33539;&#22260;&#21464;&#21270;&#30340;&#20851;&#38190;&#22240;&#32032;&#65292;&#20943;&#23569;&#27668;&#20505;&#19981;&#30830;&#23450;&#24615;&#21487;&#20197;&#25913;&#36827;&#20943;&#25490;&#25237;&#20837;&#30340;&#25104;&#26412;&#35745;&#31639;&#65292;&#21516;&#26102;&#20063;&#25351;&#20986;&#20102;&#27668;&#20505;&#21644;&#25490;&#25918;&#20043;&#38388;&#32570;&#22833;&#30340;&#21453;&#39304;&#12290;</title><link>http://arxiv.org/abs/2304.08957</link><description>&lt;p&gt;
&#27668;&#20505;&#19981;&#30830;&#23450;&#24615;&#23545;&#26368;&#20339;&#20943;&#25490;&#36335;&#24452;&#21644;&#30899;&#31038;&#20250;&#25104;&#26412;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Climate uncertainty impacts on optimal mitigation pathways and social cost of carbon. (arXiv:2304.08957v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.08957
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#34920;&#26126;&#65292;&#27668;&#20505;&#19981;&#30830;&#23450;&#24615;&#26159;&#23548;&#33268;&#30899;&#31038;&#20250;&#25104;&#26412;&#21644;&#26368;&#20248;CO$_2$&#20943;&#25490;&#37327;&#33539;&#22260;&#21464;&#21270;&#30340;&#20851;&#38190;&#22240;&#32032;&#65292;&#20943;&#23569;&#27668;&#20505;&#19981;&#30830;&#23450;&#24615;&#21487;&#20197;&#25913;&#36827;&#20943;&#25490;&#25237;&#20837;&#30340;&#25104;&#26412;&#35745;&#31639;&#65292;&#21516;&#26102;&#20063;&#25351;&#20986;&#20102;&#27668;&#20505;&#21644;&#25490;&#25918;&#20043;&#38388;&#32570;&#22833;&#30340;&#21453;&#39304;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27668;&#20505;&#25919;&#31574;&#20998;&#26512;&#20013;&#30340;&#25490;&#25918;&#36335;&#24452;&#36890;&#24120;&#26469;&#33258;&#32508;&#21512;&#35780;&#20272;&#27169;&#22411;(IAMs)&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#25490;&#25918;&#36335;&#24452;&#36890;&#24120;&#19981;&#32771;&#34385;&#27668;&#20505;&#23545;&#31038;&#20250;&#32463;&#27982;&#31995;&#32479;&#30340;&#21453;&#39304;&#20316;&#29992;&#65292;&#22240;&#27492;&#20063;&#27809;&#26377;&#32771;&#34385;&#27668;&#20505;&#19981;&#30830;&#23450;&#24615;&#12290;&#26412;&#25991;&#34920;&#26126;&#65292;&#20165;&#20165;&#27668;&#20505;&#19981;&#30830;&#23450;&#24615;&#23601;&#26174;&#33879;&#22320;&#25913;&#21464;&#20102;&#26368;&#20248;CO$_2$&#20943;&#25490;&#37327;&#25104;&#26412;&#25928;&#30410;&#65292;&#23545;&#20110;&#19968;&#32452;&#38480;&#21046;&#21319;&#28201;&#22312;1.5&#25668;&#27663;&#24230;&#20197;&#19979;&#20302;&#36229;&#28201;&#24230;&#25511;&#21046;&#24773;&#26223;&#65292;2050&#24180;&#30340;&#20943;&#25490;&#37327;&#21464;&#21270;&#33539;&#22260;&#22312;-14&#21040;+12 GtCO$_2$ yr$^{-1}$&#20043;&#38388;&#12290;&#27492;&#24773;&#26223;&#19979;&#65292;&#30899;&#31038;&#20250;&#25104;&#26412;&#30340;&#33539;&#22260;&#21464;&#21270;&#36798;&#21040;&#20102;&#20116;&#20493;&#12290;&#24179;&#34913;&#27668;&#20505;&#25935;&#24863;&#24615;(ECS)&#21644;&#29616;&#26377;&#27668;&#28342;&#33014;&#36752;&#23556;&#24378;&#24230;&#26159;&#30899;&#31038;&#20250;&#25104;&#26412;&#21644;&#20013;&#19990;&#32426;&#26368;&#20339;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#30340;&#24378;&#28872;&#20915;&#23450;&#22240;&#32032;&#12290;&#36825;&#34920;&#26126;&#65292;&#20943;&#23569;&#27668;&#20505;&#19981;&#30830;&#23450;&#24615;&#21487;&#20197;&#31934;&#30830;&#35745;&#31639;&#20943;&#25490;&#25237;&#20837;&#30340;&#25104;&#26412;&#65292;&#21516;&#26102;&#20063;&#25351;&#20986;&#20102;&#27668;&#20505;&#21644;&#25490;&#25918;&#20043;&#38388;&#32570;&#22833;&#30340;&#21453;&#39304;&#12290;
&lt;/p&gt;
&lt;p&gt;
Emissions pathways used in climate policy analysis are often derived from integrated assessment models (IAMs). However, such emissions pathways do not typically include climate feedbacks on socioeconomic systems and by extension do not consider climate uncertainty in their construction. Here we show that climate uncertainty alone significantly changes the cost-benefit optimal CO$_2$ emissions, varying from -14 to +12 GtCO$_2$ yr$^{-1}$ in 2050 (5-95% range) for an ensemble of scenarios that limit warming to 1.5{\deg}C with low overshoot. Climate uncertainty is also responsible for a factor of five range in the social cost of carbon (SCC) in this scenario ensemble. Equilibrium climate sensitivity (ECS) and the strength of present-day aerosol radiative forcing are strong determinants of SCC and optimal mid-century CO$_2$ emissions. This confirms that reducing climate uncertainty can refine cost-optimal emissions projections, and points to a missing feedback between climate and emissions 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#23545;ChatGPT&#22312;&#32929;&#31080;&#39044;&#27979;&#26041;&#38754;&#36827;&#34892;&#20102;&#38646;&#26679;&#26412;&#20998;&#26512;&#65292;&#32467;&#26524;&#34920;&#26126;&#20854;&#39044;&#27979;&#32929;&#31080;&#31227;&#21160;&#30340;&#34920;&#29616;&#19981;&#22914;&#26368;&#20808;&#36827;&#21644;&#20256;&#32479;&#26041;&#27861;&#65292;&#38656;&#35201;&#36827;&#19968;&#27493;&#25913;&#36827;&#12290;</title><link>http://arxiv.org/abs/2304.05351</link><description>&lt;p&gt;
ChatGPT&#22312;&#22810;&#27169;&#24577;&#32929;&#31080;&#39044;&#27979;&#25361;&#25112;&#20013;&#30340;&#38646;&#26679;&#26412;&#20998;&#26512;&#65306;&#21326;&#23572;&#34903;&#26032;&#25163;&#65311;
&lt;/p&gt;
&lt;p&gt;
The Wall Street Neophyte: A Zero-Shot Analysis of ChatGPT Over MultiModal Stock Movement Prediction Challenges. (arXiv:2304.05351v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.05351
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23545;ChatGPT&#22312;&#32929;&#31080;&#39044;&#27979;&#26041;&#38754;&#36827;&#34892;&#20102;&#38646;&#26679;&#26412;&#20998;&#26512;&#65292;&#32467;&#26524;&#34920;&#26126;&#20854;&#39044;&#27979;&#32929;&#31080;&#31227;&#21160;&#30340;&#34920;&#29616;&#19981;&#22914;&#26368;&#20808;&#36827;&#21644;&#20256;&#32479;&#26041;&#27861;&#65292;&#38656;&#35201;&#36827;&#19968;&#27493;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#65292;&#22914;ChatGPT&#36825;&#26679;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#21508;&#31181;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#20219;&#21153;&#20013;&#23637;&#31034;&#20102;&#24778;&#20154;&#30340;&#24615;&#33021;&#12290;&#28982;&#32780;&#65292;&#22312;&#39044;&#27979;&#32929;&#24066;&#36208;&#21183;&#26041;&#38754;&#65292;&#23427;&#20204;&#30340;&#26377;&#25928;&#24615;&#20173;&#28982;&#26377;&#24453;&#25506;&#32034;&#12290;&#26412;&#25991;&#36890;&#36807;&#19977;&#20010;&#25512;&#25991;&#21644;&#21382;&#21490;&#32929;&#31080;&#20215;&#26684;&#25968;&#25454;&#38598;&#30340;&#24191;&#27867;&#38646;&#26679;&#26412;&#20998;&#26512;&#65292;&#25506;&#35752;&#20102;ChatGPT&#22312;&#22810;&#27169;&#24577;&#32929;&#31080;&#31227;&#21160;&#39044;&#27979;&#26041;&#38754;&#30340;&#33021;&#21147;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#34920;&#26126;&#65292;ChatGPT&#26159;&#19968;&#20010;&#8220;&#21326;&#23572;&#34903;&#26032;&#25163;&#8221;&#65292;&#22312;&#39044;&#27979;&#32929;&#31080;&#31227;&#21160;&#26041;&#38754;&#30340;&#25104;&#21151;&#26377;&#38480;&#65292;&#19981;&#20165;&#19981;&#22914;&#26368;&#20808;&#36827;&#30340;&#26041;&#27861;&#65292;&#32780;&#19988;&#19981;&#22914;&#20351;&#29992;&#20215;&#26684;&#29305;&#24449;&#30340;&#32447;&#24615;&#22238;&#24402;&#36825;&#26679;&#30340;&#20256;&#32479;&#26041;&#27861;&#12290;&#23613;&#31649;&#24605;&#32500;&#38142;&#25552;&#31034;&#31574;&#30053;&#21644;&#25512;&#25991;&#30340;&#21253;&#21547;&#20855;&#26377;&#28508;&#22312;&#30340;&#20248;&#21183;&#65292;ChatGPT&#30340;&#34920;&#29616;&#20173;&#28982;&#19981;&#20339;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;&#23427;&#30340;&#21487;&#35299;&#37322;&#24615;&#21644;&#31283;&#23450;&#24615;&#23384;&#22312;&#23616;&#38480;&#24615;&#65292;&#38656;&#35201;&#26356;&#19987;&#19994;&#30340;&#35757;&#32451;&#25110;&#24494;&#35843;&#12290;&#36825;&#39033;&#30740;&#31350;&#25552;&#20379;&#20102;&#26377;&#20851;ChatGPT&#22312;&#32929;&#31080;&#39044;&#27979;&#26041;&#38754;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recently, large language models (LLMs) like ChatGPT have demonstrated remarkable performance across a variety of natural language processing tasks. However, their effectiveness in the financial domain, specifically in predicting stock market movements, remains to be explored. In this paper, we conduct an extensive zero-shot analysis of ChatGPT's capabilities in multimodal stock movement prediction, on three tweets and historical stock price datasets. Our findings indicate that ChatGPT is a "Wall Street Neophyte" with limited success in predicting stock movements, as it underperforms not only state-of-the-art methods but also traditional methods like linear regression using price features. Despite the potential of Chain-of-Thought prompting strategies and the inclusion of tweets, ChatGPT's performance remains subpar. Furthermore, we observe limitations in its explainability and stability, suggesting the need for more specialized training or fine-tuning. This research provides insights i
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#38750;&#36127;&#38543;&#26426;&#21464;&#37327;&#38598;&#21512;&#30340;&#21452;&#26497;&#23450;&#29702;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#65292;&#25193;&#23637;&#21644;&#32479;&#19968;&#20102;&#29616;&#26377;&#30340;&#22312;&#24378;&#20581;&#26694;&#26550;&#19978;&#35777;&#26126;&#30340;&#21452;&#26497;&#23450;&#29702;&#12290;</title><link>http://arxiv.org/abs/2212.14259</link><description>&lt;p&gt;
&#38750;&#36127;&#38543;&#26426;&#21464;&#37327;&#38598;&#21512;&#30340;&#21452;&#26497;&#23450;&#29702;
&lt;/p&gt;
&lt;p&gt;
Bipolar Theorems for Sets of Non-negative Random Variables. (arXiv:2212.14259v2 [math.PR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.14259
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#38750;&#36127;&#38543;&#26426;&#21464;&#37327;&#38598;&#21512;&#30340;&#21452;&#26497;&#23450;&#29702;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#65292;&#25193;&#23637;&#21644;&#32479;&#19968;&#20102;&#29616;&#26377;&#30340;&#22312;&#24378;&#20581;&#26694;&#26550;&#19978;&#35777;&#26126;&#30340;&#21452;&#26497;&#23450;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20551;&#35774;&#19968;&#20010;&#24378;&#20581;&#30340;&#12289;&#19968;&#33324;&#19981;&#34987;&#25903;&#37197;&#30340;&#27010;&#29575;&#26694;&#26550;&#65292;&#24182;&#20026;&#38750;&#36127;&#38543;&#26426;&#21464;&#37327;&#30340;&#25152;&#26377;&#20934;&#30830;&#31561;&#20215;&#31867;&#30340;&#23376;&#38598;&#25552;&#20379;&#21452;&#26497;&#34920;&#31034;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#65292;&#32780;&#19981;&#38656;&#35201;&#23545;&#22522;&#30784;&#27979;&#24230;&#31354;&#38388;&#20570;&#36827;&#19968;&#27493;&#30340;&#38480;&#21046;&#12290;&#36825;&#25193;&#23637;&#21644;&#32479;&#19968;&#20102;&#29616;&#26377;&#30340;&#22312;&#24378;&#20581;&#26694;&#26550;&#19978;&#35777;&#26126;&#30340;&#21452;&#26497;&#23450;&#29702;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#27010;&#36848;&#20102;&#22312;&#25968;&#23398;&#37329;&#34701;&#21644;&#36816;&#36755;&#38382;&#39064;&#20013;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper assumes a robust, in general not dominated, probabilistic framework and provides necessary and sufficient conditions for a bipolar representation of subsets of the set of all quasi-sure equivalence classes of non-negative random variables without any further conditions on the underlying measure space. This generalises and unifies existing bipolar theorems proved under stronger assumptions on the robust framework. Moreover, we sketch applications to issues in mathematical finance and a mass transport type duality.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#26500;&#24314;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#38598;&#35013;&#31665;&#36816;&#36755;&#34892;&#19994;&#25968;&#25454;&#38598;&#65292;&#21033;&#29992;&#35813;&#25968;&#25454;&#38598;&#20998;&#26512;&#20102;&#34892;&#19994;&#21160;&#24577;&#21644;&#38598;&#35013;&#31665;&#21361;&#26426;&#65292;&#24182;&#25581;&#31034;&#20102;&#36816;&#36755;&#32852;&#30431;&#23849;&#28291;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2211.16292</link><description>&lt;p&gt;
&#20174;1966&#24180;&#24320;&#22987;&#30340;&#32479;&#19968;&#38598;&#35013;&#31665;&#36816;&#36755;&#34892;&#19994;&#25968;&#25454;&#65306;&#36135;&#36816;&#29575;&#12289;&#36816;&#36755;&#37327;&#12289;&#26032;&#24314;&#12289;&#20108;&#25163;&#21644;&#25253;&#24223;&#20215;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;
Unified Container Shipping Industry Data From 1966: Freight Rate, Shipping Quantity, Newbuilding, Secondhand, and Scrap Price. (arXiv:2211.16292v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.16292
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26500;&#24314;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#38598;&#35013;&#31665;&#36816;&#36755;&#34892;&#19994;&#25968;&#25454;&#38598;&#65292;&#21033;&#29992;&#35813;&#25968;&#25454;&#38598;&#20998;&#26512;&#20102;&#34892;&#19994;&#21160;&#24577;&#21644;&#38598;&#35013;&#31665;&#21361;&#26426;&#65292;&#24182;&#25581;&#31034;&#20102;&#36816;&#36755;&#32852;&#30431;&#23849;&#28291;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#26032;&#30340;&#32479;&#19968;&#38754;&#26495;&#25968;&#25454;&#38598;&#65292;&#23558;&#20845;&#20010;&#20027;&#35201;&#33322;&#32447;&#30340;&#36335;&#32447;-&#24180;&#32423;&#36135;&#36816;&#29575;&#19982;&#36816;&#36755;&#37327;&#20197;&#21450;1966&#24180;&#33267;2009&#24180;&#30340;&#34892;&#19994;-&#24180;&#32423;&#26032;&#24314;&#12289;&#20108;&#25163;&#21644;&#25253;&#24223;&#20215;&#26684;&#30456;&#32467;&#21512;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#35814;&#32454;&#30340;&#25968;&#25454;&#21512;&#24182;&#35828;&#26126;&#65292;&#24182;&#30001;&#34892;&#19994;&#19987;&#23478;&#21644;&#26377;&#21382;&#21490;&#30693;&#35782;&#21644;&#32463;&#39564;&#30340;&#21069;&#39640;&#31649;&#39564;&#35777;&#20102;&#25968;&#25454;&#30340;&#19968;&#33268;&#24615;&#12290;&#21033;&#29992;&#36825;&#20010;&#25968;&#25454;&#38598;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#34987;&#31216;&#20026;&#38598;&#35013;&#31665;&#21361;&#26426;&#30340;&#34892;&#19994;&#21160;&#24577;&#30340;&#23450;&#37327;&#21644;&#25551;&#36848;&#24615;&#20998;&#26512;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#27599;&#20010;&#21464;&#37327;&#30340;&#32467;&#26500;&#24615;&#36716;&#25240;&#28857;&#65292;&#20197;&#23637;&#31034;&#36816;&#36755;&#32852;&#30431;&#23849;&#28291;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
We construct a new unified panel dataset that combines route-year-level freight rates with shipping quantities for the six major routes and industry-year-level newbuilding, secondhand, and scrap prices from 1966 (the beginning of the industry) to 2009. We offer detailed instructions on how to merge various datasets and validate the data's consistency by industry experts and former executives who have historical knowledge and experience. Using this dataset, we provide a quantitative and descriptive analysis of the industry dynamics known as the container crisis. Finally, we identify structural breaks for each variable to demonstrate the impact of the shipping cartels' collapse.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20197;Aave&#20026;&#20363;&#30340;&#22522;&#20110;&#21306;&#22359;&#38142;&#30340;&#20511;&#36151;&#21327;&#35758;&#20013;&#30340;&#27969;&#21160;&#24615;&#39118;&#38505;&#65292;&#24182;&#25552;&#20986;&#20102;&#34913;&#37327;&#26041;&#27861;&#12290;&#23545;&#20110;LPs&#26469;&#35828;&#65292;&#29992;&#25143;&#24544;&#35802;&#24230;&#26159;&#19968;&#25226;&#21452;&#20995;&#21073;&#12290;</title><link>http://arxiv.org/abs/2206.11973</link><description>&lt;p&gt;
&#22522;&#20110;&#21306;&#22359;&#38142;&#30340;&#20511;&#36151;&#21327;&#35758;&#20013;&#30340;&#27969;&#21160;&#24615;&#39118;&#38505;&#65306;&#20197;Aave&#21327;&#35758;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
Liquidity Risks in Lending Protocols: Evidence from Aave Protocol. (arXiv:2206.11973v4 [q-fin.RM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.11973
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20197;Aave&#20026;&#20363;&#30340;&#22522;&#20110;&#21306;&#22359;&#38142;&#30340;&#20511;&#36151;&#21327;&#35758;&#20013;&#30340;&#27969;&#21160;&#24615;&#39118;&#38505;&#65292;&#24182;&#25552;&#20986;&#20102;&#34913;&#37327;&#26041;&#27861;&#12290;&#23545;&#20110;LPs&#26469;&#35828;&#65292;&#29992;&#25143;&#24544;&#35802;&#24230;&#26159;&#19968;&#25226;&#21452;&#20995;&#21073;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20511;&#36151;&#21327;&#35758;&#65288;LPs&#65289;&#20316;&#20026;&#22522;&#20110;&#21306;&#22359;&#38142;&#30340;&#20511;&#36151;&#31995;&#32479;&#65292;&#20801;&#35768;&#20219;&#20309;&#20154;&#20511;&#36151;&#21152;&#23494;&#36135;&#24065;&#12290;&#28982;&#32780;&#65292;&#24403;&#19968;&#32452;&#29305;&#23450;&#30340;&#20511;&#27454;&#20154;&#21551;&#21160;&#26174;&#30524;&#30340;&#36151;&#27454;&#26102;&#65292;&#27969;&#21160;&#24615;&#39118;&#38505;&#21487;&#33021;&#20250;&#21457;&#29983;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#34913;&#37327;LPs&#20013;&#27969;&#21160;&#24615;&#39118;&#38505;&#30340;&#26041;&#27861;&#65292;&#37325;&#28857;&#20851;&#27880;&#21487;&#29992;&#27969;&#21160;&#24615;&#21644;&#24066;&#22330;&#38598;&#20013;&#24230;&#12290;&#36890;&#36807;&#20197;Aave&#20026;&#26696;&#20363;&#30740;&#31350;&#65292;&#25105;&#20204;&#21457;&#29616;&#27969;&#21160;&#24615;&#39118;&#38505;&#38750;&#24120;&#19981;&#31283;&#23450;&#65292;&#24182;&#23545;Aave&#20135;&#29983;&#22797;&#26434;&#30340;&#24433;&#21709;&#65292;&#32780;Aave&#30340;&#27969;&#21160;&#24615;&#21487;&#33021;&#20250;&#24433;&#21709;&#38142;&#19978;&#20511;&#36151;&#24066;&#22330;&#12290;&#19982;&#26032;&#29992;&#25143;&#30456;&#27604;&#65292;&#21453;&#22797;&#20511;&#20837;&#21152;&#23494;&#36135;&#24065;&#30340;&#23450;&#26399;&#29992;&#25143;&#21487;&#33021;&#20250;&#23545;Aave&#21327;&#35758;&#20135;&#29983;&#36127;&#38754;&#24433;&#21709;&#65292;&#36825;&#24847;&#21619;&#30528;&#29992;&#25143;&#24544;&#35802;&#24230;&#23545;LPs&#26469;&#35828;&#26159;&#19968;&#25226;&#21452;&#20995;&#21073;&#12290;
&lt;/p&gt;
&lt;p&gt;
Lending Protocols (LPs), as blockchain-based lending systems, allow any agents to borrow and lend cryptocurrencies. However, liquidity risks could occur, especially when salient loans are initiated by a particular group of borrowers. This paper proposes measurements of liquidity risks, focusing on both available liquidity and market concentration in LPs. By using Aave as a case study, we find that liquidity risks are highly volatile and show complex effects on Aave, and liquidity in Aave may affect across on-chain lending market. Compared to new users, regular users that repeatedly borrow cryptocurrencies may negatively affect Aave protocol, implying that user loyalty is a double-edged sword for LPs.
&lt;/p&gt;</description></item></channel></rss>