<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#36825;&#31687;&#35770;&#25991;&#22312;&#19968;&#20010;&#32479;&#19968;&#30340;&#32463;&#27982;&#26694;&#26550;&#20013;&#35770;&#36848;&#20102;&#20840;&#29699;&#32463;&#27982;&#31209;&#24207;&#38754;&#20020;&#30340;&#20851;&#38190;&#25361;&#25112;&#65292;&#21253;&#25324;&#21435;&#20840;&#29699;&#21270;&#12289;&#20840;&#29699;&#21512;&#20316;&#26085;&#30410;&#19981;&#21487;&#34892;&#20197;&#21450;&#22823;&#22269;&#31454;&#20105;&#30340;&#23545;&#25239;&#24615;&#29305;&#24449;&#12290;&#36890;&#36807;&#30740;&#31350;&#21457;&#29616;&#65292;&#33258;&#31169;&#30340;&#22269;&#23478;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#21487;&#20197;&#20419;&#36827;&#21452;&#36194;&#32467;&#26524;&#65292;&#20294;&#20063;&#23384;&#22312;&#21490;&#35799;&#32423;&#22833;&#36133;&#22343;&#34913;&#30340;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2310.18052</link><description>&lt;p&gt;
&#20840;&#29699;&#32463;&#27982;&#31209;&#24207;&#20013;&#30340;&#32463;&#27982;&#23398;&#65306;&#21490;&#35799;&#32423;&#22833;&#36133;&#22343;&#34913;&#30340;&#24754;&#21095;
&lt;/p&gt;
&lt;p&gt;
Economics for the Global Economic Order: The Tragedy of Epic Fail Equilibria. (arXiv:2310.18052v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.18052
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#22312;&#19968;&#20010;&#32479;&#19968;&#30340;&#32463;&#27982;&#26694;&#26550;&#20013;&#35770;&#36848;&#20102;&#20840;&#29699;&#32463;&#27982;&#31209;&#24207;&#38754;&#20020;&#30340;&#20851;&#38190;&#25361;&#25112;&#65292;&#21253;&#25324;&#21435;&#20840;&#29699;&#21270;&#12289;&#20840;&#29699;&#21512;&#20316;&#26085;&#30410;&#19981;&#21487;&#34892;&#20197;&#21450;&#22823;&#22269;&#31454;&#20105;&#30340;&#23545;&#25239;&#24615;&#29305;&#24449;&#12290;&#36890;&#36807;&#30740;&#31350;&#21457;&#29616;&#65292;&#33258;&#31169;&#30340;&#22269;&#23478;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#21487;&#20197;&#20419;&#36827;&#21452;&#36194;&#32467;&#26524;&#65292;&#20294;&#20063;&#23384;&#22312;&#21490;&#35799;&#32423;&#22833;&#36133;&#22343;&#34913;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#19968;&#20010;&#32479;&#19968;&#30340;&#32463;&#27982;&#26694;&#26550;&#20013;&#38416;&#36848;&#20102;&#20840;&#29699;&#32463;&#27982;&#31209;&#24207;&#38754;&#20020;&#30340;&#19968;&#20123;&#20851;&#38190;&#25361;&#25112;&#65306;&#21435;&#20840;&#29699;&#21270;&#12289;&#20840;&#29699;&#21512;&#20316;&#26085;&#30410;&#19981;&#21487;&#34892;&#20197;&#21450;&#22823;&#22269;&#31454;&#20105;&#26085;&#30410;&#23545;&#25239;&#24615;&#30340;&#29305;&#24449;&#12290;&#22312;&#36825;&#20123;&#25361;&#25112;&#20013;&#65292;&#32463;&#27982;&#23398;&#24050;&#32463;&#34987;&#21033;&#29992;&#26469;&#26381;&#21153;&#20110;&#22269;&#23478;&#21033;&#30410;&#12290;&#36825;&#24182;&#19981;&#19968;&#23450;&#26159;&#20214;&#22351;&#20107;&#12290;&#21382;&#21490;&#19978;&#26377;&#19968;&#20123;&#20363;&#23376;&#34920;&#26126;&#65292;&#24403;&#22269;&#23478;&#21482;&#36861;&#27714;&#33258;&#36523;&#21033;&#30410;&#26102;&#65292;&#26356;&#24320;&#25918;&#21644;&#33258;&#30001;&#30340;&#36152;&#26131;&#21487;&#33021;&#20250;&#20986;&#29616;&#12290;&#20294;&#26159;&#65292;&#26412;&#25991;&#20013;&#25551;&#36848;&#30340;&#24773;&#20917;&#32473;&#20986;&#20102;&#19968;&#20123;&#28151;&#21512;&#20449;&#21495;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#19968;&#20123;&#21457;&#23637;&#30830;&#23454;&#20307;&#29616;&#20102;&#23545;&#32463;&#27982;&#21644;&#25919;&#27835;&#21442;&#19982;&#26085;&#30410;&#22686;&#38271;&#30340;&#38646;&#21644;&#24863;&#30693;&#12290;&#28982;&#32780;&#65292;&#20165;&#20165;&#20381;&#38752;&#38646;&#21644;&#35299;&#37322;&#26159;&#26126;&#26174;&#19981;&#20805;&#20998;&#30340;&#12290;&#33258;&#31169;&#30340;&#22269;&#23478;&#65292;&#21363;&#20351;&#30456;&#20449;&#19990;&#30028;&#26159;&#38646;&#21644;&#30340;&#65292;&#20063;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#20135;&#29983;&#20102;&#20351;&#27599;&#20010;&#20154;&#21463;&#30410;&#30340;&#32467;&#26524;&#12290;&#22312;&#20854;&#20182;&#24773;&#20917;&#19979;&#65292;&#23436;&#20840;&#21487;&#20197;&#39044;&#27979;&#21040;&#30340;&#25439;&#22833;&#21364;&#23548;&#33268;&#20102;&#25152;&#26377;&#26041;&#38754;&#30340;&#22833;&#36133;&#12290;&#36825;&#31181;&#21452;&#36755;&#30340;&#32467;&#26524;&#23601;&#26159;&#21490;&#35799;&#32423;&#22833;&#36133;&#22343;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper casts within a unified economic framework some key challenges for the global economic order: de-globalization; the rising impracticability of global cooperation; and the increasingly confrontational nature of Great Power competition. In these, economics has been weaponised in the service of national interest. This need be no bad thing. History provides examples where greater openness and freer trade emerge from nations seeking only to advance their own self-interests. But the cases described in the paper provide mixed signals. We find that some developments do draw on a growing zero-sum perception to economic and political engagement. That zero-sum explanation alone, however, is crucially inadequate. Self-serving nations, even when believing the world zero-sum, have under certain circumstances produced outcomes that have benefited all. In other circumstances, perfectly-predicted losses have instead resulted on all sides. Such lose-lose outcomes -- epic fail equilibria -gen
&lt;/p&gt;</description></item><item><title>&#38463;&#22982;&#26031;&#29305;&#20025;&#21442;&#19982;&#24615;&#39044;&#31639;&#30340;&#23454;&#35777;&#20998;&#26512;&#30740;&#31350;&#20102;&#36138;&#23146;&#25104;&#26412;&#31119;&#21033;&#35268;&#21017;&#21644;&#24179;&#31561;&#20221;&#39069;&#26041;&#27861;&#30340;&#27604;&#36739;&#65292;&#24182;&#21457;&#29616;&#24179;&#31561;&#20221;&#39069;&#26041;&#27861;&#22312;&#25152;&#26377;&#20844;&#24179;&#27010;&#24565;&#19978;&#34920;&#29616;&#26356;&#22909;&#12290;&#36825;&#39033;&#30740;&#31350;&#20026;&#24179;&#31561;&#20221;&#39069;&#26041;&#27861;&#25552;&#20379;&#20102;&#27969;&#34892;&#21644;&#21487;&#35270;&#21270;&#30340;&#35299;&#37322;&#12290;</title><link>http://arxiv.org/abs/2310.18033</link><description>&lt;p&gt;
&#38463;&#22982;&#26031;&#29305;&#20025;&#21442;&#19982;&#24615;&#39044;&#31639;&#30340;&#23454;&#35777;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
An Empirical Analysis of Participatory Budgeting in Amsterdam. (arXiv:2310.18033v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.18033
&lt;/p&gt;
&lt;p&gt;
&#38463;&#22982;&#26031;&#29305;&#20025;&#21442;&#19982;&#24615;&#39044;&#31639;&#30340;&#23454;&#35777;&#20998;&#26512;&#30740;&#31350;&#20102;&#36138;&#23146;&#25104;&#26412;&#31119;&#21033;&#35268;&#21017;&#21644;&#24179;&#31561;&#20221;&#39069;&#26041;&#27861;&#30340;&#27604;&#36739;&#65292;&#24182;&#21457;&#29616;&#24179;&#31561;&#20221;&#39069;&#26041;&#27861;&#22312;&#25152;&#26377;&#20844;&#24179;&#27010;&#24565;&#19978;&#34920;&#29616;&#26356;&#22909;&#12290;&#36825;&#39033;&#30740;&#31350;&#20026;&#24179;&#31561;&#20221;&#39069;&#26041;&#27861;&#25552;&#20379;&#20102;&#27969;&#34892;&#21644;&#21487;&#35270;&#21270;&#30340;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#20351;&#29992;&#38463;&#22982;&#26031;&#29305;&#20025;35&#20010;&#21442;&#19982;&#24615;&#39044;&#31639;&#23454;&#20363;&#30340;&#25968;&#25454;&#65292;&#25105;&#20204;&#23454;&#35777;&#27604;&#36739;&#20102;&#20004;&#31181;&#19981;&#21516;&#30340;&#21442;&#19982;&#24615;&#39044;&#31639;&#35268;&#21017;&#65306;&#36138;&#23146;&#25104;&#26412;&#31119;&#21033;&#35268;&#21017;&#21644;&#24179;&#31561;&#20221;&#39069;&#26041;&#27861;&#12290;&#25105;&#20204;&#37327;&#21270;&#20102;&#36825;&#20123;&#35268;&#21017;&#22312;&#27604;&#20363;&#12289;&#24179;&#31561;&#21644;&#20844;&#24179;&#24615;&#27010;&#24565;&#19978;&#30340;&#34920;&#29616;&#65292;&#24182;&#24471;&#20986;&#32467;&#35770;&#65292;&#23613;&#31649;&#22312;&#24635;&#20307;&#36873;&#27665;&#28385;&#24847;&#24230;&#19978;&#20184;&#20986;&#36739;&#23567;&#20195;&#20215;&#65292;&#24179;&#31561;&#20221;&#39069;&#26041;&#27861;&#22312;&#25152;&#26377;&#30740;&#31350;&#30340;&#20844;&#24179;&#27010;&#24565;&#19978;&#34920;&#29616;&#26356;&#22909;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36827;&#19968;&#27493;&#25552;&#20379;&#20102;&#24179;&#31561;&#20221;&#39069;&#26041;&#27861;&#30340;&#27969;&#34892;&#21644;&#21487;&#35270;&#21270;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;
Using data from 35 Participatory Budgeting instances in Amsterdam, we empirically compare two different Participatory Budgeting rules: the greedy cost welfare rule and the Method of Equal Shares. We quantify how proportional, equal and fair the rules are and conclude that, for a small price in total voter satisfaction, the Method of Equal Shares performs better on all notions of fairness studied. We further provide a popular and a visual explanation of the Method of Equal Shares.
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25506;&#32034;&#20102;&#20351;&#29992;&#29983;&#25104;&#22411;&#20154;&#24037;&#26234;&#33021;&#24037;&#20855;&#24110;&#21161;&#25237;&#36164;&#32773;&#25581;&#31034;&#20225;&#19994;&#39118;&#38505;&#30340;&#20215;&#20540;&#65292;&#36890;&#36807;&#20174;&#25910;&#30410;&#30005;&#35805;&#30340;&#19978;&#19979;&#25991;&#20013;&#29983;&#25104;&#39118;&#38505;&#25688;&#35201;&#21644;&#35780;&#20272;&#65292;&#36825;&#20123;&#22522;&#20110;GPT&#30340;&#24230;&#37327;&#20855;&#26377;&#26174;&#33879;&#30340;&#20449;&#24687;&#20869;&#23481;&#65292;&#33021;&#22815;&#39044;&#27979;&#20225;&#19994;&#23618;&#38754;&#27874;&#21160;&#24615;&#21644;&#25237;&#36164;&#21019;&#26032;&#36873;&#25321;&#12290;&#27492;&#22806;&#65292;&#29983;&#25104;&#22411;&#20154;&#24037;&#26234;&#33021;&#36824;&#33021;&#26377;&#25928;&#26816;&#27979;&#26032;&#20852;&#39118;&#38505;&#65292;&#24182;&#19988;&#36825;&#20123;&#24230;&#37327;&#22312;&#32929;&#26435;&#24066;&#22330;&#20013;&#36215;&#21040;&#23450;&#20215;&#20316;&#29992;&#12290;</title><link>http://arxiv.org/abs/2310.17721</link><description>&lt;p&gt;
&#20174;&#35762;&#35805;&#25991;&#26412;&#21040;&#27934;&#23519;&#21147;&#65306;&#21033;&#29992;&#29983;&#25104;&#22411;&#20154;&#24037;&#26234;&#33021;&#25581;&#31034;&#20225;&#19994;&#39118;&#38505;
&lt;/p&gt;
&lt;p&gt;
From Transcripts to Insights: Uncovering Corporate Risks Using Generative AI. (arXiv:2310.17721v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.17721
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25506;&#32034;&#20102;&#20351;&#29992;&#29983;&#25104;&#22411;&#20154;&#24037;&#26234;&#33021;&#24037;&#20855;&#24110;&#21161;&#25237;&#36164;&#32773;&#25581;&#31034;&#20225;&#19994;&#39118;&#38505;&#30340;&#20215;&#20540;&#65292;&#36890;&#36807;&#20174;&#25910;&#30410;&#30005;&#35805;&#30340;&#19978;&#19979;&#25991;&#20013;&#29983;&#25104;&#39118;&#38505;&#25688;&#35201;&#21644;&#35780;&#20272;&#65292;&#36825;&#20123;&#22522;&#20110;GPT&#30340;&#24230;&#37327;&#20855;&#26377;&#26174;&#33879;&#30340;&#20449;&#24687;&#20869;&#23481;&#65292;&#33021;&#22815;&#39044;&#27979;&#20225;&#19994;&#23618;&#38754;&#27874;&#21160;&#24615;&#21644;&#25237;&#36164;&#21019;&#26032;&#36873;&#25321;&#12290;&#27492;&#22806;&#65292;&#29983;&#25104;&#22411;&#20154;&#24037;&#26234;&#33021;&#36824;&#33021;&#26377;&#25928;&#26816;&#27979;&#26032;&#20852;&#39118;&#38505;&#65292;&#24182;&#19988;&#36825;&#20123;&#24230;&#37327;&#22312;&#32929;&#26435;&#24066;&#22330;&#20013;&#36215;&#21040;&#23450;&#20215;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25506;&#32034;&#20102;&#20351;&#29992;ChatGPT&#31561;&#29983;&#25104;&#22411;&#20154;&#24037;&#26234;&#33021;&#24037;&#20855;&#24110;&#21161;&#25237;&#36164;&#32773;&#25581;&#31034;&#20225;&#19994;&#39118;&#38505;&#32500;&#24230;&#30340;&#20215;&#20540;&#12290;&#25105;&#20204;&#24320;&#21457;&#24182;&#39564;&#35777;&#20102;&#25919;&#27835;&#12289;&#27668;&#20505;&#21644;&#20154;&#24037;&#26234;&#33021;&#30456;&#20851;&#39118;&#38505;&#30340;&#20225;&#19994;&#23618;&#38754;&#39118;&#38505;&#25950;&#21475;&#24230;&#37327;&#12290;&#20351;&#29992;GPT 3.5&#27169;&#22411;&#20174;&#25910;&#30410;&#30005;&#35805;&#30340;&#32972;&#26223;&#25552;&#20379;&#30340;&#19978;&#19979;&#25991;&#29983;&#25104;&#39118;&#38505;&#25688;&#35201;&#21644;&#35780;&#20272;&#65292;&#25105;&#20204;&#21457;&#29616;&#22522;&#20110;GPT&#30340;&#24230;&#37327;&#20855;&#26377;&#26174;&#33879;&#30340;&#20449;&#24687;&#20869;&#23481;&#65292;&#24182;&#22312;&#39044;&#27979;&#65288;&#24322;&#24120;&#65289;&#20225;&#19994;&#23618;&#38754;&#27874;&#21160;&#24615;&#21644;&#20225;&#19994;&#30340;&#36873;&#25321;&#65288;&#22914;&#25237;&#36164;&#21644;&#21019;&#26032;&#65289;&#26041;&#38754;&#20248;&#20110;&#29616;&#26377;&#30340;&#39118;&#38505;&#24230;&#37327;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#39118;&#38505;&#35780;&#20272;&#20013;&#30340;&#20449;&#24687;&#20248;&#20110;&#39118;&#38505;&#25688;&#35201;&#65292;&#36825;&#35777;&#26126;&#20102;&#36890;&#29992;&#20154;&#24037;&#26234;&#33021;&#30693;&#35782;&#30340;&#20215;&#20540;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#29983;&#25104;&#22411;&#20154;&#24037;&#26234;&#33021;&#23545;&#20110;&#21457;&#29616;&#26032;&#20852;&#39118;&#38505;&#65288;&#22914;&#36817;&#20960;&#20010;&#23395;&#24230;&#39129;&#21319;&#30340;&#20154;&#24037;&#26234;&#33021;&#39118;&#38505;&#65289;&#38750;&#24120;&#26377;&#25928;&#12290;&#25105;&#20204;&#30340;&#24230;&#37327;&#22312;GPT&#30340;&#35757;&#32451;&#31383;&#21475;&#20869;&#22806;&#34920;&#29616;&#33391;&#22909;&#65292;&#24182;&#19988;&#22312;&#32929;&#26435;&#24066;&#22330;&#20013;&#23450;&#20215;&#12290;&#32508;&#19978;&#25152;&#36848;&#65292;&#22522;&#20110;&#20154;&#24037;&#26234;&#33021;&#30340;&#39118;&#38505;&#27979;&#37327;&#26041;&#27861;&#25552;&#20379;&#20102;&#26377;&#29992;&#30340;&#27934;&#23519;&#12290;
&lt;/p&gt;
&lt;p&gt;
We explore the value of generative AI tools, such as ChatGPT, in helping investors uncover dimensions of corporate risk. We develop and validate firm-level measures of risk exposure to political, climate, and AI-related risks. Using the GPT 3.5 model to generate risk summaries and assessments from the context provided by earnings call transcripts, we show that GPT-based measures possess significant information content and outperform the existing risk measures in predicting (abnormal) firm-level volatility and firms' choices such as investment and innovation. Importantly, information in risk assessments dominates that in risk summaries, establishing the value of general AI knowledge. We also find that generative AI is effective at detecting emerging risks, such as AI risk, which has soared in recent quarters. Our measures perform well both within and outside the GPT's training window and are priced in equity markets. Taken together, an AI-based approach to risk measurement provides usef
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#24341;&#20837;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#65288;TDA&#65289;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#37329;&#34701;&#39118;&#38505;&#35780;&#20272;&#26041;&#27861;&#65292;&#31216;&#20026;&#21387;&#21147;&#19979;&#23494;&#24230;&#21464;&#21270;&#65288;DCUS&#65289;&#65292;&#23427;&#33021;&#22815;&#36229;&#36234;&#20256;&#32479;&#30340;&#39118;&#38505;&#24230;&#37327;&#26041;&#27861;&#65292;&#24182;&#25552;&#20379;&#23545;&#25237;&#36164;&#32452;&#21512;&#39118;&#38505;&#30340;&#26356;&#28145;&#20837;&#29702;&#35299;&#21644;&#27934;&#23519;&#12290;</title><link>http://arxiv.org/abs/2310.14604</link><description>&lt;p&gt;
&#36229;&#36234;VaR&#21644;CVaR&#65306;&#34893;&#29983;&#21697;&#24066;&#22330;&#20013;&#30340;&#25299;&#25169;&#39118;&#38505;&#24230;&#37327;
&lt;/p&gt;
&lt;p&gt;
Beyond VaR and CVaR: Topological Risk Measures in Derivative Markets. (arXiv:2310.14604v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.14604
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#24341;&#20837;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#65288;TDA&#65289;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#37329;&#34701;&#39118;&#38505;&#35780;&#20272;&#26041;&#27861;&#65292;&#31216;&#20026;&#21387;&#21147;&#19979;&#23494;&#24230;&#21464;&#21270;&#65288;DCUS&#65289;&#65292;&#23427;&#33021;&#22815;&#36229;&#36234;&#20256;&#32479;&#30340;&#39118;&#38505;&#24230;&#37327;&#26041;&#27861;&#65292;&#24182;&#25552;&#20379;&#23545;&#25237;&#36164;&#32452;&#21512;&#39118;&#38505;&#30340;&#26356;&#28145;&#20837;&#29702;&#35299;&#21644;&#27934;&#23519;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#23558;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#65288;TDA&#65289;&#65292;&#29305;&#21035;&#26159;&#19978;&#21516;&#35843;&#32676;&#65292;&#32435;&#20837;&#34893;&#29983;&#21697;&#32452;&#21512;&#35780;&#20272;&#20013;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#37329;&#34701;&#39118;&#38505;&#35780;&#20272;&#26041;&#27861;&#12290;&#35813;&#30740;&#31350;&#26088;&#22312;&#36229;&#36234;&#20256;&#32479;&#30340;&#39118;&#38505;&#24230;&#37327;&#26041;&#27861;&#65292;&#22914;&#39118;&#38505;&#20540;&#65288;VaR&#65289;&#21644;&#26465;&#20214;&#39118;&#38505;&#20540;&#65288;CVaR&#65289;&#65292;&#20197;&#20415;&#26356;&#28145;&#20837;&#22320;&#29702;&#35299;&#24066;&#22330;&#22797;&#26434;&#24615;&#12290;&#21033;&#29992;&#27169;&#25311;&#21644;&#30495;&#23454;&#25968;&#25454;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#25299;&#25169;&#39118;&#38505;&#24230;&#37327;&#26041;&#27861;&#65292;&#31216;&#20026;&#21387;&#21147;&#19979;&#23494;&#24230;&#21464;&#21270;&#65288;DCUS&#65289;&#12290;&#21021;&#27493;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#21387;&#21147;&#26465;&#20214;&#19979;&#65292;&#20195;&#34920;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#30340;&#28857;&#20113;&#23494;&#24230;&#20986;&#29616;&#26174;&#33879;&#21464;&#21270;&#65292;&#36825;&#34920;&#26126;DCUS&#21487;&#33021;&#25552;&#20379;&#39069;&#22806;&#30340;&#25237;&#36164;&#32452;&#21512;&#39118;&#38505;&#27934;&#23519;&#65292;&#24182;&#26377;&#28508;&#21147;&#34917;&#20805;&#29616;&#26377;&#30340;&#39118;&#38505;&#31649;&#29702;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper introduces a novel approach to financial risk assessment by incorporating topological data analysis (TDA), specifically cohomology groups, into the evaluation of derivatives portfolios. The study aims to go beyond traditional risk measures like Value at Risk (VaR) and Conditional Value at Risk (CVaR), offering a more nuanced understanding of market complexities. Using both simulated and real-world data, we develop a new topological risk measure, termed Density Change Under Stress (DCUS). Preliminary results indicate a significant change in the density of the point cloud representing the financial time series during stress conditions, suggesting that DCUS may offer additional insights into portfolio risk and has the potential to complement existing risk management tools.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#25919;&#27835;&#21160;&#33633;&#21644;&#20027;&#26435;&#39118;&#38505;&#23545;&#20110;&#22320;&#29702;&#36797;&#38420;&#30340;&#22269;&#23478;&#30340;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#22312;&#24093;&#22269;&#36793;&#30086;&#22320;&#21306;&#21457;&#29983;&#30340;&#21160;&#33633;&#26356;&#23481;&#26131;&#22686;&#21152;&#39118;&#38505;&#12290;&#30740;&#31350;&#32467;&#26524;&#23545;&#20110;&#25105;&#20204;&#29702;&#35299;&#24403;&#21069;&#20107;&#20214;&#26377;&#21551;&#31034;&#65292;&#20063;&#25552;&#37266;&#30528;&#25105;&#20204;&#22312;&#32500;&#25252;&#22269;&#23478;&#31283;&#23450;&#19982;&#21560;&#24341;&#22806;&#22269;&#25237;&#36164;&#26041;&#38754;&#25152;&#38754;&#20020;&#30340;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2309.06885</link><description>&lt;p&gt;
&#24093;&#22269;&#30340;&#20195;&#20215;&#65306;&#27801;&#20420;&#21160;&#33633;&#22320;&#28857;&#19982;&#20027;&#26435;&#39118;&#38505;
&lt;/p&gt;
&lt;p&gt;
The Price of Empire: Unrest Location and Sovereign Risk in Tsarist Russia. (arXiv:2309.06885v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.06885
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#25919;&#27835;&#21160;&#33633;&#21644;&#20027;&#26435;&#39118;&#38505;&#23545;&#20110;&#22320;&#29702;&#36797;&#38420;&#30340;&#22269;&#23478;&#30340;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#22312;&#24093;&#22269;&#36793;&#30086;&#22320;&#21306;&#21457;&#29983;&#30340;&#21160;&#33633;&#26356;&#23481;&#26131;&#22686;&#21152;&#39118;&#38505;&#12290;&#30740;&#31350;&#32467;&#26524;&#23545;&#20110;&#25105;&#20204;&#29702;&#35299;&#24403;&#21069;&#20107;&#20214;&#26377;&#21551;&#31034;&#65292;&#20063;&#25552;&#37266;&#30528;&#25105;&#20204;&#22312;&#32500;&#25252;&#22269;&#23478;&#31283;&#23450;&#19982;&#21560;&#24341;&#22806;&#22269;&#25237;&#36164;&#26041;&#38754;&#25152;&#38754;&#20020;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20851;&#20110;&#25919;&#27835;&#21160;&#33633;&#21644;&#20027;&#26435;&#39118;&#38505;&#30340;&#30740;&#31350;&#24573;&#35270;&#20102;&#21160;&#33633;&#22320;&#28857;&#23545;&#20110;&#22320;&#29702;&#36797;&#38420;&#30340;&#22269;&#23478;&#20027;&#26435;&#39118;&#38505;&#30340;&#24433;&#21709;&#21450;&#20854;&#26426;&#21046;&#12290;&#22312;&#30452;&#35266;&#19978;&#65292;&#39318;&#37117;&#25110;&#38468;&#36817;&#30340;&#25919;&#27835;&#26292;&#21147;&#20284;&#20046;&#30452;&#25509;&#23041;&#32961;&#21040;&#22269;&#23478;&#20607;&#36824;&#20538;&#21153;&#30340;&#33021;&#21147;&#12290;&#28982;&#32780;&#65292;&#36828;&#31163;&#26292;&#21147;&#22320;&#28857;&#21487;&#33021;&#20250;&#26356;&#21152;&#20005;&#37325;&#22320;&#24433;&#21709;&#25919;&#24220;&#65292;&#19982;&#25233;&#21046;&#21467;&#20081;&#25152;&#24102;&#26469;&#30340;&#38271;&#26399;&#25104;&#26412;&#26377;&#20851;&#12290;&#25105;&#20204;&#21033;&#29992;&#27801;&#20420;&#30340;&#26696;&#20363;&#26469;&#35780;&#20272;&#20420;&#32599;&#26031;&#22269;&#22303;&#20869;&#21457;&#29983;&#21160;&#33633;&#19982;&#24093;&#22269;&#36793;&#30086;&#22320;&#21306;&#21457;&#29983;&#21160;&#33633;&#26102;&#39118;&#38505;&#25928;&#24212;&#30340;&#24046;&#24322;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;1820&#24180;&#33267;1914&#24180;&#38388;&#27801;&#20420;&#24093;&#22269;&#21508;&#22320;&#30340;&#21160;&#33633;&#20107;&#20214;&#65292;&#21457;&#29616;&#21160;&#33633;&#23545;&#24093;&#22269;&#36793;&#30086;&#22320;&#21306;&#30340;&#39118;&#38505;&#24433;&#21709;&#26356;&#22823;&#12290;&#19982;&#24403;&#21069;&#20107;&#20214;&#30456;&#21628;&#24212;&#65292;&#25105;&#20204;&#21457;&#29616;&#20044;&#20811;&#20848;&#30340;&#21160;&#33633;&#20351;&#39118;&#38505;&#22686;&#21152;&#26368;&#22810;&#12290;&#24093;&#22269;&#30340;&#20195;&#20215;&#21253;&#25324;&#20102;&#21521;&#38215;&#21387;&#21160;&#33633;&#21644;&#33719;&#24471;&#22806;&#22269;&#25237;&#36164;&#32773;&#20449;&#20219;&#30340;&#21516;&#26102;&#32500;&#25345;&#21147;&#37327;&#25237;&#23556;&#30340;&#39640;&#39069;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
Research on politically motivated unrest and sovereign risk overlooks whether and how unrest location matters for sovereign risk in geographically extensive states. Intuitively, political violence in the capital or nearby would seem to directly threaten the state's ability to pay its debts. However, it is possible that the effect on a government could be more pronounced the farther away the violence is, connected to the longer-term costs of suppressing rebellion. We use Tsarist Russia to assess these differences in risk effects when unrest occurs in Russian homeland territories versus more remote imperial territories. Our analysis of unrest events across the Russian imperium from 1820 to 1914 suggests that unrest increases risk more in imperial territories. Echoing current events, we find that unrest in Ukraine increases risk most. The price of empire included higher costs in projecting force to repress unrest and retain the confidence of the foreign investors financing those costs.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#22522;&#20110;&#24515;&#29702;&#36172;&#21338;&#30340;&#36873;&#25321;&#34920;&#31034;&#65292;&#24471;&#20986;&#20102;&#23545;&#39044;&#26399;&#25928;&#29992;&#30340;&#22522;&#26412;&#29305;&#24449;&#21270;&#65292;&#26080;&#38656;&#39069;&#22806;&#20551;&#35774;&#12290;&#19981;&#21516;&#30340;&#24577;&#24230;&#20250;&#24433;&#21709;&#23545;&#22797;&#26434;&#24615;&#30340;&#29702;&#35299;&#65292;&#23548;&#33268;&#26368;&#23567;&#26368;&#22823;&#25110;Choquet&#39044;&#26399;&#25928;&#29992;&#30340;&#29305;&#24449;&#21270;&#12290;</title><link>http://arxiv.org/abs/2307.10328</link><description>&lt;p&gt;
&#20027;&#35266;&#39044;&#26399;&#25928;&#29992;&#19982;&#24515;&#29702;&#36172;&#21338;
&lt;/p&gt;
&lt;p&gt;
Subjective Expected Utility and Psychological Gambles. (arXiv:2307.10328v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10328
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#22522;&#20110;&#24515;&#29702;&#36172;&#21338;&#30340;&#36873;&#25321;&#34920;&#31034;&#65292;&#24471;&#20986;&#20102;&#23545;&#39044;&#26399;&#25928;&#29992;&#30340;&#22522;&#26412;&#29305;&#24449;&#21270;&#65292;&#26080;&#38656;&#39069;&#22806;&#20551;&#35774;&#12290;&#19981;&#21516;&#30340;&#24577;&#24230;&#20250;&#24433;&#21709;&#23545;&#22797;&#26434;&#24615;&#30340;&#29702;&#35299;&#65292;&#23548;&#33268;&#26368;&#23567;&#26368;&#22823;&#25110;Choquet&#39044;&#26399;&#25928;&#29992;&#30340;&#29305;&#24449;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#36890;&#36807;&#24515;&#29702;&#36172;&#21338;&#30340;&#36873;&#25321;&#34920;&#31034;&#65292;&#33719;&#24471;&#20102;&#23545;&#39044;&#26399;&#25928;&#29992;&#30340;&#22522;&#26412;&#29305;&#24449;&#65292;&#36825;&#19981;&#38656;&#35201;&#38500;&#20102;&#20808;&#21518;&#20559;&#22909;&#20043;&#38388;&#30340;&#19968;&#33268;&#24615;&#20043;&#22806;&#30340;&#20219;&#20309;&#20551;&#35774;&#12290;&#23545;&#22797;&#26434;&#24615;&#30340;&#24369;&#29256;&#26412;&#19982;&#19981;&#21516;&#30340;&#24577;&#24230;&#30456;&#20851;&#65292;&#24182;&#23548;&#33268;&#20102;&#26368;&#23567;&#26368;&#22823;&#25110;Choquet&#39044;&#26399;&#25928;&#29992;&#30340;&#29305;&#24449;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
We obtain an elementary characterization of expected utility based on a representation of choice in terms of psychological gambles, which requires no assumption other than coherence between ex-ante and ex-post preferences. Weaker version of coherence are associated with various attitudes towards complexity and lead to a characterization of minimax or Choquet expected utility.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#24102;&#26377;&#38543;&#26426;&#21033;&#29575;&#21644;&#19981;&#30830;&#23450;&#24615;&#30340;&#21160;&#24577;&#36164;&#20135;&#37197;&#32622;&#38382;&#39064;&#65292;&#35299;&#20915;&#26041;&#26696;&#26174;&#31034;&#25237;&#36164;&#32773;&#21482;&#23545;&#20882;&#38505;&#24615;&#25237;&#36164;&#36827;&#34892;&#23545;&#20914;&#65292;&#19981;&#30830;&#23450;&#24615;&#21482;&#24433;&#21709;&#20854;&#25237;&#26426;&#21160;&#26426;&#12290;</title><link>http://arxiv.org/abs/2306.13343</link><description>&lt;p&gt;
&#24102;&#26377;&#38543;&#26426;&#21033;&#29575;&#21644;&#19981;&#30830;&#23450;&#24615;&#30340;&#26368;&#20248;&#25237;&#36164;
&lt;/p&gt;
&lt;p&gt;
Optimal Investment with Stochastic Interest Rates and Ambiguity. (arXiv:2306.13343v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.13343
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24102;&#26377;&#38543;&#26426;&#21033;&#29575;&#21644;&#19981;&#30830;&#23450;&#24615;&#30340;&#21160;&#24577;&#36164;&#20135;&#37197;&#32622;&#38382;&#39064;&#65292;&#35299;&#20915;&#26041;&#26696;&#26174;&#31034;&#25237;&#36164;&#32773;&#21482;&#23545;&#20882;&#38505;&#24615;&#25237;&#36164;&#36827;&#34892;&#23545;&#20914;&#65292;&#19981;&#30830;&#23450;&#24615;&#21482;&#24433;&#21709;&#20854;&#25237;&#26426;&#21160;&#26426;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#21033;&#29575;&#39118;&#38505;&#21644;&#22810;&#20010;&#19981;&#30830;&#23450;&#39118;&#38505;&#26469;&#28304;&#30340;&#21160;&#24577;&#36164;&#20135;&#37197;&#32622;&#12290;&#24066;&#22330;&#21253;&#25324;&#26080;&#39118;&#38505;&#36164;&#20135;&#12289;&#38646;&#24687;&#20538;&#21048;&#65288;&#22343;&#30001;Vasicek&#27169;&#22411;&#30830;&#23450;&#65289;&#21644;&#32929;&#31080;&#12290;&#23545;&#20110;&#39118;&#38505;&#28322;&#20215;&#12289;&#27874;&#21160;&#24615;&#21644;&#30456;&#20851;&#24615;&#23384;&#22312;&#19981;&#30830;&#23450;&#24615;&#12290;&#25237;&#36164;&#32773;&#30340;&#20559;&#22909;&#26082;&#20307;&#29616;&#20102;&#39118;&#38505;&#35268;&#36991;&#65292;&#20063;&#20307;&#29616;&#20102;&#19981;&#30830;&#23450;&#24615;&#35268;&#36991;&#12290;&#22312;&#20856;&#22411;&#30340;&#24066;&#22330;&#26465;&#20214;&#19979;&#65292;&#21487;&#20197;&#36890;&#36807;&#38381;&#21512;&#24418;&#24335;&#26469;&#35299;&#20915;&#26368;&#20248;&#25237;&#36164;&#38382;&#39064;&#12290;&#35299;&#20915;&#26041;&#26696;&#34920;&#26126;&#65292;&#25237;&#36164;&#32773;&#19981;&#23545;&#19981;&#30830;&#23450;&#24615;&#36827;&#34892;&#23545;&#20914;&#65292;&#21482;&#23545;&#20882;&#38505;&#24615;&#25237;&#36164;&#36827;&#34892;&#23545;&#20914;&#65292;&#32780;&#19981;&#30830;&#23450;&#24615;&#21482;&#24433;&#21709;&#25237;&#36164;&#32773;&#30340;&#25237;&#26426;&#21160;&#26426;&#12290;&#26368;&#20248;&#25237;&#36164;&#31574;&#30053;&#30340;&#23454;&#26045;&#26174;&#31034;&#20102;&#19981;&#21516;&#19981;&#30830;&#23450;&#24615;&#26469;&#28304;&#30340;&#24433;&#21709;&#12290;&#19981;&#30830;&#23450;&#24615;&#35268;&#36991;&#26377;&#21161;&#20110;&#25233;&#21046;&#24573;&#30053;&#19981;&#30830;&#23450;&#24615;&#30340;&#39640;&#26464;&#26438;&#25237;&#36164;&#32452;&#21512;&#65292;&#24182;&#23548;&#33268;&#26356;&#31526;&#21512;&#27969;&#34892;&#25237;&#36164;&#24314;&#35758;&#30340;&#31574;&#30053;&#12290;&#26368;&#20248;&#25237;&#36164;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#27861;&#22522;&#20110;&#39532;&#19969;&#26684;&#23572;&#20248;&#21270;&#30340;&#25193;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies dynamic asset allocation with interest rate risk and several sources of ambiguity. The market consists of a risk-free asset, a zero-coupon bond (both determined by a Vasicek model), and a stock. There is ambiguity about the risk premia, the volatilities, and the correlation. The investor's preferences display both risk aversion and ambiguity aversion. The optimal investment problem can be solved in closed-form under typical market conditions. The solution shows that the investor does not hedge ambiguity but only risk, while the ambiguity only affects the speculative motives of the investor. An implementation of the optimal investment strategy shows the impact of the different sources of ambiguity. Ambiguity aversion helps to tame the highly leveraged portfolios neglecting ambiguity and leads to strategies that are more in line with popular investment advice. The solution method for the optimal investment problem is based on an extension of the martingale optimality p
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21338;&#24328;&#35770;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#22312;&#38750;&#36229;&#32423;&#22823;&#22269;&#20855;&#26377;&#24322;&#36136;&#20559;&#22909;&#21644;&#36164;&#28304;&#20998;&#37197;&#30340;&#24773;&#20917;&#19979;&#65292;&#23427;&#20204;&#22914;&#20309;&#36890;&#36807;&#32852;&#30431;&#30340;&#24418;&#25104;&#26469;&#24433;&#21709;&#36229;&#32423;&#22823;&#22269;&#30340;&#31454;&#20105;&#65292;&#24182;&#25581;&#31034;&#20102;&#38750;&#36229;&#32423;&#22823;&#22269;&#23545;&#36229;&#32423;&#22823;&#22269;&#20855;&#26377;&#19968;&#23450;&#30340;&#24433;&#21709;&#21147;&#12290;</title><link>http://arxiv.org/abs/2209.10206</link><description>&lt;p&gt;
&#38750;&#36229;&#32423;&#22823;&#22269;&#30340;&#21147;&#37327;
&lt;/p&gt;
&lt;p&gt;
The Power of Non-Superpowers. (arXiv:2209.10206v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.10206
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21338;&#24328;&#35770;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#22312;&#38750;&#36229;&#32423;&#22823;&#22269;&#20855;&#26377;&#24322;&#36136;&#20559;&#22909;&#21644;&#36164;&#28304;&#20998;&#37197;&#30340;&#24773;&#20917;&#19979;&#65292;&#23427;&#20204;&#22914;&#20309;&#36890;&#36807;&#32852;&#30431;&#30340;&#24418;&#25104;&#26469;&#24433;&#21709;&#36229;&#32423;&#22823;&#22269;&#30340;&#31454;&#20105;&#65292;&#24182;&#25581;&#31034;&#20102;&#38750;&#36229;&#32423;&#22823;&#22269;&#23545;&#36229;&#32423;&#22823;&#22269;&#20855;&#26377;&#19968;&#23450;&#30340;&#24433;&#21709;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21338;&#24328;&#35770;&#27169;&#22411;&#65292;&#30740;&#31350;&#38750;&#36229;&#32423;&#22823;&#22269;&#22312;&#20855;&#26377;&#24322;&#36136;&#20559;&#22909;&#21644;&#36164;&#28304;&#20998;&#37197;&#30340;&#24773;&#20917;&#19979;&#22914;&#20309;&#22609;&#36896;&#36229;&#32423;&#22823;&#22269;&#22312;&#21183;&#21147;&#33539;&#22260;&#20869;&#30340;&#31454;&#20105;&#12290;&#20004;&#20010;&#36229;&#32423;&#22823;&#22269;&#36827;&#34892;&#25552;&#20379;&#20465;&#20048;&#37096;&#20844;&#20849;&#21697;&#30340;&#26031;&#22612;&#20811;&#23572;&#20271;&#26684;&#21338;&#24328;&#65292;&#32780;&#38750;&#36229;&#32423;&#22823;&#22269;&#21017;&#36890;&#36807;&#24418;&#25104;&#32852;&#30431;&#26469;&#21152;&#20837;&#20465;&#20048;&#37096;&#24182;&#32771;&#34385;&#22806;&#37096;&#24615;&#30340;&#23384;&#22312;&#12290;&#32852;&#30431;&#30340;&#24418;&#25104;&#21462;&#20915;&#20110;&#38750;&#36229;&#32423;&#22823;&#22269;&#30340;&#29305;&#24449;&#65292;&#24433;&#21709;&#30528;&#36229;&#32423;&#22823;&#22269;&#30340;&#34892;&#20026;&#65292;&#20174;&#32780;&#24433;&#21709;&#20465;&#20048;&#37096;&#30340;&#35268;&#27169;&#12290;&#20174;&#36825;&#20010;&#24847;&#20041;&#19978;&#35828;&#65292;&#38750;&#36229;&#32423;&#22823;&#22269;&#23545;&#36229;&#32423;&#22823;&#22269;&#25317;&#26377;&#19968;&#23450;&#30340;&#24433;&#21709;&#21147;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#23376;&#21338;&#24328;&#23436;&#32654;&#32435;&#20160;&#22343;&#34913;&#65292;&#24182;&#27169;&#25311;&#20102;&#28216;&#25103;&#65292;&#20197;&#25551;&#32472;&#32654;&#22269;&#21644;&#20013;&#22269;&#22914;&#20309;&#26681;&#25454;&#20854;&#20182;&#22269;&#23478;&#26469;&#24418;&#25104;&#20182;&#20204;&#30340;&#20465;&#20048;&#37096;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a game-theoretic model to investigate how non-superpowers with heterogenous preferences and endowments shape the superpower competition for a sphere of influence. Two superpowers play a Stackelberg game of providing club goods while non-superpowers form coalitions to join a club in the presence of externalities. The coalition formation, which depends on the characteristics of non-superpowers, influences the behavior of superpowers and thus the club size. In this sense, non-superpowers have a power over superpowers. We study the subgame perfect Nash equilibrium and simulate the game to characterize how the US and China form their clubs depending on other countries.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;&#24378;&#21270;&#23398;&#20064;&#26694;&#26550;&#65292;&#29992;&#20110;&#20248;&#21270;&#25237;&#36164;&#32452;&#21512;&#31649;&#29702;&#36807;&#31243;&#65292;&#21487;&#20197;&#32771;&#34385;&#20132;&#26131;&#25104;&#26412;&#21644;&#31354;&#22836;&#38480;&#21046;&#65292;&#24182;&#27604;&#36739;&#20102;&#19977;&#31181;&#19981;&#21516;&#30340;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#22312;&#27169;&#25311;&#29615;&#22659;&#20013;&#30340;&#24615;&#33021;&#20248;&#21183;&#12290;</title><link>http://arxiv.org/abs/1911.11880</link><description>&lt;p&gt;
&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#22686;&#24378;&#25237;&#36164;&#32452;&#21512;&#31649;&#29702;&#30340;&#36890;&#29992;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
A General Framework on Enhancing Portfolio Management with Reinforcement Learning. (arXiv:1911.11880v2 [q-fin.PM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1911.11880
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;&#24378;&#21270;&#23398;&#20064;&#26694;&#26550;&#65292;&#29992;&#20110;&#20248;&#21270;&#25237;&#36164;&#32452;&#21512;&#31649;&#29702;&#36807;&#31243;&#65292;&#21487;&#20197;&#32771;&#34385;&#20132;&#26131;&#25104;&#26412;&#21644;&#31354;&#22836;&#38480;&#21046;&#65292;&#24182;&#27604;&#36739;&#20102;&#19977;&#31181;&#19981;&#21516;&#30340;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#22312;&#27169;&#25311;&#29615;&#22659;&#20013;&#30340;&#24615;&#33021;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25237;&#36164;&#32452;&#21512;&#31649;&#29702;&#26159;&#37329;&#34701;&#20013;&#28041;&#21450;&#23545;&#36164;&#37329;&#21644;&#36164;&#20135;&#36827;&#34892;&#25345;&#32493;&#37325;&#26032;&#37197;&#32622;&#20197;&#28385;&#36275;&#26399;&#26395;&#25910;&#30410;&#21644;&#39118;&#38505;&#37197;&#32622;&#30340;&#33402;&#26415;&#19982;&#31185;&#23398;&#12290;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#65288;RL&#65289;&#22312;&#25237;&#36164;&#32452;&#21512;&#31649;&#29702;&#20013;&#24341;&#36215;&#20102;&#36234;&#26469;&#36234;&#22810;&#30340;&#20851;&#27880;&#65292;&#20854;&#20013;&#22522;&#20110;&#37329;&#34701;&#25968;&#25454;&#35757;&#32451;RL&#20195;&#29702;&#20197;&#20248;&#21270;&#36164;&#20135;&#37325;&#26032;&#37197;&#32622;&#36807;&#31243;&#12290;&#23613;&#31649;&#20043;&#21069;&#26377;&#23581;&#35797;&#23558;RL&#19982;&#25237;&#36164;&#32452;&#21512;&#31649;&#29702;&#30456;&#32467;&#21512;&#65292;&#20294;&#20043;&#21069;&#30340;&#24037;&#20316;&#26410;&#32771;&#34385;&#20132;&#26131;&#25104;&#26412;&#25110;&#31354;&#22836;&#38480;&#21046;&#31561;&#23454;&#38469;&#26041;&#38754;&#65292;&#38480;&#21046;&#20102;&#20854;&#36866;&#29992;&#24615;&#12290;&#20026;&#35299;&#20915;&#36825;&#20123;&#38480;&#21046;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;RL&#26694;&#26550;&#65292;&#29992;&#20110;&#36164;&#20135;&#31649;&#29702;&#65292;&#23427;&#21487;&#20197;&#23454;&#29616;&#36830;&#32493;&#30340;&#36164;&#20135;&#26435;&#37325;&#12289;&#31354;&#22836;&#20132;&#26131;&#20197;&#21450;&#21033;&#29992;&#30456;&#20851;&#29305;&#24449;&#36827;&#34892;&#20915;&#31574;&#12290;&#25105;&#20204;&#27604;&#36739;&#20102;&#19977;&#31181;&#19981;&#21516;&#30340;RL&#31639;&#27861;&#30340;&#24615;&#33021;&#65306;&#31574;&#30053;&#26799;&#24230;&#19982;&#28436;&#21592;-&#35780;&#35770;&#23478;&#65288;PGAC&#65289;&#65292;&#36817;&#31471;&#31574;&#30053;&#20248;&#21270;&#65288;PPO&#65289;&#21644;&#36827;&#21270;&#31574;&#30053;&#65288;ES&#65289;&#65292;&#24182;&#23637;&#31034;&#20102;&#23427;&#20204;&#22312;&#27169;&#25311;&#29615;&#22659;&#20013;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
Portfolio management is the art and science in fiance that concerns continuous reallocation of funds and assets across financial instruments to meet the desired returns to risk profile. Deep reinforcement learning (RL) has gained increasing interest in portfolio management, where RL agents are trained base on financial data to optimize the asset reallocation process. Though there are prior efforts in trying to combine RL and portfolio management, previous works did not consider practical aspects such as transaction costs or short selling restrictions, limiting their applicability. To address these limitations, we propose a general RL framework for asset management that enables continuous asset weights, short selling and making decisions with relevant features. We compare the performance of three different RL algorithms: Policy Gradient with Actor-Critic (PGAC), Proximal Policy Optimization (PPO), and Evolution Strategies (ES) and demonstrate their advantages in a simulated environment 
&lt;/p&gt;</description></item></channel></rss>