<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#23558;&#24773;&#24863;&#20998;&#26512;&#21644;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#38598;&#25104;&#31639;&#27861;&#24212;&#29992;&#20110;&#32929;&#31080;&#20132;&#26131;&#30340;&#26041;&#27861;&#65292;&#35774;&#35745;&#20102;&#21487;&#20197;&#26681;&#25454;&#24066;&#22330;&#24773;&#32490;&#21160;&#24577;&#35843;&#25972;&#30340;&#20132;&#26131;&#31574;&#30053;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#36825;&#31181;&#26041;&#27861;&#27604;&#20256;&#32479;&#30340;&#38598;&#25104;&#31574;&#30053;&#12289;&#21333;&#19968;&#26234;&#33021;&#20307;&#31639;&#27861;&#21644;&#24066;&#22330;&#25351;&#26631;&#26356;&#20855;&#30408;&#21033;&#24615;&#12289;&#31283;&#20581;&#24615;&#21644;&#39118;&#38505;&#26368;&#23567;&#21270;&#12290;&#30456;&#20851;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;&#20256;&#32479;&#30340;&#22266;&#23450;&#26356;&#25442;&#38598;&#25104;&#26234;&#33021;&#20307;&#30340;&#20570;&#27861;&#24182;&#19981;&#26159;&#26368;&#20248;&#30340;&#65292;&#32780;&#22522;&#20110;&#24773;&#24863;&#30340;&#21160;&#24577;&#26694;&#26550;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#20132;&#26131;&#26234;&#33021;&#20307;&#30340;&#24615;&#33021;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01441</link><description>&lt;p&gt;
&#23398;&#20064;&#24066;&#22330;&#65306;&#22522;&#20110;&#24773;&#24863;&#30340;&#38598;&#25104;&#20132;&#26131;&#26234;&#33021;&#20307;
&lt;/p&gt;
&lt;p&gt;
Learning the Market: Sentiment-Based Ensemble Trading Agents
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01441
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#23558;&#24773;&#24863;&#20998;&#26512;&#21644;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#38598;&#25104;&#31639;&#27861;&#24212;&#29992;&#20110;&#32929;&#31080;&#20132;&#26131;&#30340;&#26041;&#27861;&#65292;&#35774;&#35745;&#20102;&#21487;&#20197;&#26681;&#25454;&#24066;&#22330;&#24773;&#32490;&#21160;&#24577;&#35843;&#25972;&#30340;&#20132;&#26131;&#31574;&#30053;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#36825;&#31181;&#26041;&#27861;&#27604;&#20256;&#32479;&#30340;&#38598;&#25104;&#31574;&#30053;&#12289;&#21333;&#19968;&#26234;&#33021;&#20307;&#31639;&#27861;&#21644;&#24066;&#22330;&#25351;&#26631;&#26356;&#20855;&#30408;&#21033;&#24615;&#12289;&#31283;&#20581;&#24615;&#21644;&#39118;&#38505;&#26368;&#23567;&#21270;&#12290;&#30456;&#20851;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;&#20256;&#32479;&#30340;&#22266;&#23450;&#26356;&#25442;&#38598;&#25104;&#26234;&#33021;&#20307;&#30340;&#20570;&#27861;&#24182;&#19981;&#26159;&#26368;&#20248;&#30340;&#65292;&#32780;&#22522;&#20110;&#24773;&#24863;&#30340;&#21160;&#24577;&#26694;&#26550;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#20132;&#26131;&#26234;&#33021;&#20307;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#23558;&#24773;&#24863;&#20998;&#26512;&#21644;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#38598;&#25104;&#31639;&#27861;&#24212;&#29992;&#20110;&#32929;&#31080;&#20132;&#26131;&#65292;&#24182;&#35774;&#35745;&#20102;&#19968;&#31181;&#33021;&#22815;&#26681;&#25454;&#24403;&#21069;&#24066;&#22330;&#24773;&#32490;&#21160;&#24577;&#35843;&#25972;&#25152;&#20351;&#29992;&#30340;&#26234;&#33021;&#20307;&#30340;&#31574;&#30053;&#12290;&#25105;&#20204;&#21019;&#24314;&#20102;&#19968;&#20010;&#31616;&#21333;&#20294;&#26377;&#25928;&#30340;&#26041;&#27861;&#26469;&#25552;&#21462;&#26032;&#38395;&#24773;&#24863;&#65292;&#24182;&#23558;&#20854;&#19982;&#23545;&#29616;&#26377;&#20316;&#21697;&#30340;&#19968;&#33324;&#25913;&#36827;&#32467;&#21512;&#36215;&#26469;&#65292;&#20174;&#32780;&#24471;&#21040;&#26377;&#25928;&#32771;&#34385;&#23450;&#24615;&#24066;&#22330;&#22240;&#32032;&#21644;&#23450;&#37327;&#32929;&#31080;&#25968;&#25454;&#30340;&#33258;&#21160;&#20132;&#26131;&#26234;&#33021;&#20307;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#23548;&#33268;&#20102;&#19968;&#31181;&#30408;&#21033;&#12289;&#31283;&#20581;&#19988;&#39118;&#38505;&#26368;&#23567;&#30340;&#31574;&#30053;&#65292;&#20248;&#20110;&#20256;&#32479;&#30340;&#38598;&#25104;&#31574;&#30053;&#20197;&#21450;&#21333;&#19968;&#26234;&#33021;&#20307;&#31639;&#27861;&#21644;&#24066;&#22330;&#25351;&#26631;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#34920;&#26126;&#65292;&#20256;&#32479;&#30340;&#27599;&#38548;&#22266;&#23450;&#26376;&#20221;&#26356;&#25442;&#38598;&#25104;&#26234;&#33021;&#20307;&#30340;&#20570;&#27861;&#24182;&#19981;&#26159;&#26368;&#20248;&#30340;&#65292;&#22522;&#20110;&#24773;&#24863;&#30340;&#21160;&#24577;&#26694;&#26550;&#26497;&#22823;&#22320;&#25552;&#21319;&#20102;&#36825;&#20123;&#26234;&#33021;&#20307;&#30340;&#24615;&#33021;&#12290;&#27492;&#22806;&#65292;&#30001;&#20110;&#25105;&#20204;&#30340;&#31639;&#27861;&#35774;&#35745;&#31616;&#21333;&#19988;...
&lt;/p&gt;
&lt;p&gt;
We propose the integration of sentiment analysis and deep-reinforcement learning ensemble algorithms for stock trading, and design a strategy capable of dynamically altering its employed agent given concurrent market sentiment. In particular, we create a simple-yet-effective method for extracting news sentiment and combine this with general improvements upon existing works, resulting in automated trading agents that effectively consider both qualitative market factors and quantitative stock data. We show that our approach results in a strategy that is profitable, robust, and risk-minimal -- outperforming the traditional ensemble strategy as well as single agent algorithms and market metrics. Our findings determine that the conventional practice of switching ensemble agents every fixed-number of months is sub-optimal, and that a dynamic sentiment-based framework greatly unlocks additional performance within these agents. Furthermore, as we have designed our algorithm with simplicity and
&lt;/p&gt;</description></item></channel></rss>