<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#20840;&#29699;&#22240;&#32032;&#23545;&#21457;&#36798;&#32463;&#27982;&#20307;&#38134;&#34892;&#20307;&#31995;&#20013;&#38750;&#26680;&#24515;&#19982;&#26680;&#24515;&#36164;&#37329;&#27604;&#29575;&#30340;&#27874;&#21160;&#36215;&#20027;&#23548;&#20316;&#29992;&#65292;&#27719;&#29575;&#28789;&#27963;&#24615;&#33021;&#22815;&#22312;2008-2009&#24180;&#20197;&#22806;&#30340;&#26102;&#26399;&#20943;&#23567;&#36825;&#31181;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2310.11552</link><description>&lt;p&gt;
&#38750;&#26680;&#24515;&#38134;&#34892;&#36164;&#37329;&#21644;&#27719;&#29575;&#28789;&#27963;&#24615;&#20013;&#30340;&#20840;&#29699;&#22240;&#32032;
&lt;/p&gt;
&lt;p&gt;
Global Factors in Non-core Bank Funding and Exchange Rate Flexibility. (arXiv:2310.11552v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.11552
&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#22240;&#32032;&#23545;&#21457;&#36798;&#32463;&#27982;&#20307;&#38134;&#34892;&#20307;&#31995;&#20013;&#38750;&#26680;&#24515;&#19982;&#26680;&#24515;&#36164;&#37329;&#27604;&#29575;&#30340;&#27874;&#21160;&#36215;&#20027;&#23548;&#20316;&#29992;&#65292;&#27719;&#29575;&#28789;&#27963;&#24615;&#33021;&#22815;&#22312;2008-2009&#24180;&#20197;&#22806;&#30340;&#26102;&#26399;&#20943;&#23567;&#36825;&#31181;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#23637;&#31034;&#20102;&#21457;&#36798;&#32463;&#27982;&#20307;&#38134;&#34892;&#20307;&#31995;&#20013;&#38750;&#26680;&#24515;&#19982;&#26680;&#24515;&#36164;&#37329;&#27604;&#29575;&#30340;&#27874;&#21160;&#30001;&#23569;&#25968;&#20960;&#20010;&#26082;&#26377;&#23454;&#29289;&#24615;&#21448;&#26377;&#37329;&#34701;&#24615;&#36136;&#30340;&#20840;&#29699;&#22240;&#32032;&#39537;&#21160;&#65292;&#22269;&#23478;&#29305;&#23450;&#22240;&#32032;&#27809;&#26377;&#21457;&#25381;&#37325;&#35201;&#20316;&#29992;&#12290;&#27719;&#29575;&#28789;&#27963;&#24615;&#26377;&#21161;&#20110;&#20943;&#23567;&#38750;&#26680;&#24515;&#19982;&#26680;&#24515;&#27604;&#29575;&#21463;&#21040;&#20840;&#29699;&#22240;&#32032;&#30340;&#24433;&#21709;&#65292;&#20294;&#20165;&#22312;&#37325;&#22823;&#20840;&#29699;&#37329;&#34701;&#38663;&#33633;&#26399;&#38388;&#65288;&#22914;2008-2009&#24180;&#65289;&#26126;&#26174;&#36215;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
We show that fluctuations in the ratio of non-core to core funding in the banking systems of advanced economies are driven by a handful of global factors of both real and financial natures, with country-specific factors playing no significant roles. Exchange rate flexibility helps insulate the non-core to core ratio from such global factors but only significantly so outside periods of major global financial disruptions, as in 2008-2009.
&lt;/p&gt;</description></item></channel></rss>