<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#30740;&#31350;&#35780;&#20272;&#20102;&#33021;&#28304;&#31995;&#32479;&#20248;&#21270;&#27169;&#22411;&#20013;&#31354;&#38388;&#21644;&#26102;&#38388;&#20998;&#36776;&#29575;&#30340;&#30456;&#23545;&#37325;&#35201;&#24615;&#65292;&#24182;&#21457;&#29616;&#26102;&#38388;&#20998;&#36776;&#29575;&#23545;&#25152;&#26377;&#32467;&#26524;&#21442;&#25968;&#20855;&#26377;&#36739;&#22823;&#24433;&#21709;&#65292;&#32780;&#31354;&#38388;&#20998;&#36776;&#29575;&#21017;&#20027;&#35201;&#24433;&#21709;&#37197;&#30005;&#32447;&#36335;&#25193;&#24314;&#12290;&#22240;&#27492;&#65292;&#24212;&#20248;&#20808;&#32771;&#34385;&#25552;&#39640;&#26102;&#38388;&#20998;&#36776;&#29575;&#12290;</title><link>http://arxiv.org/abs/2310.10518</link><description>&lt;p&gt;
&#35780;&#20272;&#33021;&#28304;&#31995;&#32479;&#20248;&#21270;&#27169;&#22411;&#20013;&#31354;&#38388;&#21644;&#26102;&#38388;&#20998;&#36776;&#29575;&#30340;&#30456;&#23545;&#37325;&#35201;&#24615;
&lt;/p&gt;
&lt;p&gt;
Quantifying the relative importance of the spatial and temporal resolution in energy systems optimisation model. (arXiv:2310.10518v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.10518
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35780;&#20272;&#20102;&#33021;&#28304;&#31995;&#32479;&#20248;&#21270;&#27169;&#22411;&#20013;&#31354;&#38388;&#21644;&#26102;&#38388;&#20998;&#36776;&#29575;&#30340;&#30456;&#23545;&#37325;&#35201;&#24615;&#65292;&#24182;&#21457;&#29616;&#26102;&#38388;&#20998;&#36776;&#29575;&#23545;&#25152;&#26377;&#32467;&#26524;&#21442;&#25968;&#20855;&#26377;&#36739;&#22823;&#24433;&#21709;&#65292;&#32780;&#31354;&#38388;&#20998;&#36776;&#29575;&#21017;&#20027;&#35201;&#24433;&#21709;&#37197;&#30005;&#32447;&#36335;&#25193;&#24314;&#12290;&#22240;&#27492;&#65292;&#24212;&#20248;&#20808;&#32771;&#34385;&#25552;&#39640;&#26102;&#38388;&#20998;&#36776;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36234;&#26469;&#36234;&#22810;&#30340;&#33021;&#28304;&#31995;&#32479;&#20248;&#21270;&#27169;&#22411;&#30740;&#31350;&#37319;&#29992;&#26356;&#39640;&#30340;&#31354;&#38388;&#21644;&#26102;&#38388;&#20998;&#36776;&#29575;&#36827;&#34892;&#12290;&#20294;&#36825;&#20250;&#22686;&#21152;&#35745;&#31639;&#25104;&#26412;&#65292;&#23545;&#27169;&#22411;&#30340;&#35268;&#27169;&#12289;&#22797;&#26434;&#24615;&#21644;&#32454;&#33410;&#35774;&#23450;&#26377;&#19968;&#23450;&#38480;&#21046;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;&#33021;&#28304;&#31995;&#32479;&#27169;&#22411;&#30340;&#32467;&#26500;&#26041;&#38754;&#65292;&#22914;&#31354;&#38388;&#21644;&#26102;&#38388;&#20998;&#36776;&#29575;&#19982;&#36755;&#20837;&#21442;&#25968;&#30340;&#19981;&#30830;&#23450;&#24615;&#65288;&#22914;&#26368;&#32456;&#33021;&#28304;&#38656;&#27714;&#12289;&#25240;&#29616;&#29575;&#21644;&#36164;&#26412;&#25104;&#26412;&#65289;&#20043;&#38388;&#30340;&#30456;&#23545;&#37325;&#35201;&#24615;&#12290;&#25105;&#20204;&#20351;&#29992;&#20840;&#23616;&#25935;&#24863;&#24615;&#20998;&#26512;&#25581;&#31034;&#20102;&#36825;&#20123;&#20132;&#20114;&#20316;&#29992;&#65292;&#24182;&#20197;&#32943;&#23612;&#20122;&#21644;&#36125;&#23425;&#36825;&#20004;&#20010;&#20173;&#28982;&#32570;&#20047;&#26222;&#21450;&#20379;&#30005;&#30340;&#21457;&#23637;&#20013;&#22269;&#23478;&#20026;&#20363;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#26102;&#38388;&#20998;&#36776;&#29575;&#23545;&#25152;&#26377;&#32771;&#23519;&#32467;&#26524;&#21442;&#25968;&#37117;&#20855;&#26377;&#36739;&#22823;&#24433;&#21709;&#65292;&#32780;&#31354;&#38388;&#20998;&#36776;&#29575;&#21017;&#23545;&#35206;&#30422;&#26410;&#30005;&#27668;&#21270;&#20154;&#21475;&#30340;&#37197;&#30005;&#32447;&#36335;&#25193;&#24314;&#20855;&#26377;&#26174;&#33879;&#24433;&#21709;&#12290;&#24635;&#20307;&#26469;&#30475;&#65292;&#26102;&#38388;&#20998;&#36776;&#29575;&#30340;&#25972;&#20307;&#24433;&#21709;&#26356;&#22823;&#65292;&#22240;&#27492;&#24212;&#20248;&#20808;&#32771;&#34385;&#26102;&#38388;&#20998;&#36776;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
An increasing number of studies using energy system optimisation models are conducted with higher spatial and temporal resolution. This comes with a computational cost which places a limit on the size, complexity, and detail of the model. In this paper, we explore the relative importance of structural aspects of energy system models, spatial and temporal resolution, compared to uncertainties in input parameters such as final energy demand, discount rate and capital costs. We use global sensitivity analysis to uncover these interactions for two developing countries, Kenya, and Benin, which still lack universal access to electricity. We find that temporal resolution has a high influence on all assessed results parameters, and spatial resolution has a significant influence on the expansion of distribution lines to the unelectrified population. The larger overall influence of temporal resolution indicates that this should be prioritised compared to spatial resolution.
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#20013;&#20351;&#29992;&#23569;&#26679;&#26412;&#23398;&#20064;&#30340;&#36235;&#21183;&#36319;&#36394;&#39044;&#27979;&#22120;&#65292;&#33021;&#22815;&#24555;&#36895;&#36866;&#24212;&#26032;&#30340;&#24066;&#22330;&#26465;&#20214;&#65292;&#24182;&#33719;&#24471;&#36739;&#39640;&#30340;&#22799;&#26222;&#27604;&#29575;&#12290;</title><link>http://arxiv.org/abs/2310.10500</link><description>&lt;p&gt;
&#22312;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#20013;&#30340;&#23569;&#26679;&#26412;&#23398;&#20064;&#27169;&#24335;&#29992;&#20110;&#36235;&#21183;&#36319;&#36394;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Few-Shot Learning Patterns in Financial Time-Series for Trend-Following Strategies. (arXiv:2310.10500v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.10500
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#20013;&#20351;&#29992;&#23569;&#26679;&#26412;&#23398;&#20064;&#30340;&#36235;&#21183;&#36319;&#36394;&#39044;&#27979;&#22120;&#65292;&#33021;&#22815;&#24555;&#36895;&#36866;&#24212;&#26032;&#30340;&#24066;&#22330;&#26465;&#20214;&#65292;&#24182;&#33719;&#24471;&#36739;&#39640;&#30340;&#22799;&#26222;&#27604;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38024;&#23545;&#31995;&#32479;&#21270;&#20132;&#26131;&#31574;&#30053;&#30340;&#39044;&#27979;&#27169;&#22411;&#22312;&#37329;&#34701;&#24066;&#22330;&#26465;&#20214;&#21457;&#29983;&#21464;&#21270;&#26102;&#26080;&#27861;&#36805;&#36895;&#36866;&#24212;&#30340;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26102;&#38388;&#24207;&#21015;&#36235;&#21183;&#36319;&#36394;&#39044;&#27979;&#22120;&#65292;&#33021;&#22815;&#24555;&#36895;&#36866;&#24212;&#26032;&#30340;&#24066;&#22330;&#26465;&#20214;&#12290;&#25105;&#20204;&#21033;&#29992;&#28145;&#24230;&#23398;&#20064;&#39046;&#22495;&#30340;&#26368;&#26032;&#36827;&#23637;&#65292;&#37319;&#29992;&#23569;&#26679;&#26412;&#23398;&#20064;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20132;&#21449;&#27880;&#24847;&#21147;&#26102;&#38388;&#24207;&#21015;&#36235;&#21183;&#32593;&#32476; - X-Trend&#65292;&#36890;&#36807;&#23545;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#36827;&#34892;&#20851;&#27880;&#65292;&#20174;&#19978;&#19979;&#25991;&#26679;&#26412;&#38598;&#20013;&#36716;&#31227;&#30456;&#20284;&#27169;&#24335;&#30340;&#36235;&#21183;&#65292;&#23545;&#26032;&#30340;&#30446;&#26631;&#24773;&#22659;&#36827;&#34892;&#39044;&#27979;&#21644;&#23450;&#20301;&#12290;X-Trend&#33021;&#22815;&#24555;&#36895;&#36866;&#24212;&#26032;&#30340;&#37329;&#34701;&#24773;&#22659;&#65292;&#20854;&#22799;&#26222;&#27604;&#29575;&#30456;&#23545;&#20110;&#31070;&#32463;&#39044;&#27979;&#22120;&#25552;&#39640;&#20102;18.9%&#65292;&#30456;&#23545;&#20110;&#20256;&#32479;&#26102;&#38388;&#24207;&#21015;&#26041;&#27861;&#25552;&#39640;&#20102;10&#20493;&#12290;
&lt;/p&gt;
&lt;p&gt;
Forecasting models for systematic trading strategies do not adapt quickly when financial market conditions change, as was seen in the advent of the COVID-19 pandemic in 2020, when market conditions changed dramatically causing many forecasting models to take loss-making positions. To deal with such situations, we propose a novel time-series trend-following forecaster that is able to quickly adapt to new market conditions, referred to as regimes. We leverage recent developments from the deep learning community and use few-shot learning. We propose the Cross Attentive Time-Series Trend Network - X-Trend which takes positions attending over a context set of financial time-series regimes. X-Trend transfers trends from similar patterns in the context set to make predictions and take positions for a new distinct target regime. X-Trend is able to quickly adapt to new financial regimes with a Sharpe ratio increase of 18.9% over a neural forecaster and 10-fold over a conventional Time-series 
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#22312;&#21152;&#23494;&#36164;&#20135;&#30417;&#31649;&#20013;&#30340;&#24212;&#29992;&#65292;&#24182;&#25552;&#20986;&#20102;&#20004;&#20010;&#36129;&#29486;&#12290;&#39318;&#20808;&#65292;&#35843;&#26597;&#20102;&#23545;&#26410;&#21463;&#30417;&#31649;&#30340;&#21152;&#23494;&#36164;&#20135;&#30333;&#30382;&#20070;&#36827;&#34892;&#25991;&#26412;&#20998;&#26512;&#30340;&#29616;&#26377;&#24212;&#29992;&#65292;&#24182;&#21457;&#29616;&#20102;&#30740;&#31350;&#31354;&#30333;&#12290;&#28982;&#21518;&#65292;&#20998;&#26512;&#20102;&#27431;&#30431;&#30340;&#21152;&#23494;&#36164;&#20135;&#24066;&#22330;&#27861;&#35268;&#24341;&#20837;&#30340;&#21464;&#21270;&#65292;&#25506;&#35752;&#20102;&#22312;&#26032;&#30340;&#30417;&#31649;&#26694;&#26550;&#20869;&#25972;&#21512;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#30340;&#26426;&#36935;&#21644;&#25361;&#25112;&#12290;&#36825;&#20123;&#21457;&#29616;&#20026;&#26410;&#26469;&#30340;&#30740;&#31350;&#25552;&#20379;&#20102;&#22522;&#30784;&#65292;&#26377;&#28508;&#21147;&#20351;&#30417;&#31649;&#26426;&#26500;&#12289;&#21152;&#23494;&#36164;&#20135;&#21457;&#34892;&#32773;&#21644;&#25237;&#36164;&#32773;&#21463;&#30410;&#12290;</title><link>http://arxiv.org/abs/2310.10333</link><description>&lt;p&gt;
&#21306;&#22359;&#38142;&#36164;&#20135;&#30417;&#31649;&#30340;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#65306;&#19968;&#20221;&#36335;&#32447;&#22270;
&lt;/p&gt;
&lt;p&gt;
NLP for Crypto-Asset Regulation: A Roadmap. (arXiv:2310.10333v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.10333
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#22312;&#21152;&#23494;&#36164;&#20135;&#30417;&#31649;&#20013;&#30340;&#24212;&#29992;&#65292;&#24182;&#25552;&#20986;&#20102;&#20004;&#20010;&#36129;&#29486;&#12290;&#39318;&#20808;&#65292;&#35843;&#26597;&#20102;&#23545;&#26410;&#21463;&#30417;&#31649;&#30340;&#21152;&#23494;&#36164;&#20135;&#30333;&#30382;&#20070;&#36827;&#34892;&#25991;&#26412;&#20998;&#26512;&#30340;&#29616;&#26377;&#24212;&#29992;&#65292;&#24182;&#21457;&#29616;&#20102;&#30740;&#31350;&#31354;&#30333;&#12290;&#28982;&#21518;&#65292;&#20998;&#26512;&#20102;&#27431;&#30431;&#30340;&#21152;&#23494;&#36164;&#20135;&#24066;&#22330;&#27861;&#35268;&#24341;&#20837;&#30340;&#21464;&#21270;&#65292;&#25506;&#35752;&#20102;&#22312;&#26032;&#30340;&#30417;&#31649;&#26694;&#26550;&#20869;&#25972;&#21512;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#30340;&#26426;&#36935;&#21644;&#25361;&#25112;&#12290;&#36825;&#20123;&#21457;&#29616;&#20026;&#26410;&#26469;&#30340;&#30740;&#31350;&#25552;&#20379;&#20102;&#22522;&#30784;&#65292;&#26377;&#28508;&#21147;&#20351;&#30417;&#31649;&#26426;&#26500;&#12289;&#21152;&#23494;&#36164;&#20135;&#21457;&#34892;&#32773;&#21644;&#25237;&#36164;&#32773;&#21463;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#24555;&#36895;&#21457;&#23637;&#30340;&#21306;&#22359;&#38142;&#36164;&#20135;&#39046;&#22495;&#65292;&#30333;&#30382;&#20070;&#26159;&#25237;&#36164;&#32773;&#25351;&#23548;&#30340;&#37325;&#35201;&#25991;&#20214;&#65292;&#22312;&#27431;&#30431;&#30340;&#21152;&#23494;&#36164;&#20135;&#24066;&#22330;&#27861;&#35268;&#65288;MiCAR&#65289;&#19979;&#65292;&#23427;&#20204;&#29616;&#22312;&#38754;&#20020;&#21069;&#25152;&#26410;&#26377;&#30340;&#20869;&#23481;&#35201;&#27714;&#12290;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#21487;&#20197;&#20316;&#20026;&#20998;&#26512;&#36825;&#20123;&#25991;&#20214;&#21644;&#21327;&#21161;&#30417;&#31649;&#21512;&#35268;&#30340;&#24378;&#22823;&#24037;&#20855;&#12290;&#26412;&#25991;&#20026;&#35813;&#20027;&#39064;&#25552;&#20379;&#20102;&#20004;&#20010;&#36129;&#29486;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35843;&#26597;&#20102;&#23545;&#26410;&#21463;&#30417;&#31649;&#30340;&#21306;&#22359;&#38142;&#36164;&#20135;&#30333;&#30382;&#20070;&#36827;&#34892;&#25991;&#26412;&#20998;&#26512;&#30340;&#29616;&#26377;&#24212;&#29992;&#65292;&#21457;&#29616;&#20102;&#21487;&#20197;&#36890;&#36807;&#36328;&#23398;&#31185;&#21512;&#20316;&#26469;&#22635;&#34917;&#30740;&#31350;&#31354;&#30333;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#23545;MiCAR&#24341;&#20837;&#30340;&#21464;&#21270;&#36827;&#34892;&#20102;&#20998;&#26512;&#65292;&#31361;&#20986;&#20102;&#22312;&#26032;&#30340;&#30417;&#31649;&#26694;&#26550;&#20869;&#25972;&#21512;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#30340;&#26426;&#36935;&#21644;&#25361;&#25112;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#20026;&#36827;&#19968;&#27493;&#30340;&#30740;&#31350;&#22880;&#23450;&#20102;&#22522;&#30784;&#65292;&#24182;&#26377;&#28508;&#21147;&#20351;&#30417;&#31649;&#26426;&#26500;&#12289;&#21306;&#22359;&#38142;&#36164;&#20135;&#21457;&#34892;&#32773;&#21644;&#25237;&#36164;&#32773;&#21463;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the rapidly evolving field of crypto-assets, white papers are essential documents for investor guidance, and are now subject to unprecedented content requirements under the EU's Markets in Crypto-Assets Regulation (MiCAR). Natural Language Processing can serve as a powerful tool for both analyzing these documents and assisting in regulatory compliance. This paper delivers two contributions to the topic. First, we survey existing applications of textual analysis to unregulated crypto-asset white papers, uncovering a research gap that could be bridged with interdisciplinary collaboration. We then conduct an analysis of the changes introduced by MiCAR, highlighting the opportunities and challenges of integrating NLP within the new regulatory framework. Our findings set the stage for further research, with the potential to benefit regulators, crypto-asset issuers, and investors.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22797;&#21457;&#32593;&#32476;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20998;&#26512;&#39640;&#39057;&#25968;&#25454;&#26500;&#24314;&#22810;&#37325;&#22797;&#21457;&#32593;&#32476;&#65292;&#35782;&#21035;&#38134;&#34892;&#31995;&#32479;&#20013;&#30340;&#28508;&#22312;&#39044;&#35686;&#20449;&#21495;&#65292;&#20026;&#39044;&#27979;&#20005;&#37325;&#30340;&#38134;&#34892;&#21361;&#26426;&#25552;&#20379;&#26377;&#20215;&#20540;&#30340;&#27934;&#35265;&#12290;</title><link>http://arxiv.org/abs/2310.10283</link><description>&lt;p&gt;
&#25581;&#31034;&#38134;&#34892;&#31995;&#32479;&#39118;&#38505;&#30340;&#39044;&#35686;&#20449;&#21495;&#65306;&#19968;&#31181;&#22522;&#20110;&#22797;&#21457;&#32593;&#32476;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Unveiling Early Warning Signals of Systemic Risks in Banks: A Recurrence Network-Based Approach. (arXiv:2310.10283v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.10283
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22797;&#21457;&#32593;&#32476;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20998;&#26512;&#39640;&#39057;&#25968;&#25454;&#26500;&#24314;&#22810;&#37325;&#22797;&#21457;&#32593;&#32476;&#65292;&#35782;&#21035;&#38134;&#34892;&#31995;&#32479;&#20013;&#30340;&#28508;&#22312;&#39044;&#35686;&#20449;&#21495;&#65292;&#20026;&#39044;&#27979;&#20005;&#37325;&#30340;&#38134;&#34892;&#21361;&#26426;&#25552;&#20379;&#26377;&#20215;&#20540;&#30340;&#27934;&#35265;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38134;&#34892;&#21361;&#26426;&#26497;&#38590;&#23450;&#20041;&#65292;&#20294;&#21487;&#20197;&#36890;&#36807;&#38134;&#34892;&#20256;&#26579;&#26469;&#20307;&#29616;&#12290;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#38750;&#32447;&#24615;&#26102;&#38388;&#24207;&#21015;&#20998;&#26512;&#30340;&#32508;&#21512;&#26694;&#26550;&#65292;&#20197;&#35782;&#21035;&#38134;&#34892;&#31995;&#32479;&#20013;&#28508;&#22312;&#30340;&#39044;&#35686;&#20449;&#21495;&#65292;&#39044;&#27979;&#20005;&#37325;&#30340;&#38134;&#34892;&#21361;&#26426;&#12290;&#19982;&#20351;&#29992;&#20302;&#39057;&#25968;&#25454;&#23545;&#26292;&#38706;&#32593;&#32476;&#36827;&#34892;&#20256;&#32479;&#20998;&#26512;&#19981;&#21516;&#65292;&#25105;&#20204;&#35748;&#20026;&#20351;&#29992;&#39640;&#39057;&#25968;&#25454;&#30740;&#31350;&#38134;&#34892;&#32929;&#31080;&#20043;&#38388;&#30340;&#21160;&#24577;&#20851;&#31995;&#20250;&#25552;&#20379;&#26356;&#20855;&#27934;&#23519;&#21147;&#30340;&#23545;&#38134;&#34892;&#31995;&#32479;&#21464;&#21270;&#30340;&#35270;&#35282;&#12290;&#25105;&#20204;&#26500;&#24314;&#20102;&#22810;&#37325;&#22797;&#21457;&#32593;&#32476; (MRNs)&#65292;&#22522;&#20110;&#20013;&#22269;&#19978;&#24066;&#38134;&#34892;&#32929;&#31080;&#30340;&#22810;&#32500;&#24230;&#25910;&#30410;&#65292;&#26088;&#22312;&#36890;&#36807;&#30456;&#24212;&#30340;&#25351;&#26631;&#21644;&#25299;&#25169;&#32467;&#26500;&#30417;&#27979;&#31995;&#32479;&#30340;&#38750;&#32447;&#24615;&#21160;&#24577;&#12290;&#23454;&#35777;&#30740;&#31350;&#21457;&#29616;&#65292;MRNs&#30340;&#20851;&#38190;&#25351;&#26631;&#65292;&#29305;&#21035;&#26159;&#24179;&#22343;&#20114;&#20449;&#24687;&#65292;&#25552;&#20379;&#20102;&#23545;&#38134;&#34892;&#31995;&#32479;&#26497;&#31471;&#27874;&#21160;&#26399;&#30340;&#26377;&#20215;&#20540;&#30340;&#27934;&#35265;&#12290;
&lt;/p&gt;
&lt;p&gt;
Bank crisis is challenging to define but can be manifested through bank contagion. This study presents a comprehensive framework grounded in nonlinear time series analysis to identify potential early warning signals (EWS) for impending phase transitions in bank systems, with the goal of anticipating severe bank crisis. In contrast to traditional analyses of exposure networks using low-frequency data, we argue that studying the dynamic relationships among bank stocks using high-frequency data offers a more insightful perspective on changes in the banking system. We construct multiple recurrence networks (MRNs) based on multidimensional returns of listed banks' stocks in China, aiming to monitor the nonlinear dynamics of the system through the corresponding indicators and topological structures. Empirical findings indicate that key indicators of MRNs, specifically the average mutual information, provide valuable insights into periods of extreme volatility of bank system. This paper contr
&lt;/p&gt;</description></item><item><title>EffOCR&#26159;&#19968;&#31181;&#21487;&#25193;&#23637;&#30340;&#12289;&#24320;&#28304;&#30340;&#39640;&#25928;&#25968;&#23383;&#21270;&#19990;&#30028;&#30693;&#35782;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#19968;&#31181;&#26032;&#30340;OCR&#26041;&#27861;&#65292;&#28385;&#36275;&#20102;&#22312;&#22823;&#35268;&#27169;&#35299;&#25918;&#25991;&#26412;&#26041;&#38754;&#30340;&#35745;&#31639;&#21644;&#26679;&#26412;&#25928;&#29575;&#35201;&#27714;&#12290;</title><link>http://arxiv.org/abs/2310.10050</link><description>&lt;p&gt;
&#26234;&#33021;OCR&#65306;&#19968;&#31181;&#21487;&#25193;&#23637;&#30340;&#12289;&#24320;&#28304;&#30340;&#39640;&#25928;&#25968;&#23383;&#21270;&#19990;&#30028;&#30693;&#35782;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
EfficientOCR: An Extensible, Open-Source Package for Efficiently Digitizing World Knowledge. (arXiv:2310.10050v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.10050
&lt;/p&gt;
&lt;p&gt;
EffOCR&#26159;&#19968;&#31181;&#21487;&#25193;&#23637;&#30340;&#12289;&#24320;&#28304;&#30340;&#39640;&#25928;&#25968;&#23383;&#21270;&#19990;&#30028;&#30693;&#35782;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#19968;&#31181;&#26032;&#30340;OCR&#26041;&#27861;&#65292;&#28385;&#36275;&#20102;&#22312;&#22823;&#35268;&#27169;&#35299;&#25918;&#25991;&#26412;&#26041;&#38754;&#30340;&#35745;&#31639;&#21644;&#26679;&#26412;&#25928;&#29575;&#35201;&#27714;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#21313;&#20159;&#20010;&#20844;&#20849;&#39046;&#22495;&#25991;&#20214;&#20173;&#28982;&#34987;&#22256;&#22312;&#32440;&#36136;&#21103;&#26412;&#20013;&#65292;&#25110;&#32773;&#32570;&#20047;&#20934;&#30830;&#30340;&#25968;&#23383;&#21270;&#12290;&#29616;&#20195;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#26041;&#27861;&#19981;&#33021;&#29992;&#20110;&#32034;&#24341;&#12289;&#26816;&#32034;&#21644;&#24635;&#32467;&#36825;&#20123;&#25991;&#26412;&#65292;&#36827;&#34892;&#35745;&#31639;&#25991;&#26412;&#20998;&#26512;&#65292;&#25110;&#25552;&#21462;&#20449;&#24687;&#36827;&#34892;&#32479;&#35745;&#20998;&#26512;&#65292;&#36825;&#20123;&#25991;&#26412;&#20063;&#19981;&#33021;&#34701;&#20837;&#35821;&#35328;&#27169;&#22411;&#35757;&#32451;&#12290;&#37492;&#20110;&#20844;&#20849;&#39046;&#22495;&#25991;&#26412;&#30340;&#22810;&#26679;&#24615;&#21644;&#24222;&#22823;&#25968;&#37327;&#65292;&#20197;&#35268;&#27169;&#35299;&#25918;&#23427;&#20204;&#38656;&#35201;&#20934;&#30830;&#12289;&#38750;&#24120;&#24265;&#20215;&#19988;&#33021;&#22815;&#33258;&#23450;&#20041;&#21040;&#26032;&#30340;&#25910;&#34255;&#12289;&#35821;&#35328;&#21644;&#23383;&#31526;&#38598;&#30340;&#20809;&#23398;&#23383;&#31526;&#35782;&#21035;&#65288;OCR&#65289;&#12290;&#29616;&#26377;&#30340;OCR&#24341;&#25806;&#65292;&#22823;&#22810;&#35774;&#35745;&#29992;&#20110;&#39640;&#36164;&#28304;&#35821;&#35328;&#30340;&#23567;&#35268;&#27169;&#21830;&#19994;&#24212;&#29992;&#65292;&#24448;&#24448;&#26080;&#27861;&#28385;&#36275;&#36825;&#20123;&#35201;&#27714;&#12290;EffOCR&#65288;&#26234;&#33021;OCR&#65289;&#26159;&#19968;&#31181;&#26032;&#39062;&#30340;&#24320;&#28304;OCR&#26041;&#27861;&#65292;&#36890;&#36807;&#25918;&#24323;&#36890;&#24120;&#29992;&#20110;OCR&#30340;&#24207;&#21015;&#21040;&#24207;&#21015;&#26550;&#26500;&#65292;&#28385;&#36275;&#20102;&#22312;&#22823;&#35268;&#27169;&#35299;&#25918;&#25991;&#26412;&#26041;&#38754;&#30340;&#35745;&#31639;&#21644;&#26679;&#26412;&#25928;&#29575;&#35201;&#27714;&#12290;
&lt;/p&gt;
&lt;p&gt;
Billions of public domain documents remain trapped in hard copy or lack an accurate digitization. Modern natural language processing methods cannot be used to index, retrieve, and summarize their texts; conduct computational textual analyses; or extract information for statistical analyses, and these texts cannot be incorporated into language model training. Given the diversity and sheer quantity of public domain texts, liberating them at scale requires optical character recognition (OCR) that is accurate, extremely cheap to deploy, and sample-efficient to customize to novel collections, languages, and character sets. Existing OCR engines, largely designed for small-scale commercial applications in high resource languages, often fall short of these requirements. EffOCR (EfficientOCR), a novel open-source OCR package, meets both the computational and sample efficiency requirements for liberating texts at scale by abandoning the sequence-to-sequence architecture typically used for OCR, w
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#37325;&#26032;&#23457;&#35270;&#20102;&#21442;&#19982;&#24335;&#39044;&#31639;&#23545;&#31649;&#29702;&#32489;&#25928;&#21644;&#39044;&#31639;&#22402;&#32447;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#23427;&#23545;&#39044;&#31639;&#22402;&#32447;&#26377;&#36127;&#38754;&#24433;&#21709;&#65292;&#24182;&#19988;&#30452;&#25509;&#24433;&#21709;&#31649;&#29702;&#32489;&#25928;&#12289;&#39046;&#23548;&#39118;&#26684;&#21644;&#39046;&#23548;&#25104;&#21592;&#20132;&#27969;&#12290;&#27492;&#22806;&#65292;&#39046;&#23548;&#39118;&#26684;&#21644;&#39046;&#23548;&#25104;&#21592;&#20132;&#27969;&#23545;&#36825;&#20123;&#20851;&#31995;&#20855;&#26377;&#35843;&#33410;&#20316;&#29992;&#12290;&#30740;&#31350;&#32467;&#26524;&#23545;&#20915;&#31574;&#32773;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#35265;&#35299;&#21644;&#26356;&#26377;&#25928;&#30340;&#25514;&#26045;&#65292;&#21516;&#26102;&#20063;&#40723;&#21169;&#32467;&#21512;PLS-SEM&#21644;NCA&#26041;&#27861;&#26469;&#30740;&#31350;&#26465;&#20214;&#25928;&#24212;&#12290;</title><link>http://arxiv.org/abs/2310.09993</link><description>&lt;p&gt;
SEM-NCA&#26041;&#27861;&#25506;&#31350;&#21442;&#19982;&#24335;&#39044;&#31639;&#23545;&#39044;&#31639;&#22402;&#32447;&#19982;&#31649;&#29702;&#32489;&#25928;&#30340;&#24433;&#21709;&#65306;&#39046;&#23548;&#39118;&#26684;&#21644;&#39046;&#23548;&#25104;&#21592;&#20132;&#27969;&#30340;&#20013;&#20171;&#20316;&#29992;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
A SEM-NCA approach towards the impact of participative budgeting on budgetary slack and managerial performance: The mediating role of leadership style and leader-member exchange. (arXiv:2310.09993v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09993
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#37325;&#26032;&#23457;&#35270;&#20102;&#21442;&#19982;&#24335;&#39044;&#31639;&#23545;&#31649;&#29702;&#32489;&#25928;&#21644;&#39044;&#31639;&#22402;&#32447;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#23427;&#23545;&#39044;&#31639;&#22402;&#32447;&#26377;&#36127;&#38754;&#24433;&#21709;&#65292;&#24182;&#19988;&#30452;&#25509;&#24433;&#21709;&#31649;&#29702;&#32489;&#25928;&#12289;&#39046;&#23548;&#39118;&#26684;&#21644;&#39046;&#23548;&#25104;&#21592;&#20132;&#27969;&#12290;&#27492;&#22806;&#65292;&#39046;&#23548;&#39118;&#26684;&#21644;&#39046;&#23548;&#25104;&#21592;&#20132;&#27969;&#23545;&#36825;&#20123;&#20851;&#31995;&#20855;&#26377;&#35843;&#33410;&#20316;&#29992;&#12290;&#30740;&#31350;&#32467;&#26524;&#23545;&#20915;&#31574;&#32773;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#35265;&#35299;&#21644;&#26356;&#26377;&#25928;&#30340;&#25514;&#26045;&#65292;&#21516;&#26102;&#20063;&#40723;&#21169;&#32467;&#21512;PLS-SEM&#21644;NCA&#26041;&#27861;&#26469;&#30740;&#31350;&#26465;&#20214;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#37325;&#26032;&#23457;&#35270;&#20102;&#21442;&#19982;&#24335;&#39044;&#31639;&#23545;&#31649;&#29702;&#32489;&#25928;&#21644;&#39044;&#31639;&#22402;&#32447;&#30340;&#24433;&#21709;&#65292;&#24182;&#22635;&#34917;&#20102;&#24403;&#21069;&#30740;&#31350;&#30340;&#31354;&#30333;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#20462;&#27491;&#21518;&#30340;&#27010;&#24565;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#39046;&#23548;&#39118;&#26684;&#21644;&#39046;&#23548;&#25104;&#21592;&#20132;&#27969;&#30340;&#35843;&#33410;&#20316;&#29992;&#12290;&#26679;&#26412;&#21253;&#25324;408&#21517;&#22312;&#21046;&#36896;&#20844;&#21496;&#25317;&#26377;&#31649;&#29702;&#32463;&#39564;&#30340;&#21592;&#24037;&#12290;&#25105;&#20204;&#20351;&#29992;PLS-SEM&#21644;Necessary Condition Analysis (NCA)&#30456;&#32467;&#21512;&#30340;&#26041;&#27861;&#26469;&#39564;&#35777;&#20551;&#35774;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#21442;&#19982;&#24335;&#39044;&#31639;&#23545;&#39044;&#31639;&#22402;&#32447;&#26377;&#36127;&#38754;&#24433;&#21709;&#65292;&#24182;&#30452;&#25509;&#24433;&#21709;&#31649;&#29702;&#32489;&#25928;&#12289;&#39046;&#23548;&#39118;&#26684;&#21644;&#39046;&#23548;&#25104;&#21592;&#20132;&#27969;&#12290;&#27492;&#22806;&#65292;&#39046;&#23548;&#39118;&#26684;&#21644;&#39046;&#23548;&#25104;&#21592;&#20132;&#27969;&#23545;&#36825;&#20123;&#20851;&#31995;&#20855;&#26377;&#35843;&#33410;&#20316;&#29992;&#12290;&#31649;&#29702;&#20250;&#35745;&#30740;&#31350;&#20013;&#24341;&#20837;NCA&#30340;&#25972;&#21512;&#20026;&#20915;&#31574;&#32773;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#35265;&#35299;&#65292;&#21487;&#20197;&#37319;&#21462;&#26356;&#26377;&#25928;&#30340;&#25514;&#26045;&#12290;&#26412;&#30740;&#31350;&#36890;&#36807;&#40723;&#21169;&#32467;&#21512;PLS-SEM&#21644;NCA&#26041;&#27861;&#26469;&#30740;&#31350;&#26465;&#20214;&#25928;&#24212;&#65292;&#36827;&#19968;&#27493;&#22686;&#24378;&#20102;&#23545;&#35813;&#39046;&#22495;&#30340;&#29702;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study re-examines the impact of participative budgeting on managerial performance and budgetary slack, addressing gaps in current research. A revised conceptual model is developed, considering the conditioning roles of leadership style and leader-member exchange. The sample includes 408 employees with managerial experience in manufacturing companies. Hypotheses are tested using a combination of PLS-SEM and Necessary Condition Analysis (NCA). The results demonstrate that participative budgeting negatively affects budgetary slack and directly influences managerial performance, leadership style, and leader-member exchange. Moreover, leadership style and leader-member exchange moderate these relationships. The integration of NCA in management accounting research provides valuable insights for decision-makers, allowing for more effective measures. This study contributes by encouraging a complementary PLS-SEM and NCA approach to examine conditional effects. It also enhances understandin
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#26500;&#24314;&#20102;&#38598;&#35013;&#31665;&#33322;&#36816;&#34892;&#19994;1966&#24180;&#33267;2022&#24180;&#30340;&#32479;&#19968;&#21512;&#24182;&#28165;&#21333;&#65292;&#24182;&#36890;&#36807;&#32467;&#26500;&#21305;&#37197;&#27169;&#22411;&#30740;&#31350;&#20102;&#20844;&#21496;&#30340;&#24180;&#40836;&#12289;&#35268;&#27169;&#21644;&#22320;&#29702;&#37051;&#36817;&#24615;&#23545;&#21512;&#24182;&#20915;&#31574;&#30340;&#37325;&#35201;&#24615;&#30340;&#36716;&#21464;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#20844;&#21496;&#35268;&#27169;&#22312;1991&#24180;&#33267;2005&#24180;&#26399;&#38388;&#20316;&#20026;&#27491;&#21521;&#22240;&#32032;&#23545;&#21512;&#24182;&#28608;&#21169;&#26356;&#21152;&#37325;&#35201;&#65292;&#20294;&#22312;2006&#24180;&#33267;2022&#24180;&#26399;&#38388;&#20316;&#20026;&#36127;&#21521;&#22240;&#32032;&#36215;&#21040;&#25233;&#21046;&#20316;&#29992;&#12290;&#21516;&#26102;&#65292;&#20844;&#21496;&#20043;&#38388;&#30340;&#22320;&#29702;&#36317;&#31163;&#23545;&#21512;&#24182;&#20915;&#31574;&#20063;&#20135;&#29983;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2310.09938</link><description>&lt;p&gt;
&#12298;1966&#24180;&#20197;&#26469;&#38598;&#35013;&#31665;&#33322;&#36816;&#34892;&#19994;&#30340;&#32479;&#19968;&#21512;&#24182;&#28165;&#21333;&#65306;&#19968;&#23478;&#20844;&#21496;&#30340;&#24180;&#40836;&#12289;&#21544;&#20301;&#23481;&#37327;&#21644;&#22320;&#29702;&#37051;&#36817;&#24615;&#23545;&#21512;&#24182;&#20915;&#31574;&#30340;&#37325;&#35201;&#24615;&#30340;&#32467;&#26500;&#20272;&#35745;&#12299;&#30340;&#32763;&#35793;&#39064;&#30446;
&lt;/p&gt;
&lt;p&gt;
Unified Merger List in the Container Shipping Industry from 1966: A Structural Estimation of the Transition of Importance of a Firm's Age, Tonnage Capacity, and Geographical Proximity on Merger Decision. (arXiv:2310.09938v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09938
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26500;&#24314;&#20102;&#38598;&#35013;&#31665;&#33322;&#36816;&#34892;&#19994;1966&#24180;&#33267;2022&#24180;&#30340;&#32479;&#19968;&#21512;&#24182;&#28165;&#21333;&#65292;&#24182;&#36890;&#36807;&#32467;&#26500;&#21305;&#37197;&#27169;&#22411;&#30740;&#31350;&#20102;&#20844;&#21496;&#30340;&#24180;&#40836;&#12289;&#35268;&#27169;&#21644;&#22320;&#29702;&#37051;&#36817;&#24615;&#23545;&#21512;&#24182;&#20915;&#31574;&#30340;&#37325;&#35201;&#24615;&#30340;&#36716;&#21464;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#20844;&#21496;&#35268;&#27169;&#22312;1991&#24180;&#33267;2005&#24180;&#26399;&#38388;&#20316;&#20026;&#27491;&#21521;&#22240;&#32032;&#23545;&#21512;&#24182;&#28608;&#21169;&#26356;&#21152;&#37325;&#35201;&#65292;&#20294;&#22312;2006&#24180;&#33267;2022&#24180;&#26399;&#38388;&#20316;&#20026;&#36127;&#21521;&#22240;&#32032;&#36215;&#21040;&#25233;&#21046;&#20316;&#29992;&#12290;&#21516;&#26102;&#65292;&#20844;&#21496;&#20043;&#38388;&#30340;&#22320;&#29702;&#36317;&#31163;&#23545;&#21512;&#24182;&#20915;&#31574;&#20063;&#20135;&#29983;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#20840;&#29699;&#38598;&#35013;&#31665;&#33322;&#36816;&#34892;&#19994;1966&#24180;&#33267;2022&#24180;&#20043;&#38388;&#30340;&#32479;&#19968;&#21512;&#24182;&#28165;&#21333;&#12290;&#23558;&#35813;&#28165;&#21333;&#19982;&#19987;&#26377;&#25968;&#25454;&#32467;&#21512;&#65292;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#32467;&#26500;&#21305;&#37197;&#27169;&#22411;&#65292;&#25551;&#36848;&#20102;&#20844;&#21496;&#30340;&#24180;&#40836;&#12289;&#35268;&#27169;&#21644;&#22320;&#29702;&#37051;&#36817;&#24615;&#22312;&#21512;&#24182;&#20915;&#31574;&#20013;&#30340;&#21382;&#21490;&#24615;&#36716;&#21464;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;1991&#24180;&#33267;2005&#24180;&#26399;&#38388;&#65292;&#20316;&#20026;&#27491;&#38754;&#22240;&#32032;&#65292;&#19968;&#23478;&#20844;&#21496;&#30340;&#35268;&#27169;&#22312;&#21512;&#24182;&#28608;&#21169;&#20013;&#27604;&#20844;&#21496;&#30340;&#24180;&#40836;&#37325;&#35201;9.974&#20493;&#12290;&#28982;&#32780;&#65292;&#22312;2006&#24180;&#33267;2022&#24180;&#26399;&#38388;&#65292;&#20316;&#20026;&#36127;&#38754;&#22240;&#32032;&#65292;&#19968;&#23478;&#20844;&#21496;&#30340;&#35268;&#27169;&#22312;&#21512;&#24182;&#28608;&#21169;&#20013;&#27604;&#20844;&#21496;&#30340;&#24180;&#40836;&#37325;&#35201;0.026-0.630&#20493;&#65292;&#21363;&#20844;&#21496;&#30340;&#35268;&#27169;&#36215;&#21040;&#20102;&#25233;&#21046;&#20316;&#29992;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#20080;&#26041;&#20844;&#21496;&#21644;&#21334;&#26041;&#20844;&#21496;&#20043;&#38388;&#30340;&#36317;&#31163;&#22312;&#25972;&#20010;&#26399;&#38388;&#37117;&#36215;&#21040;&#20102;&#25233;&#21046;&#20316;&#29992;&#65292;&#20294;&#22312;&#36817;&#24180;&#26469;&#30340;&#32463;&#27982;&#37325;&#35201;&#24615;&#24050;&#20943;&#24369;&#21040;&#24494;&#19981;&#36275;&#36947;&#30340;&#31243;&#24230;&#12290;&#22312;&#21453;&#20107;&#23454;&#27169;&#25311;&#20013;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;&#21516;&#19968;&#22269;&#23478;&#30340;&#20844;&#21496;&#20043;&#38388;&#21512;&#24182;&#30340;&#31105;&#27490;&#20250;&#24433;&#21709;&#21512;&#24182;&#37197;&#32622;&#12290;
&lt;/p&gt;
&lt;p&gt;
We construct a novel unified merger list in the global container shipping industry between 1966 (the beginning of the industry) and 2022. Combining the list with proprietary data, we construct a structural matching model to describe the historical transition of the importance of a firm's age, size, and geographical proximity on merger decisions. We find that, as a positive factor, a firm's size is more important than a firm's age by 9.974 times as a merger incentive between 1991 and 2005. However, between 2006 and 2022, as a negative factor, a firm's size is more important than a firm's age by 0.026-0.630 times, that is, a firm's size works as a disincentive. We also find that the distance between buyer and seller firms works as a disincentive for the whole period, but the importance has dwindled to economic insignificance in recent years. In counterfactual simulations, we observe that the prohibition of mergers between firms in the same country would affect the merger configuration of
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#35780;&#20272;&#20102;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#22312;&#32929;&#24066;&#20215;&#26684;&#39044;&#27979;&#20013;&#30340;&#24615;&#33021;&#65292;&#36890;&#36807;&#36873;&#25321;&#26368;&#20339;&#30340;&#25216;&#26415;&#25351;&#26631;&#32452;&#21512;&#26469;&#23454;&#29616;&#26368;&#23569;&#35823;&#24046;&#30340;&#39044;&#27979;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#19981;&#21516;&#30340;&#21253;&#35013;&#22120;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#22312;&#19981;&#21516;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#20013;&#20855;&#26377;&#19981;&#21516;&#30340;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2310.09903</link><description>&lt;p&gt;
&#35780;&#20272;&#29305;&#24449;&#36873;&#25321;&#22312;&#32929;&#24066;&#20215;&#26684;&#39044;&#27979;&#20013;&#30340;&#24615;&#33021;&#65292;&#20197;&#30830;&#23450;&#26368;&#26377;&#25928;&#30340;&#25216;&#26415;&#25351;&#26631;
&lt;/p&gt;
&lt;p&gt;
Evaluation of feature selection performance for identification of best effective technical indicators on stock market price prediction. (arXiv:2310.09903v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09903
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35780;&#20272;&#20102;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#22312;&#32929;&#24066;&#20215;&#26684;&#39044;&#27979;&#20013;&#30340;&#24615;&#33021;&#65292;&#36890;&#36807;&#36873;&#25321;&#26368;&#20339;&#30340;&#25216;&#26415;&#25351;&#26631;&#32452;&#21512;&#26469;&#23454;&#29616;&#26368;&#23569;&#35823;&#24046;&#30340;&#39044;&#27979;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#19981;&#21516;&#30340;&#21253;&#35013;&#22120;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#22312;&#19981;&#21516;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#20013;&#20855;&#26377;&#19981;&#21516;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37492;&#20110;&#25216;&#26415;&#25351;&#26631;&#23545;&#32929;&#24066;&#39044;&#27979;&#30340;&#24433;&#21709;&#65292;&#29305;&#24449;&#36873;&#25321;&#23545;&#36873;&#25321;&#26368;&#20339;&#25351;&#26631;&#33267;&#20851;&#37325;&#35201;&#12290;&#19968;&#31181;&#32771;&#34385;&#22312;&#29305;&#24449;&#36873;&#25321;&#36807;&#31243;&#20013;&#27169;&#22411;&#24615;&#33021;&#30340;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#26159;&#21253;&#35013;&#22120;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#36890;&#36807;&#29305;&#24449;&#36873;&#25321;&#37492;&#23450;&#20986;&#26368;&#23569;&#35823;&#24046;&#30340;&#39044;&#27979;&#32929;&#24066;&#20215;&#26684;&#30340;&#26368;&#20339;&#32929;&#24066;&#25351;&#26631;&#32452;&#21512;&#12290;&#20026;&#35780;&#20272;&#21253;&#35013;&#22120;&#29305;&#24449;&#36873;&#25321;&#25216;&#26415;&#23545;&#32929;&#24066;&#39044;&#27979;&#30340;&#24433;&#21709;&#65292;&#26412;&#25991;&#22312;&#36807;&#21435;10&#24180;&#33529;&#26524;&#20844;&#21496;&#30340;&#25968;&#25454;&#19978;&#20351;&#29992;&#20102;10&#20010;&#35780;&#20272;&#22120;&#21644;123&#20010;&#25216;&#26415;&#25351;&#26631;&#36827;&#34892;&#20102;SFS&#21644;SBS&#30340;&#32771;&#23519;&#12290;&#27492;&#22806;&#65292;&#36890;&#36807;&#25552;&#20986;&#30340;&#26041;&#27861;&#65292;&#23558;&#30001;3&#22825;&#26102;&#38388;&#31383;&#21475;&#21019;&#24314;&#30340;&#25968;&#25454;&#36716;&#21270;&#20026;&#36866;&#29992;&#20110;&#22238;&#24402;&#26041;&#27861;&#30340;&#36755;&#20837;&#12290;&#20174;&#35266;&#23519;&#32467;&#26524;&#21487;&#20197;&#24471;&#20986;&#65306;&#65288;1&#65289;&#27599;&#31181;&#21253;&#35013;&#22120;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#22312;&#19981;&#21516;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#20013;&#20855;&#26377;&#19981;&#21516;&#30340;&#32467;&#26524;&#65292;&#27599;&#31181;&#26041;&#27861;&#22312;&#19981;&#21516;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#19978;&#20063;&#26377;&#25152;&#19981;&#21516;&#12290;
&lt;/p&gt;
&lt;p&gt;
Due to the influence of many factors, including technical indicators on stock market prediction, feature selection is important to choose the best indicators. One of the feature selection methods that consider the performance of models during feature selection is the wrapper feature selection method. The aim of this research is to identify a combination of the best stock market indicators through feature selection to predict the stock market price with the least error. In order to evaluate the impact of wrapper feature selection techniques on stock market prediction, in this paper SFS and SBS with 10 estimators and 123 technical indicators have been examined on the last 10 years of Apple Company. Also, by the proposed method, the data created by the 3-day time window were converted to the appropriate input for regression methods. Based on the results observed: (1) Each wrapper feature selection method has different results with different machine learning methods, and each method is mor
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#35843;&#26597;&#20102;&#8220;&#21033;&#29992;&#20449;&#24687;&#19981;&#23545;&#31216;&#30340;&#21093;&#21066;&#19994;&#21153;&#8221;&#27169;&#24335;&#65292;&#21363;&#36890;&#36807;&#36164;&#26412;&#21270;&#20449;&#24687;&#19981;&#23545;&#31216;&#26469;&#21093;&#21066;&#24369;&#21183;&#32676;&#20307;&#65292;&#29305;&#21035;&#20851;&#27880;&#20197;&#38750;&#19987;&#23478;&#20026;&#30446;&#26631;&#30340;&#20225;&#19994;&#25110;&#27450;&#35784;&#32773;&#21033;&#29992;&#20449;&#24687;&#19981;&#23545;&#31216;&#21521;&#32477;&#26395;&#20010;&#20307;&#38144;&#21806;&#20135;&#21697;&#25110;&#26381;&#21153;&#12290;</title><link>http://arxiv.org/abs/2310.09802</link><description>&lt;p&gt;
&#21033;&#29992;&#20449;&#24687;&#19981;&#23545;&#31216;&#30340;&#21093;&#21066;&#19994;&#21153;
&lt;/p&gt;
&lt;p&gt;
Exploitation Business: Leveraging Information Asymmetry. (arXiv:2310.09802v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09802
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#35843;&#26597;&#20102;&#8220;&#21033;&#29992;&#20449;&#24687;&#19981;&#23545;&#31216;&#30340;&#21093;&#21066;&#19994;&#21153;&#8221;&#27169;&#24335;&#65292;&#21363;&#36890;&#36807;&#36164;&#26412;&#21270;&#20449;&#24687;&#19981;&#23545;&#31216;&#26469;&#21093;&#21066;&#24369;&#21183;&#32676;&#20307;&#65292;&#29305;&#21035;&#20851;&#27880;&#20197;&#38750;&#19987;&#23478;&#20026;&#30446;&#26631;&#30340;&#20225;&#19994;&#25110;&#27450;&#35784;&#32773;&#21033;&#29992;&#20449;&#24687;&#19981;&#23545;&#31216;&#21521;&#32477;&#26395;&#20010;&#20307;&#38144;&#21806;&#20135;&#21697;&#25110;&#26381;&#21153;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35843;&#26597;&#20102;&#8220;&#21033;&#29992;&#20449;&#24687;&#19981;&#23545;&#31216;&#30340;&#21093;&#21066;&#19994;&#21153;&#8221;&#27169;&#24335;&#65292;&#35813;&#27169;&#24335;&#21033;&#29992;&#20449;&#24687;&#19981;&#23545;&#31216;&#26469;&#21093;&#21066;&#24369;&#21183;&#32676;&#20307;&#12290;&#23427;&#20027;&#35201;&#20851;&#27880;&#20197;&#38750;&#19987;&#23478;&#20026;&#30446;&#26631;&#30340;&#20225;&#19994;&#25110;&#27450;&#35784;&#32773;&#65292;&#20182;&#20204;&#21033;&#29992;&#20449;&#24687;&#19981;&#23545;&#31216;&#21521;&#32477;&#26395;&#30340;&#20010;&#20307;&#38144;&#21806;&#20135;&#21697;&#25110;&#26381;&#21153;&#12290;&#36825;&#31181;&#29616;&#35937;&#20063;&#34987;&#25551;&#36848;&#20026;&#8220;&#22522;&#20110;&#20449;&#24687;&#21093;&#21066;&#30340;&#30408;&#21033;&#27963;&#21160;&#8221;&#65292;&#23427;&#20381;&#36182;&#20110;&#20010;&#20307;&#23545;&#20449;&#24687;&#30340;&#26377;&#38480;&#33719;&#21462;&#12289;&#32570;&#20047;&#19987;&#19994;&#30693;&#35782;&#20197;&#21450;&#23545;&#38169;&#22833;&#26426;&#20250;&#30340;&#24656;&#24807;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper investigates the "Exploitation Business" model, which capitalizes on information asymmetry to exploit vulnerable populations. It focuses on businesses targeting non-experts or fraudsters who capitalize on information asymmetry to sell their products or services to desperate individuals. This phenomenon is also described as "profit-making activities based on informational exploitation," which thrives on individuals' limited access to information, lack of expertise, and Fear of Missing Out (FOMO).
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#35777;&#26126;&#20102;&#22312;DeFi&#24066;&#22330;&#20013;&#65292;&#25152;&#26377;&#30340;AMMs&#37117;&#26159;CFMMs&#65292;&#24182;&#19988;DeFi&#24066;&#22330;&#26080;&#22871;&#21033;&#30340;&#20805;&#20998;&#24517;&#35201;&#26465;&#20214;&#26159;&#23427;&#20855;&#26377;&#19968;&#20010;&#36882;&#22686;&#30340;&#19981;&#21464;&#37327;&#12290;</title><link>http://arxiv.org/abs/2310.09782</link><description>&lt;p&gt;
&#25152;&#26377;AMMs&#37117;&#26159;CFMMs&#12290;&#25152;&#26377;&#30340;DeFi&#24066;&#22330;&#37117;&#26377;&#19981;&#21464;&#37327;&#12290;&#24403;&#19988;&#20165;&#24403;DeFi&#24066;&#22330;&#26377;&#19968;&#20010;&#36882;&#22686;&#30340;&#19981;&#21464;&#37327;&#26102;&#65292;DeFi&#24066;&#22330;&#26159;&#26080;&#22871;&#21033;&#30340;&#12290;(arXiv:2310.09782v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
All AMMs are CFMMs. All DeFi markets have invariants. A DeFi market is arbitrage-free if and only if it has an increasing invariant. (arXiv:2310.09782v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09782
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#35777;&#26126;&#20102;&#22312;DeFi&#24066;&#22330;&#20013;&#65292;&#25152;&#26377;&#30340;AMMs&#37117;&#26159;CFMMs&#65292;&#24182;&#19988;DeFi&#24066;&#22330;&#26080;&#22871;&#21033;&#30340;&#20805;&#20998;&#24517;&#35201;&#26465;&#20214;&#26159;&#23427;&#20855;&#26377;&#19968;&#20010;&#36882;&#22686;&#30340;&#19981;&#21464;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#19968;&#20010;&#36890;&#29992;&#30340;&#26694;&#26550;&#20013;&#65292;&#25226;&#20219;&#20309;&#24066;&#22330;&#31995;&#32479;&#34920;&#36798;&#20026;&#29366;&#24577;&#36716;&#25442;&#35268;&#21017;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#27599;&#20010;DeFi&#24066;&#22330;&#31995;&#32479;&#37117;&#26377;&#19968;&#20010;&#19981;&#21464;&#37327;&#65307;&#20107;&#23454;&#19978;&#65292;&#25152;&#26377;&#30340;AMMs&#37117;&#26159;CFMMs&#12290;&#19981;&#21464;&#37327;&#19982;&#22871;&#21033;&#21644;&#23436;&#22791;&#24615;&#30452;&#25509;&#30456;&#20851;&#65292;&#22522;&#20110;&#20004;&#20010;&#22522;&#26412;&#31561;&#20215;&#24615;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35777;&#26126;&#65292;DeFi&#24066;&#22330;&#31995;&#32479;&#26080;&#22871;&#21033;&#24403;&#19988;&#20165;&#24403;&#23427;&#26377;&#19968;&#20010;&#20005;&#26684;&#36882;&#22686;&#30340;&#19981;&#21464;&#37327;&#65292;&#20854;&#20013;&#26080;&#22871;&#21033;&#24847;&#21619;&#30528;&#20219;&#20309;&#19968;&#31995;&#21015;&#30340;&#20132;&#26131;&#37117;&#19981;&#33021;&#23558;&#19968;&#20010;&#29366;&#24577;&#36716;&#25442;&#20026;&#19968;&#20010;&#34987;&#25903;&#37197;&#30340;&#29366;&#24577;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#35777;&#26126;&#65292;&#22914;&#26524;&#24066;&#22330;&#31995;&#32479;&#26159;&#23436;&#22791;&#30340;&#65292;&#21363;&#33267;&#23569;&#22312;&#19968;&#20010;&#26041;&#21521;&#19978;&#20801;&#35768;&#25152;&#26377;&#29366;&#24577;&#23545;&#20043;&#38388;&#30340;&#36716;&#25442;&#65292;&#37027;&#20040;&#19981;&#21464;&#37327;&#26159;&#21807;&#19968;&#30340;&#12290;&#22240;&#27492;&#65292;&#26080;&#22871;&#21033; (&#25110;&#32773;&#23436;&#22791;&#24615;) &#30340;&#19968;&#20010;&#24517;&#35201;&#26465;&#20214;&#26159;&#36882;&#22686; (&#25110;&#32773;&#21807;&#19968;&#24615;) &#19981;&#21464;&#37327;&#30340;&#23384;&#22312;&#65292;&#22240;&#27492;&#22312;&#38750;&#32447;&#24615;&#30340;DeFi&#29702;&#35770;&#20013;&#65292;&#19981;&#21464;&#37327;&#22312;&#23384;&#22312;&#24615; (&#25110;&#32773;&#21807;&#19968;&#24615;) &#19978;&#20855;&#26377;&#22522;&#30784;&#24615;&#30340;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
In a universal framework that expresses any market system in terms of state transition rules, we prove that every DeFi market system has an invariant; indeed, all AMMs are CFMMs.  Invariants connect directly to arbitrage and to completeness, according to two fundamental equivalences. First, a DeFi market system is, we prove, arbitrage-free if and only if it has a strictly increasing invariant, where arbitrage-free means that no state can be transformed into a dominated state by any sequence of transactions. Second, the invariant is, we prove, unique if and only if the market system is complete, meaning that it allows transitions between all pairs of states in the state space, in at least one direction.  Thus a necessary and sufficient condition for no-arbitrage (respectively, for completeness) is the existence of the increasing (respectively, the uniqueness of the) invariant, which, therefore, fulfills in nonlinear DeFi theory the foundational role parallel to the existence (respective
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#38024;&#23545;&#21360;&#24230;&#32929;&#24066;&#30340;&#26085;&#21382;&#20877;&#24179;&#34913;&#25237;&#36164;&#32452;&#21512;&#26041;&#27861;&#65292;&#20998;&#26512;&#20102;&#21313;&#20010;&#37096;&#38376;&#30340;&#20877;&#24179;&#34913;&#25237;&#36164;&#32452;&#21512;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2310.09770</link><description>&lt;p&gt;
&#21360;&#24230;&#32929;&#24066;&#30340;&#25237;&#36164;&#32452;&#21512;&#20877;&#24179;&#34913;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Portfolio Rebalancing Approach for the Indian Stock Market. (arXiv:2310.09770v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09770
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#38024;&#23545;&#21360;&#24230;&#32929;&#24066;&#30340;&#26085;&#21382;&#20877;&#24179;&#34913;&#25237;&#36164;&#32452;&#21512;&#26041;&#27861;&#65292;&#20998;&#26512;&#20102;&#21313;&#20010;&#37096;&#38376;&#30340;&#20877;&#24179;&#34913;&#25237;&#36164;&#32452;&#21512;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#31456;&#20171;&#32461;&#20102;&#19968;&#31181;&#38024;&#23545;&#21360;&#24230;&#32929;&#24066;&#32929;&#31080;&#32452;&#21512;&#30340;&#26085;&#21382;&#20877;&#24179;&#34913;&#26041;&#27861;&#12290;&#39318;&#20808;&#36873;&#25321;&#20102;&#21360;&#24230;&#32463;&#27982;&#30340;&#21313;&#20010;&#37325;&#35201;&#37096;&#38376;&#12290;&#38024;&#23545;&#27599;&#20010;&#37096;&#38376;&#65292;&#26681;&#25454;&#20854;&#33258;&#30001;&#27969;&#36890;&#24066;&#20540;&#30830;&#23450;&#20102;&#21069;&#21313;&#25903;&#32929;&#31080;&#12290;&#21033;&#29992;&#27599;&#20010;&#37096;&#38376;&#30340;&#21313;&#25903;&#32929;&#31080;&#35774;&#35745;&#20102;&#29305;&#23450;&#20110;&#35813;&#37096;&#38376;&#30340;&#25237;&#36164;&#32452;&#21512;&#12290;&#26412;&#30740;&#31350;&#20351;&#29992;&#20102;&#20174;2021&#24180;1&#26376;4&#26085;&#33267;2023&#24180;9&#26376;20&#26085;&#30340;&#21382;&#21490;&#32929;&#31080;&#20215;&#26684;&#65288;NSE&#32593;&#31449;&#65289;&#12290;&#25237;&#36164;&#32452;&#21512;&#26159;&#22522;&#20110;2021&#24180;1&#26376;4&#26085;&#33267;2022&#24180;6&#26376;30&#26085;&#30340;&#35757;&#32451;&#25968;&#25454;&#35774;&#35745;&#30340;&#12290;&#25237;&#36164;&#32452;&#21512;&#30340;&#34920;&#29616;&#22312;2022&#24180;7&#26376;1&#26085;&#33267;2023&#24180;9&#26376;20&#26085;&#26399;&#38388;&#36827;&#34892;&#20102;&#27979;&#35797;&#12290;&#26412;&#31456;&#20171;&#32461;&#30340;&#26085;&#21382;&#20877;&#24179;&#34913;&#26041;&#27861;&#22522;&#20110;&#24180;&#24230;&#20877;&#24179;&#34913;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#25152;&#20171;&#32461;&#30340;&#26041;&#27861;&#38750;&#24120;&#28789;&#27963;&#65292;&#21487;&#20197;&#36866;&#24212;&#27599;&#21608;&#25110;&#27599;&#26376;&#30340;&#20877;&#24179;&#34913;&#12290;&#23545;&#21313;&#20010;&#37096;&#38376;&#30340;&#20877;&#24179;&#34913;&#25237;&#36164;&#32452;&#21512;&#36827;&#34892;&#20102;&#35814;&#32454;&#30340;&#24615;&#33021;&#20998;&#26512;&#12290;&#24615;&#33021;&#32467;&#26524;&#20026;
&lt;/p&gt;
&lt;p&gt;
This chapter presents a calendar rebalancing approach to portfolios of stocks in the Indian stock market. Ten important sectors of the Indian economy are first selected. For each of these sectors, the top ten stocks are identified based on their free-float market capitalization values. Using the ten stocks in each sector, a sector-specific portfolio is designed. In this study, the historical stock prices are used from January 4, 2021, to September 20, 2023 (NSE Website). The portfolios are designed based on the training data from January 4, 2021 to June 30, 2022. The performances of the portfolios are tested over the period from July 1, 2022, to September 20, 2023. The calendar rebalancing approach presented in the chapter is based on a yearly rebalancing method. However, the method presented is perfectly flexible and can be adapted for weekly or monthly rebalancing. The rebalanced portfolios for the ten sectors are analyzed in detail for their performances. The performance results are
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#23545;&#27604;&#29305;&#24065;&#30340;&#32463;&#27982;&#24433;&#21709;&#36827;&#34892;&#20102;&#28145;&#20837;&#20998;&#26512;&#65292;&#21253;&#25324;&#22522;&#26412;&#21407;&#29702;&#12289;&#25216;&#26415;&#36827;&#21270;&#21644;&#22312;&#32463;&#27982;&#29983;&#24577;&#31995;&#32479;&#20013;&#30340;&#20316;&#29992;&#12290;&#36825;&#20123;&#30740;&#31350;&#32467;&#26524;&#20026;&#20010;&#20154;&#12289;&#26426;&#26500;&#21644;&#20915;&#31574;&#32773;&#22312;&#38750;&#20013;&#24515;&#21270;&#37329;&#34701;&#39046;&#22495;&#30340;&#20915;&#31574;&#25552;&#20379;&#20102;&#26377;&#30410;&#30340;&#20449;&#24687;&#12290;</title><link>http://arxiv.org/abs/2310.09745</link><description>&lt;p&gt;
&#32463;&#27982;&#23398;&#35299;&#25918;&#65306;&#25506;&#31350;&#21152;&#23494;&#36135;&#24065;&#12289;&#21306;&#22359;&#38142;&#20197;&#21450;&#27604;&#29305;&#24065;&#20215;&#26684;&#27874;&#21160;&#30340;&#22797;&#26434;&#24615;
&lt;/p&gt;
&lt;p&gt;
Economics unchained: Investigating the role of cryptocurrency, blockchain and intricacies of price fluctuations BITCOIN PRICE FLUCTUATIONS. (arXiv:2310.09745v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09745
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23545;&#27604;&#29305;&#24065;&#30340;&#32463;&#27982;&#24433;&#21709;&#36827;&#34892;&#20102;&#28145;&#20837;&#20998;&#26512;&#65292;&#21253;&#25324;&#22522;&#26412;&#21407;&#29702;&#12289;&#25216;&#26415;&#36827;&#21270;&#21644;&#22312;&#32463;&#27982;&#29983;&#24577;&#31995;&#32479;&#20013;&#30340;&#20316;&#29992;&#12290;&#36825;&#20123;&#30740;&#31350;&#32467;&#26524;&#20026;&#20010;&#20154;&#12289;&#26426;&#26500;&#21644;&#20915;&#31574;&#32773;&#22312;&#38750;&#20013;&#24515;&#21270;&#37329;&#34701;&#39046;&#22495;&#30340;&#20915;&#31574;&#25552;&#20379;&#20102;&#26377;&#30410;&#30340;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35770;&#25991;&#23545;&#27604;&#29305;&#24065;&#21450;&#20854;&#24433;&#21709;&#36827;&#34892;&#20102;&#28145;&#20837;&#30340;&#32463;&#27982;&#20998;&#26512;&#12290;&#25105;&#20204;&#25506;&#35752;&#20102;&#22522;&#26412;&#21407;&#29702;&#21644;&#25216;&#26415;&#36827;&#21270;&#65292;&#35814;&#36848;&#20102;&#36825;&#31181;&#26480;&#20986;&#30340;&#21435;&#20013;&#24515;&#21270;&#25968;&#23383;&#36135;&#24065;&#12290;&#36890;&#36807;&#20998;&#26512;&#27604;&#29305;&#24065;&#30340;&#32463;&#27982;&#21160;&#24577;&#65292;&#25105;&#20204;&#25506;&#32034;&#20102;&#20132;&#26131;&#37327;&#12289;&#24066;&#20540;&#12289;&#25366;&#30719;&#27963;&#21160;&#21644;&#23439;&#35266;&#36235;&#21183;&#31561;&#26041;&#38754;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#27604;&#29305;&#24065;&#22312;&#32463;&#27982;&#29983;&#24577;&#31995;&#32479;&#20013;&#30340;&#20316;&#29992;&#65292;&#32771;&#34385;&#20102;&#20854;&#23545;&#20256;&#32479;&#37329;&#34701;&#20307;&#31995;&#12289;&#36135;&#24065;&#25919;&#31574;&#21644;&#37329;&#34701;&#21253;&#23481;&#24615;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#21033;&#29992;&#32479;&#35745;&#21644;&#20998;&#26512;&#24037;&#20855;&#26469;&#35780;&#20272;&#22343;&#34913;&#12289;&#24066;&#22330;&#34892;&#20026;&#21644;&#32463;&#27982;&#12290;&#20174;&#36825;&#39033;&#20998;&#26512;&#20013;&#24471;&#20986;&#30340;&#35265;&#35299;&#65292;&#20840;&#38754;&#29702;&#35299;&#20102;&#27604;&#29305;&#24065;&#22312;&#32463;&#27982;&#19978;&#30340;&#37325;&#35201;&#24615;&#20197;&#21450;&#23427;&#22312;&#22609;&#36896;&#20840;&#29699;&#37329;&#34701;&#26410;&#26469;&#26041;&#38754;&#30340;&#36716;&#21464;&#28508;&#21147;&#12290;&#36825;&#39033;&#30740;&#31350;&#20026;&#20010;&#20154;&#12289;&#26426;&#26500;&#21644;&#20915;&#31574;&#32773;&#22312;&#19981;&#26029;&#21457;&#23637;&#30340;&#21435;&#20013;&#24515;&#21270;&#37329;&#34701;&#39046;&#22495;&#20013;&#25552;&#20379;&#20102;&#26126;&#26234;&#30340;&#20915;&#31574;&#20381;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
This research paper presents a thorough economic analysis of Bitcoin and its impact. We delve into fundamental principles, and technological evolution into a prominent decentralized digital currency. Analysing Bitcoin's economic dynamics, we explore aspects such as transaction volume, market capitalization, mining activities, and macro trends. Moreover, we investigate Bitcoin's role in economy ecosystem, considering its implications on traditional financial systems, monetary policies, and financial inclusivity. We utilize statistical and analytical tools to assess equilibrium , market behaviour, and economic . Insights from this analysis provide a comprehensive understanding of Bitcoin's economic significance and its transformative potential in shaping the future of global finance. This research contributes to informed decision-making for individuals, institutions, and policymakers navigating the evolving landscape of decentralized finance.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#21644;&#22810;&#23618;&#24863;&#30693;&#22120;&#25216;&#26415;&#23545;&#27604;&#29305;&#24065;&#26399;&#26435;&#36827;&#34892;&#23450;&#20215;&#30340;&#26041;&#27861;&#65292;&#22312;&#32771;&#34385;&#36339;&#36291;&#25193;&#25955;&#21644;&#24066;&#22330;&#24773;&#32490;&#27169;&#22411;&#30340;&#22522;&#30784;&#19978;&#65292;&#36890;&#36807;&#24341;&#20837;&#35895;&#27468;&#25628;&#32034;&#25968;&#37327;&#20316;&#20026;&#24773;&#32490;&#25351;&#31034;&#22120;&#65292;&#25552;&#20986;&#20102;&#27604;&#29305;&#24065;&#20215;&#26684;&#30340;&#38381;&#21512;&#20844;&#24335;&#65292;&#24182;&#25512;&#23548;&#20102;&#27604;&#29305;&#24065;&#26399;&#26435;&#30340;Black-Scholes&#26041;&#31243;&#12290;</title><link>http://arxiv.org/abs/2310.09622</link><description>&lt;p&gt;
&#20351;&#29992;&#36339;&#36291;&#25193;&#25955;&#21644;&#24066;&#22330;&#24773;&#32490;&#27169;&#22411;&#20272;&#20540;&#27604;&#29305;&#24065;&#26399;&#26435;&#30340;&#31070;&#32463;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
Neural Network for valuing Bitcoin options under jump-diffusion and market sentiment model. (arXiv:2310.09622v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09622
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#21644;&#22810;&#23618;&#24863;&#30693;&#22120;&#25216;&#26415;&#23545;&#27604;&#29305;&#24065;&#26399;&#26435;&#36827;&#34892;&#23450;&#20215;&#30340;&#26041;&#27861;&#65292;&#22312;&#32771;&#34385;&#36339;&#36291;&#25193;&#25955;&#21644;&#24066;&#22330;&#24773;&#32490;&#27169;&#22411;&#30340;&#22522;&#30784;&#19978;&#65292;&#36890;&#36807;&#24341;&#20837;&#35895;&#27468;&#25628;&#32034;&#25968;&#37327;&#20316;&#20026;&#24773;&#32490;&#25351;&#31034;&#22120;&#65292;&#25552;&#20986;&#20102;&#27604;&#29305;&#24065;&#20215;&#26684;&#30340;&#38381;&#21512;&#20844;&#24335;&#65292;&#24182;&#25512;&#23548;&#20102;&#27604;&#29305;&#24065;&#26399;&#26435;&#30340;Black-Scholes&#26041;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21152;&#23494;&#36135;&#24065;&#65292;&#23588;&#20854;&#26159;&#27604;&#29305;&#24065;&#65292;&#23481;&#26131;&#20986;&#29616;&#21095;&#28872;&#27874;&#21160;&#65292;&#23548;&#33268;&#20215;&#26684;&#39057;&#32321;&#36339;&#36291;&#65292;&#22240;&#27492;&#21382;&#26469;&#21463;&#21040;&#20132;&#26131;&#21592;&#25237;&#26426;&#30340;&#38738;&#30544;&#12290;&#23545;&#36825;&#20123;&#27874;&#21160;&#30340;&#26356;&#22909;&#29702;&#35299;&#21487;&#20197;&#35753;&#21152;&#23494;&#36135;&#24065;&#25237;&#36164;&#32773;&#36890;&#36807;&#20570;&#20986;&#26126;&#26234;&#30340;&#20915;&#31574;&#33719;&#30410;&#12290;&#26368;&#36817;&#30340;&#25991;&#29486;&#22768;&#31216;&#27604;&#29305;&#24065;&#30340;&#20215;&#26684;&#21463;&#21040;&#20851;&#20110;&#27604;&#29305;&#24065;&#31995;&#32479;&#30340;&#24773;&#32490;&#24433;&#21709;&#12290;&#20132;&#26131;&#37327;&#20197;&#21450;&#27604;&#29305;&#24065;&#30340;&#27969;&#34892;&#24230;&#26174;&#31034;&#20986;&#20316;&#20026;&#27604;&#29305;&#24065;&#20215;&#26684;&#28508;&#22312;&#39537;&#21160;&#22240;&#32032;&#30340;&#27491;&#38754;&#35777;&#25454;&#12290;&#26412;&#30740;&#31350;&#32771;&#34385;&#20102;&#19968;&#20010;&#25551;&#36848;&#27604;&#29305;&#24065;&#20215;&#26684;&#21160;&#24577;&#21644;&#24433;&#21709;&#20215;&#26684;&#30340;&#35895;&#27468;&#25628;&#32034;&#25968;&#37327;&#30340;&#21452;&#21464;&#37327;&#36339;&#36291;&#25193;&#25955;&#27169;&#22411;&#65292;&#20316;&#20026;&#24773;&#32490;&#25351;&#31034;&#22120;&#12290;&#25105;&#20204;&#24471;&#21040;&#20102;&#27604;&#29305;&#24065;&#20215;&#26684;&#30340;&#38381;&#21512;&#20844;&#24335;&#65292;&#24182;&#25512;&#23548;&#20102;&#27604;&#29305;&#24065;&#26399;&#26435;&#30340;Black-Scholes&#26041;&#31243;&#12290;&#25105;&#20204;&#39318;&#20808;&#36890;&#36807;&#24341;&#20837;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#21644;&#22810;&#23618;&#24863;&#30693;&#22120;&#25216;&#26415;&#35299;&#20915;&#20102;&#30456;&#24212;&#30340;&#27604;&#29305;&#24065;&#26399;&#26435;&#20559;&#24494;&#20998;&#26041;&#31243;&#26469;&#23450;&#20215;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;
Cryptocurrencies and Bitcoin, in particular, are prone to wild swings resulting in frequent jumps in prices, making them historically popular for traders to speculate. A better understanding of these fluctuations can greatly benefit crypto investors by allowing them to make informed decisions. It is claimed in recent literature that Bitcoin price is influenced by sentiment about the Bitcoin system. Transaction, as well as the popularity, have shown positive evidence as potential drivers of Bitcoin price. This study considers a bivariate jump-diffusion model to describe Bitcoin price dynamics and the number of Google searches affecting the price, representing a sentiment indicator. We obtain a closed formula for the Bitcoin price and derive the Black-Scholes equation for Bitcoin options. We first solve the corresponding Bitcoin option partial differential equation for the pricing process by introducing artificial neural networks and incorporating multi-layer perceptron techniques. The p
&lt;/p&gt;</description></item><item><title>Prime Match&#26159;&#19968;&#20010;&#20445;&#25252;&#38544;&#31169;&#30340;&#24211;&#23384;&#37197;&#23545;&#31995;&#32479;&#65292;&#35299;&#20915;&#20102;&#37329;&#34701;&#39046;&#22495;&#20013;&#20080;&#23478;&#21644;&#21334;&#23478;&#22312;&#20132;&#26131;&#26426;&#21046;&#20013;&#23545;&#20110;&#35746;&#21333;&#20449;&#24687;&#30340;&#25285;&#24551;&#65292;&#30830;&#20445;&#20132;&#26131;&#30340;&#38544;&#31169;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.09621</link><description>&lt;p&gt;
Prime Match: &#19968;&#20010;&#20445;&#25252;&#38544;&#31169;&#30340;&#24211;&#23384;&#37197;&#23545;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
Prime Match: A Privacy-Preserving Inventory Matching System. (arXiv:2310.09621v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09621
&lt;/p&gt;
&lt;p&gt;
Prime Match&#26159;&#19968;&#20010;&#20445;&#25252;&#38544;&#31169;&#30340;&#24211;&#23384;&#37197;&#23545;&#31995;&#32479;&#65292;&#35299;&#20915;&#20102;&#37329;&#34701;&#39046;&#22495;&#20013;&#20080;&#23478;&#21644;&#21334;&#23478;&#22312;&#20132;&#26131;&#26426;&#21046;&#20013;&#23545;&#20110;&#35746;&#21333;&#20449;&#24687;&#30340;&#25285;&#24551;&#65292;&#30830;&#20445;&#20132;&#26131;&#30340;&#38544;&#31169;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24211;&#23384;&#37197;&#23545;&#26159;&#19968;&#31181;&#26631;&#20934;&#30340;&#37329;&#34701;&#32929;&#31080;&#20132;&#26131;&#26426;&#21046;/&#25293;&#21334;&#65292;&#20080;&#23478;&#21644;&#21334;&#23478;&#21487;&#20197;&#36827;&#34892;&#37197;&#23545;&#20132;&#26131;&#12290;&#22312;&#37329;&#34701;&#30028;&#20013;&#65292;&#38134;&#34892;&#32463;&#24120;&#25215;&#25285;&#23547;&#25214;&#23458;&#25143;&#20043;&#38388;&#21305;&#37197;&#30340;&#20219;&#21153;&#12290;&#30456;&#20851;&#30340;&#32929;&#31080;&#21487;&#20197;&#20132;&#26131;&#65292;&#32780;&#19981;&#20250;&#23545;&#20219;&#20309;&#19968;&#26041;&#30340;&#24066;&#22330;&#20215;&#26684;&#20135;&#29983;&#19981;&#21033;&#24433;&#21709;&#12290;&#22914;&#26524;&#25214;&#21040;&#20102;&#23458;&#25143;&#20043;&#38388;&#30340;&#21305;&#37197;&#65292;&#38134;&#34892;&#21487;&#20197;&#20197;&#20248;&#24800;&#20215;&#26684;&#36827;&#34892;&#20132;&#26131;&#12290;&#22914;&#26524;&#25214;&#19981;&#21040;&#21305;&#37197;&#65292;&#24403;&#20107;&#26041;&#24517;&#39035;&#22312;&#20844;&#24320;&#24066;&#22330;&#19978;&#36141;&#20080;&#25110;&#20986;&#21806;&#32929;&#31080;&#65292;&#36825;&#20250;&#22686;&#21152;&#39069;&#22806;&#30340;&#25104;&#26412;&#12290;&#24403;&#21069;&#35813;&#36807;&#31243;&#23384;&#22312;&#30340;&#38382;&#39064;&#26159;&#65292;&#30456;&#20851;&#24403;&#20107;&#26041;&#24517;&#39035;&#19982;&#38134;&#34892;&#20998;&#20139;&#20182;&#20204;&#20080;&#20837;&#25110;&#21334;&#20986;&#29305;&#23450;&#32929;&#31080;&#30340;&#35746;&#21333;&#20197;&#21450;&#39044;&#26399;&#25968;&#37327;&#65288;&#32929;&#31080;&#25968;&#37327;&#65289;&#12290;&#23458;&#25143;&#25285;&#24515;&#65292;&#22914;&#26524;&#36825;&#20123;&#20449;&#24687;&#22312;&#26576;&#31181;&#26041;&#24335;&#19979;&#27844;&#38706;&#65292;&#37027;&#20040;&#20854;&#20182;&#24066;&#22330;&#21442;&#19982;&#32773;&#23558;&#30693;&#26195;&#20182;&#20204;&#30340;&#24847;&#22270;&#65292;&#24182;&#22312;&#20182;&#20204;&#30340;&#20132;&#26131;&#23436;&#25104;&#20043;&#21069;&#23548;&#33268;&#32929;&#31080;&#20215;&#26684;&#36870;&#21183;&#27874;&#21160;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#35299;&#20915;&#26041;&#27861;&#65292;Prime Match&#65292;
&lt;/p&gt;
&lt;p&gt;
Inventory matching is a standard mechanism/auction for trading financial stocks by which buyers and sellers can be paired. In the financial world, banks often undertake the task of finding such matches between their clients. The related stocks can be traded without adversely impacting the market price for either client. If matches between clients are found, the bank can offer the trade at advantageous rates. If no match is found, the parties have to buy or sell the stock in the public market, which introduces additional costs. A problem with the process as it is presently conducted is that the involved parties must share their order to buy or sell a particular stock, along with the intended quantity (number of shares), to the bank. Clients worry that if this information were to leak somehow, then other market participants would become aware of their intentions and thus cause the price to move adversely against them before their transaction finalizes. We provide a solution, Prime Match,
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35752;&#35770;&#20102;&#31185;&#23398;&#30740;&#31350;&#21644;&#31454;&#20105;&#32972;&#26223;&#19979;&#21331;&#36234;&#30340;&#27010;&#24565;&#12290;</title><link>http://arxiv.org/abs/2310.09588</link><description>&lt;p&gt;
"&#20851;&#20110;&#31185;&#23398;&#21331;&#36234;&#19982;&#31454;&#20105;&#30340;&#35770;&#25991;"
&lt;/p&gt;
&lt;p&gt;
\"Uber wissenschaftliche Exzellenz und Wettbewerb. (arXiv:2310.09588v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09588
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#31185;&#23398;&#30740;&#31350;&#21644;&#31454;&#20105;&#32972;&#26223;&#19979;&#21331;&#36234;&#30340;&#27010;&#24565;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36861;&#27714;&#21331;&#36234;&#20284;&#20046;&#26159;&#23398;&#26415;&#30028;&#30340;&#30495;&#27491;&#30446;&#26631;&#12290;&#21331;&#36234;&#26159;&#20160;&#20040;&#24847;&#24605;&#65311;&#33021;&#21542;&#34913;&#37327;&#21331;&#36234;&#65311;&#26412;&#25991;&#35752;&#35770;&#20102;&#22312;&#30740;&#31350;&#21644;&#31454;&#20105;&#30340;&#32972;&#26223;&#19979;&#21331;&#36234;&#30340;&#27010;&#24565;&#12290;
&lt;/p&gt;
&lt;p&gt;
The pursuit of excellence seems to be the True North of academia. What is meant by excellence? Can excellence be measured? This article discusses the concept of excellence in the context of research and competition.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#21033;&#29992;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#35299;&#20915;&#31232;&#30095;&#25237;&#36164;&#32452;&#21512;&#30340;&#25351;&#25968;&#36319;&#36394;&#38382;&#39064;&#30340;&#26032;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#21033;&#29992;&#25345;&#20037;&#24615;&#21516;&#35843;&#34913;&#37327;&#36164;&#20135;&#39118;&#38505;&#65292;&#24182;&#36890;&#36807;&#25299;&#25169;&#23398;&#20064;&#21442;&#25968;&#30340;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#36827;&#34892;&#27491;&#21017;&#21270;&#12290;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;&#36825;&#31181;&#25216;&#26415;&#22312;&#39118;&#38505;&#25511;&#21046;&#26041;&#38754;&#20248;&#20110;&#20256;&#32479;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2310.09578</link><description>&lt;p&gt;
&#31232;&#30095;&#25351;&#25968;&#36319;&#36394;&#30340;&#25299;&#25169;&#23398;&#20064;&#26041;&#27861;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Sparse Index Tracking via Topological Learning. (arXiv:2310.09578v1 [cs.CE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09578
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#21033;&#29992;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#35299;&#20915;&#31232;&#30095;&#25237;&#36164;&#32452;&#21512;&#30340;&#25351;&#25968;&#36319;&#36394;&#38382;&#39064;&#30340;&#26032;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#21033;&#29992;&#25345;&#20037;&#24615;&#21516;&#35843;&#34913;&#37327;&#36164;&#20135;&#39118;&#38505;&#65292;&#24182;&#36890;&#36807;&#25299;&#25169;&#23398;&#20064;&#21442;&#25968;&#30340;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#36827;&#34892;&#27491;&#21017;&#21270;&#12290;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;&#36825;&#31181;&#25216;&#26415;&#22312;&#39118;&#38505;&#25511;&#21046;&#26041;&#38754;&#20248;&#20110;&#20256;&#32479;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#36890;&#36807;&#21033;&#29992;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#65288;TDA&#65289;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#26469;&#35299;&#20915;&#31232;&#30095;&#25237;&#36164;&#32452;&#21512;&#30340;&#25351;&#25968;&#36319;&#36394;&#38382;&#39064;&#12290;&#25105;&#20204;&#21033;&#29992;&#25345;&#20037;&#24615;&#21516;&#35843;&#26469;&#34913;&#37327;&#36164;&#20135;&#30340;&#39118;&#38505;&#24615;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#23398;&#20064;&#21442;&#25968;&#27491;&#21017;&#21270;&#39033;&#30340;&#25299;&#25169;&#26041;&#27861;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#21033;&#29992;Vietoris-Rips&#28388;&#27874;&#26041;&#27861;&#26469;&#25429;&#25417;&#36164;&#20135;&#36816;&#21160;&#30340;&#22797;&#26434;&#25299;&#25169;&#29305;&#24449;&#65292;&#25552;&#20379;&#20102;&#19968;&#20010;&#24378;&#22823;&#30340;&#25237;&#36164;&#32452;&#21512;&#36319;&#36394;&#26694;&#26550;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20855;&#26377;&#21516;&#26102;&#36866;&#24212;$\ell_1$&#21644;$\ell_2$&#24809;&#32602;&#39033;&#30340;&#20248;&#21183;&#65292;&#32780;&#26080;&#38656;&#26114;&#36149;&#30340;&#20272;&#35745;&#36807;&#31243;&#12290;&#25105;&#20204;&#36890;&#36807;&#20351;&#29992;&#21253;&#21547;23&#24180;&#30340;S&amp;P500&#25351;&#25968;&#21450;&#20854;&#25104;&#20998;&#25968;&#25454;&#30340;&#25968;&#25454;&#38598;&#65292;&#23545;&#25105;&#20204;&#30340;&#26041;&#27861;&#36827;&#34892;&#20102;&#23454;&#35777;&#39564;&#35777;&#65292;&#24182;&#19982;Elastic-Net&#21644;SLOPE&#31561;&#26368;&#20808;&#36827;&#30340;&#31232;&#30095;&#25351;&#25968;&#36319;&#36394;&#25216;&#26415;&#36827;&#34892;&#20102;&#23545;&#27604;&#12290;&#25105;&#20204;&#30340;&#26679;&#26412;&#22806;&#32467;&#26524;&#34920;&#26126;&#65292;&#36825;&#31181;&#35745;&#31639;&#25928;&#29575;&#39640;&#30340;&#25216;&#26415;&#22312;&#39118;&#38505;&#25511;&#21046;&#26041;&#38754;&#36229;&#36807;&#20102;&#20256;&#32479;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this research, we introduce a novel methodology for the index tracking problem with sparse portfolios by leveraging topological data analysis (TDA). Utilizing persistence homology to measure the riskiness of assets, we introduce a topological method for data-driven learning of the parameters for regularization terms. Specifically, the Vietoris-Rips filtration method is utilized to capture the intricate topological features of asset movements, providing a robust framework for portfolio tracking. Our approach has the advantage of accommodating both $\ell_1$ and $\ell_2$ penalty terms without the requirement for expensive estimation procedures. We empirically validate the performance of our methodology against state-of-the-art sparse index tracking techniques, such as Elastic-Net and SLOPE, using a dataset that covers 23 years of S&amp;P500 index and its constituent data. Our out-of-sample results show that this computationally efficient technique surpasses conventional methods across risk
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#32034;&#20102;&#22914;&#20309;&#26368;&#22823;&#21270;&#22269;&#20869;&#20809;&#20239;&#23433;&#35013;&#30340;&#25237;&#36164;&#22238;&#25253;&#12290;&#36890;&#36807;&#22312;&#29983;&#20135;&#33021;&#21147;&#33539;&#22260;&#20869;&#36880;&#27493;&#36924;&#36817;&#36127;&#33655;&#26354;&#32447;&#65292;&#25105;&#20204;&#21457;&#29616;&#23454;&#26102;&#20915;&#31574;&#21487;&#20197;&#33410;&#30465;16&#65285;&#30340;&#33021;&#28304;&#65292;&#21516;&#26102;&#30740;&#31350;&#20102;&#29420;&#31435;&#20110;&#20809;&#20239;&#30340;&#35774;&#22791;&#31649;&#29702;&#31574;&#30053;&#12290;</title><link>http://arxiv.org/abs/2310.09323</link><description>&lt;p&gt;
&#22269;&#20869;&#20809;&#20239;&#23433;&#35013;&#30340;&#26368;&#22823;&#25237;&#36164;&#22238;&#25253;
&lt;/p&gt;
&lt;p&gt;
Maximum Return on Investment for a Domestic Photovoltaic Installation. (arXiv:2310.09323v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09323
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#32034;&#20102;&#22914;&#20309;&#26368;&#22823;&#21270;&#22269;&#20869;&#20809;&#20239;&#23433;&#35013;&#30340;&#25237;&#36164;&#22238;&#25253;&#12290;&#36890;&#36807;&#22312;&#29983;&#20135;&#33021;&#21147;&#33539;&#22260;&#20869;&#36880;&#27493;&#36924;&#36817;&#36127;&#33655;&#26354;&#32447;&#65292;&#25105;&#20204;&#21457;&#29616;&#23454;&#26102;&#20915;&#31574;&#21487;&#20197;&#33410;&#30465;16&#65285;&#30340;&#33021;&#28304;&#65292;&#21516;&#26102;&#30740;&#31350;&#20102;&#29420;&#31435;&#20110;&#20809;&#20239;&#30340;&#35774;&#22791;&#31649;&#29702;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27431;&#27954;&#19981;&#26029;&#19978;&#28072;&#30340;&#33021;&#28304;&#20215;&#26684;&#21644;&#36843;&#20999;&#38656;&#35201;&#35299;&#20915;&#20840;&#29699;&#21464;&#26262;&#38382;&#39064;&#65292;&#22312;&#22269;&#20869;&#23433;&#35013;&#20809;&#20239;&#31995;&#32479;&#20197;&#21033;&#29992;&#22826;&#38451;&#33021;&#30340;&#38656;&#27714;&#26174;&#33879;&#22686;&#21152;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#22826;&#38451;&#33021;&#21482;&#22312;&#30333;&#22825;&#21487;&#29992;&#19988;&#20854;&#21487;&#29992;&#24615;&#27599;&#22825;&#37117;&#26377;&#25152;&#21464;&#21270;&#65292;&#26377;&#25928;&#22320;&#36716;&#31227;&#33021;&#28304;&#20351;&#29992;&#21464;&#24471;&#33267;&#20851;&#37325;&#35201;&#12290;&#34429;&#28982;&#30005;&#27744;&#21487;&#20197;&#24110;&#21161;&#20648;&#23384;&#22810;&#20313;&#33021;&#28304;&#65292;&#20294;&#39640;&#26114;&#30340;&#20215;&#26684;&#38480;&#21046;&#20102;&#20854;&#24191;&#27867;&#25512;&#24191;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;&#36127;&#33655;&#30340;&#37325;&#35201;&#24615;&#20197;&#26368;&#22823;&#21270;&#25237;&#36164;&#22238;&#25253;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#36880;&#27493;&#36924;&#36817;&#30340;&#26041;&#27861;&#23558;&#36127;&#33655;&#26354;&#32447;&#36866;&#24212;&#21040;&#29983;&#20135;&#33021;&#21147;&#33539;&#22260;&#20869;&#65292;&#20197;&#20415;&#23454;&#38469;&#23454;&#26045;&#12290;&#25105;&#20204;&#27604;&#36739;&#20102;&#19981;&#21516;&#30340;&#20202;&#34920;&#20998;&#36776;&#29575;&#65306;1&#31186;&#12289;5&#20998;&#38047;&#12289;15&#20998;&#38047;&#21644;1&#23567;&#26102;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#25581;&#31034;&#20102;&#23454;&#26102;&#20915;&#31574;&#65288;&#27599;&#31186;&#65289;&#30456;&#36739;&#20110;&#27599;&#23567;&#26102;&#20915;&#31574;&#65292;&#33410;&#33021;16&#65285;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;&#19977;&#31181;&#35774;&#22791;&#31649;&#29702;&#31574;&#30053;&#65306;&#29420;&#31435;&#20110;&#20809;&#20239;&#30340;&#24320;/&#20851;&#31649;&#29702;
&lt;/p&gt;
&lt;p&gt;
The rising energy prices in Europe and the urgent need to address global warming have sparked a significant increase in the installation of domestic photovoltaic systems to harness solar energy. However, since solar energy is available only during daytime hours and its availability varies daily, effectively shifting energy use becomes crucial. Whilst batteries can assist in storing excess energy, their high prices hinder their widespread adoption. In this study, we explore the importance of load to maximise return on investment. We propose an incremental approach to fitting load profiles into the production envelope, allowing for practical implementation. We compare different meter resolutions: 1 second, 5 minutes, 15 minutes, and 1 hour. Our analysis reveals that making real-time decisions (per second) leads to significant energy savings of 16\% compared to hourly decisions. Furthermore, we explore three types of device management strategies: ON/OFF management independent of PV produc
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#35752;&#35770;&#20102;&#19968;&#20010;&#20855;&#26377;&#30830;&#23450;&#24615;&#22686;&#38271;&#21644;&#20056;&#24615;&#36339;&#36291;&#30340;&#39118;&#38505;&#36807;&#31243;&#65292;&#27169;&#25311;&#20102;&#20302;&#25910;&#20837;&#23478;&#24237;&#30340;&#36164;&#26412;&#12290;&#36890;&#36807;&#20998;&#26512;&#38519;&#38449;&#27010;&#29575;&#21644;&#24341;&#20837;&#27604;&#20363;&#35206;&#30422;&#30340;&#20445;&#38505;&#20135;&#21697;&#65292;&#30740;&#31350;&#20102;&#20445;&#38505;&#23545;&#23478;&#24237;&#38519;&#20837;&#36139;&#22256;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2310.09295</link><description>&lt;p&gt;
&#20851;&#20110;&#20445;&#38505;&#23545;&#26131;&#21463;&#38543;&#26426;&#27604;&#20363;&#25439;&#22833;&#24433;&#21709;&#30340;&#30740;&#31350;&#65306;&#36139;&#22256;&#38519;&#38449;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
On the impact of insurance on households susceptible to random proportional losses: An analysis of poverty trapping. (arXiv:2310.09295v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09295
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35752;&#35770;&#20102;&#19968;&#20010;&#20855;&#26377;&#30830;&#23450;&#24615;&#22686;&#38271;&#21644;&#20056;&#24615;&#36339;&#36291;&#30340;&#39118;&#38505;&#36807;&#31243;&#65292;&#27169;&#25311;&#20102;&#20302;&#25910;&#20837;&#23478;&#24237;&#30340;&#36164;&#26412;&#12290;&#36890;&#36807;&#20998;&#26512;&#38519;&#38449;&#27010;&#29575;&#21644;&#24341;&#20837;&#27604;&#20363;&#35206;&#30422;&#30340;&#20445;&#38505;&#20135;&#21697;&#65292;&#30740;&#31350;&#20102;&#20445;&#38505;&#23545;&#23478;&#24237;&#38519;&#20837;&#36139;&#22256;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#20855;&#26377;&#30830;&#23450;&#24615;&#22686;&#38271;&#21644;&#20056;&#24615;&#36339;&#36291;&#30340;&#39118;&#38505;&#36807;&#31243;&#65292;&#20197;&#27169;&#25311;&#20302;&#25910;&#20837;&#23478;&#24237;&#30340;&#36164;&#26412;&#12290;&#32771;&#34385;&#21040;&#20302;&#25910;&#20837;&#29615;&#22659;&#30340;&#39640;&#39118;&#38505;&#24615;&#36136;&#65292;&#20551;&#35774;&#36164;&#26412;&#25439;&#22833;&#19982;&#36339;&#36291;&#26102;&#31215;&#32047;&#30340;&#36164;&#26412;&#27700;&#24179;&#25104;&#27491;&#27604;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#25512;&#23548;&#19968;&#20010;&#23478;&#24237;&#38519;&#20837;&#36139;&#22256;&#32447;&#20197;&#19979;&#30340;&#27010;&#29575;&#65292;&#21363;&#38519;&#38449;&#27010;&#29575;&#65292;&#20854;&#20013;&#8220;&#38519;&#38449;&#8221;&#21457;&#29983;&#22312;&#23478;&#24237;&#36164;&#26412;&#27700;&#24179;&#38477;&#21040;&#36139;&#22256;&#32447;&#20197;&#19979;&#65292;&#22788;&#20110;&#38656;&#35201;&#22806;&#37096;&#24110;&#21161;&#25165;&#33021;&#25670;&#33073;&#30340;&#22256;&#22659;&#20013;&#12290;&#32771;&#34385;&#23558;&#21097;&#20313;&#30340;&#36164;&#26412;&#27604;&#20363;&#20998;&#24067;&#35270;&#20026;&#36125;&#22612;&#20998;&#24067;&#30340;&#29305;&#27530;&#24773;&#20917;&#65292;&#36890;&#36807;&#20998;&#26512;&#36807;&#31243;&#30340;&#26080;&#31351;&#23567;&#29983;&#25104;&#20803;&#30340;&#25289;&#26222;&#25289;&#26031;&#21464;&#25442;&#65292;&#24471;&#21040;&#20102;&#38519;&#38449;&#27010;&#29575;&#30340;&#23553;&#38381;&#24418;&#24335;&#34920;&#36798;&#12290;&#20026;&#20102;&#30740;&#31350;&#20445;&#38505;&#23545;&#35813;&#27010;&#29575;&#30340;&#24433;&#21709;&#65292;&#20171;&#32461;&#20102;&#19968;&#31181;&#25552;&#20379;&#27604;&#20363;&#35206;&#30422;&#30340;&#20445;&#38505;&#20135;&#21697;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we consider a risk process with deterministic growth and multiplicative jumps to model the capital of a low-income household. Reflecting the high-risk nature of the low-income environment, capital losses are assumed to be proportional to the level of accumulated capital at the jump time. Our aim is to derive the probability that a household falls below the poverty line, i.e. the trapping probability, where ``trapping" occurs when the level of capital of a household holds falls below the poverty line, to an area from which it is difficult to escape without external help. Considering the remaining proportion of capital to be distributed as a special case of the beta distribution, closed-form expressions for the trapping probability are obtained via analysis of the Laplace transform of the infinitesimal generator of the process. To study the impact of insurance on this probability, introduction of an insurance product offering proportional coverage is presented. The infinit
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#23454;&#35777;&#30740;&#31350;&#20102;&#21033;&#28070;&#21644;&#25439;&#22833;&#20998;&#37197;&#20013;&#30340;&#19977;&#31181;&#20998;&#35299;&#21407;&#21017;&#65292;&#21457;&#29616;&#19968;&#27425;&#19968;&#20010;&#20998;&#35299;&#20250;&#20135;&#29983;&#26080;&#27861;&#35299;&#37322;&#30340;&#25439;&#22833;&#65292;&#32780;&#39034;&#24207;&#26356;&#26032;&#21644;&#24179;&#22343;&#39034;&#24207;&#26356;&#26032;&#21487;&#20197;&#23436;&#20840;&#35299;&#37322;&#21033;&#28070;&#21644;&#25439;&#22833;&#65292;&#19988;&#39034;&#24207;&#26356;&#26032;&#19982;&#26356;&#26032;&#39034;&#24207;&#26377;&#20851;&#12290;&#27492;&#22806;&#65292;&#20998;&#35299;&#21407;&#21017;&#30340;&#32467;&#26524;&#20063;&#21463;&#23376;&#21306;&#38388;&#22823;&#23567;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2309.07667</link><description>&lt;p&gt;
&#21033;&#28070;&#21644;&#25439;&#22833;&#20998;&#37197;&#30340;&#23454;&#35777;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
An empirical study of profit and loss allocations. (arXiv:2309.07667v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.07667
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#23454;&#35777;&#30740;&#31350;&#20102;&#21033;&#28070;&#21644;&#25439;&#22833;&#20998;&#37197;&#20013;&#30340;&#19977;&#31181;&#20998;&#35299;&#21407;&#21017;&#65292;&#21457;&#29616;&#19968;&#27425;&#19968;&#20010;&#20998;&#35299;&#20250;&#20135;&#29983;&#26080;&#27861;&#35299;&#37322;&#30340;&#25439;&#22833;&#65292;&#32780;&#39034;&#24207;&#26356;&#26032;&#21644;&#24179;&#22343;&#39034;&#24207;&#26356;&#26032;&#21487;&#20197;&#23436;&#20840;&#35299;&#37322;&#21033;&#28070;&#21644;&#25439;&#22833;&#65292;&#19988;&#39034;&#24207;&#26356;&#26032;&#19982;&#26356;&#26032;&#39034;&#24207;&#26377;&#20851;&#12290;&#27492;&#22806;&#65292;&#20998;&#35299;&#21407;&#21017;&#30340;&#32467;&#26524;&#20063;&#21463;&#23376;&#21306;&#38388;&#22823;&#23567;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27599;&#20010;&#19994;&#21153;&#24180;&#24230;&#30340;&#25237;&#36164;&#21033;&#28070;&#21644;&#25439;&#22833;&#65288;p&#65286;l&#65289;&#34987;&#20998;&#35299;&#20026;&#19981;&#21516;&#30340;&#39118;&#38505;&#22240;&#32032;&#65288;&#22914;&#21033;&#29575;&#12289;&#20449;&#29992;&#21033;&#24046;&#12289;&#22806;&#27719;&#27719;&#29575;&#31561;&#65289;&#26159;&#19968;&#39033;&#30417;&#31649;&#35201;&#27714;&#30340;&#20219;&#21153;&#65292;&#20363;&#22914; Solvency 2&#12290;&#30446;&#21069;&#26377;&#19977;&#31181;&#24120;&#35265;&#30340;&#20998;&#35299;&#21407;&#21017;&#65306;&#19968;&#27425;&#19968;&#20010;&#65288;OAT&#65289;&#12289;&#39034;&#24207;&#26356;&#26032;&#65288;SU&#65289;&#21644;&#24179;&#22343;&#39034;&#24207;&#26356;&#26032;&#65288;ASU&#65289;&#20998;&#35299;&#12290;SU&#21644;ASU&#20998;&#35299;&#23436;&#20840;&#35299;&#37322;&#20102;p&#65286;l&#12290;&#28982;&#32780;&#65292;OAT&#20998;&#35299;&#20250;&#20135;&#29983;&#19968;&#20123;&#26080;&#27861;&#35299;&#37322;&#30340;p&#65286;l&#12290;SU&#20998;&#35299;&#21462;&#20915;&#20110;&#39118;&#38505;&#22240;&#32032;&#30340;&#39034;&#24207;&#25110;&#26631;&#31614;&#12290;&#36825;&#19977;&#31181;&#20998;&#35299;&#21487;&#20197;&#20351;&#29992;&#24180;&#24230;&#12289;&#23395;&#24230;&#12289;&#26376;&#24230;&#25110;&#26085;&#24120;&#25968;&#25454;&#22312;&#19981;&#21516;&#30340;&#23376;&#21306;&#38388;&#23450;&#20041;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#32463;&#39564;&#24615;&#22320;&#37327;&#21270;&#20102;OAT&#20998;&#35299;&#30340;&#26080;&#27861;&#35299;&#37322;&#30340;p&#65286;l&#65292;SU&#20998;&#35299;&#23545;&#26356;&#26032;&#39034;&#24207;&#30340;&#20381;&#36182;&#20197;&#21450;&#19977;&#31181;&#20998;&#35299;&#21407;&#21017;&#22312;&#23376;&#21306;&#38388;&#22823;&#23567;&#19978;&#30340;&#20381;&#36182;&#31243;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
The decomposition of the investment profit and loss (p&amp;l) for each business year into different risk factors (e.g., interest rates, credit spreads, foreign exchange rate etc.) is a task that is regulatory required, e.g., by Solvency 2. Three different decomposition principles are prevalent: one-at-a-time (OAT), sequential updating (SU) and average sequential updating (ASU) decompositions. The SU and the ASU decompositions explain the p&amp;l fully. However, the OAT decomposition generates some unexplained p&amp;l. The SU decomposition depends on the order or labeling of the risk factors. The three decompositions can be defined on different sub-intervals using annually, quarterly, monthly or daily data. In this research, we empirically quantify: the unexplained p\&amp;l of the OAT decomposition; the dependence of the SU decomposition on the update order; and how much the three decomposition principles depend on the size of the sub-intervals.
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;&#24066;&#22330;&#21147;&#37327;&#21644;&#20225;&#19994;&#21033;&#28070;&#23545;&#36890;&#32960;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#23454;&#38469;&#21033;&#29575;&#19979;&#38477;&#23548;&#33268;&#32463;&#27982;&#21033;&#28070;&#21644;&#21152;&#20215;&#26174;&#33879;&#22686;&#38271;&#65292;&#20294;&#20225;&#19994;&#21033;&#28070;&#23545;&#36890;&#32960;&#30340;&#24433;&#21709;&#36739;&#23567;&#12290;</title><link>http://arxiv.org/abs/2307.08968</link><description>&lt;p&gt;
&#24320;&#22987;&#30340;&#36235;&#21183;&#65306;&#21033;&#29575;&#12289;&#21152;&#20215;&#21644;&#36890;&#32960;&#12290;(arXiv:2307.08968v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
The Begining of the Trend: Interest Rates, Markups, and Inflation. (arXiv:2307.08968v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.08968
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;&#24066;&#22330;&#21147;&#37327;&#21644;&#20225;&#19994;&#21033;&#28070;&#23545;&#36890;&#32960;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#23454;&#38469;&#21033;&#29575;&#19979;&#38477;&#23548;&#33268;&#32463;&#27982;&#21033;&#28070;&#21644;&#21152;&#20215;&#26174;&#33879;&#22686;&#38271;&#65292;&#20294;&#20225;&#19994;&#21033;&#28070;&#23545;&#36890;&#32960;&#30340;&#24433;&#21709;&#36739;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#30340;&#25991;&#29486;&#35748;&#20026;&#23454;&#38469;&#21033;&#29575;&#19979;&#38477;&#23548;&#33268;&#32463;&#27982;&#21033;&#28070;&#21644;&#21152;&#20215;&#26174;&#33879;&#22686;&#38271;&#12290;&#22240;&#27492;&#65292;&#26377;&#20154;&#35748;&#20026;&#24066;&#22330;&#21147;&#37327;&#30340;&#22686;&#24378;&#19982;&#36890;&#32960;&#26377;&#20851;&#12290;&#25105;&#20204;&#36890;&#36807;&#20004;&#20010;&#30456;&#20851;&#30340;&#20363;&#23376;&#65292;&#21363;&#34987;&#35270;&#20026;&#21152;&#20215;&#19978;&#28072;&#30340;&#24066;&#22330;&#21147;&#37327;&#22686;&#21152;&#21644;&#20225;&#19994;&#21033;&#28070;&#23545;&#36890;&#32960;&#30340;&#24433;&#21709;&#65292;&#23457;&#35270;&#20102;&#26102;&#24207;&#25935;&#24863;&#24615;&#23545;&#20272;&#35745;&#38271;&#26399;&#36235;&#21183;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#34920;&#26126;&#65292;&#26679;&#26412;&#36215;&#22987;&#26085;&#26399;&#21457;&#29983;&#22235;&#24180;&#20559;&#31227;&#20250;&#26174;&#33879;&#24433;&#21709;&#32463;&#27982;&#21033;&#28070;&#22686;&#38271;&#36235;&#21183;&#65292;&#21344;&#36235;&#21183;&#30340;19%&#65292;&#25110;&#32773;2014&#24180;&#27599;&#21517;&#24037;&#20154;3000&#32654;&#20803;&#12290;&#21516;&#26679;&#65292;&#25105;&#20204;&#30340;&#23450;&#24615;&#35777;&#25454;&#34920;&#26126;&#65292;&#22686;&#21152;&#30340;&#20225;&#19994;&#21033;&#28070;&#19981;&#22826;&#21487;&#33021;&#25512;&#21160;&#36890;&#32960;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recent literature argues the decline in real interest rates led to significant increases in economic profits and markups. Consequently, some have linked rising market power to inflation. We scrutinize the effect of time series sensitivity on estimating secular trends through two relevant examples: increasing market power perceived as rising markups and the influence of corporate profits on inflation. Our analysis reveals that a four-year shift in sample start dates significantly affects economic profit growth trends, accounting for 19% of the trend, or $3,000 per worker in 2014. Likewise, our qualitative evidence suggests that increased corporate profits are unlikely to drive inflation.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;&#24130;&#24459;&#20998;&#24067;&#30340;&#38480;&#20215;&#21333;&#25764;&#38144;&#26102;&#38388;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#20013;&#38480;&#20215;&#21333;&#25764;&#38144;&#26102;&#38388;&#36981;&#24490;&#31163;&#25955;&#30340;Tsallis q-&#25351;&#25968;&#20998;&#24067;&#12290;&#30740;&#31350;&#26174;&#31034;&#65292;&#37329;&#34701;&#24066;&#22330;&#35746;&#21333;&#27969;&#37327;&#20013;&#23384;&#22312;&#31283;&#23450;&#30340;&#21453;&#30456;&#20851;&#24615;&#12290;</title><link>http://arxiv.org/abs/2306.00093</link><description>&lt;p&gt;
&#31163;&#25955;$q$&#25351;&#25968;&#38480;&#20215;&#21333;&#25764;&#38144;&#26102;&#38388;&#20998;&#24067;
&lt;/p&gt;
&lt;p&gt;
Discrete $q$-exponential limit order cancellation time distribution. (arXiv:2306.00093v1 [physics.soc-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.00093
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;&#24130;&#24459;&#20998;&#24067;&#30340;&#38480;&#20215;&#21333;&#25764;&#38144;&#26102;&#38388;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#20013;&#38480;&#20215;&#21333;&#25764;&#38144;&#26102;&#38388;&#36981;&#24490;&#31163;&#25955;&#30340;Tsallis q-&#25351;&#25968;&#20998;&#24067;&#12290;&#30740;&#31350;&#26174;&#31034;&#65292;&#37329;&#34701;&#24066;&#22330;&#35746;&#21333;&#27969;&#37327;&#20013;&#23384;&#22312;&#31283;&#23450;&#30340;&#21453;&#30456;&#20851;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30830;&#23450;&#22522;&#20110;&#32473;&#23450;&#32463;&#39564;&#25968;&#25454;&#30340;&#26368;&#20339;&#27169;&#22411;&#26159;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#12290;&#37329;&#34701;&#24066;&#22330;&#20026;&#25105;&#20204;&#25552;&#20379;&#20102;&#22823;&#37327;&#30340;&#32463;&#39564;&#25968;&#25454;&#65292;&#20294;&#26159;&#23545;&#20110;&#30740;&#31350;&#20154;&#21592;&#26469;&#35828;&#65292;&#26368;&#20339;&#27169;&#22411;&#30340;&#36873;&#25321;&#20173;&#28982;&#23384;&#22312;&#38382;&#39064;&#12290;&#20808;&#21069;&#65292;&#25105;&#20204;&#20174;&#24191;&#20041;&#20998;&#25968;L\'{e}vy&#31283;&#23450;&#36816;&#21160;&#30340;&#35282;&#24230;&#30740;&#31350;&#20102;&#35746;&#21333;&#19981;&#24179;&#34913;&#26102;&#38388;&#24207;&#21015;&#65292;&#24182;&#21457;&#29616;&#20102;&#37329;&#34701;&#24066;&#22330;&#35746;&#21333;&#27969;&#37327;&#20013;&#30340;&#31283;&#23450;&#21453;&#30456;&#20851;&#24615;&#12290;&#28982;&#32780;&#65292;&#23545;&#32463;&#39564;&#25968;&#25454;&#36827;&#34892;&#26356;&#35814;&#32454;&#30340;&#32771;&#34385;&#34920;&#26126;&#65292;&#25105;&#20204;&#24212;&#35813;&#22522;&#20110;&#38480;&#20215;&#21333;&#25764;&#38144;&#26102;&#38388;&#30340;&#24130;&#24459;&#20998;&#24067;&#26500;&#24314;&#26356;&#20855;&#20307;&#30340;&#35746;&#21333;&#27969;&#27169;&#22411;&#12290;&#22312;&#32771;&#34385;&#20107;&#20214;&#26102;&#38388;&#26102;&#65292;&#38480;&#20215;&#21333;&#25764;&#38144;&#26102;&#38388;&#36981;&#24490;&#20174;Tsallis q-&#25351;&#25968;&#20998;&#24067;&#20013;&#23548;&#20986;&#30340;&#31163;&#25955;&#27010;&#29575;&#36136;&#37327;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
Identifying the best possible models based on given empirical data of observed time series is challenging. The financial markets provide us with vast empirical data, but the best model selection is still problematic for researchers. The widely used long-range memory and self-similarity estimators give varying values of the parameters as these estimators are developed for specific time series models. Previously we investigated the order disbalance time series from the general fractional L\'{e}vy stable motion perspective and discovered the stable anti-correlation in the order flow of financial markets. Nevertheless, a more detailed consideration of empirical data suggests we construct a more specific order flow model based on the power-law distribution of limit order cancellation times. In the event time consideration, the limit order cancellation times follow the discrete probability mass function derived from the Tsallis q-Exponential distribution. The power-law distribution of the li
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#33258;&#21160;&#20570;&#24066;&#21830;&#26426;&#21046;&#65292;&#20854;&#20013;&#20215;&#26684;&#21457;&#29616;&#19981;&#20165;&#20165;&#20381;&#36182;&#20110;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65292;&#36824;&#20381;&#36182;&#20110;&#22806;&#37096;&#27719;&#29575;&#25110;&#20215;&#26684;&#39044;&#35328;&#26426;&#12290;&#21516;&#26102;&#65292;&#36890;&#36807;&#22343;&#20540;/&#26041;&#24046;&#20998;&#26512;&#65292;&#23558;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#19982;&#25345;&#26377;&#33258;&#21160;&#20570;&#24066;&#21830;&#20197;&#22806;&#36164;&#20135;&#30340;&#20195;&#29702;&#20154;&#36827;&#34892;&#27604;&#36739;&#65292;&#20197;&#35780;&#20272;&#20854;&#30408;&#20111;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2212.00336</link><description>&lt;p&gt;
&#33258;&#21160;&#20570;&#24066;&#21830;&#65306;LP&#30340;&#25910;&#30410;&#30340;&#22343;&#20540;&#26041;&#24046;&#20998;&#26512;&#21644;&#23450;&#20215;&#20989;&#25968;&#30340;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Automated Market Makers: Mean-Variance Analysis of LPs Payoffs and Design of Pricing Functions. (arXiv:2212.00336v3 [q-fin.TR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.00336
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#33258;&#21160;&#20570;&#24066;&#21830;&#26426;&#21046;&#65292;&#20854;&#20013;&#20215;&#26684;&#21457;&#29616;&#19981;&#20165;&#20165;&#20381;&#36182;&#20110;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65292;&#36824;&#20381;&#36182;&#20110;&#22806;&#37096;&#27719;&#29575;&#25110;&#20215;&#26684;&#39044;&#35328;&#26426;&#12290;&#21516;&#26102;&#65292;&#36890;&#36807;&#22343;&#20540;/&#26041;&#24046;&#20998;&#26512;&#65292;&#23558;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#19982;&#25345;&#26377;&#33258;&#21160;&#20570;&#24066;&#21830;&#20197;&#22806;&#36164;&#20135;&#30340;&#20195;&#29702;&#20154;&#36827;&#34892;&#27604;&#36739;&#65292;&#20197;&#35780;&#20272;&#20854;&#30408;&#20111;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#21435;&#20013;&#24515;&#21270;&#37329;&#34701;&#30340;&#20986;&#29616;&#65292;&#20986;&#29616;&#20102;&#26032;&#30340;&#20132;&#26131;&#26426;&#21046;&#31216;&#20026;&#33258;&#21160;&#20570;&#24066;&#21830;&#12290;&#26368;&#27969;&#34892;&#30340;&#33258;&#21160;&#20570;&#24066;&#21830;&#26159;&#24120;&#37327;&#20989;&#25968;&#20570;&#24066;&#21830;&#12290;&#23427;&#20204;&#24050;&#32463;&#22312;&#29702;&#35770;&#21644;&#23454;&#35777;&#26041;&#38754;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;&#29305;&#21035;&#26159;&#65292;&#20986;&#29616;&#20102;&#38750;&#27704;&#20037;&#24615;&#25439;&#22833;&#30340;&#27010;&#24565;&#65292;&#35299;&#37322;&#20102;&#24120;&#37327;&#20989;&#25968;&#20570;&#24066;&#21830;&#20013;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#37096;&#20998;&#30408;&#20111;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#21478;&#19968;&#31181;&#26426;&#21046;&#65292;&#20854;&#20013;&#20215;&#26684;&#21457;&#29616;&#19981;&#20165;&#20165;&#20381;&#36182;&#20110;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65292;&#36824;&#20381;&#36182;&#20110;&#22806;&#37096;&#27719;&#29575;&#25110;&#20215;&#26684;&#39044;&#35328;&#26426;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20351;&#29992;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#25910;&#30410;&#30340;&#22343;&#20540;/&#26041;&#24046;&#20998;&#26512;&#19982;&#33258;&#21160;&#20570;&#24066;&#21830;&#20043;&#22806;&#25345;&#26377;&#36164;&#20135;&#30340;&#20195;&#29702;&#20154;&#30340;&#25910;&#30410;/&#25439;&#22833;&#36827;&#34892;&#27604;&#36739;&#12290;&#29305;&#21035;&#26159;&#65292;&#21463;&#39532;&#31185;&#32500;&#33576;&#29616;&#20195;&#25237;&#36164;&#32452;&#21512;&#29702;&#35770;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#25104;&#21151;&#33719;&#24471;&#20102;&#22312;&#29702;&#24819;&#24773;&#20917;&#19979;&#30340;&#23436;&#32654;&#39044;&#35328;&#26426;&#30340;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#34920;&#29616;&#30340;&#26377;&#25928;&#21069;&#27839;&#12290;
&lt;/p&gt;
&lt;p&gt;
With the emergence of decentralized finance, new trading mechanisms called Automated Market Makers have appeared. The most popular Automated Market Makers are Constant Function Market Makers. They have been studied both theoretically and empirically. In particular, the concept of impermanent loss has emerged and explains part of the profit and loss of liquidity providers in Constant Function Market Makers. In this paper, we propose another mechanism in which price discovery does not solely rely on liquidity takers but also on an external exchange rate or price oracle. We also propose to compare the different mechanisms from the point of view of liquidity providers by using a mean / variance analysis of their profit and loss compared to that of agents holding assets outside of Automated Market Makers. In particular, inspired by Markowitz' modern portfolio theory, we manage to obtain an efficient frontier for the performance of liquidity providers in the idealized case of a perfect oracl
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#24212;&#29992;&#28151;&#28102;&#30340;Sobol&#20302;&#24046;&#24322;&#24207;&#21015;&#65292;&#32467;&#21512;&#20102;&#25311;&#33945;&#29305;&#21345;&#27931;&#21644;&#38543;&#26426;&#21270;&#25311;&#33945;&#29305;&#21345;&#27931;&#30340;&#20248;&#28857;&#65292;&#25552;&#20379;&#20102;&#22312;&#37329;&#34701;&#24212;&#29992;&#20013;&#23454;&#29992;&#30340;&#35823;&#24046;&#30028;&#38480;&#21644;&#25910;&#25947;&#36895;&#24230;&#26356;&#24555;&#30340;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2210.16548</link><description>&lt;p&gt;
&#37325;&#35201;&#24615;&#22312;&#20110;&#28151;&#28102;&#65306;&#36229;&#24378;&#21270;&#25311;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
The importance of being scrambled: supercharged Quasi Monte Carlo. (arXiv:2210.16548v2 [q-fin.CP] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.16548
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#24212;&#29992;&#28151;&#28102;&#30340;Sobol&#20302;&#24046;&#24322;&#24207;&#21015;&#65292;&#32467;&#21512;&#20102;&#25311;&#33945;&#29305;&#21345;&#27931;&#21644;&#38543;&#26426;&#21270;&#25311;&#33945;&#29305;&#21345;&#27931;&#30340;&#20248;&#28857;&#65292;&#25552;&#20379;&#20102;&#22312;&#37329;&#34701;&#24212;&#29992;&#20013;&#23454;&#29992;&#30340;&#35823;&#24046;&#30028;&#38480;&#21644;&#25910;&#25947;&#36895;&#24230;&#26356;&#24555;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35768;&#22810;&#37329;&#34701;&#24212;&#29992;&#20013;&#65292;&#22522;&#20110;Sobol&#20302;&#24046;&#24322;&#24207;&#21015;&#65288;LDS&#65289;&#30340;&#25311;&#33945;&#29305;&#21345;&#27931;&#65288;QMC&#65289;&#26041;&#27861;&#34920;&#29616;&#20986;&#26356;&#24555;&#19988;&#26356;&#31283;&#23450;&#30340;&#25910;&#25947;&#24615;&#65292;&#20248;&#20110;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#19981;&#21516;&#20110;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#65292;QMC&#32570;&#20047;&#23454;&#29992;&#30340;&#35823;&#24046;&#20272;&#35745;&#12290;&#38543;&#26426;&#21270;&#25311;&#33945;&#29305;&#21345;&#27931;&#65288;RQMC&#65289;&#26041;&#27861;&#23558;&#20004;&#31181;&#26041;&#27861;&#30340;&#20248;&#28857;&#32467;&#21512;&#36215;&#26469;&#12290;&#36890;&#36807;&#24212;&#29992;&#28151;&#28102;&#30340;LDS&#65292;&#33021;&#22815;&#35745;&#31639;&#20986;&#20272;&#35745;&#20540;&#21608;&#22260;&#30340;&#32622;&#20449;&#21306;&#38388;&#65292;&#20174;&#32780;&#25552;&#20379;&#23454;&#29992;&#30340;&#35823;&#24046;&#30028;&#38480;&#12290;&#21033;&#29992;&#20004;&#31181;&#26041;&#27861;&#23545;Sobol&#30340;LDS&#36827;&#34892;&#38543;&#26426;&#21270;&#28151;&#28102;&#65292;&#20998;&#21035;&#37319;&#29992;Owen&#30340;&#28151;&#28102;&#21644;&#25968;&#23383;&#20301;&#31227;&#26041;&#27861;&#65292;&#32771;&#34385;&#20351;&#29992;&#36229;&#21338;&#29366;&#23616;&#37096;&#27874;&#21160;&#29575;&#27169;&#22411;&#35745;&#31639;&#20122;&#27954;&#26399;&#26435;&#21644;&#24076;&#33098;&#20540;&#12290; RQMC&#34920;&#29616;&#20986;&#20248;&#20110;&#26631;&#20934;QMC&#30340;&#24615;&#33021;&#65292;&#26174;&#31034;&#20986;&#26356;&#24555;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#24182;&#25552;&#20379;&#23454;&#29992;&#30340;&#35823;&#24046;&#30028;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;
In many financial applications Quasi Monte Carlo (QMC) based on Sobol low-discrepancy sequences (LDS) outperforms Monte Carlo showing faster and more stable convergence. However, unlike MC QMC lacks a practical error estimate. Randomized QMC (RQMC) method combines the best of two methods. Application of scrambled LDS allow to compute confidence intervals around the estimated value, providing a practical error bound. Randomization of Sobol' LDS by two methods: Owen's scrambling and digital shift are compared considering computation of Asian options and Greeks using hyperbolic local volatility model. RQMC demonstrated the superior performance over standard QMC showing increased convergence rates and providing practical error bounds.
&lt;/p&gt;</description></item></channel></rss>