<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#20851;&#20110;&#19968;&#33324;&#22810;&#32500;&#21322;&#38808;&#30340;&#27979;&#24230;&#20540;&#38543;&#26426;&#31215;&#20998;&#30340;&#27010;&#24565;&#65292;&#35777;&#26126;&#20102;&#19968;&#31181;&#26032;&#30340;&#38543;&#26426;Fubini&#23450;&#29702;&#65292;&#24182;&#23637;&#31034;&#20102;&#22914;&#20309;&#22788;&#29702;&#19968;&#20010;&#30456;&#24403;&#19968;&#33324;&#30340;&#38543;&#26426;Volterra&#21322;&#38808;&#30340;&#31867;&#21035;</title><link>https://arxiv.org/abs/2403.13791</link><description>&lt;p&gt;
&#26032;&#30340;&#38543;&#26426;Fubini&#23450;&#29702;
&lt;/p&gt;
&lt;p&gt;
New Stochastic Fubini Theorems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.13791
&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#20851;&#20110;&#19968;&#33324;&#22810;&#32500;&#21322;&#38808;&#30340;&#27979;&#24230;&#20540;&#38543;&#26426;&#31215;&#20998;&#30340;&#27010;&#24565;&#65292;&#35777;&#26126;&#20102;&#19968;&#31181;&#26032;&#30340;&#38543;&#26426;Fubini&#23450;&#29702;&#65292;&#24182;&#23637;&#31034;&#20102;&#22914;&#20309;&#22788;&#29702;&#19968;&#20010;&#30456;&#24403;&#19968;&#33324;&#30340;&#38543;&#26426;Volterra&#21322;&#38808;&#30340;&#31867;&#21035;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32463;&#20856;&#30340;&#38543;&#26426;Fubini&#23450;&#29702;&#34920;&#26126;&#65292;&#22914;&#26524;&#19968;&#20010;&#38543;&#26426;&#38598;&#25104;&#20851;&#20110;&#19968;&#20010;&#21322;&#38808;$S$&#21644;&#19968;&#20010;$\eta(dz)$-&#28151;&#21512;&#30340;$z$&#21442;&#25968;&#21270;&#34987;&#31215;&#20989;&#25968;$\psi^z$&#65292;&#32467;&#26524;&#21482;&#26159;&#20010;&#21035;$z$&#21442;&#25968;&#21270;&#30340;&#38543;&#26426;&#31215;&#20998;$\int\psi^z{d}S$&#30340;$\eta(dz)$&#28151;&#21512;&#12290;&#20294;&#22914;&#26524;&#24819;&#35201;&#23558;&#36825;&#26679;&#30340;&#32467;&#26524;&#29992;&#20110;&#30740;&#31350;&#24418;&#24335;&#20026;$X_t =\int_0^t \Psi_{t,s}dS_s, t \geq0$&#30340;Volterra&#21322;&#38808;&#65292;&#37027;&#20040;&#32463;&#20856;&#20551;&#35774;&#19968;&#20010;&#22266;&#23450;&#27979;&#24230;$\eta$&#22826;&#36807;&#20005;&#26684;&#65307;&#28151;&#21512;&#22312;&#34987;&#31215;&#20989;&#25968;&#19978;&#38656;&#35201;&#21462;&#32780;&#20195;&#20043;&#22312;&#21442;&#25968;&#31354;&#38388;&#19978;&#30340;&#19968;&#20010;&#38543;&#26426;&#26680;&#20851;&#20110;&#21442;&#25968;&#31354;&#38388;&#12290;&#20026;&#20102;&#22788;&#29702;&#36825;&#31181;&#24773;&#20917;&#24182;&#35777;&#26126;&#30456;&#24212;&#30340;&#26032;&#38543;&#26426;Fubini&#23450;&#29702;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#26032;&#30340;&#20851;&#20110;&#19968;&#33324;&#22810;&#32500;&#21322;&#38808;&#30340;&#27979;&#24230;&#20540;&#38543;&#26426;&#31215;&#20998;&#30340;&#27010;&#24565;&#12290;&#20316;&#20026;&#24212;&#29992;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#22914;&#20309;&#22788;&#29702;&#19968;&#20010;&#30456;&#24403;&#19968;&#33324;&#30340;&#38543;&#26426;Volterra&#21322;&#38808;&#30340;&#31867;&#21035;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.13791v1 Announce Type: cross  Abstract: The classic stochastic Fubini theorem says that if one stochastically integrates with respect to a semimartingale $S$ an $\eta(dz)$-mixture of $z$-parametrized integrands $\psi^z$, the result is just the $\eta(dz)$-mixture of the individual $z$-parametrized stochastic integrals $\int\psi^z{d}S.$ But if one wants to use such a result for the study of Volterra semimartingales of the form $ X_t =\int_0^t \Psi_{t,s}dS_s, t \geq0,$ the classic assumption that one has a fixed measure $\eta$ is too restrictive; the mixture over the integrands needs to be taken instead with respect to a stochastic kernel on the parameter space. To handle that situation and prove a corresponding new stochastic Fubini theorem, we introduce a new notion of measure-valued stochastic integration with respect to a general multidimensional semimartingale. As an application, we show how this allows to handle a class of quite general stochastic Volterra semimartingales
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#32467;&#21512;&#23398;&#20064;&#21644;&#22521;&#35757;&#26041;&#27861;&#20197;&#21450;&#21033;&#29992;&#28216;&#25103;&#21270;&#25552;&#39640;&#25216;&#26415;&#36716;&#31227;&#21644;&#25104;&#24180;&#20154;&#23398;&#20064;&#65292;&#26469;&#21152;&#24378;&#26816;&#27979;&#24656;&#24598;&#34701;&#36164;&#30340;&#25191;&#27861;&#22521;&#35757;&#12290;</title><link>https://arxiv.org/abs/2403.13625</link><description>&lt;p&gt;
&#21152;&#24378;&#25191;&#27861;&#22521;&#35757;&#65306;&#19968;&#31181;&#28216;&#25103;&#21270;&#26041;&#27861;&#26469;&#26816;&#27979;&#24656;&#24598;&#34701;&#36164;
&lt;/p&gt;
&lt;p&gt;
Enhancing Law Enforcement Training: A Gamified Approach to Detecting Terrorism Financing
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.13625
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#32467;&#21512;&#23398;&#20064;&#21644;&#22521;&#35757;&#26041;&#27861;&#20197;&#21450;&#21033;&#29992;&#28216;&#25103;&#21270;&#25552;&#39640;&#25216;&#26415;&#36716;&#31227;&#21644;&#25104;&#24180;&#20154;&#23398;&#20064;&#65292;&#26469;&#21152;&#24378;&#26816;&#27979;&#24656;&#24598;&#34701;&#36164;&#30340;&#25191;&#27861;&#22521;&#35757;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27599;&#22825;&#25512;&#24191;&#21644;&#37096;&#32626;&#29992;&#20110;&#25171;&#20987;&#32593;&#32476;&#29359;&#32618;&#27963;&#21160;&#30340;&#26032;&#25216;&#26415;&#24037;&#20855;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#24037;&#20855;&#24448;&#24448;&#36807;&#20110;&#22797;&#26434;&#65292;&#38590;&#20197;&#20351;&#29992;&#65292;&#38656;&#35201;&#28145;&#20837;&#30340;&#39046;&#22495;&#30693;&#35782;&#21644;&#25216;&#26415;&#30693;&#35782;&#12290;&#36825;&#20123;&#29305;&#28857;&#24448;&#24448;&#38480;&#21046;&#20102;&#25191;&#27861;&#20154;&#21592;&#21644;&#26368;&#32456;&#29992;&#25143;&#21442;&#19982;&#36825;&#20123;&#25216;&#26415;&#65292;&#23613;&#31649;&#23427;&#20204;&#20855;&#26377;&#28508;&#21147;&#65292;&#20294;&#20173;&#28982;&#34987;&#35823;&#35299;&#12290;&#20986;&#20110;&#36825;&#20010;&#21407;&#22240;&#65292;&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25551;&#36848;&#20102;&#32467;&#21512;&#23398;&#20064;&#21644;&#22521;&#35757;&#26041;&#27861;&#20197;&#21450;&#21033;&#29992;&#28216;&#25103;&#21270;&#25552;&#21319;&#25216;&#26415;&#36716;&#31227;&#21644;&#22686;&#21152;&#25104;&#24180;&#20154;&#23398;&#20064;&#30340;&#28508;&#22312;&#22909;&#22788;&#30340;&#32463;&#39564;&#12290;&#20107;&#23454;&#19978;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#21442;&#19982;&#32773;&#26159;&#26292;&#38706;&#20110;&#24656;&#24598;&#34701;&#36164;&#65288;&#22914;&#25191;&#27861;&#20154;&#21592;&#12289;&#37329;&#34701;&#35843;&#26597;&#21592;&#12289;&#31169;&#20154;&#20390;&#25506;&#31561;&#65289;&#30340;&#34892;&#19994;&#30340;&#32463;&#39564;&#20016;&#23500;&#30340;&#20174;&#19994;&#20154;&#21592;&#12290;&#25105;&#20204;&#23450;&#20041;&#20102;&#19981;&#21516;&#32423;&#21035;&#30340;&#22521;&#35757;&#27963;&#21160;&#65292;&#20197;&#22686;&#21152;&#20851;&#20110;&#26032;&#36235;&#21183;&#21644;&#29359;&#32618;&#20316;&#26696;&#26041;&#24335;&#30340;&#20449;&#24687;&#20132;&#27969;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.13625v1 Announce Type: new  Abstract: Tools for fighting cyber-criminal activities using new technologies are promoted and deployed every day. However, too often, they are unnecessarily complex and hard to use, requiring deep domain and technical knowledge. These characteristics often limit the engagement of law enforcement and end-users in these technologies that, despite their potential, remain misunderstood. For this reason, in this study, we describe our experience in combining learning and training methods and the potential benefits of gamification to enhance technology transfer and increase adult learning. In fact, in this case, participants are experienced practitioners in professions/industries that are exposed to terrorism financing (such as Law Enforcement Officers, Financial Investigation Officers, private investigators, etc.) We define training activities on different levels for increasing the exchange of information about new trends and criminal modus operandi a
&lt;/p&gt;</description></item><item><title>&#20351;&#29992;&#26102;&#38388;&#21367;&#31215;&#32593;&#32476;&#26816;&#27979;&#21644;&#20998;&#32423;&#27450;&#39575;&#34892;&#20026;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#32467;&#21512;&#26631;&#27880;&#31639;&#27861;&#21644;&#24369;&#30417;&#30563;&#27169;&#22411;&#26469;&#35782;&#21035;&#28508;&#22312;&#21487;&#30097;&#30340;&#35746;&#21333;&#31807;&#29366;&#24577;&#24207;&#21015;&#12290;</title><link>https://arxiv.org/abs/2403.13429</link><description>&lt;p&gt;
&#20351;&#29992;&#26102;&#38388;&#21367;&#31215;&#32593;&#32476;&#26816;&#27979;&#21644;&#20998;&#32423;&#27450;&#39575;&#34892;&#20026;
&lt;/p&gt;
&lt;p&gt;
Detecting and Triaging Spoofing using Temporal Convolutional Networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.13429
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#26102;&#38388;&#21367;&#31215;&#32593;&#32476;&#26816;&#27979;&#21644;&#20998;&#32423;&#27450;&#39575;&#34892;&#20026;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#32467;&#21512;&#26631;&#27880;&#31639;&#27861;&#21644;&#24369;&#30417;&#30563;&#27169;&#22411;&#26469;&#35782;&#21035;&#28508;&#22312;&#21487;&#30097;&#30340;&#35746;&#21333;&#31807;&#29366;&#24577;&#24207;&#21015;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#31639;&#27861;&#20132;&#26131;&#21644;&#30005;&#23376;&#24066;&#22330;&#19981;&#26029;&#25913;&#21464;&#37329;&#34701;&#24066;&#22330;&#26684;&#23616;&#65292;&#26816;&#27979;&#21644;&#38450;&#33539;&#19981;&#31471;&#20195;&#29702;&#20197;&#32500;&#25345;&#20844;&#24179;&#21644;&#39640;&#25928;&#24066;&#22330;&#33267;&#20851;&#37325;&#35201;&#12290;&#22823;&#25968;&#25454;&#38598;&#30340;&#29190;&#28856;&#21644;&#19981;&#26029;&#21464;&#21270;&#30340;&#34892;&#19994;&#25216;&#24039;&#20351;&#24471;&#38590;&#20197;&#36866;&#24212;&#26032;&#30340;&#24066;&#22330;&#26465;&#20214;&#24182;&#26816;&#27979;&#19981;&#33391;&#34892;&#20026;&#32773;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#21487;&#20197;&#36731;&#26494;&#36866;&#24212;&#26816;&#27979;&#24066;&#22330;&#25805;&#32437;&#39046;&#22495;&#30340;&#21508;&#31181;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#39318;&#20808;&#37319;&#29992;&#19968;&#20010;&#26631;&#27880;&#31639;&#27861;&#65292;&#29992;&#20110;&#21019;&#24314;&#19968;&#20010;&#35757;&#32451;&#38598;&#65292;&#20197;&#23398;&#20064;&#19968;&#20010;&#24369;&#30417;&#30563;&#27169;&#22411;&#26469;&#35782;&#21035;&#28508;&#22312;&#21487;&#30097;&#30340;&#35746;&#21333;&#31807;&#29366;&#24577;&#24207;&#21015;&#12290;&#36825;&#37324;&#30340;&#20027;&#35201;&#30446;&#26631;&#26159;&#23398;&#20064;&#35746;&#21333;&#31807;&#30340;&#34920;&#31034;&#65292;&#20197;&#20415;&#22312;&#23558;&#26469;&#21487;&#20197;&#36731;&#26494;&#27604;&#36739;&#20107;&#20214;&#12290;&#38543;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#23558;&#19987;&#23478;&#35780;&#20272;&#32435;&#20837;&#65292;&#20197;&#23457;&#26597;&#29305;&#23450;&#26631;&#35760;&#30340;&#35746;&#21333;&#31807;&#29366;&#24577;&#12290;&#22312;&#19987;&#23478;&#19981;&#21487;&#29992;&#30340;&#24773;&#20917;&#19979;&#65292;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.13429v1 Announce Type: cross  Abstract: As algorithmic trading and electronic markets continue to transform the landscape of financial markets, detecting and deterring rogue agents to maintain a fair and efficient marketplace is crucial. The explosion of large datasets and the continually changing tricks of the trade make it difficult to adapt to new market conditions and detect bad actors. To that end, we propose a framework that can be adapted easily to various problems in the space of detecting market manipulation. Our approach entails initially employing a labelling algorithm which we use to create a training set to learn a weakly supervised model to identify potentially suspicious sequences of order book states. The main goal here is to learn a representation of the order book that can be used to easily compare future events. Subsequently, we posit the incorporation of expert assessment to scrutinize specific flagged order book states. In the event of an expert's unavai
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#26368;&#22823;&#21270;&#25237;&#36164;&#32773;&#22443;&#30340;&#25193;&#23637;Omega&#27604;&#29575;&#65292;&#26412;&#25991;&#30830;&#23450;&#20102;&#39118;&#38505;&#20056;&#25968;&#65292;&#21516;&#26102;&#20351;&#29992;&#38543;&#26426;&#22522;&#20934;&#20026;&#25237;&#36164;&#32773;&#25552;&#20379;&#21464;&#27604;&#20363;&#25237;&#36164;&#32452;&#21512;&#20445;&#38505;&#65288;VPPI&#65289;&#31574;&#30053;&#12290;</title><link>https://arxiv.org/abs/2403.13388</link><description>&lt;p&gt;
&#22312;&#20855;&#26377;&#38543;&#26426;&#22522;&#20934;&#30340;Omega&#27604;&#29575;&#19979;&#30340;&#26368;&#20339;VPPI&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Optimal VPPI strategy under Omega ratio with stochastic benchmark
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.13388
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#26368;&#22823;&#21270;&#25237;&#36164;&#32773;&#22443;&#30340;&#25193;&#23637;Omega&#27604;&#29575;&#65292;&#26412;&#25991;&#30830;&#23450;&#20102;&#39118;&#38505;&#20056;&#25968;&#65292;&#21516;&#26102;&#20351;&#29992;&#38543;&#26426;&#22522;&#20934;&#20026;&#25237;&#36164;&#32773;&#25552;&#20379;&#21464;&#27604;&#20363;&#25237;&#36164;&#32452;&#21512;&#20445;&#38505;&#65288;VPPI&#65289;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#21464;&#27604;&#20363;&#25237;&#36164;&#32452;&#21512;&#20445;&#38505;&#65288;VPPI&#65289;&#31574;&#30053;&#12290;&#20854;&#30446;&#26631;&#26159;&#36890;&#36807;&#26368;&#22823;&#21270;&#25237;&#36164;&#32773;&#22443;&#30340;&#25193;&#23637;Omega&#27604;&#29575;&#26469;&#30830;&#23450;&#39118;&#38505;&#20056;&#25968;&#65292;&#20351;&#29992;&#19968;&#20010;&#20108;&#20803;&#38543;&#26426;&#22522;&#20934;&#12290;&#24403;&#32929;&#25351;&#19979;&#36300;&#26102;&#65292;&#25237;&#36164;&#32773;&#30340;&#30446;&#26631;&#26159;&#32500;&#25345;&#26368;&#20302;&#20445;&#35777;&#12290;&#30456;&#21453;&#65292;&#24403;&#32929;&#25351;&#19978;&#28072;&#26102;&#65292;&#25237;&#36164;&#32773;&#23547;&#27714;&#36319;&#36394;&#19968;&#20123;&#36229;&#39069;&#25910;&#30410;&#12290;&#20248;&#21270;&#38382;&#39064;&#28041;&#21450;&#23558;&#19968;&#20010;&#38750;&#20985;&#30446;&#26631;&#20989;&#25968;&#19982;&#38543;&#26426;&#22522;&#20934;&#30456;&#32467;&#21512;&#65292;&#36825;&#26159;&#22522;&#20110;&#20985;&#21270;&#25216;&#26415;&#30340;&#38543;&#26426;&#29256;&#26412;&#26377;&#25928;&#35299;&#20915;&#30340;&#12290;&#25105;&#20204;&#20026;&#26368;&#20339;&#39118;&#38505;&#20056;&#25968;&#25512;&#23548;&#20986;&#21322;&#35299;&#26512;&#35299;&#65292;&#20854;&#20540;&#20989;&#25968;&#20998;&#20026;&#19977;&#31181;&#19981;&#21516;&#24773;&#20917;&#12290;&#26377;&#36259;&#30340;&#26159;&#65292;&#20998;&#31867;&#26631;&#20934;&#26159;&#30001;Zieling&#31561;&#20154;&#65288;2014&#24180;&#65289;&#20013;&#26368;&#20339;&#39118;&#38505;&#20056;&#25968;&#19982;1&#20540;&#20043;&#38388;&#30340;&#20851;&#31995;&#30830;&#23450;&#30340;&#12290;&#27169;&#25311;&#32467;&#26524;&#39564;&#35777;&#20102;VPPI&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.13388v1 Announce Type: new  Abstract: This paper studies a variable proportion portfolio insurance (VPPI) strategy. The objective is to determine the risk multiplier by maximizing the extended Omega ratio of the investor's cushion, using a binary stochastic benchmark. When the stock index declines, investors aim to maintain the minimum guarantee. Conversely, when the stock index rises, investors seek to track some excess returns. The optimization problem involves the combination of a non-concave objective function with a stochastic benchmark, which is effectively solved based on the stochastic version of concavification technique. We derive semi-analytical solutions for the optimal risk multiplier, and the value functions are categorized into three distinct cases. Intriguingly, the classification criteria are determined by the relationship between the optimal risky multiplier in Zieling et al. (2014 and the value of 1. Simulation results confirm the effectiveness of the VPPI
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#26088;&#22312;&#36890;&#36807;&#22810;&#37325;&#20998;&#24418;&#23567;&#27874;&#21160;&#24577;&#27169;&#24577;&#20998;&#35299;&#24314;&#27169;&#25506;&#35752;&#22522;&#20110;&#26102;&#38388;&#24207;&#21015;&#30340;&#33829;&#38144;&#27169;&#22411;&#12290;</title><link>https://arxiv.org/abs/2403.13361</link><description>&lt;p&gt;
&#22810;&#37325;&#20998;&#24418;&#23567;&#27874;&#21160;&#24577;&#27169;&#24577;&#20998;&#35299;&#24314;&#27169;&#29992;&#20110;&#33829;&#38144;&#26102;&#38388;&#24207;&#21015;
&lt;/p&gt;
&lt;p&gt;
Multifractal wavelet dynamic mode decomposition modeling for marketing time series
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.13361
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26088;&#22312;&#36890;&#36807;&#22810;&#37325;&#20998;&#24418;&#23567;&#27874;&#21160;&#24577;&#27169;&#24577;&#20998;&#35299;&#24314;&#27169;&#25506;&#35752;&#22522;&#20110;&#26102;&#38388;&#24207;&#21015;&#30340;&#33829;&#38144;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33829;&#38144;&#26159;&#30830;&#20445;&#25105;&#20204;&#30340;&#38144;&#21806;&#19994;&#32489;&#26368;&#20339;&#12289;&#25105;&#20204;&#30340;&#20215;&#26684;&#26368;&#20855;&#21560;&#24341;&#21147;&#12289;&#23458;&#25143;&#28385;&#24847;&#30340;&#26041;&#24335;&#65292;&#20174;&#32780;&#30830;&#20445;&#25105;&#20204;&#30340;&#21697;&#29260;&#20855;&#26377;&#26368;&#24191;&#27867;&#30340;&#20998;&#38144;&#32593;&#32476;&#12290;&#36825;&#38656;&#35201;&#23545;&#25972;&#20010;&#30456;&#20851;&#32593;&#32476;&#26377;&#22797;&#26434;&#21644;&#20808;&#36827;&#30340;&#29702;&#35299;&#12290;&#23454;&#38469;&#19978;&#65292;&#33829;&#38144;&#25968;&#25454;&#21487;&#33021;&#20197;&#23450;&#24615;&#21644;&#23450;&#37327;&#25968;&#25454;&#30340;&#19981;&#21516;&#24418;&#24335;&#23384;&#22312;&#12290;&#28982;&#32780;&#65292;&#22312;&#25991;&#29486;&#20013;&#24456;&#23481;&#26131;&#21457;&#29616;&#20851;&#20110;&#23450;&#24615;&#30740;&#31350;&#21487;&#20197;&#25910;&#38598;&#21040;&#22823;&#37327;&#30340;&#25991;&#29486;&#65292;&#32780;&#37319;&#29992;&#23450;&#37327;&#35266;&#28857;&#30340;&#30740;&#31350;&#21364;&#23525;&#23525;&#26080;&#20960;&#12290;&#36825;&#26159;&#19968;&#20010;&#37325;&#22823;&#32570;&#28857;&#65292;&#23548;&#33268;&#33829;&#38144;&#31185;&#23398;&#20173;&#28982;&#20391;&#37325;&#20110;&#35774;&#35745;&#65292;&#23613;&#31649;&#24066;&#22330;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#20381;&#36182;&#20110;&#36135;&#24065;&#21644;&#26102;&#38388;&#31561;&#25968;&#37327;&#12290;&#23454;&#38469;&#19978;&#65292;&#33829;&#38144;&#25968;&#25454;&#21487;&#20197;&#24418;&#25104;&#26102;&#38388;&#24207;&#21015;&#65292;&#22914;&#25351;&#23450;&#26102;&#26399;&#20869;&#30340;&#21697;&#29260;&#38144;&#21806;&#12289;&#25351;&#23450;&#26102;&#26399;&#20869;&#19982;&#21697;&#29260;&#30456;&#20851;&#30340;&#20215;&#26684;&#12289;&#24066;&#22330;&#20221;&#39069;&#31561;&#12290;&#26412;&#24037;&#20316;&#30340;&#30446;&#30340;&#26159;&#30740;&#31350;&#22522;&#20110;&#26102;&#38388;&#24207;&#21015;&#30340;&#19968;&#20123;&#33829;&#38144;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.13361v1 Announce Type: cross  Abstract: Marketing is the way we ensure our sales are the best in the market, our prices the most accessible, and our clients satisfied, thus ensuring our brand has the widest distribution. This requires sophisticated and advanced understanding of the whole related network. Indeed, marketing data may exist in different forms such as qualitative and quantitative data. However, in the literature, it is easily noted that large bibliographies may be collected about qualitative studies, while only a few studies adopt a quantitative point of view. This is a major drawback that results in marketing science still focusing on design, although the market is strongly dependent on quantities such as money and time. Indeed, marketing data may form time series such as brand sales in specified periods, brand-related prices over specified periods, market shares, etc. The purpose of the present work is to investigate some marketing models based on time series f
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#36890;&#36807;&#23545;&#21152;&#32435;&#35777;&#21048;&#20132;&#26131;&#25152;&#30340;&#32929;&#20215;&#21160;&#24577;&#36827;&#34892;&#24314;&#27169;&#65292;&#21457;&#29616;&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;&#27169;&#22411;&#33021;&#22815;&#20934;&#30830;&#39044;&#27979;&#32929;&#20215;&#65292;&#24182;&#23637;&#31034;&#23454;&#38469;&#32929;&#20215;&#19982;&#27169;&#22411;&#39044;&#27979;&#30340;&#19968;&#33268;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.13192</link><description>&lt;p&gt;
&#23545;&#21152;&#32435;&#35777;&#21048;&#20132;&#26131;&#25152;&#32929;&#20215;&#21160;&#24577;&#30340;&#24314;&#27169;&#65306;&#19968;&#31181;&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Modeling stock price dynamics on the Ghana Stock Exchange: A Geometric Brownian Motion approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.13192
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#36890;&#36807;&#23545;&#21152;&#32435;&#35777;&#21048;&#20132;&#26131;&#25152;&#30340;&#32929;&#20215;&#21160;&#24577;&#36827;&#34892;&#24314;&#27169;&#65292;&#21457;&#29616;&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;&#27169;&#22411;&#33021;&#22815;&#20934;&#30830;&#39044;&#27979;&#32929;&#20215;&#65292;&#24182;&#23637;&#31034;&#23454;&#38469;&#32929;&#20215;&#19982;&#27169;&#22411;&#39044;&#27979;&#30340;&#19968;&#33268;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24314;&#27169;&#37329;&#34701;&#25968;&#25454;&#36890;&#24120;&#20381;&#36182;&#20110;&#21487;&#33021;&#22312;&#23454;&#36341;&#20013;&#35777;&#26126;&#19981;&#36275;&#25110;&#19981;&#20999;&#23454;&#38469;&#30340;&#20551;&#35774;&#12290;&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;&#65288;GBM&#65289;&#27169;&#22411;&#32463;&#24120;&#29992;&#20110;&#20195;&#34920;&#32929;&#20215;&#36807;&#31243;&#12290;&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#21152;&#32435;&#35777;&#21048;&#20132;&#26131;&#25152;&#19978;&#24066;&#30340;&#37096;&#20998;&#32929;&#31080;&#30340;&#27599;&#21608;&#21644;&#27599;&#26376;&#25910;&#30410;&#26159;&#21542;&#31526;&#21512;GBM&#27169;&#22411;&#30340;&#34892;&#20026;&#12290;&#20026;&#20116;&#21482;&#32929;&#31080;&#20272;&#35745;&#20102;GBM&#27169;&#22411;&#30340;&#21442;&#25968;&#65292;&#24182;&#29983;&#25104;&#20102;&#20026;&#26399;&#19977;&#20010;&#26376;&#30340;&#39044;&#27979;&#12290;&#20351;&#29992;&#22343;&#26041;&#35823;&#24046;&#65288;MSE&#65289;&#36827;&#34892;&#20102;&#20272;&#35745;&#31934;&#24230;&#30340;&#35780;&#20272;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#27169;&#25311;&#32929;&#31080;&#30340;&#39044;&#26399;&#20215;&#26684;&#19982;&#20132;&#26131;&#25152;&#35266;&#23519;&#21040;&#30340;&#23454;&#38469;&#32929;&#20215;&#38750;&#24120;&#19968;&#33268;&#12290;&#27492;&#22806;&#65292;&#34429;&#28982;&#35266;&#23519;&#21040;&#20102;&#19968;&#20123;&#20559;&#24046;&#65292;&#20294;&#23454;&#38469;&#20215;&#26684;&#22987;&#32456;&#33853;&#22312;&#20272;&#35745;&#30340;&#32622;&#20449;&#21306;&#38388;&#20869;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.13192v1 Announce Type: cross  Abstract: Modeling financial data often relies on assumptions that may prove insufficient or unrealistic in practice. The Geometric Brownian Motion (GBM) model is frequently employed to represent stock price processes. This study investigates whether the behavior of weekly and monthly returns of selected equities listed on the Ghana Stock Exchange conforms to the GBM model. Parameters of the GBM model were estimated for five equities, and forecasts were generated for three months. Evaluation of estimation accuracy was conducted using mean square error (MSE). Results indicate that the expected prices from the modeled equities closely align with actual stock prices observed on the Exchange. Furthermore, while some deviations were observed, the actual prices consistently fell within the estimated confidence intervals.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20102;&#22312;&#28385;&#36275;&#21333;&#35843;&#24615;&#21644;&#19979;&#21322;&#36830;&#32493;&#24615;&#30340;&#26465;&#20214;&#19979;&#65292;&#30456;&#23545;&#20110;&#31532;&#19968;&#39034;&#24207;&#38543;&#26426;&#20248;&#21183;&#26465;&#20214;&#30340;&#26368;&#22823;&#31283;&#23450;&#24615;&#65292;&#25552;&#20986;&#20102;&#28385;&#36275;&#26368;&#22823;&#31283;&#23450;&#24615;&#24615;&#36136;&#30340;&#27867;&#20989;&#21487;&#20197;&#34920;&#31034;&#20026;&#19968;&#20010;&#21452;&#21464;&#37327;&#20989;&#25968;&#30340;&#26497;&#20540;&#28857;&#30340;&#34920;&#31034;&#23450;&#29702;</title><link>https://arxiv.org/abs/2403.13138</link><description>&lt;p&gt;
&#31532;&#19968;&#39034;&#24207;&#38543;&#26426;&#20248;&#21183;&#26465;&#20214;&#19979;&#30340;&#26368;&#22823;&#31283;&#23450;&#24615;
&lt;/p&gt;
&lt;p&gt;
Max-stability under first-order stochastic dominance
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.13138
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#22312;&#28385;&#36275;&#21333;&#35843;&#24615;&#21644;&#19979;&#21322;&#36830;&#32493;&#24615;&#30340;&#26465;&#20214;&#19979;&#65292;&#30456;&#23545;&#20110;&#31532;&#19968;&#39034;&#24207;&#38543;&#26426;&#20248;&#21183;&#26465;&#20214;&#30340;&#26368;&#22823;&#31283;&#23450;&#24615;&#65292;&#25552;&#20986;&#20102;&#28385;&#36275;&#26368;&#22823;&#31283;&#23450;&#24615;&#24615;&#36136;&#30340;&#27867;&#20989;&#21487;&#20197;&#34920;&#31034;&#20026;&#19968;&#20010;&#21452;&#21464;&#37327;&#20989;&#25968;&#30340;&#26497;&#20540;&#28857;&#30340;&#34920;&#31034;&#23450;&#29702;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#22823;&#31283;&#23450;&#24615;&#26159;&#25351;&#23545;&#20004;&#20010;&#36755;&#20837;&#21462;&#26368;&#22823;&#20540;&#20250;&#23548;&#33268;&#20004;&#20010;&#36755;&#20986;&#20013;&#30340;&#26368;&#22823;&#20540;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#30456;&#23545;&#20110;&#31532;&#19968;&#39034;&#24207;&#38543;&#26426;&#20248;&#21183;&#26465;&#20214;&#30340;&#26368;&#22823;&#31283;&#23450;&#24615;&#65292;&#36825;&#26159;&#20915;&#31574;&#29702;&#35770;&#20013;&#26368;&#22522;&#26412;&#30340;&#38543;&#26426;&#20248;&#21183;&#27010;&#24565;&#12290;&#22312;&#21152;&#20837;&#20102;&#21333;&#35843;&#24615;&#21644;&#19979;&#21322;&#36830;&#32493;&#24615;&#30340;&#20004;&#20010;&#26631;&#20934;&#20844;&#29702;&#21518;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#20010;&#20851;&#20110;&#28385;&#36275;&#26368;&#22823;&#31283;&#23450;&#24615;&#24615;&#36136;&#30340;&#27867;&#20989;&#30340;&#34920;&#31034;&#23450;&#29702;&#65292;&#32467;&#26524;&#34920;&#26126;&#36825;&#20123;&#27867;&#20989;&#21487;&#20197;&#34920;&#31034;&#20026;&#19968;&#20010;&#21452;&#21464;&#37327;&#20989;&#25968;&#30340;&#26497;&#20540;&#28857;&#12290;&#25105;&#20204;&#34920;&#24449;&#30340;&#27867;&#20989;&#21253;&#25324;&#20102;&#39118;&#38505;&#24230;&#37327;&#25991;&#29486;&#20013;&#30340;&#29305;&#27530;&#31867;&#21035;&#65292;&#22914;&#22522;&#20934;&#25439;&#22833;Value at Risk (VaR) &#21644; $\Lambda$-&#20998;&#20301;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.13138v1 Announce Type: new  Abstract: Max-stability is the property that taking a maximum between two inputs results in a maximum between two outputs. We investigate max-stability with respect to first-order stochastic dominance, the most fundamental notion of stochastic dominance in decision theory. Under two additional standard axioms of monotonicity and lower semicontinuity, we establish a representation theorem for functionals satisfying max-stability, which turns out to be represented by the supremum of a bivariate function. Our characterized functionals encompass special classes of functionals in the literature of risk measures, such as benchmark-loss Value at Risk (VaR) and $\Lambda$-quantile.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#21608;&#26399;&#24615;&#22686;&#38271;&#36807;&#31243;&#20013;&#65292;&#36164;&#26412;&#21270;&#30340;&#26399;&#26395;&#20540;&#21462;&#20915;&#20110;&#36335;&#24452;&#65292;&#20174;&#32780;&#23548;&#33268;&#36164;&#26412;&#30340;&#22238;&#25253;&#29575;&#21644;&#26102;&#38388;&#24179;&#22343;&#22238;&#25253;&#29575;&#21462;&#20915;&#20110;&#36335;&#24452;&#65292;&#19988;&#20869;&#37096;&#25910;&#30410;&#29575;&#19982;&#36164;&#26412;&#22238;&#25253;&#29575;&#30340;&#26399;&#26395;&#20540;&#19981;&#21516;&#12290;</title><link>https://arxiv.org/abs/2403.08678</link><description>&lt;p&gt;
&#36164;&#26412;&#22238;&#25253;&#22312;&#21608;&#26399;&#24615;&#22686;&#38271;&#36807;&#31243;&#20013;&#30340;&#36335;&#24452;&#20381;&#36182;&#24615;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Path-dependency of capital return in periodic growth processes
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.08678
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#21608;&#26399;&#24615;&#22686;&#38271;&#36807;&#31243;&#20013;&#65292;&#36164;&#26412;&#21270;&#30340;&#26399;&#26395;&#20540;&#21462;&#20915;&#20110;&#36335;&#24452;&#65292;&#20174;&#32780;&#23548;&#33268;&#36164;&#26412;&#30340;&#22238;&#25253;&#29575;&#21644;&#26102;&#38388;&#24179;&#22343;&#22238;&#25253;&#29575;&#21462;&#20915;&#20110;&#36335;&#24452;&#65292;&#19988;&#20869;&#37096;&#25910;&#30410;&#29575;&#19982;&#36164;&#26412;&#22238;&#25253;&#29575;&#30340;&#26399;&#26395;&#20540;&#19981;&#21516;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#21608;&#26399;&#24615;&#22686;&#38271;&#36807;&#31243;&#12290;&#26681;&#25454;&#24212;&#35745;&#22522;&#30784;&#65292;&#21033;&#28070;&#29575;&#30340;&#26399;&#26395;&#20540;&#26082;&#19981;&#30452;&#25509;&#21462;&#20915;&#20110;&#20943;&#20540;&#65292;&#20063;&#19981;&#21462;&#20915;&#20110;&#36164;&#26412;&#21270;&#36335;&#24452;&#12290;&#36164;&#26412;&#21270;&#30340;&#26399;&#26395;&#20540;&#26159;&#36335;&#24452;&#20381;&#36182;&#30340;&#12290;&#30001;&#20110;&#20381;&#36182;&#36335;&#24452;&#30340;&#36164;&#26412;&#21270;&#65292;&#36164;&#26412;&#30340;&#22238;&#25253;&#29575;&#20063;&#26159;&#36335;&#24452;&#20381;&#36182;&#30340;&#65292;&#32780;&#36164;&#26412;&#30340;&#26102;&#38388;&#24179;&#22343;&#22238;&#25253;&#29575;&#19982;&#22686;&#38271;&#21608;&#26399;&#30340;&#26399;&#26395;&#20540;&#22238;&#25253;&#29575;&#19981;&#21516;&#12290;&#22312;&#27809;&#26377;&#20013;&#38388;&#20943;&#20540;&#30340;&#24773;&#20917;&#19979;&#65292;&#20869;&#37096;&#25910;&#30410;&#29575;&#26159;&#36335;&#24452;&#26080;&#20851;&#30340;&#65292;&#22240;&#27492;&#19982;&#36164;&#26412;&#22238;&#25253;&#29575;&#30340;&#26399;&#26395;&#20540;&#19981;&#21516;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#20351;&#26435;&#30410;&#22238;&#25253;&#29575;&#26368;&#22823;&#21270;&#30340;&#26059;&#36716;&#21608;&#26399;&#38271;&#24230;&#19982;&#24066;&#22330;&#21033;&#29575;&#26080;&#20851;&#12290;&#26464;&#26438;&#25928;&#24212;&#36890;&#36807;&#19968;&#20010;&#21333;&#29420;&#30340;&#26464;&#26438;&#26041;&#31243;&#36827;&#20837;&#22686;&#38271;&#36807;&#31243;&#30340;&#24494;&#35266;&#32463;&#27982;&#23398;&#20013;&#65292;&#26464;&#26438;&#31995;&#25968;&#21487;&#33021;&#36798;&#21040;&#27491;&#20540;&#25110;&#36127;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.08678v1 Announce Type: new  Abstract: Periodic growth processes are investigated. The expected value of the profit rate, on accrual basis, does not directly depend on divestments, neither on the capitalization path. The expected value of capitalization is path dependent. Because of the path-dependent capitalization, the return rate on capital is path-dependent, and the time-average return rate on capital differs from the expected-value return rate on capital for the growth cycle. In the absence of intermediate divestments, the internal rate of return is path-independent, thereby differing from the expected value of the rate of return on capital. It is shown that the rotation cycle length maximizing the return rate on equity is independent of market interest rate. Leveraging effect enters the microeconomics of the growth processes through a separate leveraging equation, where the leverage coefficient may reach positive or negative values. Correspondingly, from the viewpoint o
&lt;/p&gt;</description></item><item><title>&#25581;&#31034;&#20102;&#20581;&#36523;&#22797;&#26434;&#24230;&#31639;&#27861;&#19982;Sinkhorn-Knopp&#31639;&#27861;&#20043;&#38388;&#30340;&#31561;&#25928;&#24615;&#65292;&#20197;&#21450;&#36890;&#36807;&#22266;&#23450;&#28857;&#35299;&#30340;&#24402;&#19968;&#21270;&#25581;&#31034;&#20102;&#20581;&#36523;&#21644;&#22797;&#26434;&#24230;&#25351;&#26631;&#30340;&#33021;&#37327;&#20989;&#25968;&#35299;&#37322;&#12290;</title><link>https://arxiv.org/abs/2212.12356</link><description>&lt;p&gt;
&#12298;&#20581;&#36523;&#22797;&#26434;&#24230;&#31639;&#27861;&#19982;Sinkhorn-Knopp&#31639;&#27861;&#20043;&#38388;&#30340;&#31561;&#25928;&#24615;&#12299;
&lt;/p&gt;
&lt;p&gt;
Equivalence between the Fitness-Complexity and the Sinkhorn-Knopp algorithms
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2212.12356
&lt;/p&gt;
&lt;p&gt;
&#25581;&#31034;&#20102;&#20581;&#36523;&#22797;&#26434;&#24230;&#31639;&#27861;&#19982;Sinkhorn-Knopp&#31639;&#27861;&#20043;&#38388;&#30340;&#31561;&#25928;&#24615;&#65292;&#20197;&#21450;&#36890;&#36807;&#22266;&#23450;&#28857;&#35299;&#30340;&#24402;&#19968;&#21270;&#25581;&#31034;&#20102;&#20581;&#36523;&#21644;&#22797;&#26434;&#24230;&#25351;&#26631;&#30340;&#33021;&#37327;&#20989;&#25968;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25581;&#31034;&#20102;&#32463;&#27982;&#22797;&#26434;&#24615;&#39046;&#22495;&#20013;&#21457;&#23637;&#30340;&#20581;&#36523;&#22797;&#26434;&#24230;&#31639;&#27861;&#19982;&#22312;&#28085;&#30422;&#20174;&#35745;&#31639;&#26426;&#31185;&#23398;&#21644;&#25968;&#23398;&#21040;&#32463;&#27982;&#23398;&#31561;&#19981;&#21516;&#39046;&#22495;&#20013;&#24191;&#27867;&#20351;&#29992;&#30340;Sinkhorn-Knopp&#31639;&#27861;&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;&#23613;&#31649;&#36825;&#20004;&#31181;&#26041;&#27861;&#20043;&#38388;&#23384;&#22312;&#36731;&#24494;&#30340;&#24418;&#24335;&#24046;&#24322;&#65292;&#20294;&#20004;&#32773;&#37117;&#25910;&#25947;&#21040;&#30456;&#21516;&#30340;&#22266;&#23450;&#28857;&#35299;&#65292;&#30452;&#21040;&#24402;&#19968;&#21270;&#12290;&#21457;&#29616;&#30340;&#36830;&#25509;&#20351;&#25105;&#20204;&#33021;&#22815;&#25512;&#23548;&#20986;&#20581;&#36523;&#21644;&#22797;&#26434;&#24230;&#25351;&#26631;&#20316;&#20026;&#36866;&#24403;&#33021;&#37327;&#20989;&#25968;&#30340;&#21183;&#33021;&#30340;&#20005;&#26684;&#35299;&#37322;&#12290;&#22312;&#36825;&#31181;&#35299;&#37322;&#19979;&#65292;&#39640;&#33021;&#37327;&#20135;&#21697;&#23545;&#20110;&#20581;&#36523;&#36739;&#20302;&#30340;&#22269;&#23478;&#26159;&#19981;&#21487;&#34892;&#30340;&#65292;&#36825;&#35299;&#37322;&#20102;&#20026;&#20160;&#20040;&#35813;&#31639;&#27861;&#22312;&#23637;&#31034;&#20108;&#37096;&#32593;&#32476;&#20013;&#23884;&#22871;&#27169;&#24335;&#26041;&#38754;&#26377;&#25928;&#12290;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#25552;&#20986;&#30340;&#35299;&#37322;&#25581;&#31034;&#20102;&#20581;&#36523;&#22797;&#26434;&#24230;&#31639;&#27861;&#30340;&#23610;&#24230;&#19981;&#21464;&#24615;&#65292;&#36825;&#23545;&#20110;&#35813;&#31639;&#27861;&#22312;&#19981;&#21516;&#25968;&#25454;&#38598;&#20013;&#30340;&#23454;&#29616;&#20855;&#26377;&#23454;&#38469;&#24847;&#20041;&#12290;&#27492;&#22806;&#65292;&#23545;&#32463;&#39564;&#25968;&#25454;&#30340;&#36827;&#19968;&#27493;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
arXiv:2212.12356v2 Announce Type: replace  Abstract: We uncover the connection between the Fitness-Complexity algorithm, developed in the economic complexity field, and the Sinkhorn-Knopp algorithm, widely used in diverse domains ranging from computer science and mathematics to economics. Despite minor formal differences between the two methods, both converge to the same fixed-point solution up to normalization. The discovered connection allows us to derive a rigorous interpretation of the Fitness and the Complexity metrics as the potentials of a suitable energy function. Under this interpretation, high-energy products are unfeasible for low-fitness countries, which explains why the algorithm is effective at displaying nested patterns in bipartite networks. We also show that the proposed interpretation reveals the scale invariance of the Fitness-Complexity algorithm, which has practical implications for the algorithm's implementation in different datasets. Further, analysis of empirica
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23558;&#24066;&#22330;&#20449;&#24687;&#32534;&#30721;&#20026;&#22270;&#20687;&#24182;&#21033;&#29992;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#36827;&#34892;&#30701;&#26399;&#23454;&#29616;&#27874;&#21160;&#29575;&#39044;&#27979;&#30340;&#26041;&#27861;&#65292;&#19982;&#20854;&#20182;&#22522;&#20934;&#27169;&#22411;&#30456;&#27604;&#20855;&#26377;&#26356;&#22909;&#30340;&#34920;&#29616;&#21644;&#28508;&#21147;&#12290;</title><link>http://arxiv.org/abs/2304.02472</link><description>&lt;p&gt;
&#20351;&#29992;&#22522;&#20110;&#35746;&#21333;&#27969;&#35757;&#32451;&#30340;&#28145;&#24230;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#36827;&#34892;&#30701;&#26399;&#27874;&#21160;&#29575;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Short-Term Volatility Prediction Using Deep CNNs Trained on Order Flow. (arXiv:2304.02472v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.02472
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23558;&#24066;&#22330;&#20449;&#24687;&#32534;&#30721;&#20026;&#22270;&#20687;&#24182;&#21033;&#29992;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#36827;&#34892;&#30701;&#26399;&#23454;&#29616;&#27874;&#21160;&#29575;&#39044;&#27979;&#30340;&#26041;&#27861;&#65292;&#19982;&#20854;&#20182;&#22522;&#20934;&#27169;&#22411;&#30456;&#27604;&#20855;&#26377;&#26356;&#22909;&#30340;&#34920;&#29616;&#21644;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20316;&#20026;&#26032;&#20852;&#30340;&#36164;&#20135;&#31867;&#21035;&#65292;&#21152;&#23494;&#36135;&#24065;&#30456;&#27604;&#20256;&#32479;&#30340;&#32929;&#31080;&#24066;&#22330;&#26126;&#26174;&#26356;&#20855;&#27874;&#21160;&#24615;&#12290;&#30001;&#20110;&#20854;&#22823;&#22810;&#25968;&#26102;&#20505;&#26159;&#26080;&#30417;&#31649;&#30340;&#65292;&#27969;&#21160;&#24615;&#36890;&#24120;&#36739;&#20302;&#65292;&#21152;&#23494;&#36164;&#20135;&#30340;&#20215;&#26684;&#22312;&#20960;&#20998;&#38047;&#20869;&#23601;&#21487;&#20986;&#29616;&#26174;&#33879;&#21464;&#21160;&#65292;&#36825;&#21487;&#33021;&#20250;&#23548;&#33268;&#24040;&#39069;&#25439;&#22833;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#37319;&#29992;&#23558;&#24066;&#22330;&#20449;&#24687;&#32534;&#30721;&#25104;&#22270;&#20687;&#24182;&#21033;&#29992;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#36827;&#34892;&#30701;&#26399;&#23454;&#29616;&#27874;&#21160;&#29575;&#39044;&#27979;&#30340;&#26041;&#27861;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#23558;&#25152;&#25552;&#20986;&#30340;&#32534;&#30721;&#21644;&#30456;&#24212;&#30340;&#27169;&#22411;&#30340;&#34920;&#29616;&#19982;&#20854;&#20182;&#22522;&#20934;&#27169;&#22411;&#36827;&#34892;&#27604;&#36739;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#20351;&#29992;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#20316;&#20026;&#39044;&#27979;&#27169;&#22411;&#30340;&#24066;&#22330;&#25968;&#25454;&#34920;&#31034;&#26041;&#27861;&#26377;&#28508;&#21147;&#26356;&#22909;&#22320;&#25429;&#25417;&#24066;&#22330;&#21160;&#24577;&#24182;&#23454;&#29616;&#26356;&#22909;&#30340;&#27874;&#21160;&#29575;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
As a newly emerged asset class, cryptocurrency is evidently more volatile compared to the traditional equity markets. Due to its mostly unregulated nature, and often low liquidity, the price of crypto assets can sustain a significant change within minutes that in turn might result in considerable losses. In this paper, we employ an approach for encoding market information into images and making predictions of short-term realized volatility by employing Convolutional Neural Networks. We then compare the performance of the proposed encoding and corresponding model with other benchmark models. The experimental results demonstrate that this representation of market data with a Convolutional Neural Network as a predictive model has the potential to better capture the market dynamics and a better volatility prediction.
&lt;/p&gt;</description></item></channel></rss>