<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#35770;&#25991;&#38024;&#23545;&#38797;&#28857;&#23545;&#25968;&#27010;&#29575;&#20998;&#37197;&#19981;&#31561;&#24335;&#36827;&#34892;&#20102;&#36827;&#19968;&#27493;&#20998;&#26512;&#65292;&#21457;&#29616;&#22312;&#32500;&#24230;$d\ge2$&#19988;&#31215;&#20998;&#21442;&#25968;$\rho$&#23646;&#20110;$[1,2)$&#26102;&#19981;&#25104;&#31435;&#65292;&#32780;&#22312;&#32500;&#24230;$d\ge2$&#26102;&#19988;$\rho\ge2$&#26102;&#23384;&#22312;&#26356;&#24378;&#30340;&#26368;&#22823;&#38797;&#28857;&#23545;&#25968;&#27010;&#29575;&#20998;&#37197;&#19981;&#31561;&#24335;&#12290;</title><link>http://arxiv.org/abs/2310.08492</link><description>&lt;p&gt;
&#26368;&#22823;&#38797;&#28857;&#23545;&#25968;&#27010;&#29575;&#20998;&#37197;&#19981;&#31561;&#24335;
&lt;/p&gt;
&lt;p&gt;
Maximal Martingale Wasserstein Inequality. (arXiv:2310.08492v1 [math.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.08492
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#38024;&#23545;&#38797;&#28857;&#23545;&#25968;&#27010;&#29575;&#20998;&#37197;&#19981;&#31561;&#24335;&#36827;&#34892;&#20102;&#36827;&#19968;&#27493;&#20998;&#26512;&#65292;&#21457;&#29616;&#22312;&#32500;&#24230;$d\ge2$&#19988;&#31215;&#20998;&#21442;&#25968;$\rho$&#23646;&#20110;$[1,2)$&#26102;&#19981;&#25104;&#31435;&#65292;&#32780;&#22312;&#32500;&#24230;$d\ge2$&#26102;&#19988;$\rho\ge2$&#26102;&#23384;&#22312;&#26356;&#24378;&#30340;&#26368;&#22823;&#38797;&#28857;&#23545;&#25968;&#27010;&#29575;&#20998;&#37197;&#19981;&#31561;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#23436;&#25104;&#20102;&#23545;&#20110;&#22312;arXiv:2011.11599&#20013;&#24320;&#22987;&#30340;&#38797;&#28857;&#23545;&#25968;&#27010;&#29575;&#20998;&#37197;&#19981;&#31561;&#24335;&#30340;&#20998;&#26512;&#65292;&#39564;&#35777;&#20102;&#24403;&#31215;&#20998;&#21442;&#25968;$\rho$&#23646;&#20110;$[1,2)$&#19988;&#32500;&#24230;$d\ge2$&#26102;&#65292;&#35813;&#19981;&#31561;&#24335;&#22312;&#32500;&#24230;$d\ge2$&#19979;&#26159;&#19981;&#25104;&#31435;&#30340;&#65292;&#32780;&#24403;$\rho\ge2$&#26102;&#65292;&#23384;&#22312;&#19968;&#20010;&#26356;&#24378;&#30340;&#26368;&#22823;&#38797;&#28857;&#23545;&#25968;&#27010;&#29575;&#20998;&#37197;&#19981;&#31561;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this note, we complete the analysis of the Martingale Wasserstein Inequality started in arXiv:2011.11599 by checking that this inequality fails in dimension $d\ge 2$ when the integrability parameter $\rho$ belongs to $[1,2)$ while a stronger Maximal Martingale Wasserstein Inequality holds whatever the dimension $d$ when $\rho\ge 2$.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#20449;&#24565;&#24418;&#25104;&#27169;&#22411;&#65292;&#20854;&#20013;&#20195;&#29702;&#20154;&#35797;&#22270;&#21306;&#20998;&#20004;&#20010;&#29702;&#35770;&#65292;&#38480;&#21046;&#20449;&#24687;&#22788;&#29702;&#23548;&#33268;&#20102;&#23545;&#24369;&#35777;&#25454;&#30340;&#23457;&#26597;&#65292;&#32467;&#26524;&#23548;&#33268;&#20102;&#20559;&#35265;&#20449;&#24565;&#30340;&#24418;&#25104;&#12290;</title><link>http://arxiv.org/abs/2310.08466</link><description>&lt;p&gt;
&#20449;&#24565;&#24418;&#25104;&#19982;&#20559;&#35265;&#20449;&#24565;&#30340;&#25345;&#20037;&#24615;
&lt;/p&gt;
&lt;p&gt;
Belief formation and the persistence of biased beliefs. (arXiv:2310.08466v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.08466
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#20449;&#24565;&#24418;&#25104;&#27169;&#22411;&#65292;&#20854;&#20013;&#20195;&#29702;&#20154;&#35797;&#22270;&#21306;&#20998;&#20004;&#20010;&#29702;&#35770;&#65292;&#38480;&#21046;&#20449;&#24687;&#22788;&#29702;&#23548;&#33268;&#20102;&#23545;&#24369;&#35777;&#25454;&#30340;&#23457;&#26597;&#65292;&#32467;&#26524;&#23548;&#33268;&#20102;&#20559;&#35265;&#20449;&#24565;&#30340;&#24418;&#25104;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20449;&#24565;&#24418;&#25104;&#27169;&#22411;&#65292;&#20854;&#20013;&#20195;&#29702;&#20154;&#35797;&#22270;&#21306;&#20998;&#20004;&#20010;&#29702;&#35770;&#65292;&#24182;&#19988;&#25903;&#25345;&#29702;&#35770;&#20135;&#29983;&#24378;&#22823;&#65288;&#21487;&#33021;&#31232;&#26377;&#65289;&#30340;&#35777;&#25454;&#21644;&#39057;&#32321;&#30340;&#35777;&#20266;&#35777;&#25454;&#12290;&#22312;&#25105;&#20204;&#30340;&#27169;&#22411;&#20013;&#65292;&#20449;&#24687;&#22788;&#29702;&#30340;&#38480;&#21046;&#23548;&#33268;&#23545;&#24369;&#35777;&#25454;&#30340;&#23457;&#26597;&#65292;&#32467;&#26524;&#23548;&#33268;&#23545;&#26576;&#20123;&#21306;&#20998;&#38382;&#39064;&#26469;&#35828;&#65292;&#35777;&#25454;&#21487;&#33021;&#20250;&#21464;&#24471;&#22823;&#22810;&#21576;&#21333;&#26041;&#21521;&#65292;&#32780;&#19982;&#30495;&#23454;&#30340;&#28508;&#22312;&#29702;&#35770;&#26080;&#20851;&#12290;&#20102;&#35299;&#34987;&#23457;&#26597;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#29305;&#24449;&#30340;&#22797;&#26434;&#20195;&#29702;&#20154;&#19981;&#20250;&#34987;&#36825;&#31181;&#8220;&#35777;&#25454;&#8221;&#31215;&#32047;&#25152;&#36855;&#24785;&#65292;&#20294;&#26159;&#19981;&#22826;&#22797;&#26434;&#30340;&#20195;&#29702;&#20154;&#26368;&#32456;&#20250;&#24418;&#25104;&#20559;&#35265;&#20449;&#24565;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a belief-formation model where agents attempt to discriminate between two theories, and where the asymmetry in strength between confirming and disconfirming evidence tilts beliefs in favor of theories that generate strong (and possibly rare) confirming evidence and weak (and frequent) disconfirming evidence. In our model, limitations on information processing provide incentives to censor weak evidence, with the consequence that for some discrimination problems, evidence may become mostly one-sided, independently of the true underlying theory. Sophisticated agents who know the characteristics of the censored data-generating process are not lured by this accumulation of ``evidence'', but less sophisticated ones end up with biased beliefs.
&lt;/p&gt;</description></item><item><title>&#25919;&#27835;&#31283;&#23450;&#24615;&#30340;&#22686;&#21152;&#19982;&#36739;&#20302;&#30340;&#36890;&#32960;&#29575;&#30456;&#20851;&#65292;&#32780;&#25919;&#27835;&#31283;&#23450;&#24615;&#30340;&#20943;&#23569;&#19982;&#36739;&#39640;&#30340;&#36890;&#32960;&#29575;&#30456;&#20851;&#12290;</title><link>http://arxiv.org/abs/2310.08415</link><description>&lt;p&gt;
&#25919;&#27835;&#31283;&#23450;&#24615;&#19982;&#36890;&#32960;&#20043;&#38388;&#30340;&#32852;&#31995;&#65306;&#26469;&#33258;&#22235;&#20010;&#21335;&#20122;&#22269;&#23478;&#30340;&#35265;&#35299;
&lt;/p&gt;
&lt;p&gt;
The Connection Between Political Stability and Inflation: Insights from Four South Asian Nations. (arXiv:2310.08415v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.08415
&lt;/p&gt;
&lt;p&gt;
&#25919;&#27835;&#31283;&#23450;&#24615;&#30340;&#22686;&#21152;&#19982;&#36739;&#20302;&#30340;&#36890;&#32960;&#29575;&#30456;&#20851;&#65292;&#32780;&#25919;&#27835;&#31283;&#23450;&#24615;&#30340;&#20943;&#23569;&#19982;&#36739;&#39640;&#30340;&#36890;&#32960;&#29575;&#30456;&#20851;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#25919;&#27835;&#31283;&#23450;&#24615;&#19982;&#22235;&#20010;&#21335;&#20122;&#22269;&#23478;&#30340;&#36890;&#32960;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#37319;&#29992;&#20102;&#20174;2001&#24180;&#21040;2021&#24180;&#30340;&#38754;&#26495;&#25968;&#25454;&#12290;&#20026;&#20102;&#20998;&#26512;&#36825;&#31181;&#20851;&#31995;&#65292;&#30740;&#31350;&#37319;&#29992;&#20102;&#21160;&#24577;&#26222;&#36890;&#26368;&#23567;&#20108;&#20056;&#27861;&#65288;DOLS&#65289;&#21644;&#23436;&#20840;&#20462;&#27491;&#30340;&#26368;&#23567;&#20108;&#20056;&#27861;&#65288;FMOLS&#65289;&#65292;&#36825;&#20123;&#26041;&#27861;&#22312;&#38754;&#26495;&#25968;&#25454;&#20998;&#26512;&#20013;&#32771;&#34385;&#20102;&#27178;&#21521;&#30456;&#20851;&#24615;&#21644;&#26012;&#29575;&#22343;&#21248;&#24615;&#12290;&#30740;&#31350;&#32467;&#26524;&#19968;&#33268;&#34920;&#26126;&#65292;&#25919;&#27835;&#31283;&#23450;&#24615;&#30340;&#22686;&#21152;&#19982;&#36739;&#20302;&#30340;&#36890;&#32960;&#29575;&#30456;&#20851;&#65292;&#32780;&#25919;&#27835;&#31283;&#23450;&#24615;&#30340;&#20943;&#23569;&#19982;&#36739;&#39640;&#30340;&#36890;&#32960;&#29575;&#30456;&#20851;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study explores the relationship between political stability and inflation in four South Asian countries, employing panel data spanning from 2001 to 2021. To analyze this relationship, the study utilizes the dynamic ordinary least square (DOLS) and fully modified ordinary least square (FMOLS) methods, which account for cross-sectional dependence and slope homogeneity in panel data analysis. The findings consistently reveal that increased political stability is associated with lower inflation, while reduced political stability is linked to higher inflation.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#29615;&#22659;&#21019;&#26032;&#20225;&#19994;&#30340;&#29305;&#24449;&#65292;&#24182;&#37327;&#21270;&#20102;&#19981;&#21516;&#31867;&#22411;&#29615;&#22659;&#21019;&#26032;&#31574;&#30053;&#23545;&#38144;&#21806;&#39069;&#12289;&#23601;&#19994;&#21644;&#29983;&#20135;&#21147;&#21160;&#24577;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2310.08353</link><description>&lt;p&gt;
&#19981;&#21516;&#31243;&#24230;&#30340;&#32511;&#33394;&#65306;&#24322;&#36136;&#29615;&#22659;&#21019;&#26032;&#21450;&#20854;&#23545;&#20844;&#21496;&#32489;&#25928;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
There are different shades of green: heterogeneous environmental innovations and their effects on firm performance. (arXiv:2310.08353v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.08353
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#29615;&#22659;&#21019;&#26032;&#20225;&#19994;&#30340;&#29305;&#24449;&#65292;&#24182;&#37327;&#21270;&#20102;&#19981;&#21516;&#31867;&#22411;&#29615;&#22659;&#21019;&#26032;&#31574;&#30053;&#23545;&#38144;&#21806;&#39069;&#12289;&#23601;&#19994;&#21644;&#29983;&#20135;&#21147;&#21160;&#24577;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#35199;&#29677;&#29273;&#25216;&#26415;&#21019;&#26032;&#35843;&#26597;&#38754;&#26495;&#65288;2003-2016&#24180;&#65289;&#30340;&#20225;&#19994;&#32423;&#25968;&#25454;&#38598;&#65292;&#25506;&#35752;&#29615;&#22659;&#21019;&#26032;&#20225;&#19994;&#30340;&#29305;&#24449;&#65292;&#24182;&#37327;&#21270;&#20102;&#19981;&#21516;&#31867;&#22411;&#29615;&#22659;&#21019;&#26032;&#31574;&#30053;&#65288;&#33410;&#32422;&#36164;&#28304;&#12289;&#20943;&#23569;&#27745;&#26579;&#21644;&#21463;&#30417;&#31649;&#39537;&#21160;&#30340;&#21019;&#26032;&#65289;&#23545;&#38144;&#21806;&#39069;&#12289;&#23601;&#19994;&#21644;&#29983;&#20135;&#21147;&#21160;&#24577;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Using a firm-level dataset from the Spanish Technological Innovation Panel (2003-2016), this study explores the characteristics of environmentally innovative firms and quantifies the effects of pursuing different types of environmental innovation strategies (resource-saving, pollution-reducing, and regulation-driven innovations) on sales, employment, and productivity dynamics.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;MaaS&#24179;&#21488;&#20316;&#20026;&#20013;&#20171;&#32773;&#22312;&#22810;&#27169;&#24335;&#20132;&#36890;&#32593;&#32476;&#20013;&#30340;&#20998;&#37197;&#21644;&#23450;&#20215;&#38382;&#39064;&#65292;&#24182;&#35774;&#35745;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;MaaS&#34892;&#31243;&#30340;&#36215;&#28857;-&#32456;&#28857;&#23450;&#20215;&#26041;&#26696;&#65292;&#20197;&#23454;&#29616;&#36335;&#24452;&#36873;&#25321;&#30340;&#28789;&#27963;&#24615;&#21644;&#27169;&#24335;&#20043;&#38388;&#30340;&#36793;&#30028;&#28040;&#38500;&#12290;</title><link>http://arxiv.org/abs/2310.08285</link><description>&lt;p&gt;
&#22914;&#20309;&#22312;&#22810;&#23545;&#22810;&#21305;&#37197;&#20013;&#20445;&#25345;&#31283;&#23450;&#24615;&#30340;&#24773;&#20917;&#19979;&#65292;&#31227;&#21160;&#21363;&#26381;&#21153;&#65288;MaaS&#65289;&#24179;&#21488;&#20316;&#20026;&#20013;&#20171;&#32773;&#22914;&#20309;&#29983;&#23384;&#65311;&#65288;&#26469;&#33258;&#32463;&#27982;&#23398;&#35282;&#24230;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
How would mobility-as-a-service (MaaS) platform survive as an intermediary? From the viewpoint of stability in many-to-many matching. (arXiv:2310.08285v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.08285
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;MaaS&#24179;&#21488;&#20316;&#20026;&#20013;&#20171;&#32773;&#22312;&#22810;&#27169;&#24335;&#20132;&#36890;&#32593;&#32476;&#20013;&#30340;&#20998;&#37197;&#21644;&#23450;&#20215;&#38382;&#39064;&#65292;&#24182;&#35774;&#35745;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;MaaS&#34892;&#31243;&#30340;&#36215;&#28857;-&#32456;&#28857;&#23450;&#20215;&#26041;&#26696;&#65292;&#20197;&#23454;&#29616;&#36335;&#24452;&#36873;&#25321;&#30340;&#28789;&#27963;&#24615;&#21644;&#27169;&#24335;&#20043;&#38388;&#30340;&#36793;&#30028;&#28040;&#38500;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31227;&#21160;&#21363;&#26381;&#21153;&#65288;MaaS&#65289;&#36890;&#36807;&#25972;&#21512;&#19981;&#21516;&#30340;&#20132;&#36890;&#26041;&#24335;&#65292;&#25552;&#20379;&#26080;&#32541;&#30340;&#38376;&#23545;&#38376;&#20986;&#34892;&#12290;&#34429;&#28982;&#36817;&#24180;&#26469;&#20986;&#29616;&#20102;&#35768;&#22810;MaaS&#24179;&#21488;&#65292;&#20294;&#22823;&#22810;&#25968;&#20173;&#22788;&#20110;&#26377;&#38480;&#30340;&#25972;&#21512;&#27700;&#24179;&#12290;&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;MaaS&#24179;&#21488;&#20316;&#20026;&#20013;&#20171;&#32773;&#22312;&#22810;&#27169;&#24335;&#20132;&#36890;&#32593;&#32476;&#20013;&#30340;&#20998;&#37197;&#21644;&#23450;&#20215;&#38382;&#39064;&#65292;&#35813;&#24179;&#21488;&#20174;&#26381;&#21153;&#36816;&#33829;&#21830;&#36141;&#20080;&#33021;&#21147;&#65292;&#24182;&#21521;&#26053;&#34892;&#32773;&#38144;&#21806;&#22810;&#27169;&#24335;&#34892;&#31243;&#12290;&#25105;&#20204;&#37319;&#29992;&#20102;&#22810;&#23545;&#22810;&#31283;&#23450;&#21305;&#37197;&#30340;&#20998;&#26512;&#26694;&#26550;&#26469;&#20998;&#35299;&#32852;&#21512;&#35774;&#35745;&#38382;&#39064;&#65292;&#24182;&#24471;&#20986;&#31283;&#23450;&#26465;&#20214;&#65292;&#20351;&#36816;&#33829;&#21830;&#21644;&#26053;&#34892;&#32773;&#24895;&#24847;&#21442;&#19982;MaaS&#31995;&#32479;&#12290;&#20026;&#20102;&#26368;&#22823;&#38480;&#24230;&#22320;&#25552;&#39640;&#36335;&#24452;&#36873;&#25321;&#30340;&#28789;&#27963;&#24615;&#24182;&#28040;&#38500;&#27169;&#24335;&#20043;&#38388;&#30340;&#36793;&#30028;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;MaaS&#34892;&#31243;&#30340;&#36215;&#28857;-&#32456;&#28857;&#23450;&#20215;&#26041;&#26696;&#12290;&#22312;&#20379;&#24212;&#31471;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#26381;&#21153;&#33021;&#21147;&#30340;&#25209;&#21457;&#36141;&#20080;&#20215;&#26684;&#12290;&#22240;&#27492;&#65292;&#20998;&#37197;&#38382;&#39064;&#34987;&#37325;&#26032;&#23450;&#20041;&#21644;&#35299;&#20915;&#20026;&#19968;&#20010;&#21452;&#23618;&#35268;&#21010;&#38382;&#39064;&#65292;&#20854;&#20013;MaaS tra
&lt;/p&gt;
&lt;p&gt;
Mobility-as-a-service (MaaS) provides seamless door-to-door trips by integrating different transport modes. Although many MaaS platforms have emerged in recent years, most of them remain at a limited integration level. This study investigates the assignment and pricing problem for a MaaS platform as an intermediary in a multi-modal transportation network, which purchases capacity from service operators and sells multi-modal trips to travelers. The analysis framework of many-to-many stable matching is adopted to decompose the joint design problem and to derive the stability condition such that both operators and travelers are willing to participate in the MaaS system. To maximize the flexibility in route choice and remove boundaries between modes, we design an origin-destination pricing scheme for MaaS trips. On the supply side, we propose a wholesale purchase price for service capacity. Accordingly, the assignment problem is reformulated and solved as a bi-level program, where MaaS tra
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20559;&#22909;&#20851;&#31995;&#22270;&#30340;&#25237;&#36164;&#32452;&#21512;&#26500;&#24314;&#26041;&#27861;&#65292;&#21487;&#20197;&#21327;&#35843;&#22810;&#20010;&#35777;&#21048;&#37197;&#23545;&#20043;&#38388;&#30340;&#30683;&#30462;&#20132;&#26131;&#20449;&#21495;&#65292;&#24182;&#22312;&#22823;&#37327;&#35777;&#21048;&#20043;&#38388;&#20849;&#21516;&#21033;&#29992;&#22871;&#21033;&#26426;&#20250;&#12290;</title><link>http://arxiv.org/abs/2310.08284</link><description>&lt;p&gt;
&#22522;&#20110;&#20559;&#22909;&#20851;&#31995;&#30340;&#32479;&#35745;&#22871;&#21033;&#25237;&#36164;&#32452;&#21512;&#26500;&#24314;
&lt;/p&gt;
&lt;p&gt;
Statistical arbitrage portfolio construction based on preference relations. (arXiv:2310.08284v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.08284
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20559;&#22909;&#20851;&#31995;&#22270;&#30340;&#25237;&#36164;&#32452;&#21512;&#26500;&#24314;&#26041;&#27861;&#65292;&#21487;&#20197;&#21327;&#35843;&#22810;&#20010;&#35777;&#21048;&#37197;&#23545;&#20043;&#38388;&#30340;&#30683;&#30462;&#20132;&#26131;&#20449;&#21495;&#65292;&#24182;&#22312;&#22823;&#37327;&#35777;&#21048;&#20043;&#38388;&#20849;&#21516;&#21033;&#29992;&#22871;&#21033;&#26426;&#20250;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32479;&#35745;&#22871;&#21033;&#26041;&#27861;&#36890;&#36807;&#35782;&#21035;&#35777;&#21048;&#30340;&#38169;&#20215;&#26469;&#26500;&#24314;&#19982;&#24066;&#22330;&#24369;&#30456;&#20851;&#30340;&#25237;&#36164;&#32452;&#21512;&#12290;&#22312;&#37197;&#23545;&#20132;&#26131;&#20013;&#65292;&#36890;&#36807;&#35266;&#23519;&#20004;&#20010;&#35777;&#21048;&#20043;&#38388;&#30340;&#30456;&#23545;&#20215;&#26684;&#21464;&#21160;&#26469;&#35782;&#21035;&#22871;&#21033;&#26426;&#20250;&#12290;&#36890;&#36807;&#21516;&#26102;&#35266;&#23519;&#22810;&#20010;&#37197;&#23545;&#65292;&#21487;&#20197;&#21033;&#29992;&#19981;&#21516;&#30340;&#22871;&#21033;&#26426;&#20250;&#24182;&#25552;&#39640;&#36825;&#31181;&#26041;&#27861;&#30340;&#24615;&#33021;&#12290;&#28982;&#32780;&#65292;&#20351;&#29992;&#22823;&#37327;&#37197;&#23545;&#26159;&#22256;&#38590;&#30340;&#65292;&#22240;&#20026;&#19981;&#21516;&#37197;&#23545;&#20043;&#38388;&#23384;&#22312;&#30683;&#30462;&#30340;&#20132;&#26131;&#20449;&#21495;&#30340;&#27010;&#29575;&#22686;&#21152;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20559;&#22909;&#20851;&#31995;&#22270;&#30340;&#26032;&#22411;&#25237;&#36164;&#32452;&#21512;&#26500;&#24314;&#26041;&#27861;&#65292;&#21487;&#20197;&#21327;&#35843;&#22810;&#20010;&#35777;&#21048;&#37197;&#23545;&#20043;&#38388;&#30340;&#30683;&#30462;&#20132;&#26131;&#20449;&#21495;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#21487;&#20197;&#22312;&#22823;&#37327;&#35777;&#21048;&#20043;&#38388;&#20849;&#21516;&#21033;&#29992;&#22871;&#21033;&#26426;&#20250;&#12290;&#20351;&#29992;&#26469;&#33258;S&amp;P 500&#25351;&#25968;&#30340;&#32422;500&#21482;&#32929;&#31080;&#36817;30&#24180;&#30340;&#21382;&#21490;&#22238;&#25253;&#30340;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#22522;&#20110;&#35813;&#26041;&#27861;&#26500;&#24314;&#30340;&#25237;&#36164;&#32452;&#21512;&#21487;&#20197;&#36798;&#21040;&#24456;&#22909;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
Statistical arbitrage methods identify mispricings in securities with the goal of building portfolios which are weakly correlated with the market. In pairs trading, an arbitrage opportunity is identified by observing relative price movements between a pair of two securities. By simultaneously observing multiple pairs, one can exploit different arbitrage opportunities and increase the performance of such methods. However, the use of a large number of pairs is difficult due to the increased probability of contradictory trade signals among different pairs. In this paper, we propose a novel portfolio construction method based on preference relation graphs, which can reconcile contradictory pairs trading signals across multiple security pairs. The proposed approach enables joint exploitation of arbitrage opportunities among a large number of securities. Experimental results using three decades of historical returns of roughly 500 stocks from the S\&amp;P 500 index show that the portfolios based
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36816;&#29992;&#32593;&#32476;&#30740;&#31350;&#26041;&#27861;&#30740;&#31350;&#36152;&#26131;&#21046;&#35009;&#65292;&#21457;&#29616;&#21046;&#35009;&#22269;&#23478;&#30340;&#21830;&#19994;&#27169;&#24335;&#21457;&#29983;&#20102;&#36716;&#21464;&#65292;&#21521;&#20013;&#31435;&#25110;&#21451;&#22909;&#22269;&#23478;&#20542;&#26012;&#12290;&#36825;&#20123;&#21464;&#21270;&#21487;&#33021;&#23548;&#33268;&#19968;&#20010;&#19982;&#19990;&#30028;&#32463;&#27982;&#36793;&#32536;&#30456;&#20114;&#20316;&#29992;&#30340;&#26367;&#20195;&#8220;&#26680;&#24515;&#8221;&#30340;&#24418;&#25104;&#12290;</title><link>http://arxiv.org/abs/2310.08193</link><description>&lt;p&gt;
&#21046;&#35009;&#23545;&#22833;&#36133;&#32773;&#26469;&#35828;&#24847;&#21619;&#30528;&#20160;&#20040;&#65311;&#19968;&#20010;&#20851;&#20110;&#36152;&#26131;&#21046;&#35009;&#30340;&#32593;&#32476;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Are sanctions for losers? A network study of trade sanctions. (arXiv:2310.08193v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.08193
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36816;&#29992;&#32593;&#32476;&#30740;&#31350;&#26041;&#27861;&#30740;&#31350;&#36152;&#26131;&#21046;&#35009;&#65292;&#21457;&#29616;&#21046;&#35009;&#22269;&#23478;&#30340;&#21830;&#19994;&#27169;&#24335;&#21457;&#29983;&#20102;&#36716;&#21464;&#65292;&#21521;&#20013;&#31435;&#25110;&#21451;&#22909;&#22269;&#23478;&#20542;&#26012;&#12290;&#36825;&#20123;&#21464;&#21270;&#21487;&#33021;&#23548;&#33268;&#19968;&#20010;&#19982;&#19990;&#30028;&#32463;&#27982;&#36793;&#32536;&#30456;&#20114;&#20316;&#29992;&#30340;&#26367;&#20195;&#8220;&#26680;&#24515;&#8221;&#30340;&#24418;&#25104;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24314;&#31435;&#22312;&#20381;&#36182;&#24615;&#21644;&#19990;&#30028;&#31995;&#32479;&#29702;&#35770;&#22522;&#30784;&#19978;&#30340;&#32593;&#32476;&#30740;&#31350;&#34920;&#26126;&#65292;&#22269;&#38469;&#36152;&#26131;&#34987;&#20998;&#20026;&#25191;&#34892;&#19981;&#21516;&#21151;&#33021;&#30340;&#8220;&#26680;&#24515;&#8221;&#21644;&#8220;&#36793;&#32536;&#8221;&#22269;&#23478;&#30340;&#32858;&#31867;&#12290;&#28982;&#32780;&#65292;&#24456;&#23569;&#26377;&#20154;&#20351;&#29992;&#36825;&#20123;&#26041;&#27861;&#26469;&#30740;&#31350;&#21046;&#35009;&#23545;&#28041;&#21450;&#36164;&#26412;&#20027;&#20041;&#19990;&#30028;&#32463;&#27982;&#30340;&#22269;&#23478;&#22320;&#20301;&#30340;&#24433;&#21709;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#32463;&#27982;&#25112;&#20105;&#33258;20&#19990;&#32426;50&#24180;&#20195;&#20197;&#26469;&#34987;&#35270;&#20026;&#37325;&#35201;&#30340;&#22320;&#32536;&#25919;&#27835;&#27494;&#22120;&#32780;&#26174;&#24471;&#23588;&#20026;&#32039;&#36843;&#12290;&#23588;&#20854;&#26159;&#22312;&#32654;&#22269;&#21450;&#20854;&#30431;&#21451;&#23545;&#20420;&#20044;&#25112;&#20105;&#30340;&#22238;&#24212;&#20013;&#65292;&#21046;&#35009;&#36215;&#21040;&#20102;&#21331;&#36234;&#30340;&#20316;&#29992;&#12290;&#24212;&#29992;&#20110;&#22797;&#26434;&#21644;&#26242;&#26102;&#32593;&#32476;&#30340;&#20960;&#31181;&#32858;&#31867;&#25216;&#26415;&#65292;&#26412;&#25991;&#23637;&#31034;&#20102;&#20174;&#21046;&#35009;&#22269;&#23478;&#36716;&#21521;&#20013;&#31435;&#25110;&#21451;&#22909;&#22269;&#23478;&#30340;&#21830;&#19994;&#27169;&#24335;&#30340;&#21464;&#21270;&#12290;&#27492;&#22806;&#65292;&#26377;&#36857;&#35937;&#34920;&#26126;&#65292;&#36825;&#20123;&#21464;&#21270;&#21487;&#33021;&#23548;&#33268;&#19968;&#20010;&#19982;&#19990;&#30028;&#32463;&#27982;&#36793;&#32536;&#30456;&#20114;&#20316;&#29992;&#30340;&#26367;&#20195;&#8220;&#26680;&#24515;&#8221;&#30340;&#24418;&#25104;&#12290;
&lt;/p&gt;
&lt;p&gt;
Studies built on dependency and world-system theory using network approaches have shown that international trade is structured into clusters of 'core' and 'peripheral' countries performing distinct functions. However, few have used these methods to investigate how sanctions affect the position of the countries involved in the capitalist world-economy. Yet, this topic has acquired pressing relevance due to the emergence of economic warfare as a key geopolitical weapon since the 1950s. And even more so in light of the preeminent role that sanctions have played in the US and their allies' response to the Russian-Ukrainian war. Applying several clustering techniques designed for complex and temporal networks, this paper shows that a shift in the pattern of commerce away from sanctioning countries and towards neutral or friendly ones. Additionally, there are suggestions that these shifts may lead to the creation of an alternative 'core' that interacts with the world-economy's periphery bypa
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#30719;&#24037;&#21487;&#25552;&#21462;&#20215;&#20540;&#30340;MEV&#25104;&#26412;&#30340;&#29702;&#35770;&#23450;&#20041;&#65292;&#22312;&#22810;&#20010;&#31034;&#20363;&#20013;&#35777;&#26126;&#20102;&#35813;&#23450;&#20041;&#30340;&#23454;&#29992;&#24615;&#65292;&#24182;&#19982;&#23545;&#31216;&#32676;&#30340;&#20989;&#25968;&#8220;&#24179;&#28369;&#24615;&#8221;&#30456;&#20851;&#32852;&#12290;</title><link>http://arxiv.org/abs/2310.07865</link><description>&lt;p&gt;
&#30719;&#24037;&#21487;&#25552;&#21462;&#20215;&#20540;&#30340;&#23041;&#32961;&#65288;&#21644;&#35889;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Specter (and Spectra) of Miner Extractable Value. (arXiv:2310.07865v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.07865
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#30719;&#24037;&#21487;&#25552;&#21462;&#20215;&#20540;&#30340;MEV&#25104;&#26412;&#30340;&#29702;&#35770;&#23450;&#20041;&#65292;&#22312;&#22810;&#20010;&#31034;&#20363;&#20013;&#35777;&#26126;&#20102;&#35813;&#23450;&#20041;&#30340;&#23454;&#29992;&#24615;&#65292;&#24182;&#19982;&#23545;&#31216;&#32676;&#30340;&#20989;&#25968;&#8220;&#24179;&#28369;&#24615;&#8221;&#30456;&#20851;&#32852;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30719;&#24037;&#21487;&#25552;&#21462;&#20215;&#20540;&#65288;MEV&#65289;&#26159;&#25351;&#20132;&#26131;&#39564;&#35777;&#22120;&#36890;&#36807;&#25805;&#32437;&#20132;&#26131;&#39034;&#24207;&#21487;&#20197;&#23454;&#29616;&#30340;&#20219;&#20309;&#36229;&#39069;&#20215;&#20540;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;MEV&#25104;&#26412;&#30340;&#29702;&#35770;&#23450;&#20041;&#65292;&#35777;&#26126;&#20102;&#19968;&#20123;&#22522;&#26412;&#24615;&#36136;&#65292;&#24182;&#36890;&#36807;&#22810;&#20010;&#31034;&#20363;&#23637;&#31034;&#20102;&#35813;&#23450;&#20041;&#30340;&#23454;&#29992;&#24615;&#12290;&#22312;&#22810;&#31181;&#24773;&#20917;&#19979;&#65292;&#35813;&#23450;&#20041;&#19982;&#20989;&#25968;&#22312;&#23545;&#31216;&#32676;&#19978;&#30340;&#8220;&#24179;&#28369;&#24615;&#8221;&#30456;&#20851;&#12290;&#36890;&#36807;&#36825;&#20010;&#23450;&#20041;&#21644;&#19968;&#20123;&#22522;&#26412;&#35266;&#23519;&#65292;&#25105;&#20204;&#22238;&#28335;&#20102;&#25991;&#29486;&#20013;&#30340;&#19968;&#20123;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
Miner extractable value (MEV) refers to any excess value that a transaction validator can realize by manipulating the ordering of transactions. In this work, we introduce a simple theoretical definition of the 'cost of MEV', prove some basic properties, and show that the definition is useful via a number of examples. In a variety of settings, this definition is related to the 'smoothness' of a function over the symmetric group. From this definition and some basic observations, we recover a number of results from the literature.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#28151;&#21512;&#30740;&#31350;&#26041;&#27861;&#21644;&#20027;&#35201;&#25968;&#25454;&#20998;&#26512;&#20102;&#23612;&#26085;&#21033;&#20122;&#38738;&#24180;&#23601;&#19994;&#35745;&#21010;&#30340;&#23454;&#26045;&#25361;&#25112;&#21644;&#25919;&#27835;&#21253;&#23481;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#23613;&#31649;&#24050;&#32463;&#25512;&#20986;&#20102;&#22810;&#20010;&#38738;&#24180;&#23601;&#19994;&#35745;&#21010;&#65292;&#20294;&#23612;&#26085;&#21033;&#20122;&#30340;&#38738;&#24180;&#22833;&#19994;&#29575;&#24182;&#27809;&#26377;&#26174;&#33879;&#19979;&#38477;&#12290;</title><link>http://arxiv.org/abs/2310.07789</link><description>&lt;p&gt;
&#23612;&#26085;&#21033;&#20122;&#38738;&#24180;&#23601;&#19994;&#25919;&#31574;&#30340;&#23454;&#35777;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
Empirical Review of Youth-Employment Policies in Nigeria. (arXiv:2310.07789v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.07789
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#28151;&#21512;&#30740;&#31350;&#26041;&#27861;&#21644;&#20027;&#35201;&#25968;&#25454;&#20998;&#26512;&#20102;&#23612;&#26085;&#21033;&#20122;&#38738;&#24180;&#23601;&#19994;&#35745;&#21010;&#30340;&#23454;&#26045;&#25361;&#25112;&#21644;&#25919;&#27835;&#21253;&#23481;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#23613;&#31649;&#24050;&#32463;&#25512;&#20986;&#20102;&#22810;&#20010;&#38738;&#24180;&#23601;&#19994;&#35745;&#21010;&#65292;&#20294;&#23612;&#26085;&#21033;&#20122;&#30340;&#38738;&#24180;&#22833;&#19994;&#29575;&#24182;&#27809;&#26377;&#26174;&#33879;&#19979;&#38477;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38738;&#24180;&#22833;&#19994;&#26159;&#23612;&#26085;&#21033;&#20122;&#30340;&#19968;&#20010;&#37325;&#22823;&#31038;&#20250;&#32463;&#27982;&#38382;&#39064;&#65292;&#20026;&#24212;&#23545;&#36825;&#19968;&#25361;&#25112;&#65292;&#24050;&#32463;&#25512;&#20986;&#24182;&#23454;&#26045;&#20102;&#20960;&#39033;&#38738;&#24180;&#23601;&#19994;&#35745;&#21010;&#12290;&#34429;&#28982;&#24050;&#32463;&#23545;&#20854;&#20013;&#19968;&#20123;&#35745;&#21010;&#30340;&#24433;&#21709;&#36827;&#34892;&#20102;&#35814;&#32454;&#20998;&#26512;&#65292;&#20294;&#23545;&#23454;&#26045;&#25361;&#25112;&#21644;&#26377;&#38480;&#25919;&#27835;&#21253;&#23481;&#23545;&#35745;&#21010;&#25928;&#30410;&#20998;&#37197;&#30340;&#24433;&#21709;&#30340;&#32463;&#39564;&#20998;&#26512;&#24456;&#23569;&#12290;&#26412;&#25991;&#21033;&#29992;&#28151;&#21512;&#30740;&#31350;&#26041;&#27861;&#21644;&#36890;&#36807;&#28966;&#28857;&#23567;&#32452;&#35752;&#35770;&#21644;&#20851;&#38190;&#20449;&#24687;&#20154;&#35775;&#35848;&#25910;&#38598;&#30340;&#21021;&#32423;&#25968;&#25454;&#36827;&#34892;&#20998;&#26512;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#23613;&#31649;&#23612;&#26085;&#21033;&#20122;&#26377;&#20960;&#39033;&#38738;&#24180;&#23601;&#19994;&#35745;&#21010;&#65292;&#20294;&#38738;&#24180;&#22833;&#19994;&#29575;&#24182;&#27809;&#26377;&#26174;&#33879;&#19979;&#38477;&#12290;&#36825;&#20123;&#35745;&#21010;&#38754;&#20020;&#30528;&#19968;&#20123;&#25361;&#25112;&#65292;&#22914;&#32570;&#20047;&#36866;&#24403;&#27835;&#29702;&#21644;&#21327;&#35843;&#30340;&#26694;&#26550;&#65292;&#36164;&#37329;&#19981;&#36275;&#65292;&#32570;&#20047;&#26426;&#26500;&#23454;&#26045;&#33021;&#21147;&#65292;&#23454;&#26045;&#30417;&#30563;&#19981;&#36275;&#65292;&#25919;&#27835;&#21253;&#23481;&#26377;&#38480;&#65292;&#32570;&#20047;&#23545;&#33030;&#24369;&#21644;&#36793;&#32536;&#21270;&#32676;&#20307;&#30340;&#20248;&#20808;&#32771;&#34385;&#12290;
&lt;/p&gt;
&lt;p&gt;
Youth unemployment is a major socioeconomic problem in Nigeria, and several youth-employment programs have been initiated and implemented to address the challenge. While detailed analyses of the impacts of some of these programs have been conducted, empirical analysis of implementation challenges and of the influence of limited political inclusivity on distribution of program benefits is rare. Using mixed research methods and primary data collected through focus-group discussion and key-informant interviews, this paper turns to that analysis. We found that, although there are several youth-employment programs in Nigeria, they have not yielded a marked reduction in youth-unemployment rates. The programs are challenged by factors such as lack of framework for proper governance and coordination, inadequate funding, lack of institutional implementation capacity, inadequate oversight of implementation, limited political inclusivity, lack of prioritization of vulnerable and marginalized grou
&lt;/p&gt;</description></item><item><title>&#22312;&#20044;&#25289;&#22317;1974-2010&#24180;&#30340;&#21382;&#21490;&#26102;&#26399;&#65292;&#30740;&#31350;&#21457;&#29616;&#24037;&#19994;&#20844;&#21496;&#23545;&#31246;&#25910;&#20248;&#24800;&#25935;&#24863;&#65292;&#36825;&#23545;&#20110;&#20182;&#20204;&#30340;&#25237;&#36164;&#20915;&#31574;&#36215;&#21040;&#20102;&#20915;&#23450;&#24615;&#30340;&#24433;&#21709;&#12290;&#27492;&#22806;&#65292;&#22686;&#21152;&#25237;&#36164;&#30340;&#28608;&#21169;&#25514;&#26045;&#23545;&#32463;&#27982;&#27963;&#21160;&#21644;&#20986;&#21475;&#26377;&#31215;&#26497;&#24433;&#21709;&#65292;&#20294;&#23545;&#22833;&#19994;&#29575;&#26377;&#36127;&#38754;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2310.07738</link><description>&lt;p&gt;
&#21382;&#21490;&#35270;&#35282;&#19979;&#23545;&#31169;&#20154;&#24037;&#19994;&#25237;&#36164;&#30340;&#28608;&#21169;&#25514;&#26045;&#65306;&#20044;&#25289;&#22317;&#24037;&#19994;&#25512;&#21160;&#21644;&#25237;&#36164;&#20419;&#36827;&#30340;&#26696;&#20363;&#30740;&#31350;&#65288;1974-2010&#65289;
&lt;/p&gt;
&lt;p&gt;
Incentives for Private Industrial Investment in historical perspective: the case of industrial promotion and investment promotion in Uruguay (1974-2010). (arXiv:2310.07738v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.07738
&lt;/p&gt;
&lt;p&gt;
&#22312;&#20044;&#25289;&#22317;1974-2010&#24180;&#30340;&#21382;&#21490;&#26102;&#26399;&#65292;&#30740;&#31350;&#21457;&#29616;&#24037;&#19994;&#20844;&#21496;&#23545;&#31246;&#25910;&#20248;&#24800;&#25935;&#24863;&#65292;&#36825;&#23545;&#20110;&#20182;&#20204;&#30340;&#25237;&#36164;&#20915;&#31574;&#36215;&#21040;&#20102;&#20915;&#23450;&#24615;&#30340;&#24433;&#21709;&#12290;&#27492;&#22806;&#65292;&#22686;&#21152;&#25237;&#36164;&#30340;&#28608;&#21169;&#25514;&#26045;&#23545;&#32463;&#27982;&#27963;&#21160;&#21644;&#20986;&#21475;&#26377;&#31215;&#26497;&#24433;&#21709;&#65292;&#20294;&#23545;&#22833;&#19994;&#29575;&#26377;&#36127;&#38754;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21033;&#29992;&#19968;&#20221;&#26032;&#30340;&#25968;&#25454;&#24211;&#65292;&#35813;&#25968;&#25454;&#24211;&#26159;&#22522;&#20110;&#21382;&#21490;&#34892;&#25919;&#35760;&#24405;&#30340;&#32534;&#21046;&#32780;&#26469;&#65292;&#28085;&#30422;&#20102;1974-2010&#24180;&#30340;&#26102;&#26399;&#65292;&#25105;&#20204;&#21487;&#20197;&#24471;&#21040;&#20851;&#20110;&#20044;&#25289;&#22317;&#24037;&#19994;&#20844;&#21496;&#22914;&#20309;&#21033;&#29992;&#31246;&#25910;&#20248;&#24800;&#30340;&#26032;&#35777;&#25454;&#65292;&#24182;&#22768;&#31216;&#36825;&#20123;&#20248;&#24800;&#23545;&#20044;&#25289;&#22317;&#24037;&#19994;&#20844;&#21496;&#30340;&#25237;&#36164;&#20915;&#31574;&#26377;&#20915;&#23450;&#24615;&#30340;&#24433;&#21709;&#12290;&#19978;&#36848;&#21457;&#29616;&#36824;&#35777;&#23454;&#20102;&#22686;&#21152;&#25237;&#36164;&#30340;&#28608;&#21169;&#25514;&#26045;&#23545;&#32463;&#27982;&#27963;&#21160;&#27700;&#24179;&#21644;&#20986;&#21475;&#27700;&#24179;&#20855;&#26377;&#31215;&#26497;&#24433;&#21709;&#65292;&#23545;&#22833;&#19994;&#29575;&#20855;&#26377;&#36127;&#38754;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Using as a central instrument a new database, resulting from a compilation of historical administrative records, which covers the period 1974-2010, we can have new evidence on how industrial companies used tax benefits, and claim that these are decisive for the investment decision of the Uruguayan industrial companies during that period. The aforementioned findings served as a raw material to also affirm that the incentives to increase investment are factors that positively influence the level of economic activity and exports, and negatively on the unemployment rate.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Quantum Gramian Angular Field (QGAF)&#30340;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#37327;&#23376;&#35745;&#31639;&#25216;&#26415;&#19982;&#28145;&#24230;&#23398;&#20064;&#30456;&#32467;&#21512;&#65292;&#25104;&#21151;&#23558;&#32929;&#31080;&#22238;&#25253;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#36716;&#21270;&#20026;&#36866;&#21512;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65288;CNN&#65289;&#35757;&#32451;&#30340;&#20108;&#32500;&#22270;&#20687;&#65292;&#20174;&#32780;&#25552;&#39640;&#20102;&#39044;&#27979;&#30340;&#31934;&#24230;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#30456;&#27604;&#20256;&#32479;&#26041;&#27861;&#65292;QGAF&#26041;&#27861;&#20855;&#26377;&#26174;&#33879;&#30340;&#24615;&#33021;&#20248;&#21183;&#12290;</title><link>http://arxiv.org/abs/2310.07427</link><description>&lt;p&gt;
&#22686;&#24378;&#37327;&#23376;&#39044;&#27979;&#33021;&#21147;&#65306;&#21033;&#29992;&#37327;&#23376;Gramian&#35282;&#24230;&#22330;&#21644;CNN&#36827;&#34892;&#32929;&#31080;&#22238;&#25253;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Quantum-Enhanced Forecasting: Leveraging Quantum Gramian Angular Field and CNNs for Stock Return Predictions. (arXiv:2310.07427v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.07427
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Quantum Gramian Angular Field (QGAF)&#30340;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#37327;&#23376;&#35745;&#31639;&#25216;&#26415;&#19982;&#28145;&#24230;&#23398;&#20064;&#30456;&#32467;&#21512;&#65292;&#25104;&#21151;&#23558;&#32929;&#31080;&#22238;&#25253;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#36716;&#21270;&#20026;&#36866;&#21512;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65288;CNN&#65289;&#35757;&#32451;&#30340;&#20108;&#32500;&#22270;&#20687;&#65292;&#20174;&#32780;&#25552;&#39640;&#20102;&#39044;&#27979;&#30340;&#31934;&#24230;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#30456;&#27604;&#20256;&#32479;&#26041;&#27861;&#65292;QGAF&#26041;&#27861;&#20855;&#26377;&#26174;&#33879;&#30340;&#24615;&#33021;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Quantum Gramian Angular Field (QGAF)&#30340;&#26102;&#38388;&#24207;&#21015;&#39044;&#27979;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#23558;&#37327;&#23376;&#35745;&#31639;&#25216;&#26415;&#19982;&#28145;&#24230;&#23398;&#20064;&#30456;&#32467;&#21512;&#65292;&#26088;&#22312;&#25552;&#39640;&#26102;&#38388;&#24207;&#21015;&#20998;&#31867;&#21644;&#39044;&#27979;&#30340;&#31934;&#24230;&#12290;&#36890;&#36807;&#35774;&#35745;&#29305;&#23450;&#30340;&#37327;&#23376;&#30005;&#36335;&#65292;&#25105;&#20204;&#25104;&#21151;&#22320;&#23558;&#32929;&#31080;&#22238;&#25253;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#36716;&#21270;&#20026;&#36866;&#21512;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65288;CNN&#65289;&#35757;&#32451;&#30340;&#20108;&#32500;&#22270;&#20687;&#12290;&#19982;&#32463;&#20856;&#30340;Gramian Angular Field (GAF)&#26041;&#27861;&#19981;&#21516;&#65292;QGAF&#30340;&#29420;&#29305;&#20043;&#22788;&#22312;&#20110;&#28040;&#38500;&#20102;&#25968;&#25454;&#24402;&#19968;&#21270;&#21644;&#21453;&#20313;&#24358;&#35745;&#31639;&#30340;&#38656;&#27714;&#65292;&#31616;&#21270;&#20102;&#20174;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#21040;&#20108;&#32500;&#22270;&#20687;&#30340;&#36716;&#25442;&#36807;&#31243;&#12290;&#20026;&#20102;&#39564;&#35777;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#65292;&#25105;&#20204;&#22312;&#20013;&#22269;A&#32929;&#24066;&#22330;&#12289;&#39321;&#28207;&#32929;&#24066;&#21644;&#32654;&#22269;&#32929;&#24066;&#30340;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#23454;&#39564;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#19982;&#32463;&#20856;&#30340;GAF&#26041;&#27861;&#30456;&#27604;&#65292;QGAF&#26041;&#27861;&#26174;&#33879;&#25913;&#21892;&#20102;&#39044;&#27979;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a time series forecasting method named Quantum Gramian Angular Field (QGAF). This approach merges the advantages of quantum computing technology with deep learning, aiming to enhance the precision of time series classification and forecasting. We successfully transformed stock return time series data into two-dimensional images suitable for Convolutional Neural Network (CNN) training by designing specific quantum circuits. Distinct from the classical Gramian Angular Field (GAF) approach, QGAF's uniqueness lies in eliminating the need for data normalization and inverse cosine calculations, simplifying the transformation process from time series data to two-dimensional images. To validate the effectiveness of this method, we conducted experiments on datasets from three major stock markets: the China A-share market, the Hong Kong stock market, and the US stock market. Experimental results revealed that compared to the classical GAF method, the QGAF approach significantly improv
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#21152;&#26435;&#20215;&#26684;&#25351;&#25968;S-FCPIw&#65292;&#21033;&#29992;&#20013;&#22269;&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#26500;&#24314;&#65292;&#33021;&#26356;&#39057;&#32321;&#21644;&#26356;&#20016;&#23500;&#22320;&#21453;&#26144;&#21830;&#21697;&#20215;&#26684;&#30340;&#21464;&#21160;&#65292;&#19982;CPI&#21644;&#39135;&#21697;CPI&#23384;&#22312;&#26174;&#33879;&#20851;&#31995;&#12290;&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#21487;&#20197;&#34917;&#20805;&#20013;&#22269;&#20256;&#32479;&#30340;CPI&#35745;&#31639;&#26041;&#27861;&#65292;&#24182;&#25552;&#20379;&#26032;&#30340;&#23439;&#35266;&#32463;&#27982;&#36235;&#21183;&#21644;&#36890;&#32960;&#39044;&#27979;&#35265;&#35299;&#12290;</title><link>http://arxiv.org/abs/2310.04242</link><description>&lt;p&gt;
&#20013;&#22269;&#22522;&#20110;&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#26500;&#24314;&#30340;&#26032;&#21152;&#26435;&#39135;&#21697;CPI
&lt;/p&gt;
&lt;p&gt;
A New Weighted Food CPI from Scanner Big Data in China. (arXiv:2310.04242v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04242
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#21152;&#26435;&#20215;&#26684;&#25351;&#25968;S-FCPIw&#65292;&#21033;&#29992;&#20013;&#22269;&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#26500;&#24314;&#65292;&#33021;&#26356;&#39057;&#32321;&#21644;&#26356;&#20016;&#23500;&#22320;&#21453;&#26144;&#21830;&#21697;&#20215;&#26684;&#30340;&#21464;&#21160;&#65292;&#19982;CPI&#21644;&#39135;&#21697;CPI&#23384;&#22312;&#26174;&#33879;&#20851;&#31995;&#12290;&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#21487;&#20197;&#34917;&#20805;&#20013;&#22269;&#20256;&#32479;&#30340;CPI&#35745;&#31639;&#26041;&#27861;&#65292;&#24182;&#25552;&#20379;&#26032;&#30340;&#23439;&#35266;&#32463;&#27982;&#36235;&#21183;&#21644;&#36890;&#32960;&#39044;&#27979;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#26377;&#28508;&#21147;&#26500;&#24314;&#28040;&#36153;&#20215;&#26684;&#25351;&#25968;&#65288;CPI&#65289;&#12290;&#26412;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#21152;&#26435;&#20215;&#26684;&#25351;&#25968;S-FCPIw&#65292;&#35813;&#25351;&#25968;&#21033;&#29992;&#20013;&#22269;&#38646;&#21806;&#38144;&#21806;&#30340;&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#26500;&#24314;&#12290;&#25105;&#20204;&#35299;&#20915;&#20102;&#20013;&#22269;CPI&#23384;&#22312;&#30340;&#39640;&#25104;&#26412;&#21644;&#21450;&#26102;&#24615;&#21457;&#24067;&#26041;&#38754;&#30340;&#23616;&#38480;&#24615;&#65292;&#24182;&#36890;&#36807;&#19982;&#29616;&#26377;&#20215;&#26684;&#25351;&#25968;&#30340;&#27604;&#36739;&#35777;&#26126;&#20102;S-FCPIw&#30340;&#21487;&#38752;&#24615;&#12290;S-FCPIw&#19981;&#20165;&#33021;&#26356;&#39057;&#32321;&#21644;&#26356;&#20016;&#23500;&#22320;&#21453;&#26144;&#21830;&#21697;&#20215;&#26684;&#30340;&#21464;&#21160;&#65292;&#32780;&#19988;&#20998;&#26512;&#32467;&#26524;&#26174;&#31034;S-FCPIw&#19982;CPI&#21644;&#39135;&#21697;CPI&#23384;&#22312;&#26174;&#33879;&#19988;&#24378;&#28872;&#30340;&#20851;&#31995;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#21487;&#20197;&#34917;&#20805;&#20013;&#22269;&#20256;&#32479;&#30340;CPI&#35745;&#31639;&#26041;&#27861;&#65292;&#24182;&#20026;&#23439;&#35266;&#32463;&#27982;&#36235;&#21183;&#21644;&#36890;&#32960;&#39044;&#27979;&#25552;&#20379;&#26032;&#30340;&#35265;&#35299;&#12290;&#25105;&#20204;&#24050;&#32463;&#20844;&#24320;&#20102;S-FCPIw&#24182;&#19988;&#27599;&#21608;&#26356;&#26032;&#65292;&#20197;&#20419;&#36827;&#35813;&#39046;&#22495;&#30340;&#36827;&#19968;&#27493;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Scanner big data has potential to construct Consumer Price Index (CPI). The study introduces a new weighted price index called S-FCPIw, which is constructed using scanner big data from retail sales in China. We address the limitations of China's CPI especially for its high cost and untimely release, and demonstrate the reliability of S-FCPIw by comparing it with existing price indices. S-FCPIw can not only reflect the changes of goods prices in higher frequency and richer dimension, and the analysis results show that S-FCPIw has a significant and strong relationship with CPI and Food CPI. The findings suggest that scanner big data can supplement traditional CPI calculations in China and provide new insights into macroeconomic trends and inflation prediction. We have made S-FCPIw publicly available and update it on a weekly basis to facilitate further study in this field.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#32771;&#34385;&#20102;&#20855;&#26377;&#23398;&#20064;&#33021;&#21147;&#30340;&#19981;&#30830;&#23450;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#25237;&#36164;&#38382;&#39064;&#65292;&#24182;&#37319;&#29992;KMM&#26041;&#27861;&#32771;&#34385;&#20102;&#22312;&#39118;&#38505;&#21644;&#27169;&#31946;&#20559;&#22909;&#19979;&#30340;&#20248;&#21270;&#38382;&#39064;&#12290;&#26368;&#20248;&#31574;&#30053;&#21487;&#20197;&#29992;&#19981;&#24102;&#27169;&#31946;&#20559;&#22909;&#30340;&#35299;&#20915;&#26041;&#26696;&#26469;&#34920;&#36848;&#65292;&#20294;&#35201;&#35843;&#25972;&#28418;&#31227;&#20998;&#24067;&#12290;</title><link>http://arxiv.org/abs/2303.08521</link><description>&lt;p&gt;
&#20855;&#26377;&#23398;&#20064;&#33021;&#21147;&#30340;&#19981;&#30830;&#23450;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#26368;&#20248;&#25237;&#36164;
&lt;/p&gt;
&lt;p&gt;
Optimal investment in ambiguous financial markets with learning. (arXiv:2303.08521v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.08521
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#34385;&#20102;&#20855;&#26377;&#23398;&#20064;&#33021;&#21147;&#30340;&#19981;&#30830;&#23450;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#25237;&#36164;&#38382;&#39064;&#65292;&#24182;&#37319;&#29992;KMM&#26041;&#27861;&#32771;&#34385;&#20102;&#22312;&#39118;&#38505;&#21644;&#27169;&#31946;&#20559;&#22909;&#19979;&#30340;&#20248;&#21270;&#38382;&#39064;&#12290;&#26368;&#20248;&#31574;&#30053;&#21487;&#20197;&#29992;&#19981;&#24102;&#27169;&#31946;&#20559;&#22909;&#30340;&#35299;&#20915;&#26041;&#26696;&#26469;&#34920;&#36848;&#65292;&#20294;&#35201;&#35843;&#25972;&#28418;&#31227;&#20998;&#24067;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#34385;&#20256;&#32479;&#30340;&#22810;&#36164;&#20135;Merton&#25237;&#36164;&#38382;&#39064;&#65292;&#20854;&#20215;&#26684;&#21160;&#24577;&#30001;&#20855;&#26377;&#24658;&#23450;&#20294;&#26410;&#30693;&#28418;&#31227;&#31995;&#25968;&#30340;&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;&#32473;&#20986;&#12290;&#25237;&#36164;&#32773;&#20551;&#35774;&#28418;&#31227;&#20998;&#24067;&#65292;&#24182;&#36890;&#36807;&#35266;&#23519;&#25237;&#36164;&#26399;&#20869;&#36164;&#20135;&#20215;&#26684;&#23454;&#29616;&#24773;&#20917;&#26469;&#23398;&#20064;&#12290;&#30740;&#31350;&#32773;&#37319;&#29992;KMM&#26041;&#27861;&#32771;&#34385;&#20102;&#22312;&#39118;&#38505;&#21644;&#27169;&#31946;&#20559;&#22909;&#19979;&#30340;&#20248;&#21270;&#38382;&#39064;&#12290;&#22312;&#27492;&#22788;&#65292;&#25237;&#36164;&#32773;&#26368;&#22823;&#21270;&#19968;&#20010;&#21452;&#37325;&#30830;&#23450;&#24615;&#31561;&#20215;&#20540;&#12290;&#20869;&#22312;&#30830;&#23450;&#24615;&#31561;&#20215;&#20540;&#26159;&#22522;&#20110;&#32473;&#23450;&#28418;&#31227;&#31995;&#25968;&#30340;&#65292;&#32780;&#22806;&#37096;&#30830;&#23450;&#24615;&#31561;&#20215;&#20540;&#26159;&#22522;&#20110;&#28418;&#31227;&#20998;&#24067;&#30340;&#12290;&#20551;&#35774;&#20063;&#26377;CRRA&#31867;&#22411;&#30340;&#27169;&#31946;&#20989;&#25968;&#65292;&#32467;&#26524;&#34920;&#26126;&#65292;&#26368;&#20248;&#31574;&#30053;&#21487;&#20197;&#29992;&#19981;&#24102;&#27169;&#31946;&#20559;&#22909;&#30340;&#35299;&#20915;&#26041;&#26696;&#26469;&#34920;&#36848;&#65292;&#20294;&#35201;&#35843;&#25972;&#28418;&#31227;&#20998;&#24067;&#12290;&#25454;&#25105;&#20204;&#25152;&#30693;&#65292;&#23545;&#20110;&#36825;&#20010;&#20855;&#26377;&#23398;&#20064;&#33021;&#21147;&#30340;&#32463;&#20856;Merton&#38382;&#39064;&#30340;&#27169;&#31946;&#24773;&#24418;&#65292;&#23578;&#26410;&#22312;&#25991;&#29486;&#20013;&#24471;&#20986;&#26174;&#24335;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the classical multi-asset Merton investment problem under drift uncertainty, i.e. the asset price dynamics are given by geometric Brownian motions with constant but unknown drift coefficients. The investor assumes a prior drift distribution and is able to learn by observing the asset prize realizations during the investment horizon. While the solution of an expected utility maximizing investor with constant relative risk aversion (CRRA) is well known, we consider the optimization problem under risk and ambiguity preferences by means of the KMM (Klibanoff et al. (2005)) approach. Here, the investor maximizes a double certainty equivalent. The inner certainty equivalent is for given drift coefficient, the outer is based on a drift distribution. Assuming also a CRRA type ambiguity function, it turns out that the optimal strategy can be stated in terms of the solution without ambiguity preferences but an adjusted drift distribution. To the best of our knowledge an explicit solu
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#21160;&#24577;&#23439;&#35266;&#32463;&#27982;&#22343;&#34913;&#26694;&#26550;&#65292;&#23558;SIRD&#27969;&#34892;&#30149;&#27169;&#22411;&#23884;&#20837;&#20854;&#20013;&#65292;&#21516;&#26102;&#32771;&#34385;&#20102;&#20010;&#20307;&#30340;&#27969;&#21160;&#24615;&#23545;&#25910;&#20837;&#21644;&#24863;&#26579;&#27010;&#29575;&#30340;&#24433;&#21709;&#12290;&#20010;&#20307;&#27969;&#21160;&#36873;&#25321;&#19982;&#32463;&#27982;&#27963;&#21160;&#21644;&#30142;&#30149;&#20256;&#25773;&#20043;&#38388;&#23384;&#22312;&#31574;&#30053;&#20114;&#34917;&#24615;&#12290;&#35813;&#30740;&#31350;&#35777;&#26126;&#20102;&#22343;&#34913;&#30340;&#23384;&#22312;&#65292;&#24182;&#25552;&#20379;&#20102;&#22343;&#34913;&#25628;&#32034;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#23545;&#24847;&#22823;&#21033;COVID-19&#27969;&#34892;&#30149;&#30340;&#32463;&#39564;&#36827;&#34892;&#27169;&#22411;&#26657;&#20934;&#65292;&#35752;&#35770;&#20102;&#25919;&#31574;&#21547;&#20041;&#12290;</title><link>http://arxiv.org/abs/2107.01746</link><description>&lt;p&gt;
&#31227;&#21160;&#20915;&#31574;&#12289;&#32463;&#27982;&#21160;&#24577;&#21644;&#27969;&#34892;&#30149;
&lt;/p&gt;
&lt;p&gt;
Mobility decisions, economic dynamics and epidemic. (arXiv:2107.01746v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2107.01746
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#21160;&#24577;&#23439;&#35266;&#32463;&#27982;&#22343;&#34913;&#26694;&#26550;&#65292;&#23558;SIRD&#27969;&#34892;&#30149;&#27169;&#22411;&#23884;&#20837;&#20854;&#20013;&#65292;&#21516;&#26102;&#32771;&#34385;&#20102;&#20010;&#20307;&#30340;&#27969;&#21160;&#24615;&#23545;&#25910;&#20837;&#21644;&#24863;&#26579;&#27010;&#29575;&#30340;&#24433;&#21709;&#12290;&#20010;&#20307;&#27969;&#21160;&#36873;&#25321;&#19982;&#32463;&#27982;&#27963;&#21160;&#21644;&#30142;&#30149;&#20256;&#25773;&#20043;&#38388;&#23384;&#22312;&#31574;&#30053;&#20114;&#34917;&#24615;&#12290;&#35813;&#30740;&#31350;&#35777;&#26126;&#20102;&#22343;&#34913;&#30340;&#23384;&#22312;&#65292;&#24182;&#25552;&#20379;&#20102;&#22343;&#34913;&#25628;&#32034;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#23545;&#24847;&#22823;&#21033;COVID-19&#27969;&#34892;&#30149;&#30340;&#32463;&#39564;&#36827;&#34892;&#27169;&#22411;&#26657;&#20934;&#65292;&#35752;&#35770;&#20102;&#25919;&#31574;&#21547;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#23558;&#26131;&#24863;-&#24863;&#26579;-&#24247;&#22797;-&#27515;&#20129;&#65288;SIRD&#65289;&#27969;&#34892;&#30149;&#27169;&#22411;&#23884;&#20837;&#21040;&#20855;&#26377;&#20195;&#29702;&#20154;&#27969;&#21160;&#24615;&#30340;&#21160;&#24577;&#23439;&#35266;&#32463;&#27982;&#22343;&#34913;&#26694;&#26550;&#20013;&#12290;&#21518;&#32773;&#21516;&#26102;&#24433;&#21709;&#20182;&#20204;&#30340;&#25910;&#20837;&#21644;&#24863;&#26579;&#21644;&#34987;&#24863;&#26579;&#30340;&#27010;&#29575;&#12290;&#20010;&#20307;&#27969;&#21160;&#36873;&#25321;&#20043;&#38388;&#30340;&#31574;&#30053;&#20114;&#34917;&#24615;&#25512;&#21160;&#20102;&#24635;&#20307;&#32463;&#27982;&#27963;&#21160;&#30340;&#28436;&#21464;&#65292;&#32780;&#20010;&#20307;&#27969;&#21160;&#24341;&#36215;&#30340;&#24863;&#26579;&#22806;&#37096;&#24615;&#24433;&#21709;&#20102;&#30142;&#30149;&#20256;&#25773;&#12290;&#29702;&#24615;&#30340;&#21069;&#30651;&#20195;&#29702;&#20154;&#30340;&#36830;&#32493;&#24615;&#22312;&#31163;&#25955;&#26102;&#38388;&#12289;&#26377;&#38480;&#29366;&#24577;&#12289;&#26080;&#38480;&#26399;&#22343;&#22330;&#21338;&#24328;&#30340;&#32435;&#20160;&#22343;&#34913;&#19978;&#21327;&#35843;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22343;&#34913;&#30340;&#23384;&#22312;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#31181;&#36882;&#24402;&#26500;&#36896;&#22343;&#34913;&#30340;&#25628;&#32034;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#20063;&#25351;&#23548;&#20102;&#25105;&#20204;&#30340;&#25968;&#20540;&#30740;&#31350;&#12290;&#25105;&#20204;&#36890;&#36807;&#20351;&#29992;&#24847;&#22823;&#21033;&#23545;COVID-19&#27969;&#34892;&#30149;&#30340;&#32463;&#39564;&#36827;&#34892;&#20102;&#27169;&#22411;&#26657;&#20934;&#65292;&#24182;&#35752;&#35770;&#20102;&#25919;&#31574;&#21547;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a model, which nests a susceptible-infected-recovered-deceased (SIRD) epidemic model into a dynamic macroeconomic equilibrium framework with agents' mobility. The latter affect both their income and their probability of infecting and being infected. Strategic complementarities among individual mobility choices drive the evolution of aggregate economic activity, while infection externalities caused by individual mobility affect disease diffusion. The continuum of rational forward-looking agents coordinates on the Nash equilibrium of a discrete time, finite-state, infinite-horizon Mean Field Game. We prove the existence of an equilibrium and provide a recursive construction method for the search of an equilibrium(a), which also guides our numerical investigations. We calibrate the model by using Italian experience on COVID-19 epidemic and we discuss policy implications.
&lt;/p&gt;</description></item></channel></rss>