<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#23558;&#24773;&#24863;&#20998;&#26512;&#21644;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#38598;&#25104;&#31639;&#27861;&#24212;&#29992;&#20110;&#32929;&#31080;&#20132;&#26131;&#30340;&#26041;&#27861;&#65292;&#35774;&#35745;&#20102;&#21487;&#20197;&#26681;&#25454;&#24066;&#22330;&#24773;&#32490;&#21160;&#24577;&#35843;&#25972;&#30340;&#20132;&#26131;&#31574;&#30053;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#36825;&#31181;&#26041;&#27861;&#27604;&#20256;&#32479;&#30340;&#38598;&#25104;&#31574;&#30053;&#12289;&#21333;&#19968;&#26234;&#33021;&#20307;&#31639;&#27861;&#21644;&#24066;&#22330;&#25351;&#26631;&#26356;&#20855;&#30408;&#21033;&#24615;&#12289;&#31283;&#20581;&#24615;&#21644;&#39118;&#38505;&#26368;&#23567;&#21270;&#12290;&#30456;&#20851;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;&#20256;&#32479;&#30340;&#22266;&#23450;&#26356;&#25442;&#38598;&#25104;&#26234;&#33021;&#20307;&#30340;&#20570;&#27861;&#24182;&#19981;&#26159;&#26368;&#20248;&#30340;&#65292;&#32780;&#22522;&#20110;&#24773;&#24863;&#30340;&#21160;&#24577;&#26694;&#26550;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#20132;&#26131;&#26234;&#33021;&#20307;&#30340;&#24615;&#33021;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01441</link><description>&lt;p&gt;
&#23398;&#20064;&#24066;&#22330;&#65306;&#22522;&#20110;&#24773;&#24863;&#30340;&#38598;&#25104;&#20132;&#26131;&#26234;&#33021;&#20307;
&lt;/p&gt;
&lt;p&gt;
Learning the Market: Sentiment-Based Ensemble Trading Agents
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01441
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#23558;&#24773;&#24863;&#20998;&#26512;&#21644;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#38598;&#25104;&#31639;&#27861;&#24212;&#29992;&#20110;&#32929;&#31080;&#20132;&#26131;&#30340;&#26041;&#27861;&#65292;&#35774;&#35745;&#20102;&#21487;&#20197;&#26681;&#25454;&#24066;&#22330;&#24773;&#32490;&#21160;&#24577;&#35843;&#25972;&#30340;&#20132;&#26131;&#31574;&#30053;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#36825;&#31181;&#26041;&#27861;&#27604;&#20256;&#32479;&#30340;&#38598;&#25104;&#31574;&#30053;&#12289;&#21333;&#19968;&#26234;&#33021;&#20307;&#31639;&#27861;&#21644;&#24066;&#22330;&#25351;&#26631;&#26356;&#20855;&#30408;&#21033;&#24615;&#12289;&#31283;&#20581;&#24615;&#21644;&#39118;&#38505;&#26368;&#23567;&#21270;&#12290;&#30456;&#20851;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;&#20256;&#32479;&#30340;&#22266;&#23450;&#26356;&#25442;&#38598;&#25104;&#26234;&#33021;&#20307;&#30340;&#20570;&#27861;&#24182;&#19981;&#26159;&#26368;&#20248;&#30340;&#65292;&#32780;&#22522;&#20110;&#24773;&#24863;&#30340;&#21160;&#24577;&#26694;&#26550;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#20132;&#26131;&#26234;&#33021;&#20307;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#23558;&#24773;&#24863;&#20998;&#26512;&#21644;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#38598;&#25104;&#31639;&#27861;&#24212;&#29992;&#20110;&#32929;&#31080;&#20132;&#26131;&#65292;&#24182;&#35774;&#35745;&#20102;&#19968;&#31181;&#33021;&#22815;&#26681;&#25454;&#24403;&#21069;&#24066;&#22330;&#24773;&#32490;&#21160;&#24577;&#35843;&#25972;&#25152;&#20351;&#29992;&#30340;&#26234;&#33021;&#20307;&#30340;&#31574;&#30053;&#12290;&#25105;&#20204;&#21019;&#24314;&#20102;&#19968;&#20010;&#31616;&#21333;&#20294;&#26377;&#25928;&#30340;&#26041;&#27861;&#26469;&#25552;&#21462;&#26032;&#38395;&#24773;&#24863;&#65292;&#24182;&#23558;&#20854;&#19982;&#23545;&#29616;&#26377;&#20316;&#21697;&#30340;&#19968;&#33324;&#25913;&#36827;&#32467;&#21512;&#36215;&#26469;&#65292;&#20174;&#32780;&#24471;&#21040;&#26377;&#25928;&#32771;&#34385;&#23450;&#24615;&#24066;&#22330;&#22240;&#32032;&#21644;&#23450;&#37327;&#32929;&#31080;&#25968;&#25454;&#30340;&#33258;&#21160;&#20132;&#26131;&#26234;&#33021;&#20307;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#23548;&#33268;&#20102;&#19968;&#31181;&#30408;&#21033;&#12289;&#31283;&#20581;&#19988;&#39118;&#38505;&#26368;&#23567;&#30340;&#31574;&#30053;&#65292;&#20248;&#20110;&#20256;&#32479;&#30340;&#38598;&#25104;&#31574;&#30053;&#20197;&#21450;&#21333;&#19968;&#26234;&#33021;&#20307;&#31639;&#27861;&#21644;&#24066;&#22330;&#25351;&#26631;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#34920;&#26126;&#65292;&#20256;&#32479;&#30340;&#27599;&#38548;&#22266;&#23450;&#26376;&#20221;&#26356;&#25442;&#38598;&#25104;&#26234;&#33021;&#20307;&#30340;&#20570;&#27861;&#24182;&#19981;&#26159;&#26368;&#20248;&#30340;&#65292;&#22522;&#20110;&#24773;&#24863;&#30340;&#21160;&#24577;&#26694;&#26550;&#26497;&#22823;&#22320;&#25552;&#21319;&#20102;&#36825;&#20123;&#26234;&#33021;&#20307;&#30340;&#24615;&#33021;&#12290;&#27492;&#22806;&#65292;&#30001;&#20110;&#25105;&#20204;&#30340;&#31639;&#27861;&#35774;&#35745;&#31616;&#21333;&#19988;...
&lt;/p&gt;
&lt;p&gt;
We propose the integration of sentiment analysis and deep-reinforcement learning ensemble algorithms for stock trading, and design a strategy capable of dynamically altering its employed agent given concurrent market sentiment. In particular, we create a simple-yet-effective method for extracting news sentiment and combine this with general improvements upon existing works, resulting in automated trading agents that effectively consider both qualitative market factors and quantitative stock data. We show that our approach results in a strategy that is profitable, robust, and risk-minimal -- outperforming the traditional ensemble strategy as well as single agent algorithms and market metrics. Our findings determine that the conventional practice of switching ensemble agents every fixed-number of months is sub-optimal, and that a dynamic sentiment-based framework greatly unlocks additional performance within these agents. Furthermore, as we have designed our algorithm with simplicity and
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#39044;&#27979;&#22522;&#20110;&#30707;&#27833;&#30340;&#21830;&#21697;&#30340;&#27874;&#21160;&#24615;&#65292;&#36890;&#36807;&#23558;&#24322;&#36136;&#25345;&#32493;&#24615;&#30340;&#20914;&#20987;&#22312;&#26102;&#38388;&#19978;&#24179;&#28369;&#21464;&#21270;&#65292;&#36825;&#31181;&#27169;&#22411;&#22312;&#25913;&#36827;&#27874;&#21160;&#24615;&#39044;&#27979;&#26041;&#38754;&#34920;&#29616;&#20986;&#33394;&#65292;&#24182;&#19988;&#29305;&#21035;&#36866;&#29992;&#20110;&#36739;&#38271;&#26102;&#38388;&#27573;&#30340;&#39044;&#27979;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01354</link><description>&lt;p&gt;
&#39044;&#27979;&#22522;&#20110;&#30707;&#27833;&#30340;&#21830;&#21697;&#27874;&#21160;&#24615;: &#21160;&#24577;&#25345;&#32493;&#24615;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Forecasting Volatility of Oil-based Commodities: The Model of Dynamic Persistence
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01354
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#39044;&#27979;&#22522;&#20110;&#30707;&#27833;&#30340;&#21830;&#21697;&#30340;&#27874;&#21160;&#24615;&#65292;&#36890;&#36807;&#23558;&#24322;&#36136;&#25345;&#32493;&#24615;&#30340;&#20914;&#20987;&#22312;&#26102;&#38388;&#19978;&#24179;&#28369;&#21464;&#21270;&#65292;&#36825;&#31181;&#27169;&#22411;&#22312;&#25913;&#36827;&#27874;&#21160;&#24615;&#39044;&#27979;&#26041;&#38754;&#34920;&#29616;&#20986;&#33394;&#65292;&#24182;&#19988;&#29305;&#21035;&#36866;&#29992;&#20110;&#36739;&#38271;&#26102;&#38388;&#27573;&#30340;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26102;&#38388;&#21464;&#21160;&#21644;&#25345;&#32493;&#24615;&#26159;&#27874;&#21160;&#24615;&#30340;&#20851;&#38190;&#23646;&#24615;&#65292;&#36890;&#24120;&#22312;&#22522;&#20110;&#30707;&#27833;&#30340;&#27874;&#21160;&#24615;&#39044;&#27979;&#27169;&#22411;&#20013;&#20998;&#21035;&#30740;&#31350;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#20801;&#35768;&#20855;&#26377;&#24322;&#36136;&#25345;&#32493;&#24615;&#30340;&#20914;&#20987;&#22312;&#26102;&#38388;&#19978;&#24179;&#28369;&#21464;&#21270;&#65292;&#24182;&#23558;&#20004;&#32773;&#32467;&#21512;&#22312;&#19968;&#36215;&#24314;&#27169;&#12290;&#25105;&#20204;&#35748;&#20026;&#36825;&#24456;&#37325;&#35201;&#65292;&#22240;&#20026;&#36825;&#31181;&#21160;&#24577;&#26159;&#30001;&#20110;&#22522;&#20110;&#30707;&#27833;&#21830;&#21697;&#30340;&#20914;&#20987;&#30340;&#21160;&#24577;&#24615;&#36136;&#33258;&#28982;&#20135;&#29983;&#30340;&#12290;&#25105;&#20204;&#36890;&#36807;&#23616;&#37096;&#22238;&#24402;&#20174;&#25968;&#25454;&#20013;&#35782;&#21035;&#20986;&#36825;&#31181;&#21160;&#24577;&#65292;&#24182;&#24314;&#31435;&#20102;&#19968;&#20010;&#26174;&#33879;&#25913;&#36827;&#27874;&#21160;&#24615;&#39044;&#27979;&#30340;&#27169;&#22411;&#12290;&#36825;&#31181;&#22522;&#20110;&#22312;&#26102;&#38388;&#19978;&#24179;&#28369;&#21464;&#21270;&#30340;&#20016;&#23500;&#25345;&#32493;&#24615;&#32467;&#26500;&#30340;&#39044;&#27979;&#27169;&#22411;&#65292;&#36229;&#36234;&#20102;&#26368;&#20808;&#36827;&#30340;&#22522;&#20934;&#27169;&#22411;&#65292;&#24182;&#22312;&#36739;&#38271;&#30340;&#39044;&#27979;&#26102;&#38388;&#27573;&#20869;&#29305;&#21035;&#26377;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Time variation and persistence are crucial properties of volatility that are often studied separately in oil-based volatility forecasting models. Here, we propose a novel approach that allows shocks with heterogeneous persistence to vary smoothly over time, and thus model the two together. We argue that this is important because such dynamics arise naturally from the dynamic nature of shocks in oil-based commodities. We identify such dynamics from the data using localised regressions and build a model that significantly improves volatility forecasts. Such forecasting models, based on a rich persistence structure that varies smoothly over time, outperform state-of-the-art benchmark models and are particularly useful for forecasting over longer horizons.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#30001;&#22797;&#21512;Poisson&#36807;&#31243;&#36924;&#36817;&#30340;L&#233;vy&#36807;&#31243;&#39537;&#21160;&#30340;BSDEs&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#22312;L^2&#33539;&#25968;&#21644;Wasserstein&#36317;&#31163;&#19979;&#30340;&#26368;&#20248;&#25910;&#25947;&#36895;&#24230;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01337</link><description>&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30340;&#32763;&#35793;&#39064;&#30446;&#26159;&#12298;&#30001;L&#233;vy&#36807;&#31243;&#39537;&#21160;&#30340;&#21453;&#21521;SDE&#30340;&#25910;&#25947;&#36895;&#24230;&#12299;
&lt;/p&gt;
&lt;p&gt;
Convergence rates for Backward SDEs driven by L\'evy processes
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01337
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#30001;&#22797;&#21512;Poisson&#36807;&#31243;&#36924;&#36817;&#30340;L&#233;vy&#36807;&#31243;&#39537;&#21160;&#30340;BSDEs&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#22312;L^2&#33539;&#25968;&#21644;Wasserstein&#36317;&#31163;&#19979;&#30340;&#26368;&#20248;&#25910;&#25947;&#36895;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#30001;&#22797;&#21512;Poisson&#36807;&#31243;&#36924;&#36817;&#30340;L&#233;vy&#36807;&#31243;&#20197;&#21450;&#30456;&#24212;&#30340;&#30001;&#22797;&#21512;Poisson&#36924;&#36817;&#30340;L&#233;vy&#36807;&#31243;&#39537;&#21160;&#30340;BSDEs&#12290;&#25105;&#20204;&#23545;&#36817;&#20284;BSDEs&#25910;&#25947;&#21040;L&#233;vy&#36807;&#31243;&#39537;&#21160;&#30340;BSDEs&#30340;&#36895;&#24230;&#24863;&#20852;&#36259;&#12290;L&#233;vy&#36807;&#31243;&#30340;&#25910;&#25947;&#36895;&#24230;&#21462;&#20915;&#20110;&#36807;&#31243;&#30340;Blumenthal--Getoor&#25351;&#25968;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;BSDEs&#22312;L^2&#33539;&#25968;&#21644;Wasserstein&#36317;&#31163;&#19979;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#24182;&#34920;&#26126;&#65292;&#22312;&#36825;&#20004;&#31181;&#24773;&#20917;&#19979;&#65292;&#25910;&#25947;&#36895;&#24230;&#19982;&#30456;&#24212;L&#233;vy&#36807;&#31243;&#30340;&#25910;&#25947;&#36895;&#24230;&#30456;&#31561;&#65292;&#22240;&#27492;&#26159;&#26368;&#20248;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider L\'evy processes that are approximated by compound Poisson processes and, correspondingly, BSDEs driven by L\'evy processes that are approximated by BSDEs driven by their compound Poisson approximations. We are interested in the rate of convergence of the approximate BSDEs to the ones driven by the L\'evy processes. The rate of convergence of the L\'evy processes depends on the Blumenthal--Getoor index of the process. We derive the rate of convergence for the BSDEs in the $\mathbb L^2$-norm and in the Wasserstein distance, and show that, in both cases, this equals the rate of convergence of the corresponding L\'evy process, and thus is optimal.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#29992;&#20110;&#32852;&#21512;&#35780;&#20272;&#22810;&#21464;&#37327;&#26041;&#21521;&#39044;&#27979;&#25216;&#33021;&#30340;&#31616;&#21333;&#26041;&#27861;&#65292;&#24182;&#21033;&#29992;&#27888;&#22269;&#19977;&#20010;&#32452;&#32455;&#22312;2001&#24180;&#33267;2021&#24180;&#38388;&#30340;GDP&#22686;&#38271;&#21644;&#36890;&#32960;&#39044;&#27979;&#25968;&#25454;&#65292;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#30340;&#24212;&#29992;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01142</link><description>&lt;p&gt;
&#19968;&#31181;&#29992;&#20110;&#22810;&#21464;&#37327;&#26041;&#21521;&#39044;&#27979;&#25216;&#33021;&#32852;&#21512;&#35780;&#20272;&#30340;&#31616;&#21333;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A simple method for joint evaluation of skill in directional forecasts of multiple variables
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01142
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#29992;&#20110;&#32852;&#21512;&#35780;&#20272;&#22810;&#21464;&#37327;&#26041;&#21521;&#39044;&#27979;&#25216;&#33021;&#30340;&#31616;&#21333;&#26041;&#27861;&#65292;&#24182;&#21033;&#29992;&#27888;&#22269;&#19977;&#20010;&#32452;&#32455;&#22312;2001&#24180;&#33267;2021&#24180;&#38388;&#30340;GDP&#22686;&#38271;&#21644;&#36890;&#32960;&#39044;&#27979;&#25968;&#25454;&#65292;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20027;&#35201;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#30340;&#39044;&#27979;&#36890;&#24120;&#30001;&#21516;&#19968;&#32452;&#32455;&#21516;&#26102;&#36827;&#34892;&#65292;&#24182;&#19988;&#22312;&#25919;&#31574;&#20998;&#26512;&#21644;&#20915;&#31574;&#20013;&#19968;&#36215;&#21576;&#29616;&#21644;&#20351;&#29992;&#12290;&#22240;&#27492;&#65292;&#20102;&#35299;&#39044;&#27979;&#32773;&#26159;&#21542;&#20855;&#22791;&#36275;&#22815;&#30340;&#25216;&#33021;&#26469;&#39044;&#27979;&#36825;&#20123;&#21464;&#37327;&#30340;&#26410;&#26469;&#20540;&#38750;&#24120;&#37325;&#35201;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#29992;&#20110;&#32852;&#21512;&#35780;&#20272;&#22810;&#21464;&#37327;&#26041;&#21521;&#39044;&#27979;&#25216;&#33021;&#30340;&#31616;&#21333;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#26131;&#20110;&#20351;&#29992;&#65292;&#19981;&#20381;&#36182;&#20110;&#20256;&#32479;&#32479;&#35745;&#26041;&#27861;&#20013;&#34913;&#37327;&#26041;&#21521;&#39044;&#27979;&#20934;&#30830;&#24615;&#25152;&#38656;&#30340;&#22797;&#26434;&#20551;&#35774;&#12290;&#37319;&#29992;&#27888;&#22269;&#19977;&#20010;&#32452;&#32455;&#65288;&#27888;&#22269;&#38134;&#34892;&#12289;&#36130;&#25919;&#25919;&#31574;&#21150;&#20844;&#23460;&#21644;&#22269;&#23478;&#32463;&#27982;&#21644;&#31038;&#20250;&#21457;&#23637;&#22996;&#21592;&#20250;&#21150;&#20844;&#23460;&#65289;&#20851;&#20110;2001&#24180;&#33267;2021&#24180;&#38388;&#27888;&#22269;GDP&#22686;&#38271;&#21644;&#36890;&#32960;&#39044;&#27979;&#20197;&#21450;&#23454;&#38469;&#25968;&#25454;&#65292;&#20197;&#28436;&#31034;&#35813;&#26041;&#27861;&#22914;&#20309;&#29992;&#20110;&#35780;&#20272;&#39044;&#27979;&#32773;&#30340;&#25216;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Forecasts for key macroeconomic variables are almost always made simultaneously by the same organizations, presented together, and used together in policy analyses and decision-makings. It is therefore important to know whether the forecasters are skillful enough to forecast the future values of those variables. Here a method for joint evaluation of skill in directional forecasts of multiple variables is introduced. The method is simple to use and does not rely on complicated assumptions required by the conventional statistical methods for measuring accuracy of directional forecast. The data on GDP growth and inflation forecasts of three organizations from Thailand, namely, the Bank of Thailand, the Fiscal Policy Office, and the Office of the National Economic and Social Development Council as well as the actual data on GDP growth and inflation of Thailand between 2001 and 2021 are employed in order to demonstrate how the method could be used to evaluate the skills of forecasters in pr
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21457;&#29616;&#27888;&#22269;&#30340;&#25910;&#20837;&#20998;&#37197;&#20855;&#26377;&#23610;&#24230;&#19981;&#21464;&#24615;&#65292;&#22312;&#36817;&#19977;&#21313;&#24180;&#26469;&#20445;&#25345;&#19981;&#21464;&#65292;&#24847;&#21619;&#30528;&#25913;&#21464;&#25910;&#20837;&#20998;&#37197;&#38656;&#35201;&#36827;&#34892;&#31867;&#20284;&#29289;&#29702;&#23398;&#20013;&#29289;&#36136;&#30456;&#21464;&#30340;&#36807;&#31243;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01141</link><description>&lt;p&gt;
&#27888;&#22269;&#30340;&#25910;&#20837;&#20998;&#37197;&#20855;&#26377;&#23610;&#24230;&#19981;&#21464;&#24615;
&lt;/p&gt;
&lt;p&gt;
Income distribution in Thailand is scale-invariant
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01141
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21457;&#29616;&#27888;&#22269;&#30340;&#25910;&#20837;&#20998;&#37197;&#20855;&#26377;&#23610;&#24230;&#19981;&#21464;&#24615;&#65292;&#22312;&#36817;&#19977;&#21313;&#24180;&#26469;&#20445;&#25345;&#19981;&#21464;&#65292;&#24847;&#21619;&#30528;&#25913;&#21464;&#25910;&#20837;&#20998;&#37197;&#38656;&#35201;&#36827;&#34892;&#31867;&#20284;&#29289;&#29702;&#23398;&#20013;&#29289;&#36136;&#30456;&#21464;&#30340;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#23519;&#20102;&#27888;&#22269;&#30340;&#25910;&#20837;&#20998;&#37197;&#26159;&#21542;&#20855;&#26377;&#23610;&#24230;&#19981;&#21464;&#24615;&#25110;&#24180;&#24230;&#33258;&#30456;&#20284;&#24615;&#12290;&#36890;&#36807;&#20351;&#29992;1988&#24180;&#33267;2021&#24180;&#27888;&#22269;&#20116;&#20998;&#20301;&#21644;&#21313;&#20998;&#20301;&#30340;&#25910;&#20837;&#20221;&#39069;&#25968;&#25454;&#65292;306&#20010;&#37197;&#23545;&#30340;Kolmogorov-Smirnov&#26816;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#27888;&#22269;&#30340;&#25910;&#20837;&#20998;&#37197;&#22312;&#32479;&#35745;&#19978;&#20855;&#26377;&#23610;&#24230;&#19981;&#21464;&#24615;&#25110;&#24180;&#24230;&#33258;&#30456;&#20284;&#24615;&#65292;p&#20540;&#33539;&#22260;&#22312;0.988&#33267;1.000&#20043;&#38388;&#12290;&#26681;&#25454;&#36825;&#20123;&#23454;&#35777;&#32467;&#26524;&#65292;&#26412;&#30740;&#31350;&#35748;&#20026;&#65292;&#20026;&#20102;&#25913;&#21464;&#25345;&#32493;&#20102;&#19977;&#21313;&#22810;&#24180;&#30340;&#27888;&#22269;&#25910;&#20837;&#20998;&#37197;&#27169;&#24335;&#65292;&#21464;&#38761;&#26412;&#36523;&#19981;&#33021;&#26159;&#28176;&#36827;&#30340;&#65292;&#32780;&#24212;&#35813;&#20687;&#29289;&#29702;&#23398;&#20013;&#30340;&#30456;&#21464;&#36807;&#31243;&#19968;&#26679;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study examines whether income distribution in Thailand has a property of scale invariance or self-similarity across years. By using the data on income shares by quintile and by decile of Thailand from 1988 to 2021, the results from 306-pairwise Kolmogorov-Smirnov tests indicate that income distribution in Thailand is statistically scale-invariant or self-similar across years with p-values ranging between 0.988 and 1.000. Based on these empirical findings, this study would like to propose that, in order to change income distribution in Thailand whose pattern had persisted for over three decades, the change itself cannot be gradual but has to be like a phase transition of substance in physics.
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#21033;&#29992;&#23494;&#30721;&#35745;&#31639;&#24179;&#21488;&#25910;&#38598;&#21040;&#30340;&#24066;&#25919;&#26426;&#26500;&#25968;&#25454;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#24066;&#25919;&#32593;&#32476;&#39118;&#38505;&#27169;&#22411;&#21644;&#32593;&#32476;&#23433;&#20840;&#22522;&#20934;&#65292;&#21487;&#20197;&#24110;&#21161;&#25351;&#23548;&#32593;&#32476;&#25919;&#31574;&#21046;&#23450;&#65292;&#37327;&#21270;&#32593;&#32476;&#39118;&#38505;&#65292;&#35782;&#21035;&#24046;&#36317;&#65292;&#20248;&#20808;&#32771;&#34385;&#25919;&#31574;&#24178;&#39044;&#65292;&#20197;&#21450;&#36319;&#36394;&#24178;&#39044;&#25514;&#26045;&#30340;&#36827;&#23637;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01007</link><description>&lt;p&gt;
&#21033;&#29992;&#23494;&#30721;&#35745;&#31639;&#36827;&#34892;&#24066;&#25919;&#32593;&#32476;&#39118;&#38505;&#24314;&#27169;&#20197;&#20026;&#32593;&#32476;&#25919;&#31574;&#21046;&#23450;&#25552;&#20379;&#20449;&#24687;
&lt;/p&gt;
&lt;p&gt;
Municipal cyber risk modeling using cryptographic computing to inform cyber policymaking
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01007
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#21033;&#29992;&#23494;&#30721;&#35745;&#31639;&#24179;&#21488;&#25910;&#38598;&#21040;&#30340;&#24066;&#25919;&#26426;&#26500;&#25968;&#25454;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#24066;&#25919;&#32593;&#32476;&#39118;&#38505;&#27169;&#22411;&#21644;&#32593;&#32476;&#23433;&#20840;&#22522;&#20934;&#65292;&#21487;&#20197;&#24110;&#21161;&#25351;&#23548;&#32593;&#32476;&#25919;&#31574;&#21046;&#23450;&#65292;&#37327;&#21270;&#32593;&#32476;&#39118;&#38505;&#65292;&#35782;&#21035;&#24046;&#36317;&#65292;&#20248;&#20808;&#32771;&#34385;&#25919;&#31574;&#24178;&#39044;&#65292;&#20197;&#21450;&#36319;&#36394;&#24178;&#39044;&#25514;&#26045;&#30340;&#36827;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24066;&#25919;&#26426;&#26500;&#23481;&#26131;&#21463;&#21040;&#32593;&#32476;&#25915;&#20987;&#24182;&#36896;&#25104;&#28798;&#38590;&#24615;&#21518;&#26524;&#65292;&#20294;&#32570;&#20047;&#35780;&#20272;&#33258;&#36523;&#39118;&#38505;&#24182;&#19982;&#21516;&#34892;&#26426;&#26500;&#30340;&#23433;&#20840;&#29366;&#20917;&#36827;&#34892;&#27604;&#36739;&#30340;&#20851;&#38190;&#20449;&#24687;&#12290;&#25105;&#20204;&#21033;&#29992;&#36890;&#36807;&#23494;&#30721;&#35745;&#31639;&#24179;&#21488;&#25910;&#38598;&#30340;83&#20010;&#24066;&#25919;&#26426;&#26500;&#30340;&#25968;&#25454;&#65292;&#21253;&#25324;&#23433;&#20840;&#29366;&#20917;&#12289;&#23433;&#20840;&#20107;&#20214;&#12289;&#23433;&#20840;&#25511;&#21046;&#22833;&#25928;&#20197;&#21450;&#25439;&#22833;&#65292;&#24314;&#31435;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#24066;&#25919;&#32593;&#32476;&#39118;&#38505;&#27169;&#22411;&#21644;&#32593;&#32476;&#23433;&#20840;&#22522;&#20934;&#12290;&#25105;&#20204;&#29983;&#25104;&#20102;&#19968;&#20010;&#34892;&#19994;&#20013;&#23433;&#20840;&#29366;&#20917;&#30340;&#22522;&#20934;&#12289;&#32593;&#32476;&#23433;&#20840;&#20107;&#20214;&#30340;&#39057;&#29575;&#12289;&#32452;&#32455;&#26681;&#25454;&#20854;&#38450;&#24481;&#29366;&#20917;&#39044;&#27979;&#30340;&#24180;&#24230;&#25439;&#22833;&#65292;&#20197;&#21450;&#26681;&#25454;&#21508;&#20010;&#25511;&#21046;&#25514;&#26045;&#30340;&#22833;&#25928;&#29575;&#21644;&#30456;&#20851;&#25439;&#22833;&#21152;&#26435;&#12290;&#32508;&#21512;&#36825;&#22235;&#39033;&#25351;&#26631;&#21487;&#20197;&#36890;&#36807;&#37327;&#21270;&#34892;&#19994;&#20013;&#30340;&#32593;&#32476;&#39118;&#38505;&#12289;&#35782;&#21035;&#38656;&#35201;&#35299;&#20915;&#30340;&#24046;&#36317;&#12289;&#20248;&#20808;&#32771;&#34385;&#25919;&#31574;&#24178;&#39044;&#65292;&#24182;&#36319;&#36394;&#36825;&#20123;&#24178;&#39044;&#25514;&#26045;&#30340;&#36827;&#23637;&#26469;&#25351;&#23548;&#32593;&#32476;&#25919;&#31574;&#21046;&#23450;&#12290;&#23545;&#20110;&#24066;&#25919;&#26426;&#26500;&#26469;&#35828;&#65292;&#36825;&#20123;&#26032;&#30340;&#25351;&#26631;&#21487;&#20197;&#24110;&#21161;&#20182;&#20204;&#35780;&#20272;&#33258;&#36523;&#32593;&#32476;&#39118;&#38505;&#24182;&#21046;&#23450;&#30456;&#24212;&#30340;&#25913;&#36827;&#25514;&#26045;&#12290;
&lt;/p&gt;
&lt;p&gt;
Municipalities are vulnerable to cyberattacks with devastating consequences, but they lack key information to evaluate their own risk and compare their security posture to peers. Using data from 83 municipalities collected via a cryptographically secure computation platform about their security posture, incidents, security control failures, and losses, we build data-driven cyber risk models and cyber security benchmarks for municipalities. We produce benchmarks of the security posture in a sector, the frequency of cyber incidents, forecasted annual losses for organizations based on their defensive posture, and a weighting of cyber controls based on their individual failure rates and associated losses. Combined, these four items can help guide cyber policymaking by quantifying the cyber risk in a sector, identifying gaps that need to be addressed, prioritizing policy interventions, and tracking progress of those interventions over time. In the case of the municipalities, these newly der
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#22522;&#20110;&#20844;&#29702;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#39118;&#38505;&#24230;&#37327;&#26041;&#27861;&#65292;&#26088;&#22312;&#31649;&#29702;&#22797;&#26434;&#31995;&#32479;&#20013;&#30340;&#31995;&#32479;&#24615;&#39118;&#38505;&#65292;&#29305;&#21035;&#26159;&#32593;&#32476;&#20013;&#30340;&#31995;&#32479;&#24615;&#32593;&#32476;&#39118;&#38505;&#12290;&#36825;&#20123;&#39118;&#38505;&#24230;&#37327;&#26041;&#27861;&#38024;&#23545;&#32593;&#32476;&#30340;&#25299;&#25169;&#37197;&#32622;&#65292;&#20197;&#20943;&#36731;&#20256;&#25773;&#23041;&#32961;&#30340;&#39118;&#38505;&#12290;</title><link>https://rss.arxiv.org/abs/2312.13884</link><description>&lt;p&gt;
&#23545;&#20110;&#22797;&#26434;&#31995;&#32479;&#30340;&#32593;&#32476;&#30340;&#24377;&#24615;&#24230;&#37327; -- &#22522;&#20110;&#20844;&#29702;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Measures of Resilience to Cyber Contagion -- An Axiomatic Approach for Complex Systems
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2312.13884
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#22522;&#20110;&#20844;&#29702;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#39118;&#38505;&#24230;&#37327;&#26041;&#27861;&#65292;&#26088;&#22312;&#31649;&#29702;&#22797;&#26434;&#31995;&#32479;&#20013;&#30340;&#31995;&#32479;&#24615;&#39118;&#38505;&#65292;&#29305;&#21035;&#26159;&#32593;&#32476;&#20013;&#30340;&#31995;&#32479;&#24615;&#32593;&#32476;&#39118;&#38505;&#12290;&#36825;&#20123;&#39118;&#38505;&#24230;&#37327;&#26041;&#27861;&#38024;&#23545;&#32593;&#32476;&#30340;&#25299;&#25169;&#37197;&#32622;&#65292;&#20197;&#20943;&#36731;&#20256;&#25773;&#23041;&#32961;&#30340;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#39118;&#38505;&#24230;&#37327;&#26041;&#27861;&#65292;&#26088;&#22312;&#31649;&#29702;&#32593;&#32476;&#20013;&#30340;&#31995;&#32479;&#24615;&#39118;&#38505;&#12290;&#19982;&#29616;&#26377;&#26041;&#27861;&#30456;&#27604;&#65292;&#36825;&#20123;&#39118;&#38505;&#24230;&#37327;&#26041;&#27861;&#38024;&#23545;&#32593;&#32476;&#30340;&#25299;&#25169;&#37197;&#32622;&#65292;&#20197;&#20943;&#36731;&#20256;&#25773;&#23041;&#32961;&#30340;&#39118;&#38505;&#12290;&#34429;&#28982;&#25105;&#20204;&#30340;&#35752;&#35770;&#20027;&#35201;&#22260;&#32469;&#25968;&#23383;&#32593;&#32476;&#20013;&#31995;&#32479;&#24615;&#32593;&#32476;&#39118;&#38505;&#30340;&#31649;&#29702;&#65292;&#20294;&#25105;&#20204;&#21516;&#26102;&#23558;&#31867;&#27604;&#26041;&#27861;&#24212;&#29992;&#20110;&#20854;&#20182;&#22797;&#26434;&#31995;&#32479;&#30340;&#39118;&#38505;&#31649;&#29702;&#65292;&#20197;&#30830;&#23450;&#26159;&#21542;&#36866;&#24403;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a novel class of risk measures designed for the management of systemic risk in networks. In contrast to prevailing approaches, these risk measures target the topological configuration of the network in order to mitigate the propagation risk of contagious threats. While our discussion primarily revolves around the management of systemic cyber risks in digital networks, we concurrently draw parallels to risk management of other complex systems where analogous approaches may be adequate.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#30456;&#20851;&#24615;&#30340;&#20998;&#26512;&#24066;&#22330;&#65292;&#36890;&#36807;&#37319;&#29992;Shapley&#20540;&#30340;&#24402;&#22240;&#31574;&#30053;&#26469;&#20998;&#37197;&#25910;&#20837;&#65292;&#20419;&#36827;&#20102;&#25968;&#25454;&#20849;&#20139;&#20197;&#25552;&#39640;&#33021;&#28304;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.06000</link><description>&lt;p&gt;
&#40723;&#21169;&#25968;&#25454;&#20849;&#20139;&#20197;&#36827;&#34892;&#33021;&#28304;&#39044;&#27979;&#65306;&#20855;&#26377;&#30456;&#20851;&#25968;&#25454;&#30340;&#20998;&#26512;&#24066;&#22330;
&lt;/p&gt;
&lt;p&gt;
Incentivizing Data Sharing for Energy Forecasting: Analytics Markets with Correlated Data. (arXiv:2310.06000v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.06000
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#30456;&#20851;&#24615;&#30340;&#20998;&#26512;&#24066;&#22330;&#65292;&#36890;&#36807;&#37319;&#29992;Shapley&#20540;&#30340;&#24402;&#22240;&#31574;&#30053;&#26469;&#20998;&#37197;&#25910;&#20837;&#65292;&#20419;&#36827;&#20102;&#25968;&#25454;&#20849;&#20139;&#20197;&#25552;&#39640;&#33021;&#28304;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20934;&#30830;&#22320;&#39044;&#27979;&#19981;&#30830;&#23450;&#30340;&#30005;&#21147;&#20135;&#37327;&#23545;&#20110;&#30005;&#21147;&#24066;&#22330;&#30340;&#31038;&#20250;&#31119;&#21033;&#20855;&#26377;&#30410;&#22788;&#65292;&#21487;&#20197;&#20943;&#23569;&#24179;&#34913;&#36164;&#28304;&#30340;&#38656;&#27714;&#12290;&#23558;&#36825;&#31181;&#39044;&#27979;&#25551;&#36848;&#20026;&#19968;&#39033;&#20998;&#26512;&#20219;&#21153;&#65292;&#24403;&#21069;&#25991;&#29486;&#25552;&#20986;&#20102;&#20197;&#20998;&#26512;&#24066;&#22330;&#20316;&#20026;&#28608;&#21169;&#25163;&#27573;&#26469;&#25913;&#21892;&#31934;&#24230;&#30340;&#25968;&#25454;&#20849;&#20139;&#26041;&#27861;&#65292;&#20363;&#22914;&#21033;&#29992;&#26102;&#31354;&#30456;&#20851;&#24615;&#12290;&#25361;&#25112;&#22312;&#20110;&#65292;&#24403;&#30456;&#20851;&#25968;&#25454;&#29992;&#20316;&#39044;&#27979;&#30340;&#36755;&#20837;&#29305;&#24449;&#26102;&#65292;&#37325;&#21472;&#20449;&#24687;&#30340;&#20215;&#20540;&#22312;&#20110;&#25910;&#20837;&#20998;&#37197;&#26041;&#38754;&#20351;&#24066;&#22330;&#35774;&#35745;&#22797;&#26434;&#21270;&#65292;&#22240;&#20026;&#36825;&#31181;&#20215;&#20540;&#22312;&#26412;&#36136;&#19978;&#26159;&#32452;&#21512;&#30340;&#12290;&#25105;&#20204;&#20026;&#39118;&#21147;&#39044;&#27979;&#24212;&#29992;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#30456;&#20851;&#24615;&#30340;&#20998;&#26512;&#24066;&#22330;&#12290;&#20026;&#20102;&#20998;&#37197;&#25910;&#20837;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#22522;&#20110;Shapley&#20540;&#30340;&#24402;&#22240;&#31574;&#30053;&#65292;&#23558;&#20195;&#29702;&#20154;&#30340;&#29305;&#24449;&#35270;&#20026;&#29609;&#23478;&#65292;&#23558;&#20182;&#20204;&#30340;&#30456;&#20114;&#20316;&#29992;&#35270;&#20026;&#19968;&#20010;&#29305;&#24449;&#20989;&#25968;&#21338;&#24328;&#12290;&#25105;&#20204;&#35828;&#26126;&#20102;&#25551;&#36848;&#36825;&#31181;&#21338;&#24328;&#30340;&#22810;&#31181;&#36873;&#39033;&#65292;&#27599;&#20010;&#36873;&#39033;&#37117;&#26377;&#22240;&#26524;&#32454;&#24494;&#24046;&#21035;&#65292;&#24433;&#21709;&#30528;&#29305;&#24449;&#30456;&#20851;&#26102;&#30340;&#24066;&#22330;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;
Reliably forecasting uncertain power production is beneficial for the social welfare of electricity markets by reducing the need for balancing resources. Describing such forecasting as an analytics task, the current literature proposes analytics markets as an incentive for data sharing to improve accuracy, for instance by leveraging spatio-temporal correlations. The challenge is that, when used as input features for forecasting, correlated data complicates the market design with respect to the revenue allocation, as the value of overlapping information is inherently combinatorial. We develop a correlation-aware analytics market for a wind power forecasting application. To allocate revenue, we adopt a Shapley value-based attribution policy, framing the features of agents as players and their interactions as a characteristic function game. We illustrate that there are multiple options to describe such a game, each having causal nuances that influence market behavior when features are cor
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#37327;&#21270;&#21160;&#24577;&#29615;&#22659;&#20013;&#19981;&#30830;&#23450;&#24615;&#20256;&#25773;&#30340;&#26694;&#26550;&#12290;&#23427;&#23450;&#20041;&#20102;&#19987;&#38376;&#38024;&#23545;&#26377;&#38480;&#26102;&#38388;&#27573;&#20869;&#30340;&#31163;&#25955;&#38543;&#26426;&#36807;&#31243;&#32780;&#35774;&#35745;&#30340;&#21160;&#24577;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#65292;&#20197;&#25429;&#25417;&#22260;&#32469;&#38543;&#26426;&#36807;&#31243;&#21644;&#27169;&#22411;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#35770;&#25991;&#36824;&#25506;&#35752;&#20102;&#23548;&#33268;&#21160;&#24577;&#31283;&#20581;&#39118;&#38505;&#24230;&#37327;&#30340;&#19968;&#20123;&#24050;&#30693;&#24615;&#36136;&#30340;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#30340;&#26465;&#20214;&#65292;&#24182;&#21457;&#29616;&#30001;$f$-divergences&#24341;&#36215;&#30340;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#23548;&#33268;&#36739;&#24378;&#30340;&#26102;&#38388;&#19968;&#33268;&#24615;&#12290;</title><link>http://arxiv.org/abs/2308.12856</link><description>&lt;p&gt;
&#19981;&#30830;&#23450;&#24615;&#20256;&#25773;&#21644;&#21160;&#24577;&#31283;&#20581;&#39118;&#38505;&#24230;&#37327;
&lt;/p&gt;
&lt;p&gt;
Uncertainty Propagation and Dynamic Robust Risk Measures. (arXiv:2308.12856v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.12856
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#37327;&#21270;&#21160;&#24577;&#29615;&#22659;&#20013;&#19981;&#30830;&#23450;&#24615;&#20256;&#25773;&#30340;&#26694;&#26550;&#12290;&#23427;&#23450;&#20041;&#20102;&#19987;&#38376;&#38024;&#23545;&#26377;&#38480;&#26102;&#38388;&#27573;&#20869;&#30340;&#31163;&#25955;&#38543;&#26426;&#36807;&#31243;&#32780;&#35774;&#35745;&#30340;&#21160;&#24577;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#65292;&#20197;&#25429;&#25417;&#22260;&#32469;&#38543;&#26426;&#36807;&#31243;&#21644;&#27169;&#22411;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#35770;&#25991;&#36824;&#25506;&#35752;&#20102;&#23548;&#33268;&#21160;&#24577;&#31283;&#20581;&#39118;&#38505;&#24230;&#37327;&#30340;&#19968;&#20123;&#24050;&#30693;&#24615;&#36136;&#30340;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#30340;&#26465;&#20214;&#65292;&#24182;&#21457;&#29616;&#30001;$f$-divergences&#24341;&#36215;&#30340;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#23548;&#33268;&#36739;&#24378;&#30340;&#26102;&#38388;&#19968;&#33268;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#29992;&#20110;&#37327;&#21270;&#21160;&#24577;&#29615;&#22659;&#20013;&#19981;&#30830;&#23450;&#24615;&#20256;&#25773;&#30340;&#26694;&#26550;&#12290;&#20855;&#20307;&#22320;&#65292;&#25105;&#20204;&#23450;&#20041;&#20102;&#19987;&#38376;&#38024;&#23545;&#26377;&#38480;&#26102;&#38388;&#27573;&#20869;&#30340;&#31163;&#25955;&#38543;&#26426;&#36807;&#31243;&#32780;&#35774;&#35745;&#30340;&#21160;&#24577;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#12290;&#36825;&#20123;&#21160;&#24577;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#25429;&#25417;&#20102;&#22260;&#32469;&#38543;&#26426;&#36807;&#31243;&#21644;&#27169;&#22411;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#21253;&#25324;&#20998;&#24067;&#27169;&#31946;&#31561;&#22240;&#32032;&#12290;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#30340;&#20363;&#23376;&#21253;&#25324;&#30001;Wasserstein&#36317;&#31163;&#21644;$f$-divergences&#24341;&#36215;&#30340;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#23558;&#21160;&#24577;&#31283;&#20581;&#39118;&#38505;&#24230;&#37327;&#23450;&#20041;&#20026;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#20869;&#25152;&#26377;&#20505;&#36873;&#39118;&#38505;&#30340;&#19978;&#30830;&#30028;&#12290;&#25105;&#20204;&#20197;&#20844;&#29702;&#21270;&#30340;&#26041;&#24335;&#35752;&#35770;&#20102;&#23548;&#33268;&#21160;&#24577;&#31283;&#20581;&#39118;&#38505;&#24230;&#37327;&#30340;&#19968;&#20123;&#24050;&#30693;&#24615;&#36136;&#65288;&#22914;&#20984;&#24615;&#21644;&#19968;&#33268;&#24615;&#65289;&#30340;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#30340;&#26465;&#20214;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#35752;&#35770;&#20102;&#23548;&#33268;&#31283;&#20581;&#21160;&#24577;&#39118;&#38505;&#24230;&#37327;&#26102;&#38388;&#19968;&#33268;&#24615;&#30340;&#21160;&#24577;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#29305;&#24615;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#30001;$f$-divergences&#24341;&#36215;&#30340;&#19981;&#30830;&#23450;&#24615;&#38598;&#21512;&#23548;&#33268;&#36739;&#24378;&#30340;&#26102;&#38388;&#19968;&#33268;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a framework for quantifying propagation of uncertainty arising in a dynamic setting. Specifically, we define dynamic uncertainty sets designed explicitly for discrete stochastic processes over a finite time horizon. These dynamic uncertainty sets capture the uncertainty surrounding stochastic processes and models, accounting for factors such as distributional ambiguity. Examples of uncertainty sets include those induced by the Wasserstein distance and $f$-divergences.  We further define dynamic robust risk measures as the supremum of all candidates' risks within the uncertainty set. In an axiomatic way, we discuss conditions on the uncertainty sets that lead to well-known properties of dynamic robust risk measures, such as convexity and coherence. Furthermore, we discuss the necessary and sufficient properties of dynamic uncertainty sets that lead to time-consistencies of robust dynamic risk measures. We find that uncertainty sets stemming from $f$-divergences lead to stro
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#31163;&#26679;&#26412;&#22806;&#25928;&#29992;&#20989;&#25968;&#30340;&#35270;&#35282;&#65292;&#26412;&#25991;&#20998;&#26512;&#29305;&#24449;&#30340;&#32852;&#21512;&#39044;&#27979;&#20449;&#24687;&#12290;&#22312;&#21160;&#37327;&#12289;&#22823;&#23567;&#21644;&#27531;&#24046;&#27874;&#21160;&#29575;&#30340;&#26465;&#20214;&#19979;&#65292;&#24418;&#25104;&#30340;&#25237;&#36164;&#32452;&#21512;&#23545;&#25152;&#26377;&#25237;&#36164;&#32773;&#26469;&#35828;&#37117;&#20855;&#26377;&#26174;&#33879;&#26356;&#39640;&#30340;&#30830;&#23450;&#31561;&#20215;&#20540;&#12290;&#29305;&#24449;&#30340;&#20114;&#34917;&#20316;&#29992;&#24102;&#26469;&#20102;&#36825;&#20123;&#22909;&#22788;&#65292;&#20363;&#22914;&#21160;&#37327;&#20943;&#36731;&#20102;&#20854;&#20182;&#29305;&#24449;&#22266;&#26377;&#30340;&#36807;&#24230;&#25311;&#21512;&#12290;&#26368;&#20248;&#32452;&#21512;&#30340;&#22238;&#25253;&#36229;&#20986;&#20102;&#20256;&#32479;&#22240;&#23376;&#30340;&#33539;&#22260;&#12290;</title><link>http://arxiv.org/abs/2104.12975</link><description>&lt;p&gt;
&#19968;&#20010;&#23545;&#29305;&#24449;&#21644;&#26368;&#20248;&#32452;&#21512;&#30340;&#23454;&#35777;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
An Empirical Assessment of Characteristics and Optimal Portfolios. (arXiv:2104.12975v3 [q-fin.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2104.12975
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#31163;&#26679;&#26412;&#22806;&#25928;&#29992;&#20989;&#25968;&#30340;&#35270;&#35282;&#65292;&#26412;&#25991;&#20998;&#26512;&#29305;&#24449;&#30340;&#32852;&#21512;&#39044;&#27979;&#20449;&#24687;&#12290;&#22312;&#21160;&#37327;&#12289;&#22823;&#23567;&#21644;&#27531;&#24046;&#27874;&#21160;&#29575;&#30340;&#26465;&#20214;&#19979;&#65292;&#24418;&#25104;&#30340;&#25237;&#36164;&#32452;&#21512;&#23545;&#25152;&#26377;&#25237;&#36164;&#32773;&#26469;&#35828;&#37117;&#20855;&#26377;&#26174;&#33879;&#26356;&#39640;&#30340;&#30830;&#23450;&#31561;&#20215;&#20540;&#12290;&#29305;&#24449;&#30340;&#20114;&#34917;&#20316;&#29992;&#24102;&#26469;&#20102;&#36825;&#20123;&#22909;&#22788;&#65292;&#20363;&#22914;&#21160;&#37327;&#20943;&#36731;&#20102;&#20854;&#20182;&#29305;&#24449;&#22266;&#26377;&#30340;&#36807;&#24230;&#25311;&#21512;&#12290;&#26368;&#20248;&#32452;&#21512;&#30340;&#22238;&#25253;&#36229;&#20986;&#20102;&#20256;&#32479;&#22240;&#23376;&#30340;&#33539;&#22260;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#31163;&#26679;&#26412;&#22806;&#25928;&#29992;&#20989;&#25968;&#30340;&#35270;&#35282;&#20998;&#26512;&#29305;&#24449;&#30340;&#32852;&#21512;&#39044;&#27979;&#20449;&#24687;&#12290;&#25105;&#20204;&#36890;&#36807;&#26368;&#22823;&#21270;&#26679;&#26412;&#20869;&#25439;&#22833;&#20989;&#25968;&#26469;&#20943;&#36731;&#29305;&#24449;&#26435;&#37325;&#20272;&#35745;&#35823;&#24046;&#65292;&#35813;&#25439;&#22833;&#20989;&#25968;&#27604;&#25928;&#29992;&#20989;&#25968;&#26356;&#20985;&#12290;&#23613;&#31649;&#27809;&#26377;&#21333;&#19968;&#29305;&#24449;&#21487;&#20197;&#25552;&#39640;&#25152;&#26377;&#25237;&#36164;&#32773;&#30340;&#25928;&#29992;&#65292;&#20294;&#22312;&#21160;&#21147;&#12289;&#22823;&#23567;&#21644;&#27531;&#24046;&#27874;&#21160;&#29575;&#30340;&#26465;&#20214;&#19979;&#65292;&#24418;&#25104;&#30340;&#25237;&#36164;&#32452;&#21512;&#30340;&#30830;&#23450;&#31561;&#20215;&#20540;&#26174;&#33879;&#39640;&#20110;&#22522;&#20934;&#20540;&#12290;&#29305;&#24449;&#30340;&#20114;&#34917;&#20316;&#29992;&#24102;&#26469;&#20102;&#36825;&#20123;&#22909;&#22788;&#65292;&#20363;&#22914;&#21160;&#21147;&#20943;&#36731;&#20102;&#20854;&#20182;&#29305;&#24449;&#22266;&#26377;&#30340;&#36807;&#24230;&#25311;&#21512;&#12290;&#26368;&#20248;&#32452;&#21512;&#30340;&#22238;&#25253;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#36229;&#20986;&#20102;&#20256;&#32479;&#22240;&#23376;&#30340;&#33539;&#22260;&#12290;
&lt;/p&gt;
&lt;p&gt;
We analyze characteristics' joint predictive information through the lens of out-of-sample power utility functions. Linking weights to characteristics to form optimal portfolios suffers from estimation error which we mitigate by maximizing an in-sample loss function that is more concave than the utility function. While no single characteristic can be used to enhance utility by all investors, conditioning on momentum, size, and residual volatility produces portfolios with significantly higher certainty equivalents than benchmarks for all investors. Characteristic complementarities produce the benefits, for example momentum mitigates overfitting inherent in other characteristics. Optimal portfolios' returns lie largely outside the span of traditional factors.
&lt;/p&gt;</description></item></channel></rss>