<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#30899;&#30340;&#31038;&#20250;&#25104;&#26412;&#26159;&#36890;&#36807;&#20943;&#23569;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#32780;&#36991;&#20813;&#30340;&#25439;&#23475;&#30340;&#24230;&#37327;&#65292;&#20272;&#35745;&#32422;&#20026;80&#32654;&#20803;/&#21544;&#20108;&#27687;&#21270;&#30899;&#12290;</title><link>http://arxiv.org/abs/2310.12760</link><description>&lt;p&gt;
&#30899;&#30340;&#31038;&#20250;&#25104;&#26412;
&lt;/p&gt;
&lt;p&gt;
The Social Cost of Carbon. (arXiv:2310.12760v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.12760
&lt;/p&gt;
&lt;p&gt;
&#30899;&#30340;&#31038;&#20250;&#25104;&#26412;&#26159;&#36890;&#36807;&#20943;&#23569;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#32780;&#36991;&#20813;&#30340;&#25439;&#23475;&#30340;&#24230;&#37327;&#65292;&#20272;&#35745;&#32422;&#20026;80&#32654;&#20803;/&#21544;&#20108;&#27687;&#21270;&#30899;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30899;&#30340;&#31038;&#20250;&#25104;&#26412;&#26159;&#36890;&#36807;&#31245;&#24494;&#20943;&#23569;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#32780;&#36991;&#20813;&#30340;&#25439;&#23475;&#12290;&#23427;&#26159;&#34913;&#37327;&#27668;&#20505;&#25919;&#31574;&#26399;&#26395;&#24378;&#24230;&#30340;&#19968;&#20010;&#25351;&#26631;&#12290;&#30899;&#30340;&#31038;&#20250;&#25104;&#26412;&#22240;&#20026;&#38271;&#26399;&#21644;&#22797;&#26434;&#30340;&#22240;&#26524;&#38142;&#20197;&#21450;&#23545;&#24433;&#21709;&#36827;&#34892;&#37327;&#21270;&#21644;&#32858;&#21512;&#32780;&#39640;&#24230;&#19981;&#30830;&#23450;&#65292;&#24433;&#21709;&#30528;&#21487;&#33021;&#30340;&#26410;&#26469;&#33539;&#22260;&#20869;&#30340;&#25152;&#26377;&#20154;&#12290;&#26368;&#36817;&#30340;&#20272;&#35745;&#32422;&#20026;80&#32654;&#20803;/&#21544;&#20108;&#27687;&#21270;&#30899;&#12290;
&lt;/p&gt;
&lt;p&gt;
The social cost of carbon is the damage avoided by slightly reducing carbon dioxide emissions. It is a measure of the desired intensity of climate policy. The social cost of carbon is highly uncertain because of the long and complex cause-effect chain, and because it quantifies and aggregates impacts over a long period of time, affecting all people in a wide range of possible futures. Recent estimates are around $\$$80/tCO$_2$.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#28145;&#24230;&#23398;&#20064;&#32467;&#26500;&#30340;&#31070;&#32463;&#32593;&#32476;&#23545;&#39057;&#29575;-&#20005;&#37325;&#24615;&#20445;&#38505;&#23450;&#20215;&#36827;&#34892;&#20102;&#22522;&#20934;&#30740;&#31350;&#65292;&#27604;&#36739;&#20102;&#19981;&#21516;&#27169;&#22411;&#30340;&#24615;&#33021;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#32852;&#21512;&#31934;&#31639;&#31070;&#32463;&#32593;&#32476;(CANN)&#30340;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2310.12671</link><description>&lt;p&gt;
&#21033;&#29992;&#39057;&#29575;&#21644;&#20005;&#37325;&#24615;&#25968;&#25454;&#36827;&#34892;&#20445;&#38505;&#23450;&#20215;&#30340;&#31070;&#32463;&#32593;&#32476;&#65306;&#20174;&#25968;&#25454;&#39044;&#22788;&#29702;&#21040;&#25216;&#26415;&#23450;&#20215;&#30340;&#22522;&#20934;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Neural networks for insurance pricing with frequency and severity data: a benchmark study from data preprocessing to technical tariff. (arXiv:2310.12671v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.12671
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#28145;&#24230;&#23398;&#20064;&#32467;&#26500;&#30340;&#31070;&#32463;&#32593;&#32476;&#23545;&#39057;&#29575;-&#20005;&#37325;&#24615;&#20445;&#38505;&#23450;&#20215;&#36827;&#34892;&#20102;&#22522;&#20934;&#30740;&#31350;&#65292;&#27604;&#36739;&#20102;&#19981;&#21516;&#27169;&#22411;&#30340;&#24615;&#33021;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#32852;&#21512;&#31934;&#31639;&#31070;&#32463;&#32593;&#32476;(CANN)&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20445;&#38505;&#20844;&#21496;&#36890;&#24120;&#20351;&#29992;&#24191;&#20041;&#32447;&#24615;&#27169;&#22411;&#26469;&#24314;&#27169;&#32034;&#36180;&#30340;&#39057;&#29575;&#21644;&#20005;&#37325;&#24615;&#25968;&#25454;&#12290;&#30001;&#20110;&#20854;&#22312;&#20854;&#20182;&#39046;&#22495;&#30340;&#25104;&#21151;&#65292;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#22312;&#31934;&#31639;&#24037;&#20855;&#31665;&#20013;&#36234;&#26469;&#36234;&#21463;&#27426;&#36814;&#12290;&#26412;&#25991;&#36890;&#36807;&#28145;&#24230;&#23398;&#20064;&#32467;&#26500;&#20026;&#39057;&#29575;-&#20005;&#37325;&#24615;&#20445;&#38505;&#23450;&#20215;&#19982;&#26426;&#22120;&#23398;&#20064;&#30456;&#20851;&#30340;&#25991;&#29486;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;&#25105;&#20204;&#22312;&#22235;&#20010;&#20445;&#38505;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#22522;&#20934;&#30740;&#31350;&#65292;&#36825;&#20123;&#25968;&#25454;&#38598;&#21253;&#21547;&#26377;&#22810;&#31181;&#31867;&#22411;&#30340;&#36755;&#20837;&#29305;&#24449;&#21644;&#39057;&#29575;-&#20005;&#37325;&#24615;&#30446;&#26631;&#12290;&#25105;&#20204;&#35814;&#32454;&#27604;&#36739;&#20102;&#24191;&#20041;&#32447;&#24615;&#27169;&#22411;&#22312;&#20998;&#31665;&#36755;&#20837;&#25968;&#25454;&#12289;&#26799;&#24230;&#25552;&#21319;&#26641;&#27169;&#22411;&#12289;&#21069;&#39304;&#31070;&#32463;&#32593;&#32476;&#65288;FFNN&#65289;&#21644;&#32852;&#21512;&#31934;&#31639;&#31070;&#32463;&#32593;&#32476;&#65288;CANN&#65289;&#19978;&#30340;&#24615;&#33021;&#12290;&#25105;&#20204;&#30340;CANN&#23558;&#36890;&#36807;GLM&#21644;GBM&#20998;&#21035;&#24314;&#31435;&#30340;&#22522;&#32447;&#39044;&#27979;&#19982;&#31070;&#32463;&#32593;&#32476;&#26657;&#27491;&#30456;&#32467;&#21512;&#12290;&#25105;&#20204;&#35299;&#37322;&#20102;&#25968;&#25454;&#39044;&#22788;&#29702;&#27493;&#39588;&#65292;&#29305;&#21035;&#20851;&#27880;&#36890;&#24120;&#23384;&#22312;&#20110;&#34920;&#26684;&#20445;&#38505;&#25968;&#25454;&#38598;&#20013;&#30340;&#22810;&#31181;&#31867;&#22411;&#30340;&#36755;&#20837;&#29305;&#24449;&#65292;&#27604;&#22914;&#37038;&#32534;&#21644;&#25968;&#23383;&#32534;&#30721;&#12290;
&lt;/p&gt;
&lt;p&gt;
Insurers usually turn to generalized linear models for modelling claim frequency and severity data. Due to their success in other fields, machine learning techniques are gaining popularity within the actuarial toolbox. Our paper contributes to the literature on frequency-severity insurance pricing with machine learning via deep learning structures. We present a benchmark study on four insurance data sets with frequency and severity targets in the presence of multiple types of input features. We compare in detail the performance of: a generalized linear model on binned input data, a gradient-boosted tree model, a feed-forward neural network (FFNN), and the combined actuarial neural network (CANN). Our CANNs combine a baseline prediction established with a GLM and GBM, respectively, with a neural network correction. We explain the data preprocessing steps with specific focus on the multiple types of input features typically present in tabular insurance data sets, such as postal codes, nu
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#33258;&#27880;&#24847;&#21147;GRU&#21644;Shapley&#20540;&#35299;&#37322;&#30340;&#32654;&#24335;&#26399;&#26435;&#23450;&#20215;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#20998;&#21106;&#25968;&#25454;&#38598;&#21644;&#24314;&#31435;&#19981;&#21516;&#30340;&#27169;&#22411;&#65292;&#21487;&#20197;&#26356;&#20934;&#30830;&#22320;&#39044;&#27979;&#26399;&#26435;&#30340;&#20215;&#26684;&#12290;</title><link>http://arxiv.org/abs/2310.12500</link><description>&lt;p&gt;
&#20351;&#29992;&#33258;&#27880;&#24847;&#21147;GRU&#21644;Shapley&#20540;&#35299;&#37322;&#30340;&#32654;&#24335;&#26399;&#26435;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
American Option Pricing using Self-Attention GRU and Shapley Value Interpretation. (arXiv:2310.12500v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.12500
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#33258;&#27880;&#24847;&#21147;GRU&#21644;Shapley&#20540;&#35299;&#37322;&#30340;&#32654;&#24335;&#26399;&#26435;&#23450;&#20215;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#20998;&#21106;&#25968;&#25454;&#38598;&#21644;&#24314;&#31435;&#19981;&#21516;&#30340;&#27169;&#22411;&#65292;&#21487;&#20197;&#26356;&#20934;&#30830;&#22320;&#39044;&#27979;&#26399;&#26435;&#30340;&#20215;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26399;&#26435;&#20316;&#20026;&#19968;&#31181;&#20851;&#38190;&#30340;&#37329;&#34701;&#24037;&#20855;&#65292;&#22312;&#35777;&#21048;&#24066;&#22330;&#20013;&#34987;&#25237;&#36164;&#32773;&#29992;&#26469;&#31649;&#29702;&#21644;&#20943;&#36731;&#25237;&#36164;&#39118;&#38505;&#12290;&#31934;&#30830;&#39044;&#27979;&#26399;&#26435;&#30340;&#29616;&#20215;&#20351;&#25237;&#36164;&#32773;&#33021;&#22815;&#20570;&#20986;&#26126;&#26234;&#21644;&#39640;&#25928;&#30340;&#20915;&#31574;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#38376;&#25511;&#24490;&#29615;&#21333;&#20803;&#65288;GRU&#65289;&#21644;&#33258;&#27880;&#24847;&#26426;&#21046;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#39044;&#27979;SPY&#65288;ETF&#65289;&#26399;&#26435;&#30340;&#20215;&#26684;&#12290;&#25105;&#20204;&#39318;&#20808;&#26681;&#25454;&#36135;&#24065;&#20215;&#20540;&#21644;&#21040;&#26399;&#26085;&#30340;&#26631;&#20934;&#23558;&#21407;&#22987;&#25968;&#25454;&#38598;&#20998;&#25104;15&#20010;&#23376;&#38598;&#12290;&#23545;&#20110;&#27599;&#20010;&#23376;&#38598;&#65292;&#25105;&#20204;&#21305;&#37197;&#30456;&#24212;&#30340;&#32654;&#22269;&#25919;&#24220;&#20538;&#21048;&#21033;&#29575;&#21644;&#38544;&#21547;&#27874;&#21160;&#29575;&#25351;&#25968;&#12290;&#36825;&#31181;&#20998;&#21106;&#26041;&#24335;&#21487;&#20197;&#26356;&#28145;&#20837;&#22320;&#25506;&#32034;&#26080;&#39118;&#38505;&#21033;&#29575;&#21644;&#22522;&#30784;&#27874;&#21160;&#29575;&#23545;&#26399;&#26435;&#23450;&#20215;&#30340;&#24433;&#21709;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#26500;&#24314;&#20102;&#22235;&#20010;&#19981;&#21516;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#21253;&#25324;&#22810;&#23618;&#24863;&#30693;&#26426;&#65288;MLP&#65289;&#12289;&#38271;&#30701;&#26399;&#35760;&#24518;&#65288;LSTM&#65289;&#12289;&#33258;&#27880;&#24847;LSTM&#21644;&#33258;&#27880;&#24847;GRU&#65292;&#19982;&#20256;&#32479;&#30340;&#20108;&#39033;&#27169;&#22411;&#36827;&#34892;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
Options, serving as a crucial financial instrument, are used by investors to manage and mitigate their investment risks within the securities market. Precisely predicting the present price of an option enables investors to make informed and efficient decisions. In this paper, we propose a machine learning method for forecasting the prices of SPY (ETF) option based on gated recurrent unit (GRU) and self-attention mechanism. We first partitioned the raw dataset into 15 subsets according to moneyness and days to maturity criteria. For each subset, we matched the corresponding U.S. government bond rates and Implied Volatility Indices. This segmentation allows for a more insightful exploration of the impacts of risk-free rates and underlying volatility on option pricing. Next, we built four different machine learning models, including multilayer perceptron (MLP), long short-term memory (LSTM), self-attention LSTM, and self-attention GRU in comparison to the traditional binomial model. The e
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#38543;&#26426;&#26862;&#26519;&#27169;&#22411;&#30340;&#29305;&#24449;&#31354;&#38388;&#20013;&#30340;&#37051;&#36817;&#24615;&#26469;&#35299;&#37322;&#27169;&#22411;&#39044;&#27979;&#30340;&#26041;&#27861;&#65292;&#20026;&#27169;&#22411;&#39044;&#27979;&#25552;&#20379;&#20102;&#23616;&#37096;&#30340;&#35299;&#37322;&#24615;&#65292;&#19982;&#29616;&#26377;&#26041;&#27861;&#30456;&#36741;&#30456;&#25104;&#12290;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#20102;&#36825;&#31181;&#26041;&#27861;&#22312;&#20538;&#21048;&#23450;&#20215;&#27169;&#22411;&#20013;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.12428</link><description>&lt;p&gt;
&#23454;&#29616;&#38543;&#26426;&#26862;&#26519;&#30340;&#23616;&#37096;&#21487;&#35299;&#37322;&#24615;&#22686;&#24378;&#65306;&#22522;&#20110;&#37051;&#36817;&#24615;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Towards Enhanced Local Explainability of Random Forests: a Proximity-Based Approach. (arXiv:2310.12428v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.12428
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#38543;&#26426;&#26862;&#26519;&#27169;&#22411;&#30340;&#29305;&#24449;&#31354;&#38388;&#20013;&#30340;&#37051;&#36817;&#24615;&#26469;&#35299;&#37322;&#27169;&#22411;&#39044;&#27979;&#30340;&#26041;&#27861;&#65292;&#20026;&#27169;&#22411;&#39044;&#27979;&#25552;&#20379;&#20102;&#23616;&#37096;&#30340;&#35299;&#37322;&#24615;&#65292;&#19982;&#29616;&#26377;&#26041;&#27861;&#30456;&#36741;&#30456;&#25104;&#12290;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#20102;&#36825;&#31181;&#26041;&#27861;&#22312;&#20538;&#21048;&#23450;&#20215;&#27169;&#22411;&#20013;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#35299;&#37322;&#38543;&#26426;&#26862;&#26519;&#65288;RF&#65289;&#27169;&#22411;&#30340;&#26679;&#26412;&#22806;&#24615;&#33021;&#65292;&#21033;&#29992;&#20102;&#20219;&#20309;RF&#37117;&#21487;&#20197;&#34987;&#34920;&#36848;&#20026;&#33258;&#36866;&#24212;&#21152;&#26435;K&#26368;&#36817;&#37051;&#65288;KNN&#65289;&#27169;&#22411;&#30340;&#20107;&#23454;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#21033;&#29992;RF&#22312;&#29305;&#24449;&#31354;&#38388;&#20013;&#23398;&#21040;&#30340;&#28857;&#20043;&#38388;&#30340;&#37051;&#36817;&#24615;&#65292;&#23558;&#38543;&#26426;&#26862;&#26519;&#30340;&#39044;&#27979;&#37325;&#20889;&#20026;&#35757;&#32451;&#25968;&#25454;&#28857;&#30446;&#26631;&#26631;&#31614;&#30340;&#21152;&#26435;&#24179;&#22343;&#20540;&#12290;&#36825;&#31181;&#32447;&#24615;&#24615;&#36136;&#26377;&#21161;&#20110;&#22312;&#35757;&#32451;&#38598;&#35266;&#27979;&#20013;&#20026;&#20219;&#20309;&#27169;&#22411;&#39044;&#27979;&#29983;&#25104;&#23646;&#24615;&#65292;&#20174;&#32780;&#20026;RF&#39044;&#27979;&#25552;&#20379;&#20102;&#23616;&#37096;&#30340;&#35299;&#37322;&#24615;&#65292;&#34917;&#20805;&#20102;SHAP&#31561;&#24050;&#26377;&#26041;&#27861;&#65292;&#36825;&#20123;&#26041;&#27861;&#21017;&#20026;&#29305;&#24449;&#31354;&#38388;&#32500;&#24230;&#19978;&#30340;&#27169;&#22411;&#39044;&#27979;&#29983;&#25104;&#23646;&#24615;&#12290;&#25105;&#20204;&#22312;&#35757;&#32451;&#20110;&#32654;&#22269;&#20844;&#21496;&#20538;&#21048;&#20132;&#26131;&#25968;&#25454;&#30340;&#20538;&#21048;&#23450;&#20215;&#27169;&#22411;&#20013;&#28436;&#31034;&#20102;&#36825;&#31181;&#26041;&#27861;&#65292;&#24182;&#23558;&#20854;&#19982;&#21508;&#31181;&#29616;&#26377;&#30340;&#27169;&#22411;&#35299;&#37322;&#26041;&#27861;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
We initiate a novel approach to explain the out of sample performance of random forest (RF) models by exploiting the fact that any RF can be formulated as an adaptive weighted K nearest-neighbors model. Specifically, we use the proximity between points in the feature space learned by the RF to re-write random forest predictions exactly as a weighted average of the target labels of training data points. This linearity facilitates a local notion of explainability of RF predictions that generates attributions for any model prediction across observations in the training set, and thereby complements established methods like SHAP, which instead generates attributions for a model prediction across dimensions of the feature space. We demonstrate this approach in the context of a bond pricing model trained on US corporate bond trades, and compare our approach to various existing approaches to model explainability.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21516;&#36136;&#21270;&#20135;&#21697;&#22312;&#19981;&#21516;&#22312;&#32447;&#24179;&#21488;&#19978;&#30340;&#26222;&#36941;&#20215;&#26684;&#20998;&#25955;&#29616;&#35937;&#65292;&#21457;&#29616;&#20215;&#26684;&#22312;&#19981;&#21516;&#39044;&#35746;&#32593;&#31449;&#20043;&#38388;&#23384;&#22312;&#36739;&#22823;&#24046;&#24322;&#65292;&#19988;&#20215;&#26684;&#20998;&#25955;&#22312;&#39044;&#35746;&#26085;&#26399;&#38752;&#36817;&#20837;&#20303;&#26085;&#26399;&#26102;&#20173;&#28982;&#23384;&#22312;&#12290;&#36890;&#36807;&#26500;&#24314;&#29702;&#35770;&#27169;&#22411;&#65292;&#25105;&#20204;&#35299;&#37322;&#20102;&#20215;&#26684;&#20998;&#25955;&#29616;&#35937;&#30340;&#21407;&#22240;&#65292;&#24182;&#25351;&#20986;&#22312;&#23384;&#22312;&#24635;&#38656;&#27714;&#19981;&#30830;&#23450;&#24615;&#21644;&#23481;&#37327;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#65292;&#20215;&#26684;&#20998;&#25955;&#20173;&#28982;&#21487;&#33021;&#23384;&#22312;&#12290;</title><link>http://arxiv.org/abs/2310.12341</link><description>&lt;p&gt;
&#22312;&#32447;&#24179;&#21488;&#19978;&#30340;&#20215;&#26684;&#20998;&#25955;&#65306;&#26469;&#33258;&#20262;&#25958;&#65288;&#33521;&#22269;&#65289;&#37202;&#24215;&#25151;&#20215;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Price dispersion across online platforms: Evidence from hotel room prices in London (UK). (arXiv:2310.12341v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.12341
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21516;&#36136;&#21270;&#20135;&#21697;&#22312;&#19981;&#21516;&#22312;&#32447;&#24179;&#21488;&#19978;&#30340;&#26222;&#36941;&#20215;&#26684;&#20998;&#25955;&#29616;&#35937;&#65292;&#21457;&#29616;&#20215;&#26684;&#22312;&#19981;&#21516;&#39044;&#35746;&#32593;&#31449;&#20043;&#38388;&#23384;&#22312;&#36739;&#22823;&#24046;&#24322;&#65292;&#19988;&#20215;&#26684;&#20998;&#25955;&#22312;&#39044;&#35746;&#26085;&#26399;&#38752;&#36817;&#20837;&#20303;&#26085;&#26399;&#26102;&#20173;&#28982;&#23384;&#22312;&#12290;&#36890;&#36807;&#26500;&#24314;&#29702;&#35770;&#27169;&#22411;&#65292;&#25105;&#20204;&#35299;&#37322;&#20102;&#20215;&#26684;&#20998;&#25955;&#29616;&#35937;&#30340;&#21407;&#22240;&#65292;&#24182;&#25351;&#20986;&#22312;&#23384;&#22312;&#24635;&#38656;&#27714;&#19981;&#30830;&#23450;&#24615;&#21644;&#23481;&#37327;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#65292;&#20215;&#26684;&#20998;&#25955;&#20173;&#28982;&#21487;&#33021;&#23384;&#22312;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21363;&#20351;&#28040;&#36153;&#32773;&#21487;&#20197;&#36731;&#26494;&#20174;&#27604;&#36739;&#32593;&#31449;&#33719;&#21462;&#20215;&#26684;&#20449;&#24687;&#65292;&#20294;&#21516;&#36136;&#21270;&#20135;&#21697;&#22312;&#19981;&#21516;&#22312;&#32447;&#24179;&#21488;&#19978;&#30340;&#26222;&#36941;&#20215;&#26684;&#20998;&#25955;&#29616;&#35937;&#12290;&#25105;&#20204;&#25910;&#38598;&#20102;&#20262;&#25958;&#24066;&#26368;&#21463;&#27426;&#36814;&#30340;200&#23478;&#37202;&#24215;&#30340;&#25968;&#25454;&#65292;&#24182;&#21457;&#29616;&#22312;&#39044;&#35746;&#37202;&#24215;&#25151;&#38388;&#26102;&#65292;&#20215;&#26684;&#22312;&#19981;&#21516;&#39044;&#35746;&#32593;&#31449;&#20043;&#38388;&#23384;&#22312;&#36739;&#22823;&#24046;&#24322;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#21457;&#29616;&#22312;&#39044;&#35746;&#26085;&#26399;&#38752;&#36817;&#20837;&#20303;&#26085;&#26399;&#26102;&#65292;&#19981;&#21516;&#24179;&#21488;&#19978;&#30340;&#20215;&#26684;&#36235;&#20110;&#19968;&#33268;&#12290;&#28982;&#32780;&#65292;&#20215;&#26684;&#20998;&#25955;&#20173;&#28982;&#23384;&#22312;&#30452;&#21040;&#20837;&#20303;&#26085;&#26399;&#65292;&#24847;&#21619;&#30528;&#8220;&#19968;&#20215;&#27861;&#21017;&#8221;&#19981;&#25104;&#31435;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#29702;&#35770;&#27169;&#22411;&#26469;&#35299;&#37322;&#36825;&#19968;&#29616;&#35937;&#65292;&#24182;&#34920;&#26126;&#22312;&#23384;&#22312;&#24635;&#38656;&#27714;&#19981;&#30830;&#23450;&#24615;&#21644;&#23481;&#37327;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#65292;&#21363;&#20351;&#20135;&#21697;&#26159;&#21516;&#36136;&#21270;&#30340;&#65292;&#28040;&#36153;&#32773;&#26159;&#21516;&#36136;&#21270;&#30340;&#65292;&#25152;&#26377;&#21442;&#19982;&#32773;&#37117;&#23545;&#24066;&#22330;&#32467;&#26500;&#25317;&#26377;&#23436;&#32654;&#20449;&#24687;&#65292;&#28040;&#36153;&#32773;&#33719;&#24471;&#20135;&#21697;&#20449;&#24687;&#26080;&#38656;&#20184;&#20986;&#25104;&#26412;&#65292;&#20215;&#26684;&#20998;&#25955;&#20173;&#21487;&#33021;&#23384;&#22312;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies the widespread price dispersion of homogeneous products across different online platforms, even when consumers can easily access price information from comparison websites. We collect data for the 200 most popular hotels in London (UK) and document that prices vary widely across booking sites while making reservations for a hotel room. Additionally, we find that prices listed across different platforms tend to converge as the booking date gets closer to the date of stay. However, the price dispersion persists until the date of stay, implying that the "law of one price" does not hold. We present a simple theoretical model to explain this and show that in the presence of aggregate demand uncertainty and capacity constraints, price dispersion could exist even when products are homogeneous, consumers are homogeneous, all agents have perfect information about the market structure, and consumers face no search costs to acquire information about the products. Our theoretica
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;Black-Litterman&#36164;&#20135;&#37197;&#32622;&#27169;&#22411;&#22312;&#38544;&#34255;&#25130;&#23614;&#20559;&#24577;&#27491;&#24577;&#20998;&#24067;&#19979;&#30340;&#24212;&#29992;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#20351;&#29992;Simaan&#19977;&#20010;&#26102;&#21051;&#39118;&#38505;&#27169;&#22411;&#33719;&#24471;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#30340;&#26041;&#27861;&#65292;&#24182;&#21457;&#29616;&#36825;&#31181;&#26041;&#27861;&#33719;&#24471;&#30340;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#39118;&#38505;&#26356;&#23567;&#19988;&#39044;&#26399;&#25910;&#30410;&#22686;&#21152;&#26102;&#20559;&#24230;&#26356;&#36127;&#65292;&#35828;&#26126;&#25237;&#36164;&#32773;&#36890;&#36807;&#36127;&#20559;&#24230;&#25442;&#21462;&#26356;&#39640;&#30340;&#39044;&#26399;&#25910;&#30410;&#12290;</title><link>http://arxiv.org/abs/2310.12333</link><description>&lt;p&gt;
Black-Litterman&#36164;&#20135;&#37197;&#32622;&#22312;&#38544;&#34255;&#25130;&#23614;&#20998;&#24067;&#19979;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Black-Litterman Asset Allocation under Hidden Truncation Distribution. (arXiv:2310.12333v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.12333
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;Black-Litterman&#36164;&#20135;&#37197;&#32622;&#27169;&#22411;&#22312;&#38544;&#34255;&#25130;&#23614;&#20559;&#24577;&#27491;&#24577;&#20998;&#24067;&#19979;&#30340;&#24212;&#29992;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#20351;&#29992;Simaan&#19977;&#20010;&#26102;&#21051;&#39118;&#38505;&#27169;&#22411;&#33719;&#24471;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#30340;&#26041;&#27861;&#65292;&#24182;&#21457;&#29616;&#36825;&#31181;&#26041;&#27861;&#33719;&#24471;&#30340;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#39118;&#38505;&#26356;&#23567;&#19988;&#39044;&#26399;&#25910;&#30410;&#22686;&#21152;&#26102;&#20559;&#24230;&#26356;&#36127;&#65292;&#35828;&#26126;&#25237;&#36164;&#32773;&#36890;&#36807;&#36127;&#20559;&#24230;&#25442;&#21462;&#26356;&#39640;&#30340;&#39044;&#26399;&#25910;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;Black-Litterman &#65288;BL&#65289;&#36164;&#20135;&#37197;&#32622;&#27169;&#22411;&#65288;Black&#21644;Litterman, 1990&#65289;&#22312;&#38544;&#34255;&#25130;&#23614;&#20559;&#24577;&#27491;&#24577;&#20998;&#24067;&#65288;Arnold&#21644;Beaver, 2000&#65289;&#19979;&#30340;&#24212;&#29992;&#12290;&#29305;&#21035;&#22320;&#65292;&#24403;&#20551;&#35774;&#25910;&#30410;&#29575;&#36981;&#24490;&#36825;&#31181;&#20559;&#24577;&#27491;&#24577;&#20998;&#24067;&#26102;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#21152;&#20837;&#35266;&#28857;&#21518;&#30340;&#21518;&#39564;&#25910;&#30410;&#29575;&#20063;&#26381;&#20174;&#20559;&#24577;&#27491;&#24577;&#20998;&#24067;&#12290;&#36890;&#36807;&#20351;&#29992;Simaan&#19977;&#20010;&#26102;&#21051;&#39118;&#38505;&#27169;&#22411;&#65288;Simaan, 1993&#65289;&#65292;&#25105;&#20204;&#21487;&#20197;&#24471;&#21040;&#26368;&#20248;&#21270;&#25237;&#36164;&#32452;&#21512;&#12290;&#23454;&#35777;&#25968;&#25454;&#34920;&#26126;&#65292;&#29992;&#36825;&#31181;&#26041;&#24335;&#33719;&#24471;&#30340;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#30456;&#23545;&#20110;&#20256;&#32479;&#30340;BL&#27169;&#22411;&#30340;&#20248;&#28857;&#26159;&#39118;&#38505;&#26356;&#23567;&#65292;&#24182;&#19988;&#38543;&#30528;&#25237;&#36164;&#32452;&#21512;&#30340;&#39044;&#26399;&#25910;&#30410;&#22686;&#21152;&#65292;&#23427;&#20204;&#30340;&#20559;&#24230;&#21464;&#24471;&#26356;&#21152;&#36127;&#21521;&#65292;&#36825;&#34920;&#26126;&#25237;&#36164;&#32773;&#36890;&#36807;&#36127;&#20559;&#24230;&#25442;&#21462;&#26356;&#39640;&#30340;&#39044;&#26399;&#25910;&#30410;&#12290;&#25105;&#20204;&#36824;&#35266;&#23519;&#21040;&#25237;&#36164;&#32452;&#21512;&#27874;&#21160;&#24615;&#19982;&#20559;&#24230;&#20043;&#38388;&#23384;&#22312;&#36127;&#30456;&#20851;&#20851;&#31995;&#12290;&#36825;&#19968;&#35266;&#23519;&#34920;&#26126;&#25237;&#36164;&#32773;&#21487;&#33021;&#20250;&#20570;&#20986;&#26435;&#34913;&#65292;&#20197;&#26356;&#20302;&#30340;&#27874;&#21160;&#24615;&#25442;&#21462;&#26356;&#39640;&#30340;&#20559;&#24230;&#65292;&#21453;&#20043;&#20134;&#28982;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we study the Black-Litterman (BL) asset allocation model (Black and Litterman, 1990) under the hidden truncation skew-normal distribution (Arnold and Beaver, 2000). In particular, when returns are assumed to follow this skew normal distribution, we show that the posterior returns, after incorporating views, are also skew normal. By using Simaan three moments risk model (Simaan, 1993), we could then obtain the optimal portfolio. Empirical data show that the optimal portfolio obtained this way has less risk compared to an optimal portfolio of the classical BL model and that they become more negatively skewed as the expected returns of portfolios increase, which suggests that the investors trade a negative skewness for a higher expected return. We also observe a negative relation between portfolio volatility and portfolio skewness. This observation suggests that investors may be making a trade-off, opting for lower volatility in exchange for higher skewness, or vice versa. 
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#65292;&#23558;&#21516;&#20276;&#24433;&#21709;&#32435;&#20837;&#20559;&#22909;&#21644;&#32771;&#34385;&#38598;&#65292;&#21033;&#29992;&#19981;&#21516;&#31867;&#22411;&#30340;&#21464;&#21270;&#21306;&#20998;&#21516;&#20276;&#24433;&#21709;&#65292;&#24182;&#24674;&#22797;&#32593;&#32476;&#20013;&#20195;&#29702;&#20043;&#38388;&#30340;&#36830;&#25509;&#38598;&#21512;&#21644;&#31867;&#22411;&#65292;&#38750;&#21442;&#25968;&#35782;&#21035;&#32467;&#26524;&#20801;&#35768;&#20195;&#29702;&#20154;&#20043;&#38388;&#30340;&#26080;&#38480;&#24322;&#36136;&#24615;&#65292;&#24182;&#24212;&#29992;&#20110;&#21654;&#21857;&#36830;&#38145;&#24215;&#30340;&#25193;&#24352;&#20915;&#31574;&#12290;</title><link>http://arxiv.org/abs/2310.12272</link><description>&lt;p&gt;
&#32771;&#34385;&#21644;&#20559;&#22909;&#20013;&#30340;&#21516;&#20276;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Peer Effects in Consideration and Preferences. (arXiv:2310.12272v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.12272
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#65292;&#23558;&#21516;&#20276;&#24433;&#21709;&#32435;&#20837;&#20559;&#22909;&#21644;&#32771;&#34385;&#38598;&#65292;&#21033;&#29992;&#19981;&#21516;&#31867;&#22411;&#30340;&#21464;&#21270;&#21306;&#20998;&#21516;&#20276;&#24433;&#21709;&#65292;&#24182;&#24674;&#22797;&#32593;&#32476;&#20013;&#20195;&#29702;&#20043;&#38388;&#30340;&#36830;&#25509;&#38598;&#21512;&#21644;&#31867;&#22411;&#65292;&#38750;&#21442;&#25968;&#35782;&#21035;&#32467;&#26524;&#20801;&#35768;&#20195;&#29702;&#20154;&#20043;&#38388;&#30340;&#26080;&#38480;&#24322;&#36136;&#24615;&#65292;&#24182;&#24212;&#29992;&#20110;&#21654;&#21857;&#36830;&#38145;&#24215;&#30340;&#25193;&#24352;&#20915;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#19968;&#33324;&#30340;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#65292;&#23558;&#21516;&#20276;&#24433;&#21709;&#32435;&#20837;&#20559;&#22909;&#21644;&#32771;&#34385;&#38598;&#20013;&#12290;&#25105;&#20204;&#23545;&#24179;&#34913;&#34892;&#20026;&#36827;&#34892;&#25551;&#36848;&#65292;&#24182;&#24314;&#31435;&#20102;&#19968;&#31995;&#21015;&#36873;&#25321;&#20013;&#33021;&#24674;&#22797;&#27169;&#22411;&#21508;&#20010;&#37096;&#20998;&#30340;&#26465;&#20214;&#12290;&#25105;&#20204;&#20801;&#35768;&#21516;&#20276;&#24433;&#21709;&#21482;&#20316;&#29992;&#20110;&#20559;&#22909;&#12289;&#21482;&#20316;&#29992;&#20110;&#32771;&#34385;&#65292;&#25110;&#32773;&#21516;&#26102;&#20316;&#29992;&#20110;&#20004;&#32773;&#12290;&#25105;&#20204;&#21033;&#29992;&#19981;&#21516;&#31867;&#22411;&#30340;&#21464;&#21270;&#26469;&#21306;&#20998;&#20559;&#22909;&#21644;&#32771;&#34385;&#38598;&#20013;&#30340;&#21516;&#20276;&#24433;&#21709;&#12290;&#36825;&#20351;&#25105;&#20204;&#33021;&#22815;&#24674;&#22797;&#32593;&#32476;&#20013;&#20195;&#29702;&#20043;&#38388;&#30340;&#36830;&#25509;&#38598;&#21512;&#65288;&#21644;&#31867;&#22411;&#65289;&#12290;&#28982;&#21518;&#25105;&#20204;&#21033;&#29992;&#36825;&#20123;&#20449;&#24687;&#26469;&#24674;&#22797;&#27599;&#20010;&#20195;&#29702;&#20154;&#30340;&#38543;&#26426;&#20559;&#22909;&#21644;&#27880;&#24847;&#26426;&#21046;&#12290;&#36825;&#20123;&#38750;&#21442;&#25968;&#35782;&#21035;&#32467;&#26524;&#20801;&#35768;&#20195;&#29702;&#20154;&#20043;&#38388;&#30340;&#26080;&#38480;&#24322;&#36136;&#24615;&#65292;&#24182;&#19981;&#20381;&#36182;&#20110;&#21327;&#21464;&#37327;&#25110;&#21487;&#29992;&#36873;&#39033;&#65288;&#25110;&#33756;&#21333;&#65289;&#30340;&#21464;&#21270;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#32467;&#26524;&#24212;&#29992;&#20110;&#21654;&#21857;&#36830;&#38145;&#24215;&#30340;&#25193;&#24352;&#20915;&#31574;&#65292;&#24182;&#21457;&#29616;&#26377;&#38480;&#30340;&#32771;&#34385;&#35777;&#25454;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#21453;&#20107;&#23454;&#39044;&#27979;&#27169;&#25311;&#65292;&#24182;&#23637;&#31034;&#20102;&#26377;&#38480;&#30340;&#32771;&#34385;&#22914;&#20309;&#24433;&#21709;&#20915;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a general model of discrete choice that incorporates peer effects in preferences and consideration sets. We characterize the equilibrium behavior and establish conditions under which all parts of the model can be recovered from a sequence of choices. We allow peers to affect only preferences, only consideration, or both. We exploit different types of variations to separate the peer effects in preferences and consideration sets. This allows us to recover the set (and type) of connections between the agents in the network. We then use this information to recover the random preferences and the attention mechanisms of each agent. These nonparametric identification results allow unrestricted heterogeneity across agents and do not rely on the variation of either covariates or the set of available options (or menus). We apply our results to model expansion decisions by coffee chains and find evidence of limited consideration. We simulate counterfactual predictions and show how limi
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#36866;&#29992;&#20110;&#22810;&#20195;&#24065;&#30340;Walrasian&#25293;&#21334;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#35813;&#26041;&#26696;&#22522;&#20110;Brouwer&#30340;&#19981;&#21160;&#28857;&#23450;&#29702;&#65292;&#33021;&#22815;&#25191;&#34892;&#25152;&#26377;&#35746;&#21333;&#24182;&#36827;&#34892;&#26368;&#20248;&#30340;AMMs&#20132;&#25442;&#12290;</title><link>http://arxiv.org/abs/2310.12255</link><description>&lt;p&gt;
&#36866;&#29992;&#20110;&#22810;&#20195;&#24065;&#30340;Walrasian&#25293;&#21334;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#26696;&#19982;AMMs
&lt;/p&gt;
&lt;p&gt;
A solution to walrasian auctions for many tokens with AMMs available. (arXiv:2310.12255v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.12255
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#36866;&#29992;&#20110;&#22810;&#20195;&#24065;&#30340;Walrasian&#25293;&#21334;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#35813;&#26041;&#26696;&#22522;&#20110;Brouwer&#30340;&#19981;&#21160;&#28857;&#23450;&#29702;&#65292;&#33021;&#22815;&#25191;&#34892;&#25152;&#26377;&#35746;&#21333;&#24182;&#36827;&#34892;&#26368;&#20248;&#30340;AMMs&#20132;&#25442;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32771;&#34385;&#26576;&#19968;&#29366;&#24577;&#19979;&#26377;&#38480;&#25968;&#37327;&#30340;&#20132;&#26131;&#35746;&#21333;&#21644;&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMMs&#65289;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#35299;&#20915;&#26041;&#26696;&#65292;&#29992;&#20110;&#25214;&#21040;&#19968;&#20010;&#22343;&#34913;&#20215;&#26684;&#21521;&#37327;&#65292;&#20197;&#20415;&#19982;&#30456;&#24212;&#30340;&#26368;&#20248;AMMs&#20132;&#25442;&#19968;&#36215;&#25191;&#34892;&#25152;&#26377;&#35746;&#21333;&#12290;&#35813;&#35299;&#20915;&#26041;&#26696;&#22522;&#20110;Brouwer&#30340;&#19981;&#21160;&#28857;&#23450;&#29702;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#19982;&#20844;&#20849;&#21306;&#22359;&#38142;&#27963;&#21160;&#20013;&#30340;&#23454;&#38469;&#24773;&#20917;&#30456;&#20851;&#30340;&#35745;&#31639;&#26041;&#38754;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
Consider a finite set of trade orders and automated market makers (AMMs) at some state. We propose a solution to the problem of finding an equilibrium price vector to execute all the orders jointly with corresponding optimal AMMs swaps. The solution is based on Brouwer's fixed-point theorem. We discuss computational aspects relevant for realistic situations in public blockchain activity.
&lt;/p&gt;</description></item><item><title>DeepVol&#26159;&#19968;&#31181;&#29992;&#20110;&#36890;&#29992;&#36164;&#20135;&#27874;&#21160;&#24615;&#24314;&#27169;&#30340;&#28145;&#24230;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#19968;&#20010;&#36890;&#29992;&#27169;&#22411;&#26377;&#25928;&#22320;&#25429;&#25417;&#21644;&#24314;&#27169;&#25152;&#26377;&#37329;&#34701;&#36164;&#20135;&#30340;&#27874;&#21160;&#24615;&#21160;&#24577;&#65292;&#21487;&#33021;&#25913;&#21464;&#23545;&#27874;&#21160;&#24615;&#30340;&#29702;&#35299;&#21644;&#39044;&#27979;&#26041;&#24335;&#12290;</title><link>http://arxiv.org/abs/2309.02072</link><description>&lt;p&gt;
DeepVol&#65306;&#19968;&#31181;&#29992;&#20110;&#36890;&#29992;&#36164;&#20135;&#27874;&#21160;&#24615;&#24314;&#27169;&#30340;&#28145;&#24230;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
DeepVol: A Deep Transfer Learning Approach for Universal Asset Volatility Modeling. (arXiv:2309.02072v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.02072
&lt;/p&gt;
&lt;p&gt;
DeepVol&#26159;&#19968;&#31181;&#29992;&#20110;&#36890;&#29992;&#36164;&#20135;&#27874;&#21160;&#24615;&#24314;&#27169;&#30340;&#28145;&#24230;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#19968;&#20010;&#36890;&#29992;&#27169;&#22411;&#26377;&#25928;&#22320;&#25429;&#25417;&#21644;&#24314;&#27169;&#25152;&#26377;&#37329;&#34701;&#36164;&#20135;&#30340;&#27874;&#21160;&#24615;&#21160;&#24577;&#65292;&#21487;&#33021;&#25913;&#21464;&#23545;&#27874;&#21160;&#24615;&#30340;&#29702;&#35299;&#21644;&#39044;&#27979;&#26041;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#28145;&#24230;&#23398;&#20064;&#27874;&#21160;&#24615;&#27169;&#22411;DeepVol&#65292;&#23427;&#22312;&#27169;&#22411;&#30340;&#24191;&#27867;&#24615;&#26041;&#38754;&#20248;&#20110;&#20256;&#32479;&#30340;&#35745;&#37327;&#32463;&#27982;&#27169;&#22411;&#12290;DeepVol&#21033;&#29992;&#36801;&#31227;&#23398;&#20064;&#30340;&#33021;&#21147;&#65292;&#36890;&#36807;&#19968;&#20010;&#36890;&#29992;&#27169;&#22411;&#26377;&#25928;&#22320;&#25429;&#25417;&#21644;&#24314;&#27169;&#25152;&#26377;&#37329;&#34701;&#36164;&#20135;&#30340;&#27874;&#21160;&#24615;&#21160;&#24577;&#65292;&#21253;&#25324;&#20197;&#21069;&#26410;&#35265;&#36807;&#30340;&#36164;&#20135;&#12290;&#36825;&#19982;&#35745;&#37327;&#32463;&#27982;&#23398;&#25991;&#29486;&#20013;&#30340;&#20027;&#27969;&#20570;&#27861;&#24418;&#25104;&#40092;&#26126;&#23545;&#27604;&#65292;&#21518;&#32773;&#38656;&#35201;&#20026;&#19981;&#21516;&#25968;&#25454;&#38598;&#35757;&#32451;&#21333;&#29420;&#30340;&#27169;&#22411;&#12290;&#24341;&#20837;DeepVol&#20026;&#37329;&#34701;&#34892;&#19994;&#30340;&#27874;&#21160;&#24615;&#24314;&#27169;&#21644;&#39044;&#27979;&#24320;&#36767;&#20102;&#26032;&#30340;&#36884;&#24452;&#65292;&#21487;&#33021;&#20250;&#25913;&#21464;&#23545;&#27874;&#21160;&#24615;&#30340;&#29702;&#35299;&#21644;&#39044;&#27979;&#26041;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper introduces DeepVol, a promising new deep learning volatility model that outperforms traditional econometric models in terms of model generality. DeepVol leverages the power of transfer learning to effectively capture and model the volatility dynamics of all financial assets, including previously unseen ones, using a single universal model. This contrasts to the prevailing practice in econometrics literature, which necessitates training separate models for individual datasets. The introduction of DeepVol opens up new avenues for volatility modeling and forecasting in the finance industry, potentially transforming the way volatility is understood and predicted.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#33487;&#26684;&#20848;1,079&#20010;&#22320;&#26041;&#25919;&#24220;STV&#36873;&#20030;&#65292;&#21457;&#29616;&#20854;&#20013;41&#27425;&#20986;&#29616;&#26576;&#31181;&#21333;&#35843;&#24615;&#24322;&#24120;&#65292;&#19988;&#36825;&#20123;&#24322;&#24120;&#29575;&#19982;&#20043;&#21069;&#30340;&#32463;&#39564;&#30740;&#31350;&#30456;&#20284;&#65292;&#36828;&#20302;&#20110;&#22823;&#22810;&#25968;&#29702;&#35770;&#30740;&#31350;&#21457;&#29616;&#30340;&#24322;&#24120;&#29575;&#12290;</title><link>http://arxiv.org/abs/2305.17741</link><description>&lt;p&gt;
&#33487;&#26684;&#20848;&#22320;&#26041;&#25919;&#24220;&#36873;&#20030;&#20013;&#30340;&#21333;&#35843;&#24615;&#24322;&#24120;&#29616;&#35937;
&lt;/p&gt;
&lt;p&gt;
Monotonicity Anomalies in Scottish Local Government Elections. (arXiv:2305.17741v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.17741
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#33487;&#26684;&#20848;1,079&#20010;&#22320;&#26041;&#25919;&#24220;STV&#36873;&#20030;&#65292;&#21457;&#29616;&#20854;&#20013;41&#27425;&#20986;&#29616;&#26576;&#31181;&#21333;&#35843;&#24615;&#24322;&#24120;&#65292;&#19988;&#36825;&#20123;&#24322;&#24120;&#29575;&#19982;&#20043;&#21069;&#30340;&#32463;&#39564;&#30740;&#31350;&#30456;&#20284;&#65292;&#36828;&#20302;&#20110;&#22823;&#22810;&#25968;&#29702;&#35770;&#30740;&#31350;&#21457;&#29616;&#30340;&#24322;&#24120;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21333;&#19968;&#21487;&#36716;&#31227;&#36873;&#31080;&#65288;STV&#65289;&#25237;&#31080;&#26041;&#27861;&#29992;&#20110;&#36873;&#20030;&#25490;&#21517;&#36873;&#20030;&#20013;&#30340;&#22810;&#20010;&#20505;&#36873;&#20154;&#12290;STV&#30340;&#19968;&#20010;&#24369;&#28857;&#26159;&#23427;&#26410;&#33021;&#36890;&#36807;&#19982;&#21333;&#35843;&#24615;&#21644;&#26080;&#34920;&#20915;&#24726;&#35770;&#30456;&#20851;&#30340;&#22810;&#20010;&#20844;&#24179;&#26631;&#20934;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#33487;&#26684;&#20848;1,079&#20010;&#22320;&#26041;&#25919;&#24220;STV&#36873;&#20030;&#65292;&#20197;&#20272;&#35745;&#29616;&#23454;&#19990;&#30028;&#36873;&#20030;&#20013;&#27492;&#31867;&#21333;&#35843;&#24615;&#24322;&#24120;&#30340;&#39057;&#29575;&#65292;&#24182;&#23558;&#32467;&#26524;&#19982;&#20851;&#20110;&#27492;&#31867;&#24322;&#24120;&#20986;&#29616;&#29575;&#30340;&#20808;&#21069;&#32463;&#39564;&#21644;&#29702;&#35770;&#30740;&#31350;&#36827;&#34892;&#27604;&#36739;&#12290;&#22312;1079&#27425;&#36873;&#20030;&#20013;&#65292;&#25105;&#20204;&#21457;&#29616;41&#27425;&#20986;&#29616;&#26576;&#31181;&#21333;&#35843;&#24615;&#24322;&#24120;&#12290;&#25105;&#20204;&#36890;&#24120;&#21457;&#29616;&#24322;&#24120;&#29575;&#19982;&#20043;&#21069;&#30340;&#32463;&#39564;&#30740;&#31350;&#30456;&#20284;&#65292;&#36828;&#20302;&#20110;&#22823;&#22810;&#25968;&#29702;&#35770;&#30740;&#31350;&#21457;&#29616;&#30340;&#24322;&#24120;&#29575;&#12290;&#25105;&#20204;&#21457;&#29616;&#30340;&#22823;&#22810;&#25968;STV&#24322;&#24120;&#37117;&#26159;&#31532;&#19968;&#27425;&#22312;&#23454;&#38469;&#36873;&#20030;&#20013;&#35760;&#24405;&#21040;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
The single transferable vote (STV) voting method is used to elect multiple candidates in ranked-choice elections. One weakness of STV is that it fails multiple fairness criteria related to monotonicity and no-show paradoxes. We analyze 1,079 local government STV elections in Scotland to estimate the frequency of such monotonicity anomalies in real-world elections, and compare our results with prior empirical and theoretical research about the rates at which such anomalies occur. In 41 of the 1079 elections we found some kind of monotonicity anomaly. We generally find that the rates of anomalies are similar to prior empirical research and much lower than what most theoretical research has found. Most of the STV anomalies we find are the first of their kind to be documented in real-world elections.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;</title><link>http://arxiv.org/abs/2302.13426</link><description>&lt;p&gt;
&#26399;&#26435;&#30340;&#20215;&#26684;&#21457;&#29616;
&lt;/p&gt;
&lt;p&gt;
Price Discovery for Derivatives. (arXiv:2302.13426v5 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13426
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#19968;&#20010;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#31169;&#26377;&#20449;&#24687;&#21644;&#39640;&#38454;&#20449;&#24687;&#23545;&#26399;&#26435;&#24066;&#22330;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#27169;&#22411;&#20801;&#35768;&#26377;&#31169;&#26377;&#20449;&#24687;&#30340;&#20132;&#26131;&#32773;&#22312;&#29366;&#24577;-&#32034;&#36180;&#38598;&#24066;&#22330;&#19978;&#20132;&#26131;&#12290;&#31561;&#20215;&#30340;&#26399;&#26435;&#24418;&#24335;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#25317;&#26377;&#20851;&#20110;&#22522;&#30784;&#36164;&#20135;&#25910;&#30410;&#30340;&#20998;&#24067;&#30340;&#31169;&#26377;&#20449;&#24687;&#65292;&#24182;&#20801;&#35768;&#20132;&#26131;&#20219;&#24847;&#26399;&#26435;&#32452;&#21512;&#30340;&#25805;&#32437;&#32773;&#12290;&#25105;&#20204;&#24471;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#65292;&#36825;&#20123;&#35299;&#25552;&#20379;&#20102;&#20851;&#20110;&#20869;&#24149;&#20132;&#26131;&#30340;&#39640;&#38454;&#20449;&#24687;&#65292;&#22914;&#20219;&#20309;&#32473;&#23450;&#30340;&#26102;&#21051;&#20132;&#26131;&#26399;&#26435;&#31574;&#30053;&#65292;&#24182;&#23558;&#36825;&#20123;&#31574;&#30053;&#27867;&#21270;&#21040;&#20102;&#27874;&#21160;&#29575;&#20132;&#26131;&#31561;&#23454;&#36341;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;
We obtain a basic theory of price discovery across derivative markets with respect to higher-order information, using a model where an agent with general private information regarding state probabilities is allowed to trade arbitrary portfolios of state-contingent claims. In an equivalent options formulation, the informed agent has private information regarding arbitrary aspects of the payoff distribution of an underlying asset and is allowed to trade arbitrary option portfolios. We characterize, in closed form, the informed demand, price impact, and information efficiency of prices. Our results offer a theory of insider trading on higher moments of the underlying payoff as a special case. The informed demand formula prescribes option strategies for trading on any given moment and extends those used in practice for, e.g. volatility trading.
&lt;/p&gt;</description></item><item><title>&#32654;&#22269;&#38646;&#21806;&#19994;&#38598;&#20013;&#24230;&#36817;&#24180;&#26469;&#21576;&#29616;&#22686;&#21152;&#36235;&#21183;&#65292;&#22823;&#37096;&#20998;&#30001;&#22810;&#24066;&#22330;&#20225;&#19994;&#36827;&#20837;&#26032;&#24066;&#22330;&#23548;&#33268;&#65292;&#26412;&#22320;&#24066;&#22330;&#20221;&#39069;&#22686;&#21152;&#20063;&#22312;1997&#24180;&#33267;2007&#24180;&#38388;&#21464;&#24471;&#26356;&#21152;&#37325;&#35201;&#12290;&#26412;&#22320;&#38598;&#20013;&#24230;&#30340;&#22686;&#21152;&#35299;&#37322;&#20102;&#25972;&#20307;&#38144;&#21806;&#22686;&#38271;&#30340;&#22235;&#20998;&#20043;&#19968;&#21040;&#19977;&#20998;&#20043;&#19968;&#12290;</title><link>http://arxiv.org/abs/2202.07609</link><description>&lt;p&gt;
&#32654;&#22269;&#38646;&#21806;&#19994;&#38598;&#20013;&#24230;&#30340;&#28436;&#21464;
&lt;/p&gt;
&lt;p&gt;
The Evolution of U.S. Retail Concentration. (arXiv:2202.07609v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.07609
&lt;/p&gt;
&lt;p&gt;
&#32654;&#22269;&#38646;&#21806;&#19994;&#38598;&#20013;&#24230;&#36817;&#24180;&#26469;&#21576;&#29616;&#22686;&#21152;&#36235;&#21183;&#65292;&#22823;&#37096;&#20998;&#30001;&#22810;&#24066;&#22330;&#20225;&#19994;&#36827;&#20837;&#26032;&#24066;&#22330;&#23548;&#33268;&#65292;&#26412;&#22320;&#24066;&#22330;&#20221;&#39069;&#22686;&#21152;&#20063;&#22312;1997&#24180;&#33267;2007&#24180;&#38388;&#21464;&#24471;&#26356;&#21152;&#37325;&#35201;&#12290;&#26412;&#22320;&#38598;&#20013;&#24230;&#30340;&#22686;&#21152;&#35299;&#37322;&#20102;&#25972;&#20307;&#38144;&#21806;&#22686;&#38271;&#30340;&#22235;&#20998;&#20043;&#19968;&#21040;&#19977;&#20998;&#20043;&#19968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32654;&#22269;&#30340;&#20135;&#19994;&#21160;&#24577;&#20013;&#65292;&#22269;&#23478;&#38598;&#20013;&#24230;&#30340;&#22686;&#21152;&#26159;&#19968;&#20010;&#26174;&#33879;&#29305;&#24449;&#65292;&#20063;&#24341;&#36215;&#20102;&#23545;&#24066;&#22330;&#21147;&#37327;&#22686;&#38271;&#30340;&#25285;&#24551;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#24066;&#22330;&#21147;&#37327;&#24773;&#20917;&#65292;&#26412;&#22320;&#36235;&#21183;&#21487;&#33021;&#26356;&#20855;&#20449;&#24687;&#37327;&#65292;&#29305;&#21035;&#26159;&#22312;&#38646;&#21806;&#37096;&#38376;&#65292;&#28040;&#36153;&#32773;&#36890;&#24120;&#22312;&#38468;&#36817;&#30340;&#21830;&#24215;&#36141;&#29289;&#12290;&#25105;&#20204;&#20351;&#29992;&#26032;&#22411;&#26222;&#26597;&#25968;&#25454;&#65292;&#35266;&#23519;&#20102;1992&#24180;&#33267;2012&#24180;&#38388;&#25152;&#26377;&#32654;&#22269;&#38646;&#21806;&#24215;&#20135;&#21697;&#32423;&#25910;&#20837;&#30340;&#26412;&#22320;&#38598;&#20013;&#24230;&#19982;&#22269;&#23478;&#38598;&#20013;&#24230;&#20960;&#20046;&#21516;&#27493;&#22686;&#21152;&#12290;&#38598;&#20013;&#24230;&#30340;&#22686;&#21152;&#24191;&#27867;&#24433;&#21709;&#22823;&#22810;&#25968;&#24066;&#22330;&#12289;&#20135;&#21697;&#21644;&#38646;&#21806;&#34892;&#19994;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22810;&#24066;&#22330;&#20225;&#19994;&#36827;&#20837;&#26032;&#24066;&#22330;&#35299;&#37322;&#20102;&#22269;&#23478;&#38646;&#21806;&#38598;&#20013;&#24230;&#30340;&#22823;&#37096;&#20998;&#22686;&#38271;&#65292;&#32780;&#36890;&#36807;&#22686;&#21152;&#26412;&#22320;&#24066;&#22330;&#20221;&#39069;&#36827;&#34892;&#30340;&#25972;&#21512;&#22312;1997&#24180;&#33267;2007&#24180;&#38388;&#21464;&#24471;&#36234;&#26469;&#36234;&#37325;&#35201;&#65292;&#32780;&#21333;&#24066;&#22330;&#20225;&#19994;&#30340;&#20316;&#29992;&#24494;&#19981;&#36275;&#36947;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#21457;&#29616;&#26412;&#22320;&#38598;&#20013;&#24230;&#30340;&#22686;&#21152;&#21487;&#20197;&#35299;&#37322;&#25972;&#20307;&#38144;&#21806;&#22686;&#38271;&#30340;&#22235;&#20998;&#20043;&#19968;&#21040;&#19977;&#20998;&#20043;&#19968;&#12290;
&lt;/p&gt;
&lt;p&gt;
Increases in national concentration have been a salient feature of industry dynamics in the U.S. and have contributed to concerns about increasing market power. Yet, local trends may be more informative about market power, particularly in the retail sector where consumers have traditionally shopped at nearby stores. We find that local concentration has increased almost in parallel with national concentration using novel Census data on product-level revenue for all U.S. retail stores between 1992 and 2012. The increases in concentration are broad based, affecting most markets, products, and retail industries. We show that the expansion of multi-market firms into new markets explains most of the increase in national retail concentration, with consolidation via increases in local market shares increasing in importance between 1997 and 2007, and single-market firms playing a negligible role. Finally, we find that increases in local concentration can explain one-quarter to one-third of the 
&lt;/p&gt;</description></item><item><title>&#25991;&#31456;&#20351;&#29992;&#32929;&#19996;&#22823;&#20250;&#26102;&#38388;&#24046;&#24322;&#30340;&#26041;&#27861;&#30740;&#31350;&#20102;&#32929;&#19996;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#20294;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#36825;&#31181;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;</title><link>http://arxiv.org/abs/2103.12138</link><description>&lt;p&gt;
&#36861;&#27714;&#32929;&#19996;&#20215;&#20540;&#30340;&#20849;&#21516;&#25104;&#26412;
&lt;/p&gt;
&lt;p&gt;
The Shared Cost of Pursuing Shareholder Value. (arXiv:2103.12138v9 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2103.12138
&lt;/p&gt;
&lt;p&gt;
&#25991;&#31456;&#20351;&#29992;&#32929;&#19996;&#22823;&#20250;&#26102;&#38388;&#24046;&#24322;&#30340;&#26041;&#27861;&#30740;&#31350;&#20102;&#32929;&#19996;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#20294;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#36825;&#31181;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37319;&#29992;&#20934;&#23454;&#39564;&#24615;&#30340;&#26041;&#27861;&#65292;&#26681;&#25454;&#20844;&#21496;&#32929;&#19996;&#22823;&#20250;&#65288;AGMs&#65289;&#30340;&#26102;&#38388;&#24046;&#24322;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#21487;&#31227;&#26893;&#30340;&#26694;&#26550;&#65292;&#25512;&#26029;&#32929;&#19996;&#30340;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;covid&#30456;&#20851;&#25424;&#36192;&#12289;&#26368;&#36817;&#38024;&#23545;&#20420;&#32599;&#26031;&#30340;&#31169;&#20154;&#21046;&#35009;&#20197;&#21450;&#20844;&#21496;2012-19&#24180;&#30340;&#21033;&#20182;&#31435;&#22330;&#12290;AGMs&#30340;&#23186;&#20307;&#26333;&#20809;&#24102;&#26469;&#30340;&#24418;&#35937;&#25910;&#30410;&#65292;&#20351;&#24471;&#19982;&#20844;&#21496;&#21516;&#20041;&#30340;&#32929;&#19996;&#65288;&#22914;&#23494;&#20999;&#30456;&#20851;&#30340;&#20010;&#20154;&#65289;&#25903;&#25345;&#26114;&#36149;&#30340;&#21033;&#20182;&#21464;&#38761;&#65292;&#32780;&#20854;&#20182;&#32929;&#19996;&#65288;&#22914;&#37329;&#34701;&#20844;&#21496;&#65289;&#21453;&#23545;&#36825;&#20123;&#21464;&#38761;&#12290;&#25903;&#25345;&#36825;&#20123;&#21464;&#38761;&#30340;&#24433;&#21709;&#20351;&#25910;&#30410;&#19979;&#38477;&#20102;30&#65285;&#65306;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
Using quasi-experimental variations from the timing of firms' Annual General Meetings (AGMs), we propose a portable framework to infer shareholders' preferences and influences on firms' prosocial decisions and apply it to covid-related donations, recent private sanctions on Russia, and firms' prosocial stances over 2012-19. Image gains from AGMs' media exposure drive shareholders synonymous with a firm, like closely-connected individuals, to support costly prosocial changes, while others, like financial corporations, oppose them. Influence supporting these changes lowers earnings by 30\%: pursuing the values of (some) shareholders has distributional costs, which the monitoring of large shareholders motivated by heterogeneous preferences could prevent.
&lt;/p&gt;</description></item><item><title>&#21306;&#22359;&#38142;&#30340;&#20849;&#35782;&#21327;&#35758;&#23548;&#33268;&#20102;&#32467;&#31639;&#24310;&#36831;&#65292;&#38480;&#21046;&#20102;&#22871;&#21033;&#26426;&#20250;&#12290;&#20026;&#20102;&#35268;&#36991;&#22871;&#21033;&#25104;&#26412;&#65292;&#38656;&#35201;&#37325;&#26032;&#23433;&#35013;&#20449;&#20219;&#30340;&#20013;&#20171;&#26469;&#20943;&#36731;&#36829;&#32422;&#39118;&#38505;&#12290;</title><link>http://arxiv.org/abs/1812.00595</link><description>&lt;p&gt;
&#26500;&#24314;&#20449;&#20219;&#38656;&#35201;&#26102;&#38388;&#65306;&#22522;&#20110;&#21306;&#22359;&#38142;&#36164;&#20135;&#30340;&#22871;&#21033;&#38480;&#21046;
&lt;/p&gt;
&lt;p&gt;
Building Trust Takes Time: Limits to Arbitrage for Blockchain-Based Assets. (arXiv:1812.00595v4 [q-fin.TR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1812.00595
&lt;/p&gt;
&lt;p&gt;
&#21306;&#22359;&#38142;&#30340;&#20849;&#35782;&#21327;&#35758;&#23548;&#33268;&#20102;&#32467;&#31639;&#24310;&#36831;&#65292;&#38480;&#21046;&#20102;&#22871;&#21033;&#26426;&#20250;&#12290;&#20026;&#20102;&#35268;&#36991;&#22871;&#21033;&#25104;&#26412;&#65292;&#38656;&#35201;&#37325;&#26032;&#23433;&#35013;&#20449;&#20219;&#30340;&#20013;&#20171;&#26469;&#20943;&#36731;&#36829;&#32422;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21306;&#22359;&#38142;&#29992;&#32791;&#26102;&#30340;&#20849;&#35782;&#21327;&#35758;&#21462;&#20195;&#20013;&#22830;&#20132;&#26131;&#23545;&#25163;&#26469;&#35760;&#24405;&#25152;&#26377;&#26435;&#30340;&#36716;&#31227;&#12290;&#36825;&#31181;&#32467;&#31639;&#24310;&#36831;&#20943;&#32531;&#20102;&#36328;&#20132;&#26131;&#25152;&#30340;&#20132;&#26131;&#65292;&#20351;&#22871;&#21033;&#32773;&#38754;&#20020;&#20215;&#26684;&#39118;&#38505;&#12290;&#30456;&#21453;&#65292;&#38750;&#38142;&#19978;&#32467;&#31639;&#20351;&#22871;&#21033;&#32773;&#38754;&#20020;&#26114;&#36149;&#30340;&#36829;&#32422;&#39118;&#38505;&#12290;&#25105;&#20204;&#36890;&#36807;&#27604;&#29305;&#24065;&#32593;&#32476;&#21644;&#35746;&#21333;&#31807;&#25968;&#25454;&#34920;&#26126;&#65292;&#20132;&#26131;&#25152;&#20215;&#26684;&#24046;&#24322;&#19982;&#39640;&#32467;&#31639;&#24310;&#36831;&#26399;&#37325;&#21512;&#65292;&#36164;&#20135;&#27969;&#21521;&#36861;&#36880;&#22871;&#21033;&#26426;&#20250;&#65292;&#20302;&#36829;&#32422;&#39118;&#38505;&#20132;&#26131;&#25152;&#38388;&#30340;&#20215;&#26684;&#24046;&#24322;&#36739;&#23567;&#12290;&#22240;&#27492;&#65292;&#22522;&#20110;&#21306;&#22359;&#38142;&#30340;&#20132;&#26131;&#38754;&#20020;&#30528;&#20004;&#38590;&#36873;&#25321;&#65306;&#21487;&#38752;&#30340;&#20849;&#35782;&#21327;&#35758;&#38656;&#35201;&#32791;&#26102;&#30340;&#32467;&#31639;&#24310;&#36831;&#65292;&#23548;&#33268;&#22871;&#21033;&#38480;&#21046;&#12290;&#35268;&#36991;&#27492;&#31867;&#22871;&#21033;&#25104;&#26412;&#20165;&#36890;&#36807;&#37325;&#26032;&#23433;&#35013;&#20449;&#20219;&#30340;&#20013;&#20171;&#26469;&#20943;&#36731;&#36829;&#32422;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;
A blockchain replaces central counterparties with time-consuming consensus protocols to record the transfer of ownership. This settlement latency slows cross-exchange trading, exposing arbitrageurs to price risk. Off-chain settlement, instead, exposes arbitrageurs to costly default risk. We show with Bitcoin network and order book data that cross-exchange price differences coincide with periods of high settlement latency, asset flows chase arbitrage opportunities, and price differences across exchanges with low default risk are smaller. Blockchain-based trading thus faces a dilemma: Reliable consensus protocols require time-consuming settlement latency, leading to arbitrage limits. Circumventing such arbitrage costs is possible only by reinstalling trusted intermediation, which mitigates default risk.
&lt;/p&gt;</description></item></channel></rss>