<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#25463;&#20811;&#20892;&#19994;&#29983;&#20135;&#20013;&#20943;&#23569;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30340;&#38382;&#39064;&#65292;&#20998;&#26512;&#20102;2000-2015&#24180;&#21508;&#20892;&#19994;&#20998;&#25903;&#26426;&#26500;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30340;&#21160;&#24577;&#21464;&#21270;&#24182;&#25552;&#20986;&#20102;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>http://arxiv.org/abs/2305.13253</link><description>&lt;p&gt;
&#30740;&#31350;&#25463;&#20811;&#20892;&#19994;&#29983;&#20135;&#20013;&#20943;&#23569;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Study of the problem of reducing greenhouse gas emissions in agricultural production Czech Republic. (arXiv:2305.13253v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.13253
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#25463;&#20811;&#20892;&#19994;&#29983;&#20135;&#20013;&#20943;&#23569;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30340;&#38382;&#39064;&#65292;&#20998;&#26512;&#20102;2000-2015&#24180;&#21508;&#20892;&#19994;&#20998;&#25903;&#26426;&#26500;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30340;&#21160;&#24577;&#21464;&#21270;&#24182;&#25552;&#20986;&#20102;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20892;&#19994;&#29983;&#20135;&#26159;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30340;&#20027;&#35201;&#26469;&#28304;&#65292;&#22240;&#27492;&#23545;&#20840;&#29699;&#21464;&#26262;&#30340;&#21160;&#24577;&#21464;&#21270;&#26377;&#24456;&#22823;&#24433;&#21709;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#25463;&#20811;&#20892;&#19994;&#29983;&#20135;&#32773;&#22312;&#20943;&#23569;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#26041;&#38754;&#38754;&#20020;&#30340;&#38382;&#39064;&#12290;&#20316;&#32773;&#20998;&#26512;&#20102;2000-2015&#24180;&#21508;&#20892;&#19994;&#20998;&#25903;&#26426;&#26500;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30340;&#21160;&#24577;&#21464;&#21270;&#12290;&#20316;&#32773;&#25552;&#20986;&#20102;t-&#21327;&#26041;&#24046;&#31995;&#25968;&#65292;&#29992;&#20110;&#30830;&#23450;&#32473;&#23450;&#34920;&#26684;&#23439;&#35266;&#32463;&#27982;&#25351;&#26631;&#30340;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#12290;&#35813;&#25351;&#26631;&#21487;&#20998;&#26512;&#19981;&#20855;&#26377;&#27491;&#24577;&#20998;&#24067;&#30340;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#38388;&#30340;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#12290;&#22312;&#32463;&#27982;&#20840;&#29699;&#21270;&#21644;&#21508;&#22269;&#38656;&#35201;&#24212;&#23545;&#20840;&#29699;&#21464;&#26262;&#30340;&#32972;&#26223;&#19979;&#65292;&#39318;&#35201;&#29983;&#20135;&#26368;&#22823;&#38468;&#21152;&#20540;&#21644;&#26368;&#23567;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30340;&#20892;&#20135;&#21697;&#26159;&#26377;&#24847;&#20041;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Agricultural production is the main source of greenhouse gas emissions, and therefore it has a great influence on the dynamics of changes in global warming. The article investigated the problems faced by Czech agricultural producers on the way to reduce greenhouse gas emissions. The author analyzed the dynamics of greenhouse gas emissions by various branches of agriculture for the period 2000-2015. The author proposed the coefficient t -covariances to determine the interdependence of the given tabular macroeconomic values. This indicator allows you to analyze the interdependence of macroeconomic variables that do not have a normal distribution. In the context of the globalization of the economy and the need to combat global warming in each country, it makes sense to produce primarily agricultural products that provide maximum added value with maximum greenhouse gas emissions.
&lt;/p&gt;</description></item><item><title>&#20171;&#32461;&#20102;&#19968;&#31181;&#26080;&#38656;&#31532;&#19977;&#26041;&#30340;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#39044;&#27979;&#26041;&#27861;&#8212;&#8212;Pathfinder&#65292;&#21033;&#29992;&#27604;&#29305;&#24065;&#21306;&#22359;&#38142;&#21644;&#20998;&#25955;&#24335;&#32593;&#32476;&#25552;&#20379;&#20934;&#30830;&#12289;&#38450;&#31713;&#25913;&#30340;&#20215;&#26684;&#25968;&#25454;&#12290;</title><link>http://arxiv.org/abs/2305.13227</link><description>&lt;p&gt;
&#26080;&#38656;&#20449;&#20219;&#30340;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#39044;&#27979;&#65306;Pathfinder&#12290;
&lt;/p&gt;
&lt;p&gt;
Trustless Price Feeds of Cryptocurrencies: Pathfinder. (arXiv:2305.13227v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.13227
&lt;/p&gt;
&lt;p&gt;
&#20171;&#32461;&#20102;&#19968;&#31181;&#26080;&#38656;&#31532;&#19977;&#26041;&#30340;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#39044;&#27979;&#26041;&#27861;&#8212;&#8212;Pathfinder&#65292;&#21033;&#29992;&#27604;&#29305;&#24065;&#21306;&#22359;&#38142;&#21644;&#20998;&#25955;&#24335;&#32593;&#32476;&#25552;&#20379;&#20934;&#30830;&#12289;&#38450;&#31713;&#25913;&#30340;&#20215;&#26684;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35777;&#21048;&#20215;&#26684;&#39044;&#27979;&#26159;&#35768;&#22810;&#37329;&#34701;&#26381;&#21153;&#30340;&#20851;&#38190;&#32452;&#25104;&#37096;&#20998;&#65292;&#23427;&#20801;&#35768;&#25269;&#25276;&#21697;&#28165;&#31639;&#12289;&#20445;&#35777;&#37329;&#20132;&#26131;&#12289;&#34893;&#29983;&#21697;&#23450;&#20215;&#31561;&#12290;&#38543;&#30528;&#21306;&#22359;&#38142;&#25216;&#26415;&#30340;&#20986;&#29616;&#65292;&#25253;&#36947;&#20934;&#30830;&#20215;&#26684;&#30340;&#20215;&#20540;&#21464;&#24471;&#26126;&#26174;&#65292;&#32780;&#19981;&#38656;&#35201;&#31532;&#19977;&#26041;&#12290;&#24050;&#32463;&#26377;&#35768;&#22810;&#23581;&#35797;&#35745;&#31639;&#20215;&#26684;&#32780;&#19981;&#38656;&#35201;&#31532;&#19977;&#26041;&#30340;&#23581;&#35797;&#65292;&#20294;&#27599;&#20010;&#23581;&#35797;&#37117;&#34987;&#19968;&#20010;&#20154;&#20026;&#25423;&#36896;&#20215;&#26684;&#30340;&#25915;&#20987;&#32773;&#25152;&#21033;&#29992;&#12290;&#38543;&#30528;&#26356;&#22810;&#30340;&#25968;&#25454;&#28304;&#21442;&#19982;&#25253;&#21578;&#20215;&#26684;&#65292;&#36895;&#24230;&#21644;&#23433;&#20840;&#20043;&#38388;&#23384;&#22312;&#26435;&#34913;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21033;&#29992;&#27604;&#29305;&#24065;&#21306;&#22359;&#38142;&#21644;&#19968;&#20010;&#20998;&#25955;&#24335;&#32593;&#32476;&#30340;&#39044;&#27979;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#19981;&#38656;&#35201;&#20013;&#22830;&#26426;&#26500;&#24182;&#30830;&#20445;&#20215;&#26684;&#39044;&#27979;&#19981;&#20250;&#34987;&#25805;&#32437;&#12290;&#25105;&#20204;&#36890;&#36807;&#23454;&#39564;&#21644;&#27169;&#25311;&#23637;&#31034;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Price feeds of securities is a critical component for many financial services, allowing for collateral liquidation, margin trading, derivative pricing and more. With the advent of blockchain technology, value in reporting accurate prices without a third party has become apparent. There have been many attempts at trying to calculate prices without a third party, in which each of these attempts have resulted in being exploited by an exploiter artificially inflating the price. The industry has then shifted to a more centralized design, fetching price data from multiple centralized sources and then applying statistical methods to reach a consensus price. Even though this strategy is secure compared to reading from a single source, enough number of sources need to report to be able to apply statistical methods. As more sources participate in reporting the price, the feed gets more secure with the slowest feed becoming the bottleneck for query response time, introducing a tradeoff between se
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25506;&#31350;&#20102;&#21464;&#38761;&#39046;&#23548;&#22914;&#20309;&#36890;&#36807;&#24341;&#36215;&#22242;&#38431;&#25104;&#21592;&#21464;&#21270;&#26469;&#24433;&#21709;&#22242;&#38431;&#27969;&#31243;&#65292;&#21457;&#29616;&#26222;&#36890;&#39046;&#23548;&#19982;&#22242;&#38431;&#27969;&#31243;&#12289;&#21464;&#38761;&#39046;&#23548;&#19982;&#22242;&#38431;&#25104;&#21592;&#21464;&#21270;&#12289;&#22242;&#38431;&#25104;&#21592;&#21464;&#21270;&#19982;&#22242;&#38431;&#27969;&#31243;&#20043;&#38388;&#23384;&#22312;&#26174;&#33879;&#30340;&#27491;&#21521;&#20851;&#31995;&#65292;&#24182;&#21457;&#29616;&#22242;&#38431;&#25104;&#21592;&#21464;&#21270;&#22312;&#21464;&#38761;&#39046;&#23548;&#21644;&#22242;&#38431;&#27969;&#31243;&#20043;&#38388;&#20855;&#26377;&#20013;&#20171;&#20316;&#29992;&#12290;</title><link>http://arxiv.org/abs/2305.13121</link><description>&lt;p&gt;
&#26222;&#36890;&#39046;&#23548;&#19982;&#21464;&#38761;&#39046;&#23548;&#20043;&#38388;&#30340;&#20851;&#31995;&#65306;&#24314;&#31569;&#22242;&#38431;&#20013;&#21464;&#38761;&#39046;&#23548;&#19982;&#22242;&#38431;&#25104;&#21592;&#21464;&#21270;&#30340;&#25506;&#31350;
&lt;/p&gt;
&lt;p&gt;
The Missing Link: Exploring the Relationship Between Transformational Leadership and Change in team members in Construction. (arXiv:2305.13121v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.13121
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25506;&#31350;&#20102;&#21464;&#38761;&#39046;&#23548;&#22914;&#20309;&#36890;&#36807;&#24341;&#36215;&#22242;&#38431;&#25104;&#21592;&#21464;&#21270;&#26469;&#24433;&#21709;&#22242;&#38431;&#27969;&#31243;&#65292;&#21457;&#29616;&#26222;&#36890;&#39046;&#23548;&#19982;&#22242;&#38431;&#27969;&#31243;&#12289;&#21464;&#38761;&#39046;&#23548;&#19982;&#22242;&#38431;&#25104;&#21592;&#21464;&#21270;&#12289;&#22242;&#38431;&#25104;&#21592;&#21464;&#21270;&#19982;&#22242;&#38431;&#27969;&#31243;&#20043;&#38388;&#23384;&#22312;&#26174;&#33879;&#30340;&#27491;&#21521;&#20851;&#31995;&#65292;&#24182;&#21457;&#29616;&#22242;&#38431;&#25104;&#21592;&#21464;&#21270;&#22312;&#21464;&#38761;&#39046;&#23548;&#21644;&#22242;&#38431;&#27969;&#31243;&#20043;&#38388;&#20855;&#26377;&#20013;&#20171;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#26088;&#22312;&#30740;&#31350;&#21464;&#38761;&#39046;&#23548;&#22914;&#20309;&#36890;&#36807;&#22242;&#38431;&#25104;&#21592;&#21464;&#21270;&#24433;&#21709;&#22242;&#38431;&#27969;&#31243;&#12290;&#30740;&#31350;&#36890;&#36807;&#21521;&#38463;&#24067;&#36158;&#21644;&#21345;&#26460;&#32435;&#30340;&#24314;&#31569;&#39033;&#30446;&#22242;&#38431;&#25104;&#21592;&#20998;&#21457;&#33258;&#25105;&#31649;&#29702;&#38382;&#21367;&#65292;&#21033;&#29992;&#32479;&#35745;&#20998;&#26512;&#25581;&#31034;&#20102;&#26222;&#36890;&#39046;&#23548;&#21644;&#22242;&#38431;&#27969;&#31243;&#12289;&#21464;&#38761;&#39046;&#23548;&#21644;&#22242;&#38431;&#25104;&#21592;&#21464;&#21270;&#12289;&#22242;&#38431;&#25104;&#21592;&#21464;&#21270;&#21644;&#22242;&#38431;&#27969;&#31243;&#20043;&#38388;&#23384;&#22312;&#26126;&#26174;&#27491;&#21521;&#20851;&#31995;&#65292;&#21464;&#38761;&#39046;&#23548;&#19982;&#22242;&#38431;&#27969;&#31243;&#20043;&#38388;&#23384;&#22312;&#20013;&#20171;&#20316;&#29992;&#30340;&#22242;&#38431;&#25104;&#21592;&#21464;&#21270;&#12290;&#26410;&#26469;&#30340;&#30740;&#31350;&#24212;&#32771;&#34385;&#25991;&#21270;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study aimed to investigate how transformational leadership affects team processes, mediated by change in team members. A self-administered questionnaire was distributed to construction project team members in Abuja and Kaduna, and statistical analysis revealed a significant positive relationship between transformational leadership and team processes, transformational leadership and change in team members, changes in team members and team processes, and changes in team members mediating the relationship between transformational leadership and team processes. Future studies should consider cultural differences.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21457;&#29616;&#65292;&#36890;&#36807;&#23454;&#26045;&#20840;&#38754;&#36136;&#37327;&#31649;&#29702;&#30340;&#23454;&#36341;&#65292;&#22914;&#39640;&#31649;&#25215;&#35834;&#12289;&#25945;&#32946;&#21644;&#22521;&#35757;&#12289;&#36807;&#31243;&#25511;&#21046;&#20197;&#21450;&#25345;&#32493;&#25913;&#36827;&#65292;&#21487;&#20197;&#25552;&#39640;&#32452;&#32455;&#30340;&#32489;&#25928;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2305.13104</link><description>&lt;p&gt;
&#32452;&#32455;&#21644;&#24314;&#35774;&#21331;&#36234;&#30340;&#20851;&#38190;&#65306;&#20840;&#38754;&#36136;&#37327;&#31649;&#29702;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
The Key to Organizational and construction Excellence: A Study of Total Quality Management. (arXiv:2305.13104v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.13104
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21457;&#29616;&#65292;&#36890;&#36807;&#23454;&#26045;&#20840;&#38754;&#36136;&#37327;&#31649;&#29702;&#30340;&#23454;&#36341;&#65292;&#22914;&#39640;&#31649;&#25215;&#35834;&#12289;&#25945;&#32946;&#21644;&#22521;&#35757;&#12289;&#36807;&#31243;&#25511;&#21046;&#20197;&#21450;&#25345;&#32493;&#25913;&#36827;&#65292;&#21487;&#20197;&#25552;&#39640;&#32452;&#32455;&#30340;&#32489;&#25928;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20840;&#38754;&#36136;&#37327;&#31649;&#29702;&#65288;TQM&#65289;&#23454;&#36341;&#23545;&#32452;&#32455;&#32489;&#25928;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;TQM&#23454;&#36341;&#22914;&#39640;&#31649;&#25215;&#35834;&#12289;&#25945;&#32946;&#21644;&#22521;&#35757;&#12289;&#36807;&#31243;&#25511;&#21046;&#20197;&#21450;&#25345;&#32493;&#25913;&#36827;&#31561;&#19982;&#22914;&#20309;&#21033;&#29992;&#36825;&#20123;&#23454;&#36341;&#26469;&#25552;&#39640;&#32489;&#25928;&#32467;&#26524;&#20043;&#38388;&#23384;&#22312;&#26174;&#33879;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study examines the impact of Total Quality Management (TQM) practices on organizational outcomes. Results show a significant relationship between TQM practices such as top executive commitment, education and teaching, process control, and continuous progress, and how they can be leveraged to enhance performance outcomes.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#36328;&#22269;&#20225;&#19994;&#25152;&#26377;&#26435;&#38142;&#22312;&#36328;&#36234;&#22269;&#23478;&#36793;&#30028;&#30340;&#25511;&#21046;&#20013;&#25152;&#25198;&#28436;&#30340;&#35282;&#33394;&#65292;&#21457;&#29616;&#22823;&#22810;&#25968;&#22806;&#22269;&#23376;&#20844;&#21496;&#37117;&#26159;&#36890;&#36807;&#25152;&#26377;&#26435;&#38142;&#34987;&#27597;&#20844;&#21496;&#25511;&#21046;&#30340;&#65292;&#35770;&#25991;&#25552;&#20986;&#20102;&#19982;&#27492;&#30456;&#20851;&#30340;&#29702;&#35770;&#27169;&#22411;&#26469;&#35299;&#37322;&#36825;&#19968;&#29616;&#35937;&#12290;</title><link>http://arxiv.org/abs/2305.12857</link><description>&lt;p&gt;
&#36328;&#22269;&#20225;&#19994;&#20013;&#30340;&#25152;&#26377;&#26435;&#38142;
&lt;/p&gt;
&lt;p&gt;
Ownership Chains in Multinational Enterprises. (arXiv:2305.12857v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.12857
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#36328;&#22269;&#20225;&#19994;&#25152;&#26377;&#26435;&#38142;&#22312;&#36328;&#36234;&#22269;&#23478;&#36793;&#30028;&#30340;&#25511;&#21046;&#20013;&#25152;&#25198;&#28436;&#30340;&#35282;&#33394;&#65292;&#21457;&#29616;&#22823;&#22810;&#25968;&#22806;&#22269;&#23376;&#20844;&#21496;&#37117;&#26159;&#36890;&#36807;&#25152;&#26377;&#26435;&#38142;&#34987;&#27597;&#20844;&#21496;&#25511;&#21046;&#30340;&#65292;&#35770;&#25991;&#25552;&#20986;&#20102;&#19982;&#27492;&#30456;&#20851;&#30340;&#29702;&#35770;&#27169;&#22411;&#26469;&#35299;&#37322;&#36825;&#19968;&#29616;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36328;&#36234;&#19981;&#21516;&#22269;&#23478;&#36793;&#30028;&#30340;&#36328;&#22269;&#20225;&#19994;&#25152;&#21457;&#23637;&#30340;&#25152;&#26377;&#26435;&#38142;&#30340;&#20316;&#29992;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35777;&#26126;&#27597;&#20844;&#21496;&#36890;&#36807;&#28041;&#21450;&#33267;&#23569;&#20004;&#20010;&#22269;&#23478;&#27839;&#25152;&#26377;&#26435;&#38142;&#30340;&#38388;&#25509;&#25511;&#21046;&#20851;&#31995;&#25511;&#21046;&#20102;&#22823;&#22810;&#25968;&#65288;58%&#65289;&#30340;&#22806;&#22269;&#23376;&#20844;&#21496;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#20551;&#35774;&#25152;&#26377;&#26435;&#38142;&#19978;&#30340;&#20301;&#32622;&#21463;&#21040;&#20256;&#36755;&#31649;&#29702;&#20915;&#31574;&#25152;&#38656;&#30340;&#27807;&#36890;&#25104;&#26412;&#30340;&#24433;&#21709;&#12290;&#19982;&#25903;&#25345;&#30340;&#35777;&#25454;&#19968;&#33268;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#26377;&#20851;&#20844;&#21496;&#25511;&#21046;&#31454;&#20105;&#30340;&#29702;&#35770;&#27169;&#22411;&#65292;&#32771;&#34385;&#21040;&#21407;&#22987;&#22269;&#23478;&#30340;&#27597;&#20844;&#21496;&#21487;&#20197;&#23558;&#20854;&#23545;&#26368;&#32456;&#23376;&#20844;&#21496;&#30340;&#30417;&#35270;&#27963;&#21160;&#22996;&#25176;&#32473;&#20301;&#20110;&#20013;&#38388;&#21496;&#27861;&#31649;&#36758;&#21306;&#30340;&#20013;&#38388;&#20844;&#21496;&#23376;&#20844;&#21496;&#30340;&#21487;&#33021;&#24615;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#25552;&#20379;&#20102;&#19968;&#20010;&#20004;&#27493;&#23454;&#35777;&#31574;&#30053;&#65292;&#21253;&#25324;&#20004;&#20010;&#37325;&#21147;&#26041;&#31243;&#65306;i) &#19968;&#20010;&#19977;&#35282;&#24418;&#30340;&#37325;&#21147;&#26041;&#31243;&#65292;&#29992;&#20110;&#30830;&#23450;&#27597;&#20844;&#21496;&#30340;&#20013;&#38388;&#20844;&#21496;&#65292;&#22312;&#30830;&#23450;&#26368;&#32456;&#25237;&#36164;&#20301;&#32622;&#30340;&#26465;&#20214;&#19979;&#65307;ii) &#32463;&#20856;&#30340;&#37325;&#21147;&#26041;&#31243;&#65292;&#29992;&#20110;&#30830;&#23450;&#26368;&#32456;&#23376;&#20844;&#21496;&#25152;&#22312;&#30340;&#30446;&#26631;&#22269;&#23478;&#65292;&#32771;&#34385;&#21040;&#20013;&#38388;&#20844;&#21496;&#30340;&#22320;&#29702;&#20301;&#32622;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this contribution, we investigate the role of ownership chains developed by multinational enterprises across different national borders. First, we document that parent companies control a majority (58%) of foreign subsidiaries through indirect control relationships involving at least two countries along an ownership chain. Therefore, we hypothesize that locations along ownership chains are driven by the existence of communication costs to transmit management decisions. In line with motivating evidence, we develop a theoretical model for competition on corporate control that considers the possibility that parent companies in the origin countries can delegate their monitoring activities in final subsidiaries to middlemen subsidiaries that are located in intermediate jurisdictions. Our model returns us a two-step empirical strategy with two gravity equations: i) a triangular gravity for establishing a middleman by the parent, conditional on final investments' locations; ii) a classical
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#20351;&#29992;VBA&#21019;&#24314;&#30340;&#20223;&#30495;&#36719;&#20214;&#32452;&#20214;&#65292;&#21487;&#29992;&#20110;&#21019;&#24314;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#12290;&#36825;&#21253;&#25324;Markowitz&#30340;&#32463;&#20856;&#26041;&#27861;&#21644;El-Khatib&#21644;Hatemi-J&#24320;&#21457;&#30340;&#26041;&#27861;&#65292;&#21518;&#32773;&#23558;&#39118;&#38505;&#21644;&#22238;&#25253;&#30452;&#25509;&#32467;&#21512;&#22312;&#20248;&#21270;&#38382;&#39064;&#20013;&#12290;&#36719;&#20214;&#21253;&#22312;&#30830;&#23450;&#25237;&#36164;&#32452;&#21512;&#20013;&#36164;&#20135;&#25968;&#37327;&#26041;&#38754;&#25552;&#20379;&#20102;&#20248;&#21183;&#12290;</title><link>http://arxiv.org/abs/2305.12826</link><description>&lt;p&gt;
&#25903;&#25345;&#37329;&#34701;&#23398;&#29983;&#26500;&#24314;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#30340;VBA&#20223;&#30495;&#36719;&#20214;&#21253;
&lt;/p&gt;
&lt;p&gt;
A Simulation Package in VBA to Support Finance Students for Constructing Optimal Portfolios. (arXiv:2305.12826v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.12826
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#20351;&#29992;VBA&#21019;&#24314;&#30340;&#20223;&#30495;&#36719;&#20214;&#32452;&#20214;&#65292;&#21487;&#29992;&#20110;&#21019;&#24314;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#12290;&#36825;&#21253;&#25324;Markowitz&#30340;&#32463;&#20856;&#26041;&#27861;&#21644;El-Khatib&#21644;Hatemi-J&#24320;&#21457;&#30340;&#26041;&#27861;&#65292;&#21518;&#32773;&#23558;&#39118;&#38505;&#21644;&#22238;&#25253;&#30452;&#25509;&#32467;&#21512;&#22312;&#20248;&#21270;&#38382;&#39064;&#20013;&#12290;&#36719;&#20214;&#21253;&#22312;&#30830;&#23450;&#25237;&#36164;&#32452;&#21512;&#20013;&#36164;&#20135;&#25968;&#37327;&#26041;&#38754;&#25552;&#20379;&#20102;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#20351;&#29992;Visual Basic for Applications (VBA)&#21019;&#24314;&#30340;&#36719;&#20214;&#32452;&#20214;&#65292;&#21487;&#29992;&#20110;&#20351;&#29992;&#20004;&#31181;&#19981;&#21516;&#26041;&#27861;&#21019;&#24314;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#12290;&#31532;&#19968;&#31181;&#26041;&#27861;&#26159;Markowitz&#30340;&#32463;&#20856;&#26041;&#27861;&#65292;&#22522;&#20110;&#36890;&#36807;&#26368;&#23567;&#21270;&#25237;&#36164;&#32452;&#21512;&#30340;&#26041;&#24046;&#26469;&#23547;&#27714;&#39044;&#31639;&#20221;&#39069;&#12290;&#31532;&#20108;&#31181;&#26041;&#27861;&#26159;&#30001;El-Khatib&#21644;Hatemi-J&#24320;&#21457;&#30340;&#65292;&#30452;&#25509;&#22312;&#20248;&#21270;&#38382;&#39064;&#20013;&#32467;&#21512;&#39118;&#38505;&#21644;&#22238;&#25253;&#65292;&#24471;&#20986;&#39044;&#31639;&#20221;&#39069;&#65292;&#20197;&#23454;&#29616;&#25237;&#36164;&#32452;&#21512;&#30340;&#39118;&#38505;&#35843;&#25972;&#22238;&#25253;&#26368;&#22823;&#21270;&#12290;&#35813;&#26041;&#27861;&#31526;&#21512;&#29702;&#24615;&#25237;&#36164;&#32773;&#30340;&#26399;&#26395;&#65292;&#22240;&#20026;&#36825;&#20123;&#25237;&#36164;&#32773;&#23558;&#39118;&#38505;&#21644;&#22238;&#25253;&#35270;&#20026;&#36873;&#25321;&#25237;&#36164;&#36164;&#20135;&#30340;&#22522;&#26412;&#20381;&#25454;&#12290;&#25105;&#20204;&#30340;&#36719;&#20214;&#21253;&#36824;&#25552;&#20379;&#20102;&#36890;&#24120;&#22312;&#25991;&#29486;&#20013;&#34987;&#24573;&#30053;&#30340;&#21478;&#19968;&#20010;&#20248;&#28857;&#65292;&#21363;&#24212;&#21253;&#25324;&#22312;&#25237;&#36164;&#32452;&#21512;&#20013;&#30340;&#36164;&#20135;&#25968;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper introduces a software component created in Visual Basic for Applications (VBA) that can be applied for creating an optimal portfolio using two different methods. The first method is the seminal approach of Markowitz that is based on finding budget shares via the minimization of the variance of the underlying portfolio. The second method is developed by El-Khatib and Hatemi-J, which combines risk and return directly in the optimization problem and yields budget shares that lead to maximizing the risk adjusted return of the portfolio. This approach is consistent with the expectation of rational investors since these investors consider both risk and return as the fundamental basis for selection of the investment assets. Our package offers another advantage that is usually neglected in the literature, which is the number of assets that should be included in the portfolio. The common practice is to assume that the number of assets is given exogenously when the portfolio is constr
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;GPT&#22312;&#32463;&#27982;&#29702;&#24615;&#26041;&#38754;&#30340;&#33021;&#21147;&#65292;&#36890;&#36807;&#25351;&#31034;&#20854;&#22312;4&#20010;&#39046;&#22495;&#20013;&#20570;&#20986;&#39044;&#31639;&#20915;&#31574;&#65292;&#21457;&#29616;GPT&#20915;&#31574;&#22522;&#26412;&#19978;&#26159;&#21512;&#29702;&#30340;&#65292;&#24182;&#19988;&#27604;&#20154;&#31867;&#26356;&#20855;&#26377;&#29702;&#24615;&#12290;</title><link>http://arxiv.org/abs/2305.12763</link><description>&lt;p&gt;
GPT&#30340;&#32463;&#27982;&#29702;&#24615;&#20986;&#29616;
&lt;/p&gt;
&lt;p&gt;
The Emergence of Economic Rationality of GPT. (arXiv:2305.12763v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.12763
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;GPT&#22312;&#32463;&#27982;&#29702;&#24615;&#26041;&#38754;&#30340;&#33021;&#21147;&#65292;&#36890;&#36807;&#25351;&#31034;&#20854;&#22312;4&#20010;&#39046;&#22495;&#20013;&#20570;&#20986;&#39044;&#31639;&#20915;&#31574;&#65292;&#21457;&#29616;GPT&#20915;&#31574;&#22522;&#26412;&#19978;&#26159;&#21512;&#29702;&#30340;&#65292;&#24182;&#19988;&#27604;&#20154;&#31867;&#26356;&#20855;&#26377;&#29702;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#20687;GPT&#36825;&#26679;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#36234;&#26469;&#36234;&#26222;&#36941;&#65292;&#35780;&#20272;&#23427;&#20204;&#22312;&#35821;&#35328;&#22788;&#29702;&#20043;&#22806;&#30340;&#33021;&#21147;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#25991;&#36890;&#36807;&#25351;&#31034;GPT&#22312;&#39118;&#38505;&#12289;&#26102;&#38388;&#12289;&#31038;&#20132;&#21644;&#39135;&#21697;&#20559;&#22909;&#30340;&#22235;&#20010;&#39046;&#22495;&#20013;&#36827;&#34892;&#39044;&#31639;&#20915;&#31574;&#26469;&#30740;&#31350;GPT&#30340;&#32463;&#27982;&#29702;&#24615;&#12290;&#25105;&#20204;&#36890;&#36807;&#35780;&#20272;GPT&#20915;&#31574;&#19982;&#21476;&#20856;&#25581;&#31034;&#20559;&#22909;&#29702;&#35770;&#20013;&#30340;&#25928;&#29992;&#26368;&#22823;&#21270;&#19968;&#33268;&#24615;&#26469;&#34913;&#37327;&#32463;&#27982;&#29702;&#24615;&#12290;&#25105;&#20204;&#21457;&#29616;GPT&#22312;&#27599;&#20010;&#39046;&#22495;&#30340;&#20915;&#31574;&#22522;&#26412;&#19978;&#26159;&#21512;&#29702;&#30340;&#65292;&#24182;&#19988;&#34920;&#29616;&#20986;&#27604;&#25991;&#29486;&#25253;&#36947;&#30340;&#20154;&#31867;&#26356;&#39640;&#30340;&#29702;&#24615;&#24471;&#20998;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#29702;&#24615;&#24471;&#20998;&#23545;&#20110;&#38543;&#26426;&#31243;&#24230;&#21644;&#20154;&#21475;&#32479;&#35745;&#23398;&#35774;&#32622;&#65288;&#22914;&#24180;&#40836;&#21644;&#24615;&#21035;&#65289;&#26159;&#31283;&#20581;&#30340;&#65292;&#20294;&#23545;&#22522;&#20110;&#36873;&#25321;&#24773;&#22659;&#30340;&#35821;&#35328;&#26694;&#26550;&#30340;&#19978;&#19979;&#25991;&#25935;&#24863;&#12290;&#36825;&#20123;&#32467;&#26524;&#34920;&#26126;&#20102;LLM&#20316;&#20986;&#33391;&#22909;&#20915;&#31574;&#30340;&#28508;&#21147;&#65292;&#20197;&#21450;&#38656;&#35201;&#36827;&#19968;&#27493;&#20102;&#35299;&#23427;&#20204;&#30340;&#33021;&#21147;&#12289;&#23616;&#38480;&#24615;&#21644;&#22522;&#26412;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
As large language models (LLMs) like GPT become increasingly prevalent, it is essential that we assess their capabilities beyond language processing. This paper examines the economic rationality of GPT by instructing it to make budgetary decisions in four domains: risk, time, social, and food preferences. We measure economic rationality by assessing the consistency of GPT decisions with utility maximization in classic revealed preference theory. We find that GPT decisions are largely rational in each domain and demonstrate higher rationality scores than those of humans reported in the literature. We also find that the rationality scores are robust to the degree of randomness and demographic settings such as age and gender, but are sensitive to contexts based on the language frames of the choice situations. These results suggest the potential of LLMs to make good decisions and the need to further understand their capabilities, limitations, and underlying mechanisms.
&lt;/p&gt;</description></item><item><title>OpenAI&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;ChatGPT&#30340;&#25512;&#20986;&#23545;&#20154;&#24037;&#26234;&#33021;&#30456;&#20851;&#21152;&#23494;&#36164;&#20135;&#20135;&#29983;&#20102;&#26174;&#33879;&#24433;&#21709;&#65292;&#36825;&#34920;&#29616;&#20026;&#20854;&#24179;&#22343;&#22238;&#25253;&#29575;&#30340;&#25552;&#39640;&#65292;&#32780;&#35895;&#27468;&#25628;&#32034;&#37327;&#21017;&#25104;&#20026;&#20102;&#36825;&#20123;&#36164;&#20135;&#23450;&#20215;&#30340;&#37325;&#35201;&#25351;&#26631;&#12290;</title><link>http://arxiv.org/abs/2305.12739</link><description>&lt;p&gt;
ChatGPT&#23545;&#20154;&#24037;&#26234;&#33021;&#30456;&#20851;&#21152;&#23494;&#36164;&#20135;&#30340;&#24433;&#21709;&#65306;&#22522;&#20110;&#21512;&#25104;&#25511;&#21046;&#20998;&#26512;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
The Influence of ChatGPT on Artificial Intelligence Related Crypto Assets: Evidence from a Synthetic Control Analysis. (arXiv:2305.12739v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.12739
&lt;/p&gt;
&lt;p&gt;
OpenAI&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;ChatGPT&#30340;&#25512;&#20986;&#23545;&#20154;&#24037;&#26234;&#33021;&#30456;&#20851;&#21152;&#23494;&#36164;&#20135;&#20135;&#29983;&#20102;&#26174;&#33879;&#24433;&#21709;&#65292;&#36825;&#34920;&#29616;&#20026;&#20854;&#24179;&#22343;&#22238;&#25253;&#29575;&#30340;&#25552;&#39640;&#65292;&#32780;&#35895;&#27468;&#25628;&#32034;&#37327;&#21017;&#25104;&#20026;&#20102;&#36825;&#20123;&#36164;&#20135;&#23450;&#20215;&#30340;&#37325;&#35201;&#25351;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
OpenAI&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;ChatGPT&#30340;&#25512;&#20986;&#65292;&#28608;&#21457;&#20102;&#25237;&#36164;&#32773;&#23545;&#20154;&#24037;&#26234;&#33021;&#25216;&#26415;&#30340;&#20851;&#27880;&#65292;&#21253;&#25324;&#19982;ChatGPT&#26080;&#30452;&#25509;&#20851;&#31995;&#30340;&#20154;&#24037;&#26234;&#33021;&#30456;&#20851;&#21152;&#23494;&#36164;&#20135;&#12290;&#21033;&#29992;&#21512;&#25104;&#24046;&#24322;&#20998;&#26512;&#26041;&#27861;&#65292;&#25105;&#20204;&#21457;&#29616;&#20102;&#26174;&#33879;&#30340;&#8220;ChatGPT&#25928;&#24212;&#8221;&#65292;AI&#30456;&#20851;&#21152;&#23494;&#36164;&#20135;&#30340;&#22238;&#25253;&#29575;&#22312;ChatGPT&#25512;&#20986;&#21518;&#19968;&#20010;&#26376;&#65288;&#20004;&#20010;&#26376;&#65289;&#26399;&#38388;&#32463;&#21382;&#20102;10.7&#65285;&#33267;15.6&#65285;&#65288;35.5&#65285;&#33267;41.3&#65285;&#65289;&#30340;&#24179;&#22343;&#22238;&#25253;&#12290;&#27492;&#22806;&#65292;&#35895;&#27468;&#25628;&#32034;&#37327;&#20316;&#20026;&#20154;&#24037;&#26234;&#33021;&#20851;&#27880;&#24230;&#30340;&#20195;&#29702;&#25351;&#26631;&#65292;&#25104;&#20026;ChatGPT&#25512;&#20986;&#21518;&#20854;&#21152;&#23494;&#36164;&#20135;&#23450;&#20215;&#30340;&#37325;&#35201;&#25351;&#26631;&#12290;&#25105;&#20204;&#24471;&#20986;&#32467;&#35770;&#65292;&#25237;&#36164;&#32773;&#35748;&#20026;&#22312;&#25512;&#20986;ChatGPT&#21518;&#65292;&#20154;&#24037;&#26234;&#33021;&#36164;&#20135;&#20855;&#26377;&#26356;&#39640;&#30340;&#28508;&#21147;&#25110;&#20215;&#20540;&#65292;&#20174;&#32780;&#23548;&#33268;&#20102;&#26356;&#39640;&#30340;&#24066;&#22330;&#20272;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
The introduction of OpenAI's large language model, ChatGPT, catalyzed investor attention towards artificial intelligence (AI) technologies, including AI-related crypto assets not directly related to ChatGPT. Utilizing the synthetic difference-in-difference methodology, we identify significant 'ChatGPT effects' with returns of AI-related crypto assets experiencing average returns ranging between 10.7% and 15.6% (35.5% to 41.3%) in the one-month (two-month) period after the ChatGPT launch. Furthermore, Google search volumes, a proxy for attention to AI, emerged as critical pricing indicators for AI-related crypto post-launch. We conclude that investors perceived AI-assets as possessing heightened potential or value after the launch, resulting in higher market valuations.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20102;&#20855;&#26377;&#26102;&#38388;&#30456;&#20851;&#24615;&#30340;&#26102;&#38388;&#24207;&#21015;&#30340;Wishart&#30697;&#38453;&#29305;&#24449;&#20540;&#20998;&#24067;&#12290;&#21457;&#29616;&#20854;&#22312;&#21452;&#37325;&#26631;&#24230;&#26497;&#38480;&#19979;&#25910;&#25947;&#20110;&#21464;&#24418;&#30340;MPD&#20998;&#24067;&#65292;&#20855;&#26377;&#27604;MPD&#26356;&#38271;&#30340;&#23614;&#37096;&#21644;&#26356;&#39640;&#30340;&#23792;&#20540;&#65292;&#24182;&#35777;&#26126;&#38543;&#26102;&#38388;&#30456;&#20851;&#24615;&#22686;&#21152;&#65292;&#20854;&#20108;&#38454;&#30697;&#20134;&#38543;&#20043;&#22686;&#21152;&#12290;&#24403;&#26102;&#38388;&#30456;&#20851;&#24615;&#20026;&#24130;&#34928;&#20943;&#26102;&#65292;&#20998;&#24067;&#23384;&#22312;&#30456;&#21464;&#65292;&#24403;&#24130;&#25351;&#25968;&#20026;$\gamma&gt;1/2$&#26102;&#65292;&#20998;&#24067;&#30340;&#31532;&#20108;&#30697;&#21644;&#26368;&#22823;&#29305;&#24449;&#20540;&#22343;&#20026;&#26377;&#38480;&#20540;&#65307;&#32780;&#24403;$\gamma\leq 1/2$&#26102;&#65292;&#20998;&#24067;&#30340;&#31532;&#20108;&#30697;&#21644;&#26368;&#22823;&#29305;&#24449;&#20540;&#22343;&#20026;&#26080;&#38480;&#12290;</title><link>http://arxiv.org/abs/2305.12632</link><description>&lt;p&gt;
&#30456;&#20851;&#26102;&#38388;&#24207;&#21015;&#30340;Marchenko-Pastur&#20998;&#24067;&#30340;&#21464;&#24418;
&lt;/p&gt;
&lt;p&gt;
Deformation of Marchenko-Pastur distribution for the correlated time series. (arXiv:2305.12632v1 [cond-mat.stat-mech])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.12632
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#20855;&#26377;&#26102;&#38388;&#30456;&#20851;&#24615;&#30340;&#26102;&#38388;&#24207;&#21015;&#30340;Wishart&#30697;&#38453;&#29305;&#24449;&#20540;&#20998;&#24067;&#12290;&#21457;&#29616;&#20854;&#22312;&#21452;&#37325;&#26631;&#24230;&#26497;&#38480;&#19979;&#25910;&#25947;&#20110;&#21464;&#24418;&#30340;MPD&#20998;&#24067;&#65292;&#20855;&#26377;&#27604;MPD&#26356;&#38271;&#30340;&#23614;&#37096;&#21644;&#26356;&#39640;&#30340;&#23792;&#20540;&#65292;&#24182;&#35777;&#26126;&#38543;&#26102;&#38388;&#30456;&#20851;&#24615;&#22686;&#21152;&#65292;&#20854;&#20108;&#38454;&#30697;&#20134;&#38543;&#20043;&#22686;&#21152;&#12290;&#24403;&#26102;&#38388;&#30456;&#20851;&#24615;&#20026;&#24130;&#34928;&#20943;&#26102;&#65292;&#20998;&#24067;&#23384;&#22312;&#30456;&#21464;&#65292;&#24403;&#24130;&#25351;&#25968;&#20026;$\gamma&gt;1/2$&#26102;&#65292;&#20998;&#24067;&#30340;&#31532;&#20108;&#30697;&#21644;&#26368;&#22823;&#29305;&#24449;&#20540;&#22343;&#20026;&#26377;&#38480;&#20540;&#65307;&#32780;&#24403;$\gamma\leq 1/2$&#26102;&#65292;&#20998;&#24067;&#30340;&#31532;&#20108;&#30697;&#21644;&#26368;&#22823;&#29305;&#24449;&#20540;&#22343;&#20026;&#26080;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#30001;&#20855;&#26377;&#26102;&#38388;&#30456;&#20851;&#24615;&#30340;&#26102;&#38388;&#24207;&#21015;&#21019;&#24314;&#30340;Wishart&#30697;&#38453;&#30340;&#29305;&#24449;&#20540;&#12290;&#24403;&#27809;&#26377;&#30456;&#20851;&#24615;&#26102;&#65292;Wishart&#30697;&#38453;&#30340;&#29305;&#24449;&#20540;&#20998;&#24067;&#22312;&#21452;&#37325;&#26631;&#24230;&#26497;&#38480;&#19979;&#34987;&#31216;&#20026;Marchenko-Pastur&#20998;&#24067;&#65288;MPD&#65289;&#12290;&#24403;&#23384;&#22312;&#26102;&#38388;&#30456;&#20851;&#24615;&#26102;&#65292;&#29305;&#24449;&#20540;&#20998;&#24067;&#25910;&#25947;&#21040;&#20855;&#26377;&#27604;MPD&#26356;&#38271;&#23614;&#21644;&#26356;&#39640;&#23792;&#30340;&#21464;&#24418;MPD&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#20998;&#24067;&#30340;&#30697;&#21644;&#25910;&#25947;&#21040;&#21464;&#24418;MPD&#30340;&#24773;&#20917;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#31532;&#20108;&#30697;&#38543;&#26102;&#38388;&#30456;&#20851;&#24615;&#22686;&#21152;&#32780;&#22686;&#21152;&#12290;&#24403;&#26102;&#38388;&#30456;&#20851;&#24615;&#26159;&#24130;&#34928;&#20943;&#26102;&#65292;&#25105;&#20204;&#21487;&#20197;&#30830;&#35748;&#30456;&#21464;&#12290;&#24403;&#24130;&#25351;&#25968;&#20026;$\gamma&gt;1/2$&#26102;&#65292;&#20998;&#24067;&#30340;&#31532;&#20108;&#30697;&#26159;&#26377;&#38480;&#30340;&#65292;&#24182;&#19988;&#26368;&#22823;&#29305;&#24449;&#20540;&#26159;&#26377;&#38480;&#30340;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#24403;$\gamma\leq 1/2$&#26102;&#65292;&#31532;&#20108;&#30697;&#26159;&#26080;&#38480;&#30340;&#65292;&#26368;&#22823;&#29305;&#24449;&#20540;&#26159;&#26080;&#38480;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the eigenvalue of the Wishart matrix which is created form the time series with the temporal correlation. When there is no correlation, the eigenvalue distribution of the Wishart matrix is known as the Marchenko-Pastur distribution (MPD) in the double scaling limit. When there is the temporal correlation, the eigenvalue distribution converges to the deformed MPD which has longer tail and higher peak than the MPD. We discuss the moments of the distribution and the convergence to the deformed MPD. We show the second moment increases as the temporal correlation increases. When the temporal correlation is the power decay, we can confirm the phase transition. When $\gamma&gt;1/2$ which is the power index, the second moment of the distribution is finite and the largest eigenvalue is finite. On the other hand, when $\gamma\leq 1/2$, the second moment is infinite and the maximum eigenvalue is infinite.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#22522;&#20110;VaR&#30340;&#25237;&#36164;&#32452;&#21512;&#20445;&#38505;&#31574;&#30053;&#65292;&#24182;&#23558;&#20854;&#19982;&#22522;&#20110;&#24658;&#23450;&#27604;&#20363;&#25237;&#36164;&#32452;&#21512;&#20445;&#38505;&#65288;CPPI&#65289;&#30340;&#31574;&#30053;&#36827;&#34892;&#27604;&#36739;&#12290;&#22312;&#22797;&#26434;&#24066;&#22330;&#20013;&#65292;VBPI&#34920;&#29616;&#26356;&#22909;&#65292;&#24182;&#22312;&#21160;&#33633;&#24066;&#22330;&#20013;&#34920;&#29616;&#20986;&#26356;&#22909;&#30340;&#25239;&#39118;&#38505;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2305.12539</link><description>&lt;p&gt;
&#22522;&#20110; Value-at-Risk&#65288;VaR&#65289;&#30340;&#32452;&#21512;&#20445;&#38505;&#31574;&#30053;&#19982; CPPI &#22312;&#39532;&#23572;&#31185;&#22827;&#35843;&#21046;&#30340; regime-switching &#24066;&#22330;&#30340;&#34920;&#29616;&#35780;&#20272;&#21644;&#22522;&#20934;&#27604;&#36739;
&lt;/p&gt;
&lt;p&gt;
Value-at-Risk-Based Portfolio Insurance: Performance Evaluation and Benchmarking Against CPPI in a Markov-Modulated Regime-Switching Market. (arXiv:2305.12539v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.12539
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#22522;&#20110;VaR&#30340;&#25237;&#36164;&#32452;&#21512;&#20445;&#38505;&#31574;&#30053;&#65292;&#24182;&#23558;&#20854;&#19982;&#22522;&#20110;&#24658;&#23450;&#27604;&#20363;&#25237;&#36164;&#32452;&#21512;&#20445;&#38505;&#65288;CPPI&#65289;&#30340;&#31574;&#30053;&#36827;&#34892;&#27604;&#36739;&#12290;&#22312;&#22797;&#26434;&#24066;&#22330;&#20013;&#65292;VBPI&#34920;&#29616;&#26356;&#22909;&#65292;&#24182;&#22312;&#21160;&#33633;&#24066;&#22330;&#20013;&#34920;&#29616;&#20986;&#26356;&#22909;&#30340;&#25239;&#39118;&#38505;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#29616;&#20195;&#37329;&#34701;&#24066;&#22330;&#30340;&#21608;&#26399;&#24615;&#29305;&#24449;&#21644;&#24066;&#22330;&#29615;&#22659;&#36716;&#25442;&#23548;&#33268;&#39044;&#26399;&#25237;&#36164;&#22238;&#25253;&#21644;&#39118;&#38505;&#21464;&#21270;&#30340;&#24773;&#20917;&#19979;&#65292;&#26412;&#25991;&#23558; Value-at-Risk&#65288;VaR&#65289;&#26041;&#27861;&#30340;&#24605;&#24819;&#24341;&#20837;&#32452;&#21512;&#20445;&#38505;&#31574;&#30053;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#32771;&#34385;&#24066;&#22330;&#35843;&#21046;&#30340; VaR &#31574;&#30053;&#12290;&#19982;&#19968;&#20010;&#22522;&#20110;&#24658;&#23450;&#27604;&#20363;&#25237;&#36164;&#32452;&#21512;&#20445;&#38505;&#65288;CPPI&#65289;&#30340;&#31574;&#30053;&#36827;&#34892;&#27604;&#36739;&#65292;&#32467;&#26524;&#34920;&#26126;&#22312;&#26356;&#20026;&#22797;&#26434;&#30340;&#24066;&#22330;&#29615;&#22659;&#19979;&#65292;VBPI &#33021;&#22815;&#26356;&#22909;&#22320;&#23454;&#26045;&#32452;&#21512;&#20445;&#38505;&#31574;&#30053;&#65292;&#24182;&#22312;&#21160;&#33633;&#24066;&#22330;&#20013;&#34920;&#29616;&#20986;&#26356;&#22909;&#30340;&#25269;&#24481;&#39118;&#38505;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
Designing dynamic portfolio insurance strategies under market conditions switching between two or more regimes is a challenging task in financial economics. Recently, a promising approach employing the value-at-risk (VaR) measure to assign weights to risky and riskless assets has been proposed in [Jiang C., Ma Y. and An Y. "The effectiveness of the VaR-based portfolio insurance strategy: An empirical analysis" , International Review of Financial Analysis 18(4) (2009): 185-197]. In their study, the risky asset follows a geometric Brownian motion with constant drift and diffusion coefficients. In this paper, we first extend their idea to a regime-switching framework in which the expected return of the risky asset and its volatility depend on an unobservable Markovian term which describes the cyclical nature of asset returns in modern financial markets. We then analyze and compare the resulting VaR-based portfolio insurance (VBPI) strategy with the well-known constant proportion portfolio
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#23454;&#29616;&#20102;&#36866;&#29992;&#20110;&#31038;&#20250;&#36131;&#20219;&#25237;&#36164;&#32773;&#30340;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#65292;&#36890;&#36807;&#32771;&#34385;&#29615;&#22659;&#12289;&#31038;&#20250;&#21644;&#31649;&#29702;&#24471;&#20998;&#26469;&#24179;&#34913;&#25237;&#36164;&#22799;&#26222;&#27604;&#29575;&#21644;&#31038;&#20250;&#36131;&#20219;&#22240;&#32032;&#12290;</title><link>http://arxiv.org/abs/2305.12364</link><description>&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#29992;&#20110;&#31038;&#20250;&#36131;&#20219;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
Machine Learning for Socially Responsible Portfolio Optimisation. (arXiv:2305.12364v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.12364
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#23454;&#29616;&#20102;&#36866;&#29992;&#20110;&#31038;&#20250;&#36131;&#20219;&#25237;&#36164;&#32773;&#30340;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#65292;&#36890;&#36807;&#32771;&#34385;&#29615;&#22659;&#12289;&#31038;&#20250;&#21644;&#31649;&#29702;&#24471;&#20998;&#26469;&#24179;&#34913;&#25237;&#36164;&#22799;&#26222;&#27604;&#29575;&#21644;&#31038;&#20250;&#36131;&#20219;&#22240;&#32032;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#20250;&#36131;&#20219;&#25237;&#36164;&#32773;&#24076;&#26395;&#22312;&#33719;&#24471;&#36130;&#21153;&#22238;&#25253;&#30340;&#21516;&#26102;&#20419;&#36827;&#31038;&#20250;&#21644;&#29615;&#22659;&#36827;&#27493;&#26469;&#26500;&#24314;&#25237;&#36164;&#32452;&#21512;&#12290;&#34429;&#28982;&#22343;&#20540;&#26041;&#24046;&#27169;&#22411;&#21487;&#20197;&#26681;&#25454;&#25237;&#36164;&#32773;&#30340;&#39118;&#38505;&#23481;&#24525;&#24230;&#25104;&#21151;&#22320;&#29983;&#25104;&#26368;&#39640;&#21487;&#33021;&#30340;&#22238;&#25253;&#65292;&#20294;&#35813;&#27169;&#22411;&#24182;&#27809;&#26377;&#20026;&#31038;&#20250;&#36131;&#20219;&#25237;&#36164;&#32773;&#20851;&#27880;&#30340;&#38468;&#21152;&#38480;&#21046;&#25552;&#20379;&#35268;&#23450;&#12290;&#20026;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#22312;&#31361;&#20986;&#22343;&#20540;&#26041;&#24046;&#27169;&#22411;&#30340;&#22522;&#30784;&#19978;&#65292;&#26412;&#30740;&#31350;&#23454;&#26045;&#20102;&#31038;&#20250;&#36131;&#20219;&#25237;&#36164;&#32773;&#30340;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#12290;&#25913;&#36827;&#21518;&#30340;&#22343;&#20540;&#26041;&#24046;&#27169;&#22411;&#20801;&#35768;&#31038;&#20250;&#36131;&#20219;&#25237;&#36164;&#32773;&#22312;&#24066;&#22330;&#19978;&#36827;&#20837;&#31454;&#20105;&#24615;&#31038;&#20250;&#36131;&#20219;&#25237;&#36164;&#32452;&#21512;&#65292;&#23613;&#31649;&#20182;&#20204;&#38754;&#20020;&#30528;&#25237;&#36164;&#22799;&#26222;&#27604;&#29575;&#21644;&#25237;&#36164;&#32452;&#21512;&#30340;&#24179;&#22343;&#29615;&#22659;&#12289;&#31038;&#20250;&#21644;&#31649;&#27835;&#20998;&#25968;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;
Socially responsible investors build investment portfolios intending to incite social and environmental advancement alongside a financial return. Although Mean-Variance (MV) models successfully generate the highest possible return based on an investor's risk tolerance, MV models do not make provisions for additional constraints relevant to socially responsible (SR) investors. In response to this problem, the MV model must consider Environmental, Social, and Governance (ESG) scores in optimisation. Based on the prominent MV model, this study implements portfolio optimisation for socially responsible investors. The amended MV model allows SR investors to enter markets with competitive SR portfolios despite facing a trade-off between their investment Sharpe Ratio and the average ESG score of the portfolio.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#32654;&#32852;&#20648;&#22312;&#20840;&#29699;&#37329;&#34701;&#21361;&#26426;&#20013;&#23454;&#26045;&#30340;&#36135;&#24065;&#25919;&#31574;&#65292;&#22312;&#20013;&#26029;&#26102;&#38388;&#24207;&#21015;&#33258;&#28982;&#23454;&#39564;&#20998;&#26512;&#30340;&#22522;&#30784;&#19978;&#21457;&#29616;&#65292;&#32654;&#32852;&#20648;&#30340;&#23450;&#37327;&#23485;&#26494;&#35745;&#21010;&#23545;&#32654;&#22269;&#30340;&#23454;&#38469;GDP&#20135;&#29983;&#20102;&#31215;&#26497;&#24433;&#21709;&#65292;&#20294;&#23545;&#36890;&#36135;&#33192;&#32960;&#27809;&#26377;&#26174;&#33879;&#30340;&#24433;&#21709;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#32654;&#22269;&#30340;&#20154;&#22343;&#23454;&#38469;GDP&#27599;&#20010;&#23395;&#24230;&#24179;&#22343;&#22686;&#21152;&#20102;231&#32654;&#20803;&#12290;</title><link>http://arxiv.org/abs/2305.12318</link><description>&lt;p&gt;
&#32654;&#32852;&#20648;&#23545;&#20840;&#29699;&#37329;&#34701;&#21361;&#26426;&#30340;&#24212;&#23545;&#21450;&#20854;&#38271;&#26399;&#24433;&#21709;&#65306;&#19968;&#39033;&#20013;&#26029;&#26102;&#38388;&#24207;&#21015;&#33258;&#28982;&#23454;&#39564;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
The Federal Reserve's Response to the Global Financial Crisis and Its Long-Term Impact: An Interrupted Time-Series Natural Experimental Analysis. (arXiv:2305.12318v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.12318
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#32654;&#32852;&#20648;&#22312;&#20840;&#29699;&#37329;&#34701;&#21361;&#26426;&#20013;&#23454;&#26045;&#30340;&#36135;&#24065;&#25919;&#31574;&#65292;&#22312;&#20013;&#26029;&#26102;&#38388;&#24207;&#21015;&#33258;&#28982;&#23454;&#39564;&#20998;&#26512;&#30340;&#22522;&#30784;&#19978;&#21457;&#29616;&#65292;&#32654;&#32852;&#20648;&#30340;&#23450;&#37327;&#23485;&#26494;&#35745;&#21010;&#23545;&#32654;&#22269;&#30340;&#23454;&#38469;GDP&#20135;&#29983;&#20102;&#31215;&#26497;&#24433;&#21709;&#65292;&#20294;&#23545;&#36890;&#36135;&#33192;&#32960;&#27809;&#26377;&#26174;&#33879;&#30340;&#24433;&#21709;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#32654;&#22269;&#30340;&#20154;&#22343;&#23454;&#38469;GDP&#27599;&#20010;&#23395;&#24230;&#24179;&#22343;&#22686;&#21152;&#20102;231&#32654;&#20803;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#32654;&#32852;&#20648;&#22312;&#24212;&#23545;&#20840;&#29699;&#37329;&#34701;&#21361;&#26426;&#26102;&#23454;&#26045;&#30340;&#36135;&#24065;&#25919;&#31574;&#12290;&#26356;&#20855;&#20307;&#22320;&#65292;&#20998;&#26512;&#20102;2007&#24180;&#33267;2018&#24180;&#32654;&#32852;&#20648;&#36827;&#34892;&#30340;&#23450;&#37327;&#23485;&#26494;(QE)&#35745;&#21010;&#12289;&#27969;&#21160;&#24615;&#24037;&#20855;&#21644;&#21069;&#30651;&#24615;&#25351;&#23548;&#25805;&#20316;&#12290;&#26412;&#25991;&#23545;&#36825;&#20123;&#25919;&#31574;&#30340;&#35814;&#32454;&#23457;&#26597;&#23548;&#33268;&#20102;&#20851;&#20110;QE&#35745;&#21010;&#23545;&#32654;&#22269;&#36890;&#36135;&#33192;&#32960;&#21644;&#23454;&#38469;GDP&#30340;&#38271;&#26399;&#22240;&#26524;&#25928;&#24212;&#30340;&#20013;&#26029;&#26102;&#38388;&#24207;&#21015;(ITS)&#20998;&#26512;&#12290;&#36825;&#31181;&#27491;&#24335;&#30340;&#35774;&#35745;&#22522;&#30784;&#30340;&#33258;&#28982;&#23454;&#39564;&#26041;&#27861;&#30340;&#32467;&#26524;&#26174;&#31034;&#65292;QE&#25805;&#20316;&#23545;&#32654;&#22269;&#23454;&#38469;GDP&#20135;&#29983;&#20102;&#31215;&#26497;&#24433;&#21709;&#65292;&#20294;&#23545;&#32654;&#22269;&#36890;&#36135;&#33192;&#32960;&#27809;&#26377;&#26174;&#33879;&#24433;&#21709;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#23545;&#20110;QE&#21518;&#30340;2011Q2-2018Q4&#26399;&#38388;&#65292;&#30456;&#23545;&#20110;&#22914;&#26524;&#27809;&#26377;&#36827;&#34892;QE&#35745;&#21010;&#65292;&#32654;&#22269;&#30340;&#20154;&#22343;&#23454;&#38469;GDP&#27599;&#20010;&#23395;&#24230;&#24179;&#22343;&#22686;&#21152;&#20102;231&#32654;&#20803;&#12290;&#27492;&#22806;&#65292;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;QE&#35745;&#21010;&#24320;&#22987;&#21313;&#24180;&#21518;&#30340;2018Q4&#65292;&#23454;&#38469;&#20154;&#22343;GDP&#22823;&#32422;&#27604;2008Q3&#39640;&#20986;7.2&#65285;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper examines the monetary policies the Federal Reserve implemented in response to the Global Financial Crisis. More specifically, it analyzes the Federal Reserve's quantitative easing (QE) programs, liquidity facilities, and forward guidance operations conducted from 2007 to 2018. The essay's detailed examination of these policies culminates in an interrupted time-series (ITS) analysis of the long-term causal effects of the QE programs on U.S. inflation and real GDP. The results of this formal design-based natural experimental approach show that the QE operations positively affected U.S. real GDP but did not significantly impact U.S. inflation. Specifically, it is found that, for the 2011Q2-2018Q4 post-QE period, real GDP per capita in the U.S. increased by an average of 231 dollars per quarter relative to how it would have changed had the QE programs not been conducted. Moreover, the results show that, in 2018Q4, ten years after the beginning of the QE programs, real GDP per ca
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#31181;&#39640;&#25928;&#23398;&#20064;&#23884;&#22871;&#28145;&#24230;&#23545;&#20914;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#20351;&#29992;&#22810;&#20010;&#26399;&#26435;&#23545;&#30446;&#26631;&#26399;&#26435;&#36827;&#34892;&#23545;&#20914;&#65292;&#20351;&#29992;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#23450;&#20215;&#23545;&#20914;&#24037;&#20855;&#65292;&#33021;&#22815;&#26377;&#25928;&#22788;&#29702;&#24066;&#22330;&#25705;&#25830;&#65292;&#36991;&#20813;&#22871;&#21033;&#26426;&#20250;&#12290;</title><link>http://arxiv.org/abs/2305.12264</link><description>&lt;p&gt;
&#20351;&#29992;&#22810;&#20010;&#26399;&#26435;&#39640;&#25928;&#23398;&#20064;&#23884;&#22871;&#28145;&#24230;&#23545;&#20914;
&lt;/p&gt;
&lt;p&gt;
Efficient Learning of Nested Deep Hedging using Multiple Options. (arXiv:2305.12264v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.12264
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#31181;&#39640;&#25928;&#23398;&#20064;&#23884;&#22871;&#28145;&#24230;&#23545;&#20914;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#20351;&#29992;&#22810;&#20010;&#26399;&#26435;&#23545;&#30446;&#26631;&#26399;&#26435;&#36827;&#34892;&#23545;&#20914;&#65292;&#20351;&#29992;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#23450;&#20215;&#23545;&#20914;&#24037;&#20855;&#65292;&#33021;&#22815;&#26377;&#25928;&#22788;&#29702;&#24066;&#22330;&#25705;&#25830;&#65292;&#36991;&#20813;&#22871;&#21033;&#26426;&#20250;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#23545;&#20914;&#26159;&#19968;&#31181;&#22312;&#23384;&#22312;&#24066;&#22330;&#25705;&#25830;&#30340;&#24773;&#20917;&#19979;&#23545;&#20914;&#34893;&#29983;&#21697;&#30340;&#26694;&#26550;&#12290;&#26412;&#30740;&#31350;&#37325;&#28857;&#30740;&#31350;&#20102;&#20351;&#29992;&#22810;&#20010;&#26399;&#26435;&#23545;&#32473;&#23450;&#30446;&#26631;&#26399;&#26435;&#36827;&#34892;&#23545;&#20914;&#30340;&#38382;&#39064;&#12290;&#20026;&#20102;&#23558;&#28145;&#24230;&#23545;&#20914;&#26694;&#26550;&#25193;&#23637;&#21040;&#27492;&#35774;&#32622;&#65292;&#20316;&#20026;&#23545;&#20914;&#24037;&#20855;&#30340;&#26399;&#26435;&#20063;&#24517;&#39035;&#22312;&#22521;&#35757;&#26399;&#38388;&#23450;&#20215;&#12290;&#34429;&#28982;&#21487;&#20197;&#20351;&#29992;&#20256;&#32479;&#30340;&#20215;&#26684;&#27169;&#22411;&#65288;&#22914;Black-Scholes&#20844;&#24335;&#65289;&#65292;&#20294;&#24573;&#30053;&#25705;&#25830;&#20250;&#25552;&#20379;&#19981;&#24076;&#26395;&#30475;&#21040;&#30340;&#22871;&#21033;&#26426;&#20250;&#65292;&#36825;&#23545;&#28145;&#24230;&#23545;&#20914;&#23398;&#20064;&#26159;&#19981;&#21033;&#30340;&#12290;&#26412;&#30740;&#31350;&#30340;&#30446;&#26631;&#26159;&#24320;&#21457;&#19968;&#31181;&#23884;&#22871;&#28145;&#24230;&#23545;&#20914;&#26041;&#27861;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#28145;&#24230;&#23545;&#20914;&#30340;&#23436;&#20840;&#28145;&#24230;&#26041;&#27861;&#65292;&#22312;&#27492;&#26041;&#27861;&#20013;&#65292;&#23545;&#20914;&#24037;&#20855;&#30340;&#23450;&#20215;&#20063;&#30001;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#36827;&#34892;&#23450;&#20215;&#65292;&#35813;&#32593;&#32476;&#33021;&#20102;&#35299;&#21040;&#24066;&#22330;&#25705;&#25830;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#24517;&#39035;&#22312;&#35768;&#22810;&#19981;&#21516;&#30340;&#26465;&#20214;&#19979;&#35745;&#31639;&#23545;&#20914;&#24037;&#20855;&#30340;&#20215;&#26684;&#65292;&#25972;&#20010;&#23398;&#20064;&#36807;&#31243;&#21487;&#33021;&#20250;&#35745;&#31639;&#19978;&#26080;&#27861;&#22788;&#29702;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#23884;&#22871;&#28145;&#24230;&#23545;&#20914;&#30340;&#39640;&#25928;&#23398;&#20064;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Deep hedging is a framework for hedging derivatives in the presence of market frictions. In this study, we focus on the problem of hedging a given target option by using multiple options. To extend the deep hedging framework to this setting, the options used as hedging instruments also have to be priced during training. While one might use classical pricing model such as the Black-Scholes formula, ignoring frictions can offer arbitrage opportunities which are undesirable for deep hedging learning. The goal of this study is to develop a nested deep hedging method. That is, we develop a fully-deep approach of deep hedging in which the hedging instruments are also priced by deep neural networks that are aware of frictions. However, since the prices of hedging instruments have to be calculated under many different conditions, the entire learning process can be computationally intractable. To overcome this problem, we propose an efficient learning method for nested deep hedging. Our method 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#22522;&#20110;&#27169;&#22411;&#30340;&#36135;&#24065;&#25919;&#31574;&#20844;&#21578;&#20998;&#31867;&#26041;&#27861;&#65292;&#21033;&#29992;&#19981;&#23545;&#31216;&#36339;&#36291;&#20056;&#24615;&#35823;&#24046;&#27169;&#22411;&#65288;AJM&#65289;&#32771;&#34385;&#27874;&#21160;&#29575;&#30340;&#36339;&#36291;&#25104;&#20998;&#65292;&#24182;&#20851;&#27880;&#20844;&#21578;&#23545;&#27874;&#21160;&#24615;&#36339;&#36291;&#25104;&#20998;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2305.12192</link><description>&lt;p&gt;
&#27874;&#21160;&#24615;&#36339;&#36291;&#21644;&#36135;&#24065;&#25919;&#31574;&#20844;&#21578;&#30340;&#20998;&#31867;
&lt;/p&gt;
&lt;p&gt;
Volatility jumps and the classification of monetary policy announcements. (arXiv:2305.12192v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.12192
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#22522;&#20110;&#27169;&#22411;&#30340;&#36135;&#24065;&#25919;&#31574;&#20844;&#21578;&#20998;&#31867;&#26041;&#27861;&#65292;&#21033;&#29992;&#19981;&#23545;&#31216;&#36339;&#36291;&#20056;&#24615;&#35823;&#24046;&#27169;&#22411;&#65288;AJM&#65289;&#32771;&#34385;&#27874;&#21160;&#29575;&#30340;&#36339;&#36291;&#25104;&#20998;&#65292;&#24182;&#20851;&#27880;&#20844;&#21578;&#23545;&#27874;&#21160;&#24615;&#36339;&#36291;&#25104;&#20998;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20013;&#22830;&#38134;&#34892;&#38024;&#23545;&#24433;&#21709;&#37329;&#34701;&#24066;&#22330;&#27874;&#21160;&#29575;&#30340;&#22806;&#37096;&#20107;&#20214;&#39057;&#32321;&#36827;&#34892;&#24178;&#39044;&#12290;&#26412;&#25991;&#24341;&#20837;&#20102;&#19981;&#23545;&#31216;&#36339;&#36291;&#20056;&#24615;&#35823;&#24046;&#27169;&#22411;&#65288;AJM&#65289;&#65292;&#22312;&#26085;&#20869;&#26694;&#26550;&#20869;&#32771;&#34385;&#20102;&#27874;&#21160;&#29575;&#30340;&#29305;&#23450;&#36339;&#36291;&#25104;&#20998;&#12290;&#20197;&#32654;&#32852;&#20648;&#20026;&#20363;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27169;&#22411;&#30340;&#36135;&#24065;&#25919;&#31574;&#20844;&#21578;&#20998;&#31867;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22522;&#20110;&#20844;&#21578;&#23545;&#27874;&#21160;&#24615;&#36339;&#36291;&#25104;&#20998;&#30340;&#24433;&#21709;&#12290;&#37325;&#28857;&#20851;&#27880;&#27599;&#20010;&#32654;&#32852;&#20648;&#36890;&#35759;&#21518;&#30340;&#30701;&#26242;&#26102;&#38388;&#31383;&#21475;&#65292;&#25105;&#20204;&#23558;&#36135;&#24065;&#25919;&#31574;&#20844;&#21578;&#30340;&#24433;&#21709;&#19982;&#21516;&#19968;&#20844;&#21578;&#26085;&#20869;&#21487;&#33021;&#21457;&#29983;&#30340;&#20219;&#20309;&#30456;&#20851;&#20107;&#20214;&#24341;&#36215;&#30340;&#27745;&#26579;&#38548;&#31163;&#24320;&#26469;&#12290;
&lt;/p&gt;
&lt;p&gt;
Central Banks interventions are frequent in response to exogenous events with direct implications on financial market volatility. In this paper, we introduce the Asymmetric Jump Multiplicative Error Model (AJM), which accounts for a specific jump component of volatility within an intradaily framework. Taking the Federal Reserve (Fed) as a reference, we propose a new model-based classification of monetary announcements based on their impact on the jump component of volatility. Focusing on a short window following each Fed's communication, we isolate the impact of monetary announcements from any contamination carried by relevant events that may occur within the same announcement day.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#38024;&#23545;&#33655;&#20848;&#20135;&#19994;&#29983;&#20135;&#32593;&#32476;&#20013;&#30340;187&#20010;&#21830;&#21697;&#32452;&#65292;&#20998;&#26512;&#20102;&#20854;&#20108;&#20803;&#21644;&#21152;&#26435;&#19977;&#20803;&#27169;&#24335;&#65292;&#21457;&#29616;&#22823;&#22810;&#25968;&#21333;&#20010;&#20135;&#21697;&#23618;&#38754;&#19978;&#27809;&#26377;&#26174;&#30528;&#30340;&#27169;&#24335;&#65292;&#32422;80&#65285;&#30340;&#23618;&#21482;&#26377;&#20004;&#20010;&#25110;&#26356;&#23569;&#30340;&#27169;&#24335;&#12290;</title><link>http://arxiv.org/abs/2305.12179</link><description>&lt;p&gt;
&#33655;&#20848;&#20135;&#19994;&#29983;&#20135;&#32593;&#32476;&#20013;&#30340;&#21830;&#21697;&#29305;&#23450;&#19977;&#20803;&#32452;
&lt;/p&gt;
&lt;p&gt;
Commodity-specific triads in the Dutch inter-industry production network. (arXiv:2305.12179v1 [physics.soc-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.12179
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#38024;&#23545;&#33655;&#20848;&#20135;&#19994;&#29983;&#20135;&#32593;&#32476;&#20013;&#30340;187&#20010;&#21830;&#21697;&#32452;&#65292;&#20998;&#26512;&#20102;&#20854;&#20108;&#20803;&#21644;&#21152;&#26435;&#19977;&#20803;&#27169;&#24335;&#65292;&#21457;&#29616;&#22823;&#22810;&#25968;&#21333;&#20010;&#20135;&#21697;&#23618;&#38754;&#19978;&#27809;&#26377;&#26174;&#30528;&#30340;&#27169;&#24335;&#65292;&#32422;80&#65285;&#30340;&#23618;&#21482;&#26377;&#20004;&#20010;&#25110;&#26356;&#23569;&#30340;&#27169;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19977;&#20803;&#27169;&#24335;&#26159;&#22797;&#26434;&#32593;&#32476;&#20013;&#26356;&#39640;&#32423;&#20132;&#20114;&#30340;&#26368;&#23567;&#26500;&#24314;&#22359;&#12290;&#26368;&#36817;&#65292;&#29983;&#20135;&#32593;&#32476;&#30340;&#27169;&#24335;&#32467;&#26500;&#24341;&#36215;&#20851;&#27880;&#65292;&#22240;&#20026;&#23427;&#21487;&#33021;&#22312;&#32463;&#27982;&#38663;&#33633;&#30340;&#20256;&#25773;&#20013;&#36215;&#21040;&#20316;&#29992;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#21333;&#20010;&#21830;&#21697;&#23618;&#38754;&#19978;&#30340;&#27169;&#24335;&#32467;&#26500;&#20173;&#30693;&#20043;&#29978;&#23569;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#33655;&#20848;&#32479;&#35745;&#23616;&#30340;&#25968;&#25454;&#65292;&#20998;&#35299;&#25104;187&#20010;&#21830;&#21697;&#32452;&#65292;&#24182;&#20998;&#26512;&#20102;&#33655;&#20848;&#20135;&#19994;&#29983;&#20135;&#32593;&#32476;&#20013;&#30340;&#20108;&#20803;&#21644;&#21152;&#26435;&#19977;&#20803;&#27169;&#24335;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#36866;&#24403;&#30340;&#31354;&#27169;&#22411;&#26469;&#36807;&#28388;&#33410;&#28857;&#24322;&#36136;&#24615;&#21644;&#38142;&#25509;&#20114;&#24800;&#30340;&#24378;&#25928;&#24212;&#65292;&#24182;&#21457;&#29616;&#23613;&#31649;&#35206;&#30422;&#25152;&#26377;&#20135;&#21697;&#30340;&#32858;&#21512;&#32593;&#32476;&#20855;&#26377;&#22823;&#37327;&#19977;&#20803;&#27169;&#24335;&#65292;&#20294;&#22823;&#22810;&#25968;&#21333;&#20010;&#20135;&#21697;&#23618;&#38754;&#19978;&#27809;&#26377;&#26174;&#30528;&#30340;&#27169;&#24335;&#65292;&#32422;80&#65285;&#30340;&#23618;&#21482;&#26377;&#20004;&#20010;&#25110;&#26356;&#23569;&#30340;&#27169;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
Triadic motifs are the smallest building blocks of higher-order interactions in complex networks and can be detected as over-occurrences with respect to null models with only pair-wise interactions. Recently, the motif structure of production networks has attracted attention in light of its possible role in the propagation of economic shocks. However, its characterization at the level of individual commodities is still poorly understood. Here we analyse both binary and weighted triadic motifs in the Dutch inter-industry production network disaggregated at the level of 187 commodity groups, using data from Statistics Netherlands. We introduce appropriate null models that filter out node heterogeneity and the strong effects of link reciprocity and find that, while the aggregate network that overlays all products is characterized by a multitude of triadic motifs, most single-product layers feature no significant motif, and roughly 80% of the layers feature only two motifs or less. This re
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26234;&#33021;&#39044;&#27979;&#20449;&#29992;&#20538;&#36829;&#32422;&#39118;&#38505;&#30340;&#26694;&#26550;&#65292;&#21487;&#20197;&#25552;&#20379;&#31934;&#30830;&#30340;&#25353;&#22825;&#39044;&#27979;&#30340;&#36829;&#32422;&#39118;&#38505;&#39044;&#27979;&#65292;&#20197;&#32500;&#25252;&#20013;&#22269;&#20538;&#21048;&#24066;&#22330;&#30340;&#31283;&#23450;&#21644;&#20581;&#24247;&#21457;&#23637;&#12290;</title><link>http://arxiv.org/abs/2305.12142</link><description>&lt;p&gt;
&#20851;&#20110;&#20449;&#29992;&#20538;&#36829;&#32422;&#39118;&#38505;&#30340;&#26234;&#33021;&#39044;&#27979;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Study on Intelligent Forecasting of Credit Bond Default Risk. (arXiv:2305.12142v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.12142
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26234;&#33021;&#39044;&#27979;&#20449;&#29992;&#20538;&#36829;&#32422;&#39118;&#38505;&#30340;&#26694;&#26550;&#65292;&#21487;&#20197;&#25552;&#20379;&#31934;&#30830;&#30340;&#25353;&#22825;&#39044;&#27979;&#30340;&#36829;&#32422;&#39118;&#38505;&#39044;&#27979;&#65292;&#20197;&#32500;&#25252;&#20013;&#22269;&#20538;&#21048;&#24066;&#22330;&#30340;&#31283;&#23450;&#21644;&#20581;&#24247;&#21457;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20013;&#22269;&#20538;&#21048;&#24066;&#22330;&#20013;&#30340;&#20449;&#29992;&#39118;&#38505;&#36234;&#26469;&#36234;&#26126;&#26174;&#65292;&#36825;&#20026;&#20449;&#29992;&#20538;&#25237;&#36164;&#32773;&#24102;&#26469;&#20102;&#26085;&#30410;&#21319;&#32423;&#30340;&#36829;&#32422;&#39118;&#38505;&#12290;&#37492;&#20110;&#24403;&#21069;&#20538;&#21048;&#20449;&#24687;&#25259;&#38706;&#19981;&#23436;&#25972;&#21644;&#19981;&#20934;&#30830;&#30340;&#24773;&#20917;&#65292;&#21450;&#26102;&#36319;&#36394;&#21644;&#39044;&#27979;&#20010;&#21035;&#20449;&#29992;&#20538;&#36829;&#32422;&#39118;&#38505;&#24050;&#25104;&#20026;&#32500;&#25252;&#24066;&#22330;&#31283;&#23450;&#21644;&#20445;&#38556;&#20581;&#24247;&#21457;&#23637;&#30340;&#24517;&#35201;&#25163;&#27573;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26234;&#33021;&#39044;&#27979;&#36829;&#32422;&#39118;&#38505;&#30340;&#26694;&#26550;&#65292;&#21487;&#25552;&#20379;&#31934;&#30830;&#30340;&#25353;&#22825;&#39044;&#27979;&#30340;&#36829;&#32422;&#39118;&#38505;&#39044;&#27979;&#12290;&#22312;&#36825;&#20010;&#26694;&#26550;&#20013;&#65292;&#25105;&#20204;&#39318;&#20808;&#24635;&#32467;&#24433;&#21709;&#20449;&#29992;&#20538;&#36829;&#32422;&#30340;&#22240;&#32032;&#24182;&#26500;&#24314;&#20102;&#19968;&#20010;&#39118;&#38505;&#25351;&#25968;&#20307;&#31995;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#19968;&#31181;&#22522;&#20110;&#20538;&#21048;&#36829;&#32422;&#39118;&#38505;&#28436;&#21270;&#29305;&#24449;&#30340;&#32452;&#21512;&#36829;&#32422;&#27010;&#29575;&#27880;&#37322;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#32771;&#34385;&#20102;&#25104;&#29087;&#25110;&#36829;&#32422;&#20538;&#21048;&#30340;&#27599;&#26085;&#36829;&#32422;&#39118;&#38505;&#27880;&#37322;&#30340;&#21464;&#20998;&#36125;&#21494;&#26031;&#39640;&#26031;&#28151;&#21512;&#20272;&#31639;&#12289;&#24066;&#22330;&#25351;&#25968;&#20272;&#31639;&#21644;&#36829;&#32422;&#36235;&#21183;&#21453;&#21521;&#20272;&#31639;&#30340;&#21152;&#26435;&#24179;&#22343;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
Credit risk in the China's bond market has become increasingly evident, creating a progressively escalating risk of default for credit bond investors. Given the current incomplete and inaccurate bond information disclosure, timely tracking and forecasting the individual credit bond default risks have become essential to maintain market stability and ensure healthy development. This paper proposes an Intelligent Forecasting Framework for Default Risk that provides precise day-by-day default risk prediction. In this framework, we first summarize the factors that impact credit bond defaults and construct a risk index system. Then, we employ a combined default probability annotation method based on the evolutionary characteristics of bond default risk. The method considers the weighted average of Variational Bayesian Gaussian Mixture estimation, Market Index estimation, and Default Trend Backward estimation for daily default risk annotation of matured or defaulted bonds according to the ri
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102; ChatGPT&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#35752;&#35770;&#23545;&#32654;&#22269;&#23398;&#29983;&#39044;&#26399;&#21171;&#21160;&#24066;&#22330;&#32467;&#26524;&#30340;&#22240;&#26524;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#23398;&#29983;&#20449;&#24515;&#20250;&#38477;&#20302;&#65292;&#23545;&#26410;&#26469;&#30340;&#25910;&#20837;&#21069;&#26223;&#20445;&#25345;&#24754;&#35266;&#24577;&#24230;&#65292;&#36825;&#31181;&#24433;&#21709;&#24191;&#27867;&#23384;&#22312;&#20110;&#19981;&#21516;&#23398;&#29983;&#32676;&#20307;&#20013;&#12290;&#36825;&#20010;&#30740;&#31350;&#32473;&#25945;&#32946;&#24037;&#20316;&#32773;&#12289;&#31649;&#29702;&#32773;&#21644;&#25919;&#31574;&#21046;&#23450;&#32773;&#25552;&#20379;&#20102;&#19968;&#20010;&#26426;&#20250;&#65292;&#20197;&#26356;&#22909;&#22320;&#20102;&#35299;&#23398;&#29983;&#30340;&#25285;&#24551;&#24182;&#25913;&#36827;&#25945;&#32946;&#35838;&#31243;&#65292;&#20351;&#23398;&#29983;&#26356;&#22909;&#22320;&#20934;&#22791;&#26410;&#26469;&#65292;&#36825;&#20010;&#26410;&#26469;&#24517;&#28982;&#20250;&#34987;AI&#25913;&#21464;&#12290;</title><link>http://arxiv.org/abs/2305.11900</link><description>&lt;p&gt;
ChatGPT&#19982;&#21171;&#21160;&#21147;&#24066;&#22330;&#65306;&#25581;&#31034;AI&#35752;&#35770;&#23545;&#23398;&#29983;&#25910;&#20837;&#39044;&#26399;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
ChatGPT and the Labor Market: Unraveling the Effect of AI Discussions on Students' Earnings Expectations. (arXiv:2305.11900v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.11900
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102; ChatGPT&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#35752;&#35770;&#23545;&#32654;&#22269;&#23398;&#29983;&#39044;&#26399;&#21171;&#21160;&#24066;&#22330;&#32467;&#26524;&#30340;&#22240;&#26524;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#23398;&#29983;&#20449;&#24515;&#20250;&#38477;&#20302;&#65292;&#23545;&#26410;&#26469;&#30340;&#25910;&#20837;&#21069;&#26223;&#20445;&#25345;&#24754;&#35266;&#24577;&#24230;&#65292;&#36825;&#31181;&#24433;&#21709;&#24191;&#27867;&#23384;&#22312;&#20110;&#19981;&#21516;&#23398;&#29983;&#32676;&#20307;&#20013;&#12290;&#36825;&#20010;&#30740;&#31350;&#32473;&#25945;&#32946;&#24037;&#20316;&#32773;&#12289;&#31649;&#29702;&#32773;&#21644;&#25919;&#31574;&#21046;&#23450;&#32773;&#25552;&#20379;&#20102;&#19968;&#20010;&#26426;&#20250;&#65292;&#20197;&#26356;&#22909;&#22320;&#20102;&#35299;&#23398;&#29983;&#30340;&#25285;&#24551;&#24182;&#25913;&#36827;&#25945;&#32946;&#35838;&#31243;&#65292;&#20351;&#23398;&#29983;&#26356;&#22909;&#22320;&#20934;&#22791;&#26410;&#26469;&#65292;&#36825;&#20010;&#26410;&#26469;&#24517;&#28982;&#20250;&#34987;AI&#25913;&#21464;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36127;&#38754;&#21644;&#27491;&#38754; ChatGPT&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#35752;&#35770;&#23545;&#32654;&#22269;&#23398;&#29983;&#39044;&#26399;&#21171;&#21160;&#24066;&#22330;&#32467;&#26524;&#30340;&#22240;&#26524;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#25509;&#35302;AI&#35752;&#35770;&#21518;&#65292;&#23398;&#29983;&#20449;&#24515;&#20250;&#38477;&#20302;&#65292;&#29305;&#21035;&#26159;&#22312;&#38405;&#35835;&#36127;&#38754;&#24773;&#32490;&#30340;&#35752;&#35770;&#25688;&#24405;&#26102;&#65292;&#36825;&#31181;&#24433;&#21709;&#26356;&#21152;&#26126;&#26174;&#12290;&#19982;STEM&#19987;&#19994;&#19981;&#21516;&#65292;&#38750;STEM&#39046;&#22495;&#30340;&#23398;&#29983;&#34920;&#29616;&#20986;&#19981;&#23545;&#31216;&#21644;&#24754;&#35266;&#30340;&#20449;&#20208;&#21464;&#21270;&#65292;&#34920;&#26126;&#20182;&#20204;&#21487;&#33021;&#24863;&#21463;&#21040;&#26032;&#20852;AI&#25216;&#26415;&#30340;&#24433;&#21709;&#26356;&#24378;&#12290;&#23545;&#20110;&#26410;&#26469;&#25910;&#20837;&#30340;&#24754;&#35266;&#20449;&#20208;&#26356;&#26032;&#20063;&#26222;&#36941;&#23384;&#22312;&#20110;&#21508;&#20010;&#24615;&#21035;&#21644;GPA&#27700;&#24179;&#20043;&#38388;&#65292;&#36825;&#34920;&#26126;&#25152;&#26377;&#23398;&#29983;&#32676;&#20307;&#37117;&#23384;&#22312;&#24191;&#27867;&#30340;AI&#25285;&#24551;&#12290;&#25945;&#32946;&#24037;&#20316;&#32773;&#12289;&#31649;&#29702;&#32773;&#21644;&#25919;&#31574;&#21046;&#23450;&#32773;&#21487;&#20197;&#23450;&#26399;&#19982;&#23398;&#29983;&#20114;&#21160;&#20197;&#35299;&#20915;&#20182;&#20204;&#30340;&#25285;&#24551;&#65292;&#24182;&#25913;&#36827;&#25945;&#32946;&#35838;&#31243;&#65292;&#20351;&#20182;&#20204;&#26356;&#22909;&#22320;&#20934;&#22791;&#26410;&#26469;&#65292;&#36825;&#20010;&#26410;&#26469;&#24517;&#28982;&#20250;&#34987;AI&#25913;&#21464;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper investigates the causal impact of negatively and positively framed ChatGPT Artificial Intelligence (AI) discussions on US students' anticipated labor market outcomes. Our findings reveal students reduce their confidence regarding their future earnings prospects after exposure to AI debates, and this effect is more pronounced after reading discussion excerpts with a negative tone. Unlike STEM majors, students in Non-STEM fields show asymmetric and pessimistic belief changes, suggesting that they might feel more vulnerable to emerging AI technologies. Pessimistic belief updates regarding future earnings are also prevalent across gender and GPA levels, indicating widespread AI concerns among all student subgroups. Educators, administrators, and policymakers may regularly engage with students to address their concerns and enhance educational curricula to better prepare them for a future that will be inevitably shaped by AI.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#25226;&#30740;&#31350;&#20013;&#37096;&#20998;&#20869;&#23481;&#20132;&#30001;&#29983;&#25104;&#24335;AI&#23436;&#25104;&#65292;&#20250;&#23548;&#33268;&#20154;&#20204;&#19981;&#20449;&#20219;&#21644;&#36140;&#20302;&#30740;&#31350;&#20154;&#21592;&#21644;&#31185;&#23398;&#36755;&#20986;&#65292;&#24182;&#21487;&#33021;&#24433;&#21709;&#21040;&#29983;&#25104;&#24335;AI&#20351;&#29992;&#30340;&#25253;&#21578;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2305.11873</link><description>&lt;p&gt;
&#30001;&#29983;&#25104;&#24335;AI&#21512;&#20316;&#21019;&#20316;&#30340;&#30740;&#31350;&#30340;&#35780;&#20215;&#65306;&#23454;&#39564;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Judgments of research co-created by generative AI: experimental evidence. (arXiv:2305.11873v1 [cs.HC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.11873
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#25226;&#30740;&#31350;&#20013;&#37096;&#20998;&#20869;&#23481;&#20132;&#30001;&#29983;&#25104;&#24335;AI&#23436;&#25104;&#65292;&#20250;&#23548;&#33268;&#20154;&#20204;&#19981;&#20449;&#20219;&#21644;&#36140;&#20302;&#30740;&#31350;&#20154;&#21592;&#21644;&#31185;&#23398;&#36755;&#20986;&#65292;&#24182;&#21487;&#33021;&#24433;&#21709;&#21040;&#29983;&#25104;&#24335;AI&#20351;&#29992;&#30340;&#25253;&#21578;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
ChatGPT&#30340;&#24341;&#20837;&#24341;&#21457;&#20102;&#20851;&#20110;&#29983;&#25104;&#24335;AI&#65288;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65307;LLMs&#65289;&#30340;&#20351;&#29992;&#30340;&#20844;&#20849;&#20105;&#35770;&#65292;&#21253;&#25324;&#30740;&#31350;&#20154;&#21592;&#30340;&#20351;&#29992;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#27979;&#35797;&#20102;&#23558;&#30740;&#31350;&#36807;&#31243;&#30340;&#26576;&#20123;&#37096;&#20998;&#22996;&#25176;&#32473;LLMs&#26159;&#21542;&#20250;&#23548;&#33268;&#20154;&#20204;&#19981;&#20449;&#20219;&#21644;&#36140;&#20302;&#30740;&#31350;&#20154;&#21592;&#21644;&#31185;&#23398;&#36755;&#20986;&#12290;&#21442;&#19982;&#32773;&#65288;N=402&#65289;&#32771;&#34385;&#19968;&#20010;&#23558;&#30740;&#31350;&#36807;&#31243;&#30340;&#20803;&#32032;&#22996;&#25176;&#32473;&#21338;&#22763;&#29983;&#25110;LLM&#30340;&#30740;&#31350;&#20154;&#21592;&#65292;&#24182;&#23545;&#20197;&#19979;&#36827;&#34892;&#35780;&#20998;&#65306;&#65288;1&#65289;&#36947;&#24503;&#21487;&#25509;&#21463;&#24615;&#65292;&#65288;2&#65289;&#30456;&#20449;&#31185;&#23398;&#23478;&#30417;&#30563;&#26410;&#26469;&#39033;&#30446;&#65292;&#20197;&#21450;&#65288;3&#65289;&#36755;&#20986;&#30340;&#20934;&#30830;&#24615;&#21644;&#36136;&#37327;&#12290;&#20154;&#20204;&#35748;&#20026;&#23558;&#20219;&#21153;&#22996;&#25176;&#32473;LLMs&#27604;&#22996;&#25176;&#32473;&#20154;&#31867;&#19981;&#22826;&#21487;&#25509;&#21463;&#65288;d=-0.78&#65289;&#12290;&#22996;&#25176;&#32473;LLMs&#20063;&#20250;&#38477;&#20302;&#20154;&#20204;&#23545;&#20110;&#30417;&#30563;&#26410;&#26469;&#30740;&#31350;&#39033;&#30446;&#30340;&#20449;&#20219;&#65288;d=-0.80&#65289;&#65292;&#32780;&#19988;&#20154;&#20204;&#35748;&#20026;&#32467;&#26524;&#30340;&#20934;&#30830;&#24615;&#21644;&#36136;&#37327;&#20250;&#26356;&#20302;&#65288;d=-0.85&#65289;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#36825;&#31181;&#36140;&#20540;&#22914;&#20309;&#36716;&#21270;&#20026;LLMs&#20351;&#29992;&#30340;&#20302;&#20272;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
The introduction of ChatGPT has fuelled a public debate on the use of generative AI (large language models; LLMs), including its use by researchers. In the current work, we test whether delegating parts of the research process to LLMs leads people to distrust and devalue researchers and scientific output. Participants (N=402) considered a researcher who delegates elements of the research process to a PhD student or LLM, and rated (1) moral acceptability, (2) trust in the scientist to oversee future projects, and (3) the accuracy and quality of the output. People judged delegating to an LLM as less acceptable than delegating to a human (d = -0.78). Delegation to an LLM also decreased trust to oversee future research projects (d = -0.80), and people thought the results would be less accurate and of lower quality (d = -0.85). We discuss how this devaluation might transfer into the underreporting of generative AI use.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#31350;&#20102;&#34892;&#25919;&#27807;&#36890;&#20013;&#30340;&#21457;&#22768;&#31505;&#22768;&#23545;&#20110;&#31038;&#20250;&#35748;&#21487;&#30340;&#31215;&#26497;&#24433;&#21709;&#65292;&#29305;&#21035;&#26159;&#24403;&#21457;&#29983;&#21452;&#21521;&#31505;&#22768;&#26102;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#36825;&#31181;&#24433;&#21709;&#38543;&#30528;&#32452;&#32455;&#19994;&#32489;&#30340;&#19979;&#38477;&#32780;&#22686;&#21152;&#12290;</title><link>http://arxiv.org/abs/2305.09485</link><description>&lt;p&gt;
&#34892;&#25919;&#20154;&#21592;&#30340;&#21457;&#22768;&#31505;&#22768;&#19982;&#31038;&#20250;&#35748;&#21487;&#65306;&#26426;&#22120;&#23398;&#20064;&#30740;&#31350;&#30340;&#25506;&#31350;&#12290; (arXiv:2305.09485v1 [&#32463;&#27982;&#23398;.GN])
&lt;/p&gt;
&lt;p&gt;
Executive Voiced Laughter and Social Approval: An Explorative Machine Learning Study. (arXiv:2305.09485v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.09485
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#31350;&#20102;&#34892;&#25919;&#27807;&#36890;&#20013;&#30340;&#21457;&#22768;&#31505;&#22768;&#23545;&#20110;&#31038;&#20250;&#35748;&#21487;&#30340;&#31215;&#26497;&#24433;&#21709;&#65292;&#29305;&#21035;&#26159;&#24403;&#21457;&#29983;&#21452;&#21521;&#31505;&#22768;&#26102;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#36825;&#31181;&#24433;&#21709;&#38543;&#30528;&#32452;&#32455;&#19994;&#32489;&#30340;&#19979;&#38477;&#32780;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#34892;&#25919;&#20154;&#21592;&#27807;&#36890;&#20013;&#30340;&#21457;&#22768;&#31505;&#22768;&#20197;&#21450;&#23427;&#23545;&#31038;&#20250;&#35748;&#21487;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#23558;&#31505;&#22768;&#65292;&#24773;&#24863;&#20316;&#20026;&#20449;&#24687;&#21644;&#20449;&#24687;&#23186;&#20171;&#23545;&#20844;&#21496;&#30340;&#31038;&#20250;&#35780;&#20215;&#30340;&#30740;&#31350;&#30456;&#32467;&#21512;&#65292;&#20551;&#35774;&#34892;&#25919;&#20154;&#21592;&#27807;&#36890;&#20013;&#30340;&#21457;&#22768;&#31505;&#22768;&#23545;&#31038;&#20250;&#35748;&#21487;&#26377;&#31215;&#26497;&#24433;&#21709;&#65292;&#31038;&#20250;&#35748;&#21487;&#26159;&#25351;&#21463;&#20247;&#23545;&#19968;&#20010;&#32452;&#32455;&#30340;&#20146;&#21644;&#21147;&#30340;&#24863;&#30693;&#12290;&#25105;&#20204;&#35748;&#20026;&#65292;&#19982;&#20247;&#31505;&#30340;&#25928;&#26524;&#23588;&#20854;&#24378;&#65292;&#21363;&#22312;&#32473;&#23450;&#30340;&#27807;&#36890;&#22330;&#21512;&#20013;&#65292;&#32858;&#28966;&#30340;&#34892;&#25919;&#20154;&#21592;&#21644;&#35266;&#20247;&#21516;&#26102;&#21457;&#31505;&#30340;&#27425;&#25968;&#12290;&#26368;&#21518;&#65292;&#32467;&#21512;&#24773;&#24863;&#20316;&#20026;&#20449;&#24687;&#21644;&#20154;&#31867;&#35748;&#30693;&#30340;&#36127;&#38754;&#20559;&#35265;&#65292;&#25105;&#20204;&#20551;&#35774;&#31505;&#22768;&#23545;&#31038;&#20250;&#35748;&#21487;&#30340;&#31215;&#26497;&#24433;&#21709;&#38543;&#30528;&#32452;&#32455;&#19994;&#32489;&#30340;&#19979;&#38477;&#32780;&#22686;&#21152;&#12290;&#25105;&#20204;&#22312;902&#20010;&#24503;&#22269;&#24052;&#26519;&#24503;&#26031;&#21033;&#21152;&#36275;&#29699;&#26032;&#38395;&#21457;&#24067;&#20250;&#21644;&#23186;&#20307;&#21313;&#22823;&#25968;&#25454;&#20013;&#36827;&#34892;&#27979;&#35797;&#65292;&#24212;&#29992;&#26368;&#20808;&#36827;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#36827;&#34892;&#31505;&#22768;&#26816;&#27979;&#65292;&#24182;&#25214;&#21040;&#20102;&#37096;&#20998;&#25903;&#25345;&#25105;&#20204;&#24819;&#27861;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study voiced laughter in executive communication and its effect on social approval. Integrating research on laughter, affect-as-information, and infomediaries' social evaluations of firms, we hypothesize that voiced laughter in executive communication positively affects social approval, defined as audience perceptions of affinity towards an organization. We surmise that the effect of laughter is especially strong for joint laughter, i.e., the number of instances in a given communication venue for which the focal executive and the audience laugh simultaneously. Finally, combining the notions of affect-as-information and negativity bias in human cognition, we hypothesize that the positive effect of laughter on social approval increases with bad organizational performance. We find partial support for our ideas when testing them on panel data comprising 902 German Bundesliga soccer press conferences and media tenor, applying state-of-the-art machine learning approaches for laughter dete
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21435;&#20013;&#24515;&#21270;&#25215;&#35834;&#23545;&#27665;&#20027;&#20915;&#31574;&#30340;&#24433;&#21709;&#12290;&#22312;&#25237;&#31080;&#21069;&#65292;&#22996;&#21592;&#20250;&#25104;&#21592;&#21487;&#20197;&#36827;&#34892;&#21487;&#25191;&#34892;&#30340;&#25215;&#35834;&#12290;&#21487;&#33021;&#38656;&#35201;&#36328;&#36234;&#38453;&#33829;&#36827;&#34892;&#25215;&#35834;&#65292;&#20197;&#23454;&#29616;&#25913;&#38761;&#30340;&#23454;&#26045;&#65292;&#21516;&#26102;&#38656;&#35201;&#25490;&#38500;&#26368;&#19981;&#28909;&#34935;&#20110;&#25913;&#38761;&#30340;&#25903;&#25345;&#32773;&#34987;&#35825;&#23548;&#25512;&#32763;&#20915;&#23450;&#12290;</title><link>http://arxiv.org/abs/2304.08008</link><description>&lt;p&gt;
&#22522;&#20110;&#25237;&#31080;&#32467;&#26524;&#30340;&#21435;&#20013;&#24515;&#21270;&#25215;&#35834;&#23545;&#27665;&#20027;&#20915;&#31574;&#30340;&#24433;&#21709;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Democratic Policy Decisions with Decentralized Promises Contingent on Vote Outcome. (arXiv:2304.08008v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.08008
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21435;&#20013;&#24515;&#21270;&#25215;&#35834;&#23545;&#27665;&#20027;&#20915;&#31574;&#30340;&#24433;&#21709;&#12290;&#22312;&#25237;&#31080;&#21069;&#65292;&#22996;&#21592;&#20250;&#25104;&#21592;&#21487;&#20197;&#36827;&#34892;&#21487;&#25191;&#34892;&#30340;&#25215;&#35834;&#12290;&#21487;&#33021;&#38656;&#35201;&#36328;&#36234;&#38453;&#33829;&#36827;&#34892;&#25215;&#35834;&#65292;&#20197;&#23454;&#29616;&#25913;&#38761;&#30340;&#23454;&#26045;&#65292;&#21516;&#26102;&#38656;&#35201;&#25490;&#38500;&#26368;&#19981;&#28909;&#34935;&#20110;&#25913;&#38761;&#30340;&#25903;&#25345;&#32773;&#34987;&#35825;&#23548;&#25512;&#32763;&#20915;&#23450;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#21435;&#20013;&#24515;&#21270;&#30340;&#25928;&#29992;&#36716;&#31227;&#25215;&#35834;&#22914;&#20309;&#24433;&#21709;&#25237;&#31080;&#26041;&#24335;&#30340;&#38598;&#20307;&#20915;&#31574;&#12290;&#22312;&#25237;&#31080;&#21069;&#65292;&#25903;&#25345;&#21644;&#21453;&#23545;&#39640;&#25928;&#25913;&#38761;&#30340;&#22996;&#21592;&#20250;&#25104;&#21592;&#21487;&#20197;&#36827;&#34892;&#21487;&#25191;&#34892;&#30340;&#25215;&#35834;&#12290;&#19968;&#20010;&#22343;&#34913;&#38656;&#35201;&#31283;&#23450;&#24615;&#21644;&#26368;&#23567;&#21270;&#30340;&#25215;&#35834;&#12290;&#24179;&#34913;&#25215;&#35834;&#26159;&#23384;&#22312;&#19988;&#19981;&#30830;&#23450;&#30340;&#65292;&#20294;&#20855;&#26377;&#35768;&#22810;&#20849;&#21516;&#30340;&#29305;&#24449;&#12290;&#38656;&#35201;&#39640;&#24378;&#24230;&#25104;&#21592;&#21521;&#20302;&#24378;&#24230;&#25104;&#21592;&#25552;&#20379;&#36716;&#31227;&#25215;&#35834;&#65292;&#24182;&#23548;&#33268;&#25913;&#38761;&#30340;&#23454;&#26045;&#12290;&#24403;&#25913;&#38761;&#25903;&#25345;&#32773;&#32570;&#20047;&#36275;&#22815;&#30340;&#25237;&#31080;&#26435;&#26102;&#65292;&#25215;&#35834;&#24517;&#39035;&#36328;&#36234;&#38453;&#33829;&#12290;&#21363;&#20351;&#25913;&#38761;&#25903;&#25345;&#32773;&#30340;&#32852;&#30431;&#26159;&#20915;&#23450;&#24615;&#30340;&#65292;&#25215;&#35834;&#20063;&#24517;&#39035;&#25490;&#38500;&#26368;&#19981;&#28909;&#34935;&#20110;&#25913;&#38761;&#30340;&#25903;&#25345;&#32773;&#34987;&#35825;&#23548;&#25512;&#32763;&#20915;&#23450;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#24179;&#34913;&#30340;&#25215;&#35834;&#19981;&#38656;&#35201;&#36328;&#36234;&#38453;&#33829;&#12290;&#25105;&#20204;&#36824;&#35752;&#35770;&#20102;&#19968;&#31995;&#21015;&#26377;&#38480;&#30340;&#25215;&#35834;&#65292;&#23454;&#29616;&#36798;&#21040;&#19968;&#20010;&#24179;&#34913;&#30340;&#29366;&#24577;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study how decentralized utility transfer promises affect collective decision-making by voting. Committee members with varying levels of support and opposition for an efficient reform can make enforceable promises before voting. An equilibrium requires stability and minimal promises. Equilibrium promises exist and are indeterminate, but do share several key characteristics. Equilibria require transfer promises from high to low intensity members and result in enacting the reform. When reform supporters lack sufficient voting power, promises must reach across the aisle. Even if the coalition of reform supporters is decisive, promises must preclude the least enthusiastic supporters of the reform from being enticed to overturn the decision. In that case, equilibrium promises do not need to reach across the aisle. We also discuss a finite sequence of promises that achieve an equilibrium.
&lt;/p&gt;</description></item><item><title>&#20171;&#32461;&#20102;&#29992;&#20110;&#27431;&#24335;&#26399;&#26435;&#23450;&#20215;&#30340; Fourier&#20313;&#24358;&#23637;&#24320; (COS) &#26041;&#27861;&#65292;&#36890;&#36807;&#25351;&#23450;&#25130;&#26029;&#33539;&#22260;&#21644;&#39033;&#25968;N&#36827;&#34892;&#36924;&#36817;&#65292;&#25991;&#31456;&#25552;&#20986;&#26126;&#30830;&#30340;N&#30340;&#19978;&#30028;&#65292;&#23545;&#23494;&#24230;&#24179;&#28369;&#24182;&#25351;&#25968;&#34928;&#20943;&#30340;&#24773;&#20917;&#65292;COS&#26041;&#27861;&#30340;&#25910;&#25947;&#38454;&#25968;&#33267;&#23569;&#26159;&#25351;&#25968;&#25910;&#25947;&#38454;&#25968;&#12290;</title><link>http://arxiv.org/abs/2303.16012</link><description>&lt;p&gt;
&#22914;&#20309;&#22788;&#29702;&#29992;&#20110;&#26399;&#26435;&#23450;&#20215;&#30340; COS &#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
How to handle the COS method for option pricing. (arXiv:2303.16012v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.16012
&lt;/p&gt;
&lt;p&gt;
&#20171;&#32461;&#20102;&#29992;&#20110;&#27431;&#24335;&#26399;&#26435;&#23450;&#20215;&#30340; Fourier&#20313;&#24358;&#23637;&#24320; (COS) &#26041;&#27861;&#65292;&#36890;&#36807;&#25351;&#23450;&#25130;&#26029;&#33539;&#22260;&#21644;&#39033;&#25968;N&#36827;&#34892;&#36924;&#36817;&#65292;&#25991;&#31456;&#25552;&#20986;&#26126;&#30830;&#30340;N&#30340;&#19978;&#30028;&#65292;&#23545;&#23494;&#24230;&#24179;&#28369;&#24182;&#25351;&#25968;&#34928;&#20943;&#30340;&#24773;&#20917;&#65292;COS&#26041;&#27861;&#30340;&#25910;&#25947;&#38454;&#25968;&#33267;&#23569;&#26159;&#25351;&#25968;&#25910;&#25947;&#38454;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Fourier&#20313;&#24358;&#23637;&#24320;&#65288;COS&#65289;&#26041;&#27861;&#29992;&#20110;&#39640;&#25928;&#22320;&#35745;&#31639;&#27431;&#24335;&#26399;&#26435;&#20215;&#26684;&#12290;&#35201;&#24212;&#29992;COS&#26041;&#27861;&#65292;&#24517;&#39035;&#25351;&#23450;&#20004;&#20010;&#21442;&#25968;&#65306;&#23545;&#25968;&#25910;&#30410;&#29575;&#23494;&#24230;&#30340;&#25130;&#26029;&#33539;&#22260;&#21644;&#29992;&#20313;&#24358;&#32423;&#25968;&#36924;&#36817;&#25130;&#26029;&#23494;&#24230;&#30340;&#39033;&#25968;N&#12290;&#22914;&#20309;&#36873;&#25321;&#25130;&#26029;&#33539;&#22260;&#24050;&#32463;&#20026;&#20154;&#25152;&#30693;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#36824;&#33021;&#25214;&#21040;&#19968;&#20010;&#26126;&#30830;&#30340;&#24182;&#19988;&#26377;&#29992;&#30340;&#39033;&#25968;N&#30340;&#30028;&#38480;&#12290;&#25105;&#20204;&#36824;&#36827;&#19968;&#27493;&#34920;&#26126;&#65292;&#22914;&#26524;&#23494;&#24230;&#26159;&#24179;&#28369;&#30340;&#24182;&#19988;&#21576;&#25351;&#25968;&#34928;&#20943;&#65292;&#21017;COS&#26041;&#27861;&#33267;&#23569;&#20855;&#26377;&#25351;&#25968;&#25910;&#25947;&#38454;&#25968;&#12290;&#20294;&#26159;&#65292;&#22914;&#26524;&#23494;&#24230;&#24179;&#28369;&#20294;&#26377;&#37325;&#23614;&#24052;&#65292;&#23601;&#20687;&#22312;&#26377;&#38480;&#30697;&#38453;log&#31283;&#23450;&#27169;&#22411;&#20013;&#19968;&#26679;&#65292;&#21017;COS&#26041;&#27861;&#27809;&#26377;&#25351;&#25968;&#25910;&#25947;&#38454;&#25968;&#12290;&#25968;&#20540;&#23454;&#39564;&#30830;&#35748;&#20102;&#29702;&#35770;&#21457;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Fourier cosine expansion (COS) method is used for pricing European options numerically very efficiently. To apply the COS method, one has to specify two parameters: a truncation range for the density of the log-returns and a number of terms N to approximate the truncated density by a cosine series. How to choose the truncation range is already known. Here, we are able to find an explicit and useful bound for N as well. We further show that the COS method has at least an exponential order of convergence if the density is smooth and decays exponentially. But, if the density is smooth and has heavy tails like in the Finite Moment Log Stable model, the COS method has not an exponential order of convergence. Numerical experiments confirm the theoretical findings.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#31995;&#32479;&#22320;&#30740;&#31350;&#20102;&#36127;&#30456;&#20851;&#24615;&#30340;&#19968;&#31181;&#26497;&#31471;&#24418;&#24335;&#8212;&#8212;&#19968;&#23545;&#19968;&#21453;&#21333;&#35843;&#24615;&#65292;&#24182;&#19988;&#22312;&#37327;&#20301;&#20195;&#29702;&#30340;&#39118;&#38505;&#20849;&#25285;&#38382;&#39064;&#20013;&#25214;&#21040;&#20102;&#23427;&#30340;&#24212;&#29992;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2302.11701</link><description>&lt;p&gt;
&#19968;&#23545;&#19968;&#21453;&#21333;&#35843;&#24615;
&lt;/p&gt;
&lt;p&gt;
Pairwise counter-monotonicity. (arXiv:2302.11701v2 [q-fin.RM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.11701
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#31995;&#32479;&#22320;&#30740;&#31350;&#20102;&#36127;&#30456;&#20851;&#24615;&#30340;&#19968;&#31181;&#26497;&#31471;&#24418;&#24335;&#8212;&#8212;&#19968;&#23545;&#19968;&#21453;&#21333;&#35843;&#24615;&#65292;&#24182;&#19988;&#22312;&#37327;&#20301;&#20195;&#29702;&#30340;&#39118;&#38505;&#20849;&#25285;&#38382;&#39064;&#20013;&#25214;&#21040;&#20102;&#23427;&#30340;&#24212;&#29992;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#31995;&#32479;&#22320;&#30740;&#31350;&#20102;&#19968;&#23545;&#19968;&#21453;&#21333;&#35843;&#24615;&#65292;&#36825;&#26159;&#36127;&#30456;&#20851;&#24615;&#30340;&#19968;&#31181;&#26497;&#31471;&#24418;&#24335;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#20010;&#38543;&#26426;&#34920;&#31034;&#21644;&#19968;&#20010;&#19981;&#21464;&#24615;&#36136;&#26469;&#25551;&#36848;&#36825;&#31181;&#20381;&#36182;&#32467;&#26500;&#12290;&#25105;&#20204;&#34920;&#26126;&#19968;&#23545;&#19968;&#21453;&#21333;&#35843;&#24615;&#24847;&#21619;&#30528;&#36127;&#30456;&#20851;&#24615;&#65292;&#24182;&#19988;&#24403;&#30456;&#21516;&#36793;&#38469;&#20998;&#24067;&#21487;&#20197;&#23454;&#29616;&#26102;&#65292;&#21644;&#32852;&#21512;&#28151;&#21512;&#20381;&#36182;&#24615;&#31561;&#20215;&#12290;&#25105;&#20204;&#21457;&#29616;&#19968;&#23545;&#19968;&#21453;&#21333;&#35843;&#24615;&#21644;&#37327;&#20301;&#20195;&#29702;&#30340;&#39118;&#38505;&#20849;&#25285;&#38382;&#39064;&#20043;&#38388;&#23384;&#22312;&#23494;&#20999;&#32852;&#31995;&#12290;&#36825;&#20010;&#32467;&#26524;&#24378;&#35843;&#20102;&#36825;&#31181;&#26497;&#31471;&#36127;&#30456;&#20851;&#20381;&#36182;&#32467;&#26500;&#22312;&#19981;&#20197;&#32463;&#20856;&#26041;&#24335;&#20882;&#38505;&#30340;&#20195;&#29702;&#20154;&#30340;&#26368;&#20248;&#37197;&#32622;&#20013;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We systemically study pairwise counter-monotonicity, an extremal notion of negative dependence. A stochastic representation and an invariance property are established for this dependence structure. We show that pairwise counter-monotonicity implies negative association, and it is equivalent to joint mix dependence if both are possible for the same marginal distributions. We find an intimate connection between pairwise counter-monotonicity and risk sharing problems for quantile agents. This result highlights the importance of this extremal negative dependence structure in optimal allocations for agents who are not risk averse in the classic sense.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#21442;&#25968;&#21270;&#30340;&#25511;&#21046;&#21464;&#37327;&#30340;&#31070;&#32463; SDE &#26041;&#27861;&#65292;&#20197;&#20943;&#23569;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#27169;&#25311;&#30340;&#26041;&#24046;&#65292;&#24182;&#22312;&#20960;&#20010;&#26399;&#26435;&#23450;&#20215;&#30340;&#25968;&#20540;&#20363;&#23376;&#20013;&#39564;&#35777;&#20854;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2209.12885</link><description>&lt;p&gt;
&#38024;&#23545;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#30340;&#31070;&#32463;&#26041;&#24046;&#32553;&#20943;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Neural variance reduction for stochastic differential equations. (arXiv:2209.12885v2 [math.NA] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.12885
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#21442;&#25968;&#21270;&#30340;&#25511;&#21046;&#21464;&#37327;&#30340;&#31070;&#32463; SDE &#26041;&#27861;&#65292;&#20197;&#20943;&#23569;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#27169;&#25311;&#30340;&#26041;&#24046;&#65292;&#24182;&#22312;&#20960;&#20010;&#26399;&#26435;&#23450;&#20215;&#30340;&#25968;&#20540;&#20363;&#23376;&#20013;&#39564;&#35777;&#20854;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26041;&#24046;&#32553;&#20943;&#25216;&#26415;&#23545;&#20110;&#37329;&#34701;&#24212;&#29992;&#20013;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#30340;&#25928;&#29575;&#38750;&#24120;&#37325;&#35201;&#12290;&#25105;&#20204;&#25552;&#20986;&#20351;&#29992;&#31070;&#32463; SDE&#65288;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65289;&#65292;&#20854;&#20013;&#30340;&#25511;&#21046;&#21464;&#37327;&#30001;&#31070;&#32463;&#32593;&#32476;&#21442;&#25968;&#21270;&#65292;&#20197;&#23398;&#20064;&#36817;&#20284;&#26368;&#20248;&#25511;&#21046;&#21464;&#37327;&#65292;&#20174;&#32780;&#22312;&#27169;&#25311; SDE &#36712;&#36857;&#26102;&#20943;&#23569;&#26041;&#24046;&#12290;&#25105;&#20204;&#32771;&#34385;&#30001;&#24067;&#26391;&#36816;&#21160;&#39537;&#21160;&#30340; SDE &#21644;&#26356;&#19968;&#33324;&#30340;&#30001; L\'{e}vy &#36807;&#31243;&#39537;&#21160;&#30340; SDE&#65292;&#21253;&#25324;&#37027;&#20123;&#20855;&#26377;&#26080;&#38480;&#27963;&#21160;&#30340; SDE&#12290;&#23545;&#20110;&#21518;&#19968;&#31181;&#24773;&#20917;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#26041;&#24046;&#32553;&#20943;&#30340;&#26368;&#20248;&#24615;&#26465;&#20214;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#20960;&#20010;&#20851;&#20110;&#26399;&#26435;&#23450;&#20215;&#30340;&#25968;&#20540;&#20363;&#23376;&#12290;
&lt;/p&gt;
&lt;p&gt;
Variance reduction techniques are of crucial importance for the efficiency of Monte Carlo simulations in finance applications. We propose the use of neural SDEs, with control variates parameterized by neural networks, in order to learn approximately optimal control variates and hence reduce variance as trajectories of the SDEs are being simulated. We consider SDEs driven by Brownian motion and, more generally, by L\'{e}vy processes including those with infinite activity. For the latter case, we prove optimality conditions for the variance reduction. Several numerical examples from option pricing are presented.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#19968;&#31181;&#21453;&#21521;ES&#20248;&#21270;&#20844;&#24335;&#65292;&#20854;&#20013;&#24179;&#22343;&#36229;&#39069;&#20989;&#25968;&#26159;ES&#26354;&#32447;&#20943;&#21435;&#32447;&#24615;&#20989;&#25968;&#30340;&#26368;&#22823;&#20540;&#65292;&#25581;&#31034;&#20102;&#20248;&#32654;&#30340;&#23545;&#31216;&#24615;&#12290;&#35813;&#20844;&#24335;&#23558;ES&#25512;&#24191;&#21040;&#19968;&#31181;&#27969;&#34892;&#30340;&#39118;&#38505;&#24230;&#37327;&#30340;&#31867;&#21035;&#12290;</title><link>http://arxiv.org/abs/2203.02599</link><description>&lt;p&gt;
&#19968;&#31181;&#21453;&#21521;ES&#65288;CVaR&#65289;&#20248;&#21270;&#20844;&#24335;
&lt;/p&gt;
&lt;p&gt;
A reverse ES (CVaR) optimization formula. (arXiv:2203.02599v2 [q-fin.RM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.02599
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#19968;&#31181;&#21453;&#21521;ES&#20248;&#21270;&#20844;&#24335;&#65292;&#20854;&#20013;&#24179;&#22343;&#36229;&#39069;&#20989;&#25968;&#26159;ES&#26354;&#32447;&#20943;&#21435;&#32447;&#24615;&#20989;&#25968;&#30340;&#26368;&#22823;&#20540;&#65292;&#25581;&#31034;&#20102;&#20248;&#32654;&#30340;&#23545;&#31216;&#24615;&#12290;&#35813;&#20844;&#24335;&#23558;ES&#25512;&#24191;&#21040;&#19968;&#31181;&#27969;&#34892;&#30340;&#39118;&#38505;&#24230;&#37327;&#30340;&#31867;&#21035;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21453;&#21521;ES&#20248;&#21270;&#20844;&#24335;&#65292;&#23427;&#34920;&#26126;&#22312;&#22266;&#23450;&#27010;&#29575;&#27700;&#24179;&#19979;&#30340;ES&#26159;&#19968;&#20010;&#32447;&#24615;&#23454;&#20989;&#25968;&#21152;&#19978;&#19968;&#20010;&#32553;&#25918;&#30340;&#24179;&#22343;&#36229;&#39069;&#20989;&#25968;&#30340;&#26368;&#23567;&#20540;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#31181;&#21453;&#21521;ES&#20248;&#21270;&#20844;&#24335;&#65292; &#23427;&#34920;&#26126;&#22312;&#20219;&#20309;&#22266;&#23450;&#38408;&#20540;&#19979;&#30340;&#24179;&#22343;&#36229;&#39069;&#20989;&#25968;&#26159;ES&#26354;&#32447;&#20943;&#21435;&#19968;&#20010;&#32447;&#24615;&#20989;&#25968;&#30340;&#26368;&#22823;&#20540;&#12290;&#34429;&#28982;&#36825;&#26159;&#19968;&#20010;&#31616;&#21333;&#30340;&#32467;&#26524;&#65292;&#20294;&#35813;&#20844;&#24335;&#25581;&#31034;&#20102;&#24179;&#22343;&#36229;&#39069;&#20989;&#25968;&#21644;ES&#26354;&#32447;&#65292;&#20197;&#21450;&#23427;&#20204;&#30340;&#26368;&#20248;&#35299;&#20043;&#38388;&#30340;&#20248;&#32654;&#23545;&#31216;&#24615;&#12290;&#21453;&#21521;ES&#20248;&#21270;&#20844;&#24335;&#19982;Fenchel-Legendre&#21464;&#25442;&#23494;&#20999;&#30456;&#20851;&#65292;&#24182;&#19988;&#25105;&#20204;&#30340;&#20844;&#24335;&#26159;&#23558;ES&#25512;&#24191;&#21040;&#20248;&#21270;&#30830;&#23450;&#24615;&#31561;&#20215;&#29289;&#65292;&#36825;&#26159;&#19968;&#31181;&#27969;&#34892;&#30340;&#20984;&#39118;&#38505;&#24230;&#37327;&#30340;&#31867;&#21035;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#20004;&#31181;&#27969;&#34892;&#30340;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#24773;&#20917;&#19979;&#30340;&#24179;&#22343;&#36229;&#39069;&#20989;&#25968;&#30340;&#26368;&#22351;&#24773;&#20917;&#20540;&#65292;&#20197;&#35828;&#26126;&#21453;&#21521;ES&#20248;&#21270;&#20844;&#24335;&#30340;&#23454;&#29992;&#24615;&#65292;&#24182;&#20351;&#29992;&#20445;&#38505;&#25968;&#25454;&#38598;&#23637;&#31034;&#20102;&#23427;&#30340;&#36827;&#19968;&#27493;&#35777;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
The celebrated Expected Shortfall (ES) optimization formula implies that ES at a fixed probability level is the minimum of a linear real function plus a scaled mean excess function. We establish a reverse ES optimization formula, which says that a mean excess function at any fixed threshold is the maximum of an ES curve minus a linear function. Despite being a simple result, this formula reveals elegant symmetries between the mean excess function and the ES curve, as well as their optimizers. The reverse ES optimization formula is closely related to the Fenchel-Legendre transforms, and our formulas are generalized from ES to optimized certainty equivalents, a popular class of convex risk measures. We analyze worst-case values of the mean excess function under two popular settings of model uncertainty to illustrate the usefulness of the reverse ES optimization formula, and this is further demonstrated with an application using insurance datasets.
&lt;/p&gt;</description></item></channel></rss>