<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#31895;&#31961;&#27874;&#21160;&#29575;&#25552;&#20379;&#20102;&#25429;&#25417;&#32929;&#20215;&#21160;&#24577;&#29305;&#24615;&#30340;&#19968;&#33268;&#26694;&#26550;&#65292;&#22312;&#21382;&#21490;&#34913;&#37327;&#21644;&#23450;&#20215;&#30446;&#30340;&#19979;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#38750;&#30830;&#23450;&#24615;&#39118;&#38505;&#23545;&#23450;&#20215;&#30340;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2403.11897</link><description>&lt;p&gt;
&#39118;&#38505;&#28322;&#20215;&#21644;&#31895;&#31961;&#27874;&#21160;&#29575;
&lt;/p&gt;
&lt;p&gt;
Risk premium and rough volatility
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11897
&lt;/p&gt;
&lt;p&gt;
&#31895;&#31961;&#27874;&#21160;&#29575;&#25552;&#20379;&#20102;&#25429;&#25417;&#32929;&#20215;&#21160;&#24577;&#29305;&#24615;&#30340;&#19968;&#33268;&#26694;&#26550;&#65292;&#22312;&#21382;&#21490;&#34913;&#37327;&#21644;&#23450;&#20215;&#30446;&#30340;&#19979;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#38750;&#30830;&#23450;&#24615;&#39118;&#38505;&#23545;&#23450;&#20215;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31895;&#31961;&#27874;&#21160;&#29575;&#24050;&#34987;&#35777;&#26126;&#20026;&#19968;&#31181;&#19968;&#33268;&#30340;&#26694;&#26550;&#65292;&#33021;&#22815;&#25429;&#25417;&#32929;&#20215;&#21160;&#24577;&#30340;&#29305;&#24615;&#65292;&#22312;&#21382;&#21490;&#34913;&#37327;&#19979;&#20197;&#21450;&#29992;&#20110;&#23450;&#20215;&#30446;&#30340;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#27874;&#21160;&#29575;&#39118;&#38505;&#30340;&#24066;&#22330;&#20215;&#26684;&#26159;&#37329;&#34701;&#32463;&#27982;&#23398;&#20013;&#19968;&#20010;&#34987;&#24191;&#27867;&#30740;&#31350;&#30340;&#23545;&#35937;&#65292;&#32463;&#39564;&#20272;&#35745;&#34920;&#26126;&#20854;&#26159;&#38543;&#26426;&#30340;&#32780;&#38750;&#30830;&#23450;&#24615;&#30340;&#12290;&#20174;&#21382;&#21490;&#34913;&#37327;&#19979;&#30340;&#31895;&#31961;&#27874;&#21160;&#29575;&#27169;&#22411;&#20986;&#21457;&#65292;&#25105;&#20204;&#25509;&#21463;&#20102;&#36825;&#19968;&#25361;&#25112;&#65292;&#24182;&#23545;&#36825;&#31181;&#38750;&#30830;&#23450;&#24615;&#39118;&#38505;&#23545;&#23450;&#20215;&#30446;&#30340;&#30340;&#24433;&#21709;&#36827;&#34892;&#20102;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11897v1 Announce Type: new  Abstract: One the one hand, rough volatility has been shown to provide a consistent framework to capture the properties of stock price dynamics both under the historical measure and for pricing purposes. On the other hand, market price of volatility risk is a well-studied object in Financial Economics, and empirical estimates show it to be stochastic rather than deterministic. Starting from a rough volatility model under the historical measure, we take up this challenge and provide an analysis of the impact of such a non-deterministic risk for pricing purposes.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#20010;&#26032;&#30340;&#27010;&#24565;&#8212;&#8212;&#23556;&#24433;&#21487;&#27979;&#20989;&#25968;&#65292;&#24182;&#22312;&#25237;&#36164;&#32773;&#20855;&#26377;&#38750;&#20985;&#25928;&#29992;&#20989;&#25968;&#20197;&#21450;&#23384;&#22312;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#26102;&#65292;&#35777;&#26126;&#20102;&#22312;&#25928;&#29992;&#20989;&#25968;&#19978;&#21322;&#36830;&#32493;&#30340;&#24773;&#20917;&#19979;&#23384;&#22312;&#26368;&#20248;&#25237;&#36164;&#31574;&#30053;&#12290;</title><link>https://arxiv.org/abs/2403.11824</link><description>&lt;p&gt;
&#38750;&#20985;&#20581;&#22766;&#25928;&#29992;&#26368;&#22823;&#21270;&#22312;&#23556;&#24433;&#20915;&#23450;&#24615;&#19979;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Nonconcave Robust Utility Maximization under Projective Determinacy
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11824
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#20010;&#26032;&#30340;&#27010;&#24565;&#8212;&#8212;&#23556;&#24433;&#21487;&#27979;&#20989;&#25968;&#65292;&#24182;&#22312;&#25237;&#36164;&#32773;&#20855;&#26377;&#38750;&#20985;&#25928;&#29992;&#20989;&#25968;&#20197;&#21450;&#23384;&#22312;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#26102;&#65292;&#35777;&#26126;&#20102;&#22312;&#25928;&#29992;&#20989;&#25968;&#19978;&#21322;&#36830;&#32493;&#30340;&#24773;&#20917;&#19979;&#23384;&#22312;&#26368;&#20248;&#25237;&#36164;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#22312;&#19968;&#33324;&#31163;&#25955;&#26102;&#38388;&#26080;&#25705;&#25830;&#24066;&#22330;&#20013;&#30340;&#20581;&#22766;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#12290;&#25237;&#36164;&#32773;&#34987;&#20551;&#23450;&#20855;&#26377;&#19968;&#20010;&#38543;&#26426;&#12289;&#38750;&#20985;&#19988;&#38750;&#36882;&#20943;&#30340;&#25928;&#29992;&#20989;&#25968;&#65292;&#35813;&#20989;&#25968;&#21487;&#33021;&#22312;&#25972;&#20010;&#23454;&#25968;&#32447;&#19978;&#26159;&#26377;&#38480;&#30340;&#65292;&#20063;&#21487;&#33021;&#19981;&#26159;&#26377;&#38480;&#30340;&#12290;&#22905;&#36824;&#38754;&#20020;&#23545;&#24066;&#22330;&#20449;&#24565;&#30340;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#65292;&#36825;&#26159;&#36890;&#36807;&#19968;&#32452;&#20808;&#39564;&#26469;&#24314;&#27169;&#30340;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#24403;&#25928;&#29992;&#20989;&#25968;&#20063;&#26159;&#19978;&#21322;&#36830;&#32493;&#30340;&#26102;&#65292;&#23384;&#22312;&#19968;&#20010;&#26368;&#20248;&#25237;&#36164;&#31574;&#30053;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#26032;&#30340;&#23556;&#24433;&#21487;&#27979;&#20989;&#25968;&#30340;&#27010;&#24565;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#20123;&#20989;&#25968;&#30340;&#22522;&#26412;&#23646;&#24615;&#65292;&#22914;&#22312;&#27714;&#21644;&#12289;&#24046;&#24322;&#12289;&#20056;&#31215;&#12289;&#19978;&#30830;&#30028;&#12289;&#19979;&#30830;&#30028;&#21644;&#22797;&#21512;&#19979;&#30340;&#31283;&#23450;&#24615;&#65292;&#20294;&#20063;&#20551;&#35774;&#23556;&#24433;&#20915;&#23450;&#24615;&#30340;&#38598;&#21512;&#35770;&#20844;&#29702;&#19979;&#31215;&#20998;&#19979;&#30340;&#31283;&#23450;&#24615;&#21644;&#23384;&#22312;$\epsilon$-&#26368;&#20248;&#36873;&#25321;&#22120;&#12290;&#25105;&#20204;&#32771;&#34385;&#23556;&#24433;&#21487;&#27979;&#30340;&#38543;&#26426;&#25928;&#29992;&#20989;&#25968;&#21644;&#20215;&#26684;&#36807;&#31243;&#65292;&#24182;&#20551;&#35774;&#23427;&#20204;&#30340;&#22270;&#24418;&#20026;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11824v1 Announce Type: new  Abstract: We study a robust utility maximization problem in a general discrete-time frictionless market. The investor is assumed to have a random, nonconcave and nondecreasing utility function, which may or may not be finite on the whole real-line. She also faces model ambiguity on her beliefs about the market, which is modeled through a set of priors. We prove, using only primal methods, the existence of an optimal investment strategy when the utility function is also upper-semicontinuous. For that, we introduce the new notion of projectively measurable functions. We show basic properties of these functions as stability under sums, differences, products, suprema, infima and compositions but also assuming the set-theoretical axiom of Projective Determinacy (PD) stability under integration and existence of $\epsilon$-optimal selectors. We consider projectively measurable random utility function and price process and assume that the graphs of the se
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#22522;&#20110;&#29305;&#24449;&#26680;&#30340;&#36335;&#24452;&#20381;&#36182;PDE&#27714;&#35299;&#22120;&#65292;&#35777;&#26126;&#20102;&#20854;&#19968;&#33268;&#24615;&#21644;&#25910;&#25947;&#24615;&#65292;&#24182;&#23637;&#31034;&#20102;&#22312;&#26399;&#26435;&#23450;&#20215;&#39046;&#22495;&#30340;&#25968;&#20540;&#31034;&#20363;&#12290;</title><link>https://arxiv.org/abs/2403.11738</link><description>&lt;p&gt;
&#22522;&#20110;&#29305;&#24449;&#26680;&#30340;&#36335;&#24452;&#20381;&#36182;PDE&#27714;&#35299;&#22120;
&lt;/p&gt;
&lt;p&gt;
A path-dependent PDE solver based on signature kernels
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11738
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#22522;&#20110;&#29305;&#24449;&#26680;&#30340;&#36335;&#24452;&#20381;&#36182;PDE&#27714;&#35299;&#22120;&#65292;&#35777;&#26126;&#20102;&#20854;&#19968;&#33268;&#24615;&#21644;&#25910;&#25947;&#24615;&#65292;&#24182;&#23637;&#31034;&#20102;&#22312;&#26399;&#26435;&#23450;&#20215;&#39046;&#22495;&#30340;&#25968;&#20540;&#31034;&#20363;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#22522;&#20110;&#29305;&#24449;&#26680;&#30340;&#36335;&#24452;&#20381;&#36182;PDE&#65288;PPDE&#65289;&#30340;&#25910;&#25947;&#35777;&#26126;&#27714;&#35299;&#22120;&#12290;&#25105;&#20204;&#30340;&#25968;&#20540;&#26041;&#26696;&#21033;&#29992;&#20102;&#29305;&#24449;&#26680;&#65292;&#36825;&#26159;&#26368;&#36817;&#22312;&#36335;&#24452;&#31354;&#38388;&#19978;&#24341;&#20837;&#30340;&#19968;&#31867;&#26680;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#36890;&#36807;&#22312;&#31526;&#21495;&#20877;&#29983;&#26680;&#24076;&#23572;&#20271;&#29305;&#31354;&#38388;&#65288;RKHS&#65289;&#20013;&#36817;&#20284;PPDE&#30340;&#35299;&#26469;&#35299;&#20915;&#19968;&#20010;&#26368;&#20248;&#24674;&#22797;&#38382;&#39064;&#65292;&#35813;&#31354;&#38388;&#21463;&#21040;&#22312;&#26377;&#38480;&#38598;&#21512;&#30340;&#36828;&#31243;&#36335;&#24452;&#19978;&#28385;&#36275;PPDE&#32422;&#26463;&#30340;&#20803;&#32032;&#30340;&#32422;&#26463;&#12290;&#22312;&#32447;&#24615;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20248;&#21270;&#20855;&#26377;&#21807;&#19968;&#30340;&#38381;&#24335;&#35299;&#65292;&#20854;&#20197;&#36828;&#31243;&#36335;&#24452;&#22788;&#30340;&#29305;&#24449;&#26680;&#35780;&#20272;&#30340;&#24418;&#24335;&#34920;&#31034;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#25152;&#25552;&#20986;&#26041;&#26696;&#30340;&#19968;&#33268;&#24615;&#65292;&#20445;&#35777;&#22312;&#36828;&#31243;&#28857;&#25968;&#22686;&#21152;&#26102;&#25910;&#25947;&#21040;PPDE&#35299;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#20960;&#20010;&#25968;&#20540;&#20363;&#23376;&#65292;&#23588;&#20854;&#26159;&#22312;&#31895;&#31961;&#27874;&#21160;&#29575;&#19979;&#30340;&#26399;&#26435;&#23450;&#20215;&#32972;&#26223;&#19979;&#12290;&#25105;&#20204;&#30340;&#25968;&#20540;&#26041;&#26696;&#26500;&#25104;&#20102;&#19968;&#31181;&#26367;&#20195;&#24615;&#30340;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#30340;&#26377;&#25928;&#26367;&#20195;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11738v1 Announce Type: cross  Abstract: We develop a provably convergent kernel-based solver for path-dependent PDEs (PPDEs). Our numerical scheme leverages signature kernels, a recently introduced class of kernels on path-space. Specifically, we solve an optimal recovery problem by approximating the solution of a PPDE with an element of minimal norm in the signature reproducing kernel Hilbert space (RKHS) constrained to satisfy the PPDE at a finite collection of collocation paths. In the linear case, we show that the optimisation has a unique closed-form solution expressed in terms of signature kernel evaluations at the collocation paths. We prove consistency of the proposed scheme, guaranteeing convergence to the PPDE solution as the number of collocation points increases. Finally, several numerical examples are presented, in particular in the context of option pricing under rough volatility. Our numerical scheme constitutes a valid alternative to the ubiquitous Monte Carl
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#23637;&#31034;&#20102;&#22914;&#20309;&#23558;&#34892;&#26143;&#36793;&#30028;&#26694;&#26550;&#36716;&#21270;&#20026;&#19981;&#21516;&#35268;&#27169;&#30340;&#22269;&#23478;&#12289;&#22478;&#24066;&#21644;&#20135;&#19994;&#65292;&#28982;&#21518;&#23558;&#20854;&#24212;&#29992;&#21040;&#29790;&#22763;&#65292;&#35780;&#20272;&#20854;&#26159;&#21542;&#22312;&#23433;&#20840;&#36816;&#33829;&#31354;&#38388;&#20869;&#29983;&#27963;&#12290;</title><link>https://arxiv.org/abs/2403.11680</link><description>&lt;p&gt;
&#22810;&#23610;&#24230;&#21462;&#21521;&#20540;&#23545;&#29983;&#29289;&#22810;&#26679;&#24615;&#12289;&#27668;&#20505;&#21644;&#27700;&#36164;&#28304;&#30340;&#24433;&#21709;&#65306;&#22522;&#20110;&#31185;&#23398;&#30340;&#25351;&#26631;
&lt;/p&gt;
&lt;p&gt;
Multiscale Orientation Values for Biodiversity, Climate and Water: A Scientific Input for Science- Based Targets
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11680
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23637;&#31034;&#20102;&#22914;&#20309;&#23558;&#34892;&#26143;&#36793;&#30028;&#26694;&#26550;&#36716;&#21270;&#20026;&#19981;&#21516;&#35268;&#27169;&#30340;&#22269;&#23478;&#12289;&#22478;&#24066;&#21644;&#20135;&#19994;&#65292;&#28982;&#21518;&#23558;&#20854;&#24212;&#29992;&#21040;&#29790;&#22763;&#65292;&#35780;&#20272;&#20854;&#26159;&#21542;&#22312;&#23433;&#20840;&#36816;&#33829;&#31354;&#38388;&#20869;&#29983;&#27963;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;&#20351;&#29992;&#19981;&#21516;&#30340;&#20998;&#37197;&#26041;&#27861;&#26469;&#23454;&#26045;&#22269;&#23478;&#12289;&#37096;&#38376;&#21644;&#22478;&#24066;&#35268;&#27169;&#30340;&#34892;&#26143;&#36793;&#30028;&#65288;PB&#65289;&#26694;&#26550;&#25152;&#28041;&#21450;&#30340;&#19968;&#31995;&#21015;&#36873;&#25321;&#21644;&#32467;&#26524;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#65306;&#65288;i&#65289;&#22914;&#20309;&#23558;PB&#26694;&#26550;&#36716;&#21270;&#20026;&#21508;&#31181;&#20122;&#20840;&#29699;&#35268;&#27169;&#65288;&#22269;&#23478;&#12289;&#22478;&#24066;&#12289;&#20135;&#19994;&#65289;&#65307;&#20197;&#21450;&#65288;ii&#65289;&#22914;&#20309;&#32771;&#34385;&#20840;&#29699;/&#26412;&#22320;&#26041;&#38754;&#65288;&#20363;&#22914;&#65292;&#22312;&#27969;&#22495;&#27700;&#21033;&#29992;&#65289;&#12290; &#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#24212;&#29992;&#21040;&#29790;&#22763;&#65292;&#20197;&#21046;&#23450;&#31526;&#21512;PB&#27010;&#24565;&#30340;&#22269;&#23478;&#12289;&#22478;&#24066;&#21644;&#37096;&#38376;&#29305;&#23450;&#39044;&#31639;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#23558;&#32763;&#35793;&#21518;&#30340;PB&#22312;&#27668;&#20505;&#12289;&#29983;&#29289;&#22810;&#26679;&#24615;&#21644;&#28129;&#27700;&#20351;&#29992;&#26041;&#38754;&#19982;&#29790;&#22763;&#23454;&#38469;&#29615;&#22659;&#21387;&#21147;&#36827;&#34892;&#22522;&#20934;&#27604;&#36739;&#65292;&#20174;&#29983;&#20135;&#21644;&#28040;&#36153;&#35282;&#24230;&#32508;&#21512;&#35780;&#20272;&#29790;&#22763;&#26159;&#21542;&#22312;&#20854;&#23433;&#20840;&#36816;&#33829;&#31354;&#38388;&#20869;&#29983;&#27963;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11680v1 Announce Type: new  Abstract: In this study, we explore a range of options and outcomes associated with using different allocation approaches to operationalise the Planetary Boundaries (PB) framework at the country, sector, and city scales. We demonstrate: (i) how to translate the PB framework into various sub-global scales (countries, cities, industries); and (ii) how to take global/local aspects (e.g., water use at the watershed level) into account. Finally, we apply the proposed methodology to derive country, city, and sector-specific budgets consistent with the PB concept for Switzerland. We then benchmark the translated PBs for climate, biodiversity, and freshwater use against actual environmental pressures in Switzerland from both production- and consumption-based perspectives. This effectively enables us to provide a comprehensive assessment of whether Switzerland is living within its safe operating space.
&lt;/p&gt;</description></item><item><title>ESG&#25351;&#23548;&#21407;&#21017;&#21487;&#20197;&#22312;&#38477;&#20302;&#25237;&#36164;&#32452;&#21512;&#36793;&#30028;&#30340;&#19981;&#36275;&#30340;&#21516;&#26102;&#23548;&#33268;&#26356;&#39640;&#30340;&#39118;&#38505;&#26041;&#24046;&#65292;&#26681;&#25454;&#25968;&#25454;&#26174;&#31034;&#65292;&#36127;&#30340;ESG&#28322;&#20215;&#26159;&#24403;ESG&#25351;&#23548;&#21407;&#21017;&#23545;&#36164;&#20135;&#31649;&#29702;&#32773;&#26377;&#32422;&#26463;&#21147;&#26102;&#20135;&#29983;&#30340;&#12290;</title><link>https://arxiv.org/abs/2403.11622</link><description>&lt;p&gt;
&#20855;&#26377;ESG&#25351;&#23548;&#21407;&#21017;&#30340;&#36164;&#20135;&#31649;&#29702;
&lt;/p&gt;
&lt;p&gt;
Asset management with an ESG mandate
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11622
&lt;/p&gt;
&lt;p&gt;
ESG&#25351;&#23548;&#21407;&#21017;&#21487;&#20197;&#22312;&#38477;&#20302;&#25237;&#36164;&#32452;&#21512;&#36793;&#30028;&#30340;&#19981;&#36275;&#30340;&#21516;&#26102;&#23548;&#33268;&#26356;&#39640;&#30340;&#39118;&#38505;&#26041;&#24046;&#65292;&#26681;&#25454;&#25968;&#25454;&#26174;&#31034;&#65292;&#36127;&#30340;ESG&#28322;&#20215;&#26159;&#24403;ESG&#25351;&#23548;&#21407;&#21017;&#23545;&#36164;&#20135;&#31649;&#29702;&#32773;&#26377;&#32422;&#26463;&#21147;&#26102;&#20135;&#29983;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#24403;&#19968;&#20010;&#26426;&#26500;&#25237;&#36164;&#32773;&#26088;&#22312;&#26368;&#23567;&#21270;&#36319;&#36394;&#35823;&#24046;&#26041;&#24046;&#65292;&#24182;&#23454;&#29616;&#39640;&#20110;&#22522;&#20934;ESG&#20998;&#25968;&#65288;ESG&#25351;&#23548;&#21407;&#21017;&#65289;&#26102;&#30340;&#22343;&#34913;&#19979;&#30340;&#25237;&#36164;&#32452;&#21512;&#36793;&#30028;&#21644;&#39118;&#38505;&#28322;&#20215;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#22914;&#26524;&#24066;&#22330;&#20026;&#32929;&#31080;&#23450;&#20215;&#20102;&#36127;&#30340;ESG&#28322;&#20215;&#65292;&#37027;&#20040;&#24403;&#36164;&#20135;&#31649;&#29702;&#32773;&#20197;&#26377;&#38480;&#30340;&#36229;&#36234;&#22522;&#20934;&#30340;&#32489;&#25928;&#20026;&#30446;&#26631;&#26102;&#65292;ESG&#25351;&#23548;&#21407;&#21017;&#21487;&#20197;&#20943;&#23569;&#25237;&#36164;&#32452;&#21512;&#36793;&#30028;&#30340;&#22343;&#20540;-&#26041;&#24046;&#25928;&#29575;&#19981;&#36275;&#12290;&#32780;&#23545;&#20110;&#39640;&#36229;&#36234;&#30446;&#26631;&#65292;ESG&#25351;&#23548;&#21407;&#21017;&#23548;&#33268;&#26356;&#39640;&#30340;&#26041;&#24046;&#12290;&#22343;&#20540;-&#26041;&#24046;&#30340;&#25913;&#21892;&#26159;&#22240;&#20026;ESG&#25351;&#23548;&#21407;&#21017;&#20419;&#20351;&#36164;&#20135;&#31649;&#29702;&#32773;&#36807;&#24230;&#25237;&#36164;&#20110;&#20855;&#26377;&#39640;&#22343;&#20540;-&#26631;&#20934;&#24046;&#27604;&#29575;&#30340;&#36164;&#20135;&#12290;&#22312;&#22343;&#34913;&#29366;&#24577;&#19979;&#65292;&#24403;&#36164;&#20135;&#31649;&#29702;&#32773;&#21644;&#22343;&#20540;-&#26041;&#24046;&#25237;&#36164;&#32773;&#23384;&#22312;&#26102;&#65292;&#22914;&#26524;ESG&#25351;&#23548;&#21407;&#21017;&#23545;&#36164;&#20135;&#31649;&#29702;&#32773;&#20855;&#26377;&#32422;&#26463;&#21147;&#65292;&#23558;&#20986;&#29616;&#36127;&#30340;ESG&#28322;&#20215;&#12290;&#36825;&#19968;&#32467;&#26524;&#24471;&#21040;&#20102;&#25968;&#25454;&#25903;&#25745;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11622v1 Announce Type: new  Abstract: We investigate the portfolio frontier and risk premia in equilibrium when an institutional investor aims to minimize the tracking error variance and to attain an ESG score higher than the benchmark's one (ESG mandate). Provided that a negative ESG premium for stocks is priced by the market, we show that an ESG mandate can reduce the mean-variance inefficiency of the portfolio frontier when the asset manager targets a limited over-performance with respect to the benchmark. Instead, for a high over-performance target, an ESG mandate leads to a higher variance. The mean-variance improvement is due to the fact that the ESG mandate induces the asset manager to over-invest in assets with a high mean-standard deviation ratio. In equilibrium, with asset managers and mean-variance investors, a negative ESG premium arises if the ESG mandate is binding for asset managers. A result that is borne out by the data.
&lt;/p&gt;</description></item><item><title>&#35770;&#25991;&#29702;&#35770;&#19978;&#38416;&#36848;&#20102;&#31995;&#32479;&#24615;&#27495;&#35270;&#30340;&#26412;&#36136;&#65292;&#25552;&#20986;&#20102;&#25918;&#22823;&#19981;&#24179;&#31561;&#30340;&#26426;&#21046;&#20998;&#31867;&#65292;&#24182;&#25351;&#20986;&#36825;&#20123;&#26426;&#21046;&#21487;&#20197;&#34987;&#25171;&#30772;&#65292;&#25110;&#32773;&#34987;&#21033;&#29992;&#26469;&#25918;&#22823;&#20844;&#24179;&#24178;&#39044;&#30340;&#25928;&#26524;&#12290;</title><link>https://arxiv.org/abs/2403.11028</link><description>&lt;p&gt;
&#20309;&#20026;&#31995;&#32479;&#24615;&#27495;&#35270;&#65311;&#25581;&#31034;&#19981;&#24179;&#31561;&#30340;&#25918;&#22823;&#22120;
&lt;/p&gt;
&lt;p&gt;
What Makes Systemic Discrimination, "Systemic?" Exposing the Amplifiers of Inequity
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11028
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#29702;&#35770;&#19978;&#38416;&#36848;&#20102;&#31995;&#32479;&#24615;&#27495;&#35270;&#30340;&#26412;&#36136;&#65292;&#25552;&#20986;&#20102;&#25918;&#22823;&#19981;&#24179;&#31561;&#30340;&#26426;&#21046;&#20998;&#31867;&#65292;&#24182;&#25351;&#20986;&#36825;&#20123;&#26426;&#21046;&#21487;&#20197;&#34987;&#25171;&#30772;&#65292;&#25110;&#32773;&#34987;&#21033;&#29992;&#26469;&#25918;&#22823;&#20844;&#24179;&#24178;&#39044;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#36328;&#36234;&#32463;&#27982;&#23398;&#12289;&#20844;&#20849;&#21355;&#29983;&#12289;&#25945;&#32946;&#12289;&#31038;&#20250;&#23398;&#21644;&#27861;&#24459;&#39046;&#22495;&#30340;&#24037;&#20316;&#65292;&#25105;&#22312;&#29702;&#35770;&#19978;&#38416;&#26126;&#20102;&#20309;&#20026;&#8220;&#31995;&#32479;&#24615;&#27495;&#35270;&#8221;&#12290;&#19981;&#20844;&#27491;&#24182;&#38750;&#23396;&#31435;&#21457;&#29983;&#65292;&#32780;&#26159;&#22312;&#19968;&#20010;&#30456;&#20114;&#20381;&#23384;&#30340;&#22797;&#26434;&#31995;&#32479;&#20869;&#37096;&#21457;&#29983;&#65307;&#20854;&#24433;&#21709;&#21487;&#33021;&#20250;&#22240;&#27492;&#32780;&#25918;&#22823;&#12290;&#25105;&#24314;&#31435;&#20102;&#36825;&#20123;&#25918;&#22823;&#26426;&#21046;&#30340;&#20998;&#31867;&#27861;&#65292;&#24182;&#23558;&#20854;&#19982;&#32463;&#27982;&#23398;&#20013;&#31934;&#30830;&#12289;&#21487;&#27979;&#35797;&#21644;&#38754;&#21521;&#25919;&#31574;&#30340;&#27010;&#24565;&#32852;&#31995;&#36215;&#26469;&#12290;&#35813;&#26694;&#26550;&#25581;&#31034;&#20102;&#36825;&#20123;&#25918;&#22823;&#26426;&#21046;&#21487;&#20197;&#30452;&#25509;&#34987;&#30772;&#22351;&#65292;&#25110;&#32773;&#34987;&#21033;&#29992;&#26469;&#25918;&#22823;&#20197;&#20844;&#24179;&#20026;&#37325;&#28857;&#30340;&#24178;&#39044;&#25928;&#26524;&#12290;&#25442;&#21477;&#35805;&#35828;&#65292;&#23427;&#23637;&#31034;&#20102;&#22914;&#20309;&#21033;&#29992;&#31995;&#32479;&#24615;&#27495;&#35270;&#30340;&#26426;&#21046;&#21453;&#20854;&#36947;&#32780;&#34892;&#20043;&#12290;&#35752;&#35770;&#30340;&#29616;&#23454;&#20363;&#23376;&#21253;&#25324;&#20294;&#19981;&#38480;&#20110;&#22900;&#38582;&#21046;&#21644;&#31181;&#26063;&#38548;&#31163;&#30340;&#36180;&#20607;&#12289;&#20248;&#24800;&#21048;&#25110;&#22522;&#20110;&#22320;&#28857;&#30340;&#31038;&#21306;&#24178;&#39044;&#12289;&#35686;&#26041;&#26538;&#20987;&#12289;&#24179;&#26435;&#34892;&#21160;&#21644;&#26032;&#20896;&#30123;&#24773;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11028v1 Announce Type: new  Abstract: Drawing on work spanning economics, public health, education, sociology, and law, I formalize theoretically what makes systemic discrimination "systemic." Injustices do not occur in isolation, but within a complex system of interdependent factors; and their effects may amplify as a consequence. I develop a taxonomy of these amplification mechanisms, connecting them to well-understood concepts in economics that are precise, testable and policy-oriented. This framework reveals that these amplification mechanisms can either be directly disrupted, or exploited to amplify the effects of equity-focused interventions instead. In other words, it shows how to use the machinery of systemic discrimination against itself. Real-world examples discussed include but are not limited to reparations for slavery and Jim Crow, vouchers or place-based neighborhood interventions, police shootings, affirmative action, and Covid-19.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#39044;&#27979;&#26356;&#26032;&#22914;&#20309;&#24433;&#21709;MRP&#35745;&#21010;&#21442;&#25968;&#65292;&#24182;&#25552;&#20986;&#20102;&#25193;&#23637;MRP&#30340;&#26041;&#27861;&#20197;&#20943;&#36731;&#20449;&#24687;&#26356;&#26032;&#23545;&#29983;&#20135;&#35746;&#21333;&#30340;&#24178;&#25200;&#12290;</title><link>https://arxiv.org/abs/2403.11010</link><description>&lt;p&gt;
&#23450;&#26399;&#39044;&#27979;&#26356;&#26032;&#22914;&#20309;&#24433;&#21709;MRP&#35745;&#21010;&#21442;&#25968;&#65306;&#19968;&#39033;&#27169;&#25311;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
How Periodic Forecast Updates Influence MRP Planning Parameters: A Simulation Study
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11010
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#39044;&#27979;&#26356;&#26032;&#22914;&#20309;&#24433;&#21709;MRP&#35745;&#21010;&#21442;&#25968;&#65292;&#24182;&#25552;&#20986;&#20102;&#25193;&#23637;MRP&#30340;&#26041;&#27861;&#20197;&#20943;&#36731;&#20449;&#24687;&#26356;&#26032;&#23545;&#29983;&#20135;&#35746;&#21333;&#30340;&#24178;&#25200;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35768;&#22810;&#20379;&#24212;&#38142;&#20013;&#65292;&#24403;&#21069;&#30340;&#25968;&#23383;&#21270;&#21162;&#21147;&#24050;&#32463;&#23548;&#33268;&#21046;&#36896;&#21830;&#21644;&#23458;&#25143;&#20043;&#38388;&#30340;&#20449;&#24687;&#20132;&#27969;&#24471;&#21040;&#25913;&#21892;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#38656;&#27714;&#39044;&#27979;&#36890;&#24120;&#30001;&#23458;&#25143;&#25552;&#20379;&#65292;&#24182;&#38543;&#30528;&#30456;&#20851;&#23458;&#25143;&#20449;&#24687;&#30340;&#25913;&#21892;&#32780;&#23450;&#26399;&#26356;&#26032;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#39044;&#27979;&#26356;&#26032;&#23545;&#29289;&#26009;&#38656;&#27714;&#35745;&#21010;&#65288;MRP&#65289;&#29983;&#20135;&#35268;&#21010;&#26041;&#27861;&#30340;&#24433;&#21709;&#12290;&#36827;&#34892;&#20102;&#27169;&#25311;&#30740;&#31350;&#65292;&#20197;&#35780;&#20272;&#20449;&#24687;&#26356;&#26032;&#22914;&#20309;&#24433;&#21709;&#28378;&#21160;&#35270;&#37326;MRP&#35745;&#21010;&#29983;&#20135;&#31995;&#32479;&#20013;&#35774;&#32622;&#35268;&#21010;&#21442;&#25968;&#12290;&#30452;&#35266;&#30340;&#32467;&#26524;&#26159;&#20449;&#24687;&#26356;&#26032;&#23548;&#33268;MRP&#26631;&#20934;&#29983;&#20135;&#35746;&#21333;&#20986;&#29616;&#24178;&#25200;&#65292;&#22240;&#27492;&#24320;&#21457;&#20102;&#19968;&#20010;&#25193;&#23637;MRP&#20197;&#20943;&#36731;&#36825;&#20123;&#24433;&#21709;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#22823;&#35268;&#27169;&#30340;&#25968;&#20540;&#27169;&#25311;&#23454;&#39564;&#34920;&#26126;&#65292;&#24320;&#21457;&#30340;MRP&#23433;&#20840;&#24211;&#23384;&#21033;&#29992;&#21551;&#21457;&#24335;&#26041;&#27861;&#26174;&#33879;&#25913;&#21892;&#20102;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11010v1 Announce Type: new  Abstract: In many supply chains, the current efforts at digitalization have led to improved information exchanges between manufacturers and their customers. Specifically, demand forecasts are often provided by the customers and regularly updated as the related customer information improves. In this paper, we investigate the influence of forecast updates on the production planning method of Material Requirements Planning (MRP). A simulation study was carried out to assess how updates in information affect the setting of planning parameters in a rolling horizon MRP planned production system. An intuitive result is that information updates lead to disturbances in the production orders for the MRP standard, and, therefore, an extension for MRP to mitigate these effects is developed. A large numerical simulation experiment shows that the MRP safety stock exploitation heuristic, that has been developed, leads to significantly improved results as far as 
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25506;&#35752;&#20102;R&amp;D&#23494;&#38598;&#24230;&#19982;&#20844;&#21496;&#36130;&#21153;&#32489;&#25928;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#24182;&#25581;&#31034;&#20102;&#21019;&#26032;&#23545;&#20844;&#21496;&#31454;&#20105;&#21147;&#21644;&#24066;&#22330;&#23450;&#20301;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.10982</link><description>&lt;p&gt;
&#32654;&#22269;&#37329;&#34701;&#32489;&#25928;&#19982;&#21019;&#26032;&#65306;1998&#24180;&#33267;2023&#24180;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Financial Performance and Innovation: Evidence From USA, 1998 - 2023
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10982
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25506;&#35752;&#20102;R&amp;D&#23494;&#38598;&#24230;&#19982;&#20844;&#21496;&#36130;&#21153;&#32489;&#25928;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#24182;&#25581;&#31034;&#20102;&#21019;&#26032;&#23545;&#20844;&#21496;&#31454;&#20105;&#21147;&#21644;&#24066;&#22330;&#23450;&#20301;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;R&amp;D&#23494;&#38598;&#24230;&#20316;&#20026;&#21019;&#26032;&#34913;&#37327;&#26631;&#20934;&#19982;&#26631;&#26222;500&#23478;&#20844;&#21496;&#22312;1998&#24180;&#33267;2023&#24180;100&#20010;&#23395;&#24230;&#20043;&#38388;&#30340;&#36130;&#21153;&#32489;&#25928;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#21253;&#25324;&#22810;&#20010;&#21361;&#26426;&#26399;&#12290;&#36890;&#36807;&#36328;&#36234;&#22810;&#20010;&#34892;&#19994;&#30340;&#20840;&#38754;&#25968;&#25454;&#38598;&#65292;&#25361;&#25112;&#20102;&#36739;&#22823;&#20844;&#21496;&#26356;&#23481;&#26131;&#21019;&#26032;&#30340;&#20256;&#32479;&#35266;&#24565;&#12290;&#20998;&#26512;&#25581;&#31034;&#20102;&#21019;&#26032;&#19982;&#20844;&#21496;&#35268;&#27169;&#12289;&#36164;&#20135;&#12289;EBITDA&#21644;&#26377;&#24418;&#36164;&#20135;&#31561;&#20851;&#38190;&#36130;&#21153;&#25351;&#26631;&#20043;&#38388;&#30340;&#19981;&#21516;&#20851;&#32852;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#24378;&#35843;&#20102;&#21019;&#26032;&#22312;&#25552;&#21319;&#20844;&#21496;&#31454;&#20105;&#21147;&#21644;&#24066;&#22330;&#23450;&#20301;&#26041;&#38754;&#30340;&#37325;&#35201;&#24615;&#65292;&#31361;&#20986;&#20102;&#21453;&#21608;&#26399;&#24615;&#21019;&#26032;&#25919;&#31574;&#30340;&#26377;&#25928;&#24615;&#12290;&#36825;&#39033;&#30740;&#31350;&#20026;&#20851;&#20110;R&amp;D&#25237;&#36164;&#22312;&#25512;&#21160;&#20844;&#21496;&#20215;&#20540;&#26041;&#38754;&#30340;&#35282;&#33394;&#30340;&#35752;&#35770;&#20570;&#20986;&#20102;&#36129;&#29486;&#65292;&#20026;&#23398;&#26415;&#21644;&#25919;&#31574;&#35752;&#35770;&#25552;&#20379;&#20102;&#26032;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10982v1 Announce Type: new  Abstract: This study explores the relationship between R&amp;D intensity, as a measure of innovation, and financial performance among S&amp;P 500 companies over 100 quarters from 1998 to 2023, including multiple crisis periods. It challenges the conventional wisdom that larger companies are more prone to innovate, using a comprehensive dataset across various industries. The analysis reveals diverse associations between innovation and key financial indicators such as firm size, assets, EBITDA, and tangibility. Our findings underscore the importance of innovation in enhancing firm competitiveness and market positioning, highlighting the effectiveness of countercyclical innovation policies. This research contributes to the debate on the role of R&amp;D investments in driving firm value, offering new insights for both academic and policy discussions.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;FishNet&#65292;&#19968;&#20010;&#33258;&#21160;&#21270;&#35745;&#31639;&#26426;&#35270;&#35273;&#31995;&#32479;&#65292;&#21033;&#29992;&#20302;&#25104;&#26412;&#25968;&#30721;&#30456;&#26426;&#22270;&#20687;&#25191;&#34892;&#40060;&#31867;&#20998;&#31867;&#21644;&#22823;&#23567;&#20272;&#31639;&#65292;&#20855;&#26377;&#39640;&#20934;&#30830;&#24615;&#21644;&#31934;&#24230;&#12290;</title><link>https://arxiv.org/abs/2403.10916</link><description>&lt;p&gt;
FishNet:&#29992;&#20110;&#20302;&#25104;&#26412;&#40060;&#31867;&#23384;&#26639;&#20272;&#31639;&#30340;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
FishNet: Deep Neural Networks for Low-Cost Fish Stock Estimation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10916
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;FishNet&#65292;&#19968;&#20010;&#33258;&#21160;&#21270;&#35745;&#31639;&#26426;&#35270;&#35273;&#31995;&#32479;&#65292;&#21033;&#29992;&#20302;&#25104;&#26412;&#25968;&#30721;&#30456;&#26426;&#22270;&#20687;&#25191;&#34892;&#40060;&#31867;&#20998;&#31867;&#21644;&#22823;&#23567;&#20272;&#31639;&#65292;&#20855;&#26377;&#39640;&#20934;&#30830;&#24615;&#21644;&#31934;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#40060;&#31867;&#24211;&#23384;&#35780;&#20272;&#36890;&#24120;&#38656;&#35201;&#30001;&#20998;&#31867;&#19987;&#23478;&#36827;&#34892;&#25163;&#24037;&#40060;&#31867;&#35745;&#25968;&#65292;&#36825;&#26082;&#32791;&#26102;&#21448;&#26114;&#36149;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#33258;&#21160;&#21270;&#30340;&#35745;&#31639;&#26426;&#35270;&#35273;&#31995;&#32479;&#65292;&#21487;&#20197;&#20174;&#20351;&#29992;&#20302;&#25104;&#26412;&#25968;&#30721;&#30456;&#26426;&#25293;&#25668;&#30340;&#22270;&#20687;&#20013;&#25191;&#34892;&#20998;&#31867;&#21644;&#40060;&#31867;&#22823;&#23567;&#20272;&#31639;&#12290;&#35813;&#31995;&#32479;&#39318;&#20808;&#21033;&#29992;Mask R-CNN&#25191;&#34892;&#30446;&#26631;&#26816;&#27979;&#21644;&#20998;&#21106;&#65292;&#20197;&#35782;&#21035;&#21253;&#21547;&#22810;&#26465;&#40060;&#30340;&#22270;&#20687;&#20013;&#30340;&#21333;&#26465;&#40060;&#65292;&#36825;&#20123;&#40060;&#21487;&#33021;&#30001;&#19981;&#21516;&#29289;&#31181;&#32452;&#25104;&#12290;&#28982;&#21518;&#65292;&#27599;&#20010;&#40060;&#31867;&#34987;&#20998;&#31867;&#24182;&#20351;&#29992;&#21333;&#29420;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#39044;&#27979;&#38271;&#24230;&#12290;&#36825;&#20123;&#27169;&#22411;&#35757;&#32451;&#20110;&#21253;&#21547;50,000&#24352;&#25163;&#24037;&#27880;&#37322;&#22270;&#20687;&#30340;&#25968;&#25454;&#38598;&#65292;&#20854;&#20013;&#21253;&#21547;163&#31181;&#19981;&#21516;&#38271;&#24230;&#20174;10&#21400;&#31859;&#21040;250&#21400;&#31859;&#30340;&#40060;&#31867;&#12290;&#22312;&#20445;&#30041;&#30340;&#27979;&#35797;&#25968;&#25454;&#19978;&#35780;&#20272;&#65292;&#25105;&#20204;&#30340;&#31995;&#32479;&#22312;&#40060;&#31867;&#20998;&#21106;&#20219;&#21153;&#19978;&#36798;&#21040;&#20102;92%&#30340;&#20132;&#24182;&#27604;&#65292;&#21333;&#19968;&#40060;&#31867;&#20998;&#31867;&#20934;&#30830;&#29575;&#20026;89%&#65292;&#24179;&#22343;&#35823;&#24046;&#20026;2.3&#21400;&#31859;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10916v1 Announce Type: cross  Abstract: Fish stock assessment often involves manual fish counting by taxonomy specialists, which is both time-consuming and costly. We propose an automated computer vision system that performs both taxonomic classification and fish size estimation from images taken with a low-cost digital camera. The system first performs object detection and segmentation using a Mask R-CNN to identify individual fish from images containing multiple fish, possibly consisting of different species. Then each fish species is classified and the predicted length using separate machine learning models. These models are trained on a dataset of 50,000 hand-annotated images containing 163 different fish species, ranging in length from 10cm to 250cm. Evaluated on held-out test data, our system achieves a $92\%$ intersection over union on the fish segmentation task, a $89\%$ top-1 classification accuracy on single fish species classification, and a $2.3$~cm mean error on
&lt;/p&gt;</description></item><item><title>&#20351;&#29992;&#23376;&#32676;&#38408;&#20540;&#20248;&#21270;&#65288;STO&#65289;&#25216;&#26415;&#65292;&#22312;&#19981;&#25913;&#21160;&#35757;&#32451;&#25968;&#25454;&#21644;&#24213;&#23618;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#30340;&#24773;&#20917;&#19979;&#65292;&#20248;&#21270;&#21508;&#20010;&#23376;&#32676;&#30340;&#20998;&#31867;&#38408;&#20540;&#65292;&#20197;&#26368;&#23567;&#21270;&#25972;&#20307;&#27495;&#35270;&#20998;&#25968;&#65292;&#20174;&#32780;&#25552;&#39640;&#20449;&#36151;&#20511;&#36151;&#27169;&#22411;&#30340;&#20844;&#24179;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.10652</link><description>&lt;p&gt;
&#20351;&#29992;&#23376;&#32676;&#38408;&#20540;&#20248;&#21270;&#25552;&#39640;&#20449;&#36151;&#20511;&#36151;&#27169;&#22411;&#20844;&#24179;&#24615;
&lt;/p&gt;
&lt;p&gt;
Improving Fairness in Credit Lending Models using Subgroup Threshold Optimization
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10652
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#23376;&#32676;&#38408;&#20540;&#20248;&#21270;&#65288;STO&#65289;&#25216;&#26415;&#65292;&#22312;&#19981;&#25913;&#21160;&#35757;&#32451;&#25968;&#25454;&#21644;&#24213;&#23618;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#30340;&#24773;&#20917;&#19979;&#65292;&#20248;&#21270;&#21508;&#20010;&#23376;&#32676;&#30340;&#20998;&#31867;&#38408;&#20540;&#65292;&#20197;&#26368;&#23567;&#21270;&#25972;&#20307;&#27495;&#35270;&#20998;&#25968;&#65292;&#20174;&#32780;&#25552;&#39640;&#20449;&#36151;&#20511;&#36151;&#27169;&#22411;&#30340;&#20844;&#24179;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20026;&#25552;&#39640;&#20449;&#36151;&#20511;&#36151;&#20915;&#31574;&#30340;&#20934;&#30830;&#24615;&#65292;&#35768;&#22810;&#37329;&#34701;&#26426;&#26500;&#29616;&#22312;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#39044;&#27979;&#12290;&#28982;&#32780;&#65292;&#26368;&#36817;&#30340;&#30740;&#31350;&#34920;&#26126;&#65292;&#36825;&#20123;&#39044;&#27979;&#26377;&#21487;&#33021;&#23545;&#20154;&#21475;&#30340;&#26576;&#20123;&#23376;&#32676;&#20307;&#23384;&#22312;&#20559;&#35265;&#21644;&#19981;&#20844;&#24179;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#24341;&#20837;&#20102;&#20960;&#31181;&#25216;&#26415;&#26469;&#28040;&#38500;&#20559;&#35265;&#65292;&#25552;&#39640;&#39044;&#27979;&#30340;&#25972;&#20307;&#20844;&#24179;&#24615;&#12290;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;&#8220;Subgroup Threshold Optimizer&#8221;&#65288;&#31616;&#31216;STO&#65289;&#30340;&#26032;&#30340;&#20844;&#24179;&#24615;&#25216;&#26415;&#65292;&#23427;&#19981;&#38656;&#35201;&#23545;&#36755;&#20837;&#35757;&#32451;&#25968;&#25454;&#36827;&#34892;&#20219;&#20309;&#25913;&#21160;&#65292;&#20063;&#19981;&#38656;&#35201;&#23545;&#24213;&#23618;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#36827;&#34892;&#20219;&#20309;&#26356;&#25913;&#65292;&#22240;&#27492;&#21487;&#20197;&#19982;&#20219;&#20309;&#29616;&#26377;&#30340;&#26426;&#22120;&#23398;&#20064;&#27969;&#31243;&#19968;&#36215;&#20351;&#29992;&#12290;STO&#36890;&#36807;&#20248;&#21270;&#21508;&#20010;&#23376;&#32676;&#30340;&#20998;&#31867;&#38408;&#20540;&#65292;&#20197;&#26368;&#23567;&#21270;&#23427;&#20204;&#20043;&#38388;&#30340;&#25972;&#20307;&#27495;&#35270;&#20998;&#25968;&#12290;&#25105;&#20204;&#22312;&#19968;&#20010;&#30495;&#23454;&#19990;&#30028;&#30340;&#23454;&#39564;&#20013;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10652v1 Announce Type: new  Abstract: In an effort to improve the accuracy of credit lending decisions, many financial intuitions are now using predictions from machine learning models. While such predictions enjoy many advantages, recent research has shown that the predictions have the potential to be biased and unfair towards certain subgroups of the population. To combat this, several techniques have been introduced to help remove the bias and improve the overall fairness of the predictions. We introduce a new fairness technique, called \textit{Subgroup Threshold Optimizer} (\textit{STO}), that does not require any alternations to the input training data nor does it require any changes to the underlying machine learning algorithm, and thus can be used with any existing machine learning pipeline. STO works by optimizing the classification thresholds for individual subgroups in order to minimize the overall discrimination score between them. Our experiments on a real-world 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#37327;&#21270;&#24182;&#34913;&#37327;&#20102;&#20840;&#29699;&#27599;&#20010;&#22478;&#24066;&#22320;&#21306;&#30340;&#34903;&#36947;&#32593;&#32476;&#33030;&#24369;&#24615;&#65292;&#28982;&#21518;&#24314;&#27169;&#20102;&#33030;&#24369;&#24615;&#19982;&#34903;&#36947;&#32593;&#32476;&#35774;&#35745;&#29305;&#24449;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2403.10636</link><description>&lt;p&gt;
&#12298;&#35774;&#35745;&#20013;&#30340;&#24377;&#24615;: &#22312;&#19990;&#30028;&#21508;&#22320;&#27169;&#25311;&#34903;&#36947;&#32593;&#32476;&#20013;&#30340;&#20013;&#26029;&#12299;
&lt;/p&gt;
&lt;p&gt;
Resilient by Design: Simulating Street Network Disruptions across Every Urban Area in the World
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10636
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#37327;&#21270;&#24182;&#34913;&#37327;&#20102;&#20840;&#29699;&#27599;&#20010;&#22478;&#24066;&#22320;&#21306;&#30340;&#34903;&#36947;&#32593;&#32476;&#33030;&#24369;&#24615;&#65292;&#28982;&#21518;&#24314;&#27169;&#20102;&#33030;&#24369;&#24615;&#19982;&#34903;&#36947;&#32593;&#32476;&#35774;&#35745;&#29305;&#24449;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#34903;&#36947;&#32593;&#32476;&#20351;&#20154;&#20204;&#21644;&#36135;&#29289;&#33021;&#22815;&#22312;&#22478;&#24066;&#20013;&#31227;&#21160;&#65292;&#20294;&#23427;&#20204;&#23481;&#26131;&#21463;&#21040;&#27946;&#27700;&#12289;&#22320;&#38663;&#21644;&#24656;&#24598;&#34989;&#20987;&#31561;&#28798;&#23475;&#30340;&#24433;&#21709;&#12290;&#33391;&#22909;&#35268;&#21010;&#30340;&#32593;&#32476;&#35774;&#35745;&#21487;&#20197;&#20351;&#22478;&#24066;&#26356;&#20855;&#24377;&#24615;&#21644;&#38887;&#24615;&#20197;&#25269;&#25239;&#27492;&#31867;&#20013;&#26029;&#65292;&#20294;&#25105;&#20204;&#23545;&#19990;&#30028;&#33539;&#22260;&#20869;&#30340;&#33030;&#24369;&#24615;&#27169;&#24335;&#25110;&#20855;&#20307;&#35774;&#35745;&#29305;&#24449;&#19982;&#24377;&#24615;&#20043;&#38388;&#30340;&#20851;&#31995;&#20173;&#30693;&#20043;&#29978;&#23569;&#12290;&#26412;&#30740;&#31350;&#37327;&#21270;&#24182;&#34913;&#37327;&#20102;&#20840;&#29699;&#27599;&#20010;&#22478;&#24066;&#22320;&#21306;&#30340;&#34903;&#36947;&#32593;&#32476;&#33030;&#24369;&#24615;&#65292;&#28982;&#21518;&#24314;&#27169;&#20102;&#33030;&#24369;&#24615;&#19982;&#34903;&#36947;&#32593;&#32476;&#35774;&#35745;&#29305;&#24449;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#22312;178&#20010;&#22269;&#23478;&#30340;8000&#22810;&#20010;&#22478;&#24066;&#20013;&#27169;&#25311;&#20102;&#36229;&#36807;24&#20159;&#27425;&#20986;&#34892;&#65292;&#21516;&#26102;&#27169;&#25311;&#20102;&#20195;&#34920;&#27946;&#27700;&#12289;&#22320;&#38663;&#21644;&#23450;&#21521;&#34989;&#20987;&#30340;&#32593;&#32476;&#20013;&#26029;&#20107;&#20214;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#30772;&#22351;&#39640;&#20013;&#24515;&#33410;&#28857;&#20005;&#37325;&#24433;&#21709;&#32593;&#32476;&#21151;&#33021;&#12290;&#20854;&#20182;&#26465;&#20214;&#30456;&#21516;&#30340;&#24773;&#20917;&#19979;&#65292;&#36830;&#36890;&#24615;&#26356;&#39640;&#12289;&#29942;&#39048;&#26356;&#23569;&#30340;&#32593;&#32476;&#26356;&#20026;&#33030;&#24369;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10636v1 Announce Type: cross  Abstract: Street networks allow people and goods to move through cities, but they are vulnerable to disasters like floods, earthquakes, and terrorist attacks. Well-planned network design can make a city more resilient and robust to such disruptions, but we still know little about worldwide patterns of vulnerability, or worldwide empirical relationships between specific design characteristics and resilience. This study quantifies and measures the vulnerability of the street networks of every urban area in the world then models the relationships between vulnerability and street network design characteristics. To do so, we simulate over 2.4 billion trips across more than 8,000 urban areas in 178 countries, while also simulating network disruption events representing floods, earthquakes, and targeted attacks. We find that disrupting high-centrality nodes severely impacts network function. All else equal, networks with higher connectivity, fewer chok
&lt;/p&gt;</description></item><item><title>&#35770;&#25991;&#20998;&#26512;&#20102;&#37329;&#34701;&#32593;&#32476;&#23545;&#20849;&#21516;&#25215;&#25285;&#30340;&#22806;&#37096;&#36164;&#20135;&#20215;&#26684;&#27874;&#21160;&#30340;&#24377;&#24615;&#65292;&#24182;&#35780;&#20272;&#20102;&#36829;&#32422;&#20256;&#26579;&#30340;&#26368;&#22351;&#24773;&#20917;&#24433;&#21709;&#65292;&#24341;&#20837;&#20102;&#40664;&#35748;&#24377;&#24615;&#20313;&#37327;&#30340;&#27010;&#24565;&#65292;&#24182;&#35745;&#31639;&#20102;&#32593;&#32476;&#33021;&#22815;&#23481;&#24525;&#30340;&#26368;&#22823;&#36164;&#20135;&#20215;&#26684;&#27874;&#21160;&#24133;&#24230;&#12290;</title><link>https://arxiv.org/abs/2403.10631</link><description>&lt;p&gt;
&#37329;&#34701;&#32593;&#32476;&#20013;&#30340;&#40664;&#35748;&#24377;&#24615;&#21644;&#26368;&#22351;&#24773;&#20917;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Default Resilience and Worst-Case Effects in Financial Networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10631
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#20998;&#26512;&#20102;&#37329;&#34701;&#32593;&#32476;&#23545;&#20849;&#21516;&#25215;&#25285;&#30340;&#22806;&#37096;&#36164;&#20135;&#20215;&#26684;&#27874;&#21160;&#30340;&#24377;&#24615;&#65292;&#24182;&#35780;&#20272;&#20102;&#36829;&#32422;&#20256;&#26579;&#30340;&#26368;&#22351;&#24773;&#20917;&#24433;&#21709;&#65292;&#24341;&#20837;&#20102;&#40664;&#35748;&#24377;&#24615;&#20313;&#37327;&#30340;&#27010;&#24565;&#65292;&#24182;&#35745;&#31639;&#20102;&#32593;&#32476;&#33021;&#22815;&#23481;&#24525;&#30340;&#26368;&#22823;&#36164;&#20135;&#20215;&#26684;&#27874;&#21160;&#24133;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#38134;&#34892;&#32593;&#32476;&#23545;&#23427;&#20204;&#20849;&#21516;&#25215;&#25285;&#39118;&#38505;&#30340;&#22806;&#37096;&#36164;&#20135;&#20215;&#26684;&#27874;&#21160;&#30340;&#24377;&#24615;&#65292;&#24182;&#35780;&#20272;&#20102;&#21487;&#33021;&#30340;&#36829;&#32422;&#20256;&#26579;&#30340;&#26368;&#22351;&#24773;&#20917;&#24433;&#21709;&#12290;&#24403;&#26576;&#20123;&#22806;&#37096;&#36164;&#20135;&#30340;&#20215;&#26684;&#19979;&#38477;&#25110;&#19978;&#21319;&#26102;&#65292;&#25152;&#26377;&#26292;&#38706;&#20110;&#36825;&#20123;&#36164;&#20135;&#30340;&#38134;&#34892;&#37117;&#20250;&#21516;&#26102;&#36973;&#21463;&#19981;&#21516;&#31243;&#24230;&#30340;&#20914;&#20987;&#12290;&#36825;&#20123;&#21327;&#35843;&#21644;&#26377;&#32467;&#26500;&#30340;&#20914;&#20987;&#26377;&#21487;&#33021;&#21152;&#21095;&#36829;&#32422;&#30340;&#21487;&#33021;&#24615;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#39318;&#20808;&#20171;&#32461;&#20102;&#19968;&#20010;&#27010;&#24565;&#8212;&#8212;{&#40664;&#35748;&#24377;&#24615;&#20313;&#37327;}&#65292;&#21363;&#32593;&#32476;&#22312;&#19981;&#20135;&#29983;&#36829;&#32422;&#30340;&#24773;&#20917;&#19979;&#33021;&#22815;&#23481;&#24525;&#30340;&#36164;&#20135;&#20215;&#26684;&#27874;&#21160;&#30340;&#26368;&#22823;&#24133;&#24230;&#65292;$\epsilon^*$&#12290;&#36825;&#20010;&#38408;&#20540;&#26159;&#36890;&#36807;&#32771;&#34385;&#20004;&#31181;&#19981;&#21516;&#30340;&#20215;&#26684;&#27874;&#21160;&#24230;&#37327;&#26469;&#35745;&#31639;&#30340;&#65292;&#19968;&#31181;&#22522;&#20110;&#27599;&#31181;&#36164;&#20135;&#30340;&#26368;&#22823;&#21333;&#20010;&#21464;&#21270;&#65292;&#21478;&#19968;&#31181;&#22522;&#20110;&#25152;&#26377;&#36164;&#20135;&#30340;&#32477;&#23545;&#21464;&#21270;&#20043;&#21644;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10631v1 Announce Type: new  Abstract: In this paper we analyze the resilience of a network of banks to joint price fluctuations of the external assets in which they have shared exposures, and evaluate the worst-case effects of the possible default contagion. Indeed, when the prices of certain external assets either decrease or increase, all banks exposed to them experience varying degrees of simultaneous shocks to their balance sheets. These coordinated and structured shocks have the potential to exacerbate the likelihood of defaults. In this context, we introduce first a concept of {default resilience margin}, $\epsilon^*$, i.e., the maximum amplitude of asset prices fluctuations that the network can tolerate without generating defaults. Such threshold value is computed by considering two different measures of price fluctuations, one based on the maximum individual variation of each asset, and the other based on the sum of all the asset's absolute variations. For any price 
&lt;/p&gt;</description></item><item><title>&#20316;&#32773;&#20351;&#29992;&#21152;&#25343;&#22823;&#30340;&#31246;&#21153;&#25968;&#25454;&#36861;&#36394;&#22478;&#24066;&#32763;&#26032;&#36807;&#31243;&#20013;&#23621;&#27665;&#30340;&#27969;&#21160;&#21644;&#25910;&#20837;&#21464;&#21270;&#65292;&#21457;&#29616;&#32763;&#26032;&#24182;&#27809;&#26377;&#23548;&#33268;&#34987;&#36843;&#36801;&#31227;&#65292;&#21453;&#32780;&#23621;&#27665;&#26356;&#26377;&#21487;&#33021;&#38271;&#26399;&#23621;&#20303;&#65292;&#21516;&#26102;&#25910;&#20837;&#36712;&#36857;&#20063;&#27809;&#26377;&#21463;&#21040;&#19981;&#21033;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2403.10614</link><description>&lt;p&gt;
&#22478;&#24066;&#32763;&#26032;&#12289;&#34987;&#36843;&#36801;&#31227;&#21644;&#23621;&#27665;&#25910;&#20837;&#36712;&#36857;
&lt;/p&gt;
&lt;p&gt;
Gentrification, displacement, and income trajectory of incumbents
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10614
&lt;/p&gt;
&lt;p&gt;
&#20316;&#32773;&#20351;&#29992;&#21152;&#25343;&#22823;&#30340;&#31246;&#21153;&#25968;&#25454;&#36861;&#36394;&#22478;&#24066;&#32763;&#26032;&#36807;&#31243;&#20013;&#23621;&#27665;&#30340;&#27969;&#21160;&#21644;&#25910;&#20837;&#21464;&#21270;&#65292;&#21457;&#29616;&#32763;&#26032;&#24182;&#27809;&#26377;&#23548;&#33268;&#34987;&#36843;&#36801;&#31227;&#65292;&#21453;&#32780;&#23621;&#27665;&#26356;&#26377;&#21487;&#33021;&#38271;&#26399;&#23621;&#20303;&#65292;&#21516;&#26102;&#25910;&#20837;&#36712;&#36857;&#20063;&#27809;&#26377;&#21463;&#21040;&#19981;&#21033;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22478;&#24066;&#32763;&#26032;&#19982;&#20869;&#22478;&#31038;&#21306;&#20013;&#20154;&#21475;&#24555;&#36895;&#21464;&#21270;&#23494;&#20999;&#30456;&#20851;&#12290;&#23613;&#31649;&#35768;&#22810;&#20154;&#25285;&#24515;&#22478;&#24066;&#32763;&#26032;&#20250;&#36843;&#20351;&#20302;&#25910;&#20837;&#32773;&#31163;&#24320;&#20182;&#20204;&#30340;&#23478;&#22253;&#21644;&#31038;&#21306;&#65292;&#20294;&#20851;&#20110;&#36825;&#20123;&#21464;&#21270;&#21518;&#26524;&#30340;&#35777;&#25454;&#26377;&#38480;&#12290;&#20316;&#32773;&#20351;&#29992;&#21152;&#25343;&#22823;&#34892;&#25919;&#31246;&#21153;&#26723;&#26696;&#36861;&#36394;&#29616;&#26377;&#24037;&#20154;&#30340;&#27969;&#21160;&#24773;&#20917;&#21450;&#20854;&#25910;&#20837;&#36712;&#36857;&#65292;&#24403;&#20182;&#20204;&#25152;&#22312;&#30340;&#31038;&#21306;&#36827;&#34892;&#32763;&#26032;&#12290;&#20316;&#32773;&#21033;&#29992;&#31038;&#21306;&#32763;&#26032;&#30340;&#26102;&#38388;&#28857;&#65292;&#24314;&#31435;&#20102;&#19968;&#31181;&#21305;&#37197;&#30340;&#38454;&#27573;&#24615;&#20107;&#20214;&#30740;&#31350;&#26694;&#26550;&#12290;&#20316;&#32773;&#21457;&#29616;&#27809;&#26377;&#34987;&#36843;&#36801;&#31227;&#30340;&#35777;&#25454;&#65292;&#21363;&#20351;&#23545;&#20110;&#20302;&#31038;&#20250;&#32463;&#27982;&#22320;&#20301;&#30340;&#23478;&#24237;&#20063;&#26159;&#22914;&#27492;&#12290;&#20107;&#23454;&#19978;&#65292;&#23621;&#20303;&#22312;&#32763;&#26032;&#20013;&#30340;&#31038;&#21306;&#30340;&#23478;&#24237;&#26356;&#26377;&#21487;&#33021;&#38271;&#26399;&#23621;&#20303;&#12290;&#20316;&#32773;&#35748;&#20026;&#36825;&#21487;&#33021;&#19982;&#31199;&#25143;&#26435;&#21033;&#20445;&#25252;&#27861;&#26377;&#20851;&#12290;&#24403;&#20302;&#25910;&#20837;&#23478;&#24237;&#20915;&#23450;&#33258;&#24895;&#31163;&#24320;&#26102;&#65292;&#20182;&#20204;&#24182;&#19981;&#20250;&#25644;&#21040;&#26356;&#31967;&#31957;&#30340;&#31038;&#21306;&#12290;&#26368;&#21518;&#65292;&#20316;&#32773;&#21457;&#29616;&#36825;&#20123;&#21464;&#21270;&#27809;&#26377;&#23545;&#20182;&#20204;&#30340;&#25910;&#20837;&#36712;&#36857;&#36896;&#25104;&#19981;&#21033;&#24433;&#21709;&#65292;&#36825;&#34920;&#26126;&#23545;&#20854;&#21171;&#21160;&#24066;&#22330;&#27809;&#26377;&#21518;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10614v1 Announce Type: new  Abstract: Gentrification is associated with rapid demographic changes within inner-city neighborhoods. While many fear that gentrification drives low-income people from their homes and communities, there is limited evidence of the consequences of these changes. I use Canadian administrative tax files to track the movements of incumbent workers and their income trajectory as their neighborhood gentrifies. I exploit the timing at which neighborhoods gentrify in a matched staggered event-study framework. I find no evidence of displacement effects, even for low socioeconomic status households. In fact, families living in gentrifying neighborhoods are more likely to stay longer. I suggest that this might be related to tenant rights protection laws. When they endogenously decide to leave, low-income families do not relocate to worse neighborhoods. Finally, I find no adverse effects on their income trajectory, suggesting no repercussions on their labor m
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#23545;&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;&#30340;&#29109;&#26657;&#27491;&#26041;&#27861;&#65292;&#33021;&#22815;&#26377;&#25928;&#22320;&#25913;&#36827;&#23545;&#38750;&#23545;&#25968;&#27491;&#24577;&#20998;&#24067;&#30340;&#25968;&#25454;&#36827;&#34892;&#24314;&#27169;&#30340;&#33021;&#21147;&#12290;</title><link>https://arxiv.org/abs/2403.06253</link><description>&lt;p&gt;
&#29109;&#26657;&#27491;&#30340;&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;
&lt;/p&gt;
&lt;p&gt;
The entropy corrected geometric Brownian motion
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.06253
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#23545;&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;&#30340;&#29109;&#26657;&#27491;&#26041;&#27861;&#65292;&#33021;&#22815;&#26377;&#25928;&#22320;&#25913;&#36827;&#23545;&#38750;&#23545;&#25968;&#27491;&#24577;&#20998;&#24067;&#30340;&#25968;&#25454;&#36827;&#34892;&#24314;&#27169;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;(GBM)&#34987;&#24191;&#27867;&#29992;&#20110;&#24314;&#27169;&#38543;&#26426;&#36807;&#31243;&#65292;&#28982;&#32780;&#20854;&#35299;&#20915;&#26041;&#26696;&#20197;&#23545;&#25968;&#27491;&#24577;&#20998;&#24067;&#20026;&#29305;&#24449;&#12290;&#36825;&#38480;&#21046;&#20102;GBM&#20027;&#35201;&#22312;&#39044;&#27979;&#24212;&#29992;&#26041;&#38754;&#30340;&#39044;&#27979;&#33021;&#21147;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#23545;GBM&#30340;&#29109;&#26657;&#27491;&#65292;&#26088;&#22312;&#36229;&#36234;&#23545;&#25968;&#27491;&#24577;&#24615;&#38480;&#21046;&#65292;&#26356;&#22909;&#22320;&#32771;&#34385;&#30495;&#23454;&#31995;&#32479;&#30340;&#22797;&#26434;&#24615;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#36890;&#36807;&#35770;&#35777;&#30830;&#23450;&#24615;&#25968;&#25454;&#20869;&#23481;&#22686;&#21152;&#26102;&#29109;&#20943;&#23569;&#65292;&#21487;&#20197;&#26377;&#25928;&#25913;&#36827;GBM&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#22312;&#22810;&#31181;&#38750;&#23545;&#25968;&#27491;&#24577;&#20998;&#24067;&#30340;&#24773;&#20917;&#19979;&#35266;&#23519;&#21040;&#23545;&#20256;&#32479;GBM&#30340;&#26174;&#30528;&#25913;&#36827;&#65292;&#20174;&#25527;&#39600;&#23376;&#23454;&#39564;&#21040;&#29616;&#23454;&#19990;&#30028;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06253v1 Announce Type: cross  Abstract: The geometric Brownian motion (GBM) is widely employed for modeling stochastic processes, yet its solutions are characterized by the log-normal distribution. This comprises predictive capabilities of GBM mainly in terms of forecasting applications. Here, entropy corrections to GBM are proposed to go beyond log-normality restrictions and better account for intricacies of real systems. It is shown that GBM solutions can be effectively refined by arguing that entropy is reduced when deterministic content of considered data increases. Notable improvements over conventional GBM are observed for several cases of non-log-normal distributions, ranging from a dice roll experiment to real world data.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#22312;Black-Scholes&#27169;&#22411;&#19979;&#21033;&#29992;&#38543;&#26426;&#27888;&#21202;&#23637;&#24320;&#24471;&#21040;&#30340;&#36817;&#20284;&#35299;&#26512;&#20844;&#24335;&#65292;&#29992;&#20110;&#31163;&#25955;&#24179;&#22343;&#30340;&#20122;&#27954;&#26399;&#26435;&#23450;&#20215;&#65292;&#23454;&#36341;&#20013;&#34920;&#29616;&#39640;&#24230;&#20934;&#30830;&#12290;</title><link>https://arxiv.org/abs/2402.17684</link><description>&lt;p&gt;
&#20122;&#27954;&#26399;&#26435;&#23450;&#20215;&#30340;&#38543;&#26426;&#25193;&#23637;
&lt;/p&gt;
&lt;p&gt;
Stochastic expansion for the pricing of Asian options
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17684
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#22312;Black-Scholes&#27169;&#22411;&#19979;&#21033;&#29992;&#38543;&#26426;&#27888;&#21202;&#23637;&#24320;&#24471;&#21040;&#30340;&#36817;&#20284;&#35299;&#26512;&#20844;&#24335;&#65292;&#29992;&#20110;&#31163;&#25955;&#24179;&#22343;&#30340;&#20122;&#27954;&#26399;&#26435;&#23450;&#20215;&#65292;&#23454;&#36341;&#20013;&#34920;&#29616;&#39640;&#24230;&#20934;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22312;&#20855;&#26377;&#26102;&#38388;&#30456;&#20851;&#21442;&#25968;&#30340;Black-Scholes&#27169;&#22411;&#19979;&#65292;&#38024;&#23545;&#31163;&#25955;&#24179;&#22343;&#30340;&#20122;&#27954;&#26399;&#26435;&#23450;&#20215;&#25552;&#20986;&#20102;&#23553;&#38381;&#30340;&#35299;&#26512;&#36817;&#20284;&#12290;&#36825;&#20123;&#20844;&#24335;&#26159;&#36890;&#36807;&#22312;&#19968;&#20010;&#23545;&#25968;&#27491;&#24577;&#20195;&#29702;&#27169;&#22411;&#21608;&#22260;&#36827;&#34892;&#38543;&#26426;&#27888;&#21202;&#23637;&#24320;&#24471;&#21040;&#30340;&#65292;&#24182;&#22312;&#23454;&#36341;&#20013;&#34987;&#21457;&#29616;&#38750;&#24120;&#20934;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17684v1 Announce Type: new  Abstract: We present closed analytical approximations for the pricing of Asian options with discrete averaging under the Black-Scholes model with time-dependent parameters. The formulae are obtained by using a stochastic Taylor expansion around a log-normal proxy model and are found to be highly accurate in practice.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#22797;&#21512;&#38669;&#20811;&#26031;&#36827;&#31243;&#24314;&#27169;&#38480;&#20215;&#21333;&#31807;&#21160;&#24577;&#21644;&#35746;&#21333;&#23610;&#23544;&#30340;&#26032;&#26041;&#27861;&#65292;&#20197;&#26657;&#20934;&#20998;&#24067;&#25277;&#21462;&#27599;&#20010;&#20107;&#20214;&#30340;&#35746;&#21333;&#23610;&#23544;&#65292;&#24182;&#22312;&#27169;&#22411;&#20013;&#20445;&#25345;&#27491;&#30340;&#20215;&#24046;&#12290;&#36827;&#19968;&#27493;&#22320;&#65292;&#25105;&#20204;&#26681;&#25454;&#26102;&#38388;&#26465;&#20214;&#27169;&#22411;&#21442;&#25968;&#25903;&#25345;&#32463;&#39564;&#35266;&#23519;&#65292;&#24182;&#20351;&#29992;&#25913;&#36827;&#30340;&#38750;&#21442;&#25968;&#26041;&#27861;&#26657;&#20934;&#38669;&#20811;&#26031;&#26680;&#20989;&#25968;&#21644;&#25233;&#21046;&#24615;&#20132;&#21449;&#28608;&#21457;&#26680;&#20989;&#25968;&#12290;</title><link>https://arxiv.org/abs/2312.08927</link><description>&lt;p&gt;
&#38480;&#20215;&#21333;&#31807;&#21160;&#24577;&#19982;&#35746;&#21333;&#23610;&#23544;&#24314;&#27169;&#65306;&#22797;&#21512;&#38669;&#20811;&#26031;&#36827;&#31243;
&lt;/p&gt;
&lt;p&gt;
Limit Order Book Dynamics and Order Size Modelling Using Compound Hawkes Process
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.08927
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#22797;&#21512;&#38669;&#20811;&#26031;&#36827;&#31243;&#24314;&#27169;&#38480;&#20215;&#21333;&#31807;&#21160;&#24577;&#21644;&#35746;&#21333;&#23610;&#23544;&#30340;&#26032;&#26041;&#27861;&#65292;&#20197;&#26657;&#20934;&#20998;&#24067;&#25277;&#21462;&#27599;&#20010;&#20107;&#20214;&#30340;&#35746;&#21333;&#23610;&#23544;&#65292;&#24182;&#22312;&#27169;&#22411;&#20013;&#20445;&#25345;&#27491;&#30340;&#20215;&#24046;&#12290;&#36827;&#19968;&#27493;&#22320;&#65292;&#25105;&#20204;&#26681;&#25454;&#26102;&#38388;&#26465;&#20214;&#27169;&#22411;&#21442;&#25968;&#25903;&#25345;&#32463;&#39564;&#35266;&#23519;&#65292;&#24182;&#20351;&#29992;&#25913;&#36827;&#30340;&#38750;&#21442;&#25968;&#26041;&#27861;&#26657;&#20934;&#38669;&#20811;&#26031;&#26680;&#20989;&#25968;&#21644;&#25233;&#21046;&#24615;&#20132;&#21449;&#28608;&#21457;&#26680;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38669;&#20811;&#26031;&#36827;&#31243;&#24050;&#22312;&#25991;&#29486;&#20013;&#22810;&#31181;&#26041;&#24335;&#34987;&#29992;&#20110;&#27169;&#25311;&#38480;&#20215;&#21333;&#31807;&#21160;&#24577;&#65292;&#20294;&#24448;&#24448;&#20165;&#20851;&#27880;&#20107;&#20214;&#38388;&#38548;&#65292;&#32780;&#35746;&#21333;&#23610;&#23544;&#36890;&#24120;&#34987;&#20551;&#35774;&#20026;&#24120;&#25968;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#20351;&#29992;&#22797;&#21512;&#38669;&#20811;&#26031;&#36827;&#31243;&#26469;&#27169;&#25311;&#38480;&#20215;&#21333;&#31807;&#65292;&#20854;&#20013;&#27599;&#20010;&#20107;&#20214;&#30340;&#35746;&#21333;&#23610;&#23544;&#26469;&#33258;&#26657;&#20934;&#20998;&#24067;&#12290;&#35813;&#26041;&#27861;&#20197;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#24335;&#26500;&#24314;&#65292;&#20351;&#36827;&#31243;&#30340;&#20215;&#24046;&#22987;&#32456;&#20445;&#25345;&#27491;&#20540;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#26681;&#25454;&#26102;&#38388;&#26465;&#20214;&#27169;&#22411;&#21442;&#25968;&#20197;&#25903;&#25345;&#32463;&#39564;&#35266;&#23519;&#12290;&#25105;&#20204;&#20351;&#29992;&#25913;&#36827;&#30340;&#38750;&#21442;&#25968;&#26041;&#27861;&#26469;&#26657;&#20934;&#38669;&#20811;&#26031;&#26680;&#20989;&#25968;&#65292;&#24182;&#20801;&#35768;&#25233;&#21046;&#24615;&#20132;&#21449;&#28608;&#21457;&#26680;&#20989;&#25968;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#32435;&#26031;&#36798;&#20811;&#20132;&#26131;&#25152;&#20013;&#19968;&#21482;&#32929;&#31080;&#30340;&#38480;&#20215;&#21333;&#31807;&#19978;&#30340;&#32467;&#26524;&#21644;&#36866;&#24230;&#31243;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
Hawkes Process has been used to model Limit Order Book (LOB) dynamics in several ways in the literature however the focus has been limited to capturing the inter-event times while the order size is usually assumed to be constant. We propose a novel methodology of using Compound Hawkes Process for the LOB where each event has an order size sampled from a calibrated distribution. The process is formulated in a novel way such that the spread of the process always remains positive. Further, we condition the model parameters on time of day to support empirical observations. We make use of an enhanced non-parametric method to calibrate the Hawkes kernels and allow for inhibitory cross-excitation kernels. We showcase the results and quality of fits for an equity stock's LOB in the NASDAQ exchange.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#31934;&#30830;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#37327;&#21270;&#20102;&#22810;&#36793;&#24320;&#21457;&#38134;&#34892;&#36151;&#27454;&#32452;&#21512;&#20013;&#38754;&#20020;&#30340;&#22995;&#21517;&#38598;&#20013;&#39118;&#38505;&#65292;&#24182;&#25506;&#35752;&#20102;&#24403;&#21069;&#36164;&#26412;&#20805;&#36275;&#24615;&#26694;&#26550;&#26159;&#21542;&#36807;&#20110;&#20445;&#23432;&#20197;&#21450;&#21512;&#36866;&#30340;&#27169;&#22411;&#21442;&#25968;&#36873;&#25321;&#23545;&#22995;&#21517;&#38598;&#20013;&#39118;&#38505;&#24230;&#37327;&#30340;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2311.13802</link><description>&lt;p&gt;
&#20851;&#20110;&#22810;&#36793;&#24320;&#21457;&#38134;&#34892;&#32452;&#21512;&#20013;&#22995;&#21517;&#38598;&#20013;&#39118;&#38505;&#35843;&#25972;&#30340;&#30456;&#20851;&#24615;&#21644;&#36866;&#24403;&#24615;
&lt;/p&gt;
&lt;p&gt;
On the Relevance and Appropriateness of Name Concentration Risk Adjustments for Portfolios of Multilateral Development Banks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.13802
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#31934;&#30830;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#37327;&#21270;&#20102;&#22810;&#36793;&#24320;&#21457;&#38134;&#34892;&#36151;&#27454;&#32452;&#21512;&#20013;&#38754;&#20020;&#30340;&#22995;&#21517;&#38598;&#20013;&#39118;&#38505;&#65292;&#24182;&#25506;&#35752;&#20102;&#24403;&#21069;&#36164;&#26412;&#20805;&#36275;&#24615;&#26694;&#26550;&#26159;&#21542;&#36807;&#20110;&#20445;&#23432;&#20197;&#21450;&#21512;&#36866;&#30340;&#27169;&#22411;&#21442;&#25968;&#36873;&#25321;&#23545;&#22995;&#21517;&#38598;&#20013;&#39118;&#38505;&#24230;&#37327;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#36793;&#24320;&#21457;&#38134;&#34892;&#65288;MDBs&#65289;&#30340;&#20027;&#26435;&#36151;&#27454;&#32452;&#21512;&#36890;&#24120;&#20165;&#21253;&#21547;&#23569;&#25968;&#20511;&#27454;&#20154;&#65292;&#22240;&#27492;&#20005;&#37325;&#38754;&#20020;&#21333;&#19968;&#22995;&#21517;&#38598;&#20013;&#39118;&#38505;&#12290;&#26412;&#25991;&#26681;&#25454;&#20844;&#24320;&#21487;&#24471;&#25968;&#25454;&#26500;&#24314;&#30340;&#23454;&#38469;MDB&#32452;&#21512;&#65292;&#20351;&#29992;&#31934;&#30830;&#30340;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#37327;&#21270;&#20102;&#23545;&#22995;&#21517;&#38598;&#20013;&#39118;&#38505;&#30340;&#26292;&#38706;&#31243;&#24230;&#12290;&#36890;&#36807;&#23558;&#22995;&#21517;&#38598;&#20013;&#39118;&#38505;&#30340;&#31934;&#30830;&#35843;&#25972;&#19982;&#30446;&#21069;&#30001;&#20027;&#35201;&#35780;&#32423;&#26426;&#26500;&#26631;&#20934;&#26222;&#23572;&#20844;&#21496;&#24212;&#29992;&#30340;&#35299;&#26512;&#36817;&#20284;&#36827;&#34892;&#27604;&#36739;&#65292;&#25105;&#20204;&#36827;&#19968;&#27493;&#35843;&#26597;&#20102;&#24403;&#21069;MDB&#36164;&#26412;&#20805;&#36275;&#24615;&#26694;&#26550;&#26159;&#21542;&#36807;&#20110;&#20445;&#23432;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#35752;&#35770;&#20102;&#36866;&#24403;&#30340;&#27169;&#22411;&#21442;&#25968;&#36873;&#25321;&#21450;&#20854;&#23545;&#22995;&#21517;&#38598;&#20013;&#39118;&#38505;&#24230;&#37327;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.13802v2 Announce Type: replace  Abstract: Sovereign loan portfolios of Multilateral Development Banks (MDBs) typically consist of only a small number of borrowers and hence are heavily exposed to single name concentration risk. Based on realistic MDB portfolios constructed from publicly available data, this paper quantifies the magnitude of the exposure to name concentration risk using exact Monte Carlo simulations. In comparing the exact adjustment for name concentration risk to its analytic approximation as currently applied by the major rating agency Standard &amp; Poor's, we further investigate whether current capital adequacy frameworks for MDBs are overly conservative. Finally, we discuss the choice of appropriate model parameters and their impact on measures of name concentration risk.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#20869;&#24149;&#20449;&#24687;&#21644;&#19968;&#33324;&#26410;&#30693;&#20195;&#29702;&#30340;&#21160;&#24577;&#22343;&#34913;&#65292;&#22312;&#24341;&#20837;&#19968;&#33324;&#20559;&#22909;&#30340;&#22522;&#30784;&#19978;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#26469;&#35777;&#26126;&#37096;&#20998;&#36890;&#20449;&#22343;&#34913;&#65288;PCE&#65289;&#30340;&#23384;&#22312;&#12290;</title><link>https://arxiv.org/abs/2211.15573</link><description>&lt;p&gt;
&#20855;&#26377;&#20869;&#24149;&#20449;&#24687;&#21644;&#19968;&#33324;&#26410;&#30693;&#20195;&#29702;&#30340;&#21160;&#24577;&#22343;&#34913;
&lt;/p&gt;
&lt;p&gt;
Dynamic Equilibrium with Insider Information and General Uninformed Agent Utility
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2211.15573
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#20869;&#24149;&#20449;&#24687;&#21644;&#19968;&#33324;&#26410;&#30693;&#20195;&#29702;&#30340;&#21160;&#24577;&#22343;&#34913;&#65292;&#22312;&#24341;&#20837;&#19968;&#33324;&#20559;&#22909;&#30340;&#22522;&#30784;&#19978;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#26469;&#35777;&#26126;&#37096;&#20998;&#36890;&#20449;&#22343;&#34913;&#65288;PCE&#65289;&#30340;&#23384;&#22312;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#36830;&#32493;&#26102;&#38388;&#32463;&#27982;&#31995;&#32479;&#65292;&#20854;&#20013;&#20195;&#29702;&#26377;&#19981;&#23545;&#31216;&#20449;&#24687;&#12290;&#30693;&#24773;&#20195;&#29702;&#65288;"$I$"&#65289;&#22312;&#26102;&#38388;&#38646;&#26102;&#33719;&#24471;&#20851;&#20110;&#39118;&#38505;&#36164;&#20135;&#32456;&#26399;&#25910;&#30410;$\Psi(X_T)$&#30340;&#31169;&#20154;&#20449;&#21495;&#65292;&#32780;&#26410;&#30693;&#24773;&#25253;&#30340;&#20195;&#29702;&#65288;"$U$"&#65289;&#27809;&#26377;&#31169;&#20154;&#20449;&#21495;&#12290;&#36825;&#25193;&#23637;&#20102;&#20808;&#21069;&#22312;&#25152;&#26377;&#20195;&#29702;&#20855;&#26377;&#25351;&#25968;&#25928;&#29992;&#26102;&#20351;&#29992;&#30340;&#19981;&#23545;&#31216;&#20449;&#24687;&#22343;&#34913;&#26500;&#36896;&#65292;&#24182;&#20351;&#25105;&#20204;&#33021;&#22815;&#30740;&#31350;$U$&#30340;&#21021;&#22987;&#20221;&#39069;&#31104;&#36171;&#23545;&#22343;&#34913;&#30340;&#24433;&#21709;&#12290;&#20026;&#20102;&#20801;&#35768;$U$&#25317;&#26377;&#19968;&#33324;&#20559;&#22909;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#26469;&#35777;&#26126;&#37096;&#20998;&#36890;&#20449;&#22343;&#34913;&#65288;PCE&#65289;&#30340;&#23384;&#22312;&#65292;&#22312;&#26102;&#38388;$0$&#65292;$U$&#25509;&#25910;&#30340;&#20449;&#21495;&#27604;$I$&#23569;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2211.15573v3 Announce Type: replace  Abstract: We study a continuous time economy where agents have asymmetric information. The informed agent (``$I$''), at time zero, receives a private signal about the risky assets' terminal payoff $\Psi(X_T)$, while the uninformed agent (``$U$'') has no private signal. $\Psi$ is an arbitrary payoff function, and $X$ follows a time-homogeneous diffusion. Crucially, we allow $U$ to have von Neumann-Morgenstern preferences with a general utility function on $(0,\infty)$ satisfying the standard conditions. This extends previous constructions of equilibria with asymmetric information used when all agents have exponential utilities and enables us to study the impact of $U$'s initial share endowment on equilibrium. To allow for $U$ to have general preferences, we introduce a new method to prove existence of a partial communication equilibrium (PCE), where at time $0$, $U$ receives a less-informative signal than $I$. In the single asset case, this sig
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#26159;&#39318;&#27425;&#23581;&#35797;&#25552;&#20379;&#20851;&#20110;&#26426;&#22330;&#32489;&#25928;&#19982;&#31649;&#29702;&#23545;&#29983;&#24577;&#36716;&#22411;&#25215;&#35834;&#20043;&#38388;&#20851;&#31995;&#30340;&#23454;&#35777;&#35777;&#25454;&#12290;</title><link>https://arxiv.org/abs/2210.02736</link><description>&lt;p&gt;
&#26397;&#21521;&#29615;&#22659;&#21487;&#25345;&#32493;&#24615;&#21457;&#23637;&#65306;&#20851;&#20110;&#26426;&#22330;&#25928;&#29575;&#30340;&#23454;&#35777;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Toward environmental sustainability: an empirical study on airports efficiency
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2210.02736
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26159;&#39318;&#27425;&#23581;&#35797;&#25552;&#20379;&#20851;&#20110;&#26426;&#22330;&#32489;&#25928;&#19982;&#31649;&#29702;&#23545;&#29983;&#24577;&#36716;&#22411;&#25215;&#35834;&#20043;&#38388;&#20851;&#31995;&#30340;&#23454;&#35777;&#35777;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2210.02736v2 &#20844;&#21578;&#31867;&#22411;&#65306;&#26367;&#25442;  &#25688;&#35201;&#65306;&#36716;&#21521;&#26356;&#29615;&#20445;&#30340;&#29983;&#20135;&#27969;&#31243;&#21644;&#31649;&#29702;&#23454;&#36341;&#26159;&#19968;&#20010;&#26085;&#30410;&#37325;&#35201;&#30340;&#35838;&#39064;&#12290;&#35768;&#22810;&#34892;&#19994;&#38656;&#35201;&#36827;&#34892;&#26681;&#26412;&#24615;&#25913;&#21464;&#65292;&#20197;&#28385;&#36275;&#29615;&#22659;&#21487;&#25345;&#32493;&#24615;&#35201;&#27714;&#65307;&#26053;&#28216;&#19994;&#20063;&#19981;&#20363;&#22806;&#12290;&#22312;&#36825;&#26041;&#38754;&#65292;&#38656;&#35201;&#36827;&#19968;&#27493;&#20851;&#27880;&#30340;&#19968;&#20010;&#29305;&#23450;&#26041;&#38754;&#26159;&#26426;&#22330;&#32489;&#25928;&#19982;&#29615;&#22659;&#21487;&#25345;&#32493;&#25919;&#31574;&#25237;&#36164;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#26412;&#30740;&#31350;&#26159;&#39318;&#27425;&#23581;&#35797;&#25552;&#20379;&#20851;&#20110;&#36825;&#31181;&#20851;&#31995;&#30340;&#23454;&#35777;&#35777;&#25454;&#12290;&#36890;&#36807;&#24212;&#29992;&#38750;&#21442;&#25968;&#26041;&#27861;&#65292;&#25105;&#20204;&#39318;&#20808;&#35780;&#20272;&#24847;&#22823;&#21033;&#26426;&#22330;&#19994;&#30340;&#25928;&#29575;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#20351;&#29992;Tobit&#22238;&#24402;&#27169;&#22411;&#35843;&#26597;&#20102;&#26426;&#22330;&#32489;&#25928;&#19982;&#31649;&#29702;&#23545;&#29983;&#24577;&#36716;&#22411;&#30340;&#25215;&#35834;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#26426;&#22330;&#36981;&#23432;&#27491;&#24335;&#30340;&#22810;&#24180;&#29983;&#24577;&#36716;&#22411;&#35745;&#21010;&#23545;&#20854;&#20135;&#29983;&#20102;&#31215;&#26497;&#21644;&#19968;&#33268;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2210.02736v2 Announce Type: replace  Abstract: The transition to more environmentally sustainable production processes and managerial practices is an increasingly important topic. Many industries need to undergo radical change to meet environmental sustainability requirements; the tourism industry is no exception. In this respect, a particular aspect that needs further attention is the relationship between airport performances and investments in environmental sustainability policies. This work represents a first attempt to provide empirical evidences about this relationship. Through the application of a non-parametrical method, we first assess the efficiency of the Italian airports industry. Secondly, we investigated the relationship between airports performance and management commitment toward the ecological transition using a Tobit regression model. The results show that airports adherence to formal multi-year ecological transition programs has a positive and consistent impact 
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#38024;&#23545;&#19968;&#32452;&#23454;&#20540;&#20989;&#25968;&#30340;&#20934;&#24517;&#28982;&#26412;&#36136;&#30830;&#30028;&#27010;&#24565;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#37329;&#34701;&#38382;&#39064;&#65292;&#21253;&#25324;&#36229;&#22797;&#21046;&#20998;&#26512;&#21644;&#36229;&#23545;&#20914;&#25104;&#26412;&#30340;&#21452;&#23545;&#20598;&#29305;&#24449;&#12290;</title><link>https://arxiv.org/abs/2107.12862</link><description>&lt;p&gt;
&#20934;&#24517;&#28982;&#26412;&#36136;&#19978;&#30830;&#30028;&#21450;&#20854;&#22312;&#37329;&#34701;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Quasi-sure essential supremum and applications to finance
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2107.12862
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#38024;&#23545;&#19968;&#32452;&#23454;&#20540;&#20989;&#25968;&#30340;&#20934;&#24517;&#28982;&#26412;&#36136;&#30830;&#30028;&#27010;&#24565;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#37329;&#34701;&#38382;&#39064;&#65292;&#21253;&#25324;&#36229;&#22797;&#21046;&#20998;&#26512;&#21644;&#36229;&#23545;&#20914;&#25104;&#26412;&#30340;&#21452;&#23545;&#20598;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#19981;&#30830;&#23450;&#24615;&#34987;&#19968;&#32452;&#38750;&#25903;&#37197;&#21644;&#38750;&#32039;&#33268;&#27010;&#29575;&#27979;&#24230;&#27169;&#25311;&#26102;&#65292;&#20197;&#19978;&#21322;&#35299;&#26512;&#20989;&#25968;&#20026;&#22522;&#30784;&#65292;&#38024;&#23545;&#19968;&#32452;&#23454;&#20540;&#20989;&#25968;&#25552;&#20986;&#20102;&#26412;&#36136;&#19978;&#30830;&#30028;&#30340;&#27010;&#24565;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#21021;&#22987;&#20989;&#25968;&#19978;&#20551;&#35774;&#30340;&#24615;&#36136;&#22914;&#20309;&#24310;&#20280;&#21040;&#23427;&#20204;&#30340;&#20934;&#24517;&#28982;&#26412;&#36136;&#30830;&#30028;&#19978;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#22312;&#37329;&#34701;&#38382;&#39064;&#20013;&#24212;&#29992;&#30340;&#21508;&#31181;&#26041;&#24335;&#65292;&#21253;&#25324;&#23545;&#24102;&#25705;&#25830;&#30340;&#36229;&#22797;&#21046;&#36827;&#34892;&#20998;&#26512;&#65292;&#24182;&#35777;&#26126;&#20102;&#36229;&#23545;&#20914;&#25104;&#26412;&#30340;&#21452;&#23545;&#20598;&#29305;&#24449;&#12290;&#25105;&#20204;&#36824;&#30740;&#31350;&#20102;&#19968;&#31181;&#24369;&#22871;&#21033;&#26080;&#22871;&#21033;&#26465;&#20214;&#65292;&#31216;&#20026;&#30636;&#38388;&#21033;&#28070;&#32570;&#22833;&#65288;AIP&#65289;&#65292;&#22312;&#36825;&#31181;&#26465;&#20214;&#19979;&#20215;&#26684;&#26159;&#26377;&#38480;&#30340;&#12290;&#36825;&#38656;&#35201;&#23545;&#20934;&#24517;&#28982;&#38472;&#36848;&#30340;&#32858;&#21512;&#25552;&#20986;&#26032;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2107.12862v2 Announce Type: replace  Abstract: When uncertainty is modelled by a set of non-dominated and non-compact probability measures, a notion of essential supremum for a family of real-valued functions is developed in terms of upper semi-analytic functions. We show how the properties postulated on the initial functions carry over to their quasi-sure essential supremum. We propose various applications to financial problems with frictions. We analyse super-replication and prove a bi-dual characterization of the super-hedging cost. We also study a weak no-arbitrage condition called Absence of Instantaneous Profit (AIP) under which prices are finite. This requires new results on the aggregation of quasi-sure statements.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#22312;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#22122;&#22768;&#19979;&#23398;&#20064;&#27874;&#21160;&#29575;&#30340;&#38382;&#39064;&#65292;&#37319;&#29992;&#38750;&#21442;&#25968;&#36125;&#21494;&#26031;&#26041;&#27861;&#65292;&#36890;&#36807;&#20808;&#21069;&#30740;&#31350;&#27874;&#21160;&#29575;&#20989;&#25968;&#21644;&#37319;&#29992;&#21069;&#21521;&#28388;&#27874;&#21518;&#21521;&#27169;&#25311;&#31639;&#27861;&#31561;&#26032;&#39062;&#35745;&#31639;&#26041;&#27861;&#65292;&#22312;&#21512;&#25104;&#25968;&#25454;&#21644;EUR/USD&#27719;&#29575;&#25968;&#25454;&#38598;&#19978;&#34920;&#29616;&#33391;&#22909;&#12290;</title><link>https://arxiv.org/abs/1805.05606</link><description>&lt;p&gt;
&#22312;&#24494;&#35266;&#32467;&#26500;&#22122;&#22768;&#19979;&#30340;&#38750;&#21442;&#25968;&#36125;&#21494;&#26031;&#27874;&#21160;&#29575;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Nonparametric Bayesian volatility learning under microstructure noise
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/1805.05606
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#22312;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#22122;&#22768;&#19979;&#23398;&#20064;&#27874;&#21160;&#29575;&#30340;&#38382;&#39064;&#65292;&#37319;&#29992;&#38750;&#21442;&#25968;&#36125;&#21494;&#26031;&#26041;&#27861;&#65292;&#36890;&#36807;&#20808;&#21069;&#30740;&#31350;&#27874;&#21160;&#29575;&#20989;&#25968;&#21644;&#37319;&#29992;&#21069;&#21521;&#28388;&#27874;&#21518;&#21521;&#27169;&#25311;&#31639;&#27861;&#31561;&#26032;&#39062;&#35745;&#31639;&#26041;&#27861;&#65292;&#22312;&#21512;&#25104;&#25968;&#25454;&#21644;EUR/USD&#27719;&#29575;&#25968;&#25454;&#38598;&#19978;&#34920;&#29616;&#33391;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#22122;&#22768;&#19979;&#23398;&#20064;&#27874;&#21160;&#29575;&#30340;&#38382;&#39064;&#12290;&#20855;&#20307;&#22320;&#65292;&#25105;&#20204;&#32771;&#34385;&#20174;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#20013;&#33719;&#24471;&#30340;&#24102;&#26377;&#22122;&#22768;&#30340;&#31163;&#25955;&#26102;&#38388;&#35266;&#27979;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35745;&#31639;&#26041;&#27861;&#26469;&#23398;&#20064;&#35813;&#26041;&#31243;&#30340;&#25193;&#25955;&#31995;&#25968;&#12290;&#25105;&#20204;&#37319;&#29992;&#20102;&#38750;&#21442;&#25968;&#36125;&#21494;&#26031;&#26041;&#27861;&#65292;&#20854;&#20013;&#25105;&#20204;\emph{a priori}&#23558;&#27874;&#21160;&#29575;&#20989;&#25968;&#24314;&#27169;&#20026;&#20998;&#27573;&#24120;&#25968;&#12290;&#20854;&#20808;&#39564;&#36890;&#36807;&#36870;Gamma&#39532;&#23572;&#21487;&#22827;&#38142;&#26469;&#25351;&#23450;&#12290;&#36890;&#36807;&#23558;&#21069;&#21521;&#28388;&#27874;&#21518;&#21521;&#27169;&#25311;&#31639;&#27861;&#32435;&#20837;Gibbs&#37319;&#26679;&#22120;&#20013;&#26469;&#23545;&#21518;&#39564;&#36827;&#34892;&#25277;&#26679;&#12290;&#35813;&#26041;&#27861;&#22312;&#20004;&#20010;&#20195;&#34920;&#24615;&#30340;&#21512;&#25104;&#25968;&#25454;&#31034;&#20363;&#19978;&#34920;&#29616;&#33391;&#22909;&#12290;&#25105;&#20204;&#36824;&#23558;&#35813;&#26041;&#27861;&#24212;&#29992;&#20110;EUR/USD&#27719;&#29575;&#25968;&#25454;&#38598;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#32473;&#20986;&#20808;&#39564;&#20998;&#24067;&#30340;&#26497;&#38480;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:1805.05606v2 Announce Type: replace-cross  Abstract: In this work, we study the problem of learning the volatility under market microstructure noise. Specifically, we consider noisy discrete time observations from a stochastic differential equation and develop a novel computational method to learn the diffusion coefficient of the equation. We take a nonparametric Bayesian approach, where we \emph{a priori} model the volatility function as piecewise constant. Its prior is specified via the inverse Gamma Markov chain. Sampling from the posterior is accomplished by incorporating the Forward Filtering Backward Simulation algorithm in the Gibbs sampler. Good performance of the method is demonstrated on two representative synthetic data examples. We also apply the method on a EUR/USD exchange rate dataset. Finally we present a limit result on the prior distribution.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31232;&#30095;&#25351;&#25968;&#36319;&#36394;&#38382;&#39064;&#30340;&#24418;&#24335;&#21270;&#65292;&#20351;&#29992;&#20102;$\ell_0$-&#33539;&#25968;&#32422;&#26463;&#65292;&#21487;&#20197;&#36731;&#26494;&#25511;&#21046;&#25237;&#36164;&#32452;&#21512;&#20013;&#36164;&#20135;&#25968;&#37327;&#30340;&#19978;&#38480;&#12290;</title><link>http://arxiv.org/abs/2309.10152</link><description>&lt;p&gt;
Primal-Dual $\ell_0$-&#32422;&#26463;&#31232;&#30095;&#25351;&#25968;&#36319;&#36394;
&lt;/p&gt;
&lt;p&gt;
Primal-Dual $\ell_0$-Constrained Sparse Index Tracking. (arXiv:2309.10152v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.10152
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31232;&#30095;&#25351;&#25968;&#36319;&#36394;&#38382;&#39064;&#30340;&#24418;&#24335;&#21270;&#65292;&#20351;&#29992;&#20102;$\ell_0$-&#33539;&#25968;&#32422;&#26463;&#65292;&#21487;&#20197;&#36731;&#26494;&#25511;&#21046;&#25237;&#36164;&#32452;&#21512;&#20013;&#36164;&#20135;&#25968;&#37327;&#30340;&#19978;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31232;&#30095;&#25351;&#25968;&#36319;&#36394;&#26159;&#19968;&#31181;&#37325;&#35201;&#30340;&#34987;&#21160;&#25237;&#36164;&#32452;&#21512;&#31649;&#29702;&#31574;&#30053;&#65292;&#23427;&#36890;&#36807;&#26500;&#24314;&#31232;&#30095;&#25237;&#36164;&#32452;&#21512;&#26469;&#36319;&#36394;&#37329;&#34701;&#25351;&#25968;&#12290;&#30456;&#27604;&#20110;&#20840;&#20179;&#25237;&#36164;&#32452;&#21512;&#65292;&#31232;&#30095;&#25237;&#36164;&#32452;&#21512;&#22312;&#38477;&#20302;&#20132;&#26131;&#25104;&#26412;&#21644;&#36991;&#20813;&#19981;&#27969;&#21160;&#36164;&#20135;&#26041;&#38754;&#26356;&#20855;&#20248;&#21183;&#12290;&#20026;&#20102;&#24378;&#21046;&#25237;&#36164;&#32452;&#21512;&#30340;&#31232;&#30095;&#24615;&#65292;&#20256;&#32479;&#30740;&#31350;&#25552;&#20986;&#20102;&#22522;&#20110;$\ell_p$-&#33539;&#25968;&#27491;&#21017;&#21270;&#30340;&#20844;&#24335;&#65292;&#20316;&#20026;$\ell_0$-&#33539;&#25968;&#27491;&#21017;&#21270;&#30340;&#36830;&#32493;&#26367;&#20195;&#12290;&#23613;&#31649;&#36825;&#26679;&#30340;&#20844;&#24335;&#21487;&#20197;&#29992;&#26469;&#26500;&#24314;&#31232;&#30095;&#25237;&#36164;&#32452;&#21512;&#65292;&#20294;&#22312;&#23454;&#38469;&#25237;&#36164;&#20013;&#21364;&#19981;&#26131;&#20351;&#29992;&#65292;&#22240;&#20026;&#32454;&#33268;&#30340;&#21442;&#25968;&#35843;&#25972;&#26469;&#25351;&#23450;&#25237;&#36164;&#32452;&#21512;&#20013;&#36164;&#20135;&#25968;&#37327;&#30340;&#19978;&#38480;&#26159;&#33392;&#38590;&#19988;&#32791;&#26102;&#30340;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31232;&#30095;&#25351;&#25968;&#36319;&#36394;&#38382;&#39064;&#30340;&#24418;&#24335;&#21270;&#65292;&#20351;&#29992;&#20102;$\ell_0$-&#33539;&#25968;&#32422;&#26463;&#65292;&#20174;&#32780;&#21487;&#20197;&#36731;&#26494;&#25511;&#21046;&#25237;&#36164;&#32452;&#21512;&#20013;&#36164;&#20135;&#25968;&#37327;&#30340;&#19978;&#38480;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#24418;&#24335;&#21270;&#20801;&#35768;&#22312;&#25237;&#36164;&#32452;&#21512;&#31232;&#30095;&#24615;&#21644;&#25442;&#25163;&#29575;&#20043;&#38388;&#36827;&#34892;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;
Sparse index tracking is one of the prominent passive portfolio management strategies that construct a sparse portfolio to track a financial index. A sparse portfolio is desirable over a full portfolio in terms of transaction cost reduction and avoiding illiquid assets. To enforce the sparsity of the portfolio, conventional studies have proposed formulations based on $\ell_p$-norm regularizations as a continuous surrogate of the $\ell_0$-norm regularization. Although such formulations can be used to construct sparse portfolios, they are not easy to use in actual investments because parameter tuning to specify the exact upper bound on the number of assets in the portfolio is delicate and time-consuming. In this paper, we propose a new problem formulation of sparse index tracking using an $\ell_0$-norm constraint that enables easy control of the upper bound on the number of assets in the portfolio. In addition, our formulation allows the choice between portfolio sparsity and turnover spa
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20855;&#26377;&#20869;&#29983;&#25345;&#20037;&#24066;&#22330;&#24433;&#21709;&#30340;&#19981;&#23436;&#20840;&#37329;&#34701;&#24066;&#22330;&#20013;&#65292;&#22823;&#22411;&#25237;&#36164;&#32773;&#30340;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#12290;&#36890;&#36807;&#35299;&#20915;&#19968;&#32452;&#32806;&#21512;&#30340;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65292;&#25105;&#20204;&#23436;&#20840;&#25551;&#36848;&#20102;&#38382;&#39064;&#30340;&#26368;&#20248;&#24615;&#65292;&#24182;&#19988;&#32473;&#20986;&#20102;&#35299;&#30340;&#23384;&#22312;&#24615;&#21644;&#20809;&#28369;&#24615;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2005.04312</link><description>&lt;p&gt;
&#20869;&#29983;&#23450;&#20215;&#19979;&#30340;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Utility maximization under endogenous pricing. (arXiv:2005.04312v3 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2005.04312
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20855;&#26377;&#20869;&#29983;&#25345;&#20037;&#24066;&#22330;&#24433;&#21709;&#30340;&#19981;&#23436;&#20840;&#37329;&#34701;&#24066;&#22330;&#20013;&#65292;&#22823;&#22411;&#25237;&#36164;&#32773;&#30340;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#12290;&#36890;&#36807;&#35299;&#20915;&#19968;&#32452;&#32806;&#21512;&#30340;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65292;&#25105;&#20204;&#23436;&#20840;&#25551;&#36848;&#20102;&#38382;&#39064;&#30340;&#26368;&#20248;&#24615;&#65292;&#24182;&#19988;&#32473;&#20986;&#20102;&#35299;&#30340;&#23384;&#22312;&#24615;&#21644;&#20809;&#28369;&#24615;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20855;&#26377;&#20869;&#29983;&#25345;&#20037;&#24066;&#22330;&#24433;&#21709;&#30340;&#19981;&#23436;&#20840;&#37329;&#34701;&#24066;&#22330;&#20013;&#65292;&#19968;&#20301;&#22823;&#22411;&#25237;&#36164;&#32773;&#30340;&#39044;&#26399;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#12290;&#20551;&#35774;&#36164;&#20135;&#20215;&#26684;&#36981;&#24490;&#24066;&#22330;&#19978;&#20195;&#34920;&#24615;&#27969;&#21160;&#24615;&#20379;&#24212;&#21830;&#30340;&#25928;&#29992;&#19981;&#21464;&#26354;&#32447;&#20316;&#20026;&#38750;&#32447;&#24615;&#20215;&#26684;&#26354;&#32447;&#12290;&#25105;&#20204;&#36890;&#36807;&#19968;&#32452;&#32806;&#21512;&#30340;&#21069;&#21521;-&#21518;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65288;FBSDEs&#65289;&#23436;&#20840;&#25551;&#36848;&#20986;&#26368;&#20248;&#24615;&#65292;&#35813;&#26041;&#31243;&#32452;&#23545;&#24212;&#38750;&#32447;&#24615;&#21453;&#21521;&#38543;&#26426;&#20559;&#24494;&#20998;&#26041;&#31243;&#65288;BSPDE&#65289;&#12290;&#22312;&#24066;&#22330;&#20195;&#34920;&#24615;&#24066;&#22330;&#21046;&#36896;&#21830;&#30340;&#39537;&#21160;&#20989;&#25968;&#33267;&#23569;&#21576;&#20108;&#27425;&#22686;&#38271;&#25110;&#22823;&#22411;&#25237;&#36164;&#32773;&#30340;&#25928;&#29992;&#20989;&#25968;&#19979;&#38477;&#24471;&#27604;&#20108;&#27425;&#26356;&#24555;&#25110;&#21576;&#25351;&#25968;&#24418;&#24335;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#26368;&#20248;&#25237;&#36164;&#38382;&#39064;&#21644;FBSDEs&#30340;&#35299;&#30340;&#23384;&#22312;&#24615;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;BSPDEs&#35299;&#23384;&#22312;&#30340;&#20809;&#28369;&#24615;&#32467;&#26524;&#12290;&#25991;&#20013;&#25552;&#20379;&#20102;&#23436;&#20840;&#24066;&#22330;&#24773;&#20917;&#19979;&#30340;&#31034;&#20363;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the expected utility maximization problem of a large investor who is allowed to make transactions on tradable assets in an incomplete financial market with endogenous permanent market impacts. The asset prices are assumed to follow a nonlinear price curve quoted in the market as the utility indifference curve of a representative liquidity supplier. We show that optimality can be fully characterized via a system of coupled forward-backward stochastic differential equations (FBSDEs) which corresponds to a non-linear backward stochastic partial differential equation (BSPDE). We show existence of solutions to the optimal investment problem and the FBSDEs in the case where the driver function of the representative market maker grows at least quadratically or the utility function of the large investor falls faster than quadratically or is exponential. Furthermore, we derive smoothness results for the existence of solutions of BSPDEs. Examples are provided when the market is complete
&lt;/p&gt;</description></item></channel></rss>