<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20998;&#31163;&#21464;&#20998;&#23545;&#25239;&#35757;&#32451;&#30340;&#39118;&#38505;&#24863;&#30693;&#22411;&#32929;&#31080;&#25512;&#33616;&#26041;&#27861;&#65292;&#36890;&#36807;&#23545;&#25239;&#24615;&#25200;&#21160;&#25552;&#39640;&#27169;&#22411;&#23545;&#20110;&#39118;&#38505;&#30340;&#24863;&#30693;&#33021;&#21147;&#65292;&#36890;&#36807;&#21464;&#20998;&#25200;&#21160;&#29983;&#25104;&#22120;&#27169;&#25311;&#19981;&#21516;&#30340;&#39118;&#38505;&#22240;&#32032;&#24182;&#29983;&#25104;&#20195;&#34920;&#24615;&#30340;&#39118;&#38505;&#25351;&#26631;&#23545;&#25239;&#26679;&#26412;&#12290;&#22312;&#30495;&#23454;&#32929;&#31080;&#25968;&#25454;&#19978;&#36827;&#34892;&#30340;&#23454;&#39564;&#34920;&#26126;&#35813;&#26041;&#27861;&#26377;&#25928;&#38477;&#20302;&#20102;&#25237;&#36164;&#39118;&#38505;&#21516;&#26102;&#20445;&#25345;&#39640;&#39044;&#26399;&#25910;&#30410;&#12290;</title><link>http://arxiv.org/abs/2304.11043</link><description>&lt;p&gt;
&#25200;&#21160;&#26377;&#21161;&#20110;&#38477;&#20302;&#25237;&#36164;&#39118;&#38505;&#21527;&#65311; &#22522;&#20110;&#20998;&#31163;&#21464;&#20998;&#23545;&#25239;&#35757;&#32451;&#30340;&#39118;&#38505;&#24863;&#30693;&#22411;&#32929;&#31080;&#25512;&#33616;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Can Perturbations Help Reduce Investment Risks? Risk-Aware Stock Recommendation via Split Variational Adversarial Training. (arXiv:2304.11043v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.11043
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20998;&#31163;&#21464;&#20998;&#23545;&#25239;&#35757;&#32451;&#30340;&#39118;&#38505;&#24863;&#30693;&#22411;&#32929;&#31080;&#25512;&#33616;&#26041;&#27861;&#65292;&#36890;&#36807;&#23545;&#25239;&#24615;&#25200;&#21160;&#25552;&#39640;&#27169;&#22411;&#23545;&#20110;&#39118;&#38505;&#30340;&#24863;&#30693;&#33021;&#21147;&#65292;&#36890;&#36807;&#21464;&#20998;&#25200;&#21160;&#29983;&#25104;&#22120;&#27169;&#25311;&#19981;&#21516;&#30340;&#39118;&#38505;&#22240;&#32032;&#24182;&#29983;&#25104;&#20195;&#34920;&#24615;&#30340;&#39118;&#38505;&#25351;&#26631;&#23545;&#25239;&#26679;&#26412;&#12290;&#22312;&#30495;&#23454;&#32929;&#31080;&#25968;&#25454;&#19978;&#36827;&#34892;&#30340;&#23454;&#39564;&#34920;&#26126;&#35813;&#26041;&#27861;&#26377;&#25928;&#38477;&#20302;&#20102;&#25237;&#36164;&#39118;&#38505;&#21516;&#26102;&#20445;&#25345;&#39640;&#39044;&#26399;&#25910;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32929;&#31080;&#24066;&#22330;&#65292;&#25104;&#21151;&#30340;&#25237;&#36164;&#38656;&#35201;&#22312;&#21033;&#28070;&#21644;&#39118;&#38505;&#20043;&#38388;&#21462;&#24471;&#33391;&#22909;&#30340;&#24179;&#34913;&#12290;&#26368;&#36817;&#65292;&#22312;&#37327;&#21270;&#25237;&#36164;&#20013;&#24191;&#27867;&#30740;&#31350;&#20102;&#32929;&#31080;&#25512;&#33616;&#65292;&#20197;&#20026;&#25237;&#36164;&#32773;&#36873;&#25321;&#20855;&#26377;&#26356;&#39640;&#25910;&#30410;&#29575;&#30340;&#32929;&#31080;&#12290;&#23613;&#31649;&#22312;&#33719;&#21033;&#26041;&#38754;&#21462;&#24471;&#20102;&#25104;&#21151;&#65292;&#20294;&#22823;&#22810;&#25968;&#29616;&#26377;&#30340;&#25512;&#33616;&#26041;&#27861;&#20173;&#28982;&#22312;&#39118;&#38505;&#25511;&#21046;&#26041;&#38754;&#36739;&#24369;&#65292;&#36825;&#21487;&#33021;&#23548;&#33268;&#23454;&#38469;&#32929;&#31080;&#25237;&#36164;&#20013;&#38590;&#20197;&#25215;&#21463;&#30340;&#20111;&#25439;&#12290;&#20026;&#20102;&#26377;&#25928;&#38477;&#20302;&#39118;&#38505;&#65292;&#25105;&#20204;&#20174;&#23545;&#25239;&#24615;&#25200;&#21160;&#20013;&#33719;&#24471;&#21551;&#31034;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22522;&#20110;&#20998;&#31163;&#21464;&#20998;&#23545;&#25239;&#35757;&#32451;&#65288;SVAT&#65289;&#26694;&#26550;&#30340;&#39118;&#38505;&#24863;&#30693;&#22411;&#32929;&#31080;&#25512;&#33616;&#26041;&#27861;&#12290;&#26412;&#36136;&#19978;&#65292;SVAT&#40723;&#21169;&#27169;&#22411;&#23545;&#39118;&#38505;&#32929;&#31080;&#26679;&#26412;&#30340;&#23545;&#25239;&#24615;&#25200;&#21160;&#25935;&#24863;&#65292;&#24182;&#36890;&#36807;&#23398;&#20064;&#25200;&#21160;&#26469;&#22686;&#24378;&#27169;&#22411;&#30340;&#39118;&#38505;&#24847;&#35782;&#12290;&#20026;&#20102;&#29983;&#25104;&#20195;&#34920;&#24615;&#30340;&#39118;&#38505;&#25351;&#26631;&#23545;&#25239;&#26679;&#26412;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#20010;&#21464;&#20998;&#25200;&#21160;&#29983;&#25104;&#22120;&#26469;&#27169;&#25311;&#19981;&#21516;&#30340;&#39118;&#38505;&#22240;&#32032;&#12290;&#29305;&#21035;&#22320;&#65292;&#21464;&#20998;&#32467;&#26500;&#20351;&#25105;&#20204;&#30340;&#26041;&#27861;&#33021;&#22815;&#25429;&#25417;&#38590;&#20197;&#26126;&#30830;&#37327;&#21270;&#21644;&#24314;&#27169;&#30340;&#21508;&#31181;&#39118;&#38505;&#22240;&#32032;&#12290;&#22312;&#30495;&#23454;&#32929;&#31080;&#25968;&#25454;&#19978;&#30340;&#32508;&#21512;&#23454;&#39564;&#34920;&#26126;&#65292;SVAT&#22312;&#38477;&#20302;&#25237;&#36164;&#39118;&#38505;&#30340;&#21516;&#26102;&#20445;&#25345;&#39640;&#39044;&#26399;&#25910;&#30410;&#19978;&#38750;&#24120;&#26377;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the stock market, a successful investment requires a good balance between profits and risks. Recently, stock recommendation has been widely studied in quantitative investment to select stocks with higher return ratios for investors. Despite the success in making profits, most existing recommendation approaches are still weak in risk control, which may lead to intolerable paper losses in practical stock investing. To effectively reduce risks, we draw inspiration from adversarial perturbations and propose a novel Split Variational Adversarial Training (SVAT) framework for risk-aware stock recommendation. Essentially, SVAT encourages the model to be sensitive to adversarial perturbations of risky stock examples and enhances the model's risk awareness by learning from perturbations. To generate representative adversarial examples as risk indicators, we devise a variational perturbation generator to model diverse risk factors. Particularly, the variational architecture enables our method
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#22522;&#20110;&#21306;&#22359;&#38142;&#30340;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#20013;&#30340;&#26368;&#22823;&#21487;&#25552;&#21462;&#20215;&#20540;&#65288;MEV&#65289;&#65292;&#24182;&#35777;&#26126;&#20102;&#24403;&#21306;&#22359;&#25490;&#24207;&#26426;&#21046;&#21644;&#21306;&#22359;&#26102;&#38388;&#20998;&#24067;&#21457;&#29983;&#21464;&#21270;&#26102;&#65292;&#35813;MEV&#26159;&#19981;&#21464;&#30340;&#65292;&#36825;&#33021;&#20026;&#35774;&#35745;&#21306;&#22359;&#38142;&#21327;&#35758;&#25552;&#20379;&#25351;&#23548;&#12290;</title><link>http://arxiv.org/abs/2304.11010</link><description>&lt;p&gt;
&#26368;&#22823;&#21487;&#25552;&#21462;&#20215;&#20540;&#30340;&#19981;&#21464;&#24615;&#36136;
&lt;/p&gt;
&lt;p&gt;
Invariance properties of maximal extractable value. (arXiv:2304.11010v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.11010
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#22522;&#20110;&#21306;&#22359;&#38142;&#30340;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#20013;&#30340;&#26368;&#22823;&#21487;&#25552;&#21462;&#20215;&#20540;&#65288;MEV&#65289;&#65292;&#24182;&#35777;&#26126;&#20102;&#24403;&#21306;&#22359;&#25490;&#24207;&#26426;&#21046;&#21644;&#21306;&#22359;&#26102;&#38388;&#20998;&#24067;&#21457;&#29983;&#21464;&#21270;&#26102;&#65292;&#35813;MEV&#26159;&#19981;&#21464;&#30340;&#65292;&#36825;&#33021;&#20026;&#35774;&#35745;&#21306;&#22359;&#38142;&#21327;&#35758;&#25552;&#20379;&#25351;&#23548;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#24418;&#24335;&#21270;&#25512;&#29702;&#21435;&#30740;&#31350;&#22522;&#20110;&#21306;&#22359;&#38142;&#30340;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#65292;&#24182;&#32473;&#20986;&#20102;&#19968;&#31181;&#29305;&#23450;&#24418;&#24335;&#30340;&#26368;&#22823;&#21487;&#25552;&#21462;&#20215;&#20540;&#65288;MEV&#65289;&#30340;&#34920;&#36798;&#24335;&#65292;&#35813;&#34920;&#36798;&#24335;&#20195;&#34920;&#20174;&#38142;&#19978;&#27969;&#21160;&#24615;&#20013;&#21487;&#25552;&#21462;&#30340;&#24635;&#22871;&#21033;&#26426;&#20250;&#12290;&#25105;&#20204;&#20351;&#29992;&#36825;&#31181;&#24418;&#24335;&#21270;&#25512;&#29702;&#26469;&#35777;&#26126;&#65292;&#22312;&#20855;&#26377;&#30830;&#23450;&#24615;&#21306;&#22359;&#26102;&#38388;&#19988;&#20854;&#27969;&#21160;&#24615;&#27744;&#28385;&#36275;&#23454;&#36341;&#20013;&#28385;&#36275;&#30340;&#19968;&#20123;&#33258;&#28982;&#29305;&#24615;&#30340;&#21306;&#22359;&#38142;&#20013;&#65292;&#36825;&#31181;MEV&#22312;&#21306;&#22359;&#25490;&#24207;&#26426;&#21046;&#21644;&#21306;&#22359;&#26102;&#38388;&#20998;&#24067;&#21457;&#29983;&#21464;&#21270;&#26102;&#26159;&#19981;&#21464;&#30340;&#12290;&#25105;&#20204;&#36890;&#36807;&#23558;MEV&#34920;&#24449;&#20026;&#19968;&#31181;&#29305;&#21035;&#31616;&#21333;&#30340;&#22871;&#21033;&#31574;&#30053;&#33719;&#24471;&#30340;&#21033;&#28070;&#65292;&#35777;&#26126;&#20102;&#36825;&#19968;&#32467;&#26524;&#24403;&#26080;&#20154;&#31454;&#20105;&#26102;&#30340;&#32467;&#26524;&#21487;&#20197;&#20026;&#35774;&#35745;&#21306;&#22359;&#38142;&#21327;&#35758;&#25552;&#20379;&#25351;&#23548;&#65292;&#38450;&#27490;&#35774;&#35745;&#20250;&#25913;&#21464;&#25490;&#24207;&#26426;&#21046;&#25110;&#32553;&#30701;&#21306;&#22359;&#26102;&#38388;&#20197;&#22686;&#21152;&#20132;&#26131;&#26426;&#20250;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a formalism for reasoning about trading on decentralized exchanges on blockchains and a formulation of a particular form of maximal extractable value (MEV) that represents the total arbitrage opportunity extractable from on-chain liquidity. We use this formalism to prove that for blockchains with deterministic block times whose liquidity pools satisfy some natural properties that are satisfied by pools in practice, this form of MEV is invariant under changes to the ordering mechanism of the blockchain and distribution of block times. We do this by characterizing the MEV as the profit of a particularly simple arbitrage strategy when left uncontested. These results can inform design of blockchain protocols by ruling out designs aiming to increase trading opportunity by changing the ordering mechanism or shortening block times.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#22312;Merton&#38382;&#39064;&#20013;&#22686;&#21152;&#22522;&#20934;&#36319;&#36394;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#25918;&#26494;&#30340;&#36319;&#36394;&#20844;&#24335;&#65292;&#24182;&#37319;&#29992;&#21453;&#23556;&#36741;&#21161;&#29366;&#24577;&#36807;&#31243;&#65292;&#36890;&#36807;&#21452;&#37325;&#36716;&#25442;&#21644;&#27010;&#29575;&#34920;&#31034;&#65292;&#24471;&#21040;&#20102;&#31561;&#25928;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#65292;&#24182;&#19988;&#21487;&#20197;&#26126;&#30830;&#22320;&#35299;&#20915;&#12290;&#36890;&#36807;&#36825;&#31181;&#26041;&#27861;&#65292;&#25105;&#20204;&#21487;&#20197;&#28165;&#26224;&#22320;&#20102;&#35299;&#36164;&#20135;&#30340;&#32452;&#25104;&#21644;&#32489;&#25928;&#12290;</title><link>http://arxiv.org/abs/2304.10802</link><description>&lt;p&gt;
&#19968;&#31181;&#25299;&#23637;&#30340;Merton&#38382;&#39064;&#35299;&#20915;&#20102;&#25918;&#23485;&#22522;&#20934;&#36319;&#36394;&#30340;&#38590;&#39064;
&lt;/p&gt;
&lt;p&gt;
An extended Merton problem with relaxed benchmark tracking. (arXiv:2304.10802v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10802
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;Merton&#38382;&#39064;&#20013;&#22686;&#21152;&#22522;&#20934;&#36319;&#36394;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#25918;&#26494;&#30340;&#36319;&#36394;&#20844;&#24335;&#65292;&#24182;&#37319;&#29992;&#21453;&#23556;&#36741;&#21161;&#29366;&#24577;&#36807;&#31243;&#65292;&#36890;&#36807;&#21452;&#37325;&#36716;&#25442;&#21644;&#27010;&#29575;&#34920;&#31034;&#65292;&#24471;&#21040;&#20102;&#31561;&#25928;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#65292;&#24182;&#19988;&#21487;&#20197;&#26126;&#30830;&#22320;&#35299;&#20915;&#12290;&#36890;&#36807;&#36825;&#31181;&#26041;&#27861;&#65292;&#25105;&#20204;&#21487;&#20197;&#28165;&#26224;&#22320;&#20102;&#35299;&#36164;&#20135;&#30340;&#32452;&#25104;&#21644;&#32489;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;Merton&#30340;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#21644;&#28040;&#36153;&#38382;&#39064;&#65292;&#20854;&#25193;&#23637;&#24418;&#24335;&#21253;&#25324;&#36319;&#36394;&#30001;&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;&#25551;&#36848;&#30340;&#22522;&#20934;&#36807;&#31243;&#12290;&#25105;&#20204;&#32771;&#34385;&#19968;&#31181;&#25918;&#26494;&#30340;&#36319;&#36394;&#20844;&#24335;&#65292;&#21363;&#36164;&#20135;&#36807;&#31243;&#36890;&#36807;&#34394;&#25311;&#36164;&#26412;&#27880;&#20837;&#34920;&#29616;&#20248;&#20110;&#22806;&#37096;&#22522;&#20934;&#12290;&#22522;&#37329;&#32463;&#29702;&#26088;&#22312;&#26368;&#22823;&#21270;&#28040;&#36153;&#30340;&#39044;&#26399;&#25928;&#29992;&#65292;&#20943;&#21435;&#36164;&#26412;&#27880;&#20837;&#25104;&#26412;&#65292;&#21518;&#32773;&#20063;&#21487;&#20197;&#35270;&#20026;&#30456;&#23545;&#20110;&#22522;&#20934;&#30340;&#39044;&#26399;&#26368;&#22823;&#32570;&#21475;&#12290;&#36890;&#36807;&#24341;&#20837;&#19968;&#20010;&#20855;&#26377;&#21453;&#23556;&#30340;&#36741;&#21161;&#29366;&#24577;&#36807;&#31243;&#65292;&#25105;&#20204;&#36890;&#36807;&#21452;&#37325;&#36716;&#25442;&#21644;&#27010;&#29575;&#34920;&#31034;&#21046;&#23450;&#21644;&#35299;&#20915;&#20102;&#31561;&#25928;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#65292;&#20854;&#20013;&#23545;&#20598;PDE&#21487;&#20197;&#26126;&#30830;&#22320;&#35299;&#20915;&#12290;&#20973;&#20511;&#38381;&#24335;&#32467;&#26524;&#30340;&#21147;&#37327;&#65292;&#25105;&#20204;&#21487;&#20197;&#23548;&#20986;&#24182;&#39564;&#35777;&#21407;&#22987;&#25511;&#21046;&#38382;&#39064;&#30340;&#21322;&#35299;&#26512;&#24418;&#24335;&#30340;&#21453;&#39304;&#26368;&#20248;&#25511;&#21046;&#65292;&#20174;&#32780;&#20351;&#25105;&#20204;&#33021;&#22815;&#28165;&#26224;&#22320;&#20102;&#35299;&#36164;&#20135;&#30340;&#32452;&#25104;&#21644;&#32489;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies a Merton's optimal portfolio and consumption problem in an extended formulation incorporating the tracking of a benchmark process described by a geometric Brownian motion. We consider a relaxed tracking formulation such that that the wealth process compensated by a fictitious capital injection outperforms the external benchmark at all times. The fund manager aims to maximize the expected utility of consumption deducted by the cost of the capital injection, where the latter term can also be regarded as the expected largest shortfall with reference to the benchmark. By introducing an auxiliary state process with reflection, we formulate and tackle an equivalent stochastic control problem by means of the dual transform and probabilistic representation, where the dual PDE can be solved explicitly. On the strength of the closed-form results, we can derive and verify the feedback optimal control in the semi-analytical form for the primal control problem, allowing us to obs
&lt;/p&gt;</description></item><item><title>&#8220;&#19968;&#20992;&#20999;&#8221;&#30340;&#20844;&#20849;&#24037;&#31243;&#25215;&#21253;&#31574;&#30053;&#24182;&#19981;&#33021;&#21462;&#24471;&#24456;&#22909;&#30340;&#25928;&#26524;&#65292;&#32780;&#36873;&#25321;&#8220;&#35774;&#35745;&#21644;&#24314;&#36896;&#21512;&#21516;&#8221;&#21017;&#33021;&#22815;&#26174;&#33879;&#25552;&#39640;&#20844;&#20849;&#24037;&#31243;&#25191;&#34892;&#30340;&#32489;&#25928;&#24182;&#38477;&#20302;&#20132;&#26131;&#25104;&#26412;&#65292;&#36825;&#23545;&#25919;&#31574;&#26377;&#24456;&#22823;&#30340;&#21551;&#31034;&#12290;</title><link>http://arxiv.org/abs/2304.10776</link><description>&lt;p&gt;
&#8220;&#19968;&#20992;&#20999;&#8221;&#30340;&#20844;&#20849;&#24037;&#31243;&#25215;&#21253;&#26159;&#22914;&#20309;&#20570;&#21040;&#26356;&#22909;&#30340;&#65311;&#24847;&#22823;&#21033;&#22522;&#30784;&#35774;&#26045;&#20379;&#24212;&#30340;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;
How 'one-size-fits-all' public works contract does it better? An assessment of infrastructure provision in Italy. (arXiv:2304.10776v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10776
&lt;/p&gt;
&lt;p&gt;
&#8220;&#19968;&#20992;&#20999;&#8221;&#30340;&#20844;&#20849;&#24037;&#31243;&#25215;&#21253;&#31574;&#30053;&#24182;&#19981;&#33021;&#21462;&#24471;&#24456;&#22909;&#30340;&#25928;&#26524;&#65292;&#32780;&#36873;&#25321;&#8220;&#35774;&#35745;&#21644;&#24314;&#36896;&#21512;&#21516;&#8221;&#21017;&#33021;&#22815;&#26174;&#33879;&#25552;&#39640;&#20844;&#20849;&#24037;&#31243;&#25191;&#34892;&#30340;&#32489;&#25928;&#24182;&#38477;&#20302;&#20132;&#26131;&#25104;&#26412;&#65292;&#36825;&#23545;&#25919;&#31574;&#26377;&#24456;&#22823;&#30340;&#21551;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20844;&#20849;&#22522;&#30784;&#35774;&#26045;&#37319;&#36141;&#26159;&#20844;&#20849;&#21644;&#31169;&#20154;&#25237;&#36164;&#20197;&#21450;&#32463;&#27982;&#21644;&#31038;&#20250;&#36164;&#26412;&#22686;&#38271;&#30340;&#20808;&#20915;&#26465;&#20214;&#12290;&#28982;&#32780;&#65292;&#25191;&#34892;&#20302;&#25928;&#20005;&#37325;&#38459;&#30861;&#20102;&#22522;&#30784;&#35774;&#26045;&#25552;&#20379;&#21644;&#21033;&#30410;&#20132;&#20184;&#12290;&#20844;&#20849;&#22522;&#30784;&#35774;&#26045;&#37319;&#36141;&#26368;&#25935;&#24863;&#30340;&#38454;&#27573;&#20043;&#19968;&#26159;&#35774;&#35745;&#65292;&#22240;&#20026;&#23427;&#28508;&#22312;&#22320;&#22312;&#25191;&#34892;&#38454;&#27573;&#21019;&#24314;&#37319;&#36141;&#20154;&#21644;&#25215;&#21253;&#21830;&#20043;&#38388;&#30340;&#25112;&#30053;&#20851;&#31995;&#65292;&#24433;&#21709;&#21512;&#21516;&#30340;&#25104;&#26412;&#21644;&#25345;&#32493;&#26102;&#38388;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#21033;&#29992;&#38750;&#21442;&#25968;&#21069;&#27839;&#21644;&#20542;&#21521;&#24615;&#24471;&#20998;&#21305;&#37197;&#30340;&#26368;&#26032;&#21457;&#23637;&#65292;&#25105;&#20204;&#35780;&#20272;&#20102;&#24847;&#22823;&#21033;&#20844;&#20849;&#24037;&#31243;&#25191;&#34892;&#30340;&#34920;&#29616;&#12290;&#20998;&#26512;&#25552;&#20379;&#20102;&#26377;&#21147;&#30340;&#35777;&#25454;&#65292;&#34920;&#26126;&#37319;&#36141;&#20154;&#36873;&#25321;&#35774;&#35745;&#21644;&#24314;&#36896;&#21512;&#21516;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#25191;&#34892;&#32489;&#25928;&#65292;&#20174;&#32780;&#38477;&#20302;&#20132;&#26131;&#25104;&#26412;&#65292;&#20351;&#25215;&#21253;&#21830;&#21487;&#20197;&#26356;&#22909;&#22320;&#36866;&#24212;&#39033;&#30446;&#30340;&#25191;&#34892;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#20855;&#26377;&#30456;&#24403;&#22823;&#30340;&#25919;&#31574;&#21547;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
Public infrastructure procurement is crucial as a prerequisite for public and private investments and for economic and social capital growth. However, low performance in execution severely hinders infrastructure provision and benefits delivery. One of the most sensitive phases in public infrastructure procurement is the design because of the strategic relationship that it potentially creates between procurers and contractors in the execution stage, affecting the costs and the duration of the contract. In this paper, using recent developments in non-parametric frontiers and propensity score matching, we evaluate the performance in the execution of public works in Italy. The analysis provides robust evidence of significant improvement of performance where procurers opt for a design and build contracts, which lead to lower transaction costs, allowing contractors to better accommodate the project in the execution. Our findings bear considerable policy implications.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#22810;&#27169;&#24577;&#30340;&#28145;&#24230;&#23398;&#20064;&#34701;&#21512;&#25216;&#26415;&#22312;&#20449;&#29992;&#35780;&#32423;&#39044;&#27979;&#20013;&#30340;&#24212;&#29992;&#65292;&#36890;&#36807;&#27604;&#36739;&#19981;&#21516;&#34701;&#21512;&#31574;&#30053;&#21644;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#30340;&#32452;&#21512;&#65292;&#35777;&#26126;&#20102;&#19968;&#20010;&#22522;&#20110;CNN&#30340;&#22810;&#27169;&#24577;&#27169;&#22411;&#36890;&#36807;&#20004;&#31181;&#34701;&#21512;&#31574;&#30053;&#20248;&#20110;&#20854;&#20182;&#22810;&#27169;&#24577;&#25216;&#26415;&#65292;&#21516;&#26102;&#22312;&#27604;&#36739;&#31616;&#21333;&#21644;&#22797;&#26434;&#30340;&#27169;&#22411;&#20013;&#21457;&#29616;&#65292;&#26356;&#22797;&#26434;&#30340;&#27169;&#22411;&#24182;&#19981;&#19968;&#23450;&#34920;&#29616;&#26356;&#22909;&#12290;</title><link>http://arxiv.org/abs/2304.10740</link><description>&lt;p&gt;
&#22522;&#20110;&#22810;&#27169;&#24577;&#28145;&#24230;&#23398;&#20064;&#30340;&#20449;&#29992;&#35780;&#32423;&#39044;&#27979;&#26041;&#27861;&#30740;&#31350;&#8212;&#8212;&#20197;&#25991;&#26412;&#21644;&#25968;&#23383;&#25968;&#25454;&#27969;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
Multi-Modal Deep Learning for Credit Rating Prediction Using Text and Numerical Data Streams. (arXiv:2304.10740v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10740
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#22810;&#27169;&#24577;&#30340;&#28145;&#24230;&#23398;&#20064;&#34701;&#21512;&#25216;&#26415;&#22312;&#20449;&#29992;&#35780;&#32423;&#39044;&#27979;&#20013;&#30340;&#24212;&#29992;&#65292;&#36890;&#36807;&#27604;&#36739;&#19981;&#21516;&#34701;&#21512;&#31574;&#30053;&#21644;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#30340;&#32452;&#21512;&#65292;&#35777;&#26126;&#20102;&#19968;&#20010;&#22522;&#20110;CNN&#30340;&#22810;&#27169;&#24577;&#27169;&#22411;&#36890;&#36807;&#20004;&#31181;&#34701;&#21512;&#31574;&#30053;&#20248;&#20110;&#20854;&#20182;&#22810;&#27169;&#24577;&#25216;&#26415;&#65292;&#21516;&#26102;&#22312;&#27604;&#36739;&#31616;&#21333;&#21644;&#22797;&#26434;&#30340;&#27169;&#22411;&#20013;&#21457;&#29616;&#65292;&#26356;&#22797;&#26434;&#30340;&#27169;&#22411;&#24182;&#19981;&#19968;&#23450;&#34920;&#29616;&#26356;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20102;&#35299;&#20449;&#29992;&#35780;&#32423;&#20998;&#37197;&#20013;&#21738;&#20123;&#22240;&#32032;&#26159;&#37325;&#35201;&#30340;&#21487;&#20197;&#24110;&#21161;&#20570;&#20986;&#26356;&#22909;&#30340;&#20915;&#31574;&#12290;&#28982;&#32780;&#65292;&#30446;&#21069;&#25991;&#29486;&#30340;&#37325;&#28857;&#22823;&#22810;&#38598;&#20013;&#22312;&#32467;&#26500;&#21270;&#25968;&#25454;&#19978;&#65292;&#36739;&#23569;&#30740;&#31350;&#38750;&#32467;&#26500;&#21270;&#25110;&#22810;&#27169;&#24577;&#25968;&#25454;&#38598;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20998;&#26512;&#32467;&#26500;&#21270;&#21644;&#38750;&#32467;&#26500;&#21270;&#19981;&#21516;&#31867;&#22411;&#25968;&#25454;&#38598;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#34701;&#21512;&#30340;&#26377;&#25928;&#26550;&#26500;&#65292;&#20197;&#39044;&#27979;&#20844;&#21496;&#20449;&#29992;&#35780;&#32423;&#26631;&#20934;&#12290;&#22312;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#27979;&#35797;&#20102;&#19981;&#21516;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#21450;&#34701;&#21512;&#31574;&#30053;&#30340;&#32452;&#21512;&#65292;&#21253;&#25324;CNN&#65292;LSTM&#65292;GRU&#21644;BERT&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#25968;&#25454;&#34701;&#21512;&#31574;&#30053;&#65288;&#21253;&#25324;&#26089;&#26399;&#21644;&#20013;&#38388;&#34701;&#21512;&#65289;&#20197;&#21450;&#25216;&#26415;&#65288;&#21253;&#25324;&#20018;&#32852;&#21644;&#20132;&#21449;&#27880;&#24847;&#65289;&#31561;&#26041;&#38754;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#19968;&#20010;&#22522;&#20110;CNN&#30340;&#22810;&#27169;&#24577;&#27169;&#22411;&#36890;&#36807;&#20004;&#31181;&#34701;&#21512;&#31574;&#30053;&#20248;&#20110;&#20854;&#20182;&#22810;&#27169;&#24577;&#25216;&#26415;&#12290;&#27492;&#22806;&#65292;&#36890;&#36807;&#27604;&#36739;&#31616;&#21333;&#30340;&#26550;&#26500;&#19982;&#26356;&#22797;&#26434;&#30340;&#26550;&#26500;&#65292;&#25105;&#20204;&#21457;&#29616;&#65292;&#26356;&#22797;&#26434;&#30340;&#27169;&#22411;&#24182;&#19981;&#19968;&#23450;&#33021;&#22312;&#20449;&#29992;&#35780;&#32423;&#39044;&#27979;&#20013;&#21457;&#25381;&#26356;&#22909;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Knowing which factors are significant in credit rating assignment leads to better decision-making. However, the focus of the literature thus far has been mostly on structured data, and fewer studies have addressed unstructured or multi-modal datasets. In this paper, we present an analysis of the most effective architectures for the fusion of deep learning models for the prediction of company credit rating classes, by using structured and unstructured datasets of different types. In these models, we tested different combinations of fusion strategies with different deep learning models, including CNN, LSTM, GRU, and BERT. We studied data fusion strategies in terms of level (including early and intermediate fusion) and techniques (including concatenation and cross-attention). Our results show that a CNN-based multi-modal model with two fusion strategies outperformed other multi-modal techniques. In addition, by comparing simple architectures with more complex ones, we found that more soph
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#33655;&#20848;&#20013;&#23398;&#38454;&#27573;&#20998;&#29677;&#20915;&#31574;&#30340;&#36136;&#37327;&#65292;&#21457;&#29616;&#25945;&#24072;&#30340;&#21021;&#22987;&#20998;&#29677;&#20915;&#31574;&#23545;&#20110;&#22823;&#22810;&#25968;&#23398;&#29983;&#26469;&#35828;&#22826;&#20302;&#20102;&#12290;</title><link>http://arxiv.org/abs/2304.10636</link><description>&lt;p&gt;
&#25945;&#24072;&#20316;&#20986;&#23398;&#26657;&#20998;&#29677;&#20915;&#31574;&#30340;&#36136;&#37327;&#30740;&#31350;&#8212;&#8212;&#20197;&#33655;&#20848;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
The quality of school track assignment decisions by teachers. (arXiv:2304.10636v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10636
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#33655;&#20848;&#20013;&#23398;&#38454;&#27573;&#20998;&#29677;&#20915;&#31574;&#30340;&#36136;&#37327;&#65292;&#21457;&#29616;&#25945;&#24072;&#30340;&#21021;&#22987;&#20998;&#29677;&#20915;&#31574;&#23545;&#20110;&#22823;&#22810;&#25968;&#23398;&#29983;&#26469;&#35828;&#22826;&#20302;&#20102;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#30740;&#31350;&#20102;&#33655;&#20848;&#20013;&#23398;&#38454;&#27573;&#20998;&#29677;&#20915;&#31574;&#30340;&#36136;&#37327;&#12290;&#22312;&#23567;&#23398;&#20845;&#24180;&#32423;&#65292;&#23567;&#23398;&#25945;&#24072;&#23558;&#27599;&#20010;&#23398;&#29983;&#20998;&#37197;&#21040;&#20013;&#23398;&#38454;&#27573;&#30340;&#19968;&#20010;&#23398;&#20064;&#36712;&#36857;&#19978;&#12290;&#22914;&#26524;&#23398;&#29983;&#22312;&#23567;&#23398;&#25945;&#32946;&#30340;&#26631;&#20934;&#21270;&#32467;&#26463;&#27979;&#35797;&#20013;&#30340;&#24471;&#20998;&#39640;&#20110;&#29305;&#23450;&#30340;&#36712;&#36857;&#20998;&#25968;&#32447;&#65292;&#25945;&#24072;&#21487;&#20197;&#21521;&#19978;&#20462;&#25913;&#36825;&#20010;&#20998;&#37197;&#20915;&#31574;&#12290;&#36890;&#36807;&#27604;&#36739;&#36825;&#20123;&#20998;&#25968;&#32447;&#20004;&#20391;&#30340;&#23398;&#29983;&#65292;&#21457;&#29616;&#22312;&#22235;&#24180;&#21518;&#65292;&#26377;50-90&#65285;&#30340;&#23398;&#29983;&#8220;&#34987;&#22256;&#22312;&#36712;&#36857;&#20013;&#8221;&#65292;&#24847;&#21619;&#30528;&#20182;&#20204;&#21482;&#26377;&#22312;&#31532;&#19968;&#24180;&#23601;&#24320;&#22987;&#22312;&#39640;&#36712;&#36857;&#19978;&#30340;&#24773;&#20917;&#19979;&#65292;&#25165;&#33021;&#22312;&#22235;&#24180;&#21518;&#22312;&#39640;&#36712;&#36857;&#19978;&#12290;&#20854;&#20182;&#65288;&#23569;&#25968;&#65289;&#23398;&#29983;&#21017;&#8220;&#22987;&#32456;&#22788;&#20110;&#20302;&#27700;&#24179;&#8221;&#65292;&#26080;&#35770;&#20182;&#20204;&#26368;&#21021;&#20301;&#20110;&#21738;&#20010;&#27700;&#24179;&#65292;&#22235;&#24180;&#21518;&#37117;&#20250;&#19968;&#30452;&#22312;&#20302;&#27700;&#24179;&#19978;&#12290;&#36825;&#20123;&#27604;&#20363;&#36866;&#29992;&#20110;&#22312;&#31532;&#19968;&#24180;&#36890;&#36807;&#24471;&#20998;&#36229;&#36807;&#20998;&#25968;&#32447;&#32780;&#20174;&#20302;&#36712;&#36857;&#36716;&#21040;&#39640;&#36712;&#36857;&#30340;&#25509;&#36817;&#20998;&#25968;&#32447;&#30340;&#23398;&#29983;&#12290;&#22240;&#27492;&#65292;&#23545;&#20110;&#22823;&#22810;&#25968;&#36825;&#20123;&#23398;&#29983;&#26469;&#35828;&#65292;&#26368;&#21021;&#65288;&#26410;&#20462;&#25913;&#30340;&#65289;&#20998;&#29677;&#20915;&#31574;&#22826;&#20302;&#20102;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#25945;&#24072;&#20316;&#20986;&#30340;&#20998;&#29677;&#20915;&#31574;&#36136;&#37327;&#20540;&#24471;&#20851;&#27880;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the quality of secondary school track assignment decisions in the Netherlands, using a regression discontinuity design. In 6th grade, primary school teachers assign each student to a secondary school track. If a student scores above a track-specific cutoff on the standardized end-of-primary education test, the teacher can upwardly revise this assignment. By comparing students just left and right of these cutoffs, we find that between 50-90% of the students are "trapped in track": these students are on the high track after four years, only if they started on the high track in first year. The remaining (minority of) students are "always low": they are always on the low track after four years, independently of where they started. These proportions hold for students near the cutoffs that shift from the low to the high track in first year by scoring above the cutoff. Hence, for a majority of these students the initial (unrevised) track assignment decision is too low. The results re
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026; C-qGAN &#30340;&#26694;&#26550;&#65292;&#21033;&#29992;&#37327;&#23376;&#30005;&#36335;&#32467;&#26500;&#23454;&#29616;&#20102;&#26377;&#25928;&#30340;&#29366;&#24577;&#20934;&#22791;&#36807;&#31243;&#65292;&#21487;&#20197;&#21033;&#29992;&#35813;&#26041;&#27861;&#21152;&#36895;&#33945;&#29305;&#21345;&#32599;&#20998;&#26512;&#31561;&#31639;&#27861;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#20122;&#24335;&#26399;&#26435;&#34893;&#29983;&#21697;&#23450;&#20215;&#30340;&#20219;&#21153;&#20013;&#12290;</title><link>http://arxiv.org/abs/2304.10382</link><description>&lt;p&gt;
&#23398;&#20064;&#38543;&#26426;&#36807;&#31243;&#30340;&#26377;&#26465;&#20214;&#29983;&#25104;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Conditional Generative Models for Learning Stochastic Processes. (arXiv:2304.10382v1 [quant-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10382
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026; C-qGAN &#30340;&#26694;&#26550;&#65292;&#21033;&#29992;&#37327;&#23376;&#30005;&#36335;&#32467;&#26500;&#23454;&#29616;&#20102;&#26377;&#25928;&#30340;&#29366;&#24577;&#20934;&#22791;&#36807;&#31243;&#65292;&#21487;&#20197;&#21033;&#29992;&#35813;&#26041;&#27861;&#21152;&#36895;&#33945;&#29305;&#21345;&#32599;&#20998;&#26512;&#31561;&#31639;&#27861;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#20122;&#24335;&#26399;&#26435;&#34893;&#29983;&#21697;&#23450;&#20215;&#30340;&#20219;&#21153;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#23398;&#20064;&#22810;&#27169;&#24577;&#20998;&#24067;&#30340;&#26694;&#26550;&#65292;&#31216;&#20026;&#26465;&#20214;&#37327;&#23376;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65288;C-qGAN&#65289;&#12290;&#31070;&#32463;&#32593;&#32476;&#32467;&#26500;&#20005;&#26684;&#37319;&#29992;&#37327;&#23376;&#30005;&#36335;&#65292;&#22240;&#27492;&#34987;&#35777;&#26126;&#33021;&#22815;&#27604;&#24403;&#21069;&#30340;&#26041;&#27861;&#26356;&#26377;&#25928;&#22320;&#34920;&#31034;&#29366;&#24577;&#20934;&#22791;&#36807;&#31243;&#12290;&#36825;&#31181;&#26041;&#27861;&#26377;&#28508;&#21147;&#21152;&#36895;&#33945;&#29305;&#21345;&#32599;&#20998;&#26512;&#31561;&#31639;&#27861;&#12290;&#29305;&#21035;&#22320;&#65292;&#22312;&#23637;&#31034;&#20102;&#32593;&#32476;&#22312;&#23398;&#20064;&#20219;&#21153;&#20013;&#30340;&#26377;&#25928;&#24615;&#21518;&#65292;&#23558;&#35813;&#25216;&#26415;&#24212;&#29992;&#20110;&#23450;&#20215;&#20122;&#24335;&#26399;&#26435;&#34893;&#29983;&#21697;&#65292;&#20026;&#26410;&#26469;&#30740;&#31350;&#20854;&#20182;&#36335;&#24452;&#30456;&#20851;&#26399;&#26435;&#25171;&#19979;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;
A framework to learn a multi-modal distribution is proposed, denoted as the Conditional Quantum Generative Adversarial Network (C-qGAN). The neural network structure is strictly within a quantum circuit and, as a consequence, is shown to represents a more efficient state preparation procedure than current methods. This methodology has the potential to speed-up algorithms, such as Monte Carlo analysis. In particular, after demonstrating the effectiveness of the network in the learning task, the technique is applied to price Asian option derivatives, providing the foundation for further research on other path-dependent options.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#20998;&#26512;&#26202;&#24180;&#23436;&#25104;&#23398;&#20301;&#19982;&#32463;&#27982;&#22238;&#25253;&#20043;&#38388;&#30340;&#22240;&#26524;&#25928;&#24212;&#65292;&#21457;&#29616;&#33719;&#24471;&#26032;&#36164;&#26684;&#23558;&#24102;&#26469;&#27599;&#24180;&#36229;&#36807;3000&#28595;&#20803;&#30340;&#32463;&#27982;&#22238;&#25253;&#12290;</title><link>http://arxiv.org/abs/2304.01490</link><description>&lt;p&gt;
&#21518;&#26399;&#33719;&#24471;&#26032;&#36164;&#26684;&#30340;&#32463;&#27982;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
The Economic Effect of Gaining a New Qualification Later in Life. (arXiv:2304.01490v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.01490
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#20998;&#26512;&#26202;&#24180;&#23436;&#25104;&#23398;&#20301;&#19982;&#32463;&#27982;&#22238;&#25253;&#20043;&#38388;&#30340;&#22240;&#26524;&#25928;&#24212;&#65292;&#21457;&#29616;&#33719;&#24471;&#26032;&#36164;&#26684;&#23558;&#24102;&#26469;&#27599;&#24180;&#36229;&#36807;3000&#28595;&#20803;&#30340;&#32463;&#27982;&#22238;&#25253;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;OECD&#22269;&#23478;&#20013;&#65292;&#36861;&#27714;&#26202;&#24180;&#25945;&#32946;&#36164;&#26684;&#26159;&#19968;&#20010;&#36234;&#26469;&#36234;&#26222;&#36941;&#30340;&#29616;&#35937;&#65292;&#22240;&#20026;&#25216;&#26415;&#21464;&#38761;&#21644;&#33258;&#21160;&#21270;&#32487;&#32493;&#25512;&#21160;&#35768;&#22810;&#32844;&#19994;&#25152;&#38656;&#30340;&#25216;&#33021;&#30340;&#28436;&#21464;&#12290;&#26412;&#25991;&#30528;&#37325;&#32771;&#34385;&#26202;&#24180;&#23436;&#25104;&#23398;&#20301;&#23545;&#32463;&#27982;&#22238;&#25253;&#30340;&#22240;&#26524;&#24433;&#21709;&#65292;&#20854;&#20013;&#33719;&#21462;&#39069;&#22806;&#25945;&#32946;&#30340;&#21160;&#26426;&#21644;&#33021;&#21147;&#21487;&#33021;&#19982;&#26089;&#24180;&#25945;&#32946;&#19981;&#21516;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#19982;&#37027;&#20123;&#27809;&#26377;&#23436;&#25104;&#39069;&#22806;&#23398;&#20064;&#30340;&#20154;&#30456;&#27604;&#65292;&#23436;&#25104;&#39069;&#22806;&#23398;&#20301;&#23558;&#24102;&#26469;&#27599;&#24180;&#36229;&#36807;3000&#28595;&#20803;&#65288;2019&#24180;&#65289;&#30340;&#32463;&#27982;&#22238;&#25253;&#12290;&#23545;&#20110;&#32467;&#26524;&#65292;&#25105;&#20204;&#20351;&#29992;&#12298;&#28595;&#22823;&#21033;&#20122;&#23478;&#24237;&#25910;&#20837;&#21644;&#21171;&#21160;&#21147;&#21160;&#24577;&#35843;&#26597;&#12299;&#30340;&#26497;&#20854;&#20016;&#23500;&#19988;&#20855;&#26377;&#20195;&#34920;&#24615;&#30340;&#32437;&#21521;&#25968;&#25454;&#12290;&#20026;&#20102;&#20805;&#20998;&#21033;&#29992;&#36825;&#20123;&#25968;&#25454;&#30340;&#22797;&#26434;&#24615;&#21644;&#20016;&#23500;&#24615;&#65292;&#25105;&#20204;&#20351;&#29992;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#30340;&#26041;&#27861;&#26469;&#20272;&#31639;&#22240;&#26524;&#25928;&#24212;&#12290;&#25105;&#20204;&#20063;&#33021;&#22815;&#20351;&#29992;ML&#26469;&#21457;&#29616;&#26202;&#24180;&#33719;&#24471;&#26032;&#36164;&#26684;&#23545;&#32463;&#27982;&#22238;&#25253;&#30340;&#24433;&#21709;&#26469;&#28304;&#30340;&#24322;&#36136;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Pursuing educational qualifications later in life is an increasingly common phenomenon within OECD countries since technological change and automation continues to drive the evolution of skills needed in many professions. We focus on the causal impacts to economic returns of degrees completed later in life, where motivations and capabilities to acquire additional education may be distinct from education in early years. We find that completing and additional degree leads to more than \$3000 (AUD, 2019) per year compared to those who do not complete additional study. For outcomes, treatment and controls we use the extremely rich and nationally representative longitudinal data from the Household Income and Labour Dynamics Australia survey is used for this work. To take full advantage of the complexity and richness of this data we use a Machine Learning (ML) based methodology to estimate the causal effect. We are also able to use ML to discover sources of heterogeneity in the effects of ga
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20102;&#19968;&#31181;&#20840;&#21442;&#25968;&#21270;&#30340;&#26412;&#22320;&#27874;&#21160;&#29575;&#27169;&#22411;&#65292;&#21487;&#39640;&#25928;&#20934;&#30830;&#22320;&#26657;&#20934;&#21040;&#22806;&#27719;&#24066;&#22330;&#30340;&#20559;&#26012;&#27874;&#21160;&#29575;&#65292;&#25552;&#20379;&#21487;&#38752;&#30340;&#24322;&#22411;&#26399;&#26435;&#20215;&#26684;&#12290;</title><link>http://arxiv.org/abs/2211.14431</link><description>&lt;p&gt;
&#39640;&#25928;&#20934;&#30830;&#30340;&#20840;&#21442;&#25968;&#26412;&#22320;&#27874;&#21160;&#29575;&#27169;&#22411;&#23545;&#22806;&#27719;&#24066;&#22330;&#20559;&#26012;&#29575;&#30340;&#26657;&#20934;
&lt;/p&gt;
&lt;p&gt;
Efficient and Accurate Calibration to FX Market Skew with Fully Parameterized Local Volatility Model. (arXiv:2211.14431v2 [q-fin.PR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.14431
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#19968;&#31181;&#20840;&#21442;&#25968;&#21270;&#30340;&#26412;&#22320;&#27874;&#21160;&#29575;&#27169;&#22411;&#65292;&#21487;&#39640;&#25928;&#20934;&#30830;&#22320;&#26657;&#20934;&#21040;&#22806;&#27719;&#24066;&#22330;&#30340;&#20559;&#26012;&#27874;&#21160;&#29575;&#65292;&#25552;&#20379;&#21487;&#38752;&#30340;&#24322;&#22411;&#26399;&#26435;&#20215;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22806;&#27719;&#34893;&#29983;&#21697;&#24066;&#22330;&#19978;&#20132;&#26131;&#32654;&#24335;&#21644;&#20122;&#24335;&#26399;&#26435;&#26102;&#65292;&#38134;&#34892;&#24517;&#39035;&#20351;&#29992;&#22797;&#26434;&#30340;&#25968;&#23398;&#27169;&#22411;&#26469;&#35745;&#31639;&#20215;&#26684;&#12290;&#24120;&#24120;&#35266;&#23519;&#21040;&#19981;&#21516;&#30340;&#27169;&#22411;&#23545;&#20110;&#21516;&#19968;&#20010;&#24322;&#22411;&#26399;&#26435;&#20250;&#20135;&#29983;&#19981;&#21516;&#30340;&#20215;&#26684;&#65292;&#36825;&#36829;&#21453;&#20102;&#34893;&#29983;&#21697;&#39118;&#38505;&#31649;&#29702;&#30340;&#26080;&#22871;&#21033;&#35201;&#27714;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#31181;&#20840;&#21442;&#25968;&#21270;&#26412;&#22320;&#27874;&#21160;&#29575;&#27169;&#22411;&#65292;&#29992;&#20110;&#23450;&#20215;&#32654;&#24335;/&#20122;&#24335;&#26399;&#26435;&#12290;&#24403;&#37319;&#29992;&#32593;&#26684;&#25110;&#33945;&#29305;&#21345;&#32599;&#25968;&#20540;&#26041;&#27861;&#23454;&#29616;&#35813;&#27169;&#22411;&#30340;&#26102;&#20505;&#65292;&#21487;&#20197;&#39640;&#25928;&#19988;&#20934;&#30830;&#22320;&#26657;&#20934;&#21040;&#22806;&#27719;&#24066;&#22330;&#30340;&#20559;&#26012;&#27874;&#21160;&#29575;&#12290;&#22240;&#27492;&#65292;&#22312;&#26085;&#24120;&#20132;&#26131;&#27963;&#21160;&#20013;&#65292;&#35813;&#27169;&#22411;&#21487;&#20197;&#25552;&#20379;&#21487;&#38752;&#30340;&#24322;&#22411;&#26399;&#26435;&#20215;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;
When trading American and Asian options in the FX derivatives market, banks must calculate prices using a complex mathematical model. It is often observed that different models produce varying prices for the same exotic option, which violates the non-arbitrage requirement of derivative risk management. To address this issue, we have studied a fully parameterized local volatility model for pricing American/Asian options. This model, when implemented using a grid or Monte-Carlo numerical method, can be efficiently and accurately calibrated to FX market skew volatilities. As a result, the model can provide reliable prices for exotic options during daily trading activities.
&lt;/p&gt;</description></item><item><title>&#35770;&#25991;&#30740;&#31350;&#32467;&#21512;&#36152;&#26131;&#25968;&#25454;&#12289;&#19987;&#21033;&#30003;&#35831;&#21644;&#30740;&#31350;&#20986;&#29256;&#29289;&#30340;&#25968;&#25454;&#65292;&#24314;&#31435;&#20102;&#33021;&#22815;&#35299;&#37322;&#22269;&#38469;&#21253;&#23481;&#24615;&#32511;&#33394;&#22686;&#38271;&#24046;&#24322;&#30340;&#32463;&#27982;&#22797;&#26434;&#24230;&#27169;&#22411;&#65292;&#24182;&#21457;&#29616;&#39640;&#32508;&#21512;&#35780;&#20998;&#22269;&#23478;&#26356;&#23481;&#26131;&#23454;&#29616;&#20302;&#25490;&#25918;&#24378;&#24230;&#30340;&#32511;&#33394;&#22686;&#38271;&#12290;</title><link>http://arxiv.org/abs/2209.08382</link><description>&lt;p&gt;
&#22810;&#32500;&#32463;&#27982;&#22797;&#26434;&#24230;&#19982;&#21253;&#23481;&#24615;&#32511;&#33394;&#22686;&#38271;
&lt;/p&gt;
&lt;p&gt;
Multidimensional Economic Complexity and Inclusive Green Growth. (arXiv:2209.08382v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.08382
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#30740;&#31350;&#32467;&#21512;&#36152;&#26131;&#25968;&#25454;&#12289;&#19987;&#21033;&#30003;&#35831;&#21644;&#30740;&#31350;&#20986;&#29256;&#29289;&#30340;&#25968;&#25454;&#65292;&#24314;&#31435;&#20102;&#33021;&#22815;&#35299;&#37322;&#22269;&#38469;&#21253;&#23481;&#24615;&#32511;&#33394;&#22686;&#38271;&#24046;&#24322;&#30340;&#32463;&#27982;&#22797;&#26434;&#24230;&#27169;&#22411;&#65292;&#24182;&#21457;&#29616;&#39640;&#32508;&#21512;&#35780;&#20998;&#22269;&#23478;&#26356;&#23481;&#26131;&#23454;&#29616;&#20302;&#25490;&#25918;&#24378;&#24230;&#30340;&#32511;&#33394;&#22686;&#38271;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35201;&#23454;&#29616;&#21253;&#23481;&#24615;&#30340;&#32511;&#33394;&#22686;&#38271;&#65292;&#22269;&#23478;&#38656;&#35201;&#32771;&#34385;&#22810;&#31181;&#32463;&#27982;&#12289;&#31038;&#20250;&#21644;&#29615;&#22659;&#22240;&#32032;&#12290;&#36825;&#20123;&#22240;&#32032;&#36890;&#24120;&#30001;&#20174;&#36152;&#26131;&#22320;&#29702;&#20013;&#23548;&#20986;&#30340;&#32463;&#27982;&#22797;&#26434;&#24230;&#30340;&#24230;&#37327;&#25152;&#25429;&#25417;&#65292;&#22240;&#27492;&#32570;&#23569;&#21019;&#26032;&#27963;&#21160;&#30340;&#20851;&#38190;&#20449;&#24687;&#12290;&#20026;&#22635;&#34917;&#36825;&#19968;&#24046;&#36317;&#65292;&#25105;&#20204;&#23558;&#36152;&#26131;&#25968;&#25454;&#19982;&#19987;&#21033;&#30003;&#35831;&#21644;&#30740;&#31350;&#20986;&#29256;&#29289;&#30340;&#25968;&#25454;&#30456;&#32467;&#21512;&#65292;&#24314;&#31435;&#27169;&#22411;&#65292;&#26174;&#33879;&#19988;&#31283;&#20581;&#22320;&#25913;&#21892;&#20102;&#32463;&#27982;&#22797;&#26434;&#24230;&#24230;&#37327;&#35299;&#37322;&#22269;&#38469;&#21253;&#23481;&#24615;&#32511;&#33394;&#22686;&#38271;&#24046;&#24322;&#30340;&#33021;&#21147;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22522;&#20110;&#36152;&#26131;&#21644;&#19987;&#21033;&#25968;&#25454;&#24314;&#31435;&#30340;&#22797;&#26434;&#24230;&#24230;&#37327;&#32467;&#21512;&#22312;&#19968;&#36215;&#33021;&#22815;&#35299;&#37322;&#26410;&#26469;&#30340;&#32463;&#27982;&#22686;&#38271;&#21644;&#25910;&#20837;&#19981;&#24179;&#31561;&#24615;&#65292;&#24182;&#19988;&#22312;&#25152;&#26377;&#19977;&#20010;&#25351;&#26631;&#24471;&#20998;&#39640;&#30340;&#22269;&#23478;&#24448;&#24448;&#34920;&#29616;&#20986;&#26356;&#20302;&#30340;&#25490;&#25918;&#24378;&#24230;&#12290;&#36825;&#20123;&#21457;&#29616;&#35828;&#26126;&#20102;&#36152;&#26131;&#12289;&#25216;&#26415;&#21644;&#30740;&#31350;&#30340;&#22320;&#29702;&#20301;&#32622;&#22914;&#20309;&#32467;&#21512;&#36215;&#26469;&#35299;&#37322;&#21253;&#23481;&#24615;&#32511;&#33394;&#22686;&#38271;&#12290;
&lt;/p&gt;
&lt;p&gt;
To achieve inclusive green growth, countries need to consider a multiplicity of economic, social, and environmental factors. These are often captured by metrics of economic complexity derived from the geography of trade, thus missing key information on innovative activities. To bridge this gap, we combine trade data with data on patent applications and research publications to build models that significantly and robustly improve the ability of economic complexity metrics to explain international variations in inclusive green growth. We show that measures of complexity built on trade and patent data combine to explain future economic growth and income inequality and that countries that score high in all three metrics tend to exhibit lower emission intensities. These findings illustrate how the geography of trade, technology, and research combine to explain inclusive green growth.
&lt;/p&gt;</description></item></channel></rss>