<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#30740;&#31350;&#21457;&#29616;&#29983;&#25104;&#24335; AI &#24037;&#20855; ChatGPT &#21487;&#20197;&#26356;&#26377;&#25928;&#22320;&#23637;&#31034;&#32929;&#31080;&#24066;&#22330;&#30456;&#20851;&#20449;&#24687;&#65292;&#25552;&#20986;&#20102;&#20449;&#24687;&#33192;&#32960;&#25351;&#26631;&#24182;&#35777;&#26126;&#20854;&#19982;&#36127;&#38754;&#30340;&#36164;&#26412;&#24066;&#22330;&#21518;&#26524;&#30456;&#20851;&#65292;&#21516;&#26102;&#23637;&#31034;&#20854;&#22312;&#26500;&#24314;&#38024;&#23545;&#24615;&#24635;&#32467;&#26041;&#38754;&#30340;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2306.10224</link><description>&lt;p&gt;
&#33192;&#32960;&#30340;&#25259;&#38706;&#65306;ChatGPT&#26159;&#21542;&#33021;&#24110;&#21161;&#25237;&#36164;&#32773;&#22788;&#29702;&#36130;&#21153;&#20449;&#24687;&#65311;
&lt;/p&gt;
&lt;p&gt;
Bloated Disclosures: Can ChatGPT Help Investors Process Financial Information?. (arXiv:2306.10224v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.10224
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21457;&#29616;&#29983;&#25104;&#24335; AI &#24037;&#20855; ChatGPT &#21487;&#20197;&#26356;&#26377;&#25928;&#22320;&#23637;&#31034;&#32929;&#31080;&#24066;&#22330;&#30456;&#20851;&#20449;&#24687;&#65292;&#25552;&#20986;&#20102;&#20449;&#24687;&#33192;&#32960;&#25351;&#26631;&#24182;&#35777;&#26126;&#20854;&#19982;&#36127;&#38754;&#30340;&#36164;&#26412;&#24066;&#22330;&#21518;&#26524;&#30456;&#20851;&#65292;&#21516;&#26102;&#23637;&#31034;&#20854;&#22312;&#26500;&#24314;&#38024;&#23545;&#24615;&#24635;&#32467;&#26041;&#38754;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#25104;&#24335; AI &#24037;&#20855;&#65288;&#22914; ChatGPT&#65289;&#21487;&#20197;&#20174;&#26681;&#26412;&#19978;&#25913;&#21464;&#25237;&#36164;&#32773;&#22788;&#29702;&#20449;&#24687;&#30340;&#26041;&#24335;&#12290;&#25105;&#20204;&#20351;&#29992;&#32929;&#31080;&#24066;&#22330;&#20316;&#20026;&#23454;&#39564;&#23460;&#65292;&#25506;&#31350;&#36825;&#20123;&#24037;&#20855;&#22312;&#24635;&#32467;&#22797;&#26434;&#30340;&#20844;&#21496;&#25259;&#38706;&#20449;&#24687;&#26102;&#30340;&#32463;&#27982;&#25928;&#29992;&#12290;&#24635;&#32467;&#25688;&#35201;&#26126;&#26174;&#26356;&#30701;&#65292;&#36890;&#24120;&#27604;&#21407;&#22987;&#25991;&#26412;&#32553;&#30701;&#36229;&#36807; 70%&#65292;&#32780;&#20449;&#24687;&#20869;&#23481;&#24471;&#21040;&#22686;&#24378;&#12290;&#24403;&#19968;&#20221;&#25991;&#20214;&#20855;&#26377;&#31215;&#26497;&#65288;&#28040;&#26497;&#65289;&#24773;&#24863;&#26102;&#65292;&#20854;&#24635;&#32467;&#21464;&#24471;&#26356;&#31215;&#26497;&#65288;&#28040;&#26497;&#65289;&#12290;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#24635;&#32467;&#23545;&#35299;&#37322;&#32929;&#24066;&#23545;&#25259;&#38706;&#20449;&#24687;&#30340;&#21453;&#24212;&#26356;&#26377;&#25928;&#12290;&#22522;&#20110;&#36825;&#20123;&#21457;&#29616;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20449;&#24687;&#8220;&#33192;&#32960;&#8221;&#25351;&#26631;&#12290;&#25105;&#20204;&#26174;&#31034;&#65292;&#33192;&#32960;&#30340;&#25259;&#38706;&#19982;&#36127;&#38754;&#30340;&#36164;&#26412;&#24066;&#22330;&#21518;&#26524;&#30456;&#20851;&#65292;&#20363;&#22914;&#26356;&#20302;&#30340;&#20215;&#26684;&#26377;&#25928;&#24615;&#21644;&#26356;&#39640;&#30340;&#20449;&#24687;&#19981;&#23545;&#31216;&#24615;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#20010;&#27169;&#22411;&#22312;&#26500;&#24314;&#38024;&#23545;&#24615;&#24635;&#32467;&#26041;&#38754;&#30340;&#26377;&#25928;&#24615;&#65292;&#20197;&#30830;&#23450;&#20844;&#21496;&#30340;&#65288;&#38750;&#65289;&#36130;&#21153;&#34920;&#29616;&#21644;&#39118;&#38505;&#12290;&#24635;&#20043;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#20687; ChatGPT &#36825;&#26679;&#30340;&#29983;&#25104;&#24335; AI &#24037;&#20855;&#21487;&#20197;&#26377;&#25928;&#22320;&#24110;&#21161;&#25237;&#36164;&#32773;&#26356;&#39640;&#25928;&#22320;&#22788;&#29702;&#36130;&#21153;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;
Generative AI tools such as ChatGPT can fundamentally change the way investors process information. We probe the economic usefulness of these tools in summarizing complex corporate disclosures using the stock market as a laboratory. The unconstrained summaries are dramatically shorter, often by more than 70% compared to the originals, whereas their information content is amplified. When a document has a positive (negative) sentiment, its summary becomes more positive (negative). More importantly, the summaries are more effective at explaining stock market reactions to the disclosed information. Motivated by these findings, we propose a measure of information "bloat." We show that bloated disclosure is associated with adverse capital markets consequences, such as lower price efficiency and higher information asymmetry. Finally, we show that the model is effective at constructing targeted summaries that identify firms' (non-)financial performance and risks. Collectively, our results indi
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#21367;&#31215;&#26680;&#23558;&#38750;&#39532;&#23572;&#31185;&#22827;&#38543;&#26426;&#36807;&#31243;&#36716;&#21270;&#20026;&#39532;&#23572;&#31185;&#22827;&#25193;&#25955;&#36807;&#31243;&#30340;&#26041;&#27861;&#65292;&#24182;&#25552;&#20379;&#20102;&#29992;&#20110;&#27874;&#21160;&#29575;&#24314;&#27169;&#30340;&#37329;&#34701;&#24212;&#29992;&#12290;&#21516;&#26102;&#65292;&#20182;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#25968;&#20540;&#35745;&#31639;&#26041;&#26696;&#65292;&#20854;&#24378;&#25910;&#25947;&#36895;&#29575;&#20026;1/2&#65292;&#19982;&#27874;&#21160;&#29575;&#36807;&#31243;&#30340;&#31895;&#31961;&#24615;&#21442;&#25968;&#26080;&#20851;&#65292;&#30456;&#27604;&#31867;&#20284;&#27169;&#22411;&#20013;&#20351;&#29992;&#30340;Euler&#26041;&#26696;&#65292;&#26159;&#19968;&#20010;&#26174;&#30528;&#30340;&#25913;&#36827;&#12290;</title><link>http://arxiv.org/abs/2306.02708</link><description>&lt;p&gt;
&#20174;&#22823;&#35937;&#21040;&#37329;&#40060;&#65288;&#28982;&#21518;&#22238;&#26469;&#65289;&#65306;&#38543;&#26426;Volterra&#36807;&#31243;&#20013;&#30340;&#35760;&#24518;
&lt;/p&gt;
&lt;p&gt;
From elephant to goldfish (and back): memory in stochastic Volterra processes. (arXiv:2306.02708v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.02708
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#21367;&#31215;&#26680;&#23558;&#38750;&#39532;&#23572;&#31185;&#22827;&#38543;&#26426;&#36807;&#31243;&#36716;&#21270;&#20026;&#39532;&#23572;&#31185;&#22827;&#25193;&#25955;&#36807;&#31243;&#30340;&#26041;&#27861;&#65292;&#24182;&#25552;&#20379;&#20102;&#29992;&#20110;&#27874;&#21160;&#29575;&#24314;&#27169;&#30340;&#37329;&#34701;&#24212;&#29992;&#12290;&#21516;&#26102;&#65292;&#20182;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#25968;&#20540;&#35745;&#31639;&#26041;&#26696;&#65292;&#20854;&#24378;&#25910;&#25947;&#36895;&#29575;&#20026;1/2&#65292;&#19982;&#27874;&#21160;&#29575;&#36807;&#31243;&#30340;&#31895;&#31961;&#24615;&#21442;&#25968;&#26080;&#20851;&#65292;&#30456;&#27604;&#31867;&#20284;&#27169;&#22411;&#20013;&#20351;&#29992;&#30340;Euler&#26041;&#26696;&#65292;&#26159;&#19968;&#20010;&#26174;&#30528;&#30340;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#29702;&#35770;&#26694;&#26550;&#65292;&#21033;&#29992;&#21367;&#31215;&#26680;&#23558;Volterra&#36335;&#24452;&#20381;&#36182;&#65288;&#38750;&#39532;&#23572;&#21487;&#22827;&#65289;&#38543;&#26426;&#36807;&#31243;&#36716;&#21270;&#20026;&#26631;&#20934;&#65288;&#39532;&#23572;&#21487;&#22827;&#65289;&#25193;&#25955;&#36807;&#31243;&#65292;&#23558;&#39532;&#23572;&#21487;&#22827;&#8220;&#20869;&#23384;&#36807;&#31243;&#8221;&#23884;&#20837;&#21040;&#38750;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#30340;&#21160;&#21147;&#23398;&#20013;&#20197;&#36798;&#21040;&#36825;&#19968;&#36716;&#21270;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#24341;&#20837;&#30340;&#38543;&#26426;Volterra&#26041;&#31243;&#30340;&#35299;&#30340;&#23384;&#22312;&#24615;&#21644;&#36335;&#24452;&#27491;&#21017;&#24615;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#29992;&#20110;&#27874;&#21160;&#29575;&#24314;&#27169;&#30340;&#37329;&#34701;&#24212;&#29992;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#20010;&#27169;&#25311;&#36825;&#20123;&#36807;&#31243;&#30340;&#25968;&#20540;&#35745;&#31639;&#26041;&#26696;&#12290;&#35813;&#25968;&#20540;&#35745;&#31639;&#26041;&#26696;&#21576;&#29616;&#20986;1/2&#30340;&#24378;&#25910;&#25947;&#36895;&#29575;&#65292;&#19982;&#27874;&#21160;&#29575;&#36807;&#31243;&#30340;&#31895;&#31961;&#24615;&#21442;&#25968;&#26080;&#20851;&#65292;&#36825;&#19982;&#31867;&#20284;&#27169;&#22411;&#20013;&#20351;&#29992;&#30340;Euler&#26041;&#26696;&#30456;&#27604;&#26159;&#19968;&#20010;&#26174;&#30528;&#30340;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a new theoretical framework that exploits convolution kernels to transform a Volterra path-dependent (non-Markovian) stochastic process into a standard (Markovian) diffusion process. This transformation is achieved by embedding a Markovian "memory process" within the dynamics of the non-Markovian process. We discuss existence and path-wise regularity of solutions for the stochastic Volterra equations introduced and we provide a financial application to volatility modeling. We also propose a numerical scheme for simulating the processes. The numerical scheme exhibits a strong convergence rate of 1/2, which is independent of the roughness parameter of the volatility process. This is a significant improvement compared to Euler schemes used in similar models.
&lt;/p&gt;</description></item></channel></rss>