<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#25552;&#20379;&#20102;&#19968;&#20010;&#23454;&#29992;&#24037;&#20855;&#21253;&#65292;&#29992;&#20110;&#20998;&#26512;&#20107;&#20214;&#30740;&#31350;&#20013;&#30340;&#25928;&#24212;&#24322;&#36136;&#24615;&#65292;&#24378;&#35843;&#20102;&#20010;&#20307;&#32423;&#21035;&#25928;&#24212;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#25581;&#31034;&#20102;&#32447;&#24615;&#27835;&#30103;&#25928;&#24212;&#30340;&#25361;&#25112;&#12290;</title><link>https://arxiv.org/abs/2403.19563</link><description>&lt;p&gt;
&#20107;&#20214;&#30740;&#31350;&#20013;&#20010;&#20307;&#24322;&#36136;&#24615;&#30340;&#28789;&#27963;&#20998;&#26512;&#65306;&#20197;&#23376;&#22899;&#24809;&#32602;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
Flexible Analysis of Individual Heterogeneity in Event Studies: Application to the Child Penalty
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.19563
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20379;&#20102;&#19968;&#20010;&#23454;&#29992;&#24037;&#20855;&#21253;&#65292;&#29992;&#20110;&#20998;&#26512;&#20107;&#20214;&#30740;&#31350;&#20013;&#30340;&#25928;&#24212;&#24322;&#36136;&#24615;&#65292;&#24378;&#35843;&#20102;&#20010;&#20307;&#32423;&#21035;&#25928;&#24212;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#25581;&#31034;&#20102;&#32447;&#24615;&#27835;&#30103;&#25928;&#24212;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#23454;&#29992;&#24037;&#20855;&#21253;&#65292;&#29992;&#20110;&#20998;&#26512;&#20107;&#20214;&#30740;&#31350;&#20013;&#30340;&#25928;&#24212;&#24322;&#36136;&#24615;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#20272;&#35745;&#31639;&#27861;&#65292;&#24182;&#35843;&#25972;&#29616;&#26377;&#30340;&#35745;&#37327;&#32463;&#27982;&#32467;&#26524;&#65292;&#25552;&#20379;&#20854;&#29702;&#35770;&#22522;&#30784;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#24037;&#20855;&#24212;&#29992;&#20110;&#33655;&#20848;&#34892;&#25919;&#25968;&#25454;&#65292;&#20197;&#19977;&#31181;&#26041;&#24335;&#30740;&#31350;&#23376;&#22899;&#24809;&#32602;&#65288;CP&#65289;&#32972;&#26223;&#19979;&#30340;&#20010;&#20307;&#24322;&#36136;&#24615;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35760;&#24405;&#20102;&#20010;&#20307;&#32423;&#21035;CP&#36712;&#36857;&#30340;&#26174;&#33879;&#24322;&#36136;&#24615;&#65292;&#24378;&#35843;&#36229;&#36234;&#24179;&#22343;CP&#30340;&#37325;&#35201;&#24615;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#20351;&#29992;&#20010;&#20307;&#32423;&#21035;&#20272;&#35745;&#26469;&#26816;&#39564;&#25176;&#20799;&#26381;&#21153;&#20379;&#32473;&#25193;&#23637;&#25919;&#31574;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#25581;&#31034;&#20102;&#38750;&#32447;&#24615;&#27835;&#30103;&#25928;&#24212;&#65292;&#25361;&#25112;&#20102;&#21463;&#38480;&#20110;&#36739;&#23569;&#28789;&#27963;&#35268;&#33539;&#30340;&#20256;&#32479;&#25919;&#31574;&#35780;&#20272;&#26041;&#27861;&#12290;&#31532;&#19977;&#65292;&#25105;&#20204;&#20351;&#29992;&#20010;&#20307;&#32423;&#21035;&#20272;&#35745;&#20316;&#20026;&#22238;&#24402;&#21464;&#37327;&#26469;&#30740;&#31350;&#27597;&#22899;&#20043;&#38388;CP&#30340;&#20195;&#38469;&#24377;&#24615;&#12290;&#22312;&#35843;&#25972;&#27979;&#37327;&#35823;&#24046;&#20559;&#24046;&#20043;&#21518;&#65292;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.19563v1 Announce Type: new  Abstract: We provide a practical toolkit for analyzing effect heterogeneity in event studies. We develop an estimation algorithm and adapt existing econometric results to provide its theoretical justification. We apply these tools to Dutch administrative data to study individual heterogeneity in the child-penalty (CP) context in three ways. First, we document significant heterogeneity in the individual-level CP trajectories, emphasizing the importance of going beyond the average CP. Second, we use individual-level estimates to examine the impact of childcare supply expansion policies. Our approach uncovers nonlinear treatment effects, challenging the conventional policy evaluation methods constrained to less flexible specifications. Third, we use the individual-level estimates as a regressor on the right-hand side to study the intergenerational elasticity of the CP between mothers and daughters. After adjusting for the measurement error bias, we f
&lt;/p&gt;</description></item><item><title>&#37327;&#23376;&#28459;&#27493;&#31639;&#27861;&#22312;&#27169;&#25311;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#36164;&#20135;&#20215;&#26684;&#28436;&#21464;&#26041;&#38754;&#23637;&#29616;&#20986;&#20102;&#24040;&#22823;&#30340;&#28789;&#27963;&#24615;&#65292;&#33021;&#22815;&#20811;&#26381;&#32463;&#20856;&#27169;&#22411;&#30340;&#23616;&#38480;&#24615;&#65292;&#20135;&#29983;&#22797;&#26434;&#30340;&#24066;&#22330;&#20542;&#21521;&#65292;&#20197;&#21450;&#26356;&#39640;&#27010;&#29575;&#30340;&#26497;&#31471;&#20107;&#20214;&#12290;</title><link>https://arxiv.org/abs/2403.19502</link><description>&lt;p&gt;
&#20851;&#20110;&#37327;&#23376;&#28459;&#27493;&#29992;&#20110;&#24314;&#27169;&#37329;&#34701;&#22238;&#25253;&#20998;&#24067;&#30340;&#28508;&#21147;
&lt;/p&gt;
&lt;p&gt;
On the potential of quantum walks for modeling financial return distributions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.19502
&lt;/p&gt;
&lt;p&gt;
&#37327;&#23376;&#28459;&#27493;&#31639;&#27861;&#22312;&#27169;&#25311;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#36164;&#20135;&#20215;&#26684;&#28436;&#21464;&#26041;&#38754;&#23637;&#29616;&#20986;&#20102;&#24040;&#22823;&#30340;&#28789;&#27963;&#24615;&#65292;&#33021;&#22815;&#20811;&#26381;&#32463;&#20856;&#27169;&#22411;&#30340;&#23616;&#38480;&#24615;&#65292;&#20135;&#29983;&#22797;&#26434;&#30340;&#24066;&#22330;&#20542;&#21521;&#65292;&#20197;&#21450;&#26356;&#39640;&#27010;&#29575;&#30340;&#26497;&#31471;&#20107;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20934;&#30830;&#24314;&#27169;&#36164;&#20135;&#20215;&#26684;&#30340;&#26102;&#38388;&#28436;&#21464;&#23545;&#20110;&#29702;&#35299;&#37329;&#34701;&#24066;&#22330;&#33267;&#20851;&#37325;&#35201;&#12290;&#25105;&#20204;&#25506;&#35752;&#20102;&#31163;&#25955;&#26102;&#38388;&#37327;&#23376;&#28459;&#27493;&#22312;&#24314;&#27169;&#36164;&#20135;&#20215;&#26684;&#28436;&#21464;&#26041;&#38754;&#30340;&#28508;&#21147;&#12290;&#20174;&#22522;&#20110;&#37327;&#23376;&#28459;&#27493;&#31639;&#27861;&#30340;&#27169;&#22411;&#33719;&#24471;&#30340;&#22238;&#25253;&#20998;&#24067;&#19982;&#20174;&#32463;&#20856;&#26041;&#27861;&#33719;&#24471;&#30340;&#20998;&#24067;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;&#25105;&#20204;&#20851;&#27880;&#32463;&#20856;&#27169;&#22411;&#30340;&#29305;&#23450;&#23616;&#38480;&#24615;&#65292;&#24182;&#19988;&#38416;&#26126;&#37327;&#23376;&#28459;&#27493;&#27169;&#22411;&#20855;&#26377;&#20811;&#26381;&#36825;&#20123;&#23616;&#38480;&#24615;&#30340;&#26497;&#22823;&#28789;&#27963;&#24615;&#12290;&#20854;&#20013;&#21253;&#25324;&#20135;&#29983;&#20855;&#26377;&#22797;&#26434;&#24066;&#22330;&#20542;&#21521;&#30340;&#19981;&#23545;&#31216;&#22238;&#25253;&#20998;&#24067;&#20197;&#21450;&#22312;&#26576;&#20123;&#32463;&#20856;&#27169;&#22411;&#20013;&#27604;&#26497;&#31471;&#20107;&#20214;&#20855;&#26377;&#26356;&#39640;&#27010;&#29575;&#12290;&#27492;&#22806;&#65292;&#37327;&#23376;&#28459;&#27493;&#20013;&#30340;&#26102;&#38388;&#28436;&#21464;&#20855;&#26377;&#25552;&#20379;&#36164;&#20135;&#20215;&#26684;&#21160;&#24577;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.19502v1 Announce Type: new  Abstract: Accurate modeling of the temporal evolution of asset prices is crucial for understanding financial markets. We explore the potential of discrete-time quantum walks to model the evolution of asset prices. Return distributions obtained from a model based on the quantum walk algorithm are compared with those obtained from classical methodologies. We focus on specific limitations of the classical models, and illustrate that the quantum walk model possesses great flexibility in overcoming these. This includes the potential to generate asymmetric return distributions with complex market tendencies and higher probabilities for extreme events than in some of the classical models. Furthermore, the temporal evolution in the quantum walk possesses the potential to provide asset price dynamics.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#21306;&#22359;&#38142;&#20013;&#30340;&#26368;&#22823;&#21487;&#25552;&#21462;&#20215;&#20540;&#65288;MEV&#65289;&#38382;&#39064;&#65292;&#20197;&#21450;&#20197;&#22826;&#22346;&#22914;&#20309;&#24212;&#23545;MEV&#38382;&#39064;&#12290;&#25991;&#31456;&#24378;&#35843;&#20102;&#35774;&#35745;&#32972;&#21253;&#25293;&#21334;&#26469;&#32531;&#35299;MEV&#38382;&#39064;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.19077</link><description>&lt;p&gt;
&#21306;&#22359;&#38142;&#12289;MEV&#21644;&#32972;&#21253;&#38382;&#39064;&#65306;&#20837;&#38376;&#25351;&#21335;
&lt;/p&gt;
&lt;p&gt;
Blockchains, MEV and the knapsack problem: a primer
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.19077
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#21306;&#22359;&#38142;&#20013;&#30340;&#26368;&#22823;&#21487;&#25552;&#21462;&#20215;&#20540;&#65288;MEV&#65289;&#38382;&#39064;&#65292;&#20197;&#21450;&#20197;&#22826;&#22346;&#22914;&#20309;&#24212;&#23545;MEV&#38382;&#39064;&#12290;&#25991;&#31456;&#24378;&#35843;&#20102;&#35774;&#35745;&#32972;&#21253;&#25293;&#21334;&#26469;&#32531;&#35299;MEV&#38382;&#39064;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#28145;&#20837;&#30740;&#31350;&#20102;&#19968;&#20010;&#34987;&#26631;&#35760;&#20026;&#26368;&#22823;&#21487;&#25552;&#21462;&#20215;&#20540;&#65288;MEV&#65289;&#30340;&#38382;&#39064;&#65292;&#36825;&#20010;&#38382;&#39064;&#22312;&#21306;&#22359;&#38142;&#20013;&#20986;&#29616;&#65292;&#22240;&#20026;&#19968;&#20010;&#21306;&#22359;&#29983;&#20135;&#32773;&#21487;&#20197;&#25805;&#32437;&#19968;&#20010;&#21306;&#22359;&#20869;&#20132;&#26131;&#30340;&#39034;&#24207;&#12290;&#20107;&#23454;&#19978;&#65292;&#35832;&#22914;&#20197;&#22826;&#22346;&#31561;&#21306;&#22359;&#38142;&#24050;&#32463;&#33457;&#36153;&#20102;&#22823;&#37327;&#36164;&#28304;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#24182;&#37325;&#26032;&#35774;&#35745;&#20102;&#21306;&#22359;&#29983;&#20135;&#36807;&#31243;&#20197;&#35299;&#20915;MEV&#12290;&#26412;&#25991;&#27010;&#36848;&#20102;MEV&#38382;&#39064;&#65292;&#24182;&#36319;&#36394;&#20102;&#20197;&#22826;&#22346;&#22914;&#20309;&#36866;&#24212;&#20854;&#23384;&#22312;&#12290;&#21306;&#22359;&#26500;&#24314;&#36807;&#31243;&#30340;&#19968;&#20010;&#20851;&#38190;&#26041;&#38754;&#26159;&#23427;&#26159;&#32972;&#21253;&#38382;&#39064;&#30340;&#19968;&#20010;&#21464;&#20307;&#12290;&#22240;&#27492;&#65292;&#26412;&#25991;&#31361;&#20986;&#20102;&#35774;&#35745;&#25293;&#21334;&#26469;&#22635;&#20805;&#32972;&#21253;&#8212;&#8212;&#25110;&#32972;&#21253;&#25293;&#21334;&#8212;&#8212;&#20197;&#32531;&#35299;MEV&#38382;&#39064;&#30340;&#20316;&#29992;&#12290;&#24635;&#30340;&#26469;&#35828;&#65292;&#26412;&#25991;&#23545;&#20027;&#35201;&#38382;&#39064;&#36827;&#34892;&#20102;&#35843;&#26597;&#65292;&#24182;&#20026;&#24076;&#26395;&#36827;&#19968;&#27493;&#25506;&#35752;&#21306;&#22359;&#26500;&#24314;&#21644;MEV&#32463;&#27982;&#23398;&#30340;&#30740;&#31350;&#20154;&#21592;&#21644;&#23398;&#29983;&#25552;&#20379;&#20102;&#26131;&#20110;&#29702;&#35299;&#30340;&#20837;&#38376;&#25351;&#21335;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.19077v1 Announce Type: new  Abstract: In this paper, we take a close look at a problem labeled maximal extractable value (MEV), which arises in a blockchain due to the ability of a block producer to manipulate the order of transactions within a block. Indeed, blockchains such as Ethereum have spent considerable resources addressing this issue and have redesigned the block production process to account for MEV. This paper provides an overview of the MEV problem and tracks how Ethereum has adapted to its presence. A vital aspect of the block building exercise is that it is a variant of the knapsack problem. Consequently, this paper highlights the role of designing auctions to fill a knapsack--or knapsack auctions--in alleviating the MEV problem. Overall, this paper presents a survey of the main issues and an accessible primer for researchers and students wishing to explore the economics of block building and MEV further.
&lt;/p&gt;</description></item><item><title>&#26234;&#33021;&#21512;&#21516;&#30340;&#20852;&#36215;&#25512;&#21160;&#20102;&#26032;&#22411;&#30005;&#23376;&#21512;&#21516;&#30340;&#21457;&#23637;&#65292;&#20026;&#36981;&#23432;&#20256;&#32479;&#21512;&#21516;&#35268;&#21017;&#24182;&#26080;&#38556;&#30861;&#36798;&#25104;&#25552;&#20379;&#20102;&#36879;&#26126;&#21644;&#23433;&#20840;&#30340;&#35760;&#24405;&#20445;&#23384;&#65292;&#23613;&#31649;&#21487;&#20197;&#33258;&#21160;&#25191;&#34892;&#19988;&#20844;&#24320;&#23637;&#31034;&#65292;&#20294;&#20173;&#38656;&#35201;&#20154;&#20026;&#24178;&#39044;&#26469;&#35299;&#20915;&#20105;&#35758;&#12290;</title><link>https://arxiv.org/abs/2403.19051</link><description>&lt;p&gt;
&#26397;&#30528;&#21306;&#22359;&#38142;&#26234;&#33021;&#21512;&#21516;&#26631;&#20934;&#21270;&#27861;&#35268;&#30340;&#26041;&#21521;&#65306;&#26469;&#33258;Delphi&#21644;SWARA&#20998;&#26512;&#30340;&#35265;&#35299;
&lt;/p&gt;
&lt;p&gt;
Towards Standardized Regulations for Block Chain Smart Contracts: Insights from Delphi and SWARA Analysis
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.19051
&lt;/p&gt;
&lt;p&gt;
&#26234;&#33021;&#21512;&#21516;&#30340;&#20852;&#36215;&#25512;&#21160;&#20102;&#26032;&#22411;&#30005;&#23376;&#21512;&#21516;&#30340;&#21457;&#23637;&#65292;&#20026;&#36981;&#23432;&#20256;&#32479;&#21512;&#21516;&#35268;&#21017;&#24182;&#26080;&#38556;&#30861;&#36798;&#25104;&#25552;&#20379;&#20102;&#36879;&#26126;&#21644;&#23433;&#20840;&#30340;&#35760;&#24405;&#20445;&#23384;&#65292;&#23613;&#31649;&#21487;&#20197;&#33258;&#21160;&#25191;&#34892;&#19988;&#20844;&#24320;&#23637;&#31034;&#65292;&#20294;&#20173;&#38656;&#35201;&#20154;&#20026;&#24178;&#39044;&#26469;&#35299;&#20915;&#20105;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#23383;&#36135;&#24065;&#21644;&#20844;&#20849;&#36134;&#26412;&#21306;&#22359;&#38142;&#30340;&#20852;&#36215;&#23548;&#33268;&#20102;&#19968;&#31181;&#26032;&#22411;&#30005;&#23376;&#21512;&#21516;&#30340;&#24320;&#21457;&#65292;&#34987;&#31216;&#20026;&#8220;&#26234;&#33021;&#21512;&#21516;&#8221;&#12290;&#20026;&#20102;&#20351;&#36825;&#20123;&#21512;&#21516;&#34987;&#35270;&#20026;&#26377;&#25928;&#65292;&#23427;&#20204;&#24517;&#39035;&#36981;&#23432;&#20256;&#32479;&#30340;&#21512;&#21516;&#35268;&#21017;&#65292;&#24182;&#22312;&#27809;&#26377;&#20219;&#20309;&#38556;&#30861;&#30340;&#24773;&#20917;&#19979;&#24471;&#20197;&#36798;&#25104;&#12290;&#19968;&#26086;&#32534;&#20889;&#12289;&#21152;&#23494;&#21644;&#31614;&#32626;&#23436;&#27605;&#65292;&#26234;&#33021;&#21512;&#21516;&#23558;&#34987;&#35760;&#24405;&#22312;&#21306;&#22359;&#38142;&#36134;&#26412;&#20013;&#65292;&#25552;&#20379;&#36879;&#26126;&#21644;&#23433;&#20840;&#30340;&#35760;&#24405;&#20445;&#23384;&#12290;&#26234;&#33021;&#21512;&#21516;&#25552;&#20379;&#20102;&#22810;&#31181;&#20248;&#21183;&#65292;&#21253;&#25324;&#23427;&#20204;&#33021;&#22815;&#22312;&#19981;&#38656;&#35201;&#20154;&#20026;&#24178;&#39044;&#30340;&#24773;&#20917;&#19979;&#33258;&#21160;&#25191;&#34892;&#65292;&#23427;&#20204;&#22312;&#21306;&#22359;&#38142;&#19978;&#20844;&#24320;&#23637;&#31034;&#21512;&#21516;&#26465;&#27454;&#65292;&#36991;&#20813;&#20102;&#31867;&#20284;&#27927;&#38065;&#30340;&#37329;&#34701;&#29359;&#32618;&#65292;&#20197;&#21450;&#38450;&#27490;&#20102;&#21512;&#21516;&#28389;&#29992;&#12290;&#28982;&#32780;&#65292;&#30001;&#26234;&#33021;&#21512;&#21516;&#24341;&#21457;&#30340;&#20105;&#35758;&#20173;&#38656;&#35201;&#20154;&#20026;&#24178;&#39044;&#65292;&#22312;&#24378;&#21046;&#25191;&#34892;&#36825;&#20123;&#21512;&#21516;&#26041;&#38754;&#23384;&#22312;&#30528;&#29420;&#29305;&#30340;&#25361;&#25112;&#65292;&#27604;&#22914;&#35777;&#25454;&#38382;&#39064;&#12289;&#23545;&#36777;&#25252;&#30340;&#24323;&#26435;&#21487;&#25191;&#34892;&#24615;&#20197;&#21450;&#27861;&#38498;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.19051v1 Announce Type: new  Abstract: The rise of digital currency and the public ledger Block Chain has led to the development of a new type of electronic contract known as "smart contracts." For these contracts to be considered valid, they must adhere to traditional contract rules and be concluded without any impediments. Once written, encrypted, and signed, smart contracts are recorded in the Block Chain Ledger, providing transparent and secure record-keeping. Smart contracts offer several benefits, including their ability to execute automatically without requiring human intervention, their provision of public visibility of contract provisions on the Block Chain, their avoidance of financial crimes like Money Laundering, and their prevention of contract abuses. However, disputes arising from smart contracts still require human intervention, presenting unique challenges in enforcing these contracts, such as evidentiary issues, enforceability of waivers of defenses, and jur
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;&#37329;&#34701;&#24066;&#22330;&#30340;Wyckoff&#38454;&#27573;&#26694;&#26550;&#65292;&#25506;&#35752;&#20102;&#32047;&#31215;&#27169;&#24335;&#21644;&#20132;&#26131;&#33539;&#22260;&#31561;&#38454;&#27573;&#30340;&#37325;&#35201;&#24615;&#65292;&#25581;&#31034;&#20102;&#22914;&#20309;&#21033;&#29992;LSTM&#27169;&#22411;&#20998;&#26512;&#24066;&#22330;&#25968;&#25454;&#20197;&#39044;&#27979;&#20215;&#26684;&#36208;&#21183;&#21644;&#20570;&#20986;&#26126;&#26234;&#20915;&#31574;&#12290;</title><link>https://arxiv.org/abs/2403.18839</link><description>&lt;p&gt;
&#36135;&#24065;&#20132;&#26131;&#20013;&#30340;&#38271;&#30701;&#26399;&#35760;&#24518;&#27169;&#24335;&#35782;&#21035;
&lt;/p&gt;
&lt;p&gt;
Long Short-Term Memory Pattern Recognition in Currency Trading
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18839
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;&#37329;&#34701;&#24066;&#22330;&#30340;Wyckoff&#38454;&#27573;&#26694;&#26550;&#65292;&#25506;&#35752;&#20102;&#32047;&#31215;&#27169;&#24335;&#21644;&#20132;&#26131;&#33539;&#22260;&#31561;&#38454;&#27573;&#30340;&#37325;&#35201;&#24615;&#65292;&#25581;&#31034;&#20102;&#22914;&#20309;&#21033;&#29992;LSTM&#27169;&#22411;&#20998;&#26512;&#24066;&#22330;&#25968;&#25454;&#20197;&#39044;&#27979;&#20215;&#26684;&#36208;&#21183;&#21644;&#20570;&#20986;&#26126;&#26234;&#20915;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#28145;&#20837;&#20998;&#26512;&#20102;&#36890;&#36807;Richard D. Wyckoff&#22312;20&#19990;&#32426;&#26089;&#26399;&#35774;&#35745;&#30340;Wyckoff&#38454;&#27573;&#26694;&#26550;&#30340;&#37329;&#34701;&#24066;&#22330;&#12290;&#37325;&#28857;&#20851;&#27880;Wyckoff&#26694;&#26550;&#20013;&#30340;&#32047;&#31215;&#27169;&#24335;&#65292;&#30740;&#31350;&#25506;&#35752;&#20102;&#20132;&#26131;&#33539;&#22260;&#21644;&#27425;&#32423;&#27979;&#35797;&#38454;&#27573;&#65292;&#38416;&#26126;&#20102;&#23427;&#20204;&#22312;&#29702;&#35299;&#24066;&#22330;&#21160;&#24577;&#21644;&#35782;&#21035;&#28508;&#22312;&#20132;&#26131;&#26426;&#20250;&#20013;&#30340;&#37325;&#35201;&#24615;&#12290;&#36890;&#36807;&#21078;&#26512;&#36825;&#20123;&#38454;&#27573;&#30340;&#22797;&#26434;&#24615;&#65292;&#26412;&#30740;&#31350;&#25581;&#31034;&#20102;&#24066;&#22330;&#32467;&#26500;&#36890;&#36807;&#21019;&#36896;&#27969;&#21160;&#24615;&#65292;&#20026;&#20132;&#26131;&#32773;&#22914;&#20309;&#21033;&#29992;&#36825;&#20123;&#30693;&#35782;&#26469;&#39044;&#27979;&#20215;&#26684;&#36208;&#21183;&#21644;&#20570;&#20986;&#26126;&#26234;&#20915;&#31574;&#25552;&#20379;&#20102;&#35265;&#35299;&#12290;&#26377;&#25928;&#26816;&#27979;&#21644;&#20998;&#26512;Wyckoff&#27169;&#24335;&#38656;&#35201;&#33021;&#22815;&#22788;&#29702;&#22797;&#26434;&#24066;&#22330;&#25968;&#25454;&#30340;&#24378;&#22823;&#35745;&#31639;&#27169;&#22411;&#65292;&#20854;&#20013;&#31354;&#38388;&#25968;&#25454;&#26368;&#22909;&#36890;&#36807;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;(CNN)&#36827;&#34892;&#20998;&#26512;&#65292;&#32780;&#26102;&#38388;&#25968;&#25454;&#21017;&#36890;&#36807;&#38271;&#30701;&#26399;&#35760;&#24518;&#65288;LSTM&#65289;&#27169;&#22411;&#36827;&#34892;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18839v1 Announce Type: cross  Abstract: This study delves into the analysis of financial markets through the lens of Wyckoff Phases, a framework devised by Richard D. Wyckoff in the early 20th century. Focusing on the accumulation pattern within the Wyckoff framework, the research explores the phases of trading range and secondary test, elucidating their significance in understanding market dynamics and identifying potential trading opportunities. By dissecting the intricacies of these phases, the study sheds light on the creation of liquidity through market structure, offering insights into how traders can leverage this knowledge to anticipate price movements and make informed decisions. The effective detection and analysis of Wyckoff patterns necessitate robust computational models capable of processing complex market data, with spatial data best analyzed using Convolutional Neural Networks (CNNs) and temporal data through Long Short-Term Memory (LSTM) models. The creation
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#36845;&#20195;&#22256;&#22659;&#21338;&#24328;&#29702;&#35770;&#21644;&#21452;&#36793;&#25774;&#21512;&#24066;&#22330;&#35270;&#35282;&#65292;&#30740;&#31350;&#20102;&#34394;&#20551;&#26032;&#38395;&#20256;&#25773;&#21644;&#20107;&#23454;&#26680;&#26597;&#25104;&#26412;&#23545;&#20449;&#24687;&#24066;&#22330;&#24179;&#34913;&#30340;&#24433;&#21709;&#65292;&#25506;&#35752;&#20102;&#26032;&#38395;&#25552;&#20379;&#32773;&#22312;&#36873;&#25321;&#25112;&#30053;&#26102;&#38754;&#20020;&#30340;&#25361;&#25112;&#20197;&#21450;&#26368;&#22823;&#22870;&#21169;&#21644;&#26368;&#23567;&#21270;&#25104;&#26412;&#36335;&#24452;&#20248;&#21270;&#30340;&#31574;&#30053;&#12290;</title><link>https://arxiv.org/abs/2403.18837</link><description>&lt;p&gt;
&#22312;&#20998;&#24067;&#20449;&#24687;&#20013;&#20351;&#29992;&#28404;&#23450;&#37197;&#39069;&#30456;&#20114;&#20316;&#29992;&#30340;&#37325;&#22797;&#22256;&#22659;&#28216;&#25103;&#65306;&#26757;&#20811;&#26041;&#27861;&#23545;&#26368;&#22823;&#34917;&#20607;&#21644;&#26368;&#23567;&#25104;&#26412;&#36335;&#32447;&#30340;&#24433;&#21709;&#22312;&#21452;&#36793;&#25774;&#21512;&#24066;&#22330;&#30340;&#20449;&#24687;&#35282;&#33394;&#20013;&#30340;&#36793;&#38469;&#36129;&#29486;
&lt;/p&gt;
&lt;p&gt;
Repetitive Dilemma Games in Distribution Information Using Interplay of Droop Quota: Meek's Method in Impact of Maximum Compensation and Minimum Cost Routes in Information Role of Marginal Contribution in Two-Sided Matching Markets
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18837
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#36845;&#20195;&#22256;&#22659;&#21338;&#24328;&#29702;&#35770;&#21644;&#21452;&#36793;&#25774;&#21512;&#24066;&#22330;&#35270;&#35282;&#65292;&#30740;&#31350;&#20102;&#34394;&#20551;&#26032;&#38395;&#20256;&#25773;&#21644;&#20107;&#23454;&#26680;&#26597;&#25104;&#26412;&#23545;&#20449;&#24687;&#24066;&#22330;&#24179;&#34913;&#30340;&#24433;&#21709;&#65292;&#25506;&#35752;&#20102;&#26032;&#38395;&#25552;&#20379;&#32773;&#22312;&#36873;&#25321;&#25112;&#30053;&#26102;&#38754;&#20020;&#30340;&#25361;&#25112;&#20197;&#21450;&#26368;&#22823;&#22870;&#21169;&#21644;&#26368;&#23567;&#21270;&#25104;&#26412;&#36335;&#24452;&#20248;&#21270;&#30340;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#26159;&#30740;&#31350;&#35745;&#21010;&#30340;&#21021;&#27493;&#25253;&#21578;&#21644;&#32467;&#26524;&#35752;&#35770;&#25688;&#35201;&#12290;&#30740;&#31350;&#25506;&#35752;&#20102;&#34394;&#20551;&#26032;&#38395;&#20256;&#25773;&#21644;&#20107;&#23454;&#26680;&#26597;&#25104;&#26412;&#22312;&#20449;&#24687;&#24066;&#22330;&#26694;&#26550;&#20869;&#30340;&#22797;&#26434;&#21160;&#24577;&#65292;&#24182;&#21033;&#29992;&#28404;&#23450;&#37197;&#39069;&#12289;&#26757;&#20811;&#26041;&#27861;&#21644;&#36793;&#38469;&#36129;&#29486;&#27010;&#24565;&#20998;&#26512;&#20102;&#20379;&#38656;&#20043;&#38388;&#30340;&#24179;&#34913;&#12290;&#36890;&#36807;&#37319;&#29992;&#21452;&#36793;&#25774;&#21512;&#24066;&#22330;&#35270;&#35282;&#65292;&#25105;&#20204;&#28145;&#20837;&#30740;&#31350;&#20102;&#22312;&#24066;&#22330;&#20013;&#31283;&#23450;&#30340;&#24773;&#20917;&#19979;&#20551;&#26032;&#38395;&#34987;&#35270;&#20026;&#30495;&#30456;&#30340;&#24433;&#21709;&#20197;&#21450;&#21487;&#20449;&#24230;&#21344;&#20248;&#21183;&#30340;&#24773;&#26223;&#12290;&#36890;&#36807;&#36845;&#20195;&#22256;&#22659;&#21338;&#24328;&#29702;&#35770;&#30340;&#24212;&#29992;&#65292;&#25105;&#20204;&#35843;&#26597;&#20102;&#21463;&#21040;&#20256;&#25773;&#34394;&#20551;&#26032;&#38395;&#21644;&#20107;&#23454;&#26680;&#26597;&#21162;&#21147;&#25104;&#26412;&#24433;&#21709;&#30340;&#26032;&#38395;&#25552;&#20379;&#32773;&#30340;&#25112;&#30053;&#36873;&#25321;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#30740;&#31350;&#20102;&#26368;&#22823;&#22870;&#21169;&#38382;&#39064;&#20197;&#21450;&#26368;&#23567;&#21270;&#20256;&#25773;&#34394;&#20551;&#26032;&#38395;&#25104;&#26412;&#36335;&#24452;&#30340;&#31574;&#30053;&#65292;&#24182;&#32771;&#34385;&#20102;&#23545;&#24066;&#22330;&#32454;&#20998;&#20026;&#8220;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18837v1 Announce Type: new  Abstract: This paper is a preliminary report of the research plan and a digest of the results and discussions. On research note explores the complex dynamics of fake news dissemination and fact-checking costs within the framework of information markets and analyzes the equilibrium between supply and demand using the concepts of droop quotas, Meek's method, and marginal contributions. By adopting a two-sided matching market perspective, we delve into scenarios in which markets are stable under the influence of fake news perceived as truth and those in which credibility prevails. Through the application of iterated dilemma game theory, we investigate the strategic choices of news providers affected by the costs associated with spreading fake news and fact-checking efforts. We further examine the maximum reward problem and strategies to minimize the cost path for spreading fake news, and consider a nuanced understanding of market segmentation into "c
&lt;/p&gt;</description></item><item><title>DeepTraderX&#26159;&#19968;&#20010;&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#30340;&#20132;&#26131;&#31995;&#32479;&#65292;&#22312;&#22810;&#32447;&#31243;&#24066;&#22330;&#27169;&#25311;&#20013;&#34920;&#29616;&#20986;&#33394;&#65292;&#24182;&#19988;&#21487;&#20197;&#19982;&#25991;&#29486;&#20013;&#26368;&#20339;&#31574;&#30053;&#21305;&#25932;&#12290;</title><link>https://arxiv.org/abs/2403.18831</link><description>&lt;p&gt;
DeepTraderX: &#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#25361;&#25112;&#20256;&#32479;&#20132;&#26131;&#31574;&#30053;&#22312;&#22810;&#32447;&#31243;&#24066;&#22330;&#27169;&#25311;&#20013;&#30340;&#34920;&#29616;
&lt;/p&gt;
&lt;p&gt;
DeepTraderX: Challenging Conventional Trading Strategies with Deep Learning in Multi-Threaded Market Simulations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18831
&lt;/p&gt;
&lt;p&gt;
DeepTraderX&#26159;&#19968;&#20010;&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#30340;&#20132;&#26131;&#31995;&#32479;&#65292;&#22312;&#22810;&#32447;&#31243;&#24066;&#22330;&#27169;&#25311;&#20013;&#34920;&#29616;&#20986;&#33394;&#65292;&#24182;&#19988;&#21487;&#20197;&#19982;&#25991;&#29486;&#20013;&#26368;&#20339;&#31574;&#30053;&#21305;&#25932;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;DeepTraderX&#65288;DTX&#65289;&#65292;&#36825;&#26159;&#19968;&#20010;&#31616;&#21333;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#20132;&#26131;&#31995;&#32479;&#65292;&#24182;&#23637;&#31034;&#20102;&#23427;&#22312;&#22810;&#32447;&#31243;&#24066;&#22330;&#27169;&#25311;&#20013;&#30340;&#34920;&#29616;&#12290;&#22312;&#22823;&#32422;500&#20010;&#27169;&#25311;&#24066;&#22330;&#20132;&#26131;&#26085;&#20013;&#65292;DTX&#20165;&#36890;&#36807;&#35266;&#23519;&#20854;&#20182;&#31574;&#30053;&#20135;&#29983;&#30340;&#20215;&#26684;&#36827;&#34892;&#23398;&#20064;&#12290;&#36890;&#36807;&#36825;&#26679;&#20570;&#65292;&#23427;&#25104;&#21151;&#22320;&#21019;&#24314;&#20102;&#19968;&#31181;&#20174;&#24066;&#22330;&#25968;&#25454;&#21040;&#35201;&#20026;&#26576;&#20010;&#36164;&#20135;&#19979;&#36798;&#30340;&#25253;&#20215;&#65288;&#20080;&#20837;&#25110;&#21334;&#20986;&#35746;&#21333;&#65289;&#30340;&#26144;&#23556;&#20851;&#31995;&#12290;DTX&#22312;&#21382;&#21490;Level-2&#24066;&#22330;&#25968;&#25454;&#65288;&#21363;&#29305;&#23450;&#21487;&#20132;&#26131;&#36164;&#20135;&#30340;&#38480;&#20215;&#35746;&#21333;&#31807;&#65289;&#19978;&#36827;&#34892;&#35757;&#32451;&#65292;&#22788;&#29702;&#27599;&#20010;&#26102;&#38388;&#27493;&#39588;$T$&#30340;&#24066;&#22330;&#29366;&#24577;$S$&#65292;&#20197;&#30830;&#23450;&#24066;&#22330;&#35746;&#21333;&#30340;&#20215;&#26684;$P$&#12290;&#35757;&#32451;&#21644;&#27979;&#35797;&#20013;&#20351;&#29992;&#30340;&#24066;&#22330;&#25968;&#25454;&#26159;&#22522;&#20110;&#30495;&#23454;&#21382;&#21490;&#32929;&#31080;&#24066;&#22330;&#25968;&#25454;&#29983;&#25104;&#30340;&#29420;&#29305;&#24066;&#22330;&#26102;&#38388;&#34920;&#12290;DTX&#32463;&#36807;&#20102;&#19982;&#25991;&#29486;&#20013;&#26368;&#20339;&#31574;&#30053;&#30340;&#22823;&#37327;&#27979;&#35797;&#65292;&#20854;&#32467;&#26524;&#32463;&#36807;&#20102;&#32479;&#35745;&#20998;&#26512;&#39564;&#35777;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#24378;&#35843;&#20102;DTX&#19982;&#26368;&#20339;&#31574;&#30053;&#21305;&#25932;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18831v1 Announce Type: cross  Abstract: In this paper, we introduce DeepTraderX (DTX), a simple Deep Learning-based trader, and present results that demonstrate its performance in a multi-threaded market simulation. In a total of about 500 simulated market days, DTX has learned solely by watching the prices that other strategies produce. By doing this, it has successfully created a mapping from market data to quotes, either bid or ask orders, to place for an asset. Trained on historical Level-2 market data, i.e., the Limit Order Book (LOB) for specific tradable assets, DTX processes the market state $S$ at each timestep $T$ to determine a price $P$ for market orders. The market data used in both training and testing was generated from unique market schedules based on real historic stock market data. DTX was tested extensively against the best strategies in the literature, with its results validated by statistical analysis. Our findings underscore DTX's capability to rival, a
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#21033;&#29992;&#20154;&#24037;&#26234;&#33021;&#31070;&#32463;&#32593;&#32476;&#25581;&#31034;&#20102;&#32654;&#22269;&#21644;&#22269;&#38469;&#20844;&#20849;&#36130;&#25919;&#20043;&#38388;&#30340;&#20851;&#32852;&#65292;&#24182;&#25104;&#21151;&#39044;&#27979;&#20102;&#22269;&#38469;&#20844;&#20849;&#36130;&#25919;&#30340;&#21464;&#21270;&#12290;</title><link>https://arxiv.org/abs/2403.18823</link><description>&lt;p&gt;
&#22522;&#20110;&#20154;&#24037;&#26234;&#33021;&#30340;&#32654;&#22269;&#19982;&#22269;&#38469;&#24066;&#22330;&#20844;&#20849;&#36130;&#25919;&#21464;&#21270;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Artificial Intelligence-based Analysis of Change in Public Finance between US and International Markets
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18823
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#21033;&#29992;&#20154;&#24037;&#26234;&#33021;&#31070;&#32463;&#32593;&#32476;&#25581;&#31034;&#20102;&#32654;&#22269;&#21644;&#22269;&#38469;&#20844;&#20849;&#36130;&#25919;&#20043;&#38388;&#30340;&#20851;&#32852;&#65292;&#24182;&#25104;&#21151;&#39044;&#27979;&#20102;&#22269;&#38469;&#20844;&#20849;&#36130;&#25919;&#30340;&#21464;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20844;&#20849;&#36130;&#25919;&#26159;&#32463;&#27982;&#27835;&#29702;&#30340;&#22522;&#26412;&#26426;&#21046;&#20043;&#19968;&#65292;&#25351;&#30340;&#26159;&#25919;&#24220;&#23454;&#20307;&#20026;&#36164;&#21161;&#20844;&#20849;&#26381;&#21153;&#12289;&#39033;&#30446;&#21644;&#36816;&#33829;&#27963;&#21160;&#32780;&#20570;&#20986;&#30340;&#37329;&#34701;&#27963;&#21160;&#21644;&#20915;&#31574;&#12290;&#22312;&#24403;&#20170;&#20840;&#29699;&#21270;&#30340;&#32972;&#26223;&#19979;&#65292;&#19968;&#20010;&#22269;&#23478;&#20844;&#20849;&#20538;&#21153;&#39046;&#22495;&#30340;&#32454;&#24494;&#21464;&#21270;&#37117;&#21487;&#33021;&#23545;&#22269;&#38469;&#37329;&#34701;&#20135;&#29983;&#37325;&#22823;&#24433;&#21709;&#65292;&#36825;&#35201;&#27714;&#25105;&#20204;&#23545;&#22269;&#38469;&#21644;&#22269;&#20869;&#24066;&#22330;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#26377;&#19968;&#20010;&#32454;&#33268;&#30340;&#29702;&#35299;&#65292;&#20197;&#24110;&#21161;&#25237;&#36164;&#32773;&#20570;&#20986;&#26126;&#26234;&#30340;&#25237;&#36164;&#20915;&#31574;&#12290;&#22240;&#27492;&#65292;&#26412;&#30740;&#31350;&#21033;&#29992;&#20154;&#24037;&#26234;&#33021;&#30340;&#33021;&#21147;&#65292;&#37319;&#29992;&#31070;&#32463;&#32593;&#32476;&#25551;&#32472;&#20102;&#32654;&#22269;&#21644;&#22269;&#38469;&#20844;&#20849;&#36130;&#25919;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#24182;&#26681;&#25454;&#32654;&#22269;&#20844;&#20849;&#36130;&#25919;&#30340;&#21464;&#21270;&#39044;&#27979;&#22269;&#38469;&#20844;&#20849;&#36130;&#25919;&#30340;&#21464;&#21270;&#12290;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#21462;&#24471;&#20102;&#21487;&#35266;&#30340;&#22343;&#26041;&#35823;&#24046;&#65288;MSE&#65289;&#20540;&#20026;2.79&#65292;&#33021;&#22815;&#30830;&#35748;&#26126;&#26174;&#30340;&#30456;&#20851;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18823v1 Announce Type: new  Abstract: Public finances are one of the fundamental mechanisms of economic governance that refer to the financial activities and decisions made by government entities to fund public services, projects, and operations through assets. In today's globalized landscape, even subtle shifts in one nation's public debt landscape can have significant impacts on that of international finances, necessitating a nuanced understanding of the correlations between international and national markets to help investors make informed investment decisions. Therefore, by leveraging the capabilities of artificial intelligence, this study utilizes neural networks to depict the correlations between US and International Public Finances and predict the changes in international public finances based on the changes in US public finances. With the neural network model achieving a commendable Mean Squared Error (MSE) value of 2.79, it is able to affirm a discernible correlatio
&lt;/p&gt;</description></item><item><title>LSTM&#32593;&#32476;&#22312;&#37329;&#34701;&#25968;&#25454;&#39044;&#27979;&#20013;&#30340;&#24212;&#29992;&#65292;&#21033;&#29992;&#22810;&#20010;&#29305;&#24449;&#25552;&#21319;&#27169;&#22411;&#25429;&#25417;&#22797;&#26434;&#27169;&#24335;&#65292;&#36890;&#36807;&#21487;&#35270;&#21270;&#20851;&#38190;&#23646;&#24615;&#25581;&#31034;&#24494;&#22937;&#24046;&#24322;&#65292;&#37319;&#29992;25&#22825;&#26102;&#38388;&#27493;&#38271;&#20869;&#30340;&#36755;&#20837;&#32467;&#26500;&#25429;&#25417;&#26102;&#38388;&#19978;&#30340;&#22797;&#26434;&#24615;</title><link>https://arxiv.org/abs/2403.18822</link><description>&lt;p&gt;
&#25552;&#21319;&#37329;&#34701;&#25968;&#25454;&#21487;&#35270;&#21270;&#20197;&#36741;&#21161;&#25237;&#36164;&#20915;&#31574;
&lt;/p&gt;
&lt;p&gt;
Enhancing Financial Data Visualization for Investment Decision-Making
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18822
&lt;/p&gt;
&lt;p&gt;
LSTM&#32593;&#32476;&#22312;&#37329;&#34701;&#25968;&#25454;&#39044;&#27979;&#20013;&#30340;&#24212;&#29992;&#65292;&#21033;&#29992;&#22810;&#20010;&#29305;&#24449;&#25552;&#21319;&#27169;&#22411;&#25429;&#25417;&#22797;&#26434;&#27169;&#24335;&#65292;&#36890;&#36807;&#21487;&#35270;&#21270;&#20851;&#38190;&#23646;&#24615;&#25581;&#31034;&#24494;&#22937;&#24046;&#24322;&#65292;&#37319;&#29992;25&#22825;&#26102;&#38388;&#27493;&#38271;&#20869;&#30340;&#36755;&#20837;&#32467;&#26500;&#25429;&#25417;&#26102;&#38388;&#19978;&#30340;&#22797;&#26434;&#24615;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#21033;&#29992;&#38271;&#30701;&#26399;&#35760;&#24518;&#65288;LSTM&#65289;&#32593;&#32476;&#39044;&#27979;&#32929;&#31080;&#21160;&#24577;&#30340;&#28508;&#21147;&#65292;&#30528;&#37325;&#20110;&#35782;&#21035;&#24494;&#22937;&#30340;&#28072;&#36300;&#27169;&#24335;&#12290;&#21033;&#29992;&#32445;&#32422;&#35777;&#21048;&#20132;&#26131;&#25152;&#65288;NYSE&#65289;&#30340;&#25968;&#25454;&#38598;&#65292;&#30740;&#31350;&#34701;&#21512;&#20102;&#22810;&#31181;&#29305;&#24449;&#65292;&#20197;&#22686;&#24378;LSTM&#22312;&#25429;&#25417;&#22797;&#26434;&#27169;&#24335;&#26041;&#38754;&#30340;&#33021;&#21147;&#12290;&#36890;&#36807;&#21487;&#35270;&#21270;&#20851;&#38190;&#23646;&#24615;&#65288;&#22914;&#24320;&#30424;&#20215;&#12289;&#25910;&#30424;&#20215;&#12289;&#26368;&#20302;&#20215;&#21644;&#26368;&#39640;&#20215;&#65289;&#65292;&#26377;&#21161;&#20110;&#25581;&#31034;&#23545;&#20840;&#38754;&#24066;&#22330;&#29702;&#35299;&#33267;&#20851;&#37325;&#35201;&#30340;&#24494;&#22937;&#24046;&#24322;&#12290;&#35813;&#30740;&#31350;&#31934;&#24515;&#35774;&#35745;&#30340;LSTM&#36755;&#20837;&#32467;&#26500;&#65292;&#28789;&#24863;&#26469;&#33258;&#20110;&#24050;&#24314;&#31435;&#30340;&#25351;&#23548;&#26041;&#38024;&#65292;&#32467;&#21512;&#20102;25&#22825;&#26102;&#38388;&#27493;&#38271;&#20869;&#30340;&#20215;&#26684;&#21644;&#20132;&#26131;&#37327;&#23646;&#24615;&#65292;&#20351;&#24471;&#27169;&#22411;&#33021;&#22815;&#25429;&#25417;&#26102;&#38388;&#19978;&#30340;&#22797;&#26434;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18822v1 Announce Type: cross  Abstract: Navigating the intricate landscape of financial markets requires adept forecasting of stock price movements. This paper delves into the potential of Long Short-Term Memory (LSTM) networks for predicting stock dynamics, with a focus on discerning nuanced rise and fall patterns. Leveraging a dataset from the New York Stock Exchange (NYSE), the study incorporates multiple features to enhance LSTM's capacity in capturing complex patterns. Visualization of key attributes, such as opening, closing, low, and high prices, aids in unraveling subtle distinctions crucial for comprehensive market understanding. The meticulously crafted LSTM input structure, inspired by established guidelines, incorporates both price and volume attributes over a 25-day time step, enabling the model to capture temporal intricacies. A comprehensive methodology, including hyperparameter tuning with Grid Search, Early Stopping, and Callback mechanisms, leads to a remar
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#35745;&#31639;&#36328;&#26029;&#38754;&#25910;&#30410;&#21487;&#39044;&#27979;&#24615;&#20986;&#29256;&#29289;&#20013;&#34394;&#20551;&#21457;&#29616;&#29575;&#30340;&#31616;&#21333;&#26041;&#27861;&#65292;&#24182;&#21457;&#29616;&#33267;&#23569;75%&#30340;&#21457;&#29616;&#26159;&#30495;&#23454;&#30340;&#12290;</title><link>https://arxiv.org/abs/2206.15365</link><description>&lt;p&gt;
&#36328;&#26029;&#38754;&#25910;&#30410;&#21487;&#39044;&#27979;&#24615;&#20013;&#30340;&#22823;&#22810;&#25968;&#32479;&#35745;&#21457;&#29616;&#21487;&#33021;&#26159;&#30495;&#23454;&#30340;
&lt;/p&gt;
&lt;p&gt;
Most claimed statistical findings in cross-sectional return predictability are likely true
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2206.15365
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#35745;&#31639;&#36328;&#26029;&#38754;&#25910;&#30410;&#21487;&#39044;&#27979;&#24615;&#20986;&#29256;&#29289;&#20013;&#34394;&#20551;&#21457;&#29616;&#29575;&#30340;&#31616;&#21333;&#26041;&#27861;&#65292;&#24182;&#21457;&#29616;&#33267;&#23569;75%&#30340;&#21457;&#29616;&#26159;&#30495;&#23454;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#25552;&#20986;&#20102;&#36328;&#26029;&#38754;&#25910;&#30410;&#21487;&#39044;&#27979;&#24615;&#20986;&#29256;&#29289;&#20013;&#34394;&#20551;&#21457;&#29616;&#29575;&#65288;FDR&#65289;&#30340;&#31616;&#21333;&#30452;&#35266;&#30028;&#38480;&#12290;&#36825;&#20123;&#30028;&#38480;&#21487;&#20197;&#36890;&#36807;&#23558;&#20808;&#21069;&#35770;&#25991;&#20013;&#30340;&#25688;&#35201;&#32479;&#35745;&#25968;&#25454;&#20195;&#20837;&#35745;&#31639;&#65292;&#24182;&#21487;&#38752;&#22320;&#38480;&#21046;&#22312;&#27169;&#25311;&#20013;&#30340;FDR&#65292;&#36825;&#20123;&#27169;&#25311;&#32039;&#23494;&#27169;&#25311;&#20102;&#20132;&#21449;&#39044;&#27979;&#21464;&#37327;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#12290;&#22823;&#22810;&#25968;&#36793;&#30028;&#21457;&#29616;&#33267;&#23569;&#26377;75%&#30340;&#21457;&#29616;&#26159;&#30495;&#23454;&#30340;&#12290;&#26368;&#20005;&#26684;&#30340;&#38480;&#21046;&#21457;&#29616;&#33267;&#23569;&#26377;91%&#30340;&#21457;&#29616;&#26159;&#30495;&#23454;&#30340;&#12290;&#20196;&#20154;&#24778;&#35766;&#30340;&#26159;&#65292;&#21704;&#32500;&#12289;&#21016;&#21644;&#26417;&#65288;2016&#24180;&#65289;&#30340;&#20272;&#35745;&#26174;&#31034;&#20102;&#31867;&#20284;&#30340;FDR&#12290;&#25105;&#35299;&#37322;&#20102;&#21704;&#32500;&#31561;&#20154;&#24471;&#20986;&#22823;&#22810;&#25968;&#21457;&#29616;&#26159;&#34394;&#20551;&#30340;&#32467;&#35770;&#30340;&#21407;&#22240;&#65292;&#26159;&#23558;&#8220;&#34394;&#20551;&#8221;&#21644;&#8220;&#19981;&#26174;&#33879;&#8221;&#31561;&#21516;&#36215;&#26469;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2206.15365v3 Announce Type: replace  Abstract: I develop simple and intuitive bounds for the false discovery rate (FDR) in cross-sectional return predictability publications. The bounds can be calculated by plugging in summary statistics from previous papers and reliably bound the FDR in simulations that closely mimic cross-predictor correlations. Most bounds find that at least 75% of findings are true. The tightest bound finds at least 91% of findings are true. Surprisingly, the estimates in Harvey, Liu, and Zhu (2016) imply a similar FDR. I explain how Harvey et al.'s conclusion that most findings are false stems from equating "false" and "insignificant."
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#20013;&#20351;&#29992;&#23569;&#26679;&#26412;&#23398;&#20064;&#30340;&#36235;&#21183;&#36319;&#36394;&#39044;&#27979;&#22120;&#65292;&#33021;&#22815;&#24555;&#36895;&#36866;&#24212;&#26032;&#30340;&#24066;&#22330;&#26465;&#20214;&#65292;&#24182;&#33719;&#24471;&#36739;&#39640;&#30340;&#22799;&#26222;&#27604;&#29575;&#12290;</title><link>http://arxiv.org/abs/2310.10500</link><description>&lt;p&gt;
&#22312;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#20013;&#30340;&#23569;&#26679;&#26412;&#23398;&#20064;&#27169;&#24335;&#29992;&#20110;&#36235;&#21183;&#36319;&#36394;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Few-Shot Learning Patterns in Financial Time-Series for Trend-Following Strategies. (arXiv:2310.10500v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.10500
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#20013;&#20351;&#29992;&#23569;&#26679;&#26412;&#23398;&#20064;&#30340;&#36235;&#21183;&#36319;&#36394;&#39044;&#27979;&#22120;&#65292;&#33021;&#22815;&#24555;&#36895;&#36866;&#24212;&#26032;&#30340;&#24066;&#22330;&#26465;&#20214;&#65292;&#24182;&#33719;&#24471;&#36739;&#39640;&#30340;&#22799;&#26222;&#27604;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38024;&#23545;&#31995;&#32479;&#21270;&#20132;&#26131;&#31574;&#30053;&#30340;&#39044;&#27979;&#27169;&#22411;&#22312;&#37329;&#34701;&#24066;&#22330;&#26465;&#20214;&#21457;&#29983;&#21464;&#21270;&#26102;&#26080;&#27861;&#36805;&#36895;&#36866;&#24212;&#30340;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26102;&#38388;&#24207;&#21015;&#36235;&#21183;&#36319;&#36394;&#39044;&#27979;&#22120;&#65292;&#33021;&#22815;&#24555;&#36895;&#36866;&#24212;&#26032;&#30340;&#24066;&#22330;&#26465;&#20214;&#12290;&#25105;&#20204;&#21033;&#29992;&#28145;&#24230;&#23398;&#20064;&#39046;&#22495;&#30340;&#26368;&#26032;&#36827;&#23637;&#65292;&#37319;&#29992;&#23569;&#26679;&#26412;&#23398;&#20064;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20132;&#21449;&#27880;&#24847;&#21147;&#26102;&#38388;&#24207;&#21015;&#36235;&#21183;&#32593;&#32476; - X-Trend&#65292;&#36890;&#36807;&#23545;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#36827;&#34892;&#20851;&#27880;&#65292;&#20174;&#19978;&#19979;&#25991;&#26679;&#26412;&#38598;&#20013;&#36716;&#31227;&#30456;&#20284;&#27169;&#24335;&#30340;&#36235;&#21183;&#65292;&#23545;&#26032;&#30340;&#30446;&#26631;&#24773;&#22659;&#36827;&#34892;&#39044;&#27979;&#21644;&#23450;&#20301;&#12290;X-Trend&#33021;&#22815;&#24555;&#36895;&#36866;&#24212;&#26032;&#30340;&#37329;&#34701;&#24773;&#22659;&#65292;&#20854;&#22799;&#26222;&#27604;&#29575;&#30456;&#23545;&#20110;&#31070;&#32463;&#39044;&#27979;&#22120;&#25552;&#39640;&#20102;18.9%&#65292;&#30456;&#23545;&#20110;&#20256;&#32479;&#26102;&#38388;&#24207;&#21015;&#26041;&#27861;&#25552;&#39640;&#20102;10&#20493;&#12290;
&lt;/p&gt;
&lt;p&gt;
Forecasting models for systematic trading strategies do not adapt quickly when financial market conditions change, as was seen in the advent of the COVID-19 pandemic in 2020, when market conditions changed dramatically causing many forecasting models to take loss-making positions. To deal with such situations, we propose a novel time-series trend-following forecaster that is able to quickly adapt to new market conditions, referred to as regimes. We leverage recent developments from the deep learning community and use few-shot learning. We propose the Cross Attentive Time-Series Trend Network - X-Trend which takes positions attending over a context set of financial time-series regimes. X-Trend transfers trends from similar patterns in the context set to make predictions and take positions for a new distinct target regime. X-Trend is able to quickly adapt to new financial regimes with a Sharpe ratio increase of 18.9% over a neural forecaster and 10-fold over a conventional Time-series 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21442;&#25968;&#21270;&#26041;&#27861;&#26469;&#23450;&#20215;&#20855;&#26377;&#38480;&#21046;&#30340;&#25671;&#25670;&#21512;&#32422;&#65292;&#24182;&#23581;&#35797;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#21462;&#20195;&#19968;&#20123;&#21442;&#25968;&#12290;&#25968;&#20540;&#23454;&#39564;&#34920;&#26126;&#65292;&#30456;&#27604;&#20110;&#29616;&#26377;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#33021;&#22312;&#30701;&#26102;&#38388;&#20869;&#25552;&#20379;&#26356;&#22909;&#30340;&#20215;&#26684;&#12290;</title><link>http://arxiv.org/abs/2306.03822</link><description>&lt;p&gt;
&#25671;&#25670;&#21512;&#32422;&#23450;&#20215;: &#19968;&#31181;&#24102;&#26377;&#33258;&#21160;&#24494;&#20998;&#21644;&#31070;&#32463;&#32593;&#32476;&#30340;&#21442;&#25968;&#21270;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Swing Contract Pricing: A Parametric Approach with Adjoint Automatic Differentiation and Neural Networks. (arXiv:2306.03822v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.03822
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21442;&#25968;&#21270;&#26041;&#27861;&#26469;&#23450;&#20215;&#20855;&#26377;&#38480;&#21046;&#30340;&#25671;&#25670;&#21512;&#32422;&#65292;&#24182;&#23581;&#35797;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#21462;&#20195;&#19968;&#20123;&#21442;&#25968;&#12290;&#25968;&#20540;&#23454;&#39564;&#34920;&#26126;&#65292;&#30456;&#27604;&#20110;&#29616;&#26377;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#33021;&#22312;&#30701;&#26102;&#38388;&#20869;&#25552;&#20379;&#26356;&#22909;&#30340;&#20215;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#31181;&#21442;&#25968;&#21270;&#26041;&#27861;&#26469;&#23450;&#20215;&#24102;&#26377;&#24378;&#21046;&#24615;&#38480;&#21046;&#30340;&#25671;&#25670;&#21512;&#32422;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#21019;&#24314;&#36817;&#20284;&#26368;&#20248;&#25511;&#21046;&#30340;&#20989;&#25968;&#65292;&#20854;&#20195;&#34920;&#21512;&#32422;&#26399;&#20869;&#36141;&#20080;&#33021;&#28304;&#30340;&#25968;&#37327;&#12290;&#31532;&#19968;&#31181;&#26041;&#27861;&#28041;&#21450;&#26126;&#30830;&#22320;&#23450;&#20041;&#19968;&#20010;&#21442;&#25968;&#21270;&#20989;&#25968;&#26469;&#24314;&#27169;&#26368;&#20248;&#25511;&#21046;&#24182;&#20351;&#29992;&#22522;&#20110;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;&#30340;&#31639;&#27861;&#26469;&#30830;&#23450;&#21442;&#25968;&#12290;&#31532;&#20108;&#31181;&#26041;&#27861;&#22522;&#20110;&#31532;&#19968;&#31181;&#26041;&#27861;&#65292;&#23558;&#21442;&#25968;&#26367;&#25442;&#20026;&#31070;&#32463;&#32593;&#32476;&#12290;&#25105;&#20204;&#30340;&#25968;&#20540;&#23454;&#39564;&#34920;&#26126;&#65292;&#36890;&#36807;&#20351;&#29992;Langevin&#31639;&#27861;&#65292;&#36825;&#20004;&#31181;&#21442;&#25968;&#21270;&#26041;&#27861;&#37117;&#22312;&#30701;&#26102;&#38388;&#20869;&#25552;&#20379;&#20102;&#27604;&#29616;&#26377;&#26041;&#27861;(&#22914;Longstaff&#21644;Schwartz&#25552;&#20986;&#30340;&#26041;&#27861;)&#26356;&#22909;&#30340;&#20215;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose two parametric approaches to price swing contracts with firm constraints. Our objective is to create approximations for the optimal control, which represents the amounts of energy purchased throughout the contract. The first approach involves explicitly defining a parametric function to model the optimal control, and the parameters using stochastic gradient descent-based algorithms. The second approach builds on the first one, replacing the parameters with neural networks. Our numerical experiments demonstrate that by using Langevin-based algorithms, both parameterizations provide, in a short computation time, better prices compared to state-of-the-art methods (like the one given by Longstaff and Schwartz).
&lt;/p&gt;</description></item></channel></rss>