<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22810;&#20010;&#25237;&#36164;&#32773;&#22312;&#21021;&#22987;&#36130;&#23500;&#12289;&#39118;&#38505;&#35268;&#36991;&#21442;&#25968;&#20197;&#21450;&#32456;&#27490;&#26102;&#38388;&#30340;&#38543;&#26426;&#36127;&#20538;&#26041;&#38754;&#23384;&#22312;&#24046;&#24322;&#26102;&#30340;&#22343;&#34913;&#20215;&#26684;&#24418;&#25104;&#38382;&#39064;&#65292;&#36890;&#36807;&#19968;&#20010;&#26032;&#30340;&#22343;&#22330;&#21453;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65288;BSDE&#65289;&#30340;&#35299;&#26469;&#34920;&#24449;&#39118;&#38505;&#32929;&#31080;&#30340;&#22343;&#34913;&#39118;&#38505;&#28322;&#20215;&#36807;&#31243;&#65292;&#24182;&#35777;&#26126;&#20854;&#28165;&#38500;&#24066;&#22330;&#12290;</title><link>http://arxiv.org/abs/2304.07108</link><description>&lt;p&gt;
&#24102;&#25351;&#25968;&#25928;&#29992;&#20989;&#25968;&#30340;&#22343;&#20540;&#22330;&#22343;&#34913;&#20215;&#26684;&#24418;&#25104;
&lt;/p&gt;
&lt;p&gt;
Mean-field equilibrium price formation with exponential utility. (arXiv:2304.07108v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.07108
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22810;&#20010;&#25237;&#36164;&#32773;&#22312;&#21021;&#22987;&#36130;&#23500;&#12289;&#39118;&#38505;&#35268;&#36991;&#21442;&#25968;&#20197;&#21450;&#32456;&#27490;&#26102;&#38388;&#30340;&#38543;&#26426;&#36127;&#20538;&#26041;&#38754;&#23384;&#22312;&#24046;&#24322;&#26102;&#30340;&#22343;&#34913;&#20215;&#26684;&#24418;&#25104;&#38382;&#39064;&#65292;&#36890;&#36807;&#19968;&#20010;&#26032;&#30340;&#22343;&#22330;&#21453;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65288;BSDE&#65289;&#30340;&#35299;&#26469;&#34920;&#24449;&#39118;&#38505;&#32929;&#31080;&#30340;&#22343;&#34913;&#39118;&#38505;&#28322;&#20215;&#36807;&#31243;&#65292;&#24182;&#35777;&#26126;&#20854;&#28165;&#38500;&#24066;&#22330;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22810;&#20301;&#25237;&#36164;&#32773;&#22312;&#21021;&#22987;&#36130;&#23500;&#12289;&#39118;&#38505;&#35268;&#36991;&#21442;&#25968;&#20197;&#21450;&#32456;&#27490;&#26102;&#38388;&#30340;&#38543;&#26426;&#36127;&#20538;&#26041;&#38754;&#23384;&#22312;&#24046;&#24322;&#26102;&#30340;&#22343;&#34913;&#20215;&#26684;&#24418;&#25104;&#38382;&#39064;&#12290;&#25105;&#20204;&#36890;&#36807;&#19968;&#20010;&#26032;&#30340;&#22343;&#22330;&#21453;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65288;BSDE&#65289;&#30340;&#35299;&#26469;&#34920;&#24449;&#39118;&#38505;&#32929;&#31080;&#30340;&#22343;&#34913;&#39118;&#38505;&#28322;&#20215;&#36807;&#31243;&#65292;&#20854;&#29305;&#24449;&#26159;&#39537;&#21160;&#31243;&#24207;&#22312;&#38543;&#26426;&#31215;&#20998;&#21644;&#26465;&#20214;&#26399;&#26395;&#19978;&#37117;&#20855;&#26377;&#20108;&#27425;&#22686;&#38271;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#22810;&#20010;&#26465;&#20214;&#19979;&#22343;&#22330;BSDE&#23384;&#22312;&#35299;&#65292;&#24182;&#19988;&#34920;&#26126;&#38543;&#30528;&#20154;&#21475;&#35268;&#27169;&#30340;&#22686;&#22823;&#65292;&#32467;&#26524;&#39118;&#38505;&#28322;&#20215;&#36827;&#31243;&#23454;&#38469;&#19978;&#20250;&#28165;&#38500;&#24066;&#22330;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we study a problem of equilibrium price formation among many investors with exponential utility. The investors are heterogeneous in their initial wealth, risk-averseness parameter, as well as stochastic liability at the terminal time. We characterize the equilibrium risk-premium process of the risky stocks in terms of the solution to a novel mean-field backward stochastic differential equation (BSDE), whose driver has quadratic growth both in the stochastic integrands and in their conditional expectations. We prove the existence of a solution to the mean-field BSDE under several conditions and show that the resultant risk-premium process actually clears the market in the large population limit.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#26410;&#30693;&#22343;&#20540;&#19979;&#30340;&#22823;&#32500;&#21327;&#26041;&#24046;&#30697;&#38453;&#20272;&#35745;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#22120;&#65292;&#35777;&#26126;&#20102;&#20854;&#20108;&#27425;&#25910;&#25947;&#24615;&#65292;&#22312;&#23454;&#39564;&#20013;&#34920;&#29616;&#20248;&#20110;&#20854;&#20182;&#26631;&#20934;&#20272;&#35745;&#22120;&#12290;</title><link>http://arxiv.org/abs/2304.07045</link><description>&lt;p&gt;
Ledoit-Wolf&#32447;&#24615;&#25910;&#32553;&#26041;&#27861;&#22312;&#26410;&#30693;&#22343;&#20540;&#30340;&#24773;&#20917;&#19979;&#30340;&#24212;&#29992;(arXiv:2304.07045v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
Ledoit-Wolf linear shrinkage with unknown mean. (arXiv:2304.07045v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.07045
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#26410;&#30693;&#22343;&#20540;&#19979;&#30340;&#22823;&#32500;&#21327;&#26041;&#24046;&#30697;&#38453;&#20272;&#35745;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#22120;&#65292;&#35777;&#26126;&#20102;&#20854;&#20108;&#27425;&#25910;&#25947;&#24615;&#65292;&#22312;&#23454;&#39564;&#20013;&#34920;&#29616;&#20248;&#20110;&#20854;&#20182;&#26631;&#20934;&#20272;&#35745;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#26410;&#30693;&#22343;&#20540;&#19979;&#30340;&#22823;&#32500;&#21327;&#26041;&#24046;&#30697;&#38453;&#20272;&#35745;&#38382;&#39064;&#12290;&#24403;&#32500;&#25968;&#21644;&#26679;&#26412;&#25968;&#25104;&#27604;&#20363;&#24182;&#36235;&#21521;&#20110;&#26080;&#31351;&#22823;&#26102;&#65292;&#32463;&#39564;&#21327;&#26041;&#24046;&#20272;&#35745;&#22120;&#22833;&#25928;&#65292;&#27492;&#26102;&#31216;&#20026;Kolmogorov&#28176;&#36827;&#24615;&#12290;&#24403;&#22343;&#20540;&#24050;&#30693;&#26102;&#65292;Ledoit&#21644;Wolf&#65288;2004&#65289;&#25552;&#20986;&#20102;&#19968;&#20010;&#32447;&#24615;&#25910;&#32553;&#20272;&#35745;&#22120;&#65292;&#24182;&#35777;&#26126;&#20102;&#22312;&#36825;&#20123;&#28436;&#36827;&#19979;&#30340;&#25910;&#25947;&#24615;&#12290;&#25454;&#25105;&#20204;&#25152;&#30693;&#65292;&#24403;&#22343;&#20540;&#26410;&#30693;&#26102;&#65292;&#23578;&#26410;&#25552;&#20986;&#27491;&#24335;&#35777;&#26126;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#20272;&#35745;&#22120;&#65292;&#24182;&#22312;Ledoit&#21644;Wolf&#30340;&#20551;&#35774;&#19979;&#35777;&#26126;&#20102;&#23427;&#30340;&#20108;&#27425;&#25910;&#25947;&#24615;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#23427;&#32988;&#36807;&#20102;&#20854;&#20182;&#26631;&#20934;&#20272;&#35745;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;
This work addresses large dimensional covariance matrix estimation with unknown mean. The empirical covariance estimator fails when dimension and number of samples are proportional and tend to infinity, settings known as Kolmogorov asymptotics. When the mean is known, Ledoit and Wolf (2004) proposed a linear shrinkage estimator and proved its convergence under those asymptotics. To the best of our knowledge, no formal proof has been proposed when the mean is unknown. To address this issue, we propose a new estimator and prove its quadratic convergence under the Ledoit and Wolf assumptions. Finally, we show empirically that it outperforms other standard estimators.
&lt;/p&gt;</description></item><item><title>&#21033;&#29992;&#20302;&#30899;&#38146;&#25552;&#21462;&#20351;&#24471;&#28145;&#37096;&#22320;&#28909;&#21457;&#30005;&#21378;&#22312;&#19981;&#21033;&#26465;&#20214;&#19979;&#20855;&#22791;&#20102;&#25104;&#26412;&#31454;&#20105;&#21147;&#65292;&#21487;&#20197;&#20026;&#33021;&#28304;&#31995;&#32479;&#25552;&#20379;&#36275;&#22815;&#30340;&#38146;&#20197;&#29983;&#20135;&#22823;&#32422;&#27599;&#24180;1.2&#30334;&#19975;&#20010;&#30005;&#21160;&#27773;&#36710;&#30005;&#27744;&#32452;&#65292;&#30456;&#24403;&#20110;&#27431;&#30431;&#30005;&#21160;&#36710;&#24180;&#27880;&#20876;&#37327;&#30340;70%&#12290;</title><link>http://arxiv.org/abs/2304.07019</link><description>&lt;p&gt;
&#20302;&#30899;&#38146;&#25552;&#21462;&#20351;&#24471;&#28145;&#37096;&#22320;&#28909;&#21457;&#30005;&#21378;&#22312;&#33021;&#28304;&#31995;&#32479;&#20013;&#20855;&#22791;&#25104;&#26412;&#31454;&#20105;&#21147;
&lt;/p&gt;
&lt;p&gt;
Low-carbon Lithium Extraction Makes Deep Geothermal Plants Cost-competitive in Energy Systems. (arXiv:2304.07019v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.07019
&lt;/p&gt;
&lt;p&gt;
&#21033;&#29992;&#20302;&#30899;&#38146;&#25552;&#21462;&#20351;&#24471;&#28145;&#37096;&#22320;&#28909;&#21457;&#30005;&#21378;&#22312;&#19981;&#21033;&#26465;&#20214;&#19979;&#20855;&#22791;&#20102;&#25104;&#26412;&#31454;&#20105;&#21147;&#65292;&#21487;&#20197;&#20026;&#33021;&#28304;&#31995;&#32479;&#25552;&#20379;&#36275;&#22815;&#30340;&#38146;&#20197;&#29983;&#20135;&#22823;&#32422;&#27599;&#24180;1.2&#30334;&#19975;&#20010;&#30005;&#21160;&#27773;&#36710;&#30005;&#27744;&#32452;&#65292;&#30456;&#24403;&#20110;&#27431;&#30431;&#30005;&#21160;&#36710;&#24180;&#27880;&#20876;&#37327;&#30340;70%&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38146;&#26159;&#33021;&#28304;&#36716;&#22411;&#30340;&#20851;&#38190;&#26448;&#26009;&#65292;&#20294;&#20256;&#32479;&#30340;&#37319;&#36141;&#26041;&#27861;&#20855;&#26377;&#37325;&#22823;&#29615;&#22659;&#24433;&#21709;&#12290;&#26412;&#30740;&#31350;&#21033;&#29992;&#21306;&#22495;&#33021;&#28304;&#31995;&#32479;&#20248;&#21270;&#65292;&#35843;&#26597;&#20102;&#30452;&#25509;&#20174;&#28145;&#37096;&#22320;&#28909;&#21378;&#20013;&#25552;&#21462;&#38146;&#30340;&#20302;&#30899;&#26367;&#20195;&#26041;&#27861;&#30340;&#25216;&#26415;&#32463;&#27982;&#28508;&#21147;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22320;&#28909;&#21457;&#30005;&#21378;&#19982;&#38146;&#25552;&#21462;&#30456;&#32467;&#21512;&#23558;&#20855;&#22791;&#25104;&#26412;&#31454;&#20105;&#21147;&#65292;&#21363;&#20351;&#22312;&#19981;&#21033;&#26465;&#20214;&#19979;&#65292;&#20063;&#23558;&#37096;&#20998;&#21462;&#20195;&#20809;&#20239;&#12289;&#39118;&#33021;&#21644;&#20648;&#33021;&#31995;&#32479;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#34920;&#26126;&#65292;&#22914;&#26524;&#24503;&#22269;&#19978;&#33713;&#33589;&#27807;&#35895;&#22320;&#21306;10%&#30340;&#22478;&#24066;&#24314;&#36896;&#28145;&#37096;&#22320;&#28909;&#21457;&#30005;&#21378;&#65292;&#20182;&#20204;&#21487;&#20197;&#25552;&#20379;&#36275;&#22815;&#30340;&#38146;&#65292;&#20197;&#29983;&#20135;&#22823;&#32422;&#27599;&#24180;1.2&#30334;&#19975;&#20010;&#30005;&#21160;&#27773;&#36710;&#30005;&#27744;&#32452;&#65292;&#30456;&#24403;&#20110;&#27431;&#27954;&#32852;&#30431;&#20170;&#22825;&#24180;&#30005;&#21160;&#36710;&#27880;&#20876;&#37327;&#30340;70%&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#24102;&#26469;&#26174;&#33879;&#30340;&#29615;&#22659;&#25928;&#30410;&#65292;&#24182;&#26377;&#22312;&#20854;&#20182;&#22269;&#23478;&#22823;&#35268;&#27169;&#24212;&#29992;&#30340;&#39640;&#28508;&#21147;
&lt;/p&gt;
&lt;p&gt;
Lithium is a critical material for the energy transition, but conventional procurement methods have significant environmental impacts. In this study, we utilize regional energy system optimizations to investigate the techno-economic potential of the low-carbon alternative of direct lithium extraction in deep geothermal plants. We show that geothermal plants will become cost-competitive in conjunction with lithium extraction, even under unfavorable conditions and partially displace photovoltaics, wind power, and storage from energy systems. Our analysis indicates that if 10% of municipalities in the Upper Rhine Graben area in Germany constructed deep geothermal plants, they could provide enough lithium to produce about 1.2 million electric vehicle battery packs per year, equivalent to 70% of today`s annual electric vehicle registrations in the European Union. This approach could offer significant environmental benefits and has high potential for mass application also in other countries,
&lt;/p&gt;</description></item><item><title>&#20171;&#32461;&#20102;&#19968;&#31181;&#39640;&#25928;&#20272;&#35745;&#26497;&#20540;&#22238;&#24402;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#36741;&#21161;&#21098;&#25509;&#23494;&#24230;&#25193;&#23637;&#20102;&#23614;&#37096;&#22238;&#24402;&#27169;&#22411;&#20197;&#29992;&#20110;&#38750;&#23614;&#37096;&#35266;&#27979;&#26469;&#35299;&#20915;&#38408;&#20540;&#36873;&#25321;&#38382;&#39064;&#65292;&#22312;&#27169;&#25311;&#30740;&#31350;&#21644;&#23454;&#35777;&#30740;&#31350;&#20013;&#23637;&#31034;&#20102;&#20854;&#20248;&#36234;&#24615;&#12290;</title><link>http://arxiv.org/abs/2304.06950</link><description>&lt;p&gt;
&#36991;&#38505;&#22522;&#37329;&#23614;&#37096;&#39118;&#38505;&#26497;&#20540;&#22238;&#24402;&#27169;&#22411;&#30340;&#39640;&#25928;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Efficient Estimation in Extreme Value Regression Models of Hedge Fund Tail Risks. (arXiv:2304.06950v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.06950
&lt;/p&gt;
&lt;p&gt;
&#20171;&#32461;&#20102;&#19968;&#31181;&#39640;&#25928;&#20272;&#35745;&#26497;&#20540;&#22238;&#24402;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#36741;&#21161;&#21098;&#25509;&#23494;&#24230;&#25193;&#23637;&#20102;&#23614;&#37096;&#22238;&#24402;&#27169;&#22411;&#20197;&#29992;&#20110;&#38750;&#23614;&#37096;&#35266;&#27979;&#26469;&#35299;&#20915;&#38408;&#20540;&#36873;&#25321;&#38382;&#39064;&#65292;&#22312;&#27169;&#25311;&#30740;&#31350;&#21644;&#23454;&#35777;&#30740;&#31350;&#20013;&#23637;&#31034;&#20102;&#20854;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#26041;&#27861;&#26469;&#21516;&#26102;&#20272;&#35745;&#26497;&#20540;&#22238;&#24402;&#27169;&#22411;&#20013;&#30340;&#23614;&#37096;&#21644;&#38408;&#20540;&#21442;&#25968;&#12290;&#35813;&#26631;&#20934;&#27169;&#22411;&#22312;&#37329;&#34701;&#39046;&#22495;&#20013;&#34987;&#29992;&#20110;&#35780;&#20272;&#24066;&#22330;&#21464;&#37327;&#23545;&#25237;&#36164;&#36710;&#36742;&#65288;&#22914;&#36991;&#38505;&#22522;&#37329;&#65289;&#30340;&#26497;&#31471;&#25439;&#22833;&#20998;&#24067;&#30340;&#24433;&#21709;&#12290;&#28982;&#32780;&#65292;&#19968;&#20010;&#20027;&#35201;&#30340;&#23616;&#38480;&#24615;&#26159;&#38656;&#35201;&#25552;&#21069;&#36873;&#25321;&#19968;&#20010;&#38408;&#20540;&#65292;&#22312;&#35813;&#38408;&#20540;&#20197;&#19979;&#30340;&#25968;&#25454;&#23558;&#34987;&#20002;&#24323;&#65292;&#23548;&#33268;&#20272;&#35745;&#25928;&#29575;&#20302;&#19979;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#36890;&#36807;&#36741;&#21161;&#21098;&#25509;&#23494;&#24230;&#25193;&#23637;&#20102;&#23614;&#37096;&#22238;&#24402;&#27169;&#22411;&#20197;&#29992;&#20110;&#38750;&#23614;&#37096;&#35266;&#27979;&#65292;&#20351;&#24471;&#38408;&#20540;&#21487;&#20197;&#33258;&#21160;&#36873;&#25321;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#24212;&#29992;&#20102;&#20154;&#24037;&#25130;&#26029;&#30340;&#20284;&#28982;&#36129;&#29486;&#26426;&#21046;&#26469;&#20943;&#23569;&#20272;&#35745;&#38454;&#27573;&#30340;&#29305;&#23450;&#38382;&#39064;&#12290;&#25105;&#20204;&#22312;&#19968;&#20010;&#27169;&#25311;&#30740;&#31350;&#20013;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#25512;&#26029;&#26041;&#38754;&#20248;&#20110;&#20256;&#32479;&#30340;&#23792;&#20540;&#36229;&#36807;&#38408;&#20540;&#26041;&#27861;&#12290;&#22312;&#23454;&#35777;&#26041;&#38754;&#65292;&#25105;&#20204;&#21033;&#29992;1994&#24180;1&#26376;&#33267;2018&#24180;12&#26376;&#30340;1,484&#21482;&#36991;&#38505;&#22522;&#37329;&#30340;&#27719;&#24635;&#22238;&#25253;&#65292;&#30740;&#31350;&#36991;&#38505;&#22522;&#37329;&#23614;&#37096;&#39118;&#38505;&#30340;&#20915;&#23450;&#22240;&#32032;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a method to estimate simultaneously the tail and the threshold parameters of an extreme value regression model. This standard model finds its use in finance to assess the effect of market variables on extreme loss distributions of investment vehicles such as hedge funds. However, a major limitation is the need to select ex ante a threshold below which data are discarded, leading to estimation inefficiencies. To solve these issues, we extend the tail regression model to non-tail observations with an auxiliary splicing density, enabling the threshold to be selected automatically. We then apply an artificial censoring mechanism of the likelihood contributions in the bulk of the data to decrease specification issues at the estimation stage. We illustrate the superiority of our approach for inference over classical peaks-over-threshold methods in a simulation study. Empirically, we investigate the determinants of hedge fund tail risks over time, using pooled returns of 1,484 he
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#37319;&#29992;&#40065;&#26834;&#24615;&#26041;&#27861;&#22788;&#29702;&#20102;&#19968;&#31867;&#36830;&#32493;&#26102;&#38388;&#19979;&#30340;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#65292;&#20854;&#20013;&#25237;&#36164;&#32773;&#38754;&#20020;&#19968;&#20010;&#26410;&#30693;&#27010;&#29575;&#20998;&#24067;&#30340;&#20250;&#35745;&#26222;&#36890;&#32929;&#20215;&#20540;&#12290;&#36890;&#36807;&#24212;&#29992;&#20998;&#20301;&#25968;&#20844;&#24335;&#65292;&#23558;&#26368;&#20248;&#32456;&#31471;&#25237;&#36164;&#25910;&#20837;&#30340;&#20998;&#20301;&#20989;&#25968;&#34920;&#31034;&#20026;&#26576;&#20123;&#26222;&#36890;&#24494;&#20998;&#26041;&#31243;&#21464;&#20998;&#19981;&#31561;&#24335;&#30340;&#35299;&#12290;&#23545;&#20110;&#25351;&#25968;&#25928;&#29992;&#26469;&#35828;&#65292;&#35813;&#38382;&#39064;&#31616;&#21270;&#20026;&#20855;&#26377;&#27010;&#29575;&#25197;&#26354;&#30340;&#65288;&#38750;&#40065;&#26834;&#24615;&#65289;&#25490;&#21517;&#20381;&#36182;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#65292;&#20854;&#35299;&#22312;&#25991;&#29486;&#20013;&#24050;&#26377;&#12290;</title><link>http://arxiv.org/abs/2304.06938</link><description>&lt;p&gt;
&#40065;&#26834;&#24615;&#21069;&#26223;&#19979;&#26080;&#27861;&#35745;&#31639;&#32034;&#36180;&#30340;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Robust utility maximization with intractable claims. (arXiv:2304.06938v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.06938
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#37319;&#29992;&#40065;&#26834;&#24615;&#26041;&#27861;&#22788;&#29702;&#20102;&#19968;&#31867;&#36830;&#32493;&#26102;&#38388;&#19979;&#30340;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#65292;&#20854;&#20013;&#25237;&#36164;&#32773;&#38754;&#20020;&#19968;&#20010;&#26410;&#30693;&#27010;&#29575;&#20998;&#24067;&#30340;&#20250;&#35745;&#26222;&#36890;&#32929;&#20215;&#20540;&#12290;&#36890;&#36807;&#24212;&#29992;&#20998;&#20301;&#25968;&#20844;&#24335;&#65292;&#23558;&#26368;&#20248;&#32456;&#31471;&#25237;&#36164;&#25910;&#20837;&#30340;&#20998;&#20301;&#20989;&#25968;&#34920;&#31034;&#20026;&#26576;&#20123;&#26222;&#36890;&#24494;&#20998;&#26041;&#31243;&#21464;&#20998;&#19981;&#31561;&#24335;&#30340;&#35299;&#12290;&#23545;&#20110;&#25351;&#25968;&#25928;&#29992;&#26469;&#35828;&#65292;&#35813;&#38382;&#39064;&#31616;&#21270;&#20026;&#20855;&#26377;&#27010;&#29575;&#25197;&#26354;&#30340;&#65288;&#38750;&#40065;&#26834;&#24615;&#65289;&#25490;&#21517;&#20381;&#36182;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#65292;&#20854;&#35299;&#22312;&#25991;&#29486;&#20013;&#24050;&#26377;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#31867;&#36830;&#32493;&#26102;&#38388;&#19979;&#30340;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#65292;&#20854;&#20013;&#25237;&#36164;&#32773;&#22312;&#21040;&#26399;&#26102;&#25910;&#21040;&#20102;&#37329;&#34701;&#24066;&#22330;&#25237;&#36164;&#22238;&#25253;&#20197;&#21450;&#26576;&#20010;&#26410;&#30693;&#27010;&#29575;&#20998;&#24067;&#30340;&#20250;&#35745;&#26222;&#36890;&#32929;&#20215;&#20540;&#65292;&#21363;&#25152;&#35859;&#30340;&#8220;&#26080;&#27861;&#35745;&#31639;&#32034;&#36180;&#8221;&#12290;&#22240;&#20026;&#32570;&#20047;&#20851;&#20110;&#32034;&#36180;&#30340;&#20449;&#24687;&#65292;&#25105;&#20204;&#37319;&#29992;&#40065;&#26834;&#24615;&#26041;&#27861;&#26469;&#26368;&#22823;&#21270;&#25237;&#36164;&#32773;&#22312;&#26368;&#22351;&#24773;&#20917;&#19979;&#30340;&#25928;&#29992;&#12290;&#25105;&#20204;&#21033;&#29992;&#20998;&#20301;&#25968;&#20844;&#24335;&#26469;&#35299;&#20915;&#35813;&#38382;&#39064;&#65292;&#24182;&#23558;&#26368;&#20248;&#32456;&#31471;&#25237;&#36164;&#25910;&#20837;&#30340;&#20998;&#20301;&#20989;&#25968;&#34920;&#31034;&#20026;&#26576;&#20123;&#26222;&#36890;&#24494;&#20998;&#26041;&#31243;&#21464;&#20998;&#19981;&#31561;&#24335;&#30340;&#35299;&#12290;&#23545;&#20110;&#25351;&#25968;&#25928;&#29992;&#26469;&#35828;&#65292;&#35813;&#38382;&#39064;&#31616;&#21270;&#20026;&#20855;&#26377;&#27010;&#29575;&#25197;&#26354;&#30340;&#65288;&#38750;&#40065;&#26834;&#24615;&#65289;&#25490;&#21517;&#20381;&#36182;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#65292;&#20854;&#35299;&#22312;&#25991;&#29486;&#20013;&#24050;&#26377;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a continuous-time expected utility maximization problem in which the investor at maturity receives the value of a contingent claim in addition to the investment payoff from the financial market. The investor knows nothing about the claim other than its probability distribution, hence an ``intractable claim''. In view of the lack of necessary information about the claim, we consider a robust formulation to maximize her utility in the worst scenario. We apply the quantile formulation to solve the problem, expressing the quantile function of the optimal terminal investment income as the solution of certain variational inequalities of ordinary differential equations. In the case of an exponential utility, the problem reduces to a (non-robust) rank--dependent utility maximization with probability distortion whose solution is available in the literature.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#22522;&#20110;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#21644;Log-Periodic Power Law Singularity&#65288;LPPLS&#65289;&#27169;&#22411;&#65292;&#24314;&#35758;&#20351;&#29992;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#26469;&#26816;&#27979;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#37325;&#35201;&#36716;&#25240;&#12290;&#20316;&#32773;&#22312;&#27604;&#29305;&#24065;&#21382;&#21490;&#20215;&#26684;&#30340;&#27491;&#36127;&#27873;&#27819;&#26679;&#26412;&#19978;&#36827;&#34892;&#20102;&#24212;&#29992;&#23454;&#35777;&#12290;</title><link>http://arxiv.org/abs/2304.06877</link><description>&lt;p&gt;
&#20026;&#20160;&#20040;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#21487;&#20197;&#26816;&#27979;&#21040;&#37329;&#34701;&#27873;&#27819;&#65311;
&lt;/p&gt;
&lt;p&gt;
Why Topological Data Analysis Detects Financial Bubbles?. (arXiv:2304.06877v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.06877
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#22522;&#20110;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#21644;Log-Periodic Power Law Singularity&#65288;LPPLS&#65289;&#27169;&#22411;&#65292;&#24314;&#35758;&#20351;&#29992;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#26469;&#26816;&#27979;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#37325;&#35201;&#36716;&#25240;&#12290;&#20316;&#32773;&#22312;&#27604;&#29305;&#24065;&#21382;&#21490;&#20215;&#26684;&#30340;&#27491;&#36127;&#27873;&#27819;&#26679;&#26412;&#19978;&#36827;&#34892;&#20102;&#24212;&#29992;&#23454;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21551;&#21457;&#24335;&#35770;&#25454;&#65292;&#29992;&#20110;&#35299;&#37322;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#65288;TDA&#65289;&#26816;&#27979;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#20013;&#20851;&#38190;&#36716;&#25240;&#30340;&#20542;&#21521;&#12290;&#25105;&#20204;&#30340;&#35770;&#25454;&#22522;&#20110;Log-Periodic Power Law Singularity&#65288;LPPLS&#65289;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#23558;&#37329;&#34701;&#27873;&#27819;&#25551;&#36848;&#20026;&#36164;&#20135;&#20215;&#26684;&#30340;&#36229;&#25351;&#25968;&#22686;&#38271;&#65288;&#25110;&#34928;&#20943;&#65289;&#65292;&#24182;&#21472;&#21152;&#19978;&#25391;&#33633;&#65292;&#24403;&#25509;&#36817;&#20020;&#30028;&#36716;&#25240;&#65288;&#20020;&#30028;&#28857;&#65289;&#26102;&#65292;&#25391;&#33633;&#30340;&#39057;&#29575;&#22686;&#21152;&#32780;&#25391;&#24133;&#20943;&#23567;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#27599;&#24403;LPPLS&#27169;&#22411;&#19982;&#25968;&#25454;&#25311;&#21512;&#26102;&#65292;TDA&#20250;&#29983;&#25104;&#26089;&#26399;&#39044;&#35686;&#20449;&#21495;&#12290;&#20316;&#20026;&#24212;&#29992;&#65292;&#25105;&#20204;&#22312;&#27604;&#29305;&#24065;&#21382;&#21490;&#20215;&#26684;&#30340;&#27491;&#36127;&#27873;&#27819;&#26679;&#26412;&#19978;&#35828;&#26126;&#20102;&#36825;&#31181;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a heuristic argument for the propensity of Topological Data Analysis (TDA) to detect early warning signals of critical transitions in financial time series. Our argument is based on the Log-Periodic Power Law Singularity (LPPLS) model, which characterizes financial bubbles as super-exponential growth (or decay) of an asset price superimposed with oscillations increasing in frequency and decreasing in amplitude when approaching a critical transition (tipping point). We show that whenever the LPPLS model is fitting with the data, TDA generates early warning signals. As an application, we illustrate this approach on a sample of positive and negative bubbles in the Bitcoin historical price.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#8220;&#33258;&#28982;&#32852;&#21512;&#20989;&#25968;&#8221;&#30340;&#27010;&#24565;&#65292;&#21487;&#36890;&#36807;&#32447;&#24615;&#35268;&#21010;&#26041;&#27861;&#36827;&#34892;&#31616;&#21333;&#20272;&#35745;&#65292;&#22312;&#37329;&#34701;&#32463;&#27982;&#23398;&#20013;&#20855;&#26377;&#24212;&#29992;&#28508;&#21147;&#12290;</title><link>http://arxiv.org/abs/2304.06859</link><description>&lt;p&gt;
&#19968;&#31181;&#33258;&#28982;&#30340;&#32852;&#21512;&#20989;&#25968;
&lt;/p&gt;
&lt;p&gt;
A Natural Copula. (arXiv:2304.06859v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.06859
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#8220;&#33258;&#28982;&#32852;&#21512;&#20989;&#25968;&#8221;&#30340;&#27010;&#24565;&#65292;&#21487;&#36890;&#36807;&#32447;&#24615;&#35268;&#21010;&#26041;&#27861;&#36827;&#34892;&#31616;&#21333;&#20272;&#35745;&#65292;&#22312;&#37329;&#34701;&#32463;&#27982;&#23398;&#20013;&#20855;&#26377;&#24212;&#29992;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32852;&#21512;&#20989;&#25968;&#22312;&#37329;&#34701;&#32463;&#27982;&#23398;&#20197;&#21450;&#20854;&#20182;&#24212;&#29992;&#25968;&#23398;&#39046;&#22495;&#24191;&#27867;&#20351;&#29992;&#65292;&#20294;&#36873;&#25321;&#32852;&#21512;&#20989;&#25968;&#26102;&#23384;&#22312;&#24456;&#22823;&#30340;&#27494;&#26029;&#24615;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#8220;&#33258;&#28982;&#32852;&#21512;&#20989;&#25968;&#8221;&#30340;&#27010;&#24565;&#65292;&#35813;&#20989;&#25968;&#23558;&#20004;&#20010;&#20998;&#24067;&#23884;&#20837;&#21040;&#26576;&#20010;&#31354;&#38388;&#20013;&#65292;&#20351;&#23427;&#20204;&#20043;&#38388;&#30340;Wasserstein&#36317;&#31163;&#26368;&#23567;&#21270;&#12290;&#25991;&#20013;&#23545;&#23427;&#30340;&#36755;&#36816;&#24615;&#36136;&#21644;&#27969;&#20307;&#21147;&#23398;&#35299;&#37322;&#36827;&#34892;&#20102;&#25506;&#35752;&#65292;&#24182;&#32473;&#20986;&#20102;&#20004;&#20010;&#20855;&#26377;&#37329;&#34701;&#24847;&#20041;&#30340;&#20998;&#24067;&#23454;&#20363;&#12290;&#33258;&#28982;&#32852;&#21512;&#20989;&#25968;&#21487;&#20197;&#36890;&#36807;&#32447;&#24615;&#35268;&#21010;&#26041;&#27861;&#36827;&#34892;&#31616;&#26126;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
Copulas are widely used in financial economics as well as in other areas of applied mathematics. Yet, there is much arbitrariness in their choice. The author proposes "a natural copula" concept, which minimizes Wasserstein distance between distributions in some space, in which both these distributions are embedded. Transport properties and hydrodynamic interpretation are discussed with two examples of distributions of financial significance. A natural copula can be parsimoniously estimated by the methods of linear programming.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#34920;&#26126;&#38750;&#24179;&#20961;&#30340;&#26080;&#24847;&#35782;&#29366;&#24577;&#19982;&#30693;&#35782;&#30340;&#8220;&#24517;&#28982;&#24615;&#8221;&#24615;&#36136;&#30456;&#30683;&#30462;&#65292;&#20462;&#35746;&#21518;&#30340;&#8220;&#24517;&#28982;&#24615;&#8221;&#35299;&#20915;&#20102;&#32463;&#20856;&#30340;&#8220;Dekel-Lipman-Rustichini&#8221;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#33021;&#36866;&#29992;&#20110;&#26080;&#38480;&#29366;&#24577;&#31354;&#38388;&#30340;&#26080;&#24847;&#35782;&#26631;&#20934;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2304.04626</link><description>&lt;p&gt;
&#26080;&#24847;&#35782;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#35770;&#26512;
&lt;/p&gt;
&lt;p&gt;
On the state-space model of unawareness. (arXiv:2304.04626v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.04626
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#34920;&#26126;&#38750;&#24179;&#20961;&#30340;&#26080;&#24847;&#35782;&#29366;&#24577;&#19982;&#30693;&#35782;&#30340;&#8220;&#24517;&#28982;&#24615;&#8221;&#24615;&#36136;&#30456;&#30683;&#30462;&#65292;&#20462;&#35746;&#21518;&#30340;&#8220;&#24517;&#28982;&#24615;&#8221;&#35299;&#20915;&#20102;&#32463;&#20856;&#30340;&#8220;Dekel-Lipman-Rustichini&#8221;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#33021;&#36866;&#29992;&#20110;&#26080;&#38480;&#29366;&#24577;&#31354;&#38388;&#30340;&#26080;&#24847;&#35782;&#26631;&#20934;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#34920;&#26126;&#65292;&#25215;&#36733;&#38750;&#24179;&#20961;&#26080;&#24847;&#35782;&#30340;&#26234;&#33021;&#20307;&#30693;&#35782;&#36829;&#21453;&#20102;&#8220;&#24517;&#28982;&#24615;&#8221;&#30340;&#26631;&#20934;&#23646;&#24615;&#65292;&#22240;&#27492;&#8220;&#24517;&#28982;&#24615;&#8221;&#19981;&#33021;&#29992;&#26469;&#21453;&#39539;&#26631;&#20934;&#30340;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#12290;&#32463;&#20462;&#35746;&#21518;&#30340;&#8220;&#24517;&#28982;&#24615;&#8221;&#20445;&#30041;&#20102;&#38750;&#24179;&#20961;&#26080;&#24847;&#35782;&#65292;&#24182;&#35299;&#20915;&#20102;&#32463;&#20856;&#30340; Dekel-Lipman-Rustichini &#32467;&#26524;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;&#30693;&#35782;&#25805;&#20316;&#31526;&#65292;&#19982;&#26080;&#24847;&#35782;&#30340;&#26631;&#20934;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#19968;&#33268;&#65292;&#21253;&#25324;&#26080;&#38480;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
We show that the knowledge of an agent carrying non-trivial unawareness violates the standard property of 'necessitation', therefore necessitation cannot be used to refute the standard state-space model. A revised version of necessitation preserves non-trivial unawareness and solves the classical Dekel-Lipman-Rustichini result. We propose a generalised knowledge operator consistent with the standard state-space model of unawareness, including the model of infinite state-space.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;&#32844;&#19994;&#22260;&#26827;&#36873;&#25163;&#30340;&#31227;&#21160;&#20915;&#31574;&#21457;&#29616;&#65292;&#22312;&#36229;&#20154;&#24037;&#26234;&#33021;&#38382;&#19990;&#21518;&#65292;&#20154;&#31867;&#24320;&#22987;&#20570;&#20986;&#26174;&#33879;&#26356;&#22909;&#30340;&#20915;&#31574;&#65292;&#24182;&#19988;&#26032;&#39062;&#30340;&#20915;&#31574;&#26356;&#39057;&#32321;&#22320;&#21457;&#29983;&#65292;&#21487;&#33021;&#24847;&#21619;&#30528;&#36229;&#20154;&#24037;&#26234;&#33021;&#30340;&#21457;&#23637;&#21487;&#20197;&#25913;&#21464;&#20154;&#31867;&#30340;&#20915;&#31574;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2303.07462</link><description>&lt;p&gt;
&#36229;&#20154;&#24037;&#26234;&#33021;&#21487;&#20197;&#36890;&#36807;&#22686;&#21152;&#26032;&#22855;&#24615;&#26469;&#25913;&#36827;&#20154;&#31867;&#20915;&#31574;&#30340;&#33021;&#21147;
&lt;/p&gt;
&lt;p&gt;
Superhuman Artificial Intelligence Can Improve Human Decision Making by Increasing Novelty. (arXiv:2303.07462v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.07462
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;&#32844;&#19994;&#22260;&#26827;&#36873;&#25163;&#30340;&#31227;&#21160;&#20915;&#31574;&#21457;&#29616;&#65292;&#22312;&#36229;&#20154;&#24037;&#26234;&#33021;&#38382;&#19990;&#21518;&#65292;&#20154;&#31867;&#24320;&#22987;&#20570;&#20986;&#26174;&#33879;&#26356;&#22909;&#30340;&#20915;&#31574;&#65292;&#24182;&#19988;&#26032;&#39062;&#30340;&#20915;&#31574;&#26356;&#39057;&#32321;&#22320;&#21457;&#29983;&#65292;&#21487;&#33021;&#24847;&#21619;&#30528;&#36229;&#20154;&#24037;&#26234;&#33021;&#30340;&#21457;&#23637;&#21487;&#20197;&#25913;&#21464;&#20154;&#31867;&#30340;&#20915;&#31574;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36229;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#23558;&#22914;&#20309;&#24433;&#21709;&#20154;&#31867;&#20915;&#31574;&#65292;&#24182;&#19988;&#26377;&#21738;&#20123;&#26426;&#21046;&#21487;&#29992;&#20110;&#25903;&#25345;&#36825;&#31181;&#24433;&#21709;&#65311;&#25105;&#20204;&#22312;&#19968;&#20010;&#39046;&#22495;&#20013;&#22238;&#31572;&#20102;&#36825;&#20123;&#38382;&#39064;&#65292;&#35813;&#39046;&#22495;&#30340;AI&#24050;&#32463;&#36229;&#36807;&#20102;&#20154;&#31867;&#30340;&#34920;&#29616;&#65292;&#20998;&#26512;&#20102;&#36807;&#21435;71&#24180;&#65288;1950-2021&#65289;&#32844;&#19994;&#22260;&#26827;&#36873;&#25163;&#25152;&#20570;&#30340;&#36229;&#36807;580&#19975;&#20010;&#31227;&#21160;&#20915;&#31574;&#12290;&#20026;&#20102;&#22238;&#31572;&#31532;&#19968;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;&#19968;&#20010;&#36229;&#20154;&#24037;&#26234;&#33021;&#31243;&#24207;&#26469;&#20272;&#35745;&#38543;&#26102;&#38388;&#21464;&#21270;&#30340;&#20154;&#31867;&#20915;&#31574;&#36136;&#37327;&#65292;&#29983;&#25104;&#20102;580&#20159;&#20010;&#21453;&#20107;&#23454;&#30340;&#28216;&#25103;&#27169;&#24335;&#65292;&#24182;&#23558;&#23454;&#38469;&#20154;&#31867;&#20915;&#31574;&#30340;&#32988;&#29575;&#19982;&#21453;&#20107;&#23454;&#30340;AI&#20915;&#31574;&#30340;&#32988;&#29575;&#36827;&#34892;&#27604;&#36739;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#36229;&#20154;&#24037;&#26234;&#33021;&#38382;&#19990;&#21518;&#65292;&#20154;&#31867;&#24320;&#22987;&#20570;&#20986;&#26174;&#33879;&#26356;&#22909;&#30340;&#20915;&#31574;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#22312;&#26102;&#38388;&#19978;&#26816;&#26597;&#20102;&#20154;&#31867;&#29609;&#23478;&#30340;&#31574;&#30053;&#65292;&#24182;&#21457;&#29616;&#22312;&#36229;&#20154;&#24037;&#26234;&#33021;&#38382;&#19990;&#21518;&#65292;&#26032;&#39062;&#30340;&#20915;&#31574;&#65288;&#21363;&#20197;&#21069;&#26410;&#35266;&#23519;&#21040;&#30340;&#31227;&#21160;&#65289;&#26356;&#39057;&#32321;&#22320;&#21457;&#29983;&#65292;&#24182;&#19982;&#26356;&#39640;&#30340;&#20915;&#31574;&#36136;&#37327;&#30456;&#20851;&#32852;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#36229;&#20154;&#24037;&#26234;&#33021;&#31243;&#24207;&#30340;&#21457;&#23637;&#21487;&#33021;&#20250;&#25913;&#21464;&#20154;&#31867;&#30340;&#20915;&#31574;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
How will superhuman artificial intelligence (AI) affect human decision making? And what will be the mechanisms behind this effect? We address these questions in a domain where AI already exceeds human performance, analyzing more than 5.8 million move decisions made by professional Go players over the past 71 years (1950-2021). To address the first question, we use a superhuman AI program to estimate the quality of human decisions across time, generating 58 billion counterfactual game patterns and comparing the win rates of actual human decisions with those of counterfactual AI decisions. We find that humans began to make significantly better decisions following the advent of superhuman AI. We then examine human players' strategies across time and find that novel decisions (i.e., previously unobserved moves) occurred more frequently and became associated with higher decision quality after the advent of superhuman AI. Our findings suggest that the development of superhuman AI programs ma
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23454;&#29616;&#21033;&#29575;&#27169;&#22411;&#20013;&#26412;&#22320;&#27874;&#21160;&#29575;&#30340;&#26032;&#26041;&#27861;&#65292;&#24182;&#22312;&#33945;&#29305;&#21345;&#32599;&#35745;&#31639;&#20013;&#24212;&#29992;&#12290;&#35813;&#26041;&#27861;&#24456;&#26377;&#25928;&#65292;&#20294;&#22312;&#30701;&#26399;&#21644;&#20302;&#26399;&#38480;&#20114;&#25442;&#20013;&#23384;&#22312;&#23450;&#20215;&#38169;&#35823;&#12290;</title><link>http://arxiv.org/abs/2301.13595</link><description>&lt;p&gt;
&#21033;&#29575;&#27169;&#22411;&#20013;&#30340;&#26412;&#22320;&#27874;&#21160;&#29575;
&lt;/p&gt;
&lt;p&gt;
Local Volatility in Interest Rate Models. (arXiv:2301.13595v2 [q-fin.PR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.13595
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23454;&#29616;&#21033;&#29575;&#27169;&#22411;&#20013;&#26412;&#22320;&#27874;&#21160;&#29575;&#30340;&#26032;&#26041;&#27861;&#65292;&#24182;&#22312;&#33945;&#29305;&#21345;&#32599;&#35745;&#31639;&#20013;&#24212;&#29992;&#12290;&#35813;&#26041;&#27861;&#24456;&#26377;&#25928;&#65292;&#20294;&#22312;&#30701;&#26399;&#21644;&#20302;&#26399;&#38480;&#20114;&#25442;&#20013;&#23384;&#22312;&#23450;&#20215;&#38169;&#35823;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#21033;&#29575;&#27169;&#22411;&#20013;&#23454;&#29616;&#26412;&#22320;&#27874;&#21160;&#29575;&#30340;&#26032;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#30340;&#20027;&#35201;&#24037;&#20855;&#26159;&#23567;&#27874;&#21160;&#29575;&#36817;&#20284;&#12290;&#27492;&#36817;&#20284;&#26041;&#27861;&#38750;&#24120;&#26377;&#25928;&#65292;&#21487;&#20197;&#29992;&#20110;&#26657;&#20934;&#25152;&#26377;&#24179;&#20540;&#20114;&#25442;&#12290;&#23427;&#24555;&#36895;&#21448;&#31934;&#30830;&#12290;&#20026;&#20102;&#37325;&#29616;&#25152;&#26377;&#21487;&#29992;&#30340;&#20114;&#25442;&#20215;&#26684;&#65292;&#25105;&#20204;&#38656;&#35201;&#32771;&#34385;&#27491;&#21521;&#27874;&#21160;&#29575;&#23545;&#24403;&#21069;&#20114;&#25442;&#29575;&#30340;&#20381;&#36182;&#24615;&#12290;&#22312;&#27492;&#65292;&#25105;&#20204;&#20551;&#35774;&#27491;&#21521;&#27874;&#21160;&#29575;&#26159;&#19968;&#20010;&#30830;&#23450;&#24615;&#20989;&#25968;&#65292;&#20855;&#26377;&#22312;&#32593;&#26684;&#19978;&#30340;&#27599;&#19968;&#28857;&#19978;&#30340;&#34892;&#26435;&#20215;&#26684;&#12289;&#21040;&#26399;&#26102;&#38388;&#21644;&#21040;&#26399;&#26102;&#38388;&#30340;&#20915;&#23450;&#12290;&#25105;&#20204;&#30830;&#23450;&#36825;&#20123;&#20989;&#25968;&#24182;&#23558;&#23427;&#20204;&#24212;&#29992;&#20110;&#33945;&#29305;&#21345;&#32599;&#35745;&#31639;&#20013;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#36825;&#31181;&#26041;&#27861;&#36816;&#34892;&#33391;&#22909;&#12290;&#28982;&#32780;&#65292;&#22312;&#30701;&#26399;&#21644;&#20302;&#26399;&#38480;&#20114;&#25442;&#20013;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;&#20114;&#25442;&#23450;&#20215;&#38169;&#35823;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#38656;&#35201;&#20462;&#25913;&#22330;&#26223;&#29983;&#25104;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;
A new approach to Local Volatility implementation in the interest rate model is presented. The major tool of this approach is a small volatility approximation. This approximation works very well and it can be used to calibrate all ATM swaptions. It works fast and accurate. In order to reproduce all available swaption prices we need to take into account the dependence of forward volatility on the current swap rate. Here we assume that forward volatility is a deterministic function on strike, tenor, and expiration at every point on the grid. We determine these functions and apply them in Monte-Carlo calculations. It was demonstrated that this approach works well. However, in the case of short term and low tenor swaptions we observed errors in swaption pricing. To fix this problem we need to modify the scenario generation process.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#25506;&#32034;&#20102;&#25237;&#36164;&#32463;&#29702;&#22312;&#32511;&#33394;&#21644;&#26837;&#33394;&#32929;&#31080;&#20013;&#37096;&#32626;&#20854;&#25165;&#33021;&#30340;&#38590;&#26131;&#31243;&#24230;&#12290;&#26681;&#25454; 2014-2020 &#24180; S&amp;P 500 &#25351;&#25968;&#20844;&#21496;&#24182;&#20197;&#20844;&#21496;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#27700;&#24179;&#20026;&#22522;&#30784;&#23450;&#20041;&#21516;&#34892;&#32452;&#65292;&#25105;&#20204;&#21457;&#29616;&#24179;&#22343;&#32422; 20% &#30340;&#32929;&#31080;&#20174;&#20854;&#21516;&#34892;&#20013;&#20197;&#26410;&#26469;&#32489;&#25928;&#21306;&#20998;&#20986;&#33258;&#25105;&#65292;&#20854;&#20013;&#26837;&#33394;&#32929;&#31080;&#30340;&#26426;&#20250;&#38598;&#26102;&#21464;&#24615;&#26356;&#39640;&#12290;&#32489;&#25928;&#24322;&#36136;&#24615;&#38543;&#26102;&#38388;&#38477;&#20302;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#32511;&#33394;&#32929;&#31080;&#65292;&#36825;&#24847;&#21619;&#30528;&#22312;&#36873;&#25321;&#20302;&#28201;&#23460;&#27668;&#20307;&#24378;&#24230;&#32929;&#31080;&#26102;&#65292;&#25237;&#36164;&#32463;&#29702;&#29616;&#22312;&#26356;&#38590;&#37096;&#32626;&#20854;&#25216;&#33021;&#12290;</title><link>http://arxiv.org/abs/2201.05709</link><description>&lt;p&gt;
&#25237;&#36164;&#32463;&#29702;&#22312;&#32511;&#33394;&#21644;&#26837;&#33394;&#32929;&#31080;&#20013;&#37096;&#32626;&#20854;&#25165;&#33021;&#26377;&#22810;&#23481;&#26131;&#65311;
&lt;/p&gt;
&lt;p&gt;
How easy is it for investment managers to deploy their talent in green and brown stocks?. (arXiv:2201.05709v2 [q-fin.PM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.05709
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#25506;&#32034;&#20102;&#25237;&#36164;&#32463;&#29702;&#22312;&#32511;&#33394;&#21644;&#26837;&#33394;&#32929;&#31080;&#20013;&#37096;&#32626;&#20854;&#25165;&#33021;&#30340;&#38590;&#26131;&#31243;&#24230;&#12290;&#26681;&#25454; 2014-2020 &#24180; S&amp;P 500 &#25351;&#25968;&#20844;&#21496;&#24182;&#20197;&#20844;&#21496;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#27700;&#24179;&#20026;&#22522;&#30784;&#23450;&#20041;&#21516;&#34892;&#32452;&#65292;&#25105;&#20204;&#21457;&#29616;&#24179;&#22343;&#32422; 20% &#30340;&#32929;&#31080;&#20174;&#20854;&#21516;&#34892;&#20013;&#20197;&#26410;&#26469;&#32489;&#25928;&#21306;&#20998;&#20986;&#33258;&#25105;&#65292;&#20854;&#20013;&#26837;&#33394;&#32929;&#31080;&#30340;&#26426;&#20250;&#38598;&#26102;&#21464;&#24615;&#26356;&#39640;&#12290;&#32489;&#25928;&#24322;&#36136;&#24615;&#38543;&#26102;&#38388;&#38477;&#20302;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#32511;&#33394;&#32929;&#31080;&#65292;&#36825;&#24847;&#21619;&#30528;&#22312;&#36873;&#25321;&#20302;&#28201;&#23460;&#27668;&#20307;&#24378;&#24230;&#32929;&#31080;&#26102;&#65292;&#25237;&#36164;&#32463;&#29702;&#29616;&#22312;&#26356;&#38590;&#37096;&#32626;&#20854;&#25216;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20351;&#29992; Ardia &#21644; Boudt (2018) &#30340;&#21516;&#34892;&#32489;&#25928;&#27604;&#29575;&#25506;&#32034;&#32511;&#33394;&#21644;&#26837;&#33394;&#32929;&#31080;&#25237;&#36164;&#32452;&#21512;&#20013;&#23454;&#29616;&#30340;&#945;-&#32489;&#25928;&#24322;&#36136;&#24615;&#12290;&#38024;&#23545; 2014-2020 &#24180;&#38388; S&amp;P 500 &#25351;&#25968;&#20844;&#21496;&#24182;&#20197;&#20844;&#21496;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#27700;&#24179;&#20026;&#22522;&#30784;&#23450;&#20041;&#21516;&#34892;&#32452;&#65292;&#25105;&#20204;&#21457;&#29616;&#24179;&#22343;&#32422; 20% &#30340;&#32929;&#31080;&#20174;&#20854;&#21516;&#34892;&#20013;&#20197;&#26410;&#26469;&#32489;&#25928;&#21306;&#20998;&#20986;&#33258;&#25105;&#12290;&#25105;&#20204;&#30475;&#21040;&#36825;&#31181;&#26426;&#20250;&#38598;&#22312;&#26837;&#33394;&#32929;&#31080;&#20013;&#30340;&#26102;&#21464;&#24615;&#35201;&#39640;&#24471;&#22810;&#12290;&#27492;&#22806;&#65292;&#32489;&#25928;&#24322;&#36136;&#24615;&#38543;&#26102;&#38388;&#38477;&#20302;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#32511;&#33394;&#32929;&#31080;&#65292;&#36825;&#24847;&#21619;&#30528;&#22312;&#36873;&#25321;&#20302;&#28201;&#23460;&#27668;&#20307;&#24378;&#24230;&#32929;&#31080;&#26102;&#65292;&#25237;&#36164;&#32463;&#29702;&#29616;&#22312;&#26356;&#38590;&#37096;&#32626;&#20854;&#25216;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
We explore the realized alpha-performance heterogeneity in green and brown stocks' universes using the peer performance ratios of Ardia and Boudt (2018). Focusing on S&amp;P 500 index firms over 2014-2020 and defining peer groups in terms of firms' greenhouse gas emission levels, we find that, on average, about 20% of the stocks differentiate themselves from their peers in terms of future performance. We see a much higher time-variation in this opportunity set within brown stocks. Furthermore, the performance heterogeneity has decreased over time, especially for green stocks, implying that it is now more difficult for investment managers to deploy their skills when choosing among low-GHG intensity stocks.
&lt;/p&gt;</description></item></channel></rss>