<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Tree-LTC&#30340;&#39640;&#25928;&#21644;&#21487;&#38752;&#30340;&#26641;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#20855;&#26377;LTC&#25903;&#20184;&#21644;GLWB&#30340;&#21487;&#21464;&#24180;&#37329;&#21512;&#21516;&#30340;&#23450;&#20215;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2404.02858</link><description>&lt;p&gt;
&#23551;&#38505;&#24180;&#37329;&#65306;&#22686;&#24378;&#20135;&#21697;&#21151;&#33021;&#24182;&#23436;&#21892;&#23450;&#20215;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
The Life Care Annuity: enhancing product features and refining pricing methods
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02858
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Tree-LTC&#30340;&#39640;&#25928;&#21644;&#21487;&#38752;&#30340;&#26641;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#20855;&#26377;LTC&#25903;&#20184;&#21644;GLWB&#30340;&#21487;&#21464;&#24180;&#37329;&#21512;&#21516;&#30340;&#23450;&#20215;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20026;&#20855;&#26377;LTC&#25903;&#20184;&#21644;GLWB&#30340;&#21487;&#21464;&#24180;&#37329;&#21512;&#21516;&#25552;&#20379;&#20102;&#26356;&#36890;&#29992;&#30340;&#29305;&#24615;&#65292;&#24182;&#23436;&#21892;&#20102;&#20854;&#23450;&#20215;&#26041;&#27861;&#12290;&#29305;&#21035;&#26159;&#65292;&#22312;&#20135;&#21697;&#29305;&#24615;&#26041;&#38754;&#65292;&#25105;&#20204;&#20801;&#35768;&#21160;&#24577;&#25552;&#21462;&#31574;&#30053;&#65292;&#21253;&#25324;&#25237;&#38477;&#36873;&#39033;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#32771;&#34385;&#38543;&#26426;&#21033;&#29575;&#65292;&#30001;Cox-Ingersoll-Ross&#65288;CIR&#65289;&#36807;&#31243;&#25551;&#36848;&#12290;&#33267;&#20110;&#25968;&#20540;&#26041;&#27861;&#65292;&#25105;&#20204;&#36890;&#36807;&#19968;&#20010;&#31283;&#20581;&#30340;&#26641;&#26041;&#27861;&#35299;&#20915;&#20102;&#28041;&#21450;&#36890;&#36807;&#36873;&#25321;&#26368;&#20339;&#25552;&#21462;&#31574;&#30053;&#32780;&#28041;&#21450;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#12290;&#25105;&#20204;&#20351;&#29992;&#36825;&#31181;&#26041;&#27861;&#26469;&#20272;&#35745;&#20135;&#21697;&#30340;&#20844;&#24179;&#20215;&#26684;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#25968;&#20540;&#32467;&#26524;&#26174;&#31034;&#20102;&#26368;&#20339;&#25552;&#21462;&#31574;&#30053;&#22914;&#20309;&#38543;&#30528;&#25237;&#20445;&#20154;&#30340;&#20581;&#24247;&#29366;&#20917;&#32780;&#38543;&#26102;&#38388;&#21464;&#21270;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#26641;&#26041;&#27861;&#65292;&#25105;&#20204;&#21629;&#21517;&#20026;Tree-LTC&#65292;&#22312;&#19982;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#36827;&#34892;&#23545;&#27604;&#26102;&#35777;&#26126;&#26159;&#39640;&#25928;&#19988;&#21487;&#38752;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02858v1 Announce Type: new  Abstract: In this paper we provide more general features for the variable annuity contract with LTC payouts and GLWB proposed by the state-of-the-art and we refine its pricing methods. In particular, as to product features, we allow dynamic withdrawal strategies, including the surrender option. Furthermore, we consider stochastic interest rate, described by a Cox-Ingersoll-Ross (CIR) process. As to the numerical methods, we solve the stochastic control problem involved by the selection of the optimal withdrawal strategy by means of a robust tree method. We use such a method to estimate the fair price of the product. Furthermore, our numerical results show how the optimal withdrawal strategy varies over time with the health status of the policyholder. Our proposed tree method, we name Tree-LTC, proves to be efficient and reliable, when tested against the Monte Carlo approach.
&lt;/p&gt;</description></item><item><title>&#21327;&#20316;&#28155;&#21152;&#32972;&#26223;&#20449;&#24687;&#21487;&#22823;&#24133;&#20943;&#23569;&#31038;&#20132;&#23186;&#20307;&#34394;&#20551;&#26032;&#38395;&#20256;&#25773;&#65292;&#20294;&#36895;&#24230;&#20063;&#24456;&#37325;&#35201;&#12290;</title><link>https://arxiv.org/abs/2404.02803</link><description>&lt;p&gt;
&#22312;&#31038;&#20132;&#23186;&#20307;&#24086;&#23376;&#20013;&#21327;&#20316;&#28155;&#21152;&#32972;&#26223;&#20449;&#24687;&#21487;&#20197;&#20943;&#23569;&#34394;&#20551;&#26032;&#38395;&#30340;&#20256;&#25773;
&lt;/p&gt;
&lt;p&gt;
Collaboratively adding context to social media posts reduces the sharing of false news
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02803
&lt;/p&gt;
&lt;p&gt;
&#21327;&#20316;&#28155;&#21152;&#32972;&#26223;&#20449;&#24687;&#21487;&#22823;&#24133;&#20943;&#23569;&#31038;&#20132;&#23186;&#20307;&#34394;&#20551;&#26032;&#38395;&#20256;&#25773;&#65292;&#20294;&#36895;&#24230;&#20063;&#24456;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#20010;&#21253;&#21547;&#32422;285,000&#20010;&#26469;&#33258;Twitter&#31038;&#21306;&#31508;&#35760;&#35745;&#21010;&#30340;&#31508;&#35760;&#30340;&#26032;&#25968;&#25454;&#24211;&#65292;&#20197;&#20998;&#26512;&#22312;&#28508;&#22312;&#35823;&#23548;&#24615;&#24086;&#23376;&#19978;&#38468;&#21152;&#32972;&#26223;&#20449;&#24687;&#23545;&#23427;&#20204;&#20256;&#25773;&#30340;&#22240;&#26524;&#24433;&#21709;&#12290;&#37319;&#29992;&#21306;&#21035;&#20110;&#35774;&#35745;&#65292;&#25105;&#20204;&#30340;&#21457;&#29616;&#34920;&#26126;&#22312;&#19968;&#26465;&#25512;&#25991;&#19979;&#28155;&#21152;&#32972;&#26223;&#20449;&#24687;&#20250;&#23558;&#36716;&#21457;&#25968;&#20943;&#23569;&#36817;&#19968;&#21322;&#12290;&#24403;&#20851;&#27880;&#22238;&#22797;&#25110;&#24341;&#29992;&#30340;&#25968;&#37327;&#26102;&#65292;&#20063;&#35266;&#23519;&#21040;&#20102;&#19968;&#20010;&#26174;&#33879;&#19988;&#36739;&#23567;&#30340;&#25928;&#26524;&#12290;&#31038;&#21306;&#31508;&#35760;&#36824;&#22686;&#21152;&#20102;&#25512;&#25991;&#34987;&#20854;&#21019;&#24314;&#32773;&#21024;&#38500;&#30340;&#27010;&#29575;80%&#12290;&#21518;&#32493;&#24433;&#21709;&#24456;&#22823;&#65292;&#20294;&#23545;&#25512;&#25991;&#30149;&#27602;&#20256;&#25773;&#30340;&#25972;&#20307;&#24433;&#21709;&#21462;&#20915;&#20110;&#32972;&#26223;&#20449;&#24687;&#21457;&#24067;&#30340;&#26102;&#26426;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#24471;&#20986;&#32467;&#35770;&#65292;&#23613;&#31649;&#20247;&#21253;&#20107;&#23454;&#26680;&#26597;&#26159;&#26377;&#25928;&#30340;&#65292;&#20294;&#20854;&#24403;&#21069;&#36895;&#24230;&#21487;&#33021;&#19981;&#36275;&#20197;&#26681;&#26412;&#20943;&#23569;&#31038;&#20132;&#23186;&#20307;&#19978;&#35823;&#23548;&#20449;&#24687;&#30340;&#20256;&#25773;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02803v1 Announce Type: new  Abstract: We build a novel database of around 285,000 notes from the Twitter Community Notes program to analyze the causal influence of appending contextual information to potentially misleading posts on their dissemination. Employing a difference in difference design, our findings reveal that adding context below a tweet reduces the number of retweets by almost half. A significant, albeit smaller, effect is observed when focusing on the number of replies or quotes. Community Notes also increase by 80% the probability that a tweet is deleted by its creator. The post-treatment impact is substantial, but the overall effect on tweet virality is contingent upon the timing of the contextual information's publication. Our research concludes that, although crowdsourced fact-checking is effective, its current speed may not be adequate to substantially reduce the dissemination of misleading information on social media.
&lt;/p&gt;</description></item><item><title>&#23454;&#39564;&#35777;&#23454;&#22240;&#26524;&#25253;&#24212;&#22312;&#36164;&#28304;&#20998;&#37197;&#19978;&#24102;&#26469;&#26174;&#33879;&#19988;&#25345;&#20037;&#30340;&#31119;&#21033;&#22909;&#22788;&#65292;&#23588;&#20854;&#22312;&#20855;&#26377;&#38388;&#27463;&#24613;&#36843;&#24615;&#30340;&#24773;&#22659;&#20013;&#25928;&#26524;&#26356;&#20339;&#12290;</title><link>https://arxiv.org/abs/2404.02687</link><description>&lt;p&gt;
Karma&#65306;&#19968;&#20010;&#23454;&#39564;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Karma: An Experimental Study
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02687
&lt;/p&gt;
&lt;p&gt;
&#23454;&#39564;&#35777;&#23454;&#22240;&#26524;&#25253;&#24212;&#22312;&#36164;&#28304;&#20998;&#37197;&#19978;&#24102;&#26469;&#26174;&#33879;&#19988;&#25345;&#20037;&#30340;&#31119;&#21033;&#22909;&#22788;&#65292;&#23588;&#20854;&#22312;&#20855;&#26377;&#38388;&#27463;&#24613;&#36843;&#24615;&#30340;&#24773;&#22659;&#20013;&#25928;&#26524;&#26356;&#20339;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38750;&#21487;&#20132;&#26131;&#31215;&#20998;&#31995;&#32479;&#65292;&#31867;&#20284;&#20110;&#22240;&#26524;&#25253;&#24212;&#65292;&#22240;&#27492;&#25552;&#35758;&#20197;&#27492;&#21629;&#21517;&#65292;&#26159;&#19968;&#31181;&#29992;&#20110;&#37325;&#22797;&#36164;&#28304;&#20998;&#37197;&#30340;&#26426;&#21046;&#65292;&#22312;&#29702;&#35770;&#19978;&#20855;&#26377;&#21560;&#24341;&#20154;&#30340;&#25928;&#29575;&#21644;&#20844;&#24179;&#29305;&#24615;&#12290;&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#22312;&#19968;&#39033;&#22312;&#32447;&#23454;&#39564;&#20013;&#27979;&#35797;&#20102;&#22240;&#26524;&#25253;&#24212;&#65292;&#23454;&#39564;&#20013;&#20154;&#31867;&#34987;&#35201;&#27714;&#37325;&#22797;&#31454;&#20105;&#33719;&#21462;&#19968;&#31181;&#20855;&#26377;&#26102;&#38388;&#21464;&#21270;&#21644;&#38543;&#26426;&#20010;&#20154;&#20559;&#22909;&#25110;&#32039;&#36843;&#24615;&#30340;&#36164;&#28304;&#12290;&#25105;&#20204;&#30830;&#35748;&#65292;&#21363;&#20351;&#22312;&#27809;&#26377;&#20219;&#20309;&#20107;&#20808;&#22521;&#35757;&#30340;&#20154;&#32676;&#20013;&#65292;&#22240;&#26524;&#25253;&#24212;&#20063;&#20855;&#26377;&#26174;&#33879;&#19988;&#25345;&#20037;&#30340;&#31119;&#21033;&#22909;&#22788;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#20855;&#26377;&#38388;&#27463;&#24613;&#36843;&#24615;&#30340;&#24773;&#22659;&#20013;&#65292;&#26426;&#21046;&#30340;&#20351;&#29992;&#27425;&#25968;&#27604;&#39057;&#32321;&#20013;&#31561;&#32039;&#36843;&#24615;&#30340;&#24773;&#22659;&#26356;&#22810;&#65292;&#24182;&#19988;&#23558;&#20854;&#23454;&#26045;&#20026;&#19968;&#20010;&#31616;&#21333;&#65288;&#20108;&#20803;&#65289;&#30340;&#22240;&#26524;&#25253;&#24212;&#31454;&#26631;&#26041;&#26696;&#65292;&#23545;&#20110;&#31119;&#21033;&#30340;&#25552;&#39640;&#29305;&#21035;&#26377;&#25928;&#65306;&#23454;&#29616;&#20102;&#30456;&#23545;&#36739;&#22823;&#30340;&#24635;&#20307;&#25928;&#29575;&#22686;&#30410;&#65292;&#36825;&#20123;&#22686;&#30410;&#20960;&#20046;&#26159;&#24085;&#32047;&#25176;&#25913;&#36827;&#30340;&#12290;&#36825;&#20123;&#21457;&#29616;&#20026;&#36827;&#19968;&#27493;&#27979;&#35797;&#21644;&#26410;&#26469;&#23454;&#26045;&#35745;&#21010;&#25552;&#20379;&#20102;&#25351;&#23548;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02687v1 Announce Type: new  Abstract: A system of non-tradable credits that flow between individuals like karma, hence proposed under that name, is a mechanism for repeated resource allocation that comes with attractive efficiency and fairness properties, in theory. In this study, we test karma in an online experiment in which human subjects repeatedly compete for a resource with time-varying and stochastic individual preferences or urgency to acquire the resource. We confirm that karma has significant and sustained welfare benefits even in a population with no prior training. We identify mechanism usage in contexts with sporadic high urgency, more so than with frequent moderate urgency, and implemented as an easy (binary) karma bidding scheme as particularly effective for welfare improvements: relatively larger aggregate efficiency gains are realized that are (almost) Pareto superior. These findings provide guidance for further testing and for future implementation plans of
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#26088;&#22312;&#25506;&#35752;&#20013;&#31561;&#25910;&#20837;&#22269;&#23478;&#32599;&#39532;&#23612;&#20122;&#28040;&#36153;&#32773;&#36141;&#20080;&#21487;&#25345;&#32493;&#26381;&#35013;&#24847;&#21521;&#30340;&#34892;&#20026;&#22240;&#32032;&#65292;&#22635;&#34917;&#20102;&#30456;&#20851;&#30740;&#31350;&#30340;&#31354;&#30333;&#12290;</title><link>https://arxiv.org/abs/2404.02612</link><description>&lt;p&gt;
&#22312;&#20013;&#31561;&#25910;&#20837;&#22269;&#23478;&#25506;&#35752;&#21487;&#25345;&#32493;&#24615;&#26381;&#35013;&#28040;&#36153;&#65306;&#32599;&#39532;&#23612;&#20122;&#28040;&#36153;&#32773;&#26696;&#20363;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Exploring Sustainable Clothing Consumption in Middle-Income Countries: A case study of Romanian consumers
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02612
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26088;&#22312;&#25506;&#35752;&#20013;&#31561;&#25910;&#20837;&#22269;&#23478;&#32599;&#39532;&#23612;&#20122;&#28040;&#36153;&#32773;&#36141;&#20080;&#21487;&#25345;&#32493;&#26381;&#35013;&#24847;&#21521;&#30340;&#34892;&#20026;&#22240;&#32032;&#65292;&#22635;&#34917;&#20102;&#30456;&#20851;&#30740;&#31350;&#30340;&#31354;&#30333;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28040;&#36153;&#32773;&#22312;&#24403;&#20170;&#26085;&#30410;&#31232;&#32570;&#30340;&#33258;&#28982;&#36164;&#28304;&#19979;&#30340;&#36807;&#24230;&#28040;&#36153;&#24050;&#32463;&#20351;&#20687;&#32599;&#39532;&#23612;&#20122;&#36825;&#26679;&#30340;&#20013;&#31561;&#25910;&#20837;&#22269;&#23478;&#30340;&#32442;&#32455;&#34892;&#19994;&#19981;&#22570;&#37325;&#36127;&#12290;&#40723;&#21169;&#21487;&#25345;&#32493;&#26381;&#35013;&#28040;&#36153;&#34892;&#20026;&#21464;&#24471;&#36234;&#26469;&#36234;&#37325;&#35201;&#65292;&#27604;&#22914;&#36141;&#20080;&#21487;&#22238;&#25910;&#34915;&#29289;&#12290;&#28982;&#32780;&#65292;&#35797;&#22270;&#29702;&#35299;&#20013;&#31561;&#25910;&#20837;&#22269;&#23478;&#28040;&#36153;&#32773;&#23545;&#21487;&#25345;&#32493;&#26381;&#35013;&#36141;&#20080;&#24847;&#21521;&#30340;&#21160;&#22240;&#22240;&#20869;&#22312;&#22240;&#32032;&#32780;&#20135;&#29983;&#30340;&#30740;&#31350;&#25968;&#37327;&#26377;&#38480;&#12290;&#27492;&#22806;&#65292;&#28040;&#36153;&#32773;&#30340;&#29615;&#22659;&#30693;&#35782;&#23545;&#20110;&#30830;&#23450;&#20182;&#20204;&#23545;&#21487;&#25345;&#32493;&#26381;&#35013;&#36141;&#20080;&#24847;&#21521;&#30340;&#24433;&#21709;&#20173;&#26410;&#21463;&#21040;&#20805;&#20998;&#30740;&#31350;&#12290;&#22240;&#27492;&#65292;&#26412;&#25991;&#30340;&#30446;&#30340;&#26159;&#36890;&#36807;&#25552;&#20379;&#19968;&#20010;&#25972;&#21512;&#26694;&#26550;&#26469;&#25506;&#35752;&#20419;&#20351;&#32599;&#39532;&#23612;&#20122;&#28040;&#36153;&#32773;&#36141;&#20080;&#24847;&#21521;&#36716;&#21521;&#21487;&#25345;&#32493;&#26381;&#35013;&#30340;&#34892;&#20026;&#22240;&#32032;&#65292;&#20174;&#32780;&#23545;&#21487;&#25345;&#32493;&#28040;&#36153;&#25991;&#29486;&#20570;&#20986;&#37325;&#35201;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02612v1 Announce Type: new  Abstract: The overconsumption of consumers under today's increasingly scarce natural resources has overwhelmed the textile industry in middle-income countries, such as Romania. It is becoming more and more essential to encourage sustainable clothing consumption behaviors, such as purchasing recyclable clothes. Notwithstanding there is a limited number of studies trying to understand the intrinsic factors that motivate consumers' purchase intention toward sustainable clothes in middle-income countries. Moreover, the effect of consumers' environmental knowledge on determining their purchase intention of sustainable clothes remains understudied. Consequently, the purpose of this paper is to make a significant contribution to the sustainable consumption literature by providing a consolidated framework that explores the behavioral factors inclining Romanian consumers' purchase intention towards sustainable clothes. The foundation of this study combines
&lt;/p&gt;</description></item><item><title>&#20171;&#32461;&#20102;&#23558;&#37327;&#23376;&#26426;&#22120;&#23398;&#20064;&#21644;&#37327;&#23376;&#35745;&#31639;&#25216;&#26415;&#19982;&#32852;&#37030;&#23398;&#20064;&#30456;&#32467;&#21512;&#30340;Quantum Federated Neural Network for Financial Fraud Detection (QFNN-FFD)&#26694;&#26550;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#23433;&#20840;&#12289;&#39640;&#25928;&#30340;&#27450;&#35784;&#20132;&#26131;&#35782;&#21035;&#26041;&#27861;&#65292;&#26174;&#33879;&#25913;&#36827;&#20102;&#27450;&#35784;&#26816;&#27979;&#24182;&#30830;&#20445;&#20102;&#25968;&#25454;&#26426;&#23494;&#24615;&#12290;</title><link>https://arxiv.org/abs/2404.02595</link><description>&lt;p&gt;
QFNN-FFD&#65306;&#29992;&#20110;&#37329;&#34701;&#27450;&#35784;&#26816;&#27979;&#30340;&#37327;&#23376;&#32852;&#37030;&#31070;&#32463;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
QFNN-FFD: Quantum Federated Neural Network for Financial Fraud Detection
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02595
&lt;/p&gt;
&lt;p&gt;
&#20171;&#32461;&#20102;&#23558;&#37327;&#23376;&#26426;&#22120;&#23398;&#20064;&#21644;&#37327;&#23376;&#35745;&#31639;&#25216;&#26415;&#19982;&#32852;&#37030;&#23398;&#20064;&#30456;&#32467;&#21512;&#30340;Quantum Federated Neural Network for Financial Fraud Detection (QFNN-FFD)&#26694;&#26550;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#23433;&#20840;&#12289;&#39640;&#25928;&#30340;&#27450;&#35784;&#20132;&#26131;&#35782;&#21035;&#26041;&#27861;&#65292;&#26174;&#33879;&#25913;&#36827;&#20102;&#27450;&#35784;&#26816;&#27979;&#24182;&#30830;&#20445;&#20102;&#25968;&#25454;&#26426;&#23494;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#20171;&#32461;&#20102;Quantum Federated Neural Network for Financial Fraud Detection (QFNN-FFD)&#65292;&#36825;&#26159;&#19968;&#20010;&#34701;&#21512;&#20102;&#37327;&#23376;&#26426;&#22120;&#23398;&#20064;&#65288;QML&#65289;&#21644;&#37327;&#23376;&#35745;&#31639;&#25216;&#26415;&#19982;&#32852;&#37030;&#23398;&#20064;&#65288;FL&#65289;&#30340;&#21069;&#27839;&#26694;&#26550;&#65292;&#29992;&#20110;&#21019;&#26032;&#37329;&#34701;&#27450;&#35784;&#26816;&#27979;&#12290;&#21033;&#29992;&#37327;&#23376;&#25216;&#26415;&#30340;&#35745;&#31639;&#33021;&#21147;&#21644;FL&#30340;&#25968;&#25454;&#38544;&#31169;&#65292;QFNN-FFD&#25552;&#20986;&#20102;&#19968;&#31181;&#23433;&#20840;&#12289;&#39640;&#25928;&#30340;&#35782;&#21035;&#27450;&#35784;&#20132;&#26131;&#30340;&#26041;&#27861;&#12290;&#22312;&#20998;&#24067;&#24335;&#23458;&#25143;&#31471;&#23454;&#26045;&#21452;&#38454;&#27573;&#35757;&#32451;&#27169;&#22411;&#36229;&#36234;&#20102;&#29616;&#26377;&#30340;&#24615;&#33021;&#26041;&#27861;&#12290;QFNN-FFD&#26174;&#33879;&#25913;&#36827;&#20102;&#27450;&#35784;&#26816;&#27979;&#24182;&#30830;&#20445;&#20102;&#25968;&#25454;&#26426;&#23494;&#24615;&#65292;&#26631;&#24535;&#30528;&#37329;&#34701;&#31185;&#25216;&#35299;&#20915;&#26041;&#26696;&#30340;&#37325;&#22823;&#36827;&#27493;&#65292;&#24182;&#20026;&#20197;&#38544;&#31169;&#20026;&#37325;&#28857;&#30340;&#27450;&#35784;&#26816;&#27979;&#24314;&#31435;&#20102;&#26032;&#26631;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02595v1 Announce Type: cross  Abstract: This study introduces the Quantum Federated Neural Network for Financial Fraud Detection (QFNN-FFD), a cutting-edge framework merging Quantum Machine Learning (QML) and quantum computing with Federated Learning (FL) to innovate financial fraud detection. Using quantum technologies' computational power and FL's data privacy, QFNN-FFD presents a secure, efficient method for identifying fraudulent transactions. Implementing a dual-phase training model across distributed clients surpasses existing methods in performance. QFNN-FFD significantly improves fraud detection and ensures data confidentiality, marking a significant advancement in fintech solutions and establishing a new standard for privacy-focused fraud detection.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#22312;&#37327;&#23376;&#36864;&#28779;&#26426;&#19978;&#25506;&#32034;&#20102;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#65292;&#24314;&#31435;&#20102;&#36830;&#32493;&#21644;&#31163;&#25955;&#39532;&#31185;&#32500;&#33576;&#32452;&#21512;&#29702;&#35770;&#20043;&#38388;&#30340;&#26144;&#23556;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2404.02582</link><description>&lt;p&gt;
&#37327;&#23376;&#35745;&#31639;&#26041;&#27861;&#24212;&#29992;&#20110;&#29616;&#23454;ESG&#21451;&#22909;&#22411;&#32929;&#31080;&#32452;&#21512;
&lt;/p&gt;
&lt;p&gt;
Quantum computing approach to realistic ESG-friendly stock portfolios
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02582
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22312;&#37327;&#23376;&#36864;&#28779;&#26426;&#19978;&#25506;&#32034;&#20102;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#65292;&#24314;&#31435;&#20102;&#36830;&#32493;&#21644;&#31163;&#25955;&#39532;&#31185;&#32500;&#33576;&#32452;&#21512;&#29702;&#35770;&#20043;&#38388;&#30340;&#26144;&#23556;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23547;&#25214;&#22312;&#25237;&#36164;&#32452;&#21512;&#20013;&#39118;&#38505;&#21644;&#22238;&#25253;&#20043;&#38388;&#30340;&#26368;&#20339;&#24179;&#34913;&#26159;&#37327;&#21270;&#37329;&#34701;&#20013;&#30340;&#19968;&#20010;&#26680;&#24515;&#25361;&#25112;&#65292;&#36890;&#24120;&#36890;&#36807;&#39532;&#31185;&#32500;&#33576;&#32452;&#21512;&#29702;&#35770;&#65288;MPT&#65289;&#26469;&#35299;&#20915;&#12290;&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#37327;&#23376;&#36864;&#28779;&#26426;&#22312;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#20013;&#30340;&#24212;&#29992;&#65292;&#24314;&#31435;&#20102;&#36830;&#32493;&#21644;&#31163;&#25955;&#39532;&#31185;&#32500;&#33576;&#32452;&#21512;&#29702;&#35770;&#20043;&#38388;&#30340;&#26144;&#23556;&#20851;&#31995;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#31163;&#25955;&#39532;&#31185;&#32500;&#33576;&#32452;&#21512;&#29702;&#35770;&#38382;&#39064;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02582v1 Announce Type: new  Abstract: Finding an optimal balance between risk and returns in investment portfolios is a central challenge in quantitative finance, often addressed through Markowitz portfolio theory (MPT). While traditional portfolio optimization is carried out in a continuous fashion, as if stocks could be bought in fractional increments, practical implementations often resort to approximations, as fractional stocks are typically not tradeable. While these approximations are effective for large investment budgets, they deteriorate as budgets decrease. To alleviate this issue, a discrete Markowitz portfolio theory (DMPT) with finite budgets and integer stock weights can be formulated, but results in a non-polynomial (NP)-hard problem. Recent progress in quantum processing units (QPUs), including quantum annealers, makes solving DMPT problems feasible. Our study explores portfolio optimization on quantum annealers, establishing a mapping between continuous and 
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#26102;&#38388;&#19981;&#19968;&#33268;&#20559;&#22909;&#30340;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#65292;&#36890;&#36807;&#23545;&#26102;&#38388;&#19981;&#19968;&#33268;&#24615;&#27700;&#24179;&#30340;&#34913;&#37327;&#65292;&#21457;&#29616;&#20102;&#27010;&#29575;&#22833;&#30495;&#23548;&#33268;&#26102;&#38388;&#19981;&#19968;&#33268;&#24615;&#30340;&#31243;&#24230;&#19982;&#36716;&#21464;&#20026;&#22797;&#26434;&#31574;&#30053;&#25152;&#38656;&#30340;&#26102;&#38388;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2404.02498</link><description>&lt;p&gt;
&#20174;&#26102;&#38388;&#19981;&#19968;&#33268;&#21040;&#26102;&#38388;&#19968;&#33268;&#30340;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
From Time-inconsistency to Time-consistency for Optimal Stopping Problems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02498
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#26102;&#38388;&#19981;&#19968;&#33268;&#20559;&#22909;&#30340;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#65292;&#36890;&#36807;&#23545;&#26102;&#38388;&#19981;&#19968;&#33268;&#24615;&#27700;&#24179;&#30340;&#34913;&#37327;&#65292;&#21457;&#29616;&#20102;&#27010;&#29575;&#22833;&#30495;&#23548;&#33268;&#26102;&#38388;&#19981;&#19968;&#33268;&#24615;&#30340;&#31243;&#24230;&#19982;&#36716;&#21464;&#20026;&#22797;&#26434;&#31574;&#30053;&#25152;&#38656;&#30340;&#26102;&#38388;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#20855;&#26377;&#26102;&#38388;&#19981;&#19968;&#33268;&#20559;&#22909;&#30340;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#65292;&#25105;&#20204;&#36890;&#36807;&#23558;&#20174;&#22825;&#30495;&#31574;&#30053;&#36716;&#21464;&#20026;&#22797;&#26434;&#31574;&#30053;&#25152;&#38656;&#30340;&#26102;&#38388;&#26469;&#34913;&#37327;&#26102;&#38388;&#19981;&#19968;&#33268;&#30340;&#22266;&#26377;&#27700;&#24179;&#12290;&#29305;&#21035;&#26159;&#65292;&#22312;&#37325;&#22797;&#23454;&#39564;&#20013;&#65292;&#24403;&#22825;&#30495;&#20195;&#29702;&#21487;&#20197;&#35266;&#23519;&#21040;&#22905;&#30340;&#23454;&#38469;&#34892;&#21160;&#24207;&#21015;&#19982;&#26368;&#21021;&#35745;&#21010;&#19981;&#19968;&#33268;&#26102;&#65292;&#22905;&#20250;&#26681;&#25454;&#21518;&#32493;&#23454;&#38469;&#34892;&#20026;&#30340;&#35266;&#23519;&#36873;&#25321;&#31435;&#21363;&#34892;&#21160;&#12290;&#35813;&#36807;&#31243;&#37325;&#22797;&#36827;&#34892;&#65292;&#30452;&#21040;&#22905;&#30340;&#23454;&#38469;&#34892;&#21160;&#24207;&#21015;&#22312;&#20219;&#20309;&#26102;&#38388;&#28857;&#37117;&#19982;&#22905;&#30340;&#35745;&#21010;&#19968;&#33268;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#23545;&#20110;&#32047;&#31215;&#27010;&#29575;&#29702;&#35770;&#30340;&#20559;&#22909;&#20540;&#65292;&#20854;&#20013;&#26102;&#38388;&#19981;&#19968;&#33268;&#30001;&#20110;&#27010;&#29575;&#22833;&#30495;&#23548;&#33268;&#65292;&#27010;&#29575;&#22833;&#30495;&#31243;&#24230;&#36234;&#39640;&#65292;&#26102;&#38388;&#19981;&#19968;&#33268;&#31243;&#24230;&#23601;&#36234;&#20005;&#37325;&#65292;&#38656;&#35201;&#30340;&#26102;&#38388;&#36716;&#21464;&#20174;&#22825;&#30495;&#31574;&#30053;&#21040;&#22797;&#26434;&#31574;&#30053;&#20063;&#26356;&#22810;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02498v1 Announce Type: new  Abstract: For optimal stopping problems with time-inconsistent preference, we measure the inherent level of time-inconsistency by taking the time needed to turn the naive strategies into the sophisticated ones. In particular, when in a repeated experiment the naive agent can observe her actual sequence of actions which are inconsistent with what she has planned at the initial time, she then chooses her immediate action based on the observations on her later actual behavior. The procedure is repeated until her actual sequence of actions are consistent with her plan at any time. We show that for the preference value of cumulative prospect theory, in which the time-inconsistency is due to the probability distortion, the higher the degree of probability distortion, the more severe the level of time-inconsistency, and the more time required to turn the naive strategies into the sophisticated ones.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#21033;&#29992;&#26426;&#22120;&#23398;&#20064;&#35299;&#20915;&#23398;&#26657;&#29677;&#32423;&#20998;&#37197;&#38382;&#39064;&#65292;&#36890;&#36807;&#21451;&#35850;&#39044;&#27979;&#12289;&#21516;&#20394;&#24433;&#21709;&#20272;&#35745;&#21644;&#29677;&#32423;&#20998;&#37197;&#20248;&#21270;&#65292;&#21457;&#29616;&#23558;&#23398;&#29983;&#20998;&#25104;&#26377;&#24615;&#21035;&#29305;&#24449;&#30340;&#29677;&#32423;&#33021;&#22815;&#25552;&#39640;&#24179;&#22343;&#21516;&#20394;&#24433;&#21709;&#65292;&#24182;&#19988;&#26497;&#31471;&#28151;&#21512;&#30340;&#29677;&#32423;&#20998;&#37197;&#26041;&#27861;&#21487;&#20197;&#25913;&#21892;&#24213;&#37096;&#22235;&#20998;&#20043;&#19968;&#23398;&#29983;&#30340;&#21516;&#20394;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2404.02497</link><description>&lt;p&gt;
&#29992;&#26426;&#22120;&#23398;&#20064;&#25552;&#21319;&#25945;&#32946;&#25104;&#26524;&#65306;&#24314;&#27169;&#21451;&#35850;&#24418;&#25104;&#65292;&#34913;&#37327;&#21516;&#20394;&#24433;&#21709;&#21644;&#20248;&#21270;&#29677;&#32423;&#20998;&#37197;
&lt;/p&gt;
&lt;p&gt;
Enhancing Educational Outcome with Machine Learning: Modeling Friendship Formation, Measuring Peer Effect and Optimizing Class Assignment
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02497
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#21033;&#29992;&#26426;&#22120;&#23398;&#20064;&#35299;&#20915;&#23398;&#26657;&#29677;&#32423;&#20998;&#37197;&#38382;&#39064;&#65292;&#36890;&#36807;&#21451;&#35850;&#39044;&#27979;&#12289;&#21516;&#20394;&#24433;&#21709;&#20272;&#35745;&#21644;&#29677;&#32423;&#20998;&#37197;&#20248;&#21270;&#65292;&#21457;&#29616;&#23558;&#23398;&#29983;&#20998;&#25104;&#26377;&#24615;&#21035;&#29305;&#24449;&#30340;&#29677;&#32423;&#33021;&#22815;&#25552;&#39640;&#24179;&#22343;&#21516;&#20394;&#24433;&#21709;&#65292;&#24182;&#19988;&#26497;&#31471;&#28151;&#21512;&#30340;&#29677;&#32423;&#20998;&#37197;&#26041;&#27861;&#21487;&#20197;&#25913;&#21892;&#24213;&#37096;&#22235;&#20998;&#20043;&#19968;&#23398;&#29983;&#30340;&#21516;&#20394;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#23398;&#26657;&#26657;&#38271;&#30340;&#29677;&#32423;&#20998;&#37197;&#38382;&#39064;&#12290;&#25105;&#20204;&#23558;&#38382;&#39064;&#20998;&#20026;&#19977;&#20010;&#38454;&#27573;&#65306;&#21451;&#35850;&#39044;&#27979;&#12289;&#21516;&#20394;&#24433;&#21709;&#35780;&#20272;&#21644;&#29677;&#32423;&#20998;&#37197;&#20248;&#21270;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#20010;&#24494;&#35266;&#22522;&#30784;&#27169;&#22411;&#26469;&#27169;&#25311;&#21451;&#35850;&#24418;&#25104;&#65292;&#24182;&#23558;&#35813;&#27169;&#22411;&#36924;&#36817;&#20026;&#19968;&#20010;&#31070;&#32463;&#32593;&#32476;&#12290;&#21033;&#29992;&#39044;&#27979;&#30340;&#21451;&#35850;&#27010;&#29575;&#37051;&#25509;&#30697;&#38453;&#65292;&#25105;&#20204;&#25913;&#36827;&#20102;&#20256;&#32479;&#30340;&#32447;&#24615;&#22343;&#20540;&#27169;&#22411;&#24182;&#20272;&#35745;&#20102;&#21516;&#20394;&#24433;&#21709;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24037;&#20855;&#20197;&#35299;&#20915;&#21451;&#35850;&#36873;&#25321;&#30340;&#20869;&#29983;&#24615;&#38382;&#39064;&#12290;&#20272;&#35745;&#30340;&#21516;&#20394;&#24433;&#21709;&#30053;&#22823;&#20110;&#32447;&#24615;&#22343;&#20540;&#27169;&#22411;&#30340;&#20272;&#35745;&#12290;&#21033;&#29992;&#21451;&#35850;&#39044;&#27979;&#21644;&#21516;&#20394;&#24433;&#21709;&#20272;&#35745;&#32467;&#26524;&#65292;&#25105;&#20204;&#27169;&#25311;&#20102;&#25152;&#26377;&#23398;&#29983;&#30340;&#21453;&#20107;&#23454;&#21516;&#20394;&#24433;&#21709;&#12290;&#25105;&#20204;&#21457;&#29616;&#23558;&#23398;&#29983;&#20998;&#25104;&#26377;&#24615;&#21035;&#29305;&#24449;&#30340;&#29677;&#32423;&#21487;&#20197;&#23558;&#24179;&#22343;&#21516;&#20394;&#24433;&#21709;&#25552;&#39640;0.02&#20998;&#65288;&#22312;5&#20998;&#21046;&#20013;&#65289;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#26497;&#31471;&#28151;&#21512;&#30340;&#29677;&#32423;&#20998;&#37197;&#26041;&#27861;&#21487;&#20197;&#25552;&#39640;&#24213;&#37096;&#22235;&#20998;&#20043;&#19968;&#23398;&#29983;&#30340;&#21516;&#20394;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02497v1 Announce Type: new  Abstract: In this paper, we look at a school principal's class assignment problem. We break the problem into three stages (1) friendship prediction (2) peer effect estimation (3) class assignment optimization. We build a micro-founded model for friendship formation and approximate the model as a neural network. Leveraging on the predicted friendship probability adjacent matrix, we improve the traditional linear-in-means model and estimate peer effect. We propose a new instrument to address the friendship selection endogeneity. The estimated peer effect is slightly larger than the linear-in-means model estimate. Using the friendship prediction and peer effect estimation results, we simulate counterfactual peer effects for all students. We find that dividing students into gendered classrooms increases average peer effect by 0.02 point on a scale of 5. We also find that extreme mixing class assignment method improves bottom quartile students' peer ef
&lt;/p&gt;</description></item><item><title>&#21033;&#29992;&#28145;&#24230;&#23398;&#20064;&#21644;&#26399;&#26435;&#38544;&#21547;&#20449;&#24687;&#25913;&#36827;&#22810;&#36164;&#20135;&#26399;&#26435;&#30340;&#26080;&#27169;&#22411;&#19978;&#30028;&#35745;&#31639;&#26041;&#27861;</title><link>https://arxiv.org/abs/2404.02343</link><description>&lt;p&gt;
&#21033;&#29992;&#26399;&#26435;&#38544;&#21547;&#20449;&#24687;&#21644;&#28145;&#24230;&#23398;&#20064;&#25913;&#36827;&#22810;&#36164;&#20135;&#26399;&#26435;&#30340;&#26080;&#27169;&#22411;&#30028;&#38480;
&lt;/p&gt;
&lt;p&gt;
Improved model-free bounds for multi-asset options using option-implied information and deep learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02343
&lt;/p&gt;
&lt;p&gt;
&#21033;&#29992;&#28145;&#24230;&#23398;&#20064;&#21644;&#26399;&#26435;&#38544;&#21547;&#20449;&#24687;&#25913;&#36827;&#22810;&#36164;&#20135;&#26399;&#26435;&#30340;&#26080;&#27169;&#22411;&#19978;&#30028;&#35745;&#31639;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#22312;&#23558;&#20381;&#36182;&#24615;&#19981;&#30830;&#23450;&#24615;&#19982;&#26377;&#20851;&#20381;&#36182;&#32467;&#26500;&#30340;&#39069;&#22806;&#20449;&#24687;&#30456;&#32467;&#21512;&#30340;&#24773;&#20917;&#19979;&#35745;&#31639;&#22810;&#36164;&#20135;&#26399;&#26435;&#30340;&#26080;&#27169;&#22411;&#30028;&#38480;&#12290; &#26356;&#20855;&#20307;&#22320;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#36793;&#38469;&#20998;&#24067;&#24050;&#30693;&#19988;&#24066;&#22330;&#19978;&#20063;&#26377;&#22810;&#36164;&#20135;&#26399;&#26435;&#20215;&#26684;&#30340;&#37096;&#20998;&#20449;&#24687;&#30340;&#24773;&#24418;&#12290; &#25105;&#20204;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#32473;&#20986;&#20102;&#36164;&#20135;&#23450;&#20215;&#30340;&#22522;&#26412;&#23450;&#29702;&#65292;&#20197;&#21450;&#19968;&#31181;&#36229;&#23545;&#20914;&#23545;&#20598;&#65292;&#33021;&#22815;&#23558;&#22312;&#27010;&#29575;&#24230;&#37327;&#19978;&#30340;&#26368;&#22823;&#21270;&#38382;&#39064;&#36716;&#21270;&#20026;&#22312;&#20132;&#26131;&#31574;&#30053;&#19978;&#30340;&#26356;&#26131;&#22788;&#29702;&#30340;&#26368;&#23567;&#21270;&#38382;&#39064;&#12290; &#21518;&#32773;&#26159;&#36890;&#36807;&#32467;&#21512;&#32602;&#27454;&#26041;&#27861;&#21644;&#20511;&#21161;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#30340;&#28145;&#24230;&#23398;&#20064;&#36924;&#36817;&#26469;&#35299;&#20915;&#30340;&#12290; &#25968;&#20540;&#26041;&#27861;&#24555;&#36895;&#65292;&#24182;&#19988;&#35745;&#31639;&#26102;&#38388;&#19982;&#20132;&#26131;&#36164;&#20135;&#25968;&#37327;&#25104;&#32447;&#24615;&#27604;&#20363;&#12290; &#26368;&#21518;&#65292;&#25105;&#20204;&#26816;&#39564;&#20102;&#21508;&#31181;&#39069;&#22806;&#20449;&#24687;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02343v1 Announce Type: cross  Abstract: We consider the computation of model-free bounds for multi-asset options in a setting that combines dependence uncertainty with additional information on the dependence structure. More specifically, we consider the setting where the marginal distributions are known and partial information, in the form of known prices for multi-asset options, is also available in the market. We provide a fundamental theorem of asset pricing in this setting, as well as a superhedging duality that allows to transform the maximization problem over probability measures in a more tractable minimization problem over trading strategies. The latter is solved using a penalization approach combined with a deep learning approximation using artificial neural networks. The numerical method is fast and the computational time scales linearly with respect to the number of traded assets. We finally examine the significance of various pieces of additional information. Em
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#35752;&#35770;&#20102;&#31038;&#20132;&#23186;&#20307;&#23545;&#31038;&#20250;&#21644;&#27861;&#24459;&#30340;&#25361;&#25112;&#65292;&#25552;&#20986;&#20102;&#22312;&#22788;&#29702;&#36825;&#20123;&#38382;&#39064;&#26102;&#30340;&#19968;&#20123;&#19981;&#23452;&#37319;&#21462;&#30340;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2404.02273</link><description>&lt;p&gt;
&#36229;&#36234;&#31038;&#20132;&#23186;&#20307;&#31867;&#27604;
&lt;/p&gt;
&lt;p&gt;
Beyond Social Media Analogues
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02273
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#35752;&#35770;&#20102;&#31038;&#20132;&#23186;&#20307;&#23545;&#31038;&#20250;&#21644;&#27861;&#24459;&#30340;&#25361;&#25112;&#65292;&#25552;&#20986;&#20102;&#22312;&#22788;&#29702;&#36825;&#20123;&#38382;&#39064;&#26102;&#30340;&#19968;&#20123;&#19981;&#23452;&#37319;&#21462;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#20132;&#23186;&#20307;&#26696;&#20363;&#19981;&#26029;&#28044;&#21521;&#26368;&#39640;&#27861;&#38498;&#65292;&#26174;&#31034;&#20986;&#19968;&#20010;&#22269;&#23478;&#27491;&#22312;&#37325;&#26032;&#35843;&#25972;&#20854;&#19982;&#25216;&#26415;&#30340;&#22522;&#26412;&#20851;&#31995;&#12290;&#36825;&#20123;&#26696;&#20363;&#24341;&#21457;&#20102;&#19968;&#31995;&#21015;&#20174;&#22256;&#38590;&#21040;&#19981;&#21487;&#33021;&#22238;&#31572;&#30340;&#38382;&#39064;&#65306;&#24403;&#23569;&#25968;&#31185;&#25216;&#24040;&#22836;&#20027;&#23472;&#20449;&#24687;&#27969;&#26102;&#65292;&#22914;&#20309;&#22521;&#20859;&#19968;&#20010;&#20805;&#28385;&#27963;&#21147;&#30340;&#20844;&#20849;&#24191;&#22330;&#65307;&#31038;&#20132;&#23186;&#20307;&#22914;&#20309;&#22312;&#20813;&#20110;&#32676;&#20307;&#24605;&#32500;&#30340;&#21516;&#26102;&#65292;&#21448;&#33021;&#25269;&#24481;&#26377;&#23475;&#30340;&#34394;&#20551;&#20449;&#24687;&#20256;&#25773;&#65307;&#25919;&#24220;&#21644;&#24037;&#19994;&#22914;&#20309;&#22312;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#26102;&#21512;&#20316;&#65292;&#32780;&#19981;&#20250;&#38519;&#20837;&#23457;&#26597;&#21046;&#24230;&#30340;&#20498;&#36864;&#12290;&#23545;&#20110;&#36825;&#26679;&#28145;&#21051;&#30340;&#38382;&#39064;&#65292;&#35813;&#35770;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#30456;&#23545;&#35878;&#34394;&#30340;&#36129;&#29486; -- &#21363;&#19981;&#35201;&#20570;&#20160;&#20040;&#12290;&#24459;&#24072;&#30340;&#26412;&#33021;&#24635;&#26159;&#20542;&#21521;&#20110;&#31867;&#27604;&#65292;&#32771;&#34385;&#20197;&#24448;&#21457;&#29983;&#30340;&#20107;&#24773;&#20197;&#21450;&#22914;&#20309;&#25581;&#31034;&#25509;&#19979;&#26469;&#24212;&#35813;&#21457;&#29983;&#30340;&#20107;&#24773;&#12290;&#20960;&#20046;&#24635;&#26159;&#65292;&#36825;&#26159;&#27491;&#30830;&#30340;&#36873;&#25321;&#12290;&#27861;&#24459;&#30340;&#35880;&#24910;&#28436;&#21464;&#20445;&#25252;&#20102;&#31038;&#20250;&#20813;&#21463;&#39072;&#35206;&#24615;&#25913;&#21464;&#12290;&#20294;&#20960;&#20046;&#19981;&#24635;&#26159;&#65292;&#24182;&#19988;&#65292;&#38543;&#30528;&#31038;&#20132;&#23186;&#20307;&#30340;&#21457;&#23637;&#65292;&#39072;&#35206;&#24615;&#30340;&#25913;&#21464;&#24050;&#32463;&#21040;&#26469;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02273v1 Announce Type: new  Abstract: The steady flow of social-media cases toward the Supreme Court shows a nation reworking its fundamental relationship with technology. The cases raise a host of questions ranging from difficult to impossible: how to nurture a vibrant public square when a few tech giants dominate the flow of information, how social media can be at the same time free from conformist groupthink and also protected against harmful disinformation campaigns, and how government and industry can cooperate on such problems without devolving toward censorship.   To such profound questions, this Essay offers a comparatively modest contribution -- what not to do. Always the lawyer's instinct is toward analogy, considering what has come before and how it reveals what should come next. Almost invariably, that is the right choice. The law's cautious evolution protects society from disruptive change. But almost is not always, and, with social media, disruptive change is a
&lt;/p&gt;</description></item><item><title>&#23558;&#28857;&#39044;&#27979;&#36716;&#25442;&#20026;&#27010;&#29575;&#39044;&#27979;&#30340;&#30005;&#21147;&#20215;&#26684;&#21518;&#22788;&#29702;&#26041;&#27861;&#20013;&#65292;&#32467;&#21512;Isotonic Distributional Regression&#19982;&#20854;&#20182;&#20004;&#31181;&#26041;&#27861;&#30340;&#39044;&#27979;&#20998;&#24067;&#21487;&#20197;&#23454;&#29616;&#26174;&#33879;&#30340;&#24615;&#33021;&#25552;&#21319;&#12290;</title><link>https://arxiv.org/abs/2404.02270</link><description>&lt;p&gt;
&#30005;&#21147;&#20215;&#26684;&#27010;&#29575;&#39044;&#27979;&#30340;&#28857;&#39044;&#27979;&#21518;&#22788;&#29702;&#65306;&#22810;&#26679;&#24615;&#33267;&#20851;&#37325;&#35201;
&lt;/p&gt;
&lt;p&gt;
Postprocessing of point predictions for probabilistic forecasting of electricity prices: Diversity matters
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02270
&lt;/p&gt;
&lt;p&gt;
&#23558;&#28857;&#39044;&#27979;&#36716;&#25442;&#20026;&#27010;&#29575;&#39044;&#27979;&#30340;&#30005;&#21147;&#20215;&#26684;&#21518;&#22788;&#29702;&#26041;&#27861;&#20013;&#65292;&#32467;&#21512;Isotonic Distributional Regression&#19982;&#20854;&#20182;&#20004;&#31181;&#26041;&#27861;&#30340;&#39044;&#27979;&#20998;&#24067;&#21487;&#20197;&#23454;&#29616;&#26174;&#33879;&#30340;&#24615;&#33021;&#25552;&#21319;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20381;&#36182;&#20110;&#30005;&#21147;&#20215;&#26684;&#30340;&#39044;&#27979;&#20998;&#24067;&#36827;&#34892;&#25805;&#20316;&#20915;&#31574;&#30456;&#36739;&#20110;&#20165;&#22522;&#20110;&#28857;&#39044;&#27979;&#30340;&#20915;&#31574;&#21487;&#20197;&#24102;&#26469;&#26174;&#33879;&#26356;&#39640;&#30340;&#21033;&#28070;&#12290;&#28982;&#32780;&#65292;&#22312;&#23398;&#26415;&#21644;&#24037;&#19994;&#29615;&#22659;&#20013;&#24320;&#21457;&#30340;&#22823;&#22810;&#25968;&#27169;&#22411;&#20165;&#25552;&#20379;&#28857;&#39044;&#27979;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#19968;&#38382;&#39064;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#19977;&#31181;&#23558;&#28857;&#39044;&#27979;&#36716;&#25442;&#20026;&#27010;&#29575;&#39044;&#27979;&#30340;&#21518;&#22788;&#29702;&#26041;&#27861;&#65306;&#20998;&#20301;&#25968;&#22238;&#24402;&#24179;&#22343;&#12289;&#19968;&#33268;&#24615;&#39044;&#27979;&#21644;&#26368;&#36817;&#24341;&#20837;&#30340;&#31561;&#28201;&#20998;&#24067;&#22238;&#24402;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#34429;&#28982;&#31561;&#28201;&#20998;&#24067;&#22238;&#24402;&#34920;&#29616;&#26368;&#20026;&#22810;&#26679;&#21270;&#65292;&#20294;&#23558;&#20854;&#39044;&#27979;&#20998;&#24067;&#19982;&#21478;&#22806;&#20004;&#31181;&#26041;&#27861;&#32467;&#21512;&#20351;&#29992;&#65292;&#30456;&#36739;&#20110;&#20855;&#26377;&#27491;&#24577;&#20998;&#24067;&#35823;&#24046;&#30340;&#22522;&#20934;&#27169;&#22411;&#65292;&#22312;&#24503;&#22269;&#30005;&#21147;&#24066;&#22330;&#30340;4.5&#24180;&#27979;&#35797;&#26399;&#38388;&#65288;&#28085;&#30422;COVID&#22823;&#27969;&#34892;&#21644;&#20044;&#20811;&#20848;&#25112;&#20105;&#65289;&#65292;&#23454;&#29616;&#20102;&#32422;7.5%&#30340;&#25913;&#36827;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#36825;&#31181;&#32452;&#21512;&#30340;&#24615;&#33021;&#19982;&#26368;&#20808;&#36827;&#30340;Dis
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02270v1 Announce Type: new  Abstract: Operational decisions relying on predictive distributions of electricity prices can result in significantly higher profits compared to those based solely on point forecasts. However, the majority of models developed in both academic and industrial settings provide only point predictions. To address this, we examine three postprocessing methods for converting point forecasts into probabilistic ones: Quantile Regression Averaging, Conformal Prediction, and the recently introduced Isotonic Distributional Regression. We find that while IDR demonstrates the most varied performance, combining its predictive distributions with those of the other two methods results in an improvement of ca. 7.5% compared to a benchmark model with normally distributed errors, over a 4.5-year test period in the German power market spanning the COVID pandemic and the war in Ukraine. Remarkably, the performance of this combination is at par with state-of-the-art Dis
&lt;/p&gt;</description></item><item><title>&#20351;&#29992;&#32479;&#35745;&#29289;&#29702;&#23398;&#21644;&#24066;&#22330;&#33829;&#38144;&#21160;&#24577;&#30340;&#29702;&#35770;&#26694;&#26550;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#21019;&#26032;&#30340;&#26041;&#31243;&#65292;&#20934;&#30830;&#25429;&#25417;&#20102;&#24191;&#21578;&#25903;&#20986;&#19982;&#28040;&#36153;&#32773;&#21453;&#24212;&#20043;&#38388;&#30340;&#22797;&#26434;&#20851;&#31995;&#65292;&#24182;&#39564;&#35777;&#20102;&#20854;&#26377;&#25928;&#24615;&#12290;</title><link>https://arxiv.org/abs/2404.02175</link><description>&lt;p&gt;
&#28040;&#36153;&#32773;&#21453;&#24212;&#30340;&#31038;&#20250;&#21160;&#24577;&#65306;&#34701;&#21512;&#32479;&#35745;&#29289;&#29702;&#23398;&#19982;&#33829;&#38144;&#21160;&#24577;&#30340;&#32479;&#19968;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
Social Dynamics of Consumer Response: A Unified Framework Integrating Statistical Physics and Marketing Dynamics
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02175
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#32479;&#35745;&#29289;&#29702;&#23398;&#21644;&#24066;&#22330;&#33829;&#38144;&#21160;&#24577;&#30340;&#29702;&#35770;&#26694;&#26550;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#21019;&#26032;&#30340;&#26041;&#31243;&#65292;&#20934;&#30830;&#25429;&#25417;&#20102;&#24191;&#21578;&#25903;&#20986;&#19982;&#28040;&#36153;&#32773;&#21453;&#24212;&#20043;&#38388;&#30340;&#22797;&#26434;&#20851;&#31995;&#65292;&#24182;&#39564;&#35777;&#20102;&#20854;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29702;&#35299;&#28040;&#36153;&#32773;&#23545;&#24191;&#21578;&#36755;&#20837;&#30340;&#21453;&#24212;&#23545;&#20110;&#26088;&#22312;&#20248;&#21270;&#24191;&#21578;&#31574;&#30053;&#24182;&#25552;&#39640;&#24191;&#21578;&#27963;&#21160;&#26377;&#25928;&#24615;&#30340;&#33829;&#38144;&#20154;&#21592;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#30740;&#31350;&#36890;&#36807;&#24212;&#29992;&#28304;&#33258;&#29289;&#29702;&#23398;&#21644;&#31038;&#20250;&#24515;&#29702;&#23398;&#30340;&#29702;&#35770;&#26694;&#26550;&#65292;&#30740;&#31350;&#28040;&#36153;&#32773;&#34892;&#20026;&#30340;&#22797;&#26434;&#24615;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21019;&#26032;&#30340;&#26041;&#31243;&#65292;&#25429;&#25417;&#20102;&#24191;&#21578;&#25903;&#20986;&#19982;&#28040;&#36153;&#32773;&#21453;&#24212;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#21033;&#29992;&#20102;&#35832;&#22914;&#23545;&#31216;&#24615;&#12289;&#26631;&#24230;&#24459;&#21644;&#30456;&#21464;&#31561;&#27010;&#24565;&#12290;&#36890;&#36807;&#23558;&#25105;&#20204;&#30340;&#26041;&#31243;&#39564;&#35777;&#19982;Michaelis-Menten&#21644;Hill&#26041;&#31243;&#31561;&#33879;&#21517;&#27169;&#22411;&#30456;&#27604;&#36739;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20854;&#22312;&#20934;&#30830;&#34920;&#31034;&#28040;&#36153;&#32773;&#21453;&#24212;&#21160;&#24577;&#22797;&#26434;&#24615;&#26041;&#38754;&#30340;&#26377;&#25928;&#24615;&#12290;&#20998;&#26512;&#24378;&#35843;&#20102;&#20851;&#38190;&#27169;&#22411;&#21442;&#25968;&#65288;&#22914;&#33829;&#38144;&#25928;&#26524;&#12289;&#21453;&#24212;&#25935;&#24863;&#24230;&#21644;&#34892;&#20026;&#25935;&#24863;&#24230;&#65289;&#23545;&#24433;&#21709;&#28040;&#36153;&#32773;&#34892;&#20026;&#30340;&#37325;&#35201;&#24615;&#12290;&#35813;&#30740;&#31350;&#25506;&#35752;&#20102;&#24191;&#21578;&#21830;&#21644;&#33829;&#38144;&#20154;&#21592;&#30340;&#23454;&#38469;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02175v1 Announce Type: cross  Abstract: Comprehending how consumers react to advertising inputs is essential for marketers aiming to optimize advertising strategies and improve campaign effectiveness. This study examines the complex nature of consumer behaviour by applying theoretical frameworks derived from physics and social psychology. We present an innovative equation that captures the relation between spending on advertising and consumer response, using concepts such as symmetries, scaling laws, and phase transitions. By validating our equation against well-known models such as the Michaelis-Menten and Hill equations, we prove its effectiveness in accurately representing the complexity of consumer response dynamics. The analysis emphasizes the importance of key model parameters, such as marketing effectiveness, response sensitivity, and behavioural sensitivity, in influencing consumer behaviour. The work explores the practical implications for advertisers and marketers,
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Systemic Quantum Score (SQS)&#30340;&#26032;&#26041;&#27861;&#65292;&#23637;&#31034;&#22312;&#37329;&#34701;&#39046;&#22495;&#29983;&#20135;&#32423;&#24212;&#29992;&#26696;&#20363;&#20013;&#30456;&#27604;&#32431;&#32463;&#20856;&#27169;&#22411;&#26356;&#26377;&#20248;&#21183;&#65292;&#33021;&#22815;&#20174;&#36739;&#23569;&#25968;&#25454;&#28857;&#20013;&#25552;&#21462;&#27169;&#24335;&#24182;&#34920;&#29616;&#20986;&#26356;&#22909;&#24615;&#33021;&#12290;</title><link>https://arxiv.org/abs/2404.00015</link><description>&lt;p&gt;
&#21033;&#29992;&#37327;&#23376;&#22686;&#24378;&#26426;&#22120;&#23398;&#20064;&#36171;&#33021;&#20449;&#29992;&#35780;&#20998;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
Empowering Credit Scoring Systems with Quantum-Enhanced Machine Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00015
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Systemic Quantum Score (SQS)&#30340;&#26032;&#26041;&#27861;&#65292;&#23637;&#31034;&#22312;&#37329;&#34701;&#39046;&#22495;&#29983;&#20135;&#32423;&#24212;&#29992;&#26696;&#20363;&#20013;&#30456;&#27604;&#32431;&#32463;&#20856;&#27169;&#22411;&#26356;&#26377;&#20248;&#21183;&#65292;&#33021;&#22815;&#20174;&#36739;&#23569;&#25968;&#25454;&#28857;&#20013;&#25552;&#21462;&#27169;&#24335;&#24182;&#34920;&#29616;&#20986;&#26356;&#22909;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Quantum Kernels&#34987;&#35748;&#20026;&#22312;&#37327;&#23376;&#26426;&#22120;&#23398;&#20064;&#30340;&#26089;&#26399;&#38454;&#27573;&#25552;&#20379;&#20102;&#26377;&#29992;&#24615;&#12290;&#28982;&#32780;&#65292;&#22312;&#21033;&#29992;&#24222;&#22823;&#25968;&#25454;&#38598;&#26102;&#65292;&#39640;&#24230;&#22797;&#26434;&#30340;&#32463;&#20856;&#27169;&#22411;&#24456;&#38590;&#36229;&#36234;&#65292;&#29305;&#21035;&#26159;&#22312;&#29702;&#35299;&#21147;&#26041;&#38754;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#19968;&#26086;&#25968;&#25454;&#31232;&#32570;&#19988;&#20542;&#26012;&#65292;&#32463;&#20856;&#27169;&#22411;&#23601;&#20250;&#36935;&#21040;&#22256;&#38590;&#12290;&#37327;&#23376;&#29305;&#24449;&#31354;&#38388;&#34987;&#39044;&#35745;&#22312;&#36825;&#26679;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#24773;&#26223;&#20013;&#33021;&#22815;&#25214;&#21040;&#26356;&#22909;&#30340;&#25968;&#25454;&#29305;&#24449;&#21644;&#30446;&#26631;&#31867;&#21035;&#20043;&#38388;&#30340;&#32852;&#31995;&#65292;&#26368;&#37325;&#35201;&#30340;&#26159;&#22686;&#24378;&#20102;&#27867;&#21270;&#33021;&#21147;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Systemic Quantum Score (SQS)&#30340;&#26032;&#26041;&#27861;&#65292;&#24182;&#25552;&#20379;&#20102;&#21021;&#27493;&#32467;&#26524;&#65292;&#34920;&#26126;&#22312;&#37329;&#34701;&#34892;&#19994;&#29983;&#20135;&#32423;&#24212;&#29992;&#26696;&#20363;&#20013;&#65292;SQS&#21487;&#33021;&#27604;&#32431;&#32463;&#20856;&#27169;&#22411;&#20855;&#26377;&#20248;&#21183;&#12290;&#25105;&#20204;&#30340;&#20855;&#20307;&#30740;&#31350;&#34920;&#26126;&#65292;SQS&#33021;&#22815;&#20174;&#36739;&#23569;&#30340;&#25968;&#25454;&#28857;&#20013;&#25552;&#21462;&#20986;&#27169;&#24335;&#65292;&#24182;&#19988;&#22312;&#25968;&#25454;&#38656;&#27714;&#37327;&#22823;&#30340;&#31639;&#27861;&#65288;&#22914;XGBoost&#65289;&#19978;&#34920;&#29616;&#20986;&#26356;&#22909;&#30340;&#24615;&#33021;&#65292;&#24102;&#26469;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00015v1 Announce Type: cross  Abstract: Quantum Kernels are projected to provide early-stage usefulness for quantum machine learning. However, highly sophisticated classical models are hard to surpass without losing interpretability, particularly when vast datasets can be exploited. Nonetheless, classical models struggle once data is scarce and skewed. Quantum feature spaces are projected to find better links between data features and the target class to be predicted even in such challenging scenarios and most importantly, enhanced generalization capabilities. In this work, we propose a novel approach called Systemic Quantum Score (SQS) and provide preliminary results indicating potential advantage over purely classical models in a production grade use case for the Finance sector. SQS shows in our specific study an increased capacity to extract patterns out of fewer data points as well as improved performance over data-hungry algorithms such as XGBoost, providing advantage i
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;Wiener-Kallianpur&#21019;&#26032;&#34920;&#31034;&#30340;&#29983;&#25104;&#24335;&#27010;&#29575;&#39044;&#27979;&#26041;&#27861;&#65292;&#21253;&#25324;&#33258;&#32534;&#30721;&#22120;&#21644;&#26032;&#39062;&#30340;&#28145;&#24230;&#23398;&#20064;&#31639;&#27861;&#65292;&#20855;&#26377;&#28176;&#36817;&#26368;&#20248;&#24615;&#21644;&#32467;&#26500;&#25910;&#25947;&#24615;&#36136;&#65292;&#36866;&#29992;&#20110;&#23454;&#26102;&#24066;&#22330;&#36816;&#33829;&#20013;&#30340;&#39640;&#21160;&#24577;&#21644;&#27874;&#21160;&#26102;&#38388;&#24207;&#21015;&#12290;</title><link>https://arxiv.org/abs/2403.05743</link><description>&lt;p&gt;
&#20855;&#26377;&#24066;&#22330;&#36816;&#33829;&#24212;&#29992;&#30340;&#29983;&#25104;&#24335;&#27010;&#29575;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Generative Probabilistic Forecasting with Applications in Market Operations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05743
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;Wiener-Kallianpur&#21019;&#26032;&#34920;&#31034;&#30340;&#29983;&#25104;&#24335;&#27010;&#29575;&#39044;&#27979;&#26041;&#27861;&#65292;&#21253;&#25324;&#33258;&#32534;&#30721;&#22120;&#21644;&#26032;&#39062;&#30340;&#28145;&#24230;&#23398;&#20064;&#31639;&#27861;&#65292;&#20855;&#26377;&#28176;&#36817;&#26368;&#20248;&#24615;&#21644;&#32467;&#26500;&#25910;&#25947;&#24615;&#36136;&#65292;&#36866;&#29992;&#20110;&#23454;&#26102;&#24066;&#22330;&#36816;&#33829;&#20013;&#30340;&#39640;&#21160;&#24577;&#21644;&#27874;&#21160;&#26102;&#38388;&#24207;&#21015;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#29983;&#25104;&#24335;&#27010;&#29575;&#39044;&#27979;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#28304;&#33258;&#20110;&#38750;&#21442;&#25968;&#26102;&#38388;&#24207;&#21015;&#30340;Wiener-Kallianpur&#21019;&#26032;&#34920;&#31034;&#12290;&#22312;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#30340;&#33539;&#24335;&#19979;&#65292;&#25152;&#25552;&#20986;&#30340;&#39044;&#27979;&#26550;&#26500;&#21253;&#25324;&#19968;&#20010;&#33258;&#32534;&#30721;&#22120;&#65292;&#23558;&#38750;&#21442;&#25968;&#22810;&#21464;&#37327;&#38543;&#26426;&#36807;&#31243;&#36716;&#21270;&#20026;&#35268;&#33539;&#30340;&#21019;&#26032;&#24207;&#21015;&#65292;&#20174;&#20013;&#26681;&#25454;&#36807;&#21435;&#26679;&#26412;&#29983;&#25104;&#26410;&#26469;&#26102;&#38388;&#24207;&#21015;&#26679;&#26412;&#65292;&#26465;&#20214;&#26159;&#23427;&#20204;&#30340;&#27010;&#29575;&#20998;&#24067;&#21462;&#20915;&#20110;&#36807;&#21435;&#26679;&#26412;&#12290;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#28145;&#24230;&#23398;&#20064;&#31639;&#27861;&#65292;&#23558;&#28508;&#22312;&#36807;&#31243;&#38480;&#21046;&#20026;&#20855;&#26377;&#21305;&#37197;&#33258;&#32534;&#30721;&#22120;&#36755;&#20837;-&#36755;&#20986;&#26465;&#20214;&#27010;&#29575;&#20998;&#24067;&#30340;&#29420;&#31435;&#21516;&#20998;&#24067;&#24207;&#21015;&#12290;&#24314;&#31435;&#20102;&#25152;&#25552;&#20986;&#30340;&#29983;&#25104;&#24335;&#39044;&#27979;&#26041;&#27861;&#30340;&#28176;&#36817;&#26368;&#20248;&#24615;&#21644;&#32467;&#26500;&#25910;&#25947;&#24615;&#36136;&#12290;&#35813;&#26041;&#27861;&#22312;&#23454;&#26102;&#24066;&#22330;&#36816;&#33829;&#20013;&#28041;&#21450;&#39640;&#24230;&#21160;&#24577;&#21644;&#27874;&#21160;&#26102;&#38388;&#24207;&#21015;&#30340;&#19977;&#20010;&#24212;&#29992;&#26041;&#38754;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05743v1 Announce Type: cross  Abstract: This paper presents a novel generative probabilistic forecasting approach derived from the Wiener-Kallianpur innovation representation of nonparametric time series. Under the paradigm of generative artificial intelligence, the proposed forecasting architecture includes an autoencoder that transforms nonparametric multivariate random processes into canonical innovation sequences, from which future time series samples are generated according to their probability distributions conditioned on past samples. A novel deep-learning algorithm is proposed that constrains the latent process to be an independent and identically distributed sequence with matching autoencoder input-output conditional probability distributions. Asymptotic optimality and structural convergence properties of the proposed generative forecasting approach are established. Three applications involving highly dynamic and volatile time series in real-time market operations a
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#31163;&#25955;&#26102;&#38388;&#19979;&#36164;&#20135;&#23450;&#20215;&#30340;&#40065;&#26834;&#22522;&#26412;&#23450;&#29702;&#65292;&#24341;&#20837;&#20102;&#26032;&#30340;&#25299;&#25169;&#26694;&#26550;&#65292;&#21019;&#26032;&#24615;&#22320;&#35777;&#26126;&#20102;&#8220;&#26080;&#40065;&#26834;&#22871;&#21033;&#8221;&#26465;&#20214;&#19982;&#8220;&#40065;&#26834;&#23450;&#20215;&#20307;&#31995;&#8221;&#30340;&#31561;&#20215;&#24615;&#65292;&#23637;&#31034;&#20102;&#21452;&#21521;&#22871;&#26399;&#20445;&#20540;&#20197;&#21450;&#23436;&#22791;&#24615;&#12290;</title><link>https://arxiv.org/abs/2007.02553</link><description>&lt;p&gt;
&#35770;&#31163;&#25955;&#26102;&#38388;&#20013;&#36164;&#20135;&#23450;&#20215;&#30340;&#40065;&#26834;&#22522;&#26412;&#23450;&#29702;
&lt;/p&gt;
&lt;p&gt;
On robust fundamental theorems of asset pricing in discrete time
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2007.02553
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31163;&#25955;&#26102;&#38388;&#19979;&#36164;&#20135;&#23450;&#20215;&#30340;&#40065;&#26834;&#22522;&#26412;&#23450;&#29702;&#65292;&#24341;&#20837;&#20102;&#26032;&#30340;&#25299;&#25169;&#26694;&#26550;&#65292;&#21019;&#26032;&#24615;&#22320;&#35777;&#26126;&#20102;&#8220;&#26080;&#40065;&#26834;&#22871;&#21033;&#8221;&#26465;&#20214;&#19982;&#8220;&#40065;&#26834;&#23450;&#20215;&#20307;&#31995;&#8221;&#30340;&#31561;&#20215;&#24615;&#65292;&#23637;&#31034;&#20102;&#21452;&#21521;&#22871;&#26399;&#20445;&#20540;&#20197;&#21450;&#23436;&#22791;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#33268;&#21147;&#20110;&#30740;&#31350;&#31163;&#25955;&#26102;&#38388;&#21644;&#26377;&#38480;&#26102;&#38388;&#36328;&#24230;&#19979;&#36164;&#20135;&#23450;&#20215;&#30340;&#40065;&#26834;&#22522;&#26412;&#23450;&#29702;&#12290;&#19981;&#30830;&#23450;&#24615;&#36890;&#36807;&#21516;&#19968;&#27010;&#29575;&#31354;&#38388;&#19978;&#30340;&#65288;&#21487;&#33021;&#26159;&#19981;&#21487;&#25968;&#30340;&#65289;&#19968;&#26063;&#20215;&#26684;&#36807;&#31243;&#24314;&#27169;&#12290;&#25105;&#20204;&#30340;&#25216;&#26415;&#20551;&#35774;&#26159;&#20215;&#26684;&#36807;&#31243;&#23545;&#20110;&#19981;&#30830;&#23450;&#21442;&#25968;&#26159;&#36830;&#32493;&#30340;&#12290;&#22312;&#36825;&#19968;&#29615;&#22659;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#26032;&#30340;&#25299;&#25169;&#26694;&#26550;&#65292;&#20351;&#25105;&#20204;&#33021;&#22815;&#20351;&#29992;&#28041;&#21450; $L^p$ &#31354;&#38388;&#12289;Hahn-Banach &#20998;&#31163;&#23450;&#29702;&#20197;&#21450;&#20854;&#20182;&#26469;&#33258;&#27867;&#20989;&#20998;&#26512;&#30340;&#24037;&#20855;&#30340;&#32463;&#20856;&#22871;&#21033;&#23450;&#20215;&#29702;&#35770;&#35770;&#35777;&#12290;&#31532;&#19968;&#20010;&#32467;&#26524;&#26159;&#8220;&#26080;&#40065;&#26834;&#22871;&#21033;&#8221;&#26465;&#20214;&#19982;&#23384;&#22312;&#26032;&#30340;&#8220;&#40065;&#26834;&#23450;&#20215;&#20307;&#31995;&#8221;&#20043;&#38388;&#30340;&#31561;&#20215;&#24615;&#12290;&#31532;&#20108;&#20010;&#32467;&#26524;&#23637;&#31034;&#20102;&#21452;&#21521;&#22871;&#26399;&#20445;&#20540;&#21644;&#22312;&#25903;&#20184;&#20989;&#25968;&#19978;&#19981;&#23384;&#22312;&#38480;&#21046;&#24615;&#26465;&#20214;&#30340;&#22871;&#26399;&#20445;&#20540;&#31574;&#30053;&#30340;&#23384;&#22312;&#65292;&#36825;&#19982;&#20854;&#20182;&#30456;&#20851;&#30740;&#31350;&#19981;&#21516;&#12290;&#31532;&#19977;&#20010;&#32467;&#26524;&#35752;&#35770;&#20102;&#24403;&#21069;&#40065;&#26834;&#35774;&#32622;&#20013;&#30340;&#23436;&#22791;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2007.02553v4 Announce Type: replace  Abstract: This paper is devoted to a study of robust fundamental theorems of asset pricing in discrete time and finite horizon settings. Uncertainty is modelled by a (possibly uncountable) family of price processes on the same probability space. Our technical assumption is the continuity of the price processes with respect to uncertain parameters. In this setting, we introduce a new topological framework which allows us to use the classical arguments in arbitrage pricing theory involving $L^p$ spaces, the Hahn-Banach separation theorem and other tools from functional analysis. The first result is the equivalence of a ``no robust arbitrage" condition and the existence of a new ``robust pricing system". The second result shows superhedging dualities and the existence of superhedging strategies without restrictive conditions on payoff functions, unlike other related studies. The third result discusses completeness in the present robust setting. W
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20351;&#29992;&#35745;&#31639;&#26426;&#27169;&#25311;&#26469;&#27604;&#36739;&#21508;&#31181;&#25237;&#31080;&#26041;&#24335;&#20419;&#36827;&#25919;&#27835;&#22949;&#21327;&#21644;&#20943;&#23569;&#31038;&#20250;&#32039;&#24352;&#30340;&#25928;&#26524;&#65292;&#21457;&#29616;STAR&#25237;&#31080;&#21644;&#23380;&#22810;&#22622;&#25237;&#31080;&#28608;&#21169;&#20505;&#36873;&#20154;&#21521;&#23545;&#31435;&#30340;&#36873;&#27665;&#21644;&#33258;&#24049;&#30340;&#22522;&#30784;&#36873;&#27665;&#19968;&#26679;&#21560;&#24341;&#25903;&#25345;&#12290;</title><link>http://arxiv.org/abs/2306.07147</link><description>&lt;p&gt;
&#20505;&#36873;&#20154;&#28608;&#21169;&#20998;&#37197;&#65306;&#36873;&#20030;&#26041;&#24335;&#22914;&#20309;&#22609;&#36896;&#36873;&#20030;&#28608;&#21169;
&lt;/p&gt;
&lt;p&gt;
Candidate Incentive Distributions: How voting methods shape electoral incentives. (arXiv:2306.07147v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.07147
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#35745;&#31639;&#26426;&#27169;&#25311;&#26469;&#27604;&#36739;&#21508;&#31181;&#25237;&#31080;&#26041;&#24335;&#20419;&#36827;&#25919;&#27835;&#22949;&#21327;&#21644;&#20943;&#23569;&#31038;&#20250;&#32039;&#24352;&#30340;&#25928;&#26524;&#65292;&#21457;&#29616;STAR&#25237;&#31080;&#21644;&#23380;&#22810;&#22622;&#25237;&#31080;&#28608;&#21169;&#20505;&#36873;&#20154;&#21521;&#23545;&#31435;&#30340;&#36873;&#27665;&#21644;&#33258;&#24049;&#30340;&#22522;&#30784;&#36873;&#27665;&#19968;&#26679;&#21560;&#24341;&#25903;&#25345;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#35745;&#31639;&#26426;&#27169;&#25311;&#26469;&#30830;&#23450;&#21508;&#31181;&#25237;&#31080;&#26041;&#24335;&#20419;&#36827;&#25919;&#27835;&#22949;&#21327;&#21644;&#20943;&#23569;&#31038;&#20250;&#32039;&#24352;&#30340;&#20542;&#21521;&#65292;&#21457;&#29616;&#21363;&#26102;&#36873;&#20030;&#25237;&#31080;&#65288;Instant Runoff Voting&#65289;&#28608;&#21169;&#20505;&#36873;&#20154;&#21560;&#24341;&#26356;&#24191;&#27867;&#30340;&#36873;&#27665;&#25903;&#25345;&#65292;&#20294;&#20173;&#36828;&#19981;&#22914;&#21333;&#36194;&#23478;&#22810;&#25968;&#25237;&#31080;&#65288;single-winner Plurality Voting&#65289;&#40723;&#21169;&#20505;&#36873;&#20154;&#21560;&#24341;&#20854;&#22522;&#26412;&#36873;&#27665;&#32780;&#19981;&#26159;&#26469;&#33258;&#21453;&#23545;&#38453;&#33829;&#30340;&#36873;&#27665;&#12290;&#30456;&#21453;&#65292;&#25105;&#20204;&#21457;&#29616;&#21253;&#25324;STAR&#65288;&#35780;&#20998;&#33258;&#21160;&#36827;&#20837;&#27425;&#36718;&#25237;&#31080;&#65289;&#25237;&#31080;&#21644;&#23380;&#22810;&#22622;&#25237;&#31080;&#22312;&#20869;&#30340;&#20854;&#20182;&#25237;&#31080;&#26041;&#27861;&#65292;&#28608;&#21169;&#20505;&#36873;&#20154;&#21521;&#23545;&#31435;&#30340;&#36873;&#27665;&#21644;&#33258;&#24049;&#30340;&#22522;&#30784;&#36873;&#27665;&#19968;&#26679;&#21560;&#24341;&#25903;&#25345;&#65292;&#32780;&#36825;&#20123;&#25237;&#31080;&#26041;&#27861;&#20043;&#38388;&#30340;&#24046;&#24322;&#38543;&#30528;&#31454;&#36873;&#20154;&#25968;&#30340;&#22686;&#21152;&#32780;&#21464;&#24471;&#26356;&#21152;&#26126;&#26174;&#12290;
&lt;/p&gt;
&lt;p&gt;
We evaluate the tendency for different voting methods to promote political compromise and reduce tensions in a society by using computer simulations to determine which voters candidates are incentivized to appeal to. We find that Instant Runoff Voting incentivizes candidates to appeal to a wider range of voters than single-winner Plurality Voting, but that it still leaves candidates far more strongly incentivized to appeal to their base than to voters in opposing factions. In contrast, we find that other voting methods, including STAR (Score Then Automatic Runoff) Voting and Condorcet methods, incentivize candidates to appeal to currently-opposed voters as much to their base, and that these differences between voting methods become more pronounced the more candidates are in the race.
&lt;/p&gt;</description></item></channel></rss>