<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;GAN&#39640;&#25928;&#35745;&#31639;&#27874;&#21160;&#29575;&#26354;&#38754;&#30340;&#26041;&#27861;&#12290;&#25152;&#25552;&#20986;&#30340;GAN&#27169;&#22411;&#20801;&#35768;&#20351;&#29992;&#27973;&#23618;&#32593;&#32476;&#65292;&#20174;&#32780;&#22823;&#22823;&#38477;&#20302;&#20102;&#35745;&#31639;&#25104;&#26412;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#35745;&#31639;&#27874;&#21160;&#29575;&#26354;&#38754;&#26041;&#38754;&#20855;&#26377;&#20248;&#21183;&#12290;</title><link>http://arxiv.org/abs/2304.13128</link><description>&lt;p&gt;
&#20351;&#29992;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#23398;&#20064;&#27874;&#21160;&#29575;&#26354;&#38754;
&lt;/p&gt;
&lt;p&gt;
Learning Volatility Surfaces using Generative Adversarial Networks. (arXiv:2304.13128v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.13128
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;GAN&#39640;&#25928;&#35745;&#31639;&#27874;&#21160;&#29575;&#26354;&#38754;&#30340;&#26041;&#27861;&#12290;&#25152;&#25552;&#20986;&#30340;GAN&#27169;&#22411;&#20801;&#35768;&#20351;&#29992;&#27973;&#23618;&#32593;&#32476;&#65292;&#20174;&#32780;&#22823;&#22823;&#38477;&#20302;&#20102;&#35745;&#31639;&#25104;&#26412;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#35745;&#31639;&#27874;&#21160;&#29575;&#26354;&#38754;&#26041;&#38754;&#20855;&#26377;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65288;GAN&#65289;&#39640;&#25928;&#35745;&#31639;&#27874;&#21160;&#29575;&#26354;&#38754;&#30340;&#26041;&#27861;&#12290;&#36825;&#31181;&#26041;&#27861;&#21033;&#29992;&#20102;GAN&#31070;&#32463;&#32593;&#32476;&#30340;&#29305;&#27530;&#32467;&#26500;&#65292;&#19968;&#26041;&#38754;&#21487;&#20197;&#20174;&#35757;&#32451;&#25968;&#25454;&#20013;&#23398;&#20064;&#27874;&#21160;&#29575;&#26354;&#38754;&#65292;&#21478;&#19968;&#26041;&#38754;&#21487;&#20197;&#25191;&#34892;&#26080;&#22871;&#21033;&#26465;&#20214;&#12290;&#29305;&#21035;&#22320;&#65292;&#29983;&#25104;&#22120;&#32593;&#32476;&#30001;&#37492;&#21035;&#22120;&#36741;&#21161;&#35757;&#32451;&#65292;&#37492;&#21035;&#22120;&#35780;&#20272;&#29983;&#25104;&#30340;&#27874;&#21160;&#29575;&#26159;&#21542;&#19982;&#30446;&#26631;&#20998;&#24067;&#30456;&#21305;&#37197;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#30340;&#26694;&#26550;&#36890;&#36807;&#24341;&#20837;&#24809;&#32602;&#39033;&#20316;&#20026;&#27491;&#21017;&#21270;&#39033;&#65292;&#35757;&#32451;GAN&#32593;&#32476;&#20197;&#28385;&#36275;&#26080;&#22871;&#21033;&#32422;&#26463;&#12290;&#25152;&#25552;&#20986;&#30340;GAN&#27169;&#22411;&#20801;&#35768;&#20351;&#29992;&#27973;&#23618;&#32593;&#32476;&#65292;&#20174;&#32780;&#22823;&#22823;&#38477;&#20302;&#20102;&#35745;&#31639;&#25104;&#26412;&#12290;&#22312;&#23454;&#39564;&#20013;&#65292;&#25105;&#20204;&#36890;&#36807;&#19982;&#35745;&#31639;&#38544;&#21547;&#21644;&#26412;&#22320;&#27874;&#21160;&#29575;&#26354;&#38754;&#30340;&#26368;&#20808;&#36827;&#26041;&#27861;&#36827;&#34892;&#23545;&#27604;&#65292;&#23637;&#31034;&#20102;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#30340;&#24615;&#33021;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#30456;&#23545;&#20110;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#65288;ANN&#65289;&#26041;&#27861;&#65292;&#25105;&#20204;&#30340;GAN&#27169;&#22411;&#22312;&#31934;&#24230;&#21644;&#23454;&#38469;&#24212;&#29992;&#20013;&#37117;&#20855;&#26377;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we propose a generative adversarial network (GAN) approach for efficiently computing volatility surfaces. The idea is to make use of the special GAN neural architecture so that on one hand, we can learn volatility surfaces from training data and on the other hand, enforce no-arbitrage conditions. In particular, the generator network is assisted in training by a discriminator that evaluates whether the generated volatility matches the target distribution. Meanwhile, our framework trains the GAN network to satisfy the no-arbitrage constraints by introducing penalties as regularization terms. The proposed GAN model allows the use of shallow networks which results in much less computational costs. In our experiments, we demonstrate the performance of the proposed method by comparing with the state-of-the-art methods for computing implied and local volatility surfaces. We show that our GAN model can outperform artificial neural network (ANN) approaches in terms of accuracy an
&lt;/p&gt;</description></item></channel></rss>