<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#37319;&#29992;&#22810;&#20803;&#36164;&#20135;&#27169;&#22411;&#22522;&#20110;L&#233;vy&#36807;&#31243;&#65292;&#29992;&#20110;&#23450;&#20215;&#24322;&#31867;&#34893;&#29983;&#21697;&#65292;&#30528;&#37325;&#32771;&#34385;&#27169;&#22411;&#25429;&#25417;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#20381;&#36182;&#30340;&#33021;&#21147;&#12290;&#36890;&#36807;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#36827;&#34892;&#20272;&#20540;&#12290;</title><link>http://arxiv.org/abs/2303.13346</link><description>&lt;p&gt;
&#22810;&#20803;L&#233;vy&#27169;&#22411;&#65306;&#26657;&#20934;&#19982;&#23450;&#20215;&#12290;
&lt;/p&gt;
&lt;p&gt;
Multivariate L\'evy Models: Calibration and Pricing. (arXiv:2303.13346v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.13346
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#37319;&#29992;&#22810;&#20803;&#36164;&#20135;&#27169;&#22411;&#22522;&#20110;L&#233;vy&#36807;&#31243;&#65292;&#29992;&#20110;&#23450;&#20215;&#24322;&#31867;&#34893;&#29983;&#21697;&#65292;&#30528;&#37325;&#32771;&#34385;&#27169;&#22411;&#25429;&#25417;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#20381;&#36182;&#30340;&#33021;&#21147;&#12290;&#36890;&#36807;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#36827;&#34892;&#20272;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#37319;&#29992;&#22522;&#20110;L&#233;vy&#36807;&#31243;&#30340;&#22810;&#20803;&#36164;&#20135;&#27169;&#22411;&#65292;&#29992;&#20110;&#23450;&#20215;&#24322;&#31867;&#34893;&#29983;&#21697;&#12290;&#25105;&#20204;&#27604;&#36739;&#23427;&#20204;&#25311;&#21512;&#24066;&#22330;&#25968;&#25454;&#21644;&#22797;&#21046;&#20215;&#26684;&#22522;&#20934;&#30340;&#33021;&#21147;&#65292;&#35780;&#20272;&#23427;&#20204;&#22312;&#21442;&#25968;&#21270;&#21644;&#20381;&#36182;&#32467;&#26500;&#26041;&#38754;&#30340;&#28789;&#27963;&#24615;&#12290;&#25105;&#20204;&#22238;&#39038;&#20102;&#26368;&#36817;&#22312;&#22810;&#20803;&#35774;&#23450;&#20013;&#30340;&#39118;&#38505;&#20013;&#24615;&#26657;&#20934;&#26041;&#27861;&#21644;&#25216;&#26415;&#65292;&#24182;&#25552;&#20379;&#20102;&#22312;&#23454;&#38469;&#24773;&#20917;&#19979;&#20570;&#20986;&#26126;&#26234;&#20915;&#31574;&#30340;&#24037;&#20855;&#12290;&#29305;&#21035;&#20851;&#27880;&#27169;&#22411;&#25429;&#25417;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#20381;&#36182;&#30340;&#33021;&#21147;&#65292;&#23545;&#20854;&#23450;&#20215;&#24615;&#33021;&#20135;&#29983;&#24433;&#21709;&#12290;&#37492;&#20110;&#20998;&#26512;&#34893;&#29983;&#21697;&#30340;&#24322;&#31867;&#29305;&#24615;&#65292;&#20272;&#20540;&#26159;&#36890;&#36807;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#36827;&#34892;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this research we employ a range of multivariate asset models based on L\'evy processes to price exotic derivatives. We compare their ability to fit market data and replicate price benchmarks, and evaluate their flexibility in terms of parametrization and dependence structure. We review recent risk-neutral calibration approaches and techniques in the multivariate setting, and provide tools to make well-informed decisions in a practical context. A special focus is given to the ability of the models to capture linear and nonlinear dependence, with implications on their pricing performance. Given the exotic features of the analyzed derivatives, valuation is carried out through Monte Carlo methods.
&lt;/p&gt;</description></item><item><title>&#31227;&#27665;&#22312;&#19968;&#20010;&#37197;&#32473;&#32844;&#20301;&#30340;&#21305;&#37197;&#27169;&#22411;&#20013;&#21487;&#33021;&#38477;&#20302;&#26412;&#22320;&#24037;&#20154;&#30340;&#23601;&#19994;&#29575;&#65292;&#20294;&#31227;&#27665;&#23545;&#26412;&#22320;&#31119;&#21033;&#30340;&#24635;&#20307;&#24433;&#21709;&#21462;&#20915;&#20110;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#29366;&#24577;&#65292;&#24403;&#21171;&#21160;&#21147;&#24066;&#22330;&#32321;&#33635;&#26102;&#65292;&#31227;&#27665;&#30340;&#24433;&#21709;&#21487;&#33021;&#26159;&#27491;&#38754;&#30340;&#12290;</title><link>http://arxiv.org/abs/2303.13319</link><description>&lt;p&gt;
&#20026;&#20160;&#20040;&#31227;&#27665;&#24635;&#34987;&#25351;&#36131;&#31363;&#21462;&#20154;&#20204;&#30340;&#24037;&#20316;?
&lt;/p&gt;
&lt;p&gt;
Why Are Immigrants Always Accused of Stealing People's Jobs?. (arXiv:2303.13319v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.13319
&lt;/p&gt;
&lt;p&gt;
&#31227;&#27665;&#22312;&#19968;&#20010;&#37197;&#32473;&#32844;&#20301;&#30340;&#21305;&#37197;&#27169;&#22411;&#20013;&#21487;&#33021;&#38477;&#20302;&#26412;&#22320;&#24037;&#20154;&#30340;&#23601;&#19994;&#29575;&#65292;&#20294;&#31227;&#27665;&#23545;&#26412;&#22320;&#31119;&#21033;&#30340;&#24635;&#20307;&#24433;&#21709;&#21462;&#20915;&#20110;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#29366;&#24577;&#65292;&#24403;&#21171;&#21160;&#21147;&#24066;&#22330;&#32321;&#33635;&#26102;&#65292;&#31227;&#27665;&#30340;&#24433;&#21709;&#21487;&#33021;&#26159;&#27491;&#38754;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31227;&#27665;&#24635;&#26159;&#34987;&#25351;&#36131;&#31363;&#21462;&#20154;&#20204;&#30340;&#24037;&#20316;&#12290;&#28982;&#32780;&#65292;&#22312;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#26032;&#21476;&#20856;&#27169;&#22411;&#20013;&#65292;&#27599;&#20010;&#20154;&#37117;&#26377;&#24037;&#20316;&#21487;&#20570;&#65292;&#20063;&#27809;&#26377;&#24037;&#20316;&#21487;&#34987;&#31363;&#21462;&#65288;&#27809;&#26377;&#22833;&#19994;&#65292;&#22240;&#27492;&#24819;&#24037;&#20316;&#30340;&#20154;&#37117;&#21487;&#20197;&#24037;&#20316;&#65289;&#12290;&#22312;&#26631;&#20934;&#21305;&#37197;&#27169;&#22411;&#20013;&#65292;&#23384;&#22312;&#19968;&#20123;&#22833;&#19994;&#65292;&#20294;&#30001;&#20110;&#21171;&#21160;&#21147;&#38656;&#27714;&#23436;&#20840;&#24377;&#24615;&#65292;&#22240;&#27492;&#26032;&#36827;&#20837;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#20154;&#34987;&#21560;&#25910;&#26102;&#19981;&#20250;&#24433;&#21709;&#27714;&#32844;&#32773;&#30340;&#21069;&#26223;&#12290;&#20877;&#27425;&#35828;&#26126;&#65292;&#24403;&#31227;&#27665;&#21040;&#36798;&#26102;&#27809;&#26377;&#24037;&#20316;&#20250;&#34987;&#31363;&#21462;&#12290;&#26412;&#25991;&#26174;&#31034;&#65292;&#22312;&#19968;&#20010;&#20855;&#26377;&#23601;&#19994;&#37197;&#32473;&#30340;&#21305;&#37197;&#27169;&#22411;&#20013;&#65292;&#31227;&#27665;&#30340;&#36827;&#20837;&#20250;&#38477;&#20302;&#26412;&#22320;&#24037;&#20154;&#30340;&#23601;&#19994;&#29575;&#12290;&#27492;&#22806;&#65292;&#24403;&#21171;&#21160;&#21147;&#24066;&#22330;&#19981;&#26223;&#27668;&#26102;&#65292;&#23601;&#19994;&#29575;&#30340;&#38477;&#24133;&#26356;&#22823;&#65292;&#22240;&#20026;&#37027;&#26102;&#24037;&#20316;&#26356;&#21152;&#31232;&#32570;&#12290;&#22240;&#20026;&#31227;&#27665;&#38477;&#20302;&#20102;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#32039;&#24352;&#31243;&#24230;&#65292;&#20351;&#24471;&#20844;&#21496;&#26356;&#23481;&#26131;&#25307;&#32856;&#65292;&#24182;&#25913;&#21892;&#20844;&#21496;&#21033;&#28070;&#12290;&#31227;&#27665;&#23545;&#26412;&#22320;&#31119;&#21033;&#30340;&#24635;&#20307;&#24433;&#21709;&#21462;&#20915;&#20110;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#29366;&#24577;&#12290;&#24403;&#21171;&#21160;&#21147;&#24066;&#22330;&#20986;&#29616;&#34928;&#36864;&#26102;&#24635;&#20307;&#24433;&#21709;&#22987;&#32456;&#26159;&#36127;&#38754;&#30340;&#65292;&#24182;&#19988;&#24403;&#21171;&#21160;&#21147;&#24066;&#22330;&#32321;&#33635;&#26102;&#21487;&#33021;&#26159;&#27491;&#38754;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Immigrants are always accused of stealing people's jobs. Yet, in a neoclassical model of the labor market, there are jobs for everybody and no jobs to steal. (There is no unemployment, so anybody who wants to work can work.) In standard matching models, there is some unemployment, but labor demand is perfectly elastic so new entrants into the labor force are absorbed without affecting jobseekers' prospects. Once again, no jobs are stolen when immigrants arrive. This paper shows that in a matching model with job rationing, in contrast, the entry of immigrants reduces the employment rate of native workers. Moreover, the reduction in employment rate is sharper when the labor market is depressed -- because jobs are more scarce then. Because immigration reduces labor-market tightness, it makes it easier for firms to recruit and improves firm profits. The overall effect of immigration on native welfare depends on the state of the labor market. It is always negative when the labor market is i
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#28151;&#21512;&#27169;&#25311;&#36864;&#28779;&#31639;&#27861;&#39640;&#25928;&#35299;&#20915;&#25351;&#25968;&#36319;&#36394;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#35813;&#31639;&#27861;&#33021;&#22815;&#20811;&#26381;&#25910;&#30410;&#38750;&#31283;&#23450;&#24615;&#30340;&#29616;&#35937;&#65292;&#36866;&#29992;&#20110;&#22823;&#22411;&#25351;&#25968;&#65292;&#24182;&#19988;&#20855;&#26377;&#28789;&#27963;&#30340;&#36130;&#21153;&#30456;&#20851;&#32422;&#26463;&#26465;&#20214;&#12290;</title><link>http://arxiv.org/abs/2303.13282</link><description>&lt;p&gt;
&#19968;&#31181;&#29992;&#28151;&#21512;&#27169;&#25311;&#36864;&#28779;&#31639;&#27861;&#20934;&#30830;&#35299;&#20915;&#25351;&#25968;&#36319;&#36394;&#38382;&#39064;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Accurate solution of the Index Tracking problem with a hybrid simulated annealing algorithm. (arXiv:2303.13282v1 [cond-mat.stat-mech])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.13282
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#28151;&#21512;&#27169;&#25311;&#36864;&#28779;&#31639;&#27861;&#39640;&#25928;&#35299;&#20915;&#25351;&#25968;&#36319;&#36394;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#35813;&#31639;&#27861;&#33021;&#22815;&#20811;&#26381;&#25910;&#30410;&#38750;&#31283;&#23450;&#24615;&#30340;&#29616;&#35937;&#65292;&#36866;&#29992;&#20110;&#22823;&#22411;&#25351;&#25968;&#65292;&#24182;&#19988;&#20855;&#26377;&#28789;&#27963;&#30340;&#36130;&#21153;&#30456;&#20851;&#32422;&#26463;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20027;&#21160;&#31649;&#29702;&#30340;&#25237;&#36164;&#32452;&#21512;&#24448;&#24448;&#38271;&#26399;&#20869;&#26080;&#27861;&#20987;&#36133;&#24066;&#22330;&#12290;&#22240;&#27492;&#65292;&#35768;&#22810;&#25237;&#36164;&#32773;&#36890;&#24120;&#36716;&#21521;&#34987;&#21160;&#31649;&#29702;&#30340;&#25237;&#36164;&#32452;&#21512;&#65292;&#26088;&#22312;&#36319;&#36394;&#26576;&#20010;&#37329;&#34701;&#25351;&#25968;&#12290;&#24314;&#31435;&#36825;&#26679;&#30340;&#34987;&#21160;&#32452;&#21512;&#24182;&#26368;&#23567;&#21270;&#20132;&#26131;&#25104;&#26412;&#30340;&#20219;&#21153;&#31216;&#20026;&#25351;&#25968;&#36319;&#36394;&#65288;IT&#65289;&#65292;&#20854;&#30446;&#26631;&#26159;&#36890;&#36807;&#20165;&#25345;&#26377;&#25351;&#25968;&#20013;&#19968;&#23567;&#37096;&#20998;&#30340;&#36164;&#20135;&#26469;&#36319;&#36394;&#25351;&#25968;&#12290;&#30001;&#20110;&#26159;NP&#38590;&#38382;&#39064;&#65292;&#23545;&#20110;&#36229;&#36807;100&#20010;&#36164;&#20135;&#30340;&#25351;&#25968;&#26469;&#35828;&#65292;&#30830;&#20999;&#35299;&#27861;&#21464;&#24471;&#19981;&#21487;&#34892;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#22411;&#30340;&#28151;&#21512;&#27169;&#25311;&#36864;&#28779;&#26041;&#27861;&#65292;&#21487;&#20197;&#39640;&#25928;&#22320;&#35299;&#20915;&#22823;&#22411;&#25351;&#25968;&#30340;IT&#38382;&#39064;&#65292;&#24182;&#19988;&#36275;&#22815;&#28789;&#27963;&#20197;&#36866;&#24212;&#36130;&#21153;&#30456;&#20851;&#30340;&#32422;&#26463;&#26465;&#20214;&#12290;&#36890;&#36807;&#36319;&#36394;2011&#24180;&#33267;2018&#24180;&#20043;&#38388;&#30340;&#26631;&#20934;&#26222;&#23572;500&#25351;&#25968;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#31639;&#27861;&#33021;&#22815;&#22312;&#36807;&#21435;&#25910;&#30410;&#30340;&#26679;&#26412;&#26399;&#38388;&#20013;&#25214;&#21040;&#26368;&#20248;&#35299;&#65292;&#24182;&#19988;&#21487;&#20197;&#35843;&#25972;&#20197;&#22312;&#26410;&#26469;&#25910;&#30410;&#30340;&#26679;&#26412;&#26399;&#38388;&#20013;&#25552;&#20379;&#26368;&#20248;&#25910;&#30410;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#20851;&#27880;&#20102;IT&#38382;&#39064;&#20013;&#30340;&#31283;&#23450;&#24615;&#65292;&#24182;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#31639;&#27861;&#33021;&#22815;&#20811;&#26381;&#25910;&#30410;&#38750;&#31283;&#23450;&#24615;&#36825;&#19968;&#29616;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;
An actively managed portfolio almost never beats the market in the long term. Thus, many investors often resort to passively managed portfolios whose aim is to follow a certain financial index. The task of building such passive portfolios aiming also to minimize the transaction costs is called Index Tracking (IT), where the goal is to track the index by holding only a small subset of assets in the index. As such, it is an NP-hard problem and becomes unfeasible to solve exactly for indices with more than 100 assets. In this work, we present a novel hybrid simulated annealing method that can efficiently solve the IT problem for large indices and is flexible enough to adapt to financially relevant constraints. By tracking the S&amp;P-500 index between the years 2011 and 2018 we show that our algorithm is capable of finding optimal solutions in the in-sample period of past returns and can be tuned to provide optimal returns in the out-of-sample period of future returns. Finally, we focus on th
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#25552;&#20986;&#26032;&#30340;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;&#20043;&#21069;&#22312;&#26576;&#20123;&#24322;&#36136;&#24615;&#20195;&#29702;&#20154;&#19981;&#23436;&#20840;&#24066;&#22330;&#27169;&#22411;&#30340;&#23439;&#35266;&#32463;&#27982;&#22343;&#34913;&#35299;&#20915;&#26041;&#26696;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2303.12567</link><description>&lt;p&gt;
&#32463;&#27982;&#20027;&#20307;&#30340;&#21160;&#24577;&#36816;&#36755;
&lt;/p&gt;
&lt;p&gt;
Dynamic Transportation of Economic Agents. (arXiv:2303.12567v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.12567
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#25552;&#20986;&#26032;&#30340;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;&#20043;&#21069;&#22312;&#26576;&#20123;&#24322;&#36136;&#24615;&#20195;&#29702;&#20154;&#19981;&#23436;&#20840;&#24066;&#22330;&#27169;&#22411;&#30340;&#23439;&#35266;&#32463;&#27982;&#22343;&#34913;&#35299;&#20915;&#26041;&#26696;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26159;&#22312;&#21457;&#29616;&#20102;&#19968;&#20010;&#20849;&#21516;&#30340;&#31574;&#30053;&#26410;&#33021;&#23558;&#26576;&#20123;&#24322;&#36136;&#24615;&#20195;&#29702;&#20154;&#19981;&#23436;&#20840;&#24066;&#22330;&#27169;&#22411;&#30340;&#23439;&#35266;&#32463;&#27982;&#22343;&#34913;&#23450;&#20301;&#21040;&#24191;&#27867;&#24341;&#29992;&#30340;&#22522;&#20934;&#30740;&#31350;&#20013;&#32780;&#24341;&#21457;&#30340;&#12290;&#36890;&#36807;&#27169;&#20223;Dumas&#21644;Lyasoff&#65288;2012&#65289;&#25552;&#20986;&#30340;&#26041;&#27861;&#65292;&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#25551;&#36848;&#65292;&#22312;&#38754;&#23545;&#19981;&#21487;&#20445;&#38505;&#30340;&#24635;&#20307;&#21644;&#20010;&#20307;&#39118;&#38505;&#30340;&#22823;&#37327;&#20114;&#21160;&#32463;&#27982;&#20307;&#20195;&#34920;&#30340;&#31169;&#20154;&#29366;&#24577;&#20998;&#24067;&#30340;&#36816;&#21160;&#23450;&#24459;&#12290;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31639;&#27861;&#65292;&#29992;&#20110;&#30830;&#23450;&#22238;&#25253;&#12289;&#26368;&#20248;&#31169;&#20154;&#37197;&#32622;&#21644;&#24179;&#34913;&#29366;&#24577;&#19979;&#30340;&#20154;&#21475;&#36816;&#36755;&#65292;&#24182;&#22312;&#20004;&#20010;&#20247;&#25152;&#21608;&#30693;&#30340;&#22522;&#20934;&#30740;&#31350;&#20013;&#36827;&#34892;&#20102;&#27979;&#35797;&#12290;
&lt;/p&gt;
&lt;p&gt;
The paper was prompted by the surprising discovery that the common strategy, adopted in a large body of research, for producing macroeconomic equilibrium in certain heterogeneous-agent incomplete-market models fails to locate the equilibrium in a widely cited benchmark study. By mimicking the approach proposed by Dumas and Lyasoff (2012), the paper provides a novel description of the law of motion of the distribution over the range of private states of a large population of interacting economic agents faced with uninsurable aggregate and idiosyncratic risk. A new algorithm for identifying the returns, the optimal private allocations, and the population transport in the state of equilibrium is developed and is tested in two well known benchmark studies.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#38750;&#26631;&#20934;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#65292;&#26088;&#22312;&#26368;&#22823;&#21270;&#28040;&#36153;&#25928;&#29992;&#65292;&#21516;&#26102;&#28385;&#36275;&#24213;&#37096;&#32422;&#26463;&#21644;&#22522;&#20934;&#36807;&#31243;&#12290;&#36890;&#36807;&#24341;&#20837;&#20004;&#20010;&#24102;&#21453;&#23556;&#30340;&#36741;&#21161;&#29366;&#24577;&#36807;&#31243;&#65292;&#24314;&#31435;&#20102;&#31561;&#25928;&#30340;&#36741;&#21161;&#25511;&#21046;&#38382;&#39064;&#65292;&#24471;&#21040;&#20102;&#20851;&#38190;&#30340;&#23545;&#20598;&#20215;&#20540;&#20989;&#25968;&#24615;&#36136;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#19968;&#20123;&#26377;&#36259;&#30340;&#32463;&#27982;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2302.08302</link><description>&lt;p&gt;
&#36215;&#28304;&#20110;&#24102;&#26377;&#21333;&#35843;&#22522;&#20934;&#36807;&#31243;&#30340;&#26494;&#24347;&#36130;&#23500;&#36319;&#36394;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
A stochastic control problem arising from relaxed wealth tracking with a monotone benchmark process. (arXiv:2302.08302v2 [math.OC] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.08302
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#38750;&#26631;&#20934;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#65292;&#26088;&#22312;&#26368;&#22823;&#21270;&#28040;&#36153;&#25928;&#29992;&#65292;&#21516;&#26102;&#28385;&#36275;&#24213;&#37096;&#32422;&#26463;&#21644;&#22522;&#20934;&#36807;&#31243;&#12290;&#36890;&#36807;&#24341;&#20837;&#20004;&#20010;&#24102;&#21453;&#23556;&#30340;&#36741;&#21161;&#29366;&#24577;&#36807;&#31243;&#65292;&#24314;&#31435;&#20102;&#31561;&#25928;&#30340;&#36741;&#21161;&#25511;&#21046;&#38382;&#39064;&#65292;&#24471;&#21040;&#20102;&#20851;&#38190;&#30340;&#23545;&#20598;&#20215;&#20540;&#20989;&#25968;&#24615;&#36136;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#19968;&#20123;&#26377;&#36259;&#30340;&#32463;&#27982;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#38750;&#26631;&#20934;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#65292;&#20854;&#28789;&#24863;&#26469;&#28304;&#20110;&#24102;&#26377;&#38750;&#36882;&#20943;&#22522;&#20934;&#36807;&#31243;&#30340;&#26368;&#20248;&#28040;&#36153;&#19982;&#36130;&#23500;&#36319;&#36394;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#21333;&#35843;&#22522;&#20934;&#26159;&#36890;&#36807;&#28418;&#31227;&#24067;&#26391;&#36816;&#21160;&#30340;&#36816;&#34892;&#26368;&#22823;&#20540;&#26469;&#24314;&#27169;&#30340;&#12290;&#25105;&#20204;&#32771;&#34385;&#20351;&#29992;&#36164;&#26412;&#27880;&#20837;&#30340;&#26494;&#24347;&#36319;&#36394;&#20844;&#24335;&#65292;&#20351;&#24471;&#27880;&#20837;&#30340;&#36164;&#26412;&#25152;&#34917;&#20607;&#30340;&#36130;&#23500;&#22312;&#20219;&#20309;&#26102;&#20505;&#37117;&#20248;&#20110;&#22522;&#20934;&#36807;&#31243;&#12290;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#26159;&#22312;&#21160;&#24577;&#24213;&#37096;&#32422;&#26463;&#19979;&#65292;&#26368;&#22823;&#21270;&#21066;&#20943;&#36164;&#26412;&#27880;&#20837;&#25104;&#26412;&#21518;&#30340;&#28040;&#36153;&#30340;&#26399;&#26395;&#25928;&#29992;&#12290;&#36890;&#36807;&#24341;&#20837;&#20004;&#20010;&#24102;&#21453;&#23556;&#30340;&#36741;&#21161;&#29366;&#24577;&#36807;&#31243;&#65292;&#25105;&#20204;&#21046;&#23450;&#20102;&#19968;&#20010;&#31561;&#25928;&#30340;&#36741;&#21161;&#25511;&#21046;&#38382;&#39064;&#65292;&#21516;&#26102;&#30740;&#31350;&#20102;&#26464;&#26438;&#36164;&#26412;&#27880;&#20837;&#21644;&#24213;&#37096;&#32422;&#26463;&#25511;&#21046;&#65292;&#20351;&#20854;&#38544;&#21311;&#36215;&#26469;&#12290;&#20026;&#20102;&#35299;&#20915;&#24102;&#26377;&#20004;&#20010;Neumann&#36793;&#30028;&#26465;&#20214;&#30340;HJB&#26041;&#31243;&#65292;&#25105;&#20204;&#20351;&#29992;&#19968;&#20123;&#26032;&#39062;&#30340;&#27010;&#29575;&#25216;&#24039;&#24314;&#31435;&#20102;&#23545;&#20598;PDE&#30340;&#21807;&#19968;&#32463;&#20856;&#35299;&#20998;&#31163;&#24418;&#24335;&#30340;&#23384;&#22312;&#24615;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#36129;&#29486;&#26159;&#30830;&#23450;&#20102;&#23545;&#20598;&#20215;&#20540;&#20989;&#25968;&#30340;&#19968;&#20123;&#20851;&#38190;&#24615;&#36136;&#65292;&#20174;&#32780;&#20351;&#25105;&#20204;&#33021;&#22815;&#24314;&#31435;&#26494;&#24347;&#36130;&#23500;&#36319;&#36394;&#38382;&#39064;&#30340;&#26368;&#20248;&#35299;&#30340;&#23384;&#22312;&#24615;&#21644;&#21807;&#19968;&#24615;&#65292;&#24182;&#24471;&#20986;&#20102;&#19968;&#20123;&#26377;&#36259;&#30340;&#32463;&#27982;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies a nonstandard stochastic control problem motivated by the optimal consumption with wealth tracking of a non-decreasing benchmark process. In particular, the monotone benchmark is modelled by the running maximum of a drifted Brownian motion. We consider a relaxed tracking formulation using capital injection such that the wealth compensated by the injected capital dominates the benchmark process at all times. The stochastic control problem is to maximize the expected utility on consumption deducted by the cost of the capital injection under the dynamic floor constraint. By introducing two auxiliary state processes with reflections, an equivalent auxiliary control problem is formulated and studied such that the singular control of capital injection and the floor constraint can be hidden. To tackle the HJB equation with two Neumann boundary conditions, we establish the existence of a unique classical solution to the dual PDE in a separation form using some novel probabil
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#25928;&#32780;&#31283;&#20581;&#30340;&#26041;&#27861;&#65292;&#23558;&#36870;&#21521;&#39118;&#38505;&#65288;WWR&#65289;&#32435;&#20837;&#36164;&#37329;&#20272;&#20540;&#35843;&#25972;&#65288;FVA&#65289;&#24314;&#27169;&#12290;</title><link>http://arxiv.org/abs/2209.12222</link><description>&lt;p&gt;
&#29992;&#20110;&#36164;&#37329;&#20272;&#20540;&#35843;&#25972;&#30340;&#39640;&#25928;&#36870;&#21521;&#39118;&#38505;&#24314;&#27169;
&lt;/p&gt;
&lt;p&gt;
Efficient Wrong-Way Risk Modelling for Funding Valuation Adjustments. (arXiv:2209.12222v3 [q-fin.CP] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.12222
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#25928;&#32780;&#31283;&#20581;&#30340;&#26041;&#27861;&#65292;&#23558;&#36870;&#21521;&#39118;&#38505;&#65288;WWR&#65289;&#32435;&#20837;&#36164;&#37329;&#20272;&#20540;&#35843;&#25972;&#65288;FVA&#65289;&#24314;&#27169;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36870;&#21521;&#39118;&#38505;&#65288;WWR&#65289;&#26159;&#36164;&#37329;&#20272;&#20540;&#35843;&#25972;&#65288;FVA&#65289;&#24314;&#27169;&#20013;&#30340;&#37325;&#35201;&#32452;&#25104;&#37096;&#20998;&#12290;&#28982;&#32780;&#65292;&#26631;&#20934;&#20551;&#35774;&#26159;&#24066;&#22330;&#39118;&#38505;&#12289;&#20132;&#26131;&#23545;&#25163;&#36829;&#32422;&#21644;&#25320;&#27454;&#25104;&#26412;&#20043;&#38388;&#29420;&#31435;&#12290;&#26412;&#25991;&#26088;&#22312;&#35780;&#20272;WWR&#30340;&#24433;&#21709;&#65292;&#19981;&#38656;&#35201;&#36816;&#34892;&#21253;&#25324;&#25152;&#26377;&#20449;&#36151;&#21644;&#25320;&#27454;&#36807;&#31243;&#30340;Monte Carlo&#27169;&#25311;&#12290;&#25105;&#20204;&#25552;&#35758;&#23558;&#26333;&#20809;&#27010;&#20917;&#20998;&#20026;&#20004;&#37096;&#20998;&#65306;&#29420;&#31435;&#21644;WWR&#39537;&#21160;&#30340;&#37096;&#20998;&#12290;&#23545;&#20110;&#21069;&#32773;&#65292;&#26333;&#20809;&#21487;&#20197;&#20174;&#26631;&#20934;xVA&#35745;&#31639;&#20013;&#37325;&#22797;&#20351;&#29992;&#12290;&#25105;&#20204;&#29992;&#38543;&#26426;&#39537;&#21160;&#22120;&#34920;&#31034;&#26333;&#20809;&#27010;&#36848;&#30340;&#31532;&#20108;&#37096;&#20998;&#65292;&#24182;&#36890;&#36807;&#24120;&#35265;&#30340;&#39640;&#26031;&#38543;&#26426;&#22240;&#23376;&#36827;&#34892;&#36817;&#20284;&#22788;&#29702;&#12290;&#22312;&#20223;&#23556;&#35774;&#32622;&#20869;&#65292;&#25152;&#25552;&#20986;&#30340;&#36817;&#20284;&#26041;&#27861;&#26159;&#36890;&#29992;&#30340;&#65292;&#26159;&#29616;&#26377;xVA&#35745;&#31639;&#30340;&#38468;&#21152;&#20869;&#23481;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#31181;&#23558;WWR&#32435;&#20837;FVA&#24314;&#27169;&#30340;&#39640;&#25928;&#19988;&#31283;&#20581;&#30340;&#26041;&#27861;&#12290;&#20511;&#21161;&#21033;&#29575;&#25481;&#26399;&#21644;&#20195;&#34920;&#24615;&#30340;&#22810;&#24065;&#31181;&#25481;&#26399;&#32452;&#21512;&#30340;&#26696;&#20363;&#30740;&#31350;&#36827;&#34892;&#20102;&#35828;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
Wrong-Way Risk (WWR) is an important component in Funding Valuation Adjustment (FVA) modelling. Yet, the standard assumption is independence between market risks and the counterparty defaults and funding costs. This typical industrial setting is our point of departure, where we aim to assess the impact of WWR without running a full Monte Carlo simulation with all credit and funding processes. We propose to split the exposure profile into two parts: an independent and a WWR-driven part. For the former, exposures can be re-used from the standard xVA calculation. We express the second part of the exposure profile in terms of the stochastic drivers and approximate these by a common Gaussian stochastic factor. Within the affine setting, the proposed approximation is generic, is an add-on to the existing xVA calculations and provides an efficient and robust way to include WWR in FVA modelling. Case studies for an interest rate swap and a representative multi-currency portfolio of swaps illus
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#35777;&#26126;&#20102;MakerDAO&#30340;&#27835;&#29702;&#24456;&#22823;&#31243;&#24230;&#19978;&#26159;&#20013;&#24515;&#21270;&#30340;&#65292;&#32780;&#36825;&#23545;&#20110;DeFi&#25237;&#36164;&#32773;&#26469;&#35828;&#26159;&#19968;&#31181;&#21435;&#20013;&#24515;&#21270;&#19982;&#21327;&#35758;&#24615;&#33021;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;</title><link>http://arxiv.org/abs/2203.16612</link><description>&lt;p&gt;
"&#21435;&#20013;&#24515;&#21270;&#37329;&#34701;&#20013;&#30340;&#21435;&#20013;&#24515;&#21270;&#24187;&#35273;&#65306;&#22522;&#20110;&#20195;&#24065;&#25237;&#31080;&#30340;MakerDAO&#25237;&#31080;&#30340;&#35777;&#25454;"
&lt;/p&gt;
&lt;p&gt;
Decentralization illusion in Decentralized Finance: Evidence from tokenized voting in MakerDAO polls. (arXiv:2203.16612v2 [cs.CR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.16612
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35777;&#26126;&#20102;MakerDAO&#30340;&#27835;&#29702;&#24456;&#22823;&#31243;&#24230;&#19978;&#26159;&#20013;&#24515;&#21270;&#30340;&#65292;&#32780;&#36825;&#23545;&#20110;DeFi&#25237;&#36164;&#32773;&#26469;&#35828;&#26159;&#19968;&#31181;&#21435;&#20013;&#24515;&#21270;&#19982;&#21327;&#35758;&#24615;&#33021;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21435;&#20013;&#24515;&#21270;&#33258;&#27835;&#32452;&#32455;(DAO)&#22312;&#21435;&#20013;&#24515;&#21270;&#37329;&#34701;(DeFi)&#24212;&#29992;&#20013;&#38750;&#24120;&#21463;&#27426;&#36814;&#65292;&#22240;&#20026;&#23427;&#36890;&#36807;&#21306;&#22359;&#38142;&#25552;&#20379;&#20102;&#21435;&#20013;&#24515;&#21270;&#30340;&#27835;&#29702;&#35299;&#20915;&#26041;&#26696;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;Maker&#21327;&#35758;&#12289;&#20854;&#31283;&#23450;&#24065;DAI&#21644;&#27835;&#29702;&#20195;&#24065;Maker(MKR)&#30340;&#27835;&#29702;&#29305;&#28857;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#20960;&#20010;&#20013;&#24515;&#21270;&#27835;&#29702;&#30340;&#35780;&#20272;&#25351;&#26631;&#12290;&#25105;&#20204;&#30340;&#23454;&#35777;&#20998;&#26512;&#30740;&#31350;&#20102;&#20013;&#24515;&#21270;&#27835;&#29702;&#23545;&#19982;MKR&#21644;DAI&#30456;&#20851;&#30340;&#19968;&#31995;&#21015;&#22240;&#32032;&#30340;&#24433;&#21709;&#65292;&#22914;&#37329;&#34701;&#12289;&#20132;&#26131;&#12289;&#32593;&#32476;&#21644;&#25512;&#29305;&#24773;&#32490;&#25351;&#26631;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#27835;&#29702;&#20013;&#24515;&#21270;&#24433;&#21709;&#20102;Maker&#21327;&#35758;&#21644;&#25237;&#31080;&#26435;&#30340;&#20998;&#37197;&#24456;&#37325;&#35201;&#12290;&#36825;&#39033;&#30740;&#31350;&#30340;&#20027;&#35201;&#21547;&#20041;&#26159;&#65292;MakerDAO&#30340;&#27835;&#29702;&#24456;&#22823;&#31243;&#24230;&#19978;&#26159;&#20013;&#24515;&#21270;&#30340;&#65292;&#32780;DeFi&#25237;&#36164;&#32773;&#22312;&#21435;&#20013;&#24515;&#21270;&#21644;DeFi&#21327;&#35758;&#30340;&#34920;&#29616;&#20043;&#38388;&#38754;&#20020;&#30528;&#19968;&#31181;&#26435;&#34913;&#12290;&#36825;&#36827;&#19968;&#27493;&#20419;&#36827;&#20102;&#20851;&#20110;DeFi&#26159;&#21542;&#30495;&#27491;&#21435;&#20013;&#24515;&#21270;&#30340;&#24403;&#20195;&#36777;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
Decentralized Autonomous Organization (DAO) is very popular in Decentralized Finance (DeFi) applications as it provides a decentralized governance solution through blockchain. We analyze the governance characteristics in the Maker protocol, its stablecoin DAI and governance token Maker (MKR). To achieve that, we establish several measurements of centralized governance. Our empirical analysis investigates the effect of centralized governance over a series of factors related to MKR and DAI, such as financial, transaction, network and twitter sentiment indicators. Our results show that governance centralization influences both the Maker protocol, and the distribution of voting power matters. The main implication of this study is that centralized governance in MakerDAO very much exists, while DeFi investors face a trade-off between decentralization and performance of a DeFi protocol. This further contributes to the contemporary debate on whether DeFi can be truly decentralized. centralized
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#24102;&#26377;&#21046;&#24230;&#36716;&#25442;&#21644;&#38543;&#26426;&#31995;&#25968;&#30340;&#38750;&#40784;&#27425;&#38543;&#26426;LQ&#25511;&#21046;&#38382;&#39064;&#26041;&#27861;&#65292;&#24182;&#24212;&#29992;&#20110;&#36164;&#20135;&#36127;&#20538;&#31649;&#29702;&#38382;&#39064; under the mean-variance criteria&#12290;</title><link>http://arxiv.org/abs/2201.01433</link><description>&lt;p&gt;
&#24102;&#26377;&#21046;&#24230;&#36716;&#25442;&#21644;&#38543;&#26426;&#31995;&#25968;&#30340;&#38750;&#40784;&#27425;&#38543;&#26426;&#32447;&#24615;&#20108;&#27425; ( LQ ) &#25511;&#21046;
&lt;/p&gt;
&lt;p&gt;
Non-homogeneous stochastic LQ control with regime switching and random coefficients. (arXiv:2201.01433v6 [math.OC] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.01433
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#24102;&#26377;&#21046;&#24230;&#36716;&#25442;&#21644;&#38543;&#26426;&#31995;&#25968;&#30340;&#38750;&#40784;&#27425;&#38543;&#26426;LQ&#25511;&#21046;&#38382;&#39064;&#26041;&#27861;&#65292;&#24182;&#24212;&#29992;&#20110;&#36164;&#20135;&#36127;&#20538;&#31649;&#29702;&#38382;&#39064; under the mean-variance criteria&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#20855;&#26377;&#21046;&#24230;&#36716;&#25442;&#21644;&#38543;&#26426;&#31995;&#25968;&#30340;&#19968;&#33324;&#38750;&#40784;&#27425;&#38543;&#26426;&#32447;&#24615;&#20108;&#27425; ( LQ ) &#25511;&#21046;&#38382;&#39064;&#12290;&#25105;&#20204;&#21033;&#29992;&#20004;&#20010;&#21453;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#31995;&#32479;&#24471;&#21040;&#20102;&#27492;&#38382;&#39064;&#30340;&#26174;&#24335;&#26368;&#20248;&#29366;&#24577;&#21453;&#39304;&#25511;&#21046;&#21644;&#26368;&#20248;&#20540;&#12290;&#20854;&#20013;&#19968;&#20010;&#26159;&#33879;&#21517;&#30340;&#38543;&#26426; Riccati &#26041;&#31243;&#65292;&#21478;&#19968;&#20010;&#26159;&#20855;&#26377;&#26080;&#30028;&#31995;&#25968;&#30340;&#32447;&#24615;&#22810;&#32500; BSDE&#12290;&#36890;&#36807;&#20351;&#29992; BMO &#24120;&#38821;&#21644;&#25910;&#32553;&#26144;&#23556;&#26041;&#27861;&#35777;&#26126;&#20102;&#36825;&#20004;&#20010;&#21453;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#31995;&#32479;&#30340;&#35299;&#30340;&#23384;&#22312;&#24615;&#21644;&#21807;&#19968;&#24615;&#12290;&#26368;&#21518;&#65292;&#23558;&#27492;&#29702;&#35770;&#24212;&#29992;&#20110;&#30740;&#31350;&#22343;&#20540;-&#26041;&#24046;&#26631;&#20934;&#19979;&#30340;&#36164;&#20135;&#36127;&#20538;&#31649;&#29702;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper is concerned with a general non-homogeneous stochastic linear quadratic (LQ) control problem with regime switching and random coefficients. We obtain the explicit optimal state feedback control and optimal value for this problem in terms of two systems of backward stochastic differential equations (BSDEs): one is the famous stochastic Riccati equation and the other one is a linear multi-dimensional BSDE with unbounded coefficients. The existence and uniqueness of the solutions to these two systems of BSDEs are proved by means of BMO martingales and contraction mapping method. At last, the theory is applied to study an asset-liability management problem under the mean-variance criteria.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#36866;&#24212;&#24615;&#26799;&#24230;&#19979;&#38477;&#27861;&#26469;&#35745;&#31639;&#26399;&#26435;&#38544;&#21547;&#27874;&#21160;&#29575;&#65292;&#30456;&#36739;&#20110;&#20256;&#32479;&#26041;&#27861;&#20855;&#26377;&#26356;&#39640;&#20934;&#30830;&#24230;&#21644;&#26356;&#24555;&#25910;&#25947;&#36895;&#24230;&#65292;&#24182;&#19988;&#23545;&#36215;&#22987;&#28857;&#30340;&#28789;&#25935;&#24230;&#26356;&#20302;&#12290;</title><link>http://arxiv.org/abs/2108.07035</link><description>&lt;p&gt;
&#36866;&#24212;&#24615;&#26799;&#24230;&#19979;&#38477;&#27861;&#35745;&#31639;&#38544;&#21547;&#27874;&#21160;&#29575;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Adaptive Gradient Descent Methods for Computing Implied Volatility. (arXiv:2108.07035v5 [q-fin.CP] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2108.07035
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#36866;&#24212;&#24615;&#26799;&#24230;&#19979;&#38477;&#27861;&#26469;&#35745;&#31639;&#26399;&#26435;&#38544;&#21547;&#27874;&#21160;&#29575;&#65292;&#30456;&#36739;&#20110;&#20256;&#32479;&#26041;&#27861;&#20855;&#26377;&#26356;&#39640;&#20934;&#30830;&#24230;&#21644;&#26356;&#24555;&#25910;&#25947;&#36895;&#24230;&#65292;&#24182;&#19988;&#23545;&#36215;&#22987;&#28857;&#30340;&#28789;&#25935;&#24230;&#26356;&#20302;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#33258;&#36866;&#24212;&#26799;&#24230;&#19979;&#38477;&#20248;&#21270;&#22120;&#30340;&#26032;&#25968;&#20540;&#26041;&#27861;&#65292;&#29992;&#20110;&#35745;&#31639;Black-Scholes&#65288;B-S&#65289;&#26399;&#26435;&#23450;&#20215;&#27169;&#22411;&#20013;&#30340;&#38544;&#21547;&#27874;&#21160;&#29575;&#12290;&#23454;&#39564;&#35777;&#26126;&#35813;&#26032;&#26041;&#27861;&#27604;&#23553;&#38381;&#24335;&#36817;&#20284;&#26356;&#20934;&#30830;&#12290;&#19982;&#29275;&#39039;-&#25289;&#22827;&#36874;&#26041;&#27861;&#30456;&#27604;&#65292;&#35813;&#26032;&#26041;&#27861;&#20855;&#26377;&#21487;&#38752;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#24182;&#19988;&#20542;&#21521;&#20110;&#23545;&#36215;&#22987;&#28857;&#30340;&#28789;&#25935;&#24230;&#26356;&#20302;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, a new numerical method based on adaptive gradient descent optimizers is provided for computing the implied volatility from the Black-Scholes (B-S) option pricing model. It is shown that the new method is more accurate than the close form approximation. Compared with the Newton-Raphson method, the new method obtains a reliable rate of convergence and tends to be less sensitive to the beginning point.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#22810;&#37325;&#20195;&#38469;&#24773;&#20917;&#19979;&#30340;&#23450;&#20041;&#36129;&#29486;&#20859;&#32769;&#37329;&#21046;&#24230;&#65292;&#36890;&#36807;&#36125;&#21494;&#26031;&#20248;&#21270;&#23454;&#29616;&#20195;&#38469;&#39118;&#38505;&#20849;&#25285;&#20197;&#25552;&#39640;&#21442;&#19982;&#32773;&#31119;&#21033;&#65292;&#32467;&#26524;&#34920;&#26126;&#20195;&#38469;&#39118;&#38505;&#20849;&#25285;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#23454;&#29992;&#25928;&#29992;&#12290;</title><link>http://arxiv.org/abs/2106.13644</link><description>&lt;p&gt;
&#22522;&#20110;&#36125;&#21494;&#26031;&#20248;&#21270;&#30340;&#23450;&#20041;&#36129;&#29486;&#20859;&#32769;&#37329;&#21046;&#24230;&#20013;&#20195;&#38469;&#39118;&#38505;&#20849;&#25285;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Intergenerational risk sharing in a Defined Contribution pension system: analysis with Bayesian optimization. (arXiv:2106.13644v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2106.13644
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#22810;&#37325;&#20195;&#38469;&#24773;&#20917;&#19979;&#30340;&#23450;&#20041;&#36129;&#29486;&#20859;&#32769;&#37329;&#21046;&#24230;&#65292;&#36890;&#36807;&#36125;&#21494;&#26031;&#20248;&#21270;&#23454;&#29616;&#20195;&#38469;&#39118;&#38505;&#20849;&#25285;&#20197;&#25552;&#39640;&#21442;&#19982;&#32773;&#31119;&#21033;&#65292;&#32467;&#26524;&#34920;&#26126;&#20195;&#38469;&#39118;&#38505;&#20849;&#25285;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#23454;&#29992;&#25928;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#38754;&#21521;&#22810;&#20010;&#37325;&#21472;&#20195;&#38469;&#30340;&#23436;&#20840;&#36164;&#26412;&#21270;&#12289;&#38598;&#20307;&#23450;&#20041;&#36129;&#29486;&#65288;DC&#65289;&#20859;&#32769;&#37329;&#21046;&#24230;&#12290;&#25105;&#20204;&#35843;&#26597;&#20102;&#36890;&#36807;&#20195;&#38469;&#39118;&#38505;&#20849;&#25285;&#65288;IRS&#65289;&#23454;&#29616;&#20859;&#32769;&#37329;&#33258;&#21160;&#35843;&#25972;&#19982;&#25237;&#36164;&#31574;&#30053;&#36866;&#37197;&#30340;&#26041;&#27861;&#65292;&#20197;&#25552;&#39640;&#21442;&#19982;&#32773;&#30340;&#31119;&#21033;&#12290;&#25105;&#20204;&#20351;&#29992;&#20102;&#19968;&#20010;&#33258;&#21160;&#35843;&#25972;&#35268;&#21017;&#26469;&#35843;&#25972;&#20010;&#20154;&#36134;&#25143;&#30340;&#25351;&#25968;&#21270;&#65292;&#35813;&#35268;&#21017;&#26681;&#25454;&#20859;&#32769;&#37329;&#21046;&#24230;&#30340;&#21517;&#20041;&#36164;&#37329;&#27604;&#29575;&#36827;&#34892;&#35843;&#25972;&#12290;&#35813;&#20859;&#32769;&#37329;&#21046;&#24230;&#26377;&#20004;&#20010;&#21442;&#25968;&#65292;&#30830;&#23450;&#20102;&#25237;&#36164;&#31574;&#30053;&#21644;&#35843;&#25972;&#35268;&#21017;&#30340;&#24378;&#24230;&#65292;&#24182;&#36890;&#36807;&#36125;&#21494;&#26031;&#20248;&#21270;&#30340;&#39044;&#26399;&#25928;&#29992;&#26368;&#22823;&#21270;&#26469;&#20248;&#21270;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#36864;&#20241;&#31119;&#21033;&#27874;&#21160;&#21644;&#34701;&#36164;&#27604;&#29575;&#27874;&#21160;&#65292;&#26174;&#31034;&#36890;&#36807;&#26368;&#20248;&#35843;&#25972;&#21442;&#25968;&#25511;&#21046;&#23427;&#20204;&#20043;&#38388;&#30340;&#24179;&#34913;&#21487;&#20197;&#23454;&#29616;IRS&#12290;&#19982;&#26368;&#20339;&#20010;&#20154;&#25237;&#36164;&#31574;&#30053;&#30456;&#27604;&#65292;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;IRS&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#21442;&#19982;&#32773;&#30340;&#23454;&#29992;&#25928;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a fully funded, collective defined-contribution (DC) pension system with multiple overlapping generations. We investigate whether the welfare of participants can be improved by intergenerational risk sharing (IRS) implemented with a realistic investment strategy (e.g., no borrowing) and without an outside entity (e.g., share holders) that helps finance the pension fund. To implement IRS, the pension system uses an automatic adjustment rule for the indexation of individual accounts, which adapts to the notional funding ratio of the pension system. The pension system has two parameters that determine the investment strategy and the strength of the adjustment rule, which are optimized by expected utility maximization using Bayesian optimization. The volatility of the retirement benefits and that of the funding ratio are analyzed, and it is shown that the trade-off between them can be controlled by the optimal adjustment parameter to attain IRS. Compared with the optimal individua
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21046;&#23450;&#24182;&#35299;&#20915;&#20102;&#19968;&#20010;&#22810;&#20154;&#38543;&#26426;&#24494;&#20998;&#21338;&#24328;&#65292;&#25581;&#31034;&#20102;&#25317;&#25380;&#24066;&#22330;&#20013;&#20132;&#26131;&#20449;&#21495;&#21644;&#35746;&#21333;&#27969;&#20043;&#38388;&#30340;&#37327;&#21270;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2106.09267</link><description>&lt;p&gt;
&#19982;&#20154;&#32676;&#20132;&#26131;
&lt;/p&gt;
&lt;p&gt;
Trading with the Crowd. (arXiv:2106.09267v3 [q-fin.TR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2106.09267
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21046;&#23450;&#24182;&#35299;&#20915;&#20102;&#19968;&#20010;&#22810;&#20154;&#38543;&#26426;&#24494;&#20998;&#21338;&#24328;&#65292;&#25581;&#31034;&#20102;&#25317;&#25380;&#24066;&#22330;&#20013;&#20132;&#26131;&#20449;&#21495;&#21644;&#35746;&#21333;&#27969;&#20043;&#38388;&#30340;&#37327;&#21270;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#21046;&#23450;&#24182;&#35299;&#20915;&#20102;&#19968;&#20010;&#22810;&#20154;&#38543;&#26426;&#24494;&#20998;&#21338;&#24328;&#65292;&#20854;&#20013;&#37329;&#34701;&#20195;&#29702;&#20154;&#22312;&#20849;&#21516;&#32858;&#21512;&#30340;&#30701;&#26399;&#20215;&#26684;&#20914;&#20987;&#23384;&#22312;&#30340;&#24773;&#20917;&#19979;&#65292;&#23547;&#27714;&#20197;&#25104;&#26412;&#25928;&#30410;&#30340;&#26041;&#24335;&#28165;&#31639;&#20854;&#22312;&#39118;&#38505;&#36164;&#20135;&#20013;&#30340;&#25345;&#20179;&#65292;&#21516;&#26102;&#32771;&#34385;&#21040;&#36890;&#29992;&#30340;&#26222;&#36890;&#20215;&#26684;&#39044;&#27979;&#20449;&#21495;&#12290;&#21807;&#19968;&#30340;&#32435;&#20160;&#22343;&#34913;&#31574;&#30053;&#25581;&#31034;&#20102;&#27599;&#20010;&#20195;&#29702;&#30340;&#28165;&#31639;&#25919;&#31574;&#22914;&#20309;&#23558;&#39044;&#27979;&#20132;&#26131;&#20449;&#21495;&#35843;&#25972;&#20026;&#25152;&#26377;&#20854;&#20182;&#20195;&#29702;&#24341;&#36215;&#30340;&#32858;&#21512;&#30701;&#26399;&#20215;&#26684;&#20914;&#20987;&#12290;&#36825;&#23637;&#31034;&#20102;&#25317;&#25380;&#24066;&#22330;&#20013;&#20132;&#26131;&#20449;&#21495;&#21644;&#35746;&#21333;&#27969;&#20043;&#38388;&#30340;&#37327;&#21270;&#20851;&#31995;&#12290;&#25105;&#20204;&#36824;&#22312;&#26080;&#38480;&#25968;&#37327;&#30340;&#20195;&#29702;&#20154;&#26497;&#38480;&#19979;&#21046;&#23450;&#24182;&#35299;&#20915;&#20102;&#30456;&#24212;&#30340;&#22343;&#22330;&#21338;&#24328;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#26377;&#38480; $N$-&#20154;&#21338;&#24328;&#20013;&#30340;&#22343;&#34913;&#20132;&#26131;&#36895;&#24230;&#21644;&#20195;&#29702;&#20154;&#30340;&#20215;&#20540;&#20989;&#25968;&#20197;&#36895;&#29575; $O(N^{-2})$ &#25910;&#25947;&#20110;&#22343;&#22330;&#21338;&#24328;&#20013;&#30340;&#30456;&#24212;&#20132;&#26131;&#36895;&#24230;&#21644;&#20215;&#20540;&#20989;&#25968;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#35777;&#26126;&#22343;&#22330;&#26368;&#20248;&#31574;&#30053;&#20026;&#22823;&#22411;&#20294;&#26377;&#38480;&#30340;&#29609;&#23478;&#32676;&#20307;&#25552;&#20379;&#20102;&#36817;&#20284;&#30340;&#32435;&#20160;&#22343;&#34913;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;
We formulate and solve a multi-player stochastic differential game between financial agents who seek to cost-efficiently liquidate their position in a risky asset in the presence of jointly aggregated transient price impact, along with taking into account a common general price predicting signal. The unique Nash-equilibrium strategies reveal how each agent's liquidation policy adjusts the predictive trading signal to the aggregated transient price impact induced by all other agents. This unfolds a quantitative relation between trading signals and the order flow in crowded markets. We also formulate and solve the corresponding mean field game in the limit of infinitely many agents. We prove that the equilibrium trading speed and the value function of an agent in the finite $N$-player game converges to the corresponding trading speed and value function in the mean field game at rate $O(N^{-2})$. In addition, we prove that the mean field optimal strategy provides an approximate Nash-equil
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#38656;&#27714;&#24377;&#24615;&#30340;&#21160;&#24577;&#30005;&#20215;&#27169;&#22411;&#65292;&#22312;&#19981;&#30830;&#23450;&#24615;&#19979;&#32771;&#34385;&#20102;&#38646;&#21806;&#30005;&#21147;&#24066;&#22330;&#20013;&#30340;&#39046;&#23548;&#32773;&#21644;&#36861;&#38543;&#32773;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#24182;&#36890;&#36807;&#20998;&#23618;&#20915;&#31574;&#36807;&#31243;&#20248;&#21270;&#19981;&#21516;&#24066;&#22330;&#37197;&#32622;&#30340;&#36873;&#25321;&#12290;</title><link>http://arxiv.org/abs/2105.03405</link><description>&lt;p&gt;
&#19981;&#30830;&#23450;&#24615;&#19979;&#22522;&#20110;&#21160;&#24577;&#30005;&#20215;&#30340;&#38646;&#21806;&#30005;&#21147;&#24066;&#22330;&#38656;&#27714;&#21709;&#24212;
&lt;/p&gt;
&lt;p&gt;
Dynamic tariffs-based demand response in retail electricity market under uncertainty. (arXiv:2105.03405v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2105.03405
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#38656;&#27714;&#24377;&#24615;&#30340;&#21160;&#24577;&#30005;&#20215;&#27169;&#22411;&#65292;&#22312;&#19981;&#30830;&#23450;&#24615;&#19979;&#32771;&#34385;&#20102;&#38646;&#21806;&#30005;&#21147;&#24066;&#22330;&#20013;&#30340;&#39046;&#23548;&#32773;&#21644;&#36861;&#38543;&#32773;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#24182;&#36890;&#36807;&#20998;&#23618;&#20915;&#31574;&#36807;&#31243;&#20248;&#21270;&#19981;&#21516;&#24066;&#22330;&#37197;&#32622;&#30340;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30005;&#21147;&#38656;&#27714;&#21709;&#24212;&#65288;DR&#65289;&#35745;&#21010;&#22312;&#30005;&#21147;&#24066;&#22330;&#37325;&#32452;&#21518;&#22791;&#21463;&#20851;&#27880;&#65292;&#24182;&#34987;&#29992;&#20110;&#20248;&#21270;&#24066;&#22330;&#21442;&#19982;&#32773;&#30340;&#20915;&#31574;&#12290;&#20182;&#20204;&#21487;&#20197;&#36890;&#36807;&#20462;&#25913;&#29992;&#30005;&#37327;&#25110;&#30005;&#21147;&#28040;&#36153;&#26102;&#38388;&#26469;&#25552;&#39640;&#31995;&#32479;&#30340;&#21487;&#38752;&#24615;&#21644;&#31649;&#29702;&#20215;&#26684;&#27874;&#21160;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#21338;&#24328;&#29702;&#35770;&#27169;&#22411;&#65292;&#22312;&#19981;&#30830;&#23450;&#30340;&#21160;&#24577;&#20215;&#26684;&#29615;&#22659;&#19979;&#32771;&#34385;&#20102;&#38646;&#21806;&#21830;&#65288;&#39046;&#23548;&#32773;&#65289;&#21644;&#28040;&#36153;&#32773;&#65288;&#36861;&#38543;&#32773;&#65289;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#35813;&#27169;&#22411;&#21033;&#29992;&#38656;&#27714;&#24377;&#24615;&#36827;&#34892;&#20998;&#23618;&#20915;&#31574;&#36807;&#31243;&#65292;&#20174;&#32780;&#22312;&#19981;&#21516;&#30340;&#19981;&#30830;&#23450;&#24615;&#26469;&#28304;&#19979;&#25552;&#20379;&#19981;&#21516;&#24066;&#22330;&#37197;&#32622;&#30340;&#36873;&#25321;&#65292;&#20174;&#32780;&#24102;&#26469;&#20248;&#36136;&#21644;&#32463;&#27982;&#25910;&#30410;&#12290;&#35813;&#27169;&#22411;&#22312;&#20004;&#20010;&#26694;&#26550;&#19979;&#27714;&#35299;&#65306;&#19968;&#26159;&#32771;&#34385;&#38646;&#21806;&#21830;&#30340;&#24066;&#22330;&#21147;&#37327;&#65292;&#21478;&#19968;&#20010;&#26159;&#22522;&#20110;&#23436;&#20840;&#31454;&#20105;&#28216;&#25103;&#30340;&#22343;&#34913;&#35774;&#32622;&#12290;&#36825;&#20123;&#27169;&#22411;&#21487;&#29992;&#19968;&#20010;&#25968;&#23398;&#35268;&#21010;&#27169;&#22411;&#26469;&#34920;&#36848;&#24182;&#27714;&#35299;&#20986;&#24179;&#34913;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;
Demand response (DR) programs have gained much attention after the restructuring of the electricity markets and have been used to optimize the decisions of market participants. They can potentially enhance system reliability and manage price volatility by modifying the amount or time of electricity consumption. This paper proposes a novel game-theoretical model accounting for the relationship between retailers (leaders) and consumers (followers) in a dynamic price environment under uncertainty. The quality and economic gains brought by the proposed procedure essentially stem from the utilization of demand elasticity in a hierarchical decision process that renders the options of different market configurations under different sources of uncertainty. The model is solved under two frameworks: by considering the retailer's market power and by accounting for an equilibrium setting based on a perfect competitive game. These are formulated in terms of a mathematical program with equilibrium c
&lt;/p&gt;</description></item></channel></rss>