<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#24320;&#21457;&#32773;&#21644;&#36164;&#21161;&#32773;&#24212;&#36981;&#23432;&#30740;&#31350;&#20262;&#29702;&#21407;&#21017;&#65292;&#25552;&#35758;&#36879;&#26126;&#12289;&#21487;&#37325;&#29992;&#21644;&#21487;&#26356;&#26032;&#30340;&#35745;&#31639;&#21355;&#29983;&#32463;&#27982;&#27169;&#22411;&#36719;&#20214;&#65292;&#20197;&#25913;&#21892;&#31038;&#20250;&#25509;&#21463;&#24230;&#21644;&#20351;&#29992;&#25928;&#26524;&#12290;</title><link>https://arxiv.org/abs/2403.17798</link><description>&lt;p&gt;
&#35745;&#21010;&#12289;&#23454;&#26045;&#21644;&#21457;&#24067;&#21355;&#29983;&#32463;&#27982;&#27169;&#22411;&#36719;&#20214;&#26102;&#30340;&#36947;&#24503;&#32771;&#37327;&#65306;&#19968;&#20010;&#26032;&#25552;&#35758;
&lt;/p&gt;
&lt;p&gt;
Ethical considerations when planning, implementing and releasing health economic model software: a new proposal
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17798
&lt;/p&gt;
&lt;p&gt;
&#24320;&#21457;&#32773;&#21644;&#36164;&#21161;&#32773;&#24212;&#36981;&#23432;&#30740;&#31350;&#20262;&#29702;&#21407;&#21017;&#65292;&#25552;&#35758;&#36879;&#26126;&#12289;&#21487;&#37325;&#29992;&#21644;&#21487;&#26356;&#26032;&#30340;&#35745;&#31639;&#21355;&#29983;&#32463;&#27982;&#27169;&#22411;&#36719;&#20214;&#65292;&#20197;&#25913;&#21892;&#31038;&#20250;&#25509;&#21463;&#24230;&#21644;&#20351;&#29992;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22810;&#25968;&#21355;&#29983;&#32463;&#27982;&#20998;&#26512;&#37117;&#26159;&#22312;&#35745;&#31639;&#26426;&#30340;&#24110;&#21161;&#19979;&#36827;&#34892;&#30340;&#12290;&#28982;&#32780;&#65292;&#23558;&#21355;&#29983;&#32463;&#27982;&#27169;&#22411;&#20316;&#20026;&#36719;&#20214;&#65288;&#25110;&#35745;&#31639;&#21355;&#29983;&#32463;&#27982;&#27169;&#22411;&#65288;CHEMs&#65289;&#65289;&#23454;&#26045;&#30340;&#30740;&#31350;&#20262;&#29702;&#36947;&#24503;&#23578;&#19981;&#26126;&#30830;&#12290;&#25105;&#20204;&#25552;&#35758;&#65292;CHEM&#30340;&#24320;&#21457;&#32773;&#21644;&#36164;&#21161;&#32773;&#24212;&#36981;&#23432;&#30740;&#31350;&#20262;&#29702;&#21407;&#21017;&#65292;&#24182;&#36861;&#27714;&#20197;&#19979;&#30446;&#26631;&#65306;&#65288;i&#65289;&#31038;&#20250;&#21487;&#25509;&#21463;&#30340;&#29992;&#25143;&#35201;&#27714;&#21644;&#35774;&#35745;&#35268;&#33539;&#65307;&#65288;ii&#65289;&#20999;&#21512;&#38656;&#27714;&#30340;&#23454;&#26045;&#65307;&#20197;&#21450;&#65288;iii&#65289;&#31038;&#20250;&#21463;&#30410;&#30340;&#21457;&#24067;&#21518;&#20351;&#29992;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#25552;&#35758;&#65292;&#36879;&#26126;&#65288;T&#65289;&#12289;&#21487;&#37325;&#29992;&#65288;R&#65289;&#21644;&#21487;&#26356;&#26032;&#65288;U&#65289;&#30340;CHEM&#34920;&#26126;&#39033;&#30446;&#22242;&#38431;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#24050;&#23454;&#29616;&#36825;&#20123;&#30446;&#26631;&#12290;&#25105;&#20204;&#25552;&#20986;&#20845;&#20010;&#35780;&#20272;TRU CHEMs&#30340;&#26631;&#20934;&#65306;&#65288;T1&#65289;&#36719;&#20214;&#25991;&#20214;&#26159;&#20844;&#24320;&#21487;&#29992;&#30340;&#65307;&#65288;T2&#65289;&#24320;&#21457;&#32773;&#23545;&#36866;&#24403;&#20351;&#29992;&#30340;&#36129;&#29486;&#21644;&#21028;&#26029;&#23481;&#26131;&#35782;&#21035;&#65307;&#65288;R1&#65289;&#32534;&#31243;&#23454;&#36341;&#26377;&#21033;&#20110;&#29420;&#31435;&#37325;&#29992;&#27169;&#22411;&#32452;&#20214;&#65307;&#65288;R2&#65289;&#35768;&#21487;&#35777;&#20801;&#35768;&#37325;&#29992;&#21644;&#34893;&#29983;&#20316;&#21697;&#65307;&#65288;U1&#65289;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17798v1 Announce Type: new  Abstract: Most health economic analyses are undertaken with the aid of computers. However, the research ethics of implementing health economic models as software (or computational health economic models (CHEMs)) are poorly understood. We propose that developers and funders of CHEMs should adhere to research ethics principles and pursue the goals of: (i) socially acceptable user requirements and design specifications; (ii) fit for purpose implementations; and (iii) socially beneficial post-release use. We further propose that a transparent (T), reusable (R) and updatable (U) CHEM is suggestive of a project team that has largely met these goals. We propose six criteria for assessing TRU CHEMs: (T1) software files are publicly available; (T2) developer contributions and judgments on appropriate use are easily identified; (R1) programming practices facilitate independent reuse of model components; (R2) licenses permit reuse and derivative works; (U1) 
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#25991;&#26412;&#25366;&#25496;&#21644;&#31038;&#20132;&#32593;&#32476;&#20998;&#26512;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21019;&#26032;&#26041;&#27861;&#65292;&#20197;&#35780;&#20272;OM&#21644;SCM&#19987;&#19994;&#20154;&#21592;&#29305;&#23450;&#24515;&#29702;&#29305;&#36136;&#30340;&#24066;&#22330;&#38656;&#27714;&#12290;</title><link>https://arxiv.org/abs/2403.17546</link><description>&lt;p&gt;
&#35299;&#35835;&#21331;&#36234;&#65306;&#36890;&#36807;&#25991;&#26412;&#25366;&#25496;&#25581;&#31034;&#36816;&#33829;&#21644;&#20379;&#24212;&#38142;&#19987;&#19994;&#20154;&#21592;&#24515;&#29702;&#29305;&#36136;&#30340;&#38656;&#27714;
&lt;/p&gt;
&lt;p&gt;
Decoding excellence: Mapping the demand for psychological traits of operations and supply chain professionals through text mining
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17546
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#25991;&#26412;&#25366;&#25496;&#21644;&#31038;&#20132;&#32593;&#32476;&#20998;&#26512;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21019;&#26032;&#26041;&#27861;&#65292;&#20197;&#35780;&#20272;OM&#21644;SCM&#19987;&#19994;&#20154;&#21592;&#29305;&#23450;&#24515;&#29702;&#29305;&#36136;&#30340;&#24066;&#22330;&#38656;&#27714;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21019;&#26032;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#25991;&#26412;&#25366;&#25496;&#21644;&#31038;&#20132;&#32593;&#32476;&#20998;&#26512;&#65292;&#23545;&#36816;&#33829;&#31649;&#29702;&#65288;OM&#65289;&#21644;&#20379;&#24212;&#38142;&#31649;&#29702;&#65288;SCM&#65289;&#19987;&#19994;&#20154;&#21592;&#30340;&#24515;&#29702;&#29305;&#36136;&#36827;&#34892;&#25551;&#36848;&#20998;&#26512;&#12290;&#35813;&#26041;&#27861;&#26088;&#22312;&#36890;&#36807;&#32467;&#21512;&#30456;&#20851;&#24515;&#29702;&#26500;&#24314;&#12289;&#25991;&#26412;&#25366;&#25496;&#25216;&#26415;&#21644;&#21019;&#26032;&#24230;&#37327;&#26041;&#27861;&#65292;&#21363;&#35821;&#20041;&#21697;&#29260;&#20998;&#25968;&#65292;&#35780;&#20272;&#29305;&#23450;&#29305;&#36136;&#30340;&#24066;&#22330;&#38656;&#27714;&#12290;&#25105;&#20204;&#23558;&#35813;&#26041;&#27861;&#24212;&#29992;&#20110;&#19968;&#32452;OM&#21644;SCM&#19987;&#19994;&#20154;&#21592;&#30340;&#32844;&#20301;&#25551;&#36848;&#25968;&#25454;&#38598;&#65292;&#26088;&#22312;&#25552;&#20379;&#20182;&#20204;&#30456;&#20851;&#25152;&#38656;&#25216;&#33021;&#30340;&#25551;&#36848;&#20998;&#24067;&#22270;&#65292;&#21253;&#25324;&#24515;&#29702;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17546v1 Announce Type: new  Abstract: The current study proposes an innovative methodology for the profiling of psychological traits of Operations Management (OM) and Supply Chain Management (SCM) professionals. We use innovative methods and tools of text mining and social network analysis to map the demand for relevant skills from a set of job descriptions, with a focus on psychological characteristics. The proposed approach aims to evaluate the market demand for specific traits by combining relevant psychological constructs, text mining techniques, and an innovative measure, namely, the Semantic Brand Score. We apply the proposed methodology to a dataset of job descriptions for OM and SCM professionals, with the objective of providing a mapping of their relevant required skills, including psychological characteristics. In addition, the analysis is then detailed by considering the region of the organization that issues the job description, its organizational size, and the s
&lt;/p&gt;</description></item><item><title>&#24503;&#22269;&#24341;&#20837;&#22269;&#23478;&#26368;&#20302;&#24037;&#36164;&#21518;&#65292;&#21457;&#29616;&#26368;&#20302;&#24037;&#36164;&#26174;&#33879;&#38477;&#20302;&#20102;&#24037;&#36164;&#30340;&#19981;&#24179;&#31561;&#24615;&#65292;&#23545;&#24037;&#20316;&#26102;&#38388;&#25972;&#20307;&#24433;&#21709;&#19981;&#22823;&#65292;&#20294;&#23545;&#36855;&#20320;&#24037;&#20316;&#20154;&#21592;&#30340;&#24037;&#20316;&#26102;&#38388;&#26377;&#26174;&#33879;&#20943;&#23569;&#65292;&#24182;&#23548;&#33268;&#36855;&#20320;&#24037;&#20316;&#23703;&#20301;&#26126;&#26174;&#20943;&#23569;&#65292;&#37096;&#20998;&#36716;&#21521;&#26222;&#36890;&#23601;&#19994;&#21644;&#38750;&#23601;&#19994;&#12290;</title><link>https://arxiv.org/abs/2403.17206</link><description>&lt;p&gt;
&#32454;&#33410;&#20915;&#23450;&#25104;&#36133;&#65306;&#24503;&#22269;&#26368;&#20302;&#24037;&#36164;&#23545;&#24037;&#20316;&#26102;&#38388;&#21644;&#36855;&#20320;&#24037;&#20316;&#30340;&#24322;&#36136;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The Devil is in the Details: Heterogeneous Effects of the German Minimum Wage on Working Hours and Minijobs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17206
&lt;/p&gt;
&lt;p&gt;
&#24503;&#22269;&#24341;&#20837;&#22269;&#23478;&#26368;&#20302;&#24037;&#36164;&#21518;&#65292;&#21457;&#29616;&#26368;&#20302;&#24037;&#36164;&#26174;&#33879;&#38477;&#20302;&#20102;&#24037;&#36164;&#30340;&#19981;&#24179;&#31561;&#24615;&#65292;&#23545;&#24037;&#20316;&#26102;&#38388;&#25972;&#20307;&#24433;&#21709;&#19981;&#22823;&#65292;&#20294;&#23545;&#36855;&#20320;&#24037;&#20316;&#20154;&#21592;&#30340;&#24037;&#20316;&#26102;&#38388;&#26377;&#26174;&#33879;&#20943;&#23569;&#65292;&#24182;&#23548;&#33268;&#36855;&#20320;&#24037;&#20316;&#23703;&#20301;&#26126;&#26174;&#20943;&#23569;&#65292;&#37096;&#20998;&#36716;&#21521;&#26222;&#36890;&#23601;&#19994;&#21644;&#38750;&#23601;&#19994;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
2015&#24180;&#65292;&#24503;&#22269;&#24341;&#20837;&#20102;&#22269;&#23478;&#26368;&#20302;&#24037;&#36164;&#26631;&#20934;&#12290;&#34429;&#28982;&#25991;&#29486;&#26222;&#36941;&#35748;&#20026;&#23545;&#25972;&#20307;&#23601;&#19994;&#27700;&#24179;&#30340;&#36127;&#38754;&#24433;&#21709;&#33267;&#22810;&#24456;&#26377;&#38480;&#65292;&#20294;&#25105;&#20204;&#28145;&#20837;&#32454;&#33410;&#20998;&#26512;&#20102;&#23545;&#24037;&#20316;&#26102;&#38388;&#32500;&#24230;&#21644;&#36855;&#20320;&#24037;&#20316;&#23376;&#38598;&#30340;&#24433;&#21709;&#12290;&#21033;&#29992;2010&#24180;&#12289;2014&#24180;&#21644;2018&#24180;&#24503;&#22269;&#25910;&#20837;&#32467;&#26500;&#35843;&#26597;&#30340;&#25968;&#25454;&#65292;&#25105;&#20204;&#25214;&#21040;&#20102;&#23454;&#35777;&#35777;&#25454;&#34920;&#26126;&#26368;&#20302;&#24037;&#36164;&#26174;&#33879;&#38477;&#20302;&#20102;&#23567;&#26102;&#24037;&#36164;&#21644;&#26376;&#24037;&#36164;&#30340;&#19981;&#24179;&#31561;&#12290;&#34429;&#28982;&#21508;&#31181;&#29702;&#35770;&#26426;&#21046;&#24314;&#35758;&#24037;&#20316;&#26102;&#38388;&#20250;&#20943;&#23569;&#65292;&#20294;&#22312;&#24179;&#22343;&#27700;&#24179;&#19978;&#20173;&#28982;&#20445;&#25345;&#19981;&#21464;&#12290;&#28982;&#32780;&#65292;&#36855;&#20320;&#24037;&#20316;&#20154;&#21592;&#30340;&#24037;&#20316;&#26102;&#38388;&#26126;&#26174;&#20943;&#23569;&#65292;&#36825;&#21487;&#20197;&#19982;&#29305;&#23450;&#30340;&#21046;&#24230;&#26694;&#26550;&#32852;&#31995;&#36215;&#26469;&#12290;&#20851;&#20110;&#23601;&#19994;&#65292;&#32467;&#26524;&#34920;&#26126;&#26222;&#36890;&#24037;&#20316;&#27809;&#26377;&#24433;&#21709;&#65292;&#20294;&#36855;&#20320;&#24037;&#20316;&#26126;&#26174;&#20943;&#23569;&#65292;&#36825;&#26159;&#30001;&#20110;&#21521;&#26222;&#36890;&#23601;&#19994;&#21644;&#38750;&#23601;&#19994;&#30340;&#36716;&#21464;&#25152;&#39537;&#21160;&#30340;&#12290;&#38750;&#23601;&#19994;&#30340;&#36716;&#21464;&#24847;&#21619;&#30528;&#23601;&#19994;&#30340;&#24037;&#36164;&#24377;&#24615;&#20026;-0.1&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17206v1 Announce Type: new  Abstract: In 2015, Germany introduced a national minimum wage. While the literature agrees on at most limited negative effects on the overall employment level, we go into detail and analyze the impact on the working hours dimension and on the subset of minijobs. Using data from the German Structure of Earnings Survey in 2010, 2014, and 2018, we find empirical evidence that the minimum wage significantly reduces inequality in hourly and monthly wages. While various theoretical mechanisms suggest a reduction in working hours, these remain unchanged on average. However, minijobbers experience a notable reduction in working hours which can be linked to the specific institutional framework. Regarding employment, the results show no effects for regular jobs, but there is a noteworthy decline in minijobs, driven by transitions to regular employment and non-employment. The transitions in non-employment imply a wage elasticity of employment of $-0.1$ for m
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#24341;&#20837;&#26032;&#30340;&#36164;&#20135;&#31867;&#22411;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#31181;&#26367;&#20195;&#30340;&#26399;&#26435;&#23450;&#20215;&#26041;&#27861;&#65292;&#20854;&#20013;&#19968;&#31181;&#26041;&#27861;&#19981;&#38656;&#35201;&#26080;&#39118;&#38505;&#36164;&#20135;&#65292;&#21478;&#19968;&#31181;&#26041;&#27861;&#36890;&#36807;&#20445;&#35777;&#30495;&#23454;&#19990;&#30028;&#21644;&#39118;&#38505;&#20013;&#24615;&#20215;&#26684;&#21464;&#21160;&#27010;&#29575;&#30340;&#30456;&#31561;&#24615;&#65292;&#21033;&#29992;&#33258;&#28982;&#19990;&#30028;&#27010;&#29575;&#19979;&#30340;&#26399;&#26395;&#26469;&#35745;&#31639;&#39118;&#38505;&#20013;&#24615;&#26399;&#26435;&#20215;&#26684;&#12290;</title><link>https://arxiv.org/abs/2403.17187</link><description>&lt;p&gt;
&#26367;&#20195;&#32463;&#20856;&#26399;&#26435;&#23450;&#20215;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Alternatives to classical option pricing
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17187
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#24341;&#20837;&#26032;&#30340;&#36164;&#20135;&#31867;&#22411;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#31181;&#26367;&#20195;&#30340;&#26399;&#26435;&#23450;&#20215;&#26041;&#27861;&#65292;&#20854;&#20013;&#19968;&#31181;&#26041;&#27861;&#19981;&#38656;&#35201;&#26080;&#39118;&#38505;&#36164;&#20135;&#65292;&#21478;&#19968;&#31181;&#26041;&#27861;&#36890;&#36807;&#20445;&#35777;&#30495;&#23454;&#19990;&#30028;&#21644;&#39118;&#38505;&#20013;&#24615;&#20215;&#26684;&#21464;&#21160;&#27010;&#29575;&#30340;&#30456;&#31561;&#24615;&#65292;&#21033;&#29992;&#33258;&#28982;&#19990;&#30028;&#27010;&#29575;&#19979;&#30340;&#26399;&#26395;&#26469;&#35745;&#31639;&#39118;&#38505;&#20013;&#24615;&#26399;&#26435;&#20215;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#31181;&#26367;&#20195;&#22871;&#21033;&#20813;&#36153;&#12289;&#24066;&#22330;&#23436;&#22791;&#30340;&#26399;&#26435;&#23450;&#20215;&#26041;&#27861;&#12290;&#31532;&#19968;&#31181;&#26041;&#27861;&#19981;&#38656;&#35201;&#26080;&#39118;&#38505;&#36164;&#20135;&#12290;&#25105;&#20204;&#20026;&#36825;&#31181;&#26041;&#27861;&#21046;&#23450;&#20102;&#19968;&#33324;&#24615;&#26694;&#26550;&#65292;&#24182;&#29992;&#20004;&#20010;&#20855;&#20307;&#20363;&#23376;&#36827;&#34892;&#20102;&#35828;&#26126;&#12290;&#31532;&#20108;&#31181;&#26041;&#27861;&#20351;&#29992;&#20102;&#26080;&#39118;&#38505;&#36164;&#20135;&#12290;&#28982;&#32780;&#65292;&#36890;&#36807;&#30830;&#20445;&#29616;&#23454;&#19990;&#30028;&#21644;&#39118;&#38505;&#20013;&#24615;&#20215;&#26684;&#21464;&#21160;&#27010;&#29575;&#20043;&#38388;&#30340;&#30456;&#31561;&#65292;&#31532;&#20108;&#31181;&#26041;&#27861;&#20351;&#24471;&#21487;&#20197;&#21033;&#29992;&#33258;&#28982;&#19990;&#30028;&#27010;&#29575;P&#19979;&#30340;&#26399;&#26395;&#26469;&#35745;&#31639;&#39118;&#38505;&#20013;&#24615;&#26399;&#26435;&#20215;&#26684;&#12290;&#36825;&#20135;&#29983;&#20102;&#19982;&#32463;&#20856;&#26041;&#27861;&#20013;&#21033;&#29992;&#39118;&#38505;&#20013;&#24615;&#27979;&#24230;Q&#19979;&#35745;&#31639;&#20215;&#26684;&#30456;&#21516;&#30340;&#26399;&#26435;&#20215;&#26684;&#12290;&#31532;&#20108;&#31181;&#26041;&#27861;&#21644;&#31532;&#19968;&#31181;&#26041;&#27861;&#30340;&#20004;&#20010;&#20855;&#20307;&#20363;&#23376;&#38656;&#35201;&#24341;&#20837;&#26032;&#30340;&#12289;&#21487;&#20132;&#26131;&#30340;&#36164;&#20135;&#31867;&#22411;&#65292;&#20855;&#20307;&#26469;&#35828;&#26159;&#32929;&#31080;&#30340;&#27704;&#32493;&#34893;&#29983;&#21697;&#21644;&#19968;&#20010;&#32047;&#31215;&#22238;&#25253;&#65288;&#32780;&#19981;&#26159;&#20215;&#26684;&#65289;&#34987;&#25240;&#31639;&#30340;&#32929;&#31080;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17187v1 Announce Type: new  Abstract: We develop two alternate approaches to arbitrage-free, market-complete, option pricing. The first approach requires no riskless asset. We develop the general framework for this approach and illustrate it with two specific examples. The second approach does use a riskless asset. However, by ensuring equality between real-world and risk-neutral price-change probabilities, the second approach enables the computation of risk-neutral option prices utilizing expectations under the natural world probability P. This produces the same option prices as the classical approach in which prices are computed under the risk neutral measure Q. The second approach and the two specific examples of the first approach require the introduction of new, marketable asset types, specifically perpetual derivatives of a stock, and a stock whose cumulative return (rather than price) is deflated.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#38024;&#23545;&#24037;&#19994;&#35774;&#26045;&#38598;&#32676;&#30340;CO2&#25429;&#38598;&#12289;&#36755;&#36865;&#21644;&#20648;&#23384;&#31995;&#32479;&#35774;&#35745;&#26041;&#27861;&#21644;&#35265;&#35299;&#65292;&#24212;&#29992;&#21040;&#36335;&#26131;&#26031;&#23433;&#37027;&#24030;&#20272;&#35745;&#26368;&#22810;&#21487;&#25429;&#38598; 50 &#30334;&#19975; tCO2/y &#30340;&#24037;&#19994;&#25490;&#25918;&#65292;&#24182;&#19988;&#25104;&#26412;&#19981;&#21040;&#27599;&#21544;100&#32654;&#20803;</title><link>https://arxiv.org/abs/2403.17162</link><description>&lt;p&gt;
&#24037;&#19994;CO2&#25429;&#38598;&#12289;&#36755;&#36865;&#21644;&#20648;&#23384;&#31995;&#32479;&#30340;&#35774;&#35745;&#35265;&#35299;
&lt;/p&gt;
&lt;p&gt;
Design Insights for Industrial CO2 Capture, Transport, and Storage Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17162
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#38024;&#23545;&#24037;&#19994;&#35774;&#26045;&#38598;&#32676;&#30340;CO2&#25429;&#38598;&#12289;&#36755;&#36865;&#21644;&#20648;&#23384;&#31995;&#32479;&#35774;&#35745;&#26041;&#27861;&#21644;&#35265;&#35299;&#65292;&#24212;&#29992;&#21040;&#36335;&#26131;&#26031;&#23433;&#37027;&#24030;&#20272;&#35745;&#26368;&#22810;&#21487;&#25429;&#38598; 50 &#30334;&#19975; tCO2/y &#30340;&#24037;&#19994;&#25490;&#25918;&#65292;&#24182;&#19988;&#25104;&#26412;&#19981;&#21040;&#27599;&#21544;100&#32654;&#20803;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#38024;&#23545;&#24037;&#19994;&#35774;&#26045;&#38598;&#32676;&#30340;CO2&#25429;&#38598;&#12289;&#36755;&#36865;&#21644;&#20648;&#23384;&#31995;&#32479;&#30340;&#35774;&#35745;&#26041;&#27861;&#21644;&#35265;&#35299;&#65292;&#20197;&#36335;&#26131;&#26031;&#23433;&#37027;&#24030;&#20026;&#26696;&#20363;&#30740;&#31350;&#37325;&#28857;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#26694;&#26550;&#21253;&#25324;&#65306;(1)&#35780;&#20272;&#21333;&#20010;&#35774;&#26045;&#21487;&#25429;&#38598;&#30340;CO2&#25490;&#25918;&#35268;&#27169;&#21644;&#27987;&#24230;&#65292;&#20197;&#20272;&#31639;CO2&#25429;&#38598;&#25913;&#36896;&#30340;&#25104;&#26412;&#65292;(2)&#31579;&#36873;&#26041;&#27861;&#29992;&#20110;&#30830;&#23450;&#28508;&#22312;&#30340;CO2&#20648;&#23384;&#22320;&#28857;&#24182;&#20272;&#31639;&#20854;&#20648;&#23384;&#33021;&#21147;&#12289;&#27880;&#20837;&#36895;&#24230;&#21644;&#25104;&#26412;&#65307;&#20197;&#21450;(3)&#19968;&#31181;&#20197;&#25104;&#26412;&#26368;&#23567;&#21270;&#20026;&#30446;&#26631;&#30340;&#31649;&#36947;&#22522;&#30784;&#35774;&#26045;&#35774;&#35745;&#26041;&#27861;&#65292;&#36830;&#25509;CO2&#25429;&#38598;&#24037;&#21378;&#21644;&#20648;&#23384;&#22320;&#28857;&#65292;&#32771;&#34385;&#22303;&#22320;&#21033;&#29992;&#27169;&#24335;&#12289;&#29616;&#26377;&#36890;&#34892;&#26435;&#12289;&#20154;&#21475;&#32479;&#35745;&#25968;&#25454;&#20197;&#21450;&#21508;&#31181;&#31038;&#20250;&#21644;&#29615;&#22659;&#20844;&#27491;&#22240;&#32032;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17162v1 Announce Type: new  Abstract: We present design methods and insights for CO2 capture, transport, and storage systems for clusters of industrial facilities, with a case-study focus on the state of Louisiana. Our analytical framework includes: (1) evaluating the scale and concentration of capturable CO2 emissions at individual facilities for the purpose of estimating the cost of CO2 capture retrofits, (2) a screening method to identify potential CO2 storage sites and estimate their storage capacities, injectivities, and costs; and (3) an approach for cost-minimized design of pipeline infrastructure connecting CO2 capture plants with storage sites that considers land use patterns, existing rights-of-way, demographics, and a variety of social and environmental justice factors. In applying our framework to Louisiana, we estimate up to 50 million tCO2/y of industrial emissions (out of today's total emissions of 130 MtCO2/y) can be captured at under 100 USD/tCO2, and up to 
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22343;&#20540;-&#26041;&#24046;&#36328;&#24230;&#20551;&#35774;&#26816;&#39564;&#26694;&#26550;&#65292;&#33021;&#22815;&#22312;&#20219;&#24847;&#27979;&#35797;&#36164;&#20135;&#32500;&#24230;&#19978;&#24212;&#29992;&#65292;&#36890;&#36807;&#20351;&#29992;&#31283;&#20581;&#30340;&#23398;&#29983;t&#32479;&#35745;&#22522;&#20110;&#25209;&#37327;&#22343;&#20540;&#26041;&#27861;&#36880;&#20010;&#27979;&#35797;&#30697;&#26465;&#20214;&#65292;&#28982;&#21518;&#20351;&#29992;&#26607;&#35199;&#32452;&#21512;&#26816;&#39564;&#32467;&#21512;p&#20540;&#65292;&#35777;&#26126;&#20102;&#30456;&#23545;&#20110;&#29616;&#26377;&#26041;&#27861;&#30340;&#21331;&#36234;&#24615;&#33021;&#65292;&#24182;&#22312;&#23454;&#35777;&#24212;&#29992;&#20013;&#25506;&#35752;&#20102;&#32929;&#31080;&#20998;&#25955;&#21270;&#20013;&#22269;&#20869;&#19982;&#22269;&#38469;&#38388;&#30340;&#20248;&#21183;&#21644;&#24433;&#21709;&#22240;&#32032;&#12290;</title><link>https://arxiv.org/abs/2403.17127</link><description>&lt;p&gt;
&#39640;&#32500;&#22343;&#20540;-&#26041;&#24046;&#36328;&#24230;&#27979;&#35797;
&lt;/p&gt;
&lt;p&gt;
High-Dimensional Mean-Variance Spanning Tests
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17127
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22343;&#20540;-&#26041;&#24046;&#36328;&#24230;&#20551;&#35774;&#26816;&#39564;&#26694;&#26550;&#65292;&#33021;&#22815;&#22312;&#20219;&#24847;&#27979;&#35797;&#36164;&#20135;&#32500;&#24230;&#19978;&#24212;&#29992;&#65292;&#36890;&#36807;&#20351;&#29992;&#31283;&#20581;&#30340;&#23398;&#29983;t&#32479;&#35745;&#22522;&#20110;&#25209;&#37327;&#22343;&#20540;&#26041;&#27861;&#36880;&#20010;&#27979;&#35797;&#30697;&#26465;&#20214;&#65292;&#28982;&#21518;&#20351;&#29992;&#26607;&#35199;&#32452;&#21512;&#26816;&#39564;&#32467;&#21512;p&#20540;&#65292;&#35777;&#26126;&#20102;&#30456;&#23545;&#20110;&#29616;&#26377;&#26041;&#27861;&#30340;&#21331;&#36234;&#24615;&#33021;&#65292;&#24182;&#22312;&#23454;&#35777;&#24212;&#29992;&#20013;&#25506;&#35752;&#20102;&#32929;&#31080;&#20998;&#25955;&#21270;&#20013;&#22269;&#20869;&#19982;&#22269;&#38469;&#38388;&#30340;&#20248;&#21183;&#21644;&#24433;&#21709;&#22240;&#32032;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#22343;&#20540;-&#26041;&#24046;&#36328;&#24230;&#65288;MVS&#65289;&#20551;&#35774;&#26816;&#39564;&#26694;&#26550;&#12290;&#35813;&#31243;&#24207;&#21487;&#24212;&#29992;&#20110;&#20219;&#20309;&#27979;&#35797;&#36164;&#20135;&#32500;&#24230;&#65292;&#21482;&#38656;&#35201;&#31283;&#23450;&#30340;&#36164;&#20135;&#22238;&#25253;&#21644;&#22522;&#20934;&#36164;&#20135;&#25968;&#37327;&#23567;&#20110;&#26102;&#38388;&#21608;&#26399;&#25968;&#37327;&#12290;&#23427;&#28041;&#21450;&#20351;&#29992;&#22522;&#20110;&#25209;&#37327;&#22343;&#20540;&#26041;&#27861;&#30340;&#31283;&#20581;&#23398;&#29983;t&#32479;&#35745;&#37327;&#36880;&#20010;&#27979;&#35797;&#30697;&#26465;&#20214;&#65292;&#24182;&#20351;&#29992;&#26607;&#35199;&#32452;&#21512;&#26816;&#39564;&#23558;p&#20540;&#32452;&#21512;&#22312;&#19968;&#36215;&#12290;&#27169;&#25311;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#27979;&#35797;&#30456;&#23545;&#20110;&#26368;&#20808;&#36827;&#30340;&#26041;&#27861;&#34920;&#29616;&#20986;&#21331;&#36234;&#24615;&#33021;&#12290;&#23545;&#20110;&#23454;&#35777;&#24212;&#29992;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#32929;&#31080;&#39046;&#22495;&#30340;&#22269;&#20869;&#19982;&#22269;&#38469;&#20998;&#25955;&#21270;&#38382;&#39064;&#12290;&#25105;&#20204;&#21457;&#29616;&#20998;&#25955;&#21270;&#30340;&#20248;&#21183;&#21463;&#32463;&#27982;&#29366;&#20917;&#24433;&#21709;&#65292;&#24182;&#21576;&#29616;&#36328;&#22269;&#23478;&#21464;&#21270;&#12290;&#25105;&#20204;&#36824;&#24378;&#35843;&#65292;&#25298;&#32477;MVS&#20551;&#35774;&#28304;&#20110;&#22312;&#22269;&#20869;&#20840;&#29699;&#26368;&#23567;&#26041;&#24046;&#32452;&#21512;&#20013;&#38477;&#20302;&#26041;&#24046;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17127v1 Announce Type: cross  Abstract: We introduce a new framework for the mean-variance spanning (MVS) hypothesis testing. The procedure can be applied to any test-asset dimension and only requires stationary asset returns and the number of benchmark assets to be smaller than the number of time periods. It involves individually testing moment conditions using a robust Student-t statistic based on the batch-mean method and combining the p-values using the Cauchy combination test. Simulations demonstrate the superior performance of the test compared to state-of-the-art approaches. For the empirical application, we look at the problem of domestic versus international diversification in equities. We find that the advantages of diversification are influenced by economic conditions and exhibit cross-country variation. We also highlight that the rejection of the MVS hypothesis originates from the potential to reduce variance within the domestic global minimum-variance portfolio.
&lt;/p&gt;</description></item><item><title>PMUY&#23545;&#21360;&#24230;&#36139;&#22256;&#23478;&#24237;&#30340;LPG&#33719;&#21462;&#26377;&#30528;2.1&#20010;&#30334;&#20998;&#28857;&#30340;&#25552;&#21319;&#65292;&#21516;&#26102;&#22312;&#19981;&#21516;&#22320;&#21306;&#21644;&#31038;&#20250;&#32676;&#20307;&#20043;&#38388;&#23384;&#22312;&#24046;&#24322;&#24433;&#21709;&#65292;&#38656;&#35201;&#25919;&#31574;&#24378;&#35843;&#26377;&#38024;&#23545;&#24615;&#30340;&#24178;&#39044;&#25514;&#26045;&#12290;</title><link>https://arxiv.org/abs/2403.17112</link><description>&lt;p&gt;
&#21360;&#24230;&#23478;&#24237;&#26222;&#25289;&#24503;&#27721;&#26364;&#29305;&#37324;&#20044;&#36158;&#25289;&#35745;&#21010;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The Impact of Pradhan Mantri Ujjwala Yojana on Indian Households
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17112
&lt;/p&gt;
&lt;p&gt;
PMUY&#23545;&#21360;&#24230;&#36139;&#22256;&#23478;&#24237;&#30340;LPG&#33719;&#21462;&#26377;&#30528;2.1&#20010;&#30334;&#20998;&#28857;&#30340;&#25552;&#21319;&#65292;&#21516;&#26102;&#22312;&#19981;&#21516;&#22320;&#21306;&#21644;&#31038;&#20250;&#32676;&#20307;&#20043;&#38388;&#23384;&#22312;&#24046;&#24322;&#24433;&#21709;&#65292;&#38656;&#35201;&#25919;&#31574;&#24378;&#35843;&#26377;&#38024;&#23545;&#24615;&#30340;&#24178;&#39044;&#25514;&#26045;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#23545;&#26222;&#25289;&#24503;&#27721;&#26364;&#29305;&#37324;&#20044;&#36158;&#25289;&#35745;&#21010;&#65288;PMUY&#65289;&#23545;&#21360;&#24230;&#36139;&#22256;&#23478;&#24237;LPG&#33719;&#21462;&#30340;&#24433;&#21709;&#36827;&#34892;&#20102;&#25209;&#21028;&#24615;&#35780;&#20272;&#12290;&#21033;&#29992;&#20542;&#21521;&#24471;&#20998;&#21305;&#37197;&#21644;&#21452;&#37325;&#24046;&#20998;&#20272;&#35745;&#22120;&#20197;&#21450;&#22269;&#23478;&#23478;&#24237;&#20581;&#24247;&#35843;&#26597;&#65288;NFHS&#65289;&#25968;&#25454;&#38598;&#65292;&#30740;&#31350;&#21457;&#29616;&#23454;&#26045;PMUY&#21518;&#65292;&#21463;&#35797;&#32773;&#30340;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#22312;LPG&#28040;&#36153;&#19978;&#22686;&#21152;&#20102;2.1&#20010;&#30334;&#20998;&#28857;&#65292;&#21516;&#26102;&#28779;&#26612;&#28040;&#36153;&#20943;&#23569;&#12290;&#21306;&#22495;&#20998;&#26512;&#26174;&#31034;&#19981;&#21516;&#30340;&#24433;&#21709;&#65292;&#21271;&#37096;&#12289;&#35199;&#37096;&#21644;&#21335;&#37096;&#21462;&#24471;&#20102;&#26174;&#33879;&#36827;&#23637;&#65292;&#20294;&#19996;&#37096;&#21644;&#19996;&#21271;&#37096;&#30340;&#24433;&#21709;&#19981;&#37027;&#20040;&#26126;&#26174;&#12290;&#30740;&#31350;&#36824;&#24378;&#35843;&#20102;&#19981;&#21516;&#31038;&#20250;&#32676;&#20307;&#20043;&#38388;&#30340;&#24046;&#24322;&#65292;&#34920;&#26126;&#26368;&#26174;&#33879;&#30340;&#22909;&#22788;&#26159;&#30001;&#31038;&#20250;&#38454;&#23618;&#23478;&#24237;&#33719;&#24471;&#30340;&#65292;&#32780;&#37096;&#33853;&#23478;&#24237;&#20960;&#20046;&#27809;&#26377;&#21463;&#21040;&#24433;&#21709;&#12290;&#23613;&#31649;PMUY&#22312;&#20419;&#36827;LPG&#33719;&#21462;&#26041;&#38754;&#21462;&#24471;&#20102;&#21021;&#27493;&#25104;&#21151;&#65292;&#20294;&#32500;&#25345;&#20854;&#20351;&#29992;&#20173;&#28982;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#25919;&#31574;&#24212;&#24378;&#35843;&#26377;&#38024;&#23545;&#24615;&#30340;&#24178;&#39044;&#25514;&#26045;&#65292;&#22686;&#21152;&#25910;&#20837;&#25903;&#25345;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17112v1 Announce Type: new  Abstract: This study critically evaluates the impact of the Pradhan Mantri Ujjwala Yojana (PMUY) on LPG accessibility among poor households in India. Using Propensity Score Matching and Difference-in-Differences estimators and the National Family Health Survey (NFHS) dataset, the Average Treatment Effect on the interdedly Treated is a modest 2.1 percentage point increase in LPG consumption due to PMUY, with a parallel decrease in firewood consumption. Regional analysis reveals differential impacts, with significant progress in the North, West, and South but less pronounced effects in the East and North East. The study also underscores variance across social groups, with Schedule Caste households showing the most substantial benefits, while Scheduled Tribes households are hardly affected. Despite the PMUY's initial success in facilitating LPG access, sustaining its usage remains challenging. Policy should emphasise targeted interventions, income su
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;Boehmer&#31561;&#20154;&#65288;2021&#24180;&#65289;&#20851;&#20110;&#38646;&#21806;&#35746;&#21333;&#19981;&#24179;&#34913;&#65288;ROI&#65289;&#23545;&#26410;&#26469;&#32929;&#31080;&#22238;&#25253;&#39044;&#27979;&#33021;&#21147;&#30340;&#24320;&#21019;&#24615;&#24037;&#20316;&#65292;&#21457;&#29616;&#36825;&#20123;&#32467;&#35770;&#23545;&#20110;&#19981;&#21516;&#26679;&#26412;&#26102;&#26399;&#21644;ROI&#35782;&#21035;&#26041;&#27861;&#26159;&#25935;&#24863;&#30340;&#12290;</title><link>https://arxiv.org/abs/2403.17095</link><description>&lt;p&gt;
&#37325;&#26032;&#23457;&#35270;Boehmer&#31561;&#20154;&#65288;2021&#24180;&#65289;&#65306;&#26368;&#26032;&#26102;&#26399;&#65292;&#26367;&#20195;&#26041;&#27861;&#65292;&#19981;&#21516;&#32467;&#35770;
&lt;/p&gt;
&lt;p&gt;
Revisiting Boehmer et al. (2021): Recent Period, Alternative Method, Different Conclusions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17095
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;Boehmer&#31561;&#20154;&#65288;2021&#24180;&#65289;&#20851;&#20110;&#38646;&#21806;&#35746;&#21333;&#19981;&#24179;&#34913;&#65288;ROI&#65289;&#23545;&#26410;&#26469;&#32929;&#31080;&#22238;&#25253;&#39044;&#27979;&#33021;&#21147;&#30340;&#24320;&#21019;&#24615;&#24037;&#20316;&#65292;&#21457;&#29616;&#36825;&#20123;&#32467;&#35770;&#23545;&#20110;&#19981;&#21516;&#26679;&#26412;&#26102;&#26399;&#21644;ROI&#35782;&#21035;&#26041;&#27861;&#26159;&#25935;&#24863;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#37325;&#26032;&#35780;&#20272;&#20102;Boehmer&#31561;&#20154;&#65288;2021&#24180;&#65292;BJZZ&#65289;&#20851;&#20110;&#38646;&#21806;&#35746;&#21333;&#19981;&#24179;&#34913;&#65288;ROI&#65289;&#23545;&#26410;&#26469;&#32929;&#31080;&#22238;&#25253;&#39044;&#27979;&#33021;&#21147;&#30340;&#24320;&#21019;&#24615;&#24037;&#20316;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#22312;&#26356;&#36817;&#26399;&#30340;2016-2021&#24180;&#26399;&#38388;&#22797;&#21046;&#20102;&#20182;&#20204;&#22312;2010-2015&#24180;&#30340;&#20998;&#26512;&#12290;&#25105;&#20204;&#21457;&#29616;ROI&#30340;&#39044;&#27979;&#33021;&#21147;&#26174;&#33879;&#19979;&#38477;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#36807;&#21435;&#30340;ROI&#19981;&#33021;&#20877;&#39044;&#27979;&#22823;&#30424;&#32929;&#30340;&#21608;&#22238;&#25253;&#65292;&#22522;&#20110;&#36807;&#21435;ROI&#30340;&#22810;&#31354;&#31574;&#30053;&#20063;&#19981;&#20877;&#30408;&#21033;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#20351;&#29992;&#26367;&#20195;&#25253;&#20215;&#20013;&#28857;&#65288;QMP&#65289;&#26041;&#27861;&#26469;&#35782;&#21035;&#21644;&#26631;&#35760;&#38646;&#21806;&#20132;&#26131;&#23545;&#20027;&#35201;&#32467;&#35770;&#30340;&#24433;&#21709;&#12290;&#34429;&#28982;&#22522;&#20110;QMP&#26041;&#27861;&#30340;&#32467;&#26524;&#19982;2010-2015&#24180;&#30340;BJZZ&#21457;&#29616;&#19968;&#33268;&#65292;&#20294;&#36825;&#20004;&#31181;&#26041;&#27861;&#22312;2016-2021&#24180;&#25552;&#20379;&#20102;&#19981;&#21516;&#30340;&#32467;&#35770;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#34920;&#26126;&#65292;BJZZ&#30340;&#21407;&#22987;&#21457;&#29616;&#23545;&#26679;&#26412;&#26399;&#38388;&#21644;&#35782;&#21035;ROI&#30340;&#26041;&#27861;&#25935;&#24863;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17095v1 Announce Type: new  Abstract: We reassess Boehmer et al. (2021, BJZZ)'s seminal work on the predictive power of retail order imbalance (ROI) for future stock returns. First, we replicate their 2010-2015 analysis in the more recent 2016-2021 period. We find that the ROI's predictive power weakens significantly. Specifically, past ROI can no longer predict weekly returns on large-cap stocks, and the long-short strategy based on past ROI is no longer profitable. Second, we analyze the effect of using the alternative quote midpoint (QMP) method to identify and sign retail trades on their main conclusions. While the results based on the QMP method align with BJZZ's findings in 2010-2015, the two methods provide different conclusions in 2016-2021. Our study shows that BJZZ's original findings are sensitive to the sample period and the approach to identify ROIs.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22810;&#20803;Levy&#36807;&#31243;&#27169;&#22411;&#21644;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#30340;&#37327;&#20215;&#26399;&#26435;&#23450;&#20215;&#26041;&#27861;&#65292;&#36890;&#36807;&#26032;&#22411;&#30340;gNTS&#36807;&#31243;&#27169;&#22411;&#21644;CRealNVP&#27169;&#22411;&#23454;&#29616;&#23545;&#22855;&#24322;&#26399;&#26435;&#30340;&#23450;&#20215;&#65292;&#20026;&#23450;&#20215;&#22806;&#22269;&#25351;&#25968;&#21644;&#22806;&#27719;&#27719;&#29575;&#31561;&#22522;&#30784;&#36164;&#20135;&#30340;&#37327;&#20215;&#26399;&#26435;&#25552;&#20379;&#20102;&#21487;&#34892;&#31574;&#30053;</title><link>https://arxiv.org/abs/2402.17919</link><description>&lt;p&gt;
&#22522;&#20110;&#22810;&#20803;Levy&#36807;&#31243;&#27169;&#22411;&#30340;&#37327;&#20215;&#26399;&#26435;&#23450;&#20215;&#19982;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;
&lt;/p&gt;
&lt;p&gt;
Quanto Option Pricing on a Multivariate Levy Process Model with a Generative Artificial Intelligence
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17919
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22810;&#20803;Levy&#36807;&#31243;&#27169;&#22411;&#21644;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#30340;&#37327;&#20215;&#26399;&#26435;&#23450;&#20215;&#26041;&#27861;&#65292;&#36890;&#36807;&#26032;&#22411;&#30340;gNTS&#36807;&#31243;&#27169;&#22411;&#21644;CRealNVP&#27169;&#22411;&#23454;&#29616;&#23545;&#22855;&#24322;&#26399;&#26435;&#30340;&#23450;&#20215;&#65292;&#20026;&#23450;&#20215;&#22806;&#22269;&#25351;&#25968;&#21644;&#22806;&#27719;&#27719;&#29575;&#31561;&#22522;&#30784;&#36164;&#20135;&#30340;&#37327;&#20215;&#26399;&#26435;&#25552;&#20379;&#20102;&#21487;&#34892;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#35752;&#35770;&#20102;&#19968;&#31181;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#65292;&#29992;&#20110;&#22522;&#20110;&#38750;&#39640;&#26031;Levy&#36807;&#31243;&#27169;&#22411;&#23450;&#20215;&#20004;&#20010;&#22522;&#30784;&#36164;&#20135;&#30340;&#22855;&#24322;&#26399;&#26435;&#12290;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;&#24191;&#20041;&#27491;&#24577;&#28201;&#21644;&#31283;&#23450;&#65288;gNTS&#65289;&#36807;&#31243;&#30340;&#26032;&#22411;&#22810;&#20803;Levy&#36807;&#31243;&#27169;&#22411;&#65292;&#23427;&#30001;&#26102;&#21464;&#22810;&#20803;&#24067;&#26391;&#36816;&#21160;&#23450;&#20041;&#12290;&#30001;&#20110;gNTS&#36807;&#31243;&#30340;&#27010;&#29575;&#23494;&#24230;&#20989;&#25968;&#65288;PDF&#65289;&#19981;&#26159;&#31616;&#21333;&#30340;&#35299;&#26512;&#20844;&#24335;&#32473;&#20986;&#30340;&#65292;&#22240;&#27492;&#25105;&#20204;&#20351;&#29992;&#20102;&#26377;&#26465;&#20214;&#30340;&#30495;&#20540;&#38750;&#20307;&#31215;&#20445;&#25345;&#65288;CRealNVP&#65289;&#27169;&#22411;&#65292;&#36825;&#26159;&#19968;&#31181;&#22522;&#20110;&#27969;&#30340;&#29983;&#25104;&#32593;&#32476;&#12290;&#20043;&#21518;&#65292;&#25105;&#20204;&#35752;&#35770;&#20102;&#22312;gNTS&#27169;&#22411;&#19978;&#30340;&#26080;&#22871;&#21033;&#23450;&#20215;&#65292;&#29992;&#20110;&#23450;&#20215;&#22522;&#30784;&#36164;&#20135;&#21253;&#25324;&#22806;&#22269;&#25351;&#25968;&#21644;&#22806;&#27719;&#27719;&#29575;&#30340;&#37327;&#20215;&#26399;&#26435;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#21033;&#29992;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#29983;&#25104;&#30340;&#35757;&#32451;&#38598;&#35757;&#32451;CRealNVP&#27169;&#22411;&#26469;&#23398;&#20064;gNTS&#36807;&#31243;&#30340;PDF&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#21033;&#29992;&#32463;&#36807;&#35757;&#32451;&#30340;CRea...
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17919v1 Announce Type: new  Abstract: In this study, we discuss a machine learning technique to price exotic options with two underlying assets based on a non-Gaussian Levy process model. We introduce a new multivariate Levy process model named the generalized normal tempered stable (gNTS) process, which is defined by time-changed multivariate Brownian motion. Since the probability density function (PDF) of the gNTS process is not given by a simple analytic formula, we use the conditional real-valued non-volume preserving (CRealNVP) model, which is a sort of flow-based generative networks. After that, we discuss the no-arbitrage pricing on the gNTS model for pricing the quanto option whose underlying assets consist of a foreign index and foreign exchange rate. We also present the training of the CRealNVP model to learn the PDF of the gNTS process using a training set generated by Monte Carlo simulation. Next, we estimate the parameters of the gNTS model with the trained CRea
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#27604;&#36739;&#27599;&#23478;&#20844;&#21496;&#30340;&#31995;&#32479;&#37325;&#35201;&#24615;&#21644;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26368;&#20248;&#30340;&#20943;&#25490;&#31574;&#30053;&#65292;&#20026;&#23454;&#29616;20%&#20943;&#25490;&#30446;&#26631;&#25552;&#20379;&#20102;&#20943;&#23569;&#23601;&#19994;&#21644;&#32463;&#27982;&#25439;&#22833;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>https://arxiv.org/abs/2302.08987</link><description>&lt;p&gt;
&#20943;&#23569;&#33073;&#30899;&#22833;&#19994;&#21644;&#32463;&#27982;&#25439;&#22833;&#30340;&#20225;&#19994;&#32423;&#20379;&#24212;&#38142;
&lt;/p&gt;
&lt;p&gt;
Firm-level supply chains to minimize decarbonization unemployment and economic losses
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2302.08987
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#27604;&#36739;&#27599;&#23478;&#20844;&#21496;&#30340;&#31995;&#32479;&#37325;&#35201;&#24615;&#21644;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26368;&#20248;&#30340;&#20943;&#25490;&#31574;&#30053;&#65292;&#20026;&#23454;&#29616;20%&#20943;&#25490;&#30446;&#26631;&#25552;&#20379;&#20102;&#20943;&#23569;&#23601;&#19994;&#21644;&#32463;&#27982;&#25439;&#22833;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24613;&#38656;&#20943;&#23569;&#30899;&#25490;&#25918;&#21487;&#33021;&#23548;&#33268;&#20005;&#26684;&#30340;&#21629;&#20196;&#19982;&#25511;&#21046;&#33073;&#30899;&#31574;&#30053;&#65292;&#21487;&#33021;&#24102;&#26469;&#36127;&#38754;&#32463;&#27982;&#21518;&#26524;&#12290;&#26412;&#25991;&#20998;&#26512;&#20102;&#27431;&#27954;&#32463;&#27982;&#30340;&#25972;&#20307;&#20225;&#19994;&#32423;&#29983;&#20135;&#32593;&#32476;&#65292;&#25506;&#35752;&#20102;&#22914;&#20309;&#36991;&#20813;&#36825;&#20123;&#26041;&#27861;&#30340;&#26368;&#22351;&#32467;&#26524;&#12290;&#25105;&#20204;&#27604;&#36739;&#20102;&#27599;&#23478;&#20844;&#21496;&#30340;&#31995;&#32479;&#37325;&#35201;&#24615;&#21644;&#20854;&#24180;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#65292;&#20197;&#30830;&#23450;&#20855;&#26377;&#26368;&#23567;&#39069;&#22806;&#22833;&#19994;&#21644;&#32463;&#27982;&#25439;&#22833;&#30340;&#26368;&#20339;&#20943;&#25490;&#31574;&#30053;&#12290;&#25105;&#20204;&#35774;&#23450;&#20102;&#29305;&#23450;&#30340;&#20943;&#25490;&#30446;&#26631;&#65292;&#30740;&#31350;&#20102;&#21508;&#31181;&#33073;&#30899;&#24773;&#26223;&#24182;&#37327;&#21270;&#20102;&#23427;&#20204;&#30340;&#32463;&#27982;&#21518;&#26524;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#23545;&#20110;&#20943;&#25490;20&#65285;&#65292;&#26368;&#26377;&#25928;&#30340;&#31574;&#30053;&#23548;&#33268;&#32422;2&#65285;&#30340;&#23601;&#19994;&#23703;&#20301;&#25439;&#22833;&#21644;2&#65285;&#30340;&#32463;&#27982;&#20135;&#20986;&#25439;&#22833;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#38024;&#23545;&#26368;&#22823;&#25490;&#25918;&#20225;&#19994;&#30340;&#26420;&#32032;&#24773;&#26223;&#65292;&#30456;&#21516;&#30446;&#26631;&#20250;&#23548;&#33268;28&#65285;&#30340;&#22833;&#19994;&#29575;&#21644;33&#65285;&#30340;&#20135;&#20986;&#20943;&#23569;&#12290;&#36825;&#34920;&#26126;&#21487;&#20197;&#20351;&#29992;&#20225;&#19994;&#32423;&#29983;&#20135;&#26041;&#24335;&#26469;&#23454;&#29616;&#33073;&#30899;&#30446;&#26631;&#65292;&#32780;&#19981;&#20250;&#24102;&#26469;&#36807;&#24230;&#30340;&#32463;&#27982;&#25439;&#22833;&#21644;&#22833;&#19994;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2302.08987v2 Announce Type: replace  Abstract: Urgently needed carbon emission reductions might lead to strict command-and-control decarbonization strategies with potentially negative economic consequences. Analyzing the entire firm-level production network of a European economy, we explore how the worst outcomes of such approaches can be avoided. We compare the systemic relevance of every firm with its annual CO2 emissions to identify optimal emission-reducing strategies with a minimum of additional unemployment and economic losses. Setting specific reduction targets we study various decarbonization scenarios and quantify their economic consequences. We show that for an emission-reduction of 20% the most effective strategy leads to losses of about 2% of jobs and 2% of economic output. In contrast, a naive scenario targeting largest emitters first, results in 28% job losses and 33% output reduction for the same target. This demonstrates that it is possible to use firm-level produ
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20174;&#29702;&#35770;&#19978;&#35780;&#20272;&#20102;&#23454;&#35777;&#37329;&#34701;&#21644;&#35745;&#37327;&#32463;&#27982;&#23398;&#30740;&#31350;&#20013;&#24120;&#29992;&#30340;&#31185;&#23398;&#28436;&#32462;&#21644;&#22240;&#26524;&#25512;&#26029;&#26041;&#27861;&#30340;&#23616;&#38480;&#24615;&#65292;&#25552;&#20986;&#20102;&#22312;&#36164;&#26412;&#24066;&#22330;&#31561;&#33258;&#25105;&#21442;&#29031;&#21644;&#24320;&#25918;&#31995;&#32479;&#20013;&#21333;&#21521;&#22240;&#26524;&#20851;&#31995;&#30340;&#35266;&#28857;&#21487;&#33021;&#23384;&#22312;&#30340;&#38382;&#39064;&#65292;&#24182;&#21628;&#21505;&#26356;&#20840;&#38754;&#22320;&#35748;&#35782;&#23454;&#35777;&#37329;&#34701;&#30740;&#31350;&#21450;&#20854;&#20013;&#30340;&#39118;&#38505;&#12290;</title><link>http://arxiv.org/abs/2311.16570</link><description>&lt;p&gt;
&#32463;&#39564;&#37329;&#34701;&#30340;&#35748;&#35782;&#35770;&#38480;&#21046;&#65306;&#22240;&#26524;&#38477;&#35299;&#35770;&#21644;&#33258;&#25105;&#21442;&#29031;
&lt;/p&gt;
&lt;p&gt;
Epistemic Limits of Empirical Finance: Causal Reductionism and Self-Reference. (arXiv:2311.16570v3 [q-fin.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.16570
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20174;&#29702;&#35770;&#19978;&#35780;&#20272;&#20102;&#23454;&#35777;&#37329;&#34701;&#21644;&#35745;&#37327;&#32463;&#27982;&#23398;&#30740;&#31350;&#20013;&#24120;&#29992;&#30340;&#31185;&#23398;&#28436;&#32462;&#21644;&#22240;&#26524;&#25512;&#26029;&#26041;&#27861;&#30340;&#23616;&#38480;&#24615;&#65292;&#25552;&#20986;&#20102;&#22312;&#36164;&#26412;&#24066;&#22330;&#31561;&#33258;&#25105;&#21442;&#29031;&#21644;&#24320;&#25918;&#31995;&#32479;&#20013;&#21333;&#21521;&#22240;&#26524;&#20851;&#31995;&#30340;&#35266;&#28857;&#21487;&#33021;&#23384;&#22312;&#30340;&#38382;&#39064;&#65292;&#24182;&#21628;&#21505;&#26356;&#20840;&#38754;&#22320;&#35748;&#35782;&#23454;&#35777;&#37329;&#34701;&#30740;&#31350;&#21450;&#20854;&#20013;&#30340;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36164;&#26412;&#24066;&#22330;&#31561;&#33258;&#25105;&#21442;&#29031;&#21644;&#24320;&#25918;&#31995;&#32479;&#20013;&#65292;&#23545;&#20110;&#22240;&#26524;&#38477;&#35299;&#22312;&#30740;&#31350;&#20013;&#30340;&#21628;&#22768;&#26085;&#30410;&#39640;&#28072;&#12290;&#28982;&#32780;&#65292;&#22312;&#36825;&#26679;&#30340;&#31995;&#32479;&#20013;&#65292;&#21333;&#21521;&#22240;&#26524;&#20851;&#31995;&#30340;&#27010;&#24565;&#22312;&#26368;&#22909;&#30340;&#24773;&#20917;&#19979;&#21487;&#33021;&#26159;&#26377;&#38480;&#21046;&#30340;&#65292;&#22312;&#26368;&#22351;&#30340;&#24773;&#20917;&#19979;&#21487;&#33021;&#26159;&#19981;&#31283;&#23450;&#25110;&#33618;&#35884;&#30340;&#12290;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25209;&#21028;&#24615;&#22320;&#35780;&#20272;&#20102;&#22312;&#23454;&#35777;&#37329;&#34701;&#21644;&#35745;&#37327;&#32463;&#27982;&#23398;&#30740;&#31350;&#20013;&#20351;&#29992;&#31185;&#23398;&#28436;&#32462;&#21644;&#22240;&#26524;&#25512;&#26029;&#30340;&#20570;&#27861;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#20351;&#29992;&#20174;&#29983;&#24577;&#39135;&#39285;&#20851;&#31995;&#20013;&#25913;&#32534;&#30340;&#29609;&#20855;&#27169;&#22411;&#26469;&#23637;&#31034;&#31454;&#20105;&#24615;&#22240;&#26524;&#38142;&#30340;&#35266;&#28857;&#12290;&#22522;&#20110;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#21478;&#19968;&#31181;&#35266;&#28857;&#65292;&#21363;&#24403;&#25105;&#20204;&#25215;&#35748;&#25105;&#20204;&#24403;&#21069;&#30340;&#37327;&#21270;&#37329;&#34701;&#24037;&#20855;&#21487;&#33021;&#22312;&#27969;&#34892;&#20551;&#35774;&#19979;&#20165;&#38480;&#20110;&#20107;&#21518;&#22240;&#26524;&#25512;&#26029;&#26102;&#65292;&#25105;&#20204;&#21487;&#33021;&#26356;&#22909;&#22320;&#29702;&#35299;&#23454;&#35777;&#37329;&#34701;&#30740;&#31350;&#21450;&#20854;&#20013;&#25152;&#21253;&#21547;&#30340;&#39118;&#38505;&#12290;&#24403;&#36825;&#20123;&#20551;&#35774;&#21463;&#21040;&#25361;&#25112;&#26102;&#65292;&#20363;&#22914;&#22312;&#21487;&#35782;&#21035;&#30340;&#21453;&#36523;&#24615;&#32972;&#26223;&#19979;&#65292;&#21333;&#21521;&#22240;&#26524;&#20851;&#31995;&#30340;&#24314;&#35758;&#23601;&#26174;&#24471;&#38750;&#24120;&#26840;&#25163;&#12290;
&lt;/p&gt;
&lt;p&gt;
The clarion call for causal reduction in the study of capital markets is intensifying. However, in self-referencing and open systems such as capital markets, the idea of unidirectional causation (if applicable) may be limiting at best, and unstable or fallacious at worst. In this research, we critically assess the use of scientific deduction and causal inference within the study of empirical finance and econometrics. We then demonstrate the idea of competing causal chains using a toy model adapted from ecological predator/prey relationships. From this, we develop the alternative view that the study of empirical finance, and the risks contained therein, may be better appreciated once we admit that our current arsenal of quantitative finance tools may be limited to ex post causal inference under popular assumptions. Where these assumptions are challenged, for example in a recognizable reflexive context, the prescription of unidirectional causation proves deeply problematic.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35299;&#20915;&#20102;&#20648;&#33021;&#25805;&#20316;&#21592;&#22914;&#20309;&#22312;&#25552;&#20379;&#35843;&#39057;&#21516;&#26102;&#26356;&#22909;&#22320;&#20132;&#26131;&#30005;&#21147;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#23558;&#20648;&#33021;&#32422;&#26463;&#22312;&#30446;&#26631;&#30005;&#37327;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#26085;&#21069;&#24066;&#22330;&#20132;&#26131;&#30005;&#37327;&#20316;&#20026;&#35843;&#39057;&#30005;&#37327;&#30340;&#38544;&#21547;&#20989;&#25968;&#65292;&#37327;&#21270;&#20102;&#33021;&#28304;&#25439;&#22833;&#25152;&#38656;&#36141;&#20080;&#30340;&#30005;&#37327;&#12290;</title><link>http://arxiv.org/abs/2306.02987</link><description>&lt;p&gt;
&#20648;&#33021;&#35843;&#39057;&#65306;&#25439;&#22833;&#19982;&#25910;&#30410;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Frequency Regulation with Storage: On Losses and Profits. (arXiv:2306.02987v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.02987
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35299;&#20915;&#20102;&#20648;&#33021;&#25805;&#20316;&#21592;&#22914;&#20309;&#22312;&#25552;&#20379;&#35843;&#39057;&#21516;&#26102;&#26356;&#22909;&#22320;&#20132;&#26131;&#30005;&#21147;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#23558;&#20648;&#33021;&#32422;&#26463;&#22312;&#30446;&#26631;&#30005;&#37327;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#26085;&#21069;&#24066;&#22330;&#20132;&#26131;&#30005;&#37327;&#20316;&#20026;&#35843;&#39057;&#30005;&#37327;&#30340;&#38544;&#21547;&#20989;&#25968;&#65292;&#37327;&#21270;&#20102;&#33021;&#28304;&#25439;&#22833;&#25152;&#38656;&#36141;&#20080;&#30340;&#30005;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20302;&#30899;&#31038;&#20250;&#65292;&#20026;&#20102;&#24179;&#34913;&#39118;&#33021;&#21644;&#22826;&#38451;&#33021;&#31561;&#38388;&#27463;&#24615;&#21457;&#30005;&#65292;&#38656;&#35201;&#23384;&#20648;&#22823;&#37327;&#30005;&#21147;&#65292;&#27604;&#22914;&#36890;&#36807;&#35843;&#39057;&#26469;&#23454;&#29616;&#12290;&#26412;&#25991;&#35299;&#20915;&#20102;&#20648;&#33021;&#25805;&#20316;&#21592;&#30340;&#20915;&#31574;&#38382;&#39064;&#65292;&#20182;&#20204;&#21521;&#30005;&#32593;&#25805;&#20316;&#21592;&#20986;&#21806;&#35843;&#39057;&#30005;&#21147;&#24182;&#22312;&#26085;&#21069;&#24066;&#22330;&#19978;&#20132;&#26131;&#30005;&#21147;&#12290;&#25968;&#23398;&#19978;&#65292;&#26412;&#25991;&#23558;&#26410;&#26469;&#30340;&#39057;&#20559;&#36712;&#36857;&#35270;&#20026;&#21453;&#22797;&#20986;&#29616;&#30340;&#20248;&#21270;&#38382;&#39064;&#20013;&#30340;&#20989;&#25968;&#19981;&#30830;&#23450;&#24615;&#12290;&#25105;&#20204;&#32422;&#26463;&#26399;&#26395;&#30340;&#32456;&#31471;&#30005;&#37327;&#20026;&#26576;&#20010;&#30446;&#26631;&#20540;&#65292;&#20197;&#20351;&#20648;&#33021;&#25805;&#20316;&#21592;&#19981;&#20165;&#20026;&#29616;&#22312;&#32780;&#20026;&#26410;&#26469;&#20570;&#20986;&#22909;&#30340;&#20915;&#31574;&#12290;&#30001;&#20110;&#36825;&#20010;&#32422;&#26463;&#65292;&#26085;&#21069;&#24066;&#22330;&#19978;&#20132;&#26131;&#30340;&#30005;&#21147;&#37327;&#26159;&#20986;&#21806;&#32473;&#30005;&#32593;&#25805;&#20316;&#21592;&#30340;&#35843;&#39057;&#30005;&#37327;&#30340;&#19968;&#20010;&#38544;&#21547;&#20989;&#25968;&#12290;&#36825;&#20010;&#38544;&#21547;&#20989;&#25968;&#37327;&#21270;&#20102;&#25552;&#20379;&#35843;&#39057;&#25152;&#23548;&#33268;&#30340;&#39044;&#26399;&#33021;&#37327;&#25439;&#22833;&#25152;&#38656;&#36141;&#20080;&#30340;&#30005;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
Low-carbon societies will need to store vast amounts of electricity to balance intermittent generation from wind and solar energy, for example, through frequency regulation. Here, we derive an analytical solution to the decision-making problem of storage operators who sell frequency regulation power to grid operators and trade electricity on day-ahead markets. Mathematically, we treat future frequency deviation trajectories as functional uncertainties in a receding horizon robust optimization problem. We constrain the expected terminal state-of-charge to be equal to some target to allow storage operators to make good decisions not only for the present but also the future. Thanks to this constraint, the amount of electricity traded on day-ahead markets is an implicit function of the regulation power sold to grid operators. The implicit function quantifies the amount of power that needs to be purchased to cover the expected energy loss that results from providing frequency regulation. We
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20351;&#29992;&#36328;&#36234; 5 &#24180;&#30340; 500 &#31181;&#32654;&#22269;&#19978;&#24066;&#36164;&#20135;&#30340;&#27599;&#31186;&#25968;&#25454;&#65292;&#21457;&#29616;&#20215;&#26684;&#24418;&#25104;&#26159;&#22312;&#39640;&#24230;&#27969;&#21160;&#24615;&#36164;&#20135;&#20869;&#33258;&#21457;&#21457;&#29983;&#30340;&#65292;&#28982;&#21518;&#36825;&#20123;&#36164;&#20135;&#30340;&#20132;&#26131;&#20250;&#24433;&#21709;&#36739;&#19981;&#27969;&#21160;&#20294;&#30456;&#20851;&#30340;&#20135;&#21697;&#20215;&#26684;&#12290;&#35813;&#22810;&#32500;&#20215;&#26684;&#24418;&#25104;&#26426;&#21046;&#23545;&#21033;&#29575;&#24066;&#22330;&#26377;&#24433;&#21709;&#65292;&#19988;&#25361;&#25112;&#20102;&#36130;&#21153;&#32463;&#27982;&#23398;&#29702;&#35770;&#12290;</title><link>http://arxiv.org/abs/2305.16915</link><description>&lt;p&gt;
&#20132;&#21449;&#24433;&#21709;&#20309;&#26102;&#30456;&#20851;&#65311;
&lt;/p&gt;
&lt;p&gt;
When is cross impact relevant?. (arXiv:2305.16915v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.16915
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#36328;&#36234; 5 &#24180;&#30340; 500 &#31181;&#32654;&#22269;&#19978;&#24066;&#36164;&#20135;&#30340;&#27599;&#31186;&#25968;&#25454;&#65292;&#21457;&#29616;&#20215;&#26684;&#24418;&#25104;&#26159;&#22312;&#39640;&#24230;&#27969;&#21160;&#24615;&#36164;&#20135;&#20869;&#33258;&#21457;&#21457;&#29983;&#30340;&#65292;&#28982;&#21518;&#36825;&#20123;&#36164;&#20135;&#30340;&#20132;&#26131;&#20250;&#24433;&#21709;&#36739;&#19981;&#27969;&#21160;&#20294;&#30456;&#20851;&#30340;&#20135;&#21697;&#20215;&#26684;&#12290;&#35813;&#22810;&#32500;&#20215;&#26684;&#24418;&#25104;&#26426;&#21046;&#23545;&#21033;&#29575;&#24066;&#22330;&#26377;&#24433;&#21709;&#65292;&#19988;&#25361;&#25112;&#20102;&#36130;&#21153;&#32463;&#27982;&#23398;&#29702;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#31181;&#36164;&#20135;&#30340;&#20132;&#26131;&#21387;&#21147;&#21487;&#33021;&#20250;&#24433;&#21709;&#21478;&#19968;&#31181;&#36164;&#20135;&#30340;&#20215;&#26684;&#65292;&#36825;&#31181;&#29616;&#35937;&#34987;&#31216;&#20026;&#20132;&#21449;&#24433;&#21709;&#12290;&#26412;&#25991;&#20351;&#29992;&#36328;&#36234; 5 &#24180;&#30340; 500 &#31181;&#32654;&#22269;&#19978;&#24066;&#36164;&#20135;&#30340;&#27599;&#31186;&#25968;&#25454;&#65292;&#35782;&#21035;&#20102;&#20351;&#20132;&#21449;&#24433;&#21709;&#30456;&#20851;&#30340;&#29305;&#24449;&#20197;&#35299;&#37322;&#20215;&#26684;&#22238;&#25253;&#26041;&#24046;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#20215;&#26684;&#24418;&#25104;&#26159;&#22312;&#39640;&#24230;&#27969;&#21160;&#24615;&#36164;&#20135;&#20869;&#33258;&#21457;&#21457;&#29983;&#30340;&#65292;&#28982;&#21518;&#36825;&#20123;&#36164;&#20135;&#30340;&#20132;&#26131;&#20250;&#24433;&#21709;&#36739;&#19981;&#27969;&#21160;&#20294;&#30456;&#20851;&#30340;&#20135;&#21697;&#20215;&#26684;&#65292;&#20854;&#24433;&#21709;&#36895;&#24230;&#21463;&#26368;&#20302;&#20132;&#26131;&#39057;&#29575;&#30340;&#38480;&#21046;&#12290;&#26412;&#25991;&#36824;&#25506;&#31350;&#20102;&#36825;&#31181;&#22810;&#32500;&#20215;&#26684;&#24418;&#25104;&#26426;&#21046;&#23545;&#21033;&#29575;&#24066;&#22330;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616; 10 &#24180;&#26399;&#22269;&#20538;&#26399;&#36135;&#26159;&#20027;&#35201;&#30340;&#27969;&#21160;&#24615;&#20648;&#22791;&#65292;&#24433;&#21709;&#30528;&#21033;&#29575;&#26354;&#32447;&#20869;&#29616;&#38046;&#20538;&#21048;&#21644;&#26399;&#36135;&#21512;&#32422;&#30340;&#20215;&#26684;&#12290;&#36825;&#31181;&#34892;&#20026;&#25361;&#25112;&#20102;&#36130;&#21153;&#32463;&#27982;&#23398;&#29702;&#35770;&#65292;&#35813;&#29702;&#35770;&#35748;&#20026;&#38271;&#26399;&#21033;&#29575;&#26159;&#20195;&#29702;&#20154;&#23545;&#26410;&#26469;&#30701;&#26399;&#21033;&#29575;&#30340;&#39044;&#26399;&#12290;
&lt;/p&gt;
&lt;p&gt;
Trading pressure from one asset can move the price of another, a phenomenon referred to as cross impact. Using tick-by-tick data spanning 5 years for 500 assets listed in the United States, we identify the features that make cross-impact relevant to explain the variance of price returns. We show that price formation occurs endogenously within highly liquid assets. Then, trades in these assets influence the prices of less liquid correlated products, with an impact velocity constrained by their minimum trading frequency. We investigate the implications of such a multidimensional price formation mechanism on interest rate markets. We find that the 10-year bond future serves as the primary liquidity reservoir, influencing the prices of cash bonds and futures contracts within the interest rate curve. Such behaviour challenges the validity of the theory in Financial Economics that regards long-term rates as agents anticipations of future short term rates.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21160;&#24577;&#39118;&#38505;&#24230;&#37327;&#30340;&#39118;&#38505;&#20998;&#37197;&#31574;&#30053;&#65292;&#24341;&#20837;&#20102;&#21160;&#24577;&#39118;&#38505;&#36129;&#29486;&#30340;&#27010;&#24565;&#36827;&#34892;&#36882;&#24402;&#35745;&#31639;&#65292;&#35777;&#26126;&#20102;&#35813;&#38382;&#39064;&#21487;&#20197;&#34987;&#37325;&#26032;&#34920;&#36848;&#20026;&#19968;&#31995;&#21015;&#20005;&#26684;&#20984;&#30340;&#20248;&#21270;&#38382;&#39064;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#31181;&#28436;&#21592;-&#35780;&#35770;&#23478;&#26041;&#27861;&#35299;&#20915;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2305.11319</link><description>&lt;p&gt;
&#21160;&#24577;&#39118;&#38505;&#24230;&#37327;&#30340;&#39118;&#38505;&#20998;&#37197;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Risk Budgeting Allocation for Dynamic Risk Measures. (arXiv:2305.11319v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.11319
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21160;&#24577;&#39118;&#38505;&#24230;&#37327;&#30340;&#39118;&#38505;&#20998;&#37197;&#31574;&#30053;&#65292;&#24341;&#20837;&#20102;&#21160;&#24577;&#39118;&#38505;&#36129;&#29486;&#30340;&#27010;&#24565;&#36827;&#34892;&#36882;&#24402;&#35745;&#31639;&#65292;&#35777;&#26126;&#20102;&#35813;&#38382;&#39064;&#21487;&#20197;&#34987;&#37325;&#26032;&#34920;&#36848;&#20026;&#19968;&#31995;&#21015;&#20005;&#26684;&#20984;&#30340;&#20248;&#21270;&#38382;&#39064;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#31181;&#28436;&#21592;-&#35780;&#35770;&#23478;&#26041;&#27861;&#35299;&#20915;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#39118;&#38505;&#20998;&#37197;&#31574;&#30053;&#65292;&#21363;&#39118;&#38505;&#22810;&#20803;&#21270;&#32452;&#21512;&#31574;&#30053;&#65292;&#22312;&#35813;&#31574;&#30053;&#20013;&#65292;&#20351;&#29992;&#21160;&#24577;&#26102;&#19968;&#33268;&#30340;&#39118;&#38505;&#24230;&#37327;&#26469;&#34913;&#37327;&#39118;&#38505;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#21160;&#24577;&#39118;&#38505;&#36129;&#29486;&#30340;&#27010;&#24565;&#65292;&#23427;&#25512;&#24191;&#20102;&#32463;&#20856;&#30340;&#27431;&#25289;&#36129;&#29486;&#65292;&#24182;&#20801;&#35768;&#25105;&#20204;&#20197;&#36882;&#24402;&#26041;&#24335;&#33719;&#24471;&#21160;&#24577;&#39118;&#38505;&#36129;&#29486;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#65292;&#23545;&#20110;&#21160;&#24577;&#30456;&#24178;&#30072;&#21464;&#39118;&#38505;&#24230;&#37327;&#30340;&#31867;&#21035;&#65292;&#39118;&#38505;&#20998;&#37197;&#38382;&#39064;&#21487;&#20197;&#34987;&#37325;&#26032;&#34920;&#36848;&#20026;&#19968;&#31995;&#21015;&#20005;&#26684;&#20984;&#30340;&#20248;&#21270;&#38382;&#39064;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#20219;&#20309;&#33258;&#25105;&#34701;&#36164;&#30340;&#21160;&#24577;&#39118;&#38505;&#39044;&#31639;&#31574;&#30053;&#65292;&#20854;&#21021;&#22987;&#36130;&#23500;&#20026;1&#65292;&#37117;&#26159;&#19968;&#31995;&#21015;&#20984;&#20248;&#21270;&#38382;&#39064;&#21807;&#19968;&#35299;&#30340;&#32553;&#25918;&#29256;&#26412;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#24320;&#21457;&#20102;&#19968;&#31181;&#28436;&#21592;-&#35780;&#35770;&#23478;&#26041;&#27861;&#65292;&#21033;&#29992;&#21160;&#24577;&#39118;&#38505;&#24230;&#37327;&#30340;&#21487;&#28608;&#21457;&#24615;&#65292;&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#26469;&#35299;&#20915;&#39118;&#38505;&#39044;&#31639;&#31574;&#30053;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
We define and develop an approach for risk budgeting allocation -- a risk diversification portfolio strategy -- where risk is measured using a dynamic time-consistent risk measure. For this, we introduce a notion of dynamic risk contributions that generalise the classical Euler contributions and which allow us to obtain dynamic risk contributions in a recursive manner. We prove that, for the class of dynamic coherent distortion risk measures, the risk allocation problem may be recast as a sequence of strictly convex optimisation problems. Moreover, we show that any self-financing dynamic risk budgeting strategy with initial wealth of $1$ is a scaled version of the unique solution of the sequence of convex optimisation problems. Furthermore, we develop an actor-critic approach, leveraging the elicitability of dynamic risk measures, to solve for risk budgeting strategy using deep learning.
&lt;/p&gt;</description></item></channel></rss>