<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#23398;&#20064;&#19981;&#36827;&#34892;&#27450;&#39575;&#30340;&#26041;&#27861;&#65292;&#24182;&#32771;&#34385;&#20102;&#26234;&#33021;&#32929;&#31080;&#20132;&#26131;&#20195;&#29702;&#30340;&#27450;&#35784;&#34892;&#20026;&#35782;&#21035;&#21644;&#36991;&#20813;&#12290;</title><link>http://arxiv.org/abs/2306.06087</link><description>&lt;p&gt;
&#23398;&#20250;&#19981;&#36827;&#34892;&#27450;&#39575;
&lt;/p&gt;
&lt;p&gt;
Learning Not to Spoof. (arXiv:2306.06087v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.06087
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#23398;&#20064;&#19981;&#36827;&#34892;&#27450;&#39575;&#30340;&#26041;&#27861;&#65292;&#24182;&#32771;&#34385;&#20102;&#26234;&#33021;&#32929;&#31080;&#20132;&#26131;&#20195;&#29702;&#30340;&#27450;&#35784;&#34892;&#20026;&#35782;&#21035;&#21644;&#36991;&#20813;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#65288;RL&#65289;&#30340;&#26234;&#33021;&#20132;&#26131;&#20195;&#29702;&#36234;&#26469;&#36234;&#26222;&#21450;&#65292;&#30830;&#20445;RL&#20195;&#29702;&#36981;&#23432;&#27861;&#24459;&#12289;&#27861;&#35268;&#21644;&#20154;&#31867;&#34892;&#20026;&#26399;&#26395;&#21464;&#24471;&#26356;&#21152;&#37325;&#35201;&#12290;&#26412;&#25991;&#32771;&#34385;&#20102;&#19968;&#31995;&#21015;&#23454;&#39564;&#65292;&#20854;&#20013;&#26234;&#33021;&#32929;&#31080;&#20132;&#26131;&#20195;&#29702;&#26368;&#22823;&#21270;&#21033;&#28070;&#65292;&#20294;&#21487;&#33021;&#26080;&#24847;&#20013;&#23398;&#20250;&#27450;&#39575;&#20854;&#21442;&#19982;&#30340;&#24066;&#22330;&#12290;&#26412;&#25991;&#39318;&#20808;&#24341;&#20837;&#25163;&#21160;&#32534;&#30721;&#30340;&#27450;&#35784;&#20195;&#29702;&#21040;&#19968;&#20010;&#22810;&#20195;&#29702;&#24066;&#22330;&#27169;&#25311;&#20013;&#65292;&#24182;&#23398;&#20064;&#35782;&#21035;&#27450;&#35784;&#27963;&#21160;&#24207;&#21015;&#12290;&#28982;&#21518;&#65292;&#26412;&#25991;&#23558;&#25163;&#21160;&#32534;&#30721;&#30340;&#27450;&#39575;&#20132;&#26131;&#21592;&#26367;&#25442;&#20026;&#19968;&#20010;&#31616;&#21333;&#30340;&#26368;&#22823;&#21270;&#21033;&#28070;&#30340;RL&#20195;&#29702;&#65292;&#35266;&#23519;&#23427;&#26159;&#21542;&#20250;&#29420;&#31435;&#22320;&#23398;&#20064;&#27450;&#35784;&#34892;&#20026;&#65292;&#24182;&#23581;&#35797;&#36991;&#20813;&#23427;&#12290;
&lt;/p&gt;
&lt;p&gt;
As intelligent trading agents based on reinforcement learning (RL) gain prevalence, it becomes more important to ensure that RL agents obey laws, regulations, and human behavioral expectations. There is substantial literature concerning the aversion of obvious catastrophes like crashing a helicopter or bankrupting a trading account, but little around the avoidance of subtle non-normative behavior for which there are examples, but no programmable definition. Such behavior may violate legal or regulatory, rather than physical or monetary, constraints.  In this article, I consider a series of experiments in which an intelligent stock trading agent maximizes profit but may also inadvertently learn to spoof the market in which it participates. I first inject a hand-coded spoofing agent to a multi-agent market simulation and learn to recognize spoofing activity sequences. Then I replace the hand-coded spoofing trader with a simple profit-maximizing RL agent and observe that it independently 
&lt;/p&gt;</description></item><item><title>FinGPT&#26159;&#19968;&#20010;&#24320;&#28304;&#30340;&#37329;&#34701;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#25552;&#20379;&#20102;&#21487;&#35775;&#38382;&#21644;&#36879;&#26126;&#30340;&#36164;&#28304;&#26469;&#24320;&#21457;&#37329;&#34701;LLMs&#65292;&#20854;&#37325;&#35201;&#24615;&#22312;&#20110;&#33258;&#21160;&#25968;&#25454;&#31579;&#36873;&#31649;&#36947;&#21644;&#36731;&#37327;&#32423;&#20302;&#31209;&#36866;&#24212;&#25216;&#26415;&#12290;</title><link>http://arxiv.org/abs/2306.06031</link><description>&lt;p&gt;
FinGPT&#65306;&#24320;&#28304;&#37329;&#34701;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
FinGPT: Open-Source Financial Large Language Models. (arXiv:2306.06031v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.06031
&lt;/p&gt;
&lt;p&gt;
FinGPT&#26159;&#19968;&#20010;&#24320;&#28304;&#30340;&#37329;&#34701;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#25552;&#20379;&#20102;&#21487;&#35775;&#38382;&#21644;&#36879;&#26126;&#30340;&#36164;&#28304;&#26469;&#24320;&#21457;&#37329;&#34701;LLMs&#65292;&#20854;&#37325;&#35201;&#24615;&#22312;&#20110;&#33258;&#21160;&#25968;&#25454;&#31579;&#36873;&#31649;&#36947;&#21644;&#36731;&#37327;&#32423;&#20302;&#31209;&#36866;&#24212;&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#23637;&#31034;&#20102;&#22312;&#21508;&#20010;&#39046;&#22495;&#38761;&#26032;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#20219;&#21153;&#30340;&#28508;&#21147;&#65292;&#24341;&#36215;&#20102;&#37329;&#34701;&#39046;&#22495;&#30340;&#27987;&#21402;&#20852;&#36259;&#12290;&#33719;&#24471;&#39640;&#36136;&#37327;&#30340;&#37329;&#34701;&#25968;&#25454;&#26159;&#37329;&#34701;LLMs&#65288;FinLLMs&#65289;&#30340;&#31532;&#19968;&#20010;&#25361;&#25112;&#12290;&#22312;&#36825;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#38024;&#23545;&#37329;&#34701;&#39046;&#22495;&#30340;&#24320;&#28304;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;FinGPT&#12290;&#19982;&#19987;&#26377;&#27169;&#22411;&#19981;&#21516;&#65292;FinGPT&#37319;&#29992;&#25968;&#25454;&#20026;&#20013;&#24515;&#30340;&#26041;&#27861;&#65292;&#20026;&#30740;&#31350;&#20154;&#21592;&#21644;&#20174;&#19994;&#32773;&#25552;&#20379;&#21487;&#35775;&#38382;&#21644;&#36879;&#26126;&#30340;&#36164;&#28304;&#26469;&#24320;&#21457;&#20182;&#20204;&#30340;&#37329;&#34701;LLMs&#12290;&#25105;&#20204;&#24378;&#35843;&#33258;&#21160;&#25968;&#25454;&#31579;&#36873;&#31649;&#36947;&#21644;&#36731;&#37327;&#32423;&#20302;&#31209;&#36866;&#24212;&#25216;&#26415;&#22312;&#24314;&#31435;FinGPT&#20013;&#30340;&#37325;&#35201;&#24615;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#20960;&#20010;&#28508;&#22312;&#30340;&#24212;&#29992;&#20316;&#20026;&#29992;&#25143;&#30340;&#22522;&#30784;&#65292;&#22914;&#26426;&#22120;&#39038;&#38382;&#12289;&#31639;&#27861;&#20132;&#26131;&#21644;&#35770; &#12290;
&lt;/p&gt;
&lt;p&gt;
Large language models (LLMs) have shown the potential of revolutionizing natural language processing tasks in diverse domains, sparking great interest in finance. Accessing high-quality financial data is the first challenge for financial LLMs (FinLLMs). While proprietary models like BloombergGPT have taken advantage of their unique data accumulation, such privileged access calls for an open-source alternative to democratize Internet-scale financial data.  In this paper, we present an open-source large language model, FinGPT, for the finance sector. Unlike proprietary models, FinGPT takes a data-centric approach, providing researchers and practitioners with accessible and transparent resources to develop their FinLLMs. We highlight the importance of an automatic data curation pipeline and the lightweight low-rank adaptation technique in building FinGPT. Furthermore, we showcase several potential applications as stepping stones for users, such as robo-advising, algorithmic trading, and l
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#23545;&#27604;&#23398;&#20064;&#26041;&#27861;&#65292;&#26412;&#30740;&#31350;&#26500;&#24314;&#20102;&#19968;&#20010;&#33258;&#30417;&#30563;&#23398;&#20064;&#27169;&#22411;&#65292;&#29992;&#20110;&#23398;&#20064;&#20195;&#29702;&#24066;&#22330;&#35746;&#21333;&#30340;&#34920;&#31034;&#12290;&#36827;&#19968;&#27493;&#22320;&#65292;&#25105;&#20204;&#20351;&#29992;K&#22343;&#20540;&#32858;&#31867;&#31639;&#27861;&#23545;&#20195;&#29702;&#35746;&#21333;&#30340;&#23398;&#20064;&#34920;&#31034;&#21521;&#37327;&#36827;&#34892;&#32858;&#31867;&#65292;&#20197;&#30830;&#23450;&#27599;&#20010;&#31751;&#20013;&#30340;&#19981;&#21516;&#34892;&#20026;&#31867;&#22411;&#12290;</title><link>http://arxiv.org/abs/2306.05987</link><description>&lt;p&gt;
&#19968;&#31181;&#22522;&#20110;&#23545;&#27604;&#23398;&#20064;&#26041;&#27861;&#30340;&#20195;&#29702;&#24066;&#22330;&#35746;&#21333;&#34920;&#31034;
&lt;/p&gt;
&lt;p&gt;
Agent market orders representation through a contrastive learning approach. (arXiv:2306.05987v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.05987
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#23545;&#27604;&#23398;&#20064;&#26041;&#27861;&#65292;&#26412;&#30740;&#31350;&#26500;&#24314;&#20102;&#19968;&#20010;&#33258;&#30417;&#30563;&#23398;&#20064;&#27169;&#22411;&#65292;&#29992;&#20110;&#23398;&#20064;&#20195;&#29702;&#24066;&#22330;&#35746;&#21333;&#30340;&#34920;&#31034;&#12290;&#36827;&#19968;&#27493;&#22320;&#65292;&#25105;&#20204;&#20351;&#29992;K&#22343;&#20540;&#32858;&#31867;&#31639;&#27861;&#23545;&#20195;&#29702;&#35746;&#21333;&#30340;&#23398;&#20064;&#34920;&#31034;&#21521;&#37327;&#36827;&#34892;&#32858;&#31867;&#65292;&#20197;&#30830;&#23450;&#27599;&#20010;&#31751;&#20013;&#30340;&#19981;&#21516;&#34892;&#20026;&#31867;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#35775;&#38382;Euronext&#30340;CAC40&#25968;&#25454;&#20013;&#30340;&#26631;&#35760;&#35746;&#21333;&#65292;&#20998;&#26512;&#20195;&#29702;&#22312;&#24066;&#22330;&#20013;&#26681;&#25454;&#20854;&#19979;&#36798;&#30340;&#35746;&#21333;&#30340;&#34892;&#20026;&#12290;&#26412;&#30740;&#31350;&#26500;&#24314;&#20102;&#19968;&#20010;&#33258;&#30417;&#30563;&#23398;&#20064;&#27169;&#22411;&#65292;&#20351;&#29992;&#19977;&#20803;&#32452;&#25439;&#22833;&#26469;&#26377;&#25928;&#22320;&#23398;&#20064;&#20195;&#29702;&#24066;&#22330;&#35746;&#21333;&#30340;&#34920;&#31034;&#12290;&#36890;&#36807;&#33719;&#21462;&#36825;&#20010;&#23398;&#20064;&#34920;&#31034;&#65292;&#21508;&#31181;&#19979;&#28216;&#20219;&#21153;&#21464;&#24471;&#21487;&#34892;&#12290;&#26412;&#30740;&#31350;&#20351;&#29992;K&#22343;&#20540;&#32858;&#31867;&#31639;&#27861;&#23545;&#20195;&#29702;&#35746;&#21333;&#30340;&#23398;&#20064;&#34920;&#31034;&#21521;&#37327;&#36827;&#34892;&#32858;&#31867;&#65292;&#20197;&#30830;&#23450;&#27599;&#20010;&#31751;&#20013;&#30340;&#19981;&#21516;&#34892;&#20026;&#31867;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
Due to the access to the labeled orders on the CAC40 data from Euronext, we are able to analyse agents' behaviours in the market based on their placed orders. In this study, we construct a self-supervised learning model using triplet loss to effectively learn the representation of agent market orders. By acquiring this learned representation, various downstream tasks become feasible. In this work, we utilise the K-means clustering algorithm on the learned representation vectors of agent orders to identify distinct behaviour types within each cluster.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;1171&#20010;&#30495;&#23454;&#19990;&#30028;&#30340;&#25490;&#21517;&#36873;&#20030;&#25968;&#25454;&#65292;&#21457;&#29616;&#22914;&#26524;&#25130;&#36873;&#32423;&#21035;&#33267;&#23569;&#20026;&#19977;&#65292;&#21017;&#38480;&#21046;&#25237;&#31080;&#19978;&#30340;&#20505;&#36873;&#20154;&#25968;&#37327;&#24456;&#23569;&#24433;&#21709;&#36873;&#20030;&#33719;&#32988;&#32773;&#12290;</title><link>http://arxiv.org/abs/2306.05966</link><description>&lt;p&gt;
&#19968;&#39033;&#20851;&#20110;&#25130;&#36873;&#31080;&#23545;&#25490;&#21517;&#36873;&#20030;&#32467;&#26524;&#24433;&#21709;&#30340;&#23454;&#35777;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
An Empirical Analysis of the Effect of Ballot Truncation on Ranked-Choice Electoral Outcomes. (arXiv:2306.05966v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.05966
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;1171&#20010;&#30495;&#23454;&#19990;&#30028;&#30340;&#25490;&#21517;&#36873;&#20030;&#25968;&#25454;&#65292;&#21457;&#29616;&#22914;&#26524;&#25130;&#36873;&#32423;&#21035;&#33267;&#23569;&#20026;&#19977;&#65292;&#21017;&#38480;&#21046;&#25237;&#31080;&#19978;&#30340;&#20505;&#36873;&#20154;&#25968;&#37327;&#24456;&#23569;&#24433;&#21709;&#36873;&#20030;&#33719;&#32988;&#32773;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#25490;&#21517;&#36873;&#20030;&#20013;&#65292;&#36873;&#27665;&#25237;&#20986;&#20559;&#22909;&#36873;&#31080;&#65292;&#25552;&#20379;&#20505;&#36873;&#20154;&#30340;&#25490;&#21517;&#12290;&#25490;&#21517;&#36873;&#20030;&#26041;&#27861;&#36890;&#36807;&#20351;&#29992;&#36873;&#27665;&#20559;&#22909;&#26469;&#27169;&#25311;&#19968;&#31995;&#21015;&#30340;&#20915;&#32988;&#36873;&#20030;&#26469;&#36873;&#25321;&#33719;&#32988;&#32773;&#12290;&#26576;&#20123;&#20351;&#29992;&#25490;&#21517;&#36873;&#20030;&#30340;&#21496;&#27861;&#31649;&#36758;&#21306;&#38480;&#21046;&#36873;&#27665;&#22312;&#36873;&#31080;&#19978;&#25490;&#21517;&#30340;&#20505;&#36873;&#20154;&#25968;&#37327;&#65292;&#23454;&#26045;&#25105;&#20204;&#25152;&#31216;&#30340;&#25130;&#36873;&#32423;&#21035;&#65292;&#21363;&#36873;&#27665;&#34987;&#20801;&#35768;&#25490;&#21517;&#30340;&#20505;&#36873;&#20154;&#25968;&#12290;&#22312;&#22266;&#23450;&#30340;&#36873;&#27665;&#20559;&#22909;&#19979;&#65292;&#22914;&#26524;&#25105;&#20204;&#23454;&#26045;&#19981;&#21516;&#30340;&#25130;&#36873;&#32423;&#21035;&#65292;&#36873;&#20030;&#30340;&#33719;&#32988;&#32773;&#21487;&#33021;&#20250;&#25913;&#21464;&#12290;&#25105;&#20204;&#20351;&#29992;1171&#20010;&#30495;&#23454;&#19990;&#30028;&#30340;&#25490;&#21517;&#36873;&#20030;&#25968;&#25454;&#24211;&#65292;&#23454;&#35777;&#20998;&#26512;&#20102;&#22312;&#25490;&#21517;&#36873;&#20030;&#20013;&#23454;&#26045;&#19981;&#21516;&#30340;&#25130;&#36873;&#32423;&#21035;&#21487;&#33021;&#20135;&#29983;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#26222;&#36941;&#21457;&#29616;&#26159;&#65292;&#22914;&#26524;&#25130;&#36873;&#32423;&#21035;&#33267;&#23569;&#20026;&#19977;&#65292;&#21017;&#38480;&#21046;&#25237;&#31080;&#19978;&#30340;&#20505;&#36873;&#20154;&#25968;&#37327;&#24456;&#23569;&#24433;&#21709;&#36873;&#20030;&#33719;&#32988;&#32773;&#12290;
&lt;/p&gt;
&lt;p&gt;
In ranked-choice elections voters cast preference ballots which provide a voter's ranking of the candidates. The method of ranked-choice voting (RCV) chooses a winner by using voter preferences to simulate a series of runoff elections. Some jurisdictions which use RCV limit the number of candidates that voters can rank on the ballot, imposing what we term a truncation level, which is the number of candidates that voters are allowed to rank. Given fixed voter preferences, the winner of the election can change if we impose different truncation levels. We use a database of 1171 real-world ranked-choice elections to empirically analyze the potential effects of imposing different truncation levels in ranked-choice elections. Our general finding is that if the truncation level is at least three then restricting the number of candidates which can be ranked on the ballot rarely affects the election winner.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#20234;&#26391;&#22269;&#23478;&#38134;&#34892;&#21592;&#24037;&#30340;&#32844;&#19994;&#20518;&#24608;&#19982;&#23478;&#24237;&#21151;&#33021;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2306.05867</link><description>&lt;p&gt;
2015&#24180;&#20234;&#26391;&#22269;&#23478;&#38134;&#34892;&#38134;&#34892;&#23478;&#30340;&#32844;&#19994;&#20518;&#24608;&#19982;&#23478;&#24237;&#21151;&#33021;&#30340;&#20851;&#31995;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
The Relationship Between Burnout Operators with the Functions of Family Tehran Banking Melli Iran Bank in 2015. (arXiv:2306.05867v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.05867
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#20234;&#26391;&#22269;&#23478;&#38134;&#34892;&#21592;&#24037;&#30340;&#32844;&#19994;&#20518;&#24608;&#19982;&#23478;&#24237;&#21151;&#33021;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26088;&#22312;&#25506;&#35752;&#32844;&#19994;&#20518;&#24608;&#19982;&#20234;&#26391;&#22269;&#23478;&#38134;&#34892;&#21592;&#24037;&#23478;&#24237;&#21151;&#33021;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#37319;&#29992;&#36866;&#24403;&#30340;&#31185;&#23398;&#26041;&#27861;&#65292;&#36890;&#36807;&#35814;&#32454;&#30340;&#38382;&#21367;&#35843;&#26597;&#36873;&#25321;&#20102;&#35813;&#32452;&#32455;&#20013;&#30340;&#19968;&#20123;&#21592;&#24037;&#20316;&#20026;&#26679;&#26412;&#65292;&#24182;&#25910;&#38598;&#20102;&#26377;&#20851;&#32844;&#19994;&#20518;&#24608;&#21644;&#23478;&#24237;&#21151;&#33021;&#30340;&#21512;&#36866;&#25968;&#25454;&#12290;&#26679;&#26412;&#20154;&#25968;&#20026;314&#21517;&#20234;&#26391;&#22269;&#23478;&#38134;&#34892;&#36151;&#27454;&#20027;&#31649;&#65292;&#20182;&#20204;&#22312;&#38134;&#34892;&#30340;&#26381;&#21153;&#24180;&#38480;&#22343;&#36229;&#36807;5&#24180;&#65292;&#24050;&#23130;&#65292;&#30007;&#24615;&#12290;&#20351;&#29992;Maslach&#32844;&#19994;&#20518;&#24608;&#38382;&#21367;&#21644;&#23478;&#24237;&#21151;&#33021;&#38382;&#21367;&#36827;&#34892;&#25551;&#36848;&#24615;&#32479;&#35745;&#25968;&#25454;&#32479;&#35745;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;
&lt;/p&gt;
&lt;p&gt;
In this study, the relationship between burnout and family functions of the Melli Iran Bank staff will be studied. A number of employees within the organization using appropriate scientific methods as the samples were selected by detailed questionnaire and the appropriate data is collected burnout and family functions. The method used descriptive statistical population used for this study consisted of 314 bank loan officers in branches of Melli Iran Bank of Tehran province and all the officials at the bank for &gt;5 years of service at Melli Iran Bank branches in Tehran. They are married and men constitute the study population. The Maslach Burnout Inventory in the end internal to 0/90 alpha emotional exhaustion, depersonalization and low personal accomplishment Cronbach alpha of 0/79 and inventory by 0/71 within the last family to solve the problem 0/70, emotional response 0/51, touch 0/70, 0/69 affective involvement, roles, 0/59, 0/68 behavior is controlled. The results indicate that the
&lt;/p&gt;</description></item><item><title>&#26412;&#31687;&#35770;&#25991;&#20197;&#20195;&#29702;&#20154;&#27169;&#22411;&#20026;&#22522;&#30784;&#65292;&#30740;&#31350;&#20102;&#29616;&#20195;&#25903;&#20184;&#31995;&#32479;&#30340;&#36816;&#20316;&#65292;&#21457;&#29616;&#36196;&#23383;&#38134;&#34892;&#21644;&#30408;&#20313;&#38134;&#34892;&#20043;&#38388;&#30340;&#25104;&#29087;&#24230;&#38169;&#37197;&#23041;&#32961;&#20102;&#38134;&#34892;&#38388;&#24066;&#22330;&#30340;&#26377;&#25928;&#24615;&#21644;&#37329;&#34701;&#31283;&#23450;&#65292;&#21516;&#26102;&#20256;&#32479;&#36135;&#24065;&#25919;&#31574;&#30340;&#26377;&#25928;&#24615;&#20063;&#21463;&#21040;&#20102;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2306.05860</link><description>&lt;p&gt;
&#38134;&#34892;&#38388;&#20915;&#31574;&#21644;&#31283;&#23450;&#36793;&#30028;: &#19968;&#31181;&#22522;&#20110;&#20195;&#29702;&#20154;&#30340;&#32929;-&#27969;&#19968;&#33268;&#24615;&#26041;&#27861;&#30340;&#30740;&#31350;(arXiv:2306.05860v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
Interbank Decisions and Margins of Stability: an Agent-Based Stock-Flow Consistent Approach. (arXiv:2306.05860v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.05860
&lt;/p&gt;
&lt;p&gt;
&#26412;&#31687;&#35770;&#25991;&#20197;&#20195;&#29702;&#20154;&#27169;&#22411;&#20026;&#22522;&#30784;&#65292;&#30740;&#31350;&#20102;&#29616;&#20195;&#25903;&#20184;&#31995;&#32479;&#30340;&#36816;&#20316;&#65292;&#21457;&#29616;&#36196;&#23383;&#38134;&#34892;&#21644;&#30408;&#20313;&#38134;&#34892;&#20043;&#38388;&#30340;&#25104;&#29087;&#24230;&#38169;&#37197;&#23041;&#32961;&#20102;&#38134;&#34892;&#38388;&#24066;&#22330;&#30340;&#26377;&#25928;&#24615;&#21644;&#37329;&#34701;&#31283;&#23450;&#65292;&#21516;&#26102;&#20256;&#32479;&#36135;&#24065;&#25919;&#31574;&#30340;&#26377;&#25928;&#24615;&#20063;&#21463;&#21040;&#20102;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#38134;&#34892;&#25104;&#29087;&#24230;&#38169;&#37197;&#34892;&#20026;&#30340;&#35270;&#35282;&#65292;&#30740;&#31350;&#29616;&#20195;&#25903;&#20184;&#31995;&#32479;&#30340;&#36816;&#20316;&#65292;&#24182;&#25506;&#35752;&#38134;&#34892;&#25298;&#32477;&#28378;&#21160;&#30701;&#26399;&#38134;&#34892;&#38388;&#36127;&#20538;&#23545;&#37329;&#34701;&#31283;&#23450;&#30340;&#24433;&#21709;&#12290;&#22312;&#22522;&#20110;&#20195;&#29702;&#20154;&#30340;&#32929;-&#27969;&#19968;&#33268;&#24615;&#26694;&#26550;&#19979;&#65292;&#38134;&#34892;&#22312;&#20004;&#20010;&#19981;&#21516;&#25104;&#29087;&#26399;&#30340;&#38134;&#34892;&#38388;&#24066;&#22330;&#20013;&#36827;&#34892;&#20132;&#26131;&#65292;&#21363;&#38548;&#22812;&#24066;&#22330;&#21644;&#26399;&#38480;&#24066;&#22330;&#12290;&#25105;&#20204;&#27604;&#36739;&#20102;&#20004;&#31181;&#38134;&#34892;&#38388;&#21305;&#37197;&#24773;&#26223;&#65292;&#20197;&#35780;&#20272;&#20381;&#36182;&#20110;&#20928;&#31283;&#23450;&#36164;&#37329;&#27604;&#29575;&#35268;&#23450;&#30340;&#38134;&#34892;&#29305;&#23450;&#25104;&#29087;&#24230;&#30446;&#26631;&#65292;&#23545;&#38134;&#34892;&#38388;&#24066;&#22330;&#21160;&#24577;&#21644;&#20256;&#32479;&#36135;&#24065;&#25919;&#31574;&#26377;&#25928;&#24615;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#36196;&#23383;&#21644;&#30408;&#20313;&#38134;&#34892;&#20043;&#38388;&#30340;&#25104;&#29087;&#24230;&#38169;&#37197;&#25439;&#23475;&#20102;&#38134;&#34892;&#38388;&#24066;&#22330;&#30340;&#25928;&#29575;&#65292;&#24182;&#22686;&#21152;&#20102;&#23545;&#20013;&#22830;&#38134;&#34892;&#30340;&#24120;&#22791;&#25514;&#26045;&#30340;&#20381;&#36182;&#12290;&#36135;&#24065;&#25919;&#31574;&#21033;&#29575;&#35843;&#25511;&#20063;&#21464;&#24471;&#19981;&#37027;&#20040;&#26377;&#25928;&#12290;&#35813;&#30740;&#31350;&#36824;&#25581;&#31034;&#20102;&#38134;&#34892;&#19994;&#20013;&#30340;&#21452;&#37325;&#31283;&#23450;&#24615;&#37197;&#32622;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study investigates the functioning of modern payment systems through the lens of banks' maturity mismatch practices, and it examines the effects of banks' refusal to roll over short-term interbank liabilities on financial stability. Within an agent-based stock-flow consistent framework, banks can engage in two segments of the interbank market that differ in maturity, overnight and term. We compare two interbank matching scenarios to assess how bank-specific maturity targets, dependent on the dictates of the Net Stable Funding Ratio, impact the dynamics of the interbank market and the effectiveness of conventional monetary policies. The findings reveal that maturity misalignment between deficit and surplus banks compromises the interbank market's efficiency and increases reliance on the central bank's standing facilities. Monetary policy interest-rate steering practices also become less effective. The study also uncovers a dual stability-based configuration in the banking sector, r
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#23558;&#20027;&#39064;&#24314;&#27169;&#21644;&#24773;&#24863;&#20998;&#26512;&#30456;&#32467;&#21512;&#65292;&#24314;&#31435;&#20102;&#20851;&#20110;&#21152;&#23494;&#36135;&#24065;&#30340;&#22810;&#20010;&#21465;&#36848;&#65292;&#24182;&#21457;&#29616;&#36825;&#20123;&#21465;&#36848;&#19982;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#20043;&#38388;&#23384;&#22312;&#24378;&#22823;&#30340;&#32852;&#31995;&#12290;</title><link>http://arxiv.org/abs/2306.05803</link><description>&lt;p&gt;
&#24773;&#24863;&#21644;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#20043;&#38388;&#30340;&#22240;&#26524;&#20851;&#31995;
&lt;/p&gt;
&lt;p&gt;
Causality between Sentiment and Cryptocurrency Prices. (arXiv:2306.05803v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.05803
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#23558;&#20027;&#39064;&#24314;&#27169;&#21644;&#24773;&#24863;&#20998;&#26512;&#30456;&#32467;&#21512;&#65292;&#24314;&#31435;&#20102;&#20851;&#20110;&#21152;&#23494;&#36135;&#24065;&#30340;&#22810;&#20010;&#21465;&#36848;&#65292;&#24182;&#21457;&#29616;&#36825;&#20123;&#21465;&#36848;&#19982;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#20043;&#38388;&#23384;&#22312;&#24378;&#22823;&#30340;&#32852;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#24494;&#21338;&#24179;&#21488;&#65288;Twitter&#65289;&#20256;&#36882;&#30340;&#21465;&#36848;&#19982;&#21152;&#23494;&#36164;&#20135;&#20215;&#20540;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#37319;&#29992;&#20102;&#19968;&#31181;&#29420;&#29305;&#30340;&#25216;&#26415;&#65292;&#23558;&#30701;&#25991;&#26412;&#30340;&#20027;&#39064;&#24314;&#27169;&#19982;&#24773;&#24863;&#20998;&#26512;&#30456;&#32467;&#21512;&#65292;&#24314;&#31435;&#20102;&#20851;&#20110;&#21152;&#23494;&#36135;&#24065;&#30340;&#21465;&#36848;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;&#19968;&#31181;&#26080;&#30417;&#30563;&#30340;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#65292;&#20174;Twitter&#30340;&#22823;&#35268;&#27169;&#21644;&#22024;&#26434;&#25991;&#26412;&#25968;&#25454;&#20013;&#21457;&#29616;&#28508;&#22312;&#20027;&#39064;&#65292;&#28982;&#21518;&#25105;&#20204;&#25581;&#31034;&#20102;4-5&#20010;&#19982;&#21152;&#23494;&#36135;&#24065;&#30456;&#20851;&#30340;&#21465;&#36848;&#65292;&#21253;&#25324;&#19982;&#21152;&#23494;&#36135;&#24065;&#30456;&#20851;&#30340;&#37329;&#34701;&#25237;&#36164;&#12289;&#25216;&#26415;&#36827;&#27493;&#12289;&#37329;&#34701;&#21644;&#25919;&#27835;&#30417;&#31649;&#12289;&#21152;&#23494;&#36164;&#20135;&#21644;&#23186;&#20307;&#25253;&#36947;&#12290;&#22312;&#35768;&#22810;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#27880;&#24847;&#21040;&#25105;&#20204;&#30340;&#21465;&#36848;&#19982;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#20043;&#38388;&#23384;&#22312;&#24378;&#22823;&#30340;&#32852;&#31995;&#12290;&#25105;&#20204;&#30340;&#24037;&#20316;&#23558;&#26368;&#26032;&#30340;&#32463;&#27982;&#23398;&#21019;&#26032;&#8212;&#8212;&#21465;&#20107;&#32463;&#27982;&#23398;&#19982;&#20027;&#39064;&#24314;&#27169;&#21644;&#24773;&#24863;&#20998;&#26512;&#30456;&#32467;&#21512;&#30340;&#26032;&#39046;&#22495;&#32852;&#31995;&#36215;&#26469;&#65292;&#20197;&#20851;&#32852;&#28040;&#36153;&#32773;&#34892;&#20026;&#21644;&#21465;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study investigates the relationship between narratives conveyed through microblogging platforms, namely Twitter, and the value of crypto assets. Our study provides a unique technique to build narratives about cryptocurrency by combining topic modelling of short texts with sentiment analysis. First, we used an unsupervised machine learning algorithm to discover the latent topics within the massive and noisy textual data from Twitter, and then we revealed 4-5 cryptocurrency-related narratives, including financial investment, technological advancement related to crypto, financial and political regulations, crypto assets, and media coverage. In a number of situations, we noticed a strong link between our narratives and crypto prices. Our work connects the most recent innovation in economics, Narrative Economics, to a new area of study that combines topic modelling and sentiment analysis to relate consumer behaviour to narratives.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#31350;&#20102;&#31354;&#34989;&#23545;20&#19990;&#32426;&#26085;&#26412;&#29983;&#32946;&#29575;&#30340;&#28145;&#36828;&#24433;&#21709;&#65292;&#24182;&#35777;&#26126;&#20102;&#25112;&#20105;&#30772;&#22351;&#30340;&#21306;&#22495;&#24433;&#21709;&#21363;&#20351;&#22312;&#26410;&#30452;&#25509;&#21463;&#24433;&#21709;&#30340;&#22320;&#21306;&#20063;&#23384;&#22312;&#12290;</title><link>http://arxiv.org/abs/2306.05770</link><description>&lt;p&gt;
&#20108;&#25112;&#26399;&#38388;&#36720;&#28856;&#23545;20&#19990;&#32426;&#26085;&#26412;&#29983;&#32946;&#29575;&#30340;&#28145;&#36828;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The far-reaching effects of bombing on fertility in mid-20th century Japan. (arXiv:2306.05770v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.05770
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#31350;&#20102;&#31354;&#34989;&#23545;20&#19990;&#32426;&#26085;&#26412;&#29983;&#32946;&#29575;&#30340;&#28145;&#36828;&#24433;&#21709;&#65292;&#24182;&#35777;&#26126;&#20102;&#25112;&#20105;&#30772;&#22351;&#30340;&#21306;&#22495;&#24433;&#21709;&#21363;&#20351;&#22312;&#26410;&#30452;&#25509;&#21463;&#24433;&#21709;&#30340;&#22320;&#21306;&#20063;&#23384;&#22312;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25112;&#20105;&#21644;&#20914;&#31361;&#20043;&#21518;&#30340;&#29983;&#32946;&#21464;&#21270;&#22312;&#20840;&#29699;&#33539;&#22260;&#20869;&#24471;&#21040;&#20102;&#35266;&#23519;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#30740;&#31350;&#21306;&#22495;&#25112;&#20105;&#30772;&#22351;&#26159;&#21542;&#20250;&#24433;&#21709;&#25112;&#21518;&#29983;&#32946;&#65292;&#21363;&#20351;&#26159;&#26410;&#30452;&#25509;&#21463;&#21040;&#24433;&#21709;&#20294;&#38752;&#36817;&#21463;&#25439;&#22320;&#21306;&#30340;&#22320;&#21306;&#12290;&#20026;&#20102;&#36798;&#21040;&#36825;&#20010;&#30446;&#30340;&#65292;&#25105;&#20204;&#21033;&#29992;&#20102;&#26085;&#26412;&#20108;&#25112;&#26399;&#38388;&#30340;&#31354;&#34989;&#32463;&#21382;&#12290;&#21033;&#29992;1935&#24180;&#21644;1947&#24180;&#36817;&#30079;&#22320;&#21306;&#30340;&#24066;&#30010;&#26449;&#32423;&#21035;&#29983;&#32946;&#25968;&#25454;&#20197;&#21450;&#22478;&#24066;&#31354;&#34989;&#25439;&#22833;&#25968;&#25454;&#65292;&#25105;&#20204;&#21457;&#29616;&#36720;&#28856;&#23545;&#20110;15&#20844;&#37324;&#20869;&#22478;&#38215;&#21644;&#20065;&#26449;&#30340;&#25112;&#21518;&#29983;&#32946;&#29575;&#23384;&#22312;&#24433;&#21709;&#65292;&#23613;&#31649;&#36825;&#20123;&#22320;&#21306;&#26410;&#30452;&#25509;&#21463;&#21040;&#25439;&#23475;&#12290;&#28982;&#32780;&#65292;&#38388;&#25509;&#24433;&#21709;&#30340;&#26041;&#21521;&#26159;&#28151;&#21512;&#30340;&#12290;&#20272;&#35745;&#32467;&#26524;&#34920;&#26126;&#65292;&#37051;&#36817;&#22478;&#24066;&#30340;&#20005;&#37325;&#31354;&#34989;&#22686;&#21152;&#20102;&#29983;&#32946;&#29575;&#65292;&#32780;&#36739;&#36731;&#30340;&#31354;&#34989;&#21017;&#38477;&#20302;&#20102;&#29983;&#32946;&#29575;&#12290;&#27492;&#22806;&#65292;&#25311;&#23454;&#39564;&#27861;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#20005;&#37325;&#30340;&#31354;&#34989;&#24656;&#24807;&#22312;&#25112;&#21518;&#26399;&#38388;&#22686;&#21152;&#20102;&#29983;&#32946;&#29575;&#12290;&#26412;&#30740;&#31350;&#20026;&#25112;&#21518;&#29983;&#32946;&#21464;&#21270;&#30340;&#25991;&#29486;&#25552;&#20379;&#20102;&#35777;&#25454;&#65292;&#21363;&#36720;&#28856;&#23545;&#20110;&#29983;&#32946;&#29575;&#26377;&#28145;&#36828;&#24433;&#21709;&#65292;&#21363;&#20351;&#26159;&#34987;&#25112;&#20105;&#25439;&#23475;&#38388;&#25509;&#24433;&#21709;&#30340;&#22320;&#21306;&#12290;
&lt;/p&gt;
&lt;p&gt;
Fertility changes after wars and conflicts have been observed worldwide. This study examines whether regional war damage affects postwar fertility even in areas that were not directly affected but were close to the damaged areas. In order to accomplish this, we exploit the air-raid experience in Japan during World War II. Using the municipality-level fertility data in the Kinki region in 1935 and 1947 and the data on damages from air raids in cities, we find the effects of bombing on postwar fertility in towns and villages within 15 kilometers, despite no direct damages. However, the direction of the indirect effects is mixed. The estimation results suggest that severe air raids in neighboring cities increased fertility, whereas minor air raids decreased it. Moreover, the results of the quasi-experimental approach indicate that intense fears of air raids increased the fertility rate in the postwar period. Our study contributes to the literature on fertility changes in the postwar perio
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#22522;&#20110;&#27979;&#24230;&#21464;&#25442;&#25552;&#20986;&#20004;&#31181;&#27169;&#25311;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;Barndorff-Nielsen&#21644;Shephard&#27169;&#22411;&#19979;&#20855;&#26377;&#26080;&#38480;&#31215;&#26497;&#36339;&#36291;&#20294;&#38750;&#38789;&#24773;&#20917;&#19979;&#35745;&#31639;&#26399;&#26435;&#20215;&#26684;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2306.05750</link><description>&lt;p&gt;
Barndorff-Nielsen&#21644;Shephard&#27169;&#22411;&#22312;&#27979;&#24230;&#21464;&#25442;&#19979;&#30340;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;
&lt;/p&gt;
&lt;p&gt;
Monte Carlo simulation for Barndorff-Nielsen and Shephard model under change of measure. (arXiv:2306.05750v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.05750
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22522;&#20110;&#27979;&#24230;&#21464;&#25442;&#25552;&#20986;&#20004;&#31181;&#27169;&#25311;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;Barndorff-Nielsen&#21644;Shephard&#27169;&#22411;&#19979;&#20855;&#26377;&#26080;&#38480;&#31215;&#26497;&#36339;&#36291;&#20294;&#38750;&#38789;&#24773;&#20917;&#19979;&#35745;&#31639;&#26399;&#26435;&#20215;&#26684;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Barndorff-Nielsen&#21644;Shephard&#27169;&#22411;&#26159;&#20195;&#34920;&#24615;&#30340;&#36339;&#36291;&#22411;&#38543;&#26426;&#27874;&#21160;&#29575;&#27169;&#22411;&#12290;&#28982;&#32780;&#65292;&#22312;&#20855;&#26377;&#26080;&#38480;&#31215;&#26497;&#36339;&#36291;&#20294;&#38750;&#38789;&#24773;&#20917;&#19979;&#65292;&#23578;&#26080;&#26041;&#27861;&#35745;&#31639;&#26399;&#26435;&#20215;&#26684;&#12290;&#26412;&#25991;&#38024;&#23545;&#35813;&#24773;&#20917;&#65292;&#22522;&#20110;&#27979;&#24230;&#21464;&#25442;&#24320;&#21457;&#20102;&#20004;&#31181;&#27169;&#25311;&#26041;&#27861;&#65292;&#24182;&#36827;&#34892;&#20102;&#19968;&#20123;&#25968;&#20540;&#23454;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Barndorff-Nielsen and Shephard model is a representative jump-type stochastic volatility model. Still, no method exists to compute option prices numerically for the non-martingale case with infinite active jumps. We develop two simulation methods for such a case under change of measure and conduct some numerical experiments.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807; MACE &#31639;&#27861;&#65292;&#20197;&#38543;&#26426;&#26862;&#26519;&#21644;&#21463;&#38480;&#23725;&#22238;&#24402;&#20248;&#21270;&#32452;&#21512;&#26435;&#37325;&#65292;&#23454;&#29616;&#20102;&#26368;&#22823;&#31243;&#24230;&#30340;&#21487;&#39044;&#27979;&#24615;&#21644;&#30408;&#21033;&#33021;&#21147;&#65292;&#36866;&#29992;&#20110;&#20219;&#20309;&#39044;&#27979;&#31639;&#27861;&#21644;&#39044;&#27979;&#22120;&#38598;&#65292;&#21487;&#20197;&#22788;&#29702;&#22823;&#22411;&#32452;&#21512;&#12290;</title><link>http://arxiv.org/abs/2306.05568</link><description>&lt;p&gt;
&#26368;&#22823;&#26426;&#22120;&#23398;&#20064;&#32452;&#21512;&#30340;&#26500;&#24314;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Maximally Machine-Learnable Portfolios. (arXiv:2306.05568v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.05568
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807; MACE &#31639;&#27861;&#65292;&#20197;&#38543;&#26426;&#26862;&#26519;&#21644;&#21463;&#38480;&#23725;&#22238;&#24402;&#20248;&#21270;&#32452;&#21512;&#26435;&#37325;&#65292;&#23454;&#29616;&#20102;&#26368;&#22823;&#31243;&#24230;&#30340;&#21487;&#39044;&#27979;&#24615;&#21644;&#30408;&#21033;&#33021;&#21147;&#65292;&#36866;&#29992;&#20110;&#20219;&#20309;&#39044;&#27979;&#31639;&#27861;&#21644;&#39044;&#27979;&#22120;&#38598;&#65292;&#21487;&#20197;&#22788;&#29702;&#22823;&#22411;&#32452;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#32929;&#31080;&#22238;&#25253;&#65292;&#20219;&#20309;&#24418;&#24335;&#30340;&#21487;&#39044;&#27979;&#24615;&#37117;&#21487;&#20197;&#22686;&#24378;&#35843;&#25972;&#39118;&#38505;&#21518;&#30340;&#30408;&#21033;&#33021;&#21147;&#12290;&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#21327;&#20316;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#65292;&#20248;&#21270;&#32452;&#21512;&#26435;&#37325;&#65292;&#20197;&#20351;&#24471;&#21512;&#25104;&#35777;&#21048;&#26368;&#22823;&#31243;&#24230;&#30340;&#21487;&#39044;&#27979;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;MACE&#65292;Alternating Conditional Expectations&#30340;&#22810;&#20803;&#25193;&#23637;&#65292;&#36890;&#36807;&#22312;&#26041;&#31243;&#30340;&#19968;&#20391;&#20351;&#29992;&#38543;&#26426;&#26862;&#26519;&#21644;&#21463;&#38480;&#23725;&#22238;&#24402;&#22312;&#21478;&#19968;&#20391;&#23454;&#29616;&#20102;&#19978;&#36848;&#30446;&#26631;&#12290;&#30456;&#36739;&#20110;Lo&#21644;MacKinlay&#30340;&#26368;&#22823;&#21487;&#39044;&#27979;&#32452;&#21512;&#26041;&#27861;&#65292;&#26412;&#25991;&#26377;&#20004;&#20010;&#20851;&#38190;&#25913;&#36827;&#12290;&#31532;&#19968;&#65292;&#23427;&#36866;&#29992;&#20110;&#20219;&#20309;&#65288;&#38750;&#32447;&#24615;&#65289;&#39044;&#27979;&#31639;&#27861;&#21644;&#39044;&#27979;&#22120;&#38598;&#12290;&#31532;&#20108;&#65292;&#23427;&#21487;&#20197;&#22788;&#29702;&#22823;&#22411;&#32452;&#21512;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#26085;&#39057;&#21644;&#26376;&#39057;&#30340;&#23454;&#39564;&#65292;&#24182;&#21457;&#29616;&#22312;&#20351;&#29992;&#24456;&#23569;&#30340;&#26465;&#20214;&#20449;&#24687;&#26102;&#65292;&#21487;&#39044;&#27979;&#24615;&#21644;&#30408;&#21033;&#33021;&#21147;&#26174;&#33879;&#22686;&#21152;&#12290;&#26377;&#36259;&#30340;&#26159;&#65292;&#21487;&#39044;&#27979;&#24615;&#22312;&#22909;&#26102;&#21644;&#22351;&#26102;&#37117;&#23384;&#22312;&#65292;&#24182;&#19988;MACE&#25104;&#21151;&#22320;&#23548;&#33322;&#20102;&#20004;&#32773;&#12290;
&lt;/p&gt;
&lt;p&gt;
When it comes to stock returns, any form of predictability can bolster risk-adjusted profitability. We develop a collaborative machine learning algorithm that optimizes portfolio weights so that the resulting synthetic security is maximally predictable. Precisely, we introduce MACE, a multivariate extension of Alternating Conditional Expectations that achieves the aforementioned goal by wielding a Random Forest on one side of the equation, and a constrained Ridge Regression on the other. There are two key improvements with respect to Lo and MacKinlay's original maximally predictable portfolio approach. First, it accommodates for any (nonlinear) forecasting algorithm and predictor set. Second, it handles large portfolios. We conduct exercises at the daily and monthly frequency and report significant increases in predictability and profitability using very little conditioning information. Interestingly, predictability is found in bad as well as good times, and MACE successfully navigates
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#29983;&#23384;&#20998;&#26512;&#26041;&#27861;&#65292;&#20351;&#29992;&#21367;&#31215;-Transformer&#20272;&#35745;&#38480;&#20215;&#35746;&#21333;&#31807;&#20013;&#25918;&#32622;&#20110;&#19981;&#21516;&#23618;&#32423;&#30340;&#38480;&#20215;&#35746;&#21333;&#30340;&#25104;&#20132;&#26102;&#38388;&#20998;&#24067;&#65292;&#30456;&#27604;&#20854;&#20182;&#26041;&#27861;&#34920;&#29616;&#26174;&#33879;&#20248;&#36234;&#12290;</title><link>http://arxiv.org/abs/2306.05479</link><description>&lt;p&gt;
&#28145;&#24230;&#20851;&#27880;&#29983;&#23384;&#20998;&#26512;&#22312;&#38480;&#20215;&#35746;&#21333;&#19978;&#30340;&#24212;&#29992;&#65306;&#21033;&#29992;&#21367;&#31215;-Transformer&#20272;&#35745;&#25104;&#20132;&#27010;&#29575;(arXiv:2306.05479v1[q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
Deep Attentive Survival Analysis in Limit Order Books: Estimating Fill Probabilities with Convolutional-Transformers. (arXiv:2306.05479v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.05479
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#29983;&#23384;&#20998;&#26512;&#26041;&#27861;&#65292;&#20351;&#29992;&#21367;&#31215;-Transformer&#20272;&#35745;&#38480;&#20215;&#35746;&#21333;&#31807;&#20013;&#25918;&#32622;&#20110;&#19981;&#21516;&#23618;&#32423;&#30340;&#38480;&#20215;&#35746;&#21333;&#30340;&#25104;&#20132;&#26102;&#38388;&#20998;&#24067;&#65292;&#30456;&#27604;&#20854;&#20182;&#26041;&#27861;&#34920;&#29616;&#26174;&#33879;&#20248;&#36234;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25191;&#34892;&#31574;&#30053;&#20013;&#30340;&#20851;&#38190;&#20915;&#23450;&#20043;&#19968;&#26159;&#36873;&#25321;&#34987;&#21160;&#65288;&#25552;&#20379;&#27969;&#21160;&#24615;&#65289;&#25110;&#31215;&#26497;&#65288;&#21560;&#32435;&#27969;&#21160;&#24615;&#65289;&#35746;&#21333;&#20197;&#22312;&#38480;&#20215;&#35746;&#21333;&#31807;&#20013;&#25191;&#34892;&#20132;&#26131;&#12290;&#36825;&#21462;&#20915;&#20110;&#25918;&#32622;&#20110;&#38480;&#20215;&#35746;&#21333;&#31807;&#20013;&#30340;&#34987;&#21160;&#38480;&#20215;&#35746;&#21333;&#25104;&#20132;&#27010;&#29575;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#26469;&#20272;&#35745;&#25918;&#32622;&#20110;&#38480;&#20215;&#35746;&#21333;&#31807;&#20013;&#19981;&#21516;&#23618;&#32423;&#30340;&#38480;&#20215;&#35746;&#21333;&#30340;&#25104;&#20132;&#26102;&#38388;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#29983;&#23384;&#20998;&#26512;&#27169;&#22411;&#65292;&#23558;&#38480;&#20215;&#35746;&#21333;&#30340;&#26102;&#21464;&#29305;&#24449;&#26144;&#23556;&#20026;&#20854;&#25104;&#20132;&#26102;&#38388;&#30340;&#20998;&#24067;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22522;&#20110;&#21367;&#31215;-Transformer&#32534;&#30721;&#22120;&#21644;&#21333;&#35843;&#31070;&#32463;&#32593;&#32476;&#35299;&#30721;&#22120;&#12290;&#25105;&#20204;&#20351;&#29992;&#36866;&#24403;&#30340;&#35780;&#20998;&#35268;&#21017;&#26469;&#27604;&#36739;&#25105;&#20204;&#30340;&#26041;&#27861;&#19982;&#29983;&#23384;&#20998;&#26512;&#20013;&#30340;&#20854;&#20182;&#26041;&#27861;&#65292;&#24182;&#36827;&#34892;&#21487;&#35299;&#37322;&#24615;&#20998;&#26512;&#20197;&#20102;&#35299;&#29992;&#20110;&#35745;&#31639;&#25104;&#20132;&#27010;&#29575;&#30340;&#29305;&#24449;&#30340;&#20449;&#24687;&#37327;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#29983;&#23384;&#20998;&#26512;&#25991;&#29486;&#20013;&#26174;&#33879;&#20248;&#20110;&#36890;&#24120;&#20351;&#29992;&#30340;&#26041;&#27861;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#32479;&#35745;&#20998;&#26512;&#8230;&#8230;&#65288;&#26410;&#23436;&#25972;&#32763;&#35793;&#65289;
&lt;/p&gt;
&lt;p&gt;
One of the key decisions in execution strategies is the choice between a passive (liquidity providing) or an aggressive (liquidity taking) order to execute a trade in a limit order book (LOB). Essential to this choice is the fill probability of a passive limit order placed in the LOB. This paper proposes a deep learning method to estimate the filltimes of limit orders posted in different levels of the LOB. We develop a novel model for survival analysis that maps time-varying features of the LOB to the distribution of filltimes of limit orders. Our method is based on a convolutional-Transformer encoder and a monotonic neural network decoder. We use proper scoring rules to compare our method with other approaches in survival analysis, and perform an interpretability analysis to understand the informativeness of features used to compute fill probabilities. Our method significantly outperforms those typically used in survival analysis literature. Finally, we carry out a statistical analysi
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#26126;&#30830;&#25512;&#23548;&#20986;&#24102;&#26377;&#24179;&#22343;&#22330;&#30456;&#20114;&#20316;&#29992;&#30340;&#21151;&#33021;&#38543;&#26426;&#21338;&#24328;&#30340;&#32435;&#20160;&#22343;&#34913;&#65292;&#21516;&#26102;&#35777;&#26126;&#20102;&#22343;&#34913;&#30340;&#25910;&#25947;&#24615;&#21644;&#23384;&#22312;&#30340;&#26465;&#20214;&#27604;&#26377;&#38480;&#29609;&#23478;&#21338;&#24328;&#30340;&#26465;&#20214;&#26356;&#23569;&#12290;</title><link>http://arxiv.org/abs/2306.05433</link><description>&lt;p&gt;
&#24102;&#26377;&#24179;&#22343;&#22330;&#30456;&#20114;&#20316;&#29992;&#30340;&#21151;&#33021;&#38543;&#26426;&#21338;&#24328;&#30340;&#22343;&#34913;
&lt;/p&gt;
&lt;p&gt;
Equilibrium in Functional Stochastic Games with Mean-Field Interaction. (arXiv:2306.05433v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.05433
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#26126;&#30830;&#25512;&#23548;&#20986;&#24102;&#26377;&#24179;&#22343;&#22330;&#30456;&#20114;&#20316;&#29992;&#30340;&#21151;&#33021;&#38543;&#26426;&#21338;&#24328;&#30340;&#32435;&#20160;&#22343;&#34913;&#65292;&#21516;&#26102;&#35777;&#26126;&#20102;&#22343;&#34913;&#30340;&#25910;&#25947;&#24615;&#21644;&#23384;&#22312;&#30340;&#26465;&#20214;&#27604;&#26377;&#38480;&#29609;&#23478;&#21338;&#24328;&#30340;&#26465;&#20214;&#26356;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#19968;&#33324;&#30340;&#26377;&#38480;&#29609;&#23478;&#24102;&#26377;&#24179;&#22343;&#22330;&#30456;&#20114;&#20316;&#29992;&#30340;&#38543;&#26426;&#21338;&#24328;&#65292;&#20854;&#20013;&#32447;&#24615;&#20108;&#27425;&#25104;&#26412;&#20989;&#25968;&#21253;&#25324;&#20316;&#29992;&#20110;$L^2$&#20013;&#30340;&#25511;&#21046;&#30340;&#32447;&#24615;&#31639;&#23376;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#30456;&#20851;&#30340;&#19968;&#38454;&#26465;&#20214;&#20943;&#23569;&#21040;&#31532;&#20108;&#31867;&#38543;&#26426;Fredholm&#26041;&#31243;&#32452;&#30340;&#31995;&#32479;&#65292;&#24182;&#25512;&#23548;&#20986;&#23427;&#20204;&#30340;&#38381;&#24418;&#24335;&#35299;&#26469;&#26126;&#30830;&#25512;&#23548;&#20986;&#20102;&#21338;&#24328;&#30340;&#32435;&#20160;&#22343;&#34913;&#12290;&#27492;&#22806;&#65292;&#36890;&#36807;&#35777;&#26126;&#38543;&#26426;Fredholm&#26041;&#31243;&#32452;&#30340;&#31283;&#23450;&#24615;&#32467;&#26524;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#20102;$N$&#20154;&#21338;&#24328;&#30340;&#22343;&#34913;&#25910;&#25947;&#21040;&#30456;&#24212;&#30340;&#24179;&#22343;&#22330;&#22343;&#34913;&#12290;&#20316;&#20026;&#19968;&#20010;&#21103;&#20135;&#21697;&#65292;&#25105;&#20204;&#36824;&#25512;&#23548;&#20986;&#20102;&#24179;&#22343;&#22330;&#21338;&#24328;&#30340;$\varepsilon$-&#32435;&#20160;&#22343;&#34913;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#23427;&#20855;&#26377;&#20215;&#20540;&#65292;&#22240;&#20026;&#25105;&#20204;&#34920;&#26126;&#65292;&#22312;&#24179;&#22343;&#22330;&#26497;&#38480;&#23384;&#22312;&#22343;&#34913;&#30340;&#26465;&#20214;&#27604;&#26377;&#38480;&#29609;&#23478;&#21338;&#24328;&#30340;&#26465;&#20214;&#35201;&#23569;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#19968;&#33324;&#26694;&#26550;&#24212;&#29992;&#20110;&#35299;&#20915;&#21508;&#31181;&#20363;&#23376;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider a general class of finite-player stochastic games with mean-field interaction, in which the linear-quadratic cost functional includes linear operators acting on controls in $L^2$. We propose a novel approach for deriving the Nash equilibrium of the game explicitly in terms of operator resolvents, by reducing the associated first order conditions to a system of stochastic Fredholm equations of the second kind and deriving their closed form solution. Furthermore, by proving stability results for the system of stochastic Fredholm equations we derive the convergence of the equilibrium of the $N$-player game to the corresponding mean-field equilibrium. As a by-product we also derive an $\varepsilon$-Nash equilibrium for the mean-field game, which is valuable in this setting as we show that the conditions for existence of an equilibrium in the mean-field limit are less restrictive than in the finite-player game. Finally we apply our general framework to solve various examples, su
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21327;&#35843;&#26041;&#27861;&#26469;&#25552;&#39640;&#32858;&#21512;&#26354;&#32447;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#65292;&#24182;&#22312;&#24503;&#22269;&#26085;&#21069;&#30005;&#21147;&#31454;&#25293;&#24066;&#22330;&#36827;&#34892;&#20102;&#23454;&#35777;&#30740;&#31350;&#12290;</title><link>http://arxiv.org/abs/2305.16255</link><description>&lt;p&gt;
&#23618;&#27425;&#39044;&#27979;&#32858;&#21512;&#26354;&#32447;&#24182;&#24212;&#29992;&#20110;&#26085;&#21069;&#30005;&#21147;&#31454;&#25293;
&lt;/p&gt;
&lt;p&gt;
Hierarchical forecasting for aggregated curves with an application to day-ahead electricity price auctions. (arXiv:2305.16255v1 [stat.AP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.16255
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21327;&#35843;&#26041;&#27861;&#26469;&#25552;&#39640;&#32858;&#21512;&#26354;&#32447;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#65292;&#24182;&#22312;&#24503;&#22269;&#26085;&#21069;&#30005;&#21147;&#31454;&#25293;&#24066;&#22330;&#36827;&#34892;&#20102;&#23454;&#35777;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32858;&#21512;&#26354;&#32447;&#22312;&#32463;&#27982;&#21644;&#37329;&#34701;&#20013;&#24456;&#24120;&#35265;&#65292;&#26368;&#31361;&#20986;&#30340;&#20363;&#23376;&#26159;&#20379;&#32473;&#21644;&#38656;&#27714;&#26354;&#32447;&#12290;&#25105;&#20204;&#21457;&#29616;&#25152;&#26377;&#32858;&#21512;&#26354;&#32447;&#37117;&#20855;&#26377;&#20869;&#22312;&#30340;&#23618;&#27425;&#32467;&#26500;&#65292;&#22240;&#27492;&#21487;&#20197;&#20351;&#29992;&#23618;&#27425;&#21327;&#35843;&#26041;&#27861;&#26469;&#25552;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#32858;&#21512;&#26354;&#32447;&#22914;&#20309;&#26500;&#24314;&#25110;&#35299;&#26500;&#30340;&#28145;&#20837;&#29702;&#35770;&#65292;&#24182;&#24471;&#20986;&#36825;&#20123;&#26041;&#27861;&#22312;&#24369;&#20551;&#35774;&#19979;&#26159;&#31561;&#25928;&#30340;&#32467;&#35770;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#22810;&#31181;&#32858;&#21512;&#26354;&#32447;&#30340;&#21327;&#35843;&#26041;&#27861;&#65292;&#21253;&#25324;&#24050;&#32463;&#24314;&#31435;&#30340;&#33258;&#19979;&#32780;&#19978;&#12289;&#33258;&#19978;&#32780;&#19979;&#21644;&#32447;&#24615;&#26368;&#20248;&#21327;&#35843;&#26041;&#27861;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22522;&#20934;&#21327;&#35843;&#26041;&#27861;&#65292;&#31216;&#20026;&#8220;&#32858;&#21512;-&#19979;&#8221;&#65292;&#20854;&#22797;&#26434;&#24230;&#31867;&#20284;&#20110;&#33258;&#19979;&#32780;&#19978;&#21644;&#33258;&#19978;&#32780;&#19979;&#26041;&#27861;&#65292;&#20294;&#22312;&#36825;&#31181;&#35774;&#32622;&#20013;&#24448;&#24448;&#25552;&#20379;&#26356;&#22909;&#30340;&#20934;&#30830;&#24615;&#12290;&#25105;&#20204;&#23545;&#24503;&#22269;&#26085;&#21069;&#30005;&#21147;&#31454;&#25293;&#24066;&#22330;&#36827;&#34892;&#20102;&#23454;&#35777;&#39044;&#27979;&#30740;&#31350;&#65292;&#39044;&#27979;&#20102;&#38656;&#27714;&#21644;&#20379;&#32473;&#26354;&#32447;&#65292;&#24182;&#23545;&#20854;&#22343;&#34913;&#24615;&#36827;&#34892;&#20102;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
Aggregated curves are common structures in economics and finance, and the most prominent examples are supply and demand curves. In this study, we exploit the fact that all aggregated curves have an intrinsic hierarchical structure, and thus hierarchical reconciliation methods can be used to improve the forecast accuracy. We provide an in-depth theory on how aggregated curves can be constructed or deconstructed, and conclude that these methods are equivalent under weak assumptions. We consider multiple reconciliation methods for aggregated curves, including previously established bottom-up, top-down, and linear optimal reconciliation approaches. We also present a new benchmark reconciliation method called 'aggregated-down' with similar complexity to bottom-up and top-down approaches, but it tends to provide better accuracy in this setup. We conducted an empirical forecasting study on the German day-ahead power auction market by predicting the demand and supply curves, where their equili
&lt;/p&gt;</description></item><item><title>&#20171;&#32461;&#20102;&#29992;&#20110;&#27431;&#24335;&#26399;&#26435;&#23450;&#20215;&#30340; Fourier&#20313;&#24358;&#23637;&#24320; (COS) &#26041;&#27861;&#65292;&#36890;&#36807;&#25351;&#23450;&#25130;&#26029;&#33539;&#22260;&#21644;&#39033;&#25968;N&#36827;&#34892;&#36924;&#36817;&#65292;&#25991;&#31456;&#25552;&#20986;&#26126;&#30830;&#30340;N&#30340;&#19978;&#30028;&#65292;&#23545;&#23494;&#24230;&#24179;&#28369;&#24182;&#25351;&#25968;&#34928;&#20943;&#30340;&#24773;&#20917;&#65292;COS&#26041;&#27861;&#30340;&#25910;&#25947;&#38454;&#25968;&#33267;&#23569;&#26159;&#25351;&#25968;&#25910;&#25947;&#38454;&#25968;&#12290;</title><link>http://arxiv.org/abs/2303.16012</link><description>&lt;p&gt;
&#22914;&#20309;&#22788;&#29702;&#29992;&#20110;&#26399;&#26435;&#23450;&#20215;&#30340; COS &#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
How to handle the COS method for option pricing. (arXiv:2303.16012v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.16012
&lt;/p&gt;
&lt;p&gt;
&#20171;&#32461;&#20102;&#29992;&#20110;&#27431;&#24335;&#26399;&#26435;&#23450;&#20215;&#30340; Fourier&#20313;&#24358;&#23637;&#24320; (COS) &#26041;&#27861;&#65292;&#36890;&#36807;&#25351;&#23450;&#25130;&#26029;&#33539;&#22260;&#21644;&#39033;&#25968;N&#36827;&#34892;&#36924;&#36817;&#65292;&#25991;&#31456;&#25552;&#20986;&#26126;&#30830;&#30340;N&#30340;&#19978;&#30028;&#65292;&#23545;&#23494;&#24230;&#24179;&#28369;&#24182;&#25351;&#25968;&#34928;&#20943;&#30340;&#24773;&#20917;&#65292;COS&#26041;&#27861;&#30340;&#25910;&#25947;&#38454;&#25968;&#33267;&#23569;&#26159;&#25351;&#25968;&#25910;&#25947;&#38454;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Fourier&#20313;&#24358;&#23637;&#24320;&#65288;COS&#65289;&#26041;&#27861;&#29992;&#20110;&#39640;&#25928;&#22320;&#35745;&#31639;&#27431;&#24335;&#26399;&#26435;&#20215;&#26684;&#12290;&#35201;&#24212;&#29992;COS&#26041;&#27861;&#65292;&#24517;&#39035;&#25351;&#23450;&#20004;&#20010;&#21442;&#25968;&#65306;&#23545;&#25968;&#25910;&#30410;&#29575;&#23494;&#24230;&#30340;&#25130;&#26029;&#33539;&#22260;&#21644;&#29992;&#20313;&#24358;&#32423;&#25968;&#36924;&#36817;&#25130;&#26029;&#23494;&#24230;&#30340;&#39033;&#25968;N&#12290;&#22914;&#20309;&#36873;&#25321;&#25130;&#26029;&#33539;&#22260;&#24050;&#32463;&#20026;&#20154;&#25152;&#30693;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#36824;&#33021;&#25214;&#21040;&#19968;&#20010;&#26126;&#30830;&#30340;&#24182;&#19988;&#26377;&#29992;&#30340;&#39033;&#25968;N&#30340;&#30028;&#38480;&#12290;&#25105;&#20204;&#36824;&#36827;&#19968;&#27493;&#34920;&#26126;&#65292;&#22914;&#26524;&#23494;&#24230;&#26159;&#24179;&#28369;&#30340;&#24182;&#19988;&#21576;&#25351;&#25968;&#34928;&#20943;&#65292;&#21017;COS&#26041;&#27861;&#33267;&#23569;&#20855;&#26377;&#25351;&#25968;&#25910;&#25947;&#38454;&#25968;&#12290;&#20294;&#26159;&#65292;&#22914;&#26524;&#23494;&#24230;&#24179;&#28369;&#20294;&#26377;&#37325;&#23614;&#24052;&#65292;&#23601;&#20687;&#22312;&#26377;&#38480;&#30697;&#38453;log&#31283;&#23450;&#27169;&#22411;&#20013;&#19968;&#26679;&#65292;&#21017;COS&#26041;&#27861;&#27809;&#26377;&#25351;&#25968;&#25910;&#25947;&#38454;&#25968;&#12290;&#25968;&#20540;&#23454;&#39564;&#30830;&#35748;&#20102;&#29702;&#35770;&#21457;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Fourier cosine expansion (COS) method is used for pricing European options numerically very efficiently. To apply the COS method, one has to specify two parameters: a truncation range for the density of the log-returns and a number of terms N to approximate the truncated density by a cosine series. How to choose the truncation range is already known. Here, we are able to find an explicit and useful bound for N as well. We further show that the COS method has at least an exponential order of convergence if the density is smooth and decays exponentially. But, if the density is smooth and has heavy tails like in the Finite Moment Log Stable model, the COS method has not an exponential order of convergence. Numerical experiments confirm the theoretical findings.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21442;&#32771;&#20381;&#36182;&#24615;&#36873;&#25321;&#22312;&#25429;&#25417;&#39118;&#38505;&#12289;&#26102;&#38388;&#21644;&#31038;&#20250;&#20559;&#22909;&#26041;&#38754;&#30340;&#24212;&#29992;&#65292;&#20174;&#32780;&#25581;&#31034;&#20102;&#21442;&#32771;&#20381;&#36182;&#24615;&#36873;&#25321;&#22312;&#26631;&#20934;&#34892;&#20026;&#20551;&#35774;&#20013;&#30340;&#20869;&#22312;&#20381;&#36182;&#24615;&#12290;</title><link>http://arxiv.org/abs/2105.12915</link><description>&lt;p&gt;
&#26377;&#24207;&#30340;&#21442;&#32771;&#20381;&#36182;&#24615;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Ordered Reference Dependent Choice. (arXiv:2105.12915v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2105.12915
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21442;&#32771;&#20381;&#36182;&#24615;&#36873;&#25321;&#22312;&#25429;&#25417;&#39118;&#38505;&#12289;&#26102;&#38388;&#21644;&#31038;&#20250;&#20559;&#22909;&#26041;&#38754;&#30340;&#24212;&#29992;&#65292;&#20174;&#32780;&#25581;&#31034;&#20102;&#21442;&#32771;&#20381;&#36182;&#24615;&#36873;&#25321;&#22312;&#26631;&#20934;&#34892;&#20026;&#20551;&#35774;&#20013;&#30340;&#20869;&#22312;&#20381;&#36182;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#32467;&#26500;&#20551;&#35774;&#65288;&#27604;&#22914;&#26399;&#26395;&#25928;&#29992;&#21644;&#25351;&#25968;&#25240;&#25187;&#65289;&#30340;&#36829;&#21453;&#22914;&#20309;&#19982;&#28304;&#33258;&#21442;&#32771;&#20381;&#36182;&#20559;&#22909;&#30340;&#21512;&#29702;&#24615;&#36829;&#21453;&#30456;&#36830;&#25509;&#65292;&#21363;&#20351;&#34892;&#20026;&#22312;&#21442;&#32771;&#22266;&#23450;&#24773;&#20917;&#19979;&#23436;&#20840;&#26631;&#20934;&#12290;&#38024;&#23545;&#19981;&#21516;&#30340;&#36873;&#25321;&#39046;&#22495;&#65292;&#21442;&#32771;&#20381;&#36182;&#30340;&#24191;&#20041;&#21462;&#20195;&#20219;&#24847;&#34892;&#20026;&#20551;&#35774;&#65292;&#24182;&#19988;&#20135;&#29983;&#20869;&#29983;&#22320;&#30830;&#23450;&#21442;&#32771;&#22791;&#36873;&#26041;&#26696;&#30340;&#32447;&#24615;&#39034;&#24207;&#65292;&#36827;&#32780;&#30830;&#23450;&#36873;&#25321;&#38382;&#39064;&#30340;&#20559;&#22909;&#21442;&#25968;&#12290;&#36890;&#36807;&#20351;&#29992;&#20363;&#22914;&#25928;&#29992;&#20989;&#25968;&#30340;&#20985;&#24615;&#21644;&#25240;&#25187;&#22240;&#23376;&#30340;&#32423;&#21035;&#31561;&#24050;&#30693;&#25216;&#26415;&#65292;&#21487;&#20197;&#25429;&#25417;&#20559;&#22909;&#30340;&#21464;&#21270;&#12290;&#35813;&#26694;&#26550;&#20801;&#35768;&#25105;&#20204;&#38598;&#20307;&#30740;&#31350;&#39118;&#38505;&#12289;&#26102;&#38388;&#21644;&#31038;&#20250;&#20559;&#22909;&#65292;&#20854;&#20013;&#30475;&#20284;&#29420;&#31435;&#30340;&#21453;&#24120;&#29616;&#35937;&#36890;&#36807;&#21442;&#32771;&#20381;&#36182;&#36873;&#25321;&#30340;&#38236;&#22836;&#30456;&#20114;&#36830;&#25509;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies how violations of structural assumptions like expected utility and exponential discounting can be connected to rationality violations that arise from reference-dependent preferences, even if behavior is fully standard when the reference is fixed. A reference-dependent generalization of arbitrarily behavioral postulates captures changing preferences across choice domains. It gives rise to a linear order that endogenously determines reference alternatives, which in turn determines the preference parameters for a choice problem. With canonical models as backbones, preference changes are captured using known technologies like the concavity of utility functions and the levels of discount factors. The framework allows us to study risk, time, and social preferences collectively, where seemingly independent anomalies are interconnected through the lens of reference-dependent choice.
&lt;/p&gt;</description></item></channel></rss>