<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#32929;&#31080;&#22238;&#25253;&#27010;&#29575;&#65292;&#21457;&#29616;&#24066;&#22330;&#25317;&#26377;&#32929;&#31080;&#22238;&#25253;&#30340;&#25152;&#26377;&#20449;&#24687;&#65292;&#24182;&#25506;&#35752;&#20102;&#22238;&#25253;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#19982;&#24403;&#21069;&#21644;&#36807;&#21435;&#20132;&#26131;&#20540;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2302.07935</link><description>&lt;p&gt;
&#22522;&#20110;&#24066;&#22330;&#30340;&#32929;&#31080;&#22238;&#25253;&#27010;&#29575;
&lt;/p&gt;
&lt;p&gt;
Market-Based Probability of Stock Returns
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2302.07935
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#32929;&#31080;&#22238;&#25253;&#27010;&#29575;&#65292;&#21457;&#29616;&#24066;&#22330;&#25317;&#26377;&#32929;&#31080;&#22238;&#25253;&#30340;&#25152;&#26377;&#20449;&#24687;&#65292;&#24182;&#25506;&#35752;&#20102;&#22238;&#25253;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#19982;&#24403;&#21069;&#21644;&#36807;&#21435;&#20132;&#26131;&#20540;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24066;&#22330;&#25317;&#26377;&#20851;&#20110;&#32929;&#31080;&#22238;&#25253;&#30340;&#25152;&#26377;&#21487;&#29992;&#20449;&#24687;&#12290;&#24066;&#22330;&#20132;&#26131;&#30340;&#38543;&#26426;&#24615;&#20915;&#23450;&#20102;&#32929;&#31080;&#22238;&#25253;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#12290;&#26412;&#25991;&#25551;&#36848;&#20102;&#32929;&#31080;&#22238;&#25253;&#30340;&#21069;&#22235;&#20010;&#22522;&#20110;&#24066;&#22330;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#19982;&#24403;&#21069;&#21644;&#36807;&#21435;&#20132;&#26131;&#20540;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#12290;&#22312;&#21152;&#26435;&#24179;&#22343;&#26399;&#38388;&#36827;&#34892;&#20132;&#26131;&#30340;&#24179;&#22343;&#22238;&#25253;&#19982;&#39532;&#31185;&#23041;&#33576;&#23545;&#25237;&#36164;&#32452;&#21512;&#20215;&#20540;&#21152;&#26435;&#22238;&#25253;&#30340;&#23450;&#20041;&#30456;&#21563;&#21512;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#22238;&#25253;&#27874;&#21160;&#29575;&#21644;&#22238;&#25253;-&#20215;&#20540;&#30456;&#20851;&#24615;&#12290;&#36890;&#36807;&#26377;&#38480;&#25968;&#37327;&#30340;&#22522;&#20110;&#24066;&#22330;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#30340;&#29305;&#24449;&#20989;&#25968;&#21644;&#27010;&#29575;&#24230;&#37327;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#23545;&#32929;&#31080;&#22238;&#25253;&#30340;&#36817;&#20284;&#39044;&#27979;&#26041;&#27861;&#12290;&#35201;&#39044;&#27979;&#22522;&#20110;&#24066;&#22330;&#30340;&#24179;&#22343;&#22238;&#25253;&#25110;&#22238;&#25253;&#27874;&#21160;&#29575;&#65292;&#24517;&#39035;&#21516;&#26102;&#39044;&#27979;&#24403;&#21069;&#21644;&#36807;&#21435;&#24066;&#22330;&#20132;&#26131;&#20540;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#65292;&#20197;&#30456;&#21516;&#30340;&#26102;&#38388;&#36328;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
Markets possess all available information on stock returns. The randomness of market trade determines the statistics of stock returns. This paper describes the dependence of the first four market-based statistical moments of stock returns on statistical moments and correlations of current and past trade values. The mean return of trades during the averaging period coincides with Markowitz's definition of portfolio value weighted return. We derive the market-based volatility of return and return-value correlations. We present approximations of the characteristic functions and probability measures of stock return by a finite number of market-based statistical moments. To forecast market-based average return or volatility of return, one should predict the statistical moments and correlations of current and past market trade values at the same time horizon.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25506;&#35752;&#20102;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#20132;&#26131;&#37327;&#30340;&#38543;&#26426;&#24615;&#22914;&#20309;&#24433;&#21709;&#36164;&#20135;&#20215;&#26684;&#30340;&#38543;&#26426;&#24615;&#65292;&#24182;&#36890;&#36807;&#24066;&#22330;&#22522;&#20110;&#20215;&#26684;&#30340;&#32479;&#35745;&#30697;&#26469;&#36817;&#20284;&#20215;&#26684;&#27010;&#29575;&#12290;&#30740;&#31350;&#21457;&#29616;&#20351;&#29992;&#20132;&#26131;&#37327;&#21152;&#26435;&#24179;&#22343;&#20215;&#26684;&#21487;&#20197;&#28040;&#38500;&#20215;&#26684;&#21644;&#20132;&#26131;&#37327;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#20854;&#20182;&#20215;&#26684;&#21644;&#20132;&#26131;&#37327;&#30456;&#20851;&#24615;&#12290;&#30740;&#31350;&#32467;&#26524;&#23545;&#36164;&#20135;&#23450;&#20215;&#27169;&#22411;&#21644;&#39118;&#38505;&#20215;&#20540;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2205.07256</link><description>&lt;p&gt;
&#22522;&#20110;&#24066;&#22330;&#30340;&#36164;&#20135;&#20215;&#26684;&#27010;&#29575;
&lt;/p&gt;
&lt;p&gt;
Market-Based Asset Price Probability
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2205.07256
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25506;&#35752;&#20102;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#20132;&#26131;&#37327;&#30340;&#38543;&#26426;&#24615;&#22914;&#20309;&#24433;&#21709;&#36164;&#20135;&#20215;&#26684;&#30340;&#38543;&#26426;&#24615;&#65292;&#24182;&#36890;&#36807;&#24066;&#22330;&#22522;&#20110;&#20215;&#26684;&#30340;&#32479;&#35745;&#30697;&#26469;&#36817;&#20284;&#20215;&#26684;&#27010;&#29575;&#12290;&#30740;&#31350;&#21457;&#29616;&#20351;&#29992;&#20132;&#26131;&#37327;&#21152;&#26435;&#24179;&#22343;&#20215;&#26684;&#21487;&#20197;&#28040;&#38500;&#20215;&#26684;&#21644;&#20132;&#26131;&#37327;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#20854;&#20182;&#20215;&#26684;&#21644;&#20132;&#26131;&#37327;&#30456;&#20851;&#24615;&#12290;&#30740;&#31350;&#32467;&#26524;&#23545;&#36164;&#20135;&#23450;&#20215;&#27169;&#22411;&#21644;&#39118;&#38505;&#20215;&#20540;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#23558;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#20132;&#26131;&#37327;&#30340;&#38543;&#26426;&#24615;&#35270;&#20026;&#36164;&#20135;&#20215;&#26684;&#38543;&#26426;&#24615;&#30340;&#36215;&#28304;&#12290;&#25105;&#20204;&#23450;&#20041;&#20102;&#20381;&#36182;&#20110;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#20132;&#26131;&#37327;&#30340;&#32479;&#35745;&#30697;&#30340;&#21069;&#22235;&#20010;&#24066;&#22330;&#22522;&#20110;&#20215;&#26684;&#30340;&#32479;&#35745;&#30697;&#12290;&#22914;&#26524;&#22312;&#26102;&#38388;&#24179;&#22343;&#38388;&#38548;&#20869;&#25152;&#26377;&#20132;&#26131;&#37327;&#37117;&#20445;&#25345;&#24658;&#23450;&#65292;&#37027;&#20040;&#24066;&#22330;&#22522;&#20110;&#20215;&#26684;&#30340;&#32479;&#35745;&#30697;&#19982;&#20256;&#32479;&#22522;&#20110;&#39057;&#29575;&#30340;&#32479;&#35745;&#30697;&#30456;&#19968;&#33268;&#12290;&#25105;&#20204;&#36890;&#36807;&#26377;&#38480;&#25968;&#37327;&#30340;&#20215;&#26684;&#32479;&#35745;&#30697;&#26469;&#36817;&#20284;&#24066;&#22330;&#22522;&#20110;&#20215;&#26684;&#30340;&#27010;&#29575;&#12290;&#25105;&#20204;&#32771;&#34385;&#22522;&#20110;&#24066;&#22330;&#20215;&#26684;&#32479;&#35745;&#30697;&#22312;&#36164;&#20135;&#23450;&#20215;&#27169;&#22411;&#21644;&#39118;&#38505;&#20215;&#20540;&#26041;&#38754;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#20351;&#29992;&#20132;&#26131;&#37327;&#21152;&#26435;&#24179;&#22343;&#20215;&#26684;&#20250;&#23548;&#33268;&#20215;&#26684;&#21644;&#20132;&#26131;&#37327;&#30340;&#30456;&#20851;&#24615;&#20026;&#38646;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#20215;&#26684;&#21644;&#20132;&#26131;&#37327;&#24179;&#26041;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#20197;&#21450;&#20215;&#26684;&#24179;&#26041;&#21644;&#20132;&#26131;&#37327;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#12290;&#35201;&#39044;&#27979;&#26399;&#38480;&#20026;T&#30340;&#22522;&#20110;&#24066;&#22330;&#30340;&#20215;&#26684;&#27874;&#21160;&#24615;&#65292;&#38656;&#35201;&#39044;&#27979;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#20132;&#26131;&#37327;&#30340;&#21069;&#20004;&#20010;&#32479;&#35745;&#30697;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the randomness of market trade values and volumes as the origin of asset price stochasticity. We define the first four market-based price statistical moments that depend on statistical moments and correlations of market trade values and volumes. Market-based price statistical moments coincide with conventional frequency-based ones if all trade volumes are constant during the time averaging interval. We present approximations of market-based price probability by a finite number of price statistical moments. We consider the consequences of the use of market-based price statistical moments for asset-pricing models and Value-at-Risk. We show that the use of volume weighted average price results in zero price-volume correlations. We derive market-based correlations between price and squares of volume and between squares of price and volume. To forecast market-based price volatility at horizon T one should predict the first two statistical moments of market trade values and volum
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#22635;&#34917;&#20102;&#20851;&#20110;&#30005;&#23376;&#21830;&#21153;&#24179;&#21488;&#25512;&#33616;&#31639;&#27861;&#22312;&#31639;&#27861;&#21246;&#32467;&#30740;&#31350;&#20013;&#34987;&#24573;&#35270;&#30340;&#31354;&#30333;&#65292;&#24182;&#21457;&#29616;&#25512;&#33616;&#31639;&#27861;&#21487;&#20197;&#20915;&#23450;&#22522;&#20110;AI&#30340;&#23450;&#20215;&#31639;&#27861;&#30340;&#31454;&#20105;&#25110;&#21246;&#32467;&#21160;&#24577;&#12290;</title><link>http://arxiv.org/abs/2309.14548</link><description>&lt;p&gt;
&#31639;&#27861;&#21246;&#32467;&#36824;&#26159;&#31454;&#20105;&#65306;&#24179;&#21488;&#25512;&#33616;&#31995;&#32479;&#30340;&#35282;&#33394;
&lt;/p&gt;
&lt;p&gt;
Algorithmic Collusion or Competition: the Role of Platforms' Recommender Systems. (arXiv:2309.14548v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14548
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#22635;&#34917;&#20102;&#20851;&#20110;&#30005;&#23376;&#21830;&#21153;&#24179;&#21488;&#25512;&#33616;&#31639;&#27861;&#22312;&#31639;&#27861;&#21246;&#32467;&#30740;&#31350;&#20013;&#34987;&#24573;&#35270;&#30340;&#31354;&#30333;&#65292;&#24182;&#21457;&#29616;&#25512;&#33616;&#31639;&#27861;&#21487;&#20197;&#20915;&#23450;&#22522;&#20110;AI&#30340;&#23450;&#20215;&#31639;&#27861;&#30340;&#31454;&#20105;&#25110;&#21246;&#32467;&#21160;&#24577;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#30340;&#23398;&#26415;&#30740;&#31350;&#24191;&#27867;&#25506;&#35752;&#20102;&#22522;&#20110;&#20154;&#24037;&#26234;&#33021;(AI)&#30340;&#21160;&#24577;&#23450;&#20215;&#31639;&#27861;&#23548;&#33268;&#30340;&#31639;&#27861;&#21246;&#32467;&#12290;&#28982;&#32780;&#65292;&#30005;&#23376;&#21830;&#21153;&#24179;&#21488;&#20351;&#29992;&#25512;&#33616;&#31639;&#27861;&#26469;&#20998;&#37197;&#19981;&#21516;&#20135;&#21697;&#30340;&#26333;&#20809;&#65292;&#32780;&#36825;&#19968;&#37325;&#35201;&#26041;&#38754;&#22312;&#20808;&#21069;&#30340;&#31639;&#27861;&#21246;&#32467;&#30740;&#31350;&#20013;&#34987;&#22823;&#37096;&#20998;&#24573;&#35270;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#22635;&#34917;&#20102;&#25991;&#29486;&#20013;&#36825;&#19968;&#37325;&#35201;&#30340;&#31354;&#30333;&#65292;&#24182;&#26816;&#39564;&#20102;&#25512;&#33616;&#31639;&#27861;&#22914;&#20309;&#20915;&#23450;&#22522;&#20110;AI&#30340;&#23450;&#20215;&#31639;&#27861;&#30340;&#31454;&#20105;&#25110;&#21246;&#32467;&#21160;&#24577;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#20004;&#31181;&#24120;&#29992;&#30340;&#25512;&#33616;&#31639;&#27861;&#65306;(i)&#20197;&#26368;&#22823;&#21270;&#21334;&#23478;&#24635;&#21033;&#28070;&#20026;&#30446;&#26631;&#30340;&#25512;&#33616;&#31995;&#32479;&#21644;(ii)&#20197;&#26368;&#22823;&#21270;&#24179;&#21488;&#19978;&#20135;&#21697;&#38656;&#27714;&#20026;&#30446;&#26631;&#30340;&#25512;&#33616;&#31995;&#32479;&#12290;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#37325;&#22797;&#21338;&#24328;&#26694;&#26550;&#65292;&#23558;&#21334;&#23478;&#30340;&#23450;&#20215;&#31639;&#27861;&#21644;&#24179;&#21488;&#30340;&#25512;&#33616;&#31639;&#27861;&#36827;&#34892;&#20102;&#25972;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recent academic research has extensively examined algorithmic collusion resulting from the utilization of artificial intelligence (AI)-based dynamic pricing algorithms. Nevertheless, e-commerce platforms employ recommendation algorithms to allocate exposure to various products, and this important aspect has been largely overlooked in previous studies on algorithmic collusion. Our study bridges this important gap in the literature and examines how recommendation algorithms can determine the competitive or collusive dynamics of AI-based pricing algorithms. Specifically, two commonly deployed recommendation algorithms are examined: (i) a recommender system that aims to maximize the sellers' total profit (profit-based recommender system) and (ii) a recommender system that aims to maximize the demand for products sold on the platform (demand-based recommender system). We construct a repeated game framework that incorporates both pricing algorithms adopted by sellers and the platform's recom
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;E-&#20540;&#21644;E-&#36807;&#31243;&#25216;&#26415;&#30340;ES&#39044;&#27979;&#26080;&#27169;&#22411;&#22238;&#27979;&#31243;&#24207;&#65292;&#21487;&#20197;&#33258;&#28982;&#22320;&#24212;&#29992;&#20110;&#35768;&#22810;&#20854;&#20182;&#39118;&#38505;&#24230;&#37327;&#21644;&#32479;&#35745;&#37327;&#12290;</title><link>http://arxiv.org/abs/2209.00991</link><description>&lt;p&gt;
E-backtesting&#8212;&#8212;&#19968;&#31181;ES&#39044;&#27979;&#30340;&#26080;&#27169;&#22411;&#22238;&#27979;&#31243;&#24207;
&lt;/p&gt;
&lt;p&gt;
E-backtesting. (arXiv:2209.00991v2 [q-fin.RM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.00991
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;E-&#20540;&#21644;E-&#36807;&#31243;&#25216;&#26415;&#30340;ES&#39044;&#27979;&#26080;&#27169;&#22411;&#22238;&#27979;&#31243;&#24207;&#65292;&#21487;&#20197;&#33258;&#28982;&#22320;&#24212;&#29992;&#20110;&#35768;&#22810;&#20854;&#20182;&#39118;&#38505;&#24230;&#37327;&#21644;&#32479;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26368;&#36817;&#30340;&#24052;&#22622;&#23572;&#21327;&#35758;&#20013;&#65292;&#39044;&#26399;&#25439;&#22833;&#65288;ES&#65289;&#21462;&#20195;&#20102;&#20215;&#20540;&#25439;&#22833;&#65288;VaR&#65289;&#25104;&#20026;&#38134;&#34892;&#19994;&#24066;&#22330;&#39118;&#38505;&#30340;&#26631;&#20934;&#39118;&#38505;&#24230;&#37327;&#65292;&#20351;&#23427;&#25104;&#20026;&#37329;&#34701;&#30417;&#31649;&#20013;&#26368;&#37325;&#35201;&#30340;&#39118;&#38505;&#24230;&#37327;&#12290;&#39118;&#38505;&#24314;&#27169;&#23454;&#36341;&#20013;&#26368;&#20855;&#25361;&#25112;&#24615;&#30340;&#20219;&#21153;&#20043;&#19968;&#26159;&#22238;&#27979;&#37329;&#34701;&#26426;&#26500;&#25552;&#20379;&#30340;ES&#39044;&#27979;&#12290;&#20026;&#20102;&#35774;&#35745;&#19968;&#31181;ES&#30340;&#26080;&#27169;&#22411;&#22238;&#27979;&#31243;&#24207;&#65292;&#25105;&#20204;&#21033;&#29992;&#20102;&#26368;&#36817;&#21457;&#23637;&#30340;E-&#20540;&#21644;E-&#36807;&#31243;&#25216;&#26415;&#12290;&#24341;&#20837;&#20102;&#26080;&#27169;&#22411;E-&#32479;&#35745;&#37327;&#26469;&#21046;&#23450;&#39118;&#38505;&#24230;&#37327;&#39044;&#27979;&#30340;E-&#36807;&#31243;&#65292;&#24182;&#21033;&#29992;&#37492;&#21035;&#20989;&#25968;&#30340;&#26368;&#26032;&#32467;&#26524;&#20026;VaR&#21644;ES&#30340;&#26080;&#27169;&#22411;E-&#32479;&#35745;&#37327;&#30830;&#23450;&#20102;&#29420;&#29305;&#30340;&#24418;&#24335;&#12290;&#23545;&#20110;&#32473;&#23450;&#30340;&#26080;&#27169;&#22411;E-&#32479;&#35745;&#37327;&#65292;&#30740;&#31350;&#20102;&#26500;&#24314;E-&#36807;&#31243;&#30340;&#26368;&#20248;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#33258;&#28982;&#22320;&#24212;&#29992;&#20110;&#35768;&#22810;&#20854;&#20182;&#39118;&#38505;&#24230;&#37327;&#21644;&#32479;&#35745;&#37327;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#22823;&#37327;&#30340;&#27169;&#25311;&#30740;&#31350;&#21644;&#25968;&#25454;&#20998;&#26512;&#65292;&#20197;&#35828;&#26126;&#26080;&#27169;&#22411;&#26041;&#27861;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the recent Basel Accords, the Expected Shortfall (ES) replaces the Value-at-Risk (VaR) as the standard risk measure for market risk in the banking sector, making it the most important risk measure in financial regulation. One of the most challenging tasks in risk modeling practice is to backtest ES forecasts provided by financial institutions. To design a model-free backtesting procedure for ES, we make use of the recently developed techniques of e-values and e-processes. Model-free e-statistics are introduced to formulate e-processes for risk measure forecasts, and unique forms of model-free e-statistics for VaR and ES are characterized using recent results on identification functions. For a given model-free e-statistic, optimal ways of constructing the e-processes are studied. The proposed method can be naturally applied to many other risk measures and statistical quantities. We conduct extensive simulation studies and data analysis to illustrate the advantages of the model-free b
&lt;/p&gt;</description></item></channel></rss>