<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;Wiener-Kallianpur&#21019;&#26032;&#34920;&#31034;&#30340;&#29983;&#25104;&#24335;&#27010;&#29575;&#39044;&#27979;&#26041;&#27861;&#65292;&#21253;&#25324;&#33258;&#32534;&#30721;&#22120;&#21644;&#26032;&#39062;&#30340;&#28145;&#24230;&#23398;&#20064;&#31639;&#27861;&#65292;&#20855;&#26377;&#28176;&#36817;&#26368;&#20248;&#24615;&#21644;&#32467;&#26500;&#25910;&#25947;&#24615;&#36136;&#65292;&#36866;&#29992;&#20110;&#23454;&#26102;&#24066;&#22330;&#36816;&#33829;&#20013;&#30340;&#39640;&#21160;&#24577;&#21644;&#27874;&#21160;&#26102;&#38388;&#24207;&#21015;&#12290;</title><link>https://arxiv.org/abs/2403.05743</link><description>&lt;p&gt;
&#20855;&#26377;&#24066;&#22330;&#36816;&#33829;&#24212;&#29992;&#30340;&#29983;&#25104;&#24335;&#27010;&#29575;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Generative Probabilistic Forecasting with Applications in Market Operations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05743
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;Wiener-Kallianpur&#21019;&#26032;&#34920;&#31034;&#30340;&#29983;&#25104;&#24335;&#27010;&#29575;&#39044;&#27979;&#26041;&#27861;&#65292;&#21253;&#25324;&#33258;&#32534;&#30721;&#22120;&#21644;&#26032;&#39062;&#30340;&#28145;&#24230;&#23398;&#20064;&#31639;&#27861;&#65292;&#20855;&#26377;&#28176;&#36817;&#26368;&#20248;&#24615;&#21644;&#32467;&#26500;&#25910;&#25947;&#24615;&#36136;&#65292;&#36866;&#29992;&#20110;&#23454;&#26102;&#24066;&#22330;&#36816;&#33829;&#20013;&#30340;&#39640;&#21160;&#24577;&#21644;&#27874;&#21160;&#26102;&#38388;&#24207;&#21015;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#29983;&#25104;&#24335;&#27010;&#29575;&#39044;&#27979;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#28304;&#33258;&#20110;&#38750;&#21442;&#25968;&#26102;&#38388;&#24207;&#21015;&#30340;Wiener-Kallianpur&#21019;&#26032;&#34920;&#31034;&#12290;&#22312;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#30340;&#33539;&#24335;&#19979;&#65292;&#25152;&#25552;&#20986;&#30340;&#39044;&#27979;&#26550;&#26500;&#21253;&#25324;&#19968;&#20010;&#33258;&#32534;&#30721;&#22120;&#65292;&#23558;&#38750;&#21442;&#25968;&#22810;&#21464;&#37327;&#38543;&#26426;&#36807;&#31243;&#36716;&#21270;&#20026;&#35268;&#33539;&#30340;&#21019;&#26032;&#24207;&#21015;&#65292;&#20174;&#20013;&#26681;&#25454;&#36807;&#21435;&#26679;&#26412;&#29983;&#25104;&#26410;&#26469;&#26102;&#38388;&#24207;&#21015;&#26679;&#26412;&#65292;&#26465;&#20214;&#26159;&#23427;&#20204;&#30340;&#27010;&#29575;&#20998;&#24067;&#21462;&#20915;&#20110;&#36807;&#21435;&#26679;&#26412;&#12290;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#28145;&#24230;&#23398;&#20064;&#31639;&#27861;&#65292;&#23558;&#28508;&#22312;&#36807;&#31243;&#38480;&#21046;&#20026;&#20855;&#26377;&#21305;&#37197;&#33258;&#32534;&#30721;&#22120;&#36755;&#20837;-&#36755;&#20986;&#26465;&#20214;&#27010;&#29575;&#20998;&#24067;&#30340;&#29420;&#31435;&#21516;&#20998;&#24067;&#24207;&#21015;&#12290;&#24314;&#31435;&#20102;&#25152;&#25552;&#20986;&#30340;&#29983;&#25104;&#24335;&#39044;&#27979;&#26041;&#27861;&#30340;&#28176;&#36817;&#26368;&#20248;&#24615;&#21644;&#32467;&#26500;&#25910;&#25947;&#24615;&#36136;&#12290;&#35813;&#26041;&#27861;&#22312;&#23454;&#26102;&#24066;&#22330;&#36816;&#33829;&#20013;&#28041;&#21450;&#39640;&#24230;&#21160;&#24577;&#21644;&#27874;&#21160;&#26102;&#38388;&#24207;&#21015;&#30340;&#19977;&#20010;&#24212;&#29992;&#26041;&#38754;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05743v1 Announce Type: cross  Abstract: This paper presents a novel generative probabilistic forecasting approach derived from the Wiener-Kallianpur innovation representation of nonparametric time series. Under the paradigm of generative artificial intelligence, the proposed forecasting architecture includes an autoencoder that transforms nonparametric multivariate random processes into canonical innovation sequences, from which future time series samples are generated according to their probability distributions conditioned on past samples. A novel deep-learning algorithm is proposed that constrains the latent process to be an independent and identically distributed sequence with matching autoencoder input-output conditional probability distributions. Asymptotic optimality and structural convergence properties of the proposed generative forecasting approach are established. Three applications involving highly dynamic and volatile time series in real-time market operations a
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#31995;&#32479;&#21270;&#22320;&#30740;&#31350;&#20102;&#20013;&#24515;&#21270;&#21644;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#20013;&#27704;&#32493;&#26399;&#36135;&#21512;&#32422;&#30340;&#20132;&#26131;&#32773;&#34892;&#20026;&#65292;&#24182;&#25552;&#20986;&#20102;&#26032;&#30340;&#20998;&#26512;&#26694;&#26550;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;VAMM&#27169;&#22411;&#30340;DEX&#20013;&#65292;&#22810;&#22836;&#21644;&#31354;&#22836;&#25345;&#20179;&#37327;&#23545;&#20215;&#26684;&#27874;&#21160;&#20135;&#29983;&#30456;&#21453;&#30340;&#24433;&#21709;&#65292;&#32780;&#22312;&#37319;&#29992;&#39044;&#35328;&#26426;&#23450;&#20215;&#27169;&#22411;&#30340;DEX&#20013;&#65292;&#20080;&#23478;&#21644;&#21334;&#23478;&#20043;&#38388;&#30340;&#20132;&#26131;&#32773;&#34892;&#20026;&#23384;&#22312;&#26126;&#26174;&#30340;&#19981;&#23545;&#31216;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.03953</link><description>&lt;p&gt;
&#20013;&#24515;&#21270;&#21644;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#20013;&#30340;&#27704;&#32493;&#26399;&#36135;&#21512;&#32422;: &#26426;&#21046;&#21644;&#20132;&#26131;&#32773;&#34892;&#20026;
&lt;/p&gt;
&lt;p&gt;
Perpetual Future Contracts in Centralized and Decentralized Exchanges: Mechanism and Traders' Behavior
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.03953
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#31995;&#32479;&#21270;&#22320;&#30740;&#31350;&#20102;&#20013;&#24515;&#21270;&#21644;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#20013;&#27704;&#32493;&#26399;&#36135;&#21512;&#32422;&#30340;&#20132;&#26131;&#32773;&#34892;&#20026;&#65292;&#24182;&#25552;&#20986;&#20102;&#26032;&#30340;&#20998;&#26512;&#26694;&#26550;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;VAMM&#27169;&#22411;&#30340;DEX&#20013;&#65292;&#22810;&#22836;&#21644;&#31354;&#22836;&#25345;&#20179;&#37327;&#23545;&#20215;&#26684;&#27874;&#21160;&#20135;&#29983;&#30456;&#21453;&#30340;&#24433;&#21709;&#65292;&#32780;&#22312;&#37319;&#29992;&#39044;&#35328;&#26426;&#23450;&#20215;&#27169;&#22411;&#30340;DEX&#20013;&#65292;&#20080;&#23478;&#21644;&#21334;&#23478;&#20043;&#38388;&#30340;&#20132;&#26131;&#32773;&#34892;&#20026;&#23384;&#22312;&#26126;&#26174;&#30340;&#19981;&#23545;&#31216;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#20855;&#26377;&#24320;&#21019;&#24615;&#30340;&#30693;&#35782;&#31995;&#32479;&#21270;(SoK)&#35745;&#21010;&#65292;&#37325;&#28857;&#28145;&#20837;&#25506;&#32034;&#20132;&#26131;&#32773;&#22312;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;(CEXs)&#21644;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;(DEXs)&#20013;&#20851;&#20110;&#27704;&#32493;&#26399;&#36135;&#21512;&#32422;&#30340;&#21160;&#24577;&#21644;&#34892;&#20026;&#12290;&#25105;&#20204;&#25913;&#36827;&#20102;&#29616;&#26377;&#27169;&#22411;&#65292;&#20197;&#30740;&#31350;&#20132;&#26131;&#32773;&#23545;&#20215;&#26684;&#27874;&#21160;&#30340;&#21453;&#24212;&#65292;&#21019;&#24314;&#20102;&#19968;&#20010;&#38024;&#23545;&#36825;&#20123;&#21512;&#32422;&#24179;&#21488;&#30340;&#26032;&#30340;&#20998;&#26512;&#26694;&#26550;&#65292;&#21516;&#26102;&#31361;&#20986;&#20102;&#21306;&#22359;&#38142;&#25216;&#26415;&#22312;&#20854;&#24212;&#29992;&#20013;&#30340;&#20316;&#29992;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#21253;&#25324;&#23545;CEXs&#30340;&#21382;&#21490;&#25968;&#25454;&#30340;&#27604;&#36739;&#20998;&#26512;&#65292;&#20197;&#21450;&#23545;DEXs&#19978;&#30340;&#23436;&#25972;&#20132;&#26131;&#25968;&#25454;&#30340;&#26356;&#35814;&#23613;&#30340;&#30740;&#31350;&#12290;&#22312;&#34394;&#25311;&#33258;&#21160;&#21270;&#24066;&#22330;&#20570;&#24066;&#21830;(VAMM)&#27169;&#22411;&#30340;DEX&#19978;&#65292;&#22810;&#22836;&#21644;&#31354;&#22836;&#25345;&#20179;&#37327;&#23545;&#20215;&#26684;&#27874;&#21160;&#20135;&#29983;&#30456;&#21453;&#30340;&#24433;&#21709;&#65292;&#36825;&#24402;&#22240;&#20110;VAMM&#30340;&#20215;&#26684;&#24418;&#25104;&#26426;&#21046;&#12290;&#22312;&#37319;&#29992;&#39044;&#35328;&#26426;&#23450;&#20215;&#27169;&#22411;&#30340;DEX&#20013;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;&#20080;&#23478;&#21644;&#21334;&#23478;&#20043;&#38388;&#20132;&#26131;&#32773;&#34892;&#20026;&#19978;&#23384;&#22312;&#26126;&#26174;&#30340;&#19981;&#23545;&#31216;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study presents a groundbreaking Systematization of Knowledge (SoK) initiative, focusing on an in-depth exploration of the dynamics and behavior of traders on perpetual future contracts across both centralized exchanges (CEXs), and decentralized exchanges (DEXs). We have refined the existing model for investigating traders' behavior in reaction to price volatility to create a new analytical framework specifically for these contract platforms, while also highlighting the role of blockchain technology in their application. Our research includes a comparative analysis of historical data from CEXs and a more extensive examination of complete transactional data on DEXs. On DEX of Virtual Automated Market Making (VAMM) Model, open interest on short and long positions exert effect on price volatility in opposite direction, attributable to VAMM's price formation mechanism. In the DEXs with Oracle Pricing Model, we observed a distinct asymmetry in trader behavior between buyers and sellers.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#38598;&#20013;&#27969;&#21160;&#24615;&#30340;&#24120;&#37327;&#20135;&#21697;&#24066;&#22330;&#65292;&#23545;&#21160;&#24577;&#35843;&#25972;&#27969;&#21160;&#24615;&#30340;&#25112;&#30053;&#24615;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#36130;&#23500;&#21160;&#24577;&#36827;&#34892;&#20102;&#25551;&#36848;&#12290;&#36890;&#36807;&#25512;&#23548;&#20986;&#33258;&#34701;&#36164;&#21644;&#23553;&#38381;&#24418;&#24335;&#30340;&#26368;&#20248;&#27969;&#21160;&#24615;&#25552;&#20379;&#31574;&#30053;&#65292;&#32467;&#21512;&#30408;&#21033;&#33021;&#21147;&#12289;&#39044;&#27979;&#25439;&#22833;&#21644;&#38598;&#20013;&#39118;&#38505;&#65292;&#21487;&#20197;&#36890;&#36807;&#35843;&#25972;&#27969;&#21160;&#24615;&#33539;&#22260;&#26469;&#22686;&#21152;&#36153;&#29992;&#25910;&#20837;&#24182;&#20174;&#36793;&#38469;&#29575;&#30340;&#39044;&#26399;&#21464;&#21270;&#20013;&#33719;&#21033;&#12290;</title><link>http://arxiv.org/abs/2309.08431</link><description>&lt;p&gt;
&#21435;&#20013;&#24515;&#21270;&#37329;&#34701;&#19982;&#33258;&#21160;&#21270;&#24066;&#22330;&#20570;&#24066;&#65306;&#21487;&#39044;&#27979;&#30340;&#25439;&#22833;&#21644;&#26368;&#20248;&#27969;&#21160;&#24615;&#25552;&#20379;
&lt;/p&gt;
&lt;p&gt;
Decentralised Finance and Automated Market Making: Predictable Loss and Optimal Liquidity Provision. (arXiv:2309.08431v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.08431
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#38598;&#20013;&#27969;&#21160;&#24615;&#30340;&#24120;&#37327;&#20135;&#21697;&#24066;&#22330;&#65292;&#23545;&#21160;&#24577;&#35843;&#25972;&#27969;&#21160;&#24615;&#30340;&#25112;&#30053;&#24615;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#36130;&#23500;&#21160;&#24577;&#36827;&#34892;&#20102;&#25551;&#36848;&#12290;&#36890;&#36807;&#25512;&#23548;&#20986;&#33258;&#34701;&#36164;&#21644;&#23553;&#38381;&#24418;&#24335;&#30340;&#26368;&#20248;&#27969;&#21160;&#24615;&#25552;&#20379;&#31574;&#30053;&#65292;&#32467;&#21512;&#30408;&#21033;&#33021;&#21147;&#12289;&#39044;&#27979;&#25439;&#22833;&#21644;&#38598;&#20013;&#39118;&#38505;&#65292;&#21487;&#20197;&#36890;&#36807;&#35843;&#25972;&#27969;&#21160;&#24615;&#33539;&#22260;&#26469;&#22686;&#21152;&#36153;&#29992;&#25910;&#20837;&#24182;&#20174;&#36793;&#38469;&#29575;&#30340;&#39044;&#26399;&#21464;&#21270;&#20013;&#33719;&#21033;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#23545;&#21160;&#24577;&#35843;&#25972;&#20854;&#22312;&#38598;&#20013;&#27969;&#21160;&#24615;&#27744;&#20013;&#25552;&#20379;&#27969;&#21160;&#24615;&#33539;&#22260;&#30340;&#25112;&#30053;&#24615;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#36830;&#32493;&#26102;&#38388;&#36130;&#23500;&#21160;&#24577;&#36827;&#34892;&#20102;&#34920;&#24449;&#12290;&#20182;&#20204;&#30340;&#36130;&#23500;&#26469;&#33258;&#25163;&#32493;&#36153;&#25910;&#20837;&#21644;&#20182;&#20204;&#22312;&#27744;&#20013;&#25345;&#26377;&#30340;&#36164;&#20135;&#30340;&#20215;&#20540;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#20102;&#19968;&#31181;&#33258;&#34701;&#36164;&#21644;&#23553;&#38381;&#24418;&#24335;&#30340;&#26368;&#20248;&#27969;&#21160;&#24615;&#25552;&#20379;&#31574;&#30053;&#65292;&#20854;&#20013;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#33539;&#22260;&#23485;&#24230;&#30001;&#27744;&#30340;&#30408;&#21033;&#33021;&#21147;&#65288;&#25552;&#20379;&#36153;&#29992;&#20943;&#21435;&#29123;&#27668;&#36153;&#29992;&#65289;&#12289;&#21487;&#39044;&#27979;&#25439;&#22833;&#65288;&#25345;&#20179;&#30340;&#25439;&#22833;&#65289;&#21644;&#38598;&#20013;&#39118;&#38505;&#20915;&#23450;&#12290;&#38598;&#20013;&#39118;&#38505;&#26159;&#25351;&#22914;&#26524;&#27744;&#20013;&#30340;&#36793;&#38469;&#20817;&#25442;&#29575;&#65288;&#31867;&#20284;&#20110;&#38480;&#20215;&#35746;&#21333;&#31807;&#20013;&#30340;&#20013;&#38388;&#20215;&#65289;&#36229;&#20986;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#33539;&#22260;&#65292;&#36153;&#29992;&#25910;&#20837;&#20250;&#19979;&#38477;&#12290;&#24403;&#36793;&#38469;&#20817;&#25442;&#29575;&#30001;&#38543;&#26426;&#28418;&#31227;&#39537;&#21160;&#26102;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#36890;&#36807;&#26368;&#20248;&#35843;&#25972;&#27969;&#21160;&#24615;&#33539;&#22260;&#26469;&#22686;&#21152;&#36153;&#29992;&#25910;&#20837;&#24182;&#20174;&#36793;&#38469;&#29575;&#30340;&#39044;&#26399;&#21464;&#21270;&#20013;&#33719;&#21033;&#12290;
&lt;/p&gt;
&lt;p&gt;
Constant product markets with concentrated liquidity (CL) are the most popular type of automated market makers. In this paper, we characterise the continuous-time wealth dynamics of strategic LPs who dynamically adjust their range of liquidity provision in CL pools. Their wealth results from fee income and the value of their holdings in the pool. Next, we derive a self-financing and closed-form optimal liquidity provision strategy where the width of the LP's liquidity range is determined by the profitability of the pool (provision fees minus gas fees), the predictable losses (PL) of the LP's position, and concentration risk. Concentration risk refers to the decrease in fee revenue if the marginal exchange rate (akin to the midprice in a limit order book) in the pool exits the LP's range of liquidity. When the marginal rate is driven by a stochastic drift, we show how to optimally skew the range of liquidity to increase fee revenue and profit from the expected changes in the marginal ra
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#38750;&#26631;&#20934;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#65292;&#26088;&#22312;&#26368;&#22823;&#21270;&#28040;&#36153;&#25928;&#29992;&#65292;&#21516;&#26102;&#28385;&#36275;&#24213;&#37096;&#32422;&#26463;&#21644;&#22522;&#20934;&#36807;&#31243;&#12290;&#36890;&#36807;&#24341;&#20837;&#20004;&#20010;&#24102;&#21453;&#23556;&#30340;&#36741;&#21161;&#29366;&#24577;&#36807;&#31243;&#65292;&#24314;&#31435;&#20102;&#31561;&#25928;&#30340;&#36741;&#21161;&#25511;&#21046;&#38382;&#39064;&#65292;&#24471;&#21040;&#20102;&#20851;&#38190;&#30340;&#23545;&#20598;&#20215;&#20540;&#20989;&#25968;&#24615;&#36136;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#19968;&#20123;&#26377;&#36259;&#30340;&#32463;&#27982;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2302.08302</link><description>&lt;p&gt;
&#36215;&#28304;&#20110;&#24102;&#26377;&#21333;&#35843;&#22522;&#20934;&#36807;&#31243;&#30340;&#26494;&#24347;&#36130;&#23500;&#36319;&#36394;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
A stochastic control problem arising from relaxed wealth tracking with a monotone benchmark process. (arXiv:2302.08302v2 [math.OC] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.08302
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#38750;&#26631;&#20934;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#65292;&#26088;&#22312;&#26368;&#22823;&#21270;&#28040;&#36153;&#25928;&#29992;&#65292;&#21516;&#26102;&#28385;&#36275;&#24213;&#37096;&#32422;&#26463;&#21644;&#22522;&#20934;&#36807;&#31243;&#12290;&#36890;&#36807;&#24341;&#20837;&#20004;&#20010;&#24102;&#21453;&#23556;&#30340;&#36741;&#21161;&#29366;&#24577;&#36807;&#31243;&#65292;&#24314;&#31435;&#20102;&#31561;&#25928;&#30340;&#36741;&#21161;&#25511;&#21046;&#38382;&#39064;&#65292;&#24471;&#21040;&#20102;&#20851;&#38190;&#30340;&#23545;&#20598;&#20215;&#20540;&#20989;&#25968;&#24615;&#36136;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#19968;&#20123;&#26377;&#36259;&#30340;&#32463;&#27982;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#38750;&#26631;&#20934;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#65292;&#20854;&#28789;&#24863;&#26469;&#28304;&#20110;&#24102;&#26377;&#38750;&#36882;&#20943;&#22522;&#20934;&#36807;&#31243;&#30340;&#26368;&#20248;&#28040;&#36153;&#19982;&#36130;&#23500;&#36319;&#36394;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#21333;&#35843;&#22522;&#20934;&#26159;&#36890;&#36807;&#28418;&#31227;&#24067;&#26391;&#36816;&#21160;&#30340;&#36816;&#34892;&#26368;&#22823;&#20540;&#26469;&#24314;&#27169;&#30340;&#12290;&#25105;&#20204;&#32771;&#34385;&#20351;&#29992;&#36164;&#26412;&#27880;&#20837;&#30340;&#26494;&#24347;&#36319;&#36394;&#20844;&#24335;&#65292;&#20351;&#24471;&#27880;&#20837;&#30340;&#36164;&#26412;&#25152;&#34917;&#20607;&#30340;&#36130;&#23500;&#22312;&#20219;&#20309;&#26102;&#20505;&#37117;&#20248;&#20110;&#22522;&#20934;&#36807;&#31243;&#12290;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#26159;&#22312;&#21160;&#24577;&#24213;&#37096;&#32422;&#26463;&#19979;&#65292;&#26368;&#22823;&#21270;&#21066;&#20943;&#36164;&#26412;&#27880;&#20837;&#25104;&#26412;&#21518;&#30340;&#28040;&#36153;&#30340;&#26399;&#26395;&#25928;&#29992;&#12290;&#36890;&#36807;&#24341;&#20837;&#20004;&#20010;&#24102;&#21453;&#23556;&#30340;&#36741;&#21161;&#29366;&#24577;&#36807;&#31243;&#65292;&#25105;&#20204;&#21046;&#23450;&#20102;&#19968;&#20010;&#31561;&#25928;&#30340;&#36741;&#21161;&#25511;&#21046;&#38382;&#39064;&#65292;&#21516;&#26102;&#30740;&#31350;&#20102;&#26464;&#26438;&#36164;&#26412;&#27880;&#20837;&#21644;&#24213;&#37096;&#32422;&#26463;&#25511;&#21046;&#65292;&#20351;&#20854;&#38544;&#21311;&#36215;&#26469;&#12290;&#20026;&#20102;&#35299;&#20915;&#24102;&#26377;&#20004;&#20010;Neumann&#36793;&#30028;&#26465;&#20214;&#30340;HJB&#26041;&#31243;&#65292;&#25105;&#20204;&#20351;&#29992;&#19968;&#20123;&#26032;&#39062;&#30340;&#27010;&#29575;&#25216;&#24039;&#24314;&#31435;&#20102;&#23545;&#20598;PDE&#30340;&#21807;&#19968;&#32463;&#20856;&#35299;&#20998;&#31163;&#24418;&#24335;&#30340;&#23384;&#22312;&#24615;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#36129;&#29486;&#26159;&#30830;&#23450;&#20102;&#23545;&#20598;&#20215;&#20540;&#20989;&#25968;&#30340;&#19968;&#20123;&#20851;&#38190;&#24615;&#36136;&#65292;&#20174;&#32780;&#20351;&#25105;&#20204;&#33021;&#22815;&#24314;&#31435;&#26494;&#24347;&#36130;&#23500;&#36319;&#36394;&#38382;&#39064;&#30340;&#26368;&#20248;&#35299;&#30340;&#23384;&#22312;&#24615;&#21644;&#21807;&#19968;&#24615;&#65292;&#24182;&#24471;&#20986;&#20102;&#19968;&#20123;&#26377;&#36259;&#30340;&#32463;&#27982;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies a nonstandard stochastic control problem motivated by the optimal consumption with wealth tracking of a non-decreasing benchmark process. In particular, the monotone benchmark is modelled by the running maximum of a drifted Brownian motion. We consider a relaxed tracking formulation using capital injection such that the wealth compensated by the injected capital dominates the benchmark process at all times. The stochastic control problem is to maximize the expected utility on consumption deducted by the cost of the capital injection under the dynamic floor constraint. By introducing two auxiliary state processes with reflections, an equivalent auxiliary control problem is formulated and studied such that the singular control of capital injection and the floor constraint can be hidden. To tackle the HJB equation with two Neumann boundary conditions, we establish the existence of a unique classical solution to the dual PDE in a separation form using some novel probabil
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24314;&#31435;&#20102;&#19968;&#31181;&#26032;&#30340;&#20998;&#20301;&#25968;&#32858;&#21512;&#20998;&#26512;&#30028;&#38480;&#8212;&#8212;&#21367;&#31215;&#30028;&#38480;&#65292;&#20854;&#26159;&#30446;&#21069;&#19968;&#33324;&#24773;&#20917;&#19979;&#26368;&#22909;&#30340;&#30028;&#38480;&#12290;&#21367;&#31215;&#30028;&#38480;&#26131;&#20110;&#35745;&#31639;&#65292;&#22312;&#35768;&#22810;&#30456;&#20851;&#24773;&#20917;&#19979;&#23574;&#38160;&#65292;&#24182;&#19988;&#20801;&#35768;&#26368;&#26497;&#31471;&#30340;&#20381;&#36182;&#32467;&#26500;&#30340;&#21487;&#35299;&#37322;&#24615;&#12290;&#27492;&#22806;&#65292;&#26412;&#25991;&#36824;&#35752;&#35770;&#20102;&#30456;&#20851;&#24212;&#29992;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2007.09320</link><description>&lt;p&gt;
&#25512;&#26029;&#20998;&#20301;&#25968;&#32858;&#21512;&#30340;&#21367;&#31215;&#30028;&#38480;
&lt;/p&gt;
&lt;p&gt;
Convolution Bounds on Quantile Aggregation. (arXiv:2007.09320v3 [q-fin.RM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2007.09320
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24314;&#31435;&#20102;&#19968;&#31181;&#26032;&#30340;&#20998;&#20301;&#25968;&#32858;&#21512;&#20998;&#26512;&#30028;&#38480;&#8212;&#8212;&#21367;&#31215;&#30028;&#38480;&#65292;&#20854;&#26159;&#30446;&#21069;&#19968;&#33324;&#24773;&#20917;&#19979;&#26368;&#22909;&#30340;&#30028;&#38480;&#12290;&#21367;&#31215;&#30028;&#38480;&#26131;&#20110;&#35745;&#31639;&#65292;&#22312;&#35768;&#22810;&#30456;&#20851;&#24773;&#20917;&#19979;&#23574;&#38160;&#65292;&#24182;&#19988;&#20801;&#35768;&#26368;&#26497;&#31471;&#30340;&#20381;&#36182;&#32467;&#26500;&#30340;&#21487;&#35299;&#37322;&#24615;&#12290;&#27492;&#22806;&#65292;&#26412;&#25991;&#36824;&#35752;&#35770;&#20102;&#30456;&#20851;&#24212;&#29992;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24102;&#26377;&#20381;&#36182;&#19981;&#30830;&#23450;&#24615;&#30340;&#20998;&#20301;&#25968;&#32858;&#21512;&#22312;&#27010;&#29575;&#35770;&#20013;&#26377;&#30528;&#24736;&#20037;&#30340;&#21382;&#21490;&#65292;&#24191;&#27867;&#24212;&#29992;&#20110;&#37329;&#34701;&#12289;&#39118;&#38505;&#31649;&#29702;&#12289;&#32479;&#35745;&#23398;&#21644;&#36816;&#31609;&#23398;&#31561;&#39046;&#22495;&#12290;&#26412;&#25991;&#21033;&#29992;&#20851;&#20110;&#22522;&#20110;&#20998;&#20301;&#25968;&#39118;&#38505;&#24230;&#37327;&#30340; inf-&#21367;&#31215;&#26368;&#36817;&#30340;&#32467;&#26524;&#65292;&#24314;&#31435;&#20102;&#25105;&#20204;&#31216;&#20043;&#20026;&#21367;&#31215;&#30028;&#38480;&#30340;&#26032;&#30340;&#20998;&#20301;&#25968;&#32858;&#21512;&#20998;&#26512;&#30028;&#38480;&#12290;&#21367;&#31215;&#30028;&#38480;&#32479;&#19968;&#20102;&#20998;&#20301;&#25968;&#32858;&#21512;&#20013;&#30340;&#27599;&#19968;&#20010;&#21487;&#29992;&#20998;&#26512;&#32467;&#26524;&#65292;&#24182;&#21551;&#21457;&#25105;&#20204;&#23545;&#36825;&#20123;&#26041;&#27861;&#30340;&#29702;&#35299;&#12290;&#36825;&#20123;&#30028;&#38480;&#26159;&#19968;&#33324;&#24773;&#20917;&#19979;&#26368;&#22909;&#30340;&#12290;&#27492;&#22806;&#65292;&#21367;&#31215;&#30028;&#38480;&#26131;&#20110;&#35745;&#31639;&#65292;&#24182;&#19988;&#25105;&#20204;&#23637;&#31034;&#23427;&#20204;&#22312;&#35768;&#22810;&#30456;&#20851;&#24773;&#20917;&#19979;&#26159;&#23574;&#38160;&#30340;&#12290;&#23427;&#20204;&#36824;&#20801;&#35768;&#26368;&#26497;&#31471;&#30340;&#20381;&#36182;&#32467;&#26500;&#30340;&#21487;&#35299;&#37322;&#24615;&#12290;&#32467;&#26524;&#30452;&#25509;&#23548;&#33268;&#38543;&#26426;&#21464;&#37327;&#21644;&#30340;&#20998;&#24067;&#30028;&#38480;&#19982;&#20219;&#24847;&#30456;&#20851;&#24615;&#30340;&#38543;&#26426;&#21464;&#37327;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#39118;&#38505;&#31649;&#29702;&#21644;&#32463;&#27982;&#23398;&#20013;&#30340;&#30456;&#20851;&#24212;&#29992;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
Quantile aggregation with dependence uncertainty has a long history in probability theory with wide applications in finance, risk management, statistics, and operations research. Using a recent result on inf-convolution of quantile-based risk measures, we establish new analytical bounds for quantile aggregation which we call convolution bounds. Convolution bounds both unify every analytical result available in quantile aggregation and enlighten our understanding of these methods. These bounds are the best available in general. Moreover, convolution bounds are easy to compute, and we show that they are sharp in many relevant cases. They also allow for interpretability on the extremal dependence structure. The results directly lead to bounds on the distribution of the sum of random variables with arbitrary dependence. We discuss relevant applications in risk management and economics.
&lt;/p&gt;</description></item></channel></rss>