<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#27704;&#20037;&#26399;&#36135;&#30340;&#23450;&#20215;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#21508;&#31181;&#27704;&#20037;&#26399;&#36135;&#21512;&#32422;&#30340;&#26080;&#22871;&#21033;&#20215;&#26684;&#34920;&#36798;&#24335;&#12290;&#30740;&#31350;&#21457;&#29616;&#26399;&#36135;&#20215;&#26684;&#26159;&#26681;&#25454;&#39118;&#38505;&#20013;&#24615;&#39044;&#26399;&#20197;&#21450;&#21453;&#26144;&#20215;&#26684;&#38170;&#23450;&#31243;&#24230;&#30340;&#38543;&#26426;&#26102;&#38388;&#25277;&#26679;&#24471;&#21040;&#30340;&#12290;&#27492;&#22806;&#65292;&#36824;&#36890;&#36807;&#21160;&#24577;&#20132;&#26131;&#22797;&#21046;&#35777;&#26126;&#20102;&#19968;&#20123;&#34701;&#36164;&#35268;&#26684;&#20445;&#35777;&#26399;&#36135;&#21644;&#29616;&#36135;&#20215;&#26684;&#19968;&#33268;&#12290;</title><link>http://arxiv.org/abs/2310.11771</link><description>&lt;p&gt;
&#27704;&#20037;&#26399;&#36135;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
Perpetual Futures Pricing. (arXiv:2310.11771v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.11771
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#27704;&#20037;&#26399;&#36135;&#30340;&#23450;&#20215;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#21508;&#31181;&#27704;&#20037;&#26399;&#36135;&#21512;&#32422;&#30340;&#26080;&#22871;&#21033;&#20215;&#26684;&#34920;&#36798;&#24335;&#12290;&#30740;&#31350;&#21457;&#29616;&#26399;&#36135;&#20215;&#26684;&#26159;&#26681;&#25454;&#39118;&#38505;&#20013;&#24615;&#39044;&#26399;&#20197;&#21450;&#21453;&#26144;&#20215;&#26684;&#38170;&#23450;&#31243;&#24230;&#30340;&#38543;&#26426;&#26102;&#38388;&#25277;&#26679;&#24471;&#21040;&#30340;&#12290;&#27492;&#22806;&#65292;&#36824;&#36890;&#36807;&#21160;&#24577;&#20132;&#26131;&#22797;&#21046;&#35777;&#26126;&#20102;&#19968;&#20123;&#34701;&#36164;&#35268;&#26684;&#20445;&#35777;&#26399;&#36135;&#21644;&#29616;&#36135;&#20215;&#26684;&#19968;&#33268;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27704;&#20037;&#26399;&#36135;&#26159;&#27809;&#26377;&#21040;&#26399;&#26085;&#26399;&#30340;&#21512;&#32422;&#65292;&#36890;&#36807;&#38271;&#26399;&#21521;&#31354;&#22836;&#25903;&#20184;&#23450;&#26399;&#34701;&#36164;&#26469;&#30830;&#20445;&#26399;&#36135;&#20215;&#26684;&#19982;&#29616;&#36135;&#20215;&#26684;&#30340;&#38170;&#23450;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#21508;&#31181;&#27704;&#20037;&#26399;&#36135;&#30340;&#26080;&#22871;&#21033;&#20215;&#26684;&#30340;&#26126;&#30830;&#34920;&#36798;&#24335;&#65292;&#21253;&#25324;&#32447;&#24615;&#12289;&#21453;&#21521;&#21644;&#37327;&#21270;&#26399;&#36135;&#65292;&#22312;&#31163;&#25955;&#21644;&#36830;&#32493;&#26102;&#38388;&#19979;&#30740;&#31350;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#34920;&#26126;&#26399;&#36135;&#20215;&#26684;&#30001;&#39118;&#38505;&#20013;&#24615;&#39044;&#26399;&#22312;&#21453;&#26144;&#20215;&#26684;&#38170;&#23450;&#23494;&#38598;&#24230;&#30340;&#38543;&#26426;&#26102;&#38388;&#25277;&#26679;&#24471;&#21040;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#21487;&#20197;&#20445;&#35777;&#26399;&#36135;&#21644;&#29616;&#36135;&#20215;&#26684;&#30456;&#19968;&#33268;&#30340;&#34701;&#36164;&#35268;&#26684;&#65292;&#24182;&#19988;&#35777;&#26126;&#23545;&#20110;&#36825;&#20123;&#35268;&#26684;&#65292;&#21487;&#20197;&#36890;&#36807;&#21407;&#22987;&#35777;&#21048;&#30340;&#21160;&#24577;&#20132;&#26131;&#22797;&#21046;&#27704;&#20037;&#26399;&#36135;&#21512;&#32422;&#12290;
&lt;/p&gt;
&lt;p&gt;
Perpetual futures are contracts without expiration date in which the anchoring of the futures price to the spot price is ensured by periodic funding payments from long to short. We derive explicit expressions for the no-arbitrage price of various perpetual contracts, including linear, inverse, and quantos futures in both discrete and continuous-time. In particular, we show that the futures price is given by the risk-neutral expectation of the spot sampled at a random time that reflects the intensity of the price anchoring. Furthermore, we identify funding specifications that guarantee the coincidence of futures and spot prices, and show that for such specifications perpetual futures contracts can be replicated by dynamic trading in primitive securities.
&lt;/p&gt;</description></item><item><title>&#36825;&#20010;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#38543;&#26426;Solow&#22686;&#38271;&#27169;&#22411;&#30340;&#20551;&#35774;&#65292;&#35813;&#27169;&#22411;&#23558;&#20648;&#33988;&#27604;&#20363;&#35774;&#23450;&#20026;&#20154;&#22343;&#36164;&#26412;&#30340;S&#24418;&#20989;&#25968;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#31283;&#24577;&#27010;&#29575;&#20998;&#24067;&#12290;</title><link>http://arxiv.org/abs/2310.09098</link><description>&lt;p&gt;
&#22686;&#38271;&#65292;&#36139;&#22256;&#38519;&#38449;&#21644;&#36867;&#33073;
&lt;/p&gt;
&lt;p&gt;
Growth, Poverty Trap and Escape. (arXiv:2310.09098v1 [physics.soc-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09098
&lt;/p&gt;
&lt;p&gt;
&#36825;&#20010;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#38543;&#26426;Solow&#22686;&#38271;&#27169;&#22411;&#30340;&#20551;&#35774;&#65292;&#35813;&#27169;&#22411;&#23558;&#20648;&#33988;&#27604;&#20363;&#35774;&#23450;&#20026;&#20154;&#22343;&#36164;&#26412;&#30340;S&#24418;&#20989;&#25968;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#31283;&#24577;&#27010;&#29575;&#20998;&#24067;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33879;&#21517;&#30340;Solow&#22686;&#38271;&#27169;&#22411;&#26159;&#32463;&#27982;&#22686;&#38271;&#29702;&#35770;&#20013;&#30340;&#22522;&#26412;&#27169;&#22411;&#65292;&#30740;&#31350;&#36164;&#26412;&#31215;&#32047;&#19982;&#26102;&#38388;&#30340;&#20851;&#31995;&#65292;&#20854;&#20013;&#36164;&#26412;&#23384;&#37327;&#12289;&#21171;&#21160;&#21147;&#21644;&#25216;&#26415;&#25928;&#29575;&#26159;&#20854;&#22522;&#26412;&#35201;&#32032;&#12290;&#36164;&#26412;&#34987;&#20551;&#35774;&#20026;&#21046;&#36896;&#35774;&#22791;&#21644;&#26448;&#26009;&#30340;&#24418;&#24335;&#12290;&#27169;&#22411;&#30340;&#20004;&#20010;&#37325;&#35201;&#21442;&#25968;&#26159;&#65306;&#29983;&#20135;&#20989;&#25968;&#20135;&#20986;&#30340;&#20648;&#33988;&#27604;&#20363;$s$&#21644;&#20986;&#29616;&#22312;&#29983;&#20135;&#20989;&#25968;&#20013;&#30340;&#25216;&#26415;&#25928;&#29575;&#21442;&#25968;$A$&#12290;&#20648;&#33988;&#27604;&#20363;&#30340;&#20135;&#20986;&#20840;&#37096;&#29992;&#20110;&#29983;&#25104;&#26032;&#30340;&#36164;&#26412;&#65292;&#21097;&#19979;&#30340;&#21017;&#34987;&#28040;&#36153;&#12290;&#36164;&#26412;&#23384;&#37327;&#36824;&#20250;&#38543;&#26102;&#38388;&#36880;&#28176;&#20943;&#23569;&#65292;&#21407;&#22240;&#26159;&#26087;&#36164;&#26412;&#30340;&#30952;&#25439;&#20197;&#21450;&#21171;&#21160;&#21147;&#20154;&#21475;&#30340;&#22686;&#21152;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20551;&#35774;&#20648;&#33988;&#27604;&#20363;&#26159;&#20154;&#22343;&#36164;&#26412;$k_p$&#30340;S&#24418;&#20989;&#25968;&#30340;&#38543;&#26426;Solow&#22686;&#38271;&#27169;&#22411;&#12290;&#25105;&#20204;&#20174;&#35299;&#26512;&#19978;&#25512;&#23548;&#20986;&#31283;&#24577;&#27010;&#29575;&#20998;&#24067;$P(k_p)$&#24182;&#23637;&#31034;&#20102;&#8230;
&lt;/p&gt;
&lt;p&gt;
The well-known Solow growth model is the workhorse model of the theory of economic growth, which studies capital accumulation in a model economy as a function of time with capital stock, labour and technology efiiciency as the basic ingredients. The capital is assumed to be in the form of manufacturing equipments and materials. Two important parameters of the model are: the saving fraction $s$ of the output of a production function and the technology efficiency parameter $A$, appearing in the production function. The saved fraction of the output is fully invested in the generation of new capital and the rest is consumed. The capital stock also depreciates as a function of time due to the wearing out of old capital and the increase in the size of the labour population. We propose a stochastic Solow growth model assuming the saving fraction to be a sigmoidal function of the per capita capital $k_p$. We derive analytically the steady state probability distribution $P(k_p)$ and demonstrate
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#36890;&#36807;&#38543;&#26426;&#24494;&#20998;&#21338;&#24328;&#26041;&#27861;&#30740;&#31350;&#20102;&#40065;&#26834;&#30340;&#26102;&#38388;&#19981;&#19968;&#33268;&#24615;&#32447;&#24615;&#20108;&#27425;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#23454;&#29616;&#32435;&#20160;&#24179;&#34913;&#30340;&#20805;&#20998;&#26465;&#20214;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#26102;&#38388;&#19981;&#19968;&#33268;&#24615;&#24773;&#20917;&#19979;&#65292;&#27169;&#31946;&#21388;&#24694;&#27604;&#32447;&#24615;&#21388;&#24694;&#26356;&#24555;&#22686;&#24378;&#39118;&#38505;&#21388;&#24694;&#12290;</title><link>http://arxiv.org/abs/2306.16982</link><description>&lt;p&gt;
&#40065;&#26834;&#30340;&#26102;&#38388;&#19981;&#19968;&#33268;&#24615;&#32447;&#24615;&#20108;&#27425;&#38543;&#26426;&#25511;&#21046;&#65306;&#19968;&#31181;&#38543;&#26426;&#24494;&#20998;&#21338;&#24328;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Robust Time-inconsistent Linear-Quadratic Stochastic Controls: A Stochastic Differential Game Approach. (arXiv:2306.16982v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.16982
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#36890;&#36807;&#38543;&#26426;&#24494;&#20998;&#21338;&#24328;&#26041;&#27861;&#30740;&#31350;&#20102;&#40065;&#26834;&#30340;&#26102;&#38388;&#19981;&#19968;&#33268;&#24615;&#32447;&#24615;&#20108;&#27425;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#23454;&#29616;&#32435;&#20160;&#24179;&#34913;&#30340;&#20805;&#20998;&#26465;&#20214;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#26102;&#38388;&#19981;&#19968;&#33268;&#24615;&#24773;&#20917;&#19979;&#65292;&#27169;&#31946;&#21388;&#24694;&#27604;&#32447;&#24615;&#21388;&#24694;&#26356;&#24555;&#22686;&#24378;&#39118;&#38505;&#21388;&#24694;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36890;&#36807;&#38543;&#26426;&#24494;&#20998;&#21338;&#24328;&#24314;&#31435;&#30340;&#40065;&#26834;&#26102;&#38388;&#19981;&#19968;&#33268;&#24615;&#65288;TIC&#65289;&#32447;&#24615;&#20108;&#27425;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#12290;&#36890;&#36807;&#23574;&#23792;&#21464;&#24322;&#26041;&#27861;&#65292;&#25105;&#20204;&#24471;&#20986;&#23454;&#29616;&#32435;&#20160;&#24179;&#34913;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#35813;&#24179;&#34913;&#23545;&#24212;&#20110;&#19968;&#31181;&#26102;&#38388;&#19968;&#33268;&#65288;TC&#65289;&#30340;&#40065;&#26834;&#31574;&#30053;&#65292;&#22312;&#28201;&#21644;&#30340;&#25216;&#26415;&#20551;&#35774;&#19979;&#25104;&#31435;&#12290;&#20026;&#20102;&#35828;&#26126;&#25105;&#20204;&#30340;&#26694;&#26550;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#20004;&#31181;&#40065;&#26834;&#22343;&#20540;&#8211;&#26041;&#24046;&#20998;&#26512;&#30340;&#24773;&#26223;&#65292;&#21363;&#29366;&#24577;&#21644;&#25511;&#21046;&#20381;&#36182;&#30340;&#27169;&#31946;&#21388;&#24694;&#12290;&#25105;&#20204;&#36890;&#36807;&#25968;&#20540;&#23454;&#39564;&#21457;&#29616;&#65292;&#22312;&#26102;&#38388;&#19981;&#19968;&#33268;&#24615;&#22256;&#25200;&#19979;&#30340;&#21160;&#24577;&#26368;&#20248;&#25511;&#21046;&#20013;&#65292;&#27169;&#31946;&#21388;&#24694;&#27604;&#32447;&#24615;&#26356;&#24555;&#22686;&#24378;&#26377;&#25928;&#39118;&#38505;&#21388;&#24694;&#65292;&#36825;&#24847;&#21619;&#30528;&#22312;TIC&#24773;&#20917;&#19979;&#30340;&#27169;&#31946;&#24615;&#27604;&#22312;TC&#24773;&#20917;&#19979;&#30340;&#24433;&#21709;&#26356;&#22823;&#65292;&#20363;&#22914;&#39044;&#26399;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies robust time-inconsistent (TIC) linear-quadratic stochastic control problems, formulated by stochastic differential games. By a spike variation approach, we derive sufficient conditions for achieving the Nash equilibrium, which corresponds to a time-consistent (TC) robust policy, under mild technical assumptions. To illustrate our framework, we consider two scenarios of robust mean-variance analysis, namely with state- and control-dependent ambiguity aversion. We find numerically that with time inconsistency haunting the dynamic optimal controls, the ambiguity aversion enhances the effective risk aversion faster than the linear, implying that the ambiguity in the TIC cases is more impactful than that under the TC counterparts, e.g., expected utility maximization problems.
&lt;/p&gt;</description></item></channel></rss>