<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#35780;&#20272;&#20102;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#22312;&#32929;&#24066;&#20215;&#26684;&#39044;&#27979;&#20013;&#30340;&#24615;&#33021;&#65292;&#36890;&#36807;&#36873;&#25321;&#26368;&#20339;&#30340;&#25216;&#26415;&#25351;&#26631;&#32452;&#21512;&#26469;&#23454;&#29616;&#26368;&#23569;&#35823;&#24046;&#30340;&#39044;&#27979;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#19981;&#21516;&#30340;&#21253;&#35013;&#22120;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#22312;&#19981;&#21516;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#20013;&#20855;&#26377;&#19981;&#21516;&#30340;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2310.09903</link><description>&lt;p&gt;
&#35780;&#20272;&#29305;&#24449;&#36873;&#25321;&#22312;&#32929;&#24066;&#20215;&#26684;&#39044;&#27979;&#20013;&#30340;&#24615;&#33021;&#65292;&#20197;&#30830;&#23450;&#26368;&#26377;&#25928;&#30340;&#25216;&#26415;&#25351;&#26631;
&lt;/p&gt;
&lt;p&gt;
Evaluation of feature selection performance for identification of best effective technical indicators on stock market price prediction. (arXiv:2310.09903v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09903
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35780;&#20272;&#20102;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#22312;&#32929;&#24066;&#20215;&#26684;&#39044;&#27979;&#20013;&#30340;&#24615;&#33021;&#65292;&#36890;&#36807;&#36873;&#25321;&#26368;&#20339;&#30340;&#25216;&#26415;&#25351;&#26631;&#32452;&#21512;&#26469;&#23454;&#29616;&#26368;&#23569;&#35823;&#24046;&#30340;&#39044;&#27979;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#19981;&#21516;&#30340;&#21253;&#35013;&#22120;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#22312;&#19981;&#21516;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#20013;&#20855;&#26377;&#19981;&#21516;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37492;&#20110;&#25216;&#26415;&#25351;&#26631;&#23545;&#32929;&#24066;&#39044;&#27979;&#30340;&#24433;&#21709;&#65292;&#29305;&#24449;&#36873;&#25321;&#23545;&#36873;&#25321;&#26368;&#20339;&#25351;&#26631;&#33267;&#20851;&#37325;&#35201;&#12290;&#19968;&#31181;&#32771;&#34385;&#22312;&#29305;&#24449;&#36873;&#25321;&#36807;&#31243;&#20013;&#27169;&#22411;&#24615;&#33021;&#30340;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#26159;&#21253;&#35013;&#22120;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#36890;&#36807;&#29305;&#24449;&#36873;&#25321;&#37492;&#23450;&#20986;&#26368;&#23569;&#35823;&#24046;&#30340;&#39044;&#27979;&#32929;&#24066;&#20215;&#26684;&#30340;&#26368;&#20339;&#32929;&#24066;&#25351;&#26631;&#32452;&#21512;&#12290;&#20026;&#35780;&#20272;&#21253;&#35013;&#22120;&#29305;&#24449;&#36873;&#25321;&#25216;&#26415;&#23545;&#32929;&#24066;&#39044;&#27979;&#30340;&#24433;&#21709;&#65292;&#26412;&#25991;&#22312;&#36807;&#21435;10&#24180;&#33529;&#26524;&#20844;&#21496;&#30340;&#25968;&#25454;&#19978;&#20351;&#29992;&#20102;10&#20010;&#35780;&#20272;&#22120;&#21644;123&#20010;&#25216;&#26415;&#25351;&#26631;&#36827;&#34892;&#20102;SFS&#21644;SBS&#30340;&#32771;&#23519;&#12290;&#27492;&#22806;&#65292;&#36890;&#36807;&#25552;&#20986;&#30340;&#26041;&#27861;&#65292;&#23558;&#30001;3&#22825;&#26102;&#38388;&#31383;&#21475;&#21019;&#24314;&#30340;&#25968;&#25454;&#36716;&#21270;&#20026;&#36866;&#29992;&#20110;&#22238;&#24402;&#26041;&#27861;&#30340;&#36755;&#20837;&#12290;&#20174;&#35266;&#23519;&#32467;&#26524;&#21487;&#20197;&#24471;&#20986;&#65306;&#65288;1&#65289;&#27599;&#31181;&#21253;&#35013;&#22120;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#22312;&#19981;&#21516;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#20013;&#20855;&#26377;&#19981;&#21516;&#30340;&#32467;&#26524;&#65292;&#27599;&#31181;&#26041;&#27861;&#22312;&#19981;&#21516;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#19978;&#20063;&#26377;&#25152;&#19981;&#21516;&#12290;
&lt;/p&gt;
&lt;p&gt;
Due to the influence of many factors, including technical indicators on stock market prediction, feature selection is important to choose the best indicators. One of the feature selection methods that consider the performance of models during feature selection is the wrapper feature selection method. The aim of this research is to identify a combination of the best stock market indicators through feature selection to predict the stock market price with the least error. In order to evaluate the impact of wrapper feature selection techniques on stock market prediction, in this paper SFS and SBS with 10 estimators and 123 technical indicators have been examined on the last 10 years of Apple Company. Also, by the proposed method, the data created by the 3-day time window were converted to the appropriate input for regression methods. Based on the results observed: (1) Each wrapper feature selection method has different results with different machine learning methods, and each method is mor
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;&#23558;&#24615;&#21035;&#24179;&#31561;&#32435;&#20837;&#21733;&#20262;&#27604;&#20122;&#23466;&#27861;&#23545;&#24615;&#21035;&#24179;&#31561;&#24577;&#24230;&#12289;&#24615;&#21035;&#27495;&#35270;&#32463;&#21382;&#21644;&#21171;&#21160;&#21147;&#24066;&#22330;&#21442;&#19982;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22899;&#24615;&#30340;&#21171;&#21160;&#21147;&#24066;&#22330;&#21442;&#19982;&#26174;&#33879;&#22686;&#21152;&#65292;&#21516;&#26102;&#30007;&#24615;&#23545;&#24615;&#21035;&#24179;&#31561;&#25345;&#26356;&#22823;&#30340;&#25903;&#25345;&#65292;&#22899;&#24615;&#32463;&#21382;&#30340;&#24615;&#21035;&#27495;&#35270;&#20943;&#23569;&#12290;&#36825;&#34920;&#26126;&#22312;&#23478;&#24237;&#20013;&#23384;&#22312;&#25345;&#32493;&#30340;&#26435;&#21147;&#26007;&#20105;&#12290;</title><link>http://arxiv.org/abs/2307.08869</link><description>&lt;p&gt;
&#25991;&#21270;&#12289;&#24615;&#21035;&#21644;&#21171;&#21160;&#21147;&#21442;&#19982;&#65306;&#26469;&#33258;&#21733;&#20262;&#27604;&#20122;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Culture, Gender, and Labor Force Participation: Evidence from Colombia. (arXiv:2307.08869v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.08869
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;&#23558;&#24615;&#21035;&#24179;&#31561;&#32435;&#20837;&#21733;&#20262;&#27604;&#20122;&#23466;&#27861;&#23545;&#24615;&#21035;&#24179;&#31561;&#24577;&#24230;&#12289;&#24615;&#21035;&#27495;&#35270;&#32463;&#21382;&#21644;&#21171;&#21160;&#21147;&#24066;&#22330;&#21442;&#19982;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22899;&#24615;&#30340;&#21171;&#21160;&#21147;&#24066;&#22330;&#21442;&#19982;&#26174;&#33879;&#22686;&#21152;&#65292;&#21516;&#26102;&#30007;&#24615;&#23545;&#24615;&#21035;&#24179;&#31561;&#25345;&#26356;&#22823;&#30340;&#25903;&#25345;&#65292;&#22899;&#24615;&#32463;&#21382;&#30340;&#24615;&#21035;&#27495;&#35270;&#20943;&#23569;&#12290;&#36825;&#34920;&#26126;&#22312;&#23478;&#24237;&#20013;&#23384;&#22312;&#25345;&#32493;&#30340;&#26435;&#21147;&#26007;&#20105;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;&#23558;&#24615;&#21035;&#24179;&#31561;&#32435;&#20837;1991&#24180;&#21733;&#20262;&#27604;&#20122;&#23466;&#27861;&#23545;&#24615;&#21035;&#24179;&#31561;&#24577;&#24230;&#12289;&#22522;&#20110;&#24615;&#21035;&#30340;&#27495;&#35270;&#32463;&#21382;&#21644;&#21171;&#21160;&#21147;&#24066;&#22330;&#21442;&#19982;&#30340;&#24433;&#21709;&#12290;&#20351;&#29992;&#24046;&#24322;&#30740;&#31350;&#26041;&#27861;&#65292;&#25105;&#20204;&#27604;&#36739;&#20102;&#25509;&#21463;&#20041;&#21153;&#39640;&#20013;&#35838;&#31243;&#12298;&#23466;&#27861;&#12299;&#30340;&#20010;&#20307;&#19982;&#26410;&#25509;&#21463;&#30340;&#20010;&#20307;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#26174;&#31034;&#65292;&#21171;&#21160;&#21147;&#24066;&#22330;&#21442;&#19982;&#26174;&#33879;&#22686;&#21152;&#65292;&#20027;&#35201;&#30001;&#22899;&#24615;&#25512;&#21160;&#12290;&#25509;&#21463;&#36825;&#20123;&#35838;&#31243;&#20063;&#24433;&#21709;&#20102;&#24615;&#21035;&#24179;&#31561;&#30340;&#24577;&#24230;&#65292;&#30007;&#24615;&#34920;&#29616;&#20986;&#26356;&#22823;&#30340;&#25903;&#25345;&#12290;&#22899;&#24615;&#25253;&#21578;&#31216;&#32463;&#21382;&#30340;&#22522;&#20110;&#24615;&#21035;&#30340;&#27495;&#35270;&#36739;&#23569;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#22899;&#24615;&#22686;&#21152;&#30340;&#21171;&#21160;&#21147;&#24066;&#22330;&#21442;&#19982;&#19981;&#22826;&#21487;&#33021;&#26159;&#30001;&#20110;&#30007;&#24615;&#20276;&#20387;&#20943;&#23569;&#20102;&#38556;&#30861;&#12290;&#30007;&#24615;&#21644;&#22899;&#24615;&#23545;&#20110;&#23478;&#24237;&#39046;&#22495;&#30340;&#20256;&#32479;&#24615;&#21035;&#35268;&#33539;&#30340;&#24847;&#35265;&#23384;&#22312;&#24046;&#24322;&#65292;&#31361;&#26174;&#20102;&#23478;&#24237;&#20869;&#37096;&#30340;&#26435;&#21147;&#26007;&#20105;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study investigates the impact of integrating gender equality into the Colombian constitution of 1991 on attitudes towards gender equality, experiences of gender-based discrimination, and labor market participation. Using a difference-in-discontinuities framework, we compare individuals exposed to mandatory high school courses on the Constitution with those who were not exposed. Our findings show a significant increase in labor market participation, primarily driven by women. Exposure to these courses also shapes attitudes towards gender equality, with men demonstrating greater support. Women report experiencing less gender-based discrimination. Importantly, our results suggest that women's increased labor market participation is unlikely due to reduced barriers from male partners. A disparity in opinions regarding traditional gender norms concerning household domains is observed between men and women, highlighting an ongoing power struggle within the home. However, the presence of
&lt;/p&gt;</description></item></channel></rss>