<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#24320;&#28304;&#30340;&#30005;&#21147;&#37096;&#38376;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;2030&#24180;&#24503;&#22269;&#22823;&#35268;&#27169;&#25193;&#24352;&#20998;&#25955;&#24335;&#28909;&#27893;&#23545;&#30005;&#21147;&#37096;&#38376;&#30340;&#24433;&#21709;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#28909;&#27893;&#30340;&#25512;&#24191;&#21487;&#20197;&#36890;&#36807;&#22826;&#38451;&#33021;&#20809;&#20239;&#31561;&#21487;&#20877;&#29983;&#33021;&#28304;&#23454;&#29616;&#65292;&#19988;&#39069;&#22806;&#30340;&#22791;&#29992;&#23481;&#37327;&#21644;&#30005;&#21147;&#20648;&#23384;&#38656;&#27714;&#26377;&#38480;&#12290;</title><link>http://arxiv.org/abs/2307.12918</link><description>&lt;p&gt;
&#28789;&#27963;&#30340;&#28909;&#27893;&#65306;&#22312;&#21487;&#20877;&#29983;&#33021;&#28304;&#39046;&#22495;&#20013;&#30340;&#30005;&#21147;&#37096;&#38376;&#20013;&#26159;&#24517;&#38656;&#36824;&#26159;&#21487;&#36873;&#65311;
&lt;/p&gt;
&lt;p&gt;
Flexible heat pumps: must-have or nice to have in a power sector with renewables?. (arXiv:2307.12918v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.12918
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#24320;&#28304;&#30340;&#30005;&#21147;&#37096;&#38376;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;2030&#24180;&#24503;&#22269;&#22823;&#35268;&#27169;&#25193;&#24352;&#20998;&#25955;&#24335;&#28909;&#27893;&#23545;&#30005;&#21147;&#37096;&#38376;&#30340;&#24433;&#21709;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#28909;&#27893;&#30340;&#25512;&#24191;&#21487;&#20197;&#36890;&#36807;&#22826;&#38451;&#33021;&#20809;&#20239;&#31561;&#21487;&#20877;&#29983;&#33021;&#28304;&#23454;&#29616;&#65292;&#19988;&#39069;&#22806;&#30340;&#22791;&#29992;&#23481;&#37327;&#21644;&#30005;&#21147;&#20648;&#23384;&#38656;&#27714;&#26377;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28909;&#27893;&#26159;&#20943;&#23569;&#20379;&#26262;&#39046;&#22495;&#21270;&#30707;&#29123;&#26009;&#20351;&#29992;&#30340;&#20851;&#38190;&#25216;&#26415;&#12290;&#21521;&#28909;&#27893;&#30340;&#36716;&#21464;&#24847;&#21619;&#30528;&#20908;&#23395;&#23506;&#20919;&#26376;&#20221;&#30005;&#21147;&#38656;&#27714;&#30340;&#22686;&#21152;&#12290;&#20351;&#29992;&#24320;&#28304;&#30340;&#30005;&#21147;&#37096;&#38376;&#27169;&#22411;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;2030&#24180;&#24503;&#22269;&#30340;&#20998;&#25955;&#24335;&#28909;&#27893;&#22823;&#35268;&#27169;&#25193;&#24352;&#23545;&#30005;&#21147;&#37096;&#38376;&#30340;&#24433;&#21709;&#65292;&#32467;&#21512;&#19981;&#21516;&#35268;&#27169;&#30340;&#32531;&#20914;&#28909;&#23384;&#20648;&#12290;&#20551;&#35774;&#28909;&#27893;&#39069;&#22806;&#20351;&#29992;&#30340;&#30005;&#21147;&#22312;&#24180;&#24230;&#24179;&#34913;&#20013;&#24517;&#39035;&#23436;&#20840;&#30001;&#21487;&#20877;&#29983;&#33021;&#28304;&#35206;&#30422;&#65292;&#25105;&#20204;&#37327;&#21270;&#20102;&#21487;&#20877;&#29983;&#33021;&#28304;&#25152;&#38656;&#30340;&#39069;&#22806;&#25237;&#36164;&#12290;&#22914;&#26524;&#39118;&#21147;&#25193;&#24352;&#28508;&#21147;&#26377;&#38480;&#65292;&#28909;&#27893;&#30340;&#25512;&#24191;&#20063;&#21487;&#20197;&#36890;&#36807;&#22826;&#38451;&#33021;&#20809;&#20239;&#22312;&#27431;&#27954;&#20114;&#32852;&#36830;&#25509;&#30340;&#24773;&#20917;&#19979;&#20316;&#20026;&#38468;&#21152;&#25104;&#26412;&#36739;&#23567;&#30340;&#36873;&#25321;&#12290;&#21363;&#20351;&#22312;&#26102;&#38388;&#19978;&#19981;&#28789;&#27963;&#30340;&#28909;&#27893;&#30340;&#24773;&#20917;&#19979;&#65292;&#23545;&#39069;&#22806;&#22791;&#29992;&#23481;&#37327;&#21644;&#30005;&#21147;&#20648;&#23384;&#30340;&#38656;&#27714;&#36890;&#24120;&#20173;&#28982;&#26377;&#38480;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#21457;&#29616;&#65292;&#22312;2&#33267;6&#23567;&#26102;&#30340;&#36739;&#23567;&#28909;&#23384;&#20648;&#23481;&#37327;&#19979;&#65292;&#31995;&#32479;&#30340;&#20379;&#38656;&#24179;&#34913;&#20173;&#28982;&#33021;&#22815;&#24471;&#21040;&#28385;&#36275;&#12290;
&lt;/p&gt;
&lt;p&gt;
Heat pumps are a key technology for reducing fossil fuel use in the heating sector. A transition to heat pumps implies an increase in electricity demand, especially in cold winter months. Using an open-source power sector model, we examine the power sector impacts of a massive expansion of decentralized heat pumps in Germany in 2030, combined with buffer heat storage of different sizes. Assuming that the additional electricity used by heat pumps has to be fully covered by renewable energies in a yearly balance, we quantify the required additional investments in renewable energy sources. If wind power expansion potentials are limited, the roll-out of heat pumps can also be accompanied by solar PV with little additional costs, making use of the European interconnection. The need for additional firm capacity and electricity storage generally remains limited even in the case of temporally inflexible heat pumps. We further find that relatively small heat storage capacities of 2 to 6 hours c
&lt;/p&gt;</description></item></channel></rss>