<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#8220;&#25042;&#24816;&#22240;&#23376;&#8221;&#21644;&#27010;&#29575;&#21152;&#26435;&#26469;&#20248;&#21270;&#25237;&#36164;&#31574;&#30053;&#30340;&#27169;&#22411;&#12290;&#36890;&#36807;&#20215;&#26684;&#32452;&#21512;&#39044;&#27979;&#21644;&#22343;&#20540;&#26041;&#24046;&#27169;&#22411;&#26041;&#27861;&#65292;&#23454;&#29616;&#25237;&#36164;&#39118;&#38505;&#19982;&#22238;&#25253;&#20043;&#38388;&#30340;&#26368;&#20248;&#24179;&#34913;&#12290;</title><link>http://arxiv.org/abs/2306.07928</link><description>&lt;p&gt;
&#24102;&#26377;&#27010;&#29575;&#21152;&#26435;&#30340;&#8220;&#25042;&#24816;&#22240;&#23376;&#8221;&#30340;&#20248;&#21270;&#25237;&#36164;&#31574;&#30053;&#65306;&#32467;&#21512;&#20132;&#26131;&#25104;&#26412;&#30340;&#20215;&#26684;&#32452;&#21512;&#39044;&#27979;&#21644;&#22343;&#20540;&#26041;&#24046;&#27169;&#22411;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Optimizing Investment Strategies with Lazy Factor and Probability Weighting: A Price Portfolio Forecasting and Mean-Variance Model with Transaction Costs Approach. (arXiv:2306.07928v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.07928
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#8220;&#25042;&#24816;&#22240;&#23376;&#8221;&#21644;&#27010;&#29575;&#21152;&#26435;&#26469;&#20248;&#21270;&#25237;&#36164;&#31574;&#30053;&#30340;&#27169;&#22411;&#12290;&#36890;&#36807;&#20215;&#26684;&#32452;&#21512;&#39044;&#27979;&#21644;&#22343;&#20540;&#26041;&#24046;&#27169;&#22411;&#26041;&#27861;&#65292;&#23454;&#29616;&#25237;&#36164;&#39118;&#38505;&#19982;&#22238;&#25253;&#20043;&#38388;&#30340;&#26368;&#20248;&#24179;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24066;&#22330;&#20132;&#26131;&#21592;&#24120;&#24120;&#36890;&#36807;&#39057;&#32321;&#20132;&#26131;&#27874;&#21160;&#24615;&#36164;&#20135;&#26469;&#20248;&#21270;&#20182;&#20204;&#30340;&#24635;&#22238;&#25253;&#12290;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25237;&#36164;&#31574;&#30053;&#27169;&#22411;&#65292;&#22522;&#20110;&#8220;&#25042;&#24816;&#22240;&#23376;&#8221;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20998;&#20026;&#20215;&#26684;&#32452;&#21512;&#39044;&#27979;&#27169;&#22411;&#21644;&#32467;&#21512;&#20132;&#26131;&#25104;&#26412;&#30340;&#22343;&#20540;&#26041;&#24046;&#27169;&#22411;&#12290;&#36890;&#36807;&#27010;&#29575;&#21152;&#26435;&#20316;&#20026;&#25042;&#24816;&#22240;&#23376;&#30340;&#31995;&#25968;&#65292;&#23454;&#29616;&#20102;&#22312;&#39118;&#38505;&#21644;&#22238;&#25253;&#20043;&#38388;&#36798;&#21040;&#26368;&#20248;&#24179;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;
Market traders often engage in the frequent transaction of volatile assets to optimize their total return. In this study, we introduce a novel investment strategy model, anchored on the 'lazy factor.' Our approach bifurcates into a Price Portfolio Forecasting Model and a Mean-Variance Model with Transaction Costs, utilizing probability weights as the coefficients of laziness factors. The Price Portfolio Forecasting Model, leveraging the EXPMA Mean Method, plots the long-term price trend line and forecasts future price movements, incorporating the tangent slope and rate of change. For short-term investments, we apply the ARIMA Model to predict ensuing prices. The Mean-Variance Model with Transaction Costs employs the Monte Carlo Method to formulate the feasible region. To strike an optimal balance between risk and return, equal probability weights are incorporated as coefficients of the laziness factor. To assess the efficacy of this combined strategy, we executed extensive experiments 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#30005;&#21147;&#24066;&#22330;&#20013;&#30340;&#30005;&#20215;&#27874;&#21160;&#27169;&#22411;&#65292;&#24182;&#21457;&#29616;&#22312;&#38750;&#21361;&#26426;&#26102;&#26399;&#22235;&#22240;&#23376;&#27169;&#22411;&#27604;&#19977;&#22240;&#23376;&#27169;&#22411;&#26356;&#20026;&#36866;&#29992;&#12290;</title><link>http://arxiv.org/abs/2306.07731</link><description>&lt;p&gt;
&#30005;&#21147;&#24066;&#22330;&#20013;&#30340;&#22823;&#22411;&#30005;&#20215;&#27874;&#21160;&#24314;&#27169;
&lt;/p&gt;
&lt;p&gt;
Modeling Large Spot Price Deviations in Electricity Markets. (arXiv:2306.07731v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.07731
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#30005;&#21147;&#24066;&#22330;&#20013;&#30340;&#30005;&#20215;&#27874;&#21160;&#27169;&#22411;&#65292;&#24182;&#21457;&#29616;&#22312;&#38750;&#21361;&#26426;&#26102;&#26399;&#22235;&#22240;&#23376;&#27169;&#22411;&#27604;&#19977;&#22240;&#23376;&#27169;&#22411;&#26356;&#20026;&#36866;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36807;&#21435;&#20004;&#24180;&#37324;&#65292;&#33021;&#28304;&#24066;&#22330;&#30340;&#19981;&#30830;&#23450;&#24615;&#22686;&#21152;&#65292;&#23548;&#33268;&#30005;&#21147;&#21363;&#26399;&#20215;&#26684;&#20986;&#29616;&#20102;&#22823;&#24133;&#27874;&#21160;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#32463;&#20856;&#19977;&#22240;&#23376;&#27169;&#22411;&#19982;&#39640;&#26031;&#22522;&#20449;&#21495;&#12289;&#19968;&#20010;&#27491;&#36339;&#36291;&#20449;&#21495;&#21644;&#19968;&#20010;&#36127;&#36339;&#36291;&#20449;&#21495;&#30340;&#25311;&#21512;&#65292;&#20197;&#21450;&#22312;&#36825;&#20010;&#26032;&#30340;&#24066;&#22330;&#29615;&#22659;&#19979;&#28155;&#21152;&#31532;&#20108;&#20010;&#39640;&#26031;&#22522;&#20449;&#21495;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#20351;&#29992;&#22522;&#20110;&#25152;&#35859;&#30340;Gibbs&#37319;&#26679;&#30340;&#39532;&#23572;&#21487;&#22827;&#38142;&#33945;&#29305;&#21345;&#32599;&#31639;&#27861;&#26469;&#26657;&#20934;&#27169;&#22411;&#12290;&#23558;&#24471;&#21040;&#30340;&#22235;&#22240;&#23376;&#27169;&#22411;&#19982;&#29305;&#23450;&#26102;&#26399;&#30340;&#19977;&#22240;&#23376;&#27169;&#22411;&#36827;&#34892;&#27604;&#36739;&#65292;&#24182;&#20351;&#29992;&#21518;&#39564;&#39044;&#27979;&#26816;&#39564;&#36827;&#34892;&#35780;&#20272;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25512;&#23548;&#20986;&#20102;&#22522;&#20110;&#22235;&#22240;&#23376;&#21363;&#26399;&#20215;&#26684;&#27169;&#22411;&#30340;&#26399;&#36135;&#21512;&#32422;&#20215;&#26684;&#30340;&#38381;&#24335;&#35299;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22235;&#22240;&#23376;&#27169;&#22411;&#22312;&#38750;&#21361;&#26426;&#26102;&#26399;&#30340;&#34920;&#29616;&#20248;&#20110;&#19977;&#22240;&#23376;&#27169;&#22411;&#12290;&#22312;&#21361;&#26426;&#26102;&#26399;&#65292;&#31532;&#20108;&#20010;&#39640;&#26031;&#22522;&#20449;&#21495;&#24182;&#27809;&#26377;&#23548;&#33268;&#26356;&#22909;&#30340;&#25311;&#21512;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
Increased insecurities on the energy markets have caused massive fluctuations of the electricity spot price within the past two years. In this work, we investigate the fit of a classical 3-factor model with a Gaussian base signal as well as one positive and one negative jump signal in this new market environment. We also study the influence of adding a second Gaussian base signal to the model. For the calibration of our model we use a Markov Chain Monte Carlo algorithm based on the so-called Gibbs sampling. The resulting 4-factor model is than compared to the 3-factor model in different time periods of particular interest and evaluated using posterior predictive checking. Additionally, we derive closed-form solutions for the price of futures contracts in our 4-factor spot price model. We find that the 4-factor model outperforms the 3-factor model in times of non-crises. In times of crises, the second Gaussian base signal does not lead to a better the fit of the model. To the best of ou
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#36890;&#36807;&#20351;&#29992;&#35797;&#28857;&#39044;&#27979;&#26550;&#26500;&#20013;&#30340;&#31639;&#27861;&#24178;&#39044;&#26469;&#25552;&#39640;&#38750;AI&#27169;&#22411;&#19979;&#38024;&#32455;&#21697;&#31867;&#21035;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#12290;&#22312;&#20915;&#31574;&#27169;&#22411;&#20013;&#21160;&#24577;&#22320;&#36873;&#25321;&#26368;&#20339;&#31639;&#27861;&#21487;&#25552;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#65292;&#24182;&#36890;&#36807;AI / ML&#39044;&#27979;&#27169;&#22411;&#20351;&#29992;&#20808;&#36827;&#30340;&#29305;&#24449;&#24037;&#31243;&#26469;&#23454;&#29616;&#12290;</title><link>http://arxiv.org/abs/2306.07305</link><description>&lt;p&gt;
&#35753;&#39044;&#27979;&#21464;&#24471;&#33258;&#23398;&#20064;&#21644;&#33258;&#36866;&#24212;--&#35797;&#28857;&#39044;&#27979;&#26550;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;
Making forecasting self-learning and adaptive -- Pilot forecasting rack. (arXiv:2306.07305v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.07305
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#36890;&#36807;&#20351;&#29992;&#35797;&#28857;&#39044;&#27979;&#26550;&#26500;&#20013;&#30340;&#31639;&#27861;&#24178;&#39044;&#26469;&#25552;&#39640;&#38750;AI&#27169;&#22411;&#19979;&#38024;&#32455;&#21697;&#31867;&#21035;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#12290;&#22312;&#20915;&#31574;&#27169;&#22411;&#20013;&#21160;&#24577;&#22320;&#36873;&#25321;&#26368;&#20339;&#31639;&#27861;&#21487;&#25552;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#65292;&#24182;&#36890;&#36807;AI / ML&#39044;&#27979;&#27169;&#22411;&#20351;&#29992;&#20808;&#36827;&#30340;&#29305;&#24449;&#24037;&#31243;&#26469;&#23454;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38646;&#21806;&#38144;&#21806;&#21644;&#20215;&#26684;&#39044;&#27979;&#36890;&#24120;&#22522;&#20110;&#26102;&#38388;&#24207;&#21015;&#39044;&#27979;&#12290;&#23545;&#20110;&#26576;&#20123;&#20135;&#21697;&#31867;&#21035;&#65292;&#39044;&#27979;&#38656;&#27714;&#30340;&#20934;&#30830;&#24615;&#36739;&#20302;&#65292;&#20250;&#23545;&#24211;&#23384;&#12289;&#36816;&#36755;&#21644;&#34917;&#36135;&#35745;&#21010;&#36896;&#25104;&#36127;&#38754;&#24433;&#21709;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#25105;&#20204;&#22522;&#20110;&#31215;&#26497;&#25506;&#32034;&#30340;&#35797;&#28857;&#28436;&#32451;&#30340;&#21457;&#29616;&#65292;&#20197;&#25506;&#32034;&#24110;&#21161;&#38646;&#21806;&#21830;&#25552;&#39640;&#27492;&#31867;&#20135;&#21697;&#31867;&#21035;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#35780;&#20272;&#20102;&#36890;&#36807;&#19968;&#20010;&#26679;&#26412;&#20135;&#21697;&#31867;&#21035;&#8220;&#38024;&#32455;&#21697;&#8221;&#25552;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#30340;&#31639;&#27861;&#24178;&#39044;&#26426;&#20250;&#12290;&#30446;&#21069;&#65292;&#38024;&#32455;&#21697;&#20135;&#21697;&#31867;&#21035;&#30340;&#39044;&#27979;&#20934;&#30830;&#24230;&#22312;&#38750;AI&#27169;&#22411;&#20013;&#30340;&#33539;&#22260;&#20026;60%&#12290;&#25105;&#20204;&#25506;&#32034;&#20102;&#22914;&#20309;&#20351;&#29992;&#26550;&#26500;&#26041;&#27861;&#25552;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#12290;&#20026;&#20102;&#29983;&#25104;&#39044;&#27979;&#32467;&#26524;&#65292;&#25105;&#20204;&#30340;&#20915;&#31574;&#27169;&#22411;&#26681;&#25454;&#32473;&#23450;&#29366;&#24577;&#21644;&#19978;&#19979;&#25991;&#21160;&#24577;&#22320;&#20174;&#31639;&#27861;&#26550;&#20013;&#36873;&#25321;&#26368;&#20339;&#31639;&#27861;&#12290;&#20351;&#29992;&#20808;&#36827;&#30340;&#29305;&#24449;&#24037;&#31243;&#26500;&#24314;&#30340;AI / ML&#39044;&#27979;&#27169;&#22411;&#30340;&#32467;&#26524;&#26174;&#31034;&#65292;&#38656;&#27714;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#26377;&#25152;&#25552;&#39640;&#12290;
&lt;/p&gt;
&lt;p&gt;
Retail sales and price projections are typically based on time series forecasting. For some product categories, the accuracy of demand forecasts achieved is low, negatively impacting inventory, transport, and replenishment planning. This paper presents our findings based on a proactive pilot exercise to explore ways to help retailers to improve forecast accuracy for such product categories.  We evaluated opportunities for algorithmic interventions to improve forecast accuracy based on a sample product category, Knitwear. The Knitwear product category has a current demand forecast accuracy from non-AI models in the range of 60%. We explored how to improve the forecast accuracy using a rack approach. To generate forecasts, our decision model dynamically selects the best algorithm from an algorithm rack based on performance for a given state and context. Outcomes from our AI/ML forecasting model built using advanced feature engineering show an increase in the accuracy of demand forecast f
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20840;&#29699;&#20215;&#20540;&#38142;&#65288;GVCs&#65289;&#30340;&#20013;&#24515;&#24615;&#23545;&#30740;&#21457;&#65288;R&amp;D&#65289;&#22269;&#38469;&#28322;&#20986;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#34920;&#26126;&#65292;&#20855;&#26377;&#39640;&#20013;&#24515;&#24615;&#30340;&#20986;&#21475;&#22269;&#30340;R&amp;D&#28322;&#20986;&#26368;&#22823;&#65292;&#20013;&#24515;&#22269;&#22312;&#25910;&#38598;&#21644;&#25193;&#25955;&#30693;&#35782;&#26041;&#38754;&#21457;&#25381;&#20102;&#37325;&#35201;&#20316;&#29992;&#12290;</title><link>http://arxiv.org/abs/2306.06680</link><description>&lt;p&gt;
&#12298;&#29983;&#20135;&#32593;&#32476;&#20013;&#30340;&#20013;&#24515;&#24615;&#19982;&#22269;&#38469;&#25216;&#26415;&#25193;&#25955;&#12299;
&lt;/p&gt;
&lt;p&gt;
Centrality in Production Networks and International Technology Diffusion. (arXiv:2306.06680v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.06680
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20840;&#29699;&#20215;&#20540;&#38142;&#65288;GVCs&#65289;&#30340;&#20013;&#24515;&#24615;&#23545;&#30740;&#21457;&#65288;R&amp;D&#65289;&#22269;&#38469;&#28322;&#20986;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#34920;&#26126;&#65292;&#20855;&#26377;&#39640;&#20013;&#24515;&#24615;&#30340;&#20986;&#21475;&#22269;&#30340;R&amp;D&#28322;&#20986;&#26368;&#22823;&#65292;&#20013;&#24515;&#22269;&#22312;&#25910;&#38598;&#21644;&#25193;&#25955;&#30693;&#35782;&#26041;&#38754;&#21457;&#25381;&#20102;&#37325;&#35201;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20840;&#29699;&#20215;&#20540;&#38142;&#65288;GVCs&#65289;&#30340;&#32467;&#26500;&#26159;&#21542;&#24433;&#21709;&#30740;&#21457;&#65288;R&amp;D&#65289;&#30340;&#22269;&#38469;&#28322;&#20986;&#12290;&#36890;&#36807;&#23545;1995-2007&#24180;21&#20010;&#22269;&#23478;&#21644;14&#20010;&#21046;&#36896;&#19994;&#30340;&#26679;&#26412;&#36827;&#34892;&#20998;&#31867;&#65292;&#30740;&#31350;&#20102;&#8220;&#20013;&#24515;&#24615;&#8221;&#24230;&#37327;&#30340;&#35282;&#33394;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#20855;&#26377;&#39640;&#20013;&#24515;&#24615;&#30340;&#20986;&#21475;&#22269;&#30340;R&amp;D&#28322;&#20986;&#26368;&#22823;&#65292;&#36825;&#34920;&#26126;&#20013;&#24515;&#22269;&#22312;&#25910;&#38598;&#21644;&#25193;&#25955;&#30693;&#35782;&#26041;&#38754;&#21457;&#25381;&#20102;&#37325;&#35201;&#20316;&#29992;&#12290;&#21516;&#26102;&#21457;&#29616;&#65292;&#20855;&#26377;&#20013;&#31561;&#20013;&#24515;&#24615;&#30340;&#22269;&#23478;&#22312;&#30693;&#35782;&#25193;&#25955;&#26041;&#38754;&#36234;&#26469;&#36234;&#37325;&#35201;&#65292;&#26368;&#21518;&#65292;&#21482;&#26377;&#22312;G5&#22269;&#23478;&#20013;&#25165;&#33021;&#35266;&#23519;&#21040;&#33258;&#36523;&#30340;&#27491;&#21521;&#28322;&#20986;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study examines whether the structure of global value chains (GVCs) affects international spillovers of research and development (R&amp;D). Although the presence of ``hub'' countries in GVCs has been confirmed by previous studies, the role of these hub countries in the diffusion of the technology has not been analyzed. Using a sample of 21 countries and 14 manufacturing industries during the period 1995-2007, I explore the role of hubs as the mediator of knowledge by classifying countries and industries based on a ``centrality'' measure. I find that R&amp;D spillovers from exporters with High centrality are the largest, suggesting that hub countries play an important role in both gathering and diffusing knowledge. I also find that countries with Middle centrality are getting important in the diffusion of knowledge. Finally, positive spillover effects from own are observed only in the G5 countries.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026; C-qGAN &#30340;&#26694;&#26550;&#65292;&#21033;&#29992;&#37327;&#23376;&#30005;&#36335;&#32467;&#26500;&#23454;&#29616;&#20102;&#26377;&#25928;&#30340;&#29366;&#24577;&#20934;&#22791;&#36807;&#31243;&#65292;&#21487;&#20197;&#21033;&#29992;&#35813;&#26041;&#27861;&#21152;&#36895;&#33945;&#29305;&#21345;&#32599;&#20998;&#26512;&#31561;&#31639;&#27861;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#20122;&#24335;&#26399;&#26435;&#34893;&#29983;&#21697;&#23450;&#20215;&#30340;&#20219;&#21153;&#20013;&#12290;</title><link>http://arxiv.org/abs/2304.10382</link><description>&lt;p&gt;
&#23398;&#20064;&#38543;&#26426;&#36807;&#31243;&#30340;&#26377;&#26465;&#20214;&#29983;&#25104;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Conditional Generative Models for Learning Stochastic Processes. (arXiv:2304.10382v1 [quant-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10382
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026; C-qGAN &#30340;&#26694;&#26550;&#65292;&#21033;&#29992;&#37327;&#23376;&#30005;&#36335;&#32467;&#26500;&#23454;&#29616;&#20102;&#26377;&#25928;&#30340;&#29366;&#24577;&#20934;&#22791;&#36807;&#31243;&#65292;&#21487;&#20197;&#21033;&#29992;&#35813;&#26041;&#27861;&#21152;&#36895;&#33945;&#29305;&#21345;&#32599;&#20998;&#26512;&#31561;&#31639;&#27861;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#20122;&#24335;&#26399;&#26435;&#34893;&#29983;&#21697;&#23450;&#20215;&#30340;&#20219;&#21153;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#23398;&#20064;&#22810;&#27169;&#24577;&#20998;&#24067;&#30340;&#26694;&#26550;&#65292;&#31216;&#20026;&#26465;&#20214;&#37327;&#23376;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65288;C-qGAN&#65289;&#12290;&#31070;&#32463;&#32593;&#32476;&#32467;&#26500;&#20005;&#26684;&#37319;&#29992;&#37327;&#23376;&#30005;&#36335;&#65292;&#22240;&#27492;&#34987;&#35777;&#26126;&#33021;&#22815;&#27604;&#24403;&#21069;&#30340;&#26041;&#27861;&#26356;&#26377;&#25928;&#22320;&#34920;&#31034;&#29366;&#24577;&#20934;&#22791;&#36807;&#31243;&#12290;&#36825;&#31181;&#26041;&#27861;&#26377;&#28508;&#21147;&#21152;&#36895;&#33945;&#29305;&#21345;&#32599;&#20998;&#26512;&#31561;&#31639;&#27861;&#12290;&#29305;&#21035;&#22320;&#65292;&#22312;&#23637;&#31034;&#20102;&#32593;&#32476;&#22312;&#23398;&#20064;&#20219;&#21153;&#20013;&#30340;&#26377;&#25928;&#24615;&#21518;&#65292;&#23558;&#35813;&#25216;&#26415;&#24212;&#29992;&#20110;&#23450;&#20215;&#20122;&#24335;&#26399;&#26435;&#34893;&#29983;&#21697;&#65292;&#20026;&#26410;&#26469;&#30740;&#31350;&#20854;&#20182;&#36335;&#24452;&#30456;&#20851;&#26399;&#26435;&#25171;&#19979;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;
A framework to learn a multi-modal distribution is proposed, denoted as the Conditional Quantum Generative Adversarial Network (C-qGAN). The neural network structure is strictly within a quantum circuit and, as a consequence, is shown to represents a more efficient state preparation procedure than current methods. This methodology has the potential to speed-up algorithms, such as Monte Carlo analysis. In particular, after demonstrating the effectiveness of the network in the learning task, the technique is applied to price Asian option derivatives, providing the foundation for further research on other path-dependent options.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#26088;&#22312;&#25506;&#31350;&#21152;&#23494;&#36135;&#24065;&#24066;&#22330;&#30340;&#38598;&#20307;&#21160;&#21147;&#23398;&#21644;&#25237;&#36164;&#32452;&#21512;&#22810;&#26679;&#21270;&#65292;&#20197;&#21450;&#23581;&#35797;&#30830;&#35748;&#20808;&#21069;&#22312;&#32929;&#31080;&#24066;&#22330;&#20013;&#24314;&#31435;&#30340;&#32467;&#26524;&#26159;&#21542;&#36866;&#29992;&#20110;&#21152;&#23494;&#36135;&#24065;&#24066;&#22330;&#12290;</title><link>http://arxiv.org/abs/2304.08902</link><description>&lt;p&gt;
&#21152;&#23494;&#36135;&#24065;&#30340;&#38598;&#20307;&#21160;&#21147;&#23398;&#12289;&#22810;&#26679;&#21270;&#21644;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#26500;&#24314;
&lt;/p&gt;
&lt;p&gt;
Collective dynamics, diversification and optimal portfolio construction for cryptocurrencies. (arXiv:2304.08902v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.08902
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26088;&#22312;&#25506;&#31350;&#21152;&#23494;&#36135;&#24065;&#24066;&#22330;&#30340;&#38598;&#20307;&#21160;&#21147;&#23398;&#21644;&#25237;&#36164;&#32452;&#21512;&#22810;&#26679;&#21270;&#65292;&#20197;&#21450;&#23581;&#35797;&#30830;&#35748;&#20808;&#21069;&#22312;&#32929;&#31080;&#24066;&#22330;&#20013;&#24314;&#31435;&#30340;&#32467;&#26524;&#26159;&#21542;&#36866;&#29992;&#20110;&#21152;&#23494;&#36135;&#24065;&#24066;&#22330;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#21457;&#26126;&#20197;&#26469;&#65292;&#21152;&#23494;&#36135;&#24065;&#24066;&#22330;&#32463;&#24120;&#34987;&#25551;&#36848;&#20026;&#19968;&#20010;&#19981;&#25104;&#29087;&#30340;&#24066;&#22330;&#65292;&#20854;&#27874;&#21160;&#29575;&#26174;&#33879;&#27874;&#21160;&#65292;&#24182;&#19988;&#20598;&#23572;&#34987;&#25551;&#36848;&#20026;&#32570;&#20047;&#35268;&#24459;&#12290;&#20154;&#20204;&#19968;&#30452;&#22312;&#29468;&#27979;&#23427;&#22312;&#22810;&#26679;&#21270;&#25237;&#36164;&#32452;&#21512;&#20013;&#25198;&#28436;&#30528;&#20160;&#20040;&#35282;&#33394;&#12290;&#20363;&#22914;&#65292;&#21152;&#23494;&#36135;&#24065;&#26159;&#21542;&#26159;&#36890;&#36135;&#33192;&#32960;&#23545;&#20914;&#30340;&#24037;&#20855;&#65292;&#36824;&#26159;&#19968;&#31181;&#36981;&#24490;&#24066;&#22330;&#24773;&#32490;&#30340;&#25237;&#26426;&#24615;&#25237;&#36164;&#65292;&#20854;Beta&#20540;&#25918;&#22823;&#20102;&#21602;&#65311;&#26412;&#25991;&#26088;&#22312;&#35843;&#26597;&#21152;&#23494;&#36135;&#24065;&#24066;&#22330;&#26159;&#21542;&#23637;&#29616;&#20986;&#19982;&#26356;&#25104;&#29087;&#30340;&#32929;&#31080;&#24066;&#22330;&#31867;&#20284;&#30340;&#22797;&#26434;&#25968;&#23398;&#29305;&#24615;&#12290;&#25105;&#20204;&#20851;&#27880;&#21152;&#23494;&#36135;&#24065;&#24066;&#22330;&#30340;&#38598;&#20307;&#21160;&#21147;&#23398;&#21644;&#25237;&#36164;&#32452;&#21512;&#22810;&#26679;&#21270;&#65292;&#24182;&#30740;&#31350;&#22312;&#21152;&#23494;&#36135;&#24065;&#24066;&#22330;&#20013;&#20808;&#21069;&#24314;&#31435;&#30340;&#32929;&#31080;&#24066;&#22330;&#32467;&#26524;&#26159;&#21542;&#25104;&#31435;&#65292;&#20197;&#21450;&#31243;&#24230;&#22914;&#20309;&#12290;
&lt;/p&gt;
&lt;p&gt;
Since its conception, the cryptocurrency market has been frequently described as an immature market, characterized by significant swings in volatility and occasionally described as lacking rhyme or reason. There has been great speculation as to what role it plays in a diversified portfolio. For instance, is cryptocurrency exposure an inflationary hedge or a speculative investment that follows broad market sentiment with amplified beta? This paper aims to investigate whether the cryptocurrency market has recently exhibited similarly nuanced mathematical properties as the much more mature equity market. Our focus is on collective dynamics and portfolio diversification in the cryptocurrency market, and examining whether previously established results in the equity market hold in the cryptocurrency market, and to what extent.
&lt;/p&gt;</description></item><item><title>&#26412;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#23433;&#20840;&#25104;&#29087;&#24230;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#20197;&#35780;&#20272;&#32452;&#32455;&#30340;&#23433;&#20840;&#27700;&#24179;&#24182;&#30830;&#23450;&#32593;&#32476;&#20445;&#38505;&#30340;&#36866;&#24403;&#20445;&#36153;&#12290;</title><link>http://arxiv.org/abs/2302.04734</link><description>&lt;p&gt;
&#22522;&#20110;&#25104;&#29087;&#24230;&#27169;&#22411;&#30340;&#20449;&#24687;&#31995;&#32479;&#32593;&#32476;&#20445;&#38505;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
Pricing cyber-insurance for systems via maturity models. (arXiv:2302.04734v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.04734
&lt;/p&gt;
&lt;p&gt;
&#26412;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#23433;&#20840;&#25104;&#29087;&#24230;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#20197;&#35780;&#20272;&#32452;&#32455;&#30340;&#23433;&#20840;&#27700;&#24179;&#24182;&#30830;&#23450;&#32593;&#32476;&#20445;&#38505;&#30340;&#36866;&#24403;&#20445;&#36153;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#19982;&#20449;&#24687;&#25216;&#26415;&#31995;&#32479;&#30456;&#20851;&#30340;&#39118;&#38505;&#36827;&#34892;&#20445;&#38505;&#23450;&#20215;&#25552;&#20986;&#20102;&#19968;&#20010;&#32508;&#21512;&#30340;&#24314;&#35758;&#65292;&#32467;&#21512;&#36816;&#33829;&#31649;&#29702;&#12289;&#23433;&#20840;&#21644;&#32463;&#27982;&#23398;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#31038;&#20250;&#32463;&#27982;&#27169;&#22411;&#12290;&#35813;&#27169;&#22411;&#21253;&#25324;&#23454;&#20307;&#20851;&#31995;&#22270;&#12289;&#23433;&#20840;&#25104;&#29087;&#24230;&#27169;&#22411;&#21644;&#32463;&#27982;&#27169;&#22411;&#65292;&#35299;&#20915;&#20102;&#19968;&#20010;&#38271;&#26399;&#20197;&#26469;&#30340;&#30740;&#31350;&#38590;&#39064;&#65292;&#21363;&#22914;&#20309;&#22312;&#35774;&#35745;&#21644;&#23450;&#20215;&#32593;&#32476;&#20445;&#38505;&#25919;&#31574;&#26102;&#25429;&#25417;&#32452;&#32455;&#32467;&#26500;&#12290;&#25991;&#20013;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#25361;&#25112;&#65292;&#21363;&#32593;&#32476;&#20445;&#38505;&#30340;&#25968;&#25454;&#21382;&#21490;&#26377;&#38480;&#65292;&#19981;&#33021;&#30452;&#25509;&#24212;&#29992;&#20110;&#20854;&#23427;&#38505;&#31181;&#65292;&#22240;&#27492;&#25552;&#20986;&#19968;&#20010;&#23433;&#20840;&#25104;&#29087;&#24230;&#27169;&#22411;&#65292;&#20197;&#35780;&#20272;&#32452;&#32455;&#30340;&#23433;&#20840;&#27700;&#24179;&#24182;&#30830;&#23450;&#30456;&#24212;&#30340;&#20445;&#38505;&#36153;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Pricing insurance for risks associated with information technology systems presents a complex modelling challenge, combining the disciplines of operations management, security, and economics. This work proposes a socioeconomic model for cyber-insurance decisions compromised of entity relationship diagrams, security maturity models, and economic models, addressing a long-standing research challenge of capturing organizational structure in the design and pricing of cyber-insurance policies. Insurance pricing is usually informed by the long experience insurance companies have of the magnitude and frequency of losses that arise in organizations based on their size, industry sector, and location. Consequently, their calculations of premia will start from a baseline determined by these considerations. A unique challenge of cyber-insurance is that data history is limited and not necessarily informative of future loss risk meaning that established actuarial methodology for other lines of insur
&lt;/p&gt;</description></item></channel></rss>