<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#22312;&#21160;&#24577;AMM&#20013;&#23454;&#29616;&#26368;&#20248;&#20877;&#24179;&#34913;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#22871;&#21033;&#26426;&#20250;&#26469;&#35843;&#25972;&#25345;&#26377;&#29289;&#65292;&#37319;&#29992;&#20415;&#23452;&#35745;&#31639;&#30340;&#36817;&#20284;&#26368;&#20248;&#26041;&#27861;&#21462;&#24471;&#20102;&#24615;&#33021;&#25913;&#36827;&#12290;</title><link>https://arxiv.org/abs/2403.18737</link><description>&lt;p&gt;
&#21160;&#24577;AMM&#20013;&#30340;&#26368;&#20248;&#20877;&#24179;&#34913;
&lt;/p&gt;
&lt;p&gt;
Optimal Rebalancing in Dynamic AMMs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18737
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#22312;&#21160;&#24577;AMM&#20013;&#23454;&#29616;&#26368;&#20248;&#20877;&#24179;&#34913;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#22871;&#21033;&#26426;&#20250;&#26469;&#35843;&#25972;&#25345;&#26377;&#29289;&#65292;&#37319;&#29992;&#20415;&#23452;&#35745;&#31639;&#30340;&#36817;&#20284;&#26368;&#20248;&#26041;&#27861;&#21462;&#24471;&#20102;&#24615;&#33021;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21160;&#24577;AMM&#27744;&#65292;&#22914;&#26102;&#38388;&#20989;&#25968;&#20570;&#24066;&#25152;&#21457;&#29616;&#30340;&#37027;&#26679;&#65292;&#20250;&#23558;&#20854;&#25345;&#26377;&#29289;&#37325;&#26032;&#24179;&#34913;&#21040;&#26032;&#30340;&#26399;&#26395;&#27604;&#20363;&#65288;&#20363;&#22914;&#65292;&#20174;&#20004;&#31181;&#36164;&#20135;&#20043;&#38388;&#30340;50-50&#31227;&#21160;&#21040;&#20854;&#20013;&#19968;&#31181;&#21344;&#20248;&#21183;&#30340;90-10&#65289;&#65292;&#36890;&#36807;&#24341;&#20837;&#19968;&#20010;&#22871;&#21033;&#26426;&#20250;&#26469;&#23454;&#29616;&#65292;&#24403;&#20854;&#25345;&#26377;&#29289;&#19982;&#30446;&#26631;&#19968;&#33268;&#26102;&#65292;&#35813;&#22871;&#21033;&#26426;&#20250;&#20250;&#28040;&#22833;&#12290;&#26500;&#36896;&#36825;&#31181;&#22871;&#21033;&#26426;&#20250;&#21487;&#20197;&#31616;&#21270;&#20026;&#36890;&#36807;&#20854;&#20132;&#26131;&#20989;&#25968;&#21521;&#24066;&#22330;&#20844;&#24320;&#30340;&#25237;&#36164;&#32452;&#21512;&#26435;&#37325;&#24207;&#21015;&#30340;&#36873;&#25321;&#38382;&#39064;&#12290;&#20174;&#36215;&#22987;&#26435;&#37325;&#32447;&#24615;&#25554;&#20540;&#21040;&#32467;&#26463;&#26435;&#37325;&#24050;&#34987;&#29992;&#20110;&#38477;&#20302;&#27744;&#21521;&#22871;&#21033;&#32773;&#25903;&#20184;&#30340;&#25104;&#26412;&#20197;&#37325;&#26032;&#24179;&#34913;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#22312;&#26435;&#37325;&#21464;&#21270;&#24456;&#23567;&#30340;&#26497;&#38480;&#24773;&#20917;&#19979;&#33719;&#24471;&#20102;$\textit{&#26368;&#20248;}$&#25554;&#20540;&#65288;&#32570;&#28857;&#26159;&#38656;&#35201;&#35843;&#29992;&#19968;&#20010;&#36229;&#36234;&#20989;&#25968;&#65289;&#65292;&#28982;&#21518;&#33719;&#24471;&#20102;&#19968;&#20010;&#20415;&#23452;&#35745;&#31639;&#30340;&#36817;&#20284;&#26368;&#20248;&#26041;&#27861;&#65292;&#20960;&#20046;&#23454;&#29616;&#20102;&#30456;&#21516;&#30340;&#24615;&#33021;&#25913;&#36827;&#12290;&#28982;&#21518;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#31181;&#26041;&#27861;&#22312;&#19968;&#31995;&#21015;&#24066;&#22330;&#20013;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18737v1 Announce Type: new  Abstract: Dynamic AMM pools, as found in Temporal Function Market Making, rebalance their holdings to a new desired ratio (e.g. moving from being 50-50 between two assets to being 90-10 in favour of one of them) by introducing an arbitrage opportunity that disappears when their holdings are in line with their target. Structuring this arbitrage opportunity reduces to the problem of choosing the sequence of portfolio weights the pool exposes to the market via its trading function. Linear interpolation from start weights to end weights has been used to reduce the cost paid by pools to arbitrageurs to rebalance. Here we obtain the $\textit{optimal}$ interpolation in the limit of small weight changes (which has the downside of requiring a call to a transcendental function) and then obtain a cheap-to-compute approximation to that optimal approach that gives almost the same performance improvement. We then demonstrate this method on a range of market bac
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#22312;&#20855;&#26377;&#20056;&#27861;&#22122;&#22768;&#30340;&#38543;&#26426;&#32447;&#24615;&#20108;&#27425;&#31995;&#32479;&#20013;&#35299;&#20915;&#20102;&#26377;&#38480;&#27880;&#24847;&#20998;&#37197;&#38382;&#39064;&#65292;&#36890;&#36807;&#25112;&#30053;&#36164;&#28304;&#20998;&#37197;&#25552;&#39640;&#22122;&#22768;&#20272;&#35745;&#24182;&#25913;&#21892;&#25511;&#21046;&#20915;&#31574;&#12290;</title><link>https://arxiv.org/abs/2403.18528</link><description>&lt;p&gt;
&#20855;&#26377;&#20056;&#27861;&#22122;&#22768;&#30340;&#38543;&#26426;&#32447;&#24615;&#20108;&#27425;&#31995;&#32479;&#20013;&#30340;&#26377;&#38480;&#27880;&#24847;&#20998;&#37197;
&lt;/p&gt;
&lt;p&gt;
Limited Attention Allocation in a Stochastic Linear Quadratic System with Multiplicative Noise
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18528
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22312;&#20855;&#26377;&#20056;&#27861;&#22122;&#22768;&#30340;&#38543;&#26426;&#32447;&#24615;&#20108;&#27425;&#31995;&#32479;&#20013;&#35299;&#20915;&#20102;&#26377;&#38480;&#27880;&#24847;&#20998;&#37197;&#38382;&#39064;&#65292;&#36890;&#36807;&#25112;&#30053;&#36164;&#28304;&#20998;&#37197;&#25552;&#39640;&#22122;&#22768;&#20272;&#35745;&#24182;&#25913;&#21892;&#25511;&#21046;&#20915;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#20855;&#26377;&#20056;&#27861;&#22122;&#22768;&#30340;&#38543;&#26426;&#32447;&#24615;&#20108;&#27425;&#31995;&#32479;&#20013;&#30340;&#26377;&#38480;&#27880;&#24847;&#20998;&#37197;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#33021;&#22815;&#23454;&#29616;&#25112;&#30053;&#36164;&#28304;&#20998;&#37197;&#65292;&#20197;&#22686;&#24378;&#22122;&#22768;&#20272;&#35745;&#24182;&#25913;&#21892;&#25511;&#21046;&#20915;&#31574;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#35299;&#26512;&#26368;&#20248;&#25511;&#21046;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#26368;&#20248;&#27880;&#24847;&#20998;&#37197;&#30340;&#25968;&#20540;&#26041;&#27861;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#30740;&#31350;&#25104;&#26524;&#24212;&#29992;&#20110;&#21160;&#24577;&#22343;&#20540;&#26041;&#24046;&#32452;&#21512;&#36873;&#25321;&#65292;&#23637;&#31034;&#20102;&#36328;&#26102;&#38388;&#27573;&#21644;&#22240;&#32032;&#30340;&#26377;&#25928;&#36164;&#28304;&#20998;&#37197;&#65292;&#20026;&#25237;&#36164;&#32773;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18528v1 Announce Type: cross  Abstract: This study addresses limited attention allocation in a stochastic linear quadratic system with multiplicative noise. Our approach enables strategic resource allocation to enhance noise estimation and improve control decisions. We provide analytical optimal control and propose a numerical method for optimal attention allocation. Additionally, we apply our ffndings to dynamic mean-variance portfolio selection, showing effective resource allocation across time periods and factors, providing valuable insights for investors.
&lt;/p&gt;</description></item><item><title>&#20122;&#39532;&#36874;&#27969;&#22495;&#21450;&#25289;&#19969;&#32654;&#27954;&#21644;&#21152;&#21202;&#27604;&#22320;&#21306;&#27491;&#32463;&#21382;&#29615;&#22659;&#25361;&#25112;&#19982;&#21464;&#38761;&#28508;&#21147;&#24182;&#23384;&#30340;&#26102;&#21051;&#65292;&#26412;&#25253;&#21578;&#26088;&#22312;&#25581;&#31034;&#21508;&#31181;&#31038;&#20250;&#29983;&#24577;&#38382;&#39064;&#12289;&#25216;&#26415;&#36827;&#27493;&#12289;&#31038;&#21306;&#20513;&#35758;&#21644;&#25112;&#30053;&#34892;&#21160;&#65292;&#26377;&#21161;&#20110;&#25512;&#21160;&#21306;&#22495;&#30340;&#29983;&#29289;&#22280;&#21487;&#25345;&#32493;&#24615;&#21644;&#38887;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.18521</link><description>&lt;p&gt;
&#37325;&#23450;&#21521;&#27969;&#21160;--&#25506;&#32034;&#20122;&#39532;&#36874;&#26410;&#26469;
&lt;/p&gt;
&lt;p&gt;
Redirecting Flows -- Navigating the Future of the Amazon
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18521
&lt;/p&gt;
&lt;p&gt;
&#20122;&#39532;&#36874;&#27969;&#22495;&#21450;&#25289;&#19969;&#32654;&#27954;&#21644;&#21152;&#21202;&#27604;&#22320;&#21306;&#27491;&#32463;&#21382;&#29615;&#22659;&#25361;&#25112;&#19982;&#21464;&#38761;&#28508;&#21147;&#24182;&#23384;&#30340;&#26102;&#21051;&#65292;&#26412;&#25253;&#21578;&#26088;&#22312;&#25581;&#31034;&#21508;&#31181;&#31038;&#20250;&#29983;&#24577;&#38382;&#39064;&#12289;&#25216;&#26415;&#36827;&#27493;&#12289;&#31038;&#21306;&#20513;&#35758;&#21644;&#25112;&#30053;&#34892;&#21160;&#65292;&#26377;&#21161;&#20110;&#25512;&#21160;&#21306;&#22495;&#30340;&#29983;&#29289;&#22280;&#21487;&#25345;&#32493;&#24615;&#21644;&#38887;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20122;&#39532;&#36874;&#27969;&#22495;&#21450;&#25289;&#19969;&#32654;&#27954;&#21644;&#21152;&#21202;&#27604;&#22320;&#21306;&#27491;&#22788;&#20110;&#19968;&#20010;&#20851;&#38190;&#26102;&#21051;&#65292;&#27491;&#22312;&#24212;&#23545;&#32039;&#36843;&#30340;&#29615;&#22659;&#25361;&#25112;&#65292;&#21516;&#26102;&#36890;&#36807;&#21019;&#26032;&#35299;&#20915;&#26041;&#26696;&#26377;&#24040;&#22823;&#28508;&#21147;&#23454;&#29616;&#21464;&#38761;&#12290;&#26412;&#25253;&#21578;&#38416;&#26126;&#20102;&#31038;&#20250;&#29983;&#24577;&#38382;&#39064;&#12289;&#25216;&#26415;&#36827;&#27493;&#12289;&#31038;&#21306;&#20027;&#23548;&#30340;&#20513;&#35758;&#21644;&#25112;&#30053;&#34892;&#21160;&#31561;&#22810;&#26679;&#21270;&#39046;&#22495;&#65292;&#36825;&#20123;&#21487;&#20197;&#24110;&#21161;&#20419;&#36827;&#25972;&#20010;&#22320;&#21306;&#30340;&#29983;&#29289;&#22280;&#21487;&#25345;&#32493;&#24615;&#21644;&#38887;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18521v1 Announce Type: new  Abstract: The Amazon Basin, and the Latin America and Caribbean (LAC) region more broadly, stands at a critical juncture, grappling with pressing environmental challenges while holding immense potential for transformative change through innovative solutions. This report illuminates the diverse landscape of social-ecological issues, technological advancements, community-led initiatives, and strategic actions that could help foster biosphere-based sustainability and resilience across the region.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;G3M&#20013;&#20132;&#26131;&#36153;&#23545;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30408;&#21033;&#33021;&#21147;&#30340;&#24433;&#21709;&#20197;&#21450;LP&#38754;&#20020;&#30340;&#36870;&#21521;&#36873;&#25321;&#65292;&#24182;&#35745;&#31639;&#20102;LP&#36130;&#23500;&#30340;&#22686;&#38271;&#29575;&#12290;</title><link>https://arxiv.org/abs/2403.18177</link><description>&lt;p&gt;
G3M&#20013;&#20570;&#24066;&#21830;&#36130;&#23500;&#22686;&#38271;&#29575;
&lt;/p&gt;
&lt;p&gt;
Growth rate of liquidity provider's wealth in G3Ms
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18177
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;G3M&#20013;&#20132;&#26131;&#36153;&#23545;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30408;&#21033;&#33021;&#21147;&#30340;&#24433;&#21709;&#20197;&#21450;LP&#38754;&#20020;&#30340;&#36870;&#21521;&#36873;&#25321;&#65292;&#24182;&#35745;&#31639;&#20102;LP&#36130;&#23500;&#30340;&#22686;&#38271;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20960;&#20309;&#22343;&#20540;&#24066;&#22330;&#20570;&#24066;&#21830;&#65288;G3M&#65289;&#65292;&#22914;Uniswap&#21644;Balancer&#65292;&#20195;&#34920;&#19968;&#31867;&#24191;&#27867;&#20351;&#29992;&#30340;&#33258;&#21160;&#20570;&#24066;&#21830;&#65288;AMM&#65289;&#12290;&#36825;&#20123;G3M&#30340;&#29305;&#28857;&#22312;&#20110;&#65306;&#27599;&#31508;&#20132;&#26131;&#21069;&#21518;&#65292;AMM&#30340;&#20648;&#22791;&#24517;&#39035;&#20445;&#25345;&#30456;&#21516;&#65288;&#21152;&#26435;&#65289;&#30340;&#20960;&#20309;&#22343;&#20540;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#20132;&#26131;&#36153;&#23545;G3M&#20013;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65288;LP&#65289;&#30408;&#21033;&#33021;&#21147;&#30340;&#24433;&#21709;&#65292;&#20197;&#21450;LP&#38754;&#20020;&#30340;&#30001;&#28041;&#21450;&#21442;&#32771;&#24066;&#22330;&#30340;&#22871;&#21033;&#27963;&#21160;&#23548;&#33268;&#30340;&#36870;&#21521;&#36873;&#25321;&#12290;&#25105;&#20204;&#30340;&#24037;&#20316;&#25193;&#23637;&#20102;&#20808;&#21069;&#30740;&#31350;&#20013;&#25551;&#36848;&#30340;G3M&#27169;&#22411;&#65292;&#23558;&#20132;&#26131;&#36153;&#21644;&#36830;&#32493;&#26102;&#38388;&#22871;&#21033;&#25972;&#21512;&#21040;&#20998;&#26512;&#20013;&#12290;&#22312;&#36825;&#20010;&#32972;&#26223;&#19979;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#20855;&#26377;&#38543;&#26426;&#23384;&#20648;&#36807;&#31243;&#29305;&#24449;&#30340;G3M&#21160;&#24577;&#65292;&#24182;&#35745;&#31639;&#20102;LP&#36130;&#23500;&#30340;&#22686;&#38271;&#29575;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#30340;&#32467;&#26524;&#19982;&#25193;&#23637;&#20102;&#20851;&#20110;&#24120;&#25968;&#20056;&#31215;&#24066;&#22330;&#20570;&#24066;&#21830;&#30340;&#32467;&#26524;&#30456;&#19968;&#33268;&#65292;&#36890;&#24120;&#31216;&#20026;Uniswap v2&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18177v1 Announce Type: new  Abstract: Geometric mean market makers (G3Ms), such as Uniswap and Balancer, represent a widely used class of automated market makers (AMMs). These G3Ms are characterized by the following rule: the reserves of the AMM must maintain the same (weighted) geometric mean before and after each trade. This paper investigates the effects of trading fees on liquidity providers' (LP) profitability in a G3M, as well as the adverse selection faced by LPs due to arbitrage activities involving a reference market. Our work expands the model described in previous studies for G3Ms, integrating transaction fees and continuous-time arbitrage into the analysis. Within this context, we analyze G3M dynamics, characterized by stochastic storage processes, and calculate the growth rate of LP wealth. In particular, our results align with and extend the results concerning the constant product market maker, commonly referred to as Uniswap v2.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#27491;&#21521;&#21033;&#29575;&#30340;&#24377;&#24615;&#23383;&#31526;&#20018;&#27169;&#22411;&#65292;&#36890;&#36807;&#35299;&#37322;&#24066;&#22330;&#21147;&#37327;&#23545;&#37051;&#36817;&#26399;&#38480;&#21033;&#29575;&#30340;&#33258;&#25105;&#21442;&#29031;&#24433;&#21709;&#65292;&#23454;&#29616;&#20102;&#23545;&#25972;&#20010;FRC&#30456;&#20851;&#32467;&#26500;&#30340;&#20934;&#30830;&#20877;&#29616;&#65292;&#20165;&#38656;&#20004;&#20010;&#31283;&#23450;&#21442;&#25968;&#12290;</title><link>https://arxiv.org/abs/2403.18126</link><description>&lt;p&gt;
&#37325;&#26032;&#23457;&#35270;&#27491;&#21521;&#21033;&#29575;&#30340;&#24377;&#24615;&#23383;&#31526;&#20018;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Revisiting Elastic String Models of Forward Interest Rates
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18126
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#27491;&#21521;&#21033;&#29575;&#30340;&#24377;&#24615;&#23383;&#31526;&#20018;&#27169;&#22411;&#65292;&#36890;&#36807;&#35299;&#37322;&#24066;&#22330;&#21147;&#37327;&#23545;&#37051;&#36817;&#26399;&#38480;&#21033;&#29575;&#30340;&#33258;&#25105;&#21442;&#29031;&#24433;&#21709;&#65292;&#23454;&#29616;&#20102;&#23545;&#25972;&#20010;FRC&#30456;&#20851;&#32467;&#26500;&#30340;&#20934;&#30830;&#20877;&#29616;&#65292;&#20165;&#38656;&#20004;&#20010;&#31283;&#23450;&#21442;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
25&#24180;&#21069;&#65292;&#20960;&#20301;&#20316;&#32773;&#25552;&#20986;&#23558;&#27491;&#21521;&#21033;&#29575;&#26354;&#32447;&#65288;FRC&#65289;&#24314;&#27169;&#20026;&#19968;&#26681;&#24377;&#24615;&#23383;&#31526;&#20018;&#65292;&#27839;&#20854;&#20256;&#25773;&#29305;&#24322;&#20914;&#20987;&#65292;&#32771;&#34385;&#21040;&#19981;&#21516;&#21040;&#26399;&#26085;&#38388;&#22238;&#25253;&#30456;&#20851;&#24615;&#30340;&#29420;&#29305;&#32467;&#26500;&#12290;&#26412;&#25991;&#37325;&#26032;&#23457;&#35270;&#24052;&#22862;&#21644;&#24067;&#22799;&#23572;&#65288;2004&#65289;&#30340;&#8220;&#21018;&#24615;&#8221;&#24377;&#24615;&#23383;&#31526;&#20018;&#22330;&#35770;&#65292;&#20351;&#20854;&#24494;&#35266;&#22522;&#30784;&#26356;&#21152;&#36879;&#26126;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#21487;&#20197;&#35299;&#37322;&#24066;&#22330;&#21147;&#37327;&#23545;&#37051;&#36817;&#26399;&#38480;&#21033;&#29575;&#30340;&#33258;&#25105;&#21442;&#29031;&#26041;&#24335;&#30340;&#24433;&#21709;&#12290;&#35813;&#27169;&#22411;&#31616;&#27905;&#19988;&#33021;&#20934;&#30830;&#22320;&#22312;1994-2023&#24180;&#38388;&#20877;&#29616;&#25972;&#20010;FRC&#30340;&#30456;&#20851;&#32467;&#26500;&#65292;&#35823;&#24046;&#20302;&#20110;2%&#12290;&#25105;&#20204;&#20165;&#38656;&#20004;&#20010;&#21442;&#25968;&#65292;&#20854;&#20540;&#38500;&#20102;2009-2014&#24180;&#37327;&#21270;&#23485;&#26494;&#26399;&#38388;&#21487;&#33021;&#26377;&#25152;&#21464;&#21270;&#22806;&#38750;&#24120;&#31283;&#23450;&#12290;&#26102;&#38388;&#20998;&#36776;&#29575;&#65288;&#20063;&#31216;&#20026;Epps&#25928;&#24212;&#65289;&#23545;&#30456;&#20851;&#24615;&#30340;&#20381;&#36182;&#20063;&#34987;&#24544;&#23454;&#22320;&#20877;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18126v1 Announce Type: new  Abstract: Twenty five years ago, several authors proposed to model the forward interest rate curve (FRC) as an elastic string along which idiosyncratic shocks propagate, accounting for the peculiar structure of the return correlation across different maturities. In this paper, we revisit the specific "stiff'' elastic string field theory of Baaquie and Bouchaud (2004) in a way that makes its micro-foundation more transparent. Our model can be interpreted as capturing the effect of market forces that set the rates of nearby tenors in a self-referential fashion. The model is parsimonious and accurately reproduces the whole correlation structure of the FRC over the time period 1994-2023, with an error below 2%. We need only two parameters, the values of which being very stable except perhaps during the Quantitative Easing period 2009-2014. The dependence of correlation on time resolution (also called the Epps effect) is also faithfully reproduced with
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#21033;&#29992;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#39044;&#27979;&#32435;&#26031;&#36798;&#20811;&#20132;&#26131;&#25152;&#32929;&#31080;&#30340;&#38480;&#20215;&#35746;&#21333;&#31807;&#20013;&#38388;&#20215;&#26684;&#21464;&#21160;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#21019;&#26032;&#30340;&#25805;&#20316;&#26694;&#26550;&#26469;&#35780;&#20272;&#39044;&#27979;&#30340;&#23454;&#29992;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.09267</link><description>&lt;p&gt;
&#28145;&#24230;&#38480;&#20215;&#35746;&#21333;&#31807;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Deep Limit Order Book Forecasting
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09267
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#21033;&#29992;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#39044;&#27979;&#32435;&#26031;&#36798;&#20811;&#20132;&#26131;&#25152;&#32929;&#31080;&#30340;&#38480;&#20215;&#35746;&#21333;&#31807;&#20013;&#38388;&#20215;&#26684;&#21464;&#21160;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#21019;&#26032;&#30340;&#25805;&#20316;&#26694;&#26550;&#26469;&#35780;&#20272;&#39044;&#27979;&#30340;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#21033;&#29992;&#23574;&#31471;&#30340;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#25506;&#32034;&#20102;&#22312;&#32435;&#26031;&#36798;&#20811;&#20132;&#26131;&#25152;&#19978;&#20132;&#26131;&#30340;&#19968;&#32452;&#24322;&#36136;&#32929;&#31080;&#30340;&#39640;&#39057;&#38480;&#20215;&#35746;&#21333;&#31807;&#20013;&#38388;&#20215;&#26684;&#21464;&#21160;&#30340;&#21487;&#39044;&#27979;&#24615;&#12290;&#22312;&#27492;&#36807;&#31243;&#20013;&#65292;&#25105;&#20204;&#21457;&#24067;&#20102;&#8220;LOBFrame&#8221;&#65292;&#19968;&#20010;&#24320;&#28304;&#20195;&#30721;&#24211;&#65292;&#21487;&#20197;&#39640;&#25928;&#22788;&#29702;&#22823;&#35268;&#27169;&#38480;&#20215;&#35746;&#21333;&#31807;&#25968;&#25454;&#65292;&#24182;&#23450;&#37327;&#35780;&#20272;&#26368;&#20808;&#36827;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#30340;&#39044;&#27979;&#33021;&#21147;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#26159;&#21452;&#37325;&#30340;&#12290;&#25105;&#20204;&#35777;&#26126;&#32929;&#31080;&#30340;&#24494;&#35266;&#32467;&#26500;&#29305;&#24449;&#24433;&#21709;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#65292;&#24182;&#19988;&#23427;&#20204;&#30340;&#39640;&#39044;&#27979;&#33021;&#21147;&#19981;&#19968;&#23450;&#23545;&#24212;&#21487;&#25805;&#20316;&#30340;&#20132;&#26131;&#20449;&#21495;&#12290;&#25105;&#20204;&#35748;&#20026;&#20256;&#32479;&#30340;&#26426;&#22120;&#23398;&#20064;&#25351;&#26631;&#26410;&#33021;&#20805;&#20998;&#35780;&#20272;&#38480;&#20215;&#35746;&#21333;&#31807;&#29615;&#22659;&#20013;&#39044;&#27979;&#30340;&#36136;&#37327;&#12290;&#20316;&#20026;&#26367;&#20195;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21019;&#26032;&#30340;&#25805;&#20316;&#26694;&#26550;&#65292;&#36890;&#36807;&#19987;&#27880;&#20110;&#20934;&#30830;&#39044;&#27979;&#30340;&#27010;&#29575;&#26469;&#35780;&#20272;&#39044;&#27979;&#30340;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09267v1 Announce Type: cross  Abstract: We exploit cutting-edge deep learning methodologies to explore the predictability of high-frequency Limit Order Book mid-price changes for a heterogeneous set of stocks traded on the NASDAQ exchange. In so doing, we release `LOBFrame', an open-source code base, to efficiently process large-scale Limit Order Book data and quantitatively assess state-of-the-art deep learning models' forecasting capabilities. Our results are twofold. We demonstrate that the stocks' microstructural characteristics influence the efficacy of deep learning methods and that their high forecasting power does not necessarily correspond to actionable trading signals. We argue that traditional machine learning metrics fail to adequately assess the quality of forecasts in the Limit Order Book context. As an alternative, we propose an innovative operational framework that assesses predictions' practicality by focusing on the probability of accurately forecasting com
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#36890;&#29992;N-token AMM&#22871;&#21033;&#30340;&#38381;&#21512;&#24418;&#24335;&#35299;&#20915;&#26041;&#26696;&#12290;&#35813;&#35299;&#20915;&#26041;&#26696;&#22312;&#27169;&#25311;&#20013;&#34920;&#29616;&#20986;&#27604;&#20984;&#20248;&#21270;&#26356;&#22909;&#30340;&#22871;&#21033;&#26426;&#20250;&#65292;&#24182;&#33021;&#26356;&#24555;&#22320;&#21033;&#29992;&#36825;&#20123;&#26426;&#20250;&#12290;&#24182;&#19988;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#20855;&#26377;&#24182;&#34892;&#35745;&#31639;&#33021;&#21147;&#65292;&#33021;&#22815;&#22312;GPU&#19978;&#25193;&#23637;&#65292;&#20026;AMM&#24314;&#27169;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#12290;&#27492;&#22806;&#65292;&#35813;&#26426;&#21046;&#30340;&#20302;&#35745;&#31639;&#25104;&#26412;&#36824;&#21487;&#20197;&#23454;&#29616;&#22810;&#36164;&#20135;&#27744;&#30340;&#38142;&#19978;&#22871;&#21033;&#26426;&#22120;&#20154;&#12290;</title><link>https://arxiv.org/abs/2402.06731</link><description>&lt;p&gt;
&#36890;&#29992;N-token AMM&#22871;&#21033;&#30340;&#38381;&#21512;&#24418;&#24335;&#35299;&#20915;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
Closed-form solutions for generic N-token AMM arbitrage
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.06731
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#36890;&#29992;N-token AMM&#22871;&#21033;&#30340;&#38381;&#21512;&#24418;&#24335;&#35299;&#20915;&#26041;&#26696;&#12290;&#35813;&#35299;&#20915;&#26041;&#26696;&#22312;&#27169;&#25311;&#20013;&#34920;&#29616;&#20986;&#27604;&#20984;&#20248;&#21270;&#26356;&#22909;&#30340;&#22871;&#21033;&#26426;&#20250;&#65292;&#24182;&#33021;&#26356;&#24555;&#22320;&#21033;&#29992;&#36825;&#20123;&#26426;&#20250;&#12290;&#24182;&#19988;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#20855;&#26377;&#24182;&#34892;&#35745;&#31639;&#33021;&#21147;&#65292;&#33021;&#22815;&#22312;GPU&#19978;&#25193;&#23637;&#65292;&#20026;AMM&#24314;&#27169;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#12290;&#27492;&#22806;&#65292;&#35813;&#26426;&#21046;&#30340;&#20302;&#35745;&#31639;&#25104;&#26412;&#36824;&#21487;&#20197;&#23454;&#29616;&#22810;&#36164;&#20135;&#27744;&#30340;&#38142;&#19978;&#22871;&#21033;&#26426;&#22120;&#20154;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20984;&#20248;&#21270;&#33258;&#20174;&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMM&#65289;&#35806;&#29983;&#20197;&#26469;&#24050;&#32463;&#25552;&#20379;&#20102;&#19968;&#31181;&#30830;&#23450;&#22871;&#21033;&#20132;&#26131;&#30340;&#26426;&#21046;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#27010;&#36848;&#20102;&#36890;&#29992;&#38381;&#21512;&#24418;&#24335;&#35299;&#20915;&#26041;&#26696;&#65292;&#29992;&#20110;$N$&#20010;&#20195;&#24065;&#30340;&#20960;&#20309;&#24179;&#22343;&#24066;&#22330;&#21046;&#36896;&#21830;&#27744;&#22871;&#21033;&#12290;&#22312;&#27169;&#25311;&#20013;&#65288;&#20351;&#29992;&#21512;&#25104;&#21644;&#21382;&#21490;&#25968;&#25454;&#65289;&#65292;&#27492;&#35299;&#20915;&#26041;&#26696;&#25552;&#20379;&#20102;&#27604;&#20984;&#20248;&#21270;&#26356;&#22909;&#30340;&#22871;&#21033;&#26426;&#20250;&#65292;&#24182;&#19988;&#33021;&#22815;&#26356;&#26089;&#22320;&#21033;&#29992;&#36825;&#20123;&#26426;&#20250;&#12290;&#27492;&#22806;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#22825;&#28982;&#22320;&#25903;&#25345;&#24182;&#34892;&#35745;&#31639;&#65288;&#19982;&#20984;&#20248;&#21270;&#19981;&#21516;&#65289;&#65292;&#33021;&#22815;&#22312;GPU&#19978;&#36827;&#34892;&#25193;&#23637;&#65292;&#20026;AMM&#24314;&#27169;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#25552;&#20379;&#20102;&#19968;&#31181;&#22522;&#20110;&#26367;&#20195;&#25968;&#20540;&#27714;&#35299;&#26041;&#27861;&#30340;&#36873;&#25321;&#12290;&#36825;&#31181;&#26032;&#26426;&#21046;&#30340;&#20302;&#35745;&#31639;&#25104;&#26412;&#36824;&#21487;&#20197;&#23454;&#29616;&#22810;&#36164;&#20135;&#27744;&#30340;&#38142;&#19978;&#22871;&#21033;&#26426;&#22120;&#20154;&#12290;
&lt;/p&gt;
&lt;p&gt;
Convex optimisation has provided a mechanism to determine arbitrage trades on automated market markets (AMMs) since almost their inception. Here we outline generic closed-form solutions for $N$-token geometric mean market maker pool arbitrage, that in simulation (with synthetic and historic data) provide better arbitrage opportunities than convex optimisers and is able to capitalise on those opportunities sooner. Furthermore, the intrinsic parallelism of the proposed approach (unlike convex optimisation) offers the ability to scale on GPUs, opening up a new approach to AMM modelling by offering an alternative to numerical-solver-based methods. The lower computational cost of running this new mechanism can also enable on-chain arbitrage bots for multi-asset pools.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#22522;&#20110;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#26816;&#27979;&#28040;&#36153;&#32773;&#25237;&#35785;&#21465;&#36848;&#20013;&#30340;&#31995;&#32479;&#24322;&#24120;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#35299;&#20915;&#20998;&#31867;&#31639;&#27861;&#23545;&#20110;&#36739;&#23567;&#19988;&#39057;&#32321;&#20986;&#29616;&#30340;&#31995;&#32479;&#24322;&#24120;&#26816;&#27979;&#30340;&#38382;&#39064;&#65292;&#24182;&#23558;&#25237;&#35785;&#21465;&#36848;&#36716;&#21270;&#20026;&#23450;&#37327;&#25968;&#25454;&#36827;&#34892;&#20998;&#26512;&#12290;</title><link>http://arxiv.org/abs/2308.11138</link><description>&lt;p&gt;
&#22522;&#20110;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#30340;&#28040;&#36153;&#32773;&#25237;&#35785;&#21465;&#36848;&#20013;&#31995;&#32479;&#24322;&#24120;&#30340;&#26816;&#27979;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
NLP-based detection of systematic anomalies among the narratives of consumer complaints. (arXiv:2308.11138v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.11138
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#22522;&#20110;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#26816;&#27979;&#28040;&#36153;&#32773;&#25237;&#35785;&#21465;&#36848;&#20013;&#30340;&#31995;&#32479;&#24322;&#24120;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#35299;&#20915;&#20998;&#31867;&#31639;&#27861;&#23545;&#20110;&#36739;&#23567;&#19988;&#39057;&#32321;&#20986;&#29616;&#30340;&#31995;&#32479;&#24322;&#24120;&#26816;&#27979;&#30340;&#38382;&#39064;&#65292;&#24182;&#23558;&#25237;&#35785;&#21465;&#36848;&#36716;&#21270;&#20026;&#23450;&#37327;&#25968;&#25454;&#36827;&#34892;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#22522;&#20110;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#26816;&#27979;&#25237;&#35785;&#21465;&#36848;&#20013;&#30340;&#31995;&#32479;&#24322;&#24120;&#65292;&#31616;&#31216;&#20026;&#31995;&#32479;&#24322;&#24120;&#12290;&#23613;&#31649;&#20998;&#31867;&#31639;&#27861;&#34987;&#29992;&#20110;&#26816;&#27979;&#26126;&#26174;&#30340;&#24322;&#24120;&#65292;&#20294;&#22312;&#36739;&#23567;&#19988;&#39057;&#32321;&#20986;&#29616;&#30340;&#31995;&#32479;&#24322;&#24120;&#24773;&#20917;&#19979;&#65292;&#31639;&#27861;&#21487;&#33021;&#20250;&#22240;&#20026;&#21508;&#31181;&#21407;&#22240;&#32780;&#22833;&#25928;&#65292;&#21253;&#25324;&#25216;&#26415;&#21407;&#22240;&#21644;&#20154;&#24037;&#20998;&#26512;&#24072;&#30340;&#33258;&#28982;&#38480;&#21046;&#12290;&#22240;&#27492;&#65292;&#22312;&#20998;&#31867;&#20043;&#21518;&#30340;&#19979;&#19968;&#27493;&#20013;&#65292;&#25105;&#20204;&#23558;&#25237;&#35785;&#21465;&#36848;&#36716;&#21270;&#20026;&#23450;&#37327;&#25968;&#25454;&#65292;&#28982;&#21518;&#20351;&#29992;&#19968;&#31181;&#31639;&#27861;&#26469;&#26816;&#27979;&#31995;&#32479;&#24322;&#24120;&#12290;&#25105;&#20204;&#20351;&#29992;&#28040;&#36153;&#32773;&#37329;&#34701;&#20445;&#25252;&#23616;&#30340;&#28040;&#36153;&#32773;&#25237;&#35785;&#25968;&#25454;&#24211;&#20013;&#30340;&#25237;&#35785;&#21465;&#36848;&#26469;&#35828;&#26126;&#25972;&#20010;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop an NLP-based procedure for detecting systematic nonmeritorious consumer complaints, simply called systematic anomalies, among complaint narratives. While classification algorithms are used to detect pronounced anomalies, in the case of smaller and frequent systematic anomalies, the algorithms may falter due to a variety of reasons, including technical ones as well as natural limitations of human analysts. Therefore, as the next step after classification, we convert the complaint narratives into quantitative data, which are then analyzed using an algorithm for detecting systematic anomalies. We illustrate the entire procedure using complaint narratives from the Consumer Complaint Database of the Consumer Financial Protection Bureau.
&lt;/p&gt;</description></item><item><title>&#22810;&#32500;COS&#26041;&#27861;&#26159;&#19968;&#31181;&#29992;&#20110;&#23450;&#20215;&#20381;&#36182;&#20110;&#22810;&#20010;&#26631;&#30340;&#30340;&#37329;&#34701;&#26399;&#26435;&#30340;&#25968;&#20540;&#24037;&#20855;&#12290;&#26412;&#25991;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#25910;&#25947;&#24615;&#65292;&#24182;&#20998;&#26512;&#20102;&#25968;&#20540;&#19981;&#30830;&#23450;&#24230;&#23545;&#35813;&#26041;&#27861;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2307.12843</link><description>&lt;p&gt;
&#22810;&#32500;COS&#26041;&#27861;&#29992;&#20110;&#26399;&#26435;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
The multidimensional COS method for option pricing. (arXiv:2307.12843v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.12843
&lt;/p&gt;
&lt;p&gt;
&#22810;&#32500;COS&#26041;&#27861;&#26159;&#19968;&#31181;&#29992;&#20110;&#23450;&#20215;&#20381;&#36182;&#20110;&#22810;&#20010;&#26631;&#30340;&#30340;&#37329;&#34701;&#26399;&#26435;&#30340;&#25968;&#20540;&#24037;&#20855;&#12290;&#26412;&#25991;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#25910;&#25947;&#24615;&#65292;&#24182;&#20998;&#26512;&#20102;&#25968;&#20540;&#19981;&#30830;&#23450;&#24230;&#23545;&#35813;&#26041;&#27861;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#32500;COS&#26041;&#27861;&#26159;&#19968;&#31181;&#29992;&#20110;&#23450;&#20215;&#20381;&#36182;&#20110;&#22810;&#20010;&#26631;&#30340;&#30340;&#37329;&#34701;&#26399;&#26435;&#30340;&#25968;&#20540;&#24037;&#20855;&#12290;&#35813;&#26041;&#27861;&#21033;&#29992;&#26631;&#30340;&#30340;&#23545;&#25968;&#25910;&#30410;&#29575;&#30340;&#29305;&#24449;&#20989;&#25968;&#966;&#65292;&#24182;&#19988;&#24403;&#25903;&#20184;&#20989;&#25968;&#30340;&#20613;&#37324;&#21494;&#20313;&#24358;&#31995;&#25968;v_k&#20197;&#38381;&#24335;&#24418;&#24335;&#32473;&#23450;&#26102;&#65292;&#20855;&#26377;&#20248;&#21183;&#12290;&#28982;&#32780;&#65292;&#22312;&#37325;&#35201;&#24773;&#20917;&#19979;&#65292;&#966;&#21644;v_k&#37117;&#27809;&#26377;&#35299;&#26512;&#22320;&#32473;&#20986;&#65292;&#32780;&#38656;&#35201;&#36890;&#36807;&#25968;&#20540;&#26041;&#27861;&#24674;&#22797;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22810;&#32500;COS&#26041;&#27861;&#30340;&#25910;&#25947;&#24615;&#65292;&#21253;&#25324;&#23545;&#966;&#21644;v_k&#30340;&#25968;&#20540;&#19981;&#30830;&#23450;&#24230;&#30340;&#32771;&#34385;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#26377;&#21161;&#20110;&#29702;&#35299;COS&#26041;&#27861;&#20013;&#23545;&#966;&#21644;v_k&#30340;&#36817;&#20284;&#35823;&#24046;&#22914;&#20309;&#20256;&#25773;&#12290;
&lt;/p&gt;
&lt;p&gt;
The multidimensional COS method is a numerical tool to price financial options, which depend on several underlyings. The method makes use of the characteristic function $\varphi$ of the logarithmic returns of the underlyings and it is advantageous if the Fourier-cosine coefficients $v_{\boldsymbol{k}}$ of the payoff function are given in closed-form. However, in important cases, neither $\varphi$ nor $v_{\boldsymbol{k}}$ are given analytically but need to be recovered numerically. In this article, we prove the convergence of the multidimensional COS method including numerical uncertainty on $\varphi$ and $v_{\boldsymbol{k}}$. Our analysis helps to understand how the approximation errors on $\varphi$ and $v_{\boldsymbol{k}}$ propagate in the COS method.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21457;&#29616;&#22312;&#22234;&#24466;&#22256;&#22659;&#20013;&#65292;&#30830;&#23450;&#30340;&#37325;&#22797;&#20132;&#20114;&#27010;&#29575;&#38408;&#20540;&#23558;&#23548;&#33268;&#26234;&#33021;&#20307;&#20174;&#30452;&#35273;&#30340;&#32972;&#21467;&#32773;&#36716;&#21464;&#20026;&#21452;&#37325;&#36807;&#31243;&#30340;&#21512;&#20316;&#32773;&#65307;&#26356;&#23567;&#30340;&#33410;&#28857;&#24230;&#25968;&#38477;&#20302;&#20102;&#21452;&#37325;&#36807;&#31243;&#21512;&#20316;&#32773;&#30340;&#25104;&#21151;&#29575;&#12290;</title><link>http://arxiv.org/abs/2306.11376</link><description>&lt;p&gt;
&#32467;&#26500;&#21270;&#20154;&#32676;&#20013;&#35748;&#30693;&#21644;&#21512;&#20316;&#30340;&#20849;&#21516;&#28436;&#21270;&#22312;&#22686;&#24378;&#23398;&#20064;&#20013;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Coevolution of cognition and cooperation in structured populations under reinforcement learning. (arXiv:2306.11376v1 [physics.soc-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.11376
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21457;&#29616;&#22312;&#22234;&#24466;&#22256;&#22659;&#20013;&#65292;&#30830;&#23450;&#30340;&#37325;&#22797;&#20132;&#20114;&#27010;&#29575;&#38408;&#20540;&#23558;&#23548;&#33268;&#26234;&#33021;&#20307;&#20174;&#30452;&#35273;&#30340;&#32972;&#21467;&#32773;&#36716;&#21464;&#20026;&#21452;&#37325;&#36807;&#31243;&#30340;&#21512;&#20316;&#32773;&#65307;&#26356;&#23567;&#30340;&#33410;&#28857;&#24230;&#25968;&#38477;&#20302;&#20102;&#21452;&#37325;&#36807;&#31243;&#21512;&#20316;&#32773;&#30340;&#25104;&#21151;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21463;&#24378;&#21270;&#23398;&#20064;&#24433;&#21709;&#19979;&#22234;&#24466;&#22256;&#22659;&#38382;&#39064;&#20013;&#26234;&#33021;&#20307;&#22312;&#35268;&#21017;&#21270;&#32593;&#32476;&#20013;&#30456;&#20114;&#20132;&#20114;&#65292;&#24182;&#33021;&#20102;&#35299;&#21040;&#23427;&#20204;&#26159;&#21542;&#25903;&#20184;&#32771;&#34385;&#20132;&#20114;&#30340;&#36153;&#29992;&#12290;&#30456;&#23545;&#20110;&#25991;&#29486;&#20013;&#20351;&#29992;&#30340;&#20854;&#20182;&#34892;&#20026;&#35268;&#21017;&#65292;&#65288;i&#65289;&#25105;&#20204;&#30830;&#35748;&#20102;&#37325;&#22797;&#20132;&#20114;&#27010;&#29575;&#30340;&#38408;&#20540;&#65292;&#20174;&#30452;&#35273;&#30340;&#32972;&#21467;&#32773;&#36716;&#21464;&#20026;&#21452;&#37325;&#36807;&#31243;&#30340;&#21512;&#20316;&#32773;&#65307;&#65288;ii&#65289;&#25105;&#20204;&#21457;&#29616;&#33410;&#28857;&#24230;&#25968;&#25198;&#28436;&#20102;&#19981;&#21516;&#30340;&#35282;&#33394;&#65292;&#26356;&#23567;&#30340;&#24230;&#25968;&#38477;&#20302;&#20102;&#21452;&#37325;&#36807;&#31243;&#21512;&#20316;&#32773;&#30340;&#36827;&#21270;&#25104;&#21151;&#29575;&#65307;&#65288;iii&#65289;&#25105;&#20204;&#35266;&#23519;&#21040;&#20102;&#26356;&#39640;&#39057;&#32321;&#30340;&#27785;&#24605;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the evolution of behavior under reinforcement learning in a Prisoner's Dilemma where agents interact in a regular network and can learn about whether they play one-shot or repeatedly by incurring a cost of deliberation. With respect to other behavioral rules used in the literature, (i) we confirm the existence of a threshold value of the probability of repeated interaction, switching the emergent behavior from intuitive defector to dual-process cooperator; (ii) we find a different role of the node degree, with smaller degrees reducing the evolutionary success of dual-process cooperators; (iii) we observe a higher frequency of deliberation.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#34920;&#26126;&#20844;&#21496;&#31895;&#30053;&#30340;&#24037;&#36164;&#35774;&#23450;&#23548;&#33268;&#24037;&#36164;&#22312;&#25972;&#25968;&#19978;&#30340;&#32858;&#38598;&#65292;&#21516;&#26102;&#23545;&#20844;&#21496;&#30340;&#24066;&#22330;&#32467;&#26524;&#20135;&#29983;&#20102;&#36127;&#38754;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2206.01114</link><description>&lt;p&gt;
&#31895;&#30053;&#24037;&#36164;&#35774;&#23450;&#19982;&#34892;&#20026;&#20844;&#21496;
&lt;/p&gt;
&lt;p&gt;
Coarse Wage-Setting and Behavioral Firms. (arXiv:2206.01114v4 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.01114
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#34920;&#26126;&#20844;&#21496;&#31895;&#30053;&#30340;&#24037;&#36164;&#35774;&#23450;&#23548;&#33268;&#24037;&#36164;&#22312;&#25972;&#25968;&#19978;&#30340;&#32858;&#38598;&#65292;&#21516;&#26102;&#23545;&#20844;&#21496;&#30340;&#24066;&#22330;&#32467;&#26524;&#20135;&#29983;&#20102;&#36127;&#38754;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26174;&#31034;&#20986;&#24037;&#36164;&#22312;&#25972;&#25968;&#19978;&#30340;&#32858;&#38598;&#37096;&#20998;&#26159;&#30001;&#20844;&#21496;&#31895;&#30053;&#30340;&#24037;&#36164;&#35774;&#23450;&#25152;&#39537;&#21160;&#30340;&#12290;&#36890;&#36807;&#23545;&#24052;&#35199;&#36229;&#36807;2&#20159;&#26032;&#21592;&#24037;&#30340;&#25968;&#25454;&#36827;&#34892;&#20998;&#26512;&#65292;&#39318;&#20808;&#24471;&#20986;&#20102;&#21512;&#21516;&#24037;&#36164;&#20542;&#21521;&#20110;&#38598;&#20013;&#22312;&#25972;&#25968;&#19978;&#30340;&#32467;&#35770;&#12290;&#28982;&#21518;&#65292;&#30740;&#31350;&#34920;&#26126;&#20542;&#21521;&#20110;&#20197;&#25972;&#25968;&#24037;&#36164;&#38599;&#20323;&#24037;&#20154;&#30340;&#20844;&#21496;&#19981;&#22815;&#22797;&#26434;&#19988;&#24066;&#22330;&#25104;&#26524;&#36739;&#24046;&#12290;&#25509;&#19979;&#26469;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#24037;&#36164;&#21457;&#24067;&#27169;&#22411;&#65292;&#22312;&#35813;&#27169;&#22411;&#20013;&#65292;&#30001;&#20110;&#20248;&#21270;&#25104;&#26412;&#30340;&#32771;&#34385;&#65292;&#20844;&#21496;&#37319;&#29992;&#20102;&#31895;&#30053;&#30340;&#25972;&#25968;&#24037;&#36164;&#65292;&#24182;&#36890;&#36807;&#20004;&#31181;&#30740;&#31350;&#35774;&#35745;&#25552;&#20379;&#20102;&#19982;&#27169;&#22411;&#39044;&#27979;&#30456;&#20851;&#30340;&#35777;&#25454;&#12290;&#26368;&#21518;&#65292;&#26412;&#25991;&#30740;&#31350;&#20102;&#31895;&#30053;&#24037;&#36164;&#35774;&#23450;&#23545;&#30456;&#20851;&#32463;&#27982;&#32467;&#26524;&#30340;&#19968;&#20123;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper shows that the bunching of wages at round numbers is partly driven by firm coarse wage-setting. Using data from over 200 million new hires in Brazil, I first establish that contracted salaries tend to cluster at round numbers. Then, I show that firms that tend to hire workers at round-numbered salaries are less sophisticated and have worse market outcomes. Next, I develop a wage-posting model in which optimization costs lead to the adoption of coarse rounded wages and provide evidence supporting two model predictions using two research designs. Finally, I examine some consequences of coarse wage-setting for relevant economic outcomes.
&lt;/p&gt;</description></item></channel></rss>