<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#30740;&#31350;&#20102;&#22312;&#28385;&#36275;&#21333;&#35843;&#24615;&#21644;&#19979;&#21322;&#36830;&#32493;&#24615;&#30340;&#26465;&#20214;&#19979;&#65292;&#30456;&#23545;&#20110;&#31532;&#19968;&#39034;&#24207;&#38543;&#26426;&#20248;&#21183;&#26465;&#20214;&#30340;&#26368;&#22823;&#31283;&#23450;&#24615;&#65292;&#25552;&#20986;&#20102;&#28385;&#36275;&#26368;&#22823;&#31283;&#23450;&#24615;&#24615;&#36136;&#30340;&#27867;&#20989;&#21487;&#20197;&#34920;&#31034;&#20026;&#19968;&#20010;&#21452;&#21464;&#37327;&#20989;&#25968;&#30340;&#26497;&#20540;&#28857;&#30340;&#34920;&#31034;&#23450;&#29702;</title><link>https://arxiv.org/abs/2403.13138</link><description>&lt;p&gt;
&#31532;&#19968;&#39034;&#24207;&#38543;&#26426;&#20248;&#21183;&#26465;&#20214;&#19979;&#30340;&#26368;&#22823;&#31283;&#23450;&#24615;
&lt;/p&gt;
&lt;p&gt;
Max-stability under first-order stochastic dominance
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.13138
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#22312;&#28385;&#36275;&#21333;&#35843;&#24615;&#21644;&#19979;&#21322;&#36830;&#32493;&#24615;&#30340;&#26465;&#20214;&#19979;&#65292;&#30456;&#23545;&#20110;&#31532;&#19968;&#39034;&#24207;&#38543;&#26426;&#20248;&#21183;&#26465;&#20214;&#30340;&#26368;&#22823;&#31283;&#23450;&#24615;&#65292;&#25552;&#20986;&#20102;&#28385;&#36275;&#26368;&#22823;&#31283;&#23450;&#24615;&#24615;&#36136;&#30340;&#27867;&#20989;&#21487;&#20197;&#34920;&#31034;&#20026;&#19968;&#20010;&#21452;&#21464;&#37327;&#20989;&#25968;&#30340;&#26497;&#20540;&#28857;&#30340;&#34920;&#31034;&#23450;&#29702;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#22823;&#31283;&#23450;&#24615;&#26159;&#25351;&#23545;&#20004;&#20010;&#36755;&#20837;&#21462;&#26368;&#22823;&#20540;&#20250;&#23548;&#33268;&#20004;&#20010;&#36755;&#20986;&#20013;&#30340;&#26368;&#22823;&#20540;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#30456;&#23545;&#20110;&#31532;&#19968;&#39034;&#24207;&#38543;&#26426;&#20248;&#21183;&#26465;&#20214;&#30340;&#26368;&#22823;&#31283;&#23450;&#24615;&#65292;&#36825;&#26159;&#20915;&#31574;&#29702;&#35770;&#20013;&#26368;&#22522;&#26412;&#30340;&#38543;&#26426;&#20248;&#21183;&#27010;&#24565;&#12290;&#22312;&#21152;&#20837;&#20102;&#21333;&#35843;&#24615;&#21644;&#19979;&#21322;&#36830;&#32493;&#24615;&#30340;&#20004;&#20010;&#26631;&#20934;&#20844;&#29702;&#21518;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#20010;&#20851;&#20110;&#28385;&#36275;&#26368;&#22823;&#31283;&#23450;&#24615;&#24615;&#36136;&#30340;&#27867;&#20989;&#30340;&#34920;&#31034;&#23450;&#29702;&#65292;&#32467;&#26524;&#34920;&#26126;&#36825;&#20123;&#27867;&#20989;&#21487;&#20197;&#34920;&#31034;&#20026;&#19968;&#20010;&#21452;&#21464;&#37327;&#20989;&#25968;&#30340;&#26497;&#20540;&#28857;&#12290;&#25105;&#20204;&#34920;&#24449;&#30340;&#27867;&#20989;&#21253;&#25324;&#20102;&#39118;&#38505;&#24230;&#37327;&#25991;&#29486;&#20013;&#30340;&#29305;&#27530;&#31867;&#21035;&#65292;&#22914;&#22522;&#20934;&#25439;&#22833;Value at Risk (VaR) &#21644; $\Lambda$-&#20998;&#20301;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.13138v1 Announce Type: new  Abstract: Max-stability is the property that taking a maximum between two inputs results in a maximum between two outputs. We investigate max-stability with respect to first-order stochastic dominance, the most fundamental notion of stochastic dominance in decision theory. Under two additional standard axioms of monotonicity and lower semicontinuity, we establish a representation theorem for functionals satisfying max-stability, which turns out to be represented by the supremum of a bivariate function. Our characterized functionals encompass special classes of functionals in the literature of risk measures, such as benchmark-loss Value at Risk (VaR) and $\Lambda$-quantile.
&lt;/p&gt;</description></item></channel></rss>