<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#20351;&#29992;&#32479;&#35745;&#29289;&#29702;&#23398;&#21644;&#24066;&#22330;&#33829;&#38144;&#21160;&#24577;&#30340;&#29702;&#35770;&#26694;&#26550;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#21019;&#26032;&#30340;&#26041;&#31243;&#65292;&#20934;&#30830;&#25429;&#25417;&#20102;&#24191;&#21578;&#25903;&#20986;&#19982;&#28040;&#36153;&#32773;&#21453;&#24212;&#20043;&#38388;&#30340;&#22797;&#26434;&#20851;&#31995;&#65292;&#24182;&#39564;&#35777;&#20102;&#20854;&#26377;&#25928;&#24615;&#12290;</title><link>https://arxiv.org/abs/2404.02175</link><description>&lt;p&gt;
&#28040;&#36153;&#32773;&#21453;&#24212;&#30340;&#31038;&#20250;&#21160;&#24577;&#65306;&#34701;&#21512;&#32479;&#35745;&#29289;&#29702;&#23398;&#19982;&#33829;&#38144;&#21160;&#24577;&#30340;&#32479;&#19968;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
Social Dynamics of Consumer Response: A Unified Framework Integrating Statistical Physics and Marketing Dynamics
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02175
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#32479;&#35745;&#29289;&#29702;&#23398;&#21644;&#24066;&#22330;&#33829;&#38144;&#21160;&#24577;&#30340;&#29702;&#35770;&#26694;&#26550;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#21019;&#26032;&#30340;&#26041;&#31243;&#65292;&#20934;&#30830;&#25429;&#25417;&#20102;&#24191;&#21578;&#25903;&#20986;&#19982;&#28040;&#36153;&#32773;&#21453;&#24212;&#20043;&#38388;&#30340;&#22797;&#26434;&#20851;&#31995;&#65292;&#24182;&#39564;&#35777;&#20102;&#20854;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29702;&#35299;&#28040;&#36153;&#32773;&#23545;&#24191;&#21578;&#36755;&#20837;&#30340;&#21453;&#24212;&#23545;&#20110;&#26088;&#22312;&#20248;&#21270;&#24191;&#21578;&#31574;&#30053;&#24182;&#25552;&#39640;&#24191;&#21578;&#27963;&#21160;&#26377;&#25928;&#24615;&#30340;&#33829;&#38144;&#20154;&#21592;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#30740;&#31350;&#36890;&#36807;&#24212;&#29992;&#28304;&#33258;&#29289;&#29702;&#23398;&#21644;&#31038;&#20250;&#24515;&#29702;&#23398;&#30340;&#29702;&#35770;&#26694;&#26550;&#65292;&#30740;&#31350;&#28040;&#36153;&#32773;&#34892;&#20026;&#30340;&#22797;&#26434;&#24615;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21019;&#26032;&#30340;&#26041;&#31243;&#65292;&#25429;&#25417;&#20102;&#24191;&#21578;&#25903;&#20986;&#19982;&#28040;&#36153;&#32773;&#21453;&#24212;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#21033;&#29992;&#20102;&#35832;&#22914;&#23545;&#31216;&#24615;&#12289;&#26631;&#24230;&#24459;&#21644;&#30456;&#21464;&#31561;&#27010;&#24565;&#12290;&#36890;&#36807;&#23558;&#25105;&#20204;&#30340;&#26041;&#31243;&#39564;&#35777;&#19982;Michaelis-Menten&#21644;Hill&#26041;&#31243;&#31561;&#33879;&#21517;&#27169;&#22411;&#30456;&#27604;&#36739;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20854;&#22312;&#20934;&#30830;&#34920;&#31034;&#28040;&#36153;&#32773;&#21453;&#24212;&#21160;&#24577;&#22797;&#26434;&#24615;&#26041;&#38754;&#30340;&#26377;&#25928;&#24615;&#12290;&#20998;&#26512;&#24378;&#35843;&#20102;&#20851;&#38190;&#27169;&#22411;&#21442;&#25968;&#65288;&#22914;&#33829;&#38144;&#25928;&#26524;&#12289;&#21453;&#24212;&#25935;&#24863;&#24230;&#21644;&#34892;&#20026;&#25935;&#24863;&#24230;&#65289;&#23545;&#24433;&#21709;&#28040;&#36153;&#32773;&#34892;&#20026;&#30340;&#37325;&#35201;&#24615;&#12290;&#35813;&#30740;&#31350;&#25506;&#35752;&#20102;&#24191;&#21578;&#21830;&#21644;&#33829;&#38144;&#20154;&#21592;&#30340;&#23454;&#38469;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02175v1 Announce Type: cross  Abstract: Comprehending how consumers react to advertising inputs is essential for marketers aiming to optimize advertising strategies and improve campaign effectiveness. This study examines the complex nature of consumer behaviour by applying theoretical frameworks derived from physics and social psychology. We present an innovative equation that captures the relation between spending on advertising and consumer response, using concepts such as symmetries, scaling laws, and phase transitions. By validating our equation against well-known models such as the Michaelis-Menten and Hill equations, we prove its effectiveness in accurately representing the complexity of consumer response dynamics. The analysis emphasizes the importance of key model parameters, such as marketing effectiveness, response sensitivity, and behavioural sensitivity, in influencing consumer behaviour. The work explores the practical implications for advertisers and marketers,
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20174;&#22823;&#25968;&#25454;&#35282;&#24230;&#32508;&#36848;&#20102;&#20225;&#19994;&#36130;&#21153;&#39118;&#38505;&#20998;&#26512;&#30340;&#30740;&#31350;&#29616;&#29366;&#65292;&#22238;&#39038;&#20102;250&#22810;&#31687;&#20195;&#34920;&#24615;&#25991;&#31456;&#12290;</title><link>http://arxiv.org/abs/2211.14997</link><description>&lt;p&gt;
&#20174;&#22823;&#25968;&#25454;&#35282;&#24230;&#30475;&#20225;&#19994;&#36130;&#21153;&#39118;&#38505;&#20998;&#26512;&#30340;&#32508;&#36848;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
A Comprehensive Survey on Enterprise Financial Risk Analysis from Big Data Perspective. (arXiv:2211.14997v3 [q-fin.RM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.14997
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20174;&#22823;&#25968;&#25454;&#35282;&#24230;&#32508;&#36848;&#20102;&#20225;&#19994;&#36130;&#21153;&#39118;&#38505;&#20998;&#26512;&#30340;&#30740;&#31350;&#29616;&#29366;&#65292;&#22238;&#39038;&#20102;250&#22810;&#31687;&#20195;&#34920;&#24615;&#25991;&#31456;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20225;&#19994;&#36130;&#21153;&#39118;&#38505;&#20998;&#26512;&#26088;&#22312;&#39044;&#27979;&#20225;&#19994;&#26410;&#26469;&#30340;&#36130;&#21153;&#39118;&#38505;&#12290;&#30001;&#20110;&#20854;&#24191;&#27867;&#32780;&#37325;&#35201;&#30340;&#24212;&#29992;&#65292;&#20225;&#19994;&#36130;&#21153;&#39118;&#38505;&#20998;&#26512;&#19968;&#30452;&#26159;&#37329;&#34701;&#21644;&#31649;&#29702;&#39046;&#22495;&#30340;&#26680;&#24515;&#30740;&#31350;&#20027;&#39064;&#12290;&#22522;&#20110;&#20808;&#36827;&#30340;&#35745;&#31639;&#26426;&#31185;&#23398;&#21644;&#20154;&#24037;&#26234;&#33021;&#25216;&#26415;&#65292;&#20225;&#19994;&#39118;&#38505;&#20998;&#26512;&#30740;&#31350;&#27491;&#22312;&#32463;&#21382;&#24555;&#36895;&#21457;&#23637;&#24182;&#21462;&#24471;&#37325;&#35201;&#36827;&#23637;&#12290;&#22240;&#27492;&#65292;&#20840;&#38754;&#35780;&#20272;&#30456;&#20851;&#30740;&#31350;&#26082;&#26377;&#24517;&#35201;&#24615;&#21448;&#20855;&#25361;&#25112;&#24615;&#12290;&#34429;&#28982;&#24050;&#32463;&#23384;&#22312;&#19968;&#20123;&#26377;&#20215;&#20540;&#21644;&#20196;&#20154;&#21360;&#35937;&#28145;&#21051;&#30340;&#20851;&#20110;&#20225;&#19994;&#39118;&#38505;&#20998;&#26512;&#30340;&#32508;&#36848;&#65292;&#20294;&#36825;&#20123;&#32508;&#36848;&#21333;&#29420;&#20171;&#32461;&#20102;&#26041;&#27861;&#65292;&#32570;&#20047;&#20225;&#19994;&#36130;&#21153;&#39118;&#38505;&#20998;&#26512;&#30340;&#26368;&#26032;&#36827;&#23637;&#12290;&#30456;&#21453;&#65292;&#26412;&#25991;&#23581;&#35797;&#20174;&#22823;&#25968;&#25454;&#30340;&#35282;&#24230;&#25552;&#20379;&#20225;&#19994;&#39118;&#38505;&#20998;&#26512;&#26041;&#27861;&#30340;&#31995;&#32479;&#25991;&#29486;&#32508;&#36848;&#65292;&#22238;&#39038;&#20102;&#36229;&#36807;250&#31687;&#20195;&#34920;&#24615;&#25991;&#31456;&#12290;
&lt;/p&gt;
&lt;p&gt;
Enterprise financial risk analysis aims at predicting the future financial risk of enterprises. Due to its wide and significant application, enterprise financial risk analysis has always been the core research topic in the fields of Finance and Management. Based on advanced computer science and artificial intelligence technologies, enterprise risk analysis research is experiencing rapid developments and making significant progress. Therefore, it is both necessary and challenging to comprehensively review the relevant studies. Although there are already some valuable and impressive surveys on enterprise risk analysis from the perspective of Finance and Management, these surveys introduce approaches in a relatively isolated way and lack recent advances in enterprise financial risk analysis. In contrast, this paper attempts to provide a systematic literature survey of enterprise risk analysis approaches from Big Data perspective, which reviews more than 250 representative articles in the 
&lt;/p&gt;</description></item></channel></rss>