<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#37329;&#34701;&#32463;&#27982;&#23398;&#20013;&#30340;&#22522;&#26412;&#25237;&#36164;&#32452;&#21512;&#36873;&#25321;&#26041;&#27861;&#30340;&#38656;&#27714;&#20215;&#26684;&#24377;&#24615;&#38590;&#20197;&#24377;&#24615;&#65292;&#36825;&#23545;&#24378;&#24377;&#24615;&#25237;&#36164;&#32773;&#30340;&#20351;&#29992;&#25552;&#20986;&#20102;&#30097;&#34385;&#65292;&#24182;&#37327;&#21270;&#20102;&#38500;&#38480;&#21046;&#22871;&#21033;&#25705;&#25830;&#20043;&#22806;&#30340;&#21453;&#23545;&#28508;&#22312;&#38169;&#20215;&#36827;&#34892;&#20132;&#26131;&#30340;&#38590;&#24230;&#65292;&#21453;&#20107;&#23454;&#23454;&#39564;&#34920;&#29616;&#20986;&#24040;&#22823;&#30340;alpha&#12290;</title><link>http://arxiv.org/abs/2303.14533</link><description>&lt;p&gt;
&#37327;&#21270;&#25237;&#36164;&#30340;&#24377;&#24615;&#24615;
&lt;/p&gt;
&lt;p&gt;
The Elasticity of Quantitative Investment. (arXiv:2303.14533v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14533
&lt;/p&gt;
&lt;p&gt;
&#37329;&#34701;&#32463;&#27982;&#23398;&#20013;&#30340;&#22522;&#26412;&#25237;&#36164;&#32452;&#21512;&#36873;&#25321;&#26041;&#27861;&#30340;&#38656;&#27714;&#20215;&#26684;&#24377;&#24615;&#38590;&#20197;&#24377;&#24615;&#65292;&#36825;&#23545;&#24378;&#24377;&#24615;&#25237;&#36164;&#32773;&#30340;&#20351;&#29992;&#25552;&#20986;&#20102;&#30097;&#34385;&#65292;&#24182;&#37327;&#21270;&#20102;&#38500;&#38480;&#21046;&#22871;&#21033;&#25705;&#25830;&#20043;&#22806;&#30340;&#21453;&#23545;&#28508;&#22312;&#38169;&#20215;&#36827;&#34892;&#20132;&#26131;&#30340;&#38590;&#24230;&#65292;&#21453;&#20107;&#23454;&#23454;&#39564;&#34920;&#29616;&#20986;&#24040;&#22823;&#30340;alpha&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37329;&#34701;&#32463;&#27982;&#23398;&#20013;&#22522;&#26412;&#30340;&#25237;&#36164;&#32452;&#21512;&#36873;&#25321;&#26041;&#27861;&#30340;&#38656;&#27714;&#20215;&#26684;&#24377;&#24615;&#26159;&#22810;&#23569;&#65311;&#25991;&#29486;&#20013;&#30340;12&#20010;&#27169;&#22411;&#34920;&#29616;&#20986;&#24778;&#20154;&#30340;&#19981;&#24377;&#24615;&#38656;&#27714;&#65292;&#19982;&#32463;&#20856;&#27169;&#22411;&#24418;&#25104;&#23545;&#27604;&#12290;&#36825;&#26159;&#30001;&#20110;&#23454;&#38469;&#20013;&#21453;&#23545;&#20215;&#26684;&#21464;&#21270;&#36827;&#34892;&#20132;&#26131;&#30340;&#38590;&#24230;&#65292;&#19982;&#38656;&#27714;&#24377;&#24615;&#20272;&#35745;&#30456;&#19968;&#33268;&#12290;&#36825;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;&#22238;&#31572;&#19981;&#24377;&#24615;&#24066;&#22330;&#20551;&#35774;&#30340;&#26041;&#27861;&#65292;&#23545;&#20110;&#29702;&#35770;&#27169;&#22411;&#20013;&#20351;&#29992;&#24378;&#24377;&#24615;&#25237;&#36164;&#32773;&#23384;&#22312;&#37325;&#35201;&#38382;&#39064;&#65292;&#24182;&#37327;&#21270;&#20102;&#38500;&#22871;&#21033;&#25705;&#25830;&#30340;&#26631;&#20934;&#38480;&#21046;&#20043;&#22806;&#30340;&#21453;&#23545;&#28508;&#22312;&#38169;&#20215;&#36827;&#34892;&#20132;&#26131;&#30340;&#38590;&#24230;&#12290;&#36825;&#20123;&#38656;&#27714;&#20989;&#25968;&#30340;&#21453;&#20107;&#23454;&#23454;&#39564;&#34920;&#29616;&#20986;&#24040;&#22823;&#32780;&#25345;&#20037;&#30340;alpha&#12290;
&lt;/p&gt;
&lt;p&gt;
What is the price elasticity of demand for canonical portfolio choice methods in financial economics? Twelve models from the literature exhibit strikingly inelastic demand, in contrast to classical models. This is due to the difficulty of trading against price changes in practice, and is consistent with demand elasticity estimates. This provides a novel answer to the inelastic markets hypothesis, raises important concerns for the use of strongly elastic investors in theory models, and quantifies the difficulty of trading against potential mispricing aside from the standard limits to arbitrage frictions. Counterfactual experiments with these demand functions exhibit large and persistent alpha.
&lt;/p&gt;</description></item></channel></rss>