<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#22797;&#21512;&#25490;&#24207;&#26159;&#19968;&#20010;&#26032;&#30340;&#25490;&#24207;&#26694;&#26550;&#65292;&#36890;&#36807;&#23558;&#19981;&#21516;&#31867;&#22411;&#30340;&#24037;&#20316;&#32773;&#20998;&#37197;&#21040;&#21516;&#19968;&#20010;&#32844;&#19994;&#20013;&#24182;&#21516;&#26102;&#36827;&#34892;&#27491;&#21521;&#21644;&#36127;&#21521;&#25490;&#24207;&#26469;&#23454;&#29616;&#12290;&#24403;&#22266;&#23450;&#25237;&#36164;&#20943;&#36731;&#20102;&#19981;&#21305;&#37197;&#30340;&#21487;&#21464;&#25104;&#26412;&#26102;&#65292;&#22797;&#21512;&#25490;&#24207;&#21487;&#20197;&#20135;&#29983;&#22823;&#37327;&#30340;&#24037;&#36164;&#20998;&#25955;&#31243;&#24230;&#12290;</title><link>http://arxiv.org/abs/2303.06701</link><description>&lt;p&gt;
&#22797;&#21512;&#25490;&#24207;
&lt;/p&gt;
&lt;p&gt;
Composite Sorting. (arXiv:2303.06701v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.06701
&lt;/p&gt;
&lt;p&gt;
&#22797;&#21512;&#25490;&#24207;&#26159;&#19968;&#20010;&#26032;&#30340;&#25490;&#24207;&#26694;&#26550;&#65292;&#36890;&#36807;&#23558;&#19981;&#21516;&#31867;&#22411;&#30340;&#24037;&#20316;&#32773;&#20998;&#37197;&#21040;&#21516;&#19968;&#20010;&#32844;&#19994;&#20013;&#24182;&#21516;&#26102;&#36827;&#34892;&#27491;&#21521;&#21644;&#36127;&#21521;&#25490;&#24207;&#26469;&#23454;&#29616;&#12290;&#24403;&#22266;&#23450;&#25237;&#36164;&#20943;&#36731;&#20102;&#19981;&#21305;&#37197;&#30340;&#21487;&#21464;&#25104;&#26412;&#26102;&#65292;&#22797;&#21512;&#25490;&#24207;&#21487;&#20197;&#20135;&#29983;&#22823;&#37327;&#30340;&#24037;&#36164;&#20998;&#25955;&#31243;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#25490;&#24207;&#26694;&#26550;&#65306;&#22797;&#21512;&#25490;&#24207;&#12290;&#22797;&#21512;&#25490;&#24207;&#21253;&#25324;&#65288;1&#65289;&#23558;&#19981;&#21516;&#30340;&#24037;&#20316;&#32773;&#31867;&#22411;&#20998;&#37197;&#21040;&#21516;&#19968;&#20010;&#32844;&#19994;&#20013;&#65292;&#20197;&#21450;&#65288;2&#65289;&#32473;&#23450;&#30340;&#24037;&#20316;&#32773;&#31867;&#22411;&#21516;&#26102;&#21442;&#19982;&#27491;&#21521;&#25490;&#24207;&#21644;&#36127;&#21521;&#25490;&#24207;&#12290;&#24403;&#22266;&#23450;&#25237;&#36164;&#20943;&#36731;&#20102;&#19981;&#21305;&#37197;&#30340;&#21487;&#21464;&#25104;&#26412;&#26102;&#65292;&#22797;&#21512;&#25490;&#24207;&#23601;&#20250;&#20986;&#29616;&#12290;&#25105;&#20204;&#23436;&#20840;&#25551;&#36848;&#20102;&#26368;&#20248;&#25490;&#24207;&#65292;&#24182;&#19988;&#36824;&#35777;&#26126;&#20102;&#24403;&#19981;&#21305;&#37197;&#25104;&#26412;&#30340;&#20985;&#24230;&#36739;&#23567;&#26102;&#65292;&#25490;&#24207;&#26356;&#20026;&#31215;&#26497;&#12290;&#28982;&#21518;&#25105;&#20204;&#23545;&#22343;&#34913;&#24037;&#36164;&#36827;&#34892;&#20102;&#25551;&#36848;&#12290;&#24037;&#36164;&#20855;&#26377;&#21306;&#22495;&#23618;&#27425;&#32467;&#26500;&#65292;&#30456;&#23545;&#24037;&#36164;&#20165;&#21462;&#20915;&#20110;&#25216;&#33021;&#32676;&#20307;&#20869;&#30340;&#25490;&#24207;&#12290;&#23450;&#37327;&#19978;&#65292;&#22797;&#21512;&#25490;&#24207;&#21487;&#20197;&#22312;&#32654;&#22269;&#30340;&#32844;&#19994;&#20869;&#20135;&#29983;&#30456;&#24403;&#22823;&#30340;&#24037;&#36164;&#20998;&#25955;&#31243;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a new sorting framework: composite sorting. Composite sorting comprises of (1) distinct worker types assigned to the same occupation, and (2) a given worker type simultaneously being part of both positive and negative sorting. Composite sorting arises when fixed investments mitigate variable costs of mismatch. We completely characterize optimal sorting and additionally show it is more positive when mismatch costs are less concave. We then characterize equilibrium wages. Wages have a regional hierarchical structure relative wages depend solely on sorting within skill groups. Quantitatively, composite sorting can generate a sizable portion of within-occupations wage dispersion in the US.
&lt;/p&gt;</description></item></channel></rss>