<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#35770;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#27491;&#21521;&#21033;&#29575;&#30340;&#24377;&#24615;&#23383;&#31526;&#20018;&#27169;&#22411;&#65292;&#36890;&#36807;&#35299;&#37322;&#24066;&#22330;&#21147;&#37327;&#23545;&#37051;&#36817;&#26399;&#38480;&#21033;&#29575;&#30340;&#33258;&#25105;&#21442;&#29031;&#24433;&#21709;&#65292;&#23454;&#29616;&#20102;&#23545;&#25972;&#20010;FRC&#30456;&#20851;&#32467;&#26500;&#30340;&#20934;&#30830;&#20877;&#29616;&#65292;&#20165;&#38656;&#20004;&#20010;&#31283;&#23450;&#21442;&#25968;&#12290;</title><link>https://arxiv.org/abs/2403.18126</link><description>&lt;p&gt;
&#37325;&#26032;&#23457;&#35270;&#27491;&#21521;&#21033;&#29575;&#30340;&#24377;&#24615;&#23383;&#31526;&#20018;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Revisiting Elastic String Models of Forward Interest Rates
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18126
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#27491;&#21521;&#21033;&#29575;&#30340;&#24377;&#24615;&#23383;&#31526;&#20018;&#27169;&#22411;&#65292;&#36890;&#36807;&#35299;&#37322;&#24066;&#22330;&#21147;&#37327;&#23545;&#37051;&#36817;&#26399;&#38480;&#21033;&#29575;&#30340;&#33258;&#25105;&#21442;&#29031;&#24433;&#21709;&#65292;&#23454;&#29616;&#20102;&#23545;&#25972;&#20010;FRC&#30456;&#20851;&#32467;&#26500;&#30340;&#20934;&#30830;&#20877;&#29616;&#65292;&#20165;&#38656;&#20004;&#20010;&#31283;&#23450;&#21442;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
25&#24180;&#21069;&#65292;&#20960;&#20301;&#20316;&#32773;&#25552;&#20986;&#23558;&#27491;&#21521;&#21033;&#29575;&#26354;&#32447;&#65288;FRC&#65289;&#24314;&#27169;&#20026;&#19968;&#26681;&#24377;&#24615;&#23383;&#31526;&#20018;&#65292;&#27839;&#20854;&#20256;&#25773;&#29305;&#24322;&#20914;&#20987;&#65292;&#32771;&#34385;&#21040;&#19981;&#21516;&#21040;&#26399;&#26085;&#38388;&#22238;&#25253;&#30456;&#20851;&#24615;&#30340;&#29420;&#29305;&#32467;&#26500;&#12290;&#26412;&#25991;&#37325;&#26032;&#23457;&#35270;&#24052;&#22862;&#21644;&#24067;&#22799;&#23572;&#65288;2004&#65289;&#30340;&#8220;&#21018;&#24615;&#8221;&#24377;&#24615;&#23383;&#31526;&#20018;&#22330;&#35770;&#65292;&#20351;&#20854;&#24494;&#35266;&#22522;&#30784;&#26356;&#21152;&#36879;&#26126;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#21487;&#20197;&#35299;&#37322;&#24066;&#22330;&#21147;&#37327;&#23545;&#37051;&#36817;&#26399;&#38480;&#21033;&#29575;&#30340;&#33258;&#25105;&#21442;&#29031;&#26041;&#24335;&#30340;&#24433;&#21709;&#12290;&#35813;&#27169;&#22411;&#31616;&#27905;&#19988;&#33021;&#20934;&#30830;&#22320;&#22312;1994-2023&#24180;&#38388;&#20877;&#29616;&#25972;&#20010;FRC&#30340;&#30456;&#20851;&#32467;&#26500;&#65292;&#35823;&#24046;&#20302;&#20110;2%&#12290;&#25105;&#20204;&#20165;&#38656;&#20004;&#20010;&#21442;&#25968;&#65292;&#20854;&#20540;&#38500;&#20102;2009-2014&#24180;&#37327;&#21270;&#23485;&#26494;&#26399;&#38388;&#21487;&#33021;&#26377;&#25152;&#21464;&#21270;&#22806;&#38750;&#24120;&#31283;&#23450;&#12290;&#26102;&#38388;&#20998;&#36776;&#29575;&#65288;&#20063;&#31216;&#20026;Epps&#25928;&#24212;&#65289;&#23545;&#30456;&#20851;&#24615;&#30340;&#20381;&#36182;&#20063;&#34987;&#24544;&#23454;&#22320;&#20877;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18126v1 Announce Type: new  Abstract: Twenty five years ago, several authors proposed to model the forward interest rate curve (FRC) as an elastic string along which idiosyncratic shocks propagate, accounting for the peculiar structure of the return correlation across different maturities. In this paper, we revisit the specific "stiff'' elastic string field theory of Baaquie and Bouchaud (2004) in a way that makes its micro-foundation more transparent. Our model can be interpreted as capturing the effect of market forces that set the rates of nearby tenors in a self-referential fashion. The model is parsimonious and accurately reproduces the whole correlation structure of the FRC over the time period 1994-2023, with an error below 2%. We need only two parameters, the values of which being very stable except perhaps during the Quantitative Easing period 2009-2014. The dependence of correlation on time resolution (also called the Epps effect) is also faithfully reproduced with
&lt;/p&gt;</description></item><item><title>&#22312;&#20108;&#27425;&#20132;&#26131;&#25104;&#26412;&#35774;&#23450;&#19979;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#38750;&#24120;&#31616;&#21333;&#30340;&#27010;&#29575;&#35299;&#26469;&#26368;&#22823;&#21270;&#26399;&#26395;&#30340;&#32456;&#31471;&#36130;&#23500;&#65292;&#20026;&#20998;&#25968;&#24067;&#26391;&#36816;&#21160;&#19979;&#25237;&#36164;&#32773;&#20449;&#24687;&#27969;&#22810;&#26679;&#21270;&#30340;&#24773;&#20917;&#25552;&#20379;&#20102;&#19968;&#33324;&#32467;&#26524;&#12290;</title><link>https://arxiv.org/abs/2402.14100</link><description>&lt;p&gt;
&#26377;&#20851;&#32447;&#24615;&#20215;&#26684;&#20914;&#20987;&#19979;&#30340;&#26368;&#20248;&#28165;&#31639;&#30340;&#27880;&#37322;
&lt;/p&gt;
&lt;p&gt;
A Note on Optimal Liquidation with Linear Price Impact
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14100
&lt;/p&gt;
&lt;p&gt;
&#22312;&#20108;&#27425;&#20132;&#26131;&#25104;&#26412;&#35774;&#23450;&#19979;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#38750;&#24120;&#31616;&#21333;&#30340;&#27010;&#29575;&#35299;&#26469;&#26368;&#22823;&#21270;&#26399;&#26395;&#30340;&#32456;&#31471;&#36130;&#23500;&#65292;&#20026;&#20998;&#25968;&#24067;&#26391;&#36816;&#21160;&#19979;&#25237;&#36164;&#32773;&#20449;&#24687;&#27969;&#22810;&#26679;&#21270;&#30340;&#24773;&#20917;&#25552;&#20379;&#20102;&#19968;&#33324;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#31687;&#31508;&#35760;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#22312;&#20108;&#27425;&#20132;&#26131;&#25104;&#26412;&#35774;&#23450;&#19979;&#26368;&#22823;&#21270;&#26399;&#26395;&#30340;&#32456;&#31471;&#36130;&#23500;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#20026;&#35813;&#38382;&#39064;&#25552;&#20379;&#20102;&#19968;&#20010;&#38750;&#24120;&#31616;&#21333;&#30340;&#27010;&#29575;&#35299;&#12290;&#23613;&#31649;&#36825;&#20010;&#38382;&#39064;&#24050;&#32463;&#24471;&#21040;&#24191;&#27867;&#30740;&#31350;&#65292;&#20294;&#25454;&#25105;&#20204;&#25152;&#30693;&#65292;&#36825;&#31181;&#31616;&#21333;&#21644;&#27010;&#29575;&#24418;&#24335;&#30340;&#35299;&#20915;&#26041;&#26696;&#22312;&#25991;&#29486;&#20013;&#23578;&#26410;&#20986;&#29616;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#24212;&#29992;&#20102;&#36825;&#19968;&#36890;&#29992;&#32467;&#26524;&#26469;&#30740;&#31350;&#39118;&#38505;&#36164;&#20135;&#30001;&#20998;&#25968;&#24067;&#26391;&#36816;&#21160;&#32473;&#23450;&#19988;&#25237;&#36164;&#32773;&#30340;&#20449;&#24687;&#27969;&#21487;&#20197;&#36827;&#34892;&#22810;&#26679;&#21270;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14100v1 Announce Type: new  Abstract: In this note we consider the maximization of the expected terminal wealth for the setup of quadratic transaction costs. First, we provide a very simple probabilistic solution to the problem. Although the problem was largely studied, as far as we know up to date this simple and probabilistic form of the solution has not appeared in the literature. Next, we apply the general result for the study of the case where the risky asset is given by a fractional Brownian Motion and the information flow of the investor can be diversified.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#21033;&#29992;P2P&#20511;&#36151;&#24179;&#21488;&#19978;&#20511;&#27454;&#20154;&#25552;&#20379;&#30340;&#25991;&#26412;&#25551;&#36848;&#26469;&#26500;&#24314;&#39118;&#38505;&#25351;&#26631;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#29983;&#25104;&#30340;&#39118;&#38505;&#35780;&#20998;&#21487;&#20197;&#26126;&#26174;&#25552;&#39640;&#20449;&#29992;&#39118;&#38505;&#20998;&#31867;&#22120;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2401.16458</link><description>&lt;p&gt;
&#20449;&#29992;&#39118;&#38505;&#19982;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30456;&#32467;&#21512;&#65306;&#20174;P2P&#20511;&#36151;&#30340;&#36151;&#27454;&#25551;&#36848;&#20013;&#26500;&#24314;&#39118;&#38505;&#25351;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;
Credit Risk Meets Large Language Models: Building a Risk Indicator from Loan Descriptions in P2P Lending. (arXiv:2401.16458v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.16458
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#21033;&#29992;P2P&#20511;&#36151;&#24179;&#21488;&#19978;&#20511;&#27454;&#20154;&#25552;&#20379;&#30340;&#25991;&#26412;&#25551;&#36848;&#26469;&#26500;&#24314;&#39118;&#38505;&#25351;&#26631;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#29983;&#25104;&#30340;&#39118;&#38505;&#35780;&#20998;&#21487;&#20197;&#26126;&#26174;&#25552;&#39640;&#20449;&#29992;&#39118;&#38505;&#20998;&#31867;&#22120;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
P2P&#20511;&#36151;&#20316;&#20026;&#19968;&#31181;&#29420;&#29305;&#30340;&#34701;&#36164;&#26426;&#21046;&#65292;&#36890;&#36807;&#22312;&#32447;&#24179;&#21488;&#23558;&#20511;&#27454;&#20154;&#19982;&#25918;&#27454;&#20154;&#32852;&#31995;&#36215;&#26469;&#12290;&#28982;&#32780;&#65292;P2P&#20511;&#36151;&#38754;&#20020;&#20449;&#24687;&#19981;&#23545;&#31216;&#30340;&#25361;&#25112;&#65292;&#22240;&#20026;&#25918;&#27454;&#20154;&#24448;&#24448;&#32570;&#20047;&#36275;&#22815;&#30340;&#25968;&#25454;&#26469;&#35780;&#20272;&#20511;&#27454;&#20154;&#30340;&#20449;&#29992;&#20215;&#20540;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#21363;&#21033;&#29992;&#20511;&#27454;&#20154;&#22312;&#36151;&#27454;&#30003;&#35831;&#36807;&#31243;&#20013;&#25552;&#20379;&#30340;&#25991;&#26412;&#25551;&#36848;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#28041;&#21450;&#20351;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#22788;&#29702;&#36825;&#20123;&#25991;&#26412;&#25551;&#36848;&#65292;LLM&#26159;&#19968;&#31181;&#33021;&#22815;&#35782;&#21035;&#25991;&#26412;&#20013;&#30340;&#27169;&#24335;&#21644;&#35821;&#20041;&#30340;&#24378;&#22823;&#24037;&#20855;&#12290;&#23558;&#36801;&#31227;&#23398;&#20064;&#24212;&#29992;&#20110;&#23558;LLM&#36866;&#24212;&#29305;&#23450;&#20219;&#21153;&#12290;&#25105;&#20204;&#20174;Lending Club&#25968;&#25454;&#38598;&#30340;&#20998;&#26512;&#32467;&#26524;&#26174;&#31034;&#65292;BERT&#29983;&#25104;&#30340;&#39118;&#38505;&#35780;&#20998;&#26174;&#33879;&#25552;&#39640;&#20102;&#20449;&#29992;&#39118;&#38505;&#20998;&#31867;&#22120;&#30340;&#24615;&#33021;&#12290;&#28982;&#32780;&#65292;&#22522;&#20110;LLM&#30340;&#31995;&#32479;&#22266;&#26377;&#30340;&#19981;&#36879;&#26126;&#24615;&#65292;&#20197;&#21450;&#28508;&#22312;&#20559;&#24046;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#38480;&#21046;&#20102;&#20854;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Peer-to-peer (P2P) lending has emerged as a distinctive financing mechanism, linking borrowers with lenders through online platforms. However, P2P lending faces the challenge of information asymmetry, as lenders often lack sufficient data to assess the creditworthiness of borrowers. This paper proposes a novel approach to address this issue by leveraging the textual descriptions provided by borrowers during the loan application process. Our methodology involves processing these textual descriptions using a Large Language Model (LLM), a powerful tool capable of discerning patterns and semantics within the text. Transfer learning is applied to adapt the LLM to the specific task at hand.  Our results derived from the analysis of the Lending Club dataset show that the risk score generated by BERT, a widely used LLM, significantly improves the performance of credit risk classifiers. However, the inherent opacity of LLM-based systems, coupled with uncertainties about potential biases, unders
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#36890;&#32960;&#20851;&#27880;&#24230;&#19982;&#36890;&#32960;&#28608;&#22686;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#21457;&#29616;&#22312;&#36890;&#32960;&#29575;&#20302;&#31283;&#23450;&#26102;&#65292;&#20154;&#20204;&#20851;&#27880;&#24230;&#36739;&#20302;&#65292;&#20294;&#19968;&#26086;&#36890;&#32960;&#29575;&#36229;&#36807;4%&#65292;&#20851;&#27880;&#24230;&#20250;&#26126;&#26174;&#22686;&#21152;&#65292;&#39640;&#20851;&#27880;&#21306;&#22495;&#30340;&#20851;&#27880;&#24230;&#26159;&#20302;&#20851;&#27880;&#21306;&#22495;&#30340;&#20004;&#20493;&#12290;&#36825;&#31181;&#20851;&#27880;&#38408;&#20540;&#30340;&#23384;&#22312;&#23548;&#33268;&#20102;&#29366;&#24577;&#20381;&#36182;&#25928;&#24212;&#65292;&#21363;&#22312;&#23485;&#26494;&#36135;&#24065;&#25919;&#31574;&#26102;&#65292;&#25104;&#26412;&#25512;&#21160;&#20914;&#20987;&#23545;&#36890;&#32960;&#30340;&#24433;&#21709;&#26356;&#22823;&#12290;&#36825;&#20123;&#32467;&#35770;&#26377;&#21161;&#20110;&#29702;&#35299;&#26368;&#36817;&#32654;&#22269;&#30340;&#36890;&#32960;&#28608;&#22686;&#29616;&#35937;&#12290;</title><link>http://arxiv.org/abs/2308.09480</link><description>&lt;p&gt;
&#36890;&#32960;&#20851;&#27880;&#38408;&#20540;&#19982;&#36890;&#32960;&#28608;&#22686;
&lt;/p&gt;
&lt;p&gt;
The Inflation Attention Threshold and Inflation Surges. (arXiv:2308.09480v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.09480
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#36890;&#32960;&#20851;&#27880;&#24230;&#19982;&#36890;&#32960;&#28608;&#22686;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#21457;&#29616;&#22312;&#36890;&#32960;&#29575;&#20302;&#31283;&#23450;&#26102;&#65292;&#20154;&#20204;&#20851;&#27880;&#24230;&#36739;&#20302;&#65292;&#20294;&#19968;&#26086;&#36890;&#32960;&#29575;&#36229;&#36807;4%&#65292;&#20851;&#27880;&#24230;&#20250;&#26126;&#26174;&#22686;&#21152;&#65292;&#39640;&#20851;&#27880;&#21306;&#22495;&#30340;&#20851;&#27880;&#24230;&#26159;&#20302;&#20851;&#27880;&#21306;&#22495;&#30340;&#20004;&#20493;&#12290;&#36825;&#31181;&#20851;&#27880;&#38408;&#20540;&#30340;&#23384;&#22312;&#23548;&#33268;&#20102;&#29366;&#24577;&#20381;&#36182;&#25928;&#24212;&#65292;&#21363;&#22312;&#23485;&#26494;&#36135;&#24065;&#25919;&#31574;&#26102;&#65292;&#25104;&#26412;&#25512;&#21160;&#20914;&#20987;&#23545;&#36890;&#32960;&#30340;&#24433;&#21709;&#26356;&#22823;&#12290;&#36825;&#20123;&#32467;&#35770;&#26377;&#21161;&#20110;&#29702;&#35299;&#26368;&#36817;&#32654;&#22269;&#30340;&#36890;&#32960;&#28608;&#22686;&#29616;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26368;&#36817;&#36890;&#32960;&#28608;&#22686;&#29190;&#21457;&#26102;&#65292;&#20844;&#20247;&#23545;&#36890;&#32960;&#30340;&#20851;&#27880;&#24230;&#24456;&#20302;&#65292;&#20294;&#19968;&#26086;&#36890;&#32960;&#24320;&#22987;&#19978;&#21319;&#65292;&#20851;&#27880;&#24230;&#36805;&#36895;&#22686;&#21152;&#12290;&#26412;&#25991;&#26500;&#24314;&#20102;&#19968;&#20010;&#19968;&#33324;&#22343;&#34913;&#36135;&#24065;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#22312;&#36890;&#32960;&#20302;&#32780;&#31283;&#23450;&#26102;&#65292;&#26368;&#20248;&#21270;&#30340;&#31574;&#30053;&#26159;&#23545;&#36890;&#32960;&#20851;&#27880;&#36739;&#23569;&#65292;&#20294;&#19968;&#26086;&#36890;&#32960;&#36229;&#36807;&#26576;&#20010;&#38408;&#20540;&#65292;&#23601;&#20250;&#22686;&#21152;&#20851;&#27880;&#24230;&#12290;&#21033;&#29992;&#35843;&#26597;&#38382;&#21367;&#20013;&#30340;&#36890;&#32960;&#39044;&#26399;&#65292;&#25105;&#20272;&#35745;&#20851;&#27880;&#38408;&#20540;&#22312;4%&#36890;&#32960;&#29575;&#65292;&#39640;&#20851;&#27880;&#21306;&#22495;&#30340;&#20851;&#27880;&#24230;&#26159;&#20302;&#20851;&#27880;&#21306;&#22495;&#30340;&#20004;&#20493;&#12290;&#24403;&#26657;&#20934;&#21040;&#36825;&#20123;&#21457;&#29616;&#26102;&#65292;&#35813;&#27169;&#22411;&#20135;&#29983;&#19982;&#32654;&#22269;&#26368;&#36817;&#36890;&#32960;&#28608;&#22686;&#19968;&#33268;&#30340;&#36890;&#32960;&#21644;&#36890;&#32960;&#39044;&#26399;&#21160;&#24577;&#12290;&#20851;&#27880;&#38408;&#20540;&#23548;&#33268;&#29366;&#24577;&#20381;&#36182;&#24615;&#65306;&#25104;&#26412;&#25512;&#21160;&#20914;&#20987;&#22312;&#36135;&#24065;&#23485;&#26494;&#25919;&#31574;&#26102;&#26356;&#21152;&#36890;&#32960;&#12290;&#36825;&#20123;&#29366;&#24577;&#20381;&#36182;&#24615;&#25928;&#24212;&#22312;&#24658;&#23450;&#20851;&#27880;&#25110;&#29702;&#24615;&#39044;&#26399;&#27169;&#22411;&#20013;&#26159;&#19981;&#23384;&#22312;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
At the outbreak of the recent inflation surge, the public's attention to inflation was low but increased rapidly once inflation started to rise. In this paper, I develop a general equilibrium monetary model where it is optimal for agents to pay little attention to inflation when inflation is low and stable, but in which they increase their attention once inflation exceeds a certain threshold. Using survey inflation expectations, I estimate the attention threshold to be at an inflation rate of 4%, with attention in the high-attention regime being twice as high as in the low-attention regime. When calibrated to match these findings, the model generates inflation and inflation expectation dynamics consistent with the recent inflation surge in the US. The attention threshold induces a state dependency: cost-push shocks become more inflationary in times of loose monetary policy. These state-dependent effects are absent in the model with constant attention or under rational expectations. Fol
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22686;&#24378;&#30340;&#21160;&#24577;&#25096;&#30331;&#22686;&#38271;&#27169;&#22411;&#65292;&#36890;&#36807;&#24341;&#20837;&#26102;&#38388;&#21464;&#21270;&#30340;&#21363;&#26399;&#21033;&#29575;&#21644;&#25096;&#30331;&#22686;&#38271;&#27169;&#22411;&#25193;&#20805;&#20102;&#27169;&#22411;&#12290;&#21033;&#29992;&#39118;&#38505;&#20013;&#24615;&#20272;&#20540;&#26041;&#27861;&#21644;&#23616;&#37096;&#39118;&#38505;&#26368;&#23567;&#21270;&#31574;&#30053;&#65292;&#33719;&#24471;&#20102;&#32418;&#21033;&#25903;&#20184;&#30340;&#27431;&#24335;&#30475;&#28072;&#21644;&#30475;&#36300;&#26399;&#26435;&#12289;Margrabe&#20132;&#25442;&#26399;&#26435;&#20197;&#21450;&#32929;&#26435;&#38142;&#25509;&#30340;&#20154;&#23551;&#20445;&#38505;&#20135;&#21697;&#30340;&#23450;&#20215;&#21644;&#23545;&#20914;&#20844;&#24335;&#12290;&#21516;&#26102;&#25552;&#20379;&#20102;&#35813;&#27169;&#22411;&#30340;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#12290;</title><link>http://arxiv.org/abs/2201.06012</link><description>&lt;p&gt;
&#22686;&#24378;&#30340;&#21160;&#24577;&#25096;&#30331;&#22686;&#38271;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Augmented Dynamic Gordon Growth Model. (arXiv:2201.06012v3 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.06012
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22686;&#24378;&#30340;&#21160;&#24577;&#25096;&#30331;&#22686;&#38271;&#27169;&#22411;&#65292;&#36890;&#36807;&#24341;&#20837;&#26102;&#38388;&#21464;&#21270;&#30340;&#21363;&#26399;&#21033;&#29575;&#21644;&#25096;&#30331;&#22686;&#38271;&#27169;&#22411;&#25193;&#20805;&#20102;&#27169;&#22411;&#12290;&#21033;&#29992;&#39118;&#38505;&#20013;&#24615;&#20272;&#20540;&#26041;&#27861;&#21644;&#23616;&#37096;&#39118;&#38505;&#26368;&#23567;&#21270;&#31574;&#30053;&#65292;&#33719;&#24471;&#20102;&#32418;&#21033;&#25903;&#20184;&#30340;&#27431;&#24335;&#30475;&#28072;&#21644;&#30475;&#36300;&#26399;&#26435;&#12289;Margrabe&#20132;&#25442;&#26399;&#26435;&#20197;&#21450;&#32929;&#26435;&#38142;&#25509;&#30340;&#20154;&#23551;&#20445;&#38505;&#20135;&#21697;&#30340;&#23450;&#20215;&#21644;&#23545;&#20914;&#20844;&#24335;&#12290;&#21516;&#26102;&#25552;&#20379;&#20102;&#35813;&#27169;&#22411;&#30340;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24341;&#20837;&#20102;&#19968;&#31181;&#21160;&#24577;&#30340;&#25096;&#30331;&#22686;&#38271;&#27169;&#22411;&#65292;&#20854;&#36890;&#36807;&#26102;&#38388;&#21464;&#21270;&#30340;&#21363;&#26399;&#21033;&#29575;&#21644;&#25096;&#30331;&#22686;&#38271;&#27169;&#22411;&#26469;&#25193;&#20805;&#12290;&#21033;&#29992;&#39118;&#38505;&#20013;&#24615;&#20272;&#20540;&#26041;&#27861;&#21644;&#23616;&#37096;&#39118;&#38505;&#26368;&#23567;&#21270;&#31574;&#30053;&#65292;&#25105;&#20204;&#33719;&#24471;&#20102;&#32418;&#21033;&#25903;&#20184;&#30340;&#27431;&#24335;&#30475;&#28072;&#21644;&#30475;&#36300;&#26399;&#26435;&#12289;Margrabe&#20132;&#25442;&#26399;&#26435;&#20197;&#21450;&#32929;&#26435;&#38142;&#25509;&#30340;&#20154;&#23551;&#20445;&#38505;&#20135;&#21697;&#30340;&#23450;&#20215;&#21644;&#23545;&#20914;&#20844;&#24335;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#35813;&#27169;&#22411;&#30340;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we introduce a dynamic Gordon growth model, which is augmented by a time-varying spot interest rate and the Gordon growth model for dividends. Using the risk-neutral valuation method and locally risk-minimizing strategy, we obtain pricing and hedging formulas for the dividend--paying European call and put options, Margrabe exchange options, and equity--linked life insurance products. Also, we provide ML estimator of the model.
&lt;/p&gt;</description></item></channel></rss>