<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#37327;&#21270;&#36151;&#27454;&#32452;&#21512;&#20013;&#30340;&#22995;&#21517;&#38598;&#20013;&#39118;&#38505;&#65292;&#36890;&#36807;&#37325;&#35201;&#24615;&#25277;&#26679;&#30340;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#35757;&#32451;&#31070;&#32463;&#32593;&#32476;&#65292;&#23637;&#31034;&#20102;&#20854;&#30456;&#27604;&#29616;&#26377;&#26041;&#27861;&#22312;&#35780;&#20272;&#23567;&#22411;&#21644;&#38598;&#20013;&#32452;&#21512;&#20013;&#30340;&#22995;&#21517;&#38598;&#20013;&#39118;&#38505;&#26041;&#38754;&#30340;&#20934;&#30830;&#24615;&#21644;&#20248;&#36234;&#24615;&#33021;&#12290;</title><link>https://arxiv.org/abs/2403.16525</link><description>&lt;p&gt;
&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#22995;&#21517;&#38598;&#20013;&#39118;&#38505;&#24230;&#37327;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Deep Learning Based Measure of Name Concentration Risk
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16525
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#37327;&#21270;&#36151;&#27454;&#32452;&#21512;&#20013;&#30340;&#22995;&#21517;&#38598;&#20013;&#39118;&#38505;&#65292;&#36890;&#36807;&#37325;&#35201;&#24615;&#25277;&#26679;&#30340;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#35757;&#32451;&#31070;&#32463;&#32593;&#32476;&#65292;&#23637;&#31034;&#20102;&#20854;&#30456;&#27604;&#29616;&#26377;&#26041;&#27861;&#22312;&#35780;&#20272;&#23567;&#22411;&#21644;&#38598;&#20013;&#32452;&#21512;&#20013;&#30340;&#22995;&#21517;&#38598;&#20013;&#39118;&#38505;&#26041;&#38754;&#30340;&#20934;&#30830;&#24615;&#21644;&#20248;&#36234;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#37327;&#21270;&#36151;&#27454;&#32452;&#21512;&#20013;&#30340;&#22995;&#21517;&#38598;&#20013;&#39118;&#38505;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#38024;&#23545;&#23567;&#22411;&#32452;&#21512;&#36827;&#34892;&#20102;&#23450;&#21046;&#65292;&#20801;&#35768;&#25439;&#22833;&#30340;&#31934;&#31639;&#23450;&#20041;&#21644;&#25353;&#24066;&#22330;&#20215;&#20540;&#26680;&#31639;&#23450;&#20041;&#12290;&#25105;&#20204;&#30340;&#31070;&#32463;&#32593;&#32476;&#30340;&#35757;&#32451;&#20381;&#36182;&#20110;&#37325;&#35201;&#24615;&#25277;&#26679;&#30340;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#65292;&#25105;&#20204;&#26126;&#30830;&#20026;CreditRisk${+}$&#21644;&#22522;&#20110;&#35780;&#32423;&#30340;CreditMetrics&#27169;&#22411;&#21046;&#23450;&#20102;&#36825;&#19968;&#36807;&#31243;&#12290;&#22522;&#20110;&#27169;&#25311;&#21644;&#30495;&#23454;&#25968;&#25454;&#30340;&#25968;&#20540;&#32467;&#26524;&#26174;&#31034;&#20102;&#25105;&#20204;&#26032;&#26041;&#27861;&#30340;&#20934;&#30830;&#24615;&#65292;&#20197;&#21450;&#19982;&#29616;&#26377;&#20998;&#26512;&#26041;&#27861;&#30456;&#27604;&#65292;&#22312;&#35780;&#20272;&#23567;&#22411;&#21644;&#38598;&#20013;&#32452;&#21512;&#20013;&#30340;&#22995;&#21517;&#38598;&#20013;&#39118;&#38505;&#26041;&#38754;&#34920;&#29616;&#20986;&#30340;&#21331;&#36234;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16525v1 Announce Type: new  Abstract: We propose a new deep learning approach for the quantification of name concentration risk in loan portfolios. Our approach is tailored for small portfolios and allows for both an actuarial as well as a mark-to-market definition of loss. The training of our neural network relies on Monte Carlo simulations with importance sampling which we explicitly formulate for the CreditRisk${+}$ and the ratings-based CreditMetrics model. Numerical results based on simulated as well as real data demonstrate the accuracy of our new approach and its superior performance compared to existing analytical methods for assessing name concentration risk in small and concentrated portfolios.
&lt;/p&gt;</description></item><item><title>&#26292;&#38706;&#20110;&#29983;&#25104;&#24335;AI&#25216;&#26415;&#30340;&#33258;&#30001;&#32844;&#19994;&#32773;&#22312;&#22312;&#32447;&#24037;&#20316;&#24179;&#21488;&#19978;&#20855;&#26377;&#26356;&#31215;&#26497;&#30340;&#25112;&#30053;&#34892;&#20026;&#65292;&#26356;&#20542;&#21521;&#20110;&#22312;&#29305;&#23450;&#39046;&#22495;&#38598;&#20013;&#30003;&#35831;&#24037;&#20316;&#32844;&#20301;&#12290;</title><link>https://arxiv.org/abs/2403.15262</link><description>&lt;p&gt;
&#22312;&#32447;&#24037;&#20316;&#24179;&#21488;&#19978;&#30340;AI&#26292;&#38706;&#21644;&#25112;&#30053;&#23450;&#20301;
&lt;/p&gt;
&lt;p&gt;
AI Exposure and Strategic Positioning on an Online Work Platform
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15262
&lt;/p&gt;
&lt;p&gt;
&#26292;&#38706;&#20110;&#29983;&#25104;&#24335;AI&#25216;&#26415;&#30340;&#33258;&#30001;&#32844;&#19994;&#32773;&#22312;&#22312;&#32447;&#24037;&#20316;&#24179;&#21488;&#19978;&#20855;&#26377;&#26356;&#31215;&#26497;&#30340;&#25112;&#30053;&#34892;&#20026;&#65292;&#26356;&#20542;&#21521;&#20110;&#22312;&#29305;&#23450;&#39046;&#22495;&#38598;&#20013;&#30003;&#35831;&#24037;&#20316;&#32844;&#20301;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
AI&#25216;&#26415;&#26377;&#21487;&#33021;&#36890;&#36807;&#25552;&#39640;&#24037;&#20154;&#29983;&#20135;&#21147;&#21644;&#20943;&#23569;&#23545;&#26576;&#20123;&#25216;&#33021;&#25110;&#20219;&#21153;&#30340;&#38656;&#27714;&#26469;&#24433;&#21709;&#21171;&#21160;&#21147;&#24066;&#22330;&#32467;&#26524;&#12290;&#36825;&#20123;&#21464;&#21270;&#21487;&#33021;&#20250;&#23545;&#24037;&#20316;&#32773;&#23547;&#25214;&#24037;&#20316;&#21644;&#23450;&#20301;&#26041;&#24335;&#20135;&#29983;&#37325;&#35201;&#24433;&#21709;&#12290;&#22312;&#35813;&#39033;&#30446;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#26292;&#38706;&#20110;&#29983;&#25104;&#24335;AI&#25216;&#26415;&#30340;&#33258;&#30001;&#32844;&#19994;&#32773;&#22312;2022&#24180;12&#26376;ChatGPT&#25512;&#20986;&#21518;&#20250;&#22914;&#20309;&#24433;&#21709;&#22312;&#32447;&#24037;&#20316;&#24179;&#21488;&#19978;&#30340;&#25112;&#30053;&#34892;&#20026;&#12290;&#30456;&#23545;&#20110;&#26292;&#38706;&#36739;&#23569;&#30340;&#21516;&#34892;&#65292;&#25105;&#20204;&#21457;&#29616;&#65292;&#26292;&#38706;&#24230;&#26356;&#39640;&#20110;&#35821;&#35328;&#24314;&#27169;&#25216;&#26415;&#30340;&#33258;&#30001;&#32844;&#19994;&#32773;&#22312;ChatGPT&#25512;&#20986;&#21518;&#20250;&#22312;&#35813;&#24179;&#21488;&#19978;&#30003;&#35831;&#26356;&#22810;&#30340;&#32844;&#20301;&#65292;&#24182;&#22686;&#21152;&#36825;&#20123;&#30003;&#35831;&#22312;&#29305;&#23450;&#19987;&#19994;&#20013;&#30340;&#38598;&#20013;&#24230;&#12290;&#25105;&#20204;&#35760;&#24405;&#20102;&#36825;&#31181;&#25928;&#24212;&#22312;&#33258;&#30001;&#32844;&#19994;&#32773;&#29305;&#24449;&#19978;&#30340;&#24322;&#36136;&#24615;&#65292;&#24182;&#32771;&#34385;&#36825;&#20123;&#34892;&#20026;&#22914;&#20309;&#22609;&#36896;&#25216;&#26415;&#20914;&#20987;&#26159;&#21542;&#20197;&#21450;&#22312;&#22810;&#22823;&#31243;&#24230;&#19978;&#24433;&#21709;&#33258;&#30001;&#32844;&#19994;&#32773;&#22312;&#24179;&#21488;&#19978;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15262v1 Announce Type: new  Abstract: AI technologies have the potential to affect labor market outcomes by both increasing worker productivity and reducing the demand for certain skills or tasks. Such changes may have important implications for the ways in which workers seek jobs and position themselves. In this project, we examine how exposure to generative AI technologies affects the strategic behavior of freelancer workers on an online work platform following the launch of ChatGPT in December 2022. Relative to their less exposed counterparts, we show that freelancers that are more exposed to language modeling technologies apply for more job posts on the platform following the launch of ChatGPT and increase the concentration of these applications across specializations. We document heterogeneity in this effect across freelancer characteristics and consider how such behaviors shape whether and to what extent the technological shock affects freelancer performance on the pla
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#27604;&#36739;&#27599;&#23478;&#20844;&#21496;&#30340;&#31995;&#32479;&#37325;&#35201;&#24615;&#21644;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26368;&#20248;&#30340;&#20943;&#25490;&#31574;&#30053;&#65292;&#20026;&#23454;&#29616;20%&#20943;&#25490;&#30446;&#26631;&#25552;&#20379;&#20102;&#20943;&#23569;&#23601;&#19994;&#21644;&#32463;&#27982;&#25439;&#22833;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>https://arxiv.org/abs/2302.08987</link><description>&lt;p&gt;
&#20943;&#23569;&#33073;&#30899;&#22833;&#19994;&#21644;&#32463;&#27982;&#25439;&#22833;&#30340;&#20225;&#19994;&#32423;&#20379;&#24212;&#38142;
&lt;/p&gt;
&lt;p&gt;
Firm-level supply chains to minimize decarbonization unemployment and economic losses
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2302.08987
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#27604;&#36739;&#27599;&#23478;&#20844;&#21496;&#30340;&#31995;&#32479;&#37325;&#35201;&#24615;&#21644;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26368;&#20248;&#30340;&#20943;&#25490;&#31574;&#30053;&#65292;&#20026;&#23454;&#29616;20%&#20943;&#25490;&#30446;&#26631;&#25552;&#20379;&#20102;&#20943;&#23569;&#23601;&#19994;&#21644;&#32463;&#27982;&#25439;&#22833;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24613;&#38656;&#20943;&#23569;&#30899;&#25490;&#25918;&#21487;&#33021;&#23548;&#33268;&#20005;&#26684;&#30340;&#21629;&#20196;&#19982;&#25511;&#21046;&#33073;&#30899;&#31574;&#30053;&#65292;&#21487;&#33021;&#24102;&#26469;&#36127;&#38754;&#32463;&#27982;&#21518;&#26524;&#12290;&#26412;&#25991;&#20998;&#26512;&#20102;&#27431;&#27954;&#32463;&#27982;&#30340;&#25972;&#20307;&#20225;&#19994;&#32423;&#29983;&#20135;&#32593;&#32476;&#65292;&#25506;&#35752;&#20102;&#22914;&#20309;&#36991;&#20813;&#36825;&#20123;&#26041;&#27861;&#30340;&#26368;&#22351;&#32467;&#26524;&#12290;&#25105;&#20204;&#27604;&#36739;&#20102;&#27599;&#23478;&#20844;&#21496;&#30340;&#31995;&#32479;&#37325;&#35201;&#24615;&#21644;&#20854;&#24180;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#65292;&#20197;&#30830;&#23450;&#20855;&#26377;&#26368;&#23567;&#39069;&#22806;&#22833;&#19994;&#21644;&#32463;&#27982;&#25439;&#22833;&#30340;&#26368;&#20339;&#20943;&#25490;&#31574;&#30053;&#12290;&#25105;&#20204;&#35774;&#23450;&#20102;&#29305;&#23450;&#30340;&#20943;&#25490;&#30446;&#26631;&#65292;&#30740;&#31350;&#20102;&#21508;&#31181;&#33073;&#30899;&#24773;&#26223;&#24182;&#37327;&#21270;&#20102;&#23427;&#20204;&#30340;&#32463;&#27982;&#21518;&#26524;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#23545;&#20110;&#20943;&#25490;20&#65285;&#65292;&#26368;&#26377;&#25928;&#30340;&#31574;&#30053;&#23548;&#33268;&#32422;2&#65285;&#30340;&#23601;&#19994;&#23703;&#20301;&#25439;&#22833;&#21644;2&#65285;&#30340;&#32463;&#27982;&#20135;&#20986;&#25439;&#22833;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#38024;&#23545;&#26368;&#22823;&#25490;&#25918;&#20225;&#19994;&#30340;&#26420;&#32032;&#24773;&#26223;&#65292;&#30456;&#21516;&#30446;&#26631;&#20250;&#23548;&#33268;28&#65285;&#30340;&#22833;&#19994;&#29575;&#21644;33&#65285;&#30340;&#20135;&#20986;&#20943;&#23569;&#12290;&#36825;&#34920;&#26126;&#21487;&#20197;&#20351;&#29992;&#20225;&#19994;&#32423;&#29983;&#20135;&#26041;&#24335;&#26469;&#23454;&#29616;&#33073;&#30899;&#30446;&#26631;&#65292;&#32780;&#19981;&#20250;&#24102;&#26469;&#36807;&#24230;&#30340;&#32463;&#27982;&#25439;&#22833;&#21644;&#22833;&#19994;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2302.08987v2 Announce Type: replace  Abstract: Urgently needed carbon emission reductions might lead to strict command-and-control decarbonization strategies with potentially negative economic consequences. Analyzing the entire firm-level production network of a European economy, we explore how the worst outcomes of such approaches can be avoided. We compare the systemic relevance of every firm with its annual CO2 emissions to identify optimal emission-reducing strategies with a minimum of additional unemployment and economic losses. Setting specific reduction targets we study various decarbonization scenarios and quantify their economic consequences. We show that for an emission-reduction of 20% the most effective strategy leads to losses of about 2% of jobs and 2% of economic output. In contrast, a naive scenario targeting largest emitters first, results in 28% job losses and 33% output reduction for the same target. This demonstrates that it is possible to use firm-level produ
&lt;/p&gt;</description></item><item><title>&#24403;&#32463;&#27982;&#22686;&#38271;&#30340;&#38271;&#26399;&#22686;&#38271;&#29575;&#27604;&#32929;&#24687;&#22686;&#38271;&#24555;&#19988;&#38271;&#26399;&#26080;&#27873;&#27819;&#30340;&#21033;&#29575;&#20302;&#20110;&#32929;&#24687;&#22686;&#38271;&#26102;&#65292;&#36164;&#20135;&#20215;&#26684;&#27873;&#27819;&#26159;&#24517;&#35201;&#30340;&#12290;</title><link>http://arxiv.org/abs/2305.08268</link><description>&lt;p&gt;
&#27873;&#27819;&#24517;&#35201;&#24615;&#23450;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;
Bubble Necessity Theorem. (arXiv:2305.08268v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.08268
&lt;/p&gt;
&lt;p&gt;
&#24403;&#32463;&#27982;&#22686;&#38271;&#30340;&#38271;&#26399;&#22686;&#38271;&#29575;&#27604;&#32929;&#24687;&#22686;&#38271;&#24555;&#19988;&#38271;&#26399;&#26080;&#27873;&#27819;&#30340;&#21033;&#29575;&#20302;&#20110;&#32929;&#24687;&#22686;&#38271;&#26102;&#65292;&#36164;&#20135;&#20215;&#26684;&#27873;&#27819;&#26159;&#24517;&#35201;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36164;&#20135;&#20215;&#26684;&#27873;&#27819;&#26159;&#25351;&#36164;&#20135;&#20215;&#26684;&#36229;&#36807;&#20197;&#32929;&#24687;&#29616;&#20540;&#23450;&#20041;&#30340;&#22522;&#26412;&#20215;&#20540;&#30340;&#24773;&#20917;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#27010;&#24565;&#19978;&#20840;&#26032;&#30340;&#23545;&#27873;&#27819;&#30340;&#35270;&#35282;&#65306;&#36164;&#20135;&#20215;&#26684;&#27873;&#27819;&#30340;&#24517;&#35201;&#24615;&#12290;&#25105;&#20204;&#22312;&#19968;&#20010;&#27604;&#36739;&#24120;&#35265;&#30340;&#32463;&#27982;&#27169;&#22411;&#31867;&#20013;&#24314;&#31435;&#20102;&#27873;&#27819;&#24517;&#35201;&#24615;&#23450;&#29702;&#65306;&#22312;&#32463;&#27982;&#22686;&#38271;&#30340;&#38271;&#26399;&#22686;&#38271;&#29575;&#65288;$G$&#65289;&#27604;&#32929;&#24687;&#22686;&#38271;&#65288;$G_d$&#65289;&#24555;&#32780;&#38271;&#26399;&#26080;&#27873;&#27819;&#30340;&#21033;&#29575;&#65288;$R$&#65289;&#20302;&#20110;&#32929;&#24687;&#22686;&#38271;&#30340;&#24773;&#20917;&#19979;&#65292;&#23384;&#22312;&#22343;&#34913;&#20294;&#19981;&#23384;&#22312;&#22522;&#26412;&#22343;&#34913;&#25110;&#32773;&#28176;&#36817;&#26080;&#27873;&#27819;&#22343;&#34913;&#12290;$R&lt;G_d&lt;G$&#30340;&#24517;&#35201;&#26465;&#20214;&#22312;&#19981;&#22343;&#21248;&#30340;&#29983;&#20135;&#29575;&#22686;&#38271;&#21644;&#36275;&#22815;&#39640;&#30340;&#20648;&#33988;&#21160;&#26426;&#30340;&#27169;&#22411;&#20013;&#33258;&#28982;&#32780;&#28982;&#22320;&#20986;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
Asset price bubbles are situations where asset prices exceed the fundamental values defined by the present value of dividends. This paper presents a conceptually new perspective on bubbles: the necessity of asset price bubbles. We establish the Bubble Necessity Theorem in a plausible general class of economic models: in economies with faster long run economic growth ($G$) than dividend growth ($G_d$) and long run bubbleless interest rate ($R$) below dividend growth, equilibria exist but none of them are fundamental or asymptotically bubbleless. The necessity condition $R&lt;G_d&lt;G$ naturally arises in models with uneven productivity growth and a sufficiently high savings motive.
&lt;/p&gt;</description></item></channel></rss>