<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#27431;&#30431;&#19979;&#19968;&#20195;&#35745;&#21010;(PNRR)&#20013;&#30417;&#27979;&#31995;&#32479;&#30340;14&#20010;&#20849;&#21516;&#25351;&#26631;&#19982;&#21487;&#25345;&#32493;&#21457;&#23637;&#26694;&#26550;(SDGs)&#30340;&#25972;&#21512;&#28508;&#21147;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;SDGs-RRF&#22797;&#21512;&#25351;&#25968;&#30340;&#26041;&#27861;&#12290;&#32467;&#26524;&#26174;&#31034;&#22312;2014&#24180;&#33267;2021&#24180;&#26399;&#38388;&#65292;&#27861;&#22269;&#12289;&#24503;&#22269;&#12289;&#24847;&#22823;&#21033;&#21644;&#35199;&#29677;&#29273;&#30340;&#32452;&#21512;&#25351;&#25968;&#26222;&#36941;&#25913;&#21892;&#65292;&#37096;&#20998;&#20943;&#23567;&#20102;&#24046;&#36317;&#12290;</title><link>http://arxiv.org/abs/2307.11039</link><description>&lt;p&gt;
PNRR&#21644;SDGs&#30340;&#20849;&#21516;&#25351;&#26631;&#21644;&#26694;&#26550;&#65306;&#19968;&#20010;&#22797;&#21512;&#25351;&#26631;&#30340;&#25552;&#35758;
&lt;/p&gt;
&lt;p&gt;
Indicatori comuni del PNRR e framework SDGs: una proposta di indicatore composito. (arXiv:2307.11039v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.11039
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#27431;&#30431;&#19979;&#19968;&#20195;&#35745;&#21010;(PNRR)&#20013;&#30417;&#27979;&#31995;&#32479;&#30340;14&#20010;&#20849;&#21516;&#25351;&#26631;&#19982;&#21487;&#25345;&#32493;&#21457;&#23637;&#26694;&#26550;(SDGs)&#30340;&#25972;&#21512;&#28508;&#21147;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;SDGs-RRF&#22797;&#21512;&#25351;&#25968;&#30340;&#26041;&#27861;&#12290;&#32467;&#26524;&#26174;&#31034;&#22312;2014&#24180;&#33267;2021&#24180;&#26399;&#38388;&#65292;&#27861;&#22269;&#12289;&#24503;&#22269;&#12289;&#24847;&#22823;&#21033;&#21644;&#35199;&#29677;&#29273;&#30340;&#32452;&#21512;&#25351;&#25968;&#26222;&#36941;&#25913;&#21892;&#65292;&#37096;&#20998;&#20943;&#23567;&#20102;&#24046;&#36317;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27431;&#30431;&#19979;&#19968;&#20195;&#35745;&#21010;(NGEU)&#30340;&#20027;&#35201;&#32452;&#25104;&#37096;&#20998;&#26159;&#22797;&#33487;&#21644;&#38887;&#24615;&#35774;&#26045;(RRF)&#65292;&#23454;&#26045;&#26399;&#20026;2021&#24180;&#33267;2026&#24180;&#12290;RRF&#36824;&#21253;&#25324;&#19968;&#20010;&#30417;&#27979;&#31995;&#32479;&#65306;&#27599;&#20845;&#20010;&#26376;&#65292;&#27599;&#20010;&#22269;&#23478;&#37117;&#38656;&#35201;&#26681;&#25454;14&#20010;&#20849;&#21516;&#25351;&#26631;&#30340;&#36827;&#23637;&#24773;&#20917;&#21457;&#36865;&#26356;&#26032;&#65292;&#36825;&#20123;&#25351;&#26631;&#22312;&#29305;&#23450;&#30340;&#23450;&#37327;&#23610;&#24230;&#19978;&#27979;&#37327;&#12290;&#26412;&#25991;&#26088;&#22312;&#22312;&#24378;&#35843;&#21487;&#25345;&#32493;&#21457;&#23637;&#26694;&#26550;(SDGs)&#19982;RRF&#25972;&#21512;&#28508;&#21147;&#30340;&#21516;&#26102;&#65292;&#25552;&#20379;&#35813;&#31995;&#32479;&#30340;&#31532;&#19968;&#32452;&#23454;&#35777;&#35777;&#25454;&#12290;&#25105;&#20204;&#24314;&#35758;&#23558;14&#20010;&#20849;&#21516;&#25351;&#26631;&#19982;SDGs&#24314;&#31435;&#32852;&#31995;&#65292;&#20174;&#32780;&#20026;&#27861;&#22269;&#12289;&#24503;&#22269;&#12289;&#24847;&#22823;&#21033;&#21644;&#35199;&#29677;&#29273;&#22312;2014&#24180;&#33267;2021&#24180;&#26399;&#38388;&#29983;&#25104;&#19968;&#20010;&#32452;&#21512;&#25351;&#25968;(SDGs-RRF)&#12290;&#22312;&#36825;&#27573;&#26102;&#38388;&#20869;&#65292;&#36825;&#22235;&#20010;&#22269;&#23478;&#30340;&#32452;&#21512;&#25351;&#25968;&#26222;&#36941;&#25913;&#21892;&#65292;&#37096;&#20998;&#20943;&#23567;&#20102;&#24046;&#36317;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#26159;&#21521;&#26356;&#24191;&#27867;&#22320;&#20351;&#29992;SDGs&#36827;&#34892;&#35780;&#20272;&#36808;&#20986;&#30340;&#31532;&#19968;&#27493;&#12290;
&lt;/p&gt;
&lt;p&gt;
The main component of the NextGeneration EU (NGEU) program is the Recovery and Resilience Facility (RRF), spanning an implementation period between 2021 and 2026. The RRF also includes a monitoring system: every six months, each country is required to send an update on the progress of the plan against 14 common indicators, measured on specific quantitative scales. The aim of this paper is to present the first empirical evidence on this system, while, at the same time, emphasizing the potential of its integration with the sustainable development framework (SDGs). We propose to develop a first linkage between the 14 common indicators and the SDGs which allows us to produce a composite index (SDGs-RRF) for France, Germany, Italy, and Spain for the period 2014-2021. Over this time, widespread improvements in the composite index across the four countries led to a partial reduction of the divergence. The proposed approach represents a first step towards a wider use of the SDGs for the assess
&lt;/p&gt;</description></item><item><title>&#23545;&#32599;&#23486;&#27721;&#29992;&#25143;&#30340;&#39640;&#39057;&#20132;&#26131;&#34892;&#20026;&#36827;&#34892;&#20102;&#20998;&#26512;&#65292;&#21457;&#29616;&#20182;&#20204;&#26356;&#20542;&#21521;&#20110;&#20851;&#27880;&#22823;&#20111;&#25439;&#32773;&#32780;&#38750;&#22823;&#30408;&#21033;&#32773;&#65292;&#23545;&#26497;&#31471;&#36127;&#25910;&#30410;&#30340;&#32929;&#31080;&#20250;&#36805;&#36895;&#20570;&#20986;&#21453;&#24212;&#12290;&#20132;&#26131;&#34892;&#20026;&#23545;&#38548;&#22812;&#21644;&#26085;&#20869;&#34892;&#24773;&#30340;&#20851;&#27880;&#31243;&#24230;&#26377;&#24046;&#24322;&#65292;COVID-19&#20844;&#21578;&#21518;&#30340;&#34892;&#20026;&#26356;&#22840;&#24352;&#12290;&#20132;&#26131;&#24577;&#24230;&#22312;&#20844;&#21496;&#35268;&#27169;&#21644;&#34892;&#19994;&#20043;&#38388;&#26174;&#33879;&#21464;&#21270;&#12290;</title><link>http://arxiv.org/abs/2307.11012</link><description>&lt;p&gt;
&#24555;&#36895;&#32780;&#30127;&#29378;: &#23545;&#32599;&#23486;&#27721;&#29992;&#25143;&#20132;&#26131;&#34892;&#20026;&#30340;&#39640;&#39057;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Fast and Furious: A High-Frequency Analysis of Robinhood Users' Trading Behavior. (arXiv:2307.11012v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.11012
&lt;/p&gt;
&lt;p&gt;
&#23545;&#32599;&#23486;&#27721;&#29992;&#25143;&#30340;&#39640;&#39057;&#20132;&#26131;&#34892;&#20026;&#36827;&#34892;&#20102;&#20998;&#26512;&#65292;&#21457;&#29616;&#20182;&#20204;&#26356;&#20542;&#21521;&#20110;&#20851;&#27880;&#22823;&#20111;&#25439;&#32773;&#32780;&#38750;&#22823;&#30408;&#21033;&#32773;&#65292;&#23545;&#26497;&#31471;&#36127;&#25910;&#30410;&#30340;&#32929;&#31080;&#20250;&#36805;&#36895;&#20570;&#20986;&#21453;&#24212;&#12290;&#20132;&#26131;&#34892;&#20026;&#23545;&#38548;&#22812;&#21644;&#26085;&#20869;&#34892;&#24773;&#30340;&#20851;&#27880;&#31243;&#24230;&#26377;&#24046;&#24322;&#65292;COVID-19&#20844;&#21578;&#21518;&#30340;&#34892;&#20026;&#26356;&#22840;&#24352;&#12290;&#20132;&#26131;&#24577;&#24230;&#22312;&#20844;&#21496;&#35268;&#27169;&#21644;&#34892;&#19994;&#20043;&#38388;&#26174;&#33879;&#21464;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20998;&#26512;&#20102;&#32599;&#23486;&#27721;(Robinhood)&#25237;&#36164;&#32773;&#23545;&#36880;&#23567;&#26102;&#21644;&#38548;&#22812;&#20215;&#26684;&#21464;&#21160;&#30340;&#20132;&#26131;&#21453;&#24212;&#12290;&#19982;&#36817;&#26399;&#20851;&#27880;&#26085;&#24120;&#34892;&#20026;&#30340;&#30740;&#31350;&#30456;&#27604;&#65292;&#25105;&#20204;&#21457;&#29616;&#32599;&#23486;&#27721;&#29992;&#25143;&#26356;&#20542;&#21521;&#20110;&#37325;&#35270;&#22823;&#20111;&#25439;&#32773;&#32780;&#38750;&#22823;&#30408;&#21033;&#32773;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#24403;&#36141;&#20080;&#20986;&#29616;&#26497;&#31471;&#36127;&#25910;&#30410;&#30340;&#32929;&#31080;&#26102;&#65292;&#20182;&#20204;&#36890;&#24120;&#20250;&#36805;&#36895;&#20570;&#20986;&#21453;&#24212;&#65292;&#36890;&#24120;&#22312;&#19968;&#23567;&#26102;&#20869;&#12290;&#36827;&#19968;&#27493;&#20998;&#26512;&#34920;&#26126;&#65292;&#23545;&#38548;&#22812;&#65288;&#26085;&#20869;&#65289;&#34892;&#24773;&#30340;&#20851;&#27880;&#31243;&#24230;&#26356;&#39640;&#65288;&#26356;&#20302;&#65289;&#65292;&#24182;&#19988;&#22312;COVID-19&#20844;&#21578;&#21518;&#30340;&#34892;&#20026;&#26356;&#21152;&#22840;&#24352;&#12290;&#27492;&#22806;&#65292;&#20132;&#26131;&#24577;&#24230;&#22312;&#20844;&#21496;&#35268;&#27169;&#21644;&#34892;&#19994;&#20043;&#38388;&#26174;&#33879;&#21464;&#21270;&#65292;&#23545;&#22823;&#24066;&#20540;&#20844;&#21496;&#37319;&#21462;&#26356;&#20855;&#21453;&#21608;&#26399;&#24615;&#30340;&#31574;&#30053;&#65292;&#24182;&#19988;&#23545;&#33021;&#28304;&#21644;&#28040;&#36153;&#31867;&#32929;&#31080;&#30340;&#20132;&#26131;&#27963;&#21160;&#26356;&#21152;&#27963;&#36291;&#12290;
&lt;/p&gt;
&lt;p&gt;
We analyze Robinhood (RH) investors' trading reactions to intraday hourly and overnight price changes. Contrasting with recent studies focusing on daily behaviors, we find that RH users strongly favor big losers over big gainers. We also uncover that they react rapidly, typically within an hour, when acquiring stocks that exhibit extreme negative returns. Further analyses suggest greater (lower) attention to overnight (intraday) movements and exacerbated behaviors post-COVID-19 announcement. Moreover, trading attitudes significantly vary across firm size and industry, with a more contrarian strategy towards larger-cap firms and a heightened activity on energy and consumer discretionary stocks.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#21457;&#23637;&#20102;&#19968;&#20010;&#23478;&#24237;&#29983;&#21629;&#21608;&#26399;&#38598;&#20307;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#19977;&#31181;&#25215;&#35834;&#31867;&#22411;&#30340;&#23478;&#24237;&#34892;&#20026;&#65292;&#24182;&#36890;&#36807;&#27979;&#35797;&#26041;&#27861;&#30830;&#23450;&#20102;&#23478;&#24237;&#25215;&#35834;&#31243;&#24230;&#30340;&#24322;&#36136;&#24615;&#12290;&#20351;&#29992;&#26368;&#26032;&#25968;&#25454;&#65292;&#30740;&#31350;&#21457;&#29616;&#26377;&#38480;&#25215;&#35834;&#26159;&#26368;&#26222;&#36941;&#30340;&#31867;&#22411;&#12290;</title><link>http://arxiv.org/abs/2307.10983</link><description>&lt;p&gt;
&#25215;&#35834;&#19982;&#23478;&#24237;&#21171;&#21160;&#21147;&#20379;&#32473;&#30340;&#21160;&#24577;&#12290; (arXiv:2307.10983v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
Commitment and the Dynamics of Household Labor Supply. (arXiv:2307.10983v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10983
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21457;&#23637;&#20102;&#19968;&#20010;&#23478;&#24237;&#29983;&#21629;&#21608;&#26399;&#38598;&#20307;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#19977;&#31181;&#25215;&#35834;&#31867;&#22411;&#30340;&#23478;&#24237;&#34892;&#20026;&#65292;&#24182;&#36890;&#36807;&#27979;&#35797;&#26041;&#27861;&#30830;&#23450;&#20102;&#23478;&#24237;&#25215;&#35834;&#31243;&#24230;&#30340;&#24322;&#36136;&#24615;&#12290;&#20351;&#29992;&#26368;&#26032;&#25968;&#25454;&#65292;&#30740;&#31350;&#21457;&#29616;&#26377;&#38480;&#25215;&#35834;&#26159;&#26368;&#26222;&#36941;&#30340;&#31867;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20010;&#20307;&#23545;&#20276;&#20387;&#30340;&#25215;&#35834;&#31243;&#24230;&#23545;&#31038;&#20250;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;&#26412;&#25991;&#36890;&#36807;&#21457;&#23637;&#19968;&#20010;&#23478;&#24237;&#30340;&#29983;&#21629;&#21608;&#26399;&#38598;&#20307;&#27169;&#22411;&#65292;&#25551;&#36848;&#20102;&#19977;&#31181;&#19981;&#21516;&#31867;&#22411;&#30340;&#25215;&#35834;&#65306;&#20840;&#38754;&#25215;&#35834;&#12289;&#26377;&#38480;&#25215;&#35834;&#21644;&#26080;&#25215;&#35834;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#27979;&#35797;&#26041;&#27861;&#65292;&#36890;&#36807;&#35266;&#23519;&#24403;&#19979;&#21644;&#21382;&#21490;&#28040;&#24687;&#23545;&#23478;&#24237;&#34892;&#20026;&#30340;&#24433;&#21709;&#26469;&#21306;&#20998;&#36825;&#19977;&#31181;&#31867;&#22411;&#12290;&#25105;&#20204;&#30340;&#27979;&#35797;&#20801;&#35768;&#23478;&#24237;&#20043;&#38388;&#25215;&#35834;&#31243;&#24230;&#30340;&#24322;&#36136;&#24615;&#12290;&#20351;&#29992;&#26368;&#36817;&#30340;&#8220;&#25910;&#20837;&#21160;&#24577;&#38754;&#26495;&#30740;&#31350;&#8221;&#25968;&#25454;&#65292;&#25105;&#20204;&#25298;&#32477;&#20102;&#20840;&#38754;&#25215;&#35834;&#21644;&#26080;&#25215;&#35834;&#65292;&#21516;&#26102;&#25214;&#21040;&#20102;&#26377;&#38480;&#25215;&#35834;&#30340;&#24378;&#26377;&#21147;&#35777;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
The extent to which individuals commit to their partner for life has important implications. This paper develops a lifecycle collective model of the household, through which it characterizes behavior in three prominent alternative types of commitment: full, limited, and no commitment. We propose a test that distinguishes between all three types based on how contemporaneous and historical news affect household behavior. Our test permits heterogeneity in the degree of commitment across households. Using recent data from the Panel Study of Income Dynamics, we reject full and no commitment, while we find strong evidence for limited commitment.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;L\'evy&#36807;&#31243;&#30340;&#32654;&#24335;&#20132;&#26131;&#26399;&#26435;&#23450;&#20215;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#34920;&#31034;&#32654;&#24335;&#20132;&#26131;&#26399;&#26435;&#30340;&#27714;&#21644;&#20844;&#24335;&#65292;&#24182;&#32473;&#20986;&#20102;&#33258;&#30001;&#36793;&#30028;&#30340;&#24615;&#36136;&#21644;&#36817;&#20284;&#20844;&#24335;&#12290;</title><link>http://arxiv.org/abs/2307.10900</link><description>&lt;p&gt;
&#22522;&#20110;L\'evy&#36807;&#31243;&#30340;&#32654;&#24335;&#20132;&#26131;&#26399;&#26435;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
American Exchange option driven by a L\'evy process. (arXiv:2307.10900v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10900
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;L\'evy&#36807;&#31243;&#30340;&#32654;&#24335;&#20132;&#26131;&#26399;&#26435;&#23450;&#20215;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#34920;&#31034;&#32654;&#24335;&#20132;&#26131;&#26399;&#26435;&#30340;&#27714;&#21644;&#20844;&#24335;&#65292;&#24182;&#32473;&#20986;&#20102;&#33258;&#30001;&#36793;&#30028;&#30340;&#24615;&#36136;&#21644;&#36817;&#20284;&#20844;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#22522;&#20110;L\'evy&#36807;&#31243;&#30340;&#32654;&#24335;&#20132;&#26131;&#26399;&#26435;&#23450;&#20215;&#38382;&#39064;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#32654;&#24335;&#20132;&#26131;&#26399;&#26435;&#30340;&#24615;&#36136;&#65292;&#23558;&#20854;&#34920;&#31034;&#20026;&#30456;&#24212;&#27431;&#24335;&#20132;&#26131;&#26399;&#26435;&#20215;&#26684;&#19982;&#25552;&#21069;&#34892;&#26435;&#28322;&#20215;&#30340;&#21644;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#33258;&#30001;&#36793;&#30028;&#30340;&#19968;&#20123;&#24615;&#36136;&#65292;&#24182;&#32473;&#20986;&#20102;&#32654;&#24335;&#20132;&#26131;&#26399;&#26435;&#30340;&#36817;&#20284;&#20844;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the problem of pricing American Exchange options driven by a L\'evy process. We study the properties of American Exchange options, we represented it as the sum of the price of the corresponding European exchange option price and an early exercise premium. Secondly, we show some properties of the free boundary and give an approximative formula of an American Exchange option.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#19968;&#31181;&#21452;&#23618;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#21033;&#29992;U&#24418;&#27169;&#24335;&#30340;&#32929;&#31080;&#20132;&#26131;&#37327;&#21644;Proximal Policy Optimization&#31639;&#27861;&#65292;&#21487;&#20197;&#20934;&#30830;&#36861;&#36394;&#24182;&#26368;&#23567;&#21270;&#19982;&#27599;&#26085;&#32047;&#31215;VWAP&#30340;&#20559;&#24046;&#12290;</title><link>http://arxiv.org/abs/2307.10649</link><description>&lt;p&gt;
&#19968;&#31181;&#36866;&#24212;&#24615;&#30340;&#21452;&#23618;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#29992;&#20110;&#26368;&#20248;&#20132;&#26131;&#25191;&#34892;
&lt;/p&gt;
&lt;p&gt;
An Adaptive Dual-level Reinforcement Learning Approach for Optimal Trade Execution. (arXiv:2307.10649v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10649
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#19968;&#31181;&#21452;&#23618;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#21033;&#29992;U&#24418;&#27169;&#24335;&#30340;&#32929;&#31080;&#20132;&#26131;&#37327;&#21644;Proximal Policy Optimization&#31639;&#27861;&#65292;&#21487;&#20197;&#20934;&#30830;&#36861;&#36394;&#24182;&#26368;&#23567;&#21270;&#19982;&#27599;&#26085;&#32047;&#31215;VWAP&#30340;&#20559;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#30340;&#30446;&#30340;&#26159;&#35774;&#35745;&#19968;&#31181;&#21487;&#20197;&#21033;&#29992;&#24378;&#21270;&#23398;&#20064;&#32039;&#23494;&#36861;&#36394;&#27599;&#26085;&#32047;&#31215;&#25104;&#20132;&#37327;&#21152;&#26435;&#24179;&#22343;&#20215;&#26684;(VWAP)&#30340;&#31574;&#30053;&#12290;&#20197;&#24448;&#30340;&#30740;&#31350;&#36890;&#24120;&#36873;&#25321;&#30456;&#23545;&#36739;&#30701;&#30340;&#20132;&#26131;&#26102;&#38388;&#27573;&#26469;&#23454;&#26045;&#20182;&#20204;&#30340;&#27169;&#22411;&#65292;&#20351;&#24471;&#20934;&#30830;&#36861;&#36394;&#27599;&#26085;&#32047;&#31215;VWAP&#21464;&#24471;&#22256;&#38590;&#65292;&#22240;&#20026;&#37329;&#34701;&#25968;&#25454;&#30340;&#21464;&#21160;&#22312;&#30701;&#26102;&#38388;&#27573;&#20869;&#24448;&#24448;&#19981;&#26174;&#33879;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#26088;&#22312;&#24320;&#21457;&#19968;&#31181;&#33021;&#22815;&#20934;&#30830;&#36861;&#36394;&#27599;&#26085;&#32047;&#31215;VWAP&#24182;&#26368;&#23567;&#21270;&#19982;VWAP&#30340;&#20559;&#24046;&#30340;&#31574;&#30053;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#32929;&#31080;&#20132;&#26131;&#37327;&#30340;U&#24418;&#27169;&#24335;&#24182;&#20351;&#29992;Proximal Policy Optimization(PPO)&#20316;&#20026;&#23398;&#20064;&#31639;&#27861;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#37319;&#29992;&#20102;&#21452;&#23618;&#26041;&#27861;&#65306;&#19968;&#20010;Transformer&#27169;&#22411;&#25429;&#25417;&#27599;&#26085;&#20132;&#26131;&#37327;&#22312;&#20840;&#23616;&#19978;&#21576;U&#24418;&#20998;&#24067;&#30340;&#24635;&#20307;&#20998;&#24067;&#65292;&#19968;&#20010;LSTM&#27169;&#22411;&#22788;&#29702;&#36739;&#23567;&#26102;&#27573;&#20869;&#35746;&#21333;&#30340;&#20998;&#24067;&#12290;&#25105;&#20204;&#23454;&#39564;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#21487;&#20197;&#26377;&#25928;&#36861;&#36394;VWAP&#24182;&#20943;&#23567;&#19982;&#20043;&#20559;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;
The purpose of this research is to devise a tactic that can closely track the daily cumulative volume-weighted average price (VWAP) using reinforcement learning. Previous studies often choose a relatively short trading horizon to implement their models, making it difficult to accurately track the daily cumulative VWAP since the variations of financial data are often insignificant within the short trading horizon. In this paper, we aim to develop a strategy that can accurately track the daily cumulative VWAP while minimizing the deviation from the VWAP. We propose a method that leverages the U-shaped pattern of intraday stock trade volumes and use Proximal Policy Optimization (PPO) as the learning algorithm. Our method follows a dual-level approach: a Transformer model that captures the overall(global) distribution of daily volumes in a U-shape, and a LSTM model that handles the distribution of orders within smaller(local) time intervals. The results from our experiments suggest that th
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#22312;&#21306;&#22359;&#38142;&#19978;&#35757;&#32451;&#21644;&#37096;&#32626;&#21160;&#24577;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#36890;&#36807;&#20351;&#29992;&#20998;&#24067;&#24335;&#35745;&#31639;&#21644;&#25552;&#20379;&#26080;&#27861;&#31713;&#25913;&#30340;&#20132;&#26131;&#20998;&#31867;&#24080;&#30340;&#21306;&#22359;&#38142;&#25216;&#26415;&#65292;&#21487;&#20351;&#35821;&#35328;&#27169;&#22411;&#20855;&#22791;&#36830;&#32493;&#23398;&#20064;&#30340;&#33021;&#21147;&#65292;&#20026;&#19979;&#19968;&#20195;&#20154;&#24037;&#26234;&#33021;&#31995;&#32479;&#30340;&#21457;&#23637;&#25552;&#20379;&#20102;&#26032;&#30340;&#26041;&#27861;&#21644;&#21551;&#31034;&#12290;</title><link>http://arxiv.org/abs/2307.10549</link><description>&lt;p&gt;
&#21306;&#22359;&#38142;&#19978;&#30340;&#21160;&#24577;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Dynamic Large Language Models on Blockchains. (arXiv:2307.10549v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10549
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#22312;&#21306;&#22359;&#38142;&#19978;&#35757;&#32451;&#21644;&#37096;&#32626;&#21160;&#24577;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#36890;&#36807;&#20351;&#29992;&#20998;&#24067;&#24335;&#35745;&#31639;&#21644;&#25552;&#20379;&#26080;&#27861;&#31713;&#25913;&#30340;&#20132;&#26131;&#20998;&#31867;&#24080;&#30340;&#21306;&#22359;&#38142;&#25216;&#26415;&#65292;&#21487;&#20351;&#35821;&#35328;&#27169;&#22411;&#20855;&#22791;&#36830;&#32493;&#23398;&#20064;&#30340;&#33021;&#21147;&#65292;&#20026;&#19979;&#19968;&#20195;&#20154;&#24037;&#26234;&#33021;&#31995;&#32479;&#30340;&#21457;&#23637;&#25552;&#20379;&#20102;&#26032;&#30340;&#26041;&#27861;&#21644;&#21551;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35757;&#32451;&#21644;&#37096;&#32626;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#38656;&#35201;&#22823;&#37327;&#30340;&#35745;&#31639;&#36164;&#28304;&#65292;&#22240;&#20026;&#35821;&#35328;&#27169;&#22411;&#21253;&#21547;&#25968;&#21313;&#20159;&#20010;&#21442;&#25968;&#65292;&#25991;&#26412;&#25317;&#26377;&#25968;&#21315;&#20010;&#26631;&#35760;&#12290;&#21478;&#19968;&#20010;&#38382;&#39064;&#26159;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#26159;&#38745;&#24577;&#30340;&#65292;&#22312;&#35757;&#32451;&#36807;&#31243;&#21518;&#23601;&#34987;&#22266;&#23450;&#19979;&#26469;&#20102;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#26412;&#25991;&#25552;&#20986;&#22312;&#21306;&#22359;&#38142;&#19978;&#35757;&#32451;&#21644;&#37096;&#32626;&#21160;&#24577;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#21306;&#22359;&#38142;&#20855;&#26377;&#39640;&#35745;&#31639;&#24615;&#33021;&#24182;&#20998;&#24067;&#22312;&#19968;&#20010;&#35745;&#31639;&#26426;&#32593;&#32476;&#19978;&#12290;&#21306;&#22359;&#38142;&#26159;&#19968;&#20010;&#23433;&#20840;&#12289;&#20998;&#25955;&#21644;&#36879;&#26126;&#30340;&#31995;&#32479;&#65292;&#20801;&#35768;&#21019;&#24314;&#19968;&#20010;&#26080;&#27861;&#31713;&#25913;&#30340;&#20132;&#26131;&#20998;&#31867;&#24080;&#65292;&#26080;&#38656;&#20013;&#20171;&#26426;&#26500;&#12290;&#21160;&#24577;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#21487;&#20197;&#22312;&#35757;&#32451;&#36807;&#31243;&#20043;&#21518;&#19981;&#26029;&#20174;&#29992;&#25143;&#36755;&#20837;&#20013;&#23398;&#20064;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#25552;&#20379;&#20102;&#19968;&#31181;&#24320;&#21457;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#26032;&#26041;&#27861;&#65292;&#24182;&#20026;&#19979;&#19968;&#20195;&#20154;&#24037;&#26234;&#33021;&#31995;&#32479;&#24102;&#26469;&#20102;&#21551;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;
Training and deploying the large language models requires a large mount of computational resource because the language models contain billions of parameters and the text has thousands of tokens. Another problem is that the large language models are static. They are fixed after the training process. To tackle these issues, in this paper, we propose to train and deploy the dynamic large language model on blockchains, which have high computation performance and are distributed across a network of computers. A blockchain is a secure, decentralized, and transparent system that allows for the creation of a tamper-proof ledger for transactions without the need for intermediaries. The dynamic large language models can continuously learn from the user input after the training process. Our method provides a new way to develop the large language models and also sheds a light on the next generation artificial intelligence systems.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#30456;&#23545;&#32489;&#25928;&#26631;&#20934;&#19979;&#30340;&#26368;&#20248;&#25237;&#36164;&#30340;&#22343;&#20540;&#22330;&#21338;&#24328;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#35299;&#20915;&#26041;&#26696;&#65292;&#35814;&#32454;&#35828;&#26126;&#20102;CRRA&#25928;&#29992;&#24773;&#20917;&#19979;&#30340;&#26368;&#20248;&#31574;&#30053;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;CARA&#25928;&#29992;&#24773;&#20917;&#19979;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290; (arXiv:2307.10540v1 [q-fin.MF])</title><link>http://arxiv.org/abs/2307.10540</link><description>&lt;p&gt;
&#30456;&#23545;&#32489;&#25928;&#26631;&#20934;&#19979;&#30340;&#26368;&#20248;&#25237;&#36164;&#30340;&#22343;&#20540;&#22330;&#21338;&#24328;
&lt;/p&gt;
&lt;p&gt;
Mean Field Games for Optimal Investment Under Relative Performance Criteria. (arXiv:2307.10540v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10540
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#30456;&#23545;&#32489;&#25928;&#26631;&#20934;&#19979;&#30340;&#26368;&#20248;&#25237;&#36164;&#30340;&#22343;&#20540;&#22330;&#21338;&#24328;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#35299;&#20915;&#26041;&#26696;&#65292;&#35814;&#32454;&#35828;&#26126;&#20102;CRRA&#25928;&#29992;&#24773;&#20917;&#19979;&#30340;&#26368;&#20248;&#31574;&#30053;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;CARA&#25928;&#29992;&#24773;&#20917;&#19979;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290; (arXiv:2307.10540v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;Lacker&#21644;Soret&#25552;&#20986;&#30340;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#12290;&#20182;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26377;&#38480;&#26102;&#38388;&#27573;&#27169;&#22411;&#65292;&#20801;&#35768;&#20195;&#29702;&#20154;&#36890;&#36807;&#19982;&#20854;&#20182;&#20195;&#29702;&#20154;&#24179;&#22343;&#27700;&#24179;&#30340;&#30456;&#23545;&#34920;&#29616;&#26469;&#34913;&#37327;&#25928;&#29992;&#65292;&#32780;&#19981;&#20165;&#20165;&#26159;&#32477;&#23545;&#36130;&#23500;&#12290;&#34429;&#28982;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#26377;&#38480;&#20154;&#21475;&#25110;&#32773;n-&#20154;&#21338;&#24328;&#26159;&#21487;&#22788;&#29702;&#30340;&#65292;&#20294;&#20316;&#32773;&#25552;&#20986;&#20102;&#22343;&#20540;&#22330;&#21338;&#24328;&#26694;&#26550;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#24076;&#26395;&#21033;&#29992;&#36825;&#20010;&#26694;&#26550;&#35814;&#32454;&#35828;&#26126;CRRA&#25928;&#29992;&#24773;&#20917;&#19979;&#30340;&#26368;&#20248;&#25237;&#36164;&#21644;&#28040;&#36153;&#31574;&#30053;&#65292;&#22914;Lacker&#21644;Soret&#31616;&#35201;&#27010;&#36848;&#30340;&#37027;&#26679;&#65292;&#20294;&#20063;&#35201;&#25512;&#23548;&#20986;CARA&#25928;&#29992;&#24773;&#20917;&#19979;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we study the portfolio optimization problem formulated by Lacker and Soret. They formulate a finite time horizon model that allows agents to be competitive, measuring their utility not only by their absolute wealth but also relative performance compared to the average of other agents. While the finite population or $n$-player game is tractable in some cases, the authors present the Mean Field Game framework to solve this problem. Here, we seek to use this framework to clearly detail the optimal investment and consumption strategies in the CRRA utility case as was briefly outlined in Lacker and Soret, but also derive a solution in the CARA utility case.
&lt;/p&gt;</description></item><item><title>FinGPT&#26159;&#19968;&#20010;&#24320;&#28304;&#30340;&#25968;&#25454;&#20026;&#20013;&#24515;&#30340;&#26694;&#26550;&#65292;&#26088;&#22312;&#23558;&#20114;&#32852;&#32593;&#35268;&#27169;&#30340;&#37329;&#34701;&#25968;&#25454;&#27665;&#20027;&#21270;&#20026;&#37329;&#34701;&#22823;&#35821;&#35328;&#27169;&#22411;&#12290;&#23427;&#25552;&#20379;&#20102;&#33258;&#21160;&#25910;&#38598;&#21644;&#25972;&#29702;&#23454;&#26102;&#37329;&#34701;&#25968;&#25454;&#30340;&#21151;&#33021;&#65292;&#35299;&#20915;&#20102;&#37329;&#34701;&#25991;&#26412;&#25968;&#25454;&#31232;&#32570;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2307.10485</link><description>&lt;p&gt;
FinGPT: &#23558;&#20114;&#32852;&#32593;&#35268;&#27169;&#30340;&#37329;&#34701;&#25968;&#25454;&#27665;&#20027;&#21270;&#20026;&#37329;&#34701;&#22823;&#35821;&#35328;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
FinGPT: Democratizing Internet-scale Data for Financial Large Language Models. (arXiv:2307.10485v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10485
&lt;/p&gt;
&lt;p&gt;
FinGPT&#26159;&#19968;&#20010;&#24320;&#28304;&#30340;&#25968;&#25454;&#20026;&#20013;&#24515;&#30340;&#26694;&#26550;&#65292;&#26088;&#22312;&#23558;&#20114;&#32852;&#32593;&#35268;&#27169;&#30340;&#37329;&#34701;&#25968;&#25454;&#27665;&#20027;&#21270;&#20026;&#37329;&#34701;&#22823;&#35821;&#35328;&#27169;&#22411;&#12290;&#23427;&#25552;&#20379;&#20102;&#33258;&#21160;&#25910;&#38598;&#21644;&#25972;&#29702;&#23454;&#26102;&#37329;&#34701;&#25968;&#25454;&#30340;&#21151;&#33021;&#65292;&#35299;&#20915;&#20102;&#37329;&#34701;&#25991;&#26412;&#25968;&#25454;&#31232;&#32570;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#22312;&#29702;&#35299;&#21644;&#29983;&#25104;&#31867;&#20284;&#20154;&#31867;&#25991;&#26412;&#26041;&#38754;&#23637;&#31034;&#20102;&#21331;&#36234;&#30340;&#33021;&#21147;&#65292;&#36825;&#21487;&#33021;&#20250;&#24443;&#24213;&#25913;&#21464;&#37329;&#34701;&#34892;&#19994;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;LLM&#22312;&#37329;&#34701;&#39046;&#22495;&#24448;&#24448;&#34920;&#29616;&#19981;&#20339;&#65292;&#20027;&#35201;&#21407;&#22240;&#26159;&#19968;&#33324;&#25991;&#26412;&#25968;&#25454;&#19982;&#37329;&#34701;&#25991;&#26412;&#25968;&#25454;&#20043;&#38388;&#30340;&#24046;&#24322;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#29616;&#26377;&#30340;&#37329;&#34701;&#25991;&#26412;&#25968;&#25454;&#38598;&#25968;&#37327;&#26377;&#38480;&#65288;&#22823;&#23567;&#36739;&#23567;&#65289;&#65292;&#32780;&#31532;&#19968;&#20010;&#37329;&#34701;LLM&#65288;FinLLM&#65289;BloombergGPT&#26159;&#23553;&#38381;&#30340;&#65288;&#21482;&#21457;&#24067;&#20102;&#35757;&#32451;&#26085;&#24535;&#65289;&#12290;&#37492;&#20110;&#27492;&#65292;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#36890;&#36807;Internet&#35268;&#27169;&#30340;&#37329;&#34701;&#25968;&#25454;&#23558;LLM&#27665;&#20027;&#21270;&#65292;&#30001;&#20110;&#25968;&#25454;&#26469;&#28304;&#22810;&#26679;&#12289;&#20449;&#22122;&#27604;&#20302;&#21644;&#26102;&#38388;&#26377;&#25928;&#24615;&#39640;&#65292;&#36825;&#26159;&#19968;&#20010;&#24320;&#25918;&#24615;&#30340;&#25361;&#25112;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#24320;&#28304;&#21644;&#25968;&#25454;&#20026;&#20013;&#24515;&#30340;&#26694;&#26550;&#8220;&#37329;&#34701;&#29983;&#25104;&#39044;&#35757;&#32451;&#21464;&#21387;&#22120;&#65288;FinGPT&#65289;&#8221;&#65292;&#23427;&#21487;&#20197;&#33258;&#21160;&#25910;&#38598;&#21644;&#25972;&#29702;&#26469;&#33258;&#20114;&#32852;&#32593;&#19978;&#36229;&#36807;34&#20010;&#19981;&#21516;&#26469;&#28304;&#30340;&#23454;&#26102;&#37329;&#34701;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
Large language models (LLMs) have demonstrated remarkable proficiency in understanding and generating human-like texts, which may potentially revolutionize the finance industry. However, existing LLMs often fall short in the financial field, which is mainly attributed to the disparities between general text data and financial text data. Unfortunately, there is only a limited number of financial text datasets available (quite small size), and BloombergGPT, the first financial LLM (FinLLM), is close-sourced (only the training logs were released). In light of this, we aim to democratize Internet-scale financial data for LLMs, which is an open challenge due to diverse data sources, low signal-to-noise ratio, and high time-validity. To address the challenges, we introduce an open-sourced and data-centric framework, \textit{Financial Generative Pre-trained Transformer (FinGPT)}, that automates the collection and curation of real-time financial data from &gt;34 diverse sources on the Internet, p
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#22522;&#20110;&#24515;&#29702;&#36172;&#21338;&#30340;&#36873;&#25321;&#34920;&#31034;&#65292;&#24471;&#20986;&#20102;&#23545;&#39044;&#26399;&#25928;&#29992;&#30340;&#22522;&#26412;&#29305;&#24449;&#21270;&#65292;&#26080;&#38656;&#39069;&#22806;&#20551;&#35774;&#12290;&#19981;&#21516;&#30340;&#24577;&#24230;&#20250;&#24433;&#21709;&#23545;&#22797;&#26434;&#24615;&#30340;&#29702;&#35299;&#65292;&#23548;&#33268;&#26368;&#23567;&#26368;&#22823;&#25110;Choquet&#39044;&#26399;&#25928;&#29992;&#30340;&#29305;&#24449;&#21270;&#12290;</title><link>http://arxiv.org/abs/2307.10328</link><description>&lt;p&gt;
&#20027;&#35266;&#39044;&#26399;&#25928;&#29992;&#19982;&#24515;&#29702;&#36172;&#21338;
&lt;/p&gt;
&lt;p&gt;
Subjective Expected Utility and Psychological Gambles. (arXiv:2307.10328v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10328
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#22522;&#20110;&#24515;&#29702;&#36172;&#21338;&#30340;&#36873;&#25321;&#34920;&#31034;&#65292;&#24471;&#20986;&#20102;&#23545;&#39044;&#26399;&#25928;&#29992;&#30340;&#22522;&#26412;&#29305;&#24449;&#21270;&#65292;&#26080;&#38656;&#39069;&#22806;&#20551;&#35774;&#12290;&#19981;&#21516;&#30340;&#24577;&#24230;&#20250;&#24433;&#21709;&#23545;&#22797;&#26434;&#24615;&#30340;&#29702;&#35299;&#65292;&#23548;&#33268;&#26368;&#23567;&#26368;&#22823;&#25110;Choquet&#39044;&#26399;&#25928;&#29992;&#30340;&#29305;&#24449;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#36890;&#36807;&#24515;&#29702;&#36172;&#21338;&#30340;&#36873;&#25321;&#34920;&#31034;&#65292;&#33719;&#24471;&#20102;&#23545;&#39044;&#26399;&#25928;&#29992;&#30340;&#22522;&#26412;&#29305;&#24449;&#65292;&#36825;&#19981;&#38656;&#35201;&#38500;&#20102;&#20808;&#21518;&#20559;&#22909;&#20043;&#38388;&#30340;&#19968;&#33268;&#24615;&#20043;&#22806;&#30340;&#20219;&#20309;&#20551;&#35774;&#12290;&#23545;&#22797;&#26434;&#24615;&#30340;&#24369;&#29256;&#26412;&#19982;&#19981;&#21516;&#30340;&#24577;&#24230;&#30456;&#20851;&#65292;&#24182;&#23548;&#33268;&#20102;&#26368;&#23567;&#26368;&#22823;&#25110;Choquet&#39044;&#26399;&#25928;&#29992;&#30340;&#29305;&#24449;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
We obtain an elementary characterization of expected utility based on a representation of choice in terms of psychological gambles, which requires no assumption other than coherence between ex-ante and ex-post preferences. Weaker version of coherence are associated with various attitudes towards complexity and lead to a characterization of minimax or Choquet expected utility.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;</title><link>http://arxiv.org/abs/2302.13426</link><description>&lt;p&gt;
&#26399;&#26435;&#30340;&#20215;&#26684;&#21457;&#29616;
&lt;/p&gt;
&lt;p&gt;
Price Discovery for Derivatives. (arXiv:2302.13426v5 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13426
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#19968;&#20010;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#31169;&#26377;&#20449;&#24687;&#21644;&#39640;&#38454;&#20449;&#24687;&#23545;&#26399;&#26435;&#24066;&#22330;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#27169;&#22411;&#20801;&#35768;&#26377;&#31169;&#26377;&#20449;&#24687;&#30340;&#20132;&#26131;&#32773;&#22312;&#29366;&#24577;-&#32034;&#36180;&#38598;&#24066;&#22330;&#19978;&#20132;&#26131;&#12290;&#31561;&#20215;&#30340;&#26399;&#26435;&#24418;&#24335;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#25317;&#26377;&#20851;&#20110;&#22522;&#30784;&#36164;&#20135;&#25910;&#30410;&#30340;&#20998;&#24067;&#30340;&#31169;&#26377;&#20449;&#24687;&#65292;&#24182;&#20801;&#35768;&#20132;&#26131;&#20219;&#24847;&#26399;&#26435;&#32452;&#21512;&#30340;&#25805;&#32437;&#32773;&#12290;&#25105;&#20204;&#24471;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#65292;&#36825;&#20123;&#35299;&#25552;&#20379;&#20102;&#20851;&#20110;&#20869;&#24149;&#20132;&#26131;&#30340;&#39640;&#38454;&#20449;&#24687;&#65292;&#22914;&#20219;&#20309;&#32473;&#23450;&#30340;&#26102;&#21051;&#20132;&#26131;&#26399;&#26435;&#31574;&#30053;&#65292;&#24182;&#23558;&#36825;&#20123;&#31574;&#30053;&#27867;&#21270;&#21040;&#20102;&#27874;&#21160;&#29575;&#20132;&#26131;&#31561;&#23454;&#36341;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;
We obtain a basic theory of price discovery across derivative markets with respect to higher-order information, using a model where an agent with general private information regarding state probabilities is allowed to trade arbitrary portfolios of state-contingent claims. In an equivalent options formulation, the informed agent has private information regarding arbitrary aspects of the payoff distribution of an underlying asset and is allowed to trade arbitrary option portfolios. We characterize, in closed form, the informed demand, price impact, and information efficiency of prices. Our results offer a theory of insider trading on higher moments of the underlying payoff as a special case. The informed demand formula prescribes option strategies for trading on any given moment and extends those used in practice for, e.g. volatility trading.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24314;&#31435;&#20102;&#19968;&#20010;&#20855;&#26377;&#20449;&#29992;&#35780;&#32423;&#36801;&#31227;&#39118;&#38505;&#30340;&#21487;&#36829;&#32422;&#20844;&#21496;&#20538;&#30340;&#23450;&#20215;&#27169;&#22411;&#65292;&#35299;&#20915;&#20102;&#19968;&#20010;&#20855;&#26377;&#20004;&#20010;&#33258;&#30001;&#36793;&#30028;&#30340;&#33258;&#30001;&#36793;&#30028;&#38382;&#39064;&#65292;&#24182;&#35777;&#26126;&#20102;&#35299;&#30340;&#23384;&#22312;&#21807;&#19968;&#24615;&#21644;&#27491;&#21017;&#24615;&#12290;&#27492;&#22806;&#65292;&#36824;&#30740;&#31350;&#20102;&#35299;&#30340;&#28176;&#36817;&#34892;&#20026;&#65292;&#24182;&#32473;&#20986;&#20102;&#25968;&#20540;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2301.10898</link><description>&lt;p&gt;
&#20855;&#26377;&#20449;&#29992;&#35780;&#32423;&#36801;&#31227;&#39118;&#38505;&#30340;&#21487;&#36829;&#32422;&#20844;&#21496;&#20538;&#30340;&#21452;&#33258;&#30001;&#36793;&#30028;&#38382;&#39064;&#21450;&#20854;&#28176;&#36817;&#34892;&#20026;
&lt;/p&gt;
&lt;p&gt;
Double free boundary problem for defaultable corporate bond with credit rating migration risks and their asymptotic behaviors. (arXiv:2301.10898v2 [math.AP] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.10898
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24314;&#31435;&#20102;&#19968;&#20010;&#20855;&#26377;&#20449;&#29992;&#35780;&#32423;&#36801;&#31227;&#39118;&#38505;&#30340;&#21487;&#36829;&#32422;&#20844;&#21496;&#20538;&#30340;&#23450;&#20215;&#27169;&#22411;&#65292;&#35299;&#20915;&#20102;&#19968;&#20010;&#20855;&#26377;&#20004;&#20010;&#33258;&#30001;&#36793;&#30028;&#30340;&#33258;&#30001;&#36793;&#30028;&#38382;&#39064;&#65292;&#24182;&#35777;&#26126;&#20102;&#35299;&#30340;&#23384;&#22312;&#21807;&#19968;&#24615;&#21644;&#27491;&#21017;&#24615;&#12290;&#27492;&#22806;&#65292;&#36824;&#30740;&#31350;&#20102;&#35299;&#30340;&#28176;&#36817;&#34892;&#20026;&#65292;&#24182;&#32473;&#20986;&#20102;&#25968;&#20540;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#24314;&#31435;&#20102;&#19968;&#20010;&#20855;&#26377;&#20449;&#29992;&#35780;&#32423;&#36801;&#31227;&#39118;&#38505;&#30340;&#21487;&#36829;&#32422;&#20844;&#21496;&#20538;&#30340;&#23450;&#20215;&#27169;&#22411;&#12290;&#35813;&#27169;&#22411;&#20026;&#19968;&#20010;&#20855;&#26377;&#20004;&#20010;&#33258;&#30001;&#36793;&#30028;&#30340;&#33258;&#30001;&#36793;&#30028;&#38382;&#39064;&#12290;&#36825;&#20004;&#20010;&#33258;&#30001;&#36793;&#30028;&#26159;&#35299;&#30340;&#27700;&#24179;&#38598;&#65292;&#20294;&#31181;&#31867;&#19981;&#21516;&#12290;&#19968;&#20010;&#26469;&#33258;&#19981;&#36830;&#32493;&#30340;&#20108;&#38454;&#39033;&#65292;&#21478;&#19968;&#20010;&#26469;&#33258;&#38556;&#30861;&#29289;&#12290;&#24471;&#21040;&#20102;&#35299;&#30340;&#23384;&#22312;&#24615;&#12289;&#21807;&#19968;&#24615;&#21644;&#27491;&#21017;&#24615;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#20004;&#20010;&#33258;&#30001;&#36793;&#30028;&#26159;$C^\infty$&#30340;&#12290;&#36824;&#32771;&#34385;&#20102;&#35299;&#30340;&#28176;&#36817;&#34892;&#20026;&#65306;&#25105;&#20204;&#34920;&#26126;&#24403;&#26102;&#38388;&#36235;&#20110;&#26080;&#31351;&#26102;&#65292;&#23427;&#25910;&#25947;&#21040;&#19968;&#20010;&#34892;&#27874;&#35299;&#12290;&#27492;&#22806;&#65292;&#36824;&#32473;&#20986;&#20102;&#25968;&#20540;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this work, a pricing model for a defaultable corporate bond with credit rating migration risk is established. The model turns out to be a free boundary problem with two free boundaries. The latter are the level sets of the solution but of different kinds. One is from the discontinuous second order term, the other from the obstacle. Existence, uniqueness, and regularity of the solution are obtained. We also prove that two free boundaries are $C^\infty$. The asymptotic behavior of the solution is also considered: we show that it converges to a traveling wave solution when time goes to infinity. Moreover, numerical results are presented.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#25945;&#24072;&#24615;&#21035;&#21051;&#26495;&#21360;&#35937;&#23545;&#23398;&#29983;&#38271;&#26399;&#32467;&#26524;&#30340;&#24433;&#21709;&#65292;&#35777;&#26126;&#25945;&#24072;&#30340;&#24615;&#21035;&#21051;&#26495;&#21360;&#35937;&#21453;&#26144;&#22312;&#23398;&#29983;&#35780;&#20215;&#19978;&#65292;&#23545;&#30007;&#22899;&#23398;&#29983;&#32473;&#20104;&#19981;&#21516;&#30340;&#20998;&#25968;&#12290;</title><link>http://arxiv.org/abs/2212.08220</link><description>&lt;p&gt;
&#25945;&#24072;&#24615;&#21035;&#21051;&#26495;&#21360;&#35937;&#30340;&#38271;&#26399;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The Long-Term Effects of Teachers' Gender Stereotypes. (arXiv:2212.08220v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.08220
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#25945;&#24072;&#24615;&#21035;&#21051;&#26495;&#21360;&#35937;&#23545;&#23398;&#29983;&#38271;&#26399;&#32467;&#26524;&#30340;&#24433;&#21709;&#65292;&#35777;&#26126;&#25945;&#24072;&#30340;&#24615;&#21035;&#21051;&#26495;&#21360;&#35937;&#21453;&#26144;&#22312;&#23398;&#29983;&#35780;&#20215;&#19978;&#65292;&#23545;&#30007;&#22899;&#23398;&#29983;&#32473;&#20104;&#19981;&#21516;&#30340;&#20998;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#25945;&#24072;&#23545;&#30007;&#23401;&#21644;&#22899;&#23401;&#30340;&#21051;&#26495;&#21360;&#35937;&#35780;&#20272;&#23545;&#23398;&#29983;&#38271;&#26399;&#32467;&#26524;&#30340;&#24433;&#21709;&#65292;&#21253;&#25324;&#39640;&#20013;&#27605;&#19994;&#12289;&#22823;&#23398;&#20837;&#23398;&#21644;&#27491;&#24335;&#39046;&#22495;&#23601;&#19994;&#12290;&#25105;&#36890;&#36807;&#20998;&#26512;&#25945;&#24072;&#23545;&#24515;&#29702;&#26263;&#31034;&#27979;&#39564;&#65288;IAT&#65289;&#30340;&#21453;&#24212;&#21644;&#25945;&#24072;&#25351;&#27966;&#21644;&#30450;&#30446;&#35780;&#20998;&#32771;&#35797;&#20043;&#38388;&#30340;&#24615;&#21035;&#24046;&#36317;&#26469;&#34913;&#37327;&#25945;&#24072;&#30340;&#24615;&#21035;&#21051;&#26495;&#35780;&#20998;&#12290;&#20026;&#20102;&#22312;&#20840;&#22269;&#33539;&#22260;&#20869;&#25910;&#38598;IAT&#20998;&#25968;&#65292;&#25105;&#24320;&#21457;&#20102;&#19968;&#20010;&#22823;&#35268;&#27169;&#30340;&#25945;&#32946;&#35745;&#21010;&#65292;&#35753;&#31192;&#40065;&#20844;&#31435;&#23398;&#26657;&#30340;&#25945;&#24072;&#21644;&#23398;&#29983;&#21487;&#20197;&#21442;&#19982;&#12290;&#36825;&#39033;&#20998;&#26512;&#25552;&#20379;&#20102;&#35777;&#25454;&#65292;&#34920;&#26126;&#25945;&#24072;&#30340;&#24615;&#21035;&#21051;&#26495;&#21360;&#35937;&#21453;&#26144;&#22312;&#23398;&#29983;&#35780;&#20215;&#19978;&#65306;&#35748;&#20026;&#30007;&#23401;&#36866;&#21512;&#31185;&#23398;&#23398;&#31185;&#30340;&#25968;&#23398;&#25945;&#24072;&#32473;&#30007;&#23398;&#29983;&#27604;&#30450;&#30446;&#35780;&#20998;&#32771;&#35797;&#26356;&#39640;&#30340;&#20998;&#25968;&#12290;&#30456;&#21453;&#65292;&#35821;&#35328;&#33402;&#26415;&#25945;&#24072;&#21017;&#32473;&#22899;&#29983;&#26356;&#39640;&#30340;&#20998;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies the effects of teachers' stereotypical assessments of boys and girls on students' long-term outcomes, including high school graduation, college attendance, and formal sector employment. I measure teachers' gender stereotypical grading based on preconceptions about boys' aptitude in math and science and girls' aptitude in communicating and verbal skills by analyzing novel data on teachers' responses to the Implicit Association Test (IAT) and differences in gender gaps between teacher-assigned and blindly graded tests. To collect IAT scores on a national scale, I developed a large-scale educational program accessible to teachers and students in Peruvian public schools. This analysis provides evidence that teachers' gender stereotypes are reflected in student evaluations: math teachers with stronger stereotypes associating boys with scientific disciplines award male students with higher test scores compared to blindly-graded test scores. In contrast, language arts teach
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#23545;&#20598;&#29702;&#35770;&#65292;&#36890;&#36807;&#32771;&#34385;&#26367;&#20195;&#25968;&#25454;&#21644;&#21160;&#24577;&#20915;&#31574;&#65292;&#24110;&#21161;&#25237;&#36164;&#32773;&#30830;&#23450;&#8220;&#26377;&#29992;&#8221;&#30340;&#25968;&#25454;&#65292;&#23454;&#29616;&#20248;&#21270;&#28040;&#36153;-&#25237;&#36164;&#38382;&#39064;&#30340;&#21160;&#24577;&#20915;&#31574;&#12290;</title><link>http://arxiv.org/abs/2210.08422</link><description>&lt;p&gt;
&#20248;&#21270;&#28040;&#36153;&#25237;&#36164;&#38382;&#39064;&#20013;&#30340;&#23545;&#20598;&#24615;&#19982;&#26367;&#20195;&#25968;&#25454;
&lt;/p&gt;
&lt;p&gt;
Duality in optimal consumption--investment problems with alternative data. (arXiv:2210.08422v2 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.08422
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#23545;&#20598;&#29702;&#35770;&#65292;&#36890;&#36807;&#32771;&#34385;&#26367;&#20195;&#25968;&#25454;&#21644;&#21160;&#24577;&#20915;&#31574;&#65292;&#24110;&#21161;&#25237;&#36164;&#32773;&#30830;&#23450;&#8220;&#26377;&#29992;&#8221;&#30340;&#25968;&#25454;&#65292;&#23454;&#29616;&#20248;&#21270;&#28040;&#36153;-&#25237;&#36164;&#38382;&#39064;&#30340;&#21160;&#24577;&#20915;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#19968;&#20010;&#20248;&#21270;&#28040;&#36153;&#25237;&#36164;&#38382;&#39064;&#65292;&#20854;&#20013;&#26410;&#35266;&#23519;&#21040;&#30340;&#32929;&#31080;&#36235;&#21183;&#21463;&#21040;&#34920;&#31034;&#19981;&#21516;&#32463;&#27982;&#29615;&#22659;&#30340;&#38544;&#34255;&#39532;&#23572;&#21487;&#22827;&#38142;&#30340;&#35843;&#21046;&#12290;&#22312;&#20256;&#32479;&#26041;&#27861;&#20013;&#65292;&#38544;&#34255;&#29366;&#24577;&#26159;&#36890;&#36807;&#21382;&#21490;&#36164;&#20135;&#20215;&#26684;&#36827;&#34892;&#20272;&#35745;&#30340;&#65292;&#20294;&#26159;&#26368;&#36817;&#25216;&#26415;&#30340;&#36827;&#27493;&#20351;&#24471;&#25237;&#36164;&#32773;&#33021;&#22815;&#32771;&#34385;&#26367;&#20195;&#25968;&#25454;&#26469;&#20570;&#20915;&#31574;&#12290;&#36825;&#20123;&#26367;&#20195;&#25968;&#25454;&#21253;&#25324;&#31038;&#20132;&#23186;&#20307;&#35780;&#35770;&#12289;&#19987;&#23478;&#24847;&#35265;&#12289;COVID-19&#30123;&#24773;&#25968;&#25454;&#21644;GPS&#25968;&#25454;&#65292;&#23427;&#20204;&#26469;&#33258;&#20110;&#24066;&#22330;&#25968;&#25454;&#30340;&#26631;&#20934;&#26469;&#28304;&#20043;&#22806;&#65292;&#20294;&#34987;&#35748;&#20026;&#23545;&#39044;&#27979;&#32929;&#31080;&#36235;&#21183;&#26377;&#29992;&#12290;&#25105;&#20204;&#20026;&#36825;&#20010;&#38382;&#39064;&#21457;&#23637;&#20102;&#19968;&#20010;&#26032;&#30340;&#23545;&#20598;&#29702;&#35770;&#65292;&#24182;&#32771;&#34385;&#20102;&#26367;&#20195;&#25968;&#25454;&#31995;&#21015;&#30340;&#36339;&#36291;&#25193;&#25955;&#36807;&#31243;&#12290;&#36825;&#20010;&#29702;&#35770;&#36890;&#36807;&#25552;&#20379;&#36866;&#29992;&#20110;&#28388;&#27874;&#26041;&#31243;&#30340;&#26465;&#20214;&#65292;&#20174;&#32780;&#20801;&#35768;&#22522;&#20110;&#21160;&#24577;&#35268;&#21010;&#21407;&#29702;&#30340;&#25511;&#21046;&#26041;&#27861;&#29992;&#20110;&#24110;&#21161;&#25237;&#36164;&#32773;&#35782;&#21035;&#8220;&#26377;&#29992;&#8221;&#30340;&#26367;&#20195;&#25968;&#25454;&#65292;&#23454;&#29616;&#21160;&#24577;&#20915;&#31574;&#12290;&#25105;&#20204;&#28436;&#31034;&#20102;&#19968;&#20010;&#24212;&#29992;&#26469;&#35777;&#26126;&#19968;&#20010;&#21807;&#19968;&#30340;sm
&lt;/p&gt;
&lt;p&gt;
This study investigates an optimal consumption--investment problem in which the unobserved stock trend is modulated by a hidden Markov chain that represents different economic regimes. In the classical approach, the hidden state is estimated from historical asset prices, but recent advancements in technology enable investors to consider alternative data in their decision-making. These include social media commentary, expert opinions, COVID-19 pandemic data, and GPS data, which originate outside of the standard sources of market data but are considered useful for predicting stock trends. We develop a novel duality theory for this problem and consider a jump-diffusion process for the alternative data series. This theory helps investors in identifying ``useful'' alternative data for dynamic decision-making by offering conditions to the filter equation that permit the use of a control approach based on the dynamic programming principle. We demonstrate an application for proving a unique sm
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#32771;&#34385;&#31181;&#26063;&#24322;&#36136;&#24615;&#31038;&#20250;&#28608;&#21169;&#30340;&#21338;&#24328;&#35770;&#27169;&#22411;&#65292;&#25581;&#31034;&#20102;&#31181;&#26063;&#34701;&#21512;&#23545;&#23398;&#26657;&#20869;&#35838;&#31243;&#24046;&#24322;&#30340;&#24433;&#21709;&#12290;&#32467;&#26524;&#21457;&#29616;&#65292;&#22312;&#20027;&#35201;&#20026;&#30333;&#20154;&#23398;&#29983;&#30340;&#23398;&#26657;&#20013;&#65292;&#30001;&#20110;&#21516;&#23398;&#36873;&#35838;&#20915;&#31574;&#30340;&#26356;&#24378;&#31038;&#20250;&#28608;&#21169;&#65292;&#40657;&#20154;&#21644;&#35199;&#29677;&#29273;&#35028;&#23398;&#29983;&#22312;&#22823;&#23398;&#39044;&#22791;&#35838;&#31243;&#20013;&#30340;&#20837;&#23398;&#29575;&#26356;&#39640;&#12290;</title><link>http://arxiv.org/abs/2208.12321</link><description>&lt;p&gt;
&#33021;&#21542;&#36890;&#36807;&#31181;&#26063;&#34701;&#21512;&#26469;&#24357;&#21512;&#39640;&#20013;&#35838;&#31243;&#20013;&#30340;&#31181;&#26063;&#24046;&#36317;&#65311;
&lt;/p&gt;
&lt;p&gt;
Can Desegregation Close the Racial Gap in High School Coursework?. (arXiv:2208.12321v4 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.12321
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#32771;&#34385;&#31181;&#26063;&#24322;&#36136;&#24615;&#31038;&#20250;&#28608;&#21169;&#30340;&#21338;&#24328;&#35770;&#27169;&#22411;&#65292;&#25581;&#31034;&#20102;&#31181;&#26063;&#34701;&#21512;&#23545;&#23398;&#26657;&#20869;&#35838;&#31243;&#24046;&#24322;&#30340;&#24433;&#21709;&#12290;&#32467;&#26524;&#21457;&#29616;&#65292;&#22312;&#20027;&#35201;&#20026;&#30333;&#20154;&#23398;&#29983;&#30340;&#23398;&#26657;&#20013;&#65292;&#30001;&#20110;&#21516;&#23398;&#36873;&#35838;&#20915;&#31574;&#30340;&#26356;&#24378;&#31038;&#20250;&#28608;&#21169;&#65292;&#40657;&#20154;&#21644;&#35199;&#29677;&#29273;&#35028;&#23398;&#29983;&#22312;&#22823;&#23398;&#39044;&#22791;&#35838;&#31243;&#20013;&#30340;&#20837;&#23398;&#29575;&#26356;&#39640;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31181;&#26063;&#34701;&#21512;&#12289;&#21046;&#24230;&#20559;&#35265;&#21644;&#20010;&#20307;&#34892;&#20026;&#22312;&#25945;&#32946;&#20013;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;&#20351;&#29992;&#32771;&#34385;&#21040;&#31181;&#26063;&#24322;&#36136;&#24615;&#31038;&#20250;&#28608;&#21169;&#30340;&#21338;&#24328;&#35770;&#27169;&#22411;&#65292;&#30740;&#31350;&#35843;&#26597;&#20102;&#23398;&#26657;&#38388;&#34701;&#21512;&#23545;&#23398;&#26657;&#20869;&#35838;&#31243;&#24046;&#24322;&#30340;&#24433;&#21709;&#12290;&#20998;&#26512;&#32467;&#21512;&#20102;&#19968;&#31181;&#22522;&#20110;&#29109;&#30340;&#38548;&#31163;&#24230;&#27979;&#37327;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20248;&#21270;&#30340;&#26041;&#27861;&#26469;&#35780;&#20272;&#23398;&#29983;&#37325;&#26032;&#20998;&#37197;&#25919;&#31574;&#30340;&#24433;&#21709;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#20027;&#35201;&#20026;&#30333;&#20154;&#23398;&#29983;&#30340;&#23398;&#26657;&#20013;&#65292;&#23613;&#31649;&#40657;&#20154;&#21644;&#35199;&#29677;&#29273;&#35028;&#23398;&#29983;&#26410;&#21463;&#21040;&#36739;&#23569;&#19978;&#22823;&#23398;&#40723;&#21169;&#65292;&#20294;&#30001;&#20110;&#21516;&#23398;&#36873;&#35838;&#20915;&#31574;&#30340;&#26356;&#24378;&#31038;&#20250;&#28608;&#21169;&#65292;&#20182;&#20204;&#22312;&#22823;&#23398;&#39044;&#22791;&#35838;&#31243;&#20013;&#30340;&#20837;&#23398;&#29575;&#26356;&#39640;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper examines the interplay between desegregation, institutional bias, and individual behavior in education. Using a game-theoretic model that considers race-heterogeneous social incentives, the study investigates the effects of between-school desegregation on within-school disparities in coursework. The analysis incorporates a segregation measure based on entropy and proposes an optimization-based approach to evaluate the impact of student reassignment policies. The results highlight that Black and Hispanic students in predominantly White schools, despite receiving less encouragement to apply to college, exhibit higher enrollment in college-prep coursework due to stronger social incentives from their classmates' coursework decisions.
&lt;/p&gt;</description></item></channel></rss>