<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#36825;&#39033;&#30740;&#31350;&#25506;&#35752;&#20102;&#25551;&#36848;&#20004;&#20010;&#20915;&#31574;&#32773;&#34892;&#20026;&#30340;&#32852;&#21512;&#27010;&#29575;&#36873;&#25321;&#35268;&#21017;&#65292;&#21457;&#29616;&#23384;&#22312;&#21487;&#20197;&#28385;&#36275;&#21487;&#20998;&#31163;&#38480;&#21046;&#20294;&#19981;&#21487;&#20998;&#31163;&#30340;&#32416;&#32544;&#36873;&#25321;&#35268;&#21017;&#65292;&#36825;&#19968;&#32467;&#26524;&#23545;&#35268;&#21017;&#30340;&#38480;&#21046;&#24615;&#36136;&#36827;&#34892;&#20102;&#28145;&#20837;&#25506;&#35752;&#12290;</title><link>https://arxiv.org/abs/2403.09045</link><description>&lt;p&gt;
&#32416;&#32544;vs.&#21487;&#20998;&#31163;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Entangled vs. Separable Choice
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09045
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25506;&#35752;&#20102;&#25551;&#36848;&#20004;&#20010;&#20915;&#31574;&#32773;&#34892;&#20026;&#30340;&#32852;&#21512;&#27010;&#29575;&#36873;&#25321;&#35268;&#21017;&#65292;&#21457;&#29616;&#23384;&#22312;&#21487;&#20197;&#28385;&#36275;&#21487;&#20998;&#31163;&#38480;&#21046;&#20294;&#19981;&#21487;&#20998;&#31163;&#30340;&#32416;&#32544;&#36873;&#25321;&#35268;&#21017;&#65292;&#36825;&#19968;&#32467;&#26524;&#23545;&#35268;&#21017;&#30340;&#38480;&#21046;&#24615;&#36136;&#36827;&#34892;&#20102;&#28145;&#20837;&#25506;&#35752;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#25551;&#36848;&#20004;&#20010;&#20915;&#31574;&#32773;&#34892;&#20026;&#30340;&#32852;&#21512;&#27010;&#29575;&#36873;&#25321;&#35268;&#21017;&#65292;&#27599;&#20010;&#20915;&#31574;&#32773;&#38754;&#20020;&#21487;&#33021;&#19981;&#21516;&#30340;&#33756;&#21333;&#12290;&#24403;&#36825;&#20123;&#36873;&#25321;&#35268;&#21017;&#21487;&#20197;&#20998;&#35299;&#20026;&#27599;&#20010;&#20010;&#20307;&#30340;&#33258;&#20027;&#36873;&#25321;&#65292;&#20165;&#36890;&#36807;&#23427;&#20204;&#30340;&#20010;&#20307;&#27010;&#29575;&#36873;&#25321;&#35268;&#21017;&#30456;&#20851;&#32852;&#26102;&#65292;&#23427;&#20204;&#26159;&#21487;&#20998;&#31163;&#30340;&#12290;&#23613;&#31649;&#26368;&#36817;&#23545;&#30740;&#31350;&#36825;&#31181;&#35268;&#21017;&#24456;&#24863;&#20852;&#36259;&#65292;&#20294;&#23545;&#23427;&#20204;&#30340;&#38480;&#21046;&#30340;&#23436;&#25972;&#21051;&#30011;&#20173;&#28982;&#26159;&#19968;&#20010;&#26410;&#35299;&#30340;&#38382;&#39064;&#12290;&#19968;&#20010;&#21512;&#29702;&#30340;&#29468;&#24819;&#26159;&#65292;&#36825;&#31181;&#23545;&#21487;&#20998;&#31163;&#32852;&#21512;&#36873;&#25321;&#30340;&#38480;&#21046;&#21487;&#20197;&#20998;&#35299;&#25104;&#20010;&#20154;&#36873;&#25321;&#30340;&#38480;&#21046;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#38480;&#21046;&#21629;&#21517;&#20026;&#21487;&#20998;&#31163;&#30340;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;&#22914;&#26524;&#33267;&#23569;&#19968;&#20010;&#20915;&#31574;&#32773;&#30340;&#27010;&#29575;&#36873;&#25321;&#35268;&#21017;&#21807;&#19968;&#22320;&#30830;&#23450;&#20102;&#23545;&#30830;&#23450;&#24615;&#36873;&#25321;&#35268;&#21017;&#30340;&#20998;&#24067;&#65292;&#21017;&#35813;&#29468;&#24819;&#25104;&#31435;&#12290;&#21542;&#21017;&#65292;&#23384;&#22312;&#28385;&#36275;&#21487;&#20998;&#31163;&#38480;&#21046;&#20294;&#19981;&#21487;&#20998;&#31163;&#30340;&#32416;&#32544;&#36873;&#25321;&#35268;&#21017;&#12290;&#32416;&#32544;&#36873;&#25321;&#30340;&#21487;&#33021;&#24615;&#20351;&#24471;&#20854;&#29305;&#24449;&#21270;&#21464;&#24471;&#22797;&#26434;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09045v1 Announce Type: new  Abstract: We study joint probabilistic choice rules that describe the behavior of two decision makers, each facing a possibly different menu. These choice rules are separable when they can be factored into autonomous choices from each individual solely correlated through their individual probabilistic choice rules. Despite recent interest in studying such rules, a complete characterization of the restrictions on them remains an open question. A reasonable conjecture is that such restrictions on separable joint choice can be factored into individual choice restrictions. We name these restrictions separable and show that this conjecture is true if and only if the probabilistic choice rule of at least one decision maker uniquely identifies the distribution over deterministic choice rules. Otherwise, entangled choice rules exist that satisfy separable restrictions yet are not separable. The possibility of entangled choice complicates the characterizat
&lt;/p&gt;</description></item></channel></rss>