<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#37325;&#22797;&#30456;&#21516;&#20915;&#31574;&#36807;&#31243;&#20013;&#65292;&#21442;&#19982;&#32773;&#26159;&#21542;&#20250;&#26356;&#20542;&#21521;&#20110;&#36981;&#24490;&#24207;&#25968;&#21644;&#26399;&#26395;&#25928;&#29992;&#29702;&#35770;&#30340;&#39044;&#27979;&#34892;&#20026;&#65292;&#24182;&#21457;&#29616;&#22312;&#26368;&#21518;&#19968;&#32452;&#20915;&#31574;&#20013;&#26377;&#26356;&#22810;&#20010;&#20307;&#34920;&#29616;&#20026;&#24207;&#25968;&#21644;&#26399;&#26395;&#25928;&#29992;&#26368;&#22823;&#21270;&#32773;&#12290;</title><link>https://arxiv.org/abs/2402.16538</link><description>&lt;p&gt;
&#23398;&#20064;&#26368;&#22823;&#21270;&#65288;&#39044;&#26399;&#65289;&#25928;&#29992;
&lt;/p&gt;
&lt;p&gt;
Learning to Maximize (Expected) Utility
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16538
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#37325;&#22797;&#30456;&#21516;&#20915;&#31574;&#36807;&#31243;&#20013;&#65292;&#21442;&#19982;&#32773;&#26159;&#21542;&#20250;&#26356;&#20542;&#21521;&#20110;&#36981;&#24490;&#24207;&#25968;&#21644;&#26399;&#26395;&#25928;&#29992;&#29702;&#35770;&#30340;&#39044;&#27979;&#34892;&#20026;&#65292;&#24182;&#21457;&#29616;&#22312;&#26368;&#21518;&#19968;&#32452;&#20915;&#31574;&#20013;&#26377;&#26356;&#22810;&#20010;&#20307;&#34920;&#29616;&#20026;&#24207;&#25968;&#21644;&#26399;&#26395;&#25928;&#29992;&#26368;&#22823;&#21270;&#32773;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#36873;&#25321;&#23454;&#39564;&#20013;&#65292;&#21442;&#19982;&#32773;&#26159;&#21542;&#20250;&#22312;&#37325;&#22797;&#20174;&#30456;&#21516;&#33756;&#21333;&#20013;&#20570;&#20986;&#20915;&#31574;&#19988;&#27809;&#26377;&#25509;&#25910;&#20219;&#20309;&#21453;&#39304;&#30340;&#24773;&#20917;&#19979;&#65292;&#23398;&#20250;&#34920;&#29616;&#20986;&#19982;&#24207;&#25968;&#21644;&#26399;&#26395;&#25928;&#29992;&#29702;&#35770;&#39044;&#27979;&#26356;&#21152;&#25509;&#36817;&#30340;&#34892;&#20026;&#12290;&#25105;&#20204;&#35774;&#35745;&#24182;&#23454;&#26045;&#20102;&#19968;&#39033;&#38750;&#24378;&#21046;&#36873;&#25321;&#30340;&#23454;&#39564;&#23460;&#23454;&#39564;&#65292;&#20351;&#29992;&#20102;&#37329;&#38065;&#24425;&#31080;&#65292;&#24182;&#27599;&#20010;&#33756;&#21333;&#37325;&#22797;&#20116;&#27425;&#65292;&#26088;&#22312;&#20174;&#22810;&#20010;&#34892;&#20026;&#35282;&#24230;&#27979;&#35797;&#36825;&#19968;&#20551;&#35774;&#12290;&#22312;&#25105;&#20204;&#20174;&#33521;&#22269;&#21644;&#24503;&#22269;&#30340;308&#21517;&#21463;&#35797;&#32773;&#20013;&#30340;&#25968;&#25454;&#20013;&#65292;&#26174;&#33879;&#26356;&#22810;&#30340;&#20010;&#20307;&#22312;&#20182;&#20204;&#26368;&#21518;15&#20010;&#30456;&#21516;&#20915;&#31574;&#38382;&#39064;&#20013;&#26159;&#24207;&#25968;&#25928;&#29992;&#21644;&#26399;&#26395;&#25928;&#29992;&#30340;&#26368;&#22823;&#21270;&#32773;&#65292;&#32780;&#19981;&#26159;&#22312;&#31532;&#19968;&#20010;15&#20010;&#20013;&#12290;&#27492;&#22806;&#65292;&#22823;&#32422;&#22235;&#20998;&#20043;&#19968;&#21644;&#20116;&#20998;&#20043;&#19968;&#30340;&#25152;&#26377;&#21463;&#35797;&#32773;&#65292;&#22312;&#23454;&#39564;&#20013;&#37117;&#20197;&#36825;&#20123;&#27169;&#24335;&#20570;&#20915;&#31574;&#65292;&#20960;&#20046;&#19968;&#21322;&#26174;&#31034;&#20986;&#38750;&#24179;&#20961;&#30340;&#19981;&#21516;&#12290;&#22312;&#37027;&#20123;&#22987;&#32456;&#29702;&#24615;&#30340;&#20010;&#20307;&#19982;&#28385;&#36275;&#38543;&#26426;&#25928;&#29992;&#29702;&#35770;&#26680;&#24515;&#21407;&#21017;&#30340;&#20010;&#20307;&#20043;&#38388;&#23384;&#22312;&#26126;&#26174;&#30340;&#37325;&#21472;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16538v1 Announce Type: new  Abstract: We study if participants in a choice experiment learn to behave in ways that are closer to the predictions of ordinal and expected utility theory as they make decisions from the same menus repeatedly and without receiving feedback of any kind. We designed and implemented a non-forced-choice lab experiment with money lotteries and five repetitions per menu that aimed to test this hypothesis from many behavioural angles. In our data from 308 subjects in the UK and Germany, significantly more individuals were ordinal- and expected-utility maximizers in their last 15 than in their first 15 identical decision problems. Furthermore, around a quarter and a fifth of all subjects, respectively, decided in those modes throughout the experiment, with nearly half revealing non-trivial indifferences. A considerable overlap was found between those consistently rational individuals and the ones who satisfied core principles of random utility theory. Fi
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20351;&#29992;&#25490;&#21517;&#31243;&#24207;&#26500;&#24314;&#25351;&#25968;&#30340;&#24066;&#22330;&#27169;&#22411;&#20013;&#65292;&#34893;&#29983;&#21697;&#30340;&#38544;&#21547;&#27874;&#21160;&#24615;&#30340;&#30701;&#26399;&#34892;&#20026;&#65292;&#24182;&#25552;&#20986;&#20102;&#21487;&#20197;&#35843;&#21644;&#20004;&#20010;&#30475;&#20284;&#30683;&#30462;&#29305;&#24449;&#30340;&#27169;&#22411;&#65292;&#21516;&#26102;&#25429;&#25417;&#20102;&#19968;&#31181;&#26032;&#29616;&#35937;&#31216;&#20026;&#20934;&#29190;&#28856;&#29616;&#35937;&#12290;</title><link>https://arxiv.org/abs/2402.16509</link><description>&lt;p&gt;
&#35770;&#25351;&#25968;&#24066;&#22330;&#27169;&#22411;&#20013;&#38544;&#21547;&#27874;&#21160;&#24615;&#30340;&#30701;&#26399;&#34892;&#20026;
&lt;/p&gt;
&lt;p&gt;
On short-time behavior of implied volatility in a market model with indexes
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16509
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20351;&#29992;&#25490;&#21517;&#31243;&#24207;&#26500;&#24314;&#25351;&#25968;&#30340;&#24066;&#22330;&#27169;&#22411;&#20013;&#65292;&#34893;&#29983;&#21697;&#30340;&#38544;&#21547;&#27874;&#21160;&#24615;&#30340;&#30701;&#26399;&#34892;&#20026;&#65292;&#24182;&#25552;&#20986;&#20102;&#21487;&#20197;&#35843;&#21644;&#20004;&#20010;&#30475;&#20284;&#30683;&#30462;&#29305;&#24449;&#30340;&#27169;&#22411;&#65292;&#21516;&#26102;&#25429;&#25417;&#20102;&#19968;&#31181;&#26032;&#29616;&#35937;&#31216;&#20026;&#20934;&#29190;&#28856;&#29616;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20351;&#29992;&#25490;&#21517;&#31243;&#24207;&#26500;&#24314;&#25351;&#25968;&#30340;&#24066;&#22330;&#27169;&#22411;&#20013;&#65292;&#34893;&#29983;&#21697;&#30340;&#38544;&#21547;&#27874;&#21160;&#24615;&#30340;&#30701;&#26399;&#34892;&#20026;&#12290;&#21363;&#20351;&#22312;&#32929;&#20215;&#36981;&#24490;&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;&#21160;&#24577;&#30340;&#31616;&#21333;&#24066;&#22330;&#35774;&#32622;&#20013;&#65292;&#25490;&#21517;&#26426;&#21046;&#20063;&#21487;&#20197;&#20135;&#29983;&#32929;&#31080;&#25351;&#25968;&#30340;&#24179;&#20215;&#38544;&#21547;&#27874;&#21160;&#24615;&#20542;&#26012;&#30340;&#35266;&#23519;&#26399;&#38480;&#32467;&#26500;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#27169;&#22411;&#23637;&#31034;&#20102;&#35843;&#21644;&#20110;&#26435;&#30410;&#24066;&#22330;&#23454;&#35777;&#25968;&#25454;&#20013;&#21457;&#29616;&#30340;&#20004;&#20010;&#30475;&#20284;&#30683;&#30462;&#29305;&#24449;&#30340;&#33021;&#21147;&#65306;&#27874;&#21160;&#24615;&#30340;&#38271;&#26399;&#35760;&#24518;&#21644;&#24179;&#20215;&#20542;&#26012;&#30340;&#24130;&#24459;&#12290;&#27492;&#22806;&#65292;&#27169;&#22411;&#36824;&#20801;&#35768;&#25429;&#25417;&#19968;&#31181;&#31216;&#20026;&#20934;&#29190;&#28856;&#29616;&#35937;&#30340;&#26032;&#29616;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16509v1 Announce Type: new  Abstract: This paper investigates short-term behaviors of implied volatility of derivatives written on indexes in equity markets when the index processes are constructed by using a ranking procedure. Even in simple market settings where stock prices follow geometric Brownian motion dynamics, the ranking mechanism can produce the observed term structure of at-the-money (ATM) implied volatility skew for equity indexes. Our proposed models showcase the ability to reconcile two seemingly contradictory features found in empirical data from equity markets: the long memory of volatilities and the power law of ATM skews. Furthermore, the models allow for the capture of a novel phenomenon termed the quasi-blow-up phenomenon.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20351;&#29992;&#32447;&#24615;&#38543;&#26426;&#24310;&#36831;&#24494;&#20998;&#26041;&#31243;&#30340;&#30701;&#26399;&#21033;&#29575;&#27169;&#22411;&#65292;&#24182;&#19988;&#32473;&#20986;&#20102;&#38646;&#24687;&#20538;&#21048;&#20215;&#26684;&#30340;&#23553;&#38381;&#24418;&#24335;&#35299;&#20915;&#26041;&#26696;&#65292;&#35777;&#26126;&#20102;&#30701;&#26399;&#21033;&#29575;&#20998;&#24067;&#20026;&#27491;&#24577;&#20998;&#24067;&#19988;&#23384;&#22312;&#31283;&#24577;&#21644;&#26497;&#38480;&#20998;&#24067;&#12290;</title><link>https://arxiv.org/abs/2402.16428</link><description>&lt;p&gt;
&#20351;&#29992;&#32447;&#24615;&#38543;&#26426;&#24310;&#36831;&#24494;&#20998;&#26041;&#31243;&#23545;&#38646;&#24687;&#20538;&#21048;&#25552;&#20986;&#20102;&#23553;&#38381;&#24418;&#24335;&#35299;&#20915;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
Closed form solution to zero coupon bond using a linear stochastic delay differential equation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16428
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20351;&#29992;&#32447;&#24615;&#38543;&#26426;&#24310;&#36831;&#24494;&#20998;&#26041;&#31243;&#30340;&#30701;&#26399;&#21033;&#29575;&#27169;&#22411;&#65292;&#24182;&#19988;&#32473;&#20986;&#20102;&#38646;&#24687;&#20538;&#21048;&#20215;&#26684;&#30340;&#23553;&#38381;&#24418;&#24335;&#35299;&#20915;&#26041;&#26696;&#65292;&#35777;&#26126;&#20102;&#30701;&#26399;&#21033;&#29575;&#20998;&#24067;&#20026;&#27491;&#24577;&#20998;&#24067;&#19988;&#23384;&#22312;&#31283;&#24577;&#21644;&#26497;&#38480;&#20998;&#24067;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#28385;&#36275;&#38543;&#26426;&#24310;&#36831;&#24494;&#20998;&#26041;&#31243;&#30340;&#30701;&#26399;&#21033;&#29575;&#27169;&#22411;&#12290;&#35813;&#27169;&#22411;&#21487;&#20197;&#34987;&#35270;&#20026;Merton&#27169;&#22411;(Merton 1970, 1973)&#25110;Vasi\v{c}ek&#27169;&#22411;(Vasi\v{c}ek 1977)&#30340;&#24310;&#36831;&#29256;&#26412;&#12290;&#20351;&#29992;&#19982;Flore&#21644;Nappo(2019)&#30456;&#21516;&#30340;&#25216;&#26415;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#20538;&#21048;&#20215;&#26684;&#26159;&#30701;&#26399;&#21033;&#29575;&#30340;&#20223;&#23556;&#20989;&#25968;&#65292;&#20854;&#31995;&#25968;&#28385;&#36275;&#19968;&#32452;&#24310;&#36831;&#24494;&#20998;&#26041;&#31243;&#12290;&#25105;&#20204;&#32473;&#20986;&#20102;&#36825;&#32452;&#24310;&#36831;&#24494;&#20998;&#26041;&#31243;&#30340;&#35299;&#26512;&#35299;&#65292;&#24471;&#21040;&#20102;&#38646;&#24687;&#20538;&#21048;&#20215;&#26684;&#30340;&#23553;&#38381;&#20844;&#24335;&#12290;&#22312;&#35813;&#27169;&#22411;&#19979;&#65292;&#25105;&#20204;&#21487;&#20197;&#23637;&#31034;&#30701;&#26399;&#21033;&#29575;&#30340;&#20998;&#24067;&#26159;&#19968;&#20010;&#27491;&#24577;&#20998;&#24067;&#65292;&#20854;&#22343;&#20540;&#21462;&#20915;&#20110;&#30701;&#26399;&#21033;&#29575;&#30340;&#36807;&#21435;&#20540;&#12290;&#22522;&#20110;K\"uchler&#21644;Mensch(1992)&#30340;&#32467;&#26524;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#24179;&#31283;&#20998;&#24067;&#21644;&#26497;&#38480;&#20998;&#24067;&#30340;&#23384;&#22312;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16428v1 Announce Type: new  Abstract: We present a short rate model that satisfies a stochastic delay differential equation. The model can be considered a delayed version of the Merton model (Merton 1970, 1973) or the Vasi\v{c}ek model (Vasi\v{c}ek 1977). Using the same technique as the one used by Flore and Nappo (2019), we show that the bond price is an affine function of the short rate, whose coefficients satisfy a system of delay differential equations. We give an analytical solution to this system of delay differential equations, obtaining a closed formula for the zero coupon bond price. Under this model, we can show that the distribution of the short rate is a normal distribution whose mean depends on past values of the short rate. Based on the results of K\"uchler and Mensch (1992), we prove the existence of stationary and limiting distributions.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#31454;&#20105;&#20135;&#19994;&#30340;&#38745;&#24577;&#22343;&#34913;&#27169;&#22411;&#65292;&#36890;&#36807;&#20869;&#29983;&#30830;&#23450;&#30899;&#20215;&#26684;&#20197;&#23454;&#29616;&#29305;&#23450;&#25490;&#25918;&#30446;&#26631;&#65292;&#25506;&#35752;&#20102;&#30899;&#20215;&#26684;&#23545;&#27745;&#26579;&#20225;&#19994;&#30340;&#24433;&#21709;&#65292;&#24182;&#36890;&#36807;&#24067;&#26391;&#25216;&#26415;&#20914;&#20987;&#30340;&#26696;&#20363;&#30740;&#31350;&#35752;&#35770;&#20102;&#27169;&#22411;&#30340;&#19968;&#20123;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2402.16401</link><description>&lt;p&gt;
&#19968;&#20010;&#20855;&#26377;&#20869;&#29983;&#30899;&#20215;&#26684;&#30340;&#32511;&#33394;&#25216;&#26415;&#37319;&#32435;&#38745;&#24577;&#22343;&#34913;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
A Stationary Equilibrium Model of Green Technology Adoption with Endogenous Carbon Price
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16401
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#31454;&#20105;&#20135;&#19994;&#30340;&#38745;&#24577;&#22343;&#34913;&#27169;&#22411;&#65292;&#36890;&#36807;&#20869;&#29983;&#30830;&#23450;&#30899;&#20215;&#26684;&#20197;&#23454;&#29616;&#29305;&#23450;&#25490;&#25918;&#30446;&#26631;&#65292;&#25506;&#35752;&#20102;&#30899;&#20215;&#26684;&#23545;&#27745;&#26579;&#20225;&#19994;&#30340;&#24433;&#21709;&#65292;&#24182;&#36890;&#36807;&#24067;&#26391;&#25216;&#26415;&#20914;&#20987;&#30340;&#26696;&#20363;&#30740;&#31350;&#35752;&#35770;&#20102;&#27169;&#22411;&#30340;&#19968;&#20123;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#24182;&#20998;&#26512;&#20102;&#19968;&#20010;&#31454;&#20105;&#20135;&#19994;&#30340;&#38745;&#24577;&#22343;&#34913;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#20869;&#29983;&#30830;&#23450;&#20102;&#23454;&#29616;&#32473;&#23450;&#25490;&#25918;&#30446;&#26631;&#25152;&#38656;&#30340;&#30899;&#20215;&#26684;&#12290;&#22312;&#27169;&#22411;&#20013;&#65292;&#20225;&#19994;&#26681;&#25454;&#20854;&#25216;&#26415;&#27700;&#24179;&#36827;&#34892;&#35782;&#21035;&#65292;&#24182;&#20570;&#20986;&#29983;&#20135;&#12289;&#36827;&#20837;&#21644;&#20943;&#25490;&#20915;&#31574;&#12290;&#27745;&#26579;&#20225;&#19994;&#38656;&#25903;&#20184;&#30899;&#20215;&#26684;&#65292;&#20943;&#25490;&#34987;&#26500;&#24314;&#20026;&#19968;&#39033;&#19981;&#21487;&#36870;&#25237;&#36164;&#65292;&#20854;&#20013;&#21253;&#25324;&#22266;&#23450;&#25104;&#26412;&#65292;&#24182;&#23548;&#33268;&#20225;&#19994;&#36716;&#21521;&#30899;&#20013;&#24615;&#25216;&#26415;&#12290;&#22312;&#22343;&#34913;&#29366;&#24577;&#19979;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#19968;&#20010;&#30899;&#20215;&#26684;&#21644;&#29616;&#26377;&#27745;&#26579;&#20225;&#19994;&#30340;&#38745;&#24577;&#20998;&#24067;&#65292;&#20197;&#30830;&#20445;&#31526;&#21512;&#29305;&#23450;&#30340;&#25490;&#25918;&#30446;&#26631;&#12290;&#25105;&#20204;&#30340;&#19968;&#33324;&#29702;&#35770;&#26694;&#26550;&#19982;&#24067;&#26391;&#25216;&#26415;&#20914;&#20987;&#30340;&#26696;&#20363;&#30740;&#31350;&#30456;&#20114;&#34917;&#20805;&#65292;&#20854;&#20013;&#25105;&#20204;&#35752;&#35770;&#20102;&#27169;&#22411;&#30340;&#19968;&#20123;&#24433;&#21709;&#12290;&#25105;&#20204;&#35266;&#23519;&#21040;&#65292;&#30899;&#23450;&#20215;&#31995;&#32479;&#36830;&#21516;&#23433;&#35013;&#34917;&#36148;&#21644;&#23545;&#32511;&#33394;&#20225;&#19994;&#30340;&#31246;&#25910;&#20248;&#24800;&#21487;&#20197;&#20419;&#36827;&#36739;&#26089;&#30340;&#25237;&#36164;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16401v1 Announce Type: cross  Abstract: This paper proposes and analyzes a stationary equilibrium model for a competitive industry which endogenously determines the carbon price necessary to achieve a given emission target. In the model, firms are identified by their level of technology and make production, entry, and abatement decisions. Polluting firms are subject to a carbon price and abatement is formulated as an irreversible investment, which entails a sunk cost and results in the firms switching to a carbon neutral technology. In equilibrium, we identify a carbon price and a stationary distribution of incumbent, polluting firms, that guarantee the compliance with a certain emission target. Our general theoretical framework is complemented with a case study with Brownian technology shocks, in which we discuss some implications of our model. We observe that a carbon pricing system alongside installation subsidies and tax benefits for green firms trigger earlier investmen
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#36890;&#36807;&#20803;&#20998;&#26512;&#21457;&#29616;&#65292;&#23545;&#20302;&#27010;&#29575;&#12289;&#39640;&#24433;&#21709;&#39118;&#38505;&#30340;&#20445;&#38505;&#38656;&#27714;&#20302;&#20110;&#39044;&#26399;&#65292;&#24179;&#22343;&#24895;&#24847;&#25903;&#20184;&#37329;&#39069;&#20026;&#39044;&#26399;&#25439;&#22833;&#30340;87&#65285;&#65292;&#24182;&#21457;&#29616;&#20449;&#24687;&#21644;&#21463;&#35775;&#32773;&#29305;&#24449;&#23545;&#24895;&#24847;&#25903;&#20184;&#37329;&#39069;&#26377;&#19981;&#21516;&#24433;&#21709;&#65292;&#21516;&#26102;&#25991;&#21270;&#22240;&#32032;&#20063;&#22312;&#19981;&#21516;&#22269;&#38469;&#26679;&#26412;&#20013;&#24433;&#21709;&#30528;&#24895;&#24847;&#25903;&#20184;&#37329;&#39069;&#12290;</title><link>https://arxiv.org/abs/2402.16375</link><description>&lt;p&gt;
&#23545;&#23567;&#27010;&#29575;&#39118;&#38505;&#30340;&#20445;&#38505;&#20215;&#20540;&#35780;&#20272;&#65306;&#19968;&#39033;&#20803;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Valuing insurance against small probability risks: A meta-analysis
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16375
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#36890;&#36807;&#20803;&#20998;&#26512;&#21457;&#29616;&#65292;&#23545;&#20302;&#27010;&#29575;&#12289;&#39640;&#24433;&#21709;&#39118;&#38505;&#30340;&#20445;&#38505;&#38656;&#27714;&#20302;&#20110;&#39044;&#26399;&#65292;&#24179;&#22343;&#24895;&#24847;&#25903;&#20184;&#37329;&#39069;&#20026;&#39044;&#26399;&#25439;&#22833;&#30340;87&#65285;&#65292;&#24182;&#21457;&#29616;&#20449;&#24687;&#21644;&#21463;&#35775;&#32773;&#29305;&#24449;&#23545;&#24895;&#24847;&#25903;&#20184;&#37329;&#39069;&#26377;&#19981;&#21516;&#24433;&#21709;&#65292;&#21516;&#26102;&#25991;&#21270;&#22240;&#32032;&#20063;&#22312;&#19981;&#21516;&#22269;&#38469;&#26679;&#26412;&#20013;&#24433;&#21709;&#30528;&#24895;&#24847;&#25903;&#20184;&#37329;&#39069;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#20302;&#27010;&#29575;&#12289;&#39640;&#24433;&#21709;&#39118;&#38505;&#30340;&#33258;&#24895;&#20445;&#38505;&#38656;&#27714;&#20302;&#20110;&#39044;&#26399;&#12290;&#20026;&#20102;&#35780;&#20272;&#38656;&#27714;&#30340;&#35268;&#27169;&#65292;&#25105;&#20204;&#23545;&#20351;&#29992;&#23454;&#39564;&#28608;&#21169;&#21644;&#22522;&#20110;&#35843;&#26597;&#30340;&#20272;&#35745;&#30340;&#25968;&#25454;&#38598;&#36827;&#34892;&#20102;&#19968;&#39033;&#20851;&#32852;&#20272;&#20215;&#30740;&#31350;&#30340;&#20803;&#20998;&#26512;&#12290; &#25105;&#20204;&#21457;&#29616;&#65292;&#20445;&#38505;&#30340;&#24179;&#22343;&#24895;&#24847;&#25903;&#20184;&#37329;&#39069;&#65288;WTP&#65289;&#20026;&#39044;&#26399;&#25439;&#22833;&#30340;87&#65285;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#39033;&#20803;&#22238;&#24402;&#20998;&#26512;&#65292;&#20197;&#26816;&#39564;&#36825;&#20123;&#30740;&#31350;&#20013;WTP&#30340;&#24635;&#20307;&#24322;&#36136;&#24615;&#12290; &#20803;&#22238;&#24402;&#26174;&#31034;&#65292;&#25439;&#22833;&#27010;&#29575;&#21644;&#27010;&#29575;&#27700;&#24179;&#30340;&#20449;&#24687;&#31215;&#26497;&#24433;&#21709;&#30456;&#23545;&#24895;&#24847;&#25903;&#20184;&#65292;&#32780;&#21463;&#35775;&#32773;&#30340;&#24179;&#22343;&#25910;&#20837;&#21644;&#24180;&#40836;&#21017;&#20855;&#26377;&#36127;&#38754;&#24433;&#21709;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#25991;&#21270;&#23376;&#22240;&#32032;&#65292;&#20363;&#22914;&#26435;&#21147;&#36317;&#31163;&#21644;&#19981;&#30830;&#23450;&#24615;&#22238;&#36991;&#65292;&#36827;&#19968;&#27493;&#35299;&#37322;&#20102;&#22269;&#38469;&#26679;&#26412;&#20013;WTP&#24046;&#24322;&#12290; &#19982;&#25277;&#26679;&#21644;&#25968;&#25454;&#25910;&#38598;&#36807;&#31243;&#30456;&#20851;&#30340;&#26041;&#27861;ological&#22240;&#32032;&#26174;&#33879;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16375v1 Announce Type: new  Abstract: The demand for voluntary insurance against low-probability, high-impact risks is lower than expected. To assess the magnitude of the demand, we conduct a meta-analysis of contingent valuation studies using a dataset of experimentally elicited and survey-based estimates. We find that the average stated willingness to pay (WTP) for insurance is 87% of expected losses. We perform a meta-regression analysis to examine the heterogeneity in aggregate WTP across these studies. The meta-regression reveals that information about loss probability and probability levels positively influence relative willingness to pay, whereas respondents' average income and age have a negative effect. Moreover, we identify cultural sub-factors, such as power distance and uncertainty avoidance, that provided additional explanations for differences in WTP across international samples. Methodological factors related to the sampling and data collection process signifi
&lt;/p&gt;</description></item><item><title>&#39044;&#27979;&#24066;&#22330;&#20013;&#25552;&#20986;&#20102;&#19968;&#20010;&#21160;&#24577;&#27169;&#22411;&#65292;&#35777;&#26126;&#20102;&#22914;&#26524;&#26377;&#20195;&#29702;&#33021;&#20570;&#20986;&#27491;&#30830;&#30340;&#19979;&#19968;&#26399;&#39044;&#27979;&#65292;&#37027;&#20040;&#32858;&#21512;&#24066;&#22330;&#39044;&#27979;&#23558;&#25910;&#25947;&#20110;&#38543;&#26426;&#21521;&#37327;&#30340;&#26465;&#20214;&#26399;&#26395;&#12290;</title><link>https://arxiv.org/abs/2402.16345</link><description>&lt;p&gt;
&#39044;&#27979;&#24066;&#22330;&#20013;&#39044;&#27979;&#25910;&#25947;&#38382;&#39064;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On convergence of forecasts in prediction markets
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16345
&lt;/p&gt;
&lt;p&gt;
&#39044;&#27979;&#24066;&#22330;&#20013;&#25552;&#20986;&#20102;&#19968;&#20010;&#21160;&#24577;&#27169;&#22411;&#65292;&#35777;&#26126;&#20102;&#22914;&#26524;&#26377;&#20195;&#29702;&#33021;&#20570;&#20986;&#27491;&#30830;&#30340;&#19979;&#19968;&#26399;&#39044;&#27979;&#65292;&#37027;&#20040;&#32858;&#21512;&#24066;&#22330;&#39044;&#27979;&#23558;&#25910;&#25947;&#20110;&#38543;&#26426;&#21521;&#37327;&#30340;&#26465;&#20214;&#26399;&#26395;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#39044;&#27979;&#24066;&#22330;&#30340;&#21160;&#24577;&#27169;&#22411;&#65292;&#20854;&#20013;&#20195;&#29702;&#39044;&#27979;&#19968;&#31995;&#21015;&#38543;&#26426;&#21521;&#37327;&#30340;&#20540;&#12290;&#20027;&#35201;&#32467;&#26524;&#34920;&#26126;&#65292;&#22914;&#26524;&#26377;&#20195;&#29702;&#33021;&#20570;&#20986;&#27491;&#30830;&#65288;&#25110;&#28176;&#36817;&#27491;&#30830;&#65289;&#30340;&#19979;&#19968;&#26399;&#39044;&#27979;&#65292;&#37027;&#20040;&#32858;&#21512;&#30340;&#24066;&#22330;&#39044;&#27979;&#23558;&#25910;&#25947;&#20110;&#38543;&#26426;&#21521;&#37327;&#30340;&#19979;&#19968;&#26399;&#26465;&#20214;&#26399;&#26395;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16345v1 Announce Type: cross  Abstract: We propose a dynamic model of a prediction market in which agents predict the values of a sequence of random vectors. The main result shows that if there are agents who make correct (or asymptotically correct) next-period forecasts, then the aggregated market forecasts converge to the next-period conditional expectations of the random vectors.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;&#36136;&#37327;-&#22810;&#26679;&#24615;&#65288;QD&#65289;&#20248;&#21270;&#30340;&#25214;&#21040;&#22810;&#26679;&#36817;&#20284;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#21306;&#22495;&#30340;&#26032;&#26041;&#27861;&#65292;&#22312;&#37329;&#34701;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#20013;&#20855;&#26377;&#28508;&#22312;&#21069;&#26223;&#12290;</title><link>https://arxiv.org/abs/2402.16118</link><description>&lt;p&gt;
&#29992;&#36136;&#37327;-&#22810;&#26679;&#24615;&#20248;&#21270;&#25214;&#21040;&#36817;&#20284;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;
&lt;/p&gt;
&lt;p&gt;
Finding Near-Optimal Portfolios With Quality-Diversity
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16118
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;&#36136;&#37327;-&#22810;&#26679;&#24615;&#65288;QD&#65289;&#20248;&#21270;&#30340;&#25214;&#21040;&#22810;&#26679;&#36817;&#20284;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#21306;&#22495;&#30340;&#26032;&#26041;&#27861;&#65292;&#22312;&#37329;&#34701;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#20013;&#20855;&#26377;&#28508;&#22312;&#21069;&#26223;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22810;&#25968;&#20256;&#32479;&#30340;&#37329;&#34701;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#26041;&#27861;&#22522;&#20110;&#22343;&#20540;-&#26041;&#24046;&#65288;MV&#65289;&#26694;&#26550;&#12290;&#22312;&#32473;&#23450;&#39118;&#38505;&#21388;&#24694;&#31995;&#25968;&#30340;&#24773;&#20917;&#19979;&#65292;MV&#31243;&#24207;&#20250;&#20135;&#29983;&#19968;&#20010;&#20195;&#34920;&#39118;&#38505;&#21644;&#22238;&#25253;&#20043;&#38388;&#26368;&#20339;&#26435;&#34913;&#30340;&#21333;&#19968;&#25237;&#36164;&#32452;&#21512;&#12290;&#28982;&#32780;&#65292;&#30001;&#27492;&#24471;&#21040;&#30340;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#25454;&#30693;&#23545;&#36755;&#20837;&#21442;&#25968;&#65292;&#21363;&#39044;&#26399;&#22238;&#25253;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#20272;&#35745;&#21644;&#24179;&#22343;&#22238;&#25253;&#30690;&#37327;&#38750;&#24120;&#25935;&#24863;&#12290;&#24050;&#32463;&#34920;&#26126;&#65292;&#19968;&#20010;&#26356;&#20026;&#31283;&#20581;&#21644;&#28789;&#27963;&#30340;&#26367;&#20195;&#26041;&#26696;&#22312;&#20110;&#30830;&#23450;&#25972;&#20010;&#36817;&#20284;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#21306;&#22495;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36136;&#37327;-&#22810;&#26679;&#24615;&#65288;QD&#65289;&#20248;&#21270;&#25214;&#21040;&#22810;&#26679;&#21270;&#19968;&#32452;&#27492;&#31867;&#25237;&#36164;&#32452;&#21512;&#30340;&#26032;&#26041;&#27861;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#36866;&#29992;&#20110;&#39640;&#32500;&#35774;&#32622;&#30340;CVT-MAP-Elites&#31639;&#27861;&#65292;&#21487;&#33021;&#20855;&#26377;&#25968;&#30334;&#20010;&#34892;&#20026;&#25551;&#36848;&#31526;&#21644;/&#25110;&#36164;&#20135;&#12290;&#32467;&#26524;&#31361;&#20986;&#20102;QD&#20316;&#20026;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#20013;&#30340;&#26032;&#24037;&#20855;&#30340;&#26377;&#21069;&#26223;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16118v1 Announce Type: new  Abstract: The majority of standard approaches to financial portfolio optimization (PO) are based on the mean-variance (MV) framework. Given a risk aversion coefficient, the MV procedure yields a single portfolio that represents the optimal trade-off between risk and return. However, the resulting optimal portfolio is known to be highly sensitive to the input parameters, i.e., the estimates of the return covariance matrix and the mean return vector. It has been shown that a more robust and flexible alternative lies in determining the entire region of near-optimal portfolios. In this paper, we present a novel approach for finding a diverse set of such portfolios based on quality-diversity (QD) optimization. More specifically, we employ the CVT-MAP-Elites algorithm, which is scalable to high-dimensional settings with potentially hundreds of behavioral descriptors and/or assets. The results highlight the promising features of QD as a novel tool in PO.
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#23558;DQN&#31639;&#27861;&#24341;&#20837;&#36164;&#20135;&#31649;&#29702;&#25237;&#36164;&#32452;&#21512;&#20013;&#65292;&#26412;&#30740;&#31350;&#35777;&#26126;&#20102;DRL&#31639;&#27861;&#22312;&#25237;&#36164;&#32452;&#21512;&#31649;&#29702;&#20013;&#30340;&#26377;&#25928;&#24615;</title><link>https://arxiv.org/abs/2402.15994</link><description>&lt;p&gt;
&#21033;&#29992;&#28145;&#24230;&#23398;&#20064;&#20248;&#21270;&#25968;&#23383;&#36164;&#20135;&#30340;&#25237;&#36164;&#32452;&#21512;&#31649;&#29702;&#21644;&#39118;&#38505;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
Optimizing Portfolio Management and Risk Assessment in Digital Assets Using Deep Learning for Predictive Analysis
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15994
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#23558;DQN&#31639;&#27861;&#24341;&#20837;&#36164;&#20135;&#31649;&#29702;&#25237;&#36164;&#32452;&#21512;&#20013;&#65292;&#26412;&#30740;&#31350;&#35777;&#26126;&#20102;DRL&#31639;&#27861;&#22312;&#25237;&#36164;&#32452;&#21512;&#31649;&#29702;&#20013;&#30340;&#26377;&#25928;&#24615;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#25237;&#36164;&#32452;&#21512;&#31649;&#29702;&#38382;&#39064;&#24050;&#22312;&#20154;&#24037;&#26234;&#33021;&#39046;&#22495;&#24471;&#21040;&#24191;&#27867;&#30740;&#31350;&#65292;&#20294;&#29616;&#26377;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#37327;&#21270;&#20132;&#26131;&#26041;&#27861;&#20173;&#23384;&#22312;&#19968;&#20123;&#21487;&#20197;&#25913;&#36827;&#30340;&#26041;&#38754;&#12290;&#26412;&#25991;&#23558;DQN&#31639;&#27861;&#20197;&#19968;&#31181;&#20840;&#26032;&#32780;&#30452;&#25509;&#30340;&#26041;&#24335;&#24341;&#20837;&#36164;&#20135;&#31649;&#29702;&#25237;&#36164;&#32452;&#21512;&#20013;&#65292;&#24615;&#33021;&#22823;&#22823;&#36229;&#36807;&#22522;&#20934;&#65292;&#20805;&#20998;&#35777;&#26126;&#20102;DRL&#31639;&#27861;&#22312;&#25237;&#36164;&#32452;&#21512;&#31649;&#29702;&#20013;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15994v1 Announce Type: cross  Abstract: Portfolio management issues have been extensively studied in the field of artificial intelligence in recent years, but existing deep learning-based quantitative trading methods have some areas where they could be improved. First of all, the prediction mode of stocks is singular; often, only one trading expert is trained by a model, and the trading decision is solely based on the prediction results of the model. Secondly, the data source used by the model is relatively simple, and only considers the data of the stock itself, ignoring the impact of the whole market risk on the stock. In this paper, the DQN algorithm is introduced into asset management portfolios in a novel and straightforward way, and the performance greatly exceeds the benchmark, which fully proves the effectiveness of the DRL algorithm in portfolio management. This also inspires us to consider the complexity of financial problems, and the use of algorithms should be fu
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#25972;&#21512;&#23884;&#20837;&#24335;&#25216;&#26415;&#21644;&#34433;&#32676;&#31639;&#27861;&#65292;&#26412;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#20010;&#20808;&#36827;&#30340;&#29289;&#27969;&#36319;&#36394;&#31995;&#32479;&#65292;&#20197;&#20248;&#21270;&#29289;&#27969;&#21253;&#35065;&#20998;&#21457;&#36335;&#32447;&#65292;&#26174;&#33879;&#25913;&#36827;&#20102;&#24179;&#22343;&#20132;&#36135;&#26102;&#38388;&#12290;</title><link>https://arxiv.org/abs/2402.15965</link><description>&lt;p&gt;
&#19981;&#26029;&#36827;&#21270;&#30340;&#30005;&#23376;&#21830;&#21153;&#29289;&#27969;&#35268;&#21010; - &#25972;&#21512;&#23884;&#20837;&#24335;&#25216;&#26415;&#21644;&#34433;&#32676;&#31639;&#27861;&#20197;&#25552;&#39640;&#25928;&#29575;
&lt;/p&gt;
&lt;p&gt;
Evolving E-commerce Logistics Planning- Integrating Embedded Technology and Ant Colony Algorithm for Enhanced Efficiency
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15965
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#25972;&#21512;&#23884;&#20837;&#24335;&#25216;&#26415;&#21644;&#34433;&#32676;&#31639;&#27861;&#65292;&#26412;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#20010;&#20808;&#36827;&#30340;&#29289;&#27969;&#36319;&#36394;&#31995;&#32479;&#65292;&#20197;&#20248;&#21270;&#29289;&#27969;&#21253;&#35065;&#20998;&#21457;&#36335;&#32447;&#65292;&#26174;&#33879;&#25913;&#36827;&#20102;&#24179;&#22343;&#20132;&#36135;&#26102;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32593;&#32476;&#26102;&#20195;&#30340;&#32972;&#26223;&#19979;&#65292;&#30005;&#23376;&#21830;&#21153;&#34892;&#19994;&#32463;&#21382;&#20102;&#26174;&#33879;&#25193;&#24352;&#65292;&#29305;&#21035;&#26159;&#36817;&#24180;&#26469;&#36328;&#22659;&#30005;&#23376;&#21830;&#21153;&#65288;CBEC&#65289;&#30340;&#20986;&#29616;&#12290;&#36825;&#31181;&#22686;&#38271;&#36235;&#21183;&#25345;&#32493;&#23384;&#22312;&#65292;&#38656;&#35201;&#20581;&#22766;&#30340;&#29289;&#27969;&#26694;&#26550;&#26469;&#21487;&#25345;&#32493;&#25903;&#25345;&#36816;&#33829;&#12290;&#28982;&#32780;&#65292;&#24403;&#21069;&#30340;&#30005;&#23376;&#21830;&#21153;&#29289;&#27969;&#33539;&#24335;&#38754;&#20020;&#30528;&#28385;&#36275;&#19981;&#26029;&#21457;&#23637;&#30340;&#29992;&#25143;&#38656;&#27714;&#30340;&#25361;&#25112;&#65292;&#20419;&#20351;&#20154;&#20204;&#23547;&#27714;&#21019;&#26032;&#35299;&#20915;&#26041;&#26696;&#12290;&#26412;&#30740;&#31350;&#36890;&#36807;&#23545;CBEC&#29289;&#27969;&#27169;&#22411;&#36827;&#34892;&#20840;&#38754;&#20998;&#26512;&#65292;&#24182;&#23558;&#23884;&#20837;&#24335;&#25216;&#26415;&#25972;&#21512;&#21040;&#29289;&#27969;&#26694;&#26550;&#20013;&#65292;&#24320;&#21457;&#20102;&#19968;&#20010;&#39640;&#32423;&#29289;&#27969;&#36319;&#36394;&#31995;&#32479;&#65292;&#20197;&#35299;&#20915;&#36825;&#20123;&#22797;&#26434;&#24615;&#12290;&#27492;&#22806;&#65292;&#37319;&#29992;&#34433;&#32676;&#31639;&#27861;&#65292;&#30740;&#31350;&#23545;&#29289;&#27969;&#21253;&#35065;&#20998;&#21457;&#36335;&#32447;&#36827;&#34892;&#20248;&#21270;&#35268;&#21010;&#23454;&#39564;&#12290;&#22312;&#20851;&#38190;&#25351;&#26631;&#22914;&#24179;&#22343;&#20132;&#36135;&#26102;&#38388;&#26041;&#38754;&#35266;&#23519;&#21040;&#20102;&#26174;&#33879;&#30340;&#25913;&#36827;&#65292;&#34920;&#26126;&#20102;&#36825;&#31181;&#26041;&#27861;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15965v1 Announce Type: new  Abstract: Amidst the era of networking, the e-commerce sector has undergone notable expansion, notably with the advent of Cross-border E-commerce (CBEC) in recent times. This growth trend persists, necessitating robust logistical frameworks to sustainably support operations. However, the current e-commerce logistics paradigm faces challenges in meeting evolving user demands, prompting a quest for innovative solutions. This research endeavors to address these complexities by undertaking a comprehensive analysis of CBEC logistics models and integrating embedded technology into logistical frameworks, resulting in the development of an advanced logistics tracking system. Moreover, employing the ant colony algorithm, the study conducts experimental investigations into optimizing logistics package distribution route planning. Noteworthy enhancements are observed in key metrics such as average delivery time, signaling the efficacy of this approach. In es
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#33945;&#29305;&#21345;&#27931;&#30340;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#26694;&#26550;&#65292;&#29992;&#20110;&#30334;&#24917;&#22823;&#26399;&#26435;&#23450;&#20215;&#65292;&#20855;&#26377;&#39640;&#25928;&#38745;&#24577;&#22871;&#26399;&#20445;&#20540;&#21644;&#26377;&#25928;&#29983;&#25104;&#25950;&#21475;&#37197;&#32622;&#31561;&#20248;&#21183;&#65292;&#24182;&#24341;&#20837;&#20102;&#19968;&#31181;&#26088;&#22312;&#21152;&#36895;&#25910;&#25947;&#30340;&#26032;&#22411;&#20248;&#21270;&#31639;&#27861;&#12290;</title><link>https://arxiv.org/abs/2402.15936</link><description>&lt;p&gt;
&#20026;&#30334;&#24917;&#22823;&#26399;&#26435;&#23450;&#20215;&#20248;&#21270;&#31070;&#32463;&#32593;&#32476;&#65306;&#25910;&#25947;&#21152;&#36895;&#12289;&#26410;&#26469;&#25950;&#21475;&#35780;&#20272;&#19982;&#23545;&#25163;&#26041;&#20449;&#29992;&#39118;&#38505;&#20013;&#30340;&#25554;&#20540;
&lt;/p&gt;
&lt;p&gt;
Optimizing Neural Networks for Bermudan Option Pricing: Convergence Acceleration, Future Exposure Evaluation and Interpolation in Counterparty Credit Risk
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15936
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#33945;&#29305;&#21345;&#27931;&#30340;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#26694;&#26550;&#65292;&#29992;&#20110;&#30334;&#24917;&#22823;&#26399;&#26435;&#23450;&#20215;&#65292;&#20855;&#26377;&#39640;&#25928;&#38745;&#24577;&#22871;&#26399;&#20445;&#20540;&#21644;&#26377;&#25928;&#29983;&#25104;&#25950;&#21475;&#37197;&#32622;&#31561;&#20248;&#21183;&#65292;&#24182;&#24341;&#20837;&#20102;&#19968;&#31181;&#26088;&#22312;&#21152;&#36895;&#25910;&#25947;&#30340;&#26032;&#22411;&#20248;&#21270;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#33945;&#29305;&#21345;&#27931;&#30340;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#26694;&#26550;&#65292;&#29992;&#20110;&#23545;&#30334;&#24917;&#22823;&#26399;&#26435;&#36827;&#34892;&#23450;&#20215;&#65292;&#20855;&#26377;&#20960;&#20010;&#26174;&#33879;&#20248;&#21183;&#12290;&#36825;&#20123;&#20248;&#21183;&#21253;&#25324;&#30446;&#26631;&#30334;&#24917;&#22823;&#26399;&#26435;&#30340;&#39640;&#25928;&#38745;&#24577;&#22871;&#26399;&#20445;&#20540;&#20197;&#21450;&#29992;&#20110;&#39118;&#38505;&#31649;&#29702;&#30340;&#25950;&#21475;&#37197;&#32622;&#30340;&#26377;&#25928;&#29983;&#25104;&#12290;&#25105;&#20204;&#36824;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#20248;&#21270;&#31639;&#27861;&#65292;&#26088;&#22312;&#21152;&#36895;Lokeshwar&#31561;&#20154;&#65288;2022&#24180;&#65289;&#25552;&#20986;&#30340;&#31070;&#32463;&#32593;&#32476;&#26694;&#26550;&#30340;&#25910;&#25947;&#65292;&#21516;&#26102;&#25903;&#25345;&#20840;&#38754;&#30340;&#38169;&#35823;&#25910;&#25947;&#20998;&#26512;&#12290;&#25105;&#20204;&#23545;&#39532;&#23572;&#21487;&#22827;&#21644;&#26080;&#22871;&#21033;&#20551;&#35774;&#19979;&#30340;&#29616;&#20540;&#65288;PV&#65289;&#20998;&#24067;&#36827;&#34892;&#20102;&#24191;&#27867;&#30340;&#27604;&#36739;&#20998;&#26512;&#12290;&#25105;&#20204;&#23558;&#26412;&#25991;&#25552;&#20986;&#30340;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#19982;Longstaff&#21644;Schwartz&#65288;2001&#24180;&#65289;&#26368;&#21021;&#24341;&#20837;&#30340;&#26041;&#27861;&#32467;&#21512;&#36215;&#26469;&#65292;&#24182;&#22312;&#25152;&#26377;&#30334;&#24917;&#22823;&#34892;&#26435;&#26102;&#28857;&#19978;&#23558;&#20854;&#19982;&#30001;Fang&#21644;Oosterlee&#65288;2009&#24180;&#65289;&#39318;&#21019;&#30340;COS&#27169;&#22411;&#36827;&#34892;&#20102;&#22522;&#20934;&#23545;&#27604;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#35780;&#20272;&#20102;&#25950;&#21475;&#37197;&#32622;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15936v1 Announce Type: new  Abstract: This paper presents a Monte-Carlo-based artificial neural network framework for pricing Bermudan options, offering several notable advantages. These advantages encompass the efficient static hedging of the target Bermudan option and the effective generation of exposure profiles for risk management. We also introduce a novel optimisation algorithm designed to expedite the convergence of the neural network framework proposed by Lokeshwar et al. (2022) supported by a comprehensive error convergence analysis. We conduct an extensive comparative analysis of the Present Value (PV) distribution under Markovian and no-arbitrage assumptions. We compare the proposed neural network model in conjunction with the approach initially introduced by Longstaff and Schwartz (2001) and benchmark it against the COS model, the pricing model pioneered by Fang and Oosterlee (2009), across all Bermudan exercise time points. Additionally, we evaluate exposure pro
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;Volterra-Heston&#27169;&#22411;&#20013;&#23545;&#20960;&#20309;&#20122;&#24335;&#26399;&#26435;&#30340;&#23450;&#20215;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#38024;&#23545;&#36825;&#31181;&#31867;&#21035;&#38543;&#26426;&#27874;&#21160;&#29575;&#27169;&#22411;&#30340;&#20960;&#20309;&#20122;&#24335;&#26399;&#26435;&#20215;&#26684;&#30340;&#21322;&#23553;&#38381;&#24335;&#20844;&#24335;&#65292;&#24182;&#37319;&#29992;&#20102;&#25968;&#20540;&#30740;&#31350;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2402.15828</link><description>&lt;p&gt;
Volterra-Heston&#27169;&#22411;&#20013;&#20960;&#20309;&#20122;&#24335;&#26399;&#26435;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
Pricing of geometric Asian options in the Volterra-Heston model
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15828
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;Volterra-Heston&#27169;&#22411;&#20013;&#23545;&#20960;&#20309;&#20122;&#24335;&#26399;&#26435;&#30340;&#23450;&#20215;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#38024;&#23545;&#36825;&#31181;&#31867;&#21035;&#38543;&#26426;&#27874;&#21160;&#29575;&#27169;&#22411;&#30340;&#20960;&#20309;&#20122;&#24335;&#26399;&#26435;&#20215;&#26684;&#30340;&#21322;&#23553;&#38381;&#24335;&#20844;&#24335;&#65292;&#24182;&#37319;&#29992;&#20102;&#25968;&#20540;&#30740;&#31350;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20960;&#20309;&#20122;&#24335;&#26399;&#26435;&#26159;&#19968;&#31181;&#26399;&#26435;&#31867;&#22411;&#65292;&#20854;&#22238;&#25253;&#21462;&#20915;&#20110;&#19968;&#23450;&#26102;&#38388;&#27573;&#20869;&#22522;&#30784;&#36164;&#20135;&#30340;&#20960;&#20309;&#24179;&#22343;&#20540;&#12290;&#26412;&#25991;&#20851;&#27880;&#30340;&#26159;&#22312;Volterra-Heston&#27169;&#22411;&#31867;&#20013;&#23545;&#27492;&#31867;&#26399;&#26435;&#30340;&#23450;&#20215;&#65292;&#28085;&#30422;&#20102;&#31895;&#31961;Heston&#27169;&#22411;&#12290;&#25105;&#20204;&#24471;&#21040;&#20102;&#36825;&#31867;&#38543;&#26426;&#27874;&#21160;&#29575;&#27169;&#22411;&#20013;&#22266;&#23450;&#21644;&#28014;&#21160;&#25191;&#34892;&#20215;&#26684;&#30340;&#20960;&#20309;&#20122;&#24335;&#26399;&#26435;&#20215;&#26684;&#30340;&#21322;&#23553;&#38381;&#24335;&#20844;&#24335;&#12290;&#36825;&#20123;&#20844;&#24335;&#38656;&#35201;&#26126;&#30830;&#35745;&#31639;&#32929;&#20215;&#23545;&#25968;&#21644;&#32929;&#20215;&#20960;&#20309;&#24179;&#22343;&#23545;&#25968;&#30340;&#26465;&#20214;&#32852;&#21512;Fourier&#21464;&#25442;&#12290;&#23558;&#25105;&#20204;&#30340;&#38382;&#39064;&#32852;&#31995;&#21040;&#20223;&#23556;Volterra&#36807;&#31243;&#29702;&#35770;&#65292;&#25105;&#20204;&#23558;&#36825;&#20010;Fourier&#21464;&#25442;&#34920;&#31034;&#20026;&#19968;&#20010;&#36866;&#24403;&#26500;&#36896;&#30340;&#38543;&#26426;&#25351;&#25968;&#65292;&#20854;&#21462;&#20915;&#20110;Riccati-Volterra&#26041;&#31243;&#30340;&#35299;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#22312;&#31895;&#31961;Heston&#27169;&#22411;&#20013;&#23545;&#25105;&#20204;&#30340;&#32467;&#26524;&#36827;&#34892;&#20102;&#25968;&#20540;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15828v1 Announce Type: new  Abstract: Geometric Asian options are a type of options where the payoff depends on the geometric mean of the underlying asset over a certain period of time. This paper is concerned with the pricing of such options for the class of Volterra-Heston models, covering the rough Heston model. We are able to derive semi-closed formulas for the prices of geometric Asian options with fixed and floating strikes for this class of stochastic volatility models. These formulas require the explicit calculation of the conditional joint Fourier transform of the logarithm of the stock price and the logarithm of the geometric mean of the stock price over time. Linking our problem to the theory of affine Volterra processes, we find a representation of this Fourier transform as a suitably constructed stochastic exponential, which depends on the solution of a Riccati-Volterra equation. Finally we provide a numerical study for our results in the rough Heston model.
&lt;/p&gt;</description></item><item><title>&#20351;&#29992;&#25237;&#20837;&#20135;&#20986;&#34920;&#26500;&#24314;&#32593;&#32476;&#20998;&#26512;&#20102;&#20013;&#22269;&#21644;&#26085;&#26412;&#20043;&#38388;&#30340;&#37096;&#38376;&#32467;&#26500;&#24046;&#24322;&#65292;&#26174;&#31034;&#20986;&#21046;&#36896;&#19994;&#26159;&#20013;&#22269;&#30340;&#20013;&#24515;&#37096;&#38376;&#65292;&#32780;&#26085;&#26412;&#26356;&#38738;&#30544;&#26381;&#21153;&#19994;&#12290;</title><link>https://arxiv.org/abs/2402.15620</link><description>&lt;p&gt;
&#20013;&#22269;&#21644;&#26085;&#26412;&#37096;&#38376;&#32467;&#26500;&#30340;&#27604;&#36739;&#65306;&#32593;&#32476;&#35270;&#35282;
&lt;/p&gt;
&lt;p&gt;
Comparison of sectoral structures between China and Japan: A network perspective
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15620
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#25237;&#20837;&#20135;&#20986;&#34920;&#26500;&#24314;&#32593;&#32476;&#20998;&#26512;&#20102;&#20013;&#22269;&#21644;&#26085;&#26412;&#20043;&#38388;&#30340;&#37096;&#38376;&#32467;&#26500;&#24046;&#24322;&#65292;&#26174;&#31034;&#20986;&#21046;&#36896;&#19994;&#26159;&#20013;&#22269;&#30340;&#20013;&#24515;&#37096;&#38376;&#65292;&#32780;&#26085;&#26412;&#26356;&#38738;&#30544;&#26381;&#21153;&#19994;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20013;&#22269;&#21644;&#26085;&#26412;&#20043;&#38388;&#30340;&#32463;&#27982;&#32467;&#26500;&#27604;&#36739;&#38271;&#26399;&#20197;&#26469;&#19968;&#30452;&#21560;&#24341;&#30528;&#21457;&#23637;&#32463;&#27982;&#23398;&#23478;&#30340;&#20851;&#27880;&#12290;&#20026;&#20102;&#26356;&#28145;&#20837;&#22320;&#30740;&#31350;&#20004;&#22269;&#20174;1995&#24180;&#21040;2018&#24180;&#30340;&#37096;&#38376;&#24046;&#24322;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;&#20004;&#22269;&#24180;&#24230;&#25237;&#20837;&#20135;&#20986;&#34920;(IOTs)&#26469;&#26500;&#24314;&#21152;&#26435;&#21644;&#23450;&#21521;&#30340;&#25237;&#20837;&#20135;&#20986;&#32593;&#32476;(IONs)&#12290;&#36825;&#26377;&#21161;&#20110;&#36827;&#34892;&#26356;&#28145;&#20837;&#30340;&#32593;&#32476;&#20998;&#26512;&#12290;&#24378;&#24230;&#20998;&#24067;&#31361;&#26174;&#20102;&#37096;&#38376;&#38388;&#32463;&#27982;&#20114;&#21160;&#30340;&#24046;&#24322;&#12290;&#21152;&#26435;&#12289;&#23450;&#21521;&#30340;&#21516;&#37197;&#31995;&#25968;&#27010;&#25324;&#20102;&#30456;&#36830;&#37096;&#38376;&#29305;&#24449;&#20043;&#38388;&#30340;&#21516;&#36136;&#24615;&#12290;&#36890;&#36807;&#35843;&#25972;PageRank&#20013;&#24515;&#24615;&#30340;&#37325;&#28857;&#65292;&#30830;&#23450;&#20102;&#20851;&#38190;&#37096;&#38376;&#12290;&#31038;&#21306;&#26816;&#27979;&#25581;&#31034;&#20102;&#23427;&#20204;&#22312;&#37096;&#38376;&#20043;&#38388;&#30340;&#32858;&#31867;&#20542;&#21521;&#12290;&#22914;&#39044;&#26399;&#30340;&#37027;&#26679;&#65292;&#20998;&#26512;&#25351;&#20986;&#20102;&#21046;&#36896;&#19994;&#26159;&#20013;&#22269;&#30340;&#20013;&#24515;&#37096;&#38376;&#65292;&#32780;&#26085;&#26412;&#26356;&#38738;&#30544;&#26381;&#21153;&#19994;&#12290;&#28982;&#32780;&#65292;&#22312;&#26356;&#20855;&#20307;&#30340;&#37096;&#38376;&#23618;&#38754;&#19978;&#65292;&#20004;&#22269;&#37117;&#21576;&#29616;&#20986;&#19981;&#21516;&#30340;&#32467;&#26500;&#28436;&#21464;&#12290;&#22312;&#20013;&#22269;&#21644;&#26085;&#26412;&#30340;&#37096;&#38376;&#31038;&#21306;&#26041;&#38754;&#65292;&#23384;&#22312;&#30528;&#19981;&#21516;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15620v1 Announce Type: cross  Abstract: Economic structure comparisons between China and Japan have long captivated development economists. To delve deeper into their sectoral differences from 1995 to 2018, we used the annual input-output tables (IOTs) of both nations to construct weighted and directed input-output networks (IONs). This facilitated deeper network analyses. Strength distributions underscored variations in inter-sector economic interactions. Weighted, directed assortativity coefficients encapsulated the homophily among connecting sectors' features. By adjusting emphasis in PageRank centrality, key sectors were identified. Community detection revealed their clustering tendencies among the sectors. As anticipated, the analysis pinpointed manufacturing as China's central sector, while Japan favored services. Yet, at a finer level of the specific sectors, both nations exhibited varied structural evolutions. Contrastingly, sectoral communities in both China and Jap
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#19987;&#27880;&#25237;&#36164;&#31574;&#30053;&#30340;&#25968;&#23398;&#27169;&#22411;&#21644;&#24037;&#20855;&#65292;&#20854;&#22522;&#20110;&#24191;&#20041;&#20975;&#21033;&#20934;&#21017;&#65292;&#20026;&#27599;&#20010;&#25237;&#36164;&#26631;&#30340;&#35745;&#31639;&#20102;&#36164;&#26412;&#30340;&#26368;&#20248;&#20998;&#37197;&#65292;&#24182;&#25552;&#20379;&#20102;&#30830;&#20445;&#19981;&#20570;&#31354;&#12289;&#38480;&#21046;&#26464;&#26438;&#20351;&#29992;&#31561;&#32422;&#26463;&#26465;&#20214;&#12290;</title><link>https://arxiv.org/abs/2402.15588</link><description>&lt;p&gt;
&#19987;&#27880;&#25237;&#36164;&#32452;&#21512;&#20013;&#30340;&#19979;&#27880;&#35268;&#27169;
&lt;/p&gt;
&lt;p&gt;
Sizing the bets in a focused portfolio
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15588
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#19987;&#27880;&#25237;&#36164;&#31574;&#30053;&#30340;&#25968;&#23398;&#27169;&#22411;&#21644;&#24037;&#20855;&#65292;&#20854;&#22522;&#20110;&#24191;&#20041;&#20975;&#21033;&#20934;&#21017;&#65292;&#20026;&#27599;&#20010;&#25237;&#36164;&#26631;&#30340;&#35745;&#31639;&#20102;&#36164;&#26412;&#30340;&#26368;&#20248;&#20998;&#37197;&#65292;&#24182;&#25552;&#20379;&#20102;&#30830;&#20445;&#19981;&#20570;&#31354;&#12289;&#38480;&#21046;&#26464;&#26438;&#20351;&#29992;&#31561;&#32422;&#26463;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#31181;&#25968;&#23398;&#27169;&#22411;&#21644;&#24037;&#20855;&#65292;&#29992;&#20110;&#19987;&#27880;&#25237;&#36164;&#31574;&#30053;&#65292;&#27491;&#22914;&#24052;&#33778;&#29305;&#12289;&#33426;&#26684;&#21644;&#20854;&#20182;&#25237;&#36164;&#31038;&#21306;&#25104;&#21592;&#25152;&#25552;&#20513;&#30340;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#20551;&#23450;&#25237;&#36164;&#32773;&#30340;&#35282;&#33394;&#26159;&#32771;&#34385;&#19968;&#32452;&#20225;&#19994;&#19981;&#21516;&#32467;&#26524;&#30340;&#27010;&#29575;&#12290;&#22522;&#20110;&#36825;&#20123;&#20551;&#35774;&#65292;&#35813;&#24037;&#20855;&#35745;&#31639;&#20102;&#27599;&#20010;&#25237;&#36164;&#20505;&#36873;&#26631;&#30340;&#30340;&#36164;&#26412;&#26368;&#20248;&#20998;&#37197;&#12290;&#35813;&#27169;&#22411;&#22522;&#20110;&#19968;&#31181;&#24191;&#20041;&#20975;&#21033;&#20934;&#21017;&#65292;&#24182;&#25552;&#20379;&#36873;&#39033;&#20197;&#25552;&#20379;&#30830;&#20445;&#30340;&#32422;&#26463;&#26465;&#20214;&#65306;&#19981;&#20570;&#31354;&#12289;&#38480;&#21046;&#26464;&#26438;&#20351;&#29992;&#12289;&#25552;&#20379;&#36164;&#26412;&#27704;&#20037;&#25439;&#22833;&#39118;&#38505;&#30340;&#26368;&#22823;&#38480;&#21046;&#21644;&#26368;&#22823;&#20010;&#20154;&#20998;&#37197;&#12290;&#35813;&#36719;&#20214;&#24212;&#29992;&#20110;&#19968;&#20010;&#31034;&#20363;&#25237;&#36164;&#32452;&#21512;&#65292;&#20174;&#20013;&#33719;&#24471;&#20102;&#20851;&#20110;&#36807;&#24230;&#20998;&#25955;&#30340;&#26576;&#20123;&#35266;&#23519;&#12290;&#27492;&#22806;&#65292;&#35813;&#36719;&#20214;&#24050;&#32463;&#21487;&#20379;&#20844;&#20247;&#20351;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15588v1 Announce Type: new  Abstract: The paper provides a mathematical model and a tool for the focused investing strategy as advocated by Buffett, Munger, and others from this investment community. The approach presented here assumes that the investor's role is to think about probabilities of different outcomes for a set of businesses. Based on these assumptions, the tool calculates the optimal allocation of capital for each of the investment candidates. The model is based on a generalized Kelly Criterion with options to provide constraints that ensure: no shorting, limited use of leverage, providing a maximum limit to the risk of permanent loss of capital, and maximum individual allocation. The software is applied to an example portfolio from which certain observations about excessive diversification are obtained. In addition, the software is made available for public use.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#26465;&#20214;&#22810;&#27169;&#24577;&#21028;&#21035;&#65288;CMMD&#65289;&#27169;&#22411;&#65292;&#36890;&#36807;&#23398;&#20064;&#22810;&#27169;&#24577;&#34920;&#31034;&#26469;&#39044;&#27979;&#30772;&#20135;&#39118;&#38505;&#65292;&#24357;&#34917;&#20102;&#20256;&#32479;&#30772;&#20135;&#27169;&#22411;&#20013;&#32570;&#23569;MDA&#25991;&#26412;&#25968;&#25454;&#30340;&#38480;&#21046;&#12290;</title><link>https://arxiv.org/abs/2211.08405</link><description>&lt;p&gt;
&#21033;&#29992;&#25991;&#26412;&#25968;&#25454;&#36827;&#34892;&#30772;&#20135;&#39044;&#27979;&#30340;&#22810;&#27169;&#24577;&#29983;&#25104;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Multimodal Generative Models for Bankruptcy Prediction Using Textual Data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2211.08405
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#26465;&#20214;&#22810;&#27169;&#24577;&#21028;&#21035;&#65288;CMMD&#65289;&#27169;&#22411;&#65292;&#36890;&#36807;&#23398;&#20064;&#22810;&#27169;&#24577;&#34920;&#31034;&#26469;&#39044;&#27979;&#30772;&#20135;&#39118;&#38505;&#65292;&#24357;&#34917;&#20102;&#20256;&#32479;&#30772;&#20135;&#27169;&#22411;&#20013;&#32570;&#23569;MDA&#25991;&#26412;&#25968;&#25454;&#30340;&#38480;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26469;&#33258;&#36130;&#21153;&#25253;&#21578;&#30340;&#25991;&#26412;&#25968;&#25454;&#65292;&#20363;&#22914;10-K&#34920;&#20013;&#30340;&#8220;&#31649;&#29702;&#35752;&#35770;&#19982;&#20998;&#26512;&#8221;&#65288;MDA&#65289;&#37096;&#20998;&#65292;&#24050;&#34987;&#29992;&#20110;&#25552;&#39640;&#30772;&#20135;&#27169;&#22411;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#12290;&#28982;&#32780;&#65292;&#22312;&#23454;&#36341;&#20013;&#65292;&#25105;&#20204;&#26080;&#27861;&#20026;&#25152;&#26377;&#19978;&#24066;&#20844;&#21496;&#33719;&#21462;MDA&#37096;&#20998;&#65292;&#36825;&#38480;&#21046;&#20102;MDA&#25968;&#25454;&#22312;&#20256;&#32479;&#30772;&#20135;&#27169;&#22411;&#20013;&#30340;&#20351;&#29992;&#65292;&#22240;&#20026;&#23427;&#20204;&#38656;&#35201;&#23436;&#25972;&#25968;&#25454;&#26469;&#36827;&#34892;&#39044;&#27979;&#12290;&#32570;&#23569;MDA&#25968;&#25454;&#30340;&#20004;&#20010;&#20027;&#35201;&#21407;&#22240;&#26159;&#65306;&#65288;i&#65289;&#24182;&#38750;&#25152;&#26377;&#20844;&#21496;&#37117;&#26377;&#20041;&#21153;&#25552;&#20132;MDA&#65292;&#65288;ii&#65289;&#24403;&#29228;&#21462;&#21644;&#25235;&#21462;MDA&#37096;&#20998;&#26102;&#20250;&#20986;&#29616;&#25216;&#26415;&#38382;&#39064;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#19968;&#38480;&#21046;&#65292;&#35813;&#30740;&#31350;&#24341;&#20837;&#20102;&#26465;&#20214;&#22810;&#27169;&#24577;&#21028;&#21035;&#65288;CMMD&#65289;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#23398;&#20064;&#22810;&#27169;&#24577;&#34920;&#31034;&#65292;&#23884;&#20837;&#20102;&#20250;&#35745;&#12289;&#24066;&#22330;&#21644;&#25991;&#26412;&#25968;&#25454;&#27169;&#24577;&#30340;&#20449;&#24687;&#12290;CMMD&#27169;&#22411;&#38656;&#35201;&#19968;&#32452;&#25152;&#26377;&#25968;&#25454;&#27169;&#24577;&#36827;&#34892;&#27169;&#22411;&#35757;&#32451;&#12290;&#22312;&#27979;&#35797;&#26102;&#65292;CMMD&#27169;&#22411;&#21482;&#38656;&#35201;&#35775;&#38382;&#20250;&#35745;&#21644;&#24066;&#22330;&#27169;&#24577;&#26469;&#29983;&#25104;
&lt;/p&gt;
&lt;p&gt;
arXiv:2211.08405v5 Announce Type: replace-cross  Abstract: Textual data from financial filings, e.g., the Management's Discussion &amp; Analysis (MDA) section in Form 10-K, has been used to improve the prediction accuracy of bankruptcy models. In practice, however, we cannot obtain the MDA section for all public companies, which limits the use of MDA data in traditional bankruptcy models, as they need complete data to make predictions. The two main reasons for the lack of MDA are: (i) not all companies are obliged to submit the MDA and (ii) technical problems arise when crawling and scrapping the MDA section. To solve this limitation, this research introduces the Conditional Multimodal Discriminative (CMMD) model that learns multimodal representations that embed information from accounting, market, and textual data modalities. The CMMD model needs a sample with all data modalities for model training. At test time, the CMMD model only needs access to accounting and market modalities to gene
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#30340;&#26041;&#27861;&#65292;&#33021;&#22815;&#35782;&#21035;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#31283;&#20581;&#32479;&#35745;&#22871;&#21033;&#31574;&#30053;&#65292;&#26080;&#38656;&#20381;&#36182;&#36164;&#20135;&#21327;&#25972;&#23545;&#30340;&#35782;&#21035;&#65292;&#21487;&#22312;&#39640;&#32500;&#37329;&#34701;&#24066;&#22330;&#20013;&#23454;&#29616;&#30408;&#21033;&#20132;&#26131;&#12290;</title><link>https://arxiv.org/abs/2203.03179</link><description>&lt;p&gt;
&#29992;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#26816;&#27979;&#25968;&#25454;&#39537;&#21160;&#30340;&#31283;&#20581;&#32479;&#35745;&#22871;&#21033;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Detecting data-driven robust statistical arbitrage strategies with deep neural networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2203.03179
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#30340;&#26041;&#27861;&#65292;&#33021;&#22815;&#35782;&#21035;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#31283;&#20581;&#32479;&#35745;&#22871;&#21033;&#31574;&#30053;&#65292;&#26080;&#38656;&#20381;&#36182;&#36164;&#20135;&#21327;&#25972;&#23545;&#30340;&#35782;&#21035;&#65292;&#21487;&#22312;&#39640;&#32500;&#37329;&#34701;&#24066;&#22330;&#20013;&#23454;&#29616;&#30408;&#21033;&#20132;&#26131;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#37329;&#34701;&#24066;&#22330;&#20013;&#35782;&#21035;&#20986;&#31283;&#20581;&#30340;&#32479;&#35745;&#22871;&#21033;&#31574;&#30053;&#12290;&#31283;&#20581;&#30340;&#32479;&#35745;&#22871;&#21033;&#31574;&#30053;&#25351;&#30340;&#26159;&#22312;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#23454;&#29616;&#30408;&#21033;&#20132;&#26131;&#30340;&#20132;&#26131;&#31574;&#30053;&#12290;&#36825;&#19968;&#21019;&#26032;&#26041;&#27861;&#20801;&#35768;&#21516;&#26102;&#32771;&#34385;&#22823;&#37327;&#22522;&#30784;&#35777;&#21048;&#65292;&#24182;&#19981;&#20381;&#36182;&#20110;&#36164;&#20135;&#21327;&#25972;&#23545;&#30340;&#35782;&#21035;&#65292;&#22240;&#27492;&#36866;&#29992;&#20110;&#39640;&#32500;&#37329;&#34701;&#24066;&#22330;&#25110;&#22312;&#20256;&#32479;&#23545;&#20914;&#20132;&#26131;&#26041;&#27861;&#22833;&#36133;&#30340;&#24066;&#22330;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#20174;&#35266;&#23519;&#24066;&#22330;&#25968;&#25454;&#20013;&#24471;&#21040;&#30340;&#21487;&#23481;&#35768;&#27010;&#29575;&#27979;&#24230;&#30340;&#27169;&#31946;&#38598;&#26500;&#24314;&#26041;&#27861;&#12290;&#22240;&#27492;&#65292;&#35813;&#26041;&#27861;&#21487;&#34987;&#35748;&#20026;&#26159;&#26080;&#27169;&#22411;&#19988;&#23436;&#20840;&#25968;&#25454;&#39537;&#21160;&#30340;&#12290;&#25105;&#20204;&#36890;&#36807;&#25552;&#20379;&#20855;&#26377;&#39640;&#30408;&#21033;&#20132;&#26131;&#34920;&#29616;&#30340;&#23454;&#35777;&#30740;&#31350;&#23637;&#31034;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#36866;&#29992;&#24615;&#65292;&#29978;&#33267;&#22312;50&#32500;&#24230;&#30340;&#24773;&#20917;&#19979;&#20063;&#34920;&#29616;&#20986;&#33394;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2203.03179v4 Announce Type: replace-cross  Abstract: We present an approach, based on deep neural networks, that allows identifying robust statistical arbitrage strategies in financial markets. Robust statistical arbitrage strategies refer to trading strategies that enable profitable trading under model ambiguity. The presented novel methodology allows to consider a large amount of underlying securities simultaneously and does not depend on the identification of cointegrated pairs of assets, hence it is applicable on high-dimensional financial markets or in markets where classical pairs trading approaches fail. Moreover, we provide a method to build an ambiguity set of admissible probability measures that can be derived from observed market data. Thus, the approach can be considered as being model-free and entirely data-driven. We showcase the applicability of our method by providing empirical investigations with highly profitable trading performances even in 50 dimensions, durin
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#20215;&#26684;&#33258;&#30456;&#20851;&#24615;&#65292;&#21457;&#29616;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#25104;&#20132;&#37327;&#30340;&#38543;&#26426;&#24615;&#23545;&#20215;&#26684;&#30340;&#32479;&#35745;&#26102;&#21051;&#21644;&#33258;&#30456;&#20851;&#24615;&#26377;&#24433;&#21709;&#65292;&#24182;&#25552;&#20986;&#20102;&#26032;&#30340;&#35780;&#20272;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2202.09323</link><description>&lt;p&gt;
&#22522;&#20110;&#24066;&#22330;&#30340;&#20215;&#26684;&#33258;&#30456;&#20851;&#24615;
&lt;/p&gt;
&lt;p&gt;
Market-Based Price Autocorrelation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2202.09323
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#20215;&#26684;&#33258;&#30456;&#20851;&#24615;&#65292;&#21457;&#29616;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#25104;&#20132;&#37327;&#30340;&#38543;&#26426;&#24615;&#23545;&#20215;&#26684;&#30340;&#32479;&#35745;&#26102;&#21051;&#21644;&#33258;&#30456;&#20851;&#24615;&#26377;&#24433;&#21709;&#65292;&#24182;&#25552;&#20986;&#20102;&#26032;&#30340;&#35780;&#20272;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20551;&#35774;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#25104;&#20132;&#37327;&#30340;&#38543;&#26426;&#24615;&#20915;&#23450;&#20102;&#38543;&#26426;&#24066;&#22330;&#20215;&#26684;&#30340;&#23646;&#24615;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#31532;&#19968;&#21644;&#31532;&#20108;&#20215;&#26684;&#32479;&#35745;&#26102;&#21051;&#20197;&#21450;&#20215;&#26684;&#27874;&#21160;&#29575;&#23545;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#25104;&#20132;&#37327;&#30340;&#32479;&#35745;&#26102;&#21051;&#12289;&#27874;&#21160;&#29575;&#20197;&#21450;&#30456;&#20851;&#24615;&#30340;&#30452;&#25509;&#20381;&#36182;&#20851;&#31995;&#12290;&#36825;&#26377;&#21161;&#20110;&#25551;&#36848;&#22522;&#20110;&#24066;&#22330;&#30340;&#20215;&#26684;&#22312;t&#26102;&#21051;&#21644;t-{\tau}&#26102;&#21051;&#20043;&#38388;&#30340;&#33258;&#30456;&#20851;&#24615;&#20381;&#36182;&#20110;&#20132;&#26131;&#20215;&#20540;&#21644;&#25104;&#20132;&#37327;&#20043;&#38388;&#30340;&#32479;&#35745;&#26102;&#21051;&#21644;&#30456;&#20851;&#24615;&#12290;&#36825;&#31361;&#26174;&#20102;&#24066;&#22330;&#20132;&#26131;&#35268;&#27169;&#30340;&#38543;&#26426;&#24615;&#23545;&#20215;&#26684;&#32479;&#35745;&#26102;&#21051;&#21644;&#33258;&#30456;&#20851;&#24615;&#30340;&#24433;&#21709;&#12290;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#25104;&#20132;&#37327;&#30340;&#32479;&#35745;&#26102;&#21051;&#21644;&#30456;&#20851;&#24615;&#26159;&#36890;&#36807;&#20256;&#32479;&#22522;&#20110;&#39057;&#29575;&#30340;&#27010;&#29575;&#35780;&#20272;&#30340;&#12290;&#22522;&#20110;&#24066;&#22330;&#30340;&#20215;&#26684;&#33258;&#30456;&#20851;&#24615;&#21644;&#36890;&#36807;&#20215;&#26684;&#26102;&#38388;&#24207;&#21015;&#30340;&#22522;&#20110;&#39057;&#29575;&#27010;&#29575;&#20998;&#26512;&#35780;&#20272;&#30340;&#33258;&#30456;&#20851;&#24615;&#20043;&#38388;&#30340;&#21306;&#21035;&#25581;&#31034;&#20102;&#23545;&#24066;&#22330;&#33258;&#30456;&#20851;&#24615;&#30340;&#19981;&#21516;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2202.09323v2 Announce Type: replace  Abstract: This paper assumes that the randomness of market trade values and volumes determines the properties of stochastic market prices. We derive the direct dependence of the first two price statistical moments and price volatility on statistical moments, volatilities, and correlations of market trade values and volumes. That helps describe the dependence of market-based price autocorrelation between times t and t-{\tau} on statistical moments and correlations between trade values and volumes. That highlights the impact of the randomness of the size of market deals on price statistical moments and autocorrelation. Statistical moments and correlations of market trade values and volumes are assessed by conventional frequency-based probabilities. The distinctions between market-based price autocorrelation and autocorrelation that are assessed by the frequency-based probability analysis of price time series reveal the different approaches to th
&lt;/p&gt;</description></item><item><title>&#24341;&#20837;&#24369;&#22823;&#25439;&#22833;&#25935;&#24863;&#24615;&#20844;&#29702;&#30830;&#20445;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#30340;&#23384;&#22312;&#65292;&#32473;&#20986;&#20102;&#65288;&#24378;&#65289;$\rho$-&#21095;&#26412;&#30340;&#29305;&#24449;&#65292;&#21033;&#29992;&#26465;&#20214;&#25512;&#23548;&#20102;&#22806;&#37096;&#37329;&#34701;&#21512;&#21516;&#30340;&#65288;&#24378;&#65289;$\rho$-&#19968;&#33268;&#20215;&#26684;&#21306;&#38388;&#12290;</title><link>https://arxiv.org/abs/2202.07610</link><description>&lt;p&gt;
$\rho$-&#21095;&#26412;&#21644;&#26143;&#24418;&#39118;&#38505;&#24230;&#37327;&#30340;$\rho$-&#19968;&#33268;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
$\rho$-arbitrage and $\rho$-consistent pricing for star-shaped risk measures
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2202.07610
&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#24369;&#22823;&#25439;&#22833;&#25935;&#24863;&#24615;&#20844;&#29702;&#30830;&#20445;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#30340;&#23384;&#22312;&#65292;&#32473;&#20986;&#20102;&#65288;&#24378;&#65289;$\rho$-&#21095;&#26412;&#30340;&#29305;&#24449;&#65292;&#21033;&#29992;&#26465;&#20214;&#25512;&#23548;&#20102;&#22806;&#37096;&#37329;&#34701;&#21512;&#21516;&#30340;&#65288;&#24378;&#65289;$\rho$-&#19968;&#33268;&#20215;&#26684;&#21306;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#19968;&#20010;&#26399;&#38480;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#22343;&#20540;-&#39118;&#38505;&#32452;&#21512;&#36873;&#25321;&#38382;&#39064;&#65292;&#20854;&#20013;&#39118;&#38505;&#30001;&#26143;&#24418;&#39118;&#38505;&#24230;&#37327;$\rho$&#37327;&#21270;&#12290;&#25105;&#20204;&#20570;&#20986;&#20102;&#19977;&#28857;&#36129;&#29486;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#24369;&#22823;&#25439;&#22833;&#25935;&#24863;&#24615;&#30340;&#26032;&#20844;&#29702;&#65292;&#24182;&#23637;&#31034;&#20102;&#23427;&#26159;&#30830;&#20445;&#26368;&#20248;&#32452;&#21512;&#23384;&#22312;&#30340;&#20851;&#38190;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#32473;&#20986;&#20102;&#65288;&#24378;&#65289;$\rho$-&#21095;&#26412;&#30340;&#21407;&#22987;&#21644;&#23545;&#20598;&#29305;&#24449;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#21033;&#29992;&#19981;&#23384;&#22312;&#65288;&#24378;&#65289;$\rho$-&#21095;&#26412;&#30340;&#26465;&#20214;&#65292;&#26126;&#30830;&#25512;&#23548;&#20102;&#19968;&#20010;&#22806;&#37096;&#37329;&#34701;&#21512;&#21516;&#30340;&#65288;&#24378;&#65289;$\rho$-&#19968;&#33268;&#20215;&#26684;&#21306;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2202.07610v2 Announce Type: replace  Abstract: This paper revisits mean-risk portfolio selection in a one-period financial market, where risk is quantified by a star-shaped risk measure $\rho$. We make three contributions. First, we introduce the new axiom of weak sensitivity to large losses and show that it is key to ensure the existence of optimal portfolios. Second, we give primal and dual characterisations of (strong) $\rho$-arbitrage. Finally, we use our conditions for the absence of (strong) $\rho$-arbitrage to explicitly derive the (strong) $\rho$-consistent price interval for an external financial contract.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#20869;&#24149;&#20132;&#26131;&#32773;&#19982;&#33021;&#22815;&#39044;&#27979;&#20854;&#35746;&#21333;&#30340;&#39640;&#39057;&#20132;&#26131;&#32773;&#20043;&#38388;&#30340;&#20114;&#21160;&#65292;&#21457;&#29616;&#39640;&#39057;&#20132;&#26131;&#32773;&#30340;&#31574;&#30053;&#19982;&#24211;&#23384;&#21388;&#24694;&#12289;&#39044;&#27979;&#20934;&#30830;&#24615;&#21644;&#24066;&#22330;&#27963;&#36291;&#24230;&#26377;&#20851;&#65292;&#32780;&#20854;&#34892;&#20026;&#23545;&#22823;&#20132;&#26131;&#32773;&#26377;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2304.13985</link><description>&lt;p&gt;
&#39640;&#39057;&#39044;&#27979;&#20132;&#26131;&#21450;&#20854;&#24433;&#21709;&#65306;&#23567;&#20869;&#24149;&#20132;&#26131;&#32773;&#23545;&#21387;&#36724;&#32773;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
High-frequency Anticipatory Trading and Its Influences: Small Informed Trader vs. Front-runner. (arXiv:2304.13985v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.13985
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#20869;&#24149;&#20132;&#26131;&#32773;&#19982;&#33021;&#22815;&#39044;&#27979;&#20854;&#35746;&#21333;&#30340;&#39640;&#39057;&#20132;&#26131;&#32773;&#20043;&#38388;&#30340;&#20114;&#21160;&#65292;&#21457;&#29616;&#39640;&#39057;&#20132;&#26131;&#32773;&#30340;&#31574;&#30053;&#19982;&#24211;&#23384;&#21388;&#24694;&#12289;&#39044;&#27979;&#20934;&#30830;&#24615;&#21644;&#24066;&#22330;&#27963;&#36291;&#24230;&#26377;&#20851;&#65292;&#32780;&#20854;&#34892;&#20026;&#23545;&#22823;&#20132;&#26131;&#32773;&#26377;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#20869;&#24149;&#20132;&#26131;&#32773;(IT)&#19982;&#33021;&#22815;&#39044;&#27979;&#21069;&#32773;&#21363;&#23558;&#21040;&#26469;&#35746;&#21333;&#30340;&#39640;&#39057;&#20132;&#26131;&#32773;(HFT)&#22312;&#25193;&#23637;&#30340;Kyle(1985)&#27169;&#22411;&#19979;&#30340;&#20114;&#21160;&#12290;&#35752;&#35770;&#20102;&#19981;&#21516;&#24773;&#20917;&#19979;&#30340;&#22343;&#34913;&#12290;&#20381;&#38752;&#36895;&#24230;&#20248;&#21183;&#65292;HFT&#24635;&#26159;&#25552;&#21069;&#21644;&#22823;&#21333;&#20132;&#26131;&#21516;&#21521;&#12290;&#28982;&#32780;&#65292;&#22905;&#26159;&#21542;&#25552;&#20379;&#27969;&#21160;&#24615;&#21462;&#20915;&#20110;&#22905;&#30340;&#24211;&#23384;&#21388;&#24694;&#12289;&#39044;&#27979;&#20934;&#30830;&#24615;&#21644;&#24066;&#22330;&#27963;&#36291;&#24230;&#12290;&#22905;&#21487;&#33021;&#20250;&#22238;&#39304;&#27969;&#21160;&#24615;(&#20805;&#24403;&#21387;&#36724;&#32773;)&#25110;&#32487;&#32493;&#24102;&#36208;&#27969;&#21160;&#24615;(&#27492;&#26102;&#25105;&#20204;&#31216;&#22905;&#20026;&#23567;IT)&#12290;&#23567;IT&#24635;&#26159;&#20260;&#23475;&#22823;&#20132;&#26131;&#32773;&#65292;&#32780;&#21387;&#36724;&#32773;&#21487;&#33021;&#20351;&#22905;&#21463;&#30410;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#24778;&#22855;&#22320;&#21457;&#29616;(1)&#22686;&#21152;HFT&#20449;&#21495;&#20013;&#30340;&#22122;&#22768;&#23454;&#38469;&#19978;&#21487;&#33021;&#20250;&#38477;&#20302;IT&#30340;&#21033;&#28070;;(2)&#23613;&#31649;&#25552;&#20379;&#27969;&#21160;&#24615;&#65292;&#21387;&#36724;&#32773;&#21487;&#33021;&#27604;&#23567;&#20869;&#24149;&#20132;&#26131;&#32773;&#26356;&#21152;&#20260;&#23475;IT&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, the interactions between a large informed trader (IT, for short) and a high-frequency trader (HFT, for short) who can anticipate the former's incoming order are studied in an extended Kyle's (1985) model. Equilibria under various specific situations are discussed. Relying on the speed advantage, HFT always trades in the same direction as the large order in advance. However, whether or not she provides liquidity depends on her inventory aversion, the prediction accuracy, and the market activeness. She may supply liquidity back (act as a front-runner) or continue to take it away (in this case we call her a small IT). Small IT always harms the large trader while front-runner may benefit her. Besides, we find surprisingly that (1) increasing the noise in HFT's signal may in fact decrease IT's profit; (2) although providing liquidity, a front-runner may harm IT more than a small IT.
&lt;/p&gt;</description></item></channel></rss>