<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#35770;&#25991;&#21033;&#29992;&#26426;&#22120;&#23398;&#20064;&#35299;&#20915;&#23398;&#26657;&#29677;&#32423;&#20998;&#37197;&#38382;&#39064;&#65292;&#36890;&#36807;&#21451;&#35850;&#39044;&#27979;&#12289;&#21516;&#20394;&#24433;&#21709;&#20272;&#35745;&#21644;&#29677;&#32423;&#20998;&#37197;&#20248;&#21270;&#65292;&#21457;&#29616;&#23558;&#23398;&#29983;&#20998;&#25104;&#26377;&#24615;&#21035;&#29305;&#24449;&#30340;&#29677;&#32423;&#33021;&#22815;&#25552;&#39640;&#24179;&#22343;&#21516;&#20394;&#24433;&#21709;&#65292;&#24182;&#19988;&#26497;&#31471;&#28151;&#21512;&#30340;&#29677;&#32423;&#20998;&#37197;&#26041;&#27861;&#21487;&#20197;&#25913;&#21892;&#24213;&#37096;&#22235;&#20998;&#20043;&#19968;&#23398;&#29983;&#30340;&#21516;&#20394;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2404.02497</link><description>&lt;p&gt;
&#29992;&#26426;&#22120;&#23398;&#20064;&#25552;&#21319;&#25945;&#32946;&#25104;&#26524;&#65306;&#24314;&#27169;&#21451;&#35850;&#24418;&#25104;&#65292;&#34913;&#37327;&#21516;&#20394;&#24433;&#21709;&#21644;&#20248;&#21270;&#29677;&#32423;&#20998;&#37197;
&lt;/p&gt;
&lt;p&gt;
Enhancing Educational Outcome with Machine Learning: Modeling Friendship Formation, Measuring Peer Effect and Optimizing Class Assignment
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02497
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#21033;&#29992;&#26426;&#22120;&#23398;&#20064;&#35299;&#20915;&#23398;&#26657;&#29677;&#32423;&#20998;&#37197;&#38382;&#39064;&#65292;&#36890;&#36807;&#21451;&#35850;&#39044;&#27979;&#12289;&#21516;&#20394;&#24433;&#21709;&#20272;&#35745;&#21644;&#29677;&#32423;&#20998;&#37197;&#20248;&#21270;&#65292;&#21457;&#29616;&#23558;&#23398;&#29983;&#20998;&#25104;&#26377;&#24615;&#21035;&#29305;&#24449;&#30340;&#29677;&#32423;&#33021;&#22815;&#25552;&#39640;&#24179;&#22343;&#21516;&#20394;&#24433;&#21709;&#65292;&#24182;&#19988;&#26497;&#31471;&#28151;&#21512;&#30340;&#29677;&#32423;&#20998;&#37197;&#26041;&#27861;&#21487;&#20197;&#25913;&#21892;&#24213;&#37096;&#22235;&#20998;&#20043;&#19968;&#23398;&#29983;&#30340;&#21516;&#20394;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#23398;&#26657;&#26657;&#38271;&#30340;&#29677;&#32423;&#20998;&#37197;&#38382;&#39064;&#12290;&#25105;&#20204;&#23558;&#38382;&#39064;&#20998;&#20026;&#19977;&#20010;&#38454;&#27573;&#65306;&#21451;&#35850;&#39044;&#27979;&#12289;&#21516;&#20394;&#24433;&#21709;&#35780;&#20272;&#21644;&#29677;&#32423;&#20998;&#37197;&#20248;&#21270;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#20010;&#24494;&#35266;&#22522;&#30784;&#27169;&#22411;&#26469;&#27169;&#25311;&#21451;&#35850;&#24418;&#25104;&#65292;&#24182;&#23558;&#35813;&#27169;&#22411;&#36924;&#36817;&#20026;&#19968;&#20010;&#31070;&#32463;&#32593;&#32476;&#12290;&#21033;&#29992;&#39044;&#27979;&#30340;&#21451;&#35850;&#27010;&#29575;&#37051;&#25509;&#30697;&#38453;&#65292;&#25105;&#20204;&#25913;&#36827;&#20102;&#20256;&#32479;&#30340;&#32447;&#24615;&#22343;&#20540;&#27169;&#22411;&#24182;&#20272;&#35745;&#20102;&#21516;&#20394;&#24433;&#21709;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24037;&#20855;&#20197;&#35299;&#20915;&#21451;&#35850;&#36873;&#25321;&#30340;&#20869;&#29983;&#24615;&#38382;&#39064;&#12290;&#20272;&#35745;&#30340;&#21516;&#20394;&#24433;&#21709;&#30053;&#22823;&#20110;&#32447;&#24615;&#22343;&#20540;&#27169;&#22411;&#30340;&#20272;&#35745;&#12290;&#21033;&#29992;&#21451;&#35850;&#39044;&#27979;&#21644;&#21516;&#20394;&#24433;&#21709;&#20272;&#35745;&#32467;&#26524;&#65292;&#25105;&#20204;&#27169;&#25311;&#20102;&#25152;&#26377;&#23398;&#29983;&#30340;&#21453;&#20107;&#23454;&#21516;&#20394;&#24433;&#21709;&#12290;&#25105;&#20204;&#21457;&#29616;&#23558;&#23398;&#29983;&#20998;&#25104;&#26377;&#24615;&#21035;&#29305;&#24449;&#30340;&#29677;&#32423;&#21487;&#20197;&#23558;&#24179;&#22343;&#21516;&#20394;&#24433;&#21709;&#25552;&#39640;0.02&#20998;&#65288;&#22312;5&#20998;&#21046;&#20013;&#65289;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#26497;&#31471;&#28151;&#21512;&#30340;&#29677;&#32423;&#20998;&#37197;&#26041;&#27861;&#21487;&#20197;&#25552;&#39640;&#24213;&#37096;&#22235;&#20998;&#20043;&#19968;&#23398;&#29983;&#30340;&#21516;&#20394;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02497v1 Announce Type: new  Abstract: In this paper, we look at a school principal's class assignment problem. We break the problem into three stages (1) friendship prediction (2) peer effect estimation (3) class assignment optimization. We build a micro-founded model for friendship formation and approximate the model as a neural network. Leveraging on the predicted friendship probability adjacent matrix, we improve the traditional linear-in-means model and estimate peer effect. We propose a new instrument to address the friendship selection endogeneity. The estimated peer effect is slightly larger than the linear-in-means model estimate. Using the friendship prediction and peer effect estimation results, we simulate counterfactual peer effects for all students. We find that dividing students into gendered classrooms increases average peer effect by 0.02 point on a scale of 5. We also find that extreme mixing class assignment method improves bottom quartile students' peer ef
&lt;/p&gt;</description></item><item><title>GPT&#36890;&#36807;&#37329;&#34701;&#32032;&#20859;&#27979;&#35797;&#26174;&#31034;&#20986;&#20855;&#22791;&#25104;&#20026;&#22823;&#20247;&#37329;&#34701;&#26426;&#22120;&#39038;&#38382;&#30340;&#33021;&#21147;&#65292;&#20854;&#20013;&#22522;&#20110;GPT-4&#30340;ChatGPT&#20960;&#20046;&#23436;&#32654;&#22320;&#24471;&#20998;99%&#65292;&#25581;&#31034;&#20102;&#37329;&#34701;&#32032;&#20859;&#27491;&#22312;&#25104;&#20026;&#26368;&#20808;&#36827;&#27169;&#22411;&#30340;&#26032;&#20852;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2309.00649</link><description>&lt;p&gt;
GPT&#24050;&#32463;&#20855;&#22791;&#20102;&#37329;&#34701;&#32032;&#20859;&#65306;&#26469;&#33258;GPT&#37329;&#34701;&#32032;&#20859;&#27979;&#35797;&#30340;&#35265;&#35299;&#20197;&#21450;&#20154;&#20204;&#20351;&#29992;&#20854;&#20316;&#20026;&#21672;&#35810;&#26469;&#28304;&#30340;&#21021;&#27493;&#27979;&#35797;
&lt;/p&gt;
&lt;p&gt;
GPT has become financially literate: Insights from financial literacy tests of GPT and a preliminary test of how people use it as a source of advice. (arXiv:2309.00649v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.00649
&lt;/p&gt;
&lt;p&gt;
GPT&#36890;&#36807;&#37329;&#34701;&#32032;&#20859;&#27979;&#35797;&#26174;&#31034;&#20986;&#20855;&#22791;&#25104;&#20026;&#22823;&#20247;&#37329;&#34701;&#26426;&#22120;&#39038;&#38382;&#30340;&#33021;&#21147;&#65292;&#20854;&#20013;&#22522;&#20110;GPT-4&#30340;ChatGPT&#20960;&#20046;&#23436;&#32654;&#22320;&#24471;&#20998;99%&#65292;&#25581;&#31034;&#20102;&#37329;&#34701;&#32032;&#20859;&#27491;&#22312;&#25104;&#20026;&#26368;&#20808;&#36827;&#27169;&#22411;&#30340;&#26032;&#20852;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#20351;&#29992;&#37329;&#34701;&#32032;&#20859;&#27979;&#35797;&#65292;&#25105;&#20204;&#35780;&#20272;&#20102;GPT&#65288;&#19968;&#31181;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65289;&#20316;&#20026;&#22823;&#20247;&#37329;&#34701;&#26426;&#22120;&#39038;&#38382;&#30340;&#33021;&#21147;&#12290;&#22522;&#20110;GPT-3.5&#30340;Davinci&#21644;ChatGPT&#20998;&#21035;&#22312;&#37329;&#34701;&#32032;&#20859;&#27979;&#35797;&#20013;&#24471;&#20998;&#20026;66%&#21644;65%&#65292;&#32780;&#22522;&#20110;GPT-4&#30340;ChatGPT&#20960;&#20046;&#23436;&#32654;&#22320;&#24471;&#21040;&#20102;99%&#30340;&#20998;&#25968;&#65292;&#36825;&#34920;&#26126;&#37329;&#34701;&#32032;&#20859;&#27491;&#22312;&#25104;&#20026;&#26368;&#20808;&#36827;&#27169;&#22411;&#30340;&#26032;&#20852;&#33021;&#21147;&#12290;&#25105;&#20204;&#20351;&#29992;Judge-Advisor&#31995;&#32479;&#21644;&#19968;&#20010;&#20648;&#33988;&#22256;&#22659;&#26469;&#35828;&#26126;&#30740;&#31350;&#20154;&#21592;&#22914;&#20309;&#35780;&#20272;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#25552;&#20379;&#30340;&#24314;&#35758;&#21033;&#29992;&#24773;&#20917;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#20123;&#26410;&#26469;&#30740;&#31350;&#30340;&#26041;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;
We assess the ability of GPT -- a large language model -- to serve as a financial robo-advisor for the masses, by using a financial literacy test. Davinci and ChatGPT based on GPT-3.5 score 66% and 65% on the financial literacy test, respectively, compared to a baseline of 33%. However, ChatGPT based on GPT-4 achieves a near-perfect 99% score, pointing to financial literacy becoming an emergent ability of state-of-the-art models. We use the Judge-Advisor System and a savings dilemma to illustrate how researchers might assess advice-utilization from large language models. We also present a number of directions for future research.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20379;&#20102;&#38598;&#25104;&#25193;&#25955;&#24066;&#22330;&#20013;&#20851;&#20110;&#26377;&#38480;&#21046;&#39118;&#38505;&#26377;&#30028;&#21033;&#28070;&#65288;NUPBR&#65289;&#19982;&#26080;&#39118;&#38505;&#26080;&#38480;&#21046;&#21033;&#28070;&#65288;NFLVR&#65289;&#26465;&#20214;&#30340;&#31934;&#30830;&#34920;&#24449;&#65292;&#36825;&#20123;&#34920;&#24449;&#21482;&#21462;&#20915;&#20110;&#27604;&#20363;&#20989;&#25968;&#21644;&#36895;&#24230;&#27979;&#24230;&#12290;</title><link>http://arxiv.org/abs/2306.11470</link><description>&lt;p&gt;
&#38598;&#25104;&#25193;&#25955;&#24066;&#22330;&#20013; NUPBR&#12289;NFLVR &#20934;&#21017;&#19982; EMM &#23384;&#22312;&#30340;&#21028;&#25454;
&lt;/p&gt;
&lt;p&gt;
Criteria for NUPBR, NFLVR and the existence of EMMs in integrated diffusion markets. (arXiv:2306.11470v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.11470
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#38598;&#25104;&#25193;&#25955;&#24066;&#22330;&#20013;&#20851;&#20110;&#26377;&#38480;&#21046;&#39118;&#38505;&#26377;&#30028;&#21033;&#28070;&#65288;NUPBR&#65289;&#19982;&#26080;&#39118;&#38505;&#26080;&#38480;&#21046;&#21033;&#28070;&#65288;NFLVR&#65289;&#26465;&#20214;&#30340;&#31934;&#30830;&#34920;&#24449;&#65292;&#36825;&#20123;&#34920;&#24449;&#21482;&#21462;&#20915;&#20110;&#27604;&#20363;&#20989;&#25968;&#21644;&#36895;&#24230;&#27979;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#19968;&#20010;&#21333;&#19968;&#36164;&#20135;&#37329;&#34701;&#24066;&#22330;&#65292;&#20854;&#25240;&#29616;&#36164;&#20135;&#20215;&#26684;&#36807;&#31243;&#26159;&#30456;&#23545;&#20110;&#36830;&#32493;&#27491;&#21017;&#24378; Markov &#21322;&#38789;&#65288;&#21363;&#25152;&#35859;&#30340;&#19968;&#33324;&#25193;&#25955;&#21322;&#38789;&#65289;&#30340;&#38543;&#26426;&#31215;&#20998;&#65292;&#20854;&#34987;&#19968;&#20010;&#27604;&#20363;&#20989;&#25968;&#21644;&#19968;&#20010;&#36895;&#29575;&#27979;&#24230;&#21442;&#25968;&#21270;&#12290;&#22312;&#25105;&#20204;&#20043;&#21069;&#30340;&#19968;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#23545;&#20110;&#36825;&#26679;&#19968;&#20010;&#37329;&#34701;&#24066;&#22330;&#30340;&#19968;&#20010;&#20856;&#22411;&#26694;&#26550;&#30340;&#26080;&#39118;&#38505;&#26080;&#38480;&#21046;&#21033;&#28070; (NFLVR) &#26465;&#20214;&#30340;&#34920;&#24449;&#65292;&#34920;&#24449;&#26159;&#22522;&#20110;&#27604;&#20363;&#20989;&#25968;&#21644;&#36895;&#24230;&#27979;&#24230;&#30340;&#12290; Ioannis Karatzas &#22312;&#25105;&#20204;&#20010;&#20154;&#30340;&#20132;&#27969;&#20013;&#38382;&#25105;&#20204;&#26159;&#21542;&#20063;&#33021;&#22815;&#20026;&#36739;&#24369;&#30340;&#26377;&#38480;&#21046;&#39118;&#38505;&#26377;&#30028;&#21033;&#28070; (NUPBR) &#26465;&#20214;&#35777;&#26126;&#19968;&#20010;&#34920;&#24449;&#65292;&#36825;&#26159;&#25105;&#20204;&#22312;&#26412;&#25991;&#20013;&#22788;&#29702;&#30340;&#20027;&#35201;&#38382;&#39064;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#19981;&#38480;&#20110;&#26631;&#20934;&#26694;&#26550;&#65292;&#32780;&#26159;&#20801;&#35768;&#19968;&#20010;&#20445;&#30041;&#24378; Markov &#24615;&#36136;&#30340;&#19968;&#33324;&#36807;&#28388;&#22120;&#30340;&#19968;&#33324;&#35774;&#32622;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#26159; NUPBR &#21644; NFLVR &#30340;&#31934;&#30830;&#34920;&#24449;&#65292;&#36825;&#20123;&#34920;&#24449;&#20165;&#21462;&#20915;&#20110;&#27604;&#20363;&#20989;&#25968;&#21644;&#36895;&#24230;&#27979;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
Consider a single asset financial market whose discounted asset price process is a stochastic integral with respect to a continuous regular strong Markov semimartingale (a so-called general diffusion semimartingale) that is parameterized by a scale function and a speed measure. In a previous paper, we established a characterization of the no free lunch with vanishing risk (NFLVR) condition for a canonical framework of such a financial market in terms of the scale function and the speed measure. Ioannis Karatzas (personal communication) asked us whether it is also possible to prove a characterization for the weaker no unbounded profit with bounded risk (NUPBR) condition, which is the main question we treat in this paper. Here, we do not restrict our attention to canonical frameworks but we allow a general setup with a general filtration that preserves the strong Markov property. Our main results are precise characterizations of NUPBR and NFLVR which only depend on the scale function and
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#39640;&#25928;&#20984;&#22411;&#20027;&#25104;&#20998;&#20998;&#26512;&#26041;&#27861;&#65292;&#24182;&#24212;&#29992;&#20110;Wasserstein&#27979;&#22320;&#32447;&#20027;&#25104;&#20998;&#20998;&#26512;&#21644;&#25490;&#24207;&#25968;&#25454;&#12290;&#25105;&#20204;&#22312;&#29702;&#35770;&#19978;&#35777;&#26126;&#20102;&#26041;&#27861;&#30340;&#19968;&#33268;&#24615;&#12289;&#30446;&#26631;&#20989;&#25968;&#30340;&#36830;&#32493;&#24615;&#21644;&#21487;&#24494;&#24615;&#65292;&#24182;&#24320;&#21457;&#20102;&#36866;&#29992;&#20110;&#22810;&#38754;&#20307;&#20984;&#38598;&#30340;&#25968;&#20540;&#23454;&#29616;&#26041;&#27861;&#12290;&#23454;&#35777;&#30740;&#31350;&#36824;&#34920;&#26126;&#35813;&#26041;&#27861;&#22312;&#37329;&#34701;&#39046;&#22495;&#20855;&#26377;&#24191;&#27867;&#24212;&#29992;&#12290;</title><link>http://arxiv.org/abs/2211.02990</link><description>&lt;p&gt;
&#39640;&#25928;&#20984;&#22411;&#20027;&#25104;&#20998;&#20998;&#26512;&#21450;&#20854;&#22312;Wasserstein&#27979;&#22320;&#32447;&#20027;&#25104;&#20998;&#20998;&#26512;&#21644;&#25490;&#24207;&#25968;&#25454;&#19978;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Efficient Convex PCA with applications to Wasserstein geodesic PCA and ranked data. (arXiv:2211.02990v2 [stat.CO] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.02990
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#39640;&#25928;&#20984;&#22411;&#20027;&#25104;&#20998;&#20998;&#26512;&#26041;&#27861;&#65292;&#24182;&#24212;&#29992;&#20110;Wasserstein&#27979;&#22320;&#32447;&#20027;&#25104;&#20998;&#20998;&#26512;&#21644;&#25490;&#24207;&#25968;&#25454;&#12290;&#25105;&#20204;&#22312;&#29702;&#35770;&#19978;&#35777;&#26126;&#20102;&#26041;&#27861;&#30340;&#19968;&#33268;&#24615;&#12289;&#30446;&#26631;&#20989;&#25968;&#30340;&#36830;&#32493;&#24615;&#21644;&#21487;&#24494;&#24615;&#65292;&#24182;&#24320;&#21457;&#20102;&#36866;&#29992;&#20110;&#22810;&#38754;&#20307;&#20984;&#38598;&#30340;&#25968;&#20540;&#23454;&#29616;&#26041;&#27861;&#12290;&#23454;&#35777;&#30740;&#31350;&#36824;&#34920;&#26126;&#35813;&#26041;&#27861;&#22312;&#37329;&#34701;&#39046;&#22495;&#20855;&#26377;&#24191;&#27867;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20984;&#22411;&#20027;&#25104;&#20998;&#20998;&#26512;(Convex PCA)&#26159;&#19968;&#31181;&#22312;&#24076;&#23572;&#20271;&#29305;&#31354;&#38388;&#30340;&#20984;&#23376;&#38598;&#19978;&#36827;&#34892;&#25968;&#25454;&#38477;&#32500;&#30340;&#26041;&#27861;&#12290;&#36825;&#31181;&#35774;&#32622;&#22312;&#35768;&#22810;&#24212;&#29992;&#20013;&#37117;&#24456;&#33258;&#28982;&#22320;&#20986;&#29616;&#65292;&#21253;&#25324;&#21306;&#38388;Wasserstein&#31354;&#38388;&#20013;&#30340;&#20998;&#24067;&#25968;&#25454;&#20197;&#21450;Aitchison&#20960;&#20309;&#19979;&#30340;&#25490;&#24207;&#32452;&#25104;&#25968;&#25454;&#12290;&#26412;&#25991;&#30340;&#36129;&#29486;&#26377;&#19977;&#20010;&#26041;&#38754;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#32473;&#20986;&#20102;&#20960;&#20010;&#26032;&#30340;&#29702;&#35770;&#32467;&#26524;&#65292;&#21253;&#25324;&#26377;&#38480;&#32500;&#24773;&#20917;&#19979;&#30340;&#19968;&#33268;&#24615;&#20197;&#21450;&#30446;&#26631;&#20989;&#25968;&#30340;&#36830;&#32493;&#24615;&#21644;&#21487;&#24494;&#24615;&#12290;&#20854;&#27425;&#65292;&#24403;&#20984;&#38598;&#26159;&#22810;&#38754;&#20307;&#26102;&#65292;&#25105;&#20204;&#21457;&#23637;&#20102;&#19968;&#20010;&#25968;&#20540;&#23454;&#29616;&#30340;&#26377;&#38480;&#32500;&#20984;&#22411;&#20027;&#25104;&#20998;&#20998;&#26512;&#26041;&#27861;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;&#36825;&#25552;&#20379;&#20102;Wasserstein&#27979;&#22320;&#32447;&#20027;&#25104;&#20998;&#20998;&#26512;&#30340;&#33258;&#28982;&#36817;&#20284;&#12290;&#31532;&#19977;&#65292;&#25105;&#20204;&#36890;&#36807;&#20004;&#20010;&#37329;&#34701;&#24212;&#29992;&#26469;&#35828;&#26126;&#25105;&#20204;&#30340;&#32467;&#26524;&#65292;&#21363;&#25353;&#22823;&#23567;&#25490;&#24207;&#30340;&#32929;&#31080;&#25910;&#30410;&#20998;&#24067;&#21644;&#36164;&#26412;&#20998;&#24067;&#26354;&#32447;&#65292;&#36825;&#20004;&#20010;&#24212;&#29992;&#22312;&#38543;&#26426;&#25237;&#36164;&#32452;&#21512;&#29702;&#35770;&#20013;&#37117;&#20855;&#26377;&#29420;&#31435;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Convex PCA, which was introduced by Bigot et al., is a dimension reduction methodology for data with values in a convex subset of a Hilbert space. This setting arises naturally in many applications, including distributional data in the Wasserstein space of an interval, and ranked compositional data under the Aitchison geometry. Our contribution in this paper is threefold. First, we present several new theoretical results including consistency as well as continuity and differentiability of the objective function in the finite dimensional case. Second, we develop a numerical implementation of finite dimensional convex PCA when the convex set is polyhedral, and show that this provides a natural approximation of Wasserstein geodesic PCA. Third, we illustrate our results with two financial applications, namely distributions of stock returns ranked by size and the capital distribution curve, both of which are of independent interest in stochastic portfolio theory.
&lt;/p&gt;</description></item></channel></rss>