<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26032;&#30340;&#20108;&#38454;&#38543;&#26426;&#20248;&#21183;&#29305;&#24449;&#25551;&#36848;&#25552;&#31034;&#22312;&#19981;&#21033;&#24773;&#26223;&#20013;&#28155;&#21152;&#36127;&#39044;&#26399;&#20540;&#30340;&#39118;&#38505;&#20250;&#20351;&#26368;&#32456;&#20301;&#32622;&#23545;&#39118;&#38505;&#21388;&#24694;&#30340;&#20195;&#29702;&#20154;&#19981;&#22826;&#29702;&#24819;&#12290;</title><link>https://arxiv.org/abs/2402.13355</link><description>&lt;p&gt;
&#20108;&#38454;&#38543;&#26426;&#20248;&#21183;&#30340;&#26032;&#29305;&#24449;&#25551;&#36848;
&lt;/p&gt;
&lt;p&gt;
A new characterization of second-order stochastic dominance
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.13355
&lt;/p&gt;
&lt;p&gt;
&#26032;&#30340;&#20108;&#38454;&#38543;&#26426;&#20248;&#21183;&#29305;&#24449;&#25551;&#36848;&#25552;&#31034;&#22312;&#19981;&#21033;&#24773;&#26223;&#20013;&#28155;&#21152;&#36127;&#39044;&#26399;&#20540;&#30340;&#39118;&#38505;&#20250;&#20351;&#26368;&#32456;&#20301;&#32622;&#23545;&#39118;&#38505;&#21388;&#24694;&#30340;&#20195;&#29702;&#20154;&#19981;&#22826;&#29702;&#24819;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20379;&#20102;&#20108;&#38454;&#38543;&#26426;&#20248;&#21183;&#30340;&#26032;&#29305;&#24449;&#25551;&#36848;&#65292;&#20063;&#31216;&#20026;&#22686;&#38271;&#20985;&#24207;&#12290;&#35813;&#32467;&#26524;&#20855;&#26377;&#30452;&#35266;&#30340;&#35299;&#37322;&#65292;&#21363;&#22312;&#19981;&#21033;&#24773;&#26223;&#20013;&#28155;&#21152;&#19968;&#20010;&#39044;&#26399;&#20540;&#20026;&#36127;&#30340;&#39118;&#38505;&#20250;&#20351;&#26368;&#32456;&#20301;&#32622;&#23545;&#20110;&#39118;&#38505;&#21388;&#24694;&#30340;&#20195;&#29702;&#20154;&#36890;&#24120;&#21464;&#24471;&#19981;&#22826;&#29702;&#24819;&#12290;&#20984;&#24207;&#21644;&#22686;&#38271;&#20984;&#24207;&#20063;&#25214;&#21040;&#20102;&#31867;&#20284;&#30340;&#29305;&#24449;&#25551;&#36848;&#12290;&#20027;&#35201;&#32467;&#26524;&#30340;&#35777;&#26126;&#25216;&#26415;&#22522;&#20110;&#26399;&#26395;&#32570;&#22833;&#30340;&#24615;&#36136;&#65292;&#36825;&#26159;&#37329;&#34701;&#30417;&#31649;&#20013;&#24191;&#21463;&#27426;&#36814;&#30340;&#19968;&#31867;&#39118;&#38505;&#24230;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.13355v1 Announce Type: new  Abstract: We provide a new characterization of second-order stochastic dominance, also known as increasing concave order. The result has an intuitive interpretation that adding a risk with negative expected value in adverse scenarios makes the resulting position generally less desirable for risk-averse agents. A similar characterization is also found for convex order and increasing convex order. The proofs techniques for the main result are based on properties of Expected Shortfall, a family of risk measures that is popular in financial regulation.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#38543;&#26426;&#27874;&#21160;&#29575;Bachelier&#27169;&#22411;&#19979;&#27431;&#24335;&#21644;&#20122;&#24335;&#30475;&#28072;&#26399;&#26435;&#30340;&#38544;&#21547;&#27874;&#21160;&#29575;&#34892;&#20026;&#65292;&#24182;&#25214;&#21040;&#20102;&#19982;&#27874;&#21160;&#29575;&#27169;&#22411;&#19981;&#24179;&#28369;&#31243;&#24230;&#26377;&#20851;&#30340;&#30701;&#26399;&#21040;&#26399;&#20844;&#24335;&#26469;&#35745;&#31639;&#38544;&#21547;&#27874;&#21160;&#29575;&#30340;&#20559;&#26012;&#24230;&#12290;</title><link>http://arxiv.org/abs/2308.15341</link><description>&lt;p&gt;
&#20851;&#20110;&#38543;&#26426;&#27874;&#21160;&#29575;Bachelier&#27169;&#22411;&#19979;&#27431;&#24335;&#21644;&#20122;&#24335;&#30475;&#28072;&#26399;&#26435;&#30340;&#38544;&#21547;&#27874;&#21160;&#29575;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On the implied volatility of European and Asian call options under the stochastic volatility Bachelier model. (arXiv:2308.15341v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.15341
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#38543;&#26426;&#27874;&#21160;&#29575;Bachelier&#27169;&#22411;&#19979;&#27431;&#24335;&#21644;&#20122;&#24335;&#30475;&#28072;&#26399;&#26435;&#30340;&#38544;&#21547;&#27874;&#21160;&#29575;&#34892;&#20026;&#65292;&#24182;&#25214;&#21040;&#20102;&#19982;&#27874;&#21160;&#29575;&#27169;&#22411;&#19981;&#24179;&#28369;&#31243;&#24230;&#26377;&#20851;&#30340;&#30701;&#26399;&#21040;&#26399;&#20844;&#24335;&#26469;&#35745;&#31639;&#38544;&#21547;&#27874;&#21160;&#29575;&#30340;&#20559;&#26012;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22266;&#23450;&#34892;&#26435;&#20215;&#30340;&#27431;&#24335;&#21644;&#31561;&#24046;&#20122;&#24335;&#30475;&#28072;&#26399;&#26435;&#30340;&#24179;&#20540;&#38544;&#21547;&#27874;&#21160;&#29575;&#22312;&#30701;&#26399;&#20869;&#30340;&#34892;&#20026;&#12290;&#36164;&#20135;&#20215;&#26684;&#20551;&#35774;&#36981;&#24490;&#20855;&#26377;&#19968;&#33324;&#38543;&#26426;&#27874;&#21160;&#29575;&#36807;&#31243;&#30340;Bachelier&#27169;&#22411;&#12290;&#20351;&#29992;Malliavin&#24494;&#31215;&#20998;&#30340;&#25216;&#26415;&#65292;&#27604;&#22914;&#39044;&#27979;&#24615;&#20234;&#34276;&#20844;&#24335;&#65292;&#25105;&#20204;&#39318;&#20808;&#35745;&#31639;&#20102;&#24403;&#21040;&#26399;&#26102;&#38388;&#36235;&#20110;&#38646;&#26102;&#30340;&#38544;&#21547;&#27874;&#21160;&#29575;&#27700;&#24179;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25214;&#21040;&#20102;&#19968;&#20010;&#19982;&#27874;&#21160;&#29575;&#27169;&#22411;&#30340;&#19981;&#24179;&#28369;&#31243;&#24230;&#26377;&#20851;&#30340;&#30701;&#26399;&#21040;&#26399;&#20844;&#24335;&#65292;&#29992;&#20110;&#35745;&#31639;&#38544;&#21547;&#27874;&#21160;&#29575;&#30340;&#20559;&#26012;&#24230;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#26222;&#36941;&#32467;&#26524;&#24212;&#29992;&#20110;SABR&#21644;&#20998;&#25968;Bergomi&#27169;&#22411;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20123;&#25968;&#20540;&#27169;&#25311;&#26469;&#30830;&#35748;&#20559;&#26012;&#24230;&#30340;&#28176;&#36817;&#20844;&#24335;&#30340;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper we study the short-time behavior of the at-the-money implied volatility for European and arithmetic Asian call options with fixed strike price. The asset price is assumed to follow the Bachelier model with a general stochastic volatility process. Using techniques of the Malliavin calculus such as the anticipating It\^o's formula we first compute the level of the implied volatility when the maturity converges to zero. Then, we find a short maturity asymptotic formula for the skew of the implied volatility that depends on the roughness of the volatility model. We apply our general results to the SABR and fractional Bergomi models, and provide some numerical simulations that confirm the accurateness of the asymptotic formula for the skew.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#39640;&#39057;&#25968;&#25454;&#21644;&#29983;&#23384;&#20998;&#26512;&#23637;&#31034;&#20102;&#22635;&#20805;&#27010;&#29575;&#20989;&#25968;&#20855;&#26377;&#24378;&#28872;&#30340;&#29366;&#24577;&#20381;&#36182;&#24615;&#36136;&#12290;&#36890;&#36807;&#23545;&#27604;&#25968;&#23383;&#36164;&#20135;&#20132;&#26131;&#25152;&#21644;&#32929;&#31080;&#24066;&#22330;&#30340;&#32467;&#26524;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#23567;tick&#21152;&#23494;&#36135;&#24065;&#23545;&#21644;&#22823;tick&#36164;&#20135;&#20043;&#38388;&#30340;&#22635;&#20805;&#27010;&#29575;&#24046;&#24322;&#12290;&#30740;&#31350;&#36824;&#24471;&#20986;&#20102;&#22312;&#22266;&#23450;&#26102;&#38388;&#21608;&#26399;&#20869;&#25191;&#34892;&#38382;&#39064;&#20013;&#30340;&#26368;&#20248;&#31574;&#30053;&#12290;</title><link>http://arxiv.org/abs/2307.04863</link><description>&lt;p&gt;
&#35299;&#20915;&#29366;&#24577;&#20381;&#36182;&#25191;&#34892;&#27010;&#29575;&#38382;&#39064;&#65306;&#32463;&#39564;&#35777;&#25454;&#21644;&#35746;&#21333;&#25918;&#32622;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Tackling the Problem of State Dependent Execution Probability: Empirical Evidence and Order Placement. (arXiv:2307.04863v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04863
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#39640;&#39057;&#25968;&#25454;&#21644;&#29983;&#23384;&#20998;&#26512;&#23637;&#31034;&#20102;&#22635;&#20805;&#27010;&#29575;&#20989;&#25968;&#20855;&#26377;&#24378;&#28872;&#30340;&#29366;&#24577;&#20381;&#36182;&#24615;&#36136;&#12290;&#36890;&#36807;&#23545;&#27604;&#25968;&#23383;&#36164;&#20135;&#20132;&#26131;&#25152;&#21644;&#32929;&#31080;&#24066;&#22330;&#30340;&#32467;&#26524;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#23567;tick&#21152;&#23494;&#36135;&#24065;&#23545;&#21644;&#22823;tick&#36164;&#20135;&#20043;&#38388;&#30340;&#22635;&#20805;&#27010;&#29575;&#24046;&#24322;&#12290;&#30740;&#31350;&#36824;&#24471;&#20986;&#20102;&#22312;&#22266;&#23450;&#26102;&#38388;&#21608;&#26399;&#20869;&#25191;&#34892;&#38382;&#39064;&#20013;&#30340;&#26368;&#20248;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35746;&#21333;&#25918;&#32622;&#31574;&#30053;&#22312;&#39640;&#39057;&#20132;&#26131;&#31639;&#27861;&#20013;&#36215;&#30528;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#65292;&#20854;&#35774;&#35745;&#22522;&#20110;&#23545;&#35746;&#21333;&#31807;&#21160;&#24577;&#30340;&#29702;&#35299;&#12290;&#21033;&#29992;&#39640;&#36136;&#37327;&#30340;&#39640;&#39057;&#25968;&#25454;&#21644;&#29983;&#23384;&#20998;&#26512;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#20805;&#20998;&#27010;&#29575;&#20989;&#25968;&#20855;&#26377;&#24378;&#28872;&#30340;&#29366;&#24577;&#20381;&#36182;&#24615;&#36136;&#12290;&#25105;&#20204;&#23450;&#20041;&#20102;&#19968;&#32452;&#24494;&#35266;&#32467;&#26500;&#29305;&#24449;&#65292;&#24182;&#35757;&#32451;&#20102;&#19968;&#20010;&#22810;&#23618;&#24863;&#30693;&#26426;&#26469;&#25512;&#26029;&#22635;&#20805;&#27010;&#29575;&#20989;&#25968;&#12290;&#25105;&#20204;&#24212;&#29992;&#20102;&#19968;&#31181;&#21152;&#26435;&#26041;&#27861;&#21040;&#25439;&#22833;&#20989;&#25968;&#20013;&#65292;&#20351;&#24471;&#27169;&#22411;&#33021;&#22815;&#20174;&#34987;&#23457;&#26597;&#25968;&#25454;&#20013;&#23398;&#20064;&#12290;&#36890;&#36807;&#27604;&#36739;&#22312;&#25968;&#23383;&#36164;&#20135;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#65288;CEXs&#65289;&#21644;&#32929;&#31080;&#24066;&#22330;&#19978;&#33719;&#24471;&#30340;&#25968;&#20540;&#32467;&#26524;&#65292;&#25105;&#20204;&#33021;&#22815;&#20998;&#26512;&#23567;tick&#21152;&#23494;&#36135;&#24065;&#23545;&#21644;&#22823;tick&#36164;&#20135;&#65288;&#19982;&#21152;&#23494;&#36135;&#24065;&#30456;&#23545;&#36739;&#22823;&#65289;&#30340;&#22635;&#20805;&#27010;&#29575;&#20043;&#38388;&#30340;&#24046;&#24322;&#12290;&#25105;&#20204;&#29992;&#19968;&#20010;&#22266;&#23450;&#26102;&#38388;&#21608;&#26399;&#30340;&#25191;&#34892;&#38382;&#39064;&#26469;&#35828;&#26126;&#36825;&#20010;&#27169;&#22411;&#30340;&#23454;&#38469;&#29992;&#36884;&#65292;&#20854;&#20013;&#21253;&#25324;&#26159;&#21542;&#21457;&#24067;&#38480;&#20215;&#35746;&#21333;&#25110;&#31435;&#21363;&#25191;&#34892;&#30340;&#20915;&#31574;&#65292;&#20197;&#21450;&#26368;&#20248;&#25918;&#32622;&#36317;&#31163;&#30340;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;
Order placement tactics play a crucial role in high-frequency trading algorithms and their design is based on understanding the dynamics of the order book. Using high quality high-frequency data and survival analysis, we exhibit strong state dependence properties of the fill probability function. We define a set of microstructure features and train a multi-layer perceptron to infer the fill probability function. A weighting method is applied to the loss function such that the model learns from censored data. By comparing numerical results obtained on both digital asset centralized exchanges (CEXs) and stock markets, we are able to analyze dissimilarities between the fill probability of small tick crypto pairs and large tick assets -- large, relative to cryptos. The practical use of this model is illustrated with a fixed time horizon execution problem in which both the decision to post a limit order or to immediately execute and the optimal distance of placement are characterized. We di
&lt;/p&gt;</description></item></channel></rss>