<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#38598;&#20540;&#26143;&#24418;&#39118;&#38505;&#24230;&#37327;&#65292;&#22312;&#30740;&#31350;&#20013;&#21457;&#29616;&#38598;&#20540;&#39118;&#38505;&#24230;&#37327;&#21487;&#20197;&#34920;&#31034;&#20026;&#38598;&#20540;&#20984;&#39118;&#38505;&#24230;&#37327;&#30340;&#24182;&#38598;&#65292;&#38598;&#20540;&#26631;&#20934;&#21270;&#26143;&#24418;&#39118;&#38505;&#24230;&#37327;&#21487;&#20197;&#34920;&#31034;&#20026;&#38598;&#20540;&#26631;&#20934;&#21270;&#20984;&#39118;&#38505;&#24230;&#37327;&#30340;&#24182;&#38598;&#65292;&#24182;&#19988;&#24314;&#31435;&#20102;&#38598;&#20540;&#39118;&#38505;&#24230;&#37327;&#21644;&#38598;&#20540;&#26143;&#24418;&#39118;&#38505;&#24230;&#37327;&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;</title><link>https://arxiv.org/abs/2402.18014</link><description>&lt;p&gt;
&#38598;&#20540;&#26143;&#24418;&#39118;&#38505;&#24230;&#37327;
&lt;/p&gt;
&lt;p&gt;
Set-valued Star-Shaped Risk Measures
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.18014
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#38598;&#20540;&#26143;&#24418;&#39118;&#38505;&#24230;&#37327;&#65292;&#22312;&#30740;&#31350;&#20013;&#21457;&#29616;&#38598;&#20540;&#39118;&#38505;&#24230;&#37327;&#21487;&#20197;&#34920;&#31034;&#20026;&#38598;&#20540;&#20984;&#39118;&#38505;&#24230;&#37327;&#30340;&#24182;&#38598;&#65292;&#38598;&#20540;&#26631;&#20934;&#21270;&#26143;&#24418;&#39118;&#38505;&#24230;&#37327;&#21487;&#20197;&#34920;&#31034;&#20026;&#38598;&#20540;&#26631;&#20934;&#21270;&#20984;&#39118;&#38505;&#24230;&#37327;&#30340;&#24182;&#38598;&#65292;&#24182;&#19988;&#24314;&#31435;&#20102;&#38598;&#20540;&#39118;&#38505;&#24230;&#37327;&#21644;&#38598;&#20540;&#26143;&#24418;&#39118;&#38505;&#24230;&#37327;&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#38598;&#20540;&#39118;&#38505;&#24230;&#37327;&#31867;&#21035;&#65292;&#31216;&#20026;&#38598;&#20540;&#26143;&#24418;&#39118;&#38505;&#24230;&#37327;&#12290;&#21463;&#21040;&#26631;&#37327;&#36135;&#24065;&#21644;&#26143;&#24418;&#39118;&#38505;&#24230;&#37327;&#30340;&#32467;&#26524;&#30340;&#21551;&#21457;&#65292;&#26412;&#25991;&#30740;&#31350;&#20102;&#38598;&#20540;&#26694;&#26550;&#20013;&#30340;&#34920;&#31034;&#23450;&#29702;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#38598;&#20540;&#39118;&#38505;&#24230;&#37327;&#21487;&#20197;&#34920;&#31034;&#20026;&#19968;&#32452;&#38598;&#20540;&#20984;&#39118;&#38505;&#24230;&#37327;&#30340;&#24182;&#38598;&#65292;&#24182;&#19988;&#38598;&#20540;&#26631;&#20934;&#21270;&#26143;&#24418;&#39118;&#38505;&#24230;&#37327;&#21487;&#20197;&#34920;&#31034;&#20026;&#19968;&#32452;&#38598;&#20540;&#26631;&#20934;&#21270;&#20984;&#39118;&#38505;&#24230;&#37327;&#30340;&#24182;&#38598;&#12290;&#36824;&#24314;&#31435;&#20102;&#38598;&#20540;&#39118;&#38505;&#24230;&#37327;&#21644;&#38598;&#20540;&#26143;&#24418;&#39118;&#38505;&#24230;&#37327;&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18014v1 Announce Type: new  Abstract: In this paper, we introduce a new class of set-valued risk measures, named set-valued star-shaped risk measures. Motivated by the results of scalar monetary and star-shaped risk measures, this paper investigates the representation theorems in the set-valued framework. It is demonstrated that set-valued risk measures can be represented as the union of a family of set-valued convex risk measures, and set-valued normalized star-shaped risk measures can be represented as the union of a family of set-valued normalized convex risk measures. The link between set-valued risk measures and set-valued star-shaped risk measures is also established.
&lt;/p&gt;</description></item></channel></rss>