<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#33258;&#36873;&#23567;&#32452;&#20013;&#65292;&#23398;&#29983;&#34920;&#29616;&#36739;&#24046;&#65292;&#20294;&#23398;&#20064;&#25928;&#26524;&#26356;&#22909;&#21644;&#26356;&#28385;&#24847;&#65292;&#33258;&#36873;&#32452;&#25928;&#26524;&#20027;&#35201;&#21463;&#23398;&#29983;&#36873;&#25321;&#32452;&#21592;&#30340;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2403.12694</link><description>&lt;p&gt;
&#33258;&#36873;&#23567;&#32452;&#20013;&#30340;&#32489;&#25928;&#12289;&#30693;&#35782;&#33719;&#21462;&#21644;&#28385;&#24847;&#24230;&#65306;&#26469;&#33258;&#19968;&#39033;&#35838;&#22530;&#23454;&#22320;&#23454;&#39564;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Performance, Knowledge Acquisition and Satisfaction in Self-selected Groups: Evidence from a Classroom Field Experiment
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12694
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#33258;&#36873;&#23567;&#32452;&#20013;&#65292;&#23398;&#29983;&#34920;&#29616;&#36739;&#24046;&#65292;&#20294;&#23398;&#20064;&#25928;&#26524;&#26356;&#22909;&#21644;&#26356;&#28385;&#24847;&#65292;&#33258;&#36873;&#32452;&#25928;&#26524;&#20027;&#35201;&#21463;&#23398;&#29983;&#36873;&#25321;&#32452;&#21592;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#22914;&#20309;&#26377;&#25928;&#22320;&#32452;&#24314;&#24037;&#20316;&#23567;&#32452;&#20197;&#25552;&#39640;&#23567;&#32452;&#29983;&#20135;&#21147;&#12289;&#20010;&#20154;&#28385;&#24847;&#24230;&#21644;&#23398;&#20064;&#24773;&#20917;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#22312;&#19968;&#38376;&#24517;&#20462;&#26412;&#31185;&#35838;&#31243;&#20013;&#36827;&#34892;&#20102;&#19968;&#39033;&#33258;&#28982;&#30340;&#23454;&#22320;&#23454;&#39564;&#65292;&#24182;&#30740;&#31350;&#20102;&#33258;&#36873;&#23567;&#32452;&#21644;&#38543;&#26426;&#20998;&#37197;&#23567;&#32452;&#20043;&#38388;&#30340;&#24046;&#24322;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#33258;&#36873;&#23567;&#32452;&#22312;&#23567;&#32452;&#20219;&#21153;&#19978;&#34920;&#29616;&#26174;&#33879;&#36739;&#24046;&#12290;&#28982;&#32780;&#65292;&#33258;&#36873;&#23567;&#32452;&#30340;&#23398;&#29983;&#23398;&#21040;&#26356;&#22810;&#65292;&#27604;&#38543;&#26426;&#20998;&#37197;&#30340;&#32452;&#26356;&#28385;&#24847;&#12290;&#20801;&#35768;&#23398;&#29983;&#36873;&#25321;&#32452;&#21592;&#30340;&#24433;&#21709;&#22312;&#33258;&#36873;&#23567;&#32452;&#20013;&#21344;&#20027;&#23548;&#22320;&#20301;&#65306;&#22312;&#25511;&#21046;&#32452;&#30340;&#25216;&#33021;&#12289;&#24615;&#21035;&#21644;&#23478;&#24237;&#22320;&#21306;&#26500;&#25104;&#21518;&#65292;&#33258;&#36873;&#23567;&#32452;&#21644;&#38543;&#26426;&#32452;&#20043;&#38388;&#30340;&#24046;&#24322;&#20960;&#20046;&#20445;&#25345;&#19981;&#21464;&#12290;GitHub&#25552;&#20132;&#30340;&#20998;&#24067;&#26174;&#31034;&#65292;&#38543;&#26426;&#20998;&#37197;&#30340;&#32452;&#30340;&#24179;&#22343;&#34920;&#29616;&#26356;&#22909;&#20027;&#35201;&#26159;&#30001;&#25216;&#33021;&#39640;&#30340;&#20010;&#20154;&#25512;&#21160;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12694v1 Announce Type: new  Abstract: We investigate how to efficiently set up work groups to boost group productivity, individual satisfaction, and learning. Therefore, we conduct a natural field experiment in a compulsory undergraduate course and study differences between self-selected and randomly assigned groups. We find that self-selected groups perform significantly worse on group assignments. Yet, students in self-selected groups learn more and are more satisfied than those in randomly assigned groups. The effect of allowing students to pick group members dominates the effect of different group compositions in self-selected groups: When controlling for the skill, gender, and home region composition of groups, the differences between self-selected and randomly formed groups persist almost unaltered. The distribution of GitHub commits per group reveals that the better average performance of randomly assigned groups is mainly driven by highly skilled individuals distribu
&lt;/p&gt;</description></item><item><title>&#24320;&#21457;&#20102;&#22797;&#21512;&#20284;&#28982;&#25512;&#26029;&#26694;&#26550;&#65292;&#29992;&#20110;&#31283;&#24577;&#39640;&#26031;&#36807;&#31243;&#30340;&#21442;&#25968;&#20272;&#35745;&#65292;&#25104;&#21151;&#25913;&#21892;&#20102;&#30697;&#27861;&#20272;&#35745;&#26041;&#27861;&#65292;&#23454;&#35777;&#32467;&#26524;&#25903;&#25345;&#38543;&#26426;&#27874;&#21160;&#24615;&#22312;&#19981;&#21516;&#26102;&#38388;&#23610;&#24230;&#19978;&#30340;&#29305;&#24615;</title><link>https://arxiv.org/abs/2403.12653</link><description>&lt;p&gt;
&#22797;&#21512;&#20284;&#28982;&#20272;&#35745;&#22312;&#31283;&#24577;&#39640;&#26031;&#36807;&#31243;&#20013;&#30340;&#24212;&#29992;&#24182;&#38024;&#23545;&#38543;&#26426;&#27874;&#21160;&#24615;&#36827;&#34892;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Composite likelihood estimation of stationary Gaussian processes with a view toward stochastic volatility
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12653
&lt;/p&gt;
&lt;p&gt;
&#24320;&#21457;&#20102;&#22797;&#21512;&#20284;&#28982;&#25512;&#26029;&#26694;&#26550;&#65292;&#29992;&#20110;&#31283;&#24577;&#39640;&#26031;&#36807;&#31243;&#30340;&#21442;&#25968;&#20272;&#35745;&#65292;&#25104;&#21151;&#25913;&#21892;&#20102;&#30697;&#27861;&#20272;&#35745;&#26041;&#27861;&#65292;&#23454;&#35777;&#32467;&#26524;&#25903;&#25345;&#38543;&#26426;&#27874;&#21160;&#24615;&#22312;&#19981;&#21516;&#26102;&#38388;&#23610;&#24230;&#19978;&#30340;&#29305;&#24615;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#29992;&#20110;&#23545;&#21442;&#25968;&#21270;&#36830;&#32493;&#26102;&#38388;&#31283;&#24577;&#39640;&#26031;&#36807;&#31243;&#36827;&#34892;&#22797;&#21512;&#20284;&#28982;&#25512;&#26029;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#30456;&#20851;&#26368;&#22823;&#22797;&#21512;&#20284;&#28982;&#20272;&#35745;&#22120;&#30340;&#28176;&#36817;&#29702;&#35770;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#26041;&#27861;&#24212;&#29992;&#20110;&#19968;&#23545;&#26088;&#22312;&#25551;&#36848;&#37329;&#34701;&#36164;&#20135;&#22238;&#25253;&#30340;&#38543;&#26426;&#23545;&#25968;&#29616;&#36135;&#27874;&#21160;&#24615;&#30340;&#27169;&#22411;&#12290;&#27169;&#25311;&#30740;&#31350;&#34920;&#26126;&#65292;&#22312;&#36825;&#20123;&#24773;&#26223;&#19979;&#65292;&#23427;&#34920;&#29616;&#33391;&#22909;&#65292;&#24182;&#25913;&#21892;&#20102;&#30697;&#27861;&#20272;&#35745;&#26041;&#27861;&#12290;&#22312;&#24212;&#29992;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#21033;&#29992;&#21152;&#23494;&#36135;&#24065;&#24066;&#22330;&#39640;&#39057;&#25968;&#25454;&#35745;&#31639;&#30340;&#19968;&#31181;&#26085;&#20869;&#24230;&#37327;&#30340;&#21160;&#24577;&#29305;&#24615;&#12290;&#32463;&#39564;&#35777;&#25454;&#25903;&#25345;&#19968;&#31181;&#26426;&#21046;&#65292;&#22312;&#36825;&#31181;&#26426;&#21046;&#20013;&#65292;&#38543;&#26426;&#27874;&#21160;&#24615;&#30340;&#30701;&#26399;&#21644;&#38271;&#26399;&#30456;&#20851;&#32467;&#26500;&#26159;&#20998;&#24320;&#30340;&#65292;&#20197;&#25429;&#25417;&#20854;&#22312;&#19981;&#21516;&#26102;&#38388;&#23610;&#24230;&#19978;&#30340;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12653v1 Announce Type: new  Abstract: We develop a framework for composite likelihood inference of parametric continuous-time stationary Gaussian processes. We derive the asymptotic theory of the associated maximum composite likelihood estimator. We implement our approach on a pair of models that has been proposed to describe the random log-spot variance of financial asset returns. A simulation study shows that it delivers good performance in these settings and improves upon a method-of-moments estimation. In an application, we inspect the dynamic of an intraday measure of spot variance computed with high-frequency data from the cryptocurrency market. The empirical evidence supports a mechanism, where the short- and long-term correlation structure of stochastic volatility are decoupled in order to capture its properties at different time scales.
&lt;/p&gt;</description></item><item><title>&#20316;&#32773;&#36890;&#36807;&#23450;&#37327;&#20998;&#26512;&#32929;&#25351;&#30340;&#22343;&#20540;&#21644;&#27874;&#21160;&#29575;&#19981;&#30830;&#23450;&#24615;&#65292;&#26500;&#24314;&#20102;&#19977;&#20010;&#26089;&#26399;&#39044;&#35686;&#25351;&#26631;&#65292;&#24314;&#31435;&#20102;&#26032;&#30340;&#24322;&#24120;&#27874;&#21160;&#39044;&#35686;&#27169;&#22411;&#65292;&#20026;&#37329;&#34701;&#24066;&#22330;&#25552;&#20379;&#30701;&#26399;&#39044;&#35686;&#12290;</title><link>https://arxiv.org/abs/2403.12647</link><description>&lt;p&gt;
&#37329;&#34701;&#24066;&#22330;&#30340;&#19981;&#30830;&#23450;&#24615;&#21450;&#20854;&#22312;&#39044;&#27979;&#24322;&#24120;&#37329;&#34701;&#27874;&#21160;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Uncertainty in the financial market and application to forecastabnormal financial fluctuations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12647
&lt;/p&gt;
&lt;p&gt;
&#20316;&#32773;&#36890;&#36807;&#23450;&#37327;&#20998;&#26512;&#32929;&#25351;&#30340;&#22343;&#20540;&#21644;&#27874;&#21160;&#29575;&#19981;&#30830;&#23450;&#24615;&#65292;&#26500;&#24314;&#20102;&#19977;&#20010;&#26089;&#26399;&#39044;&#35686;&#25351;&#26631;&#65292;&#24314;&#31435;&#20102;&#26032;&#30340;&#24322;&#24120;&#27874;&#21160;&#39044;&#35686;&#27169;&#22411;&#65292;&#20026;&#37329;&#34701;&#24066;&#22330;&#25552;&#20379;&#30701;&#26399;&#39044;&#35686;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37329;&#34701;&#19982;&#25216;&#26415;&#30340;&#34701;&#21512;&#19982;&#21019;&#26032;&#36880;&#28176;&#23558;&#37329;&#34701;&#31995;&#32479;&#36716;&#21464;&#20026;&#22797;&#26434;&#30340;&#31995;&#32479;&#12290;&#20998;&#26512;&#37329;&#34701;&#24066;&#22330;&#24322;&#24120;&#27874;&#21160;&#30340;&#21407;&#22240;&#65292;&#25552;&#21462;&#26089;&#26399;&#39044;&#35686;&#25351;&#26631;&#65292;&#21457;&#29616;&#22823;&#22810;&#25968;&#26089;&#26399;&#39044;&#35686;&#31995;&#32479;&#26159;&#23450;&#24615;&#21644;&#22240;&#26524;&#30340;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#27169;&#22411;&#19981;&#33021;&#29992;&#20110;&#39044;&#27979;&#37329;&#34701;&#24066;&#22330;&#22522;&#20934;&#30340;&#39118;&#38505;&#12290;&#22240;&#27492;&#65292;&#20174;&#23450;&#37327;&#20998;&#26512;&#30340;&#35282;&#24230;&#20986;&#21457;&#65292;&#25105;&#20204;&#20851;&#27880;&#32929;&#25351;&#65288;&#22522;&#20934;&#65289;&#30340;&#22343;&#20540;&#21644;&#27874;&#21160;&#29575;&#19981;&#30830;&#23450;&#24615;&#65292;&#26500;&#24314;&#20102;&#19977;&#20010;&#26089;&#26399;&#39044;&#35686;&#25351;&#26631;&#65306;&#22343;&#20540;&#19981;&#30830;&#23450;&#24615;&#12289;&#27874;&#21160;&#29575;&#19981;&#30830;&#23450;&#24615;&#21644;ALM-G&#20540;-at-risk&#12290;&#22522;&#20110;&#36825;&#20123;&#26032;&#39062;&#30340;&#39044;&#35686;&#25351;&#26631;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#20010;&#26032;&#30340;&#24322;&#24120;&#27874;&#21160;&#39044;&#35686;&#27169;&#22411;&#65292;&#23558;&#20026;&#22269;&#23478;&#12289;&#31038;&#20250;&#21644;&#20010;&#20154;&#25552;&#20379;&#30701;&#26399;&#39044;&#35686;&#65292;&#25552;&#21069;&#21453;&#26144;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12647v1 Announce Type: new  Abstract: The integration and innovation of finance and technology have gradually transformed the financial system into a complex one. Analyses of the causesd of abnormal fluctuations in the financial market to extract early warning indicators revealed that most early warning systems are qualitative and causal. However, these models cannot be used to forecast the risk of the financial market benchmark. Therefore, from a quantitative analysis perspective, we focus on the mean and volatility uncertainties of the stock index (benchmark) and then construct three early warning indicators: mean uncertainty, volatility uncertainty, and ALM-G-value at risk. Based on the novel warning indicators, we establish a new abnormal fluctuations warning model, which will provide a short-term warning for the country, society, and individuals to reflect in advance.
&lt;/p&gt;</description></item><item><title>&#24341;&#20837;&#20102;&#19968;&#31181;&#22522;&#20110;Llama 2 7B&#27169;&#22411;&#30340;&#37329;&#34701;&#39046;&#22495;&#29305;&#23450;&#30340;&#24773;&#24863;&#20998;&#31867;&#26694;&#26550;&#65292;&#36890;&#36807;&#24494;&#35843;&#27169;&#22411;&#26469;&#21463;&#30410;&#20110;&#20854;&#29983;&#25104;&#24615;&#36136;&#21644;&#20840;&#38754;&#30340;&#35821;&#35328;&#25805;&#20316;&#12290;</title><link>https://arxiv.org/abs/2403.12285</link><description>&lt;p&gt;
FinLlama&#65306;&#29992;&#20110;&#31639;&#27861;&#20132;&#26131;&#24212;&#29992;&#30340;&#37329;&#34701;&#24773;&#24863;&#20998;&#31867;
&lt;/p&gt;
&lt;p&gt;
FinLlama: Financial Sentiment Classification for Algorithmic Trading Applications
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12285
&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#20102;&#19968;&#31181;&#22522;&#20110;Llama 2 7B&#27169;&#22411;&#30340;&#37329;&#34701;&#39046;&#22495;&#29305;&#23450;&#30340;&#24773;&#24863;&#20998;&#31867;&#26694;&#26550;&#65292;&#36890;&#36807;&#24494;&#35843;&#27169;&#22411;&#26469;&#21463;&#30410;&#20110;&#20854;&#29983;&#25104;&#24615;&#36136;&#21644;&#20840;&#38754;&#30340;&#35821;&#35328;&#25805;&#20316;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37329;&#34701;&#26032;&#38395;&#22312;&#32447;&#26377;&#22810;&#20010;&#26469;&#28304;&#24433;&#21709;&#24066;&#22330;&#36208;&#21183;&#21644;&#20132;&#26131;&#21592;&#30340;&#20915;&#31574;&#12290;&#36825;&#31361;&#20986;&#20102;&#20934;&#30830;&#24773;&#24863;&#20998;&#26512;&#30340;&#38656;&#27714;&#65292;&#38500;&#20102;&#38656;&#35201;&#36866;&#24403;&#30340;&#31639;&#27861;&#20132;&#26131;&#25216;&#26415;&#26469;&#20570;&#20986;&#26356;&#26126;&#26234;&#30340;&#20132;&#26131;&#20915;&#31574;&#12290;&#26631;&#20934;&#30340;&#22522;&#20110;&#35789;&#20856;&#30340;&#24773;&#24863;&#26041;&#27861;&#24050;&#32463;&#35777;&#26126;&#23427;&#20204;&#22312;&#36741;&#21161;&#37329;&#34701;&#20915;&#31574;&#26041;&#38754;&#30340;&#33021;&#21147;&#12290;&#28982;&#32780;&#65292;&#20247;&#25152;&#21608;&#30693;&#23427;&#20204;&#23384;&#22312;&#19982;&#19978;&#19979;&#25991;&#25935;&#24863;&#24615;&#21644;&#35789;&#24207;&#30456;&#20851;&#30340;&#38382;&#39064;&#12290;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#20063;&#21487;&#20197;&#22312;&#36825;&#20010;&#32972;&#26223;&#19979;&#20351;&#29992;&#65292;&#20294;&#23427;&#20204;&#19981;&#26159;&#29305;&#23450;&#20110;&#37329;&#34701;&#39046;&#22495;&#30340;&#65292;&#24182;&#19988;&#24448;&#24448;&#38656;&#35201;&#22823;&#37327;&#30340;&#35745;&#31639;&#36164;&#28304;&#12290;&#20026;&#20102;&#20419;&#36827;&#19968;&#31181;&#29305;&#23450;&#20110;&#37329;&#34701;&#39046;&#22495;&#30340;LLM&#26694;&#26550;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#22522;&#20110;Llama 2 7B&#22522;&#30784;&#27169;&#22411;&#30340;&#26032;&#26041;&#27861;&#65292;&#20197;&#20415;&#20174;&#20854;&#29983;&#25104;&#24615;&#36136;&#21644;&#20840;&#38754;&#30340;&#35821;&#35328;&#25805;&#20316;&#20013;&#21463;&#30410;&#12290;&#36825;&#26159;&#36890;&#36807;&#22312;&#23569;&#37096;&#20998;&#30417;&#30563;&#37329;&#34701;&#24773;&#24863;&#25968;&#25454;&#19978;&#24494;&#35843;Llama2 7B&#27169;&#22411;&#26469;&#23454;&#29616;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12285v1 Announce Type: new  Abstract: There are multiple sources of financial news online which influence market movements and trader's decisions. This highlights the need for accurate sentiment analysis, in addition to having appropriate algorithmic trading techniques, to arrive at better informed trading decisions. Standard lexicon based sentiment approaches have demonstrated their power in aiding financial decisions. However, they are known to suffer from issues related to context sensitivity and word ordering. Large Language Models (LLMs) can also be used in this context, but they are not finance-specific and tend to require significant computational resources. To facilitate a finance specific LLM framework, we introduce a novel approach based on the Llama 2 7B foundational model, in order to benefit from its generative nature and comprehensive language manipulation. This is achieved by fine-tuning the Llama2 7B model on a small portion of supervised financial sentiment 
&lt;/p&gt;</description></item><item><title>&#24341;&#20837;&#19968;&#31181;&#21019;&#26032;&#30340;&#26080;&#27169;&#22411;&#21644;&#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#32479;&#35745;&#22871;&#21033;&#26694;&#26550;&#65292;&#36890;&#36807;&#26368;&#23567;&#21270;&#32463;&#39564;&#22343;&#20540;&#22238;&#24402;&#26102;&#38388;&#20248;&#21270;&#36164;&#20135;&#31995;&#25968;&#65292;&#24182;&#37319;&#29992;&#24378;&#21270;&#23398;&#20064;&#26694;&#26550;&#35782;&#21035;&#26368;&#20339;&#30340;&#22343;&#20540;&#22238;&#24402;&#31574;&#30053;&#65292;&#21019;&#36896;&#24615;&#22320;&#26500;&#24314;&#29366;&#24577;&#31354;&#38388;&#20197;&#21453;&#26144;&#26368;&#36817;&#30340;&#20215;&#26684;&#36208;&#21183;&#65292;&#24182;&#35774;&#35745;&#22870;&#21169;&#20989;&#25968;&#20197;&#21453;&#26144;&#22343;&#20540;&#22238;&#24402;&#20132;&#26131;&#30340;&#29420;&#29305;&#29305;&#24449;&#12290;</title><link>https://arxiv.org/abs/2403.12180</link><description>&lt;p&gt;
&#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#20808;&#36827;&#32479;&#35745;&#22871;&#21033;
&lt;/p&gt;
&lt;p&gt;
Advanced Statistical Arbitrage with Reinforcement Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12180
&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#19968;&#31181;&#21019;&#26032;&#30340;&#26080;&#27169;&#22411;&#21644;&#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#32479;&#35745;&#22871;&#21033;&#26694;&#26550;&#65292;&#36890;&#36807;&#26368;&#23567;&#21270;&#32463;&#39564;&#22343;&#20540;&#22238;&#24402;&#26102;&#38388;&#20248;&#21270;&#36164;&#20135;&#31995;&#25968;&#65292;&#24182;&#37319;&#29992;&#24378;&#21270;&#23398;&#20064;&#26694;&#26550;&#35782;&#21035;&#26368;&#20339;&#30340;&#22343;&#20540;&#22238;&#24402;&#31574;&#30053;&#65292;&#21019;&#36896;&#24615;&#22320;&#26500;&#24314;&#29366;&#24577;&#31354;&#38388;&#20197;&#21453;&#26144;&#26368;&#36817;&#30340;&#20215;&#26684;&#36208;&#21183;&#65292;&#24182;&#35774;&#35745;&#22870;&#21169;&#20989;&#25968;&#20197;&#21453;&#26144;&#22343;&#20540;&#22238;&#24402;&#20132;&#26131;&#30340;&#29420;&#29305;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32479;&#35745;&#22871;&#21033;&#26159;&#19968;&#31181;&#21033;&#29992;&#25104;&#23545;&#32929;&#31080;&#30340;&#20215;&#24046;&#22343;&#20540;&#21453;&#36716;&#29305;&#24615;&#30340;&#24120;&#35265;&#20132;&#26131;&#31574;&#30053;&#12290;&#23545;&#36825;&#31181;&#31574;&#30053;&#30340;&#30740;&#31350;&#32463;&#24120;&#20005;&#37325;&#20381;&#36182;&#27169;&#22411;&#20551;&#35774;&#12290;&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#31181;&#21019;&#26032;&#30340;&#26080;&#27169;&#22411;&#21644;&#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#32479;&#35745;&#22871;&#21033;&#26694;&#26550;&#12290;&#22312;&#26500;&#24314;&#22343;&#20540;&#22238;&#24402;&#20215;&#24046;&#26102;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#31181;&#32463;&#39564;&#22238;&#24402;&#26102;&#38388;&#24230;&#37327;&#65292;&#24182;&#36890;&#36807;&#26368;&#23567;&#21270;&#36825;&#31181;&#32463;&#39564;&#22343;&#20540;&#22238;&#24402;&#26102;&#38388;&#26469;&#20248;&#21270;&#36164;&#20135;&#31995;&#25968;&#12290;&#22312;&#20132;&#26131;&#38454;&#27573;&#65292;&#25105;&#20204;&#37319;&#29992;&#24378;&#21270;&#23398;&#20064;&#26694;&#26550;&#26469;&#35782;&#21035;&#26368;&#20339;&#30340;&#22343;&#20540;&#22238;&#24402;&#31574;&#30053;&#12290;&#19982;&#20256;&#32479;&#30340;&#20027;&#35201;&#20851;&#27880;&#20215;&#26684;&#20559;&#31163;&#38271;&#26399;&#22343;&#20540;&#30340;&#22343;&#20540;&#22238;&#24402;&#31574;&#30053;&#19981;&#21516;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#21019;&#36896;&#24615;&#22320;&#26500;&#24314;&#20102;&#29366;&#24577;&#31354;&#38388;&#65292;&#20197;&#27010;&#25324;&#20215;&#26684;&#36208;&#21183;&#20013;&#26368;&#36817;&#30340;&#36235;&#21183;&#12290;&#27492;&#22806;&#65292;&#22870;&#21169;&#20989;&#25968;&#32463;&#36807;&#31934;&#24515;&#35774;&#35745;&#65292;&#20197;&#21453;&#26144;&#22343;&#20540;&#22238;&#24402;&#20132;&#26131;&#30340;&#29420;&#29305;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12180v1 Announce Type: new  Abstract: Statistical arbitrage is a prevalent trading strategy which takes advantage of mean reverse property of spread of paired stocks. Studies on this strategy often rely heavily on model assumption. In this study, we introduce an innovative model-free and reinforcement learning based framework for statistical arbitrage. For the construction of mean reversion spreads, we establish an empirical reversion time metric and optimize asset coefficients by minimizing this empirical mean reversion time. In the trading phase, we employ a reinforcement learning framework to identify the optimal mean reversion strategy. Diverging from traditional mean reversion strategies that primarily focus on price deviations from a long-term mean, our methodology creatively constructs the state space to encapsulate the recent trends in price movements. Additionally, the reward function is carefully tailored to reflect the unique characteristics of mean reversion trad
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#28145;&#24230;&#23398;&#20064;&#21644;NLP&#20998;&#26512;&#39046;&#23548;&#20154;&#30340;Twitter&#24080;&#25143;&#65292;&#32467;&#21512;&#21382;&#21490;&#25968;&#25454;&#19982;&#31038;&#20132;&#23186;&#20307;&#26032;&#38395;&#65292;&#23454;&#29616;&#23545;&#37329;&#34701;&#24066;&#22330;&#36235;&#21183;&#30340;&#39044;&#27979;&#21450;&#25512;&#25991;&#23545;&#32929;&#20215;&#24433;&#21709;&#30340;&#20998;&#26512;&#12290;</title><link>https://arxiv.org/abs/2403.12161</link><description>&lt;p&gt;
&#39046;&#23548;&#32773;&#30340;&#22768;&#38899;&#23545;&#37329;&#34701;&#24066;&#22330;&#30340;&#24433;&#21709;&#65306;&#20851;&#20110;&#32435;&#26031;&#36798;&#20811;&#12289;&#21360;&#24230;&#22269;&#23478;&#35777;&#21048;&#20132;&#26131;&#25152;&#31561;&#30340;&#32463;&#39564;&#28145;&#24230;&#23398;&#20064;&#25506;&#31350;
&lt;/p&gt;
&lt;p&gt;
Effect of Leaders Voice on Financial Market: An Empirical Deep Learning Expedition on NASDAQ, NSE, and Beyond
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12161
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#28145;&#24230;&#23398;&#20064;&#21644;NLP&#20998;&#26512;&#39046;&#23548;&#20154;&#30340;Twitter&#24080;&#25143;&#65292;&#32467;&#21512;&#21382;&#21490;&#25968;&#25454;&#19982;&#31038;&#20132;&#23186;&#20307;&#26032;&#38395;&#65292;&#23454;&#29616;&#23545;&#37329;&#34701;&#24066;&#22330;&#36235;&#21183;&#30340;&#39044;&#27979;&#21450;&#25512;&#25991;&#23545;&#32929;&#20215;&#24433;&#21709;&#30340;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37329;&#34701;&#24066;&#22330;&#65292;&#22914;&#32929;&#31080;&#12289;&#32929;&#20221;&#12289;&#40644;&#37329;&#12289;&#30707;&#27833;&#12289;&#20849;&#21516;&#22522;&#37329;&#30340;&#20215;&#26684;&#21463;&#21040;&#31038;&#20132;&#23186;&#20307;&#19978;&#30340;&#26032;&#38395;&#21644;&#24086;&#23376;&#30340;&#24433;&#21709;&#12290;&#26412;&#25991;&#25552;&#20986;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65292;&#36890;&#36807;&#23545;&#19981;&#21516;&#39046;&#22495;&#39046;&#23548;&#20154;&#30340;Twitter&#24080;&#25143;&#36827;&#34892;NLP&#20998;&#26512;&#65292;&#39044;&#27979;&#37329;&#34701;&#24066;&#22330;&#36235;&#21183;&#12290;&#30446;&#21069;&#26377;&#35768;&#22810;&#27169;&#22411;&#21487;&#29992;&#20110;&#20165;&#22522;&#20110;&#37329;&#34701;&#32452;&#25104;&#37096;&#20998;&#30340;&#21382;&#21490;&#25968;&#25454;&#39044;&#27979;&#37329;&#34701;&#24066;&#22330;&#65292;&#20294;&#23558;&#21382;&#21490;&#25968;&#25454;&#19982;Twitter&#31561;&#31038;&#20132;&#23186;&#20307;&#30340;&#26032;&#38395;&#21644;&#24086;&#23376;&#30456;&#32467;&#21512;&#26159;&#26412;&#30740;&#31350;&#30340;&#20027;&#35201;&#30446;&#26631;&#12290;&#32467;&#26524;&#26174;&#31034;&#23454;&#36136;&#24615;&#25913;&#36827;&#12290;&#26412;&#30740;&#31350;&#30340;&#20027;&#35201;&#29305;&#28857;&#21253;&#25324;&#65306;a&#65289;&#25552;&#20986;&#23436;&#20840;&#36890;&#29992;&#30340;&#31639;&#27861;&#65292;&#33021;&#22815;&#20026;&#20219;&#20309;Twitter&#24080;&#25143;&#21644;&#20219;&#20309;&#37329;&#34701;&#32452;&#20214;&#29983;&#25104;&#27169;&#22411;&#65292;b&#65289;&#39044;&#27979;&#25512;&#25991;&#23545;&#32929;&#20215;&#24433;&#21709;&#30340;&#26102;&#38388;&#31383;&#21475;&#65292;c&#65289;&#20998;&#26512;&#22810;&#20010;Twitter&#24080;&#25143;&#23545;&#39044;&#27979;&#36235;&#21183;&#30340;&#24433;&#21709;&#12290;&#24050;&#36827;&#34892;&#35814;&#23613;&#35843;&#26597;&#20197;&#25214;&#20986;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12161v1 Announce Type: cross  Abstract: Financial market like the price of stock, share, gold, oil, mutual funds are affected by the news and posts on social media. In this work deep learning based models are proposed to predict the trend of financial market based on NLP analysis of the twitter handles of leaders of different fields. There are many models available to predict financial market based on only the historical data of the financial component but combining historical data with news and posts of the social media like Twitter is the main objective of the present work. Substantial improvement is shown in the result. The main features of the present work are: a) proposing completely generalized algorithm which is able to generate models for any twitter handle and any financial component, b) predicting the time window for a tweets effect on a stock price c) analyzing the effect of multiple twitter handles for predicting the trend. A detailed survey is done to find out t
&lt;/p&gt;</description></item><item><title>&#24341;&#20837;&#19968;&#31181;&#26032;&#30340;&#23454;&#39564;&#26694;&#26550;&#29992;&#20110;&#35780;&#20272;&#20154;&#31867;&#26159;&#21542;&#36890;&#36807;&#20351;&#29992;AI&#21487;&#20197;&#20570;&#20986;&#26356;&#22909;&#30340;&#20915;&#31574;&#65292;&#22312;&#21333;&#30450;&#23454;&#39564;&#35774;&#35745;&#20013;&#27604;&#36739;&#20102;&#19977;&#31181;&#20915;&#31574;&#31995;&#32479;&#30340;&#34920;&#29616;</title><link>https://arxiv.org/abs/2403.12108</link><description>&lt;p&gt;
AI&#26159;&#21542;&#26377;&#21161;&#20110;&#20154;&#31867;&#20570;&#20986;&#26356;&#22909;&#30340;&#20915;&#31574;&#65311;&#19968;&#31181;&#29992;&#20110;&#23454;&#39564;&#35780;&#20272;&#30340;&#26041;&#27861;&#35770;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
Does AI help humans make better decisions? A methodological framework for experimental evaluation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12108
&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#19968;&#31181;&#26032;&#30340;&#23454;&#39564;&#26694;&#26550;&#29992;&#20110;&#35780;&#20272;&#20154;&#31867;&#26159;&#21542;&#36890;&#36807;&#20351;&#29992;AI&#21487;&#20197;&#20570;&#20986;&#26356;&#22909;&#30340;&#20915;&#31574;&#65292;&#22312;&#21333;&#30450;&#23454;&#39564;&#35774;&#35745;&#20013;&#27604;&#36739;&#20102;&#19977;&#31181;&#20915;&#31574;&#31995;&#32479;&#30340;&#34920;&#29616;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#31639;&#27861;&#30340;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#22312;&#24403;&#20170;&#31038;&#20250;&#21464;&#24471;&#26080;&#22788;&#19981;&#22312;&#12290;&#28982;&#32780;&#65292;&#22312;&#35768;&#22810;&#24773;&#20917;&#19979;&#65292;&#23588;&#20854;&#26159;&#24403;&#21033;&#30410;&#39640;&#26114;&#26102;&#65292;&#20154;&#31867;&#20173;&#28982;&#20316;&#20986;&#26368;&#32456;&#20915;&#31574;&#12290;&#22240;&#27492;&#65292;&#20851;&#38190;&#38382;&#39064;&#26159;AI&#26159;&#21542;&#26377;&#21161;&#20110;&#20154;&#31867;&#27604;&#21333;&#29420;&#30340;&#20154;&#31867;&#25110;&#21333;&#29420;&#30340;AI&#20570;&#20986;&#26356;&#22909;&#30340;&#20915;&#31574;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#35770;&#26694;&#26550;&#65292;&#29992;&#20110;&#23454;&#39564;&#24615;&#22320;&#22238;&#31572;&#36825;&#20010;&#38382;&#39064;&#65292;&#32780;&#19981;&#38656;&#35201;&#39069;&#22806;&#30340;&#20551;&#35774;&#12290;&#25105;&#20204;&#20351;&#29992;&#22522;&#20110;&#22522;&#20934;&#28508;&#22312;&#32467;&#26524;&#30340;&#26631;&#20934;&#20998;&#31867;&#25351;&#26631;&#27979;&#37327;&#20915;&#31574;&#32773;&#20570;&#20986;&#27491;&#30830;&#20915;&#31574;&#30340;&#33021;&#21147;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#21333;&#30450;&#23454;&#39564;&#35774;&#35745;&#65292;&#22312;&#36825;&#20010;&#35774;&#35745;&#20013;&#65292;&#25552;&#20379;AI&#29983;&#25104;&#30340;&#24314;&#35758;&#22312;&#19981;&#21516;&#26696;&#20363;&#20013;&#34987;&#38543;&#26426;&#20998;&#37197;&#32473;&#26368;&#32456;&#20915;&#31574;&#30340;&#20154;&#31867;&#12290;&#22312;&#36825;&#31181;&#23454;&#39564;&#35774;&#35745;&#19979;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#27604;&#36739;&#19977;&#31181;&#26367;&#20195;&#20915;&#31574;&#31995;&#32479;&#30340;&#24615;&#33021;--&#20165;&#20154;&#31867;&#12289;&#20154;&#31867;&#19982;AI&#12289;&#20165;AI&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12108v1 Announce Type: new  Abstract: The use of Artificial Intelligence (AI) based on data-driven algorithms has become ubiquitous in today's society. Yet, in many cases and especially when stakes are high, humans still make final decisions. The critical question, therefore, is whether AI helps humans make better decisions as compared to a human alone or AI an alone. We introduce a new methodological framework that can be used to answer experimentally this question with no additional assumptions. We measure a decision maker's ability to make correct decisions using standard classification metrics based on the baseline potential outcome. We consider a single-blinded experimental design, in which the provision of AI-generated recommendations is randomized across cases with a human making final decisions. Under this experimental design, we show how to compare the performance of three alternative decision-making systems--human-alone, human-with-AI, and AI-alone. We apply the pr
&lt;/p&gt;</description></item><item><title>&#20998;&#26512;&#20102;&#19981;&#21516;&#30340;&#25216;&#26415;&#36827;&#27493;&#22330;&#26223;&#23545;&#20154;&#24037;&#36890;&#29992;&#26234;&#33021;&#36807;&#28193;&#30340;&#24433;&#21709;&#65292;&#25506;&#35752;&#20102;&#33258;&#21160;&#21270;&#21644;&#36164;&#26412;&#31215;&#32047;&#20043;&#38388;&#30340;&#20851;&#31995;&#20197;&#21450;&#24037;&#36164;&#21464;&#21270;&#36235;&#21183;&#12290;</title><link>https://arxiv.org/abs/2403.12107</link><description>&lt;p&gt;
AGI&#36807;&#28193;&#22330;&#26223;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Scenarios for the Transition to AGI
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12107
&lt;/p&gt;
&lt;p&gt;
&#20998;&#26512;&#20102;&#19981;&#21516;&#30340;&#25216;&#26415;&#36827;&#27493;&#22330;&#26223;&#23545;&#20154;&#24037;&#36890;&#29992;&#26234;&#33021;&#36807;&#28193;&#30340;&#24433;&#21709;&#65292;&#25506;&#35752;&#20102;&#33258;&#21160;&#21270;&#21644;&#36164;&#26412;&#31215;&#32047;&#20043;&#38388;&#30340;&#20851;&#31995;&#20197;&#21450;&#24037;&#36164;&#21464;&#21270;&#36235;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20998;&#26512;&#20102;&#22312;&#21487;&#33021;&#23548;&#33268;&#20154;&#24037;&#36890;&#29992;&#26234;&#33021;&#65288;AGI&#65289;&#30340;&#25216;&#26415;&#36827;&#27493;&#19981;&#21516;&#22330;&#26223;&#19979;&#20135;&#20986;&#21644;&#24037;&#36164;&#30340;&#21464;&#21270;&#12290;&#22312;&#25105;&#20204;&#30340;&#20551;&#35774;&#20013;&#65292;&#20154;&#31867;&#24037;&#20316;&#21487;&#20197;&#20998;&#35299;&#20026;&#22312;&#22797;&#26434;&#24615;&#19978;&#19981;&#21516;&#30340;&#21407;&#23376;&#20219;&#21153;&#12290;&#25216;&#26415;&#30340;&#36827;&#27493;&#20351;&#24471;&#36234;&#26469;&#36234;&#22797;&#26434;&#30340;&#20219;&#21153;&#21487;&#20197;&#34987;&#33258;&#21160;&#21270;&#23454;&#29616;&#12290;&#24037;&#36164;&#30340;&#24433;&#21709;&#21462;&#20915;&#20110;&#33258;&#21160;&#21270;&#21644;&#36164;&#26412;&#31215;&#32047;&#20043;&#38388;&#30340;&#31454;&#36187;&#12290;&#22914;&#26524;&#20219;&#21153;&#22797;&#26434;&#24615;&#30340;&#20998;&#24067;&#21576;&#29616;&#20986;&#36275;&#22815;&#21402;&#30340;&#26080;&#38480;&#23614;&#37096;&#65292;&#37027;&#20040;&#23601;&#24635;&#26159;&#26377;&#36275;&#22815;&#30340;&#24037;&#20316;&#20379;&#20154;&#31867;&#20174;&#20107;&#65292;&#24037;&#36164;&#21487;&#33021;&#20250;&#26080;&#38480;&#19978;&#21319;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#22914;&#26524;&#20154;&#31867;&#21487;&#20197;&#25191;&#34892;&#30340;&#20219;&#21153;&#22797;&#26434;&#24615;&#26159;&#26377;&#30028;&#30340;&#65292;&#24182;&#19988;&#23436;&#20840;&#33258;&#21160;&#21270;&#34987;&#23454;&#29616;&#65292;&#37027;&#20040;&#24037;&#36164;&#20250;&#23849;&#28291;&#12290;&#20294;&#21363;&#20351;&#22312;&#36825;&#20043;&#21069;&#65292;&#22914;&#26524;&#22823;&#35268;&#27169;&#33258;&#21160;&#21270;&#36229;&#36234;&#20102;&#36164;&#26412;&#31215;&#32047;&#65292;&#21171;&#21160;&#21147;&#36807;&#20110;&#20016;&#23500;&#65292;&#24037;&#36164;&#21487;&#33021;&#20250;&#19979;&#38477;&#12290;&#33258;&#21160;&#21270;&#29983;&#20135;&#29575;&#30340;&#22686;&#38271;&#21487;&#33021;&#23548;&#33268;&#24191;&#27867;&#30340;&#21457;&#23637;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12107v1 Announce Type: cross  Abstract: We analyze how output and wages behave under different scenarios for technological progress that may culminate in Artificial General Intelligence (AGI), defined as the ability of AI systems to perform all tasks that humans can perform. We assume that human work can be decomposed into atomistic tasks that differ in their complexity. Advances in technology make ever more complex tasks amenable to automation. The effects on wages depend on a race between automation and capital accumulation. If the distribution of task complexity exhibits a sufficiently thick infinite tail, then there is always enough work for humans, and wages may rise forever. By contrast, if the complexity of tasks that humans can perform is bounded and full automation is reached, then wages collapse. But declines may occur even before if large-scale automation outpaces capital accumulation and makes labor too abundant. Automating productivity growth may lead to broad-b
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35752;&#35770;&#20102;&#22312;YUIMA&#20013;&#36890;&#36807;&#23398;&#29983;t-L&#233;vy&#36807;&#31243;&#39537;&#21160;&#30340;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#30340;&#20272;&#35745;&#21644;&#27169;&#25311;&#26041;&#27861;&#65292;&#24182;&#35299;&#20915;&#20102;&#27169;&#25311;&#39640;&#39057;&#29575;&#19979;&#26679;&#26412;&#36335;&#24452;&#21644;&#32852;&#21512;&#20272;&#35745;&#36235;&#21183;&#12289;&#26631;&#24230;&#21644;&#33258;&#30001;&#24230;&#30340;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2403.12078</link><description>&lt;p&gt;
&#23398;&#29983;t-L&#233;vy&#22238;&#24402;&#27169;&#22411;&#22312;YUIMA&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Student t-L\'evy regression model in YUIMA
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12078
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#22312;YUIMA&#20013;&#36890;&#36807;&#23398;&#29983;t-L&#233;vy&#36807;&#31243;&#39537;&#21160;&#30340;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#30340;&#20272;&#35745;&#21644;&#27169;&#25311;&#26041;&#27861;&#65292;&#24182;&#35299;&#20915;&#20102;&#27169;&#25311;&#39640;&#39057;&#29575;&#19979;&#26679;&#26412;&#36335;&#24452;&#21644;&#32852;&#21512;&#20272;&#35745;&#36235;&#21183;&#12289;&#26631;&#24230;&#21644;&#33258;&#30001;&#24230;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26088;&#22312;&#35752;&#35770;&#22312;\textsf{R}&#36719;&#20214;&#21253;YUIMA&#20013;&#30001;&#23398;&#29983;t-L&#233;vy&#36807;&#31243;&#39537;&#21160;&#30340;&#20855;&#26377;&#24658;&#23450;&#26631;&#24230;&#21644;&#20219;&#24847;&#33258;&#30001;&#24230;&#30340;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#30340;&#20272;&#35745;&#21644;&#27169;&#25311;&#26041;&#27861;&#12290;&#35813;&#36807;&#31243;&#22312;&#37329;&#34701;&#12289;&#29289;&#29702;&#12289;&#29983;&#29289;&#23398;&#31561;&#22810;&#20010;&#39046;&#22495;&#20013;&#37117;&#26377;&#24212;&#29992;&#12290;&#27169;&#22411;&#23384;&#22312;&#20004;&#20010;&#20027;&#35201;&#38382;&#39064;&#12290;&#31532;&#19968;&#20010;&#38382;&#39064;&#19982;&#22312;&#39640;&#39057;&#29575;&#27700;&#24179;&#27169;&#25311;&#26679;&#26412;&#36335;&#24452;&#26377;&#20851;&#65292;&#22240;&#20026;&#20165;&#22312;&#21333;&#20301;&#26102;&#38388;&#38388;&#38548;&#19978;&#23450;&#20041;&#30340;$t$-L&#233;vy&#22686;&#37327;&#25165;&#26381;&#20174;&#23398;&#29983;t&#20998;&#24067;&#12290;&#22312;YUIMA&#20013;&#65292;&#25105;&#20204;&#36890;&#36807;&#36870;Fourier&#21464;&#25442;&#26469;&#27169;&#25311;&#22312;&#20219;&#24847;&#38271;&#24230;&#38388;&#38548;&#19978;&#23450;&#20041;&#30340;&#23398;&#29983;t-L&#233;vy&#30340;&#22686;&#37327;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#31532;&#20108;&#20010;&#38382;&#39064;&#26159;&#30001;&#20110;&#23578;&#26410;&#23545;&#36235;&#21183;&#12289;&#26631;&#24230;&#21644;&#33258;&#30001;&#24230;&#30340;&#32852;&#21512;&#20272;&#35745;&#36827;&#34892;&#30740;&#31350;&#12290;&#22312;YUIMA&#20013;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#26377;&#25928;&#22788;&#29702;&#36825;&#20010;&#38382;&#39064;&#30340;&#20004;&#27493;&#20272;&#35745;&#31243;&#24207;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12078v1 Announce Type: cross  Abstract: The aim of this paper is to discuss an estimation and a simulation method in the \textsf{R} package YUIMA for a linear regression model driven by a Student-$t$ L\'evy process with constant scale and arbitrary degrees of freedom. This process finds applications in several fields, for example finance, physic, biology, etc. The model presents two main issues. The first is related to the simulation of a sample path at high-frequency level. Indeed, only the $t$-L\'evy increments defined on an unitary time interval are Student-$t$ distributed. In YUIMA, we solve this problem by means of the inverse Fourier transform for simulating the increments of a Student-$t$ L\'{e}vy defined on a interval with any length. A second problem is due to the fact that joint estimation of trend, scale, and degrees of freedom does not seem to have been investigated as yet. In YUIMA, we develop a two-step estimation procedure that efficiently deals with this issu
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#32773;&#27169;&#25311;&#20102;&#20004;&#20010;&#20998;&#23618;&#27700;&#24211;&#30340;&#28909;&#32467;&#26500;&#20197;&#25506;&#35752;&#27946;&#27700;&#26102;&#27700;&#36136;&#30340;&#21464;&#21270;&#65292;&#21457;&#29616;&#27946;&#27700;&#26399;&#38388;&#27969;&#37327;&#22686;&#21152;&#21487;&#33021;&#36896;&#25104;&#27700;&#36136;&#24694;&#21270;&#21644;&#28342;&#35299;&#27687;&#21547;&#37327;&#19979;&#38477;&#12290;</title><link>https://arxiv.org/abs/2403.05671</link><description>&lt;p&gt;
&#22522;&#20110;&#27946;&#27700;&#21644;&#20837;&#27969;&#27874;&#21160;&#30340;&#27700;&#24211;&#27700;&#36136;&#21464;&#21270;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Investigating Changes of Water Quality in Reservoirs based on Flood and Inflow Fluctuations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05671
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#32773;&#27169;&#25311;&#20102;&#20004;&#20010;&#20998;&#23618;&#27700;&#24211;&#30340;&#28909;&#32467;&#26500;&#20197;&#25506;&#35752;&#27946;&#27700;&#26102;&#27700;&#36136;&#30340;&#21464;&#21270;&#65292;&#21457;&#29616;&#27946;&#27700;&#26399;&#38388;&#27969;&#37327;&#22686;&#21152;&#21487;&#33021;&#36896;&#25104;&#27700;&#36136;&#24694;&#21270;&#21644;&#28342;&#35299;&#27687;&#21547;&#37327;&#19979;&#38477;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27700;&#28201;&#21644;&#28342;&#35299;&#27687;&#26159;&#27700;&#36136;&#21644;&#29983;&#24577;&#31995;&#32479;&#21487;&#25345;&#32493;&#24615;&#30340;&#37325;&#35201;&#25351;&#26631;&#12290;&#36817;&#24180;&#26469;&#65292;&#39057;&#32321;&#19988;&#24378;&#28872;&#30340;&#26292;&#38632;&#39057;&#32321;&#21457;&#29983;&#65292;&#36890;&#36807;&#24613;&#21095;&#22686;&#21152;&#31216;&#20026;&#26292;&#27946;&#30340;&#20837;&#27969;&#37327;&#65292;&#23545;&#27700;&#20307;&#30340;&#28909;&#32467;&#26500;&#21644;&#28151;&#21512;&#23618;&#28145;&#24230;&#20135;&#29983;&#24433;&#21709;&#12290;&#26292;&#27946;&#21487;&#20197;&#30001;&#31361;&#21457;&#30340;&#24378;&#38477;&#27700;&#20107;&#20214;&#22312;&#20960;&#20998;&#38047;&#25110;&#20960;&#23567;&#26102;&#20869;&#21457;&#23637;&#32780;&#25104;&#12290;&#30001;&#20110;&#22823;&#37327;&#26434;&#29289;&#21644;&#24555;&#36895;&#27969;&#21160;&#30340;&#27700;&#20307;&#65292;&#36825;&#31181;&#29616;&#35937;&#23545;&#27700;&#36136;&#26377;&#26174;&#30528;&#24433;&#21709;&#12290;&#27946;&#27700;&#26399;&#38388;&#27969;&#37327;&#36739;&#22823;&#21487;&#33021;&#20250;&#24694;&#21270;&#28909;&#23618;&#20998;&#23618;&#65288;&#20855;&#26377;&#19981;&#21516;&#23494;&#24230;&#23618;&#65289;&#30340;&#27700;&#20307;&#36136;&#37327;&#65292;&#24182;&#38477;&#20302;&#28342;&#35299;&#27687;&#21547;&#37327;&#12290;&#28982;&#32780;&#65292;&#30446;&#21069;&#23578;&#19981;&#28165;&#26970;&#36825;&#20123;&#21442;&#25968;&#33021;&#22810;&#22909;&#22320;&#20195;&#34920;&#28246;&#27850;&#23545;&#20307;&#37327;&#25490;&#25918;&#21464;&#21270;&#30340;&#21709;&#24212;&#12290;&#20026;&#35299;&#20915;&#36825;&#19968;&#38382;&#39064;&#65292;&#30740;&#31350;&#20154;&#21592;&#27169;&#25311;&#20102;&#32771;&#34385;&#25289;&#36158;&#28085;&#20859;&#24211;&#20026;&#20195;&#34920;&#30340;&#20004;&#20010;&#20998;&#23618;&#27700;&#24211;&#30340;&#28909;&#32467;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05671v1 Announce Type: new  Abstract: Water temperature and dissolved oxygen are essential indicators of water quality and ecosystem sustainability. Lately, heavy rainfalls are happening frequently and forcefully affecting the thermal structure and mixing layers in depth by sharply increasing the volume of inflow entitled flash flood. It can occur by sudden intense precipitation and develop within minutes or hours. Because of heavy debris load and speedy water, this phenomenon has remarkable effects on water quality. A higher flow during floods may worsens water quality at lakes and reservoirs that are thermally stratified (with separate density layers) and decrease dissolved oxygen content. However, it is unclear how well these parameters represent the response of lakes to changes in volume discharge. To address this question, researchers simulate the thermal structure in two stratified reservoirs, considering the Rajae reservoir as a representative reservoir in the north o
&lt;/p&gt;</description></item><item><title>&#20351;&#29992;&#27531;&#24046;U-net&#32467;&#21512;&#33258;&#27880;&#24847;&#21147;&#26426;&#21046;&#25104;&#21151;&#35299;&#20915;&#20102;&#22810;&#26234;&#33021;&#20307;&#26102;&#38388;&#19968;&#33268;&#26368;&#20248;&#20132;&#26131;&#25191;&#34892;&#38382;&#39064;&#65292;&#20811;&#26381;&#20102;&#20256;&#32479;&#26377;&#38480;&#24046;&#20998;&#26041;&#27861;&#30340;&#23616;&#38480;&#24615;&#12290;</title><link>https://arxiv.org/abs/2312.09353</link><description>&lt;p&gt;
&#20351;&#29992;&#24102;&#33258;&#27880;&#24847;&#21147;&#26426;&#21046;&#30340;&#27531;&#24046;U-net&#35299;&#20915;&#22810;&#26234;&#33021;&#20307;&#26102;&#38388;&#19968;&#33268;&#26368;&#20248;&#20132;&#26131;&#25191;&#34892;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Residual U-net with Self-Attention to Solve Multi-Agent Time-Consistent Optimal Trade Execution
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.09353
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#27531;&#24046;U-net&#32467;&#21512;&#33258;&#27880;&#24847;&#21147;&#26426;&#21046;&#25104;&#21151;&#35299;&#20915;&#20102;&#22810;&#26234;&#33021;&#20307;&#26102;&#38388;&#19968;&#33268;&#26368;&#20248;&#20132;&#26131;&#25191;&#34892;&#38382;&#39064;&#65292;&#20811;&#26381;&#20102;&#20256;&#32479;&#26377;&#38480;&#24046;&#20998;&#26041;&#27861;&#30340;&#23616;&#38480;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;&#20351;&#29992;&#24102;&#33258;&#27880;&#24847;&#21147;&#26426;&#21046;&#30340;&#28145;&#24230;&#27531;&#24046;U-net&#26469;&#35299;&#20915;&#22810;&#26234;&#33021;&#20307;&#21644;&#36164;&#20135;&#30340;&#36830;&#32493;&#26102;&#38388;&#19968;&#33268;&#22343;&#20540;&#26041;&#24046;&#26368;&#20248;&#20132;&#26131;&#25191;&#34892;&#38382;&#39064;&#12290;&#38024;&#23545;&#26377;&#38480;&#26102;&#38388;&#27573;&#65292;&#25105;&#20204;&#23558;&#26102;&#38388;&#19968;&#33268;&#22343;&#20540;&#26041;&#24046;&#26368;&#20248;&#20132;&#26131;&#25191;&#34892;&#38382;&#39064;&#21046;&#23450;&#20026;Almgren-Chriss&#27169;&#22411;&#19979;&#30340;Hamilton-Jacobi-Bellman&#65288;HJB&#65289;&#26041;&#31243;&#12290;&#25105;&#20204;&#23558;&#24050;&#30693;&#20855;&#26377;&#31896;&#24615;&#35299;&#30340;HJB&#20844;&#24335;&#37325;&#26032;&#21046;&#23450;&#20026;&#21521;&#21518;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65288;BSDE&#65289;&#20197;&#23558;&#38382;&#39064;&#25193;&#23637;&#21040;&#22810;&#26234;&#33021;&#20307;&#21644;&#36164;&#20135;&#12290;&#25105;&#20204;&#21033;&#29992;&#24102;&#33258;&#27880;&#24847;&#21147;&#26426;&#21046;&#30340;&#27531;&#24046;U-net&#26469;&#25968;&#20540;&#36817;&#20284;&#22810;&#26234;&#33021;&#20307;&#21644;&#36164;&#20135;&#30340;&#20215;&#20540;&#20989;&#25968;&#65292;&#35813;&#20989;&#25968;&#21487;&#29992;&#20110;&#30830;&#23450;&#26102;&#38388;&#19968;&#33268;&#26368;&#20248;&#25511;&#21046;&#12290;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25152;&#25552;&#20986;&#30340;&#31070;&#32463;&#32593;&#32476;&#26041;&#27861;&#20811;&#26381;&#20102;&#26377;&#38480;&#24046;&#20998;&#26041;&#27861;&#30340;&#23616;&#38480;&#24615;&#12290;&#25105;&#20204;&#36890;&#36807;&#23545;&#32467;&#26524;&#36827;&#34892;&#39564;&#35777;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.09353v2 Announce Type: replace  Abstract: In this paper, we explore the use of a deep residual U-net with self-attention to solve the the continuous time time-consistent mean variance optimal trade execution problem for multiple agents and assets. Given a finite horizon we formulate the time-consistent mean-variance optimal trade execution problem following the Almgren-Chriss model as a Hamilton-Jacobi-Bellman (HJB) equation. The HJB formulation is known to have a viscosity solution to the unknown value function. We reformulate the HJB to a backward stochastic differential equation (BSDE) to extend the problem to multiple agents and assets. We utilize a residual U-net with self-attention to numerically approximate the value function for multiple agents and assets which can be used to determine the time-consistent optimal control. In this paper, we show that the proposed neural network approach overcomes the limitations of finite difference methods. We validate our results an
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#21033;&#29992;&#22343;&#22330;&#31070;&#32463;&#32593;&#32476;&#31867;&#35299;&#20915;McKean-Vlasov&#25511;&#21046;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#22810;&#31181;&#31639;&#27861;&#65292;&#24182;&#22312;&#19981;&#21516;&#31034;&#20363;&#19978;&#23637;&#31034;&#20102;&#25968;&#20540;&#32467;&#26524;&#65292;&#35752;&#35770;&#27604;&#36739;&#20102;&#21508;&#31181;&#26041;&#27861;&#30340;&#20248;&#32570;&#28857;&#12290;</title><link>https://arxiv.org/abs/2212.11518</link><description>&lt;p&gt;
&#22522;&#20110;&#22343;&#22330;&#31070;&#32463;&#32593;&#32476;&#30340;McKean-Vlasov&#25511;&#21046;&#38382;&#39064;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Mean-field neural networks-based algorithms for McKean-Vlasov control problems *
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2212.11518
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#21033;&#29992;&#22343;&#22330;&#31070;&#32463;&#32593;&#32476;&#31867;&#35299;&#20915;McKean-Vlasov&#25511;&#21046;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#22810;&#31181;&#31639;&#27861;&#65292;&#24182;&#22312;&#19981;&#21516;&#31034;&#20363;&#19978;&#23637;&#31034;&#20102;&#25968;&#20540;&#32467;&#26524;&#65292;&#35752;&#35770;&#27604;&#36739;&#20102;&#21508;&#31181;&#26041;&#27861;&#30340;&#20248;&#32570;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#33268;&#21147;&#20110;&#36890;&#36807;&#25105;&#20204;&#22312;&#20276;&#38543;&#35770;&#25991;[25]&#20013;&#24341;&#20837;&#30340;&#22343;&#22330;&#31070;&#32463;&#32593;&#32476;&#31867;&#65292;&#23545;McKean-Vlasov&#25511;&#21046;&#38382;&#39064;&#36827;&#34892;&#25968;&#20540;&#35299;&#26512;&#65292;&#20197;&#20415;&#22312;Wasserstein&#31354;&#38388;&#19978;&#23398;&#20064;&#35299;&#20915;&#26041;&#26696;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20960;&#31181;&#31639;&#27861;&#65292;&#22522;&#20110;&#25511;&#21046;&#23398;&#20064;&#31574;&#30053;&#25110;&#20540;&#36845;&#20195;&#30340;&#21160;&#24577;&#35268;&#21010;&#65292;&#25110;&#32773;&#22522;&#20110;&#38543;&#26426;&#26368;&#22823;&#21407;&#29702;&#21644;&#20840;&#23616;&#25110;&#23616;&#37096;&#25439;&#22833;&#20989;&#25968;&#30340;&#21453;&#21521;SDE&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#23545;&#19981;&#21516;&#31034;&#20363;&#30340;&#22823;&#37327;&#25968;&#20540;&#32467;&#26524;&#65292;&#20197;&#35828;&#26126;&#25105;&#20204;&#30340;&#20843;&#31181;&#31639;&#27861;&#27599;&#19968;&#31181;&#30340;&#20934;&#30830;&#24615;&#12290;&#25105;&#20204;&#35752;&#35770;&#24182;&#27604;&#36739;&#20102;&#25152;&#26377;&#27979;&#35797;&#26041;&#27861;&#30340;&#20248;&#32570;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2212.11518v2 Announce Type: replace-cross  Abstract: This paper is devoted to the numerical resolution of McKean-Vlasov control problems via the class of mean-field neural networks introduced in our companion paper [25] in order to learn the solution on the Wasserstein space. We propose several algorithms either based on dynamic programming with control learning by policy or value iteration, or backward SDE from stochastic maximum principle with global or local loss functions. Extensive numerical results on different examples are presented to illustrate the accuracy of each of our eight algorithms. We discuss and compare the pros and cons of all the tested methods.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#19978;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65288;LPs&#65289;&#39057;&#32321;&#26356;&#26032;&#20301;&#32622;&#23545;&#24066;&#22330;&#27969;&#21160;&#24615;&#38598;&#20013;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#26356;&#39640;&#30340;&#37325;&#26032;&#23450;&#20301;&#24378;&#24230;&#21644;&#31934;&#24230;&#20250;&#23548;&#33268;&#26356;&#22823;&#30340;&#27969;&#21160;&#24615;&#38598;&#20013;&#65292;&#20174;&#32780;&#20943;&#23569;&#23567;&#39069;&#20132;&#26131;&#30340;&#28369;&#28857;&#12290;</title><link>http://arxiv.org/abs/2306.17742</link><description>&lt;p&gt;
&#21306;&#22359;&#38142;&#30340;&#25193;&#23481;&#21644;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#19978;&#30340;&#27969;&#21160;&#24615;&#38598;&#20013;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Blockchain scaling and liquidity concentration on decentralized exchanges. (arXiv:2306.17742v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.17742
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#19978;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65288;LPs&#65289;&#39057;&#32321;&#26356;&#26032;&#20301;&#32622;&#23545;&#24066;&#22330;&#27969;&#21160;&#24615;&#38598;&#20013;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#26356;&#39640;&#30340;&#37325;&#26032;&#23450;&#20301;&#24378;&#24230;&#21644;&#31934;&#24230;&#20250;&#23548;&#33268;&#26356;&#22823;&#30340;&#27969;&#21160;&#24615;&#38598;&#20013;&#65292;&#20174;&#32780;&#20943;&#23569;&#23567;&#39069;&#20132;&#26131;&#30340;&#28369;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#19978;&#30340;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65288;LPs&#65289;&#21487;&#20197;&#36890;&#36807;&#26356;&#39057;&#32321;&#22320;&#26356;&#26032;&#20854;&#20301;&#32622;&#26469;&#20445;&#25252;&#33258;&#24049;&#20813;&#21463;&#36870;&#21521;&#36873;&#25321;&#39118;&#38505;&#30340;&#24433;&#21709;&#12290;&#28982;&#32780;&#65292;&#37325;&#26032;&#23450;&#20301;&#26159;&#26114;&#36149;&#30340;&#65292;&#22240;&#20026;LPs&#24517;&#39035;&#20026;&#27599;&#27425;&#26356;&#26032;&#25903;&#20184;&#29123;&#27668;&#36153;&#29992;&#12290;&#25105;&#20204;&#20351;&#29992;&#19968;&#20010;&#21306;&#22359;&#38142;&#25193;&#23481;&#35299;&#20915;&#26041;&#26696;Polygon&#30340;&#36827;&#20837;&#20316;&#20026;&#25105;&#20204;&#30340;&#24037;&#20855;&#65292;&#20998;&#26512;&#20102;&#37325;&#26032;&#23450;&#20301;&#19982;&#24066;&#22330;&#20215;&#26684;&#21608;&#22260;&#30340;&#27969;&#21160;&#24615;&#38598;&#20013;&#20043;&#38388;&#30340;&#22240;&#26524;&#20851;&#31995;&#12290;Polygon&#30340;&#20302;&#29123;&#27668;&#36153;&#29992;&#20351;&#24471;LPs&#33021;&#22815;&#27604;&#22312;&#20197;&#22826;&#22346;&#19978;&#26356;&#39057;&#32321;&#22320;&#36827;&#34892;&#26356;&#26032;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#26356;&#39640;&#30340;&#37325;&#26032;&#23450;&#20301;&#24378;&#24230;&#21644;&#31934;&#24230;&#23548;&#33268;&#26356;&#22823;&#30340;&#27969;&#21160;&#24615;&#38598;&#20013;&#65292;&#36825;&#26377;&#21033;&#20110;&#23567;&#39069;&#20132;&#26131;&#36890;&#36807;&#20943;&#23569;&#28369;&#28857;&#26469;&#21463;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;
Liquidity providers (LPs) on decentralized exchanges (DEXs) can protect themselves from adverse selection risk by updating their positions more frequently. However, repositioning is costly, because LPs have to pay gas fees for each update. We analyze the causal relation between repositioning and liquidity concentration around the market price, using the entry of a blockchain scaling solution, Polygon, as our instrument. Polygon's lower gas fees allow LPs to update more frequently than on Ethereum. Our results demonstrate that higher repositioning intensity and precision lead to greater liquidity concentration, which benefits small trades by reducing their slippage.
&lt;/p&gt;</description></item></channel></rss>