<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#36825;&#39033;&#30740;&#31350;&#31995;&#32479;&#22320;&#30740;&#31350;&#20102;Liquid Staking Derivatives (LSDs)&#30340;&#26464;&#26438;&#36136;&#25276;&#26426;&#20250;&#19982;&#39118;&#38505;&#12290;&#20182;&#20204;&#21457;&#29616;&#26464;&#26438;&#36136;&#25276;&#22312;Lido-Aave&#29983;&#24577;&#31995;&#32479;&#20013;&#33021;&#22815;&#23454;&#29616;&#36739;&#39640;&#30340;&#22238;&#25253;&#65292;&#24182;&#26377;&#28508;&#21147;&#36890;&#36807;&#20248;&#21270;&#31574;&#30053;&#33719;&#24471;&#26356;&#22810;&#25910;&#30410;&#12290;</title><link>http://arxiv.org/abs/2401.08610</link><description>&lt;p&gt;
&#20351;&#29992;Liquid Staking Derivatives (LSDs)&#36827;&#34892;&#26464;&#26438;&#36136;&#25276;: &#26426;&#20250;&#19982;&#39118;&#38505;
&lt;/p&gt;
&lt;p&gt;
Leverage Staking with Liquid Staking Derivatives (LSDs): Opportunities and Risks. (arXiv:2401.08610v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.08610
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#31995;&#32479;&#22320;&#30740;&#31350;&#20102;Liquid Staking Derivatives (LSDs)&#30340;&#26464;&#26438;&#36136;&#25276;&#26426;&#20250;&#19982;&#39118;&#38505;&#12290;&#20182;&#20204;&#21457;&#29616;&#26464;&#26438;&#36136;&#25276;&#22312;Lido-Aave&#29983;&#24577;&#31995;&#32479;&#20013;&#33021;&#22815;&#23454;&#29616;&#36739;&#39640;&#30340;&#22238;&#25253;&#65292;&#24182;&#26377;&#28508;&#21147;&#36890;&#36807;&#20248;&#21270;&#31574;&#30053;&#33719;&#24471;&#26356;&#22810;&#25910;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Lido&#26159;&#20197;&#22826;&#22346;&#19978;&#26368;&#20027;&#35201;&#30340;Liquid Staking Derivative (LSD)&#25552;&#20379;&#21830;&#65292;&#20801;&#35768;&#29992;&#25143;&#25269;&#25276;&#20219;&#24847;&#25968;&#37327;&#30340;ETH&#26469;&#33719;&#24471;stETH&#65292;&#36825;&#21487;&#20197;&#19982;DeFi&#21327;&#35758;&#22914;Aave&#36827;&#34892;&#25972;&#21512;&#12290;Lido&#19982;Aave&#20043;&#38388;&#30340;&#20114;&#36890;&#24615;&#20351;&#24471;&#19968;&#31181;&#26032;&#22411;&#31574;&#30053;&#8220;&#26464;&#26438;&#36136;&#25276;&#8221;&#24471;&#20197;&#23454;&#29616;&#65292;&#29992;&#25143;&#22312;Lido&#19978;&#36136;&#25276;ETH&#33719;&#21462;stETH&#65292;&#23558;stETH&#20316;&#20026;Aave&#19978;&#30340;&#25269;&#25276;&#21697;&#20511;&#20837;ETH&#65292;&#28982;&#21518;&#23558;&#20511;&#20837;&#30340;ETH&#37325;&#26032;&#25237;&#20837;Lido&#12290;&#29992;&#25143;&#21487;&#20197;&#36845;&#20195;&#25191;&#34892;&#27492;&#36807;&#31243;&#65292;&#26681;&#25454;&#33258;&#24049;&#30340;&#39118;&#38505;&#20559;&#22909;&#26469;&#20248;&#21270;&#28508;&#22312;&#22238;&#25253;&#12290;&#26412;&#25991;&#31995;&#32479;&#22320;&#30740;&#31350;&#20102;&#26464;&#26438;&#36136;&#25276;&#25152;&#28041;&#21450;&#30340;&#26426;&#20250;&#21644;&#39118;&#38505;&#12290;&#25105;&#20204;&#26159;&#31532;&#19968;&#20010;&#22312;Lido-Aave&#29983;&#24577;&#31995;&#32479;&#20013;&#23545;&#26464;&#26438;&#36136;&#25276;&#31574;&#30053;&#36827;&#34892;&#24418;&#24335;&#21270;&#30340;&#30740;&#31350;&#12290;&#25105;&#20204;&#30340;&#32463;&#39564;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#20197;&#22826;&#22346;&#19978;&#26377;262&#20010;&#26464;&#26438;&#36136;&#25276;&#22836;&#23544;&#65292;&#24635;&#36136;&#25276;&#37329;&#39069;&#20026;295,243 ETH&#65288;482M USD&#65289;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;90.13%&#30340;&#26464;&#26438;&#36136;&#25276;&#22836;&#23544;&#23454;&#29616;&#20102;&#27604;&#20256;&#32479;&#36136;&#25276;&#26356;&#39640;&#30340;&#22238;&#25253;&#12290;
&lt;/p&gt;
&lt;p&gt;
Lido, the leading Liquid Staking Derivative (LSD) provider on Ethereum, allows users to stake an arbitrary amount of ETH to receive stETH, which can be integrated with Decentralized Finance (DeFi) protocols such as Aave. The composability between Lido and Aave enables a novel strategy called "leverage staking", where users stake ETH on Lido to acquire stETH, utilize stETH as collateral on Aave to borrow ETH, and then restake the borrowed ETH on Lido. Users can iteratively execute this process to optimize potential returns based on their risk profile.  This paper systematically studies the opportunities and risks associated with leverage staking. We are the first to formalize the leverage staking strategy within the Lido-Aave ecosystem. Our empirical study identifies 262 leverage staking positions on Ethereum, with an aggregated staking amount of 295,243 ETH (482M USD). We discover that 90.13% of leverage staking positions have achieved higher returns than conventional staking. Furtherm
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#26469;&#35299;&#20915;ESG&#25237;&#36164;&#20013;&#30340;&#19981;&#30830;&#23450;&#24615;&#38382;&#39064;&#12290;&#36890;&#36807;&#24320;&#21457;ESG&#38598;&#21512;&#31574;&#30053;&#21644;&#23558;ESG&#35780;&#20998;&#25972;&#21512;&#21040;&#24378;&#21270;&#23398;&#20064;&#27169;&#22411;&#20013;&#65292;&#30740;&#31350;&#25552;&#20379;&#20102;&#37327;&#36523;&#23450;&#21046;&#30340;&#25237;&#36164;&#31574;&#30053;&#65292;&#24182;&#24341;&#20837;&#20102;&#21452;&#25928;&#22343;&#20540;&#26041;&#24046;&#27169;&#22411;&#26469;&#20998;&#31867;&#25237;&#36164;&#32773;&#12290;&#27492;&#22806;&#65292;&#24341;&#20837;ESG&#35843;&#25972;&#30340;CAPM&#27169;&#22411;&#35780;&#20272;&#20248;&#21270;&#25237;&#36164;&#32452;&#21512;&#30340;&#34920;&#29616;&#12290;&#26368;&#32456;&#65292;&#35813;&#26041;&#27861;&#20026;&#25237;&#36164;&#32773;&#25552;&#20379;&#20102;&#23548;&#33322;ESG&#35780;&#32423;&#22266;&#26377;&#27169;&#31946;&#24615;&#30340;&#24037;&#20855;&#65292;&#24110;&#21161;&#20570;&#20986;&#26356;&#26126;&#26234;&#30340;&#25237;&#36164;&#20915;&#31574;&#12290;</title><link>http://arxiv.org/abs/2310.02163</link><description>&lt;p&gt;
&#22312;ESG&#25237;&#36164;&#20013;&#23548;&#33322;&#19981;&#30830;&#23450;&#24615;
&lt;/p&gt;
&lt;p&gt;
Navigating Uncertainty in ESG Investing. (arXiv:2310.02163v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.02163
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#26469;&#35299;&#20915;ESG&#25237;&#36164;&#20013;&#30340;&#19981;&#30830;&#23450;&#24615;&#38382;&#39064;&#12290;&#36890;&#36807;&#24320;&#21457;ESG&#38598;&#21512;&#31574;&#30053;&#21644;&#23558;ESG&#35780;&#20998;&#25972;&#21512;&#21040;&#24378;&#21270;&#23398;&#20064;&#27169;&#22411;&#20013;&#65292;&#30740;&#31350;&#25552;&#20379;&#20102;&#37327;&#36523;&#23450;&#21046;&#30340;&#25237;&#36164;&#31574;&#30053;&#65292;&#24182;&#24341;&#20837;&#20102;&#21452;&#25928;&#22343;&#20540;&#26041;&#24046;&#27169;&#22411;&#26469;&#20998;&#31867;&#25237;&#36164;&#32773;&#12290;&#27492;&#22806;&#65292;&#24341;&#20837;ESG&#35843;&#25972;&#30340;CAPM&#27169;&#22411;&#35780;&#20272;&#20248;&#21270;&#25237;&#36164;&#32452;&#21512;&#30340;&#34920;&#29616;&#12290;&#26368;&#32456;&#65292;&#35813;&#26041;&#27861;&#20026;&#25237;&#36164;&#32773;&#25552;&#20379;&#20102;&#23548;&#33322;ESG&#35780;&#32423;&#22266;&#26377;&#27169;&#31946;&#24615;&#30340;&#24037;&#20855;&#65292;&#24110;&#21161;&#20570;&#20986;&#26356;&#26126;&#26234;&#30340;&#25237;&#36164;&#20915;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25237;&#36164;&#32773;&#23545;&#35780;&#32423;&#26426;&#26500;&#23545;&#29615;&#22659;&#12289;&#31038;&#20250;&#21644;&#20844;&#21496;&#27835;&#29702;(ESG)&#25152;&#20998;&#37197;&#30340;&#25490;&#21517;&#26222;&#36941;&#23384;&#22312;&#22256;&#24785;&#65292;&#20984;&#26174;&#20986;&#21487;&#25345;&#32493;&#25237;&#36164;&#20013;&#30340;&#19968;&#20010;&#20851;&#38190;&#38382;&#39064;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#31181;&#19981;&#30830;&#23450;&#24615;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#19981;&#20165;&#21487;&#35782;&#21035;&#20986;&#36825;&#31181;&#27169;&#31946;&#24615;&#65292;&#32780;&#19988;&#20026;&#19981;&#21516;&#25237;&#36164;&#32773;&#25552;&#20379;&#37327;&#36523;&#23450;&#21046;&#30340;&#25237;&#36164;&#31574;&#30053;&#12290;&#36890;&#36807;&#24320;&#21457;ESG&#38598;&#21512;&#31574;&#30053;&#65292;&#24182;&#23558;ESG&#35780;&#20998;&#25972;&#21512;&#21040;&#24378;&#21270;&#23398;&#20064;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#26088;&#22312;&#20248;&#21270;&#26082;&#33021;&#33719;&#24471;&#37329;&#34701;&#22238;&#25253;&#21448;&#33021;&#20851;&#27880;ESG&#30446;&#26631;&#30340;&#25237;&#36164;&#32452;&#21512;&#12290;&#27492;&#22806;&#65292;&#36890;&#36807;&#25552;&#20986;&#21452;&#25928;&#22343;&#20540;&#26041;&#24046;&#27169;&#22411;&#65292;&#25105;&#20204;&#22522;&#20110;&#39118;&#38505;&#20559;&#22909;&#23545;&#25237;&#36164;&#32773;&#36827;&#34892;&#20998;&#31867;&#12290;&#25105;&#20204;&#36824;&#24341;&#20837;&#20102;ESG&#35843;&#25972;&#30340;&#36164;&#26412;&#36164;&#20135;&#23450;&#20215;&#27169;&#22411;(CAPM)&#26469;&#35780;&#20272;&#36825;&#20123;&#20248;&#21270;&#25237;&#36164;&#32452;&#21512;&#30340;&#34920;&#29616;&#12290;&#26368;&#32456;&#65292;&#25105;&#20204;&#32508;&#21512;&#30340;&#26041;&#27861;&#20026;&#25237;&#36164;&#32773;&#25552;&#20379;&#20102;&#23548;&#33322;ESG&#35780;&#32423;&#22266;&#26377;&#27169;&#31946;&#24615;&#30340;&#24037;&#20855;&#65292;&#20419;&#36827;&#26356;&#26126;&#26234;&#30340;&#25237;&#36164;&#20915;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;
The widespread confusion among investors regarding Environmental, Social, and Governance (ESG) rankings assigned by rating agencies has underscored a critical issue in sustainable investing. To address this uncertainty, our research has devised methods that not only recognize this ambiguity but also offer tailored investment strategies for different investor profiles. By developing ESG ensemble strategies and integrating ESG scores into a Reinforcement Learning (RL) model, we aim to optimize portfolios that cater to both financial returns and ESG-focused outcomes. Additionally, by proposing the Double-Mean-Variance model, we classify three types of investors based on their risk preferences. We also introduce ESG-adjusted Capital Asset Pricing Models (CAPMs) to assess the performance of these optimized portfolios. Ultimately, our comprehensive approach provides investors with tools to navigate the inherent ambiguities of ESG ratings, facilitating more informed investment decisions.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22810;&#20010;&#25237;&#36164;&#32773;&#22312;&#21021;&#22987;&#36130;&#23500;&#12289;&#39118;&#38505;&#35268;&#36991;&#21442;&#25968;&#20197;&#21450;&#32456;&#27490;&#26102;&#38388;&#30340;&#38543;&#26426;&#36127;&#20538;&#26041;&#38754;&#23384;&#22312;&#24046;&#24322;&#26102;&#30340;&#22343;&#34913;&#20215;&#26684;&#24418;&#25104;&#38382;&#39064;&#65292;&#36890;&#36807;&#19968;&#20010;&#26032;&#30340;&#22343;&#22330;&#21453;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65288;BSDE&#65289;&#30340;&#35299;&#26469;&#34920;&#24449;&#39118;&#38505;&#32929;&#31080;&#30340;&#22343;&#34913;&#39118;&#38505;&#28322;&#20215;&#36807;&#31243;&#65292;&#24182;&#35777;&#26126;&#20854;&#28165;&#38500;&#24066;&#22330;&#12290;</title><link>http://arxiv.org/abs/2304.07108</link><description>&lt;p&gt;
&#24102;&#25351;&#25968;&#25928;&#29992;&#20989;&#25968;&#30340;&#22343;&#20540;&#22330;&#22343;&#34913;&#20215;&#26684;&#24418;&#25104;
&lt;/p&gt;
&lt;p&gt;
Mean-field equilibrium price formation with exponential utility. (arXiv:2304.07108v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.07108
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22810;&#20010;&#25237;&#36164;&#32773;&#22312;&#21021;&#22987;&#36130;&#23500;&#12289;&#39118;&#38505;&#35268;&#36991;&#21442;&#25968;&#20197;&#21450;&#32456;&#27490;&#26102;&#38388;&#30340;&#38543;&#26426;&#36127;&#20538;&#26041;&#38754;&#23384;&#22312;&#24046;&#24322;&#26102;&#30340;&#22343;&#34913;&#20215;&#26684;&#24418;&#25104;&#38382;&#39064;&#65292;&#36890;&#36807;&#19968;&#20010;&#26032;&#30340;&#22343;&#22330;&#21453;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65288;BSDE&#65289;&#30340;&#35299;&#26469;&#34920;&#24449;&#39118;&#38505;&#32929;&#31080;&#30340;&#22343;&#34913;&#39118;&#38505;&#28322;&#20215;&#36807;&#31243;&#65292;&#24182;&#35777;&#26126;&#20854;&#28165;&#38500;&#24066;&#22330;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22810;&#20301;&#25237;&#36164;&#32773;&#22312;&#21021;&#22987;&#36130;&#23500;&#12289;&#39118;&#38505;&#35268;&#36991;&#21442;&#25968;&#20197;&#21450;&#32456;&#27490;&#26102;&#38388;&#30340;&#38543;&#26426;&#36127;&#20538;&#26041;&#38754;&#23384;&#22312;&#24046;&#24322;&#26102;&#30340;&#22343;&#34913;&#20215;&#26684;&#24418;&#25104;&#38382;&#39064;&#12290;&#25105;&#20204;&#36890;&#36807;&#19968;&#20010;&#26032;&#30340;&#22343;&#22330;&#21453;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65288;BSDE&#65289;&#30340;&#35299;&#26469;&#34920;&#24449;&#39118;&#38505;&#32929;&#31080;&#30340;&#22343;&#34913;&#39118;&#38505;&#28322;&#20215;&#36807;&#31243;&#65292;&#20854;&#29305;&#24449;&#26159;&#39537;&#21160;&#31243;&#24207;&#22312;&#38543;&#26426;&#31215;&#20998;&#21644;&#26465;&#20214;&#26399;&#26395;&#19978;&#37117;&#20855;&#26377;&#20108;&#27425;&#22686;&#38271;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#22810;&#20010;&#26465;&#20214;&#19979;&#22343;&#22330;BSDE&#23384;&#22312;&#35299;&#65292;&#24182;&#19988;&#34920;&#26126;&#38543;&#30528;&#20154;&#21475;&#35268;&#27169;&#30340;&#22686;&#22823;&#65292;&#32467;&#26524;&#39118;&#38505;&#28322;&#20215;&#36827;&#31243;&#23454;&#38469;&#19978;&#20250;&#28165;&#38500;&#24066;&#22330;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we study a problem of equilibrium price formation among many investors with exponential utility. The investors are heterogeneous in their initial wealth, risk-averseness parameter, as well as stochastic liability at the terminal time. We characterize the equilibrium risk-premium process of the risky stocks in terms of the solution to a novel mean-field backward stochastic differential equation (BSDE), whose driver has quadratic growth both in the stochastic integrands and in their conditional expectations. We prove the existence of a solution to the mean-field BSDE under several conditions and show that the resultant risk-premium process actually clears the market in the large population limit.
&lt;/p&gt;</description></item></channel></rss>