<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;CNN&#21644;&#32771;&#34385;&#20102;&#25968;&#25454;&#24322;&#36136;&#24615;&#21644;&#29190;&#21457;&#24615;&#30340;&#26032;&#22411;&#35268;&#33539;&#21270;&#36807;&#31243;&#30340;&#26234;&#33021;&#32929;&#31080;&#20132;&#26131;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2303.09407</link><description>&lt;p&gt;
&#22522;&#20110;&#32771;&#34385;&#25968;&#25454;&#24322;&#36136;&#24615;&#21644;&#29190;&#21457;&#24615;&#30340;CNN&#32929;&#31080;&#20132;&#26131;&#27169;&#22411;&#25913;&#36827;
&lt;/p&gt;
&lt;p&gt;
Improving CNN-base Stock Trading By Considering Data Heterogeneity and Burst. (arXiv:2303.09407v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09407
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;CNN&#21644;&#32771;&#34385;&#20102;&#25968;&#25454;&#24322;&#36136;&#24615;&#21644;&#29190;&#21457;&#24615;&#30340;&#26032;&#22411;&#35268;&#33539;&#21270;&#36807;&#31243;&#30340;&#26234;&#33021;&#32929;&#31080;&#20132;&#26131;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#23558;&#26234;&#33021;&#25216;&#26415;&#24212;&#29992;&#20110;&#37329;&#34701;&#20132;&#26131;&#24050;&#26377;&#22810;&#27425;&#23581;&#35797;&#65292;&#26500;&#24314;&#22522;&#20110;&#21382;&#21490;&#32929;&#20215;&#30340;&#33258;&#21160;&#12289;&#26234;&#33021;&#20132;&#26131;&#26694;&#26550;&#12290;&#30001;&#20110;&#37329;&#34701;&#24066;&#22330;&#30340;&#19981;&#21487;&#39044;&#27979;&#24615;&#12289;&#19981;&#30830;&#23450;&#24615;&#21644;&#27874;&#21160;&#24615;&#65292;&#30740;&#31350;&#20154;&#21592;&#20063;&#37319;&#29992;&#28145;&#24230;&#23398;&#20064;&#26500;&#24314;&#26234;&#33021;&#20132;&#26131;&#26694;&#26550;&#12290;&#26412;&#25991;&#25552;&#20986;&#20351;&#29992;CNN&#20316;&#20026;&#36825;&#31181;&#26694;&#26550;&#30340;&#26680;&#24515;&#21151;&#33021;&#65292;&#22240;&#20026;&#23427;&#33021;&#23398;&#20064;&#36755;&#20837;&#25968;&#25454;&#30340;&#31354;&#38388;&#20381;&#36182;&#24615;&#65288;&#21363;&#34892;&#21644;&#21015;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#65289;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#26032;&#30340;&#35268;&#33539;&#21270;&#36807;&#31243;&#26469;&#20934;&#22791;&#32929;&#31080;&#25968;&#25454;&#65292;&#36825;&#19982;&#29616;&#26377;&#30340;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#20132;&#26131;&#26694;&#26550;&#19981;&#21516;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#39318;&#20808;&#32463;&#39564;&#24615;&#22320;&#35266;&#23519;&#21040;&#32929;&#31080;&#25968;&#25454;&#26412;&#36136;&#19978;&#26159;&#24322;&#36136;&#24615;&#21644;&#29190;&#21457;&#24615;&#30340;&#65292;&#28982;&#21518;&#20174;&#32479;&#35745;&#30340;&#35282;&#24230;&#39564;&#35777;&#20102;&#32929;&#31080;&#25968;&#25454;&#30340;&#24322;&#36136;&#24615;&#21644;&#29190;&#21457;&#24615;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#25968;&#25454;&#35268;&#33539;&#21270;&#26041;&#27861;&#65292;&#20197;&#20351;&#25968;&#25454;&#30340;&#24322;&#36136;&#24615;&#24471;&#21040;&#35299;&#20915;&#12290;
&lt;/p&gt;
&lt;p&gt;
In recent years, there have been quite a few attempts to apply intelligent techniques to financial trading, i.e., constructing automatic and intelligent trading framework based on historical stock price. Due to the unpredictable, uncertainty and volatile nature of financial market, researchers have also resorted to deep learning to construct the intelligent trading framework. In this paper, we propose to use CNN as the core functionality of such framework, because it is able to learn the spatial dependency (i.e., between rows and columns) of the input data. However, different with existing deep learning-based trading frameworks, we develop novel normalization process to prepare the stock data. In particular, we first empirically observe that the stock data is intrinsically heterogeneous and bursty, and then validate the heterogeneity and burst nature of stock data from a statistical perspective. Next, we design the data normalization method in a way such that the data heterogeneity is 
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#65292;LSTM-GCN&#65292;&#23427;&#33021;&#22815;&#32467;&#21512;&#20215;&#20540;&#38142;&#25968;&#25454;&#20013;&#30340;&#22797;&#26434;&#32467;&#26500;&#21644;&#26102;&#38388;&#20381;&#36182;&#24615;&#20197;&#39044;&#27979;&#32929;&#31080;&#20215;&#26684;&#12290;&#23454;&#39564;&#34920;&#26126;&#65292;&#35813;&#27169;&#22411;&#21487;&#20197;&#25429;&#33719;&#20215;&#20540;&#38142;&#25968;&#25454;&#20013;&#26410;&#21453;&#26144;&#22312;&#20215;&#26684;&#25968;&#25454;&#20013;&#30340;&#20449;&#24687;&#65292;&#26377;&#21161;&#20110;&#20132;&#26131;&#32773;&#20248;&#21270;&#20854;&#20132;&#26131;&#31574;&#30053;&#21644;&#26368;&#22823;&#21270;&#21033;&#28070;&#12290;</title><link>http://arxiv.org/abs/2303.09406</link><description>&lt;p&gt;
&#22522;&#20110;&#20215;&#20540;&#38142;&#25968;&#25454;&#30340;&#26102;&#38388;&#22270;&#27169;&#22411;&#36827;&#34892;&#32929;&#31080;&#20215;&#26684;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Stock Price Prediction Using Temporal Graph Model with Value Chain Data. (arXiv:2303.09406v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09406
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#65292;LSTM-GCN&#65292;&#23427;&#33021;&#22815;&#32467;&#21512;&#20215;&#20540;&#38142;&#25968;&#25454;&#20013;&#30340;&#22797;&#26434;&#32467;&#26500;&#21644;&#26102;&#38388;&#20381;&#36182;&#24615;&#20197;&#39044;&#27979;&#32929;&#31080;&#20215;&#26684;&#12290;&#23454;&#39564;&#34920;&#26126;&#65292;&#35813;&#27169;&#22411;&#21487;&#20197;&#25429;&#33719;&#20215;&#20540;&#38142;&#25968;&#25454;&#20013;&#26410;&#21453;&#26144;&#22312;&#20215;&#26684;&#25968;&#25454;&#20013;&#30340;&#20449;&#24687;&#65292;&#26377;&#21161;&#20110;&#20132;&#26131;&#32773;&#20248;&#21270;&#20854;&#20132;&#26131;&#31574;&#30053;&#21644;&#26368;&#22823;&#21270;&#21033;&#28070;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32929;&#31080;&#20215;&#26684;&#39044;&#27979;&#26159;&#37329;&#34701;&#20132;&#26131;&#20013;&#33267;&#20851;&#37325;&#35201;&#30340;&#20803;&#32032;&#65292;&#23427;&#21487;&#20197;&#24110;&#21161;&#20132;&#26131;&#32773;&#36827;&#34892;&#20080;&#21334;&#21644;&#25345;&#26377;&#32929;&#31080;&#30340;&#20915;&#31574;&#12290;&#26412;&#25991;&#24341;&#20837;&#20102;&#19968;&#31181;&#22522;&#20110;&#31070;&#32463;&#32593;&#32476;&#30340;&#32929;&#31080;&#22238;&#25253;&#29575;&#39044;&#27979;&#26041;&#27861;&#65292;&#38271;&#30701;&#26399;&#35760;&#24518;&#22270;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65288;LSTM-GCN&#65289;&#27169;&#22411;&#65292;&#23427;&#32467;&#21512;&#20102;&#22270;&#21367;&#31215;&#32593;&#32476;&#65288;GCN&#65289;&#21644;&#38271;&#30701;&#26399;&#35760;&#24518;&#32454;&#32990;&#65288;LSTM&#65289;&#12290;GCN&#29992;&#20110;&#25429;&#25417;&#20215;&#20540;&#38142;&#25968;&#25454;&#30340;&#22797;&#26434;&#25299;&#25169;&#32467;&#26500;&#21644;&#31354;&#38388;&#20381;&#36182;&#24615;&#65292;&#32780;LSTM&#21017;&#25429;&#25417;&#32929;&#31080;&#22238;&#25253;&#25968;&#25454;&#30340;&#26102;&#38388;&#20381;&#36182;&#24615;&#21644;&#21160;&#24577;&#21464;&#21270;&#12290;&#25105;&#20204;&#22312;&#30001;Eurostoxx 600&#21644;S&#65286;P 500&#32452;&#25104;&#30340;&#20004;&#20010;&#25968;&#25454;&#38598;&#19978;&#35780;&#20272;&#20102;LSTM-GCN&#27169;&#22411;&#65292;&#23454;&#39564;&#34920;&#26126;&#35813;&#27169;&#22411;&#21487;&#20197;&#25429;&#33719;&#20215;&#20540;&#38142;&#25968;&#25454;&#20013;&#26410;&#23436;&#20840;&#21453;&#26144;&#22312;&#20215;&#26684;&#25968;&#25454;&#20013;&#30340;&#38468;&#21152;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;
Stock price prediction is a crucial element in financial trading as it allows traders to make informed decisions about buying, selling, and holding stocks. Accurate predictions of future stock prices can help traders optimize their trading strategies and maximize their profits. In this paper, we introduce a neural network-based stock return prediction method, the Long Short-Term Memory Graph Convolutional Neural Network (LSTM-GCN) model, which combines the Graph Convolutional Network (GCN) and Long Short-Term Memory (LSTM) Cells. Specifically, the GCN is used to capture complex topological structures and spatial dependence from value chain data, while the LSTM captures temporal dependence and dynamic changes in stock returns data. We evaluated the LSTM-GCN model on two datasets consisting of constituents of Eurostoxx 600 and S&amp;P 500. Our experiments demonstrate that the LSTM-GCN model can capture additional information from value chain data that are not fully reflected in price data, a
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#26159;&#21542;&#26377;&#26356;&#22909;&#30340;&#20010;&#20154;&#21644;&#20844;&#21496;&#25152;&#24471;&#31246;&#25910;&#20837;&#30340;&#39044;&#27979;&#27169;&#22411;&#26159;&#23481;&#26131;&#23454;&#26045;&#30340;&#24182;&#19988;&#20248;&#20110;&#30446;&#21069;&#27491;&#22312;&#20351;&#29992;&#30340;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2303.09405</link><description>&lt;p&gt;
&#31616;&#21270;&#19982;&#25913;&#36827;&#65306;&#37325;&#35775;&#20445;&#21152;&#21033;&#20122;&#30340;&#25910;&#20837;&#39044;&#27979;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
Simplifying and Improving: Revisiting Bulgaria's Revenue Forecasting Models. (arXiv:2303.09405v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09405
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#26159;&#21542;&#26377;&#26356;&#22909;&#30340;&#20010;&#20154;&#21644;&#20844;&#21496;&#25152;&#24471;&#31246;&#25910;&#20837;&#30340;&#39044;&#27979;&#27169;&#22411;&#26159;&#23481;&#26131;&#23454;&#26045;&#30340;&#24182;&#19988;&#20248;&#20110;&#30446;&#21069;&#27491;&#22312;&#20351;&#29992;&#30340;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#30495;&#27491;&#31038;&#20250;&#20027;&#20041;&#32467;&#26463;&#19977;&#21313;&#24180;&#26469;&#65292;&#20445;&#21152;&#21033;&#20122;&#30340;&#31246;&#25910;&#21046;&#24230;&#24050;&#32463;&#20174;&#30456;&#24403;&#28608;&#36827;&#30340;&#8220;&#19981;&#21516;&#8221;&#21046;&#24230;&#36716;&#21464;&#20026;&#37319;&#29992;&#36739;&#20302;&#30340;&#31246;&#29575;&#65292;&#20844;&#21496;&#25152;&#24471;&#31246;&#21644;&#20010;&#20154;&#25152;&#24471;&#31246;&#30340;&#36793;&#38469;&#31246;&#29575;&#20174;40&#65285;&#38477;&#33267;10&#65285;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#22312;&#20445;&#21152;&#21033;&#20122;&#36130;&#25919;&#37096;&#20351;&#29992;&#30340;&#35745;&#37327;&#32463;&#27982;&#23398;&#39044;&#27979;&#27169;&#22411;&#20013;&#65292;&#26263;&#31034;&#30528;&#19982;&#25152;&#35859;&#30340;&#8220;&#25289;&#24343;&#26354;&#32447;&#8221;&#30456;&#23481;&#30340;&#31246;&#25910;&#22686;&#21152;&#12290;&#21516;&#26679;&#65292;&#35768;&#22810;&#32463;&#27982;&#23398;&#23478;&#35748;&#20026;&#65292;&#25910;&#20837;&#20250;&#22686;&#21152;&#12290;&#28982;&#32780;&#65292;&#29616;&#23454;&#24182;&#26410;&#36798;&#21040;&#22522;&#20110;&#39044;&#27979;&#27169;&#22411;&#21644;&#26681;&#26893;&#20110;&#20027;&#27969;&#32463;&#27982;&#29702;&#35770;&#30340;&#26399;&#26395;&#12290;&#22240;&#27492;&#65292;&#26412;&#25991;&#25506;&#35752;&#26159;&#21542;&#26377;&#26356;&#22909;&#30340;&#20010;&#20154;&#21644;&#20844;&#21496;&#25152;&#24471;&#31246;&#25910;&#20837;&#30340;&#39044;&#27979;&#27169;&#22411;&#26159;&#23481;&#26131;&#23454;&#26045;&#30340;&#24182;&#19988;&#20248;&#20110;&#30446;&#21069;&#27491;&#22312;&#20351;&#29992;&#30340;&#27169;&#22411;&#12290;&#22312;&#25552;&#20986;&#23545;&#30446;&#21069;&#39044;&#27979;&#27169;&#22411;&#30340;&#24314;&#35774;&#24615;&#25209;&#35780;&#20043;&#21518;&#65292;&#26412;&#25991;&#25552;&#20379;&#20102;&#23481;&#26131;&#23454;&#29616;&#65292;&#36879;&#26126;&#30340;&#26367;&#20195;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the thirty years since the end of real socialism, Bulgaria's went from having a rather radically 'different' tax system to adopting flat-rate taxation with marginal tax rates that fell from figures as high as 40% to 10% for both the corporate-income tax and the personal-income tax. Crucially, the econometric forecasting models in use at the Bulgarian Ministry of Finance hinted at an increase in tax revenue compatible with the so-called 'Laffer curve'. Similarly, many economists held the view that revenues would have increased. However, reality fell short of those expectations based on forecasting models and rooted in mainstream economic theory. Thus, this paper asks whether there are betterperforming forecasting models for personal-and corporate-income tax-revenues in Bulgaria that are readily implementable and overperform the ones currently in use. After articulating a constructive critique of the current forecasting models, the paper offers readily implementable, transparent alter
&lt;/p&gt;</description></item><item><title>&#26412;&#20070;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#20110;&#29983;&#20135;&#27700;&#24179;&#19978;&#30340;&#31561;&#20215;&#20851;&#31995;&#30340;&#19968;&#33268;&#30340;&#20215;&#20540;&#29702;&#35770;&#65292;&#24182;&#37325;&#26032;&#23450;&#20041;&#29983;&#20135;&#30340;&#30495;&#27491;&#21547;&#20041;&#21450;&#31038;&#20250;&#36164;&#26412;&#30340;&#20877;&#29983;&#20135;&#29702;&#35770;&#12290;&#20854;&#21033;&#28070;&#29702;&#35770;&#34920;&#26126;&#21033;&#28070;&#23545;&#24212;&#20110;&#29289;&#29702;&#21487;&#27979;&#37327;&#30340;&#37327;&#12290;</title><link>http://arxiv.org/abs/2303.09399</link><description>&lt;p&gt;
&#25919;&#27835;&#32463;&#27982;&#23398;&#30340;&#20027;&#35201;&#27010;&#24565;&#19982;&#21407;&#21017;&#8212;&#8212;&#29983;&#20135;&#19982;&#20215;&#20540;&#12289;&#20998;&#37197;&#19982;&#20215;&#26684;&#12289;&#20877;&#29983;&#20135;&#19982;&#21033;&#28070;
&lt;/p&gt;
&lt;p&gt;
Main Concepts and Principles of Political Economy -- Production and Values, Distribution and Prices, Reproduction and Profits. (arXiv:2303.09399v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09399
&lt;/p&gt;
&lt;p&gt;
&#26412;&#20070;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#20110;&#29983;&#20135;&#27700;&#24179;&#19978;&#30340;&#31561;&#20215;&#20851;&#31995;&#30340;&#19968;&#33268;&#30340;&#20215;&#20540;&#29702;&#35770;&#65292;&#24182;&#37325;&#26032;&#23450;&#20041;&#29983;&#20135;&#30340;&#30495;&#27491;&#21547;&#20041;&#21450;&#31038;&#20250;&#36164;&#26412;&#30340;&#20877;&#29983;&#20135;&#29702;&#35770;&#12290;&#20854;&#21033;&#28070;&#29702;&#35770;&#34920;&#26126;&#21033;&#28070;&#23545;&#24212;&#20110;&#29289;&#29702;&#21487;&#27979;&#37327;&#30340;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#20070;&#26088;&#22312;&#20174;&#32463;&#27982;&#29702;&#35770;&#30340;&#22880;&#22522;&#32773;&#20122;&#24403;&#183;&#26031;&#23494;&#12289;&#25140;&#32500;&#183;&#26446;&#22025;&#22270;&#21644;&#21345;&#23572;&#183;&#39532;&#20811;&#24605;&#25552;&#20986;&#30340;&#22522;&#26412;&#38382;&#39064;&#20837;&#25163;&#65292;&#25506;&#31350;&#21830;&#21697;&#30340;&#20215;&#20540;&#26159;&#30001;&#20160;&#20040;&#26500;&#25104;&#30340;&#65292;&#29983;&#20135;&#12289;&#20132;&#25442;&#12289;&#36135;&#24065;&#21644;&#25910;&#20837;&#65288;&#22914;&#21033;&#28070;&#12289;&#24037;&#36164;&#21644;&#31199;&#37329;&#65289;&#26159;&#20160;&#20040;&#26679;&#30340;&#12290;&#36825;&#20123;&#32463;&#27982;&#23398;&#23478;&#25552;&#20379;&#30340;&#31572;&#26696;&#22823;&#22810;&#26159;&#38169;&#35823;&#30340;&#65292;&#23588;&#20854;&#26159;&#22312;&#23558;&#21830;&#21697;&#30340;&#31561;&#20215;&#23450;&#20041;&#20026;&#20132;&#25442;&#30340;&#27700;&#24179;&#19978;&#65292;&#20294;&#20063;&#30001;&#20110;&#23558;&#20215;&#20540;&#19982;&#20215;&#26684;&#28151;&#28102;&#65292;&#24182;&#38169;&#35823;&#22320;&#30475;&#24453;&#29983;&#20135;&#30340;&#30495;&#27491;&#21547;&#20041;&#21450;&#22266;&#23450;&#36164;&#26412;&#30340;&#20316;&#29992;&#12290;&#26412;&#20070;&#36816;&#29992;&#24230;&#37327;&#30340;&#25968;&#23398;&#29702;&#35770;&#21644;&#32500;&#24230;&#20998;&#26512;&#30340;&#29289;&#29702;&#29702;&#35770;&#65292;&#22522;&#20110;&#19968;&#20010;&#19981;&#26159;&#22312;&#20132;&#25442;&#27700;&#24179;&#32780;&#26159;&#22312;&#29983;&#20135;&#27700;&#24179;&#19978;&#30340;&#31561;&#20215;&#20851;&#31995;&#65292;&#25552;&#20379;&#20102;&#19968;&#20010;&#19968;&#33268;&#30340;&#20215;&#20540;&#29702;&#35770;&#12290;&#26412;&#20070;&#25298;&#32477;&#23558;&#29983;&#20135;&#35270;&#20026;&#23558;&#25237;&#20837;&#36716;&#21270;&#20026;&#20135;&#20986;&#30340;&#36807;&#31243;&#65292;&#24182;&#20174;&#29289;&#36136;&#12289;&#33021;&#37327;&#21644;&#20154;&#31867;&#19982;&#33258;&#28982;&#12289;&#26426;&#22120;&#21644;&#20854;&#20182;&#20154;&#31867;&#36827;&#34892;&#20132;&#20114;&#30340;&#26234;&#21147;&#27963;&#21160;&#30340;&#29289;&#29702;&#35282;&#24230;&#23545;&#20854;&#36827;&#34892;&#37325;&#26032;&#23450;&#20041;&#12290;&#31038;&#20250;&#36164;&#26412;&#30340;&#20877;&#29983;&#20135;&#29702;&#35770;&#26159;&#22522;&#20110;&#24658;&#23450;&#36164;&#26412;&#12289;&#21487;&#21464;&#36164;&#26412;&#21644;&#21097;&#20313;&#20215;&#20540;&#30340;&#19977;&#20998;&#27861;&#65292;&#24182;&#30830;&#31435;&#20215;&#20540;&#23432;&#24658;&#23450;&#24459;&#20316;&#20026;&#20998;&#37197;&#19982;&#20215;&#26684;&#29702;&#35770;&#30340;&#22522;&#30707;&#12290;&#21033;&#28070;&#29702;&#35770;&#34920;&#26126;&#65292;&#21033;&#28070;&#23545;&#24212;&#20110;&#29289;&#29702;&#21487;&#27979;&#37327;&#30340;&#37327;&#65292;&#22240;&#20026;&#22312;&#19981;&#30830;&#23450;&#24615;&#21644;&#39118;&#38505;&#30340;&#26465;&#20214;&#19979;&#65292;&#23427;&#26159;&#29983;&#20135;&#36807;&#31243;&#30340;&#29289;&#29702;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
This book starts from the basic questions that had been raised by the founders of Economic theory, Smith, Ricardo, and Marx: what makes the value of commodities, what are production, exchange, money and incomes like profits, wages and rents. The answers that these economists had provided were mostly wrong, above all by defining the equivalence of commodities at the level of exchange, but also because of a confusion made between values and prices, and wrong views of what production really is and the role of fixed capital. Using the mathematical theory of measurement and the physical theory of dimensional analysis, this book provides a coherent theory of value based on an equivalence relation not at the level of exchange, but of production. Indeed exchange is considered here as an equivalence relation between money and a monetary price, and not between commodities, modern monetary theory having demonstrated that money is not a commodity. The book rejects the conception of production as a
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#21382;&#21490;&#20215;&#26684;&#21644;Twitter&#24773;&#24863;&#20998;&#26512;&#39044;&#27979;&#27604;&#29305;&#24065;&#20215;&#26684;&#65292;&#24182;&#21462;&#24471;&#20102;&#19981;&#38169;&#30340;&#25928;&#26524;&#12290;&#24773;&#24863;&#39044;&#27979;&#30340;&#24179;&#22343;&#32477;&#23545;&#30334;&#20998;&#27604;&#35823;&#24046;&#20026;9.45&#65285;&#65292;&#20215;&#26684;&#39044;&#27979;&#30340;&#24179;&#22343;&#32477;&#23545;&#30334;&#20998;&#27604;&#35823;&#24046;&#20026;3.6&#65285;&#12290;</title><link>http://arxiv.org/abs/2303.09397</link><description>&lt;p&gt;
&#21033;&#29992;Twitter&#24773;&#24863;&#20998;&#26512;&#39044;&#27979;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;
&lt;/p&gt;
&lt;p&gt;
Cryptocurrency Price Prediction using Twitter Sentiment Analysis. (arXiv:2303.09397v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09397
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#21382;&#21490;&#20215;&#26684;&#21644;Twitter&#24773;&#24863;&#20998;&#26512;&#39044;&#27979;&#27604;&#29305;&#24065;&#20215;&#26684;&#65292;&#24182;&#21462;&#24471;&#20102;&#19981;&#38169;&#30340;&#25928;&#26524;&#12290;&#24773;&#24863;&#39044;&#27979;&#30340;&#24179;&#22343;&#32477;&#23545;&#30334;&#20998;&#27604;&#35823;&#24046;&#20026;9.45&#65285;&#65292;&#20215;&#26684;&#39044;&#27979;&#30340;&#24179;&#22343;&#32477;&#23545;&#30334;&#20998;&#27604;&#35823;&#24046;&#20026;3.6&#65285;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#21152;&#23494;&#36135;&#24065;&#30340;&#27874;&#21160;&#24615;&#21450;&#22810;&#26679;&#21270;&#30340;&#24847;&#35265;&#65292;&#22312;&#35768;&#22810;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#19978;&#37117;&#25104;&#20026;&#20102;&#35752;&#35770;&#30340;&#20013;&#24515;&#35805;&#39064;&#12290;Twitter &#36805;&#36895;&#25104;&#20026;&#26032;&#38395;&#26469;&#28304;&#21644;&#27604;&#29305;&#24065;&#35752;&#35770;&#30340;&#23186;&#20171;&#12290;&#25105;&#20204;&#30340;&#31639;&#27861;&#26088;&#22312;&#21033;&#29992;&#21382;&#21490;&#20215;&#26684;&#21644;&#25512;&#25991;&#24773;&#24863;&#26469;&#39044;&#27979;&#27604;&#29305;&#24065;&#30340;&#20215;&#26684;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#31471;&#21040;&#31471;&#27169;&#22411;&#65292;&#21487;&#20351;&#29992;&#21452;&#21521;&#32534;&#30721;&#22120;&#36716;&#25442;&#30340;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#39044;&#27979;&#25512;&#25991;&#38598;&#30340;&#24773;&#24863;&#65292;&#24182;&#20351;&#29992;&#39044;&#27979;&#30340;&#24773;&#24863;&#20197;&#21450;&#21382;&#21490;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#25968;&#25454;&#12289;&#25512;&#25991;&#25968;&#37327;&#12289;&#29992;&#25143;&#30340;&#36861;&#38543;&#32773;&#25968;&#37327;&#20197;&#21450;&#29992;&#25143;&#26159;&#21542;&#36890;&#36807;&#39564;&#35777;&#26469;&#39044;&#27979;&#27604;&#29305;&#24065;&#30340;&#20215;&#26684;&#12290;&#24773;&#24863;&#39044;&#27979;&#30340;&#24179;&#22343;&#32477;&#23545;&#30334;&#20998;&#27604;&#35823;&#24046;&#20026;9.45&#65285;&#65292;&#21453;&#24212;&#20102;&#23454;&#26102;&#25968;&#25454;&#21644;&#27979;&#35797;&#25968;&#25454;&#30340;&#24179;&#22343;&#35823;&#24046;&#12290;&#32780;&#20215;&#26684;&#39044;&#27979;&#30340;&#24179;&#22343;&#32477;&#23545;&#30334;&#20998;&#27604;&#35823;&#24046;&#21017;&#20026;3.6&#65285;&#12290;
&lt;/p&gt;
&lt;p&gt;
The cryptocurrency ecosystem has been the centre of discussion on many social media platforms, following its noted volatility and varied opinions. Twitter is rapidly being utilised as a news source and a medium for bitcoin discussion. Our algorithm seeks to use historical prices and sentiment of tweets to forecast the price of Bitcoin. In this study, we develop an end-to-end model that can forecast the sentiment of a set of tweets (using a Bidirectional Encoder Representations from Transformers - based Neural Network Model) and forecast the price of Bitcoin (using Gated Recurrent Unit) using the predicted sentiment and other metrics like historical cryptocurrency price data, tweet volume, a user's following, and whether or not a user is verified. The sentiment prediction gave a Mean Absolute Percentage Error of 9.45%, an average of real-time data, and test data. The mean absolute percent error for the price prediction was 3.6%.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#23545;NFT&#24066;&#22330;&#36827;&#34892;&#20102;&#31995;&#32479;&#20998;&#26512;&#65292;&#21457;&#29616;&#21069;0.1&#65285;&#30340;NFT&#40120;&#40060;&#20197;&#39640;&#22238;&#25253;&#25512;&#21160;&#30528;&#36825;&#20010;&#24066;&#22330;&#65292;&#24182;&#25581;&#31034;&#20102;NFT&#40120;&#40060;&#30340;&#29420;&#29305;&#25237;&#36164;&#31574;&#30053;&#12290;</title><link>http://arxiv.org/abs/2303.09393</link><description>&lt;p&gt;
NFT&#40120;&#40060;&#30340;&#28145;&#24230;&#20998;&#26512;&#65306;NFT&#20132;&#26131;&#29983;&#24577;&#30340;&#32437;&#21521;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
A Deep Dive into NFT Whales: A Longitudinal Study of the NFT Trading Ecosystem. (arXiv:2303.09393v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09393
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;NFT&#24066;&#22330;&#36827;&#34892;&#20102;&#31995;&#32479;&#20998;&#26512;&#65292;&#21457;&#29616;&#21069;0.1&#65285;&#30340;NFT&#40120;&#40060;&#20197;&#39640;&#22238;&#25253;&#25512;&#21160;&#30528;&#36825;&#20010;&#24066;&#22330;&#65292;&#24182;&#25581;&#31034;&#20102;NFT&#40120;&#40060;&#30340;&#29420;&#29305;&#25237;&#36164;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
NFT&#65288;&#19981;&#21487;&#26367;&#20195;&#20196;&#29260;&#65289;&#24050;&#32463;&#22823;&#24133;&#22686;&#38271;&#65292;&#21344;&#25454;&#20102;&#24635;&#24066;&#20540;&#36229;&#36807;169&#20159;&#32654;&#20803;&#12290;&#23613;&#31649;NFT&#36805;&#36895;&#22686;&#38271;&#65292;&#20294;&#36825;&#20010;&#24066;&#22330;&#36824;&#26410;&#20174;&#37329;&#34701;&#35282;&#24230;&#36827;&#34892;&#24443;&#24213;&#30340;&#30740;&#31350;&#12290;&#26412;&#25991;&#23545;NFT&#24066;&#22330;&#36827;&#34892;&#20102;&#31995;&#32479;&#20998;&#26512;&#65292;&#20197;&#35782;&#21035;&#22312;&#28508;&#22312;&#25805;&#32437;&#21644;&#27874;&#21160;NFT&#20215;&#20540;&#26041;&#38754;&#21457;&#25381;&#37325;&#35201;&#20316;&#29992;&#30340;NFT&#24066;&#22330;&#36816;&#21160;&#32773;&#12290;&#25105;&#20204;&#20174;2021&#24180;1&#26376;&#33267;2022&#24180;2&#26376;&#25910;&#38598;&#20102;&#26469;&#33258;&#20197;&#22826;&#22346;&#21306;&#22359;&#38142;&#30340;&#36229;&#36807;380&#19975;&#27425;NFT&#20132;&#26131;&#25968;&#25454;&#65292;&#24182;&#25552;&#21462;&#20102;&#31526;&#21512;NFT&#29983;&#21629;&#21608;&#26399;&#30340;&#20132;&#26131;&#20449;&#24687;&#65306;&#65288;i&#65289;&#38136;&#36896;&#65292;&#65288;ii&#65289;&#20132;&#26131;/&#38144;&#21806;&#21644;&#65288;iii&#65289;&#38144;&#27585;&#12290;&#26681;&#25454;&#25345;&#26377;NFT&#20215;&#20540;&#30340;&#22823;&#23567;&#65292;&#25105;&#20204;&#23558;NFT&#20132;&#26131;&#32773;&#20998;&#20026;&#19977;&#20010;&#32452;&#21035;&#65288;&#40120;&#40060;&#65292;&#28023;&#35930;&#21644;&#23567;&#40060;&#65289;&#12290;&#24635;&#20849;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#26469;&#33258;91&#20010;&#19981;&#21516;&#30340;NFT&#25910;&#34255;&#26469;&#28304;&#30340;430K&#20132;&#26131;&#32773;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;NFT&#20132;&#26131;&#32773;&#20013;&#21069;0.1&#65285;&#30340;&#40120;&#40060;&#20197;&#19968;&#33268;&#30340;&#39640;&#22238;&#25253;&#25512;&#21160;NFT&#24066;&#22330;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#30830;&#23450;&#24182;&#25551;&#36848;&#20102;NFT&#40120;&#40060;&#30340;&#29420;&#29305;&#25237;&#36164;&#31574;&#30053;&#65288;&#20363;&#22914;&#65292;&#38136;&#36896;/&#38144;&#21806;&#65292;&#36141;&#20080;/&#25345;&#26377;&#21644;&#21442;&#19982;IDO&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
NFT (Non-fungible Token) has drastically increased in its size, accounting for over \$16.9B of total market capitalization. Despite the rapid growth of NFTs, this market has not been examined thoroughly from a financial perspective. In this paper, we conduct methodical analyses to identify NFT market movers who play a significant role in potentially manipulating and oscillating NFT values. We collect over 3.8M NFT transaction data from the Ethereum Blockchain from January 2021 to February 2022 to extract trading information in line with the NFT lifecycle: (i) mint, (ii) transfer/sale, and (iii) burn. Based on the size of held NFT values, we classify NFT traders into three groups (whales, dolphins, and minnows). In total, we analyze 430K traders from 91 different NFT collection sources. We find that the top 0.1\% of NFT traders (i.e., whales) drive the NFT market with consistent, high returns. We then identify and characterize the NFT whales' unique investment strategies (e.g., mint/sal
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#27178;&#21521;&#20869;&#37096;&#29109;&#27169;&#22411;&#20272;&#35745;&#25237;&#36164;&#32452;&#21512;&#30340;&#27874;&#21160;&#29575;&#65292;&#24182;&#24341;&#20837;&#22522;&#20110; CSIE &#30340; beta &#20540;&#65292;&#20197;&#35780;&#20272;&#25237;&#36164;&#32452;&#21512;&#30456;&#23545;&#20110;&#24066;&#22330;&#25351;&#25968;&#21644;&#25972;&#20010;&#24066;&#22330;&#30340;&#30456;&#23545;&#27874;&#21160;&#39118;&#38505;&#65292;&#23454;&#35777;&#35777;&#26126;&#22810;&#31181;&#31526;&#21495;&#38598;&#21512;&#22312;&#30456;&#21516;&#25110;&#26356;&#20302;&#39118;&#38505;&#27700;&#24179;&#19979;&#23454;&#29616;&#36229;&#36807;&#24066;&#22330;&#25351;&#25968;&#30340;&#25910;&#30410;&#29575;&#12290;</title><link>http://arxiv.org/abs/2303.09330</link><description>&lt;p&gt;
&#30456;&#23545;&#20110;&#32929;&#24066;&#27178;&#21521;&#20869;&#37096;&#29109;&#30340;&#25237;&#36164;&#32452;&#21512;&#27874;&#21160;&#29575;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Portfolio Volatility Estimation Relative to Stock Market Cross-Sectional Intrinsic Entropy. (arXiv:2303.09330v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09330
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#27178;&#21521;&#20869;&#37096;&#29109;&#27169;&#22411;&#20272;&#35745;&#25237;&#36164;&#32452;&#21512;&#30340;&#27874;&#21160;&#29575;&#65292;&#24182;&#24341;&#20837;&#22522;&#20110; CSIE &#30340; beta &#20540;&#65292;&#20197;&#35780;&#20272;&#25237;&#36164;&#32452;&#21512;&#30456;&#23545;&#20110;&#24066;&#22330;&#25351;&#25968;&#21644;&#25972;&#20010;&#24066;&#22330;&#30340;&#30456;&#23545;&#27874;&#21160;&#39118;&#38505;&#65292;&#23454;&#35777;&#35777;&#26126;&#22810;&#31181;&#31526;&#21495;&#38598;&#21512;&#22312;&#30456;&#21516;&#25110;&#26356;&#20302;&#39118;&#38505;&#27700;&#24179;&#19979;&#23454;&#29616;&#36229;&#36807;&#24066;&#22330;&#25351;&#25968;&#30340;&#25910;&#30410;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36873;&#25321;&#32929;&#31080;&#32452;&#21512;&#24182;&#35780;&#20272;&#19982;&#25972;&#20010;&#24066;&#22330;&#12289;&#24066;&#22330;&#25351;&#25968;&#25110;&#20854;&#20182;&#32929;&#31080;&#32452;&#21512;&#30456;&#27604;&#30340;&#30456;&#23545;&#27874;&#21160;&#39118;&#38505;&#23545;&#20110;&#19987;&#19994;&#22522;&#37329;&#32463;&#29702;&#21644;&#20010;&#20154;&#25237;&#36164;&#32773;&#37117;&#38750;&#24120;&#37325;&#35201;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#20351;&#29992;&#27178;&#21521;&#20869;&#37096;&#29109; (CSIE) &#27169;&#22411;&#26469;&#20272;&#35745;&#21487;&#20197;&#19968;&#36215;&#34987;&#35270;&#20026;&#32452;&#21512;&#25104;&#20998;&#30340;&#32929;&#31080;&#32452;&#30340;&#27178;&#21521;&#27874;&#21160;&#29575;&#12290;&#22312;&#25105;&#20204;&#30340;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#23558;&#25237;&#36164;&#32452;&#21512;&#30340;&#27874;&#21160;&#39118;&#38505;&#19982;&#30001; CSIE &#25552;&#20379;&#30340;&#25972;&#20010;&#24066;&#22330;&#30340;&#27874;&#21160;&#24615;&#20197;&#21450;&#20351;&#29992;&#32437;&#21521;&#25968;&#25454;&#35745;&#31639;&#20986;&#30340;&#24066;&#22330;&#25351;&#25968;&#30340;&#27874;&#21160;&#24615;&#36827;&#34892;&#22522;&#20934;&#27979;&#35797;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#22522;&#20110; CSIE &#30340; beta &#20540;&#65292;&#20197;&#34920;&#24449;&#25237;&#36164;&#32452;&#21512;&#30456;&#23545;&#20110;&#24066;&#22330;&#25351;&#25968;&#21644;&#25972;&#20010;&#24066;&#22330;&#30340;&#30456;&#23545;&#27874;&#21160;&#39118;&#38505;&#12290;&#25105;&#20204;&#36890;&#36807;&#22522;&#20110; CSIE &#30340; beta &#20540;&#23454;&#35777;&#35777;&#26126;&#20102;&#22810;&#31181;&#31526;&#21495;&#38598;&#21512;&#22312;&#32500;&#25345;&#19982;&#24066;&#22330;&#25351;&#25968;&#30456;&#21516;&#30340;&#39118;&#38505;&#27700;&#24179;&#25110;&#29978;&#33267;&#26356;&#20302;&#30340;&#39118;&#38505;&#27700;&#24179;&#32780;&#23454;&#29616;&#36229;&#36807;&#24066;&#22330;&#25351;&#25968;&#30340;&#25910;&#30410;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
Selecting stock portfolios and assessing their relative volatility risk compared to the market as a whole, market indices, or other portfolios is of great importance to professional fund managers and individual investors alike. Our research uses the cross-sectional intrinsic entropy (CSIE) model to estimate the cross-sectional volatility of the stock groups that can be considered together as portfolio constituents. In our study, we benchmark portfolio volatility risks against the volatility of the entire market provided by the CSIE and the volatility of market indices computed using longitudinal data. This article introduces CSIE-based betas to characterise the relative volatility risk of the portfolio against market indices and the market as a whole. We empirically prove that, through CSIE-based betas, multiple sets of symbols that outperform the market indices in terms of rate of return while maintaining the same level of risk or even lower than the one exhibited by the market index 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#37319;&#29992;&#35821;&#20041;&#20998;&#21106;&#21644;&#23436;&#20840;&#20108;&#32500;&#21367;&#31215;&#32534;&#30721;&#22120;&#35299;&#30721;&#22120;&#39044;&#27979;&#32929;&#31080;&#20215;&#26684;&#26410;&#26469;&#36235;&#21183;&#30340;&#26041;&#27861;</title><link>http://arxiv.org/abs/2303.09323</link><description>&lt;p&gt;
&#32929;&#31080;&#36235;&#21183;&#39044;&#27979;&#65306;&#19968;&#31181;&#35821;&#20041;&#20998;&#21106;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Stock Trend Prediction: A Semantic Segmentation Approach. (arXiv:2303.09323v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09323
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#37319;&#29992;&#35821;&#20041;&#20998;&#21106;&#21644;&#23436;&#20840;&#20108;&#32500;&#21367;&#31215;&#32534;&#30721;&#22120;&#35299;&#30721;&#22120;&#39044;&#27979;&#32929;&#31080;&#20215;&#26684;&#26410;&#26469;&#36235;&#21183;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24066;&#22330;&#37329;&#34701;&#39044;&#27979;&#26159;&#28145;&#24230;&#23398;&#20064;&#20013;&#30340;&#19968;&#20010;&#36235;&#21183;&#39046;&#22495;&#12290;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#33021;&#22815;&#35299;&#20915;&#32929;&#24066;&#25968;&#25454;&#20013;&#30340;&#20256;&#32479;&#38382;&#39064;&#65292;&#22914;&#20854;&#26497;&#20854;&#22797;&#26434;&#30340;&#21160;&#24577;&#21644;&#38271;&#26399;&#26102;&#38388;&#30456;&#20851;&#24615;&#12290;&#20026;&#20102;&#25429;&#25417;&#36825;&#20123;&#26102;&#38388;&#24207;&#21015;&#20043;&#38388;&#30340;&#26102;&#38388;&#20851;&#31995;&#65292;&#37319;&#29992;&#20102;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#24490;&#29615;&#27169;&#22411;&#26469;&#35828;&#65292;&#23398;&#20064;&#20445;&#25345;&#38271;&#26399;&#20449;&#24687;&#26159;&#22256;&#38590;&#30340;&#12290;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#24050;&#32463;&#34987;&#29992;&#20110;&#26356;&#22909;&#22320;&#25429;&#25417;&#21160;&#24577;&#24182;&#25552;&#21462;&#30701;&#26399;&#21644;&#38271;&#26399;&#39044;&#27979;&#30340;&#29305;&#24449;&#12290;&#28982;&#32780;&#65292;&#35821;&#20041;&#20998;&#21106;&#21450;&#20854;&#35774;&#35745;&#33391;&#22909;&#30340;&#20840;&#21367;&#31215;&#32593;&#32476;&#20174;&#26410;&#29992;&#20110;&#26102;&#38388;&#24207;&#21015;&#23494;&#38598;&#20998;&#31867;&#30340;&#30740;&#31350;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#23436;&#20840;&#20108;&#32500;&#21367;&#31215;&#32534;&#30721;&#22120;&#35299;&#30721;&#22120;&#39044;&#27979;&#38271;&#26399;&#26085;&#24120;&#32929;&#20215;&#21464;&#21160;&#36235;&#21183;&#30340;&#26032;&#26041;&#27861;&#12290;&#25105;&#20204;&#29983;&#25104;&#21253;&#21547;T&#22825;&#30340;&#27599;&#26085;&#20215;&#26684;&#30340;&#36755;&#20837;&#24103;&#12290;&#30446;&#26631;&#26159;&#36890;&#36807;&#20687;&#32032;&#32423;&#30340;&#20998;&#31867;&#26469;&#39044;&#27979;&#26410;&#26469;&#30340;&#36235;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
Market financial forecasting is a trending area in deep learning. Deep learning models are capable of tackling the classic challenges in stock market data, such as its extremely complicated dynamics as well as long-term temporal correlation. To capture the temporal relationship among these time series, recurrent neural networks are employed. However, it is difficult for recurrent models to learn to keep track of long-term information. Convolutional Neural Networks have been utilized to better capture the dynamics and extract features for both short- and long-term forecasting. However, semantic segmentation and its well-designed fully convolutional networks have never been studied for time-series dense classification. We present a novel approach to predict long-term daily stock price change trends with fully 2D-convolutional encoder-decoders. We generate input frames with daily prices for a time-frame of T days. The aim is to predict future trends by pixel-wise classification of the cur
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#20108;&#39033;&#24335;&#26641;&#21644;&#23454;&#29289;&#26399;&#26435;&#25216;&#26415;&#35780;&#20272;&#25237;&#36164;&#39033;&#30446;&#30340;&#26041;&#27861;&#65292;&#35813;&#25216;&#26415;&#21487;&#29992;&#20110;&#20225;&#19994;&#25112;&#30053;&#26041;&#38754;&#30340;&#22823;&#22810;&#25968;&#23454;&#29289;&#26399;&#26435;&#12290;Gaussian&#27010;&#29575;&#20998;&#24067;&#34987;&#29992;&#26469;&#24314;&#27169;&#26399;&#26435;&#32467;&#26524;&#19981;&#30830;&#23450;&#24615;&#65292;&#20316;&#20026;&#25237;&#36164;&#39033;&#30446;&#21487;&#34892;&#24615;&#30340;&#21028;&#26029;&#26631;&#20934;&#12290;</title><link>http://arxiv.org/abs/2303.09176</link><description>&lt;p&gt;
&#23454;&#29289;&#26399;&#26435;&#25216;&#26415;&#20316;&#20026;&#25112;&#30053;&#39118;&#38505;&#31649;&#29702;&#24037;&#20855;
&lt;/p&gt;
&lt;p&gt;
Real Options Technique as a Tool of Strategic Risk Management. (arXiv:2303.09176v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09176
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#20108;&#39033;&#24335;&#26641;&#21644;&#23454;&#29289;&#26399;&#26435;&#25216;&#26415;&#35780;&#20272;&#25237;&#36164;&#39033;&#30446;&#30340;&#26041;&#27861;&#65292;&#35813;&#25216;&#26415;&#21487;&#29992;&#20110;&#20225;&#19994;&#25112;&#30053;&#26041;&#38754;&#30340;&#22823;&#22810;&#25968;&#23454;&#29289;&#26399;&#26435;&#12290;Gaussian&#27010;&#29575;&#20998;&#24067;&#34987;&#29992;&#26469;&#24314;&#27169;&#26399;&#26435;&#32467;&#26524;&#19981;&#30830;&#23450;&#24615;&#65292;&#20316;&#20026;&#25237;&#36164;&#39033;&#30446;&#21487;&#34892;&#24615;&#30340;&#21028;&#26029;&#26631;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30456;&#36739;&#20110;&#20225;&#19994;&#25240;&#29616;&#29616;&#37329;&#27969;&#27169;&#22411;&#65292;&#22312;&#21487;&#34892;&#24615;&#30740;&#31350;&#20013;&#65292;&#23454;&#29289;&#26399;&#26435;&#26041;&#27861;&#29616;&#22312;&#34987;&#35748;&#20026;&#26159;&#19968;&#31181;&#26377;&#25928;&#30340;&#26367;&#20195;&#21697;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#31181;&#23454;&#29992;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#20108;&#39033;&#26641;&#21644;&#23454;&#29289;&#26399;&#26435;&#25216;&#26415;&#35780;&#20272;&#25237;&#36164;&#39033;&#30446;&#12290;&#24314;&#35758;&#20351;&#29992;&#19968;&#20010;&#35745;&#31639;&#27969;&#31243;&#65292;&#35813;&#27969;&#31243;&#21253;&#25324;&#20004;&#20010;&#23454;&#29289;&#26399;&#26435;&#30340;&#27963;&#21160;&#38454;&#27573;&#65292;&#36825;&#20004;&#20010;&#38454;&#27573;&#20998;&#21035;&#23545;&#24212;&#20110;&#38468;&#21152;&#25237;&#36164;&#12290;&#35813;&#25216;&#26415;&#21487;&#29992;&#20110;&#22823;&#22810;&#25968;&#23454;&#29289;&#26399;&#26435;&#65292;&#36825;&#22312;&#20225;&#19994;&#25112;&#30053;&#26041;&#38754;&#26159;&#23454;&#38469;&#24517;&#38656;&#30340;&#12290;&#20316;&#20026;&#23454;&#29289;&#26399;&#26435;&#24314;&#27169;&#30340;&#19979;&#19968;&#27493;&#65292;&#26412;&#25991;&#24320;&#21457;&#20102;&#21517;&#20026;&#20108;&#39033;&#24335;-&#38543;&#26426;&#29616;&#37329;&#27969;&#23454;&#29289;&#26399;&#26435;&#27169;&#22411;&#30340;&#29305;&#27530;&#26696;&#20363;&#65292;&#20854;&#20013;&#21253;&#21547;&#38543;&#26426;&#32467;&#26524;&#12290;&#25552;&#20986;&#20102;&#25237;&#36164;&#39033;&#30446;&#20215;&#20540;&#39118;&#38505;&#65292;&#24182;&#23558;&#20854;&#20316;&#20026;&#25237;&#36164;&#39033;&#30446;&#21487;&#34892;&#24615;&#30340;&#21028;&#26029;&#26631;&#20934;&#65292;&#20551;&#35774;&#23384;&#22312;&#38543;&#26426;&#32467;&#26524;&#12290;&#29305;&#21035;&#22320;&#65292;&#39640;&#26031;&#27010;&#29575;&#20998;&#24067;&#29992;&#20110;&#24314;&#27169;&#26399;&#26435;&#32467;&#26524;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#36873;&#25321;&#39640;&#26031;&#20998;&#24067;&#26159;&#22240;&#20026;&#24076;&#26395;&#33719;&#24471;&#23545;&#20559;&#26012;&#21644;&#23574;&#23792;&#30340;&#26356;&#22909;&#30340;&#27169;&#25311;&#12290;
&lt;/p&gt;
&lt;p&gt;
The real options approach is now considered an effective alternative to the corporate DCF model for a feasibility study. The current paper offers a practical methodology employing binomial trees and real options techniques for evaluating investment projects. A general computation procedure is suggested for the decision tree with two active stages of real options, which correspond to additional investments. The suggested technique can be used for most real options, which are practically essential regarding enterprise strategy. The special case named Binomial-Random-Cash-Flow Real Options Model with random outcomes is developed as the next step of real options modelling. Project Value at Risk is introduced and used as a criterion of investment project feasibility under the assumption regarding random outcomes. In particular, the Gaussian probability distribution is used for modelling option outcomes uncertainty. The choice of the Gaussian distribution is caused by the desire to obtain es
&lt;/p&gt;</description></item><item><title>&#35813;&#25991;&#20171;&#32461;&#20102;&#38480;&#21046;&#22312;&#32447;&#36861;&#36394;&#29992;&#25143;&#30340;&#26102;&#38388;&#65292;&#38024;&#23545;&#20986;&#29256;&#21830;&#21487;&#33021;&#20135;&#29983;&#30340;&#32463;&#27982;&#24433;&#21709;&#20570;&#20102;&#19968;&#20010;&#25104;&#26412;&#25928;&#30410;&#20998;&#26512;&#65292;&#30740;&#31350;&#21457;&#29616;Cookie&#23551;&#21629;&#38480;&#21046;&#22312;&#19968;&#24180;&#65288;&#20004;&#24180;&#65289;&#20250;&#20351;&#20854;&#20215;&#20540;&#38477;&#20302;25&#65285;&#65288;19&#65285;&#65289;&#65292;&#36825;&#34920;&#31034;&#25152;&#26377;Cookie&#20215;&#20540;&#20943;&#23569;&#20102;9&#65285;&#65288;5&#65285;&#65289;&#12290;</title><link>http://arxiv.org/abs/2303.09147</link><description>&lt;p&gt;
&#22312;&#32447;&#36861;&#36394;&#38480;&#21046;&#30340;&#32463;&#27982;&#21518;&#26524;
&lt;/p&gt;
&lt;p&gt;
Economic Consequences of Online Tracking Restrictions. (arXiv:2303.09147v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09147
&lt;/p&gt;
&lt;p&gt;
&#35813;&#25991;&#20171;&#32461;&#20102;&#38480;&#21046;&#22312;&#32447;&#36861;&#36394;&#29992;&#25143;&#30340;&#26102;&#38388;&#65292;&#38024;&#23545;&#20986;&#29256;&#21830;&#21487;&#33021;&#20135;&#29983;&#30340;&#32463;&#27982;&#24433;&#21709;&#20570;&#20102;&#19968;&#20010;&#25104;&#26412;&#25928;&#30410;&#20998;&#26512;&#65292;&#30740;&#31350;&#21457;&#29616;Cookie&#23551;&#21629;&#38480;&#21046;&#22312;&#19968;&#24180;&#65288;&#20004;&#24180;&#65289;&#20250;&#20351;&#20854;&#20215;&#20540;&#38477;&#20302;25&#65285;&#65288;19&#65285;&#65289;&#65292;&#36825;&#34920;&#31034;&#25152;&#26377;Cookie&#20215;&#20540;&#20943;&#23569;&#20102;9&#65285;&#65288;5&#65285;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#27431;&#27954;&#30417;&#31649;&#26426;&#26500;&#19968;&#30452;&#22312;&#23601;&#38480;&#21046;&#22312;&#32447;&#36861;&#36394;&#29992;&#25143;&#30340;&#26102;&#38388;&#20197;&#26356;&#22909;&#22320;&#20445;&#25252;&#28040;&#36153;&#32773;&#38544;&#31169;&#38382;&#39064;&#23637;&#24320;&#36777;&#35770;&#12290;&#23613;&#31649;&#36825;&#20123;&#36777;&#35770;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#65292;&#20294;&#26174;&#28982;&#32570;&#20047;&#20219;&#20309;&#32508;&#21512;&#30340;&#25104;&#26412;&#25928;&#30410;&#20998;&#26512;&#12290;&#26412;&#25991;&#20174;&#25104;&#26412;&#26041;&#38754;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#26088;&#22312;&#20272;&#35745;&#38480;&#21046;Cookie&#23551;&#21629;&#23545;&#20986;&#29256;&#21830;&#30340;&#32463;&#27982;&#24433;&#21709;&#12290;&#23545;&#22312;2.5&#24180;&#20869;&#25910;&#21040;1.28&#20159;&#24191;&#21578;&#23637;&#31034;&#30340;54,127&#20010;&#29992;&#25143;&#30340;Cookie&#36827;&#34892;&#30340;&#23454;&#35777;&#30740;&#31350;&#24471;&#20986;&#20102;&#24179;&#22343;Cookie&#23551;&#21629;&#20026;279&#22825;&#65292;&#24179;&#22343;&#20215;&#20540;&#20026;2.52&#27431;&#20803;/&#20010;&#12290;&#21482;&#26377;13%&#30340;cookie&#20250;&#38543;&#26102;&#38388;&#22686;&#20540;&#65292;&#20294;&#23427;&#20204;&#30340;&#24179;&#22343;&#20215;&#20540;&#32422;&#20026;&#25152;&#26377;cookie&#24179;&#22343;&#20215;&#20540;&#30340;&#22235;&#20493;&#12290;&#23558;Cookie&#23551;&#21629;&#38480;&#21046;&#22312;&#19968;&#24180;&#65288;&#20004;&#24180;&#65289;&#20250;&#20351;&#20854;&#23551;&#21629;&#20215;&#20540;&#38477;&#20302;25&#65285;&#65288;19&#65285;&#65289;&#65292;&#36825;&#34920;&#31034;&#25152;&#26377;Cookie&#20215;&#20540;&#20943;&#23569;&#20102;9&#65285;&#65288;5&#65285;&#65289;&#12290;&#37492;&#20110;106&#20159;&#27431;&#20803;&#30340;&#22522;&#20110;Cookie&#30340;&#23637;&#31034;&#24191;&#21578;&#25910;&#20837;&#65292;Cookie&#38480;&#21046;&#21487;&#33021;&#23545;&#20986;&#29256;&#21830;&#20135;&#29983;&#26174;&#30528;&#30340;&#32463;&#27982;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
In recent years, European regulators have debated restricting the time an online tracker can track a user to protect consumer privacy better. Despite the significance of these debates, there has been a noticeable absence of any comprehensive cost-benefit analysis. This article fills this gap on the cost side by suggesting an approach to estimate the economic consequences of lifetime restrictions on cookies for publishers. The empirical study on cookies of 54,127 users who received 128 million ad impressions over 2.5 years yields an average cookie lifetime of 279 days, with an average value of EUR 2.52 per cookie. Only 13% of all cookies increase their daily value over time, but their average value is about four times larger than the average value of all cookies. Restricting cookies lifetime to one year (two years) decreases their lifetime value by 25% (19%), which represents a decrease in the value of all cookies of 9% (5%). In light of the EUR 10.60 billion cookie-based display ad rev
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#20998;&#26512;&#36816;&#29992;&#22826;&#31354;&#32463;&#27982;&#23398;&#26694;&#26550;&#23545;&#26376;&#29699;&#25512;&#36827;&#21058;&#29983;&#20135;&#30340;&#38271;&#26399;&#25104;&#26412;&#36827;&#34892;&#24314;&#27169;&#65292;&#30740;&#31350;&#23545;&#27604;&#20174;&#22320;&#29699;&#21457;&#23556;&#30340;&#25512;&#36827;&#21058;&#26159;&#21542;&#20855;&#26377;&#21830;&#19994;&#31454;&#20105;&#21147;&#65292;&#32467;&#26524;&#21457;&#29616;&#36816;&#36755;&#25104;&#26412;&#27604;&#21644;&#36164;&#26412;&#20135;&#37327;&#27604;&#26159;&#20915;&#23450;&#31454;&#20105;&#21147;&#30340;&#37325;&#35201;&#22240;&#32032;&#65292;&#32780;&#20043;&#21069;&#20998;&#26512;&#32467;&#26524;&#30340;&#20998;&#27495;&#26159;&#30001;&#20110;&#36873;&#25321;&#39640;&#25104;&#26412;&#27604;&#20363;&#30340;&#36816;&#36755;&#26550;&#26500;&#21644;&#24573;&#30053;&#25552;&#39640;&#36164;&#26412;&#20135;&#37327;&#27604;&#30340;&#20851;&#38190;&#22240;&#32032;&#36896;&#25104;&#30340;&#12290;</title><link>http://arxiv.org/abs/2303.09011</link><description>&lt;p&gt;
&#22826;&#31354;&#32463;&#27982;&#23398;&#21644;&#26376;&#29699;&#34893;&#29983;&#25512;&#36827;&#21058;&#31454;&#20105;&#21147;
&lt;/p&gt;
&lt;p&gt;
Economics of In-Space Industry and Competitiveness of Lunar-Derived Rocket Propellant. (arXiv:2303.09011v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09011
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#20998;&#26512;&#36816;&#29992;&#22826;&#31354;&#32463;&#27982;&#23398;&#26694;&#26550;&#23545;&#26376;&#29699;&#25512;&#36827;&#21058;&#29983;&#20135;&#30340;&#38271;&#26399;&#25104;&#26412;&#36827;&#34892;&#24314;&#27169;&#65292;&#30740;&#31350;&#23545;&#27604;&#20174;&#22320;&#29699;&#21457;&#23556;&#30340;&#25512;&#36827;&#21058;&#26159;&#21542;&#20855;&#26377;&#21830;&#19994;&#31454;&#20105;&#21147;&#65292;&#32467;&#26524;&#21457;&#29616;&#36816;&#36755;&#25104;&#26412;&#27604;&#21644;&#36164;&#26412;&#20135;&#37327;&#27604;&#26159;&#20915;&#23450;&#31454;&#20105;&#21147;&#30340;&#37325;&#35201;&#22240;&#32032;&#65292;&#32780;&#20043;&#21069;&#20998;&#26512;&#32467;&#26524;&#30340;&#20998;&#27495;&#26159;&#30001;&#20110;&#36873;&#25321;&#39640;&#25104;&#26412;&#27604;&#20363;&#30340;&#36816;&#36755;&#26550;&#26500;&#21644;&#24573;&#30053;&#25552;&#39640;&#36164;&#26412;&#20135;&#37327;&#27604;&#30340;&#20851;&#38190;&#22240;&#32032;&#36896;&#25104;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;&#19968;&#31181;&#22312;&#20004;&#20010;&#26143;&#29699;&#38388;&#36827;&#34892;&#30340;&#22826;&#31354;&#20135;&#19994;&#30340;&#32463;&#27982;&#21442;&#25968;&#65292;&#36164;&#26412;&#22312;&#31532;&#19968;&#20010;&#26143;&#29699;&#19978;&#21046;&#36896;&#65292;&#36816;&#24448;&#31532;&#20108;&#20010;&#26143;&#29699;&#19978;&#36827;&#34892;&#36828;&#31243;&#25805;&#20316;&#65292;&#20135;&#21697;&#20877;&#34987;&#36816;&#36755;&#31163;&#24320;&#31532;&#20108;&#20010;&#26143;&#29699;&#36827;&#34892;&#28040;&#36153;&#12290;&#36816;&#29992;&#36825;&#19968;&#26694;&#26550;&#65292;&#23545;&#26376;&#29699;&#25512;&#36827;&#21058;&#29983;&#20135;&#30340;&#38271;&#26399;&#25104;&#26412;&#36827;&#34892;&#24314;&#27169;&#65292;&#20197;&#22238;&#31572;&#23427;&#26159;&#21542;&#19982;&#20174;&#22320;&#29699;&#21457;&#23556;&#30340;&#25512;&#36827;&#21058;&#20855;&#26377;&#21830;&#19994;&#31454;&#20105;&#21147;&#12290;&#20043;&#21069;&#30340;&#25216;&#26415;&#32463;&#27982;&#20998;&#26512;&#22312;&#36825;&#19968;&#38382;&#39064;&#19978;&#23384;&#22312;&#20998;&#27495;&#12290;&#36164;&#26412;&#36816;&#36755;&#30340;&#25104;&#26412;&#27604;&#20363;&#21644;&#36164;&#26412;&#29983;&#20135;&#30340;&#20135;&#37327;&#27604;&#34987;&#30830;&#23450;&#20026;&#20915;&#23450;&#31454;&#20105;&#21147;&#30340;&#26368;&#37325;&#35201;&#22240;&#32032;&#12290;&#20998;&#26512;&#20102;&#20043;&#21069;&#30340;&#25216;&#26415;&#32463;&#27982;&#20998;&#26512;&#22914;&#20309;&#22788;&#29702;&#36825;&#20004;&#20010;&#25351;&#26631;&#12290;&#25351;&#20986;&#20102;&#19968;&#20123;&#25216;&#26415;&#32463;&#27982;&#20998;&#26512;&#20013;&#30340;&#20851;&#38190;&#38169;&#35823;&#65306;&#36873;&#25321;&#20855;&#26377;&#39640;&#25104;&#26412;&#27604;&#20363;&#30340;&#36816;&#36755;&#26550;&#26500;&#65292;&#24182;&#24573;&#30053;&#20102;&#21487;&#20197;&#23454;&#29616;&#36275;&#22815;&#20135;&#37327;&#27604;&#30340;&#36164;&#26412;&#36873;&#25321;&#12290;&#24080;&#31735;&#21319;&#21326;&#25216;&#26415;&#30340;&#20135;&#37327;&#27604;&#20540;&#25509;&#36817;1&#12290;
&lt;/p&gt;
&lt;p&gt;
Economic parameters are identified for an in-space industry where the capital is made on one planet, it is transported to and teleoperated on a second planet, and the product is transported off the second planet for consumption. This framework is used to model the long-run cost of lunar propellant production to help answer whether it is commercially competitive against propellant launched from Earth. The prior techno-economic analyses (TEAs) of lunar propellant production had disagreed over this. The "gear ratio on cost" for capital transport, G, and the production mass ratio of the capital, phi, are identified as the most important factors determining competitiveness. The prior TEAs are examined for how they handled these two metrics. This identifies crucial mistakes in some of the TEAs: choosing transportation architectures with high G, and neglecting to make choices for the capital that could achieve adequate phi. The tent sublimation technology has a value of phi that is an order o
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#32422;&#31070;&#32463;&#32593;&#32476;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#65292;&#19981;&#20381;&#36182;&#20110;&#21160;&#24577;&#35268;&#21010;&#25216;&#26415;&#65292;&#36991;&#20813;&#20102;&#39640;&#32500;&#26465;&#20214;&#26399;&#26395;&#30340;&#35745;&#31639;&#65292;&#22312;&#32771;&#34385;&#22823;&#37327;&#22522;&#30784;&#36164;&#20135;&#12289;&#38271;&#26399;&#25237;&#36164;&#26102;&#38388;&#33539;&#22260;&#25110;&#38750;&#24120;&#39057;&#32321;&#30340;&#20877;&#24179;&#34913;&#20107;&#20214;&#26102;&#65292;&#35813;&#26041;&#27861;&#20173;&#28982;&#26159;&#23454;&#29992;&#30340;&#12290;</title><link>http://arxiv.org/abs/2303.08968</link><description>&lt;p&gt;
&#19968;&#31181;&#31616;&#32422;&#31070;&#32463;&#32593;&#32476;&#26041;&#27861;&#35299;&#20915;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#32780;&#19981;&#20351;&#29992;&#21160;&#24577;&#35268;&#21010;
&lt;/p&gt;
&lt;p&gt;
A parsimonious neural network approach to solve portfolio optimization problems without using dynamic programming. (arXiv:2303.08968v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.08968
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#32422;&#31070;&#32463;&#32593;&#32476;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#65292;&#19981;&#20381;&#36182;&#20110;&#21160;&#24577;&#35268;&#21010;&#25216;&#26415;&#65292;&#36991;&#20813;&#20102;&#39640;&#32500;&#26465;&#20214;&#26399;&#26395;&#30340;&#35745;&#31639;&#65292;&#22312;&#32771;&#34385;&#22823;&#37327;&#22522;&#30784;&#36164;&#20135;&#12289;&#38271;&#26399;&#25237;&#36164;&#26102;&#38388;&#33539;&#22260;&#25110;&#38750;&#24120;&#39057;&#32321;&#30340;&#20877;&#24179;&#34913;&#20107;&#20214;&#26102;&#65292;&#35813;&#26041;&#27861;&#20173;&#28982;&#26159;&#23454;&#29992;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#32422;&#31070;&#32463;&#32593;&#32476;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#19981;&#20381;&#36182;&#20110;&#21160;&#24577;&#35268;&#21010;&#25216;&#26415;&#65292;&#29992;&#20110;&#35299;&#20915;&#21463;&#22810;&#20010;&#25237;&#36164;&#32422;&#26463;&#38480;&#21046;&#30340;&#21160;&#24577;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#12290;&#31070;&#32463;&#32593;&#32476;&#65288;&#21487;&#33021;&#26159;&#28145;&#24230;&#30340;&#65289;&#30340;&#21442;&#25968;&#25968;&#37327;&#19982;&#32452;&#21512;&#20877;&#24179;&#34913;&#20107;&#20214;&#30340;&#25968;&#37327;&#26080;&#20851;&#65292;&#19982;&#24378;&#21270;&#23398;&#20064;&#31561;&#26041;&#27861;&#30456;&#27604;&#65292;&#35813;&#26041;&#27861;&#36991;&#20813;&#20102;&#39640;&#32500;&#26465;&#20214;&#26399;&#26395;&#30340;&#35745;&#31639;&#12290;&#22240;&#27492;&#65292;&#22312;&#32771;&#34385;&#22823;&#37327;&#22522;&#30784;&#36164;&#20135;&#12289;&#38271;&#26399;&#25237;&#36164;&#26102;&#38388;&#33539;&#22260;&#25110;&#38750;&#24120;&#39057;&#32321;&#30340;&#20877;&#24179;&#34913;&#20107;&#20214;&#26102;&#65292;&#35813;&#26041;&#27861;&#20173;&#28982;&#26159;&#23454;&#29992;&#30340;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#25968;&#23383;&#35299;&#30340;&#25910;&#25947;&#24615;&#65292;&#36825;&#20123;&#25968;&#23383;&#35299;&#26159;&#22312;&#30456;&#24403;&#26222;&#36941;&#30340;&#26465;&#20214;&#19979;&#65292;&#35299;&#20915;&#20102;&#19968;&#22823;&#31867;&#38382;&#39064;&#30340;&#29702;&#35770;&#26368;&#20248;&#35299;&#65292;&#24182;&#20026;&#19968;&#20123;&#24120;&#35265;&#30340;&#20844;&#24335;&#65292;&#21253;&#25324;&#22343;&#20540;&#26041;&#24046;&#21644;&#22343;&#20540;&#26465;&#20214;&#39118;&#38505;&#20540;&#38382;&#39064;&#25552;&#20379;&#20102;&#30495;&#23454;&#30340;&#20998;&#26512;&#12290;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#35299;&#20915;Sortino&#27604;&#20363;&#21551;&#21457;&#24335;&#30446;&#26631;&#26159;&#21487;&#34892;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a parsimonious neural network approach, which does not rely on dynamic programming techniques, to solve dynamic portfolio optimization problems subject to multiple investment constraints. The number of parameters of the (potentially deep) neural network remains independent of the number of portfolio rebalancing events, and in contrast to, for example, reinforcement learning, the approach avoids the computation of high-dimensional conditional expectations. As a result, the approach remains practical even when considering large numbers of underlying assets, long investment time horizons or very frequent rebalancing events. We prove convergence of the numerical solution to the theoretical optimal solution of a large class of problems under fairly general conditions, and present ground truth analyses for a number of popular formulations, including mean-variance and mean-conditional value-at-risk problems. We also show that it is feasible to solve Sortino ratio-inspired objective
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36125;&#21494;&#26031;&#24066;&#22330;&#39044;&#26399;&#30340;&#31616;&#21333;&#27169;&#22411;&#65292;&#21487;&#20197;&#35299;&#37322;&#37329;&#34701;&#36164;&#20135;&#20215;&#26684;&#23545;&#19968;&#31995;&#21015;&#20132;&#26131;&#30340;&#24433;&#21709;&#65292;&#21253;&#25324;&#20132;&#26131;&#37327;&#19982;&#20215;&#26684;&#27874;&#21160;&#24179;&#26041;&#26681;&#25104;&#27491;&#27604;&#12289;&#23567;&#20132;&#26131;&#37327;&#26102;&#25104;&#32447;&#24615;&#20851;&#31995;&#12289;&#20132;&#26131;&#32467;&#26463;&#21518;&#24433;&#21709;&#34928;&#20943;&#22238;&#21040;&#22343;&#34913;&#12290;&#24179;&#26041;&#26681;&#24433;&#21709;&#23450;&#24459;&#21487;&#33021;&#26469;&#33258;&#20110;&#23545;&#20803;&#35746;&#21333;&#35746;&#21333;&#27969;&#30340;&#39640;&#20272;&#12290;</title><link>http://arxiv.org/abs/2303.08867</link><description>&lt;p&gt;
&#24066;&#22330;&#24433;&#21709;&#30340;&#24179;&#26041;&#26681;&#23450;&#24459;&#30340;&#36125;&#21494;&#26031;&#25512;&#23548;
&lt;/p&gt;
&lt;p&gt;
A Bayesian derivation of the square root law of market impact. (arXiv:2303.08867v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.08867
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36125;&#21494;&#26031;&#24066;&#22330;&#39044;&#26399;&#30340;&#31616;&#21333;&#27169;&#22411;&#65292;&#21487;&#20197;&#35299;&#37322;&#37329;&#34701;&#36164;&#20135;&#20215;&#26684;&#23545;&#19968;&#31995;&#21015;&#20132;&#26131;&#30340;&#24433;&#21709;&#65292;&#21253;&#25324;&#20132;&#26131;&#37327;&#19982;&#20215;&#26684;&#27874;&#21160;&#24179;&#26041;&#26681;&#25104;&#27491;&#27604;&#12289;&#23567;&#20132;&#26131;&#37327;&#26102;&#25104;&#32447;&#24615;&#20851;&#31995;&#12289;&#20132;&#26131;&#32467;&#26463;&#21518;&#24433;&#21709;&#34928;&#20943;&#22238;&#21040;&#22343;&#34913;&#12290;&#24179;&#26041;&#26681;&#24433;&#21709;&#23450;&#24459;&#21487;&#33021;&#26469;&#33258;&#20110;&#23545;&#20803;&#35746;&#21333;&#35746;&#21333;&#27969;&#30340;&#39640;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#23637;&#31034;&#20102;&#19968;&#20010;&#20196;&#20154;&#24778;&#35766;&#30340;&#31616;&#21333;&#27169;&#22411;&#30340;&#23436;&#20840;&#36125;&#21494;&#26031;&#24066;&#22330;&#39044;&#26399;&#65292;&#21487;&#20197;&#24674;&#22797;&#23545;&#37329;&#34701;&#36164;&#20135;&#20215;&#26684;&#30340;&#19968;&#31995;&#21015;&#20132;&#26131;&#24433;&#21709;&#30340;&#20027;&#35201;&#32463;&#39564;&#21457;&#29616;&#65292;&#20854;&#20013;&#21253;&#25324;&#65288;i&#65289;&#39044;&#26399;&#20215;&#26684;&#21464;&#21160;&#38543;&#24635;&#20132;&#26131;&#37327;&#21576;&#29616;&#20986;&#24179;&#26041;&#26681;&#34892;&#20026;&#65292;&#65288;ii&#65289;&#23545;&#20110;&#23567;&#20132;&#26131;&#37327;&#65292;&#23427;&#20132;&#21449;&#21040;&#32447;&#24615;&#21306;&#22495;&#65292;&#20197;&#21450;&#65288;iii&#65289;&#22312;&#20132;&#26131;&#24207;&#21015;&#32467;&#26463;&#21518;&#22238;&#21040;&#22343;&#34913;&#30340;&#24433;&#21709;&#34928;&#20943;&#12290;&#36825;&#31181;&#25512;&#23548;&#30340;&#31616;&#21333;&#24615;&#36827;&#19968;&#27493;&#25903;&#25345;&#20102;&#23427;&#30340;&#40065;&#26834;&#24615;&#21644;&#26222;&#36866;&#24615;&#65292;&#24182;&#25581;&#31034;&#20102;&#23427;&#30340;&#36215;&#28304;&#12290;&#29305;&#21035;&#22320;&#65292;&#23427;&#34920;&#26126;&#24179;&#26041;&#26681;&#24433;&#21709;&#23450;&#24459;&#28304;&#20110;&#23545;&#26469;&#33258;&#20803;&#35746;&#21333;&#30340;&#35746;&#21333;&#27969;&#30340;&#39640;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;
We show that the main empirical findings on the impact of a sequence of transactions on prices of financial assets can be recovered within a surprisingly simple model with fully Bayesian market expectations. This includes {\em i)} the square-root behavior of the expected price variation with the total volume traded, {\em ii)} it's crossover to a linear regime for small volumes, and {\em iii)} the impact decay back to equilibrium, after the sequence of trades is over. The simplicity of this derivation lends further support to its robustness and universality, and it sheds light on its origin. In particular, it suggests that the square-root impact law originates from the over-estimation of order flows originating from meta-orders.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#30340;&#36830;&#32493;&#26102;&#38388;&#20581;&#22766;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#65292;&#36890;&#36807;&#23545;&#20598;&#24615;&#35777;&#26126;&#20102;&#23545;&#25968;&#12289;&#25351;&#25968;&#21644;&#24130;&#25928;&#29992;&#30340;&#26368;&#20248;&#32452;&#21512;&#30340;&#23384;&#22312;&#24615;&#12290;</title><link>http://arxiv.org/abs/2206.14015</link><description>&lt;p&gt;
&#38750;&#32447;&#24615;&#36830;&#32493;&#21322;&#38789;&#19979;&#30340;&#20581;&#22766;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Robust utility maximization with nonlinear continuous semimartingales. (arXiv:2206.14015v3 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.14015
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#30340;&#36830;&#32493;&#26102;&#38388;&#20581;&#22766;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#65292;&#36890;&#36807;&#23545;&#20598;&#24615;&#35777;&#26126;&#20102;&#23545;&#25968;&#12289;&#25351;&#25968;&#21644;&#24130;&#25928;&#29992;&#30340;&#26368;&#20248;&#32452;&#21512;&#30340;&#23384;&#22312;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#22312;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#30340;&#36830;&#32493;&#26102;&#38388;&#20581;&#22766;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#12290;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#30001;&#20855;&#26377;&#19981;&#30830;&#23450;&#23616;&#37096;&#29305;&#24449;&#30340;&#36830;&#32493;&#21322;&#38789;&#25152;&#25511;&#21046;&#12290;&#22312;&#27492;&#22788;&#65292;&#24494;&#20998;&#29305;&#24449;&#30001;&#19968;&#20010;&#21462;&#20915;&#20110;&#26102;&#38388;&#21644;&#36335;&#24452;&#30340;&#38598;&#21512;&#20540;&#20989;&#25968;&#25152;&#35268;&#23450;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#20581;&#22766;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#19982;&#20849;&#36717;&#38382;&#39064;&#30340;&#23545;&#20598;&#24615;&#65292;&#24182;&#30740;&#31350;&#20102;&#23545;&#25968;&#12289;&#25351;&#25968;&#21644;&#24130;&#25928;&#29992;&#30340;&#26368;&#20248;&#32452;&#21512;&#30340;&#23384;&#22312;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper we study a robust utility maximization problem in continuous time under model uncertainty. The model uncertainty is governed by a continuous semimartingale with uncertain local characteristics. Here, the differential characteristics are prescribed by a set-valued function that depends on time and path. We show that the robust utility maximization problem is in duality with a conjugate problem, and study the existence of optimal portfolios for logarithmic, exponential and power utilities.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;Tail-GAN&#26469;&#23398;&#20064;&#27169;&#25311;&#23614;&#37096;&#39118;&#38505;&#24773;&#26223;&#12290;&#35813;&#26041;&#27861;&#21033;&#29992;&#20102;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#21644;&#39118;&#38505;&#20215;&#20540;&#21450;&#39044;&#26399;&#25910;&#30410;&#29575;&#30340;&#32852;&#21512;&#35825;&#23548;&#23646;&#24615;&#65292;&#22312;&#20445;&#30041;&#32479;&#35745;&#25968;&#25454;&#30340;&#22522;&#30784;&#19978;&#27169;&#25311;&#20215;&#26684;&#24773;&#26223;&#12290;&#36890;&#36807;&#22823;&#37327;&#23454;&#39564;&#35777;&#26126;&#65292;&#35813;&#26041;&#27861;&#34920;&#29616;&#20986;&#26356;&#20934;&#30830;&#12289;&#26356;&#24555;&#36895;&#21644;&#26356;&#31283;&#20581;&#30340;&#29305;&#28857;&#12290;</title><link>http://arxiv.org/abs/2203.01664</link><description>&lt;p&gt;
Tail-GAN&#65306;&#23398;&#20064;&#27169;&#25311;&#23614;&#37096;&#39118;&#38505;&#24773;&#26223;
&lt;/p&gt;
&lt;p&gt;
Tail-GAN: Learning to Simulate Tail Risk Scenarios. (arXiv:2203.01664v2 [q-fin.RM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.01664
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;Tail-GAN&#26469;&#23398;&#20064;&#27169;&#25311;&#23614;&#37096;&#39118;&#38505;&#24773;&#26223;&#12290;&#35813;&#26041;&#27861;&#21033;&#29992;&#20102;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#21644;&#39118;&#38505;&#20215;&#20540;&#21450;&#39044;&#26399;&#25910;&#30410;&#29575;&#30340;&#32852;&#21512;&#35825;&#23548;&#23646;&#24615;&#65292;&#22312;&#20445;&#30041;&#32479;&#35745;&#25968;&#25454;&#30340;&#22522;&#30784;&#19978;&#27169;&#25311;&#20215;&#26684;&#24773;&#26223;&#12290;&#36890;&#36807;&#22823;&#37327;&#23454;&#39564;&#35777;&#26126;&#65292;&#35813;&#26041;&#27861;&#34920;&#29616;&#20986;&#26356;&#20934;&#30830;&#12289;&#26356;&#24555;&#36895;&#21644;&#26356;&#31283;&#20581;&#30340;&#29305;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21160;&#24577;&#25237;&#36164;&#32452;&#21512;&#30340;&#25439;&#22833;&#20998;&#24067;&#20272;&#35745;&#38656;&#35201;&#27169;&#25311;&#20195;&#34920;&#20854;&#32452;&#25104;&#37096;&#20998;&#30340;&#32852;&#21512;&#21160;&#24577;&#30340;&#24773;&#26223;&#65292;&#29305;&#21035;&#37325;&#35201;&#30340;&#26159;&#27169;&#25311;&#23614;&#37096;&#39118;&#38505;&#24773;&#26223;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#65292;&#21033;&#29992;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65288;GAN&#65289;&#32467;&#26500;&#24182;&#21033;&#29992;&#39118;&#38505;&#20215;&#20540;&#65288;VaR&#65289;&#21644;&#39044;&#26399;&#25910;&#30410;&#29575;&#65288;ES&#65289;&#30340;&#32852;&#21512;&#35825;&#23548;&#23646;&#24615;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#33021;&#22815;&#23398;&#20064;&#27169;&#25311;&#20855;&#26377;&#20445;&#30041;&#22522;&#20934;&#20132;&#26131;&#31574;&#30053;&#30340;&#23614;&#37096;&#39118;&#38505;&#29305;&#24449;&#30340;&#20215;&#26684;&#24773;&#26223;&#65292;&#21253;&#25324;&#19968;&#33268;&#30340;&#32479;&#35745;&#25968;&#25454;&#65292;&#22914; VaR &#21644; ES&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#24191;&#27867;&#30340;&#39118;&#38505;&#24230;&#37327;&#31867;&#21035;&#19979;&#65292;&#25105;&#20204;&#30340;&#29983;&#25104;&#22120;&#20855;&#26377;&#26222;&#36866;&#36924;&#36817;&#23450;&#29702;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#35777;&#26126;&#29983;&#25104;&#22120;&#21644;&#37492;&#21035;&#22120;&#20043;&#38388;&#30340;&#21452;&#23618;&#20248;&#21270;&#20844;&#24335;&#31561;&#20215;&#20110;&#19968;&#20010;&#26497;&#22823;&#26497;&#23567;&#21338;&#24328;&#65292;&#20174;&#32780;&#23548;&#33268;&#26356;&#26377;&#25928;&#21644;&#23454;&#29992;&#30340;&#20844;&#24335;&#26469;&#35757;&#32451;&#12290;&#25105;&#20204;&#30340;&#25968;&#20540;&#23454;&#39564;&#34920;&#26126;&#65292;&#19982;&#20256;&#32479;&#26041;&#27861;&#30456;&#27604;&#65292;Tail-Gan&#26377;&#26356;&#20934;&#30830;&#12289;&#26356;&#24555;&#36895;&#21644;&#26356;&#31283;&#20581;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
The estimation of loss distributions for dynamic portfolios requires the simulation of scenarios representing realistic joint dynamics of their components, with particular importance devoted to the simulation of tail risk scenarios. We propose a novel data-driven approach that utilizes Generative Adversarial Network (GAN) architecture and exploits the joint elicitability property of Value-at-Risk (VaR) and Expected Shortfall (ES). Our proposed approach is capable of learning to simulate price scenarios that preserve tail risk features for benchmark trading strategies, including consistent statistics such as VaR and ES.  In this paper, we prove a universal approximation theorem for our generator under a broad class of risk measures. In addition, we prove that the bi-level optimization formulation between the generator and the discriminator is equivalent to a max-min game, leading to a more effective and practical formulation for training. Our numerical experiments show that, in contrast
&lt;/p&gt;</description></item></channel></rss>