<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#19968;&#32676;&#26234;&#33021;&#20307;&#30340;&#20154;&#38469;&#20449;&#20219;&#65292;&#21457;&#29616;&#38543;&#30528;&#26102;&#38388;&#25512;&#31227;&#65292;&#25972;&#20010;&#32676;&#20307;&#35201;&#20040;&#22987;&#32456;&#21512;&#20316;&#65292;&#35201;&#20040;&#22987;&#32456;&#32972;&#21467;&#12290;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#21457;&#29616;&#65292;&#26234;&#33021;&#20307;&#30340;&#35760;&#24518;&#21644;&#32676;&#20307;&#35268;&#27169;&#23545;&#32467;&#26524;&#20135;&#29983;&#24433;&#21709;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#19981;&#21516;&#30340;&#32676;&#20307;&#21487;&#33021;&#20250;&#22240;&#20026;&#26426;&#20250;&#30340;&#21407;&#22240;&#32780;&#36235;&#21521;&#20110;&#39640;&#25110;&#20302;&#20449;&#20219;&#29366;&#24577;&#65292;&#20294;&#31038;&#20250;&#32972;&#26223;&#20063;&#20250;&#36215;&#21040;&#37325;&#35201;&#20316;&#29992;&#12290;</title><link>https://arxiv.org/abs/2402.03894</link><description>&lt;p&gt;
&#20154;&#38469;&#20449;&#20219;&#65306;&#20855;&#26377;&#22810;&#26234;&#33021;&#20307;&#23398;&#20064;&#30340;&#38543;&#26426;&#21327;&#35843;&#21338;&#24328;&#30340;&#28176;&#36817;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Interpersonal trust: Asymptotic analysis of a stochastic coordination game with multi-agent learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.03894
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#19968;&#32676;&#26234;&#33021;&#20307;&#30340;&#20154;&#38469;&#20449;&#20219;&#65292;&#21457;&#29616;&#38543;&#30528;&#26102;&#38388;&#25512;&#31227;&#65292;&#25972;&#20010;&#32676;&#20307;&#35201;&#20040;&#22987;&#32456;&#21512;&#20316;&#65292;&#35201;&#20040;&#22987;&#32456;&#32972;&#21467;&#12290;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#21457;&#29616;&#65292;&#26234;&#33021;&#20307;&#30340;&#35760;&#24518;&#21644;&#32676;&#20307;&#35268;&#27169;&#23545;&#32467;&#26524;&#20135;&#29983;&#24433;&#21709;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#19981;&#21516;&#30340;&#32676;&#20307;&#21487;&#33021;&#20250;&#22240;&#20026;&#26426;&#20250;&#30340;&#21407;&#22240;&#32780;&#36235;&#21521;&#20110;&#39640;&#25110;&#20302;&#20449;&#20219;&#29366;&#24577;&#65292;&#20294;&#31038;&#20250;&#32972;&#26223;&#20063;&#20250;&#36215;&#21040;&#37325;&#35201;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#32676;&#26234;&#33021;&#20307;&#30340;&#20154;&#38469;&#20449;&#20219;&#65292;&#25506;&#35752;&#20102;&#26426;&#20250;&#26159;&#21542;&#20250;&#20915;&#23450;&#19968;&#20010;&#32676;&#20307;&#26368;&#32456;&#26159;&#22788;&#20110;&#39640;&#20449;&#20219;&#36824;&#26159;&#20302;&#20449;&#20219;&#29366;&#24577;&#12290;&#25105;&#20204;&#29992;&#31163;&#25955;&#26102;&#38388;&#12289;&#38543;&#26426;&#21305;&#37197;&#30340;&#21327;&#35843;&#21338;&#24328;&#27169;&#22411;&#26469;&#24314;&#27169;&#12290;&#26234;&#33021;&#20307;&#23545;&#37051;&#23621;&#30340;&#34892;&#20026;&#37319;&#29992;&#25351;&#25968;&#24179;&#28369;&#23398;&#20064;&#35268;&#21017;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#38543;&#30528;&#26102;&#38388;&#25512;&#31227;&#65292;&#25972;&#20010;&#32676;&#20307;&#35201;&#20040;&#22987;&#32456;&#21512;&#20316;&#65292;&#35201;&#20040;&#22987;&#32456;&#32972;&#21467;&#65292;&#36825;&#31181;&#24773;&#20917;&#20197;&#27010;&#29575;1&#21457;&#29983;&#12290;&#36890;&#36807;&#27169;&#25311;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#28216;&#25103;&#20013;&#25910;&#30410;&#20998;&#24067;&#21644;&#25351;&#25968;&#24179;&#28369;&#23398;&#20064;&#65288;&#26234;&#33021;&#20307;&#30340;&#35760;&#24518;&#65289;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#38543;&#30528;&#26234;&#33021;&#20307;&#35760;&#24518;&#30340;&#22686;&#21152;&#25110;&#32676;&#20307;&#35268;&#27169;&#30340;&#22686;&#21152;&#65292;&#23454;&#38469;&#21160;&#24577;&#24320;&#22987;&#19982;&#36807;&#31243;&#30340;&#26399;&#26395;&#30456;&#20284;&#12290;&#25105;&#20204;&#24471;&#20986;&#32467;&#35770;&#65292;&#19981;&#21516;&#30340;&#32676;&#20307;&#21487;&#33021;&#20165;&#20165;&#26159;&#30001;&#20110;&#26426;&#20250;&#30340;&#21407;&#22240;&#32780;&#25910;&#25947;&#21040;&#39640;&#25110;&#20302;&#20449;&#20219;&#30340;&#29366;&#24577;&#65292;&#23613;&#31649;&#28216;&#25103;&#21442;&#25968;&#65288;&#31038;&#20250;&#32972;&#26223;&#65289;&#21487;&#33021;&#36215;&#30528;&#37325;&#35201;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the interpersonal trust of a population of agents, asking whether chance may decide if a population ends up in a high trust or low trust state. We model this by a discrete time, random matching stochastic coordination game. Agents are endowed with an exponential smoothing learning rule about the behaviour of their neighbours. We find that, with probability one in the long run the whole population either always cooperates or always defects. By simulation we study the impact of the distributions of the payoffs in the game and of the exponential smoothing learning (memory of the agents). We find, that as the agent memory increases or as the size of the population increases, the actual dynamics start to resemble the expectation of the process. We conclude that it is indeed possible that different populations may converge upon high or low trust between its citizens simply by chance, though the game parameters (context of the society) may be quite telling.
&lt;/p&gt;</description></item><item><title>Summan, Nandi, and Bloom&#21457;&#29616;&#65292;&#21360;&#24230;&#36890;&#29992;&#20813;&#30123;&#35745;&#21010;&#23545;&#23156;&#20799;&#30340;&#20813;&#30123;&#26292;&#38706;&#23545;&#20854;&#25104;&#24180;&#21518;&#30340;&#21608;&#34218;&#21644;&#20154;&#22343;&#23478;&#24237;&#28040;&#36153;&#26377;&#27491;&#21521;&#24433;&#21709;&#12290;&#28982;&#32780;&#65292;&#20182;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#21487;&#33021;&#21463;&#21040;&#24180;&#40836;&#21644;&#20986;&#29983;&#24180;&#20221;&#36825;&#20004;&#20010;&#30456;&#20851;&#21464;&#37327;&#30340;&#24433;&#21709;&#65292;&#19988;&#21487;&#33021;&#19982;&#35843;&#26597;&#26399;&#38388;&#30340;&#36235;&#21183;&#30456;&#20851;&#12290;</title><link>http://arxiv.org/abs/2401.11100</link><description>&lt;p&gt;
&#21360;&#24230;&#20799;&#31461;&#20813;&#30123;&#35745;&#21010;&#23545;&#25910;&#20837;&#21644;&#28040;&#36153;&#25903;&#20986;&#30340;&#38271;&#26399;&#24433;&#21709;&#65306;&#35780;&#36848;
&lt;/p&gt;
&lt;p&gt;
Long-term Effects of India's Childhood Immunization Program on Earnings and Consumption Expenditure: Comment. (arXiv:2401.11100v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11100
&lt;/p&gt;
&lt;p&gt;
Summan, Nandi, and Bloom&#21457;&#29616;&#65292;&#21360;&#24230;&#36890;&#29992;&#20813;&#30123;&#35745;&#21010;&#23545;&#23156;&#20799;&#30340;&#20813;&#30123;&#26292;&#38706;&#23545;&#20854;&#25104;&#24180;&#21518;&#30340;&#21608;&#34218;&#21644;&#20154;&#22343;&#23478;&#24237;&#28040;&#36153;&#26377;&#27491;&#21521;&#24433;&#21709;&#12290;&#28982;&#32780;&#65292;&#20182;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#21487;&#33021;&#21463;&#21040;&#24180;&#40836;&#21644;&#20986;&#29983;&#24180;&#20221;&#36825;&#20004;&#20010;&#30456;&#20851;&#21464;&#37327;&#30340;&#24433;&#21709;&#65292;&#19988;&#21487;&#33021;&#19982;&#35843;&#26597;&#26399;&#38388;&#30340;&#36235;&#21183;&#30456;&#20851;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Summan&#12289;Nandi&#21644;Bloom&#65288;2023&#65307;SNB&#65289;&#21457;&#29616;&#65292;&#26202;&#26399;&#20843;&#21313;&#24180;&#20195;&#21360;&#24230;&#23156;&#20799;&#25509;&#21463;&#21360;&#24230;&#36890;&#29992;&#20813;&#30123;&#35745;&#21010;&#65288;UIP&#65289;&#30340;&#26292;&#38706;&#20351;&#20854;&#26089;&#26399;&#25104;&#24180;&#26102;&#30340;&#21608;&#34218;&#22686;&#21152;&#20102;0.138&#20010;&#23545;&#25968;&#28857;&#65292;&#20154;&#22343;&#23478;&#24237;&#28040;&#36153;&#22686;&#21152;&#20102;0.028&#20010;&#28857;&#12290;&#20294;&#36825;&#20123;&#32467;&#26524;&#26159;&#36890;&#36807;&#22238;&#24402;&#24180;&#40836;&#21644;&#20986;&#29983;&#24180;&#20221;&#36825;&#20004;&#20010;&#21464;&#37327;&#24471;&#20986;&#30340;&#65292;&#32780;&#36825;&#20004;&#20010;&#21464;&#37327;&#26500;&#36896;&#26102;&#20960;&#20046;&#26159;&#20849;&#32447;&#30340;&#12290;&#22240;&#27492;&#65292;&#36825;&#20123;&#32467;&#26524;&#21487;&#20197;&#24402;&#22240;&#20110;&#19968;&#24180;&#35843;&#26597;&#26399;&#38388;&#30340;&#36235;&#21183;&#65292;&#22914;&#36890;&#36135;&#33192;&#32960;&#12290;&#38543;&#26426;&#21270;&#23454;&#39564;&#34920;&#26126;&#65292;&#24403;&#30495;&#23454;&#24433;&#21709;&#20026;&#38646;&#26102;&#65292;SNB&#20272;&#35745;&#22120;&#30340;&#24179;&#22343;&#20540;&#20026;0.088&#20010;&#28857;&#65288;&#24037;&#36164;&#65289;&#21644;0.039&#20010;&#28857;&#65288;&#28040;&#36153;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
Summan, Nandi, and Bloom (2023; SNB) finds that exposure of babies to India's Universal Immunization Programme (UIP) in the late 1980s increased their weekly wages in early adulthood by 0.138 log points and per-capita household consumption 0.028 points. But the results are attained by regressing on age, in years, while controlling for year of birth--two variables that, as constructed, are nearly collinear. The results are therefore attributable to trends during the one-year survey period, such as inflation. A randomization exercise shows that when the true impacts are zero, the SNB estimator averages 0.088 points for wages and 0.039 points for consumption.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#31181;&#20445;&#24230;&#37327;&#24130;&#25554;&#20540;&#26041;&#27861;&#65292;&#21487;&#20197;&#36890;&#36807;&#31867;&#20284;&#20110;&#29109;&#26368;&#20248;&#36755;&#36816;&#20013;&#20351;&#29992;&#30340;Sinkhorn&#31995;&#32479;&#26469;&#33719;&#24471;&#27979;&#24230;&#20043;&#38388;&#30340;&#25554;&#20540;&#12290;</title><link>http://arxiv.org/abs/2310.13797</link><description>&lt;p&gt;
&#20445;&#24230;&#37327;&#24130;&#19969;&#26684;&#40065;&#27785;&#38477;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
The Measure Preserving Martingale Sinkhorn Algorithm. (arXiv:2310.13797v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.13797
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#31181;&#20445;&#24230;&#37327;&#24130;&#25554;&#20540;&#26041;&#27861;&#65292;&#21487;&#20197;&#36890;&#36807;&#31867;&#20284;&#20110;&#29109;&#26368;&#20248;&#36755;&#36816;&#20013;&#20351;&#29992;&#30340;Sinkhorn&#31995;&#32479;&#26469;&#33719;&#24471;&#27979;&#24230;&#20043;&#38388;&#30340;&#25554;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#20445;&#24230;&#37327;&#24130;&#25554;&#20540;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36890;&#36807;&#35299;&#20915;&#31867;&#20284;&#20110;&#29109;&#26368;&#20248;&#36755;&#36816;&#20013;&#20351;&#29992;&#30340;Sinkhorn&#31995;&#32479;&#26469;&#33719;&#24471;&#30340;&#27979;&#24230;&#20043;&#38388;&#30340;&#25554;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
We provide a martingale interpolation between measures that can be obtained by solving a Sinkhorn like system analogous to the one used in Entropic Optimal Transport.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;&#32479;&#19968;&#24754;&#35266;&#39118;&#38505;&#30340;&#32508;&#21512;$\alpha$-&#39118;&#38505;&#29256;&#26412;&#21644;&#22522;&#20110;&#39118;&#38505;&#33719;&#24471;&#26368;&#20248;&#32452;&#21512;&#30340;&#35745;&#31639;&#31639;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#29992;&#20110;&#20272;&#35745;&#38889;&#22269;&#32929;&#31080;&#30340;&#24754;&#35266;&#26368;&#20248;&#32452;&#21512;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2303.07158</link><description>&lt;p&gt;
&#32479;&#19968;&#24754;&#35266;&#39118;&#38505;&#21644;&#26368;&#20248;&#32452;&#21512;
&lt;/p&gt;
&lt;p&gt;
Uniform Pessimistic Risk and Optimal Portfolio. (arXiv:2303.07158v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.07158
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;&#32479;&#19968;&#24754;&#35266;&#39118;&#38505;&#30340;&#32508;&#21512;$\alpha$-&#39118;&#38505;&#29256;&#26412;&#21644;&#22522;&#20110;&#39118;&#38505;&#33719;&#24471;&#26368;&#20248;&#32452;&#21512;&#30340;&#35745;&#31639;&#31639;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#29992;&#20110;&#20272;&#35745;&#38889;&#22269;&#32929;&#31080;&#30340;&#24754;&#35266;&#26368;&#20248;&#32452;&#21512;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a version of integrated $\alpha$-risk called the uniform pessimistic risk and a computational algorithm to obtain an optimal portfolio based on the risk. The proposed method can be used to estimate the pessimistic optimal portfolio models for Korean stocks.
&lt;/p&gt;
&lt;p&gt;
&#36164;&#20135;&#37197;&#32622;&#30340;&#26368;&#20248;&#24615;&#24050;&#32463;&#22312;&#39118;&#38505;&#24230;&#37327;&#30340;&#29702;&#35770;&#20998;&#26512;&#20013;&#24471;&#21040;&#24191;&#27867;&#35752;&#35770;&#12290;&#24754;&#35266;&#20027;&#20041;&#26159;&#19968;&#31181;&#36229;&#36234;&#20256;&#32479;&#26368;&#20248;&#32452;&#21512;&#27169;&#22411;&#30340;&#26368;&#26377;&#21560;&#24341;&#21147;&#30340;&#26041;&#27861;&#20043;&#19968;&#65292;$\alpha$-&#39118;&#38505;&#22312;&#25512;&#23548;&#20986;&#24191;&#27867;&#30340;&#24754;&#35266;&#26368;&#20248;&#32452;&#21512;&#20013;&#36215;&#30528;&#20851;&#38190;&#20316;&#29992;&#12290;&#28982;&#32780;&#65292;&#30001;&#24754;&#35266;&#39118;&#38505;&#35780;&#20272;&#30340;&#26368;&#20248;&#32452;&#21512;&#30340;&#20272;&#35745;&#20173;&#28982;&#20855;&#26377;&#25361;&#25112;&#24615;&#65292;&#22240;&#20026;&#32570;&#20047;&#21487;&#29992;&#30340;&#20272;&#35745;&#27169;&#22411;&#21644;&#35745;&#31639;&#31639;&#27861;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;&#32479;&#19968;&#24754;&#35266;&#39118;&#38505;&#30340;&#32508;&#21512;$\alpha$-&#39118;&#38505;&#29256;&#26412;&#21644;&#22522;&#20110;&#39118;&#38505;&#33719;&#24471;&#26368;&#20248;&#32452;&#21512;&#30340;&#35745;&#31639;&#31639;&#27861;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#20174;&#22810;&#20010;&#20998;&#20301;&#25968;&#22238;&#24402;&#12289;&#36866;&#24403;&#30340;&#35780;&#20998;&#35268;&#21017;&#21644;&#20998;&#24067;&#40065;&#26834;&#20248;&#21270;&#19977;&#20010;&#19981;&#21516;&#30340;&#26041;&#27861;&#26469;&#30740;&#31350;&#25152;&#25552;&#20986;&#30340;&#39118;&#38505;&#30340;&#29702;&#35770;&#24615;&#36136;&#12290;&#21516;&#26102;&#65292;&#32479;&#19968;&#24754;&#35266;&#39118;&#38505;&#34987;&#24212;&#29992;&#20110;&#20272;&#35745;&#38889;&#22269;&#32929;&#31080;&#30340;&#24754;&#35266;&#26368;&#20248;&#32452;&#21512;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
The optimality of allocating assets has been widely discussed with the theoretical analysis of risk measures. Pessimism is one of the most attractive approaches beyond the conventional optimal portfolio model, and the $\alpha$-risk plays a crucial role in deriving a broad class of pessimistic optimal portfolios. However, estimating an optimal portfolio assessed by a pessimistic risk is still challenging due to the absence of an available estimation model and a computational algorithm. In this study, we propose a version of integrated $\alpha$-risk called the uniform pessimistic risk and the computational algorithm to obtain an optimal portfolio based on the risk. Further, we investigate the theoretical properties of the proposed risk in view of three different approaches: multiple quantile regression, the proper scoring rule, and distributionally robust optimization. Also, the uniform pessimistic risk is applied to estimate the pessimistic optimal portfolio models for the Korean stock 
&lt;/p&gt;</description></item></channel></rss>