<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#25991;&#26412;&#25366;&#25496;&#25216;&#26415;&#65292;&#39564;&#35777;&#20102;&#20854;&#23545;&#20110;&#30830;&#23450;&#31185;&#23398;&#35770;&#25991;&#20013;&#26032;&#31185;&#23398;&#24605;&#24819;&#30340;&#26469;&#28304;&#21644;&#24433;&#21709;&#30340;&#26377;&#25928;&#24615;&#65292;&#24182;&#26174;&#31034;&#20986;&#20854;&#30456;&#23545;&#20110;&#20256;&#32479;&#30340;&#22522;&#20110;&#24341;&#29992;&#30340;&#24230;&#37327;&#25351;&#26631;&#30340;&#26174;&#33879;&#25913;&#36827;&#12290;</title><link>http://arxiv.org/abs/2309.16437</link><description>&lt;p&gt;
&#36229;&#36234;&#24341;&#29992;&#65306;&#29992;&#20110;&#35780;&#20272;&#31185;&#23398;&#20986;&#29256;&#29289;&#20013;&#30340;&#26032;&#39062;&#24615;&#21450;&#20854;&#24433;&#21709;&#21147;&#30340;&#22522;&#20110;&#25991;&#26412;&#30340;&#25351;&#26631;
&lt;/p&gt;
&lt;p&gt;
Beyond Citations: Text-Based Metrics for Assessing Novelty and its Impact in Scientific Publications. (arXiv:2309.16437v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.16437
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#25991;&#26412;&#25366;&#25496;&#25216;&#26415;&#65292;&#39564;&#35777;&#20102;&#20854;&#23545;&#20110;&#30830;&#23450;&#31185;&#23398;&#35770;&#25991;&#20013;&#26032;&#31185;&#23398;&#24605;&#24819;&#30340;&#26469;&#28304;&#21644;&#24433;&#21709;&#30340;&#26377;&#25928;&#24615;&#65292;&#24182;&#26174;&#31034;&#20986;&#20854;&#30456;&#23545;&#20110;&#20256;&#32479;&#30340;&#22522;&#20110;&#24341;&#29992;&#30340;&#24230;&#37327;&#25351;&#26631;&#30340;&#26174;&#33879;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20351;&#29992;&#25991;&#26412;&#25366;&#25496;&#26469;&#30830;&#23450;&#26469;&#33258;Microsoft Academic Graph (MAG)&#31185;&#23398;&#35770;&#25991;&#32676;&#20307;&#20013;&#26032;&#31185;&#23398;&#24605;&#24819;&#30340;&#26469;&#28304;&#21644;&#24433;&#21709;&#12290;&#25105;&#20204;&#39564;&#35777;&#20102;&#26032;&#25216;&#26415;&#21450;&#20854;&#30456;&#23545;&#20110;&#22522;&#20110;&#24341;&#29992;&#30340;&#20256;&#32479;&#24230;&#37327;&#25351;&#26631;&#30340;&#25913;&#36827;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#25910;&#38598;&#19982;&#35834;&#36125;&#23572;&#22870;&#32852;&#31995;&#30340;&#31185;&#23398;&#35770;&#25991;&#12290;&#36825;&#20123;&#35770;&#25991;&#21487;&#20197;&#35828;&#24341;&#20837;&#20102;&#23545;&#31185;&#23398;&#36827;&#23637;&#20855;&#26377;&#37325;&#22823;&#24433;&#21709;&#30340;&#20840;&#26032;&#31185;&#23398;&#24605;&#24819;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#30830;&#23450;&#25991;&#29486;&#32508;&#36848;&#35770;&#25991;&#65292;&#36825;&#20123;&#35770;&#25991;&#36890;&#24120;&#24635;&#32467;&#20043;&#21069;&#30340;&#31185;&#23398;&#21457;&#29616;&#32780;&#19981;&#26159;&#24341;&#39046;&#26032;&#30340;&#31185;&#23398;&#35265;&#35299;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#35777;&#26126;&#24341;&#39046;&#26032;&#30340;&#31185;&#23398;&#24605;&#24819;&#30340;&#35770;&#25991;&#26356;&#26377;&#21487;&#33021;&#34987;&#39640;&#24230;&#24341;&#29992;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#25903;&#25345;&#20351;&#29992;&#25991;&#26412;&#25366;&#25496;&#26469;&#27979;&#37327;&#21457;&#34920;&#26102;&#30340;&#26032;&#39062;&#31185;&#23398;&#24605;&#24819;&#20197;&#21450;&#36825;&#20123;&#26032;&#24605;&#24819;&#23545;&#21518;&#32493;&#31185;&#23398;&#24037;&#20316;&#30340;&#24433;&#21709;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#32467;&#26524;&#36824;&#34920;&#26126;&#65292;&#30456;&#27604;&#22522;&#20110;&#35770;&#25991;&#24341;&#29992;&#30340;&#20256;&#32479;&#25351;&#26631;&#65292;&#26032;&#30340;&#25991;&#26412;&#25351;&#26631;&#26377;&#26174;&#33879;&#30340;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;
We use text mining to identify the origin and impact of new scientific ideas in the population of scientific papers from Microsoft Academic Graph (MAG). We validate the new techniques and their improvement over the traditional metrics based on citations. First, we collect scientific papers linked to Nobel prizes. These papers arguably introduced fundamentally new scientific ideas with a major impact on scientific progress. Second, we identify literature review papers which typically summarize prior scientific findings rather than pioneer new scientific insights. Finally, we illustrate that papers pioneering new scientific ideas are more likely to become highly cited. Our findings support the use of text mining both to measure novel scientific ideas at the time of publication and to measure the impact of these new ideas on later scientific work. Moreover, the results illustrate the significant improvement of the new text metrics over the traditional metrics based on paper citations. We 
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#24066;&#22330;&#20215;&#20540;&#21644;&#30740;&#21457;&#25104;&#26412;&#65292;&#20272;&#35745;&#20102;&#21046;&#33647;&#33647;&#21697;&#21019;&#26032;&#30340;&#24179;&#22343;&#20215;&#20540;&#12290;&#25104;&#21151;&#33647;&#21697;&#30340;&#24179;&#22343;&#20215;&#20540;&#20026; 16.2 &#20159;&#32654;&#20803;&#65292;&#20020;&#24202;&#35797;&#39564;&#21069;&#38454;&#27573;&#30340;&#24179;&#22343;&#20215;&#20540;&#20026; 6430 &#19975;&#32654;&#20803;&#65292;&#25104;&#26412;&#20026; 5850 &#19975;&#32654;&#20803;&#12290;</title><link>http://arxiv.org/abs/2212.07384</link><description>&lt;p&gt;
&#35780;&#20272;&#21046;&#33647;&#33647;&#21697;&#21019;&#26032;&#20215;&#20540;
&lt;/p&gt;
&lt;p&gt;
Valuing Pharmaceutical Drug Innovations. (arXiv:2212.07384v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.07384
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#24066;&#22330;&#20215;&#20540;&#21644;&#30740;&#21457;&#25104;&#26412;&#65292;&#20272;&#35745;&#20102;&#21046;&#33647;&#33647;&#21697;&#21019;&#26032;&#30340;&#24179;&#22343;&#20215;&#20540;&#12290;&#25104;&#21151;&#33647;&#21697;&#30340;&#24179;&#22343;&#20215;&#20540;&#20026; 16.2 &#20159;&#32654;&#20803;&#65292;&#20020;&#24202;&#35797;&#39564;&#21069;&#38454;&#27573;&#30340;&#24179;&#22343;&#20215;&#20540;&#20026; 6430 &#19975;&#32654;&#20803;&#65292;&#25104;&#26412;&#20026; 5850 &#19975;&#32654;&#20803;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#36890;&#36807;&#20272;&#35745;&#33647;&#21697;&#24066;&#22330;&#20215;&#20540;&#21644;&#30740;&#21457;&#25104;&#26412;&#26469;&#34913;&#37327;&#21046;&#33647;&#33647;&#21697;&#21019;&#26032;&#30340;&#20215;&#20540;&#12290;&#25105;&#20204;&#20381;&#38752;&#24066;&#22330;&#23545;&#33647;&#21697;&#30740;&#21457;&#20844;&#21578;&#30340;&#21453;&#24212;&#26469;&#30830;&#23450;&#20215;&#20540;&#21644;&#25104;&#26412;&#12290;&#21033;&#29992;&#20844;&#21496;&#20844;&#21578;&#25968;&#25454;&#21644;&#26085;&#25910;&#30410;&#29575;&#65292;&#25105;&#20204;&#20272;&#35745;&#25104;&#21151;&#33647;&#21697;&#30340;&#24179;&#22343;&#20215;&#20540;&#20026;16.2&#20159;&#32654;&#20803;&#12290;&#24179;&#22343;&#32780;&#35328;&#65292;&#21457;&#29616;&#38454;&#27573;&#30340;&#33647;&#21697;&#35780;&#20272;&#20026;6430&#19975;&#32654;&#20803;&#65292;&#25104;&#26412;&#20026;5850&#19975;&#32654;&#20803;&#12290;&#19977;&#20010;&#20020;&#24202;&#35797;&#39564;&#38454;&#27573;&#30340;&#24179;&#22343;&#25104;&#26412;&#20998;&#21035;&#20026;600&#19975;&#32654;&#20803;&#12289;3000&#19975;&#32654;&#20803;&#21644;4100&#19975;&#32654;&#20803;&#12290;&#25105;&#20204;&#36824;&#30740;&#31350;&#20102;&#23558;&#36825;&#20123;&#20272;&#35745;&#24212;&#29992;&#20110;&#25903;&#25345;&#33647;&#21697;&#30740;&#21457;&#30340;&#25919;&#31574;&#30340;&#21487;&#33021;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We measure the $\textit{value of pharmaceutical drug innovations}$ by estimating the market values of drugs and their development costs. We rely on market responses to drug development announcements to identify the values and costs. Using data on announcements by firms and their daily stock returns, we estimate the average value of successful drugs at \$1.62 billion. At the discovery stage, on average, drugs are valued at \$64.3 million and cost \$58.5 million. The average costs of the three phases of clinical trials are \$0.6, \$30, and \$41 million, respectively. We also investigate applying these estimates to policies supporting drug development.
&lt;/p&gt;</description></item></channel></rss>