<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#21322;&#21442;&#25968;&#37329;&#34701;&#39118;&#38505;&#39044;&#27979;&#26694;&#26550;&#65292;&#23427;&#21033;&#29992;&#22810;&#20010;&#23454;&#29616;&#25351;&#26631;&#24314;&#27169;&#32852;&#21512;VaR&#21644;ES&#65292;&#24182;&#37319;&#29992;&#38750;&#23545;&#31216;&#25289;&#26222;&#25289;&#26031;&#20998;&#24067;&#36827;&#34892;&#36125;&#21494;&#26031;&#25512;&#26029;&#12290;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#26694;&#26550;&#22312;&#28085;&#30422;COVID-19&#26399;&#38388;&#30340;&#22810;&#20010;&#32929;&#24066;&#19978;&#34920;&#29616;&#33391;&#22909;&#12290;</title><link>https://arxiv.org/abs/2402.09985</link><description>&lt;p&gt;
&#21322;&#21442;&#25968;&#37329;&#34701;&#39118;&#38505;&#39044;&#27979;&#27169;&#22411;&#20013;&#24341;&#20837;&#22810;&#20010;&#23454;&#29616;&#25351;&#26631;
&lt;/p&gt;
&lt;p&gt;
Semi-parametric financial risk forecasting incorporating multiple realized measures
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09985
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#21322;&#21442;&#25968;&#37329;&#34701;&#39118;&#38505;&#39044;&#27979;&#26694;&#26550;&#65292;&#23427;&#21033;&#29992;&#22810;&#20010;&#23454;&#29616;&#25351;&#26631;&#24314;&#27169;&#32852;&#21512;VaR&#21644;ES&#65292;&#24182;&#37319;&#29992;&#38750;&#23545;&#31216;&#25289;&#26222;&#25289;&#26031;&#20998;&#24067;&#36827;&#34892;&#36125;&#21494;&#26031;&#25512;&#26029;&#12290;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#26694;&#26550;&#22312;&#28085;&#30422;COVID-19&#26399;&#38388;&#30340;&#22810;&#20010;&#32929;&#24066;&#19978;&#34920;&#29616;&#33391;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21322;&#21442;&#25968;&#32852;&#21512;VaR&#21644;ES&#39044;&#27979;&#26694;&#26550;&#65292;&#20854;&#20013;&#24341;&#20837;&#20102;&#22810;&#20010;&#23454;&#29616;&#25351;&#26631;&#12290;&#35813;&#26694;&#26550;&#36890;&#36807;&#20351;&#29992;&#22810;&#20010;&#23454;&#29616;&#25351;&#26631;&#20316;&#20026;&#22806;&#29983;&#21464;&#37327;&#26469;&#25193;&#23637;&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;VaR&#12290;&#28982;&#21518;&#65292;&#21033;&#29992;&#23454;&#29616;&#25351;&#26631;&#30340;&#20449;&#24687;&#26469;&#24314;&#27169;VaR&#21644;ES&#20043;&#38388;&#30340;&#26102;&#21464;&#20851;&#31995;&#12290;&#26368;&#21518;&#65292;&#20351;&#29992;&#27169;&#25311;&#37327;&#21644;&#23454;&#29616;&#25351;&#26631;&#20043;&#38388;&#30340;&#21516;&#26399;&#30456;&#20851;&#24615;&#24314;&#31435;&#30340;&#24230;&#37327;&#26041;&#31243;&#26469;&#23436;&#25104;&#27169;&#22411;&#12290;&#22522;&#20110;&#38750;&#23545;&#31216;&#25289;&#26222;&#25289;&#26031;&#20998;&#24067;&#30340;&#20934;&#20284;&#28982;&#26041;&#27861;&#23454;&#29616;&#20102;&#23545;&#35813;&#27169;&#22411;&#30340;&#36125;&#21494;&#26031;&#25512;&#26029;&#12290;&#20351;&#29992;&#33258;&#36866;&#24212;&#39532;&#23572;&#21487;&#22827;&#38142;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#23545;&#27169;&#22411;&#36827;&#34892;&#20272;&#35745;&#12290;&#32463;&#39564;&#35777;&#23454;&#65292;&#35813;&#26694;&#26550;&#22312;&#28085;&#30422;COVID-19&#26399;&#38388;&#30340;2000&#24180;1&#26376;&#33267;2022&#24180;6&#26376;&#38388;&#30340;&#20845;&#20010;&#32929;&#24066;&#19978;&#20855;&#26377;&#36739;&#22909;&#30340;&#39044;&#27979;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09985v1 Announce Type: new  Abstract: A semi-parametric joint Value-at-Risk (VaR) and Expected Shortfall (ES) forecasting framework employing multiple realized measures is developed. The proposed framework extends the quantile regression using multiple realized measures as exogenous variables to model the VaR. Then, the information from realized measures is used to model the time-varying relationship between VaR and ES. Finally, a measurement equation that models the contemporaneous dependence between the quantile and realized measures is used to complete the model. A quasi-likelihood, built on the asymmetric Laplace distribution, enables the Bayesian inference for the proposed model. An adaptive Markov Chain Monte Carlo method is used for the model estimation. The empirical section evaluates the performance of the proposed framework with six stock markets from January 2000 to June 2022, covering the period of COVID-19. Three realized measures, including 5-minute realized va
&lt;/p&gt;</description></item><item><title>Alpha-GPT 2.0&#26159;&#19968;&#20010;&#37327;&#21270;&#25237;&#36164;&#26694;&#26550;&#65292;&#37319;&#29992;&#20154;&#26426;&#21327;&#21516;&#30340;&#26041;&#27861;&#65292;&#23558;&#20154;&#31867;&#30740;&#31350;&#32773;&#30340;&#35265;&#35299;&#34701;&#20837;&#21040;alpha&#30740;&#31350;&#20013;&#65292;&#25552;&#39640;&#20102;&#37327;&#21270;&#25237;&#36164;&#30740;&#31350;&#30340;&#25928;&#29575;&#21644;&#20934;&#30830;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.09746</link><description>&lt;p&gt;
Alpha-GPT 2.0&#65306;&#37327;&#21270;&#25237;&#36164;&#20013;&#30340;&#20154;&#26426;&#21327;&#21516;AI
&lt;/p&gt;
&lt;p&gt;
Alpha-GPT 2.0: Human-in-the-Loop AI for Quantitative Investment
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09746
&lt;/p&gt;
&lt;p&gt;
Alpha-GPT 2.0&#26159;&#19968;&#20010;&#37327;&#21270;&#25237;&#36164;&#26694;&#26550;&#65292;&#37319;&#29992;&#20154;&#26426;&#21327;&#21516;&#30340;&#26041;&#27861;&#65292;&#23558;&#20154;&#31867;&#30740;&#31350;&#32773;&#30340;&#35265;&#35299;&#34701;&#20837;&#21040;alpha&#30740;&#31350;&#20013;&#65292;&#25552;&#39640;&#20102;&#37327;&#21270;&#25237;&#36164;&#30740;&#31350;&#30340;&#25928;&#29575;&#21644;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#65292;&#25105;&#20204;&#22312;&#37327;&#21270;&#25237;&#36164;&#39046;&#22495;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;alpha&#25366;&#25496;&#33539; Paradigm&#65292;&#24320;&#21457;&#20102;&#19968;&#20010;&#26032;&#30340;&#20132;&#20114;&#24335;&#30340;alpha&#25366;&#25496;&#31995;&#32479;&#26694;&#26550;&#65292;&#21363;Alpha-GPT&#12290;&#35813;&#31995;&#32479;&#22260;&#32469;&#22522;&#20110;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#36845;&#20195;&#24335;&#20154;&#26426;&#20132;&#20114;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#20154;&#26426;&#21327;&#21516;&#30340;alpha&#21457;&#29616;&#26041;&#27861;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#19979;&#19968;&#20195;Alpha-GPT 2.0&#65292;&#36825;&#26159;&#19968;&#20010;&#37327;&#21270;&#25237;&#36164;&#26694;&#26550;&#65292;&#36827;&#19968;&#27493;&#28085;&#30422;&#20102;&#37327;&#21270;&#25237;&#36164;&#20013;&#30340;&#20851;&#38190;&#24314;&#27169;&#21644;&#20998;&#26512;&#38454;&#27573;&#12290;&#35813;&#26694;&#26550;&#24378;&#35843;&#20154;&#26426;&#20043;&#38388;&#30340;&#36845;&#20195;&#20114;&#21160;&#30740;&#31350;&#65292;&#24182;&#36143;&#31359;&#25972;&#20010;&#37327;&#21270;&#25237;&#36164;&#27969;&#31243;&#65292;&#20307;&#29616;&#20102;&#19968;&#31181;&#20154;&#26426;&#21327;&#21516;&#30340;&#31574;&#30053;&#12290;&#36890;&#36807;&#23558;&#20154;&#31867;&#30740;&#31350;&#20154;&#21592;&#30340;&#35265;&#35299;&#34701;&#20837;&#21040;&#31995;&#32479;&#24615;&#30340;alpha&#30740;&#31350;&#36807;&#31243;&#20013;&#65292;&#25105;&#20204;&#26377;&#25928;&#22320;&#21033;&#29992;&#20102;&#20154;&#26426;&#21327;&#21516;&#30340;&#26041;&#27861;&#65292;&#25552;&#39640;&#20102;&#37327;&#21270;&#25237;&#36164;&#30740;&#31350;&#30340;&#25928;&#29575;&#21644;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09746v1 Announce Type: new  Abstract: Recently, we introduced a new paradigm for alpha mining in the realm of quantitative investment, developing a new interactive alpha mining system framework, Alpha-GPT. This system is centered on iterative Human-AI interaction based on large language models, introducing a Human-in-the-Loop approach to alpha discovery. In this paper, we present the next-generation Alpha-GPT 2.0 \footnote{Draft. Work in progress}, a quantitative investment framework that further encompasses crucial modeling and analysis phases in quantitative investment. This framework emphasizes the iterative, interactive research between humans and AI, embodying a Human-in-the-Loop strategy throughout the entire quantitative investment pipeline. By assimilating the insights of human researchers into the systematic alpha research process, we effectively leverage the Human-in-the-Loop approach, enhancing the efficiency and precision of quantitative investment research.
&lt;/p&gt;</description></item><item><title>ABIDES-Economist&#26159;&#19968;&#20010;&#22810;&#26234;&#33021;&#20307;&#27169;&#25311;&#22120;&#65292;&#29992;&#20110;&#32463;&#27982;&#31995;&#32479;&#65292;&#20855;&#26377;&#23398;&#20064;&#20195;&#29702;&#12289;&#35268;&#21017;&#24615;&#31574;&#30053;&#21644;&#22522;&#20110;&#29616;&#23454;&#25968;&#25454;&#30340;&#35774;&#35745;&#12290;&#23427;&#25552;&#20379;&#20102;&#19968;&#31181;&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#31574;&#30053;&#30340;&#27169;&#25311;&#29615;&#22659;&#65292;&#24182;&#21487;&#20197;&#27169;&#25311;&#21644;&#20998;&#26512;&#21508;&#31181;&#32463;&#27982;&#24773;&#26223;&#12290;</title><link>https://arxiv.org/abs/2402.09563</link><description>&lt;p&gt;
ABIDES-Economist: &#20855;&#26377;&#23398;&#20064;&#20195;&#29702;&#30340;&#32463;&#27982;&#31995;&#32479;&#30340;&#22522;&#20110;&#20195;&#29702;&#30340;&#27169;&#25311;
&lt;/p&gt;
&lt;p&gt;
ABIDES-Economist: Agent-Based Simulation of Economic Systems with Learning Agents
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09563
&lt;/p&gt;
&lt;p&gt;
ABIDES-Economist&#26159;&#19968;&#20010;&#22810;&#26234;&#33021;&#20307;&#27169;&#25311;&#22120;&#65292;&#29992;&#20110;&#32463;&#27982;&#31995;&#32479;&#65292;&#20855;&#26377;&#23398;&#20064;&#20195;&#29702;&#12289;&#35268;&#21017;&#24615;&#31574;&#30053;&#21644;&#22522;&#20110;&#29616;&#23454;&#25968;&#25454;&#30340;&#35774;&#35745;&#12290;&#23427;&#25552;&#20379;&#20102;&#19968;&#31181;&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#31574;&#30053;&#30340;&#27169;&#25311;&#29615;&#22659;&#65292;&#24182;&#21487;&#20197;&#27169;&#25311;&#21644;&#20998;&#26512;&#21508;&#31181;&#32463;&#27982;&#24773;&#26223;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#20010;&#22810;&#26234;&#33021;&#20307;&#27169;&#25311;&#22120;&#65292;&#29992;&#20110;&#30001;&#24322;&#36136;&#23478;&#24237;&#12289;&#24322;&#36136;&#20844;&#21496;&#12289;&#20013;&#22830;&#38134;&#34892;&#21644;&#25919;&#24220;&#20195;&#29702;&#32452;&#25104;&#30340;&#32463;&#27982;&#31995;&#32479;&#65292;&#35813;&#31995;&#32479;&#21487;&#20197;&#21463;&#21040;&#22806;&#29983;&#30340;&#38543;&#26426;&#20914;&#20987;&#12290;&#20195;&#29702;&#20043;&#38388;&#30340;&#20114;&#21160;&#23450;&#20041;&#20102;&#32463;&#27982;&#20013;&#21830;&#21697;&#30340;&#29983;&#20135;&#21644;&#28040;&#36153;&#20197;&#21450;&#36164;&#37329;&#30340;&#27969;&#21160;&#12290;&#27599;&#20010;&#20195;&#29702;&#21487;&#20197;&#26681;&#25454;&#22266;&#23450;&#30340;&#12289;&#35268;&#21017;&#24615;&#30340;&#31574;&#30053;&#34892;&#21160;&#65292;&#20063;&#21487;&#20197;&#36890;&#36807;&#19982;&#27169;&#25311;&#22120;&#20013;&#20854;&#20182;&#20195;&#29702;&#30340;&#20114;&#21160;&#26469;&#23398;&#20064;&#33258;&#24049;&#30340;&#31574;&#30053;&#12290;&#25105;&#20204;&#36890;&#36807;&#36873;&#25321;&#22522;&#20110;&#32463;&#27982;&#25991;&#29486;&#30340;&#20195;&#29702;&#24322;&#36136;&#24615;&#21442;&#25968;&#65292;&#24182;&#23558;&#20854;&#34892;&#21160;&#31354;&#38388;&#35774;&#35745;&#19982;&#32654;&#22269;&#30340;&#23454;&#38469;&#25968;&#25454;&#30456;&#19968;&#33268;&#65292;&#26469;&#20351;&#25105;&#20204;&#30340;&#27169;&#25311;&#22120;&#20855;&#22791;&#29616;&#23454;&#22522;&#30784;&#12290;&#25105;&#20204;&#30340;&#27169;&#25311;&#22120;&#36890;&#36807;&#20026;&#32463;&#27982;&#31995;&#32479;&#23450;&#20041; OpenAI Gym &#39118;&#26684;&#30340;&#29615;&#22659;&#65292;&#20419;&#36827;&#20102;&#20195;&#29702;&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#31574;&#30053;&#30340;&#33021;&#21147;&#12290;&#36890;&#36807;&#27169;&#25311;&#21644;&#20998;&#26512;&#20004;&#31181;&#20551;&#35774;&#30340;&#65288;&#20294;&#26377;&#36259;&#30340;&#65289;&#32463;&#27982;&#24773;&#26223;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#27169;&#25311;&#22120;&#30340;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09563v1 Announce Type: cross  Abstract: We introduce a multi-agent simulator for economic systems comprised of heterogeneous Households, heterogeneous Firms, Central Bank and Government agents, that could be subjected to exogenous, stochastic shocks. The interaction between agents defines the production and consumption of goods in the economy alongside the flow of money. Each agent can be designed to act according to fixed, rule-based strategies or learn their strategies using interactions with others in the simulator. We ground our simulator by choosing agent heterogeneity parameters based on economic literature, while designing their action spaces in accordance with real data in the United States. Our simulator facilitates the use of reinforcement learning strategies for the agents via an OpenAI Gym style environment definition for the economic system. We demonstrate the utility of our simulator by simulating and analyzing two hypothetical (yet interesting) economic scenar
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#36890;&#36807;&#20351;&#29992;&#26080;&#38480;&#37325;&#22797;&#21338;&#24328;&#27169;&#22411;&#65292;&#24182;&#37319;&#29992;&#23376;&#21338;&#24328;&#23436;&#32654;&#22343;&#34913;&#31574;&#30053;&#37197;&#32622;&#20316;&#20026;&#35299;&#20915;&#27010;&#24565;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#32993;&#33821;&#21340;&#21644;&#26829;&#23376;&#30340;&#26041;&#27861;&#26469;&#38477;&#20302;&#36829;&#21453;&#33452;&#20848;&#38480;&#36895;&#35268;&#23450;&#30340;&#28608;&#21169;&#65292;&#24182;&#22312;&#30701;&#26399;&#37325;&#22797;&#21338;&#24328;&#20013;&#26500;&#24314;&#20102;&#19968;&#20010;&#32435;&#20160;&#22343;&#34913;&#31574;&#30053;&#37197;&#32622;&#12290;</title><link>https://arxiv.org/abs/2402.09556</link><description>&lt;p&gt;
&#38477;&#20302;&#33452;&#20848;&#36829;&#21453;&#38480;&#36895;&#30340;&#28608;&#21169;&#30340;&#21338;&#24328;&#35770;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A game theoretic approach to lowering incentives to violate speed limits in Finland
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09556
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#36890;&#36807;&#20351;&#29992;&#26080;&#38480;&#37325;&#22797;&#21338;&#24328;&#27169;&#22411;&#65292;&#24182;&#37319;&#29992;&#23376;&#21338;&#24328;&#23436;&#32654;&#22343;&#34913;&#31574;&#30053;&#37197;&#32622;&#20316;&#20026;&#35299;&#20915;&#27010;&#24565;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#32993;&#33821;&#21340;&#21644;&#26829;&#23376;&#30340;&#26041;&#27861;&#26469;&#38477;&#20302;&#36829;&#21453;&#33452;&#20848;&#38480;&#36895;&#35268;&#23450;&#30340;&#28608;&#21169;&#65292;&#24182;&#22312;&#30701;&#26399;&#37325;&#22797;&#21338;&#24328;&#20013;&#26500;&#24314;&#20102;&#19968;&#20010;&#32435;&#20160;&#22343;&#34913;&#31574;&#30053;&#37197;&#32622;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#36890;&#36807;&#35752;&#35770;&#19968;&#20010;&#26080;&#38480;&#37325;&#22797;&#21338;&#24328;&#27169;&#22411;&#26469;&#25193;&#23637;&#20043;&#21069;&#30340;&#30740;&#31350;&#65292;&#35813;&#27169;&#22411;&#20197;&#23376;&#21338;&#24328;&#23436;&#32654;&#22343;&#34913;&#31574;&#30053;&#37197;&#32622;&#65288;SPE&#65289;&#20316;&#20026;&#35299;&#20915;&#27010;&#24565;&#65292;&#20197;&#32993;&#33821;&#21340;&#21644;&#26829;&#23376;&#30340;&#26041;&#24335;&#38477;&#20302;&#36829;&#21453;&#38480;&#36895;&#30340;&#28608;&#21169;&#12290;&#22312;&#26500;&#24314;SPE&#31574;&#30053;&#37197;&#32622;&#26102;&#65292;&#36873;&#25321;&#21021;&#22987;&#29366;&#24577;&#20351;&#24471;&#39550;&#39542;&#21592;&#37319;&#21462;&#28151;&#21512;&#31574;&#30053;&#65292;&#32780;&#35686;&#23519;&#19981;&#20197;&#30830;&#23450;&#24615;&#25191;&#34892;&#12290;&#25105;&#20204;&#36824;&#20551;&#35774;&#20102;&#19968;&#20010;&#30701;&#26399;&#29256;&#26412;&#30340;&#37325;&#22797;&#21338;&#24328;&#65292;&#35813;&#21338;&#24328;&#20855;&#26377;&#24191;&#20041;&#38454;&#27573;&#21338;&#24328;&#30340;&#22238;&#25253;&#12290;&#23545;&#20110;&#36825;&#20010;&#21338;&#24328;&#65292;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#22810;&#38454;&#27573;&#31574;&#30053;&#37197;&#32622;&#65292;&#23427;&#26159;&#19968;&#20010;&#32435;&#20160;&#22343;&#34913;&#20294;&#19981;&#26159;SPE&#12290;&#36890;&#36807;&#23637;&#31034;&#26576;&#20123;&#35299;&#30340;&#20505;&#36873;&#32773;&#19981;&#28385;&#36275;&#19968;&#20010;&#24517;&#35201;&#26465;&#20214;&#65292;&#21363;&#22312;&#23436;&#20840;&#20449;&#24687;&#30340;&#37325;&#22797;&#21338;&#24328;&#20013;&#28385;&#36275;&#19968;&#27425;&#24615;&#20559;&#31163;&#23646;&#24615;&#65292;&#25490;&#38500;&#20102;&#19968;&#20123;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09556v1 Announce Type: new  Abstract: We expand on earlier research on the topic by discussing an infinitely repeated game model with a subgame perfect equilibrium strategy profile (SPE) as a solution concept that diminishes incentives to violate speed limits in a carrot and stick fashion. In attempts to construct an SPE strategy profile, the initial state is chosen such that the drivers are playing a mixed strategy whereas the police is not enforcing with certainty. We also postulate a short period version of the repeated game with generalized stage game payoffs. For this game, we construct a multistage strategy profile that is a Nash equilibrium but not an SPE. Some solution candidates are excluded by showing that they do not satisfy a one shot deviation property that is a necessary condition for an SPE profile in a repeated game of perfect information.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#22312;&#35780;&#20272;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#32463;&#27982;&#21512;&#29702;&#24615;&#26041;&#38754;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#36890;&#36807;&#37327;&#21270;&#35780;&#20998;&#27169;&#22411;&#22312;&#21508;&#20010;&#35201;&#32032;&#19978;&#30340;&#34920;&#29616;&#24182;&#32467;&#21512;&#29992;&#25143;&#25552;&#20379;&#30340;&#35780;&#20998;&#26631;&#20934;&#65292;&#29983;&#25104;&#19968;&#20221;"&#29702;&#24615;&#25253;&#21578;&#21345;"&#65292;&#20197;&#30830;&#23450;&#20195;&#29702;&#20154;&#26159;&#21542;&#36275;&#22815;&#21487;&#38752;&#12290;</title><link>https://arxiv.org/abs/2402.09552</link><description>&lt;p&gt;
&#29702;&#24615;&#25253;&#21578;&#21345;&#65306;&#35780;&#20272;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#32463;&#27982;&#21512;&#29702;&#24615;
&lt;/p&gt;
&lt;p&gt;
Rationality Report Cards: Assessing the Economic Rationality of Large Language Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09552
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#35780;&#20272;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#32463;&#27982;&#21512;&#29702;&#24615;&#26041;&#38754;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#36890;&#36807;&#37327;&#21270;&#35780;&#20998;&#27169;&#22411;&#22312;&#21508;&#20010;&#35201;&#32032;&#19978;&#30340;&#34920;&#29616;&#24182;&#32467;&#21512;&#29992;&#25143;&#25552;&#20379;&#30340;&#35780;&#20998;&#26631;&#20934;&#65292;&#29983;&#25104;&#19968;&#20221;"&#29702;&#24615;&#25253;&#21578;&#21345;"&#65292;&#20197;&#30830;&#23450;&#20195;&#29702;&#20154;&#26159;&#21542;&#36275;&#22815;&#21487;&#38752;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36234;&#26469;&#36234;&#22810;&#30340;&#20154;&#23545;&#23558;LLM&#29992;&#20316;&#20915;&#31574;"&#20195;&#29702;&#20154;"&#20852;&#36259;&#26085;&#30410;&#22686;&#21152;&#12290;&#36825;&#21253;&#25324;&#24456;&#22810;&#33258;&#30001;&#24230;&#65306;&#24212;&#35813;&#20351;&#29992;&#21738;&#20010;&#27169;&#22411;&#65307;&#22914;&#20309;&#36827;&#34892;&#25552;&#31034;&#65307;&#26159;&#21542;&#35201;&#27714;&#20854;&#36827;&#34892;&#20869;&#30465;&#12289;&#36827;&#34892;&#24605;&#32771;&#38142;&#31561;&#12290;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65288;&#26356;&#24191;&#27867;&#22320;&#35828;&#65292;&#30830;&#23450;LLM&#20195;&#29702;&#20154;&#26159;&#21542;&#36275;&#22815;&#21487;&#38752;&#20197;&#20415;&#33719;&#24471;&#20449;&#20219;&#65289;&#38656;&#35201;&#19968;&#31181;&#35780;&#20272;&#36825;&#31181;&#20195;&#29702;&#20154;&#32463;&#27982;&#21512;&#29702;&#24615;&#30340;&#26041;&#27861;&#35770;&#65292;&#22312;&#26412;&#25991;&#20013;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#26041;&#27861;&#12290;&#25105;&#20204;&#39318;&#20808;&#23545;&#29702;&#24615;&#20915;&#31574;&#30340;&#32463;&#27982;&#25991;&#29486;&#36827;&#34892;&#20102;&#35843;&#30740;&#12289;&#23558;&#20195;&#29702;&#20154;&#24212;&#35813;&#23637;&#29616;&#30340;&#22823;&#37327;&#32454;&#31890;&#24230;"&#35201;&#32032;"&#36827;&#34892;&#20998;&#31867;&#65292;&#24182;&#30830;&#23450;&#20102;&#23427;&#20204;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20934;&#20998;&#24067;&#65292;&#20197;&#23450;&#37327;&#35780;&#20998;LLM&#22312;&#36825;&#20123;&#35201;&#32032;&#19978;&#30340;&#34920;&#29616;&#65292;&#24182;&#32467;&#21512;&#29992;&#25143;&#25552;&#20379;&#30340;&#35780;&#20998;&#26631;&#20934;&#65292;&#29983;&#25104;&#19968;&#20221;"&#29702;&#24615;&#25253;&#21578;&#21345;"&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#25551;&#36848;&#20102;&#19982;14&#31181;&#19981;&#21516;&#30340;LLM&#36827;&#34892;&#30340;&#22823;&#35268;&#27169;&#23454;&#35777;&#23454;&#39564;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09552v1 Announce Type: new  Abstract: There is increasing interest in using LLMs as decision-making "agents." Doing so includes many degrees of freedom: which model should be used; how should it be prompted; should it be asked to introspect, conduct chain-of-thought reasoning, etc? Settling these questions -- and more broadly, determining whether an LLM agent is reliable enough to be trusted -- requires a methodology for assessing such an agent's economic rationality. In this paper, we provide one. We begin by surveying the economic literature on rational decision making, taxonomizing a large set of fine-grained "elements" that an agent should exhibit, along with dependencies between them. We then propose a benchmark distribution that quantitatively scores an LLMs performance on these elements and, combined with a user-provided rubric, produces a "rationality report card." Finally, we describe the results of a large-scale empirical experiment with 14 different LLMs, characte
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#32593;&#32476;&#29305;&#24449;&#22312;&#27450;&#35784;&#26816;&#27979;&#20013;&#30340;&#28508;&#21147;&#65292;&#36890;&#36807;&#20351;&#29992;&#20010;&#24615;&#21270;&#30340;PageRank&#31639;&#27861;&#26469;&#25429;&#25417;&#27450;&#35784;&#30340;&#31038;&#20250;&#21160;&#24577;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#38598;&#25104;PPR&#21487;&#20197;&#25552;&#39640;&#27169;&#22411;&#30340;&#39044;&#27979;&#33021;&#21147;&#24182;&#25552;&#20379;&#29420;&#29305;&#26377;&#20215;&#20540;&#30340;&#20449;&#24687;&#12290;</title><link>https://arxiv.org/abs/2402.09495</link><description>&lt;p&gt;
&#20851;&#20110;&#22522;&#20110;&#32593;&#32476;&#29305;&#24449;&#22312;&#27450;&#35784;&#26816;&#27979;&#20013;&#28508;&#21147;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On the Potential of Network-Based Features for Fraud Detection
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09495
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#32593;&#32476;&#29305;&#24449;&#22312;&#27450;&#35784;&#26816;&#27979;&#20013;&#30340;&#28508;&#21147;&#65292;&#36890;&#36807;&#20351;&#29992;&#20010;&#24615;&#21270;&#30340;PageRank&#31639;&#27861;&#26469;&#25429;&#25417;&#27450;&#35784;&#30340;&#31038;&#20250;&#21160;&#24577;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#38598;&#25104;PPR&#21487;&#20197;&#25552;&#39640;&#27169;&#22411;&#30340;&#39044;&#27979;&#33021;&#21147;&#24182;&#25552;&#20379;&#29420;&#29305;&#26377;&#20215;&#20540;&#30340;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32447;&#20132;&#26131;&#27450;&#35784;&#32473;&#20225;&#19994;&#21644;&#28040;&#36153;&#32773;&#24102;&#26469;&#20102;&#37325;&#22823;&#25361;&#25112;&#65292;&#38754;&#20020;&#30528;&#37325;&#22823;&#30340;&#32463;&#27982;&#25439;&#22833;&#12290;&#20256;&#32479;&#30340;&#22522;&#20110;&#35268;&#21017;&#30340;&#31995;&#32479;&#38590;&#20197;&#36319;&#19978;&#27450;&#35784;&#25112;&#26415;&#30340;&#28436;&#21464;&#65292;&#23548;&#33268;&#39640;&#35823;&#25253;&#29575;&#21644;&#28431;&#25253;&#29575;&#12290;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#36890;&#36807;&#21033;&#29992;&#21382;&#21490;&#25968;&#25454;&#35782;&#21035;&#27450;&#35784;&#27169;&#24335;&#25552;&#20379;&#20102;&#19968;&#20010;&#26377;&#24076;&#26395;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#26412;&#25991;&#25506;&#35752;&#20351;&#29992;&#20010;&#24615;&#21270;&#30340;PageRank&#65288;PPR&#65289;&#31639;&#27861;&#36890;&#36807;&#20998;&#26512;&#37329;&#34701;&#36134;&#25143;&#20043;&#38388;&#30340;&#20851;&#31995;&#26469;&#25429;&#25417;&#27450;&#35784;&#30340;&#31038;&#20250;&#21160;&#24577;&#12290;&#20027;&#35201;&#30446;&#26631;&#26159;&#27604;&#36739;&#20256;&#32479;&#29305;&#24449;&#19982;&#28155;&#21152;PPR&#22312;&#27450;&#35784;&#26816;&#27979;&#27169;&#22411;&#20013;&#30340;&#24615;&#33021;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#38598;&#25104;PPR&#21487;&#20197;&#25552;&#39640;&#27169;&#22411;&#30340;&#39044;&#27979;&#33021;&#21147;&#65292;&#36229;&#36807;&#22522;&#20934;&#27169;&#22411;&#12290;&#27492;&#22806;&#65292;PPR&#29305;&#24449;&#25552;&#20379;&#20102;&#29420;&#29305;&#32780;&#26377;&#20215;&#20540;&#30340;&#20449;&#24687;&#65292;&#36890;&#36807;&#20854;&#39640;&#29305;&#24449;&#37325;&#35201;&#24615;&#24471;&#20998;&#24471;&#20197;&#35777;&#26126;&#12290;&#29305;&#24449;&#31283;&#23450;&#24615;&#20998;&#26512;&#35777;&#23454;&#20102;&#19968;&#33268;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09495v1 Announce Type: cross  Abstract: Online transaction fraud presents substantial challenges to businesses and consumers, risking significant financial losses. Conventional rule-based systems struggle to keep pace with evolving fraud tactics, leading to high false positive rates and missed detections. Machine learning techniques offer a promising solution by leveraging historical data to identify fraudulent patterns. This article explores using the personalised PageRank (PPR) algorithm to capture the social dynamics of fraud by analysing relationships between financial accounts. The primary objective is to compare the performance of traditional features with the addition of PPR in fraud detection models. Results indicate that integrating PPR enhances the model's predictive power, surpassing the baseline model. Additionally, the PPR feature provides unique and valuable information, evidenced by its high feature importance score. Feature stability analysis confirms consist
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#31995;&#32479;&#21270;&#22320;&#30740;&#31350;&#20102;&#20013;&#24515;&#21270;&#21644;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#20013;&#27704;&#32493;&#26399;&#36135;&#21512;&#32422;&#30340;&#20132;&#26131;&#32773;&#34892;&#20026;&#65292;&#24182;&#25552;&#20986;&#20102;&#26032;&#30340;&#20998;&#26512;&#26694;&#26550;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;VAMM&#27169;&#22411;&#30340;DEX&#20013;&#65292;&#22810;&#22836;&#21644;&#31354;&#22836;&#25345;&#20179;&#37327;&#23545;&#20215;&#26684;&#27874;&#21160;&#20135;&#29983;&#30456;&#21453;&#30340;&#24433;&#21709;&#65292;&#32780;&#22312;&#37319;&#29992;&#39044;&#35328;&#26426;&#23450;&#20215;&#27169;&#22411;&#30340;DEX&#20013;&#65292;&#20080;&#23478;&#21644;&#21334;&#23478;&#20043;&#38388;&#30340;&#20132;&#26131;&#32773;&#34892;&#20026;&#23384;&#22312;&#26126;&#26174;&#30340;&#19981;&#23545;&#31216;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.03953</link><description>&lt;p&gt;
&#20013;&#24515;&#21270;&#21644;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#20013;&#30340;&#27704;&#32493;&#26399;&#36135;&#21512;&#32422;: &#26426;&#21046;&#21644;&#20132;&#26131;&#32773;&#34892;&#20026;
&lt;/p&gt;
&lt;p&gt;
Perpetual Future Contracts in Centralized and Decentralized Exchanges: Mechanism and Traders' Behavior
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.03953
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#31995;&#32479;&#21270;&#22320;&#30740;&#31350;&#20102;&#20013;&#24515;&#21270;&#21644;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#20013;&#27704;&#32493;&#26399;&#36135;&#21512;&#32422;&#30340;&#20132;&#26131;&#32773;&#34892;&#20026;&#65292;&#24182;&#25552;&#20986;&#20102;&#26032;&#30340;&#20998;&#26512;&#26694;&#26550;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;VAMM&#27169;&#22411;&#30340;DEX&#20013;&#65292;&#22810;&#22836;&#21644;&#31354;&#22836;&#25345;&#20179;&#37327;&#23545;&#20215;&#26684;&#27874;&#21160;&#20135;&#29983;&#30456;&#21453;&#30340;&#24433;&#21709;&#65292;&#32780;&#22312;&#37319;&#29992;&#39044;&#35328;&#26426;&#23450;&#20215;&#27169;&#22411;&#30340;DEX&#20013;&#65292;&#20080;&#23478;&#21644;&#21334;&#23478;&#20043;&#38388;&#30340;&#20132;&#26131;&#32773;&#34892;&#20026;&#23384;&#22312;&#26126;&#26174;&#30340;&#19981;&#23545;&#31216;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#20855;&#26377;&#24320;&#21019;&#24615;&#30340;&#30693;&#35782;&#31995;&#32479;&#21270;(SoK)&#35745;&#21010;&#65292;&#37325;&#28857;&#28145;&#20837;&#25506;&#32034;&#20132;&#26131;&#32773;&#22312;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;(CEXs)&#21644;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;(DEXs)&#20013;&#20851;&#20110;&#27704;&#32493;&#26399;&#36135;&#21512;&#32422;&#30340;&#21160;&#24577;&#21644;&#34892;&#20026;&#12290;&#25105;&#20204;&#25913;&#36827;&#20102;&#29616;&#26377;&#27169;&#22411;&#65292;&#20197;&#30740;&#31350;&#20132;&#26131;&#32773;&#23545;&#20215;&#26684;&#27874;&#21160;&#30340;&#21453;&#24212;&#65292;&#21019;&#24314;&#20102;&#19968;&#20010;&#38024;&#23545;&#36825;&#20123;&#21512;&#32422;&#24179;&#21488;&#30340;&#26032;&#30340;&#20998;&#26512;&#26694;&#26550;&#65292;&#21516;&#26102;&#31361;&#20986;&#20102;&#21306;&#22359;&#38142;&#25216;&#26415;&#22312;&#20854;&#24212;&#29992;&#20013;&#30340;&#20316;&#29992;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#21253;&#25324;&#23545;CEXs&#30340;&#21382;&#21490;&#25968;&#25454;&#30340;&#27604;&#36739;&#20998;&#26512;&#65292;&#20197;&#21450;&#23545;DEXs&#19978;&#30340;&#23436;&#25972;&#20132;&#26131;&#25968;&#25454;&#30340;&#26356;&#35814;&#23613;&#30340;&#30740;&#31350;&#12290;&#22312;&#34394;&#25311;&#33258;&#21160;&#21270;&#24066;&#22330;&#20570;&#24066;&#21830;(VAMM)&#27169;&#22411;&#30340;DEX&#19978;&#65292;&#22810;&#22836;&#21644;&#31354;&#22836;&#25345;&#20179;&#37327;&#23545;&#20215;&#26684;&#27874;&#21160;&#20135;&#29983;&#30456;&#21453;&#30340;&#24433;&#21709;&#65292;&#36825;&#24402;&#22240;&#20110;VAMM&#30340;&#20215;&#26684;&#24418;&#25104;&#26426;&#21046;&#12290;&#22312;&#37319;&#29992;&#39044;&#35328;&#26426;&#23450;&#20215;&#27169;&#22411;&#30340;DEX&#20013;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;&#20080;&#23478;&#21644;&#21334;&#23478;&#20043;&#38388;&#20132;&#26131;&#32773;&#34892;&#20026;&#19978;&#23384;&#22312;&#26126;&#26174;&#30340;&#19981;&#23545;&#31216;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study presents a groundbreaking Systematization of Knowledge (SoK) initiative, focusing on an in-depth exploration of the dynamics and behavior of traders on perpetual future contracts across both centralized exchanges (CEXs), and decentralized exchanges (DEXs). We have refined the existing model for investigating traders' behavior in reaction to price volatility to create a new analytical framework specifically for these contract platforms, while also highlighting the role of blockchain technology in their application. Our research includes a comparative analysis of historical data from CEXs and a more extensive examination of complete transactional data on DEXs. On DEX of Virtual Automated Market Making (VAMM) Model, open interest on short and long positions exert effect on price volatility in opposite direction, attributable to VAMM's price formation mechanism. In the DEXs with Oracle Pricing Model, we observed a distinct asymmetry in trader behavior between buyers and sellers.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20379;&#20102;&#23545;&#31895;&#31961;&#27874;&#21160;&#27169;&#22411;&#36827;&#34892;&#20005;&#26684;&#32479;&#35745;&#20998;&#26512;&#30340;&#30740;&#31350;&#65292;&#36890;&#36807;&#24314;&#31435;&#26497;&#23567;&#21270;&#19979;&#30028;&#21644;&#20351;&#29992;&#23567;&#27874;&#26041;&#27861;&#65292;&#25104;&#21151;&#25512;&#26029;&#20102;&#31895;&#31961;&#27874;&#21160;&#27169;&#22411;&#30340;&#21442;&#25968;&#65292;&#24182;&#25193;&#23637;&#20102;&#29616;&#26377;&#30340;&#32467;&#26524;&#12290;</title><link>https://arxiv.org/abs/2210.01214</link><description>&lt;p&gt;
&#31895;&#31961;&#27874;&#21160;&#30340;&#32479;&#35745;&#25512;&#26029;&#65306;&#26497;&#23567;&#21270;&#29702;&#35770;
&lt;/p&gt;
&lt;p&gt;
Statistical inference for rough volatility: Minimax Theory
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2210.01214
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#23545;&#31895;&#31961;&#27874;&#21160;&#27169;&#22411;&#36827;&#34892;&#20005;&#26684;&#32479;&#35745;&#20998;&#26512;&#30340;&#30740;&#31350;&#65292;&#36890;&#36807;&#24314;&#31435;&#26497;&#23567;&#21270;&#19979;&#30028;&#21644;&#20351;&#29992;&#23567;&#27874;&#26041;&#27861;&#65292;&#25104;&#21151;&#25512;&#26029;&#20102;&#31895;&#31961;&#27874;&#21160;&#27169;&#22411;&#30340;&#21442;&#25968;&#65292;&#24182;&#25193;&#23637;&#20102;&#29616;&#26377;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#31895;&#31961;&#27874;&#21160;&#27169;&#22411;&#22312;&#37327;&#21270;&#37329;&#34701;&#30028;&#24341;&#36215;&#20102;&#30456;&#24403;&#22823;&#30340;&#20851;&#27880;&#12290;&#22312;&#36825;&#20010;&#27169;&#22411;&#20013;&#65292;&#36164;&#20135;&#20215;&#26684;&#30340;&#27874;&#21160;&#24615;&#30001;&#19968;&#20010;&#20855;&#26377;&#23567;&#30340;&#36203;&#26031;&#29305;&#21442;&#25968;$H$&#20540;&#30340;&#20998;&#25968;&#24067;&#26391;&#36816;&#21160;&#25152;&#39537;&#21160;&#12290;&#26412;&#25991;&#23545;&#36825;&#20123;&#27169;&#22411;&#36827;&#34892;&#20102;&#20005;&#26684;&#30340;&#32479;&#35745;&#20998;&#26512;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#21442;&#25968;&#20272;&#35745;&#30340;&#26497;&#23567;&#21270;&#19979;&#30028;&#65292;&#24182;&#35774;&#35745;&#20102;&#22522;&#20110;&#23567;&#27874;&#30340;&#31243;&#24207;&#26469;&#36798;&#21040;&#36825;&#20123;&#19979;&#30028;&#30340;&#20272;&#35745;&#12290;&#25105;&#20204;&#23588;&#20854;&#24471;&#21040;&#20102;&#22522;&#20110;n&#20010;&#37319;&#26679;&#25968;&#25454;&#23545;H&#36827;&#34892;&#20272;&#35745;&#30340;&#25910;&#25947;&#36895;&#24230;&#30340;&#26368;&#20248;&#32467;&#26524;&#20026;$n^{-1/(4H+2)}$&#65292;&#36825;&#25193;&#23637;&#20102;&#30446;&#21069;&#20165;&#23545;&#20110;&#36739;&#23481;&#26131;&#30340;&#24773;&#20917;$H&gt;1/2$&#24050;&#30693;&#30340;&#32467;&#26524;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#24471;&#20986;&#32467;&#35770;&#65292;&#31895;&#31961;&#27874;&#21160;&#27169;&#22411;&#30340;&#21442;&#25968;&#21487;&#20197;&#22312;&#25152;&#26377;&#24773;&#20917;&#19979;&#20197;&#26368;&#20248;&#20934;&#30830;&#24615;&#36827;&#34892;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2210.01214v2 Announce Type: replace-cross  Abstract: Rough volatility models have gained considerable interest in the quantitative finance community in recent years. In this paradigm, the volatility of the asset price is driven by a fractional Brownian motion with a small value for the Hurst parameter $H$. In this work, we provide a rigorous statistical analysis of these models. To do so, we establish minimax lower bounds for parameter estimation and design procedures based on wavelets attaining them. We notably obtain an optimal speed of convergence of $n^{-1/(4H+2)}$ for estimating $H$ based on n sampled data, extending results known only for the easier case $H&gt;1/2$ so far. We therefore establish that the parameters of rough volatility models can be inferred with optimal accuracy in all regimes.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;Heston-Hawkes&#38543;&#26426;&#27874;&#21160;&#29575;&#27169;&#22411;&#20013;&#21333;&#20301;&#36830;&#32467;&#25919;&#31574;&#30340;Thiele's PIDE(&#20559;&#24494;&#20998;&#26041;&#31243;)&#65292;&#25512;&#23548;&#20102;Thiele's&#24494;&#20998;&#26041;&#31243;&#20197;&#35745;&#31639;&#20445;&#38505;&#20844;&#21496;&#30340;&#20648;&#22791;&#12290;</title><link>http://arxiv.org/abs/2309.03541</link><description>&lt;p&gt;
Thiele&#22312;Heston-Hawkes&#38543;&#26426;&#27874;&#21160;&#29575;&#27169;&#22411;&#20013;&#30340;&#21333;&#20301;&#36830;&#32467;&#25919;&#31574;&#30340;PIDE(&#20559;&#24494;&#20998;&#26041;&#31243;)
&lt;/p&gt;
&lt;p&gt;
Thiele's PIDE for unit-linked policies in the Heston-Hawkes stochastic volatility model. (arXiv:2309.03541v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.03541
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;Heston-Hawkes&#38543;&#26426;&#27874;&#21160;&#29575;&#27169;&#22411;&#20013;&#21333;&#20301;&#36830;&#32467;&#25919;&#31574;&#30340;Thiele's PIDE(&#20559;&#24494;&#20998;&#26041;&#31243;)&#65292;&#25512;&#23548;&#20102;Thiele's&#24494;&#20998;&#26041;&#31243;&#20197;&#35745;&#31639;&#20445;&#38505;&#20844;&#21496;&#30340;&#20648;&#22791;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30340;&#20027;&#35201;&#30446;&#30340;&#26159;&#25512;&#23548;&#20986;&#22312;arXiv:2210.15343&#20013;&#20171;&#32461;&#30340;Heston-Hawkes&#38543;&#26426;&#27874;&#21160;&#29575;&#27169;&#22411;&#20013;&#21333;&#20301;&#36830;&#32467;&#25919;&#31574;&#30340;Thiele&#30340;&#24494;&#20998;&#26041;&#31243;&#12290;&#35813;&#27169;&#22411;&#26159;&#33879;&#21517;&#30340;Heston&#27169;&#22411;&#30340;&#25193;&#23637;&#65292;&#36890;&#36807;&#22312;&#27874;&#21160;&#29575;&#20013;&#28155;&#21152;&#19968;&#20010;&#22797;&#21512;Hawkes&#36807;&#31243;&#65292;&#24341;&#20837;&#20102;&#27874;&#21160;&#29575;&#32858;&#31867;&#29305;&#24449;&#12290;&#30001;&#20110;&#35813;&#27169;&#22411;&#26159;&#26080;&#22871;&#21033;&#30340;&#65292;&#22240;&#27492;&#21487;&#20197;&#36890;&#36807;&#22312;$\mathbb{Q}$&#19979;&#30340;&#31561;&#20215;&#21407;&#21017;&#19979;&#23450;&#20215;&#21333;&#20301;&#36830;&#32467;&#25919;&#31574;&#12290;&#25105;&#20204;&#26816;&#39564;&#20102;&#19968;&#20123;&#21487;&#31215;&#26465;&#20214;&#65292;&#24182;&#25214;&#21040;&#20102;&#21512;&#36866;&#30340;&#39118;&#38505;&#20013;&#24615;&#27010;&#29575;&#27979;&#24230;&#23478;&#26063;&#20197;&#24471;&#21040;Thiele&#30340;&#24494;&#20998;&#26041;&#31243;&#12290;&#22312;&#20154;&#23551;&#20445;&#38505;&#20844;&#21496;&#20013;&#65292;&#35745;&#31639;&#20648;&#22791;&#30340;&#24314;&#31435;&#21644;&#23454;&#36341;&#26041;&#27861;&#26159;&#36890;&#36807;&#35299;&#20915;Thiele&#30340;&#26041;&#31243;&#65292;&#36825;&#23545;&#20110;&#20445;&#35777;&#20445;&#38505;&#20844;&#21496;&#30340;&#20607;&#20184;&#33021;&#21147;&#26159;&#33267;&#20851;&#37325;&#35201;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
The main purpose of the paper is to derive Thiele's differential equation for unit-linked policies in the Heston-Hawkes stochastic volatility model presented in arXiv:2210.15343. This model is an extension of the well-known Heston model that incorporates the volatility clustering feature by adding a compound Hawkes process in the volatility. Since the model is arbitrage-free, pricing unit-linked policies via the equivalence principle under $\mathbb{Q}$ is possible. Some integrability conditions are checked and a suitable family of risk neutral probability measures is found to obtain Thiele's differential equation. The established and practical method to compute reserves in life insurance is by solving Thiele's equation, which is crucial to guarantee the solvency of the insurance company.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#26126;&#30830;&#25512;&#23548;&#20986;&#24102;&#26377;&#24179;&#22343;&#22330;&#30456;&#20114;&#20316;&#29992;&#30340;&#21151;&#33021;&#38543;&#26426;&#21338;&#24328;&#30340;&#32435;&#20160;&#22343;&#34913;&#65292;&#21516;&#26102;&#35777;&#26126;&#20102;&#22343;&#34913;&#30340;&#25910;&#25947;&#24615;&#21644;&#23384;&#22312;&#30340;&#26465;&#20214;&#27604;&#26377;&#38480;&#29609;&#23478;&#21338;&#24328;&#30340;&#26465;&#20214;&#26356;&#23569;&#12290;</title><link>http://arxiv.org/abs/2306.05433</link><description>&lt;p&gt;
&#24102;&#26377;&#24179;&#22343;&#22330;&#30456;&#20114;&#20316;&#29992;&#30340;&#21151;&#33021;&#38543;&#26426;&#21338;&#24328;&#30340;&#22343;&#34913;
&lt;/p&gt;
&lt;p&gt;
Equilibrium in Functional Stochastic Games with Mean-Field Interaction. (arXiv:2306.05433v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.05433
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#26126;&#30830;&#25512;&#23548;&#20986;&#24102;&#26377;&#24179;&#22343;&#22330;&#30456;&#20114;&#20316;&#29992;&#30340;&#21151;&#33021;&#38543;&#26426;&#21338;&#24328;&#30340;&#32435;&#20160;&#22343;&#34913;&#65292;&#21516;&#26102;&#35777;&#26126;&#20102;&#22343;&#34913;&#30340;&#25910;&#25947;&#24615;&#21644;&#23384;&#22312;&#30340;&#26465;&#20214;&#27604;&#26377;&#38480;&#29609;&#23478;&#21338;&#24328;&#30340;&#26465;&#20214;&#26356;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#19968;&#33324;&#30340;&#26377;&#38480;&#29609;&#23478;&#24102;&#26377;&#24179;&#22343;&#22330;&#30456;&#20114;&#20316;&#29992;&#30340;&#38543;&#26426;&#21338;&#24328;&#65292;&#20854;&#20013;&#32447;&#24615;&#20108;&#27425;&#25104;&#26412;&#20989;&#25968;&#21253;&#25324;&#20316;&#29992;&#20110;$L^2$&#20013;&#30340;&#25511;&#21046;&#30340;&#32447;&#24615;&#31639;&#23376;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#30456;&#20851;&#30340;&#19968;&#38454;&#26465;&#20214;&#20943;&#23569;&#21040;&#31532;&#20108;&#31867;&#38543;&#26426;Fredholm&#26041;&#31243;&#32452;&#30340;&#31995;&#32479;&#65292;&#24182;&#25512;&#23548;&#20986;&#23427;&#20204;&#30340;&#38381;&#24418;&#24335;&#35299;&#26469;&#26126;&#30830;&#25512;&#23548;&#20986;&#20102;&#21338;&#24328;&#30340;&#32435;&#20160;&#22343;&#34913;&#12290;&#27492;&#22806;&#65292;&#36890;&#36807;&#35777;&#26126;&#38543;&#26426;Fredholm&#26041;&#31243;&#32452;&#30340;&#31283;&#23450;&#24615;&#32467;&#26524;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#20102;$N$&#20154;&#21338;&#24328;&#30340;&#22343;&#34913;&#25910;&#25947;&#21040;&#30456;&#24212;&#30340;&#24179;&#22343;&#22330;&#22343;&#34913;&#12290;&#20316;&#20026;&#19968;&#20010;&#21103;&#20135;&#21697;&#65292;&#25105;&#20204;&#36824;&#25512;&#23548;&#20986;&#20102;&#24179;&#22343;&#22330;&#21338;&#24328;&#30340;$\varepsilon$-&#32435;&#20160;&#22343;&#34913;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#23427;&#20855;&#26377;&#20215;&#20540;&#65292;&#22240;&#20026;&#25105;&#20204;&#34920;&#26126;&#65292;&#22312;&#24179;&#22343;&#22330;&#26497;&#38480;&#23384;&#22312;&#22343;&#34913;&#30340;&#26465;&#20214;&#27604;&#26377;&#38480;&#29609;&#23478;&#21338;&#24328;&#30340;&#26465;&#20214;&#35201;&#23569;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#19968;&#33324;&#26694;&#26550;&#24212;&#29992;&#20110;&#35299;&#20915;&#21508;&#31181;&#20363;&#23376;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider a general class of finite-player stochastic games with mean-field interaction, in which the linear-quadratic cost functional includes linear operators acting on controls in $L^2$. We propose a novel approach for deriving the Nash equilibrium of the game explicitly in terms of operator resolvents, by reducing the associated first order conditions to a system of stochastic Fredholm equations of the second kind and deriving their closed form solution. Furthermore, by proving stability results for the system of stochastic Fredholm equations we derive the convergence of the equilibrium of the $N$-player game to the corresponding mean-field equilibrium. As a by-product we also derive an $\varepsilon$-Nash equilibrium for the mean-field game, which is valuable in this setting as we show that the conditions for existence of an equilibrium in the mean-field limit are less restrictive than in the finite-player game. Finally we apply our general framework to solve various examples, su
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#33021;&#22815;&#27169;&#25311;&#29616;&#23454;&#20013;&#22797;&#26434;&#30340;&#22810;&#23618;&#27425;&#25293;&#21334;&#25968;&#25454;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#20195;&#29702;&#23398;&#20064;&#21644;&#24314;&#27169;&#24212;&#29992;&#65292;&#20026;&#27169;&#25311;&#24615;&#30740;&#31350;&#30340;&#36827;&#23637;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;</title><link>http://arxiv.org/abs/2207.12255</link><description>&lt;p&gt;
&#23454;&#29616;&#22522;&#20110;&#20998;&#23618;&#28145;&#24230;&#23398;&#20064;&#30340;&#22810;&#23618;&#27425;&#25293;&#21334;&#25968;&#25454;&#27169;&#25311;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Implementing a Hierarchical Deep Learning Approach for Simulating Multi-Level Auction Data. (arXiv:2207.12255v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.12255
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#33021;&#22815;&#27169;&#25311;&#29616;&#23454;&#20013;&#22797;&#26434;&#30340;&#22810;&#23618;&#27425;&#25293;&#21334;&#25968;&#25454;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#20195;&#29702;&#23398;&#20064;&#21644;&#24314;&#27169;&#24212;&#29992;&#65292;&#20026;&#27169;&#25311;&#24615;&#30740;&#31350;&#30340;&#36827;&#23637;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#28145;&#24230;&#23398;&#20064;&#35299;&#20915;&#26041;&#26696;&#65292;&#20197;&#24212;&#23545;&#27169;&#25311;&#29616;&#23454;&#21512;&#29702;&#30340;&#21512;&#21516;&#25293;&#21334;&#25968;&#25454;&#25152;&#36935;&#21040;&#30340;&#25361;&#25112;&#12290;&#36825;&#31181;&#31867;&#22411;&#30340;&#25293;&#21334;&#25968;&#25454;&#25152;&#36935;&#21040;&#30340;&#22797;&#26434;&#24615;&#21253;&#25324;&#39640;&#22522;&#25968;&#31163;&#25955;&#29305;&#24449;&#31354;&#38388;&#21644;&#30001;&#19982;&#21333;&#20010;&#25293;&#21334;&#23454;&#20363;&#30456;&#20851;&#32852;&#30340;&#22810;&#20010;&#20986;&#20215;&#24341;&#36215;&#30340;&#22810;&#23618;&#32423;&#32467;&#26500;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#23558;&#28145;&#24230;&#29983;&#25104;&#24314;&#27169;&#65288;DGM&#65289;&#19982;&#39044;&#27979;&#22522;&#20110;&#25293;&#21334;&#29305;&#24449;&#30340;&#26465;&#20214;&#20986;&#20215;&#20998;&#24067;&#30340;&#20154;&#24037;&#23398;&#20064;&#22120;&#30456;&#32467;&#21512;&#65292;&#20026;&#27169;&#25311;&#24615;&#30740;&#31350;&#30340;&#36827;&#23637;&#20570;&#20986;&#36129;&#29486;&#12290;&#36825;&#31181;&#26041;&#27861;&#20026;&#21019;&#24314;&#36866;&#29992;&#20110;&#20195;&#29702;&#23398;&#20064;&#21644;&#24314;&#27169;&#24212;&#29992;&#30340;&#30495;&#23454;&#25293;&#21334;&#29615;&#22659;&#22880;&#23450;&#20102;&#22522;&#30784;&#12290;&#25105;&#20204;&#30340;&#36129;&#29486;&#26377;&#20004;&#20010;&#26041;&#38754;&#65306;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#32508;&#21512;&#30340;&#26041;&#27861;&#26469;&#27169;&#25311;&#22810;&#23618;&#27425;&#31163;&#25955;&#25293;&#21334;&#25968;&#25454;&#65292;&#25105;&#20204;&#24378;&#35843;&#20102;DGM&#20316;&#20026;&#20248;&#21270;&#27169;&#25311;&#25216;&#26415;&#21644;&#20419;&#36827;&#22522;&#20110;&#29983;&#25104;&#22411;&#20154;&#24037;&#26234;&#33021;&#30340;&#32463;&#27982;&#27169;&#22411;&#21457;&#23637;&#30340;&#26377;&#21147;&#24037;&#20855;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a deep learning solution to address the challenges of simulating realistic synthetic first-price sealed-bid auction data. The complexities encountered in this type of auction data include high-cardinality discrete feature spaces and a multilevel structure arising from multiple bids associated with a single auction instance. Our methodology combines deep generative modeling (DGM) with an artificial learner that predicts the conditional bid distribution based on auction characteristics, contributing to advancements in simulation-based research. This approach lays the groundwork for creating realistic auction environments suitable for agent-based learning and modeling applications. Our contribution is twofold: we introduce a comprehensive methodology for simulating multilevel discrete auction data, and we underscore the potential of DGM as a powerful instrument for refining simulation techniques and fostering the development of economic models grounded in generative AI.
&lt;/p&gt;</description></item></channel></rss>