<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#36890;&#36807;&#23558;&#32929;&#31080;&#29305;&#24449;&#21644;&#20840;&#29699;&#20449;&#24687;&#25972;&#21512;&#21040;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26694;&#26550;&#26469;&#22686;&#24378;&#32929;&#31080;&#22238;&#25253;&#39044;&#27979;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#26412;&#22320;-&#20840;&#29699;&#27169;&#22411;&#21644;&#33258;&#30456;&#20851;&#22686;&#24378;&#23398;&#20064;&#26041;&#27861;&#65292;&#20197;&#20811;&#26381;&#29616;&#26377;&#37327;&#21270;&#27169;&#22411;&#20013;&#30340;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2310.05627</link><description>&lt;p&gt;
&#36890;&#36807;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#25972;&#21512;&#32929;&#31080;&#29305;&#24449;&#21644;&#20840;&#29699;&#20449;&#24687;&#65292;&#22686;&#24378;&#32929;&#31080;&#22238;&#25253;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Integrating Stock Features and Global Information via Large Language Models for Enhanced Stock Return Prediction. (arXiv:2310.05627v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.05627
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#23558;&#32929;&#31080;&#29305;&#24449;&#21644;&#20840;&#29699;&#20449;&#24687;&#25972;&#21512;&#21040;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26694;&#26550;&#26469;&#22686;&#24378;&#32929;&#31080;&#22238;&#25253;&#39044;&#27979;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#26412;&#22320;-&#20840;&#29699;&#27169;&#22411;&#21644;&#33258;&#30456;&#20851;&#22686;&#24378;&#23398;&#20064;&#26041;&#27861;&#65292;&#20197;&#20811;&#26381;&#29616;&#26377;&#37327;&#21270;&#27169;&#22411;&#20013;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#22914;ChatGPT&#21644;GPT-4&#30340;&#21331;&#36234;&#25104;&#23601;&#21644;&#24555;&#36895;&#36827;&#23637;&#23637;&#31034;&#20102;&#23427;&#20204;&#22312;&#37327;&#21270;&#25237;&#36164;&#20013;&#30340;&#24040;&#22823;&#28508;&#21147;&#12290;&#20132;&#26131;&#21592;&#21487;&#20197;&#26377;&#25928;&#21033;&#29992;&#36825;&#20123;LLMs&#20998;&#26512;&#36130;&#32463;&#26032;&#38395;&#24182;&#20934;&#30830;&#39044;&#27979;&#32929;&#31080;&#22238;&#25253;&#12290;&#28982;&#32780;&#65292;&#23558;LLMs&#25972;&#21512;&#21040;&#29616;&#26377;&#30340;&#37327;&#21270;&#27169;&#22411;&#20013;&#23384;&#22312;&#20004;&#20010;&#20027;&#35201;&#25361;&#25112;&#65306;&#26410;&#20805;&#20998;&#21033;&#29992;LLMs&#20013;&#23884;&#20837;&#30340;&#35821;&#20041;&#20449;&#24687;&#20197;&#21450;&#23558;LLMs&#20013;&#30340;&#28508;&#22312;&#20449;&#24687;&#19982;&#29616;&#26377;&#30340;&#37327;&#21270;&#32929;&#31080;&#29305;&#24449;&#23545;&#40784;&#30340;&#22256;&#38590;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#30001;&#20004;&#20010;&#32452;&#20214;&#32452;&#25104;&#30340;&#26032;&#26694;&#26550;&#65292;&#20197;&#20811;&#26381;&#36825;&#20123;&#25361;&#25112;&#12290;&#31532;&#19968;&#20010;&#32452;&#20214;&#26159;&#26412;&#22320;-&#20840;&#29699;&#65288;LG&#65289;&#27169;&#22411;&#65292;&#23427;&#24341;&#20837;&#20102;&#19977;&#20010;&#19981;&#21516;&#30340;&#31574;&#30053;&#26469;&#23545;&#20840;&#29699;&#20449;&#24687;&#36827;&#34892;&#24314;&#27169;&#12290;&#36825;&#20123;&#26041;&#27861;&#20998;&#21035;&#22522;&#20110;&#32929;&#31080;&#29305;&#24449;&#12289;LLMs&#30340;&#33021;&#21147;&#20197;&#21450;&#32467;&#21512;&#20004;&#20010;&#33539;&#24335;&#30340;&#28151;&#21512;&#26041;&#27861;&#12290;&#31532;&#20108;&#20010;&#32452;&#20214;&#26159;&#33258;&#30456;&#20851;&#22686;&#24378;&#23398;&#20064;&#65288;SCRL&#65289;&#65292;&#20854;&#37325;&#28857;&#26159;&#23545;&#40784;&#20004;&#20010;&#27169;&#22411;&#20043;&#38388;&#30340;&#20851;&#32852;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
The remarkable achievements and rapid advancements of Large Language Models (LLMs) such as ChatGPT and GPT-4 have showcased their immense potential in quantitative investment. Traders can effectively leverage these LLMs to analyze financial news and predict stock returns accurately. However, integrating LLMs into existing quantitative models presents two primary challenges: the insufficient utilization of semantic information embedded within LLMs and the difficulties in aligning the latent information within LLMs with pre-existing quantitative stock features. We propose a novel framework consisting of two components to surmount these challenges. The first component, the Local-Global (LG) model, introduces three distinct strategies for modeling global information. These approaches are grounded respectively on stock features, the capabilities of LLMs, and a hybrid method combining the two paradigms. The second component, Self-Correlated Reinforcement Learning (SCRL), focuses on aligning 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#24066;&#22330;&#20247;&#31609;&#30340;&#20132;&#26131;&#34892;&#20026;&#20197;&#21450;&#20132;&#26131;&#37327;&#23545;&#20110;&#20215;&#26684;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#24066;&#22330;&#20247;&#31609;&#22312;&#26377;&#25928;&#36866;&#24212;&#20013;&#20132;&#26131;&#32929;&#31080;&#65292;&#24182;&#22312;&#20132;&#20114;&#21644;&#31454;&#20105;&#20013;&#20135;&#29983;&#31283;&#23450;&#30340;&#22343;&#34913;&#20215;&#26684;&#12290;</title><link>http://arxiv.org/abs/2310.05322</link><description>&lt;p&gt;
&#24066;&#22330;&#20247;&#31609;&#30340;&#20132;&#26131;&#34892;&#20026;&#12289;&#19968;&#33268;&#20215;&#26684;&#21450;&#20132;&#26131;&#37327;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Market Crowds' Trading Behaviors, Agreement Prices, and the Implications of Trading Volume. (arXiv:2310.05322v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.05322
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24066;&#22330;&#20247;&#31609;&#30340;&#20132;&#26131;&#34892;&#20026;&#20197;&#21450;&#20132;&#26131;&#37327;&#23545;&#20110;&#20215;&#26684;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#24066;&#22330;&#20247;&#31609;&#22312;&#26377;&#25928;&#36866;&#24212;&#20013;&#20132;&#26131;&#32929;&#31080;&#65292;&#24182;&#22312;&#20132;&#20114;&#21644;&#31454;&#20105;&#20013;&#20135;&#29983;&#31283;&#23450;&#30340;&#22343;&#34913;&#20215;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38271;&#26399;&#20197;&#26469;&#65292;&#37329;&#34701;&#23398;&#30028;&#30340;&#25991;&#29486;&#20027;&#35201;&#20851;&#27880;&#20215;&#26684;&#21644;&#22238;&#25253;&#65292;&#20294;&#23545;&#20132;&#26131;&#37327;&#30340;&#30740;&#31350;&#36739;&#23569;&#12290;&#22312;&#36807;&#21435;&#30340;&#20108;&#21313;&#24180;&#20013;&#65292;&#24050;&#32463;&#23558;&#20215;&#26684;&#21644;&#20132;&#26131;&#37327;&#19982;&#32463;&#27982;&#22522;&#26412;&#38754;&#32852;&#31995;&#36215;&#26469;&#65292;&#24182;&#25506;&#32034;&#20102;&#20132;&#26131;&#37327;&#30340;&#34892;&#20026;&#24433;&#21709;&#65292;&#22914;&#25237;&#36164;&#32773;&#23545;&#39118;&#38505;&#30340;&#24577;&#24230;&#12289;&#36807;&#24230;&#33258;&#20449;&#12289;&#20998;&#27495;&#21644;&#20851;&#27880;&#31561;&#12290;&#28982;&#32780;&#65292;&#20196;&#20154;&#24778;&#35766;&#30340;&#26159;&#25105;&#20204;&#23545;&#20132;&#26131;&#37327;&#23454;&#38469;&#19978;&#30693;&#20043;&#29978;&#23569;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#20132;&#26131;&#37327;&#27010;&#29575;&#34920;&#31034;&#24066;&#22330;&#20247;&#31609;&#30340;&#20132;&#26131;&#34892;&#20026;&#39057;&#29575;&#65292;&#24182;&#27979;&#35797;&#20102;&#19982;&#20013;&#22269;&#32929;&#24066;&#20215;&#26684;&#30456;&#20851;&#30340;&#20004;&#20010;&#33258;&#36866;&#24212;&#20551;&#35774;&#12290;&#32463;&#39564;&#30740;&#31350;&#25581;&#31034;&#20102;&#24066;&#22330;&#20247;&#31609;&#22312;&#26377;&#25928;&#36866;&#24212;&#20013;&#20132;&#26131;&#32929;&#31080;&#65292;&#38500;&#20102;&#31616;&#21333;&#30340;&#21551;&#21457;&#24335;&#31639;&#27861;&#22806;&#65292;&#28176;&#28176;&#20542;&#21521;&#20110;&#22312;&#20132;&#26131;&#26085;&#20869;&#23545;&#19968;&#20010;&#32467;&#26524;&#25110;&#36164;&#20135;&#20215;&#26684;&#36798;&#25104;&#19968;&#33268;&#65292;&#24182;&#19988;&#32463;&#24120;&#22312;&#20132;&#20114;&#21644;&#31454;&#20105;&#20013;&#20135;&#29983;&#36825;&#26679;&#19968;&#20010;&#31283;&#23450;&#30340;&#22343;&#34913;&#20215;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;
It has been long that literature in financial academics focuses mainly on price and return but much less on trading volume. In the past twenty years, it has already linked both price and trading volume to economic fundamentals, and explored the behavioral implications of trading volume such as investor's attitude toward risks, overconfidence, disagreement, and attention etc. However, what is surprising is how little we really know about trading volume. Here we show that trading volume probability represents the frequency of market crowd's trading action in terms of behavior analysis, and test two adaptive hypotheses relevant to the volume uncertainty associated with price in China stock market. The empirical work reveals that market crowd trade a stock in efficient adaptation except for simple heuristics, gradually tend to achieve agreement on an outcome or an asset price widely on a trading day, and generate such a stationary equilibrium price very often in interaction and competition
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;2020&#24180;&#27665;&#38388;&#36873;&#20030;&#34892;&#25919;&#36164;&#37329;&#23545;&#24635;&#32479;&#36873;&#20030;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#23613;&#31649;&#27665;&#20027;&#20826;&#20542;&#21521;&#30340;&#21439;&#26356;&#26377;&#21487;&#33021;&#33719;&#24471;&#36164;&#21161;&#65292;&#20294;&#36825;&#20123;&#36164;&#21161;&#24182;&#27809;&#26377;&#23545;&#36873;&#20030;&#32467;&#26524;&#20135;&#29983;&#26126;&#26174;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2310.05275</link><description>&lt;p&gt;
&#27665;&#38388;&#36873;&#20030;&#34892;&#25919;&#36164;&#37329;&#26159;&#21542;&#22312;2020&#24180;&#32473;&#20104;&#27665;&#20027;&#20826;&#20197;&#20248;&#21183;&#65311;&#65288;arXiv:2310.05275v1 [econ.GN]&#65289;
&lt;/p&gt;
&lt;p&gt;
Did Private Election Administration Funding Advantage Democrats in 2020?. (arXiv:2310.05275v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.05275
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;2020&#24180;&#27665;&#38388;&#36873;&#20030;&#34892;&#25919;&#36164;&#37329;&#23545;&#24635;&#32479;&#36873;&#20030;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#23613;&#31649;&#27665;&#20027;&#20826;&#20542;&#21521;&#30340;&#21439;&#26356;&#26377;&#21487;&#33021;&#33719;&#24471;&#36164;&#21161;&#65292;&#20294;&#36825;&#20123;&#36164;&#21161;&#24182;&#27809;&#26377;&#23545;&#36873;&#20030;&#32467;&#26524;&#20135;&#29983;&#26126;&#26174;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31169;&#20154;&#25424;&#21161;&#32773;&#20026;&#25903;&#25345;2020&#24180;&#36873;&#20030;&#30340;&#34892;&#25919;&#24037;&#20316;&#21521;&#22320;&#26041;&#36873;&#20030;&#23448;&#21592;&#25424;&#36192;&#20102;&#36229;&#36807;3.5&#20159;&#32654;&#20803;&#12290;&#25903;&#25345;&#32773;&#36777;&#31216;&#36825;&#20123;&#36164;&#21161;&#26159;&#20013;&#31435;&#30340;&#65292;&#26159;&#22312;&#30123;&#24773;&#26399;&#38388;&#32500;&#25345;&#27491;&#24120;&#36873;&#20030;&#24037;&#20316;&#25152;&#24517;&#38656;&#30340;&#65292;&#32780;&#25209;&#35780;&#32773;&#25285;&#24515;&#36825;&#20123;&#36164;&#21161;&#20027;&#35201;&#27969;&#21521;&#20102;&#27665;&#20027;&#20826;&#30340;&#31080;&#20179;&#65292;&#24182;&#24433;&#21709;&#20102;&#36873;&#20030;&#32467;&#26524;&#12290;&#20986;&#20110;&#36825;&#20123;&#25285;&#24551;&#65292;24&#20010;&#24030;&#38480;&#21046;&#20102;&#31169;&#20154;&#36873;&#20030;&#36164;&#21161;&#12290;&#36825;&#20123;&#36164;&#21161;&#22312;2020&#24180;&#24635;&#32479;&#36873;&#20030;&#20013;&#36215;&#21040;&#20102;&#22810;&#22823;&#30340;&#20316;&#29992;&#65311;&#20026;&#20102;&#22238;&#31572;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25910;&#38598;&#20102;&#31169;&#20154;&#36873;&#20030;&#34892;&#25919;&#36164;&#21161;&#21644;&#36873;&#20030;&#32467;&#26524;&#30340;&#34892;&#25919;&#25968;&#25454;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#21033;&#29992;&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;&#30340;&#26032;&#36827;&#23637;&#65292;&#27604;&#36739;&#20102;&#25910;&#21040;&#36164;&#21161;&#30340;&#21439;&#19982;2020&#24180;&#20043;&#21069;&#24179;&#22343;&#24635;&#32479;&#36873;&#20030;&#32467;&#26524;&#21644;&#25237;&#31080;&#29575;&#23436;&#20840;&#30456;&#21516;&#30340;&#21439;&#30340;&#24635;&#32479;&#36873;&#20030;&#32467;&#26524;&#21644;&#25237;&#31080;&#29575;&#12290;&#34429;&#28982;&#27665;&#20027;&#20826;&#20542;&#21521;&#30340;&#21439;&#26356;&#26377;&#21487;&#33021;&#30003;&#35831;&#36164;&#21161;&#65292;&#20294;&#25105;&#20204;&#21457;&#29616;&#36825;&#20123;&#36164;&#21161;&#24182;&#27809;&#26377;&#23545;&#24635;&#32479;&#36873;&#20030;&#32467;&#26524;&#20135;&#29983;&#26126;&#26174;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Private donors contributed more than $350 million to local election officials to support the administration of the 2020 election. Supporters argue these grants were neutral and necessary to maintain normal election operations during the pandemic, while critics worry these grants mostly went to Democratic strongholds and tilted election outcomes. These concerns have led twenty-four states to restrict private election grants. How much did these grants shape the 2020 presidential election? To answer this question, we collect administrative data on private election administration grants and election outcomes. We then use new advances in synthetic control methods to compare presidential election results and turnout in counties that received grants to counties with identical average presidential election results and turnout before 2020. While counties that favor Democrats were much more likely to apply for a grant, we find that the grants did not have a noticeable effect on the presidential 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#32771;&#34385;&#37329;&#34701;&#21644;&#23454;&#38469;&#37096;&#38376;&#30340;&#26102;&#21464;&#37329;&#34701;&#24341;&#23548;&#27169;&#22411;&#65292;&#36890;&#36807;&#30740;&#31350;&#19981;&#21516;&#30340;&#32654;&#22269;&#32463;&#27982;&#21608;&#26399;&#23792;&#20540;&#65292;&#21457;&#29616;&#21033;&#28070;&#39537;&#21160;&#30340;&#38656;&#27714;&#21644;&#21033;&#28070;&#25380;&#21387;&#30340;&#20998;&#37197;&#20307;&#21046;&#23384;&#22312;&#65292;&#24182;&#19988;&#36825;&#20123;&#20307;&#21046;&#22312;&#8220;&#22823;&#24133;&#32531;&#21644;&#8221;&#26399;&#38388;&#20943;&#24369;&#65292;&#21516;&#26102;&#36824;&#21457;&#29616;&#26631;&#20934;&#30340;Goodwin&#21464;&#37327;&#19982;&#20303;&#23429;&#25237;&#36164;&#21644;&#21033;&#29575;&#24046;&#20043;&#38388;&#23384;&#22312;&#26174;&#33879;&#32852;&#31995;&#12290;</title><link>http://arxiv.org/abs/2310.05153</link><description>&lt;p&gt;
&#19968;&#31181;&#38024;&#23545;&#32654;&#22269;&#32463;&#27982;&#21608;&#26399;&#30340;&#26102;&#21464;&#37329;&#34701;&#24341;&#23548;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
A time-varying finance-led model for U.S. business cycles. (arXiv:2310.05153v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.05153
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#32771;&#34385;&#37329;&#34701;&#21644;&#23454;&#38469;&#37096;&#38376;&#30340;&#26102;&#21464;&#37329;&#34701;&#24341;&#23548;&#27169;&#22411;&#65292;&#36890;&#36807;&#30740;&#31350;&#19981;&#21516;&#30340;&#32654;&#22269;&#32463;&#27982;&#21608;&#26399;&#23792;&#20540;&#65292;&#21457;&#29616;&#21033;&#28070;&#39537;&#21160;&#30340;&#38656;&#27714;&#21644;&#21033;&#28070;&#25380;&#21387;&#30340;&#20998;&#37197;&#20307;&#21046;&#23384;&#22312;&#65292;&#24182;&#19988;&#36825;&#20123;&#20307;&#21046;&#22312;&#8220;&#22823;&#24133;&#32531;&#21644;&#8221;&#26399;&#38388;&#20943;&#24369;&#65292;&#21516;&#26102;&#36824;&#21457;&#29616;&#26631;&#20934;&#30340;Goodwin&#21464;&#37327;&#19982;&#20303;&#23429;&#25237;&#36164;&#21644;&#21033;&#29575;&#24046;&#20043;&#38388;&#23384;&#22312;&#26174;&#33879;&#32852;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#23558;&#23454;&#38469;&#21644;&#37329;&#34701;&#37096;&#38376;&#25972;&#21512;&#36215;&#26469;&#65292;&#23454;&#35777;&#35780;&#20272;Goodwin&#20851;&#20110;&#38656;&#27714;&#21644;&#20998;&#37197;&#20307;&#21046;&#30340;&#21608;&#26399;&#24615;&#22686;&#38271;&#27169;&#22411;&#30340;&#39044;&#27979;&#65292;&#21516;&#26102;&#35780;&#20272;&#20102;&#37329;&#34701;&#21644;&#23601;&#19994;&#20914;&#20987;&#23545;&#20845;&#20010;&#19981;&#21516;&#30340;&#32654;&#22269;&#32463;&#27982;&#21608;&#26399;&#23792;&#20540;&#19978;&#30340;&#21171;&#21160;&#21147;&#24066;&#22330;&#21644;&#36135;&#24065;&#25919;&#31574;&#21464;&#37327;&#30340;&#24433;&#21709;&#12290;&#23427;&#36890;&#36807;&#20351;&#29992;&#21171;&#21160;&#25910;&#20837;&#20221;&#39069;&#12289;&#23601;&#19994;&#29575;&#12289;&#20303;&#23429;&#25237;&#36164;&#21644;&#21033;&#29575;&#24046;&#31561;&#20869;&#29983;&#21464;&#37327;&#30340;&#19968;&#31181;&#31616;&#21270;&#30340;&#20855;&#26377;&#38543;&#26426;&#27874;&#21160;&#30340;&#26102;&#21464;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#65288;TVP-VAR-SV&#65289;&#65292;&#24182;&#37319;&#29992;&#36125;&#21494;&#26031;&#25512;&#26029;&#26041;&#27861;&#65292;&#20851;&#38190;&#32467;&#26524;&#34920;&#26126;&#65288;i&#65289;&#21033;&#28070;&#39537;&#21160;&#30340;&#38656;&#27714;&#21644;&#21033;&#28070;&#25380;&#21387;&#30340;&#20998;&#37197;&#30340;&#32452;&#21512;&#65307;&#65288;ii&#65289;&#22312;&#8220;&#22823;&#24133;&#32531;&#21644;&#8221;&#26399;&#38388;&#36825;&#20123;&#20307;&#21046;&#30340;&#20943;&#24369;&#65307;&#20197;&#21450;&#65288;iii&#65289;&#26631;&#20934;&#30340;Goodwin&#21464;&#37327;&#19982;&#20303;&#23429;&#25237;&#36164;&#21644;&#21033;&#29575;&#24046;&#20043;&#38388;&#23384;&#22312;&#26174;&#33879;&#32852;&#31995;&#12290;&#26412;&#30740;&#31350;&#30340;&#32467;&#26524;&#24635;&#20307;&#19978;&#31526;&#21512;&#37329;&#34701;&#21644;&#21171;&#21160;&#21147;&#24066;&#22330;&#26085;&#30410;&#35299;&#38500;&#31649;&#21046;&#30340;&#36716;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper empirically assesses predictions of Goodwin's model of cyclical growth regarding demand and distributive regimes when integrating the real and financial sectors. In addition, it evaluates how financial and employment shocks affect the labor market and monetary policy variables over six different U.S. business-cycle peaks. It identifies a parsimonious Time-Varying Vector Autoregressive model with Stochastic Volatility (TVP-VAR-SV) with the labor share of income, the employment rate, residential investment, and the interest rate spread as endogenous variables. Using Bayesian inference methods, key results suggest (i) a combination of profit-led demand and profit-squeeze distribution; (ii) weakening of these regimes during the Great Moderation; and (iii) significant connections between the standard Goodwinian variables and residential investment as well as term spreads. Findings presented here broadly conform to the transition to increasingly deregulated financial and labor mar
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21271;&#39532;&#20854;&#39039;&#21046;&#36896;&#19994;&#21171;&#21160;&#21147;&#20221;&#39069;&#19982;&#26368;&#20302;&#24037;&#36164;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#26368;&#20302;&#24037;&#36164;&#23545;&#21171;&#21160;&#21147;&#20221;&#39069;&#26377;&#30528;&#34892;&#19994;&#29305;&#23450;&#30340;&#24433;&#21709;&#12290;&#23545;&#20110;&#21171;&#21160;&#21147;&#23494;&#38598;&#22411;&#19988;&#24037;&#36164;&#20302;&#30340;&#34892;&#19994;&#65292;&#26368;&#20302;&#24037;&#36164;&#20250;&#22686;&#21152;&#24037;&#20154;&#30340;&#21171;&#21160;&#21147;&#20221;&#39069;&#65292;&#24182;&#20307;&#29616;&#20986;&#36164;&#26412;&#19982;&#21171;&#21160;&#20043;&#38388;&#30340;&#20114;&#34917;&#24615;&#12290;&#32780;&#23545;&#20110;&#36164;&#26412;&#23494;&#38598;&#22411;&#34892;&#19994;&#65292;&#26368;&#20302;&#24037;&#36164;&#20250;&#20943;&#23569;&#21171;&#21160;&#21147;&#20221;&#39069;&#65292;&#21487;&#33021;&#26159;&#22240;&#20026;&#23384;&#22312;&#21171;&#21160;&#23703;&#20301;&#30340;&#20943;&#23569;&#21644;&#21171;&#21160;&#21147;&#19982;&#36164;&#26412;&#20043;&#38388;&#30340;&#26367;&#20195;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.05117</link><description>&lt;p&gt;
&#26368;&#20302;&#24037;&#36164;&#21644;&#21046;&#36896;&#19994;&#21171;&#21160;&#21147;&#20221;&#39069;&#65306;&#21271;&#39532;&#20854;&#39039;&#30340;&#23454;&#35777;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Minimum wage and manufacturing labor share: Evidence from North Macedonia. (arXiv:2310.05117v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.05117
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21271;&#39532;&#20854;&#39039;&#21046;&#36896;&#19994;&#21171;&#21160;&#21147;&#20221;&#39069;&#19982;&#26368;&#20302;&#24037;&#36164;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#26368;&#20302;&#24037;&#36164;&#23545;&#21171;&#21160;&#21147;&#20221;&#39069;&#26377;&#30528;&#34892;&#19994;&#29305;&#23450;&#30340;&#24433;&#21709;&#12290;&#23545;&#20110;&#21171;&#21160;&#21147;&#23494;&#38598;&#22411;&#19988;&#24037;&#36164;&#20302;&#30340;&#34892;&#19994;&#65292;&#26368;&#20302;&#24037;&#36164;&#20250;&#22686;&#21152;&#24037;&#20154;&#30340;&#21171;&#21160;&#21147;&#20221;&#39069;&#65292;&#24182;&#20307;&#29616;&#20986;&#36164;&#26412;&#19982;&#21171;&#21160;&#20043;&#38388;&#30340;&#20114;&#34917;&#24615;&#12290;&#32780;&#23545;&#20110;&#36164;&#26412;&#23494;&#38598;&#22411;&#34892;&#19994;&#65292;&#26368;&#20302;&#24037;&#36164;&#20250;&#20943;&#23569;&#21171;&#21160;&#21147;&#20221;&#39069;&#65292;&#21487;&#33021;&#26159;&#22240;&#20026;&#23384;&#22312;&#21171;&#21160;&#23703;&#20301;&#30340;&#20943;&#23569;&#21644;&#21171;&#21160;&#21147;&#19982;&#36164;&#26412;&#20043;&#38388;&#30340;&#26367;&#20195;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30340;&#30446;&#26631;&#26159;&#20102;&#35299;&#26368;&#20302;&#24037;&#36164;&#26159;&#21542;&#23545;&#21271;&#39532;&#20854;&#39039;&#21046;&#36896;&#19994;&#24037;&#20154;&#30340;&#21171;&#21160;&#21147;&#20221;&#39069;&#36215;&#20316;&#29992;&#12290;&#25105;&#20204;&#23545;&#21171;&#21160;&#21147;&#20221;&#39069;&#30340;&#21464;&#21270;&#36827;&#34892;&#20102;&#20998;&#35299;&#65292;&#21253;&#25324;&#27839;&#30528;&#20221;&#39069;-&#36164;&#26412;&#26354;&#32447;&#30340;&#21464;&#21270;&#12289;&#35813;&#26354;&#32447;&#30340;&#31227;&#21160;&#20197;&#21450;&#19982;&#20043;&#20559;&#31163;&#30340;&#22240;&#32032;&#12290;&#25105;&#20204;&#20351;&#29992;&#36164;&#26412;&#20135;&#20986;&#27604;&#29575;&#12289;&#20840;&#35201;&#32032;&#29983;&#20135;&#29575;&#21644;&#25237;&#20837;&#21697;&#20215;&#26684;&#26469;&#25429;&#25417;&#36825;&#20123;&#22240;&#32032;&#65292;&#21516;&#26102;&#24341;&#20837;&#26368;&#20302;&#24037;&#36164;&#20316;&#20026;&#23558;&#26354;&#32447;&#20559;&#31163;&#30340;&#20803;&#32032;&#12290;&#25105;&#20204;&#20351;&#29992;FE&#12289;IV&#21644;&#31995;&#32479;GMM&#20272;&#35745;&#22120;&#23545;2012&#24180;&#33267;2019&#24180;&#26399;&#38388;&#30340;20&#20010;&#21046;&#36896;&#19994;&#32454;&#20998;&#36827;&#34892;&#38754;&#26495;&#25968;&#25454;&#20998;&#26512;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#26368;&#20302;&#24037;&#36164;&#23545;&#21171;&#21160;&#21147;&#20221;&#39069;&#30340;&#20316;&#29992;&#22240;&#34892;&#19994;&#32780;&#24322;&#12290;&#23545;&#20110;&#21171;&#21160;&#21147;&#23494;&#38598;&#22411;&#19988;&#24037;&#36164;&#20302;&#30340;&#34892;&#19994;&#65292;&#23427;&#22686;&#21152;&#20102;&#24037;&#20154;&#30340;&#21171;&#21160;&#21147;&#20221;&#39069;&#65292;&#34920;&#29616;&#20986;&#36164;&#26412;&#19982;&#21171;&#21160;&#20043;&#38388;&#30340;&#20114;&#34917;&#24615;&#12290;&#23545;&#20110;&#36164;&#26412;&#23494;&#38598;&#22411;&#34892;&#19994;&#65292;&#23427;&#20943;&#23569;&#20102;&#21171;&#21160;&#21147;&#20221;&#39069;&#65292;&#21487;&#33021;&#26159;&#36890;&#36807;&#22833;&#19994;&#28192;&#36947;&#65292;&#34920;&#29616;&#20986;&#21171;&#21160;&#21147;&#21644;&#36164;&#26412;&#20043;&#38388;&#30340;&#26367;&#20195;&#24615;&#12290;&#36825;&#36866;&#29992;&#20110;&#22806;&#22269;&#25237;&#36164;&#21644;...
&lt;/p&gt;
&lt;p&gt;
The objective of the paper is to understand if the minimum wage plays a role for the labor share of manufacturing workers in North Macedonia. We decompose labor share movements on those along a share-capital curve, shifts of this locus, and deviations from it. We use the capital-output ratio, total factor productivity and prices of inputs to capture these factors, while the minimum wage is introduced as an element that moves the curve off. We estimate a panel of 20 manufacturing branches over the 2012-2019 period with FE, IV and system-GMM estimators. We find that the role of the minimum wage for the labor share is industry-specific. For industrial branches which are labor-intensive and low-pay, it increases workers' labor share, along a complementarity between capital and labor. For capital-intensive branches, it reduces labor share, likely through the job loss channel and along a substitutability between labor and capital. This applies to both branches where foreign investment and he
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#27169;&#25311;&#20102;Covid-19&#22312;&#21271;&#39532;&#20854;&#39039;&#30340;&#36139;&#22256;&#24433;&#21709;&#65292;&#20998;&#26512;&#20102;&#19977;&#39033;&#25919;&#24220;&#25514;&#26045;&#30340;&#25910;&#20837;&#20445;&#25252;&#33021;&#21147;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#22914;&#26524;&#27809;&#26377;&#25919;&#24220;&#24178;&#39044;&#65292;&#23558;&#26377;12&#19975;&#20154;&#22240;&#30123;&#24773;&#38519;&#20837;&#36139;&#22256;&#65292;&#20854;&#20013;1.6&#19975;&#20154;&#23558;&#34987;&#25512;&#20837;&#36196;&#36139;&#12290;</title><link>http://arxiv.org/abs/2310.05114</link><description>&lt;p&gt;
Covid-19&#30123;&#24773;&#23545;&#21271;&#39532;&#20854;&#39039;&#36139;&#22256;&#30340;&#24433;&#21709;&#65306;&#21361;&#26426;&#21644;&#25919;&#24220;&#21453;&#24212;&#30340;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Poverty during Covid-19 in North Macedonia: Analysis of the distributional impact of the crisis and government response. (arXiv:2310.05114v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.05114
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#27169;&#25311;&#20102;Covid-19&#22312;&#21271;&#39532;&#20854;&#39039;&#30340;&#36139;&#22256;&#24433;&#21709;&#65292;&#20998;&#26512;&#20102;&#19977;&#39033;&#25919;&#24220;&#25514;&#26045;&#30340;&#25910;&#20837;&#20445;&#25252;&#33021;&#21147;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#22914;&#26524;&#27809;&#26377;&#25919;&#24220;&#24178;&#39044;&#65292;&#23558;&#26377;12&#19975;&#20154;&#22240;&#30123;&#24773;&#38519;&#20837;&#36139;&#22256;&#65292;&#20854;&#20013;1.6&#19975;&#20154;&#23558;&#34987;&#25512;&#20837;&#36196;&#36139;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#27169;&#25311;&#20102;Covid-19&#22312;&#21271;&#39532;&#20854;&#39039;&#30340;&#36139;&#22256;&#24433;&#21709;&#65292;&#24182;&#20998;&#26512;&#20102;&#19977;&#39033;&#20851;&#38190;&#25919;&#24220;&#25514;&#26045;&#30340;&#25910;&#20837;&#20445;&#25252;&#33021;&#21147;&#65306;&#23601;&#19994;&#20445;&#30041;&#35745;&#21010;&#12289;&#25918;&#23485;&#30340;&#20445;&#38556;&#26368;&#20302;&#25910;&#20837;&#25903;&#25345;&#21644;&#19968;&#27425;&#24615;&#29616;&#37329;&#27941;&#36148;&#12290;&#25105;&#20204;&#20351;&#29992;MK-MOD&#65292;&#21363;&#21271;&#39532;&#20854;&#39039;&#31246;&#25910;&#21644;&#31119;&#21033;&#24494;&#35266;&#27169;&#25311;&#27169;&#22411;&#65292;&#36890;&#36807;&#23558;2020&#24180;&#31532;&#20108;&#23395;&#24230;&#30340;&#23454;&#38469;&#25968;&#25454;&#32435;&#20837;&#32771;&#34385;&#65292;&#27169;&#25311;&#20102;&#21453;&#20107;&#23454;&#24773;&#26223;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#22914;&#26524;&#27809;&#26377;&#25919;&#24220;&#30340;&#24178;&#39044;&#65292;&#35813;&#22269;200&#19975;&#20844;&#27665;&#20013;&#20250;&#26377;&#39069;&#22806;&#30340;12&#19975;&#20154;&#22240;COVID-19&#32780;&#38519;&#20837;&#36139;&#22256;&#65292;&#20854;&#20013;34&#19975;&#20154;&#22312;&#30123;&#24773;&#20043;&#21069;&#23601;&#24050;&#32463;&#36139;&#22256;&#12290;&#20854;&#20013;&#65292;&#36825;12&#19975;&#20154;&#20013;&#32422;&#26377;1.6&#19975;&#20154;&#23558;&#34987;&#25512;&#20837;&#36196;&#36139;&#12290;&#25919;&#24220;&#30340;&#33258;&#21160;&#31283;&#23450;&#22120;&#36215;&#21040;&#20102;&#20445;&#25252;&#26368;&#36139;&#22256;&#20154;&#21475;&#30340;&#20316;&#29992;&#65292;&#23613;&#31649;&#36825;&#20123;&#25514;&#26045;&#26126;&#26174;&#20559;&#21521;&#22899;&#24615;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#20998;&#26512;&#30340;&#25919;&#24220;&#25514;&#26045;&#24674;&#22797;&#20102;&#36229;&#36807;&#19968;&#21322;&#30340;&#25910;&#20837;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper we simulate the poverty effect of the Covid-19 pandemic in North Macedonia and we analyze the income-saving power of three key government measures: the employment-retention scheme, the relaxed Guaranteed Minimum Income support, and one-off cash allowances. In this attempt, the counterfactual scenarios are simulated by using MK-MOD, the Macedonian Tax and Benefit Microsimulation Model, incorporating actual data on the shock-s magnitude from the second quarter of 2020. The results suggest that without the government interventions, of the country-s two million citizens, an additional 120,000 people would have been pushed into poverty by COVID-19, where 340,000 were already poor before the pandemic. Of the 120,000 newly poor about 16,000 would have been pushed into destitute poverty. The government-s automatic stabilizers worked to shield the poorest people, though these were clearly pro-feminine. In all, the analyzed government measures recovered more than half of the income
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#20272;&#35745;&#20102;Covid-19&#22823;&#27969;&#34892;&#23545;&#21271;&#39532;&#20854;&#39039;&#20799;&#31461;&#36139;&#22256;&#30340;&#39044;&#26399;&#24433;&#21709;&#12290;&#35843;&#26597;&#32467;&#26524;&#26174;&#31034;&#65292;&#30456;&#23545;&#20799;&#31461;&#36139;&#22256;&#29575;&#39044;&#35745;&#23558;&#22686;&#21152;&#12290;</title><link>http://arxiv.org/abs/2310.05110</link><description>&lt;p&gt;
Covid-19&#23545;&#21271;&#39532;&#20854;&#39039;&#20799;&#31461;&#36139;&#22256;&#30340;&#24433;&#21709;&#65306;&#22522;&#20110;&#27169;&#25311;&#30340;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
The impact of the pandemic of Covid-19 on child poverty in North Macedonia: Simulation-based estimates. (arXiv:2310.05110v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.05110
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20272;&#35745;&#20102;Covid-19&#22823;&#27969;&#34892;&#23545;&#21271;&#39532;&#20854;&#39039;&#20799;&#31461;&#36139;&#22256;&#30340;&#39044;&#26399;&#24433;&#21709;&#12290;&#35843;&#26597;&#32467;&#26524;&#26174;&#31034;&#65292;&#30456;&#23545;&#20799;&#31461;&#36139;&#22256;&#29575;&#39044;&#35745;&#23558;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30340;&#30446;&#26631;&#26159;&#20272;&#35745;Covid-19&#22823;&#27969;&#34892;&#23545;&#21271;&#39532;&#20854;&#39039;&#20799;&#31461;&#36139;&#22256;&#30340;&#39044;&#26399;&#24433;&#21709;&#12290;&#25105;&#20204;&#20381;&#36182;&#20110;&#22522;&#20110;2019&#24180;&#25910;&#20837;&#21644;&#29983;&#27963;&#26465;&#20214;&#35843;&#26597;&#30340;&#21271;&#39532;&#20854;&#39039;MK-MOD&#31246;&#25910;&#21644;&#31119;&#21033;&#24494;&#35266;&#27169;&#25311;&#27169;&#22411;&#12290;&#27169;&#25311;&#32771;&#34385;&#20102;&#25910;&#20837;&#30340;&#21457;&#23637;&#65292;&#26681;&#25454;2020&#24180;&#21069;&#19977;&#20010;&#23395;&#24230;&#30340;&#35266;&#23519;&#32467;&#26524;&#24471;&#20986;&#65292;&#35813;&#32467;&#26524;&#22522;&#20110;&#21171;&#21160;&#21147;&#35843;&#26597;&#65292;&#35813;&#35843;&#26597;&#32771;&#34385;&#20102;&#22823;&#27969;&#34892;&#30340;&#21407;&#22987;&#24433;&#21709;&#21644;&#25919;&#24220;&#30340;&#24212;&#23545;&#25514;&#26045;&#12290;&#22312;&#21271;&#39532;&#20854;&#39039;&#65292;&#20960;&#20046;&#27809;&#26377;&#38024;&#23545;&#20799;&#31461;&#25910;&#20837;&#30340;&#30452;&#25509;&#25919;&#24220;&#25514;&#26045;&#65292;&#28982;&#32780;&#65292;&#19977;&#39033;&#20851;&#38190;&#19988;&#26368;&#22823;&#30340;&#25514;&#26045;&#28041;&#21450;&#23478;&#24237;&#25910;&#20837;&#65306;&#26368;&#20005;&#37325;&#21463;&#25171;&#20987;&#20844;&#21496;&#27599;&#21517;&#24037;&#20154;&#30340;&#34917;&#36148;&#37329;14500&#39532;&#20854;&#39039;&#20195;&#32435;&#23572;&#65292;&#25918;&#23485;&#33719;&#24471;&#26368;&#20302;&#20445;&#35777;&#25910;&#20837;&#30340;&#26465;&#20214;&#65292;&#20197;&#21450;&#20004;&#20010;&#22330;&#21512;&#23545;&#24369;&#21183;&#32676;&#20307;&#30340;&#19968;&#27425;&#24615;&#25903;&#25345;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#30456;&#23545;&#20799;&#31461;&#36139;&#22256;&#29575;&#39044;&#35745;&#23558;&#20174;&#30123;&#24773;&#21069;&#30340;27.8&#65285;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;
The objective of this paper is to estimate the expected effects of the pandemic of Covid-19 for child poverty in North Macedonia. We rely on MK-MOD Tax &amp; Benefit Microsimulation Model for North Macedonia based on the Survey on Income and Living Conditions 2019. The simulation takes into account the development of income, as per the observed developments in the first three quarters of 2020, derived from the Labor Force Survey, which incorporates the raw effect of the pandemic and the government response. In North Macedonia, almost no government measure directly aimed the income of children, however, three key and largest measures addressed household income: the wage subsidy of 14.500 MKD per worker in the hardest hit companies, relaxation of the criteria for obtaining the guaranteed minimum income, and one-off support to vulnerable groups of the population in two occasions. Results suggest that the relative child poverty rate is estimated to increase from 27.8 percent before the pandemi
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#30740;&#31350;&#21152;&#23494;&#36135;&#24065;&#21644;&#32929;&#31080;&#24066;&#22330;&#30340;&#38543;&#26426;&#32467;&#26500;&#12289;&#25237;&#36164;&#32773;&#34892;&#20026;&#29305;&#24615;&#21644;&#20449;&#24687;&#25928;&#29575;&#31243;&#24230;&#65292;&#25552;&#20379;&#20102;&#19968;&#20010;&#32479;&#35745;&#22343;&#34913;&#30340;&#35266;&#28857;&#12290;</title><link>http://arxiv.org/abs/2310.04907</link><description>&lt;p&gt;
&#20449;&#24687;&#35770;&#35270;&#35282;&#19979;&#30340;&#32929;&#31080;&#19982;&#21152;&#23494;&#36135;&#24065;&#24066;&#22330;&#30740;&#31350;&#65306;&#32479;&#35745;&#22343;&#34913;&#30340;&#35266;&#28857;
&lt;/p&gt;
&lt;p&gt;
An Information Theory Approach to the Stock and Cryptocurrency Market: A Statistical Equilibrium Perspective. (arXiv:2310.04907v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04907
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#30740;&#31350;&#21152;&#23494;&#36135;&#24065;&#21644;&#32929;&#31080;&#24066;&#22330;&#30340;&#38543;&#26426;&#32467;&#26500;&#12289;&#25237;&#36164;&#32773;&#34892;&#20026;&#29305;&#24615;&#21644;&#20449;&#24687;&#25928;&#29575;&#31243;&#24230;&#65292;&#25552;&#20379;&#20102;&#19968;&#20010;&#32479;&#35745;&#22343;&#34913;&#30340;&#35266;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21152;&#23494;&#36135;&#24065;&#22238;&#25253;&#29575;&#19982;&#32929;&#31080;&#22238;&#25253;&#29575;&#20043;&#38388;&#30340;&#38543;&#26426;&#32467;&#26500;&#65292;&#37325;&#28857;&#20851;&#27880;&#30456;&#20851;&#27178;&#25130;&#38754;&#20998;&#24067;&#12290;&#25105;&#20204;&#26500;&#24314;&#20102;&#20004;&#20010;&#25968;&#25454;&#38598;&#65292;&#31532;&#19968;&#20010;&#21253;&#25324;&#22235;&#21313;&#20845;&#20010;&#20027;&#35201;&#21152;&#23494;&#36135;&#24065;&#65292;&#31532;&#20108;&#20010;&#21253;&#25324;&#26631;&#26222;500&#25351;&#25968;&#20013;&#25152;&#26377;&#19978;&#24066;&#20844;&#21496;&#12290;&#25105;&#20204;&#25910;&#38598;&#20102;&#20174;2017&#24180;1&#26376;&#21040;2022&#24180;12&#26376;&#30340;&#20010;&#20307;&#25968;&#25454;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#24212;&#29992;&#37327;&#21270;&#21709;&#24212;&#32479;&#35745;&#22343;&#34913;&#65288;QRSE&#65289;&#27169;&#22411;&#26469;&#24674;&#22797;&#21152;&#23494;&#36135;&#24065;&#21644;&#26631;&#26222;500&#20844;&#21496;&#30340;&#27599;&#26085;&#22238;&#25253;&#30340;&#27178;&#25130;&#38754;&#39057;&#29575;&#20998;&#24067;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#36825;&#20004;&#20010;&#24066;&#22330;&#30340;&#38543;&#26426;&#32467;&#26500;&#20197;&#21450;&#22312;&#29066;&#24066;&#21644;&#29275;&#24066;&#36235;&#21183;&#19979;&#25237;&#36164;&#32773;&#34892;&#20026;&#30340;&#29305;&#24615;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#27604;&#36739;&#20102;&#36825;&#20004;&#20010;&#24066;&#22330;&#30340;&#20449;&#24687;&#25928;&#29575;&#31243;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the stochastic structure of cryptocurrency rates of returns as compared to stock returns by focusing on the associated cross-sectional distributions. We build two datasets. The first comprises forty-six major cryptocurrencies, and the second includes all the companies listed in the S&amp;P 500. We collect individual data from January 2017 until December 2022. We then apply the Quantal Response Statistical Equilibrium (QRSE) model to recover the cross-sectional frequency distribution of the daily returns of cryptocurrencies and S&amp;P 500 companies. We study the stochastic structure of these two markets and the properties of investors' behavior over bear and bull trends. Finally, we compare the degree of informational efficiency of these two markets.
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#36890;&#36807;&#27604;&#36739;&#21315;&#31143;&#19968;&#20195;&#21644;Z&#19990;&#20195;&#30340;&#39550;&#29031;&#33719;&#24471;&#27169;&#24335;&#65292;&#21457;&#29616;&#39550;&#29031;&#39046;&#21462;&#29575;&#19979;&#38477;&#19968;&#37096;&#20998;&#21407;&#22240;&#26159;&#19990;&#20195;&#38388;&#24577;&#24230;&#21644;&#25991;&#21270;&#36716;&#21464;&#65292;&#25552;&#31034;&#35268;&#21010;&#32773;&#21644;&#20915;&#31574;&#32773;&#38656;&#35201;&#36866;&#24212;&#32654;&#22269;&#27773;&#36710;&#25991;&#21270;&#30340;&#28508;&#22312;&#21464;&#21270;&#12290;</title><link>http://arxiv.org/abs/2310.04906</link><description>&lt;p&gt;
Generation Z&#27604;&#21315;&#31143;&#19968;&#20195;&#26356;&#19981;&#20381;&#36182;&#20110;&#27773;&#36710;&#21527;&#65311;&#36890;&#36807;&#23545;&#38738;&#23569;&#24180;&#39550;&#29031;&#24773;&#20917;&#30340;&#20840;&#22269;&#20998;&#26512;&#26469;&#30475;&#24453;&#36825;&#20010;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Are Generation Z Less Car-centric Than Millennials? A Nationwide Analysis Through the Lens of Youth Licensing. (arXiv:2310.04906v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04906
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#36890;&#36807;&#27604;&#36739;&#21315;&#31143;&#19968;&#20195;&#21644;Z&#19990;&#20195;&#30340;&#39550;&#29031;&#33719;&#24471;&#27169;&#24335;&#65292;&#21457;&#29616;&#39550;&#29031;&#39046;&#21462;&#29575;&#19979;&#38477;&#19968;&#37096;&#20998;&#21407;&#22240;&#26159;&#19990;&#20195;&#38388;&#24577;&#24230;&#21644;&#25991;&#21270;&#36716;&#21464;&#65292;&#25552;&#31034;&#35268;&#21010;&#32773;&#21644;&#20915;&#31574;&#32773;&#38656;&#35201;&#36866;&#24212;&#32654;&#22269;&#27773;&#36710;&#25991;&#21270;&#30340;&#28508;&#22312;&#21464;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20851;&#20110;&#24180;&#36731;&#32654;&#22269;&#20154;&#26159;&#21542;&#36234;&#26469;&#36234;&#19981;&#20381;&#36182;&#20110;&#27773;&#36710;&#30340;&#20105;&#35770;&#20173;&#22312;&#36827;&#34892;&#20013;&#12290;&#36825;&#39033;&#30740;&#31350;&#27604;&#36739;&#20102;&#21315;&#31143;&#19968;&#20195;&#21644;&#19979;&#19968;&#20195;Z&#19990;&#20195;&#22312;&#26202;&#26399;&#38738;&#23569;&#24180;&#26102;&#26399;&#33719;&#24471;&#39550;&#29031;&#30340;&#27169;&#24335;&#65292;&#24182;&#30740;&#31350;&#20102;&#24433;&#21709;&#38738;&#23569;&#24180;&#20915;&#23450;&#33719;&#24471;&#39550;&#29031;&#30340;&#22240;&#32032;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#39550;&#29031;&#39046;&#21462;&#29575;&#19979;&#38477;&#21487;&#33021;&#37096;&#20998;&#24402;&#22240;&#20110;&#19990;&#20195;&#38388;&#24577;&#24230;&#21644;&#25991;&#21270;&#21464;&#21270;&#30340;&#36716;&#21464;&#65292;&#27604;&#22914;Z&#19990;&#20195;&#20542;&#21521;&#20110;&#25945;&#32946;&#24615;&#26053;&#34892;&#21644;&#25968;&#23383;&#21270;&#25104;&#38271;&#12290;&#36825;&#39033;&#30740;&#31350;&#31361;&#20986;&#20102;&#35268;&#21010;&#32773;&#12289;&#20174;&#19994;&#20154;&#21592;&#21644;&#20915;&#31574;&#32773;&#22312;&#36866;&#24212;&#32654;&#22269;&#27773;&#36710;&#25991;&#21270;&#28508;&#22312;&#36716;&#21464;&#26041;&#38754;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The debate on whether young Americans are becoming less reliant on automobiles is still ongoing. This research compares driver's license acquisition patterns between Millennials and their succeeding Generation Z during late adolescence. It also examines factors influencing teenagers' decisions to obtain driver's licenses. The findings suggest that the decline in licensing rates may be attributed in part to generational shifts in attitudes and cultural changes, such as Generation Z's inclination toward educational trips and their digital upbringing. This research underscores the implications for planners, practitioners, and policymakers in adapting to potential shifts in American car culture.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#24037;&#20154;&#35758;&#20215;&#23545;&#36716;&#22411;&#32463;&#27982;&#20307;&#21171;&#21160;&#20221;&#39069;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#36739;&#24378;&#30340;&#35758;&#20215;&#26435;&#21147;&#20250;&#25552;&#39640;&#21171;&#21160;&#20221;&#39069;&#65292;&#32780;&#36739;&#39640;&#30340;&#35758;&#20215;&#26435;&#21147;&#21017;&#20250;&#38477;&#20302;&#21171;&#21160;&#20221;&#39069;&#12290;</title><link>http://arxiv.org/abs/2310.04904</link><description>&lt;p&gt;
&#35758;&#20215;&#20320;&#30340;&#20221;&#39069;&#65306;&#35770;&#24037;&#20154;&#35758;&#20215;&#26435;&#23545;&#21171;&#21160;&#20221;&#39069;&#30340;&#20316;&#29992;&#65292;&#20197;&#36716;&#22411;&#32463;&#27982;&#20307;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
Bargain your share: The role of workers bargaining power for labor share, with reference to transition economies. (arXiv:2310.04904v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04904
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24037;&#20154;&#35758;&#20215;&#23545;&#36716;&#22411;&#32463;&#27982;&#20307;&#21171;&#21160;&#20221;&#39069;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#36739;&#24378;&#30340;&#35758;&#20215;&#26435;&#21147;&#20250;&#25552;&#39640;&#21171;&#21160;&#20221;&#39069;&#65292;&#32780;&#36739;&#39640;&#30340;&#35758;&#20215;&#26435;&#21147;&#21017;&#20250;&#38477;&#20302;&#21171;&#21160;&#20221;&#39069;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26088;&#22312;&#29702;&#35299;&#24037;&#20154;&#35758;&#20215;&#23545;&#36716;&#22411;&#32463;&#27982;&#20307;&#21171;&#21160;&#20221;&#39069;&#30340;&#20316;&#29992;&#12290;&#25105;&#20204;&#20351;&#29992;&#32929;&#20221;-&#36164;&#26412;&#35843;&#24230;&#34920;&#26469;&#34920;&#31034;&#24037;&#20154;&#35758;&#20215;&#26435;&#21147;&#30340;&#21464;&#21160;&#12290;&#23450;&#37327;&#30340;&#35758;&#20215;&#26435;&#25351;&#26631;&#19982;&#25551;&#36848;&#27599;&#20010;&#22269;&#23478;&#35848;&#21028;&#27861;&#24459;&#29615;&#22659;&#30340;&#25991;&#26412;&#20449;&#24687;&#26500;&#24314;&#30340;&#23450;&#24615;&#25351;&#26631;&#30456;&#32467;&#21512;&#12290;&#30001;&#20110;&#22810;&#20010;&#25968;&#25454;&#38480;&#21046;&#65292;&#25105;&#20204;&#37319;&#29992;&#36825;&#20123;&#23450;&#24615;&#25351;&#26631;&#20272;&#35745;&#20102;&#36328;&#37096;&#38376;&#30340;&#32463;&#39564;&#27169;&#22411;&#65292;&#24182;&#20351;&#29992;&#21069;&#24037;&#20250;&#21270;&#29575;&#21644;&#36890;&#36807;&#22269;&#38469;&#21171;&#24037;&#32452;&#32455;&#38598;&#20307;&#35848;&#21028;&#20844;&#32422;&#30340;&#39041;&#24067;&#26102;&#38388;&#20316;&#20026;&#22806;&#29983;&#24037;&#20855;&#12290;&#26679;&#26412;&#21253;&#25324;69&#20010;&#22269;&#23478;&#20013;&#30340;23&#20010;&#24037;&#19994;&#37096;&#38376;&#65292;&#20854;&#20013;&#21253;&#25324;28&#20010;&#36716;&#22411;&#22269;&#23478;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#21457;&#29616;&#36739;&#24378;&#30340;&#35758;&#20215;&#26435;&#21147;&#23545;&#21171;&#21160;&#20221;&#39069;&#26377;&#31215;&#26497;&#30340;&#24433;&#21709;&#65292;&#19981;&#35770;&#26159;&#23450;&#37327;&#36824;&#26159;&#23450;&#24615;&#30340;&#25351;&#26631;&#12290;&#32780;&#30456;&#21453;&#65292;&#36739;&#39640;&#30340;&#35758;&#20215;&#26435;&#21147;&#20250;&#23548;&#33268;&#36739;&#20302;&#30340;&#21171;&#21160;&#20221;&#39069;&#12290;
&lt;/p&gt;
&lt;p&gt;
The objective of the paper is to understand the role of workers bargaining for the labor share in transition economies. We rely on a share-capital schedule, whereby workers bargaining power is represented as a move off the schedule. Quantitative indicators of bargaining power are amended with own-constructed qualitative indices from textual information describing the legal enabling environment for bargaining in each country. Multiple data constraints impose reliance on a cross-sectional empirical model estimated with IV methods, whereby former unionization rates and the time since the adoption of the ILO Collective Bargaining Convention are used as exogenous instruments. The sample is composed of 23 industrial branches in 69 countries, of which 28 transition ones. In general, we find the stronger bargaining power to influence higher labor share, when the former is measured either quantitatively or qualitatively. On the contrary, higher bargaining power results in lower labor share in t
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#38024;&#23545;&#37329;&#34701;&#29615;&#22659;&#19979;&#24320;&#28304;&#35821;&#35328;&#27169;&#22411;&#30340;&#25351;&#20196;&#35843;&#20248;&#26041;&#27861;&#65292;&#24182;&#25552;&#20986;&#20102;&#31471;&#21040;&#31471;&#35757;&#32451;&#21644;&#27979;&#35797;&#30340;&#22522;&#20934;&#27979;&#35797;&#26041;&#26696;&#65292;&#20197;&#21152;&#24378;&#27169;&#22411;&#22312;&#37329;&#34701;&#25968;&#25454;&#38598;&#19978;&#30340;&#19987;&#19994;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2310.04793</link><description>&lt;p&gt;
FinGPT: &#22312;&#37329;&#34701;&#25968;&#25454;&#38598;&#20013;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#30340;&#25351;&#20196;&#35843;&#20248;&#22522;&#20934;&#27979;&#35797;
&lt;/p&gt;
&lt;p&gt;
FinGPT: Instruction Tuning Benchmark for Open-Source Large Language Models in Financial Datasets. (arXiv:2310.04793v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04793
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#38024;&#23545;&#37329;&#34701;&#29615;&#22659;&#19979;&#24320;&#28304;&#35821;&#35328;&#27169;&#22411;&#30340;&#25351;&#20196;&#35843;&#20248;&#26041;&#27861;&#65292;&#24182;&#25552;&#20986;&#20102;&#31471;&#21040;&#31471;&#35757;&#32451;&#21644;&#27979;&#35797;&#30340;&#22522;&#20934;&#27979;&#35797;&#26041;&#26696;&#65292;&#20197;&#21152;&#24378;&#27169;&#22411;&#22312;&#37329;&#34701;&#25968;&#25454;&#38598;&#19978;&#30340;&#19987;&#19994;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#39046;&#22495;&#36805;&#36895;&#25193;&#23637;&#30340;&#32972;&#26223;&#19979;&#65292;GPT&#27169;&#22411;&#22312;&#37329;&#34701;&#39046;&#22495;&#30340;&#28508;&#21147;&#26085;&#30410;&#26126;&#26174;&#12290;&#28982;&#32780;&#65292;&#23558;&#36825;&#20123;&#27169;&#22411;&#19982;&#37329;&#34701;&#25968;&#25454;&#38598;&#38598;&#25104;&#22312;&#19968;&#36215;&#23384;&#22312;&#25361;&#25112;&#65292;&#29305;&#21035;&#26159;&#22312;&#30830;&#23450;&#20854;&#29087;&#32451;&#31243;&#24230;&#21644;&#30456;&#20851;&#24615;&#26041;&#38754;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#25351;&#20196;&#35843;&#20248;&#33539;&#24335;&#30340;&#29420;&#29305;&#26041;&#27861;&#65292;&#19987;&#38376;&#29992;&#20110;&#37329;&#34701;&#29615;&#22659;&#19979;&#30340;&#24320;&#28304;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#12290;&#36890;&#36807;&#36825;&#31181;&#26041;&#27861;&#65292;&#25105;&#20204;&#21033;&#29992;&#24320;&#28304;&#27169;&#22411;&#30340;&#20114;&#25805;&#20316;&#24615;&#65292;&#30830;&#20445;&#20102;&#26080;&#32541;&#36879;&#26126;&#30340;&#38598;&#25104;&#12290;&#25105;&#20204;&#39318;&#20808;&#35299;&#37322;&#20102;&#25351;&#20196;&#35843;&#20248;&#33539;&#24335;&#65292;&#24182;&#24378;&#35843;&#20854;&#23545;&#20110;&#31435;&#21363;&#38598;&#25104;&#30340;&#26377;&#25928;&#24615;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#29992;&#20110;&#31471;&#21040;&#31471;&#35757;&#32451;&#21644;&#27979;&#35797;&#30340;&#22522;&#20934;&#27979;&#35797;&#26041;&#26696;&#65292;&#37319;&#29992;&#25104;&#26412;&#25928;&#30410;&#30340;&#36880;&#27493;&#25512;&#36827;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35780;&#20272;&#20102;&#22522;&#26412;&#30340;&#33021;&#21147;&#21644;&#22522;&#30784;&#20219;&#21153;&#65292;&#27604;&#22914;&#21629;&#21517;&#23454;&#20307;&#35782;&#21035;&#65288;NER&#65289;&#21644;&#24773;&#24863;&#20998;&#26512;&#65292;&#20197;&#22686;&#24378;&#19987;&#19994;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the swiftly expanding domain of Natural Language Processing (NLP), the potential of GPT-based models for the financial sector is increasingly evident. However, the integration of these models with financial datasets presents challenges, notably in determining their adeptness and relevance. This paper introduces a distinctive approach anchored in the Instruction Tuning paradigm for open-source large language models, specifically adapted for financial contexts. Through this methodology, we capitalize on the interoperability of open-source models, ensuring a seamless and transparent integration. We begin by explaining the Instruction Tuning paradigm, highlighting its effectiveness for immediate integration. The paper presents a benchmarking scheme designed for end-to-end training and testing, employing a cost-effective progression. Firstly, we assess basic competencies and fundamental tasks, such as Named Entity Recognition (NER) and sentiment analysis to enhance specialization. Next, 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#22635;&#34917;&#20102;&#32593;&#32476;&#20445;&#38505;&#39118;&#38505;&#30740;&#31350;&#20013;&#30340;&#37325;&#35201;&#24046;&#36317;&#65292;&#36890;&#36807;&#21033;&#29992;&#32654;&#22269;&#24030;&#24635;&#26816;&#23519;&#38271;&#25552;&#20379;&#30340;&#19968;&#32452;&#20844;&#20849;&#25968;&#25454;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#32593;&#32476;&#20445;&#38505;&#39118;&#38505;&#30495;&#23454;&#35268;&#27169;&#30340;&#26032;&#35265;&#35299;&#12290;</title><link>http://arxiv.org/abs/2310.04786</link><description>&lt;p&gt;
&#32593;&#32476;&#20445;&#38505;&#39118;&#38505;&#65306;&#25253;&#21578;&#24310;&#36831;&#65292;&#31532;&#19977;&#26041;&#32593;&#32476;&#20107;&#20214;&#21644;&#25253;&#21578;&#24847;&#24895;&#21464;&#21270;&#8212;&#8212;&#20351;&#29992;&#30001;&#32654;&#22269;&#24030;&#24635;&#26816;&#23519;&#38271;&#21457;&#24067;&#30340;&#25968;&#25454;&#27844;&#38706;&#36827;&#34892;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Cyber Insurance Risk: Reporting Delays, Third-Party Cyber Events, and Changes in Reporting Propensity -- An Analysis Using Data Breaches Published by U.S. State Attorneys General. (arXiv:2310.04786v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04786
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22635;&#34917;&#20102;&#32593;&#32476;&#20445;&#38505;&#39118;&#38505;&#30740;&#31350;&#20013;&#30340;&#37325;&#35201;&#24046;&#36317;&#65292;&#36890;&#36807;&#21033;&#29992;&#32654;&#22269;&#24030;&#24635;&#26816;&#23519;&#38271;&#25552;&#20379;&#30340;&#19968;&#32452;&#20844;&#20849;&#25968;&#25454;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#32593;&#32476;&#20445;&#38505;&#39118;&#38505;&#30495;&#23454;&#35268;&#27169;&#30340;&#26032;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#32593;&#32476;&#23041;&#32961;&#30340;&#22686;&#21152;&#65292;&#32593;&#32476;&#20445;&#38505;&#23545;&#20225;&#19994;&#32780;&#35328;&#21464;&#24471;&#36234;&#26469;&#36234;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#30446;&#21069;&#23545;&#32593;&#32476;&#20445;&#38505;&#39118;&#38505;&#30340;&#30740;&#31350;&#21463;&#21040;&#20102;&#25968;&#25454;&#30340;&#26222;&#36941;&#32570;&#20047;&#20197;&#21450;&#21487;&#20844;&#24320;&#33719;&#21462;&#30340;&#26377;&#38480;&#25968;&#25454;&#30340;&#38480;&#21046;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#23545;&#32593;&#32476;&#20445;&#38505;&#27169;&#22411;&#30340;&#38480;&#21046;&#21253;&#25324;&#65306;&#65288;i&#65289;&#25253;&#21578;&#24310;&#36831;&#30340;&#20449;&#24687;&#32570;&#20047;&#65292;&#65288;ii&#65289;&#25152;&#26377;&#21463;&#31532;&#19977;&#26041;&#20107;&#20214;&#24433;&#21709;&#30340;&#20225;&#19994;&#30340;&#20449;&#24687;&#32570;&#20047;&#65292;&#20197;&#21450;&#65288;iii&#65289;&#25253;&#21578;&#24847;&#24895;&#30340;&#21464;&#21270;&#12290;&#26412;&#25991;&#36890;&#36807;&#21033;&#29992;&#32654;&#22269;&#24030;&#24635;&#26816;&#23519;&#38271;&#25552;&#20379;&#30340;&#19968;&#32452;&#26410;&#34987;&#20805;&#20998;&#35748;&#21487;&#30340;&#20844;&#20849;&#25968;&#25454;&#26469;&#22635;&#34917;&#36825;&#19968;&#37325;&#35201;&#24046;&#36317;&#65292;&#24182;&#20026;&#32593;&#32476;&#20445;&#38505;&#39118;&#38505;&#30340;&#30495;&#23454;&#35268;&#27169;&#25552;&#20379;&#26032;&#30340;&#35265;&#35299;&#12290;&#36825;&#20123;&#25968;&#25454;&#26159;&#22522;&#20110;&#25968;&#25454;&#27844;&#38706;&#30340;&#24378;&#21046;&#25253;&#21578;&#35201;&#27714;&#25910;&#38598;&#30340;&#65292;&#24182;&#21253;&#21547;&#22823;&#37327;&#35814;&#32454;&#20449;&#24687;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#24191;&#27867;&#35752;&#35770;&#20102;&#25105;&#20204;&#30340;&#21457;&#29616;&#23545;&#32593;&#32476;&#20445;&#38505;&#23450;&#20215;&#12289;&#20648;&#22791;&#12289;&#25215;&#20445;&#21644;&#32463;&#39564;&#30340;&#30456;&#20851;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
With the rise of cyber threats, cyber insurance is becoming an important consideration for businesses. However, research on cyber insurance risk has so far been hindered by the general lack of data, as well as limitations underlying what limited data are available publicly. Specifically and of particular importance to cyber insurance modelling, limitations arising from lack of information regarding (i) delays in reporting, (ii) all businesses affected by third-party events, and (iii) changes in reporting propensity. In this paper, we fill this important gap by utilising an underrecognised set of public data provided by U.S. state Attorneys General, and provide new insights on the true scale of cyber insurance risk. These data are collected based on mandatory reporting requirements of data breaches, and contain substantial and detailed information. We further discuss extensively the associated implications of our findings for cyber insurance pricing, reserving, underwriting, and experie
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#24341;&#20837;&#39044;&#27979;&#37329;&#34701;&#20307;&#21046;&#30340;&#26032;&#26041;&#27861;&#65292;&#25913;&#36827;&#20102;&#25237;&#36164;&#32452;&#21512;&#30340;&#32489;&#25928;&#65292;&#24182;&#19982;&#20256;&#32479;&#37329;&#34701;&#20307;&#21046;&#39044;&#27979;&#27169;&#22411;&#21644;&#36866;&#24403;&#25351;&#25968;&#22522;&#20934;&#36827;&#34892;&#20102;&#23545;&#27604;&#12290;</title><link>http://arxiv.org/abs/2310.04536</link><description>&lt;p&gt;
&#36890;&#36807;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#39044;&#27979;&#37329;&#34701;&#20307;&#21046;&#25913;&#36827;&#25237;&#36164;&#32452;&#21512;&#32489;&#25928;
&lt;/p&gt;
&lt;p&gt;
Improving Portfolio Performance Using a Novel Method for Predicting Financial Regimes. (arXiv:2310.04536v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04536
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#24341;&#20837;&#39044;&#27979;&#37329;&#34701;&#20307;&#21046;&#30340;&#26032;&#26041;&#27861;&#65292;&#25913;&#36827;&#20102;&#25237;&#36164;&#32452;&#21512;&#30340;&#32489;&#25928;&#65292;&#24182;&#19982;&#20256;&#32479;&#37329;&#34701;&#20307;&#21046;&#39044;&#27979;&#27169;&#22411;&#21644;&#36866;&#24403;&#25351;&#25968;&#22522;&#20934;&#36827;&#34892;&#20102;&#23545;&#27604;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22312;&#20043;&#21069;&#30740;&#31350;&#30340;&#20307;&#21046;&#26816;&#27979;&#22522;&#30784;&#19978;&#36827;&#34892;&#25193;&#23637;&#65292;&#23558;&#20307;&#21046;&#30340;&#39044;&#27979;&#24341;&#20837;&#21040;&#20132;&#26131;&#39044;&#27979;&#20013;&#65292;&#20174;&#32780;&#22312;&#32771;&#34385;&#30340;&#19977;&#20010;&#36164;&#20135;&#31867;&#21035;&#65288;&#32929;&#31080;&#12289;&#21830;&#21697;&#21644;&#22806;&#27719;&#65289;&#19978;&#23454;&#29616;&#20102;&#22823;&#24133;&#24230;&#30340;&#32489;&#25928;&#25913;&#36827;&#65292;&#22312;&#22235;&#24180;&#30340;&#27979;&#35797;&#26399;&#38388;&#12290;&#25152;&#25552;&#20986;&#30340;&#26032;&#27169;&#22411;&#36824;&#19982;&#24403;&#21069;&#26368;&#27969;&#34892;&#30340;&#37329;&#34701;&#20307;&#21046;&#39044;&#27979;&#27169;&#22411;&#8212;&#8212;&#38544;&#39532;&#23572;&#21487;&#22827;&#27169;&#22411;&#20197;&#21450;&#27599;&#20010;&#36164;&#20135;&#31867;&#21035;&#30340;&#36866;&#24403;&#25351;&#25968;&#22522;&#20934;&#36827;&#34892;&#20102;&#23545;&#27604;&#12290;&#38656;&#35201;&#27880;&#24847;&#30340;&#26159;&#65292;&#25152;&#25552;&#20986;&#30340;&#27169;&#22411;&#37319;&#29992;&#20102;&#37329;&#34701;&#34892;&#19994;&#20013;&#24120;&#35265;&#20294;&#22312;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#20013;&#30456;&#23545;&#36739;&#23569;&#25506;&#32034;&#30340;&#8220;&#36870;&#21521;&#20132;&#26131;&#8221;&#31574;&#30053;&#12290;&#35813;&#27169;&#22411;&#36824;&#37319;&#29992;&#20102;&#39057;&#32321;&#30340;&#31354;&#22836;&#22836;&#23544;&#65292;&#36825;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#24182;&#19981;&#24635;&#26159;&#29702;&#24819;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
This work extends a previous work in regime detection, which allowed trading positions to be profitably adjusted when a new regime was detected, to ex ante prediction of regimes, leading to substantial performance improvements over the earlier model, over all three asset classes considered (equities, commodities, and foreign exchange), over a test period of four years. The proposed new model is also benchmarked over this same period against a hidden Markov model, the most popular current model for financial regime prediction, and against an appropriate index benchmark for each asset class, in the case of the commodities model having a test period cost-adjusted cumulative return over four times higher than that expected from the index. Notably, the proposed model makes use of a contrarian trading strategy, not uncommon in the financial industry but relatively unexplored in machine learning models. The model also makes use of frequent short positions, something not always desirable to in
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22312;&#21387;&#21147;&#27979;&#35797;&#20013;&#24212;&#29992;&#26080;&#30417;&#30563;&#23398;&#20064;&#30340;&#38477;&#32500;&#25216;&#26415;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20027;&#25104;&#20998;&#20998;&#26512;&#21644;&#33258;&#32534;&#30721;&#22120;&#25193;&#23637;&#20102;&#39118;&#38505;&#22240;&#32032;&#30340;&#33539;&#22260;&#65292;&#24182;&#25552;&#20379;&#20102;&#28508;&#22312;&#22240;&#23376;&#30340;&#35299;&#37322;&#12290;&#36825;&#31181;&#26041;&#27861;&#23545;&#20110;&#20854;&#20182;&#38656;&#35201;&#38477;&#32500;&#21644;&#21487;&#35299;&#37322;&#24615;&#30340;&#39046;&#22495;&#20063;&#26377;&#29992;&#22788;&#12290;</title><link>http://arxiv.org/abs/2310.04511</link><description>&lt;p&gt;
&#39118;&#38505;&#22240;&#32032;&#32858;&#21512;&#21644;&#21387;&#21147;&#27979;&#35797;
&lt;/p&gt;
&lt;p&gt;
Risk factor aggregation and stress testing. (arXiv:2310.04511v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04511
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22312;&#21387;&#21147;&#27979;&#35797;&#20013;&#24212;&#29992;&#26080;&#30417;&#30563;&#23398;&#20064;&#30340;&#38477;&#32500;&#25216;&#26415;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20027;&#25104;&#20998;&#20998;&#26512;&#21644;&#33258;&#32534;&#30721;&#22120;&#25193;&#23637;&#20102;&#39118;&#38505;&#22240;&#32032;&#30340;&#33539;&#22260;&#65292;&#24182;&#25552;&#20379;&#20102;&#28508;&#22312;&#22240;&#23376;&#30340;&#35299;&#37322;&#12290;&#36825;&#31181;&#26041;&#27861;&#23545;&#20110;&#20854;&#20182;&#38656;&#35201;&#38477;&#32500;&#21644;&#21487;&#35299;&#37322;&#24615;&#30340;&#39046;&#22495;&#20063;&#26377;&#29992;&#22788;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21387;&#21147;&#27979;&#35797;&#26159;&#23558;&#19981;&#21033;&#30340;&#37329;&#34701;&#25110;&#23439;&#35266;&#32463;&#27982;&#24773;&#26223;&#24212;&#29992;&#20110;&#25237;&#36164;&#32452;&#21512;&#12290;&#20026;&#27492;&#65292;&#36890;&#36807;&#22240;&#23376;&#27169;&#22411;&#36890;&#24120;&#23558;&#37329;&#34701;&#25110;&#23439;&#35266;&#32463;&#27982;&#39118;&#38505;&#22240;&#32032;&#19982;&#36164;&#20135;&#25910;&#30410;&#30456;&#20851;&#32852;&#12290;&#25105;&#20204;&#36890;&#36807;&#20174;&#26080;&#30417;&#30563;&#23398;&#20064;&#20013;&#37319;&#29992;&#38477;&#32500;&#25216;&#26415;&#65292;&#21363;&#20027;&#25104;&#20998;&#20998;&#26512;&#21644;&#33258;&#32534;&#30721;&#22120;&#65292;&#25193;&#23637;&#20102;&#39118;&#38505;&#22240;&#32032;&#30340;&#33539;&#22260;&#12290;&#36825;&#23548;&#33268;&#20102;&#32858;&#21512;&#30340;&#39118;&#38505;&#22240;&#32032;&#65292;&#21253;&#25324;&#20840;&#29699;&#22240;&#23376;&#12289;&#20195;&#34920;&#24191;&#27867;&#22320;&#29702;&#21306;&#22495;&#30340;&#22240;&#23376;&#20197;&#21450;&#20195;&#34920;&#21608;&#26399;&#24615;&#21644;&#38450;&#24481;&#24615;&#34892;&#19994;&#30340;&#22240;&#23376;&#12290;&#30001;&#20110;&#36866;&#24212;&#30340;&#20027;&#25104;&#20998;&#20998;&#26512;&#21644;&#33258;&#32534;&#30721;&#22120;&#23545;&#28508;&#22312;&#22240;&#23376;&#36827;&#34892;&#20102;&#35299;&#37322;&#65292;&#22240;&#27492;&#35813;&#26041;&#27861;&#22312;&#20854;&#20182;&#38656;&#35201;&#38477;&#32500;&#21644;&#21487;&#35299;&#37322;&#24615;&#30340;&#39046;&#22495;&#20063;&#20855;&#26377;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
Stress testing refers to the application of adverse financial or macroeconomic scenarios to a portfolio. For this purpose, financial or macroeconomic risk factors are linked with asset returns, typically via a factor model. We expand the range of risk factors by adapting dimension-reduction techniques from unsupervised learning, namely PCA and autoencoders. This results in aggregated risk factors, encompassing a global factor, factors representing broad geographical regions, and factors specific to cyclical and defensive industries. As the adapted PCA and autoencoders provide an interpretation of the latent factors, this methodology is also valuable in other areas where dimension-reduction and explainability are crucial.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#23558;&#20998;&#25968;&#38454;Black-Scholes Merton&#19982;&#31070;&#32463;&#32593;&#32476;&#32467;&#21512;&#30340;&#26032;&#22411;&#26399;&#26435;&#23450;&#20215;&#27169;&#22411;&#65288;FOBSM&#65289;&#65292;&#36890;&#36807;&#32771;&#34385;&#20998;&#25968;&#38454;&#23548;&#25968;&#21644;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#36827;&#34892;&#22797;&#26434;&#25193;&#25955;&#21160;&#21147;&#23398;&#24314;&#27169;&#65292;&#25552;&#39640;&#20102;&#26399;&#26435;&#23450;&#20215;&#30340;&#20934;&#30830;&#24615;&#21644;&#30495;&#23454;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.04464</link><description>&lt;p&gt;
&#23558;&#20998;&#25968;&#38454;Black-Scholes Merton&#19982;&#31070;&#32463;&#32593;&#32476;&#30456;&#32467;&#21512;&#30340;&#38598;&#25104;
&lt;/p&gt;
&lt;p&gt;
Integration of Fractional Order Black-Scholes Merton with Neural Network. (arXiv:2310.04464v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04464
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#23558;&#20998;&#25968;&#38454;Black-Scholes Merton&#19982;&#31070;&#32463;&#32593;&#32476;&#32467;&#21512;&#30340;&#26032;&#22411;&#26399;&#26435;&#23450;&#20215;&#27169;&#22411;&#65288;FOBSM&#65289;&#65292;&#36890;&#36807;&#32771;&#34385;&#20998;&#25968;&#38454;&#23548;&#25968;&#21644;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#36827;&#34892;&#22797;&#26434;&#25193;&#25955;&#21160;&#21147;&#23398;&#24314;&#27169;&#65292;&#25552;&#39640;&#20102;&#26399;&#26435;&#23450;&#20215;&#30340;&#20934;&#30830;&#24615;&#21644;&#30495;&#23454;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#25552;&#20986;&#22522;&#20110;Black-Scholes Merton&#65288;BSM&#65289;&#27169;&#22411;&#30340;&#29420;&#29305;&#23450;&#20215;&#27169;&#22411;&#8212;&#8212;&#20998;&#25968;&#38454;Black-Scholes-Merton&#65288;FOBSM&#65289;&#65292;&#22686;&#24378;&#20102;&#26399;&#26435;&#23450;&#20215;&#12290;&#20027;&#35201;&#30446;&#26631;&#26159;&#25552;&#39640;&#26399;&#26435;&#23450;&#20215;&#30340;&#31934;&#30830;&#24615;&#21644;&#30495;&#23454;&#24615;&#65292;&#20351;&#20854;&#26356;&#21152;&#36148;&#21512;&#37329;&#34701;&#26223;&#35266;&#12290;&#35813;&#26041;&#27861;&#23558;BSM&#21644;&#31070;&#32463;&#32593;&#32476;&#65288;NN&#65289;&#30340;&#20248;&#21183;&#19982;&#22797;&#26434;&#30340;&#25193;&#25955;&#21160;&#21147;&#23398;&#30456;&#32467;&#21512;&#12290;&#26412;&#30740;&#31350;&#24378;&#35843;&#22312;&#20998;&#26512;&#37329;&#34701;&#24066;&#22330;&#21160;&#24577;&#26102;&#38656;&#35201;&#32771;&#34385;&#20998;&#25968;&#38454;&#23548;&#25968;&#12290;&#30001;&#20110;FOBSM&#33021;&#22815;&#25429;&#25417;&#24207;&#21015;&#25968;&#25454;&#20013;&#30340;&#35760;&#24518;&#29305;&#24615;&#65292;&#30456;&#27604;&#25972;&#25968;&#38454;&#27169;&#22411;&#65292;&#23427;&#26356;&#36866;&#21512;&#27169;&#25311;&#23454;&#38469;&#31995;&#32479;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#22797;&#26434;&#30340;&#25193;&#25955;&#21160;&#21147;&#23398;&#20013;&#65292;&#36825;&#31181;&#23558;&#20998;&#25968;&#38454;Black-Scholes-Merton&#19982;&#31070;&#32463;&#32593;&#32476;&#30456;&#32467;&#21512;&#30340;&#26399;&#26435;&#23450;&#20215;&#26041;&#27861;&#25552;&#39640;&#20102;&#20215;&#26684;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#12290;&#26412;&#30740;&#31350;&#30340;&#20027;&#35201;&#36129;&#29486;&#22312;&#20110;&#21457;&#23637;&#20102;&#19968;&#31181;&#21033;&#29992;&#20998;&#25968;&#38454;&#24494;&#31215;&#20998;&#21644;&#31070;&#32463;&#32593;&#32476;&#25552;&#39640;&#20934;&#30830;&#24615;&#30340;&#26032;&#22411;&#26399;&#26435;&#23450;&#20215;&#27169;&#22411;&#65288;FOBSM&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study enhances option pricing by presenting unique pricing model fractional order Black-Scholes-Merton (FOBSM) which is based on the Black-Scholes-Merton (BSM) model. The main goal is to improve the precision and authenticity of option pricing, matching them more closely with the financial landscape. The approach integrates the strengths of both the BSM and neural network (NN) with complex diffusion dynamics. This study emphasizes the need to take fractional derivatives into account when analyzing financial market dynamics. Since FOBSM captures memory characteristics in sequential data, it is better at simulating real-world systems than integer-order models. Findings reveals that in complex diffusion dynamics, this hybridization approach in option pricing improves the accuracy of price predictions. the key contribution of this work lies in the development of a novel option pricing model (FOBSM) that leverages fractional calculus and neural networks to enhance accuracy in capturing
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#23545;&#30005;&#21147;&#26085;&#20869;&#20215;&#26684;&#27010;&#29575;&#36827;&#34892;&#39044;&#27979;&#30340;&#26032;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36890;&#36807;&#23398;&#20064;&#25968;&#25454;&#20013;&#30340;&#32463;&#39564;&#20998;&#24067;&#36873;&#25321;&#26368;&#20339;&#20998;&#24067;&#65292;&#24182;&#21033;&#29992;&#20998;&#24067;&#31070;&#32463;&#32593;&#32476;&#23398;&#20064;&#22797;&#26434;&#27169;&#24335;&#65292;&#20248;&#20110;&#29616;&#26377;&#30340;&#22522;&#20934;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2310.02867</link><description>&lt;p&gt;
&#23398;&#20064;&#30005;&#21147;&#26085;&#20869;&#20215;&#26684;&#27010;&#29575;&#20998;&#24067;
&lt;/p&gt;
&lt;p&gt;
Learning Probability Distributions of Intraday Electricity Prices. (arXiv:2310.02867v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.02867
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#23545;&#30005;&#21147;&#26085;&#20869;&#20215;&#26684;&#27010;&#29575;&#36827;&#34892;&#39044;&#27979;&#30340;&#26032;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36890;&#36807;&#23398;&#20064;&#25968;&#25454;&#20013;&#30340;&#32463;&#39564;&#20998;&#24067;&#36873;&#25321;&#26368;&#20339;&#20998;&#24067;&#65292;&#24182;&#21033;&#29992;&#20998;&#24067;&#31070;&#32463;&#32593;&#32476;&#23398;&#20064;&#22797;&#26434;&#27169;&#24335;&#65292;&#20248;&#20110;&#29616;&#26377;&#30340;&#22522;&#20934;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#23545;&#23567;&#26102;&#32423;&#30005;&#21147;&#26085;&#20869;&#20215;&#26684;&#36827;&#34892;&#27010;&#29575;&#39044;&#27979;&#12290;&#19982;&#26368;&#36817;&#22312;&#25968;&#25454;&#20016;&#23500;&#30340;&#27010;&#29575;&#39044;&#27979;&#26041;&#38754;&#30340;&#36827;&#23637;&#19981;&#21516;&#65292;&#35813;&#26041;&#27861;&#26159;&#38750;&#21442;&#25968;&#30340;&#65292;&#24182;&#20174;&#25968;&#25454;&#20013;&#23398;&#20064;&#21040;&#25152;&#26377;&#21487;&#33021;&#30340;&#32463;&#39564;&#20998;&#24067;&#20013;&#36873;&#25321;&#26368;&#20339;&#20998;&#24067;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#27169;&#22411;&#26159;&#19968;&#31181;&#20855;&#26377;&#21333;&#35843;&#35843;&#25972;&#24809;&#32602;&#30340;&#22810;&#36755;&#20986;&#31070;&#32463;&#32593;&#32476;&#12290;&#36825;&#26679;&#30340;&#20998;&#24067;&#31070;&#32463;&#32593;&#32476;&#21487;&#20197;&#20174;&#25968;&#25454;&#20016;&#23500;&#30340;&#29615;&#22659;&#20013;&#23398;&#20064;&#21040;&#30005;&#21147;&#20215;&#26684;&#30340;&#22797;&#26434;&#27169;&#24335;&#65292;&#24182;&#19988;&#20248;&#20110;&#26368;&#20808;&#36827;&#30340;&#22522;&#20934;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a novel machine learning approach to probabilistic forecasting of hourly intraday electricity prices. In contrast to recent advances in data-rich probabilistic forecasting that approximate the distributions with some features such as moments, our method is non-parametric and selects the best distribution from all possible empirical distributions learned from the data. The model we propose is a multiple output neural network with a monotonicity adjusting penalty. Such a distributional neural network can learn complex patterns in electricity prices from data-rich environments and it outperforms state-of-the-art benchmarks.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#23545;&#20302;&#22320;&#29699;&#36712;&#36947;&#65288;LEO&#65289;&#21355;&#26143;&#23485;&#24102;&#26143;&#24231;&#36827;&#34892;&#20102;&#21487;&#25345;&#32493;&#24615;&#35780;&#20272;&#65292;&#21457;&#29616;&#21355;&#26143;&#21457;&#23556;&#22686;&#21152;&#24102;&#26469;&#20102;&#29615;&#22659;&#25490;&#25918;&#21644;&#30899;&#36275;&#36857;&#30340;&#38382;&#39064;&#65292;&#38656;&#35201;&#23545;&#20854;&#36827;&#34892;&#26377;&#25928;&#31649;&#29702;&#12290;</title><link>http://arxiv.org/abs/2309.02338</link><description>&lt;p&gt;
&#20302;&#22320;&#29699;&#36712;&#36947;&#65288;LEO&#65289;&#21355;&#26143;&#23485;&#24102;&#26143;&#24231;&#30340;&#21487;&#25345;&#32493;&#24615;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
Sustainability assessment of Low Earth Orbit (LEO) satellite broadband mega-constellations. (arXiv:2309.02338v1 [astro-ph.EP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.02338
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23545;&#20302;&#22320;&#29699;&#36712;&#36947;&#65288;LEO&#65289;&#21355;&#26143;&#23485;&#24102;&#26143;&#24231;&#36827;&#34892;&#20102;&#21487;&#25345;&#32493;&#24615;&#35780;&#20272;&#65292;&#21457;&#29616;&#21355;&#26143;&#21457;&#23556;&#22686;&#21152;&#24102;&#26469;&#20102;&#29615;&#22659;&#25490;&#25918;&#21644;&#30899;&#36275;&#36857;&#30340;&#38382;&#39064;&#65292;&#38656;&#35201;&#23545;&#20854;&#36827;&#34892;&#26377;&#25928;&#31649;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36229;&#22823;&#22411;&#26143;&#24231;&#30340;&#22686;&#38271;&#36805;&#36895;&#22686;&#21152;&#20102;&#23558;&#26032;&#21355;&#26143;&#36865;&#20837;&#31354;&#38388;&#25152;&#38656;&#30340;&#28779;&#31661;&#21457;&#23556;&#27425;&#25968;&#12290;&#34429;&#28982;&#20302;&#22320;&#29699;&#36712;&#36947;&#65288;LEO&#65289;&#23485;&#24102;&#21355;&#26143;&#26377;&#21161;&#20110;&#36830;&#25509;&#26410;&#36830;&#36890;&#30340;&#31038;&#21306;&#24182;&#23454;&#29616;&#21487;&#25345;&#32493;&#21457;&#23637;&#30446;&#26631;&#65292;&#20294;&#20063;&#23384;&#22312;&#19968;&#31995;&#21015;&#36127;&#38754;&#29615;&#22659;&#22806;&#37096;&#24615;&#65292;&#21253;&#25324;&#28779;&#31661;&#29123;&#26009;&#29123;&#28903;&#21644;&#30001;&#27492;&#20135;&#29983;&#30340;&#29615;&#22659;&#25490;&#25918;&#12290;&#25105;&#20204;&#23545;&#19977;&#20010;&#20027;&#35201;LEO&#26143;&#24231;&#30340;&#31532;&#19968;&#38454;&#27573;&#36827;&#34892;&#21487;&#25345;&#32493;&#24615;&#20998;&#26512;&#65292;&#21253;&#25324;Amazon Kuiper&#65288;3,236&#39063;&#21355;&#26143;&#65289;&#12289;OneWeb&#65288;648&#39063;&#21355;&#26143;&#65289;&#21644;SpaceX Starlink&#65288;4,425&#39063;&#21355;&#26143;&#65289;&#12290;&#22312;&#22522;&#20934;&#26041;&#26696;&#19979;&#65292;&#32463;&#36807;&#20116;&#24180;&#65292;&#25105;&#20204;&#21457;&#29616;Kuiper&#30340;&#27599;&#20301;&#29992;&#25143;&#20108;&#27687;&#21270;&#30899;&#24403;&#37327;&#65288;CO$_2$eq&#65289;&#20026;0.70&#177;0.34&#21544;&#65292;OneWeb&#20026;1.41&#177;0.71&#21544;&#65292;Starlink&#20026;0.47&#177;0.15&#21544;CO$_2$eq/&#29992;&#25143;&#12290;&#28982;&#32780;&#65292;&#22312;&#26368;&#22351;&#24773;&#20917;&#19979;&#30340;&#25490;&#25918;&#24773;&#26223;&#20013;&#65292;&#36825;&#20123;&#20540;&#22686;&#21152;&#21040;Kuiper&#30340;3.02&#177;1.48&#21544;&#65292;OneWeb&#30340;1.7&#177;0.71&#21544;&#21644;Starlink&#30340;1.04&#177;0.33&#21544;CO$_2$eq/&#29992;&#25143;&#12290;
&lt;/p&gt;
&lt;p&gt;
The growth of mega-constellations is rapidly increasing the number of rocket launches required to place new satellites in space. While Low Earth Orbit (LEO) broadband satellites help to connect unconnected communities and achieve the Sustainable Development Goals, there are also a range of negative environmental externalities, from the burning of rocket fuels and resulting environmental emissions. We present sustainability analytics for phase 1 of the three main LEO constellations including Amazon Kuiper (3,236 satellites), OneWeb (648 satellites), and SpaceX Starlink (4,425 satellites). In baseline scenarios over five years, we find a per subscriber carbon dioxide equivalent (CO$_2$eq) of 0.70$\pm$0.34 tonnes for Kuiper, 1.41$\pm$0.71 tonnes for OneWeb and 0.47$\pm$0.15 tonnes CO$_2$eq/subscriber for Starlink. However, in the worst-case emissions scenario these values increase to 3.02$\pm$1.48 tonnes for Kuiper, 1.7$\pm$0.71 tonnes for OneWeb and 1.04$\pm$0.33 tonnes CO$_2$eq/subscrib
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;&#21463;&#32479;&#35745;&#29289;&#29702;&#23398;&#21551;&#21457;&#30340;&#29289;&#29702;&#27169;&#22411;&#65292;&#21033;&#29992;&#19977;&#32423;&#35746;&#21333;&#31807;&#25968;&#25454;&#39044;&#27979;&#37329;&#34701;&#24066;&#22330;&#30340;&#20215;&#26684;&#27874;&#21160;&#21644;&#39044;&#26399;&#22238;&#25253;&#65292;&#36229;&#36234;&#20102;&#20256;&#32479;&#26041;&#27861;&#21644;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#65292;&#25552;&#20379;&#20102;&#23545;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#30340;&#28145;&#20837;&#29702;&#35299;&#12290;</title><link>http://arxiv.org/abs/2308.14235</link><description>&lt;p&gt;
&#23545;&#37329;&#34701;&#24066;&#22330;&#30340;&#23454;&#35777;&#20998;&#26512;&#65306;&#22522;&#20110;&#32479;&#35745;&#29289;&#29702;&#23398;&#24212;&#29992;&#30340;&#35265;&#35299;
&lt;/p&gt;
&lt;p&gt;
An Empirical Analysis on Financial Market: Insights from the Application of Statistical Physics. (arXiv:2308.14235v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.14235
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;&#21463;&#32479;&#35745;&#29289;&#29702;&#23398;&#21551;&#21457;&#30340;&#29289;&#29702;&#27169;&#22411;&#65292;&#21033;&#29992;&#19977;&#32423;&#35746;&#21333;&#31807;&#25968;&#25454;&#39044;&#27979;&#37329;&#34701;&#24066;&#22330;&#30340;&#20215;&#26684;&#27874;&#21160;&#21644;&#39044;&#26399;&#22238;&#25253;&#65292;&#36229;&#36234;&#20102;&#20256;&#32479;&#26041;&#27861;&#21644;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#65292;&#25552;&#20379;&#20102;&#23545;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#30340;&#28145;&#20837;&#29702;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#21463;&#32479;&#35745;&#29289;&#29702;&#23398;&#21551;&#21457;&#30340;&#29289;&#29702;&#27169;&#22411;&#65292;&#36890;&#36807;&#21033;&#29992;&#19977;&#32423;&#35746;&#21333;&#31807;&#25968;&#25454;&#26469;&#39044;&#27979;&#20215;&#26684;&#27874;&#21160;&#21644;&#39044;&#26399;&#22238;&#25253;&#12290;&#36890;&#36807;&#23558;&#22996;&#25176;&#31807;&#20013;&#30340;&#35746;&#21333;&#19982;&#29289;&#29702;&#31995;&#32479;&#20013;&#30340;&#31890;&#23376;&#36827;&#34892;&#31867;&#27604;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#31995;&#32479;&#21160;&#33021;&#21644;&#21160;&#37327;&#30340;&#29420;&#29305;&#27979;&#37327;&#26041;&#24335;&#65292;&#20197;&#29702;&#35299;&#21644;&#35780;&#20272;&#22996;&#25176;&#31807;&#30340;&#29366;&#24577;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#36229;&#36234;&#20102;&#20165;&#20165;&#26816;&#26597;&#35746;&#21333;&#31807;&#30340;&#39030;&#23618;&#65292;&#24341;&#20837;&#20102;&#8220;&#27963;&#36291;&#28145;&#24230;&#8221;&#27010;&#24565;&#65292;&#19968;&#31181;&#35745;&#31639;&#39640;&#25928;&#30340;&#26041;&#27861;&#26469;&#35782;&#21035;&#23545;&#20215;&#26684;&#21160;&#24577;&#20135;&#29983;&#24433;&#21709;&#30340;&#35746;&#21333;&#31807;&#23618;&#32423;&#12290;&#25105;&#20204;&#32463;&#39564;&#35777;&#26126;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#20248;&#20110;&#20256;&#32479;&#26041;&#27861;&#21644;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#30340;&#22522;&#20934;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#23545;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#26377;&#28145;&#20837;&#30340;&#29702;&#35299;&#65292;&#24182;&#33021;&#20135;&#29983;&#26356;&#20934;&#30830;&#30340;&#27874;&#21160;&#24615;&#21644;&#39044;&#26399;&#22238;&#25253;&#39044;&#27979;&#12290;&#36890;&#36807;&#23558;&#32479;&#35745;&#29289;&#29702;&#23398;&#30340;&#21407;&#29702;&#32435;&#20837;&#30740;&#31350;&#65292;&#36825;&#39033;&#30740;&#31350;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#24066;&#22330;&#29702;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this study, we introduce a physical model inspired by statistical physics for predicting price volatility and expected returns by leveraging Level 3 order book data. By drawing parallels between orders in the limit order book and particles in a physical system, we establish unique measures for the system's kinetic energy and momentum as a way to comprehend and evaluate the state of limit order book. Our model goes beyond examining merely the top layers of the order book by introducing the concept of 'active depth', a computationally-efficient approach for identifying order book levels that have impact on price dynamics. We empirically demonstrate that our model outperforms the benchmarks of traditional approaches and machine learning algorithm. Our model provides a nuanced comprehension of market microstructure and produces more accurate forecasts on volatility and expected returns. By incorporating principles of statistical physics, this research offers valuable insights on underst
&lt;/p&gt;</description></item><item><title>"&#24341;&#29992;GPT&#30340;&#8220;&#35930;&#40736;&#35797;&#39564;&#8221;&#26159;&#19968;&#31181;&#21019;&#26032;&#30340;&#26234;&#33021;&#20195;&#29702;&#24314;&#27169;&#26041;&#27861;&#65292;&#21033;&#29992;&#26234;&#33021;&#20195;&#29702;&#20195;&#34920;&#20225;&#19994;&#36827;&#34892;&#31454;&#20105;&#21644;&#21246;&#32467;&#30740;&#31350;&#12290;&#23427;&#27604;&#20351;&#29992;&#20154;&#31867;&#20027;&#20307;&#36827;&#34892;&#23454;&#39564;&#26356;&#20855;&#25104;&#26412;&#25928;&#30410;&#21644;&#28789;&#27963;&#24615;&#65292;&#24182;&#23637;&#29616;&#20986;&#36229;&#36234;&#20256;&#32479;&#20195;&#29702;&#24314;&#27169;&#26041;&#27861;&#30340;&#33021;&#21147;&#12290;"</title><link>http://arxiv.org/abs/2308.10974</link><description>&lt;p&gt;
"&#24341;&#29992;GPT&#30340;&#8220;&#35930;&#40736;&#35797;&#39564;&#8221;&#65306;&#19968;&#31181;&#30740;&#31350;&#20225;&#19994;&#31454;&#20105;&#21644;&#21246;&#32467;&#30340;&#21019;&#26032;&#26234;&#33021;&#20195;&#29702;&#24314;&#27169;&#26041;&#27861;"
&lt;/p&gt;
&lt;p&gt;
"Guinea Pig Trials" Utilizing GPT: A Novel Smart Agent-Based Modeling Approach for Studying Firm Competition and Collusion. (arXiv:2308.10974v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.10974
&lt;/p&gt;
&lt;p&gt;
"&#24341;&#29992;GPT&#30340;&#8220;&#35930;&#40736;&#35797;&#39564;&#8221;&#26159;&#19968;&#31181;&#21019;&#26032;&#30340;&#26234;&#33021;&#20195;&#29702;&#24314;&#27169;&#26041;&#27861;&#65292;&#21033;&#29992;&#26234;&#33021;&#20195;&#29702;&#20195;&#34920;&#20225;&#19994;&#36827;&#34892;&#31454;&#20105;&#21644;&#21246;&#32467;&#30740;&#31350;&#12290;&#23427;&#27604;&#20351;&#29992;&#20154;&#31867;&#20027;&#20307;&#36827;&#34892;&#23454;&#39564;&#26356;&#20855;&#25104;&#26412;&#25928;&#30410;&#21644;&#28789;&#27963;&#24615;&#65292;&#24182;&#23637;&#29616;&#20986;&#36229;&#36234;&#20256;&#32479;&#20195;&#29702;&#24314;&#27169;&#26041;&#27861;&#30340;&#33021;&#21147;&#12290;"
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20225;&#19994;&#31454;&#20105;&#21644;&#21246;&#32467;&#28041;&#21450;&#22797;&#26434;&#30340;&#21160;&#24577;&#65292;&#23588;&#20854;&#26159;&#32771;&#34385;&#21040;&#20225;&#19994;&#20043;&#38388;&#30340;&#27807;&#36890;&#12290;&#36825;&#20123;&#38382;&#39064;&#21487;&#20197;&#34987;&#24314;&#27169;&#20026;&#22797;&#26434;&#31995;&#32479;&#30340;&#38382;&#39064;&#65292;&#20256;&#32479;&#19978;&#36890;&#36807;&#28041;&#21450;&#20154;&#31867;&#20027;&#20307;&#25110;&#22522;&#20110;&#20195;&#29702;&#30340;&#24314;&#27169;&#26041;&#27861;&#36827;&#34892;&#25506;&#31350;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21019;&#26032;&#30340;&#26694;&#26550;&#65292;&#31216;&#20026;&#26234;&#33021;&#20195;&#29702;&#24314;&#27169;&#65288;SABM&#65289;&#65292;&#20854;&#20013;&#30001;GPT-4&#25216;&#26415;&#25903;&#25345;&#30340;&#26234;&#33021;&#20195;&#29702;&#20195;&#34920;&#20225;&#19994;&#24182;&#30456;&#20114;&#20132;&#20114;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#39033;&#25511;&#21046;&#23454;&#39564;&#65292;&#30740;&#31350;&#20102;&#19981;&#21516;&#26465;&#20214;&#19979;&#20225;&#19994;&#20215;&#26684;&#31454;&#20105;&#21644;&#21246;&#32467;&#34892;&#20026;&#12290;&#19982;&#20351;&#29992;&#20154;&#31867;&#20027;&#20307;&#36827;&#34892;&#23454;&#39564;&#30456;&#27604;&#65292;SABM&#26356;&#20855;&#25104;&#26412;&#25928;&#30410;&#21644;&#28789;&#27963;&#24615;&#12290;&#26234;&#33021;&#20195;&#29702;&#25317;&#26377;&#20915;&#31574;&#30340;&#24191;&#27867;&#30693;&#35782;&#24211;&#65292;&#23637;&#29616;&#20986;&#31867;&#20284;&#20154;&#31867;&#30340;&#25112;&#30053;&#33021;&#21147;&#65292;&#36229;&#36234;&#20102;&#20256;&#32479;&#30340;&#22522;&#20110;&#20195;&#29702;&#30340;&#24314;&#27169;&#26041;&#27861;&#12290;&#27492;&#22806;&#65292;&#26234;&#33021;&#20195;&#29702;&#33021;&#22815;&#27169;&#25311;&#20154;&#31867;&#23545;&#35805;&#24182;&#20010;&#24615;&#21270;&#65292;&#20351;&#20854;&#25104;&#20026;&#30740;&#31350;&#28041;&#21450;&#27807;&#36890;&#30340;&#22797;&#26434;&#24773;&#20917;&#30340;&#29702;&#24819;&#36873;&#25321;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;...
&lt;/p&gt;
&lt;p&gt;
Firm competition and collusion involve complex dynamics, particularly when considering communication among firms. Such issues can be modeled as problems of complex systems, traditionally approached through experiments involving human subjects or agent-based modeling methods. We propose an innovative framework called Smart Agent-Based Modeling (SABM), wherein smart agents, supported by GPT-4 technologies, represent firms, and interact with one another. We conducted a controlled experiment to study firm price competition and collusion behaviors under various conditions. SABM is more cost-effective and flexible compared to conducting experiments with human subjects. Smart agents possess an extensive knowledge base for decision-making and exhibit human-like strategic abilities, surpassing traditional ABM agents. Furthermore, smart agents can simulate human conversation and be personalized, making them ideal for studying complex situations involving communication. Our results demonstrate th
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#25919;&#24220;&#22312;&#20379;&#24212;&#38142;&#20013;&#26029;&#26102;&#36890;&#36807;&#35268;&#23450;&#26368;&#20302;&#37197;&#39069;&#36816;&#36755;&#26469;&#22686;&#21152;&#20379;&#24212;&#38142;&#30340;&#24377;&#24615;&#12290;&#30740;&#31350;&#20197;&#38081;&#36335;&#36816;&#36755;&#24066;&#22330;&#20026;&#20363;&#65292;&#32771;&#34385;&#20102;&#19981;&#21516;&#20135;&#21697;&#30340;&#30408;&#21033;&#27700;&#24179;&#24046;&#24322;&#65292;&#25552;&#20986;&#20102;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>http://arxiv.org/abs/2308.00681</link><description>&lt;p&gt;
&#36890;&#36807;&#24179;&#34913;&#23450;&#20215;&#21644;&#35268;&#23450;&#36816;&#36755;&#37197;&#39069;&#26469;&#22686;&#21152;&#20379;&#24212;&#38142;&#30340;&#24377;&#24615;
&lt;/p&gt;
&lt;p&gt;
Increasing Supply Chain Resiliency Through Equilibrium Pricing and Stipulating Transportation Quota Regulation. (arXiv:2308.00681v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.00681
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#25919;&#24220;&#22312;&#20379;&#24212;&#38142;&#20013;&#26029;&#26102;&#36890;&#36807;&#35268;&#23450;&#26368;&#20302;&#37197;&#39069;&#36816;&#36755;&#26469;&#22686;&#21152;&#20379;&#24212;&#38142;&#30340;&#24377;&#24615;&#12290;&#30740;&#31350;&#20197;&#38081;&#36335;&#36816;&#36755;&#24066;&#22330;&#20026;&#20363;&#65292;&#32771;&#34385;&#20102;&#19981;&#21516;&#20135;&#21697;&#30340;&#30408;&#21033;&#27700;&#24179;&#24046;&#24322;&#65292;&#25552;&#20986;&#20102;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20379;&#24212;&#38142;&#30340;&#20013;&#26029;&#21487;&#33021;&#30001;&#22810;&#31181;&#21407;&#22240;&#24341;&#36215;&#65292;&#21253;&#25324;&#33258;&#28982;&#28798;&#23475;&#25110;&#24066;&#22330;&#21160;&#24577;&#12290;&#22914;&#26524;&#20013;&#26029;&#23545;&#32463;&#27982;&#20135;&#29983;&#28145;&#36828;&#24433;&#21709;&#65292;&#30417;&#31649;&#26426;&#26500;&#21487;&#33021;&#20915;&#23450;&#24178;&#39044;&#20197;&#26368;&#22823;&#31243;&#24230;&#20943;&#23569;&#23545;&#31038;&#20250;&#30340;&#24433;&#21709;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#25919;&#24220;&#22312;&#36816;&#36755;&#33021;&#21147;&#20302;&#20110;&#24635;&#20135;&#37327;&#24182;&#19988;&#19981;&#21516;&#20135;&#21697;&#30340;&#30408;&#21033;&#27700;&#24179;&#24046;&#24322;&#26174;&#33879;&#30340;&#24066;&#22330;&#19978;&#35268;&#23450;&#30340;&#26368;&#20302;&#37197;&#39069;&#36816;&#36755;&#12290;&#22312;&#21271;&#32654;&#65292;&#38081;&#36335;&#36816;&#36755;&#24066;&#22330;&#26377;&#19968;&#20010;&#26377;&#36259;&#30340;&#20363;&#23376;&#65292;&#38081;&#36335;&#23481;&#37327;&#34987;&#29992;&#20110;&#21508;&#31181;&#20135;&#21697;&#21644;&#21830;&#21697;&#65292;&#22914;&#30707;&#27833;&#21644;&#35895;&#29289;&#12290;&#26412;&#30740;&#31350;&#20551;&#23450;&#23384;&#22312;&#19968;&#20010;&#36816;&#36755;&#20844;&#21496;&#65292;&#20854;&#23481;&#37327;&#26377;&#38480;&#65292;&#23558;&#20250;&#36816;&#36755;&#19968;&#32452;&#20855;&#26377;&#24322;&#36136;&#36816;&#36755;&#21644;&#29983;&#20135;&#25104;&#26412;&#21644;&#20215;&#26684;&#30340;&#20135;&#21697;&#12290;&#32473;&#20986;&#20102;&#24066;&#22330;&#21442;&#19982;&#32773;&#20197;&#21450;&#25919;&#24220;&#38754;&#20020;&#30340;&#25968;&#23398;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
Supply chain disruption can occur for a variety of reasons, including natural disasters or market dynamics. If the disruption is profound and with dire consequences for the economy, the regulators may decide to intervene to minimize the impact for the betterment of the society. This paper investigates the minimum quota regulation on transportation amounts, stipulated by the government in a market where transportation capacity is below total production and profitability levels differ significantly among different products. In North America, an interesting example can happen in rail transportation market, where the rail capacity is used for a variety of products and commodities such as oil and grains. This research assumes that there is a shipping company with limited capacity which will ship a group of products with heterogeneous transportation and production costs and prices. Mathematical problems for the market players as well as the government are presented, solutions are proposed, a
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#35777;&#26126;&#20102;&#36890;&#36807;&#26102;&#38388;&#25913;&#21464;&#30340;&#24067;&#26391;&#36816;&#21160;&#23884;&#20837;&#30340;&#23450;&#29702;&#22312;&#24067;&#26391;&#36816;&#21160;&#21644;&#26102;&#38388;&#25913;&#21464;&#30456;&#20114;&#29420;&#31435;&#26102;&#19981;&#25104;&#31435;&#12290;</title><link>http://arxiv.org/abs/2307.08628</link><description>&lt;p&gt;
(&#29420;&#31435;) &#34987;&#25903;&#37197;&#30340;&#20117;&#28982;&#24615;&#26159;&#21542;&#30456;&#20851;?
&lt;/p&gt;
&lt;p&gt;
Is (independent) subordination relevant?. (arXiv:2307.08628v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.08628
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#35777;&#26126;&#20102;&#36890;&#36807;&#26102;&#38388;&#25913;&#21464;&#30340;&#24067;&#26391;&#36816;&#21160;&#23884;&#20837;&#30340;&#23450;&#29702;&#22312;&#24067;&#26391;&#36816;&#21160;&#21644;&#26102;&#38388;&#25913;&#21464;&#30456;&#20114;&#29420;&#31435;&#26102;&#19981;&#25104;&#31435;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Monroe(1978)&#35777;&#26126;&#20102;&#20219;&#20309;&#26412;&#22320;&#21322;&#38789;&#37117;&#21487;&#20197;&#34920;&#31034;&#20026;&#26102;&#38388;&#25913;&#21464;&#30340;&#24067;&#26391;&#36816;&#21160;(BM)&#12290;&#24403;BM&#21644;&#26102;&#38388;&#25913;&#21464;&#30456;&#20114;&#29420;&#31435;&#26102;&#65292;&#36825;&#20010;&#23884;&#20837;&#23450;&#29702;&#26159;&#21542;&#25104;&#31435;&#21602;? &#25105;&#20204;&#35777;&#26126;&#23616;&#37096;&#21322;&#38789;&#19982;&#24102;&#26377;&#19982;BM&#30456;&#20114;&#29420;&#31435;&#30340;&#26102;&#38388;&#25913;&#21464;&#30340;BM&#19981;&#31561;&#20215;&#12290;&#36890;&#36807;&#20351;&#29992;&#22312;&#37329;&#34701;&#25991;&#29486;&#20013;&#30340;&#19968;&#20010;&#19982;&#26399;&#26435;&#23450;&#20215;&#24212;&#29992;&#30456;&#20851;&#30340;&#36807;&#31243;&#20316;&#20026;&#21453;&#20363;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#36825;&#20010;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
Monroe (1978) demonstrates that any local semimartingale can be represented as a time-changed Brownian Motion (BM). Does this embedding theorem holds when the BM and the time-change are independent? We prove that a local semimartingale is not equivalent to a BM with a time-change that is independent from the BM. This result is obtained utilizing as a counterexample a process relevant in the financial literature for applications in option pricing.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21160;&#24577;&#27169;&#22411;&#36873;&#25321;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#26681;&#25454;&#19981;&#21516;&#30340;&#29366;&#24577;&#36873;&#25321;&#26368;&#20248;&#30340;&#27169;&#22411;&#65292;&#24182;&#36890;&#36807;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#23545;&#21160;&#24577;&#35268;&#21010;&#38382;&#39064;&#36827;&#34892;&#36817;&#20284;&#21644;&#20272;&#35745;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#37325;&#26032;&#24179;&#34913;&#25104;&#26412;&#19979;&#20999;&#25442;&#25237;&#36164;&#32452;&#21512;&#27169;&#22411;&#26102;&#65292;&#20351;&#29992;&#23439;&#35266;&#32463;&#27982;&#20449;&#24687;&#30340;&#24615;&#33021;&#20248;&#20110;&#20107;&#21518;&#36873;&#25321;&#26368;&#20339;&#25237;&#36164;&#32452;&#21512;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2307.04754</link><description>&lt;p&gt;
&#21160;&#20316;&#29366;&#24577;&#30456;&#20851;&#30340;&#21160;&#24577;&#27169;&#22411;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Action-State Dependent Dynamic Model Selection. (arXiv:2307.04754v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04754
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21160;&#24577;&#27169;&#22411;&#36873;&#25321;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#26681;&#25454;&#19981;&#21516;&#30340;&#29366;&#24577;&#36873;&#25321;&#26368;&#20248;&#30340;&#27169;&#22411;&#65292;&#24182;&#36890;&#36807;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#23545;&#21160;&#24577;&#35268;&#21010;&#38382;&#39064;&#36827;&#34892;&#36817;&#20284;&#21644;&#20272;&#35745;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#37325;&#26032;&#24179;&#34913;&#25104;&#26412;&#19979;&#20999;&#25442;&#25237;&#36164;&#32452;&#21512;&#27169;&#22411;&#26102;&#65292;&#20351;&#29992;&#23439;&#35266;&#32463;&#27982;&#20449;&#24687;&#30340;&#24615;&#33021;&#20248;&#20110;&#20107;&#21518;&#36873;&#25321;&#26368;&#20339;&#25237;&#36164;&#32452;&#21512;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#19990;&#30028;&#30340;&#26576;&#20123;&#29366;&#24577;&#19979;&#65292;&#22810;&#20010;&#27169;&#22411;&#20013;&#30340;&#19968;&#20010;&#21487;&#33021;&#21482;&#22312;&#20854;&#20013;&#26576;&#20123;&#29366;&#24577;&#19979;&#34920;&#29616;&#26368;&#20339;&#12290;&#32780;&#22312;&#27169;&#22411;&#20043;&#38388;&#30340;&#20999;&#25442;&#20063;&#21487;&#33021;&#20195;&#20215;&#39640;&#26114;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#23547;&#25214;&#19968;&#31181;&#33021;&#22815;&#21160;&#24577;&#36873;&#25321;&#27169;&#22411;&#30340;&#36807;&#31243;&#38656;&#35201;&#35299;&#20915;&#19968;&#20010;&#22797;&#26434;&#30340;&#20272;&#35745;&#38382;&#39064;&#21644;&#21160;&#24577;&#35268;&#21010;&#38382;&#39064;&#12290;&#26412;&#25991;&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#26469;&#20174;&#25968;&#25454;&#20013;&#36817;&#20284;&#21644;&#20272;&#35745;&#36825;&#20010;&#21160;&#24577;&#35268;&#21010;&#38382;&#39064;&#30340;&#26368;&#20248;&#35299;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#31639;&#27861;&#33021;&#22815;&#19968;&#33268;&#22320;&#20272;&#35745;&#20986;&#26681;&#25454;&#19968;&#32452;&#21327;&#21464;&#37327;&#36873;&#25321;&#19981;&#21516;&#27169;&#22411;&#30340;&#26368;&#20248;&#31574;&#30053;&#12290;&#20855;&#20307;&#24212;&#29992;&#26041;&#38754;&#65292;&#20363;&#22914;&#22312;&#37325;&#26032;&#24179;&#34913;&#25104;&#26412;&#19979;&#20999;&#25442;&#19981;&#21516;&#25237;&#36164;&#32452;&#21512;&#27169;&#22411;&#65292;&#20351;&#29992;&#23439;&#35266;&#32463;&#27982;&#20449;&#24687;&#36827;&#34892;&#20915;&#31574;&#12290;&#36890;&#36807;&#19968;&#32452;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#21644;&#20215;&#26684;&#25968;&#25454;&#65292;&#32463;&#39564;&#24212;&#29992;&#20110;&#19978;&#36848;&#25237;&#36164;&#32452;&#21512;&#38382;&#39064;&#34920;&#29616;&#20986;&#27604;&#20107;&#21518;&#36873;&#25321;&#26368;&#20339;&#25237;&#36164;&#32452;&#21512;&#27169;&#22411;&#26356;&#20248;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
A model among many may only be best under certain states of the world. Switching from a model to another can also be costly. Finding a procedure to dynamically choose a model in these circumstances requires to solve a complex estimation procedure and a dynamic programming problem. A Reinforcement learning algorithm is used to approximate and estimate from the data the optimal solution to this dynamic programming problem. The algorithm is shown to consistently estimate the optimal policy that may choose different models based on a set of covariates. A typical example is the one of switching between different portfolio models under rebalancing costs, using macroeconomic information. Using a set of macroeconomic variables and price data, an empirical application to the aforementioned portfolio problem shows superior performance to choosing the best portfolio model with hindsight.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20351;&#29992;&#19968;&#31181;&#22522;&#20110;&#26234;&#33021;&#20307;&#27169;&#22411;&#30340;&#26032;&#26041;&#27861;&#65292;&#30740;&#31350;&#20102;&#30123;&#21518;&#36890;&#32960;&#19982;&#36135;&#24065;&#25919;&#31574;&#30340;&#22256;&#22659;&#65292;&#36890;&#36807;&#30740;&#31350;&#19977;&#31181;&#22806;&#37096;&#20914;&#20987;&#30340;&#24433;&#21709;&#65292;&#25506;&#31350;&#30417;&#31649;&#25919;&#31574;&#23545;&#36890;&#32960;&#21160;&#24577;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2306.01284</link><description>&lt;p&gt;
&#30123;&#21518;&#36890;&#32960;&#19982;&#36135;&#24065;&#25919;&#31574;&#22256;&#22659;&#65306;&#19968;&#39033;&#22522;&#20110;&#26234;&#33021;&#20307;&#22330;&#26223;&#20998;&#26512;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Post-COVID Inflation &amp; the Monetary Policy Dilemma: An Agent-Based Scenario Analysis. (arXiv:2306.01284v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.01284
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#19968;&#31181;&#22522;&#20110;&#26234;&#33021;&#20307;&#27169;&#22411;&#30340;&#26032;&#26041;&#27861;&#65292;&#30740;&#31350;&#20102;&#30123;&#21518;&#36890;&#32960;&#19982;&#36135;&#24065;&#25919;&#31574;&#30340;&#22256;&#22659;&#65292;&#36890;&#36807;&#30740;&#31350;&#19977;&#31181;&#22806;&#37096;&#20914;&#20987;&#30340;&#24433;&#21709;&#65292;&#25506;&#31350;&#30417;&#31649;&#25919;&#31574;&#23545;&#36890;&#32960;&#21160;&#24577;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
COVID-19&#24102;&#26469;&#30340;&#32463;&#27982;&#20914;&#20987;&#20984;&#26174;&#20102;&#25551;&#36848;&#21644;&#39044;&#27979;&#36890;&#32960;&#21160;&#24577;&#30340;&#22256;&#38590;&#65292;&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#31181;&#26367;&#20195;&#24314;&#27169;&#26041;&#27861;&#12290;&#25105;&#20204;&#20351;&#29992;&#32463;&#36807;&#33391;&#22909;&#30740;&#31350;&#30340;Mark-0&#26234;&#33021;&#20307;&#27169;&#22411;&#65292;&#30740;&#31350;2020-2023&#24180;&#30340;&#24773;&#20917;&#65292;&#24182;&#21253;&#25324;&#19968;&#31181;&#26426;&#21046;&#65292;&#20351;&#32463;&#27982;&#20027;&#20307;&#23545;&#20013;&#22830;&#38134;&#34892;&#30340;&#20449;&#20219;&#21487;&#20197;&#35299;&#38500;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#30417;&#31649;&#25919;&#31574;&#23545;&#30001;COVID-19&#24341;&#21457;&#30340;&#19977;&#31181;&#22806;&#37096;&#20914;&#20987;&#25152;&#23548;&#33268;&#30340;&#36890;&#32960;&#21160;&#24577;&#30340;&#24433;&#21709;&#65306;&#30001;COVID&#30456;&#20851;&#23553;&#38145;&#24341;&#36215;&#30340;&#29983;&#20135;/&#28040;&#36153;&#20914;&#20987;&#12289;&#20379;&#24212;&#38142;&#20914;&#20987;&#20197;&#21450;&#20420;&#32599;&#26031;&#20837;&#20405;&#20044;&#20811;&#20848;&#21152;&#21095;&#30340;&#33021;&#28304;&#20215;&#26684;&#20914;&#20987;&#12290;&#36890;&#36807;&#22312;&#19981;&#21516;&#30340;&#36135;&#24065;&#25919;&#31574;&#25928;&#21147;&#21644;&#20256;&#23548;&#28192;&#36947;&#30340;&#20551;&#35774;&#19979;&#25506;&#31350;&#36825;&#20123;&#20914;&#20987;&#30340;&#24433;&#21709;&#65292;&#25105;&#20204;&#22238;&#39038;&#20102;&#21508;&#31181;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;
The economic shocks that followed the COVID-19 pandemic have brought to light the difficulty, both for academics and policy makers, of describing and predicting the dynamics of inflation. This paper offers an alternative modelling approach. We study the 2020-2023 period within the well-studied Mark-0 Agent-Based Model, in which economic agents act and react according to plausible behavioural rules. We include in particular a mechanism through which trust of economic agents in the Central Bank can de-anchor. We investigate the influence of regulatory policies on inflationary dynamics resulting from three exogenous shocks, calibrated on those that followed the COVID-19 pandemic: a production/consumption shock due to COVID-related lockdowns, a supply-chain shock, and an energy price shock exacerbated by the Russian invasion of Ukraine. By exploring the impact of these shocks under different assumptions about monetary policy efficacy and transmission channels, we review various explanation
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#21033;&#29992;&#21326;&#30427;&#39039;&#24030;&#30340;&#22823;&#40635;&#25195;&#25551;&#25968;&#25454;&#30740;&#31350;&#20102;&#26368;&#20302;&#24037;&#36164;&#23545;&#25209;&#21457;&#21644;&#38646;&#21806;&#20215;&#26684;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#19968;&#26086;&#32771;&#34385;&#21040;&#25209;&#21457;&#25104;&#26412;&#25928;&#24212;&#65292;&#38646;&#21806;&#20215;&#26684;&#24377;&#24615;&#20250;&#22686;&#21152;&#19968;&#20493;&#20197;&#19978;&#12290;&#38646;&#21806;&#21830;&#23436;&#20840;&#36716;&#23233;&#20102;&#25104;&#26412;&#12290;</title><link>http://arxiv.org/abs/2303.10367</link><description>&lt;p&gt;
&#26368;&#20302;&#24037;&#36164;&#23545;&#25209;&#21457;&#21644;&#38646;&#21806;&#20215;&#26684;&#30340;&#24433;&#21709;&#65306;&#22522;&#20110;&#22823;&#40635;&#25195;&#25551;&#25968;&#25454;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Minimum Wage Pass-through to Wholesale and Retail Prices: Evidence from Cannabis Scanner Data. (arXiv:2303.10367v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10367
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;&#21326;&#30427;&#39039;&#24030;&#30340;&#22823;&#40635;&#25195;&#25551;&#25968;&#25454;&#30740;&#31350;&#20102;&#26368;&#20302;&#24037;&#36164;&#23545;&#25209;&#21457;&#21644;&#38646;&#21806;&#20215;&#26684;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#19968;&#26086;&#32771;&#34385;&#21040;&#25209;&#21457;&#25104;&#26412;&#25928;&#24212;&#65292;&#38646;&#21806;&#20215;&#26684;&#24377;&#24615;&#20250;&#22686;&#21152;&#19968;&#20493;&#20197;&#19978;&#12290;&#38646;&#21806;&#21830;&#23436;&#20840;&#36716;&#23233;&#20102;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36234;&#26469;&#36234;&#22810;&#30340;&#23454;&#35777;&#25991;&#29486;&#21457;&#29616;&#65292;&#20225;&#19994;&#36890;&#36807;&#25552;&#39640;&#38646;&#21806;&#20215;&#23558;&#26368;&#20302;&#24037;&#36164;&#19978;&#28072;&#30340;&#25104;&#26412;&#36716;&#23233;&#32473;&#28040;&#36153;&#32773;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#24456;&#23569;&#20102;&#35299;&#26368;&#20302;&#24037;&#36164;&#23545;&#25209;&#21457;&#20215;&#26684;&#30340;&#24433;&#21709;&#20197;&#21450;&#38646;&#21806;&#21830;&#26159;&#21542;&#38754;&#23545;&#38500;&#21171;&#21160;&#25104;&#26412;&#20914;&#20987;&#22806;&#30340;&#25209;&#21457;&#25104;&#26412;&#20914;&#20987;&#12290;&#26412;&#25991;&#21033;&#29992;&#21326;&#30427;&#39039;&#24030;&#21512;&#27861;&#30340;&#20241;&#38386;&#22823;&#40635;&#20135;&#19994;&#30340;&#29420;&#29305;&#24066;&#22330;&#32467;&#26500;&#65292;&#30740;&#31350;&#26368;&#20302;&#24037;&#36164;&#23545;&#25209;&#21457;&#21644;&#38646;&#21806;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#22312;&#19968;&#20010;&#21160;&#24577;&#24046;&#20998;&#24046;&#24322;&#26550;&#26500;&#20013;&#65292;&#21033;&#29992;&#20379;&#24212;&#38142;&#19978;60&#20159;&#32654;&#20803;&#20132;&#26131;&#30340;&#25195;&#25551;&#25968;&#25454;&#65292;&#24182;&#21033;&#29992;&#22312;2018&#24180;&#33267;2021&#24180;&#20043;&#38388;&#20845;&#27425;&#26368;&#20302;&#24037;&#36164;&#30340;&#28072;&#24133;&#20013;&#20225;&#19994;&#26368;&#20302;&#24037;&#36164;&#26333;&#38706;&#30340;&#22320;&#29702;&#24046;&#24322;&#12290;&#24403;&#24573;&#30053;&#25209;&#21457;&#25104;&#26412;&#25928;&#24212;&#26102;&#65292;&#25105;&#21457;&#29616;&#38646;&#21806;&#20215;&#26684;&#24377;&#24615;&#19982;&#29616;&#26377;&#25991;&#29486;&#19968;&#33268;&#65292;&#20294;&#19968;&#26086;&#32771;&#34385;&#21040;&#25209;&#21457;&#25104;&#26412;&#25928;&#24212;&#65292;&#38646;&#21806;&#20215;&#26684;&#24377;&#24615;&#20250;&#22686;&#21152;&#19968;&#20493;&#20197;&#19978;&#12290;&#38646;&#21806;&#21033;&#28070;&#29575;&#19981;&#20250;&#35843;&#25972;&#20197;&#36866;&#24212;&#25209;&#21457;&#25104;&#26412;&#20914;&#20987;&#65292;&#34920;&#26126;&#23436;&#20840;&#36716;&#23233;&#20102;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
A growing empirical literature finds that firms pass the cost of minimum wage hikes onto consumers via higher retail prices. Yet, little is known about minimum wage effects on wholesale prices and whether retailers face a wholesale cost shock in addition to the labor cost shock. I exploit the unique market structure of Washington state's legal recreational cannabis industry to investigate minimum wage pass-through to wholesale and retail prices. In a dynamic difference-in-differences framework, I utilize scanner data on $6 billion of transactions across the supply chain and leverage geographic variation in firms' minimum wage exposure across six minimum wage hikes between 2018 and 2021. When ignoring wholesale cost effects, I find retail pass-through elasticities consistent with existing literature -- yet retail pass-through elasticities more than double once wholesale cost effects are accounted for. Retail markups do not adjust to the wholesale cost shock, indicating a full pass-throu
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#28145;&#24230;&#23398;&#20064;&#25216;&#26415;&#23545;&#39640;&#39057;&#35746;&#21333;&#31807;&#24066;&#22330;&#20013;&#30340;&#22238;&#25253;&#21487;&#39044;&#27979;&#24615;&#36827;&#34892;&#20102;&#22823;&#35268;&#27169;&#20998;&#26512;&#65292;&#21457;&#29616;&#22312;&#39640;&#39057;&#29575;&#20013;&#65292;&#20013;&#38388;&#20215;&#26684;&#22238;&#25253;&#30340;&#21487;&#39044;&#27979;&#24615;&#26222;&#36941;&#23384;&#22312;&#65292;&#24182;&#19988;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#30340;&#24615;&#33021;&#21462;&#20915;&#20110;&#35746;&#21333;&#31807;&#34920;&#31034;&#30340;&#36873;&#25321;&#12290;</title><link>http://arxiv.org/abs/2211.13777</link><description>&lt;p&gt;
&#35746;&#21333;&#31807;&#24066;&#22330;&#20013;&#30701;&#26399;&#22238;&#25253;&#30340;&#21487;&#39044;&#27979;&#24615;&#65306;&#28145;&#24230;&#23398;&#20064;&#35270;&#35282;
&lt;/p&gt;
&lt;p&gt;
The Short-Term Predictability of Returns in Order Book Markets: a Deep Learning Perspective. (arXiv:2211.13777v3 [q-fin.CP] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.13777
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#28145;&#24230;&#23398;&#20064;&#25216;&#26415;&#23545;&#39640;&#39057;&#35746;&#21333;&#31807;&#24066;&#22330;&#20013;&#30340;&#22238;&#25253;&#21487;&#39044;&#27979;&#24615;&#36827;&#34892;&#20102;&#22823;&#35268;&#27169;&#20998;&#26512;&#65292;&#21457;&#29616;&#22312;&#39640;&#39057;&#29575;&#20013;&#65292;&#20013;&#38388;&#20215;&#26684;&#22238;&#25253;&#30340;&#21487;&#39044;&#27979;&#24615;&#26222;&#36941;&#23384;&#22312;&#65292;&#24182;&#19988;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#30340;&#24615;&#33021;&#21462;&#20915;&#20110;&#35746;&#21333;&#31807;&#34920;&#31034;&#30340;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;&#28145;&#24230;&#23398;&#20064;&#25216;&#26415;&#23545;&#39640;&#39057;&#22238;&#25253;&#20013;&#22522;&#20110;&#35746;&#21333;&#31807;&#30340;&#21487;&#39044;&#27979;&#24615;&#36827;&#34892;&#20102;&#31995;&#32479;&#30340;&#22823;&#35268;&#27169;&#20998;&#26512;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#12289;&#31283;&#20581;&#30340;&#35746;&#21333;&#31807;&#34920;&#31034;&#26041;&#27861;&#8212;&#8212;&#25104;&#20132;&#37327;&#34920;&#31034;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#24191;&#27867;&#30340;&#32463;&#39564;&#23454;&#39564;&#65292;&#25506;&#35752;&#20102;&#21508;&#31181;&#20851;&#20110;&#21487;&#39044;&#27979;&#24615;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#21487;&#39044;&#27979;&#24615;&#30340;&#25552;&#21069;&#26102;&#26399;&#12289;&#31283;&#20581;&#25968;&#25454;&#34920;&#31034;&#30340;&#37325;&#35201;&#24615;&#12289;&#22810;&#26102;&#38388;&#36328;&#24230;&#24314;&#27169;&#30340;&#20248;&#21183;&#20197;&#21450;&#26222;&#36941;&#20132;&#26131;&#27169;&#24335;&#30340;&#23384;&#22312;&#12290;&#25105;&#20204;&#20351;&#29992;&#27169;&#22411;&#32622;&#20449;&#21306;&#38388;&#25552;&#20379;&#20102;&#19968;&#31181;&#24418;&#24335;&#21270;&#30340;&#32479;&#35745;&#25512;&#26029;&#26694;&#26550;&#65292;&#29305;&#21035;&#36866;&#29992;&#20110;&#22238;&#31572;&#36825;&#20123;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#39640;&#39057;&#29575;&#20013;&#65292;&#20013;&#38388;&#20215;&#26684;&#22238;&#25253;&#30340;&#21487;&#39044;&#27979;&#24615;&#19981;&#20165;&#23384;&#22312;&#65292;&#32780;&#19988;&#26222;&#36941;&#23384;&#22312;&#12290;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#30340;&#24615;&#33021;&#24378;&#28872;&#20381;&#36182;&#20110;&#35746;&#21333;&#31807;&#34920;&#31034;&#30340;&#36873;&#25321;&#65292;&#22312;&#36825;&#26041;&#38754;&#65292;&#25104;&#20132;&#37327;&#34920;&#31034;&#20284;&#20046;&#20855;&#26377;&#22810;&#31181;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we conduct a systematic large-scale analysis of order book-driven predictability in high-frequency returns by leveraging deep learning techniques. First, we introduce a new and robust representation of the order book, the volume representation. Next, we carry out an extensive empirical experiment to address various questions regarding predictability. We investigate if and how far ahead there is predictability, the importance of a robust data representation, the advantages of multi-horizon modeling, and the presence of universal trading patterns. We use model confidence sets, which provide a formalized statistical inference framework particularly well suited to answer these questions. Our findings show that at high frequencies predictability in mid-price returns is not just present, but ubiquitous. The performance of the deep learning models is strongly dependent on the choice of order book representation, and in this respect, the volume representation appears to have mul
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#26089;&#26399;&#27745;&#26579;&#26292;&#38706;&#23545;&#20010;&#20307;&#30340;&#38271;&#26399;&#24433;&#21709;&#65292;&#21457;&#29616;&#21463;&#38654;&#38718;&#24433;&#21709;&#30340;&#20010;&#20307;&#26234;&#21147;&#19979;&#38477;&#12289;&#21628;&#21560;&#20581;&#24247;&#29366;&#20917;&#36739;&#24046;&#65292;&#24182;&#21487;&#33021;&#23548;&#33268;&#21463;&#25945;&#32946;&#24180;&#38480;&#20943;&#23569;&#12290;</title><link>http://arxiv.org/abs/2202.11785</link><description>&lt;p&gt;
&#26089;&#26399;&#27745;&#26579;&#26292;&#38706;&#30340;&#38271;&#26399;&#24433;&#21709;&#65306;&#26469;&#33258;&#20262;&#25958;&#38654;&#38718;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
The Long-Term Effects of Early-Life Pollution Exposure: Evidence from the London Smog. (arXiv:2202.11785v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.11785
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26089;&#26399;&#27745;&#26579;&#26292;&#38706;&#23545;&#20010;&#20307;&#30340;&#38271;&#26399;&#24433;&#21709;&#65292;&#21457;&#29616;&#21463;&#38654;&#38718;&#24433;&#21709;&#30340;&#20010;&#20307;&#26234;&#21147;&#19979;&#38477;&#12289;&#21628;&#21560;&#20581;&#24247;&#29366;&#20917;&#36739;&#24046;&#65292;&#24182;&#21487;&#33021;&#23548;&#33268;&#21463;&#25945;&#32946;&#24180;&#38480;&#20943;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;&#22823;&#35268;&#27169;&#33521;&#22269;&#38431;&#21015;&#30740;&#31350;&#20102;&#26089;&#26399;&#27745;&#26579;&#26292;&#38706;&#23545;&#20010;&#20307;&#30340;&#20154;&#21147;&#36164;&#26412;&#21644;&#32769;&#24180;&#20581;&#24247;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#27604;&#36739;&#20102;&#22312;1952&#24180;12&#26376;&#22312;&#32974;&#20799;&#26399;&#25110;&#23156;&#20799;&#26399;&#26292;&#38706;&#20110;&#20262;&#25958;&#38654;&#38718;&#30340;&#20010;&#20307;&#19982;&#38654;&#38718;&#20043;&#21518;&#20986;&#29983;&#20197;&#21450;&#21516;&#19968;&#26102;&#38388;&#20294;&#26410;&#21463;&#24433;&#21709;&#22320;&#21306;&#20986;&#29983;&#30340;&#20010;&#20307;&#12290;&#25105;&#20204;&#21457;&#29616;&#37027;&#20123;&#26292;&#38706;&#20110;&#38654;&#38718;&#30340;&#20010;&#20307;&#26234;&#21147;&#19979;&#38477;&#24182;&#19988;&#21628;&#21560;&#20581;&#24247;&#29366;&#20917;&#36739;&#24046;&#65292;&#21516;&#26102;&#36824;&#26377;&#19968;&#20123;&#35777;&#25454;&#34920;&#26126;&#21463;&#25945;&#32946;&#24180;&#38480;&#20943;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper uses a large UK cohort to investigate the impact of early-life pollution exposure on individuals' human capital and health outcomes in older age. We compare individuals who were exposed to the London smog in December 1952 whilst in utero or in infancy to those born after the smog and those born at the same time but in unaffected areas. We find that those exposed to the smog have substantially lower fluid intelligence and worse respiratory health, with some evidence of a reduction in years of schooling.
&lt;/p&gt;</description></item><item><title>&#25991;&#31456;&#20351;&#29992;&#32929;&#19996;&#22823;&#20250;&#26102;&#38388;&#24046;&#24322;&#30340;&#26041;&#27861;&#30740;&#31350;&#20102;&#32929;&#19996;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#20294;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#36825;&#31181;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;</title><link>http://arxiv.org/abs/2103.12138</link><description>&lt;p&gt;
&#36861;&#27714;&#32929;&#19996;&#20215;&#20540;&#30340;&#20849;&#21516;&#25104;&#26412;
&lt;/p&gt;
&lt;p&gt;
The Shared Cost of Pursuing Shareholder Value. (arXiv:2103.12138v9 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2103.12138
&lt;/p&gt;
&lt;p&gt;
&#25991;&#31456;&#20351;&#29992;&#32929;&#19996;&#22823;&#20250;&#26102;&#38388;&#24046;&#24322;&#30340;&#26041;&#27861;&#30740;&#31350;&#20102;&#32929;&#19996;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#20294;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#36825;&#31181;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37319;&#29992;&#20934;&#23454;&#39564;&#24615;&#30340;&#26041;&#27861;&#65292;&#26681;&#25454;&#20844;&#21496;&#32929;&#19996;&#22823;&#20250;&#65288;AGMs&#65289;&#30340;&#26102;&#38388;&#24046;&#24322;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#21487;&#31227;&#26893;&#30340;&#26694;&#26550;&#65292;&#25512;&#26029;&#32929;&#19996;&#30340;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;covid&#30456;&#20851;&#25424;&#36192;&#12289;&#26368;&#36817;&#38024;&#23545;&#20420;&#32599;&#26031;&#30340;&#31169;&#20154;&#21046;&#35009;&#20197;&#21450;&#20844;&#21496;2012-19&#24180;&#30340;&#21033;&#20182;&#31435;&#22330;&#12290;AGMs&#30340;&#23186;&#20307;&#26333;&#20809;&#24102;&#26469;&#30340;&#24418;&#35937;&#25910;&#30410;&#65292;&#20351;&#24471;&#19982;&#20844;&#21496;&#21516;&#20041;&#30340;&#32929;&#19996;&#65288;&#22914;&#23494;&#20999;&#30456;&#20851;&#30340;&#20010;&#20154;&#65289;&#25903;&#25345;&#26114;&#36149;&#30340;&#21033;&#20182;&#21464;&#38761;&#65292;&#32780;&#20854;&#20182;&#32929;&#19996;&#65288;&#22914;&#37329;&#34701;&#20844;&#21496;&#65289;&#21453;&#23545;&#36825;&#20123;&#21464;&#38761;&#12290;&#25903;&#25345;&#36825;&#20123;&#21464;&#38761;&#30340;&#24433;&#21709;&#20351;&#25910;&#30410;&#19979;&#38477;&#20102;30&#65285;&#65306;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
Using quasi-experimental variations from the timing of firms' Annual General Meetings (AGMs), we propose a portable framework to infer shareholders' preferences and influences on firms' prosocial decisions and apply it to covid-related donations, recent private sanctions on Russia, and firms' prosocial stances over 2012-19. Image gains from AGMs' media exposure drive shareholders synonymous with a firm, like closely-connected individuals, to support costly prosocial changes, while others, like financial corporations, oppose them. Influence supporting these changes lowers earnings by 30\%: pursuing the values of (some) shareholders has distributional costs, which the monitoring of large shareholders motivated by heterogeneous preferences could prevent.
&lt;/p&gt;</description></item><item><title>&#22312;&#22823;&#22411;&#37329;&#34701;&#24066;&#22330;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#8220;&#28040;&#22833;&#39118;&#38505;&#26080;&#36229;&#38480;&#20813;&#36153;&#21320;&#39184;&#8221;&#30340;&#27010;&#24565;&#65288;NAFLVR&#65289;&#65292;&#24182;&#35777;&#26126;&#20102;&#36164;&#20135;&#23450;&#20215;&#30340;&#22522;&#26412;&#23450;&#29702;&#65288;FTAP&#65289;&#12290;&#36825;&#20010;&#27010;&#24565;&#26159;&#32463;&#27982;&#19978;&#26377;&#24847;&#20041;&#30340;&#8220;&#26080;&#22871;&#21033;&#8221;&#26465;&#20214;&#65292;&#32780;&#19988;&#21644;&#20998;&#31163;&#24615;&#30340;&#23384;&#22312;&#26159;&#31561;&#20215;&#30340;&#12290;</title><link>http://arxiv.org/abs/1412.7562</link><description>&lt;p&gt;
&#20851;&#20110;&#22823;&#22411;&#37329;&#34701;&#24066;&#22330;&#22522;&#26412;&#23450;&#29702;&#30340;&#26032;&#35270;&#35282;
&lt;/p&gt;
&lt;p&gt;
A new perspective on the fundamental theorem of asset pricing for large financial markets. (arXiv:1412.7562v3 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1412.7562
&lt;/p&gt;
&lt;p&gt;
&#22312;&#22823;&#22411;&#37329;&#34701;&#24066;&#22330;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#8220;&#28040;&#22833;&#39118;&#38505;&#26080;&#36229;&#38480;&#20813;&#36153;&#21320;&#39184;&#8221;&#30340;&#27010;&#24565;&#65288;NAFLVR&#65289;&#65292;&#24182;&#35777;&#26126;&#20102;&#36164;&#20135;&#23450;&#20215;&#30340;&#22522;&#26412;&#23450;&#29702;&#65288;FTAP&#65289;&#12290;&#36825;&#20010;&#27010;&#24565;&#26159;&#32463;&#27982;&#19978;&#26377;&#24847;&#20041;&#30340;&#8220;&#26080;&#22871;&#21033;&#8221;&#26465;&#20214;&#65292;&#32780;&#19988;&#21644;&#20998;&#31163;&#24615;&#30340;&#23384;&#22312;&#26159;&#31561;&#20215;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22823;&#22411;&#37329;&#34701;&#24066;&#22330;&#30340;&#32972;&#26223;&#19979;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#8220;&#28040;&#22833;&#39118;&#38505;&#26080;&#36229;&#38480;&#20813;&#36153;&#21320;&#39184;&#8221;&#30340;&#27010;&#24565;&#65288;NAFLVR&#65289;&#65292;&#22312;&#36825;&#20010;&#27010;&#24565;&#19979;&#65292;&#25105;&#20204;&#21487;&#20197;&#35777;&#26126;&#22312;&#36164;&#20135;&#25968;&#30446;&#65288;&#29978;&#33267;&#26159;&#21487;&#25968;&#26080;&#31351;&#65289;&#26080;&#38480;&#30340;&#24066;&#22330;&#20013;&#30340;&#36164;&#20135;&#23450;&#20215;&#30340;&#22522;&#26412;&#23450;&#29702;&#65288;FTAP&#65289;&#65292;&#27604;&#22914;&#20538;&#21048;&#24066;&#22330;&#12290;&#25105;&#20204;&#22312;Y. Kabanov&#65288;1997&#65289;&#25152;&#35268;&#23450;&#30340;&#21487;&#34892;&#25237;&#36164;&#32452;&#21512;&#36130;&#23500;&#36807;&#31243;&#30340;&#19968;&#33324;&#35774;&#32622;&#19979;&#24037;&#20316;&#65292;&#36825;&#31181;&#35774;&#32622;&#22312;&#36830;&#25509;&#23646;&#24615;&#19978;&#25918;&#23485;&#20102;&#19968;&#23450;&#31243;&#24230;&#30340;&#21069;&#25552;&#26465;&#20214;&#65292;&#24182;&#26681;&#25454;&#22312;CT&#65288;2014&#65289;&#20013;&#24471;&#21040;&#30340;&#35777;&#26126;&#21464;&#20307;&#23558;FTAP&#20174;&#32463;&#20856;&#23567;&#24066;&#22330;&#24773;&#20917;&#25512;&#24191;&#21040;&#22823;&#22411;&#37329;&#34701;&#24066;&#22330;&#12290;&#22312;&#21487;&#25968;&#22810;&#20010;&#36164;&#20135;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#30340;&#35774;&#32622;&#21253;&#25324;M. De Donno&#31561;&#20154;&#65288;2005&#65289;&#32771;&#34385;&#30340;&#22823;&#22411;&#37329;&#34701;&#24066;&#22330;&#27169;&#22411;&#21450;&#20854;&#25277;&#35937;&#38598;&#25104;&#29702;&#35770;&#12290; NAFLVR&#30340;&#27010;&#24565;&#34987;&#35777;&#26126;&#26159;&#19968;&#20010;&#32463;&#27982;&#19978;&#26377;&#24847;&#20041;&#30340;&#8220;&#26080;&#22871;&#21033;&#8221;&#26465;&#20214;&#65288;&#23588;&#20854;&#19981;&#28041;&#21450;&#24369;$*$-&#38381;&#21512;&#65289;&#65292;&#32780;&#19988;&#23427;&#19982;&#20998;&#31163;&#24615;&#23384;&#22312;&#26159;&#31561;&#20215;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the context of large financial markets we formulate the notion of \emph{no asymptotic free lunch with vanishing risk} (NAFLVR), under which we can prove a version of the fundamental theorem of asset pricing (FTAP) in markets with an (even uncountably) infinite number of assets, as it is for instance the case in bond markets. We work in the general setting of admissible portfolio wealth processes as laid down by Y. Kabanov \cite{kab:97} under a substantially relaxed concatenation property and adapt the FTAP proof variant obtained in \cite{CT:14} for the classical small market situation to large financial markets. In the case of countably many assets, our setting includes the large financial market model considered by M. De Donno et al. \cite{DGP:05} and its abstract integration theory.  The notion of (NAFLVR) turns out to be an economically meaningful "no arbitrage" condition (in particular not involving weak-$*$-closures), and, (NAFLVR) is equivalent to the existence of a separating
&lt;/p&gt;</description></item></channel></rss>