<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21333;&#35843;&#20998;&#27573;&#24120;&#25968;&#25511;&#21046;&#31215;&#20998;&#26041;&#27861;&#26469;&#35299;&#20915;&#20004;&#22240;&#32032;&#19981;&#30830;&#23450;&#27874;&#21160;&#29575;&#27169;&#22411;&#20013;&#30340;HJB&#20559;&#24494;&#20998;&#26041;&#31243;&#12290;&#36890;&#36807;&#23558;HJB PDE&#20998;&#35299;&#20026;&#29420;&#31435;&#30340;&#32447;&#24615;&#20108;&#32500;PDE&#65292;&#24182;&#21033;&#29992;&#19982;&#36825;&#20123;PDE&#30456;&#20851;&#30340;Green&#20989;&#25968;&#30340;&#26174;&#24335;&#20844;&#24335;&#65292;&#25105;&#20204;&#21487;&#20197;&#26377;&#25928;&#22320;&#27714;&#35299;&#35813;&#26041;&#31243;&#12290;</title><link>https://arxiv.org/abs/2402.06840</link><description>&lt;p&gt;
&#20004;&#22240;&#32032;&#19981;&#30830;&#23450;&#27874;&#21160;&#29575;&#27169;&#22411;&#30340;&#21333;&#35843;&#20998;&#27573;&#24120;&#25968;&#25511;&#21046;&#31215;&#20998;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A monotone piecewise constant control integration approach for the two-factor uncertain volatility model
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.06840
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21333;&#35843;&#20998;&#27573;&#24120;&#25968;&#25511;&#21046;&#31215;&#20998;&#26041;&#27861;&#26469;&#35299;&#20915;&#20004;&#22240;&#32032;&#19981;&#30830;&#23450;&#27874;&#21160;&#29575;&#27169;&#22411;&#20013;&#30340;HJB&#20559;&#24494;&#20998;&#26041;&#31243;&#12290;&#36890;&#36807;&#23558;HJB PDE&#20998;&#35299;&#20026;&#29420;&#31435;&#30340;&#32447;&#24615;&#20108;&#32500;PDE&#65292;&#24182;&#21033;&#29992;&#19982;&#36825;&#20123;PDE&#30456;&#20851;&#30340;Green&#20989;&#25968;&#30340;&#26174;&#24335;&#20844;&#24335;&#65292;&#25105;&#20204;&#21487;&#20197;&#26377;&#25928;&#22320;&#27714;&#35299;&#35813;&#26041;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#19981;&#30830;&#23450;&#27874;&#21160;&#29575;&#27169;&#22411;&#20013;&#65292;&#20004;&#31181;&#36164;&#20135;&#26399;&#26435;&#21512;&#32422;&#30340;&#20215;&#26684;&#28385;&#36275;&#20855;&#26377;&#20132;&#21449;&#23548;&#25968;&#39033;&#30340;&#20108;&#32500;Hamilton-Jacobi-Bellman&#65288;HJB&#65289;&#20559;&#24494;&#20998;&#26041;&#31243;&#65288;PDE&#65289;&#12290;&#20256;&#32479;&#26041;&#27861;&#20027;&#35201;&#28041;&#21450;&#26377;&#38480;&#24046;&#20998;&#21644;&#31574;&#30053;&#36845;&#20195;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#19988;&#26356;&#31616;&#21270;&#30340;&#8220;&#20998;&#35299;&#21644;&#31215;&#20998;&#65292;&#28982;&#21518;&#20248;&#21270;&#8221;&#30340;&#26041;&#27861;&#26469;&#35299;&#20915;&#19978;&#36848;&#30340;HJB PDE&#12290;&#22312;&#27599;&#20010;&#26102;&#38388;&#27493;&#20869;&#65292;&#25105;&#20204;&#30340;&#31574;&#30053;&#37319;&#29992;&#20998;&#27573;&#24120;&#25968;&#25511;&#21046;&#65292;&#23558;HJB PDE&#20998;&#35299;&#20026;&#29420;&#31435;&#30340;&#32447;&#24615;&#20108;&#32500;PDE&#12290;&#21033;&#29992;&#24050;&#30693;&#30340;&#19982;&#36825;&#20123;PDE&#30456;&#20851;&#30340;Green&#20989;&#25968;&#30340;Fourier&#21464;&#25442;&#30340;&#38381;&#24335;&#34920;&#36798;&#24335;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#36825;&#20123;&#20989;&#25968;&#30340;&#26174;&#24335;&#20844;&#24335;&#12290;&#30001;&#20110;Green&#20989;&#25968;&#26159;&#38750;&#36127;&#30340;&#65292;&#23558;PDE&#36716;&#21270;&#20026;&#20108;&#32500;&#21367;&#31215;&#31215;&#20998;&#30340;&#35299;&#21487;&#20197;b
&lt;/p&gt;
&lt;p&gt;
Prices of option contracts on two assets within uncertain volatility models for worst and best-case scenarios satisfy a two-dimensional Hamilton-Jacobi-Bellman (HJB) partial differential equation (PDE) with cross derivatives terms. Traditional methods mainly involve finite differences and policy iteration. This "discretize, then optimize" paradigm requires complex rotations of computational stencils for monotonicity.   This paper presents a novel and more streamlined "decompose and integrate, then optimize" approach to tackle the aforementioned HJB PDE. Within each timestep, our strategy employs a piecewise constant control, breaking down the HJB PDE into independent linear two-dimensional PDEs. Using known closed-form expressions for the Fourier transforms of the Green's functions associated with these PDEs, we determine an explicit formula for these functions. Since the Green's functions are non-negative, the solutions to the PDEs, cast as two-dimensional convolution integrals, can b
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#22312;Merton&#38382;&#39064;&#20013;&#22686;&#21152;&#22522;&#20934;&#36319;&#36394;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#25918;&#26494;&#30340;&#36319;&#36394;&#20844;&#24335;&#65292;&#24182;&#37319;&#29992;&#21453;&#23556;&#36741;&#21161;&#29366;&#24577;&#36807;&#31243;&#65292;&#36890;&#36807;&#21452;&#37325;&#36716;&#25442;&#21644;&#27010;&#29575;&#34920;&#31034;&#65292;&#24471;&#21040;&#20102;&#31561;&#25928;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#65292;&#24182;&#19988;&#21487;&#20197;&#26126;&#30830;&#22320;&#35299;&#20915;&#12290;&#36890;&#36807;&#36825;&#31181;&#26041;&#27861;&#65292;&#25105;&#20204;&#21487;&#20197;&#28165;&#26224;&#22320;&#20102;&#35299;&#36164;&#20135;&#30340;&#32452;&#25104;&#21644;&#32489;&#25928;&#12290;</title><link>http://arxiv.org/abs/2304.10802</link><description>&lt;p&gt;
&#19968;&#31181;&#25299;&#23637;&#30340;Merton&#38382;&#39064;&#35299;&#20915;&#20102;&#25918;&#23485;&#22522;&#20934;&#36319;&#36394;&#30340;&#38590;&#39064;
&lt;/p&gt;
&lt;p&gt;
An extended Merton problem with relaxed benchmark tracking. (arXiv:2304.10802v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10802
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;Merton&#38382;&#39064;&#20013;&#22686;&#21152;&#22522;&#20934;&#36319;&#36394;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#25918;&#26494;&#30340;&#36319;&#36394;&#20844;&#24335;&#65292;&#24182;&#37319;&#29992;&#21453;&#23556;&#36741;&#21161;&#29366;&#24577;&#36807;&#31243;&#65292;&#36890;&#36807;&#21452;&#37325;&#36716;&#25442;&#21644;&#27010;&#29575;&#34920;&#31034;&#65292;&#24471;&#21040;&#20102;&#31561;&#25928;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#65292;&#24182;&#19988;&#21487;&#20197;&#26126;&#30830;&#22320;&#35299;&#20915;&#12290;&#36890;&#36807;&#36825;&#31181;&#26041;&#27861;&#65292;&#25105;&#20204;&#21487;&#20197;&#28165;&#26224;&#22320;&#20102;&#35299;&#36164;&#20135;&#30340;&#32452;&#25104;&#21644;&#32489;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;Merton&#30340;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#21644;&#28040;&#36153;&#38382;&#39064;&#65292;&#20854;&#25193;&#23637;&#24418;&#24335;&#21253;&#25324;&#36319;&#36394;&#30001;&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;&#25551;&#36848;&#30340;&#22522;&#20934;&#36807;&#31243;&#12290;&#25105;&#20204;&#32771;&#34385;&#19968;&#31181;&#25918;&#26494;&#30340;&#36319;&#36394;&#20844;&#24335;&#65292;&#21363;&#36164;&#20135;&#36807;&#31243;&#36890;&#36807;&#34394;&#25311;&#36164;&#26412;&#27880;&#20837;&#34920;&#29616;&#20248;&#20110;&#22806;&#37096;&#22522;&#20934;&#12290;&#22522;&#37329;&#32463;&#29702;&#26088;&#22312;&#26368;&#22823;&#21270;&#28040;&#36153;&#30340;&#39044;&#26399;&#25928;&#29992;&#65292;&#20943;&#21435;&#36164;&#26412;&#27880;&#20837;&#25104;&#26412;&#65292;&#21518;&#32773;&#20063;&#21487;&#20197;&#35270;&#20026;&#30456;&#23545;&#20110;&#22522;&#20934;&#30340;&#39044;&#26399;&#26368;&#22823;&#32570;&#21475;&#12290;&#36890;&#36807;&#24341;&#20837;&#19968;&#20010;&#20855;&#26377;&#21453;&#23556;&#30340;&#36741;&#21161;&#29366;&#24577;&#36807;&#31243;&#65292;&#25105;&#20204;&#36890;&#36807;&#21452;&#37325;&#36716;&#25442;&#21644;&#27010;&#29575;&#34920;&#31034;&#21046;&#23450;&#21644;&#35299;&#20915;&#20102;&#31561;&#25928;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#65292;&#20854;&#20013;&#23545;&#20598;PDE&#21487;&#20197;&#26126;&#30830;&#22320;&#35299;&#20915;&#12290;&#20973;&#20511;&#38381;&#24335;&#32467;&#26524;&#30340;&#21147;&#37327;&#65292;&#25105;&#20204;&#21487;&#20197;&#23548;&#20986;&#24182;&#39564;&#35777;&#21407;&#22987;&#25511;&#21046;&#38382;&#39064;&#30340;&#21322;&#35299;&#26512;&#24418;&#24335;&#30340;&#21453;&#39304;&#26368;&#20248;&#25511;&#21046;&#65292;&#20174;&#32780;&#20351;&#25105;&#20204;&#33021;&#22815;&#28165;&#26224;&#22320;&#20102;&#35299;&#36164;&#20135;&#30340;&#32452;&#25104;&#21644;&#32489;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies a Merton's optimal portfolio and consumption problem in an extended formulation incorporating the tracking of a benchmark process described by a geometric Brownian motion. We consider a relaxed tracking formulation such that that the wealth process compensated by a fictitious capital injection outperforms the external benchmark at all times. The fund manager aims to maximize the expected utility of consumption deducted by the cost of the capital injection, where the latter term can also be regarded as the expected largest shortfall with reference to the benchmark. By introducing an auxiliary state process with reflection, we formulate and tackle an equivalent stochastic control problem by means of the dual transform and probabilistic representation, where the dual PDE can be solved explicitly. On the strength of the closed-form results, we can derive and verify the feedback optimal control in the semi-analytical form for the primal control problem, allowing us to obs
&lt;/p&gt;</description></item><item><title>&#35774;&#35745;&#20102;&#19968;&#20010;DL&#27169;&#22411;&#26694;&#26550;&#65292;&#21517;&#20026;&#22240;&#26524;&#31070;&#32463;&#31639;&#23376;&#65288;CNO&#65289;&#65292;&#20197;&#36924;&#36817;&#22240;&#26524;&#31639;&#23376;&#65288;CO&#65289;&#65292;&#24182;&#35777;&#26126;&#20102;CNO&#27169;&#22411;&#21487;&#20197;&#22312;&#32039;&#33268;&#38598;&#19978;&#19968;&#33268;&#36924;&#36817;H&#246;lder&#25110;&#24179;&#28369;&#36857;&#31867;&#31639;&#23376;&#12290;</title><link>http://arxiv.org/abs/2210.13300</link><description>&lt;p&gt;
&#35774;&#35745;&#36890;&#29992;&#22240;&#26524;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65306;&#20197;&#38543;&#26426;&#20998;&#26512;&#20013;&#30340;&#26080;&#38480;&#32500;&#21160;&#24577;&#31995;&#32479;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
Designing Universal Causal Deep Learning Models: The Case of Infinite-Dimensional Dynamical Systems from Stochastic Analysis. (arXiv:2210.13300v2 [math.DS] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.13300
&lt;/p&gt;
&lt;p&gt;
&#35774;&#35745;&#20102;&#19968;&#20010;DL&#27169;&#22411;&#26694;&#26550;&#65292;&#21517;&#20026;&#22240;&#26524;&#31070;&#32463;&#31639;&#23376;&#65288;CNO&#65289;&#65292;&#20197;&#36924;&#36817;&#22240;&#26524;&#31639;&#23376;&#65288;CO&#65289;&#65292;&#24182;&#35777;&#26126;&#20102;CNO&#27169;&#22411;&#21487;&#20197;&#22312;&#32039;&#33268;&#38598;&#19978;&#19968;&#33268;&#36924;&#36817;H&#246;lder&#25110;&#24179;&#28369;&#36857;&#31867;&#31639;&#23376;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22240;&#26524;&#31639;&#23376;&#65288;CO&#65289;&#22312;&#24403;&#20195;&#38543;&#26426;&#20998;&#26512;&#20013;&#25198;&#28436;&#30528;&#37325;&#35201;&#35282;&#33394;&#65292;&#20363;&#22914;&#21508;&#31181;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#30340;&#35299;&#31639;&#23376;&#12290;&#28982;&#32780;&#65292;&#30446;&#21069;&#36824;&#27809;&#26377;&#19968;&#20010;&#33021;&#22815;&#36924;&#36817;CO&#30340;&#28145;&#24230;&#23398;&#20064;&#65288;DL&#65289;&#27169;&#22411;&#30340;&#35268;&#33539;&#26694;&#26550;&#12290;&#26412;&#25991;&#36890;&#36807;&#24341;&#20837;&#19968;&#20010;DL&#27169;&#22411;&#35774;&#35745;&#26694;&#26550;&#26469;&#25552;&#20986;&#19968;&#20010;&#8220;&#20960;&#20309;&#24863;&#30693;&#8221;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#35813;&#26694;&#26550;&#20197;&#21512;&#36866;&#30340;&#26080;&#38480;&#32500;&#32447;&#24615;&#24230;&#37327;&#31354;&#38388;&#20026;&#36755;&#20837;&#65292;&#24182;&#36820;&#22238;&#36866;&#24212;&#36825;&#20123;&#32447;&#24615;&#20960;&#20309;&#30340;&#36890;&#29992;&#36830;&#32493;&#24207;&#21015;DL&#27169;&#22411;&#12290;&#25105;&#20204;&#31216;&#36825;&#20123;&#27169;&#22411;&#20026;&#22240;&#26524;&#31070;&#32463;&#31639;&#23376;&#65288;CNO&#65289;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#26694;&#26550;&#25152;&#20135;&#29983;&#30340;&#27169;&#22411;&#21487;&#20197;&#22312;&#32039;&#33268;&#38598;&#19978;&#21644;&#36328;&#20219;&#24847;&#26377;&#38480;&#26102;&#38388;&#35270;&#37326;&#19978;&#19968;&#33268;&#36924;&#36817;H&#246;lder&#25110;&#24179;&#28369;&#36857;&#31867;&#31639;&#23376;&#65292;&#36825;&#20123;&#31639;&#23376;&#22240;&#26524;&#22320;&#26144;&#23556;&#32473;&#23450;&#32447;&#24615;&#24230;&#37327;&#31354;&#38388;&#20043;&#38388;&#30340;&#24207;&#21015;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#25581;&#31034;&#20102;&#20851;&#20110;CNO&#30340;&#28508;&#22312;&#29366;&#24577;&#31354;&#38388;&#32500;&#24230;&#30340;&#26032;&#23450;&#37327;&#20851;&#31995;&#65292;&#29978;&#33267;&#23545;&#20110;&#65288;&#32463;&#20856;&#30340;&#65289;&#26377;&#38480;&#32500;DL&#27169;&#22411;&#20063;&#26377;&#26032;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Causal operators (CO), such as various solution operators to stochastic differential equations, play a central role in contemporary stochastic analysis; however, there is still no canonical framework for designing Deep Learning (DL) models capable of approximating COs. This paper proposes a "geometry-aware'" solution to this open problem by introducing a DL model-design framework that takes suitable infinite-dimensional linear metric spaces as inputs and returns a universal sequential DL model adapted to these linear geometries. We call these models Causal Neural Operators (CNOs). Our main result states that the models produced by our framework can uniformly approximate on compact sets and across arbitrarily finite-time horizons H\"older or smooth trace class operators, which causally map sequences between given linear metric spaces. Our analysis uncovers new quantitative relationships on the latent state-space dimension of CNOs which even have new implications for (classical) finite-d
&lt;/p&gt;</description></item></channel></rss>