<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#37327;&#23376;&#27169;&#25311;&#31639;&#27861;&#65292;&#21363;&#22810;&#37325;&#20998;&#21106;&#27493;&#39588;&#37327;&#23376;&#34892;&#36208;&#31639;&#27861;&#65292;&#23427;&#32467;&#21512;&#20102;&#21442;&#25968;&#21270;&#37327;&#23376;&#30005;&#36335;&#21644;&#32463;&#20856;&#27169;&#25311;&#22120;&#19978;&#30340;&#21464;&#20998;&#27714;&#35299;&#22120;&#65292;&#21487;&#29992;&#20110;&#23398;&#20064;&#21644;&#21152;&#36733;&#22797;&#26434;&#27010;&#29575;&#20998;&#24067;&#12290;&#35813;&#31639;&#27861;&#36890;&#36807;&#24341;&#20837;&#22810;&#26234;&#33021;&#20307;&#20915;&#31574;&#36807;&#31243;&#65292;&#20351;&#20854;&#36866;&#29992;&#20110;&#37329;&#34701;&#24066;&#22330;&#24314;&#27169;&#65292;&#24182;&#23637;&#31034;&#20986;&#33391;&#22909;&#30340;&#28508;&#21147;&#12290;</title><link>http://arxiv.org/abs/2308.01844</link><description>&lt;p&gt;
&#37327;&#23376;&#37329;&#34701;&#27169;&#25311;&#21644;&#37327;&#23376;&#24577;&#21046;&#22791;&#30340;&#19968;&#31181;&#26032;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A novel approach for quantum financial simulation and quantum state preparation. (arXiv:2308.01844v1 [quant-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01844
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#37327;&#23376;&#27169;&#25311;&#31639;&#27861;&#65292;&#21363;&#22810;&#37325;&#20998;&#21106;&#27493;&#39588;&#37327;&#23376;&#34892;&#36208;&#31639;&#27861;&#65292;&#23427;&#32467;&#21512;&#20102;&#21442;&#25968;&#21270;&#37327;&#23376;&#30005;&#36335;&#21644;&#32463;&#20856;&#27169;&#25311;&#22120;&#19978;&#30340;&#21464;&#20998;&#27714;&#35299;&#22120;&#65292;&#21487;&#29992;&#20110;&#23398;&#20064;&#21644;&#21152;&#36733;&#22797;&#26434;&#27010;&#29575;&#20998;&#24067;&#12290;&#35813;&#31639;&#27861;&#36890;&#36807;&#24341;&#20837;&#22810;&#26234;&#33021;&#20307;&#20915;&#31574;&#36807;&#31243;&#65292;&#20351;&#20854;&#36866;&#29992;&#20110;&#37329;&#34701;&#24066;&#22330;&#24314;&#27169;&#65292;&#24182;&#23637;&#31034;&#20986;&#33391;&#22909;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37327;&#23376;&#24577;&#21046;&#22791;&#22312;&#37327;&#23376;&#35745;&#31639;&#21644;&#20449;&#24687;&#22788;&#29702;&#20013;&#33267;&#20851;&#37325;&#35201;&#12290;&#20934;&#30830;&#21487;&#38752;&#22320;&#21046;&#22791;&#29305;&#23450;&#30340;&#37327;&#23376;&#24577;&#23545;&#20110;&#21508;&#31181;&#24212;&#29992;&#33267;&#20851;&#37325;&#35201;&#12290;&#37327;&#23376;&#35745;&#31639;&#30340;&#19968;&#20010;&#26377;&#24076;&#26395;&#30340;&#24212;&#29992;&#26159;&#37327;&#23376;&#27169;&#25311;&#12290;&#36825;&#38656;&#35201;&#21046;&#22791;&#34920;&#31034;&#25105;&#20204;&#35201;&#27169;&#25311;&#31995;&#32479;&#30340;&#37327;&#23376;&#24577;&#12290;&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#27169;&#25311;&#31639;&#27861;&#65292;&#21363;&#22810;&#37325;&#20998;&#21106;&#27493;&#39588;&#37327;&#23376;&#34892;&#36208;&#65288;multi-SSQW&#65289;&#65292;&#37319;&#29992;&#20511;&#21161;&#21442;&#25968;&#21270;&#37327;&#23376;&#30005;&#36335;&#65288;PQC&#65289;&#21644;&#32463;&#20856;&#27169;&#25311;&#22120;&#19978;&#30340;&#21464;&#20998;&#27714;&#35299;&#22120;&#26469;&#23398;&#20064;&#21644;&#21152;&#36733;&#22797;&#26434;&#27010;&#29575;&#20998;&#24067;&#12290;&#22810;&#37325;&#20998;&#21106;&#27493;&#39588;&#37327;&#23376;&#34892;&#36208;&#31639;&#27861;&#26159;&#20998;&#21106;&#27493;&#39588;&#37327;&#23376;&#34892;&#36208;&#30340;&#25913;&#36827;&#29256;&#26412;&#65292;&#22686;&#21152;&#20102;&#22810;&#26234;&#33021;&#20307;&#20915;&#31574;&#36807;&#31243;&#65292;&#20351;&#20854;&#36866;&#29992;&#20110;&#37329;&#34701;&#24066;&#22330;&#24314;&#27169;&#12290;&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#22810;&#37325;&#20998;&#21106;&#27493;&#39588;&#37327;&#23376;&#34892;&#36208;&#31639;&#27861;&#30340;&#29702;&#35770;&#25551;&#36848;&#21644;&#23454;&#35777;&#35843;&#26597;&#65292;&#20197;&#35777;&#26126;&#20854;&#22312;&#27010;&#29575;&#20998;&#24067;&#27169;&#25311;&#20013;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
Quantum state preparation is vital in quantum computing and information processing. The ability to accurately and reliably prepare specific quantum states is essential for various applications. One of the promising applications of quantum computers is quantum simulation. This requires preparing a quantum state representing the system we are trying to simulate. This research introduces a novel simulation algorithm, the multi-Split-Steps Quantum Walk (multi-SSQW), designed to learn and load complicated probability distributions using parameterized quantum circuits (PQC) with a variational solver on classical simulators. The multi-SSQW algorithm is a modified version of the split-steps quantum walk, enhanced to incorporate a multi-agent decision-making process, rendering it suitable for modeling financial markets. The study provides theoretical descriptions and empirical investigations of the multi-SSQW algorithm to demonstrate its promising capabilities in probability distribution simula
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;Proof of Stake&#65288;PoS&#65289;&#21327;&#35758;&#20013;&#30340;&#20132;&#26131;&#21644;&#36130;&#23500;&#28436;&#21270;&#12290;&#36890;&#36807;&#20998;&#26512; PoS &#21327;&#35758;&#20013;&#27809;&#26377;&#20132;&#26131;&#30340;&#24773;&#20917;&#19979;&#30340;&#36130;&#23500;&#28436;&#21270;&#12289;&#32771;&#34385;&#30719;&#24037;&#30340;&#20132;&#26131;&#28608;&#21169;&#21644;&#31574;&#30053;&#65292;&#20197;&#21450;&#30740;&#31350; PoS &#20132;&#26131;&#29615;&#22659;&#20013;&#30719;&#24037;&#30340;&#38598;&#20307;&#34892;&#20026;&#65292;&#24635;&#32467;&#20102;&#35813;&#21327;&#35758;&#30340;&#32463;&#27982;&#29305;&#24449;&#12290;</title><link>http://arxiv.org/abs/2308.01803</link><description>&lt;p&gt;
Proof of Stake&#21327;&#35758;&#20013;&#30340;&#20132;&#26131;&#21644;&#36130;&#23500;&#28436;&#21270;
&lt;/p&gt;
&lt;p&gt;
Trading and wealth evolution in the Proof of Stake protocol. (arXiv:2308.01803v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01803
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;Proof of Stake&#65288;PoS&#65289;&#21327;&#35758;&#20013;&#30340;&#20132;&#26131;&#21644;&#36130;&#23500;&#28436;&#21270;&#12290;&#36890;&#36807;&#20998;&#26512; PoS &#21327;&#35758;&#20013;&#27809;&#26377;&#20132;&#26131;&#30340;&#24773;&#20917;&#19979;&#30340;&#36130;&#23500;&#28436;&#21270;&#12289;&#32771;&#34385;&#30719;&#24037;&#30340;&#20132;&#26131;&#28608;&#21169;&#21644;&#31574;&#30053;&#65292;&#20197;&#21450;&#30740;&#31350; PoS &#20132;&#26131;&#29615;&#22659;&#20013;&#30719;&#24037;&#30340;&#38598;&#20307;&#34892;&#20026;&#65292;&#24635;&#32467;&#20102;&#35813;&#21327;&#35758;&#30340;&#32463;&#27982;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;Proof of Stake&#65288;PoS&#65289;&#21306;&#22359;&#38142;&#30340;&#36234;&#26469;&#36234;&#24191;&#27867;&#37319;&#29992;&#65292;&#30740;&#31350;&#36825;&#31181;&#21306;&#22359;&#38142;&#21019;&#36896;&#30340;&#32463;&#27982;&#26159;&#21450;&#26102;&#30340;&#12290;&#22312;&#26412;&#31456;&#20013;&#65292;&#25105;&#20204;&#23558;&#35843;&#26597;&#20381;&#25454;PoS&#21327;&#35758;&#21457;&#34892;&#26032;&#24065;&#30340;&#21152;&#23494;&#36135;&#24065;&#20013;&#30340;&#20132;&#26131;&#21644;&#36130;&#23500;&#28436;&#21270;&#30340;&#26368;&#26032;&#36827;&#23637;&#12290;&#25105;&#20204;&#39318;&#20808;&#32771;&#34385;&#22312;&#27809;&#26377;&#20132;&#26131;&#30340;&#24773;&#20917;&#19979;PoS&#21327;&#35758;&#30340;&#36130;&#23500;&#28436;&#21270;&#65292;&#24182;&#20851;&#27880;&#21435;&#20013;&#24515;&#21270;&#30340;&#38382;&#39064;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#36890;&#36807;&#26368;&#20248;&#25511;&#21046;&#30340;&#35270;&#35282;&#32771;&#34385;&#27599;&#20010;&#30719;&#24037;&#30340;&#20132;&#26131;&#28608;&#21169;&#21644;&#31574;&#30053;&#65292;&#30719;&#24037;&#38656;&#35201;&#26435;&#34913;PoS&#25366;&#30719;&#21644;&#20132;&#26131;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#22343;&#22330;&#27169;&#22411;&#30740;&#31350;&#22312;PoS&#20132;&#26131;&#29615;&#22659;&#20013;&#30719;&#24037;&#30340;&#38598;&#20307;&#34892;&#20026;&#12290;&#22312;&#25105;&#20204;&#30340;&#30740;&#31350;&#20013;&#20351;&#29992;&#20102;&#38543;&#26426;&#21644;&#20998;&#26512;&#24037;&#20855;&#12290;&#21516;&#26102;&#36824;&#25552;&#20986;&#20102;&#19968;&#31995;&#21015;&#26410;&#35299;&#20915;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
With the increasing adoption of the Proof of Stake (PoS) blockchain, it is timely to study the economy created by such blockchain. In this chapter, we will survey recent progress on the trading and wealth evolution in a cryptocurrency where the new coins are issued according to the PoS protocol. We first consider the wealth evolution in the PoS protocol assuming no trading, and focus on the problem of decentralisation. Next we consider each miner's trading incentive and strategy through the lens of optimal control, where the miner needs to trade off PoS mining and trading. Finally, we study the collective behavior of the miners in a PoS trading environment by a mean field model. We use both stochastic and analytic tools in our study. A list of open problems are also presented.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19977;&#31181;&#34913;&#37327;&#20351;&#29992;&#26234;&#33021;&#31995;&#32479;&#26102;&#36861;&#28335;&#20154;&#31867;&#36131;&#20219;&#30340;&#26041;&#27861;&#65292;&#21253;&#25324;&#23545;&#20154;&#31867;&#19982;&#31995;&#32479;&#37325;&#22797;&#20132;&#20114;&#30340;&#37327;&#21270;&#65292;&#23545;&#20915;&#31574;&#20449;&#24687;&#24418;&#25104;&#20013;&#20154;&#31867;&#29420;&#29305;&#36129;&#29486;&#30340;&#37327;&#21270;&#65292;&#20197;&#21450;&#23545;&#20154;&#31867;&#34892;&#21160;&#21512;&#29702;&#24615;&#30340;&#37327;&#21270;&#12290;</title><link>http://arxiv.org/abs/2308.01752</link><description>&lt;p&gt;
&#23545;&#26234;&#33021;&#31995;&#32479;&#20013;&#30340;&#20154;&#31867;&#36861;&#28335;&#36131;&#20219;&#36827;&#34892;&#37327;&#21270;
&lt;/p&gt;
&lt;p&gt;
Quantifying Retrospective Human Responsibility in Intelligent Systems. (arXiv:2308.01752v1 [cs.HC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01752
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19977;&#31181;&#34913;&#37327;&#20351;&#29992;&#26234;&#33021;&#31995;&#32479;&#26102;&#36861;&#28335;&#20154;&#31867;&#36131;&#20219;&#30340;&#26041;&#27861;&#65292;&#21253;&#25324;&#23545;&#20154;&#31867;&#19982;&#31995;&#32479;&#37325;&#22797;&#20132;&#20114;&#30340;&#37327;&#21270;&#65292;&#23545;&#20915;&#31574;&#20449;&#24687;&#24418;&#25104;&#20013;&#20154;&#31867;&#29420;&#29305;&#36129;&#29486;&#30340;&#37327;&#21270;&#65292;&#20197;&#21450;&#23545;&#20154;&#31867;&#34892;&#21160;&#21512;&#29702;&#24615;&#30340;&#37327;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26234;&#33021;&#31995;&#32479;&#24050;&#25104;&#20026;&#25105;&#20204;&#29983;&#27963;&#20013;&#30340;&#37325;&#35201;&#32452;&#25104;&#37096;&#20998;&#12290;&#22312;&#19982;&#36825;&#20123;&#31995;&#32479;&#30340;&#20114;&#21160;&#20013;&#65292;&#20154;&#31867;&#23545;&#32467;&#26524;&#30340;&#36131;&#20219;&#21464;&#24471;&#27169;&#31946;&#65292;&#22240;&#20026;&#20449;&#24687;&#33719;&#21462;&#12289;&#20915;&#31574;&#21644;&#34892;&#21160;&#23454;&#26045;&#30340;&#37096;&#20998;&#21487;&#33021;&#30001;&#20154;&#31867;&#21644;&#31995;&#32479;&#20849;&#21516;&#23436;&#25104;&#12290;&#22312;&#23548;&#33268;&#19981;&#21033;&#32467;&#26524;&#30340;&#20107;&#20214;&#20013;&#65292;&#30830;&#23450;&#20154;&#31867;&#22240;&#26524;&#36131;&#20219;&#23588;&#20026;&#37325;&#35201;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19977;&#31181;&#34913;&#37327;&#20351;&#29992;&#26234;&#33021;&#31995;&#32479;&#26102;&#30340;&#36861;&#28335;&#20154;&#31867;&#22240;&#26524;&#36131;&#20219;&#30340;&#26041;&#27861;&#12290; &#31532;&#19968;&#31181;&#26041;&#27861;&#28041;&#21450;&#20154;&#31867;&#19982;&#31995;&#32479;&#30340;&#37325;&#22797;&#20132;&#20114;&#12290;&#21033;&#29992;&#20449;&#24687;&#35770;&#65292;&#23427;&#37327;&#21270;&#20102;&#20154;&#31867;&#23545;&#36807;&#21435;&#20107;&#20214;&#32467;&#26524;&#30340;&#24179;&#22343;&#29420;&#29305;&#36129;&#29486;&#12290;&#31532;&#20108;&#21644;&#31532;&#19977;&#31181;&#26041;&#27861;&#20998;&#21035;&#28041;&#21450;&#20154;&#31867;&#22312;&#19982;&#26234;&#33021;&#31995;&#32479;&#30340;&#21333;&#27425;&#36807;&#21435;&#20132;&#20114;&#20013;&#30340;&#22240;&#26524;&#36131;&#20219;&#12290;&#23427;&#20204;&#20998;&#21035;&#37327;&#21270;&#20102;&#20154;&#31867;&#22312;&#24418;&#25104;&#20915;&#31574;&#25152;&#20351;&#29992;&#30340;&#20449;&#24687;&#26041;&#38754;&#30340;&#29420;&#29305;&#36129;&#29486;&#20197;&#21450;&#20154;&#31867;&#23454;&#26045;&#34892;&#21160;&#30340;&#21512;&#29702;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Intelligent systems have become a major part of our lives. Human responsibility for outcomes becomes unclear in the interaction with these systems, as parts of information acquisition, decision-making, and action implementation may be carried out jointly by humans and systems. Determining human causal responsibility with intelligent systems is particularly important in events that end with adverse outcomes. We developed three measures of retrospective human causal responsibility when using intelligent systems. The first measure concerns repetitive human interactions with a system. Using information theory, it quantifies the average human's unique contribution to the outcomes of past events. The second and third measures concern human causal responsibility in a single past interaction with an intelligent system. They quantify, respectively, the unique human contribution in forming the information used for decision-making and the reasonability of the actions that the human carried out. T
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36335;&#24452;&#38452;&#24433;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#65292;&#21487;&#20197;&#26681;&#25454;&#20219;&#20309;&#29983;&#25104;&#27169;&#22411;&#23545;&#26410;&#26469;&#36335;&#24452;&#36827;&#34892;&#39044;&#27979;&#65292;&#24182;&#36890;&#36807;&#23545;&#29983;&#25104;&#30340;&#20215;&#26684;&#36335;&#24452;&#36827;&#34892;&#24179;&#22343;&#26469;&#23454;&#29616;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#20135;&#29983;&#26368;&#20808;&#36827;&#30340;&#26410;&#26469;&#23454;&#29616;&#27874;&#21160;&#29575;&#39044;&#27979;&#65292;&#24182;&#19988;&#22312;&#30830;&#23450;S\&amp;P500&#30340;&#26465;&#20214;&#26399;&#26435;&#31505;&#26354;&#32447;&#26041;&#38754;&#20248;&#20110;&#24403;&#21069;&#29256;&#26412;&#30340;&#36335;&#24452;&#20381;&#36182;&#27874;&#21160;&#29575;&#27169;&#22411;&#21644;&#26399;&#26435;&#24066;&#22330;&#26412;&#36523;&#12290;</title><link>http://arxiv.org/abs/2308.01486</link><description>&lt;p&gt;
&#36335;&#24452;&#38452;&#24433;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Path Shadowing Monte-Carlo. (arXiv:2308.01486v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01486
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36335;&#24452;&#38452;&#24433;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#65292;&#21487;&#20197;&#26681;&#25454;&#20219;&#20309;&#29983;&#25104;&#27169;&#22411;&#23545;&#26410;&#26469;&#36335;&#24452;&#36827;&#34892;&#39044;&#27979;&#65292;&#24182;&#36890;&#36807;&#23545;&#29983;&#25104;&#30340;&#20215;&#26684;&#36335;&#24452;&#36827;&#34892;&#24179;&#22343;&#26469;&#23454;&#29616;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#20135;&#29983;&#26368;&#20808;&#36827;&#30340;&#26410;&#26469;&#23454;&#29616;&#27874;&#21160;&#29575;&#39044;&#27979;&#65292;&#24182;&#19988;&#22312;&#30830;&#23450;S\&amp;P500&#30340;&#26465;&#20214;&#26399;&#26435;&#31505;&#26354;&#32447;&#26041;&#38754;&#20248;&#20110;&#24403;&#21069;&#29256;&#26412;&#30340;&#36335;&#24452;&#20381;&#36182;&#27874;&#21160;&#29575;&#27169;&#22411;&#21644;&#26399;&#26435;&#24066;&#22330;&#26412;&#36523;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#36335;&#24452;&#38452;&#24433;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#65292;&#21487;&#20197;&#26681;&#25454;&#20219;&#20309;&#29983;&#25104;&#27169;&#22411;&#23545;&#26410;&#26469;&#36335;&#24452;&#36827;&#34892;&#39044;&#27979;&#12290;&#22312;&#20219;&#20309;&#32473;&#23450;&#26085;&#26399;&#65292;&#35813;&#26041;&#27861;&#36890;&#36807;&#23545;&#29983;&#25104;&#30340;&#20215;&#26684;&#36335;&#24452;&#36827;&#34892;&#24179;&#22343;&#65292;&#20854;&#20013;&#36807;&#21435;&#30340;&#21382;&#21490;&#19982;&#23454;&#38469;&#35266;&#23519;&#21040;&#30340;&#21382;&#21490;&#30456;&#21305;&#37197;&#25110;&#8220;&#38452;&#24433;&#8221;&#12290;&#25105;&#20204;&#20351;&#29992;&#20174;&#37329;&#34701;&#20215;&#26684;&#30340;&#26368;&#22823;&#29109;&#27169;&#22411;&#29983;&#25104;&#30340;&#36335;&#24452;&#36827;&#34892;&#27979;&#35797;&#65292;&#35813;&#27169;&#22411;&#22522;&#20110;&#26368;&#36817;&#25552;&#20986;&#30340;&#26631;&#20934;&#20559;&#26012;&#24230;&#21644;&#23792;&#24230;&#30340;&#22810;&#23610;&#24230;&#27169;&#25311;&#31216;&#20026;&#8220;&#25955;&#23556;&#35889;&#8221;&#12290;&#35813;&#27169;&#22411;&#20419;&#36827;&#20102;&#29983;&#25104;&#36335;&#24452;&#30340;&#22810;&#26679;&#24615;&#65292;&#21516;&#26102;&#37325;&#29616;&#20102;&#37329;&#34701;&#20215;&#26684;&#30340;&#20027;&#35201;&#32479;&#35745;&#29305;&#24615;&#65292;&#21253;&#25324;&#27874;&#21160;&#29575;&#31895;&#31961;&#24230;&#30340;&#29305;&#24449;&#20107;&#23454;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20026;&#26410;&#26469;&#23454;&#29616;&#27874;&#21160;&#29575;&#25552;&#20379;&#20102;&#26368;&#20808;&#36827;&#30340;&#39044;&#27979;&#65292;&#24182;&#19988;&#21487;&#20197;&#30830;&#23450;&#36229;&#36234;&#24403;&#21069;&#29256;&#26412;&#30340;&#36335;&#24452;&#20381;&#36182;&#27874;&#21160;&#29575;&#27169;&#22411;&#21644;&#26399;&#26435;&#24066;&#22330;&#26412;&#36523;&#30340;S\&amp;P500&#30340;&#26465;&#20214;&#26399;&#26435;&#31505;&#26354;&#32447;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a Path Shadowing Monte-Carlo method, which provides prediction of future paths, given any generative model. At any given date, it averages future quantities over generated price paths whose past history matches, or `shadows', the actual (observed) history. We test our approach using paths generated from a maximum entropy model of financial prices, based on a recently proposed multi-scale analogue of the standard skewness and kurtosis called `Scattering Spectra'. This model promotes diversity of generated paths while reproducing the main statistical properties of financial prices, including stylized facts on volatility roughness. Our method yields state-of-the-art predictions for future realized volatility and allows one to determine conditional option smiles for the S\&amp;P500 that outperform both the current version of the Path-Dependent Volatility model and the option market itself.
&lt;/p&gt;</description></item><item><title>&#36825;&#20010;&#35770;&#25991;&#36890;&#36807;&#26032;&#30340;&#27010;&#29575;&#20998;&#26512;&#35777;&#26126;&#20102;Chakraborti&#30340;&#24217;&#20250;&#27169;&#22411;&#20013;&#20960;&#20046;&#32943;&#23450;&#20250;&#20986;&#29616;&#36130;&#23500;&#20957;&#32858;&#30340;&#29616;&#35937;&#65292;&#24182;&#19988;&#36825;&#19968;&#32467;&#26524;&#36824;&#25193;&#23637;&#21040;&#20102;&#20855;&#26377;&#36130;&#23500;&#33719;&#21462;&#20248;&#21183;&#30340;&#20462;&#25913;&#21518;&#27169;&#22411;&#20013;&#12290;</title><link>http://arxiv.org/abs/2308.01485</link><description>&lt;p&gt;
&#24217;&#20250;&#27169;&#22411;&#30340;&#26032;&#27010;&#29575;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
A new probabilistic analysis of the yard-sale model. (arXiv:2308.01485v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01485
&lt;/p&gt;
&lt;p&gt;
&#36825;&#20010;&#35770;&#25991;&#36890;&#36807;&#26032;&#30340;&#27010;&#29575;&#20998;&#26512;&#35777;&#26126;&#20102;Chakraborti&#30340;&#24217;&#20250;&#27169;&#22411;&#20013;&#20960;&#20046;&#32943;&#23450;&#20250;&#20986;&#29616;&#36130;&#23500;&#20957;&#32858;&#30340;&#29616;&#35937;&#65292;&#24182;&#19988;&#36825;&#19968;&#32467;&#26524;&#36824;&#25193;&#23637;&#21040;&#20102;&#20855;&#26377;&#36130;&#23500;&#33719;&#21462;&#20248;&#21183;&#30340;&#20462;&#25913;&#21518;&#27169;&#22411;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312; Chakraborti &#30340;&#24217;&#20250;&#27169;&#22411;&#20013;&#65292;&#30456;&#21516;&#30340;&#20195;&#29702;&#20154;&#36827;&#34892;&#20132;&#26131;&#65292;&#23548;&#33268;&#36130;&#23500;&#30340;&#20132;&#25442;&#65292;&#20294;&#20445;&#25345;&#20195;&#29702;&#20154;&#30340;&#24635;&#36130;&#23500;&#21644;&#27599;&#20010;&#20195;&#29702;&#20154;&#30340;&#39044;&#26399;&#36130;&#23500;&#19981;&#21464;&#12290;&#22312;&#36825;&#20010;&#27169;&#22411;&#20013;&#65292;&#20960;&#20046;&#21487;&#20197;&#30830;&#23450;&#22320;&#20986;&#29616;&#36130;&#23500;&#30340;&#20957;&#32858;&#65292;&#21363;&#25910;&#25947;&#21040;&#19968;&#20010;&#20195;&#29702;&#20154;&#25317;&#26377;&#19968;&#20999;&#32780;&#20854;&#20182;&#20195;&#29702;&#20154;&#19968;&#26080;&#25152;&#26377;&#30340;&#29366;&#24577;&#12290;&#25105;&#20204;&#32473;&#20986;&#20102;&#19968;&#20010;&#27604;&#29616;&#26377;&#35777;&#26126;&#26356;&#30701;&#19988;&#36866;&#29992;&#20110;&#20462;&#25913;&#21518;&#27169;&#22411;&#30340;&#35777;&#26126;&#65292;&#20854;&#20013;&#23384;&#22312;&#36130;&#23500;&#22686;&#30410;&#20248;&#21183;&#65292;&#21363;&#36130;&#23500;&#36739;&#22810;&#30340;&#20004;&#20010;&#20132;&#26131;&#20249;&#20276;&#26356;&#26377;&#21487;&#33021;&#20174;&#20132;&#26131;&#20013;&#21463;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;
In Chakraborti's yard-sale model of an economy, identical agents engage in trades that result in wealth exchanges, but conserve the combined wealth of all agents and each agent's expected wealth. In this model, wealth condensation, that is, convergence to a state in which one agent owns everything and the others own nothing, occurs almost surely. We give a proof of this fact that is much shorter than existing ones and extends to a modified model in which there is a wealth-acquired advantage, i.e., the wealthier of two trading partners is more likely to benefit from the trade.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#24314;&#27169;&#21644;&#39044;&#27979;&#22810;&#21464;&#37327;&#23454;&#29616;&#27874;&#21160;&#30340;&#26032;&#26041;&#27861;&#65292;&#33021;&#22815;&#26377;&#25928;&#22320;&#25429;&#25417;&#38750;&#32447;&#24615;&#20851;&#31995;&#65292;&#24182;&#21033;&#29992;&#22810;&#36339;&#37051;&#23621;&#30340;&#28322;&#20986;&#25928;&#24212;&#25552;&#39640;&#23454;&#29616;&#27874;&#21160;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#12290;&#27492;&#22806;&#65292;&#20351;&#29992;&#25311;&#20284;&#20284;&#28982;&#25439;&#22833;&#36827;&#34892;&#35757;&#32451;&#21487;&#20197;&#26174;&#33879;&#25552;&#21319;&#27169;&#22411;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2308.01419</link><description>&lt;p&gt;
&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#39044;&#27979;&#20855;&#26377;&#28322;&#20986;&#25928;&#24212;&#30340;&#22810;&#21464;&#37327;&#23454;&#29616;&#27874;&#21160;
&lt;/p&gt;
&lt;p&gt;
Graph Neural Networks for Forecasting Multivariate Realized Volatility with Spillover Effects. (arXiv:2308.01419v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01419
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#24314;&#27169;&#21644;&#39044;&#27979;&#22810;&#21464;&#37327;&#23454;&#29616;&#27874;&#21160;&#30340;&#26032;&#26041;&#27861;&#65292;&#33021;&#22815;&#26377;&#25928;&#22320;&#25429;&#25417;&#38750;&#32447;&#24615;&#20851;&#31995;&#65292;&#24182;&#21033;&#29992;&#22810;&#36339;&#37051;&#23621;&#30340;&#28322;&#20986;&#25928;&#24212;&#25552;&#39640;&#23454;&#29616;&#27874;&#21160;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#12290;&#27492;&#22806;&#65292;&#20351;&#29992;&#25311;&#20284;&#20284;&#28982;&#25439;&#22833;&#36827;&#34892;&#35757;&#32451;&#21487;&#20197;&#26174;&#33879;&#25552;&#21319;&#27169;&#22411;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#20351;&#29992;&#23450;&#21046;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#26469;&#24314;&#27169;&#21644;&#39044;&#27979;&#22810;&#21464;&#37327;&#30340;&#23454;&#38469;&#27874;&#21160;&#65292;&#20197;&#25972;&#21512;&#32929;&#31080;&#38388;&#30340;&#28322;&#20986;&#25928;&#24212;&#12290;&#25152;&#25552;&#20986;&#30340;&#27169;&#22411;&#20855;&#26377;&#23558;&#22810;&#36339;&#37051;&#23621;&#30340;&#28322;&#20986;&#25928;&#24212;&#32435;&#20837;&#32771;&#34385;&#12289;&#25429;&#25417;&#38750;&#32447;&#24615;&#20851;&#31995;&#21644;&#20351;&#29992;&#19981;&#21516;&#25439;&#22833;&#20989;&#25968;&#36827;&#34892;&#28789;&#27963;&#35757;&#32451;&#30340;&#20248;&#21183;&#12290;&#25105;&#20204;&#30340;&#23454;&#35777;&#32467;&#26524;&#25552;&#20379;&#20102;&#26377;&#21147;&#30340;&#35777;&#25454;&#65292;&#34920;&#26126;&#20165;&#32771;&#34385;&#22810;&#36339;&#37051;&#23621;&#30340;&#28322;&#20986;&#25928;&#24212;&#24182;&#19981;&#33021;&#22312;&#39044;&#27979;&#20934;&#30830;&#24615;&#26041;&#38754;&#26126;&#26174;&#20248;&#21183;&#12290;&#28982;&#32780;&#65292;&#24314;&#27169;&#38750;&#32447;&#24615;&#28322;&#20986;&#25928;&#24212;&#21487;&#20197;&#25552;&#39640;&#23454;&#29616;&#27874;&#21160;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#65292;&#23588;&#20854;&#26159;&#23545;&#20110;&#26368;&#38271;&#19968;&#21608;&#30340;&#30701;&#26399;&#39044;&#27979;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#32467;&#26524;&#19981;&#26029;&#34920;&#26126;&#65292;&#20351;&#29992;&#25311;&#20284;&#20284;&#28982;&#25439;&#22833;&#36827;&#34892;&#35757;&#32451;&#27604;&#24120;&#29992;&#30340;&#22343;&#26041;&#35823;&#24046;&#20855;&#26377;&#26126;&#26174;&#30340;&#27169;&#22411;&#24615;&#33021;&#25913;&#21892;&#12290;&#22312;&#20854;&#20182;&#35774;&#32622;&#20013;&#36827;&#34892;&#30340;&#20840;&#38754;&#19968;&#31995;&#21015;&#23454;&#35777;&#35780;&#20272;&#35777;&#23454;&#20102;&#35813;&#27169;&#22411;&#30340;&#31283;&#20581;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a novel methodology for modeling and forecasting multivariate realized volatilities using customized graph neural networks to incorporate spillover effects across stocks. The proposed model offers the benefits of incorporating spillover effects from multi-hop neighbors, capturing nonlinear relationships, and flexible training with different loss functions. Our empirical findings provide compelling evidence that incorporating spillover effects from multi-hop neighbors alone does not yield a clear advantage in terms of predictive accuracy. However, modeling nonlinear spillover effects enhances the forecasting accuracy of realized volatilities, particularly for short-term horizons of up to one week. Moreover, our results consistently indicate that training with the Quasi-likelihood loss leads to substantial improvements in model performance compared to the commonly-used mean squared error. A comprehensive series of empirical evaluations in alternative settings confirm the robus
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#23545;&#20110;&#26465;&#20214;&#24615;&#23545;&#25968;&#27491;&#24577;&#30340;SABR&#27169;&#22411;&#65292;&#35777;&#26126;&#20102;&#38646;&#25955;&#24230;&#38544;&#21547;&#27874;&#21160;&#29575;&#26159;&#27874;&#21160;&#29575;&#20114;&#25442;&#34892;&#26435;&#20215;&#30340;&#19979;&#30028;&#65292;&#35813;&#32467;&#35770;&#36866;&#29992;&#20110;&#25152;&#26377;&#30456;&#20851;&#21442;&#25968;&#65292;&#24182;&#19988;&#22312;&#30456;&#20851;&#24615;&#23567;&#20110;&#25110;&#31561;&#20110;&#38646;&#26102;&#27604;&#24179;&#20540;&#38544;&#21547;&#27874;&#21160;&#29575;&#26356;&#20026;&#31934;&#30830;&#12290;</title><link>http://arxiv.org/abs/2306.14602</link><description>&lt;p&gt;
&#19968;&#31181;&#23545;&#25968;&#27491;&#24577;SABR&#27169;&#22411;&#27874;&#21160;&#29575;&#20114;&#25442;&#30340;&#19979;&#30028;
&lt;/p&gt;
&lt;p&gt;
A lower bound for the volatility swap in the lognormal SABR model. (arXiv:2306.14602v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.14602
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23545;&#20110;&#26465;&#20214;&#24615;&#23545;&#25968;&#27491;&#24577;&#30340;SABR&#27169;&#22411;&#65292;&#35777;&#26126;&#20102;&#38646;&#25955;&#24230;&#38544;&#21547;&#27874;&#21160;&#29575;&#26159;&#27874;&#21160;&#29575;&#20114;&#25442;&#34892;&#26435;&#20215;&#30340;&#19979;&#30028;&#65292;&#35813;&#32467;&#35770;&#36866;&#29992;&#20110;&#25152;&#26377;&#30456;&#20851;&#21442;&#25968;&#65292;&#24182;&#19988;&#22312;&#30456;&#20851;&#24615;&#23567;&#20110;&#25110;&#31561;&#20110;&#38646;&#26102;&#27604;&#24179;&#20540;&#38544;&#21547;&#27874;&#21160;&#29575;&#26356;&#20026;&#31934;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35777;&#26126;&#65292;&#22312;&#30701;&#26399;&#21040;&#26399;&#30340;&#38480;&#21046;&#26465;&#20214;&#19979;&#65292;&#23545;&#20110;&#26465;&#20214;&#24615;&#23545;&#25968;&#27491;&#24577;&#30340;SABR&#27169;&#22411;&#65292;&#38646;&#25955;&#24230;&#38544;&#21547;&#27874;&#21160;&#29575;&#26159;&#27874;&#21160;&#29575;&#20114;&#25442;&#34892;&#26435;&#20215;&#30340;&#19979;&#30028;&#12290;&#23545;&#20110;&#25152;&#26377;&#30456;&#20851;&#21442;&#25968;&#65292;&#35813;&#32467;&#26524;&#37117;&#26159;&#26377;&#25928;&#30340;&#65292;&#24182;&#19988;&#22312;&#30456;&#20851;&#24615;&#23567;&#20110;&#25110;&#31561;&#20110;&#38646;&#26102;&#27604;&#24179;&#20540;&#38544;&#21547;&#27874;&#21160;&#29575;&#26356;&#20026;&#31934;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the short time to maturity limit it is proved that for the conditionally lognormal SABR model the zero vanna implied volatility is a lower bound for the volatility swap strike. The result is valid for all values of the correlation parameter and is a sharper lower bound than the at-the-money implied volatility for correlation less than or equal to zero.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#32858;&#31867;&#31639;&#27861;&#26816;&#27979;&#38750;&#21516;&#36136;&#21270;&#20195;&#24065;&#65288;NFT&#65289;&#20132;&#26131;&#24066;&#22330;&#20013;&#30340;&#24322;&#24120;&#34892;&#20026;&#30340;&#26041;&#27861;&#65292;&#24182;&#25506;&#35752;&#20102;&#30417;&#31649;&#23545;&#20943;&#23569;&#27450;&#35784;&#34892;&#20026;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2306.04643</link><description>&lt;p&gt;
NFT&#24066;&#22330;&#20013;&#30340;&#24322;&#24120;&#20132;&#26131;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
Abnormal Trading Detection in the NFT Market. (arXiv:2306.04643v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.04643
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#32858;&#31867;&#31639;&#27861;&#26816;&#27979;&#38750;&#21516;&#36136;&#21270;&#20195;&#24065;&#65288;NFT&#65289;&#20132;&#26131;&#24066;&#22330;&#20013;&#30340;&#24322;&#24120;&#34892;&#20026;&#30340;&#26041;&#27861;&#65292;&#24182;&#25506;&#35752;&#20102;&#30417;&#31649;&#23545;&#20943;&#23569;&#27450;&#35784;&#34892;&#20026;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38750;&#21516;&#36136;&#21270;&#20195;&#24065;&#65288;NFT&#65289;&#24066;&#22330;&#36817;&#24180;&#26469;&#21576;&#29190;&#28856;&#24615;&#22686;&#38271;&#12290;&#25454;DappRadar&#32479;&#35745;&#65292;&#26368;&#22823;&#30340;NFT&#24066;&#22330;OpenSea&#30340;&#24635;&#20132;&#26131;&#39069;&#22312;2023&#24180;2&#26376;&#36798;&#21040;&#20102;347&#20159;&#32654;&#20803;&#12290;&#28982;&#32780;&#65292;NFT&#24066;&#22330;&#22823;&#37096;&#20998;&#26159;&#26410;&#21463;&#30417;&#31649;&#30340;&#65292;&#23384;&#22312;&#30528;&#37325;&#22823;&#30340;&#27927;&#38065;&#12289;&#27450;&#35784;&#21644;&#34394;&#20551;&#20132;&#26131;&#31561;&#38382;&#39064;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#35797;&#22270;&#25581;&#31034;&#24120;&#35265;&#30340;&#27450;&#35784;&#34892;&#20026;&#65292;&#22914;&#34394;&#25311;&#20132;&#26131;&#65292;&#36825;&#21487;&#33021;&#20250;&#35823;&#23548;&#20854;&#20182;&#20132;&#26131;&#32773;&#12290;&#25105;&#20204;&#20351;&#29992;&#24066;&#22330;&#25968;&#25454;&#20174;&#32593;&#32476;&#12289;&#36135;&#24065;&#21644;&#26102;&#38388;&#30340;&#35282;&#24230;&#35774;&#35745;&#37327;&#21270;&#29305;&#24449;&#65292;&#24182;&#23558;&#20854;&#36755;&#20837;&#21040;&#22522;&#20110;K&#22343;&#20540;&#32858;&#31867;&#30340;&#26080;&#30417;&#30563;&#23398;&#20064;&#31639;&#27861;&#20013;&#65292;&#20197;&#23545;&#20132;&#26131;&#32773;&#36827;&#34892;&#20998;&#31867;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#35752;&#35770;&#20102;&#32858;&#31867;&#32467;&#26524;&#30340;&#37325;&#35201;&#24615;&#20197;&#21450;&#22914;&#20309;&#36890;&#36807;&#30417;&#31649;&#26469;&#20943;&#23569;&#19981;&#33391;&#34892;&#20026;&#12290;&#25105;&#20204;&#30340;&#24037;&#20316;&#21487;&#33021;&#26377;&#21161;&#20110;&#37325;&#26032;&#24314;&#31435;&#20132;&#26131;&#32773;&#30340;&#20449;&#20219;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Non-Fungible-Token (NFT) market has experienced explosive growth in recent years. According to DappRadar, the total transaction volume on OpenSea, the largest NFT marketplace, reached 34.7 billion dollars in February 2023. However, the NFT market is mostly unregulated and there are significant concerns about money laundering, fraud and wash trading. Amateur traders and retail investors comprise a significant fraction of the NFT market. Hence it is important that researchers highlight the relevant risks involved in NFT trading. In this paper, we attempt to uncover common fraudulent behaviors such as wash trading that could mislead other traders. Using market data, we design quantitative features from the network, monetary, and temporal perspectives that are fed into K-means clustering unsupervised learning algorithm to sort traders into groups. Lastly, we discuss the clustering results' significance and how regulations can reduce undesired behaviors. Our work can potentially help re
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;</title><link>http://arxiv.org/abs/2302.13426</link><description>&lt;p&gt;
&#26399;&#26435;&#30340;&#20215;&#26684;&#21457;&#29616;
&lt;/p&gt;
&lt;p&gt;
Price Discovery for Derivatives. (arXiv:2302.13426v5 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13426
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#19968;&#20010;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#31169;&#26377;&#20449;&#24687;&#21644;&#39640;&#38454;&#20449;&#24687;&#23545;&#26399;&#26435;&#24066;&#22330;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#27169;&#22411;&#20801;&#35768;&#26377;&#31169;&#26377;&#20449;&#24687;&#30340;&#20132;&#26131;&#32773;&#22312;&#29366;&#24577;-&#32034;&#36180;&#38598;&#24066;&#22330;&#19978;&#20132;&#26131;&#12290;&#31561;&#20215;&#30340;&#26399;&#26435;&#24418;&#24335;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#25317;&#26377;&#20851;&#20110;&#22522;&#30784;&#36164;&#20135;&#25910;&#30410;&#30340;&#20998;&#24067;&#30340;&#31169;&#26377;&#20449;&#24687;&#65292;&#24182;&#20801;&#35768;&#20132;&#26131;&#20219;&#24847;&#26399;&#26435;&#32452;&#21512;&#30340;&#25805;&#32437;&#32773;&#12290;&#25105;&#20204;&#24471;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#65292;&#36825;&#20123;&#35299;&#25552;&#20379;&#20102;&#20851;&#20110;&#20869;&#24149;&#20132;&#26131;&#30340;&#39640;&#38454;&#20449;&#24687;&#65292;&#22914;&#20219;&#20309;&#32473;&#23450;&#30340;&#26102;&#21051;&#20132;&#26131;&#26399;&#26435;&#31574;&#30053;&#65292;&#24182;&#23558;&#36825;&#20123;&#31574;&#30053;&#27867;&#21270;&#21040;&#20102;&#27874;&#21160;&#29575;&#20132;&#26131;&#31561;&#23454;&#36341;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;
We obtain a basic theory of price discovery across derivative markets with respect to higher-order information, using a model where an agent with general private information regarding state probabilities is allowed to trade arbitrary portfolios of state-contingent claims. In an equivalent options formulation, the informed agent has private information regarding arbitrary aspects of the payoff distribution of an underlying asset and is allowed to trade arbitrary option portfolios. We characterize, in closed form, the informed demand, price impact, and information efficiency of prices. Our results offer a theory of insider trading on higher moments of the underlying payoff as a special case. The informed demand formula prescribes option strategies for trading on any given moment and extends those used in practice for, e.g. volatility trading.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#36890;&#36807;&#23545;&#24066;&#22330;&#35746;&#21333;&#27969;&#30340;&#38271;&#26102;&#35760;&#24518;&#36827;&#34892;&#23450;&#37327;&#27979;&#35797;&#65292;&#39564;&#35777;&#20102;Lillo-Mike-Farmer&#27169;&#22411;&#20013;&#30340;&#24494;&#35266;&#20551;&#35774;&#20851;&#20110;&#35746;&#21333;&#25286;&#20998;&#34892;&#20026;&#30340;&#39044;&#27979;&#19982;&#23439;&#35266;&#35746;&#21333;&#26041;&#21521;&#30456;&#20851;&#24615;&#30340;&#23450;&#37327;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2301.13505</link><description>&lt;p&gt;
&#25105;&#20204;&#33021;&#21542;&#20174;&#24066;&#22330;&#35746;&#21333;&#27969;&#30340;&#38271;&#26102;&#35760;&#24518;&#20013;&#25512;&#26029;&#24494;&#35266;&#37329;&#34701;&#20449;&#24687;&#65311;&#65306;&#23545;Lillo-Mike-Farmer&#27169;&#22411;&#30340;&#23450;&#37327;&#26816;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;
Can we infer microscopic financial information from the long memory in market-order flow?: a quantitative test of the Lillo-Mike-Farmer model. (arXiv:2301.13505v2 [q-fin.TR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.13505
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#36890;&#36807;&#23545;&#24066;&#22330;&#35746;&#21333;&#27969;&#30340;&#38271;&#26102;&#35760;&#24518;&#36827;&#34892;&#23450;&#37327;&#27979;&#35797;&#65292;&#39564;&#35777;&#20102;Lillo-Mike-Farmer&#27169;&#22411;&#20013;&#30340;&#24494;&#35266;&#20551;&#35774;&#20851;&#20110;&#35746;&#21333;&#25286;&#20998;&#34892;&#20026;&#30340;&#39044;&#27979;&#19982;&#23439;&#35266;&#35746;&#21333;&#26041;&#21521;&#30456;&#20851;&#24615;&#30340;&#23450;&#37327;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#37329;&#34701;&#24066;&#22330;&#20013;&#65292;&#24066;&#22330;&#35746;&#21333;&#30340;&#26041;&#21521;&#34920;&#29616;&#20986;&#24378;&#28872;&#30340;&#25345;&#32493;&#24615;&#65292;&#34987;&#24191;&#27867;&#31216;&#20026;&#35746;&#21333;&#27969;&#30340;&#38271;&#26102;&#20851;&#32852;&#65288;LRC&#65289;; &#20855;&#20307;&#32780;&#35328;&#65292;&#35746;&#21333;&#26041;&#21521;&#30456;&#20851;&#20989;&#25968;&#26174;&#31034;&#20986;&#20855;&#26377;&#24130;&#24459;&#25351;&#25968;$\gamma$&#30340;&#38271;&#26102;&#35760;&#24518;&#65292;&#20351;&#24471;&#23545;&#20110;&#36739;&#22823;&#30340;&#26102;&#38388;&#24310;&#36831;$\tau$&#65292;$C(\tau) \propto \tau^{-\gamma}$&#12290;&#20854;&#20013;&#26368;&#26377;&#24076;&#26395;&#30340;&#24494;&#35266;&#20551;&#35774;&#20043;&#19968;&#26159;&#20010;&#20307;&#20132;&#26131;&#32773;&#27700;&#24179;&#19978;&#30340;&#35746;&#21333;&#25286;&#20998;&#34892;&#20026;&#12290;&#20107;&#23454;&#19978;&#65292;Lillo&#12289;Mike&#21644;Farmer&#65288;LMF&#65289;&#22312;2005&#24180;&#25552;&#20986;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#24494;&#35266;&#35746;&#21333;&#25286;&#20998;&#34892;&#20026;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#39044;&#27979;&#23439;&#35266;&#35746;&#21333;&#26041;&#21521;&#30456;&#20851;&#19982;&#24494;&#35266;&#20803;&#35746;&#21333;&#20998;&#24067;&#23450;&#37327;&#30456;&#20851;&#12290;&#23613;&#31649;&#36825;&#20010;&#20551;&#35774;&#19968;&#30452;&#26159;&#35745;&#37327;&#32463;&#27982;&#29289;&#29702;&#23398;&#20013;&#30340;&#19968;&#20010;&#26680;&#24515;&#20105;&#35758;&#38382;&#39064;&#65292;&#20294;&#30452;&#25509;&#23450;&#37327;&#39564;&#35777;&#19968;&#30452;&#32570;&#20047;&#65292;&#22240;&#20026;&#23427;&#38656;&#35201;&#20855;&#26377;&#39640;&#20998;&#36776;&#29575;&#30340;&#22823;&#37327;&#24494;&#35266;&#25968;&#25454;&#38598;&#26469;&#35266;&#23519;&#25152;&#26377;&#20010;&#20307;&#20132;&#26131;&#32773;&#30340;&#35746;&#21333;&#25286;&#20998;&#34892;&#20026;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#39318;&#27425;&#23545;&#36825;&#31181;LMF&#27169;&#22411;&#30340;&#39044;&#27979;&#36827;&#34892;&#20102;&#23450;&#37327;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
In financial markets, the market order sign exhibits strong persistence, widely known as the long-range correlation (LRC) of order flow; specifically, the sign correlation function displays long memory with power-law exponent $\gamma$, such that $C(\tau) \propto \tau^{-\gamma}$ for large time-lag $\tau$. One of the most promising microscopic hypotheses is the order-splitting behaviour at the level of individual traders. Indeed, Lillo, Mike, and Farmer (LMF) introduced in 2005 a simple microscopic model of order-splitting behaviour, which predicts that the macroscopic sign correlation is quantitatively associated with the microscopic distribution of metaorders. While this hypothesis has been a central issue of debate in econophysics, its direct quantitative validation has been missing because it requires large microscopic datasets with high resolution to observe the order-splitting behaviour of all individual traders. Here we present the first quantitative validation of this LFM predict
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#27880;&#24847;&#21147;&#39537;&#21160;&#30340;&#21160;&#24577;&#22240;&#23376;&#23398;&#20064;&#30340;&#29983;&#25104;CVaR&#32452;&#21512;&#20248;&#21270;&#31639;&#27861;&#65292;&#36890;&#36807;&#38543;&#26426;&#21464;&#37327;&#36716;&#25442;&#20316;&#20026;&#20998;&#24067;&#24314;&#27169;&#30340;&#38544;&#24335;&#26041;&#24335;&#65292;&#20197;&#21450;&#20351;&#29992;&#27880;&#24847;&#21147;-GRU&#32593;&#32476;&#36827;&#34892;&#21160;&#24577;&#23398;&#20064;&#21644;&#39044;&#27979;&#65292;&#25429;&#25417;&#20102;&#22810;&#20803;&#32929;&#31080;&#25910;&#30410;&#20043;&#38388;&#30340;&#21160;&#24577;&#20381;&#36182;&#20851;&#31995;&#65292;&#29305;&#21035;&#26159;&#20851;&#27880;&#23614;&#37096;&#23646;&#24615;&#12290;&#36890;&#36807;&#22312;&#27599;&#20010;&#25237;&#36164;&#26085;&#26399;&#20174;&#23398;&#20064;&#21040;&#30340;&#29983;&#25104;&#27169;&#22411;&#20013;&#27169;&#25311;&#26032;&#26679;&#26412;&#65292;&#24182;&#36827;&#19968;&#27493;&#24212;&#29992;CVaR&#32452;&#21512;&#20248;&#21270;&#31574;&#30053;&#65292;&#23454;&#29616;&#20102;&#26356;&#26126;&#26234;&#30340;&#25237;&#36164;&#20915;&#31574;&#12290;</title><link>http://arxiv.org/abs/2301.07318</link><description>&lt;p&gt;
&#20351;&#29992;&#27880;&#24847;&#21147;&#39537;&#21160;&#30340;&#21160;&#24577;&#22240;&#23376;&#23398;&#20064;&#30340;&#29983;&#25104;CVaR&#32452;&#21512;&#20248;&#21270;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Generative CVaR Portfolio Optimization with Attention-Powered Dynamic Factor Learning. (arXiv:2301.07318v3 [q-fin.PM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.07318
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#27880;&#24847;&#21147;&#39537;&#21160;&#30340;&#21160;&#24577;&#22240;&#23376;&#23398;&#20064;&#30340;&#29983;&#25104;CVaR&#32452;&#21512;&#20248;&#21270;&#31639;&#27861;&#65292;&#36890;&#36807;&#38543;&#26426;&#21464;&#37327;&#36716;&#25442;&#20316;&#20026;&#20998;&#24067;&#24314;&#27169;&#30340;&#38544;&#24335;&#26041;&#24335;&#65292;&#20197;&#21450;&#20351;&#29992;&#27880;&#24847;&#21147;-GRU&#32593;&#32476;&#36827;&#34892;&#21160;&#24577;&#23398;&#20064;&#21644;&#39044;&#27979;&#65292;&#25429;&#25417;&#20102;&#22810;&#20803;&#32929;&#31080;&#25910;&#30410;&#20043;&#38388;&#30340;&#21160;&#24577;&#20381;&#36182;&#20851;&#31995;&#65292;&#29305;&#21035;&#26159;&#20851;&#27880;&#23614;&#37096;&#23646;&#24615;&#12290;&#36890;&#36807;&#22312;&#27599;&#20010;&#25237;&#36164;&#26085;&#26399;&#20174;&#23398;&#20064;&#21040;&#30340;&#29983;&#25104;&#27169;&#22411;&#20013;&#27169;&#25311;&#26032;&#26679;&#26412;&#65292;&#24182;&#36827;&#19968;&#27493;&#24212;&#29992;CVaR&#32452;&#21512;&#20248;&#21270;&#31574;&#30053;&#65292;&#23454;&#29616;&#20102;&#26356;&#26126;&#26234;&#30340;&#25237;&#36164;&#20915;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21160;&#24577;&#32452;&#21512;&#26500;&#24314;&#38382;&#39064;&#38656;&#35201;&#21160;&#24577;&#24314;&#27169;&#22810;&#20803;&#32929;&#31080;&#25910;&#30410;&#30340;&#32852;&#21512;&#20998;&#24067;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21160;&#24577;&#29983;&#25104;&#22240;&#23376;&#27169;&#22411;&#65292;&#23427;&#20351;&#29992;&#38543;&#26426;&#21464;&#37327;&#36716;&#25442;&#20316;&#20026;&#20998;&#24067;&#24314;&#27169;&#30340;&#38544;&#24335;&#26041;&#24335;&#65292;&#24182;&#20381;&#36182;&#20110;&#20351;&#29992;&#27880;&#24847;&#21147;-GRU&#32593;&#32476;&#36827;&#34892;&#21160;&#24577;&#23398;&#20064;&#21644;&#39044;&#27979;&#12290;&#25152;&#25552;&#20986;&#30340;&#27169;&#22411;&#25429;&#25417;&#20102;&#22810;&#20803;&#32929;&#31080;&#25910;&#30410;&#20043;&#38388;&#30340;&#21160;&#24577;&#20381;&#36182;&#20851;&#31995;&#65292;&#29305;&#21035;&#26159;&#20851;&#27880;&#23614;&#37096;&#23646;&#24615;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#20010;&#20004;&#27493;&#36845;&#20195;&#31639;&#27861;&#26469;&#35757;&#32451;&#27169;&#22411;&#65292;&#28982;&#21518;&#39044;&#27979;&#26102;&#21464;&#30340;&#27169;&#22411;&#21442;&#25968;&#65292;&#21253;&#25324;&#26102;&#19981;&#21464;&#30340;&#23614;&#37096;&#21442;&#25968;&#12290;&#22312;&#27599;&#20010;&#25237;&#36164;&#26085;&#26399;&#65292;&#25105;&#20204;&#21487;&#20197;&#36731;&#26494;&#22320;&#20174;&#23398;&#20064;&#21040;&#30340;&#29983;&#25104;&#27169;&#22411;&#20013;&#27169;&#25311;&#26032;&#26679;&#26412;&#65292;&#24182;&#36827;&#19968;&#27493;&#20351;&#29992;&#27169;&#25311;&#26679;&#26412;&#26469;&#36827;&#34892;CVaR&#32452;&#21512;&#20248;&#21270;&#65292;&#24418;&#25104;&#21160;&#24577;&#32452;&#21512;&#31574;&#30053;&#12290;&#23545;&#32929;&#31080;&#25968;&#25454;&#30340;&#25968;&#20540;&#23454;&#39564;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#21487;&#20197;&#24102;&#26469;&#26356;&#26126;&#26234;&#30340;&#25237;&#36164;&#65292;&#25215;&#35834;&#26356;&#39640;&#30340;&#22238;&#25253;&#39118;&#38505;&#27604;&#65292;&#24182;&#21576;&#29616;&#20986;...
&lt;/p&gt;
&lt;p&gt;
The dynamic portfolio construction problem requires dynamic modeling of the joint distribution of multivariate stock returns. To achieve this, we propose a dynamic generative factor model which uses random variable transformation as an implicit way of distribution modeling and relies on the Attention-GRU network for dynamic learning and forecasting. The proposed model captures the dynamic dependence among multivariate stock returns, especially focusing on the tail-side properties. We also propose a two-step iterative algorithm to train the model and then predict the time-varying model parameters, including the time-invariant tail parameters. At each investment date, we can easily simulate new samples from the learned generative model, and we further perform CVaR portfolio optimization with the simulated samples to form a dynamic portfolio strategy. The numerical experiment on stock data shows that our model leads to wiser investments that promise higher reward-risk ratios and present l
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#30340;&#36830;&#32493;&#26102;&#38388;&#20581;&#22766;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#65292;&#36890;&#36807;&#23545;&#20598;&#24615;&#35777;&#26126;&#20102;&#23545;&#25968;&#12289;&#25351;&#25968;&#21644;&#24130;&#25928;&#29992;&#30340;&#26368;&#20248;&#32452;&#21512;&#30340;&#23384;&#22312;&#24615;&#12290;</title><link>http://arxiv.org/abs/2206.14015</link><description>&lt;p&gt;
&#38750;&#32447;&#24615;&#36830;&#32493;&#21322;&#38789;&#19979;&#30340;&#20581;&#22766;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Robust utility maximization with nonlinear continuous semimartingales. (arXiv:2206.14015v3 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.14015
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#30340;&#36830;&#32493;&#26102;&#38388;&#20581;&#22766;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#65292;&#36890;&#36807;&#23545;&#20598;&#24615;&#35777;&#26126;&#20102;&#23545;&#25968;&#12289;&#25351;&#25968;&#21644;&#24130;&#25928;&#29992;&#30340;&#26368;&#20248;&#32452;&#21512;&#30340;&#23384;&#22312;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#22312;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#30340;&#36830;&#32493;&#26102;&#38388;&#20581;&#22766;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#12290;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#30001;&#20855;&#26377;&#19981;&#30830;&#23450;&#23616;&#37096;&#29305;&#24449;&#30340;&#36830;&#32493;&#21322;&#38789;&#25152;&#25511;&#21046;&#12290;&#22312;&#27492;&#22788;&#65292;&#24494;&#20998;&#29305;&#24449;&#30001;&#19968;&#20010;&#21462;&#20915;&#20110;&#26102;&#38388;&#21644;&#36335;&#24452;&#30340;&#38598;&#21512;&#20540;&#20989;&#25968;&#25152;&#35268;&#23450;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#20581;&#22766;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#19982;&#20849;&#36717;&#38382;&#39064;&#30340;&#23545;&#20598;&#24615;&#65292;&#24182;&#30740;&#31350;&#20102;&#23545;&#25968;&#12289;&#25351;&#25968;&#21644;&#24130;&#25928;&#29992;&#30340;&#26368;&#20248;&#32452;&#21512;&#30340;&#23384;&#22312;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper we study a robust utility maximization problem in continuous time under model uncertainty. The model uncertainty is governed by a continuous semimartingale with uncertain local characteristics. Here, the differential characteristics are prescribed by a set-valued function that depends on time and path. We show that the robust utility maximization problem is in duality with a conjugate problem, and study the existence of optimal portfolios for logarithmic, exponential and power utilities.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21160;&#24577;&#25096;&#30331;&#22686;&#38271;&#27169;&#22411;&#30340;&#23545;&#25968;&#31169;&#20154;&#20844;&#21496;&#20272;&#20540;&#27169;&#22411;&#65292;&#20854;&#20013;&#21253;&#21547;&#38381;&#21512;&#24335;&#26399;&#26435;&#23450;&#20215;&#20844;&#24335;&#12289;&#23545;&#20914;&#20844;&#24335;&#20197;&#21450;&#26435;&#30410;&#36830;&#25509;&#23551;&#38505;&#20135;&#21697;&#30340;&#20928;&#20445;&#36153;&#20844;&#24335;&#12290;&#35813;&#27169;&#22411;&#21487;&#29992;&#20110;&#31169;&#20154;&#20844;&#21496;&#21644;&#20844;&#20849;&#20844;&#21496;&#12290;</title><link>http://arxiv.org/abs/2206.09666</link><description>&lt;p&gt;
&#23545;&#25968;&#31169;&#20154;&#20844;&#21496;&#20272;&#20540;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
The Log Private Company Valuation Model. (arXiv:2206.09666v3 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.09666
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21160;&#24577;&#25096;&#30331;&#22686;&#38271;&#27169;&#22411;&#30340;&#23545;&#25968;&#31169;&#20154;&#20844;&#21496;&#20272;&#20540;&#27169;&#22411;&#65292;&#20854;&#20013;&#21253;&#21547;&#38381;&#21512;&#24335;&#26399;&#26435;&#23450;&#20215;&#20844;&#24335;&#12289;&#23545;&#20914;&#20844;&#24335;&#20197;&#21450;&#26435;&#30410;&#36830;&#25509;&#23551;&#38505;&#20135;&#21697;&#30340;&#20928;&#20445;&#36153;&#20844;&#24335;&#12290;&#35813;&#27169;&#22411;&#21487;&#29992;&#20110;&#31169;&#20154;&#20844;&#21496;&#21644;&#20844;&#20849;&#20844;&#21496;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38024;&#23545;&#31169;&#20154;&#20844;&#21496;&#30001;&#20110;&#20215;&#26684;&#19981;&#21487;&#35266;&#27979;&#32780;&#23548;&#33268;&#26399;&#26435;&#12289;&#23551;&#38505;&#23450;&#20215;&#20197;&#21450;&#23545;&#20914;&#31561;&#20219;&#21153;&#20855;&#26377;&#25361;&#25112;&#24615;&#65292;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#21160;&#24577;&#25096;&#30331;&#22686;&#38271;&#27169;&#22411;&#30340;&#23545;&#25968;&#31169;&#20154;&#20844;&#21496;&#20272;&#20540;&#27169;&#22411;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#38024;&#23545;&#31169;&#20154;&#20844;&#21496;&#30340;&#38381;&#21512;&#24335;&#26399;&#26435;&#23450;&#20215;&#20844;&#24335;&#12289;&#23545;&#20914;&#20844;&#24335;&#20197;&#21450;&#26435;&#30410;&#36830;&#25509;&#23551;&#38505;&#20135;&#21697;&#30340;&#20928;&#20445;&#36153;&#20844;&#24335;&#12290;&#27492;&#22806;&#65292;&#26412;&#25991;&#25552;&#20379;&#20102;&#25105;&#20204;&#27169;&#22411;&#30340;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#22120;&#12289;&#26399;&#26395;&#26497;&#22823;&#21270;&#31639;&#27861;&#21644;&#31169;&#20154;&#20844;&#21496;&#20272;&#20540;&#20844;&#24335;&#12290;&#35813;&#27169;&#22411;&#26082;&#21487;&#29992;&#20110;&#31169;&#20154;&#20844;&#21496;&#65292;&#20063;&#21487;&#29992;&#20110;&#20844;&#20849;&#20844;&#21496;&#12290;
&lt;/p&gt;
&lt;p&gt;
For a public company, the option pricing models, hedging models, and pricing and hedging models of equity--linked life insurance products have been developed. However, for a private company, because of unobserved prices, the option and the life insurance pricing, and the hedging are challenging tasks. For this reason, this paper introduces a log private company valuation model, which is based on the dynamic Gordon growth model. In this paper, we obtain closed-form option pricing formulas, hedging formulas, and net premium formulas of equity-linked life insurance products for a private company. Also, the paper provides ML estimators of our model, EM algorithm, and valuation formula for the private company. The suggested model can be used not only by private companies but also by public companies
&lt;/p&gt;</description></item></channel></rss>