<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21019;&#19994;&#20844;&#21496;&#25910;&#36141;&#27169;&#22411;&#65292;&#25351;&#20986;&#25910;&#36141;&#20250;&#23548;&#33268;&#20302;&#25928;&#30340; "&#20154;&#25165;&#22244;&#31215;"&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#21363;&#20351;&#27809;&#26377;&#31454;&#20105;&#25928;&#24212;&#65292;&#25910;&#36141;&#20063;&#21487;&#33021;&#26159;&#22404;&#26029;&#34892;&#20026;&#30340;&#32467;&#26524;&#65292;&#23548;&#33268;&#20154;&#25165;&#20998;&#37197;&#20302;&#25928;&#65292;&#24182;&#23545;&#28040;&#36153;&#32773;&#21097;&#20313;&#21644;&#34987;&#25910;&#36141;&#21592;&#24037;&#30340;&#24037;&#20316;&#31283;&#23450;&#24615;&#20135;&#29983;&#36127;&#38754;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2308.10046</link><description>&lt;p&gt;
&#21019;&#19994;&#20844;&#21496;&#25910;&#36141;&#65306;&#20154;&#25165;&#25250;&#36141;&#21644;&#20154;&#25165;&#22244;&#31215;
&lt;/p&gt;
&lt;p&gt;
Startup Acquisitions: Acquihires and Talent Hoarding. (arXiv:2308.10046v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.10046
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21019;&#19994;&#20844;&#21496;&#25910;&#36141;&#27169;&#22411;&#65292;&#25351;&#20986;&#25910;&#36141;&#20250;&#23548;&#33268;&#20302;&#25928;&#30340; "&#20154;&#25165;&#22244;&#31215;"&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#21363;&#20351;&#27809;&#26377;&#31454;&#20105;&#25928;&#24212;&#65292;&#25910;&#36141;&#20063;&#21487;&#33021;&#26159;&#22404;&#26029;&#34892;&#20026;&#30340;&#32467;&#26524;&#65292;&#23548;&#33268;&#20154;&#25165;&#20998;&#37197;&#20302;&#25928;&#65292;&#24182;&#23545;&#28040;&#36153;&#32773;&#21097;&#20313;&#21644;&#34987;&#25910;&#36141;&#21592;&#24037;&#30340;&#24037;&#20316;&#31283;&#23450;&#24615;&#20135;&#29983;&#36127;&#38754;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21019;&#19994;&#20844;&#21496;&#25910;&#36141;&#27169;&#22411;&#65292;&#21487;&#33021;&#23548;&#33268;&#20302;&#25928;&#30340; "&#20154;&#25165;&#22244;&#31215;"&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#26377;&#20004;&#20010;&#31454;&#20105;&#20844;&#21496;&#30340;&#27169;&#22411;&#65292;&#36825;&#20123;&#20844;&#21496;&#21487;&#20197;&#25910;&#36141;&#21644;&#25972;&#21512;&#19968;&#20010;&#22312;&#19981;&#21516;&#39046;&#22495;&#36816;&#33829;&#30340;&#21019;&#19994;&#20844;&#21496;&#65292;&#36825;&#31181;&#25910;&#36141;&#25913;&#21892;&#20102;&#25910;&#36141;&#20844;&#21496;&#30340;&#31454;&#20105;&#21147;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#21363;&#20351;&#27809;&#26377;&#32463;&#20856;&#30340;&#31454;&#20105;&#25928;&#24212;&#65292;&#36825;&#31181;&#25910;&#36141;&#20063;&#21487;&#33021;&#19981;&#26159;&#33391;&#24615;&#30340;&#65292;&#32780;&#26159;&#22404;&#26029;&#34892;&#20026;&#30340;&#32467;&#26524;&#65292;&#23548;&#33268;&#20154;&#25165;&#20998;&#37197;&#20302;&#25928;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#34920;&#26126;&#65292;&#36825;&#31181;&#20154;&#25165;&#22244;&#31215;&#21487;&#33021;&#20250;&#38477;&#20302;&#28040;&#36153;&#32773;&#21097;&#20313;&#65292;&#24182;&#23548;&#33268;&#34987;&#25910;&#36141;&#21592;&#24037;&#30340;&#24037;&#20316;&#19981;&#31283;&#23450;&#24615;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a model of startup acquisitions, which may give rise to inefficient "talent hoarding." We develop a model with two competing firms that can acquire and integrate (or "acquihire") a startup operating in an orthogonal market. Such an acquihire improves the competitiveness of the acquiring firm. We show that even absent the classical competition effects, acquihires need not be benign but can be the result of oligopolistic behavior, leading to an inefficient allocation of talent. Further, we show that such talent hoarding may reduce consumer surplus and lead to more job volatility for acquihired employees.
&lt;/p&gt;</description></item></channel></rss>