<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21160;&#24577;&#39118;&#38505;&#24230;&#37327;&#30340;&#39118;&#38505;&#20998;&#37197;&#31574;&#30053;&#65292;&#24341;&#20837;&#20102;&#21160;&#24577;&#39118;&#38505;&#36129;&#29486;&#30340;&#27010;&#24565;&#36827;&#34892;&#36882;&#24402;&#35745;&#31639;&#65292;&#35777;&#26126;&#20102;&#35813;&#38382;&#39064;&#21487;&#20197;&#34987;&#37325;&#26032;&#34920;&#36848;&#20026;&#19968;&#31995;&#21015;&#20005;&#26684;&#20984;&#30340;&#20248;&#21270;&#38382;&#39064;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#31181;&#28436;&#21592;-&#35780;&#35770;&#23478;&#26041;&#27861;&#35299;&#20915;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2305.11319</link><description>&lt;p&gt;
&#21160;&#24577;&#39118;&#38505;&#24230;&#37327;&#30340;&#39118;&#38505;&#20998;&#37197;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Risk Budgeting Allocation for Dynamic Risk Measures. (arXiv:2305.11319v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.11319
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21160;&#24577;&#39118;&#38505;&#24230;&#37327;&#30340;&#39118;&#38505;&#20998;&#37197;&#31574;&#30053;&#65292;&#24341;&#20837;&#20102;&#21160;&#24577;&#39118;&#38505;&#36129;&#29486;&#30340;&#27010;&#24565;&#36827;&#34892;&#36882;&#24402;&#35745;&#31639;&#65292;&#35777;&#26126;&#20102;&#35813;&#38382;&#39064;&#21487;&#20197;&#34987;&#37325;&#26032;&#34920;&#36848;&#20026;&#19968;&#31995;&#21015;&#20005;&#26684;&#20984;&#30340;&#20248;&#21270;&#38382;&#39064;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#31181;&#28436;&#21592;-&#35780;&#35770;&#23478;&#26041;&#27861;&#35299;&#20915;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#39118;&#38505;&#20998;&#37197;&#31574;&#30053;&#65292;&#21363;&#39118;&#38505;&#22810;&#20803;&#21270;&#32452;&#21512;&#31574;&#30053;&#65292;&#22312;&#35813;&#31574;&#30053;&#20013;&#65292;&#20351;&#29992;&#21160;&#24577;&#26102;&#19968;&#33268;&#30340;&#39118;&#38505;&#24230;&#37327;&#26469;&#34913;&#37327;&#39118;&#38505;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#21160;&#24577;&#39118;&#38505;&#36129;&#29486;&#30340;&#27010;&#24565;&#65292;&#23427;&#25512;&#24191;&#20102;&#32463;&#20856;&#30340;&#27431;&#25289;&#36129;&#29486;&#65292;&#24182;&#20801;&#35768;&#25105;&#20204;&#20197;&#36882;&#24402;&#26041;&#24335;&#33719;&#24471;&#21160;&#24577;&#39118;&#38505;&#36129;&#29486;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#65292;&#23545;&#20110;&#21160;&#24577;&#30456;&#24178;&#30072;&#21464;&#39118;&#38505;&#24230;&#37327;&#30340;&#31867;&#21035;&#65292;&#39118;&#38505;&#20998;&#37197;&#38382;&#39064;&#21487;&#20197;&#34987;&#37325;&#26032;&#34920;&#36848;&#20026;&#19968;&#31995;&#21015;&#20005;&#26684;&#20984;&#30340;&#20248;&#21270;&#38382;&#39064;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#20219;&#20309;&#33258;&#25105;&#34701;&#36164;&#30340;&#21160;&#24577;&#39118;&#38505;&#39044;&#31639;&#31574;&#30053;&#65292;&#20854;&#21021;&#22987;&#36130;&#23500;&#20026;1&#65292;&#37117;&#26159;&#19968;&#31995;&#21015;&#20984;&#20248;&#21270;&#38382;&#39064;&#21807;&#19968;&#35299;&#30340;&#32553;&#25918;&#29256;&#26412;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#24320;&#21457;&#20102;&#19968;&#31181;&#28436;&#21592;-&#35780;&#35770;&#23478;&#26041;&#27861;&#65292;&#21033;&#29992;&#21160;&#24577;&#39118;&#38505;&#24230;&#37327;&#30340;&#21487;&#28608;&#21457;&#24615;&#65292;&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#26469;&#35299;&#20915;&#39118;&#38505;&#39044;&#31639;&#31574;&#30053;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
We define and develop an approach for risk budgeting allocation -- a risk diversification portfolio strategy -- where risk is measured using a dynamic time-consistent risk measure. For this, we introduce a notion of dynamic risk contributions that generalise the classical Euler contributions and which allow us to obtain dynamic risk contributions in a recursive manner. We prove that, for the class of dynamic coherent distortion risk measures, the risk allocation problem may be recast as a sequence of strictly convex optimisation problems. Moreover, we show that any self-financing dynamic risk budgeting strategy with initial wealth of $1$ is a scaled version of the unique solution of the sequence of convex optimisation problems. Furthermore, we develop an actor-critic approach, leveraging the elicitability of dynamic risk measures, to solve for risk budgeting strategy using deep learning.
&lt;/p&gt;</description></item></channel></rss>