<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#32479;&#35745;&#22871;&#21033;&#20132;&#26131;&#31574;&#30053;&#65292;&#36890;&#36807;&#35299;&#20915;&#39034;&#24207;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#65292;&#25581;&#31034;&#20102;&#26368;&#20248;&#20837;&#22330;&#21644;&#36864;&#20986;&#26102;&#26426;&#65292;&#20174;&#32780;&#26368;&#22823;&#21270;&#25910;&#30410;&#12290;&#25968;&#20540;&#32467;&#26524;&#34920;&#26126;&#35813;&#31574;&#30053;&#22312;&#21508;&#31181;&#24773;&#26223;&#19979;&#30340;&#34920;&#29616;&#20248;&#20110;&#20256;&#32479;&#22343;&#20540;&#22238;&#22797;&#20132;&#26131;&#35268;&#21017;&#12290;</title><link>http://arxiv.org/abs/2309.16008</link><description>&lt;p&gt;
&#24102;&#26377;&#31614;&#21517;&#30340;&#32479;&#35745;&#22871;&#21033;&#20013;&#30340;&#26368;&#20248;&#20837;&#22330;&#21644;&#36864;&#20986;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Optimal Entry and Exit with Signature in Statistical Arbitrage. (arXiv:2309.16008v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.16008
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#32479;&#35745;&#22871;&#21033;&#20132;&#26131;&#31574;&#30053;&#65292;&#36890;&#36807;&#35299;&#20915;&#39034;&#24207;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#65292;&#25581;&#31034;&#20102;&#26368;&#20248;&#20837;&#22330;&#21644;&#36864;&#20986;&#26102;&#26426;&#65292;&#20174;&#32780;&#26368;&#22823;&#21270;&#25910;&#30410;&#12290;&#25968;&#20540;&#32467;&#26524;&#34920;&#26126;&#35813;&#31574;&#30053;&#22312;&#21508;&#31181;&#24773;&#26223;&#19979;&#30340;&#34920;&#29616;&#20248;&#20110;&#20256;&#32479;&#22343;&#20540;&#22238;&#22797;&#20132;&#26131;&#35268;&#21017;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#23637;&#29616;&#22343;&#20540;&#22238;&#22797;&#29305;&#24615;&#30340;&#20215;&#26684;&#24046;&#30340;&#20132;&#26131;&#30340;&#26368;&#20248;&#26102;&#26426;&#31574;&#30053;&#12290;&#25105;&#20204;&#21046;&#23450;&#20102;&#19968;&#20010;&#39034;&#24207;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#65292;&#20998;&#26512;&#20102;&#22312;&#32771;&#34385;&#20132;&#26131;&#25104;&#26412;&#24433;&#21709;&#30340;&#24773;&#20917;&#19979;&#65292;&#36827;&#20837;&#21644;&#38543;&#21518;&#28165;&#31639;&#20179;&#20301;&#30340;&#26368;&#20248;&#26102;&#26426;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21033;&#29992;&#20102;&#31614;&#21517;&#26368;&#20248;&#20572;&#27490;&#26041;&#27861;&#26469;&#35299;&#20915;&#36825;&#20010;&#39034;&#24207;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#65292;&#20174;&#32780;&#25581;&#31034;&#20102;&#26368;&#22823;&#21270;&#25910;&#30410;&#30340;&#30830;&#20999;&#20837;&#22330;&#21644;&#36864;&#20986;&#26102;&#26426;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#36866;&#24212;&#20102;&#24191;&#27867;&#30340;&#22343;&#20540;&#22238;&#22797;&#21160;&#21147;&#23398;&#65292;&#36866;&#29992;&#20110;&#21508;&#31181;&#24773;&#26223;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#25968;&#20540;&#32467;&#26524;&#26469;&#35777;&#26126;&#19982;&#20256;&#32479;&#22343;&#20540;&#22238;&#22797;&#20132;&#26131;&#35268;&#21017;&#30456;&#27604;&#20854;&#21331;&#36234;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we explore an optimal timing strategy for the trading of price spreads exhibiting mean-reverting characteristics. A sequential optimal stopping problem is formulated to analyze the optimal timings for both entering and subsequently liquidating positions, all while considering the impact of transaction costs. Our approach leverages the signature optimal stopping method to resolve this sequential optimal stopping problem, thereby unveiling the precise entry and exit timings that maximize gains. Our framework accommodates a wide range of mean reversion dynamics, offering adaptability to diverse scenarios. Numerical results are provided to demonstrate its superior performance when comparing with conventional mean reversion trading rules.
&lt;/p&gt;</description></item></channel></rss>