<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#30740;&#31350;&#36890;&#36807;&#21487;&#35265;&#24230;&#22270;&#26041;&#27861;&#23545;&#21407;&#27833;&#26399;&#36135;&#24066;&#22330;&#36827;&#34892;&#20102;&#28145;&#20837;&#20998;&#26512;&#65292;&#21457;&#29616;&#20102;VG&#30340;&#24130;&#24459;&#34928;&#20943;&#21644;&#26174;&#33879;&#32858;&#31867;&#29305;&#24615;&#12290;&#30740;&#31350;&#32467;&#26524;&#25581;&#31034;&#20102;&#21407;&#27833;&#26399;&#36135;&#24066;&#22330;&#30340;&#23567;&#19990;&#30028;&#23646;&#24615;&#21644;&#22797;&#26434;&#21516;&#31867;&#28151;&#21512;&#29305;&#24449;&#12290;WTI&#21644;Brent&#24066;&#22330;&#34920;&#29616;&#19968;&#33268;&#65292;&#32780;SC&#24066;&#22330;&#26377;&#25152;&#20559;&#31163;&#12290;</title><link>http://arxiv.org/abs/2310.18903</link><description>&lt;p&gt;
&#21407;&#27833;&#26399;&#36135;&#24066;&#22330;&#30340;&#21487;&#35265;&#24230;&#22270;&#20998;&#26512;&#65306;&#26469;&#33258;COVID-19&#30123;&#24773;&#21644;&#20420;&#20044;&#20914;&#31361;&#30340;&#35265;&#35299;
&lt;/p&gt;
&lt;p&gt;
Visibility graph analysis of crude oil futures markets: Insights from the COVID-19 pandemic and Russia-Ukraine conflict. (arXiv:2310.18903v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.18903
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#36890;&#36807;&#21487;&#35265;&#24230;&#22270;&#26041;&#27861;&#23545;&#21407;&#27833;&#26399;&#36135;&#24066;&#22330;&#36827;&#34892;&#20102;&#28145;&#20837;&#20998;&#26512;&#65292;&#21457;&#29616;&#20102;VG&#30340;&#24130;&#24459;&#34928;&#20943;&#21644;&#26174;&#33879;&#32858;&#31867;&#29305;&#24615;&#12290;&#30740;&#31350;&#32467;&#26524;&#25581;&#31034;&#20102;&#21407;&#27833;&#26399;&#36135;&#24066;&#22330;&#30340;&#23567;&#19990;&#30028;&#23646;&#24615;&#21644;&#22797;&#26434;&#21516;&#31867;&#28151;&#21512;&#29305;&#24449;&#12290;WTI&#21644;Brent&#24066;&#22330;&#34920;&#29616;&#19968;&#33268;&#65292;&#32780;SC&#24066;&#22330;&#26377;&#25152;&#20559;&#31163;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20840;&#29699;&#37329;&#34701;&#24066;&#22330;&#21463;&#21040;&#20420;&#20044;&#20914;&#31361;&#21644;COVID-19&#30123;&#24773;&#30340;&#37325;&#22823;&#24433;&#21709;&#30340;&#32972;&#26223;&#19979;&#65292;&#26412;&#30740;&#31350;&#23545;&#19977;&#20010;&#20027;&#35201;&#30340;&#21407;&#27833;&#26399;&#36135;&#24066;&#22330;&#65288;WTI&#12289;Brent&#21644;&#19978;&#28023;&#65288;SC&#65289;&#65289;&#36827;&#34892;&#20102;&#24443;&#24213;&#30340;&#20998;&#26512;&#12290;&#37319;&#29992;&#21487;&#35265;&#24230;&#22270;&#65288;VG&#65289;&#26041;&#27861;&#65292;&#25105;&#20204;&#20351;&#29992;&#26085;&#24120;&#21644;&#39640;&#39057;&#25968;&#25454;&#26469;&#30740;&#31350;&#38745;&#24577;&#21644;&#21160;&#24577;&#29305;&#24615;&#12290;&#25105;&#20204;&#21457;&#29616;&#22823;&#22810;&#25968;VG&#24230;&#20998;&#24067;&#26174;&#31034;&#20986;&#26126;&#26174;&#30340;&#24130;&#24459;&#34928;&#20943;&#65292;&#24182;&#24378;&#35843;&#20102;&#21407;&#27833;&#26399;&#36135;VG&#20869;&#30340;&#26174;&#33879;&#32858;&#31867;&#29305;&#24615;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#36824;&#35777;&#23454;&#20102;&#32858;&#31867;&#31995;&#25968;&#19982;&#33410;&#28857;&#24230;&#25968;&#20043;&#38388;&#30340;&#36127;&#30456;&#20851;&#20851;&#31995;&#65292;&#24182;&#36827;&#19968;&#27493;&#25581;&#31034;&#20102;&#25152;&#26377;VG&#19981;&#20165;&#36981;&#24490;&#23567;&#19990;&#30028;&#23646;&#24615;&#65292;&#32780;&#19988;&#21576;&#29616;&#22797;&#26434;&#30340;&#21516;&#31867;&#28151;&#21512;&#12290;&#36890;&#36807;VG&#30340;&#26102;&#21464;&#29305;&#24615;&#65292;&#25105;&#20204;&#21457;&#29616;WTI&#21644;Brent&#34920;&#29616;&#20986;&#19968;&#33268;&#30340;&#34892;&#20026;&#65292;&#32780;&#20855;&#26377;&#29420;&#29305;&#20132;&#26131;&#26426;&#21046;&#30340;SC&#24066;&#22330;&#21017;&#26377;&#25152;&#20559;&#31163;&#12290;5&#20998;&#38047;VG&#30340;&#21516;&#31867;&#28151;&#21512;&#31995;&#25968;&#25552;&#20379;&#20102;&#19968;&#31181;&#28145;&#20837;&#20998;&#26512;&#21407;&#27833;&#26399;&#36135;&#24066;&#22330;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Drawing inspiration from the significant impact of the ongoing Russia-Ukraine conflict and the recent COVID-19 pandemic on global financial markets, this study conducts a thorough analysis of three key crude oil futures markets: WTI, Brent, and Shanghai (SC). Employing the visibility graph (VG) methodology, we examine both static and dynamic characteristics using daily and high-frequency data. We identified a clear power-law decay in most VG degree distributions and highlighted the pronounced clustering tendencies within crude oil futures VGs. Our results also confirm an inverse correlation between clustering coefficient and node degree and further reveal that all VGs not only adhere to the small-world property but also exhibit intricate assortative mixing. Through the time-varying characteristics of VGs, we found that WTI and Brent demonstrate aligned behavior, while the SC market, with its unique trading mechanics, deviates. The 5-minute VGs' assortativity coefficient provides a deep
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#38024;&#23545;&#20445;&#38505;&#20013;&#39640;&#25928;&#30340;&#21518;&#39564;&#36153;&#29575;&#21046;&#23450;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#20351;&#29992;&#20195;&#29702;&#27169;&#22411;&#26041;&#27861;&#26469;&#33719;&#24471;&#23553;&#38381;&#24335;&#34920;&#36798;&#24335;&#35745;&#31639;&#20445;&#36153;&#30340;&#26041;&#26696;&#65292;&#21516;&#26102;&#24341;&#36827;&#20102;&#21487;&#20449;&#24230;&#25351;&#25968;&#20316;&#20026;&#20445;&#36153;&#35745;&#31639;&#30340;&#25688;&#35201;&#32479;&#35745;&#20449;&#24687;&#65292;&#36991;&#20813;&#20102;&#22240;&#35745;&#31639;&#20195;&#20215;&#39640;&#26114;&#25110;&#35745;&#31639;&#36807;&#31243;&#25104;&#20026;&#8220;&#40657;&#30418;&#8221;&#32780;&#24102;&#26469;&#30340;&#38480;&#21046;&#12290;</title><link>http://arxiv.org/abs/2211.06568</link><description>&lt;p&gt;
&#22522;&#20110;&#20195;&#29702;&#24314;&#27169;&#30340;&#22823;&#22411;&#20445;&#38505;&#25237;&#36164;&#32452;&#21512;&#39640;&#25928;&#21518;&#39564;&#36153;&#29575;&#21046;&#23450;
&lt;/p&gt;
&lt;p&gt;
Effective a Posteriori Ratemaking with Large Insurance Portfolios via Surrogate Modeling. (arXiv:2211.06568v2 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.06568
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#38024;&#23545;&#20445;&#38505;&#20013;&#39640;&#25928;&#30340;&#21518;&#39564;&#36153;&#29575;&#21046;&#23450;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#20351;&#29992;&#20195;&#29702;&#27169;&#22411;&#26041;&#27861;&#26469;&#33719;&#24471;&#23553;&#38381;&#24335;&#34920;&#36798;&#24335;&#35745;&#31639;&#20445;&#36153;&#30340;&#26041;&#26696;&#65292;&#21516;&#26102;&#24341;&#36827;&#20102;&#21487;&#20449;&#24230;&#25351;&#25968;&#20316;&#20026;&#20445;&#36153;&#35745;&#31639;&#30340;&#25688;&#35201;&#32479;&#35745;&#20449;&#24687;&#65292;&#36991;&#20813;&#20102;&#22240;&#35745;&#31639;&#20195;&#20215;&#39640;&#26114;&#25110;&#35745;&#31639;&#36807;&#31243;&#25104;&#20026;&#8220;&#40657;&#30418;&#8221;&#32780;&#24102;&#26469;&#30340;&#38480;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20445;&#38505;&#20013;&#30340;&#21518;&#39564;&#36153;&#29575;&#21046;&#23450;&#21033;&#29992;&#36125;&#21494;&#26031;&#21487;&#20449;&#24230;&#27169;&#22411;&#26469;&#21319;&#32423;&#21512;&#21516;&#30340;&#24403;&#21069;&#20445;&#36153;&#65292;&#32771;&#34385;&#21040;&#25237;&#20445;&#20154;&#30340;&#23646;&#24615;&#21644;&#32034;&#36180;&#35760;&#24405;&#12290;&#22823;&#22810;&#25968;&#29992;&#20110;&#27492;&#20219;&#21153;&#30340;&#25968;&#25454;&#39537;&#21160;&#27169;&#22411;&#22312;&#25968;&#23398;&#19978;&#26159;&#38590;&#20197;&#22788;&#29702;&#30340;&#65292;&#22240;&#27492;&#24517;&#39035;&#36890;&#36807;&#25968;&#20540;&#26041;&#27861;&#22914;MCMC&#31561;&#27169;&#25311;&#26041;&#27861;&#26469;&#33719;&#24471;&#20445;&#36153;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#26041;&#27861;&#22312;&#31574;&#30053;&#20445;&#25345;&#32773;&#23618;&#38754;&#19978;&#36827;&#34892;&#26102;&#65292;&#23545;&#20110;&#22823;&#22411;&#25237;&#36164;&#32452;&#21512;&#32780;&#35328;&#35745;&#31639;&#20195;&#20215;&#26114;&#36149;&#19988;&#20855;&#26377;&#38480;&#21046;&#24615;&#12290;&#27492;&#22806;&#65292;&#36825;&#20123;&#35745;&#31639;&#21464;&#25104;&#20102;&#8220;&#40657;&#30418;&#8221;&#22788;&#29702;&#65292;&#22240;&#20026;&#27809;&#26377;&#34920;&#36798;&#24335;&#26174;&#31034;&#22914;&#20309;&#20351;&#29992;&#31574;&#30053;&#20445;&#25345;&#32773;&#30340;&#32034;&#36180;&#21382;&#21490;&#26469;&#21319;&#32423;&#20854;&#20445;&#36153;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#65292;&#26412;&#25991;&#25552;&#20986;&#37319;&#29992;&#20195;&#29702;&#24314;&#27169;&#26041;&#27861;&#65292;&#20197;&#20415;&#20110;&#20302;&#25104;&#26412;&#22320;&#20026;&#20219;&#20309;&#32473;&#23450;&#27169;&#22411;&#35745;&#31639;&#20986;&#36125;&#21494;&#26031;&#21487;&#20449;&#24230;&#20445;&#36153;&#30340;&#23553;&#38381;&#24335;&#34920;&#36798;&#24335;&#12290;&#20316;&#20026;&#26041;&#27861;&#30340;&#19968;&#37096;&#20998;&#65292;&#26412;&#25991;&#20171;&#32461;&#20102;&#8220;&#21487;&#20449;&#24230;&#25351;&#25968;&#8221;&#65292;&#23427;&#26159;&#31574;&#30053;&#20445;&#25345;&#32773;&#32034;&#36180;&#30340;&#25688;&#35201;&#32479;&#35745;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;
A posteriori ratemaking in insurance uses a Bayesian credibility model to upgrade the current premiums of a contract by taking into account policyholders' attributes and their claim history. Most data-driven models used for this task are mathematically intractable, and premiums must be then obtained through numerical methods such as simulation such MCMC. However, these methods can be computationally expensive and prohibitive for large portfolios when applied at the policyholder level. Additionally, these computations become ``black-box" procedures as there is no expression showing how the claim history of policyholders is used to upgrade their premiums. To address these challenges, this paper proposes the use of a surrogate modeling approach to inexpensively derive a closed-form expression for computing the Bayesian credibility premiums for any given model. As a part of the methodology, the paper introduces the ``credibility index", which is a summary statistic of a policyholder's clai
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#22810;&#27169;&#24577;&#27169;&#22411;&#36827;&#34892;&#27604;&#29305;&#24065;&#26497;&#31471;&#20215;&#26684;&#27874;&#21160;&#39044;&#27979;&#30340;&#26041;&#27861;&#65292;&#23558;&#30456;&#20851;&#36164;&#20135;&#12289;&#25216;&#26415;&#25351;&#26631;&#21644;Twitter&#20869;&#23481;&#20316;&#20026;&#36755;&#20837;&#12290;&#36890;&#36807;&#20351;&#29992;&#39044;&#35757;&#32451;&#30340;&#37329;&#34701;&#35789;&#27719;&#34920;&#30340;&#21477;&#32423;FinBERT&#23884;&#20837;&#65292;&#27169;&#22411;&#21487;&#20197;&#26377;&#25928;&#22320;&#25429;&#25417;&#25512;&#25991;&#20013;&#30340;&#20869;&#23481;&#65292;&#20174;&#32780;&#39044;&#27979;&#27604;&#29305;&#24065;&#30340;&#20215;&#26684;&#27874;&#21160;&#12290;</title><link>http://arxiv.org/abs/2206.00648</link><description>&lt;p&gt;
PreBit -- &#19968;&#31181;&#21033;&#29992;Twitter FinBERT&#23884;&#20837;&#30340;&#22810;&#27169;&#24577;&#27169;&#22411;&#65292;&#29992;&#20110;&#27604;&#29305;&#24065;&#30340;&#26497;&#31471;&#20215;&#26684;&#27874;&#21160;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
PreBit -- A multimodal model with Twitter FinBERT embeddings for extreme price movement prediction of Bitcoin. (arXiv:2206.00648v2 [q-fin.ST] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.00648
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#22810;&#27169;&#24577;&#27169;&#22411;&#36827;&#34892;&#27604;&#29305;&#24065;&#26497;&#31471;&#20215;&#26684;&#27874;&#21160;&#39044;&#27979;&#30340;&#26041;&#27861;&#65292;&#23558;&#30456;&#20851;&#36164;&#20135;&#12289;&#25216;&#26415;&#25351;&#26631;&#21644;Twitter&#20869;&#23481;&#20316;&#20026;&#36755;&#20837;&#12290;&#36890;&#36807;&#20351;&#29992;&#39044;&#35757;&#32451;&#30340;&#37329;&#34701;&#35789;&#27719;&#34920;&#30340;&#21477;&#32423;FinBERT&#23884;&#20837;&#65292;&#27169;&#22411;&#21487;&#20197;&#26377;&#25928;&#22320;&#25429;&#25417;&#25512;&#25991;&#20013;&#30340;&#20869;&#23481;&#65292;&#20174;&#32780;&#39044;&#27979;&#27604;&#29305;&#24065;&#30340;&#20215;&#26684;&#27874;&#21160;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27604;&#29305;&#24065;&#20197;&#20854;&#19981;&#26029;&#22686;&#38271;&#30340;&#21463;&#27426;&#36814;&#31243;&#24230;&#23637;&#31034;&#20102;&#33258;&#20854;&#35806;&#29983;&#20197;&#26469;&#30340;&#26497;&#31471;&#20215;&#26684;&#27874;&#21160;&#24615;&#12290;&#36825;&#31181;&#27874;&#21160;&#24615;&#65292;&#21152;&#19978;&#20854;&#21435;&#20013;&#24515;&#21270;&#30340;&#24615;&#36136;&#65292;&#20351;&#27604;&#29305;&#24065;&#30456;&#23545;&#20110;&#26356;&#20256;&#32479;&#30340;&#36164;&#20135;&#26356;&#23481;&#26131;&#21463;&#21040;&#25237;&#26426;&#20132;&#26131;&#30340;&#24433;&#21709;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#39044;&#27979;&#26497;&#31471;&#20215;&#26684;&#27874;&#21160;&#30340;&#22810;&#27169;&#24577;&#27169;&#22411;&#12290;&#35813;&#27169;&#22411;&#23558;&#21508;&#31181;&#30456;&#20851;&#36164;&#20135;&#12289;&#25216;&#26415;&#25351;&#26631;&#20197;&#21450;Twitter&#20869;&#23481;&#20316;&#20026;&#36755;&#20837;&#12290;&#22312;&#19968;&#39033;&#28145;&#20837;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;&#26469;&#33258;&#22823;&#20247;&#23545;&#27604;&#29305;&#24065;&#30340;&#31038;&#20132;&#23186;&#20307;&#35752;&#35770;&#26159;&#21542;&#20855;&#26377;&#26497;&#31471;&#20215;&#26684;&#27874;&#21160;&#30340;&#39044;&#27979;&#33021;&#21147;&#12290;&#25105;&#20204;&#25910;&#38598;&#20102;&#20174;2015&#24180;&#21040;2021&#24180;&#27599;&#22825;&#21253;&#21547;&#20851;&#38190;&#35789;&#8220;&#27604;&#29305;&#24065;&#8221;&#30340;5,000&#26465;&#25512;&#25991;&#30340;&#25968;&#25454;&#38598;&#65292;&#31216;&#20026;PreBit&#65292;&#24182;&#23558;&#20854;&#22312;&#32593;&#19978;&#25552;&#20379;&#12290;&#22312;&#25105;&#20204;&#30340;&#28151;&#21512;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#22312;&#37329;&#34701;&#35789;&#27719;&#34920;&#19978;&#39044;&#35757;&#32451;&#30340;&#21477;&#32423;FinBERT&#23884;&#20837;&#65292;&#20197;&#20415;&#20197;&#21487;&#29702;&#35299;&#30340;&#26041;&#24335;&#25429;&#25417;&#25512;&#25991;&#30340;&#20840;&#37096;&#20869;&#23481;&#24182;&#23558;&#20854;&#25552;&#20379;&#32473;&#27169;&#22411;&#12290;&#36890;&#36807;&#23558;&#36825;&#20123;&#23884;&#20837;&#19982;&#19968;&#31181;&#21367;&#31215;&#23618;&#32467;&#21512;&#36215;&#26469;&#65292;&#25105;&#20204;&#21487;&#20197;&#25552;&#21462;&#25512;&#25991;&#30340;&#29305;&#24449;&#20449;&#24687;&#65292;&#24182;&#22312;&#27169;&#22411;&#20013;&#36827;&#34892;&#26497;&#31471;&#20215;&#26684;&#27874;&#21160;&#30340;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
Bitcoin, with its ever-growing popularity, has demonstrated extreme price volatility since its origin. This volatility, together with its decentralised nature, make Bitcoin highly subjective to speculative trading as compared to more traditional assets. In this paper, we propose a multimodal model for predicting extreme price fluctuations. This model takes as input a variety of correlated assets, technical indicators, as well as Twitter content. In an in-depth study, we explore whether social media discussions from the general public on Bitcoin have predictive power for extreme price movements. A dataset of 5,000 tweets per day containing the keyword `Bitcoin' was collected from 2015 to 2021. This dataset, called PreBit, is made available online. In our hybrid model, we use sentence-level FinBERT embeddings, pretrained on financial lexicons, so as to capture the full contents of the tweets and feed it to the model in an understandable way. By combining these embeddings with a Convoluti
&lt;/p&gt;</description></item></channel></rss>