<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#31614;&#21517;&#27874;&#21160;&#24615;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#20855;&#26377;&#26222;&#36866;&#24615;&#24182;&#21487;&#20197;&#29992;&#20110;&#23450;&#20215;&#21644;&#23545;&#20914;&#19981;&#21516;&#31867;&#22411;&#30340;&#26399;&#26435;&#12290;&#30740;&#31350;&#21033;&#29992;Fourier&#21453;&#28436;&#25216;&#26415;&#23454;&#29616;&#20102;&#39640;&#25928;&#20934;&#30830;&#30340;&#23450;&#20215;&#21644;&#23545;&#20914;&#12290;&#20854;&#20013;&#20851;&#38190;&#21019;&#26032;&#26159;&#36890;&#36807;&#25512;&#23548;&#32852;&#21512;&#29305;&#24449;&#20989;&#25968;&#35299;&#20915;&#20102;&#26080;&#38480;&#32500;&#25193;&#23637;&#24352;&#37327;&#20195;&#25968;&#20540;&#30340;Riccati&#26041;&#31243;&#12290;</title><link>https://arxiv.org/abs/2402.01820</link><description>&lt;p&gt;
&#31614;&#21517;&#27874;&#21160;&#24615;&#27169;&#22411;&#65306;&#22522;&#20110;Fourier&#30340;&#23450;&#20215;&#21644;&#23545;&#20914;
&lt;/p&gt;
&lt;p&gt;
Signature volatility models: pricing and hedging with Fourier
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01820
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#31614;&#21517;&#27874;&#21160;&#24615;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#20855;&#26377;&#26222;&#36866;&#24615;&#24182;&#21487;&#20197;&#29992;&#20110;&#23450;&#20215;&#21644;&#23545;&#20914;&#19981;&#21516;&#31867;&#22411;&#30340;&#26399;&#26435;&#12290;&#30740;&#31350;&#21033;&#29992;Fourier&#21453;&#28436;&#25216;&#26415;&#23454;&#29616;&#20102;&#39640;&#25928;&#20934;&#30830;&#30340;&#23450;&#20215;&#21644;&#23545;&#20914;&#12290;&#20854;&#20013;&#20851;&#38190;&#21019;&#26032;&#26159;&#36890;&#36807;&#25512;&#23548;&#32852;&#21512;&#29305;&#24449;&#20989;&#25968;&#35299;&#20915;&#20102;&#26080;&#38480;&#32500;&#25193;&#23637;&#24352;&#37327;&#20195;&#25968;&#20540;&#30340;Riccati&#26041;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#19968;&#31181;&#38543;&#26426;&#27874;&#21160;&#24615;&#27169;&#22411;&#65292;&#20854;&#20013;&#27874;&#21160;&#24615;&#30340;&#21160;&#21147;&#23398;&#36890;&#36807;&#24067;&#26391;&#36816;&#21160;&#26102;&#38388;&#25512;&#24191;&#31614;&#21517;&#30340;&#20803;&#32032;&#30340;&#21487;&#33021;&#26080;&#38480;&#32447;&#24615;&#32452;&#21512;&#32473;&#20986;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#35813;&#27169;&#22411;&#30340;&#26222;&#36866;&#24615;&#65292;&#22240;&#20026;&#23427;&#21253;&#25324;&#20294;&#19981;&#38480;&#20110;&#33879;&#21517;&#30340;Stein-Stein&#12289;Bergomi&#21644;Heston&#27169;&#22411;&#65292;&#20197;&#21450;&#19968;&#20123;&#36335;&#24452;&#30456;&#20851;&#21464;&#20307;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#23545;&#25968;&#20215;&#26684;&#21644;&#31215;&#20998;&#26041;&#24046;&#30340;&#32852;&#21512;&#29305;&#24449;&#20989;&#25968;&#65292;&#21069;&#25552;&#26159;&#26576;&#20010;&#26080;&#38480;&#32500;&#25193;&#23637;&#24352;&#37327;&#20195;&#25968;&#20540;&#30340;Riccati&#26041;&#31243;&#26377;&#35299;&#12290;&#36825;&#20351;&#24471;&#25105;&#20204;&#33021;&#22815;&#20351;&#29992;Fourier&#21453;&#28436;&#25216;&#26415;&#23450;&#20215;&#21644;&#65288;&#20108;&#27425;&#65289;&#23545;&#20914;&#26576;&#20123;&#27431;&#24335;&#21644;&#36335;&#24452;&#30456;&#20851;&#26399;&#26435;&#12290;&#25105;&#20204;&#22312;&#20840;&#38754;&#30340;&#25968;&#20540;&#30740;&#31350;&#20013;&#31361;&#20986;&#20102;&#36825;&#20123;Fourier&#25216;&#26415;&#30340;&#25928;&#29575;&#21644;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider a stochastic volatility model where the dynamics of the volatility are given by a possibly infinite linear combination of the elements of the time extended signature of a Brownian motion. First, we show that the model is remarkably universal, as it includes, but is not limited to, the celebrated Stein-Stein, Bergomi, and Heston models, together with some path-dependent variants. Second, we derive the joint characteristic functional of the log-price and integrated variance provided that some infinite dimensional extended tensor algebra valued Riccati equation admits a solution. This allows us to price and (quadratically) hedge certain European and path-dependent options using Fourier inversion techniques. We highlight the efficiency and accuracy of these Fourier techniques in a comprehensive numerical study.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#35780;&#20272;&#20102;&#21380;&#29916;&#22810;&#23572;&#20154;&#31867;&#21457;&#23637;&#27941;&#36148;&#23545;&#31526;&#21512;&#36164;&#26684;&#23478;&#24237;&#23376;&#22899;&#22312;&#27491;&#24335;&#37096;&#38376;&#21171;&#21160;&#21147;&#24066;&#22330;&#32467;&#26524;&#19978;&#30340;&#38271;&#26399;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#35813;&#27941;&#36148;&#22312;&#26292;&#38706;&#21518;&#32422;&#21313;&#24180;&#20043;&#21518;&#22686;&#21152;&#20102;&#27491;&#24335;&#38599;&#20323;&#29575;&#21644;&#21171;&#21160;&#25910;&#20837;&#65292;&#20174;&#32780;&#25233;&#21046;&#20102;&#36139;&#22256;&#30340;&#20195;&#38469;&#20256;&#36882;&#12290;</title><link>http://arxiv.org/abs/2309.17216</link><description>&lt;p&gt;
&#21380;&#29916;&#22810;&#23572;&#65288;&#38750;&#65289;&#26377;&#26465;&#20214;&#29616;&#37329;&#36716;&#31227;&#23545;&#21171;&#21160;&#21147;&#24066;&#22330;&#24433;&#21709;&#30340;&#38271;&#26399;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The long-term impact of (un)conditional cash transfers on labour market outcomes in Ecuador. (arXiv:2309.17216v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.17216
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35780;&#20272;&#20102;&#21380;&#29916;&#22810;&#23572;&#20154;&#31867;&#21457;&#23637;&#27941;&#36148;&#23545;&#31526;&#21512;&#36164;&#26684;&#23478;&#24237;&#23376;&#22899;&#22312;&#27491;&#24335;&#37096;&#38376;&#21171;&#21160;&#21147;&#24066;&#22330;&#32467;&#26524;&#19978;&#30340;&#38271;&#26399;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#35813;&#27941;&#36148;&#22312;&#26292;&#38706;&#21518;&#32422;&#21313;&#24180;&#20043;&#21518;&#22686;&#21152;&#20102;&#27491;&#24335;&#38599;&#20323;&#29575;&#21644;&#21171;&#21160;&#25910;&#20837;&#65292;&#20174;&#32780;&#25233;&#21046;&#20102;&#36139;&#22256;&#30340;&#20195;&#38469;&#20256;&#36882;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#26377;&#26465;&#20214;&#29616;&#37329;&#36716;&#31227;&#22312;&#20302;&#25910;&#20837;&#21644;&#20013;&#31561;&#25910;&#20837;&#22269;&#23478;&#24456;&#21463;&#27426;&#36814;&#65292;&#20294;&#23545;&#20854;&#38271;&#26399;&#25928;&#26524;&#30340;&#35777;&#25454;&#20173;&#28982;&#24456;&#23569;&#12290;&#26412;&#25991;&#35780;&#20272;&#20102;&#21380;&#29916;&#22810;&#23572;&#20154;&#31867;&#21457;&#23637;&#27941;&#36148;&#23545;&#31526;&#21512;&#36164;&#26684;&#23478;&#24237;&#23376;&#22899;&#22312;&#27491;&#24335;&#37096;&#38376;&#21171;&#21160;&#21147;&#24066;&#22330;&#32467;&#26524;&#19978;&#30340;&#24433;&#21709;&#12290;&#36825;&#39033;&#27941;&#36148;&#26159;&#26368;&#26089;&#30340;&#19968;&#31181;&#65292;&#20854;&#31526;&#21512;&#36164;&#26684;&#26631;&#20934;&#30340;&#25191;&#34892;&#21147;&#24230;&#36739;&#24369;&#12290;&#36890;&#36807;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#35774;&#35745;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#21457;&#29616;&#36825;&#20010;&#35745;&#21010;&#22312;&#26292;&#38706;&#21518;&#32422;&#21313;&#24180;&#20043;&#21518;&#22686;&#21152;&#20102;&#27491;&#24335;&#38599;&#20323;&#29575;&#21644;&#21171;&#21160;&#25910;&#20837;&#65292;&#20174;&#32780;&#25233;&#21046;&#20102;&#36139;&#22256;&#30340;&#20195;&#38469;&#20256;&#36882;&#12290;&#25105;&#20204;&#26681;&#25454;&#20197;&#21069;&#30340;&#25991;&#29486;&#30740;&#31350;&#32467;&#26524;&#35752;&#35770;&#21487;&#33021;&#30340;&#20013;&#20171;&#26426;&#21046;&#65292;&#24182;&#25552;&#20379;&#35777;&#25454;&#34920;&#26126;&#36825;&#20010;&#35745;&#21010;&#22914;&#20309;&#22312;&#20013;&#26399;&#20419;&#36827;&#20102;&#23398;&#26657;&#30340;&#25345;&#20037;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Despite the popularity of conditional cash transfers in low- and middle-income countries, evidence on their long-term effects remains scarce. This paper assesses the impact of the Ecuador's Human Development Grant on the formal sector labour market outcomes of children in eligible households. This grant -- one of the first of its kind -- is characterised by weak enforcement of its eligibility criteria. By means of a regression discontinuity design, we find that this programme increased formal employment rates and labour income around a decade after exposure, thereby curbing the intergenerational transmission of poverty. We discuss possible mediating mechanisms based on findings from previous literature and, in particular, provide evidence on how the programme contributed to persistence in school in the medium run.
&lt;/p&gt;</description></item><item><title>&#22797;&#21512;&#25490;&#24207;&#26159;&#19968;&#20010;&#26032;&#30340;&#25490;&#24207;&#26694;&#26550;&#65292;&#36890;&#36807;&#23558;&#19981;&#21516;&#31867;&#22411;&#30340;&#24037;&#20316;&#32773;&#20998;&#37197;&#21040;&#21516;&#19968;&#20010;&#32844;&#19994;&#20013;&#24182;&#21516;&#26102;&#36827;&#34892;&#27491;&#21521;&#21644;&#36127;&#21521;&#25490;&#24207;&#26469;&#23454;&#29616;&#12290;&#24403;&#22266;&#23450;&#25237;&#36164;&#20943;&#36731;&#20102;&#19981;&#21305;&#37197;&#30340;&#21487;&#21464;&#25104;&#26412;&#26102;&#65292;&#22797;&#21512;&#25490;&#24207;&#21487;&#20197;&#20135;&#29983;&#22823;&#37327;&#30340;&#24037;&#36164;&#20998;&#25955;&#31243;&#24230;&#12290;</title><link>http://arxiv.org/abs/2303.06701</link><description>&lt;p&gt;
&#22797;&#21512;&#25490;&#24207;
&lt;/p&gt;
&lt;p&gt;
Composite Sorting. (arXiv:2303.06701v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.06701
&lt;/p&gt;
&lt;p&gt;
&#22797;&#21512;&#25490;&#24207;&#26159;&#19968;&#20010;&#26032;&#30340;&#25490;&#24207;&#26694;&#26550;&#65292;&#36890;&#36807;&#23558;&#19981;&#21516;&#31867;&#22411;&#30340;&#24037;&#20316;&#32773;&#20998;&#37197;&#21040;&#21516;&#19968;&#20010;&#32844;&#19994;&#20013;&#24182;&#21516;&#26102;&#36827;&#34892;&#27491;&#21521;&#21644;&#36127;&#21521;&#25490;&#24207;&#26469;&#23454;&#29616;&#12290;&#24403;&#22266;&#23450;&#25237;&#36164;&#20943;&#36731;&#20102;&#19981;&#21305;&#37197;&#30340;&#21487;&#21464;&#25104;&#26412;&#26102;&#65292;&#22797;&#21512;&#25490;&#24207;&#21487;&#20197;&#20135;&#29983;&#22823;&#37327;&#30340;&#24037;&#36164;&#20998;&#25955;&#31243;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#25490;&#24207;&#26694;&#26550;&#65306;&#22797;&#21512;&#25490;&#24207;&#12290;&#22797;&#21512;&#25490;&#24207;&#21253;&#25324;&#65288;1&#65289;&#23558;&#19981;&#21516;&#30340;&#24037;&#20316;&#32773;&#31867;&#22411;&#20998;&#37197;&#21040;&#21516;&#19968;&#20010;&#32844;&#19994;&#20013;&#65292;&#20197;&#21450;&#65288;2&#65289;&#32473;&#23450;&#30340;&#24037;&#20316;&#32773;&#31867;&#22411;&#21516;&#26102;&#21442;&#19982;&#27491;&#21521;&#25490;&#24207;&#21644;&#36127;&#21521;&#25490;&#24207;&#12290;&#24403;&#22266;&#23450;&#25237;&#36164;&#20943;&#36731;&#20102;&#19981;&#21305;&#37197;&#30340;&#21487;&#21464;&#25104;&#26412;&#26102;&#65292;&#22797;&#21512;&#25490;&#24207;&#23601;&#20250;&#20986;&#29616;&#12290;&#25105;&#20204;&#23436;&#20840;&#25551;&#36848;&#20102;&#26368;&#20248;&#25490;&#24207;&#65292;&#24182;&#19988;&#36824;&#35777;&#26126;&#20102;&#24403;&#19981;&#21305;&#37197;&#25104;&#26412;&#30340;&#20985;&#24230;&#36739;&#23567;&#26102;&#65292;&#25490;&#24207;&#26356;&#20026;&#31215;&#26497;&#12290;&#28982;&#21518;&#25105;&#20204;&#23545;&#22343;&#34913;&#24037;&#36164;&#36827;&#34892;&#20102;&#25551;&#36848;&#12290;&#24037;&#36164;&#20855;&#26377;&#21306;&#22495;&#23618;&#27425;&#32467;&#26500;&#65292;&#30456;&#23545;&#24037;&#36164;&#20165;&#21462;&#20915;&#20110;&#25216;&#33021;&#32676;&#20307;&#20869;&#30340;&#25490;&#24207;&#12290;&#23450;&#37327;&#19978;&#65292;&#22797;&#21512;&#25490;&#24207;&#21487;&#20197;&#22312;&#32654;&#22269;&#30340;&#32844;&#19994;&#20869;&#20135;&#29983;&#30456;&#24403;&#22823;&#30340;&#24037;&#36164;&#20998;&#25955;&#31243;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a new sorting framework: composite sorting. Composite sorting comprises of (1) distinct worker types assigned to the same occupation, and (2) a given worker type simultaneously being part of both positive and negative sorting. Composite sorting arises when fixed investments mitigate variable costs of mismatch. We completely characterize optimal sorting and additionally show it is more positive when mismatch costs are less concave. We then characterize equilibrium wages. Wages have a regional hierarchical structure relative wages depend solely on sorting within skill groups. Quantitatively, composite sorting can generate a sizable portion of within-occupations wage dispersion in the US.
&lt;/p&gt;</description></item></channel></rss>