<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#21307;&#30103;&#20247;&#31609;&#25968;&#25454;&#65292;&#35777;&#26126;2020&#24180;&#30340;&#40657;&#20154;&#30340;&#21629;&#20063;&#26159;&#21629;&#36816;&#21160;&#20351;&#24471;&#40657;&#20154;&#21644;&#38750;&#40657;&#20154;&#21463;&#30410;&#20154;&#20043;&#38388;&#30340;&#31609;&#27454;&#24046;&#36317;&#20943;&#23569;&#20102;&#32422;50%&#12290;&#36825;&#31181;&#20943;&#23569;&#20027;&#35201;&#24402;&#22240;&#20110;&#38750;&#40657;&#20154;&#25424;&#36192;&#32773;&#65292;&#19988;&#21463;&#21040;&#36866;&#24230;&#40657;&#20154;&#30340;&#21629;&#20063;&#26159;&#21629;&#27963;&#21160;&#30340;&#21439;&#24066;&#24433;&#21709;&#26368;&#22823;&#12290;&#31038;&#20132;&#23186;&#20307;&#26174;&#33879;&#25918;&#22823;&#20102;&#25239;&#35758;&#27963;&#21160;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2310.14590</link><description>&lt;p&gt;
&#40657;&#20154;&#30340;&#21629;&#20063;&#26159;&#21629;&#36816;&#21160;&#33021;&#20943;&#23569;&#31181;&#26063;&#19981;&#24179;&#31561;&#21527;&#65311;&#26469;&#33258;&#21307;&#30103;&#20247;&#31609;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Can Black Lives Matter Movement Reduce Racial Disparity? Evidence from Medical Crowdfunding. (arXiv:2310.14590v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.14590
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#21307;&#30103;&#20247;&#31609;&#25968;&#25454;&#65292;&#35777;&#26126;2020&#24180;&#30340;&#40657;&#20154;&#30340;&#21629;&#20063;&#26159;&#21629;&#36816;&#21160;&#20351;&#24471;&#40657;&#20154;&#21644;&#38750;&#40657;&#20154;&#21463;&#30410;&#20154;&#20043;&#38388;&#30340;&#31609;&#27454;&#24046;&#36317;&#20943;&#23569;&#20102;&#32422;50%&#12290;&#36825;&#31181;&#20943;&#23569;&#20027;&#35201;&#24402;&#22240;&#20110;&#38750;&#40657;&#20154;&#25424;&#36192;&#32773;&#65292;&#19988;&#21463;&#21040;&#36866;&#24230;&#40657;&#20154;&#30340;&#21629;&#20063;&#26159;&#21629;&#27963;&#21160;&#30340;&#21439;&#24066;&#24433;&#21709;&#26368;&#22823;&#12290;&#31038;&#20132;&#23186;&#20307;&#26174;&#33879;&#25918;&#22823;&#20102;&#25239;&#35758;&#27963;&#21160;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#19968;&#23478;&#37325;&#35201;&#30340;&#21307;&#30103;&#20247;&#31609;&#32593;&#31449;&#30340;&#39640;&#39057;&#25424;&#27454;&#25968;&#25454;&#65292;&#35777;&#26126;2020&#24180;&#30340;&#40657;&#20154;&#30340;&#21629;&#20063;&#26159;&#21629;&#36816;&#21160;&#20351;&#24471;&#40657;&#20154;&#21644;&#38750;&#40657;&#20154;&#21463;&#30410;&#20154;&#20043;&#38388;&#30340;&#31609;&#27454;&#24046;&#36317;&#20943;&#23569;&#20102;&#32422;50%&#12290;&#36825;&#31181;&#20943;&#23569;&#20027;&#35201;&#24402;&#22240;&#20110;&#38750;&#40657;&#20154;&#25424;&#36192;&#32773;&#12290;&#22312;&#26377;&#36866;&#24230;&#40657;&#20154;&#30340;&#21629;&#20063;&#26159;&#21629;&#27963;&#21160;&#30340;&#21439;&#24066;&#21463;&#24433;&#21709;&#26368;&#22823;&#12290;&#21019;&#26032;&#30340;&#24037;&#20855;&#21464;&#37327;&#65288;&#21033;&#29992;&#21608;&#26411;&#21644;&#38477;&#38632;&#65289;&#30830;&#23450;&#20102;&#40657;&#20154;&#30340;&#21629;&#20063;&#26159;&#21629;&#25239;&#35758;&#27963;&#21160;&#30340;&#20840;&#29699;&#21644;&#23616;&#37096;&#24433;&#21709;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#24191;&#27867;&#30340;&#31038;&#20250;&#36816;&#21160;&#23545;&#34892;&#20026;&#30340;&#24433;&#21709;&#22823;&#20110;&#23616;&#37096;&#20107;&#20214;&#12290;&#31038;&#20132;&#23186;&#20307;&#26174;&#33879;&#25918;&#22823;&#20102;&#25239;&#35758;&#27963;&#21160;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Using high-frequency donation data from a major medical crowdfunding site, this study demonstrates that the 2020 BLM surge decreased the fundraising gap between Black and non-Black beneficiaries by around 50%. The reduction is largely attributed to non-Black donors. Those in counties with moderate BLM activity were most impacted. Innovative instrumental variable utilizing weekends and rainfall identify global and local effects of BLM protests. Results suggest a broad social movement has a greater influence on behavior than a local event. Social media significantly magnifies the impact of protests.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31639;&#27861;&#20132;&#26131;&#24341;&#23548;&#30340;&#24066;&#22330;&#27169;&#25311;&#26041;&#27861;(ATMS)&#65292;&#36890;&#36807;&#20248;&#21270;&#25552;&#20986;&#30340;&#24230;&#37327;&#26631;&#20934;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#36866;&#24212;&#20132;&#26131;&#27963;&#21160;&#30340;&#24207;&#21015;&#21644;&#21160;&#24577;&#29305;&#24615;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#21322;&#30495;&#23454;&#24066;&#22330;&#19978;&#65292;&#35813;&#26041;&#27861;&#21462;&#24471;&#20102;&#33391;&#22909;&#30340;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2309.01784</link><description>&lt;p&gt;
ATMS: &#31639;&#27861;&#20132;&#26131;&#24341;&#23548;&#30340;&#24066;&#22330;&#27169;&#25311;
&lt;/p&gt;
&lt;p&gt;
ATMS: Algorithmic Trading-Guided Market Simulation. (arXiv:2309.01784v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.01784
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31639;&#27861;&#20132;&#26131;&#24341;&#23548;&#30340;&#24066;&#22330;&#27169;&#25311;&#26041;&#27861;(ATMS)&#65292;&#36890;&#36807;&#20248;&#21270;&#25552;&#20986;&#30340;&#24230;&#37327;&#26631;&#20934;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#36866;&#24212;&#20132;&#26131;&#27963;&#21160;&#30340;&#24207;&#21015;&#21644;&#21160;&#24577;&#29305;&#24615;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#21322;&#30495;&#23454;&#24066;&#22330;&#19978;&#65292;&#35813;&#26041;&#27861;&#21462;&#24471;&#20102;&#33391;&#22909;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26377;&#25928;&#26500;&#24314;&#31639;&#27861;&#20132;&#26131;&#31574;&#30053;&#36890;&#24120;&#20381;&#36182;&#20110;&#24066;&#22330;&#27169;&#25311;&#22120;&#65292;&#28982;&#32780;&#29616;&#26377;&#26041;&#27861;&#24456;&#38590;&#36866;&#24212;&#20132;&#26131;&#27963;&#21160;&#30340;&#24207;&#21015;&#21644;&#21160;&#24577;&#29305;&#24615;&#12290;&#26412;&#25991;&#36890;&#36807;&#25552;&#20986;&#19968;&#20010;&#34913;&#37327;&#24066;&#22330;&#24046;&#24322;&#30340;&#24230;&#37327;&#26631;&#20934;&#26469;&#22635;&#34917;&#36825;&#19968;&#31354;&#30333;&#12290;&#35813;&#24230;&#37327;&#26631;&#20934;&#36890;&#36807;&#31639;&#27861;&#20132;&#26131;&#20195;&#29702;&#21644;&#24066;&#22330;&#20043;&#38388;&#30340;&#20132;&#20114;&#26469;&#35780;&#20272;&#24213;&#23618;&#24066;&#22330;&#30340;&#22240;&#26524;&#25928;&#24212;&#24046;&#24322;&#12290;&#26368;&#37325;&#35201;&#30340;&#26159;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#31639;&#27861;&#20132;&#26131;&#24341;&#23548;&#30340;&#24066;&#22330;&#27169;&#25311;(ATMS)&#65292;&#36890;&#36807;&#20248;&#21270;&#25105;&#20204;&#25552;&#20986;&#30340;&#24230;&#37327;&#26631;&#20934;&#12290;&#21463;SeqGAN&#30340;&#21551;&#21457;&#65292;ATMS&#23558;&#27169;&#25311;&#22120;&#24418;&#24335;&#21270;&#20026;&#24378;&#21270;&#23398;&#20064;&#20013;&#30340;&#38543;&#26426;&#31574;&#30053;&#65292;&#20197;&#32771;&#34385;&#20132;&#26131;&#30340;&#24207;&#21015;&#29305;&#24615;&#12290;&#27492;&#22806;&#65292;ATMS&#21033;&#29992;&#31574;&#30053;&#26799;&#24230;&#26356;&#26032;&#26469;&#32469;&#36807;&#23545;&#25552;&#20986;&#30340;&#24230;&#37327;&#26631;&#20934;&#30340;&#24494;&#20998;&#65292;&#36825;&#28041;&#21450;&#21040;&#38750;&#21487;&#24494;&#20998;&#25805;&#20316;&#65292;&#22914;&#20174;&#24066;&#22330;&#20013;&#21024;&#38500;&#35746;&#21333;&#12290;&#36890;&#36807;&#22312;&#21322;&#30495;&#23454;&#24066;&#22330;&#19978;&#36827;&#34892;&#22823;&#37327;&#30340;&#23454;&#39564;
&lt;/p&gt;
&lt;p&gt;
The effective construction of an Algorithmic Trading (AT) strategy often relies on market simulators, which remains challenging due to existing methods' inability to adapt to the sequential and dynamic nature of trading activities. This work fills this gap by proposing a metric to quantify market discrepancy. This metric measures the difference between a causal effect from underlying market unique characteristics and it is evaluated through the interaction between the AT agent and the market. Most importantly, we introduce Algorithmic Trading-guided Market Simulation (ATMS) by optimizing our proposed metric. Inspired by SeqGAN, ATMS formulates the simulator as a stochastic policy in reinforcement learning (RL) to account for the sequential nature of trading. Moreover, ATMS utilizes the policy gradient update to bypass differentiating the proposed metric, which involves non-differentiable operations such as order deletion from the market. Through extensive experiments on semi-real marke
&lt;/p&gt;</description></item><item><title>"&#24341;&#29992;GPT&#30340;&#8220;&#35930;&#40736;&#35797;&#39564;&#8221;&#26159;&#19968;&#31181;&#21019;&#26032;&#30340;&#26234;&#33021;&#20195;&#29702;&#24314;&#27169;&#26041;&#27861;&#65292;&#21033;&#29992;&#26234;&#33021;&#20195;&#29702;&#20195;&#34920;&#20225;&#19994;&#36827;&#34892;&#31454;&#20105;&#21644;&#21246;&#32467;&#30740;&#31350;&#12290;&#23427;&#27604;&#20351;&#29992;&#20154;&#31867;&#20027;&#20307;&#36827;&#34892;&#23454;&#39564;&#26356;&#20855;&#25104;&#26412;&#25928;&#30410;&#21644;&#28789;&#27963;&#24615;&#65292;&#24182;&#23637;&#29616;&#20986;&#36229;&#36234;&#20256;&#32479;&#20195;&#29702;&#24314;&#27169;&#26041;&#27861;&#30340;&#33021;&#21147;&#12290;"</title><link>http://arxiv.org/abs/2308.10974</link><description>&lt;p&gt;
"&#24341;&#29992;GPT&#30340;&#8220;&#35930;&#40736;&#35797;&#39564;&#8221;&#65306;&#19968;&#31181;&#30740;&#31350;&#20225;&#19994;&#31454;&#20105;&#21644;&#21246;&#32467;&#30340;&#21019;&#26032;&#26234;&#33021;&#20195;&#29702;&#24314;&#27169;&#26041;&#27861;"
&lt;/p&gt;
&lt;p&gt;
"Guinea Pig Trials" Utilizing GPT: A Novel Smart Agent-Based Modeling Approach for Studying Firm Competition and Collusion. (arXiv:2308.10974v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.10974
&lt;/p&gt;
&lt;p&gt;
"&#24341;&#29992;GPT&#30340;&#8220;&#35930;&#40736;&#35797;&#39564;&#8221;&#26159;&#19968;&#31181;&#21019;&#26032;&#30340;&#26234;&#33021;&#20195;&#29702;&#24314;&#27169;&#26041;&#27861;&#65292;&#21033;&#29992;&#26234;&#33021;&#20195;&#29702;&#20195;&#34920;&#20225;&#19994;&#36827;&#34892;&#31454;&#20105;&#21644;&#21246;&#32467;&#30740;&#31350;&#12290;&#23427;&#27604;&#20351;&#29992;&#20154;&#31867;&#20027;&#20307;&#36827;&#34892;&#23454;&#39564;&#26356;&#20855;&#25104;&#26412;&#25928;&#30410;&#21644;&#28789;&#27963;&#24615;&#65292;&#24182;&#23637;&#29616;&#20986;&#36229;&#36234;&#20256;&#32479;&#20195;&#29702;&#24314;&#27169;&#26041;&#27861;&#30340;&#33021;&#21147;&#12290;"
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20225;&#19994;&#31454;&#20105;&#21644;&#21246;&#32467;&#28041;&#21450;&#22797;&#26434;&#30340;&#21160;&#24577;&#65292;&#23588;&#20854;&#26159;&#32771;&#34385;&#21040;&#20225;&#19994;&#20043;&#38388;&#30340;&#27807;&#36890;&#12290;&#36825;&#20123;&#38382;&#39064;&#21487;&#20197;&#34987;&#24314;&#27169;&#20026;&#22797;&#26434;&#31995;&#32479;&#30340;&#38382;&#39064;&#65292;&#20256;&#32479;&#19978;&#36890;&#36807;&#28041;&#21450;&#20154;&#31867;&#20027;&#20307;&#25110;&#22522;&#20110;&#20195;&#29702;&#30340;&#24314;&#27169;&#26041;&#27861;&#36827;&#34892;&#25506;&#31350;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21019;&#26032;&#30340;&#26694;&#26550;&#65292;&#31216;&#20026;&#26234;&#33021;&#20195;&#29702;&#24314;&#27169;&#65288;SABM&#65289;&#65292;&#20854;&#20013;&#30001;GPT-4&#25216;&#26415;&#25903;&#25345;&#30340;&#26234;&#33021;&#20195;&#29702;&#20195;&#34920;&#20225;&#19994;&#24182;&#30456;&#20114;&#20132;&#20114;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#39033;&#25511;&#21046;&#23454;&#39564;&#65292;&#30740;&#31350;&#20102;&#19981;&#21516;&#26465;&#20214;&#19979;&#20225;&#19994;&#20215;&#26684;&#31454;&#20105;&#21644;&#21246;&#32467;&#34892;&#20026;&#12290;&#19982;&#20351;&#29992;&#20154;&#31867;&#20027;&#20307;&#36827;&#34892;&#23454;&#39564;&#30456;&#27604;&#65292;SABM&#26356;&#20855;&#25104;&#26412;&#25928;&#30410;&#21644;&#28789;&#27963;&#24615;&#12290;&#26234;&#33021;&#20195;&#29702;&#25317;&#26377;&#20915;&#31574;&#30340;&#24191;&#27867;&#30693;&#35782;&#24211;&#65292;&#23637;&#29616;&#20986;&#31867;&#20284;&#20154;&#31867;&#30340;&#25112;&#30053;&#33021;&#21147;&#65292;&#36229;&#36234;&#20102;&#20256;&#32479;&#30340;&#22522;&#20110;&#20195;&#29702;&#30340;&#24314;&#27169;&#26041;&#27861;&#12290;&#27492;&#22806;&#65292;&#26234;&#33021;&#20195;&#29702;&#33021;&#22815;&#27169;&#25311;&#20154;&#31867;&#23545;&#35805;&#24182;&#20010;&#24615;&#21270;&#65292;&#20351;&#20854;&#25104;&#20026;&#30740;&#31350;&#28041;&#21450;&#27807;&#36890;&#30340;&#22797;&#26434;&#24773;&#20917;&#30340;&#29702;&#24819;&#36873;&#25321;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;...
&lt;/p&gt;
&lt;p&gt;
Firm competition and collusion involve complex dynamics, particularly when considering communication among firms. Such issues can be modeled as problems of complex systems, traditionally approached through experiments involving human subjects or agent-based modeling methods. We propose an innovative framework called Smart Agent-Based Modeling (SABM), wherein smart agents, supported by GPT-4 technologies, represent firms, and interact with one another. We conducted a controlled experiment to study firm price competition and collusion behaviors under various conditions. SABM is more cost-effective and flexible compared to conducting experiments with human subjects. Smart agents possess an extensive knowledge base for decision-making and exhibit human-like strategic abilities, surpassing traditional ABM agents. Furthermore, smart agents can simulate human conversation and be personalized, making them ideal for studying complex situations involving communication. Our results demonstrate th
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#8220;&#33258;&#28982;&#32852;&#21512;&#20989;&#25968;&#8221;&#30340;&#27010;&#24565;&#65292;&#21487;&#36890;&#36807;&#32447;&#24615;&#35268;&#21010;&#26041;&#27861;&#36827;&#34892;&#31616;&#21333;&#20272;&#35745;&#65292;&#22312;&#37329;&#34701;&#32463;&#27982;&#23398;&#20013;&#20855;&#26377;&#24212;&#29992;&#28508;&#21147;&#12290;</title><link>http://arxiv.org/abs/2304.06859</link><description>&lt;p&gt;
&#19968;&#31181;&#33258;&#28982;&#30340;&#32852;&#21512;&#20989;&#25968;
&lt;/p&gt;
&lt;p&gt;
A Natural Copula. (arXiv:2304.06859v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.06859
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#8220;&#33258;&#28982;&#32852;&#21512;&#20989;&#25968;&#8221;&#30340;&#27010;&#24565;&#65292;&#21487;&#36890;&#36807;&#32447;&#24615;&#35268;&#21010;&#26041;&#27861;&#36827;&#34892;&#31616;&#21333;&#20272;&#35745;&#65292;&#22312;&#37329;&#34701;&#32463;&#27982;&#23398;&#20013;&#20855;&#26377;&#24212;&#29992;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32852;&#21512;&#20989;&#25968;&#22312;&#37329;&#34701;&#32463;&#27982;&#23398;&#20197;&#21450;&#20854;&#20182;&#24212;&#29992;&#25968;&#23398;&#39046;&#22495;&#24191;&#27867;&#20351;&#29992;&#65292;&#20294;&#36873;&#25321;&#32852;&#21512;&#20989;&#25968;&#26102;&#23384;&#22312;&#24456;&#22823;&#30340;&#27494;&#26029;&#24615;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#8220;&#33258;&#28982;&#32852;&#21512;&#20989;&#25968;&#8221;&#30340;&#27010;&#24565;&#65292;&#35813;&#20989;&#25968;&#23558;&#20004;&#20010;&#20998;&#24067;&#23884;&#20837;&#21040;&#26576;&#20010;&#31354;&#38388;&#20013;&#65292;&#20351;&#23427;&#20204;&#20043;&#38388;&#30340;Wasserstein&#36317;&#31163;&#26368;&#23567;&#21270;&#12290;&#25991;&#20013;&#23545;&#23427;&#30340;&#36755;&#36816;&#24615;&#36136;&#21644;&#27969;&#20307;&#21147;&#23398;&#35299;&#37322;&#36827;&#34892;&#20102;&#25506;&#35752;&#65292;&#24182;&#32473;&#20986;&#20102;&#20004;&#20010;&#20855;&#26377;&#37329;&#34701;&#24847;&#20041;&#30340;&#20998;&#24067;&#23454;&#20363;&#12290;&#33258;&#28982;&#32852;&#21512;&#20989;&#25968;&#21487;&#20197;&#36890;&#36807;&#32447;&#24615;&#35268;&#21010;&#26041;&#27861;&#36827;&#34892;&#31616;&#26126;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
Copulas are widely used in financial economics as well as in other areas of applied mathematics. Yet, there is much arbitrariness in their choice. The author proposes "a natural copula" concept, which minimizes Wasserstein distance between distributions in some space, in which both these distributions are embedded. Transport properties and hydrodynamic interpretation are discussed with two examples of distributions of financial significance. A natural copula can be parsimoniously estimated by the methods of linear programming.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#65292;&#21457;&#29616;&#25512;&#33616;&#31995;&#32479;&#22312;&#20849;&#21516;&#22522;&#37329;&#25237;&#36164;&#20013;&#20250;&#26174;&#33879;&#25512;&#21160;&#26356;&#22810;&#36141;&#20080;&#34892;&#20026;&#65292;&#23588;&#20854;&#26159;&#22312;&#19981;&#25104;&#29087;&#30340;&#25237;&#36164;&#32773;&#20013;&#12290;&#28982;&#32780;&#65292;&#36141;&#20080;&#25512;&#33616;&#22522;&#37329;&#30340;&#25237;&#36164;&#32773;&#24448;&#24448;&#33719;&#24471;&#26356;&#24046;&#30340;&#25237;&#36164;&#32489;&#25928;&#65292;&#20174;&#32780;&#21152;&#21095;&#20102;&#37329;&#34701;&#24066;&#22330;&#25237;&#36164;&#32773;&#20043;&#38388;&#30340;&#36130;&#23500;&#19981;&#24179;&#31561;&#12290;</title><link>http://arxiv.org/abs/2303.14263</link><description>&lt;p&gt;
&#31639;&#27861;&#30340;&#40657;&#26263;&#38754;&#65311;&#25512;&#33616;&#31995;&#32479;&#23545;&#22312;&#32447;&#25237;&#36164;&#32773;&#34892;&#20026;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Dark Side of Algorithms? The Effect of Recommender Systems on Online Investor Behaviors. (arXiv:2303.14263v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14263
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#65292;&#21457;&#29616;&#25512;&#33616;&#31995;&#32479;&#22312;&#20849;&#21516;&#22522;&#37329;&#25237;&#36164;&#20013;&#20250;&#26174;&#33879;&#25512;&#21160;&#26356;&#22810;&#36141;&#20080;&#34892;&#20026;&#65292;&#23588;&#20854;&#26159;&#22312;&#19981;&#25104;&#29087;&#30340;&#25237;&#36164;&#32773;&#20013;&#12290;&#28982;&#32780;&#65292;&#36141;&#20080;&#25512;&#33616;&#22522;&#37329;&#30340;&#25237;&#36164;&#32773;&#24448;&#24448;&#33719;&#24471;&#26356;&#24046;&#30340;&#25237;&#36164;&#32489;&#25928;&#65292;&#20174;&#32780;&#21152;&#21095;&#20102;&#37329;&#34701;&#24066;&#22330;&#25237;&#36164;&#32773;&#20043;&#38388;&#30340;&#36130;&#23500;&#19981;&#24179;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#22312;&#32447;&#25237;&#36164;&#24179;&#21488;&#24191;&#27867;&#37319;&#29992;&#20102;&#25512;&#33616;&#31995;&#32479;&#65292;&#20294;&#23545;&#20854;&#23545;&#22312;&#32447;&#25237;&#36164;&#32773;&#34892;&#20026;&#30340;&#24433;&#21709;&#36827;&#34892;&#30340;&#23454;&#35777;&#30740;&#31350;&#24456;&#23569;&#12290;&#26412;&#30740;&#31350;&#20351;&#29992;&#26469;&#33258;&#20840;&#29699;&#30005;&#23376;&#21830;&#21153;&#24179;&#21488;&#30340;&#25968;&#25454;&#65292;&#37319;&#29992;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#65292;&#20174;&#22240;&#26524;&#35282;&#24230;&#30740;&#31350;&#20102;&#25512;&#33616;&#31995;&#32479;&#23545;&#22312;&#32447;&#25237;&#36164;&#32773;&#34892;&#20026;&#30340;&#24433;&#21709;&#65292;&#29305;&#21035;&#26159;&#22312;&#20849;&#21516;&#22522;&#37329;&#25237;&#36164;&#26041;&#38754;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#30001;&#25512;&#33616;&#31995;&#32479;&#25512;&#33616;&#30340;&#22522;&#37329;&#20250;&#26174;&#33879;&#20419;&#36827;&#26356;&#22810;&#30340;&#36141;&#20080;&#34892;&#20026;&#12290;&#36825;&#31181;&#24433;&#21709;&#22312;&#19981;&#25104;&#29087;&#30340;&#25237;&#36164;&#32773;&#20013;&#23588;&#20026;&#26126;&#26174;&#65292;&#20182;&#20204;&#20284;&#20046;&#26356;&#23481;&#26131;&#36981;&#24490;&#31995;&#32479;&#25552;&#20379;&#30340;&#24314;&#35758;&#12290;&#36827;&#19968;&#27493;&#30340;&#20998;&#26512;&#36824;&#25581;&#31034;&#20102;&#65292;&#36825;&#20123;&#25237;&#36164;&#32773;&#20542;&#21521;&#20110;&#22312;&#36141;&#20080;&#25512;&#33616;&#22522;&#37329;&#21518;&#36973;&#21463;&#26174;&#33879;&#26356;&#31967;&#31957;&#30340;&#25237;&#36164;&#32489;&#25928;&#12290;&#22240;&#27492;&#65292;&#25512;&#33616;&#31995;&#32479;&#21487;&#33021;&#20250;&#21152;&#21095;&#37329;&#34701;&#24066;&#22330;&#25237;&#36164;&#32773;&#20043;&#38388;&#30340;&#36130;&#23500;&#19981;&#24179;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;
Despite the widespread adoption of recommender systems by online investment platforms, empirical research into their impact on online investors' behaviors is scarce. Using data from a global e-commerce platform, the authors of this study adopt a regression discontinuity design to causally examine the effects of recommender systems on online investor behaviors, specifically in a mutual fund investment context. The results show that funds featured by recommender systems prompt significantly more purchases. This effect is especially salient among unsophisticated investors, who appear more likely to follow system-provided recommendations. Further analysis also reveals that these investors tend to suffer significantly worse investment performance after purchasing the recommended funds. Thus, recommender systems threaten to amplify wealth inequality among investors in financial markets.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#22810;&#20010;&#24378;&#21270;&#23398;&#20064;&#26368;&#20248;&#25191;&#34892;&#20132;&#26131;&#26234;&#33021;&#20307;&#19982;&#21453;&#24212;&#24335;&#22522;&#20110;&#26234;&#33021;&#20307;&#30340;&#37329;&#34701;&#24066;&#22330;&#27169;&#22411;&#30340;&#20132;&#20114;&#12290;&#36890;&#36807;&#24179;&#34913;&#25191;&#34892;&#24046;&#20215;&#21644;&#26410;&#33021;&#21450;&#26102;&#25191;&#34892;&#35746;&#21333;&#30340;&#24809;&#32602;&#65292;&#35828;&#26126;&#20102;&#22870;&#21169;&#20989;&#25968;&#30340;&#20316;&#29992;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#23398;&#20064;&#26234;&#33021;&#20307;&#30340;&#25968;&#37327;&#12289;&#21021;&#22987;&#35746;&#21333;&#22823;&#23567;&#21644;&#29366;&#24577;&#31354;&#38388;&#30340;&#21464;&#21270;&#65292;&#20250;&#23545;&#26368;&#23567;&#26234;&#33021;&#24066;&#22330;&#27169;&#25311;&#36896;&#25104;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2303.07393</link><description>&lt;p&gt;
&#22810;&#20010;&#23398;&#20064;&#26234;&#33021;&#20307;&#19982;&#22522;&#20110;&#26234;&#33021;&#20307;&#30340;&#24066;&#22330;&#27169;&#22411;&#30340;&#20132;&#20114;
&lt;/p&gt;
&lt;p&gt;
Many learning agents interacting with an agent-based market model. (arXiv:2303.07393v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.07393
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#22810;&#20010;&#24378;&#21270;&#23398;&#20064;&#26368;&#20248;&#25191;&#34892;&#20132;&#26131;&#26234;&#33021;&#20307;&#19982;&#21453;&#24212;&#24335;&#22522;&#20110;&#26234;&#33021;&#20307;&#30340;&#37329;&#34701;&#24066;&#22330;&#27169;&#22411;&#30340;&#20132;&#20114;&#12290;&#36890;&#36807;&#24179;&#34913;&#25191;&#34892;&#24046;&#20215;&#21644;&#26410;&#33021;&#21450;&#26102;&#25191;&#34892;&#35746;&#21333;&#30340;&#24809;&#32602;&#65292;&#35828;&#26126;&#20102;&#22870;&#21169;&#20989;&#25968;&#30340;&#20316;&#29992;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#23398;&#20064;&#26234;&#33021;&#20307;&#30340;&#25968;&#37327;&#12289;&#21021;&#22987;&#35746;&#21333;&#22823;&#23567;&#21644;&#29366;&#24577;&#31354;&#38388;&#30340;&#21464;&#21270;&#65292;&#20250;&#23545;&#26368;&#23567;&#26234;&#33021;&#24066;&#22330;&#27169;&#25311;&#36896;&#25104;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#22810;&#20010;&#24378;&#21270;&#23398;&#20064;&#26368;&#20248;&#25191;&#34892;&#20132;&#26131;&#26234;&#33021;&#20307;&#19982;&#22312;&#20107;&#20214;&#26102;&#38388;&#19979;&#30340;&#21453;&#24212;&#24335;&#22522;&#20110;&#26234;&#33021;&#20307;&#30340;&#37329;&#34701;&#24066;&#22330;&#27169;&#22411;&#30340;&#21160;&#24577;&#21644;&#30456;&#20114;&#20316;&#29992;&#12290;&#27169;&#22411;&#20195;&#34920;&#20102;&#19968;&#20010;&#24066;&#22330;&#29983;&#24577;&#31995;&#32479;&#65292;&#30001;&#19977;&#20010;&#33829;&#20859;&#32423;&#21035;&#20195;&#34920;&#65306;&#26368;&#20248;&#25191;&#34892;&#23398;&#20064;&#26234;&#33021;&#20307;&#65292;&#26368;&#23567;&#26234;&#33021;&#30340;&#27969;&#21160;&#24615;&#38656;&#35201;&#32773;&#21644;&#24555;&#36895;&#30340;&#30005;&#23376;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#12290;&#26368;&#20248;&#25191;&#34892;&#20195;&#29702;&#31867;&#21035;&#21253;&#25324;&#20080;&#20837;&#21644;&#21334;&#20986;&#20195;&#29702;&#65292;&#21487;&#20197;&#20351;&#29992;&#38480;&#20215;&#21333;&#21644;&#24066;&#20215;&#21333;&#30340;&#32452;&#21512;&#65292;&#25110;&#32773;&#20165;&#20351;&#29992;&#24066;&#20215;&#21333;&#36827;&#34892;&#20132;&#26131;&#12290;&#22870;&#21169;&#20989;&#25968;&#26126;&#30830;&#24179;&#34913;&#20102;&#20132;&#26131;&#25191;&#34892;&#24046;&#20215;&#19982;&#26410;&#33021;&#21450;&#26102;&#25191;&#34892;&#35746;&#21333;&#30340;&#24809;&#32602;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#26412;&#25991;&#23637;&#31034;&#20102;&#22810;&#20010;&#31454;&#20105;&#23398;&#20064;&#26234;&#33021;&#20307;&#22914;&#20309;&#38543;&#30528;&#26234;&#33021;&#20307;&#25968;&#37327;&#12289;&#21021;&#22987;&#35746;&#21333;&#30340;&#22823;&#23567;&#21644;&#29992;&#20110;&#23398;&#20064;&#30340;&#29366;&#24577;&#31354;&#38388;&#30340;&#20989;&#25968;&#24433;&#21709;&#26368;&#23567;&#26234;&#33021;&#24066;&#22330;&#27169;&#25311;&#12290;&#25105;&#20204;&#20351;&#29992;&#30456;&#31354;&#38388;&#22270;&#26469;&#30740;&#31350;ABM&#30340;&#21160;&#24577;&#65292;&#24403;&#29305;&#23450;&#35268;&#33539;&#34987;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
We consider the dynamics and the interactions of multiple reinforcement learning optimal execution trading agents interacting with a reactive Agent-Based Model (ABM) of a financial market in event time. The model represents a market ecology with 3-trophic levels represented by: optimal execution learning agents, minimally intelligent liquidity takers, and fast electronic liquidity providers. The optimal execution agent classes include buying and selling agents that can either use a combination of limit orders and market orders, or only trade using market orders. The reward function explicitly balances trade execution slippage against the penalty of not executing the order timeously. This work demonstrates how multiple competing learning agents impact a minimally intelligent market simulation as functions of the number of agents, the size of agents' initial orders, and the state spaces used for learning. We use phase space plots to examine the dynamics of the ABM, when various specifica
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#33258;&#21160;&#20570;&#24066;&#21830;&#26426;&#21046;&#65292;&#20854;&#20013;&#20215;&#26684;&#21457;&#29616;&#19981;&#20165;&#20165;&#20381;&#36182;&#20110;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65292;&#36824;&#20381;&#36182;&#20110;&#22806;&#37096;&#27719;&#29575;&#25110;&#20215;&#26684;&#39044;&#35328;&#26426;&#12290;&#21516;&#26102;&#65292;&#36890;&#36807;&#22343;&#20540;/&#26041;&#24046;&#20998;&#26512;&#65292;&#23558;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#19982;&#25345;&#26377;&#33258;&#21160;&#20570;&#24066;&#21830;&#20197;&#22806;&#36164;&#20135;&#30340;&#20195;&#29702;&#20154;&#36827;&#34892;&#27604;&#36739;&#65292;&#20197;&#35780;&#20272;&#20854;&#30408;&#20111;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2212.00336</link><description>&lt;p&gt;
&#33258;&#21160;&#20570;&#24066;&#21830;&#65306;LP&#30340;&#25910;&#30410;&#30340;&#22343;&#20540;&#26041;&#24046;&#20998;&#26512;&#21644;&#23450;&#20215;&#20989;&#25968;&#30340;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Automated Market Makers: Mean-Variance Analysis of LPs Payoffs and Design of Pricing Functions. (arXiv:2212.00336v3 [q-fin.TR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.00336
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#33258;&#21160;&#20570;&#24066;&#21830;&#26426;&#21046;&#65292;&#20854;&#20013;&#20215;&#26684;&#21457;&#29616;&#19981;&#20165;&#20165;&#20381;&#36182;&#20110;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65292;&#36824;&#20381;&#36182;&#20110;&#22806;&#37096;&#27719;&#29575;&#25110;&#20215;&#26684;&#39044;&#35328;&#26426;&#12290;&#21516;&#26102;&#65292;&#36890;&#36807;&#22343;&#20540;/&#26041;&#24046;&#20998;&#26512;&#65292;&#23558;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#19982;&#25345;&#26377;&#33258;&#21160;&#20570;&#24066;&#21830;&#20197;&#22806;&#36164;&#20135;&#30340;&#20195;&#29702;&#20154;&#36827;&#34892;&#27604;&#36739;&#65292;&#20197;&#35780;&#20272;&#20854;&#30408;&#20111;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#21435;&#20013;&#24515;&#21270;&#37329;&#34701;&#30340;&#20986;&#29616;&#65292;&#20986;&#29616;&#20102;&#26032;&#30340;&#20132;&#26131;&#26426;&#21046;&#31216;&#20026;&#33258;&#21160;&#20570;&#24066;&#21830;&#12290;&#26368;&#27969;&#34892;&#30340;&#33258;&#21160;&#20570;&#24066;&#21830;&#26159;&#24120;&#37327;&#20989;&#25968;&#20570;&#24066;&#21830;&#12290;&#23427;&#20204;&#24050;&#32463;&#22312;&#29702;&#35770;&#21644;&#23454;&#35777;&#26041;&#38754;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;&#29305;&#21035;&#26159;&#65292;&#20986;&#29616;&#20102;&#38750;&#27704;&#20037;&#24615;&#25439;&#22833;&#30340;&#27010;&#24565;&#65292;&#35299;&#37322;&#20102;&#24120;&#37327;&#20989;&#25968;&#20570;&#24066;&#21830;&#20013;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#37096;&#20998;&#30408;&#20111;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#21478;&#19968;&#31181;&#26426;&#21046;&#65292;&#20854;&#20013;&#20215;&#26684;&#21457;&#29616;&#19981;&#20165;&#20165;&#20381;&#36182;&#20110;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65292;&#36824;&#20381;&#36182;&#20110;&#22806;&#37096;&#27719;&#29575;&#25110;&#20215;&#26684;&#39044;&#35328;&#26426;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20351;&#29992;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#25910;&#30410;&#30340;&#22343;&#20540;/&#26041;&#24046;&#20998;&#26512;&#19982;&#33258;&#21160;&#20570;&#24066;&#21830;&#20043;&#22806;&#25345;&#26377;&#36164;&#20135;&#30340;&#20195;&#29702;&#20154;&#30340;&#25910;&#30410;/&#25439;&#22833;&#36827;&#34892;&#27604;&#36739;&#12290;&#29305;&#21035;&#26159;&#65292;&#21463;&#39532;&#31185;&#32500;&#33576;&#29616;&#20195;&#25237;&#36164;&#32452;&#21512;&#29702;&#35770;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#25104;&#21151;&#33719;&#24471;&#20102;&#22312;&#29702;&#24819;&#24773;&#20917;&#19979;&#30340;&#23436;&#32654;&#39044;&#35328;&#26426;&#30340;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#34920;&#29616;&#30340;&#26377;&#25928;&#21069;&#27839;&#12290;
&lt;/p&gt;
&lt;p&gt;
With the emergence of decentralized finance, new trading mechanisms called Automated Market Makers have appeared. The most popular Automated Market Makers are Constant Function Market Makers. They have been studied both theoretically and empirically. In particular, the concept of impermanent loss has emerged and explains part of the profit and loss of liquidity providers in Constant Function Market Makers. In this paper, we propose another mechanism in which price discovery does not solely rely on liquidity takers but also on an external exchange rate or price oracle. We also propose to compare the different mechanisms from the point of view of liquidity providers by using a mean / variance analysis of their profit and loss compared to that of agents holding assets outside of Automated Market Makers. In particular, inspired by Markowitz' modern portfolio theory, we manage to obtain an efficient frontier for the performance of liquidity providers in the idealized case of a perfect oracl
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21457;&#23637;&#20102;&#19968;&#31181;&#20851;&#20110;&#22238;&#22768;&#23460;&#30340;&#29702;&#24615;&#24573;&#35270;&#29702;&#35770;&#65292;&#36890;&#36807;&#26377;&#38480;&#30340;&#27880;&#24847;&#21147;&#36164;&#28304;&#33719;&#21462;&#20851;&#20110;&#19981;&#30830;&#23450;&#29366;&#24577;&#30340;&#20449;&#24687;&#65292;&#24182;&#22312;&#22238;&#22768;&#23460;&#22343;&#34913;&#20013;&#25551;&#36848;&#20102;&#20449;&#24687;&#30340;&#20256;&#36882;&#21644;&#27880;&#24847;&#21147;&#32593;&#32476;&#12290;</title><link>http://arxiv.org/abs/2104.10657</link><description>&lt;p&gt;
&#29702;&#24615;&#24573;&#35270;&#29702;&#35770;&#19982;&#22238;&#22768;&#23460;
&lt;/p&gt;
&lt;p&gt;
A Rational Inattention Theory of Echo Chamber. (arXiv:2104.10657v6 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2104.10657
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21457;&#23637;&#20102;&#19968;&#31181;&#20851;&#20110;&#22238;&#22768;&#23460;&#30340;&#29702;&#24615;&#24573;&#35270;&#29702;&#35770;&#65292;&#36890;&#36807;&#26377;&#38480;&#30340;&#27880;&#24847;&#21147;&#36164;&#28304;&#33719;&#21462;&#20851;&#20110;&#19981;&#30830;&#23450;&#29366;&#24577;&#30340;&#20449;&#24687;&#65292;&#24182;&#22312;&#22238;&#22768;&#23460;&#22343;&#34913;&#20013;&#25551;&#36848;&#20102;&#20449;&#24687;&#30340;&#20256;&#36882;&#21644;&#27880;&#24847;&#21147;&#32593;&#32476;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#21457;&#23637;&#20102;&#19968;&#31181;&#20851;&#20110;&#22238;&#22768;&#23460;&#30340;&#29702;&#24615;&#24573;&#35270;&#29702;&#35770;&#65292;&#36890;&#36807;&#23558;&#26377;&#38480;&#30340;&#27880;&#24847;&#21147;&#36164;&#28304;&#20998;&#37197;&#32473;&#20559;&#21521;&#20027;&#35201;&#20449;&#24687;&#28304;&#21644;&#20854;&#20182;&#29609;&#23478;&#65292;&#26469;&#33719;&#21462;&#20851;&#20110;&#19981;&#30830;&#23450;&#29366;&#24577;&#30340;&#20449;&#24687;&#12290;&#30001;&#27492;&#20135;&#29983;&#30340;&#27850;&#26494;&#27880;&#24847;&#21147;&#32593;&#32476;&#23558;&#20449;&#24687;&#20174;&#20027;&#35201;&#20449;&#24687;&#28304;&#30452;&#25509;&#25110;&#38388;&#25509;&#22320;&#20256;&#36882;&#32473;&#29609;&#23478;&#12290;&#29702;&#24615;&#24573;&#35270;&#22312;&#26368;&#21021;&#23545;&#19981;&#21516;&#20915;&#31574;&#26377;&#20559;&#35265;&#30340;&#29609;&#23478;&#20043;&#38388;&#20135;&#29983;&#20102;&#23545;&#20449;&#24687;&#30340;&#24322;&#36136;&#38656;&#27714;&#12290;&#22312;&#22238;&#22768;&#23460;&#22343;&#34913;&#20013;&#65292;&#27599;&#20010;&#29609;&#23478;&#23558;&#27880;&#24847;&#21147;&#38480;&#21046;&#22312;&#33258;&#24049;&#20559;&#21521;&#30340;&#20449;&#24687;&#28304;&#21644;&#24535;&#21516;&#36947;&#21512;&#30340;&#26379;&#21451;&#19978;&#65292;&#22240;&#20026;&#21518;&#32773;&#19982;&#20182;&#20204;&#20986;&#24109;&#21516;&#19968;&#20027;&#35201;&#20449;&#24687;&#28304;&#65292;&#25152;&#20197;&#22312;&#20027;&#35201;&#20449;&#24687;&#28304;&#21040;&#36798;&#20182;&#20204;&#30340;&#20449;&#24687;&#20256;&#36755;&#34987;&#20013;&#26029;&#26102;&#65292;&#21487;&#20197;&#20316;&#20026;&#27425;&#35201;&#20449;&#24687;&#28304;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#20135;&#29983;&#22238;&#22768;&#23460;&#22343;&#34913;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#25551;&#36848;&#20102;&#22238;&#22768;&#23460;&#20869;&#30340;&#27880;&#24847;&#21147;&#32593;&#32476;&#65292;&#24182;&#21033;&#29992;&#25105;&#20204;&#30340;&#32467;&#26524;&#26469;&#25351;&#23548;&#20449;&#24687;&#30340;&#35774;&#35745;&#21644;&#30417;&#31649;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a rational inattention theory of echo chamber, whereby players gather information about an uncertain state by allocating limited attention capacities across biased primary sources and the other players. The resulting Poisson attention network transmits information from the primary source to a player either directly or indirectly through the other players. Rational inattention generates heterogeneous demands for information among players who are initially biased towards different decisions. In an echo chamber equilibrium, each player restricts attention to his own-biased source and like-minded friends, as the latter attend to the same primary source as his, and so could serve as secondary sources in case the information transmission from the primary source to him is disrupted. We provide sufficient conditions that give rise to echo chamber equilibria, characterize the attention networks within echo chambers, and use our results to inform the design and regulation of informati
&lt;/p&gt;</description></item></channel></rss>