<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#25506;&#31350;&#20102;&#34892;&#25919;&#27807;&#36890;&#20013;&#30340;&#21457;&#22768;&#31505;&#22768;&#23545;&#20110;&#31038;&#20250;&#35748;&#21487;&#30340;&#31215;&#26497;&#24433;&#21709;&#65292;&#29305;&#21035;&#26159;&#24403;&#21457;&#29983;&#21452;&#21521;&#31505;&#22768;&#26102;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#36825;&#31181;&#24433;&#21709;&#38543;&#30528;&#32452;&#32455;&#19994;&#32489;&#30340;&#19979;&#38477;&#32780;&#22686;&#21152;&#12290;</title><link>http://arxiv.org/abs/2305.09485</link><description>&lt;p&gt;
&#34892;&#25919;&#20154;&#21592;&#30340;&#21457;&#22768;&#31505;&#22768;&#19982;&#31038;&#20250;&#35748;&#21487;&#65306;&#26426;&#22120;&#23398;&#20064;&#30740;&#31350;&#30340;&#25506;&#31350;&#12290; (arXiv:2305.09485v1 [&#32463;&#27982;&#23398;.GN])
&lt;/p&gt;
&lt;p&gt;
Executive Voiced Laughter and Social Approval: An Explorative Machine Learning Study. (arXiv:2305.09485v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.09485
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#31350;&#20102;&#34892;&#25919;&#27807;&#36890;&#20013;&#30340;&#21457;&#22768;&#31505;&#22768;&#23545;&#20110;&#31038;&#20250;&#35748;&#21487;&#30340;&#31215;&#26497;&#24433;&#21709;&#65292;&#29305;&#21035;&#26159;&#24403;&#21457;&#29983;&#21452;&#21521;&#31505;&#22768;&#26102;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#36825;&#31181;&#24433;&#21709;&#38543;&#30528;&#32452;&#32455;&#19994;&#32489;&#30340;&#19979;&#38477;&#32780;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#34892;&#25919;&#20154;&#21592;&#27807;&#36890;&#20013;&#30340;&#21457;&#22768;&#31505;&#22768;&#20197;&#21450;&#23427;&#23545;&#31038;&#20250;&#35748;&#21487;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#23558;&#31505;&#22768;&#65292;&#24773;&#24863;&#20316;&#20026;&#20449;&#24687;&#21644;&#20449;&#24687;&#23186;&#20171;&#23545;&#20844;&#21496;&#30340;&#31038;&#20250;&#35780;&#20215;&#30340;&#30740;&#31350;&#30456;&#32467;&#21512;&#65292;&#20551;&#35774;&#34892;&#25919;&#20154;&#21592;&#27807;&#36890;&#20013;&#30340;&#21457;&#22768;&#31505;&#22768;&#23545;&#31038;&#20250;&#35748;&#21487;&#26377;&#31215;&#26497;&#24433;&#21709;&#65292;&#31038;&#20250;&#35748;&#21487;&#26159;&#25351;&#21463;&#20247;&#23545;&#19968;&#20010;&#32452;&#32455;&#30340;&#20146;&#21644;&#21147;&#30340;&#24863;&#30693;&#12290;&#25105;&#20204;&#35748;&#20026;&#65292;&#19982;&#20247;&#31505;&#30340;&#25928;&#26524;&#23588;&#20854;&#24378;&#65292;&#21363;&#22312;&#32473;&#23450;&#30340;&#27807;&#36890;&#22330;&#21512;&#20013;&#65292;&#32858;&#28966;&#30340;&#34892;&#25919;&#20154;&#21592;&#21644;&#35266;&#20247;&#21516;&#26102;&#21457;&#31505;&#30340;&#27425;&#25968;&#12290;&#26368;&#21518;&#65292;&#32467;&#21512;&#24773;&#24863;&#20316;&#20026;&#20449;&#24687;&#21644;&#20154;&#31867;&#35748;&#30693;&#30340;&#36127;&#38754;&#20559;&#35265;&#65292;&#25105;&#20204;&#20551;&#35774;&#31505;&#22768;&#23545;&#31038;&#20250;&#35748;&#21487;&#30340;&#31215;&#26497;&#24433;&#21709;&#38543;&#30528;&#32452;&#32455;&#19994;&#32489;&#30340;&#19979;&#38477;&#32780;&#22686;&#21152;&#12290;&#25105;&#20204;&#22312;902&#20010;&#24503;&#22269;&#24052;&#26519;&#24503;&#26031;&#21033;&#21152;&#36275;&#29699;&#26032;&#38395;&#21457;&#24067;&#20250;&#21644;&#23186;&#20307;&#21313;&#22823;&#25968;&#25454;&#20013;&#36827;&#34892;&#27979;&#35797;&#65292;&#24212;&#29992;&#26368;&#20808;&#36827;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#36827;&#34892;&#31505;&#22768;&#26816;&#27979;&#65292;&#24182;&#25214;&#21040;&#20102;&#37096;&#20998;&#25903;&#25345;&#25105;&#20204;&#24819;&#27861;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study voiced laughter in executive communication and its effect on social approval. Integrating research on laughter, affect-as-information, and infomediaries' social evaluations of firms, we hypothesize that voiced laughter in executive communication positively affects social approval, defined as audience perceptions of affinity towards an organization. We surmise that the effect of laughter is especially strong for joint laughter, i.e., the number of instances in a given communication venue for which the focal executive and the audience laugh simultaneously. Finally, combining the notions of affect-as-information and negativity bias in human cognition, we hypothesize that the positive effect of laughter on social approval increases with bad organizational performance. We find partial support for our ideas when testing them on panel data comprising 902 German Bundesliga soccer press conferences and media tenor, applying state-of-the-art machine learning approaches for laughter dete
&lt;/p&gt;</description></item><item><title>&#25105;&#30340;&#35770;&#25991;&#20998;&#26512;&#20102;&#31227;&#21160;&#24212;&#29992;&#30340;&#20135;&#21697;&#24066;&#22330;&#20301;&#32622;&#22914;&#20309;&#24433;&#21709;&#20854;&#23450;&#20215;&#31574;&#30053;&#65292;&#20174;&#32780;&#24433;&#21709;&#24212;&#29992;&#30340;&#36135;&#24065;&#21270;&#36807;&#31243;&#12290;&#25105;&#21019;&#24314;&#20102;&#19968;&#20010;&#26032;&#21464;&#37327;&#26469;&#34913;&#37327;&#24212;&#29992;&#19982;&#21516;&#34892;&#20043;&#38388;&#30340;&#24046;&#24322;&#24615;&#65292;&#30740;&#31350;&#21457;&#29616;&#23545;&#25104;&#21151;&#30340;&#24212;&#29992;&#21644;&#19981;&#25104;&#21151;&#30340;&#24212;&#29992;&#30340;&#24433;&#21709;&#19981;&#21516;&#65292;&#24182;&#26681;&#25454;&#24212;&#29992;&#30340;&#32047;&#35745;&#23433;&#35013;&#37327;&#21644;&#20844;&#21496;&#30693;&#21517;&#24230;&#23558;&#24212;&#29992;&#20998;&#20026;&#24066;&#22330;&#39046;&#20808;&#21644;&#24066;&#22330;&#21518;&#32487;&#20004;&#32452;&#12290;</title><link>http://arxiv.org/abs/2305.09479</link><description>&lt;p&gt;
&#31227;&#21160;&#24212;&#29992;&#24066;&#22330;&#20013;&#20813;&#36153;&#22686;&#20540;&#31574;&#30053;&#30340;&#24212;&#29992;&#24494;&#35266;&#32463;&#27982;&#23398;&#35770;&#25991;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Dissertation on Applied Microeconomics of Freemium Pricing Strategies in Mobile App Market. (arXiv:2305.09479v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.09479
&lt;/p&gt;
&lt;p&gt;
&#25105;&#30340;&#35770;&#25991;&#20998;&#26512;&#20102;&#31227;&#21160;&#24212;&#29992;&#30340;&#20135;&#21697;&#24066;&#22330;&#20301;&#32622;&#22914;&#20309;&#24433;&#21709;&#20854;&#23450;&#20215;&#31574;&#30053;&#65292;&#20174;&#32780;&#24433;&#21709;&#24212;&#29992;&#30340;&#36135;&#24065;&#21270;&#36807;&#31243;&#12290;&#25105;&#21019;&#24314;&#20102;&#19968;&#20010;&#26032;&#21464;&#37327;&#26469;&#34913;&#37327;&#24212;&#29992;&#19982;&#21516;&#34892;&#20043;&#38388;&#30340;&#24046;&#24322;&#24615;&#65292;&#30740;&#31350;&#21457;&#29616;&#23545;&#25104;&#21151;&#30340;&#24212;&#29992;&#21644;&#19981;&#25104;&#21151;&#30340;&#24212;&#29992;&#30340;&#24433;&#21709;&#19981;&#21516;&#65292;&#24182;&#26681;&#25454;&#24212;&#29992;&#30340;&#32047;&#35745;&#23433;&#35013;&#37327;&#21644;&#20844;&#21496;&#30693;&#21517;&#24230;&#23558;&#24212;&#29992;&#20998;&#20026;&#24066;&#22330;&#39046;&#20808;&#21644;&#24066;&#22330;&#21518;&#32487;&#20004;&#32452;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#25105;&#30340;&#35770;&#25991;&#20013;&#65292;&#25105;&#23558;&#20998;&#26512;&#19968;&#20010;&#31227;&#21160;&#24212;&#29992;&#30340;&#20135;&#21697;&#24066;&#22330;&#20301;&#32622;&#22914;&#20309;&#24433;&#21709;&#20854;&#23450;&#20215;&#31574;&#30053;&#65292;&#20174;&#32780;&#24433;&#21709;&#24212;&#29992;&#30340;&#36135;&#24065;&#21270;&#36807;&#31243;&#12290;&#25105;&#21033;&#29992;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#21644;&#24212;&#29992;&#25991;&#26412;&#25551;&#36848;&#30340;k-mean&#32858;&#31867;&#26041;&#27861;&#65292;&#21019;&#24314;&#20102;&#19968;&#20010;&#26032;&#30340;&#21464;&#37327;&#26469;&#34913;&#37327;&#36825;&#20123;&#24212;&#29992;&#19982;&#21516;&#34892;&#20043;&#38388;&#30340;&#24046;&#24322;&#24615;&#12290;&#25105;&#21019;&#24314;&#20102;&#22235;&#20010;&#26631;&#20934;&#65292;&#21363;&#20215;&#26684;&#12289;&#32047;&#35745;&#23433;&#35013;&#37327;&#20197;&#21450;&#24212;&#29992;&#26159;&#21542;&#21253;&#21547;&#24212;&#29992;&#20869;&#24191;&#21578;&#21644;&#36141;&#20080;&#25351;&#31034;&#31526;&#12290;&#25105;&#21457;&#29616;&#65292;&#35813;&#25928;&#24212;&#23545;&#25104;&#21151;&#30340;&#24212;&#29992;&#21644;&#19981;&#25104;&#21151;&#30340;&#24212;&#29992;&#30340;&#24433;&#21709;&#30053;&#26377;&#19981;&#21516;&#12290;&#25105;&#29992;&#32047;&#35745;&#23433;&#35013;&#37327;&#21644;&#24320;&#21457;&#24212;&#29992;&#30340;&#20844;&#21496;&#26469;&#34913;&#37327;&#25104;&#21151;&#12290;&#22522;&#20110;&#31532;&#19977;&#26041;&#25490;&#21517;&#21644;&#23433;&#35013;&#20998;&#24067;&#30340;&#24418;&#29366;&#65292;&#25105;&#35774;&#32622;&#20102;&#20004;&#20010;&#38408;&#20540;&#65292;&#24182;&#23558;&#24212;&#29992;&#20998;&#20026;&#24066;&#22330;&#39046;&#20808;&#21644;&#24066;&#22330;&#21518;&#32487;&#24212;&#29992;&#12290;&#24066;&#22330;&#39046;&#20808;&#30340;&#26679;&#26412;&#30001;&#20855;&#26377;&#39640;&#32047;&#35745;&#23433;&#35013;&#37327;&#25110;&#30001;&#30693;&#21517;&#20844;&#21496;&#24320;&#21457;&#30340;&#24212;&#29992;&#32452;&#25104;&#65292;&#32780;&#24066;&#22330;&#21518;&#32487;&#30340;&#26679;&#26412;&#21017;&#30001;&#20854;&#23427;&#24212;&#29992;&#32452;&#25104;&#12290;
&lt;/p&gt;
&lt;p&gt;
In my dissertation, I will analyze how the product market position of a mobile app affects its pricing strategies, which in turn impacts an app's monetization process. Using natural language processing and k-mean clustering on apps' text descriptions, I created a new variable that measures the distinctiveness of an app as compared to its peers. I created four pricing variables, price, cumulative installs, and indicators of whether an app contains in-app ads and purchases. I found that the effect differs for successful apps and less successful apps. I measure the success here using cumulative installs and the firms that developed the apps. Based on third-party rankings and the shape of the distribution of installs, I set two thresholds and divided apps into market-leading and market-follower apps. The market-leading sub-sample consists of apps with high cumulative installs or developed by prestigious firms, and the market-follower sub-sample consists of the rest of the apps. I found tha
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;&#36190;&#21161;&#22238;&#25253;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#21487;&#39044;&#27979;&#36190;&#21161;&#21830;&#26159;&#21542;&#32493;&#32422;&#21450;&#20445;&#30041;&#26102;&#38388;&#65292;&#26377;&#21161;&#20110;&#32463;&#29702;&#20204;&#26356;&#22909;&#22320;&#35780;&#20272;&#36190;&#21161;&#25237;&#20837;&#30340;&#22238;&#25253;&#12290;</title><link>http://arxiv.org/abs/2305.09473</link><description>&lt;p&gt;
&#23547;&#25214;&#36190;&#21161;&#32852;&#31995;&#33829;&#38144;&#30340;&#8220;&#22307;&#26479;&#8221;: &#36890;&#29992;&#30340;&#36190;&#21161;&#22238;&#25253;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Searching for the "Holy Grail" of sponsorship-linked marketing: A generalizable sponsorship ROI model. (arXiv:2305.09473v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.09473
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;&#36190;&#21161;&#22238;&#25253;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#21487;&#39044;&#27979;&#36190;&#21161;&#21830;&#26159;&#21542;&#32493;&#32422;&#21450;&#20445;&#30041;&#26102;&#38388;&#65292;&#26377;&#21161;&#20110;&#32463;&#29702;&#20204;&#26356;&#22909;&#22320;&#35780;&#20272;&#36190;&#21161;&#25237;&#20837;&#30340;&#22238;&#25253;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33829;&#38144;&#20154;&#21592;&#32463;&#24120;&#23558;&#39044;&#31639;&#30340;&#19968;&#37096;&#20998;&#20998;&#37197;&#32473;&#36190;&#21161;&#27963;&#21160;&#12290;&#28982;&#32780;&#65292;&#35780;&#20272;&#36825;&#31867;&#25237;&#20837;&#30340;&#22238;&#25253;&#19968;&#30452;&#26159;&#19968;&#20010;&#25361;&#25112;&#12290;&#22240;&#27492;&#65292;&#21033;&#29992;&#29983;&#23384;&#20998;&#26512;&#26041;&#27861;&#20998;&#26512;&#20102;&#36229;&#36807;5800&#20010;&#36190;&#21161;&#25968;&#25454;&#38598;&#65292;&#21033;&#29992;&#36190;&#21161;&#21830;&#26159;&#21542;&#32493;&#32422;&#20316;&#20026;&#27491;&#22238;&#25253;&#30340;&#20195;&#29702;&#12290;&#38500;&#20102;&#23545;&#36190;&#21161;&#32852;&#31995;&#33829;&#38144;&#25991;&#29486;&#30340;&#36129;&#29486;&#22806;&#65292;&#25152;&#24471;&#30340;&#27169;&#22411;&#21487;&#20379;&#32463;&#29702;&#20351;&#29992;&#65292;&#20197;&#29983;&#25104;&#30456;&#23545;&#20110;&#36190;&#21161;&#21830;&#32493;&#32422;&#27010;&#29575;&#21644;&#36190;&#21161;&#21830;&#20445;&#30041;&#26102;&#38388;&#30340;&#39044;&#27979;&#20540;&#65292;&#36825;&#26159;&#19968;&#39033;&#26032;&#30340;&#31649;&#29702;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;
Marketers routinely allocate a significant portion of their budget to sponsorship. However, isolating the return on investment from such efforts has remained a challenge. Thus, a dataset of more than 5,800 sponsorships is analyzed using survival analysis approaches that utilizes the sponsor's renewal of the sponsorship as a proxy for positive ROI. In addition to its contribution to the sponsorship-linked marketing literature, the resulting model can be utilized by managers to generate predicted values relative to the sponsor's probability of renewal and the ultimate duration of time the sponsor will remain with the property, representing a novel managerial contribution.
&lt;/p&gt;</description></item><item><title>&#32929;&#26435;&#20445;&#25252;&#25481;&#26399;&#26159;&#19968;&#31181;&#26032;&#22411;&#36229;&#32423;&#20859;&#32769;&#37329;&#20445;&#38505;&#20135;&#21697;&#65292;&#20080;&#26041;&#19982;&#25552;&#20379;&#26041;&#21327;&#21830;&#19981;&#21516;&#21442;&#19982;&#29575;&#65292;&#24182;&#36890;&#36807;&#24635;&#22238;&#25253;&#25481;&#26399;&#20351;&#25345;&#26377;&#32773;&#22312;&#32929;&#24066;&#19979;&#36300;&#26102;&#20813;&#21463;&#25439;&#22833;&#65292;&#21516;&#26102;&#19982;&#25552;&#20379;&#26041;&#20849;&#20139;&#25910;&#30410;&#12290;</title><link>http://arxiv.org/abs/2305.09472</link><description>&lt;p&gt;
&#32929;&#26435;&#20445;&#25252;&#25481;&#26399;&#65306;&#36229;&#32423;&#20859;&#32769;&#37329;&#30340;&#26032;&#22411;&#20445;&#38505;
&lt;/p&gt;
&lt;p&gt;
Equity Protection Swaps: An New Type of Insurance for Superannuation. (arXiv:2305.09472v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.09472
&lt;/p&gt;
&lt;p&gt;
&#32929;&#26435;&#20445;&#25252;&#25481;&#26399;&#26159;&#19968;&#31181;&#26032;&#22411;&#36229;&#32423;&#20859;&#32769;&#37329;&#20445;&#38505;&#20135;&#21697;&#65292;&#20080;&#26041;&#19982;&#25552;&#20379;&#26041;&#21327;&#21830;&#19981;&#21516;&#21442;&#19982;&#29575;&#65292;&#24182;&#36890;&#36807;&#24635;&#22238;&#25253;&#25481;&#26399;&#20351;&#25345;&#26377;&#32773;&#22312;&#32929;&#24066;&#19979;&#36300;&#26102;&#20813;&#21463;&#25439;&#22833;&#65292;&#21516;&#26102;&#19982;&#25552;&#20379;&#26041;&#20849;&#20139;&#25910;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32929;&#26435;&#20445;&#25252;&#25481;&#26399;&#65288;EPS&#65289;&#26159;&#19968;&#31181;&#22522;&#20110;&#25481;&#26399;&#32467;&#26500;&#30340;&#36229;&#32423;&#20859;&#32769;&#37329;&#26032;&#22411;&#20445;&#38505;&#20135;&#21697;&#12290;&#23427;&#22312;&#24635;&#22238;&#25253;&#25481;&#26399;&#65288;TRS&#65289;&#19978;&#26377;&#25152;&#21457;&#23637;&#65292;&#24182;&#19988;&#20196;&#20154;&#24819;&#36215;&#24050;&#30693;&#30340;&#20445;&#38505;&#20135;&#21697;&#27880;&#20876;&#25351;&#25968;&#32852;&#31995;&#24180;&#37329;&#65288;RILA&#65289;&#12290;&#22914;&#26524;&#21442;&#32771;&#32452;&#21512;&#30340;&#20215;&#20540;&#22686;&#21152;&#65292;EPS&#20080;&#26041;&#38656;&#35201;&#19982;EPS&#25552;&#20379;&#26041;&#20849;&#20139;&#25910;&#30410;&#65292;&#22914;&#26524;&#20986;&#29616;&#20111;&#25439;&#21017;&#33719;&#24471;&#20445;&#25252;&#12290; EPS&#32467;&#26500;&#30001;&#20445;&#25252;&#33151;&#21644;&#36153;&#29992;&#33151;&#20004;&#37096;&#20998;&#32452;&#25104;&#65292;&#30001;EPS&#25552;&#20379;&#26041;&#21644;&#20080;&#26041;&#21327;&#21830;&#19981;&#21516;&#21442;&#19982;&#29575;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#26631;&#20934;EPS&#30340;&#19968;&#33324;&#23450;&#20215;&#20844;&#24335;&#65292;&#24182;&#36890;&#36807;&#20351;&#29992;&#27431;&#24335;&#26399;&#26435;&#33719;&#24471;&#30456;&#24212;&#30340;&#38745;&#24577;&#23545;&#20914;&#31574;&#30053;&#12290;&#20026;&#20102;&#21560;&#24341;&#26356;&#22810;&#25237;&#36164;&#32773;&#65292;EPS&#25552;&#20379;&#26041;&#21487;&#20197;&#36873;&#25321;&#19968;&#20010;&#19982;&#25152;&#38656;&#20445;&#25252;&#27700;&#24179;&#30456;&#20851;&#30340;&#36866;&#24403;&#21442;&#19982;&#36153;&#29992;&#29575;&#65292;&#24182;&#19988;&#19981;&#23545;&#25237;&#36164;&#32773;&#24449;&#25910;&#39069;&#22806;&#36153;&#29992;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#25968;&#23383;&#23454;&#20363;&#20197;&#35828;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
Equity protection swaps (EPS) is a new type of superannuation insurance products base on swap structure. It has some developments on total return swaps (TRS) and is reminiscent of the insurance products known as registered index-linked annuities (RILA). The EPS buyer needs to share gains with EPS provider if the value of underlying reference portfolio increases and obtain protection if there is a loss. The EPS structure consists of two parts, a protection leg and a fee leg, with different participation rates negotiated by both EPS provider and buyer. We present a general pricing formula for standard EPS and obtain the corresponding static hedging strategy by using European options. To attract more investors, EPS provider are able to select an appropriate participation rate of fee leg in relation to the required protection level and levies no additional fee on investors. We also present numerical examples to illustrate.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;&#39118;&#38505;&#24230;&#37327;&#36827;&#34892;&#36164;&#20135;&#37197;&#32622;&#30340;&#38382;&#39064;&#65292;&#36890;&#36807;&#20351;&#29992;&#24191;&#20041;&#30340;&#39118;&#38505;&#24230;&#37327;&#65292;&#26368;&#22823;&#21270;&#26102;&#38388;&#19968;&#33268;&#30340;&#24179;&#22343;&#39118;&#38505;&#22238;&#25253;&#20989;&#25968;&#12290;&#20316;&#32773;&#27169;&#25311;&#20102;&#24066;&#22330;&#65292;&#24182;&#22312;&#31526;&#21512;&#26465;&#20214;&#30340;&#24773;&#20917;&#19979;&#35777;&#26126;&#20102;&#35813;&#38382;&#39064;&#30340;&#26368;&#20248;&#35299;&#26159;&#30830;&#23450;&#24615;&#19988;&#21807;&#19968;&#30340;&#12290;</title><link>http://arxiv.org/abs/2305.09471</link><description>&lt;p&gt;
&#22312; L\'evy &#24066;&#22330;&#20013;&#22522;&#20110;&#39118;&#38505;&#24230;&#37327;&#30340;&#26102;&#19968;&#33268;&#36164;&#20135;&#37197;&#32622;
&lt;/p&gt;
&lt;p&gt;
Time-Consistent Asset Allocation for Risk Measures in a L\'evy Market. (arXiv:2305.09471v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.09471
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;&#39118;&#38505;&#24230;&#37327;&#36827;&#34892;&#36164;&#20135;&#37197;&#32622;&#30340;&#38382;&#39064;&#65292;&#36890;&#36807;&#20351;&#29992;&#24191;&#20041;&#30340;&#39118;&#38505;&#24230;&#37327;&#65292;&#26368;&#22823;&#21270;&#26102;&#38388;&#19968;&#33268;&#30340;&#24179;&#22343;&#39118;&#38505;&#22238;&#25253;&#20989;&#25968;&#12290;&#20316;&#32773;&#27169;&#25311;&#20102;&#24066;&#22330;&#65292;&#24182;&#22312;&#31526;&#21512;&#26465;&#20214;&#30340;&#24773;&#20917;&#19979;&#35777;&#26126;&#20102;&#35813;&#38382;&#39064;&#30340;&#26368;&#20248;&#35299;&#26159;&#30830;&#23450;&#24615;&#19988;&#21807;&#19968;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#38024;&#23545;&#22686;&#30410;&#32780;&#38750;&#32456;&#27490;&#36130;&#23500;&#65292;&#32771;&#34385;&#20102;&#19968;&#31181;&#36164;&#20135;&#37197;&#32622;&#38382;&#39064;&#65292;&#26088;&#22312;&#36890;&#36807;&#20351;&#29992;&#19968;&#31181;&#24191;&#20041;&#30340;&#39118;&#38505;&#24230;&#37327;&#65288;&#28385;&#36275; i&#65289;&#20855;&#26377;&#24459;&#21464;&#24615;&#65292;ii&#65289;&#20855;&#26377;&#29616;&#37329;&#25110;&#24179;&#31227;&#19981;&#21464;&#24615;&#65292;&#21450; iii&#65289;&#21487;&#33021;&#23884;&#20837;&#21040;&#19968;&#31181;&#36890;&#29992;&#20989;&#25968;&#20013;&#65289;&#26368;&#22823;&#38480;&#24230;&#22320;&#19968;&#33268;&#21270;&#26102;&#38388;&#26469;&#25193;&#22823;&#39118;&#38505;&#25910;&#30410;&#20989;&#25968;&#12290;&#25105;&#20204;&#20351;&#29992; $\alpha$ &#31283;&#23450;&#30340; L\'evy &#36807;&#31243;&#26469;&#27169;&#25311;&#24066;&#22330;&#65292;&#24182;&#20026;&#32463;&#20856;&#30340; Black-Scholes &#27169;&#22411;&#25552;&#20379;&#20102;&#34917;&#20805;&#32467;&#26524;&#12290;&#35813;&#38382;&#39064;&#30340;&#26368;&#20248;&#35299;&#26159;&#19968;&#20010; Nash &#23376;&#28216;&#25103;&#22343;&#34913;&#65292;&#20854;&#30001;&#25193;&#23637;&#30340; Hamilton-Jacobi-Bellman &#26041;&#31243;&#30340;&#35299;&#20915;&#26041;&#26696;&#32473;&#20986;&#12290;&#27492;&#22806;&#65292;&#22312;&#36866;&#24403;&#30340;&#20551;&#35774;&#19979;&#65292;&#25105;&#20204;&#35777;&#26126;&#26368;&#20248;&#35299;&#26159;&#30830;&#23450;&#24615;&#19988;&#21807;&#19968;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Focusing on gains instead of terminal wealth, we consider an asset allocation problem to maximize time-consistently a mean-risk reward function with a general risk measure which is i) law-invariant, ii) cash- or shift-invariant, and iii) positively homogeneous, and possibly plugged into a general function. We model the market via a generalized version of the multi-dimensional Black-Scholes model using $\alpha$-stable L\'evy processes and give supplementary results for the classical Black-Scholes model. The optimal solution to this problem is a Nash subgame equilibrium given by the solution of an extended Hamilton-Jacobi-Bellman equation. Moreover, we show that the optimal solution is deterministic and unique under appropriate assumptions.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#21457;&#29616;&#20844;&#20849;&#24403;&#38138;&#30340;&#36151;&#27454;&#36129;&#29486;&#20102;&#21382;&#21490;&#24615;&#30340;&#23156;&#20799;&#21644;&#32974;&#20799;&#27515;&#20129;&#29575;&#19979;&#38477;&#65292;&#31169;&#20154;&#24403;&#38138;&#27809;&#26377;&#36825;&#26679;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2305.09352</link><description>&lt;p&gt;
&#19996;&#20140;&#24037;&#19994;&#21270;&#26102;&#26399;&#20844;&#20849;&#24403;&#38138;&#23545;&#20581;&#24247;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Health Impacts of Public Pawnshops in Industrializing Tokyo. (arXiv:2305.09352v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.09352
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#21457;&#29616;&#20844;&#20849;&#24403;&#38138;&#30340;&#36151;&#27454;&#36129;&#29486;&#20102;&#21382;&#21490;&#24615;&#30340;&#23156;&#20799;&#21644;&#32974;&#20799;&#27515;&#20129;&#29575;&#19979;&#38477;&#65292;&#31169;&#20154;&#24403;&#38138;&#27809;&#26377;&#36825;&#26679;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26159;&#39318;&#27425;&#35843;&#26597;&#25910;&#20837;&#20302;&#19979;&#20154;&#21475;&#36130;&#21153;&#26426;&#26500;&#26159;&#21542;&#20419;&#36827;&#20102;&#21382;&#21490;&#24615;&#30340;&#27515;&#20129;&#29575;&#19979;&#38477;&#12290;&#25105;&#20204;&#20351;&#29992;&#25112;&#21069;&#19996;&#20140;&#24066;&#30340;&#21306;&#32423;&#38754;&#26495;&#25968;&#25454;&#21457;&#29616;&#65292;&#20844;&#20849;&#24403;&#38138;&#36151;&#27454;&#19982;&#23156;&#20799;&#21644;&#32974;&#20799;&#27515;&#20129;&#29575;&#30340;&#38477;&#20302;&#26377;&#20851;&#65292;&#21487;&#33021;&#26159;&#36890;&#36807;&#25913;&#21892;&#33829;&#20859;&#21644;&#21355;&#29983;&#25514;&#26045;&#23454;&#29616;&#30340;&#12290;&#31616;&#21333;&#35745;&#31639;&#34920;&#26126;&#65292;&#20174;1927&#24180;&#21040;1935&#24180;&#25512;&#24191;&#20844;&#20849;&#24403;&#38138;&#23548;&#33268;&#23156;&#20799;&#27515;&#20129;&#29575;&#21644;&#32974;&#20799;&#27515;&#20129;&#29575;&#20998;&#21035;&#19979;&#38477;&#20102;6%&#21644;8%&#12290;&#30456;&#21453;&#65292;&#31169;&#20154;&#24403;&#38138;&#27809;&#26377;&#19982;&#20581;&#24247;&#25913;&#21892;&#30340;&#26174;&#30528;&#20851;&#32852;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#20016;&#23500;&#20102;&#19981;&#26029;&#25193;&#22823;&#30340;&#20154;&#21475;&#32479;&#35745;&#21644;&#37329;&#34701;&#21382;&#21490;&#25991;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study is the first to investigate whether financial institutions for low-income populations have contributed to the historical decline in mortality rates. Using ward-level panel data from prewar Tokyo City, we found that public pawn loans were associated with reductions in infant and fetal death rates, potentially through improved nutrition and hygiene measures. Simple calculations suggest that popularizing public pawnshops led to a 6% and 8% decrease in infant mortality and fetal death rates, respectively, from 1927 to 1935. Contrarily, private pawnshops showed no significant association with health improvements. Our findings enrich the expanding literature on demographics and financial histories.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#29992;&#30340;&#25968;&#20540;&#26041;&#26696;&#65292;&#20351;&#29992;&#20302;&#32500;&#26377;&#38480;&#24046;&#20998;&#27861;&#30340;&#31934;&#30830;&#35299;&#26469;&#26500;&#24314;&#26465;&#20214;&#26399;&#26395;&#32487;&#32493;&#25903;&#20184;&#30340;&#20551;&#35774;&#65292;&#24182;&#23558;&#20854;&#29992;&#20110;&#32447;&#24615;&#22238;&#24402;&#65292;&#20197;&#25552;&#39640;&#22312;&#32654;&#24335;&#26399;&#26435;&#23450;&#20215;&#20013;&#26368;&#23567;&#20108;&#20056;&#33945;&#29305;&#21345;&#32599;&#26041;&#27861;&#30340;&#31934;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2305.09166</link><description>&lt;p&gt;
&#26368;&#23567;&#20108;&#20056;&#33945;&#29305;&#21345;&#32599;&#20013;&#30340;&#26377;&#38480;&#24046;&#20998;&#35299;&#27861;
&lt;/p&gt;
&lt;p&gt;
Finite Difference Solution Ansatz approach in Least-Squares Monte Carlo. (arXiv:2305.09166v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.09166
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#29992;&#30340;&#25968;&#20540;&#26041;&#26696;&#65292;&#20351;&#29992;&#20302;&#32500;&#26377;&#38480;&#24046;&#20998;&#27861;&#30340;&#31934;&#30830;&#35299;&#26469;&#26500;&#24314;&#26465;&#20214;&#26399;&#26395;&#32487;&#32493;&#25903;&#20184;&#30340;&#20551;&#35774;&#65292;&#24182;&#23558;&#20854;&#29992;&#20110;&#32447;&#24615;&#22238;&#24402;&#65292;&#20197;&#25552;&#39640;&#22312;&#32654;&#24335;&#26399;&#26435;&#23450;&#20215;&#20013;&#26368;&#23567;&#20108;&#20056;&#33945;&#29305;&#21345;&#32599;&#26041;&#27861;&#30340;&#31934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#32780;&#26377;&#25928;&#30340;&#26041;&#27861;&#65292;&#20197;&#25552;&#39640;&#22312;&#32654;&#24335;&#26399;&#26435;&#23450;&#20215;&#20013;&#26368;&#23567;&#20108;&#20056;&#33945;&#29305;&#21345;&#32599;&#26041;&#27861;&#30340;&#31934;&#30830;&#24615;&#12290;&#20851;&#38190;&#24605;&#24819;&#26159;&#20351;&#29992;&#20302;&#32500;&#26377;&#38480;&#24046;&#20998;&#27861;&#30340;&#31934;&#30830;&#35299;&#26469;&#26500;&#24314;&#26465;&#20214;&#26399;&#26395;&#32487;&#32493;&#25903;&#20184;&#30340;&#20551;&#35774;&#65292;&#29992;&#20110;&#32447;&#24615;&#22238;&#24402;&#12290;&#35813;&#26041;&#27861;&#22312;&#35299;&#20915;&#21521;&#21518;&#20559;&#24494;&#20998;&#26041;&#31243;&#21644;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#26041;&#38754;&#24314;&#31435;&#20102;&#26725;&#26753;&#65292;&#26088;&#22312;&#23454;&#29616;&#20004;&#32773;&#30340;&#26368;&#20339;&#32467;&#21512;&#12290;&#25105;&#20204;&#36890;&#36807;&#23454;&#38469;&#31034;&#20363;&#35828;&#26126;&#35813;&#25216;&#26415;&#65292;&#21253;&#25324;&#30334;&#24917;&#22823;&#26399;&#26435;&#21644;&#26368;&#24046;&#21457;&#34892;&#20154;&#21487;&#36174;&#22238;&#31080;&#25454;&#12290;&#35813;&#26041;&#27861;&#21487;&#34987;&#35270;&#20026;&#36328;&#36234;&#21508;&#31181;&#36164;&#20135;&#31867;&#21035;&#30340;&#36890;&#29992;&#25968;&#20540;&#26041;&#26696;&#65292;&#29305;&#21035;&#26159;&#22312;&#20219;&#24847;&#32500;&#24230;&#19979;&#65292;&#20316;&#20026;&#23450;&#20215;&#32654;&#24335;&#34893;&#29983;&#20135;&#21697;&#30340;&#20934;&#30830;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
This article presents a simple but effective approach to improve the accuracy of Least-Squares Monte Carlo for American-style options. The key idea is to construct the ansatz of conditional expected continuation payoff using the exact solution from low dimensional finite difference methods, to be used in linear regression. This approach builds a bridge between solving backward partial differential equations and a Monte Carlo simulation, aiming at achieving the best of both worlds. We illustrate the technique with realistic examples including Bermuda options and worst of issuer callable notes. The method can be considered as a generic numerical scheme across various asset classes, in particular, as an accurate method for pricing American-style derivatives under arbitrary dimensions.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#22810;&#20803;&#21306;&#38388;&#39118;&#38505;&#20215;&#20540;(MRVaR)&#21644;&#21327;&#26041;&#24046;(MRCov)&#20316;&#20026;&#20004;&#20010;&#39118;&#38505;&#24230;&#37327;&#65292;&#25512;&#23548;&#20986;&#26925;&#22278;&#21644;&#23545;&#25968;&#26925;&#22278;&#20998;&#24067;&#26063;&#30340;MRVaR&#21644;MRCov&#26174;&#24335;&#34920;&#36798;&#24335;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;&#21306;&#38388;&#30340;&#22343;&#20540;&#26041;&#24046;&#25237;&#36164;&#32452;&#21512;&#20248;&#36873;&#26694;&#26550;&#65292;&#24182;&#36890;&#36807;&#32929;&#31080;&#22238;&#25253;&#30340;&#23454;&#38469;&#25968;&#25454;&#35745;&#31639;&#21306;&#38388;&#20869;&#30340;&#20248;&#21270;&#32452;&#21512;&#65292;&#25968;&#20540;&#23454;&#39564;&#21644;&#26377;&#25928;&#21069;&#27839;&#20998;&#26512;&#34920;&#26126;&#22522;&#20110;&#33539;&#22260;&#30340;&#26041;&#27861;&#20855;&#26377;&#28789;&#27963;&#24615;&#21644;&#35745;&#31639;&#25928;&#29575;&#65292;&#33021;&#22815;&#23454;&#29616;&#26356;&#22909;&#30340;&#39118;&#38505;-&#25910;&#30410;&#26435;&#34913;&#12290;</title><link>http://arxiv.org/abs/2305.09097</link><description>&lt;p&gt;
&#26925;&#22278;&#21644;&#23545;&#25968;&#26925;&#22278;&#20998;&#24067;&#30340;&#22810;&#20803;&#21306;&#38388;&#39118;&#38505;&#20215;&#20540;&#21644;&#21327;&#26041;&#24046;&#39118;&#38505;&#24230;&#37327;
&lt;/p&gt;
&lt;p&gt;
Multivariate range Value-at-Risk and covariance risk measures for elliptical and log-elliptical distributions. (arXiv:2305.09097v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.09097
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#22810;&#20803;&#21306;&#38388;&#39118;&#38505;&#20215;&#20540;(MRVaR)&#21644;&#21327;&#26041;&#24046;(MRCov)&#20316;&#20026;&#20004;&#20010;&#39118;&#38505;&#24230;&#37327;&#65292;&#25512;&#23548;&#20986;&#26925;&#22278;&#21644;&#23545;&#25968;&#26925;&#22278;&#20998;&#24067;&#26063;&#30340;MRVaR&#21644;MRCov&#26174;&#24335;&#34920;&#36798;&#24335;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;&#21306;&#38388;&#30340;&#22343;&#20540;&#26041;&#24046;&#25237;&#36164;&#32452;&#21512;&#20248;&#36873;&#26694;&#26550;&#65292;&#24182;&#36890;&#36807;&#32929;&#31080;&#22238;&#25253;&#30340;&#23454;&#38469;&#25968;&#25454;&#35745;&#31639;&#21306;&#38388;&#20869;&#30340;&#20248;&#21270;&#32452;&#21512;&#65292;&#25968;&#20540;&#23454;&#39564;&#21644;&#26377;&#25928;&#21069;&#27839;&#20998;&#26512;&#34920;&#26126;&#22522;&#20110;&#33539;&#22260;&#30340;&#26041;&#27861;&#20855;&#26377;&#28789;&#27963;&#24615;&#21644;&#35745;&#31639;&#25928;&#29575;&#65292;&#33021;&#22815;&#23454;&#29616;&#26356;&#22909;&#30340;&#39118;&#38505;-&#25910;&#30410;&#26435;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#22810;&#20803;&#21306;&#38388;&#39118;&#38505;&#20215;&#20540;&#65288;MRVaR&#65289;&#21644;&#22810;&#20803;&#21306;&#38388;&#21327;&#26041;&#24046;&#65288;MRCov&#65289;&#20316;&#20026;&#20004;&#20010;&#39118;&#38505;&#24230;&#37327;&#65292;&#24182;&#25506;&#35752;&#20102;&#23427;&#20204;&#22312;&#39118;&#38505;&#31649;&#29702;&#20013;&#30340;&#33391;&#22909;&#29305;&#24615;&#12290;&#20855;&#20307;&#22320;&#65292;&#25105;&#20204;&#35299;&#37322;&#20102;&#36825;&#31181;&#22522;&#20110;&#21306;&#38388;&#30340;&#39118;&#38505;&#24230;&#37327;&#23545;&#20110;&#35268;&#21046;&#21644;&#25237;&#36164;&#30446;&#30340;&#30340;&#39118;&#38505;&#31649;&#29702;&#26159;&#21512;&#36866;&#30340;&#12290; &#22522;&#20110;&#27492;&#65292;&#24341;&#20837;&#20102;&#22810;&#20803;&#21306;&#38388;&#30456;&#20851;&#30697;&#38453;&#65288;MRCorr&#65289;&#12290;&#20026;&#20102;&#25552;&#39640;&#20998;&#26512;&#30340;&#20415;&#21033;&#24615;&#65292;&#25105;&#20204;&#22312;&#22810;&#20803;&#65288;&#23545;&#25968;&#65289;&#26925;&#22278;&#20998;&#24067;&#26063;&#30340;&#19978;&#19979;&#25991;&#20013;&#25512;&#23548;&#20986;&#20102;MRVaR&#21644;MRCov&#30340;&#26174;&#24335;&#34920;&#36798;&#24335;&#12290;&#25105;&#20204;&#20197;&#34892;&#19994;&#20013;&#24120;&#29992;&#30340;&#20998;&#24067;&#65292;&#22914;&#27491;&#24577;&#12289;t&#20998;&#24067;&#12289;logistic&#20998;&#24067;&#12289;&#25289;&#26222;&#25289;&#26031;&#20998;&#24067;&#21644;Pearson VII&#22411;&#20998;&#24067;&#20026;&#20363;&#36827;&#34892;&#20102;&#25968;&#20540;&#23454;&#39564;&#12290;&#20316;&#20026;&#19968;&#31181;&#24212;&#29992;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22522;&#20110;&#21306;&#38388;&#30340;&#22343;&#20540;&#26041;&#24046;&#25237;&#36164;&#32452;&#21512;&#20248;&#36873;&#26694;&#26550;&#12290;&#25105;&#20204;&#26681;&#25454;&#32929;&#31080;&#22238;&#25253;&#30340;&#23454;&#38469;&#25968;&#25454;&#35745;&#31639;&#20248;&#21270;&#32452;&#21512;&#30340;&#22522;&#20110;&#21306;&#38388;&#30340;&#26377;&#25928;&#21069;&#27839;&#12290;&#25968;&#20540;&#23454;&#39564;&#21644;&#26377;&#25928;&#21069;&#27839;&#20998;&#26512;&#34920;&#26126;&#65292;&#25152;&#25552;&#20986;&#30340;&#22522;&#20110;&#33539;&#22260;&#30340;&#26041;&#27861;&#20855;&#26377;&#28789;&#27963;&#24615;&#21644;&#35745;&#31639;&#25928;&#29575;&#65292;&#24182;&#19988;&#33021;&#22815;&#23454;&#29616;&#27604;&#20256;&#32479;&#26041;&#27861;&#26356;&#22909;&#30340;&#39118;&#38505;-&#25910;&#30410;&#26435;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we propose the multivariate range Value-at-Risk (MRVaR) and the multivariate range covariance (MRCov) as two risk measures and explore their desirable properties in risk management. In particular, we explain that such range-based risk measures are appropriate for risk management of regulation and investment purposes. The multivariate range correlation matrix (MRCorr) is introduced accordingly. To facilitate analytical analyses, we derive explicit expressions of the MRVaR and the MRCov in the context of the multivariate (log-)elliptical distribution family. Frequently-used cases in industry, such as normal, student-$t$, logistic, Laplace, and Pearson type VII distributions, are presented with numerical examples. As an application, we propose a range-based mean-variance framework of optimal portfolio selection. We calculate the range-based efficient frontiers of the optimal portfolios based on real data of stocks' returns. Both the numerical examples and the efficient fron
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#36845;&#20195;&#26041;&#26696;&#65292;&#29992;&#20110;&#27714;&#35299;&#27010;&#29575;&#21333;&#32431;&#24418;&#19978;&#30340;&#20984;&#20248;&#21270;&#38382;&#39064;&#12290;&#35813;&#26041;&#27861;&#20855;&#26377;&#25910;&#25947;&#36895;&#24230;&#24555;&#19988;&#31616;&#21333;&#26131;&#34892;&#30340;&#29305;&#28857;&#12290;</title><link>http://arxiv.org/abs/2305.09046</link><description>&lt;p&gt;
&#27010;&#29575;&#21333;&#32431;&#24418;&#19978;&#30340;&#20984;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
Convex optimization over a probability simplex. (arXiv:2305.09046v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.09046
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#36845;&#20195;&#26041;&#26696;&#65292;&#29992;&#20110;&#27714;&#35299;&#27010;&#29575;&#21333;&#32431;&#24418;&#19978;&#30340;&#20984;&#20248;&#21270;&#38382;&#39064;&#12290;&#35813;&#26041;&#27861;&#20855;&#26377;&#25910;&#25947;&#36895;&#24230;&#24555;&#19988;&#31616;&#21333;&#26131;&#34892;&#30340;&#29305;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#36845;&#20195;&#26041;&#26696;&#8212;&#8212;&#26607;&#35199;&#21333;&#32431;&#24418;&#26469;&#20248;&#21270;&#20984;&#38382;&#39064;&#65292;&#20351;&#20854;&#28385;&#36275;&#27010;&#29575;&#21333;&#32431;&#24418;&#19978;&#30340;&#38480;&#21046;&#26465;&#20214;&#65292;&#21363;$w\in\mathbb{R}^n$&#20013;$\sum_i w_i=1$&#65292;$w_i\geq0$&#12290;&#25105;&#20204;&#23558;&#21333;&#32431;&#24418;&#26144;&#23556;&#21040;&#21333;&#20301;&#29699;&#30340;&#27491;&#22235;&#38754;&#20307;&#65292;&#36890;&#36807;&#26799;&#24230;&#19979;&#38477;&#33719;&#24471;&#38544;&#21464;&#37327;&#30340;&#35299;&#65292;&#24182;&#23558;&#32467;&#26524;&#26144;&#23556;&#22238;&#21407;&#22987;&#21464;&#37327;&#12290;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#39640;&#32500;&#38382;&#39064;&#65292;&#27599;&#27425;&#36845;&#20195;&#30001;&#31616;&#21333;&#30340;&#25805;&#20316;&#32452;&#25104;&#65292;&#19988;&#38024;&#23545;&#20984;&#20989;&#25968;&#35777;&#26126;&#20102;&#25910;&#25947;&#36895;&#24230;&#20026;${O}(1/T)$&#12290;&#21516;&#26102;&#26412;&#25991;&#20851;&#27880;&#20102;&#20449;&#24687;&#29702;&#35770;&#65288;&#22914;&#20132;&#21449;&#29109;&#21644;KL&#25955;&#24230;&#65289;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a new iteration scheme, the Cauchy-Simplex, to optimize convex problems over the probability simplex $\{w\in\mathbb{R}^n\ |\ \sum_i w_i=1\ \textrm{and}\ w_i\geq0\}$. Other works have taken steps to enforce positivity or unit normalization automatically but never simultaneously within a unified setting. This paper presents a natural framework for manifestly requiring the probability condition. Specifically, we map the simplex to the positive quadrant of a unit sphere, envisage gradient descent in latent variables, and map the result back in a way that only depends on the simplex variable. Moreover, proving rigorous convergence results in this formulation leads inherently to tools from information theory (e.g. cross entropy and KL divergence). Each iteration of the Cauchy-Simplex consists of simple operations, making it well-suited for high-dimensional problems. We prove that it has a convergence rate of ${O}(1/T)$ for convex functions, and numerical experiments of projection 
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#32773;&#24320;&#21457;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#21338;&#24328;&#35770;&#27169;&#22411;&#65292;&#20197;&#30830;&#23450;&#31995;&#32479;&#24615;&#37329;&#34701;&#39118;&#38505;&#19982;&#36135;&#24065;&#25919;&#31574;&#30446;&#26631;&#20043;&#38388;&#30340;&#20851;&#32852;&#12290;&#24403;&#22830;&#34892;&#30340;&#25919;&#31574;&#30446;&#26631;&#21253;&#21547;&#37329;&#34701;&#37096;&#38376;&#31283;&#23450;&#24615;&#26102;&#65292;&#24066;&#22330;&#21487;&#33021;&#20250;&#22240;&#20026;&#25919;&#31574;&#21046;&#23450;&#32773;&#30340;&#30446;&#26631;&#20559;&#24046;&#32780;&#20135;&#29983;&#20302;&#25928;&#29575;&#12290;&#30740;&#31350;&#32773;&#25552;&#20986;&#20102;&#36890;&#36807;&#20219;&#21629;&#19968;&#20301;&#23545;&#24066;&#22330;&#31283;&#23450;&#24615;&#37325;&#35270;&#36739;&#23567;&#30340;"&#39118;&#31581;&#24335;"&#22830;&#34892;&#23478;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2305.08958</link><description>&lt;p&gt;
&#39118;&#31581;&#19982;&#40524;&#40529;&#65306;&#36135;&#24065;&#25919;&#31574;&#21450;&#20854;&#19982;&#31574;&#30053;&#24615;&#37329;&#34701;&#24066;&#22330;&#30340;&#27807;&#36890;
&lt;/p&gt;
&lt;p&gt;
Kites and Quails: Monetary Policy and Communication with Strategic Financial Markets. (arXiv:2305.08958v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.08958
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#32773;&#24320;&#21457;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#21338;&#24328;&#35770;&#27169;&#22411;&#65292;&#20197;&#30830;&#23450;&#31995;&#32479;&#24615;&#37329;&#34701;&#39118;&#38505;&#19982;&#36135;&#24065;&#25919;&#31574;&#30446;&#26631;&#20043;&#38388;&#30340;&#20851;&#32852;&#12290;&#24403;&#22830;&#34892;&#30340;&#25919;&#31574;&#30446;&#26631;&#21253;&#21547;&#37329;&#34701;&#37096;&#38376;&#31283;&#23450;&#24615;&#26102;&#65292;&#24066;&#22330;&#21487;&#33021;&#20250;&#22240;&#20026;&#25919;&#31574;&#21046;&#23450;&#32773;&#30340;&#30446;&#26631;&#20559;&#24046;&#32780;&#20135;&#29983;&#20302;&#25928;&#29575;&#12290;&#30740;&#31350;&#32773;&#25552;&#20986;&#20102;&#36890;&#36807;&#20219;&#21629;&#19968;&#20301;&#23545;&#24066;&#22330;&#31283;&#23450;&#24615;&#37325;&#35270;&#36739;&#23567;&#30340;"&#39118;&#31581;&#24335;"&#22830;&#34892;&#23478;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#21338;&#24328;&#35770;&#27169;&#22411;&#65292;&#20197;&#30830;&#23450;&#22312;&#20915;&#31574;&#32773;&#21644;&#37329;&#34701;&#24066;&#22330;&#26159;&#31574;&#30053;&#24615;&#21442;&#19982;&#32773;&#12289;&#25919;&#31574;&#24778;&#21916;&#23545;&#24066;&#22330;&#31283;&#23450;&#24615;&#20135;&#29983;&#36127;&#38754;&#24433;&#21709;&#30340;&#24773;&#20917;&#19979;&#65292;&#26126;&#30830;&#23558;&#37329;&#34701;&#24066;&#22330;&#31283;&#23450;&#24615;&#32435;&#20837;&#22830;&#34892;&#30446;&#26631;&#20989;&#25968;&#30340;&#21518;&#26524;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#25919;&#31574;&#30446;&#26631;&#20013;&#21253;&#25324;&#37329;&#34701;&#37096;&#38376;&#31283;&#23450;&#24615;&#21487;&#33021;&#20250;&#24341;&#36215;&#20302;&#25928;&#29575;&#65292;&#22240;&#20026;&#24066;&#22330;&#23545;&#25919;&#31574;&#21046;&#23450;&#32773;&#30446;&#26631;&#30340;&#39044;&#26399;&#20250;&#20559;&#35823;&#25237;&#36164;&#36873;&#25321;&#12290;&#24403;&#22830;&#34892;&#25317;&#26377;&#20854;&#25919;&#31574;&#24847;&#22270;&#30340;&#31169;&#20154;&#20449;&#24687;&#26102;&#65292;&#24179;&#34913;&#36890;&#20449;&#26159;&#27169;&#31946;&#30340;&#65292;&#22240;&#20026;&#23436;&#20840;&#20449;&#24687;&#30340;&#27807;&#36890;&#26159;&#19981;&#21487;&#20449;&#30340;&#12290;&#20219;&#21629;&#19968;&#20301;&#8220;&#39118;&#31581;&#24335;&#8221;&#22830;&#34892;&#23478;&#65292;&#20182;&#23545;&#24066;&#22330;&#31283;&#23450;&#24615;&#30340;&#37325;&#35270;&#36739;&#23567;&#65292;&#21487;&#20197;&#20943;&#23569;&#36825;&#20123;&#20302;&#25928;&#29575;&#12290;&#22914;&#26524;&#20114;&#21160;&#26159;&#37325;&#22797;&#30340;&#65292;&#22830;&#34892;&#36890;&#36807;&#20445;&#30041;&#21069;&#30651;&#24615;&#25351;&#23548;&#24809;&#32602;&#20219;&#20309;&#28389;&#29992;&#24066;&#22330;&#26435;&#21147;&#30340;&#34892;&#20026;&#65292;&#21487;&#20197;&#25552;&#39640;&#27807;&#36890;&#36879;&#26126;&#24230;&#21644;&#25972;&#20307;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a simple game-theoretic model to determine the consequences of explicitly including financial market stability in the central bank objective function, when policymakers and the financial market are strategic players, and market stability is negatively affected by policy surprises. We find that the inclusion of financial sector stability among the policy objectives can induce an inefficiency, whereby market anticipation of policymakers' goals biases investment choices. When the central bank has private information about its policy intentions, the equilibrium communication is vague, because fully informative communication is not credible. The appointment of a ``kitish'' central banker, who puts little weight on market stability, reduces these inefficiencies. If interactions are repeated, communication transparency and overall efficiency can be improved if the central bank punishes any abuse of market power by withholding forward guidance. At the same time, repeated interaction
&lt;/p&gt;</description></item><item><title>&#30001;&#20110;&#22269;&#38450;&#21512;&#21516;&#30340;&#24310;&#36831;&#26680;&#31639;&#65292;&#23548;&#33268;GDP&#22312;G&#20043;&#21069;&#20986;&#29616;&#27874;&#21160;&#65307;VAR-identified shocks&#23545;&#24211;&#23384;&#30340;&#24433;&#21709;&#34987;&#38169;&#36807;&#65292;&#23548;&#33268;&#25112;&#26007;&#22810;&#37325;&#25928;&#24212;&#20272;&#35745;&#36739;&#20302;&#12290;</title><link>http://arxiv.org/abs/2212.06073</link><description>&lt;p&gt;
GDP&#22312;G&#20043;&#21069;&#20026;&#20160;&#20040;&#20250;&#21160;&#65311;&#19968;&#20999;&#22312;&#20110;&#34913;&#37327;
&lt;/p&gt;
&lt;p&gt;
Why Does GDP Move Before G? It's all in the Measurement. (arXiv:2212.06073v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.06073
&lt;/p&gt;
&lt;p&gt;
&#30001;&#20110;&#22269;&#38450;&#21512;&#21516;&#30340;&#24310;&#36831;&#26680;&#31639;&#65292;&#23548;&#33268;GDP&#22312;G&#20043;&#21069;&#20986;&#29616;&#27874;&#21160;&#65307;VAR-identified shocks&#23545;&#24211;&#23384;&#30340;&#24433;&#21709;&#34987;&#38169;&#36807;&#65292;&#23548;&#33268;&#25112;&#26007;&#22810;&#37325;&#25928;&#24212;&#20272;&#35745;&#36739;&#20302;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#21457;&#29616;&#65292;&#22269;&#38450;&#26032;&#38395;&#20914;&#20987;&#23545;GDP&#30340;&#26089;&#26399;&#24433;&#21709;&#20027;&#35201;&#26159;&#30001;&#20110;&#21830;&#19994;&#24211;&#23384;&#30340;&#22686;&#21152;&#65292;&#25215;&#21253;&#21830;&#21152;&#36895;&#29983;&#20135;&#26032;&#30340;&#22269;&#38450;&#21512;&#21516;&#12290;&#36825;&#20123;&#21512;&#21516;&#30452;&#21040;&#20132;&#20184;&#20184;&#27454;&#65288;&#21457;&#29983;&#22312;2-3&#20010;&#23395;&#24230;&#20043;&#21518;&#65289;&#20043;&#21069;&#19981;&#20250;&#24433;&#21709;&#25919;&#24220;&#25903;&#20986;G&#12290;&#20851;&#20110;&#22269;&#38450;&#37319;&#36141;&#20041;&#21153;&#30340;&#26032;&#25968;&#25454;&#26174;&#31034;&#65292;&#21512;&#21516;&#25480;&#20104;&#20250;&#24341;&#36215;Granger&#22240;&#26524;VAR&#26631;&#35782;&#30340;G&#20914;&#20987;&#65292;&#20294;&#19981;&#20250;&#24341;&#36215;&#22269;&#38450;&#26032;&#38395;&#20914;&#20987;&#12290;&#36825;&#24847;&#21619;&#30528;&#30456;&#23545;&#20110;G&#65292;&#26089;&#26399;GDP&#21709;&#24212;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#21463;&#21040;&#22269;&#38450;&#21512;&#21516;&#24310;&#36831;&#26680;&#31639;&#30340;&#39537;&#21160;&#65292;&#32780;VAR&#26631;&#35782;&#30340;G&#20914;&#20987;&#38169;&#36807;&#20102;&#23545;&#24211;&#23384;&#30340;&#24433;&#21709;&#65292;&#20174;&#32780;&#24471;&#20986;&#36739;&#20302;&#30340;&#20056;&#25968;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
We find that the early impact of defense news shocks on GDP is mainly due to a rise in business inventories, as contractors ramp up production for new defense contracts. These contracts do not affect government spending (G) until payment-on-delivery, which occurs 2-3 quarters later. Novel data on defense procurement obligations reveals that contract awards Granger-cause VAR-identified shocks to G, but not defense news shocks. This implies that the early GDP response relative to G is largely driven by the delayed accounting of defense contracts, while VAR-identified shocks to G miss the impact on inventories, resulting in lower multiplier estimates.
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#33021;&#22815;&#27169;&#25311;&#29616;&#23454;&#20013;&#22797;&#26434;&#30340;&#22810;&#23618;&#27425;&#25293;&#21334;&#25968;&#25454;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#20195;&#29702;&#23398;&#20064;&#21644;&#24314;&#27169;&#24212;&#29992;&#65292;&#20026;&#27169;&#25311;&#24615;&#30740;&#31350;&#30340;&#36827;&#23637;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;</title><link>http://arxiv.org/abs/2207.12255</link><description>&lt;p&gt;
&#23454;&#29616;&#22522;&#20110;&#20998;&#23618;&#28145;&#24230;&#23398;&#20064;&#30340;&#22810;&#23618;&#27425;&#25293;&#21334;&#25968;&#25454;&#27169;&#25311;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Implementing a Hierarchical Deep Learning Approach for Simulating Multi-Level Auction Data. (arXiv:2207.12255v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.12255
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#33021;&#22815;&#27169;&#25311;&#29616;&#23454;&#20013;&#22797;&#26434;&#30340;&#22810;&#23618;&#27425;&#25293;&#21334;&#25968;&#25454;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#20195;&#29702;&#23398;&#20064;&#21644;&#24314;&#27169;&#24212;&#29992;&#65292;&#20026;&#27169;&#25311;&#24615;&#30740;&#31350;&#30340;&#36827;&#23637;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#28145;&#24230;&#23398;&#20064;&#35299;&#20915;&#26041;&#26696;&#65292;&#20197;&#24212;&#23545;&#27169;&#25311;&#29616;&#23454;&#21512;&#29702;&#30340;&#21512;&#21516;&#25293;&#21334;&#25968;&#25454;&#25152;&#36935;&#21040;&#30340;&#25361;&#25112;&#12290;&#36825;&#31181;&#31867;&#22411;&#30340;&#25293;&#21334;&#25968;&#25454;&#25152;&#36935;&#21040;&#30340;&#22797;&#26434;&#24615;&#21253;&#25324;&#39640;&#22522;&#25968;&#31163;&#25955;&#29305;&#24449;&#31354;&#38388;&#21644;&#30001;&#19982;&#21333;&#20010;&#25293;&#21334;&#23454;&#20363;&#30456;&#20851;&#32852;&#30340;&#22810;&#20010;&#20986;&#20215;&#24341;&#36215;&#30340;&#22810;&#23618;&#32423;&#32467;&#26500;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#23558;&#28145;&#24230;&#29983;&#25104;&#24314;&#27169;&#65288;DGM&#65289;&#19982;&#39044;&#27979;&#22522;&#20110;&#25293;&#21334;&#29305;&#24449;&#30340;&#26465;&#20214;&#20986;&#20215;&#20998;&#24067;&#30340;&#20154;&#24037;&#23398;&#20064;&#22120;&#30456;&#32467;&#21512;&#65292;&#20026;&#27169;&#25311;&#24615;&#30740;&#31350;&#30340;&#36827;&#23637;&#20570;&#20986;&#36129;&#29486;&#12290;&#36825;&#31181;&#26041;&#27861;&#20026;&#21019;&#24314;&#36866;&#29992;&#20110;&#20195;&#29702;&#23398;&#20064;&#21644;&#24314;&#27169;&#24212;&#29992;&#30340;&#30495;&#23454;&#25293;&#21334;&#29615;&#22659;&#22880;&#23450;&#20102;&#22522;&#30784;&#12290;&#25105;&#20204;&#30340;&#36129;&#29486;&#26377;&#20004;&#20010;&#26041;&#38754;&#65306;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#32508;&#21512;&#30340;&#26041;&#27861;&#26469;&#27169;&#25311;&#22810;&#23618;&#27425;&#31163;&#25955;&#25293;&#21334;&#25968;&#25454;&#65292;&#25105;&#20204;&#24378;&#35843;&#20102;DGM&#20316;&#20026;&#20248;&#21270;&#27169;&#25311;&#25216;&#26415;&#21644;&#20419;&#36827;&#22522;&#20110;&#29983;&#25104;&#22411;&#20154;&#24037;&#26234;&#33021;&#30340;&#32463;&#27982;&#27169;&#22411;&#21457;&#23637;&#30340;&#26377;&#21147;&#24037;&#20855;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a deep learning solution to address the challenges of simulating realistic synthetic first-price sealed-bid auction data. The complexities encountered in this type of auction data include high-cardinality discrete feature spaces and a multilevel structure arising from multiple bids associated with a single auction instance. Our methodology combines deep generative modeling (DGM) with an artificial learner that predicts the conditional bid distribution based on auction characteristics, contributing to advancements in simulation-based research. This approach lays the groundwork for creating realistic auction environments suitable for agent-based learning and modeling applications. Our contribution is twofold: we introduce a comprehensive methodology for simulating multilevel discrete auction data, and we underscore the potential of DGM as a powerful instrument for refining simulation techniques and fostering the development of economic models grounded in generative AI.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#31616;&#21333;&#24555;&#36895;&#30340;&#31639;&#27861;&#26469;&#20272;&#35745;&#28151;&#21512;&#31995;&#32479;&#20013;&#29366;&#24577;&#21464;&#37327;&#20043;&#38388;&#30340;&#30636;&#26102;&#30456;&#20851;&#24615;&#65292;&#20351;&#29992;&#29616;&#36135;&#21033;&#29575;&#12289;&#32929;&#31080;&#20215;&#26684;&#21644;&#38544;&#21547;&#27874;&#21160;&#29575;&#31561;&#35266;&#27979;&#24066;&#22330;&#37327;&#20043;&#38388;&#30340;&#32463;&#39564;&#30456;&#20851;&#24615;&#65292;&#24182;&#21487;&#20351;&#29992;&#30701;&#26399;&#24179;&#20215;&#38544;&#21547;&#27874;&#21160;&#29575;&#30340;&#24179;&#26041;&#20316;&#20026;&#19981;&#21487;&#35266;&#27979;&#38543;&#26426;&#26041;&#24046;&#30340;&#20195;&#29702;&#12290;&#20272;&#35745;&#32467;&#26524;&#30456;&#24403;&#20934;&#30830;&#65292;&#19988;&#23545;&#20110;&#38169;&#35823;&#25351;&#23450;&#30340;&#21033;&#29575;&#27169;&#22411;&#21442;&#25968;&#21644;&#30701;&#37319;&#26679;&#21608;&#26399;&#20551;&#35774;&#26159;&#40065;&#26834;&#30340;&#12290;</title><link>http://arxiv.org/abs/2111.06042</link><description>&lt;p&gt;
&#28151;&#21512;&#31995;&#32479;&#20013;&#30340;&#30456;&#20851;&#24615;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Correlation Estimation in Hybrid Systems. (arXiv:2111.06042v4 [q-fin.CP] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2111.06042
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#31616;&#21333;&#24555;&#36895;&#30340;&#31639;&#27861;&#26469;&#20272;&#35745;&#28151;&#21512;&#31995;&#32479;&#20013;&#29366;&#24577;&#21464;&#37327;&#20043;&#38388;&#30340;&#30636;&#26102;&#30456;&#20851;&#24615;&#65292;&#20351;&#29992;&#29616;&#36135;&#21033;&#29575;&#12289;&#32929;&#31080;&#20215;&#26684;&#21644;&#38544;&#21547;&#27874;&#21160;&#29575;&#31561;&#35266;&#27979;&#24066;&#22330;&#37327;&#20043;&#38388;&#30340;&#32463;&#39564;&#30456;&#20851;&#24615;&#65292;&#24182;&#21487;&#20351;&#29992;&#30701;&#26399;&#24179;&#20215;&#38544;&#21547;&#27874;&#21160;&#29575;&#30340;&#24179;&#26041;&#20316;&#20026;&#19981;&#21487;&#35266;&#27979;&#38543;&#26426;&#26041;&#24046;&#30340;&#20195;&#29702;&#12290;&#20272;&#35745;&#32467;&#26524;&#30456;&#24403;&#20934;&#30830;&#65292;&#19988;&#23545;&#20110;&#38169;&#35823;&#25351;&#23450;&#30340;&#21033;&#29575;&#27169;&#22411;&#21442;&#25968;&#21644;&#30701;&#37319;&#26679;&#21608;&#26399;&#20551;&#35774;&#26159;&#40065;&#26834;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#35266;&#27979;&#24066;&#22330;&#37327;&#65288;&#22914;&#29616;&#36135;&#21033;&#29575;&#12289;&#32929;&#31080;&#20215;&#26684;&#21644;&#38544;&#21547;&#27874;&#21160;&#29575;&#65289;&#20043;&#38388;&#30340;&#32463;&#39564;&#30456;&#20851;&#24615;&#65292;&#26469;&#20272;&#35745;&#28151;&#21512;&#31995;&#32479;&#20013;&#29366;&#24577;&#21464;&#37327;&#20043;&#38388;&#30340;&#30636;&#26102;&#30456;&#20851;&#24615;&#12290;&#26032;&#31639;&#27861;&#38750;&#24120;&#24555;&#36895;&#65292;&#22240;&#20026;&#21482;&#28041;&#21450;&#20302;&#32500;&#32447;&#24615;&#31995;&#32479;&#12290;&#22914;&#26524;&#32447;&#24615;&#31995;&#32479;&#20135;&#29983;&#30340;&#30697;&#38453;&#19981;&#26159;&#21322;&#27491;&#23450;&#30340;&#65292;&#21017;&#24314;&#35758;&#20351;&#29992;&#25910;&#32553;&#27861;&#23558;&#30697;&#38453;&#36716;&#21270;&#20026;&#21322;&#27491;&#23450;&#30340;&#65292;&#35813;&#26041;&#27861;&#21482;&#38656;&#35201;&#20108;&#20998;&#36845;&#20195;&#12290;&#26412;&#25991;&#24314;&#35758;&#20351;&#29992;&#30701;&#26399;&#24179;&#20215;&#38544;&#21547;&#27874;&#21160;&#29575;&#30340;&#24179;&#26041;&#20316;&#20026;&#19981;&#21487;&#35266;&#27979;&#38543;&#26426;&#26041;&#24046;&#30340;&#20195;&#29702;&#12290;&#24403;&#38544;&#21547;&#27874;&#21160;&#29575;&#19981;&#21487;&#29992;&#26102;&#65292;&#25552;&#20379;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#25216;&#24039;&#26469;&#22635;&#34917;&#32570;&#22833;&#30340;&#30456;&#20851;&#24615;&#12290;&#25968;&#20540;&#30740;&#31350;&#34920;&#26126;&#65292;&#20351;&#29992;&#36229;&#36807;1,000&#20010;&#25968;&#25454;&#28857;&#26102;&#65292;&#20272;&#35745;&#32467;&#26524;&#30456;&#24403;&#20934;&#30830;&#12290;&#27492;&#22806;&#65292;&#35813;&#31639;&#27861;&#23545;&#20110;&#38169;&#35823;&#25351;&#23450;&#30340;&#21033;&#29575;&#27169;&#22411;&#21442;&#25968;&#21644;&#30701;&#37319;&#26679;&#21608;&#26399;&#20551;&#35774;&#26159;&#40065;&#26834;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
A simple method is proposed to estimate the instantaneous correlations between state variables in a hybrid system from the empirical correlations between observable market quantities such as spot rate, stock price and implied volatility. The new algorithm is extremely fast since only low-dimension linear systems are involved. If the resulting matrix from the linear systems is not positive semidefinite, the shrinking method, which requires only bisection-style iterations, is recommended to convert the matrix to positive semidefinite. The square of short-term at-the-money implied volatility is suggested as the proxy for the unobservable stochastic variance. When the implied volatility is not available, a simple trick is provided to fill in the missing correlations. Numerical study shows that the estimates are reasonably accurate, when using more than 1,000 data points. In addition, the algorithm is robust to misspecified interest rate model parameters and the short-sampling-period assump
&lt;/p&gt;</description></item></channel></rss>