<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#22312;&#39118;&#38505;&#25935;&#24863;&#30340;&#22343;&#22330;&#21338;&#24328;&#20013;&#24341;&#20837;&#20102;&#19968;&#20010;&#20027;&#35201;&#20195;&#29702;&#65292;&#19982;&#20247;&#22810;&#27425;&#35201;&#20195;&#29702;&#30456;&#20114;&#20316;&#29992;&#65292;&#23545;&#27425;&#35201;&#20195;&#29702;&#20135;&#29983;&#37325;&#22823;&#24433;&#21709;&#65292;&#20026;&#39118;&#38505;&#25935;&#24863;&#29702;&#35770;&#30340;&#36827;&#19968;&#27493;&#21457;&#23637;&#25552;&#20379;&#20102;&#24605;&#36335;&#12290;</title><link>http://arxiv.org/abs/2305.15364</link><description>&lt;p&gt;
LQG&#39118;&#38505;&#25935;&#24863;&#22343;&#22330;&#21338;&#24328;&#20013;&#30340;&#20027;&#35201;&#20195;&#29702;&#21830;&#65306;&#19968;&#31181;&#21464;&#20998;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
LQG Risk-Sensitive Mean Field Games with a Major Agent: A Variational Approach. (arXiv:2305.15364v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.15364
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22312;&#39118;&#38505;&#25935;&#24863;&#30340;&#22343;&#22330;&#21338;&#24328;&#20013;&#24341;&#20837;&#20102;&#19968;&#20010;&#20027;&#35201;&#20195;&#29702;&#65292;&#19982;&#20247;&#22810;&#27425;&#35201;&#20195;&#29702;&#30456;&#20114;&#20316;&#29992;&#65292;&#23545;&#27425;&#35201;&#20195;&#29702;&#20135;&#29983;&#37325;&#22823;&#24433;&#21709;&#65292;&#20026;&#39118;&#38505;&#25935;&#24863;&#29702;&#35770;&#30340;&#36827;&#19968;&#27493;&#21457;&#23637;&#25552;&#20379;&#20102;&#24605;&#36335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39118;&#38505;&#25935;&#24863;&#22312;&#37329;&#34701;&#21644;&#32463;&#27982;&#30740;&#31350;&#20013;&#25198;&#28436;&#37325;&#35201;&#35282;&#33394;&#65292;&#39118;&#38505;&#20013;&#24615;&#27169;&#22411;&#26080;&#27861;&#25429;&#25417;&#24182;&#35777;&#26126;&#29616;&#23454;&#20013;&#35266;&#23519;&#21040;&#30340;&#25152;&#26377;&#32463;&#27982;&#34892;&#20026;&#12290;&#26368;&#36817;&#21457;&#23637;&#20102;&#39118;&#38505;&#25935;&#24863;&#22343;&#22330;&#21338;&#24328;&#29702;&#35770;&#65292;&#29992;&#20110;&#23384;&#22312;&#22823;&#37327;&#19981;&#21487;&#21306;&#20998;&#12289;&#28176;&#36817;&#21487;&#24573;&#30053;&#21644;&#24322;&#36136;&#30340;&#39118;&#38505;&#25935;&#24863;&#29609;&#23478;&#36890;&#36807;&#20154;&#21475;&#29366;&#24577;&#32463;&#39564;&#20998;&#24067;&#30456;&#32806;&#21512;&#30340;&#31995;&#32479;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#23558;&#32447;&#24615;&#20108;&#27425;&#39640;&#26031;&#39118;&#38505;&#25935;&#24863;&#22343;&#22330;&#21338;&#24328;&#29702;&#35770;&#25193;&#23637;&#21040;&#23384;&#22312;&#19968;&#20010;&#20027;&#35201;&#20195;&#29702;&#21644;&#22823;&#37327;&#27425;&#35201;&#20195;&#29702;&#30340;&#35774;&#32622;&#20013;&#12290;&#20027;&#35201;&#20195;&#29702;&#23545;&#27599;&#20010;&#27425;&#35201;&#20195;&#29702;&#20135;&#29983;&#37325;&#22823;&#24433;&#21709;&#65292;&#24182;&#19988;&#20854;&#24433;&#21709;&#19981;&#20250;&#38543;&#30528;&#27425;&#35201;&#20195;&#29702;&#25968;&#37327;&#30340;&#22686;&#21152;&#32780;&#23849;&#28291;&#12290;&#27599;&#20010;&#20195;&#29702;&#37117;&#21463;&#21040;&#20855;&#26377;&#25351;&#25968;-&#31215;&#20998;&#20108;&#27425;&#20195;&#20215;&#20989;&#25968;&#30340;&#32447;&#24615;&#21160;&#24577;&#24433;&#21709;&#12290;&#27492;&#22806;&#65292;&#25152;&#26377;&#20195;&#29702;&#36890;&#36807;&#27425;&#35201;&#20195;&#29702;&#30340;&#24179;&#22343;&#29366;&#24577;&#65288;&#25152;&#35859;&#30340;&#32463;&#39564;&#24179;&#22343;&#22330;&#65289;&#21644;&#20027;&#35201;&#20195;&#29702;&#30340;&#29366;&#24577;&#30456;&#20114;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Risk sensitivity plays an important role in the study of finance and economics as risk-neutral models cannot capture and justify all economic behaviors observed in reality. Risk-sensitive mean field game theory was developed recently for systems where there exists a large number of indistinguishable, asymptotically negligible and heterogeneous risk-sensitive players, who are coupled via the empirical distribution of state across population. In this work, we extend the theory of Linear Quadratic Gaussian risk-sensitive mean-field games to the setup where there exists one major agent as well as a large number of minor agents. The major agent has a significant impact on each minor agent and its impact does not collapse with the increase in the number of minor agents. Each agent is subject to linear dynamics with an exponential-of-integral quadratic cost functional. Moreover, all agents interact via the average state of minor agents (so-called empirical mean field) and the major agent's st
&lt;/p&gt;</description></item><item><title>&#22996;&#20869;&#29790;&#25289;&#32463;&#21382;&#20102;&#19977;&#27425;&#32463;&#27982;&#28798;&#38590;&#65292;&#20854;&#26368;&#20855;&#30772;&#22351;&#24615;&#30340;&#20915;&#31574;&#19981;&#26159;&#26469;&#33258;&#23500;&#20154;&#19982;&#22823;&#20247;&#20043;&#38388;&#30340;&#38454;&#32423;&#20914;&#31361;&#65292;&#32780;&#26159;&#30001;&#31934;&#33521;&#20043;&#38388;&#30340;&#28608;&#28872;&#20105;&#26007;&#25152;&#33268;&#12290;&#27492;&#22806;&#65292;&#35813;&#22269;&#30340;&#25919;&#27835;&#21046;&#24230;&#19981;&#22815;&#21253;&#23481;&#65292;&#19988;&#32570;&#20047;&#35843;&#35299;&#31934;&#33521;&#20869;&#37096;&#20914;&#31361;&#30340;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2305.14698</link><description>&lt;p&gt;
&#21518;&#29420;&#31435;&#22996;&#20869;&#29790;&#25289;&#30340;&#25919;&#27835;&#20914;&#31361;&#19982;&#32463;&#27982;&#22686;&#38271;
&lt;/p&gt;
&lt;p&gt;
Political Conflict and Economic Growth in Post-Independence Venezuela. (arXiv:2305.14698v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.14698
&lt;/p&gt;
&lt;p&gt;
&#22996;&#20869;&#29790;&#25289;&#32463;&#21382;&#20102;&#19977;&#27425;&#32463;&#27982;&#28798;&#38590;&#65292;&#20854;&#26368;&#20855;&#30772;&#22351;&#24615;&#30340;&#20915;&#31574;&#19981;&#26159;&#26469;&#33258;&#23500;&#20154;&#19982;&#22823;&#20247;&#20043;&#38388;&#30340;&#38454;&#32423;&#20914;&#31361;&#65292;&#32780;&#26159;&#30001;&#31934;&#33521;&#20043;&#38388;&#30340;&#28608;&#28872;&#20105;&#26007;&#25152;&#33268;&#12290;&#27492;&#22806;&#65292;&#35813;&#22269;&#30340;&#25919;&#27835;&#21046;&#24230;&#19981;&#22815;&#21253;&#23481;&#65292;&#19988;&#32570;&#20047;&#35843;&#35299;&#31934;&#33521;&#20869;&#37096;&#20914;&#31361;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#29420;&#31435;&#20197;&#26469;&#65292;&#22996;&#20869;&#29790;&#25289;&#32463;&#21382;&#20102;&#19977;&#27425;&#32463;&#27982;&#28798;&#38590;&#65306;&#20998;&#21035;&#21457;&#29983;&#22312;19&#12289;20&#21644;21&#19990;&#32426;&#12290;&#35299;&#37322;&#36825;&#19968;&#19977;&#37096;&#26354;&#30340;&#37325;&#35201;&#22240;&#32032;&#20043;&#19968;&#26159;&#38454;&#32423;&#20914;&#31361;&#21644;&#36164;&#28304;&#20381;&#36182;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#35266;&#28857;&#65292;&#35748;&#20026;&#26368;&#20855;&#30772;&#22351;&#24615;&#30340;&#25919;&#31574;&#36873;&#25321;&#24182;&#38750;&#26159;&#23500;&#20154;&#20026;&#20102;&#20445;&#25252;&#33258;&#24049;&#20813;&#21463;&#22823;&#20247;&#20914;&#20987;&#30340;&#32467;&#26524;&#65292;&#32780;&#26159;&#30001;&#31934;&#33521;&#20043;&#38388;&#30340;&#28608;&#28872;&#20105;&#26007;&#23548;&#33268;&#30340;&#12290;&#27492;&#22806;&#65292;&#26377;&#20154;&#35748;&#20026;&#22996;&#20869;&#29790;&#25289;&#25919;&#27835;&#21046;&#24230;&#26410;&#33021;&#20445;&#25345;&#22686;&#38271;&#65292;&#22240;&#20026;&#23427;&#20204;&#19981;&#22815;&#21253;&#23481;&#65292;&#25105;&#20204;&#35748;&#20026;&#36824;&#26159;&#32570;&#20047;&#35843;&#35299;&#31934;&#33521;&#20869;&#37096;&#20914;&#31361;&#30340;&#21046;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
Venezuela has suffered three economic catastrophes since independence: one each in the nineteenth, twentieth, and twenty-first centuries. Prominent explanations for this trilogy point to the interaction of class conflict and resource dependence. We turn attention to intra-class conflict, arguing that the most destructive policy choices stemmed not from the rich defending themselves against the masses but rather from pitched battles among elites. Others posit that Venezuelan political institutions failed to sustain growth because they were insufficiently inclusive; we suggest in addition that they inadequately mediated intra-elite conflict.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;ViT&#23545;OCR&#25991;&#26723;&#36827;&#34892;&#23383;&#31526;&#30456;&#20284;&#24615;&#24230;&#37327;&#65292;&#25552;&#20379;&#20102;&#19968;&#31181;&#21487;&#25193;&#23637;&#30340;&#35745;&#31639;&#23383;&#31526;&#26367;&#25442;&#25104;&#26412;&#30340;&#26041;&#27861;&#65292;&#36991;&#20813;&#20102;&#20351;&#29992;&#24120;&#29992;&#23383;&#31526;&#20018;&#26367;&#25442;&#26041;&#27861;&#23548;&#33268;&#30340;&#25968;&#25454;&#20559;&#24046;&#12290;</title><link>http://arxiv.org/abs/2305.14672</link><description>&lt;p&gt;
&#22522;&#20110;Vision Transformers&#30340;&#23383;&#31526;&#30456;&#20284;&#24230;&#37327;&#21270;
&lt;/p&gt;
&lt;p&gt;
Quantifying Character Similarity with Vision Transformers. (arXiv:2305.14672v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.14672
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;ViT&#23545;OCR&#25991;&#26723;&#36827;&#34892;&#23383;&#31526;&#30456;&#20284;&#24615;&#24230;&#37327;&#65292;&#25552;&#20379;&#20102;&#19968;&#31181;&#21487;&#25193;&#23637;&#30340;&#35745;&#31639;&#23383;&#31526;&#26367;&#25442;&#25104;&#26412;&#30340;&#26041;&#27861;&#65292;&#36991;&#20813;&#20102;&#20351;&#29992;&#24120;&#29992;&#23383;&#31526;&#20018;&#26367;&#25442;&#26041;&#27861;&#23548;&#33268;&#30340;&#25968;&#25454;&#20559;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35760;&#24405;&#38142;&#25509;&#26159;&#23450;&#37327;&#31038;&#20250;&#31185;&#23398;&#30340;&#22522;&#30707;&#65292;&#22240;&#20026;&#20998;&#26512;&#36890;&#24120;&#38656;&#35201;&#38142;&#25509;&#26469;&#33258;&#22810;&#20010;&#22024;&#26434;&#30340;&#26469;&#28304;&#30340;&#25968;&#25454;&#12290;&#29616;&#25104;&#30340;&#23383;&#31526;&#20018;&#21305;&#37197;&#26041;&#27861;&#34987;&#24191;&#27867;&#20351;&#29992;&#65292;&#22240;&#20026;&#23427;&#20204;&#26131;&#20110;&#23454;&#29616;&#21644;&#25193;&#23637;&#12290;&#28982;&#32780;&#65292;&#24182;&#38750;&#25152;&#26377;&#23383;&#31526;&#26367;&#25442;&#30340;&#27010;&#29575;&#37117;&#30456;&#31561;&#65292;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#65292;&#26377;&#19968;&#20123;&#24120;&#29992;&#30340;&#25163;&#24037;&#21046;&#20316;&#30340;&#21015;&#34920;&#65292;&#29992;&#26469;&#34920;&#31034;&#21738;&#20123;&#23383;&#31526;&#20018;&#26367;&#25442;&#26356;&#26377;&#21487;&#33021;&#65292;&#20174;&#32780;&#25552;&#39640;&#23383;&#31526;&#20018;&#21305;&#37197;&#30340;&#20934;&#30830;&#24615;&#12290;&#20294;&#26159;&#65292;&#23545;&#20110;&#35768;&#22810;&#24773;&#20917;&#65292;&#36825;&#26679;&#30340;&#28165;&#21333;&#24182;&#19981;&#23384;&#22312;&#65292;&#20174;&#32780;&#20351;&#24471;&#20855;&#26377;&#38142;&#25509;&#25968;&#25454;&#38598;&#30340;&#30740;&#31350;&#21521;&#23569;&#25968;&#39640;&#36164;&#28304;&#30340;&#32972;&#26223;&#20542;&#26012;&#65292;&#36825;&#20123;&#32972;&#26223;&#24182;&#19981;&#20195;&#34920;&#20154;&#31867;&#31038;&#20250;&#30340;&#22810;&#26679;&#24615;&#12290;&#26412;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#31181;&#21487;&#25193;&#23637;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#32463;&#36807;&#22686;&#24378;&#30340;&#25968;&#23383;&#23383;&#20307;&#36827;&#34892;&#22823;&#35268;&#27169;&#33258;&#30417;&#30563;&#35757;&#32451;&#30340;Vision Transformers&#65288;ViT&#65289;&#65292;&#26469;&#27979;&#37327;OCR&#25991;&#26723;&#30340;&#23383;&#31526;&#26367;&#25442;&#25104;&#26412;&#12290;&#23545;&#20110;&#27599;&#19968;&#31181;&#20351;&#29992;CJK&#33050;&#26412;&#32534;&#20889;&#30340;&#35821;&#35328;&#65292;&#25105;&#20204;&#23545;&#30456;&#21516;&#23383;&#31526;&#30340;&#19981;&#21516;&#22686;&#24378;&#36827;&#34892;&#23545;&#27604;&#23398;&#20064;&#24230;&#37327;&#31354;&#38388;&#65292;&#20174;&#32780;&#37327;&#21270;&#23383;&#31526;&#30340;&#30456;&#20284;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Record linkage is a bedrock of quantitative social science, as analyses often require linking data from multiple, noisy sources. Off-the-shelf string matching methods are widely used, as they are straightforward and cheap to implement and scale. Not all character substitutions are equally probable, and for some settings there are widely used handcrafted lists denoting which string substitutions are more likely, that improve the accuracy of string matching. However, such lists do not exist for many settings, skewing research with linked datasets towards a few high-resource contexts that are not representative of the diversity of human societies. This study develops an extensible way to measure character substitution costs for OCR'ed documents, by employing large-scale self-supervised training of vision transformers (ViT) with augmented digital fonts. For each language written with the CJK script, we contrastively learn a metric space where different augmentations of the same character a
&lt;/p&gt;</description></item><item><title>&#22269;&#23478;&#23618;&#38754;&#30340;&#26696;&#20363;&#30740;&#31350;&#21487;&#20197;&#20316;&#20026;&#36328;&#22269;&#25968;&#25454;&#30340;&#34917;&#20805;&#26469;&#35780;&#20272;&#32463;&#27982;&#21046;&#35009;&#30340;&#24433;&#21709;&#65292;&#20294;&#38656;&#35201;&#27880;&#24847;&#21487;&#33021;&#23384;&#22312;&#30340;&#23454;&#35777;&#38519;&#38449;&#12290;&#22240;&#27492;&#65292;&#26368;&#22909;&#23558;&#20854;&#35270;&#20026;&#36328;&#22269;&#30740;&#31350;&#30340;&#34917;&#20805;&#65292;&#32780;&#19981;&#26159;&#26367;&#20195;&#12290;</title><link>http://arxiv.org/abs/2305.14605</link><description>&lt;p&gt;
&#20272;&#35745;&#21046;&#35009;&#24433;&#21709;&#30340;&#22240;&#26524;&#25928;&#24212;: &#22269;&#23478;&#23618;&#38754;&#30740;&#31350;&#30340;&#20316;&#29992;&#26159;&#20160;&#20040;?
&lt;/p&gt;
&lt;p&gt;
Estimating causal effects of sanctions impacts: what role for country-level studies?. (arXiv:2305.14605v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.14605
&lt;/p&gt;
&lt;p&gt;
&#22269;&#23478;&#23618;&#38754;&#30340;&#26696;&#20363;&#30740;&#31350;&#21487;&#20197;&#20316;&#20026;&#36328;&#22269;&#25968;&#25454;&#30340;&#34917;&#20805;&#26469;&#35780;&#20272;&#32463;&#27982;&#21046;&#35009;&#30340;&#24433;&#21709;&#65292;&#20294;&#38656;&#35201;&#27880;&#24847;&#21487;&#33021;&#23384;&#22312;&#30340;&#23454;&#35777;&#38519;&#38449;&#12290;&#22240;&#27492;&#65292;&#26368;&#22909;&#23558;&#20854;&#35270;&#20026;&#36328;&#22269;&#30740;&#31350;&#30340;&#34917;&#20805;&#65292;&#32780;&#19981;&#26159;&#26367;&#20195;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22238;&#39038;&#20102;&#36817;&#26399;&#22312;&#36328;&#22269;&#21644;&#22269;&#23478;&#23618;&#38754;&#30740;&#31350;&#20013;&#35299;&#20915;&#23454;&#35777;&#37492;&#21035;&#38382;&#39064;&#30340;&#26368;&#26032;&#36827;&#23637;&#21450;&#20854;&#23545;&#32463;&#27982;&#21046;&#35009;&#25928;&#26524;&#21644;&#21518;&#26524;&#37492;&#21035;&#30340;&#24433;&#21709;&#12290;&#20316;&#32773;&#35748;&#20026;&#65292;&#22312;&#35780;&#20272;&#36328;&#22269;&#25968;&#25454;&#30340;&#22240;&#26524;&#20851;&#31995;&#26041;&#38754;&#23384;&#22312;&#22256;&#38590;&#30340;&#24773;&#20917;&#19979;&#65292;&#22269;&#23478;&#23618;&#38754;&#30340;&#26696;&#20363;&#30740;&#31350;&#21487;&#20197;&#20316;&#20026;&#36328;&#22269;&#22238;&#24402;&#30740;&#31350;&#30340;&#26377;&#29992;&#21644;&#20449;&#24687;&#24615;&#34917;&#20805;&#12290;&#20294;&#20316;&#32773;&#20063;&#35686;&#21578;&#65292;&#26696;&#20363;&#30740;&#31350;&#23384;&#22312;&#19968;&#31995;&#21015;&#28508;&#22312;&#30340;&#23454;&#35777;&#38519;&#38449;&#65292;&#21487;&#33021;&#35753;&#22240;&#26524;&#26426;&#21046;&#30340;&#35782;&#21035;&#21464;&#24471;&#27169;&#31946;&#65292;&#32780;&#19981;&#26159;&#26356;&#21152;&#28165;&#26224;&#26126;&#20102;&#12290;&#22240;&#27492;&#65292;&#38405;&#35835;&#26696;&#20363;&#30740;&#31350;&#35777;&#25454;&#30340;&#26368;&#26126;&#26234;&#30340;&#26041;&#27861;&#26159;&#23558;&#20854;&#35270;&#20026;&#36328;&#22269;&#30740;&#31350;&#30340;&#34917;&#20805;&#65292;&#32780;&#38750;&#26367;&#20195;&#12290;
&lt;/p&gt;
&lt;p&gt;
This article reviews recent advances in addressing empirical identification issues in cross-country and country-level studies and their implications for the identification of the effectiveness and consequences of economic sanctions. I argue that, given the difficulties in assessing causal relationships in cross-national data, country-level case studies can serve as a useful and informative complement to cross-national regression studies. However, I also warn that case studies pose a set of additional potential empirical pitfalls which can obfuscate rather than clarify the identification of causal mechanisms at work. Therefore, the most sensible way to read case study evidence is as a complement rather than as a substitute to cross-national research.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#32771;&#34385;&#20102;&#20132;&#26131;&#25163;&#32493;&#36153;&#23545;&#22871;&#21033;&#21033;&#28070;&#30340;&#24433;&#21709;&#65292;&#24182;&#19988;&#36890;&#36807;&#25968;&#23398;&#27169;&#22411;&#35745;&#31639;&#20986;&#20102;&#39044;&#26399;&#22871;&#21033;&#21033;&#28070;&#30340;&#30636;&#26102;&#29575;&#12290;</title><link>http://arxiv.org/abs/2305.14604</link><description>&lt;p&gt;
&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21644;&#22871;&#21033;&#21033;&#28070;&#22312;&#25163;&#32493;&#36153;&#23384;&#22312;&#30340;&#24773;&#20917;&#19979;
&lt;/p&gt;
&lt;p&gt;
Automated Market Making and Arbitrage Profits in the Presence of Fees. (arXiv:2305.14604v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.14604
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#20132;&#26131;&#25163;&#32493;&#36153;&#23545;&#22871;&#21033;&#21033;&#28070;&#30340;&#24433;&#21709;&#65292;&#24182;&#19988;&#36890;&#36807;&#25968;&#23398;&#27169;&#22411;&#35745;&#31639;&#20986;&#20102;&#39044;&#26399;&#22871;&#21033;&#21033;&#28070;&#30340;&#30636;&#26102;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20132;&#26131;&#25163;&#32493;&#36153;&#23545;&#22871;&#21033;&#20132;&#26131;&#32773;&#19982;&#33258;&#21160;&#21270;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;&#25110;&#31561;&#20215;&#30340;&#65292;&#23545;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30001;&#20110;&#22871;&#21033;&#25152;&#20135;&#29983;&#30340;&#36870;&#21521;&#36873;&#25321;&#65289;&#21033;&#28070;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#25193;&#23637;&#20102;Milionis&#31561;&#20154;&#30340;&#27169;&#22411;[2022]&#65292;&#38024;&#23545;&#19968;&#33324;&#31867;&#30340;&#20004;&#20010;&#36164;&#20135;AMM&#65292;&#24341;&#20837;&#20102;&#36153;&#29992;&#21644;&#31163;&#25955;&#27850;&#26494;&#22359;&#29983;&#25104;&#26102;&#38388;&#12290;&#22312;&#25105;&#20204;&#30340;&#35774;&#32622;&#19979;&#65292;&#25105;&#20204;&#33021;&#22815;&#22312;&#23553;&#38381;&#24418;&#24335;&#20013;&#35745;&#31639;&#22871;&#21033;&#21033;&#28070;&#30340;&#39044;&#26399;&#30636;&#26102;&#29575;&#12290;&#24403;&#25163;&#32493;&#36153;&#36739;&#20302;&#65292;&#22312;&#24555;&#22359;&#28176;&#36817;&#21306;&#22495;&#65292;&#25163;&#32493;&#36153;&#30340;&#24433;&#21709;&#21464;&#24471;&#38750;&#24120;&#31616;&#21333;&#65306;&#25163;&#32493;&#36153;&#21482;&#26159;&#23558;&#22871;&#21033;&#21033;&#28070;&#25353;&#21040;&#36798;&#22871;&#21033;&#32773;&#21487;&#20197;&#25214;&#21040;&#26377;&#21033;&#28070;&#30340;&#20132;&#26131;&#26102;&#21344;&#29992;&#26102;&#38388;&#30340;&#27604;&#20363;&#19979;&#35843;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the impact of trading fees on the profits of arbitrageurs trading against an automated marker marker (AMM) or, equivalently, on the adverse selection incurred by liquidity providers due to arbitrage. We extend the model of Milionis et al. [2022] for a general class of two asset AMMs to both introduce fees and discrete Poisson block generation times. In our setting, we are able to compute the expected instantaneous rate of arbitrage profit in closed form. When the fees are low, in the fast block asymptotic regime, the impact of fees takes a particularly simple form: fees simply scale down arbitrage profits by the fraction of time that an arriving arbitrageur finds a profitable trade.
&lt;/p&gt;</description></item><item><title>&#21487;&#20877;&#29616;&#24615;&#19982;&#36879;&#26126;&#24230;&#19981;&#19968;&#23450;&#20250;&#21463;&#21040;&#38544;&#31169;&#21644;&#26426;&#23494;&#24615;&#30340;&#38459;&#30861;&#65292;&#22240;&#20026;&#35768;&#22810;&#20445;&#23494;&#25968;&#25454;&#26159;&#24320;&#25918;&#30340;&#12290;</title><link>http://arxiv.org/abs/2305.14478</link><description>&lt;p&gt;
&#21487;&#20877;&#29616;&#24615;&#21644;&#36879;&#26126;&#24230;&#19982;&#38544;&#31169;&#21644;&#26426;&#23494;&#24615;&#30340;&#24179;&#34913;&#65306;&#19968;&#20301;&#25968;&#25454;&#32534;&#36753;&#30340;&#24605;&#32771;&#12290;
&lt;/p&gt;
&lt;p&gt;
Reproducibility and Transparency versus Privacy and Confidentiality: Reflections from a Data Editor. (arXiv:2305.14478v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.14478
&lt;/p&gt;
&lt;p&gt;
&#21487;&#20877;&#29616;&#24615;&#19982;&#36879;&#26126;&#24230;&#19981;&#19968;&#23450;&#20250;&#21463;&#21040;&#38544;&#31169;&#21644;&#26426;&#23494;&#24615;&#30340;&#38459;&#30861;&#65292;&#22240;&#20026;&#35768;&#22810;&#20445;&#23494;&#25968;&#25454;&#26159;&#24320;&#25918;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24448;&#24448;&#35748;&#20026;&#36879;&#26126;&#24230;&#21644;&#21487;&#20877;&#29616;&#24615;&#19982;&#38544;&#31169;&#21644;&#26426;&#23494;&#24615;&#30456;&#21453;&#12290;&#38656;&#35201;&#20445;&#23494;&#30340;&#25968;&#25454;&#34987;&#35748;&#20026;&#26159;&#21487;&#20877;&#29616;&#24615;&#30340;&#38556;&#30861;&#65292;&#32780;&#38544;&#31169;&#21017;&#20284;&#20046;&#20250;&#25233;&#21046;&#36879;&#26126;&#24230;&#12290;&#25105;&#25552;&#20986;&#20102;&#19968;&#20010;&#26356;&#23500;&#26377;&#32454;&#24494;&#24046;&#21035;&#30340;&#35266;&#28857;&#65292;&#24182;&#20351;&#29992;&#36229;&#36807;1,000&#39033;&#21487;&#20877;&#29616;&#24615;&#35780;&#20272;&#30340;&#20363;&#23376;&#65292;&#23637;&#31034;&#20102;&#26426;&#23494;&#25968;&#25454;&#21487;&#20197;&#24456;&#22909;&#22320;&#29992;&#20110;&#21487;&#20877;&#29616;&#21644;&#36879;&#26126;&#30340;&#30740;&#31350;&#12290;&#20851;&#38190;&#35265;&#35299;&#26159;&#65292;&#34429;&#28982;&#26080;&#32842;&#65292;&#20294;&#35768;&#22810;&#20445;&#23494;&#25968;&#25454;&#26159;&#24320;&#25918;&#32473;&#25968;&#30334;&#29978;&#33267;&#25968;&#21315;&#21517;&#30740;&#31350;&#20154;&#21592;&#30340;&#12290;&#22312;&#26410;&#26469;&#23569;&#25968;&#30740;&#31350;&#20154;&#21592;&#21487;&#20197;&#32771;&#34385;&#35775;&#38382;&#36825;&#20123;&#25968;&#25454;&#30340;&#24773;&#20917;&#19979;&#65292;&#21487;&#20877;&#29616;&#24615;&#26381;&#21153;&#65292;&#20363;&#22914;&#19968;&#20123;&#26399;&#21002;&#25552;&#20379;&#30340;&#26381;&#21153;&#65292;&#21487;&#20197;&#20026;&#26377;&#25928;&#30340;&#21487;&#20877;&#29616;&#24615;&#25552;&#20379;&#35777;&#25454;&#65292;&#21363;&#20351;&#21516;&#26679;&#30340;&#25968;&#25454;&#26410;&#26469;&#21487;&#33021;&#26080;&#27861;&#20877;&#20351;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Transparency and reproducibility are often seen in opposition to privacy and confidentiality. Data that need to be kept confidential are seen as an impediment to reproducibility, and privacy would seem to inhibit transparency. I bring a more nuanced view to the discussion, and show, using examples from over 1,000 reproducibility assessments, that confidential data can very well be used in reproducible and transparent research. The key insight is that access to most confidential data, while tedious, is open to hundreds if not thousands of researchers. In cases where few researchers can consider accessing such data in the future, reproducibility services, such as those provided by some journals, can provide some evidence for effective reproducibility even when the same data may not be available for future research.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#22411;&#30340;Informer&#32593;&#32476;&#65292;&#35813;&#32593;&#32476;&#22312;&#32929;&#31080;&#21644;&#24066;&#22330;&#25351;&#25968;&#39044;&#27979;&#20013;&#21462;&#24471;&#20102;&#26368;&#20339;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2305.14382</link><description>&lt;p&gt;
&#20351;&#29992;Informer&#32593;&#32476;&#36827;&#34892;&#32929;&#31080;&#21644;&#24066;&#22330;&#25351;&#25968;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Stock and market index prediction using Informer network. (arXiv:2305.14382v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.14382
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#22411;&#30340;Informer&#32593;&#32476;&#65292;&#35813;&#32593;&#32476;&#22312;&#32929;&#31080;&#21644;&#24066;&#22330;&#25351;&#25968;&#39044;&#27979;&#20013;&#21462;&#24471;&#20102;&#26368;&#20339;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#23398;&#20064;&#22312;&#37329;&#34701;&#24066;&#22330;&#39044;&#27979;&#20013;&#30340;&#24212;&#29992;&#24050;&#32463;&#24341;&#36215;&#20102;&#25237;&#36164;&#32773;&#21644;&#30740;&#31350;&#20154;&#21592;&#30340;&#26497;&#22823;&#20851;&#27880;&#12290;Informer&#26159;&#19968;&#31181;&#26032;&#22411;&#30340;&#32593;&#32476;&#65292;&#23427;&#22312;Transformer&#30340;&#22522;&#30784;&#19978;&#36827;&#34892;&#20102;&#25913;&#36827;&#65292;&#20855;&#26377;&#26356;&#23567;&#30340;&#35745;&#31639;&#22797;&#26434;&#24230;&#12289;&#26356;&#38271;&#30340;&#39044;&#27979;&#38271;&#24230;&#21644;&#20840;&#23616;&#26102;&#38388;&#25139;&#29305;&#24615;&#12290;&#25105;&#20204;&#35774;&#35745;&#20102;&#19977;&#20010;&#23454;&#39564;&#65292;&#27604;&#36739;&#20102;&#22312;1&#20998;&#38047;&#21644;5&#20998;&#38047;&#39057;&#29575;&#19979;&#20351;&#29992;Informer&#12289;LSTM&#12289;Transformer&#21644;BERT&#39044;&#27979;&#22235;&#31181;&#19981;&#21516;&#32929;&#31080;/&#24066;&#22330;&#25351;&#25968;&#30340;&#25928;&#26524;&#12290;&#39044;&#27979;&#32467;&#26524;&#36890;&#36807;&#19977;&#20010;&#35780;&#20272;&#26631;&#20934;&#36827;&#34892;&#35780;&#20272;&#65306;MAE&#12289;RMSE&#21644;MAPE&#12290;Informer&#22312;&#27599;&#20010;&#25968;&#25454;&#38598;&#19978;&#37117;&#33719;&#24471;&#20102;&#26368;&#20339;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
Applications of deep learning in financial market prediction has attracted huge attention from investors and researchers. In particular, intra-day prediction at the minute scale, the dramatically fluctuating volume and stock prices within short time periods have posed a great challenge for the convergence of networks result. Informer is a more novel network, improved on Transformer with smaller computational complexity, longer prediction length and global time stamp features. We have designed three experiments to compare Informer with the commonly used networks LSTM, Transformer and BERT on 1-minute and 5-minute frequencies for four different stocks/ market indices. The prediction results are measured by three evaluation criteria: MAE, RMSE and MAPE. Informer has obtained best performance among all the networks on every dataset. Network without the global time stamp mechanism has significantly lower prediction effect compared to the complete Informer; it is evident that this mechanism 
&lt;/p&gt;</description></item><item><title>&#20351;&#29992;CNN-LSTM&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#21487;&#20197;&#20934;&#30830;&#39044;&#27979;&#32929;&#24066;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#65292;&#35299;&#20915;&#20102;&#35768;&#22810;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#35757;&#32451;&#23454;&#26102;&#25968;&#25454;&#19981;&#20934;&#30830;&#31561;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2305.14378</link><description>&lt;p&gt;
&#20351;&#29992;CNN-LSTM&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#39044;&#27979;&#32929;&#24066;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;
&lt;/p&gt;
&lt;p&gt;
Predicting Stock Market Time-Series Data using CNN-LSTM Neural Network Model. (arXiv:2305.14378v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.14378
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;CNN-LSTM&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#21487;&#20197;&#20934;&#30830;&#39044;&#27979;&#32929;&#24066;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#65292;&#35299;&#20915;&#20102;&#35768;&#22810;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#35757;&#32451;&#23454;&#26102;&#25968;&#25454;&#19981;&#20934;&#30830;&#31561;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32929;&#24066;&#36890;&#24120;&#24456;&#37325;&#35201;&#65292;&#22240;&#20026;&#23427;&#20195;&#34920;&#20102;&#23545;&#20225;&#19994;&#30340;&#25152;&#26377;&#26435;&#32034;&#36180;&#12290;&#22914;&#26524;&#20844;&#21496;&#27809;&#26377;&#36275;&#22815;&#30340;&#32929;&#31080;&#65292;&#23601;&#26080;&#27861;&#22312;&#37329;&#34701;&#26041;&#38754;&#34920;&#29616;&#33391;&#22909;&#12290;&#39044;&#27979;&#20844;&#21496;&#32929;&#31080;&#24066;&#22330;&#34920;&#29616;&#20960;&#20046;&#26159;&#22256;&#38590;&#30340;&#65292;&#22240;&#20026;&#27599;&#27425;&#20844;&#21496;&#32929;&#31080;&#20215;&#26684;&#37117;&#22312;&#21464;&#21270;&#32780;&#19981;&#26159;&#24658;&#23450;&#30340;&#65292;&#22240;&#27492;&#24456;&#38590;&#30830;&#23450;&#32929;&#31080;&#25968;&#25454;&#12290;&#20294;&#26159;&#65292;&#22914;&#26524;&#24050;&#30693;&#20844;&#21496;&#22312;&#32929;&#31080;&#24066;&#22330;&#19978;&#30340;&#26089;&#26399;&#34920;&#29616;&#65292;&#25105;&#20204;&#21487;&#20197;&#36319;&#36394;&#25968;&#25454;&#24182;&#21521;&#32929;&#31080;&#25345;&#26377;&#20154;&#25552;&#20379;&#39044;&#27979;&#65292;&#20197;&#20415;&#26126;&#26234;&#22320;&#20915;&#23450;&#22788;&#29702;&#20844;&#21496;&#32929;&#31080;&#12290;&#20026;&#27492;&#65292;&#35768;&#22810;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#24050;&#34987;&#21457;&#26126;&#65292;&#20294;&#30001;&#20110;&#35768;&#22810;&#21407;&#22240;&#65288;&#22914;&#32570;&#20047;&#39640;&#32423;&#24211;&#12289;&#20351;&#29992;&#23454;&#26102;&#25968;&#25454;&#35757;&#32451;&#27169;&#22411;&#30340;&#19981;&#20934;&#30830;&#24615;&#31561;&#65289;&#65292;&#23427;&#20204;&#24182;&#27809;&#26377;&#25104;&#21151;&#12290;&#22240;&#27492;&#65292;&#36890;&#36807;&#35782;&#21035;&#32929;&#31080;&#25968;&#25454;&#30340;&#29305;&#24449;&#24182;&#21019;&#24314;CNN-LSTM&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#65292;&#25105;&#20204;&#21487;&#20197;&#20934;&#30830;&#22320;&#39044;&#27979;&#32929;&#24066;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
Stock market is often important as it represents the ownership claims on businesses. Without sufficient stocks, a company cannot perform well in finance. Predicting a stock market performance of a company is nearly hard because every time the prices of a company stock keeps changing and not constant. So, its complex to determine the stock data. But if the previous performance of a company in stock market is known, then we can track the data and provide predictions to stockholders in order to wisely take decisions on handling the stocks to a company. To handle this, many machine learning models have been invented but they didn't succeed due to many reasons like absence of advanced libraries, inaccuracy of model when made to train with real time data and much more. So, to track the patterns and the features of data, a CNN-LSTM Neural Network can be made. Recently, CNN is now used in Natural Language Processing (NLP) based applications, so by identifying the features from stock data and c
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;Transformer&#21644;&#24773;&#24863;&#20998;&#26512;&#30340;&#27169;&#22411;&#65292;&#29992;&#20110;&#20934;&#30830;&#39044;&#27979;&#38271;&#26102;&#38388;&#31383;&#21475;&#20869;&#30340;&#32929;&#31080;&#36235;&#21183;&#65292;&#24182;&#24341;&#20837;&#20102;&#19968;&#20010;&#21253;&#21547;&#25216;&#26415;&#32929;&#31080;&#25968;&#25454;&#21644;&#22836;&#26465;&#26032;&#38395;&#25968;&#25454;&#30340;&#26032;&#25968;&#25454;&#38598;&#12290;</title><link>http://arxiv.org/abs/2305.14368</link><description>&lt;p&gt;
&#20351;&#29992;Transformer&#21644;&#24773;&#24863;&#20998;&#26512;&#25903;&#25345;&#32929;&#31080;&#36235;&#21183;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Support for Stock Trend Prediction Using Transformers and Sentiment Analysis. (arXiv:2305.14368v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.14368
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;Transformer&#21644;&#24773;&#24863;&#20998;&#26512;&#30340;&#27169;&#22411;&#65292;&#29992;&#20110;&#20934;&#30830;&#39044;&#27979;&#38271;&#26102;&#38388;&#31383;&#21475;&#20869;&#30340;&#32929;&#31080;&#36235;&#21183;&#65292;&#24182;&#24341;&#20837;&#20102;&#19968;&#20010;&#21253;&#21547;&#25216;&#26415;&#32929;&#31080;&#25968;&#25454;&#21644;&#22836;&#26465;&#26032;&#38395;&#25968;&#25454;&#30340;&#26032;&#25968;&#25454;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32929;&#31080;&#36235;&#21183;&#20998;&#26512;&#26159;&#19968;&#20010;&#26377;&#24433;&#21709;&#21147;&#30340;&#26102;&#38388;&#24207;&#21015;&#39044;&#27979;&#20027;&#39064;&#65292;&#30001;&#20110;&#20854;&#21033;&#28070;&#20016;&#21402;&#19988;&#20869;&#22312;&#28151;&#20081;&#30340;&#29305;&#24615;&#32780;&#21463;&#21040;&#20851;&#27880;&#12290;&#35768;&#22810;&#26088;&#22312;&#20934;&#30830;&#39044;&#27979;&#32929;&#31080;&#36235;&#21183;&#30340;&#27169;&#22411;&#37117;&#22522;&#20110;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#65288;RNN&#65289;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;RNN&#30340;&#38480;&#21046;&#65292;&#22914;&#26799;&#24230;&#28040;&#22833;&#21644;&#38271;&#26399;&#20381;&#36182;&#20851;&#31995;&#38543;&#30528;&#24207;&#21015;&#38271;&#24230;&#30340;&#22686;&#21152;&#32780;&#20002;&#22833;&#65292;&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#22522;&#20110;Transformer&#30340;&#27169;&#22411;&#65292;&#20351;&#29992;&#25216;&#26415;&#32929;&#31080;&#25968;&#25454;&#21644;&#24773;&#24863;&#20998;&#26512;&#65292;&#23454;&#29616;&#20102;&#23545;&#38271;&#26102;&#38388;&#31383;&#21475;&#20869;&#32929;&#31080;&#36235;&#21183;&#30340;&#20934;&#30830;&#39044;&#27979;&#12290;&#26412;&#25991;&#36824;&#20171;&#32461;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#25968;&#25454;&#38598;&#65292;&#20854;&#20013;&#21253;&#21547;&#20102;&#36817;&#19977;&#24180;&#30340;&#27599;&#26085;&#25216;&#26415;&#32929;&#31080;&#25968;&#25454;&#21644;&#22836;&#26465;&#26032;&#38395;&#25968;&#25454;&#12290;&#20165;&#22522;&#20110;&#25216;&#26415;&#25968;&#25454;&#30340;&#32929;&#31080;&#39044;&#27979;&#21487;&#33021;&#20250;&#21463;&#21040;&#28382;&#21518;&#30340;&#24433;&#21709;&#65292;&#22240;&#20026;&#32929;&#31080;&#25351;&#26631;&#26080;&#27861;&#26377;&#25928;&#22320;&#22240;&#24212;&#24066;&#22330;&#26032;&#38395;&#30340;&#21464;&#21270;&#12290;&#20351;&#29992;&#24773;&#24863;&#20998;&#26512;&#26469;&#20998;&#26512;&#22836;&#26465;&#26032;&#38395;&#21487;&#20197;&#24110;&#21161;&#24212;&#23545;&#30001;&#26032;&#38395;&#25253;&#36947;&#24341;&#36215;&#30340;&#24066;&#22330;&#26465;&#20214;&#30340;&#19981;&#21487;&#39044;&#35265;&#30340;&#21464;&#21270;&#12290;&#25105;&#20204;&#34913;&#37327;&#20102;&#27169;&#22411;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Stock trend analysis has been an influential time-series prediction topic due to its lucrative and inherently chaotic nature. Many models looking to accurately predict the trend of stocks have been based on Recurrent Neural Networks (RNNs). However, due to the limitations of RNNs, such as gradient vanish and long-term dependencies being lost as sequence length increases, in this paper we develop a Transformer based model that uses technical stock data and sentiment analysis to conduct accurate stock trend prediction over long time windows. This paper also introduces a novel dataset containing daily technical stock data and top news headline data spanning almost three years. Stock prediction based solely on technical data can suffer from lag caused by the inability of stock indicators to effectively factor in breaking market news. The use of sentiment analysis on top headlines can help account for unforeseen shifts in market conditions caused by news coverage. We measure the performance
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26234;&#33021;&#39044;&#27979;&#20449;&#29992;&#20538;&#36829;&#32422;&#39118;&#38505;&#30340;&#26694;&#26550;&#65292;&#21487;&#20197;&#25552;&#20379;&#31934;&#30830;&#30340;&#25353;&#22825;&#39044;&#27979;&#30340;&#36829;&#32422;&#39118;&#38505;&#39044;&#27979;&#65292;&#20197;&#32500;&#25252;&#20013;&#22269;&#20538;&#21048;&#24066;&#22330;&#30340;&#31283;&#23450;&#21644;&#20581;&#24247;&#21457;&#23637;&#12290;</title><link>http://arxiv.org/abs/2305.12142</link><description>&lt;p&gt;
&#20851;&#20110;&#20449;&#29992;&#20538;&#36829;&#32422;&#39118;&#38505;&#30340;&#26234;&#33021;&#39044;&#27979;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Study on Intelligent Forecasting of Credit Bond Default Risk. (arXiv:2305.12142v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.12142
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26234;&#33021;&#39044;&#27979;&#20449;&#29992;&#20538;&#36829;&#32422;&#39118;&#38505;&#30340;&#26694;&#26550;&#65292;&#21487;&#20197;&#25552;&#20379;&#31934;&#30830;&#30340;&#25353;&#22825;&#39044;&#27979;&#30340;&#36829;&#32422;&#39118;&#38505;&#39044;&#27979;&#65292;&#20197;&#32500;&#25252;&#20013;&#22269;&#20538;&#21048;&#24066;&#22330;&#30340;&#31283;&#23450;&#21644;&#20581;&#24247;&#21457;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20013;&#22269;&#20538;&#21048;&#24066;&#22330;&#20013;&#30340;&#20449;&#29992;&#39118;&#38505;&#36234;&#26469;&#36234;&#26126;&#26174;&#65292;&#36825;&#20026;&#20449;&#29992;&#20538;&#25237;&#36164;&#32773;&#24102;&#26469;&#20102;&#26085;&#30410;&#21319;&#32423;&#30340;&#36829;&#32422;&#39118;&#38505;&#12290;&#37492;&#20110;&#24403;&#21069;&#20538;&#21048;&#20449;&#24687;&#25259;&#38706;&#19981;&#23436;&#25972;&#21644;&#19981;&#20934;&#30830;&#30340;&#24773;&#20917;&#65292;&#21450;&#26102;&#36319;&#36394;&#21644;&#39044;&#27979;&#20010;&#21035;&#20449;&#29992;&#20538;&#36829;&#32422;&#39118;&#38505;&#24050;&#25104;&#20026;&#32500;&#25252;&#24066;&#22330;&#31283;&#23450;&#21644;&#20445;&#38556;&#20581;&#24247;&#21457;&#23637;&#30340;&#24517;&#35201;&#25163;&#27573;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26234;&#33021;&#39044;&#27979;&#36829;&#32422;&#39118;&#38505;&#30340;&#26694;&#26550;&#65292;&#21487;&#25552;&#20379;&#31934;&#30830;&#30340;&#25353;&#22825;&#39044;&#27979;&#30340;&#36829;&#32422;&#39118;&#38505;&#39044;&#27979;&#12290;&#22312;&#36825;&#20010;&#26694;&#26550;&#20013;&#65292;&#25105;&#20204;&#39318;&#20808;&#24635;&#32467;&#24433;&#21709;&#20449;&#29992;&#20538;&#36829;&#32422;&#30340;&#22240;&#32032;&#24182;&#26500;&#24314;&#20102;&#19968;&#20010;&#39118;&#38505;&#25351;&#25968;&#20307;&#31995;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#19968;&#31181;&#22522;&#20110;&#20538;&#21048;&#36829;&#32422;&#39118;&#38505;&#28436;&#21270;&#29305;&#24449;&#30340;&#32452;&#21512;&#36829;&#32422;&#27010;&#29575;&#27880;&#37322;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#32771;&#34385;&#20102;&#25104;&#29087;&#25110;&#36829;&#32422;&#20538;&#21048;&#30340;&#27599;&#26085;&#36829;&#32422;&#39118;&#38505;&#27880;&#37322;&#30340;&#21464;&#20998;&#36125;&#21494;&#26031;&#39640;&#26031;&#28151;&#21512;&#20272;&#31639;&#12289;&#24066;&#22330;&#25351;&#25968;&#20272;&#31639;&#21644;&#36829;&#32422;&#36235;&#21183;&#21453;&#21521;&#20272;&#31639;&#30340;&#21152;&#26435;&#24179;&#22343;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
Credit risk in the China's bond market has become increasingly evident, creating a progressively escalating risk of default for credit bond investors. Given the current incomplete and inaccurate bond information disclosure, timely tracking and forecasting the individual credit bond default risks have become essential to maintain market stability and ensure healthy development. This paper proposes an Intelligent Forecasting Framework for Default Risk that provides precise day-by-day default risk prediction. In this framework, we first summarize the factors that impact credit bond defaults and construct a risk index system. Then, we employ a combined default probability annotation method based on the evolutionary characteristics of bond default risk. The method considers the weighted average of Variational Bayesian Gaussian Mixture estimation, Market Index estimation, and Default Trend Backward estimation for daily default risk annotation of matured or defaulted bonds according to the ri
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36947;&#36335;&#34892;&#39542;&#26102;&#38388;&#30340;&#37329;&#34701;&#34893;&#29983;&#21697;&#65292;&#21487;&#20197;&#20316;&#20026;&#19968;&#31181;&#21019;&#26032;&#30340;&#23545;&#20914;&#24037;&#20855;&#65292;&#22312;&#20132;&#36890;&#39046;&#22495;&#21644;&#37329;&#34701;&#24066;&#22330;&#20013;&#37117;&#26377;&#28508;&#22312;&#30340;&#24066;&#22330;&#21644;&#38656;&#27714;&#12290;</title><link>http://arxiv.org/abs/2305.02523</link><description>&lt;p&gt;
&#22522;&#20110;&#36947;&#36335;&#34892;&#39542;&#26102;&#38388;&#30340;&#37329;&#34701;&#34893;&#29983;&#21697;&#30340;&#20570;&#24066;&#21644;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
Market Making and Pricing of Financial Derivatives based on Road Travel Times. (arXiv:2305.02523v1 [stat.AP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02523
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36947;&#36335;&#34892;&#39542;&#26102;&#38388;&#30340;&#37329;&#34701;&#34893;&#29983;&#21697;&#65292;&#21487;&#20197;&#20316;&#20026;&#19968;&#31181;&#21019;&#26032;&#30340;&#23545;&#20914;&#24037;&#20855;&#65292;&#22312;&#20132;&#36890;&#39046;&#22495;&#21644;&#37329;&#34701;&#24066;&#22330;&#20013;&#37117;&#26377;&#28508;&#22312;&#30340;&#24066;&#22330;&#21644;&#38656;&#27714;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#20132;&#36890;&#26102;&#38388;&#34893;&#29983;&#21697;&#65292;&#36825;&#26159;&#19968;&#31181;&#22522;&#20110;&#36947;&#36335;&#34892;&#39542;&#26102;&#38388;&#30340;&#38750;&#20132;&#26131;&#22522;&#30784;&#36164;&#20135;&#30340;&#37329;&#34701;&#34893;&#29983;&#21697;&#12290;&#22312;&#20132;&#36890;&#39046;&#22495;&#65292;&#20132;&#36890;&#26102;&#38388;&#34893;&#29983;&#21697;&#34987;&#25552;&#20986;&#20316;&#20026;&#19968;&#31181;&#26356;&#21152;&#22522;&#26412;&#30340;&#23450;&#20215;&#26041;&#27861;&#65292;&#22240;&#20026;&#23427;&#19981;&#20165;&#32771;&#34385;&#20102;&#20132;&#36890;&#29366;&#20917;&#30340;&#27700;&#24179;&#65292;&#32780;&#19988;&#32771;&#34385;&#20102;&#20854;&#27874;&#21160;&#24615;&#12290;&#22312;&#37329;&#34701;&#24066;&#22330;&#20013;&#65292;&#20132;&#36890;&#26102;&#38388;&#34893;&#29983;&#21697;&#34987;&#25552;&#20986;&#20316;&#20026;&#19968;&#31181;&#21019;&#26032;&#30340;&#23545;&#20914;&#24037;&#20855;&#65292;&#21487;&#20197;&#23545;&#20914;&#24066;&#22330;&#39118;&#38505;&#65292;&#29305;&#21035;&#26159;&#22312;&#21152;&#23494;&#24066;&#22330;&#21644;&#20256;&#32479;&#38134;&#34892;&#19994;&#32463;&#21382;&#20102;&#26368;&#36817;&#30340;&#21387;&#21147;&#21518;&#12290;&#26412;&#25991;&#28041;&#21450;&#21040;&#20102;&#65288;a&#65289;&#24341;&#20837;&#27492;&#31867;&#34893;&#29983;&#21697;&#30340;&#21160;&#26426;&#65288;&#21363;&#23545;&#23545;&#20914;&#30340;&#35201;&#27714;&#65289;&#65292;&#65288;b&#65289;&#28508;&#22312;&#30340;&#24066;&#22330;&#65292;&#20197;&#21450;&#65288;c&#65289;&#20135;&#21697;&#35774;&#35745;&#21644;&#23450;&#20215;&#26041;&#26696;&#12290;&#23450;&#20215;&#26041;&#26696;&#26159;&#22522;&#20110;&#23454;&#26102;&#20256;&#24863;&#22120;&#25429;&#33719;&#30340;&#34892;&#39542;&#26102;&#38388;&#25968;&#25454;&#35774;&#35745;&#30340;&#65292;&#36825;&#20123;&#25968;&#25454;&#34987;&#24314;&#27169;&#20026;&#22885;&#24681;&#26031;&#22374;-&#20044;&#20262;&#36125;&#20811;&#65288;Ornstein-Uhlenbeck&#65289;&#36807;&#31243;&#65292;&#26356;&#26222;&#36941;&#22320;&#65292;&#26159;&#36830;&#32493;&#26102;&#38388;&#33258;&#22238;&#24402;&#31227;&#21160;&#24179;&#22343;&#65288;CARMA&#65289;&#27169;&#22411;&#12290;&#36825;&#31181;&#27169;&#22411;&#30340;&#26657;&#20934;&#26159;&#36890;&#36807;&#38544;&#34255;&#22240;&#23376;&#27169;&#22411;&#36827;&#34892;&#30340;&#65292;&#35813;&#27169;&#22411;&#25551;&#36848;&#20102;&#20132;&#36890;&#26102;&#38388;&#21160;&#24577;&#12290;
&lt;/p&gt;
&lt;p&gt;
Travel time derivatives are introduced as financial derivatives based on road travel times - a non-tradable underlying asset. In the transportation area, it is proposed as a more fundamental approach to value pricing because it conduct road pricing based on not only level but also volatility of travel time; in the financial market, it is propose as an innovative hedging instrument against market risk, especially after the recent stress of crypto market and traditional banking sector. The paper addresses (a) the motivation for introducing such derivatives (that is, the demand for hedging), (b) the potential market, and (c) the product design and pricing schemes. Pricing schemes are designed based on the travel time data captured by real time sensors, which are modeled as Ornstein - Uhlenbeck processes and more generally, continuous time auto regression moving average (CARMA) models. The calibration of such model is conducted via a hidden factor model, which described the dynamics of tra
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21435;&#20013;&#24515;&#21270;&#25215;&#35834;&#23545;&#27665;&#20027;&#20915;&#31574;&#30340;&#24433;&#21709;&#12290;&#22312;&#25237;&#31080;&#21069;&#65292;&#22996;&#21592;&#20250;&#25104;&#21592;&#21487;&#20197;&#36827;&#34892;&#21487;&#25191;&#34892;&#30340;&#25215;&#35834;&#12290;&#21487;&#33021;&#38656;&#35201;&#36328;&#36234;&#38453;&#33829;&#36827;&#34892;&#25215;&#35834;&#65292;&#20197;&#23454;&#29616;&#25913;&#38761;&#30340;&#23454;&#26045;&#65292;&#21516;&#26102;&#38656;&#35201;&#25490;&#38500;&#26368;&#19981;&#28909;&#34935;&#20110;&#25913;&#38761;&#30340;&#25903;&#25345;&#32773;&#34987;&#35825;&#23548;&#25512;&#32763;&#20915;&#23450;&#12290;</title><link>http://arxiv.org/abs/2304.08008</link><description>&lt;p&gt;
&#22522;&#20110;&#25237;&#31080;&#32467;&#26524;&#30340;&#21435;&#20013;&#24515;&#21270;&#25215;&#35834;&#23545;&#27665;&#20027;&#20915;&#31574;&#30340;&#24433;&#21709;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Democratic Policy Decisions with Decentralized Promises Contingent on Vote Outcome. (arXiv:2304.08008v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.08008
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21435;&#20013;&#24515;&#21270;&#25215;&#35834;&#23545;&#27665;&#20027;&#20915;&#31574;&#30340;&#24433;&#21709;&#12290;&#22312;&#25237;&#31080;&#21069;&#65292;&#22996;&#21592;&#20250;&#25104;&#21592;&#21487;&#20197;&#36827;&#34892;&#21487;&#25191;&#34892;&#30340;&#25215;&#35834;&#12290;&#21487;&#33021;&#38656;&#35201;&#36328;&#36234;&#38453;&#33829;&#36827;&#34892;&#25215;&#35834;&#65292;&#20197;&#23454;&#29616;&#25913;&#38761;&#30340;&#23454;&#26045;&#65292;&#21516;&#26102;&#38656;&#35201;&#25490;&#38500;&#26368;&#19981;&#28909;&#34935;&#20110;&#25913;&#38761;&#30340;&#25903;&#25345;&#32773;&#34987;&#35825;&#23548;&#25512;&#32763;&#20915;&#23450;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#21435;&#20013;&#24515;&#21270;&#30340;&#25928;&#29992;&#36716;&#31227;&#25215;&#35834;&#22914;&#20309;&#24433;&#21709;&#25237;&#31080;&#26041;&#24335;&#30340;&#38598;&#20307;&#20915;&#31574;&#12290;&#22312;&#25237;&#31080;&#21069;&#65292;&#25903;&#25345;&#21644;&#21453;&#23545;&#39640;&#25928;&#25913;&#38761;&#30340;&#22996;&#21592;&#20250;&#25104;&#21592;&#21487;&#20197;&#36827;&#34892;&#21487;&#25191;&#34892;&#30340;&#25215;&#35834;&#12290;&#19968;&#20010;&#22343;&#34913;&#38656;&#35201;&#31283;&#23450;&#24615;&#21644;&#26368;&#23567;&#21270;&#30340;&#25215;&#35834;&#12290;&#24179;&#34913;&#25215;&#35834;&#26159;&#23384;&#22312;&#19988;&#19981;&#30830;&#23450;&#30340;&#65292;&#20294;&#20855;&#26377;&#35768;&#22810;&#20849;&#21516;&#30340;&#29305;&#24449;&#12290;&#38656;&#35201;&#39640;&#24378;&#24230;&#25104;&#21592;&#21521;&#20302;&#24378;&#24230;&#25104;&#21592;&#25552;&#20379;&#36716;&#31227;&#25215;&#35834;&#65292;&#24182;&#23548;&#33268;&#25913;&#38761;&#30340;&#23454;&#26045;&#12290;&#24403;&#25913;&#38761;&#25903;&#25345;&#32773;&#32570;&#20047;&#36275;&#22815;&#30340;&#25237;&#31080;&#26435;&#26102;&#65292;&#25215;&#35834;&#24517;&#39035;&#36328;&#36234;&#38453;&#33829;&#12290;&#21363;&#20351;&#25913;&#38761;&#25903;&#25345;&#32773;&#30340;&#32852;&#30431;&#26159;&#20915;&#23450;&#24615;&#30340;&#65292;&#25215;&#35834;&#20063;&#24517;&#39035;&#25490;&#38500;&#26368;&#19981;&#28909;&#34935;&#20110;&#25913;&#38761;&#30340;&#25903;&#25345;&#32773;&#34987;&#35825;&#23548;&#25512;&#32763;&#20915;&#23450;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#24179;&#34913;&#30340;&#25215;&#35834;&#19981;&#38656;&#35201;&#36328;&#36234;&#38453;&#33829;&#12290;&#25105;&#20204;&#36824;&#35752;&#35770;&#20102;&#19968;&#31995;&#21015;&#26377;&#38480;&#30340;&#25215;&#35834;&#65292;&#23454;&#29616;&#36798;&#21040;&#19968;&#20010;&#24179;&#34913;&#30340;&#29366;&#24577;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study how decentralized utility transfer promises affect collective decision-making by voting. Committee members with varying levels of support and opposition for an efficient reform can make enforceable promises before voting. An equilibrium requires stability and minimal promises. Equilibrium promises exist and are indeterminate, but do share several key characteristics. Equilibria require transfer promises from high to low intensity members and result in enacting the reform. When reform supporters lack sufficient voting power, promises must reach across the aisle. Even if the coalition of reform supporters is decisive, promises must preclude the least enthusiastic supporters of the reform from being enticed to overturn the decision. In that case, equilibrium promises do not need to reach across the aisle. We also discuss a finite sequence of promises that achieve an equilibrium.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#20174;&#21453;&#23548;&#25968;&#31163;&#25955;&#35266;&#27979;&#20013;&#37325;&#26500;Faber-Schauder&#31995;&#25968;&#30340;&#26041;&#27861;&#65292;&#24182;&#21457;&#29616;&#20102;&#22312;&#20272;&#35745;&#36807;&#31243;&#20013;&#21482;&#26377;&#26368;&#32456;&#20135;&#29983;&#30340;&#31995;&#25968;&#20250;&#21463;&#21040;&#20301;&#32622;&#30340;&#24433;&#21709;&#21450;&#21021;&#22987;&#20540;&#30340;&#20381;&#36182;&#65292;&#24182;&#36890;&#36807;&#25918;&#24323;&#36825;&#20123;&#31995;&#25968;&#33719;&#21462;&#20102;&#39640;&#36136;&#37327;&#30340;&#20272;&#35745;&#20540;&#12290;</title><link>http://arxiv.org/abs/2211.11907</link><description>&lt;p&gt;
&#22522;&#20110;&#21453;&#23548;&#25968;&#31163;&#25955;&#35266;&#27979;&#30340;Faber-Schauder&#36924;&#36817;&#30340;&#40065;&#26834;&#24615;
&lt;/p&gt;
&lt;p&gt;
Robust Faber--Schauder approximation based on discrete observations of an antiderivative. (arXiv:2211.11907v3 [math.NA] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.11907
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#20174;&#21453;&#23548;&#25968;&#31163;&#25955;&#35266;&#27979;&#20013;&#37325;&#26500;Faber-Schauder&#31995;&#25968;&#30340;&#26041;&#27861;&#65292;&#24182;&#21457;&#29616;&#20102;&#22312;&#20272;&#35745;&#36807;&#31243;&#20013;&#21482;&#26377;&#26368;&#32456;&#20135;&#29983;&#30340;&#31995;&#25968;&#20250;&#21463;&#21040;&#20301;&#32622;&#30340;&#24433;&#21709;&#21450;&#21021;&#22987;&#20540;&#30340;&#20381;&#36182;&#65292;&#24182;&#36890;&#36807;&#25918;&#24323;&#36825;&#20123;&#31995;&#25968;&#33719;&#21462;&#20102;&#39640;&#36136;&#37327;&#30340;&#20272;&#35745;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20174;&#36830;&#32493;&#20989;&#25968;$f$ &#30340;&#21453;&#23548;&#25968;$F$ &#30340;&#31163;&#25955;&#35266;&#27979;&#20013;&#37325;&#26500;Faber-Schauder&#31995;&#25968;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#26159;&#36890;&#36807;&#20998;&#27573;&#20108;&#27425;&#26679;&#26465;&#25554;&#20540;&#26469;&#25551;&#36848;&#36825;&#20010;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#38381;&#21512;&#24418;&#24335;&#30340;&#35299;&#21644;&#28145;&#20837;&#30340;&#35823;&#24046;&#20998;&#26512;&#12290;&#36825;&#20123;&#32467;&#26524;&#23548;&#33268;&#20102;&#19968;&#20123;&#20196;&#20154;&#24778;&#35766;&#30340;&#35266;&#23519;&#65292;&#36825;&#20123;&#35266;&#23519;&#36824;&#22312;&#21476;&#20856;&#20108;&#27425;&#26679;&#26465;&#25554;&#20540;&#36825;&#19968;&#20027;&#39064;&#19978;&#25237;&#19979;&#20102;&#26032;&#30340;&#20809;&#65306;&#23427;&#20204;&#34920;&#26126;&#65292;&#36825;&#31181;&#26041;&#27861;&#30340;&#20247;&#25152;&#21608;&#30693;&#30340;&#19981;&#31283;&#23450;&#24615;&#21482;&#33021;&#22312;&#26368;&#32456;&#19968;&#20195;&#30340;&#20272;&#35745;Faber-Schauder&#31995;&#25968;&#20013;&#25214;&#21040;&#65292;&#36825;&#20123;&#31995;&#25968;&#36973;&#21463;&#38750;&#23616;&#37096;&#24615;&#21644;&#23545;&#21021;&#22987;&#20540;&#21644;&#32473;&#23450;&#25968;&#25454;&#30340;&#24378;&#20381;&#36182;&#24615;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#25152;&#26377;&#20854;&#20182;&#30340;Faber-Schauder&#31995;&#25968;&#21482;&#20381;&#36182;&#20110;&#25968;&#25454;&#30340;&#23616;&#37096;&#24615;&#65292;&#29420;&#31435;&#20110;&#21021;&#22987;&#20540;&#65292;&#19988;&#20855;&#26377;&#32479;&#19968;&#30340;&#35823;&#24046;&#30028;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#24471;&#20986;&#32467;&#35770;&#65292;&#21482;&#38656;&#25918;&#24323;&#26368;&#32456;&#29983;&#25104;&#30340;&#31995;&#25968;&#65292;&#25105;&#20204;&#23601;&#21487;&#20197;&#33719;&#24471;&#19968;&#20010;&#40065;&#26834;&#19988;&#33391;&#22909;&#30340;&#25105;&#20204;&#25152;&#30740;&#31350;&#38382;&#39064;&#30340;&#20272;&#35745;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the problem of reconstructing the Faber--Schauder coefficients of a continuous function $f$ from discrete observations of its antiderivative $F$. Our approach starts with formulating this problem through piecewise quadratic spline interpolation. We then provide a closed-form solution and an in-depth error analysis. These results lead to some surprising observations, which also throw new light on the classical topic of quadratic spline interpolation itself: They show that the well-known instabilities of this method can be located exclusively within the final generation of estimated Faber--Schauder coefficients, which suffer from non-locality and strong dependence on the initial value and the given data. By contrast, all other Faber--Schauder coefficients depend only locally on the data, are independent of the initial value, and admit uniform error bounds. We thus conclude that a robust and well-behaved estimator for our problem can be obtained by simply dropping the final-gener
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#22269;&#38469;&#21512;&#20316;&#22826;&#38451;&#36752;&#23556;&#31649;&#29702;&#30340;&#31283;&#23450;&#24615;&#65292;&#21457;&#29616;&#31283;&#23450;&#24615;&#19982;&#22826;&#38451;&#36752;&#23556;&#31649;&#29702;&#30340;&#39118;&#38505;&#31243;&#24230;&#30456;&#20851;&#65292;&#20294;&#19981;&#21463;&#22269;&#23478;&#20559;&#22909;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2210.09145</link><description>&lt;p&gt;
&#25506;&#32034;&#22826;&#38451;&#36752;&#23556;&#31649;&#29702;&#21327;&#35758;&#30340;&#31283;&#23450;&#24615;
&lt;/p&gt;
&lt;p&gt;
Exploring the stability of solar geoengineering agreements. (arXiv:2210.09145v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.09145
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#22269;&#38469;&#21512;&#20316;&#22826;&#38451;&#36752;&#23556;&#31649;&#29702;&#30340;&#31283;&#23450;&#24615;&#65292;&#21457;&#29616;&#31283;&#23450;&#24615;&#19982;&#22826;&#38451;&#36752;&#23556;&#31649;&#29702;&#30340;&#39118;&#38505;&#31243;&#24230;&#30456;&#20851;&#65292;&#20294;&#19981;&#21463;&#22269;&#23478;&#20559;&#22909;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24341;&#20837;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#22269;&#23478;&#38388;&#21512;&#20316;&#22826;&#38451;&#36752;&#23556;&#31649;&#29702;&#30340;&#34892;&#20026;&#12290;&#36890;&#36807;&#25968;&#20540;&#26041;&#27861;&#25506;&#32034;&#20102;&#35813;&#27169;&#22411;&#30340;&#32467;&#26524;&#12290;&#24635;&#20307;&#21457;&#29616;&#26159;&#65292;&#22826;&#38451;&#36752;&#23556;&#31649;&#29702;&#19978;&#30340;&#22269;&#23478;&#21512;&#20316;&#21644;&#21327;&#35843;&#21463;&#21040;&#28608;&#21169;&#12290;&#27492;&#22806;&#65292;&#22826;&#38451;&#36752;&#23556;&#31649;&#29702;&#21327;&#35758;&#30340;&#31283;&#23450;&#24615;&#20851;&#38190;&#21462;&#20915;&#20110;&#22826;&#38451;&#36752;&#23556;&#31649;&#29702;&#30340;&#39118;&#38505;&#31243;&#24230;&#12290;&#22914;&#26524;&#22826;&#38451;&#36752;&#23556;&#31649;&#29702;&#34987;&#35748;&#20026;&#26356;&#20026;&#26377;&#39118;&#38505;&#65292;&#26368;&#31283;&#23450;&#30340;&#22826;&#38451;&#36752;&#23556;&#31649;&#29702;&#21327;&#35758;&#30340;&#31283;&#23450;&#24615;&#23558;&#20250;&#38477;&#20302;&#12290;&#28982;&#32780;&#65292;&#21327;&#35758;&#30340;&#31283;&#23450;&#24615;&#19982;&#22269;&#23478;&#20559;&#22909;&#23436;&#20840;&#26080;&#20851;&#12290;
&lt;/p&gt;
&lt;p&gt;
A simple model is introduced to study the cooperative behavior of nations regarding solar geoengineering. The results of this model are explored through numerical methods. A general finding is that cooperation and coordination between nations on solar geoengineering is very much incentivized. Furthermore, the stability of solar geoengineering agreements between nations crucially depends on the perceived riskiness of solar geoengineering. If solar geoengineering is perceived as riskier, the stability of the most stable solar geoengineering agreements is reduced. However, the stability of agreements is completely independent of countries preferences.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#21457;&#29616;&#20102;Merton&#65288;1971&#65289;&#33258;&#34701;&#36164;&#26465;&#20214;&#30340;&#26102;&#38388;&#38169;&#35823;&#65292;&#22240;&#27492;&#21542;&#23450;&#20102;Black&#21644;Scholes&#65288;1973&#65289;&#30340;&#26399;&#26435;&#23450;&#20215;&#20844;&#24335;&#65292;Harrison&#21644;Pliska&#65288;1981&#65289;&#30340;&#36830;&#32493;&#20132;&#26131;&#27169;&#22411;&#20197;&#21450;Cox&#65292;Ross&#21644;Rubinstein&#65288;1979&#65289;&#30340;&#20108;&#39033;&#26399;&#26435;&#23450;&#20215;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2202.05671</link><description>&lt;p&gt;
Black-Scholes-Merton&#26399;&#26435;&#23450;&#20215;&#30340;&#20877;&#25506;&#65306;&#25105;&#20204;&#21457;&#29616;&#20102;&#33268;&#21629;&#32570;&#38519;&#21527;&#65311;
&lt;/p&gt;
&lt;p&gt;
Black-Scholes-Merton Option Pricing Revisited: Did we Find a Fatal Flaw?. (arXiv:2202.05671v2 [q-fin.PR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.05671
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21457;&#29616;&#20102;Merton&#65288;1971&#65289;&#33258;&#34701;&#36164;&#26465;&#20214;&#30340;&#26102;&#38388;&#38169;&#35823;&#65292;&#22240;&#27492;&#21542;&#23450;&#20102;Black&#21644;Scholes&#65288;1973&#65289;&#30340;&#26399;&#26435;&#23450;&#20215;&#20844;&#24335;&#65292;Harrison&#21644;Pliska&#65288;1981&#65289;&#30340;&#36830;&#32493;&#20132;&#26131;&#27169;&#22411;&#20197;&#21450;Cox&#65292;Ross&#21644;Rubinstein&#65288;1979&#65289;&#30340;&#20108;&#39033;&#26399;&#26435;&#23450;&#20215;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Black&#21644;Scholes&#65288;1973&#65289;&#30340;&#26399;&#26435;&#23450;&#20215;&#20844;&#24335;&#22522;&#20110;Merton&#65288;1971&#65289;&#30340;&#36830;&#32493;&#26102;&#38388;&#39044;&#31639;&#26041;&#31243;&#20013;&#30340;&#36830;&#32493;&#26102;&#38388;&#33258;&#34701;&#36164;&#26465;&#20214;&#65292;&#35813;&#26465;&#20214;&#26159;&#22806;&#37096;&#36164;&#37329;&#30340;&#26080;&#27969;&#20837;&#25110;&#27969;&#20986;&#30340;&#25237;&#36164;&#32452;&#21512;&#20877;&#24179;&#34913;&#30340;&#32463;&#27982;&#27010;&#24565;&#30340;&#27491;&#24335;&#34920;&#36848;&#65292;&#20294;&#20174;&#26410;&#22312;&#36830;&#32493;&#26102;&#38388;&#19979;&#27491;&#24335;&#25512;&#23548;&#36807;&#12290;&#28982;&#32780;&#65292;&#20316;&#20026;&#26356;&#22823;&#30340;&#38382;&#39064;&#65292;&#25105;&#20204;&#21457;&#29616;Merton&#65288;1971&#65289;&#27169;&#22411;&#20013;&#30340;&#19968;&#20010;&#26102;&#38388;&#38169;&#35823;&#65292;&#24182;&#19988;&#34920;&#26126;&#20182;&#30340;&#33258;&#34701;&#36164;&#26465;&#20214;&#22312;&#31163;&#25955;&#26102;&#38388;&#21644;&#36830;&#32493;&#26102;&#38388;&#19979;&#37117;&#23384;&#22312;&#35823;&#24046;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#21542;&#23450;&#20102;&#35813;&#39046;&#22495;&#30340;&#26480;&#20986;&#36129;&#29486;&#65292;&#21253;&#25324;Merton&#65288;1971&#65289;&#30340;&#39044;&#31639;&#26041;&#31243;&#12289;Black&#21644;Scholes&#65288;1973&#65289;&#30340;&#26399;&#26435;&#23450;&#20215;&#20844;&#24335;&#12289;Harrison&#21644;Pliska&#65288;1981&#65289;&#30340;&#36830;&#32493;&#20132;&#26131;&#27169;&#22411;&#20197;&#21450;Cox&#65292;Ross&#21644;Rubinstein&#65288;1979&#65289;&#30340;&#20108;&#39033;&#26399;&#26435;&#23450;&#20215;&#27169;&#22411;&#12290;&#25105;&#20204;&#36824;&#34920;&#26126;&#65292;Black&#21644;Scholes&#65288;1973&#65289;&#20197;&#21450;Harrison&#21644;Pliska&#65288;1981&#65289;&#38544;&#21547;&#22320;&#20551;&#23450;&#20102;&#20182;&#20204;&#30340;&#22797;&#21046;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
The option pricing formula of Black and Scholes (1973) hinges on the continuous-time self-financing condition, which is a special case of the continuous-time budget equation of Merton (1971). The self-financing condition is believed to formalize the economic concept of portfolio rebalancing without inflows or outflows of external funds, but was never formally derived in continuous time. As a much bigger issue, however, we discover a timing mistake in the model of Merton (1971) and show that his self-financing condition is misspecified both in discrete and continuous time. Our results invalidate seminal contributions to the literature, including the budget equation of Merton (1971), the option pricing formula of Black and Scholes (1973), the continuous trading model of Harrison and Pliska (1981), and the binomial option pricing model of Cox, Ross and Rubinstein (1979). We also show that Black and Scholes (1973) and Harrison and Pliska (1981) implicitly assumed their replication result.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;Epstein-Zin&#25928;&#29992;&#30340;&#25237;&#36164;&#32773;&#22312;&#19981;&#23436;&#25972;&#24066;&#22330;&#19978;&#30340;&#28040;&#36153;&#25237;&#36164;&#38382;&#39064;&#12290;&#36890;&#36807;&#20108;&#27425;&#21453;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65288;BSDE&#65289;&#65292;&#34920;&#24449;&#20102;&#26368;&#20248;&#30340;&#28040;&#36153;&#21644;&#25237;&#36164;&#31574;&#30053;&#65307;&#39564;&#35777;&#23450;&#29702;&#24471;&#21040;&#21360;&#35777;&#12290;</title><link>http://arxiv.org/abs/2111.09032</link><description>&lt;p&gt;
&#24102;&#26377;&#19968;&#33324;&#32422;&#26463;&#26465;&#20214;&#30340;Epstein-Zin&#25928;&#29992;&#19979;&#30340;&#26368;&#20248;&#28040;&#36153;&#21644;&#25237;&#36164;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;
Optimal consumption and portfolio selection with Epstein-Zin utility under general constraints. (arXiv:2111.09032v3 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2111.09032
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;Epstein-Zin&#25928;&#29992;&#30340;&#25237;&#36164;&#32773;&#22312;&#19981;&#23436;&#25972;&#24066;&#22330;&#19978;&#30340;&#28040;&#36153;&#25237;&#36164;&#38382;&#39064;&#12290;&#36890;&#36807;&#20108;&#27425;&#21453;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65288;BSDE&#65289;&#65292;&#34920;&#24449;&#20102;&#26368;&#20248;&#30340;&#28040;&#36153;&#21644;&#25237;&#36164;&#31574;&#30053;&#65307;&#39564;&#35777;&#23450;&#29702;&#24471;&#21040;&#21360;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#19981;&#23436;&#25972;&#24066;&#22330;&#20013;&#20351;&#29992;Epstein-Zin&#25928;&#29992;&#30340;&#25237;&#36164;&#32773;&#30340;&#28040;&#36153;&#25237;&#36164;&#38382;&#39064;&#12290;&#31574;&#30053;&#19978;&#24378;&#21152;&#20102;&#23553;&#38381;&#20294;&#19981;&#19968;&#23450;&#26159;&#20984;&#30340;&#32422;&#26463;&#26465;&#20214;&#12290;&#26368;&#20248;&#28040;&#36153;&#21644;&#25237;&#36164;&#31574;&#30053;&#36890;&#36807;&#20108;&#27425;&#21453;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65288;BSDE&#65289;&#36827;&#34892;&#20102;&#34920;&#24449;&#12290;&#30001;&#20110;&#38543;&#26426;&#24066;&#22330;&#29615;&#22659;&#65292;&#27492;BSDE&#30340;&#35299;&#26080;&#30028;&#65292;&#22240;&#27492;BMO&#35770;&#28857;&#23849;&#28291;&#12290;&#36890;&#36807;&#31934;&#24515;&#36873;&#25321;Lyapunov&#20989;&#25968;&#24314;&#31435;&#20102;&#38789;&#26368;&#20248;&#24615;&#20934;&#21017;&#65292;&#26368;&#32456;&#33719;&#24471;&#20102;&#39564;&#35777;&#23450;&#29702;&#12290;&#27492;&#22806;&#65292;&#36824;&#25552;&#20379;&#20102;&#22810;&#20010;&#31034;&#20363;&#21644;&#20248;&#21270;&#31574;&#30053;&#30340;&#25968;&#23383;&#27169;&#25311;&#24182;&#36827;&#34892;&#20102;&#35828;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
The paper investigates the consumption-investment problem for an investor with Epstein-Zin utility in an incomplete market. Closed, not necessarily convex, constraints are imposed on strategies. The optimal consumption and investment strategies are characterized via a quadratic backward stochastic differential equation (BSDE). Due to the stochastic market environment, the solution to this BSDE is unbounded and thereby the BMO argument breaks down. After establishing the martingale optimality criterion, by delicately selecting Lyapunov functions, the verification theorem is ultimately obtained. Besides, several examples and numerical simulations for the optimal strategies are provided and illustrated.
&lt;/p&gt;</description></item></channel></rss>