<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#32467;&#21512;&#38543;&#26426;&#31574;&#30053;&#21644;&#24378;&#21270;&#23398;&#20064;&#25216;&#26415;&#30340;&#26041;&#27861;&#26469;&#36827;&#34892;&#26399;&#26435;&#24066;&#22330;&#20570;&#24066;&#12290;&#24403;&#24066;&#22330;&#35746;&#21333;&#30340;&#21040;&#36798;&#19982;&#20215;&#24046;&#21576;&#32447;&#24615;&#21453;&#27604;&#26102;&#65292;&#26368;&#20248;&#31574;&#30053;&#20026;&#27491;&#24577;&#20998;&#24067;&#12290;</title><link>http://arxiv.org/abs/2307.01814</link><description>&lt;p&gt;
&#36890;&#36807;&#24378;&#21270;&#23398;&#20064;&#36827;&#34892;&#26399;&#26435;&#24066;&#22330;&#20570;&#24066;
&lt;/p&gt;
&lt;p&gt;
Market Making of Options via Reinforcement Learning. (arXiv:2307.01814v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01814
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#32467;&#21512;&#38543;&#26426;&#31574;&#30053;&#21644;&#24378;&#21270;&#23398;&#20064;&#25216;&#26415;&#30340;&#26041;&#27861;&#26469;&#36827;&#34892;&#26399;&#26435;&#24066;&#22330;&#20570;&#24066;&#12290;&#24403;&#24066;&#22330;&#35746;&#21333;&#30340;&#21040;&#36798;&#19982;&#20215;&#24046;&#21576;&#32447;&#24615;&#21453;&#27604;&#26102;&#65292;&#26368;&#20248;&#31574;&#30053;&#20026;&#27491;&#24577;&#20998;&#24067;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30001;&#20110;&#20854;&#39640;&#32500;&#24230;&#29305;&#24615;&#65292;&#26399;&#26435;&#24066;&#22330;&#20570;&#24066;&#23545;&#20110;&#19981;&#21516;&#21040;&#26399;&#26085;&#21644;&#34892;&#26435;&#20215;&#26684;&#30340;&#26399;&#26435;&#26469;&#35828;&#26159;&#19968;&#20010;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#38382;&#39064;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#23558;&#38543;&#26426;&#31574;&#30053;&#21644;&#21463;&#24378;&#21270;&#23398;&#20064;&#21551;&#21457;&#30340;&#25216;&#26415;&#30456;&#32467;&#21512;&#65292;&#30830;&#23450;&#26399;&#26435;&#24066;&#22330;&#20570;&#24066;&#21830;&#20026;&#20132;&#26131;&#19981;&#21516;&#21040;&#26399;&#26085;&#21644;&#34892;&#26435;&#20215;&#26684;&#30340;&#26399;&#26435;&#26102;&#25152;&#21457;&#24067;&#30340;&#20080;&#21334;&#20215;&#24046;&#30340;&#26368;&#20248;&#31574;&#30053;&#12290;&#24403;&#24066;&#22330;&#35746;&#21333;&#30340;&#21040;&#36798;&#19982;&#20215;&#24046;&#21576;&#32447;&#24615;&#21453;&#27604;&#26102;&#65292;&#26368;&#20248;&#31574;&#30053;&#20026;&#27491;&#24577;&#20998;&#24067;&#12290;
&lt;/p&gt;
&lt;p&gt;
Market making of options with different maturities and strikes is a challenging problem due to its high dimensional nature. In this paper, we propose a novel approach that combines a stochastic policy and reinforcement learning-inspired techniques to determine the optimal policy for posting bid-ask spreads for an options market maker who trades options with different maturities and strikes. When the arrival of market orders is linearly inverse to the spreads, the optimal policy is normally distributed.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#26410;&#30693;&#22343;&#20540;&#19979;&#30340;&#22823;&#32500;&#21327;&#26041;&#24046;&#30697;&#38453;&#20272;&#35745;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#22120;&#65292;&#35777;&#26126;&#20102;&#20854;&#20108;&#27425;&#25910;&#25947;&#24615;&#65292;&#22312;&#23454;&#39564;&#20013;&#34920;&#29616;&#20248;&#20110;&#20854;&#20182;&#26631;&#20934;&#20272;&#35745;&#22120;&#12290;</title><link>http://arxiv.org/abs/2304.07045</link><description>&lt;p&gt;
Ledoit-Wolf&#32447;&#24615;&#25910;&#32553;&#26041;&#27861;&#22312;&#26410;&#30693;&#22343;&#20540;&#30340;&#24773;&#20917;&#19979;&#30340;&#24212;&#29992;(arXiv:2304.07045v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
Ledoit-Wolf linear shrinkage with unknown mean. (arXiv:2304.07045v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.07045
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#26410;&#30693;&#22343;&#20540;&#19979;&#30340;&#22823;&#32500;&#21327;&#26041;&#24046;&#30697;&#38453;&#20272;&#35745;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#22120;&#65292;&#35777;&#26126;&#20102;&#20854;&#20108;&#27425;&#25910;&#25947;&#24615;&#65292;&#22312;&#23454;&#39564;&#20013;&#34920;&#29616;&#20248;&#20110;&#20854;&#20182;&#26631;&#20934;&#20272;&#35745;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#26410;&#30693;&#22343;&#20540;&#19979;&#30340;&#22823;&#32500;&#21327;&#26041;&#24046;&#30697;&#38453;&#20272;&#35745;&#38382;&#39064;&#12290;&#24403;&#32500;&#25968;&#21644;&#26679;&#26412;&#25968;&#25104;&#27604;&#20363;&#24182;&#36235;&#21521;&#20110;&#26080;&#31351;&#22823;&#26102;&#65292;&#32463;&#39564;&#21327;&#26041;&#24046;&#20272;&#35745;&#22120;&#22833;&#25928;&#65292;&#27492;&#26102;&#31216;&#20026;Kolmogorov&#28176;&#36827;&#24615;&#12290;&#24403;&#22343;&#20540;&#24050;&#30693;&#26102;&#65292;Ledoit&#21644;Wolf&#65288;2004&#65289;&#25552;&#20986;&#20102;&#19968;&#20010;&#32447;&#24615;&#25910;&#32553;&#20272;&#35745;&#22120;&#65292;&#24182;&#35777;&#26126;&#20102;&#22312;&#36825;&#20123;&#28436;&#36827;&#19979;&#30340;&#25910;&#25947;&#24615;&#12290;&#25454;&#25105;&#20204;&#25152;&#30693;&#65292;&#24403;&#22343;&#20540;&#26410;&#30693;&#26102;&#65292;&#23578;&#26410;&#25552;&#20986;&#27491;&#24335;&#35777;&#26126;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#20272;&#35745;&#22120;&#65292;&#24182;&#22312;Ledoit&#21644;Wolf&#30340;&#20551;&#35774;&#19979;&#35777;&#26126;&#20102;&#23427;&#30340;&#20108;&#27425;&#25910;&#25947;&#24615;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#23427;&#32988;&#36807;&#20102;&#20854;&#20182;&#26631;&#20934;&#20272;&#35745;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;
This work addresses large dimensional covariance matrix estimation with unknown mean. The empirical covariance estimator fails when dimension and number of samples are proportional and tend to infinity, settings known as Kolmogorov asymptotics. When the mean is known, Ledoit and Wolf (2004) proposed a linear shrinkage estimator and proved its convergence under those asymptotics. To the best of our knowledge, no formal proof has been proposed when the mean is unknown. To address this issue, we propose a new estimator and prove its quadratic convergence under the Ledoit and Wolf assumptions. Finally, we show empirically that it outperforms other standard estimators.
&lt;/p&gt;</description></item></channel></rss>