<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#36890;&#36807;&#35777;&#26126;&#19968;&#20010;&#36275;&#22815;&#23485;&#32780;&#20219;&#24847;&#28145;&#30340;&#31070;&#32463;&#32593;&#32476;&#35757;&#32451;&#20986;&#26469;&#30340;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#27169;&#22411;&#19982;&#22823;&#22411;&#22240;&#23376;&#27169;&#22411;&#31561;&#25928;&#65292;&#25171;&#24320;&#20102;&#28145;&#24230;&#23398;&#20064;&#22312;&#27492;&#39046;&#22495;&#20013;&#30340;&#40657;&#30418;&#23376;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#31181;&#23553;&#38381;&#24418;&#24335;&#30340;&#25512;&#23548;&#26041;&#27861;&#12290;&#30740;&#31350;&#23454;&#35777;&#20102;&#19981;&#21516;&#26550;&#26500;&#36873;&#25321;&#23545;&#27169;&#22411;&#24615;&#33021;&#30340;&#24433;&#21709;&#65292;&#24182;&#35777;&#26126;&#20102;&#38543;&#30528;&#28145;&#24230;&#22686;&#21152;&#65292;&#27169;&#22411;&#22312;&#36275;&#22815;&#22810;&#25968;&#25454;&#19979;&#30340;&#34920;&#29616;&#36880;&#28176;&#25552;&#21319;&#65292;&#30452;&#33267;&#36798;&#21040;&#39281;&#21644;&#12290;</title><link>https://arxiv.org/abs/2402.06635</link><description>&lt;p&gt;
&#22823;&#22411;&#65288;&#21644;&#28145;&#24230;&#65289;&#22240;&#23376;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Large (and Deep) Factor Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.06635
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#35777;&#26126;&#19968;&#20010;&#36275;&#22815;&#23485;&#32780;&#20219;&#24847;&#28145;&#30340;&#31070;&#32463;&#32593;&#32476;&#35757;&#32451;&#20986;&#26469;&#30340;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#27169;&#22411;&#19982;&#22823;&#22411;&#22240;&#23376;&#27169;&#22411;&#31561;&#25928;&#65292;&#25171;&#24320;&#20102;&#28145;&#24230;&#23398;&#20064;&#22312;&#27492;&#39046;&#22495;&#20013;&#30340;&#40657;&#30418;&#23376;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#31181;&#23553;&#38381;&#24418;&#24335;&#30340;&#25512;&#23548;&#26041;&#27861;&#12290;&#30740;&#31350;&#23454;&#35777;&#20102;&#19981;&#21516;&#26550;&#26500;&#36873;&#25321;&#23545;&#27169;&#22411;&#24615;&#33021;&#30340;&#24433;&#21709;&#65292;&#24182;&#35777;&#26126;&#20102;&#38543;&#30528;&#28145;&#24230;&#22686;&#21152;&#65292;&#27169;&#22411;&#22312;&#36275;&#22815;&#22810;&#25968;&#25454;&#19979;&#30340;&#34920;&#29616;&#36880;&#28176;&#25552;&#21319;&#65292;&#30452;&#33267;&#36798;&#21040;&#39281;&#21644;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25171;&#24320;&#20102;&#28145;&#24230;&#23398;&#20064;&#22312;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#20013;&#30340;&#40657;&#30418;&#23376;&#65292;&#24182;&#35777;&#26126;&#20102;&#19968;&#20010;&#36275;&#22815;&#23485;&#32780;&#20219;&#24847;&#28145;&#30340;&#31070;&#32463;&#32593;&#32476;(DNN)&#34987;&#35757;&#32451;&#29992;&#26469;&#26368;&#22823;&#21270;&#38543;&#26426;&#36148;&#29616;&#22240;&#23376;(SDF)&#30340;&#22799;&#26222;&#27604;&#29575;&#31561;&#25928;&#20110;&#19968;&#20010;&#22823;&#22411;&#22240;&#23376;&#27169;&#22411;(LFM)&#65306;&#19968;&#20010;&#20351;&#29992;&#35768;&#22810;&#38750;&#32447;&#24615;&#29305;&#24449;&#30340;&#32447;&#24615;&#22240;&#23376;&#23450;&#20215;&#27169;&#22411;&#12290;&#36825;&#20123;&#29305;&#24449;&#30340;&#24615;&#36136;&#21462;&#20915;&#20110;DNN&#30340;&#20307;&#31995;&#32467;&#26500;&#65292;&#22312;&#19968;&#31181;&#26126;&#30830;&#21487;&#36861;&#36394;&#30340;&#26041;&#24335;&#19979;&#12290;&#36825;&#20351;&#24471;&#39318;&#27425;&#21487;&#20197;&#25512;&#23548;&#20986;&#23553;&#38381;&#24418;&#24335;&#30340;&#31471;&#21040;&#31471;&#35757;&#32451;&#30340;&#22522;&#20110;DNN&#30340;SDF&#12290;&#25105;&#20204;&#36890;&#36807;&#23454;&#35777;&#35780;&#20272;&#20102;LFMs&#65292;&#24182;&#23637;&#31034;&#20102;&#21508;&#31181;&#26550;&#26500;&#36873;&#25321;&#22914;&#20309;&#24433;&#21709;SDF&#30340;&#24615;&#33021;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#28145;&#24230;&#22797;&#26434;&#24615;&#30340;&#20248;&#28857;&#65306;&#38543;&#30528;&#36275;&#22815;&#22810;&#30340;&#25968;&#25454;&#65292;DNN-SDF&#30340;&#22806;&#26679;&#24635;&#20307;&#34920;&#29616;&#20250;&#38543;&#30528;&#31070;&#32463;&#32593;&#32476;&#30340;&#28145;&#24230;&#32780;&#22686;&#21152;&#65292;&#24403;&#38544;&#34255;&#23618;&#36798;&#21040;&#32422;100&#23618;&#26102;&#36798;&#21040;&#39281;&#21644;&#12290;
&lt;/p&gt;
&lt;p&gt;
We open up the black box behind Deep Learning for portfolio optimization and prove that a sufficiently wide and arbitrarily deep neural network (DNN) trained to maximize the Sharpe ratio of the Stochastic Discount Factor (SDF) is equivalent to a large factor model (LFM): A linear factor pricing model that uses many non-linear characteristics. The nature of these characteristics depends on the architecture of the DNN in an explicit, tractable fashion. This makes it possible to derive end-to-end trained DNN-based SDFs in closed form for the first time. We evaluate LFMs empirically and show how various architectural choices impact SDF performance. We document the virtue of depth complexity: With enough data, the out-of-sample performance of DNN-SDF is increasing in the NN depth, saturating at huge depths of around 100 hidden layers.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#32929;&#31080;&#22238;&#25253;&#27010;&#29575;&#65292;&#21457;&#29616;&#24066;&#22330;&#25317;&#26377;&#32929;&#31080;&#22238;&#25253;&#30340;&#25152;&#26377;&#20449;&#24687;&#65292;&#24182;&#25506;&#35752;&#20102;&#22238;&#25253;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#19982;&#24403;&#21069;&#21644;&#36807;&#21435;&#20132;&#26131;&#20540;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2302.07935</link><description>&lt;p&gt;
&#22522;&#20110;&#24066;&#22330;&#30340;&#32929;&#31080;&#22238;&#25253;&#27010;&#29575;
&lt;/p&gt;
&lt;p&gt;
Market-Based Probability of Stock Returns
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2302.07935
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#32929;&#31080;&#22238;&#25253;&#27010;&#29575;&#65292;&#21457;&#29616;&#24066;&#22330;&#25317;&#26377;&#32929;&#31080;&#22238;&#25253;&#30340;&#25152;&#26377;&#20449;&#24687;&#65292;&#24182;&#25506;&#35752;&#20102;&#22238;&#25253;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#19982;&#24403;&#21069;&#21644;&#36807;&#21435;&#20132;&#26131;&#20540;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24066;&#22330;&#25317;&#26377;&#20851;&#20110;&#32929;&#31080;&#22238;&#25253;&#30340;&#25152;&#26377;&#21487;&#29992;&#20449;&#24687;&#12290;&#24066;&#22330;&#20132;&#26131;&#30340;&#38543;&#26426;&#24615;&#20915;&#23450;&#20102;&#32929;&#31080;&#22238;&#25253;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#12290;&#26412;&#25991;&#25551;&#36848;&#20102;&#32929;&#31080;&#22238;&#25253;&#30340;&#21069;&#22235;&#20010;&#22522;&#20110;&#24066;&#22330;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#19982;&#24403;&#21069;&#21644;&#36807;&#21435;&#20132;&#26131;&#20540;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#12290;&#22312;&#21152;&#26435;&#24179;&#22343;&#26399;&#38388;&#36827;&#34892;&#20132;&#26131;&#30340;&#24179;&#22343;&#22238;&#25253;&#19982;&#39532;&#31185;&#23041;&#33576;&#23545;&#25237;&#36164;&#32452;&#21512;&#20215;&#20540;&#21152;&#26435;&#22238;&#25253;&#30340;&#23450;&#20041;&#30456;&#21563;&#21512;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#22238;&#25253;&#27874;&#21160;&#29575;&#21644;&#22238;&#25253;-&#20215;&#20540;&#30456;&#20851;&#24615;&#12290;&#36890;&#36807;&#26377;&#38480;&#25968;&#37327;&#30340;&#22522;&#20110;&#24066;&#22330;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#30340;&#29305;&#24449;&#20989;&#25968;&#21644;&#27010;&#29575;&#24230;&#37327;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#23545;&#32929;&#31080;&#22238;&#25253;&#30340;&#36817;&#20284;&#39044;&#27979;&#26041;&#27861;&#12290;&#35201;&#39044;&#27979;&#22522;&#20110;&#24066;&#22330;&#30340;&#24179;&#22343;&#22238;&#25253;&#25110;&#22238;&#25253;&#27874;&#21160;&#29575;&#65292;&#24517;&#39035;&#21516;&#26102;&#39044;&#27979;&#24403;&#21069;&#21644;&#36807;&#21435;&#24066;&#22330;&#20132;&#26131;&#20540;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#65292;&#20197;&#30456;&#21516;&#30340;&#26102;&#38388;&#36328;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
Markets possess all available information on stock returns. The randomness of market trade determines the statistics of stock returns. This paper describes the dependence of the first four market-based statistical moments of stock returns on statistical moments and correlations of current and past trade values. The mean return of trades during the averaging period coincides with Markowitz's definition of portfolio value weighted return. We derive the market-based volatility of return and return-value correlations. We present approximations of the characteristic functions and probability measures of stock return by a finite number of market-based statistical moments. To forecast market-based average return or volatility of return, one should predict the statistical moments and correlations of current and past market trade values at the same time horizon.
&lt;/p&gt;</description></item></channel></rss>