<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#39044;&#27979;&#26356;&#26032;&#22914;&#20309;&#24433;&#21709;MRP&#35745;&#21010;&#21442;&#25968;&#65292;&#24182;&#25552;&#20986;&#20102;&#25193;&#23637;MRP&#30340;&#26041;&#27861;&#20197;&#20943;&#36731;&#20449;&#24687;&#26356;&#26032;&#23545;&#29983;&#20135;&#35746;&#21333;&#30340;&#24178;&#25200;&#12290;</title><link>https://arxiv.org/abs/2403.11010</link><description>&lt;p&gt;
&#23450;&#26399;&#39044;&#27979;&#26356;&#26032;&#22914;&#20309;&#24433;&#21709;MRP&#35745;&#21010;&#21442;&#25968;&#65306;&#19968;&#39033;&#27169;&#25311;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
How Periodic Forecast Updates Influence MRP Planning Parameters: A Simulation Study
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11010
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#39044;&#27979;&#26356;&#26032;&#22914;&#20309;&#24433;&#21709;MRP&#35745;&#21010;&#21442;&#25968;&#65292;&#24182;&#25552;&#20986;&#20102;&#25193;&#23637;MRP&#30340;&#26041;&#27861;&#20197;&#20943;&#36731;&#20449;&#24687;&#26356;&#26032;&#23545;&#29983;&#20135;&#35746;&#21333;&#30340;&#24178;&#25200;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35768;&#22810;&#20379;&#24212;&#38142;&#20013;&#65292;&#24403;&#21069;&#30340;&#25968;&#23383;&#21270;&#21162;&#21147;&#24050;&#32463;&#23548;&#33268;&#21046;&#36896;&#21830;&#21644;&#23458;&#25143;&#20043;&#38388;&#30340;&#20449;&#24687;&#20132;&#27969;&#24471;&#21040;&#25913;&#21892;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#38656;&#27714;&#39044;&#27979;&#36890;&#24120;&#30001;&#23458;&#25143;&#25552;&#20379;&#65292;&#24182;&#38543;&#30528;&#30456;&#20851;&#23458;&#25143;&#20449;&#24687;&#30340;&#25913;&#21892;&#32780;&#23450;&#26399;&#26356;&#26032;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#39044;&#27979;&#26356;&#26032;&#23545;&#29289;&#26009;&#38656;&#27714;&#35745;&#21010;&#65288;MRP&#65289;&#29983;&#20135;&#35268;&#21010;&#26041;&#27861;&#30340;&#24433;&#21709;&#12290;&#36827;&#34892;&#20102;&#27169;&#25311;&#30740;&#31350;&#65292;&#20197;&#35780;&#20272;&#20449;&#24687;&#26356;&#26032;&#22914;&#20309;&#24433;&#21709;&#28378;&#21160;&#35270;&#37326;MRP&#35745;&#21010;&#29983;&#20135;&#31995;&#32479;&#20013;&#35774;&#32622;&#35268;&#21010;&#21442;&#25968;&#12290;&#30452;&#35266;&#30340;&#32467;&#26524;&#26159;&#20449;&#24687;&#26356;&#26032;&#23548;&#33268;MRP&#26631;&#20934;&#29983;&#20135;&#35746;&#21333;&#20986;&#29616;&#24178;&#25200;&#65292;&#22240;&#27492;&#24320;&#21457;&#20102;&#19968;&#20010;&#25193;&#23637;MRP&#20197;&#20943;&#36731;&#36825;&#20123;&#24433;&#21709;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#22823;&#35268;&#27169;&#30340;&#25968;&#20540;&#27169;&#25311;&#23454;&#39564;&#34920;&#26126;&#65292;&#24320;&#21457;&#30340;MRP&#23433;&#20840;&#24211;&#23384;&#21033;&#29992;&#21551;&#21457;&#24335;&#26041;&#27861;&#26174;&#33879;&#25913;&#21892;&#20102;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11010v1 Announce Type: new  Abstract: In many supply chains, the current efforts at digitalization have led to improved information exchanges between manufacturers and their customers. Specifically, demand forecasts are often provided by the customers and regularly updated as the related customer information improves. In this paper, we investigate the influence of forecast updates on the production planning method of Material Requirements Planning (MRP). A simulation study was carried out to assess how updates in information affect the setting of planning parameters in a rolling horizon MRP planned production system. An intuitive result is that information updates lead to disturbances in the production orders for the MRP standard, and, therefore, an extension for MRP to mitigate these effects is developed. A large numerical simulation experiment shows that the MRP safety stock exploitation heuristic, that has been developed, leads to significantly improved results as far as 
&lt;/p&gt;</description></item><item><title>&#20551;&#35774;&#24066;&#22330;&#21147;&#37327;&#30830;&#23450;&#27599;&#26085;&#27874;&#21160;&#24615;&#65292;&#25903;&#25345;&#26631;&#26222;500&#25351;&#25968;&#27874;&#21160;&#24615;&#22686;&#21152;&#65307;&#32463;&#20856;&#24066;&#22330;&#32452;&#21512;&#26080;&#21487;&#36229;&#36234;&#30340;&#35770;&#28857;&#20915;&#23450;&#30528;&#26631;&#26222;500&#26085;&#25910;&#30410;&#30340;&#27874;&#21160;&#24615;&#65292;&#26085;&#25910;&#30410;&#27874;&#21160;&#24615;&#26377;&#26395;&#38271;&#26399;&#25345;&#32493;&#22686;&#21152;&#12290;</title><link>https://arxiv.org/abs/2403.01088</link><description>&lt;p&gt;
&#35777;&#26126;&#26631;&#26222;500&#26085;&#25910;&#30410;&#27874;&#21160;&#24615;&#30340;&#21512;&#29702;&#24615;
&lt;/p&gt;
&lt;p&gt;
Justifying the Volatility of S&amp;P 500 Daily Returns
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.01088
&lt;/p&gt;
&lt;p&gt;
&#20551;&#35774;&#24066;&#22330;&#21147;&#37327;&#30830;&#23450;&#27599;&#26085;&#27874;&#21160;&#24615;&#65292;&#25903;&#25345;&#26631;&#26222;500&#25351;&#25968;&#27874;&#21160;&#24615;&#22686;&#21152;&#65307;&#32463;&#20856;&#24066;&#22330;&#32452;&#21512;&#26080;&#21487;&#36229;&#36234;&#30340;&#35770;&#28857;&#20915;&#23450;&#30528;&#26631;&#26222;500&#26085;&#25910;&#30410;&#30340;&#27874;&#21160;&#24615;&#65292;&#26085;&#25910;&#30410;&#27874;&#21160;&#24615;&#26377;&#26395;&#38271;&#26399;&#25345;&#32493;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36807;&#21435;&#30340;60&#24180;&#37324;&#65292;&#26631;&#26222;500&#25351;&#25968;&#30340;&#26085;&#25910;&#30410;&#27874;&#21160;&#24615;&#36880;&#28176;&#22686;&#21152;&#12290;&#20174;&#20551;&#35774;&#19978;&#26469;&#30475;&#65292;&#24066;&#22330;&#21147;&#37327;&#20915;&#23450;&#20102;&#27599;&#26085;&#27874;&#21160;&#24615;&#65292;&#22240;&#27492;&#19968;&#21482;&#27599;&#26085;&#21152;&#26464;&#26438;&#30340;&#26631;&#26222;500&#22522;&#37329;&#26080;&#27861;&#22312;&#38271;&#26399;&#20869;&#32988;&#36807;&#26631;&#20934;&#30340;&#26631;&#26222;500&#22522;&#37329;&#12290;&#22240;&#27492;&#65292;&#36825;&#31181;&#20551;&#35774;&#24615;&#30340;&#27874;&#21160;&#24615;&#25903;&#25345;&#20102;&#26631;&#26222;500&#25351;&#25968;&#27874;&#21160;&#24615;&#30340;&#22686;&#21152;&#12290;&#22522;&#20110;&#36825;&#19968;&#28857;&#65292;&#21487;&#20197;&#30475;&#20986;&#65292;&#22312;&#38271;&#26399;&#20869;&#24066;&#22330;&#32452;&#21512;&#26080;&#21487;&#36229;&#36234;&#30340;&#32463;&#20856;&#35770;&#28857;&#27491;&#22312;&#20915;&#23450;&#30528;&#26631;&#26222;500&#26085;&#25910;&#30410;&#30340;&#27874;&#21160;&#24615;&#12290;&#27492;&#22806;&#65292;&#36825;&#20063;&#24847;&#21619;&#30528;&#26631;&#26222;500&#25351;&#25968;&#26085;&#25910;&#30410;&#30340;&#38271;&#26399;&#27874;&#21160;&#24615;&#24212;&#35813;&#32487;&#32493;&#22686;&#21152;&#65292;&#30452;&#33267;&#36229;&#36807;&#19968;&#20010;&#29305;&#23450;&#30340;&#38408;&#20540;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#22914;&#26524;&#20851;&#20110;&#24066;&#22330;&#21147;&#37327;&#22686;&#21152;&#27874;&#21160;&#24615;&#30340;&#20551;&#35774;&#26159;&#26080;&#25928;&#30340;&#65292;&#37027;&#20040;&#27599;&#26085;&#21152;&#26464;&#26438;&#30340;&#26631;&#26222;500&#22522;&#37329;&#26377;&#26426;&#20250;&#22312;&#38271;&#26399;&#20869;&#32988;&#36807;&#19981;&#21152;&#26464;&#26438;&#30340;&#22522;&#37329;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.01088v1 Announce Type: new  Abstract: Over the past 60 years, there has been a gradual increase in the volatility of daily returns for the S&amp;P 500 Index. Hypothetically, suppose that market forces determine daily volatility such that a daily leveraged S&amp;P 500 fund cannot outperform a standard S&amp;P 500 fund in the long run. Then this hypothetical volatility happens to support the increase in volatility seen in the S&amp;P 500 index. On this basis, it appears that the classic argument of the market portfolio being unbeatable in the long run is determining the volatility of S&amp;P 500 daily returns. Moreover, it follows that the long-term volatility of the daily returns for the S&amp;P 500 Index should continue to increase until passing a particular threshold. If, on the other hand, this hypothesis about market forces increasing volatility is invalid, then there is room for daily leveraged S&amp;P 500 funds to outperform their unleveraged counterparts in the long run.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#23454;&#39564;&#21457;&#29616;&#65292;&#23545;&#20110;&#39038;&#23458;&#32780;&#35328;&#65292;&#24403;&#20010;&#20154;&#25968;&#25454;&#25152;&#22788;&#29615;&#22659;&#21644;&#26576;&#20010;&#20135;&#21697;&#26356;&#30456;&#20284;&#26102;&#65292;&#20182;&#20204;&#26356;&#23481;&#26131;&#36890;&#36807;&#25805;&#32437;&#33258;&#24049;&#30340;&#20010;&#20154;&#29305;&#24449;&#26469;&#33719;&#24471;&#26356;&#20248;&#24800;&#30340;&#20215;&#26684;&#65292;&#24182;&#19988;&#20250;&#26356;&#23569;&#22320;&#20851;&#27880;&#38544;&#31169;&#20445;&#25252;&#65292;&#36825;&#34920;&#26126;&#22312;&#22823;&#25968;&#25454;&#26102;&#20195;&#24212;&#35813;&#26356;&#21152;&#37325;&#35270;&#25968;&#25454;&#38544;&#31169;&#25919;&#31574;&#30340;&#21046;&#23450;&#12290;</title><link>http://arxiv.org/abs/2304.11415</link><description>&lt;p&gt;
&#20010;&#24615;&#21270;&#23450;&#20215;&#21644;&#38544;&#31169;&#38656;&#27714;&#30340;&#25112;&#30053;&#22238;&#24212;&#65306;&#19968;&#39033;&#23454;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;
Strategic Responses to Personalized Pricing and Demand for Privacy: An Experiment. (arXiv:2304.11415v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.11415
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#23454;&#39564;&#21457;&#29616;&#65292;&#23545;&#20110;&#39038;&#23458;&#32780;&#35328;&#65292;&#24403;&#20010;&#20154;&#25968;&#25454;&#25152;&#22788;&#29615;&#22659;&#21644;&#26576;&#20010;&#20135;&#21697;&#26356;&#30456;&#20284;&#26102;&#65292;&#20182;&#20204;&#26356;&#23481;&#26131;&#36890;&#36807;&#25805;&#32437;&#33258;&#24049;&#30340;&#20010;&#20154;&#29305;&#24449;&#26469;&#33719;&#24471;&#26356;&#20248;&#24800;&#30340;&#20215;&#26684;&#65292;&#24182;&#19988;&#20250;&#26356;&#23569;&#22320;&#20851;&#27880;&#38544;&#31169;&#20445;&#25252;&#65292;&#36825;&#34920;&#26126;&#22312;&#22823;&#25968;&#25454;&#26102;&#20195;&#24212;&#35813;&#26356;&#21152;&#37325;&#35270;&#25968;&#25454;&#38544;&#31169;&#25919;&#31574;&#30340;&#21046;&#23450;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#39038;&#23458;&#24847;&#35782;&#21040;&#19968;&#20010;&#32479;&#35745;&#27169;&#22411;&#22522;&#20110;&#20182;&#20204;&#30340;&#34892;&#20026;&#26469;&#20915;&#23450;&#20135;&#21697;&#20215;&#26684;&#30340;&#24773;&#20917;&#12290;&#20351;&#29992;&#19968;&#39033;&#26032;&#30340;&#23454;&#39564;&#26469;&#21464;&#21270;&#21442;&#19982;&#32773;&#25968;&#25454;&#21644;&#20135;&#21697;&#20043;&#38388;&#30340;&#19978;&#19979;&#25991;&#30456;&#20284;&#24230;&#65292;&#25105;&#20204;&#21457;&#29616;&#21442;&#19982;&#32773;&#25805;&#32437;&#20182;&#20204;&#23545;&#20010;&#20154;&#29305;&#24449;&#30340;&#35843;&#26597;&#22238;&#31572;&#65292;&#24182;&#19988;&#22312;&#19978;&#19979;&#25991;&#26356;&#30456;&#20284;&#26102;&#25805;&#32437;&#26356;&#25104;&#21151;&#12290;&#27492;&#22806;&#65292;&#24403;&#19978;&#19979;&#25991;&#19981;&#22826;&#30456;&#20284;&#26102;&#65292;&#21442;&#19982;&#32773;&#20250;&#35201;&#27714;&#26356;&#23569;&#30340;&#38544;&#31169;&#65292;&#24182;&#20570;&#20986;&#19981;&#22826;&#20248;&#21270;&#30340;&#38544;&#31169;&#36873;&#25321;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#24378;&#35843;&#20102;&#22312;&#22823;&#25968;&#25454;&#26102;&#20195;&#65292;&#30475;&#20284;&#19981;&#30456;&#20851;&#30340;&#24773;&#22659;&#20013;&#30340;&#34892;&#20026;&#21487;&#33021;&#20250;&#24433;&#21709;&#20215;&#26684;&#65292;&#25968;&#25454;&#38544;&#31169;&#25919;&#31574;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider situations where consumers are aware that a statistical model determines the price of a product based on their observed behavior. Using a novel experiment varying the context similarity between participant data and a product, we find that participants manipulate their responses to a survey about personal characteristics, and manipulation is more successful when the contexts are similar. Moreover, participants demand less privacy, and make less optimal privacy choices when the contexts are less similar. Our findings highlight the importance of data privacy policies in the age of big data, where behavior in seemingly unrelated contexts might affect prices.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#38750;&#36127;&#38543;&#26426;&#21464;&#37327;&#38598;&#21512;&#30340;&#21452;&#26497;&#23450;&#29702;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#65292;&#25193;&#23637;&#21644;&#32479;&#19968;&#20102;&#29616;&#26377;&#30340;&#22312;&#24378;&#20581;&#26694;&#26550;&#19978;&#35777;&#26126;&#30340;&#21452;&#26497;&#23450;&#29702;&#12290;</title><link>http://arxiv.org/abs/2212.14259</link><description>&lt;p&gt;
&#38750;&#36127;&#38543;&#26426;&#21464;&#37327;&#38598;&#21512;&#30340;&#21452;&#26497;&#23450;&#29702;
&lt;/p&gt;
&lt;p&gt;
Bipolar Theorems for Sets of Non-negative Random Variables. (arXiv:2212.14259v2 [math.PR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.14259
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#38750;&#36127;&#38543;&#26426;&#21464;&#37327;&#38598;&#21512;&#30340;&#21452;&#26497;&#23450;&#29702;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#65292;&#25193;&#23637;&#21644;&#32479;&#19968;&#20102;&#29616;&#26377;&#30340;&#22312;&#24378;&#20581;&#26694;&#26550;&#19978;&#35777;&#26126;&#30340;&#21452;&#26497;&#23450;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20551;&#35774;&#19968;&#20010;&#24378;&#20581;&#30340;&#12289;&#19968;&#33324;&#19981;&#34987;&#25903;&#37197;&#30340;&#27010;&#29575;&#26694;&#26550;&#65292;&#24182;&#20026;&#38750;&#36127;&#38543;&#26426;&#21464;&#37327;&#30340;&#25152;&#26377;&#20934;&#30830;&#31561;&#20215;&#31867;&#30340;&#23376;&#38598;&#25552;&#20379;&#21452;&#26497;&#34920;&#31034;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#65292;&#32780;&#19981;&#38656;&#35201;&#23545;&#22522;&#30784;&#27979;&#24230;&#31354;&#38388;&#20570;&#36827;&#19968;&#27493;&#30340;&#38480;&#21046;&#12290;&#36825;&#25193;&#23637;&#21644;&#32479;&#19968;&#20102;&#29616;&#26377;&#30340;&#22312;&#24378;&#20581;&#26694;&#26550;&#19978;&#35777;&#26126;&#30340;&#21452;&#26497;&#23450;&#29702;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#27010;&#36848;&#20102;&#22312;&#25968;&#23398;&#37329;&#34701;&#21644;&#36816;&#36755;&#38382;&#39064;&#20013;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper assumes a robust, in general not dominated, probabilistic framework and provides necessary and sufficient conditions for a bipolar representation of subsets of the set of all quasi-sure equivalence classes of non-negative random variables without any further conditions on the underlying measure space. This generalises and unifies existing bipolar theorems proved under stronger assumptions on the robust framework. Moreover, we sketch applications to issues in mathematical finance and a mass transport type duality.
&lt;/p&gt;</description></item></channel></rss>