<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>Mobilit\"at.Leben&#30740;&#31350;&#35843;&#26597;&#20102;2022&#24180;&#24503;&#22269;&#30340;&#19968;&#20010;&#33258;&#28982;&#23454;&#39564;&#23545;&#20986;&#34892;&#34892;&#20026;&#30340;&#24433;&#21709;&#65292;&#30740;&#31350;&#21253;&#25324;&#20004;&#20010;&#26102;&#26399;&#21644;&#20004;&#20010;&#20803;&#32032;&#65292;&#36890;&#36807;&#38382;&#21367;&#35843;&#26597;&#21644;&#22522;&#20110;&#26234;&#33021;&#25163;&#26426;&#30340;&#34987;&#21160;&#33322;&#28857;&#36319;&#36394;&#65292;&#24182;&#20998;&#20139;&#20102;&#20851;&#20110;&#36827;&#34892;&#22823;&#35268;&#27169;&#38754;&#26495;&#30740;&#31350;&#30340;&#32463;&#39564;&#12290;</title><link>http://arxiv.org/abs/2308.04973</link><description>&lt;p&gt;
Mobilit\"at.Leben&#30740;&#31350;&#65306;&#19968;&#24180;&#30340;&#31227;&#21160;&#36861;&#36394;&#38754;&#26495;
&lt;/p&gt;
&lt;p&gt;
The Mobilit\"at.Leben Study: a Year-Long Mobility-Tracking Panel. (arXiv:2308.04973v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04973
&lt;/p&gt;
&lt;p&gt;
Mobilit\"at.Leben&#30740;&#31350;&#35843;&#26597;&#20102;2022&#24180;&#24503;&#22269;&#30340;&#19968;&#20010;&#33258;&#28982;&#23454;&#39564;&#23545;&#20986;&#34892;&#34892;&#20026;&#30340;&#24433;&#21709;&#65292;&#30740;&#31350;&#21253;&#25324;&#20004;&#20010;&#26102;&#26399;&#21644;&#20004;&#20010;&#20803;&#32032;&#65292;&#36890;&#36807;&#38382;&#21367;&#35843;&#26597;&#21644;&#22522;&#20110;&#26234;&#33021;&#25163;&#26426;&#30340;&#34987;&#21160;&#33322;&#28857;&#36319;&#36394;&#65292;&#24182;&#20998;&#20139;&#20102;&#20851;&#20110;&#36827;&#34892;&#22823;&#35268;&#27169;&#38754;&#26495;&#30740;&#31350;&#30340;&#32463;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Mobilit\"at.Leben&#30740;&#31350;&#35843;&#26597;&#20102;&#24503;&#22269;&#19968;&#20010;&#33258;&#28982;&#23454;&#39564;&#23545;&#20986;&#34892;&#34892;&#20026;&#30340;&#24433;&#21709;&#12290;&#20026;&#24212;&#23545;2022&#24180;&#30340;&#29983;&#27963;&#25104;&#26412;&#21361;&#26426;&#65292;&#22312;2022&#24180;6&#26376;&#12289;7&#26376;&#21644;8&#26376;&#65292;&#24341;&#20837;&#20102;&#20004;&#39033;&#25919;&#31574;&#25514;&#26045;&#65292;&#20197;&#20943;&#23569;&#20154;&#21475;&#20986;&#34892;&#25104;&#26412;&#65306;&#29123;&#27833;&#28040;&#36153;&#31246;&#21066;&#20943;&#21644;&#20960;&#20046;&#20813;&#36153;&#30340;&#20844;&#20849;&#20132;&#36890;&#65292;&#31216;&#20026;9&#27431;&#31080;&#12290;&#24503;&#22269;&#31080;&#30340;&#32487;&#20219;&#32773;&#65292;&#25152;&#35859;&#30340;Deutschlandticket&#30340;&#20844;&#21578;&#65292;&#23548;&#33268;&#31435;&#21363;&#20915;&#23450;&#32487;&#32493;&#30740;&#31350;&#12290;Mobilit\"at.Leben&#30740;&#31350;&#26377;&#20004;&#20010;&#26102;&#26399;&#65292;9&#27431;&#31080;&#26102;&#26399;&#21644;Deutschlandticket&#26102;&#26399;&#65292;&#21253;&#25324;&#20960;&#20010;&#38382;&#21367;&#35843;&#26597;&#21644;&#22522;&#20110;&#26234;&#33021;&#25163;&#26426;&#30340;&#34987;&#21160;&#33322;&#28857;&#36319;&#36394;&#12290;&#25972;&#20010;&#30740;&#31350;&#25345;&#32493;&#26102;&#38388;&#20849;&#35745;&#21313;&#19977;&#20010;&#26376;&#12290;&#22312;&#26412;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#25253;&#21578;&#20102;&#30740;&#31350;&#35774;&#35745;&#12289;&#25307;&#21215;&#31574;&#30053;&#12289;&#35843;&#26597;&#21442;&#19982;&#24773;&#20917;&#20197;&#21450;&#36319;&#36394;&#37096;&#20998;&#65292;&#24182;&#20998;&#20139;&#20102;&#25105;&#20204;&#22312;&#36827;&#34892;&#22823;&#35268;&#27169;&#38754;&#26495;&#30740;&#31350;&#26041;&#38754;&#30340;&#32463;&#39564;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;3080&#20154;&#21442;&#21152;&#20102;&#36825;&#39033;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Mobilit\"at.Leben study investigated travel behavior effects of a natural experiment in Germany. In response to the 2022 cost-of-living crisis, two policy measures to reduce travel costs for the population in June, July, and August 2022 were introduced: a fuel excise tax cut and almost fare-free public transport with the so-called 9-Euro-Ticket. The announcement of a successor ticket to the 9-Euro-Ticket, the so-called Deutschlandticket, led to the immediate decision to continue the study. The Mobilit\"at.Leben study has two periods, the 9-Euro-Ticket period and the Deutschlandticket period, and comprises two elements: several questionnaires and a smartphone-based passive waypoint tracking. The entire duration of the study was almost thirteen months.  In this paper, we report on the study design, the recruitment strategy, the study participation in the survey, and the tracking parts, and we share our experience in conducting such large-scale panel studies. Overall, 3,080 people reg
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#35843;&#26597;&#35770;&#25991;&#31995;&#32479;&#32780;&#20840;&#38754;&#22320;&#25551;&#36848;&#20102;&#20174;&#19981;&#21516;&#26469;&#28304;&#33719;&#24471;&#22806;&#37096;&#30693;&#35782;&#30340;&#26041;&#27861;&#65292;&#20197;&#24212;&#29992;&#20110;&#32929;&#31080;&#20215;&#26684;&#39044;&#27979;&#65292;&#24110;&#21161;&#29702;&#35299;&#32929;&#31080;&#24066;&#22330;&#30340;&#22797;&#26434;&#24615;&#12290;</title><link>http://arxiv.org/abs/2308.04947</link><description>&lt;p&gt;
&#33719;&#24471;&#21644;&#25972;&#21512;&#30693;&#35782;&#29992;&#20110;&#32929;&#31080;&#20215;&#26684;&#39044;&#27979;&#30340;&#26041;&#27861;&#65306;&#19968;&#39033;&#35843;&#26597;
&lt;/p&gt;
&lt;p&gt;
Methods for Acquiring and Incorporating Knowledge into Stock Price Prediction: A Survey. (arXiv:2308.04947v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04947
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#35843;&#26597;&#35770;&#25991;&#31995;&#32479;&#32780;&#20840;&#38754;&#22320;&#25551;&#36848;&#20102;&#20174;&#19981;&#21516;&#26469;&#28304;&#33719;&#24471;&#22806;&#37096;&#30693;&#35782;&#30340;&#26041;&#27861;&#65292;&#20197;&#24212;&#29992;&#20110;&#32929;&#31080;&#20215;&#26684;&#39044;&#27979;&#65292;&#24110;&#21161;&#29702;&#35299;&#32929;&#31080;&#24066;&#22330;&#30340;&#22797;&#26434;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#27979;&#32929;&#31080;&#20215;&#26684;&#26159;&#19968;&#20010;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#30740;&#31350;&#38382;&#39064;&#65292;&#22240;&#20026;&#32929;&#31080;&#24066;&#22330;&#30340;&#22266;&#26377;&#27874;&#21160;&#24615;&#21644;&#38750;&#32447;&#24615;&#24615;&#36136;&#12290;&#36817;&#24180;&#26469;&#65292;&#21033;&#29992;&#22806;&#37096;&#30693;&#35782;&#26469;&#29702;&#35299;&#32929;&#31080;&#24066;&#22330;&#30340;&#30693;&#35782;&#22686;&#24378;&#22411;&#32929;&#31080;&#20215;&#26684;&#39044;&#27979;&#26041;&#27861;&#34920;&#29616;&#20986;&#31361;&#30772;&#24615;&#30340;&#25104;&#26524;&#12290;&#23613;&#31649;&#36825;&#20123;&#26041;&#27861;&#30340;&#37325;&#35201;&#24615;&#65292;&#20294;&#22312;&#20174;&#22806;&#37096;&#30693;&#35782;&#31867;&#22411;&#30340;&#35282;&#24230;&#31995;&#32479;&#22320;&#32508;&#21512;&#20197;&#24448;&#30740;&#31350;&#26041;&#38754;&#65292;&#23398;&#26415;&#20316;&#21697;&#30340;&#31232;&#32570;&#24615;&#23384;&#22312;&#19968;&#23450;&#38382;&#39064;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#22806;&#37096;&#30693;&#35782;&#21487;&#20197;&#20197;&#19981;&#21516;&#30340;&#25968;&#25454;&#32467;&#26500;&#24314;&#27169;&#65292;&#25105;&#20204;&#23558;&#20854;&#20998;&#20026;&#38750;&#22270;&#24418;&#21270;&#26684;&#24335;&#21644;&#22270;&#24418;&#21270;&#26684;&#24335;&#20004;&#31867;&#65306;1) &#38750;&#22270;&#24418;&#21270;&#30693;&#35782;&#25429;&#33719;&#19982;&#20010;&#21035;&#32929;&#31080;&#23494;&#20999;&#30456;&#20851;&#30340;&#19978;&#19979;&#25991;&#20449;&#24687;&#21644;&#22810;&#23186;&#20307;&#25551;&#36848;&#65307;2) &#22270;&#24418;&#21270;&#30693;&#35782;&#25429;&#33719;&#32929;&#31080;&#24066;&#22330;&#20013;&#30456;&#20114;&#20851;&#32852;&#21644;&#30456;&#20114;&#20381;&#36182;&#30340;&#20449;&#24687;&#12290;&#26412;&#35843;&#26597;&#35770;&#25991;&#26088;&#22312;&#31995;&#32479;&#32780;&#20840;&#38754;&#22320;&#25551;&#36848;&#20174;&#19981;&#21516;&#26469;&#28304;&#33719;&#21462;&#22806;&#37096;&#30693;&#35782;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Predicting stock prices presents a challenging research problem due to the inherent volatility and non-linear nature of the stock market. In recent years, knowledge-enhanced stock price prediction methods have shown groundbreaking results by utilizing external knowledge to understand the stock market. Despite the importance of these methods, there is a scarcity of scholarly works that systematically synthesize previous studies from the perspective of external knowledge types. Specifically, the external knowledge can be modeled in different data structures, which we group into non-graph-based formats and graph-based formats: 1) non-graph-based knowledge captures contextual information and multimedia descriptions specifically associated with an individual stock; 2) graph-based knowledge captures interconnected and interdependent information in the stock market. This survey paper aims to provide a systematic and comprehensive description of methods for acquiring external knowledge from va
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#36890;&#36807;&#20351;&#29992;&#37327;&#23376;&#21551;&#21457;&#24335;&#31639;&#27861;simulated bifurcation&#65288;SB&#65289;&#26469;&#35299;&#20915;&#20102;&#22312;&#22823;&#35268;&#27169;&#24066;&#22330;&#22270;&#20013;&#23547;&#25214;&#26368;&#22823;&#29420;&#31435;&#38598;&#65288;MIS&#65289;&#30340;&#38382;&#39064;&#65292;&#26500;&#24314;&#20102;&#30456;&#20851;&#22810;&#26679;&#21270;&#30340;&#25237;&#36164;&#32452;&#21512;&#65292;&#24182;&#21462;&#24471;&#20102;&#20248;&#20110;&#20256;&#32479;MIS&#27714;&#35299;&#22120;&#30340;&#35745;&#31639;&#26102;&#38388;&#21644;&#35299;&#20915;&#26041;&#26696;&#20934;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2308.04769</link><description>&lt;p&gt;
&#36890;&#36807;&#22312;&#22823;&#35268;&#27169;&#24066;&#22330;&#22270;&#20013;&#23547;&#25214;&#26368;&#22823;&#29420;&#31435;&#38598;&#26500;&#24314;&#30456;&#20851;&#22810;&#26679;&#21270;&#25237;&#36164;&#32452;&#21512;
&lt;/p&gt;
&lt;p&gt;
Correlation-diversified portfolio construction by finding maximum independent set in large-scale market graph. (arXiv:2308.04769v1 [cs.ET])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04769
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#36890;&#36807;&#20351;&#29992;&#37327;&#23376;&#21551;&#21457;&#24335;&#31639;&#27861;simulated bifurcation&#65288;SB&#65289;&#26469;&#35299;&#20915;&#20102;&#22312;&#22823;&#35268;&#27169;&#24066;&#22330;&#22270;&#20013;&#23547;&#25214;&#26368;&#22823;&#29420;&#31435;&#38598;&#65288;MIS&#65289;&#30340;&#38382;&#39064;&#65292;&#26500;&#24314;&#20102;&#30456;&#20851;&#22810;&#26679;&#21270;&#30340;&#25237;&#36164;&#32452;&#21512;&#65292;&#24182;&#21462;&#24471;&#20102;&#20248;&#20110;&#20256;&#32479;MIS&#27714;&#35299;&#22120;&#30340;&#35745;&#31639;&#26102;&#38388;&#21644;&#35299;&#20915;&#26041;&#26696;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21487;&#20197;&#36890;&#36807;&#22312;&#23558;&#36793;&#23545;&#24212;&#20110;&#20004;&#21482;&#32929;&#31080;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#30340;&#24066;&#22330;&#22270;&#20013;&#23547;&#25214;&#26368;&#22823;&#29420;&#31435;&#38598;&#65288;MIS&#65289;&#65292;&#26469;&#26500;&#24314;&#30456;&#20851;&#22810;&#26679;&#21270;&#30340;&#25237;&#36164;&#32452;&#21512;&#12290;&#38543;&#30528;&#24066;&#22330;&#22270;&#30340;&#35268;&#27169;&#22686;&#22823;&#65292;&#25214;&#21040;MIS&#30340;&#35745;&#31639;&#22797;&#26434;&#24230;&#21576;&#25351;&#25968;&#22686;&#38271;&#65292;&#20351;&#24471;&#22312;&#22823;&#35268;&#27169;&#24066;&#22330;&#22270;&#20013;&#36873;&#25321;MIS&#21464;&#24471;&#22256;&#38590;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#36890;&#36807;&#22522;&#20110;&#37327;&#23376;&#21551;&#21457;&#24335;&#31639;&#27861;simulated bifurcation&#65288;SB&#65289;&#30340;&#32452;&#21512;&#20248;&#21270;&#27714;&#35299;&#22120;&#65288;Ising&#26426;&#22120;&#65289;&#35299;&#20915;&#20102;&#22823;&#35268;&#27169;&#24066;&#22330;&#22270;&#30340;MIS&#38382;&#39064;&#65292;&#24182;&#20351;&#29992;&#38271;&#26399;&#21382;&#21490;&#24066;&#22330;&#25968;&#25454;&#30740;&#31350;&#20102;&#26500;&#24314;&#30340;&#25237;&#36164;&#32452;&#21512;&#30340;&#25237;&#36164;&#34920;&#29616;&#12290;&#20351;&#29992;&#19981;&#21516;&#35268;&#27169;&#30340;&#32929;&#31080;&#23431;&#23449;[TOPIX 100, Nikkei 225, TOPIX 1000&#21644;TOPIX&#65288;&#21253;&#25324;&#32422;2000&#20010;&#25104;&#20998;&#32929;&#65289;]&#30340;&#27604;&#36739;&#34920;&#26126;&#65292;&#22522;&#20110;SB&#30340;&#27714;&#35299;&#22120;&#22312;&#35745;&#31639;&#26102;&#38388;&#21644;&#35299;&#20915;&#26041;&#26696;&#20934;&#30830;&#24615;&#26041;&#38754;&#20248;&#20110;&#20256;&#32479;&#30340;MIS&#27714;&#35299;&#22120;&#12290;&#36890;&#36807;&#20351;&#29992;&#22522;&#20110;SB&#30340;&#27714;&#35299;&#22120;&#65292;&#25105;&#20204;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
Correlation-diversified portfolios can be constructed by finding the maximum independent sets (MISs) in market graphs with edges corresponding to correlations between two stocks. The computational complexity to find the MIS increases exponentially as the size of the market graph increases, making the MIS selection in a large-scale market graph difficult. Here we construct a diversified portfolio by solving the MIS problem for a large-scale market graph with a combinatorial optimization solver (an Ising machine) based on a quantum-inspired algorithm called simulated bifurcation (SB) and investigate the investment performance of the constructed portfolio using long-term historical market data. Comparisons using stock universes of various sizes [TOPIX 100, Nikkei 225, TOPIX 1000, and TOPIX (including approximately 2,000 constituents)] show that the SB-based solver outperforms conventional MIS solvers in terms of computation-time and solution-accuracy. By using the SB-based solver, we opti
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;&#34394;&#25311;&#28857;&#30340;&#25193;&#25955;&#26041;&#31243;&#20013;&#26174;&#24335;&#26377;&#38480;&#24046;&#20998;&#26684;&#24335;&#30340;&#31283;&#23450;&#24615;&#65292;&#24182;&#19988;&#32771;&#34385;&#20102;&#19968;&#35302;&#21363;&#20184;&#26399;&#26435;&#22312;Black-Scholes&#27169;&#22411;&#19979;&#30340;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2308.04629</link><description>&lt;p&gt;
&#26174;&#24335;&#26377;&#38480;&#24046;&#20998;&#26684;&#24335;&#20013;&#20351;&#29992;&#34394;&#25311;&#28857;&#30340;&#25193;&#25955;&#26041;&#31243;&#30340;&#19981;&#31283;&#23450;&#24615;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Instabilities of explicit finite difference schemes with ghost points on the diffusion equation. (arXiv:2308.04629v1 [math.NA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04629
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;&#34394;&#25311;&#28857;&#30340;&#25193;&#25955;&#26041;&#31243;&#20013;&#26174;&#24335;&#26377;&#38480;&#24046;&#20998;&#26684;&#24335;&#30340;&#31283;&#23450;&#24615;&#65292;&#24182;&#19988;&#32771;&#34385;&#20102;&#19968;&#35302;&#21363;&#20184;&#26399;&#26435;&#22312;Black-Scholes&#27169;&#22411;&#19979;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#34394;&#25311;&#28857;&#20801;&#35768;&#25429;&#25417;&#19981;&#20301;&#20110;&#26377;&#38480;&#24046;&#20998;&#32593;&#26684;&#31163;&#25955;&#21270;&#19978;&#30340;&#36793;&#30028;&#26465;&#20214;&#12290;&#26412;&#25991;&#25506;&#35752;&#20102;&#34394;&#25311;&#28857;&#23545;&#26174;&#24335;&#27431;&#25289;&#26377;&#38480;&#24046;&#20998;&#26684;&#24335;&#22312;&#25193;&#25955;&#26041;&#31243;&#32972;&#26223;&#19979;&#31283;&#23450;&#24615;&#30340;&#24433;&#21709;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#22312;Black-Scholes&#27169;&#22411;&#19979;&#30340;&#19968;&#35302;&#21363;&#20184;&#26399;&#26435;&#30340;&#24773;&#20917;&#12290;&#28982;&#32780;&#65292;&#35266;&#23519;&#21644;&#32467;&#26524;&#23545;&#20110;&#26356;&#24191;&#27867;&#30340;&#37329;&#34701;&#21512;&#21516;&#21644;&#27169;&#22411;&#20063;&#26159;&#26377;&#25928;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Ghost, or fictitious points allow to capture boundary conditions that are not located on the finite difference grid discretization. We explore in this paper the impact of ghost points on the stability of the explicit Euler finite difference scheme in the context of the diffusion equation. In particular, we consider the case of a one-touch option under the Black-Scholes model. The observations and results are however valid for a much wider range of financial contracts and models.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#19968;&#20803;&#20809;&#23376;&#35745;&#31639;&#33455;&#29255;&#21644;&#29983;&#25104;&#23545;&#25239;&#23398;&#20064;&#30340;&#39640;&#25928;&#26399;&#26435;&#23450;&#20215;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#37327;&#23376;&#24133;&#24230;&#20272;&#35745;&#31639;&#27861;&#65292;&#30456;&#27604;&#20256;&#32479;&#26041;&#27861;&#23454;&#29616;&#20102;&#20108;&#27425;&#21152;&#36895;&#12290;&#20854;&#20013;&#65292;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#29992;&#20110;&#39640;&#25928;&#23398;&#20064;&#21644;&#21152;&#36733;&#36164;&#20135;&#20998;&#24067;&#65292;&#20934;&#30830;&#25429;&#25417;&#24066;&#22330;&#36235;&#21183;&#12290;&#36825;&#39033;&#24037;&#20316;&#20026;&#37329;&#34701;&#24212;&#29992;&#20013;&#30340;&#19987;&#29992;&#20809;&#23376;&#22788;&#29702;&#22120;&#21457;&#23637;&#25552;&#20379;&#20102;&#26032;&#30340;&#24605;&#36335;&#12290;</title><link>http://arxiv.org/abs/2308.04493</link><description>&lt;p&gt;
&#22522;&#20110;&#19968;&#20803;&#20809;&#23376;&#35745;&#31639;&#33455;&#29255;&#21644;&#29983;&#25104;&#23545;&#25239;&#23398;&#20064;&#30340;&#39640;&#25928;&#26399;&#26435;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
Efficient option pricing with unary-based photonic computing chip and generative adversarial learning. (arXiv:2308.04493v1 [quant-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04493
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#19968;&#20803;&#20809;&#23376;&#35745;&#31639;&#33455;&#29255;&#21644;&#29983;&#25104;&#23545;&#25239;&#23398;&#20064;&#30340;&#39640;&#25928;&#26399;&#26435;&#23450;&#20215;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#37327;&#23376;&#24133;&#24230;&#20272;&#35745;&#31639;&#27861;&#65292;&#30456;&#27604;&#20256;&#32479;&#26041;&#27861;&#23454;&#29616;&#20102;&#20108;&#27425;&#21152;&#36895;&#12290;&#20854;&#20013;&#65292;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#29992;&#20110;&#39640;&#25928;&#23398;&#20064;&#21644;&#21152;&#36733;&#36164;&#20135;&#20998;&#24067;&#65292;&#20934;&#30830;&#25429;&#25417;&#24066;&#22330;&#36235;&#21183;&#12290;&#36825;&#39033;&#24037;&#20316;&#20026;&#37329;&#34701;&#24212;&#29992;&#20013;&#30340;&#19987;&#29992;&#20809;&#23376;&#22788;&#29702;&#22120;&#21457;&#23637;&#25552;&#20379;&#20102;&#26032;&#30340;&#24605;&#36335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#29616;&#20195;&#37329;&#34701;&#34892;&#19994;&#31995;&#32479;&#20013;&#65292;&#20135;&#21697;&#32467;&#26500;&#21464;&#24471;&#36234;&#26469;&#36234;&#22797;&#26434;&#65292;&#20256;&#32479;&#35745;&#31639;&#33021;&#21147;&#30340;&#29942;&#39048;&#24050;&#32463;&#21046;&#32422;&#20102;&#37329;&#34701;&#34892;&#19994;&#30340;&#21457;&#23637;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23454;&#29616;&#27431;&#24335;&#26399;&#26435;&#23450;&#20215;&#30340;&#20809;&#23376;&#33455;&#29255;&#65292;&#32467;&#21512;&#37327;&#23376;&#24133;&#24230;&#20272;&#35745;&#31639;&#27861;&#65292;&#19982;&#32463;&#20856;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#30456;&#27604;&#65292;&#23454;&#29616;&#20102;&#20108;&#27425;&#21152;&#36895;&#12290;&#30005;&#36335;&#21253;&#25324;&#19977;&#20010;&#27169;&#22359;&#65306;&#21152;&#36733;&#36164;&#20135;&#20215;&#26684;&#20998;&#24067;&#30340;&#27169;&#22359;&#12289;&#35745;&#31639;&#39044;&#26399;&#25910;&#30410;&#30340;&#27169;&#22359;&#20197;&#21450;&#25191;&#34892;&#37327;&#23376;&#24133;&#24230;&#20272;&#35745;&#31639;&#27861;&#20197;&#24341;&#20837;&#21152;&#36895;&#30340;&#27169;&#22359;&#12290;&#22312;&#20998;&#24067;&#27169;&#22359;&#20013;&#65292;&#23884;&#20837;&#20102;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#20197;&#20415;&#39640;&#25928;&#22320;&#23398;&#20064;&#21644;&#21152;&#36733;&#36164;&#20135;&#20998;&#24067;&#65292;&#20934;&#30830;&#25429;&#25417;&#24066;&#22330;&#36235;&#21183;&#12290;&#36825;&#39033;&#24037;&#20316;&#26159;&#19987;&#29992;&#20809;&#23376;&#22788;&#29702;&#22120;&#22312;&#37329;&#34701;&#24212;&#29992;&#20013;&#21457;&#23637;&#30340;&#19968;&#20010;&#26032;&#36827;&#23637;&#65292;&#26377;&#28508;&#21147;&#25913;&#36827;&#26399;&#26435;&#23450;&#20215;&#30340;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the modern financial industry system, the structure of products has become more and more complex, and the bottleneck constraint of classical computing power has already restricted the development of the financial industry. Here, we present a photonic chip that implements the unary approach to European option pricing, in combination with the quantum amplitude estimation algorithm, to achieve a quadratic speedup compared to classical Monte Carlo methods. The circuit consists of three modules: a module loading the distribution of asset prices, a module computing the expected payoff, and a module performing the quantum amplitude estimation algorithm to introduce speed-ups. In the distribution module, a generative adversarial network is embedded for efficient learning and loading of asset distributions, which precisely capture the market trends. This work is a step forward in the development of specialized photonic processors for applications in finance, with the potential to improve the
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#21644;&#38750;&#26497;&#31471;&#29109;&#65292;&#22312;&#20840;&#29699;&#37329;&#34701;&#24066;&#22330;&#20013;&#25104;&#21151;&#26816;&#27979;&#20986;&#20102;&#24322;&#24120;&#24773;&#20917;&#65292;&#21457;&#29616;&#20102;&#22312;&#21361;&#26426;&#26399;&#38388;&#39640;&#24230;&#30456;&#20851;&#30340;&#36164;&#20135;&#30340;&#22797;&#26434;&#32467;&#26500;&#20943;&#23569;&#65292;&#24182;&#19988;&#19981;&#21516;&#30340;&#38750;&#26497;&#31471;&#29109;&#21442;&#25968;&#22312;&#21361;&#26426;&#21069;&#12289;&#26399;&#38388;&#21644;&#21518;&#30340;&#24322;&#24120;&#25968;&#37327;&#23384;&#22312;&#32479;&#35745;&#19978;&#30340;&#24046;&#24322;</title><link>http://arxiv.org/abs/2308.02914</link><description>&lt;p&gt;
&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#21644;&#38750;&#26497;&#31471;&#29109;&#22312;&#20840;&#29699;&#37329;&#34701;&#24066;&#22330;&#20013;&#36827;&#34892;&#24322;&#24120;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
Anomaly Detection in Global Financial Markets with Graph Neural Networks and Nonextensive Entropy. (arXiv:2308.02914v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.02914
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#21644;&#38750;&#26497;&#31471;&#29109;&#65292;&#22312;&#20840;&#29699;&#37329;&#34701;&#24066;&#22330;&#20013;&#25104;&#21151;&#26816;&#27979;&#20986;&#20102;&#24322;&#24120;&#24773;&#20917;&#65292;&#21457;&#29616;&#20102;&#22312;&#21361;&#26426;&#26399;&#38388;&#39640;&#24230;&#30456;&#20851;&#30340;&#36164;&#20135;&#30340;&#22797;&#26434;&#32467;&#26500;&#20943;&#23569;&#65292;&#24182;&#19988;&#19981;&#21516;&#30340;&#38750;&#26497;&#31471;&#29109;&#21442;&#25968;&#22312;&#21361;&#26426;&#21069;&#12289;&#26399;&#38388;&#21644;&#21518;&#30340;&#24322;&#24120;&#25968;&#37327;&#23384;&#22312;&#32479;&#35745;&#19978;&#30340;&#24046;&#24322;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24322;&#24120;&#26816;&#27979;&#26159;&#19968;&#20010;&#20855;&#26377;&#35768;&#22810;&#21464;&#37327;&#30340;&#31995;&#32479;&#20013;&#30340;&#19968;&#39033;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20219;&#21153;&#12290;&#24322;&#24120;&#26159;&#19982;&#20998;&#26512;&#25968;&#25454;&#22312;&#32479;&#35745;&#19978;&#19981;&#21516;&#30340;&#31163;&#32676;&#20540;&#65292;&#21487;&#33021;&#26469;&#33258;&#32597;&#35265;&#20107;&#20214;&#12289;&#35774;&#22791;&#25925;&#38556;&#25110;&#31995;&#32479;&#28389;&#29992;&#12290;&#26412;&#30740;&#31350;&#36890;&#36807;&#32771;&#34385;&#30001;&#38750;&#26497;&#31471;&#29109;&#34913;&#37327;&#30340;&#19981;&#30830;&#23450;&#24615;&#22330;&#26223;&#65292;&#30740;&#31350;&#20102;&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;(GNN)&#22312;&#20840;&#29699;&#37329;&#34701;&#24066;&#22330;&#20013;&#26816;&#27979;&#24322;&#24120;&#30340;&#33021;&#21147;&#12290;&#20027;&#35201;&#21457;&#29616;&#34920;&#26126;&#65292;&#22312;&#21361;&#26426;&#26399;&#38388;&#39640;&#24230;&#30456;&#20851;&#30340;&#36164;&#20135;&#30340;&#22797;&#26434;&#32467;&#26500;&#20943;&#23569;&#65292;&#19981;&#21516;&#30340;&#38750;&#26497;&#31471;&#29109;&#21442;&#25968;&#22312;&#21361;&#26426;&#21069;&#12289;&#26399;&#38388;&#21644;&#21518;&#30340;&#24322;&#24120;&#25968;&#37327;&#22312;&#32479;&#35745;&#19978;&#23384;&#22312;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;
Anomaly detection is a challenging task, particularly in systems with many variables. Anomalies are outliers that statistically differ from the analyzed data and can arise from rare events, malfunctions, or system misuse. This study investigated the ability to detect anomalies in global financial markets through Graph Neural Networks (GNN) considering an uncertainty scenario measured by a nonextensive entropy. The main findings show that the complex structure of highly correlated assets decreases in a crisis, and the number of anomalies is statistically different for nonextensive entropy parameters considering before, during, and after crisis.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22823;&#35268;&#27169;&#19990;&#30028;&#20013;&#30340;&#35777;&#25454;&#21512;&#20316;&#65288;ECL&#65289;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#19981;&#23436;&#20840;&#20449;&#24687;&#30340;&#35848;&#21028;&#38382;&#39064;&#30340;&#21338;&#24328;&#35770;&#27169;&#22411;&#12290;&#36890;&#36807;&#27169;&#22411;&#65292;&#20316;&#32773;&#21457;&#29616;&#25152;&#26377;&#21512;&#20316;&#32773;&#24517;&#39035;&#26368;&#22823;&#21270;&#30456;&#21516;&#30340;&#21152;&#26435;&#25928;&#29992;&#20989;&#25968;&#20043;&#21644;&#25165;&#33021;&#36798;&#21040;&#24085;&#32047;&#25176;&#26368;&#20248;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2307.04879</link><description>&lt;p&gt;
&#22312;&#22823;&#35268;&#27169;&#19990;&#30028;&#20013;&#24314;&#27169;&#35777;&#25454;&#21512;&#20316;
&lt;/p&gt;
&lt;p&gt;
Modeling evidential cooperation in large worlds. (arXiv:2307.04879v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04879
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22823;&#35268;&#27169;&#19990;&#30028;&#20013;&#30340;&#35777;&#25454;&#21512;&#20316;&#65288;ECL&#65289;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#19981;&#23436;&#20840;&#20449;&#24687;&#30340;&#35848;&#21028;&#38382;&#39064;&#30340;&#21338;&#24328;&#35770;&#27169;&#22411;&#12290;&#36890;&#36807;&#27169;&#22411;&#65292;&#20316;&#32773;&#21457;&#29616;&#25152;&#26377;&#21512;&#20316;&#32773;&#24517;&#39035;&#26368;&#22823;&#21270;&#30456;&#21516;&#30340;&#21152;&#26435;&#25928;&#29992;&#20989;&#25968;&#20043;&#21644;&#25165;&#33021;&#36798;&#21040;&#24085;&#32047;&#25176;&#26368;&#20248;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#35268;&#27169;&#19990;&#30028;&#20013;&#30340;&#35777;&#25454;&#21512;&#20316;&#65288;ECL&#65289;&#25351;&#30340;&#26159;&#20154;&#31867;&#21644;&#20854;&#20182;&#20195;&#29702;&#20154;&#21487;&#20197;&#36890;&#36807;&#19982;&#20855;&#26377;&#19981;&#21516;&#20215;&#20540;&#35266;&#30340;&#30456;&#20284;&#20195;&#29702;&#20154;&#22312;&#19968;&#20010;&#22823;&#23431;&#23449;&#20013;&#30340;&#22240;&#26524;&#26029;&#24320;&#37096;&#20998;&#21512;&#20316;&#32780;&#33719;&#30410;&#12290;&#21512;&#20316;&#20026;&#20195;&#29702;&#20154;&#25552;&#20379;&#20102;&#20854;&#20182;&#30456;&#20284;&#20195;&#29702;&#20154;&#21487;&#33021;&#20250;&#21512;&#20316;&#30340;&#35777;&#25454;&#65292;&#20174;&#32780;&#20351;&#25152;&#26377;&#20154;&#37117;&#20174;&#20132;&#26131;&#20013;&#33719;&#30410;&#12290;&#23545;&#20110;&#21033;&#20182;&#20027;&#20041;&#32773;&#26469;&#35828;&#65292;&#36825;&#21487;&#33021;&#26159;&#19968;&#20010;&#20851;&#38190;&#30340;&#32771;&#34385;&#22240;&#32032;&#12290;&#25105;&#23558;ECL&#21457;&#23637;&#20026;&#19968;&#20010;&#19981;&#23436;&#20840;&#20449;&#24687;&#30340;&#35848;&#21028;&#38382;&#39064;&#30340;&#21338;&#24328;&#35770;&#27169;&#22411;&#12290;&#35813;&#27169;&#22411;&#34701;&#20837;&#20102;&#23545;&#20182;&#20154;&#20215;&#20540;&#35266;&#21644;&#23454;&#35777;&#24773;&#20917;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#24182;&#35299;&#20915;&#20102;&#36873;&#25321;&#22949;&#21327;&#32467;&#26524;&#30340;&#38382;&#39064;&#12290;&#20351;&#29992;&#35813;&#27169;&#22411;&#65292;&#25105;&#35843;&#26597;&#20102;ECL&#23384;&#22312;&#30340;&#38382;&#39064;&#65292;&#24182;&#27010;&#36848;&#20102;&#24320;&#25918;&#30340;&#25216;&#26415;&#21644;&#21746;&#23398;&#38382;&#39064;&#12290;&#25105;&#23637;&#31034;&#20102;&#25152;&#26377;&#21512;&#20316;&#32773;&#24517;&#39035;&#26368;&#22823;&#21270;&#30456;&#21516;&#30340;&#21152;&#26435;&#25928;&#29992;&#20989;&#25968;&#20043;&#21644;&#25165;&#33021;&#36798;&#21040;&#24085;&#32047;&#25176;&#26368;&#20248;&#32467;&#26524;&#12290;&#28982;&#32780;&#65292;&#25105;&#21453;&#23545;&#36890;&#36807;&#23545;&#25928;&#29992;&#20989;&#25968;&#36827;&#34892;&#24402;&#19968;&#21270;&#26469;&#38544;&#24335;&#36873;&#25321;&#22949;&#21327;&#32467;&#26524;&#12290;&#25105;&#22238;&#39038;&#20102;&#35848;&#21028;&#29702;&#35770;&#21644;
&lt;/p&gt;
&lt;p&gt;
Evidential cooperation in large worlds (ECL) refers to the idea that humans and other agents can benefit by cooperating with similar agents with differing values in causally disconnected parts of a large universe. Cooperating provides agents with evidence that other similar agents are likely to cooperate too, resulting in gains from trade for all. This could be a crucial consideration for altruists.  I develop a game-theoretic model of ECL as an incomplete information bargaining problem. The model incorporates uncertainty about others' value systems and empirical situations, and addresses the problem of selecting a compromise outcome. Using the model, I investigate issues with ECL and outline open technical and philosophical questions.  I show that all cooperators must maximize the same weighted sum of utility functions to reach a Pareto optimal outcome. However, I argue against selecting a compromise outcome implicitly by normalizing utility functions. I review bargaining theory and a
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#22120;&#65292;&#29992;&#20110;&#20174;&#31163;&#25955;&#35266;&#27979;&#20013;&#27979;&#37327;&#36830;&#32493;&#36712;&#36857;&#30340;&#31895;&#31961;&#25351;&#25968;&#65292;&#35813;&#20272;&#35745;&#22120;&#36866;&#29992;&#20110;&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#30340;&#20272;&#35745;&#65292;&#24182;&#22312;&#22823;&#22810;&#25968;&#20998;&#25968;&#24067;&#26391;&#36816;&#21160;&#26679;&#26412;&#36335;&#24452;&#20013;&#25910;&#25947;&#12290;</title><link>http://arxiv.org/abs/2307.02582</link><description>&lt;p&gt;
&#20174;&#31163;&#25955;&#23454;&#29616;&#26041;&#24046;&#30340;&#35266;&#27979;&#20013;&#20272;&#35745;&#38543;&#26426;&#27874;&#21160;&#30340;&#31895;&#31961;&#25351;&#25968;
&lt;/p&gt;
&lt;p&gt;
Estimating the roughness exponent of stochastic volatility from discrete observations of the realized variance. (arXiv:2307.02582v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.02582
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#22120;&#65292;&#29992;&#20110;&#20174;&#31163;&#25955;&#35266;&#27979;&#20013;&#27979;&#37327;&#36830;&#32493;&#36712;&#36857;&#30340;&#31895;&#31961;&#25351;&#25968;&#65292;&#35813;&#20272;&#35745;&#22120;&#36866;&#29992;&#20110;&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#30340;&#20272;&#35745;&#65292;&#24182;&#22312;&#22823;&#22810;&#25968;&#20998;&#25968;&#24067;&#26391;&#36816;&#21160;&#26679;&#26412;&#36335;&#24452;&#20013;&#25910;&#25947;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#22312;&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#20013;&#20272;&#35745;&#27874;&#21160;&#24615;&#30340;&#31895;&#31961;&#24230;&#65292;&#35813;&#27169;&#22411;&#26159;&#20316;&#20026;&#20998;&#25968;&#24067;&#26391;&#36816;&#21160;&#65288;&#24102;&#28418;&#31227;&#65289;&#30340;&#38750;&#32447;&#24615;&#20989;&#25968;&#32780;&#20135;&#29983;&#30340;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#24341;&#20837;&#19968;&#20010;&#26032;&#30340;&#20272;&#35745;&#37327;&#65292;&#35813;&#20272;&#35745;&#37327;&#27979;&#37327;&#36830;&#32493;&#36712;&#36857;&#30340;&#25152;&#35859;&#31895;&#31961;&#25351;&#25968;&#65292;&#22522;&#20110;&#20854;&#21407;&#20989;&#25968;&#30340;&#31163;&#25955;&#35266;&#27979;&#12290;&#25105;&#20204;&#32473;&#20986;&#20102;&#23545;&#20110;&#22522;&#30784;&#36712;&#36857;&#30340;&#26465;&#20214;&#65292;&#22312;&#36825;&#20123;&#26465;&#20214;&#19979;&#65292;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#20197;&#20005;&#26684;&#36335;&#24452;&#26041;&#24335;&#25910;&#25947;&#12290;&#28982;&#21518;&#25105;&#20204;&#39564;&#35777;&#20102;&#36825;&#20123;&#26465;&#20214;&#22312;&#20960;&#20046;&#27599;&#20010;&#20998;&#25968;&#24067;&#26391;&#36816;&#21160;&#65288;&#24102;&#28418;&#31227;&#65289;&#26679;&#26412;&#36335;&#24452;&#20013;&#37117;&#24471;&#21040;&#28385;&#36275;&#12290;&#20316;&#20026;&#32467;&#26524;&#65292;&#22312;&#22823;&#31867;&#31895;&#27874;&#21160;&#27169;&#22411;&#30340;&#32972;&#26223;&#19979;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#24378;&#19968;&#33268;&#24615;&#23450;&#29702;&#12290;&#25968;&#20540;&#27169;&#25311;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#32463;&#36807;&#25105;&#20204;&#20272;&#35745;&#22120;&#30340;&#23610;&#24230;&#19981;&#21464;&#20462;&#25913;&#21518;&#65292;&#25105;&#20204;&#30340;&#20272;&#35745;&#31243;&#24207;&#34920;&#29616;&#33391;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the problem of estimating the roughness of the volatility in a stochastic volatility model that arises as a nonlinear function of fractional Brownian motion with drift. To this end, we introduce a new estimator that measures the so-called roughness exponent of a continuous trajectory, based on discrete observations of its antiderivative. We provide conditions on the underlying trajectory under which our estimator converges in a strictly pathwise sense. Then we verify that these conditions are satisfied by almost every sample path of fractional Brownian motion (with drift). As a consequence, we obtain strong consistency theorems in the context of a large class of rough volatility models. Numerical simulations show that our estimation procedure performs well after passing to a scale-invariant modification of our estimator.
&lt;/p&gt;</description></item><item><title>&#27874;&#20848;&#35760;&#24405;&#20102;&#27431;&#27954;&#26368;&#20302;&#30340;&#24615;&#21035;&#34218;&#36164;&#24046;&#36317;&#20043;&#19968;&#12290;&#36825;&#39033;&#30740;&#31350;&#21457;&#29616;&#65292;&#27597;&#20146;&#30340;&#25910;&#20837;&#22312;&#29983;&#32946;&#21518;&#20250;&#38477;&#20302;&#32422;20&#65285;&#65292;&#20294;&#22312;15&#24180;&#21518;&#19982;&#38750;&#27597;&#20146;&#30340;&#25910;&#20837;&#36235;&#20110;&#19968;&#33268;&#65292;&#32780;&#29238;&#20146;&#30340;&#25910;&#20837;&#22312;&#23401;&#23376;&#21040;&#26469;&#20043;&#21069;&#23601;&#24050;&#32463;&#39640;&#20110;&#38750;&#29238;&#20146;&#12290;</title><link>http://arxiv.org/abs/2306.12924</link><description>&lt;p&gt;
&#23401;&#23376;&#23545;&#27874;&#20848;&#22899;&#24615;&#21644;&#30007;&#24615;&#30340;&#21171;&#21160;&#21147;&#24066;&#22330;&#32467;&#26524;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The Impact of Parenthood on Labour Market Outcomes of Women and Men in Poland. (arXiv:2306.12924v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.12924
&lt;/p&gt;
&lt;p&gt;
&#27874;&#20848;&#35760;&#24405;&#20102;&#27431;&#27954;&#26368;&#20302;&#30340;&#24615;&#21035;&#34218;&#36164;&#24046;&#36317;&#20043;&#19968;&#12290;&#36825;&#39033;&#30740;&#31350;&#21457;&#29616;&#65292;&#27597;&#20146;&#30340;&#25910;&#20837;&#22312;&#29983;&#32946;&#21518;&#20250;&#38477;&#20302;&#32422;20&#65285;&#65292;&#20294;&#22312;15&#24180;&#21518;&#19982;&#38750;&#27597;&#20146;&#30340;&#25910;&#20837;&#36235;&#20110;&#19968;&#33268;&#65292;&#32780;&#29238;&#20146;&#30340;&#25910;&#20837;&#22312;&#23401;&#23376;&#21040;&#26469;&#20043;&#21069;&#23601;&#24050;&#32463;&#39640;&#20110;&#38750;&#29238;&#20146;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27874;&#20848;&#26159;&#27431;&#27954;&#24615;&#21035;&#34218;&#37228;&#24046;&#36317;&#26368;&#23567;&#30340;&#22269;&#23478;&#20043;&#19968;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#23427;&#26159;&#19968;&#20010;&#20445;&#23432;&#30340;&#22269;&#23478;&#65292;&#22899;&#24615;&#30340;&#26435;&#21033;&#19968;&#30452;&#22312;&#19979;&#38477;&#12290;&#25105;&#20204;&#35748;&#20026;&#65292;&#22312;&#27874;&#20848;&#32972;&#26223;&#19979;&#65292;&#25910;&#20837;&#24046;&#36317;&#27604;&#23567;&#26102;&#24037;&#36164;&#24046;&#36317;&#26356;&#36866;&#21512;&#34913;&#37327;&#24615;&#21035;&#21171;&#21160;&#21147;&#24066;&#22330;&#32467;&#26524;&#12290;&#25105;&#20204;&#20351;&#29992;&#35843;&#25972;&#20026;&#20302;&#20998;&#36776;&#29575;&#30340;&#23433;&#24944;&#21058;&#20107;&#20214;&#21382;&#21490;&#26041;&#27861;&#21644;&#27874;&#20848;&#19990;&#20195;&#21644;&#24615;&#21035;&#35843;&#26597;&#30340;&#20004;&#20010;&#27874;&#27425;&#65288;2010&#24180;&#12289;2014&#24180;&#65289;&#20998;&#26512;&#20102;&#27874;&#20848;&#30340;&#25910;&#20837;&#24615;&#21035;&#24046;&#36317;&#19982;&#32946;&#20799;&#29366;&#24577;&#30340;&#20851;&#31995;&#12290;&#19982;&#22312;&#35199;&#27431;&#36827;&#34892;&#30340;&#31867;&#20284;&#30740;&#31350;&#30456;&#21453;&#65292;&#25105;&#20204;&#30340;&#20998;&#26512;&#25581;&#31034;&#20102;&#22899;&#24615;&#21644;&#30007;&#24615;&#26222;&#36941;&#23384;&#22312;&#30340;&#39044;&#26399;&#34892;&#20026;&#12290;&#25105;&#20204;&#23637;&#31034;&#65292;&#22312;&#29983;&#32946;&#21518;&#65292;&#27597;&#20146;&#30340;&#25910;&#20837;&#38477;&#20302;&#20102;&#32422;20&#65285;&#65292;&#20294;&#22312;15&#24180;&#21518;&#65292;&#19982;&#38750;&#27597;&#20146;&#30340;&#25910;&#20837;&#36712;&#36857;&#36235;&#20110;&#19968;&#33268;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#26410;&#26469;&#29238;&#20146;&#30340;&#25910;&#20837;&#39640;&#20110;&#38750;&#29238;&#20146;&#30340;&#25910;&#20837;&#65292;&#36825;&#34920;&#26126;&#29238;&#20146;&#28322;&#20215;&#22312;&#23401;&#23376;&#21040;&#26469;&#20043;&#21069;&#23601;&#23384;&#22312;&#12290;&#24635;&#30340;&#26469;&#35828;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#25581;&#31034;&#20102;&#19968;&#20010;&#20445;&#23432;&#30340;&#22269;&#23478;&#20013;&#24615;&#21035;&#21171;&#21160;&#21147;&#24066;&#22330;&#32467;&#26524;&#30340;&#22797;&#26434;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Poland records one of the lowest gender wage gaps in Europe. At the same time, it is a socially conservative country where women's rights have been on the decline. We argue that, in the Polish context, the gender gap in income is a more appropriate measure of gendered labour market outcomes than the gap in the hourly wage. We analyse the gender gap in income in Poland in relation to the parenthood status, using the placebo event history method, adjusted to low resolution data, and the two waves of the Polish Generations and Gender Survey (2010, 2014). Contrary to similar studies conducted in Western Europe, our analysis uncovers a large degree of anticipatory behaviour in both women and men who expect to become parents. We show that mothers' income decreases by about 20% after birth, but converges to the income trajectory of non-mothers after 15 years. In contrast, the income of eventual fathers is higher than that of non-fathers both before and after birth, suggesting that the fatherh
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;</title><link>http://arxiv.org/abs/2302.13426</link><description>&lt;p&gt;
&#26399;&#26435;&#30340;&#20215;&#26684;&#21457;&#29616;
&lt;/p&gt;
&lt;p&gt;
Price Discovery for Derivatives. (arXiv:2302.13426v5 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13426
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#19968;&#20010;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#31169;&#26377;&#20449;&#24687;&#21644;&#39640;&#38454;&#20449;&#24687;&#23545;&#26399;&#26435;&#24066;&#22330;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#27169;&#22411;&#20801;&#35768;&#26377;&#31169;&#26377;&#20449;&#24687;&#30340;&#20132;&#26131;&#32773;&#22312;&#29366;&#24577;-&#32034;&#36180;&#38598;&#24066;&#22330;&#19978;&#20132;&#26131;&#12290;&#31561;&#20215;&#30340;&#26399;&#26435;&#24418;&#24335;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#25317;&#26377;&#20851;&#20110;&#22522;&#30784;&#36164;&#20135;&#25910;&#30410;&#30340;&#20998;&#24067;&#30340;&#31169;&#26377;&#20449;&#24687;&#65292;&#24182;&#20801;&#35768;&#20132;&#26131;&#20219;&#24847;&#26399;&#26435;&#32452;&#21512;&#30340;&#25805;&#32437;&#32773;&#12290;&#25105;&#20204;&#24471;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#65292;&#36825;&#20123;&#35299;&#25552;&#20379;&#20102;&#20851;&#20110;&#20869;&#24149;&#20132;&#26131;&#30340;&#39640;&#38454;&#20449;&#24687;&#65292;&#22914;&#20219;&#20309;&#32473;&#23450;&#30340;&#26102;&#21051;&#20132;&#26131;&#26399;&#26435;&#31574;&#30053;&#65292;&#24182;&#23558;&#36825;&#20123;&#31574;&#30053;&#27867;&#21270;&#21040;&#20102;&#27874;&#21160;&#29575;&#20132;&#26131;&#31561;&#23454;&#36341;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;
We obtain a basic theory of price discovery across derivative markets with respect to higher-order information, using a model where an agent with general private information regarding state probabilities is allowed to trade arbitrary portfolios of state-contingent claims. In an equivalent options formulation, the informed agent has private information regarding arbitrary aspects of the payoff distribution of an underlying asset and is allowed to trade arbitrary option portfolios. We characterize, in closed form, the informed demand, price impact, and information efficiency of prices. Our results offer a theory of insider trading on higher moments of the underlying payoff as a special case. The informed demand formula prescribes option strategies for trading on any given moment and extends those used in practice for, e.g. volatility trading.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#28608;&#21169;&#20302;&#30899;&#33021;&#28304;&#25237;&#36164;&#30340;&#24066;&#22330;&#26426;&#21046;&#65292;&#24182;&#20445;&#25252;&#28040;&#36153;&#32773;&#20813;&#21463;&#20379;&#24212;&#30701;&#32570;&#36896;&#25104;&#30340;&#39640;&#20215;&#24433;&#21709;&#12290;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24066;&#22330;&#26426;&#21046;&#65288;PIU&#65289;&#65292;&#36890;&#36807;&#32602;&#27454;&#25903;&#20184;&#12289;&#20379;&#24212;&#28608;&#21169;&#21644;&#33021;&#28304;&#20215;&#26684;&#25260;&#21319;&#26469;&#20943;&#23569;&#20379;&#24212;&#30701;&#32570;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#24314;&#31435;&#21338;&#24328;&#35770;&#26694;&#26550;&#65292;&#35777;&#26126;&#20102;&#22312;&#32602;&#27454;&#25903;&#20184;&#21644;&#20379;&#24212;&#28608;&#21169;&#30340;&#24773;&#20917;&#19979;&#23384;&#22312;&#19968;&#20010;&#32435;&#20160;&#22343;&#34913;&#28857;&#21487;&#20197;&#36798;&#21040;&#31038;&#20250;&#26368;&#20248;&#65292;&#20551;&#35774;&#20256;&#32479;&#33021;&#28304;&#36164;&#28304;&#30340;&#20379;&#24212;&#25104;&#26412;&#20026;&#20108;&#27425;&#20989;&#25968;&#12290;&#34429;&#28982;&#33021;&#28304;&#20215;&#26684;&#25260;&#21319;&#21487;&#20197;&#30830;&#20445;&#36275;&#22815;&#30340;&#25910;&#20837;&#65292;&#20294;&#25152;&#24471;&#30340;&#31995;&#32479;&#25104;&#26412;&#20559;&#31163;&#20102;&#31038;&#20250;&#26368;&#20248;&#65292;&#36825;&#20010;&#24046;&#36317;&#38543;&#30528;&#26356;&#22810;&#20256;&#32479;&#33021;&#28304;&#36164;&#28304;&#30340;&#36864;&#24441;&#32780;&#20943;&#23569;&#12290;</title><link>http://arxiv.org/abs/2212.06984</link><description>&lt;p&gt;
&#20302;&#30899;&#30005;&#21147;&#25237;&#36164;&#30340;&#24066;&#22330;&#26426;&#21046;&#65306;&#21338;&#24328;&#35770;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Market Mechanisms for Low-Carbon Electricity Investments: A Game-Theoretical Analysis. (arXiv:2212.06984v2 [eess.SY] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.06984
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#28608;&#21169;&#20302;&#30899;&#33021;&#28304;&#25237;&#36164;&#30340;&#24066;&#22330;&#26426;&#21046;&#65292;&#24182;&#20445;&#25252;&#28040;&#36153;&#32773;&#20813;&#21463;&#20379;&#24212;&#30701;&#32570;&#36896;&#25104;&#30340;&#39640;&#20215;&#24433;&#21709;&#12290;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24066;&#22330;&#26426;&#21046;&#65288;PIU&#65289;&#65292;&#36890;&#36807;&#32602;&#27454;&#25903;&#20184;&#12289;&#20379;&#24212;&#28608;&#21169;&#21644;&#33021;&#28304;&#20215;&#26684;&#25260;&#21319;&#26469;&#20943;&#23569;&#20379;&#24212;&#30701;&#32570;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#24314;&#31435;&#21338;&#24328;&#35770;&#26694;&#26550;&#65292;&#35777;&#26126;&#20102;&#22312;&#32602;&#27454;&#25903;&#20184;&#21644;&#20379;&#24212;&#28608;&#21169;&#30340;&#24773;&#20917;&#19979;&#23384;&#22312;&#19968;&#20010;&#32435;&#20160;&#22343;&#34913;&#28857;&#21487;&#20197;&#36798;&#21040;&#31038;&#20250;&#26368;&#20248;&#65292;&#20551;&#35774;&#20256;&#32479;&#33021;&#28304;&#36164;&#28304;&#30340;&#20379;&#24212;&#25104;&#26412;&#20026;&#20108;&#27425;&#20989;&#25968;&#12290;&#34429;&#28982;&#33021;&#28304;&#20215;&#26684;&#25260;&#21319;&#21487;&#20197;&#30830;&#20445;&#36275;&#22815;&#30340;&#25910;&#20837;&#65292;&#20294;&#25152;&#24471;&#30340;&#31995;&#32479;&#25104;&#26412;&#20559;&#31163;&#20102;&#31038;&#20250;&#26368;&#20248;&#65292;&#36825;&#20010;&#24046;&#36317;&#38543;&#30528;&#26356;&#22810;&#20256;&#32479;&#33021;&#28304;&#36164;&#28304;&#30340;&#36864;&#24441;&#32780;&#20943;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30005;&#21147;&#24066;&#22330;&#27491;&#20174;&#20256;&#32479;&#33021;&#28304;&#36164;&#28304;&#65288;&#22914;&#21270;&#30707;&#29123;&#26009;&#65289;&#30340;&#20027;&#23548;&#22320;&#20301;&#36716;&#21521;&#20302;&#30899;&#33021;&#28304;&#36164;&#28304;&#65288;&#22914;&#21487;&#20877;&#29983;&#33021;&#28304;&#21644;&#20648;&#33021;&#65289;&#12290;&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#28608;&#21169;&#20302;&#30899;&#33021;&#28304;&#25237;&#36164;&#30340;&#24066;&#22330;&#26426;&#21046;&#65292;&#21516;&#26102;&#30830;&#20445;&#25237;&#36164;&#32773;&#33719;&#24471;&#36275;&#22815;&#30340;&#24066;&#22330;&#25910;&#20837;&#65292;&#24341;&#23548;&#25237;&#36164;&#32773;&#30340;&#25112;&#30053;&#25237;&#36164;&#36798;&#21040;&#31038;&#20250;&#26368;&#20248;&#65292;&#24182;&#20445;&#25252;&#28040;&#36153;&#32773;&#20813;&#21463;&#20379;&#24212;&#30701;&#32570;&#36896;&#25104;&#30340;&#39640;&#20215;&#24433;&#21709;&#12290;&#20026;&#20102;&#20943;&#23569;&#20379;&#24212;&#30701;&#32570;&#20215;&#26684;&#30340;&#24433;&#21709;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24066;&#22330;&#26426;&#21046;&#65292;&#21253;&#25324;&#22833;&#25481;&#36127;&#33655;&#30340;&#32602;&#27454;&#25903;&#20184;&#12289;&#20379;&#24212;&#28608;&#21169;&#21644;&#33021;&#28304;&#20215;&#26684;&#25260;&#21319;&#65288;PIU&#65289;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#20010;&#21338;&#24328;&#35770;&#26694;&#26550;&#26469;&#20998;&#26512;&#24066;&#22330;&#22343;&#34913;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#22312;&#32602;&#27454;&#25903;&#20184;&#21644;&#20379;&#24212;&#28608;&#21169;&#30340;&#24773;&#20917;&#19979;&#65292;&#23384;&#22312;&#19968;&#20010;&#32435;&#20160;&#22343;&#34913;&#28857;&#21487;&#20197;&#36798;&#21040;&#31038;&#20250;&#26368;&#20248;&#65292;&#20551;&#35774;&#20256;&#32479;&#33021;&#28304;&#36164;&#28304;&#30340;&#20379;&#24212;&#25104;&#26412;&#20026;&#20108;&#27425;&#20989;&#25968;&#12290;&#34429;&#28982;&#33021;&#28304;&#20215;&#26684;&#25260;&#21319;&#21487;&#20197;&#30830;&#20445;&#36275;&#22815;&#30340;&#25910;&#20837;&#65292;&#20294;&#25152;&#24471;&#30340;&#31995;&#32479;&#25104;&#26412;&#20559;&#31163;&#20102;&#31038;&#20250;&#26368;&#20248;&#65292;&#36825;&#20010;&#24046;&#36317;&#38543;&#30528;&#26356;&#22810;&#20256;&#32479;&#33021;&#28304;&#36164;&#28304;&#30340;&#36864;&#24441;&#32780;&#20943;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;
Electricity markets are transforming from the dominance of conventional energy resources (CERs), e.g., fossil fuels, to low-carbon energy resources (LERs), e.g., renewables and energy storage. This work examines market mechanisms to incentivize LER investments, while ensuring adequate market revenues for investors, guiding investors' strategic investments towards social optimum, and protecting consumers from scarcity prices. To reduce the impact of excessive scarcity prices, we present a new market mechanism, which consists of a Penalty payment for lost load, a supply Incentive, and an energy price Uplift (PIU). We establish a game-theoretical framework to analyze market equilibrium. We prove that one Nash equilibrium under the penalty payment and supply incentive can reach the social optimum given quadratic supply costs of CERs. Although the price uplift can ensure adequate revenues, the resulting system cost deviates from the social optimum while the gap decreases as more CERs retire
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#36152;&#26131;&#32593;&#32476;&#30340;&#24418;&#25104;&#65292;&#22312;&#20010;&#20307;&#20915;&#31574;&#30340;&#22522;&#30784;&#19978;&#24314;&#31435;&#20102;&#19968;&#20010;&#26032;&#30340;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#27604;&#36739;&#20248;&#21183;&#12289;&#32463;&#27982;&#35268;&#27169;&#25928;&#24212;&#12289;&#20010;&#20307;&#24322;&#36136;&#24615;&#21644;&#36816;&#36755;&#25104;&#26412;&#31561;&#22240;&#32032;&#12290;&#36890;&#36807;&#25968;&#20540;&#27169;&#25311;&#21644;&#32479;&#35745;&#21147;&#23398;&#26041;&#27861;&#65292;&#25105;&#20204;&#25581;&#31034;&#20102;&#19977;&#31181;&#19981;&#21516;&#30340;&#36152;&#26131;&#32593;&#32476;&#32467;&#26500;&#12290;</title><link>http://arxiv.org/abs/2212.02841</link><description>&lt;p&gt;
&#35268;&#27169;&#32463;&#27982;&#21644;&#20135;&#21697;&#24046;&#24322;&#21270;&#24418;&#25104;&#30340;&#36152;&#26131;&#32593;&#32476;&#30340;&#26500;&#24314;
&lt;/p&gt;
&lt;p&gt;
Formation of trade networks by economies of scale and product differentiation. (arXiv:2212.02841v2 [physics.soc-ph] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.02841
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36152;&#26131;&#32593;&#32476;&#30340;&#24418;&#25104;&#65292;&#22312;&#20010;&#20307;&#20915;&#31574;&#30340;&#22522;&#30784;&#19978;&#24314;&#31435;&#20102;&#19968;&#20010;&#26032;&#30340;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#27604;&#36739;&#20248;&#21183;&#12289;&#32463;&#27982;&#35268;&#27169;&#25928;&#24212;&#12289;&#20010;&#20307;&#24322;&#36136;&#24615;&#21644;&#36816;&#36755;&#25104;&#26412;&#31561;&#22240;&#32032;&#12290;&#36890;&#36807;&#25968;&#20540;&#27169;&#25311;&#21644;&#32479;&#35745;&#21147;&#23398;&#26041;&#27861;&#65292;&#25105;&#20204;&#25581;&#31034;&#20102;&#19977;&#31181;&#19981;&#21516;&#30340;&#36152;&#26131;&#32593;&#32476;&#32467;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29702;&#35299;&#32593;&#32476;&#30340;&#32467;&#26500;&#21644;&#24418;&#25104;&#26159;&#22797;&#26434;&#24615;&#31185;&#23398;&#30340;&#19968;&#20010;&#26680;&#24515;&#20027;&#39064;&#12290;&#32463;&#27982;&#32593;&#32476;&#26159;&#36890;&#36807;&#20010;&#20307;&#20915;&#31574;&#24418;&#25104;&#30340;&#65292;&#22240;&#27492;&#19981;&#33021;&#29992;&#20256;&#32479;&#30340;&#38543;&#26426;&#22270;&#27169;&#22411;&#26469;&#20934;&#30830;&#25551;&#36848;&#12290;&#26412;&#25991;&#24314;&#31435;&#20102;&#19968;&#20010;&#22522;&#20110;&#20010;&#20307;&#20915;&#31574;&#30340;&#36152;&#26131;&#32593;&#32476;&#24418;&#25104;&#27169;&#22411;&#12290;&#35813;&#27169;&#22411;&#21253;&#25324;&#36152;&#26131;&#24418;&#25104;&#30340;&#20851;&#38190;&#22240;&#32032;&#65306;&#27604;&#36739;&#20248;&#21183;&#21644;&#32463;&#27982;&#35268;&#27169;&#25928;&#24212;&#65292;&#21516;&#26102;&#36824;&#32771;&#34385;&#20102;&#20010;&#20307;&#30340;&#24322;&#36136;&#24615;&#21644;&#36816;&#36755;&#25110;&#20132;&#26131;&#25104;&#26412;&#12290;&#25968;&#20540;&#27169;&#25311;&#26174;&#31034;&#20986;&#24418;&#25104;&#30340;&#36152;&#26131;&#32593;&#32476;&#26377;&#19977;&#31181;&#23439;&#35266;&#19981;&#21516;&#30340;&#21046;&#24230;&#12290;&#26681;&#25454;&#20855;&#20307;&#30340;&#36816;&#36755;&#25104;&#26412;&#21644;&#20010;&#20307;&#20559;&#22909;&#30340;&#24322;&#36136;&#24615;&#65292;&#25105;&#20204;&#21457;&#29616;&#20013;&#22830;&#38598;&#20013;&#29983;&#20135;&#19982;&#26143;&#22411;&#36152;&#26131;&#32593;&#32476;&#12289;&#20998;&#25955;&#29983;&#20135;&#19982;&#20840;&#29699;&#36152;&#26131;&#12289;&#23616;&#37096;&#29983;&#20135;&#19982;&#26080;&#36152;&#26131;&#20043;&#38388;&#30340;&#36716;&#21464;&#12290;&#21033;&#29992;&#32479;&#35745;&#21147;&#23398;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#20851;&#20110;&#36825;&#20123;&#36716;&#21464;&#30340;&#35299;&#26512;&#29702;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
Understanding the structure and formation of networks is a central topic in complexity science. Economic networks are formed by decisions of individual agents and thus not properly described by established random graph models. In this article, we establish a model for the emergence of trade networks that is based on rational decisions of individual agents. The model incorporates key drivers for the emergence of trade, comparative advantage and economic scale effects, but also the heterogeneity of agents and the transportation or transaction costs. Numerical simulations show three macroscopically different regimes of the emerging trade networks. Depending on the specific transportation costs and the heterogeneity of individual preferences, we find centralized production with a star-like trade network, distributed production with all-to-all trading or local production and no trade. Using methods from statistical mechanics, we provide an analytic theory of the transitions between these re
&lt;/p&gt;</description></item></channel></rss>