<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#26500;&#24314;&#20102;&#38598;&#35013;&#31665;&#33322;&#36816;&#34892;&#19994;1966&#24180;&#33267;2022&#24180;&#30340;&#32479;&#19968;&#21512;&#24182;&#28165;&#21333;&#65292;&#24182;&#36890;&#36807;&#32467;&#26500;&#21305;&#37197;&#27169;&#22411;&#30740;&#31350;&#20102;&#20844;&#21496;&#30340;&#24180;&#40836;&#12289;&#35268;&#27169;&#21644;&#22320;&#29702;&#37051;&#36817;&#24615;&#23545;&#21512;&#24182;&#20915;&#31574;&#30340;&#37325;&#35201;&#24615;&#30340;&#36716;&#21464;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#20844;&#21496;&#35268;&#27169;&#22312;1991&#24180;&#33267;2005&#24180;&#26399;&#38388;&#20316;&#20026;&#27491;&#21521;&#22240;&#32032;&#23545;&#21512;&#24182;&#28608;&#21169;&#26356;&#21152;&#37325;&#35201;&#65292;&#20294;&#22312;2006&#24180;&#33267;2022&#24180;&#26399;&#38388;&#20316;&#20026;&#36127;&#21521;&#22240;&#32032;&#36215;&#21040;&#25233;&#21046;&#20316;&#29992;&#12290;&#21516;&#26102;&#65292;&#20844;&#21496;&#20043;&#38388;&#30340;&#22320;&#29702;&#36317;&#31163;&#23545;&#21512;&#24182;&#20915;&#31574;&#20063;&#20135;&#29983;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2310.09938</link><description>&lt;p&gt;
&#12298;1966&#24180;&#20197;&#26469;&#38598;&#35013;&#31665;&#33322;&#36816;&#34892;&#19994;&#30340;&#32479;&#19968;&#21512;&#24182;&#28165;&#21333;&#65306;&#19968;&#23478;&#20844;&#21496;&#30340;&#24180;&#40836;&#12289;&#21544;&#20301;&#23481;&#37327;&#21644;&#22320;&#29702;&#37051;&#36817;&#24615;&#23545;&#21512;&#24182;&#20915;&#31574;&#30340;&#37325;&#35201;&#24615;&#30340;&#32467;&#26500;&#20272;&#35745;&#12299;&#30340;&#32763;&#35793;&#39064;&#30446;
&lt;/p&gt;
&lt;p&gt;
Unified Merger List in the Container Shipping Industry from 1966: A Structural Estimation of the Transition of Importance of a Firm's Age, Tonnage Capacity, and Geographical Proximity on Merger Decision. (arXiv:2310.09938v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09938
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26500;&#24314;&#20102;&#38598;&#35013;&#31665;&#33322;&#36816;&#34892;&#19994;1966&#24180;&#33267;2022&#24180;&#30340;&#32479;&#19968;&#21512;&#24182;&#28165;&#21333;&#65292;&#24182;&#36890;&#36807;&#32467;&#26500;&#21305;&#37197;&#27169;&#22411;&#30740;&#31350;&#20102;&#20844;&#21496;&#30340;&#24180;&#40836;&#12289;&#35268;&#27169;&#21644;&#22320;&#29702;&#37051;&#36817;&#24615;&#23545;&#21512;&#24182;&#20915;&#31574;&#30340;&#37325;&#35201;&#24615;&#30340;&#36716;&#21464;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#20844;&#21496;&#35268;&#27169;&#22312;1991&#24180;&#33267;2005&#24180;&#26399;&#38388;&#20316;&#20026;&#27491;&#21521;&#22240;&#32032;&#23545;&#21512;&#24182;&#28608;&#21169;&#26356;&#21152;&#37325;&#35201;&#65292;&#20294;&#22312;2006&#24180;&#33267;2022&#24180;&#26399;&#38388;&#20316;&#20026;&#36127;&#21521;&#22240;&#32032;&#36215;&#21040;&#25233;&#21046;&#20316;&#29992;&#12290;&#21516;&#26102;&#65292;&#20844;&#21496;&#20043;&#38388;&#30340;&#22320;&#29702;&#36317;&#31163;&#23545;&#21512;&#24182;&#20915;&#31574;&#20063;&#20135;&#29983;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#20840;&#29699;&#38598;&#35013;&#31665;&#33322;&#36816;&#34892;&#19994;1966&#24180;&#33267;2022&#24180;&#20043;&#38388;&#30340;&#32479;&#19968;&#21512;&#24182;&#28165;&#21333;&#12290;&#23558;&#35813;&#28165;&#21333;&#19982;&#19987;&#26377;&#25968;&#25454;&#32467;&#21512;&#65292;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#32467;&#26500;&#21305;&#37197;&#27169;&#22411;&#65292;&#25551;&#36848;&#20102;&#20844;&#21496;&#30340;&#24180;&#40836;&#12289;&#35268;&#27169;&#21644;&#22320;&#29702;&#37051;&#36817;&#24615;&#22312;&#21512;&#24182;&#20915;&#31574;&#20013;&#30340;&#21382;&#21490;&#24615;&#36716;&#21464;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;1991&#24180;&#33267;2005&#24180;&#26399;&#38388;&#65292;&#20316;&#20026;&#27491;&#38754;&#22240;&#32032;&#65292;&#19968;&#23478;&#20844;&#21496;&#30340;&#35268;&#27169;&#22312;&#21512;&#24182;&#28608;&#21169;&#20013;&#27604;&#20844;&#21496;&#30340;&#24180;&#40836;&#37325;&#35201;9.974&#20493;&#12290;&#28982;&#32780;&#65292;&#22312;2006&#24180;&#33267;2022&#24180;&#26399;&#38388;&#65292;&#20316;&#20026;&#36127;&#38754;&#22240;&#32032;&#65292;&#19968;&#23478;&#20844;&#21496;&#30340;&#35268;&#27169;&#22312;&#21512;&#24182;&#28608;&#21169;&#20013;&#27604;&#20844;&#21496;&#30340;&#24180;&#40836;&#37325;&#35201;0.026-0.630&#20493;&#65292;&#21363;&#20844;&#21496;&#30340;&#35268;&#27169;&#36215;&#21040;&#20102;&#25233;&#21046;&#20316;&#29992;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#20080;&#26041;&#20844;&#21496;&#21644;&#21334;&#26041;&#20844;&#21496;&#20043;&#38388;&#30340;&#36317;&#31163;&#22312;&#25972;&#20010;&#26399;&#38388;&#37117;&#36215;&#21040;&#20102;&#25233;&#21046;&#20316;&#29992;&#65292;&#20294;&#22312;&#36817;&#24180;&#26469;&#30340;&#32463;&#27982;&#37325;&#35201;&#24615;&#24050;&#20943;&#24369;&#21040;&#24494;&#19981;&#36275;&#36947;&#30340;&#31243;&#24230;&#12290;&#22312;&#21453;&#20107;&#23454;&#27169;&#25311;&#20013;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;&#21516;&#19968;&#22269;&#23478;&#30340;&#20844;&#21496;&#20043;&#38388;&#21512;&#24182;&#30340;&#31105;&#27490;&#20250;&#24433;&#21709;&#21512;&#24182;&#37197;&#32622;&#12290;
&lt;/p&gt;
&lt;p&gt;
We construct a novel unified merger list in the global container shipping industry between 1966 (the beginning of the industry) and 2022. Combining the list with proprietary data, we construct a structural matching model to describe the historical transition of the importance of a firm's age, size, and geographical proximity on merger decisions. We find that, as a positive factor, a firm's size is more important than a firm's age by 9.974 times as a merger incentive between 1991 and 2005. However, between 2006 and 2022, as a negative factor, a firm's size is more important than a firm's age by 0.026-0.630 times, that is, a firm's size works as a disincentive. We also find that the distance between buyer and seller firms works as a disincentive for the whole period, but the importance has dwindled to economic insignificance in recent years. In counterfactual simulations, we observe that the prohibition of mergers between firms in the same country would affect the merger configuration of
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#37096;&#20998;&#35266;&#27979;&#25193;&#25955;&#36807;&#31243;&#30340;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#19968;&#33268;&#24615;&#30340;&#36275;&#22815;&#26465;&#20214;&#65292;&#24182;&#22312;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#24314;&#27169;&#20013;&#23454;&#29616;&#20102;&#35813;&#27169;&#22411;&#30340;&#26410;&#30693;&#21442;&#25968;&#30340;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#37327;&#30340;&#19968;&#33268;&#24615;&#12290;</title><link>http://arxiv.org/abs/2201.07656</link><description>&lt;p&gt;
&#37096;&#20998;&#35266;&#27979;&#25193;&#25955;&#36807;&#31243;&#30340;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#19968;&#33268;&#24615;&#21450;&#22312;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#24314;&#27169;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Consistency of MLE for partially observed diffusions, with application in market microstructure modeling. (arXiv:2201.07656v2 [math.ST] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.07656
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#37096;&#20998;&#35266;&#27979;&#25193;&#25955;&#36807;&#31243;&#30340;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#19968;&#33268;&#24615;&#30340;&#36275;&#22815;&#26465;&#20214;&#65292;&#24182;&#22312;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#24314;&#27169;&#20013;&#23454;&#29616;&#20102;&#35813;&#27169;&#22411;&#30340;&#26410;&#30693;&#21442;&#25968;&#30340;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#37327;&#30340;&#19968;&#33268;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26131;&#20110;&#22788;&#29702;&#30340;&#36275;&#22815;&#26465;&#20214;&#65292;&#29992;&#20110;&#25551;&#36848;&#19982;&#23436;&#20840;&#35266;&#27979;&#30340;&#25193;&#25955;&#36807;&#31243;&#30456;&#20851;&#30340;&#31283;&#24577;&#20998;&#24067;&#65292;&#20174;&#32780;&#24471;&#20986;&#22312;&#26410;&#30693;&#21442;&#25968;&#20540;&#26377;&#38480;&#30340;&#24773;&#20917;&#19979;&#65292;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#37327;&#30340;&#19968;&#33268;&#24615;&#26465;&#20214;&#12290;&#25105;&#20204;&#23558;&#35813;&#36275;&#22815;&#26465;&#20214;&#24212;&#29992;&#20110;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#30340;&#28508;&#22312;&#20215;&#26684;&#27169;&#22411;&#20013;&#65292;&#24182;&#39564;&#35777;&#20102;&#35813;&#27169;&#22411;&#19979;&#26410;&#30693;&#21442;&#25968;&#30340;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#37327;&#30340;&#19968;&#33268;&#24615;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#21033;&#29992;&#32435;&#26031;&#36798;&#20811;&#20132;&#26131;&#25152;&#30340;&#21382;&#21490;&#37329;&#34701;&#25968;&#25454;&#35745;&#31639;&#20102;&#36825;&#20123;&#20272;&#35745;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a tractable sufficient condition for the consistency of maximum likelihood estimators (MLEs) in partially observed diffusion models, stated in terms of stationary distribution of the associated fully observed diffusion, under the assumption that the set of unknown parameter values is finite. This sufficient condition is then verified in the context of a latent price model of market microstructure, yielding consistency of maximum likelihood estimators of the unknown parameters in this model. Finally, we compute the latter estimators using historical financial data taken from the NASDAQ exchange.
&lt;/p&gt;</description></item></channel></rss>