<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#24037;&#20250;&#23545;&#32654;&#22269;&#24037;&#20316;&#22330;&#25152;&#12289;&#31649;&#29702;&#23618;&#21644;&#21592;&#24037;&#25919;&#27835;&#27963;&#21160;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#24037;&#20250;&#21270;&#23548;&#33268;&#25919;&#27835;&#27963;&#21160;&#25424;&#27454;&#21521;&#24038;&#36716;&#31227;&#65292;&#19981;&#20165;&#22312;&#24037;&#20154;&#20013;&#22686;&#21152;&#23545;&#27665;&#20027;&#20826;&#30340;&#25903;&#25345;&#65292;&#20063;&#22312;&#31649;&#29702;&#23618;&#20013;&#22686;&#21152;&#20102;&#23545;&#27665;&#20027;&#20826;&#30340;&#25903;&#25345;&#65292;&#34920;&#26126;&#20004;&#32452;&#20154;&#20043;&#38388;&#30340;&#25919;&#27835;&#20998;&#21270;&#24182;&#26410;&#22686;&#21152;&#12290;</title><link>http://arxiv.org/abs/2209.02637</link><description>&lt;p&gt;
&#24037;&#20250;&#26159;&#21542;&#22312;&#24037;&#20316;&#20013;&#22609;&#36896;&#25919;&#27835;&#24847;&#35782;&#24418;&#24577;&#65311;
&lt;/p&gt;
&lt;p&gt;
Do Unions Shape Political Ideologies at Work?. (arXiv:2209.02637v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.02637
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24037;&#20250;&#23545;&#32654;&#22269;&#24037;&#20316;&#22330;&#25152;&#12289;&#31649;&#29702;&#23618;&#21644;&#21592;&#24037;&#25919;&#27835;&#27963;&#21160;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#24037;&#20250;&#21270;&#23548;&#33268;&#25919;&#27835;&#27963;&#21160;&#25424;&#27454;&#21521;&#24038;&#36716;&#31227;&#65292;&#19981;&#20165;&#22312;&#24037;&#20154;&#20013;&#22686;&#21152;&#23545;&#27665;&#20027;&#20826;&#30340;&#25903;&#25345;&#65292;&#20063;&#22312;&#31649;&#29702;&#23618;&#20013;&#22686;&#21152;&#20102;&#23545;&#27665;&#20027;&#20826;&#30340;&#25903;&#25345;&#65292;&#34920;&#26126;&#20004;&#32452;&#20154;&#20043;&#38388;&#30340;&#25919;&#27835;&#20998;&#21270;&#24182;&#26410;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24037;&#20250;&#23545;&#25919;&#27835;&#24433;&#21709;&#21147;&#30340;&#26368;&#22823;&#28508;&#21147;&#21487;&#33021;&#26469;&#33258;&#20110;&#23427;&#20204;&#19982;&#25968;&#30334;&#19975;&#20010;&#20307;&#22312;&#24037;&#20316;&#22330;&#25152;&#30340;&#30452;&#25509;&#32852;&#31995;&#12290;&#22312;&#37027;&#37324;&#65292;&#23427;&#20204;&#21487;&#20197;&#25913;&#21464;&#24037;&#20250;&#21270;&#24037;&#20154;&#21450;&#20854;&#38750;&#24037;&#20250;&#21270;&#31649;&#29702;&#23618;&#30340;&#24847;&#35782;&#24418;&#24577;&#31435;&#22330;&#12290;&#26412;&#25991;&#20998;&#26512;&#20102;&#32654;&#22269;1980&#24180;&#33267;2016&#24180;&#26399;&#38388;&#24037;&#20250;&#23545;&#24037;&#20316;&#22330;&#25152;&#12289;&#31649;&#29702;&#23618;&#21644;&#21592;&#24037;&#25919;&#27835;&#27963;&#21160;&#25424;&#27454;&#30340;&#24433;&#21709;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#23558;&#20225;&#19994;&#32423;&#24037;&#20250;&#36873;&#20030;&#25968;&#25454;&#19982;&#32852;&#37030;&#21644;&#22320;&#26041;&#20505;&#36873;&#20154;&#30340;&#25424;&#27454;&#32423;&#21035;&#30456;&#38142;&#25509;&#12290;&#20351;&#29992;&#8220;&#24046;&#24322;&#22240;&#24046;&#24322;&#27861;&#8221;&#35774;&#35745;&#65292;&#24182;&#39564;&#35777;&#22238;&#24402;&#30340;&#19981;&#36830;&#32493;&#24615;&#21644;&#26032;&#39062;&#30340;&#24037;&#20855;&#21464;&#37327;&#26041;&#27861;&#65292;&#25105;&#20204;&#21457;&#29616;&#24037;&#20250;&#21270;&#23548;&#33268;&#25919;&#27835;&#27963;&#21160;&#25424;&#27454;&#21521;&#24038;&#36716;&#31227;&#12290;&#24037;&#20250;&#21270;&#19981;&#20165;&#22312;&#24037;&#20154;&#20013;&#22686;&#21152;&#20102;&#23545;&#27665;&#20027;&#20826;&#30340;&#25903;&#25345;&#32780;&#19988;&#22312;&#31649;&#29702;&#23618;&#20013;&#20063;&#22686;&#21152;&#20102;&#23545;&#27665;&#20027;&#20826;&#30340;&#25903;&#25345;&#65292;&#36825;&#21453;&#26144;&#20986;&#20004;&#32452;&#20154;&#20043;&#38388;&#25919;&#27835;&#20998;&#35010;&#30340;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;
Labor unions' greatest potential for political influence likely arises from their direct connection to millions of individuals at the workplace. There, they may change the ideological positions of both unionizing workers and their non-unionizing management. In this paper, we analyze the workplace-level impact of unionization on workers' and managers' political campaign contributions over the 1980-2016 period in the United States. To do so, we link establishment-level union election data with transaction-level campaign contributions to federal and local candidates. In a difference-in-differences design that we validate with regression discontinuity tests and a novel instrumental variables approach, we find that unionization leads to a leftward shift of campaign contributions. Unionization increases the support for Democrats relative to Republicans not only among workers but also among managers, which speaks against an increase in political cleavages between the two groups. We provide ev
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#21457;&#29616;&#20102;Merton&#65288;1971&#65289;&#33258;&#34701;&#36164;&#26465;&#20214;&#30340;&#26102;&#38388;&#38169;&#35823;&#65292;&#22240;&#27492;&#21542;&#23450;&#20102;Black&#21644;Scholes&#65288;1973&#65289;&#30340;&#26399;&#26435;&#23450;&#20215;&#20844;&#24335;&#65292;Harrison&#21644;Pliska&#65288;1981&#65289;&#30340;&#36830;&#32493;&#20132;&#26131;&#27169;&#22411;&#20197;&#21450;Cox&#65292;Ross&#21644;Rubinstein&#65288;1979&#65289;&#30340;&#20108;&#39033;&#26399;&#26435;&#23450;&#20215;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2202.05671</link><description>&lt;p&gt;
Black-Scholes-Merton&#26399;&#26435;&#23450;&#20215;&#30340;&#20877;&#25506;&#65306;&#25105;&#20204;&#21457;&#29616;&#20102;&#33268;&#21629;&#32570;&#38519;&#21527;&#65311;
&lt;/p&gt;
&lt;p&gt;
Black-Scholes-Merton Option Pricing Revisited: Did we Find a Fatal Flaw?. (arXiv:2202.05671v2 [q-fin.PR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.05671
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21457;&#29616;&#20102;Merton&#65288;1971&#65289;&#33258;&#34701;&#36164;&#26465;&#20214;&#30340;&#26102;&#38388;&#38169;&#35823;&#65292;&#22240;&#27492;&#21542;&#23450;&#20102;Black&#21644;Scholes&#65288;1973&#65289;&#30340;&#26399;&#26435;&#23450;&#20215;&#20844;&#24335;&#65292;Harrison&#21644;Pliska&#65288;1981&#65289;&#30340;&#36830;&#32493;&#20132;&#26131;&#27169;&#22411;&#20197;&#21450;Cox&#65292;Ross&#21644;Rubinstein&#65288;1979&#65289;&#30340;&#20108;&#39033;&#26399;&#26435;&#23450;&#20215;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Black&#21644;Scholes&#65288;1973&#65289;&#30340;&#26399;&#26435;&#23450;&#20215;&#20844;&#24335;&#22522;&#20110;Merton&#65288;1971&#65289;&#30340;&#36830;&#32493;&#26102;&#38388;&#39044;&#31639;&#26041;&#31243;&#20013;&#30340;&#36830;&#32493;&#26102;&#38388;&#33258;&#34701;&#36164;&#26465;&#20214;&#65292;&#35813;&#26465;&#20214;&#26159;&#22806;&#37096;&#36164;&#37329;&#30340;&#26080;&#27969;&#20837;&#25110;&#27969;&#20986;&#30340;&#25237;&#36164;&#32452;&#21512;&#20877;&#24179;&#34913;&#30340;&#32463;&#27982;&#27010;&#24565;&#30340;&#27491;&#24335;&#34920;&#36848;&#65292;&#20294;&#20174;&#26410;&#22312;&#36830;&#32493;&#26102;&#38388;&#19979;&#27491;&#24335;&#25512;&#23548;&#36807;&#12290;&#28982;&#32780;&#65292;&#20316;&#20026;&#26356;&#22823;&#30340;&#38382;&#39064;&#65292;&#25105;&#20204;&#21457;&#29616;Merton&#65288;1971&#65289;&#27169;&#22411;&#20013;&#30340;&#19968;&#20010;&#26102;&#38388;&#38169;&#35823;&#65292;&#24182;&#19988;&#34920;&#26126;&#20182;&#30340;&#33258;&#34701;&#36164;&#26465;&#20214;&#22312;&#31163;&#25955;&#26102;&#38388;&#21644;&#36830;&#32493;&#26102;&#38388;&#19979;&#37117;&#23384;&#22312;&#35823;&#24046;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#21542;&#23450;&#20102;&#35813;&#39046;&#22495;&#30340;&#26480;&#20986;&#36129;&#29486;&#65292;&#21253;&#25324;Merton&#65288;1971&#65289;&#30340;&#39044;&#31639;&#26041;&#31243;&#12289;Black&#21644;Scholes&#65288;1973&#65289;&#30340;&#26399;&#26435;&#23450;&#20215;&#20844;&#24335;&#12289;Harrison&#21644;Pliska&#65288;1981&#65289;&#30340;&#36830;&#32493;&#20132;&#26131;&#27169;&#22411;&#20197;&#21450;Cox&#65292;Ross&#21644;Rubinstein&#65288;1979&#65289;&#30340;&#20108;&#39033;&#26399;&#26435;&#23450;&#20215;&#27169;&#22411;&#12290;&#25105;&#20204;&#36824;&#34920;&#26126;&#65292;Black&#21644;Scholes&#65288;1973&#65289;&#20197;&#21450;Harrison&#21644;Pliska&#65288;1981&#65289;&#38544;&#21547;&#22320;&#20551;&#23450;&#20102;&#20182;&#20204;&#30340;&#22797;&#21046;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
The option pricing formula of Black and Scholes (1973) hinges on the continuous-time self-financing condition, which is a special case of the continuous-time budget equation of Merton (1971). The self-financing condition is believed to formalize the economic concept of portfolio rebalancing without inflows or outflows of external funds, but was never formally derived in continuous time. As a much bigger issue, however, we discover a timing mistake in the model of Merton (1971) and show that his self-financing condition is misspecified both in discrete and continuous time. Our results invalidate seminal contributions to the literature, including the budget equation of Merton (1971), the option pricing formula of Black and Scholes (1973), the continuous trading model of Harrison and Pliska (1981), and the binomial option pricing model of Cox, Ross and Rubinstein (1979). We also show that Black and Scholes (1973) and Harrison and Pliska (1981) implicitly assumed their replication result.
&lt;/p&gt;</description></item></channel></rss>