<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;ChatGPT&#30340;&#25237;&#36164;&#32452;&#21512;&#36873;&#25321;&#26041;&#27861;&#65292;&#21457;&#29616;ChatGPT&#23545;&#20110;&#32929;&#31080;&#36873;&#25321;&#26377;&#25928;&#65292;&#20294;&#22312;&#26435;&#37325;&#20998;&#37197;&#26041;&#38754;&#21487;&#33021;&#19981;&#22815;&#29702;&#24819;&#12290;&#28982;&#32780;&#65292;&#24403;&#23558;ChatGPT&#30340;&#32929;&#31080;&#36873;&#25321;&#19982;&#32452;&#21512;&#20248;&#21270;&#27169;&#22411;&#30456;&#32467;&#21512;&#26102;&#65292;&#21487;&#20197;&#33719;&#24471;&#26356;&#22909;&#30340;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2308.06260</link><description>&lt;p&gt;
&#22522;&#20110;ChatGPT&#30340;&#25237;&#36164;&#32452;&#21512;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
ChatGPT-based Investment Portfolio Selection. (arXiv:2308.06260v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.06260
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;ChatGPT&#30340;&#25237;&#36164;&#32452;&#21512;&#36873;&#25321;&#26041;&#27861;&#65292;&#21457;&#29616;ChatGPT&#23545;&#20110;&#32929;&#31080;&#36873;&#25321;&#26377;&#25928;&#65292;&#20294;&#22312;&#26435;&#37325;&#20998;&#37197;&#26041;&#38754;&#21487;&#33021;&#19981;&#22815;&#29702;&#24819;&#12290;&#28982;&#32780;&#65292;&#24403;&#23558;ChatGPT&#30340;&#32929;&#31080;&#36873;&#25321;&#19982;&#32452;&#21512;&#20248;&#21270;&#27169;&#22411;&#30456;&#32467;&#21512;&#26102;&#65292;&#21487;&#20197;&#33719;&#24471;&#26356;&#22909;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#21033;&#29992;&#29983;&#25104;&#24335;AI&#27169;&#22411;&#65288;&#22914;ChatGPT&#65289;&#36827;&#34892;&#25237;&#36164;&#32452;&#21512;&#36873;&#25321;&#30340;&#28508;&#22312;&#29992;&#36884;&#12290;&#30001;&#20110;&#27169;&#22411;&#30340;&#8220;&#24187;&#35273;&#8221;&#65292;&#23545;&#26469;&#33258;&#29983;&#25104;&#39044;&#35757;&#32451;&#36716;&#25442;&#22120;&#65288;GPT&#65289;&#27169;&#22411;&#30340;&#25237;&#36164;&#24314;&#35758;&#30340;&#20449;&#20219;&#26159;&#19968;&#20010;&#25361;&#25112;&#65292;&#38656;&#35201;&#23545;&#36755;&#20986;&#36827;&#34892;&#20180;&#32454;&#39564;&#35777;&#21644;&#39564;&#35777;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#19968;&#31181;&#26367;&#20195;&#26041;&#27861;&#12290;&#25105;&#20204;&#20351;&#29992;ChatGPT&#20174;S&amp;P500&#24066;&#22330;&#25351;&#25968;&#20013;&#33719;&#21462;&#19968;&#32452;&#26377;&#25237;&#36164;&#21560;&#24341;&#21147;&#30340;&#32929;&#31080;&#12290;&#38543;&#21518;&#65292;&#25105;&#20204;&#23558;&#21033;&#29992;&#36825;&#20010;&#30001;AI&#29983;&#25104;&#30340;&#20132;&#26131;&#32929;&#31080;&#32452;&#21512;&#19982;&#23450;&#37327;&#32452;&#21512;&#20248;&#21270;&#27169;&#22411;&#36827;&#34892;&#27604;&#36739;&#65292;&#24182;&#19982;&#19968;&#20123;&#27969;&#34892;&#30340;&#25237;&#36164;&#22522;&#37329;&#36827;&#34892;&#23545;&#27604;&#35780;&#20272;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;ChatGPT&#22312;&#32929;&#31080;&#36873;&#25321;&#26041;&#38754;&#26159;&#26377;&#25928;&#30340;&#65292;&#20294;&#22312;&#20998;&#37197;&#32929;&#31080;&#32452;&#21512;&#20013;&#30340;&#26368;&#20248;&#26435;&#37325;&#26041;&#38754;&#21487;&#33021;&#34920;&#29616;&#19981;&#20339;&#12290;&#20294;&#26159;&#65292;&#24403;ChatGPT&#30340;&#32929;&#31080;&#36873;&#25321;&#19982;&#24050;&#24314;&#31435;&#30340;&#32452;&#21512;&#20248;&#21270;&#27169;&#22411;&#30456;&#32467;&#21512;&#26102;&#65292;&#25105;&#20204;&#21462;&#24471;&#20102;&#26356;&#22909;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we explore potential uses of generative AI models, such as ChatGPT, for investment portfolio selection. Trusting investment advice from Generative Pre-Trained Transformer (GPT) models is a challenge due to model "hallucinations", necessitating careful verification and validation of the output. Therefore, we take an alternative approach. We use ChatGPT to obtain a universe of stocks from S&amp;P500 market index that are potentially attractive for investing. Subsequently, we compared various portfolio optimization strategies that utilized this AI-generated trading universe, evaluating those against quantitative portfolio optimization models as well as comparing to some of the popular investment funds. Our findings indicate that ChatGPT is effective in stock selection but may not perform as well in assigning optimal weights to stocks within the portfolio. But when stocks selection by ChatGPT is combined with established portfolio optimization models, we achieve even better resu
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#8220;&#24773;&#26223;&#26435;&#37325;&#8221;&#27010;&#24565;&#30340;&#26041;&#27861;&#65292;&#25193;&#23637;&#20102;&#20132;&#20114;&#24433;&#21709;&#24179;&#34913;&#26041;&#27861;&#22312;&#22810;&#26102;&#38388;&#36328;&#24230;&#19979;&#30340;&#24212;&#29992;&#65292;&#24182;&#36890;&#36807;&#31616;&#21270;&#24037;&#20316;&#27969;&#31243;&#20026;&#20915;&#31574;&#32773;&#25552;&#20379;&#20102;&#20415;&#25463;&#12290;</title><link>http://arxiv.org/abs/2308.06223</link><description>&lt;p&gt;
&#22810;&#26102;&#38388;&#36328;&#24230;&#19979;&#25193;&#23637;&#20132;&#20114;&#24433;&#21709;&#24179;&#34913;&#26041;&#27861;&#30340;&#19968;&#31181;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
An approach to extend Cross-Impact Balance method in multiple timespans. (arXiv:2308.06223v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.06223
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#8220;&#24773;&#26223;&#26435;&#37325;&#8221;&#27010;&#24565;&#30340;&#26041;&#27861;&#65292;&#25193;&#23637;&#20102;&#20132;&#20114;&#24433;&#21709;&#24179;&#34913;&#26041;&#27861;&#22312;&#22810;&#26102;&#38388;&#36328;&#24230;&#19979;&#30340;&#24212;&#29992;&#65292;&#24182;&#36890;&#36807;&#31616;&#21270;&#24037;&#20316;&#27969;&#31243;&#20026;&#20915;&#31574;&#32773;&#25552;&#20379;&#20102;&#20415;&#25463;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20132;&#20114;&#24433;&#21709;&#24179;&#34913;&#20998;&#26512;&#65288;CIB&#65289;&#26159;&#19968;&#31181;&#24191;&#27867;&#24212;&#29992;&#20110;&#19981;&#21516;&#39046;&#22495;&#65288;&#22914;&#31649;&#29702;&#31185;&#23398;&#21644;&#31038;&#20250;&#31185;&#23398;&#65289;&#30340;&#24314;&#31435;&#24773;&#26223;&#21644;&#24110;&#21161;&#30740;&#31350;&#20154;&#21592;&#21046;&#23450;&#25919;&#31574;&#30340;&#26041;&#27861;&#12290;&#22312;&#22810;&#24180;&#30340;CIB&#26041;&#27861;&#21457;&#23637;&#36807;&#31243;&#20013;&#65292;&#19968;&#20123;&#27966;&#29983;&#26041;&#27861;&#34987;&#24320;&#21457;&#20986;&#26469;&#20197;&#25193;&#23637;&#20854;&#24212;&#29992;&#33539;&#22260;&#65292;&#20854;&#20013;&#21253;&#25324;&#19968;&#31181;&#31216;&#20026;&#21160;&#24577;CIB&#30340;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#21160;&#24577;CIB&#30340;&#24037;&#20316;&#27969;&#31243;&#30456;&#23545;&#22797;&#26434;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#8220;&#24773;&#26223;&#26435;&#37325;&#8221;&#27010;&#24565;&#25193;&#23637;CIB&#22312;&#22810;&#20010;&#26102;&#38388;&#36328;&#24230;&#19979;&#30340;&#26041;&#27861;&#65292;&#24182;&#31616;&#21270;&#24037;&#20316;&#27969;&#31243;&#20197;&#20026;&#20915;&#31574;&#32773;&#24102;&#26469;&#20415;&#21033;&#12290;
&lt;/p&gt;
&lt;p&gt;
Cross-Impact Balance Analysis (CIB) is a widely used method to build scenarios and help researchers to formulate policies in different fields, such as management sciences and social sciences. During the development of the CIB method over the years, some derivative methods were developed to expand its application scope, including a method called dynamic CIB. However, the workflow of dynamic CIB is relatively complex. In this article, we provide another approach to extend CIB in multiple timespans based on the concept 'scenario weight' and simplify the workflow to bring convenience to the policy makers.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21457;&#29616;&#22312;&#25919;&#27835;&#20809;&#35889;&#19978;&#65292;&#25919;&#20826;&#24847;&#35782;&#24418;&#24577;&#19982;&#27169;&#31946;&#24615;&#20043;&#38388;&#23384;&#22312;&#30528;&#24378;&#28872;&#30340;&#38750;&#21333;&#35843;&#20851;&#31995;&#12290;&#20013;&#38388;&#27966;&#25919;&#20826;&#30456;&#27604;&#26497;&#31471;&#20027;&#20041;&#25919;&#20826;&#34987;&#36873;&#27665;&#35270;&#20026;&#39118;&#38505;&#36739;&#23567;&#65292;&#22240;&#27492;&#23427;&#20204;&#26356;&#23481;&#26131;&#21033;&#29992;&#27169;&#31946;&#24615;&#21560;&#24341;&#26356;&#22810;&#36873;&#27665;&#12290;&#36825;&#19968;&#32467;&#35770;&#24471;&#21040;&#20102;&#36873;&#20030;&#32467;&#26524;&#21644;&#21508;&#20010;&#25919;&#20826;&#25152;&#22312;&#22269;&#23478;&#30340;&#32463;&#27982;&#25351;&#26631;&#30340;&#25903;&#25345;&#12290;</title><link>http://arxiv.org/abs/2308.05912</link><description>&lt;p&gt;
&#24847;&#35782;&#24418;&#24577;&#27169;&#31946;&#19982;&#25919;&#27835;&#20809;&#35889;&#30340;&#20851;&#31995;
&lt;/p&gt;
&lt;p&gt;
Ideological Ambiguity and Political Spectrum. (arXiv:2308.05912v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.05912
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21457;&#29616;&#22312;&#25919;&#27835;&#20809;&#35889;&#19978;&#65292;&#25919;&#20826;&#24847;&#35782;&#24418;&#24577;&#19982;&#27169;&#31946;&#24615;&#20043;&#38388;&#23384;&#22312;&#30528;&#24378;&#28872;&#30340;&#38750;&#21333;&#35843;&#20851;&#31995;&#12290;&#20013;&#38388;&#27966;&#25919;&#20826;&#30456;&#27604;&#26497;&#31471;&#20027;&#20041;&#25919;&#20826;&#34987;&#36873;&#27665;&#35270;&#20026;&#39118;&#38505;&#36739;&#23567;&#65292;&#22240;&#27492;&#23427;&#20204;&#26356;&#23481;&#26131;&#21033;&#29992;&#27169;&#31946;&#24615;&#21560;&#24341;&#26356;&#22810;&#36873;&#27665;&#12290;&#36825;&#19968;&#32467;&#35770;&#24471;&#21040;&#20102;&#36873;&#20030;&#32467;&#26524;&#21644;&#21508;&#20010;&#25919;&#20826;&#25152;&#22312;&#22269;&#23478;&#30340;&#32463;&#27982;&#25351;&#26631;&#30340;&#25903;&#25345;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#25919;&#20826;&#24847;&#35782;&#24418;&#24577;&#19982;&#27169;&#31946;&#24615;&#22312;&#25919;&#27835;&#20809;&#35889;&#19978;&#30340;&#20851;&#31995;&#12290;&#25105;&#20204;&#22312;202&#20010;&#27431;&#27954;&#25919;&#20826;&#30340;&#26679;&#26412;&#20013;&#21457;&#29616;&#65292;&#25919;&#20826;&#24847;&#35782;&#24418;&#24577;&#19982;&#27169;&#31946;&#24615;&#20043;&#38388;&#23384;&#22312;&#30528;&#24378;&#28872;&#30340;&#38750;&#21333;&#35843;&#65288;&#20498;U&#22411;&#65289;&#20851;&#31995;&#12290;&#36825;&#31181;&#27169;&#24335;&#22312;&#25968;&#25454;&#25152;&#28085;&#30422;&#30340;&#25152;&#26377;&#24847;&#35782;&#24418;&#24577;&#32500;&#24230;&#19978;&#37117;&#26377;&#35266;&#23519;&#21040;&#12290;&#20026;&#20102;&#35299;&#37322;&#36825;&#31181;&#27169;&#24335;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#29702;&#35770;&#65292;&#35748;&#20026;&#30456;&#27604;&#26497;&#31471;&#20027;&#20041;&#25919;&#20826;&#65292;&#20013;&#38388;&#27966;&#25919;&#20826;&#34987;&#36873;&#27665;&#35270;&#20026;&#39118;&#38505;&#36739;&#23567;&#65292;&#22240;&#27492;&#22312;&#21033;&#29992;&#27169;&#31946;&#24615;&#21560;&#24341;&#26356;&#22810;&#36873;&#27665;&#26102;&#20855;&#26377;&#26356;&#22823;&#30340;&#20248;&#21183;&#12290;&#25105;&#20204;&#36890;&#36807;&#36873;&#20030;&#32467;&#26524;&#21644;&#21508;&#20010;&#25919;&#20826;&#25152;&#22312;&#22269;&#23478;&#30340;&#32463;&#27982;&#25351;&#26631;&#25552;&#20379;&#20102;&#39069;&#22806;&#30340;&#35777;&#25454;&#26469;&#25903;&#25345;&#25105;&#20204;&#30340;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study examines the relationship between ambiguity and the ideological positioning of political parties across the political spectrum. We identify a strong non-monotonic (inverted U-shaped) relationship between party ideology and ambiguity within a sample of 202 European political parties. This pattern is observed across all ideological dimensions covered in the data. To explain this pattern, we propose a novel theory that suggests centrist parties are perceived as less risky by voters compared to extremist parties, giving them an advantage in employing ambiguity to attract more voters at a lower cost. We support our explanation with additional evidence from electoral outcomes and economic indicators in the respective party countries.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#29992;&#20110;&#35299;&#20915;&#20855;&#26377;&#37329;&#34701;&#24066;&#22330;&#12289;&#23478;&#24237;&#29983;&#20135;&#21644;&#20445;&#30041;&#30340;&#20132;&#25442;&#32463;&#27982;&#30340;&#22343;&#34913;&#38382;&#39064;&#12290;&#36890;&#36807;&#24341;&#20837;&#26368;&#20248;&#21270;&#38382;&#39064;&#21644;Walrasian&#21452;&#20989;&#25968;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#20004;&#20010;&#38382;&#39064;&#35299;&#20043;&#38388;&#30340;&#31561;&#20215;&#24615;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;&#27599;&#20010;&#22343;&#34913;&#28857;&#21487;&#20197;&#36890;&#36807;&#19968;&#31995;&#21015;&#25200;&#21160;&#38382;&#39064;&#30340;&#26497;&#38480;&#26469;&#36817;&#20284;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#21160;&#39044;&#27979;&#21644;&#36845;&#20195;&#27714;&#35299;&#22343;&#34913;&#38382;&#39064;&#30340;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2308.05849</link><description>&lt;p&gt;
&#22312;&#20855;&#26377;&#37329;&#34701;&#24066;&#22330;&#12289;&#23478;&#24237;&#29983;&#20135;&#21644;&#20445;&#30041;&#30340;&#32463;&#27982;&#20013;&#35299;&#20915;&#22343;&#34913;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Solving equilibrium problems in economies with financial markets, home production, and retention. (arXiv:2308.05849v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.05849
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#29992;&#20110;&#35299;&#20915;&#20855;&#26377;&#37329;&#34701;&#24066;&#22330;&#12289;&#23478;&#24237;&#29983;&#20135;&#21644;&#20445;&#30041;&#30340;&#20132;&#25442;&#32463;&#27982;&#30340;&#22343;&#34913;&#38382;&#39064;&#12290;&#36890;&#36807;&#24341;&#20837;&#26368;&#20248;&#21270;&#38382;&#39064;&#21644;Walrasian&#21452;&#20989;&#25968;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#20004;&#20010;&#38382;&#39064;&#35299;&#20043;&#38388;&#30340;&#31561;&#20215;&#24615;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;&#27599;&#20010;&#22343;&#34913;&#28857;&#21487;&#20197;&#36890;&#36807;&#19968;&#31995;&#21015;&#25200;&#21160;&#38382;&#39064;&#30340;&#26497;&#38480;&#26469;&#36817;&#20284;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#21160;&#39044;&#27979;&#21644;&#36845;&#20195;&#27714;&#35299;&#22343;&#34913;&#38382;&#39064;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#35745;&#31639;&#20855;&#26377;&#23454;&#38469;&#37329;&#34701;&#24066;&#22330;&#12289;&#23478;&#24237;&#29983;&#20135;&#21644;&#20445;&#30041;&#30340;&#20132;&#25442;&#32463;&#27982;&#30340;&#22343;&#34913;&#30340;&#26032;&#26041;&#27861;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22343;&#34913;&#20215;&#26684;&#21487;&#20197;&#36890;&#36807;&#27714;&#35299;&#19968;&#20010;&#30456;&#20851;&#30340;&#26368;&#20248;&#21270;&#38382;&#39064;&#26469;&#30830;&#23450;&#12290;&#25105;&#20204;&#23558;&#37329;&#34701;&#24066;&#22330;&#30340;&#26080;&#22871;&#21033;&#26465;&#20214;&#32435;&#20837;&#22343;&#34913;&#24418;&#24335;&#21270;&#65292;&#24182;&#24314;&#31435;&#20102;&#20004;&#20010;&#38382;&#39064;&#35299;&#20043;&#38388;&#30340;&#31561;&#20215;&#24615;&#12290;&#36890;&#36807;&#28040;&#38500;&#30452;&#25509;&#35745;&#31639;&#37329;&#34701;&#21512;&#21516;&#20215;&#26684;&#30340;&#38656;&#35201;&#65292;&#36825;&#38477;&#20302;&#20102;&#21407;&#22987;&#38382;&#39064;&#30340;&#22797;&#26434;&#24615;&#65292;&#20351;&#25105;&#20204;&#33021;&#22815;&#22312;&#37329;&#34701;&#24066;&#22330;&#19981;&#23436;&#22791;&#30340;&#24773;&#20917;&#19979;&#35745;&#31639;&#22343;&#34913;&#12290;&#25105;&#20204;&#36824;&#24341;&#20837;&#20102;&#19968;&#20010;&#25429;&#25417;&#19981;&#24179;&#34913;&#30340;Walrasian&#21452;&#20989;&#25968;&#65292;&#24182;&#35777;&#26126;&#20102;&#35813;&#20989;&#25968;&#30340;maxinf&#28857;&#23545;&#24212;&#20110;&#22343;&#34913;&#28857;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36890;&#36807;&#20381;&#36182;&#20110;lopsided&#25910;&#25947;&#30340;&#27010;&#24565;&#26469;&#35777;&#26126;&#65292;&#27599;&#20010;&#22343;&#34913;&#28857;&#37117;&#21487;&#20197;&#36817;&#20284;&#20110;&#19968;&#31995;&#21015;&#25200;&#21160;&#38382;&#39064;&#30340;maxinf&#28857;&#30340;&#26497;&#38480;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#26126;&#30830;&#20102;&#19968;&#31181;&#33258;&#21160;&#39044;&#27979;&#21644;&#36845;&#20195;&#27714;&#35299;&#22343;&#34913;&#38382;&#39064;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a new methodology to compute equilibria for general equilibrium problems on exchange economies with real financial markets, home-production, and retention. We demonstrate that equilibrium prices can be determined by solving a related maxinf-optimization problem. We incorporate the non-arbitrage condition for financial markets into the equilibrium formulation and establish the equivalence between solutions to both problems. This reduces the complexity of the original by eliminating the need to directly compute financial contract prices, allowing us to calculate equilibria even in cases of incomplete financial markets.  We also introduce a Walrasian bifunction that captures the imbalances and show that maxinf-points of this function correspond to equilibrium points. Moreover, we demonstrate that every equilibrium point can be approximated by a limit of maxinf points for a family of perturbed problems, by relying on the notion of lopsided convergence.  Finally, we propose an au
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20102;&#30005;&#21160;&#20844;&#36335;&#31995;&#32479;&#21644;&#30005;&#27744;&#30005;&#21160;&#36710;&#30340;&#26367;&#20195;&#26041;&#26696;&#23545;&#20110;&#30005;&#21147;&#37096;&#38376;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#21487;&#28789;&#27963;&#20805;&#30005;&#30340;&#36710;&#36742;&#20849;&#20139;BEV&#30340;&#30005;&#21147;&#37096;&#38376;&#25104;&#26412;&#26368;&#20302;&#65292;&#32780;&#20351;&#29992;&#30005;&#21147;&#29123;&#26009;&#30340;&#37325;&#22411;&#36710;&#36742;&#30340;&#25104;&#26412;&#26368;&#39640;&#12290;</title><link>http://arxiv.org/abs/2303.16629</link><description>&lt;p&gt;
&#37325;&#22411;&#36710;&#36742;&#30005;&#27668;&#21270;&#30340;&#26367;&#20195;&#26041;&#26696;&#30340;&#30005;&#21147;&#37096;&#38376;&#24433;&#21709;:&#30005;&#27668;&#21270;&#21644;&#26234;&#33021;&#20805;&#30005;
&lt;/p&gt;
&lt;p&gt;
Power sector effects of alternative options for electrifying heavy-duty vehicles: go electric, and charge smartly. (arXiv:2303.16629v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.16629
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#30005;&#21160;&#20844;&#36335;&#31995;&#32479;&#21644;&#30005;&#27744;&#30005;&#21160;&#36710;&#30340;&#26367;&#20195;&#26041;&#26696;&#23545;&#20110;&#30005;&#21147;&#37096;&#38376;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#21487;&#28789;&#27963;&#20805;&#30005;&#30340;&#36710;&#36742;&#20849;&#20139;BEV&#30340;&#30005;&#21147;&#37096;&#38376;&#25104;&#26412;&#26368;&#20302;&#65292;&#32780;&#20351;&#29992;&#30005;&#21147;&#29123;&#26009;&#30340;&#37325;&#22411;&#36710;&#36742;&#30340;&#25104;&#26412;&#26368;&#39640;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20056;&#29992;&#36710;&#39046;&#22495;&#65292;&#30005;&#27744;&#30005;&#21160;&#36710;(BEV)&#24050;&#25104;&#20026;&#21435;&#30899;&#21270;&#20132;&#36890;&#30340;&#26368;&#26377;&#21069;&#36884;&#30340;&#36873;&#25321;&#12290;&#23545;&#20110;&#37325;&#22411;&#36710;&#36742;(HDV)&#65292;&#25216;&#26415;&#39046;&#22495;&#20284;&#20046;&#26356;&#20026;&#24320;&#25918;&#12290;&#38500;&#20102;BEV&#22806;&#65292;&#36824;&#35752;&#35770;&#20102;&#29992;&#20110;&#21160;&#24577;&#20379;&#30005;&#30340;&#30005;&#21160;&#20844;&#36335;&#31995;&#32479;(ERS)&#65292;&#20197;&#21450;&#20351;&#29992;&#27682;&#29123;&#26009;&#30005;&#27744;&#25110;&#30005;&#21147;&#29123;&#26009;&#30340;&#21345;&#36710;&#38388;&#25509;&#30005;&#27668;&#21270;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#36825;&#20123;&#26367;&#20195;&#26041;&#26696;&#30340;&#30005;&#21147;&#37096;&#38376;&#24433;&#21709;&#12290;&#25105;&#20204;&#23558;&#22522;&#20110;&#26410;&#26469;&#24503;&#22269;&#39640;&#21487;&#20877;&#29983;&#33021;&#28304;&#20221;&#39069;&#30340;&#24773;&#26223;&#65292;&#24212;&#29992;&#19968;&#20010;&#24320;&#28304;&#30340;&#23481;&#37327;&#25193;&#23637;&#27169;&#22411;&#65292;&#21033;&#29992;&#35814;&#32454;&#30340;&#20197;&#36335;&#32447;&#20026;&#22522;&#30784;&#30340;&#21345;&#36710;&#20132;&#36890;&#25968;&#25454;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#21487;&#28789;&#27963;&#20805;&#30005;&#30340;&#36710;&#36742;&#20849;&#20139;BEV&#30340;&#30005;&#21147;&#37096;&#38376;&#25104;&#26412;&#26368;&#20302;&#65292;&#32780;&#20351;&#29992;&#30005;&#21147;&#29123;&#26009;&#30340;&#37325;&#22411;&#36710;&#36742;&#30340;&#25104;&#26412;&#26368;&#39640;&#12290;&#22914;&#26524;BEV&#21644;ERS-BEV&#27809;&#26377;&#20197;&#20248;&#21270;&#30340;&#26041;&#24335;&#20805;&#30005;&#65292;&#30005;&#21147;&#37096;&#38376;&#25104;&#26412;&#20250;&#22686;&#21152;&#65292;&#20294;&#20173;&#36828;&#20302;&#20110;&#20351;&#29992;&#27682;&#25110;&#30005;&#21147;&#29123;&#26009;&#30340;&#24773;&#26223;&#12290;&#36825;&#26159;&#30456;&#23545;&#36739;&#23567;&#30005;&#27744;&#12289;&#39640;&#24230;&#28789;&#27963;&#30340;BEV&#22312;&#30701;&#36884;&#21644;&#20013;&#36884;&#27493;&#39588;&#36716;&#31227;&#21644;&#36229;&#20986;&#36947;&#36335;&#24191;&#27867;&#20351;&#29992;&#30340;&#20248;&#21183;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the passenger car segment, battery-electric vehicles (BEV) have emerged as the most promising option to decarbonize transportation. For heavy-duty vehicles (HDV), the technology space still appears to be more open. Aside from BEV, electric road systems (ERS) for dynamic power transfer are discussed, as well as indirect electrification with trucks that use hydrogen fuel cells or e-fuels. Here we investigate the power sector implications of these alternative options. We apply an open-source capacity expansion model to future scenarios of Germany with high renewable energy shares, drawing on detailed route-based truck traffic data. Results show that power sector costs are lowest for flexibly charged BEV that also carry out vehicle-to-grid operations, and highest for HDV using e-fuels. If BEV and ERS-BEV are not charged in an optimized way, power sector costs increase, but are still substantially lower than in scenarios with hydrogen or e-fuels. This is a consequence of the relatively p
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#20174;&#21453;&#23548;&#25968;&#31163;&#25955;&#35266;&#27979;&#20013;&#37325;&#26500;Faber-Schauder&#31995;&#25968;&#30340;&#26041;&#27861;&#65292;&#24182;&#21457;&#29616;&#20102;&#22312;&#20272;&#35745;&#36807;&#31243;&#20013;&#21482;&#26377;&#26368;&#32456;&#20135;&#29983;&#30340;&#31995;&#25968;&#20250;&#21463;&#21040;&#20301;&#32622;&#30340;&#24433;&#21709;&#21450;&#21021;&#22987;&#20540;&#30340;&#20381;&#36182;&#65292;&#24182;&#36890;&#36807;&#25918;&#24323;&#36825;&#20123;&#31995;&#25968;&#33719;&#21462;&#20102;&#39640;&#36136;&#37327;&#30340;&#20272;&#35745;&#20540;&#12290;</title><link>http://arxiv.org/abs/2211.11907</link><description>&lt;p&gt;
&#22522;&#20110;&#21453;&#23548;&#25968;&#31163;&#25955;&#35266;&#27979;&#30340;Faber-Schauder&#36924;&#36817;&#30340;&#40065;&#26834;&#24615;
&lt;/p&gt;
&lt;p&gt;
Robust Faber--Schauder approximation based on discrete observations of an antiderivative. (arXiv:2211.11907v3 [math.NA] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.11907
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#20174;&#21453;&#23548;&#25968;&#31163;&#25955;&#35266;&#27979;&#20013;&#37325;&#26500;Faber-Schauder&#31995;&#25968;&#30340;&#26041;&#27861;&#65292;&#24182;&#21457;&#29616;&#20102;&#22312;&#20272;&#35745;&#36807;&#31243;&#20013;&#21482;&#26377;&#26368;&#32456;&#20135;&#29983;&#30340;&#31995;&#25968;&#20250;&#21463;&#21040;&#20301;&#32622;&#30340;&#24433;&#21709;&#21450;&#21021;&#22987;&#20540;&#30340;&#20381;&#36182;&#65292;&#24182;&#36890;&#36807;&#25918;&#24323;&#36825;&#20123;&#31995;&#25968;&#33719;&#21462;&#20102;&#39640;&#36136;&#37327;&#30340;&#20272;&#35745;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20174;&#36830;&#32493;&#20989;&#25968;$f$ &#30340;&#21453;&#23548;&#25968;$F$ &#30340;&#31163;&#25955;&#35266;&#27979;&#20013;&#37325;&#26500;Faber-Schauder&#31995;&#25968;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#26159;&#36890;&#36807;&#20998;&#27573;&#20108;&#27425;&#26679;&#26465;&#25554;&#20540;&#26469;&#25551;&#36848;&#36825;&#20010;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#38381;&#21512;&#24418;&#24335;&#30340;&#35299;&#21644;&#28145;&#20837;&#30340;&#35823;&#24046;&#20998;&#26512;&#12290;&#36825;&#20123;&#32467;&#26524;&#23548;&#33268;&#20102;&#19968;&#20123;&#20196;&#20154;&#24778;&#35766;&#30340;&#35266;&#23519;&#65292;&#36825;&#20123;&#35266;&#23519;&#36824;&#22312;&#21476;&#20856;&#20108;&#27425;&#26679;&#26465;&#25554;&#20540;&#36825;&#19968;&#20027;&#39064;&#19978;&#25237;&#19979;&#20102;&#26032;&#30340;&#20809;&#65306;&#23427;&#20204;&#34920;&#26126;&#65292;&#36825;&#31181;&#26041;&#27861;&#30340;&#20247;&#25152;&#21608;&#30693;&#30340;&#19981;&#31283;&#23450;&#24615;&#21482;&#33021;&#22312;&#26368;&#32456;&#19968;&#20195;&#30340;&#20272;&#35745;Faber-Schauder&#31995;&#25968;&#20013;&#25214;&#21040;&#65292;&#36825;&#20123;&#31995;&#25968;&#36973;&#21463;&#38750;&#23616;&#37096;&#24615;&#21644;&#23545;&#21021;&#22987;&#20540;&#21644;&#32473;&#23450;&#25968;&#25454;&#30340;&#24378;&#20381;&#36182;&#24615;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#25152;&#26377;&#20854;&#20182;&#30340;Faber-Schauder&#31995;&#25968;&#21482;&#20381;&#36182;&#20110;&#25968;&#25454;&#30340;&#23616;&#37096;&#24615;&#65292;&#29420;&#31435;&#20110;&#21021;&#22987;&#20540;&#65292;&#19988;&#20855;&#26377;&#32479;&#19968;&#30340;&#35823;&#24046;&#30028;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#24471;&#20986;&#32467;&#35770;&#65292;&#21482;&#38656;&#25918;&#24323;&#26368;&#32456;&#29983;&#25104;&#30340;&#31995;&#25968;&#65292;&#25105;&#20204;&#23601;&#21487;&#20197;&#33719;&#24471;&#19968;&#20010;&#40065;&#26834;&#19988;&#33391;&#22909;&#30340;&#25105;&#20204;&#25152;&#30740;&#31350;&#38382;&#39064;&#30340;&#20272;&#35745;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the problem of reconstructing the Faber--Schauder coefficients of a continuous function $f$ from discrete observations of its antiderivative $F$. Our approach starts with formulating this problem through piecewise quadratic spline interpolation. We then provide a closed-form solution and an in-depth error analysis. These results lead to some surprising observations, which also throw new light on the classical topic of quadratic spline interpolation itself: They show that the well-known instabilities of this method can be located exclusively within the final generation of estimated Faber--Schauder coefficients, which suffer from non-locality and strong dependence on the initial value and the given data. By contrast, all other Faber--Schauder coefficients depend only locally on the data, are independent of the initial value, and admit uniform error bounds. We thus conclude that a robust and well-behaved estimator for our problem can be obtained by simply dropping the final-gener
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#36335;&#24452;&#20381;&#36182;&#32929;&#31080;&#27169;&#22411;&#19979;&#22914;&#20309;&#23450;&#20215;&#21644;&#23545;&#20914;&#26399;&#26435;&#65292;&#24182;&#25552;&#20379;&#20102;&#36335;&#24452;&#20381;&#36182;SDE&#35299;&#30340;&#21487;&#23548;&#24615;&#21644;&#23548;&#25968;&#30340;SDE&#34920;&#31034;&#12290;</title><link>http://arxiv.org/abs/2211.10953</link><description>&lt;p&gt;
&#22522;&#20110;&#36335;&#24452;&#20381;&#36182;&#32929;&#31080;&#27169;&#22411;&#30340;&#26399;&#26435;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
Option pricing under path-dependent stock models. (arXiv:2211.10953v2 [math.PR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.10953
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#36335;&#24452;&#20381;&#36182;&#32929;&#31080;&#27169;&#22411;&#19979;&#22914;&#20309;&#23450;&#20215;&#21644;&#23545;&#20914;&#26399;&#26435;&#65292;&#24182;&#25552;&#20379;&#20102;&#36335;&#24452;&#20381;&#36182;SDE&#35299;&#30340;&#21487;&#23548;&#24615;&#21644;&#23548;&#25968;&#30340;SDE&#34920;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#22312;&#32473;&#23450;&#36335;&#24452;&#20381;&#36182;SDE&#35299;&#30340;&#32929;&#31080;&#27169;&#22411;&#19979;&#23450;&#20215;&#21644;&#23545;&#20914;&#26399;&#26435;&#12290;&#24403;&#36335;&#24452;&#20381;&#36182;SDE&#31995;&#25968;&#20855;&#26377;&#24343;&#38647;&#27463;&#23548;&#25968;&#26102;&#65292;&#26399;&#26435;&#20215;&#26684;&#23545;&#26102;&#38388;&#21644;&#36335;&#24452;&#21487;&#23548;&#65292;&#24182;&#19988;&#21487;&#20197;&#34987;&#35270;&#20026;&#36335;&#24452;&#20381;&#36182;&#20559;&#24494;&#20998;&#26041;&#31243;&#30340;&#35299;&#12290;&#36825;&#21487;&#20197;&#30475;&#20316;&#26159;&#36153;&#26364;-&#21345;&#20811;&#20844;&#24335;&#30340;&#36335;&#24452;&#20381;&#36182;&#29256;&#26412;&#12290;&#20316;&#20026;&#38468;&#24102;&#32467;&#26524;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#36335;&#24452;&#20381;&#36182;SDE&#35299;&#30340;&#21487;&#23548;&#24615;&#20197;&#21450;&#20854;&#23548;&#25968;&#30340;SDE&#34920;&#31034;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#36335;&#24452;&#20381;&#36182;&#31995;&#25968;&#25200;&#21160;&#30340;&#24076;&#33098;&#23383;&#27597;&#20844;&#24335;&#12290;&#20316;&#20026;&#31034;&#20363;&#65292;&#28085;&#30422;&#20102;&#20855;&#26377;&#36335;&#24452;&#30340;&#26102;&#38388;&#31215;&#20998;&#24418;&#24335;&#31995;&#25968;&#30340;&#32929;&#31080;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies how to price and hedge options under stock models given as a path-dependent SDE solution. When the path-dependent SDE coefficients have Fr\'{e}chet derivatives, an option price is differentiable with respect to time and the path, and is given as a solution to the path-dependent PDE. This can be regarded as a path-dependent version of the Feynman-Kac formula. As a byproduct, we obtain the differentiability of path-dependent SDE solutions and the SDE representation of their derivatives. In addition, we provide formulas for Greeks with path-dependent coefficient perturbations. A stock model having coefficients with time integration forms of paths is covered as an example.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#38548;&#22812;&#21033;&#29575;&#30340;&#26399;&#38480;&#32467;&#26500;&#24314;&#27169;&#26694;&#26550;&#65292;&#24182;&#25104;&#21151;&#25429;&#25417;&#21040;&#38548;&#22812;&#21033;&#29575;&#36339;&#36291;&#34892;&#20026;&#30340;&#29305;&#24449;&#12290;&#36890;&#36807;&#25193;&#23637;&#20256;&#32479;&#30701;&#26399;&#21033;&#29575;&#26041;&#27861;&#26469;&#36866;&#24212;&#38543;&#26426;&#19981;&#36830;&#32493;&#24615;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#22312;&#39640;&#26031;&#35774;&#23450;&#19979;&#30340;&#20538;&#21048;&#21644;&#24125;&#24335;&#26399;&#26435;&#30340;&#26174;&#24335;&#20272;&#20540;&#20844;&#24335;&#12290;</title><link>http://arxiv.org/abs/2202.00929</link><description>&lt;p&gt;
&#36229;&#36807;&#38543;&#26426;&#36830;&#32493;&#24615;&#30340;&#38548;&#22812;&#21033;&#29575;&#30340;&#26399;&#38480;&#32467;&#26500;&#24314;&#27169;
&lt;/p&gt;
&lt;p&gt;
Term structure modelling with overnight rates beyond stochastic continuity. (arXiv:2202.00929v4 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.00929
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#38548;&#22812;&#21033;&#29575;&#30340;&#26399;&#38480;&#32467;&#26500;&#24314;&#27169;&#26694;&#26550;&#65292;&#24182;&#25104;&#21151;&#25429;&#25417;&#21040;&#38548;&#22812;&#21033;&#29575;&#36339;&#36291;&#34892;&#20026;&#30340;&#29305;&#24449;&#12290;&#36890;&#36807;&#25193;&#23637;&#20256;&#32479;&#30701;&#26399;&#21033;&#29575;&#26041;&#27861;&#26469;&#36866;&#24212;&#38543;&#26426;&#19981;&#36830;&#32493;&#24615;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#22312;&#39640;&#26031;&#35774;&#23450;&#19979;&#30340;&#20538;&#21048;&#21644;&#24125;&#24335;&#26399;&#26435;&#30340;&#26174;&#24335;&#20272;&#20540;&#20844;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38548;&#22812;&#21033;&#29575;&#65288;&#22914;&#32654;&#22269;&#30340;SOFR&#65289;&#26159;&#24403;&#21069;&#21033;&#29575;&#22522;&#20934;&#25913;&#38761;&#30340;&#26680;&#24515;&#12290;&#38548;&#22812;&#21033;&#29575;&#30340;&#19968;&#20010;&#26174;&#33879;&#29305;&#24449;&#26159;&#22312;&#39044;&#23450;&#26085;&#26399;&#21457;&#29983;&#36339;&#36291;&#21644;&#23574;&#23792;&#65292;&#36825;&#26159;&#30001;&#20110;&#36135;&#24065;&#25919;&#31574;&#24178;&#39044;&#21644;&#27969;&#21160;&#24615;&#38480;&#21046;&#23548;&#33268;&#30340;&#12290;&#36825;&#23545;&#24212;&#20110;&#22312;&#21160;&#24577;&#20013;&#20986;&#29616;&#38543;&#26426;&#19981;&#36830;&#32493;&#24615;&#65288;&#21363;&#22312;&#20107;&#20808;&#24050;&#30693;&#30340;&#26102;&#38388;&#28857;&#20986;&#29616;&#19981;&#36830;&#32493;&#65289;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#38548;&#22812;&#21033;&#29575;&#30340;&#26399;&#38480;&#32467;&#26500;&#24314;&#27169;&#26694;&#26550;&#65292;&#24182;&#22312;&#24191;&#20041;&#30340;Heath-Jarrow-Morton&#65288;HJM&#65289;&#35774;&#32622;&#20013;&#34920;&#24449;&#26080;&#22871;&#21033;&#26465;&#20214;&#12290;&#25105;&#20204;&#25299;&#23637;&#20102;&#20256;&#32479;&#30340;&#30701;&#26399;&#21033;&#29575;&#26041;&#27861;&#20197;&#36866;&#24212;&#38543;&#26426;&#19981;&#36830;&#32493;&#24615;&#65292;&#36890;&#36807;&#20223;&#23556;&#21322;&#38808;&#39532;&#19969;&#26684;&#23572;&#36827;&#34892;&#21487;&#34892;&#30340;&#24314;&#27169;&#12290;&#22312;&#36825;&#20010;&#32972;&#26223;&#19979;&#65292;&#25105;&#20204;&#35777;&#26126;&#31616;&#21333;&#30340;&#35268;&#26684;&#21487;&#20197;&#25429;&#25417;&#21040;&#38548;&#22812;&#21033;&#29575;&#36291;&#21464;&#34892;&#20026;&#30340;&#29305;&#24449;&#12290;&#22312;&#19968;&#20010;&#39640;&#26031;&#35774;&#23450;&#19979;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#20538;&#21048;&#21644;&#24125;&#24335;&#26399;&#26435;&#30340;&#26174;&#24335;&#20272;&#20540;&#20844;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
Overnight rates, such as the SOFR (Secured Overnight Financing Rate) in the US, are central to the current reform of interest rate benchmarks. A striking feature of overnight rates is the presence of jumps and spikes occurring at predetermined dates due to monetary policy interventions and liquidity constraints. This corresponds to stochastic discontinuities (i.e., discontinuities occurring at ex-ante known points in time) in their dynamics. In this work, we propose a term structure modelling framework based on overnight rates and characterize absence of arbitrage in a generalised Heath-Jarrow-Morton (HJM) setting. We extend the classical short-rate approach to accommodate stochastic discontinuities, developing a tractable setup driven by affine semimartingales. In this context, we show that simple specifications allow to capture stylized facts of the jump behavior of overnight rates. In a Gaussian setting, we provide explicit valuation formulas for bonds and caplets. Furthermore, we i
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#32467;&#21512;&#26426;&#22120;&#23398;&#20064;&#20998;&#31867;&#22120;&#21644;&#26377;&#25928;&#29305;&#24449;&#25552;&#21462;&#36827;&#34892;&#32929;&#31080;&#20132;&#26131;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#24615;&#33021;&#31579;&#36873;&#20986;&#26368;&#20339;&#29305;&#24449;&#65292;&#24182;&#20351;&#29992;&#38598;&#25104;&#23398;&#20064;&#30340;&#22235;&#20010;&#20998;&#31867;&#22120;&#36827;&#34892;&#20132;&#26131;&#20915;&#31574;&#12290;&#26368;&#20339;&#27169;&#22411;&#22312;2011&#24180;7&#26376;&#33267;2019&#24180;1&#26376;&#26399;&#38388;&#27599;&#26085;&#20132;&#26131;&#20013;&#33719;&#24471;&#20102;54.35%&#30340;&#21033;&#28070;&#12290;</title><link>http://arxiv.org/abs/2107.13148</link><description>&lt;p&gt;
&#32467;&#21512;&#26426;&#22120;&#23398;&#20064;&#20998;&#31867;&#22120;&#19982;&#26377;&#25928;&#30340;&#29305;&#24449;&#25552;&#21462;&#36827;&#34892;&#32929;&#31080;&#20132;&#26131;
&lt;/p&gt;
&lt;p&gt;
Combining Machine Learning Classifiers for Stock Trading with Effective Feature Extraction. (arXiv:2107.13148v3 [q-fin.TR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2107.13148
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#32467;&#21512;&#26426;&#22120;&#23398;&#20064;&#20998;&#31867;&#22120;&#21644;&#26377;&#25928;&#29305;&#24449;&#25552;&#21462;&#36827;&#34892;&#32929;&#31080;&#20132;&#26131;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#24615;&#33021;&#31579;&#36873;&#20986;&#26368;&#20339;&#29305;&#24449;&#65292;&#24182;&#20351;&#29992;&#38598;&#25104;&#23398;&#20064;&#30340;&#22235;&#20010;&#20998;&#31867;&#22120;&#36827;&#34892;&#20132;&#26131;&#20915;&#31574;&#12290;&#26368;&#20339;&#27169;&#22411;&#22312;2011&#24180;7&#26376;&#33267;2019&#24180;1&#26376;&#26399;&#38388;&#27599;&#26085;&#20132;&#26131;&#20013;&#33719;&#24471;&#20102;54.35%&#30340;&#21033;&#28070;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32929;&#31080;&#24066;&#22330;&#30340;&#19981;&#21487;&#39044;&#27979;&#24615;&#21644;&#27874;&#21160;&#24615;&#20351;&#24471;&#29992;&#20219;&#20309;&#27867;&#21270;&#26041;&#26696;&#33719;&#24471;&#21487;&#35266;&#21033;&#28070;&#21464;&#24471;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#35768;&#22810;&#20808;&#21069;&#30340;&#30740;&#31350;&#23581;&#35797;&#20351;&#29992;&#19981;&#21516;&#30340;&#25216;&#26415;&#26500;&#24314;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#36890;&#36807;&#23454;&#26102;&#20132;&#26131;&#22312;&#32654;&#22269;&#32929;&#24066;&#20013;&#33719;&#24471;&#21487;&#35266;&#21033;&#28070;&#12290;&#28982;&#32780;&#65292;&#24456;&#23569;&#26377;&#30740;&#31350;&#20851;&#27880;&#25214;&#21040;&#29305;&#23450;&#20132;&#26131;&#26399;&#38388;&#30340;&#26368;&#20339;&#29305;&#24449;&#30340;&#37325;&#35201;&#24615;&#12290;&#25105;&#20204;&#30340;&#26368;&#20339;&#26041;&#27861;&#36890;&#36807;&#24615;&#33021;&#26469;&#23558;&#29305;&#24449;&#20174;148&#20010;&#32553;&#23567;&#21040;&#32422;30&#20010;&#12290;&#27492;&#22806;&#65292;&#22312;&#27599;&#27425;&#35757;&#32451;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#20043;&#21069;&#65292;&#25105;&#20204;&#20250;&#21160;&#24577;&#36873;&#25321;&#21069;25&#20010;&#29305;&#24449;&#12290;&#23427;&#20351;&#29992;&#20102;&#22235;&#20010;&#20998;&#31867;&#22120;&#30340;&#38598;&#25104;&#23398;&#20064;&#65306;&#39640;&#26031;&#26420;&#32032;&#36125;&#21494;&#26031;&#12289;&#20915;&#31574;&#26641;&#12289;&#20855;&#26377;L1&#27491;&#21017;&#21270;&#30340;&#36923;&#36753;&#22238;&#24402;&#21644;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;&#65292;&#20197;&#20915;&#23450;&#26159;&#21542;&#23545;&#29305;&#23450;&#32929;&#31080;&#36827;&#34892;&#20570;&#22810;&#25110;&#20570;&#31354;&#20132;&#26131;&#12290;&#25105;&#20204;&#30340;&#26368;&#20339;&#27169;&#22411;&#22312;2011&#24180;7&#26376;&#33267;2019&#24180;1&#26376;&#20043;&#38388;&#36827;&#34892;&#27599;&#26085;&#20132;&#26131;&#65292;&#33719;&#24471;&#20102;54.35%&#30340;&#21033;&#28070;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#30340;&#24037;&#20316;&#23637;&#31034;&#20102;&#28151;&#21512;&#26426;&#22120;&#23398;&#20064;&#20998;&#31867;&#22120;&#19982;&#26377;&#25928;&#29305;&#24449;&#25552;&#21462;&#22312;&#32929;&#31080;&#20132;&#26131;&#20013;&#30340;&#24212;&#29992;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
The unpredictability and volatility of the stock market render it challenging to make a substantial profit using any generalised scheme. Many previous studies tried different techniques to build a machine learning model, which can make a significant profit in the US stock market by performing live trading. However, very few studies have focused on the importance of finding the best features for a particular trading period. Our top approach used the performance to narrow down the features from a total of 148 to about 30. Furthermore, the top 25 features were dynamically selected before each time training our machine learning model. It uses ensemble learning with four classifiers: Gaussian Naive Bayes, Decision Tree, Logistic Regression with L1 regularization, and Stochastic Gradient Descent, to decide whether to go long or short on a particular stock. Our best model performed daily trade between July 2011 and January 2019, generating 54.35% profit. Finally, our work showcased that mixtu
&lt;/p&gt;</description></item></channel></rss>