<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#25552;&#20379;&#20102;&#19968;&#20010;&#23454;&#29992;&#24037;&#20855;&#21253;&#65292;&#29992;&#20110;&#20998;&#26512;&#20107;&#20214;&#30740;&#31350;&#20013;&#30340;&#25928;&#24212;&#24322;&#36136;&#24615;&#65292;&#24378;&#35843;&#20102;&#20010;&#20307;&#32423;&#21035;&#25928;&#24212;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#25581;&#31034;&#20102;&#32447;&#24615;&#27835;&#30103;&#25928;&#24212;&#30340;&#25361;&#25112;&#12290;</title><link>https://arxiv.org/abs/2403.19563</link><description>&lt;p&gt;
&#20107;&#20214;&#30740;&#31350;&#20013;&#20010;&#20307;&#24322;&#36136;&#24615;&#30340;&#28789;&#27963;&#20998;&#26512;&#65306;&#20197;&#23376;&#22899;&#24809;&#32602;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
Flexible Analysis of Individual Heterogeneity in Event Studies: Application to the Child Penalty
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.19563
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20379;&#20102;&#19968;&#20010;&#23454;&#29992;&#24037;&#20855;&#21253;&#65292;&#29992;&#20110;&#20998;&#26512;&#20107;&#20214;&#30740;&#31350;&#20013;&#30340;&#25928;&#24212;&#24322;&#36136;&#24615;&#65292;&#24378;&#35843;&#20102;&#20010;&#20307;&#32423;&#21035;&#25928;&#24212;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#25581;&#31034;&#20102;&#32447;&#24615;&#27835;&#30103;&#25928;&#24212;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#23454;&#29992;&#24037;&#20855;&#21253;&#65292;&#29992;&#20110;&#20998;&#26512;&#20107;&#20214;&#30740;&#31350;&#20013;&#30340;&#25928;&#24212;&#24322;&#36136;&#24615;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#20272;&#35745;&#31639;&#27861;&#65292;&#24182;&#35843;&#25972;&#29616;&#26377;&#30340;&#35745;&#37327;&#32463;&#27982;&#32467;&#26524;&#65292;&#25552;&#20379;&#20854;&#29702;&#35770;&#22522;&#30784;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#24037;&#20855;&#24212;&#29992;&#20110;&#33655;&#20848;&#34892;&#25919;&#25968;&#25454;&#65292;&#20197;&#19977;&#31181;&#26041;&#24335;&#30740;&#31350;&#23376;&#22899;&#24809;&#32602;&#65288;CP&#65289;&#32972;&#26223;&#19979;&#30340;&#20010;&#20307;&#24322;&#36136;&#24615;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35760;&#24405;&#20102;&#20010;&#20307;&#32423;&#21035;CP&#36712;&#36857;&#30340;&#26174;&#33879;&#24322;&#36136;&#24615;&#65292;&#24378;&#35843;&#36229;&#36234;&#24179;&#22343;CP&#30340;&#37325;&#35201;&#24615;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#20351;&#29992;&#20010;&#20307;&#32423;&#21035;&#20272;&#35745;&#26469;&#26816;&#39564;&#25176;&#20799;&#26381;&#21153;&#20379;&#32473;&#25193;&#23637;&#25919;&#31574;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#25581;&#31034;&#20102;&#38750;&#32447;&#24615;&#27835;&#30103;&#25928;&#24212;&#65292;&#25361;&#25112;&#20102;&#21463;&#38480;&#20110;&#36739;&#23569;&#28789;&#27963;&#35268;&#33539;&#30340;&#20256;&#32479;&#25919;&#31574;&#35780;&#20272;&#26041;&#27861;&#12290;&#31532;&#19977;&#65292;&#25105;&#20204;&#20351;&#29992;&#20010;&#20307;&#32423;&#21035;&#20272;&#35745;&#20316;&#20026;&#22238;&#24402;&#21464;&#37327;&#26469;&#30740;&#31350;&#27597;&#22899;&#20043;&#38388;CP&#30340;&#20195;&#38469;&#24377;&#24615;&#12290;&#22312;&#35843;&#25972;&#27979;&#37327;&#35823;&#24046;&#20559;&#24046;&#20043;&#21518;&#65292;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.19563v1 Announce Type: new  Abstract: We provide a practical toolkit for analyzing effect heterogeneity in event studies. We develop an estimation algorithm and adapt existing econometric results to provide its theoretical justification. We apply these tools to Dutch administrative data to study individual heterogeneity in the child-penalty (CP) context in three ways. First, we document significant heterogeneity in the individual-level CP trajectories, emphasizing the importance of going beyond the average CP. Second, we use individual-level estimates to examine the impact of childcare supply expansion policies. Our approach uncovers nonlinear treatment effects, challenging the conventional policy evaluation methods constrained to less flexible specifications. Third, we use the individual-level estimates as a regressor on the right-hand side to study the intergenerational elasticity of the CP between mothers and daughters. After adjusting for the measurement error bias, we f
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20351;&#29992;&#32447;&#24615;&#38543;&#26426;&#24310;&#36831;&#24494;&#20998;&#26041;&#31243;&#30340;&#30701;&#26399;&#21033;&#29575;&#27169;&#22411;&#65292;&#24182;&#19988;&#32473;&#20986;&#20102;&#38646;&#24687;&#20538;&#21048;&#20215;&#26684;&#30340;&#23553;&#38381;&#24418;&#24335;&#35299;&#20915;&#26041;&#26696;&#65292;&#35777;&#26126;&#20102;&#30701;&#26399;&#21033;&#29575;&#20998;&#24067;&#20026;&#27491;&#24577;&#20998;&#24067;&#19988;&#23384;&#22312;&#31283;&#24577;&#21644;&#26497;&#38480;&#20998;&#24067;&#12290;</title><link>https://arxiv.org/abs/2402.16428</link><description>&lt;p&gt;
&#20351;&#29992;&#32447;&#24615;&#38543;&#26426;&#24310;&#36831;&#24494;&#20998;&#26041;&#31243;&#23545;&#38646;&#24687;&#20538;&#21048;&#25552;&#20986;&#20102;&#23553;&#38381;&#24418;&#24335;&#35299;&#20915;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
Closed form solution to zero coupon bond using a linear stochastic delay differential equation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16428
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20351;&#29992;&#32447;&#24615;&#38543;&#26426;&#24310;&#36831;&#24494;&#20998;&#26041;&#31243;&#30340;&#30701;&#26399;&#21033;&#29575;&#27169;&#22411;&#65292;&#24182;&#19988;&#32473;&#20986;&#20102;&#38646;&#24687;&#20538;&#21048;&#20215;&#26684;&#30340;&#23553;&#38381;&#24418;&#24335;&#35299;&#20915;&#26041;&#26696;&#65292;&#35777;&#26126;&#20102;&#30701;&#26399;&#21033;&#29575;&#20998;&#24067;&#20026;&#27491;&#24577;&#20998;&#24067;&#19988;&#23384;&#22312;&#31283;&#24577;&#21644;&#26497;&#38480;&#20998;&#24067;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#28385;&#36275;&#38543;&#26426;&#24310;&#36831;&#24494;&#20998;&#26041;&#31243;&#30340;&#30701;&#26399;&#21033;&#29575;&#27169;&#22411;&#12290;&#35813;&#27169;&#22411;&#21487;&#20197;&#34987;&#35270;&#20026;Merton&#27169;&#22411;(Merton 1970, 1973)&#25110;Vasi\v{c}ek&#27169;&#22411;(Vasi\v{c}ek 1977)&#30340;&#24310;&#36831;&#29256;&#26412;&#12290;&#20351;&#29992;&#19982;Flore&#21644;Nappo(2019)&#30456;&#21516;&#30340;&#25216;&#26415;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#20538;&#21048;&#20215;&#26684;&#26159;&#30701;&#26399;&#21033;&#29575;&#30340;&#20223;&#23556;&#20989;&#25968;&#65292;&#20854;&#31995;&#25968;&#28385;&#36275;&#19968;&#32452;&#24310;&#36831;&#24494;&#20998;&#26041;&#31243;&#12290;&#25105;&#20204;&#32473;&#20986;&#20102;&#36825;&#32452;&#24310;&#36831;&#24494;&#20998;&#26041;&#31243;&#30340;&#35299;&#26512;&#35299;&#65292;&#24471;&#21040;&#20102;&#38646;&#24687;&#20538;&#21048;&#20215;&#26684;&#30340;&#23553;&#38381;&#20844;&#24335;&#12290;&#22312;&#35813;&#27169;&#22411;&#19979;&#65292;&#25105;&#20204;&#21487;&#20197;&#23637;&#31034;&#30701;&#26399;&#21033;&#29575;&#30340;&#20998;&#24067;&#26159;&#19968;&#20010;&#27491;&#24577;&#20998;&#24067;&#65292;&#20854;&#22343;&#20540;&#21462;&#20915;&#20110;&#30701;&#26399;&#21033;&#29575;&#30340;&#36807;&#21435;&#20540;&#12290;&#22522;&#20110;K\"uchler&#21644;Mensch(1992)&#30340;&#32467;&#26524;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#24179;&#31283;&#20998;&#24067;&#21644;&#26497;&#38480;&#20998;&#24067;&#30340;&#23384;&#22312;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16428v1 Announce Type: new  Abstract: We present a short rate model that satisfies a stochastic delay differential equation. The model can be considered a delayed version of the Merton model (Merton 1970, 1973) or the Vasi\v{c}ek model (Vasi\v{c}ek 1977). Using the same technique as the one used by Flore and Nappo (2019), we show that the bond price is an affine function of the short rate, whose coefficients satisfy a system of delay differential equations. We give an analytical solution to this system of delay differential equations, obtaining a closed formula for the zero coupon bond price. Under this model, we can show that the distribution of the short rate is a normal distribution whose mean depends on past values of the short rate. Based on the results of K\"uchler and Mensch (1992), we prove the existence of stationary and limiting distributions.
&lt;/p&gt;</description></item></channel></rss>