<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#36890;&#36807;&#24314;&#27169;&#20195;&#29702;&#30340;&#34892;&#20026;&#65292;&#30740;&#31350;&#20102;&#23398;&#20064;&#30340;&#20869;&#22312;&#38556;&#30861;&#12290;&#23454;&#39564;&#21457;&#29616;&#65292;&#22312;&#26576;&#20123;&#28216;&#25103;&#20013;&#65292;&#22686;&#21152;&#20934;&#30830;&#24615;&#20250;&#23548;&#33268;&#19981;&#31283;&#23450;&#30340;&#26368;&#20339;&#21453;&#24212;&#21160;&#24577;&#12290;&#36890;&#36807;&#23558;&#23398;&#20064;&#30340;&#38556;&#30861;&#23450;&#20041;&#20026;&#20445;&#25345;&#26368;&#20339;&#21453;&#24212;&#21160;&#24577;&#31283;&#23450;&#25152;&#38656;&#30340;&#26368;&#23567;&#22122;&#22768;&#27700;&#24179;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;limitQR&#22343;&#34913;&#12290;&#21516;&#26102;&#65292;&#35752;&#35770;&#20102;&#31574;&#30053;&#38480;&#21046;&#22312;&#20943;&#23569;&#25110;&#22686;&#21152;&#23398;&#20064;&#38556;&#30861;&#26041;&#38754;&#30340;&#20316;&#29992;&#12290;</title><link>http://arxiv.org/abs/2306.16904</link><description>&lt;p&gt;
&#23398;&#20064;&#30340;&#20869;&#22312;&#38556;&#30861;
&lt;/p&gt;
&lt;p&gt;
Endogenous Barriers to Learning. (arXiv:2306.16904v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.16904
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#24314;&#27169;&#20195;&#29702;&#30340;&#34892;&#20026;&#65292;&#30740;&#31350;&#20102;&#23398;&#20064;&#30340;&#20869;&#22312;&#38556;&#30861;&#12290;&#23454;&#39564;&#21457;&#29616;&#65292;&#22312;&#26576;&#20123;&#28216;&#25103;&#20013;&#65292;&#22686;&#21152;&#20934;&#30830;&#24615;&#20250;&#23548;&#33268;&#19981;&#31283;&#23450;&#30340;&#26368;&#20339;&#21453;&#24212;&#21160;&#24577;&#12290;&#36890;&#36807;&#23558;&#23398;&#20064;&#30340;&#38556;&#30861;&#23450;&#20041;&#20026;&#20445;&#25345;&#26368;&#20339;&#21453;&#24212;&#21160;&#24577;&#31283;&#23450;&#25152;&#38656;&#30340;&#26368;&#23567;&#22122;&#22768;&#27700;&#24179;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;limitQR&#22343;&#34913;&#12290;&#21516;&#26102;&#65292;&#35752;&#35770;&#20102;&#31574;&#30053;&#38480;&#21046;&#22312;&#20943;&#23569;&#25110;&#22686;&#21152;&#23398;&#20064;&#38556;&#30861;&#26041;&#38754;&#30340;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21160;&#26426;&#22312;&#20110;&#32570;&#20047;&#32463;&#39564;&#20250;&#23548;&#33268;&#38169;&#35823;&#65292;&#32780;&#32463;&#39564;&#21487;&#20197;&#20943;&#23569;&#36825;&#20123;&#38169;&#35823;&#65292;&#25105;&#20204;&#20351;&#29992;&#38543;&#26426;&#36873;&#25321;&#27169;&#22411;&#26469;&#24314;&#27169;&#20195;&#29702;&#30340;&#34892;&#20026;&#65292;&#23558;&#20854;&#36873;&#25321;&#30340;&#20934;&#30830;&#24615;&#35774;&#23450;&#20026;&#20869;&#29983;&#21464;&#37327;&#12290;&#22312;&#26576;&#20123;&#28216;&#25103;&#20013;&#65292;&#22686;&#21152;&#20934;&#30830;&#24615;&#26377;&#21487;&#33021;&#23548;&#33268;&#19981;&#31283;&#23450;&#30340;&#26368;&#20339;&#21453;&#24212;&#21160;&#24577;&#12290;&#25105;&#20204;&#23558;&#23398;&#20064;&#30340;&#38556;&#30861;&#23450;&#20041;&#20026;&#20445;&#25345;&#26368;&#20339;&#21453;&#24212;&#21160;&#24577;&#31283;&#23450;&#25152;&#38656;&#30340;&#26368;&#23567;&#22122;&#22768;&#27700;&#24179;&#12290;&#20351;&#29992;&#36923;&#36753;&#37327;&#21270;&#21709;&#24212;&#65292;&#36825;&#23450;&#20041;&#20102;&#19968;&#20010;limitQR&#22343;&#34913;&#12290;&#25105;&#20204;&#23558;&#35813;&#27010;&#24565;&#24212;&#29992;&#20110;&#34568;&#34467;&#12289;&#26053;&#34892;&#32773;&#22256;&#22659;&#21644;11-20&#38065;&#27714;&#28216;&#25103;&#65292;&#20197;&#21450;&#19968;&#20215;&#21644;&#20840;&#20184;&#25293;&#21334;&#65292;&#24182;&#35752;&#35770;&#31574;&#30053;&#38480;&#21046;&#22312;&#20943;&#23569;&#25110;&#22686;&#21152;&#23398;&#20064;&#38556;&#30861;&#26041;&#38754;&#30340;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Motivated by the idea that lack of experience is a source of errors but that experience should reduce them, we model agents' behavior using a stochastic choice model, leaving endogenous the accuracy of their choice. In some games, increased accuracy is conducive to unstable best-response dynamics. We define the barrier to learning as the minimum level of noise which keeps the best-response dynamic stable. Using logit Quantal Response, this defines a limitQR Equilibrium. We apply the concept to centipede, travelers' dilemma, and 11-20 money-request games and to first-price and all-pay auctions, and discuss the role of strategy restrictions in reducing or amplifying barriers to learning.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#37327;&#23376;&#33945;&#29305;&#21345;&#32599;&#31639;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#39640;&#32500;Black-Scholes PDE&#30340;&#39640;&#32500;&#26399;&#26435;&#23450;&#20215;&#65292;&#20854;&#22797;&#26434;&#24230;&#34987;&#22810;&#39033;&#24335;&#22320;&#38480;&#21046;&#65292;&#20811;&#26381;&#20102;&#32500;&#24230;&#35781;&#21650;&#12290;</title><link>http://arxiv.org/abs/2301.09241</link><description>&lt;p&gt;
&#37327;&#23376;&#33945;&#29305;&#21345;&#32599;&#31639;&#27861;&#22312;&#37329;&#34701;&#20013;&#39640;&#32500;&#26399;&#26435;&#23450;&#20215;&#20013;&#35299;&#20915;Black-Scholes PDE&#21450;&#20854;&#20811;&#26381;&#32500;&#24230;&#35781;&#21650;&#30340;&#35777;&#26126;
&lt;/p&gt;
&lt;p&gt;
Quantum Monte Carlo algorithm for solving Black-Scholes PDEs for high-dimensional option pricing in finance and its proof of overcoming the curse of dimensionality. (arXiv:2301.09241v2 [quant-ph] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.09241
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#37327;&#23376;&#33945;&#29305;&#21345;&#32599;&#31639;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#39640;&#32500;Black-Scholes PDE&#30340;&#39640;&#32500;&#26399;&#26435;&#23450;&#20215;&#65292;&#20854;&#22797;&#26434;&#24230;&#34987;&#22810;&#39033;&#24335;&#22320;&#38480;&#21046;&#65292;&#20811;&#26381;&#20102;&#32500;&#24230;&#35781;&#21650;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a quantum Monte Carlo algorithm for high-dimensional option pricing by solving high-dimensional Black-Scholes PDEs with correlation, and proves that its computational complexity is polynomially bounded in the space dimension and the reciprocal of the prescribed accuracy, overcoming the curse of dimensionality.
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#31181;&#37327;&#23376;&#33945;&#29305;&#21345;&#32599;&#31639;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#20855;&#26377;&#30456;&#20851;&#24615;&#30340;&#39640;&#32500;Black-Scholes PDE&#30340;&#39640;&#32500;&#26399;&#26435;&#23450;&#20215;&#12290;&#26399;&#26435;&#30340;&#25903;&#20184;&#20989;&#25968;&#20026;&#19968;&#33324;&#24418;&#24335;&#65292;&#21482;&#38656;&#35201;&#36830;&#32493;&#19988;&#20998;&#27573;&#20223;&#23556;&#65288;CPWA&#65289;&#65292;&#28085;&#30422;&#20102;&#37329;&#34701;&#20013;&#20351;&#29992;&#30340;&#22823;&#22810;&#25968;&#30456;&#20851;&#25903;&#20184;&#20989;&#25968;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#31639;&#27861;&#30340;&#20005;&#26684;&#35823;&#24046;&#20998;&#26512;&#21644;&#22797;&#26434;&#24230;&#20998;&#26512;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#31639;&#27861;&#30340;&#35745;&#31639;&#22797;&#26434;&#24230;&#22312;PDE&#30340;&#31354;&#38388;&#32500;&#24230;$d$&#21644;&#25152;&#38656;&#31934;&#24230;$\varepsilon$&#30340;&#20498;&#25968;&#20013;&#34987;&#22810;&#39033;&#24335;&#22320;&#38480;&#21046;&#65292;&#20174;&#32780;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#37327;&#23376;&#33945;&#29305;&#21345;&#32599;&#31639;&#27861;&#19981;&#20250;&#21463;&#21040;&#32500;&#24230;&#35781;&#21650;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper we provide a quantum Monte Carlo algorithm to solve high-dimensional Black-Scholes PDEs with correlation for high-dimensional option pricing. The payoff function of the option is of general form and is only required to be continuous and piece-wise affine (CPWA), which covers most of the relevant payoff functions used in finance. We provide a rigorous error analysis and complexity analysis of our algorithm. In particular, we prove that the computational complexity of our algorithm is bounded polynomially in the space dimension $d$ of the PDE and the reciprocal of the prescribed accuracy $\varepsilon$ and so demonstrate that our quantum Monte Carlo algorithm does not suffer from the curse of dimensionality.
&lt;/p&gt;</description></item></channel></rss>