<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#30340;&#35777;&#26126;&#65292;&#36890;&#36807;&#26500;&#36896;&#23450;&#29702;&#26469;&#30830;&#23450;&#26032;&#23450;&#20041;&#20013;&#30340;&#25928;&#29992;&#26354;&#32447;&#24418;&#29366;&#12290;&#19982;&#26631;&#20934;&#29702;&#35770;&#19981;&#21516;&#65292;&#26032;&#23450;&#20041;&#20013;&#20986;&#29616;&#20102;&#20005;&#26684;&#20985;&#24615;&#12289;&#20005;&#26684;&#20984;&#24615;&#25110;&#32447;&#24615;&#30340;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2309.03003</link><description>&lt;p&gt;
&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#30340;&#35777;&#26126;
&lt;/p&gt;
&lt;p&gt;
Proofs for the New Definitions in Financial Markets. (arXiv:2309.03003v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.03003
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#30340;&#35777;&#26126;&#65292;&#36890;&#36807;&#26500;&#36896;&#23450;&#29702;&#26469;&#30830;&#23450;&#26032;&#23450;&#20041;&#20013;&#30340;&#25928;&#29992;&#26354;&#32447;&#24418;&#29366;&#12290;&#19982;&#26631;&#20934;&#29702;&#35770;&#19981;&#21516;&#65292;&#26032;&#23450;&#20041;&#20013;&#20986;&#29616;&#20102;&#20005;&#26684;&#20985;&#24615;&#12289;&#20005;&#26684;&#20984;&#24615;&#25110;&#32447;&#24615;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26500;&#36896;&#23450;&#29702;&#21487;&#20197;&#24110;&#21161;&#30830;&#23450;&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#20013;&#26500;&#25104;&#30340;&#26576;&#20123;&#25928;&#29992;&#26354;&#32447;&#30340;&#24418;&#29366;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#20026;&#36825;&#20123;&#23450;&#29702;&#25552;&#20379;&#35777;&#26126;&#12290;&#23613;&#31649;&#39118;&#38505;&#21388;&#24694;&#12289;&#39118;&#38505;&#29233;&#22909;&#21644;&#39118;&#38505;&#20013;&#24615;&#31561;&#26415;&#35821;&#22312;&#26631;&#20934;&#29702;&#35770;&#20013;&#20998;&#21035;&#31561;&#21516;&#20110;&#20005;&#26684;&#20985;&#24615;&#12289;&#20005;&#26684;&#20984;&#24615;&#21644;&#32447;&#24615;&#65292;&#20294;&#26576;&#20123;&#26032;&#23450;&#20041;&#28385;&#36275;&#20005;&#26684;&#20985;&#24615;&#25110;&#20005;&#26684;&#20984;&#24615;&#65292;&#25110;&#32447;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Constructing theorems can help to determine the shape of certain utility curves that make up the new definitions in financial markets. The aim of this study was to present proofs for these theorems. Although the terms of risk-averse, risk-loving, and risk-neutral are equivalent to strict concavity, strict convexity, and linearity, respectively, in standard theory, certain new definitions satisfy strict concavity or strict convexity, or linearity.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26368;&#20248;&#36755;&#36816;&#26041;&#27861;&#35299;&#20915;&#22810;&#20998;&#20301;&#25968;&#23545;&#20914;&#38382;&#39064;&#65292;&#22312;&#38750;&#32447;&#24615;&#24066;&#22330;&#20013;&#65292;&#23558;&#35813;&#38382;&#39064;&#37325;&#26500;&#20026;&#19968;&#20010;&#33945;&#29305;&#21345;&#32599;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#65292;&#22312;&#32447;&#24615;&#24066;&#22330;&#20013;&#24341;&#20837;&#20102;&#21322;&#31163;&#25955;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#65292;&#24182;&#35774;&#35745;&#20102;&#22522;&#20110;SGA&#31639;&#27861;&#30340;&#25968;&#20540;&#26041;&#27861;&#26469;&#35745;&#31639;&#22810;&#20998;&#20301;&#25968;&#23545;&#20914;&#20215;&#26684;&#12290;</title><link>http://arxiv.org/abs/2308.01121</link><description>&lt;p&gt;
&#22810;&#20998;&#20301;&#25968;&#23545;&#20914;&#38382;&#39064;&#30340;&#26368;&#20248;&#36755;&#36816;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
An optimal transport approach for the multiple quantile hedging problem. (arXiv:2308.01121v1 [math.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01121
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26368;&#20248;&#36755;&#36816;&#26041;&#27861;&#35299;&#20915;&#22810;&#20998;&#20301;&#25968;&#23545;&#20914;&#38382;&#39064;&#65292;&#22312;&#38750;&#32447;&#24615;&#24066;&#22330;&#20013;&#65292;&#23558;&#35813;&#38382;&#39064;&#37325;&#26500;&#20026;&#19968;&#20010;&#33945;&#29305;&#21345;&#32599;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#65292;&#22312;&#32447;&#24615;&#24066;&#22330;&#20013;&#24341;&#20837;&#20102;&#21322;&#31163;&#25955;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#65292;&#24182;&#35774;&#35745;&#20102;&#22522;&#20110;SGA&#31639;&#27861;&#30340;&#25968;&#20540;&#26041;&#27861;&#26469;&#35745;&#31639;&#22810;&#20998;&#20301;&#25968;&#23545;&#20914;&#20215;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#22810;&#20998;&#20301;&#25968;&#23545;&#20914;&#38382;&#39064;&#65292;&#36825;&#26159;&#19968;&#31867;&#21253;&#21547;&#20998;&#20301;&#25968;&#23545;&#20914;&#38382;&#39064;&#65288;F{\"o}llmer \&amp; Leukert 1999&#65289;&#21644;PnL&#21305;&#37197;&#38382;&#39064;&#65288;Bouchard \&amp; Vu 2012&#65289;&#20316;&#20026;&#29305;&#20363;&#30340;&#37096;&#20998;&#23545;&#20914;&#38382;&#39064;&#12290;&#22312;&#38750;&#32447;&#24615;&#23436;&#20840;&#24066;&#22330;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#20010;&#38382;&#39064;&#21487;&#20197;&#37325;&#26500;&#20026;&#19968;&#31181;&#33945;&#29305;&#21345;&#32599;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#12290;&#21033;&#29992;&#36825;&#20010;&#35266;&#23519;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#35813;&#38382;&#39064;&#30340;Kantorovitch&#29256;&#26412;&#65292;&#24182;&#35777;&#26126;&#20102;&#20004;&#20010;&#38382;&#39064;&#30340;&#20215;&#20540;&#26159;&#30456;&#31561;&#30340;&#12290;&#22312;&#32447;&#24615;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#24471;&#21040;&#22810;&#20998;&#20301;&#25968;&#23545;&#20914;&#38382;&#39064;&#21487;&#20197;&#30475;&#20316;&#26159;&#19968;&#31181;&#21322;&#31163;&#25955;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#65292;&#24182;&#36827;&#19968;&#27493;&#24341;&#20837;&#20102;&#23545;&#20598;&#38382;&#39064;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#35777;&#26126;&#19981;&#23384;&#22312;&#23545;&#20598;&#38388;&#38553;&#65292;&#20351;&#25105;&#20204;&#33021;&#22815;&#35774;&#35745;&#22522;&#20110;SGA&#31639;&#27861;&#30340;&#25968;&#20540;&#26041;&#27861;&#26469;&#35745;&#31639;&#22810;&#20998;&#20301;&#25968;&#23545;&#20914;&#20215;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the multiple quantile hedging problem, which is a class of partial hedging problems containing as special examples the quantile hedging problem (F{\"o}llmer \&amp; Leukert 1999) and the PnL matching problem (introduced in Bouchard \&amp; Vu 2012). In complete non-linear markets, we show that the problem can be reformulated as a kind of Monge optimal transport problem. Using this observation, we introduce a Kantorovitch version of the problem and prove that the value of both problems coincide. In the linear case, we thus obtain that the multiple quantile hedging problem can be seen as a semi-discrete optimal transport problem, for which we further introduce the dual problem. We then prove that there is no duality gap, allowing us to design a numerical method based on SGA algorithms to compute the multiple quantile hedging price.
&lt;/p&gt;</description></item></channel></rss>