<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#23558;&#19987;&#21033;&#21644;&#30693;&#35782;&#20135;&#26435;&#36164;&#20135;&#20316;&#20026;NFT&#30340;&#20851;&#38190;&#25216;&#26415;&#21644;&#25361;&#25112;&#65292;NFT&#22312;&#30693;&#35782;&#20135;&#26435;&#39046;&#22495;&#20855;&#26377;&#36739;&#22823;&#28508;&#21147;&#12290;</title><link>http://arxiv.org/abs/2304.10490</link><description>&lt;p&gt;
&#19987;&#21033;&#21644;&#30693;&#35782;&#20135;&#26435;&#36164;&#20135;&#38750;&#21516;&#36136;&#21270;&#20195;&#24065;&#21270;&#65306;&#20851;&#38190;&#25216;&#26415;&#19982;&#25361;&#25112;
&lt;/p&gt;
&lt;p&gt;
Patents and intellectual property assets as non-fungible tokens: key technologies and challenges. (arXiv:2304.10490v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10490
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#23558;&#19987;&#21033;&#21644;&#30693;&#35782;&#20135;&#26435;&#36164;&#20135;&#20316;&#20026;NFT&#30340;&#20851;&#38190;&#25216;&#26415;&#21644;&#25361;&#25112;&#65292;NFT&#22312;&#30693;&#35782;&#20135;&#26435;&#39046;&#22495;&#20855;&#26377;&#36739;&#22823;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#21435;&#20013;&#24515;&#21270;&#37329;&#34701;&#30340;&#29190;&#21457;&#24335;&#21457;&#23637;&#65292;&#25105;&#20204;&#30446;&#30585;&#20102;&#21508;&#31181;&#36164;&#20135;&#30340;&#20195;&#24065;&#21270;&#65292;&#21253;&#25324;&#32929;&#26435;&#12289;&#22522;&#37329;&#12289;&#20538;&#21153;&#21644;&#25151;&#22320;&#20135;&#31561;&#12290;&#21033;&#29992;&#21306;&#22359;&#38142;&#25216;&#26415;&#65292;&#25968;&#23383;&#36164;&#20135;&#34987;&#24191;&#27867;&#20998;&#20026;&#21487;&#20114;&#25442;&#21644;&#38750;&#21487;&#20114;&#25442;&#20195;&#24065;&#65288;NFT&#65289;&#12290;&#22312;&#36825;&#37324;&#65292;&#38750;&#21516;&#36136;&#21270;&#20195;&#24065;&#26159;&#25351;&#20855;&#26377;&#29420;&#29305;&#19988;&#19981;&#21487;&#26367;&#20195;&#23646;&#24615;&#30340;&#20195;&#24065;&#12290; NFT&#24050;&#24191;&#21463;&#20851;&#27880;&#65292;&#20854;&#21327;&#35758;&#12289;&#26631;&#20934;&#21644;&#24212;&#29992;&#27491;&#22312;&#21576;&#25351;&#25968;&#32423;&#21457;&#23637;&#12290;&#23427;&#24050;&#25104;&#21151;&#24212;&#29992;&#20110;&#25968;&#23383;&#24187;&#24819;&#33402;&#26415;&#21697;&#12289;&#28216;&#25103;&#12289;&#34255;&#21697;&#31561;&#12290;&#28982;&#32780;&#65292;&#22312;&#35832;&#22914;&#30693;&#35782;&#20135;&#26435;&#31561;&#38382;&#39064;&#19978;&#65292;&#21033;&#29992;NFT&#30340;&#30740;&#31350;&#23578;&#19981;&#36275;&#22815;&#12290;&#30003;&#35831;&#19987;&#21033;&#21644;&#21830;&#26631;&#19981;&#20165;&#26159;&#19968;&#20010;&#32791;&#26102;&#36153;&#21147;&#30340;&#36807;&#31243;&#65292;&#32780;&#19988;&#25104;&#26412;&#39640;&#26114;&#12290; NFT&#22312;&#30693;&#35782;&#20135;&#26435;&#39046;&#22495;&#20855;&#26377; considerable&#65288;&#22823;&#23567;&#21487;&#35266;&#65289; &#30340;&#28508;&#21147;&#12290;&#23427;&#21487;&#20197;&#20419;&#36827;&#36879;&#26126;&#24230;&#21644;&#27969;&#21160;&#24615;&#65292;&#24182;&#21521;&#26088;&#22312;&#39640;&#25928;&#21830;&#19994;&#21270;&#20182;&#20204;&#30340;&#21457;&#26126;&#30340;&#21019;&#26032;&#32773;&#24320;&#25918;&#24066;&#22330;&#12290;&#26412;&#25991;&#30340;&#20027;&#35201;&#30446;&#30340;&#26159;&#25506;&#35752;&#20197;&#19987;&#21033;&#21644;&#30693;&#35782;&#20135;&#26435;&#36164;&#20135;&#30340;&#38750;&#21516;&#36136;&#21270;&#20195;&#24065;&#21270;&#20316;&#20026;NFT&#30340;&#20851;&#38190;&#25216;&#26415;&#21644;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
With the explosive development of decentralized finance, we witness a phenomenal growth in tokenization of all kinds of assets, including equity, funds, debt, and real estate. By taking advantage of blockchain technology, digital assets are broadly grouped into fungible and non-fungible tokens (NFT). Here non-fungible tokens refer to those with unique and non-substitutable properties. NFT has widely attracted attention, and its protocols, standards, and applications are developing exponentially. It has been successfully applied to digital fantasy artwork, games, collectibles, etc. However, there is a lack of research in utilizing NFT in issues such as Intellectual Property. Applying for a patent and trademark is not only a time-consuming and lengthy process but also costly. NFT has considerable potential in the intellectual property domain. It can promote transparency and liquidity and open the market to innovators who aim to commercialize their inventions efficiently. The main objecti
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026; C-qGAN &#30340;&#26694;&#26550;&#65292;&#21033;&#29992;&#37327;&#23376;&#30005;&#36335;&#32467;&#26500;&#23454;&#29616;&#20102;&#26377;&#25928;&#30340;&#29366;&#24577;&#20934;&#22791;&#36807;&#31243;&#65292;&#21487;&#20197;&#21033;&#29992;&#35813;&#26041;&#27861;&#21152;&#36895;&#33945;&#29305;&#21345;&#32599;&#20998;&#26512;&#31561;&#31639;&#27861;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#20122;&#24335;&#26399;&#26435;&#34893;&#29983;&#21697;&#23450;&#20215;&#30340;&#20219;&#21153;&#20013;&#12290;</title><link>http://arxiv.org/abs/2304.10382</link><description>&lt;p&gt;
&#23398;&#20064;&#38543;&#26426;&#36807;&#31243;&#30340;&#26377;&#26465;&#20214;&#29983;&#25104;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Conditional Generative Models for Learning Stochastic Processes. (arXiv:2304.10382v1 [quant-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10382
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026; C-qGAN &#30340;&#26694;&#26550;&#65292;&#21033;&#29992;&#37327;&#23376;&#30005;&#36335;&#32467;&#26500;&#23454;&#29616;&#20102;&#26377;&#25928;&#30340;&#29366;&#24577;&#20934;&#22791;&#36807;&#31243;&#65292;&#21487;&#20197;&#21033;&#29992;&#35813;&#26041;&#27861;&#21152;&#36895;&#33945;&#29305;&#21345;&#32599;&#20998;&#26512;&#31561;&#31639;&#27861;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#20122;&#24335;&#26399;&#26435;&#34893;&#29983;&#21697;&#23450;&#20215;&#30340;&#20219;&#21153;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#23398;&#20064;&#22810;&#27169;&#24577;&#20998;&#24067;&#30340;&#26694;&#26550;&#65292;&#31216;&#20026;&#26465;&#20214;&#37327;&#23376;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65288;C-qGAN&#65289;&#12290;&#31070;&#32463;&#32593;&#32476;&#32467;&#26500;&#20005;&#26684;&#37319;&#29992;&#37327;&#23376;&#30005;&#36335;&#65292;&#22240;&#27492;&#34987;&#35777;&#26126;&#33021;&#22815;&#27604;&#24403;&#21069;&#30340;&#26041;&#27861;&#26356;&#26377;&#25928;&#22320;&#34920;&#31034;&#29366;&#24577;&#20934;&#22791;&#36807;&#31243;&#12290;&#36825;&#31181;&#26041;&#27861;&#26377;&#28508;&#21147;&#21152;&#36895;&#33945;&#29305;&#21345;&#32599;&#20998;&#26512;&#31561;&#31639;&#27861;&#12290;&#29305;&#21035;&#22320;&#65292;&#22312;&#23637;&#31034;&#20102;&#32593;&#32476;&#22312;&#23398;&#20064;&#20219;&#21153;&#20013;&#30340;&#26377;&#25928;&#24615;&#21518;&#65292;&#23558;&#35813;&#25216;&#26415;&#24212;&#29992;&#20110;&#23450;&#20215;&#20122;&#24335;&#26399;&#26435;&#34893;&#29983;&#21697;&#65292;&#20026;&#26410;&#26469;&#30740;&#31350;&#20854;&#20182;&#36335;&#24452;&#30456;&#20851;&#26399;&#26435;&#25171;&#19979;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;
A framework to learn a multi-modal distribution is proposed, denoted as the Conditional Quantum Generative Adversarial Network (C-qGAN). The neural network structure is strictly within a quantum circuit and, as a consequence, is shown to represents a more efficient state preparation procedure than current methods. This methodology has the potential to speed-up algorithms, such as Monte Carlo analysis. In particular, after demonstrating the effectiveness of the network in the learning task, the technique is applied to price Asian option derivatives, providing the foundation for further research on other path-dependent options.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26497;&#20540;&#29702;&#35770;&#30340;&#20272;&#35745;&#22120;&#30340;&#31995;&#32479;&#24615;&#39118;&#38505;&#39044;&#27979;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#24314;&#31435;MES&#39044;&#27979;&#30340;&#28176;&#36817;&#27491;&#24577;&#24615;&#23637;&#31034;&#20102;&#20854;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2304.10349</link><description>&lt;p&gt;
&#26497;&#31471;&#31995;&#32479;&#24615;&#39118;&#38505;&#39044;&#27979;&#20013;&#30340;&#20272;&#20540;&#39118;&#38505;
&lt;/p&gt;
&lt;p&gt;
The Estimation Risk in Extreme Systemic Risk Forecasts. (arXiv:2304.10349v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10349
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26497;&#20540;&#29702;&#35770;&#30340;&#20272;&#35745;&#22120;&#30340;&#31995;&#32479;&#24615;&#39118;&#38505;&#39044;&#27979;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#24314;&#31435;MES&#39044;&#27979;&#30340;&#28176;&#36817;&#27491;&#24577;&#24615;&#23637;&#31034;&#20102;&#20854;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31995;&#32479;&#24615;&#39118;&#38505;&#24230;&#37327;&#24050;&#34987;&#35777;&#26126;&#23545;&#37329;&#34701;&#21361;&#26426;&#21644;&#23454;&#38469;&#27963;&#21160;&#19979;&#38477;&#20855;&#26377;&#39044;&#27979;&#20316;&#29992;&#12290;&#22240;&#27492;&#65292;&#22312;&#37329;&#34701;&#21644;&#32463;&#27982;&#23398;&#20013;&#36827;&#34892;&#39044;&#27979;&#26159;&#33267;&#20851;&#37325;&#35201;&#30340;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26497;&#20540;&#29702;&#35770;&#30340;&#20272;&#35745;&#22120;&#65292;&#38024;&#23545;&#27531;&#24046;&#35745;&#31639;&#31995;&#32479;&#39118;&#38505;&#30340;&#19968;&#31181;&#26032;&#30340;&#31995;&#32479;&#24615;&#39118;&#38505;&#39044;&#27979;&#26041;&#27861;&#65292;&#21363;&#27979;&#24230;&#20026;&#36793;&#38469;&#39044;&#26399;&#25439;&#22833;&#30340;&#31995;&#32479;&#39118;&#38505;&#12290;&#25105;&#20204;&#36890;&#36807;&#24314;&#31435;MES&#39044;&#27979;&#30340;&#28176;&#36817;&#27491;&#24577;&#24615;&#26469;&#23637;&#31034;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#65292;&#25105;&#20204;&#30830;&#35748;&#20102;&#38544;&#21547;&#30340;MES&#39044;&#27979;&#21306;&#38388;&#22312;&#26377;&#38480;&#26679;&#26412;&#20013;&#30340;&#35206;&#30422;&#29575;&#33391;&#22909;&#12290; &#32654;&#22269;&#20027;&#35201;&#38134;&#34892;&#30340;&#23454;&#35777;&#24212;&#29992;&#35828;&#26126;&#20102;MES&#39044;&#27979;&#31934;&#24230;&#22312;&#26102;&#38388;&#19978;&#30340;&#26174;&#33879;&#21464;&#21270;&#65292;&#24182;&#20174;&#30417;&#31649;&#30340;&#35282;&#24230;&#25506;&#35752;&#20102;&#36825;&#19968;&#20107;&#23454;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Systemic risk measures have been shown to be predictive of financial crises and declines in real activity. Thus, forecasting them is of major importance in finance and economics. In this paper, we propose a new forecasting method for systemic risk as measured by the marginal expected shortfall (MES). It is based on first de-volatilizing the observations and, then, calculating systemic risk for the residuals using an estimator based on extreme value theory. We show the validity of the method by establishing the asymptotic normality of the MES forecasts. The good finite-sample coverage of the implied MES forecast intervals is confirmed in simulations. An empirical application to major US banks illustrates the significant time variation in the precision of MES forecasts, and explores the implications of this fact from a regulatory perspective.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#31867;&#20284;&#20110;&#23454;&#29289;&#26399;&#26435;&#30340;&#27169;&#22411;&#65292;&#20197;&#25429;&#25417;&#29615;&#22659;&#25919;&#31574;&#37319;&#29992;&#20013;&#30340;&#20004;&#23618;&#19981;&#30830;&#23450;&#24615;&#12290;&#20915;&#31574;&#32773;&#33021;&#22815;&#36890;&#36807;&#36319;&#36394;&#25104;&#26412;&#30340;&#23454;&#38469;&#28436;&#21464;&#26469;&#23398;&#20064;&#26410;&#30693;&#30340;&#28418;&#31227;&#65292;&#24182;&#24418;&#25104;&#21518;&#39564;&#21160;&#24577;&#20449;&#24565;&#20854;&#30495;&#27491;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2304.10344</link><description>&lt;p&gt;
&#29615;&#22659;&#25919;&#31574;&#37319;&#29992;&#20013;&#30340;&#19981;&#30830;&#23450;&#24615;&#65306;&#23545;&#19981;&#21487;&#39044;&#27979;&#30340;&#31038;&#20250;&#32463;&#27982;&#25104;&#26412;&#30340;&#36125;&#21494;&#26031;&#23398;&#20064;(arXiv:2304.10344v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
Uncertainty over Uncertainty in Environmental Policy Adoption: Bayesian Learning of Unpredictable Socioeconomic Costs. (arXiv:2304.10344v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10344
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#31867;&#20284;&#20110;&#23454;&#29289;&#26399;&#26435;&#30340;&#27169;&#22411;&#65292;&#20197;&#25429;&#25417;&#29615;&#22659;&#25919;&#31574;&#37319;&#29992;&#20013;&#30340;&#20004;&#23618;&#19981;&#30830;&#23450;&#24615;&#12290;&#20915;&#31574;&#32773;&#33021;&#22815;&#36890;&#36807;&#36319;&#36394;&#25104;&#26412;&#30340;&#23454;&#38469;&#28436;&#21464;&#26469;&#23398;&#20064;&#26410;&#30693;&#30340;&#28418;&#31227;&#65292;&#24182;&#24418;&#25104;&#21518;&#39564;&#21160;&#24577;&#20449;&#24565;&#20854;&#30495;&#27491;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27745;&#26579;&#30340;&#31038;&#20250;&#32463;&#27982;&#24433;&#21709;&#33258;&#28982;&#32780;&#28982;&#22320;&#20276;&#38543;&#30528;&#19981;&#30830;&#23450;&#24615;&#65292;&#20363;&#22914;&#65292;&#25490;&#25918;&#20943;&#23569;&#30340;&#26032;&#25216;&#26415;&#21457;&#23637;&#25110;&#20154;&#21475;&#21464;&#21270;&#12290;&#27492;&#22806;&#65292;&#29615;&#22659;&#30772;&#22351;&#26410;&#26469;&#25104;&#26412;&#30340;&#36235;&#21183;&#26159;&#26410;&#30693;&#30340;&#65306;&#20840;&#29699;&#21464;&#26262;&#26159;&#21542;&#21344;&#20027;&#23548;&#22320;&#20301;&#65292;&#36824;&#26159;&#25216;&#26415;&#36827;&#27493;&#20250;&#21344;&#25454;&#20027;&#23548;&#22320;&#20301;&#65311;&#20107;&#23454;&#19978;&#65292;&#25105;&#20204;&#19981;&#30693;&#36947;&#21738;&#31181;&#24773;&#20917;&#20250;&#23454;&#29616;&#65292;&#31185;&#23398;&#30028;&#30340;&#36777;&#35770;&#20173;&#28982;&#23384;&#22312;&#12290;&#26412;&#25991;&#36890;&#36807;&#24320;&#21457;&#19968;&#20010;&#31867;&#20284;&#20110;&#23454;&#29289;&#26399;&#26435;&#30340;&#27169;&#22411;&#65292;&#25429;&#25417;&#36825;&#20004;&#23618;&#19981;&#30830;&#23450;&#24615;&#12290;&#22312;&#35813;&#27169;&#22411;&#20013;&#65292;&#20915;&#31574;&#32773;&#30340;&#30446;&#26631;&#26159;&#22312;&#24403;&#21069;&#30340;&#25490;&#25918;&#29575;&#20013;&#37319;&#21462;&#19968;&#27425;&#24615;&#26114;&#36149;&#30340;&#20943;&#23569;&#65292;&#24403;&#27745;&#26579;&#30340;&#31038;&#20250;&#32463;&#27982;&#25104;&#26412;&#30340;&#38543;&#26426;&#21160;&#24577;&#21463;&#21040;&#24067;&#26391;&#36816;&#21160;&#30340;&#20914;&#20987;&#26102;&#65292;&#28418;&#31227;&#26159;&#19981;&#21487;&#35266;&#23519;&#30340;&#38543;&#26426;&#21464;&#37327;&#12290;&#36890;&#36807;&#36319;&#36394;&#25104;&#26412;&#30340;&#23454;&#38469;&#28436;&#21464;&#65292;&#20915;&#31574;&#32773;&#33021;&#22815;&#23398;&#20064;&#26410;&#30693;&#30340;&#28418;&#31227;&#65292;&#24182;&#24418;&#25104;&#21518;&#39564;&#21160;&#24577;&#20449;&#24565;&#20854;&#30495;&#27491;&#20215;&#20540;&#12290;&#30001;&#27492;&#20135;&#29983;&#30340;&#20915;&#31574;&#26102;&#26426;&#38382;&#39064;&#20844;&#21496;
&lt;/p&gt;
&lt;p&gt;
The socioeconomic impact of pollution naturally comes with uncertainty due to, e.g., current new technological developments in emissions' abatement or demographic changes. On top of that, the trend of the future costs of the environmental damage is unknown: Will global warming dominate or technological advancements prevail? The truth is that we do not know which scenario will be realised and the scientific debate is still open. This paper captures those two layers of uncertainty by developing a real-options-like model in which a decision maker aims at adopting a once-and-for-all costly reduction in the current emissions rate, when the stochastic dynamics of the socioeconomic costs of pollution are subject to Brownian shocks and the drift is an unobservable random variable. By keeping track of the actual evolution of the costs, the decision maker is able to learn the unknown drift and to form a posterior dynamic belief of its true value. The resulting decision maker's timing problem boi
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#20998;&#20139;&#20102;&#20316;&#32773;&#20851;&#20110;&#20154;&#24037;&#26234;&#33021;&#21487;&#33021;&#23545;&#36164;&#20135;&#31649;&#29702;&#20135;&#29983;&#24433;&#21709;&#30340;&#35266;&#28857;&#65292;&#21516;&#26102;&#25552;&#20379;&#20102;&#19968;&#20010;&#34913;&#37327;&#29305;&#23450;&#22522;&#37329;&#26159;&#21542;&#30495;&#27491;&#24320;&#21457;&#20102;AI&#30340;&#31616;&#21333;&#26631;&#20934;&#12290;</title><link>http://arxiv.org/abs/2304.10212</link><description>&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#38761;&#21629;&#23545;&#36164;&#20135;&#31649;&#29702;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The impact of the AI revolution on asset management. (arXiv:2304.10212v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10212
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20998;&#20139;&#20102;&#20316;&#32773;&#20851;&#20110;&#20154;&#24037;&#26234;&#33021;&#21487;&#33021;&#23545;&#36164;&#20135;&#31649;&#29702;&#20135;&#29983;&#24433;&#21709;&#30340;&#35266;&#28857;&#65292;&#21516;&#26102;&#25552;&#20379;&#20102;&#19968;&#20010;&#34913;&#37327;&#29305;&#23450;&#22522;&#37329;&#26159;&#21542;&#30495;&#27491;&#24320;&#21457;&#20102;AI&#30340;&#31616;&#21333;&#26631;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#23398;&#20064;&#30340;&#26368;&#26032;&#36827;&#23637;&#20351;&#24471;&#26426;&#22120;&#20855;&#22791;&#20102;&#26480;&#20986;&#30340;&#33021;&#21147;&#65306;&#23427;&#20204;&#21487;&#20197;&#38405;&#35835;&#21644;&#29702;&#35299;&#33258;&#30001;&#27969;&#21160;&#30340;&#25991;&#26412;&#65292;&#19982;&#20154;&#31867;&#36827;&#34892;&#25512;&#29702;&#21644;&#20132;&#28041;&#65292;&#32763;&#35793;&#19981;&#21516;&#35821;&#35328;&#30340;&#25991;&#26412;&#65292;&#23398;&#20064;&#22914;&#20309;&#20570;&#20986;&#26368;&#20248;&#20915;&#31574;&#31561;&#31561;&#12290;&#22914;&#20170;&#65292;&#26426;&#22120;&#24050;&#32463;&#22312;&#30284;&#30151;&#26816;&#27979;&#12289;&#34507;&#30333;&#36136;&#32467;&#26500;&#39044;&#27979;&#12289;&#33647;&#29289;&#35774;&#35745;&#12289;&#26680;&#32858;&#21464;&#21453;&#24212;&#22534;&#25511;&#21046;&#31561;&#26041;&#38754;&#23454;&#29616;&#20102;&#38761;&#21629;&#24615;&#31361;&#30772;&#12290;&#34429;&#28982;&#36825;&#20123;&#33021;&#21147;&#20173;&#22788;&#20110;&#33804;&#33469;&#38454;&#27573;&#65292;&#20294;&#23427;&#20204;&#22312;&#25345;&#32493;&#23436;&#21892;&#21644;&#24212;&#29992;&#20013;&#30340;&#25216;&#26415;&#24433;&#21709;&#20960;&#20046;&#23558;&#22312;&#20154;&#31867;&#27963;&#21160;&#30340;&#20960;&#20046;&#25152;&#26377;&#31038;&#20250;&#21644;&#32463;&#27982;&#39046;&#22495;&#20013;&#21457;&#25381;&#20316;&#29992;&#65292;&#36825;&#26159;&#25105;&#20204;&#20197;&#21069;&#20174;&#26410;&#35265;&#36807;&#30340;&#12290;&#26412;&#25991;&#23558;&#20998;&#20139;&#25105;&#30340;&#35266;&#28857;&#65292;&#21363;&#20154;&#24037;&#26234;&#33021;&#22914;&#20309;&#24433;&#21709;&#36164;&#20135;&#31649;&#29702;&#65292;&#25105;&#23558;&#25552;&#20379;&#19968;&#20010;&#24605;&#32500;&#26694;&#26550;&#65292;&#20351;&#35835;&#32773;&#21487;&#20197;&#29992;&#19968;&#20010;&#31616;&#21333;&#30340;&#26631;&#20934;&#26469;&#35780;&#20272;&#19968;&#20010;&#29305;&#23450;&#22522;&#37329;&#26159;&#21542;&#30495;&#27491;&#24320;&#21457;
&lt;/p&gt;
&lt;p&gt;
Recent progress in deep learning, a special form of machine learning, has led to remarkable capabilities machines can now be endowed with: they can read and understand free flowing text, reason and bargain with human counterparts, translate texts between languages, learn how to take decisions to maximize certain outcomes, etc. Today, machines have revolutionized the detection of cancer, the prediction of protein structures, the design of drugs, the control of nuclear fusion reactors etc. Although these capabilities are still in their infancy, it seems clear that their continued refinement and application will result in a technological impact on nearly all social and economic areas of human activity, the likes of which we have not seen before. In this article, I will share my view as to how AI will likely impact asset management in general and I will provide a mental framework that will equip readers with a simple criterion to assess whether and to what degree a given fund really exploi
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#20998;&#26512;&#20102;&#19996;&#21335;&#20122;&#20892;&#19994;&#19982;&#31038;&#20250;&#20914;&#31361;&#30340;&#20851;&#32852;&#24615;&#65292;&#21457;&#29616;&#22312;&#31291;&#35895;&#25910;&#33719;&#23395;&#33410;&#20013;&#65292;&#25919;&#27835;&#26292;&#21147;&#22686;&#21152;&#32780;&#31038;&#20250;&#21160;&#33633;&#20943;&#23569;&#12290;&#30740;&#31350;&#25581;&#31034;&#20102;&#25919;&#31574;&#21046;&#23450;&#32773;&#22312;&#20892;&#19994;&#32463;&#27982;&#20013;&#31649;&#29702;&#31038;&#20250;&#20914;&#31361;&#30340;&#24517;&#35201;&#24615;&#12290;</title><link>http://arxiv.org/abs/2304.10027</link><description>&lt;p&gt;
&#19996;&#21335;&#20122;&#20892;&#19994;&#20914;&#20987;&#19982;&#31038;&#20250;&#20914;&#31361;
&lt;/p&gt;
&lt;p&gt;
Agricultural Shocks and Social Conflict in Southeast Asia. (arXiv:2304.10027v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10027
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20998;&#26512;&#20102;&#19996;&#21335;&#20122;&#20892;&#19994;&#19982;&#31038;&#20250;&#20914;&#31361;&#30340;&#20851;&#32852;&#24615;&#65292;&#21457;&#29616;&#22312;&#31291;&#35895;&#25910;&#33719;&#23395;&#33410;&#20013;&#65292;&#25919;&#27835;&#26292;&#21147;&#22686;&#21152;&#32780;&#31038;&#20250;&#21160;&#33633;&#20943;&#23569;&#12290;&#30740;&#31350;&#25581;&#31034;&#20102;&#25919;&#31574;&#21046;&#23450;&#32773;&#22312;&#20892;&#19994;&#32463;&#27982;&#20013;&#31649;&#29702;&#31038;&#20250;&#20914;&#31361;&#30340;&#24517;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#20250;&#20914;&#31361;&#26159;&#19981;&#21487;&#36991;&#20813;&#30340;&#65292;&#20294;&#20854;&#21457;&#29983;&#21644;&#24378;&#24230;&#38543;&#26102;&#38388;&#21644;&#22320;&#28857;&#30340;&#19981;&#21516;&#32780;&#24322;&#12290;&#22312;&#20302;&#25910;&#20837;&#32463;&#27982;&#20307;&#20013;&#65292;&#20892;&#19994;&#23601;&#19994;&#21644;&#25910;&#20837;&#30340;&#37325;&#35201;&#24615;&#36739;&#22823;&#65292;&#25919;&#27835;&#26292;&#21147;&#21644;&#31038;&#20250;&#20914;&#31361;&#21487;&#33021;&#19982;&#35813;&#34892;&#19994;&#30456;&#20851;&#12290;&#25105;&#20204;&#20351;&#29992;&#28085;&#30422;&#19971;&#20010;&#19996;&#21335;&#20122;&#22269;&#23478;13&#24180;&#26399;&#38388;&#30340;&#20914;&#31361;&#25968;&#25454;&#26469;&#30740;&#31350;&#36825;&#31181;&#32852;&#31995;&#12290;&#25105;&#20204;&#37325;&#28857;&#20851;&#27880;&#31291;&#35895;&#25910;&#33719;&#23395;&#33410;&#20013;&#20914;&#31361;&#20107;&#20214;&#30340;&#21464;&#21270;&#65292;&#36825;&#26159;&#35813;&#22320;&#21306;&#29983;&#20135;&#21644;&#28040;&#36153;&#26368;&#22810;&#30340;&#35895;&#29289;&#20316;&#29289;&#12290;&#25105;&#20204;&#35266;&#23519;&#21040;&#22312;&#25910;&#33719;&#23395;&#33410;&#30340;&#31291;&#31859;&#29983;&#20135;&#22320;&#21306;&#65292;&#25919;&#27835;&#26292;&#21147;&#22686;&#21152;&#32780;&#31038;&#20250;&#21160;&#33633;&#20943;&#23569;&#12290;&#36890;&#36807;&#32771;&#34385;&#19982;&#31291;&#35895;&#20215;&#26684;&#21644;&#29983;&#38271;&#23395;&#33410;&#38477;&#38632;&#30456;&#20851;&#30340;&#20914;&#20987;&#65292;&#24182;&#27604;&#36739;&#20027;&#35201;&#26159;&#28748;&#28297;&#19982;&#20027;&#35201;&#26159;&#38632;&#20859;&#31291;&#29983;&#20135;&#23454;&#36341;&#30340;&#22320;&#21306;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#21487;&#33021;&#23548;&#33268;&#36825;&#31181;&#25928;&#26524;&#30340;&#19981;&#21516;&#26426;&#21046;&#12290;&#36825;&#20123;&#21457;&#29616;&#20026;&#25919;&#31574;&#21046;&#23450;&#32773;&#25552;&#20379;&#20102;&#37325;&#35201;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
Social conflicts are inevitable, but their occurrence and intensity have varied over time and across locations. In lower-income economies, where employment and income from agriculture are substantial, forms of political violence and social conflict may be linked with this sector. We investigate this linkage using granular conflict data covering a 13-year period across seven Southeast Asian countries. We focus on changes in conflict incidents during the rice harvest season, which is the most produced and consumed cereal crop in the region. We observe an increase in political violence but a decrease in social unrest in rice-producing areas during the harvest season. We investigate different plausible mechanisms that may lead to such effects, by incorporating shocks associated with rice prices and growing season rainfall, and by comparing regions with predominantly irrigated vs predominantly rainfed rice production practices. These findings offer important insights to policymakers as they
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#37329;&#34701;&#31995;&#32479;&#23384;&#22312;&#20043;&#21069;&#65292;&#33258;&#28982;&#36164;&#20135;&#22914;&#20309;&#20998;&#37197;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#30740;&#31350;&#20154;&#31867;&#23398;&#25968;&#25454;&#24182;&#24212;&#29992;&#32463;&#27982;&#29702;&#35770;&#65292;&#21457;&#29616;&#21490;&#21069;&#31038;&#20250;&#23545;&#38750;&#37329;&#34701;&#36130;&#23500;&#30340;&#22522;&#23612;&#31995;&#25968;&#26377;&#19968;&#20010;&#39318;&#36873;&#33539;&#22260;&#65292;&#38543;&#30528;&#20154;&#31867;&#31038;&#20250;&#30340;&#28436;&#21464;&#21644;&#21457;&#23637;&#26356;&#20026;&#22797;&#26434;&#30340;&#25919;&#27835;&#32467;&#26500;&#65292;&#36825;&#20010;&#33539;&#22260;&#21457;&#29983;&#20102;&#21464;&#21270;&#12290;</title><link>http://arxiv.org/abs/2304.09971</link><description>&lt;p&gt;
&#34507;&#31957;&#65306;&#20154;&#31867;&#36827;&#21270;&#22914;&#20309;&#20998;&#37197;&#38750;&#37329;&#34701;&#36130;&#23500;&#65311;
&lt;/p&gt;
&lt;p&gt;
The Pie: How Has Human Evolution Distributed Non-Financial Wealth?. (arXiv:2304.09971v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.09971
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#37329;&#34701;&#31995;&#32479;&#23384;&#22312;&#20043;&#21069;&#65292;&#33258;&#28982;&#36164;&#20135;&#22914;&#20309;&#20998;&#37197;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#30740;&#31350;&#20154;&#31867;&#23398;&#25968;&#25454;&#24182;&#24212;&#29992;&#32463;&#27982;&#29702;&#35770;&#65292;&#21457;&#29616;&#21490;&#21069;&#31038;&#20250;&#23545;&#38750;&#37329;&#34701;&#36130;&#23500;&#30340;&#22522;&#23612;&#31995;&#25968;&#26377;&#19968;&#20010;&#39318;&#36873;&#33539;&#22260;&#65292;&#38543;&#30528;&#20154;&#31867;&#31038;&#20250;&#30340;&#28436;&#21464;&#21644;&#21457;&#23637;&#26356;&#20026;&#22797;&#26434;&#30340;&#25919;&#27835;&#32467;&#26500;&#65292;&#36825;&#20010;&#33539;&#22260;&#21457;&#29983;&#20102;&#21464;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25910;&#20837;&#21644;&#36130;&#23500;&#20998;&#37197;&#26159;&#32463;&#27982;&#36816;&#20316;&#30340;&#22522;&#30784;&#32452;&#25104;&#37096;&#20998;&#12290;&#36825;&#20123;&#26159;&#22797;&#26434;&#30340;&#20998;&#24067;&#65292;&#20351;&#29992;&#24179;&#22343;&#20540;&#25110;&#20013;&#20301;&#25968;&#31561;&#31616;&#21270;&#26041;&#27861;&#24456;&#38590;&#30495;&#27491;&#24863;&#21463;&#21040;&#23427;&#20204;&#30340;&#21160;&#24577;&#12290;&#19968;&#20010;&#26356;&#22909;&#22320;&#25551;&#36848;&#35813;&#20998;&#24067;&#30340;&#25351;&#26631;&#26159;&#22522;&#23612;&#31995;&#25968;&#65292;&#22312;&#19968;&#20010;&#26497;&#31471;&#26159;0&#65292;&#19968;&#20010;&#23436;&#20840;&#20844;&#24179;&#30340;&#20998;&#24067;&#65292;&#22312;&#21478;&#19968;&#20010;&#26497;&#31471;&#26159;1&#65292;&#26368;&#19981;&#20844;&#24179;&#30340;&#26159;&#19968;&#20010;&#20154;&#25317;&#26377;&#25152;&#26377;&#36164;&#28304;&#12290;&#22823;&#22810;&#25968;&#19987;&#23478;&#35748;&#20026;&#65292;&#22312;&#20219;&#19968;&#26497;&#31471;&#37117;&#19981;&#23384;&#22312;&#21487;&#34892;&#30340;&#32463;&#27982;&#65292;&#20294;&#30830;&#23450;&#39318;&#36873;&#33539;&#22260;&#21382;&#26469;&#26159;&#26377;&#20105;&#35758;&#30340;&#25919;&#27835;&#21746;&#23398;&#21644;&#24773;&#24863;&#35785;&#27714;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#25506;&#35752;&#30340;&#26159;&#26159;&#21542;&#23384;&#22312;&#19968;&#20010;&#29702;&#35770;&#21644;&#23454;&#35777;&#22522;&#30784;&#25903;&#25345;&#19968;&#20010;&#39318;&#36873;&#22522;&#23612;&#31995;&#25968;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#25506;&#35752;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#38382;&#39064;&#65306;&#22312;&#37329;&#34701;&#31995;&#32479;&#23384;&#22312;&#20043;&#21069;&#65292;&#33258;&#28982;&#36164;&#20135;&#22914;&#20309;&#20998;&#37197;&#65311;&#39640;&#24230;&#65292;&#21147;&#37327;&#21644;&#32654;&#20029;&#31561;&#20869;&#22312;&#20154;&#31867;&#23646;&#24615;&#26159;&#20154;&#31867;&#31038;&#20250;&#20114;&#21160;&#30340;&#21407;&#22987;&#20215;&#20540;&#34913;&#37327;&#26631;&#20934;&#12290;&#36890;&#36807;&#30740;&#31350;&#20154;&#31867;&#23398;&#25968;&#25454;&#24182;&#24212;&#29992;&#32463;&#27982;&#29702;&#35770;&#65292;&#25105;&#21457;&#29616;&#21490;&#21069;&#31038;&#20250;&#23545;&#38750;&#37329;&#34701;&#36130;&#23500;&#30340;&#22522;&#23612;&#31995;&#25968;&#26377;&#19968;&#20010;&#39318;&#36873;&#33539;&#22260;&#12290;&#38543;&#30528;&#20154;&#31867;&#31038;&#20250;&#30340;&#28436;&#21464;&#21644;&#21457;&#23637;&#26356;&#20026;&#22797;&#26434;&#30340;&#25919;&#27835;&#32467;&#26500;&#65292;&#36825;&#20010;&#33539;&#22260;&#21457;&#29983;&#20102;&#21464;&#21270;&#12290;&#20102;&#35299;&#36825;&#20010;&#33539;&#22260;&#23545;&#20110;&#22914;&#20309;&#22609;&#36896;&#29616;&#20195;&#32463;&#27982;&#31995;&#32479;&#20855;&#26377;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Income and wealth allocation are foundational components of how economies operate. These are complex distributions, and it is hard to get a real sense for their dynamics using simplifications like average or median. One metric that characterizes such distributions better is the Gini Index, which on one extreme is 0, a completely equitable distribution, and on the other extreme is 1, the most inequitable, where a single individual has all the resources. Most experts agree that viable economies cannot exist at either extreme, but identifying a preferred range has historically been a matter of conflicting political philosophies and emotional appeals. This research explores instead whether there might be a theoretical and empirical basis for a preferred Gini Index. Specifically, I explore a simple question: Before financial systems existed, how were natural assets allocated? Intrinsic human attributes such as height, strength, &amp; beauty were the original measures of value in which human soc
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#21644;&#36164;&#20135;&#29305;&#23450;&#22240;&#32032;&#22312;&#39044;&#27979;&#34892;&#19994;&#22238;&#25253;&#21644;&#27979;&#37327;&#34892;&#19994;&#29305;&#23450;&#39118;&#38505;&#28322;&#20215;&#26041;&#38754;&#33719;&#24471;&#26356;&#22823;&#32463;&#27982;&#25910;&#30410;&#65292;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#22411;&#22312;&#32447;&#38598;&#25104;&#31639;&#27861;&#26469;&#23398;&#20064;&#20248;&#21270;&#39044;&#27979;&#24615;&#33021;&#65292;&#29305;&#21035;&#36866;&#29992;&#20110;&#26102;&#38388;&#24207;&#21015;&#38382;&#39064;&#21644;&#21487;&#33021;&#30340;&#40657;&#30418;&#27169;&#22411;&#31995;&#32479;&#12290;</title><link>http://arxiv.org/abs/2304.09947</link><description>&lt;p&gt;
&#22312;&#32447;&#27169;&#22411;&#38598;&#25104;&#23545;&#26368;&#20248;&#39044;&#27979;&#24615;&#33021;&#30340;&#24212;&#29992;&#21644;&#34892;&#19994;&#36718;&#25442;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Online Ensemble of Models for Optimal Predictive Performance with Applications to Sector Rotation Strategy. (arXiv:2304.09947v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.09947
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#21644;&#36164;&#20135;&#29305;&#23450;&#22240;&#32032;&#22312;&#39044;&#27979;&#34892;&#19994;&#22238;&#25253;&#21644;&#27979;&#37327;&#34892;&#19994;&#29305;&#23450;&#39118;&#38505;&#28322;&#20215;&#26041;&#38754;&#33719;&#24471;&#26356;&#22823;&#32463;&#27982;&#25910;&#30410;&#65292;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#22411;&#22312;&#32447;&#38598;&#25104;&#31639;&#27861;&#26469;&#23398;&#20064;&#20248;&#21270;&#39044;&#27979;&#24615;&#33021;&#65292;&#29305;&#21035;&#36866;&#29992;&#20110;&#26102;&#38388;&#24207;&#21015;&#38382;&#39064;&#21644;&#21487;&#33021;&#30340;&#40657;&#30418;&#27169;&#22411;&#31995;&#32479;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36164;&#20135;&#29305;&#23450;&#22240;&#32032;&#36890;&#24120;&#29992;&#20110;&#39044;&#27979;&#37329;&#34701;&#22238;&#25253;&#24182;&#37327;&#21270;&#36164;&#20135;&#29305;&#23450;&#39118;&#38505;&#28322;&#20215;&#12290;&#25105;&#20204;&#20351;&#29992;&#21508;&#31181;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#35777;&#26126;&#65292;&#36825;&#20123;&#22240;&#32032;&#21253;&#21547;&#30340;&#20449;&#24687;&#21487;&#20197;&#22312;&#39044;&#27979;&#34892;&#19994;&#22238;&#25253;&#21644;&#27979;&#37327;&#34892;&#19994;&#29305;&#23450;&#39118;&#38505;&#28322;&#20215;&#26041;&#38754;&#24102;&#26469;&#26356;&#22823;&#30340;&#32463;&#27982;&#25910;&#30410;&#12290;&#20026;&#20102;&#21033;&#29992;&#19981;&#21516;&#34892;&#19994;&#34920;&#29616;&#30340;&#21333;&#20010;&#27169;&#22411;&#30340;&#24378;&#39044;&#27979;&#32467;&#26524;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#22411;&#22312;&#32447;&#38598;&#25104;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#23398;&#20064;&#20248;&#21270;&#39044;&#27979;&#24615;&#33021;&#12290;&#35813;&#31639;&#27861;&#38543;&#30528;&#26102;&#38388;&#30340;&#25512;&#31227;&#19981;&#26029;&#36866;&#24212;&#65292;&#36890;&#36807;&#20998;&#26512;&#23427;&#20204;&#26368;&#36817;&#30340;&#39044;&#27979;&#24615;&#33021;&#26469;&#30830;&#23450;&#20010;&#20307;&#27169;&#22411;&#30340;&#26368;&#20339;&#32452;&#21512;&#12290;&#36825;&#20351;&#23427;&#29305;&#21035;&#36866;&#29992;&#20110;&#26102;&#38388;&#24207;&#21015;&#38382;&#39064;&#65292;&#28378;&#21160;&#31383;&#21475;&#22238;&#27979;&#31243;&#24207;&#21644;&#21487;&#33021;&#30340;&#40657;&#30418;&#27169;&#22411;&#31995;&#32479;&#12290;&#25105;&#20204;&#25512;&#23548;&#20986;&#26368;&#20248;&#22686;&#30410;&#20989;&#25968;&#65292;&#29992;&#26679;&#26412;&#22806;R&#24179;&#26041;&#24230;&#37327;&#34920;&#36798;&#30456;&#24212;&#30340;&#36951;&#25022;&#30028;&#65292;&#24182;&#25512;&#23548;&#20986;&#26368;&#20248;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
Asset-specific factors are commonly used to forecast financial returns and quantify asset-specific risk premia. Using various machine learning models, we demonstrate that the information contained in these factors leads to even larger economic gains in terms of forecasts of sector returns and the measurement of sector-specific risk premia. To capitalize on the strong predictive results of individual models for the performance of different sectors, we develop a novel online ensemble algorithm that learns to optimize predictive performance. The algorithm continuously adapts over time to determine the optimal combination of individual models by solely analyzing their most recent prediction performance. This makes it particularly suited for time series problems, rolling window backtesting procedures, and systems of potentially black-box models. We derive the optimal gain function, express the corresponding regret bounds in terms of the out-of-sample R-squared measure, and derive optimal le
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#27604;&#29305;&#24065;&#20215;&#26684;&#26102;&#38388;&#24207;&#21015;&#65292;&#21457;&#29616;&#33258;2010-2011&#24180;&#20197;&#26469;&#24050;&#21457;&#29983;&#33267;&#23569;&#21313;&#36215;&#26032;&#30340;&#20215;&#26684;&#27874;&#21160;&#12290;&#23613;&#31649;&#26080;&#27861;&#39044;&#27979;&#20215;&#26684;&#23792;&#20540;&#65292;&#20294;&#25104;&#21151;&#20351;&#29992;&#31867;&#26000;&#27874;&#37027;&#22865;&#25968;&#21015;&#30340;&#20989;&#25968;&#36924;&#36817;&#20102;BTC&#20215;&#26684;&#28436;&#21464;&#12290;&#21644;&#20854;&#20182;&#37329;&#34701;&#24037;&#20855;&#30456;&#27604;&#65292;BTC&#21487;&#33021;&#34987;&#24402;&#31867;&#20026;&#38750;&#27969;&#21160;&#36164;&#20135;&#12290;</title><link>http://arxiv.org/abs/2304.09939</link><description>&lt;p&gt;
&#27604;&#29305;&#24065;&#65306;&#21361;&#26426;&#26102;&#21051;&#30340;&#21382;&#31243;
&lt;/p&gt;
&lt;p&gt;
Bitcoin: A life in crises. (arXiv:2304.09939v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.09939
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#27604;&#29305;&#24065;&#20215;&#26684;&#26102;&#38388;&#24207;&#21015;&#65292;&#21457;&#29616;&#33258;2010-2011&#24180;&#20197;&#26469;&#24050;&#21457;&#29983;&#33267;&#23569;&#21313;&#36215;&#26032;&#30340;&#20215;&#26684;&#27874;&#21160;&#12290;&#23613;&#31649;&#26080;&#27861;&#39044;&#27979;&#20215;&#26684;&#23792;&#20540;&#65292;&#20294;&#25104;&#21151;&#20351;&#29992;&#31867;&#26000;&#27874;&#37027;&#22865;&#25968;&#21015;&#30340;&#20989;&#25968;&#36924;&#36817;&#20102;BTC&#20215;&#26684;&#28436;&#21464;&#12290;&#21644;&#20854;&#20182;&#37329;&#34701;&#24037;&#20855;&#30456;&#27604;&#65292;BTC&#21487;&#33021;&#34987;&#24402;&#31867;&#20026;&#38750;&#27969;&#21160;&#36164;&#20135;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#27604;&#29305;&#24065;&#20215;&#26684;&#26102;&#38388;&#24207;&#21015;&#65288;2010&#24180;8&#26376;17&#26085;&#33267;2021&#24180;6&#26376;27&#26085;&#65289;&#65292;&#24182;&#34920;&#26126;2017&#24180;&#30340;&#20215;&#26684;&#27874;&#21160;&#19981;&#26159;&#21807;&#19968;&#30340;&#12290;&#33258;2010-2011&#24180;&#20197;&#26469;&#21457;&#29983;&#20102;&#33267;&#23569;&#21313;&#36215;&#26032;&#20107;&#20214;&#65292;&#36328;&#36234;&#20102;&#20116;&#20010;&#35746;&#21333;&#30340;&#20215;&#26684;&#24040;&#24133;&#65288;1&#32654;&#20803;-60,000&#32654;&#20803;&#65289;&#12290;&#25105;&#20204;&#21457;&#29616;&#36825;&#20123;&#20107;&#20214;&#30340;&#25345;&#32493;&#26102;&#38388;&#22823;&#33268;&#30456;&#21516;&#65292;&#32422;&#20026;50-100&#22825;&#12290;&#23613;&#31649;&#25105;&#20204;&#26080;&#27861;&#39044;&#27979;&#20215;&#26684;&#23792;&#20540;&#30340;&#26102;&#38388;&#65292;&#20294;&#25105;&#20204;&#25104;&#21151;&#22320;&#36890;&#36807;&#19968;&#31181;&#31867;&#20284;&#20110;&#26000;&#27874;&#37027;&#22865;&#25968;&#21015;&#30340;&#20989;&#25968;&#26469;&#36924;&#36817;BTC&#20215;&#26684;&#28436;&#21464;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;BTC&#19982;&#20854;&#20182;&#31867;&#22411;&#30340;&#37329;&#34701;&#24037;&#20855;&#65288;&#32929;&#31080;&#12289;&#36135;&#24065;&#12289;&#40644;&#37329;&#65289;&#36827;&#34892;&#20102;&#27604;&#36739;&#65292;&#34920;&#26126;BTC&#21487;&#33021;&#34987;&#24402;&#31867;&#20026;&#38750;&#27969;&#21160;&#36164;&#20135;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this study, we investigate the BTC price time-series (17 August 2010-27 June 2021) and show that the 2017 pricing episode is not unique. We describe at least ten new events, which occurred since 2010-2011 and span more than five orders of price magnitudes ($US 1-$US 60k). We find that those events have a similar duration of approx. 50-100 days. Although we are not able to predict times of a price peak, we however succeed to approximate the BTC price evolution using a function that is similar to a Fibonacci sequence. Finally, we complete a comparison with other types of financial instruments (equities, currencies, gold) which suggests that BTC may be classified as an illiquid asset.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#21457;&#29616;&#65292;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#22312;&#22823;&#22810;&#25968;&#34928;&#36864;&#26399;&#38388;&#30340;&#34920;&#29616;&#36739;&#24046;&#65292;&#19982;&#31283;&#23450;&#24066;&#22330;&#26377;&#20851;&#30340;&#22240;&#32032;&#21487;&#33021;&#26159;&#20854;&#34920;&#29616;&#20248;&#24322;&#30340;&#21407;&#22240;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#24314;&#35758;ML&#20174;&#19994;&#32773;&#22312;&#34928;&#36864;&#21644;&#22797;&#33487;&#26399;&#38388;&#35780;&#20272;&#20854;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2304.09937</link><description>&lt;p&gt;
&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#39044;&#27979;&#32929;&#31080;&#20215;&#26684;&#21644;&#21830;&#19994;&#21608;&#26399;
&lt;/p&gt;
&lt;p&gt;
Stock Price Predictability and the Business Cycle via Machine Learning. (arXiv:2304.09937v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.09937
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21457;&#29616;&#65292;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#22312;&#22823;&#22810;&#25968;&#34928;&#36864;&#26399;&#38388;&#30340;&#34920;&#29616;&#36739;&#24046;&#65292;&#19982;&#31283;&#23450;&#24066;&#22330;&#26377;&#20851;&#30340;&#22240;&#32032;&#21487;&#33021;&#26159;&#20854;&#34920;&#29616;&#20248;&#24322;&#30340;&#21407;&#22240;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#24314;&#35758;ML&#20174;&#19994;&#32773;&#22312;&#34928;&#36864;&#21644;&#22797;&#33487;&#26399;&#38388;&#35780;&#20272;&#20854;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#21830;&#19994;&#21608;&#26399;&#23545;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#39044;&#27979;&#30340;&#24433;&#21709;&#12290;&#20351;&#29992;&#26631;&#26222;500&#25351;&#25968;&#65292;&#25105;&#20204;&#21457;&#29616;&#22312;&#22823;&#22810;&#25968;&#34928;&#36864;&#26399;&#38388;&#65292;ML&#27169;&#22411;&#30340;&#34920;&#29616;&#36739;&#24046;&#65292;&#32780;&#34928;&#36864;&#21382;&#21490;&#25110;&#26080;&#39118;&#38505;&#21033;&#29575;&#30340;&#21253;&#21547;&#24182;&#19981;&#33021; necessarily &#25552;&#39640;&#20854;&#24615;&#33021;&#12290;&#22312;&#35843;&#26597;&#27169;&#22411;&#34920;&#29616;&#33391;&#22909;&#30340;&#34928;&#36864;&#26102;&#65292;&#25105;&#20204;&#21457;&#29616;&#23427;&#20204;&#30340;&#24066;&#22330;&#27874;&#21160;&#24615;&#36739;&#20854;&#20182;&#34928;&#36864;&#26399;&#36739;&#20302;&#12290;&#36825;&#24847;&#21619;&#30528;&#34920;&#29616;&#25552;&#39640;&#19981;&#26159;&#30001;&#20110;ML&#26041;&#27861;&#30340;&#20248;&#28857;&#65292;&#32780;&#26159;&#22240;&#20026;&#26377;&#25928;&#30340;&#36135;&#24065;&#25919;&#31574;&#31283;&#23450;&#20102;&#24066;&#22330;&#12290;&#25105;&#20204;&#24314;&#35758;ML&#20174;&#19994;&#32773;&#22312;&#34928;&#36864;&#21644;&#22797;&#33487;&#26399;&#38388;&#35780;&#20272;&#20854;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the impacts of business cycles on machine learning (ML) predictions. Using the S&amp;P 500 index, we find that ML models perform worse during most recessions, and the inclusion of recession history or the risk-free rate does not necessarily improve their performance. Investigating recessions where models perform well, we find that they exhibit lower market volatility than other recessions. This implies that the improved performance is not due to the merit of ML methods but rather factors such as effective monetary policies that stabilized the market. We recommend that ML practitioners evaluate their models during both recessions and expansions.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35762;&#36848;&#20102;&#22914;&#20309;&#20351;&#29992;ML/DL&#27169;&#22411;&#39044;&#27979;&#32929;&#31080;&#20215;&#26684;&#65292;&#20197;&#24110;&#21161;&#25237;&#36164;&#32773;&#21644;&#37329;&#34701;&#26426;&#26500;&#20570;&#20986;&#26126;&#26234;&#30340;&#20915;&#31574;&#21644;&#21046;&#23450;&#26377;&#25928;&#30340;&#39118;&#38505;&#31649;&#29702;&#25919;&#31574;&#12290;</title><link>http://arxiv.org/abs/2304.09936</link><description>&lt;p&gt;
&#20351;&#29992;&#25216;&#26415;&#20998;&#26512;&#21644;ML/DL&#27169;&#22411;&#35782;&#21035;&#20132;&#26131;
&lt;/p&gt;
&lt;p&gt;
Identifying Trades Using Technical Analysis and ML/DL Models. (arXiv:2304.09936v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.09936
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35762;&#36848;&#20102;&#22914;&#20309;&#20351;&#29992;ML/DL&#27169;&#22411;&#39044;&#27979;&#32929;&#31080;&#20215;&#26684;&#65292;&#20197;&#24110;&#21161;&#25237;&#36164;&#32773;&#21644;&#37329;&#34701;&#26426;&#26500;&#20570;&#20986;&#26126;&#26234;&#30340;&#20915;&#31574;&#21644;&#21046;&#23450;&#26377;&#25928;&#30340;&#39118;&#38505;&#31649;&#29702;&#25919;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#27979;&#32929;&#24066;&#20215;&#26684;&#30340;&#37325;&#35201;&#24615;&#19981;&#35328;&#32780;&#21947;&#12290;&#23545;&#20110;&#25237;&#36164;&#32773;&#21644;&#37329;&#34701;&#26426;&#26500;&#26469;&#35828;&#65292;&#36825;&#26159;&#19968;&#20010;&#20851;&#38190;&#20219;&#21153;&#65292;&#22240;&#20026;&#23427;&#20351;&#20182;&#20204;&#33021;&#22815;&#20570;&#20986;&#26126;&#26234;&#30340;&#25237;&#36164;&#20915;&#31574;&#65292;&#31649;&#29702;&#39118;&#38505;&#24182;&#30830;&#20445;&#37329;&#34701;&#31995;&#32479;&#30340;&#31283;&#23450;&#12290;&#20934;&#30830;&#30340;&#32929;&#24066;&#39044;&#27979;&#21487;&#20197;&#24110;&#21161;&#25237;&#36164;&#32773;&#26368;&#22823;&#21270;&#25910;&#30410;&#24182;&#23613;&#37327;&#20943;&#23569;&#25439;&#22833;&#65292;&#32780;&#37329;&#34701;&#26426;&#26500;&#21487;&#20197;&#21033;&#29992;&#36825;&#20123;&#20449;&#24687;&#21046;&#23450;&#26377;&#25928;&#30340;&#39118;&#38505;&#31649;&#29702;&#25919;&#31574;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#32929;&#24066;&#30340;&#22797;&#26434;&#24615;&#21644;&#24433;&#21709;&#32929;&#31080;&#20215;&#26684;&#30340;&#35832;&#22810;&#22240;&#32032;&#65292;&#32929;&#24066;&#39044;&#27979;&#26159;&#19968;&#39033;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20219;&#21153;&#12290;&#22240;&#27492;&#65292;&#36234;&#26469;&#36234;&#22810;&#30340;&#20808;&#36827;&#25216;&#26415;&#65292;&#22914;&#28145;&#24230;&#23398;&#20064;&#65292;&#34987;&#29992;&#20110;&#20998;&#26512;&#28023;&#37327;&#25968;&#25454;&#24182;&#27934;&#23519;&#32929;&#24066;&#36816;&#34892;&#34892;&#20026;&#12290;&#34429;&#28982;&#28145;&#24230;&#23398;&#20064;&#22312;&#20934;&#30830;&#39044;&#27979;&#32929;&#31080;&#20215;&#26684;&#26041;&#38754;&#34920;&#29616;&#20986;&#20102;&#24456;&#22823;&#30340;&#28508;&#21147;&#65292;&#20294;&#22312;&#36825;&#20010;&#39046;&#22495;&#20173;&#26377;&#35768;&#22810;&#30740;&#31350;&#38656;&#35201;&#36827;&#34892;&#12290;
&lt;/p&gt;
&lt;p&gt;
The importance of predicting stock market prices cannot be overstated. It is a pivotal task for investors and financial institutions as it enables them to make informed investment decisions, manage risks, and ensure the stability of the financial system. Accurate stock market predictions can help investors maximize their returns and minimize their losses, while financial institutions can use this information to develop effective risk management policies. However, stock market prediction is a challenging task due to the complex nature of the stock market and the multitude of factors that can affect stock prices. As a result, advanced technologies such as deep learning are being increasingly utilized to analyze vast amounts of data and provide valuable insights into the behavior of the stock market. While deep learning has shown promise in accurately predicting stock prices, there is still much research to be done in this area.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#31934;&#36873;&#32508;&#36848;&#20102;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#24037;&#20855;&#36827;&#34892;&#32463;&#27982;&#23398;&#30740;&#31350;&#21644;&#25919;&#31574;&#20998;&#26512;&#30340;&#25991;&#31456;&#65292;&#24378;&#35843;&#20102;&#26426;&#22120;&#23398;&#20064;&#22312;&#22788;&#29702;&#38750;&#20256;&#32479;&#21644;&#38750;&#32467;&#26500;&#21270;&#25968;&#25454;&#12289;&#25429;&#25417;&#24378;&#38750;&#32447;&#24615;&#24615;&#21644;&#25552;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#26041;&#38754;&#30340;&#24212;&#29992;&#20248;&#21183;&#65292;&#25104;&#20026;&#35745;&#37327;&#32463;&#27982;&#23398;&#23478;&#24037;&#20855;&#31665;&#20013;&#19981;&#21487;&#25110;&#32570;&#30340;&#19968;&#37096;&#20998;&#12290;</title><link>http://arxiv.org/abs/2304.00086</link><description>&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#22312;&#32463;&#27982;&#30740;&#31350;&#20013;&#30340;&#24212;&#29992;&#65306;&#20309;&#26102;&#12289;&#20160;&#20040;&#21644;&#22914;&#20309;&#36816;&#29992;&#65311;
&lt;/p&gt;
&lt;p&gt;
Machine Learning for Economics Research: When What and How?. (arXiv:2304.00086v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.00086
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#31934;&#36873;&#32508;&#36848;&#20102;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#24037;&#20855;&#36827;&#34892;&#32463;&#27982;&#23398;&#30740;&#31350;&#21644;&#25919;&#31574;&#20998;&#26512;&#30340;&#25991;&#31456;&#65292;&#24378;&#35843;&#20102;&#26426;&#22120;&#23398;&#20064;&#22312;&#22788;&#29702;&#38750;&#20256;&#32479;&#21644;&#38750;&#32467;&#26500;&#21270;&#25968;&#25454;&#12289;&#25429;&#25417;&#24378;&#38750;&#32447;&#24615;&#24615;&#21644;&#25552;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#26041;&#38754;&#30340;&#24212;&#29992;&#20248;&#21183;&#65292;&#25104;&#20026;&#35745;&#37327;&#32463;&#27982;&#23398;&#23478;&#24037;&#20855;&#31665;&#20013;&#19981;&#21487;&#25110;&#32570;&#30340;&#19968;&#37096;&#20998;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#24037;&#20855;&#36827;&#34892;&#32463;&#27982;&#23398;&#30740;&#31350;&#21644;&#25919;&#31574;&#20998;&#26512;&#30340;&#37325;&#35201;&#32463;&#27982;&#26399;&#21002;&#19978;&#21457;&#34920;&#30340;&#25991;&#31456;&#36827;&#34892;&#20102;&#31934;&#36873;&#32508;&#36848;&#12290;&#32508;&#36848;&#22238;&#31572;&#20102;&#19977;&#20010;&#20851;&#38190;&#38382;&#39064;&#65306;&#65288;1&#65289;&#20309;&#26102;&#22312;&#32463;&#27982;&#23398;&#20013;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#65292;&#65288;2&#65289;&#24120;&#29992;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#26159;&#20160;&#20040;&#65292;&#20197;&#21450;&#65288;3&#65289;&#22914;&#20309;&#23558;&#23427;&#20204;&#29992;&#20110;&#32463;&#27982;&#24212;&#29992;&#12290;&#32508;&#36848;&#24378;&#35843;&#20102;&#26426;&#22120;&#23398;&#20064;&#29305;&#21035;&#36866;&#29992;&#20110;&#22788;&#29702;&#38750;&#20256;&#32479;&#21644;&#38750;&#32467;&#26500;&#21270;&#25968;&#25454;&#12289;&#25429;&#25417;&#24378;&#38750;&#32447;&#24615;&#24615;&#21644;&#25552;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#12290;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#36866;&#29992;&#20110;&#38750;&#20256;&#32479;&#25968;&#25454;&#65292;&#32780;&#38598;&#25104;&#23398;&#20064;&#27169;&#22411;&#36866;&#29992;&#20110;&#20256;&#32479;&#25968;&#25454;&#38598;&#12290;&#23613;&#31649;&#20256;&#32479;&#30340;&#35745;&#37327;&#32463;&#27982;&#23398;&#27169;&#22411;&#22312;&#20998;&#26512;&#20302;&#22797;&#26434;&#24615;&#25968;&#25454;&#26102;&#21487;&#33021;&#36275;&#22815;&#65292;&#20294;&#30001;&#20110;&#24555;&#36895;&#25968;&#23383;&#21270;&#21644;&#19981;&#26029;&#22686;&#38271;&#30340;&#25991;&#29486;&#65292;&#32463;&#27982;&#25968;&#25454;&#30340;&#22797;&#26434;&#24615;&#22686;&#21152;&#65292;&#26426;&#22120;&#23398;&#20064;&#27491;&#25104;&#20026;&#35745;&#37327;&#32463;&#27982;&#23398;&#23478;&#24037;&#20855;&#31665;&#20013;&#19981;&#21487;&#25110;&#32570;&#30340;&#19968;&#37096;&#20998;&#12290;
&lt;/p&gt;
&lt;p&gt;
This article provides a curated review of selected papers published in prominent economics journals that use machine learning (ML) tools for research and policy analysis. The review focuses on three key questions: (1) when ML is used in economics, (2) what ML models are commonly preferred, and (3) how they are used for economic applications. The review highlights that ML is particularly used in processing nontraditional and unstructured data, capturing strong nonlinearity, and improving prediction accuracy. Deep learning models are suitable for nontraditional data, whereas ensemble learning models are preferred for traditional datasets. While traditional econometric models may suffice for analyzing low-complexity data, the increasing complexity of economic data due to rapid digitalization and the growing literature suggest that ML is becoming an essential addition to the econometrician's toolbox.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#21457;&#29616;&#65292;&#30456;&#36739;&#20110;&#35088;&#33394;&#32929;&#31080;&#65292;&#32511;&#33394;&#32929;&#31080;&#22312;&#22823;&#22810;&#25968;&#32929;&#31080;&#22240;&#23376;&#19978;&#34920;&#29616;&#20986;&#36739;&#23569;&#30340;&#22240;&#23376;&#26292;&#38706;&#24322;&#36136;&#24615;&#65292;&#22240;&#27492;&#25237;&#36164;&#32463;&#29702;&#23558;&#25237;&#36164;&#20174;&#35088;&#33394;&#32929;&#31080;&#36716;&#21521;&#32511;&#33394;&#32929;&#31080;&#26102;&#65292;&#24046;&#24322;&#31354;&#38388;&#36739;&#23567;&#12290;&#27492;&#22806;&#65292;&#19982;&#36739;&#26089;&#26102;&#26399;&#30456;&#27604;&#65292;&#32511;&#33394;&#32929;&#31080;&#30340;&#22240;&#23376;&#26292;&#38706;&#24322;&#36136;&#24615;&#22686;&#21152;&#20102;&#12290;</title><link>http://arxiv.org/abs/2302.11729</link><description>&lt;p&gt;
&#32511;&#33394;&#32929;&#31080;&#21644;&#35088;&#33394;&#32929;&#31080;&#20013;&#30340;&#22240;&#23376;&#26292;&#38706;&#24322;&#36136;&#24615;
&lt;/p&gt;
&lt;p&gt;
Factor Exposure Heterogeneity in Green and Brown Stocks. (arXiv:2302.11729v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.11729
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21457;&#29616;&#65292;&#30456;&#36739;&#20110;&#35088;&#33394;&#32929;&#31080;&#65292;&#32511;&#33394;&#32929;&#31080;&#22312;&#22823;&#22810;&#25968;&#32929;&#31080;&#22240;&#23376;&#19978;&#34920;&#29616;&#20986;&#36739;&#23569;&#30340;&#22240;&#23376;&#26292;&#38706;&#24322;&#36136;&#24615;&#65292;&#22240;&#27492;&#25237;&#36164;&#32463;&#29702;&#23558;&#25237;&#36164;&#20174;&#35088;&#33394;&#32929;&#31080;&#36716;&#21521;&#32511;&#33394;&#32929;&#31080;&#26102;&#65292;&#24046;&#24322;&#31354;&#38388;&#36739;&#23567;&#12290;&#27492;&#22806;&#65292;&#19982;&#36739;&#26089;&#26102;&#26399;&#30456;&#27604;&#65292;&#32511;&#33394;&#32929;&#31080;&#30340;&#22240;&#23376;&#26292;&#38706;&#24322;&#36136;&#24615;&#22686;&#21152;&#20102;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#21516;&#34892;&#26292;&#38706;&#27604;&#29575;&#65292;&#25506;&#35752;&#20102;&#32511;&#33394;&#32929;&#31080;&#21644;&#35088;&#33394;&#32929;&#31080;&#20013;&#30340;&#22240;&#23376;&#26292;&#38706;&#24322;&#36136;&#24615;&#12290;&#36890;&#36807;&#35266;&#23519;&#22522;&#20110;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#27700;&#24179;&#23545;S&amp;P 500&#25351;&#25968;&#20844;&#21496;&#30340;&#21516;&#34892;&#32676;&#20307;&#65292;&#25105;&#20204;&#21457;&#29616;&#65292;&#24179;&#22343;&#32780;&#35328;&#65292;&#32511;&#33394;&#32929;&#31080;&#22312;&#22823;&#22810;&#25968;&#20256;&#32479;&#32929;&#31080;&#22240;&#23376;&#65288;&#20215;&#20540;&#39118;&#26684;&#38500;&#22806;&#65289;&#19978;&#27604;&#35088;&#33394;&#32929;&#31080;&#34920;&#29616;&#20986;&#26356;&#23569;&#30340;&#22240;&#23376;&#26292;&#38706;&#24322;&#36136;&#24615;&#12290;&#22240;&#27492;&#65292;&#25237;&#36164;&#32463;&#29702;&#23558;&#25237;&#36164;&#20174;&#35088;&#33394;&#32929;&#31080;&#36716;&#20026;&#32511;&#33394;&#32929;&#31080;&#26102;&#65292;&#20851;&#20110;&#20182;&#20204;&#30340;&#22240;&#23376;&#26292;&#38706;&#65292;&#20182;&#20204;&#30340;&#24046;&#24322;&#31354;&#38388;&#36739;&#23567;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#21457;&#29616;&#65292;&#19982;&#36739;&#26089;&#26102;&#26399;&#30456;&#27604;&#65292;&#32511;&#33394;&#32929;&#31080;&#30340;&#22240;&#23376;&#26292;&#38706;&#24322;&#36136;&#24615;&#22686;&#21152;&#20102;&#12290;
&lt;/p&gt;
&lt;p&gt;
Using the peer-exposure ratio, we explore the factor exposure heterogeneity in green and brown stocks. By looking at peer groups of S&amp;P 500 index firms over 2014-2020 based on their greenhouse gas emission levels, we find that, on average, green stocks exhibit less factor exposure heterogeneity than brown stocks for most of the traditional equity factors but the value factor. Hence, investment managers shifting their investments from brown stocks to green stocks have less room to differentiate themselves regarding their factor exposures. Finally, we find that factor exposure heterogeneity has increased for green stocks compared to earlier periods.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#27604;&#36739;&#20102;&#24120;&#20989;&#25968;&#24066;&#22330;&#21046;&#36896;&#21830;&#21644;&#38480;&#20215;&#35746;&#21333;&#31807;&#20004;&#31181;&#20027;&#27969;&#20132;&#26131;&#33539;&#24335;&#12290; &#26412;&#25991;&#30340;&#20027;&#35201;&#30446;&#26631;&#26159;&#24418;&#24335;&#21270;&#19968;&#31181;&#36143;&#31359;&#20132;&#26131;&#26426;&#21046;&#35774;&#35745;&#30340;&#36817;&#20284;&#22797;&#26434;&#24230;&#26435;&#34913;&#12290;</title><link>http://arxiv.org/abs/2302.11652</link><description>&lt;p&gt;
&#20132;&#26131;&#26426;&#21046;&#20013;&#30340;&#22797;&#26434;&#24615;&#21644;&#36817;&#20284;&#24615;&#26435;&#34913;&#65306;AMMs&#19982;LOBs&#20043;&#27604;&#36739;
&lt;/p&gt;
&lt;p&gt;
Complexity-Approximation Trade-offs in Exchange Mechanisms: AMMs vs. LOBs. (arXiv:2302.11652v3 [math.FA] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.11652
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#27604;&#36739;&#20102;&#24120;&#20989;&#25968;&#24066;&#22330;&#21046;&#36896;&#21830;&#21644;&#38480;&#20215;&#35746;&#21333;&#31807;&#20004;&#31181;&#20027;&#27969;&#20132;&#26131;&#33539;&#24335;&#12290; &#26412;&#25991;&#30340;&#20027;&#35201;&#30446;&#26631;&#26159;&#24418;&#24335;&#21270;&#19968;&#31181;&#36143;&#31359;&#20132;&#26131;&#26426;&#21046;&#35774;&#35745;&#30340;&#36817;&#20284;&#22797;&#26434;&#24230;&#26435;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;&#26694;&#26550;&#65292;&#35774;&#35745;&#21644;&#20998;&#26512;&#20102;&#20004;&#31181;&#36164;&#20135;&#20043;&#38388;&#30340;&#20132;&#26131;&#26426;&#21046;&#65292;&#32479;&#19968;&#24182;&#27604;&#36739;&#20102;&#24120;&#20989;&#25968;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;CFMMs&#65289;&#21644;&#38480;&#20215;&#35746;&#21333;&#31807;&#65288;LOBs&#65289;&#20004;&#31181;&#20027;&#27969;&#20132;&#26131;&#33539;&#24335;&#12290;&#22312;&#25105;&#20204;&#30340;&#26694;&#26550;&#20013;&#65292;&#27599;&#20010;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65288;LP&#65289;&#21521;&#20132;&#26131;&#25152;&#25552;&#20132;&#19968;&#20010;&#21521;&#19979;&#20542;&#26012;&#30340;&#38656;&#27714;&#26354;&#32447;&#65292;&#25351;&#23450;&#20854;&#24076;&#26395;&#22312;&#27599;&#20010;&#20215;&#26684;&#19978;&#25345;&#26377;&#30340;&#39118;&#38505;&#36164;&#20135;&#25968;&#37327;; &#20132;&#26131;&#25152;&#20080;&#21334;&#39118;&#38505;&#36164;&#20135;&#20197;&#28385;&#36275;&#25552;&#20132;&#30340;&#38656;&#27714;&#30340;&#24635;&#37327;&#12290;&#36890;&#24120;&#65292;&#36825;&#31181;&#26426;&#21046;&#26159;&#39044;&#31639;&#24179;&#34913;&#30340;&#65292;&#24182;&#33021;&#23454;&#29616;&#20215;&#26684;&#21457;&#29616;&#12290;&#19981;&#21516;&#30340;&#20132;&#26131;&#26426;&#21046;&#23545;&#24212;&#20110;&#23545;&#21487;&#25509;&#21463;&#38656;&#27714;&#26354;&#32447;&#38598;&#30340;&#19981;&#21516;&#38480;&#21046;&#12290;&#26412;&#25991;&#30340;&#20027;&#35201;&#30446;&#26631;&#26159;&#24418;&#24335;&#21270;&#19968;&#31181;&#36143;&#31359;&#20132;&#26131;&#26426;&#21046;&#35774;&#35745;&#30340;&#36817;&#20284;&#22797;&#26434;&#24230;&#26435;&#34913;&#12290;&#20363;&#22914;&#65292;CFMMs&#22312;&#34920;&#36798;&#21147;&#26041;&#38754;&#20570;&#20986;&#20102;&#22949;&#21327;&#65292;&#20197;&#31616;&#27905;&#20026;&#20248;&#65306;LPs&#30340;&#32858;&#21512;&#38656;&#27714;&#26354;&#32447;&#21487;&#20197;&#29992;&#24120;&#25968;&#31354;&#38388;&#25551;&#36848;&#65292;
&lt;/p&gt;
&lt;p&gt;
This paper presents a general framework for the design and analysis of exchange mechanisms between two assets that unifies and enables comparisons between the two dominant paradigms for exchange, constant function market markers (CFMMs) and limit order books (LOBs). In our framework, each liquidity provider (LP) submits to the exchange a downward-sloping demand curve, specifying the quantity of the risky asset it wishes to hold at each price; the exchange buys and sells the risky asset so as to satisfy the aggregate submitted demand. In general, such a mechanism is budget-balanced and enables price discovery. Different exchange mechanisms correspond to different restrictions on the set of acceptable demand curves. The primary goal of this paper is to formalize an approximation-complexity trade-off that pervades the design of exchange mechanisms. For example, CFMMs give up expressiveness in favor of simplicity: the aggregate demand curve of the LPs can be described using constant space,
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22269;&#23478;&#26377;&#32447;&#30005;&#35270;&#26032;&#38395;&#23545;&#32654;&#22269;&#26412;&#22303;&#25253;&#32440;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#24403;&#22320;&#25253;&#32440;&#30340;&#20869;&#23481;&#20250;&#22240;&#20026;&#24403;&#22320; FNC &#35266;&#20247;&#25968;&#37327;&#30340;&#22686;&#21152;&#32780;&#36235;&#21521;&#20110; FNC &#30340;&#20542;&#21521;&#65292;&#24182;&#19988;&#26377;&#32447;&#30005;&#35270;&#20542;&#21521;&#20250;&#26497;&#21270;&#22320;&#26041;&#26032;&#38395;&#20869;&#23481;&#12290;</title><link>http://arxiv.org/abs/2202.07269</link><description>&lt;p&gt;
&#23186;&#20307;&#20542;&#21521;&#26159;&#20855;&#26377;&#20256;&#26579;&#24615;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Media Slant is Contagious. (arXiv:2202.07269v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.07269
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22269;&#23478;&#26377;&#32447;&#30005;&#35270;&#26032;&#38395;&#23545;&#32654;&#22269;&#26412;&#22303;&#25253;&#32440;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#24403;&#22320;&#25253;&#32440;&#30340;&#20869;&#23481;&#20250;&#22240;&#20026;&#24403;&#22320; FNC &#35266;&#20247;&#25968;&#37327;&#30340;&#22686;&#21152;&#32780;&#36235;&#21521;&#20110; FNC &#30340;&#20542;&#21521;&#65292;&#24182;&#19988;&#26377;&#32447;&#30005;&#35270;&#20542;&#21521;&#20250;&#26497;&#21270;&#22320;&#26041;&#26032;&#38395;&#20869;&#23481;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#23519;&#20102;&#23186;&#20307;&#20542;&#21521;&#30340;&#20256;&#25773;&#65292;&#20855;&#20307;&#26469;&#35828;&#26159;&#22269;&#23478;&#26377;&#32447;&#30005;&#35270;&#26032;&#38395;&#23545;&#32654;&#22269;&#26412;&#22303;&#25253;&#32440;&#65288;2005-2008&#65289;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#20351;&#29992;&#19968;&#31181;&#22522;&#20110; Fox News Channel&#65288;FNC&#65289;&#12289;CNN &#21644; MSNBC &#20869;&#23481;&#30340;&#26377;&#32447;&#30005;&#35270;&#20542;&#21521;&#25991;&#26412;&#24230;&#37327;&#26041;&#27861;&#65292;&#20998;&#26512;&#22320;&#26041;&#25253;&#32440;&#22914;&#20309;&#37319;&#29992; FNC &#30340;&#20542;&#21521;&#32780;&#19981;&#26159; CNN/MSNBC &#30340;&#20542;&#21521;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#22320;&#26041;&#26032;&#38395;&#38543;&#30528;&#24403;&#22320; FNC &#35266;&#20247;&#20154;&#25968;&#30340;&#22806;&#37096;&#22686;&#38271;&#32780;&#21464;&#24471;&#26356;&#21152;&#31867;&#20284;&#20110; FNC &#30340;&#20869;&#23481;&#12290;&#36825;&#31181;&#36716;&#21464;&#19981;&#20165;&#38480;&#20110;&#20174;&#26377;&#32447;&#30005;&#35270;&#20511;&#37492;&#65292;&#32780;&#26159;&#22320;&#26041;&#25253;&#32440;&#33258;&#36523;&#20869;&#23481;&#30340;&#25913;&#21464;&#12290;&#27492;&#22806;&#65292;&#26377;&#32447;&#30005;&#35270;&#20542;&#21521;&#26497;&#21270;&#20102;&#22320;&#26041;&#26032;&#38395;&#20869;&#23481;&#12290;
&lt;/p&gt;
&lt;p&gt;
We examine the diffusion of media slant, specifically how partisan content from national cable news affects local newspapers in the U.S., 2005-2008. We use a text-based measure of cable news slant trained on content from Fox News Channel (FNC), CNN, and MSNBC to analyze how local newspapers adopt FNC's slant over CNN/MSNBC's. Our findings show that local news becomes more similar to FNC content in response to an exogenous increase in local FNC viewership. This shift is not limited to borrowing from cable news, but rather, local newspapers' own content changes. Further, cable TV slant polarizes local news content.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#21033;&#29992;Transformer&#27169;&#22411;&#65292;&#23558;&#36829;&#32422;&#39044;&#27979;&#38382;&#39064;&#20316;&#20026;&#22810;&#26631;&#31614;&#26102;&#38388;&#24207;&#21015;&#20998;&#31867;&#38382;&#39064;&#65292;&#24182;&#36890;&#36807;&#27880;&#24847;&#21147;&#28909;&#22270;&#35299;&#37322;&#27169;&#22411;&#39044;&#27979;&#12290;&#21516;&#26102;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#23450;&#20041;&#25439;&#22833;&#20989;&#25968;&#21644;&#19968;&#20010;&#26032;&#39062;&#30340;&#22810;&#36890;&#36947;&#26550;&#26500;&#65292;&#20197;&#20248;&#21270;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2111.09902</link><description>&lt;p&gt;
&#29992;&#22522;&#20110;Transformer&#30340;&#27169;&#22411;&#39044;&#27979;&#20013;&#31561;&#24066;&#20540;&#20844;&#21496;&#36829;&#32422;&#27010;&#29575;
&lt;/p&gt;
&lt;p&gt;
A transformer-based model for default prediction in mid-cap corporate markets. (arXiv:2111.09902v4 [q-fin.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2111.09902
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;Transformer&#27169;&#22411;&#65292;&#23558;&#36829;&#32422;&#39044;&#27979;&#38382;&#39064;&#20316;&#20026;&#22810;&#26631;&#31614;&#26102;&#38388;&#24207;&#21015;&#20998;&#31867;&#38382;&#39064;&#65292;&#24182;&#36890;&#36807;&#27880;&#24847;&#21147;&#28909;&#22270;&#35299;&#37322;&#27169;&#22411;&#39044;&#27979;&#12290;&#21516;&#26102;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#23450;&#20041;&#25439;&#22833;&#20989;&#25968;&#21644;&#19968;&#20010;&#26032;&#39062;&#30340;&#22810;&#36890;&#36947;&#26550;&#26500;&#65292;&#20197;&#20248;&#21270;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24066;&#20540;&#20302;&#20110;100&#20159;&#32654;&#20803;&#30340;&#19978;&#24066;&#20844;&#21496;&#65292;&#21033;&#29992;30&#24180;&#30340;&#32654;&#22269;&#20013;&#31561;&#24066;&#20540;&#20844;&#21496;&#25968;&#25454;&#38598;&#65292;&#39044;&#27979;&#20854;&#20013;&#26399;&#20869;&#30340;&#36829;&#32422;&#27010;&#29575;&#65292;&#24182;&#30830;&#23450;&#36129;&#29486;&#36829;&#32422;&#39118;&#38505;&#30340;&#25968;&#25454;&#26469;&#28304;&#65288;&#22522;&#26412;&#38754;&#12289;&#24066;&#22330;&#25110;&#23450;&#20215;&#25968;&#25454;&#65289;&#12290;&#25105;&#20204;&#23558;&#35813;&#38382;&#39064;&#20316;&#20026;&#22810;&#26631;&#31614;&#26102;&#38388;&#24207;&#21015;&#20998;&#31867;&#38382;&#39064;&#65292;&#24182;&#20351;&#29992;Transformer&#27169;&#22411;&#36827;&#34892;&#39044;&#27979;&#21644;&#27880;&#24847;&#21147;&#28909;&#22270;&#30340;&#35299;&#37322;&#12290;&#20026;&#20102;&#36827;&#19968;&#27493;&#20248;&#21270;&#27169;&#22411;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22810;&#26631;&#31614;&#20998;&#31867;&#30340;&#33258;&#23450;&#20041;&#25439;&#22833;&#20989;&#25968;&#21644;&#19968;&#20010;&#26032;&#39062;&#30340;&#22810;&#36890;&#36947;&#26550;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we study mid-cap companies, i.e. publicly traded companies with less than US $10 billion in market capitalisation. Using a large dataset of US mid-cap companies observed over 30 years, we look to predict the default probability term structure over the medium term and understand which data sources (i.e. fundamental, market or pricing data) contribute most to the default risk. Whereas existing methods typically require that data from different time periods are first aggregated and turned into cross-sectional features, we frame the problem as a multi-label time-series classification problem. We adapt transformer models, a state-of-the-art deep learning model emanating from the natural language processing domain, to the credit risk modelling setting. We also interpret the predictions of these models using attention heat maps. To optimise the model further, we present a custom loss function for multi-label classification and a novel multi-channel architecture with differentia
&lt;/p&gt;</description></item></channel></rss>