<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;&#24038;&#25130;&#23614;&#21644;&#21491;&#25130;&#23614;&#25968;&#25454;&#30340;&#35889;&#39118;&#38505;&#24230;&#37327;&#30340;&#20272;&#35745;&#26041;&#27861;&#65292;&#24182;&#24314;&#31435;&#20102;&#30456;&#24212;&#38750;&#21442;&#25968;&#20272;&#35745;&#30340;&#28176;&#36817;&#27491;&#24577;&#24615;&#21644;Edgeworth&#23637;&#24320;&#65292;&#23545;&#20272;&#35745;&#37327;&#36827;&#34892;&#20102;&#33258;&#20030;&#27861;&#36817;&#20284;&#20998;&#24067;&#65292;&#24182;&#23637;&#31034;&#20855;&#26377;&#20108;&#38454;&#8220;&#20934;&#30830;&#24615;&#8221;&#12290;</title><link>https://arxiv.org/abs/2402.14322</link><description>&lt;p&gt;
&#23545;&#24038;&#25130;&#23614;&#21644;&#21491;&#25130;&#23614;&#25968;&#25454;&#30340;&#35889;&#39118;&#38505;&#24230;&#37327;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Estimation of Spectral Risk Measure for Left Truncated and Right Censored Data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14322
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;&#24038;&#25130;&#23614;&#21644;&#21491;&#25130;&#23614;&#25968;&#25454;&#30340;&#35889;&#39118;&#38505;&#24230;&#37327;&#30340;&#20272;&#35745;&#26041;&#27861;&#65292;&#24182;&#24314;&#31435;&#20102;&#30456;&#24212;&#38750;&#21442;&#25968;&#20272;&#35745;&#30340;&#28176;&#36817;&#27491;&#24577;&#24615;&#21644;Edgeworth&#23637;&#24320;&#65292;&#23545;&#20272;&#35745;&#37327;&#36827;&#34892;&#20102;&#33258;&#20030;&#27861;&#36817;&#20284;&#20998;&#24067;&#65292;&#24182;&#23637;&#31034;&#20855;&#26377;&#20108;&#38454;&#8220;&#20934;&#30830;&#24615;&#8221;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24038;&#25130;&#23614;&#21644;&#21491;&#25130;&#23614;&#25968;&#25454;&#22312;&#20445;&#38505;&#25439;&#22833;&#25968;&#25454;&#20013;&#32463;&#24120;&#36935;&#21040;&#65292;&#36825;&#26159;&#30001;&#20110;&#20813;&#36180;&#39069;&#21644;&#25919;&#31574;&#38480;&#39069;&#36896;&#25104;&#30340;&#12290;&#39118;&#38505;&#20272;&#35745;&#22312;&#20445;&#38505;&#19994;&#20013;&#26159;&#19968;&#39033;&#37325;&#35201;&#20219;&#21153;&#65292;&#22240;&#20026;&#23427;&#26159;&#30830;&#23450;&#21508;&#31181;&#25919;&#31574;&#26465;&#27454;&#19979;&#30340;&#20445;&#36153;&#30340;&#24517;&#35201;&#27493;&#39588;&#12290;&#35889;&#39118;&#38505;&#24230;&#37327;&#22825;&#29983;&#20855;&#26377;&#19968;&#33268;&#24615;&#65292;&#24182;&#19988;&#23558;&#39118;&#38505;&#24230;&#37327;&#19982;&#29992;&#25143;&#30340;&#39118;&#38505;&#21388;&#24694;&#32852;&#31995;&#36215;&#26469;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#24038;&#25130;&#23614;&#21644;&#21491;&#25130;&#23614;&#25968;&#25454;&#30340;&#35889;&#39118;&#38505;&#24230;&#37327;&#30340;&#20272;&#35745;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#20135;&#21697;&#26497;&#38480;&#20272;&#35745;&#30340;&#35889;&#39118;&#38505;&#24230;&#37327;&#30340;&#38750;&#21442;&#25968;&#20272;&#35745;&#65292;&#24182;&#20026;&#25105;&#20204;&#25552;&#20986;&#30340;&#20272;&#35745;&#37327;&#24314;&#31435;&#20102;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;&#25105;&#20204;&#36824;&#24320;&#21457;&#20102;&#25105;&#20204;&#25552;&#20986;&#30340;&#20272;&#35745;&#37327;&#30340;Edgeworth&#23637;&#24320;&#12290;&#24341;&#20837;&#33258;&#20030;&#27861;&#26469;&#36817;&#20284;&#25105;&#20204;&#25552;&#20986;&#30340;&#20272;&#35745;&#37327;&#30340;&#20998;&#24067;&#65292;&#24182;&#26174;&#31034;&#20854;&#20026;&#20108;&#38454;&#8220;&#20934;&#30830;&#8221;&#12290;&#36827;&#34892;&#33945;&#29305;&#21345;&#27931;&#30740;&#31350;&#26469;&#27604;&#36739;&#25152;&#25552;&#20986;&#30340;&#35889;&#39118;&#38505;&#24230;&#37327;&#20272;&#35745;&#19982;t
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14322v1 Announce Type: cross  Abstract: Left truncated and right censored data are encountered frequently in insurance loss data due to deductibles and policy limits. Risk estimation is an important task in insurance as it is a necessary step for determining premiums under various policy terms. Spectral risk measures are inherently coherent and have the benefit of connecting the risk measure to the user's risk aversion. In this paper we study the estimation of spectral risk measure based on left truncated and right censored data. We propose a non parametric estimator of spectral risk measure using the product limit estimator and establish the asymptotic normality for our proposed estimator. We also develop an Edgeworth expansion of our proposed estimator. The bootstrap is employed to approximate the distribution of our proposed estimator and shown to be second order ``accurate''. Monte Carlo studies are conducted to compare the proposed spectral risk measure estimator with t
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25193;&#23637;&#20102;&#23545;&#20914;&#20272;&#20215;&#35843;&#25972;&#30340;&#27010;&#24565;&#21040;&#21487;&#36174;&#22238;&#36164;&#20135;&#19978;&#65292;&#29992;&#20110;&#37327;&#21270;&#21644;&#22788;&#29702;&#36798;&#23572;&#25991;&#27169;&#22411;&#39118;&#38505;&#12290;&#20855;&#20307;&#22320;&#65292;&#36890;&#36807;&#22312;&#22909;&#27169;&#22411;&#20013;&#27169;&#25311;&#22351;&#27169;&#22411;&#30340;&#23545;&#20914;&#34892;&#20026;&#65292;&#25581;&#31034;&#20102;&#21487;&#36174;&#22238;&#36164;&#20135;&#30340;&#27169;&#22411;&#39118;&#38505;&#25968;&#23398;&#29305;&#24615;&#65292;&#21487;&#36174;&#22238;&#20538;&#21048;&#30340;&#23545;&#20914;&#20272;&#20215;&#35843;&#25972;&#21487;&#33021;&#27604;&#25152;&#24471;&#25910;&#30410;&#20960;&#20493;&#26356;&#22823;&#12290;</title><link>http://arxiv.org/abs/2304.02479</link><description>&lt;p&gt;
&#21487;&#36174;&#22238;&#20538;&#21048;&#30340;&#23545;&#20914;&#20272;&#20215;&#35843;&#25972;
&lt;/p&gt;
&lt;p&gt;
Hedging Valuation Adjustment for Callable Claims. (arXiv:2304.02479v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.02479
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25193;&#23637;&#20102;&#23545;&#20914;&#20272;&#20215;&#35843;&#25972;&#30340;&#27010;&#24565;&#21040;&#21487;&#36174;&#22238;&#36164;&#20135;&#19978;&#65292;&#29992;&#20110;&#37327;&#21270;&#21644;&#22788;&#29702;&#36798;&#23572;&#25991;&#27169;&#22411;&#39118;&#38505;&#12290;&#20855;&#20307;&#22320;&#65292;&#36890;&#36807;&#22312;&#22909;&#27169;&#22411;&#20013;&#27169;&#25311;&#22351;&#27169;&#22411;&#30340;&#23545;&#20914;&#34892;&#20026;&#65292;&#25581;&#31034;&#20102;&#21487;&#36174;&#22238;&#36164;&#20135;&#30340;&#27169;&#22411;&#39118;&#38505;&#25968;&#23398;&#29305;&#24615;&#65292;&#21487;&#36174;&#22238;&#20538;&#21048;&#30340;&#23545;&#20914;&#20272;&#20215;&#35843;&#25972;&#21487;&#33021;&#27604;&#25152;&#24471;&#25910;&#30410;&#20960;&#20493;&#26356;&#22823;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36798;&#23572;&#25991;&#27169;&#22411;&#39118;&#38505;&#26159;&#20132;&#26131;&#32773;&#23492;&#29983;&#20110;&#20013;&#26399;&#31995;&#32479;&#21033;&#28070;&#30340;&#38169;&#20215;&#21644;&#23545;&#20914;&#39118;&#38505;&#65292;&#23427;&#20204;&#20165;&#20165;&#26159;&#38271;&#26399;&#20111;&#25439;&#30340;&#34917;&#20607;&#22240;&#32032;&#65292;&#22240;&#20026;&#22312;&#26497;&#31471;&#24773;&#20917;&#19979;&#65292;&#20132;&#26131;&#32773;&#30340;&#38169;&#35823;&#27169;&#22411;&#19981;&#20877;&#19982;&#24066;&#22330;&#30456;&#21563;&#21512;&#12290;&#36825;&#31181;&#36798;&#23572;&#25991;&#27169;&#22411;&#39118;&#38505;&#30340;Alpha&#27844;&#28431;&#26080;&#27861;&#34987;&#24066;&#22330;&#39118;&#38505;&#24037;&#20855;&#65288;&#22914;&#39118;&#38505;&#20215;&#20540;&#12289;&#39044;&#26399;&#32570;&#21475;&#25110;&#24378;&#35843;&#39118;&#38505;&#20215;&#20540;&#65289;&#25152;&#26816;&#27979;&#12290;&#36798;&#23572;&#25991;&#27169;&#22411;&#39118;&#38505;&#21482;&#33021;&#36890;&#36807;&#27169;&#25311;&#22351;&#27169;&#22411;&#22312;&#22909;&#27169;&#22411;&#20013;&#30340;&#23545;&#20914;&#34892;&#20026;&#26469;&#35266;&#23519;&#12290;&#26412;&#25991;&#23558;&#23545;&#20914;&#20272;&#20215;&#35843;&#25972;&#30340;&#27010;&#24565;&#25193;&#23637;&#21040;&#21487;&#36174;&#22238;&#36164;&#20135;&#19978;&#65292;&#29992;&#20110;&#37327;&#21270;&#21644;&#22788;&#29702;&#36825;&#31181;&#39118;&#38505;&#12290;&#20197;&#19968;&#20010;&#20855;&#26377;&#26679;&#24335;&#30340;&#21487;&#36174;&#22238;&#33539;&#22260;&#35745;&#20215;&#20026;&#20363;&#65292;&#35828;&#26126;&#20102;&#21487;&#36174;&#22238;&#36164;&#20135;&#30340;&#36798;&#23572;&#25991;&#27169;&#22411;&#39118;&#38505;&#25968;&#23398;&#24615;&#36136;&#12290;&#22312;&#32771;&#34385;&#38169;&#35823;&#30340;&#23545;&#20914;&#21644;&#34892;&#26435;&#20915;&#31574;&#26102;&#65292;&#23545;&#20914;&#20272;&#20215;&#35843;&#25972;&#30340;&#22823;&#23567;&#21487;&#33021;&#27604;&#25152;&#24471;&#25910;&#30410;&#20960;&#20493;&#26356;&#22823;&#12290;
&lt;/p&gt;
&lt;p&gt;
Darwinian model risk is the risk of mis-price-and-hedge biased toward short-to-medium systematic profits of a trader, which are only the compensator of long term losses becoming apparent under extreme scenarios where the bad model of the trader no longer calibrates to the market. The alpha leakages that characterize Darwinian model risk are undetectable by the usual market risk tools such as value-at-risk, expected shortfall, or stressed value-at-risk.Darwinian model risk can only be seen by simulating the hedging behavior of a bad model within a good model. In this paper we extend to callable assets the notion of hedging valuation adjustment introduced in previous work for quantifying and handling such risk. The mathematics of Darwinian model risk for callable assets are illustrated by exact numerics on a stylized callable range accrual example. Accounting for the wrong hedges and exercise decisions, the magnitude of the hedging valuation adjustment can be several times larger than th
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20855;&#26377;&#38543;&#26426;&#21160;&#24577;&#21644;&#20869;&#29983;&#22256;&#22659;&#20256;&#26579;&#30340;&#38134;&#34892;&#38388;&#20132;&#26131;&#27169;&#22411;&#65292;&#20854;&#20013;&#32771;&#34385;&#20102;&#32593;&#32476;&#20869;&#23545;&#26410;&#26469;&#36829;&#32422;&#30340;&#25285;&#24551;&#12290;&#35813;&#27169;&#22411;&#36890;&#36807;&#26465;&#20214;&#27010;&#29575;&#26469;&#30830;&#23450;&#24403;&#26085;&#30340;&#36164;&#20135;&#36127;&#20538;&#34920;&#65292;&#24182;&#25552;&#20379;&#20102;&#31995;&#32479;&#39118;&#38505;&#24863;&#30693;&#30340;&#26399;&#38480;&#32467;&#26500;&#12290;</title><link>http://arxiv.org/abs/2211.15431</link><description>&lt;p&gt;
&#21160;&#24577;&#38134;&#34892;&#38388;&#20132;&#26131;&#27169;&#22411;&#20013;&#30340;&#20869;&#29983;&#22256;&#22659;&#20256;&#26579;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Endogenous Distress Contagion in a Dynamic Interbank Model. (arXiv:2211.15431v2 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.15431
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20855;&#26377;&#38543;&#26426;&#21160;&#24577;&#21644;&#20869;&#29983;&#22256;&#22659;&#20256;&#26579;&#30340;&#38134;&#34892;&#38388;&#20132;&#26131;&#27169;&#22411;&#65292;&#20854;&#20013;&#32771;&#34385;&#20102;&#32593;&#32476;&#20869;&#23545;&#26410;&#26469;&#36829;&#32422;&#30340;&#25285;&#24551;&#12290;&#35813;&#27169;&#22411;&#36890;&#36807;&#26465;&#20214;&#27010;&#29575;&#26469;&#30830;&#23450;&#24403;&#26085;&#30340;&#36164;&#20135;&#36127;&#20538;&#34920;&#65292;&#24182;&#25552;&#20379;&#20102;&#31995;&#32479;&#39118;&#38505;&#24863;&#30693;&#30340;&#26399;&#38480;&#32467;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#20855;&#26377;&#38543;&#26426;&#21160;&#24577;&#30340;&#38134;&#34892;&#38388;&#32593;&#32476;&#65292;&#24182;&#32771;&#34385;&#20102;&#32593;&#32476;&#20869;&#23545;&#26410;&#26469;&#36829;&#32422;&#30340;&#25285;&#24551;&#25152;&#24341;&#36215;&#30340;&#20869;&#29983;&#22256;&#22659;&#20256;&#26579;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#36825;&#28041;&#21450;&#21040;&#19968;&#31181;&#27491;&#21521;-&#21453;&#21521;&#26041;&#27861;&#26469;&#30830;&#23450;&#22343;&#34913;&#21160;&#21147;&#23398;&#65292;&#36890;&#36807;&#24066;&#22330;&#20215;&#20540;&#35843;&#25972;&#26469;&#30830;&#20445;&#38134;&#34892;&#38388;&#20538;&#26435;&#30340;&#20272;&#20540;&#65292;&#24182;&#36890;&#36807;&#26465;&#20214;&#27010;&#29575;&#26469;&#30830;&#23450;&#24403;&#26085;&#30340;&#36164;&#20135;&#36127;&#20538;&#34920;&#12290;&#19982;&#38745;&#24577;&#27169;&#22411;&#19981;&#21516;&#65292;&#25152;&#24471;&#21040;&#30340;&#22256;&#22659;&#20256;&#26579;&#20316;&#20026;&#19968;&#39033;&#38543;&#26426;&#27874;&#21160;&#29575;&#39033;&#65292;&#20869;&#29983;&#22320;&#23548;&#33268;&#20102;&#27874;&#21160;&#29575;&#32858;&#31867;&#21644;&#26174;&#33879;&#30340;&#19979;&#34892;&#26464;&#26438;&#25928;&#24212;&#12290;&#27492;&#22806;&#65292;&#36890;&#36807;&#32771;&#34385;&#22810;&#20010;&#21040;&#26399;&#26085;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#20026;&#38134;&#34892;&#38388;&#20538;&#26435;&#25552;&#20379;&#20102;&#31995;&#32479;&#39118;&#38505;&#24863;&#30693;&#30340;&#26399;&#38480;&#32467;&#26500;&#12290;&#25105;&#20204;&#20998;&#20026;&#20004;&#20010;&#37096;&#20998;&#36827;&#34892;&#20998;&#26512;&#65306;(i) &#21333;&#19968;&#21040;&#26399;&#26085;&#35774;&#32622;&#65292;&#19982;&#20256;&#32479;&#30340;&#38134;&#34892;&#38388;&#32593;&#32476;&#25991;&#29486;&#38750;&#24120;&#21305;&#37197;&#65292;(ii) &#22810;&#20010;&#21040;&#26399;&#26085;&#35774;&#32622;&#65292;&#20197;&#30740;&#31350;&#31995;&#32479;&#39118;&#38505;&#23545;&#25972;&#20010;&#26399;&#38480;&#32467;&#26500;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this work we introduce an interbank network with stochastic dynamics subject to an endogenous notion of distress contagion that accounts for worries about future defaults within the network. Specifically, this entails a forward-backward approach to the equilibrium dynamics, enforced by a mark-to-market valuation adjustment for interbank claims, whereby the conditional probabilities of future defaults are required to determine today's balance sheets. Distinct from static models, the resulting distress contagion acts as a stochastic volatility term which leads, endogenously, to volatility clustering and a marked downside leverage effect. Moreover, by considering multiple maturities, our model provides a systemic risk-aware term structure for interbank claims. We present the analysis in two parts: (i) a single maturity setting that closely matches the traditional interbank network literature, and (ii) a multiple maturity setting to examine the impact of systemic risk on the full term s
&lt;/p&gt;</description></item></channel></rss>