<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#20122;&#39532;&#36874;&#27969;&#22495;&#21450;&#25289;&#19969;&#32654;&#27954;&#21644;&#21152;&#21202;&#27604;&#22320;&#21306;&#27491;&#32463;&#21382;&#29615;&#22659;&#25361;&#25112;&#19982;&#21464;&#38761;&#28508;&#21147;&#24182;&#23384;&#30340;&#26102;&#21051;&#65292;&#26412;&#25253;&#21578;&#26088;&#22312;&#25581;&#31034;&#21508;&#31181;&#31038;&#20250;&#29983;&#24577;&#38382;&#39064;&#12289;&#25216;&#26415;&#36827;&#27493;&#12289;&#31038;&#21306;&#20513;&#35758;&#21644;&#25112;&#30053;&#34892;&#21160;&#65292;&#26377;&#21161;&#20110;&#25512;&#21160;&#21306;&#22495;&#30340;&#29983;&#29289;&#22280;&#21487;&#25345;&#32493;&#24615;&#21644;&#38887;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.18521</link><description>&lt;p&gt;
&#37325;&#23450;&#21521;&#27969;&#21160;--&#25506;&#32034;&#20122;&#39532;&#36874;&#26410;&#26469;
&lt;/p&gt;
&lt;p&gt;
Redirecting Flows -- Navigating the Future of the Amazon
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18521
&lt;/p&gt;
&lt;p&gt;
&#20122;&#39532;&#36874;&#27969;&#22495;&#21450;&#25289;&#19969;&#32654;&#27954;&#21644;&#21152;&#21202;&#27604;&#22320;&#21306;&#27491;&#32463;&#21382;&#29615;&#22659;&#25361;&#25112;&#19982;&#21464;&#38761;&#28508;&#21147;&#24182;&#23384;&#30340;&#26102;&#21051;&#65292;&#26412;&#25253;&#21578;&#26088;&#22312;&#25581;&#31034;&#21508;&#31181;&#31038;&#20250;&#29983;&#24577;&#38382;&#39064;&#12289;&#25216;&#26415;&#36827;&#27493;&#12289;&#31038;&#21306;&#20513;&#35758;&#21644;&#25112;&#30053;&#34892;&#21160;&#65292;&#26377;&#21161;&#20110;&#25512;&#21160;&#21306;&#22495;&#30340;&#29983;&#29289;&#22280;&#21487;&#25345;&#32493;&#24615;&#21644;&#38887;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20122;&#39532;&#36874;&#27969;&#22495;&#21450;&#25289;&#19969;&#32654;&#27954;&#21644;&#21152;&#21202;&#27604;&#22320;&#21306;&#27491;&#22788;&#20110;&#19968;&#20010;&#20851;&#38190;&#26102;&#21051;&#65292;&#27491;&#22312;&#24212;&#23545;&#32039;&#36843;&#30340;&#29615;&#22659;&#25361;&#25112;&#65292;&#21516;&#26102;&#36890;&#36807;&#21019;&#26032;&#35299;&#20915;&#26041;&#26696;&#26377;&#24040;&#22823;&#28508;&#21147;&#23454;&#29616;&#21464;&#38761;&#12290;&#26412;&#25253;&#21578;&#38416;&#26126;&#20102;&#31038;&#20250;&#29983;&#24577;&#38382;&#39064;&#12289;&#25216;&#26415;&#36827;&#27493;&#12289;&#31038;&#21306;&#20027;&#23548;&#30340;&#20513;&#35758;&#21644;&#25112;&#30053;&#34892;&#21160;&#31561;&#22810;&#26679;&#21270;&#39046;&#22495;&#65292;&#36825;&#20123;&#21487;&#20197;&#24110;&#21161;&#20419;&#36827;&#25972;&#20010;&#22320;&#21306;&#30340;&#29983;&#29289;&#22280;&#21487;&#25345;&#32493;&#24615;&#21644;&#38887;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18521v1 Announce Type: new  Abstract: The Amazon Basin, and the Latin America and Caribbean (LAC) region more broadly, stands at a critical juncture, grappling with pressing environmental challenges while holding immense potential for transformative change through innovative solutions. This report illuminates the diverse landscape of social-ecological issues, technological advancements, community-led initiatives, and strategic actions that could help foster biosphere-based sustainability and resilience across the region.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28151;&#21512;&#20844;&#24335;&#30340;&#36924;&#36817;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;Barndorff-Nielsen&#21644;Shephard&#27169;&#22411;&#20013;&#23450;&#20215;&#27431;&#24335;&#26399;&#26435;&#12290;&#35813;&#26041;&#27861;&#22522;&#20110;&#26399;&#26435;&#20215;&#26684;&#30340;&#27888;&#21202;&#23637;&#24320;&#65292;&#36890;&#36807;&#36882;&#24402;&#31639;&#27861;&#33719;&#21462;&#20219;&#24847;&#38454;&#25968;&#30340;&#26399;&#26435;&#20215;&#26684;&#30340;&#38381;&#24335;&#36924;&#36817;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#22312;&#32972;&#26223;&#39537;&#21160;&#30340;L\'evy&#36807;&#31243;&#28385;&#36275;&#29305;&#23450;&#26465;&#20214;&#30340;&#24773;&#20917;&#19979;&#65292;&#35813;&#36924;&#36817;&#26041;&#27861;&#22312;&#20498;&#25968;&#39640;&#26031;&#20998;&#24067;&#25110;&#20285;&#39532;&#20998;&#24067;&#30340;&#31283;&#24577;&#20998;&#24067;&#24773;&#20917;&#19979;&#34920;&#29616;&#20248;&#31168;&#65292;&#24182;&#23545;&#35813;&#36924;&#36817;&#26041;&#27861;&#36827;&#34892;&#20102;&#35823;&#24046;&#20998;&#26512;&#65292;&#24471;&#21040;&#20102;&#35823;&#24046;&#30340;&#28176;&#36817;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2401.14390</link><description>&lt;p&gt;
Barndorff-Nielsen&#21644;Shephard&#27169;&#22411;&#20013;&#26399;&#26435;&#23450;&#20215;&#30340;&#39640;&#38454;&#36924;&#36817;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Higher order approximation of option prices in Barndorff-Nielsen and Shephard models. (arXiv:2401.14390v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.14390
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28151;&#21512;&#20844;&#24335;&#30340;&#36924;&#36817;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;Barndorff-Nielsen&#21644;Shephard&#27169;&#22411;&#20013;&#23450;&#20215;&#27431;&#24335;&#26399;&#26435;&#12290;&#35813;&#26041;&#27861;&#22522;&#20110;&#26399;&#26435;&#20215;&#26684;&#30340;&#27888;&#21202;&#23637;&#24320;&#65292;&#36890;&#36807;&#36882;&#24402;&#31639;&#27861;&#33719;&#21462;&#20219;&#24847;&#38454;&#25968;&#30340;&#26399;&#26435;&#20215;&#26684;&#30340;&#38381;&#24335;&#36924;&#36817;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#22312;&#32972;&#26223;&#39537;&#21160;&#30340;L\'evy&#36807;&#31243;&#28385;&#36275;&#29305;&#23450;&#26465;&#20214;&#30340;&#24773;&#20917;&#19979;&#65292;&#35813;&#36924;&#36817;&#26041;&#27861;&#22312;&#20498;&#25968;&#39640;&#26031;&#20998;&#24067;&#25110;&#20285;&#39532;&#20998;&#24067;&#30340;&#31283;&#24577;&#20998;&#24067;&#24773;&#20917;&#19979;&#34920;&#29616;&#20248;&#31168;&#65292;&#24182;&#23545;&#35813;&#36924;&#36817;&#26041;&#27861;&#36827;&#34892;&#20102;&#35823;&#24046;&#20998;&#26512;&#65292;&#24471;&#21040;&#20102;&#35823;&#24046;&#30340;&#28176;&#36817;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28151;&#21512;&#20844;&#24335;&#65288;Hull&#65286;White 1987&#65292;Romano&#65286;Touzi 1997&#65289;&#30340;&#36924;&#36817;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;Barndorff-Nielsen&#21644;Shephard&#27169;&#22411;&#20013;&#23450;&#20215;&#27431;&#24335;&#26399;&#26435;&#12290;&#35813;&#36924;&#36817;&#26041;&#27861;&#22522;&#20110;&#26399;&#26435;&#20215;&#26684;&#30340;&#27888;&#21202;&#23637;&#24320;&#12290;&#23427;&#20351;&#29992;&#36882;&#24402;&#31639;&#27861;&#23454;&#29616;&#65292;&#21487;&#20197;&#24471;&#21040;&#20219;&#24847;&#38454;&#25968;&#30340;&#26399;&#26435;&#20215;&#26684;&#30340;&#38381;&#24335;&#36924;&#36817;&#65288;&#22312;&#32972;&#26223;&#39537;&#21160;&#30340;L\'evy&#36807;&#31243;&#28385;&#36275;&#25216;&#26415;&#26465;&#20214;&#30340;&#24773;&#20917;&#19979;&#65289;&#12290;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#20219;&#20309;&#31867;&#22411;&#30340;Barndorff-Nielsen&#21644;Shephard&#38543;&#26426;&#27874;&#21160;&#29575;&#27169;&#22411;&#12290;&#22312;&#32972;&#26223;&#39537;&#21160;&#30340;L\'evy&#36807;&#31243;&#30340;&#31283;&#24577;&#20998;&#24067;&#20026;&#20498;&#25968;&#39640;&#26031;&#20998;&#24067;&#25110;&#20285;&#39532;&#20998;&#24067;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#32473;&#20986;&#20102;&#26126;&#30830;&#30340;&#32467;&#26524;&#12290;&#22312;&#36825;&#20004;&#31181;&#24773;&#20917;&#19979;&#65292;&#35813;&#36924;&#36817;&#26041;&#27861;&#19982;&#29305;&#24449;&#20989;&#25968;&#20135;&#29983;&#30340;&#26399;&#26435;&#20215;&#26684;&#30456;&#27604;&#20855;&#26377;&#33391;&#22909;&#30340;&#27604;&#36739;&#25928;&#26524;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#36824;&#23545;&#35813;&#36924;&#36817;&#26041;&#27861;&#36827;&#34892;&#20102;&#35823;&#24046;&#20998;&#26512;&#65292;&#37096;&#20998;&#22522;&#20110;Das&#65286;Langren\'e&#65288;2022&#65289;&#30340;&#32467;&#26524;&#12290;&#25105;&#20204;&#24471;&#21040;&#20102;&#35823;&#24046;&#30340;&#28176;&#36817;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present an approximation method based on the mixing formula (Hull &amp; White 1987, Romano &amp; Touzi 1997) for pricing European options in Barndorff-Nielsen and Shephard models. This approximation is based on a Taylor expansion of the option price. It is implemented using a recursive algorithm that allows us to obtain closed form approximations of the option price of any order (subject to technical conditions on the background driving L\'evy process). This method can be used for any type of Barndorff-Nielsen and Shephard stochastic volatility model. Explicit results are presented in the case where the stationary distribution of the background driving L\'evy process is inverse Gaussian or gamma. In both of these cases, the approximation compares favorably to option prices produced by the characteristic function. In particular, we also perform an error analysis of the approximation, which is partially based on the results of Das &amp; Langren\'e (2022). We obtain asymptotic results for the erro
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#32806;&#21512;&#27169;&#22411;&#65292;&#29992;&#20110;&#24314;&#27169;&#37327;&#21270;&#22825;&#27668;&#21644;&#33021;&#28304;&#34893;&#29983;&#21697;&#30340;&#30005;&#21147;&#26085;&#21069;&#20215;&#26684;&#21644;&#26085;&#24179;&#22343;&#28201;&#24230;&#12290;&#36890;&#36807;&#24212;&#29992;&#26465;&#20214;&#26368;&#23567;&#20108;&#20056;&#27861;&#20272;&#35745;&#27169;&#22411;&#21442;&#25968;&#65292;&#24182;&#21033;&#29992;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#27604;&#36739;&#20102;&#19981;&#21516;&#30340;&#34893;&#29983;&#21697;&#23450;&#20215;&#26041;&#27861;&#12290;&#26368;&#32456;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#29992;&#30005;&#21147;&#26399;&#26435;&#21644;&#28201;&#24230;&#26399;&#26435;&#23545;&#21333;&#21521;&#21644;&#21452;&#21521;&#37327;&#21270;&#26399;&#26435;&#36827;&#34892;&#38745;&#24577;&#23545;&#20914;&#30340;&#26126;&#30830;&#20844;&#24335;&#12290;</title><link>http://arxiv.org/abs/2310.07692</link><description>&lt;p&gt;
&#38024;&#23545;&#28201;&#24230;&#21644;&#30005;&#21147;&#30340;&#37327;&#21270;&#34893;&#29983;&#21697;&#30340;&#39118;&#38505;&#20272;&#20540;
&lt;/p&gt;
&lt;p&gt;
Risk valuation of quanto derivatives on temperature and electricity. (arXiv:2310.07692v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.07692
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#32806;&#21512;&#27169;&#22411;&#65292;&#29992;&#20110;&#24314;&#27169;&#37327;&#21270;&#22825;&#27668;&#21644;&#33021;&#28304;&#34893;&#29983;&#21697;&#30340;&#30005;&#21147;&#26085;&#21069;&#20215;&#26684;&#21644;&#26085;&#24179;&#22343;&#28201;&#24230;&#12290;&#36890;&#36807;&#24212;&#29992;&#26465;&#20214;&#26368;&#23567;&#20108;&#20056;&#27861;&#20272;&#35745;&#27169;&#22411;&#21442;&#25968;&#65292;&#24182;&#21033;&#29992;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#27604;&#36739;&#20102;&#19981;&#21516;&#30340;&#34893;&#29983;&#21697;&#23450;&#20215;&#26041;&#27861;&#12290;&#26368;&#32456;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#29992;&#30005;&#21147;&#26399;&#26435;&#21644;&#28201;&#24230;&#26399;&#26435;&#23545;&#21333;&#21521;&#21644;&#21452;&#21521;&#37327;&#21270;&#26399;&#26435;&#36827;&#34892;&#38745;&#24577;&#23545;&#20914;&#30340;&#26126;&#30830;&#20844;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#32806;&#21512;&#27169;&#22411;&#65292;&#29992;&#20110;&#24314;&#27169;&#37327;&#21270;&#22825;&#27668;&#21644;&#33021;&#28304;&#34893;&#29983;&#21697;&#30340;&#30005;&#21147;&#26085;&#21069;&#20215;&#26684;&#21644;&#26085;&#24179;&#22343;&#28201;&#24230;&#12290;&#36825;&#20123;&#20135;&#21697;&#20197;&#20854;&#33021;&#23545;&#25239;&#20307;&#37327;&#21644;&#20215;&#26684;&#39118;&#38505;&#32780;&#21463;&#21040;&#27426;&#36814;&#12290;&#36890;&#36807;&#30001;&#24067;&#26391;&#36816;&#21160;&#21644;&#27491;&#20498;Gaussian L\'evy&#36807;&#31243;&#39537;&#21160;&#30340;&#38750;&#40784;&#27425;Ornstein-Uhlenbeck&#36807;&#31243;&#23545;&#30005;&#21147;&#26085;&#21069;&#20215;&#26684;&#21644;&#26085;&#24179;&#22343;&#28201;&#24230;&#36827;&#34892;&#24314;&#27169;&#65292;&#20174;&#32780;&#20801;&#35768;&#22312;&#23427;&#20204;&#20043;&#38388;&#21253;&#21547;&#20851;&#32852;&#12290;&#24320;&#21457;&#20102;&#26465;&#20214;&#26368;&#23567;&#20108;&#20056;&#27861;&#26469;&#20272;&#35745;&#27169;&#22411;&#30340;&#19981;&#21516;&#21442;&#25968;&#65292;&#24182;&#22312;&#23454;&#38469;&#25968;&#25454;&#19978;&#36827;&#34892;&#24212;&#29992;&#12290;&#38543;&#21518;&#65292;&#24471;&#21040;&#20102;&#21253;&#25324;&#37327;&#21270;&#26399;&#26435;&#22312;&#20869;&#30340;&#34893;&#29983;&#21697;&#30340;&#26126;&#30830;&#21644;&#21322;&#26126;&#30830;&#20844;&#24335;&#65292;&#24182;&#19982;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#26126;&#30830;&#30340;&#20844;&#24335;&#20197;&#36890;&#36807;&#30005;&#21147;&#26399;&#26435;&#21644;&#28201;&#24230;&#26399;&#26435;&#65288;CDD&#25110;HDD&#65289;&#30340;&#32452;&#21512;&#26469;&#23545;&#21333;&#21521;&#21644;&#21452;&#21521;&#37327;&#21270;&#26399;&#26435;&#36827;&#34892;&#38745;&#24577;&#23545;&#20914;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper develops a coupled model for day-ahead electricity prices and average daily temperature which allows to model quanto weather and energy derivatives. These products have gained on popularity as they enable to hedge against both volumetric and price risks. Electricity day-ahead prices and average daily temperatures are modelled through non homogeneous Ornstein-Uhlenbeck processes driven by a Brownian motion and a Normal Inverse Gaussian L\'evy process, which allows to include dependence between them. A Conditional Least Square method is developed to estimate the different parameters of the model and used on real data. Then, explicit and semi-explicit formulas are obtained for derivatives including quanto options and compared with Monte Carlo simulations. Last, we develop explicit formulas to hedge statically single and double sided quanto options by a portfolio of electricity options and temperature options (CDD or HDD).
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#19982;&#24066;&#22330;&#20132;&#26131;&#12289;&#20215;&#26684;&#21644;&#22238;&#25253;&#30340;&#32479;&#35745;&#30697;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#24182;&#20171;&#32461;&#20102;&#19968;&#20010;&#20108;&#27425;&#24179;&#22343;&#36807;&#31243;&#26469;&#30830;&#23450;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#30340;&#32479;&#35745;&#30697;&#12290;</title><link>http://arxiv.org/abs/2310.05971</link><description>&lt;p&gt;
&#32463;&#27982;&#29702;&#35770;&#20316;&#20026;&#32479;&#35745;&#30697;&#30340;&#36880;&#27493;&#36924;&#36817;
&lt;/p&gt;
&lt;p&gt;
Economic Theory as Successive Approximations of Statistical Moments. (arXiv:2310.05971v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.05971
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#19982;&#24066;&#22330;&#20132;&#26131;&#12289;&#20215;&#26684;&#21644;&#22238;&#25253;&#30340;&#32479;&#35745;&#30697;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#24182;&#20171;&#32461;&#20102;&#19968;&#20010;&#20108;&#27425;&#24179;&#22343;&#36807;&#31243;&#26469;&#30830;&#23450;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#30340;&#32479;&#35745;&#30697;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24378;&#35843;&#20102;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#25551;&#36848;&#19982;&#24066;&#22330;&#20132;&#26131;&#12289;&#20215;&#26684;&#21644;&#22238;&#25253;&#30340;&#32479;&#35745;&#30697;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#25105;&#20204;&#23558;&#22312;&#26102;&#38388;&#38388;&#38548;&#916;&#20869;&#30340;&#32463;&#27982;&#20132;&#26131;&#35270;&#20026;&#21807;&#19968;&#20915;&#23450;&#20219;&#20309;&#32463;&#27982;&#21464;&#37327;&#21464;&#21270;&#30340;&#22240;&#32032;&#12290;&#25105;&#20204;&#23558;&#916;&#26399;&#38388;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#20132;&#26131;&#37327;&#30340;&#38543;&#26426;&#24615;&#35270;&#20026;&#20215;&#26684;&#21644;&#22238;&#25253;&#30340;&#38543;&#26426;&#24615;&#30340;&#26681;&#28304;&#12290;&#25105;&#20204;&#25551;&#36848;&#20102;&#916;&#26399;&#38388;&#20215;&#26684;&#21644;&#22238;&#25253;&#30340;&#22522;&#20110;&#24066;&#22330;&#30340;&#31532;n&#20010;&#32479;&#35745;&#30697;&#22914;&#20309;&#20381;&#36182;&#20110;&#20132;&#26131;&#20215;&#20540;&#21644;&#20132;&#26131;&#37327;&#30340;n&#20010;&#32479;&#35745;&#30697;&#65292;&#25110;&#32773;&#31561;&#20215;&#22320;&#65292;&#22914;&#20309;&#20381;&#36182;&#20110;&#916;&#26399;&#38388;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#20132;&#26131;&#37327;&#30340;n&#27425;&#26041;&#20043;&#21644;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#20108;&#27425;&#24179;&#22343;&#36807;&#31243;&#65292;&#30830;&#23450;&#20102;&#22312;&#36739;&#22823;&#30340;&#24179;&#22343;&#38388;&#38548;&#916;2&gt;&gt;&#916;&#20869;&#30340;&#20132;&#26131;&#12289;&#20215;&#26684;&#21644;&#22238;&#25253;&#30340;&#32479;&#35745;&#30697;&#12290;&#21516;&#26679;&#22320;&#65292;&#916;2&gt;&gt;&#916;&#26399;&#38388;&#30340;&#20108;&#27425;&#24179;&#22343;&#36807;&#31243;&#24341;&#20837;&#20102;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#30340;&#32479;&#35745;&#30697;&#65292;&#36825;&#20123;&#32479;&#35745;&#30697;&#26159;&#30001;&#20132;&#26131;&#12289;&#20215;&#26684;&#21644;&#22238;&#25253;&#30340;n&#27425;&#26041;&#21644;&#20043;&#21644;&#26469;&#30830;&#23450;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper highlights the links between the descriptions of macroeconomic variables and statistical moments of market trade, price, and return. We consider economic transactions during the averaging time interval {\Delta} as the exclusive matter that determines the change of any economic variables. We regard the stochasticity of market trade values and volumes during {\Delta} as the only root of the random properties of price and return. We describe how the market-based n-th statistical moments of price and return during {\Delta} depend on the n-th statistical moments of trade values and volumes or equally on sums during {\Delta} of the n-th power of market trade values and volumes. We introduce the secondary averaging procedure that defines statistical moments of trade, price, and return during the averaging interval {\Delta}2&gt;&gt;{\Delta}. As well, the secondary averaging during {\Delta}2&gt;&gt;{\Delta} introduces statistical moments of macroeconomic variables, which were determined as sums 
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#36890;&#36807;&#32463;&#27982;&#23454;&#39564;&#27979;&#35797;&#20102;&#22312;&#39034;&#24207;&#20844;&#20849;&#29289;&#21697;&#21338;&#24328;&#20013;&#32463;&#27982;&#23398;&#27169;&#22411;&#30340;&#29702;&#35770;&#39044;&#27979;&#12290;&#32467;&#26524;&#26174;&#31034;&#22823;&#32422;25%&#30340;&#21463;&#35797;&#32773;&#30340;&#34892;&#20026;&#19982;&#29702;&#35770;&#39044;&#27979;&#19968;&#33268;&#65292;&#20294;&#20063;&#35266;&#23519;&#21040;&#20102;&#20854;&#20182;&#34892;&#20026;&#31867;&#22411;&#30340;&#23384;&#22312;&#12290;</title><link>http://arxiv.org/abs/2308.00179</link><description>&lt;p&gt;
&#22312;&#19968;&#20010;&#39034;&#24207;&#20844;&#20849;&#29289;&#21697;&#21338;&#24328;&#20013;&#30340;&#20301;&#32622;&#19981;&#30830;&#23450;&#24615;&#65306;&#19968;&#20010;&#23454;&#39564;
&lt;/p&gt;
&lt;p&gt;
Position Uncertainty in a Sequential Public Goods Game: An Experiment. (arXiv:2308.00179v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.00179
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#36890;&#36807;&#32463;&#27982;&#23454;&#39564;&#27979;&#35797;&#20102;&#22312;&#39034;&#24207;&#20844;&#20849;&#29289;&#21697;&#21338;&#24328;&#20013;&#32463;&#27982;&#23398;&#27169;&#22411;&#30340;&#29702;&#35770;&#39044;&#27979;&#12290;&#32467;&#26524;&#26174;&#31034;&#22823;&#32422;25%&#30340;&#21463;&#35797;&#32773;&#30340;&#34892;&#20026;&#19982;&#29702;&#35770;&#39044;&#27979;&#19968;&#33268;&#65292;&#20294;&#20063;&#35266;&#23519;&#21040;&#20102;&#20854;&#20182;&#34892;&#20026;&#31867;&#22411;&#30340;&#23384;&#22312;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Gallice&#21644;Monz&#243;n&#65288;2019&#65289;&#25552;&#20986;&#20102;&#19968;&#31181;&#33021;&#22815;&#22312;&#26377;&#38480;&#25968;&#37327;&#30340;&#33258;&#31169;&#20195;&#29702;&#20043;&#38388;&#32500;&#25345;&#20840;&#38754;&#21512;&#20316;&#30340;&#33258;&#28982;&#29615;&#22659;&#12290;&#20182;&#20204;&#35777;&#26126;&#65292;&#22312;&#19968;&#20010;&#39034;&#24207;&#20844;&#20849;&#29289;&#21697;&#21338;&#24328;&#20013;&#65292;&#20195;&#29702;&#20154;&#32570;&#20047;&#23545;&#33258;&#24049;&#22312;&#24207;&#21015;&#20013;&#20301;&#32622;&#30340;&#30693;&#35782;&#65292;&#20294;&#21487;&#20197;&#35266;&#23519;&#21040;&#19968;&#20123;&#21069;&#20219;&#30340;&#34892;&#21160;&#65292;&#30001;&#20110;&#20195;&#29702;&#20154;&#26377;&#28608;&#21169;&#35753;&#28508;&#22312;&#30340;&#32487;&#20219;&#32773;&#25928;&#20223;&#33258;&#24049;&#30340;&#36129;&#29486;&#65292;&#25152;&#20197;&#20840;&#38754;&#36129;&#29486;&#20250;&#22312;&#22343;&#34913;&#20013;&#20986;&#29616;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#36890;&#36807;&#32463;&#27982;&#23454;&#39564;&#26469;&#27979;&#35797;&#36825;&#20010;&#27169;&#22411;&#30340;&#29702;&#35770;&#39044;&#27979;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#19977;&#20010;&#22788;&#29702;&#65292;&#21464;&#21270;&#20102;&#21463;&#35797;&#32773;&#21487;&#20197;&#35266;&#23519;&#21040;&#30340;&#36807;&#21435;&#34892;&#21160;&#20449;&#24687;&#30340;&#25968;&#37327;&#20197;&#21450;&#20182;&#20204;&#30340;&#20301;&#32622;&#24847;&#35782;&#12290;&#36890;&#36807;&#20005;&#26684;&#30340;&#32467;&#26500;&#35745;&#37327;&#20998;&#26512;&#65292;&#25105;&#20204;&#21457;&#29616;&#22823;&#32422;25%&#30340;&#21463;&#35797;&#32773;&#30340;&#34892;&#20026;&#31526;&#21512;&#29702;&#35770;&#39044;&#27979;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#36824;&#35266;&#23519;&#21040;&#21097;&#20313;&#21463;&#35797;&#32773;&#20013;&#23384;&#22312;&#26367;&#20195;&#34892;&#20026;&#31867;&#22411;&#12290;&#20854;&#20013;&#22823;&#22810;&#25968;&#34987;&#24402;&#31867;&#20026;&#26377;&#26465;&#20214;&#30340;&#21512;&#20316;&#32773;&#12290;
&lt;/p&gt;
&lt;p&gt;
Gallice and Monz\'on (2019) present a natural environment that sustains full co-operation in one-shot social dilemmas among a finite number of self-interested agents. They demonstrate that in a sequential public goods game, where agents lack knowledge of their position in the sequence but can observe some predecessors' actions, full contribution emerges in equilibrium due to agents' incentive to induce potential successors to follow suit. In this study, we aim to test the theoretical predictions of this model through an economic experiment. We conducted three treatments, varying the amount of information about past actions that a subject can observe, as well as their positional awareness. Through rigorous structural econometric analysis, we found that approximately 25% of the subjects behaved in line with the theoretical predictions. However, we also observed the presence of alternative behavioural types among the remaining subjects. The majority were classified as conditional co-opera
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#30740;&#31350;&#20102;&#30899;&#31246;&#22312;&#20449;&#36151;&#32452;&#21512;&#20013;&#30340;&#20256;&#25773;&#65292;&#36890;&#36807;&#32771;&#34385;&#23439;&#35266;&#32463;&#27982;&#22240;&#32032;&#65292;&#25551;&#36848;&#20102;&#30899;&#31246;&#23545;&#20844;&#21496;&#20215;&#20540;&#21644;&#20449;&#36151;&#39118;&#38505;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2307.12695</link><description>&lt;p&gt;
&#30899;&#31246;&#22312;&#20449;&#36151;&#32452;&#21512;&#20013;&#30340;&#20256;&#25773;&#36890;&#36807;&#23439;&#35266;&#32463;&#27982;&#22240;&#32032;
&lt;/p&gt;
&lt;p&gt;
Propagation of carbon tax in credit portfolio through macroeconomic factors. (arXiv:2307.12695v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.12695
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#30899;&#31246;&#22312;&#20449;&#36151;&#32452;&#21512;&#20013;&#30340;&#20256;&#25773;&#65292;&#36890;&#36807;&#32771;&#34385;&#23439;&#35266;&#32463;&#27982;&#22240;&#32032;&#65292;&#25551;&#36848;&#20102;&#30899;&#31246;&#23545;&#20844;&#21496;&#20215;&#20540;&#21644;&#20449;&#36151;&#39118;&#38505;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#30899;&#31246;&#22312;&#23553;&#38381;&#32463;&#27982;&#20013;&#22914;&#20309;&#22312;&#20449;&#36151;&#32452;&#21512;&#20013;&#20256;&#25773;&#65292;&#24182;&#20934;&#30830;&#25551;&#36848;&#20102;&#30899;&#31246;&#21160;&#24577;&#22914;&#20309;&#24433;&#21709;&#20844;&#21496;&#20215;&#20540;&#21644;&#20449;&#36151;&#39118;&#38505;&#24230;&#37327;&#12290;&#25105;&#20204;&#37319;&#29992;&#38543;&#26426;&#22810;&#37096;&#38376;&#27169;&#22411;&#26469;&#32771;&#34385;&#30899;&#31246;&#23545;&#37096;&#38376;&#20844;&#21496;&#29983;&#20135;&#21644;&#23478;&#24237;&#28040;&#36153;&#30340;&#24433;&#21709;&#12290;&#31246;&#25910;&#26681;&#25454;NGFS&#24773;&#26223;&#25552;&#20379;&#30340;&#30899;&#20215;&#26684;&#36827;&#34892;&#26657;&#20934;&#65292;&#20197;&#21450;&#37096;&#38376;&#23478;&#24237;&#28040;&#36153;&#21644;&#20844;&#21496;&#29983;&#20135;&#20197;&#21450;&#20854;&#30456;&#20851;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#12290;&#23545;&#20110;&#27599;&#20010;&#37096;&#38376;&#65292;&#36825;&#20135;&#29983;&#20102;&#20844;&#21496;&#29983;&#20135;&#21644;&#23478;&#24237;&#28040;&#36153;&#23545;&#30899;&#31246;&#30340;&#25935;&#24863;&#24230;&#20197;&#21450;&#37096;&#38376;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#20801;&#35768;&#25105;&#20204;&#20998;&#26512;&#30701;&#26399;&#30899;&#31246;&#30340;&#24433;&#21709;&#65292;&#19982;&#26631;&#20934;&#30340;&#25972;&#20307;&#35780;&#20272;&#27169;&#22411;&#30456;&#21453;&#65292;&#21518;&#32773;&#26082;&#26159;&#30830;&#23450;&#24615;&#30340;&#65292;&#21448;&#21482;&#33021;&#25429;&#25417;&#27668;&#20505;&#36807;&#28193;&#25919;&#31574;&#30340;&#38271;&#26399;&#36235;&#21183;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#20351;&#29992;&#25240;&#29616;&#29616;&#37329;&#27969;&#37327;&#27861;&#26469;&#35745;&#31639;&#20844;&#21496;&#30340;&#20215;&#20540;&#65292;&#28982;&#21518;&#29992;&#23427;&#26469;&#36827;&#34892;&#36164;&#20135;&#23450;&#20215;&#21644;&#20449;&#29992;&#39118;&#38505;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study how the introduction of carbon taxes in a closed economy propagate in a credit portfolio and precisely describe how carbon taxes dynamics affect the firm value and credit risk measures. We adapt a stochastic multisectoral model to take into account carbon taxes on both sectoral firms' production and household's consumption. Taxes are calibrated on carbon prices, provided by the NGFS scenarios, as well as on sectoral households' consumption and firms' production, together with their related greenhouse gases emissions. For each sector, this yields the sensitivity of firms' production and households' consumption to carbon taxes and the relationships between sectors. Our model allows us to analyze the short-term effects of carbon taxes as opposed to standard Integrated Assessment Models, which are not only deterministic but also only capture long-term trends of climate transition policy. Finally, we use a Discounted Cash Flows methodology to compute firms' values which we then use
&lt;/p&gt;</description></item></channel></rss>