<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#20840;&#29699;&#20803;&#20998;&#26512;&#24471;&#20986;&#65292;&#29983;&#24577;&#31995;&#32479;&#26381;&#21153;&#30456;&#23545;&#20215;&#26684;&#27599;&#24180;&#32422;&#20026;2.2%&#65292;&#29992;&#20110;&#20844;&#20849;&#39033;&#30446;&#35780;&#20272;&#21644;&#29615;&#22659;&#32463;&#27982;&#20250;&#35745;&#20013;&#30340;&#35843;&#25972;&#12290;</title><link>http://arxiv.org/abs/2308.04400</link><description>&lt;p&gt;
&#26377;&#38480;&#30340;&#26367;&#20195;&#24615;&#12289;&#30456;&#23545;&#20215;&#26684;&#21464;&#21160;&#19982;&#20844;&#20849;&#33258;&#28982;&#36164;&#26412;&#20215;&#20540;&#30340;&#25552;&#21319;
&lt;/p&gt;
&lt;p&gt;
Limited substitutability, relative price changes and the uplifting of public natural capital values. (arXiv:2308.04400v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04400
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#20840;&#29699;&#20803;&#20998;&#26512;&#24471;&#20986;&#65292;&#29983;&#24577;&#31995;&#32479;&#26381;&#21153;&#30456;&#23545;&#20215;&#26684;&#27599;&#24180;&#32422;&#20026;2.2%&#65292;&#29992;&#20110;&#20844;&#20849;&#39033;&#30446;&#35780;&#20272;&#21644;&#29615;&#22659;&#32463;&#27982;&#20250;&#35745;&#20013;&#30340;&#35843;&#25972;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#20840;&#29699;&#32463;&#27982;&#30340;&#19981;&#26029;&#22686;&#38271;&#65292;&#29983;&#24577;&#31995;&#32479;&#26381;&#21153;&#24448;&#24448;&#20572;&#28382;&#25110;&#20943;&#23569;&#12290;&#32463;&#27982;&#23398;&#29702;&#35770;&#24050;&#32463;&#25581;&#31034;&#20102;&#22914;&#20309;&#23558;&#36825;&#31181;&#30456;&#23545;&#31232;&#32570;&#24615;&#30340;&#36716;&#21464;&#21453;&#26144;&#21040;&#20844;&#20849;&#39033;&#30446;&#35780;&#20272;&#21644;&#29615;&#22659;&#32463;&#27982;&#20250;&#35745;&#20013;&#65292;&#20294;&#32570;&#20047;&#23454;&#35777;&#35777;&#25454;&#26469;&#23558;&#29702;&#35770;&#20184;&#35832;&#23454;&#36341;&#12290;&#20026;&#20102;&#20272;&#35745;&#21487;&#29992;&#20110;&#36827;&#34892;&#27492;&#31867;&#35843;&#25972;&#30340;&#29983;&#24577;&#31995;&#32479;&#26381;&#21153;&#30456;&#23545;&#20215;&#26684;&#21464;&#21270;&#65292;&#25105;&#20204;&#23545;&#29615;&#22659;&#20215;&#20540;&#35780;&#20272;&#30740;&#31350;&#36827;&#34892;&#20102;&#20840;&#29699;&#20803;&#20998;&#26512;&#65292;&#20197;&#25512;&#23548;&#20986;&#24847;&#24895;&#25903;&#20184;&#25910;&#20837;&#24377;&#24615;&#20316;&#20026;&#26377;&#38480;&#26367;&#20195;&#24615;&#31243;&#24230;&#30340;&#20195;&#29702;&#12290;&#22522;&#20110;749&#20010;&#25910;&#20837;-&#24847;&#24895;&#25903;&#20184;&#23545;&#65292;&#25105;&#20204;&#20272;&#35745;&#24847;&#24895;&#25903;&#20184;&#25910;&#20837;&#24377;&#24615;&#32422;&#20026;0.78&#65288;95-CI&#65306;0.6&#33267;1.0&#65289;&#12290;&#23558;&#36825;&#20123;&#32467;&#26524;&#19982;&#29983;&#24577;&#31995;&#32479;&#26381;&#21153;&#30456;&#23545;&#31232;&#32570;&#24615;&#21464;&#21270;&#30340;&#20840;&#29699;&#25968;&#25454;&#38598;&#32467;&#21512;&#36215;&#26469;&#65292;&#25105;&#20204;&#20272;&#35745;&#29983;&#24577;&#31995;&#32479;&#26381;&#21153;&#30456;&#23545;&#20215;&#26684;&#27599;&#24180;&#32422;&#20026;2.2&#65285;&#12290;&#22312;&#23545;&#38750;&#26408;&#26448;&#26519;&#29983;&#24577;&#31995;&#32479;&#30340;&#33258;&#28982;&#36164;&#26412;&#20272;&#20540;&#20013;&#24212;&#29992;&#20102;&#36825;&#20123;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
As the global economy continues to grow, ecosystem services tend to stagnate or degrow. Economic theory has shown how such shifts in relative scarcities can be reflected in the appraisal of public projects and environmental-economic accounting, but empirical evidence has been lacking to put the theory into practice. To estimate the relative price change in ecosystem services that can be used to make such adjustments, we perform a global meta-analysis of environmental valuation studies to derive income elasticities of willingness to pay (WTP) for ecosystem services as a proxy for the degree of limited substitutability. Based on 749 income-WTP pairs, we estimate an income elasticity of WTP of around 0.78 (95-CI: 0.6 to 1.0). Combining these results with a global data set on shifts in the relative scarcity of ecosystem services, we estimate relative price change of ecosystem services of around 2.2 percent per year. In an application to natural capital valuation of non-timber forest ecosys
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#22810;&#32500;&#22855;&#24322;&#25511;&#21046;&#30340;&#25193;&#23637;&#22343;&#22330;&#25511;&#21046;&#38382;&#39064;&#65292;&#24341;&#20837;&#20102;&#20004;&#23618;&#21442;&#25968;&#21270;&#30340;&#27010;&#24565;&#65292;&#36890;&#36807;&#32479;&#19968;&#21644;&#19968;&#33268;&#22320;&#25554;&#20540;&#36339;&#36291;&#65292;&#25512;&#23548;&#20986;&#25910;&#30410;&#30340;&#26174;&#24335;&#34920;&#31034;&#21644;DPP&#65292;&#24182;&#35299;&#20915;&#20102;&#22855;&#24322;&#25511;&#21046;&#30340;&#20851;&#38190;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2308.04378</link><description>&lt;p&gt;
&#20855;&#26377;&#22810;&#32500;&#22855;&#24322;&#25511;&#21046;&#30340;&#25193;&#23637;&#22343;&#22330;&#25511;&#21046;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Extended mean-field control problems with multi-dimensional singular controls. (arXiv:2308.04378v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04378
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#22810;&#32500;&#22855;&#24322;&#25511;&#21046;&#30340;&#25193;&#23637;&#22343;&#22330;&#25511;&#21046;&#38382;&#39064;&#65292;&#24341;&#20837;&#20102;&#20004;&#23618;&#21442;&#25968;&#21270;&#30340;&#27010;&#24565;&#65292;&#36890;&#36807;&#32479;&#19968;&#21644;&#19968;&#33268;&#22320;&#25554;&#20540;&#36339;&#36291;&#65292;&#25512;&#23548;&#20986;&#25910;&#30410;&#30340;&#26174;&#24335;&#34920;&#31034;&#21644;DPP&#65292;&#24182;&#35299;&#20915;&#20102;&#22855;&#24322;&#25511;&#21046;&#30340;&#20851;&#38190;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20855;&#26377;&#22810;&#32500;&#22855;&#24322;&#25511;&#21046;&#30340;&#25193;&#23637;&#22343;&#22330;&#25511;&#21046;&#38382;&#39064;&#12290;&#22312;&#20998;&#26512;&#22855;&#24322;&#25511;&#21046;&#26102;&#65292;&#20851;&#38190;&#25361;&#25112;&#26159;&#36339;&#36291;&#25104;&#26412;&#30340;&#35745;&#31639;&#12290;&#24403;&#25511;&#21046;&#20026;&#19968;&#32500;&#26102;&#65292;&#26368;&#33258;&#28982;&#30340;&#35745;&#31639;&#26041;&#27861;&#26159;&#32447;&#24615;&#25554;&#20540;&#12290;&#24403;&#25511;&#21046;&#20026;&#22810;&#32500;&#26102;&#65292;&#24773;&#20917;&#26356;&#21152;&#22797;&#26434;&#65292;&#29305;&#21035;&#26159;&#24403;&#27169;&#22411;&#21442;&#25968;&#20381;&#36182;&#20110;&#38468;&#21152;&#30340;&#22343;&#22330;&#20132;&#20114;&#39033;&#26102;&#65292;&#27492;&#26102;&#38656;&#35201;&#22312;&#20998;&#24067;&#21644;&#36335;&#24452;&#19978;"&#20849;&#21516;"&#21644;"&#19968;&#33268;"&#25554;&#20540;&#36339;&#36291;&#12290;&#20026;&#27492;&#65292;&#24341;&#20837;&#20102;&#27010;&#29575;&#36807;&#31243;&#30340;&#20004;&#23618;&#21442;&#25968;&#21270;&#30340;&#26032;&#27010;&#24565;&#12290;&#20004;&#23618;&#21442;&#25968;&#21270;&#20351;&#25105;&#20204;&#33021;&#22815;&#31561;&#20215;&#22320;&#29992;&#25511;&#21046;&#36807;&#31243;&#30340;&#21442;&#25968;&#21270;&#30340;&#36830;&#32493;&#20989;&#25968;&#37325;&#20889;&#25910;&#30410;&#65292;&#24182;&#20197;&#26368;&#23567;&#36339;&#36291;&#25104;&#26412;&#30340;&#24418;&#24335;&#25512;&#23548;&#20986;&#25910;&#30410;&#30340;&#26174;&#24335;&#34920;&#31034;&#12290;&#22522;&#20110;&#27492;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#20855;&#26377;&#22810;&#32500;&#22855;&#24322;&#25511;&#21046;&#30340;&#25193;&#23637;&#22343;&#22330;&#25511;&#21046;&#38382;&#39064;&#30340;DPP&#65288;Determinantal Point Processes&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider extended mean-field control problems with multi-dimensional singular controls. A key challenge when analysing singular controls are jump costs. When controls are one-dimensional, jump costs are most naturally computed by linear interpolation. When the controls are multi-dimensional the situation is more complex, especially when the model parameters depend on an additional mean-field interaction term, in which case one needs to "jointly" and "consistently" interpolate jumps both on a distributional and a pathwise level. This is achieved by introducing the novel concept of two-layer parametrisations of stochastic processes. Two-layer parametrisations allow us to equivalently rewrite rewards in terms of continuous functions of parametrisations of the control process and to derive an explicit representation of rewards in terms of minimal jump costs. From this we derive a DPP for extended mean-field control problems with multi-dimensional singular controls. Under the additional 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#29109;&#30340;&#27010;&#24565;&#30740;&#31350;&#20102;&#21360;&#24230;&#22806;&#27719;&#24066;&#22330;&#22238;&#25253;&#30340;&#35268;&#24459;&#24615;&#65292;&#22312;&#37329;&#34701;&#21361;&#26426;&#26399;&#38388;&#22806;&#27719;&#22238;&#25253;&#30340;&#35268;&#24459;&#24615;&#22686;&#21152;&#12290;</title><link>http://arxiv.org/abs/2308.04181</link><description>&lt;p&gt;
&#37329;&#34701;&#21361;&#26426;&#26399;&#38388;&#30340;&#22806;&#27719;&#22238;&#25253;&#30340;&#35268;&#24459;&#24615;&#65306;&#26469;&#33258;&#21360;&#24230;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Regularity in forex returns during financial distress: Evidence from India. (arXiv:2308.04181v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04181
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#29109;&#30340;&#27010;&#24565;&#30740;&#31350;&#20102;&#21360;&#24230;&#22806;&#27719;&#24066;&#22330;&#22238;&#25253;&#30340;&#35268;&#24459;&#24615;&#65292;&#22312;&#37329;&#34701;&#21361;&#26426;&#26399;&#38388;&#22806;&#27719;&#22238;&#25253;&#30340;&#35268;&#24459;&#24615;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#29109;&#30340;&#27010;&#24565;&#30740;&#31350;&#21360;&#24230;&#22806;&#27719;&#24066;&#22330;&#22238;&#25253;&#30340;&#35268;&#24459;&#24615;/&#38750;&#35268;&#24459;&#24615;&#12290;&#20351;&#29992;&#36817;&#20284;&#29109;&#21644;&#26679;&#26412;&#29109;&#32479;&#35745;&#37327;&#26469;&#34913;&#37327;&#25968;&#25454;&#20013;&#30340;&#21487;&#37325;&#22797;&#24615;&#31243;&#24230;&#65292;&#24182;&#37327;&#21270;&#26102;&#38388;&#27573;&#20026;2006&#24180;&#33267;2021&#24180;&#30340;&#22806;&#27719;&#22238;&#25253;&#30340;&#38543;&#26426;&#24615;&#12290;&#30740;&#31350;&#30340;&#20027;&#35201;&#30446;&#26631;&#26159;&#35266;&#23519;&#22806;&#27719;&#22238;&#25253;&#30340;&#38543;&#26426;&#24615;&#22312;&#32473;&#23450;&#30340;&#26102;&#38388;&#27573;&#20869;&#65292;&#29305;&#21035;&#26159;&#22312;&#20840;&#29699;&#37329;&#34701;&#24066;&#22330;&#20986;&#29616;&#39640;&#24230;&#19981;&#31283;&#23450;&#25110;&#21160;&#33633;&#30340;&#26102;&#26399;&#65292;&#26159;&#22914;&#20309;&#28436;&#21464;&#30340;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#20004;&#20010;&#37325;&#22823;&#30340;&#37329;&#34701;&#21160;&#33633;&#20107;&#20214;&#65292;&#21363;2006&#24180;&#33267;2007&#24180;&#30340;&#27425;&#36151;&#21361;&#26426;&#65292;&#20063;&#34987;&#31216;&#20026;&#20840;&#29699;&#37329;&#34701;&#21361;&#26426;&#65288;GFC&#65289;&#65292;&#20197;&#21450;2020&#24180;&#33267;2021&#24180;&#30340;&#26032;&#20896;&#30123;&#24773;&#12290;&#25105;&#20204;&#30340;&#23454;&#35777;&#32467;&#26524;&#26497;&#22823;&#22320;&#35777;&#23454;&#20102;&#25105;&#20204;&#30340;&#24037;&#20316;&#20551;&#35774;&#65292;&#21363;&#21360;&#24230;&#20027;&#35201;&#22806;&#27719;&#27719;&#29575;&#30340;&#22238;&#25253;&#35268;&#24459;&#24615;&#22312;&#37329;&#34701;&#21361;&#26426;&#26102;&#26399;&#22686;&#21152;&#12290;&#36825;&#19968;&#28857;&#36890;&#36807;&#22238;&#25253;&#30340;&#27874;&#21160;&#29575;&#30340;&#20943;&#23569;&#26469;&#35777;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper uses the concepts of entropy to study the regularity/irregularity of the returns from the Indian Foreign exchange (forex) markets. The Approximate Entropy and Sample Entropy statistics which measure the level of repeatability in the data are used to quantify the randomness in the forex returns from the time period 2006 to 2021. The main objective of the research is to see how the randomness of the foreign exchange returns evolve over the given time period particularly during periods of high financial instability or turbulence in the global financial market. With this objective we look at 2 major financial upheavals, the subprime crisis also known as the Global Financial Crisis (GFC) during 2006-2007 and the recent Covid-19 pandemic during 2020-2021. Our empirical results overwhelmingly confirm our working hypothesis that regularity in the returns of the major Indian foreign exchange rates increases during times of financial crisis. This is evidenced by a decrease in the valu
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#23545;&#26399;&#26435;&#36827;&#34892;&#26399;&#26435;&#30340;&#27010;&#24565;&#65292;&#20351;&#29992;Black-Scholes&#27169;&#22411;&#25512;&#23548;&#20102;&#24494;&#31505;&#26354;&#32447;&#65292;&#25552;&#20379;&#20102;&#20934;&#38381;&#21512;&#30340;&#23450;&#20215;&#20844;&#24335;&#65292;&#24182;&#25506;&#35752;&#20102;&#20215;&#26684;&#19982;&#26631;&#30340;&#36164;&#20135;&#20043;&#38388;&#30340;&#26631;&#20934;&#21270;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2308.04130</link><description>&lt;p&gt;
&#20063;&#21487;&#20197;&#23545;&#26399;&#26435;&#36827;&#34892;&#26399;&#26435;&#65306;&#22914;&#20309;&#20351;&#29992;Black-Scholes&#25512;&#23548;&#24494;&#31505;&#26354;&#32447;
&lt;/p&gt;
&lt;p&gt;
Options are also options on options: how to smile with Black-Scholes. (arXiv:2308.04130v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04130
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#23545;&#26399;&#26435;&#36827;&#34892;&#26399;&#26435;&#30340;&#27010;&#24565;&#65292;&#20351;&#29992;Black-Scholes&#27169;&#22411;&#25512;&#23548;&#20102;&#24494;&#31505;&#26354;&#32447;&#65292;&#25552;&#20379;&#20102;&#20934;&#38381;&#21512;&#30340;&#23450;&#20215;&#20844;&#24335;&#65292;&#24182;&#25506;&#35752;&#20102;&#20215;&#26684;&#19982;&#26631;&#30340;&#36164;&#20135;&#20043;&#38388;&#30340;&#26631;&#20934;&#21270;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35266;&#23519;&#21040;&#65292;&#20855;&#26377;&#34892;&#26435;&#20215;$L &gt; K$&#30340;&#27431;&#24335;&#30475;&#28072;&#26399;&#26435;&#21487;&#20197;&#35270;&#20026;&#20855;&#26377;&#34892;&#26435;&#20215;$L-K$&#30340;&#26399;&#26435;&#23545;&#30475;&#28072;&#26399;&#26435;&#12290;&#22312;&#26080;&#22871;&#21033;&#20551;&#35774;&#19979;&#65292;&#36825;&#31435;&#21363;&#24471;&#20986;&#20004;&#20010;&#21512;&#32422;&#30340;&#20215;&#26684;&#26159;&#19968;&#26679;&#30340;&#65292;&#23436;&#20840;&#19968;&#33324;&#21270;&#12290;&#25105;&#20204;&#35814;&#32454;&#30740;&#31350;&#20102;&#30456;&#23545;&#23450;&#20215;&#20989;&#25968;&#65292;&#23427;&#32473;&#20986;&#20102;&#30475;&#28072;&#26399;&#26435;&#23545;&#30475;&#28072;&#26399;&#26435;&#30340;&#20215;&#26684;&#20316;&#20026;&#20854;&#22522;&#30784;&#30475;&#28072;&#26399;&#26435;&#30340;&#20989;&#25968;&#65292;&#24182;&#20026;Carr-Pelts-Tehranchi&#23478;&#26063;&#20013;&#30340;&#36825;&#20123;&#26032;&#23450;&#20215;&#20989;&#25968;&#25552;&#20379;&#20934;&#38381;&#21512;&#30340;&#20844;&#24335;&#65292;&#20854;&#20013;&#21253;&#25324;Black-Scholes&#27169;&#22411;&#20316;&#20026;&#29305;&#27530;&#24773;&#20917;&#12290;&#25105;&#20204;&#36824;&#30740;&#31350;&#20102;&#23558;&#20215;&#26684;&#20197;&#26631;&#20934;&#21270;&#26041;&#24335;&#38500;&#20197;&#26631;&#30340;&#36164;&#20135;&#65292;&#20316;&#20026;&#28857;&#20215;&#30456;&#23545;&#20215;&#26684;&#30340;&#20989;&#25968;&#30340;&#24615;&#36136;&#65292;&#36825;&#20351;&#25105;&#20204;&#33021;&#22815;&#24471;&#20986;&#20960;&#20010;&#26032;&#30340;&#38381;&#21512;&#20844;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
We observe that a European Call option with strike $L &gt; K$ can be seen as a Call option with strike $L-K$ on a Call option with strike $K$. Under no arbitrage assumptions, this yields immediately that the prices of the two contracts are the same, in full generality. We study in detail the relative pricing function which gives the price of the Call on Call option as a function of its underlying Call option, and provide quasi-closed formula for those new pricing functions in the Carr-Pelts-Tehranchi family [Carr and Pelts, Duality, Deltas, and Derivatives Pricing, 2015] and [Tehranchi, A Black-Scholes inequality: applications and generalisations, Finance Stoch, 2020] that includes the Black-Scholes model as a particular case. We also study the properties of the function that maps the price normalized by the underlier, viewed as a function of the moneyness, to the normalized relative price, which allows us to produce several new closed formulas. In connection to the symmetry transformatio
&lt;/p&gt;</description></item><item><title>&#24191;&#20041;&#36153;&#21202;&#29702;&#35770;&#25552;&#20379;&#20102;&#38500;&#20102;&#23616;&#37096;&#32039;&#33268;&#29366;&#24577;&#31354;&#38388;&#20197;&#22806;&#30340;&#37325;&#35201;&#27169;&#25311;&#65292;&#25193;&#23637;&#20102;&#19982;&#24191;&#20041;&#36153;&#21202;&#36807;&#31243;&#30456;&#20851;&#30340;&#24120;&#35782;&#32467;&#26524;&#65292;&#24182;&#24341;&#20837;&#20102;&#24310;&#20280;&#30340;&#36153;&#21202;&#36807;&#31243;&#27010;&#24565;&#65292;&#36890;&#36807;&#20195;&#25968;&#21516;&#24577;&#30340;&#24191;&#20041;&#36153;&#21202;&#21322;&#32676;&#19982;&#36755;&#36816;&#26041;&#31243;&#21644;&#21152;&#26435;&#31354;&#38388;&#19978;&#30340;&#36830;&#32493;&#21322;&#27969;&#30456;&#20851;&#32852;&#12290;</title><link>http://arxiv.org/abs/2308.03858</link><description>&lt;p&gt;
&#24191;&#20041;&#36153;&#21202;&#29702;&#35770;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Ramifications of generalized Feller theory. (arXiv:2308.03858v1 [math.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.03858
&lt;/p&gt;
&lt;p&gt;
&#24191;&#20041;&#36153;&#21202;&#29702;&#35770;&#25552;&#20379;&#20102;&#38500;&#20102;&#23616;&#37096;&#32039;&#33268;&#29366;&#24577;&#31354;&#38388;&#20197;&#22806;&#30340;&#37325;&#35201;&#27169;&#25311;&#65292;&#25193;&#23637;&#20102;&#19982;&#24191;&#20041;&#36153;&#21202;&#36807;&#31243;&#30456;&#20851;&#30340;&#24120;&#35782;&#32467;&#26524;&#65292;&#24182;&#24341;&#20837;&#20102;&#24310;&#20280;&#30340;&#36153;&#21202;&#36807;&#31243;&#27010;&#24565;&#65292;&#36890;&#36807;&#20195;&#25968;&#21516;&#24577;&#30340;&#24191;&#20041;&#36153;&#21202;&#21322;&#32676;&#19982;&#36755;&#36816;&#26041;&#31243;&#21644;&#21152;&#26435;&#31354;&#38388;&#19978;&#30340;&#36830;&#32493;&#21322;&#27969;&#30456;&#20851;&#32852;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24191;&#20041;&#36153;&#21202;&#29702;&#35770;&#25552;&#20379;&#20102;&#38500;&#20102;&#23616;&#37096;&#32039;&#33268;&#29366;&#24577;&#31354;&#38388;&#20197;&#22806;&#30340;&#37325;&#35201;&#27169;&#25311;&#12290;&#36825;&#22312;&#35299;&#20915;&#26576;&#20123;&#38543;&#26426;&#20559;&#24494;&#20998;&#26041;&#31243;&#12289;&#20998;&#25968;&#36807;&#31243;&#30340;&#39532;&#23572;&#21487;&#22827;&#25552;&#21319;&#65292;&#25110;&#26080;&#38480;&#32500;&#24230;&#30340;&#20223;&#23556;&#21644;&#22810;&#39033;&#24335;&#36807;&#31243;&#20013;&#38750;&#24120;&#26377;&#29992;&#65292;&#22312;&#29305;&#24449;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#29702;&#35770;&#20013;&#21344;&#25454;&#37325;&#35201;&#22320;&#20301;&#12290;&#25105;&#20204;&#25193;&#23637;&#20102;&#19968;&#20123;&#19982;&#24191;&#20041;&#36153;&#21202;&#36807;&#31243;&#30456;&#20851;&#30340;&#24120;&#35782;&#32467;&#26524;&#65292;&#29305;&#21035;&#26159;&#23427;&#20204;&#30340;&#26500;&#36896;&#21644;&#36335;&#24452;&#29305;&#24615;&#65292;&#24182;&#35814;&#32454;&#25552;&#20379;&#20102;&#36890;&#24120;&#30456;&#24403;&#22797;&#26434;&#30340;&#35777;&#26126;&#12290;&#25105;&#20204;&#36824;&#24341;&#20837;&#20102;&#24310;&#20280;&#30340;&#36153;&#21202;&#36807;&#31243;&#30340;&#27010;&#24565;&#65292;&#24182;&#23558;&#20854;&#19982;&#26631;&#20934;&#21644;&#24191;&#20041;&#36807;&#31243;&#36827;&#34892;&#27604;&#36739;&#12290;&#19968;&#20010;&#20851;&#38190;&#30340;&#20363;&#23376;&#26159;&#23558;&#20195;&#25968;&#21516;&#24577;&#30340;&#24191;&#20041;&#36153;&#21202;&#21322;&#32676;&#36890;&#36807;&#29305;&#24449;&#26041;&#27861;&#19982;&#36755;&#36816;&#26041;&#31243;&#21644;&#21152;&#26435;&#31354;&#38388;&#19978;&#30340;&#36830;&#32493;&#21322;&#27969;&#30456;&#20851;&#32852;&#65292;&#21363;&#19968;&#31181;&#38750;&#24120;&#36890;&#29992;&#30340;&#22788;&#29702;&#21152;&#26435;&#31354;&#38388;&#19978;&#24494;&#20998;&#26041;&#31243;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#19968;&#20010;&#21453;&#20363;&#65292;&#23637;&#31034;&#20102;...
&lt;/p&gt;
&lt;p&gt;
Generalized Feller theory provides an important analog to Feller theory beyond locally compact state spaces. This is very useful for solutions of certain stochastic partial differential equations, Markovian lifts of fractional processes, or infinite dimensional affine and polynomial processes which appear prominently in the theory of signature stochastic differential equations. We extend several folklore results related to generalized Feller processes, in particular on their construction and path properties, and provide the often quite sophisticated proofs in full detail. We also introduce the new concept of extended Feller processes and compare them with standard and generalized ones. A key example relates generalized Feller semigroups of algebra homomorphisms via the method of characteristics to transport equations and continuous semiflows on weighted spaces, i.e. a remarkably generic way to treat differential equations on weighted spaces. We also provide a counterexample, which show
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#20351;&#29992;DDM&#27169;&#22411;&#23545;&#31169;&#33829;&#21644;&#19978;&#24066;&#20844;&#21496;&#30340;&#32929;&#26435;&#21644;&#36127;&#20538;&#25152;&#38656;&#22238;&#25253;&#29575;&#36827;&#34892;&#20272;&#35745;&#30340;&#26032;&#26041;&#27861;&#65292;&#20854;&#20013;&#21253;&#25324;&#26368;&#22823;&#20284;&#28982;&#26041;&#27861;&#12289;&#36125;&#21494;&#26031;&#26041;&#27861;&#21644;&#21345;&#23572;&#26364;&#28388;&#27874;&#12290;&#35813;&#27169;&#22411;&#21487;&#29992;&#20110;S&amp;P 500&#25351;&#25968;&#30340;&#20844;&#21496;&#30340;&#21382;&#21490;&#25968;&#25454;&#65292;&#20197;&#20272;&#31639;&#22238;&#25253;&#29575;&#21644;&#36127;&#20538;&#24066;&#22330;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2305.19708</link><description>&lt;p&gt;
&#38656;&#35201;&#22238;&#25253;&#29575;&#30340;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Parameter Estimation Methods of Required Rate of Return. (arXiv:2305.19708v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.19708
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#20351;&#29992;DDM&#27169;&#22411;&#23545;&#31169;&#33829;&#21644;&#19978;&#24066;&#20844;&#21496;&#30340;&#32929;&#26435;&#21644;&#36127;&#20538;&#25152;&#38656;&#22238;&#25253;&#29575;&#36827;&#34892;&#20272;&#35745;&#30340;&#26032;&#26041;&#27861;&#65292;&#20854;&#20013;&#21253;&#25324;&#26368;&#22823;&#20284;&#28982;&#26041;&#27861;&#12289;&#36125;&#21494;&#26031;&#26041;&#27861;&#21644;&#21345;&#23572;&#26364;&#28388;&#27874;&#12290;&#35813;&#27169;&#22411;&#21487;&#29992;&#20110;S&amp;P 500&#25351;&#25968;&#30340;&#20844;&#21496;&#30340;&#21382;&#21490;&#25968;&#25454;&#65292;&#20197;&#20272;&#31639;&#22238;&#25253;&#29575;&#21644;&#36127;&#20538;&#24066;&#22330;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20171;&#32461;&#20102;&#20351;&#29992;&#38543;&#26426;&#32929;&#21033;&#25240;&#29616;&#27169;&#22411;&#65288;DDM&#65289;&#23545;&#31169;&#33829;&#21644;&#19978;&#24066;&#20844;&#21496;&#30340;&#32929;&#26435;&#21644;&#36127;&#20538;&#38656;&#35201;&#22238;&#25253;&#29575;&#36827;&#34892;&#20272;&#35745;&#30340;&#26032;&#26041;&#27861;&#12290;&#20026;&#20102;&#20272;&#35745;&#32929;&#26435;&#38656;&#35201;&#22238;&#25253;&#29575;&#65292;&#25105;&#20204;&#20351;&#29992;&#26368;&#22823;&#20284;&#28982;&#26041;&#27861;&#12289;&#36125;&#21494;&#26031;&#26041;&#27861;&#21644;&#21345;&#23572;&#26364;&#28388;&#27874;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#35780;&#20272;&#36127;&#20538;&#24066;&#22330;&#20215;&#20540;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#23558;&#35813;&#27169;&#22411;&#24212;&#29992;&#20110;S&amp;P 500&#25351;&#25968;&#30340;&#19968;&#32452;&#20844;&#21496;&#65292;&#20351;&#29992;&#21382;&#21490;&#32929;&#21033;&#21644;&#20215;&#26684;&#25968;&#25454;&#36827;&#34892;&#20102;&#20026;&#26399;32&#24180;&#30340;&#30740;&#31350;&#12290;&#24635;&#30340;&#26469;&#35828;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#30340;&#26041;&#27861;&#21487;&#29992;&#20110;&#20272;&#35745;&#25152;&#38656;&#30340;&#22238;&#25253;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this study, we introduce new estimation methods for the required rate of returns on equity and liabilities of private and public companies using the stochastic dividend discount model (DDM). To estimate the required rate of return on equity, we use the maximum likelihood method, the Bayesian method, and the Kalman filtering. We also provide a method that evaluates the market values of liabilities. We apply the model to a set of firms from the S&amp;P 500 index using historical dividend and price data over a 32--year period. Overall, the suggested methods can be used to estimate the required rate of returns.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26426;&#22120;&#23398;&#20064;&#31649;&#36947;&#65292;&#29992;&#20110;&#22312;&#25968;&#25454;&#21046;&#24230;&#21464;&#21270;&#19979;&#23545;&#26102;&#24207;&#38754;&#26495;&#25968;&#25454;&#38598;&#30340;&#39044;&#27979;&#36827;&#34892;&#25490;&#21517;&#12290;&#20351;&#29992;&#26799;&#24230;&#25552;&#21319;&#20915;&#31574;&#26641;&#65288;GBDT&#65289;&#24182;&#32467;&#21512;dropout&#25216;&#26415;&#30340;&#27169;&#22411;&#20855;&#26377;&#33391;&#22909;&#30340;&#24615;&#33021;&#21644;&#27867;&#21270;&#33021;&#21147;&#65292;&#32780;&#21160;&#24577;&#29305;&#24449;&#20013;&#21644;&#21017;&#26159;&#19968;&#31181;&#39640;&#25928;&#32780;&#19981;&#38656;&#35201;&#37325;&#26032;&#35757;&#32451;&#27169;&#22411;&#23601;&#21487;&#20197;&#24212;&#29992;&#20110;&#20219;&#20309;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#20013;&#30340;&#21518;&#22788;&#29702;&#25216;&#26415;&#12290;</title><link>http://arxiv.org/abs/2301.00790</link><description>&lt;p&gt;
&#38754;&#21521;&#26102;&#24207;&#34920;&#26684;&#25968;&#25454;&#30340;&#21160;&#24577;&#29305;&#24449;&#24037;&#31243;&#21644;&#27169;&#22411;&#36873;&#25321;&#26041;&#27861;&#22312;&#21046;&#24230;&#21464;&#21270;&#19979;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Dynamic Feature Engineering and model selection methods for temporal tabular datasets with regime changes. (arXiv:2301.00790v2 [q-fin.CP] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.00790
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26426;&#22120;&#23398;&#20064;&#31649;&#36947;&#65292;&#29992;&#20110;&#22312;&#25968;&#25454;&#21046;&#24230;&#21464;&#21270;&#19979;&#23545;&#26102;&#24207;&#38754;&#26495;&#25968;&#25454;&#38598;&#30340;&#39044;&#27979;&#36827;&#34892;&#25490;&#21517;&#12290;&#20351;&#29992;&#26799;&#24230;&#25552;&#21319;&#20915;&#31574;&#26641;&#65288;GBDT&#65289;&#24182;&#32467;&#21512;dropout&#25216;&#26415;&#30340;&#27169;&#22411;&#20855;&#26377;&#33391;&#22909;&#30340;&#24615;&#33021;&#21644;&#27867;&#21270;&#33021;&#21147;&#65292;&#32780;&#21160;&#24577;&#29305;&#24449;&#20013;&#21644;&#21017;&#26159;&#19968;&#31181;&#39640;&#25928;&#32780;&#19981;&#38656;&#35201;&#37325;&#26032;&#35757;&#32451;&#27169;&#22411;&#23601;&#21487;&#20197;&#24212;&#29992;&#20110;&#20219;&#20309;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#20013;&#30340;&#21518;&#22788;&#29702;&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30001;&#20110;&#20005;&#37325;&#30340;&#38750;&#24179;&#31283;&#24615;&#65292;&#23558;&#28145;&#24230;&#23398;&#20064;&#31639;&#27861;&#24212;&#29992;&#20110;&#26102;&#24207;&#38754;&#26495;&#25968;&#25454;&#38598;&#26159;&#22256;&#38590;&#30340;&#65292;&#36825;&#21487;&#33021;&#23548;&#33268;&#36807;&#24230;&#25311;&#21512;&#30340;&#27169;&#22411;&#22312;&#21046;&#24230;&#21464;&#21270;&#19979;&#24615;&#33021;&#19981;&#20339;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26426;&#22120;&#23398;&#20064;&#31649;&#36947;&#65292;&#29992;&#20110;&#22312;&#25968;&#25454;&#21046;&#24230;&#21464;&#21270;&#19979;&#23545;&#26102;&#24207;&#38754;&#26495;&#25968;&#25454;&#38598;&#30340;&#39044;&#27979;&#36827;&#34892;&#25490;&#21517;&#12290;&#31649;&#36947;&#35780;&#20272;&#19981;&#21516;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#21253;&#25324;&#26799;&#24230;&#25552;&#21319;&#20915;&#31574;&#26641;&#65288;GBDT&#65289;&#21644;&#20855;&#26377;&#21644;&#19981;&#20855;&#26377;&#31616;&#21333;&#29305;&#24449;&#24037;&#31243;&#30340;&#31070;&#32463;&#32593;&#32476;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#20855;&#26377;dropout&#30340;GBDT&#27169;&#22411;&#20855;&#26377;&#39640;&#24615;&#33021;&#12289;&#31283;&#20581;&#24615;&#21644;&#27867;&#21270;&#33021;&#21147;&#65292;&#32780;&#19988;&#30456;&#23545;&#22797;&#26434;&#24230;&#36739;&#20302;&#12289;&#35745;&#31639;&#25104;&#26412;&#36739;&#20302;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#32447;&#23398;&#20064;&#25216;&#26415;&#21487;&#20197;&#22312;&#39044;&#27979;&#21518;&#22788;&#29702;&#20013;&#29992;&#20110;&#22686;&#24378;&#32467;&#26524;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#21160;&#24577;&#29305;&#24449;&#20013;&#21644;&#65292;&#36825;&#26159;&#19968;&#31181;&#26080;&#38656;&#37325;&#26032;&#35757;&#32451;&#27169;&#22411;&#23601;&#21487;&#20197;&#24212;&#29992;&#20110;&#20219;&#20309;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#39640;&#25928;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;
The application of deep learning algorithms to temporal panel datasets is difficult due to heavy non-stationarities which can lead to over-fitted models that under-perform under regime changes. In this work we propose a new machine learning pipeline for ranking predictions on temporal panel datasets which is robust under regime changes of data. Different machine-learning models, including Gradient Boosting Decision Trees (GBDTs) and Neural Networks with and without simple feature engineering are evaluated in the pipeline with different settings. We find that GBDT models with dropout display high performance, robustness and generalisability with relatively low complexity and reduced computational cost. We then show that online learning techniques can be used in post-prediction processing to enhance the results. In particular, dynamic feature neutralisation, an efficient procedure that requires no retraining of models and can be applied post-prediction to any machine learning model, impr
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#30740;&#31350;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#23545;&#36890;&#21220;&#36896;&#25104;&#30340;&#28322;&#20986;&#25928;&#24212;&#65292;&#21457;&#29616;&#24037;&#20316;&#22320;&#30340;&#26368;&#20302;&#24037;&#36164;&#22686;&#21152;&#20250;&#23548;&#33268;&#23621;&#20303;&#22320;&#31199;&#37329;&#19978;&#28072;&#65292;&#27599;10%&#30340;&#24037;&#20316;&#22320;&#26368;&#20302;&#24037;&#36164;&#22686;&#21152;&#23558;&#20351;&#23621;&#20303;&#22320;&#31199;&#37329;&#22686;&#21152;0.69%&#12290;</title><link>http://arxiv.org/abs/2208.01791</link><description>&lt;p&gt;
&#20174;&#24037;&#20316;&#22320;&#21040;&#23621;&#20303;&#22320;&#65306;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#23545;&#24403;&#22320;&#20303;&#25151;&#24066;&#22330;&#30340;&#28322;&#20986;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
From Workplace to Residence: The Spillover Effects of Minimum Wage Policies on Local Housing Markets. (arXiv:2208.01791v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.01791
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#30740;&#31350;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#23545;&#36890;&#21220;&#36896;&#25104;&#30340;&#28322;&#20986;&#25928;&#24212;&#65292;&#21457;&#29616;&#24037;&#20316;&#22320;&#30340;&#26368;&#20302;&#24037;&#36164;&#22686;&#21152;&#20250;&#23548;&#33268;&#23621;&#20303;&#22320;&#31199;&#37329;&#19978;&#28072;&#65292;&#27599;10%&#30340;&#24037;&#20316;&#22320;&#26368;&#20302;&#24037;&#36164;&#22686;&#21152;&#23558;&#20351;&#23621;&#20303;&#22320;&#31199;&#37329;&#22686;&#21152;0.69%&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32654;&#22269;&#26368;&#36817;&#20986;&#29616;&#20102;&#21508;&#24030;&#39041;&#24067;&#22320;&#26041;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#65292;&#23548;&#33268;&#22478;&#24066;&#22320;&#21306;&#20869;&#30340;&#26368;&#20302;&#24037;&#36164;&#27700;&#24179;&#20986;&#29616;&#26174;&#33879;&#24046;&#24322;&#12290;&#26412;&#25991;&#36890;&#36807;&#36890;&#21220;&#30740;&#31350;&#36825;&#20123;&#25919;&#31574;&#23545;&#24403;&#22320;&#31199;&#25151;&#24066;&#22330;&#30340;&#28322;&#20986;&#25928;&#24212;&#12290;&#25105;&#20204;&#26681;&#25454;&#23621;&#27665;&#24037;&#20316;&#22320;&#28857;&#26500;&#24314;&#27599;&#20010;&#37038;&#25919;&#32534;&#30721;&#21306;&#22495;&#30340;&#8220;&#24037;&#20316;&#22320;&#8221;&#26368;&#20302;&#24037;&#36164;&#27700;&#24179;&#65292;&#24182;&#29992;&#23427;&#20272;&#35745;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#23545;&#31199;&#37329;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#37319;&#29992;&#20102;&#19968;&#31181;&#26032;&#30340;&#35782;&#21035;&#31574;&#30053;&#65292;&#21033;&#29992;&#20102;&#20849;&#20139;&#8220;&#23621;&#20303;&#22320;&#8221;&#26368;&#20302;&#24037;&#36164;&#27700;&#24179;&#65288;&#21363;&#30456;&#21516;&#22320;&#28857;&#30340;&#26368;&#20302;&#24037;&#36164;&#27700;&#24179;&#65289;&#30340;&#37038;&#25919;&#32534;&#30721;&#21306;&#22495;&#20043;&#38388;&#24037;&#20316;&#22320;&#26368;&#20302;&#24037;&#36164;&#21464;&#21270;&#30340;&#32454;&#33410;&#26102;&#26426;&#19981;&#21516;&#12290;&#25105;&#20204;&#30340;&#22522;&#20934;&#32467;&#26524;&#34920;&#26126;&#65292;&#24037;&#20316;&#22320;&#26368;&#20302;&#24037;&#36164;&#27700;&#24179;&#22686;&#21152;10%&#20250;&#23548;&#33268;&#23621;&#20303;&#22320;&#37038;&#25919;&#32534;&#30721;&#21306;&#22495;&#30340;&#31199;&#37329;&#22686;&#21152;0.69%&#12290;&#20026;&#20102;&#35828;&#26126;&#36890;&#21220;&#27169;&#24335;&#30340;&#37325;&#35201;&#24615;&#65292;&#25105;&#20204;&#20351;&#29992;&#20272;&#35745;&#32467;&#26524;&#21644;&#19968;&#20010;&#31616;&#21333;&#30340;&#27169;&#22411;&#26469;&#27169;&#25311;&#32852;&#37030;&#21644;&#22478;&#24066;&#34394;&#25311;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#30340;&#24433;&#21709;&#12290;&#27169;&#25311;&#32467;&#26524;&#34920;&#26126;&#65292;&#25151;&#19996;&#27599;&#25910;&#20837;1&#32654;&#20803;&#65292;&#22823;&#32422;&#20250;&#20837;&#34955;10&#32654;&#20998;&#12290;
&lt;/p&gt;
&lt;p&gt;
The recent rise of sub-national minimum wage (MW) policies in the US has resulted in significant dispersion of MW levels within urban areas. In this paper, we study the spillover effects of these policies on local rental markets through commuting. To do so, for each USPS ZIP code we construct a "workplace" MW measure based on the location of its resident's jobs, and use it to estimate the effect of MW policies on rents. We use a novel identification strategy that exploits the fine timing of differential changes in the workplace MW across ZIP codes that share the same "residence" MW, defined as the same location's MW. Our baseline results imply that a 10 percent increase in the workplace MW increases rents at residence ZIP codes by 0.69 percent. To illustrate the importance of commuting patterns, we use our estimates and a simple model to simulate the impact of federal and city counterfactual MW policies. The simulations suggest that landlords pocket approximately 10 cents of each dolla
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#23545;&#20110;&#20989;&#25968;$x$&#65292;&#22522;&#20110;Faber-Schauder&#31995;&#25968;&#30340;&#28201;&#21644;&#26465;&#20214;&#65292;&#26080;&#38656;&#23545;&#20854;&#21160;&#24577;&#20316;&#20986;&#20219;&#20309;&#20551;&#35774;&#21363;&#21487;&#19968;&#33268;&#22320;&#20272;&#35745;&#20854;&#31895;&#31961;&#25351;&#25968;&#65292;&#24182;&#32473;&#20986;&#20102;&#25512;&#24191;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2111.10301</link><description>&lt;p&gt;
&#31895;&#31961;&#25351;&#25968;&#21450;&#20854;&#26080;&#27169;&#22411;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
The roughness exponent and its model-free estimation. (arXiv:2111.10301v4 [math.ST] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2111.10301
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#23545;&#20110;&#20989;&#25968;$x$&#65292;&#22522;&#20110;Faber-Schauder&#31995;&#25968;&#30340;&#28201;&#21644;&#26465;&#20214;&#65292;&#26080;&#38656;&#23545;&#20854;&#21160;&#24577;&#20316;&#20986;&#20219;&#20309;&#20551;&#35774;&#21363;&#21487;&#19968;&#33268;&#22320;&#20272;&#35745;&#20854;&#31895;&#31961;&#25351;&#25968;&#65292;&#24182;&#32473;&#20986;&#20102;&#25512;&#24191;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22522;&#20110;&#36335;&#24452;&#38543;&#26426;&#24494;&#31215;&#20998;&#65292;&#23450;&#20041;&#20102;&#19968;&#20010;&#36830;&#32493;&#30340;&#23454;&#20989;&#25968;$x$&#20855;&#26377;&#31895;&#31961;&#25351;&#25968;$R$&#65292;&#22914;&#26524;$x$&#30340;$p$&#38454;&#21464;&#24046;&#22312;$p&gt;1/R$&#26102;&#36235;&#21521;&#20110;&#38646;&#65292;&#32780;&#22312;$p&lt;1/R$&#26102;&#36235;&#21521;&#20110;&#26080;&#31351;&#22823;&#12290;&#23545;&#20110;&#35768;&#22810;&#38543;&#26426;&#36807;&#31243;&#30340;&#26679;&#26412;&#36335;&#24452;&#65292;&#20363;&#22914;&#20998;&#25968;&#24067;&#26391;&#36816;&#21160;&#65292;&#20854;&#31895;&#31961;&#25351;&#25968;&#23384;&#22312;&#24182;&#31561;&#20110;&#26631;&#20934;&#36203;&#26031;&#29305;&#21442;&#25968;&#12290;&#22312;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#20013;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#22312;Faber-Schauder&#31995;&#25968;&#19978;&#30340;&#19968;&#20010;&#28201;&#21644;&#26465;&#20214;&#65292;&#20351;&#24471;&#31895;&#31961;&#25351;&#25968;&#23384;&#22312;&#65292;&#24182;&#19988;&#32473;&#20986;&#20026;&#32463;&#20856;Gladyshev&#20272;&#35745;$\widehat{R_n}(x)$&#30340;&#26497;&#38480;&#12290;&#36825;&#20010;&#32467;&#26524;&#21487;&#20197;&#34987;&#35270;&#20026;Gladyshev&#20272;&#35745;&#22120;&#22312;&#23436;&#20840;&#26080;&#27169;&#22411;&#35774;&#32622;&#20013;&#30340;&#24378;&#19968;&#33268;&#24615;&#32467;&#26524;&#65292;&#22240;&#20026;&#22312;&#20989;&#25968;$x$&#30340;&#21487;&#33021;&#21160;&#24577;&#26041;&#38754;&#27809;&#26377;&#20219;&#20309;&#20551;&#35774;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#25105;&#20204;&#30340;&#35777;&#26126;&#20855;&#26377;&#27010;&#29575;&#24615;&#65292;&#20381;&#36182;&#20110;&#38544;&#34255;&#22312;$x$&#30340;Faber-Schauder&#23637;&#24320;&#20013;&#30340;&#19968;&#20010;&#38789;&#12290;&#30001;&#20110;Gladyshev&#20272;&#35745;&#22120;&#19981;&#26159;&#23610;&#24230;&#19981;&#21464;&#30340;&#65292;&#25105;&#20204;&#26500;&#36896;&#20102;&#33509;&#24178;&#37327;&#23610;&#24230;&#19981;&#21464;&#30340;&#26377;&#29992;&#25512;&#24191;&#12290;
&lt;/p&gt;
&lt;p&gt;
Motivated by pathwise stochastic calculus, we say that a continuous real-valued function $x$ admits the roughness exponent $R$ if the $p^{\text{th}}$ variation of $x$ converges to zero if $p&gt;1/R$ and to infinity if $p&lt;1/R$. For the sample paths of many stochastic processes, such as fractional Brownian motion, the roughness exponent exists and equals the standard Hurst parameter. In our main result, we provide a mild condition on the Faber--Schauder coefficients of $x$ under which the roughness exponent exists and is given as the limit of the classical Gladyshev estimates $\widehat R_n(x)$. This result can be viewed as a strong consistency result for the Gladyshev estimators in an entirely model-free setting, because no assumption whatsoever is made on the possible dynamics of the function $x$. Nonetheless, our proof is probabilistic and relies on a martingale that is hidden in the Faber--Schauder expansion of $x$. Since the Gladyshev estimators are not scale-invariant, we construct sev
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36125;&#21494;&#26031;&#39532;&#23572;&#31185;&#22827;-&#20999;&#25442;&#21521;&#37327;&#33258;&#22238;&#24402;&#36807;&#31243;&#30340;&#23450;&#20215;&#21644;&#23545;&#20914;&#26041;&#27861;&#65292;&#29992;&#20110;&#32929;&#26435;&#38142;&#25509;&#20154;&#23551;&#20445;&#38505;&#20135;&#21697;&#65292;&#20855;&#26377;&#20381;&#36182;&#32463;&#27982;&#21464;&#37327;&#24182;&#19988;&#31616;&#21270;&#30340;&#20248;&#28857;&#12290;</title><link>http://arxiv.org/abs/2111.04038</link><description>&lt;p&gt;
&#22522;&#20110;&#22810;&#20010;&#36164;&#20135;&#30340;&#32929;&#26435;&#38142;&#25509;&#20154;&#23551;&#20445;&#38505;
&lt;/p&gt;
&lt;p&gt;
Equity--Linked Life Insurances on Maximum of Several Assets. (arXiv:2111.04038v3 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2111.04038
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36125;&#21494;&#26031;&#39532;&#23572;&#31185;&#22827;-&#20999;&#25442;&#21521;&#37327;&#33258;&#22238;&#24402;&#36807;&#31243;&#30340;&#23450;&#20215;&#21644;&#23545;&#20914;&#26041;&#27861;&#65292;&#29992;&#20110;&#32929;&#26435;&#38142;&#25509;&#20154;&#23551;&#20445;&#38505;&#20135;&#21697;&#65292;&#20855;&#26377;&#20381;&#36182;&#32463;&#27982;&#21464;&#37327;&#24182;&#19988;&#31616;&#21270;&#30340;&#20248;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;&#36125;&#21494;&#26031;&#39532;&#23572;&#31185;&#22827;-&#20999;&#25442;&#21521;&#37327;&#33258;&#22238;&#24402;&#65288;MS-VAR&#65289;&#36807;&#31243;&#30340;&#20998;&#31163;&#36164;&#37329;&#21644;&#21333;&#20301;&#38142;&#25509;&#20154;&#23551;&#20445;&#38505;&#20135;&#21697;&#30340;&#23450;&#20215;&#21644;&#23545;&#20914;&#26041;&#27861;&#12290;&#25105;&#20204;&#20551;&#35774;&#20999;&#25442;&#21046;&#24230;&#30340;&#36807;&#31243;&#30001;&#19968;&#20010;&#22343;&#21248;&#39532;&#23572;&#31185;&#22827;&#36807;&#31243;&#21644;&#19968;&#20010;&#27531;&#24046;&#36807;&#31243;&#25152;&#29983;&#25104;&#65292;&#27531;&#24046;&#36807;&#31243;&#36981;&#24490;&#19968;&#20010;&#24322;&#26041;&#24046;&#27169;&#22411;&#12290;&#25105;&#20204;&#27169;&#22411;&#30340;&#20248;&#21183;&#22312;&#20110;&#23427;&#20381;&#36182;&#20110;&#32463;&#27982;&#21464;&#37327;&#24182;&#19988;&#19981;&#22797;&#26434;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents pricing and hedging methods for segregated funds and unit-linked life insurance products that are based on a Bayesian Markov--Switching Vector Autoregressive (MS--VAR) process. Here we assumed that a regime-switching process is generated by a homogeneous Markov process and a residual process follows a heteroscedastic model. An advantage of our model is it depends on economic variables and is not complicated.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#20998;&#26512;Reddit&#30340;WallStreetBets&#35770;&#22363;&#19978;&#30340;&#20132;&#26131;&#32773;&#30340;&#20449;&#24565;&#21644;&#25345;&#20179;&#24773;&#20917;&#65292;&#30740;&#31350;&#20102;&#31038;&#20132;&#21147;&#37327;&#22914;&#20309;&#24433;&#21709;&#36164;&#20135;&#20215;&#26684;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#31038;&#20132;&#23186;&#20307;&#19978;&#34920;&#36798;&#30340;&#24773;&#32490;&#21644;&#36807;&#21435;&#36164;&#20135;&#22238;&#25253;&#24433;&#21709;&#20132;&#26131;&#32773;&#23545;&#36164;&#20135;&#26410;&#26469;&#34920;&#29616;&#30340;&#30475;&#28072;&#25110;&#30475;&#36300;&#30340;&#24773;&#32490;&#65292;&#38646;&#21806;&#20132;&#26131;&#32773;&#30340;&#38656;&#27714;&#21463;&#21040;&#35770;&#22363;&#35752;&#35770;&#30340;&#24433;&#21709;&#65292;&#29305;&#24322;&#24615;&#25237;&#36164;&#32773;&#24773;&#32490;&#30340;&#24066;&#22330;&#24433;&#21709;&#25193;&#22823;&#65292;&#24182;&#19988;&#28818;&#20316;&#25237;&#36164;&#32773;&#26356;&#23481;&#26131;&#21463;&#21040;&#24066;&#22330;&#27873;&#27819;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2104.01847</link><description>&lt;p&gt;
&#31038;&#20250;&#20256;&#26579;&#21644;&#36164;&#20135;&#20215;&#26684;&#65306;Reddit&#30340;&#33258;&#32452;&#32455;&#29275;&#24066;&#36816;&#34892;
&lt;/p&gt;
&lt;p&gt;
Social contagion and asset prices: Reddit's self-organised bull runs. (arXiv:2104.01847v5 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2104.01847
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#20998;&#26512;Reddit&#30340;WallStreetBets&#35770;&#22363;&#19978;&#30340;&#20132;&#26131;&#32773;&#30340;&#20449;&#24565;&#21644;&#25345;&#20179;&#24773;&#20917;&#65292;&#30740;&#31350;&#20102;&#31038;&#20132;&#21147;&#37327;&#22914;&#20309;&#24433;&#21709;&#36164;&#20135;&#20215;&#26684;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#31038;&#20132;&#23186;&#20307;&#19978;&#34920;&#36798;&#30340;&#24773;&#32490;&#21644;&#36807;&#21435;&#36164;&#20135;&#22238;&#25253;&#24433;&#21709;&#20132;&#26131;&#32773;&#23545;&#36164;&#20135;&#26410;&#26469;&#34920;&#29616;&#30340;&#30475;&#28072;&#25110;&#30475;&#36300;&#30340;&#24773;&#32490;&#65292;&#38646;&#21806;&#20132;&#26131;&#32773;&#30340;&#38656;&#27714;&#21463;&#21040;&#35770;&#22363;&#35752;&#35770;&#30340;&#24433;&#21709;&#65292;&#29305;&#24322;&#24615;&#25237;&#36164;&#32773;&#24773;&#32490;&#30340;&#24066;&#22330;&#24433;&#21709;&#25193;&#22823;&#65292;&#24182;&#19988;&#28818;&#20316;&#25237;&#36164;&#32773;&#26356;&#23481;&#26131;&#21463;&#21040;&#24066;&#22330;&#27873;&#27819;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#20132;&#23186;&#20307;&#20013;&#30340;&#38750;&#32467;&#26500;&#21270;&#25991;&#26412;&#25968;&#25454;&#33021;&#21542;&#24110;&#21161;&#35299;&#37322;&#22823;&#22411;&#36164;&#20135;&#20215;&#26684;&#27874;&#21160;&#30340;&#39537;&#21160;&#22240;&#32032;&#65311;&#26412;&#25991;&#36890;&#36807;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#24037;&#20855;&#25552;&#21462;Reddit&#30340;WallStreetBets&#65288;WSB&#65289;&#35770;&#22363;&#19978;&#27963;&#36291;&#30340;&#8220;&#28818;&#20316;&#8221;&#20132;&#26131;&#32773;&#30340;&#20449;&#24565;&#21644;&#25345;&#20179;&#24773;&#20917;&#65292;&#30740;&#31350;&#31038;&#20250;&#21147;&#37327;&#22914;&#20309;&#24433;&#21709;&#36164;&#20135;&#20215;&#26684;&#12290;&#25105;&#20204;&#30340;&#31616;&#21270;&#27169;&#22411;&#26174;&#31034;&#65292;&#21516;&#20276;&#25928;&#24212;&#26377;&#21161;&#20110;&#35299;&#37322;&#22238;&#25253;&#21487;&#39044;&#27979;&#24615;&#21644;&#36870;&#36716;&#65292;&#20197;&#21450;&#27873;&#27819;&#21160;&#21147;&#23398;&#12290;&#25105;&#20204;&#32463;&#39564;&#24615;&#22320;&#35760;&#24405;&#19979;&#65292;WSB&#29992;&#25143;&#23545;&#36164;&#20135;&#26410;&#26469;&#34920;&#29616;&#65288;&#30475;&#28072;&#25110;&#30475;&#36300;&#65289;&#30340;&#24773;&#32490;&#37096;&#20998;&#28304;&#20110;&#20854;&#21516;&#20276;&#21644;&#36807;&#21435;&#30340;&#36164;&#20135;&#22238;&#25253;&#30340;&#24773;&#32490;&#12290;&#26412;&#25991;&#30452;&#25509;&#20272;&#35745;&#20102;WSB&#27963;&#21160;&#23545;&#36164;&#20135;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#35760;&#24405;&#19979;&#65306;&#38646;&#21806;&#20132;&#26131;&#32773;&#38656;&#27714;&#36890;&#36807;&#20351;&#29992;&#20132;&#26131;&#21644;&#34892;&#24773;&#65288;TAQ&#65289;&#25968;&#25454;&#36319;&#38543;WSB&#35752;&#35770;&#65292;&#38646;&#21806;&#20132;&#26131;&#32773;&#35328;&#35770;&#23545;&#20215;&#26684;&#30340;&#21487;&#39044;&#27979;&#24615;&#65292;&#22312;&#32447;&#30149;&#27602;&#20869;&#23481;&#24341;&#21457;&#30340;&#29305;&#24322;&#24615;&#25237;&#36164;&#32773;&#24773;&#32490;&#30340;&#24066;&#22330;&#24433;&#21709;&#25193;&#22823;&#65292;&#20197;&#21450;&#28818;&#20316;&#25237;&#36164;&#32773;&#23545;&#24066;&#22330;&#27873;&#27819;&#30340;&#26356;&#39640;&#26333;&#20809;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
Can unstructured text data from social media help explain the drivers of large asset price fluctuations? This paper investigates how social forces affect asset prices, by using machine learning tools to extract beliefs and positions of `hype' traders active on Reddit's WallStreetBets (WSB) forum. Our stylized model shows that peer effects help explain return predictability and reversals, as well as bubble dynamics. We empirically document that sentiments expressed by WSB users about assets' future performances (bullish or bearish) are in part due to sentiments of their peers and past asset returns. The paper directly estimates the effect of WSB activity on asset prices. We document: that retail trader demand follows WSB discussions through using Trade and Quote (TAQ) data, the predictability of prices from retail trader discourse, the amplified market impact of idiosyncratic investor sentiment from viral content online, and the greater exposure of hype investors to bubbles in the marke
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#31532;&#20108;&#27425;&#19990;&#30028;&#22823;&#25112;&#26399;&#38388;&#30340;&#24615;&#21035;&#22833;&#34913;&#24773;&#20917;&#65292;&#30740;&#31350;&#20102;&#23545;&#26085;&#26412;&#23130;&#23035;&#24066;&#22330;&#21644;&#29983;&#32946;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#30007;&#24615;&#22312;&#23130;&#23035;&#24066;&#22330;&#21644;&#29983;&#32946;&#20915;&#31574;&#20013;&#27604;&#22899;&#24615;&#20855;&#26377;&#26356;&#24378;&#30340;&#35758;&#20215;&#22320;&#20301;&#65292;&#22312;&#30456;&#23545;&#30007;&#24615;&#31232;&#32570;&#30340;&#24773;&#20917;&#19979;&#65292;&#20154;&#20204;&#26356;&#26377;&#21487;&#33021;&#32467;&#23130;&#21644;&#31163;&#23130;&#65292;&#20294;&#20007;&#20598;&#22919;&#22899;&#37325;&#26032;&#23130;&#23035;&#30340;&#21487;&#33021;&#24615;&#36739;&#20302;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;&#22899;&#24615;&#22312;&#23130;&#23035;&#24066;&#22330;&#19978;&#30340;&#35758;&#20215;&#22320;&#20301;&#21487;&#33021;&#24182;&#27809;&#26377;&#25913;&#21892;&#65292;&#32780;&#30456;&#23545;&#30007;&#24615;&#31232;&#32570;&#30340;&#22320;&#21306;&#30340;&#23130;&#20869;&#29983;&#32946;&#29575;&#21644;&#27515;&#32974;&#29575;&#22686;&#21152;&#12290;&#22240;&#27492;&#65292;&#36825;&#34920;&#26126;&#23478;&#24237;&#20869;&#37096;&#35758;&#20215;&#30340;&#29702;&#35770;&#39044;&#27979;&#20855;&#26377;&#31283;&#20581;&#24615;&#12290;</title><link>http://arxiv.org/abs/2102.00687</link><description>&lt;p&gt;
&#24615;&#21035;&#22833;&#34913;&#23545;&#26085;&#26412;&#23130;&#23035;&#21644;&#29983;&#32946;&#30340;&#24433;&#21709;&#65306;&#20197;&#31532;&#20108;&#27425;&#19990;&#30028;&#22823;&#25112;&#20026;&#20363;&#35777;
&lt;/p&gt;
&lt;p&gt;
The Impacts of the Gender Imbalance on Marriage and Birth: Evidence from World War II in Japan. (arXiv:2102.00687v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2102.00687
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#31532;&#20108;&#27425;&#19990;&#30028;&#22823;&#25112;&#26399;&#38388;&#30340;&#24615;&#21035;&#22833;&#34913;&#24773;&#20917;&#65292;&#30740;&#31350;&#20102;&#23545;&#26085;&#26412;&#23130;&#23035;&#24066;&#22330;&#21644;&#29983;&#32946;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#30007;&#24615;&#22312;&#23130;&#23035;&#24066;&#22330;&#21644;&#29983;&#32946;&#20915;&#31574;&#20013;&#27604;&#22899;&#24615;&#20855;&#26377;&#26356;&#24378;&#30340;&#35758;&#20215;&#22320;&#20301;&#65292;&#22312;&#30456;&#23545;&#30007;&#24615;&#31232;&#32570;&#30340;&#24773;&#20917;&#19979;&#65292;&#20154;&#20204;&#26356;&#26377;&#21487;&#33021;&#32467;&#23130;&#21644;&#31163;&#23130;&#65292;&#20294;&#20007;&#20598;&#22919;&#22899;&#37325;&#26032;&#23130;&#23035;&#30340;&#21487;&#33021;&#24615;&#36739;&#20302;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;&#22899;&#24615;&#22312;&#23130;&#23035;&#24066;&#22330;&#19978;&#30340;&#35758;&#20215;&#22320;&#20301;&#21487;&#33021;&#24182;&#27809;&#26377;&#25913;&#21892;&#65292;&#32780;&#30456;&#23545;&#30007;&#24615;&#31232;&#32570;&#30340;&#22320;&#21306;&#30340;&#23130;&#20869;&#29983;&#32946;&#29575;&#21644;&#27515;&#32974;&#29575;&#22686;&#21152;&#12290;&#22240;&#27492;&#65292;&#36825;&#34920;&#26126;&#23478;&#24237;&#20869;&#37096;&#35758;&#20215;&#30340;&#29702;&#35770;&#39044;&#27979;&#20855;&#26377;&#31283;&#20581;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#31532;&#20108;&#27425;&#19990;&#30028;&#22823;&#25112;&#26399;&#38388;&#30007;&#24615;&#25439;&#22833;&#23548;&#33268;&#24615;&#21035;&#27604;&#20363;&#21069;&#25152;&#26410;&#26377;&#30340;&#21464;&#21270;&#65292;&#26469;&#30740;&#31350;&#24615;&#21035;&#22833;&#34913;&#23545;&#26085;&#26412;&#23130;&#23035;&#24066;&#22330;&#21644;&#29983;&#32946;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;&#21033;&#29992;&#26032;&#25968;&#23383;&#21270;&#30340;&#22522;&#20110;&#20154;&#21475;&#26222;&#26597;&#30340;&#21382;&#21490;&#32479;&#35745;&#25968;&#25454;&#65292;&#25105;&#20204;&#21457;&#29616;&#30007;&#24615;&#22312;&#23130;&#23035;&#24066;&#22330;&#21644;&#23478;&#24237;&#20869;&#37096;&#30340;&#29983;&#32946;&#20915;&#31574;&#20013;&#27604;&#22899;&#24615;&#20855;&#26377;&#26356;&#24378;&#30340;&#35758;&#20215;&#22320;&#20301;&#12290;&#22312;&#30456;&#23545;&#30007;&#24615;&#31232;&#32570;&#30340;&#24773;&#20917;&#19979;&#65292;&#23588;&#20854;&#26159;&#24180;&#36731;&#20154;&#26356;&#26377;&#21487;&#33021;&#32467;&#23130;&#21644;&#31163;&#23130;&#65292;&#20294;&#26159;&#20007;&#20598;&#22919;&#22899;&#37325;&#26032;&#23130;&#23035;&#30340;&#21487;&#33021;&#24615;&#27604;&#20007;&#20598;&#30007;&#24615;&#35201;&#20302;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#22899;&#24615;&#22312;&#23130;&#23035;&#24066;&#22330;&#19978;&#30340;&#35758;&#20215;&#22320;&#20301;&#22312;1950&#24180;&#20195;&#21487;&#33021;&#24182;&#27809;&#26377;&#25913;&#21892;&#12290;&#22312;&#25112;&#21518;&#22549;&#32974;&#27861;&#24459;&#30340;&#21046;&#24230;&#21464;&#21270;&#19979;&#65292;&#30456;&#23545;&#30007;&#24615;&#31232;&#32570;&#30340;&#22320;&#21306;&#30340;&#23130;&#20869;&#29983;&#32946;&#29575;&#21644;&#27515;&#32974;&#29575;&#22686;&#21152;&#12290;&#25105;&#20204;&#20851;&#20110;&#38750;&#23130;&#29983;&#23376;&#22899;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#23478;&#24237;&#20869;&#37096;&#35758;&#20215;&#30340;&#29702;&#35770;&#39044;&#27979;&#22312;&#32463;&#27982;&#20307;&#20013;&#26159;&#20855;&#26377;&#31283;&#20581;&#24615;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study uses the unprecedented changes in the sex ratio due to the losses of men during World War II to identify the impacts of the gender imbalance on marriage market and birth outcomes in Japan. Using newly digitized census-based historical statistics, we find evidence that men had a stronger bargaining position in the marriage market and intra-household fertility decisions than women. Under relative male scarcity, while people, especially younger people, were more likely to marry and divorce, widowed women were less likely to remarry than widowed men. We also find that women's bargaining position in the marriage market might not have improved throughout the 1950s. Given the institutional changes in the abortion law after the war, marital fertility and stillbirth rates increased in the areas that suffered relative male scarcity. Our result on out-of-wedlock births indicates that the theoretical prediction of intra-household bargaining is considered to be robust in an economy in wh
&lt;/p&gt;</description></item></channel></rss>