<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#20915;&#31574;&#26641;&#21644;&#38543;&#26426;&#26862;&#26519;&#26469;&#23450;&#20301;&#24191;&#20041;&#33258;&#22238;&#24402;&#24471;&#20998;&#27169;&#22411;&#30340;&#21442;&#25968;&#65292;&#25913;&#21892;&#20854;&#39044;&#27979;&#65292;&#24182;&#25581;&#31034;&#20102;&#32929;&#31080;&#22238;&#25253;&#27874;&#21160;&#29575;&#21644;&#23494;&#24230;&#39044;&#27979;&#20013;&#30340;&#26464;&#26438;&#25928;&#24212;&#21644;&#26041;&#24046;&#39118;&#38505;&#28322;&#20215;&#25928;&#24212;&#65292;&#20197;&#21450;&#32929;&#31080;-&#20538;&#21048;&#20381;&#36182;&#24615;&#20013;&#30340;&#27969;&#21521;&#36136;&#37327;&#25928;&#24212;&#21644;&#39640;&#39057;&#20132;&#26131;&#25345;&#32493;&#26102;&#38388;&#20013;&#30340;&#25104;&#20132;&#37327;-&#27874;&#21160;&#24615;&#25928;&#24212;&#12290;</title><link>http://arxiv.org/abs/2305.18991</link><description>&lt;p&gt;
&#24191;&#20041;&#33258;&#22238;&#24402;&#24471;&#20998;&#26641;&#19982;&#26862;&#26519;
&lt;/p&gt;
&lt;p&gt;
Generalized Autoregressive Score Trees and Forests. (arXiv:2305.18991v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.18991
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#20915;&#31574;&#26641;&#21644;&#38543;&#26426;&#26862;&#26519;&#26469;&#23450;&#20301;&#24191;&#20041;&#33258;&#22238;&#24402;&#24471;&#20998;&#27169;&#22411;&#30340;&#21442;&#25968;&#65292;&#25913;&#21892;&#20854;&#39044;&#27979;&#65292;&#24182;&#25581;&#31034;&#20102;&#32929;&#31080;&#22238;&#25253;&#27874;&#21160;&#29575;&#21644;&#23494;&#24230;&#39044;&#27979;&#20013;&#30340;&#26464;&#26438;&#25928;&#24212;&#21644;&#26041;&#24046;&#39118;&#38505;&#28322;&#20215;&#25928;&#24212;&#65292;&#20197;&#21450;&#32929;&#31080;-&#20538;&#21048;&#20381;&#36182;&#24615;&#20013;&#30340;&#27969;&#21521;&#36136;&#37327;&#25928;&#24212;&#21644;&#39640;&#39057;&#20132;&#26131;&#25345;&#32493;&#26102;&#38388;&#20013;&#30340;&#25104;&#20132;&#37327;-&#27874;&#21160;&#24615;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#20915;&#31574;&#26641;&#21644;&#38543;&#26426;&#26862;&#26519;&#26469;&#23450;&#20301;&#24191;&#20041;&#33258;&#22238;&#24402;&#24471;&#20998;&#65288;GAS&#65289;&#27169;&#22411;&#65288;Creal et. al, 2013; Harvey, 2013&#65289;&#30340;&#21442;&#25968;&#65292;&#20174;&#32780;&#25913;&#21892;&#20854;&#39044;&#27979;&#12290;&#36825;&#20123;&#26041;&#27861;&#36991;&#20813;&#20102;&#22522;&#20110;&#26680;&#20989;&#25968;&#30340;&#26041;&#27861;&#25152;&#38754;&#20020;&#30340;&#32500;&#24230;&#28798;&#38590;&#65292;&#24182;&#20801;&#35768;&#21516;&#26102;&#21033;&#29992;&#22810;&#20010;&#29366;&#24577;&#21464;&#37327;&#30340;&#20449;&#24687;&#12290;&#25105;&#20204;&#23558;&#26032;&#27169;&#22411;&#24212;&#29992;&#20110;&#22235;&#31181;&#19981;&#21516;&#30340;&#23454;&#35777;&#20998;&#26512;&#20013;&#65292;&#24182;&#19988;&#22312;&#25152;&#26377;&#24212;&#29992;&#20013;&#65292;&#26032;&#30340;&#26041;&#27861;&#37117;&#26174;&#33879;&#20248;&#20110;&#22522;&#32447;GAS&#27169;&#22411;&#12290;&#22312;&#25105;&#20204;&#24212;&#29992;&#20110;&#32929;&#31080;&#22238;&#25253;&#27874;&#21160;&#29575;&#21644;&#23494;&#24230;&#39044;&#27979;&#30340;&#23454;&#39564;&#20013;&#65292;&#26368;&#20248;&#30340;GAS&#26641;&#27169;&#22411;&#25581;&#31034;&#20102;&#26464;&#26438;&#25928;&#24212;&#21644;&#26041;&#24046;&#39118;&#38505;&#28322;&#20215;&#25928;&#24212;&#12290;&#25105;&#20204;&#22312;&#32929;&#31080;-&#20538;&#21048;&#20381;&#36182;&#24615;&#30340;&#30740;&#31350;&#20013;&#21457;&#29616;&#20102;&#20248;&#21270;&#30340;GAS&#26862;&#26519;&#39044;&#27979;&#20013;&#30340;&#27969;&#21521;&#36136;&#37327;&#25928;&#24212;&#65292;&#25105;&#20204;&#23545;&#39640;&#39057;&#20132;&#26131;&#25345;&#32493;&#26102;&#38388;&#30340;&#20998;&#26512;&#25581;&#31034;&#20102;&#25104;&#20132;&#37327;-&#27874;&#21160;&#24615;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose methods to improve the forecasts from generalized autoregressive score (GAS) models (Creal et. al, 2013; Harvey, 2013) by localizing their parameters using decision trees and random forests. These methods avoid the curse of dimensionality faced by kernel-based approaches, and allow one to draw on information from multiple state variables simultaneously. We apply the new models to four distinct empirical analyses, and in all applications the proposed new methods significantly outperform the baseline GAS model. In our applications to stock return volatility and density prediction, the optimal GAS tree model reveals a leverage effect and a variance risk premium effect. Our study of stock-bond dependence finds evidence of a flight-to-quality effect in the optimal GAS forest forecasts, while our analysis of high-frequency trade durations uncovers a volume-volatility effect.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#31454;&#20105;&#21338;&#24328;&#27169;&#22411;&#65292;&#20351;&#29992;&#21518;&#24724;&#26368;&#23567;&#21270;&#31639;&#27861;&#36890;&#36807;&#31163;&#25955;&#21270;&#35299;&#20915;&#20102;&#36830;&#32493;&#21338;&#24328;&#38382;&#39064;&#12290;&#35813;&#27169;&#22411;&#25581;&#31034;&#20102;&#24066;&#22330;&#25705;&#25830;&#21644;&#39118;&#38505;&#30456;&#20851;&#24615;&#22914;&#20309;&#24433;&#21709;&#25112;&#30053;&#24615;&#39118;&#38505;&#25215;&#21463;&#12290;</title><link>http://arxiv.org/abs/2305.18941</link><description>&lt;p&gt;
&#19968;&#22330;&#20851;&#20110;&#39118;&#38505;&#30340;&#31454;&#20105;&#21338;&#24328;
&lt;/p&gt;
&lt;p&gt;
A Game of Competition for Risk. (arXiv:2305.18941v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.18941
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#31454;&#20105;&#21338;&#24328;&#27169;&#22411;&#65292;&#20351;&#29992;&#21518;&#24724;&#26368;&#23567;&#21270;&#31639;&#27861;&#36890;&#36807;&#31163;&#25955;&#21270;&#35299;&#20915;&#20102;&#36830;&#32493;&#21338;&#24328;&#38382;&#39064;&#12290;&#35813;&#27169;&#22411;&#25581;&#31034;&#20102;&#24066;&#22330;&#25705;&#25830;&#21644;&#39118;&#38505;&#30456;&#20851;&#24615;&#22914;&#20309;&#24433;&#21709;&#25112;&#30053;&#24615;&#39118;&#38505;&#25215;&#21463;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#30340;&#27169;&#22411;&#20013;&#65292;&#21442;&#19982;&#32773;&#26681;&#25454;&#33258;&#36523;&#25112;&#30053;&#36873;&#25321;&#39118;&#38505;&#27700;&#24179;&#24182;&#33719;&#24471;&#30456;&#24212;&#22238;&#25253;&#65292;&#27169;&#25311;&#20102;&#21508;&#34892;&#19994;&#20043;&#38388;&#30340;&#29616;&#23454;&#31454;&#20105;&#12290;&#25105;&#20204;&#20174;&#19968;&#20010;&#28041;&#21450;&#20004;&#21517;&#29609;&#23478;&#22312;&#36830;&#32493;&#34892;&#21160;&#31354;&#38388;&#20869;&#30340;&#27491;&#24577;&#24418;&#24335;&#21338;&#24328;&#24320;&#22987;&#20998;&#26512;&#65292;&#35777;&#23454;&#20102;Nash&#22343;&#34913;&#30340;&#23384;&#22312;&#21644;&#21807;&#19968;&#24615;&#65292;&#24182;&#32473;&#20986;&#20102;&#20998;&#26512;&#35299;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#23558;&#36825;&#31181;&#20998;&#26512;&#25193;&#23637;&#21040;&#22810;&#20154;&#28216;&#25103;&#24773;&#22659;&#65292;&#24182;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#25968;&#20540;&#31639;&#27861;&#36827;&#34892;&#35745;&#31639;&#12290;&#25105;&#20204;&#30740;&#31350;&#30340;&#19968;&#20010;&#20851;&#38190;&#21019;&#26032;&#28857;&#26159;&#20351;&#29992;&#21518;&#24724;&#26368;&#23567;&#21270;&#31639;&#27861;&#36890;&#36807;&#31163;&#25955;&#21270;&#26469;&#35299;&#20915;&#36830;&#32493;&#21338;&#24328;&#38382;&#39064;&#12290;&#36825;&#31181;&#24320;&#21019;&#24615;&#30340;&#26041;&#27861;&#20351;&#25105;&#20204;&#33021;&#22815;&#23558;&#24066;&#22330;&#25705;&#25830;&#21644;&#20844;&#21496;&#38388;&#39118;&#38505;&#30456;&#20851;&#24615;&#31561;&#39069;&#22806;&#30340;&#29616;&#23454;&#22240;&#32032;&#32435;&#20837;&#32771;&#34385;&#12290;&#25105;&#20204;&#36824;&#36890;&#36807;&#23454;&#39564;&#39564;&#35777;&#20102;&#25105;&#20204;&#27169;&#22411;&#20013;&#30340;Nash&#22343;&#34913;&#20063;&#21487;&#20197;&#29992;&#20316;&#30456;&#20851;&#22343;&#34913;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#25581;&#31034;&#20102;&#24066;&#22330;&#25705;&#25830;&#21644;&#39118;&#38505;&#30456;&#20851;&#24615;&#22914;&#20309;&#24433;&#21709;&#25112;&#30053;&#24615;&#39118;&#38505;&#25215;&#21463;&#12290;&#25105;&#20204;&#36824;&#25506;&#35752;&#20102;&#25919;&#31574;&#25514;&#26045;&#22914;&#20309;&#24433;&#21709;&#24066;&#22330;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this study, we present models where participants strategically select their risk levels and earn corresponding rewards, mirroring real-world competition across various sectors. Our analysis starts with a normal form game involving two players in a continuous action space, confirming the existence and uniqueness of a Nash equilibrium and providing an analytical solution. We then extend this analysis to multi-player scenarios, introducing a new numerical algorithm for its calculation. A key novelty of our work lies in using regret minimization algorithms to solve continuous games through discretization. This groundbreaking approach enables us to incorporate additional real-world factors like market frictions and risk correlations among firms. We also experimentally validate that the Nash equilibrium in our model also serves as a correlated equilibrium. Our findings illuminate how market frictions and risk correlations affect strategic risk-taking. We also explore how policy measures c
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#35780;&#20272;&#20102;&#20004;&#20010;&#19981;&#21516;&#22320;&#29702;&#21306;&#22495;&#30340;&#20154;&#24037;&#28287;&#22320;&#30340;&#21487;&#25345;&#32493;&#24615;&#65292;&#32467;&#26524;&#34920;&#26126;&#35199;&#35199;&#37324;&#23707;&#30340;&#22402;&#30452;&#22320;&#19979;&#27969;&#20154;&#24037;&#28287;&#22320;&#22312;&#32463;&#27982;&#21644;&#31038;&#20250;&#25928;&#30410;&#26041;&#38754;&#26356;&#39640;&#65292;&#26159;&#35813;&#22320;&#21306;&#27700;&#36164;&#28304;&#31649;&#29702;&#26356;&#21487;&#25345;&#32493;&#30340;&#36873;&#25321;&#12290;</title><link>http://arxiv.org/abs/2305.06284</link><description>&lt;p&gt;
&#32511;&#33394;&#22522;&#30784;&#35774;&#26045;&#22312;&#27700;&#36164;&#28304;&#31649;&#29702;&#19978;&#30340;&#25104;&#26412;&#19982;&#25928;&#30410;&#65306;&#24847;&#22823;&#21033;&#21335;&#21271;&#37096;&#20840;&#23610;&#23544;&#20154;&#24037;&#28287;&#22320;&#30340;&#21487;&#25345;&#32493;&#24615;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
Cost-benefit of green infrastructures for water management: A sustainability assessment of full-scale constructed wetlands in Northern and Southern Italy. (arXiv:2305.06284v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.06284
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35780;&#20272;&#20102;&#20004;&#20010;&#19981;&#21516;&#22320;&#29702;&#21306;&#22495;&#30340;&#20154;&#24037;&#28287;&#22320;&#30340;&#21487;&#25345;&#32493;&#24615;&#65292;&#32467;&#26524;&#34920;&#26126;&#35199;&#35199;&#37324;&#23707;&#30340;&#22402;&#30452;&#22320;&#19979;&#27969;&#20154;&#24037;&#28287;&#22320;&#22312;&#32463;&#27982;&#21644;&#31038;&#20250;&#25928;&#30410;&#26041;&#38754;&#26356;&#39640;&#65292;&#26159;&#35813;&#22320;&#21306;&#27700;&#36164;&#28304;&#31649;&#29702;&#26356;&#21487;&#25345;&#32493;&#30340;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30001;&#20110;&#27700;&#36164;&#28304;&#20379;&#24212;&#19981;&#31283;&#23450;&#21644;&#27700;&#36136;&#38382;&#39064;&#65292;&#21487;&#25345;&#32493;&#27700;&#36164;&#28304;&#31649;&#29702;&#24050;&#25104;&#20026;&#32039;&#36843;&#30340;&#25361;&#25112;&#12290;&#27668;&#20505;&#21464;&#21270;&#30340;&#24433;&#21709;&#21152;&#21095;&#20102;&#22320;&#20013;&#28023;&#22320;&#21306;&#31561;&#27700;&#36164;&#28304;&#21294;&#20047;&#22320;&#21306;&#30340;&#36825;&#19968;&#29616;&#35937;&#65292;&#21050;&#28608;&#20102;&#26088;&#22312;&#20943;&#36731;&#25110;&#25913;&#21892;&#29615;&#22659;&#12289;&#31038;&#20250;&#21644;&#32463;&#27982;&#29366;&#20917;&#30340;&#35299;&#20915;&#26041;&#26696;&#30340;&#23454;&#26045;&#12290;&#19968;&#31181;&#28789;&#24863;&#26469;&#33258;&#33258;&#28982;&#30028;&#12289;&#20197;&#25216;&#26415;&#20026;&#23548;&#21521;&#30340;&#26032;&#22411;&#35299;&#20915;&#26041;&#26696;&#26159;&#20154;&#24037;&#28287;&#22320;&#12290;&#30001;&#20110;&#20854;&#20302;&#25104;&#26412;&#21644;&#31616;&#21333;&#30340;&#32500;&#25252;&#65292;&#24120;&#34987;&#24212;&#29992;&#20110;&#19981;&#21516;&#31867;&#22411;&#30340;&#24223;&#27700;&#22788;&#29702;&#65292;&#24182;&#34987;&#35748;&#20026;&#26159;&#38500;&#21435;&#27745;&#26579;&#29289;&#30340;&#26377;&#21069;&#36884;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#21516;&#26102;&#36890;&#36807;&#22686;&#21152;&#21608;&#22260;&#30340;&#29983;&#29289;&#22810;&#26679;&#24615;&#32780;&#21019;&#36896;&#20102;&#25913;&#36827;&#30340;&#29983;&#24577;&#31995;&#32479;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#36890;&#36807;&#23545;&#24847;&#22823;&#21033;&#20004;&#20010;&#22320;&#21306;&#30340;&#20004;&#31181;&#31867;&#22411;&#30340;&#20154;&#24037;&#28287;&#22320;&#65288;&#35199;&#35199;&#37324;&#23707;&#30340;&#22402;&#30452;&#22320;&#19979;&#27969;&#20154;&#24037;&#28287;&#22320;&#21644;&#33406;&#31859;&#21033;&#20122;&#183;&#32599;&#39532;&#28037;&#21306;&#30340;&#22320;&#34920;&#27969;&#20154;&#24037;&#28287;&#22320;&#65289;&#36827;&#34892;&#21487;&#25345;&#32493;&#24615;&#35780;&#20272;&#65292;&#24212;&#29992;&#25104;&#26412;&#25928;&#30410;&#20998;&#26512;&#26469;&#27604;&#36739;&#36825;&#20004;&#31181;&#31995;&#32479;&#30340;&#32463;&#27982;&#12289;&#31038;&#20250;&#21644;&#29615;&#22659;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#34429;&#28982;&#20004;&#31181;&#31995;&#32479;&#37117;&#26377;&#31215;&#26497;&#30340;&#24433;&#21709;&#65292;&#20294;&#35199;&#35199;&#37324;&#23707;&#30340;&#22402;&#30452;&#22320;&#19979;&#27969;&#20154;&#24037;&#28287;&#22320;&#20855;&#26377;&#26356;&#39640;&#30340;&#32463;&#27982;&#21644;&#31038;&#20250;&#25928;&#30410;&#65292;&#20351;&#20854;&#25104;&#20026;&#35813;&#22320;&#21306;&#27700;&#36164;&#28304;&#31649;&#29702;&#26356;&#21487;&#25345;&#32493;&#30340;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;
Sustainable water management has become an urgent challenge due to irregular water availability patterns and water quality issues. The effect of climate change exacerbates this phenomenon in water-scarce areas, such as the Mediterranean region, stimulating the implementation of solutions aiming to mitigate or improve environmental, social, and economic conditions. A novel solution inspired by nature, technology-oriented, explored in the past years, is constructed wetlands. Commonly applied for different types of wastewater due to its low cost and simple maintenance, they are considered a promising solution to remove pollutants while creating an improved ecosystem by increasing biodiversity around them. This research aims to assess the sustainability of two typologies of constructed wetlands in two Italian areas: Sicily, with a vertical subsurface flow constructed wetland, and Emilia Romagna, with a surface flow constructed wetland. The assessment is performed by applying a cost-benefit
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36328;&#22659;&#24066;&#22330;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#30340;&#20256;&#36755;&#23481;&#37327;&#26159;&#26377;&#38480;&#30340;&#65292;&#22312;&#35813;&#27169;&#22411;&#20013;&#65292;&#20801;&#35768;&#26469;&#33258;&#22806;&#22269;&#24066;&#22330;&#30340;&#22996;&#25176;&#19982;&#22266;&#23450;&#30340;&#22269;&#20869;&#24066;&#22330;&#25968;&#37327;&#30456;&#21305;&#37197;&#65292;&#20174;&#32780;&#20135;&#29983;&#36328;&#22659;&#20132;&#26131;&#12290;</title><link>http://arxiv.org/abs/2207.01939</link><description>&lt;p&gt;
&#19968;&#31181;&#26377;&#38480;&#20256;&#36755;&#23481;&#37327;&#30340;&#36328;&#22659;&#24066;&#22330;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
A cross-border market model with limited transmission capacities. (arXiv:2207.01939v3 [math.PR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.01939
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36328;&#22659;&#24066;&#22330;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#30340;&#20256;&#36755;&#23481;&#37327;&#26159;&#26377;&#38480;&#30340;&#65292;&#22312;&#35813;&#27169;&#22411;&#20013;&#65292;&#20801;&#35768;&#26469;&#33258;&#22806;&#22269;&#24066;&#22330;&#30340;&#22996;&#25176;&#19982;&#22266;&#23450;&#30340;&#22269;&#20869;&#24066;&#22330;&#25968;&#37327;&#30456;&#21305;&#37197;&#65292;&#20174;&#32780;&#20135;&#29983;&#36328;&#22659;&#20132;&#26131;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#36328;&#36234;&#20004;&#20010;&#22269;&#23478;&#30340;&#24066;&#22330;&#27169;&#22411;&#65292;&#22312;&#35813;&#27169;&#22411;&#20013;&#65292;&#36830;&#25509;&#19981;&#21516;&#22269;&#23478;&#30340;&#24066;&#22330;&#21442;&#19982;&#32773;&#30340;&#20256;&#36755;&#23481;&#37327;&#26159;&#26377;&#38480;&#30340;&#12290;&#20174;&#20004;&#20010;&#22269;&#23478;&#38480;&#20215;&#22996;&#25176;&#31807;&#21160;&#24577;&#30340;&#31616;&#21270;&#24418;&#24335;&#20986;&#21457;&#65292;&#25105;&#20204;&#20801;&#35768;&#26469;&#33258;&#22806;&#22269;&#24066;&#22330;&#30340;&#22996;&#25176;&#19982;&#22266;&#23450;&#30340;&#27861;&#22269;&#24066;&#22330;&#25968;&#37327;&#30456;&#21305;&#37197;&#65292;&#20174;&#32780;&#20135;&#29983;&#36328;&#22659;&#20132;&#26131;&#12290;&#30001;&#20110;&#25105;&#20204;&#27169;&#22411;&#20013;&#30340;&#20256;&#36755;&#23481;&#37327;&#26159;&#26377;&#38480;&#30340;&#65292;&#25152;&#20197;&#25105;&#20204;&#30340;&#27169;&#22411;&#22312;&#20855;&#26377;&#36328;&#22659;&#20132;&#26131;&#21487;&#33021;&#24615;&#21644;&#20165;&#33021;&#23558;&#26469;&#33258;&#21516;&#19968;&#22320;&#26041;&#30340;&#24066;&#22330;&#35746;&#21333;&#21305;&#37197;&#30340;&#27169;&#24335;&#20043;&#38388;&#20132;&#26367;&#20999;&#25442;&#12290;&#25105;&#20204;&#23548;&#20986;&#20102;&#25105;&#20204;&#24494;&#35266;&#27169;&#22411;&#30340;&#39640;&#39057;&#36817;&#20284;&#65292;&#20551;&#35774;&#21333;&#20010;&#35746;&#21333;&#30340;&#22823;&#23567;&#36235;&#20110;&#38646;&#65292;&#35746;&#21333;&#21040;&#36798;&#29575;&#36235;&#20110;&#26080;&#31351;&#22823;&#12290;&#22914;&#26524;&#26377;&#20256;&#36755;&#23481;&#37327;&#65292;&#26497;&#38480;&#36807;&#31243;&#34892;&#20026;&#22914;&#19979;&#65306;&#27491;&#21322;&#36724;&#20869;&#30340;&#22235;&#32500;&#32447;&#24615;&#24067;&#26391;&#36816;&#21160;&#20013;&#30340;&#20307;&#31215;&#21160;&#24577;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a cross-border market model between two countries in which the transmission capacities that enable transactions between market participants of different countries are limited. Starting from two reduced-form representations of national limit order book dynamics, we allow incoming market orders to be matched with standing volumes of the foreign market, resulting in cross-border trades. Since the transmission capacities in our model are limited, our model alternates between regimes in which cross-border trades are possible and regimes in which incoming market orders can only be matched against limit orders of the same origin. We derive a high-frequency approximation of our microscopic model, assuming that the size of an individual order converges to zero while the order arrival rate tends to infinity. If transmission capacities are available, the limit process behaves as follows: the volume dynamics is a four-dimensional linear Brownian motion in the positive orthant with obliq
&lt;/p&gt;</description></item><item><title>&#24847;&#22823;&#21033;30&#22810;&#23681;&#26377;&#23567;&#23401;&#30340;&#22899;&#24615;&#22312;COVID-19&#22823;&#27969;&#34892;&#20013;&#25918;&#24323;&#20102;&#24037;&#20316;&#65292;&#25104;&#20026;&#20102;&#22833;&#19994;&#20154;&#22763;&#12290;&#30740;&#31350;&#34920;&#26126;&#36825;&#26159;&#30001;&#20110;&#29305;&#23450;&#30340;&#22320;&#21306;&#31038;&#20250;&#25991;&#21270;&#22240;&#32032;&#24341;&#36215;&#30340;&#65292;&#24182;&#21487;&#33021;&#23545;&#22899;&#24615;&#21171;&#21160;&#21147;&#21442;&#19982;&#20135;&#29983;&#38271;&#26399;&#19981;&#21033;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2202.13317</link><description>&lt;p&gt;
COVID-19&#30340;&#38452;&#24433;&#19979;&#25104;&#24180;&#22899;&#24615;&#23545;&#24847;&#22823;&#21033;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#20381;&#38468;
&lt;/p&gt;
&lt;p&gt;
The attachment of adult women to the Italian labour market in the shadow of COVID-19. (arXiv:2202.13317v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.13317
&lt;/p&gt;
&lt;p&gt;
&#24847;&#22823;&#21033;30&#22810;&#23681;&#26377;&#23567;&#23401;&#30340;&#22899;&#24615;&#22312;COVID-19&#22823;&#27969;&#34892;&#20013;&#25918;&#24323;&#20102;&#24037;&#20316;&#65292;&#25104;&#20026;&#20102;&#22833;&#19994;&#20154;&#22763;&#12290;&#30740;&#31350;&#34920;&#26126;&#36825;&#26159;&#30001;&#20110;&#29305;&#23450;&#30340;&#22320;&#21306;&#31038;&#20250;&#25991;&#21270;&#22240;&#32032;&#24341;&#36215;&#30340;&#65292;&#24182;&#21487;&#33021;&#23545;&#22899;&#24615;&#21171;&#21160;&#21147;&#21442;&#19982;&#20135;&#29983;&#38271;&#26399;&#19981;&#21033;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#35843;&#26597;30&#22810;&#23681;&#22899;&#24615;&#22312;&#32844;&#19994;&#19982;&#23478;&#24237;&#36873;&#25321;&#19978;&#30340;&#32467;&#21512;&#65292;&#30740;&#31350;&#20854;&#23545;&#22806;&#37096;&#24178;&#25200;&#22240;&#32032;&#65288;&#22914;COVID-19&#22823;&#27969;&#34892;&#65289;&#30340;&#21453;&#24212;&#26469;&#25506;&#35752;&#22899;&#24615;&#23545;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#20381;&#38468;&#12290;&#25105;&#20204;&#21457;&#29616;&#22312;&#24847;&#22823;&#21033;&#65292;&#35768;&#22810;&#26377;&#23567;&#23401;&#30340;&#22899;&#24615;&#22312;2020&#24180;&#31163;&#24320;&#20102;&#38271;&#26399;&#65288;&#21644;&#20020;&#26102;&#30340;&#65289;&#32844;&#19994;&#65292;&#25104;&#20026;&#20102;&#22833;&#19994;&#20154;&#22763;&#12290;&#23613;&#31649;&#22312;&#22823;&#27969;&#34892;&#29190;&#21457;&#21518;&#30340;&#35266;&#23519;&#26399;&#24456;&#30701;&#65292;&#20294;&#24050;&#30830;&#23450;&#30340;&#24433;&#21709;&#20284;&#20046;&#30456;&#24403;&#22823;&#19988;&#25345;&#20037;&#65292;&#23588;&#20854;&#26159;&#19982;&#21516;&#40836;&#30007;&#24615;&#30456;&#27604;&#12290;&#25105;&#20204;&#35748;&#20026;&#36825;&#31181;&#24773;&#20917;&#26159;&#30001;&#29305;&#23450;&#30340;&#22320;&#21306;&#31038;&#20250;&#25991;&#21270;&#22240;&#32032;&#36896;&#25104;&#30340;&#65292;&#36825;&#20123;&#22240;&#32032;&#39044;&#31034;&#30528;&#21487;&#33021;&#23545;&#22899;&#24615;&#21171;&#21160;&#21147;&#21442;&#19982;&#20135;&#29983;&#38271;&#26399;&#30340;&#19981;&#21033;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate the attachment to the labour market of women in their 30s, who are combining career and family choices, through their reactions to an exogenous, and potentially symmetric shock, such as the COVID-19 pandemic. We find that in Italy a large number of females with small children, living in the North, left permanent (and temporary) employment and became inactive in 2020. Despite the short period of observation after the burst of the pandemic, the identified impacts appear large and persistent, particularly with respect to the males of the same age. We argue that this evidence is ascribable to specific regional socio-cultural factors, which foreshadow a potential long-term detrimental impact on female labour force participation.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#23601;&#36830;&#32493;&#26102;&#38388;&#19979;&#19981;&#21516;&#20511;&#36151;&#19982;&#20648;&#33988;&#21033;&#29575;&#30340;&#40657;-&#26031;&#31185;&#23572;&#26031;&#24066;&#22330;&#20013;&#39532;&#31185;&#32500;&#33576;&#24179;&#22343;&#26041;&#24046;&#32452;&#21512;&#36873;&#25321;&#38382;&#39064;&#36827;&#34892;&#20102;&#30740;&#31350;&#65292;&#32467;&#26524;&#21457;&#29616;&#26368;&#20248;&#20132;&#26131;&#31574;&#30053;&#26159;&#36830;&#32493;&#26102;&#38388;&#20132;&#26131;&#31574;&#30053;&#21644;&#19981;&#36830;&#32493;&#26102;&#38388;&#20132;&#26131;&#31574;&#30053;&#30340;&#28151;&#21512;&#65292;&#20854;&#20013;&#21334;&#31354;&#32929;&#31080;&#27704;&#36828;&#19981;&#26159;&#26368;&#20248;&#31574;&#30053;&#12290;</title><link>http://arxiv.org/abs/2201.00914</link><description>&lt;p&gt;
&#19981;&#21516;&#20511;&#36151;&#19982;&#20648;&#33988;&#21033;&#29575;&#19979;&#30340;&#36830;&#32493;&#26102;&#38388;&#39532;&#31185;&#32500;&#33576;&#24179;&#22343;&#26041;&#24046;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Continuous-time Markowitz's mean-variance model under different borrowing and saving rates. (arXiv:2201.00914v2 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.00914
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23601;&#36830;&#32493;&#26102;&#38388;&#19979;&#19981;&#21516;&#20511;&#36151;&#19982;&#20648;&#33988;&#21033;&#29575;&#30340;&#40657;-&#26031;&#31185;&#23572;&#26031;&#24066;&#22330;&#20013;&#39532;&#31185;&#32500;&#33576;&#24179;&#22343;&#26041;&#24046;&#32452;&#21512;&#36873;&#25321;&#38382;&#39064;&#36827;&#34892;&#20102;&#30740;&#31350;&#65292;&#32467;&#26524;&#21457;&#29616;&#26368;&#20248;&#20132;&#26131;&#31574;&#30053;&#26159;&#36830;&#32493;&#26102;&#38388;&#20132;&#26131;&#31574;&#30053;&#21644;&#19981;&#36830;&#32493;&#26102;&#38388;&#20132;&#26131;&#31574;&#30053;&#30340;&#28151;&#21512;&#65292;&#20854;&#20013;&#21334;&#31354;&#32929;&#31080;&#27704;&#36828;&#19981;&#26159;&#26368;&#20248;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36830;&#32493;&#26102;&#38388;&#19979;&#19982;&#19981;&#21516;&#20511;&#36151;&#21644;&#20648;&#33988;&#21033;&#29575;&#30456;&#20851;&#30340;&#40657;-&#26031;&#31185;&#23572;&#26031;&#24066;&#22330;&#20013;&#30340;&#39532;&#31185;&#32500;&#33576;&#24179;&#22343;&#26041;&#24046;&#32452;&#21512;&#36873;&#25321;&#38382;&#39064;&#12290;&#30456;&#20851;&#30340;&#21704;&#23494;&#23572;&#39039;-&#38597;&#21487;&#27604;-&#36125;&#23572;&#26364;&#26041;&#31243;&#26159;&#23436;&#20840;&#38750;&#32447;&#24615;&#30340;&#12290;&#36890;&#36807;&#20351;&#29992;&#24494;&#22937;&#30340;&#20559;&#24494;&#20998;&#26041;&#31243;&#21644;&#39564;&#35777;&#35770;&#35777;&#65292;&#35777;&#26126;&#20102;&#20215;&#20540;&#20989;&#25968;&#26159;$C^{3,2}$&#20809;&#28369;&#30340;&#12290;&#21516;&#26102;&#65292;&#35777;&#26126;&#20102;&#23384;&#22312;&#19968;&#20010;&#20511;&#36151;&#36793;&#30028;&#21644;&#19968;&#20010;&#20648;&#33988;&#22721;&#22418;&#65292;&#23558;&#25972;&#20010;&#20132;&#26131;&#21306;&#22495;&#20998;&#20026;&#36880;&#28176;&#22686;&#38271;&#30340;&#20511;&#38065;&#21306;&#22495;&#12289;&#20840;&#20179;&#32929;&#31080;&#21306;&#22495;&#21644;&#20648;&#33988;&#38065;&#21306;&#22495;&#12290;&#26368;&#20248;&#20132;&#26131;&#31574;&#30053;&#26159;&#36830;&#32493;&#26102;&#38388;&#20132;&#26131;&#31574;&#30053;&#65288;&#30001;&#22823;&#22810;&#25968;&#36830;&#32493;&#26102;&#38388;&#27169;&#22411;&#24314;&#35758;&#65289;&#21644;&#19981;&#36830;&#32493;&#26102;&#38388;&#20132;&#26131;&#31574;&#30053;&#65288;&#30001;&#20855;&#26377;&#20132;&#26131;&#25104;&#26412;&#27169;&#22411;&#24314;&#35758;&#65289;&#30340;&#28151;&#21512;&#65306;&#22312;&#20013;&#38388;&#30340;&#20840;&#20179;&#32929;&#31080;&#21306;&#22495;&#20013;&#65292;&#24212;&#35813;&#25226;&#25152;&#26377;&#30340;&#36130;&#23500;&#37117;&#25237;&#20837;&#21040;&#32929;&#31080;&#20013;&#65292;&#24182;&#22312;&#20854;&#20182;&#20004;&#20010;&#21306;&#22495;&#20013;&#19981;&#26029;&#20197;&#36130;&#23500;&#21644;&#26102;&#38388;&#30340;&#21453;&#39304;&#24418;&#24335;&#36827;&#34892;&#20132;&#26131;&#12290;&#21334;&#31354;&#32929;&#31080;&#27704;&#36828;&#19981;&#26159;&#26368;&#20248;&#31574;&#30053;&#12290;&#21516;&#26102;&#36824;&#32473;&#20986;&#20102;&#19968;&#20123;&#25968;&#20540;&#20363;&#23376;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study Markowitz's mean-variance portfolio selection problem in a continuous-time Black-Scholes market with different borrowing and saving rates. The associated Hamilton-Jacobi-Bellman equation is fully nonlinear. Using a delicate partial differential equation and verification argument, the value function is proven to be $C^{3,2}$ smooth. It is also shown that there are a borrowing boundary and a saving barrier which divide the entire trading area into a borrowing-money region, an all-in-stock region, and a saving-money region in ascending order. The optimal trading strategy is a mixture of continuous-time strategy (as suggested by most continuous-time models) and discontinuous-time strategy (as suggested by models with transaction costs): one should put all her wealth in the stock in the middle all-in-stock region, and continuously trade it in the other two regions in a feedback form of wealth and time. It is never optimal to short sale the stock. Numerical examples are also present
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#19968;&#31181;&#21033;&#29992;&#30005;&#21147;&#22823;&#25968;&#25454;&#27979;&#37327;&#32463;&#27982;&#19981;&#30830;&#23450;&#24615;&#30340;&#26041;&#27861;&#65292;&#26500;&#24314;&#20986;&#20102;&#21487;&#27604;&#36739;&#30340;&#32463;&#27982;&#29366;&#20917;&#19981;&#30830;&#23450;&#24615;&#25351;&#25968;&#65292;&#25104;&#21151;&#25429;&#25417;&#21040;&#20102;COVID-19&#23545;&#19978;&#28023;&#32463;&#27982;&#29366;&#20917;&#30340;&#36127;&#38754;&#24433;&#21709;&#65292;&#23637;&#31034;&#20102;&#19981;&#21516;&#22320;&#21306;&#21644;&#34892;&#19994;&#30340;&#24322;&#36136;&#24615;&#12290;</title><link>http://arxiv.org/abs/2107.11593</link><description>&lt;p&gt;
&#20174;&#30005;&#21147;&#22823;&#25968;&#25454;&#20013;&#25512;&#26029;&#32463;&#27982;&#29366;&#20917;&#19981;&#30830;&#23450;&#24615;
&lt;/p&gt;
&lt;p&gt;
Inferring Economic Condition Uncertainty from Electricity Big Data. (arXiv:2107.11593v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2107.11593
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#19968;&#31181;&#21033;&#29992;&#30005;&#21147;&#22823;&#25968;&#25454;&#27979;&#37327;&#32463;&#27982;&#19981;&#30830;&#23450;&#24615;&#30340;&#26041;&#27861;&#65292;&#26500;&#24314;&#20986;&#20102;&#21487;&#27604;&#36739;&#30340;&#32463;&#27982;&#29366;&#20917;&#19981;&#30830;&#23450;&#24615;&#25351;&#25968;&#65292;&#25104;&#21151;&#25429;&#25417;&#21040;&#20102;COVID-19&#23545;&#19978;&#28023;&#32463;&#27982;&#29366;&#20917;&#30340;&#36127;&#38754;&#24433;&#21709;&#65292;&#23637;&#31034;&#20102;&#19981;&#21516;&#22320;&#21306;&#21644;&#34892;&#19994;&#30340;&#24322;&#36136;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25512;&#26029;&#32463;&#27982;&#29366;&#20917;&#30340;&#19981;&#30830;&#23450;&#24615;&#23545;&#20110;&#20915;&#31574;&#32773;&#21644;&#24066;&#22330;&#21442;&#19982;&#32773;&#37117;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#38544;&#39532;&#23572;&#21487;&#22827;&#27169;&#22411;(HMM)&#27979;&#37327;&#32463;&#27982;&#19981;&#30830;&#23450;&#24615;&#30340;&#26032;&#26041;&#27861;&#12290;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#26080;&#37327;&#32434;&#25351;&#25968;&#65292;&#32463;&#27982;&#29366;&#20917;&#19981;&#30830;&#23450;&#24615;(ECU)&#25351;&#25968;&#65292;&#20854;&#33539;&#22260;&#20174;&#38646;&#21040;&#19968;&#65292;&#21487;&#22312;&#19981;&#21516;&#34892;&#19994;&#12289;&#22320;&#21306;&#21644;&#26102;&#26399;&#36827;&#34892;&#27604;&#36739;&#12290;&#25105;&#20204;&#20351;&#29992;2018&#24180;&#33267;2020&#24180;&#19978;&#28023;&#24066;18000&#22810;&#23478;&#20225;&#19994;&#30340;&#26085;&#29992;&#30005;&#37327;&#25968;&#25454;&#26500;&#24314;&#20102;ECU&#25351;&#25968;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#26080;&#35770;&#26159;&#22312;&#34892;&#19994;&#36824;&#26159;&#22312;&#22320;&#21306;&#23618;&#38754;&#19978;&#65292;&#25152;&#26377;&#30340;ECU&#25351;&#25968;&#37117;&#25104;&#21151;&#25429;&#25417;&#21040;&#20102;COVID-19&#23545;&#19978;&#28023;&#32463;&#27982;&#29366;&#20917;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;&#27492;&#22806;&#65292;ECU&#25351;&#25968;&#36824;&#23637;&#29616;&#20102;&#19981;&#21516;&#22320;&#21306;&#21644;&#19981;&#21516;&#34892;&#19994;&#30340;&#24322;&#36136;&#24615;&#12290;&#36825;&#21453;&#26144;&#20102;&#32463;&#27982;&#29366;&#20917;&#19981;&#30830;&#23450;&#24615;&#30340;&#21464;&#21270;&#20027;&#35201;&#19982;&#21306;&#22495;&#32463;&#27982;&#32467;&#26500;&#21644;&#34892;&#19994;&#38754;&#20020;&#30340;&#26377;&#38024;&#23545;&#24615;&#30340;&#30417;&#31649;&#25919;&#31574;&#26377;&#20851;&#12290;
&lt;/p&gt;
&lt;p&gt;
Inferring the uncertainty in economic conditions is significant for both decision makers as well as market players. In this paper, we propose a novel approach to measure the economic uncertainties by using the Hidden Markov Model (HMM). We construct a dimensionless index, Economic Condition Uncertainty (ECU) index, which ranges from zero to one and is comparable among sectors, regions and periods. We used the daily electricity consumption data of more than 18,000 firms in Shanghai from 2018 to 2020 to construct the ECU indexes. Results show that all ECU indexes, whether at sectoral or regional level, successfully captured the negative impacts of COVID-19 on Shanghai's economic conditions. Besides, the ECU indexes also presented the heterogeneities in different districts as well as in different sectors. This reflects the facts that changes in the uncertainty of economic conditions are mainly related to regional economic structures and targeted regulatory policies faced by sectors. The E
&lt;/p&gt;</description></item><item><title>&#21360;&#24230;&#19968;&#39033;&#25919;&#31574;&#25514;&#26045;&#25480;&#20104;&#26410;&#23130;&#22919;&#22899;&#32487;&#25215;&#26435;&#65292;&#25913;&#21892;&#20102;&#20799;&#31461;&#36523;&#39640;&#21644;&#20307;&#37325;&#65292;&#21516;&#26102;&#25552;&#39640;&#20102;&#27597;&#20146;&#22312;&#23478;&#24237;&#20869;&#30340;&#35848;&#21028;&#33021;&#21147;&#65292;&#20174;&#32780;&#20135;&#29983;&#20102;&#26356;&#22909;&#30340;&#29238;&#27597;&#29031;&#39038;&#21644;&#25913;&#21892;&#30340;&#20799;&#31461;&#20581;&#24247;&#29366;&#20917;&#30340;&#25928;&#30410;&#12290;&#36825;&#34920;&#26126;&#65292;&#36171;&#20104;&#22919;&#22899;&#26435;&#21033;&#30340;&#25919;&#31574;&#21487;&#20197;&#23545;&#20799;&#31461;&#30340;&#20154;&#21147;&#36164;&#26412;&#20135;&#29983;&#39069;&#22806;&#31215;&#26497;&#25928;&#24212;&#12290;</title><link>http://arxiv.org/abs/2106.10841</link><description>&lt;p&gt;
&#25317;&#26377;&#36130;&#20135;&#26435;&#65306;&#25171;&#30772;&#24615;&#21035;&#22721;&#22418;&#25913;&#21892;&#21360;&#24230;&#20799;&#31461;&#20581;&#24247;&#29366;&#20917;
&lt;/p&gt;
&lt;p&gt;
Entitled to Property: How Breaking the Gender Barrier Improves Child Health in India. (arXiv:2106.10841v9 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2106.10841
&lt;/p&gt;
&lt;p&gt;
&#21360;&#24230;&#19968;&#39033;&#25919;&#31574;&#25514;&#26045;&#25480;&#20104;&#26410;&#23130;&#22919;&#22899;&#32487;&#25215;&#26435;&#65292;&#25913;&#21892;&#20102;&#20799;&#31461;&#36523;&#39640;&#21644;&#20307;&#37325;&#65292;&#21516;&#26102;&#25552;&#39640;&#20102;&#27597;&#20146;&#22312;&#23478;&#24237;&#20869;&#30340;&#35848;&#21028;&#33021;&#21147;&#65292;&#20174;&#32780;&#20135;&#29983;&#20102;&#26356;&#22909;&#30340;&#29238;&#27597;&#29031;&#39038;&#21644;&#25913;&#21892;&#30340;&#20799;&#31461;&#20581;&#24247;&#29366;&#20917;&#30340;&#25928;&#30410;&#12290;&#36825;&#34920;&#26126;&#65292;&#36171;&#20104;&#22919;&#22899;&#26435;&#21033;&#30340;&#25919;&#31574;&#21487;&#20197;&#23545;&#20799;&#31461;&#30340;&#20154;&#21147;&#36164;&#26412;&#20135;&#29983;&#39069;&#22806;&#31215;&#26497;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38750;&#21333;&#20803;&#23478;&#24237;&#27169;&#22411;&#35748;&#20026;&#65292;&#22686;&#21152;&#22919;&#22899;&#30340;&#35848;&#21028;&#33021;&#21147;&#21487;&#20197;&#24433;&#21709;&#20799;&#31461;&#30340;&#20581;&#24247;&#29366;&#20917;&#65292;&#36825;&#26159;&#24433;&#21709;&#25104;&#24180;&#21518;&#20154;&#21147;&#36164;&#26412;&#21644;&#32463;&#27982;&#22320;&#20301;&#30340;&#37325;&#35201;&#39044;&#27979;&#22240;&#32032;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#25919;&#31574;&#21464;&#21270;&#65306;&#21360;&#24230;&#12298;&#21360;&#24230;&#25945;&#32487;&#25215;&#27861;&#12299;&#20462;&#27491;&#26696;&#65288;Hindu Succession Act Amendment&#65292;HSAA&#65289;&#65292;&#35813;&#20462;&#27491;&#26696;&#20026;&#26410;&#23130;&#22919;&#22899;&#25552;&#20379;&#20102;&#32487;&#25215;&#26435;&#65292;&#23545;&#20799;&#31461;&#20581;&#24247;&#29366;&#20917;&#20135;&#29983;&#24433;&#21709;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;HSAA&#25913;&#21892;&#20102;&#20799;&#31461;&#30340;&#36523;&#39640;&#21644;&#20307;&#37325;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#21457;&#29616;&#65292;&#35813;&#25919;&#31574;&#25913;&#21892;&#20102;&#22919;&#22899;&#22312;&#23478;&#24237;&#20869;&#30340;&#35848;&#21028;&#33021;&#21147;&#65292;&#36890;&#36807;&#26356;&#22909;&#30340;&#29238;&#27597;&#29031;&#26009;&#21644;&#25913;&#21892;&#30340;&#20799;&#31461;&#20581;&#24247;&#29366;&#20917;&#20135;&#29983;&#20102;&#19979;&#28216;&#25928;&#30410;&#12290;&#30740;&#31350;&#32467;&#26524;&#35777;&#23454;&#65292;&#24403;&#27597;&#20146;&#25511;&#21046;&#26356;&#22823;&#27604;&#20363;&#30340;&#23478;&#24237;&#36164;&#28304;&#26102;&#65292;&#20799;&#31461;&#30340;&#24773;&#20917;&#26356;&#22909;&#12290;&#22240;&#27492;&#65292;&#36171;&#20104;&#22919;&#22899;&#26435;&#21147;&#30340;&#25919;&#31574;&#21487;&#20197;&#23545;&#20799;&#31461;&#30340;&#20154;&#21147;&#36164;&#26412;&#20135;&#29983;&#39069;&#22806;&#31215;&#26497;&#28322;&#20986;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
Non-unitary household models posit that increasing women's bargaining power can affect child health, a significant predictor of human capital and economic status throughout adulthood. We study how a policy change, the Hindu Succession Act Amendment (HSAA), which provided inheritance rights to unmarried women in India, impacts child health. We find evidence that the HSAA improved the height and weight of children. In addition, we find evidence consistent with a channel that the policy improved women's intra-household bargaining power, leading to downstream benefits through better parental care for children and improved child health. The findings confirm that children do better when their mothers control a more significant fraction of the family resources. Thus, policies that empower women can have additional positive spillovers for children's human capital.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#36890;&#36807;&#30740;&#31350;&#20648;&#32592;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#31070;&#32463;&#32593;&#32476;&#26469;&#20195;&#26367;&#20256;&#32479;&#21069;&#39304;&#31070;&#32463;&#32593;&#32476;&#20197;&#26356;&#22909;&#22320;&#20272;&#35745;&#36125;&#23572;&#26364;&#20540;&#21644;&#28151;&#21512;&#31639;&#27861;&#35299;&#20915;&#19968;&#20123;&#38543;&#26426;&#32447;&#24615;&#38382;&#39064;&#65292;&#20248;&#21270;&#24211;&#23481;&#12290;</title><link>http://arxiv.org/abs/2106.08097</link><description>&lt;p&gt;
&#24211;&#23481;&#20248;&#21270;&#21644;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Reservoir optimization and Machine Learning methods. (arXiv:2106.08097v3 [math.OC] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2106.08097
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#36890;&#36807;&#30740;&#31350;&#20648;&#32592;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#31070;&#32463;&#32593;&#32476;&#26469;&#20195;&#26367;&#20256;&#32479;&#21069;&#39304;&#31070;&#32463;&#32593;&#32476;&#20197;&#26356;&#22909;&#22320;&#20272;&#35745;&#36125;&#23572;&#26364;&#20540;&#21644;&#28151;&#21512;&#31639;&#27861;&#35299;&#20915;&#19968;&#20123;&#38543;&#26426;&#32447;&#24615;&#38382;&#39064;&#65292;&#20248;&#21270;&#24211;&#23481;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#23637;&#31034;&#20102;&#21069;&#39304;&#31070;&#32463;&#32593;&#32476;&#22312;&#39640;&#32500;&#24230;&#20648;&#23384;&#38382;&#39064;&#30340;&#20840;&#23616;&#20248;&#21270;&#20013;&#20272;&#35745;&#25511;&#21046;&#30340;&#25928;&#29575;&#21518;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#22522;&#20110;&#21160;&#24577;&#35268;&#21010;&#21407;&#29702;&#30340;&#31639;&#27861;&#20462;&#25913;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#32463;&#20856;&#30340;&#21069;&#39304;&#31070;&#32463;&#32593;&#32476;&#26080;&#27861;&#26377;&#25928;&#22320;&#20272;&#35745;&#20648;&#32592;&#38382;&#39064;&#30340;&#36125;&#23572;&#26364;&#20540;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20123;&#31070;&#32463;&#32593;&#32476;&#65292;&#20854;&#32467;&#26524;&#35201;&#22909;&#24471;&#22810;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#31639;&#27861;&#65292;&#23558;LP&#35299;&#20915;&#26041;&#26696;&#19982;&#31070;&#32463;&#32593;&#32476;&#35745;&#31639;&#30340;&#26465;&#20214;&#21106;&#32447;&#28151;&#21512;&#22312;&#19968;&#36215;&#65292;&#20197;&#35299;&#20915;&#19968;&#20123;&#38543;&#26426;&#32447;&#24615;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
After showing the efficiency of feedforward networks to estimate control in high dimension in the global optimization of some storages problems, we develop a modification of an algorithm based on some dynamic programming principle. We show that classical feedforward networks are not effective to estimate Bellman values for reservoir problems and we propose some neural networks giving far better results. At last, we develop a new algorithm mixing LP resolution and conditional cuts calculated by neural networks to solve some stochastic linear problems.
&lt;/p&gt;</description></item></channel></rss>