<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#40092;&#26377;&#20851;&#20110;&#30707;&#27833;&#20381;&#36182;/&#20016;&#23500;&#19982;&#25910;&#20837;&#19981;&#24179;&#31561;&#30340;&#36328;&#22269;&#20851;&#31995;&#30340;&#30740;&#31350;&#65292;&#26412;&#25991;&#39318;&#27425;&#28145;&#20837;&#25506;&#35752;&#20102;&#20004;&#32773;&#20043;&#38388;&#30340;&#23454;&#35777;&#20851;&#31995;&#65292;&#24182;&#32771;&#23519;&#20102;&#30707;&#27833;&#23500;&#35029;&#22269;&#23478;&#26159;&#21542;&#20542;&#21521;&#20110;&#20302;&#20272;&#25910;&#20837;&#19981;&#24179;&#31561;&#25968;&#25454;&#30340;&#21487;&#33021;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2401.04046</link><description>&lt;p&gt;
&#25910;&#20837;&#19981;&#24179;&#31561;&#19982;&#30707;&#27833;&#36164;&#28304;&#35781;&#21650;
&lt;/p&gt;
&lt;p&gt;
Income inequality and the oil resource curse. (arXiv:2401.04046v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.04046
&lt;/p&gt;
&lt;p&gt;
&#40092;&#26377;&#20851;&#20110;&#30707;&#27833;&#20381;&#36182;/&#20016;&#23500;&#19982;&#25910;&#20837;&#19981;&#24179;&#31561;&#30340;&#36328;&#22269;&#20851;&#31995;&#30340;&#30740;&#31350;&#65292;&#26412;&#25991;&#39318;&#27425;&#28145;&#20837;&#25506;&#35752;&#20102;&#20004;&#32773;&#20043;&#38388;&#30340;&#23454;&#35777;&#20851;&#31995;&#65292;&#24182;&#32771;&#23519;&#20102;&#30707;&#27833;&#23500;&#35029;&#22269;&#23478;&#26159;&#21542;&#20542;&#21521;&#20110;&#20302;&#20272;&#25910;&#20837;&#19981;&#24179;&#31561;&#25968;&#25454;&#30340;&#21487;&#33021;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20196;&#20154;&#24778;&#35766;&#30340;&#26159;&#65292;&#20851;&#20110;&#30707;&#27833;&#20381;&#36182;/&#20016;&#23500;&#19982;&#25910;&#20837;&#19981;&#24179;&#31561;&#30340;&#36328;&#22269;&#20851;&#31995;&#30340;&#30740;&#31350;&#24456;&#23569;&#12290;&#21516;&#26102;&#65292;&#26377;&#19968;&#20123;&#21021;&#27493;&#35777;&#25454;&#34920;&#26126;&#65292;&#30707;&#27833;&#23500;&#35029;&#22269;&#23478;&#20542;&#21521;&#20110;&#20302;&#20272;&#25910;&#20837;&#19981;&#24179;&#31561;&#30340;&#25968;&#25454;&#65292;&#36825;&#21487;&#33021;&#20250;&#24433;&#21709;&#20272;&#35745;&#30340;&#23454;&#35777;&#20851;&#31995;&#12290;&#22312;&#36825;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#20197;&#20004;&#20010;&#26041;&#38754;&#20026;&#25991;&#29486;&#20570;&#20986;&#36129;&#29486;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#21033;&#29992;&#26631;&#20934;&#21270;&#19990;&#30028;&#25910;&#20837;&#19981;&#24179;&#31561;&#25968;&#25454;&#24211;&#65292;&#23545;&#30707;&#27833;&#21644;&#25910;&#20837;&#19981;&#24179;&#31561;&#20043;&#38388;&#30340;&#23454;&#35777;&#20851;&#31995;&#36827;&#34892;&#20102;&#28145;&#20837;&#25506;&#35752;&#65307;&#36825;&#26159;&#25552;&#20379;&#26368;&#20840;&#38754;&#30340;&#25910;&#20837;&#19981;&#24179;&#31561;&#25968;&#25454;&#30340;&#25968;&#25454;&#38598;&#65292;&#21487;&#23545;&#26368;&#24191;&#27867;&#30340;&#22269;&#23478;&#24180;&#20221;&#35266;&#23519;&#36827;&#34892;&#27604;&#36739;&#12290;&#20854;&#27425;&#65292;&#25454;&#25105;&#20204;&#25152;&#30693;&#65292;&#36825;&#26159;&#31532;&#19968;&#39033;&#37319;&#29992;&#23454;&#35777;&#26694;&#26550;&#26469;&#30740;&#31350;&#30707;&#27833;&#23500;&#35029;&#22269;&#23478;&#26159;&#21542;&#20542;&#21521;&#20110;&#20302;&#20272;&#25910;&#20837;&#19981;&#24179;&#31561;&#25968;&#25454;&#21450;&#20854;&#21487;&#33021;&#30340;&#24433;&#21709;&#30340;&#30740;&#31350;&#12290;&#25105;&#20204;&#37319;&#29992;Heckman&#36873;&#25321;&#27169;&#22411;&#36827;&#34892;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
Surprisingly, there has been little research conducted about the cross-country relationship between oil dependence/abundance and income inequality. At the same time, there is some tentative evidence suggesting that oil rich nations tend to under-report data on income inequality, which can potentially influence the estimated empirical relationships between oil richness and income inequality. In this paper we contribute to the literature in a twofold manner. First, we explore in depth the empirical relationship between oil and income inequality by making use of the Standardized World Income Inequality Database; the most comprehensive dataset on income inequality providing comparable data for the broadest set of country-year observations. Second, this is the first study to our knowledge that adopts an empirical framework to examine whether oil rich nations tend to under-report data on income inequality and the possible implications thereof. We make use of Heckman selection models to valid
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26102;&#38388;&#21464;&#21270;&#26041;&#27861;&#26469;&#30740;&#31350;&#38544;&#21547;&#27874;&#21160;&#29575;&#24494;&#31505;&#30340;&#24418;&#24577;&#12290;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#24120;&#35265;&#30340;&#21322;&#38808;&#27169;&#22411;&#65292;&#25913;&#36827;&#20102;&#22522;&#20110;&#30697;&#30340;&#20844;&#24335;&#26469;&#36817;&#20284;&#24179;&#20215;&#36873;&#25321;&#26435;&#30340;&#20559;&#26012;&#21644;&#26354;&#29575;&#65292;&#36890;&#36807;&#26126;&#30830;&#35745;&#31639;&#20986;&#36825;&#20123;&#30697;&#65292;&#32771;&#34385;&#20102;&#20960;&#20010;&#27169;&#22411;&#30340;&#26497;&#38480;&#20559;&#26012;&#21644;&#26354;&#29575;&#65292;&#24182;&#36890;&#36807;&#25968;&#20540;&#26041;&#27861;&#21644;&#23454;&#35777;&#25968;&#25454;&#36827;&#34892;&#20102;&#27979;&#35797;&#65292;&#26368;&#21518;&#24212;&#29992;&#20110;&#26657;&#20934;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2401.03776</link><description>&lt;p&gt;
&#20998;&#35299;&#24494;&#31505;&#65306;&#19968;&#31181;&#26102;&#38388;&#21464;&#21270;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Decomposing Smiles: A Time Change Approach. (arXiv:2401.03776v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.03776
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26102;&#38388;&#21464;&#21270;&#26041;&#27861;&#26469;&#30740;&#31350;&#38544;&#21547;&#27874;&#21160;&#29575;&#24494;&#31505;&#30340;&#24418;&#24577;&#12290;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#24120;&#35265;&#30340;&#21322;&#38808;&#27169;&#22411;&#65292;&#25913;&#36827;&#20102;&#22522;&#20110;&#30697;&#30340;&#20844;&#24335;&#26469;&#36817;&#20284;&#24179;&#20215;&#36873;&#25321;&#26435;&#30340;&#20559;&#26012;&#21644;&#26354;&#29575;&#65292;&#36890;&#36807;&#26126;&#30830;&#35745;&#31639;&#20986;&#36825;&#20123;&#30697;&#65292;&#32771;&#34385;&#20102;&#20960;&#20010;&#27169;&#22411;&#30340;&#26497;&#38480;&#20559;&#26012;&#21644;&#26354;&#29575;&#65292;&#24182;&#36890;&#36807;&#25968;&#20540;&#26041;&#27861;&#21644;&#23454;&#35777;&#25968;&#25454;&#36827;&#34892;&#20102;&#27979;&#35797;&#65292;&#26368;&#21518;&#24212;&#29992;&#20110;&#26657;&#20934;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#37319;&#29992;&#19968;&#31181;&#26032;&#39062;&#30340;&#26102;&#38388;&#21464;&#21270;&#26041;&#27861;&#26469;&#30740;&#31350;&#38544;&#21547;&#27874;&#21160;&#29575;&#24494;&#31505;&#30340;&#24418;&#29366;&#12290;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#24120;&#35265;&#30340;&#21322;&#38808;&#27169;&#22411;&#65292;&#21253;&#25324;&#36339;&#36291;&#25193;&#25955;&#27169;&#22411;&#12289;&#31895;&#31961;&#27874;&#21160;&#27169;&#22411;&#21644;&#26080;&#38480;&#27963;&#21160;&#27169;&#22411;&#12290;&#25105;&#20204;&#29992;&#25913;&#36827;&#30340;&#22522;&#20110;&#30697;&#30340;&#20844;&#24335;&#36817;&#20284;&#24179;&#20215;&#36873;&#25321;&#26435;&#30340;&#20559;&#26012;&#21644;&#26354;&#29575;&#12290;&#22312;&#26102;&#38388;&#21464;&#21270;&#26694;&#26550;&#19979;&#26126;&#30830;&#35745;&#31639;&#20986;&#36825;&#20123;&#30697;&#12290;&#23545;&#20110;&#20960;&#20010;&#27169;&#22411;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#26497;&#38480;&#30340;&#20559;&#26012;&#21644;&#26354;&#29575;&#12290;&#25105;&#20204;&#36824;&#36890;&#36807;&#25968;&#20540;&#26041;&#27861;&#21644;&#23454;&#35777;&#25968;&#25454;&#23545;&#30701;&#26399;&#36924;&#36817;&#32467;&#26524;&#30340;&#20934;&#30830;&#24615;&#36827;&#34892;&#20102;&#27979;&#35797;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#35813;&#26041;&#27861;&#24212;&#29992;&#20110;&#26657;&#20934;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a novel time-change approach to study the shape of implied volatility smiles. The method is applicable to common semimartingale models, including jump-diffusion, rough volatility and infinite activity models. We approximate the at-the-money skew and curvature with an improved moment-based formula. The moments are further explicitly computed under a time change framework. The limiting skew and curvature for several models are considered. We also test the accuracy of the short-term approximation results on models via numerical methods and on empirical data. Finally, we apply the method to the calibration problem.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#36890;&#36807;&#20351;&#29992;&#22320;&#29702;&#20301;&#32622;&#30340;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#65292;&#21457;&#29616;&#20165;&#20165;&#20381;&#36182;&#22269;&#23478;&#24179;&#22343;&#20540;&#19981;&#33021;&#20805;&#20998;&#25429;&#25417;&#21644;&#35299;&#37322;&#27668;&#20505;&#23545;&#27431;&#20803;&#21306;&#28040;&#36153;&#32773;&#29289;&#20215;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2401.03740</link><description>&lt;p&gt;
&#23384;&#38065;&#22791;&#29992;&#65306;&#27668;&#20505;&#21464;&#21270;&#23545;&#27431;&#20803;&#21306;&#28040;&#36153;&#32773;&#29289;&#20215;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Saving for sunny days: The impact of climate (change) on consumer prices in the euro area. (arXiv:2401.03740v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.03740
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#36890;&#36807;&#20351;&#29992;&#22320;&#29702;&#20301;&#32622;&#30340;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#65292;&#21457;&#29616;&#20165;&#20165;&#20381;&#36182;&#22269;&#23478;&#24179;&#22343;&#20540;&#19981;&#33021;&#20805;&#20998;&#25429;&#25417;&#21644;&#35299;&#37322;&#27668;&#20505;&#23545;&#27431;&#20803;&#21306;&#28040;&#36153;&#32773;&#29289;&#20215;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27668;&#20505;&#21464;&#21270;&#23545;&#21508;&#20010;&#22269;&#23478;&#25110;&#22320;&#21306;&#30340;&#21830;&#21697;&#21644;&#26381;&#21153;&#20215;&#26684;&#24433;&#21709;&#19981;&#21516;&#12290;&#20165;&#20165;&#20381;&#36182;&#20110;&#24635;&#20307;&#27979;&#37327;&#25110;&#25688;&#35201;&#32479;&#35745;&#25968;&#25454;&#65292;&#20363;&#22914;&#22269;&#23478;&#24179;&#22343;&#28201;&#24230;&#21464;&#21270;&#23545;HICP&#24635;&#20307;&#36890;&#32960;&#30340;&#24433;&#21709;&#65292;&#38544;&#34255;&#20102;&#32463;&#27982;&#37096;&#38376;&#65288;&#20122;&#37096;&#38376;&#65289;&#38388;&#30340;&#24040;&#22823;&#24322;&#36136;&#24615;&#12290;&#27492;&#22806;&#65292;&#27668;&#35937;&#24322;&#24120;&#23545;&#28040;&#36153;&#32773;&#20215;&#26684;&#30340;&#24433;&#21709;&#19981;&#20165;&#21462;&#20915;&#20110;&#20854;&#31526;&#21495;&#21644;&#22823;&#23567;&#65292;&#36824;&#21462;&#20915;&#20110;&#20854;&#20301;&#32622;&#20197;&#21450;&#21463;&#20914;&#20987;&#24433;&#21709;&#30340;&#21306;&#22495;&#30340;&#35268;&#27169;&#12290;&#23545;&#20110;&#20855;&#26377;&#22810;&#26679;&#27668;&#20505;&#21306;&#22495;&#30340;&#22823;&#22269;&#25110;&#22320;&#21306;&#26469;&#35828;&#23588;&#20854;&#22914;&#27492;&#65292;&#22240;&#20026;&#27668;&#20505;&#25928;&#24212;&#30340;&#22320;&#29702;&#20998;&#24067;&#23545;&#22609;&#36896;&#32463;&#27982;&#32467;&#26524;&#36215;&#21040;&#20102;&#20316;&#29992;&#12290;&#36890;&#36807;&#20351;&#29992;&#22320;&#29702;&#20301;&#32622;&#30340;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#65292;&#25105;&#20204;&#35777;&#26126;&#20165;&#20165;&#20381;&#36182;&#22269;&#23478;&#24179;&#22343;&#20540;&#19981;&#33021;&#20805;&#20998;&#25429;&#25417;&#21644;&#35299;&#37322;&#27668;&#20505;&#23545;&#27431;&#20803;&#21306;&#28040;&#36153;&#32773;&#29289;&#20215;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#24471;&#20986;&#32467;&#35770;&#65292;&#20016;&#23500;&#32780;&#22797;&#26434;&#30340;&#34920;&#38754;&#25968;&#25454;&#20013;&#38544;&#34255;&#30340;&#20449;&#24687;&#20869;&#23481;&#21487;&#20197;&#25552;&#20379;&#26377;&#20215;&#20540;&#30340;&#27934;&#35265;&#12290;
&lt;/p&gt;
&lt;p&gt;
Climate (change) affects the prices of goods and services in different countries or regions differently. Simply relying on aggregate measures or summary statistics, such as the impact of average country temperature changes on HICP headline inflation, conceals a large heterogeneity across (sub-)sectors of the economy. Additionally, the impact of a weather anomaly on consumer prices depends not only on its sign and magnitude, but also on its location and the size of the area affected by the shock. This is especially true for larger countries or regions with diverse climate zones, since the geographical distribution of climatic effects plays a role in shaping economic outcomes. Using time series data of geolocations, we demonstrate that relying solely on country averages fails to adequately capture and explain the influence of weather on consumer prices in the euro area. We conclude that the information content hidden in rich and complex surface data can provide valuable insights into the
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;MarketSenseAI&#65292;&#19968;&#20010;&#21033;&#29992;GPT-4&#36827;&#34892;&#32929;&#31080;&#36873;&#25321;&#30340;&#20154;&#24037;&#26234;&#33021;&#26694;&#26550;&#65292;&#34701;&#21512;&#20102;&#22810;&#31181;&#25968;&#25454;&#28304;&#21644;&#25512;&#29702;&#33021;&#21147;&#65292;&#25552;&#20379;&#20855;&#26377;&#21487;&#34892;&#35299;&#37322;&#30340;&#25237;&#36164;&#20449;&#21495;&#12290;</title><link>http://arxiv.org/abs/2401.03737</link><description>&lt;p&gt;
&#33021;&#21542;&#25171;&#36133;&#21326;&#23572;&#34903;&#65311;&#25581;&#31034;&#20154;&#24037;&#26234;&#33021;&#22312;&#32929;&#31080;&#36873;&#25321;&#20013;&#30340;&#28508;&#21147;
&lt;/p&gt;
&lt;p&gt;
Can Large Language Models Beat Wall Street? Unveiling the Potential of AI in Stock Selection. (arXiv:2401.03737v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.03737
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;MarketSenseAI&#65292;&#19968;&#20010;&#21033;&#29992;GPT-4&#36827;&#34892;&#32929;&#31080;&#36873;&#25321;&#30340;&#20154;&#24037;&#26234;&#33021;&#26694;&#26550;&#65292;&#34701;&#21512;&#20102;&#22810;&#31181;&#25968;&#25454;&#28304;&#21644;&#25512;&#29702;&#33021;&#21147;&#65292;&#25552;&#20379;&#20855;&#26377;&#21487;&#34892;&#35299;&#37322;&#30340;&#25237;&#36164;&#20449;&#21495;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#37329;&#34701;&#24066;&#22330;&#21160;&#24577;&#21644;&#25968;&#25454;&#39537;&#21160;&#30340;&#29615;&#22659;&#20013;&#65292;&#26412;&#25991;&#20171;&#32461;&#20102;MarketSenseAI&#65292;&#19968;&#20010;&#21033;&#29992;GPT-4&#20808;&#36827;&#25512;&#29702;&#33021;&#21147;&#36827;&#34892;&#21487;&#25193;&#23637;&#32929;&#31080;&#36873;&#25321;&#30340;&#26032;&#22411;&#20154;&#24037;&#26234;&#33021;&#26694;&#26550;&#12290;MarketSenseAI&#25972;&#21512;&#20102;&#8220;&#24605;&#32500;&#38142;&#8221;&#21644;&#8220;&#19978;&#19979;&#25991;&#23398;&#20064;&#8221;&#26041;&#27861;&#65292;&#20998;&#26512;&#21253;&#25324;&#24066;&#22330;&#20215;&#26684;&#21160;&#24577;&#12289;&#36130;&#32463;&#26032;&#38395;&#12289;&#20844;&#21496;&#22522;&#26412;&#38754;&#21644;&#23439;&#35266;&#32463;&#27982;&#25253;&#21578;&#31561;&#22810;&#31181;&#25968;&#25454;&#28304;&#65292;&#27169;&#20223;&#30693;&#21517;&#37329;&#34701;&#25237;&#36164;&#22242;&#38431;&#30340;&#20915;&#31574;&#36807;&#31243;&#12290;&#25991;&#31456;&#35814;&#32454;&#20171;&#32461;&#20102;MarketSenseAI&#30340;&#24320;&#21457;&#12289;&#23454;&#26045;&#21644;&#23454;&#35777;&#39564;&#35777;&#65292;&#37325;&#28857;&#20851;&#27880;&#20854;&#25552;&#20379;&#20855;&#26377;&#20805;&#20998;&#35299;&#37322;&#25903;&#25745;&#30340;&#21487;&#34892;&#25237;&#36164;&#20449;&#21495;&#65288;&#20080;&#20837;&#12289;&#25345;&#26377;&#12289;&#21334;&#20986;&#65289;&#30340;&#33021;&#21147;&#12290;&#26412;&#30740;&#31350;&#30340;&#19968;&#20010;&#26174;&#33879;&#29305;&#28857;&#26159;&#20351;&#29992;GPT-4&#19981;&#20165;&#20316;&#20026;&#39044;&#27979;&#24037;&#20855;&#65292;&#36824;&#20316;&#20026;&#35780;&#20272;&#22120;&#65292;&#25581;&#31034;&#20102;&#20154;&#24037;&#26234;&#33021;&#29983;&#25104;&#30340;&#35299;&#37322;&#23545;&#25152;&#24314;&#35758;&#30340;&#25237;&#36164;&#20449;&#21495;&#30340;&#21487;&#38752;&#24615;&#21644;&#25509;&#21463;&#24230;&#30340;&#37325;&#35201;&#24433;&#21709;&#12290;&#36890;&#36807;&#24191;&#27867;&#30340;&#23454;&#35777;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
In the dynamic and data-driven landscape of financial markets, this paper introduces MarketSenseAI, a novel AI-driven framework leveraging the advanced reasoning capabilities of GPT-4 for scalable stock selection. MarketSenseAI incorporates Chain of Thought and In-Context Learning methodologies to analyze a wide array of data sources, including market price dynamics, financial news, company fundamentals, and macroeconomic reports emulating the decision making process of prominent financial investment teams. The development, implementation, and empirical validation of MarketSenseAI are detailed, with a focus on its ability to provide actionable investment signals (buy, hold, sell) backed by cogent explanations. A notable aspect of this study is the use of GPT-4 not only as a predictive tool but also as an evaluator, revealing the significant impact of the AI-generated explanations on the reliability and acceptance of the suggested investment signals. In an extensive empirical evaluation
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#31934;&#31070;&#26234;&#21147;&#22312;&#20943;&#36731;&#25216;&#26415;&#21387;&#21147;&#26041;&#38754;&#30340;&#20316;&#29992;&#65292;&#37325;&#28857;&#30740;&#31350;&#20102;&#36947;&#24503;&#29615;&#22659;&#30340;&#20013;&#20171;&#20316;&#29992;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#36739;&#39640;&#27700;&#24179;&#30340;&#31934;&#31070;&#26234;&#21147;&#21487;&#20197;&#24110;&#21161;&#20010;&#20307;&#26356;&#22909;&#22320;&#34701;&#20837;&#25216;&#26415;&#24182;&#20943;&#36731;&#21387;&#21147;&#65292;&#32780;&#33391;&#22909;&#30340;&#36947;&#24503;&#27675;&#22260;&#21487;&#20197;&#25903;&#25345;&#21644;&#25918;&#22823;&#36825;&#20123;&#22909;&#22788;&#12290;</title><link>http://arxiv.org/abs/2401.03658</link><description>&lt;p&gt;
&#31934;&#31070;&#26234;&#21147;&#22312;&#36890;&#36807;&#36947;&#24503;&#24037;&#20316;&#27675;&#22260;&#20943;&#36731;&#25216;&#26415;&#21387;&#21147;&#20013;&#30340;&#20316;&#29992;
&lt;/p&gt;
&lt;p&gt;
Spiritual Intelligence's Role in Reducing Technostress through Ethical Work Climates. (arXiv:2401.03658v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.03658
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#31934;&#31070;&#26234;&#21147;&#22312;&#20943;&#36731;&#25216;&#26415;&#21387;&#21147;&#26041;&#38754;&#30340;&#20316;&#29992;&#65292;&#37325;&#28857;&#30740;&#31350;&#20102;&#36947;&#24503;&#29615;&#22659;&#30340;&#20013;&#20171;&#20316;&#29992;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#36739;&#39640;&#27700;&#24179;&#30340;&#31934;&#31070;&#26234;&#21147;&#21487;&#20197;&#24110;&#21161;&#20010;&#20307;&#26356;&#22909;&#22320;&#34701;&#20837;&#25216;&#26415;&#24182;&#20943;&#36731;&#21387;&#21147;&#65292;&#32780;&#33391;&#22909;&#30340;&#36947;&#24503;&#27675;&#22260;&#21487;&#20197;&#25903;&#25345;&#21644;&#25918;&#22823;&#36825;&#20123;&#22909;&#22788;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#31934;&#31070;&#26234;&#21147;&#65288;SI&#65289;&#23545;&#25216;&#26415;&#21387;&#21147;&#30340;&#24433;&#21709;&#65292;&#37325;&#28857;&#20851;&#27880;&#36947;&#24503;&#29615;&#22659;&#30340;&#20013;&#20171;&#20316;&#29992;&#12290;&#22312;&#25216;&#26415;&#19981;&#26029;&#37325;&#22609;&#25105;&#20204;&#30340;&#24037;&#20316;&#21644;&#20010;&#20154;&#29983;&#27963;&#30340;&#26102;&#20195;&#65292;&#29702;&#35299;&#20154;&#31867;&#26234;&#21147;&#12289;&#24184;&#31119;&#21644;&#32452;&#32455;&#20869;&#37096;&#36947;&#24503;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#21464;&#24471;&#36234;&#26469;&#36234;&#37325;&#35201;&#12290;&#31934;&#31070;&#26234;&#21147;&#36229;&#36234;&#20256;&#32479;&#30340;&#35748;&#30693;&#21644;&#24773;&#32490;&#26234;&#21147;&#65292;&#24378;&#35843;&#29702;&#35299;&#20010;&#20154;&#24847;&#20041;&#21644;&#20215;&#20540;&#35266;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#36739;&#39640;&#27700;&#24179;&#30340;&#31934;&#31070;&#26234;&#21147;&#22914;&#20309;&#20351;&#20010;&#20307;&#22312;&#19981;&#21463;&#36807;&#24230;&#21387;&#21147;&#30340;&#24773;&#20917;&#19979;&#23558;&#25216;&#26415;&#34701;&#20837;&#20182;&#20204;&#30340;&#29983;&#27963;&#65292;&#24182;&#19988;&#36739;&#20026;&#36947;&#24503;&#21270;&#30340;&#29615;&#22659;&#23545;&#20110;&#25903;&#25345;&#21644;&#25918;&#22823;&#36825;&#20123;&#22909;&#22788;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#32508;&#21512;&#25991;&#29486;&#22238;&#39038;&#12289;&#23454;&#35777;&#30740;&#31350;&#21644;&#35814;&#32454;&#20998;&#26512;&#65292;&#26412;&#30740;&#31350;&#24378;&#35843;&#20102;&#31934;&#31070;&#26234;&#21147;&#23545;&#20110;&#20943;&#36731;&#25216;&#26415;&#21387;&#21147;&#30340;&#20445;&#25252;&#20316;&#29992;&#20197;&#21450;&#36947;&#24503;&#27675;&#22260;&#23545;&#20110;&#22686;&#24378;&#36825;&#31181;&#25928;&#26524;&#30340;&#26174;&#33879;&#24433;&#21709;&#12290;&#30740;&#31350;&#32467;&#26524;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#27934;&#23519;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study explores the impact of spiritual intelligence (SI) on technostress, with a focus on the mediating role of the ethical environment. In an era where technological advancements continually reshape our work and personal lives, understanding the interplay between human intelligence, well-being, and ethics within organizations is increasingly significant. Spiritual intelligence, transcending traditional cognitive and emotional intelligences, emphasizes understanding personal meaning and values. This paper investigates how higher levels of SI enable individuals to integrate technology into their lives without undue stress, and how a robust ethical environment within organizations supports and amplifies these benefits. Through a comprehensive review of literature, empirical research, and detailed analysis, the study highlights the protective role of SI against technostress and the significant influence of an ethical climate in enhancing this effect. The findings offer valuable insig
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20351;&#29992;&#32467;&#26500;&#21270;&#22240;&#23376;&#32852;&#21512;&#20998;&#24067;&#27169;&#25311;&#20102;&#27431;&#27954;&#21644;&#32654;&#22269;&#38134;&#34892;&#30340;&#31995;&#32479;&#24615;&#39118;&#38505;&#65292;&#24182;&#21457;&#29616;&#22312;&#19981;&#21516;&#22320;&#21306;&#20869;&#37096;&#38134;&#34892;&#20043;&#38388;&#30340;&#30456;&#20114;&#20381;&#36182;&#20027;&#35201;&#36890;&#36807;&#31995;&#32479;&#24615;&#19982;&#29305;&#24322;&#24615;&#30340;&#37329;&#34701;&#20256;&#26579;&#28192;&#36947;&#26469;&#39537;&#21160;&#65292;&#22312;&#25972;&#20010;&#38134;&#34892;&#31995;&#32479;&#20013;&#65292;&#31995;&#32479;&#24615;&#20256;&#26579;&#28192;&#36947;&#21344;&#20027;&#23548;&#22320;&#20301;&#12290;&#27492;&#22806;&#65292;&#38134;&#34892;CDS&#24046;&#20215;&#30340;&#30456;&#20114;&#20381;&#36182;&#32467;&#26500;&#22312;&#23614;&#37096;&#20063;&#39640;&#24230;&#30456;&#20851;&#12290;&#36890;&#36807;&#26679;&#26412;&#22806;&#39044;&#27979;&#65292;&#21487;&#20197;&#35782;&#21035;&#20986;&#36817;&#24180;&#26469;&#38134;&#34892;&#19994;&#22256;&#22659;&#30340;&#26102;&#26399;&#65292;&#21253;&#25324;COVID-19&#22823;&#27969;&#34892;&#21644;2022&#24180;&#30340;&#21033;&#29575;&#19978;&#35843;&#31561;&#12290;</title><link>http://arxiv.org/abs/2401.03443</link><description>&lt;p&gt;
&#32467;&#26500;&#21270;&#22240;&#23376;&#32852;&#21512;&#20998;&#24067;&#29992;&#20110;&#24314;&#27169;&#27431;&#27954;&#21644;&#32654;&#22269;&#38134;&#34892;&#31995;&#32479;&#24615;&#39118;&#38505;
&lt;/p&gt;
&lt;p&gt;
Structured factor copulas for modeling the systemic risk of European and United States banks. (arXiv:2401.03443v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.03443
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#32467;&#26500;&#21270;&#22240;&#23376;&#32852;&#21512;&#20998;&#24067;&#27169;&#25311;&#20102;&#27431;&#27954;&#21644;&#32654;&#22269;&#38134;&#34892;&#30340;&#31995;&#32479;&#24615;&#39118;&#38505;&#65292;&#24182;&#21457;&#29616;&#22312;&#19981;&#21516;&#22320;&#21306;&#20869;&#37096;&#38134;&#34892;&#20043;&#38388;&#30340;&#30456;&#20114;&#20381;&#36182;&#20027;&#35201;&#36890;&#36807;&#31995;&#32479;&#24615;&#19982;&#29305;&#24322;&#24615;&#30340;&#37329;&#34701;&#20256;&#26579;&#28192;&#36947;&#26469;&#39537;&#21160;&#65292;&#22312;&#25972;&#20010;&#38134;&#34892;&#31995;&#32479;&#20013;&#65292;&#31995;&#32479;&#24615;&#20256;&#26579;&#28192;&#36947;&#21344;&#20027;&#23548;&#22320;&#20301;&#12290;&#27492;&#22806;&#65292;&#38134;&#34892;CDS&#24046;&#20215;&#30340;&#30456;&#20114;&#20381;&#36182;&#32467;&#26500;&#22312;&#23614;&#37096;&#20063;&#39640;&#24230;&#30456;&#20851;&#12290;&#36890;&#36807;&#26679;&#26412;&#22806;&#39044;&#27979;&#65292;&#21487;&#20197;&#35782;&#21035;&#20986;&#36817;&#24180;&#26469;&#38134;&#34892;&#19994;&#22256;&#22659;&#30340;&#26102;&#26399;&#65292;&#21253;&#25324;COVID-19&#22823;&#27969;&#34892;&#21644;2022&#24180;&#30340;&#21033;&#29575;&#19978;&#35843;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;&#20449;&#29992;&#36829;&#32422;&#20114;&#25442;(CDS)&#26469;&#27169;&#25311;&#27431;&#27954;&#21644;&#32654;&#22269;&#38134;&#34892;&#30340;&#32852;&#21512;&#21644;&#26465;&#20214;&#22256;&#22659;&#27010;&#29575;&#65292;&#24182;&#20351;&#29992;&#22240;&#23376;&#32852;&#21512;&#20998;&#24067;&#36827;&#34892;&#24314;&#27169;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#22810;&#22240;&#32032;&#65292;&#32467;&#26500;&#21270;&#22240;&#23376;&#21644;&#22240;&#23376;&#34276;&#34067;&#27169;&#22411;&#65292;&#20854;&#20013;&#26679;&#26412;&#20013;&#30340;&#38134;&#34892;&#25353;&#22320;&#29702;&#20301;&#32622;&#36827;&#34892;&#20102;&#32858;&#31867;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#27599;&#20010;&#22320;&#21306;&#20869;&#65292;&#38134;&#34892;&#20043;&#38388;&#30340;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#26368;&#22909;&#20351;&#29992;&#31995;&#32479;&#24615;&#21644;&#29305;&#24322;&#24615;&#30340;&#37329;&#34701;&#20256;&#26579;&#28192;&#36947;&#26469;&#25551;&#36848;&#12290;&#28982;&#32780;&#65292;&#22914;&#26524;&#23558;&#38134;&#34892;&#31995;&#32479;&#20316;&#20026;&#19968;&#20010;&#25972;&#20307;&#32771;&#34385;&#65292;&#37027;&#20040;&#31995;&#32479;&#24615;&#20256;&#26579;&#28192;&#36947;&#21344;&#20248;&#21183;&#65292;&#36825;&#24847;&#21619;&#30528;&#22256;&#22659;&#27010;&#29575;&#26159;&#30001;&#28508;&#22312;&#30340;&#20840;&#29699;&#22240;&#23376;&#21644;&#21306;&#22495;&#29305;&#23450;&#22240;&#23376;&#39537;&#21160;&#30340;&#12290;&#22312;&#25152;&#26377;&#24773;&#20917;&#19979;&#65292;&#38134;&#34892;CDS&#24046;&#20215;&#30340;&#30456;&#20114;&#20381;&#36182;&#32467;&#26500;&#22312;&#23614;&#37096;&#39640;&#24230;&#30456;&#20851;&#12290;&#23545;&#19968;&#20123;&#31995;&#32479;&#24615;&#39118;&#38505;&#25351;&#26631;&#30340;&#26679;&#26412;&#22806;&#39044;&#27979;&#20351;&#25105;&#20204;&#33021;&#22815;&#30830;&#23450;&#36817;&#24180;&#26469;&#38134;&#34892;&#19994;&#20013;&#20986;&#29616;&#22256;&#22659;&#30340;&#26102;&#26399;&#65292;&#21253;&#25324;COVID-19&#22823;&#27969;&#34892;&#65292;2022&#24180;&#30340;&#21033;&#29575;&#19978;&#35843;&#31561;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we employ Credit Default Swaps (CDS) to model the joint and conditional distress probabilities of banks in Europe and the U.S. using factor copulas. We propose multi-factor, structured factor, and factor-vine models where the banks in the sample are clustered according to their geographic location. We find that within each region, the co-dependence between banks is best described using both, systematic and idiosyncratic, financial contagion channels. However, if we consider the banking system as a whole, then the systematic contagion channel prevails, meaning that the distress probabilities are driven by a latent global factor and region-specific factors. In all cases, the co-dependence structure of bank CDS spreads is highly correlated in the tail. The out-of-sample forecasts of several measures of systematic risk allow us to identify the periods of distress in the banking sector over the recent years including the COVID-19 pandemic, the interest rate hikes in 2022, and
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#27604;&#36739;Markov&#36716;&#25442;GARCH&#21644;SV&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#27604;&#29305;&#24065;&#27599;&#26085;&#25910;&#30410;&#30340;&#26465;&#20214;&#26041;&#24046;&#24314;&#27169;&#21644;&#39044;&#27979;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;SARV&#27169;&#22411;&#22312;&#39044;&#27979;&#27604;&#29305;&#24065;&#20215;&#26684;&#30340;&#27874;&#21160;&#24615;&#26041;&#38754;&#20248;&#20110;MS-GARCH&#27169;&#22411;&#65292;&#24182;&#19988;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#65292;&#31616;&#21333;&#30340;GARCH&#27169;&#22411;&#29978;&#33267;&#20248;&#20110;Markov&#36716;&#25442;GARCH&#27169;&#22411;&#12290;&#36825;&#20026;&#39118;&#38505;&#31649;&#29702;&#19987;&#23478;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#25351;&#23548;&#12290;</title><link>http://arxiv.org/abs/2401.03393</link><description>&lt;p&gt;
&#23545;&#27604;Markov&#36716;&#25442;GARCH&#21644;SV&#27169;&#22411;&#23545;&#27604;&#30340;&#27604;&#29305;&#24065;&#27599;&#26085;&#25910;&#30410;&#26465;&#20214;&#26041;&#24046;&#30340;&#24314;&#27169;&#21644;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Modelling and Predicting the Conditional Variance of Bitcoin Daily Returns: Comparsion of Markov Switching GARCH and SV Models. (arXiv:2401.03393v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.03393
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#27604;&#36739;Markov&#36716;&#25442;GARCH&#21644;SV&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#27604;&#29305;&#24065;&#27599;&#26085;&#25910;&#30410;&#30340;&#26465;&#20214;&#26041;&#24046;&#24314;&#27169;&#21644;&#39044;&#27979;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;SARV&#27169;&#22411;&#22312;&#39044;&#27979;&#27604;&#29305;&#24065;&#20215;&#26684;&#30340;&#27874;&#21160;&#24615;&#26041;&#38754;&#20248;&#20110;MS-GARCH&#27169;&#22411;&#65292;&#24182;&#19988;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#65292;&#31616;&#21333;&#30340;GARCH&#27169;&#22411;&#29978;&#33267;&#20248;&#20110;Markov&#36716;&#25442;GARCH&#27169;&#22411;&#12290;&#36825;&#20026;&#39118;&#38505;&#31649;&#29702;&#19987;&#23478;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#25351;&#23548;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#29420;&#29305;&#32780;&#26377;&#20215;&#20540;&#30340;&#30740;&#31350;&#35774;&#35745;&#65292;&#26088;&#22312;&#20998;&#26512;&#27604;&#29305;&#24065;&#20215;&#26684;&#30340;&#27874;&#21160;&#24615;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#32771;&#34385;&#20102;&#19968;&#31995;&#21015;&#26469;&#33258;Markov&#36716;&#25442;-GARCH&#21644;&#38543;&#26426;&#33258;&#22238;&#24402;&#27874;&#21160;&#65288;SARV&#65289;&#27169;&#22411;&#31867;&#30340;&#27169;&#22411;&#65292;&#24182;&#23545;&#23427;&#20204;&#30340;&#26679;&#26412;&#22806;&#39044;&#27979;&#24615;&#33021;&#36827;&#34892;&#20102;&#24443;&#24213;&#30340;&#32771;&#23519;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;&#20851;&#20110;&#37319;&#29992;&#20004;&#38454;&#27573;&#20272;&#35745;&#26041;&#27861;&#30340;&#24314;&#35758;&#32972;&#21518;&#30340;&#29702;&#24565;&#65292;&#24182;&#24378;&#35843;&#20102;&#22312;&#22343;&#20540;&#26041;&#31243;&#21644;&#26041;&#24046;&#26041;&#31243;&#20013;&#20998;&#21035;&#20272;&#35745;&#31995;&#25968;&#30340;&#37325;&#35201;&#24615;&#12290;&#26412;&#25991;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#65292;&#29305;&#21035;&#26159;SARV&#27169;&#22411;&#65292;&#22312;&#39044;&#27979;&#27604;&#29305;&#24065;&#20215;&#26684;&#30340;&#27874;&#21160;&#24615;&#26041;&#38754;&#34920;&#29616;&#20248;&#20110;MS-GARCH&#27169;&#22411;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#34920;&#26126;&#65292;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#65292;&#25345;&#32493;&#30340;&#31616;&#21333;GARCH&#27169;&#22411;&#29978;&#33267;&#22312;&#39044;&#27979;&#27604;&#29305;&#24065;&#23545;&#25968;&#25910;&#30410;&#30340;&#26041;&#24046;&#26041;&#38754;&#34920;&#29616;&#20986;&#33394;&#20110;Markov&#36716;&#25442;GARCH&#27169;&#22411;&#12290;&#36825;&#20123;&#21457;&#29616;&#20026;&#39118;&#38505;&#31649;&#29702;&#19987;&#23478;&#25552;&#20379;&#20102;&#23453;&#36149;&#30340;&#25351;&#23548;&#65292;&#31361;&#20986;&#20102;SARV&#27169;&#22411;&#30340;&#28508;&#22312;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper introduces a unique and valuable research design aimed at analyzing Bitcoin price volatility. To achieve this, a range of models from the Markov Switching-GARCH and Stochastic Autoregressive Volatility (SARV) model classes are considered and their out-of-sample forecasting performance is thoroughly examined. The paper provides insights into the rationale behind the recommendation for a two-stage estimation approach, emphasizing the separate estimation of coefficients in the mean and variance equations. The results presented in this paper indicate that Stochastic Volatility models, particularly SARV models, outperform MS-GARCH models in forecasting Bitcoin price volatility. Moreover, the study suggests that in certain situations, persistent simple GARCH models may even outperform Markov-Switching GARCH models in predicting the variance of Bitcoin log returns. These findings offer valuable guidance for risk management experts, highlighting the potential advantages of SARV mode
&lt;/p&gt;</description></item><item><title>&#20351;&#29992;SPX&#26399;&#26435;&#25968;&#25454;&#23545;Volterra Bergomi&#27169;&#22411;&#36827;&#34892;&#20102;&#24191;&#27867;&#30340;&#23454;&#35777;&#30740;&#31350;&#65292;&#21457;&#29616;&#31895;&#31961;&#27874;&#21160;&#24615;&#27169;&#22411;&#19981;&#33021;&#24456;&#22909;&#22320;&#25429;&#25417;SPX&#38544;&#21547;&#27874;&#21160;&#29575;&#26354;&#38754;&#30340;&#25972;&#20307;&#24418;&#29366;&#65292;&#24182;&#19988;&#20854;&#20559;&#26012;&#21644;&#34928;&#20943;&#36895;&#24230;&#19982;&#23454;&#38469;&#24773;&#20917;&#19981;&#31526;&#12290;</title><link>http://arxiv.org/abs/2401.03345</link><description>&lt;p&gt;
&#23454;&#36341;&#20013;&#30340;&#27874;&#21160;&#24615;&#27169;&#22411;&#65306;&#31895;&#31961;&#12289;&#36335;&#24452;&#30456;&#20851;&#36824;&#26159;&#39532;&#23572;&#21487;&#22827;&#65311;
&lt;/p&gt;
&lt;p&gt;
Volatility models in practice: Rough, Path-dependent or Markovian?. (arXiv:2401.03345v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.03345
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;SPX&#26399;&#26435;&#25968;&#25454;&#23545;Volterra Bergomi&#27169;&#22411;&#36827;&#34892;&#20102;&#24191;&#27867;&#30340;&#23454;&#35777;&#30740;&#31350;&#65292;&#21457;&#29616;&#31895;&#31961;&#27874;&#21160;&#24615;&#27169;&#22411;&#19981;&#33021;&#24456;&#22909;&#22320;&#25429;&#25417;SPX&#38544;&#21547;&#27874;&#21160;&#29575;&#26354;&#38754;&#30340;&#25972;&#20307;&#24418;&#29366;&#65292;&#24182;&#19988;&#20854;&#20559;&#26012;&#21644;&#34928;&#20943;&#36895;&#24230;&#19982;&#23454;&#38469;&#24773;&#20917;&#19981;&#31526;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#39033;&#24191;&#27867;&#30340;&#23454;&#35777;&#30740;&#31350;&#20351;&#29992;2011&#24180;&#33267;2022&#24180;&#20043;&#38388;&#30340;SPX&#26399;&#26435;&#25968;&#25454;&#23545;Volterra Bergomi&#27169;&#22411;&#36827;&#34892;&#20102;&#30740;&#31350;&#65292;&#25581;&#31034;&#20986;&#20197;&#19979;&#20107;&#23454;&#26816;&#39564;&#32467;&#26524;&#65306;&#22312;&#31895;&#31961;&#27874;&#21160;&#24615;&#25991;&#29486;&#20013;&#22238;&#21709;&#30340;&#20004;&#20010;&#22522;&#26412;&#20027;&#24352;&#26159;&#21542;&#27491;&#30830;&#65292;&#21363;&#20855;&#26377;Hurst&#25351;&#25968;$H \in (0,1/2)$&#30340;&#31895;&#31961;&#27874;&#21160;&#24615;&#27169;&#22411;&#26159;&#21542;&#33021;&#22815;&#29992;&#24456;&#23569;&#30340;&#21442;&#25968;&#24456;&#22909;&#22320;&#25429;&#25417;SPX&#38544;&#21547;&#27874;&#21160;&#29575;&#26354;&#38754;&#65311;&#19981;&#26159;&#30340;&#65292;&#31895;&#31961;&#27874;&#21160;&#24615;&#27169;&#22411;&#19982;SPX&#31505;&#26354;&#38754;&#30340;&#25972;&#20307;&#24418;&#29366;&#19981;&#19968;&#33268;&#12290;&#23427;&#20204;&#21463;&#21040;&#31895;&#31961;&#24615;&#25104;&#20998;&#25152;&#26045;&#21152;&#30340;&#20005;&#37325;&#32467;&#26500;&#38480;&#21046;&#65292;&#32780;Hurst&#21442;&#25968;$H \in (0,1/2)$&#20197;&#19981;&#33391;&#30340;&#26041;&#24335;&#25511;&#21046;&#31505;&#26354;&#12290;&#29305;&#21035;&#26159;&#65292;&#22312;-&#26631;&#30340;&#20215;&#26684;&#26102;&#30340;&#20559;&#26012;&#19982;&#31895;&#31961;&#27874;&#21160;&#24615;&#27169;&#22411;&#20135;&#29983;&#30340;&#24130;&#24459;&#24418;&#29366;&#19981;&#30456;&#23481;&#12290;&#31895;&#31961;&#27874;&#21160;&#24615;&#27169;&#22411;&#30340;&#20559;&#26012;&#22312;&#30701;&#31471;&#19978;&#22686;&#38271;&#36807;&#24555;&#65292;&#22312;&#38271;&#31471;&#19978;&#34928;&#20943;&#36807;&#24930;&#65292;&#26377;&#26102;&#38656;&#35201;&#20351;&#29992;"&#36127;"&#30340;Hurst&#25351;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
An extensive empirical study of the class of Volterra Bergomi models using SPX options data between 2011 and 2022 reveals the following fact-check on two fundamental claims echoed in the rough volatility literature:  Do rough volatility models with Hurst index $H \in (0,1/2)$ really capture well SPX implied volatility surface with very few parameters? No, rough volatility models are inconsistent with the global shape of SPX smiles. They suffer from severe structural limitations imposed by the roughness component, with the Hurst parameter $H \in (0,1/2)$ controlling the smile in a poor way. In particular, the SPX at-the-money skew is incompatible with the power-law shape generated by rough volatility models. The skew of rough volatility models increases too fast on the short end, and decays too slow on the longer end where "negative" $H$ is sometimes needed.  Do rough volatility models really outperform consistently their classical Markovian counterparts? No, for short maturities they u
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;&#21453;&#21333;&#35843;&#20998;&#37197;&#26469;&#26368;&#20248;&#21270;&#20849;&#20139;&#39118;&#38505;&#30340;&#38382;&#39064;&#12290;&#24403;&#25152;&#26377;&#20195;&#29702;&#37117;&#39118;&#38505;&#36861;&#27714;&#26102;&#65292;&#24085;&#32047;&#25176;&#26368;&#20248;&#20998;&#37197;&#24517;&#39035;&#26159;&#22823;&#22870;&#20998;&#37197;&#65307;&#24403;&#25152;&#26377;&#20195;&#29702;&#30340;&#25928;&#29992;&#20989;&#25968;&#19981;&#36830;&#32493;&#26102;&#65292;&#26367;&#32618;&#32650;&#20998;&#37197;&#20351;&#24471;&#36229;&#36807;&#19981;&#36830;&#32493;&#38408;&#20540;&#30340;&#27010;&#29575;&#26368;&#22823;&#21270;&#12290;</title><link>http://arxiv.org/abs/2401.03328</link><description>&lt;p&gt;
&#36127;&#30456;&#20851;&#30340;&#26368;&#20248;&#39118;&#38505;&#20849;&#25285;&#38382;&#39064;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Negatively dependent optimal risk sharing. (arXiv:2401.03328v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.03328
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;&#21453;&#21333;&#35843;&#20998;&#37197;&#26469;&#26368;&#20248;&#21270;&#20849;&#20139;&#39118;&#38505;&#30340;&#38382;&#39064;&#12290;&#24403;&#25152;&#26377;&#20195;&#29702;&#37117;&#39118;&#38505;&#36861;&#27714;&#26102;&#65292;&#24085;&#32047;&#25176;&#26368;&#20248;&#20998;&#37197;&#24517;&#39035;&#26159;&#22823;&#22870;&#20998;&#37197;&#65307;&#24403;&#25152;&#26377;&#20195;&#29702;&#30340;&#25928;&#29992;&#20989;&#25968;&#19981;&#36830;&#32493;&#26102;&#65292;&#26367;&#32618;&#32650;&#20998;&#37197;&#20351;&#24471;&#36229;&#36807;&#19981;&#36830;&#32493;&#38408;&#20540;&#30340;&#27010;&#29575;&#26368;&#22823;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;&#20351;&#29992;&#34920;&#29616;&#20986;&#21453;&#21333;&#35843;&#24615;&#30340;&#20998;&#37197;&#26041;&#24335;&#26469;&#20248;&#21270;&#20849;&#20139;&#39118;&#38505;&#30340;&#38382;&#39064;&#12290;&#21453;&#21333;&#35843;&#20998;&#37197;&#30340;&#24418;&#24335;&#26377;&#8220;&#36194;&#32773;&#36890;&#21507;&#8221;&#25110;&#8220;&#36755;&#32773;&#20840;&#20891;&#35206;&#27809;&#8221;&#22411;&#24425;&#31080;&#65292;&#25105;&#20204;&#20998;&#21035;&#23558;&#20854;&#24402;&#20026;&#26631;&#20934;&#21270;&#30340;&#8220;&#22823;&#22870;&#8221;&#25110;&#8220;&#26367;&#32618;&#32650;&#8221;&#20998;&#37197;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#23450;&#29702;&#8212;&#8212;&#21453;&#21333;&#35843;&#25913;&#36827;&#23450;&#29702;&#65292;&#35828;&#26126;&#23545;&#20110;&#19968;&#32452;&#38543;&#26426;&#21464;&#37327;&#65292;&#26080;&#35770;&#23427;&#20204;&#26159;&#20840;&#37096;&#19979;&#30028;&#26377;&#30028;&#36824;&#26159;&#20840;&#37096;&#19978;&#30028;&#26377;&#30028;&#65292;&#24635;&#26159;&#21487;&#20197;&#25214;&#21040;&#19968;&#32452;&#21453;&#21333;&#35843;&#38543;&#26426;&#21464;&#37327;&#65292;&#20854;&#20013;&#27599;&#20010;&#20998;&#37327;&#37117;&#22823;&#20110;&#25110;&#31561;&#20110;&#20984;&#24207;&#20013;&#23545;&#24212;&#30340;&#20998;&#37327;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22914;&#26524;&#24085;&#32047;&#25176;&#26368;&#20248;&#20998;&#37197;&#23384;&#22312;&#19988;&#25152;&#26377;&#20195;&#29702;&#37117;&#36861;&#27714;&#39118;&#38505;&#65292;&#37027;&#20040;&#23427;&#20204;&#24517;&#39035;&#26159;&#22823;&#22870;&#20998;&#37197;&#12290;&#32780;&#24403;&#25152;&#26377;&#20195;&#29702;&#30340;&#19981;&#36830;&#32493;&#20271;&#21162;&#21033;&#25928;&#29992;&#20989;&#25968;&#26102;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#30456;&#21453;&#30340;&#32467;&#35770;&#65292;&#26367;&#32618;&#32650;&#20998;&#37197;&#20351;&#24471;&#36229;&#36807;&#19981;&#36830;&#32493;&#38408;&#20540;&#30340;&#27010;&#29575;&#26368;&#22823;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
We analyze the problem of optimally sharing risk using allocations that exhibit counter-monotonicity, the most extreme form of negative dependence. Counter-monotonic allocations take the form of either "winner-takes-all" lotteries or "loser-loses-all" lotteries, and we respectively refer to these (normalized) cases as jackpot or scapegoat allocations. Our main theorem, the counter-monotonic improvement theorem, states that for a given set of random variables that are either all bounded from below or all bounded from above, one can always find a set of counter-monotonic random variables such that each component is greater or equal than its counterpart in the convex order. We show that Pareto optimal allocations, if they exist, must be jackpot allocations when all agents are risk seeking. We essentially obtain the opposite when all agents have discontinuous Bernoulli utility functions, as scapegoat allocations maximize the probability of being above the discontinuity threshold. We also c
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;Almgren-Chriss&#27169;&#22411;&#19979;&#65292;&#35299;&#20915;&#32463;&#32426;&#21830;&#20174;&#20803;&#35746;&#21333;&#25191;&#34892;&#35282;&#24230;&#30340;&#26368;&#20248;&#25191;&#34892;&#38382;&#39064;&#12290;&#25105;&#20204;&#36890;&#36807;&#26368;&#22823;&#21270;&#32463;&#32426;&#21830;&#22312;&#25191;&#34892;&#26399;&#38388;&#30340;&#36229;&#39069;&#30408;&#20111;&#25928;&#29992;&#26469;&#33719;&#24471;&#26368;&#20248;&#31574;&#30053;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#20998;&#26512;&#20102;&#21463;&#39044;&#30041;&#31574;&#30053;&#32422;&#26463;&#19979;&#20132;&#26131;&#36712;&#36857;&#30340;&#24615;&#36136;&#12290;</title><link>http://arxiv.org/abs/2401.03305</link><description>&lt;p&gt;
&#38024;&#23545;&#25191;&#34892;&#39118;&#38505;&#19979;&#39044;&#30041;&#31574;&#30053;&#30340;&#26368;&#20248;&#35746;&#21333;&#25191;&#34892;&#38382;&#39064;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Optimal Order Execution subject to Reservation Strategies under Execution Risk. (arXiv:2401.03305v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.03305
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;Almgren-Chriss&#27169;&#22411;&#19979;&#65292;&#35299;&#20915;&#32463;&#32426;&#21830;&#20174;&#20803;&#35746;&#21333;&#25191;&#34892;&#35282;&#24230;&#30340;&#26368;&#20248;&#25191;&#34892;&#38382;&#39064;&#12290;&#25105;&#20204;&#36890;&#36807;&#26368;&#22823;&#21270;&#32463;&#32426;&#21830;&#22312;&#25191;&#34892;&#26399;&#38388;&#30340;&#36229;&#39069;&#30408;&#20111;&#25928;&#29992;&#26469;&#33719;&#24471;&#26368;&#20248;&#31574;&#30053;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#20998;&#26512;&#20102;&#21463;&#39044;&#30041;&#31574;&#30053;&#32422;&#26463;&#19979;&#20132;&#26131;&#36712;&#36857;&#30340;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;Almgren-Chriss&#27169;&#22411;&#19979;&#65292;&#20174;&#32463;&#32426;&#21830;&#30340;&#35282;&#24230;&#35299;&#20915;&#20803;&#35746;&#21333;&#25191;&#34892;&#38382;&#39064;&#12290;&#32463;&#32426;&#21830;&#20195;&#34920;&#23458;&#25143;&#25191;&#34892;&#20132;&#26131;&#35746;&#21333;&#65292;&#24182;&#26681;&#25454;&#23458;&#25143;&#35268;&#23450;&#30340;&#22522;&#20934;&#31574;&#30053;&#26469;&#37096;&#32626;&#31574;&#30053;&#12290;&#25105;&#20204;&#23558;&#32463;&#32426;&#21830;&#30340;&#38382;&#39064;&#24418;&#24335;&#21270;&#20026;&#19968;&#20010;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#65292;&#32463;&#32426;&#21830;&#35797;&#22270;&#22312;&#25191;&#34892;&#26102;&#38388;&#27573;&#20869;&#26368;&#22823;&#21270;&#20854;&#36229;&#39069;&#30408;&#20111;&#30340;&#25928;&#29992;&#12290;&#26368;&#20248;&#31574;&#30053;&#20197;&#21453;&#39304;&#24418;&#24335;&#24471;&#21040;&#38381;&#24335;&#35299;&#12290;&#22312;&#27809;&#26377;&#25191;&#34892;&#39118;&#38505;&#30340;&#24773;&#20917;&#19979;&#65292;&#21463;&#39044;&#30041;&#31574;&#30053;&#32422;&#26463;&#30340;&#26368;&#20248;&#31574;&#30053;&#26159;&#30830;&#23450;&#24615;&#30340;&#12290;&#25105;&#20204;&#20351;&#29992;&#23454;&#26045;&#19981;&#36275;&#21644;&#30446;&#26631;&#24066;&#22330;&#35746;&#21333;&#20316;&#20026;&#22522;&#30784;&#65292;&#24314;&#31435;&#20102;&#26368;&#20248;&#31574;&#30053;&#21463;&#19968;&#33324;&#39044;&#30041;&#31574;&#30053;&#32422;&#26463;&#19979;&#20132;&#26131;&#36712;&#36857;&#30340;&#20223;&#23556;&#32467;&#26500;&#12290;&#26368;&#21518;&#65292;&#36890;&#36807;&#25968;&#20540;&#23454;&#39564;&#35828;&#26126;&#20102;&#20132;&#26131;&#36712;&#36857;&#30340;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;
The paper addresses the problem of meta order execution from a broker-dealer's point of view in Almgren-Chriss model under order fill uncertainty. A broker-dealer agency is authorized to execute an order of trading on client's behalf. The strategies that the agent is allowed to deploy is subject to a benchmark, referred to as the reservation strategy, regulated by the client. We formulate the broker's problem as a utility maximization problem in which the broker seeks to maximize his utility of excess profit-and-loss at the execution horizon. Optimal strategy in feedback form is obtained in closed form. In the absence of execution risk, the optimal strategies subject to reservation strategies are deterministic. We establish an affine structure among the trading trajectories under optimal strategies subject to general reservation strategies using implementation shortfall and target close orders as basis. We conclude the paper with numerical experiments illustrating the trading trajector
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#23454;&#39564;&#24615;&#22320;&#30740;&#31350;&#20102;COVID-19&#30123;&#24773;&#21644;&#20420;&#20044;&#25112;&#20105;&#23545;&#27431;&#27954;&#21644;&#20122;&#27954;&#21457;&#23637;&#20013;&#22269;&#23478;&#30340;&#22806;&#21830;&#30452;&#25509;&#25237;&#36164;(IFDI)&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#20840;&#29699;&#21033;&#29575;&#20914;&#20987;&#20102;13&#20010;&#36873;&#23450;&#22269;&#23478;&#30340;IFDI&#12290;</title><link>http://arxiv.org/abs/2401.03096</link><description>&lt;p&gt;
COVID-19&#30123;&#24773;&#21644;&#20420;&#20044;&#25112;&#20105;&#23545;&#22806;&#21830;&#30452;&#25509;&#25237;&#36164;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The Effects of COVID-19 and the Russia-Ukraine War on Inward Foreign Direct Investment. (arXiv:2401.03096v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.03096
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23454;&#39564;&#24615;&#22320;&#30740;&#31350;&#20102;COVID-19&#30123;&#24773;&#21644;&#20420;&#20044;&#25112;&#20105;&#23545;&#27431;&#27954;&#21644;&#20122;&#27954;&#21457;&#23637;&#20013;&#22269;&#23478;&#30340;&#22806;&#21830;&#30452;&#25509;&#25237;&#36164;(IFDI)&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#20840;&#29699;&#21033;&#29575;&#20914;&#20987;&#20102;13&#20010;&#36873;&#23450;&#22269;&#23478;&#30340;IFDI&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23454;&#39564;&#24615;&#22320;&#30740;&#31350;&#20102;&#27431;&#27954;&#21644;&#20122;&#27954;&#21457;&#23637;&#20013;&#22269;&#23478;&#65288;&#22914;&#23391;&#21152;&#25289;&#22269;&#65289;&#30340;&#22806;&#21830;&#30452;&#25509;&#25237;&#36164;(IFDI)&#12290;&#26032;&#20852;&#24066;&#22330;&#30340;IFDI&#24471;&#21040;&#20102;&#20840;&#29699;&#25237;&#36164;&#21644;&#27969;&#20837;&#30340;&#25512;&#21160;&#65292;&#21463;&#21040;&#36164;&#28304;&#21487;&#29992;&#24615;&#21644;&#20844;&#20849;&#25919;&#31574;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#25506;&#35752;&#20102;&#22312;&#20420;&#20044;&#25112;&#20105;&#21361;&#26426;&#23545;&#20840;&#29699;&#20135;&#29983;&#24433;&#21709;&#30340;&#21516;&#26102;&#65292;13&#20010;&#22269;&#23478;&#30340;&#32463;&#27982;&#25919;&#31574;&#19981;&#30830;&#23450;&#24615;&#23545;IFDI&#30340;&#24433;&#21709;&#12290;&#24494;&#35266;&#32463;&#27982;&#22240;&#32032;&#24433;&#21709;&#20102;&#22269;&#20869;&#29983;&#20135;&#24635;&#20540;&#65288;GDP&#65289;&#22686;&#38271;&#12289;&#36890;&#32960;&#12289;&#21033;&#29575;&#21644;&#36135;&#24065;&#27719;&#29575;&#30340;&#27874;&#21160;&#65292;&#20854;&#20013;&#22312;COVID-19&#30123;&#24773;&#21644;&#20420;&#20044;&#25112;&#20105;&#26399;&#38388;&#24433;&#21709;&#26368;&#22823;&#12290;&#36890;&#36807;&#19990;&#30028;&#38134;&#34892;&#21644;&#32852;&#21512;&#22269;&#36152;&#26131;&#21644;&#21457;&#23637;&#20250;&#35758;&#65288;UNCTAD&#65289;&#25968;&#25454;&#24211;&#30340;&#25968;&#25454;&#65292;&#25105;&#20204;&#32534;&#21046;&#20102;&#19968;&#20010;&#28085;&#30422;2018-2022&#24180;&#30340;&#38754;&#26495;&#25968;&#25454;&#38598;&#12290;&#30740;&#31350;&#20154;&#21592;&#20351;&#29992;&#20102;&#28151;&#21512;&#38754;&#26495;&#21644;&#32447;&#24615;&#22238;&#24402;&#20998;&#26512;&#65292;&#37319;&#29992;&#38543;&#26426;&#25928;&#24212;&#27169;&#22411;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#20840;&#29699;&#21033;&#29575;&#20914;&#20987;&#20102;13&#20010;&#36873;&#23450;&#22269;&#23478;&#30340;IFDI&#12290;&#22312;IFDI&#21644;&#20840;&#29699;&#32463;&#27982;&#21033;&#29575;&#20043;&#38388;&#23384;&#22312;&#30456;&#20851;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Inward Foreign Direct Investment (IFDI) into Europe and Asian developing countries like Bangladesh is experimentally examined in this study. IFDI in emerging markets has been boosted by global investment and inflow influenced by resource availability and public policy. The economic policy uncertainty on IFDI in 13 countries is explored at a time when the crisis between Russia and Ukraine war is having a global impact. Microeconomic factors affected Gross Domestic Product (GDP) growth, inflation, interest rates, and the currency rate fluctuated with IFDI, which mostly shocked during COVID-19 and the Russia-Ukraine war. With data from the World Bank and the United Nations Conference on Trade and Development (UNCTAD) database, we compile a panel dataset covering 2018-2022. The researchers used a mixture of panel and linear regression analysis using a random effect model. Our findings show that the impact of global rates hurts IFDI in 13 selected countries. There is a correlation between a
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35752;&#35770;&#20102;&#25805;&#20316;&#23618;&#32423;&#22312;&#20891;&#20107;&#24605;&#32500;&#20013;&#30340;&#36129;&#29486;&#65292;&#28982;&#21518;&#23558;&#20854;&#24212;&#29992;&#20110;&#31454;&#20105;&#25110;&#32463;&#27982;&#25112;&#20105;&#20013;&#30340;&#34892;&#21160;&#12290;&#25805;&#20316;&#23618;&#32423;&#26159;&#19968;&#20010;&#26032;&#30340;&#35270;&#35282;&#65292;&#21487;&#20197;&#20135;&#29983;&#22522;&#20110;&#25935;&#25463;&#31995;&#32479;&#30340;&#29420;&#29305;&#24605;&#32771;&#21644;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>http://arxiv.org/abs/2401.02963</link><description>&lt;p&gt;
&#29992;&#20110;&#32771;&#34385;&#24773;&#25253;&#21644;&#32463;&#27982;&#25112;&#30053;&#30340;&#25805;&#20316;&#23618;&#32423;&#30340;&#23454;&#29992;&#24615;
&lt;/p&gt;
&lt;p&gt;
L'utilit\'e de l'\'echelle op\'eratique pour consid\'erer des strat\'egies d'intelligence et de guerre \'economique. (arXiv:2401.02963v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.02963
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#25805;&#20316;&#23618;&#32423;&#22312;&#20891;&#20107;&#24605;&#32500;&#20013;&#30340;&#36129;&#29486;&#65292;&#28982;&#21518;&#23558;&#20854;&#24212;&#29992;&#20110;&#31454;&#20105;&#25110;&#32463;&#27982;&#25112;&#20105;&#20013;&#30340;&#34892;&#21160;&#12290;&#25805;&#20316;&#23618;&#32423;&#26159;&#19968;&#20010;&#26032;&#30340;&#35270;&#35282;&#65292;&#21487;&#20197;&#20135;&#29983;&#22522;&#20110;&#25935;&#25463;&#31995;&#32479;&#30340;&#29420;&#29305;&#24605;&#32771;&#21644;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
20&#19990;&#32426;&#20986;&#29616;&#20102;&#19968;&#20010;&#20301;&#20110;&#25112;&#26415;&#21644;&#25112;&#30053;&#23618;&#32423;&#20043;&#38388;&#30340;&#20013;&#38388;&#23618;&#32423;&#65306;&#25805;&#20316;&#23618;&#32423;&#12290;&#36825;&#20010;&#23618;&#32423;&#26159;&#22312;&#22823;&#33539;&#22260;&#20316;&#25112;&#20013;&#30340;&#23618;&#32423;&#65292;&#21363;&#21327;&#35843;&#23646;&#20110;&#19981;&#21516;&#20891;&#31181;&#30340;&#37096;&#38431;&#22312;&#30456;&#24403;&#22823;&#30340;&#22320;&#29702;&#36317;&#31163;&#19978;&#32852;&#21512;&#20316;&#25112;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20808;&#20174;&#25805;&#20316;&#23618;&#32423;&#23545;&#20891;&#20107;&#24605;&#32500;&#30340;&#36129;&#29486;&#20986;&#21457;&#65292;&#28982;&#21518;&#23558;&#20854;&#36229;&#36234;&#39046;&#22495;&#36827;&#34892;&#36716;&#25442;&#12290;&#25105;&#20204;&#23558;&#25805;&#20316;&#23618;&#32423;&#35270;&#20026;&#19968;&#31181;&#20135;&#29983;&#29420;&#29305;&#24605;&#32771;&#21644;&#22522;&#20110;&#25935;&#25463;&#31995;&#32479;&#35299;&#20915;&#26041;&#26696;&#30340;&#26032;&#35270;&#35282;&#65292;&#20294;&#21487;&#33021;&#24050;&#32463;&#36798;&#21040;&#20102;&#23427;&#20204;&#30340;&#26497;&#38480;&#12290;&#25105;&#20204;&#22312;&#36825;&#37324;&#38480;&#21046;&#35752;&#35770;&#25805;&#20316;&#23618;&#32423;&#35270;&#35282;&#23545;&#20102;&#35299;&#25110;&#23454;&#26045;&#19982;&#31454;&#20105;&#25110;&#32463;&#27982;&#25112;&#20105;&#30456;&#20851;&#30340;&#19968;&#31995;&#21015;&#34892;&#21160;&#30340;&#28508;&#22312;&#36129;&#29486;&#30340;&#38382;&#39064;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#23558;&#39318;&#20808;&#22238;&#31572;&#19968;&#20123;&#20851;&#20110;&#20160;&#20040;&#26159;&#25805;&#20316;&#23618;&#32423;&#30340;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
The 20th century saw the emergence of an intermediate level of consideration, situated between the tactical and strategic levels: the operational level. This level of scale is that of a large area of operations, that is to say coordinated engagements bringing together forces belonging to different corps over a considerable geographical distance. In this article, we approach operatics and its implementation, called operative art or operational art, first from its contributions to military thinking, then we transpose what can be transposed beyond this domain. We consider operative art as a new point of view generating a particular thought and solutions based on agile systems, but which may have reached their limits. We will limit ourselves here to the question of the potential contributions of the operatic perspective to understand or implement a set of actions related to competitive or economic warfare. To do this, we will begin by providing some answers to the question of what operatic
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#37325;&#26032;&#35752;&#35770;&#20102;&#22522;&#20110;Shannon&#23567;&#27874;&#30340;SWIFT&#26041;&#27861;&#65292;&#38024;&#23545;&#20855;&#26377;&#24050;&#30693;&#29305;&#24449;&#20989;&#25968;&#30340;&#27431;&#24335;&#26399;&#26435;&#30340;&#23450;&#20215;&#12290;&#25991;&#31456;&#35752;&#35770;&#20102;&#19968;&#20123;&#21487;&#33021;&#30340;&#25913;&#36827;&#21644;&#26041;&#27861;&#30340;&#19968;&#20123;&#32570;&#28857;&#12290;</title><link>http://arxiv.org/abs/2401.01758</link><description>&lt;p&gt;
&#20851;&#20110;&#22522;&#20110;Shannon&#23567;&#27874;&#30340;SWIFT&#26041;&#27861;&#30340;&#26399;&#26435;&#23450;&#20215;&#30340;&#30740;&#31350;--&#20877;&#35752;&#35770;
&lt;/p&gt;
&lt;p&gt;
Notes on the SWIFT method based on Shannon Wavelets for Option Pricing -- Revisited. (arXiv:2401.01758v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.01758
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#35752;&#35770;&#20102;&#22522;&#20110;Shannon&#23567;&#27874;&#30340;SWIFT&#26041;&#27861;&#65292;&#38024;&#23545;&#20855;&#26377;&#24050;&#30693;&#29305;&#24449;&#20989;&#25968;&#30340;&#27431;&#24335;&#26399;&#26435;&#30340;&#23450;&#20215;&#12290;&#25991;&#31456;&#35752;&#35770;&#20102;&#19968;&#20123;&#21487;&#33021;&#30340;&#25913;&#36827;&#21644;&#26041;&#27861;&#30340;&#19968;&#20123;&#32570;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#35752;&#35770;&#20102;&#22522;&#20110;Shannon&#23567;&#27874;&#30340;SWIFT&#26041;&#27861;&#22312;2023&#24180;&#29992;&#20110;&#23450;&#20215;&#20855;&#26377;&#24050;&#30693;&#29305;&#24449;&#20989;&#25968;&#30340;&#27431;&#24335;&#26399;&#26435;&#30340;&#24773;&#20917;&#12290;&#29305;&#21035;&#35752;&#35770;&#20102;&#19968;&#20123;&#21487;&#33021;&#30340;&#25913;&#36827;&#20197;&#21450;&#25581;&#31034;&#20102;&#35813;&#26041;&#27861;&#30340;&#19968;&#20123;&#23454;&#38469;&#32570;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;
This note revisits the SWIFT method based on Shannon wavelets to price European options under models with a known characteristic function in 2023. In particular, it discusses some possible improvements and exposes some concrete drawbacks of the method.
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25506;&#32034;&#20102;Refinitiv&#22312;&#23558;10&#20010;&#31867;&#21035;&#30340;&#20998;&#25968;&#27719;&#24635;&#20026;&#24635;&#20307;&#20998;&#25968;&#30340;&#36807;&#31243;&#20013;&#25152;&#37319;&#29992;&#30340;ESG&#35780;&#20998;&#26041;&#27861;&#35770;&#30340;&#21487;&#38752;&#24615;&#21644;&#21487;&#20449;&#24230;&#12290;</title><link>http://arxiv.org/abs/2312.00202</link><description>&lt;p&gt;
&#25506;&#35752;ESG&#35780;&#20998;&#26041;&#27861;&#35770;
&lt;/p&gt;
&lt;p&gt;
Investigate The ESG Score Methodology. (arXiv:2312.00202v2 [q-fin.PM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2312.00202
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25506;&#32034;&#20102;Refinitiv&#22312;&#23558;10&#20010;&#31867;&#21035;&#30340;&#20998;&#25968;&#27719;&#24635;&#20026;&#24635;&#20307;&#20998;&#25968;&#30340;&#36807;&#31243;&#20013;&#25152;&#37319;&#29992;&#30340;ESG&#35780;&#20998;&#26041;&#27861;&#35770;&#30340;&#21487;&#38752;&#24615;&#21644;&#21487;&#20449;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;Refinitiv&#22312;&#23558;10&#20010;&#31867;&#21035;&#30340;&#20998;&#25968;&#27719;&#24635;&#20026;&#24635;&#20307;&#20998;&#25968;&#30340;&#36807;&#31243;&#20013;&#26159;&#21542;&#25552;&#20379;&#20102;&#21487;&#38752;&#21644;&#20540;&#24471;&#20449;&#36182;&#30340;&#26041;&#27861;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
Whether the Refinitiv provide a reliable and trusted methodology in the process of aggregating 10 category scores to overall score?
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;&#36229;&#36807;60,000&#23478;&#20225;&#19994;&#30340;&#25968;&#25454;&#38598;&#65292;&#21457;&#29616;COVID-19&#22823;&#27969;&#34892;&#23548;&#33268;&#20102;&#20013;&#23567;&#22411;&#20225;&#19994;&#30340;&#29983;&#23384;&#22256;&#22659;&#65292;&#20294;&#20351;&#29992;&#22312;&#32447;&#24191;&#21578;&#25216;&#26415;&#26377;&#21161;&#20110;&#20943;&#36731;&#36825;&#31181;&#36127;&#38754;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2307.09035</link><description>&lt;p&gt;
COVID-19&#38656;&#27714;&#20914;&#20987;&#20877;&#25506;&#65306;&#24191;&#21578;&#25216;&#26415;&#26159;&#21542;&#24110;&#21161;&#20943;&#36731;&#20013;&#23567;&#22411;&#20225;&#19994;&#30340;&#36127;&#38754;&#24433;&#21709;?
&lt;/p&gt;
&lt;p&gt;
COVID-19 Demand Shocks Revisited: Did Advertising Technology Help Mitigate Adverse Consequences for Small and Midsize Businesses?. (arXiv:2307.09035v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.09035
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;&#36229;&#36807;60,000&#23478;&#20225;&#19994;&#30340;&#25968;&#25454;&#38598;&#65292;&#21457;&#29616;COVID-19&#22823;&#27969;&#34892;&#23548;&#33268;&#20102;&#20013;&#23567;&#22411;&#20225;&#19994;&#30340;&#29983;&#23384;&#22256;&#22659;&#65292;&#20294;&#20351;&#29992;&#22312;&#32447;&#24191;&#21578;&#25216;&#26415;&#26377;&#21161;&#20110;&#20943;&#36731;&#36825;&#31181;&#36127;&#38754;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#25506;&#35752;&#20102;COVID-19&#22823;&#27969;&#34892;&#23545;&#20225;&#19994;&#32489;&#25928;&#21644;&#29983;&#23384;&#30340;&#24433;&#21709;&#65292;&#34920;&#26126;&#20013;&#23567;&#22411;&#20225;&#19994;&#65288;SMBs&#65289;&#21463;&#21040;&#30340;&#36127;&#38754;&#24433;&#21709;&#23588;&#20026;&#20005;&#37325;&#12290;&#28982;&#32780;&#65292;&#30446;&#21069;&#23545;&#22312;&#32447;&#24191;&#21578;&#25216;&#26415;&#26159;&#21542;&#20197;&#21450;&#22914;&#20309;&#24110;&#21161;&#22609;&#36896;&#36825;&#20123;&#32467;&#26524;&#30340;&#30740;&#31350;&#36824;&#24456;&#26377;&#38480;&#65292;&#23588;&#20854;&#26159;&#23545;SMBs&#32780;&#35328;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#22635;&#34917;&#36825;&#19968;&#31354;&#30333;&#12290;&#36890;&#36807;&#26500;&#24314;&#21644;&#20998;&#26512;&#19968;&#20010;&#21253;&#21547;49&#20010;&#22269;&#23478;&#36229;&#36807;60,000&#23478;&#20225;&#19994;&#30340;&#26032;&#25968;&#25454;&#38598;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#25919;&#24220;&#23553;&#38145;&#25514;&#26045;&#23545;&#20225;&#19994;&#29983;&#23384;&#30340;&#24433;&#21709;&#12290;&#20351;&#29992;&#31163;&#25955;&#26102;&#38388;&#29983;&#23384;&#27169;&#22411;&#36827;&#34892;&#24037;&#20855;&#21464;&#37327;&#30340;&#24046;&#20998;&#36807;&#31243;&#20272;&#35745;&#65292;&#25105;&#20204;&#21457;&#29616;&#25919;&#24220;&#23553;&#38145;&#25514;&#26045;&#22686;&#21152;&#20102;&#20840;&#29699;&#33539;&#22260;&#20869;SMB&#20851;&#38381;&#30340;&#21487;&#33021;&#24615;&#65292;&#20294;&#22312;&#32447;&#24191;&#21578;&#25216;&#26415;&#30340;&#20351;&#29992;&#20943;&#36731;&#20102;&#36825;&#31181;&#36127;&#38754;&#24433;&#21709;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#20102;&#22269;&#23478;&#12289;&#34892;&#19994;&#21644;&#20225;&#19994;&#35268;&#27169;&#30340;&#24322;&#36136;&#24615;&#65292;&#19982;&#29702;&#35770;&#39044;&#26399;&#19968;&#33268;&#12290;
&lt;/p&gt;
&lt;p&gt;
Research has investigated the impact of the COVID-19 pandemic on business performance and survival, indicating particularly adverse effects for small and midsize businesses (SMBs). Yet only limited work has examined whether and how online advertising technology may have helped shape these outcomes, particularly for SMBs. The aim of this study is to address this gap. By constructing and analyzing a novel data set of more than 60,000 businesses in 49 countries, we examine the impact of government lockdowns on business survival. Using discrete-time survival models with instrumental variables and staggered difference-in-differences estimators, we find that government lockdowns increased the likelihood of SMB closure around the world but that use of online advertising technology attenuates this adverse effect. The findings show heterogeneity in country, industry, and business size, consistent with theoretical expectations.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#33258;&#19978;&#32780;&#19979;&#21644;&#33258;&#19979;&#32780;&#19978;&#32452;&#32455;&#32467;&#26500;&#22312;&#22686;&#24378;&#32452;&#32455;&#24377;&#24615;&#26041;&#38754;&#30340;&#20316;&#29992;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#33258;&#19979;&#32780;&#19978;&#35774;&#35745;&#30340;&#32452;&#32455;&#26356;&#33021;&#21560;&#25910;&#29615;&#22659;&#24178;&#25200;&#65292;&#32780;&#33258;&#19978;&#32780;&#19979;&#25110;&#33258;&#19979;&#32780;&#19978;&#35774;&#35745;&#30340;&#32452;&#32455;&#22312;&#20174;&#20914;&#20987;&#20013;&#24674;&#22797;&#26102;&#20063;&#26377;&#21508;&#33258;&#30340;&#20248;&#21183;&#12290;</title><link>http://arxiv.org/abs/2305.07352</link><description>&lt;p&gt;
&#24314;&#35774;&#20855;&#26377;&#24377;&#24615;&#30340;&#32452;&#32455;&#65306;&#33258;&#19978;&#32780;&#19979;&#21644;&#33258;&#19979;&#32780;&#19978;&#32452;&#32455;&#30340;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Building resilient organizations: The roles of top-down vs. bottom-up organizing. (arXiv:2305.07352v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.07352
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#33258;&#19978;&#32780;&#19979;&#21644;&#33258;&#19979;&#32780;&#19978;&#32452;&#32455;&#32467;&#26500;&#22312;&#22686;&#24378;&#32452;&#32455;&#24377;&#24615;&#26041;&#38754;&#30340;&#20316;&#29992;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#33258;&#19979;&#32780;&#19978;&#35774;&#35745;&#30340;&#32452;&#32455;&#26356;&#33021;&#21560;&#25910;&#29615;&#22659;&#24178;&#25200;&#65292;&#32780;&#33258;&#19978;&#32780;&#19979;&#25110;&#33258;&#19979;&#32780;&#19978;&#35774;&#35745;&#30340;&#32452;&#32455;&#22312;&#20174;&#20914;&#20987;&#20013;&#24674;&#22797;&#26102;&#20063;&#26377;&#21508;&#33258;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32452;&#32455;&#38754;&#20020;&#35768;&#22810;&#24847;&#24819;&#19981;&#21040;&#30340;&#25361;&#25112;&#65292;&#20363;&#22914;&#33021;&#28304;&#20215;&#26684;&#19978;&#28072;&#65292;&#22823;&#27969;&#34892;&#24178;&#25200;&#65292;&#24656;&#24598;&#34989;&#20987;&#21644;&#33258;&#28982;&#28798;&#23475;&#12290;&#22312;&#24212;&#23545;&#27492;&#31867;&#24178;&#25200;&#26041;&#38754;&#65292;&#23545;&#20419;&#36827;&#32452;&#32455;&#25104;&#21151;&#30340;&#22240;&#32032;&#30340;&#20998;&#26512;&#24448;&#24448;&#19981;&#28165;&#26970;&#12290;&#26412;&#25991;&#20998;&#26512;&#20102;&#33258;&#19978;&#32780;&#19979;&#21644;&#33258;&#19979;&#32780;&#19978;&#32452;&#32455;&#32467;&#26500;&#22312;&#20419;&#36827;&#32452;&#32455;&#24377;&#24615;&#26041;&#38754;&#30340;&#20316;&#29992;&#12290;&#20026;&#27492;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#22522;&#20110;&#20195;&#29702;&#30340;&#27169;&#22411;&#26469;&#27169;&#25311;&#39118;&#26684;&#21270;&#30340;&#32452;&#32455;&#65292;&#20854;&#20013;&#21253;&#25324;&#23398;&#20064;&#12289;&#36866;&#24212;&#12289;&#19981;&#21516;&#30340;&#32452;&#32455;&#27169;&#24335;&#21644;&#29615;&#22659;&#24178;&#25200;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#33258;&#19979;&#32780;&#19978;&#35774;&#35745;&#30340;&#32452;&#32455;&#24448;&#24448;&#20855;&#26377;&#26356;&#39640;&#30340;&#21560;&#25910;&#29615;&#22659;&#24178;&#25200;&#30340;&#33021;&#21147;&#65292;&#24182;&#19988;&#21487;&#20197;&#30830;&#23450;&#19968;&#20123;&#24773;&#20917;&#65292;&#20854;&#20013;&#33258;&#19978;&#32780;&#19979;&#25110;&#33258;&#19979;&#32780;&#19978;&#35774;&#35745;&#30340;&#32452;&#32455;&#22312;&#20174;&#20914;&#20987;&#20013;&#24674;&#22797;&#26102;&#20855;&#26377;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
Organizations face numerous challenges posed by unexpected events such as energy price hikes, pandemic disruptions, terrorist attacks, and natural disasters, and the factors that contribute to organizational success in dealing with such disruptions often remain unclear. This paper analyzes the roles of top-down and bottom-up organizational structures in promoting organizational resilience. To do so, an agent-based model of stylized organizations is introduced that features learning, adaptation, different modes of organizing, and environmental disruptions. The results indicate that bottom-up designed organizations tend to have a higher ability to absorb the effects of environmental disruptions, and situations are identified in which either top-down or bottom-up designed organizations have an advantage in recovering from shocks.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#32463;&#27982;&#23398;&#26399;&#21002;&#30340;&#32534;&#36753;&#22996;&#21592;&#20250;&#25104;&#21592;&#30340;&#22269;&#23478;&#20998;&#24067;&#12289;&#25152;&#23646;&#26426;&#26500;&#21644;&#24615;&#21035;&#65292;&#21457;&#29616;&#32463;&#27982;&#23398;&#39046;&#22495;&#30340;&#23398;&#26415;&#20986;&#29256;&#29615;&#22659;&#20173;&#28982;&#32570;&#20047;&#22810;&#26679;&#24615;&#21644;&#21253;&#23481;&#24615;&#12290;</title><link>http://arxiv.org/abs/2304.04242</link><description>&lt;p&gt;
&#32463;&#27982;&#23398;&#30340;&#38376;&#25143;&#26159;&#35841;&#65311;&#22320;&#29702;&#22810;&#26679;&#24615;&#12289;&#24615;&#21035;&#27604;&#20363;&#21644;&#26434;&#24535;&#32534;&#36753;&#22996;&#21592;&#20250;&#30340;&#20132;&#21449;&#25351;&#25381;&#12290;
&lt;/p&gt;
&lt;p&gt;
Who are the gatekeepers of economics? Geographic diversity, gender composition, and interlocking editorship of journal boards. (arXiv:2304.04242v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.04242
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#32463;&#27982;&#23398;&#26399;&#21002;&#30340;&#32534;&#36753;&#22996;&#21592;&#20250;&#25104;&#21592;&#30340;&#22269;&#23478;&#20998;&#24067;&#12289;&#25152;&#23646;&#26426;&#26500;&#21644;&#24615;&#21035;&#65292;&#21457;&#29616;&#32463;&#27982;&#23398;&#39046;&#22495;&#30340;&#23398;&#26415;&#20986;&#29256;&#29615;&#22659;&#20173;&#28982;&#32570;&#20047;&#22810;&#26679;&#24615;&#21644;&#21253;&#23481;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32534;&#36753;&#22996;&#21592;&#20250;&#25104;&#21592;&#22312;&#31185;&#23398;&#38376;&#25143;&#30340;&#35282;&#33394;&#38750;&#24120;&#37325;&#35201;&#65292;&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#32463;&#27982;&#23398;&#26399;&#21002;&#30340;&#32534;&#36753;&#22996;&#21592;&#20250;&#25104;&#21592;&#30340;&#22269;&#23478;&#20998;&#24067;&#12289;&#25152;&#23646;&#26426;&#26500;&#21644;&#24615;&#21035;&#12290;&#21516;&#26102;&#65292;&#23427;&#36824;&#30740;&#31350;&#20102;&#30001;&#21516;&#19968;&#20154;&#22312;&#22810;&#20010;&#26399;&#21002;&#32534;&#36753;&#22996;&#21592;&#20250;&#20219;&#32844;&#25152;&#20135;&#29983;&#30340;&#20132;&#21449;&#25351;&#25381;&#32593;&#32476;&#12290;&#20998;&#26512;&#22522;&#20110;&#19968;&#20010;&#29420;&#29305;&#30340;&#25968;&#25454;&#24211;&#65292;&#21253;&#21547;&#20102;2019&#24180;&#22312;EconLit&#25968;&#25454;&#24211;&#20013;&#20855;&#26377;&#27963;&#36291;&#32534;&#36753;&#22996;&#21592;&#20250;&#30340;&#25152;&#26377;1,516&#20010;&#26399;&#21002;&#12290;&#23545;&#20110;&#27599;&#20010;&#26399;&#21002;&#65292;&#25105;&#20204;&#25163;&#21160;&#25910;&#38598;&#20102;&#22996;&#21592;&#20250;&#25104;&#21592;&#30340;&#22995;&#21517;&#21644;&#25152;&#23646;&#26426;&#26500;&#65292;&#24471;&#21040;&#20102;&#19968;&#20010;&#21253;&#21547;&#26469;&#33258;142&#20010;&#22269;&#23478;&#30340;6,000&#22810;&#20010;&#26426;&#26500;&#30340;44,000&#22810;&#20010;&#25104;&#21592;&#30340;&#25968;&#25454;&#24211;&#12290;&#36825;&#20123;&#25968;&#25454;&#20351;&#24471;&#25105;&#20204;&#33021;&#22815;&#22312;&#21069;&#25152;&#26410;&#26377;&#30340;&#22823;&#35268;&#27169;&#19978;&#30740;&#31350;&#24403;&#20195;&#32463;&#27982;&#23398;&#30340;&#38376;&#25143;&#29616;&#35937;&#12290;&#32467;&#26524;&#31361;&#20986;&#20102;&#26377;&#20851;&#32534;&#36753;&#38376;&#25143;&#30340;&#19968;&#20123;&#20849;&#21516;&#38382;&#39064;&#65292;&#24471;&#20986;&#30340;&#32467;&#35770;&#26159;&#22312;&#32463;&#27982;&#23398;&#39046;&#22495;&#65292;&#23398;&#26415;&#20986;&#29256;&#29615;&#22659;&#20173;&#28982;&#36828;&#26410;&#36798;&#21040;&#36275;&#22815;&#22810;&#26679;&#21270;&#21644;&#21253;&#23481;&#24615;&#30340;&#27700;&#24179;&#12290;
&lt;/p&gt;
&lt;p&gt;
Members of editorial boards play the role of gatekeepers of science because. This paper analyses the national distribution of editorial boards members of economics journal, their affiliation, and their gender. It studies also the interlocking editorship network generated by the presence of a same person on the editorial board of more than one journal. The analysis is based on a unique database comprising all the 1,516 journals indexed in the database EconLit with an active editorial board in 2019. For each journal, we manually collected the names of the board members along with their affiliation, obtaining a database containing more than 44,000 members from more than 6,000 institutions and 142 countries. These data allow to investigate the phenomenon of gatekeeping in contemporary economics on an unprecedented large scale. The obtained results highlight some common issues concerning the editorial gatekeeping, leading to the conclusion that in Economics the academic publishing environme
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22810;&#39033;&#24335;&#25237;&#31080;&#35268;&#21017;&#31867;&#21035;&#65292;&#35813;&#35268;&#21017;&#36890;&#36807;&#21306;&#20998;&#36873;&#27665;&#30340;&#25237;&#31080;&#26435;&#21644;&#36873;&#27665;&#22312;&#31995;&#32479;&#20013;&#30340;&#20221;&#39069;&#65292;&#38450;&#27490;&#20102;&#20219;&#20309;&#36873;&#27665;&#25805;&#25511;&#25237;&#31080;&#36807;&#31243;&#65292;&#22686;&#24378;&#20102;&#31995;&#32479;&#30340;&#23433;&#20840;&#24615;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#36873;&#27665;&#20221;&#39069;&#24418;&#25104;&#25910;&#25947;&#20110;&#29380;&#21033;&#20811;&#38647;&#20998;&#24067;&#30340;&#36807;&#31243;&#65292;&#32780;&#36873;&#27665;&#30340;&#25237;&#31080;&#26435;&#21017;&#38543;&#26102;&#38388;&#34928;&#20943;&#21040;&#38646;&#12290;&#22312;&#21021;&#22987;&#24635;&#25237;&#31080;&#37327;&#36739;&#22823;&#26102;&#65292;&#23384;&#22312;&#20998;&#20139;&#31283;&#23450;&#24615;&#30340;&#30456;&#21464;&#29616;&#35937;&#12290;</title><link>http://arxiv.org/abs/2206.10105</link><description>&lt;p&gt;
&#22810;&#39033;&#24335;&#25237;&#31080;&#35268;&#21017;
&lt;/p&gt;
&lt;p&gt;
Polynomial Voting Rules. (arXiv:2206.10105v4 [math.PR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.10105
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22810;&#39033;&#24335;&#25237;&#31080;&#35268;&#21017;&#31867;&#21035;&#65292;&#35813;&#35268;&#21017;&#36890;&#36807;&#21306;&#20998;&#36873;&#27665;&#30340;&#25237;&#31080;&#26435;&#21644;&#36873;&#27665;&#22312;&#31995;&#32479;&#20013;&#30340;&#20221;&#39069;&#65292;&#38450;&#27490;&#20102;&#20219;&#20309;&#36873;&#27665;&#25805;&#25511;&#25237;&#31080;&#36807;&#31243;&#65292;&#22686;&#24378;&#20102;&#31995;&#32479;&#30340;&#23433;&#20840;&#24615;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#36873;&#27665;&#20221;&#39069;&#24418;&#25104;&#25910;&#25947;&#20110;&#29380;&#21033;&#20811;&#38647;&#20998;&#24067;&#30340;&#36807;&#31243;&#65292;&#32780;&#36873;&#27665;&#30340;&#25237;&#31080;&#26435;&#21017;&#38543;&#26102;&#38388;&#34928;&#20943;&#21040;&#38646;&#12290;&#22312;&#21021;&#22987;&#24635;&#25237;&#31080;&#37327;&#36739;&#22823;&#26102;&#65292;&#23384;&#22312;&#20998;&#20139;&#31283;&#23450;&#24615;&#30340;&#30456;&#21464;&#29616;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#24182;&#30740;&#31350;&#20102;&#19968;&#31181;&#26032;&#30340;&#22810;&#39033;&#24335;&#25237;&#31080;&#35268;&#21017;&#31867;&#21035;&#65292;&#29992;&#20110;&#19968;&#33324;&#30340;&#21435;&#20013;&#24515;&#21270;&#20915;&#31574;/&#20849;&#35782;&#31995;&#32479;&#65292;&#26356;&#20855;&#20307;&#22320;&#35828;&#65292;&#29992;&#20110;PoS&#65288;&#26435;&#30410;&#35777;&#26126;&#65289;&#21327;&#35758;&#12290;&#20027;&#35201;&#24605;&#24819;&#21463;&#21040;&#20102;&#24429;&#32599;&#26031;&#24179;&#26041;&#26681;&#23450;&#24459;&#21644;&#26368;&#36817;&#30340;&#20108;&#27425;&#25237;&#31080;&#35268;&#21017;&#30340;&#21551;&#21457;&#65292;&#21363;&#21306;&#20998;&#36873;&#27665;&#30340;&#25237;&#31080;&#26435;&#21644;&#36873;&#27665;&#22312;&#31995;&#32479;&#20013;&#30340;&#20221;&#39069;&#65288;&#21344;&#24635;&#20221;&#39069;&#30340;&#27604;&#20363;&#65289;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#34429;&#28982;&#36873;&#27665;&#20221;&#39069;&#24418;&#25104;&#20102;&#25910;&#25947;&#20110;&#29380;&#21033;&#20811;&#38647;&#20998;&#24067;&#30340;&#38789;&#36807;&#31243;&#65292;&#20294;&#20182;&#20204;&#30340;&#25237;&#31080;&#26435;&#21364;&#26159;&#19968;&#20010;&#38543;&#26102;&#38388;&#34928;&#20943;&#21040;&#38646;&#30340;&#36229;&#38789;&#36807;&#31243;&#12290;&#36825;&#38450;&#27490;&#20102;&#20219;&#20309;&#36873;&#27665;&#25805;&#25511;&#25237;&#31080;&#36807;&#31243;&#65292;&#20174;&#32780;&#22686;&#24378;&#20102;&#23433;&#20840;&#24615;&#12290;&#23545;&#20110;&#36825;&#20004;&#20010;&#26497;&#38480;&#32467;&#26524;&#65292;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#26126;&#30830;&#30340;&#25910;&#25947;&#36895;&#24230;&#12290;&#24403;&#21021;&#22987;&#30340;&#24635;&#25237;&#31080;&#37327;&#65288;&#25110;&#26435;&#30410;&#65289;&#24456;&#22823;&#26102;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#20998;&#20139;&#31283;&#23450;&#24615;&#65288;&#25110;&#32570;&#20047;&#31283;&#23450;&#24615;&#65289;&#30340;&#30456;&#21464;&#29616;&#35937;&#65292;&#21363;&#30456;&#23545;&#20110;&#24635;&#20221;&#39069;&#30340;&#36873;&#27665;&#21021;&#22987;&#20221;&#39069;&#30340;&#21464;&#21270;&#12290;&#25105;&#20204;&#36824;&#30740;&#31350;&#20102;&#36873;&#27665;&#20043;&#38388;&#20132;&#26131;&#65288;&#25237;&#31080;/&#26435;&#30410;&#30340;&#20132;&#26131;&#65289;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose and study a new class of polynomial voting rules for a general decentralized decision/consensus system, and more specifically for the PoS (Proof of Stake) protocol. The main idea, inspired by the Penrose square-root law and the more recent quadratic voting rule, is to differentiate a voter's voting power and the voter's share (fraction of the total in the system). We show that while voter shares form a martingale process that converge to a Dirichlet distribution, their voting powers follow a super-martingale process that decays to zero over time. This prevents any voter from controlling the voting process, and thus enhances security. For both limiting results, we also provide explicit rates of convergence. When the initial total volume of votes (or stakes) is large, we show a phase transition in share stability (or the lack thereof), corresponding to the voter's initial share relative to the total. We also study the scenario in which trading (of votes/stakes) among the voter
&lt;/p&gt;</description></item></channel></rss>