<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#29992;&#20110;&#24555;&#36895;&#22823;&#35268;&#27169;&#32452;&#21512;&#20248;&#21270;&#30340;&#32479;&#19968;&#26694;&#26550;&#65292;&#24182;&#20197;&#21327;&#26041;&#24046;&#30697;&#38453;&#20272;&#35745;&#22120;&#30340;&#26679;&#26412;&#22806;&#32452;&#21512;&#34920;&#29616;&#20026;&#20363;&#65292;&#23637;&#31034;&#20102;&#20854;&#20013;&#27491;&#21017;&#21270;&#35268;&#33539;&#39033;&#23545;&#27169;&#22411;&#34920;&#29616;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>http://arxiv.org/abs/2303.12751</link><description>&lt;p&gt;
&#24555;&#36895;&#22823;&#35268;&#27169;&#32452;&#21512;&#20248;&#21270;&#30340;&#32479;&#19968;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
A Unified Framework for Fast Large-Scale Portfolio Optimization. (arXiv:2303.12751v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.12751
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#29992;&#20110;&#24555;&#36895;&#22823;&#35268;&#27169;&#32452;&#21512;&#20248;&#21270;&#30340;&#32479;&#19968;&#26694;&#26550;&#65292;&#24182;&#20197;&#21327;&#26041;&#24046;&#30697;&#38453;&#20272;&#35745;&#22120;&#30340;&#26679;&#26412;&#22806;&#32452;&#21512;&#34920;&#29616;&#20026;&#20363;&#65292;&#23637;&#31034;&#20102;&#20854;&#20013;&#27491;&#21017;&#21270;&#35268;&#33539;&#39033;&#23545;&#27169;&#22411;&#34920;&#29616;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#20855;&#26377;&#32553;&#20943;&#21644;&#27491;&#21017;&#21270;&#30340;&#24555;&#36895;&#22823;&#35268;&#27169;&#32452;&#21512;&#20248;&#21270;&#65292;&#38024;&#23545;&#19981;&#21516;&#30340;&#30446;&#26631;&#65292;&#22914;&#26368;&#23567;&#26041;&#24046;&#12289;&#24179;&#22343;&#26041;&#24046;&#21644;&#26368;&#22823;&#22799;&#26222;&#27604;&#29575;&#65292;&#20197;&#21450;&#32452;&#21512;&#26435;&#37325;&#30340;&#21508;&#31181;&#32422;&#26463;&#26465;&#20214;&#12290;&#23545;&#20110;&#25152;&#26377;&#20248;&#21270;&#38382;&#39064;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#30456;&#24212;&#30340;&#20108;&#27425;&#35268;&#21010;&#38382;&#39064;&#65292;&#24182;&#22312;&#24320;&#28304;Python&#24211;&#20013;&#23454;&#29616;&#23427;&#20204;&#12290;&#25105;&#20204;&#20351;&#29992;&#25152;&#25552;&#20986;&#30340;&#26694;&#26550;&#35780;&#20272;&#20102;&#27969;&#34892;&#30340;&#21327;&#26041;&#24046;&#30697;&#38453;&#20272;&#35745;&#22120;&#30340;&#26679;&#26412;&#22806;&#32452;&#21512;&#34920;&#29616;&#65292;&#20363;&#22914;&#26679;&#26412;&#21327;&#26041;&#24046;&#30697;&#38453;&#12289;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#32553;&#20943;&#20272;&#35745;&#22120;&#20197;&#21450;&#20202;&#22120;&#21270;&#20027;&#25104;&#20998;&#20998;&#26512;&#65288;IPCA&#65289;&#30340;&#21327;&#26041;&#24046;&#30697;&#38453;&#12290;&#25105;&#20204;&#20351;&#29992;&#20102;65&#24180;&#38388;&#24179;&#22343;&#19978;&#24066;&#20844;&#21496;&#36798;585&#23478;&#30340;&#32654;&#22269;&#24066;&#22330;&#30340;&#26376;&#24230;&#25910;&#30410;&#29575;&#65292;&#20197;&#21450;&#29992;&#20110;IPCA&#27169;&#22411;&#30340;94&#20010;&#26376;&#24230;&#29305;&#23450;&#20844;&#21496;&#29305;&#24449;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#32452;&#21512;&#35268;&#33539;&#39033;&#30340;&#27491;&#21017;&#21270;&#26497;&#22823;&#22320;&#25913;&#21892;&#20102;IPCA&#27169;&#22411;&#22312;&#32452;&#21512;&#20248;&#21270;&#20013;&#30340;&#34920;&#29616;&#65292;&#32467;&#26524;&#34920;&#29616;&#33391;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a unified framework for fast large-scale portfolio optimization with shrinkage and regularization for different objectives such as minimum variance, mean-variance, and maximum Sharpe ratio with various constraints on the portfolio weights. For all of the optimization problems, we derive the corresponding quadratic programming problems and implement them in an open-source Python library. We use the proposed framework to evaluate the out-of-sample portfolio performance of popular covariance matrix estimators such as sample covariance matrix, linear and nonlinear shrinkage estimators, and the covariance matrix from the instrumented principal component analysis (IPCA). We use 65 years of monthly returns from (on average) 585 largest companies in the US market, and 94 monthly firm-specific characteristics for the IPCA model. We show that the regularization of the portfolio norms greatly benefits the performance of the IPCA model in portfolio optimization, resulting in outperforma
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#25552;&#20986;&#26032;&#30340;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;&#20043;&#21069;&#22312;&#26576;&#20123;&#24322;&#36136;&#24615;&#20195;&#29702;&#20154;&#19981;&#23436;&#20840;&#24066;&#22330;&#27169;&#22411;&#30340;&#23439;&#35266;&#32463;&#27982;&#22343;&#34913;&#35299;&#20915;&#26041;&#26696;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2303.12567</link><description>&lt;p&gt;
&#32463;&#27982;&#20027;&#20307;&#30340;&#21160;&#24577;&#36816;&#36755;
&lt;/p&gt;
&lt;p&gt;
Dynamic Transportation of Economic Agents. (arXiv:2303.12567v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.12567
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#25552;&#20986;&#26032;&#30340;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;&#20043;&#21069;&#22312;&#26576;&#20123;&#24322;&#36136;&#24615;&#20195;&#29702;&#20154;&#19981;&#23436;&#20840;&#24066;&#22330;&#27169;&#22411;&#30340;&#23439;&#35266;&#32463;&#27982;&#22343;&#34913;&#35299;&#20915;&#26041;&#26696;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26159;&#22312;&#21457;&#29616;&#20102;&#19968;&#20010;&#20849;&#21516;&#30340;&#31574;&#30053;&#26410;&#33021;&#23558;&#26576;&#20123;&#24322;&#36136;&#24615;&#20195;&#29702;&#20154;&#19981;&#23436;&#20840;&#24066;&#22330;&#27169;&#22411;&#30340;&#23439;&#35266;&#32463;&#27982;&#22343;&#34913;&#23450;&#20301;&#21040;&#24191;&#27867;&#24341;&#29992;&#30340;&#22522;&#20934;&#30740;&#31350;&#20013;&#32780;&#24341;&#21457;&#30340;&#12290;&#36890;&#36807;&#27169;&#20223;Dumas&#21644;Lyasoff&#65288;2012&#65289;&#25552;&#20986;&#30340;&#26041;&#27861;&#65292;&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#25551;&#36848;&#65292;&#22312;&#38754;&#23545;&#19981;&#21487;&#20445;&#38505;&#30340;&#24635;&#20307;&#21644;&#20010;&#20307;&#39118;&#38505;&#30340;&#22823;&#37327;&#20114;&#21160;&#32463;&#27982;&#20307;&#20195;&#34920;&#30340;&#31169;&#20154;&#29366;&#24577;&#20998;&#24067;&#30340;&#36816;&#21160;&#23450;&#24459;&#12290;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31639;&#27861;&#65292;&#29992;&#20110;&#30830;&#23450;&#22238;&#25253;&#12289;&#26368;&#20248;&#31169;&#20154;&#37197;&#32622;&#21644;&#24179;&#34913;&#29366;&#24577;&#19979;&#30340;&#20154;&#21475;&#36816;&#36755;&#65292;&#24182;&#22312;&#20004;&#20010;&#20247;&#25152;&#21608;&#30693;&#30340;&#22522;&#20934;&#30740;&#31350;&#20013;&#36827;&#34892;&#20102;&#27979;&#35797;&#12290;
&lt;/p&gt;
&lt;p&gt;
The paper was prompted by the surprising discovery that the common strategy, adopted in a large body of research, for producing macroeconomic equilibrium in certain heterogeneous-agent incomplete-market models fails to locate the equilibrium in a widely cited benchmark study. By mimicking the approach proposed by Dumas and Lyasoff (2012), the paper provides a novel description of the law of motion of the distribution over the range of private states of a large population of interacting economic agents faced with uninsurable aggregate and idiosyncratic risk. A new algorithm for identifying the returns, the optimal private allocations, and the population transport in the state of equilibrium is developed and is tested in two well known benchmark studies.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20379;&#20102;&#30005;&#21147;&#25481;&#26399;&#21512;&#32422;&#20132;&#21106;&#26399;&#24066;&#22330;&#39118;&#38505;&#20215;&#26684;&#65288;MPDP&#65289;&#30340;&#23454;&#35777;&#35777;&#25454;&#65292;&#22312;&#20960;&#20309;&#26694;&#26550;&#19979;&#36890;&#36807;&#20351;&#29992;&#20960;&#20309;&#24179;&#22343;&#25968;&#23450;&#20215;&#30005;&#21147;&#25481;&#26399;&#65292;&#21516;&#26102;&#32771;&#34385;&#20102;&#32463;&#20856;&#39118;&#38505;&#20215;&#26684;&#21644;MPDP&#12290;</title><link>http://arxiv.org/abs/2303.12527</link><description>&lt;p&gt;
&#22522;&#20110;&#20960;&#20309;&#24179;&#22343;&#30340;&#30005;&#21147;&#25481;&#26399;&#23450;&#20215;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Pricing of Electricity Swaps with Geometric Averaging. (arXiv:2303.12527v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.12527
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#30005;&#21147;&#25481;&#26399;&#21512;&#32422;&#20132;&#21106;&#26399;&#24066;&#22330;&#39118;&#38505;&#20215;&#26684;&#65288;MPDP&#65289;&#30340;&#23454;&#35777;&#35777;&#25454;&#65292;&#22312;&#20960;&#20309;&#26694;&#26550;&#19979;&#36890;&#36807;&#20351;&#29992;&#20960;&#20309;&#24179;&#22343;&#25968;&#23450;&#20215;&#30005;&#21147;&#25481;&#26399;&#65292;&#21516;&#26102;&#32771;&#34385;&#20102;&#32463;&#20856;&#39118;&#38505;&#20215;&#26684;&#21644;MPDP&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#30005;&#21147;&#25481;&#26399;&#21512;&#32422;&#20132;&#21106;&#26399;&#24066;&#22330;&#39118;&#38505;&#20215;&#26684;&#65288;MPDP&#65289;&#30340;&#23454;&#35777;&#35777;&#25454;&#12290;&#36890;&#36807;&#22312;&#20960;&#20309;&#26694;&#26550;&#19979;&#23450;&#20215;&#30005;&#21147;&#25481;&#26399;&#65292;MPDP&#26159;&#30001;Kemper&#31561;&#20154;&#20171;&#32461;&#30340;&#12290;&#20026;&#20102;&#36827;&#34892;&#23454;&#35777;&#30740;&#31350;&#65292;&#25105;&#20204;&#27839;&#30528;Kemper&#31561;&#20154;&#30340;&#26041;&#21521;&#20998;&#21035;&#35843;&#25972;&#27169;&#22411;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#32771;&#34385;&#24102;&#26377;&#36339;&#36291;&#39033;&#30340;Merton&#27169;&#22411;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#23558;&#27169;&#22411;&#36716;&#25442;&#20026;&#29289;&#29702;&#24230;&#37327;&#65292;&#23454;&#29616;&#22343;&#20540;&#22238;&#24402;&#34892;&#20026;&#12290;&#25105;&#20204;&#27604;&#36739;&#20102;&#30001;&#32463;&#20856;&#31639;&#26415;&#24179;&#22343;&#25968;&#20135;&#29983;&#30340;&#25481;&#26399;&#20215;&#26684;&#21644;&#30001;&#20960;&#20309;&#21152;&#26435;&#24179;&#22343;&#25968;&#20135;&#29983;&#30340;&#20215;&#26684;&#12290;&#22312;&#29289;&#29702;&#24230;&#37327;&#19979;&#65292;&#25105;&#20204;&#21457;&#29616;&#20102;&#25481;&#26399;&#30340;&#24066;&#22330;&#39118;&#38505;&#20215;&#26684;&#20013;&#32463;&#20856;&#39118;&#38505;&#20215;&#26684;&#21644;MPDP&#30340;&#20998;&#35299;&#12290;&#22312;&#23454;&#35777;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#20004;&#31181;&#31867;&#22411;&#30340;&#27169;&#22411;&#65292;&#29305;&#24449;&#26159;&#23395;&#33410;&#24615;&#21644;&#26399;&#38480;&#32467;&#26500;&#25928;&#24212;&#65292;&#24182;&#22312;&#20004;&#31181;&#24773;&#20917;&#19979;&#30830;&#23450;&#20102;&#20135;&#29983;&#30340;MPDP&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we provide empirical evidence on the market price of risk for delivery periods (MPDP) of electricity swap contracts. As introduced by Kemper et al. (2022), the MPDP arises through the use of geometric averaging while pricing electricity swaps in a geometric framework. In preparation for empirical investigations, we adjust the work by Kemper et al. (2022) in two directions: First, we examine a Merton type model taking jumps into account. Second, we transfer the model to the physical measure by implementing mean-reverting behavior. We compare swap prices resulting from the classical arithmetic (approximated) average to the geometric weighted average. Under the physical measure, we discover a decomposition of the swap's market price of risk into the classical one and the MPDP. In our empirical study, we analyze two types of models, characterized either by seasonality and or by term-structure effects, and identify the resulting MPDP in both cases.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36339;&#36291;&#25193;&#25955;&#20449;&#29992;&#39118;&#38505;&#27169;&#22411;&#65292;&#33021;&#22815;&#23450;&#20215;&#36716;&#22411;&#39118;&#38505;&#65292;&#21363;&#20225;&#19994;&#30001;&#20110;&#25191;&#34892;&#20005;&#26684;&#29615;&#20445;&#27861;&#35268;&#32780;&#38754;&#20020;&#30340;&#19994;&#21153;&#39118;&#38505;&#12290;&#22522;&#20110;CDS&#24066;&#22330;&#30340;&#23454;&#35777;&#30740;&#31350;&#34920;&#26126;&#35813;&#27169;&#22411;&#37096;&#20998;&#25429;&#25417;&#21040;&#20102;&#35813;&#31181;&#39118;&#38505;&#65292;&#32780;&#27809;&#26377;&#36339;&#36291;&#30340;&#27169;&#22411;&#21017;&#26080;&#27861;&#25429;&#25417;&#12290;</title><link>http://arxiv.org/abs/2303.12483</link><description>&lt;p&gt;
&#37319;&#29992;&#36339;&#36291;&#25193;&#25955;&#20449;&#29992;&#39118;&#38505;&#27169;&#22411;&#35780;&#20272;&#36716;&#22411;&#39118;&#38505;&#65306;&#22522;&#20110;CDS&#24066;&#22330;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Pricing Transition Risk with a Jump-Diffusion Credit Risk Model: Evidences from the CDS market. (arXiv:2303.12483v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.12483
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36339;&#36291;&#25193;&#25955;&#20449;&#29992;&#39118;&#38505;&#27169;&#22411;&#65292;&#33021;&#22815;&#23450;&#20215;&#36716;&#22411;&#39118;&#38505;&#65292;&#21363;&#20225;&#19994;&#30001;&#20110;&#25191;&#34892;&#20005;&#26684;&#29615;&#20445;&#27861;&#35268;&#32780;&#38754;&#20020;&#30340;&#19994;&#21153;&#39118;&#38505;&#12290;&#22522;&#20110;CDS&#24066;&#22330;&#30340;&#23454;&#35777;&#30740;&#31350;&#34920;&#26126;&#35813;&#27169;&#22411;&#37096;&#20998;&#25429;&#25417;&#21040;&#20102;&#35813;&#31181;&#39118;&#38505;&#65292;&#32780;&#27809;&#26377;&#36339;&#36291;&#30340;&#27169;&#22411;&#21017;&#26080;&#27861;&#25429;&#25417;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36716;&#22411;&#39118;&#38505;&#23450;&#20041;&#20026;&#19982;&#23454;&#26045;&#26088;&#22312;&#23558;&#31038;&#20250;&#24341;&#21521;&#21487;&#25345;&#32493;&#21644;&#20302;&#30899;&#32463;&#27982;&#30340;&#32511;&#33394;&#25919;&#31574;&#30456;&#20851;&#30340;&#19994;&#21153;&#39118;&#38505;&#12290;&#29305;&#21035;&#26159;&#65292;&#26576;&#20123;&#20844;&#21496;&#36164;&#20135;&#30340;&#20215;&#20540;&#21487;&#33021;&#20250;&#38477;&#20302;&#65292;&#22240;&#20026;&#23427;&#20204;&#38656;&#35201;&#36716;&#22411;&#20026;&#20302;&#30899;&#32463;&#27982;&#12290;&#26412;&#25991;&#23548;&#20986;&#20102;&#36829;&#32422;&#20184;&#24687;&#20538;&#21048;&#21644;&#20449;&#29992;&#36829;&#32422;&#25481;&#26399;&#30340;&#23450;&#20215;&#20844;&#24335;&#65292;&#20197;&#23454;&#35777;&#35777;&#26126;&#36339;&#36291;&#25193;&#25955;&#20449;&#29992;&#39118;&#38505;&#27169;&#22411;&#33021;&#22815;&#37096;&#20998;&#22320;&#25429;&#25417;&#21040;&#30001;&#20110;&#20005;&#26684;&#30340;&#29615;&#20445;&#27861;&#35268;&#23548;&#33268;&#20225;&#19994;&#20215;&#20540;&#19979;&#38477;&#30340;&#36716;&#22411;&#39118;&#38505;&#12290;&#23454;&#35777;&#30740;&#31350;&#21253;&#25324;&#22312;CDS&#26399;&#38480;&#32467;&#26500;&#19978;&#36827;&#34892;&#27169;&#22411;&#26657;&#20934;&#65292;&#25191;&#34892;&#20998;&#20301;&#25968;&#22238;&#24402;&#20197;&#35780;&#20272;&#38544;&#21547;&#20215;&#26684;&#19982;&#36716;&#22411;&#39118;&#38505;&#20195;&#29702;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#34920;&#26126;&#65292;&#27809;&#26377;&#36339;&#36291;&#30340;&#27169;&#22411;&#32570;&#20047;&#36825;&#31181;&#23646;&#24615;&#65292;&#20174;&#32780;&#30830;&#35748;&#20102;&#36716;&#22411;&#39118;&#38505;&#30340;&#36339;&#36291;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Transition risk can be defined as the business-risk related to the enactment of green policies, aimed at driving the society towards a sustainable and low-carbon economy. In particular, the value of certain firms' assets can be lower because they need to transition to a less carbon-intensive business model. In this paper we derive formulas for the pricing of defaultable coupon bonds and Credit Default Swaps to empirically demonstrate that a jump-diffusion credit risk model in which the downward jumps in the firm value are due to tighter green laws can capture, at least partially, the transition risk. The empirical investigation consists in the model calibration on the CDS term-structure, performing a quantile regression to assess the relationship between implied prices and a proxy of the transition risk. Additionally, we show that a model without jumps lacks this property, confirming the jump-like nature of the transition risk.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#23454;&#39564;&#30740;&#31350;&#20102;&#20154;&#24037;&#26234;&#33021;&#31639;&#27861;&#22312;&#21452;&#37325;&#21512;&#21516;&#38382;&#39064;&#20013;&#33021;&#22815;&#33258;&#20027;&#35774;&#35745;&#28608;&#21169;&#30456;&#23481;&#30340;&#21512;&#21516;&#65292;&#26080;&#38656;&#22806;&#37096;&#24341;&#23548;&#25110;&#36890;&#20449;&#65292;&#24182;&#19988;&#19981;&#21516;AI&#31639;&#27861;&#25903;&#25345;&#30340;&#22996;&#25176;&#20154;&#21487;&#20197;&#37319;&#29992;&#28151;&#21512;&#21644;&#38646;&#21644;&#21338;&#24328;&#34892;&#20026;&#65292;&#26356;&#20855;&#26234;&#33021;&#30340;&#22996;&#25176;&#20154;&#24448;&#24448;&#20250;&#21464;&#24471;&#21512;&#20316;&#12290;</title><link>http://arxiv.org/abs/2303.12350</link><description>&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#19982;&#21452;&#37325;&#21512;&#21516;
&lt;/p&gt;
&lt;p&gt;
Artificial Intelligence and Dual Contract. (arXiv:2303.12350v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.12350
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#23454;&#39564;&#30740;&#31350;&#20102;&#20154;&#24037;&#26234;&#33021;&#31639;&#27861;&#22312;&#21452;&#37325;&#21512;&#21516;&#38382;&#39064;&#20013;&#33021;&#22815;&#33258;&#20027;&#35774;&#35745;&#28608;&#21169;&#30456;&#23481;&#30340;&#21512;&#21516;&#65292;&#26080;&#38656;&#22806;&#37096;&#24341;&#23548;&#25110;&#36890;&#20449;&#65292;&#24182;&#19988;&#19981;&#21516;AI&#31639;&#27861;&#25903;&#25345;&#30340;&#22996;&#25176;&#20154;&#21487;&#20197;&#37319;&#29992;&#28151;&#21512;&#21644;&#38646;&#21644;&#21338;&#24328;&#34892;&#20026;&#65292;&#26356;&#20855;&#26234;&#33021;&#30340;&#22996;&#25176;&#20154;&#24448;&#24448;&#20250;&#21464;&#24471;&#21512;&#20316;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#20154;&#24037;&#26234;&#33021;&#31639;&#27861;&#30340;&#24555;&#36895;&#36827;&#27493;&#65292;&#20154;&#20204;&#24076;&#26395;&#31639;&#27861;&#24456;&#24555;&#23601;&#33021;&#22312;&#21508;&#20010;&#39046;&#22495;&#21462;&#20195;&#20154;&#31867;&#20915;&#31574;&#32773;&#65292;&#20363;&#22914;&#21512;&#21516;&#35774;&#35745;&#12290;&#25105;&#20204;&#36890;&#36807;&#23454;&#39564;&#30740;&#31350;&#20102;&#30001;&#20154;&#24037;&#26234;&#33021;&#65288;&#22810;&#26234;&#33021;&#20307;Q&#23398;&#20064;&#65289;&#39537;&#21160;&#30340;&#31639;&#27861;&#22312;&#21452;&#37325;&#22996;&#25176;-&#20195;&#29702;&#38382;&#39064;&#30340;&#32463;&#20856;&#8220;&#21452;&#37325;&#21512;&#21516;&#8221;&#27169;&#22411;&#20013;&#30340;&#34892;&#20026;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#36825;&#20123;AI&#31639;&#27861;&#21487;&#20197;&#33258;&#20027;&#23398;&#20064;&#35774;&#35745;&#21512;&#36866;&#30340;&#28608;&#21169;&#30456;&#23481;&#21512;&#21516;&#65292;&#32780;&#26080;&#38656;&#22806;&#37096;&#24341;&#23548;&#25110;&#32773;&#23427;&#20204;&#20043;&#38388;&#30340;&#36890;&#20449;&#12290;&#25105;&#20204;&#24378;&#35843;&#65292;&#30001;&#19981;&#21516;AI&#31639;&#27861;&#25903;&#25345;&#30340;&#22996;&#25176;&#20154;&#21487;&#20197;&#37319;&#29992;&#28151;&#21512;&#21644;&#38646;&#21644;&#21338;&#24328;&#34892;&#20026;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#26356;&#20855;&#26234;&#33021;&#30340;&#22996;&#25176;&#20154;&#24448;&#24448;&#20250;&#21464;&#24471;&#21512;&#20316;&#65292;&#32780;&#26234;&#33021;&#36739;&#20302;&#30340;&#22996;&#25176;&#20154;&#21017;&#20250;&#20986;&#29616;&#20869;&#29983;&#24615;&#36817;&#35270;&#24182;&#20542;&#21521;&#20110;&#31454;&#20105;&#12290;&#22312;&#26368;&#20248;&#21512;&#21516;&#19979;&#65292;&#20195;&#29702;&#30340;&#36739;&#20302;&#21512;&#21516;&#28608;&#21169;&#30001;&#22996;&#25176;&#20154;&#20043;&#38388;&#30340;&#21246;&#32467;&#31574;&#30053;&#32500;&#25345;&#12290;
&lt;/p&gt;
&lt;p&gt;
With the dramatic progress of artificial intelligence algorithms in recent times, it is hoped that algorithms will soon supplant human decision-makers in various fields, such as contract design. We analyze the possible consequences by experimentally studying the behavior of algorithms powered by Artificial Intelligence (Multi-agent Q-learning) in a workhorse \emph{dual contract} model for dual-principal-agent problems. We find that the AI algorithms autonomously learn to design incentive-compatible contracts without external guidance or communication among themselves. We emphasize that the principal, powered by distinct AI algorithms, can play mixed-sum behavior such as collusion and competition. We find that the more intelligent principals tend to become cooperative, and the less intelligent principals are endogenizing myopia and tend to become competitive. Under the optimal contract, the lower contract incentive to the agent is sustained by collusive strategies between the principals
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#23545;&#27491;&#24120;&#28201;&#21644;&#31283;&#23450;&#24066;&#22330;&#27169;&#22411;&#19979;&#25237;&#36164;&#32452;&#21512;CoVaR&#21644;CoCVaR&#30340;&#35299;&#26512;&#24418;&#24335;&#65292;&#23558;CoCVaR&#24212;&#29992;&#20110;&#30456;&#23545;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#65292;&#24182;&#25512;&#23548;&#20102;&#23545;CoVaR&#21644;CoCVaR&#30340;&#36793;&#38469;&#36129;&#29486;&#30340;&#35299;&#26512;&#24418;&#24335;&#65292;&#26368;&#32456;&#20351;&#29992;&#39118;&#38505;&#20998;&#37197;&#26041;&#27861;&#38477;&#20302;&#20102;&#25237;&#36164;&#32452;&#21512;&#30340;CoVaR&#21644;CoCVaR&#12290;</title><link>http://arxiv.org/abs/2303.12209</link><description>&lt;p&gt;
&#30456;&#23545;&#23614;&#37096;&#39118;&#38505;&#19979;&#30340;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
Portfolio Optimization with Relative Tail Risk. (arXiv:2303.12209v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.12209
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#23545;&#27491;&#24120;&#28201;&#21644;&#31283;&#23450;&#24066;&#22330;&#27169;&#22411;&#19979;&#25237;&#36164;&#32452;&#21512;CoVaR&#21644;CoCVaR&#30340;&#35299;&#26512;&#24418;&#24335;&#65292;&#23558;CoCVaR&#24212;&#29992;&#20110;&#30456;&#23545;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#65292;&#24182;&#25512;&#23548;&#20102;&#23545;CoVaR&#21644;CoCVaR&#30340;&#36793;&#38469;&#36129;&#29486;&#30340;&#35299;&#26512;&#24418;&#24335;&#65292;&#26368;&#32456;&#20351;&#29992;&#39118;&#38505;&#20998;&#37197;&#26041;&#27861;&#38477;&#20302;&#20102;&#25237;&#36164;&#32452;&#21512;&#30340;CoVaR&#21644;CoCVaR&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#23545;&#27491;&#24120;&#28201;&#21644;&#31283;&#23450;&#24066;&#22330;&#27169;&#22411;&#19979;&#30340;&#25237;&#36164;&#32452;&#21512;CoVaR&#21644;CoCVaR&#30340;&#35299;&#26512;&#24418;&#24335;&#12290;&#30001;&#20110;CoCVaR&#25429;&#25417;&#20102;&#25237;&#36164;&#32452;&#21512;&#30456;&#23545;&#20110;&#22522;&#20934;&#22238;&#25253;&#30340;&#30456;&#23545;&#39118;&#38505;&#65292;&#22240;&#27492;&#25105;&#20204;&#23558;&#20854;&#24212;&#29992;&#20110;&#30456;&#23545;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25512;&#23548;&#20986;&#20102;&#23545;CoVaR&#21644;CoCVaR&#30340;&#36793;&#38469;&#36129;&#29486;&#30340;&#35299;&#26512;&#24418;&#24335;&#65292;&#35752;&#35770;&#20102;&#29992;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#26041;&#27861;&#35745;&#31639;CoCVaR&#20197;&#21450;CoVaR&#21644;CoCVaR&#30340;&#36793;&#38469;&#36129;&#29486;&#30340;&#26041;&#27861;&#12290;&#20316;&#20026;&#23454;&#35777;&#30740;&#31350;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#36947;&#29756;&#26031;&#24037;&#19994;&#24179;&#22343;&#25351;&#25968;&#22256;&#22659;&#19979;&#30340;30&#21482;&#32929;&#31080;&#30340;&#30456;&#23545;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#26041;&#27861;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#20351;&#29992;&#36793;&#38469;&#36129;&#29486;&#21040;CoVaR&#21644;CoCVaR&#30340;&#26041;&#27861;&#23454;&#26045;&#39118;&#38505;&#20998;&#37197;&#26469;&#38477;&#20302;&#25237;&#36164;&#32452;&#21512;&#30340;CoVaR&#21644;CoCVaR&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes analytic forms of portfolio CoVaR and CoCVaR on the normal tempered stable market model. Since CoCVaR captures the relative risk of the portfolio with respect to a benchmark return, we apply it to the relative portfolio optimization. Moreover, we derive analytic forms for the marginal contribution to CoVaR and the marginal contribution to CoCVaR. We discuss the Monte-Carlo simulation method to calculate CoCVaR and the marginal contributions of CoVaR and CoCVaR. As the empirical illustration, we show relative portfolio optimization with thirty stocks under the distress condition of the Dow Jones Industrial Average. Finally, we perform the risk budgeting method to reduce the CoVaR and CoCVaR of the portfolio based on the marginal contributions to CoVaR and CoCVaR.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;GPT&#65288;&#22823;&#35821;&#35328;&#27169;&#22411;&#65289;&#21644;&#30456;&#20851;&#25216;&#26415;&#23545;&#32654;&#22269;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#28508;&#22312;&#24433;&#21709;&#65292;&#21457;&#29616;&#22823;&#32422;80%&#30340;&#32654;&#22269;&#21171;&#21160;&#21147;&#21487;&#33021;&#20250;&#21463;&#21040;10%&#30340;&#24037;&#20316;&#20219;&#21153;&#30340;&#24433;&#21709;&#65292;&#28085;&#30422;&#20102;&#25152;&#26377;&#24037;&#36164;&#27700;&#24179;&#21644;&#21508;&#34892;&#21508;&#19994;&#65292;&#39044;&#31034;&#30528;&#36825;&#20123;&#27169;&#22411;&#21487;&#33021;&#20855;&#26377;&#26174;&#33879;&#30340;&#32463;&#27982;&#12289;&#31038;&#20250;&#21644;&#25919;&#31574;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2303.10130</link><description>&lt;p&gt;
GPT&#26159;GPT&#65306;&#22823;&#35821;&#35328;&#27169;&#22411;&#23545;&#21171;&#21160;&#21147;&#24066;&#22330;&#24433;&#21709;&#30340;&#26089;&#26399;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
GPTs are GPTs: An Early Look at the Labor Market Impact Potential of Large Language Models. (arXiv:2303.10130v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10130
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;GPT&#65288;&#22823;&#35821;&#35328;&#27169;&#22411;&#65289;&#21644;&#30456;&#20851;&#25216;&#26415;&#23545;&#32654;&#22269;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#28508;&#22312;&#24433;&#21709;&#65292;&#21457;&#29616;&#22823;&#32422;80%&#30340;&#32654;&#22269;&#21171;&#21160;&#21147;&#21487;&#33021;&#20250;&#21463;&#21040;10%&#30340;&#24037;&#20316;&#20219;&#21153;&#30340;&#24433;&#21709;&#65292;&#28085;&#30422;&#20102;&#25152;&#26377;&#24037;&#36164;&#27700;&#24179;&#21644;&#21508;&#34892;&#21508;&#19994;&#65292;&#39044;&#31034;&#30528;&#36825;&#20123;&#27169;&#22411;&#21487;&#33021;&#20855;&#26377;&#26174;&#33879;&#30340;&#32463;&#27982;&#12289;&#31038;&#20250;&#21644;&#25919;&#31574;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#29983;&#25104;&#39044;&#35757;&#32451;&#21464;&#21387;&#22120;&#65288;GPT&#65289;&#27169;&#22411;&#21644;&#30456;&#20851;&#25216;&#26415;&#23545;&#32654;&#22269;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#28508;&#22312;&#24433;&#21709;&#12290;&#20351;&#29992;&#26032;&#30340;&#26631;&#20934;&#65292;&#25105;&#20204;&#35780;&#20272;&#32844;&#19994;&#19982;GPT&#33021;&#21147;&#30340;&#23545;&#24212;&#20851;&#31995;&#65292;&#32467;&#21512;&#20154;&#31867;&#19987;&#19994;&#30693;&#35782;&#21644;GPT-4&#30340;&#20998;&#31867;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#32422;80%&#30340;&#32654;&#22269;&#21171;&#21160;&#21147;&#21487;&#33021;&#20250;&#33267;&#23569;&#26377;10%&#30340;&#24037;&#20316;&#20219;&#21153;&#21463;&#21040;GPT&#24341;&#20837;&#30340;&#24433;&#21709;&#65292;&#32780;&#32422;19%&#30340;&#24037;&#20154;&#21487;&#33021;&#20250;&#30475;&#21040;&#33267;&#23569;50%&#30340;&#20219;&#21153;&#21463;&#21040;&#24433;&#21709;&#12290;&#24433;&#21709;&#33539;&#22260;&#28085;&#30422;&#20102;&#25152;&#26377;&#24037;&#36164;&#27700;&#24179;&#65292;&#39640;&#25910;&#20837;&#24037;&#20316;&#21487;&#33021;&#38754;&#20020;&#26356;&#22823;&#30340;&#39118;&#38505;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#24433;&#21709;&#24182;&#19981;&#23616;&#38480;&#20110;&#26368;&#36817;&#29983;&#20135;&#29575;&#22686;&#38271;&#36739;&#39640;&#30340;&#34892;&#19994;&#12290;&#25105;&#20204;&#24471;&#20986;&#32467;&#35770;&#65292;&#29983;&#25104;&#39044;&#35757;&#32451;&#21464;&#21387;&#22120;&#20855;&#26377;&#36890;&#29992;&#25216;&#26415;&#65288;GPT&#65289;&#30340;&#29305;&#24615;&#65292;&#34920;&#26126;&#36825;&#20123;&#27169;&#22411;&#21487;&#33021;&#20855;&#26377;&#26174;&#33879;&#30340;&#32463;&#27982;&#12289;&#31038;&#20250;&#21644;&#25919;&#31574;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate the potential implications of Generative Pre-trained Transformer (GPT) models and related technologies on the U.S. labor market. Using a new rubric, we assess occupations based on their correspondence with GPT capabilities, incorporating both human expertise and classifications from GPT-4. Our findings indicate that approximately 80% of the U.S. workforce could have at least 10% of their work tasks affected by the introduction of GPTs, while around 19% of workers may see at least 50% of their tasks impacted. The influence spans all wage levels, with higher-income jobs potentially facing greater exposure. Notably, the impact is not limited to industries with higher recent productivity growth. We conclude that Generative Pre-trained Transformers exhibit characteristics of general-purpose technologies (GPTs), suggesting that as these models could have notable economic, social, and policy implications.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21457;&#29616;&#33521;&#22269;&#24615;&#21035;&#20998;&#31163;&#38382;&#39064;&#20173;&#28982;&#23384;&#22312;&#65292;&#22899;&#24615;&#22312;&#20256;&#32479;&#22899;&#24615;&#20027;&#23548;&#34892;&#19994;&#20013;&#30340;&#21442;&#19982;&#36739;&#39640;&#65292;&#30001;&#20110;&#25345;&#20037;&#30340;&#27495;&#35270;&#24615;&#38480;&#21046;&#21644;&#23601;&#19994;&#34892;&#19994;&#36873;&#25321;&#30340;&#19981;&#21516;&#65292;&#22899;&#24615;&#22312;&#22899;&#24615;&#20027;&#23548;&#34892;&#19994;&#20013;&#30340;&#24037;&#36164;&#21644;&#21512;&#21516;&#26426;&#20250;&#36739;&#20302;&#12290;</title><link>http://arxiv.org/abs/2303.04539</link><description>&lt;p&gt;
&#33521;&#22269;&#21171;&#21160;&#21147;&#24066;&#22330;&#20013;&#22522;&#20110;&#34892;&#19994;&#20027;&#23548;&#30340;&#24615;&#21035;&#20998;&#31163;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Gender Segregation: Analysis across Sectoral-Dominance in the UK Labour Market. (arXiv:2303.04539v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.04539
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21457;&#29616;&#33521;&#22269;&#24615;&#21035;&#20998;&#31163;&#38382;&#39064;&#20173;&#28982;&#23384;&#22312;&#65292;&#22899;&#24615;&#22312;&#20256;&#32479;&#22899;&#24615;&#20027;&#23548;&#34892;&#19994;&#20013;&#30340;&#21442;&#19982;&#36739;&#39640;&#65292;&#30001;&#20110;&#25345;&#20037;&#30340;&#27495;&#35270;&#24615;&#38480;&#21046;&#21644;&#23601;&#19994;&#34892;&#19994;&#36873;&#25321;&#30340;&#19981;&#21516;&#65292;&#22899;&#24615;&#22312;&#22899;&#24615;&#20027;&#23548;&#34892;&#19994;&#20013;&#30340;&#24037;&#36164;&#21644;&#21512;&#21516;&#26426;&#20250;&#36739;&#20302;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#34429;&#28982;&#33521;&#22269;&#30340;&#24615;&#21035;&#20998;&#31163;&#31243;&#24230;&#38543;&#30528;&#26102;&#38388;&#30340;&#25512;&#31227;&#26377;&#25152;&#38477;&#20302;&#65292;&#20294;&#22899;&#24615;&#22312;&#20256;&#32479;&#19978;&#8220;&#22899;&#24615;&#20027;&#23548;&#8221;&#30340;&#34892;&#19994;&#20013;&#30340;&#21442;&#19982;&#24230;&#20173;&#28982;&#39640;&#20110;&#27604;&#20363;&#12290;&#26412;&#25991;&#26088;&#22312;&#35780;&#20272;&#34892;&#19994;&#24615;&#21035;&#20998;&#31163;&#27169;&#24335;&#30340;&#21464;&#21270;&#22914;&#20309;&#24433;&#21709;&#33521;&#22269;2005&#24180;&#33267;2020&#24180;&#38388;&#22899;&#24615;&#30340;&#23601;&#19994;&#21512;&#21516;&#21644;&#24037;&#36164;&#65292;&#24182;&#30740;&#31350;&#24615;&#21035;&#29305;&#23450;&#20027;&#23548;&#34892;&#19994;&#20013;&#30340;&#24037;&#36164;&#24046;&#24322;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#24037;&#36164;&#21644;&#21512;&#21516;&#26426;&#20250;&#30340;&#24046;&#24322;&#20027;&#35201;&#26469;&#33258;&#20110;&#22899;&#24615;&#22312;&#19981;&#21516;&#34892;&#19994;&#20043;&#38388;&#30340;&#20998;&#37197;&#20542;&#21521;&#12290;&#22240;&#27492;&#65292;&#22899;&#24615;&#22312;&#22899;&#24615;&#20027;&#23548;&#30340;&#34892;&#19994;&#20013;&#30340;&#19981;&#25104;&#27604;&#20363;&#20250;&#23548;&#33268;&#25152;&#26377;&#24037;&#20154;&#30340;&#20856;&#22411;&#21512;&#21516;&#29305;&#24449;&#21644;&#36739;&#20302;&#30340;&#24179;&#22343;&#24037;&#36164;&#12290;&#36825;&#31181;&#24046;&#24322;&#20027;&#35201;&#26159;&#30001;&#20110;&#25345;&#20037;&#30340;&#27495;&#35270;&#24615;&#38480;&#21046;&#25152;&#35299;&#37322;&#65292;&#32780;&#20154;&#21147;&#36164;&#26412;&#30456;&#20851;&#29305;&#24449;&#21482;&#36215;&#21040;&#27425;&#35201;&#20316;&#29992;&#12290;&#28982;&#32780;&#65292;&#22914;&#26524;&#24037;&#20154;&#22312;&#30007;&#24615;&#20027;&#23548;&#30340;&#34892;&#19994;&#20013;&#20855;&#26377;&#19982;&#30007;&#24615;&#30456;&#21516;&#30340;&#28508;&#22312;&#24037;&#36164;&#65292;&#24037;&#36164;&#24046;&#36317;&#23558;&#32553;&#23567;&#12290;&#27492;&#22806;&#65292;&#36825;&#20063;&#20250;&#40723;&#21169;&#22899;&#24615;&#21442;&#21152;&#30007;&#24615;&#20027;&#23548;&#30340;&#34892;&#19994;&#65292;&#20174;&#32780;&#36827;&#19968;&#27493;&#20943;&#23569;&#24615;&#21035;&#20998;&#31163;&#12290;
&lt;/p&gt;
&lt;p&gt;
Although the degree of gender segregation in the UK has decreased over time, women's participation in traditionally "female-dominated" sectors is disproportionately high. This paper aims to evaluate how changing patterns of sectoral gender segregation affected women's employment contracts and wages in the UK between 2005 and 2020. We then study wage differentials in gender-specific dominated sectors. We found that the differences in wages and contractual opportunities result mainly from the propensity of women to be distributed differently across sectors. Hence, the disproportion of women in female-dominated sectors implies contractual features and lower wages typical of that sector, on average, for all workers. This difference is primarily explained by persistent discriminatory constraints, while human capital-related characteristics play a minor role. However, wage differentials would shrink if workers had the same potential wages as men in male-dominated sectors. Moreover, this does
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#31995;&#32479;&#22320;&#30740;&#31350;&#20102;&#36127;&#30456;&#20851;&#24615;&#30340;&#19968;&#31181;&#26497;&#31471;&#24418;&#24335;&#8212;&#8212;&#19968;&#23545;&#19968;&#21453;&#21333;&#35843;&#24615;&#65292;&#24182;&#19988;&#22312;&#37327;&#20301;&#20195;&#29702;&#30340;&#39118;&#38505;&#20849;&#25285;&#38382;&#39064;&#20013;&#25214;&#21040;&#20102;&#23427;&#30340;&#24212;&#29992;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2302.11701</link><description>&lt;p&gt;
&#19968;&#23545;&#19968;&#21453;&#21333;&#35843;&#24615;
&lt;/p&gt;
&lt;p&gt;
Pairwise counter-monotonicity. (arXiv:2302.11701v2 [q-fin.RM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.11701
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#31995;&#32479;&#22320;&#30740;&#31350;&#20102;&#36127;&#30456;&#20851;&#24615;&#30340;&#19968;&#31181;&#26497;&#31471;&#24418;&#24335;&#8212;&#8212;&#19968;&#23545;&#19968;&#21453;&#21333;&#35843;&#24615;&#65292;&#24182;&#19988;&#22312;&#37327;&#20301;&#20195;&#29702;&#30340;&#39118;&#38505;&#20849;&#25285;&#38382;&#39064;&#20013;&#25214;&#21040;&#20102;&#23427;&#30340;&#24212;&#29992;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#31995;&#32479;&#22320;&#30740;&#31350;&#20102;&#19968;&#23545;&#19968;&#21453;&#21333;&#35843;&#24615;&#65292;&#36825;&#26159;&#36127;&#30456;&#20851;&#24615;&#30340;&#19968;&#31181;&#26497;&#31471;&#24418;&#24335;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#20010;&#38543;&#26426;&#34920;&#31034;&#21644;&#19968;&#20010;&#19981;&#21464;&#24615;&#36136;&#26469;&#25551;&#36848;&#36825;&#31181;&#20381;&#36182;&#32467;&#26500;&#12290;&#25105;&#20204;&#34920;&#26126;&#19968;&#23545;&#19968;&#21453;&#21333;&#35843;&#24615;&#24847;&#21619;&#30528;&#36127;&#30456;&#20851;&#24615;&#65292;&#24182;&#19988;&#24403;&#30456;&#21516;&#36793;&#38469;&#20998;&#24067;&#21487;&#20197;&#23454;&#29616;&#26102;&#65292;&#21644;&#32852;&#21512;&#28151;&#21512;&#20381;&#36182;&#24615;&#31561;&#20215;&#12290;&#25105;&#20204;&#21457;&#29616;&#19968;&#23545;&#19968;&#21453;&#21333;&#35843;&#24615;&#21644;&#37327;&#20301;&#20195;&#29702;&#30340;&#39118;&#38505;&#20849;&#25285;&#38382;&#39064;&#20043;&#38388;&#23384;&#22312;&#23494;&#20999;&#32852;&#31995;&#12290;&#36825;&#20010;&#32467;&#26524;&#24378;&#35843;&#20102;&#36825;&#31181;&#26497;&#31471;&#36127;&#30456;&#20851;&#20381;&#36182;&#32467;&#26500;&#22312;&#19981;&#20197;&#32463;&#20856;&#26041;&#24335;&#20882;&#38505;&#30340;&#20195;&#29702;&#20154;&#30340;&#26368;&#20248;&#37197;&#32622;&#20013;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We systemically study pairwise counter-monotonicity, an extremal notion of negative dependence. A stochastic representation and an invariance property are established for this dependence structure. We show that pairwise counter-monotonicity implies negative association, and it is equivalent to joint mix dependence if both are possible for the same marginal distributions. We find an intimate connection between pairwise counter-monotonicity and risk sharing problems for quantile agents. This result highlights the importance of this extremal negative dependence structure in optimal allocations for agents who are not risk averse in the classic sense.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20351;&#29992;&#20135;&#21697;&#26680;&#24515;&#24230;&#20316;&#20026;&#26032;&#30340;&#24230;&#37327;&#26041;&#27861;&#65292;&#30740;&#31350;&#20225;&#19994;&#30340;&#20135;&#21697;&#19987;&#19994;&#21270;&#12290;&#21516;&#26102;&#21457;&#29616;&#65292;&#20225;&#19994;&#20986;&#21475;&#30340;&#20135;&#21697;&#32452;&#25104;&#21464;&#21270;&#36739;&#23567;&#65292;&#19982;&#26680;&#24515;&#33021;&#21147;&#30456;&#36317;&#36739;&#36828;&#30340;&#20135;&#21697;&#26356;&#21487;&#33021;&#34987;&#21076;&#38500;&#65307;&#26356;&#39640;&#30340;&#26680;&#24515;&#24230;&#19982;&#20225;&#19994;&#32423;&#21035;&#26356;&#22823;&#30340;&#20986;&#21475;&#27969;&#37327;&#26377;&#20851;&#65307;&#19982;&#26356;&#39640;&#26680;&#24515;&#24230;&#19968;&#36215;&#20986;&#21475;&#30340;&#20135;&#21697;&#22312;&#22269;&#23478;&#32423;&#21035;&#19978;&#20855;&#26377;&#26356;&#39640;&#30340;&#20986;&#21475;&#27969;&#37327;&#12290;</title><link>http://arxiv.org/abs/2302.02767</link><description>&lt;p&gt;
&#22312;&#26680;&#24515;&#20301;&#32622;&#65306;&#20225;&#19994;&#20135;&#21697;&#19987;&#19994;&#21270;
&lt;/p&gt;
&lt;p&gt;
Being at the core: firm product specialisation. (arXiv:2302.02767v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.02767
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#20135;&#21697;&#26680;&#24515;&#24230;&#20316;&#20026;&#26032;&#30340;&#24230;&#37327;&#26041;&#27861;&#65292;&#30740;&#31350;&#20225;&#19994;&#30340;&#20135;&#21697;&#19987;&#19994;&#21270;&#12290;&#21516;&#26102;&#21457;&#29616;&#65292;&#20225;&#19994;&#20986;&#21475;&#30340;&#20135;&#21697;&#32452;&#25104;&#21464;&#21270;&#36739;&#23567;&#65292;&#19982;&#26680;&#24515;&#33021;&#21147;&#30456;&#36317;&#36739;&#36828;&#30340;&#20135;&#21697;&#26356;&#21487;&#33021;&#34987;&#21076;&#38500;&#65307;&#26356;&#39640;&#30340;&#26680;&#24515;&#24230;&#19982;&#20225;&#19994;&#32423;&#21035;&#26356;&#22823;&#30340;&#20986;&#21475;&#27969;&#37327;&#26377;&#20851;&#65307;&#19982;&#26356;&#39640;&#26680;&#24515;&#24230;&#19968;&#36215;&#20986;&#21475;&#30340;&#20135;&#21697;&#22312;&#22269;&#23478;&#32423;&#21035;&#19978;&#20855;&#26377;&#26356;&#39640;&#30340;&#20986;&#21475;&#27969;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#24230;&#37327;&#26041;&#27861;&#26469;&#30740;&#31350;&#20225;&#19994;&#30340;&#20135;&#21697;&#19987;&#19994;&#21270;&#65306;&#20135;&#21697;&#26680;&#24515;&#24230;&#65292;&#23427;&#25429;&#25417;&#20102;&#20986;&#21475;&#20135;&#21697;&#22312;&#20225;&#19994;&#20986;&#21475;&#31726;&#23376;&#20013;&#30340;&#20013;&#24515;&#22320;&#20301;&#12290;&#25105;&#20204;&#20351;&#29992;2018&#24180;&#33267;2020&#24180;&#21733;&#20262;&#27604;&#20122;&#12289;&#21380;&#29916;&#22810;&#23572;&#21644;&#31192;&#40065;&#30340;&#20225;&#19994;-&#20135;&#21697;&#32423;&#21035;&#25968;&#25454;&#30740;&#31350;&#20102;&#20135;&#21697;&#26680;&#24515;&#24230;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#24471;&#20986;&#20102;&#19977;&#20010;&#20027;&#35201;&#21457;&#29616;&#12290;&#39318;&#20808;&#65292;&#20225;&#19994;&#20986;&#21475;&#31726;&#23376;&#30340;&#32452;&#25104;&#22312;&#19968;&#24180;&#20043;&#20869;&#21464;&#21270;&#30456;&#23545;&#36739;&#23567;&#65292;&#19982;&#20225;&#19994;&#26680;&#24515;&#33021;&#21147;&#30456;&#36317;&#36739;&#36828;&#12289;&#26680;&#24515;&#24230;&#36739;&#20302;&#30340;&#20135;&#21697;&#26356;&#26377;&#21487;&#33021;&#34987;&#21076;&#38500;&#12290;&#20854;&#27425;&#65292;&#26356;&#39640;&#30340;&#26680;&#24515;&#24230;&#19982;&#20225;&#19994;&#32423;&#21035;&#26356;&#22823;&#30340;&#20986;&#21475;&#27969;&#37327;&#26377;&#20851;&#12290;&#31532;&#19977;&#65292;&#36825;&#31181;&#20225;&#19994;&#32423;&#21035;&#30340;&#27169;&#24335;&#20063;&#23545;&#24635;&#20307;&#27700;&#24179;&#20135;&#29983;&#24433;&#21709;&#65306;&#24179;&#22343;&#32780;&#35328;&#65292;&#19982;&#26356;&#39640;&#26680;&#24515;&#24230;&#19968;&#36215;&#20986;&#21475;&#30340;&#20135;&#21697;&#22312;&#22269;&#23478;&#32423;&#21035;&#19978;&#20855;&#26377;&#26356;&#39640;&#30340;&#20986;&#21475;&#27969;&#37327;&#65292;&#36825;&#22312;&#25152;&#26377;&#20135;&#21697;&#22797;&#26434;&#24615;&#27700;&#24179;&#19978;&#37117;&#25104;&#31435;&#12290;&#22240;&#27492;&#65292;&#26412;&#25991;&#34920;&#26126;&#19968;&#20010;&#20135;&#21697;&#19982;&#20225;&#19994;&#33021;&#21147;&#30340;&#22865;&#21512;&#31243;&#24230;&#23545;&#20225;&#19994;&#21644;&#22269;&#23478;&#30340;&#32463;&#27982;&#34920;&#29616;&#37117;&#24456;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a novel measure to investigate firms' product specialisation: product coreness, that captures the centrality of exported products within the firm's export basket. We study product coreness using firm-product level data between 2018 and 2020 for Colombia, Ecuador, and Peru. Three main findings emerge from our analysis. First, the composition of firms' export baskets changes relatively little from one year to the other, and products far from the firm's core competencies, with low coreness, are more likely to be dropped. Second, higher coreness is associated with larger export flows at the firm level. Third, such firm-level patterns also have implications at the aggregate level: products that are, on average, exported with higher coreness have higher export flows at the country level, which holds across all levels of product complexity. Therefore, the paper shows that how closely a product fits within a firm's capabilities is important for economic performance at both the firm 
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#34920;&#26126;&#65292;&#20154;&#20204;&#22312;&#38754;&#23545;&#24369;&#20449;&#21495;&#26102;&#20250;&#23384;&#22312;&#36807;&#24230;&#21453;&#24212;&#65292;&#22312;&#38754;&#23545;&#24378;&#20449;&#21495;&#26102;&#20250;&#23384;&#22312;&#27424;&#21453;&#24212;&#65292;&#36825;&#19982;&#20449;&#21495;&#20449;&#24687;&#37327;&#30340;&#35748;&#30693;&#19981;&#31934;&#30830;&#26377;&#20851;&#12290;</title><link>http://arxiv.org/abs/2109.09871</link><description>&lt;p&gt;
&#24369;&#20449;&#21495;&#30340;&#36807;&#24230;&#25512;&#26029;&#21450;&#24378;&#20449;&#21495;&#30340;&#27424;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Overinference from Weak Signals and Underinference from Strong Signals. (arXiv:2109.09871v4 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2109.09871
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#34920;&#26126;&#65292;&#20154;&#20204;&#22312;&#38754;&#23545;&#24369;&#20449;&#21495;&#26102;&#20250;&#23384;&#22312;&#36807;&#24230;&#21453;&#24212;&#65292;&#22312;&#38754;&#23545;&#24378;&#20449;&#21495;&#26102;&#20250;&#23384;&#22312;&#27424;&#21453;&#24212;&#65292;&#36825;&#19982;&#20449;&#21495;&#20449;&#24687;&#37327;&#30340;&#35748;&#30693;&#19981;&#31934;&#30830;&#26377;&#20851;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20851;&#20110;&#20449;&#24687;&#37327;&#22823;&#23567;&#23545;&#20449;&#21495;&#26356;&#26032;&#30340;&#36807;&#24230;&#21453;&#24212;&#21644;&#27424;&#21453;&#24212;&#30340;&#24433;&#21709;&#12290;&#23613;&#31649;&#22823;&#37327;&#25991;&#29486;&#30740;&#31350;&#20102;&#39640;&#20449;&#24687;&#37327;&#20449;&#21495;&#30340;&#20449;&#24565;&#26356;&#26032;&#65292;&#20294;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#65292;&#20154;&#20204;&#24448;&#24448;&#38754;&#23545;&#19968;&#22823;&#22534;&#24369;&#20449;&#21495;&#12290;&#25105;&#20204;&#20351;&#29992;&#20102;&#20005;&#23494;&#30340;&#23454;&#39564;&#21644;&#26032;&#30340;&#26469;&#33258;&#21338;&#24425;&#21644;&#37329;&#34701;&#24066;&#22330;&#30340;&#32463;&#39564;&#35777;&#25454;&#35777;&#26126;&#65292;&#20449;&#21495;&#24378;&#24230;&#23545;&#26356;&#26032;&#34892;&#20026;&#26377;&#30528;&#23454;&#36136;&#24615;&#30340;&#24433;&#21709;&#65306;&#22312;&#21508;&#39046;&#22495;&#20013;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#19968;&#33268;&#19988;&#31283;&#20581;&#30340;&#32467;&#26524;&#65292;&#21363;&#23545;&#20110;&#24369;&#20449;&#21495;&#23384;&#22312;&#36807;&#24230;&#21453;&#24212;&#65292;&#32780;&#23545;&#20110;&#24378;&#20449;&#21495;&#23384;&#22312;&#27424;&#21453;&#24212;&#12290;&#36825;&#20004;&#31181;&#32467;&#26524;&#37117;&#19982;&#20851;&#20110;&#20449;&#21495;&#20449;&#24687;&#37327;&#30340;&#35748;&#30693;&#19981;&#31934;&#30830;&#30340;&#31616;&#21333;&#29702;&#35770;&#30456;&#21563;&#21512;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#21644;&#21457;&#29616;&#21487;&#24110;&#21161;&#21327;&#35843;&#23454;&#39564;&#21644;&#32463;&#39564;&#25991;&#29486;&#20013;&#34920;&#29616;&#20986;&#30340;&#26126;&#26174;&#30683;&#30462;&#20043;&#22788;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study how overreaction and underreaction to signals depend on their informativeness. While a large literature has studied belief updating in response to highly informative signals, people in important real-world settings are often faced with a steady stream of weak signals. We use a tightly controlled experiment and new empirical evidence from betting and financial markets to demonstrate that updating behavior differs meaningfully by signal strength: across domains, our consistent and robust finding is overreaction to weak signals and underreaction to strong signals. Both sets of results align well with a simple theory of cognitive imprecision about signal informativeness. Our framework and findings can help harmonize apparently contradictory results from the experimental and empirical literatures.
&lt;/p&gt;</description></item></channel></rss>