<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#33268;&#21147;&#20110;&#24320;&#21457;&#21644;&#20998;&#26512;&#19968;&#31181;&#22810;&#20195;&#24065;&#20027;&#21160;&#22411;&#24066;&#22330;&#21046;&#36896;&#21830;(MPMM)&#65292;&#23427;&#36890;&#36807;&#25913;&#36827;&#23450;&#20215;&#26354;&#32447;&#21644;&#22343;&#34913;&#28857;&#65292;&#26174;&#33879;&#25552;&#39640;&#20102;&#36164;&#26412;&#25928;&#29575;&#21644;&#20215;&#26684;&#24433;&#21709;&#65292;&#24182;&#26356;&#26377;&#25928;&#22320;&#24212;&#23545;&#20020;&#26102;&#24615;&#25439;&#22833;&#12290;</title><link>http://arxiv.org/abs/2309.00632</link><description>&lt;p&gt;
&#25552;&#39640;&#36164;&#26412;&#25928;&#29575;&#21644;&#20020;&#26102;&#24615;&#25439;&#22833;&#30340;&#26041;&#27861;&#65306;&#22810;&#20195;&#24065;&#20027;&#21160;&#22411;&#24066;&#22330;&#21046;&#36896;&#21830;
&lt;/p&gt;
&lt;p&gt;
Improving Capital Efficiency and Impermanent Loss: Multi-Token Proactive Market Maker. (arXiv:2309.00632v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.00632
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#33268;&#21147;&#20110;&#24320;&#21457;&#21644;&#20998;&#26512;&#19968;&#31181;&#22810;&#20195;&#24065;&#20027;&#21160;&#22411;&#24066;&#22330;&#21046;&#36896;&#21830;(MPMM)&#65292;&#23427;&#36890;&#36807;&#25913;&#36827;&#23450;&#20215;&#26354;&#32447;&#21644;&#22343;&#34913;&#28857;&#65292;&#26174;&#33879;&#25552;&#39640;&#20102;&#36164;&#26412;&#25928;&#29575;&#21644;&#20215;&#26684;&#24433;&#21709;&#65292;&#24182;&#26356;&#26377;&#25928;&#22320;&#24212;&#23545;&#20020;&#26102;&#24615;&#25439;&#22833;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#21069;&#21152;&#23494;&#36135;&#24065;&#33258;&#21160;&#21270;&#24066;&#22330;&#21046;&#36896;&#21830;&#30340;&#26041;&#27861;&#23548;&#33268;&#20005;&#37325;&#30340;&#20020;&#26102;&#24615;&#25439;&#22833;&#21644;&#30862;&#29255;&#21270;&#27969;&#21160;&#24615;&#12290;&#25105;&#20204;&#19987;&#27880;&#20110;&#24320;&#21457;&#21644;&#20998;&#26512;&#22810;&#20195;&#24065;&#20027;&#21160;&#22411;&#24066;&#22330;&#21046;&#36896;&#21830;(MPMM)&#12290;MPMM&#26159;DODO Exchange&#24341;&#20837;&#30340;&#20027;&#21160;&#22411;&#24066;&#22330;&#21046;&#36896;&#21830;(PMM)&#30340;&#25193;&#23637;&#65292;&#23427;&#27867;&#21270;&#20102;&#24120;&#25968;&#20056;&#31215;&#24066;&#22330;&#21046;&#36896;&#21830;(CPMM)&#65292;&#20801;&#35768;&#35843;&#25972;&#23450;&#20215;&#26354;&#32447;&#30340;&#8220;&#24179;&#22374;&#24230;&#8221;&#21644;&#24179;&#34913;&#28857;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;PMM&#21644;MPMM&#20013;&#20351;&#29992;&#30340;&#36825;&#20123;&#26426;&#21046;&#65292;&#24182;&#36890;&#36807;&#27169;&#25311;&#35777;&#26126;MPMM&#22312;&#36164;&#26412;&#25928;&#29575;&#21644;&#20215;&#26684;&#24433;&#21709;&#26041;&#38754;&#26126;&#26174;&#20248;&#20110;&#20854;2&#20195;&#24065;&#27744;&#23545;&#24212;&#29289;&#21644;&#23427;&#20204;&#30340;&#22810;&#20195;&#24065;&#27744;&#27867;&#21270;&#12290;&#27492;&#22806;&#65292;&#22312;&#20856;&#22411;&#30340;&#24066;&#22330;&#26465;&#20214;&#19979;&#65292;MPMM&#20063;&#27604;&#20854;&#20182;&#24066;&#22330;&#21046;&#36896;&#21830;&#21464;&#20307;&#26356;&#26377;&#25928;&#22320;&#24212;&#23545;&#20020;&#26102;&#24615;&#25439;&#22833;&#12290;&#24635;&#30340;&#26469;&#35828;&#65292;&#36825;&#39033;&#30740;&#31350;&#31361;&#26174;&#20102;&#22810;&#20195;&#24065;&#24066;&#22330;&#21046;&#36896;&#21830;&#30456;&#23545;&#20110;&#25104;&#23545;&#20195;&#24065;&#27169;&#22411;&#30340;&#20248;&#21183;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24066;&#22330;&#21046;&#36896;&#31639;&#27861;&#12290;&#30740;&#31350;&#32467;&#26524;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#21442;&#32771;&#12290;
&lt;/p&gt;
&lt;p&gt;
Current approaches to the cryptocurrency automated market makers result in poor impermanent loss and fragmented liquidity. We focus on the development and analysis of a multi-token proactive market maker (MPMM). MPMM is an extension of the proactive market maker (PMM) introduced by DODO Exchange, which generalizes the constant product market maker (CPMM) and allows for adjustments to the pricing curve's ``flatness" and equilibrium points. We analyze these mechanics as used in both PMM and MPMM and demonstrate via simulation that MPMM significantly improves capital efficiency and price impact compared to its 2-token pool counterparts as well as their multi-token pool generalizations. Furthermore, in typical market conditions, MPMM also combats impermanent loss more effectively than other market maker variants. Overall, this research highlights the advantages multi-token market makers have over pairwise-token models, and poses a novel market making algorithm. The findings provide valuabl
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25506;&#31350;&#20102;&#31895;&#31961;&#27874;&#21160;&#29575;&#27169;&#22411;&#20013;&#30340;&#36335;&#24452;&#20381;&#36182;PDE&#38382;&#39064;&#65292;&#35777;&#26126;&#20102;&#26465;&#20214;&#26399;&#26395;&#26159;&#20854;&#21807;&#19968;&#30340;&#32463;&#20856;&#35299;&#12290;&#24182;&#19988;&#65292;&#35813;&#30740;&#31350;&#36824;&#30740;&#31350;&#20102;&#20855;&#26377;Hurst&#21442;&#25968;&#30340;&#31163;&#25955;&#38543;&#26426;&#31215;&#20998;&#30340;&#24369;&#25910;&#25947;&#29575;&#65292;&#20197;&#36924;&#36817;&#31895;&#31961;&#27874;&#21160;&#29575;&#27169;&#22411;&#20013;&#30340;&#23545;&#25968;&#32929;&#31080;&#20215;&#26684;&#12290;</title><link>http://arxiv.org/abs/2304.03042</link><description>&lt;p&gt;
&#31895;&#31961;&#27874;&#21160;&#29575;&#65292;&#36335;&#24452;&#20381;&#36182;PDE&#21644;&#24369;&#25910;&#25947;&#29575;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Rough volatility, path-dependent PDEs and weak rates of convergence. (arXiv:2304.03042v1 [math.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.03042
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25506;&#31350;&#20102;&#31895;&#31961;&#27874;&#21160;&#29575;&#27169;&#22411;&#20013;&#30340;&#36335;&#24452;&#20381;&#36182;PDE&#38382;&#39064;&#65292;&#35777;&#26126;&#20102;&#26465;&#20214;&#26399;&#26395;&#26159;&#20854;&#21807;&#19968;&#30340;&#32463;&#20856;&#35299;&#12290;&#24182;&#19988;&#65292;&#35813;&#30740;&#31350;&#36824;&#30740;&#31350;&#20102;&#20855;&#26377;Hurst&#21442;&#25968;&#30340;&#31163;&#25955;&#38543;&#26426;&#31215;&#20998;&#30340;&#24369;&#25910;&#25947;&#29575;&#65292;&#20197;&#36924;&#36817;&#31895;&#31961;&#27874;&#21160;&#29575;&#27169;&#22411;&#20013;&#30340;&#23545;&#25968;&#32929;&#31080;&#20215;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#38543;&#26426;Volterra&#26041;&#31243;&#30340;&#35774;&#32622;&#20013;&#65292;&#29305;&#21035;&#26159;&#31895;&#31961;&#27874;&#21160;&#29575;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#26465;&#20214;&#26399;&#26395;&#26159;&#36335;&#24452;&#20381;&#36182;PDE&#30340;&#21807;&#19968;&#32463;&#20856;&#35299;&#12290;&#21518;&#32773;&#30001;[Viens&#65292;F&#12290;&#65292;&#65286;Zhang&#65292;J&#12290;&#65288;2019&#65289;&#12290;&#23545;&#20998;&#25968;&#24067;&#26391;&#36816;&#21160;&#21450;&#20854;&#30456;&#20851;&#36335;&#24452;&#20381;&#36182;PDE&#30340;&#38789;&#26041;&#27861;&#30340;&#24320;&#21457;&#32780;&#26469;&#12290;Ann. Appl. Probab.],&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#21033;&#29992;&#36825;&#20123;&#24037;&#20855;&#30740;&#31350;&#20855;&#26377;Hurst&#21442;&#25968;$H \in (0,1/2)$&#30340;Riemann-Liouville&#20998;&#25968;&#24067;&#26391;&#36816;&#21160;&#30340;&#24179;&#28369;&#20989;&#25968;&#30340;&#31163;&#25955;&#38543;&#26426;&#31215;&#20998;&#30340;&#24369;&#25910;&#25947;&#29575;&#12290;&#36825;&#20123;&#31215;&#20998;&#36924;&#36817;&#31895;&#31961;&#27874;&#21160;&#29575;&#27169;&#22411;&#20013;&#30340;&#23545;&#25968;&#32929;&#31080;&#20215;&#26684;&#12290;&#22914;&#26524;&#27979;&#35797;&#20989;&#25968;&#26159;&#20108;&#27425;&#30340;&#65292;&#21017;&#25105;&#20204;&#33719;&#24471;1&#38454;&#24369;&#35823;&#24046;&#29575;&#65292;&#22914;&#26524;&#27979;&#35797;&#20989;&#25968;&#26159;&#24179;&#28369;&#30340;&#65292;&#21017;&#33719;&#24471;$H + 1/2$&#38454;&#30340;&#35823;&#24046;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the setting of stochastic Volterra equations, and in particular rough volatility models, we show that conditional expectations are the unique classical solutions to path-dependent PDEs. The latter arise from the functional It\^o formula developed by [Viens, F., &amp; Zhang, J. (2019). A martingale approach for fractional Brownian motions and related path dependent PDEs. Ann. Appl. Probab.]. We then leverage these tools to study weak rates of convergence for discretised stochastic integrals of smooth functions of a Riemann-Liouville fractional Brownian motion with Hurst parameter $H \in (0,1/2)$. These integrals approximate log-stock prices in rough volatility models. We obtain weak error rates of order 1 if the test function is quadratic and of order $H+1/2$ for smooth test functions.
&lt;/p&gt;</description></item></channel></rss>