<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21160;&#24577;&#27169;&#22411;&#36873;&#25321;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#26681;&#25454;&#19981;&#21516;&#30340;&#29366;&#24577;&#36873;&#25321;&#26368;&#20248;&#30340;&#27169;&#22411;&#65292;&#24182;&#36890;&#36807;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#23545;&#21160;&#24577;&#35268;&#21010;&#38382;&#39064;&#36827;&#34892;&#36817;&#20284;&#21644;&#20272;&#35745;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#37325;&#26032;&#24179;&#34913;&#25104;&#26412;&#19979;&#20999;&#25442;&#25237;&#36164;&#32452;&#21512;&#27169;&#22411;&#26102;&#65292;&#20351;&#29992;&#23439;&#35266;&#32463;&#27982;&#20449;&#24687;&#30340;&#24615;&#33021;&#20248;&#20110;&#20107;&#21518;&#36873;&#25321;&#26368;&#20339;&#25237;&#36164;&#32452;&#21512;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2307.04754</link><description>&lt;p&gt;
&#21160;&#20316;&#29366;&#24577;&#30456;&#20851;&#30340;&#21160;&#24577;&#27169;&#22411;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Action-State Dependent Dynamic Model Selection. (arXiv:2307.04754v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04754
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21160;&#24577;&#27169;&#22411;&#36873;&#25321;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#26681;&#25454;&#19981;&#21516;&#30340;&#29366;&#24577;&#36873;&#25321;&#26368;&#20248;&#30340;&#27169;&#22411;&#65292;&#24182;&#36890;&#36807;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#23545;&#21160;&#24577;&#35268;&#21010;&#38382;&#39064;&#36827;&#34892;&#36817;&#20284;&#21644;&#20272;&#35745;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#37325;&#26032;&#24179;&#34913;&#25104;&#26412;&#19979;&#20999;&#25442;&#25237;&#36164;&#32452;&#21512;&#27169;&#22411;&#26102;&#65292;&#20351;&#29992;&#23439;&#35266;&#32463;&#27982;&#20449;&#24687;&#30340;&#24615;&#33021;&#20248;&#20110;&#20107;&#21518;&#36873;&#25321;&#26368;&#20339;&#25237;&#36164;&#32452;&#21512;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#19990;&#30028;&#30340;&#26576;&#20123;&#29366;&#24577;&#19979;&#65292;&#22810;&#20010;&#27169;&#22411;&#20013;&#30340;&#19968;&#20010;&#21487;&#33021;&#21482;&#22312;&#20854;&#20013;&#26576;&#20123;&#29366;&#24577;&#19979;&#34920;&#29616;&#26368;&#20339;&#12290;&#32780;&#22312;&#27169;&#22411;&#20043;&#38388;&#30340;&#20999;&#25442;&#20063;&#21487;&#33021;&#20195;&#20215;&#39640;&#26114;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#23547;&#25214;&#19968;&#31181;&#33021;&#22815;&#21160;&#24577;&#36873;&#25321;&#27169;&#22411;&#30340;&#36807;&#31243;&#38656;&#35201;&#35299;&#20915;&#19968;&#20010;&#22797;&#26434;&#30340;&#20272;&#35745;&#38382;&#39064;&#21644;&#21160;&#24577;&#35268;&#21010;&#38382;&#39064;&#12290;&#26412;&#25991;&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#26469;&#20174;&#25968;&#25454;&#20013;&#36817;&#20284;&#21644;&#20272;&#35745;&#36825;&#20010;&#21160;&#24577;&#35268;&#21010;&#38382;&#39064;&#30340;&#26368;&#20248;&#35299;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#31639;&#27861;&#33021;&#22815;&#19968;&#33268;&#22320;&#20272;&#35745;&#20986;&#26681;&#25454;&#19968;&#32452;&#21327;&#21464;&#37327;&#36873;&#25321;&#19981;&#21516;&#27169;&#22411;&#30340;&#26368;&#20248;&#31574;&#30053;&#12290;&#20855;&#20307;&#24212;&#29992;&#26041;&#38754;&#65292;&#20363;&#22914;&#22312;&#37325;&#26032;&#24179;&#34913;&#25104;&#26412;&#19979;&#20999;&#25442;&#19981;&#21516;&#25237;&#36164;&#32452;&#21512;&#27169;&#22411;&#65292;&#20351;&#29992;&#23439;&#35266;&#32463;&#27982;&#20449;&#24687;&#36827;&#34892;&#20915;&#31574;&#12290;&#36890;&#36807;&#19968;&#32452;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#21644;&#20215;&#26684;&#25968;&#25454;&#65292;&#32463;&#39564;&#24212;&#29992;&#20110;&#19978;&#36848;&#25237;&#36164;&#32452;&#21512;&#38382;&#39064;&#34920;&#29616;&#20986;&#27604;&#20107;&#21518;&#36873;&#25321;&#26368;&#20339;&#25237;&#36164;&#32452;&#21512;&#27169;&#22411;&#26356;&#20248;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
A model among many may only be best under certain states of the world. Switching from a model to another can also be costly. Finding a procedure to dynamically choose a model in these circumstances requires to solve a complex estimation procedure and a dynamic programming problem. A Reinforcement learning algorithm is used to approximate and estimate from the data the optimal solution to this dynamic programming problem. The algorithm is shown to consistently estimate the optimal policy that may choose different models based on a set of covariates. A typical example is the one of switching between different portfolio models under rebalancing costs, using macroeconomic information. Using a set of macroeconomic variables and price data, an empirical application to the aforementioned portfolio problem shows superior performance to choosing the best portfolio model with hindsight.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#20851;&#20110;&#22914;&#20309;&#23558;&#37325;&#35201;&#24615;&#25277;&#26679;&#26377;&#25928;&#22320;&#24212;&#29992;&#20110;&#35299;&#20915;&#21253;&#21547;&#23614;&#37096;&#39118;&#38505;&#24230;&#37327;&#30340;&#38543;&#26426;&#20248;&#21270;&#38382;&#39064;&#30340;&#20837;&#38376;&#27010;&#36848;&#12290;</title><link>http://arxiv.org/abs/2307.04676</link><description>&lt;p&gt;
&#26368;&#23567;&#21270;&#23614;&#37096;&#39118;&#38505;&#30340;&#37325;&#35201;&#24615;&#25277;&#26679;: &#19968;&#20010;&#25945;&#31243;
&lt;/p&gt;
&lt;p&gt;
Importance Sampling for Minimization of Tail Risks: A Tutorial. (arXiv:2307.04676v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04676
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#20851;&#20110;&#22914;&#20309;&#23558;&#37325;&#35201;&#24615;&#25277;&#26679;&#26377;&#25928;&#22320;&#24212;&#29992;&#20110;&#35299;&#20915;&#21253;&#21547;&#23614;&#37096;&#39118;&#38505;&#24230;&#37327;&#30340;&#38543;&#26426;&#20248;&#21270;&#38382;&#39064;&#30340;&#20837;&#38376;&#27010;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20026;&#20351;&#29992;&#37325;&#35201;&#24615;&#25277;&#26679;&#26377;&#25928;&#22320;&#35299;&#20915;&#21253;&#25324;&#26465;&#20214;&#39118;&#38505;&#20215;&#20540;&#31561;&#23614;&#37096;&#39118;&#38505;&#24230;&#37327;&#30340;&#38543;&#26426;&#20248;&#21270;&#38382;&#39064;&#25552;&#20379;&#20102;&#19968;&#20010;&#31616;&#20171;&#24615;&#27010;&#36848;&#12290;&#36890;&#36807;&#23545;&#23614;&#37096;&#39118;&#38505;&#24230;&#37327;&#36827;&#34892;&#26679;&#26412;&#24179;&#22343;&#36924;&#36817;&#26469;&#36827;&#34892;&#39118;&#38505;&#26368;&#23567;&#21270;&#20915;&#31574;&#22312;&#20351;&#29992;&#19978;&#31616;&#21333;&#32780;&#24191;&#27867;&#65292;&#20294;&#38656;&#35201;&#22823;&#37327;&#26679;&#26412;&#25165;&#33021;&#20197;&#39640;&#32622;&#20449;&#24230;&#24471;&#20986;&#20915;&#31574;&#12290;&#36825;&#20027;&#35201;&#26159;&#30001;&#20110;&#22312;&#26679;&#26412;&#20013;&#24456;&#23569;&#35266;&#23519;&#21040;&#30456;&#20851;&#30340;&#23614;&#37096;&#20107;&#20214;&#12290;&#22312;&#27169;&#25311;&#20013;&#65292;&#37325;&#35201;&#24615;&#25277;&#26679;&#26159;&#22823;&#24133;&#20943;&#23569;&#26679;&#26412;&#38656;&#27714;&#30340;&#26368;&#37325;&#35201;&#26041;&#27861;&#20043;&#19968;&#65292;&#29992;&#20110;&#20272;&#35745;&#32597;&#35265;&#20107;&#20214;&#30340;&#27010;&#29575;&#12290;&#37325;&#35201;&#24615;&#25277;&#26679;&#33021;&#21542;&#29992;&#20110;&#20248;&#21270;&#65311;&#22914;&#26524;&#21487;&#20197;&#65292;&#37027;&#20040;&#20351;&#37325;&#35201;&#24615;&#25277;&#26679;&#25104;&#20026;&#24212;&#23545;&#28041;&#21450;&#32597;&#35265;&#20107;&#20214;&#30340;&#20248;&#21270;&#38382;&#39064;&#30340;&#26377;&#25928;&#24037;&#20855;&#25152;&#38656;&#30340;&#26465;&#20214;&#26159;&#20160;&#20040;&#65311;&#26412;&#25945;&#31243;&#26088;&#22312;&#25552;&#20379;&#19968;&#20010;&#31616;&#20171;&#24615;&#30340;&#27010;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper provides an introductory overview of how one may employ importance sampling effectively as a tool for solving stochastic optimization formulations incorporating tail risk measures such as Conditional Value-at-Risk. Approximating the tail risk measure by its sample average approximation, while appealing due to its simplicity and universality in use, requires a large number of samples to be able to arrive at risk-minimizing decisions with high confidence. This is primarily due to the rarity with which the relevant tail events get observed in the samples. In simulation, Importance Sampling is among the most prominent methods for substantially reducing the sample requirement while estimating probabilities of rare events. Can importance sampling be used for optimization as well? If so, what are the ingredients required for making importance sampling an effective tool for optimization formulations involving rare events? This tutorial aims to provide an introductory overview of the
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#36890;&#36807;&#25509;&#21463;&#38598;&#35825;&#23548;&#20986;&#20849;&#21333;&#22686;&#21152;&#24615;&#39118;&#38505;&#24230;&#37327;&#12290;&#36825;&#31181;&#26041;&#27861;&#36866;&#29992;&#20110;&#20855;&#26377;&#20808;&#39564;&#25351;&#23450;&#30340;&#20381;&#36182;&#32467;&#26500;&#30340;&#39118;&#38505;&#24230;&#37327;&#12290;</title><link>http://arxiv.org/abs/2307.04647</link><description>&lt;p&gt;
&#20851;&#20110;&#30001;&#25509;&#21463;&#38598;&#23548;&#20986;&#20849;&#21333;&#22686;&#21152;&#24615;&#39118;&#38505;&#24230;&#37327;&#30340;&#19968;&#28857;&#35828;&#26126;
&lt;/p&gt;
&lt;p&gt;
A note on the induction of comonotonic additive risk measures from acceptance sets. (arXiv:2307.04647v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04647
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#36890;&#36807;&#25509;&#21463;&#38598;&#35825;&#23548;&#20986;&#20849;&#21333;&#22686;&#21152;&#24615;&#39118;&#38505;&#24230;&#37327;&#12290;&#36825;&#31181;&#26041;&#27861;&#36866;&#29992;&#20110;&#20855;&#26377;&#20808;&#39564;&#25351;&#23450;&#30340;&#20381;&#36182;&#32467;&#26500;&#30340;&#39118;&#38505;&#24230;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22312;&#25509;&#21463;&#38598;&#19978;&#25552;&#20986;&#20102;&#31616;&#21333;&#30340;&#19968;&#33324;&#26465;&#20214;&#65292;&#20351;&#20854;&#35825;&#23548;&#20986;&#30340;&#36135;&#24065;&#39118;&#38505;&#21644;&#20559;&#24046;&#24230;&#37327;&#26159;&#20849;&#21333;&#22686;&#21152;&#24615;&#30340;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#65292;&#22914;&#26524;&#25509;&#21463;&#38598;&#21450;&#20854;&#34917;&#38598;&#22312;&#20849;&#21333;&#22686;&#38543;&#26426;&#21464;&#37327;&#30340;&#20984;&#32452;&#21512;&#19979;&#26159;&#31283;&#23450;&#30340;&#65292;&#21017;&#25509;&#21463;&#38598;&#35825;&#23548;&#20986;&#20849;&#21333;&#22686;&#21152;&#24615;&#39118;&#38505;&#24230;&#37327;&#12290;&#35813;&#32467;&#26524;&#30340;&#25512;&#24191;&#36866;&#29992;&#20110;&#23545;&#20110;&#20808;&#39564;&#25351;&#23450;&#30340;&#20381;&#36182;&#32467;&#26500;&#65288;&#20363;&#22914;&#23436;&#20840;&#30456;&#20851;&#30340;&#12289;&#19981;&#30456;&#20851;&#30340;&#25110;&#29420;&#31435;&#30340;&#38543;&#26426;&#21464;&#37327;&#65289;&#65292;&#19982;&#38543;&#26426;&#21464;&#37327;&#30456;&#21152;&#24615;&#39118;&#38505;&#24230;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present simple general conditions on the acceptance sets under which their induced monetary risk and deviation measures are comonotonic additive. We show that acceptance sets induce comonotonic additive risk measures if and only if the acceptance sets and their complements are stable under convex combinations of comonotonic random variables. A generalization of this result applies to risk measures that are additive for random variables with \textit{a priori} specified dependence structures, e.g., perfectly correlated, uncorrelated, or independent random variables.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20998;&#26512;&#20102;&#26368;&#23567;&#20108;&#20056;&#22238;&#24402;&#21644;&#31070;&#32463;&#32593;&#32476;&#36924;&#36817;&#26041;&#27861;&#22312;&#25671;&#25670;&#26399;&#26435;&#23450;&#20215;&#20013;&#30340;&#24212;&#29992;&#65292;&#24182;&#35777;&#26126;&#20102;&#36866;&#24403;&#36873;&#25321;&#22238;&#24402;&#20989;&#25968;&#26102;&#65292;&#36825;&#20004;&#31181;&#26041;&#27861;&#37117;&#33021;&#22815;&#23454;&#29616;&#31934;&#30830;&#30340;&#23450;&#20215;&#12290;</title><link>http://arxiv.org/abs/2307.04510</link><description>&lt;p&gt;
&#26368;&#23567;&#20108;&#20056;&#22238;&#24402;&#21644;&#31070;&#32463;&#32593;&#32476;&#36924;&#36817;&#29992;&#20110;&#25671;&#25670;&#26399;&#26435;&#23450;&#20215;&#30340;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
An analysis of least squares regression and neural networks approximation for the pricing of swing options. (arXiv:2307.04510v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04510
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20998;&#26512;&#20102;&#26368;&#23567;&#20108;&#20056;&#22238;&#24402;&#21644;&#31070;&#32463;&#32593;&#32476;&#36924;&#36817;&#26041;&#27861;&#22312;&#25671;&#25670;&#26399;&#26435;&#23450;&#20215;&#20013;&#30340;&#24212;&#29992;&#65292;&#24182;&#35777;&#26126;&#20102;&#36866;&#24403;&#36873;&#25321;&#22238;&#24402;&#20989;&#25968;&#26102;&#65292;&#36825;&#20004;&#31181;&#26041;&#27861;&#37117;&#33021;&#22815;&#23454;&#29616;&#31934;&#30830;&#30340;&#23450;&#20215;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#23567;&#20108;&#20056;&#22238;&#24402;&#26368;&#21021;&#26159;&#29992;&#20110;&#32654;&#24335;&#26399;&#26435;&#23450;&#20215;&#30340;&#65292;&#20294;&#29616;&#22312;&#24050;&#32463;&#25193;&#23637;&#21040;&#20102;&#25671;&#25670;&#26399;&#26435;&#23450;&#20215;&#12290;&#25671;&#25670;&#26399;&#26435;&#30340;&#20215;&#26684;&#21487;&#20197;&#30475;&#20316;&#26159;&#19968;&#20010;&#21453;&#21521;&#21160;&#24577;&#35268;&#21010;&#21407;&#29702;&#30340;&#35299;&#65292;&#20854;&#20013;&#21253;&#21547;&#19968;&#20010;&#31216;&#20026;&#32487;&#32493;&#20540;&#30340;&#26465;&#20214;&#26399;&#26395;&#12290;&#20351;&#29992;&#26368;&#23567;&#20108;&#20056;&#22238;&#24402;&#36924;&#36817;&#32487;&#32493;&#20540;&#30340;&#26041;&#27861;&#28041;&#21450;&#20004;&#20010;&#32423;&#21035;&#30340;&#36924;&#36817;&#12290;&#39318;&#20808;&#65292;&#32487;&#32493;&#20540;&#34987;&#19968;&#20010;&#26377;&#38480;&#38598;&#21512;&#30340;$m$&#20010;&#24179;&#26041;&#21487;&#31215;&#20989;&#25968;&#65288;&#22238;&#24402;&#20989;&#25968;&#65289;&#29983;&#25104;&#30340;&#23376;&#31354;&#38388;&#30340;&#27491;&#20132;&#25237;&#24433;&#25152;&#26367;&#20195;&#65292;&#24471;&#21040;&#25671;&#25670;&#20215;&#20540;&#20989;&#25968;&#30340;&#31532;&#19968;&#20010;&#36817;&#20284;&#20540;$V^m$&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#65292;&#36890;&#36807;&#36873;&#25321;&#21512;&#36866;&#30340;&#22238;&#24402;&#20989;&#25968;&#65292;$V^m$&#24403;$m \to + \infty$&#26102;&#25910;&#25947;&#21040;&#25671;&#25670;&#23454;&#38469;&#20215;&#26684;$V$&#12290;&#24403;&#22238;&#24402;&#20989;&#25968;&#34987;&#31070;&#32463;&#32593;&#32476;&#26367;&#20195;&#26102;&#65292;&#20063;&#35777;&#26126;&#20102;&#31867;&#20284;&#30340;&#32467;&#26524;&#12290;&#23545;&#20110;&#36825;&#20004;&#31181;&#26041;&#27861;&#65288;&#26368;&#23567;&#20108;&#20056;&#25110;&#31070;&#32463;&#32593;&#32476;&#65289;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#31532;&#20108;&#32423;&#21035;&#30340;&#36924;&#36817;&#12290;
&lt;/p&gt;
&lt;p&gt;
Least Squares regression was first introduced for the pricing of American-style options, but it has since been expanded to include swing options pricing. The swing options price may be viewed as a solution to a Backward Dynamic Programming Principle, which involves a conditional expectation known as the continuation value. The approximation of the continuation value using least squares regression involves two levels of approximation. First, the continuation value is replaced by an orthogonal projection over a subspace spanned by a finite set of $m$ squared-integrable functions (regression functions) yielding a first approximation $V^m$ of the swing value function. In this paper, we prove that, with well-chosen regression functions, $V^m$ converges to the swing actual price $V$ as $m \to + \infty$. A similar result is proved when the regression functions are replaced by neural networks. For both methods (least squares or neural networks), we analyze the second level of approximation inv
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#22871;&#25351;&#26631;&#20307;&#31995;&#26469;&#35780;&#20272;&#20449;&#24687;&#19981;&#23545;&#31216;&#32972;&#26223;&#19979;&#35777;&#21048;&#24066;&#22330;&#30340;&#32489;&#25928;&#65292;&#20026;&#35777;&#21048;&#24066;&#22330;&#21457;&#23637;&#25552;&#20379;&#20102;&#26377;&#25928;&#30340;&#25919;&#31574;&#65292;&#24182;&#36890;&#36807;&#23545;&#20420;&#32599;&#26031;&#35777;&#21048;&#24066;&#22330;&#30340;&#26696;&#20363;&#30740;&#31350;&#65292;&#25552;&#20379;&#20102;&#19968;&#20010;&#35780;&#20272;&#35777;&#21048;&#24066;&#22330;&#32489;&#25928;&#30340;&#21407;&#22987;&#35780;&#20998;&#26631;&#20934;&#12290;</title><link>http://arxiv.org/abs/2307.04140</link><description>&lt;p&gt;
&#20449;&#24687;&#19981;&#23545;&#31216;&#32972;&#26223;&#19979;&#30340;&#35777;&#21048;&#24066;&#22330;&#21160;&#24577;&#65306;&#21457;&#23637;&#26032;&#20852;&#35777;&#21048;&#24066;&#22330;&#30340;&#26041;&#27861;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Dynamics of the securities market in the information asymmetry context: developing a methodology for emerging securities markets. (arXiv:2307.04140v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04140
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#22871;&#25351;&#26631;&#20307;&#31995;&#26469;&#35780;&#20272;&#20449;&#24687;&#19981;&#23545;&#31216;&#32972;&#26223;&#19979;&#35777;&#21048;&#24066;&#22330;&#30340;&#32489;&#25928;&#65292;&#20026;&#35777;&#21048;&#24066;&#22330;&#21457;&#23637;&#25552;&#20379;&#20102;&#26377;&#25928;&#30340;&#25919;&#31574;&#65292;&#24182;&#36890;&#36807;&#23545;&#20420;&#32599;&#26031;&#35777;&#21048;&#24066;&#22330;&#30340;&#26696;&#20363;&#30740;&#31350;&#65292;&#25552;&#20379;&#20102;&#19968;&#20010;&#35780;&#20272;&#35777;&#21048;&#24066;&#22330;&#32489;&#25928;&#30340;&#21407;&#22987;&#35780;&#20998;&#26631;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21457;&#23637;&#19968;&#20010;&#21453;&#26144;&#35777;&#21048;&#24066;&#22330;&#23653;&#34892;&#20851;&#38190;&#21151;&#33021;&#31243;&#24230;&#30340;&#25351;&#26631;&#20307;&#31995;&#23545;&#20110;&#35780;&#20272;&#20854;&#21457;&#23637;&#27700;&#24179;&#33267;&#20851;&#37325;&#35201;&#12290;&#22312;&#20449;&#24687;&#19981;&#23545;&#31216;&#30340;&#26465;&#20214;&#19979;&#65292;&#23427;&#36824;&#21487;&#20197;&#25552;&#20379;&#26377;&#25928;&#30340;&#35777;&#21048;&#24066;&#22330;&#21457;&#23637;&#25919;&#31574;&#12290;&#26412;&#25991;&#26088;&#22312;&#21457;&#23637;&#19968;&#22871;&#25351;&#26631;&#26469;&#35780;&#20272;&#35777;&#21048;&#24066;&#22330;&#30340;&#32489;&#25928;&#65292;&#29305;&#21035;&#26159;&#22312;&#20449;&#24687;&#19981;&#23545;&#31216;&#30340;&#32972;&#26223;&#19979;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#36873;&#25321;&#20102;&#20420;&#32599;&#26031;&#35777;&#21048;&#24066;&#22330;&#20316;&#20026;&#20449;&#24687;&#19981;&#23545;&#31216;&#32972;&#26223;&#30340;&#26696;&#20363;&#65292;&#19982;&#20854;&#20182;&#21518;&#33487;&#32852;&#22269;&#23478;&#36827;&#34892;&#27604;&#36739;&#65292;&#35843;&#26597;&#20854;&#22312;&#23653;&#34892;&#20851;&#38190;&#21151;&#33021;&#26041;&#38754;&#30340;&#25104;&#21151;&#21644;&#22833;&#36133;&#12290;&#22312;&#27492;&#22522;&#30784;&#19978;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#30740;&#31350;&#20551;&#35774;&#65292;&#24182;&#37319;&#29992;&#19968;&#31181;&#29702;&#35770;&#30740;&#31350;&#26041;&#27861;&#65292;&#26681;&#25454;&#24066;&#22330;&#29702;&#35770;&#27169;&#22411;&#20316;&#20026;&#26816;&#39564;&#20551;&#35774;&#30340;&#26631;&#20934;&#12290;&#30740;&#31350;&#32467;&#26524;&#25552;&#20379;&#20102;&#19968;&#20010;&#35780;&#20272;&#35777;&#21048;&#24066;&#22330;&#32489;&#25928;&#30340;&#21407;&#22987;&#35780;&#20998;&#26631;&#20934;&#12290;&#30740;&#31350;&#32467;&#26524;&#36824;&#26377;&#21161;&#20110;&#20174;&#19994;&#20154;&#21592;&#30340;&#20915;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;
Developing a system of indicators that reflects the degree to which the securities market fulfils its key functions, is essential to assess the level of its development. In the conditions of asymmetric information it can also provide effective policies for securities market development. This paper is aimed to develop a set of indicators to assess the securities market performance, especially in the asymmetric information context. To this goal, we selected the Russian securities market as a case of asymmetric information context, in comparison with other post-Soviet countries, to investigate its success and failure in fulfilling its key functions. Regarding this, we developed research hypotheses and we conducted a normative research method, based on an ideal model of market functioning that is used as a criterion for testing the hypotheses. The results offer an original scale for assessing the performance of securities market of its functions. The findings also help practitioners with e
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#24052;&#27463;&#21033;&#23572;&#24066;&#22330;&#27169;&#22411;&#20869;&#30340;&#36164;&#20135;&#23450;&#20215;&#21160;&#24577;&#65292;&#37325;&#28857;&#38416;&#36848;&#20102;&#39118;&#38505;&#36164;&#20135;&#20215;&#26684;&#21160;&#24577;&#30340;&#34920;&#31034;&#21644;&#26080;&#39118;&#38505;&#36164;&#20135;&#30340;&#23450;&#20041;&#12290;</title><link>http://arxiv.org/abs/2307.04059</link><description>&lt;p&gt;
&#22312;&#24052;&#27463;&#21033;&#23572;&#24066;&#22330;&#27169;&#22411;&#20013;&#25506;&#32034;&#21160;&#24577;&#36164;&#20135;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
Exploring Dynamic Asset Pricing within Bachelier Market Model. (arXiv:2307.04059v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04059
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#24052;&#27463;&#21033;&#23572;&#24066;&#22330;&#27169;&#22411;&#20869;&#30340;&#36164;&#20135;&#23450;&#20215;&#21160;&#24577;&#65292;&#37325;&#28857;&#38416;&#36848;&#20102;&#39118;&#38505;&#36164;&#20135;&#20215;&#26684;&#21160;&#24577;&#30340;&#34920;&#31034;&#21644;&#26080;&#39118;&#38505;&#36164;&#20135;&#30340;&#23450;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#28145;&#20837;&#25506;&#35752;&#20102;&#24052;&#27463;&#21033;&#23572;&#24066;&#22330;&#27169;&#22411;&#20869;&#30340;&#36164;&#20135;&#23450;&#20215;&#21160;&#24577;&#65292;&#38416;&#36848;&#20102;&#39118;&#38505;&#36164;&#20135;&#20215;&#26684;&#21160;&#24577;&#30340;&#34920;&#31034;&#20197;&#21450;&#26080;&#39118;&#38505;&#36164;&#20135;&#30340;&#23450;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper delves into the dynamics of asset pricing within Bachelier market model, elucidating the representation of risky asset price dynamics and the definition of riskless assets.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26377;&#26102;&#38388;&#38480;&#21046;&#30340;&#20803;&#21551;&#21457;&#24335;&#31639;&#27861;&#29992;&#20110;&#21463;&#22522;&#25968;&#32422;&#26463;&#30340;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#65292;&#20197;&#35299;&#20915;&#29616;&#26377;&#30740;&#31350;&#20013;&#35745;&#31639;&#26102;&#38388;&#19981;&#21463;&#38480;&#21046;&#23548;&#33268;&#32467;&#26524;&#26080;&#27861;&#27604;&#36739;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2307.04045</link><description>&lt;p&gt;
&#26377;&#26102;&#38388;&#38480;&#21046;&#30340;&#20803;&#21551;&#21457;&#24335;&#31639;&#27861;&#29992;&#20110;&#21463;&#22522;&#25968;&#32422;&#26463;&#30340;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
Time-limited Metaheuristics for Cardinality-constrained Portfolio Optimisation. (arXiv:2307.04045v1 [cs.CE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04045
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26377;&#26102;&#38388;&#38480;&#21046;&#30340;&#20803;&#21551;&#21457;&#24335;&#31639;&#27861;&#29992;&#20110;&#21463;&#22522;&#25968;&#32422;&#26463;&#30340;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#65292;&#20197;&#35299;&#20915;&#29616;&#26377;&#30740;&#31350;&#20013;&#35745;&#31639;&#26102;&#38388;&#19981;&#21463;&#38480;&#21046;&#23548;&#33268;&#32467;&#26524;&#26080;&#27861;&#27604;&#36739;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37329;&#34701;&#25237;&#36164;&#32452;&#21512;&#21253;&#21547;&#20197;&#19968;&#23450;&#39118;&#38505;&#27700;&#24179;&#25552;&#20379;&#22238;&#25253;&#30340;&#36164;&#20135;&#12290;&#20026;&#20102;&#26368;&#22823;&#21270;&#22238;&#25253;&#25110;&#26368;&#23567;&#21270;&#39118;&#38505;&#65292;&#24517;&#39035;&#20248;&#21270;&#25237;&#36164;&#32452;&#21512; - &#25214;&#21040;&#26368;&#20339;&#36164;&#20135;&#25968;&#37327;&#30340;&#29702;&#24819;&#32452;&#21512;&#12290;&#21487;&#33021;&#30340;&#32452;&#21512;&#25968;&#37327;&#38750;&#24120;&#22810;&#12290;&#27492;&#22806;&#65292;&#20026;&#20102;&#20351;&#38382;&#39064;&#21464;&#24471;&#29616;&#23454;&#65292;&#21487;&#20197;&#23545;&#25237;&#36164;&#32452;&#21512;&#20013;&#25345;&#26377;&#30340;&#36164;&#20135;&#25968;&#37327;&#21644;&#21487;&#20197;&#20998;&#37197;&#32473;&#26576;&#20010;&#36164;&#20135;&#30340;&#25237;&#36164;&#32452;&#21512;&#26368;&#22823;&#27604;&#20363;&#26045;&#21152;&#32422;&#26463;&#12290;&#36825;&#20010;&#38382;&#39064;&#26080;&#27861;&#36890;&#36807;&#20108;&#27425;&#35268;&#21010;&#27714;&#35299;&#65292;&#21363;&#26080;&#27861;&#35745;&#31639;&#20986;&#26368;&#20248;&#35299;&#12290;&#19968;&#32452;&#31216;&#20026;&#20803;&#21551;&#21457;&#24335;&#31639;&#27861;&#30340;&#31639;&#27861;&#21487;&#20197;&#22312;&#23454;&#38469;&#35745;&#31639;&#26102;&#38388;&#20869;&#25214;&#21040;&#25509;&#36817;&#26368;&#20248;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#36825;&#20123;&#31639;&#27861;&#24050;&#25104;&#21151;&#24212;&#29992;&#20110;&#21463;&#32422;&#26463;&#30340;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#12290;&#28982;&#32780;&#65292;&#22312;&#36807;&#21435;&#30340;&#30740;&#31350;&#20013;&#65292;&#20803;&#21551;&#21457;&#24335;&#31639;&#27861;&#30340;&#35745;&#31639;&#26102;&#38388;&#27809;&#26377;&#38480;&#21046;&#65292;&#36825;&#24847;&#21619;&#30528;&#32467;&#26524;&#22312;&#36136;&#37327;&#21644;&#35745;&#31639;&#26102;&#38388;&#19978;&#23384;&#22312;&#24046;&#24322;&#65292;&#38590;&#20197;&#36827;&#34892;&#27604;&#36739;&#12290;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#19981;&#21516;&#30340;&#26041;&#27861;&#65292;
&lt;/p&gt;
&lt;p&gt;
A financial portfolio contains assets that offer a return with a certain level of risk. To maximise returns or minimise risk, the portfolio must be optimised - the ideal combination of optimal quantities of assets must be found. The number of possible combinations is vast. Furthermore, to make the problem realistic, constraints can be imposed on the number of assets held in the portfolio and the maximum proportion of the portfolio that can be allocated to an asset. This problem is unsolvable using quadratic programming, which means that the optimal solution cannot be calculated. A group of algorithms, called metaheuristics, can find near-optimal solutions in a practical computing time. These algorithms have been successfully used in constrained portfolio optimisation. However, in past studies the computation time of metaheuristics is not limited, which means that the results differ in both quality and computation time, and cannot be easily compared. This study proposes a different way 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35780;&#20272;&#20102;dYdX&#30340;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#28608;&#21169;&#35745;&#21010;&#65292;&#24182;&#25552;&#20986;&#26356;&#26032;&#20844;&#24335;&#20197;&#40723;&#21169;&#26356;&#27963;&#36291;&#21644;&#39640;&#25928;&#30340;&#27969;&#21160;&#24615;&#65292;&#25913;&#21892;&#20132;&#26131;&#20307;&#39564;&#30340;&#24314;&#35758;&#12290;</title><link>http://arxiv.org/abs/2307.03935</link><description>&lt;p&gt;
dYdX&#65306;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#28608;&#21169;&#35745;&#21010;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
dYdX: Liquidity Providers' Incentive Programme Review. (arXiv:2307.03935v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.03935
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35780;&#20272;&#20102;dYdX&#30340;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#28608;&#21169;&#35745;&#21010;&#65292;&#24182;&#25552;&#20986;&#26356;&#26032;&#20844;&#24335;&#20197;&#40723;&#21169;&#26356;&#27963;&#36291;&#21644;&#39640;&#25928;&#30340;&#27969;&#21160;&#24615;&#65292;&#25913;&#21892;&#20132;&#26131;&#20307;&#39564;&#30340;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30446;&#21069;&#65292;&#36890;&#36807;dYdX&#30340;LP Incentive&#35745;&#21010;&#65292;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#34987;&#28608;&#21169;&#25552;&#20379;&#27969;&#21160;&#24615;&#12290;&#26681;&#25454;makerVolume&#12289;depths&#21644;spreads&#31561;&#21508;&#31181;&#21442;&#25968;&#65292;&#20182;&#20204;&#26681;&#25454;&#33258;&#24049;&#30340;&#27963;&#21160;&#24471;&#21040;&#30456;&#24212;&#30340;&#22870;&#21169;&#12290;&#37492;&#20110;BTC&#21644;ETH&#24066;&#22330;&#30340;&#25104;&#29087;&#24230;&#65292;&#20197;&#21450;&#20854;&#20182;&#20139;&#26377;&#19968;&#23450;&#27969;&#21160;&#24615;&#30340;&#23665;&#23528;&#24065;&#65292;&#26412;&#25991;&#26088;&#22312;&#26356;&#26032;&#20844;&#24335;&#65292;&#20197;&#40723;&#21169;&#26356;&#27963;&#36291;&#21644;&#39640;&#25928;&#30340;&#27969;&#21160;&#24615;&#65292;&#25913;&#21892;&#25972;&#20307;&#20132;&#26131;&#20307;&#39564;&#12290;&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#39318;&#20808;&#25552;&#20379;&#20102;&#23545;&#20215;&#24046;&#31649;&#29702;&#30340;&#22522;&#30784;&#29702;&#35299;&#65292;&#28982;&#21518;&#20171;&#32461;&#20102;&#21508;&#31181;&#25351;&#26631;&#21644;&#26465;&#20214;&#30340;&#26041;&#27861;&#35770;&#12290;&#36825;&#21253;&#25324;&#25353;&#20998;&#38047;&#38388;&#38548;&#25910;&#38598;&#35746;&#21333;&#31807;&#65292;&#24182;&#22522;&#20110;&#21382;&#21490;&#20132;&#26131;&#37325;&#24314;&#28145;&#24230;&#20197;&#24314;&#31435;&#19978;&#38480;&#12290;&#26368;&#21518;&#65292;&#25105;&#25552;&#20379;&#20102;&#26356;&#26032;maxSpread&#21442;&#25968;&#21644;&#25913;&#36827;&#29616;&#26377;&#24066;&#22330;&#32467;&#26500;&#30340;&#26367;&#20195;&#26426;&#21046;/&#35299;&#20915;&#26041;&#26696;&#30340;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;
Liquidity providers are currently incentivised to provide liquidity through the LP Incentives Programme on dYdX. Based on the various parameters makerVolume, depths and spreads, they are rewarded accordingly based on their activities. Given the maturity of the BTC and ETH markets, alongside other altcoins which enjoy a consistent amount of liquidity, this paper aims to update the formula to encourage more active and efficient liquidity, improving the overall trading experience. In this research, I begin by providing a basic understanding of spread management, before introducing the methodology with the various metrics and conditions. This includes gathering orderbooks on a minute interval and reconstructing the depths based on historical trades to establish an upper bound. I end off by providing recommendations to update the maxSpread parameter and alternative mechanisms/solutions to improve the existing market structures.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#24555;&#36895;&#30340;&#32463;&#39564;&#22330;&#26223;&#25552;&#21462;&#31639;&#27861;&#65292;&#19968;&#31181;&#35782;&#21035;&#20043;&#21069;&#26410;&#35266;&#23519;&#21040;&#30340;&#22330;&#26223;&#24182;&#25552;&#20379;&#22330;&#26223;&#30340;&#21327;&#26041;&#24046;&#30697;&#38453;&#34920;&#31034;&#65292;&#21478;&#19968;&#31181;&#20174;&#24050;&#23454;&#29616;&#30340;&#19990;&#30028;&#29366;&#24577;&#20013;&#36873;&#25321;&#37325;&#35201;&#30340;&#25968;&#25454;&#28857;&#65292;&#24182;&#19982;&#39640;&#38454;&#26679;&#26412;&#30697;&#19968;&#33268;&#65292;&#36825;&#20123;&#31639;&#27861;&#35745;&#31639;&#25928;&#29575;&#39640;&#19988;&#36866;&#29992;&#20110;&#19968;&#33268;&#30340;&#22522;&#20110;&#22330;&#26223;&#30340;&#24314;&#27169;&#21644;&#39640;&#32500;&#25968;&#20540;&#31215;&#20998;&#12290;</title><link>http://arxiv.org/abs/2307.03927</link><description>&lt;p&gt;
&#24555;&#36895;&#32463;&#39564;&#22330;&#26223;
&lt;/p&gt;
&lt;p&gt;
Fast Empirical Scenarios. (arXiv:2307.03927v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.03927
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#24555;&#36895;&#30340;&#32463;&#39564;&#22330;&#26223;&#25552;&#21462;&#31639;&#27861;&#65292;&#19968;&#31181;&#35782;&#21035;&#20043;&#21069;&#26410;&#35266;&#23519;&#21040;&#30340;&#22330;&#26223;&#24182;&#25552;&#20379;&#22330;&#26223;&#30340;&#21327;&#26041;&#24046;&#30697;&#38453;&#34920;&#31034;&#65292;&#21478;&#19968;&#31181;&#20174;&#24050;&#23454;&#29616;&#30340;&#19990;&#30028;&#29366;&#24577;&#20013;&#36873;&#25321;&#37325;&#35201;&#30340;&#25968;&#25454;&#28857;&#65292;&#24182;&#19982;&#39640;&#38454;&#26679;&#26412;&#30697;&#19968;&#33268;&#65292;&#36825;&#20123;&#31639;&#27861;&#35745;&#31639;&#25928;&#29575;&#39640;&#19988;&#36866;&#29992;&#20110;&#19968;&#33268;&#30340;&#22522;&#20110;&#22330;&#26223;&#30340;&#24314;&#27169;&#21644;&#39640;&#32500;&#25968;&#20540;&#31215;&#20998;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24076;&#26395;&#20174;&#22823;&#22411;&#21644;&#39640;&#32500;&#38754;&#26495;&#25968;&#25454;&#20013;&#25552;&#21462;&#19968;&#23567;&#37096;&#20998;&#19982;&#26679;&#26412;&#30697;&#19968;&#33268;&#30340;&#20195;&#34920;&#24615;&#22330;&#26223;&#12290;&#22312;&#20004;&#31181;&#26032;&#31639;&#27861;&#20013;&#65292;&#31532;&#19968;&#31181;&#31639;&#27861;&#35782;&#21035;&#20043;&#21069;&#26410;&#35266;&#23519;&#21040;&#30340;&#22330;&#26223;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#31181;&#22522;&#20110;&#22330;&#26223;&#30340;&#21327;&#26041;&#24046;&#30697;&#38453;&#34920;&#31034;&#12290;&#31532;&#20108;&#31181;&#31639;&#27861;&#20174;&#24050;&#23454;&#29616;&#30340;&#19990;&#30028;&#29366;&#24577;&#20013;&#36873;&#25321;&#37325;&#35201;&#30340;&#25968;&#25454;&#28857;&#65292;&#24182;&#19982;&#39640;&#38454;&#26679;&#26412;&#30697;&#20449;&#24687;&#19968;&#33268;&#12290;&#36825;&#20004;&#31181;&#31639;&#27861;&#35745;&#31639;&#25928;&#29575;&#39640;&#65292;&#24182;&#21487;&#29992;&#20110;&#19968;&#33268;&#30340;&#22522;&#20110;&#22330;&#26223;&#30340;&#24314;&#27169;&#21644;&#39640;&#32500;&#25968;&#20540;&#31215;&#20998;&#12290;&#24191;&#27867;&#30340;&#25968;&#20540;&#22522;&#20934;&#27979;&#35797;&#30740;&#31350;&#21644;&#22312;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#20013;&#30340;&#24212;&#29992;&#25903;&#25345;&#25152;&#25552;&#20986;&#30340;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
We seek to extract a small number of representative scenarios from large and high-dimensional panel data that are consistent with sample moments. Among two novel algorithms, the first identifies scenarios that have not been observed before, and comes with a scenario-based representation of covariance matrices. The second proposal picks important data points from states of the world that have already realized, and are consistent with higher-order sample moment information. Both algorithms are efficient to compute, and lend themselves to consistent scenario-based modeling and high-dimensional numerical integration. Extensive numerical benchmarking studies and an application in portfolio optimization favor the proposed algorithms.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#30740;&#31350;&#19977;&#22823;&#27773;&#36710;&#21046;&#36896;&#21830;&#22312;&#20840;&#29699;&#19981;&#21516;&#22320;&#21306;&#30340;&#30005;&#21160;&#21270;&#20135;&#21697;&#31995;&#21015;&#36873;&#25321;&#65292;&#21457;&#29616;&#21306;&#22495;&#38388;&#23384;&#22312;&#36710;&#22411;&#20559;&#22909;&#24046;&#24322;&#65292;&#24182;&#19988;&#29305;&#26031;&#25289;&#22312;BEV&#24066;&#22330;&#30340;&#20027;&#23548;&#22320;&#20301;&#24433;&#21709;&#20102;&#30005;&#27744;&#21270;&#23398;&#30340;&#36873;&#25321;&#12290;</title><link>http://arxiv.org/abs/2307.03808</link><description>&lt;p&gt;
&#30005;&#21160;&#36731;&#22411;&#36710;&#36742;&#21046;&#36896;&#21830;&#30340;&#21306;&#22495;&#24615;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
A Regional Analysis of Electric LDV Portfolio Choices by Vehicle Manufacturers. (arXiv:2307.03808v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.03808
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#30740;&#31350;&#19977;&#22823;&#27773;&#36710;&#21046;&#36896;&#21830;&#22312;&#20840;&#29699;&#19981;&#21516;&#22320;&#21306;&#30340;&#30005;&#21160;&#21270;&#20135;&#21697;&#31995;&#21015;&#36873;&#25321;&#65292;&#21457;&#29616;&#21306;&#22495;&#38388;&#23384;&#22312;&#36710;&#22411;&#20559;&#22909;&#24046;&#24322;&#65292;&#24182;&#19988;&#29305;&#26031;&#25289;&#22312;BEV&#24066;&#22330;&#30340;&#20027;&#23548;&#22320;&#20301;&#24433;&#21709;&#20102;&#30005;&#27744;&#21270;&#23398;&#30340;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
2022&#24180;&#65292;&#20840;&#29699;&#36731;&#22411;&#30005;&#21160;&#36710;&#38144;&#37327;&#36229;&#36807;1050&#19975;&#36742;&#65292;&#21516;&#27604;&#22686;&#38271;55&#65285;&#65292;&#20294;&#36825;&#20123;&#36235;&#21183;&#22312;&#19981;&#21516;&#22320;&#21306;&#26377;&#25152;&#19981;&#21516;&#12290;&#23613;&#31649;&#38144;&#37327;&#22686;&#38271;&#24378;&#21170;&#65292;&#20294;&#21069;&#26399;&#36141;&#20080;&#20215;&#26684;&#20173;&#28982;&#26159;&#28040;&#36153;&#32773;&#38754;&#20020;&#30340;&#25361;&#25112;&#65292;&#22240;&#27492;&#27773;&#36710;&#21046;&#36896;&#21830;&#20250;&#20570;&#20986;&#25216;&#26415;&#36873;&#25321;&#20197;&#28385;&#36275;&#24066;&#22330;&#38656;&#27714;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#19977;&#22823;&#27773;&#36710;&#21046;&#36896;&#21830;&#22312;&#27431;&#27954;&#12289;&#32654;&#27954;&#12289;&#20122;&#22826;&#22320;&#21306;&#21644;&#38750;&#27954;/&#20013;&#19996;&#22320;&#21306;&#19981;&#21516;&#22320;&#21306;&#30340;&#30005;&#21160;&#21270;&#20135;&#21697;&#31995;&#21015;&#36873;&#25321;&#12290;&#20998;&#26512;&#37325;&#28857;&#20851;&#27880;&#30005;&#27744;&#30005;&#21160;&#36710;&#65288;BEV&#65289;&#21644;&#25554;&#30005;&#28151;&#21512;&#21160;&#21147;&#36710;&#65288;PHEV&#65289;&#30340;&#20027;&#23548;&#24066;&#22330;&#36235;&#21183;&#65292;&#20197;&#21450;&#30005;&#27744;&#21270;&#23398;&#36873;&#25321;&#12290;&#21306;&#22495;&#24046;&#24322;&#34920;&#26126;SUV&#25104;&#20026;BEV&#21644;PHEV&#30340;&#20027;&#27969;&#36235;&#21183;&#12290;&#29305;&#26031;&#25289;&#22312;BEV&#24066;&#22330;&#30340;&#20027;&#23548;&#22320;&#20301;&#24433;&#21709;&#30528;&#30005;&#27744;&#21270;&#23398;&#36873;&#25321;&#12290;&#22312;&#27431;&#27954;&#21644;&#32654;&#27954;&#65292;BEV&#30340;&#24179;&#22343;&#30005;&#27744;&#23481;&#37327;&#20445;&#25345;&#30456;&#20284;&#65292;&#32780;&#22312;&#20122;&#22826;&#22320;&#21306;&#21644;&#38750;&#27954;/&#20013;&#19996;&#22320;&#21306;&#36739;&#20302;&#12290;
&lt;/p&gt;
&lt;p&gt;
Global light duty electric vehicle (EV) sales exceeded 10.5 million units in 2022, with a year-on-year growth of 55%, but these trends differ regionally. Despite the robust growth, upfront purchase price remains a challenge for consumers in different regions, and thus, OEMs make technology choices to respond to market needs. This paper examines the electrification portfolio choices of three major automotive manufacturers (OEMs) in different regions of the world, including Europe, Americas, Asia Pacific, and Africa/Middle-East. The analysis focuses on trends in dominant segments for Battery Electric Vehicles (BEV) and Plug-in Hybrid Electric Vehicles (PHEV), as well as battery chemistry choices. Regional differences show a trend towards SUVs for both BEVs and PHEVs. Tesla's dominance in the BEV market influences battery chemistry choices. Average battery sizes for BEVs remain similar in Europe and Americas, but lower in Asia Pacific and Africa/Middle East.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#22810;&#26399;&#20581;&#22766;&#22343;&#20540;&#26041;&#24046;&#20248;&#21270;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#30495;&#23454;&#27010;&#29575;&#27979;&#24230;&#32422;&#26463;&#22312;&#20197;&#32463;&#39564;&#27010;&#29575;&#27979;&#24230;&#20026;&#20013;&#24515;&#30340;Wasserstein&#29699;&#20869;&#65292;&#26681;&#25454;&#32463;&#39564;&#25968;&#25454;&#30830;&#23450;&#29699;&#30340;&#21322;&#24452;&#12290;&#22312;&#32654;&#22269;&#32929;&#24066;&#30340;&#25968;&#20540;&#27169;&#25311;&#20013;&#65292;&#35813;&#26041;&#27861;&#34920;&#29616;&#20248;&#24322;&#12290;</title><link>http://arxiv.org/abs/2306.16681</link><description>&lt;p&gt;
&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#22810;&#26399;&#20581;&#22766;&#22343;&#20540;&#26041;&#24046;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
Data-driven Multiperiod Robust Mean-Variance Optimization. (arXiv:2306.16681v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.16681
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#22810;&#26399;&#20581;&#22766;&#22343;&#20540;&#26041;&#24046;&#20248;&#21270;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#30495;&#23454;&#27010;&#29575;&#27979;&#24230;&#32422;&#26463;&#22312;&#20197;&#32463;&#39564;&#27010;&#29575;&#27979;&#24230;&#20026;&#20013;&#24515;&#30340;Wasserstein&#29699;&#20869;&#65292;&#26681;&#25454;&#32463;&#39564;&#25968;&#25454;&#30830;&#23450;&#29699;&#30340;&#21322;&#24452;&#12290;&#22312;&#32654;&#22269;&#32929;&#24066;&#30340;&#25968;&#20540;&#27169;&#25311;&#20013;&#65292;&#35813;&#26041;&#27861;&#34920;&#29616;&#20248;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22312;&#22810;&#26399;&#25237;&#36164;&#32452;&#21512;&#36873;&#25321;&#20013;&#30740;&#31350;&#20102;&#20581;&#22766;&#30340;&#22343;&#20540;&#26041;&#24046;&#20248;&#21270;&#38382;&#39064;&#65292;&#20801;&#35768;&#30495;&#23454;&#27010;&#29575;&#27979;&#24230;&#20301;&#20110;&#20197;&#32463;&#39564;&#27010;&#29575;&#27979;&#24230;&#20026;&#20013;&#24515;&#30340;Wasserstein&#29699;&#20869;&#12290;&#26681;&#25454;&#32622;&#20449;&#27700;&#24179;&#65292;Wasserstein&#29699;&#30340;&#21322;&#24452;&#30001;&#32463;&#39564;&#25968;&#25454;&#30830;&#23450;&#12290;&#19982;&#20854;&#20182;&#27969;&#34892;&#31574;&#30053;&#30456;&#27604;&#65292;&#22312;&#32654;&#22269;&#32929;&#24066;&#30340;&#25968;&#20540;&#27169;&#25311;&#32467;&#26524;&#34920;&#26126;&#20102;&#24456;&#22909;&#30340;&#21069;&#26223;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study robust mean-variance optimization in multiperiod portfolio selection by allowing the true probability measure to be inside a Wasserstein ball centered at the empirical probability measure. Given the confidence level, the radius of the Wasserstein ball is determined by the empirical data. The numerical simulations of the US stock market provide a promising result compared to other popular strategies.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#20174;&#20132;&#26131;&#37327;-&#20215;&#26684;&#27010;&#29575;&#27874;&#21160;&#26041;&#31243;&#20013;&#25552;&#21462;&#20102;&#19968;&#20010;&#26222;&#36941;&#35268;&#24459;&#65292;&#23558;&#20854;&#24212;&#29992;&#20110;&#22797;&#26434;&#37327;&#23376;&#31995;&#32479;&#65292;&#24182;&#25552;&#20986;&#20102;&#20114;&#21160;&#19968;&#33268;&#24615;&#32416;&#32544;&#29702;&#35770;&#65292;&#35299;&#37322;&#26234;&#33021;&#26679;&#31890;&#23376;&#30340;&#34892;&#20026;&#12290;</title><link>http://arxiv.org/abs/2306.15554</link><description>&lt;p&gt;
&#20114;&#21160;&#19968;&#33268;&#24615;&#32416;&#32544;&#29702;&#35770;
&lt;/p&gt;
&lt;p&gt;
A Theory of Interactively Coherent Entanglement for Intelligence-Like Particles. (arXiv:2306.15554v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.15554
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20174;&#20132;&#26131;&#37327;-&#20215;&#26684;&#27010;&#29575;&#27874;&#21160;&#26041;&#31243;&#20013;&#25552;&#21462;&#20102;&#19968;&#20010;&#26222;&#36941;&#35268;&#24459;&#65292;&#23558;&#20854;&#24212;&#29992;&#20110;&#22797;&#26434;&#37327;&#23376;&#31995;&#32479;&#65292;&#24182;&#25552;&#20986;&#20102;&#20114;&#21160;&#19968;&#33268;&#24615;&#32416;&#32544;&#29702;&#35770;&#65292;&#35299;&#37322;&#26234;&#33021;&#26679;&#31890;&#23376;&#30340;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22797;&#26434;&#36866;&#24212;&#24615;&#23398;&#20064;&#26159;&#26234;&#33021;&#30340;&#65292;&#24182;&#22312;&#29983;&#21629;&#21644;&#38750;&#29983;&#21629;&#22797;&#26434;&#31995;&#32479;&#20013;&#21457;&#25381;&#20316;&#29992;&#12290;&#19968;&#20010;&#22797;&#26434;&#31995;&#32479;&#30001;&#35768;&#22810;&#30456;&#20114;&#20316;&#29992;&#30340;&#20010;&#20307;&#25110;&#21333;&#20803;&#32452;&#25104;&#65292;&#23427;&#20204;&#22312;&#30456;&#20114;&#20316;&#29992;&#20013;&#26174;&#31034;&#20986;&#38544;&#34255;&#30340;&#27169;&#24335;&#65292;&#24182;&#24191;&#27867;&#20986;&#29616;&#22312;&#20960;&#20046;&#25152;&#26377;&#23398;&#31185;&#20013;&#65292;&#20174;&#33258;&#28982;&#31185;&#23398;&#21040;&#31038;&#20250;&#31185;&#23398;&#12290;&#36825;&#28608;&#21457;&#20102;&#31185;&#23398;&#23478;&#20204;&#25506;&#32034;&#22797;&#26434;&#31995;&#32479;&#24418;&#25104;&#26426;&#21046;&#30340;&#20852;&#36259;&#12290;&#28982;&#32780;&#65292;&#36825;&#26159;&#38750;&#24120;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#12290;&#26412;&#25991;&#20174;&#20132;&#26131;&#37327;-&#20215;&#26684;&#27010;&#29575;&#27874;&#21160;&#26041;&#31243;&#20013;&#25552;&#21462;&#20102;&#22797;&#26434;&#31995;&#32479;&#20013;&#30340;&#20114;&#21160;&#19968;&#33268;&#24615;&#30340;&#26222;&#36941;&#35268;&#24459;&#25110;&#27861;&#21017;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#22797;&#26434;&#37327;&#23376;&#31995;&#32479;&#12290;&#23427;&#20551;&#35774;&#31890;&#23376;&#21487;&#20197;&#22312;&#21152;&#24378;&#22352;&#26631;&#20013;&#20855;&#26377;&#22797;&#26434;&#36866;&#24212;&#24615;&#23398;&#20064;&#25110;&#26234;&#33021;&#26679;&#24615;&#36136;&#65292;&#24182;&#23558;&#37329;&#34701;&#24066;&#22330;&#20132;&#26131;&#32773;&#30340;&#22797;&#26434;&#36866;&#24212;&#24615;&#23398;&#20064;&#24310;&#20280;&#21040;&#37327;&#23376;&#29289;&#29702;&#20013;&#30340;&#38750;&#29983;&#21629;&#31890;&#23376;&#12290;&#22312;&#36825;&#20123;&#20551;&#35774;&#30340;&#22522;&#30784;&#19978;&#65292;&#20316;&#32773;&#25552;&#20986;&#20102;&#19968;&#31181;&#20114;&#21160;&#19968;&#33268;&#24615;&#32416;&#32544;&#29702;&#35770;&#65292;&#29992;&#20110;&#35299;&#37322;&#26234;&#33021;&#26679;&#31890;&#23376;&#30340;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;
Complex adaptive learning is intelligent and plays roles in living and non-living complex systems. A complex system comprises many interacting individuals or units, shows hidden patterns as they interact, and widely occurs in almost every discipline, from natural to social sciences. It stimulates scientists to explore the mechanism of complex systems formulation. However, it is very challenging. Here the authors extract a universal rule or a law for interactive coherence in complex systems from a trading volume-price probability wave equation and apply it to complex quantum systems as its application. It assumes that particles can have a complex adaptive learning- or intelligence-like property in a reinforced coordinate and extend complex adaptive learning of traders in the financial markets to that of non-living particles in quantum physics. With these assumptions, the authors propose a theory of interactively coherent entanglement for intelligence-like particles, attempting to explai
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#23545;&#27604;&#23398;&#20064;&#26041;&#27861;&#65292;&#26412;&#30740;&#31350;&#26500;&#24314;&#20102;&#19968;&#20010;&#33258;&#30417;&#30563;&#23398;&#20064;&#27169;&#22411;&#65292;&#29992;&#20110;&#23398;&#20064;&#20195;&#29702;&#24066;&#22330;&#35746;&#21333;&#30340;&#34920;&#31034;&#12290;&#36827;&#19968;&#27493;&#22320;&#65292;&#25105;&#20204;&#20351;&#29992;K&#22343;&#20540;&#32858;&#31867;&#31639;&#27861;&#23545;&#20195;&#29702;&#35746;&#21333;&#30340;&#23398;&#20064;&#34920;&#31034;&#21521;&#37327;&#36827;&#34892;&#32858;&#31867;&#65292;&#20197;&#30830;&#23450;&#27599;&#20010;&#31751;&#20013;&#30340;&#19981;&#21516;&#34892;&#20026;&#31867;&#22411;&#12290;</title><link>http://arxiv.org/abs/2306.05987</link><description>&lt;p&gt;
&#19968;&#31181;&#22522;&#20110;&#23545;&#27604;&#23398;&#20064;&#26041;&#27861;&#30340;&#20195;&#29702;&#24066;&#22330;&#35746;&#21333;&#34920;&#31034;
&lt;/p&gt;
&lt;p&gt;
Agent market orders representation through a contrastive learning approach. (arXiv:2306.05987v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.05987
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#23545;&#27604;&#23398;&#20064;&#26041;&#27861;&#65292;&#26412;&#30740;&#31350;&#26500;&#24314;&#20102;&#19968;&#20010;&#33258;&#30417;&#30563;&#23398;&#20064;&#27169;&#22411;&#65292;&#29992;&#20110;&#23398;&#20064;&#20195;&#29702;&#24066;&#22330;&#35746;&#21333;&#30340;&#34920;&#31034;&#12290;&#36827;&#19968;&#27493;&#22320;&#65292;&#25105;&#20204;&#20351;&#29992;K&#22343;&#20540;&#32858;&#31867;&#31639;&#27861;&#23545;&#20195;&#29702;&#35746;&#21333;&#30340;&#23398;&#20064;&#34920;&#31034;&#21521;&#37327;&#36827;&#34892;&#32858;&#31867;&#65292;&#20197;&#30830;&#23450;&#27599;&#20010;&#31751;&#20013;&#30340;&#19981;&#21516;&#34892;&#20026;&#31867;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#35775;&#38382;Euronext&#30340;CAC40&#25968;&#25454;&#20013;&#30340;&#26631;&#35760;&#35746;&#21333;&#65292;&#20998;&#26512;&#20195;&#29702;&#22312;&#24066;&#22330;&#20013;&#26681;&#25454;&#20854;&#19979;&#36798;&#30340;&#35746;&#21333;&#30340;&#34892;&#20026;&#12290;&#26412;&#30740;&#31350;&#26500;&#24314;&#20102;&#19968;&#20010;&#33258;&#30417;&#30563;&#23398;&#20064;&#27169;&#22411;&#65292;&#20351;&#29992;&#19977;&#20803;&#32452;&#25439;&#22833;&#26469;&#26377;&#25928;&#22320;&#23398;&#20064;&#20195;&#29702;&#24066;&#22330;&#35746;&#21333;&#30340;&#34920;&#31034;&#12290;&#36890;&#36807;&#33719;&#21462;&#36825;&#20010;&#23398;&#20064;&#34920;&#31034;&#65292;&#21508;&#31181;&#19979;&#28216;&#20219;&#21153;&#21464;&#24471;&#21487;&#34892;&#12290;&#26412;&#30740;&#31350;&#20351;&#29992;K&#22343;&#20540;&#32858;&#31867;&#31639;&#27861;&#23545;&#20195;&#29702;&#35746;&#21333;&#30340;&#23398;&#20064;&#34920;&#31034;&#21521;&#37327;&#36827;&#34892;&#32858;&#31867;&#65292;&#20197;&#30830;&#23450;&#27599;&#20010;&#31751;&#20013;&#30340;&#19981;&#21516;&#34892;&#20026;&#31867;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
Due to the access to the labeled orders on the CAC40 data from Euronext, we are able to analyse agents' behaviours in the market based on their placed orders. In this study, we construct a self-supervised learning model using triplet loss to effectively learn the representation of agent market orders. By acquiring this learned representation, various downstream tasks become feasible. In this work, we utilise the K-means clustering algorithm on the learned representation vectors of agent orders to identify distinct behaviour types within each cluster.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#31163;&#25955;&#20108;&#21449;&#26641;&#27169;&#22411;&#65292;&#38024;&#23545;&#20855;&#26377;&#38388;&#26029;&#36339;&#36291;&#29305;&#24449;&#30340;&#22522;&#30784;&#35777;&#21048;&#36827;&#34892;&#20538;&#26435;&#23450;&#20215;&#65292;&#26088;&#22312;&#21512;&#24182;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#21644;&#21160;&#24577;&#36164;&#20135;&#23450;&#20215;&#65292;&#33021;&#22815;&#25551;&#36848;&#20132;&#26131;&#32773;&#26410;&#26469;&#20215;&#26684;&#21464;&#21160;&#39044;&#26399;&#12290;</title><link>http://arxiv.org/abs/2304.02356</link><description>&lt;p&gt;
&#21512;&#24182;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#19982;&#21160;&#24577;&#36164;&#20135;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
Unifying Market Microstructure and Dynamic Asset Pricing. (arXiv:2304.02356v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.02356
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#31163;&#25955;&#20108;&#21449;&#26641;&#27169;&#22411;&#65292;&#38024;&#23545;&#20855;&#26377;&#38388;&#26029;&#36339;&#36291;&#29305;&#24449;&#30340;&#22522;&#30784;&#35777;&#21048;&#36827;&#34892;&#20538;&#26435;&#23450;&#20215;&#65292;&#26088;&#22312;&#21512;&#24182;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#21644;&#21160;&#24577;&#36164;&#20135;&#23450;&#20215;&#65292;&#33021;&#22815;&#25551;&#36848;&#20132;&#26131;&#32773;&#26410;&#26469;&#20215;&#26684;&#21464;&#21160;&#39044;&#26399;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#31181;&#38024;&#23545;&#20855;&#26377;&#38388;&#26029;&#36339;&#36291;&#29305;&#24449;&#30340;&#22522;&#30784;&#35777;&#21048;&#30340;&#31163;&#25955;&#20108;&#21449;&#26641;&#26469;&#23450;&#20215;&#20538;&#26435;&#12290;&#37329;&#34701;&#24066;&#22330;&#30340;&#31163;&#25955;&#24615;&#24847;&#21619;&#30528;&#19968;&#20010;&#36830;&#32493;&#27169;&#22411;&#26080;&#27861;&#27491;&#30830;&#22320;&#25551;&#36848;&#20132;&#26131;&#32773;&#23545;&#26410;&#26469;&#20215;&#26684;&#21464;&#21160;&#30340;&#39044;&#26399;&#12290;&#25152;&#25552;&#20986;&#30340;&#20108;&#21449;&#26641;&#21253;&#21547;&#20102;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#29702;&#35770;&#30340;&#32463;&#20856;&#27169;&#22411;&#20316;&#20026;&#29305;&#27530;&#24773;&#20917;&#12290;&#24403;&#20132;&#26131;&#20043;&#38388;&#30340;&#26102;&#38388;&#38388;&#38548;&#36235;&#36817;&#20110;&#38646;&#26102;&#65292;&#22522;&#30784;&#20215;&#26684;&#36807;&#31243;&#25910;&#25947;&#20110;&#32463;&#20856;&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this work, we introduce a discrete binary tree for pricing contingent claims with underlying securities that are characterized by discontinuity jumps. The discrete nature of financial markets means that a continuous model is unable to correctly describe the traders' expectations of future price variations. The proposed binary tree contains, as special cases, classical models of market microstructure theory. The underlying price process converges to the classical geometric Brownian motion as the time interval between trades approaches zero.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#20998;&#26512;&#20102;&#21152;&#25343;&#22823;&#24378;&#21046;&#23454;&#26045;&#23478;&#24237;&#21307;&#23398;&#20303;&#38498;&#21307;&#24072;&#35268;&#23450;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#24310;&#38271;&#20303;&#38498;&#21307;&#24072;&#22521;&#35757;&#26102;&#38388;&#21487;&#33021;&#23548;&#33268;&#23478;&#24237;&#21307;&#23398;&#20174;&#19994;&#32773;&#20379;&#24212;&#19979;&#38477;5%-10%&#12290;</title><link>http://arxiv.org/abs/2303.14232</link><description>&lt;p&gt;
&#24310;&#38271;&#20303;&#38498;&#21307;&#24072;&#35268;&#23450;&#23545;&#23478;&#24237;&#21307;&#23398;&#20174;&#19994;&#32773;&#20379;&#24212;&#30340;&#24433;&#21709;&#65306;&#21152;&#25343;&#22823;&#24378;&#21046;&#23454;&#26045;&#23478;&#24237;&#21307;&#23398;&#20303;&#38498;&#21307;&#24072;&#35268;&#23450;&#24046;&#24322;&#24615;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Effects of extending residencies on the supply of family medicine practitioners; difference-in-differences evidence from the implementation of mandatory family medicine residencies in Canada. (arXiv:2303.14232v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14232
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20998;&#26512;&#20102;&#21152;&#25343;&#22823;&#24378;&#21046;&#23454;&#26045;&#23478;&#24237;&#21307;&#23398;&#20303;&#38498;&#21307;&#24072;&#35268;&#23450;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#24310;&#38271;&#20303;&#38498;&#21307;&#24072;&#22521;&#35757;&#26102;&#38388;&#21487;&#33021;&#23548;&#33268;&#23478;&#24237;&#21307;&#23398;&#20174;&#19994;&#32773;&#20379;&#24212;&#19979;&#38477;5%-10%&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32972;&#26223;&#65306;&#24403;&#21069;&#65292;&#21253;&#25324;&#32654;&#22269;&#21644;&#21152;&#25343;&#22823;&#22312;&#20869;&#30340;&#19968;&#20123;&#22269;&#23478;&#26377;&#20852;&#36259;&#24310;&#38271;&#21307;&#23398;&#20303;&#38498;&#21307;&#24072;&#22521;&#35757;&#26102;&#38388;&#12290;&#30446;&#21069;&#20851;&#20110;&#24310;&#38271;&#20303;&#38498;&#21307;&#24072;&#22521;&#35757;&#26102;&#38388;&#23545;&#21021;&#32423;&#21307;&#30103;&#20445;&#20581;&#20174;&#19994;&#32773;&#20379;&#24212;&#30340;&#24433;&#21709;&#36824;&#32570;&#20047;&#35777;&#25454;&#12290;&#26041;&#27861;&#65306;&#35813;&#30740;&#31350;&#21033;&#29992;&#21152;&#25343;&#22823;1976&#24180;&#33267;1994&#24180;&#24378;&#21046;&#23454;&#26045;&#30340;&#19968;&#39033;&#23478;&#24237;&#21307;&#23398;&#20303;&#38498;&#21307;&#24072;&#35268;&#23450;&#65292;&#23545;&#30465;&#20221;&#19982;&#30465;&#20221;&#20043;&#38388;&#30340;&#23454;&#26045;&#24773;&#20917;&#36827;&#34892;&#23545;&#27604;&#30740;&#31350;&#65292;&#23545;&#23478;&#24237;&#21307;&#23398;&#20174;&#19994;&#32773;&#19982;&#20854;&#20182;&#26080;&#21464;&#21270;&#30340;&#21307;&#30103;&#20154;&#21592;&#36827;&#34892;&#27604;&#36739;&#12290;&#21033;&#29992;&#24180;&#24230;&#21307;&#30103;&#20379;&#24212;&#25968;&#25454;&#36827;&#34892;&#24046;&#24322;&#24615;&#20272;&#35745;&#31574;&#30053;&#12290;&#32467;&#26524;&#65306;&#23454;&#26045;&#20303;&#38498;&#21307;&#24072;&#35268;&#23450;&#21518;&#65292;&#23478;&#24237;&#21307;&#23398;&#20174;&#19994;&#32773;&#30340;&#20379;&#24212;&#37327;&#20943;&#23569;&#20102;5%-10%&#12290;
&lt;/p&gt;
&lt;p&gt;
Background: There is currently interest in extending medical residency training in several countries including the United States and Canada. There is little evidence on what impacts extending medical residency has on supply of primary care practitioners.  Methods: I leverage the province-by-province roll-out of mandatory family medicine residencies in Canada from 1976 to 1994. This mandated that practitioners had to complete a two year residency instead of a one year internship. I use annual Canadian Institute of Health Information data on supply of physicians by specialty and province. I employ a difference-in-differences estimation strategy comparing specialties impacted by the legislation to those that had no change in their residency length (first difference). I compare before and after legislation by province (second difference).  Results: I find reductions in the supply of family medicine practitioners in the range of 5-10% of overall supply after implementation of a longer resid
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#24314;&#31435;&#31934;&#31639;&#20844;&#24179;&#24615;&#24085;&#32047;&#25176;&#26368;&#20248;(AFPO)&#39118;&#38505;&#20849;&#25285;&#35268;&#21017;&#19982;&#29305;&#23450;&#20989;&#25968;&#30340;&#22266;&#23450;&#28857;&#30340;&#19968;&#19968;&#23545;&#24212;&#20851;&#31995;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#24555;&#36895;&#30340;&#25968;&#20540;&#26041;&#27861;&#26469;&#35745;&#31639;&#36825;&#20123;&#35268;&#21017;&#65292;&#20174;&#32780;&#33021;&#22815;&#35745;&#31639;&#20986;&#36866;&#29992;&#20110;&#22823;&#37327;&#24322;&#36136;&#21442;&#19982;&#32773;&#30340;AFPO&#39118;&#38505;&#20849;&#25285;&#35268;&#21017;&#12290;</title><link>http://arxiv.org/abs/2303.05421</link><description>&lt;p&gt;
&#29992;&#20110;&#35745;&#31639;&#31934;&#31639;&#20844;&#24179;&#24615;&#24085;&#32047;&#25176;&#26368;&#20248;&#39118;&#38505;&#20849;&#25285;&#35268;&#21017;&#30340;&#22266;&#23450;&#28857;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A fixed point approach for computing actuarially fair Pareto optimal risk-sharing rules. (arXiv:2303.05421v2 [q-fin.RM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.05421
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#24314;&#31435;&#31934;&#31639;&#20844;&#24179;&#24615;&#24085;&#32047;&#25176;&#26368;&#20248;(AFPO)&#39118;&#38505;&#20849;&#25285;&#35268;&#21017;&#19982;&#29305;&#23450;&#20989;&#25968;&#30340;&#22266;&#23450;&#28857;&#30340;&#19968;&#19968;&#23545;&#24212;&#20851;&#31995;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#24555;&#36895;&#30340;&#25968;&#20540;&#26041;&#27861;&#26469;&#35745;&#31639;&#36825;&#20123;&#35268;&#21017;&#65292;&#20174;&#32780;&#33021;&#22815;&#35745;&#31639;&#20986;&#36866;&#29992;&#20110;&#22823;&#37327;&#24322;&#36136;&#21442;&#19982;&#32773;&#30340;AFPO&#39118;&#38505;&#20849;&#25285;&#35268;&#21017;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39118;&#38505;&#20849;&#25285;&#26159;&#19968;&#31181;&#22312;&#19981;&#38656;&#35201;&#31532;&#19977;&#26041;&#30340;&#24773;&#20917;&#19979;&#20849;&#20139;&#39118;&#38505;&#30340;&#26041;&#24335;&#12290;&#20026;&#20102;&#30830;&#20445;&#36825;&#26679;&#30340;&#31995;&#32479;&#30340;&#21560;&#24341;&#21147;&#65292;&#35268;&#21017;&#24212;&#35813;&#34987;&#25152;&#26377;&#21442;&#19982;&#32773;&#25509;&#21463;&#21644;&#29702;&#35299;&#12290;&#19968;&#20010;&#29702;&#24819;&#30340;&#39118;&#38505;&#20849;&#25285;&#35268;&#21017;&#24212;&#35813;&#22312;&#28385;&#36275;&#31934;&#31639;&#20844;&#24179;&#24615;&#21644;&#24085;&#32047;&#25176;&#26368;&#20248;&#24615;&#30340;&#21516;&#26102;&#65292;&#26131;&#20110;&#35745;&#31639;&#12290;&#26412;&#25991;&#24314;&#31435;&#20102;&#31934;&#31639;&#20844;&#24179;&#24615;&#24085;&#32047;&#25176;&#26368;&#20248;(AFPO)&#39118;&#38505;&#20849;&#25285;&#35268;&#21017;&#19982;&#29305;&#23450;&#20989;&#25968;&#19968;&#20010;&#22266;&#23450;&#28857;&#30340;&#19968;&#19968;&#23545;&#24212;&#20851;&#31995;&#12290;&#36824;&#25512;&#23548;&#20102;&#19968;&#31181;&#24555;&#36895;&#30340;&#25968;&#20540;&#26041;&#27861;&#26469;&#35745;&#31639;&#36825;&#20123;&#39118;&#38505;&#20849;&#25285;&#35268;&#21017;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#33021;&#22815;&#22312;&#36825;&#20010;&#26694;&#26550;&#20013;&#35745;&#31639;&#20986;&#36866;&#29992;&#20110;&#22823;&#37327;&#24322;&#36136;&#21442;&#19982;&#32773;&#30340;AFPO&#39118;&#38505;&#20849;&#25285;&#35268;&#21017;&#12290;
&lt;/p&gt;
&lt;p&gt;
Risk-sharing is one way to pool risks without the need for a third party. To ensure the attractiveness of such a system, the rule should be accepted and understood by all participants. A desirable risk-sharing rule should fulfill actuarial fairness and Pareto optimality while being easy to compute. This paper establishes a one-to-one correspondence between an actuarially fair Pareto optimal (AFPO) risk-sharing rule and a fixed point of a specific function. A fast numerical method for computing these risk-sharing rules is also derived. As a result, we are able to compute AFPO risk-sharing rules for a large number of heterogeneous participants in this framework.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;</title><link>http://arxiv.org/abs/2302.13426</link><description>&lt;p&gt;
&#26399;&#26435;&#30340;&#20215;&#26684;&#21457;&#29616;
&lt;/p&gt;
&lt;p&gt;
Price Discovery for Derivatives. (arXiv:2302.13426v5 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13426
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#19968;&#20010;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#31169;&#26377;&#20449;&#24687;&#21644;&#39640;&#38454;&#20449;&#24687;&#23545;&#26399;&#26435;&#24066;&#22330;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#27169;&#22411;&#20801;&#35768;&#26377;&#31169;&#26377;&#20449;&#24687;&#30340;&#20132;&#26131;&#32773;&#22312;&#29366;&#24577;-&#32034;&#36180;&#38598;&#24066;&#22330;&#19978;&#20132;&#26131;&#12290;&#31561;&#20215;&#30340;&#26399;&#26435;&#24418;&#24335;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#25317;&#26377;&#20851;&#20110;&#22522;&#30784;&#36164;&#20135;&#25910;&#30410;&#30340;&#20998;&#24067;&#30340;&#31169;&#26377;&#20449;&#24687;&#65292;&#24182;&#20801;&#35768;&#20132;&#26131;&#20219;&#24847;&#26399;&#26435;&#32452;&#21512;&#30340;&#25805;&#32437;&#32773;&#12290;&#25105;&#20204;&#24471;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#65292;&#36825;&#20123;&#35299;&#25552;&#20379;&#20102;&#20851;&#20110;&#20869;&#24149;&#20132;&#26131;&#30340;&#39640;&#38454;&#20449;&#24687;&#65292;&#22914;&#20219;&#20309;&#32473;&#23450;&#30340;&#26102;&#21051;&#20132;&#26131;&#26399;&#26435;&#31574;&#30053;&#65292;&#24182;&#23558;&#36825;&#20123;&#31574;&#30053;&#27867;&#21270;&#21040;&#20102;&#27874;&#21160;&#29575;&#20132;&#26131;&#31561;&#23454;&#36341;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;
We obtain a basic theory of price discovery across derivative markets with respect to higher-order information, using a model where an agent with general private information regarding state probabilities is allowed to trade arbitrary portfolios of state-contingent claims. In an equivalent options formulation, the informed agent has private information regarding arbitrary aspects of the payoff distribution of an underlying asset and is allowed to trade arbitrary option portfolios. We characterize, in closed form, the informed demand, price impact, and information efficiency of prices. Our results offer a theory of insider trading on higher moments of the underlying payoff as a special case. The informed demand formula prescribes option strategies for trading on any given moment and extends those used in practice for, e.g. volatility trading.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;Twitter&#19978;&#19982;MEV&#30456;&#20851;&#30340;&#35805;&#39064;&#65292;&#32467;&#26524;&#34920;&#26126;&#25512;&#25991;&#35752;&#35770;&#20102;&#28145;&#21051;&#30340;&#20262;&#29702;&#38382;&#39064;&#65292;&#21253;&#25324;&#23433;&#20840;&#12289;&#20844;&#24179;&#12289;&#24773;&#24863;&#24773;&#32490;&#21644;&#23545;MEV&#35299;&#20915;&#26041;&#26696;&#30340;&#28212;&#26395;&#12290;</title><link>http://arxiv.org/abs/2212.06951</link><description>&lt;p&gt;
&#21306;&#22359;&#38142;&#19978;&#30340;AI&#20262;&#29702;: &#22522;&#20110;Twitter&#25968;&#25454;&#30340;&#21306;&#22359;&#38142;&#23433;&#20840;&#20027;&#39064;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
AI Ethics on Blockchain: Topic Analysis on Twitter Data for Blockchain Security. (arXiv:2212.06951v3 [cs.CR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.06951
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;Twitter&#19978;&#19982;MEV&#30456;&#20851;&#30340;&#35805;&#39064;&#65292;&#32467;&#26524;&#34920;&#26126;&#25512;&#25991;&#35752;&#35770;&#20102;&#28145;&#21051;&#30340;&#20262;&#29702;&#38382;&#39064;&#65292;&#21253;&#25324;&#23433;&#20840;&#12289;&#20844;&#24179;&#12289;&#24773;&#24863;&#24773;&#32490;&#21644;&#23545;MEV&#35299;&#20915;&#26041;&#26696;&#30340;&#28212;&#26395;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21306;&#22359;&#38142;&#20351;&#29992;&#20998;&#24067;&#24335;&#32593;&#32476;&#35753;&#35745;&#31639;&#26426;&#31995;&#32479;&#26356;&#23433;&#20840;&#65292;&#20294;&#24403;&#21069;&#30340;&#21306;&#22359;&#38142;&#35774;&#35745;&#22312;&#20132;&#26131;&#39034;&#24207;&#26041;&#38754;&#23384;&#22312;&#20844;&#24179;&#24615;&#38382;&#39064;&#12290;&#30719;&#24037;&#21487;&#20197;&#37325;&#26032;&#25490;&#24207;&#20132;&#26131;&#20197;&#29983;&#25104;&#21033;&#28070;&#65292;&#36825;&#34987;&#31216;&#20026;&#30719;&#24037;&#21487;&#25552;&#21462;&#20215;&#20540;&#65288;MEV&#65289;&#38382;&#39064;&#12290;&#29616;&#26377;&#30740;&#31350;&#35748;&#20026;MEV&#26159;&#19968;&#20010;&#20005;&#37325;&#30340;&#23433;&#20840;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#28508;&#22312;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#21253;&#25324;&#30693;&#21517;&#30340;Flashbots&#12290;&#28982;&#32780;&#65292;&#20197;&#24448;&#30340;&#30740;&#31350;&#22823;&#22810;&#20998;&#26512;&#20102;&#21306;&#22359;&#38142;&#25968;&#25454;&#65292;&#36825;&#21487;&#33021;&#26080;&#27861;&#25429;&#25417;&#21040;MEV&#22312;&#26356;&#24191;&#27867;&#30340;AI&#31038;&#20250;&#20013;&#30340;&#24433;&#21709;&#12290;&#22240;&#27492;&#65292;&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#24212;&#29992;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#65288;NLP&#65289;&#26041;&#27861;&#20840;&#38754;&#20998;&#26512;&#20102;MEV&#25512;&#25991;&#20013;&#30340;&#35805;&#39064;&#12290;&#25105;&#20204;&#25910;&#38598;&#20102;&#36229;&#36807;20,000&#20010;MEV&#21644;Flashbots&#26631;&#31614;&#30340;&#25512;&#25991;&#24182;&#20998;&#26512;&#20102;&#23427;&#20204;&#30340;&#35805;&#39064;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#26174;&#31034;&#65292;&#36825;&#20123;&#25512;&#25991;&#35752;&#35770;&#20102;&#28145;&#21051;&#30340;&#20262;&#29702;&#38382;&#39064;&#65292;&#21253;&#25324;&#23433;&#20840;&#12289;&#20844;&#24179;&#12289;&#24773;&#24863;&#24773;&#32490;&#21644;&#23545;MEV&#35299;&#20915;&#26041;&#26696;&#30340;&#28212;&#26395;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#20102;&#21306;&#22359;&#38142;&#19978;MEV&#27963;&#21160;&#30340;&#20849;&#21516;&#36816;&#21160;&#12290;
&lt;/p&gt;
&lt;p&gt;
Blockchain has empowered computer systems to be more secure using a distributed network. However, the current blockchain design suffers from fairness issues in transaction ordering. Miners are able to reorder transactions to generate profits, the so-called miner extractable value (MEV). Existing research recognizes MEV as a severe security issue and proposes potential solutions, including prominent Flashbots. However, previous studies have mostly analyzed blockchain data, which might not capture the impacts of MEV in a much broader AI society. Thus, in this research, we applied natural language processing (NLP) methods to comprehensively analyze topics in tweets on MEV. We collected more than 20000 tweets with MEV and Flashbots hashtags and analyzed their topics. Our results show that the tweets discussed profound topics of ethical concern, including security, equity, emotional sentiments, and the desire for solutions to MEV. We also identify the co-movements of MEV activities on block
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#23545;&#20027;&#27969;&#20998;&#25955;&#21270;&#38134;&#34892;&#20351;&#29992;&#20132;&#26131;&#25968;&#25454;&#36827;&#34892;&#26680;&#24515;-&#22806;&#22260;&#32593;&#32476;&#29305;&#24449;&#20998;&#26512;&#65292;&#32467;&#26524;&#26174;&#31034;MakerDao&#21644;Compound&#27604;Aave&#21644;Liquity&#26356;&#20026;&#20998;&#25955;&#21270;&#65292;&#22312;&#20132;&#26131;&#20013;&#20173;&#23384;&#22312;&#30528;&#20027;&#35201;&#30340;&#22806;&#37096;&#20132;&#26131;&#12290;</title><link>http://arxiv.org/abs/2212.05632</link><description>&lt;p&gt;
&#21306;&#22359;&#38142;&#32593;&#32476;&#20998;&#26512;&#65306;&#20998;&#25955;&#21270;&#38134;&#34892;&#30340;&#27604;&#36739;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Blockchain Network Analysis: A Comparative Study of Decentralized Banks. (arXiv:2212.05632v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.05632
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#20027;&#27969;&#20998;&#25955;&#21270;&#38134;&#34892;&#20351;&#29992;&#20132;&#26131;&#25968;&#25454;&#36827;&#34892;&#26680;&#24515;-&#22806;&#22260;&#32593;&#32476;&#29305;&#24449;&#20998;&#26512;&#65292;&#32467;&#26524;&#26174;&#31034;MakerDao&#21644;Compound&#27604;Aave&#21644;Liquity&#26356;&#20026;&#20998;&#25955;&#21270;&#65292;&#22312;&#20132;&#26131;&#20013;&#20173;&#23384;&#22312;&#30528;&#20027;&#35201;&#30340;&#22806;&#37096;&#20132;&#26131;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20998;&#25955;&#21270;&#37329;&#34701;&#65288;DeFi&#65289;&#20197;&#20854;&#29420;&#29305;&#30340;&#26426;&#21046;&#35774;&#35745;&#32780;&#38395;&#21517;&#65292;&#20854;&#24212;&#29992;&#26234;&#33021;&#21512;&#32422;&#20197;&#20419;&#36827;&#28857;&#23545;&#28857;&#20132;&#26131;&#12290;&#20998;&#25955;&#21270;&#38134;&#34892;&#26159;&#19968;&#31181;&#20856;&#22411;&#30340;DeFi&#24212;&#29992;&#12290;&#29702;&#24819;&#24773;&#20917;&#19979;&#65292;&#20998;&#25955;&#21270;&#38134;&#34892;&#24212;&#35813;&#22312;&#20132;&#26131;&#26041;&#38754;&#20063;&#20998;&#25955;&#21270;&#12290;&#28982;&#32780;&#65292;&#35768;&#22810;&#26368;&#36817;&#30340;&#30740;&#31350;&#21457;&#29616;&#65292;&#20998;&#25955;&#21270;&#38134;&#34892;&#24182;&#27809;&#26377;&#23454;&#29616;&#26174;&#33879;&#30340;&#20998;&#25955;&#21270;&#31243;&#24230;&#12290;&#26412;&#30740;&#31350;&#23545;&#20027;&#27969;&#20998;&#25955;&#21270;&#38134;&#34892;&#36827;&#34892;&#20102;&#27604;&#36739;&#30740;&#31350;&#12290;&#25105;&#20204;&#20351;&#29992;&#22235;&#23478;&#20998;&#25955;&#21270;&#38134;&#34892;&#65288;Liquity&#12289;Aave&#12289;MakerDao&#21644;Compound&#65289;&#30340;&#20132;&#26131;&#25968;&#25454;&#24212;&#29992;&#26680;&#24515;-&#22806;&#22260;&#32593;&#32476;&#29305;&#24449;&#20998;&#26512;&#12290;&#25105;&#20204;&#25552;&#21462;&#20102;&#20845;&#20010;&#29305;&#24449;&#24182;&#22312;&#27178;&#25130;&#38754;&#19978;&#27604;&#36739;&#20102;&#38134;&#34892;&#30340;&#20998;&#25955;&#21270;&#27700;&#24179;&#12290;&#26681;&#25454;&#20998;&#26512;&#32467;&#26524;&#65292;&#25105;&#20204;&#21457;&#29616;&#65306;1&#65289;MakerDao&#21644;Compound&#22312;&#20132;&#26131;&#20013;&#27604;Aave&#21644;Liquity&#26356;&#20026;&#20998;&#25955;&#21270;&#12290;2&#65289;&#23613;&#31649;&#20998;&#25955;&#21270;&#38134;&#34892;&#20132;&#26131;&#24212;&#35813;&#26159;&#20998;&#25955;&#21270;&#30340;&#65292;&#20294;&#25968;&#25454;&#26174;&#31034;&#22235;&#23478;&#38134;&#34892;&#23384;&#22312;&#20027;&#35201;&#30340;&#22806;&#37096;&#20132;&#26131;&#12290;
&lt;/p&gt;
&lt;p&gt;
Decentralized finance (DeFi) is known for its unique mechanism design, which applies smart contracts to facilitate peer-to-peer transactions. The decentralized bank is a typical DeFi application. Ideally, a decentralized bank should be decentralized in the transaction. However, many recent studies have found that decentralized banks have not achieved a significant degree of decentralization. This research conducts a comparative study among mainstream decentralized banks. We apply core-periphery network features analysis using the transaction data from four decentralized banks, Liquity, Aave, MakerDao, and Compound. We extract six features and compare the banks' levels of decentralization cross-sectionally. According to the analysis results, we find that: 1) MakerDao and Compound are more decentralized in the transactions than Aave and Liquity. 2) Although decentralized banking transactions are supposed to be decentralized, the data show that four banks have primary external transaction
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35752;&#35770;&#20102;&#22312;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#20013;&#23558;&#23450;&#24615;&#35266;&#28857;&#30340;&#24635;&#20307;&#25490;&#24207;&#25972;&#21512;&#36827;&#22343;&#20540;&#26041;&#24046;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#21253;&#25324;&#40065;&#26834;&#20248;&#21270;&#21644;&#39034;&#24207;&#32858;&#21512;&#20004;&#31181;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2211.00420</link><description>&lt;p&gt;
&#22312;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#20013;&#25972;&#21512;&#22810;&#20010;&#39034;&#24207;&#20449;&#24687;&#28304;
&lt;/p&gt;
&lt;p&gt;
Integrating multiple sources of ordinal information in portfolio optimization. (arXiv:2211.00420v2 [q-fin.PM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.00420
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#22312;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#20013;&#23558;&#23450;&#24615;&#35266;&#28857;&#30340;&#24635;&#20307;&#25490;&#24207;&#25972;&#21512;&#36827;&#22343;&#20540;&#26041;&#24046;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#21253;&#25324;&#40065;&#26834;&#20248;&#21270;&#21644;&#39034;&#24207;&#32858;&#21512;&#20004;&#31181;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20027;&#21160;&#25237;&#36164;&#32452;&#21512;&#31649;&#29702;&#35797;&#22270;&#23558;&#20219;&#20309;&#26377;&#24847;&#20041;&#30340;&#20449;&#24687;&#28304;&#25972;&#21512;&#21040;&#36164;&#20135;&#36873;&#25321;&#36807;&#31243;&#20013;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#23450;&#24615;&#35266;&#28857;&#65292;&#23558;&#20854;&#35268;&#23450;&#20026;&#39044;&#26399;&#36164;&#20135;&#22238;&#25253;&#30340;&#24635;&#20307;&#25490;&#24207;&#65292;&#24182;&#35752;&#35770;&#20004;&#31181;&#19981;&#21516;&#30340;&#26041;&#27861;&#26469;&#23558;&#27492;&#36755;&#20837;&#32435;&#20837;&#22343;&#20540;&#26041;&#24046;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#27169;&#22411;&#20013;&#12290;&#22312;&#40065;&#26834;&#20248;&#21270;&#26041;&#27861;&#20013;&#65292;&#25105;&#20204;&#39318;&#20808;&#36890;&#36807;&#25193;&#23637;Black-Litterman&#65288;BL&#65289;&#26694;&#26550;&#35745;&#31639;&#27599;&#20010;&#32473;&#23450;&#24635;&#25490;&#24207;&#30340;&#36164;&#20135;&#39044;&#26399;&#22238;&#25253;&#30340;&#21518;&#39564;&#26399;&#26395;&#12290;&#28982;&#21518;&#65292;&#23558;&#36825;&#20123;&#39044;&#26399;&#36164;&#20135;&#22238;&#25253;&#20316;&#20026;&#40065;&#26834;&#20248;&#21270;&#21464;&#20307;&#30340;&#21487;&#33021;&#36755;&#20837;&#22330;&#26223;&#65292;&#24212;&#29992;&#20110;&#22343;&#20540;&#26041;&#24046;&#25237;&#36164;&#32452;&#21512;&#27169;&#22411;&#65288;&#26368;&#22823;-&#26368;&#23567;&#40065;&#26834;&#24615;&#12289;&#26368;&#23567;&#36951;&#25022;&#40065;&#26834;&#24615;&#21644;&#36719;&#40065;&#26834;&#24615;&#65289;&#12290;&#22312;&#39034;&#24207;&#32858;&#21512;&#26041;&#27861;&#20013;&#65292;&#20351;&#29992;&#31038;&#20250;&#36873;&#25321;&#29702;&#35770;&#20013;&#30340;&#35268;&#21017;&#65288;Borda&#12289;Footrule&#12289;Copeland&#12289;Best-of-k&#21644;MC4&#65289;&#23558;&#24635;&#25490;&#24207;&#32858;&#21512;&#20026;&#21333;&#20010;&#8220;&#20849;&#35782;&#24635;&#25490;&#24207;&#8221;&#12290;&#28982;&#21518;&#65292;&#38024;&#23545;&#36825;&#20010;&#8220;&#20849;&#35782;&#24635;&#25490;&#24207;&#8221;&#35745;&#31639;&#39044;&#26399;&#36164;&#20135;&#22238;&#25253;&#12290;
&lt;/p&gt;
&lt;p&gt;
Active portfolio management tries to incorporate any source of meaningful information into the asset selection process. In this contribution we consider qualitative views specified as total orders of the expected asset returns and discuss two different approaches for incorporating this input in a mean-variance portfolio optimization model. In the robust optimization approach we first compute a posterior expectation of asset returns for every given total order by an extension of the Black-Litterman (BL) framework. Then these expected asset returns are considered as possible input scenarios for robust optimization variants of the mean-variance portfolio model (max-min robustness, min regret robustness and soft robustness). In the order aggregation approach rules from social choice theory (Borda, Footrule, Copeland, Best-of-k and MC4) are used to aggregate the total order in a single ``consensus total order''. Then expected asset returns are computed for this ``consensus total order'' by 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#24494;&#35266;&#32423;&#20132;&#26131;&#25968;&#25454;&#36870;&#21521;&#20272;&#35745;&#36135;&#24065;&#30340;&#20256;&#36755;&#36895;&#24230;&#12290;&#36890;&#36807;&#27979;&#37327;&#36135;&#24065;&#22312;&#20010;&#20154;&#36134;&#25143;&#19978;&#30340;&#25345;&#26377;&#26102;&#38388;&#65292;&#24182;&#35745;&#31639;&#20854;&#36870;&#21453;&#65292;&#25105;&#20204;&#21457;&#29616;Sarafu&#22312;&#32943;&#23612;&#20122;&#30340;&#20256;&#36755;&#36895;&#24230;&#27604;&#24635;&#20307;&#19978;&#26356;&#39640;&#65292;&#22240;&#20026;&#24182;&#38750;&#25152;&#26377;&#30340;Sarafu&#21333;&#20301;&#37117;&#20445;&#25345;&#22312;&#27963;&#36291;&#24490;&#29615;&#20013;&#12290;</title><link>http://arxiv.org/abs/2209.01512</link><description>&lt;p&gt;
&#36135;&#24065;&#20256;&#36755;&#36895;&#24230;&#30340;&#36870;&#25512;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Inverse estimation of the transfer velocity of money. (arXiv:2209.01512v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.01512
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#24494;&#35266;&#32423;&#20132;&#26131;&#25968;&#25454;&#36870;&#21521;&#20272;&#35745;&#36135;&#24065;&#30340;&#20256;&#36755;&#36895;&#24230;&#12290;&#36890;&#36807;&#27979;&#37327;&#36135;&#24065;&#22312;&#20010;&#20154;&#36134;&#25143;&#19978;&#30340;&#25345;&#26377;&#26102;&#38388;&#65292;&#24182;&#35745;&#31639;&#20854;&#36870;&#21453;&#65292;&#25105;&#20204;&#21457;&#29616;Sarafu&#22312;&#32943;&#23612;&#20122;&#30340;&#20256;&#36755;&#36895;&#24230;&#27604;&#24635;&#20307;&#19978;&#26356;&#39640;&#65292;&#22240;&#20026;&#24182;&#38750;&#25152;&#26377;&#30340;Sarafu&#21333;&#20301;&#37117;&#20445;&#25345;&#22312;&#27963;&#36291;&#24490;&#29615;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30417;&#27979;&#36135;&#24065;&#20379;&#24212;&#26159;&#36827;&#34892;&#20581;&#20840;&#36135;&#24065;&#25919;&#31574;&#30340;&#37325;&#35201;&#21069;&#25552;&#65292;&#20294;&#20256;&#32479;&#19978;&#36135;&#24065;&#25351;&#26631;&#30340;&#20272;&#35745;&#26159;&#20197;&#24635;&#20307;&#20026;&#21333;&#20301;&#36827;&#34892;&#30340;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#33021;&#22815;&#21033;&#29992;&#29616;&#23454;&#19990;&#30028;&#25903;&#20184;&#31995;&#32479;&#30340;&#24494;&#35266;&#32423;&#20132;&#26131;&#25968;&#25454;&#30340;&#26032;&#26041;&#27861;&#12290;&#25105;&#20204;&#24212;&#29992;&#19968;&#31181;&#26032;&#39062;&#30340;&#35745;&#31639;&#25216;&#26415;&#26469;&#27979;&#37327;&#36135;&#24065;&#22312;&#20010;&#20154;&#36134;&#25143;&#20013;&#25345;&#26377;&#30340;&#25345;&#32493;&#26102;&#38388;&#65292;&#24182;&#36890;&#36807;&#20854;&#36870;&#21453;&#35745;&#31639;&#36135;&#24065;&#30340;&#20256;&#36755;&#36895;&#24230;&#12290;&#25105;&#20204;&#30340;&#26032;&#23450;&#20041;&#22312;&#20256;&#32479;&#20551;&#35774;&#19979;&#36864;&#21270;&#20026;&#29616;&#26377;&#23450;&#20041;&#12290;&#28982;&#32780;&#65292;&#22312;&#24635;&#20313;&#39069;&#27874;&#21160;&#21644;&#28040;&#36153;&#27169;&#24335;&#21457;&#29983;&#25913;&#21464;&#30340;&#25903;&#20184;&#31995;&#32479;&#20013;&#65292;&#36870;&#20272;&#35745;&#20173;&#28982;&#36866;&#29992;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#24212;&#29992;&#20110;&#32943;&#23612;&#20122;&#30340;&#19968;&#20010;&#23567;&#22411;&#25968;&#23383;&#31038;&#21306;&#36135;&#24065;Sarafu&#30340;&#30740;&#31350;&#20013;&#65292;&#20174;2020&#24180;1&#26376;25&#26085;&#21040;2021&#24180;6&#26376;15&#26085;&#21487;&#20197;&#33719;&#24471;&#20132;&#26131;&#25968;&#25454;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;Sarafu&#30340;&#20256;&#36755;&#36895;&#24230;&#27604;&#30475;&#36215;&#26469;&#30340;&#35201;&#39640;&#65292;&#22240;&#20026;&#24182;&#38750;&#25152;&#26377;&#30340;Sarafu&#21333;&#20301;&#37117;&#20445;&#25345;&#22312;&#27963;&#36291;&#24490;&#29615;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
Monitoring the money supply is an important prerequisite for conducting sound monetary policy, yet monetary indicators are conventionally estimated in aggregate. This paper proposes a new methodology that is able to leverage micro-level transaction data from real-world payment systems. We apply a novel computational technique to measure the durations for which money is held in individual accounts, and compute the transfer velocity of money from its inverse. Our new definition reduces to existing definitions under conventional assumptions. However, inverse estimation remains suitable for payment systems where the total balance fluctuates and spending patterns change in time. Our method is applied to study Sarafu, a small digital community currency in Kenya, where transaction data is available from 25 January 2020 to 15 June 2021. We find that the transfer velocity of Sarafu was higher than it would seem, in aggregate, because not all units of Sarafu remained in active circulation. Moreo
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20379;&#20102;&#20851;&#20110;&#21463;&#37329;&#34701;&#32422;&#26463;&#30340;&#20225;&#19994;&#36827;&#34892;&#30740;&#31350;&#32852;&#21512;&#20225;&#19994;&#30340;&#26032;&#29702;&#35770;&#12290;&#32852;&#21512;&#20225;&#19994;&#21487;&#20197;&#21327;&#35843;&#30740;&#31350;&#21162;&#21147;&#65292;&#20943;&#23569;&#23545;&#37325;&#22797;&#39033;&#30446;&#30340;&#25237;&#36164;&#65292;&#22686;&#21152;&#21019;&#26032;&#30340;&#21487;&#33021;&#24615;&#12290;&#22312;&#24066;&#22330;&#31454;&#20105;&#24369;&#21644;&#22806;&#37096;&#34701;&#36164;&#26465;&#20214;&#19981;&#20339;&#26102;&#65292;&#32852;&#21512;&#20225;&#19994;&#25913;&#21892;&#20102;&#21019;&#26032;&#32467;&#26524;&#65292;&#22686;&#21152;&#20102;&#28040;&#36153;&#32773;&#21097;&#20313;&#65292;&#24182;&#19988;&#20542;&#21521;&#20110;&#30408;&#21033;&#12290;</title><link>http://arxiv.org/abs/2207.04856</link><description>&lt;p&gt;
&#30740;&#31350;&#32852;&#21512;&#20225;&#19994;&#65306;&#37329;&#34701;&#32422;&#26463;&#30340;&#20316;&#29992;
&lt;/p&gt;
&lt;p&gt;
Research Joint Ventures: The Role of Financial Constraints. (arXiv:2207.04856v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.04856
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#20851;&#20110;&#21463;&#37329;&#34701;&#32422;&#26463;&#30340;&#20225;&#19994;&#36827;&#34892;&#30740;&#31350;&#32852;&#21512;&#20225;&#19994;&#30340;&#26032;&#29702;&#35770;&#12290;&#32852;&#21512;&#20225;&#19994;&#21487;&#20197;&#21327;&#35843;&#30740;&#31350;&#21162;&#21147;&#65292;&#20943;&#23569;&#23545;&#37325;&#22797;&#39033;&#30446;&#30340;&#25237;&#36164;&#65292;&#22686;&#21152;&#21019;&#26032;&#30340;&#21487;&#33021;&#24615;&#12290;&#22312;&#24066;&#22330;&#31454;&#20105;&#24369;&#21644;&#22806;&#37096;&#34701;&#36164;&#26465;&#20214;&#19981;&#20339;&#26102;&#65292;&#32852;&#21512;&#20225;&#19994;&#25913;&#21892;&#20102;&#21019;&#26032;&#32467;&#26524;&#65292;&#22686;&#21152;&#20102;&#28040;&#36153;&#32773;&#21097;&#20313;&#65292;&#24182;&#19988;&#20542;&#21521;&#20110;&#30408;&#21033;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#20851;&#20110;&#21463;&#37329;&#34701;&#32422;&#26463;&#30340;&#20225;&#19994;&#36827;&#34892;&#30740;&#31350;&#32852;&#21512;&#20225;&#19994;&#30340;&#26032;&#29702;&#35770;&#12290;&#24403;&#20225;&#19994;&#36873;&#25321;&#30740;&#21457;&#32452;&#21512;&#26102;&#65292;&#32852;&#21512;&#20225;&#19994;&#21487;&#20197;&#24110;&#21161;&#21327;&#35843;&#30740;&#31350;&#21162;&#21147;&#65292;&#20943;&#23569;&#23545;&#37325;&#22797;&#39033;&#30446;&#30340;&#25237;&#36164;&#12290;&#36825;&#21487;&#20197;&#37322;&#25918;&#36164;&#28304;&#65292;&#22686;&#21152;&#36861;&#27714;&#30340;&#39033;&#30446;&#30340;&#22810;&#26679;&#24615;&#65292;&#20174;&#32780;&#22686;&#21152;&#21019;&#26032;&#30340;&#21487;&#33021;&#24615;&#12290;&#24403;&#24066;&#22330;&#31454;&#20105;&#24369;&#21644;&#22806;&#37096;&#34701;&#36164;&#26465;&#20214;&#19981;&#20339;&#26102;&#65292;&#32852;&#21512;&#20225;&#19994;&#25913;&#21892;&#20102;&#21019;&#26032;&#32467;&#26524;&#12290;&#32852;&#21512;&#20225;&#19994;&#21487;&#33021;&#22686;&#21152;&#21019;&#26032;&#30340;&#27010;&#29575;&#65292;&#21516;&#26102;&#38477;&#20302;&#24635;&#30740;&#21457;&#25104;&#26412;&#12290;&#22686;&#21152;&#21019;&#26032;&#30340;&#32852;&#21512;&#20225;&#19994;&#20063;&#22686;&#21152;&#20102;&#28040;&#36153;&#32773;&#21097;&#20313;&#65292;&#24182;&#19988;&#20542;&#21521;&#20110;&#30408;&#21033;&#65292;&#20294;&#20063;&#23384;&#22312;&#21066;&#20943;&#21019;&#26032;&#30340;&#32852;&#21512;&#20225;&#19994;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#32852;&#21512;&#20225;&#19994;&#19982;&#22686;&#24378;&#21019;&#26032;&#30340;&#21512;&#24182;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper provides a novel theory of research joint ventures for financially constrained firms. When firms choose R&amp;D portfolios, an RJV can help to coordinate research efforts, reducing investments in duplicate projects. This can free up resources, increase the variety of pursued projects and thereby increase the probability of discovering the innovation. RJVs improve innovation outcomes when market competition is weak and external financing conditions are bad. An RJV may increase the innovation probability and nevertheless lower total R&amp;D costs. RJVs that increase innovation also increase consumer surplus and tend to be profitable, but innovation-reducing RJVs also exist. Finally, we compare RJVs to innovation-enhancing mergers.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#35843;&#26597;&#20102;&#20351;&#29992;Hurst&#25351;&#25968;&#20026;$H&lt;0.5$&#30340;&#31895;&#31961;&#20998;&#25968;&#36807;&#31243;&#24314;&#27169;&#37329;&#34701;&#36164;&#20135;&#27874;&#21160;&#24615;&#30340;&#32479;&#35745;&#35777;&#25454;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#26041;&#27861;&#26469;&#20272;&#35745;&#27874;&#21160;&#24615;&#20449;&#21495;&#30340;&#31895;&#31961;&#24230;&#12290;</title><link>http://arxiv.org/abs/2203.13820</link><description>&lt;p&gt;
&#31895;&#31961;&#27874;&#21160;&#65306;&#20107;&#23454;&#36824;&#26159;&#20154;&#24037;&#65311;&#65288;arXiv:2203.13820v3 [q-fin.ST] UPDATED&#65289;
&lt;/p&gt;
&lt;p&gt;
Rough volatility: fact or artefact?. (arXiv:2203.13820v3 [q-fin.ST] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.13820
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#35843;&#26597;&#20102;&#20351;&#29992;Hurst&#25351;&#25968;&#20026;$H&lt;0.5$&#30340;&#31895;&#31961;&#20998;&#25968;&#36807;&#31243;&#24314;&#27169;&#37329;&#34701;&#36164;&#20135;&#27874;&#21160;&#24615;&#30340;&#32479;&#35745;&#35777;&#25454;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#26041;&#27861;&#26469;&#20272;&#35745;&#27874;&#21160;&#24615;&#20449;&#21495;&#30340;&#31895;&#31961;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20351;&#29992;&#26080;&#27169;&#22411;&#26041;&#27861;&#65292;&#35843;&#26597;&#20102;&#20351;&#29992;Hurst&#25351;&#25968;&#20026;$H&lt;0.5$&#30340;&#8220;&#31895;&#31961;&#8221;&#20998;&#25968;&#36807;&#31243;&#26469;&#24314;&#27169;&#37329;&#34701;&#36164;&#20135;&#27874;&#21160;&#24615;&#30340;&#32479;&#35745;&#35777;&#25454;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#26041;&#27861;&#65292;&#22522;&#20110;&#31163;&#25955;&#26679;&#26412;&#26469;&#20272;&#35745;&#20989;&#25968;&#30340;&#31895;&#31961;&#24230;&#65292;&#20351;&#29992;&#27839;&#30528;&#24207;&#21015;&#20998;&#21306;&#30340;&#26631;&#20934;&#21270;$p$-th&#21464;&#24322;&#30340;&#27010;&#24565;&#12290;&#25105;&#20204;&#36890;&#36807;&#22522;&#20110;&#20998;&#25968;&#24067;&#26391;&#36816;&#21160;&#21644;&#20854;&#20182;&#20998;&#25968;&#36807;&#31243;&#30340;&#26679;&#26412;&#36335;&#24452;&#30340;&#35814;&#32454;&#25968;&#20540;&#23454;&#39564;&#65292;&#30740;&#31350;&#20102;&#25105;&#20204;&#20272;&#35745;&#22120;&#27979;&#37327;&#38543;&#26426;&#36807;&#31243;&#26679;&#26412;&#36335;&#24452;&#30340;&#31895;&#31961;&#24230;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#33021;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#24212;&#29992;&#36825;&#31181;&#26041;&#27861;&#26469;&#20272;&#35745;&#22522;&#20110;&#39640;&#39057;&#35266;&#27979;&#30340;&#23454;&#29616;&#27874;&#21160;&#24615;&#20449;&#21495;&#30340;&#31895;&#31961;&#24230;&#12290;&#22522;&#20110;&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#30340;&#35814;&#32454;&#25968;&#20540;&#23454;&#39564;&#34920;&#26126;&#65292;&#21363;&#20351;&#30636;&#26102;&#27874;&#21160;&#24615;&#20855;&#26377;&#19982;&#24067;&#26391;&#36816;&#21160;&#30456;&#21516;&#30340;&#31895;&#31961;&#24230;&#30340;&#25193;&#25955;&#21160;&#21147;&#23398;&#65292;&#23454;&#29616;&#27874;&#21160;&#24615;&#20063;&#34920;&#29616;&#20986;&#23545;&#24212;&#30340;&#31895;&#31961;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate the statistical evidence for the use of `rough' fractional processes with Hurst exponent $H&lt; 0.5$ for the modeling of volatility of financial assets, using a model-free approach. We introduce a non-parametric method for estimating the roughness of a function based on discrete sample, using the concept of normalized $p$-th variation along a sequence of partitions. We investigate the finite sample performance of our estimator for measuring the roughness of sample paths of stochastic processes using detailed numerical experiments based on sample paths of fractional Brownian motion and other fractional processes. We then apply this method to estimate the roughness of realized volatility signals based on high-frequency observations. Detailed numerical experiments based on stochastic volatility models show that, even when the instantaneous volatility has diffusive dynamics with the same roughness as Brownian motion, the realized volatility exhibits rough behaviour correspondin
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#22312;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#24212;&#29992;&#65292;&#21253;&#25324;&#26089;&#26399;&#26816;&#27979;&#37329;&#34701;&#24066;&#22330;&#28237;&#27969;&#21608;&#26399;&#21644;&#24110;&#21161;&#25237;&#36164;&#32773;&#33719;&#24471;&#26032;&#35265;&#35299;&#30340;&#24212;&#29992;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25345;&#20037;&#21516;&#35843;&#30340;&#26032;&#22411;&#28237;&#27969;&#25351;&#26631;&#65292;&#24182;&#20351;&#29992;&#19981;&#21516;&#30340;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#21644;&#23849;&#30424;&#20107;&#20214;&#36827;&#34892;&#20102;&#27979;&#35797;&#12290;</title><link>http://arxiv.org/abs/2203.05603</link><description>&lt;p&gt;
&#22522;&#20110;&#25345;&#20037;&#21516;&#35843;&#30340;&#28237;&#27969;&#25351;&#26631;&#21450;&#22312;&#37329;&#34701;&#24066;&#22330;&#19978;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#30340;&#19968;&#20123;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
A persistent-homology-based turbulence index &amp; some applications of TDA on financial markets. (arXiv:2203.05603v3 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.05603
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#22312;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#24212;&#29992;&#65292;&#21253;&#25324;&#26089;&#26399;&#26816;&#27979;&#37329;&#34701;&#24066;&#22330;&#28237;&#27969;&#21608;&#26399;&#21644;&#24110;&#21161;&#25237;&#36164;&#32773;&#33719;&#24471;&#26032;&#35265;&#35299;&#30340;&#24212;&#29992;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25345;&#20037;&#21516;&#35843;&#30340;&#26032;&#22411;&#28237;&#27969;&#25351;&#26631;&#65292;&#24182;&#20351;&#29992;&#19981;&#21516;&#30340;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#21644;&#23849;&#30424;&#20107;&#20214;&#36827;&#34892;&#20102;&#27979;&#35797;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#65288;TDA&#65289;&#26159;&#19968;&#31181;&#29616;&#20195;&#30340;&#25968;&#25454;&#20998;&#26512;&#26041;&#27861;&#65292;&#19987;&#27880;&#20110;&#25968;&#25454;&#30340;&#25299;&#25169;&#29305;&#24449;&#65307;&#36817;&#24180;&#26469;&#65292;&#23427;&#22312;&#29983;&#29289;&#23398;&#12289;&#29289;&#29702;&#23398;&#21644;&#35768;&#22810;&#20854;&#20182;&#39046;&#22495;&#24471;&#21040;&#20102;&#24191;&#27867;&#30740;&#31350;&#21644;&#24191;&#27867;&#24212;&#29992;&#12290;&#28982;&#32780;&#65292;&#37329;&#34701;&#24066;&#22330;&#22312;TDA&#30340;&#30740;&#31350;&#26041;&#38754;&#23578;&#26377;&#25152;&#27424;&#32570;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;TDA&#22312;&#37329;&#34701;&#24066;&#22330;&#19978;&#30340;&#19968;&#20123;&#26368;&#26032;&#24212;&#29992;&#65292;&#21253;&#25324;&#22312;&#37329;&#34701;&#24066;&#22330;&#28237;&#27969;&#21608;&#26399;&#30340;&#26089;&#26399;&#26816;&#27979;&#20013;&#30340;&#24212;&#29992;&#65292;&#20197;&#21450;TDA&#22914;&#20309;&#24110;&#21161;&#25237;&#36164;&#32773;&#33719;&#24471;&#26032;&#30340;&#35265;&#35299;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25345;&#20037;&#21516;&#35843;&#30340;&#26032;&#22411;&#28237;&#27969;&#25351;&#26631;&#65292;&#35813;&#25351;&#26631;&#20284;&#20046;&#33021;&#22815;&#25429;&#25417;&#37329;&#34701;&#25968;&#25454;&#20013;&#30340;&#20851;&#38190;&#36716;&#25240;&#28857;&#65307;&#25105;&#20204;&#20351;&#29992;&#19981;&#21516;&#30340;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#65288;&#22914;&#26631;&#20934;&#26222;&#23572;500&#25351;&#25968;&#12289;&#32599;&#32032;2000&#25351;&#25968;&#12289;&#26631;&#26222;/&#22696;&#35199;&#21733;&#22269;&#38469;&#35777;&#21048;&#20132;&#26131;&#25152;IPC&#25351;&#25968;&#21644;&#26085;&#32463;225&#25351;&#25968;&#65289;&#20197;&#21450;&#23849;&#30424;&#20107;&#20214;&#65288;&#40657;&#33394;&#26143;&#26399;&#19968;&#23849;&#30424;&#12289;&#20114;&#32852;&#32593;&#27873;&#27819;&#23849;&#30424;&#12289;2007-08&#23849;&#30424;&#21644;COVID-19&#23849;&#30424;&#65289;&#23545;&#25105;&#20204;&#30340;&#25351;&#26631;&#36827;&#34892;&#20102;&#27979;&#35797;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#20171;&#32461;&#20102;&#25345;&#20037;&#21516;&#35843;&#30340;&#27010;&#24565;&#65292;&#20197;&#20415;&#35835;&#32773;&#33021;&#22815;&#22312;&#19981;&#20102;&#35299;&#35813;&#39046;&#22495;&#30340;&#24773;&#20917;&#19979;&#29702;&#35299;&#26412;&#25991;&#12290;
&lt;/p&gt;
&lt;p&gt;
Topological Data Analysis (TDA) is a modern approach to Data Analysis focusing on the topological features of data; it has been widely studied in recent years and used extensively in Biology, Physics, and many other areas. However, financial markets have been studied slightly through TDA. Here we present a quick review of some recent applications of TDA on financial markets, including applications in the early detection of turbulence periods in financial markets and how TDA can help to get new insights while investing. Also, we propose a new turbulence index based on persistent homology -- the fundamental tool for TDA -- that seems to capture critical transitions in financial data; we tested our index with different financial time series (S&amp;P500, Russel 2000, S&amp;P/BMV IPC and Nikkei 225) and crash events (Black Monday crash, dot-com crash, 2007-08 crash and COVID-19 crash). Furthermore, we include an introduction to persistent homology so the reader can understand this paper without kno
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#25581;&#31034;&#24615;&#20559;&#22909;&#30340;&#23130;&#23035;&#31283;&#23450;&#24615;&#21051;&#30011;&#65292;&#26126;&#30830;&#32771;&#34385;&#20102;&#35843;&#33410;&#23130;&#23035;&#35299;&#25955;&#30340;&#31163;&#23130;&#27861;&#24459;&#19979;&#30340;&#20114;&#24847;&#31163;&#23130;&#65292;&#20026;&#20102;&#35780;&#20272;&#35813;&#21051;&#30011;&#22312;&#30830;&#23450;&#23478;&#24237;&#20869;&#28040;&#36153;&#26041;&#38754;&#30340;&#28508;&#21147;&#65292;&#36824;&#36827;&#34892;&#20102;&#27169;&#25311;&#23454;&#39564;&#12290;</title><link>http://arxiv.org/abs/2110.10781</link><description>&lt;p&gt;
&#22522;&#20110;&#25581;&#31034;&#24615;&#20559;&#22909;&#30340;&#20114;&#24847;&#31163;&#23130;&#19979;&#23130;&#23035;&#31283;&#23450;&#24615;&#30340;&#21051;&#30011;
&lt;/p&gt;
&lt;p&gt;
Revealed preference characterization of marital stability under mutual consent divorce. (arXiv:2110.10781v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2110.10781
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#25581;&#31034;&#24615;&#20559;&#22909;&#30340;&#23130;&#23035;&#31283;&#23450;&#24615;&#21051;&#30011;&#65292;&#26126;&#30830;&#32771;&#34385;&#20102;&#35843;&#33410;&#23130;&#23035;&#35299;&#25955;&#30340;&#31163;&#23130;&#27861;&#24459;&#19979;&#30340;&#20114;&#24847;&#31163;&#23130;&#65292;&#20026;&#20102;&#35780;&#20272;&#35813;&#21051;&#30011;&#22312;&#30830;&#23450;&#23478;&#24237;&#20869;&#28040;&#36153;&#26041;&#38754;&#30340;&#28508;&#21147;&#65292;&#36824;&#36827;&#34892;&#20102;&#27169;&#25311;&#23454;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#25581;&#31034;&#24615;&#20559;&#22909;&#30340;&#23130;&#23035;&#31283;&#23450;&#24615;&#21051;&#30011;&#65292;&#26126;&#30830;&#32771;&#34385;&#20102;&#35843;&#33410;&#23130;&#23035;&#35299;&#25955;&#30340;&#31163;&#23130;&#27861;&#24459;&#12290;&#25105;&#20204;&#37325;&#28857;&#30740;&#31350;&#20102;&#20114;&#24847;&#31163;&#23130;&#65292;&#21363;&#24403;&#20107;&#20154;&#21482;&#26377;&#22312;&#33719;&#24471;&#20102;&#23545;&#26041;&#30340;&#21516;&#24847;&#26102;&#25165;&#33021;&#31163;&#23130;&#12290;&#25105;&#20204;&#25552;&#20379;&#29702;&#35770;&#35265;&#35299;&#65292;&#25506;&#35752;&#20102;&#35813;&#21051;&#30011;&#22312;&#30830;&#23450;&#23478;&#24237;&#20869;&#28040;&#36153;&#26041;&#38754;&#30340;&#28508;&#21147;&#12290;&#25105;&#20204;&#20351;&#29992;&#20174;&#8220;&#31038;&#20250;&#31185;&#23398;&#30340;&#32593;&#32476;&#21270;&#32437;&#21521;&#30740;&#31350;&#8221;&#65288;LISS&#65289;&#23567;&#32452;&#25277;&#21462;&#30340;&#23478;&#24237;&#25968;&#25454;&#36827;&#34892;&#27169;&#25311;&#23454;&#39564;&#65292;&#32467;&#26524;&#25903;&#25345;&#20102;&#25105;&#20204;&#30340;&#29702;&#35770;&#21457;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a revealed preference characterization of marital stability explicitly accounting for the divorce law governing marital dissolution. We focus on mutual consent divorce, where individuals can divorce their partner only if they can obtain their consent. We provide theoretical insights into the potential of the characterization for identifying intrahousehold consumption. Simulation exercises using household data drawn from the Longitudinal Internet Studies for the Social Sciences (LISS) panel support our theoretical findings.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#27809;&#26377;&#36716;&#31227;&#30340;&#22810;&#23545;&#19968;&#21452;&#36793;&#21305;&#37197;&#20013;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#65292;&#36890;&#36807;&#21333;&#20010;&#24066;&#22330;&#30340;&#25968;&#25454;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#35266;&#27979;&#21040;&#30340;&#31283;&#23450;&#21305;&#37197;&#26465;&#20214;&#19979;&#65292;&#21452;&#26041;&#20559;&#22909;&#30340;&#38750;&#21442;&#25968;&#35782;&#21035;&#12290;&#22312;&#24212;&#29992;&#20110;&#23454;&#38469;&#25968;&#25454;&#26102;&#65292;&#36890;&#36807;Monte Carlo&#27169;&#25311;&#65292;&#25105;&#20204;&#21457;&#29616;&#24102;&#26377;Gibbs&#37319;&#26679;&#22120;&#30340;&#21442;&#25968;&#36125;&#21494;&#26031;&#26041;&#27861;&#22312;&#23454;&#38469;&#35268;&#27169;&#38382;&#39064;&#20013;&#34920;&#29616;&#33391;&#22909;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#22312;&#26234;&#21033;&#30340;&#20844;&#31435;&#21644;&#31169;&#31435;&#23398;&#26657;&#20013;&#24212;&#29992;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#24182;&#23545;&#24179;&#26435;&#25919;&#31574;&#36827;&#34892;&#20102;&#21453;&#20107;&#23454;&#20998;&#26512;&#12290;</title><link>http://arxiv.org/abs/2104.02009</link><description>&lt;p&gt;
&#27809;&#26377;&#36716;&#31227;&#30340;&#22810;&#23545;&#19968;&#21452;&#36793;&#21305;&#37197;&#20013;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Identification and Estimation in Many-to-one Two-sided Matching without Transfers. (arXiv:2104.02009v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2104.02009
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#27809;&#26377;&#36716;&#31227;&#30340;&#22810;&#23545;&#19968;&#21452;&#36793;&#21305;&#37197;&#20013;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#65292;&#36890;&#36807;&#21333;&#20010;&#24066;&#22330;&#30340;&#25968;&#25454;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#35266;&#27979;&#21040;&#30340;&#31283;&#23450;&#21305;&#37197;&#26465;&#20214;&#19979;&#65292;&#21452;&#26041;&#20559;&#22909;&#30340;&#38750;&#21442;&#25968;&#35782;&#21035;&#12290;&#22312;&#24212;&#29992;&#20110;&#23454;&#38469;&#25968;&#25454;&#26102;&#65292;&#36890;&#36807;Monte Carlo&#27169;&#25311;&#65292;&#25105;&#20204;&#21457;&#29616;&#24102;&#26377;Gibbs&#37319;&#26679;&#22120;&#30340;&#21442;&#25968;&#36125;&#21494;&#26031;&#26041;&#27861;&#22312;&#23454;&#38469;&#35268;&#27169;&#38382;&#39064;&#20013;&#34920;&#29616;&#33391;&#22909;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#22312;&#26234;&#21033;&#30340;&#20844;&#31435;&#21644;&#31169;&#31435;&#23398;&#26657;&#20013;&#24212;&#29992;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#24182;&#23545;&#24179;&#26435;&#25919;&#31574;&#36827;&#34892;&#20102;&#21453;&#20107;&#23454;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#27809;&#26377;&#21487;&#36716;&#35753;&#25928;&#29992;&#30340;&#22810;&#23545;&#19968;&#21452;&#36793;&#21305;&#37197;&#22330;&#26223;&#20013;&#65292;&#20363;&#22914;&#22823;&#23398;&#25307;&#29983;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#19968;&#20010;&#21333;&#20010;&#24066;&#22330;&#25968;&#25454;&#19979;&#65292;&#21452;&#26041;&#20559;&#22909;&#30340;&#35782;&#21035;&#26465;&#20214;&#12290;&#19981;&#35770;&#24066;&#22330;&#26159;&#38598;&#20013;&#24335;&#36824;&#26159;&#20998;&#25955;&#24335;&#65292;&#25105;&#20204;&#20551;&#35774;&#35266;&#27979;&#21040;&#30340;&#21305;&#37197;&#26159;&#31283;&#23450;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#29305;&#23450;&#25490;&#38500;&#38480;&#21046;&#26465;&#20214;&#19979;&#65292;&#23545;&#21452;&#26041;&#20559;&#22909;&#30340;&#38750;&#21442;&#25968;&#35782;&#21035;&#12290;&#20026;&#20102;&#23558;&#25105;&#20204;&#30340;&#32467;&#26524;&#24212;&#29992;&#20110;&#25968;&#25454;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#26469;&#35780;&#20272;&#19981;&#21516;&#30340;&#20272;&#35745;&#37327;&#65292;&#21253;&#25324;&#30452;&#25509;&#20174;&#35782;&#21035;&#20013;&#26500;&#24314;&#30340;&#20272;&#35745;&#37327;&#12290;&#25105;&#20204;&#21457;&#29616;&#22312;&#23454;&#38469;&#35268;&#27169;&#30340;&#38382;&#39064;&#20013;&#65292;&#24102;&#26377;Gibbs&#37319;&#26679;&#22120;&#30340;&#21442;&#25968;&#36125;&#21494;&#26031;&#26041;&#27861;&#25928;&#26524;&#33391;&#22909;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#22312;&#26234;&#21033;&#30340;&#20844;&#31435;&#21644;&#31169;&#31435;&#23398;&#26657;&#20013;&#38416;&#36848;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#24182;&#23545;&#24179;&#26435;&#25919;&#31574;&#36827;&#34892;&#20102;&#21453;&#20107;&#23454;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
In a setting of many-to-one two-sided matching with non-transferable utilities, e.g., college admissions, we study conditions under which preferences of both sides are identified with data on one single market. Regardless of whether the market is centralized or decentralized, assuming that the observed matching is stable, we show nonparametric identification of preferences of both sides under certain exclusion restrictions. To take our results to the data, we use Monte Carlo simulations to evaluate different estimators, including the ones that are directly constructed from the identification. We find that a parametric Bayesian approach with a Gibbs sampler works well in realistically sized problems. Finally, we illustrate our methodology in decentralized admissions to public and private schools in Chile and conduct a counterfactual analysis of an affirmative action policy.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#20351;&#29992;&#35821;&#20041;&#32593;&#32476;&#20998;&#26512;&#26469;&#39044;&#27979;&#37329;&#34701;&#24066;&#22330;&#65292;&#22522;&#20110;&#26032;&#30340;&#25991;&#26412;&#25968;&#25454;&#25351;&#26631;&#65292;&#35780;&#20272;&#32463;&#27982;&#30456;&#20851;&#20851;&#38190;&#35789;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#24212;&#29992;&#20110;&#24847;&#22823;&#21033;&#32929;&#31080;&#21644;&#20538;&#21048;&#24066;&#22330;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#35813;&#25351;&#26631;&#33021;&#22815;&#24456;&#22909;&#22320;&#25429;&#25417;&#21040;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#30340;&#19981;&#21516;&#38454;&#27573;&#65292;&#24182;&#19988;&#23545;&#20110;&#20538;&#21048;&#24066;&#22330;&#25968;&#25454;&#21644;&#32929;&#31080;&#24066;&#22330;&#27874;&#21160;&#24615;&#37117;&#23384;&#22312;&#26126;&#26174;&#30340;&#21487;&#39044;&#27979;&#24615;&#12290;</title><link>http://arxiv.org/abs/2009.04975</link><description>&lt;p&gt;
&#22312;COVID-19&#21361;&#26426;&#20013;&#20351;&#29992;&#35821;&#20041;&#32593;&#32476;&#20998;&#26512;&#39044;&#27979;&#37329;&#34701;&#24066;&#22330;
&lt;/p&gt;
&lt;p&gt;
Forecasting financial markets with semantic network analysis in the COVID-19 crisis. (arXiv:2009.04975v4 [q-fin.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2009.04975
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#20351;&#29992;&#35821;&#20041;&#32593;&#32476;&#20998;&#26512;&#26469;&#39044;&#27979;&#37329;&#34701;&#24066;&#22330;&#65292;&#22522;&#20110;&#26032;&#30340;&#25991;&#26412;&#25968;&#25454;&#25351;&#26631;&#65292;&#35780;&#20272;&#32463;&#27982;&#30456;&#20851;&#20851;&#38190;&#35789;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#24212;&#29992;&#20110;&#24847;&#22823;&#21033;&#32929;&#31080;&#21644;&#20538;&#21048;&#24066;&#22330;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#35813;&#25351;&#26631;&#33021;&#22815;&#24456;&#22909;&#22320;&#25429;&#25417;&#21040;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#30340;&#19981;&#21516;&#38454;&#27573;&#65292;&#24182;&#19988;&#23545;&#20110;&#20538;&#21048;&#24066;&#22330;&#25968;&#25454;&#21644;&#32929;&#31080;&#24066;&#22330;&#27874;&#21160;&#24615;&#37117;&#23384;&#22312;&#26126;&#26174;&#30340;&#21487;&#39044;&#27979;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#19968;&#31181;&#26032;&#30340;&#25991;&#26412;&#25968;&#25454;&#25351;&#26631;&#26469;&#39044;&#27979;&#32929;&#31080;&#24066;&#22330;&#25968;&#25454;&#12290;&#35813;&#25351;&#26631;&#24212;&#29992;&#20110;&#22823;&#37327;&#26032;&#38395;&#20013;&#65292;&#35780;&#20272;&#25991;&#26412;&#20013;&#20986;&#29616;&#30340;&#19968;&#20010;&#25110;&#22810;&#20010;&#19982;&#32463;&#27982;&#30456;&#20851;&#30340;&#20851;&#38190;&#35789;&#30340;&#37325;&#35201;&#24615;&#12290;&#35813;&#25351;&#26631;&#26681;&#25454;&#20851;&#38190;&#35789;&#30340;&#20351;&#29992;&#39057;&#29575;&#21644;&#35821;&#20041;&#32593;&#32476;&#20301;&#32622;&#35780;&#20272;&#20854;&#37325;&#35201;&#24615;&#12290;&#25105;&#20204;&#23558;&#20854;&#24212;&#29992;&#20110;&#24847;&#22823;&#21033;&#26032;&#38395;&#65292;&#24182;&#26500;&#24314;&#25351;&#25968;&#26469;&#39044;&#27979;&#24847;&#22823;&#21033;&#32929;&#31080;&#21644;&#20538;&#21048;&#24066;&#22330;&#30340;&#22238;&#25253;&#29575;&#21644;&#27874;&#21160;&#24615;&#65292;&#21253;&#25324;COVID-19&#21361;&#26426;&#26399;&#38388;&#30340;&#25968;&#25454;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#25351;&#26631;&#24456;&#22909;&#22320;&#25429;&#25417;&#21040;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#30340;&#19981;&#21516;&#38454;&#27573;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#20538;&#21048;&#24066;&#22330;&#25968;&#25454;&#65292;&#26080;&#35770;&#26159;&#22238;&#25253;&#29575;&#36824;&#26159;&#27874;&#21160;&#24615;&#65292;&#22312;&#30701;&#26399;&#21644;&#38271;&#26399;&#21040;&#26399;&#26085;&#20197;&#21450;&#32929;&#31080;&#24066;&#22330;&#27874;&#21160;&#24615;&#26041;&#38754;&#37117;&#23384;&#22312;&#26126;&#26174;&#30340;&#21487;&#39044;&#27979;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper uses a new textual data index for predicting stock market data. The index is applied to a large set of news to evaluate the importance of one or more general economic-related keywords appearing in the text. The index assesses the importance of the economic-related keywords, based on their frequency of use and semantic network position. We apply it to the Italian press and construct indices to predict Italian stock and bond market returns and volatilities in a recent sample period, including the COVID-19 crisis. The evidence shows that the index captures the different phases of financial time series well. Moreover, results indicate strong evidence of predictability for bond market data, both returns and volatilities, short and long maturities, and stock market volatility.
&lt;/p&gt;</description></item></channel></rss>