<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#36716;&#22411;&#21327;&#35758;&#22914;&#8220;&#21457;&#24067;&#21644;&#38405;&#35835;&#8221;&#26041;&#26696;&#23558;&#20026;&#26399;&#21002;&#20986;&#29256;&#21830;&#24102;&#26469;&#22909;&#22788;&#65292;&#26080;&#35770;&#20854;&#26399;&#21002;&#20013;&#30340;&#21457;&#34920;&#25968;&#37327;&#22686;&#38271;&#36824;&#26159;&#19979;&#38477;&#65292;&#21487;&#33021;&#20250;&#25552;&#39640;&#26032;&#21442;&#19982;&#32773;&#30340;&#20934;&#20837;&#22721;&#22430;&#12290;</title><link>https://arxiv.org/abs/2403.03597</link><description>&lt;p&gt;
&#23398;&#26415;&#20986;&#29256;&#20013;&#30340;&#8220;&#24517;&#22791;&#23384;&#36135;&#8221;&#25361;&#25112;&#65306;&#36716;&#22411;&#21327;&#35758;&#30340;&#23450;&#20215;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The 'Must Stock' Challenge in Academic Publishing: Pricing Implications of Transformative Agreements
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.03597
&lt;/p&gt;
&lt;p&gt;
&#36716;&#22411;&#21327;&#35758;&#22914;&#8220;&#21457;&#24067;&#21644;&#38405;&#35835;&#8221;&#26041;&#26696;&#23558;&#20026;&#26399;&#21002;&#20986;&#29256;&#21830;&#24102;&#26469;&#22909;&#22788;&#65292;&#26080;&#35770;&#20854;&#26399;&#21002;&#20013;&#30340;&#21457;&#34920;&#25968;&#37327;&#22686;&#38271;&#36824;&#26159;&#19979;&#38477;&#65292;&#21487;&#33021;&#20250;&#25552;&#39640;&#26032;&#21442;&#19982;&#32773;&#30340;&#20934;&#20837;&#22721;&#22430;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39030;&#23574;&#23398;&#26415;&#26399;&#21002;&#30340;&#39640;&#24230;&#30456;&#20851;&#24615;&#20351;&#23427;&#20204;&#25104;&#20026;&#8220;&#24517;&#22791;&#23384;&#36135;&#8221;&#20135;&#21697;&#65292;&#36171;&#20104;&#20854;&#36890;&#24120;&#26159;&#21830;&#19994;&#25152;&#26377;&#32773;&#30340;&#38750;&#20961;&#24066;&#22330;&#21147;&#37327;&#12290; &#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#20840;&#29699;&#21508;&#22320;&#30340;&#22823;&#23398;&#32852;&#30431;&#19982;&#35768;&#22810;&#20986;&#29256;&#31038;&#35848;&#21028;&#25152;&#35859;&#30340;&#8220;&#36716;&#22411;&#21327;&#35758;&#8221;&#12290; &#36825;&#23558;&#20026;&#26631;&#20934;&#24320;&#25918;&#33719;&#21462;&#20986;&#29256;&#25171;&#24320;&#36947;&#36335;&#12290; &#23613;&#31649;&#23384;&#22312;&#20960;&#31181;&#21512;&#21516;&#35774;&#35745;&#65292;&#20294;&#8220;&#21457;&#24067;&#21644;&#38405;&#35835;&#8221;&#65288;PAR&#65289;&#26041;&#26696;&#26159;&#26368;&#25509;&#36817;&#23436;&#20840;&#24320;&#25918;&#33719;&#21462;&#29615;&#22659;&#29702;&#24819;&#30340;&#26041;&#26696;&#65306;&#20986;&#29256;&#21830;&#20250;&#20026;&#27599;&#31687;&#21457;&#34920;&#25903;&#20184;&#22266;&#23450;&#30340;&#25353;&#26696;&#20363;&#25910;&#36153;&#65292;&#20854;&#20013;&#21253;&#25324;&#23545;&#20854;&#20016;&#23500;&#30340;&#22270;&#20070;&#39302;&#25910;&#36153;&#12290; &#21453;&#36807;&#26469;&#65292;&#25152;&#26377;&#35746;&#38405;&#36153;&#29992;&#37117;&#23558;&#34987;&#20813;&#38500;&#12290; &#25105;&#20174;&#29702;&#35770;&#19978;&#25512;&#23548;&#20986;&#65292;&#26080;&#35770;&#36825;&#20123;&#20986;&#29256;&#21830;&#30340;&#26399;&#21002;&#20013;&#30340;&#21457;&#34920;&#25968;&#37327;&#22686;&#38271;&#36824;&#26159;&#19979;&#38477;&#65292;&#36825;&#31181;&#21512;&#21516;&#35774;&#35745;&#37117;&#26377;&#21033;&#20110;&#21253;&#25324;&#30340;&#20986;&#29256;&#21830;&#12290; &#22240;&#27492;&#65292;&#24191;&#27867;&#20351;&#29992;PAR&#21512;&#21516;&#24456;&#21487;&#33021;&#20250;&#25552;&#39640;&#26032;&#21442;&#19982;&#32773;&#30340;&#20934;&#20837;&#22721;&#22418;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.03597v1 Announce Type: new  Abstract: The high relevance of top-notch academic journals turns them into 'must stock' products that assign its often commercial owners with extraordinary market power. Intended to tackle this, university consortia around the globe negotiate so-called 'transformative agreements' with many publishing houses. It shall pave the way towards standard open-access publishing. While several contract designs exist, the 'publish-and-read' (PAR) scheme is the one that comes closest to the ideal of an entirely open access environment: Publishers are paid a fixed case-by-case rate for each publication, which includes a fee for their extensive libraries. In turn, all subscription payments are waived. I theoretically derive that this contract design benefits the included publishers regardless of whether the number of publications in these publishers' journals grows or declines. Consequently, widespread PAR contracts are likely to raise entry barriers for new (
&lt;/p&gt;</description></item><item><title>&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#21487;&#20197;&#26174;&#33879;&#36129;&#29486;&#20110;&#31185;&#23398;&#21644;&#26356;&#24191;&#27867;&#30340;&#24433;&#21709;&#65292;&#24182;&#20419;&#36827;&#31185;&#23398;&#30340;&#36827;&#27493;&#12290;</title><link>https://arxiv.org/abs/2402.05024</link><description>&lt;p&gt;
&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#26159;&#21542;&#26377;&#21161;&#20110;&#26356;&#22823;&#30340;&#31185;&#23398;&#24433;&#21709;&#21147;&#65311;
&lt;/p&gt;
&lt;p&gt;
Does the Use of Unusual Combinations of Datasets Contribute to Greater Scientific Impact?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.05024
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#21487;&#20197;&#26174;&#33879;&#36129;&#29486;&#20110;&#31185;&#23398;&#21644;&#26356;&#24191;&#27867;&#30340;&#24433;&#21709;&#65292;&#24182;&#20419;&#36827;&#31185;&#23398;&#30340;&#36827;&#27493;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31185;&#23398;&#25968;&#25454;&#38598;&#22312;&#24403;&#20195;&#25968;&#25454;&#39537;&#21160;&#30740;&#31350;&#20013;&#36215;&#30528;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#65292;&#23427;&#20204;&#36890;&#36807;&#20419;&#36827;&#26032;&#27169;&#24335;&#21644;&#29616;&#35937;&#30340;&#21457;&#29616;&#65292;&#25512;&#21160;&#31185;&#23398;&#30340;&#36827;&#27493;&#12290;&#36825;&#31181;&#23545;&#23454;&#35777;&#30740;&#31350;&#30340;&#19981;&#26029;&#38656;&#27714;&#24341;&#21457;&#20102;&#20851;&#20110;&#22914;&#20309;&#22312;&#30740;&#31350;&#39033;&#30446;&#20013;&#25112;&#30053;&#24615;&#22320;&#21033;&#29992;&#25968;&#25454;&#20197;&#20419;&#36827;&#31185;&#23398;&#36827;&#27493;&#30340;&#37325;&#35201;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#22522;&#20110;&#37325;&#32452;&#29702;&#35770;&#25552;&#20986;&#20102;&#19968;&#20010;&#20551;&#35774;&#65292;&#21363;&#21019;&#26032;&#24615;&#22320;&#32452;&#21512;&#29616;&#26377;&#30693;&#35782;&#65292;&#21253;&#25324;&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#65292;&#21487;&#20197;&#23548;&#33268;&#39640;&#24433;&#21709;&#30340;&#21457;&#29616;&#12290;&#25105;&#20204;&#35843;&#26597;&#20102;&#36229;&#36807;30,000&#31687;&#25991;&#31456;&#20013;&#20351;&#29992;&#20102;&#36229;&#36807;6,000&#20010;&#25968;&#25454;&#38598;&#30340;&#31038;&#20250;&#31185;&#23398;&#25968;&#25454;&#24211;ICPSR&#20013;&#36825;&#31181;&#38750;&#20856;&#22411;&#25968;&#25454;&#32452;&#21512;&#30340;&#31185;&#23398;&#25104;&#26524;&#12290;&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#22235;&#20010;&#37325;&#35201;&#30340;&#35265;&#35299;&#12290;&#39318;&#20808;&#65292;&#32452;&#21512;&#25968;&#25454;&#38598;&#65292;&#29305;&#21035;&#26159;&#37027;&#20123;&#19981;&#24120;&#35265;&#30340;&#32452;&#21512;&#65292;&#23545;&#31185;&#23398;&#21644;&#26356;&#24191;&#27867;&#30340;&#24433;&#21709;&#65288;&#20363;&#22914;&#21521;&#19968;&#33324;&#20844;&#20247;&#20256;&#25773;&#65289;&#37117;&#26377;&#26174;&#33879;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;
Scientific datasets play a crucial role in contemporary data-driven research, as they allow for the progress of science by facilitating the discovery of new patterns and phenomena. This mounting demand for empirical research raises important questions on how strategic data utilization in research projects can stimulate scientific advancement. In this study, we examine the hypothesis inspired by the recombination theory, which suggests that innovative combinations of existing knowledge, including the use of unusual combinations of datasets, can lead to high-impact discoveries. We investigate the scientific outcomes of such atypical data combinations in more than 30,000 publications that leverage over 6,000 datasets curated within one of the largest social science databases, ICPSR. This study offers four important insights. First, combining datasets, particularly those infrequently paired, significantly contributes to both scientific and broader impacts (e.g., dissemination to the genera
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;FourNet&#65292;&#19968;&#31181;&#20351;&#29992;&#39640;&#26031;&#28608;&#27963;&#20989;&#25968;&#30340;&#21333;&#23618;&#31070;&#32463;&#32593;&#32476;&#65292;&#33021;&#22815;&#20197;&#20219;&#24847;&#31934;&#24230;&#36924;&#36817;&#20855;&#26377;&#24050;&#30693;&#20613;&#37324;&#21494;&#21464;&#25442;&#30340;&#36807;&#28193;&#23494;&#24230;&#65292;&#24182;&#36890;&#36807;&#20005;&#23494;&#30340;&#35823;&#24046;&#20998;&#26512;&#32473;&#20986;&#20102;&#20272;&#35745;&#35823;&#24046;&#21644;&#38750;&#36127;&#24615;&#25439;&#22833;&#30340;&#30028;&#38480;&#12290;</title><link>http://arxiv.org/abs/2309.03966</link><description>&lt;p&gt;
&#37329;&#34701;&#20013;&#20613;&#37324;&#21494;&#31070;&#32463;&#32593;&#32476;&#36924;&#36817;&#36807;&#28193;&#23494;&#24230;
&lt;/p&gt;
&lt;p&gt;
Fourier Neural Network Approximation of Transition Densities in Finance. (arXiv:2309.03966v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.03966
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;FourNet&#65292;&#19968;&#31181;&#20351;&#29992;&#39640;&#26031;&#28608;&#27963;&#20989;&#25968;&#30340;&#21333;&#23618;&#31070;&#32463;&#32593;&#32476;&#65292;&#33021;&#22815;&#20197;&#20219;&#24847;&#31934;&#24230;&#36924;&#36817;&#20855;&#26377;&#24050;&#30693;&#20613;&#37324;&#21494;&#21464;&#25442;&#30340;&#36807;&#28193;&#23494;&#24230;&#65292;&#24182;&#36890;&#36807;&#20005;&#23494;&#30340;&#35823;&#24046;&#20998;&#26512;&#32473;&#20986;&#20102;&#20272;&#35745;&#35823;&#24046;&#21644;&#38750;&#36127;&#24615;&#25439;&#22833;&#30340;&#30028;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24341;&#20837;&#20102;FourNet&#65292;&#19968;&#31181;&#26032;&#39062;&#30340;&#21333;&#23618;&#21069;&#39304;&#31070;&#32463;&#32593;&#32476;&#65288;FFNN&#65289;&#26041;&#27861;&#65292;&#29992;&#20110;&#36924;&#36817;&#20855;&#26377;&#23553;&#38381;&#24418;&#24335;&#30340;&#20613;&#37324;&#21494;&#21464;&#25442;&#65288;&#21363;&#29305;&#24449;&#20989;&#25968;&#65289;&#21487;&#29992;&#30340;&#36807;&#28193;&#23494;&#24230;&#12290;FourNet&#30340;&#19968;&#20010;&#29420;&#29305;&#29305;&#28857;&#22312;&#20110;&#23427;&#20351;&#29992;&#20102;&#39640;&#26031;&#28608;&#27963;&#20989;&#25968;&#65292;&#20351;&#24471;&#31934;&#30830;&#30340;&#20613;&#37324;&#21494;&#21644;&#36870;&#20613;&#37324;&#21494;&#21464;&#25442;&#25104;&#20026;&#21487;&#33021;&#65292;&#24182;&#19982;&#39640;&#26031;&#28151;&#21512;&#27169;&#22411;&#36827;&#34892;&#31867;&#27604;&#12290;&#25105;&#20204;&#20174;&#25968;&#23398;&#19978;&#35777;&#26126;&#20102;FourNet&#33021;&#22815;&#20197;&#20219;&#24847;&#31934;&#24230;&#36924;&#36817;&#36807;&#28193;&#23494;&#24230;&#65292;&#24182;&#20165;&#20351;&#29992;&#26377;&#38480;&#25968;&#37327;&#30340;&#31070;&#32463;&#20803;&#12290;FourNet&#30340;&#21442;&#25968;&#36890;&#36807;&#26368;&#23567;&#21270;&#22522;&#20110;&#24050;&#30693;&#29305;&#24449;&#20989;&#25968;&#21644;FFNN&#30340;&#20613;&#37324;&#21494;&#21464;&#25442;&#30340;&#25439;&#22833;&#20989;&#25968;&#26469;&#23398;&#20064;&#65292;&#21516;&#26102;&#37319;&#29992;&#20102;&#31574;&#30053;&#24615;&#37319;&#26679;&#26041;&#27861;&#26469;&#22686;&#24378;&#35757;&#32451;&#12290;&#36890;&#36807;&#20005;&#23494;&#32780;&#20840;&#38754;&#30340;&#35823;&#24046;&#20998;&#26512;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#20102;$L_2$&#20272;&#35745;&#35823;&#24046;&#21644;&#20272;&#35745;&#23494;&#24230;&#20013;&#38750;&#36127;&#24615;&#30340;&#28508;&#22312;&#65288;&#36880;&#28857;&#65289;&#25439;&#22833;&#30340;&#20449;&#24687;&#30028;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper introduces FourNet, a novel single-layer feed-forward neural network (FFNN) method designed to approximate transition densities for which closed-form expressions of their Fourier transforms, i.e. characteristic functions, are available. A unique feature of FourNet lies in its use of a Gaussian activation function, enabling exact Fourier and inverse Fourier transformations and drawing analogies with the Gaussian mixture model. We mathematically establish FourNet's capacity to approximate transition densities in the $L_2$-sense arbitrarily well with finite number of neurons. The parameters of FourNet are learned by minimizing a loss function derived from the known characteristic function and the Fourier transform of the FFNN, complemented by a strategic sampling approach to enhance training. Through a rigorous and comprehensive error analysis, we derive informative bounds for the $L_2$ estimation error and the potential (pointwise) loss of nonnegativity in the estimated densit
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#37327;&#23376;&#21462;&#26679;&#30340;&#24037;&#20316;&#37327;&#35777;&#26126;&#20849;&#35782;&#26426;&#21046;(CGBS-PoW)&#65292;&#37319;&#29992;Fock&#24577;&#21644;&#39640;&#26031;&#27874;&#33394;&#23376;&#21462;&#26679;&#65292;&#20855;&#26377;&#24040;&#22823;&#30340;&#21152;&#36895;&#21644;&#33410;&#33021;&#25928;&#30410;&#12290;</title><link>http://arxiv.org/abs/2305.19865</link><description>&lt;p&gt;
&#37327;&#23376;&#21462;&#26679;&#30340;&#24037;&#20316;&#37327;&#35777;&#26126;&#20849;&#35782;&#26426;&#21046;
&lt;/p&gt;
&lt;p&gt;
Proof-of-work consensus by quantum sampling. (arXiv:2305.19865v1 [quant-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.19865
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#37327;&#23376;&#21462;&#26679;&#30340;&#24037;&#20316;&#37327;&#35777;&#26126;&#20849;&#35782;&#26426;&#21046;(CGBS-PoW)&#65292;&#37319;&#29992;Fock&#24577;&#21644;&#39640;&#26031;&#27874;&#33394;&#23376;&#21462;&#26679;&#65292;&#20855;&#26377;&#24040;&#22823;&#30340;&#21152;&#36895;&#21644;&#33410;&#33021;&#25928;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#20854;2011&#24180;&#20986;&#29616;&#20197;&#26469;&#65292;&#27874;&#33394;&#23376;&#21462;&#26679;&#22240;&#20854;&#30456;&#23545;&#20110;&#20854;&#20182;&#37327;&#23376;&#31639;&#27861;&#30340;&#31616;&#21333;&#24615;&#21644;&#36817;&#26399;&#35201;&#27714;&#32780;&#25104;&#20026;&#23637;&#31034;&#37327;&#23376;&#20248;&#21183;&#30340;&#20248;&#36873;&#20505;&#36873;&#12290;&#26412;&#25991;&#25552;&#20986;&#23558;&#19968;&#31181;&#21464;&#31181;&#8212;&#8212;&#31895;&#31890;&#24230;&#27874;&#33394;&#23376;&#21462;&#26679;(CGBS)&#8212;&#8212;&#20316;&#20026;&#21306;&#22359;&#38142;&#20849;&#35782;&#30340;&#37327;&#23376;&#24037;&#20316;&#37327;&#35777;&#26126;(PoW)&#26426;&#21046;&#12290;&#29992;&#25143;&#20351;&#29992;&#20381;&#36182;&#20110;&#24403;&#21069;&#22359;&#20449;&#24687;&#30340;&#36755;&#20837;&#29366;&#24577;&#36827;&#34892;&#27874;&#33394;&#23376;&#21462;&#26679;&#65292;&#24182;&#23558;&#20854;&#25552;&#20132;&#21040;&#32593;&#32476;&#20013;&#12290;&#28982;&#21518;&#30830;&#23450;&#21487;&#29992;&#20110;&#39564;&#35777;&#26679;&#26412;&#21644;&#22870;&#21169;&#25104;&#21151;&#30719;&#24037;&#30340;CGBS&#31574;&#30053;&#12290;&#36890;&#36807;&#23558;&#21521;&#25552;&#20132;&#35802;&#23454;&#26679;&#26412;&#30340;&#30719;&#24037;&#25552;&#20379;&#22870;&#21169;&#24182;&#23545;&#25552;&#20132;&#19981;&#35802;&#23454;&#26679;&#26412;&#30340;&#30719;&#24037;&#36827;&#34892;&#24809;&#32602;&#30340;&#32452;&#21512;&#65292;&#25214;&#21040;&#20102;&#19968;&#20010;&#28608;&#21169;&#35802;&#23454;&#33410;&#28857;&#30340;&#32435;&#20160;&#22343;&#34913;&#12290;&#35813;&#26041;&#26696;&#36866;&#29992;&#20110;Fock&#24577;&#27874;&#33394;&#23376;&#21462;&#26679;&#21644;&#39640;&#26031;&#27874;&#33394;&#23376;&#21462;&#26679;&#65292;&#24182;&#30456;&#23545;&#20110;&#20351;&#29992;&#32463;&#20856;&#30828;&#20214;&#36827;&#34892;&#35745;&#31639;&#25552;&#20379;&#20102;&#24040;&#22823;&#30340;&#21152;&#36895;&#21644;&#33410;&#33021;&#25928;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;
Since its advent in 2011, boson-sampling has been a preferred candidate for demonstrating quantum advantage because of its simplicity and near-term requirements compared to other quantum algorithms. We propose to use a variant, called coarse-grained boson-sampling (CGBS), as a quantum Proof-of-Work (PoW) scheme for blockchain consensus. The users perform boson-sampling using input states that depend on the current block information, and commit their samples to the network. Afterward, CGBS strategies are determined which can be used to both validate samples and to reward successful miners. By combining rewards to miners committing honest samples together with penalties to miners committing dishonest samples, a Nash equilibrium is found that incentivizes honest nodes. The scheme works for both Fock state boson sampling and Gaussian boson sampling and provides dramatic speedup and energy savings relative to computation by classical hardware.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMMs&#65289;&#30340;&#20844;&#29702;&#26694;&#26550;&#65292;&#36890;&#36807;&#23545;&#24213;&#23618;&#25928;&#29992;&#20989;&#25968;&#26045;&#21152;&#21512;&#29702;&#30340;&#20844;&#29702;&#65292;&#25551;&#36848;&#20102;&#36164;&#20135;&#20114;&#25442;&#35268;&#27169;&#21644;&#32467;&#26524;&#23450;&#20215;&#39044;&#27979;&#30340;&#29305;&#24615;&#65292;&#24182;&#23450;&#20041;&#20102;&#19968;&#31181;&#26032;&#30340;&#20215;&#26684;&#24433;&#21709;&#24230;&#37327;&#26041;&#27861;&#12290;&#20998;&#26512;&#34920;&#26126;&#65292;&#22823;&#22810;&#25968;&#29616;&#26377;&#30340;AMMs&#28385;&#36275;&#36825;&#20123;&#20844;&#29702;&#12290;&#27492;&#22806;&#65292;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#36153;&#29992;&#32467;&#26500;&#65292;&#20351;&#24471;AMM&#23545;&#20132;&#26131;&#25286;&#20998;&#19981;&#25935;&#24863;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#20855;&#26377;&#33391;&#22909;&#20998;&#26512;&#29305;&#24615;&#24182;&#25552;&#20379;&#36739;&#22823;&#33539;&#22260;&#20869;&#26080;&#21457;&#25955;&#25439;&#22833;&#30340;&#26032;&#22411;AMM&#12290;</title><link>http://arxiv.org/abs/2210.01227</link><description>&lt;p&gt;
&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#30340;&#20844;&#29702;&#65306;&#37329;&#34701;&#31185;&#25216;&#21644;&#21435;&#20013;&#24515;&#21270;&#37329;&#34701;&#39046;&#22495;&#30340;&#25968;&#23398;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
Axioms for Automated Market Makers: A Mathematical Framework in FinTech and Decentralized Finance. (arXiv:2210.01227v2 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.01227
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMMs&#65289;&#30340;&#20844;&#29702;&#26694;&#26550;&#65292;&#36890;&#36807;&#23545;&#24213;&#23618;&#25928;&#29992;&#20989;&#25968;&#26045;&#21152;&#21512;&#29702;&#30340;&#20844;&#29702;&#65292;&#25551;&#36848;&#20102;&#36164;&#20135;&#20114;&#25442;&#35268;&#27169;&#21644;&#32467;&#26524;&#23450;&#20215;&#39044;&#27979;&#30340;&#29305;&#24615;&#65292;&#24182;&#23450;&#20041;&#20102;&#19968;&#31181;&#26032;&#30340;&#20215;&#26684;&#24433;&#21709;&#24230;&#37327;&#26041;&#27861;&#12290;&#20998;&#26512;&#34920;&#26126;&#65292;&#22823;&#22810;&#25968;&#29616;&#26377;&#30340;AMMs&#28385;&#36275;&#36825;&#20123;&#20844;&#29702;&#12290;&#27492;&#22806;&#65292;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#36153;&#29992;&#32467;&#26500;&#65292;&#20351;&#24471;AMM&#23545;&#20132;&#26131;&#25286;&#20998;&#19981;&#25935;&#24863;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#20855;&#26377;&#33391;&#22909;&#20998;&#26512;&#29305;&#24615;&#24182;&#25552;&#20379;&#36739;&#22823;&#33539;&#22260;&#20869;&#26080;&#21457;&#25955;&#25439;&#22833;&#30340;&#26032;&#22411;AMM&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMMs&#65289;&#30340;&#20844;&#29702;&#26694;&#26550;&#12290;&#36890;&#36807;&#23545;&#24213;&#23618;&#25928;&#29992;&#20989;&#25968;&#26045;&#21152;&#21512;&#29702;&#30340;&#20844;&#29702;&#65292;&#25105;&#20204;&#33021;&#22815;&#25551;&#36848;&#36164;&#20135;&#20114;&#25442;&#30340;&#35268;&#27169;&#21644;&#32467;&#26524;&#23450;&#20215;&#39044;&#27979;&#30340;&#29305;&#24615;&#12290;&#36890;&#36807;&#25552;&#20379;&#36825;&#20123;&#36890;&#29992;&#30340;AMM&#20844;&#29702;&#65292;&#25105;&#20204;&#23450;&#20041;&#20102;&#19968;&#31181;&#26032;&#30340;&#20215;&#26684;&#24433;&#21709;&#24230;&#37327;&#26041;&#27861;&#65292;&#21487;&#20197;&#29992;&#26469;&#37327;&#21270;&#19981;&#21516;&#26500;&#36896;&#20043;&#38388;&#30340;&#25104;&#26412;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#35768;&#22810;&#29616;&#26377;&#30340;AMMs&#65292;&#24182;&#35777;&#26126;&#20102;&#20854;&#20013;&#22823;&#22810;&#25968;&#28385;&#36275;&#25105;&#20204;&#30340;&#20844;&#29702;&#12290;&#25105;&#20204;&#36824;&#32771;&#34385;&#20102;&#36153;&#29992;&#21644;&#21457;&#25955;&#25439;&#22833;&#30340;&#38382;&#39064;&#12290;&#22312;&#27492;&#36807;&#31243;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#36153;&#29992;&#32467;&#26500;&#65292;&#20351;&#24471;AMM&#23545;&#20132;&#26131;&#25286;&#20998;&#19981;&#25935;&#24863;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20855;&#26377;&#33391;&#22909;&#20998;&#26512;&#29305;&#24615;&#24182;&#25552;&#20379;&#36739;&#22823;&#33539;&#22260;&#20869;&#26080;&#21457;&#25955;&#25439;&#22833;&#30340;&#26032;&#22411;AMM&#12290;
&lt;/p&gt;
&lt;p&gt;
Within this work we consider an axiomatic framework for Automated Market Makers (AMMs). By imposing reasonable axioms on the underlying utility function, we are able to characterize the properties of the swap size of the assets and of the resulting pricing oracle. In providing these general AMM axioms, we define a novel measure of price impacts that can be used to quantify those costs between different constructions. We have analyzed many existing AMMs and shown that the vast majority of them satisfy our axioms. We have also considered the question of fees and divergence loss. In doing so, we have proposed a new fee structure so as to make the AMM indifferent to transaction splitting. Finally, we have proposed a novel AMM that has nice analytical properties and provides a large range over which there is no divergence loss.
&lt;/p&gt;</description></item></channel></rss>