<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>DoubleAdapt&#26159;&#19968;&#20010;&#22686;&#37327;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#32929;&#31080;&#36235;&#21183;&#39044;&#27979;&#12290;&#23427;&#21033;&#29992;&#20803;&#23398;&#20064;&#25216;&#26415;&#33258;&#21160;&#23398;&#20064;&#22914;&#20309;&#23558;&#32929;&#31080;&#25968;&#25454;&#36866;&#24212;&#21040;&#26412;&#22320;&#24179;&#31283;&#20998;&#24067;&#31354;&#38388;&#20013;&#65292;&#20174;&#32780;&#26377;&#25928;&#22320;&#36866;&#24212;&#25968;&#25454;&#21644;&#27169;&#22411;&#65292;&#20943;&#36731;&#20998;&#24067;&#28418;&#31227;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2306.09862</link><description>&lt;p&gt;
DoubleAdapt&#65306;&#19968;&#31181;&#29992;&#20110;&#32929;&#31080;&#36235;&#21183;&#39044;&#27979;&#30340;&#22686;&#37327;&#23398;&#20064;&#20803;&#23398;&#20064;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
DoubleAdapt: A Meta-learning Approach to Incremental Learning for Stock Trend Forecasting. (arXiv:2306.09862v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09862
&lt;/p&gt;
&lt;p&gt;
DoubleAdapt&#26159;&#19968;&#20010;&#22686;&#37327;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#32929;&#31080;&#36235;&#21183;&#39044;&#27979;&#12290;&#23427;&#21033;&#29992;&#20803;&#23398;&#20064;&#25216;&#26415;&#33258;&#21160;&#23398;&#20064;&#22914;&#20309;&#23558;&#32929;&#31080;&#25968;&#25454;&#36866;&#24212;&#21040;&#26412;&#22320;&#24179;&#31283;&#20998;&#24067;&#31354;&#38388;&#20013;&#65292;&#20174;&#32780;&#26377;&#25928;&#22320;&#36866;&#24212;&#25968;&#25454;&#21644;&#27169;&#22411;&#65292;&#20943;&#36731;&#20998;&#24067;&#28418;&#31227;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32929;&#31080;&#36235;&#21183;&#39044;&#27979;&#26159;&#37327;&#21270;&#25237;&#36164;&#30340;&#22522;&#26412;&#20219;&#21153;&#20043;&#19968;&#65292;&#20934;&#30830;&#39044;&#27979;&#20215;&#26684;&#36235;&#21183;&#26159;&#19981;&#21487;&#25110;&#32570;&#30340;&#12290;&#20316;&#20026;&#19968;&#39033;&#22312;&#32447;&#26381;&#21153;&#65292;&#32929;&#31080;&#25968;&#25454;&#38543;&#26102;&#38543;&#22320;&#25345;&#32493;&#21040;&#36798;&#12290;&#20351;&#29992;&#26368;&#26032;&#25968;&#25454;&#23545;&#39044;&#27979;&#27169;&#22411;&#36827;&#34892;&#22686;&#37327;&#26356;&#26032;&#26159;&#23454;&#29992;&#32780;&#39640;&#25928;&#30340;&#65292;&#22240;&#20026;&#36825;&#20123;&#26032;&#25968;&#25454;&#21487;&#33021;&#25581;&#31034;&#20102;&#26410;&#26469;&#32929;&#31080;&#24066;&#22330;&#20013;&#20250;&#37325;&#22797;&#20986;&#29616;&#30340;&#19968;&#20123;&#26032;&#27169;&#24335;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#20998;&#24067;&#28418;&#31227;&#65288;&#21363;&#27010;&#24565;&#28418;&#31227;&#65289;&#30340;&#25361;&#25112;&#65292;&#32929;&#31080;&#36235;&#21183;&#39044;&#27979;&#30340;&#22686;&#37327;&#23398;&#20064;&#20173;&#28982;&#27809;&#26377;&#24471;&#21040;&#20805;&#20998;&#25506;&#32034;&#12290;&#38543;&#30528;&#32929;&#31080;&#24066;&#22330;&#21160;&#24577;&#28436;&#21464;&#65292;&#26410;&#26469;&#25968;&#25454;&#30340;&#20998;&#24067;&#21487;&#33021;&#20250;&#19982;&#22686;&#37327;&#25968;&#25454;&#31245;&#24494;&#25110;&#26174;&#30528;&#22320;&#19981;&#21516;&#65292;&#20174;&#32780;&#38459;&#30861;&#22686;&#37327;&#26356;&#26032;&#30340;&#26377;&#25928;&#24615;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#19968;&#25361;&#25112;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21033;&#29992;&#20004;&#20010;&#36866;&#37197;&#22120;&#30340;&#31471;&#21040;&#31471;&#26694;&#26550;&#8212;&#8212;DoubleAdapt&#65292;&#21487;&#20197;&#26377;&#25928;&#22320;&#36866;&#24212;&#25968;&#25454;&#21644;&#27169;&#22411;&#65292;&#20197;&#20943;&#36731;&#20998;&#24067;&#28418;&#31227;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#20851;&#38190;&#27934;&#23519;&#21147;&#26159;&#21033;&#29992;&#20803;&#23398;&#20064;&#25216;&#26415;&#33258;&#21160;&#23398;&#20064;&#22914;&#20309;&#23558;&#32929;&#31080;&#25968;&#25454;&#36866;&#24212;&#21040;&#26412;&#22320;&#24179;&#31283;&#20998;&#24067;&#31354;&#38388;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
Stock trend forecasting is a fundamental task of quantitative investment where precise predictions of price trends are indispensable. As an online service, stock data continuously arrive over time. It is practical and efficient to incrementally update the forecast model with the latest data which may reveal some new patterns recurring in the future stock market. However, incremental learning for stock trend forecasting still remains under-explored due to the challenge of distribution shifts (a.k.a. concept drifts). With the stock market dynamically evolving, the distribution of future data can slightly or significantly differ from incremental data, hindering the effectiveness of incremental updates. To address this challenge, we propose DoubleAdapt, an end-to-end framework with two adapters, which can effectively adapt the data and the model to mitigate the effects of distribution shifts. Our key insight is to automatically learn how to adapt stock data into a locally stationary distri
&lt;/p&gt;</description></item><item><title>CSREU&#26159;&#19968;&#20221;&#27431;&#27954;&#20844;&#21496;&#32489;&#25928;&#25351;&#26631;&#21644;CSR&#25259;&#38706;&#35780;&#20998;&#30340;&#25968;&#25454;&#38598;&#65292;&#21021;&#27493;&#32467;&#26524;&#34920;&#26126;CSR&#25259;&#38706;&#23545;&#36130;&#21153;&#32489;&#25928;&#24433;&#21709;&#36739;&#24369;&#65292;&#38656;&#35201;&#26356;&#28145;&#20837;&#30340;&#30740;&#31350;&#12290;</title><link>http://arxiv.org/abs/2306.09798</link><description>&lt;p&gt;
CSREU&#65306;&#19968;&#20221;&#20851;&#20110;&#20844;&#21496;&#31038;&#20250;&#36131;&#20219;&#21644;&#32489;&#25928;&#25351;&#26631;&#30340;&#26032;&#25968;&#25454;&#38598;
&lt;/p&gt;
&lt;p&gt;
CSREU: A Novel Dataset about Corporate Social Responsibility and Performance Indicators. (arXiv:2306.09798v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09798
&lt;/p&gt;
&lt;p&gt;
CSREU&#26159;&#19968;&#20221;&#27431;&#27954;&#20844;&#21496;&#32489;&#25928;&#25351;&#26631;&#21644;CSR&#25259;&#38706;&#35780;&#20998;&#30340;&#25968;&#25454;&#38598;&#65292;&#21021;&#27493;&#32467;&#26524;&#34920;&#26126;CSR&#25259;&#38706;&#23545;&#36130;&#21153;&#32489;&#25928;&#24433;&#21709;&#36739;&#24369;&#65292;&#38656;&#35201;&#26356;&#28145;&#20837;&#30340;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20225;&#19994;&#31038;&#20250;&#36131;&#20219;&#65288;CSR&#65289;&#24050;&#25104;&#20026;&#19968;&#20010;&#37325;&#35201;&#35805;&#39064;&#65292;&#21463;&#21040;&#23398;&#26415;&#30028;&#30340;&#24191;&#27867;&#20851;&#27880;&#12290;&#26412;&#30740;&#31350;&#20171;&#32461;&#20102;CSREU&#65292;&#19968;&#20010;&#21253;&#21547;115&#20010;&#27431;&#27954;&#20844;&#21496;&#23646;&#24615;&#30340;&#26032;&#25968;&#25454;&#38598;&#65292;&#20854;&#20013;&#21253;&#25324;&#25968;&#20010;&#32489;&#25928;&#25351;&#26631;&#21644;&#25353;&#29031;&#20840;&#29699;&#25253;&#21578;&#20513;&#35758;&#65288;GRI&#65289;&#26694;&#26550;&#35745;&#31639;&#30340;&#30456;&#24212;CSR&#25259;&#38706;&#35780;&#20998;&#12290;&#25105;&#20204;&#36824;&#30740;&#31350;&#20102;&#19968;&#20123;&#20844;&#21496;&#36130;&#21153;&#25351;&#26631;&#19982;CSR&#25259;&#38706;&#35780;&#20998;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#12290;&#26681;&#25454;&#25105;&#20204;&#30340;&#32467;&#26524;&#65292;&#36825;&#20123;&#30456;&#20851;&#24615;&#36739;&#24369;&#65292;&#38656;&#35201;&#36827;&#34892;&#26356;&#28145;&#20837;&#30340;&#20998;&#26512;&#25165;&#33021;&#24471;&#20986;&#20851;&#20110;CSR&#25259;&#38706;&#23545;&#36130;&#21153;&#32489;&#25928;&#30340;&#28508;&#22312;&#24433;&#21709;&#30340;&#20196;&#20154;&#20449;&#26381;&#30340;&#32467;&#35770;&#12290;&#25105;&#20204;&#24076;&#26395;&#26032;&#21019;&#24314;&#30340;&#25968;&#25454;&#21644;&#25105;&#20204;&#30340;&#21021;&#27493;&#32467;&#26524;&#33021;&#22815;&#24110;&#21161;&#21644;&#20419;&#36827;&#36825;&#19968;&#39046;&#22495;&#30340;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Corporate Social Responsibility (CSR) has become an important topic that is gaining academic interest. This research paper presents CSREU, a new dataset with attributes of 115 European companies, which includes several performance indicators and the respective CSR disclosure scores computed using the Global Reporting Initiative (GRI) framework. We also examine the correlations between some of the financial indicators and the CSR disclosure scores of the companies. According to our results, these correlations are weak and deeper analysis is required to draw convincing conclusions about the potential impact of CSR disclosure on financial performance. We hope that the newly created data and our preliminary results will help and foster research in this field.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#35199;&#29305;&#20848;&#26031;&#36798;&#21162;&#27604;&#20122;&#22320;&#21306;&#21256;&#29273;&#21033;&#24212;&#29992;&#31185;&#23398;&#22823;&#23398;&#23398;&#29983;&#65292;&#26088;&#22312;&#30740;&#31350;&#21019;&#19994;&#24847;&#21521;&#21463;&#21040;&#22823;&#23398;&#25903;&#25345;&#21644;&#29615;&#22659;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2306.09678</link><description>&lt;p&gt;
&#24863;&#30693;&#22823;&#23398;&#25903;&#25345;&#19982;&#29615;&#22659;&#20316;&#20026;&#21019;&#19994;&#24847;&#21521;&#22240;&#32032;&#65306;&#20197;&#35199;&#29305;&#20848;&#26031;&#36798;&#21162;&#27604;&#20122;&#22320;&#21306;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
Perceived university support and environment as a factor of entrepreneurial intention: Evidence from Western Transdanubia Region. (arXiv:2306.09678v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09678
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#35199;&#29305;&#20848;&#26031;&#36798;&#21162;&#27604;&#20122;&#22320;&#21306;&#21256;&#29273;&#21033;&#24212;&#29992;&#31185;&#23398;&#22823;&#23398;&#23398;&#29983;&#65292;&#26088;&#22312;&#30740;&#31350;&#21019;&#19994;&#24847;&#21521;&#21463;&#21040;&#22823;&#23398;&#25903;&#25345;&#21644;&#29615;&#22659;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#25506;&#32034;&#21019;&#19994;&#24050;&#25104;&#20026;&#31185;&#23398;&#30740;&#31350;&#30340;&#37325;&#28857;&#12290;&#20102;&#35299;&#36825;&#19968;&#29616;&#35937;&#23545;&#20110;&#23558;&#21019;&#19994;&#36716;&#21270;&#20026;&#34892;&#21160;&#23588;&#20854;&#37325;&#35201;&#65292;&#36825;&#26159;&#26089;&#26399;&#21019;&#19994;&#27963;&#21160;&#30340;&#20851;&#38190;&#22240;&#32032;&#12290;&#36825;&#22312;&#22823;&#23398;&#29615;&#22659;&#20013;&#20855;&#26377;&#29305;&#27530;&#30340;&#37325;&#35201;&#24615;&#65292;&#38500;&#20102;&#20256;&#32479;&#30340;&#25945;&#23398;&#21644;&#30740;&#31350;&#21151;&#33021;&#22806;&#65292;&#22522;&#20110;&#24320;&#25918;&#21019;&#26032;&#30340;&#21019;&#19994;&#22823;&#23398;&#36816;&#33829;&#20197;&#21450;&#22686;&#24378;&#30740;&#31350;&#20154;&#21592;&#21644;&#23398;&#29983;&#30340;&#21019;&#19994;&#24577;&#24230;&#27491;&#22312;&#24471;&#21040;&#36234;&#26469;&#36234;&#22810;&#30340;&#20851;&#27880;&#12290;&#26412;&#30740;&#31350;&#22522;&#20110;&#22312;&#35199;&#29305;&#20848;&#26031;&#36798;&#21162;&#27604;&#20122;&#22320;&#21306;&#30340;&#19968;&#25152;&#21256;&#29273;&#21033;&#24212;&#29992;&#31185;&#23398;&#22823;&#23398;&#30340;&#23398;&#29983;&#20043;&#38388;&#36827;&#34892;&#30340;&#35843;&#26597;&#12290;&#36825;&#20123;&#23398;&#29983;&#36890;&#36807;&#21152;&#20837;&#22269;&#23478;&#21019;&#19994;&#22521;&#35757;&#21644;&#23413;&#21270;&#35745;&#21010;&#26469;&#34920;&#29616;&#20986;&#20182;&#20204;&#29616;&#26377;&#30340;&#21019;&#19994;&#25215;&#35834;&#12290;&#26412;&#30740;&#31350;&#30340;&#20027;&#35201;&#30740;&#31350;&#38382;&#39064;&#26159;&#65292;&#23398;&#29983;&#30340;&#21019;&#19994;&#24847;&#21521;&#22312;&#22810;&#22823;&#31243;&#24230;&#19978;&#21463;&#21040;&#21019;&#19994;&#29615;&#22659;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
The exploration of entrepreneurship has become a priority for scientific research in recent years. Understanding this phenomenon is particularly important for the transformation of entrepreneurship into action, which is a key factor in early-stage entrepreneurial activity. This gains particular relevance in the university environment, where, in addition to the conventional teaching and research functions, the entrepreneurial university operation based on open innovation, as well as the enhancement of entrepreneurial attitudes of researchers and students, are receiving increased attention. This study is based on a survey conducted among students attending a Hungarian university of applied science in Western Transdanubia Region who have demonstrated their existing entrepreneurial commitment by joining a national startup training and incubation programme. The main research question of the study is to what extent student entrepreneurship intention is influenced by the environment of the en
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#20998;&#26512;40&#19975;&#27604;&#29305;&#24065;&#20132;&#26131;&#25968;&#25454;&#38598;&#65292;&#26412;&#25991;&#35782;&#21035;&#26263;&#32593;&#24066;&#22330;&#20013;&#20851;&#38190;&#21442;&#19982;&#32773;&#65292;&#24182;&#31361;&#20986;&#20102;&#22810;&#23478;&#24066;&#22330;&#36816;&#33829;&#32773;&#30340;&#37325;&#35201;&#24615;&#12290;&#22312;&#26263;&#32593;&#24066;&#22330;&#29983;&#24577;&#21463;&#21040;&#22806;&#37096;&#20914;&#20987;&#26102;&#65292;&#22810;&#23478;&#24066;&#22330;&#36816;&#33829;&#32773;&#19982;&#21334;&#23478;&#38388;&#30340;&#20132;&#20114;&#32593;&#32476;&#21487;&#20197;&#25581;&#31034;&#20854;&#23545;&#25239;&#22806;&#37096;&#20914;&#20987;&#30340;&#29305;&#28857;&#21644;&#25269;&#25239;&#21147;&#12290;</title><link>http://arxiv.org/abs/2306.09485</link><description>&lt;p&gt;
&#35782;&#21035;&#26263;&#32593;&#24066;&#22330;&#20013;&#30340;&#20851;&#38190;&#21442;&#19982;&#32773;
&lt;/p&gt;
&lt;p&gt;
Identifying key players in dark web marketplaces. (arXiv:2306.09485v1 [physics.soc-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09485
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#20998;&#26512;40&#19975;&#27604;&#29305;&#24065;&#20132;&#26131;&#25968;&#25454;&#38598;&#65292;&#26412;&#25991;&#35782;&#21035;&#26263;&#32593;&#24066;&#22330;&#20013;&#20851;&#38190;&#21442;&#19982;&#32773;&#65292;&#24182;&#31361;&#20986;&#20102;&#22810;&#23478;&#24066;&#22330;&#36816;&#33829;&#32773;&#30340;&#37325;&#35201;&#24615;&#12290;&#22312;&#26263;&#32593;&#24066;&#22330;&#29983;&#24577;&#21463;&#21040;&#22806;&#37096;&#20914;&#20987;&#26102;&#65292;&#22810;&#23478;&#24066;&#22330;&#36816;&#33829;&#32773;&#19982;&#21334;&#23478;&#38388;&#30340;&#20132;&#20114;&#32593;&#32476;&#21487;&#20197;&#25581;&#31034;&#20854;&#23545;&#25239;&#22806;&#37096;&#20914;&#20987;&#30340;&#29305;&#28857;&#21644;&#25269;&#25239;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26263;&#32593;&#24066;&#22330;&#19968;&#30452;&#26159;&#38750;&#27861;&#20132;&#26131;&#30340;&#37325;&#35201;&#20986;&#21475;&#65292;&#26381;&#21153;&#20110;&#20840;&#29699;&#25968;&#30334;&#19975;&#29992;&#25143;&#24050;&#26377;&#21313;&#20313;&#24180;&#12290;&#28982;&#32780;&#65292;&#24182;&#19981;&#26159;&#25152;&#26377;&#29992;&#25143;&#37117;&#26159;&#30456;&#21516;&#30340;&#12290;&#26412;&#25991;&#26088;&#22312;&#36890;&#36807;&#20998;&#26512;&#19968;&#20010;&#21253;&#25324;&#20102;31&#20010;&#24066;&#22330;&#22312;2011&#24180;&#21040;2021&#24180;&#26399;&#38388;&#30340;4,000&#19975;&#27604;&#29305;&#24065;&#20132;&#26131;&#25968;&#25454;&#38598;&#65292;&#35782;&#21035;&#19982;&#26263;&#24066;&#22330;&#30456;&#20851;&#30340;&#27604;&#29305;&#24065;&#20132;&#26131;&#32593;&#32476;&#20013;&#30340;&#20851;&#38190;&#21442;&#19982;&#32773;&#65292;&#35780;&#20272;&#20182;&#20204;&#30340;&#35282;&#33394;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#31639;&#27861;&#23558;&#29992;&#25143;&#20998;&#31867;&#20026;&#20080;&#23478;&#25110;&#21334;&#23478;&#65292;&#34920;&#26126;&#20132;&#26131;&#37327;&#30340;&#24456;&#22823;&#19968;&#37096;&#20998;&#38598;&#20013;&#22312;&#23569;&#25968;&#31934;&#33521;&#24066;&#22330;&#21442;&#19982;&#32773;&#25163;&#20013;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#35843;&#26597;&#20102;&#24066;&#22330;&#26143;&#22270;&#21644;&#29992;&#25143;&#21040;&#29992;&#25143;&#32593;&#32476;&#65292;&#24182;&#31361;&#20986;&#20102;&#19968;&#20010;&#26032;&#31867;&#29992;&#25143;&#30340;&#37325;&#35201;&#24615;&#65292;&#21363;&#21516;&#26102;&#22312;&#22810;&#20010;&#24066;&#22330;&#19978;&#36816;&#33829;&#30340;multihomers&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;multihomers&#21644;&#21334;&#23478;&#21040;&#21334;&#23478;&#20043;&#38388;&#30340;&#20132;&#20114;&#32593;&#32476;&#21487;&#20197;&#25581;&#31034;&#26263;&#24066;&#22330;&#29983;&#24577;&#23545;&#22806;&#37096;&#20914;&#20987;&#30340;&#25269;&#25239;&#21147;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#34920;&#26126;&#65292;&#20102;&#35299;&#26263;&#32593;&#24066;&#22330;&#20013;&#20851;&#38190;&#21442;&#19982;&#32773;&#20043;&#38388;&#30340;&#20132;&#26131;&#23545;&#20110;&#35782;&#21035;&#21644;&#30772;&#22351;&#36825;&#20123;&#24179;&#21488;&#19978;&#30340;&#38750;&#27861;&#27963;&#21160;&#33267;&#20851;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;
Dark web marketplaces have been a significant outlet for illicit trade, serving millions of users worldwide for over a decade. However, not all users are the same. This paper aims to identify the key players in Bitcoin transaction networks linked to dark markets and assess their role by analysing a dataset of 40 million Bitcoin transactions involving 31 markets in the period 2011-2021. First, we propose an algorithm that categorizes users either as buyers or sellers and shows that a large fraction of the traded volume is concentrated in a small group of elite market participants. Then, we investigate both market star-graphs and user-to-user networks and highlight the importance of a new class of users, namely `multihomers' who operate on multiple marketplaces concurrently. Specifically, we show how the networks of multihomers and seller-to-seller interactions can shed light on the resilience of the dark market ecosystem against external shocks. Our findings suggest that understanding t
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#31639;&#27861;&#23398;&#20064;&#31454;&#26631;&#26102;&#19981;&#21516;&#25903;&#20184;&#35268;&#21017;&#23545;&#25928;&#29575;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#25903;&#20184;&#35268;&#21017;&#23545;&#31454;&#25293;&#25928;&#29575;&#33267;&#20851;&#37325;&#35201;&#12290;</title><link>http://arxiv.org/abs/2306.09437</link><description>&lt;p&gt;
&#24403;&#31639;&#27861;&#23398;&#20064;&#31454;&#26631;&#26102;&#30340;&#25293;&#21334;&#35774;&#35745;&#65306;&#25903;&#20184;&#35268;&#21017;&#30340;&#37325;&#35201;&#20316;&#29992;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Designing Auctions when Algorithms Learn to Bid: The critical role of Payment Rules. (arXiv:2306.09437v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09437
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31639;&#27861;&#23398;&#20064;&#31454;&#26631;&#26102;&#19981;&#21516;&#25903;&#20184;&#35268;&#21017;&#23545;&#25928;&#29575;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#25903;&#20184;&#35268;&#21017;&#23545;&#31454;&#25293;&#25928;&#29575;&#33267;&#20851;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31639;&#27861;&#23398;&#20064;&#31454;&#26631;&#26102;&#19981;&#21516;&#25903;&#20184;&#35268;&#21017;&#23545;&#25928;&#29575;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#20010;&#23436;&#20840;&#38543;&#26426;&#23454;&#39564;&#65292;&#36827;&#34892;&#20102;427&#27425;&#35797;&#39564;&#65292;&#20854;&#20013;Q-learning&#30340;&#31454;&#26631;&#32773;&#21442;&#21152;&#20102;&#39640;&#36798;250,000&#27425;&#20851;&#20110;&#20849;&#21516;&#35780;&#20272;&#39033;&#30340;&#31454;&#25293;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#21457;&#29616;&#65292;&#31532;&#19968;&#20215;&#26684;&#25293;&#21334;&#65292;&#21363;&#32988;&#21033;&#32773;&#25903;&#20184;&#33719;&#32988;&#20986;&#20215;&#65292;&#23481;&#26131;&#21463;&#21040;&#21327;&#35843;&#31454;&#26631;&#21387;&#21046;&#65292;&#32988;&#20986;&#20986;&#20215;&#24179;&#22343;&#20302;&#20110;&#30495;&#23454;&#20215;&#20540;&#32422;20%&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#31532;&#20108;&#20215;&#26684;&#25293;&#21334;&#65292;&#21363;&#32988;&#21033;&#32773;&#25903;&#20184;&#31532;&#20108;&#39640;&#20986;&#20215;&#65292;&#20351;&#33719;&#32988;&#20986;&#20215;&#19982;&#23454;&#38469;&#20215;&#20540;&#19968;&#33268;&#65292;&#20943;&#23569;&#23398;&#20064;&#26399;&#38388;&#30340;&#27874;&#21160;&#24182;&#21152;&#24555;&#25910;&#25947;&#36895;&#24230;&#12290;&#22238;&#24402;&#20998;&#26512;&#32771;&#34385;&#20102;&#35832;&#22914;&#25903;&#20184;&#35268;&#21017;&#12289;&#21442;&#19982;&#20154;&#25968;&#12289;&#25240;&#25187;&#21644;&#23398;&#20064;&#29575;&#31561;&#31639;&#27861;&#22240;&#32032;&#12289;&#24322;&#27493;/&#21516;&#27493;&#26356;&#26032;&#12289;&#21453;&#39304;&#21644;&#25506;&#32034;&#31574;&#30053;&#31561;&#35774;&#35745;&#22240;&#32032;&#65292;&#21457;&#29616;&#25903;&#20184;&#35268;&#21017;&#23545;&#25928;&#29575;&#33267;&#20851;&#37325;&#35201;&#12290;&#27492;&#22806;&#65292;&#26426;&#22120;&#23398;&#20064;&#20272;&#35745;&#22120;&#21457;&#29616;&#65292;&#25903;&#20184;&#35268;&#21017;&#29978;&#33267;&#27604;&#20854;&#20182;&#22240;&#32032;&#26356;&#21152;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper examines the impact of different payment rules on efficiency when algorithms learn to bid. We use a fully randomized experiment of 427 trials, where Q-learning bidders participate in up to 250,000 auctions for a commonly valued item. The findings reveal that the first price auction, where winners pay the winning bid, is susceptible to coordinated bid suppression, with winning bids averaging roughly 20% below the true values. In contrast, the second price auction, where winners pay the second highest bid, aligns winning bids with actual values, reduces the volatility during learning and speeds up convergence. Regression analysis, incorporating design elements such as payment rules, number of participants, algorithmic factors including the discount and learning rate, asynchronous/synchronous updating, feedback, and exploration strategies, discovers the critical role of payment rules on efficiency. Furthermore, machine learning estimators find that payment rules matter even mor
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;FLAIR&#30340;&#25351;&#26631;&#65292;&#29992;&#20110;&#24230;&#37327;&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#20013;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#31454;&#20105;&#21147;&#65292;&#35813;&#25351;&#26631;&#33021;&#22815;&#25104;&#21151;&#21306;&#20998;&#20855;&#26377;&#19981;&#21516;&#36153;&#29992;&#32467;&#26500;&#30340;LP&#65292;&#20026;LP&#34892;&#20026;&#21644;&#24615;&#33021;&#25552;&#20379;&#26377;&#20215;&#20540;&#30340;&#35265;&#35299;&#12290;</title><link>http://arxiv.org/abs/2306.09421</link><description>&lt;p&gt;
FLAIR&#65306;&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#20013;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#31454;&#20105;&#21147;&#30340;&#24230;&#37327;
&lt;/p&gt;
&lt;p&gt;
FLAIR: A Metric for Liquidity Provider Competitiveness in Automated Market Makers. (arXiv:2306.09421v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09421
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;FLAIR&#30340;&#25351;&#26631;&#65292;&#29992;&#20110;&#24230;&#37327;&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#20013;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#31454;&#20105;&#21147;&#65292;&#35813;&#25351;&#26631;&#33021;&#22815;&#25104;&#21151;&#21306;&#20998;&#20855;&#26377;&#19981;&#21516;&#36153;&#29992;&#32467;&#26500;&#30340;LP&#65292;&#20026;LP&#34892;&#20026;&#21644;&#24615;&#33021;&#25552;&#20379;&#26377;&#20215;&#20540;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26088;&#22312;&#22686;&#24378;&#23545;&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMM&#65289;&#20013;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65288;LP&#65289;&#22238;&#25253;&#30340;&#29702;&#35299;&#12290;LP&#20204;&#38754;&#20020;&#24066;&#22330;&#39118;&#38505;&#21644;&#36870;&#21521;&#36873;&#25321;&#39118;&#38505;&#65292;&#22240;&#20026;&#20182;&#20204;&#25552;&#20379;&#27969;&#21160;&#24615;&#30340;&#27744;&#23376;&#20013;&#23384;&#22312;&#39118;&#38505;&#36164;&#20135;&#65292;&#24182;&#19988;&#23384;&#22312;&#20449;&#24687;&#19981;&#23545;&#31216;&#38382;&#39064;&#12290;&#26412;&#25991;&#24341;&#20837;&#20102;&#19968;&#31181;&#29992;&#20110;&#35780;&#20272;LP&#31454;&#20105;&#21147;&#30340;&#26032;&#22411;&#25351;&#26631;FLAIR&#65288;&#36153;&#29992;&#27969;&#21160;&#24615;&#35843;&#25972;&#30636;&#26102;&#22238;&#25253;&#65289;&#65292;&#24182;&#23637;&#31034;&#20102;&#22914;&#20309;&#20351;&#29992;FLAIR&#35780;&#20272;LP&#30340;&#24615;&#33021;&#21644;&#34892;&#20026;&#12290;&#23454;&#35777;&#20998;&#26512;&#32467;&#26524;&#34920;&#26126;&#65292;FLAIR&#33021;&#22815;&#25104;&#21151;&#21306;&#20998;&#20855;&#26377;&#19981;&#21516;&#36153;&#29992;&#32467;&#26500;&#30340;LP&#65292;&#24182;&#21487;&#20197;&#20026;LP&#34892;&#20026;&#21644;&#24615;&#33021;&#25552;&#20379;&#26377;&#20215;&#20540;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper aims to enhance the understanding of liquidity provider (LP) returns in automated market makers (AMMs). LPs face market risk as well as adverse selection due to risky asset holdings in the pool that they provide liquidity to and the informational asymmetry between informed traders (arbitrageurs) and AMMs. Loss-versus-rebalancing (LVR) quantifies the adverse selection cost (Milionis et al., 2022a), and is a popular metric to evaluate the flow toxicity to an AMM. However, individual LP returns are critically affected by another factor orthogonal to the above: the competitiveness among LPs. This work introduces a novel metric for LP competitiveness, called FLAIR (short for fee liquidity-adjusted instantaneous returns), that aims to supplement LVR in assessments of LP performance to capture the dynamic behavior of LPs in a pool. Our metric reflects the characteristics of fee return-on-capital, and differentiates active liquidity provisioning strategies in AMMs. To illustrate how
&lt;/p&gt;</description></item><item><title>&#20420;&#20044;&#20914;&#31361;&#22312;&#20840;&#29699;&#39135;&#21697;&#29983;&#20135;&#32593;&#32476;&#20013;&#24341;&#36215;&#30340;&#23616;&#37096;&#20914;&#20987;&#20256;&#25773;&#24433;&#21709;&#21040;&#22810;&#20010;&#22269;&#23478;&#21644;&#22320;&#21306;&#30340;&#31918;&#39135;&#20379;&#24212;&#65292;&#20044;&#20811;&#20848;&#23436;&#20840;&#22833;&#21435;&#20892;&#19994;&#29983;&#20135;&#20250;&#23545;&#20840;&#29699;&#29978;&#33267;&#26159;&#23478;&#31165;&#32905;&#31867;&#21644;&#33909;&#33457;&#31869;&#27833;&#30340;&#24066;&#22330;&#36896;&#25104;&#37325;&#22823;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2210.01846</link><description>&lt;p&gt;
&#20174;&#20420;&#20044;&#20914;&#31361;&#21040;&#20840;&#29699;&#31918;&#39135;&#20379;&#24212;&#30340;&#20914;&#20987;&#20256;&#25773;&#65306;&#22522;&#20110;&#22810;&#23618;&#27425;&#39135;&#21697;&#29983;&#20135;&#32593;&#32476;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Shock propagation from the Russia-Ukraine conflict on international multilayer food production network determines global food availability. (arXiv:2210.01846v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.01846
&lt;/p&gt;
&lt;p&gt;
&#20420;&#20044;&#20914;&#31361;&#22312;&#20840;&#29699;&#39135;&#21697;&#29983;&#20135;&#32593;&#32476;&#20013;&#24341;&#36215;&#30340;&#23616;&#37096;&#20914;&#20987;&#20256;&#25773;&#24433;&#21709;&#21040;&#22810;&#20010;&#22269;&#23478;&#21644;&#22320;&#21306;&#30340;&#31918;&#39135;&#20379;&#24212;&#65292;&#20044;&#20811;&#20848;&#23436;&#20840;&#22833;&#21435;&#20892;&#19994;&#29983;&#20135;&#20250;&#23545;&#20840;&#29699;&#29978;&#33267;&#26159;&#23478;&#31165;&#32905;&#31867;&#21644;&#33909;&#33457;&#31869;&#27833;&#30340;&#24066;&#22330;&#36896;&#25104;&#37325;&#22823;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#39135;&#21697;&#29983;&#20135;&#32593;&#32476;&#20013;&#30340;&#20381;&#36182;&#20851;&#31995;&#21487;&#33021;&#23548;&#33268;&#22810;&#20010;&#22320;&#21306;&#30340;&#30701;&#32570;&#65292;&#36825;&#22312;&#20420;&#20044;&#20914;&#31361;&#23545;&#20840;&#29699;&#31918;&#39135;&#20379;&#24212;&#30340;&#24433;&#21709;&#20013;&#24471;&#21040;&#20102;&#35777;&#23454;&#12290;&#26412;&#25991;&#20351;&#29992;&#19968;&#20010;&#22810;&#23618;&#27425;&#30340;&#36152;&#26131;(&#30452;&#25509;)&#21644;&#39135;&#21697;&#20135;&#21697;&#36716;&#21270;(&#38388;&#25509;)&#30340;&#32593;&#32476;&#27169;&#22411;&#65292;&#25581;&#31034;&#20102;&#22312;192&#20010;&#22269;&#23478;&#21644;&#22320;&#21306;&#30340;&#20892;&#19994;&#29983;&#20135;&#21457;&#29983;&#23616;&#37096;&#20914;&#20987;&#21518;125&#31181;&#39135;&#21697;&#20135;&#21697;&#30340;&#25439;&#22833;&#24773;&#20917;&#65292;&#20174;&#32780;&#37327;&#21270;&#20102;1&#20159;&#27425; &#20914;&#20987;&#20256;&#25773;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#20044;&#20811;&#20848;&#20986;&#29616;&#23436;&#20840;&#20892;&#19994;&#29983;&#20135;&#25439;&#22833;&#30340;&#24773;&#20917;&#19979;&#65292;&#23545;&#20854;&#20182;&#22269;&#23478;&#36896;&#25104;&#30340;&#24433;&#21709;&#26159;&#24322;&#36136;&#30340;&#65292;&#36890;&#36807;&#30452;&#25509;&#25928;&#24212;&#65292;&#23548;&#33268;&#33909;&#33457;&#31869;&#27833;&#21644;&#29577;&#31859;&#30456;&#23545;&#25439;&#22833;&#39640;&#36798;89%&#21644;85%&#65292;&#36890;&#36807;&#38388;&#25509;&#24433;&#21709;&#65292;&#23478;&#31165;&#32905;&#31867;&#30340;&#25439;&#22833;&#39640;&#36798;25%&#12290;&#23613;&#31649;&#20808;&#21069;&#30340;&#30740;&#31350;&#36890;&#24120;&#23558;&#39135;&#21697;&#20135;&#21697;&#23396;&#31435;&#22320;&#22788;&#29702;&#65292;&#24182;&#27809;&#26377;&#32771;&#34385;&#29983;&#20135;&#36807;&#31243;&#20013;&#30340;&#20135;&#21697;&#36716;&#21270;&#65292;&#20294;&#25105;&#20204;&#30340;&#27169;&#22411;&#30740;&#31350;&#20102;&#24403;&#22320;&#20379;&#24212;&#20914;&#20987;&#30340;&#20840;&#29699;&#20256;&#25773;&#65292;&#27839;&#30528;&#29983;&#20135;&#21644;&#36152;&#26131;&#20851;&#31995;&#36827;&#34892;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
Dependencies in the global food production network can lead to shortages in numerous regions, as demonstrated by the impacts of the Russia-Ukraine conflict on global food supplies. Here, we reveal the losses of $125$ food products after a localized shock to agricultural production in $192$ countries and territories using a multilayer network model of trade (direct) and conversion of food products (indirect), thereby quantifying $10^8$ shock transmissions. We find that a complete agricultural production loss in Ukraine has heterogeneous impacts on other countries, causing relative losses of up to $89\%$ in sunflower oil and $85\%$ in maize via direct effects, and up to $25\%$ in poultry meat via indirect impacts. Whilst previous studies often treated products in isolation and did not account for product conversion during production, our model studies the global propagation of local supply shocks along both production and trade relations, allowing comparison of different response strateg
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#36866;&#24212;&#24615;Wasserstein&#36317;&#31163;&#65292;&#20998;&#26512;&#20102;&#27010;&#29575;&#27169;&#22411;&#24494;&#23567;&#21464;&#21270;&#23545;&#20110;&#22810;&#21608;&#26399;&#38543;&#26426;&#20248;&#21270;&#38382;&#39064;&#21644;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#20215;&#20540;&#30340;&#24433;&#21709;&#65292;&#24182;&#23545;&#36825;&#20004;&#20010;&#38382;&#39064;&#35777;&#26126;&#20102;&#26126;&#30830;&#30340;&#19968;&#38454;&#36924;&#36817;&#12290;</title><link>http://arxiv.org/abs/2208.05656</link><description>&lt;p&gt;
&#36866;&#24212;&#24615;Wasserstein&#36317;&#31163;&#22312;&#22810;&#21608;&#26399;&#20248;&#21270;&#38382;&#39064;&#30340;&#25935;&#24863;&#24615;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Sensitivity of multiperiod optimization problems in adapted Wasserstein distance. (arXiv:2208.05656v2 [math.OC] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.05656
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#36866;&#24212;&#24615;Wasserstein&#36317;&#31163;&#65292;&#20998;&#26512;&#20102;&#27010;&#29575;&#27169;&#22411;&#24494;&#23567;&#21464;&#21270;&#23545;&#20110;&#22810;&#21608;&#26399;&#38543;&#26426;&#20248;&#21270;&#38382;&#39064;&#21644;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#20215;&#20540;&#30340;&#24433;&#21709;&#65292;&#24182;&#23545;&#36825;&#20004;&#20010;&#38382;&#39064;&#35777;&#26126;&#20102;&#26126;&#30830;&#30340;&#19968;&#38454;&#36924;&#36817;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;&#27010;&#29575;&#27169;&#22411;&#24494;&#23567;&#21464;&#21270;&#23545;&#22810;&#21608;&#26399;&#38543;&#26426;&#20248;&#21270;&#38382;&#39064;&#21644;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#20215;&#20540;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#22312;&#26377;&#38480;&#31163;&#25955;&#26102;&#38388;&#20869;&#20351;&#29992;&#36866;&#24212;&#24615;Wasserstein&#36317;&#31163;&#26469;&#34913;&#37327;&#36825;&#20123;&#21464;&#21270;&#12290;&#25105;&#20204;&#23545;&#36825;&#20004;&#20010;&#38382;&#39064;&#35777;&#26126;&#20102;&#26126;&#30830;&#30340;&#19968;&#38454;&#36924;&#36817;&#12290;&#21516;&#26102;&#65292;&#25991;&#20013;&#36824;&#35752;&#35770;&#20102;&#26399;&#26395;&#25928;&#29992;&#26368;&#22823;&#21270;&#30340;&#29305;&#27530;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
We analyze the effect of small changes in the underlying probabilistic model on the value of multi-period stochastic optimization problems and optimal stopping problems. We work in finite discrete time and measure these changes with the adapted Wasserstein distance. We prove explicit first-order approximations for both problems. Expected utility maximization is discussed as a special case.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#25968;&#23383;&#31038;&#21306;&#36135;&#24065;Sarafu&#30340;&#20648;&#22791;&#21644;&#27969;&#36890;&#34892;&#20026;&#65292;&#21457;&#29616;&#27969;&#36890;&#21576;&#39640;&#24230;&#27169;&#22359;&#21270;&#21644;&#22320;&#29702;&#23616;&#38480;&#24615;&#24378;&#65292;&#24403;&#22320;&#30340;&#31038;&#21306;&#26426;&#26500;&#26159;&#20419;&#36827;&#27969;&#36890;&#30340;&#37325;&#35201;&#26469;&#28304;&#12290;</title><link>http://arxiv.org/abs/2207.08941</link><description>&lt;p&gt;
&#12298;&#25968;&#23383;&#31038;&#21306;&#36135;&#24065;&#30340;&#27969;&#36716;&#12299;
&lt;/p&gt;
&lt;p&gt;
Circulation of a digital community currency. (arXiv:2207.08941v2 [physics.soc-ph] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.08941
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#25968;&#23383;&#31038;&#21306;&#36135;&#24065;Sarafu&#30340;&#20648;&#22791;&#21644;&#27969;&#36890;&#34892;&#20026;&#65292;&#21457;&#29616;&#27969;&#36890;&#21576;&#39640;&#24230;&#27169;&#22359;&#21270;&#21644;&#22320;&#29702;&#23616;&#38480;&#24615;&#24378;&#65292;&#24403;&#22320;&#30340;&#31038;&#21306;&#26426;&#26500;&#26159;&#20419;&#36827;&#27969;&#36890;&#30340;&#37325;&#35201;&#26469;&#28304;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27969;&#36890;&#26159;&#19968;&#20010;&#25104;&#21151;&#36135;&#24065;&#20307;&#31995;&#30340;&#29305;&#24449;&#65292;&#19981;&#35770;&#26159;&#31038;&#21306;&#36135;&#24065;&#12289;&#25968;&#23383;&#36135;&#24065;&#36824;&#26159;&#22269;&#23478;&#36135;&#24065;&#12290;&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#36866;&#21512;&#20998;&#26512;&#25968;&#23383;&#20132;&#26131;&#35760;&#24405;&#26469;&#30740;&#31350;&#36135;&#24065;&#27969;&#36890;&#30340;&#32593;&#32476;&#20998;&#26512;&#26041;&#27861;&#12290;Sarafu&#26159;&#19968;&#31181;&#25968;&#23383;&#31038;&#21306;&#36135;&#24065;&#65292;&#26366;&#22312;&#32943;&#23612;&#20122;&#27969;&#36890;&#65292;&#26399;&#38388;&#22240;COVID-19&#30123;&#24773;&#23548;&#33268;&#32463;&#27982;&#21095;&#28872;&#21160;&#33633;&#12290;&#25105;&#20204;&#25226;Sarafu&#30340;&#27969;&#36890;&#34920;&#31034;&#20026;4&#19975;&#21517;&#29992;&#25143;&#20043;&#38388;&#36135;&#24065;&#27969;&#21160;&#30340;&#32593;&#32476;&#12290;&#32593;&#32476;&#27969;&#37327;&#20998;&#26512;&#26174;&#31034;Sarafu&#30340;&#27969;&#36890;&#39640;&#24230;&#27169;&#22359;&#21270;&#65292;&#22320;&#29702;&#23616;&#38480;&#24615;&#24378;&#65292;&#21442;&#19982;&#27969;&#36890;&#30340;&#20154;&#26469;&#33258;&#19981;&#21516;&#30340;&#32844;&#19994;&#32676;&#20307;&#12290;&#22312;&#26412;&#22320;&#21270;&#30340;&#23376;&#32676;&#20013;&#65292;&#32593;&#32476;&#24490;&#29615;&#20998;&#26512;&#25903;&#25345;&#27969;&#36890;&#38656;&#35201;&#24490;&#29615;&#30340;&#30452;&#35273;&#12290;&#27492;&#22806;&#65292;&#25903;&#25345;&#27969;&#36890;&#30340;&#23376;&#32593;&#32476;&#22987;&#32456;&#20855;&#26377;&#24230;&#30340;&#21453;&#21305;&#37197;&#24615;&#65292;&#25105;&#20204;&#36824;&#21457;&#29616;&#20102;&#35777;&#25454;&#34920;&#26126;&#29992;&#25143;&#24448;&#24448;&#20250;&#20559;&#21521;&#36873;&#25321;&#24615;&#30340;&#20114;&#30456;&#20132;&#26131;&#12290;&#22522;&#20110;&#31038;&#21306;&#30340;&#26426;&#26500;&#36890;&#24120;&#25198;&#28436;&#30528;&#24403;&#22320;&#26530;&#32445;&#30340;&#35282;&#33394;&#12290;
&lt;/p&gt;
&lt;p&gt;
Circulation is the characteristic feature of successful currency systems, from community currencies to cryptocurrencies to national currencies. In this paper, we propose a network analysis approach especially suited for studying circulation given a system's digital transaction records. Sarafu is a digital community currency that was active in Kenya over a period that saw considerable economic disruption due to the COVID-19 pandemic. We represent its circulation as a network of monetary flow among the 40,000 Sarafu users. Network flow analysis reveals that circulation was highly modular, geographically localized, and occurring among users with diverse livelihoods. Across localized sub-populations, network cycle analysis supports the intuitive notion that circulation requires cycles. Moreover, the sub-networks underlying circulation are consistently degree disassortative and we find evidence of preferential attachment. Community-based institutions often take on the role of local hubs, an
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#20004;&#31181;&#40065;&#26834;&#21452;&#21464;&#37327;&#38142;&#38145;&#25216;&#26415;&#65292;&#29992;&#20110;&#26816;&#27979;&#21644;&#22788;&#29702;&#21382;&#21490;&#32034;&#36180;&#25968;&#25454;&#20013;&#30340;&#31163;&#32676;&#20540;&#12290;&#36825;&#20123;&#25216;&#26415;&#33021;&#22815;&#26356;&#22909;&#22320;&#39044;&#27979;&#26410;&#26469;&#30340;&#32034;&#36180;&#25104;&#26412;&#65292;&#29305;&#21035;&#26159;&#22312;&#23384;&#22312;&#31163;&#32676;&#20540;&#30340;&#24773;&#20917;&#19979;&#12290;</title><link>http://arxiv.org/abs/2203.03874</link><description>&lt;p&gt;
&#22810;&#20803;&#40065;&#26834;&#25439;&#22833;&#39044;&#22791;&#37329;&#30340;&#31163;&#32676;&#20540;&#26816;&#27979;&#21644;&#22788;&#29702;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Detection and treatment of outliers for multivariate robust loss reserving. (arXiv:2203.03874v3 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.03874
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#20004;&#31181;&#40065;&#26834;&#21452;&#21464;&#37327;&#38142;&#38145;&#25216;&#26415;&#65292;&#29992;&#20110;&#26816;&#27979;&#21644;&#22788;&#29702;&#21382;&#21490;&#32034;&#36180;&#25968;&#25454;&#20013;&#30340;&#31163;&#32676;&#20540;&#12290;&#36825;&#20123;&#25216;&#26415;&#33021;&#22815;&#26356;&#22909;&#22320;&#39044;&#27979;&#26410;&#26469;&#30340;&#32034;&#36180;&#25104;&#26412;&#65292;&#29305;&#21035;&#26159;&#22312;&#23384;&#22312;&#31163;&#32676;&#20540;&#30340;&#24773;&#20917;&#19979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20256;&#32479;&#30340;&#26410;&#20915;&#36180;&#27454;&#36127;&#20538;&#35745;&#31639;&#25216;&#26415;&#22914;&#38142;&#38145;&#25216;&#26415;&#26497;&#26131;&#22240;&#21382;&#21490;&#32034;&#36180;&#25968;&#25454;&#20013;&#30340;&#31163;&#32676;&#20540;&#32780;&#21464;&#24471;&#25197;&#26354;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#30446;&#21069;&#40065;&#26834;&#20445;&#30041;&#26041;&#27861;&#30340;&#25991;&#29486;&#36739;&#23569;&#65292;&#20294;Verdonck&#21644;Debruyne&#65288;2011&#65289;&#21644;Verdonck&#21644;Van Wouwe&#65288;2011&#65289;&#26159;&#26126;&#26174;&#30340;&#20363;&#22806;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#26367;&#20195;&#30340;&#40065;&#26834;&#21452;&#21464;&#37327;&#38142;&#38145;&#25216;&#26415;&#20197;&#25193;&#23637;Verdonck&#21644;Van Wouwe&#65288;2011&#65289;&#30340;&#26041;&#27861;&#12290;&#31532;&#19968;&#31181;&#25216;&#26415;&#26159;&#22522;&#20110;&#35843;&#25972;&#30340;&#24322;&#24120;&#65288;Hubert&#21644;Van der Veeken&#65292;2008&#65289;&#65292;&#23427;&#26126;&#30830;&#22320;&#23558;&#20559;&#24230;&#32435;&#20837;&#20998;&#26512;&#65292;&#24182;&#20026;&#27599;&#20010;&#35266;&#27979;&#20540;&#25552;&#20379;&#20102;&#29420;&#29305;&#30340;&#31163;&#32676;&#24230;&#24230;&#37327;&#12290;&#31532;&#20108;&#31181;&#25216;&#26415;&#22522;&#20110;bagdistance&#65288;Hubert&#31561;&#65292;2016&#65289;&#65292;&#23427;&#26469;&#28304;&#20110;bagplot&#25216;&#26415;&#65292;&#33021;&#22815;&#25552;&#20379;&#19968;&#20010;&#29420;&#29305;&#30340;&#31163;&#32676;&#24230;&#24230;&#37327;&#65292;&#24182;&#25552;&#20379;&#19968;&#31181;&#26681;&#25454;&#27492;&#24230;&#37327;&#35843;&#25972;&#31163;&#32676;&#20540;&#30340;&#26041;&#27861;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#40065;&#26834;&#21452;&#21464;&#37327;&#38142;&#38145;&#26041;&#27861;&#25193;&#23637;&#21040;N-&#32500;&#26694;&#26550;&#65292;&#24182;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#25216;&#26415;&#33021;&#22815;&#27604;&#20256;&#32479;&#25216;&#26415;&#26356;&#22909;&#22320;&#39044;&#27979;&#26410;&#26469;&#30340;&#32034;&#36180;&#25104;&#26412;&#65292;&#29305;&#21035;&#26159;&#22312;&#23384;&#22312;&#31163;&#32676;&#20540;&#30340;&#24773;&#20917;&#19979;&#12290;
&lt;/p&gt;
&lt;p&gt;
Traditional techniques for calculating outstanding claim liabilities such as the chain ladder are notoriously at risk of being distorted by outliers in past claims data. Unfortunately, the literature in robust methods of reserving is scant, with notable exceptions such as Verdonck and Debruyne (2011) and Verdonck and Van Wouwe (2011). In this paper, we put forward two alternative robust bivariate chain-ladder techniques to extend the approach of Verdonck and Van Wouwe (2011). The first technique is based on Adjusted Outlyingness (Hubert and Van der Veeken, 2008) and explicitly incorporates skewness into the analysis whilst providing a unique measure of outlyingness for each observation. The second technique is based on bagdistance (Hubert et al., 2016) which is derived from the bagplot however is able to provide a unique measure of outlyingness and a means to adjust outlying observations based on this measure.  Furthermore, we extend our robust bivariate chain-ladder approach to an N-d
&lt;/p&gt;</description></item></channel></rss>