<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#20998;&#26512;&#20102;&#30789;&#35895;&#38134;&#34892;&#22833;&#36133;&#30340;&#20256;&#26579;&#25928;&#24212;&#21450;&#20854;&#23545;&#20854;&#20182;&#38134;&#34892;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;&#26080;&#20445;&#38505;&#23384;&#27454;&#12289;&#26410;&#23454;&#29616;&#25439;&#22833;&#12289;&#38134;&#34892;&#35268;&#27169;&#21644;&#29616;&#37329;&#25345;&#26377;&#23545;&#28322;&#20986;&#20135;&#29983;&#26174;&#33879;&#24433;&#21709;&#65292;&#32780;&#39640;&#36136;&#37327;&#36164;&#20135;&#25110;&#27969;&#21160;&#24615;&#35777;&#21048;&#23545;&#28322;&#20986;&#27809;&#26377;&#24110;&#21161;&#12290;&#22312;&#30789;&#35895;&#38134;&#34892;&#22833;&#36133;&#21518;&#65292;&#20013;&#22411;&#38134;&#34892;&#31435;&#21363;&#21463;&#21040;&#21387;&#21147;&#65292;&#38543;&#30528;&#26102;&#38388;&#30340;&#25512;&#31227;&#65292;&#36127;&#38754;&#28322;&#20986;&#21464;&#24471;&#26222;&#36941;&#12290;</title><link>http://arxiv.org/abs/2308.06642</link><description>&lt;p&gt;
&#30789;&#35895;&#38134;&#34892;&#25380;&#20817;&#30340;&#20256;&#26579;&#25928;&#24212;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Contagion Effects of the Silicon Valley Bank Run. (arXiv:2308.06642v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.06642
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;&#30789;&#35895;&#38134;&#34892;&#22833;&#36133;&#30340;&#20256;&#26579;&#25928;&#24212;&#21450;&#20854;&#23545;&#20854;&#20182;&#38134;&#34892;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;&#26080;&#20445;&#38505;&#23384;&#27454;&#12289;&#26410;&#23454;&#29616;&#25439;&#22833;&#12289;&#38134;&#34892;&#35268;&#27169;&#21644;&#29616;&#37329;&#25345;&#26377;&#23545;&#28322;&#20986;&#20135;&#29983;&#26174;&#33879;&#24433;&#21709;&#65292;&#32780;&#39640;&#36136;&#37327;&#36164;&#20135;&#25110;&#27969;&#21160;&#24615;&#35777;&#21048;&#23545;&#28322;&#20986;&#27809;&#26377;&#24110;&#21161;&#12290;&#22312;&#30789;&#35895;&#38134;&#34892;&#22833;&#36133;&#21518;&#65292;&#20013;&#22411;&#38134;&#34892;&#31435;&#21363;&#21463;&#21040;&#21387;&#21147;&#65292;&#38543;&#30528;&#26102;&#38388;&#30340;&#25512;&#31227;&#65292;&#36127;&#38754;&#28322;&#20986;&#21464;&#24471;&#26222;&#36941;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;&#19982;&#30789;&#35895;&#38134;&#34892;&#65288;SVB&#65289;&#22833;&#36133;&#30456;&#20851;&#30340;&#20256;&#26579;&#25928;&#24212;&#65292;&#24182;&#30830;&#23450;&#20102;&#23548;&#33268;&#38134;&#34892;&#32929;&#31080;&#22238;&#25253;&#19979;&#38477;&#30340;&#29305;&#23450;&#33030;&#24369;&#24615;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#26080;&#20445;&#38505;&#23384;&#27454;&#12289;&#25345;&#26377;&#21040;&#26399;&#35745;&#25552;&#35777;&#21048;&#30340;&#26410;&#23454;&#29616;&#25439;&#22833;&#12289;&#38134;&#34892;&#35268;&#27169;&#21644;&#29616;&#37329;&#25345;&#26377;&#23545;&#21518;&#32493;&#36127;&#38754;&#28322;&#20986;&#20135;&#29983;&#20102;&#26174;&#33879;&#24433;&#21709;&#65292;&#32780;&#39640;&#36136;&#37327;&#36164;&#20135;&#25110;&#25345;&#26377;&#27969;&#21160;&#24615;&#35777;&#21048;&#24182;&#26410;&#24110;&#21161;&#20943;&#36731;&#36127;&#38754;&#28322;&#20986;&#12290;&#26377;&#36259;&#30340;&#26159;&#65292;&#32929;&#31080;&#22312;&#30789;&#35895;&#38134;&#34892;&#21457;&#29983;&#21518;&#34920;&#29616;&#36739;&#24046;&#30340;&#38134;&#34892;&#22312;&#21069;&#19968;&#24180;&#32852;&#37030;&#20648;&#22791;&#21033;&#29575;&#19978;&#35843;&#21518;&#20063;&#26377;&#36739;&#20302;&#30340;&#22238;&#25253;&#29575;&#12290;&#32929;&#24066;&#37096;&#20998;&#39044;&#26399;&#20102;&#19982;&#26080;&#20445;&#38505;&#23384;&#27454;&#30340;&#20381;&#36182;&#30456;&#20851;&#30340;&#39118;&#38505;&#65292;&#20294;&#26410;&#35745;&#20215;&#30001;&#20110;&#21033;&#29575;&#19978;&#35843;&#32780;&#20135;&#29983;&#30340;&#26410;&#23454;&#29616;&#25439;&#22833;&#25110;&#19982;&#38134;&#34892;&#35268;&#27169;&#30456;&#20851;&#30340;&#39118;&#38505;&#12290;&#22312;&#30789;&#35895;&#38134;&#34892;&#22833;&#36133;&#21518;&#65292;&#20013;&#22411;&#38134;&#34892;&#31435;&#21363;&#36973;&#21463;&#20102;&#29305;&#23450;&#21387;&#21147;&#65292;&#38543;&#30528;&#26102;&#38388;&#30340;&#25512;&#31227;&#65292;&#36127;&#38754;&#28322;&#20986;&#21464;&#24471;&#26222;&#36941;&#65292;&#38500;&#26368;&#22823;&#35268;&#27169;&#30340;&#38134;&#34892;&#22806;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper analyzes the contagion effects associated with the failure of Silicon Valley Bank (SVB) and identifies bank-specific vulnerabilities contributing to the subsequent declines in banks' stock returns. We find that uninsured deposits, unrealized losses in held-to-maturity securities, bank size, and cash holdings had a significant impact, while better-quality assets or holdings of liquid securities did not help mitigate the negative spillovers. Interestingly, banks whose stocks performed worse post SVB also had lower returns in the previous year following Federal Reserve interest rate hikes. The stock market partially anticipated risks associated with uninsured deposit reliance, but did not price in unrealized losses due to interest rate hikes nor risks linked to bank size. While mid-sized banks experienced particular stress immediately after the SVB failure, over time negative spillovers became widespread except for the largest banks.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#21457;&#29616;&#20844;&#20849;&#24403;&#38138;&#30340;&#36151;&#27454;&#36129;&#29486;&#20102;&#21382;&#21490;&#24615;&#30340;&#23156;&#20799;&#21644;&#32974;&#20799;&#27515;&#20129;&#29575;&#19979;&#38477;&#65292;&#31169;&#20154;&#24403;&#38138;&#27809;&#26377;&#36825;&#26679;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2305.09352</link><description>&lt;p&gt;
&#19996;&#20140;&#24037;&#19994;&#21270;&#26102;&#26399;&#20844;&#20849;&#24403;&#38138;&#23545;&#20581;&#24247;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Health Impacts of Public Pawnshops in Industrializing Tokyo. (arXiv:2305.09352v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.09352
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#21457;&#29616;&#20844;&#20849;&#24403;&#38138;&#30340;&#36151;&#27454;&#36129;&#29486;&#20102;&#21382;&#21490;&#24615;&#30340;&#23156;&#20799;&#21644;&#32974;&#20799;&#27515;&#20129;&#29575;&#19979;&#38477;&#65292;&#31169;&#20154;&#24403;&#38138;&#27809;&#26377;&#36825;&#26679;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26159;&#39318;&#27425;&#35843;&#26597;&#25910;&#20837;&#20302;&#19979;&#20154;&#21475;&#36130;&#21153;&#26426;&#26500;&#26159;&#21542;&#20419;&#36827;&#20102;&#21382;&#21490;&#24615;&#30340;&#27515;&#20129;&#29575;&#19979;&#38477;&#12290;&#25105;&#20204;&#20351;&#29992;&#25112;&#21069;&#19996;&#20140;&#24066;&#30340;&#21306;&#32423;&#38754;&#26495;&#25968;&#25454;&#21457;&#29616;&#65292;&#20844;&#20849;&#24403;&#38138;&#36151;&#27454;&#19982;&#23156;&#20799;&#21644;&#32974;&#20799;&#27515;&#20129;&#29575;&#30340;&#38477;&#20302;&#26377;&#20851;&#65292;&#21487;&#33021;&#26159;&#36890;&#36807;&#25913;&#21892;&#33829;&#20859;&#21644;&#21355;&#29983;&#25514;&#26045;&#23454;&#29616;&#30340;&#12290;&#31616;&#21333;&#35745;&#31639;&#34920;&#26126;&#65292;&#20174;1927&#24180;&#21040;1935&#24180;&#25512;&#24191;&#20844;&#20849;&#24403;&#38138;&#23548;&#33268;&#23156;&#20799;&#27515;&#20129;&#29575;&#21644;&#32974;&#20799;&#27515;&#20129;&#29575;&#20998;&#21035;&#19979;&#38477;&#20102;6%&#21644;8%&#12290;&#30456;&#21453;&#65292;&#31169;&#20154;&#24403;&#38138;&#27809;&#26377;&#19982;&#20581;&#24247;&#25913;&#21892;&#30340;&#26174;&#30528;&#20851;&#32852;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#20016;&#23500;&#20102;&#19981;&#26029;&#25193;&#22823;&#30340;&#20154;&#21475;&#32479;&#35745;&#21644;&#37329;&#34701;&#21382;&#21490;&#25991;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study is the first to investigate whether financial institutions for low-income populations have contributed to the historical decline in mortality rates. Using ward-level panel data from prewar Tokyo City, we found that public pawn loans were associated with reductions in infant and fetal death rates, potentially through improved nutrition and hygiene measures. Simple calculations suggest that popularizing public pawnshops led to a 6% and 8% decrease in infant mortality and fetal death rates, respectively, from 1927 to 1935. Contrarily, private pawnshops showed no significant association with health improvements. Our findings enrich the expanding literature on demographics and financial histories.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#36339;&#36291;&#25193;&#25955;&#27169;&#22411;&#19979;&#36830;&#32493;&#26102;&#38388;&#30340;&#21333;&#35843;&#22343;&#20540;&#26041;&#24046;&#32452;&#21512;&#36873;&#25321;&#65292;&#24182;&#39318;&#27425;&#32473;&#20986;&#20102;&#19981;&#21516;&#20110;&#20256;&#32479;&#22343;&#20540;&#26041;&#24046;&#20559;&#22909;&#30340;&#26126;&#30830;&#35299;&#20915;&#26041;&#26696;&#12290;&#35813;&#30740;&#31350;&#32467;&#26524;&#23545;&#20110;&#26410;&#26469;&#23545;&#21333;&#35843;&#22343;&#20540;&#26041;&#24046;&#21644;&#21333;&#35843;&#36164;&#26412;&#36164;&#20135;&#23450;&#20215;&#27169;&#22411;&#30340;&#23454;&#35777;&#27979;&#35797;&#20855;&#26377;&#37325;&#35201;&#30340;&#29702;&#35770;&#20381;&#25454;&#12290;</title><link>http://arxiv.org/abs/2211.12168</link><description>&lt;p&gt;
&#36830;&#32493;&#26102;&#38388;&#21333;&#35843;&#22343;&#20540;&#26041;&#24046;&#32452;&#21512;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Continuous-Time Monotone Mean-Variance Portfolio Selection. (arXiv:2211.12168v4 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.12168
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#36339;&#36291;&#25193;&#25955;&#27169;&#22411;&#19979;&#36830;&#32493;&#26102;&#38388;&#30340;&#21333;&#35843;&#22343;&#20540;&#26041;&#24046;&#32452;&#21512;&#36873;&#25321;&#65292;&#24182;&#39318;&#27425;&#32473;&#20986;&#20102;&#19981;&#21516;&#20110;&#20256;&#32479;&#22343;&#20540;&#26041;&#24046;&#20559;&#22909;&#30340;&#26126;&#30830;&#35299;&#20915;&#26041;&#26696;&#12290;&#35813;&#30740;&#31350;&#32467;&#26524;&#23545;&#20110;&#26410;&#26469;&#23545;&#21333;&#35843;&#22343;&#20540;&#26041;&#24046;&#21644;&#21333;&#35843;&#36164;&#26412;&#36164;&#20135;&#23450;&#20215;&#27169;&#22411;&#30340;&#23454;&#35777;&#27979;&#35797;&#20855;&#26377;&#37325;&#35201;&#30340;&#29702;&#35770;&#20381;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#36339;&#36291;&#25193;&#25955;&#27169;&#22411;&#19979;&#30340;&#36830;&#32493;&#26102;&#38388;&#21333;&#35843;&#22343;&#20540;&#26041;&#24046;(MMV)&#20559;&#22909;&#30340;&#32452;&#21512;&#36873;&#25321;&#65292;&#24182;&#32473;&#20986;&#20102;&#19982;&#20256;&#32479;&#22343;&#20540;&#26041;&#24046;(MV)&#20559;&#22909;&#19981;&#21516;&#30340;&#26126;&#30830;&#35299;&#20915;&#26041;&#26696;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;MMV&#30340;&#27169;&#31946;&#24230;&#27979;&#24230;&#21487;&#20197;&#38480;&#21046;&#22312;&#38750;&#36127;&#30340;Dol\'eans-Dade&#25351;&#25968;&#19978;&#12290;&#25105;&#20204;&#21457;&#29616;&#24403;&#37329;&#34701;&#24066;&#22330;&#30340;&#36339;&#36291;&#22823;&#23567;&#21487;&#20197;&#22823;&#20110;&#39118;&#38505;&#24066;&#22330;&#20215;&#26684;&#30340;&#20498;&#25968;&#26102;&#65292;MMV&#21487;&#20197;&#20462;&#22797;MV&#30340;&#38750;&#21333;&#35843;&#24615;&#12290;&#36825;&#20010;&#32467;&#26524;&#19982;Dybvig&#21644;Ingersoll&#30340;&#26368;&#26089;&#32467;&#26524;&#23436;&#20840;&#21487;&#27604;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#39564;&#35777;&#20102;&#20004;&#20010;&#22522;&#37329;&#30340;&#38548;&#31163;&#26377;&#25928;&#24615;&#65292;&#24182;&#24314;&#31435;&#20102;MMV&#25237;&#36164;&#32773;&#30340;&#21333;&#35843;&#36164;&#26412;&#36164;&#20135;&#23450;&#20215;&#27169;&#22411;&#65288;&#21333;&#35843;CAPM&#65289;&#12290;&#25105;&#20204;&#36824;&#30740;&#31350;&#20102;&#22312;&#38480;&#21046;&#20132;&#26131;&#27169;&#22411;&#20013;&#30340;MMV&#65292;&#24182;&#25552;&#20379;&#20102;&#19977;&#20010;&#20855;&#20307;&#30340;&#25968;&#20540;&#31034;&#20363;&#26469;&#23637;&#31034;MMV&#30340;&#25928;&#29575;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#21487;&#20197;&#25104;&#20026;&#26410;&#26469;&#23545;MMV&#21644;&#21333;&#35843;CAPM&#26377;&#25928;&#24615;&#36827;&#34892;&#23454;&#35777;&#27979;&#35797;&#30340;&#37325;&#35201;&#29702;&#35770;&#20381;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the continuous-time portfolio selection under monotone mean-variance (MMV) preferences in a jump-diffusion model and give an explicit solution different from that under classical mean-variance (MV) preferences for the first time. We prove that ambiguity measures of MMV can be restricted on non-negative Dol\'eans-Dade exponentials. We find that MMV can fix the non-monotonicity of MV when the jump size of the financial market can be larger than the inverse of the market price of risk. Such result is completely comparable to the earliest result of Dybvig and Ingersoll. Further, we verify the validity of two-fund separation and establish the monotone capital asset pricing model (monotone CAPM) for MMV investors. We also study MMV in a constrained trading model and provide three specific numerical examples to show MMV's efficiency. Our finding can be an important theoretical basis for future empirical tests of MMV and monotone CAPM's effectiveness.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21338;&#24328;&#35770;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#22312;&#38750;&#36229;&#32423;&#22823;&#22269;&#20855;&#26377;&#24322;&#36136;&#20559;&#22909;&#21644;&#36164;&#28304;&#20998;&#37197;&#30340;&#24773;&#20917;&#19979;&#65292;&#23427;&#20204;&#22914;&#20309;&#36890;&#36807;&#32852;&#30431;&#30340;&#24418;&#25104;&#26469;&#24433;&#21709;&#36229;&#32423;&#22823;&#22269;&#30340;&#31454;&#20105;&#65292;&#24182;&#25581;&#31034;&#20102;&#38750;&#36229;&#32423;&#22823;&#22269;&#23545;&#36229;&#32423;&#22823;&#22269;&#20855;&#26377;&#19968;&#23450;&#30340;&#24433;&#21709;&#21147;&#12290;</title><link>http://arxiv.org/abs/2209.10206</link><description>&lt;p&gt;
&#38750;&#36229;&#32423;&#22823;&#22269;&#30340;&#21147;&#37327;
&lt;/p&gt;
&lt;p&gt;
The Power of Non-Superpowers. (arXiv:2209.10206v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.10206
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21338;&#24328;&#35770;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#22312;&#38750;&#36229;&#32423;&#22823;&#22269;&#20855;&#26377;&#24322;&#36136;&#20559;&#22909;&#21644;&#36164;&#28304;&#20998;&#37197;&#30340;&#24773;&#20917;&#19979;&#65292;&#23427;&#20204;&#22914;&#20309;&#36890;&#36807;&#32852;&#30431;&#30340;&#24418;&#25104;&#26469;&#24433;&#21709;&#36229;&#32423;&#22823;&#22269;&#30340;&#31454;&#20105;&#65292;&#24182;&#25581;&#31034;&#20102;&#38750;&#36229;&#32423;&#22823;&#22269;&#23545;&#36229;&#32423;&#22823;&#22269;&#20855;&#26377;&#19968;&#23450;&#30340;&#24433;&#21709;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21338;&#24328;&#35770;&#27169;&#22411;&#65292;&#30740;&#31350;&#38750;&#36229;&#32423;&#22823;&#22269;&#22312;&#20855;&#26377;&#24322;&#36136;&#20559;&#22909;&#21644;&#36164;&#28304;&#20998;&#37197;&#30340;&#24773;&#20917;&#19979;&#22914;&#20309;&#22609;&#36896;&#36229;&#32423;&#22823;&#22269;&#22312;&#21183;&#21147;&#33539;&#22260;&#20869;&#30340;&#31454;&#20105;&#12290;&#20004;&#20010;&#36229;&#32423;&#22823;&#22269;&#36827;&#34892;&#25552;&#20379;&#20465;&#20048;&#37096;&#20844;&#20849;&#21697;&#30340;&#26031;&#22612;&#20811;&#23572;&#20271;&#26684;&#21338;&#24328;&#65292;&#32780;&#38750;&#36229;&#32423;&#22823;&#22269;&#21017;&#36890;&#36807;&#24418;&#25104;&#32852;&#30431;&#26469;&#21152;&#20837;&#20465;&#20048;&#37096;&#24182;&#32771;&#34385;&#22806;&#37096;&#24615;&#30340;&#23384;&#22312;&#12290;&#32852;&#30431;&#30340;&#24418;&#25104;&#21462;&#20915;&#20110;&#38750;&#36229;&#32423;&#22823;&#22269;&#30340;&#29305;&#24449;&#65292;&#24433;&#21709;&#30528;&#36229;&#32423;&#22823;&#22269;&#30340;&#34892;&#20026;&#65292;&#20174;&#32780;&#24433;&#21709;&#20465;&#20048;&#37096;&#30340;&#35268;&#27169;&#12290;&#20174;&#36825;&#20010;&#24847;&#20041;&#19978;&#35828;&#65292;&#38750;&#36229;&#32423;&#22823;&#22269;&#23545;&#36229;&#32423;&#22823;&#22269;&#25317;&#26377;&#19968;&#23450;&#30340;&#24433;&#21709;&#21147;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#23376;&#21338;&#24328;&#23436;&#32654;&#32435;&#20160;&#22343;&#34913;&#65292;&#24182;&#27169;&#25311;&#20102;&#28216;&#25103;&#65292;&#20197;&#25551;&#32472;&#32654;&#22269;&#21644;&#20013;&#22269;&#22914;&#20309;&#26681;&#25454;&#20854;&#20182;&#22269;&#23478;&#26469;&#24418;&#25104;&#20182;&#20204;&#30340;&#20465;&#20048;&#37096;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a game-theoretic model to investigate how non-superpowers with heterogenous preferences and endowments shape the superpower competition for a sphere of influence. Two superpowers play a Stackelberg game of providing club goods while non-superpowers form coalitions to join a club in the presence of externalities. The coalition formation, which depends on the characteristics of non-superpowers, influences the behavior of superpowers and thus the club size. In this sense, non-superpowers have a power over superpowers. We study the subgame perfect Nash equilibrium and simulate the game to characterize how the US and China form their clubs depending on other countries.
&lt;/p&gt;</description></item></channel></rss>