<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#23558;&#27491;&#20132;Chebyshev&#28369;&#21160;&#25216;&#26415;&#24212;&#29992;&#20110;&#22522;&#20110;&#29616;&#36135;&#26631;&#30340;&#29289;&#30340;&#32929;&#31080;&#33258;&#21160;&#25970;&#20986;&#26399;&#26435;&#32452;&#21512;&#65292;&#23454;&#29616;&#20102;&#35745;&#31639;&#25104;&#26412;&#30340;&#26174;&#33879;&#38477;&#20302;&#65292;&#20026;&#35299;&#20915;&#39640;&#25928;FRTB-IMA&#35745;&#31639;&#25361;&#25112;&#36808;&#20986;&#20102;&#37325;&#35201;&#30340;&#19968;&#27493;&#12290;</title><link>http://arxiv.org/abs/2305.06215</link><description>&lt;p&gt;
FRTB-IMA&#19979;&#22522;&#20110;&#27491;&#20132;Chebyshev&#28369;&#21160;&#25216;&#26415;&#30340;&#32929;&#31080;&#33258;&#21160;&#25970;&#20986;&#26399;&#26435;&#35745;&#31639;&#25361;&#25112;
&lt;/p&gt;
&lt;p&gt;
The FRTB-IMA computational challenge for Equity Autocallables. (arXiv:2305.06215v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.06215
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23558;&#27491;&#20132;Chebyshev&#28369;&#21160;&#25216;&#26415;&#24212;&#29992;&#20110;&#22522;&#20110;&#29616;&#36135;&#26631;&#30340;&#29289;&#30340;&#32929;&#31080;&#33258;&#21160;&#25970;&#20986;&#26399;&#26435;&#32452;&#21512;&#65292;&#23454;&#29616;&#20102;&#35745;&#31639;&#25104;&#26412;&#30340;&#26174;&#33879;&#38477;&#20302;&#65292;&#20026;&#35299;&#20915;&#39640;&#25928;FRTB-IMA&#35745;&#31639;&#25361;&#25112;&#36808;&#20986;&#20102;&#37325;&#35201;&#30340;&#19968;&#27493;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23558;&#27491;&#20132;Chebyshev&#28369;&#21160;&#25216;&#26415;&#24212;&#29992;&#20110;&#19968;&#31995;&#21015;&#22522;&#20110;&#29616;&#36135;&#26631;&#30340;&#29289;&#30340;&#32929;&#31080;&#33258;&#21160;&#25970;&#20986;&#26399;&#26435;&#32452;&#21512;&#65292;&#20197;&#38477;&#20302;FRTB-IMA&#19979;&#36164;&#26412;&#35745;&#31639;&#30340;ES&#20540;&#35745;&#31639;&#25104;&#26412;&#65292;&#23454;&#29616;&#35745;&#31639;&#24615;&#33021;&#20248;&#21270;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#30456;&#27604;&#20110;&#20256;&#32479;&#26041;&#27861;&#65292;&#35745;&#31639;&#25104;&#26412;&#20943;&#23569;&#20102;&#32422;90&#65285;&#65292;&#28385;&#36275;&#20102;PLA&#27979;&#35797;&#35201;&#27714;&#12290;&#26412;&#25991;&#30340;&#30740;&#31350;&#20026;&#35299;&#20915;&#23454;&#29616;&#39640;&#25928;FRTB-IMA&#35745;&#31639;&#25152;&#38754;&#20020;&#30340;&#25361;&#25112;&#36808;&#20986;&#20102;&#37325;&#35201;&#30340;&#19968;&#27493;&#65292;&#21516;&#26102;&#21487;&#36866;&#29992;&#20110;&#32929;&#31080;&#33258;&#21160;&#25970;&#20986;&#26399;&#26435;&#31561;&#24120;&#35265;&#30340;&#22797;&#26434;&#20132;&#26131;&#31867;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
In \cite{rz_slider_wilmott}, the Orthogonal Chebyshev Sliding Technique was introduced and applied to a portfolio of swaps and swaptions within the context of the FRTB-IMA capital calculation. The computational cost associated to the computation of the ES values - an essential component of the capital caluclation under FRTB-IMA - was reduced by more than $90\%$ while passing PLA tests.  This paper extends the use of the Orthogonal Chebyshev Sliding Technique to portfolios of equity autocallables defined over a range of spot underlyings. Results are very positive as computational reductions are of about $90\%$ with passing PLA metrics.  Since equity autocallables are a commonly traded exotic trade type, with significant FRTB-IMA computational costs, the extension presented in this paper constitutes an imporant step forward in tackling the computational challenges associated to an efficient FRTB-IMA implementation.
&lt;/p&gt;</description></item></channel></rss>