<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#38024;&#23545;&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;&#26102;&#38388;&#31215;&#20998;&#30340;&#25289;&#26222;&#25289;&#26031;&#21464;&#25442;&#32473;&#20986;&#20102;&#22312; $\sigma^2T\to0$ &#26102;&#30340;&#31934;&#30830;&#28176;&#36817;&#32467;&#26524;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#38543;&#26426;&#21033;&#29575;Dothan&#27169;&#22411;&#20013;&#30340;&#38646;&#31080;&#20538;&#21048;&#23450;&#20215;&#12290;&#27492;&#28176;&#36817;&#32467;&#26524;&#20026;&#20538;&#21048;&#20215;&#26684;&#25552;&#20379;&#20102;&#19968;&#20010;&#36817;&#20284;&#20540;&#65292;&#21516;&#26102;&#36824;&#32473;&#20986;&#20102;Black-Scholes&#27169;&#22411;&#20013;Asian&#26399;&#26435;&#20215;&#26684;&#30340;&#28176;&#36817;&#24615;&#36136;&#12290;</title><link>http://arxiv.org/abs/2306.09084</link><description>&lt;p&gt;
&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;&#26102;&#38388;&#31215;&#20998;&#30340;&#25289;&#26222;&#25289;&#26031;&#21464;&#25442;&#30340;&#28176;&#36817;&#24615;&#36136;
&lt;/p&gt;
&lt;p&gt;
Asymptotics for the Laplace transform of the time integral of the geometric Brownian motion. (arXiv:2306.09084v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09084
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#38024;&#23545;&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;&#26102;&#38388;&#31215;&#20998;&#30340;&#25289;&#26222;&#25289;&#26031;&#21464;&#25442;&#32473;&#20986;&#20102;&#22312; $\sigma^2T\to0$ &#26102;&#30340;&#31934;&#30830;&#28176;&#36817;&#32467;&#26524;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#38543;&#26426;&#21033;&#29575;Dothan&#27169;&#22411;&#20013;&#30340;&#38646;&#31080;&#20538;&#21048;&#23450;&#20215;&#12290;&#27492;&#28176;&#36817;&#32467;&#26524;&#20026;&#20538;&#21048;&#20215;&#26684;&#25552;&#20379;&#20102;&#19968;&#20010;&#36817;&#20284;&#20540;&#65292;&#21516;&#26102;&#36824;&#32473;&#20986;&#20102;Black-Scholes&#27169;&#22411;&#20013;Asian&#26399;&#26435;&#20215;&#26684;&#30340;&#28176;&#36817;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32473;&#20986;&#20102;&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;&#26102;&#38388;&#31215;&#20998; $X_T = \int_0^T e^{\sigma W_s + ( a - \frac12 \sigma^2)s} ds$ &#30340;&#25289;&#26222;&#25289;&#26031;&#21464;&#25442; $F(\theta,T) = \mathbb{E}[e^{-\theta X_T}]$ &#30340;&#28176;&#36817;&#24615;&#36136;&#12290;&#24403; $\sigma^2T\to0$ &#26102;&#65292;&#28176;&#36817;&#32467;&#26524;&#22312;&#22266;&#23450; $\sigma^2\theta T^2$ &#21644; $aT$ &#30340;&#24773;&#20917;&#19979;&#26159;&#31934;&#30830;&#30340;&#12290;&#35813;&#28176;&#36817;&#32467;&#26524;&#34987;&#24212;&#29992;&#20110;&#38543;&#26426;&#21033;&#29575;&#30340;Dothan&#27169;&#22411;&#20013;&#30340;&#38646;&#31080;&#20538;&#21048;&#23450;&#20215;&#12290;&#27492;&#28176;&#36817;&#32467;&#26524;&#20026;&#20538;&#21048;&#20215;&#26684;&#25552;&#20379;&#20102;&#19968;&#20010;&#36817;&#20284;&#20540;&#65292;&#24182;&#19988;&#22312;&#21508;&#31181;&#27169;&#22411;&#21442;&#25968;&#30340;&#33539;&#22260;&#20869;&#19982;&#25968;&#20540;&#35780;&#20272;&#32467;&#26524;&#30456;&#19968;&#33268;&#12290;&#20316;&#20026;&#19968;&#20010;&#38468;&#24102;&#32467;&#26524;&#65292;&#25105;&#20204;&#23558;&#22266;&#23450; $\sigma^{2}T\to 0$ &#26102;&#65292;&#26681;&#25454;&#21033;&#29575;&#21644;&#32929;&#24687;&#25269;&#28040;&#30340; $\sigma^{2}T\to 0$ &#26497;&#38480;&#32467;&#26524;&#32771;&#34385;&#22312;Black-Scholes&#27169;&#22411;&#20013;Asian&#26399;&#26435;&#20215;&#26684;&#30340;&#28176;&#36817;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present an asymptotic result for the Laplace transform of the time integral of the geometric Brownian motion $F(\theta,T) = \mathbb{E}[e^{-\theta X_T}]$ with $X_T = \int_0^T e^{\sigma W_s + ( a - \frac12 \sigma^2)s} ds$, which is exact in the limit $\sigma^2 T \to 0$ at fixed $\sigma^2 \theta T^2$ and $aT$. This asymptotic result is applied to pricing zero coupon bonds in the Dothan model of stochastic interest rates. The asymptotic result provides an approximation for bond prices which is in good agreement with numerical evaluations in a wide range of model parameters. As a side result we obtain the asymptotics for Asian option prices in the Black-Scholes model, taking into account interest rates and dividend yield contributions in the $\sigma^{2}T\to 0$ limit.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#24314;&#31435;&#20102;&#31227;&#27665;&#21171;&#24037;&#21450;&#20854;&#38599;&#20027;&#30340;&#20248;&#21270;&#26426;&#21046;&#27169;&#22411;&#65292;&#21457;&#29616;&#23487;&#20027;&#22269;&#30340;&#25216;&#33021;&#30456;&#20851;&#24615;&#21644;&#24037;&#36164;&#24046;&#24322;&#21576;&#27491;&#30456;&#20851;&#65292;&#31227;&#27665;&#22269;&#30340;&#25216;&#33021;&#30456;&#20851;&#24615;&#21644;&#24037;&#36164;&#24046;&#24322;&#21576;&#36127;&#30456;&#20851;&#12290;&#36825;&#20026;&#25506;&#32034;&#31227;&#27665;&#21171;&#21160;&#21147;&#24066;&#22330;&#25552;&#20379;&#20102;&#37325;&#35201;&#30340;&#21442;&#32771;&#12290;</title><link>http://arxiv.org/abs/2306.08829</link><description>&lt;p&gt;
&#23601;&#19994;&#35768;&#21487;&#21046;&#24230;&#65288;EPS&#65289;&#19979;&#31227;&#27665;&#21171;&#24037;&#30340;&#20248;&#21270;&#26426;&#21046;&#65306;&#24341;&#20837;&#21644;&#20998;&#26512;&#8220;&#25216;&#33021;&#30456;&#20851;&#24615;&#33258;&#25105;&#36873;&#25321;&#8221;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Migrant Laborer's Optimization Mechanism Under Employment Permit System(EPS): Introducing and Analyzing 'Skill-Relevance-Self Selection' Model. (arXiv:2306.08829v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08829
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#24314;&#31435;&#20102;&#31227;&#27665;&#21171;&#24037;&#21450;&#20854;&#38599;&#20027;&#30340;&#20248;&#21270;&#26426;&#21046;&#27169;&#22411;&#65292;&#21457;&#29616;&#23487;&#20027;&#22269;&#30340;&#25216;&#33021;&#30456;&#20851;&#24615;&#21644;&#24037;&#36164;&#24046;&#24322;&#21576;&#27491;&#30456;&#20851;&#65292;&#31227;&#27665;&#22269;&#30340;&#25216;&#33021;&#30456;&#20851;&#24615;&#21644;&#24037;&#36164;&#24046;&#24322;&#21576;&#36127;&#30456;&#20851;&#12290;&#36825;&#20026;&#25506;&#32034;&#31227;&#27665;&#21171;&#21160;&#21147;&#24066;&#22330;&#25552;&#20379;&#20102;&#37325;&#35201;&#30340;&#21442;&#32771;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21463;&#38889;&#22269;&#23601;&#19994;&#35768;&#21487;&#21046;&#24230; (EPS) &#32422;&#26463;&#30340;&#31227;&#27665;&#21171;&#24037;&#24517;&#39035;&#22312;&#32771;&#34385;&#8220;&#31227;&#27665;&#24102;&#26469;&#30340;&#25216;&#33021;&#30456;&#20851;&#24615;&#36140;&#20540;&#8221;&#21644;&#8220;&#31227;&#27665;&#25104;&#26412;&#8221;&#30340;&#21516;&#26102;&#65292;&#22312;&#23487;&#20027;&#22269;&#30340;&#39640;&#24037;&#36164;&#19982;&#20043;&#38388;&#21462;&#24471;&#24179;&#34913;&#12290;&#26412;&#30740;&#31350;&#24314;&#31435;&#20102;&#31227;&#27665;&#21171;&#24037;&#21450;&#38599;&#20323;&#20182;&#20204;&#30340;&#20844;&#21496;&#30340;&#20248;&#21270;&#26426;&#21046;&#27169;&#22411;&#65292;&#24182;&#21033;&#29992;&#21338;&#24328;&#35770;&#30340;&#8220;&#21453;&#21521;&#24402;&#32435;&#8221;&#26041;&#27861;&#24471;&#21040;&#20102;&#27169;&#22411;&#30340;&#35299;&#65292;&#21363;&#36798;&#21040;&#8220;&#23376;&#21338;&#24328;&#23436;&#32654;&#32435;&#20160;&#22343;&#34913; (SPNE)&#8221;&#12290;&#36890;&#36807;&#20998;&#26512; SPNE &#29366;&#24577;&#19979;&#21464;&#37327;&#20043;&#38388;&#30340;&#21160;&#24577;&#20851;&#31995;&#65292;&#24471;&#20986;&#20102;&#20197;&#19979;&#26679;&#24335;&#21270;&#20107;&#23454;&#65306;[1]&#23487;&#20027;&#22269;&#30340;&#25216;&#33021;&#30456;&#20851;&#24615;&#21644;&#24037;&#36164;&#24046;&#24322;&#21576;&#27491;&#30456;&#20851;&#65307;[2]&#31227;&#27665;&#22269;&#30340;&#25216;&#33021;&#30456;&#20851;&#24615;&#21644;&#24037;&#36164;&#24046;&#24322;&#21576;&#36127;&#30456;&#20851;&#12290;&#36825;&#20004;&#20010;&#26679;&#24335;&#21270;&#20107;&#23454;&#8212;&#8212;[1&#12289;2]&#8212;&#8212;&#20998;&#21035;&#34987;&#25805;&#20316;&#21270;&#20026;&#8220;&#23487;&#20027;&#22269;&#25216;&#33021;&#30456;&#20851;&#24615;&#20551;&#35828; (H1)&#8221;&#21644;&#8220;&#31227;&#27665;&#22269;&#25216;&#33021;&#30456;&#20851;&#24615;&#20551;&#35828; (H2)&#8221;&#65292;&#24182;&#36890;&#36807;OLS&#32447;&#24615;&#22238;&#24402;&#20998;&#26512;&#36827;&#34892;&#20102;&#24443;&#24213;&#30340;&#26816;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;
Migrant laborers subject to ROK's Employment Permit System(EPS) must strike a balance between host country's high wage and 'Depreciation of skill-relevance entailed by immigration', whilst taking account of the 'migration costs'. This study modelizes the optimization mechanism of migrant workers and the firms hiring them -- then induces the solution of the very model, namely, 'Subgame Perfect Nash Equilibrium(SPNE)', by utilizing game theory's 'backward induction' method. Analyzing the dynamics between variables at SPNE state, the attained stylized facts are what as follows; [1]Host nation's skill-relevance and wage differential have positive correlation. [2]Emigrating nation's skill-relevance and wage differential have negative correlation. Both stylized facts -- [1,2] -- are operationalized into 'Host nation skill-relevance hypothesis(H1)' and 'Emigrating nation skill-relevance hypothesis(H2)', respectively; of which are thoroughly tested by OLS linear regression analysis. In all sex
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#38024;&#23545;&#22810;&#20010;&#21046;&#24230;&#23384;&#22312;&#30340;&#24066;&#22330;&#20013;&#65292;&#32467;&#21512;&#21160;&#24577;&#35268;&#21010;&#21644;&#31070;&#32463;&#32593;&#32476;&#30340;&#26041;&#27861;&#65292;&#26377;&#25928;&#20248;&#21270;&#20102;&#38750;&#32447;&#24615;&#20914;&#20987;&#25104;&#26412;&#19979;&#30340;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#25191;&#34892;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2306.08809</link><description>&lt;p&gt;
&#38750;&#32447;&#24615;&#20914;&#20987;&#25104;&#26412;&#19979;&#30340;&#21046;&#24230;&#36716;&#25442;&#24066;&#22330;&#20013;&#30340;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#25191;&#34892;&#65306;&#32467;&#21512;&#21160;&#24577;&#35268;&#21010;&#21644;&#31070;&#32463;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
Optimal Portfolio Execution in a Regime-switching Market with Non-linear Impact Costs: Combining Dynamic Program and Neural Network. (arXiv:2306.08809v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08809
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#38024;&#23545;&#22810;&#20010;&#21046;&#24230;&#23384;&#22312;&#30340;&#24066;&#22330;&#20013;&#65292;&#32467;&#21512;&#21160;&#24577;&#35268;&#21010;&#21644;&#31070;&#32463;&#32593;&#32476;&#30340;&#26041;&#27861;&#65292;&#26377;&#25928;&#20248;&#21270;&#20102;&#38750;&#32447;&#24615;&#20914;&#20987;&#25104;&#26412;&#19979;&#30340;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#25191;&#34892;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#26500;&#25237;&#36164;&#32773;&#30340;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#25191;&#34892;&#19968;&#30452;&#26159;&#19968;&#20010;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#38382;&#39064;&#12290;&#20132;&#26131;&#32773;&#38754;&#20020;&#24179;&#22343;&#20132;&#26131;&#20215;&#26684;&#21644;&#19981;&#30830;&#23450;&#24615;&#20043;&#38388;&#30340;&#26435;&#34913;&#65292;&#20256;&#32479;&#26041;&#27861;&#21463;&#21040;&#20102;&#32500;&#25968;&#28798;&#38590;&#30340;&#24433;&#21709;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22235;&#27493;&#25968;&#20540;&#26694;&#26550;&#65292;&#29992;&#20110;&#35299;&#20915;&#22810;&#20010;&#24066;&#22330;&#21046;&#24230;&#23384;&#22312;&#30340;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#25191;&#34892;&#38382;&#39064;&#65292;&#20854;&#20013;&#22522;&#20110;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#30340;&#22522;&#30784;&#21046;&#24230;&#36716;&#25442;&#12290;&#24066;&#22330;&#20914;&#20987;&#25104;&#26412;&#20197;&#26242;&#26102;&#37096;&#20998;&#21644;&#27704;&#20037;&#37096;&#20998;&#24314;&#27169;&#65292;&#20854;&#20013;&#21069;&#32773;&#20165;&#24433;&#21709;&#24403;&#21069;&#20132;&#26131;&#65292;&#32780;&#21518;&#32773;&#20855;&#26377;&#25345;&#20037;&#24615;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#25509;&#21463;&#36890;&#29992;&#24418;&#24335;&#30340;&#20914;&#20987;&#25104;&#26412;&#20989;&#25968;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#26681;&#25454;&#20272;&#35745;&#30340;&#20132;&#26131;&#25104;&#26412;&#20989;&#25968;&#35745;&#31639;&#36817;&#20284;&#27491;&#20132;&#32452;&#21512;&#65307;&#31532;&#20108;&#65292;&#25105;&#20204;&#21033;&#29992;&#21160;&#24577;&#35268;&#21010;&#23398;&#20064;&#27599;&#20010;&#36817;&#20284;&#27491;&#20132;&#32452;&#21512;&#30340;&#26368;&#20248;&#21334;&#20986;&#26102;&#38388;&#34920;&#65307;&#31532;&#19977;&#65292;&#31070;&#32463;&#32593;&#32476;&#30340;&#26435;&#37325;&#20351;&#29992;&#21069;&#19968;&#27493;&#39588;&#24314;&#35758;&#30340;&#31574;&#30053;&#36827;&#34892;&#39044;&#35757;&#32451;&#65307;&#26368;&#21518;&#65292;&#35757;&#32451;&#31070;&#32463;&#32593;&#32476;&#20197;&#20248;&#21270;&#26242;&#26102;&#21644;&#27704;&#20037;&#24066;&#22330;&#20914;&#20987;&#25104;&#26412;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;&#25105;&#20204;&#36890;&#36807;&#25968;&#20540;&#27169;&#25311;&#21644;&#32463;&#39564;&#30740;&#31350;&#27979;&#35797;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#24615;&#33021;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#21487;&#20197;&#26377;&#25928;&#22320;&#20248;&#21270;&#22312;&#38750;&#32447;&#24615;&#20914;&#20987;&#25104;&#26412;&#19979;&#30340;&#21046;&#24230;&#36716;&#25442;&#24066;&#22330;&#20013;&#30340;&#25237;&#36164;&#32452;&#21512;&#25191;&#34892;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
Optimal execution of a portfolio have been a challenging problem for institutional investors. Traders face the trade-off between average trading price and uncertainty, and traditional methods suffer from the curse of dimensionality. Here, we propose a four-step numerical framework for the optimal portfolio execution problem where multiple market regimes exist, with the underlying regime switching based on a Markov process. The market impact costs are modelled with a temporary part and a permanent part, where the former affects only the current trade while the latter persists. Our approach accepts impact cost functions in generic forms. First, we calculate the approximated orthogonal portfolios based on estimated impact cost functions; second, we employ dynamic program to learn the optimal selling schedule of each approximated orthogonal portfolio; third, weights of a neural network are pre-trained with the strategy suggested by previous step; last, we train the neural network to optimi
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#38024;&#23545;&#24052;&#35199;&#65292;&#21033;&#29992;2003&#24180;&#33267;2017&#24180;&#26399;&#38388;&#30340;&#38599;&#20027;-&#21592;&#24037;&#35760;&#24405;&#21644;&#20225;&#19994;&#31246;&#21153;&#20449;&#24687;&#30740;&#31350;&#20102;&#24182;&#36141;&#23545;&#21171;&#21160;&#24066;&#22330;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#24182;&#36141;&#20250;&#23548;&#33268;&#24066;&#22330;&#35268;&#27169;&#19979;&#38477;&#65292;&#38599;&#20323;&#35843;&#25972;&#38598;&#20013;&#22312;&#21512;&#24182;&#20225;&#19994;&#20013;&#65292;&#32780;&#19981;&#28041;&#21450;&#24182;&#36141;&#30340;&#20225;&#19994;&#24037;&#20154;&#25910;&#20837;&#19979;&#38477;&#65292;&#35268;&#27169;&#22686;&#38271;&#12290;&#22823;&#22810;&#25968;&#24182;&#36141;&#23545;&#20110;&#24066;&#22330;&#21344;&#26377;&#24230;&#30340;&#21464;&#21270;&#27809;&#26377;&#39044;&#27979;&#24433;&#21709;&#12290;&#22312;&#24052;&#35199;&#21171;&#21160;&#24066;&#22330;&#27809;&#26377;&#21457;&#29616;&#23521;&#22836;&#22404;&#26029;&#34892;&#20026;&#30340;&#35777;&#25454;&#12290;</title><link>http://arxiv.org/abs/2306.08797</link><description>&lt;p&gt;
&#21457;&#23637;&#20013;&#22269;&#23478;&#20013;&#24182;&#36141;&#23545;&#26412;&#22320;&#21171;&#21160;&#24066;&#22330;&#30340;&#24433;&#21709;&#65306;&#20197;&#24052;&#35199;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
Local Labor Market Effects of Mergers and Acquisitions in Developing Countries: Evidence from Brazil. (arXiv:2306.08797v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08797
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#38024;&#23545;&#24052;&#35199;&#65292;&#21033;&#29992;2003&#24180;&#33267;2017&#24180;&#26399;&#38388;&#30340;&#38599;&#20027;-&#21592;&#24037;&#35760;&#24405;&#21644;&#20225;&#19994;&#31246;&#21153;&#20449;&#24687;&#30740;&#31350;&#20102;&#24182;&#36141;&#23545;&#21171;&#21160;&#24066;&#22330;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#24182;&#36141;&#20250;&#23548;&#33268;&#24066;&#22330;&#35268;&#27169;&#19979;&#38477;&#65292;&#38599;&#20323;&#35843;&#25972;&#38598;&#20013;&#22312;&#21512;&#24182;&#20225;&#19994;&#20013;&#65292;&#32780;&#19981;&#28041;&#21450;&#24182;&#36141;&#30340;&#20225;&#19994;&#24037;&#20154;&#25910;&#20837;&#19979;&#38477;&#65292;&#35268;&#27169;&#22686;&#38271;&#12290;&#22823;&#22810;&#25968;&#24182;&#36141;&#23545;&#20110;&#24066;&#22330;&#21344;&#26377;&#24230;&#30340;&#21464;&#21270;&#27809;&#26377;&#39044;&#27979;&#24433;&#21709;&#12290;&#22312;&#24052;&#35199;&#21171;&#21160;&#24066;&#22330;&#27809;&#26377;&#21457;&#29616;&#23521;&#22836;&#22404;&#26029;&#34892;&#20026;&#30340;&#35777;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;2003&#24180;&#33267;2017&#24180;&#26399;&#38388;&#21305;&#37197;&#30340;&#38599;&#20027;-&#21592;&#24037;&#35760;&#24405;&#21644;&#20225;&#19994;&#31246;&#21153;&#20449;&#24687;&#65292;&#20272;&#35745;&#20102;&#24052;&#35199;&#24182;&#36141;&#23545;&#25972;&#20010;&#21171;&#21160;&#24066;&#22330;&#30340;&#24433;&#21709;&#12290;&#23558;&#21171;&#21160;&#24066;&#22330;&#23450;&#20041;&#20026;&#36890;&#21220;&#21306;&#21644;&#34892;&#19994;&#37096;&#38376;&#30340;&#32452;&#21512;&#12290;&#24182;&#36141;&#30340;&#19979;&#19968;&#24180;&#65292;&#24066;&#22330;&#35268;&#27169;&#19979;&#38477;&#20102;10.8%&#12290;&#38599;&#20323;&#35843;&#25972;&#38598;&#20013;&#22312;&#21512;&#24182;&#20225;&#19994;&#20013;&#12290;&#23545;&#20110;&#26410;&#28041;&#21450;&#24182;&#36141;&#30340;&#20225;&#19994;&#65292;&#25105;&#20272;&#35745;&#24037;&#20154;&#25910;&#20837;&#19979;&#38477;&#20102;1.07&#65285;&#65292;&#20294;&#35268;&#27169;&#21576;&#27491;&#22686;&#38271;&#36235;&#21183;&#65292;&#23613;&#31649;&#27809;&#26377;&#26174;&#33879;&#22686;&#38271;&#12290;&#22823;&#22810;&#25968;&#24182;&#36141;&#23545;&#20110;&#24066;&#22330;&#21344;&#26377;&#24230;&#30340;&#21464;&#21270;&#27809;&#26377;&#39044;&#27979;&#24433;&#21709;&#65292;&#20197;&#21704;&#22827;&#26364;-&#36203;&#24076;&#26364;&#25351;&#25968;&#65288;HHI&#65289;&#20026;&#34913;&#37327;&#26631;&#20934;&#12290;&#23545;&#20110;&#38468;&#24102;&#25928;&#24212;&#30340;&#20225;&#19994;&#26469;&#35828;&#65292;&#19982;HHI&#21464;&#21270;&#26174;&#33879;&#24615;&#30456;&#27604;&#65292;&#25910;&#20837;&#19979;&#38477;&#24773;&#20917;&#30456;&#20284;&#12290;&#19982;&#21457;&#36798;&#32463;&#27982;&#20307;&#24066;&#22330;&#21344;&#26377;&#24230;&#26368;&#36817;&#30340;&#25991;&#29486;&#30456;&#21453;&#65292;&#22312;&#24052;&#35199;&#21171;&#21160;&#24066;&#22330;&#27809;&#26377;&#23521;&#22836;&#22404;&#26029;&#34892;&#20026;&#30340;&#35777;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
I use matched employer-employee records merged with corporate tax information from 2003 to 2017 to estimate labor market-wide effects of mergers and acquisitions in Brazil. Labor markets are defined by pairs of commuting zone and industry sector. In the following year of a merger, market size falls by 10.8%. The employment adjustment is concentrated in merging firms. For the firms not involved in M&amp;As, I estimate a 1.07% decline in workers earnings and a positive, although not significant, increase in their size. Most mergers have a predicted impact of zero points in concentration, measured by the Herfindahl-Hirschman Index (HHI). I spillover firms, earnings decline similarly for mergers with high and low predicted changes in HHI. Contrary to the recent literature on market concentration in developed economies, I find no evidence of oligopsonistic behavior in Brazilian labor markets.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#23545;&#23450;&#37327;&#34913;&#37327;&#21516;&#36136;&#20135;&#19994;&#20869;&#36164;&#28304;&#38169;&#37197;&#30340;&#24120;&#35268;&#26041;&#27861;&#36827;&#34892;&#20102;&#37325;&#26032;&#35780;&#20272;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24050;&#35782;&#21035;&#30340;&#25919;&#31574;&#21464;&#21270;&#30340;&#27604;&#36739;&#20998;&#26512;&#31574;&#30053;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#37329;&#34701;&#21361;&#26426;&#23545;&#29983;&#20135;&#35201;&#32032;&#30340;&#24433;&#21709;&#23548;&#33268;&#36164;&#28304;&#37197;&#32622;&#20005;&#37325;&#22833;&#35843;&#65292;&#32780;&#25919;&#31574;&#24178;&#39044;&#21487;&#33021;&#20250;&#25439;&#23475;&#25972;&#20307;&#32463;&#27982;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2306.08760</link><description>&lt;p&gt;
&#29983;&#20135;&#29575;&#12289;&#35201;&#32032;&#38169;&#37197;&#19982;&#37329;&#34701;&#21361;&#26426;
&lt;/p&gt;
&lt;p&gt;
Productivity, Inputs Misallocation, and the Financial Crisis. (arXiv:2306.08760v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08760
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#23450;&#37327;&#34913;&#37327;&#21516;&#36136;&#20135;&#19994;&#20869;&#36164;&#28304;&#38169;&#37197;&#30340;&#24120;&#35268;&#26041;&#27861;&#36827;&#34892;&#20102;&#37325;&#26032;&#35780;&#20272;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24050;&#35782;&#21035;&#30340;&#25919;&#31574;&#21464;&#21270;&#30340;&#27604;&#36739;&#20998;&#26512;&#31574;&#30053;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#37329;&#34701;&#21361;&#26426;&#23545;&#29983;&#20135;&#35201;&#32032;&#30340;&#24433;&#21709;&#23548;&#33268;&#36164;&#28304;&#37197;&#32622;&#20005;&#37325;&#22833;&#35843;&#65292;&#32780;&#25919;&#31574;&#24178;&#39044;&#21487;&#33021;&#20250;&#25439;&#23475;&#25972;&#20307;&#32463;&#27982;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#35780;&#20272;&#20102;&#23450;&#37327;&#34913;&#37327;&#21516;&#36136;&#20135;&#19994;&#20869;&#36164;&#28304;&#38169;&#37197;&#30340;&#24120;&#35268;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36890;&#24120;&#20351;&#29992;&#19968;&#20010;&#36755;&#20837;&#36793;&#38469;&#20135;&#21697;&#30340;&#31163;&#25955;&#24230;&#26469;&#34913;&#37327;&#12290;&#25105;&#30340;&#30740;&#31350;&#21457;&#29616;&#65292;&#36825;&#19968;&#32479;&#35745;&#37327;&#21253;&#25324;&#22266;&#26377;&#30340;&#29983;&#20135;&#29575;&#24322;&#36136;&#24615;&#21644;&#29305;&#26377;&#30340;&#29983;&#20135;&#29575;&#20914;&#20987;&#65292;&#32780;&#19981;&#32771;&#34385;&#25152;&#30740;&#31350;&#30340;&#36755;&#20837;&#12290;&#21033;&#29992;&#32654;&#22269;&#21644;&#27431;&#27954;&#21046;&#36896;&#19994;&#20844;&#21496;&#30340;&#36164;&#20135;&#36127;&#20538;&#34920;&#25968;&#25454;&#65292;&#25105;&#21457;&#29616;&#24635;&#29983;&#20135;&#35201;&#32032;&#29983;&#20135;&#29575;&#27874;&#21160;&#20540;&#21344;&#36164;&#26412;&#36793;&#38469;&#20135;&#21697;&#30340;&#26041;&#24046;&#30340;7&#65285;&#65292;&#21171;&#21160;&#21147;&#20026;9&#65285;&#65292;&#26448;&#26009;&#36755;&#20837;&#20026;10&#65285;&#12290;&#22240;&#27492;&#65292;&#36825;&#20010;&#25351;&#25968;&#20197;&#34920;&#38754;&#20215;&#20540;&#34920;&#31034;&#26102;&#65292;&#26080;&#27861;&#35782;&#21035;&#20986;&#20219;&#20309;&#29983;&#20135;&#35201;&#32032;&#30340;&#25919;&#31574;&#24341;&#21457;&#30340;&#38169;&#37197;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#19968;&#23616;&#38480;&#24615;&#65292;&#25105;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24050;&#35782;&#21035;&#30340;&#25919;&#31574;&#21464;&#21270;&#30340;&#27604;&#36739;&#20998;&#26512;&#31574;&#30053;&#12290;&#36825;&#31181;&#26041;&#27861;&#20801;&#35768;&#30740;&#31350;&#20154;&#21592;&#22312;&#30456;&#23545;&#30340;&#26465;&#20214;&#19979;&#35780;&#20272;&#35825;&#23548;&#22833;&#37197;&#65292;&#21516;&#26102;&#25511;&#21046;TFP&#27874;&#21160;&#24615;&#30340;&#24046;&#24322;&#12290;&#25105;&#21457;&#29616;&#37329;&#34701;&#21361;&#26426;&#23545;&#29983;&#20135;&#35201;&#32032;&#30340;&#24433;&#21709;&#26159;&#19981;&#22343;&#34913;&#30340;&#65292;&#23548;&#33268;&#36164;&#28304;&#37197;&#32622;&#20005;&#37325;&#22833;&#35843;&#12290;&#36890;&#36807;&#27604;&#36739;&#19981;&#21516;&#22320;&#21306;&#21644;&#34892;&#19994;&#30340;&#37329;&#34701;&#21361;&#26426;&#21069;&#21644;&#37329;&#34701;&#21361;&#26426;&#26399;&#38388;&#65292;&#32463;&#27982;&#37329;&#34701;&#29615;&#22659;&#31283;&#23450;&#30340;&#24773;&#20917;&#65292;&#25105;&#21457;&#29616;&#37329;&#34701;&#21361;&#26426;&#23545;&#21046;&#36896;&#19994;&#30340;&#36127;&#38754;&#24433;&#21709;&#27604;&#26381;&#21153;&#19994;&#26356;&#20026;&#26126;&#26174;&#65292;&#23545;&#27431;&#27954;&#19994;&#21153;&#26356;&#20026;&#20005;&#37325;&#65292;&#32780;&#19988;&#36825;&#31181;&#22833;&#35843;&#26159;&#30001;&#20110;&#37329;&#34701;&#32039;&#32553;&#25919;&#31574;&#24341;&#36215;&#30340;&#12290;&#36825;&#19968;&#30740;&#31350;&#34920;&#26126;&#65292;&#25919;&#31574;&#24178;&#39044;&#21487;&#33021;&#20250;&#23548;&#33268;&#36164;&#28304;&#37197;&#32622;&#22833;&#35843;&#65292;&#25439;&#23475;&#25972;&#20307;&#32463;&#27982;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper reevaluates the conventional approach to quantifying within-industry resource misallocation, typically measured by the dispersion of an input marginal product. My findings suggest that this statistic incorporates inherent productivity heterogeneity and idiosyncratic productivity shocks, irrespective of the input under scrutiny. Using balance sheet data from American and European manufacturing firms, I show that total factor productivity (TFP) volatility accounts for 7% of the variance in the marginal product of capital, 9% for labor, and 10% for material inputs. Consequently, this index, taken at face value, fails to identify policy-induced misallocation for any production input. To overcome this limitation, I propose a comparative analysis strategy driven by an identified policy variation. This approach allows the researcher to assess induced misallocation in relative terms whilst controlling for differences in TFP volatility. I show that the financial crisis had an uneven 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#23545;&#38889;&#22269;&#21830;&#19994;&#38598;&#22242;&#30340;&#25991;&#29486;&#35745;&#37327;&#20998;&#26512;&#65292;&#25506;&#35752;&#20102;&#36130;&#38400;&#23545;&#38889;&#22269;&#32463;&#27982;&#30340;&#24433;&#21709;&#65292;&#22635;&#34917;&#20102;&#35813;&#39046;&#22495;&#30340;&#30693;&#35782;&#31354;&#30333;&#12290;</title><link>http://arxiv.org/abs/2306.08743</link><description>&lt;p&gt;
&#38889;&#22269;&#36130;&#38400;&#30340;&#23835;&#36215;&#65306;&#23545;&#21830;&#19994;&#38598;&#22242;&#30340;&#25991;&#29486;&#35745;&#37327;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
The rise of the chaebol: A bibliometric analysis of business groups in South Korea. (arXiv:2306.08743v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08743
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#23545;&#38889;&#22269;&#21830;&#19994;&#38598;&#22242;&#30340;&#25991;&#29486;&#35745;&#37327;&#20998;&#26512;&#65292;&#25506;&#35752;&#20102;&#36130;&#38400;&#23545;&#38889;&#22269;&#32463;&#27982;&#30340;&#24433;&#21709;&#65292;&#22635;&#34917;&#20102;&#35813;&#39046;&#22495;&#30340;&#30693;&#35782;&#31354;&#30333;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38889;&#22269;&#24050;&#25104;&#20026;&#20122;&#27954;&#26368;&#37325;&#35201;&#30340;&#32463;&#27982;&#20307;&#20043;&#19968;&#12290;&#26368;&#22823;&#30340;&#38889;&#22269;&#36328;&#22269;&#20844;&#21496;&#19982;&#23500;&#26377;&#24433;&#21709;&#21147;&#30340;&#23478;&#26063;&#20225;&#19994;&#38598;&#22242;&#8212;&#8212;&#36130;&#38400;&#26377;&#25152;&#20851;&#32852;&#12290;&#23613;&#31649;&#36130;&#38400;&#30340;&#23398;&#26415;&#30740;&#31350;&#36234;&#26469;&#36234;&#21463;&#27426;&#36814;&#65292;&#20294;&#22312;&#23545;&#38889;&#22269;&#21830;&#19994;&#38598;&#22242;&#30340;&#25991;&#29486;&#35745;&#37327;&#20998;&#26512;&#20013;&#20173;&#23384;&#22312;&#30456;&#24403;&#22823;&#30340;&#30693;&#35782;&#31354;&#32570;&#12290;&#20026;&#20102;&#22635;&#34917;&#36825;&#19968;&#31354;&#32570;&#65292;&#26412;&#25991;&#26088;&#22312;&#23545;&#36130;&#38400;&#36827;&#34892;&#31995;&#32479;&#22238;&#39038;&#65292;&#24182;&#20998;&#26512;&#21830;&#19994;&#38598;&#22242;&#22312;&#38889;&#22269;&#32463;&#27982;&#20013;&#25198;&#28436;&#30340;&#35282;&#33394;&#12290;&#37319;&#29992;&#20102;&#19977;&#31181;&#19981;&#21516;&#30340;&#25991;&#29486;&#35745;&#37327;&#32593;&#32476;&#20998;&#26512;&#26041;&#27861;&#65292;&#21363;&#31185;&#23398;&#21512;&#20316;&#32593;&#32476;&#20998;&#26512;&#65292;&#25991;&#29486;&#32806;&#21512;&#32593;&#32476;&#20998;&#26512;&#21644;&#20851;&#38190;&#35789;&#20849;&#29616;&#32593;&#32476;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
South Korea has become one of the most important economies in Asia. The largest Korean multinational firms are affiliated with influential family-owned business groups known as the chaebol. Despite the surging academic popularity of the chaebol, there is a considerable knowledge gap in the bibliometric analysis of business groups in Korea. In an attempt to fill this gap, the article aims to provide a systematic review of the chaebol and the role that business groups have played in the economy of Korea. Three distinct bibliometric networks are analyzed, namely the scientific collaboration network, bibliographic coupling network, and keyword co-occurrence network.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35777;&#26126;&#20102;&#20855;&#26377;&#22810;&#20010;&#20195;&#29702;&#21644;&#20132;&#26131;&#25104;&#26412;&#30340;&#36830;&#32493;&#26102;&#38388;Radner&#22343;&#34913;&#30340;&#23384;&#22312;&#24615;&#65292;&#24182;&#19988;&#22312;&#27492;&#22522;&#30784;&#19978;&#25552;&#20986;&#20102;&#20844;&#24320;&#36879;&#26126;&#30340;&#30446;&#26631;&#20132;&#26131;&#22343;&#34913;&#27169;&#22411;&#65292;&#21516;&#26102;&#20998;&#26512;&#20102;&#20132;&#26131;&#25104;&#26412;&#27700;&#24179;&#23545;&#32929;&#20215;&#28418;&#31227;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2306.08519</link><description>&lt;p&gt;
&#20855;&#26377;&#20132;&#26131;&#25104;&#26412;&#30340;&#22810;&#26234;&#33021;&#20307;&#30446;&#26631;&#20132;&#26131;&#22343;&#34913;
&lt;/p&gt;
&lt;p&gt;
A multi-agent targeted trading equilibrium with transaction costs. (arXiv:2306.08519v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08519
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35777;&#26126;&#20102;&#20855;&#26377;&#22810;&#20010;&#20195;&#29702;&#21644;&#20132;&#26131;&#25104;&#26412;&#30340;&#36830;&#32493;&#26102;&#38388;Radner&#22343;&#34913;&#30340;&#23384;&#22312;&#24615;&#65292;&#24182;&#19988;&#22312;&#27492;&#22522;&#30784;&#19978;&#25552;&#20986;&#20102;&#20844;&#24320;&#36879;&#26126;&#30340;&#30446;&#26631;&#20132;&#26131;&#22343;&#34913;&#27169;&#22411;&#65292;&#21516;&#26102;&#20998;&#26512;&#20102;&#20132;&#26131;&#25104;&#26412;&#27700;&#24179;&#23545;&#32929;&#20215;&#28418;&#31227;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35777;&#26126;&#20102;&#20855;&#26377;&#22810;&#20010;&#20195;&#29702;&#21644;&#20132;&#26131;&#25104;&#26412;&#30340;&#36830;&#32493;&#26102;&#38388;Radner&#22343;&#34913;&#30340;&#23384;&#22312;&#24615;&#12290;&#20195;&#29702;&#34987;&#28608;&#21169;&#22312;&#20132;&#26131;&#26399;&#38388;&#26397;&#30528;&#30446;&#26631;&#32929;&#31080;&#25968;&#37327;&#20132;&#26131;&#65292;&#24182;&#35797;&#22270;&#26368;&#22823;&#21270;&#20854;&#39044;&#26399;&#36130;&#23500;&#20943;&#21435;&#20559;&#31163;&#30446;&#26631;&#30340;&#24809;&#32602;&#12290;&#20182;&#20204;&#30340;&#36130;&#23500;&#36824;&#21463;&#21040;&#19982;&#20132;&#26131;&#30340;&#32929;&#31080;&#25968;&#37327;&#25104;&#27604;&#20363;&#30340;&#20132;&#26131;&#25104;&#26412;&#30340;&#24433;&#21709;&#12290;&#20195;&#29702;&#30340;&#30446;&#26631;&#32929;&#31080;&#25968;&#37327;&#26159;&#20844;&#24320;&#24050;&#30693;&#30340;&#65292;&#22240;&#27492;&#32467;&#26524;&#22343;&#34913;&#26159;&#23436;&#20840;&#25581;&#31034;&#30340;&#12290;&#22312;&#22343;&#34913;&#20013;&#65292;&#27599;&#20010;&#20195;&#29702;&#22312;&#20572;&#27490;&#20132;&#26131;&#20043;&#21069;&#20250;&#36873;&#25321;&#36866;&#24403;&#30340;&#20132;&#26131;&#26102;&#38388;&#38388;&#38548;&#12290;&#25105;&#20204;&#30340;&#22343;&#34913;&#26500;&#24314;&#21644;&#20998;&#26512;&#28041;&#21450;&#30830;&#23450;&#20195;&#29702;&#20572;&#27490;&#20132;&#26131;&#30340;&#39034;&#24207;&#12290;&#20132;&#26131;&#25104;&#26412;&#27700;&#24179;&#24433;&#21709;&#22343;&#34913;&#32929;&#20215;&#28418;&#31227;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#22343;&#34913;&#32467;&#26524;&#24182;&#25552;&#20379;&#20102;&#25968;&#20540;&#31034;&#20363;&#12290;
&lt;/p&gt;
&lt;p&gt;
We prove the existence of a continuous-time Radner equilibrium with multiple agents and transaction costs. The agents are incentivized to trade towards a targeted number of shares throughout the trading period and seek to maximize their expected wealth minus a penalty for deviating from their targets. Their wealth is further reduced by transaction costs that are proportional to the number of stock shares traded. The agents' targeted number of shares is publicly known, making the resulting equilibrium fully revealing. In equilibrium, each agent optimally chooses to trade for an initial time interval before stopping trade. Our equilibrium construction and analysis involves identifying the order in which the agents stop trade. The transaction cost level impacts the equilibrium stock price drift. We analyze the equilibrium outcomes and provide numerical examples.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#22312;&#25289;&#26222;&#25289;&#26031;&#27169;&#22411;&#20013;&#30740;&#31350;&#20102;&#27431;&#24335;&#26399;&#26435;&#20013;&#24076;&#33098;&#23383;&#27597;Speed&#30340;&#35299;&#26512;&#34920;&#36798;&#24335;&#65292;&#24182;&#25552;&#20379;&#20102;COS&#26041;&#27861;&#36817;&#20284;Speed&#25152;&#38656;&#28385;&#36275;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#23454;&#39564;&#35777;&#26126;&#26410;&#28385;&#36275;&#26465;&#20214;&#26102;&#32467;&#26524;&#21487;&#33021;&#19981;&#20934;&#30830;&#12290;</title><link>http://arxiv.org/abs/2306.08421</link><description>&lt;p&gt;
&#25289;&#26222;&#25289;&#26031;&#27169;&#22411;&#20013;COS&#26041;&#27861;&#20013;&#24076;&#33098;&#23383;&#27597;&#30340;&#38519;&#38449;
&lt;/p&gt;
&lt;p&gt;
Greeks' pitfalls for the COS method in the Laplace model. (arXiv:2306.08421v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08421
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#25289;&#26222;&#25289;&#26031;&#27169;&#22411;&#20013;&#30740;&#31350;&#20102;&#27431;&#24335;&#26399;&#26435;&#20013;&#24076;&#33098;&#23383;&#27597;Speed&#30340;&#35299;&#26512;&#34920;&#36798;&#24335;&#65292;&#24182;&#25552;&#20379;&#20102;COS&#26041;&#27861;&#36817;&#20284;Speed&#25152;&#38656;&#28385;&#36275;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#23454;&#39564;&#35777;&#26126;&#26410;&#28385;&#36275;&#26465;&#20214;&#26102;&#32467;&#26524;&#21487;&#33021;&#19981;&#20934;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24076;&#33098;&#23383;&#27597;Delta&#65292;Gamma&#21644;Speed&#26159;&#27431;&#24335;&#26399;&#26435;&#30456;&#23545;&#20110;&#26631;&#30340;&#36164;&#20135;&#24403;&#21069;&#20215;&#26684;&#30340;&#19968;&#38454;&#12289;&#20108;&#38454;&#21644;&#19977;&#38454;&#23548;&#25968;&#12290;&#20613;&#37324;&#21494;&#20313;&#24358;&#32423;&#25968;&#23637;&#24320;&#27861;&#65288;COS &#26041;&#27861;&#65289;&#26159;&#19968;&#31181;&#25968;&#20540;&#26041;&#27861;&#65292;&#29992;&#20110;&#36817;&#20284;&#27431;&#24335;&#26399;&#26435;&#30340;&#20215;&#26684;&#21644;&#24076;&#33098;&#23383;&#27597;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#25289;&#26222;&#25289;&#26031;&#27169;&#22411;&#20013;&#21508;&#31181;&#27431;&#24335;&#26399;&#26435;&#30340;Speed&#30340;&#38381;&#21512;&#24418;&#24335;&#34920;&#36798;&#24335;&#65292;&#24182;&#25552;&#20379;&#20102;COS&#26041;&#27861;&#36817;&#20284;Speed&#25152;&#38656;&#28385;&#36275;&#30340;&#20805;&#20998;&#26465;&#20214;&#12290;&#25105;&#20204;&#23454;&#35777;&#34920;&#26126;&#65292;&#22914;&#26524;&#36825;&#20123;&#20805;&#20998;&#26465;&#20214;&#19981;&#28385;&#36275;&#65292;COS&#26041;&#27861;&#21487;&#33021;&#20250;&#20135;&#29983;&#25968;&#23383;&#19978;&#27809;&#26377;&#24847;&#20041;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Greeks Delta, Gamma and Speed are the first, second and third derivative of a European option with respect to the current price of the underlying. The Fourier cosine series expansion method (COS method) is a numerical method for approximating the price and the Greeks of European options. We develop a closed-form expression of Speed of various European options in the Laplace model and we provide sufficient conditions for the COS method to approximate Speed. We show empirically that the COS method may produce numerically nonsensical results if theses sufficient conditions are not met.
&lt;/p&gt;</description></item><item><title>2022&#24180;&#22799;&#23395;&#65292;&#24503;&#22269;&#25919;&#24220;&#24320;&#23637;&#20102;&#19968;&#39033;&#23454;&#39564;&#65292;&#40723;&#21169;&#23621;&#27665;&#22312;&#19977;&#20010;&#26376;&#20869;&#36873;&#25321;&#25903;&#20184;&#27599;&#26376;9&#27431;&#20803;&#30340;&#20840;&#22269;&#20844;&#20849;&#20132;&#36890;&#31080;&#65292;&#20197;&#32531;&#35299;&#23478;&#24237;&#36130;&#21153;&#21387;&#21147;&#12290;&#36825;&#26159;&#19968;&#39033;&#20132;&#36890;&#25919;&#31574;&#30740;&#31350;&#20013;&#21069;&#25152;&#26410;&#26377;&#30340;&#22823;&#35268;&#27169;&#34892;&#20026;&#23454;&#39564;&#65292;&#26088;&#22312;&#30740;&#31350;&#20132;&#36890;&#20986;&#34892;&#26041;&#24335;&#21644;&#24037;&#20855;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2306.08297</link><description>&lt;p&gt;
2022&#24180;&#24503;&#22269;&#20840;&#22269;&#24615;&#30340;&#26053;&#34892;&#23454;&#39564;&#65306;&#27599;&#26376;9&#27431;&#20803;&#30340;&#20844;&#20849;&#20132;&#36890;&#8212;&#8212;&#20851;&#20110;&#19968;&#39033;&#23454;&#35777;&#30740;&#31350;&#30340;&#39318;&#27425;&#21457;&#29616;
&lt;/p&gt;
&lt;p&gt;
Germany's nationwide travel experiment in 2022: public transport for 9 Euro per month -- First findings of an empirical study. (arXiv:2306.08297v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08297
&lt;/p&gt;
&lt;p&gt;
2022&#24180;&#22799;&#23395;&#65292;&#24503;&#22269;&#25919;&#24220;&#24320;&#23637;&#20102;&#19968;&#39033;&#23454;&#39564;&#65292;&#40723;&#21169;&#23621;&#27665;&#22312;&#19977;&#20010;&#26376;&#20869;&#36873;&#25321;&#25903;&#20184;&#27599;&#26376;9&#27431;&#20803;&#30340;&#20840;&#22269;&#20844;&#20849;&#20132;&#36890;&#31080;&#65292;&#20197;&#32531;&#35299;&#23478;&#24237;&#36130;&#21153;&#21387;&#21147;&#12290;&#36825;&#26159;&#19968;&#39033;&#20132;&#36890;&#25919;&#31574;&#30740;&#31350;&#20013;&#21069;&#25152;&#26410;&#26377;&#30340;&#22823;&#35268;&#27169;&#34892;&#20026;&#23454;&#39564;&#65292;&#26088;&#22312;&#30740;&#31350;&#20132;&#36890;&#20986;&#34892;&#26041;&#24335;&#21644;&#24037;&#20855;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
2022&#24180;&#26149;&#23395;&#65292;&#24503;&#22269;&#32852;&#37030;&#25919;&#24220;&#21516;&#24847;&#20102;&#19968;&#31995;&#21015;&#26088;&#22312;&#20943;&#36731;&#23478;&#24237;&#36130;&#21153;&#36127;&#25285;&#30340;&#25919;&#31574;&#25514;&#26045;&#65292;&#23588;&#20854;&#26159;&#38024;&#23545;&#36817;&#26399;&#33021;&#28304;&#21644;&#20132;&#36890;&#20215;&#26684;&#19978;&#28072;&#30340;&#38382;&#39064;&#12290;&#20854;&#20013;&#20043;&#19968;&#26159;&#22312;2022&#24180;6&#26376;&#12289;7&#26376;&#21644;8&#26376;&#19977;&#20010;&#26376;&#26399;&#38388;&#20026;&#27599;&#26376;9&#27431;&#20803;&#25552;&#20379;&#20840;&#22269;&#24615;&#20844;&#20849;&#20132;&#36890;&#31080;&#12290;&#36825;&#26159;&#20132;&#36890;&#25919;&#31574;&#30740;&#31350;&#20013;&#20960;&#20046;&#21069;&#25152;&#26410;&#26377;&#30340;&#34892;&#20026;&#23454;&#39564;&#12290;&#36825;&#19981;&#20165;&#20801;&#35768;&#25105;&#20204;&#30740;&#31350;&#20986;&#34892;&#26041;&#24335;&#30340;&#34892;&#20026;&#21709;&#24212;&#21644;&#35825;&#23548;&#38656;&#27714;&#65292;&#36824;&#21487;&#20197;&#35780;&#20272;&#36825;&#20123;&#24037;&#20855;&#30340;&#26377;&#25928;&#24615;&#12290;&#25105;&#20204;&#20351;&#29992;&#19977;&#27874;&#35843;&#26597;&#21644;&#22522;&#20110;&#26234;&#33021;&#25163;&#26426;&#30340;&#34892;&#31243;&#26085;&#35760;&#65292;&#24182;&#23545;&#24917;&#23612;&#40657;&#22823;&#37117;&#20250;&#21306;&#30340;2,261&#21517;&#21442;&#19982;&#32773;&#36827;&#34892;&#37325;&#28857;&#35266;&#27979;&#12290;&#36873;&#25321;&#35813;&#22320;&#21306;&#26159;&#22240;&#20026;&#23427;&#25552;&#20379;&#20102;&#21508;&#31181;&#20986;&#34892;&#26041;&#24335;&#65292;&#25317;&#26377;&#23494;&#38598;&#21644;&#24191;&#27867;&#30340;&#20844;&#20849;&#20132;&#36890;&#32593;&#32476;&#65292;&#29978;&#33267;&#21487;&#20197;&#25552;&#20379;&#33391;&#22909;&#30340;&#21040;&#36798;&#35768;&#22810;&#20241;&#38386;&#30446;&#30340;&#22320;&#30340;&#26041;&#24335;&#12290;&#35813;&#24212;&#29992;&#31243;&#24207;&#25552;&#20379;&#20102;756&#20010;&#23454;&#38469;&#21442;&#19982;&#32773;&#30340;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
In spring 2022, the German federal government agreed on a set of policy measures that aimed at reducing households' financial burden resulting from a recent price increase, especially in energy and mobility. These included among others, a nationwide public transport ticket for 9~Euro per month for three months in June, July, and August 2022. In transport policy research this is an almost unprecedented behavioral experiment. It allows us to study not only behavioral responses in mode choice and induced demand but also to assess the effectiveness of these instruments. We observe this natural experiment with a three-wave survey and a smartphone-based travel diary with passive tracking on an initial sample of 2,261 participants with a focus on the Munich metropolitan region. This area is chosen as it offers a variety of mode options with a dense and far-reaching public transport network that even provides good access to many leisure destinations. The app has been providing data from 756 pa
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#22522;&#20110;&#8220;&#25216;&#33021;&#30456;&#20851;&#24615;&#33258;&#25105;&#36873;&#25321;&#8221;&#27169;&#22411;&#65292;&#25552;&#20379;&#20102;&#35777;&#25454;&#39564;&#35777;&#38543;&#30528;&#22269;&#20869;&#25216;&#33021;&#30456;&#20851;&#24615;&#38477;&#20302;&#65292;&#22269;&#38469;&#21171;&#21160;&#31227;&#27665;&#30340;&#24037;&#36164;&#24046;&#24322;&#20250;&#20943;&#23569;&#12290;&#21516;&#26102;&#65292;&#30830;&#35748;&#20102;&#20197;&#21069;&#34987;&#24573;&#35270;&#30340;&#8220;&#25216;&#33021;&#30456;&#20851;&#24615;&#25240;&#25187;&#8221;&#22240;&#32032;&#20316;&#20026;&#19968;&#20010;&#29420;&#31435;&#21442;&#25968;&#12290;</title><link>http://arxiv.org/abs/2306.08295</link><description>&lt;p&gt;
&#31227;&#27665;&#33258;&#25105;&#36873;&#25321;&#20013;&#30340;&#22269;&#20869;&#25216;&#33021;&#30456;&#20851;&#24615;&#27169;&#22411;&#65306;&#26469;&#33258;E-9&#23601;&#19994;&#35768;&#21487;&#35777;&#31995;&#32479;&#30340;&#36827;&#19968;&#27493;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Intranational Skill-relevance Model of the Immigrant's Self-selection: Further Evidence of the Stylized Fact from the E-9 Employment Permit System (EPS). (arXiv:2306.08295v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08295
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22522;&#20110;&#8220;&#25216;&#33021;&#30456;&#20851;&#24615;&#33258;&#25105;&#36873;&#25321;&#8221;&#27169;&#22411;&#65292;&#25552;&#20379;&#20102;&#35777;&#25454;&#39564;&#35777;&#38543;&#30528;&#22269;&#20869;&#25216;&#33021;&#30456;&#20851;&#24615;&#38477;&#20302;&#65292;&#22269;&#38469;&#21171;&#21160;&#31227;&#27665;&#30340;&#24037;&#36164;&#24046;&#24322;&#20250;&#20943;&#23569;&#12290;&#21516;&#26102;&#65292;&#30830;&#35748;&#20102;&#20197;&#21069;&#34987;&#24573;&#35270;&#30340;&#8220;&#25216;&#33021;&#30456;&#20851;&#24615;&#25240;&#25187;&#8221;&#22240;&#32032;&#20316;&#20026;&#19968;&#20010;&#29420;&#31435;&#21442;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22522;&#20110;&#25105;&#20204;&#20808;&#21069;&#30340;&#30740;&#31350;(&#26446;&#65292;&#26519;&#21644;&#21331;&#65292;2022)&#24341;&#20837;&#30340;&#8220;&#25216;&#33021;&#30456;&#20851;&#24615;&#33258;&#25105;&#36873;&#25321;&#8221;&#27169;&#22411;&#65292;&#25193;&#23637;&#20102;&#21171;&#21160;&#31227;&#27665;&#30340;&#27169;&#22411;&#22522;&#30784;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#36890;&#36807;&#25552;&#20379;&#23454;&#35777;&#35777;&#25454;&#26469;&#39564;&#35777;&#35813;&#27169;&#22411;&#30340;&#19968;&#20010;&#20294;&#23578;&#26410;&#34987;&#27979;&#35797;&#30340;&#38081;&#21017;&#65306;&#8220;&#38543;&#30528;&#22269;&#20869;&#25216;&#33021;&#30456;&#20851;&#24615;&#38477;&#20302;&#65292;&#22269;&#38469;&#21171;&#21160;&#31227;&#27665;&#30340;&#24037;&#36164;&#24046;&#24322;&#20250;&#20943;&#23569;&#8221;&#12290;&#21033;&#29992;&#23601;&#19994;&#35768;&#21487;&#35777;&#31995;&#32479;(EPS)&#21644;&#20027;&#26426;&#22269;&#30340;&#20998;&#31867;&#32771;&#34385;&#65292;&#31934;&#24515;&#21046;&#23450;&#21644;&#36873;&#25321;&#30340;&#20551;&#35774;&#21644;&#25968;&#25454;&#65292;OLS&#32447;&#24615;&#22238;&#24402;&#32467;&#26524;&#21512;&#29702;&#22320;&#25903;&#25345;&#25152;&#26377;&#20551;&#35774;&#30340;&#32479;&#35745;&#26174;&#33879;&#24615;&#65292;&#20174;&#32780;&#24402;&#32435;&#35777;&#23454;&#20102;&#25105;&#20204;&#26500;&#24314;&#30340;&#27169;&#22411;&#12290;&#36825;&#31687;&#35770;&#25991;&#22312;&#20197;&#19979;&#19977;&#20010;&#26041;&#38754;&#20026;&#29616;&#26377;&#30340;&#21171;&#21160;&#31227;&#27665;&#32463;&#27982;&#23398;&#25991;&#29486;&#20570;&#20986;&#36129;&#29486;&#65306;(1)&#23558;&#20197;&#21069;&#34987;&#24573;&#35270;&#30340;&#8220;&#25216;&#33021;&#30456;&#20851;&#24615;&#25240;&#25187;&#8221;&#22240;&#32032;&#20316;&#20026;&#19968;&#20010;&#29420;&#31435;&#21442;&#25968;&#36827;&#34892;&#30830;&#35748;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study expands upon the foundation of 'Skill-Relevance-Self Selection' model on labor immigration, introduced by our previous study (Lee, Lim, &amp; Cho, 2022). In detail, we seek an empirical confirmation of the model by providing evidence of the attained -- however, yet to be tested -- stylized fact: 'as the discount of intranational skill-relevance by immigration is intensified, the wage differential of international labor immigration is diminished'. Utilizing the hypothesis and data meticulously formulated and selected in consideration of Employment Permit System (EPS) and the typology of host nations, OLS linear regression results reasonably support all hypotheses with statistical significance, thereby inductively substantiating our constructed model. This paper contributes to existing labor immigration economics literature in three following aspects: (1) Acknowledge the previously overlooked factor of 'skill relevance discount' in labor immigration as an independent parameter, se
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;COVID-19&#25919;&#31574;&#19981;&#30830;&#23450;&#24615;&#23545;&#29305;&#23450;&#32676;&#20307;&#20445;&#38505;&#28040;&#36153;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#25935;&#24863;&#32676;&#20307;&#30340;&#24895;&#24847;&#25903;&#20184;(WTP)&#27604;&#22522;&#20934;&#39640;12.2&#65285;&#12290;</title><link>http://arxiv.org/abs/2306.08214</link><description>&lt;p&gt;
&#38754;&#23545;&#20844;&#20849;&#21355;&#29983;&#25919;&#31574;&#19981;&#30830;&#23450;&#24615;&#30340;&#24212;&#23545;&#19982;&#20445;&#38505;&#20915;&#31574;
&lt;/p&gt;
&lt;p&gt;
Response toward Public Health Policy Ambiguity and Insurance Decisions. (arXiv:2306.08214v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08214
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;COVID-19&#25919;&#31574;&#19981;&#30830;&#23450;&#24615;&#23545;&#29305;&#23450;&#32676;&#20307;&#20445;&#38505;&#28040;&#36153;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#25935;&#24863;&#32676;&#20307;&#30340;&#24895;&#24847;&#25903;&#20184;(WTP)&#27604;&#22522;&#20934;&#39640;12.2&#65285;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20844;&#20849;&#21355;&#29983;&#25919;&#31574;&#30340;&#35843;&#25972;&#24456;&#24120;&#35265;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;COVID-19&#25919;&#31574;&#19981;&#30830;&#23450;&#24615;&#23545;&#29305;&#23450;&#32676;&#20307;&#20445;&#38505;&#28040;&#36153;&#30340;&#24433;&#21709;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#25935;&#24863;&#32676;&#20307;&#23545;&#20445;&#38505;&#30340;&#24895;&#24847;&#25903;&#20184;(WTP)&#27604;&#22522;&#20934;&#39640;12.2&#65285;&#12290;&#37027;&#20123;&#32463;&#21382;&#25910;&#20837;&#20013;&#26029;&#30340;&#32676;&#20307;&#26356;&#23481;&#26131;&#21463;&#21040;&#24433;&#21709;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;&#20851;&#20110;&#27969;&#34892;&#30149;&#25511;&#21046;&#36716;&#21464;&#24433;&#21709;&#30340;&#26032;&#35270;&#35282;&#12290;
&lt;/p&gt;
&lt;p&gt;
Adjustments to public health policy are common. This paper investigates the impact of COVID-19 policy ambiguity on specific groups' insurance consumption. The results show that sensitive groups' willingness to pay (WTP) for insurance is 12.2% above the benchmark. Groups that have experienced income disruptions are more likely to suffer this. This paper offers fresh perspectives on the effects of pandemic control shifts.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21160;&#24577;&#36125;&#21494;&#26031;&#32593;&#32476;&#30340;&#26041;&#27861;&#65292;&#26469;&#39044;&#27979;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#26041;&#21521;&#65292;&#20197;&#24110;&#21161;&#25237;&#36164;&#32773;&#20570;&#20986;&#26126;&#26234;&#30340;&#25237;&#36164;&#20915;&#31574;&#12290;</title><link>http://arxiv.org/abs/2306.08157</link><description>&lt;p&gt;
&#20351;&#29992;&#21160;&#24577;&#36125;&#21494;&#26031;&#32593;&#32476;&#36827;&#34892;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#26041;&#21521;&#22240;&#26524;&#29305;&#24449;&#24037;&#31243;
&lt;/p&gt;
&lt;p&gt;
Causal Feature Engineering of Price Directions of Cryptocurrencies using Dynamic Bayesian Networks. (arXiv:2306.08157v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08157
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21160;&#24577;&#36125;&#21494;&#26031;&#32593;&#32476;&#30340;&#26041;&#27861;&#65292;&#26469;&#39044;&#27979;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#26041;&#21521;&#65292;&#20197;&#24110;&#21161;&#25237;&#36164;&#32773;&#20570;&#20986;&#26126;&#26234;&#30340;&#25237;&#36164;&#20915;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21152;&#23494;&#36135;&#24065;&#22312;&#21508;&#20010;&#39046;&#22495;&#65292;&#29305;&#21035;&#26159;&#37329;&#34701;&#21644;&#25237;&#36164;&#39046;&#22495;&#20013;&#36234;&#26469;&#36234;&#21463;&#21040;&#20851;&#27880;&#12290;&#20854;&#29420;&#29305;&#30340;&#21306;&#22359;&#38142;&#30456;&#20851;&#29305;&#24615;&#65292;&#22914;&#38544;&#31169;&#12289;&#21435;&#20013;&#24515;&#21270;&#21644;&#19981;&#21487;&#36861;&#36394;&#24615;&#65292;&#37096;&#20998;&#21407;&#22240;&#26159;&#20854;&#21463;&#27426;&#36814;&#30340;&#21407;&#22240;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#30340;&#27874;&#21160;&#24615;&#21644;&#19981;&#30830;&#23450;&#24615;&#65292;&#21152;&#23494;&#36135;&#24065;&#20173;&#28982;&#26159;&#19968;&#31181;&#39640;&#39118;&#38505;&#25237;&#36164;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21160;&#24577;&#36125;&#21494;&#26031;&#32593;&#32476;&#65288;DBN&#65289;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#22810;&#20803;&#35774;&#32622;&#19979;&#27169;&#25311;&#22797;&#26434;&#31995;&#32479;&#65292;&#20197;&#39044;&#27979;&#20116;&#31181;&#27969;&#34892;&#21152;&#23494;&#36135;&#24065;&#30340;&#20215;&#26684;&#36816;&#21160;&#26041;&#21521;&#65292;&#20197;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
Cryptocurrencies have gained popularity across various sectors, especially in finance and investment. The popularity is partly due to their unique specifications originating from blockchain-related characteristics such as privacy, decentralisation, and untraceability. Despite their growing popularity, cryptocurrencies remain a high-risk investment due to their price volatility and uncertainty. The inherent volatility in cryptocurrency prices, coupled with internal cryptocurrency-related factors and external influential global economic factors makes predicting their prices and price movement directions challenging. Nevertheless, the knowledge obtained from predicting the direction of cryptocurrency prices can provide valuable guidance for investors in making informed investment decisions. To address this issue, this paper proposes a dynamic Bayesian network (DBN) approach, which can model complex systems in multivariate settings, to predict the price movement direction of five popular a
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#37319;&#29992;&#22522;&#37329;&#25345;&#20179;&#30340;&#32593;&#32476;&#20998;&#26512;&#26469;&#35745;&#31639;&#32929;&#31080;&#30340;&#25317;&#25380;&#20998;&#25968;&#65292;&#26500;&#24314;&#20986;&#30340;&#22810;&#22836;&#22836;&#23544;&#21644;&#31354;&#22836;&#22836;&#23544;&#30340;&#23545;&#20914;&#32452;&#21512;&#20855;&#26377;&#36127;&#30456;&#20851;&#21644;&#27491;&#24066;&#22330;&#22238;&#25253;&#19979;&#20984;&#24615;&#30340;&#29305;&#24615;&#65292;&#33021;&#25552;&#20379;&#19968;&#31181;&#26080;&#38656;&#26114;&#36149;&#30340;&#26399;&#26435;&#31574;&#30053;&#25110;&#22797;&#26434;&#30340;&#25968;&#20540;&#20248;&#21270;&#30340;&#23545;&#20914;&#25237;&#36164;&#32452;&#21512;&#65292;&#29992;&#20110;&#23545;&#20914;&#25237;&#36164;&#32452;&#21512;&#39118;&#38505;&#65292;&#21253;&#25324;&#23614;&#37096;&#39118;&#38505;&#12290;</title><link>http://arxiv.org/abs/2306.08105</link><description>&lt;p&gt;
&#26080;&#27169;&#22411;&#24066;&#22330;&#39118;&#38505;&#23545;&#20914;&#19982;&#25317;&#25380;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
Model-Free Market Risk Hedging Using Crowding Networks. (arXiv:2306.08105v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08105
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37319;&#29992;&#22522;&#37329;&#25345;&#20179;&#30340;&#32593;&#32476;&#20998;&#26512;&#26469;&#35745;&#31639;&#32929;&#31080;&#30340;&#25317;&#25380;&#20998;&#25968;&#65292;&#26500;&#24314;&#20986;&#30340;&#22810;&#22836;&#22836;&#23544;&#21644;&#31354;&#22836;&#22836;&#23544;&#30340;&#23545;&#20914;&#32452;&#21512;&#20855;&#26377;&#36127;&#30456;&#20851;&#21644;&#27491;&#24066;&#22330;&#22238;&#25253;&#19979;&#20984;&#24615;&#30340;&#29305;&#24615;&#65292;&#33021;&#25552;&#20379;&#19968;&#31181;&#26080;&#38656;&#26114;&#36149;&#30340;&#26399;&#26435;&#31574;&#30053;&#25110;&#22797;&#26434;&#30340;&#25968;&#20540;&#20248;&#21270;&#30340;&#23545;&#20914;&#25237;&#36164;&#32452;&#21512;&#65292;&#29992;&#20110;&#23545;&#20914;&#25237;&#36164;&#32452;&#21512;&#39118;&#38505;&#65292;&#21253;&#25324;&#23614;&#37096;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25317;&#25380;&#34987;&#24191;&#27867;&#35748;&#20026;&#26159;&#35774;&#35745;&#25237;&#36164;&#32452;&#21512;&#31574;&#30053;&#20013;&#26368;&#37325;&#35201;&#30340;&#39118;&#38505;&#22240;&#32032;&#20043;&#19968;&#12290;&#26412;&#25991;&#20351;&#29992;&#22522;&#37329;&#25345;&#20179;&#30340;&#32593;&#32476;&#20998;&#26512;&#26469;&#35745;&#31639;&#32929;&#31080;&#30340;&#25317;&#25380;&#20998;&#25968;&#65292;&#26500;&#24314;&#20986;&#26080;&#38656;&#20351;&#29992;&#20219;&#20309;&#25968;&#20540;&#20248;&#21270;&#30340;&#25104;&#26412;&#19981;&#21464;&#30340;&#22810;&#22836;&#22836;&#23544;&#21644;&#31354;&#22836;&#22836;&#23544;&#30340;&#23545;&#20914;&#32452;&#21512;&#65292;&#20197;&#27169;&#22411;&#33258;&#30001;&#30340;&#26041;&#24335;&#20026;&#24066;&#22330;&#39118;&#38505;&#25552;&#20379;&#20445;&#25252;&#26426;&#21046;&#65292;&#24182;&#19988;&#20855;&#26377;&#36127;&#30456;&#20851;&#21644;&#27491;&#24066;&#22330;&#22238;&#25253;&#19979;&#30340;&#20984;&#24615;&#29305;&#24615;&#65292;&#33021;&#22815;&#22312;&#23567;&#24133;&#21644;&#22823;&#24133;&#24066;&#22330;&#20215;&#26684;&#27874;&#21160;&#26102;&#25552;&#20379;&#20445;&#25252;&#12290;&#36890;&#36807;&#23558;&#25105;&#20204;&#30340;&#22810;&#22836;&#22836;&#23544;&#21644;&#31354;&#22836;&#22836;&#23544;&#23545;&#20914;&#32452;&#21512;&#28155;&#21152;&#21040;&#22522;&#30784;&#32452;&#21512;&#20013;&#65292;&#20363;&#22914;&#20256;&#32479;&#30340;60/40&#32452;&#21512;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#25552;&#20379;&#20102;&#19968;&#31181;&#26080;&#38656;&#26114;&#36149;&#30340;&#26399;&#26435;&#31574;&#30053;&#25110;&#22797;&#26434;&#30340;&#25968;&#20540;&#20248;&#21270;&#30340;&#23545;&#20914;&#32452;&#21512;&#65292;&#26469;&#23545;&#20914;&#25237;&#36164;&#32452;&#21512;&#39118;&#38505;&#65292;&#21253;&#25324;&#23614;&#37096;&#39118;&#38505;&#12290;&#27492;&#31867;&#23545;&#20914;&#30340;&#24635;&#25104;&#26412;&#30456;&#24403;&#20302;&#12290;
&lt;/p&gt;
&lt;p&gt;
Crowding is widely regarded as one of the most important risk factors in designing portfolio strategies. In this paper, we analyze stock crowding using network analysis of fund holdings, which is used to compute crowding scores for stocks. These scores are used to construct costless long-short portfolios, computed in a distribution-free (model-free) way and without using any numerical optimization, with desirable properties of hedge portfolios. More specifically, these long-short portfolios provide protection for both small and large market price fluctuations, due to their negative correlation with the market and positive convexity as a function of market returns. By adding our long-short portfolio to a baseline portfolio such as a traditional 60/40 portfolio, our method provides an alternative way to hedge portfolio risk including tail risk, which does not require costly option-based strategies or complex numerical optimization. The total cost of such hedging amounts to the total cost
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#26426;&#22120;&#23398;&#20064;&#36827;&#34892;&#22810;&#38142;DeFi&#27450;&#35784;&#26816;&#27979;&#30340;&#26041;&#27861;&#65292;&#24182;&#22312;&#26368;&#24191;&#27867;&#20351;&#29992;&#30340;23&#20010;DeFi&#21327;&#35758;&#30340;&#20132;&#26131;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;</title><link>http://arxiv.org/abs/2306.07972</link><description>&lt;p&gt;
&#21033;&#29992;&#26426;&#22120;&#23398;&#20064;&#36827;&#34892;&#22810;&#38142;DeFi&#27450;&#35784;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
Leveraging Machine Learning for Multichain DeFi Fraud Detection. (arXiv:2306.07972v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.07972
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#26426;&#22120;&#23398;&#20064;&#36827;&#34892;&#22810;&#38142;DeFi&#27450;&#35784;&#26816;&#27979;&#30340;&#26041;&#27861;&#65292;&#24182;&#22312;&#26368;&#24191;&#27867;&#20351;&#29992;&#30340;23&#20010;DeFi&#21327;&#35758;&#30340;&#20132;&#26131;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;2008&#24180;&#27604;&#29305;&#24065;&#25512;&#20986;&#20197;&#26469;&#65292;&#38543;&#30528;&#26080;&#38656;&#35768;&#21487;&#30340;&#21306;&#22359;&#38142;&#30340;&#20986;&#29616;&#65292;&#20154;&#20204;&#24847;&#35782;&#21040;&#23427;&#20204;&#26368;&#36866;&#21512;&#30340;&#29992;&#20363;&#19982;&#20351;&#37329;&#34701;&#31995;&#32479;&#21450;&#20854;&#20248;&#21183;&#21487;&#20379;&#27599;&#20010;&#20154;&#26080;&#32541;&#20351;&#29992;&#32780;&#26080;&#38656;&#20381;&#36182;&#20219;&#20309;&#21463;&#20449;&#20219;&#30340;&#20013;&#20171;&#26377;&#20851;&#12290;&#36328;&#38142;&#26234;&#33021;&#21512;&#32422;&#25552;&#20379;&#20102;&#19968;&#20010;&#21435;&#20013;&#24515;&#21270;&#37329;&#34701;&#65288;DeFi&#65289;&#29983;&#24577;&#31995;&#32479;&#65292;&#29992;&#25143;&#21487;&#20197;&#19982;&#20511;&#36151;&#27744;&#12289;&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMM&#65289;&#20132;&#26131;&#25152;&#12289;&#31283;&#23450;&#24065;&#12289;&#34893;&#29983;&#21697;&#31561;&#36827;&#34892;&#20132;&#20114;&#65292;&#20854;&#32047;&#35745;&#38145;&#23450;&#20215;&#20540;&#24050;&#36229;&#36807;1600&#20159;&#32654;&#20803;&#12290;&#23613;&#31649;DeFi&#24102;&#26469;&#20102;&#39640;&#39069;&#22238;&#25253;&#65292;&#20294;&#20063;&#24102;&#26469;&#20102;&#35768;&#22810;&#39118;&#38505;&#12290;&#22810;&#24180;&#26469;&#21457;&#29983;&#20102;&#35768;&#22810;&#37329;&#34701;&#32618;&#26696;&#65292;&#20351;&#24471;&#24694;&#24847;&#27963;&#21160;&#30340;&#26089;&#26399;&#26816;&#27979;&#25104;&#20026;&#20102;&#39640;&#24230;&#20248;&#20808;&#32771;&#34385;&#30340;&#38382;&#39064;&#12290;&#35813;&#25552;&#35758;&#26694;&#26550;&#20171;&#32461;&#20102;&#19968;&#31181;&#26377;&#25928;&#30340;&#26041;&#27861;&#65292;&#20174;&#19981;&#21516;&#38142;&#20013;&#25552;&#21462;&#19968;&#32452;&#21151;&#33021;&#65292;&#21253;&#25324;&#26368;&#22823;&#30340;&#20197;&#22826;&#22346;&#65292;&#24182;&#20351;&#29992;&#25105;&#20204;&#25910;&#38598;&#30340;&#26368;&#24191;&#27867;DeFi&#21327;&#35758;&#30340;&#20132;&#26131;&#25968;&#25454;&#38598;&#36827;&#34892;&#35780;&#20272;&#65288;23&#20010;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
Since the inception of permissionless blockchains with Bitcoin in 2008, it became apparent that their most well-suited use case is related to making the financial system and its advantages available to everyone seamlessly without depending on any trusted intermediaries. Smart contracts across chains provide an ecosystem of decentralized finance (DeFi), where users can interact with lending pools, Automated Market Maker (AMM) exchanges, stablecoins, derivatives, etc. with a cumulative locked value which had exceeded 160B USD. While DeFi comes with high rewards, it also carries plenty of risks. Many financial crimes have occurred over the years making the early detection of malicious activity an issue of high priority. The proposed framework introduces an effective method for extracting a set of features from different chains, including the largest one, Ethereum and it is evaluated over an extensive dataset we gathered with the transactions of the most widely used DeFi protocols (23 in t
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#19981;&#21516;&#35821;&#35328;&#25552;&#31034;&#19979;&#30340;&#22870;&#21169;&#26102;&#38388;&#20559;&#22909;&#65292;&#24182;&#21457;&#29616;GPT&#22312;&#20855;&#26377;&#36739;&#24369;&#26410;&#26469;&#26102;&#24577;&#30340;&#35821;&#35328;&#19979;&#34920;&#29616;&#20986;&#26356;&#22823;&#30340;&#32784;&#24515;&#65292;&#36825;&#19982;&#20351;&#29992;&#35813;&#35821;&#35328;&#30340;&#20154;&#31867;&#30340;&#20559;&#22909;&#30456;&#20284;&#12290;</title><link>http://arxiv.org/abs/2305.02531</link><description>&lt;p&gt;
&#35821;&#35328;&#12289;&#26102;&#38388;&#20559;&#22909;&#21644;&#28040;&#36153;&#34892;&#20026;&#65306;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Language, Time Preferences, and Consumer Behavior: Evidence from Large Language Models. (arXiv:2305.02531v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02531
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#19981;&#21516;&#35821;&#35328;&#25552;&#31034;&#19979;&#30340;&#22870;&#21169;&#26102;&#38388;&#20559;&#22909;&#65292;&#24182;&#21457;&#29616;GPT&#22312;&#20855;&#26377;&#36739;&#24369;&#26410;&#26469;&#26102;&#24577;&#30340;&#35821;&#35328;&#19979;&#34920;&#29616;&#20986;&#26356;&#22823;&#30340;&#32784;&#24515;&#65292;&#36825;&#19982;&#20351;&#29992;&#35813;&#35821;&#35328;&#30340;&#20154;&#31867;&#30340;&#20559;&#22909;&#30456;&#20284;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35821;&#35328;&#23545;&#25105;&#20204;&#23545;&#26102;&#38388;&#21644;&#22870;&#21169;&#30340;&#24863;&#30693;&#26377;&#24456;&#22823;&#30340;&#24433;&#21709;&#12290;&#36825;&#24341;&#21457;&#20102;&#19968;&#20010;&#38382;&#39064;&#65292;&#21363;&#24403;&#20197;&#19981;&#21516;&#30340;&#35821;&#35328;&#35810;&#38382;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#26102;&#65292;&#23427;&#20204;&#26159;&#21542;&#26174;&#31034;&#20986;&#19981;&#21516;&#30340;&#22870;&#21169;&#26102;&#38388;&#20559;&#22909;&#65292;&#24182;&#19988;&#23427;&#20204;&#30340;&#36873;&#25321;&#26159;&#21542;&#31867;&#20284;&#20110;&#20154;&#31867;&#30340;&#36873;&#25321;&#12290;&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;GPT-3.5&#65288;&#20197;&#19979;&#31616;&#31216;GPT&#65289;&#22312;&#22810;&#31181;&#35821;&#35328;&#25552;&#31034;&#19979;&#30340;&#21709;&#24212;&#65292;&#25506;&#32034;&#20102;&#36739;&#23567;&#12289;&#36739;&#26089;&#30340;&#22870;&#21169;&#21644;&#36739;&#22823;&#12289;&#36739;&#26202;&#30340;&#22870;&#21169;&#20043;&#38388;&#30340;&#20559;&#22909;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#26174;&#31034;&#65292;&#24403;&#20197;&#35821;&#20041;&#21547;&#20041;&#36739;&#24369;&#30340;&#26410;&#26469;&#26102;&#24577;&#21442;&#32771;&#65288;FTR&#65289;&#65292;&#22914;&#24503;&#35821;&#21644;&#27721;&#35821;&#65292;&#20026;&#25552;&#31034;&#35821;&#26102;&#65292;GPT&#34920;&#29616;&#20986;&#26356;&#22823;&#30340;&#32784;&#24515;&#65292;&#30456;&#27604;&#33521;&#35821;&#21644;&#27861;&#35821;&#31561;&#20855;&#26377;&#24378;&#22823;FTR&#30340;&#35821;&#35328;&#12290;&#36825;&#20123;&#21457;&#29616;&#19982;&#29616;&#26377;&#25991;&#29486;&#19968;&#33268;&#65292;&#24182;&#34920;&#26126;&#20102;GPT&#30340;&#36873;&#25321;&#19982;&#36825;&#20123;&#35821;&#35328;&#30340;&#20351;&#29992;&#32773;&#30340;&#20559;&#22909;&#20043;&#38388;&#30340;&#20851;&#32852;&#12290;&#28982;&#32780;&#65292;&#36827;&#19968;&#27493;&#30340;&#20998;&#26512;&#25581;&#31034;&#20102;&#36739;&#26089;&#25110;&#36739;&#26202;&#22870;&#21169;&#30340;&#20559;&#22909;&#24182;&#27809;&#26377;&#38543;&#30528;&#22870;&#21169;&#24046;&#24322;&#31995;&#32479;&#22320;&#25913;&#21464;&#65292;&#36825;&#34920;&#26126;&#20102;&#19968;&#31181;&#35789;&#20856;&#24207;&#20248;&#20808;&#30340;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;
Language has a strong influence on our perceptions of time and rewards. This raises the question of whether large language models, when asked in different languages, show different preferences for rewards over time and if their choices are similar to those of humans. In this study, we analyze the responses of GPT-3.5 (hereafter referred to as GPT) to prompts in multiple languages, exploring preferences between smaller, sooner rewards and larger, later rewards. Our results show that GPT displays greater patience when prompted in languages with weak future tense references (FTR), such as German and Mandarin, compared to languages with strong FTR, like English and French. These findings are consistent with existing literature and suggest a correlation between GPT's choices and the preferences of speakers of these languages. However, further analysis reveals that the preference for earlier or later rewards does not systematically change with reward gaps, indicating a lexicographic preferen
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#38543;&#26426;&#32500;&#24230;&#24066;&#22330;&#30340;&#22871;&#21033;&#29702;&#35770;&#65292;&#25552;&#20986;&#20102;&#36164;&#20135;&#23450;&#20215;&#30340;&#22522;&#26412;&#23450;&#29702;&#21644;&#36873;&#25321;&#24615;&#20998;&#35299;&#23450;&#29702;&#12290;</title><link>http://arxiv.org/abs/2212.04623</link><description>&lt;p&gt;
&#38543;&#26426;&#32500;&#24230;&#24066;&#22330;&#30340;&#22871;&#21033;&#29702;&#35770;
&lt;/p&gt;
&lt;p&gt;
Arbitrage theory in a market of stochastic dimension. (arXiv:2212.04623v2 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.04623
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#38543;&#26426;&#32500;&#24230;&#24066;&#22330;&#30340;&#22871;&#21033;&#29702;&#35770;&#65292;&#25552;&#20986;&#20102;&#36164;&#20135;&#23450;&#20215;&#30340;&#22522;&#26412;&#23450;&#29702;&#21644;&#36873;&#25321;&#24615;&#20998;&#35299;&#23450;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#38543;&#26426;&#32500;&#24230;&#30340;&#32929;&#31080;&#24066;&#22330;&#65292;&#22312;&#35813;&#24066;&#22330;&#20013;&#65292;&#36164;&#20135;&#25968;&#37327;&#20250;&#38543;&#30528;&#26102;&#38388;&#27874;&#21160;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#36164;&#20135;&#23450;&#20215;&#30340;&#22522;&#26412;&#23450;&#29702;&#65292;&#24182;&#25552;&#20986;&#20102;&#36873;&#25321;&#24615;&#20998;&#35299;&#23450;&#29702;&#12290;&#27492;&#22806;&#65292;&#31867;&#20284;&#30340;&#32467;&#26524;&#20173;&#28982;&#36866;&#29992;&#20110;&#19968;&#20010;&#24320;&#25918;&#30340;&#24066;&#22330;&#12290;&#36825;&#20123;&#32467;&#26524;&#26159;&#22312;&#19968;&#20010;&#30001;&#20998;&#27573;&#36830;&#32493;&#26500;&#25104;&#30340;&#32929;&#31080;&#24066;&#22330;&#27169;&#22411;&#20013;&#24471;&#20986;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies an equity market of stochastic dimension, where the number of assets fluctuates over time. In such a market, we develop the fundamental theorem of asset pricing, which provides the equivalence of the following statements: (i) there exists a supermartingale num\'eraire portfolio; (ii) each dissected market, which is of a fixed dimension between dimensional jumps, has locally finite growth; (iii) there is no arbitrage of the first kind; (iv) there exists a local martingale deflator; (v) the market is viable. We also present the optional decomposition theorem, which characterizes a given nonnegative process as the wealth process of some investment-consumption strategy. Furthermore, similar results still hold in an open market embedded in the entire market of stochastic dimension, where investors can only invest in a fixed number of large capitalization stocks. These results are developed in an equity market model where the price process is given by a piecewise continuou
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#24102;&#20132;&#26131;&#25104;&#26412;&#30340;&#29616;&#20195;&#24180;&#37329;&#26041;&#26696;&#65292;&#21487;&#20197;&#20026;&#36864;&#20241;&#32773;&#22312;&#20154;&#21475;&#23551;&#21629;&#24310;&#38271;&#21644;&#28040;&#36153;&#25104;&#26412;&#19978;&#21319;&#30340;&#32972;&#26223;&#19979;&#35268;&#21010;&#36864;&#20241;&#28040;&#36153;&#21644;&#36951;&#20135;&#65292;&#20855;&#26377;&#28789;&#27963;&#21644;&#39640;&#25928;&#30340;&#29305;&#28857;&#12290;</title><link>http://arxiv.org/abs/2209.09709</link><description>&lt;p&gt;
&#24102;&#20132;&#26131;&#25104;&#26412;&#30340;&#29616;&#20195;&#24180;&#37329;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
Modern Tontine with Transaction Costs. (arXiv:2209.09709v2 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.09709
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#24102;&#20132;&#26131;&#25104;&#26412;&#30340;&#29616;&#20195;&#24180;&#37329;&#26041;&#26696;&#65292;&#21487;&#20197;&#20026;&#36864;&#20241;&#32773;&#22312;&#20154;&#21475;&#23551;&#21629;&#24310;&#38271;&#21644;&#28040;&#36153;&#25104;&#26412;&#19978;&#21319;&#30340;&#32972;&#26223;&#19979;&#35268;&#21010;&#36864;&#20241;&#28040;&#36153;&#21644;&#36951;&#20135;&#65292;&#20855;&#26377;&#28789;&#27963;&#21644;&#39640;&#25928;&#30340;&#29305;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#22411;&#21487;&#36870;&#30340;&#24102;&#20132;&#26131;&#25104;&#26412;&#30340;&#29616;&#20195;&#24180;&#37329;&#26041;&#26696;&#12290;&#36864;&#20241;&#32773;&#30340;&#36130;&#23500;&#20998;&#20026;&#36951;&#20135;&#36134;&#25143;&#21644;&#24180;&#37329;&#36134;&#25143;&#65292;&#21482;&#33021;&#20174;&#36951;&#20135;&#36134;&#25143;&#20013;&#21462;&#20986;&#28040;&#36153;&#12290;&#20004;&#20010;&#36134;&#25143;&#20043;&#38388;&#30340;&#27599;&#27425;&#20132;&#26131;&#37117;&#20250;&#20135;&#29983;&#22266;&#23450;&#21644;&#27604;&#20363;&#30340;&#20132;&#26131;&#25104;&#26412;&#65292;&#20855;&#20307;&#21462;&#20915;&#20110;&#20132;&#26131;&#39069;&#12290;&#36864;&#20241;&#32773;&#21160;&#24577;&#25511;&#21046;&#20004;&#20010;&#36134;&#25143;&#20043;&#38388;&#30340;&#20998;&#37197;&#31574;&#30053;&#21644;&#28040;&#36153;&#31574;&#30053;&#65292;&#20197;&#26368;&#22823;&#21270;&#28040;&#36153;&#21644;&#36951;&#20135;&#25910;&#30410;&#12290;&#25105;&#20204;&#23558;&#20248;&#21270;&#38382;&#39064;&#24418;&#24335;&#21270;&#20026;&#20855;&#26377;&#26080;&#38480;&#26102;&#38388;&#35270;&#37326;&#30340;&#32452;&#21512;&#38543;&#26426;&#21644;&#33033;&#20914;&#25511;&#21046;&#38382;&#39064;&#65292;&#24182;&#23558;&#20215;&#20540;&#20989;&#25968;&#29305;&#24449;&#21270;&#20026;HJBQVI&#65288;Hamilton-Jacobi-Bellmen quasi-variational inequality&#65289;&#30340;&#21807;&#19968;&#31896;&#24230;&#35299;&#20915;&#26041;&#26696;&#12290;&#25968;&#20540;&#32467;&#26524;&#23637;&#31034;&#20102;&#30001;&#20004;&#20010;&#38454;&#27573;&#32452;&#25104;&#30340;V&#24418;&#20132;&#26131;&#21306;&#22495;&#12290;&#22312;&#21069;&#38454;&#27573;&#65292;&#30001;&#20110;&#38271;&#23551;&#20449;&#29992;&#36880;&#28176;&#25552;&#39640;&#65292;&#36864;&#20241;&#32773;&#20250;&#20943;&#23569;&#24180;&#37329;&#36134;&#25143;&#20013;&#36130;&#23500;&#30340;&#27604;&#20363;&#65292;&#32780;&#22312;&#21518;&#38454;&#27573;&#65292;&#36864;&#20241;&#32773;&#20250;&#23558;&#36130;&#23500;&#36716;&#22238;&#24180;&#37329;&#36134;&#25143;&#65292;&#20174;&#32780;&#26368;&#22823;&#21270;&#38271;&#23551;&#20449;&#29992;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#29616;&#20195;&#24180;&#37329;&#26041;&#26696;&#20026;&#36864;&#20241;&#32773;&#35268;&#21010;&#36864;&#20241;&#28040;&#36153;&#21644;&#36951;&#20135;&#25552;&#20379;&#20102;&#19968;&#31181;&#28789;&#27963;&#21644;&#39640;&#25928;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#29305;&#21035;&#26159;&#22312;&#20154;&#21475;&#23551;&#21629;&#24310;&#38271;&#21644;&#28040;&#36153;&#25104;&#26412;&#19978;&#21319;&#30340;&#32972;&#26223;&#19979;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we propose a new type of reversible modern tontine with transaction costs. The wealth of the retiree is divided into a bequest account and a tontine account. And consumption can only be withdrawn from the bequest account. Each transaction between the two accounts incurs fixed and proportional transaction costs depending on the transaction volume. The retiree dynamically controls the allocation policy between the two accounts and the consumption policy to maximize the consumption and bequest utilities. We formulate the optimization problem as a combined stochastic and impulse control problem with infinite time horizon, and characterize the value function as the unique viscosity solution of a HJBQVI (Hamilton-Jacobi-Bellmen quasi-variational inequality). The numerical results exhibit the V-shaped transaction region which consists of two stages. In the former stage, since longevity credits increase gradually, the retiree decreases the proportion of wealth in the tontine acc
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#32929;&#31080;&#24066;&#22330;&#20013;&#35746;&#21333;&#27969;&#22833;&#19981;&#24179;&#34913;(OFI)&#23545;&#20215;&#26684;&#27874;&#21160;&#30340;&#24433;&#21709;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#25972;&#21512;&#39030;&#23618;OFI&#30340;&#31995;&#32479;&#26041;&#27861;&#26469;&#26356;&#22909;&#22320;&#35299;&#37322;&#20215;&#26684;&#24433;&#21709;&#12290;&#36328;&#36164;&#20135;OFIs&#21487;&#20197;&#25913;&#21892;&#26410;&#26469;&#22238;&#25253;&#30340;&#39044;&#27979;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2112.13213</link><description>&lt;p&gt;
&#32929;&#31080;&#24066;&#22330;&#20013;&#35746;&#21333;&#27969;&#22833;&#19981;&#24179;&#34913;&#30340;&#20132;&#21449;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Cross-Impact of Order Flow Imbalance in Equity Markets. (arXiv:2112.13213v4 [q-fin.TR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2112.13213
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#32929;&#31080;&#24066;&#22330;&#20013;&#35746;&#21333;&#27969;&#22833;&#19981;&#24179;&#34913;(OFI)&#23545;&#20215;&#26684;&#27874;&#21160;&#30340;&#24433;&#21709;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#25972;&#21512;&#39030;&#23618;OFI&#30340;&#31995;&#32479;&#26041;&#27861;&#26469;&#26356;&#22909;&#22320;&#35299;&#37322;&#20215;&#26684;&#24433;&#21709;&#12290;&#36328;&#36164;&#20135;OFIs&#21487;&#20197;&#25913;&#21892;&#26410;&#26469;&#22238;&#25253;&#30340;&#39044;&#27979;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22312;&#22810;&#36164;&#20135;&#32972;&#26223;&#19979;&#30740;&#31350;&#20102;&#35746;&#21333;&#27969;&#22833;&#19981;&#24179;&#34913;(OFI)&#23545;&#32929;&#31080;&#24066;&#22330;&#20215;&#26684;&#27874;&#21160;&#30340;&#24433;&#21709;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31995;&#32479;&#30340;&#26041;&#27861;&#65292;&#23558;&#26497;&#38480;&#35746;&#21333;&#31807;&#30340;&#39030;&#23618;OFIs&#32452;&#21512;&#25104;&#19968;&#20010;&#32508;&#21512;&#24615;OFI&#21464;&#37327;&#65292;&#29992;&#20110;&#26356;&#22909;&#22320;&#35299;&#37322;&#20215;&#26684;&#24433;&#21709;&#65292;&#19982;&#26368;&#20339;&#27700;&#24179;OFI&#30456;&#27604;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#19968;&#26086;&#26469;&#33258;&#22810;&#20010;&#23618;&#27425;&#30340;&#20449;&#24687;&#34987;&#25972;&#21512;&#25104;OFI&#65292;&#20855;&#26377;&#20132;&#21449;&#24433;&#21709;&#30340;&#22810;&#36164;&#20135;&#27169;&#22411;&#24182;&#19981;&#27604;&#19981;&#24102;&#20132;&#21449;&#24433;&#21709;&#26415;&#35821;&#30340;&#31232;&#30095;&#27169;&#22411;&#25552;&#20379;&#26356;&#22810;&#30340;&#21363;&#26102;&#24433;&#21709;&#35299;&#37322;&#33021;&#21147;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#25105;&#20204;&#34920;&#26126;&#28382;&#21518;&#30340;&#36328;&#36164;&#20135;OFIs&#30830;&#23454;&#26377;&#21161;&#20110;&#39044;&#27979;&#26410;&#26469;&#30340;&#22238;&#25253;&#12290;&#25105;&#20204;&#36824;&#30830;&#23450;&#36825;&#31181;&#28382;&#21518;&#30340;&#20132;&#21449;&#24433;&#21709;&#20027;&#35201;&#22312;&#30701;&#26399;&#26102;&#38388;&#20869;&#34920;&#29616;&#20986;&#26469;&#65292;&#24182;&#22312;&#26102;&#38388;&#19978;&#36805;&#36895;&#34928;&#20943;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate the impact of order flow imbalance (OFI) on price movements in equity markets in a multi-asset setting. First, we propose a systematic approach for combining OFIs at the top levels of the limit order book into an integrated OFI variable which better explains price impact, compared to the best-level OFI. We show that once the information from multiple levels is integrated into OFI, multi-asset models with cross-impact do not provide additional explanatory power for contemporaneous impact compared to a sparse model without cross-impact terms. On the other hand, we show that lagged cross-asset OFIs do improve the forecasting of future returns. We also establish that this lagged cross-impact mainly manifests at short-term horizons and decays rapidly in time.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#24066;&#22330;&#21019;&#36896;&#30340;&#26368;&#20248;&#25511;&#21046;&#26694;&#26550;&#65292;&#35299;&#20915;&#20102;&#22806;&#27719;&#20132;&#26131;&#20013;&#32463;&#38144;&#21830;&#38754;&#23545;&#30340;&#23450;&#20215;&#21644;&#23545;&#20914;&#22256;&#22659;&#12290;</title><link>http://arxiv.org/abs/2112.02269</link><description>&lt;p&gt;
&#30001;FX&#32463;&#38144;&#21830;&#36827;&#34892;&#24066;&#22330;&#21019;&#36896;&#65306;&#23618;&#27425;&#12289;&#23450;&#20215;&#38454;&#26799;&#21644;&#23545;&#20914;&#21033;&#29575;&#30340;&#26368;&#20248;&#39118;&#38505;&#25511;&#21046;
&lt;/p&gt;
&lt;p&gt;
Market making by an FX dealer: tiers, pricing ladders and hedging rates for optimal risk control. (arXiv:2112.02269v3 [q-fin.TR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2112.02269
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#24066;&#22330;&#21019;&#36896;&#30340;&#26368;&#20248;&#25511;&#21046;&#26694;&#26550;&#65292;&#35299;&#20915;&#20102;&#22806;&#27719;&#20132;&#26131;&#20013;&#32463;&#38144;&#21830;&#38754;&#23545;&#30340;&#23450;&#20215;&#21644;&#23545;&#20914;&#22256;&#22659;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32463;&#38144;&#21830;&#36890;&#36807;&#21521;&#23458;&#25143;&#25552;&#20379;&#27969;&#21160;&#24615;&#26469;&#36186;&#38065;&#65292;&#20294;&#38754;&#20020;&#27969;&#37327;&#19981;&#30830;&#23450;&#24615;&#21644;&#20215;&#26684;&#39118;&#38505;&#12290;&#20182;&#20204;&#21487;&#20197;&#26377;&#25928;&#22320;&#25197;&#26354;&#20215;&#26684;&#24182;&#31561;&#24453;&#23458;&#25143;&#20943;&#36731;&#39118;&#38505;&#65288;&#20869;&#37096;&#21270;&#65289;&#65292;&#25110;&#22312;&#24320;&#25918;&#24066;&#22330;&#19978;&#19982;&#20854;&#20182;&#32463;&#38144;&#21830;&#20132;&#26131;&#20197;&#23545;&#20914;&#20854;&#22836;&#23544;&#24182;&#20943;&#23569;&#24211;&#23384;&#65288;&#22806;&#37096;&#21270;&#65289;&#12290;&#24403;&#28982;&#65292;&#19982;&#22806;&#37096;&#21270;&#30456;&#20851;&#30340;&#36739;&#22909;&#25511;&#21046;&#20276;&#38543;&#30528;&#20132;&#26131;&#25104;&#26412;&#21644;&#24066;&#22330;&#24433;&#21709;&#12290;&#20869;&#37096;&#21270;&#19982;&#22806;&#37096;&#21270;&#30340;&#22256;&#22659;&#24050;&#25104;&#20026;&#22806;&#27719;&#65288;FX&#65289;&#31038;&#21306;&#26368;&#36817;&#27963;&#36291;&#35752;&#35770;&#30340;&#20027;&#39064;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#24066;&#22330;&#21019;&#36896;&#30340;&#26368;&#20248;&#25511;&#21046;&#26694;&#26550;&#65292;&#35299;&#20915;&#21516;&#26102;&#22788;&#29702;&#23450;&#20215;&#21644;&#23545;&#20914;&#30340;&#38382;&#39064;&#65292;&#20174;&#32780;&#22238;&#31572;&#20102;&#32463;&#38144;&#21830;&#24191;&#20026;&#20154;&#30693;&#30340;&#38382;&#39064;&#65306;&#8220;&#23545;&#20914;&#65292;&#36824;&#26159;&#19981;&#23545;&#20914;&#65311;&#8221;
&lt;/p&gt;
&lt;p&gt;
Dealers make money by providing liquidity to clients but face flow uncertainty and thus price risk. They can efficiently skew their prices and wait for clients to mitigate risk (internalization), or trade with other dealers in the open market to hedge their position and reduce their inventory (externalization). Of course, the better control associated with externalization comes with transaction costs and market impact. The internalization vs. externalization dilemma has been a topic of recent active discussion within the foreign exchange (FX) community. This paper offers an optimal control framework for market making tackling both pricing and hedging, thus answering a question well known to dealers: `to hedge, or not to hedge?'
&lt;/p&gt;</description></item></channel></rss>