<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#36866;&#24212;&#33258;&#21160;&#21270;&#30340;&#21160;&#24577;&#20989;&#25968;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;DFMM&#65289;&#21327;&#35758;&#65292;&#23427;&#21253;&#25324;&#25968;&#25454;&#32858;&#21512;&#22120;&#21644;&#35746;&#21333;&#36335;&#30001;&#26426;&#21046;&#65292;&#33021;&#22815;&#21516;&#27493;&#20215;&#26684;&#25935;&#24863;&#24066;&#22330;&#20449;&#24687;&#12289;&#23454;&#29616;&#19968;&#20010;&#20215;&#26684;&#21407;&#21017;&#12289;&#20445;&#35777;&#24066;&#22330;&#25928;&#29575;&#12289;&#20248;&#21270;&#24211;&#23384;&#39118;&#38505;&#65292;&#24182;&#20943;&#36731;&#24066;&#22330;&#27874;&#21160;&#24341;&#36215;&#30340;&#25439;&#22833;&#12290;</title><link>http://arxiv.org/abs/2307.13624</link><description>&lt;p&gt;
&#21160;&#24577;&#20989;&#25968;&#24066;&#22330;&#21046;&#36896;&#21830;
&lt;/p&gt;
&lt;p&gt;
Dynamic Function Market Maker. (arXiv:2307.13624v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.13624
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#36866;&#24212;&#33258;&#21160;&#21270;&#30340;&#21160;&#24577;&#20989;&#25968;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;DFMM&#65289;&#21327;&#35758;&#65292;&#23427;&#21253;&#25324;&#25968;&#25454;&#32858;&#21512;&#22120;&#21644;&#35746;&#21333;&#36335;&#30001;&#26426;&#21046;&#65292;&#33021;&#22815;&#21516;&#27493;&#20215;&#26684;&#25935;&#24863;&#24066;&#22330;&#20449;&#24687;&#12289;&#23454;&#29616;&#19968;&#20010;&#20215;&#26684;&#21407;&#21017;&#12289;&#20445;&#35777;&#24066;&#22330;&#25928;&#29575;&#12289;&#20248;&#21270;&#24211;&#23384;&#39118;&#38505;&#65292;&#24182;&#20943;&#36731;&#24066;&#22330;&#27874;&#21160;&#24341;&#36215;&#30340;&#25439;&#22833;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#65292;&#21435;&#20013;&#24515;&#21270;&#30340;&#33258;&#21160;&#21270;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMMs&#65289;&#24341;&#36215;&#20102;&#26497;&#22823;&#30340;&#20851;&#27880;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#36866;&#24212;&#33258;&#21160;&#21270;&#30340;&#21160;&#24577;&#20989;&#25968;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;DFMM&#65289;&#65292;&#20197;&#35299;&#20915;&#36825;&#19968;&#39046;&#22495;&#30340;&#25361;&#25112;&#12290;&#25105;&#20204;&#30340;DFMM&#21327;&#35758;&#21253;&#25324;&#19968;&#20010;&#25968;&#25454;&#32858;&#21512;&#22120;&#21644;&#19968;&#20010;&#35746;&#21333;&#36335;&#30001;&#26426;&#21046;&#12290;&#23427;&#21516;&#27493;&#20215;&#26684;&#25935;&#24863;&#30340;&#24066;&#22330;&#20449;&#24687;&#65292;&#24182;&#26029;&#35328;&#19968;&#20010;&#20215;&#26684;&#21407;&#21017;&#65292;&#30830;&#20445;&#24066;&#22330;&#25928;&#29575;&#12290;&#25968;&#25454;&#32858;&#21512;&#22120;&#21253;&#25324;&#19968;&#20010;&#34394;&#25311;&#35746;&#21333;&#31807;&#65292;&#36890;&#36807;&#19982;&#26469;&#33258;&#22806;&#37096;&#20132;&#26131;&#22330;&#25152;&#65288;&#21253;&#25324;&#31454;&#20105;&#23545;&#25163;&#65289;&#30340;&#20449;&#24687;&#20445;&#25345;&#21516;&#27493;&#65292;&#26029;&#35328;&#26377;&#25928;&#30340;&#36164;&#20135;&#23450;&#20215;&#12290;&#21327;&#35758;&#30340;&#20877;&#24179;&#34913;&#21644;&#35746;&#21333;&#36335;&#30001;&#26041;&#27861;&#36890;&#36807;&#20210;&#35009;&#32773;&#20248;&#21270;&#24211;&#23384;&#39118;&#38505;&#65292;&#20210;&#35009;&#32773;&#26356;&#26377;&#21487;&#33021;&#24110;&#21161;DFMM&#65292;&#25552;&#39640;&#21327;&#35758;&#30340;&#31283;&#23450;&#24615;&#12290;DFMM&#37319;&#29992;&#20855;&#26377;&#38750;&#32447;&#24615;&#34893;&#29983;&#21697;&#24037;&#20855;&#30340;&#20445;&#25252;&#24615;&#32531;&#20914;&#21306;&#26469;&#31649;&#29702;&#39118;&#38505;&#65292;&#24182;&#20943;&#36731;&#24066;&#22330;&#27874;&#21160;&#24341;&#36215;&#30340;&#25439;&#22833;&#12290;&#35813;&#21327;&#35758;&#37319;&#29992;&#31639;&#27861;&#20250;&#35745;&#36164;&#20135;&#65292;&#36830;&#25509;&#25152;&#26377;&#27744;&#65292;&#24182;&#35299;&#20915;&#20102;&#20998;&#38548;&#27744;&#30340;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Decentralised automated market makers (AMMs) have gained significant attention recently. We propose an adaptive and automated Dynamic Function Market Maker (DFMM) that addresses challenges in this space. Our DFMM protocol includes a data aggregator and an order routing mechanism. It synchronises price-sensitive market information, asserting the principle of one price, and ensuring market efficiency. The data aggregator includes a virtual order book, asserting efficient asset pricing by staying synchronised with information from external venues, including competitors. The protocol's rebalancing and order routing method optimises inventory risk through arbitrageurs, who are more likely to assist DFMM, enhancing protocol stability. DFMM incorporates protective buffers with non-linear derivative instruments to manage risk and mitigate losses caused by market volatility. The protocol employs an algorithmic accounting-asset, connecting all pools and resolving the issue of segregated pools an
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;&#32445;&#32422;&#24066;2013&#24180;&#33267;2018&#24180;&#30340;&#20986;&#31199;&#36710;&#21644;TNC&#26053;&#34892;&#35760;&#24405;&#25968;&#25454;&#65292;&#21457;&#29616;&#20132;&#36890;&#32593;&#32476;&#20844;&#21496;&#23545;&#20986;&#31199;&#36710;&#21496;&#26426;&#30340;&#24037;&#36164;&#21644;&#21171;&#21160;&#20379;&#24212;&#20135;&#29983;&#36127;&#38754;&#24433;&#21709;&#65292;&#38477;&#20302;&#20102;&#20182;&#20204;&#30340;&#25910;&#20837;&#27700;&#24179;&#65292;&#24182;&#21066;&#24369;&#20102;&#20182;&#20204;&#30340;&#24037;&#20316;&#24847;&#24895;&#12290;</title><link>http://arxiv.org/abs/2307.13620</link><description>&lt;p&gt;
&#20132;&#36890;&#32593;&#32476;&#20844;&#21496;&#23545;&#20986;&#31199;&#36710;&#21496;&#26426;&#30340;&#21171;&#21160;&#20379;&#24212;&#21644;&#24037;&#36164;&#24433;&#21709;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Impact of Transportation Network Companies on Labor Supply and Wages for Taxi Drivers. (arXiv:2307.13620v1 [stat.AP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.13620
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;&#32445;&#32422;&#24066;2013&#24180;&#33267;2018&#24180;&#30340;&#20986;&#31199;&#36710;&#21644;TNC&#26053;&#34892;&#35760;&#24405;&#25968;&#25454;&#65292;&#21457;&#29616;&#20132;&#36890;&#32593;&#32476;&#20844;&#21496;&#23545;&#20986;&#31199;&#36710;&#21496;&#26426;&#30340;&#24037;&#36164;&#21644;&#21171;&#21160;&#20379;&#24212;&#20135;&#29983;&#36127;&#38754;&#24433;&#21709;&#65292;&#38477;&#20302;&#20102;&#20182;&#20204;&#30340;&#25910;&#20837;&#27700;&#24179;&#65292;&#24182;&#21066;&#24369;&#20102;&#20182;&#20204;&#30340;&#24037;&#20316;&#24847;&#24895;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#20132;&#36890;&#32593;&#32476;&#20844;&#21496;&#65288;TNCs&#65289;&#30340;&#22686;&#38271;&#22823;&#24133;&#20943;&#23569;&#20102;&#20256;&#32479;&#20986;&#31199;&#36710;&#34892;&#19994;&#30340;&#23458;&#27969;&#21644;&#36164;&#20135;&#20215;&#20540;&#65292;&#20294;&#29616;&#26377;&#30340;&#20986;&#31199;&#36710;&#24066;&#22330;&#25919;&#31574;&#27861;&#35268;&#21644;&#35268;&#21010;&#27169;&#22411;&#20173;&#38656;&#35201;&#37325;&#26032;&#23457;&#35270;&#65292;&#36825;&#38656;&#35201;&#23545;&#20986;&#31199;&#36710;&#34892;&#19994;&#21171;&#21160;&#20379;&#24212;&#21644;&#25910;&#20837;&#27700;&#24179;&#30340;&#25935;&#24863;&#24615;&#36827;&#34892;&#21487;&#38752;&#20272;&#35745;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#35843;&#26597;&#20132;&#36890;&#32593;&#32476;&#20844;&#21496;&#23545;&#20986;&#31199;&#36710;&#34892;&#19994;&#21171;&#21160;&#20379;&#24212;&#30340;&#24433;&#21709;&#65292;&#20272;&#35745;&#24037;&#36164;&#24377;&#24615;&#65292;&#24182;&#20102;&#35299;&#20986;&#31199;&#36710;&#21496;&#26426;&#24037;&#20316;&#20559;&#22909;&#30340;&#21464;&#21270;&#12290;&#25105;&#20204;&#24341;&#20837;&#24037;&#36164;&#20998;&#35299;&#26041;&#27861;&#65292;&#26681;&#25454;&#32445;&#32422;&#24066;2013&#24180;&#33267;2018&#24180;&#30340;&#20986;&#31199;&#36710;&#21644;TNC&#26053;&#34892;&#35760;&#24405;&#25968;&#25454;&#65292;&#37327;&#21270;TNC&#26053;&#34892;&#23545;&#20986;&#31199;&#36710;&#21496;&#26426;&#24037;&#20316;&#26102;&#38388;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#32479;&#35745;&#20998;&#26512;&#23545;&#25968;&#25454;&#36827;&#34892;&#20998;&#26512;&#65292;&#20197;&#35780;&#20272;&#25972;&#20307;&#24066;&#22330;&#34920;&#29616;&#21644;&#20986;&#31199;&#36710;&#21496;&#26426;&#24037;&#20316;&#34892;&#20026;&#30340;&#21464;&#21270;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;TNC&#26053;&#34892;&#30340;&#22686;&#21152;&#19981;&#20165;&#38477;&#20302;&#20102;&#20986;&#31199;&#36710;&#21496;&#26426;&#30340;&#25910;&#20837;&#27700;&#24179;&#65292;&#36824;&#21066;&#24369;&#20102;&#20182;&#20204;&#24037;&#20316;&#30340;&#24847;&#24895;&#12290;
&lt;/p&gt;
&lt;p&gt;
While the growth of TNCs took a substantial part of ridership and asset value away from the traditional taxi industry, existing taxi market policy regulations and planning models remain to be reexamined, which requires reliable estimates of the sensitivity of labor supply and income levels in the taxi industry. This study aims to investigate the impact of TNCs on the labor supply of the taxi industry, estimate wage elasticity, and understand the changes in taxi drivers' work preferences. We introduce the wage decomposition method to quantify the effects of TNC trips on taxi drivers' work hours over time, based on taxi and TNC trip record data from 2013 to 2018 in New York City. The data are analyzed to evaluate the changes in overall market performances and taxi drivers' work behavior through statistical analyses, and our results show that the increase in TNC trips not only decreases the income level of taxi drivers but also discourages their willingness to work. We find that 1% increa
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#21033;&#29992;&#36801;&#31227;&#23398;&#20064;&#25216;&#26415;&#35299;&#20915;&#37329;&#34701;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#65292;&#24182;&#24341;&#20837;&#20102;&#26032;&#27010;&#24565;"&#36801;&#31227;&#39118;&#38505;"&#65292;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#20102;&#36801;&#31227;&#39118;&#38505;&#19982;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;&#25972;&#20307;&#24615;&#33021;&#20043;&#38388;&#30340;&#24378;&#30456;&#20851;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#36890;&#36807;&#36801;&#31227;&#39118;&#38505;&#35782;&#21035;&#36866;&#24403;&#30340;&#28304;&#20219;&#21153;&#26469;&#25552;&#39640;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;&#25928;&#29575;&#21644;&#25928;&#26524;&#30340;&#26041;&#27861;&#12290;&#25968;&#20540;&#23454;&#39564;&#36824;&#20026;&#19981;&#21516;&#35774;&#32622;&#19979;&#30340;&#25237;&#36164;&#32452;&#21512;&#31649;&#29702;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#26032;&#35265;&#35299;&#12290;</title><link>http://arxiv.org/abs/2307.13546</link><description>&lt;p&gt;
&#20026;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#24212;&#29992;&#36801;&#31227;&#23398;&#20064;&#25216;&#26415;
&lt;/p&gt;
&lt;p&gt;
Transfer Learning for Portfolio Optimization. (arXiv:2307.13546v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.13546
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#21033;&#29992;&#36801;&#31227;&#23398;&#20064;&#25216;&#26415;&#35299;&#20915;&#37329;&#34701;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#65292;&#24182;&#24341;&#20837;&#20102;&#26032;&#27010;&#24565;"&#36801;&#31227;&#39118;&#38505;"&#65292;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#20102;&#36801;&#31227;&#39118;&#38505;&#19982;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;&#25972;&#20307;&#24615;&#33021;&#20043;&#38388;&#30340;&#24378;&#30456;&#20851;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#36890;&#36807;&#36801;&#31227;&#39118;&#38505;&#35782;&#21035;&#36866;&#24403;&#30340;&#28304;&#20219;&#21153;&#26469;&#25552;&#39640;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;&#25928;&#29575;&#21644;&#25928;&#26524;&#30340;&#26041;&#27861;&#12290;&#25968;&#20540;&#23454;&#39564;&#36824;&#20026;&#19981;&#21516;&#35774;&#32622;&#19979;&#30340;&#25237;&#36164;&#32452;&#21512;&#31649;&#29702;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#26032;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25506;&#32034;&#20102;&#21033;&#29992;&#36801;&#31227;&#23398;&#20064;&#25216;&#26415;&#35299;&#20915;&#37329;&#34701;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#30340;&#21487;&#33021;&#24615;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#26032;&#30340;&#27010;&#24565;&#65292;&#21363;&#8220;&#36801;&#31227;&#39118;&#38505;&#8221;&#65292;&#22312;&#36801;&#31227;&#23398;&#20064;&#30340;&#20248;&#21270;&#26694;&#26550;&#20013;&#12290;&#36890;&#36807;&#19968;&#31995;&#21015;&#25968;&#20540;&#23454;&#39564;&#65292;&#25105;&#20204;&#20174;&#36328;&#27954;&#21035;&#36801;&#31227;&#12289;&#36328;&#34892;&#19994;&#36801;&#31227;&#21644;&#36328;&#39057;&#29575;&#36801;&#31227;&#19977;&#20010;&#31867;&#21035;&#36827;&#34892;&#20102;&#25506;&#31350;&#12290;&#20855;&#20307;&#32780;&#35328;&#65306;1. &#24314;&#31435;&#20102;&#36801;&#31227;&#39118;&#38505;&#19982;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;&#25972;&#20307;&#24615;&#33021;&#20043;&#38388;&#30340;&#24378;&#30456;&#20851;&#24615;&#65292;&#24378;&#35843;&#20102;&#36801;&#31227;&#39118;&#38505;&#20316;&#20026;&#21487;&#34892;&#25351;&#26631;&#30340;&#37325;&#35201;&#24615;&#65307;2. &#21457;&#29616;&#36801;&#31227;&#39118;&#38505;&#25552;&#20379;&#20102;&#19968;&#31181;&#35745;&#31639;&#25928;&#29575;&#39640;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#36801;&#31227;&#23398;&#20064;&#20013;&#35782;&#21035;&#36866;&#24403;&#30340;&#28304;&#20219;&#21153;&#65292;&#20174;&#32780;&#25552;&#39640;&#20102;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;&#30340;&#25928;&#29575;&#21644;&#25928;&#26524;&#65307;3. &#27492;&#22806;&#65292;&#25968;&#20540;&#23454;&#39564;&#20026;&#19981;&#21516;&#35774;&#32622;&#19979;&#30340;&#25237;&#36164;&#32452;&#21512;&#31649;&#29702;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#26032;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this work, we explore the possibility of utilizing transfer learning techniques to address the financial portfolio optimization problem. We introduce a novel concept called "transfer risk", within the optimization framework of transfer learning. A series of numerical experiments are conducted from three categories: cross-continent transfer, cross-sector transfer, and cross-frequency transfer. In particular, 1. a strong correlation between the transfer risk and the overall performance of transfer learning methods is established, underscoring the significance of transfer risk as a viable indicator of "transferability"; 2. transfer risk is shown to provide a computationally efficient way to identify appropriate source tasks in transfer learning, enhancing the efficiency and effectiveness of the transfer learning approach; 3. additionally, the numerical experiments offer valuable new insights for portfolio management across these different settings.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#24378;&#20581;&#30446;&#26631;&#23548;&#21521;&#36130;&#23500;&#31649;&#29702;&#26041;&#27861;&#65292;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#35813;&#26041;&#27861;&#22312;&#27169;&#25311;&#21644;&#21382;&#21490;&#24066;&#22330;&#25968;&#25454;&#19978;&#20248;&#20110;&#20256;&#32479;&#30340;&#30446;&#26631;&#23548;&#21521;&#36130;&#23500;&#31649;&#29702;&#22522;&#20934;&#12290;</title><link>http://arxiv.org/abs/2307.13501</link><description>&lt;p&gt;
&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#22312;&#24378;&#20581;&#30446;&#26631;&#23548;&#21521;&#36130;&#23500;&#31649;&#29702;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Deep Reinforcement Learning for Robust Goal-Based Wealth Management. (arXiv:2307.13501v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.13501
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#24378;&#20581;&#30446;&#26631;&#23548;&#21521;&#36130;&#23500;&#31649;&#29702;&#26041;&#27861;&#65292;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#35813;&#26041;&#27861;&#22312;&#27169;&#25311;&#21644;&#21382;&#21490;&#24066;&#22330;&#25968;&#25454;&#19978;&#20248;&#20110;&#20256;&#32479;&#30340;&#30446;&#26631;&#23548;&#21521;&#36130;&#23500;&#31649;&#29702;&#22522;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30446;&#26631;&#23548;&#21521;&#25237;&#36164;&#26159;&#19968;&#31181;&#20248;&#20808;&#23454;&#29616;&#29305;&#23450;&#36130;&#21153;&#30446;&#26631;&#30340;&#36130;&#23500;&#31649;&#29702;&#26041;&#27861;&#12290;&#30001;&#20110;&#38656;&#35201;&#36873;&#25321;&#36866;&#24403;&#30340;&#25237;&#36164;&#30452;&#21040;&#36798;&#21040;&#30446;&#26631;&#65292;&#22240;&#27492;&#23427;&#33258;&#28982;&#22320;&#34987;&#24418;&#24335;&#21270;&#20026;&#19968;&#31181;&#39034;&#24207;&#20915;&#31574;&#38382;&#39064;&#12290;&#22240;&#27492;&#65292;&#24378;&#21270;&#23398;&#20064;&#20316;&#20026;&#19968;&#31181;&#36866;&#29992;&#20110;&#39034;&#24207;&#20915;&#31574;&#30340;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#65292;&#20026;&#20248;&#21270;&#36825;&#20123;&#25237;&#36164;&#31574;&#30053;&#25552;&#20379;&#20102;&#19968;&#20010;&#26377;&#21069;&#36884;&#30340;&#36335;&#24452;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#24378;&#20581;&#30446;&#26631;&#23548;&#21521;&#36130;&#23500;&#31649;&#29702;&#30340;&#26032;&#26041;&#27861;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#27169;&#25311;&#21644;&#21382;&#21490;&#24066;&#22330;&#25968;&#25454;&#19978;&#65292;&#35813;&#26041;&#27861;&#20248;&#20110;&#22810;&#20010;&#30446;&#26631;&#23548;&#21521;&#36130;&#23500;&#31649;&#29702;&#22522;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;
Goal-based investing is an approach to wealth management that prioritizes achieving specific financial goals. It is naturally formulated as a sequential decision-making problem as it requires choosing the appropriate investment until a goal is achieved. Consequently, reinforcement learning, a machine learning technique appropriate for sequential decision-making, offers a promising path for optimizing these investment strategies. In this paper, a novel approach for robust goal-based wealth management based on deep reinforcement learning is proposed. The experimental results indicate its superiority over several goal-based wealth management benchmarks on both simulated and historical market data.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#22411;&#30340;&#22522;&#20110;&#27874;&#21160;&#24615;&#30340;&#20132;&#26131;&#31574;&#30053;&#65292;&#32467;&#21512;&#32479;&#35745;&#20998;&#26512;&#21644;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#65292;&#29992;&#20110;&#39044;&#27979;&#32929;&#24066;&#36235;&#21183;&#12290;&#26041;&#27861;&#21253;&#25324;&#22810;&#20010;&#27493;&#39588;&#65292;&#22914;&#25968;&#25454;&#25506;&#32034;&#12289;&#30456;&#20851;&#24615;&#20998;&#26512;&#12289;&#25216;&#26415;&#25351;&#26631;&#24212;&#29992;&#12289;&#20551;&#35774;&#26816;&#39564;&#21644;&#21464;&#37327;&#36873;&#25321;&#31639;&#27861;&#12290;&#30740;&#31350;&#20351;&#29992;&#32858;&#31867;&#31639;&#27861;&#23545;&#32929;&#31080;&#36827;&#34892;&#20998;&#32452;&#65292;&#24182;&#21033;&#29992;&#26684;&#20848;&#26480;&#22240;&#26524;&#24615;&#26816;&#39564;&#30830;&#23450;&#32929;&#31080;&#20043;&#38388;&#30340;&#39044;&#27979;&#20851;&#31995;&#12290;&#24635;&#32467;&#26469;&#35828;&#65292;&#36825;&#19968;&#26041;&#27861;&#21487;&#29992;&#20110;&#24314;&#31435;&#19968;&#20010;&#20132;&#26131;&#31995;&#32479;&#65292;&#20197;&#39044;&#27979;&#32929;&#24066;&#36235;&#21183;&#12290;</title><link>http://arxiv.org/abs/2307.13422</link><description>&lt;p&gt;
VolTS&#65306;&#19968;&#31181;&#21033;&#29992;&#32479;&#35745;&#21644;&#26426;&#22120;&#23398;&#20064;&#39044;&#27979;&#32929;&#24066;&#36235;&#21183;&#30340;&#22522;&#20110;&#27874;&#21160;&#24615;&#30340;&#20132;&#26131;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
VolTS: A Volatility-based Trading System to forecast Stock Markets Trend using Statistics and Machine Learning. (arXiv:2307.13422v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.13422
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#22411;&#30340;&#22522;&#20110;&#27874;&#21160;&#24615;&#30340;&#20132;&#26131;&#31574;&#30053;&#65292;&#32467;&#21512;&#32479;&#35745;&#20998;&#26512;&#21644;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#65292;&#29992;&#20110;&#39044;&#27979;&#32929;&#24066;&#36235;&#21183;&#12290;&#26041;&#27861;&#21253;&#25324;&#22810;&#20010;&#27493;&#39588;&#65292;&#22914;&#25968;&#25454;&#25506;&#32034;&#12289;&#30456;&#20851;&#24615;&#20998;&#26512;&#12289;&#25216;&#26415;&#25351;&#26631;&#24212;&#29992;&#12289;&#20551;&#35774;&#26816;&#39564;&#21644;&#21464;&#37327;&#36873;&#25321;&#31639;&#27861;&#12290;&#30740;&#31350;&#20351;&#29992;&#32858;&#31867;&#31639;&#27861;&#23545;&#32929;&#31080;&#36827;&#34892;&#20998;&#32452;&#65292;&#24182;&#21033;&#29992;&#26684;&#20848;&#26480;&#22240;&#26524;&#24615;&#26816;&#39564;&#30830;&#23450;&#32929;&#31080;&#20043;&#38388;&#30340;&#39044;&#27979;&#20851;&#31995;&#12290;&#24635;&#32467;&#26469;&#35828;&#65292;&#36825;&#19968;&#26041;&#27861;&#21487;&#29992;&#20110;&#24314;&#31435;&#19968;&#20010;&#20132;&#26131;&#31995;&#32479;&#65292;&#20197;&#39044;&#27979;&#32929;&#24066;&#36235;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#27874;&#21160;&#24615;&#30340;&#20132;&#26131;&#31574;&#30053;&#22240;&#20854;&#33021;&#22815;&#20174;&#24066;&#22330;&#21160;&#24577;&#20013;&#25429;&#25417;&#21033;&#28070;&#26426;&#20250;&#32780;&#22312;&#37329;&#34701;&#24066;&#22330;&#20013;&#24341;&#36215;&#20102;&#24456;&#22823;&#20851;&#27880;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#23558;&#32479;&#35745;&#20998;&#26512;&#19982;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#30456;&#32467;&#21512;&#30340;&#26032;&#22411;&#22522;&#20110;&#27874;&#21160;&#24615;&#30340;&#20132;&#26131;&#31574;&#30053;&#65292;&#29992;&#20110;&#39044;&#27979;&#32929;&#24066;&#36235;&#21183;&#12290;&#35813;&#26041;&#27861;&#21253;&#25324;&#25968;&#25454;&#25506;&#32034;&#12289;&#30456;&#20851;&#24615;&#21644;&#33258;&#30456;&#20851;&#24615;&#20998;&#26512;&#12289;&#25216;&#26415;&#25351;&#26631;&#20351;&#29992;&#12289;&#20551;&#35774;&#26816;&#39564;&#21644;&#32479;&#35745;&#27169;&#22411;&#24212;&#29992;&#20197;&#21450;&#21464;&#37327;&#36873;&#25321;&#31639;&#27861;&#30340;&#20351;&#29992;&#31561;&#22810;&#20010;&#27493;&#39588;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#20351;&#29992;k-means++&#32858;&#31867;&#31639;&#27861;&#23545;&#32445;&#32422;&#35777;&#21048;&#20132;&#26131;&#25152;&#21644;&#32435;&#26031;&#36798;&#20811;&#20132;&#26131;&#25152;&#30340;&#20061;&#20010;&#26368;&#22823;&#32929;&#31080;&#30340;&#24179;&#22343;&#27874;&#21160;&#24615;&#36827;&#34892;&#20998;&#32452;&#12290;&#24471;&#21040;&#30340;&#32858;&#31867;&#32467;&#26524;&#26159;&#22522;&#20110;&#32929;&#31080;&#27874;&#21160;&#24615;&#34892;&#20026;&#26469;&#35782;&#21035;&#32929;&#31080;&#20043;&#38388;&#20851;&#31995;&#30340;&#22522;&#30784;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#20351;&#29992;&#26684;&#20848;&#26480;&#22240;&#26524;&#24615;&#26816;&#39564;&#23545;&#20013;&#31561;&#27874;&#21160;&#24615;&#30340;&#32858;&#31867;&#25968;&#25454;&#38598;&#36827;&#34892;&#65292;&#20197;&#30830;&#23450;&#19968;&#21482;&#32929;&#31080;&#23545;&#21478;&#19968;&#21482;&#32929;&#31080;&#30340;&#39044;&#27979;&#33021;&#21147;&#12290;&#36890;&#36807;&#35782;&#21035;&#36825;&#20123;&#20851;&#31995;&#65292;&#25105;&#20204;&#26500;&#24314;&#19968;&#20010;&#20132;&#26131;&#31995;&#32479;&#26469;&#39044;&#27979;&#32929;&#24066;&#36235;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
Volatility-based trading strategies have attracted a lot of attention in financial markets due to their ability to capture opportunities for profit from market dynamics. In this article, we propose a new volatility-based trading strategy that combines statistical analysis with machine learning techniques to forecast stock markets trend.  The method consists of several steps including, data exploration, correlation and autocorrelation analysis, technical indicator use, application of hypothesis tests and statistical models, and use of variable selection algorithms. In particular, we use the k-means++ clustering algorithm to group the mean volatility of the nine largest stocks in the NYSE and NasdaqGS markets. The resulting clusters are the basis for identifying relationships between stocks based on their volatility behaviour. Next, we use the Granger Causality Test on the clustered dataset with mid-volatility to determine the predictive power of a stock over another stock. By identifyin
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#30740;&#31350;&#20811;&#36182;&#26031;&#29305;&#24443;&#22855;&#30340;&#25151;&#20215;&#21464;&#21270;&#65292;&#21457;&#29616;&#36141;&#25151;&#32773;&#23545;&#22320;&#38663;&#39118;&#38505;&#30340;&#35780;&#20272;&#21463;&#26102;&#38388;&#22240;&#32032;&#24433;&#21709;&#65292;&#24182;&#22312;&#19981;&#21516;&#26102;&#38388;&#27573;&#20869;&#35266;&#23519;&#21040;&#20139;&#20048;&#20215;&#26684;&#30340;&#21464;&#21270;&#65292;&#29305;&#21035;&#26159;COVID-19&#23553;&#38145;&#21069;&#21518;&#30340;&#27573;&#33853;&#38754;&#31215;&#12290;</title><link>http://arxiv.org/abs/2307.13232</link><description>&lt;p&gt;
&#39118;&#38505;&#35780;&#20272;&#30340;&#21464;&#21270;&#20197;&#21450;&#24066;&#22330;&#28779;&#28909;&#26102;&#36141;&#25151;&#32773;&#30340;&#30701;&#26399;&#35760;&#24518;&#65306;&#22522;&#20110;&#26032;&#35199;&#20848;&#20811;&#36182;&#26031;&#29305;&#24443;&#22855;&#30340;&#26696;&#20363;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Changes in Risk Appreciation, and Short Memory of House Buyers When the Market is Hot, a Case Study of Christchurch, New Zealand. (arXiv:2307.13232v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.13232
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#30740;&#31350;&#20811;&#36182;&#26031;&#29305;&#24443;&#22855;&#30340;&#25151;&#20215;&#21464;&#21270;&#65292;&#21457;&#29616;&#36141;&#25151;&#32773;&#23545;&#22320;&#38663;&#39118;&#38505;&#30340;&#35780;&#20272;&#21463;&#26102;&#38388;&#22240;&#32032;&#24433;&#21709;&#65292;&#24182;&#22312;&#19981;&#21516;&#26102;&#38388;&#27573;&#20869;&#35266;&#23519;&#21040;&#20139;&#20048;&#20215;&#26684;&#30340;&#21464;&#21270;&#65292;&#29305;&#21035;&#26159;COVID-19&#23553;&#38145;&#21069;&#21518;&#30340;&#27573;&#33853;&#38754;&#31215;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#20351;&#29992;&#25104;&#29087;&#30340;&#20139;&#20048;&#20215;&#26684;&#27169;&#22411;&#65292;&#20998;&#26512;&#20102;&#20811;&#36182;&#26031;&#29305;&#24443;&#22855;&#30340;&#25151;&#20215;&#22312;&#19977;&#20010;&#19981;&#21516;&#30340;&#26102;&#38388;&#27573;&#20869;&#30340;&#21464;&#21270;&#65306;2011&#24180;&#22320;&#38663;&#21518;&#12289;COVID-19&#23553;&#38145;&#21069;&#21644;COVID-19&#23553;&#38145;&#21518;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#22312;&#19982;2011&#24180;&#22320;&#38663;&#26102;&#38388;&#30456;&#36317;&#36739;&#38271;&#30340;&#36141;&#25151;&#32773;&#20013;&#65292;&#23545;&#28508;&#22312;&#22320;&#38663;&#25439;&#23475;&#30340;&#39118;&#38505;&#35780;&#20272;&#19982;&#38663;&#21518;&#19981;&#21516;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#19981;&#21516;&#30340;&#26102;&#38388;&#27573;&#20869;&#65292;&#20139;&#20048;&#20215;&#26684;&#23384;&#22312;&#21487;&#35266;&#23519;&#21040;&#30340;&#21464;&#21270;&#65292;&#23588;&#20854;&#26159;COVID-19&#23553;&#38145;&#21069;&#21518;&#30340;&#27573;&#33853;&#38754;&#31215;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper house prices in Christchurch are analyzed over three distinct periods of time: post-2011 earthquake, pre-COVID-19 lockdown, and post-COVID-19 lockdown using the well-established hedonic price model. Results show that buyers, in periods that are temporally distant from the 2011 Christchurch earthquake, value the risk of potential earthquake damage to a property differently from buyers soon after the earthquake. We find that there are observable shifts in hedonic prices across the different time periods, specifically for section size pre and post COVID-19 lockdown.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22810;&#23618;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#35774;&#35745;&#65292;&#23558;&#36890;&#29992;&#30340;&#21644;&#29305;&#23450;&#30340;&#27169;&#22411;&#32467;&#21512;&#22312;&#19968;&#36215;&#65292;&#21487;&#20197;&#26681;&#25454;&#29992;&#25143;&#30340;&#20010;&#20154;&#36755;&#20837;&#21644;&#20114;&#32852;&#32593;&#20449;&#24687;&#30456;&#20114;&#25913;&#36827;&#12290;&#36825;&#31181;&#27169;&#22411;&#21463;&#21040;&#20154;&#31867;&#22823;&#33041;&#21151;&#33021;&#30340;&#21551;&#21457;&#65292;&#20855;&#26377;&#20840;&#23616;&#12289;&#39046;&#22495;&#21644;&#29992;&#25143;&#32423;&#27169;&#22411;&#65292;&#21487;&#20197;&#22312;&#26412;&#22320;&#26426;&#22120;&#19978;&#36816;&#34892;&#20197;&#20445;&#25252;&#29992;&#25143;&#38544;&#31169;&#12290;</title><link>http://arxiv.org/abs/2307.13221</link><description>&lt;p&gt;
&#20026;&#25152;&#26377;&#20154;&#35774;&#35745;&#30340;&#22810;&#23618;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Multilevel Large Language Models for Everyone. (arXiv:2307.13221v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.13221
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22810;&#23618;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#35774;&#35745;&#65292;&#23558;&#36890;&#29992;&#30340;&#21644;&#29305;&#23450;&#30340;&#27169;&#22411;&#32467;&#21512;&#22312;&#19968;&#36215;&#65292;&#21487;&#20197;&#26681;&#25454;&#29992;&#25143;&#30340;&#20010;&#20154;&#36755;&#20837;&#21644;&#20114;&#32852;&#32593;&#20449;&#24687;&#30456;&#20114;&#25913;&#36827;&#12290;&#36825;&#31181;&#27169;&#22411;&#21463;&#21040;&#20154;&#31867;&#22823;&#33041;&#21151;&#33021;&#30340;&#21551;&#21457;&#65292;&#20855;&#26377;&#20840;&#23616;&#12289;&#39046;&#22495;&#21644;&#29992;&#25143;&#32423;&#27169;&#22411;&#65292;&#21487;&#20197;&#22312;&#26412;&#22320;&#26426;&#22120;&#19978;&#36816;&#34892;&#20197;&#20445;&#25252;&#29992;&#25143;&#38544;&#31169;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36807;&#21435;&#20960;&#24180;&#20013;&#65292;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#36827;&#23637;&#12290;&#28982;&#32780;&#65292;&#23427;&#20204;&#35201;&#20040;&#26159;&#36890;&#29992;&#30340;&#65292;&#35201;&#20040;&#26159;&#39046;&#22495;&#29305;&#23450;&#30340;&#65292;&#23558;&#31038;&#21306;&#21010;&#20998;&#20026;&#19981;&#21516;&#30340;&#32676;&#20307;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23558;&#36825;&#20123;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#32479;&#19968;&#21040;&#19968;&#20010;&#26356;&#22823;&#30340;&#22320;&#22270;&#20013;&#65292;&#23558;&#36890;&#29992;&#30340;&#21644;&#29305;&#23450;&#30340;&#27169;&#22411;&#36830;&#25509;&#22312;&#19968;&#36215;&#65292;&#24182;&#26681;&#25454;&#29992;&#25143;&#30340;&#20010;&#20154;&#36755;&#20837;&#21644;&#26469;&#33258;&#20114;&#32852;&#32593;&#30340;&#20449;&#24687;&#30456;&#20114;&#25913;&#36827;&#12290;&#23558;&#22810;&#20010;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#38142;&#25509;&#22312;&#19968;&#36215;&#30340;&#24605;&#24819;&#21463;&#21040;&#20102;&#20154;&#31867;&#22823;&#33041;&#21151;&#33021;&#30340;&#21551;&#21457;&#12290;&#22823;&#33041;&#30382;&#23618;&#19978;&#30340;&#29305;&#23450;&#21306;&#22495;&#23545;&#20110;&#26576;&#20123;&#20302;&#23618;&#27425;&#21151;&#33021;&#26159;&#29305;&#23450;&#30340;&#12290;&#32780;&#36825;&#20123;&#21306;&#22495;&#21487;&#20197;&#20849;&#21516;&#24037;&#20316;&#65292;&#23454;&#29616;&#26356;&#22797;&#26434;&#30340;&#39640;&#23618;&#21151;&#33021;&#12290;&#20154;&#31867;&#22823;&#33041;&#30382;&#23618;&#19978;&#30340;&#36825;&#31181;&#34892;&#20026;&#20026;&#35774;&#35745;&#21253;&#21547;&#20840;&#23616;&#12289;&#39046;&#22495;&#21644;&#29992;&#25143;&#32423;&#27169;&#22411;&#30340;&#22810;&#23618;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#25552;&#20379;&#20102;&#26032;&#24605;&#36335;&#12290;&#29992;&#25143;&#32423;&#27169;&#22411;&#22312;&#26412;&#22320;&#26426;&#22120;&#19978;&#36816;&#34892;&#65292;&#20197;&#23454;&#29616;&#39640;&#25928;&#30340;&#21709;&#24212;&#24182;&#20445;&#25252;&#29992;&#25143;&#30340;&#38544;&#31169;&#12290;&#36825;&#26679;&#30340;&#22810;&#23618;&#27169;&#22411;&#21487;&#20197;&#20943;&#23569;&#35745;&#31639;&#36164;&#28304;&#30340;&#28040;&#32791;&#12290;
&lt;/p&gt;
&lt;p&gt;
Large language models have made significant progress in the past few years. However, they are either generic {\it or} field specific, splitting the community into different groups. In this paper, we unify these large language models into a larger map, where the generic {\it and} specific models are linked together and can improve each other, based on the user personal input and information from the internet. The idea of linking several large language models together is inspired by the functionality of human brain. The specific regions on the brain cortex are specific for certain low level functionality. And these regions can jointly work together to achieve more complex high level functionality. Such behavior on human brain cortex sheds the light to design the multilevel large language models that contain global level, field level and user level models. The user level models run on local machines to achieve efficient response and protect the user's privacy. Such multilevel models reduc
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#23545;&#25239;&#24335;&#28145;&#24230;&#23545;&#20914;&#26694;&#26550;&#65292;&#29992;&#20110;&#22312;&#19981;&#23436;&#20840;&#24066;&#22330;&#20013;&#36827;&#34892;&#34893;&#29983;&#21697;&#23545;&#20914;&#12290;&#36890;&#36807;&#23545;&#20914;&#32773;&#21644;&#29983;&#25104;&#22120;&#30340;&#23545;&#25239;&#35757;&#32451;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#23398;&#20064;&#20986;&#26080;&#38656;&#36827;&#34892;&#20215;&#26684;&#36807;&#31243;&#24314;&#27169;&#30340;&#31283;&#20581;&#23545;&#20914;&#32773;&#12290;</title><link>http://arxiv.org/abs/2307.13217</link><description>&lt;p&gt;
&#23545;&#25239;&#24335;&#28145;&#24230;&#23545;&#20914;&#65306;&#26080;&#38656;&#20215;&#26684;&#36807;&#31243;&#24314;&#27169;&#30340;&#23545;&#20914;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Adversarial Deep Hedging: Learning to Hedge without Price Process Modeling. (arXiv:2307.13217v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.13217
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#23545;&#25239;&#24335;&#28145;&#24230;&#23545;&#20914;&#26694;&#26550;&#65292;&#29992;&#20110;&#22312;&#19981;&#23436;&#20840;&#24066;&#22330;&#20013;&#36827;&#34892;&#34893;&#29983;&#21697;&#23545;&#20914;&#12290;&#36890;&#36807;&#23545;&#20914;&#32773;&#21644;&#29983;&#25104;&#22120;&#30340;&#23545;&#25239;&#35757;&#32451;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#23398;&#20064;&#20986;&#26080;&#38656;&#36827;&#34892;&#20215;&#26684;&#36807;&#31243;&#24314;&#27169;&#30340;&#31283;&#20581;&#23545;&#20914;&#32773;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#23545;&#20914;&#26159;&#19968;&#20010;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#34893;&#29983;&#21697;&#23545;&#20914;&#26694;&#26550;&#65292;&#29992;&#20110;&#19981;&#23436;&#20840;&#24066;&#22330;&#20013;&#30340;&#23545;&#20914;&#12290;&#28145;&#24230;&#23545;&#20914;&#30340;&#20248;&#21183;&#22312;&#20110;&#20854;&#33021;&#22815;&#22788;&#29702;&#21508;&#31181;&#29616;&#23454;&#24066;&#22330;&#26465;&#20214;&#65292;&#22914;&#24066;&#22330;&#25705;&#25830;&#65292;&#32780;&#36825;&#22312;&#20256;&#32479;&#30340;&#25968;&#23398;&#37329;&#34701;&#26694;&#26550;&#20013;&#24456;&#38590;&#35299;&#20915;&#12290;&#30001;&#20110;&#28145;&#24230;&#23545;&#20914;&#20381;&#36182;&#20110;&#24066;&#22330;&#27169;&#25311;&#65292;&#22240;&#27492;&#24213;&#23618;&#36164;&#20135;&#20215;&#26684;&#36807;&#31243;&#27169;&#22411;&#33267;&#20851;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;&#20851;&#20110;&#28145;&#24230;&#23545;&#20914;&#30340;&#25991;&#29486;&#24448;&#24448;&#20381;&#36182;&#20110;&#20256;&#32479;&#30340;&#25968;&#23398;&#37329;&#34701;&#27169;&#22411;&#65292;&#20363;&#22914;&#24067;&#26391;&#36816;&#21160;&#21644;&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#65292;&#32780;&#23547;&#25214;&#26377;&#25928;&#30340;&#24213;&#23618;&#36164;&#20135;&#27169;&#22411;&#29992;&#20110;&#28145;&#24230;&#23545;&#20914;&#23398;&#20064;&#19968;&#30452;&#26159;&#19968;&#20010;&#25361;&#25112;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26694;&#26550;&#65292;&#31216;&#20026;&#23545;&#25239;&#24335;&#28145;&#24230;&#23545;&#20914;&#65292;&#21463;&#21040;&#23545;&#25239;&#24615;&#23398;&#20064;&#30340;&#21551;&#21457;&#12290;&#22312;&#36825;&#20010;&#26694;&#26550;&#20013;&#65292;&#19968;&#20010;&#23545;&#20914;&#32773;&#21644;&#19968;&#20010;&#29983;&#25104;&#22120;&#20998;&#21035;&#23545;&#24213;&#23618;&#36164;&#20135;&#36807;&#31243;&#21644;&#24213;&#23618;&#36164;&#20135;&#36807;&#31243;&#36827;&#34892;&#24314;&#27169;&#65292;&#24182;&#20197;&#23545;&#25239;&#24615;&#30340;&#26041;&#24335;&#36827;&#34892;&#35757;&#32451;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#33021;&#22815;&#23398;&#20064;&#19968;&#20010;&#31283;&#20581;&#30340;&#23545;&#20914;&#32773;&#65292;&#32780;&#26080;&#38656;&#36827;&#34892;&#20215;&#26684;&#36807;&#31243;&#24314;&#27169;&#12290;
&lt;/p&gt;
&lt;p&gt;
Deep hedging is a deep-learning-based framework for derivative hedging in incomplete markets. The advantage of deep hedging lies in its ability to handle various realistic market conditions, such as market frictions, which are challenging to address within the traditional mathematical finance framework. Since deep hedging relies on market simulation, the underlying asset price process model is crucial. However, existing literature on deep hedging often relies on traditional mathematical finance models, e.g., Brownian motion and stochastic volatility models, and discovering effective underlying asset models for deep hedging learning has been a challenge. In this study, we propose a new framework called adversarial deep hedging, inspired by adversarial learning. In this framework, a hedger and a generator, which respectively model the underlying asset process and the underlying asset process, are trained in an adversarial manner. The proposed method enables to learn a robust hedger witho
&lt;/p&gt;</description></item><item><title>&#26412;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#23433;&#20840;&#25104;&#29087;&#24230;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#20197;&#35780;&#20272;&#32452;&#32455;&#30340;&#23433;&#20840;&#27700;&#24179;&#24182;&#30830;&#23450;&#32593;&#32476;&#20445;&#38505;&#30340;&#36866;&#24403;&#20445;&#36153;&#12290;</title><link>http://arxiv.org/abs/2302.04734</link><description>&lt;p&gt;
&#22522;&#20110;&#25104;&#29087;&#24230;&#27169;&#22411;&#30340;&#20449;&#24687;&#31995;&#32479;&#32593;&#32476;&#20445;&#38505;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
Pricing cyber-insurance for systems via maturity models. (arXiv:2302.04734v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.04734
&lt;/p&gt;
&lt;p&gt;
&#26412;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#23433;&#20840;&#25104;&#29087;&#24230;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#20197;&#35780;&#20272;&#32452;&#32455;&#30340;&#23433;&#20840;&#27700;&#24179;&#24182;&#30830;&#23450;&#32593;&#32476;&#20445;&#38505;&#30340;&#36866;&#24403;&#20445;&#36153;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#19982;&#20449;&#24687;&#25216;&#26415;&#31995;&#32479;&#30456;&#20851;&#30340;&#39118;&#38505;&#36827;&#34892;&#20445;&#38505;&#23450;&#20215;&#25552;&#20986;&#20102;&#19968;&#20010;&#32508;&#21512;&#30340;&#24314;&#35758;&#65292;&#32467;&#21512;&#36816;&#33829;&#31649;&#29702;&#12289;&#23433;&#20840;&#21644;&#32463;&#27982;&#23398;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#31038;&#20250;&#32463;&#27982;&#27169;&#22411;&#12290;&#35813;&#27169;&#22411;&#21253;&#25324;&#23454;&#20307;&#20851;&#31995;&#22270;&#12289;&#23433;&#20840;&#25104;&#29087;&#24230;&#27169;&#22411;&#21644;&#32463;&#27982;&#27169;&#22411;&#65292;&#35299;&#20915;&#20102;&#19968;&#20010;&#38271;&#26399;&#20197;&#26469;&#30340;&#30740;&#31350;&#38590;&#39064;&#65292;&#21363;&#22914;&#20309;&#22312;&#35774;&#35745;&#21644;&#23450;&#20215;&#32593;&#32476;&#20445;&#38505;&#25919;&#31574;&#26102;&#25429;&#25417;&#32452;&#32455;&#32467;&#26500;&#12290;&#25991;&#20013;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#25361;&#25112;&#65292;&#21363;&#32593;&#32476;&#20445;&#38505;&#30340;&#25968;&#25454;&#21382;&#21490;&#26377;&#38480;&#65292;&#19981;&#33021;&#30452;&#25509;&#24212;&#29992;&#20110;&#20854;&#23427;&#38505;&#31181;&#65292;&#22240;&#27492;&#25552;&#20986;&#19968;&#20010;&#23433;&#20840;&#25104;&#29087;&#24230;&#27169;&#22411;&#65292;&#20197;&#35780;&#20272;&#32452;&#32455;&#30340;&#23433;&#20840;&#27700;&#24179;&#24182;&#30830;&#23450;&#30456;&#24212;&#30340;&#20445;&#38505;&#36153;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Pricing insurance for risks associated with information technology systems presents a complex modelling challenge, combining the disciplines of operations management, security, and economics. This work proposes a socioeconomic model for cyber-insurance decisions compromised of entity relationship diagrams, security maturity models, and economic models, addressing a long-standing research challenge of capturing organizational structure in the design and pricing of cyber-insurance policies. Insurance pricing is usually informed by the long experience insurance companies have of the magnitude and frequency of losses that arise in organizations based on their size, industry sector, and location. Consequently, their calculations of premia will start from a baseline determined by these considerations. A unique challenge of cyber-insurance is that data history is limited and not necessarily informative of future loss risk meaning that established actuarial methodology for other lines of insur
&lt;/p&gt;</description></item></channel></rss>