<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#20581;&#22766;&#30340;&#39118;&#38505;&#24863;&#30693;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#65292;&#20248;&#21270;&#26399;&#26435;&#23545;&#20914;&#31574;&#30053;&#65292;&#29305;&#21035;&#24212;&#29992;&#20110;&#30028;&#38480;&#26399;&#26435;&#23545;&#20914;&#65292;&#38543;&#30528;&#20195;&#29702;&#39118;&#38505;&#20559;&#22909;&#21464;&#21270;&#65292;&#23545;&#20914;&#31574;&#30053;&#21457;&#29983;&#25197;&#26354;&#65292;&#40065;&#26834;&#31574;&#30053;&#20248;&#20110;&#38750;&#40065;&#26834;&#31574;&#30053;&#12290;</title><link>http://arxiv.org/abs/2303.15216</link><description>&lt;p&gt;
&#20581;&#22766;&#30340;&#39118;&#38505;&#24863;&#30693;&#26399;&#26435;&#23545;&#20914;
&lt;/p&gt;
&lt;p&gt;
Robust Risk-Aware Option Hedging. (arXiv:2303.15216v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.15216
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#20581;&#22766;&#30340;&#39118;&#38505;&#24863;&#30693;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#65292;&#20248;&#21270;&#26399;&#26435;&#23545;&#20914;&#31574;&#30053;&#65292;&#29305;&#21035;&#24212;&#29992;&#20110;&#30028;&#38480;&#26399;&#26435;&#23545;&#20914;&#65292;&#38543;&#30528;&#20195;&#29702;&#39118;&#38505;&#20559;&#22909;&#21464;&#21270;&#65292;&#23545;&#20914;&#31574;&#30053;&#21457;&#29983;&#25197;&#26354;&#65292;&#40065;&#26834;&#31574;&#30053;&#20248;&#20110;&#38750;&#40065;&#26834;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26399;&#26435;&#23545;&#20914;/&#20132;&#26131;&#30340;&#30446;&#26631;&#19981;&#20165;&#20165;&#26159;&#20026;&#20102;&#20445;&#25252;&#19979;&#34892;&#39118;&#38505;&#65292;&#36824;&#24076;&#26395;&#23547;&#27714;&#25910;&#30410;&#65292;&#39537;&#21160;&#31574;&#30053;&#12290;&#26412;&#30740;&#31350;&#23637;&#31034;&#20102;&#20581;&#22766;&#30340;&#39118;&#38505;&#24863;&#30693;&#24378;&#21270;&#23398;&#20064;(RL)&#22312;&#20943;&#36731;&#19982;&#36335;&#24452;&#30456;&#20851;&#30340;&#37329;&#34701;&#34893;&#29983;&#21697;&#39118;&#38505;&#26041;&#38754;&#30340;&#28508;&#21147;&#12290;&#25105;&#20204;&#21033;&#29992;Jaimungal&#12289;Pesenti&#12289;Wang&#12289;Tatsat(2022)&#30340;&#31574;&#30053;&#26799;&#24230;&#26041;&#27861;&#65292;&#20248;&#21270;&#20581;&#22766;&#30340;&#39118;&#38505;&#24863;&#30693;&#32489;&#25928;&#26631;&#20934;&#65292;&#20855;&#20307;&#24212;&#29992;&#20110;&#30028;&#38480;&#26399;&#26435;&#23545;&#20914;&#65292;&#24182;&#24378;&#35843;&#38543;&#30528;&#20195;&#29702;&#20174;&#39118;&#38505;&#35268;&#36991;&#36716;&#21464;&#20026;&#39118;&#38505;&#23547;&#27714;&#65292;&#26368;&#20248;&#23545;&#20914;&#31574;&#30053;&#20250;&#21457;&#29983;&#25197;&#26354;&#65292;&#20197;&#21450;&#20195;&#29702;&#22914;&#20309;&#24378;&#21270;&#20854;&#31574;&#30053;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#30740;&#31350;&#20102;&#24403;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;(DGP)&#19982;&#35757;&#32451;DGP&#19981;&#21516;&#26102;&#65292;&#23545;&#20914;&#30340;&#34920;&#29616;&#65292;&#24182;&#35777;&#26126;&#20102;&#40065;&#26834;&#31574;&#30053;&#20248;&#20110;&#38750;&#40065;&#26834;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;
The objectives of option hedging/trading extend beyond mere protection against downside risks, with a desire to seek gains also driving agent's strategies. In this study, we showcase the potential of robust risk-aware reinforcement learning (RL) in mitigating the risks associated with path-dependent financial derivatives. We accomplish this by leveraging the Jaimungal, Pesenti, Wang, Tatsat (2022) and their policy gradient approach, which optimises robust risk-aware performance criteria. We specifically apply this methodology to the hedging of barrier options, and highlight how the optimal hedging strategy undergoes distortions as the agent moves from being risk-averse to risk-seeking. As well as how the agent robustifies their strategy. We further investigate the performance of the hedge when the data generating process (DGP) varies from the training DGP, and demonstrate that the robust strategies outperform the non-robust ones.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25512;&#23548;&#20986;&#29702;&#24819;&#20195;&#29702;&#31995;&#32479;&#20013; $T$ &#21644; $\sigma$ &#20043;&#38388;&#30340;&#31934;&#30830;&#20195;&#25968;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2303.15164</link><description>&lt;p&gt;
&#20851;&#20110;&#29702;&#24819;&#20195;&#29702;&#31995;&#32479;&#20013;&#28201;&#24230;&#21644;&#27874;&#21160;&#24615;&#20043;&#38388;&#30340;&#32852;&#31995;
&lt;/p&gt;
&lt;p&gt;
On the Connection between Temperature and Volatility in Ideal Agent Systems. (arXiv:2303.15164v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.15164
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25512;&#23548;&#20986;&#29702;&#24819;&#20195;&#29702;&#31995;&#32479;&#20013; $T$ &#21644; $\sigma$ &#20043;&#38388;&#30340;&#31934;&#30830;&#20195;&#25968;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32463;&#27982;&#35745;&#37327;&#23398;&#20013;&#30340;&#22522;&#20110;&#20195;&#29702;&#30340;&#27169;&#22411;&#65292;&#20511;&#37492;&#20102;&#32479;&#35745;&#29289;&#29702;&#23398;&#20013;&#25152;&#30693;&#30340;&#33258;&#26059;&#31995;&#32479;&#65292;&#30740;&#31350;&#32773;&#35748;&#20026;&#29366;&#24577;&#21464;&#37327;&#28201;&#24230; $T$ &#19982;&#36164;&#26412;&#24066;&#22330;&#29702;&#35770;&#38382;&#39064;&#20013;&#30340;&#27874;&#21160;&#29575; $\sigma$ &#30456;&#24212;&#12290;&#20294;&#26159;&#65292;&#21040;&#30446;&#21069;&#20026;&#27490;&#65292;&#20363;&#22914;&#23545;&#20110;&#29702;&#24819;&#20195;&#29702;&#31995;&#32479;&#65292;&#23578;&#26410;&#20174;&#29702;&#35770;&#19978;&#25512;&#23548;&#20986;&#36825;&#19968;&#28857;&#12290;&#26412;&#25991;&#25512;&#23548;&#20102;&#29702;&#24819;&#20195;&#29702;&#31995;&#32479;&#20013; $T$ &#21644; $\sigma$ &#20043;&#38388;&#30340;&#31934;&#30830;&#20195;&#25968;&#20851;&#31995;&#65292;&#24182;&#35752;&#35770;&#20102;&#20854;&#24433;&#21709;&#21644;&#23616;&#38480;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Models for spin systems known from statistical physics are applied by analogy in econometrics in the form of agent-based models. Researchers suggest that the state variable temperature $T$ corresponds to volatility $\sigma$ in capital market theory problems. To the best of our knowledge, this has not yet been theoretically derived, for example, for an ideal agent system. In the present paper, we derive the exact algebraic relation between $T$ and $\sigma$ for an ideal agent system and discuss implications and limitations.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#21019;&#26032;&#21644;&#25216;&#26415;&#32422;&#26463;&#22312;&#22312;&#32447;&#21019;&#26032;&#31038;&#21306;&#20013;&#23545;&#20010;&#20154;&#23398;&#20064;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#21482;&#26377;&#22312;&#25216;&#26415;&#32422;&#26463;&#24471;&#20197;&#32531;&#35299;&#30340;&#24773;&#20917;&#19979;&#65292;&#21019;&#24847;&#32422;&#26463;&#25165;&#20250;&#23548;&#33268;&#39640;&#23398;&#20064;&#29575;&#12290;</title><link>http://arxiv.org/abs/2303.15163</link><description>&lt;p&gt;
&#21019;&#26032;&#19982;&#25216;&#26415;&#38480;&#21046;&#22914;&#20309;&#24433;&#21709;&#22312;&#32447;&#21019;&#26032;&#31038;&#21306;&#20013;&#30340;&#20010;&#20154;&#23398;&#20064;&#65311;
&lt;/p&gt;
&lt;p&gt;
How creative versus technical constraints affect individual learning in an online innovation community. (arXiv:2303.15163v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.15163
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#21019;&#26032;&#21644;&#25216;&#26415;&#32422;&#26463;&#22312;&#22312;&#32447;&#21019;&#26032;&#31038;&#21306;&#20013;&#23545;&#20010;&#20154;&#23398;&#20064;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#21482;&#26377;&#22312;&#25216;&#26415;&#32422;&#26463;&#24471;&#20197;&#32531;&#35299;&#30340;&#24773;&#20917;&#19979;&#65292;&#21019;&#24847;&#32422;&#26463;&#25165;&#20250;&#23548;&#33268;&#39640;&#23398;&#20064;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32447;&#21019;&#26032;&#31038;&#21306;&#20801;&#35768;&#22312;&#30001;&#38480;&#21046;&#38480;&#23450;&#30340;&#35774;&#35745;&#31354;&#38388;&#20869;&#23547;&#25214;&#26032;&#35299;&#20915;&#26041;&#26696;&#12290;&#36807;&#21435;&#30340;&#30740;&#31350;&#37325;&#28857;&#25918;&#22312;&#20102;&#21019;&#24847;&#38480;&#21046;&#23545;&#20010;&#20154;&#39033;&#30446;&#30340;&#24433;&#21709;&#19978;&#65292;&#20294;&#25105;&#20204;&#30693;&#36947;&#30340;&#20851;&#20110;&#32422;&#26463;&#22914;&#20309;&#24433;&#21709;&#23545;&#21453;&#22797;&#35774;&#35745;&#25552;&#20132;&#23398;&#20064;&#21644;&#22312;&#32447;&#24179;&#21488;&#30340;&#25216;&#26415;&#32422;&#26463;&#24433;&#21709;&#36739;&#23569;&#12290;&#21019;&#24847;&#21644;&#25216;&#26415;&#32422;&#26463;&#22914;&#20309;&#24433;&#21709;&#22312;&#32447;&#31038;&#21306;&#20013;&#20010;&#20154;&#25506;&#32034;&#35774;&#35745;&#31354;&#38388;&#30340;&#23398;&#20064;&#65311;&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#19968;&#23478;&#22312;&#32447;&#21019;&#26032;&#31038;&#21306;&#21313;&#24180;&#30340;&#25968;&#25454;&#65292;&#26469;&#33258;33,813&#20010;&#20154;&#30340;136,989&#39033;&#35774;&#35745;&#25552;&#20132;&#34987;&#20247;&#21253;&#12290;&#25105;&#20204;&#21033;&#29992;&#20102;&#24179;&#21488;&#19978;&#36816;&#34892;&#30340;&#20004;&#31181;&#31867;&#22411;&#30340;&#35774;&#35745;&#27604;&#36187;&#8212;&#8212;&#21019;&#24847;&#21463;&#38480;&#21644;&#38750;&#21463;&#38480;&#65292;&#24182;&#35780;&#20272;&#19968;&#20010;&#33258;&#28982;&#23454;&#39564;&#65292;&#20854;&#20013;&#24179;&#21488;&#21464;&#21270;&#20943;&#23569;&#20102;&#25216;&#26415;&#32422;&#26463;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#21482;&#26377;&#22312;&#25216;&#26415;&#38480;&#21046;&#24471;&#20197;&#32531;&#35299;&#30340;&#24773;&#20917;&#19979;&#65292;&#21019;&#24847;&#32422;&#26463;&#25165;&#20250;&#23548;&#33268;&#39640;&#23398;&#20064;&#29575;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#21457;&#29616;&#20855;&#26377;&#37325;&#35201;&#30340;&#23454;&#36341;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
Online innovation communities allow for a search for novel solutions within a design space bounded by constraints. Past research has focused on the effect of creative constraints on individual projects, but less is known about how constraints affect learning from repeated design submissions and the effect of the technical constraints that are integral to online platforms. How do creative versus technical constraints affect individual learning in exploring a design space in online communities? We analyzed ten years of data from an online innovation community that crowdsourced 136,989 design submissions from 33,813 individuals. We leveraged data from two types of design contests-creatively constrained and unconstrained-running in parallel on the platform, and we evaluated a natural experiment where a platform change reduced technical constraints. We find that creative constraints lead to high rates of learning only if technical constraints are sufficiently relaxed. Our findings have impl
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#21487;&#36870;&#35748;&#36141;&#26399;&#26435;&#30340;&#37329;&#34701;&#21407;&#35821;&#65292;&#23558;&#20854;&#36816;&#29992;&#20110;&#21435;&#20013;&#24515;&#21270;&#37329;&#34701;&#30340;&#20511;&#36151;&#20013;&#65292;&#35774;&#35745;&#20102;Miqado&#20511;&#36151;&#21327;&#35758;&#65292;&#20316;&#20026;&#28165;&#31639;&#26426;&#21046;&#30340;&#26367;&#20195;&#26041;&#26696;&#65292;&#36890;&#36807;&#40723;&#21169;&#25903;&#25345;&#32773;&#26469;&#32531;&#35299;&#28165;&#31639;&#39118;&#38505;&#12290;</title><link>http://arxiv.org/abs/2303.15162</link><description>&lt;p&gt;
&#29992;&#21487;&#36870;&#35748;&#36141;&#26399;&#26435;&#32531;&#35299;&#21435;&#20013;&#24515;&#21270;&#37329;&#34701;&#28165;&#31639;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Mitigating Decentralized Finance Liquidations with Reversible Call Options. (arXiv:2303.15162v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.15162
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#21487;&#36870;&#35748;&#36141;&#26399;&#26435;&#30340;&#37329;&#34701;&#21407;&#35821;&#65292;&#23558;&#20854;&#36816;&#29992;&#20110;&#21435;&#20013;&#24515;&#21270;&#37329;&#34701;&#30340;&#20511;&#36151;&#20013;&#65292;&#35774;&#35745;&#20102;Miqado&#20511;&#36151;&#21327;&#35758;&#65292;&#20316;&#20026;&#28165;&#31639;&#26426;&#21046;&#30340;&#26367;&#20195;&#26041;&#26696;&#65292;&#36890;&#36807;&#40723;&#21169;&#25903;&#25345;&#32773;&#26469;&#32531;&#35299;&#28165;&#31639;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21435;&#20013;&#24515;&#21270;&#37329;&#34701;&#20013;&#30340;&#28165;&#31639;&#26082;&#26159;&#31119;&#38899;&#20063;&#26159;&#21650;&#35781;&#8212;&#8212;&#23613;&#31649;&#21487;&#20197;&#38450;&#27490;&#25918;&#36151;&#20154;&#30340;&#36164;&#26412;&#25439;&#22833;&#65292;&#20294;&#21516;&#26102;&#20063;&#23548;&#33268;&#28165;&#31639;&#34746;&#26059;&#21644;&#31995;&#32479;&#24615;&#22833;&#36133;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#21487;&#36870;&#35748;&#36141;&#26399;&#26435;&#8212;&#8212;&#19968;&#31181;&#26032;&#30340;&#37329;&#34701;&#21407;&#35821;&#65292;&#20351;&#24471;&#35748;&#36141;&#26399;&#26435;&#30340;&#21334;&#26041;&#33021;&#22312;&#21040;&#26399;&#21069;&#32456;&#27490;&#23427;&#12290;&#25105;&#20204;&#23558;&#21487;&#36870;&#35748;&#36141;&#26399;&#26435;&#24212;&#29992;&#21040;&#21435;&#20013;&#24515;&#21270;&#37329;&#34701;&#30340;&#20511;&#36151;&#20013;&#65292;&#24182;&#35774;&#35745;&#20102;Miqado&#8212;&#8212;&#19968;&#20010;&#26367;&#20195;&#28165;&#31639;&#26426;&#21046;&#30340;&#20511;&#36151;&#21327;&#35758;&#12290;&#25454;&#25105;&#20204;&#25152;&#30693;&#65292;Miqado&#26159;&#39318;&#20010;&#31215;&#26497;&#32531;&#35299;&#28165;&#31639;&#20197;&#20943;&#23569;&#28165;&#31639;&#34746;&#26059;&#39118;&#38505;&#30340;&#21327;&#35758;&#12290;Miqado&#24182;&#19981;&#26159;&#21334;&#20986;&#25269;&#25276;&#21697;&#65292;&#23427;&#40723;&#21169;&#22806;&#37096;&#23454;&#20307;&#8212;&#8212;&#25152;&#35859;&#30340;&#25903;&#25345;&#32773;&#65292;&#26469;&#34917;&#20805;&#20511;&#36151;&#22836;&#23544;&#65292;&#24182;&#20026;&#20511;&#26041;&#25552;&#20379;&#39069;&#22806;&#26102;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;
Liquidations in DeFi are both a blessing and a curse -- whereas liquidations prevent lenders from capital loss, they simultaneously lead to liquidation spirals and system-wide failures. Since most lending and borrowing protocols assume liquidations are indispensable, there is an increased interest in alternative constructions that prevent immediate systemic-failure under uncertain circumstances.  In this work, we introduce reversible call options, a novel financial primitive that enables the seller of a call option to terminate it before maturity. We apply reversible call options to lending in DeFi and devise Miqado, a protocol for lending platforms to replace the liquidation mechanisms. To the best of our knowledge, Miqado is the first protocol that actively mitigates liquidations to reduce the risk of liquidation spirals. Instead of selling collateral, Miqado incentivizes external entities, so-called supporters, to top-up a borrowing position and grant the borrower additional time to
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#38024;&#23545;&#25968;&#23383;&#24179;&#21488;&#25512;&#33616;&#21151;&#33021;&#24320;&#21457;&#20102;&#20116;&#27493;&#27861;&#26469;&#37327;&#21270;&#20844;&#24179;&#31454;&#20105;&#65292;&#23454;&#35777;&#30740;&#31350;Amazon&#30340;&#25628;&#32034;&#24341;&#25806;&#25512;&#33616;&#21457;&#29616;&#19981;&#23384;&#22312;&#19981;&#20844;&#24179;&#31454;&#20105;&#12290;</title><link>http://arxiv.org/abs/2303.14947</link><description>&lt;p&gt;
&#22312;&#25968;&#23383;&#24179;&#21488;&#19978;&#34913;&#37327;&#20844;&#24179;&#31454;&#20105;
&lt;/p&gt;
&lt;p&gt;
Measuring Fair Competition on Digital Platforms. (arXiv:2303.14947v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14947
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#38024;&#23545;&#25968;&#23383;&#24179;&#21488;&#25512;&#33616;&#21151;&#33021;&#24320;&#21457;&#20102;&#20116;&#27493;&#27861;&#26469;&#37327;&#21270;&#20844;&#24179;&#31454;&#20105;&#65292;&#23454;&#35777;&#30740;&#31350;Amazon&#30340;&#25628;&#32034;&#24341;&#25806;&#25512;&#33616;&#21457;&#29616;&#19981;&#23384;&#22312;&#19981;&#20844;&#24179;&#31454;&#20105;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#23383;&#24179;&#21488;&#20351;&#29992;&#25512;&#33616;&#21151;&#33021;&#20419;&#36827;&#20080;&#21334;&#21452;&#26041;&#20043;&#38388;&#30340;&#20132;&#27969;&#12290;&#24179;&#21488;&#21442;&#19982;&#32773;&#26399;&#26395;&#21644;&#31435;&#27861;&#32773;&#36234;&#26469;&#36234;&#35201;&#27714;&#65292;&#21253;&#25324;&#25512;&#33616;&#22312;&#20869;&#30340;&#31454;&#20105;&#24517;&#39035;&#26159;&#20844;&#24179;&#30340;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#24066;&#22330;&#20027;&#23472;&#30340;&#24179;&#21488;&#21487;&#33021;&#20986;&#29616;&#30340;&#33258;&#25105;&#20248;&#20808;&#24773;&#20917;&#12290;&#28982;&#32780;&#65292;&#22312;&#24179;&#21488;&#19978;&#27979;&#35797;&#20844;&#24179;&#31454;&#20105;&#20855;&#26377;&#25361;&#25112;&#24615;&#65292;&#22240;&#20026;&#26469;&#33258;&#31454;&#20105;&#24179;&#21488;&#21442;&#19982;&#32773;&#30340;&#25253;&#20215;&#36890;&#24120;&#22312;&#20854;&#23646;&#24615;&#19978;&#26377;&#25152;&#19981;&#21516;&#65292;&#24182;&#19988;&#23384;&#22312;&#35768;&#22810;&#19981;&#21516;&#30340;&#20844;&#24179;&#23450;&#20041;&#12290;&#26412;&#25991;&#32771;&#34385;&#20102;&#36825;&#20123;&#25361;&#25112;&#65292;&#21457;&#23637;&#20102;&#19968;&#31181;&#36890;&#36807;&#25968;&#23383;&#24179;&#21488;&#19978;&#30340;&#25512;&#33616;&#24230;&#37327;&#20844;&#24179;&#31454;&#20105;&#30340;&#20116;&#27493;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#36827;&#34892;&#20004;&#39033;&#23454;&#35777;&#30740;&#31350;&#26469;&#35828;&#26126;&#35813;&#26041;&#27861;&#12290;&#36825;&#20123;&#30740;&#31350;&#26816;&#26597;&#20102;&#20122;&#39532;&#36874;&#24066;&#22330;&#19978;&#20122;&#39532;&#36874;&#25628;&#32034;&#24341;&#25806;&#30340;&#25512;&#33616;&#65292;&#21033;&#29992;&#19977;&#20010;&#22269;&#23478;&#36229;&#36807;&#19968;&#30334;&#19975;&#20010;&#27599;&#26085;&#35266;&#27979;&#20540;&#12290;&#20182;&#20204;&#21457;&#29616;&#27809;&#26377;&#19968;&#33268;&#30340;&#35777;&#25454;&#34920;&#26126;&#36890;&#36807;&#25628;&#32034;&#24341;&#25806;&#25512;&#33616;&#23384;&#22312;&#19981;&#20844;&#24179;&#31454;&#20105;&#12290;&#26412;&#25991;&#36824;&#35752;&#35770;&#20102;&#19968;&#20123;&#25919;&#31574;&#21547;&#20041;&#21644;&#26410;&#26469;&#30740;&#31350;&#30340;&#21487;&#33021;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Digital platforms use recommendations to facilitate the exchange between platform actors, such as trade between buyers and sellers. Platform actors expect, and legislators increasingly require that competition, including recommendations, are fair - especially for a market-dominating platform on which self-preferencing could occur. However, testing for fairness on platforms is challenging because offers from competing platform actors usually differ in their attributes, and many distinct fairness definitions exist. This article considers these challenges, develops a five-step approach to measure fair competition through recommendations on digital platforms, and illustrates this approach by conducting two empirical studies. These studies examine Amazon's search engine recommendations on the Amazon marketplace for more than a million daily observations from three countries. They find no consistent evidence for unfair competition through search engine recommendations. The article also discu
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#8220;&#24066;&#22330;&#28165;&#31639;&#23618;&#8221;&#30340;&#31070;&#32463;&#32593;&#32476;&#32467;&#26500;&#65292;&#21487;&#20197;&#33258;&#21160;&#24378;&#21046;&#25191;&#34892;&#25152;&#26377;&#24066;&#22330;&#28165;&#31639;&#26465;&#20214;&#65292;&#35299;&#20915;&#20102;&#29616;&#26377;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#22312;&#27714;&#35299;&#39640;&#32500;&#21160;&#24577;&#38543;&#26426;&#32463;&#27982;&#27169;&#22411;&#26041;&#38754;&#30340;&#20004;&#20010;&#30171;&#28857;&#65292;&#21363;&#24179;&#34913;&#26465;&#20214;&#22810;&#26679;&#24615;&#21644;&#27874;&#21160;&#25919;&#31574;&#12290;</title><link>http://arxiv.org/abs/2303.14802</link><description>&lt;p&gt;
&#20197;&#32463;&#27982;&#23398;&#20026;&#28789;&#24863;&#30340;&#31070;&#32463;&#32593;&#32476;&#19982;&#31283;&#23450;&#30340;&#21516;&#20262;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Economics-Inspired Neural Networks with Stabilizing Homotopies. (arXiv:2303.14802v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14802
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#8220;&#24066;&#22330;&#28165;&#31639;&#23618;&#8221;&#30340;&#31070;&#32463;&#32593;&#32476;&#32467;&#26500;&#65292;&#21487;&#20197;&#33258;&#21160;&#24378;&#21046;&#25191;&#34892;&#25152;&#26377;&#24066;&#22330;&#28165;&#31639;&#26465;&#20214;&#65292;&#35299;&#20915;&#20102;&#29616;&#26377;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#22312;&#27714;&#35299;&#39640;&#32500;&#21160;&#24577;&#38543;&#26426;&#32463;&#27982;&#27169;&#22411;&#26041;&#38754;&#30340;&#20004;&#20010;&#30171;&#28857;&#65292;&#21363;&#24179;&#34913;&#26465;&#20214;&#22810;&#26679;&#24615;&#21644;&#27874;&#21160;&#25919;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#21069;&#65292;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#27714;&#35299;&#39640;&#32500;&#21160;&#24577;&#38543;&#26426;&#32463;&#27982;&#27169;&#22411;&#36817;&#20284;&#22343;&#34913;&#30340;&#26041;&#27861;&#24120;&#24120;&#38754;&#20020;&#20004;&#20010;&#30171;&#28857;&#12290;&#31532;&#19968;&#20010;&#38382;&#39064;&#26159;&#65292;&#25439;&#22833;&#20989;&#25968;&#36890;&#24120;&#32534;&#30721;&#20102;&#21508;&#31181;&#24179;&#34913;&#26465;&#20214;&#65292;&#22914;&#24066;&#22330;&#28165;&#31639;&#21644;&#23478;&#24237;&#25110;&#20844;&#21496;&#30340;&#26368;&#20248;&#26465;&#20214;&#12290;&#22240;&#27492;&#65292;&#35757;&#32451;&#31639;&#27861;&#22312;&#36825;&#20123;&#65288;&#21487;&#33021;&#38750;&#24120;&#19981;&#21516;&#30340;&#65289;&#24179;&#34913;&#26465;&#20214;&#20043;&#38388;&#26435;&#34913;&#35823;&#24046;&#12290;&#36825;&#20351;&#24471;&#20854;&#20313;&#30340;&#35823;&#24046;&#35299;&#37322;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#31532;&#20108;&#20010;&#38382;&#39064;&#26159;&#65292;&#22810;&#20010;&#36164;&#20135;&#27169;&#22411;&#20013;&#30340;&#32452;&#21512;&#36873;&#25321;&#20165;&#22312;&#30456;&#24212;&#30340;&#24179;&#34913;&#26465;&#20214;&#35823;&#24046;&#36739;&#20302;&#26102;&#34987;&#30830;&#23450;&#12290;&#22312;&#35757;&#32451;&#24320;&#22987;&#26102;&#65292;&#36825;&#21487;&#33021;&#23548;&#33268;&#19981;&#21516;&#36164;&#20135;&#30340;&#27874;&#21160;&#25919;&#31574;&#65292;&#20174;&#32780;&#24433;&#21709;&#35757;&#32451;&#36807;&#31243;&#12290;&#20026;&#20102;&#32531;&#35299;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#20010;&#20114;&#34917;&#30340;&#21019;&#26032;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#24066;&#22330;&#28165;&#31639;&#23618;&#65292;&#36825;&#26159;&#19968;&#31181;&#31070;&#32463;&#32593;&#32476;&#32467;&#26500;&#65292;&#21487;&#20197;&#33258;&#21160;&#24378;&#21046;&#25191;&#34892;&#25152;&#26377;&#24066;&#22330;&#28165;&#31639;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
Contemporary deep learning based solution methods used to compute approximate equilibria of high-dimensional dynamic stochastic economic models are often faced with two pain points. The first problem is that the loss function typically encodes a diverse set of equilibrium conditions, such as market clearing and households' or firms' optimality conditions. Hence the training algorithm trades off errors between those -- potentially very different -equilibrium conditions. This renders the interpretation of the remaining errors challenging. The second problem is that portfolio choice in models with multiple assets is only pinned down for low errors in the corresponding equilibrium conditions. In the beginning of training, this can lead to fluctuating policies for different assets, which hampers the training process. To alleviate these issues, we propose two complementary innovations. First, we introduce Market Clearing Layers, a neural network architecture that automatically enforces all
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#27979;&#37327;&#26694;&#26550;&#65292;&#21457;&#29616;&#36328;&#23398;&#31185;&#22522;&#37329;&#25903;&#25345;&#30340;&#36328;&#23398;&#31185;&#35770;&#25991;&#19982;&#39640;&#24433;&#21709;&#21147;&#30456;&#20851;&#65292;&#20294;&#30456;&#36739;&#20110;&#23398;&#31185;&#22522;&#37329;&#65292;&#36328;&#23398;&#31185;&#22522;&#37329;&#20135;&#29983;&#30340;&#25903;&#25345;&#35770;&#25991;&#26356;&#23569;&#19988;&#24433;&#21709;&#21147;&#19979;&#38477;&#12290;</title><link>http://arxiv.org/abs/2303.14732</link><description>&lt;p&gt;
&#23398;&#31185;&#22522;&#37329;&#25903;&#25345;&#30340;&#36328;&#23398;&#31185;&#35770;&#25991;&#20855;&#26377;&#28145;&#36828;&#30340;&#31185;&#23398;&#24433;&#21709;&#21147;
&lt;/p&gt;
&lt;p&gt;
Interdisciplinary Papers Supported by Disciplinary Grants Garner Deep and Broad Scientific Impact. (arXiv:2303.14732v1 [cs.DL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14732
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#27979;&#37327;&#26694;&#26550;&#65292;&#21457;&#29616;&#36328;&#23398;&#31185;&#22522;&#37329;&#25903;&#25345;&#30340;&#36328;&#23398;&#31185;&#35770;&#25991;&#19982;&#39640;&#24433;&#21709;&#21147;&#30456;&#20851;&#65292;&#20294;&#30456;&#36739;&#20110;&#23398;&#31185;&#22522;&#37329;&#65292;&#36328;&#23398;&#31185;&#22522;&#37329;&#20135;&#29983;&#30340;&#25903;&#25345;&#35770;&#25991;&#26356;&#23569;&#19988;&#24433;&#21709;&#21147;&#19979;&#38477;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36328;&#23398;&#31185;&#30740;&#31350;&#24050;&#25104;&#20026;&#21019;&#26032;&#21644;&#21457;&#29616;&#30340;&#28201;&#24202;&#12290;&#22522;&#37329;&#25903;&#25345;&#30340;&#30740;&#31350;&#36234;&#26469;&#36234;&#21344;&#20027;&#23548;&#22320;&#20301;&#65292;&#19982;&#27492;&#21516;&#26102;&#65292;&#23545;&#36164;&#21161;&#36328;&#23398;&#31185;&#24037;&#20316;&#30340;&#20852;&#36259;&#26085;&#30410;&#22686;&#38271;&#65292;&#36825;&#24341;&#21457;&#20102;&#20851;&#20110;&#36328;&#23398;&#31185;&#25320;&#27454;&#22312;&#25903;&#25345;&#39640;&#24433;&#21709;&#36328;&#23398;&#31185;&#36827;&#23637;&#20013;&#30340;&#20316;&#29992;&#30340;&#26681;&#26412;&#38382;&#39064;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#27979;&#37327;&#26694;&#26550;&#65292;&#26469;&#37327;&#21270;&#30740;&#31350;&#22522;&#37329;&#21644;&#20986;&#29256;&#29289;&#30340;&#36328;&#23398;&#31185;&#24615;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#26469;&#33258;164&#20010;&#36164;&#21161;&#26426;&#26500;&#12289;26&#20010;&#22269;&#23478;&#30340;35&#19975;&#20010;&#25320;&#27454;&#21644;&#20174;1985&#24180;&#21040;2009&#24180;&#25215;&#35748;&#36825;&#20123;&#25320;&#27454;&#25903;&#25345;&#30340;130&#19975;&#31687;&#35770;&#25991;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#25581;&#31034;&#20102;&#20004;&#31181;&#30683;&#30462;&#30340;&#27169;&#24335;&#12290;&#19968;&#26041;&#38754;&#65292;&#36328;&#23398;&#31185;&#22522;&#37329;&#24448;&#24448;&#20250;&#20135;&#29983;&#36328;&#23398;&#31185;&#35770;&#25991;&#65292;&#32780;&#36328;&#23398;&#31185;&#35770;&#25991;&#19982;&#39640;&#24433;&#21709;&#21147;&#30456;&#20851;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#19982;&#23398;&#31185;&#22522;&#37329;&#30456;&#27604;&#65292;&#36328;&#23398;&#31185;&#22522;&#37329;&#20135;&#29983;&#30340;&#35770;&#25991;&#26356;&#23569;&#65292;&#32780;&#25903;&#25345;&#30340;&#36328;&#23398;&#31185;&#35770;&#25991;&#24433;&#21709;&#21147;&#20063;&#22823;&#22823;&#19979;&#38477;&#12290;&#25105;&#20204;&#34920;&#26126;
&lt;/p&gt;
&lt;p&gt;
Interdisciplinary research has emerged as a hotbed for innovation and discoveries. The increasing dominance of grant-supported research, combined with growing interest in funding interdisciplinary work, raises fundamental questions on the role of interdisciplinary grants in supporting high-impact interdisciplinary advances. Here we develop a measurement framework to quantify the interdisciplinarity of both research grants and publications and apply it to 350K grants from 164 funding agencies over 26 countries and 1.3M papers that acknowledged the support of these grants from 1985 to 2009. Our analysis uncovers two contradictory patterns. On the one hand, interdisciplinary grants tend to produce interdisciplinary papers and interdisciplinary papers are associated with high impact. On the other hand, compared to their disciplinary counterparts, interdisciplinary grants produce much fewer papers and interdisciplinary papers that they support have substantially reduced impact. We show that
&lt;/p&gt;</description></item><item><title>&#37329;&#34701;&#32463;&#27982;&#23398;&#20013;&#30340;&#22522;&#26412;&#25237;&#36164;&#32452;&#21512;&#36873;&#25321;&#26041;&#27861;&#30340;&#38656;&#27714;&#20215;&#26684;&#24377;&#24615;&#38590;&#20197;&#24377;&#24615;&#65292;&#36825;&#23545;&#24378;&#24377;&#24615;&#25237;&#36164;&#32773;&#30340;&#20351;&#29992;&#25552;&#20986;&#20102;&#30097;&#34385;&#65292;&#24182;&#37327;&#21270;&#20102;&#38500;&#38480;&#21046;&#22871;&#21033;&#25705;&#25830;&#20043;&#22806;&#30340;&#21453;&#23545;&#28508;&#22312;&#38169;&#20215;&#36827;&#34892;&#20132;&#26131;&#30340;&#38590;&#24230;&#65292;&#21453;&#20107;&#23454;&#23454;&#39564;&#34920;&#29616;&#20986;&#24040;&#22823;&#30340;alpha&#12290;</title><link>http://arxiv.org/abs/2303.14533</link><description>&lt;p&gt;
&#37327;&#21270;&#25237;&#36164;&#30340;&#24377;&#24615;&#24615;
&lt;/p&gt;
&lt;p&gt;
The Elasticity of Quantitative Investment. (arXiv:2303.14533v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14533
&lt;/p&gt;
&lt;p&gt;
&#37329;&#34701;&#32463;&#27982;&#23398;&#20013;&#30340;&#22522;&#26412;&#25237;&#36164;&#32452;&#21512;&#36873;&#25321;&#26041;&#27861;&#30340;&#38656;&#27714;&#20215;&#26684;&#24377;&#24615;&#38590;&#20197;&#24377;&#24615;&#65292;&#36825;&#23545;&#24378;&#24377;&#24615;&#25237;&#36164;&#32773;&#30340;&#20351;&#29992;&#25552;&#20986;&#20102;&#30097;&#34385;&#65292;&#24182;&#37327;&#21270;&#20102;&#38500;&#38480;&#21046;&#22871;&#21033;&#25705;&#25830;&#20043;&#22806;&#30340;&#21453;&#23545;&#28508;&#22312;&#38169;&#20215;&#36827;&#34892;&#20132;&#26131;&#30340;&#38590;&#24230;&#65292;&#21453;&#20107;&#23454;&#23454;&#39564;&#34920;&#29616;&#20986;&#24040;&#22823;&#30340;alpha&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37329;&#34701;&#32463;&#27982;&#23398;&#20013;&#22522;&#26412;&#30340;&#25237;&#36164;&#32452;&#21512;&#36873;&#25321;&#26041;&#27861;&#30340;&#38656;&#27714;&#20215;&#26684;&#24377;&#24615;&#26159;&#22810;&#23569;&#65311;&#25991;&#29486;&#20013;&#30340;12&#20010;&#27169;&#22411;&#34920;&#29616;&#20986;&#24778;&#20154;&#30340;&#19981;&#24377;&#24615;&#38656;&#27714;&#65292;&#19982;&#32463;&#20856;&#27169;&#22411;&#24418;&#25104;&#23545;&#27604;&#12290;&#36825;&#26159;&#30001;&#20110;&#23454;&#38469;&#20013;&#21453;&#23545;&#20215;&#26684;&#21464;&#21270;&#36827;&#34892;&#20132;&#26131;&#30340;&#38590;&#24230;&#65292;&#19982;&#38656;&#27714;&#24377;&#24615;&#20272;&#35745;&#30456;&#19968;&#33268;&#12290;&#36825;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;&#22238;&#31572;&#19981;&#24377;&#24615;&#24066;&#22330;&#20551;&#35774;&#30340;&#26041;&#27861;&#65292;&#23545;&#20110;&#29702;&#35770;&#27169;&#22411;&#20013;&#20351;&#29992;&#24378;&#24377;&#24615;&#25237;&#36164;&#32773;&#23384;&#22312;&#37325;&#35201;&#38382;&#39064;&#65292;&#24182;&#37327;&#21270;&#20102;&#38500;&#22871;&#21033;&#25705;&#25830;&#30340;&#26631;&#20934;&#38480;&#21046;&#20043;&#22806;&#30340;&#21453;&#23545;&#28508;&#22312;&#38169;&#20215;&#36827;&#34892;&#20132;&#26131;&#30340;&#38590;&#24230;&#12290;&#36825;&#20123;&#38656;&#27714;&#20989;&#25968;&#30340;&#21453;&#20107;&#23454;&#23454;&#39564;&#34920;&#29616;&#20986;&#24040;&#22823;&#32780;&#25345;&#20037;&#30340;alpha&#12290;
&lt;/p&gt;
&lt;p&gt;
What is the price elasticity of demand for canonical portfolio choice methods in financial economics? Twelve models from the literature exhibit strikingly inelastic demand, in contrast to classical models. This is due to the difficulty of trading against price changes in practice, and is consistent with demand elasticity estimates. This provides a novel answer to the inelastic markets hypothesis, raises important concerns for the use of strongly elastic investors in theory models, and quantifies the difficulty of trading against potential mispricing aside from the standard limits to arbitrage frictions. Counterfactual experiments with these demand functions exhibit large and persistent alpha.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#27169;&#25311;&#30740;&#31350;&#20102;&#20998;&#25955;&#24335;&#21033;&#28070;&#20013;&#24515;&#20844;&#21496;&#30340;&#21327;&#35843;&#29983;&#20135;&#36807;&#31243;&#65292;&#30528;&#37325;&#20998;&#26512;&#20102;&#25237;&#36164;&#20915;&#31574;&#21644;&#21097;&#20313;&#20221;&#39069;&#20998;&#37197;&#23545;&#31649;&#29702;&#32489;&#25928;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#27169;&#31946;Q&#23398;&#20064;&#26234;&#33021;&#20307;&#21487;&#20197;&#21462;&#24471;&#19982;&#29702;&#24615;&#26368;&#22823;&#21270;&#32773;&#30456;&#21516;&#30340;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2303.14515</link><description>&lt;p&gt;
&#21327;&#21830;&#36716;&#31227;&#20215;&#26684;&#19979;&#30340;&#29305;&#23450;&#25237;&#36164;&#65306;&#19981;&#21516;&#21097;&#20313;&#20221;&#39069;&#20998;&#37197;&#21442;&#25968;&#23545;&#31649;&#29702;&#32489;&#25928;&#30340;&#24433;&#21709;&#65306;&#19968;&#31181;&#22522;&#20110;&#27169;&#31946;Q&#23398;&#20064;&#26234;&#33021;&#20307;&#30340;&#23454;&#35777;&#20998;&#26512; (arXiv:2303.14515v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
Specific investments under negotiated transfer pricing: effects of different surplus sharing parameters on managerial performance: An agent-based simulation with fuzzy Q-learning agents. (arXiv:2303.14515v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14515
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#27169;&#25311;&#30740;&#31350;&#20102;&#20998;&#25955;&#24335;&#21033;&#28070;&#20013;&#24515;&#20844;&#21496;&#30340;&#21327;&#35843;&#29983;&#20135;&#36807;&#31243;&#65292;&#30528;&#37325;&#20998;&#26512;&#20102;&#25237;&#36164;&#20915;&#31574;&#21644;&#21097;&#20313;&#20221;&#39069;&#20998;&#37197;&#23545;&#31649;&#29702;&#32489;&#25928;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#27169;&#31946;Q&#23398;&#20064;&#26234;&#33021;&#20307;&#21487;&#20197;&#21462;&#24471;&#19982;&#29702;&#24615;&#26368;&#22823;&#21270;&#32773;&#30456;&#21516;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20851;&#27880;&#30340;&#26159;&#19968;&#20010;&#20351;&#29992;&#21327;&#21830;&#36716;&#31227;&#23450;&#20215;&#20316;&#20026;&#21327;&#35843;&#29983;&#20135;&#36807;&#31243;&#24037;&#20855;&#30340;&#20998;&#25955;&#24335;&#21033;&#28070;&#20013;&#24515;&#20844;&#21496;&#12290;&#27492;&#22806;&#65292;&#24635;&#37096;&#25480;&#26435;&#20854;&#37096;&#38376;&#23545;&#25805;&#20316;&#20915;&#31574;&#25317;&#26377;&#23436;&#20840;&#30340;&#31649;&#29702;&#26435;&#65292;&#24182;&#19988;&#20551;&#23450;&#27599;&#20010;&#37096;&#38376;&#36824;&#21487;&#20197;&#20570;&#20986;&#25552;&#21069;&#30340;&#25237;&#36164;&#20915;&#31574;&#65292;&#20197;&#22686;&#24378;&#20869;&#37096;&#36152;&#26131;&#30340;&#20215;&#20540;&#12290;&#26412;&#25991;&#25193;&#23637;&#20102;&#26089;&#26399;&#30340;&#30740;&#31350;&#65292;&#24182;&#36890;&#36807;&#22522;&#20110;&#26234;&#33021;&#20307;&#30340;&#27169;&#25311;&#30740;&#31350;&#26469;&#26816;&#39564;&#20197;&#21069;&#30340;&#20316;&#21697;&#65292;&#25506;&#35752;&#35748;&#30693;&#21463;&#38480;&#20010;&#20307;&#26159;&#21542;&#33021;&#20687;&#23436;&#20840;&#29702;&#24615;&#30340;&#25928;&#29992;&#26368;&#22823;&#21270;&#32773;&#19968;&#26679;&#21462;&#24471;&#30456;&#21516;&#30340;&#32467;&#26524;&#12290;&#27492;&#22806;&#65292;&#26412;&#25991;&#35843;&#26597;&#20102;&#19981;&#21516;&#30340;&#35848;&#21028;&#33021;&#21147;&#32452;&#21512;&#65292;&#20197;&#26597;&#30475;&#20559;&#31163;&#25512;&#33616;&#26368;&#20339;&#35848;&#21028;&#33021;&#21147;&#26159;&#21542;&#23548;&#33268;&#26356;&#39640;&#30340;&#31649;&#29702;&#32489;&#25928;&#12290;&#27169;&#25311;&#32467;&#26524;&#26174;&#31034;&#65292;&#27169;&#31946;Q&#23398;&#20064;&#26234;&#33021;&#20307;&#30340;&#24615;&#33021;&#33267;&#23569;&#19982;&#25928;&#29992;&#26368;&#22823;&#21270;&#32773;&#19968;&#26679;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper focuses on a decentralized profit-center firm that uses negotiated transfer pricing as an instrument to coordinate the production process. Moreover, the firm's headquarters gives its divisions full authority over operating decisions and it is assumed that each division can additionally make an upfront investment decision that enhances the value of internal trade. On early works, the paper expands the number of divisions by one downstream division and relaxes basic assumptions, such as the assumption of common knowledge of rationality. Based on an agent-based simulation, it is examined whether cognitively bounded individuals modeled by fuzzy Q-learning achieve the same results as fully rational utility maximizers. In addition, the paper investigates different constellations of bargaining power to see whether a deviation from the recommended optimal bargaining power leads to a higher managerial performance. The simulation results show that fuzzy Q-learning agents perform at le
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#25506;&#35752;&#20102;&#20010;&#20154;&#22312;&#25112;&#20105;&#26292;&#38706;&#21518;&#30340;&#32844;&#19994;&#29983;&#28079;&#21463;&#21040;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#36825;&#20123;&#24433;&#21709;&#20165;&#22312;&#26576;&#20123;&#29983;&#21629;&#21608;&#26399;&#38454;&#27573;&#25165;&#26174;&#29616;&#65292;&#23613;&#31649;&#25112;&#20105;&#20260;&#20129;&#23548;&#33268;&#32769;&#24180;&#20154;&#23601;&#19994;&#20943;&#23569;&#65292;&#20294;&#21069;&#25112;&#20440;&#21017;&#25512;&#36831;&#20102;&#36864;&#20241;&#26102;&#38388;&#65292;&#35768;&#22810;&#27969;&#31163;&#22833;&#25152;&#30340;&#24037;&#20154;&#65292;&#29305;&#21035;&#26159;&#22899;&#24615;&#65292;&#20174;&#26410;&#37325;&#36820;&#23601;&#19994;&#24066;&#22330;&#12290;</title><link>http://arxiv.org/abs/2303.14486</link><description>&lt;p&gt;
&#25112;&#20105;&#26292;&#38706;&#21450;&#20854;&#23545;&#20010;&#20154;&#32844;&#19994;&#29983;&#28079;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Exposure to War and Its Labor Market Consequences over the Life Cycle. (arXiv:2303.14486v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14486
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#25506;&#35752;&#20102;&#20010;&#20154;&#22312;&#25112;&#20105;&#26292;&#38706;&#21518;&#30340;&#32844;&#19994;&#29983;&#28079;&#21463;&#21040;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#36825;&#20123;&#24433;&#21709;&#20165;&#22312;&#26576;&#20123;&#29983;&#21629;&#21608;&#26399;&#38454;&#27573;&#25165;&#26174;&#29616;&#65292;&#23613;&#31649;&#25112;&#20105;&#20260;&#20129;&#23548;&#33268;&#32769;&#24180;&#20154;&#23601;&#19994;&#20943;&#23569;&#65292;&#20294;&#21069;&#25112;&#20440;&#21017;&#25512;&#36831;&#20102;&#36864;&#20241;&#26102;&#38388;&#65292;&#35768;&#22810;&#27969;&#31163;&#22833;&#25152;&#30340;&#24037;&#20154;&#65292;&#29305;&#21035;&#26159;&#22899;&#24615;&#65292;&#20174;&#26410;&#37325;&#36820;&#23601;&#19994;&#24066;&#22330;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20108;&#25112;&#26159;&#20154;&#31867;&#21382;&#21490;&#19978;&#26368;&#20855;&#30772;&#22351;&#24615;&#30340;&#25112;&#20105;&#65292;&#20849;&#26377;7000&#19975;&#20154;&#27515;&#20129;&#65292;&#32780;&#24184;&#23384;&#32773;&#20013;&#26377;&#25968;&#30334;&#19975;&#20154;&#34987;&#36843;&#27969;&#31163;&#22833;&#25152;&#12289;&#27531;&#30142;&#36864;&#20237;&#25110;&#34987;&#22234;&#31105;&#22810;&#24180;&#12290;&#26412;&#25991;&#25506;&#35752;&#20102;&#27492;&#31867;&#25112;&#20105;&#32463;&#21382;&#23545;&#20010;&#20154;&#32844;&#19994;&#29983;&#28079;&#30340;&#24433;&#21709;&#65292;&#24182;&#25351;&#20986;&#36825;&#20123;&#24433;&#21709;&#24448;&#24448;&#21482;&#22312;&#26576;&#20123;&#29983;&#21629;&#21608;&#26399;&#38454;&#27573;&#25165;&#26174;&#29616;&#12290;&#23613;&#31649;&#25112;&#20105;&#20260;&#20129;&#23548;&#33268;&#32769;&#24180;&#20154;&#23601;&#19994;&#20943;&#23569;&#65292;&#20294;&#21069;&#25112;&#20440;&#21017;&#25512;&#36831;&#20102;&#36864;&#20241;&#26102;&#38388;&#12290;&#35768;&#22810;&#27969;&#31163;&#22833;&#25152;&#30340;&#24037;&#20154;&#65292;&#29305;&#21035;&#26159;&#22899;&#24615;&#65292;&#20174;&#26410;&#37325;&#36820;&#23601;&#19994;&#24066;&#22330;&#12290;&#36825;&#20123;&#21709;&#24212;&#31526;&#21512;&#26631;&#20934;&#30340;&#29983;&#21629;&#21608;&#26399;&#29702;&#35770;&#65292;&#22240;&#27492;&#21487;&#33021;&#36866;&#29992;&#20110;&#20854;&#20182;&#20914;&#31361;&#24773;&#22659;&#12290;
&lt;/p&gt;
&lt;p&gt;
With 70 million dead, World War II remains the most devastating conflict in history. Of the survivors, millions were displaced, returned maimed from the battlefield, or spent years in captivity. We examine the impact of such wartime experiences on labor market careers and show that they often become apparent only at certain life stages. While war injuries reduced employment in old age, former prisoners of war postponed their retirement. Many displaced workers, particularly women, never returned to employment. These responses are in line with standard life-cycle theory and thus likely extend to other conflicts.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#26234;&#33021;&#19987;&#19994;&#21270;&#21644;&#20135;&#21697;&#31354;&#38388;&#25991;&#29486;&#20013;&#30340;&#23494;&#24230;&#24230;&#37327;&#65292;&#21457;&#29616;&#23494;&#24230;&#19981;&#20165;&#25429;&#25417;&#19968;&#20010;&#22269;&#23478;&#24403;&#21069;&#19987;&#19994;&#21270;&#27169;&#24335;&#21644;&#20854;&#21487;&#33021;&#22810;&#20803;&#21270;&#30340;&#28508;&#22312;&#20135;&#21697;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#20063;&#19982;&#35813;&#22269;&#30340;&#22810;&#20803;&#21270;&#31243;&#24230;&#20197;&#21450;&#20135;&#21697;&#30340;&#26222;&#36941;&#24615;&#30456;&#20851;&#12290;&#30456;&#20851;&#22810;&#26679;&#24615;&#30340;&#30456;&#23545;&#24433;&#21709;&#38543;&#30528;&#22269;&#23478;&#22810;&#20803;&#21270;&#27700;&#24179;&#30340;&#25552;&#39640;&#32780;&#22686;&#21152;&#12290;</title><link>http://arxiv.org/abs/2303.14458</link><description>&lt;p&gt;
&#30456;&#20851;&#36824;&#26159;&#26080;&#20851;&#30340;&#22810;&#20803;&#21270;&#65306;&#20160;&#20040;&#26159;&#26234;&#33021;&#19987;&#19994;&#21270;&#65311;
&lt;/p&gt;
&lt;p&gt;
Related or Unrelated Diversification: What is Smart Specialization?. (arXiv:2303.14458v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14458
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26234;&#33021;&#19987;&#19994;&#21270;&#21644;&#20135;&#21697;&#31354;&#38388;&#25991;&#29486;&#20013;&#30340;&#23494;&#24230;&#24230;&#37327;&#65292;&#21457;&#29616;&#23494;&#24230;&#19981;&#20165;&#25429;&#25417;&#19968;&#20010;&#22269;&#23478;&#24403;&#21069;&#19987;&#19994;&#21270;&#27169;&#24335;&#21644;&#20854;&#21487;&#33021;&#22810;&#20803;&#21270;&#30340;&#28508;&#22312;&#20135;&#21697;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#20063;&#19982;&#35813;&#22269;&#30340;&#22810;&#20803;&#21270;&#31243;&#24230;&#20197;&#21450;&#20135;&#21697;&#30340;&#26222;&#36941;&#24615;&#30456;&#20851;&#12290;&#30456;&#20851;&#22810;&#26679;&#24615;&#30340;&#30456;&#23545;&#24433;&#21709;&#38543;&#30528;&#22269;&#23478;&#22810;&#20803;&#21270;&#27700;&#24179;&#30340;&#25552;&#39640;&#32780;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#23494;&#24230;&#24230;&#37327;&#22312;&#26234;&#33021;&#19987;&#19994;&#21270;&#21644;&#20135;&#21697;&#31354;&#38388;&#25991;&#29486;&#20013;&#30340;&#24615;&#36136;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#23613;&#31649;&#23494;&#24230;&#24212;&#35813;&#25429;&#25417;&#19968;&#20010;&#22269;&#23478;&#24403;&#21069;&#19987;&#19994;&#21270;&#27169;&#24335;&#21644;&#20854;&#21487;&#33021;&#22810;&#20803;&#21270;&#30340;&#28508;&#22312;&#20135;&#21697;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#20294;&#23494;&#24230;&#20063;&#19982;&#35813;&#22269;&#30340;&#22810;&#20803;&#21270;&#31243;&#24230;&#24378;&#30456;&#20851;&#65292;&#24182;&#19988;&#65288;&#36739;&#23569;&#65289;&#19982;&#20135;&#21697;&#30340;&#26222;&#36941;&#24615;&#30456;&#20851;&#12290; &#22810;&#26679;&#24615;&#21644;&#26222;&#36941;&#24615;&#20849;&#21516;&#35299;&#37322;&#20102;93&#65285;&#30340;&#23494;&#24230;&#24046;&#24322;&#12290;&#25105;&#20204;&#23558;&#23494;&#24230;&#20998;&#20026;&#23545;&#24212;&#30456;&#20851;&#21464;&#37327;&#30340;&#37096;&#20998;&#21644;&#19981;&#23545;&#24212;&#30340;&#26080;&#20851;&#21464;&#37327;&#30340;&#37096;&#20998;&#12290;&#22312;&#39044;&#27979;&#19987;&#19994;&#21270;&#22686;&#30410;&#25110;&#25439;&#22833;&#30340;&#22238;&#24402;&#20013;&#65292;&#36825;&#20004;&#37096;&#20998;&#37117;&#26159;&#26174;&#33879;&#30340;&#12290;&#30456;&#20851;&#22810;&#26679;&#24615;&#30340;&#30456;&#23545;&#24433;&#21709;&#38543;&#30528;&#22269;&#23478;&#22810;&#20803;&#21270;&#27700;&#24179;&#30340;&#25552;&#39640;&#32780;&#22686;&#21152;&#65306;&#21482;&#26377;&#24050;&#32463;&#23454;&#29616;&#22810;&#20803;&#21270;&#30340;&#22269;&#23478;&#25165;&#26174;&#31034;&#20986;&#30456;&#20851;&#22810;&#26679;&#24615;&#30340;&#24378;&#28872;&#24433;&#21709;&#12290;&#22312;&#25105;&#20204;&#30340;&#23454;&#35777;&#20998;&#26512;&#20013;&#65292;&#25105;&#20204;&#21516;&#26679;&#24378;&#35843;&#20102;&#19987;&#19994;&#21270;&#30340;&#22686;&#30410;&#21644;&#25439;&#22833;
&lt;/p&gt;
&lt;p&gt;
In this paper, we investigate the nature of the density metric, which is employed in the literature on smart specialization and the product space. We find that although density is supposed to capture relatedness between a country's current specialization pattern and potential products that it may diversify into, density is also correlated strongly to the level of diversification of the country, and (less strongly) to the ubiquity of the product. Together, diversity and ubiquity capture 93% of the variance of density. We split density into a part that corresponds to related variety, and a part that does not (i.e., unrelated variety). In regressions for predicting gain or loss of specialization, both these parts are significant. The relative influence of related variety increases with the level of diversification of the country: only countries that are already diversified show a strong influence of related variety. In our empirical analysis, we put equal emphasis on gains and losses of s
&lt;/p&gt;</description></item><item><title>&#26412;&#31687;&#35770;&#25991;&#36890;&#36807;&#37327;&#21270;&#30340;&#26041;&#27861;&#30740;&#31350;&#20102;2011&#24180;&#33267;2018&#24180;&#22806;&#22269;&#20379;&#24212;&#21830;&#22312;&#24052;&#35199;&#32852;&#37030;&#25307;&#26631;&#20013;&#30340;&#20316;&#29992;&#20197;&#21450;&#20854;&#23545;&#22269;&#20869;&#20225;&#19994;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2303.14447</link><description>&lt;p&gt;
&#22806;&#22269;&#20225;&#19994;&#21442;&#19982;&#32852;&#37030;&#25307;&#26631;&#65306;&#37319;&#36141;&#38754;&#26495;&#30340;&#37327;&#21270;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Foreign participation in federal biddings: A quantitative approach using the procurement panel. (arXiv:2303.14447v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14447
&lt;/p&gt;
&lt;p&gt;
&#26412;&#31687;&#35770;&#25991;&#36890;&#36807;&#37327;&#21270;&#30340;&#26041;&#27861;&#30740;&#31350;&#20102;2011&#24180;&#33267;2018&#24180;&#22806;&#22269;&#20379;&#24212;&#21830;&#22312;&#24052;&#35199;&#32852;&#37030;&#25307;&#26631;&#20013;&#30340;&#20316;&#29992;&#20197;&#21450;&#20854;&#23545;&#22269;&#20869;&#20225;&#19994;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25307;&#26631;&#26159;&#20844;&#20849;&#34892;&#25919;&#37096;&#38376;&#21644;&#27861;&#24459;&#35268;&#23450;&#30340;&#20854;&#20182;&#20154;&#36890;&#36807;&#23458;&#35266;&#21644;&#19981;&#20559;&#20307;&#30340;&#26631;&#20934;&#26469;&#36873;&#25321;&#26368;&#20339;&#24314;&#35758;&#20197;&#31614;&#35746;&#26381;&#21153;&#21644;&#37319;&#36141;&#21830;&#21697;&#30340;&#34892;&#25919;&#27969;&#31243;&#12290;&#22312;&#20840;&#29699;&#21270;&#30340;&#26102;&#20195;&#65292;&#20844;&#21496;&#36890;&#24120;&#36890;&#36807;&#21442;&#21152;&#25307;&#26631;&#26469;&#23547;&#27714;&#19994;&#21153;&#25193;&#24352;&#12290;&#24052;&#35199;&#27861;&#24459;&#20801;&#35768;&#22806;&#22269;&#20379;&#24212;&#21830;&#21442;&#21152;&#22312;&#35813;&#22269;&#20030;&#34892;&#30340;&#25237;&#26631;&#27963;&#21160;&#12290;&#36890;&#36807;&#37327;&#21270;&#26041;&#27861;&#65292;&#26412;&#25991;&#35752;&#35770;&#20102;2011&#24180;&#33267;2018&#24180;&#38388;&#22806;&#22269;&#20379;&#24212;&#21830;&#21442;&#19982;&#32852;&#37030;&#25307;&#26631;&#30340;&#20316;&#29992;&#12290;&#20026;&#27492;&#65292;&#36827;&#34892;&#20102;&#20851;&#20110;&#20844;&#20849;&#37319;&#36141;&#21644;&#22269;&#38469;&#25307;&#26631;&#30340;&#25991;&#29486;&#35780;&#35770;&#12290;&#27492;&#22806;&#65292;&#36890;&#36807;&#32852;&#37030;&#25919;&#24220;&#37319;&#36141;&#38754;&#26495;&#23454;&#29616;&#20102;&#24191;&#27867;&#30340;&#25968;&#25454;&#25628;&#32034;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#22312;2011&#24180;&#33267;2018&#24180;&#38388;&#65292;&#24050;&#30830;&#35748;&#20102;&#36229;&#36807;4226&#20159;&#38647;&#20122;&#23572;&#30340;&#20844;&#20849;&#37319;&#36141;&#27969;&#31243;&#65292;&#20854;&#20013;&#32422;289&#20159;&#38647;&#20122;&#23572;&#30830;&#35748;&#32473;&#20102;&#22806;&#22269;&#20379;&#24212;&#21830;&#12290;&#21355;&#29983;&#37096;&#21344;&#25454;&#20102;&#20854;&#20013;&#30340;&#19968;&#22823;&#37096;&#20998;&#12290;
&lt;/p&gt;
&lt;p&gt;
The bidding is the Public Administration's administrative process and other designated persons by law to select the best proposal, through objective and impersonal criteria, for contracting services and purchasing goods. In times of globalization, it is common for companies seeking to expand their business by participating in biddings. Brazilian legislation allows the participation of foreign suppliers in bids held in the country. Through a quantitative approach, this article discusses the weight of foreign suppliers' involvement in federal bidding between 2011 and 2018. To this end, a literature review was conducted on public procurement and international biddings. Besides, an extensive data search was achieved through the Federal Government Procurement Panel. The results showed that between 2011 and 2018, more than R\$ 422.6 billion was confirmed in public procurement processes, and of this total, about R\$ 28.9 billion was confirmed to foreign suppliers. The Ministry of Health accou
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#65292;&#21457;&#29616;&#25512;&#33616;&#31995;&#32479;&#22312;&#20849;&#21516;&#22522;&#37329;&#25237;&#36164;&#20013;&#20250;&#26174;&#33879;&#25512;&#21160;&#26356;&#22810;&#36141;&#20080;&#34892;&#20026;&#65292;&#23588;&#20854;&#26159;&#22312;&#19981;&#25104;&#29087;&#30340;&#25237;&#36164;&#32773;&#20013;&#12290;&#28982;&#32780;&#65292;&#36141;&#20080;&#25512;&#33616;&#22522;&#37329;&#30340;&#25237;&#36164;&#32773;&#24448;&#24448;&#33719;&#24471;&#26356;&#24046;&#30340;&#25237;&#36164;&#32489;&#25928;&#65292;&#20174;&#32780;&#21152;&#21095;&#20102;&#37329;&#34701;&#24066;&#22330;&#25237;&#36164;&#32773;&#20043;&#38388;&#30340;&#36130;&#23500;&#19981;&#24179;&#31561;&#12290;</title><link>http://arxiv.org/abs/2303.14263</link><description>&lt;p&gt;
&#31639;&#27861;&#30340;&#40657;&#26263;&#38754;&#65311;&#25512;&#33616;&#31995;&#32479;&#23545;&#22312;&#32447;&#25237;&#36164;&#32773;&#34892;&#20026;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Dark Side of Algorithms? The Effect of Recommender Systems on Online Investor Behaviors. (arXiv:2303.14263v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14263
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#65292;&#21457;&#29616;&#25512;&#33616;&#31995;&#32479;&#22312;&#20849;&#21516;&#22522;&#37329;&#25237;&#36164;&#20013;&#20250;&#26174;&#33879;&#25512;&#21160;&#26356;&#22810;&#36141;&#20080;&#34892;&#20026;&#65292;&#23588;&#20854;&#26159;&#22312;&#19981;&#25104;&#29087;&#30340;&#25237;&#36164;&#32773;&#20013;&#12290;&#28982;&#32780;&#65292;&#36141;&#20080;&#25512;&#33616;&#22522;&#37329;&#30340;&#25237;&#36164;&#32773;&#24448;&#24448;&#33719;&#24471;&#26356;&#24046;&#30340;&#25237;&#36164;&#32489;&#25928;&#65292;&#20174;&#32780;&#21152;&#21095;&#20102;&#37329;&#34701;&#24066;&#22330;&#25237;&#36164;&#32773;&#20043;&#38388;&#30340;&#36130;&#23500;&#19981;&#24179;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#22312;&#32447;&#25237;&#36164;&#24179;&#21488;&#24191;&#27867;&#37319;&#29992;&#20102;&#25512;&#33616;&#31995;&#32479;&#65292;&#20294;&#23545;&#20854;&#23545;&#22312;&#32447;&#25237;&#36164;&#32773;&#34892;&#20026;&#30340;&#24433;&#21709;&#36827;&#34892;&#30340;&#23454;&#35777;&#30740;&#31350;&#24456;&#23569;&#12290;&#26412;&#30740;&#31350;&#20351;&#29992;&#26469;&#33258;&#20840;&#29699;&#30005;&#23376;&#21830;&#21153;&#24179;&#21488;&#30340;&#25968;&#25454;&#65292;&#37319;&#29992;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#65292;&#20174;&#22240;&#26524;&#35282;&#24230;&#30740;&#31350;&#20102;&#25512;&#33616;&#31995;&#32479;&#23545;&#22312;&#32447;&#25237;&#36164;&#32773;&#34892;&#20026;&#30340;&#24433;&#21709;&#65292;&#29305;&#21035;&#26159;&#22312;&#20849;&#21516;&#22522;&#37329;&#25237;&#36164;&#26041;&#38754;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#30001;&#25512;&#33616;&#31995;&#32479;&#25512;&#33616;&#30340;&#22522;&#37329;&#20250;&#26174;&#33879;&#20419;&#36827;&#26356;&#22810;&#30340;&#36141;&#20080;&#34892;&#20026;&#12290;&#36825;&#31181;&#24433;&#21709;&#22312;&#19981;&#25104;&#29087;&#30340;&#25237;&#36164;&#32773;&#20013;&#23588;&#20026;&#26126;&#26174;&#65292;&#20182;&#20204;&#20284;&#20046;&#26356;&#23481;&#26131;&#36981;&#24490;&#31995;&#32479;&#25552;&#20379;&#30340;&#24314;&#35758;&#12290;&#36827;&#19968;&#27493;&#30340;&#20998;&#26512;&#36824;&#25581;&#31034;&#20102;&#65292;&#36825;&#20123;&#25237;&#36164;&#32773;&#20542;&#21521;&#20110;&#22312;&#36141;&#20080;&#25512;&#33616;&#22522;&#37329;&#21518;&#36973;&#21463;&#26174;&#33879;&#26356;&#31967;&#31957;&#30340;&#25237;&#36164;&#32489;&#25928;&#12290;&#22240;&#27492;&#65292;&#25512;&#33616;&#31995;&#32479;&#21487;&#33021;&#20250;&#21152;&#21095;&#37329;&#34701;&#24066;&#22330;&#25237;&#36164;&#32773;&#20043;&#38388;&#30340;&#36130;&#23500;&#19981;&#24179;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;
Despite the widespread adoption of recommender systems by online investment platforms, empirical research into their impact on online investors' behaviors is scarce. Using data from a global e-commerce platform, the authors of this study adopt a regression discontinuity design to causally examine the effects of recommender systems on online investor behaviors, specifically in a mutual fund investment context. The results show that funds featured by recommender systems prompt significantly more purchases. This effect is especially salient among unsophisticated investors, who appear more likely to follow system-provided recommendations. Further analysis also reveals that these investors tend to suffer significantly worse investment performance after purchasing the recommended funds. Thus, recommender systems threaten to amplify wealth inequality among investors in financial markets.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#20998;&#26512;&#20102;&#21152;&#25343;&#22823;&#24378;&#21046;&#23454;&#26045;&#23478;&#24237;&#21307;&#23398;&#20303;&#38498;&#21307;&#24072;&#35268;&#23450;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#24310;&#38271;&#20303;&#38498;&#21307;&#24072;&#22521;&#35757;&#26102;&#38388;&#21487;&#33021;&#23548;&#33268;&#23478;&#24237;&#21307;&#23398;&#20174;&#19994;&#32773;&#20379;&#24212;&#19979;&#38477;5%-10%&#12290;</title><link>http://arxiv.org/abs/2303.14232</link><description>&lt;p&gt;
&#24310;&#38271;&#20303;&#38498;&#21307;&#24072;&#35268;&#23450;&#23545;&#23478;&#24237;&#21307;&#23398;&#20174;&#19994;&#32773;&#20379;&#24212;&#30340;&#24433;&#21709;&#65306;&#21152;&#25343;&#22823;&#24378;&#21046;&#23454;&#26045;&#23478;&#24237;&#21307;&#23398;&#20303;&#38498;&#21307;&#24072;&#35268;&#23450;&#24046;&#24322;&#24615;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Effects of extending residencies on the supply of family medicine practitioners; difference-in-differences evidence from the implementation of mandatory family medicine residencies in Canada. (arXiv:2303.14232v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14232
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20998;&#26512;&#20102;&#21152;&#25343;&#22823;&#24378;&#21046;&#23454;&#26045;&#23478;&#24237;&#21307;&#23398;&#20303;&#38498;&#21307;&#24072;&#35268;&#23450;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#24310;&#38271;&#20303;&#38498;&#21307;&#24072;&#22521;&#35757;&#26102;&#38388;&#21487;&#33021;&#23548;&#33268;&#23478;&#24237;&#21307;&#23398;&#20174;&#19994;&#32773;&#20379;&#24212;&#19979;&#38477;5%-10%&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32972;&#26223;&#65306;&#24403;&#21069;&#65292;&#21253;&#25324;&#32654;&#22269;&#21644;&#21152;&#25343;&#22823;&#22312;&#20869;&#30340;&#19968;&#20123;&#22269;&#23478;&#26377;&#20852;&#36259;&#24310;&#38271;&#21307;&#23398;&#20303;&#38498;&#21307;&#24072;&#22521;&#35757;&#26102;&#38388;&#12290;&#30446;&#21069;&#20851;&#20110;&#24310;&#38271;&#20303;&#38498;&#21307;&#24072;&#22521;&#35757;&#26102;&#38388;&#23545;&#21021;&#32423;&#21307;&#30103;&#20445;&#20581;&#20174;&#19994;&#32773;&#20379;&#24212;&#30340;&#24433;&#21709;&#36824;&#32570;&#20047;&#35777;&#25454;&#12290;&#26041;&#27861;&#65306;&#35813;&#30740;&#31350;&#21033;&#29992;&#21152;&#25343;&#22823;1976&#24180;&#33267;1994&#24180;&#24378;&#21046;&#23454;&#26045;&#30340;&#19968;&#39033;&#23478;&#24237;&#21307;&#23398;&#20303;&#38498;&#21307;&#24072;&#35268;&#23450;&#65292;&#23545;&#30465;&#20221;&#19982;&#30465;&#20221;&#20043;&#38388;&#30340;&#23454;&#26045;&#24773;&#20917;&#36827;&#34892;&#23545;&#27604;&#30740;&#31350;&#65292;&#23545;&#23478;&#24237;&#21307;&#23398;&#20174;&#19994;&#32773;&#19982;&#20854;&#20182;&#26080;&#21464;&#21270;&#30340;&#21307;&#30103;&#20154;&#21592;&#36827;&#34892;&#27604;&#36739;&#12290;&#21033;&#29992;&#24180;&#24230;&#21307;&#30103;&#20379;&#24212;&#25968;&#25454;&#36827;&#34892;&#24046;&#24322;&#24615;&#20272;&#35745;&#31574;&#30053;&#12290;&#32467;&#26524;&#65306;&#23454;&#26045;&#20303;&#38498;&#21307;&#24072;&#35268;&#23450;&#21518;&#65292;&#23478;&#24237;&#21307;&#23398;&#20174;&#19994;&#32773;&#30340;&#20379;&#24212;&#37327;&#20943;&#23569;&#20102;5%-10%&#12290;
&lt;/p&gt;
&lt;p&gt;
Background: There is currently interest in extending medical residency training in several countries including the United States and Canada. There is little evidence on what impacts extending medical residency has on supply of primary care practitioners.  Methods: I leverage the province-by-province roll-out of mandatory family medicine residencies in Canada from 1976 to 1994. This mandated that practitioners had to complete a two year residency instead of a one year internship. I use annual Canadian Institute of Health Information data on supply of physicians by specialty and province. I employ a difference-in-differences estimation strategy comparing specialties impacted by the legislation to those that had no change in their residency length (first difference). I compare before and after legislation by province (second difference).  Results: I find reductions in the supply of family medicine practitioners in the range of 5-10% of overall supply after implementation of a longer resid
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#22810;&#20010;&#24378;&#21270;&#23398;&#20064;&#26368;&#20248;&#25191;&#34892;&#20132;&#26131;&#26234;&#33021;&#20307;&#19982;&#21453;&#24212;&#24335;&#22522;&#20110;&#26234;&#33021;&#20307;&#30340;&#37329;&#34701;&#24066;&#22330;&#27169;&#22411;&#30340;&#20132;&#20114;&#12290;&#36890;&#36807;&#24179;&#34913;&#25191;&#34892;&#24046;&#20215;&#21644;&#26410;&#33021;&#21450;&#26102;&#25191;&#34892;&#35746;&#21333;&#30340;&#24809;&#32602;&#65292;&#35828;&#26126;&#20102;&#22870;&#21169;&#20989;&#25968;&#30340;&#20316;&#29992;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#23398;&#20064;&#26234;&#33021;&#20307;&#30340;&#25968;&#37327;&#12289;&#21021;&#22987;&#35746;&#21333;&#22823;&#23567;&#21644;&#29366;&#24577;&#31354;&#38388;&#30340;&#21464;&#21270;&#65292;&#20250;&#23545;&#26368;&#23567;&#26234;&#33021;&#24066;&#22330;&#27169;&#25311;&#36896;&#25104;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2303.07393</link><description>&lt;p&gt;
&#22810;&#20010;&#23398;&#20064;&#26234;&#33021;&#20307;&#19982;&#22522;&#20110;&#26234;&#33021;&#20307;&#30340;&#24066;&#22330;&#27169;&#22411;&#30340;&#20132;&#20114;
&lt;/p&gt;
&lt;p&gt;
Many learning agents interacting with an agent-based market model. (arXiv:2303.07393v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.07393
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#22810;&#20010;&#24378;&#21270;&#23398;&#20064;&#26368;&#20248;&#25191;&#34892;&#20132;&#26131;&#26234;&#33021;&#20307;&#19982;&#21453;&#24212;&#24335;&#22522;&#20110;&#26234;&#33021;&#20307;&#30340;&#37329;&#34701;&#24066;&#22330;&#27169;&#22411;&#30340;&#20132;&#20114;&#12290;&#36890;&#36807;&#24179;&#34913;&#25191;&#34892;&#24046;&#20215;&#21644;&#26410;&#33021;&#21450;&#26102;&#25191;&#34892;&#35746;&#21333;&#30340;&#24809;&#32602;&#65292;&#35828;&#26126;&#20102;&#22870;&#21169;&#20989;&#25968;&#30340;&#20316;&#29992;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#23398;&#20064;&#26234;&#33021;&#20307;&#30340;&#25968;&#37327;&#12289;&#21021;&#22987;&#35746;&#21333;&#22823;&#23567;&#21644;&#29366;&#24577;&#31354;&#38388;&#30340;&#21464;&#21270;&#65292;&#20250;&#23545;&#26368;&#23567;&#26234;&#33021;&#24066;&#22330;&#27169;&#25311;&#36896;&#25104;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#22810;&#20010;&#24378;&#21270;&#23398;&#20064;&#26368;&#20248;&#25191;&#34892;&#20132;&#26131;&#26234;&#33021;&#20307;&#19982;&#22312;&#20107;&#20214;&#26102;&#38388;&#19979;&#30340;&#21453;&#24212;&#24335;&#22522;&#20110;&#26234;&#33021;&#20307;&#30340;&#37329;&#34701;&#24066;&#22330;&#27169;&#22411;&#30340;&#21160;&#24577;&#21644;&#30456;&#20114;&#20316;&#29992;&#12290;&#27169;&#22411;&#20195;&#34920;&#20102;&#19968;&#20010;&#24066;&#22330;&#29983;&#24577;&#31995;&#32479;&#65292;&#30001;&#19977;&#20010;&#33829;&#20859;&#32423;&#21035;&#20195;&#34920;&#65306;&#26368;&#20248;&#25191;&#34892;&#23398;&#20064;&#26234;&#33021;&#20307;&#65292;&#26368;&#23567;&#26234;&#33021;&#30340;&#27969;&#21160;&#24615;&#38656;&#35201;&#32773;&#21644;&#24555;&#36895;&#30340;&#30005;&#23376;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#12290;&#26368;&#20248;&#25191;&#34892;&#20195;&#29702;&#31867;&#21035;&#21253;&#25324;&#20080;&#20837;&#21644;&#21334;&#20986;&#20195;&#29702;&#65292;&#21487;&#20197;&#20351;&#29992;&#38480;&#20215;&#21333;&#21644;&#24066;&#20215;&#21333;&#30340;&#32452;&#21512;&#65292;&#25110;&#32773;&#20165;&#20351;&#29992;&#24066;&#20215;&#21333;&#36827;&#34892;&#20132;&#26131;&#12290;&#22870;&#21169;&#20989;&#25968;&#26126;&#30830;&#24179;&#34913;&#20102;&#20132;&#26131;&#25191;&#34892;&#24046;&#20215;&#19982;&#26410;&#33021;&#21450;&#26102;&#25191;&#34892;&#35746;&#21333;&#30340;&#24809;&#32602;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#26412;&#25991;&#23637;&#31034;&#20102;&#22810;&#20010;&#31454;&#20105;&#23398;&#20064;&#26234;&#33021;&#20307;&#22914;&#20309;&#38543;&#30528;&#26234;&#33021;&#20307;&#25968;&#37327;&#12289;&#21021;&#22987;&#35746;&#21333;&#30340;&#22823;&#23567;&#21644;&#29992;&#20110;&#23398;&#20064;&#30340;&#29366;&#24577;&#31354;&#38388;&#30340;&#20989;&#25968;&#24433;&#21709;&#26368;&#23567;&#26234;&#33021;&#24066;&#22330;&#27169;&#25311;&#12290;&#25105;&#20204;&#20351;&#29992;&#30456;&#31354;&#38388;&#22270;&#26469;&#30740;&#31350;ABM&#30340;&#21160;&#24577;&#65292;&#24403;&#29305;&#23450;&#35268;&#33539;&#34987;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
We consider the dynamics and the interactions of multiple reinforcement learning optimal execution trading agents interacting with a reactive Agent-Based Model (ABM) of a financial market in event time. The model represents a market ecology with 3-trophic levels represented by: optimal execution learning agents, minimally intelligent liquidity takers, and fast electronic liquidity providers. The optimal execution agent classes include buying and selling agents that can either use a combination of limit orders and market orders, or only trade using market orders. The reward function explicitly balances trade execution slippage against the penalty of not executing the order timeously. This work demonstrates how multiple competing learning agents impact a minimally intelligent market simulation as functions of the number of agents, the size of agents' initial orders, and the state spaces used for learning. We use phase space plots to examine the dynamics of the ABM, when various specifica
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#22312;&#29790;&#20856;Covid-19&#30123;&#33495;&#25512;&#20986;&#20013;&#30340;&#21306;&#22495;&#21464;&#21270;&#65292;&#30740;&#31350;&#20102;&#23545;&#28608;&#21169;&#26377;&#24046;&#24322;&#30340;&#32676;&#20307;&#30340;&#25552;&#31034;&#25928;&#26524;&#65292;&#32467;&#26524;&#26174;&#31034;&#25552;&#31034;&#23545;&#20110;&#20010;&#20154;&#26080;&#24847;&#20041;&#30340;&#36873;&#25321;&#26356;&#26377;&#25928;&#12290;</title><link>http://arxiv.org/abs/2301.08797</link><description>&lt;p&gt;
&#40664;&#35748;&#25552;&#31034;&#20160;&#20040;&#26102;&#20505;&#26377;&#25928;?
&lt;/p&gt;
&lt;p&gt;
When do Default Nudges Work?. (arXiv:2301.08797v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.08797
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#22312;&#29790;&#20856;Covid-19&#30123;&#33495;&#25512;&#20986;&#20013;&#30340;&#21306;&#22495;&#21464;&#21270;&#65292;&#30740;&#31350;&#20102;&#23545;&#28608;&#21169;&#26377;&#24046;&#24322;&#30340;&#32676;&#20307;&#30340;&#25552;&#31034;&#25928;&#26524;&#65292;&#32467;&#26524;&#26174;&#31034;&#25552;&#31034;&#23545;&#20110;&#20010;&#20154;&#26080;&#24847;&#20041;&#30340;&#36873;&#25321;&#26356;&#26377;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25552;&#31034;&#26159;&#31185;&#23398;&#21644;&#25919;&#31574;&#19978;&#19968;&#20010;&#26032;&#20852;&#30340;&#35805;&#39064;&#65292;&#20294;&#19981;&#21516;&#28608;&#21169;&#32676;&#20307;&#20013;&#30340;&#25552;&#31034;&#25928;&#26524;&#30340;&#35777;&#25454;&#36824;&#19981;&#36275;&#12290;&#26412;&#25991;&#21033;&#29992;&#29790;&#20856;Covid-19&#30123;&#33495;&#25512;&#20986;&#36807;&#31243;&#20013;&#30340;&#21306;&#22495;&#21464;&#21270;&#65292;&#30740;&#31350;&#20102;&#23545;&#28608;&#21169;&#26377;&#24046;&#24322;&#30340;&#32676;&#20307;&#30340;&#25552;&#31034;&#25928;&#26524;&#65306;&#23545;&#20110;16-17&#23681;&#30340;&#23401;&#23376;&#65292;Covid-19&#19981;&#21361;&#38505;&#65292;&#32780;50-59&#23681;&#30340;&#20154;&#21017;&#38754;&#20020;&#30528;&#20005;&#37325;&#30142;&#30149;&#25110;&#27515;&#20129;&#30340;&#24040;&#22823;&#39118;&#38505;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#24180;&#36731;&#20154;&#30340;&#21453;&#24212;&#26174;&#33879;&#24378;&#28872;&#65292;&#36825;&#19982;&#25552;&#31034;&#23545;&#20110;&#20010;&#20154;&#26080;&#24847;&#20041;&#30340;&#36873;&#25321;&#26356;&#26377;&#25928;&#30340;&#29702;&#35770;&#30456;&#19968;&#33268;&#12290;
&lt;/p&gt;
&lt;p&gt;
Nudging is a burgeoning topic in science and in policy, but evidence on the effectiveness of nudges among differentially-incentivized groups is lacking. This paper exploits regional variations in the roll-out of the Covid-19 vaccine in Sweden to examine the effect of a nudge on groups whose intrinsic incentives are different: 16-17-year-olds, for whom Covid-19 is not dangerous, and 50-59-year-olds, who face a substantial risk of death or severe dis-ease. We find a significantly stronger response in the younger group, consistent with the theory that nudges are more effective for choices that are not meaningful to the individual.
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#27169;&#25311;&#19981;&#21516;&#29305;&#24449;&#30340;&#26723;&#26696;&#29031;&#29255;&#23545;&#20986;&#20511;&#20154;&#38656;&#27714;&#30340;&#24433;&#21709;&#65292;&#30740;&#31350;&#25552;&#20986;&#20102;&#23454;&#29616;&#32447;&#19978;&#24066;&#22330;&#20844;&#24179;&#21644;&#25928;&#29575;&#30340;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2209.01235</link><description>&lt;p&gt;
&#26723;&#26696;&#20013;&#30340;&#24494;&#31505;&#65306;&#21033;&#29992;&#29992;&#25143;&#23545;&#32447;&#19978;&#24066;&#22330;&#30340;&#20559;&#22909;&#20272;&#35745;&#25552;&#39640;&#20844;&#24179;&#24615;&#21644;&#25928;&#29575;&#24615;
&lt;/p&gt;
&lt;p&gt;
Smiles in Profiles: Improving Fairness and Efficiency Using Estimates of User Preferences in Online Marketplaces. (arXiv:2209.01235v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.01235
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#27169;&#25311;&#19981;&#21516;&#29305;&#24449;&#30340;&#26723;&#26696;&#29031;&#29255;&#23545;&#20986;&#20511;&#20154;&#38656;&#27714;&#30340;&#24433;&#21709;&#65292;&#30740;&#31350;&#25552;&#20986;&#20102;&#23454;&#29616;&#32447;&#19978;&#24066;&#22330;&#20844;&#24179;&#21644;&#25928;&#29575;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32447;&#24179;&#21488;&#32463;&#24120;&#38754;&#20020;&#20844;&#24179;&#65288;&#21363;&#38750;&#27495;&#35270;&#24615;&#65289;&#21644;&#25928;&#29575;&#65288;&#21363;&#26368;&#22823;&#21270;&#25910;&#30410;&#65289;&#20043;&#38388;&#30340;&#25361;&#25112;&#12290;&#20351;&#29992;&#35745;&#31639;&#26426;&#35270;&#35273;&#31639;&#27861;&#21644;&#24494;&#22411;&#20511;&#36151;&#24066;&#22330;&#30340;&#35266;&#23519;&#25968;&#25454;&#65292;&#25105;&#20204;&#21457;&#29616;&#65292;&#20511;&#27454;&#20154;&#22312;&#21019;&#24314;&#22312;&#32447;&#26723;&#26696;&#26102;&#25152;&#20570;&#30340;&#36873;&#25321;&#24433;&#21709;&#30528;&#36825;&#20004;&#20010;&#30446;&#26631;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#36890;&#36807;&#32593;&#32476;&#38543;&#26426;&#35843;&#26597;&#23454;&#39564;&#25903;&#25345;&#20102;&#36825;&#19968;&#32467;&#35770;&#12290;&#22312;&#23454;&#39564;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#21019;&#24314;&#20855;&#26377;&#19981;&#21516;&#29305;&#24449;&#30340;&#26723;&#26696;&#22270;&#29255;&#65292;&#24182;&#20272;&#35745;&#20854;&#23545;&#20986;&#20511;&#20154;&#38656;&#27714;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#28982;&#21518;&#21453;&#20107;&#23454;&#22320;&#35780;&#20272;&#26367;&#20195;&#24179;&#21488;&#25919;&#31574;&#65292;&#24182;&#30830;&#23450;&#29305;&#23450;&#26041;&#27861;&#26469;&#24433;&#21709;&#21487;&#25913;&#21464;&#30340;&#26723;&#26696;&#29031;&#29255;&#29305;&#24449;&#65292;&#20197;&#32531;&#35299;&#20844;&#24179;&#24615;&#19982;&#25928;&#29575;&#24615;&#20043;&#38388;&#30340;&#32039;&#24352;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
Online platforms often face challenges being both fair (i.e., non-discriminatory) and efficient (i.e., maximizing revenue). Using computer vision algorithms and observational data from a micro-lending marketplace, we find that choices made by borrowers creating online profiles impact both of these objectives. We further support this conclusion with a web-based randomized survey experiment. In the experiment, we create profile images using Generative Adversarial Networks that differ in a specific feature and estimate its impact on lender demand. We then counterfactually evaluate alternative platform policies and identify particular approaches to influencing the changeable profile photo features that can ameliorate the fairness-efficiency tension.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#27861;&#22269;&#38081;&#36335;&#36816;&#36755;&#20013;&#25910;&#30410;&#31649;&#29702;&#19982;&#32479;&#19968;&#23450;&#20215;&#25110;&#23436;&#20840;&#28789;&#27963;&#30340;&#31574;&#30053;&#30340;&#30408;&#21033;&#21644;&#25439;&#22833;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#21407;&#22987;&#30340;&#35782;&#21035;&#31574;&#30053;&#65292;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#23454;&#38469;&#25910;&#30410;&#31649;&#29702;&#34920;&#29616;&#30456;&#20284;&#25110;&#26356;&#22909;&#65292;&#20294;&#20063;&#23384;&#22312;&#39640;&#36798;16.7%&#30340;&#23454;&#36136;&#25439;&#22833;&#65292;&#24182;&#24378;&#35843;&#20102;&#25910;&#30410;&#31649;&#29702;&#22312;&#38656;&#27714;&#19981;&#30830;&#23450;&#26102;&#33719;&#21462;&#20449;&#24687;&#30340;&#20851;&#38190;&#20316;&#29992;&#12290;</title><link>http://arxiv.org/abs/2206.04424</link><description>&lt;p&gt;
&#39044;&#20272;&#25910;&#30410;&#31649;&#29702;&#30340;&#30408;&#21033;&#21644;&#25439;&#22833;
&lt;/p&gt;
&lt;p&gt;
Estimating the Gains (and Losses) of Revenue Management. (arXiv:2206.04424v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.04424
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#27861;&#22269;&#38081;&#36335;&#36816;&#36755;&#20013;&#25910;&#30410;&#31649;&#29702;&#19982;&#32479;&#19968;&#23450;&#20215;&#25110;&#23436;&#20840;&#28789;&#27963;&#30340;&#31574;&#30053;&#30340;&#30408;&#21033;&#21644;&#25439;&#22833;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#21407;&#22987;&#30340;&#35782;&#21035;&#31574;&#30053;&#65292;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#23454;&#38469;&#25910;&#30410;&#31649;&#29702;&#34920;&#29616;&#30456;&#20284;&#25110;&#26356;&#22909;&#65292;&#20294;&#20063;&#23384;&#22312;&#39640;&#36798;16.7%&#30340;&#23454;&#36136;&#25439;&#22833;&#65292;&#24182;&#24378;&#35843;&#20102;&#25910;&#30410;&#31649;&#29702;&#22312;&#38656;&#27714;&#19981;&#30830;&#23450;&#26102;&#33719;&#21462;&#20449;&#24687;&#30340;&#20851;&#38190;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#25910;&#30410;&#31649;&#29702;&#22312;&#33322;&#31354;&#12289;&#38081;&#36335;&#21644;&#37202;&#24215;&#31561;&#35768;&#22810;&#34892;&#19994;&#24471;&#21040;&#20102;&#24191;&#27867;&#24212;&#29992;&#65292;&#20294;&#19982;&#32479;&#19968;&#23450;&#20215;&#25110;&#23436;&#20840;&#28789;&#27963;&#30340;&#31574;&#30053;&#30456;&#27604;&#65292;&#20854;&#25910;&#30410;&#25110;&#25439;&#22833;&#23578;&#32570;&#20047;&#23454;&#35777;&#35777;&#25454;&#12290;&#25105;&#20204;&#22312;&#27861;&#22269;&#38081;&#36335;&#36816;&#36755;&#30340;&#32972;&#26223;&#19979;&#37327;&#21270;&#20102;&#36825;&#31181;&#30408;&#21033;&#21644;&#25439;&#22833;&#65292;&#24182;&#30830;&#23450;&#20102;&#20854;&#28508;&#22312;&#26469;&#28304;&#12290;&#38656;&#27714;&#30340;&#35782;&#21035;&#30001;&#20110;&#23457;&#26597;&#21644;&#22806;&#29983;&#20215;&#26684;&#21464;&#21270;&#30340;&#32570;&#22833;&#32780;&#21464;&#24471;&#22797;&#26434;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#21407;&#22987;&#30340;&#35782;&#21035;&#31574;&#30053;&#65292;&#32467;&#21512;&#20102;&#30456;&#23545;&#20215;&#26684;&#30340;&#26102;&#38388;&#21464;&#21270;&#12289;&#28040;&#36153;&#32773;&#30340;&#29702;&#24615;&#21644;&#20844;&#21496;&#23450;&#20215;&#31574;&#30053;&#30340;&#24369;&#26368;&#20248;&#24615;&#26465;&#20214;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#23454;&#38469;&#25910;&#30410;&#31649;&#29702;&#30340;&#34920;&#29616;&#19982;&#26368;&#20248;&#32479;&#19968;&#23450;&#20215;&#30456;&#20284;&#25110;&#26356;&#22909;&#65292;&#20294;&#19982;&#26368;&#20248;&#23450;&#20215;&#31574;&#30053;&#30456;&#27604;&#65292;&#20063;&#23384;&#22312;&#39640;&#36798;16.7%&#30340;&#23454;&#36136;&#25439;&#22833;&#12290;&#25105;&#20204;&#36824;&#24378;&#35843;&#20102;&#25910;&#30410;&#31649;&#29702;&#22312;&#38656;&#27714;&#19981;&#30830;&#23450;&#26102;&#33719;&#21462;&#20449;&#24687;&#30340;&#20851;&#38190;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Despite the wide adoption of revenue management in many industries such as airline, railway, and hospitality, there is still scarce empirical evidence on the gains or losses of such strategies compared to uniform pricing or fully flexible strategies. We quantify such gains and losses and identify their underlying sources in the context of French railway transportation. The identification of demand is complicated by censoring and the absence of exogenous price variations. We develop an original identification strategy combining temporal variations in relative prices, consumers' rationality and weak optimality conditions on the firm's pricing strategy. Our results suggest similar or better performance of the actual revenue management compared to optimal uniform pricing, but also substantial losses of up to 16.7% compared to the optimal pricing strategy. We also highlight the key role of revenue management in acquiring information when demand is uncertain.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#30740;&#31350;&#20379;&#24212;&#38142;&#19978;&#30340;&#20135;&#19994;&#22320;&#20301;&#21644;&#23384;&#36135;&#23545;&#38656;&#27714;&#20914;&#20987;&#20256;&#23548;&#25928;&#24212;&#30340;&#20316;&#29992;&#65292;&#21457;&#29616;&#20914;&#20987;&#22312;&#19978;&#28216;&#20135;&#19994;&#20013;&#26377;&#25918;&#22823;&#25928;&#24212;&#65292;&#24182;&#25214;&#21040;&#20102;&#23384;&#36135;&#22312;&#35299;&#37322;&#20135;&#20986;&#24377;&#24615;&#19978;&#30340;&#37325;&#35201;&#20316;&#29992;&#12290;</title><link>http://arxiv.org/abs/2205.03862</link><description>&lt;p&gt;
&#23384;&#36135;&#12289;&#38656;&#27714;&#20914;&#20987;&#20256;&#23548;&#21644;&#20379;&#24212;&#38142;&#20013;&#30340;&#25918;&#22823;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Inventories, Demand Shocks Propagation and Amplification in Supply Chains. (arXiv:2205.03862v4 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.03862
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#30740;&#31350;&#20379;&#24212;&#38142;&#19978;&#30340;&#20135;&#19994;&#22320;&#20301;&#21644;&#23384;&#36135;&#23545;&#38656;&#27714;&#20914;&#20987;&#20256;&#23548;&#25928;&#24212;&#30340;&#20316;&#29992;&#65292;&#21457;&#29616;&#20914;&#20987;&#22312;&#19978;&#28216;&#20135;&#19994;&#20013;&#26377;&#25918;&#22823;&#25928;&#24212;&#65292;&#24182;&#25214;&#21040;&#20102;&#23384;&#36135;&#22312;&#35299;&#37322;&#20135;&#20986;&#24377;&#24615;&#19978;&#30340;&#37325;&#35201;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20135;&#19994;&#22312;&#20379;&#24212;&#38142;&#20013;&#30340;&#22320;&#20301;&#23545;&#20915;&#23450;&#26368;&#32456;&#38656;&#27714;&#20914;&#20987;&#20256;&#23548;&#25928;&#24212;&#30340;&#20316;&#29992;&#12290;&#36890;&#36807;&#22522;&#20110;&#30446;&#26631;&#29305;&#23450;&#30340;&#26368;&#32456;&#38656;&#27714;&#20914;&#20987;&#21644;&#30446;&#26631;&#20221;&#39069;&#30340;&#21464;&#21270;&#26469;&#35774;&#35745;&#36716;&#31227;&#20221;&#39069;&#65292;&#26412;&#25991;&#21457;&#29616;&#20914;&#20987;&#22312;&#19978;&#28216;&#25918;&#22823;&#12290;&#23450;&#37327;&#19978;&#65292;&#19978;&#28216;&#34892;&#19994;&#23545;&#26368;&#32456;&#38656;&#27714;&#20914;&#20987;&#30340;&#21453;&#24212;&#26159;&#32456;&#31471;&#21830;&#21697;&#29983;&#20135;&#32773;&#30340;&#19977;&#20493;&#12290;&#20026;&#20102;&#32452;&#32455;&#31616;&#21270;&#24418;&#24335;&#30340;&#32467;&#26524;&#65292;&#25105;&#24320;&#21457;&#20102;&#19968;&#20010;&#21253;&#25324;&#23384;&#36135;&#30340;&#21487;&#25805;&#20316;&#29983;&#20135;&#32593;&#32476;&#27169;&#22411;&#65292;&#24182;&#30740;&#31350;&#20102;&#32593;&#32476;&#23646;&#24615;&#21644;&#23384;&#36135;&#30340;&#21608;&#26399;&#24615;&#22914;&#20309;&#30456;&#20114;&#20316;&#29992;&#26469;&#20915;&#23450;&#26368;&#32456;&#38656;&#27714;&#20914;&#20987;&#26159;&#25918;&#22823;&#36824;&#26159;&#32791;&#25955;&#12290;&#25105;&#36890;&#36807;&#30452;&#25509;&#20272;&#35745;&#27169;&#22411;&#39044;&#27979;&#30340;&#20135;&#20986;&#22686;&#38271;&#21644;&#38656;&#27714;&#20914;&#20987;&#20043;&#38388;&#30340;&#20851;&#31995;&#26469;&#39564;&#35777;&#35813;&#26426;&#21046;&#65292;&#20013;&#20171;&#32593;&#32476;&#20301;&#32622;&#21644;&#23384;&#36135;&#12290;&#25105;&#21457;&#29616;&#23384;&#36135;&#22312;&#35299;&#37322;&#24322;&#36136;&#24615;&#20135;&#20986;&#24377;&#24615;&#26041;&#38754;&#25198;&#28436;&#20102;&#37325;&#35201;&#35282;&#33394;&#12290;&#26368;&#21518;&#65292;&#25105;&#20351;&#29992;&#27169;&#22411;&#23450;&#37327;&#30740;&#31350;&#20102;&#23384;&#36135;&#21644;&#32593;&#32476;&#23646;&#24615;&#22914;&#20309;&#22609;&#36896;&#29983;&#20135;&#36807;&#31243;&#20013;&#30340;&#27874;&#21160;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
I study the role of industries' position in supply chains in shaping the transmission of final demand shocks. First, I use a shift-share design based on destination-specific final demand shocks and destination shares to show that shocks amplify upstream. Quantitatively, upstream industries respond to final demand shocks up to three times as much as final goods producers. To organize the reduced form results, I develop a tractable production network model with inventories and study how the properties of the network and the cyclicality of inventories interact to determine whether final demand shocks amplify or dissipate upstream. I test the mechanism by directly estimating the model-implied relationship between output growth and demand shocks, mediated by network position and inventories. I find evidence of the role of inventories in explaining heterogeneous output elasticities. Finally, I use the model to quantitatively study how inventories and network properties shape the volatility o
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;Tail-GAN&#26469;&#23398;&#20064;&#27169;&#25311;&#23614;&#37096;&#39118;&#38505;&#24773;&#26223;&#12290;&#35813;&#26041;&#27861;&#21033;&#29992;&#20102;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#21644;&#39118;&#38505;&#20215;&#20540;&#21450;&#39044;&#26399;&#25910;&#30410;&#29575;&#30340;&#32852;&#21512;&#35825;&#23548;&#23646;&#24615;&#65292;&#22312;&#20445;&#30041;&#32479;&#35745;&#25968;&#25454;&#30340;&#22522;&#30784;&#19978;&#27169;&#25311;&#20215;&#26684;&#24773;&#26223;&#12290;&#36890;&#36807;&#22823;&#37327;&#23454;&#39564;&#35777;&#26126;&#65292;&#35813;&#26041;&#27861;&#34920;&#29616;&#20986;&#26356;&#20934;&#30830;&#12289;&#26356;&#24555;&#36895;&#21644;&#26356;&#31283;&#20581;&#30340;&#29305;&#28857;&#12290;</title><link>http://arxiv.org/abs/2203.01664</link><description>&lt;p&gt;
Tail-GAN&#65306;&#23398;&#20064;&#27169;&#25311;&#23614;&#37096;&#39118;&#38505;&#24773;&#26223;
&lt;/p&gt;
&lt;p&gt;
Tail-GAN: Learning to Simulate Tail Risk Scenarios. (arXiv:2203.01664v2 [q-fin.RM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.01664
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;Tail-GAN&#26469;&#23398;&#20064;&#27169;&#25311;&#23614;&#37096;&#39118;&#38505;&#24773;&#26223;&#12290;&#35813;&#26041;&#27861;&#21033;&#29992;&#20102;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#21644;&#39118;&#38505;&#20215;&#20540;&#21450;&#39044;&#26399;&#25910;&#30410;&#29575;&#30340;&#32852;&#21512;&#35825;&#23548;&#23646;&#24615;&#65292;&#22312;&#20445;&#30041;&#32479;&#35745;&#25968;&#25454;&#30340;&#22522;&#30784;&#19978;&#27169;&#25311;&#20215;&#26684;&#24773;&#26223;&#12290;&#36890;&#36807;&#22823;&#37327;&#23454;&#39564;&#35777;&#26126;&#65292;&#35813;&#26041;&#27861;&#34920;&#29616;&#20986;&#26356;&#20934;&#30830;&#12289;&#26356;&#24555;&#36895;&#21644;&#26356;&#31283;&#20581;&#30340;&#29305;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21160;&#24577;&#25237;&#36164;&#32452;&#21512;&#30340;&#25439;&#22833;&#20998;&#24067;&#20272;&#35745;&#38656;&#35201;&#27169;&#25311;&#20195;&#34920;&#20854;&#32452;&#25104;&#37096;&#20998;&#30340;&#32852;&#21512;&#21160;&#24577;&#30340;&#24773;&#26223;&#65292;&#29305;&#21035;&#37325;&#35201;&#30340;&#26159;&#27169;&#25311;&#23614;&#37096;&#39118;&#38505;&#24773;&#26223;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#65292;&#21033;&#29992;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65288;GAN&#65289;&#32467;&#26500;&#24182;&#21033;&#29992;&#39118;&#38505;&#20215;&#20540;&#65288;VaR&#65289;&#21644;&#39044;&#26399;&#25910;&#30410;&#29575;&#65288;ES&#65289;&#30340;&#32852;&#21512;&#35825;&#23548;&#23646;&#24615;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#33021;&#22815;&#23398;&#20064;&#27169;&#25311;&#20855;&#26377;&#20445;&#30041;&#22522;&#20934;&#20132;&#26131;&#31574;&#30053;&#30340;&#23614;&#37096;&#39118;&#38505;&#29305;&#24449;&#30340;&#20215;&#26684;&#24773;&#26223;&#65292;&#21253;&#25324;&#19968;&#33268;&#30340;&#32479;&#35745;&#25968;&#25454;&#65292;&#22914; VaR &#21644; ES&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#24191;&#27867;&#30340;&#39118;&#38505;&#24230;&#37327;&#31867;&#21035;&#19979;&#65292;&#25105;&#20204;&#30340;&#29983;&#25104;&#22120;&#20855;&#26377;&#26222;&#36866;&#36924;&#36817;&#23450;&#29702;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#35777;&#26126;&#29983;&#25104;&#22120;&#21644;&#37492;&#21035;&#22120;&#20043;&#38388;&#30340;&#21452;&#23618;&#20248;&#21270;&#20844;&#24335;&#31561;&#20215;&#20110;&#19968;&#20010;&#26497;&#22823;&#26497;&#23567;&#21338;&#24328;&#65292;&#20174;&#32780;&#23548;&#33268;&#26356;&#26377;&#25928;&#21644;&#23454;&#29992;&#30340;&#20844;&#24335;&#26469;&#35757;&#32451;&#12290;&#25105;&#20204;&#30340;&#25968;&#20540;&#23454;&#39564;&#34920;&#26126;&#65292;&#19982;&#20256;&#32479;&#26041;&#27861;&#30456;&#27604;&#65292;Tail-Gan&#26377;&#26356;&#20934;&#30830;&#12289;&#26356;&#24555;&#36895;&#21644;&#26356;&#31283;&#20581;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
The estimation of loss distributions for dynamic portfolios requires the simulation of scenarios representing realistic joint dynamics of their components, with particular importance devoted to the simulation of tail risk scenarios. We propose a novel data-driven approach that utilizes Generative Adversarial Network (GAN) architecture and exploits the joint elicitability property of Value-at-Risk (VaR) and Expected Shortfall (ES). Our proposed approach is capable of learning to simulate price scenarios that preserve tail risk features for benchmark trading strategies, including consistent statistics such as VaR and ES.  In this paper, we prove a universal approximation theorem for our generator under a broad class of risk measures. In addition, we prove that the bi-level optimization formulation between the generator and the discriminator is equivalent to a max-min game, leading to a more effective and practical formulation for training. Our numerical experiments show that, in contrast
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#24314;&#27169;&#26694;&#26550;&#65292;&#23558;&#30740;&#31350;&#32463;&#27982;&#22810;&#26679;&#21270;&#21644;&#22797;&#26434;&#24615;&#30340;&#20004;&#20010;&#39046;&#22495;&#32479;&#19968;&#36215;&#26469;&#65292;&#20174;&#32780;&#20351;&#25105;&#20204;&#21487;&#20197;&#26356;&#22909;&#22320;&#29702;&#35299;&#32463;&#27982;&#30340;&#38271;&#26399;&#32467;&#26500;&#24615;&#21464;&#21270;&#12290;</title><link>http://arxiv.org/abs/2110.09673</link><description>&lt;p&gt;
&#26725;&#25509;&#32463;&#27982;&#32467;&#26500;&#21464;&#21270;&#30340;&#30701;&#26399;&#21644;&#38271;&#26399;&#21160;&#24577;
&lt;/p&gt;
&lt;p&gt;
Bridging the short-term and long-term dynamics of economic structural change. (arXiv:2110.09673v2 [physics.soc-ph] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2110.09673
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#24314;&#27169;&#26694;&#26550;&#65292;&#23558;&#30740;&#31350;&#32463;&#27982;&#22810;&#26679;&#21270;&#21644;&#22797;&#26434;&#24615;&#30340;&#20004;&#20010;&#39046;&#22495;&#32479;&#19968;&#36215;&#26469;&#65292;&#20174;&#32780;&#20351;&#25105;&#20204;&#21487;&#20197;&#26356;&#22909;&#22320;&#29702;&#35299;&#32463;&#27982;&#30340;&#38271;&#26399;&#32467;&#26500;&#24615;&#21464;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32463;&#27982;&#36716;&#22411;&#8212;&#8212;&#21363;&#32463;&#27982;&#25152;&#29983;&#20135;&#19996;&#35199;&#30340;&#21464;&#21270;&#8212;&#8212;&#23545;&#20110;&#21457;&#23637;&#21644;&#25552;&#39640;&#29983;&#27963;&#27700;&#24179;&#33267;&#20851;&#37325;&#35201;&#12290;&#26368;&#36817;&#32463;&#27982;&#22797;&#26434;&#24615;&#39046;&#22495;&#30340;&#20004;&#20010;&#30740;&#31350;&#26041;&#21521;&#25512;&#21160;&#20102;&#25105;&#20204;&#23545;&#36825;&#19968;&#36807;&#31243;&#30340;&#29702;&#35299;&#65292;&#19968;&#20010;&#30740;&#31350;&#32463;&#27982;&#22914;&#20309;&#22810;&#26679;&#21270;&#65292;&#21478;&#19968;&#20010;&#30740;&#31350;&#32463;&#27982;&#30340;&#22797;&#26434;&#24615;&#22914;&#20309;&#22312;&#20854;&#20135;&#20986;&#30340;&#32452;&#25104;&#20013;&#20307;&#29616;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#23398;&#31185;&#20043;&#38388;&#30340;&#32852;&#31995;&#23578;&#19981;&#28165;&#26970;&#65292;&#20197;&#21450;&#23427;&#20204;&#22914;&#20309;&#19982;&#32467;&#26500;&#36716;&#22411;&#30340;&#32463;&#20856;&#29702;&#35299;&#30456;&#20851;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#21160;&#24577;&#24314;&#27169;&#26694;&#26550;&#65292;&#23558;&#36825;&#20123;&#24037;&#20316;&#39046;&#22495;&#32479;&#19968;&#36215;&#26469;&#65292;&#22522;&#20110;&#26222;&#36941;&#35266;&#23519;&#21040;&#30340;&#32463;&#27982;&#22810;&#26679;&#21270;&#20542;&#21521;&#20110;&#19982;&#23427;&#20204;&#24050;&#32463;&#25317;&#26377;&#30340;&#27963;&#21160;&#30456;&#20851;&#32852;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#20174;&#36825;&#19968;&#35266;&#23519;&#20013;&#33258;&#28982;&#22320;&#20135;&#29983;&#38271;&#26399;&#32467;&#26500;&#24615;&#21464;&#21270;&#30340;&#26679;&#24335;&#20107;&#23454;&#65292;&#20197;&#21450;&#22797;&#26434;&#24230;&#24230;&#37327;&#12290;&#28982;&#32780;&#65292;&#22797;&#26434;&#24230;&#24230;&#37327;&#20855;&#26377;&#26032;&#30340;&#21547;&#20041;&#65292;&#21487;&#20197;&#25551;&#36848;&#32463;&#27982;&#20307;&#39564;&#21040;&#30340;&#38271;&#26399;&#21464;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
Economic transformation -- change in what an economy produces -- is foundational to development and rising standards of living. Our understanding of this process has been propelled recently by two branches of work in the field of economic complexity, one studying how economies diversify, the other how the complexity of an economy is expressed in the makeup of its output. However, the connection between these branches is not well understood, nor how they relate to a classic understanding of structural transformation. Here, we present a simple dynamical modeling framework that unifies these areas of work, based on the widespread observation that economies diversify preferentially into activities that are related to ones they do already. We show how stylized facts of long-run structural change, as well as complexity metrics, can both emerge naturally from this one observation. However, complexity metrics take on new meanings, as descriptions of the long-term changes an economy experiences
&lt;/p&gt;</description></item><item><title>&#21360;&#24230;&#19968;&#39033;&#25919;&#31574;&#25514;&#26045;&#25480;&#20104;&#26410;&#23130;&#22919;&#22899;&#32487;&#25215;&#26435;&#65292;&#25913;&#21892;&#20102;&#20799;&#31461;&#36523;&#39640;&#21644;&#20307;&#37325;&#65292;&#21516;&#26102;&#25552;&#39640;&#20102;&#27597;&#20146;&#22312;&#23478;&#24237;&#20869;&#30340;&#35848;&#21028;&#33021;&#21147;&#65292;&#20174;&#32780;&#20135;&#29983;&#20102;&#26356;&#22909;&#30340;&#29238;&#27597;&#29031;&#39038;&#21644;&#25913;&#21892;&#30340;&#20799;&#31461;&#20581;&#24247;&#29366;&#20917;&#30340;&#25928;&#30410;&#12290;&#36825;&#34920;&#26126;&#65292;&#36171;&#20104;&#22919;&#22899;&#26435;&#21033;&#30340;&#25919;&#31574;&#21487;&#20197;&#23545;&#20799;&#31461;&#30340;&#20154;&#21147;&#36164;&#26412;&#20135;&#29983;&#39069;&#22806;&#31215;&#26497;&#25928;&#24212;&#12290;</title><link>http://arxiv.org/abs/2106.10841</link><description>&lt;p&gt;
&#25317;&#26377;&#36130;&#20135;&#26435;&#65306;&#25171;&#30772;&#24615;&#21035;&#22721;&#22418;&#25913;&#21892;&#21360;&#24230;&#20799;&#31461;&#20581;&#24247;&#29366;&#20917;
&lt;/p&gt;
&lt;p&gt;
Entitled to Property: How Breaking the Gender Barrier Improves Child Health in India. (arXiv:2106.10841v9 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2106.10841
&lt;/p&gt;
&lt;p&gt;
&#21360;&#24230;&#19968;&#39033;&#25919;&#31574;&#25514;&#26045;&#25480;&#20104;&#26410;&#23130;&#22919;&#22899;&#32487;&#25215;&#26435;&#65292;&#25913;&#21892;&#20102;&#20799;&#31461;&#36523;&#39640;&#21644;&#20307;&#37325;&#65292;&#21516;&#26102;&#25552;&#39640;&#20102;&#27597;&#20146;&#22312;&#23478;&#24237;&#20869;&#30340;&#35848;&#21028;&#33021;&#21147;&#65292;&#20174;&#32780;&#20135;&#29983;&#20102;&#26356;&#22909;&#30340;&#29238;&#27597;&#29031;&#39038;&#21644;&#25913;&#21892;&#30340;&#20799;&#31461;&#20581;&#24247;&#29366;&#20917;&#30340;&#25928;&#30410;&#12290;&#36825;&#34920;&#26126;&#65292;&#36171;&#20104;&#22919;&#22899;&#26435;&#21033;&#30340;&#25919;&#31574;&#21487;&#20197;&#23545;&#20799;&#31461;&#30340;&#20154;&#21147;&#36164;&#26412;&#20135;&#29983;&#39069;&#22806;&#31215;&#26497;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38750;&#21333;&#20803;&#23478;&#24237;&#27169;&#22411;&#35748;&#20026;&#65292;&#22686;&#21152;&#22919;&#22899;&#30340;&#35848;&#21028;&#33021;&#21147;&#21487;&#20197;&#24433;&#21709;&#20799;&#31461;&#30340;&#20581;&#24247;&#29366;&#20917;&#65292;&#36825;&#26159;&#24433;&#21709;&#25104;&#24180;&#21518;&#20154;&#21147;&#36164;&#26412;&#21644;&#32463;&#27982;&#22320;&#20301;&#30340;&#37325;&#35201;&#39044;&#27979;&#22240;&#32032;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#25919;&#31574;&#21464;&#21270;&#65306;&#21360;&#24230;&#12298;&#21360;&#24230;&#25945;&#32487;&#25215;&#27861;&#12299;&#20462;&#27491;&#26696;&#65288;Hindu Succession Act Amendment&#65292;HSAA&#65289;&#65292;&#35813;&#20462;&#27491;&#26696;&#20026;&#26410;&#23130;&#22919;&#22899;&#25552;&#20379;&#20102;&#32487;&#25215;&#26435;&#65292;&#23545;&#20799;&#31461;&#20581;&#24247;&#29366;&#20917;&#20135;&#29983;&#24433;&#21709;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;HSAA&#25913;&#21892;&#20102;&#20799;&#31461;&#30340;&#36523;&#39640;&#21644;&#20307;&#37325;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#21457;&#29616;&#65292;&#35813;&#25919;&#31574;&#25913;&#21892;&#20102;&#22919;&#22899;&#22312;&#23478;&#24237;&#20869;&#30340;&#35848;&#21028;&#33021;&#21147;&#65292;&#36890;&#36807;&#26356;&#22909;&#30340;&#29238;&#27597;&#29031;&#26009;&#21644;&#25913;&#21892;&#30340;&#20799;&#31461;&#20581;&#24247;&#29366;&#20917;&#20135;&#29983;&#20102;&#19979;&#28216;&#25928;&#30410;&#12290;&#30740;&#31350;&#32467;&#26524;&#35777;&#23454;&#65292;&#24403;&#27597;&#20146;&#25511;&#21046;&#26356;&#22823;&#27604;&#20363;&#30340;&#23478;&#24237;&#36164;&#28304;&#26102;&#65292;&#20799;&#31461;&#30340;&#24773;&#20917;&#26356;&#22909;&#12290;&#22240;&#27492;&#65292;&#36171;&#20104;&#22919;&#22899;&#26435;&#21147;&#30340;&#25919;&#31574;&#21487;&#20197;&#23545;&#20799;&#31461;&#30340;&#20154;&#21147;&#36164;&#26412;&#20135;&#29983;&#39069;&#22806;&#31215;&#26497;&#28322;&#20986;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
Non-unitary household models posit that increasing women's bargaining power can affect child health, a significant predictor of human capital and economic status throughout adulthood. We study how a policy change, the Hindu Succession Act Amendment (HSAA), which provided inheritance rights to unmarried women in India, impacts child health. We find evidence that the HSAA improved the height and weight of children. In addition, we find evidence consistent with a channel that the policy improved women's intra-household bargaining power, leading to downstream benefits through better parental care for children and improved child health. The findings confirm that children do better when their mothers control a more significant fraction of the family resources. Thus, policies that empower women can have additional positive spillovers for children's human capital.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20351;&#29992;&#30697;&#38453;&#23436;&#25972;&#24615;&#26041;&#27861;&#39044;&#27979;&#20102;&#22312;&#27809;&#26377;&#22303;&#22320;&#25919;&#31574;&#30340;&#24773;&#20917;&#19979;&#21069;&#27839;&#24030;&#35268;&#27169;&#30340;&#21453;&#20107;&#23454;&#26102;&#38388;&#24207;&#21015;&#65292;&#21457;&#29616;&#22303;&#22320;&#25919;&#31574;&#23545;&#24030;&#25919;&#24220;&#25903;&#20986;&#21644;&#25910;&#20837;&#20135;&#29983;&#20102;&#26174;&#33879;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/1903.08028</link><description>&lt;p&gt;
&#20844;&#20849;&#22303;&#22320;&#22788;&#32622;&#23545;&#22269;&#23478;&#24314;&#35774;&#30340;&#24433;&#21709;&#65311;&#19968;&#31181;&#30697;&#38453;&#23436;&#25972;&#24615;&#24212;&#29992;&#20110;&#21453;&#20107;&#23454;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
State-Building through Public Land Disposal? An Application of Matrix Completion for Counterfactual Prediction. (arXiv:1903.08028v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1903.08028
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#30697;&#38453;&#23436;&#25972;&#24615;&#26041;&#27861;&#39044;&#27979;&#20102;&#22312;&#27809;&#26377;&#22303;&#22320;&#25919;&#31574;&#30340;&#24773;&#20917;&#19979;&#21069;&#27839;&#24030;&#35268;&#27169;&#30340;&#21453;&#20107;&#23454;&#26102;&#38388;&#24207;&#21015;&#65292;&#21457;&#29616;&#22303;&#22320;&#25919;&#31574;&#23545;&#24030;&#25919;&#24220;&#25903;&#20986;&#21644;&#25910;&#20837;&#20135;&#29983;&#20102;&#26174;&#33879;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#27809;&#26377;&#22303;&#22320;&#25919;&#31574;&#30340;&#24773;&#20917;&#19979;&#65292;&#32654;&#22269;&#21069;&#27839;&#24030;&#20250;&#22914;&#20309;&#21457;&#23637;&#65311;&#26412;&#25991;&#25506;&#35752;&#20102;&#22303;&#22320;&#25919;&#31574;&#22312;&#24320;&#25299;&#25968;&#30334;&#19975;&#33521;&#20137;&#21069;&#27839;&#22303;&#22320;&#23450;&#23621;&#26041;&#38754;&#23545;&#24030;&#25919;&#24220;&#35268;&#27169;&#30340;&#24433;&#21709;&#12290;&#20351;&#29992;&#30697;&#38453;&#23436;&#25972;&#24615;&#26041;&#27861;&#65292;&#20316;&#32773;&#39044;&#27979;&#20102;&#27809;&#26377;&#22303;&#22320;&#25919;&#31574;&#30340;&#24773;&#20917;&#19979;&#21069;&#27839;&#24030;&#35268;&#27169;&#30340;&#21453;&#20107;&#23454;&#26102;&#38388;&#24207;&#21015;&#12290;&#20316;&#32773;&#25193;&#23637;&#20102;&#26041;&#27861;&#65292;&#20801;&#35768;&#37319;&#29992;&#20542;&#21521;&#21152;&#26435;&#30340;&#25439;&#22833;&#20989;&#25968;&#26469;&#25511;&#21046;&#36873;&#25321;&#20559;&#24046;&#12290;&#22240;&#26524;&#20272;&#35745;&#24847;&#21619;&#30528;&#22303;&#22320;&#25919;&#31574;&#23545;&#24030;&#25919;&#24220;&#25903;&#20986;&#21644;&#25910;&#20837;&#20135;&#29983;&#20102;&#26174;&#33879;&#19988;&#25345;&#20037;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;&#20272;&#35745;&#32467;&#26524;&#19982;&#36830;&#32493;&#24046;&#24322;&#20272;&#35745;&#22120;&#30340;&#32467;&#26524;&#26041;&#21521;&#30456;&#21516;&#65292;&#21518;&#32773;&#21033;&#29992;&#20102;&#26469;&#33258;146&#19975;&#20010;&#20010;&#20307;&#22303;&#22320;&#19987;&#21033;&#35760;&#24405;&#30340;&#26102;&#38388;&#21644;&#24378;&#24230;&#30340;&#21464;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;
How would states on the American frontier have developed in the absence of homestead policies? This paper explores the role of homestead policies, which opened for settlement hundreds of millions of acres of frontier land, in shaping the size of state governments. Using a matrix completion method, I predict the counterfactual time-series of frontier state size had there been no homesteading. I extend the method to allow for propensity-weighting of the loss function to control for selection bias. Causal estimates signify that homestead policies had significant and long-lasting negative impacts on state government expenditure and revenue. The estimates are in the same direction as those of a continuous difference-in-differences estimator that exploit variation in the timing and intensity of homestead entries, aggregated from 1.46 million individual land patent records.
&lt;/p&gt;</description></item></channel></rss>