<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#33021;&#28304;&#26399;&#36135;&#30340;&#20840;&#26399;&#38480;&#32467;&#26500;&#30340;&#26377;&#38480;&#32500;&#27169;&#22411;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#30456;&#23481;&#24615;&#27010;&#24565;&#65292;&#35201;&#27714;&#25152;&#36873;&#25321;&#30340;&#21487;&#33021;&#25910;&#30410;&#29575;&#26354;&#32447;&#38598;&#19982;&#25152;&#33719;&#24471;&#30340;&#25193;&#25955;&#31995;&#25968;&#26159;&#30456;&#23481;&#30340;&#65292;&#20174;&#32780;&#25512;&#23548;&#20986;&#19968;&#32452;&#21487;&#33021;&#30340;&#25910;&#30410;&#29575;&#26354;&#32447;&#20855;&#26377;&#20223;&#23556;&#20960;&#20309;&#24615;&#36136;&#12290;</title><link>http://arxiv.org/abs/2308.02246</link><description>&lt;p&gt;
&#32479;&#35745;&#19968;&#33268;&#30340;&#26399;&#38480;&#32467;&#26500;&#20855;&#26377;&#20223;&#23556;&#20960;&#20309;
&lt;/p&gt;
&lt;p&gt;
Statistically consistent term structures have affine geometry. (arXiv:2308.02246v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.02246
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#33021;&#28304;&#26399;&#36135;&#30340;&#20840;&#26399;&#38480;&#32467;&#26500;&#30340;&#26377;&#38480;&#32500;&#27169;&#22411;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#30456;&#23481;&#24615;&#27010;&#24565;&#65292;&#35201;&#27714;&#25152;&#36873;&#25321;&#30340;&#21487;&#33021;&#25910;&#30410;&#29575;&#26354;&#32447;&#38598;&#19982;&#25152;&#33719;&#24471;&#30340;&#25193;&#25955;&#31995;&#25968;&#26159;&#30456;&#23481;&#30340;&#65292;&#20174;&#32780;&#25512;&#23548;&#20986;&#19968;&#32452;&#21487;&#33021;&#30340;&#25910;&#30410;&#29575;&#26354;&#32447;&#20855;&#26377;&#20223;&#23556;&#20960;&#20309;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#28041;&#21450;&#33021;&#28304;&#26399;&#36135;&#20840;&#26399;&#38480;&#32467;&#26500;&#30340;&#26377;&#38480;&#32500;&#27169;&#22411;&#12290;&#22312;&#36873;&#25321;&#20102;&#19968;&#32452;&#21487;&#33021;&#30340;&#25910;&#30410;&#29575;&#26354;&#32447;&#20043;&#21518;&#65292;&#25105;&#20204;&#24076;&#26395;&#20174;&#25968;&#25454;&#20013;&#20272;&#35745;&#25910;&#30410;&#29575;&#26354;&#32447;&#28436;&#21270;&#30340;&#21160;&#24577;&#34892;&#20026;&#12290;&#20272;&#35745;&#20986;&#30340;&#27169;&#22411;&#24212;&#35813;&#27809;&#26377;&#22871;&#21033;&#65292;&#36825;&#34987;&#35748;&#20026;&#20250;&#23548;&#33268;&#26576;&#20123;&#28418;&#31227;&#26465;&#20214;&#12290;&#22914;&#26524;&#25910;&#30410;&#29575;&#26354;&#32447;&#30340;&#28436;&#21270;&#27169;&#22411;&#26159;&#25193;&#25955;&#36807;&#31243;&#65292;&#37027;&#20040;&#25193;&#25955;&#31995;&#25968;&#30340;&#20272;&#35745;&#23601;&#26159;&#24320;&#25918;&#30340;&#12290;&#20174;&#23454;&#38469;&#35282;&#24230;&#26469;&#30475;&#65292;&#36825;&#35201;&#27714;&#25152;&#36873;&#25321;&#30340;&#21487;&#33021;&#25910;&#30410;&#29575;&#26354;&#32447;&#38598;&#19982;&#25152;&#33719;&#24471;&#30340;&#25193;&#25955;&#31995;&#25968;&#26159;&#30456;&#23481;&#30340;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#31181;&#30456;&#23481;&#24615;&#24378;&#21046;&#20102;&#19968;&#32452;&#21487;&#33021;&#30340;&#25910;&#30410;&#29575;&#26354;&#32447;&#30340;&#20223;&#23556;&#20960;&#20309;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper is concerned with finite dimensional models for the entire term structure for energy futures. As soon as a finite dimensional set of possible yield curves is chosen, one likes to estimate the dynamic behaviour of the yield curve evolution from data. The estimated model should be free of arbitrage which is known to result in some drift condition. If the yield curve evolution is modelled by a diffusion, then this leaves the diffusion coefficient open for estimation. From a practical perspective, this requires that the chosen set of possible yield curves is compatible with any obtained diffusion coefficient. In this paper, we show that this compatibility enforces an affine geometry of the set of possible yield curves.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25351;&#20986;&#22825;&#30495;&#30340;&#32593;&#32476;&#25235;&#21462;&#31243;&#24207;&#21487;&#33021;&#23548;&#33268;&#25910;&#38598;&#25968;&#25454;&#20013;&#30340;&#25277;&#26679;&#20559;&#24046;&#65292;&#24182;&#25551;&#36848;&#20102;&#26469;&#28304;&#20110;&#32593;&#32476;&#20869;&#23481;&#26131;&#21464;&#24615;&#12289;&#20010;&#24615;&#21270;&#21644;&#26410;&#32034;&#24341;&#30340;&#25277;&#26679;&#20559;&#24046;&#12290;&#36890;&#36807;&#20363;&#23376;&#35828;&#26126;&#20102;&#25277;&#26679;&#20559;&#24046;&#30340;&#26222;&#36941;&#24615;&#21644;&#31243;&#24230;&#65292;&#24182;&#25552;&#20379;&#20102;&#20811;&#26381;&#25277;&#26679;&#20559;&#24046;&#30340;&#24314;&#35758;&#12290;</title><link>http://arxiv.org/abs/2308.02231</link><description>&lt;p&gt;
&#25105;&#20204;&#24212;&#35813;&#30456;&#20449;&#32593;&#32476;&#25235;&#21462;&#30340;&#25968;&#25454;&#21527;&#65311;
&lt;/p&gt;
&lt;p&gt;
Should we trust web-scraped data?. (arXiv:2308.02231v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.02231
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25351;&#20986;&#22825;&#30495;&#30340;&#32593;&#32476;&#25235;&#21462;&#31243;&#24207;&#21487;&#33021;&#23548;&#33268;&#25910;&#38598;&#25968;&#25454;&#20013;&#30340;&#25277;&#26679;&#20559;&#24046;&#65292;&#24182;&#25551;&#36848;&#20102;&#26469;&#28304;&#20110;&#32593;&#32476;&#20869;&#23481;&#26131;&#21464;&#24615;&#12289;&#20010;&#24615;&#21270;&#21644;&#26410;&#32034;&#24341;&#30340;&#25277;&#26679;&#20559;&#24046;&#12290;&#36890;&#36807;&#20363;&#23376;&#35828;&#26126;&#20102;&#25277;&#26679;&#20559;&#24046;&#30340;&#26222;&#36941;&#24615;&#21644;&#31243;&#24230;&#65292;&#24182;&#25552;&#20379;&#20102;&#20811;&#26381;&#25277;&#26679;&#20559;&#24046;&#30340;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23454;&#35777;&#30740;&#31350;&#20154;&#21592;&#36234;&#26469;&#36234;&#22810;&#22320;&#37319;&#29992;&#35745;&#37327;&#32463;&#27982;&#23398;&#21644;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#23548;&#33268;&#20102;&#23545;&#19968;&#31181;&#25968;&#25454;&#25910;&#38598;&#26041;&#27861;&#30340;&#24191;&#27867;&#20351;&#29992;&#65306;&#32593;&#32476;&#25235;&#21462;&#12290;&#32593;&#32476;&#25235;&#21462;&#25351;&#30340;&#26159;&#20351;&#29992;&#33258;&#21160;&#21270;&#35745;&#31639;&#26426;&#31243;&#24207;&#35775;&#38382;&#32593;&#31449;&#24182;&#19979;&#36733;&#20854;&#20869;&#23481;&#12290;&#26412;&#25991;&#30340;&#20027;&#35201;&#35770;&#28857;&#26159;&#65292;&#22825;&#30495;&#30340;&#32593;&#32476;&#25235;&#21462;&#31243;&#24207;&#21487;&#33021;&#20250;&#23548;&#33268;&#25910;&#38598;&#25968;&#25454;&#20013;&#30340;&#25277;&#26679;&#20559;&#24046;&#12290;&#26412;&#25991;&#25551;&#36848;&#20102;&#32593;&#32476;&#25235;&#21462;&#25968;&#25454;&#20013;&#30340;&#19977;&#31181;&#25277;&#26679;&#20559;&#24046;&#26469;&#28304;&#12290;&#26356;&#20855;&#20307;&#22320;&#35828;&#65292;&#25277;&#26679;&#20559;&#24046;&#28304;&#20110;&#32593;&#32476;&#20869;&#23481;&#30340;&#26131;&#21464;&#24615;&#65288;&#21363;&#21487;&#33021;&#21457;&#29983;&#21464;&#21270;&#65289;&#12289;&#20010;&#24615;&#21270;&#65288;&#21363;&#26681;&#25454;&#35831;&#27714;&#29305;&#24449;&#21576;&#29616;&#65289;&#21644;&#26410;&#32034;&#24341;&#65288;&#21363;&#20154;&#21475;&#30331;&#35760;&#31807;&#30340;&#20016;&#23500;&#24615;&#65289;&#12290;&#36890;&#36807;&#19968;&#31995;&#21015;&#20363;&#23376;&#65292;&#25105;&#35828;&#26126;&#20102;&#25277;&#26679;&#20559;&#24046;&#30340;&#26222;&#36941;&#24615;&#21644;&#31243;&#24230;&#12290;&#20026;&#20102;&#25903;&#25345;&#30740;&#31350;&#20154;&#21592;&#21644;&#23457;&#31295;&#20154;&#65292;&#26412;&#25991;&#25552;&#20379;&#20102;&#20851;&#20110;&#23545;&#32593;&#32476;&#25235;&#21462;&#25968;&#25454;&#30340;&#25277;&#26679;&#20559;&#24046;&#36827;&#34892;&#39044;&#26399;&#12289;&#26816;&#27979;&#21644;&#20811;&#26381;&#30340;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;
The increasing adoption of econometric and machine-learning approaches by empirical researchers has led to a widespread use of one data collection method: web scraping. Web scraping refers to the use of automated computer programs to access websites and download their content. The key argument of this paper is that na\"ive web scraping procedures can lead to sampling bias in the collected data. This article describes three sources of sampling bias in web-scraped data. More specifically, sampling bias emerges from web content being volatile (i.e., being subject to change), personalized (i.e., presented in response to request characteristics), and unindexed (i.e., abundance of a population register). In a series of examples, I illustrate the prevalence and magnitude of sampling bias. To support researchers and reviewers, this paper provides recommendations on anticipating, detecting, and overcoming sampling bias in web-scraped data.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26816;&#39564;&#26399;&#26395;&#25928;&#29992;&#21644;&#20985;&#20984;&#24615;&#30340;&#31616;&#21333;&#26041;&#27861;&#65292;&#32467;&#26524;&#21457;&#29616;&#20960;&#20046;&#27809;&#26377;&#25903;&#25345;&#36825;&#20004;&#20010;&#27169;&#22411;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#35777;&#26126;&#20351;&#29992;&#27969;&#34892;&#30340;&#22810;&#20215;&#26684;&#28165;&#21333;&#26041;&#27861;&#27979;&#37327;&#39118;&#38505;&#35268;&#36991;&#26159;&#19981;&#21512;&#36866;&#30340;&#65292;&#30001;&#20110;&#21442;&#25968;&#38169;&#35823;&#23548;&#33268;&#20102;&#39118;&#38505;&#35268;&#36991;&#39640;&#26222;&#36941;&#24615;&#30340;&#29616;&#35937;&#12290;</title><link>http://arxiv.org/abs/2308.02083</link><description>&lt;p&gt;
&#39118;&#38505;&#35268;&#36991;&#30340;&#38750;&#21442;&#25968;&#26816;&#39564;
&lt;/p&gt;
&lt;p&gt;
A Non-Parametric Test of Risk Aversion. (arXiv:2308.02083v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.02083
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26816;&#39564;&#26399;&#26395;&#25928;&#29992;&#21644;&#20985;&#20984;&#24615;&#30340;&#31616;&#21333;&#26041;&#27861;&#65292;&#32467;&#26524;&#21457;&#29616;&#20960;&#20046;&#27809;&#26377;&#25903;&#25345;&#36825;&#20004;&#20010;&#27169;&#22411;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#35777;&#26126;&#20351;&#29992;&#27969;&#34892;&#30340;&#22810;&#20215;&#26684;&#28165;&#21333;&#26041;&#27861;&#27979;&#37327;&#39118;&#38505;&#35268;&#36991;&#26159;&#19981;&#21512;&#36866;&#30340;&#65292;&#30001;&#20110;&#21442;&#25968;&#38169;&#35823;&#23548;&#33268;&#20102;&#39118;&#38505;&#35268;&#36991;&#39640;&#26222;&#36941;&#24615;&#30340;&#29616;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32463;&#27982;&#23398;&#20013;&#65292;&#36890;&#36807;&#26399;&#26395;&#25928;&#29992;&#33539;&#24335;&#20869;&#30340;&#20985;&#20984;&#20271;&#21162;&#21033;&#25928;&#29992;&#26469;&#24314;&#27169;&#39118;&#38505;&#35268;&#36991;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#26399;&#26395;&#25928;&#29992;&#21644;&#20985;&#20984;&#24615;&#30340;&#27979;&#35797;&#26041;&#27861;&#12290;&#25105;&#20204;&#21457;&#29616;&#24456;&#23569;&#25903;&#25345;&#20219;&#20309;&#19968;&#31181;&#27169;&#22411;&#65306;&#21482;&#26377;30%&#30340;&#36873;&#25321;&#31526;&#21512;&#20985;&#20984;&#25928;&#29992;&#65292;&#21482;&#26377;72&#21517;&#21463;&#35797;&#32773;&#20013;&#30340;&#20004;&#20154;&#31526;&#21512;&#26399;&#26395;&#25928;&#29992;&#65292;&#32780;&#20854;&#20013;&#21482;&#26377;&#19968;&#20154;&#31526;&#21512;&#32463;&#27982;&#23398;&#20013;&#30340;&#39118;&#38505;&#35268;&#36991;&#27169;&#22411;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#19982;&#20351;&#29992;&#27969;&#34892;&#30340;&#22810;&#20215;&#26684;&#28165;&#21333;&#26041;&#27861;&#33719;&#21462;&#30340;&#30475;&#20284;&#8220;&#39118;&#38505;&#35268;&#36991;&#8221;&#30340;&#36873;&#25321;&#30340;&#26222;&#36941;&#29616;&#35937;&#24418;&#25104;&#23545;&#27604;&#65292;&#36825;&#19968;&#32467;&#26524;&#25105;&#20204;&#22312;&#26412;&#25991;&#20013;&#37325;&#22797;&#20102;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#31181;&#26041;&#27861;&#19981;&#36866;&#29992;&#20110;&#34913;&#37327;&#39118;&#38505;&#35268;&#36991;&#65292;&#24182;&#19988;&#23427;&#20135;&#29983;&#39118;&#38505;&#35268;&#36991;&#39640;&#26222;&#36941;&#24615;&#30340;&#21407;&#22240;&#26159;&#21442;&#25968;&#38169;&#35823;&#12290;
&lt;/p&gt;
&lt;p&gt;
In economics, risk aversion is modeled via a concave Bernoulli utility within the expected-utility paradigm. We propose a simple test of expected utility and concavity. We find little support for either: only 30 percent of the choices are consistent with a concave utility, only two out of 72 subjects are consistent with expected utility, and only one of them fits the economic model of risk aversion. Our findings contrast with the preponderance of seemingly "risk-averse" choices that have been elicited using the popular multiple-price list methodology, a result we replicate in this paper. We demonstrate that this methodology is unfit to measure risk aversion, and that the high prevalence of risk aversion it produces is due to parametric misspecification.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#37329;&#34701;&#24066;&#22330;&#20013;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#30340;&#38382;&#39064;&#65292;&#32771;&#34385;&#20102;&#32929;&#31080;&#22238;&#25253;&#30340;&#38544;&#34255;&#39640;&#26031;&#28418;&#31227;&#20197;&#21450;&#38543;&#26426;&#21040;&#36798;&#30340;&#19987;&#23478;&#24847;&#35265;&#65292;&#24212;&#29992;&#21345;&#23572;&#26364;&#28388;&#27874;&#25216;&#26415;&#33719;&#24471;&#20102;&#38544;&#34255;&#28418;&#31227;&#30340;&#20272;&#35745;&#65292;&#24182;&#36890;&#36807;&#21160;&#24577;&#35268;&#21010;&#26041;&#27861;&#35299;&#20915;&#20102;&#21151;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2308.02049</link><description>&lt;p&gt;
&#19968;&#20010;&#20855;&#26377;&#38544;&#34255;&#39640;&#26031;&#28418;&#31227;&#21644;&#38543;&#26426;&#21040;&#36798;&#19987;&#23478;&#24847;&#35265;&#30340;&#24066;&#22330;&#20013;&#30340;&#32452;&#21512;&#20248;&#21270;&#65306;&#24314;&#27169;&#21644;&#29702;&#35770;&#32467;&#26524;
&lt;/p&gt;
&lt;p&gt;
Portfolio Optimization in a Market with Hidden Gaussian Drift and Randomly Arriving Expert Opinions: Modeling and Theoretical Results. (arXiv:2308.02049v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.02049
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#37329;&#34701;&#24066;&#22330;&#20013;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#30340;&#38382;&#39064;&#65292;&#32771;&#34385;&#20102;&#32929;&#31080;&#22238;&#25253;&#30340;&#38544;&#34255;&#39640;&#26031;&#28418;&#31227;&#20197;&#21450;&#38543;&#26426;&#21040;&#36798;&#30340;&#19987;&#23478;&#24847;&#35265;&#65292;&#24212;&#29992;&#21345;&#23572;&#26364;&#28388;&#27874;&#25216;&#26415;&#33719;&#24471;&#20102;&#38544;&#34255;&#28418;&#31227;&#30340;&#20272;&#35745;&#65292;&#24182;&#36890;&#36807;&#21160;&#24577;&#35268;&#21010;&#26041;&#27861;&#35299;&#20915;&#20102;&#21151;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#19968;&#20010;&#37329;&#34701;&#24066;&#22330;&#20013;&#65292;&#32929;&#31080;&#22238;&#25253;&#20381;&#36182;&#20110;&#19968;&#20010;&#38544;&#34255;&#30340;&#39640;&#26031;&#22343;&#20540;&#22238;&#24402;&#28418;&#31227;&#36807;&#31243;&#30340;&#24773;&#20917;&#19979;&#65292;&#21151;&#29992;&#26368;&#22823;&#21270;&#25237;&#36164;&#32773;&#30340;&#32452;&#21512;&#36873;&#25321;&#38382;&#39064;&#12290;&#28418;&#31227;&#30340;&#20449;&#24687;&#26159;&#36890;&#36807;&#22238;&#25253;&#21644;&#19987;&#23478;&#24847;&#35265;&#30340;&#22122;&#22768;&#20449;&#21495;&#33719;&#24471;&#30340;&#65292;&#36825;&#20123;&#20449;&#21495;&#38543;&#26426;&#22320;&#38543;&#26102;&#38388;&#21040;&#36798;&#12290;&#21040;&#36798;&#26085;&#26399;&#34987;&#24314;&#27169;&#20026;&#19968;&#20010;&#40784;&#27425;&#27850;&#26494;&#36807;&#31243;&#30340;&#36339;&#36291;&#26102;&#38388;&#12290;&#24212;&#29992;&#21345;&#23572;&#26364;&#28388;&#27874;&#25216;&#26415;&#65292;&#25105;&#20204;&#35745;&#31639;&#20986;&#20102;&#20851;&#20110;&#35266;&#27979;&#20540;&#30340;&#26465;&#20214;&#22343;&#20540;&#21644;&#21327;&#26041;&#24046;&#30340;&#38544;&#34255;&#28418;&#31227;&#30340;&#20272;&#35745;&#20540;&#12290;&#21033;&#29992;&#21160;&#24577;&#35268;&#21010;&#26041;&#27861;&#35299;&#20915;&#20102;&#21151;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#12290;&#25105;&#20204;&#25512;&#23548;&#20986;&#20102;&#30456;&#20851;&#30340;&#21160;&#24577;&#35268;&#21010;&#26041;&#31243;&#65292;&#24182;&#23545;&#20005;&#35880;&#30340;&#25968;&#23398;&#35777;&#26126;&#36827;&#34892;&#20102;&#27491;&#21017;&#21270;&#35770;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper investigates the optimal selection of portfolios for power utility maximizing investors in a financial market where stock returns depend on a hidden Gaussian mean reverting drift process. Information on the drift is obtained from returns and expert opinions in the form of noisy signals about the current state of the drift arriving randomly over time. The arrival dates are modeled as the jump times of a homogeneous Poisson process. Applying Kalman filter techniques we derive estimates of the hidden drift which are described by the conditional mean and covariance of the drift given the observations. The utility maximization problem is solved with dynamic programming methods. We derive the associated dynamic programming equation and study regularization arguments for a rigorous mathematical justification.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#22522;&#20934;&#30740;&#31350;&#25506;&#35752;&#20102;&#22522;&#20110;LOB&#25968;&#25454;&#30340;&#32929;&#31080;&#20215;&#26684;&#36235;&#21183;&#39044;&#27979;&#30340;15&#31181;&#26368;&#26032;DL&#27169;&#22411;&#30340;&#40065;&#26834;&#24615;&#21644;&#27867;&#21270;&#33021;&#21147;&#12290;&#23454;&#39564;&#35777;&#26126;&#36825;&#20123;&#27169;&#22411;&#22312;&#38754;&#23545;&#26032;&#25968;&#25454;&#26102;&#24615;&#33021;&#26126;&#26174;&#19979;&#38477;&#65292;&#23545;&#20854;&#22312;&#23454;&#38469;&#24066;&#22330;&#20013;&#30340;&#24212;&#29992;&#24615;&#25552;&#20986;&#20102;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2308.01915</link><description>&lt;p&gt;
&#22522;&#20110;LOB&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#29992;&#20110;&#32929;&#31080;&#20215;&#26684;&#36235;&#21183;&#39044;&#27979;&#65306;&#19968;&#39033;&#22522;&#20934;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
LOB-Based Deep Learning Models for Stock Price Trend Prediction: A Benchmark Study. (arXiv:2308.01915v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01915
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#22522;&#20934;&#30740;&#31350;&#25506;&#35752;&#20102;&#22522;&#20110;LOB&#25968;&#25454;&#30340;&#32929;&#31080;&#20215;&#26684;&#36235;&#21183;&#39044;&#27979;&#30340;15&#31181;&#26368;&#26032;DL&#27169;&#22411;&#30340;&#40065;&#26834;&#24615;&#21644;&#27867;&#21270;&#33021;&#21147;&#12290;&#23454;&#39564;&#35777;&#26126;&#36825;&#20123;&#27169;&#22411;&#22312;&#38754;&#23545;&#26032;&#25968;&#25454;&#26102;&#24615;&#33021;&#26126;&#26174;&#19979;&#38477;&#65292;&#23545;&#20854;&#22312;&#23454;&#38469;&#24066;&#22330;&#20013;&#30340;&#24212;&#29992;&#24615;&#25552;&#20986;&#20102;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#23398;&#20064;&#65288;DL&#65289;&#30740;&#31350;&#22312;&#37329;&#34701;&#34892;&#19994;&#20013;&#20135;&#29983;&#20102;&#26174;&#33879;&#24433;&#21709;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#22522;&#20110;&#38480;&#20215;&#35746;&#21333;&#31807;&#65288;LOB&#65289;&#25968;&#25454;&#30340;&#32929;&#31080;&#20215;&#26684;&#36235;&#21183;&#39044;&#27979;&#65288;SPTP&#65289;&#30340;&#21313;&#20116;&#31181;&#26368;&#26032; DL&#27169;&#22411;&#30340;&#40065;&#26834;&#24615;&#21644;&#27867;&#21270;&#33021;&#21147;&#12290;&#20026;&#20102;&#36827;&#34892;&#36825;&#39033;&#30740;&#31350;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;LOBCAST&#65292;&#19968;&#20010;&#24320;&#28304;&#26694;&#26550;&#65292;&#21253;&#25324;&#25968;&#25454;&#39044;&#22788;&#29702;&#12289;DL &#27169;&#22411;&#35757;&#32451;&#12289;&#35780;&#20272;&#21644;&#21033;&#28070;&#20998;&#26512;&#12290;&#25105;&#20204;&#30340;&#22823;&#37327;&#23454;&#39564;&#34920;&#26126;&#65292;&#25152;&#26377;&#27169;&#22411;&#22312;&#38754;&#23545;&#26032;&#25968;&#25454;&#26102;&#24615;&#33021;&#26174;&#33879;&#19979;&#38477;&#65292;&#20174;&#32780;&#23545;&#23427;&#20204;&#22312;&#23454;&#38469;&#24066;&#22330;&#20013;&#30340;&#36866;&#29992;&#24615;&#25552;&#20986;&#20102;&#30097;&#38382;&#12290;&#25105;&#20204;&#30340;&#24037;&#20316;&#20316;&#20026;&#19968;&#20010;&#22522;&#20934;&#65292;&#25581;&#31034;&#20102;&#24403;&#21069;&#26041;&#27861;&#30340;&#28508;&#21147;&#21644;&#23616;&#38480;&#24615;&#65292;&#24182;&#20026;&#21019;&#26032;&#35299;&#20915;&#26041;&#26696;&#25552;&#20379;&#20102;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
The recent advancements in Deep Learning (DL) research have notably influenced the finance sector. We examine the robustness and generalizability of fifteen state-of-the-art DL models focusing on Stock Price Trend Prediction (SPTP) based on Limit Order Book (LOB) data. To carry out this study, we developed LOBCAST, an open-source framework that incorporates data preprocessing, DL model training, evaluation and profit analysis. Our extensive experiments reveal that all models exhibit a significant performance drop when exposed to new data, thereby raising questions about their real-world market applicability. Our work serves as a benchmark, illuminating the potential and the limitations of current approaches and providing insight for innovative solutions.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#22312;&#21830;&#21697;&#20132;&#26131;&#20013;&#30340;&#24212;&#29992;&#65292;&#24182;&#36890;&#36807;&#25552;&#20379;&#27969;&#21160;&#24615;&#21644;&#20943;&#23569;&#24066;&#22330;&#27874;&#21160;&#24615;&#26469;&#31283;&#23450;&#24066;&#22330;&#12290;&#36825;&#23545;&#20110;&#35299;&#20915;&#33021;&#28304;&#24066;&#22330;&#30340;&#19981;&#31283;&#23450;&#21644;&#20840;&#29699;&#33021;&#28304;&#21361;&#26426;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;</title><link>http://arxiv.org/abs/2308.01910</link><description>&lt;p&gt;
&#21830;&#21697;&#24066;&#22330;&#20013;&#30340;&#28145;&#24230;&#31574;&#30053;&#26799;&#24230;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Deep Policy Gradient Methods in Commodity Markets. (arXiv:2308.01910v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01910
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#22312;&#21830;&#21697;&#20132;&#26131;&#20013;&#30340;&#24212;&#29992;&#65292;&#24182;&#36890;&#36807;&#25552;&#20379;&#27969;&#21160;&#24615;&#21644;&#20943;&#23569;&#24066;&#22330;&#27874;&#21160;&#24615;&#26469;&#31283;&#23450;&#24066;&#22330;&#12290;&#36825;&#23545;&#20110;&#35299;&#20915;&#33021;&#28304;&#24066;&#22330;&#30340;&#19981;&#31283;&#23450;&#21644;&#20840;&#29699;&#33021;&#28304;&#21361;&#26426;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33021;&#28304;&#36716;&#22411;&#22686;&#21152;&#20102;&#23545;&#38388;&#27463;&#24615;&#33021;&#28304;&#30340;&#20381;&#36182;&#65292;&#19981;&#31283;&#23450;&#20102;&#33021;&#28304;&#24066;&#22330;&#24182;&#23548;&#33268;&#20102;&#21069;&#25152;&#26410;&#26377;&#30340;&#27874;&#21160;&#24615;&#65292;&#26368;&#32456;&#23548;&#33268;&#20102;2021&#24180;&#30340;&#20840;&#29699;&#33021;&#28304;&#21361;&#26426;&#12290;&#38500;&#20102;&#23545;&#29983;&#20135;&#32773;&#21644;&#28040;&#36153;&#32773;&#36896;&#25104;&#20260;&#23475;&#22806;&#65292;&#27874;&#21160;&#30340;&#33021;&#28304;&#24066;&#22330;&#36824;&#21487;&#33021;&#21361;&#21450;&#20851;&#38190;&#30340;&#30899;&#20943;&#25490;&#21162;&#21147;&#12290;&#20132;&#26131;&#21830;&#36890;&#36807;&#25552;&#20379;&#27969;&#21160;&#24615;&#21644;&#20943;&#23569;&#27874;&#21160;&#24615;&#22312;&#31283;&#23450;&#24066;&#22330;&#20013;&#25198;&#28436;&#30528;&#37325;&#35201;&#35282;&#33394;&#12290;&#24050;&#32463;&#25552;&#20986;&#20102;&#20960;&#31181;&#25968;&#23398;&#21644;&#32479;&#35745;&#27169;&#22411;&#29992;&#20110;&#39044;&#27979;&#26410;&#26469;&#25910;&#30410;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#37329;&#34701;&#24066;&#22330;&#30340;&#20302;&#20449;&#22122;&#27604;&#21644;&#38750;&#24179;&#31283;&#21160;&#24577;&#65292;&#24320;&#21457;&#36825;&#26679;&#30340;&#27169;&#22411;&#24182;&#19981;&#26159;&#26131;&#20107;&#12290;&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#22312;&#21830;&#21697;&#20132;&#26131;&#20013;&#30340;&#26377;&#25928;&#24615;&#12290;&#23558;&#21830;&#21697;&#20132;&#26131;&#38382;&#39064;&#24418;&#24335;&#21270;&#20026;&#36830;&#32493;&#31163;&#25955;&#26102;&#38388;&#38543;&#26426;&#21160;&#21147;&#31995;&#32479;&#12290;&#35813;&#31995;&#32479;&#37319;&#29992;&#20102;&#26032;&#39062;&#30340;&#26102;&#38388;&#31163;&#25955;&#21270;&#26041;&#26696;&#65292;&#23545;&#24066;&#22330;&#27874;&#21160;&#20570;&#20986;&#21453;&#24212;&#24182;&#33258;&#36866;&#24212;&#65292;&#25552;&#20379;&#26356;&#22909;&#30340;&#32479;&#35745;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The energy transition has increased the reliance on intermittent energy sources, destabilizing energy markets and causing unprecedented volatility, culminating in the global energy crisis of 2021. In addition to harming producers and consumers, volatile energy markets may jeopardize vital decarbonization efforts. Traders play an important role in stabilizing markets by providing liquidity and reducing volatility. Several mathematical and statistical models have been proposed for forecasting future returns. However, developing such models is non-trivial due to financial markets' low signal-to-noise ratios and nonstationary dynamics.  This thesis investigates the effectiveness of deep reinforcement learning methods in commodities trading. It formalizes the commodities trading problem as a continuing discrete-time stochastic dynamical system. This system employs a novel time-discretization scheme that is reactive and adaptive to market volatility, providing better statistical properties f
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#22312;&#29790;&#20856;Covid-19&#30123;&#33495;&#25512;&#20986;&#20013;&#30340;&#21306;&#22495;&#21464;&#21270;&#65292;&#30740;&#31350;&#20102;&#23545;&#28608;&#21169;&#26377;&#24046;&#24322;&#30340;&#32676;&#20307;&#30340;&#25552;&#31034;&#25928;&#26524;&#65292;&#32467;&#26524;&#26174;&#31034;&#25552;&#31034;&#23545;&#20110;&#20010;&#20154;&#26080;&#24847;&#20041;&#30340;&#36873;&#25321;&#26356;&#26377;&#25928;&#12290;</title><link>http://arxiv.org/abs/2301.08797</link><description>&lt;p&gt;
&#40664;&#35748;&#25552;&#31034;&#20160;&#20040;&#26102;&#20505;&#26377;&#25928;?
&lt;/p&gt;
&lt;p&gt;
When do Default Nudges Work?. (arXiv:2301.08797v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.08797
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#22312;&#29790;&#20856;Covid-19&#30123;&#33495;&#25512;&#20986;&#20013;&#30340;&#21306;&#22495;&#21464;&#21270;&#65292;&#30740;&#31350;&#20102;&#23545;&#28608;&#21169;&#26377;&#24046;&#24322;&#30340;&#32676;&#20307;&#30340;&#25552;&#31034;&#25928;&#26524;&#65292;&#32467;&#26524;&#26174;&#31034;&#25552;&#31034;&#23545;&#20110;&#20010;&#20154;&#26080;&#24847;&#20041;&#30340;&#36873;&#25321;&#26356;&#26377;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25552;&#31034;&#26159;&#31185;&#23398;&#21644;&#25919;&#31574;&#19978;&#19968;&#20010;&#26032;&#20852;&#30340;&#35805;&#39064;&#65292;&#20294;&#19981;&#21516;&#28608;&#21169;&#32676;&#20307;&#20013;&#30340;&#25552;&#31034;&#25928;&#26524;&#30340;&#35777;&#25454;&#36824;&#19981;&#36275;&#12290;&#26412;&#25991;&#21033;&#29992;&#29790;&#20856;Covid-19&#30123;&#33495;&#25512;&#20986;&#36807;&#31243;&#20013;&#30340;&#21306;&#22495;&#21464;&#21270;&#65292;&#30740;&#31350;&#20102;&#23545;&#28608;&#21169;&#26377;&#24046;&#24322;&#30340;&#32676;&#20307;&#30340;&#25552;&#31034;&#25928;&#26524;&#65306;&#23545;&#20110;16-17&#23681;&#30340;&#23401;&#23376;&#65292;Covid-19&#19981;&#21361;&#38505;&#65292;&#32780;50-59&#23681;&#30340;&#20154;&#21017;&#38754;&#20020;&#30528;&#20005;&#37325;&#30142;&#30149;&#25110;&#27515;&#20129;&#30340;&#24040;&#22823;&#39118;&#38505;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#24180;&#36731;&#20154;&#30340;&#21453;&#24212;&#26174;&#33879;&#24378;&#28872;&#65292;&#36825;&#19982;&#25552;&#31034;&#23545;&#20110;&#20010;&#20154;&#26080;&#24847;&#20041;&#30340;&#36873;&#25321;&#26356;&#26377;&#25928;&#30340;&#29702;&#35770;&#30456;&#19968;&#33268;&#12290;
&lt;/p&gt;
&lt;p&gt;
Nudging is a burgeoning topic in science and in policy, but evidence on the effectiveness of nudges among differentially-incentivized groups is lacking. This paper exploits regional variations in the roll-out of the Covid-19 vaccine in Sweden to examine the effect of a nudge on groups whose intrinsic incentives are different: 16-17-year-olds, for whom Covid-19 is not dangerous, and 50-59-year-olds, who face a substantial risk of death or severe dis-ease. We find a significantly stronger response in the younger group, consistent with the theory that nudges are more effective for choices that are not meaningful to the individual.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#27880;&#24847;&#21147;&#39537;&#21160;&#30340;&#21160;&#24577;&#22240;&#23376;&#23398;&#20064;&#30340;&#29983;&#25104;CVaR&#32452;&#21512;&#20248;&#21270;&#31639;&#27861;&#65292;&#36890;&#36807;&#38543;&#26426;&#21464;&#37327;&#36716;&#25442;&#20316;&#20026;&#20998;&#24067;&#24314;&#27169;&#30340;&#38544;&#24335;&#26041;&#24335;&#65292;&#20197;&#21450;&#20351;&#29992;&#27880;&#24847;&#21147;-GRU&#32593;&#32476;&#36827;&#34892;&#21160;&#24577;&#23398;&#20064;&#21644;&#39044;&#27979;&#65292;&#25429;&#25417;&#20102;&#22810;&#20803;&#32929;&#31080;&#25910;&#30410;&#20043;&#38388;&#30340;&#21160;&#24577;&#20381;&#36182;&#20851;&#31995;&#65292;&#29305;&#21035;&#26159;&#20851;&#27880;&#23614;&#37096;&#23646;&#24615;&#12290;&#36890;&#36807;&#22312;&#27599;&#20010;&#25237;&#36164;&#26085;&#26399;&#20174;&#23398;&#20064;&#21040;&#30340;&#29983;&#25104;&#27169;&#22411;&#20013;&#27169;&#25311;&#26032;&#26679;&#26412;&#65292;&#24182;&#36827;&#19968;&#27493;&#24212;&#29992;CVaR&#32452;&#21512;&#20248;&#21270;&#31574;&#30053;&#65292;&#23454;&#29616;&#20102;&#26356;&#26126;&#26234;&#30340;&#25237;&#36164;&#20915;&#31574;&#12290;</title><link>http://arxiv.org/abs/2301.07318</link><description>&lt;p&gt;
&#20351;&#29992;&#27880;&#24847;&#21147;&#39537;&#21160;&#30340;&#21160;&#24577;&#22240;&#23376;&#23398;&#20064;&#30340;&#29983;&#25104;CVaR&#32452;&#21512;&#20248;&#21270;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Generative CVaR Portfolio Optimization with Attention-Powered Dynamic Factor Learning. (arXiv:2301.07318v3 [q-fin.PM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.07318
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#27880;&#24847;&#21147;&#39537;&#21160;&#30340;&#21160;&#24577;&#22240;&#23376;&#23398;&#20064;&#30340;&#29983;&#25104;CVaR&#32452;&#21512;&#20248;&#21270;&#31639;&#27861;&#65292;&#36890;&#36807;&#38543;&#26426;&#21464;&#37327;&#36716;&#25442;&#20316;&#20026;&#20998;&#24067;&#24314;&#27169;&#30340;&#38544;&#24335;&#26041;&#24335;&#65292;&#20197;&#21450;&#20351;&#29992;&#27880;&#24847;&#21147;-GRU&#32593;&#32476;&#36827;&#34892;&#21160;&#24577;&#23398;&#20064;&#21644;&#39044;&#27979;&#65292;&#25429;&#25417;&#20102;&#22810;&#20803;&#32929;&#31080;&#25910;&#30410;&#20043;&#38388;&#30340;&#21160;&#24577;&#20381;&#36182;&#20851;&#31995;&#65292;&#29305;&#21035;&#26159;&#20851;&#27880;&#23614;&#37096;&#23646;&#24615;&#12290;&#36890;&#36807;&#22312;&#27599;&#20010;&#25237;&#36164;&#26085;&#26399;&#20174;&#23398;&#20064;&#21040;&#30340;&#29983;&#25104;&#27169;&#22411;&#20013;&#27169;&#25311;&#26032;&#26679;&#26412;&#65292;&#24182;&#36827;&#19968;&#27493;&#24212;&#29992;CVaR&#32452;&#21512;&#20248;&#21270;&#31574;&#30053;&#65292;&#23454;&#29616;&#20102;&#26356;&#26126;&#26234;&#30340;&#25237;&#36164;&#20915;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21160;&#24577;&#32452;&#21512;&#26500;&#24314;&#38382;&#39064;&#38656;&#35201;&#21160;&#24577;&#24314;&#27169;&#22810;&#20803;&#32929;&#31080;&#25910;&#30410;&#30340;&#32852;&#21512;&#20998;&#24067;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21160;&#24577;&#29983;&#25104;&#22240;&#23376;&#27169;&#22411;&#65292;&#23427;&#20351;&#29992;&#38543;&#26426;&#21464;&#37327;&#36716;&#25442;&#20316;&#20026;&#20998;&#24067;&#24314;&#27169;&#30340;&#38544;&#24335;&#26041;&#24335;&#65292;&#24182;&#20381;&#36182;&#20110;&#20351;&#29992;&#27880;&#24847;&#21147;-GRU&#32593;&#32476;&#36827;&#34892;&#21160;&#24577;&#23398;&#20064;&#21644;&#39044;&#27979;&#12290;&#25152;&#25552;&#20986;&#30340;&#27169;&#22411;&#25429;&#25417;&#20102;&#22810;&#20803;&#32929;&#31080;&#25910;&#30410;&#20043;&#38388;&#30340;&#21160;&#24577;&#20381;&#36182;&#20851;&#31995;&#65292;&#29305;&#21035;&#26159;&#20851;&#27880;&#23614;&#37096;&#23646;&#24615;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#20010;&#20004;&#27493;&#36845;&#20195;&#31639;&#27861;&#26469;&#35757;&#32451;&#27169;&#22411;&#65292;&#28982;&#21518;&#39044;&#27979;&#26102;&#21464;&#30340;&#27169;&#22411;&#21442;&#25968;&#65292;&#21253;&#25324;&#26102;&#19981;&#21464;&#30340;&#23614;&#37096;&#21442;&#25968;&#12290;&#22312;&#27599;&#20010;&#25237;&#36164;&#26085;&#26399;&#65292;&#25105;&#20204;&#21487;&#20197;&#36731;&#26494;&#22320;&#20174;&#23398;&#20064;&#21040;&#30340;&#29983;&#25104;&#27169;&#22411;&#20013;&#27169;&#25311;&#26032;&#26679;&#26412;&#65292;&#24182;&#36827;&#19968;&#27493;&#20351;&#29992;&#27169;&#25311;&#26679;&#26412;&#26469;&#36827;&#34892;CVaR&#32452;&#21512;&#20248;&#21270;&#65292;&#24418;&#25104;&#21160;&#24577;&#32452;&#21512;&#31574;&#30053;&#12290;&#23545;&#32929;&#31080;&#25968;&#25454;&#30340;&#25968;&#20540;&#23454;&#39564;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#21487;&#20197;&#24102;&#26469;&#26356;&#26126;&#26234;&#30340;&#25237;&#36164;&#65292;&#25215;&#35834;&#26356;&#39640;&#30340;&#22238;&#25253;&#39118;&#38505;&#27604;&#65292;&#24182;&#21576;&#29616;&#20986;...
&lt;/p&gt;
&lt;p&gt;
The dynamic portfolio construction problem requires dynamic modeling of the joint distribution of multivariate stock returns. To achieve this, we propose a dynamic generative factor model which uses random variable transformation as an implicit way of distribution modeling and relies on the Attention-GRU network for dynamic learning and forecasting. The proposed model captures the dynamic dependence among multivariate stock returns, especially focusing on the tail-side properties. We also propose a two-step iterative algorithm to train the model and then predict the time-varying model parameters, including the time-invariant tail parameters. At each investment date, we can easily simulate new samples from the learned generative model, and we further perform CVaR portfolio optimization with the simulated samples to form a dynamic portfolio strategy. The numerical experiment on stock data shows that our model leads to wiser investments that promise higher reward-risk ratios and present l
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#23558;&#32463;&#20856;&#30340;&#22810;&#33218;&#36172;&#21338;&#26426;&#38382;&#39064;&#25193;&#23637;&#21040;&#22343;&#20540;-&#26041;&#24046;&#35774;&#32622;&#65292;&#24182;&#36890;&#36807;&#32771;&#34385;&#20122;&#39640;&#26031;&#33218;&#25918;&#26494;&#20102;&#20808;&#21069;&#20551;&#35774;&#65292;&#35299;&#20915;&#20102;&#39118;&#38505;-&#22238;&#25253;&#26435;&#34913;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2212.09192</link><description>&lt;p&gt;
&#22343;&#20540;-&#26041;&#24046;&#35774;&#32622;&#19979;&#30340;&#22810;&#33218;&#36172;&#21338;&#26426;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Multiarmed Bandits Problem Under the Mean-Variance Setting. (arXiv:2212.09192v3 [math.OC] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.09192
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23558;&#32463;&#20856;&#30340;&#22810;&#33218;&#36172;&#21338;&#26426;&#38382;&#39064;&#25193;&#23637;&#21040;&#22343;&#20540;-&#26041;&#24046;&#35774;&#32622;&#65292;&#24182;&#36890;&#36807;&#32771;&#34385;&#20122;&#39640;&#26031;&#33218;&#25918;&#26494;&#20102;&#20808;&#21069;&#20551;&#35774;&#65292;&#35299;&#20915;&#20102;&#39118;&#38505;-&#22238;&#25253;&#26435;&#34913;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32463;&#20856;&#30340;&#22810;&#33218;&#36172;&#21338;&#26426;&#65288;MAB&#65289;&#38382;&#39064;&#28041;&#21450;&#19968;&#20010;&#23398;&#20064;&#32773;&#21644;&#19968;&#20010;&#21253;&#21547;K&#20010;&#29420;&#31435;&#33218;&#30340;&#38598;&#21512;&#65292;&#27599;&#20010;&#33218;&#37117;&#26377;&#33258;&#24049;&#30340;&#20107;&#21069;&#26410;&#30693;&#29420;&#31435;&#22870;&#21169;&#20998;&#24067;&#12290;&#22312;&#26377;&#38480;&#27425;&#36873;&#25321;&#20013;&#30340;&#27599;&#19968;&#27425;&#65292;&#23398;&#20064;&#32773;&#36873;&#25321;&#19968;&#20010;&#33218;&#24182;&#25509;&#25910;&#26032;&#20449;&#24687;&#12290;&#23398;&#20064;&#32773;&#32463;&#24120;&#38754;&#20020;&#19968;&#20010;&#21208;&#25506;-&#24320;&#21457;&#22256;&#22659;&#65306;&#36890;&#36807;&#29609;&#20272;&#35745;&#22870;&#21169;&#26368;&#39640;&#30340;&#33218;&#26469;&#21033;&#29992;&#24403;&#21069;&#20449;&#24687;&#65292;&#36824;&#26159;&#25506;&#32034;&#25152;&#26377;&#33218;&#20197;&#25910;&#38598;&#26356;&#22810;&#22870;&#21169;&#20449;&#24687;&#12290;&#35774;&#35745;&#30446;&#26631;&#26088;&#22312;&#26368;&#22823;&#21270;&#25152;&#26377;&#22238;&#21512;&#20013;&#30340;&#26399;&#26395;&#32047;&#31215;&#22870;&#21169;&#12290;&#28982;&#32780;&#65292;&#36825;&#26679;&#30340;&#30446;&#26631;&#24182;&#19981;&#32771;&#34385;&#39118;&#38505;-&#22238;&#25253;&#26435;&#34913;&#65292;&#32780;&#36825;&#22312;&#35768;&#22810;&#24212;&#29992;&#39046;&#22495;&#65292;&#29305;&#21035;&#26159;&#37329;&#34701;&#21644;&#32463;&#27982;&#39046;&#22495;&#65292;&#24120;&#24120;&#26159;&#19968;&#39033;&#22522;&#26412;&#21407;&#21017;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#22312;Sani&#31561;&#20154;&#65288;2012&#65289;&#30340;&#22522;&#30784;&#19978;&#65292;&#23558;&#32463;&#20856;&#30340;MAB&#38382;&#39064;&#25193;&#23637;&#21040;&#22343;&#20540;-&#26041;&#24046;&#35774;&#32622;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#36890;&#36807;&#32771;&#34385;&#20122;&#39640;&#26031;&#33218;&#25918;&#26494;&#20102;Sani&#31561;&#20154;&#65288;2012&#65289;&#20570;&#20986;&#30340;&#29420;&#31435;&#33218;&#21644;&#26377;&#30028;&#22870;&#21169;&#30340;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;
The classical multi-armed bandit (MAB) problem involves a learner and a collection of K independent arms, each with its own ex ante unknown independent reward distribution. At each one of a finite number of rounds, the learner selects one arm and receives new information. The learner often faces an exploration-exploitation dilemma: exploiting the current information by playing the arm with the highest estimated reward versus exploring all arms to gather more reward information. The design objective aims to maximize the expected cumulative reward over all rounds. However, such an objective does not account for a risk-reward tradeoff, which is often a fundamental precept in many areas of applications, most notably in finance and economics. In this paper, we build upon Sani et al. (2012) and extend the classical MAB problem to a mean-variance setting. Specifically, we relax the assumptions of independent arms and bounded rewards made in Sani et al. (2012) by considering sub-Gaussian arms.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20026;&#21306;&#22359;&#38142;&#21435;&#20013;&#24515;&#21270;&#39046;&#22495;&#30340;&#30693;&#35782;&#31995;&#32479;&#21270;&#65292;&#25552;&#20986;&#20102;&#20998;&#31867;&#27861;&#24182;&#24314;&#35758;&#20351;&#29992;&#25351;&#25968;&#26469;&#34913;&#37327;&#21644;&#37327;&#21270;&#21306;&#22359;&#38142;&#30340;&#21435;&#20013;&#24515;&#21270;&#27700;&#24179;&#12290;&#38500;&#20102;&#20849;&#35782;&#21435;&#20013;&#24515;&#21270;&#22806;&#65292;&#20854;&#20182;&#26041;&#38754;&#30340;&#30740;&#31350;&#30456;&#23545;&#36739;&#23569;&#12290;&#36825;&#39033;&#24037;&#20316;&#20026;&#26410;&#26469;&#30340;&#30740;&#31350;&#25552;&#20379;&#20102;&#22522;&#20934;&#21644;&#25351;&#23548;&#12290;</title><link>http://arxiv.org/abs/2205.04256</link><description>&lt;p&gt;
SoK&#65306;&#21306;&#22359;&#38142;&#21435;&#20013;&#24515;&#21270;
&lt;/p&gt;
&lt;p&gt;
SoK: Blockchain Decentralization. (arXiv:2205.04256v4 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.04256
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20026;&#21306;&#22359;&#38142;&#21435;&#20013;&#24515;&#21270;&#39046;&#22495;&#30340;&#30693;&#35782;&#31995;&#32479;&#21270;&#65292;&#25552;&#20986;&#20102;&#20998;&#31867;&#27861;&#24182;&#24314;&#35758;&#20351;&#29992;&#25351;&#25968;&#26469;&#34913;&#37327;&#21644;&#37327;&#21270;&#21306;&#22359;&#38142;&#30340;&#21435;&#20013;&#24515;&#21270;&#27700;&#24179;&#12290;&#38500;&#20102;&#20849;&#35782;&#21435;&#20013;&#24515;&#21270;&#22806;&#65292;&#20854;&#20182;&#26041;&#38754;&#30340;&#30740;&#31350;&#30456;&#23545;&#36739;&#23569;&#12290;&#36825;&#39033;&#24037;&#20316;&#20026;&#26410;&#26469;&#30340;&#30740;&#31350;&#25552;&#20379;&#20102;&#22522;&#20934;&#21644;&#25351;&#23548;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21306;&#22359;&#38142;&#36890;&#36807;&#22312;&#28857;&#23545;&#28857;&#32593;&#32476;&#20013;&#23454;&#29616;&#20998;&#24067;&#24335;&#20449;&#20219;&#65292;&#20026;&#21435;&#20013;&#24515;&#21270;&#32463;&#27982;&#25552;&#20379;&#20102;&#25903;&#25345;&#12290;&#28982;&#32780;&#65292;&#20196;&#20154;&#24778;&#35766;&#30340;&#26159;&#65292;&#30446;&#21069;&#36824;&#32570;&#20047;&#24191;&#27867;&#25509;&#21463;&#30340;&#21435;&#20013;&#24515;&#21270;&#23450;&#20041;&#25110;&#24230;&#37327;&#26631;&#20934;&#12290;&#25105;&#20204;&#36890;&#36807;&#20840;&#38754;&#20998;&#26512;&#29616;&#26377;&#30740;&#31350;&#65292;&#25506;&#32034;&#20102;&#21306;&#22359;&#38142;&#21435;&#20013;&#24515;&#21270;&#30340;&#30693;&#35782;&#31995;&#32479;&#21270;&#65288;SoK&#65289;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#36890;&#36807;&#23545;&#29616;&#26377;&#30740;&#31350;&#30340;&#23450;&#24615;&#20998;&#26512;&#65292;&#22312;&#20849;&#35782;&#12289;&#32593;&#32476;&#12289;&#27835;&#29702;&#12289;&#36130;&#23500;&#21644;&#20132;&#26131;&#31561;&#20116;&#20010;&#26041;&#38754;&#24314;&#31435;&#20102;&#29992;&#20110;&#20998;&#26512;&#21306;&#22359;&#38142;&#21435;&#20013;&#24515;&#21270;&#30340;&#20998;&#31867;&#27861;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#38500;&#20102;&#20849;&#35782;&#21435;&#20013;&#24515;&#21270;&#20197;&#22806;&#65292;&#20854;&#20182;&#26041;&#38754;&#30340;&#30740;&#31350;&#30456;&#23545;&#36739;&#23569;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#25351;&#25968;&#65292;&#36890;&#36807;&#36716;&#25442;&#39321;&#20892;&#29109;&#26469;&#34913;&#37327;&#21644;&#37327;&#21270;&#21306;&#22359;&#38142;&#22312;&#19981;&#21516;&#26041;&#38754;&#30340;&#21435;&#20013;&#24515;&#21270;&#27700;&#24179;&#12290;&#25105;&#20204;&#36890;&#36807;&#27604;&#36739;&#38745;&#24577;&#27169;&#25311;&#39564;&#35777;&#20102;&#35813;&#25351;&#25968;&#30340;&#21487;&#35299;&#37322;&#24615;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#20854;&#20182;&#25351;&#25968;&#30340;&#23450;&#20041;&#21644;&#35752;&#35770;&#65292;&#21253;&#25324;&#22522;&#23612;&#31995;&#25968;&#12289;&#20013;&#26412;&#32874;&#31995;&#25968;&#21644;&#36203;&#23572;&#26364;-&#36203;&#23572;&#19996;&#25351;&#25968;&#31561;&#12290;&#25105;&#20204;&#30340;&#24037;&#20316;&#27010;&#36848;&#20102;&#24403;&#21069;&#21306;&#22359;&#38142;&#21435;&#20013;&#24515;&#21270;&#30340;&#26223;&#35937;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#37327;&#21270;&#30340;&#24230;&#37327;&#26631;&#20934;&#65292;&#20026;&#26410;&#26469;&#30340;&#30740;&#31350;&#25552;&#20379;&#22522;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;
Blockchain empowers a decentralized economy by enabling distributed trust in a peer-to-peer network. However, surprisingly, a widely accepted definition or measurement of decentralization is still lacking. We explore a systematization of knowledge (SoK) on blockchain decentralization by comprehensively analyzing existing studies in various aspects. First, we establish a taxonomy for analyzing blockchain decentralization in the five facets of consensus, network, governance, wealth, and transaction bu qualitative analysis of existing research. We find relatively little research on aspects other than consensus decentralization. Second, we propose an index that measures and quantifies the decentralization level of blockchain across different facets by transforming Shannon entropy. We verify the explainability of the index via comparative static simulations. We also provide the definition and discussion of alternative indices including the Gini Coefficient, Nakamoto Coefficient, and Herfind
&lt;/p&gt;</description></item></channel></rss>