<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#38431;&#21015;&#30340;&#20869;&#37096;&#27169;&#22411;&#26469;&#35780;&#20272;&#20154;&#21475;&#39118;&#38505;&#65292;&#24182;&#19988;&#25552;&#20379;&#20102;&#19968;&#22871;&#32039;&#20945;&#30340;&#20844;&#24335;&#26469;&#35780;&#20272;&#20445;&#38505;&#32452;&#21512;&#30340;&#27969;&#20837;&#21644;&#27969;&#20986;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#23545;&#24847;&#22806;&#39118;&#38505;&#21644;&#36235;&#21183;&#39118;&#38505;&#30340;&#23457;&#24910;&#36164;&#26412;&#38656;&#27714;&#30340;&#35745;&#31639;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2307.03090</link><description>&lt;p&gt;
&#38754;&#21521;&#20154;&#21475;&#39118;&#38505;&#30340;&#22522;&#20110;&#38431;&#21015;&#30340;&#37096;&#20998;&#20869;&#37096;&#27169;&#22411;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
A cohort-based Partial Internal Model for demographic risk. (arXiv:2307.03090v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.03090
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#38431;&#21015;&#30340;&#20869;&#37096;&#27169;&#22411;&#26469;&#35780;&#20272;&#20154;&#21475;&#39118;&#38505;&#65292;&#24182;&#19988;&#25552;&#20379;&#20102;&#19968;&#22871;&#32039;&#20945;&#30340;&#20844;&#24335;&#26469;&#35780;&#20272;&#20445;&#38505;&#32452;&#21512;&#30340;&#27969;&#20837;&#21644;&#27969;&#20986;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#23545;&#24847;&#22806;&#39118;&#38505;&#21644;&#36235;&#21183;&#39118;&#38505;&#30340;&#23457;&#24910;&#36164;&#26412;&#38656;&#27714;&#30340;&#35745;&#31639;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22312;&#19982; Solvency II &#35201;&#27714;&#30340;&#24066;&#22330;&#19968;&#33268;&#20272;&#20540;&#26694;&#26550;&#20013;&#30740;&#31350;&#20102;&#20154;&#21475;&#39118;&#38505;&#30340;&#23450;&#37327;&#21270;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#22522;&#20110;&#38431;&#21015;&#26041;&#27861;&#35780;&#20272;&#20445;&#38505;&#32452;&#21512;&#30340;&#27969;&#20837;&#21644;&#27969;&#20986;&#30340;&#31616;&#27905;&#20844;&#24335;&#12290;&#22312;&#36825;&#20010;&#32972;&#26223;&#19979;&#65292;&#25105;&#20204;&#20445;&#25345;&#20102;&#26368;&#39640;&#30340;&#19968;&#33324;&#24615;&#65292;&#20197;&#32771;&#34385;&#20256;&#32479;&#20445;&#38505;&#21644;&#32929;&#26435;&#20851;&#32852;&#20445;&#38505;&#65306;&#22240;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#23545;&#36127;&#20538;&#30340;&#24066;&#22330;&#19968;&#33268;&#20272;&#20540;&#12290;&#22312;&#31532;&#20108;&#27493;&#20013;&#65292;&#25105;&#20204;&#35780;&#20272;&#20102;&#19982;&#24847;&#22806;&#27515;&#20129;&#30456;&#20851;&#30340;&#29305;&#24322;&#39118;&#38505;&#65288;&#31216;&#20026;&#24847;&#22806;&#39118;&#38505;&#65289;&#21644;&#31995;&#32479;&#39118;&#38505;&#65288;&#20063;&#31216;&#20026;&#36235;&#21183;&#39118;&#38505;&#65289;&#30340;&#23457;&#24910;&#36164;&#26412;&#38656;&#27714;&#65292;&#20026;&#21069;&#32773;&#25552;&#20379;&#20102;&#24418;&#24335;&#23553;&#38381;&#30340;&#20844;&#24335;&#65292;&#20026;&#21518;&#32773;&#25552;&#20379;&#20102;&#19968;&#20010;&#31639;&#27861;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#24847;&#22806;&#27874;&#21160;&#29575;&#21462;&#20915;&#20110;&#38431;&#21015;&#20445;&#21333;&#30340;&#22266;&#26377;&#29305;&#24615;&#65288;&#39118;&#38505;&#24635;&#39069;&#65289;&#12289;&#20445;&#21333;&#25345;&#26377;&#20154;&#30340;&#24180;&#40836;&#21644;&#20445;&#39069;&#30340;&#21464;&#21160;&#24615;&#65307;&#36235;&#21183;&#39118;&#38505;&#26082;&#21462;&#20915;&#20110;&#24847;&#22806;&#27874;&#21160;&#29575;&#65292;&#20063;&#21462;&#20915;&#20110;&#38271;&#26399;&#30340;&#36235;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate the quantification of demographic risk in a framework consistent with the market-consistent valuation imposed by Solvency II. We provide compact formulas for evaluating inflows and outflows of a portfolio of insurance policies based on a cohort approach. In this context, we maintain the highest level of generality in order to consider both traditional policies and equity-linked policies: therefore, we propose a market-consistent valuation of the liabilities. In the second step we evaluate the Solvency Capital Requirement of the idiosyncratic risk, linked to accidental mortality, and the systematic risk one, also known as trend risk, proposing a formal closed formula for the former and an algorithm for the latter. We show that accidental volatility depends on the intrinsic characteristics of the policies of the cohort (Sums-at-Risk), on the age of the policyholders and on the variability of the sums insured; trend risk depends both on accidental volatility and on the long
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20154;&#26684;&#26159;&#21542;&#24433;&#21709;&#23478;&#24237;&#36164;&#28304;&#20998;&#37197;&#65292;&#24182;&#21457;&#29616;&#20102;&#20004;&#20010;&#24433;&#21709;&#28192;&#36947;&#65306;&#20154;&#26684;&#29305;&#24449;&#30340;&#27700;&#24179;&#20316;&#20026;&#20559;&#22909;&#22240;&#32032;&#22609;&#36896;&#20010;&#20307;&#23545;&#28040;&#36153;&#21697;&#21644;&#20241;&#38386;&#26102;&#38388;&#30340;&#21475;&#21619;&#65292;&#32780;&#37197;&#20598;&#20043;&#38388;&#30340;&#20154;&#26684;&#24046;&#24322;&#21017;&#36890;&#36807;&#24433;&#21709;&#35758;&#20215;&#36807;&#31243;&#26469;&#24433;&#21709;&#36164;&#28304;&#20998;&#37197;&#12290;</title><link>http://arxiv.org/abs/2307.02918</link><description>&lt;p&gt;
&#20154;&#26684;&#26159;&#21542;&#24433;&#21709;&#23478;&#24237;&#36164;&#28304;&#20998;&#37197;&#65311;
&lt;/p&gt;
&lt;p&gt;
Does personality affect the allocation of resources within households?. (arXiv:2307.02918v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.02918
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20154;&#26684;&#26159;&#21542;&#24433;&#21709;&#23478;&#24237;&#36164;&#28304;&#20998;&#37197;&#65292;&#24182;&#21457;&#29616;&#20102;&#20004;&#20010;&#24433;&#21709;&#28192;&#36947;&#65306;&#20154;&#26684;&#29305;&#24449;&#30340;&#27700;&#24179;&#20316;&#20026;&#20559;&#22909;&#22240;&#32032;&#22609;&#36896;&#20010;&#20307;&#23545;&#28040;&#36153;&#21697;&#21644;&#20241;&#38386;&#26102;&#38388;&#30340;&#21475;&#21619;&#65292;&#32780;&#37197;&#20598;&#20043;&#38388;&#30340;&#20154;&#26684;&#24046;&#24322;&#21017;&#36890;&#36807;&#24433;&#21709;&#35758;&#20215;&#36807;&#31243;&#26469;&#24433;&#21709;&#36164;&#28304;&#20998;&#37197;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20154;&#26684;&#26159;&#21542;&#24433;&#21709;&#23478;&#24237;&#36164;&#28304;&#20998;&#37197;&#12290;&#20026;&#20102;&#25506;&#31350;&#36825;&#20010;&#38382;&#39064;&#65292;&#20316;&#32773;&#23558;&#23478;&#24237;&#24314;&#27169;&#20026;&#36827;&#34892; Pareto &#26377;&#25928;&#20998;&#37197;&#24182;&#26681;&#25454;&#20998;&#37197;&#20989;&#25968;&#26469;&#20998;&#37197;&#36164;&#28304;&#30340;&#22827;&#22971;&#12290;&#36890;&#36807;&#20351;&#29992;&#26469;&#33258;&#33655;&#20848;&#33713;&#26031;&#35843;&#26597;&#65288;LISS survey&#65289;&#30340;&#22827;&#22971;&#26679;&#26412;&#65292;&#35813;&#26679;&#26412;&#25552;&#20379;&#20102;&#20851;&#20110;&#28040;&#36153;&#12289;&#21171;&#21160;&#20379;&#32473;&#21644;&#20010;&#20307;&#23618;&#38754;&#30340;&#20154;&#26684;&#29305;&#24449;&#30340;&#35814;&#32454;&#20449;&#24687;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#20154;&#26684;&#36890;&#36807;&#20004;&#20010;&#28192;&#36947;&#24433;&#21709;&#23478;&#24237;&#20869;&#37096;&#30340;&#36164;&#28304;&#20998;&#37197;&#12290;&#39318;&#20808;&#65292;&#36825;&#20123;&#29305;&#24449;&#30340;&#27700;&#24179;&#20316;&#20026;&#20559;&#22909;&#22240;&#32032;&#65292;&#22609;&#36896;&#20010;&#20307;&#23545;&#28040;&#36153;&#21697;&#21644;&#20241;&#38386;&#26102;&#38388;&#30340;&#21475;&#21619;&#12290;&#20854;&#27425;&#65292;&#36890;&#36807;&#27979;&#35797;&#20998;&#24067;&#22240;&#32032;&#30340;&#27604;&#20363;&#24615;&#21644;&#26465;&#20214;&#38656;&#27714;&#31995;&#32479;&#30340;&#25490;&#38500;&#38480;&#21046;&#65292;&#20316;&#32773;&#35266;&#23519;&#21040;&#37197;&#20598;&#20043;&#38388;&#30340;&#20154;&#26684;&#24046;&#24322;&#20316;&#20026;&#20998;&#24067;&#22240;&#32032;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#36825;&#20123;&#20154;&#26684;&#24046;&#24322;&#36890;&#36807;&#24433;&#21709;&#23478;&#24237;&#20869;&#30340;&#35758;&#20215;&#36807;&#31243;&#26469;&#24433;&#21709;&#36164;&#28304;&#20998;&#37197;&#12290;&#20363;&#22914;&#65292;&#30456;&#23545;&#26356;&#26377;&#36131;&#20219;&#24515;&#30340;&#22919;&#22899;&#21487;&#33021;&#20250;&#21463;&#21040;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper examines whether personality influences the allocation of resources within households. To do so, I model households as couples who make Pareto-efficient allocations and divide resources according to a distribution function. Using a sample of Dutch couples from the LISS survey with detailed information on consumption, labor supply, and personality traits at the individual level, I find that personality affects intrahousehold allocations through two channels. Firstly, the level of these traits acts as preference factors that shape individual tastes for consumed goods and leisure time. Secondly, by testing distribution factor proportionality and the exclusion restriction of a conditional demand system, I observe that differences in personality between spouses act as distribution factors. Specifically, these differences in personality impact the allocation of resources by affecting the bargaining process within households. For example, women who are relatively more conscientious
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#31616;&#21333;&#26041;&#27861;&#65292;&#20351;&#29992;&#22522;&#26412;&#30340;&#32447;&#24615;&#20195;&#25968;&#27010;&#24565;&#20840;&#38754;&#19988;&#23450;&#37327;&#22320;&#25429;&#25417;&#32463;&#27982;&#20013;&#25910;&#20837;&#24490;&#29615;&#27969;&#21160;&#30340;&#21160;&#24577;&#65292;&#23545;&#32463;&#27982;&#23398;&#12289;&#29289;&#29702;&#23398;&#21644;&#32463;&#27982;&#29289;&#29702;&#23398;&#23398;&#31185;&#20855;&#26377;&#28145;&#36828;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2307.02713</link><description>&lt;p&gt;
&#19968;&#31181;&#31616;&#21333;&#30340;&#32447;&#24615;&#20195;&#25968;&#26041;&#27861;&#26469;&#25429;&#25417;&#25910;&#20837;&#24490;&#29615;&#27969;&#21160;&#30340;&#21160;&#24577;
&lt;/p&gt;
&lt;p&gt;
A Simple Linear Algebraic Approach to Capture the Dynamics of the Circular Flow of Income. (arXiv:2307.02713v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.02713
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#31616;&#21333;&#26041;&#27861;&#65292;&#20351;&#29992;&#22522;&#26412;&#30340;&#32447;&#24615;&#20195;&#25968;&#27010;&#24565;&#20840;&#38754;&#19988;&#23450;&#37327;&#22320;&#25429;&#25417;&#32463;&#27982;&#20013;&#25910;&#20837;&#24490;&#29615;&#27969;&#21160;&#30340;&#21160;&#24577;&#65292;&#23545;&#32463;&#27982;&#23398;&#12289;&#29289;&#29702;&#23398;&#21644;&#32463;&#27982;&#29289;&#29702;&#23398;&#23398;&#31185;&#20855;&#26377;&#28145;&#36828;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#25991;&#31456;&#30340;&#21807;&#19968;&#30446;&#30340;&#26159;&#24341;&#20837;&#19968;&#31181;&#26032;&#30340;&#12289;&#31616;&#21333;&#20294;&#39640;&#24230;&#26377;&#27934;&#23519;&#21147;&#30340;&#26041;&#27861;&#65292;&#20197;&#20840;&#38754;&#21644;&#23450;&#37327;&#22320;&#25429;&#25417;&#32463;&#27982;&#20013;&#25910;&#20837;&#24490;&#29615;&#27969;&#21160;&#30340;&#21160;&#24577;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#20027;&#35201;&#20381;&#36182;&#20110;&#22522;&#26412;&#30340;&#32447;&#24615;&#20195;&#25968;&#27010;&#24565;&#65292;&#24182;&#23545;&#32463;&#27982;&#23398;&#12289;&#29289;&#29702;&#23398;&#21644;&#32463;&#27982;&#29289;&#29702;&#23398;&#23398;&#31185;&#20855;&#26377;&#28145;&#36828;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
This article has one single purpose: introduce a new and simple, yet highly insightful approach to capture, fully and quantitatively, the dynamics of the circular flow of income in economies. The proposed approach relies mostly on basic linear algebraic concepts and has deep implications for the disciplines of economics, physics and econophysics.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#31038;&#20250;&#36873;&#25321;&#29702;&#35770;&#27169;&#22411;&#65292;&#20197;&#26356;&#20016;&#23500;&#30340;&#35270;&#35282;&#30740;&#31350;&#36807;&#28193;&#24615;&#20195;&#29702;&#36873;&#20030;&#65292;&#24182;&#20998;&#26512;&#20102;&#20854;&#22312;&#20844;&#29702;&#21644;&#25805;&#32437;&#26041;&#38754;&#30340;&#29305;&#28857;&#12290;</title><link>http://arxiv.org/abs/2307.02627</link><description>&lt;p&gt;
&#36807;&#28193;&#24615;&#20195;&#29702;&#36873;&#20030;&#20013;&#30340;&#20195;&#29702;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Proxy Selection in Transitive Proxy Voting. (arXiv:2307.02627v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.02627
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#31038;&#20250;&#36873;&#25321;&#29702;&#35770;&#27169;&#22411;&#65292;&#20197;&#26356;&#20016;&#23500;&#30340;&#35270;&#35282;&#30740;&#31350;&#36807;&#28193;&#24615;&#20195;&#29702;&#36873;&#20030;&#65292;&#24182;&#20998;&#26512;&#20102;&#20854;&#22312;&#20844;&#29702;&#21644;&#25805;&#32437;&#26041;&#38754;&#30340;&#29305;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36807;&#28193;&#24615;&#20195;&#29702;&#36873;&#20030;&#65288;&#25110;"&#27969;&#21160;&#27665;&#20027;"&#65289;&#26159;&#19968;&#31181;&#26032;&#39062;&#30340;&#38598;&#20307;&#20915;&#31574;&#24418;&#24335;&#65292;&#36890;&#24120;&#34987;&#35748;&#20026;&#26159;&#30452;&#25509;&#27665;&#20027;&#21644;&#20195;&#35758;&#21046;&#30340;&#26377;&#21560;&#24341;&#21147;&#30340;&#28151;&#21512;&#24418;&#24335;&#12290;&#23613;&#31649;&#27969;&#21160;&#27665;&#20027;&#30340;&#29702;&#24565;&#33719;&#24471;&#20102;&#24191;&#27867;&#25903;&#25345;&#65292;&#20294;&#23545;&#20854;&#36827;&#34892;&#27491;&#24335;&#24314;&#27169;&#30340;&#23581;&#35797;&#30456;&#23545;&#36739;&#23569;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19977;&#20010;&#20027;&#35201;&#36129;&#29486;&#12290;&#39318;&#20808;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#31038;&#20250;&#36873;&#25321;&#29702;&#35770;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#22312;&#36873;&#27665;&#36873;&#25321;&#20195;&#29702;&#30340;&#36807;&#31243;&#20013;&#37319;&#29992;&#20102;&#26356;&#20016;&#23500;&#30340;&#27491;&#24335;&#35266;&#28857;&#12290;&#20854;&#27425;&#65292;&#20174;&#20844;&#29702;&#30340;&#35282;&#24230;&#23457;&#35270;&#35813;&#27169;&#22411;&#65292;&#35777;&#26126;&#20102;&#65288;a&#65289;&#19968;&#20010;&#20851;&#20110;&#20195;&#29702;&#25237;&#31080;&#30340;May&#23450;&#29702;&#30340;&#31867;&#27604;&#21644;&#65288;b&#65289;&#20195;&#29702;&#25237;&#31080;&#35774;&#32622;&#20013;&#20851;&#20110;&#21333;&#35843;&#24615;&#23646;&#24615;&#30340;&#19981;&#21487;&#33021;&#24615;&#32467;&#26524;&#12290;&#31532;&#19977;&#65292;&#25506;&#35752;&#20102;&#36807;&#28193;&#24615;&#20195;&#29702;&#25237;&#31080;&#20013;&#30340;&#25805;&#32437;&#38382;&#39064;&#12290;&#23450;&#20041;&#20102;&#20195;&#29702;&#25237;&#31080;&#35774;&#32622;&#19979;&#30340;&#20004;&#31181;&#29305;&#23450;&#24418;&#24335;&#30340;&#25805;&#32437;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;&#22312;&#20195;&#29702;&#25237;&#31080;&#20013;&#25805;&#32437;&#21457;&#29983;&#30340;&#24773;&#20917;&#27604;&#20256;&#32479;&#36873;&#20030;&#20013;&#26356;&#22810;&#12290;
&lt;/p&gt;
&lt;p&gt;
Transitive proxy voting (or "liquid democracy") is a novel form of collective decision making, often framed as an attractive hybrid of direct and representative democracy. Although the ideas behind liquid democracy have garnered widespread support, there have been relatively few attempts to model it formally. This paper makes three main contributions. First, it proposes a new social choice-theoretic model of liquid democracy, which is distinguished by taking a richer formal perspective on the process by which a voter chooses a proxy. Second, it examines the model from an axiomatic perspective, proving (a) a proxy vote analogue of May's Theorem and (b) an impossibility result concerning monotonicity properties in a proxy vote setting. Third, it explores the topic of manipulation in transitive proxy votes. Two forms of manipulation specific to the proxy vote setting are defined, and it is shown that manipulation occurs in strictly more cases in proxy votes than in classical votes.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#22120;&#65292;&#29992;&#20110;&#20174;&#31163;&#25955;&#35266;&#27979;&#20013;&#27979;&#37327;&#36830;&#32493;&#36712;&#36857;&#30340;&#31895;&#31961;&#25351;&#25968;&#65292;&#35813;&#20272;&#35745;&#22120;&#36866;&#29992;&#20110;&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#30340;&#20272;&#35745;&#65292;&#24182;&#22312;&#22823;&#22810;&#25968;&#20998;&#25968;&#24067;&#26391;&#36816;&#21160;&#26679;&#26412;&#36335;&#24452;&#20013;&#25910;&#25947;&#12290;</title><link>http://arxiv.org/abs/2307.02582</link><description>&lt;p&gt;
&#20174;&#31163;&#25955;&#23454;&#29616;&#26041;&#24046;&#30340;&#35266;&#27979;&#20013;&#20272;&#35745;&#38543;&#26426;&#27874;&#21160;&#30340;&#31895;&#31961;&#25351;&#25968;
&lt;/p&gt;
&lt;p&gt;
Estimating the roughness exponent of stochastic volatility from discrete observations of the realized variance. (arXiv:2307.02582v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.02582
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#22120;&#65292;&#29992;&#20110;&#20174;&#31163;&#25955;&#35266;&#27979;&#20013;&#27979;&#37327;&#36830;&#32493;&#36712;&#36857;&#30340;&#31895;&#31961;&#25351;&#25968;&#65292;&#35813;&#20272;&#35745;&#22120;&#36866;&#29992;&#20110;&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#30340;&#20272;&#35745;&#65292;&#24182;&#22312;&#22823;&#22810;&#25968;&#20998;&#25968;&#24067;&#26391;&#36816;&#21160;&#26679;&#26412;&#36335;&#24452;&#20013;&#25910;&#25947;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#22312;&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#20013;&#20272;&#35745;&#27874;&#21160;&#24615;&#30340;&#31895;&#31961;&#24230;&#65292;&#35813;&#27169;&#22411;&#26159;&#20316;&#20026;&#20998;&#25968;&#24067;&#26391;&#36816;&#21160;&#65288;&#24102;&#28418;&#31227;&#65289;&#30340;&#38750;&#32447;&#24615;&#20989;&#25968;&#32780;&#20135;&#29983;&#30340;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#24341;&#20837;&#19968;&#20010;&#26032;&#30340;&#20272;&#35745;&#37327;&#65292;&#35813;&#20272;&#35745;&#37327;&#27979;&#37327;&#36830;&#32493;&#36712;&#36857;&#30340;&#25152;&#35859;&#31895;&#31961;&#25351;&#25968;&#65292;&#22522;&#20110;&#20854;&#21407;&#20989;&#25968;&#30340;&#31163;&#25955;&#35266;&#27979;&#12290;&#25105;&#20204;&#32473;&#20986;&#20102;&#23545;&#20110;&#22522;&#30784;&#36712;&#36857;&#30340;&#26465;&#20214;&#65292;&#22312;&#36825;&#20123;&#26465;&#20214;&#19979;&#65292;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#20197;&#20005;&#26684;&#36335;&#24452;&#26041;&#24335;&#25910;&#25947;&#12290;&#28982;&#21518;&#25105;&#20204;&#39564;&#35777;&#20102;&#36825;&#20123;&#26465;&#20214;&#22312;&#20960;&#20046;&#27599;&#20010;&#20998;&#25968;&#24067;&#26391;&#36816;&#21160;&#65288;&#24102;&#28418;&#31227;&#65289;&#26679;&#26412;&#36335;&#24452;&#20013;&#37117;&#24471;&#21040;&#28385;&#36275;&#12290;&#20316;&#20026;&#32467;&#26524;&#65292;&#22312;&#22823;&#31867;&#31895;&#27874;&#21160;&#27169;&#22411;&#30340;&#32972;&#26223;&#19979;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#24378;&#19968;&#33268;&#24615;&#23450;&#29702;&#12290;&#25968;&#20540;&#27169;&#25311;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#32463;&#36807;&#25105;&#20204;&#20272;&#35745;&#22120;&#30340;&#23610;&#24230;&#19981;&#21464;&#20462;&#25913;&#21518;&#65292;&#25105;&#20204;&#30340;&#20272;&#35745;&#31243;&#24207;&#34920;&#29616;&#33391;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the problem of estimating the roughness of the volatility in a stochastic volatility model that arises as a nonlinear function of fractional Brownian motion with drift. To this end, we introduce a new estimator that measures the so-called roughness exponent of a continuous trajectory, based on discrete observations of its antiderivative. We provide conditions on the underlying trajectory under which our estimator converges in a strictly pathwise sense. Then we verify that these conditions are satisfied by almost every sample path of fractional Brownian motion (with drift). As a consequence, we obtain strong consistency theorems in the context of a large class of rough volatility models. Numerical simulations show that our estimation procedure performs well after passing to a scale-invariant modification of our estimator.
&lt;/p&gt;</description></item><item><title>Deffuant&#27169;&#22411;&#24212;&#29992;&#20110;&#36135;&#24065;&#20132;&#25442;&#65292;&#30740;&#31350;&#20102;&#22914;&#20309;&#23454;&#29616;&#28176;&#36817;&#31283;&#23450;&#24615;&#21644;&#36130;&#23500;&#22343;&#31561;&#12290;</title><link>http://arxiv.org/abs/2307.02512</link><description>&lt;p&gt;
Deffuant&#27169;&#22411;&#22312;&#36135;&#24065;&#20132;&#25442;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Application of the Deffuant model in money exchange. (arXiv:2307.02512v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.02512
&lt;/p&gt;
&lt;p&gt;
Deffuant&#27169;&#22411;&#24212;&#29992;&#20110;&#36135;&#24065;&#20132;&#25442;&#65292;&#30740;&#31350;&#20102;&#22914;&#20309;&#23454;&#29616;&#28176;&#36817;&#31283;&#23450;&#24615;&#21644;&#36130;&#23500;&#22343;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36135;&#24065;&#20132;&#26131;&#28041;&#21450;&#21040;&#20080;&#26041;&#21644;&#21334;&#26041;&#12290;&#20080;&#26041;&#20174;&#21334;&#26041;&#36141;&#20080;&#21830;&#21697;&#25110;&#26381;&#21153;&#12290;&#20080;&#26041;&#20943;&#23569;&#30340;&#37329;&#39069;&#19982;&#21334;&#26041;&#22686;&#21152;&#30340;&#37329;&#39069;&#30456;&#21516;&#12290;&#22312;&#27599;&#20010;&#26102;&#38388;&#27493;&#39588;&#20013;&#65292;&#36873;&#25321;&#19968;&#23545;&#31038;&#20250;&#30456;&#36830;&#30340;&#20195;&#29702;&#20154;&#36827;&#34892;&#20132;&#26131;&#12290;&#25105;&#20204;&#23558;Deffuant&#27169;&#22411;&#28436;&#21270;&#20026;&#19968;&#20010;&#36135;&#24065;&#20132;&#25442;&#31995;&#32479;&#65292;&#24182;&#30740;&#31350;&#22312;&#20309;&#31181;&#24773;&#20917;&#19979;&#21487;&#20197;&#23454;&#29616;&#28176;&#36817;&#31283;&#23450;&#24615;&#65292;&#25110;&#23454;&#29616;&#36130;&#23500;&#22343;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;
A money transfer involves a buyer and a seller. A buyer buys goods or services from a seller. The money the buyer decreases is the same as that the seller increases. At each time step, a pair of socially connected agents are selected and transact in agreed money. We evolve the Deffuant model to a money exchange system and study circumstances under which asymptotic stability holds, or equal wealth can be achieved.
&lt;/p&gt;</description></item><item><title>&#24310;&#36831;&#36864;&#20241;&#20844;&#21578;&#23545;&#20013;&#22269;&#23478;&#24237;&#30340;&#20648;&#33988;&#29575;&#20135;&#29983;&#20102;&#26174;&#33879;&#30340;&#24433;&#21709;&#65292;&#29305;&#21035;&#26159;&#23545;&#39640;&#25910;&#20837;&#23478;&#24237;&#12290;&#36825;&#31181;&#24433;&#21709;&#19982;&#20154;&#20204;&#23545;&#26410;&#26469;&#20859;&#32769;&#37329;&#25910;&#20837;&#30340;&#36127;&#38754;&#39044;&#26399;&#26377;&#20851;&#12290;</title><link>http://arxiv.org/abs/2307.02455</link><description>&lt;p&gt;
&#25919;&#31574;&#39044;&#26399;&#26377;&#20851;&#21527;&#65311;&#24310;&#36831;&#36864;&#20241;&#20844;&#21578;&#23545;&#22478;&#24066;&#23478;&#24237;&#20648;&#33988;&#29575;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Policy Expectation Counts? The Impact of Delayed Retirement Announcement on Urban Households Savings Rates. (arXiv:2307.02455v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.02455
&lt;/p&gt;
&lt;p&gt;
&#24310;&#36831;&#36864;&#20241;&#20844;&#21578;&#23545;&#20013;&#22269;&#23478;&#24237;&#30340;&#20648;&#33988;&#29575;&#20135;&#29983;&#20102;&#26174;&#33879;&#30340;&#24433;&#21709;&#65292;&#29305;&#21035;&#26159;&#23545;&#39640;&#25910;&#20837;&#23478;&#24237;&#12290;&#36825;&#31181;&#24433;&#21709;&#19982;&#20154;&#20204;&#23545;&#26410;&#26469;&#20859;&#32769;&#37329;&#25910;&#20837;&#30340;&#36127;&#38754;&#39044;&#26399;&#26377;&#20851;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;&#20013;&#22269;&#23478;&#24237;&#36861;&#36394;&#35843;&#26597;&#25968;&#25454;&#65292;&#30740;&#31350;&#20102;&#24310;&#36831;&#36864;&#20241;&#20844;&#21578;&#23545;&#23478;&#24237;&#20648;&#33988;&#34892;&#20026;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#21463;&#21040;&#25919;&#31574;&#20844;&#21578;&#24433;&#21709;&#30340;&#23478;&#24237;&#30340;&#20648;&#33988;&#29575;&#24179;&#22343;&#22686;&#21152;&#20102;8%&#12290;&#36825;&#20010;&#20272;&#35745;&#32467;&#26524;&#26174;&#33879;&#19988;&#31283;&#20581;&#12290;&#19981;&#21516;&#31867;&#22411;&#30340;&#23478;&#24237;&#23545;&#25919;&#31574;&#20844;&#21578;&#30340;&#21709;&#24212;&#31243;&#24230;&#19981;&#21516;&#65292;&#39640;&#25910;&#20837;&#23478;&#24237;&#30340;&#24433;&#21709;&#26356;&#22823;&#12290;&#23478;&#24237;&#20648;&#33988;&#30340;&#22686;&#21152;&#21487;&#20197;&#24402;&#22240;&#20110;&#23545;&#26410;&#26469;&#20859;&#32769;&#37329;&#25910;&#20837;&#30340;&#36127;&#38754;&#39044;&#26399;&#12290;
&lt;/p&gt;
&lt;p&gt;
This article examines the effects of a delayed retirement announcement on households' savings behavior using data from China Family Panel Studies (CFPS). The article finds that treated households, on average, experience an 8% increase in savings rates as a result of the policy announcement. This estimation is both significant and robust. Different types of households exhibit varying degrees of responsiveness to the policy announcement, with higher-income households showing a greater impact. The increase in household savings can be attributed to negative perceptions about future pension income.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#19978;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65288;LPs&#65289;&#39057;&#32321;&#26356;&#26032;&#20301;&#32622;&#23545;&#24066;&#22330;&#27969;&#21160;&#24615;&#38598;&#20013;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#26356;&#39640;&#30340;&#37325;&#26032;&#23450;&#20301;&#24378;&#24230;&#21644;&#31934;&#24230;&#20250;&#23548;&#33268;&#26356;&#22823;&#30340;&#27969;&#21160;&#24615;&#38598;&#20013;&#65292;&#20174;&#32780;&#20943;&#23569;&#23567;&#39069;&#20132;&#26131;&#30340;&#28369;&#28857;&#12290;</title><link>http://arxiv.org/abs/2306.17742</link><description>&lt;p&gt;
&#21306;&#22359;&#38142;&#30340;&#25193;&#23481;&#21644;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#19978;&#30340;&#27969;&#21160;&#24615;&#38598;&#20013;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Blockchain scaling and liquidity concentration on decentralized exchanges. (arXiv:2306.17742v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.17742
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#19978;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65288;LPs&#65289;&#39057;&#32321;&#26356;&#26032;&#20301;&#32622;&#23545;&#24066;&#22330;&#27969;&#21160;&#24615;&#38598;&#20013;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#26356;&#39640;&#30340;&#37325;&#26032;&#23450;&#20301;&#24378;&#24230;&#21644;&#31934;&#24230;&#20250;&#23548;&#33268;&#26356;&#22823;&#30340;&#27969;&#21160;&#24615;&#38598;&#20013;&#65292;&#20174;&#32780;&#20943;&#23569;&#23567;&#39069;&#20132;&#26131;&#30340;&#28369;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#19978;&#30340;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65288;LPs&#65289;&#21487;&#20197;&#36890;&#36807;&#26356;&#39057;&#32321;&#22320;&#26356;&#26032;&#20854;&#20301;&#32622;&#26469;&#20445;&#25252;&#33258;&#24049;&#20813;&#21463;&#36870;&#21521;&#36873;&#25321;&#39118;&#38505;&#30340;&#24433;&#21709;&#12290;&#28982;&#32780;&#65292;&#37325;&#26032;&#23450;&#20301;&#26159;&#26114;&#36149;&#30340;&#65292;&#22240;&#20026;LPs&#24517;&#39035;&#20026;&#27599;&#27425;&#26356;&#26032;&#25903;&#20184;&#29123;&#27668;&#36153;&#29992;&#12290;&#25105;&#20204;&#20351;&#29992;&#19968;&#20010;&#21306;&#22359;&#38142;&#25193;&#23481;&#35299;&#20915;&#26041;&#26696;Polygon&#30340;&#36827;&#20837;&#20316;&#20026;&#25105;&#20204;&#30340;&#24037;&#20855;&#65292;&#20998;&#26512;&#20102;&#37325;&#26032;&#23450;&#20301;&#19982;&#24066;&#22330;&#20215;&#26684;&#21608;&#22260;&#30340;&#27969;&#21160;&#24615;&#38598;&#20013;&#20043;&#38388;&#30340;&#22240;&#26524;&#20851;&#31995;&#12290;Polygon&#30340;&#20302;&#29123;&#27668;&#36153;&#29992;&#20351;&#24471;LPs&#33021;&#22815;&#27604;&#22312;&#20197;&#22826;&#22346;&#19978;&#26356;&#39057;&#32321;&#22320;&#36827;&#34892;&#26356;&#26032;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#26356;&#39640;&#30340;&#37325;&#26032;&#23450;&#20301;&#24378;&#24230;&#21644;&#31934;&#24230;&#23548;&#33268;&#26356;&#22823;&#30340;&#27969;&#21160;&#24615;&#38598;&#20013;&#65292;&#36825;&#26377;&#21033;&#20110;&#23567;&#39069;&#20132;&#26131;&#36890;&#36807;&#20943;&#23569;&#28369;&#28857;&#26469;&#21463;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;
Liquidity providers (LPs) on decentralized exchanges (DEXs) can protect themselves from adverse selection risk by updating their positions more frequently. However, repositioning is costly, because LPs have to pay gas fees for each update. We analyze the causal relation between repositioning and liquidity concentration around the market price, using the entry of a blockchain scaling solution, Polygon, as our instrument. Polygon's lower gas fees allow LPs to update more frequently than on Ethereum. Our results demonstrate that higher repositioning intensity and precision lead to greater liquidity concentration, which benefits small trades by reducing their slippage.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#24191;&#20041; LMF &#27169;&#22411;&#65292;&#32771;&#34385;&#21040;&#20102;&#20132;&#26131;&#32773;&#30340;&#35746;&#21333;&#25286;&#20998;&#34892;&#20026;&#30340;&#24322;&#36136;&#24615;&#65292;&#23545;&#35813;&#27169;&#22411;&#36827;&#34892;&#20102;&#31934;&#30830;&#27714;&#35299;&#65292;&#21457;&#29616;&#35746;&#21333;&#31526;&#21495; ACF &#20013;&#24130;&#24459;&#25351;&#25968;&#31283;&#20581;&#65292;&#20294;&#21069;&#32622;&#22240;&#23376;&#23545;&#20132;&#26131;&#31574;&#30053;&#24322;&#36136;&#24615;&#26497;&#20026;&#25935;&#24863;&#24182;&#22312;&#21516;&#36136; LMF &#27169;&#22411;&#20013;&#34987;&#20302;&#20272;&#12290;</title><link>http://arxiv.org/abs/2306.13378</link><description>&lt;p&gt;
&#20855;&#26377;&#24322;&#36136;&#24615;&#35746;&#21333;&#25286;&#20998;&#31574;&#30053;&#30340;&#19968;&#33324;&#21270; Lillo-Mike-Farmer &#27169;&#22411;&#30340;&#31934;&#30830;&#35299;
&lt;/p&gt;
&lt;p&gt;
Exact solution to a generalised Lillo-Mike-Farmer model with heterogeneous order-splitting strategies. (arXiv:2306.13378v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.13378
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#24191;&#20041; LMF &#27169;&#22411;&#65292;&#32771;&#34385;&#21040;&#20102;&#20132;&#26131;&#32773;&#30340;&#35746;&#21333;&#25286;&#20998;&#34892;&#20026;&#30340;&#24322;&#36136;&#24615;&#65292;&#23545;&#35813;&#27169;&#22411;&#36827;&#34892;&#20102;&#31934;&#30830;&#27714;&#35299;&#65292;&#21457;&#29616;&#35746;&#21333;&#31526;&#21495; ACF &#20013;&#24130;&#24459;&#25351;&#25968;&#31283;&#20581;&#65292;&#20294;&#21069;&#32622;&#22240;&#23376;&#23545;&#20132;&#26131;&#31574;&#30053;&#24322;&#36136;&#24615;&#26497;&#20026;&#25935;&#24863;&#24182;&#22312;&#21516;&#36136; LMF &#27169;&#22411;&#20013;&#34987;&#20302;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Lillo-Mike-Farmer&#65288;LMF&#65289;&#27169;&#22411;&#26159;&#19968;&#20010;&#19982;&#32463;&#27982;&#29289;&#29702;&#23398;&#30456;&#20851;&#30340;&#27169;&#22411;&#65292;&#25551;&#36848;&#26426;&#26500;&#25237;&#36164;&#32773;&#22312;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#35746;&#21333;&#25286;&#20998;&#34892;&#20026;&#12290;LMF &#20551;&#35774;&#20132;&#26131;&#32773;&#30340;&#35746;&#21333;&#25286;&#20998;&#31574;&#30053;&#26159;&#21516;&#36136;&#30340;&#65292;&#24182;&#22522;&#20110;&#20960;&#31181;&#21551;&#21457;&#24335;&#25512;&#29702;&#23548;&#20986;&#20102;&#35746;&#21333;&#31526;&#21495;&#33258;&#30456;&#20851;&#20989;&#25968;&#65288;ACF&#65289;&#30340;&#24130;&#24459;&#28176;&#36817;&#35299;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#24191;&#20041; LMF &#27169;&#22411;&#65292;&#36890;&#36807;&#23558;&#20132;&#26131;&#32773;&#30340;&#35746;&#21333;&#25286;&#20998;&#34892;&#20026;&#24322;&#36136;&#21270;&#65292;&#23545;&#35813;&#27169;&#22411;&#36827;&#34892;&#20102;&#31934;&#30830;&#27714;&#35299;&#19988;&#26080;&#38656;&#24341;&#20837;&#21551;&#21457;&#24335;&#26041;&#27861;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#35746;&#21333;&#31526;&#21495;ACF&#20013;&#30340;&#24130;&#24459;&#25351;&#25968;&#23545;&#20110;&#20219;&#24847;&#24322;&#36136;&#30340;&#24378;&#24230;&#20998;&#24067;&#26159;&#31283;&#20581;&#30340;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;ACF&#20013;&#30340;&#21069;&#32622;&#22240;&#23376;&#23545;&#20132;&#26131;&#31574;&#30053;&#30340;&#24322;&#36136;&#24615;&#38750;&#24120;&#25935;&#24863;&#65292;&#24182;&#19988;&#22312;&#21407;&#22987;&#21516;&#36136; LMF &#27169;&#22411;&#20013;&#34987;&#31995;&#32479;&#22320;&#20302;&#20272;&#12290;&#25105;&#20204;&#30340;&#24037;&#20316;&#24378;&#35843;&#65292;&#22312;&#35299;&#37322;ACF&#21069;&#32622;&#22240;&#23376;&#26041;&#38754;&#38656;&#35201;&#26356;&#21152;&#23567;&#24515;&#35880;&#24910;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Lillo-Mike-Farmer (LMF) model is an established econophysics model describing the order-splitting behaviour of institutional investors in financial markets. In the original article (LMF, Physical Review E 71, 066122 (2005)), LMF assumed the homogeneity of the traders' order-splitting strategy and derived a power-law asymptotic solution to the order-sign autocorrelation function (ACF) based on several heuristic reasonings. This report proposes a generalised LMF model by incorporating the heterogeneity of traders' order-splitting behaviour that is exactly solved without heuristics. We find that the power-law exponent in the order-sign ACF is robust for arbitrary heterogeneous intensity distributions. On the other hand, the prefactor in the ACF is very sensitive to heterogeneity in trading strategies and is shown to be systematically underestimated in the original homogeneous LMF model. Our work highlights that the ACF prefactor should be more carefully interpreted than the ACF power-
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;</title><link>http://arxiv.org/abs/2302.13426</link><description>&lt;p&gt;
&#26399;&#26435;&#30340;&#20215;&#26684;&#21457;&#29616;
&lt;/p&gt;
&lt;p&gt;
Price Discovery for Derivatives. (arXiv:2302.13426v5 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13426
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#19968;&#20010;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#31169;&#26377;&#20449;&#24687;&#21644;&#39640;&#38454;&#20449;&#24687;&#23545;&#26399;&#26435;&#24066;&#22330;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#27169;&#22411;&#20801;&#35768;&#26377;&#31169;&#26377;&#20449;&#24687;&#30340;&#20132;&#26131;&#32773;&#22312;&#29366;&#24577;-&#32034;&#36180;&#38598;&#24066;&#22330;&#19978;&#20132;&#26131;&#12290;&#31561;&#20215;&#30340;&#26399;&#26435;&#24418;&#24335;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#25317;&#26377;&#20851;&#20110;&#22522;&#30784;&#36164;&#20135;&#25910;&#30410;&#30340;&#20998;&#24067;&#30340;&#31169;&#26377;&#20449;&#24687;&#65292;&#24182;&#20801;&#35768;&#20132;&#26131;&#20219;&#24847;&#26399;&#26435;&#32452;&#21512;&#30340;&#25805;&#32437;&#32773;&#12290;&#25105;&#20204;&#24471;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#65292;&#36825;&#20123;&#35299;&#25552;&#20379;&#20102;&#20851;&#20110;&#20869;&#24149;&#20132;&#26131;&#30340;&#39640;&#38454;&#20449;&#24687;&#65292;&#22914;&#20219;&#20309;&#32473;&#23450;&#30340;&#26102;&#21051;&#20132;&#26131;&#26399;&#26435;&#31574;&#30053;&#65292;&#24182;&#23558;&#36825;&#20123;&#31574;&#30053;&#27867;&#21270;&#21040;&#20102;&#27874;&#21160;&#29575;&#20132;&#26131;&#31561;&#23454;&#36341;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;
We obtain a basic theory of price discovery across derivative markets with respect to higher-order information, using a model where an agent with general private information regarding state probabilities is allowed to trade arbitrary portfolios of state-contingent claims. In an equivalent options formulation, the informed agent has private information regarding arbitrary aspects of the payoff distribution of an underlying asset and is allowed to trade arbitrary option portfolios. We characterize, in closed form, the informed demand, price impact, and information efficiency of prices. Our results offer a theory of insider trading on higher moments of the underlying payoff as a special case. The informed demand formula prescribes option strategies for trading on any given moment and extends those used in practice for, e.g. volatility trading.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24212;&#29992;&#20271;&#24681;&#26031;&#22374;&#22312;&#32447;&#32858;&#21512;&#65288;BOA&#65289;&#26041;&#27861;&#65292;&#23558;&#19981;&#21516;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#20010;&#32929;&#25910;&#30410;&#39044;&#27979;&#32467;&#21512;&#25104;&#22810;&#31354;&#31574;&#30053;&#30340;&#26500;&#24314;&#12290;&#19987;&#23478;&#22312;&#32447;&#32858;&#21512;&#22312;&#38750;&#24179;&#31283;&#29615;&#22659;&#19979;&#34920;&#29616;&#20986;&#26377;&#21560;&#24341;&#21147;&#30340;&#25237;&#36164;&#32452;&#21512;&#34920;&#29616;&#65292;&#32988;&#36807;&#21333;&#29420;&#30340;&#31639;&#27861;&#65292;&#24182;&#25552;&#20986;&#20102;&#25193;&#23637;&#26041;&#27861;&#20197;&#25913;&#21892;&#25972;&#20307;&#28151;&#21512;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2111.15365</link><description>&lt;p&gt;
&#37329;&#34701;&#39044;&#27979;&#30340;&#19987;&#23478;&#32858;&#21512;
&lt;/p&gt;
&lt;p&gt;
Expert Aggregation for Financial Forecasting. (arXiv:2111.15365v4 [q-fin.ST] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2111.15365
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24212;&#29992;&#20271;&#24681;&#26031;&#22374;&#22312;&#32447;&#32858;&#21512;&#65288;BOA&#65289;&#26041;&#27861;&#65292;&#23558;&#19981;&#21516;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#20010;&#32929;&#25910;&#30410;&#39044;&#27979;&#32467;&#21512;&#25104;&#22810;&#31354;&#31574;&#30053;&#30340;&#26500;&#24314;&#12290;&#19987;&#23478;&#22312;&#32447;&#32858;&#21512;&#22312;&#38750;&#24179;&#31283;&#29615;&#22659;&#19979;&#34920;&#29616;&#20986;&#26377;&#21560;&#24341;&#21147;&#30340;&#25237;&#36164;&#32452;&#21512;&#34920;&#29616;&#65292;&#32988;&#36807;&#21333;&#29420;&#30340;&#31639;&#27861;&#65292;&#24182;&#25552;&#20986;&#20102;&#25193;&#23637;&#26041;&#27861;&#20197;&#25913;&#21892;&#25972;&#20307;&#28151;&#21512;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19987;&#27880;&#20110;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#39044;&#27979;&#30340;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#24341;&#36215;&#20102;&#24456;&#22810;&#20851;&#27880;&#12290;&#20294;&#26159;&#65292;&#22312;&#22810;&#20010;&#31639;&#27861;&#20043;&#38388;&#36827;&#34892;&#36873;&#25321;&#21487;&#33021;&#24456;&#20855;&#26377;&#25361;&#25112;&#24615;&#65292;&#22240;&#20026;&#23427;&#20204;&#30340;&#20272;&#35745;&#20934;&#30830;&#24615;&#21487;&#33021;&#38543;&#26102;&#38388;&#32780;&#19981;&#31283;&#23450;&#12290;&#19987;&#23478;&#22312;&#32447;&#32858;&#21512;&#23558;&#26377;&#38480;&#38598;&#21512;&#27169;&#22411;&#30340;&#39044;&#27979;&#32467;&#21512;&#22312;&#19968;&#20010;&#21333;&#19968;&#30340;&#26041;&#27861;&#20013;&#65292;&#32780;&#19981;&#23545;&#27169;&#22411;&#20570;&#20219;&#20309;&#20551;&#35774;&#12290;&#26412;&#25991;&#23558;&#20271;&#24681;&#26031;&#22374;&#22312;&#32447;&#32858;&#21512;&#65288;BOA&#65289;&#31243;&#24207;&#24212;&#29992;&#20110;&#30001;&#19981;&#21516;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#29983;&#25104;&#30340;&#20010;&#32929;&#25910;&#30410;&#39044;&#27979;&#26500;&#24314;&#30340;&#22810;&#31354;&#31574;&#30053;&#30340;&#26500;&#24314;&#20013;&#12290;&#19987;&#23478;&#22312;&#32447;&#32858;&#21512;&#22312;&#38750;&#24179;&#31283;&#29615;&#22659;&#19979;&#20063;&#33021;&#20135;&#29983;&#26377;&#21560;&#24341;&#21147;&#30340;&#25237;&#36164;&#32452;&#21512;&#34920;&#29616;&#12290;&#32858;&#21512;&#26041;&#27861;&#32988;&#36807;&#21333;&#29420;&#30340;&#31639;&#27861;&#65292;&#22312;&#25237;&#36164;&#32452;&#21512;&#22799;&#26222;&#27604;&#29575;&#36739;&#39640;&#12289;&#20111;&#25439;&#36739;&#20302;&#65292;&#24182;&#19988;&#25442;&#25163;&#29575;&#30456;&#20284;&#12290;&#36824;&#25552;&#20986;&#20102;&#19987;&#23478;&#21644;&#32858;&#21512;&#29305;&#21270;&#30340;&#25193;&#23637;&#65292;&#20197;&#25913;&#21892;&#25972;&#20307;&#28151;&#21512;&#22312;&#19968;&#26063;&#25237;&#36164;&#32452;&#21512;&#35780;&#20272;&#25351;&#26631;&#19978;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Machine learning algorithms dedicated to financial time series forecasting have gained a lot of interest. But choosing between several algorithms can be challenging, as their estimation accuracy may be unstable over time. Online aggregation of experts combine the forecasts of a finite set of models in a single approach without making any assumption about the models. In this paper, a Bernstein Online Aggregation (BOA) procedure is applied to the construction of long-short strategies built from individual stock return forecasts coming from different machine learning models. The online mixture of experts leads to attractive portfolio performances even in environments characterised by non-stationarity. The aggregation outperforms individual algorithms, offering a higher portfolio Sharpe Ratio, lower shortfall, with a similar turnover. Extensions to expert and aggregation specialisations are also proposed to improve the overall mixture on a family of portfolio evaluation metrics.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#38024;&#23545;&#38543;&#26426;Volterra&#31215;&#20998;&#26041;&#31243;&#30340;&#31435;&#26041;&#35745;&#31639;&#26041;&#27861;&#65292;&#24182;&#25552;&#20379;&#20102;&#20854;&#35823;&#24046;&#20272;&#35745;&#32467;&#26524;&#12290;&#25968;&#20540;&#31034;&#20363;&#34920;&#26126;&#65292;&#22312;&#28385;&#36275;&#19968;&#23450;&#26465;&#20214;&#26102;&#65292;&#31435;&#26041;&#26041;&#27861;&#27604;Euler&#26041;&#26696;&#26356;&#39640;&#25928;&#12290;</title><link>http://arxiv.org/abs/2110.12853</link><description>&lt;p&gt;
&#38024;&#23545;&#38543;&#26426;Volterra&#31215;&#20998;&#26041;&#31243;&#30340;&#31435;&#26041;&#35745;&#31639;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Cubature Method for Stochastic Volterra Integral Equations. (arXiv:2110.12853v4 [math.PR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2110.12853
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#38024;&#23545;&#38543;&#26426;Volterra&#31215;&#20998;&#26041;&#31243;&#30340;&#31435;&#26041;&#35745;&#31639;&#26041;&#27861;&#65292;&#24182;&#25552;&#20379;&#20102;&#20854;&#35823;&#24046;&#20272;&#35745;&#32467;&#26524;&#12290;&#25968;&#20540;&#31034;&#20363;&#34920;&#26126;&#65292;&#22312;&#28385;&#36275;&#19968;&#23450;&#26465;&#20214;&#26102;&#65292;&#31435;&#26041;&#26041;&#27861;&#27604;Euler&#26041;&#26696;&#26356;&#39640;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#38024;&#23545;&#38543;&#26426;Volterra&#31215;&#20998;&#26041;&#31243;&#30340;&#31435;&#26041;&#35745;&#31639;&#20844;&#24335;&#12290;&#25105;&#20204;&#39318;&#20808;&#21033;&#29992;&#19968;&#20010;&#20989;&#25968;Ito&#20844;&#24335;&#23548;&#20986;&#20102;&#22312;&#36825;&#20010;&#35774;&#32622;&#19979;&#30340;&#38543;&#26426;&#27888;&#21202;&#23637;&#24320;&#24335;&#65292;&#24182;&#32473;&#20986;&#20102;&#20854;&#23614;&#37096;&#20272;&#35745;&#12290;&#28982;&#21518;&#25105;&#20204;&#20171;&#32461;&#20102;&#36825;&#20123;&#26041;&#31243;&#30340;&#31435;&#26041;&#27979;&#24230;&#65292;&#24182;&#22312;&#19968;&#20123;&#29305;&#27530;&#24773;&#20917;&#19979;&#26126;&#30830;&#26500;&#36896;&#23427;&#65292;&#21253;&#25324;&#38271;&#35760;&#24518;&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#12290;&#25105;&#20204;&#23558;&#20005;&#26684;&#25552;&#20379;&#35823;&#24046;&#20272;&#35745;&#12290;&#25105;&#20204;&#30340;&#25968;&#20540;&#31034;&#20363;&#34920;&#26126;&#65292;&#21482;&#35201;&#28385;&#36275;&#19968;&#23450;&#26465;&#20214;&#65292;&#31435;&#26041;&#26041;&#27861;&#27604;Euler&#26041;&#26696;&#26356;&#39640;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we introduce the cubature formula for Stochastic Volterra Integral Equations. We first derive the stochastic Taylor expansion in this setting, by utilizing a functional It\^{o} formula, and provide its tail estimates. We then introduce the cubature measure for such equations, and construct it explicitly in some special cases, including a long memory stochastic volatility model. We shall provide the error estimate rigorously. Our numerical examples show that the cubature method is much more efficient than the Euler scheme, provided certain conditions are satisfied.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21457;&#23637;&#20102;&#19968;&#31181;&#20851;&#20110;&#22238;&#22768;&#23460;&#30340;&#29702;&#24615;&#24573;&#35270;&#29702;&#35770;&#65292;&#36890;&#36807;&#26377;&#38480;&#30340;&#27880;&#24847;&#21147;&#36164;&#28304;&#33719;&#21462;&#20851;&#20110;&#19981;&#30830;&#23450;&#29366;&#24577;&#30340;&#20449;&#24687;&#65292;&#24182;&#22312;&#22238;&#22768;&#23460;&#22343;&#34913;&#20013;&#25551;&#36848;&#20102;&#20449;&#24687;&#30340;&#20256;&#36882;&#21644;&#27880;&#24847;&#21147;&#32593;&#32476;&#12290;</title><link>http://arxiv.org/abs/2104.10657</link><description>&lt;p&gt;
&#29702;&#24615;&#24573;&#35270;&#29702;&#35770;&#19982;&#22238;&#22768;&#23460;
&lt;/p&gt;
&lt;p&gt;
A Rational Inattention Theory of Echo Chamber. (arXiv:2104.10657v6 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2104.10657
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21457;&#23637;&#20102;&#19968;&#31181;&#20851;&#20110;&#22238;&#22768;&#23460;&#30340;&#29702;&#24615;&#24573;&#35270;&#29702;&#35770;&#65292;&#36890;&#36807;&#26377;&#38480;&#30340;&#27880;&#24847;&#21147;&#36164;&#28304;&#33719;&#21462;&#20851;&#20110;&#19981;&#30830;&#23450;&#29366;&#24577;&#30340;&#20449;&#24687;&#65292;&#24182;&#22312;&#22238;&#22768;&#23460;&#22343;&#34913;&#20013;&#25551;&#36848;&#20102;&#20449;&#24687;&#30340;&#20256;&#36882;&#21644;&#27880;&#24847;&#21147;&#32593;&#32476;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#21457;&#23637;&#20102;&#19968;&#31181;&#20851;&#20110;&#22238;&#22768;&#23460;&#30340;&#29702;&#24615;&#24573;&#35270;&#29702;&#35770;&#65292;&#36890;&#36807;&#23558;&#26377;&#38480;&#30340;&#27880;&#24847;&#21147;&#36164;&#28304;&#20998;&#37197;&#32473;&#20559;&#21521;&#20027;&#35201;&#20449;&#24687;&#28304;&#21644;&#20854;&#20182;&#29609;&#23478;&#65292;&#26469;&#33719;&#21462;&#20851;&#20110;&#19981;&#30830;&#23450;&#29366;&#24577;&#30340;&#20449;&#24687;&#12290;&#30001;&#27492;&#20135;&#29983;&#30340;&#27850;&#26494;&#27880;&#24847;&#21147;&#32593;&#32476;&#23558;&#20449;&#24687;&#20174;&#20027;&#35201;&#20449;&#24687;&#28304;&#30452;&#25509;&#25110;&#38388;&#25509;&#22320;&#20256;&#36882;&#32473;&#29609;&#23478;&#12290;&#29702;&#24615;&#24573;&#35270;&#22312;&#26368;&#21021;&#23545;&#19981;&#21516;&#20915;&#31574;&#26377;&#20559;&#35265;&#30340;&#29609;&#23478;&#20043;&#38388;&#20135;&#29983;&#20102;&#23545;&#20449;&#24687;&#30340;&#24322;&#36136;&#38656;&#27714;&#12290;&#22312;&#22238;&#22768;&#23460;&#22343;&#34913;&#20013;&#65292;&#27599;&#20010;&#29609;&#23478;&#23558;&#27880;&#24847;&#21147;&#38480;&#21046;&#22312;&#33258;&#24049;&#20559;&#21521;&#30340;&#20449;&#24687;&#28304;&#21644;&#24535;&#21516;&#36947;&#21512;&#30340;&#26379;&#21451;&#19978;&#65292;&#22240;&#20026;&#21518;&#32773;&#19982;&#20182;&#20204;&#20986;&#24109;&#21516;&#19968;&#20027;&#35201;&#20449;&#24687;&#28304;&#65292;&#25152;&#20197;&#22312;&#20027;&#35201;&#20449;&#24687;&#28304;&#21040;&#36798;&#20182;&#20204;&#30340;&#20449;&#24687;&#20256;&#36755;&#34987;&#20013;&#26029;&#26102;&#65292;&#21487;&#20197;&#20316;&#20026;&#27425;&#35201;&#20449;&#24687;&#28304;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#20135;&#29983;&#22238;&#22768;&#23460;&#22343;&#34913;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#25551;&#36848;&#20102;&#22238;&#22768;&#23460;&#20869;&#30340;&#27880;&#24847;&#21147;&#32593;&#32476;&#65292;&#24182;&#21033;&#29992;&#25105;&#20204;&#30340;&#32467;&#26524;&#26469;&#25351;&#23548;&#20449;&#24687;&#30340;&#35774;&#35745;&#21644;&#30417;&#31649;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a rational inattention theory of echo chamber, whereby players gather information about an uncertain state by allocating limited attention capacities across biased primary sources and the other players. The resulting Poisson attention network transmits information from the primary source to a player either directly or indirectly through the other players. Rational inattention generates heterogeneous demands for information among players who are initially biased towards different decisions. In an echo chamber equilibrium, each player restricts attention to his own-biased source and like-minded friends, as the latter attend to the same primary source as his, and so could serve as secondary sources in case the information transmission from the primary source to him is disrupted. We provide sufficient conditions that give rise to echo chamber equilibria, characterize the attention networks within echo chambers, and use our results to inform the design and regulation of informati
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36866;&#29992;&#20110;&#22810;&#32500;&#26368;&#20248;&#20572;&#26102;&#38382;&#39064;&#30340;&#21464;&#37327;&#21464;&#25442;&#20844;&#24335;&#65292;&#21487;&#20197;&#22788;&#29702;&#20215;&#20540;&#20989;&#25968;&#22312;&#26368;&#20248;&#20572;&#26102;&#36793;&#30028;&#38468;&#36817;&#30340;&#20108;&#38454;&#23548;&#25968;&#21457;&#25955;&#21644;&#19981;&#21487;&#31215;&#30340;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2104.05835</link><description>&lt;p&gt;
&#19968;&#20010;&#21464;&#37327;&#21464;&#25442;&#20844;&#24335;&#21450;&#20854;&#22312;&#22810;&#32500;&#26368;&#20248;&#20572;&#26102;&#38382;&#39064;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
A change of variable formula with applications to multi-dimensional optimal stopping problems. (arXiv:2104.05835v4 [math.PR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2104.05835
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36866;&#29992;&#20110;&#22810;&#32500;&#26368;&#20248;&#20572;&#26102;&#38382;&#39064;&#30340;&#21464;&#37327;&#21464;&#25442;&#20844;&#24335;&#65292;&#21487;&#20197;&#22788;&#29702;&#20215;&#20540;&#20989;&#25968;&#22312;&#26368;&#20248;&#20572;&#26102;&#36793;&#30028;&#38468;&#36817;&#30340;&#20108;&#38454;&#23548;&#25968;&#21457;&#25955;&#21644;&#19981;&#21487;&#31215;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25512;&#23548;&#20102;&#19968;&#20010;&#36866;&#29992;&#20110;$C^1$&#20989;&#25968;$U:\R_+\times\R^m\to\R$&#30340;&#21464;&#37327;&#21464;&#25442;&#20844;&#24335;&#65292;&#35813;&#20989;&#25968;&#30340;&#20108;&#38454;&#31354;&#38388;&#23548;&#25968;&#21487;&#33021;&#20250;&#21457;&#25955;&#19988;&#22312;&#34920;&#38754;$b:\R_+\times\R^{m-1}\to \R$&#30340;&#38468;&#36817;&#21487;&#33021;&#19981;&#21487;&#31215;&#12290;&#36825;&#20010;&#20844;&#24335;&#36866;&#29992;&#20110;&#26368;&#20248;&#20572;&#26102;&#38382;&#39064;&#65292;&#20854;&#20013;&#24456;&#38590;&#25511;&#21046;&#20215;&#20540;&#20989;&#25968;&#22312;&#26368;&#20248;&#20572;&#26102;&#36793;&#30028;&#38468;&#36817;&#30340;&#20108;&#38454;&#23548;&#25968;&#12290;&#19982;&#20854;&#20182;&#31867;&#20284;&#20027;&#39064;&#30340;&#29616;&#26377;&#35770;&#25991;&#19981;&#21516;&#65292;&#25105;&#20204;&#21482;&#35201;&#27714;&#34920;&#38754;$b$&#22312;&#27599;&#20010;&#21464;&#37327;&#19978;&#26159;&#21333;&#35843;&#30340;&#65292;&#24182;&#19988;&#25105;&#20204;&#24418;&#24335;&#19978;&#24471;&#21040;&#20102;&#19982;&#32463;&#20856;&#30340;It\^o&#20844;&#24335;&#30456;&#21516;&#30340;&#34920;&#36798;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
We derive a change of variable formula for $C^1$ functions $U:\R_+\times\R^m\to\R$ whose second order spatial derivatives may explode and not be integrable in the neighbourhood of a surface $b:\R_+\times\R^{m-1}\to \R$ that splits the state space into two sets $\cC$ and $\cD$. The formula is tailored for applications in problems of optimal stopping where it is generally very hard to control the second order derivatives of the value function near the optimal stopping boundary. Differently to other existing papers on similar topics we only require that the surface $b$ be monotonic in each variable and we formally obtain the same expression as the classical It\^o's formula.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#23567;&#24066;&#22330;&#20914;&#20987;&#21644;&#32452;&#21512;&#28165;&#31639;&#19979;&#30340;&#26368;&#20248;&#20132;&#26131;&#25191;&#34892;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24314;&#27169;&#26694;&#26550;&#65292;&#23558;&#27969;&#21160;&#24615;&#27169;&#22411;&#21644;&#21322;&#38789;&#31574;&#30053;&#32467;&#21512;&#36215;&#26469;&#65292;&#24182;&#32473;&#20986;&#20102;&#30456;&#24212;&#30340;&#25910;&#25947;&#32467;&#26524;&#21644;&#34920;&#31034;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2103.05957</link><description>&lt;p&gt;
&#22312;&#23567;&#24066;&#22330;&#20914;&#20987;&#21644;&#32452;&#21512;&#28165;&#31639;&#19979;&#30340;&#26368;&#20248;&#20132;&#26131;&#25191;&#34892;&#19982;&#21322;&#38789;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Optimal trade execution under small market impact and portfolio liquidation with semimartingale strategies. (arXiv:2103.05957v3 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2103.05957
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#23567;&#24066;&#22330;&#20914;&#20987;&#21644;&#32452;&#21512;&#28165;&#31639;&#19979;&#30340;&#26368;&#20248;&#20132;&#26131;&#25191;&#34892;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24314;&#27169;&#26694;&#26550;&#65292;&#23558;&#27969;&#21160;&#24615;&#27169;&#22411;&#21644;&#21322;&#38789;&#31574;&#30053;&#32467;&#21512;&#36215;&#26469;&#65292;&#24182;&#32473;&#20986;&#20102;&#30456;&#24212;&#30340;&#25910;&#25947;&#32467;&#26524;&#21644;&#34920;&#31034;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#20855;&#26377;&#30636;&#26102;&#20215;&#26684;&#20914;&#20987;&#21644;&#38543;&#26426;&#24377;&#24615;&#30340;&#26368;&#20248;&#28165;&#31639;&#38382;&#39064;&#65292;&#38024;&#23545;&#23567;&#30636;&#26102;&#20914;&#20987;&#22240;&#23376;&#12290;&#22312;&#25105;&#20204;&#30340;&#24314;&#27169;&#26694;&#26550;&#20013;&#65292;&#24403;&#30636;&#26102;&#20914;&#20987;&#22240;&#23376;&#36235;&#36817;&#20110;&#38646;&#26102;&#65292;&#26368;&#20248;&#32452;&#21512;&#27969;&#31243;&#25910;&#25947;&#21040;&#20102;&#20855;&#26377;&#19968;&#33324;&#21322;&#38789;&#25511;&#21046;&#30340;&#26368;&#20248;&#28165;&#31639;&#38382;&#39064;&#30340;&#35299;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#25552;&#20379;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#23558;&#27969;&#21160;&#24615;&#25991;&#29486;&#20013;&#26368;&#24120;&#29992;&#30340;&#20004;&#31181;&#24314;&#27169;&#26694;&#26550;&#23884;&#20837;&#20854;&#20013;&#65292;&#24182;&#20026;&#20351;&#29992;&#21322;&#38789;&#28165;&#31639;&#31574;&#30053;&#21644;&#26080;&#30028;&#21464;&#21160;&#30340;&#32452;&#21512;&#27969;&#31243;&#30340;&#20351;&#29992;&#25552;&#20379;&#20102;&#24494;&#35266;&#22522;&#30784;&#12290;&#25105;&#20204;&#30340;&#25910;&#25947;&#32467;&#26524;&#22522;&#20110;&#20855;&#26377;&#22855;&#24322;&#26411;&#31471;&#26465;&#20214;&#30340;BSDE&#30340;&#26032;&#30340;&#25910;&#25947;&#32467;&#26524;&#21644;BSDE&#30340;&#26032;&#30340;&#34920;&#31034;&#32467;&#26524;&#65292;&#36825;&#20123;&#32467;&#26524;&#26159;&#30001;&#22343;&#21248;&#36830;&#32493;&#20989;&#25968;&#20851;&#20110;&#21069;&#21521;&#36807;&#31243;&#34920;&#31034;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider an optimal liquidation problem with instantaneous price impact and stochastic resilience for small instantaneous impact factors. Within our modelling framework, the optimal portfolio process converges to the solution of an optimal liquidation problem with general semimartingale controls when the instantaneous impact factor converges to zero. Our results provide a unified framework within which to embed the two most commonly used modelling frameworks in the liquidation literature and provide a microscopic foundation for the use of semimartingale liquidation strategies and the use of portfolio processes of unbounded variation. Our convergence results are based on novel convergence results for BSDEs with singular terminal conditions and novel representation results of BSDEs in terms of uniformly continuous functions of forward processes.
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#30740;&#31350;&#20102;&#37329;&#34701;&#32593;&#32476;&#20013;&#32452;&#32455;&#20043;&#38388;&#30340;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#22914;&#20309;&#23548;&#33268;&#22810;&#31181;&#21487;&#33021;&#30340;&#24179;&#34913;&#32467;&#26524;&#65292;&#24182;&#25552;&#20379;&#20102;&#30830;&#20445;&#38134;&#34892;&#20607;&#20538;&#33021;&#21147;&#30340;&#24517;&#35201;&#26465;&#20214;&#12290;&#25105;&#20204;&#36824;&#30740;&#31350;&#20102;&#20445;&#35777;&#31995;&#32479;&#20607;&#20538;&#33021;&#21147;&#25152;&#38656;&#30340;&#26368;&#20302;&#32039;&#24613;&#25588;&#21161;&#25903;&#20184;&#20197;&#21450;&#22914;&#20309;&#36890;&#36807;&#25285;&#20445;&#29305;&#23450;&#30340;&#20538;&#21153;&#25903;&#20184;&#26469;&#30830;&#20445;&#20607;&#20538;&#33021;&#21147;&#12290;&#25105;&#20204;&#21457;&#29616;&#35813;&#38382;&#39064;&#26159;&#35745;&#31639;&#38590;&#39064;&#65292;&#20294;&#32473;&#20986;&#20102;&#38382;&#39064;&#30340;&#26368;&#20248;&#25903;&#20184;&#19978;&#30028;&#65292;&#24182;&#25552;&#20379;&#20102;&#29305;&#23450;&#32593;&#32476;&#32467;&#26500;&#19979;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>http://arxiv.org/abs/2012.12861</link><description>&lt;p&gt;
&#20923;&#32467;&#20449;&#29992;&#12289;&#24179;&#34913;&#22810;&#26679;&#24615;&#21644;&#37329;&#34701;&#32593;&#32476;&#20013;&#30340;&#26368;&#20339;&#32039;&#24613;&#25588;&#21161;
&lt;/p&gt;
&lt;p&gt;
Credit Freezes, Equilibrium Multiplicity, and Optimal Bailouts in Financial Networks. (arXiv:2012.12861v2 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2012.12861
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#37329;&#34701;&#32593;&#32476;&#20013;&#32452;&#32455;&#20043;&#38388;&#30340;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#22914;&#20309;&#23548;&#33268;&#22810;&#31181;&#21487;&#33021;&#30340;&#24179;&#34913;&#32467;&#26524;&#65292;&#24182;&#25552;&#20379;&#20102;&#30830;&#20445;&#38134;&#34892;&#20607;&#20538;&#33021;&#21147;&#30340;&#24517;&#35201;&#26465;&#20214;&#12290;&#25105;&#20204;&#36824;&#30740;&#31350;&#20102;&#20445;&#35777;&#31995;&#32479;&#20607;&#20538;&#33021;&#21147;&#25152;&#38656;&#30340;&#26368;&#20302;&#32039;&#24613;&#25588;&#21161;&#25903;&#20184;&#20197;&#21450;&#22914;&#20309;&#36890;&#36807;&#25285;&#20445;&#29305;&#23450;&#30340;&#20538;&#21153;&#25903;&#20184;&#26469;&#30830;&#20445;&#20607;&#20538;&#33021;&#21147;&#12290;&#25105;&#20204;&#21457;&#29616;&#35813;&#38382;&#39064;&#26159;&#35745;&#31639;&#38590;&#39064;&#65292;&#20294;&#32473;&#20986;&#20102;&#38382;&#39064;&#30340;&#26368;&#20248;&#25903;&#20184;&#19978;&#30028;&#65292;&#24182;&#25552;&#20379;&#20102;&#29305;&#23450;&#32593;&#32476;&#32467;&#26500;&#19979;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20998;&#26512;&#20102;&#37329;&#34701;&#32593;&#32476;&#20013;&#32452;&#32455;&#20043;&#38388;&#30340;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#22914;&#20309;&#23548;&#33268;&#22810;&#31181;&#21487;&#33021;&#30340;&#24179;&#34913;&#32467;&#26524;&#12290;&#21482;&#26377;&#22312;&#32593;&#32476;&#20013;&#23384;&#22312;&#26576;&#31181;&#31867;&#22411;&#30340;&#20381;&#36182;&#24490;&#29615;&#26102;&#65292;&#25165;&#20250;&#20986;&#29616;&#22810;&#26679;&#24615;&#65292;&#20174;&#32780;&#20135;&#29983;&#33258;&#25105;&#23454;&#29616;&#30340;&#36829;&#32422;&#38142;&#26465;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#22312;&#20219;&#20309;&#24179;&#34913;&#20013;&#30830;&#20445;&#38134;&#34892;&#20607;&#20538;&#33021;&#21147;&#30340;&#20805;&#20998;&#24517;&#35201;&#26465;&#20214;&#12290;&#22522;&#20110;&#36825;&#20123;&#26465;&#20214;&#65292;&#25105;&#20204;&#23545;&#20445;&#35777;&#31995;&#32479;&#20607;&#20538;&#33021;&#21147;&#25152;&#38656;&#30340;&#26368;&#20302;&#32039;&#24613;&#25588;&#21161;&#25903;&#20184;&#36827;&#34892;&#20102;&#34920;&#24449;&#65292;&#20197;&#21450;&#22914;&#20309;&#36890;&#36807;&#25285;&#20445;&#29305;&#23450;&#30340;&#20538;&#21153;&#25903;&#20184;&#26469;&#30830;&#20445;&#20607;&#20538;&#33021;&#21147;&#12290;&#29992;&#20110;&#28040;&#38500;&#33258;&#25105;&#23454;&#29616;&#30340;&#36829;&#32422;&#24490;&#29615;&#65288;&#20449;&#29992;&#20923;&#32467;&#65289;&#30340;&#32039;&#24613;&#25588;&#21161;&#27880;&#20837;&#26159;&#23436;&#20840;&#21487;&#24674;&#22797;&#30340;&#65292;&#32780;&#29992;&#20110;&#38450;&#27490;&#24490;&#29615;&#20043;&#22806;&#30340;&#32423;&#32852;&#36829;&#32422;&#30340;&#32039;&#24613;&#25588;&#21161;&#21017;&#19981;&#21487;&#24674;&#22797;&#12290;&#25105;&#20204;&#34920;&#26126;&#26368;&#20302;&#32039;&#24613;&#25588;&#21161;&#38382;&#39064;&#26159;&#35745;&#31639;&#38590;&#39064;&#65292;&#20294;&#25552;&#20379;&#20102;&#26368;&#20248;&#25903;&#20184;&#30340;&#19978;&#30028;&#65292;&#24182;&#19988;&#22312;&#29305;&#23450;&#32593;&#32476;&#32467;&#26500;&#20013;&#65288;&#22914;&#20855;&#26377;&#19981;&#30456;&#20132;&#24490;&#29615;&#25110;&#26680;&#24515;-&#36793;&#32536;&#32467;&#26500;&#65289;&#35813;&#38382;&#39064;&#20855;&#26377;&#30452;&#35266;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
We analyze how interdependencies between organizations in financial networks can lead to multiple possible equilibrium outcomes. A multiplicity arises if and only if there exists a certain type of dependency cycle in the network that allows for self-fulfilling chains of defaults. We provide necessary and sufficient conditions for banks' solvency in any equilibrium. Building on these conditions, we characterize the minimum bailout payments needed to ensure systemic solvency, as well as how solvency can be ensured by guaranteeing a specific set of debt payments. Bailout injections needed to eliminate self-fulfilling cycles of defaults (credit freezes) are fully recoverable, while those needed to prevent cascading defaults outside of cycles are not. We show that the minimum bailout problem is computationally hard, but provide an upper bound on optimal payments and show that the problem has intuitive solutions in specific network structures such as those with disjoint cycles or a core-peri
&lt;/p&gt;</description></item></channel></rss>