<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#21608;&#26399;&#24615;&#22686;&#38271;&#36807;&#31243;&#20013;&#65292;&#36164;&#26412;&#21270;&#30340;&#26399;&#26395;&#20540;&#21462;&#20915;&#20110;&#36335;&#24452;&#65292;&#20174;&#32780;&#23548;&#33268;&#36164;&#26412;&#30340;&#22238;&#25253;&#29575;&#21644;&#26102;&#38388;&#24179;&#22343;&#22238;&#25253;&#29575;&#21462;&#20915;&#20110;&#36335;&#24452;&#65292;&#19988;&#20869;&#37096;&#25910;&#30410;&#29575;&#19982;&#36164;&#26412;&#22238;&#25253;&#29575;&#30340;&#26399;&#26395;&#20540;&#19981;&#21516;&#12290;</title><link>https://arxiv.org/abs/2403.08678</link><description>&lt;p&gt;
&#36164;&#26412;&#22238;&#25253;&#22312;&#21608;&#26399;&#24615;&#22686;&#38271;&#36807;&#31243;&#20013;&#30340;&#36335;&#24452;&#20381;&#36182;&#24615;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Path-dependency of capital return in periodic growth processes
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.08678
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#21608;&#26399;&#24615;&#22686;&#38271;&#36807;&#31243;&#20013;&#65292;&#36164;&#26412;&#21270;&#30340;&#26399;&#26395;&#20540;&#21462;&#20915;&#20110;&#36335;&#24452;&#65292;&#20174;&#32780;&#23548;&#33268;&#36164;&#26412;&#30340;&#22238;&#25253;&#29575;&#21644;&#26102;&#38388;&#24179;&#22343;&#22238;&#25253;&#29575;&#21462;&#20915;&#20110;&#36335;&#24452;&#65292;&#19988;&#20869;&#37096;&#25910;&#30410;&#29575;&#19982;&#36164;&#26412;&#22238;&#25253;&#29575;&#30340;&#26399;&#26395;&#20540;&#19981;&#21516;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#21608;&#26399;&#24615;&#22686;&#38271;&#36807;&#31243;&#12290;&#26681;&#25454;&#24212;&#35745;&#22522;&#30784;&#65292;&#21033;&#28070;&#29575;&#30340;&#26399;&#26395;&#20540;&#26082;&#19981;&#30452;&#25509;&#21462;&#20915;&#20110;&#20943;&#20540;&#65292;&#20063;&#19981;&#21462;&#20915;&#20110;&#36164;&#26412;&#21270;&#36335;&#24452;&#12290;&#36164;&#26412;&#21270;&#30340;&#26399;&#26395;&#20540;&#26159;&#36335;&#24452;&#20381;&#36182;&#30340;&#12290;&#30001;&#20110;&#20381;&#36182;&#36335;&#24452;&#30340;&#36164;&#26412;&#21270;&#65292;&#36164;&#26412;&#30340;&#22238;&#25253;&#29575;&#20063;&#26159;&#36335;&#24452;&#20381;&#36182;&#30340;&#65292;&#32780;&#36164;&#26412;&#30340;&#26102;&#38388;&#24179;&#22343;&#22238;&#25253;&#29575;&#19982;&#22686;&#38271;&#21608;&#26399;&#30340;&#26399;&#26395;&#20540;&#22238;&#25253;&#29575;&#19981;&#21516;&#12290;&#22312;&#27809;&#26377;&#20013;&#38388;&#20943;&#20540;&#30340;&#24773;&#20917;&#19979;&#65292;&#20869;&#37096;&#25910;&#30410;&#29575;&#26159;&#36335;&#24452;&#26080;&#20851;&#30340;&#65292;&#22240;&#27492;&#19982;&#36164;&#26412;&#22238;&#25253;&#29575;&#30340;&#26399;&#26395;&#20540;&#19981;&#21516;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#20351;&#26435;&#30410;&#22238;&#25253;&#29575;&#26368;&#22823;&#21270;&#30340;&#26059;&#36716;&#21608;&#26399;&#38271;&#24230;&#19982;&#24066;&#22330;&#21033;&#29575;&#26080;&#20851;&#12290;&#26464;&#26438;&#25928;&#24212;&#36890;&#36807;&#19968;&#20010;&#21333;&#29420;&#30340;&#26464;&#26438;&#26041;&#31243;&#36827;&#20837;&#22686;&#38271;&#36807;&#31243;&#30340;&#24494;&#35266;&#32463;&#27982;&#23398;&#20013;&#65292;&#26464;&#26438;&#31995;&#25968;&#21487;&#33021;&#36798;&#21040;&#27491;&#20540;&#25110;&#36127;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.08678v1 Announce Type: new  Abstract: Periodic growth processes are investigated. The expected value of the profit rate, on accrual basis, does not directly depend on divestments, neither on the capitalization path. The expected value of capitalization is path dependent. Because of the path-dependent capitalization, the return rate on capital is path-dependent, and the time-average return rate on capital differs from the expected-value return rate on capital for the growth cycle. In the absence of intermediate divestments, the internal rate of return is path-independent, thereby differing from the expected value of the rate of return on capital. It is shown that the rotation cycle length maximizing the return rate on equity is independent of market interest rate. Leveraging effect enters the microeconomics of the growth processes through a separate leveraging equation, where the leverage coefficient may reach positive or negative values. Correspondingly, from the viewpoint o
&lt;/p&gt;</description></item><item><title>ADS&#31995;&#32479;&#30340;&#21457;&#23637;&#21644;&#20351;&#29992;&#36807;&#31243;&#25581;&#31034;&#20986;ADS&#26412;&#36523;&#26159;&#28304;&#33258;&#19968;&#31995;&#21015;&#22823;&#37096;&#20998;&#26410;&#25351;&#26126;&#30340;&#20154;&#31867;&#20915;&#31574;&#65292;&#30740;&#31350;&#24378;&#35843;&#22312;&#32452;&#32455;&#29615;&#22659;&#20013;&#23454;&#26045;ADS&#24212;&#32771;&#34385;&#21040;&#34892;&#20026;&#22240;&#32032;&#12290;</title><link>https://arxiv.org/abs/2402.14674</link><description>&lt;p&gt;
&#20570;&#20154;&#24037;&#26234;&#33021;&#65306;&#31639;&#27861;&#20915;&#31574;&#25903;&#25345;&#20316;&#20026;&#20154;&#31867;&#27963;&#21160;
&lt;/p&gt;
&lt;p&gt;
Doing AI: Algorithmic decision support as a human activity
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14674
&lt;/p&gt;
&lt;p&gt;
ADS&#31995;&#32479;&#30340;&#21457;&#23637;&#21644;&#20351;&#29992;&#36807;&#31243;&#25581;&#31034;&#20986;ADS&#26412;&#36523;&#26159;&#28304;&#33258;&#19968;&#31995;&#21015;&#22823;&#37096;&#20998;&#26410;&#25351;&#26126;&#30340;&#20154;&#31867;&#20915;&#31574;&#65292;&#30740;&#31350;&#24378;&#35843;&#22312;&#32452;&#32455;&#29615;&#22659;&#20013;&#23454;&#26045;ADS&#24212;&#32771;&#34385;&#21040;&#34892;&#20026;&#22240;&#32032;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#20154;&#24037;&#26234;&#33021;&#31639;&#27861;&#20915;&#31574;&#25903;&#25345;&#65288;ADS&#65289;&#27491;&#22312;&#25104;&#20026;&#35768;&#22810;&#27969;&#31243;&#30340;&#37325;&#35201;&#32452;&#25104;&#37096;&#20998;&#12290;&#32452;&#32455;&#24341;&#20837;ADS&#26159;&#20026;&#20102;&#25913;&#21892;&#20915;&#31574;&#21046;&#23450;&#65292;&#26368;&#22823;&#38480;&#24230;&#22320;&#21033;&#29992;&#25968;&#25454;&#65292;&#20174;&#32780;&#21487;&#33021;&#36991;&#20813;&#19982;&#35268;&#33539;&#8220;&#32463;&#27982;&#20154;&#8221;&#21644;&#20154;&#31867;&#20915;&#31574;&#29305;&#24449;&#30340;&#20559;&#24046;&#12290;&#23545;ADS&#31995;&#32479;&#24320;&#21457;&#36807;&#31243;&#30340;&#28145;&#20837;&#30740;&#31350;&#25581;&#31034;&#20102;ADS&#26412;&#36523;&#28304;&#33258;&#19968;&#31995;&#21015;&#22823;&#37096;&#20998;&#26410;&#25351;&#26126;&#30340;&#20154;&#31867;&#20915;&#31574;&#12290;&#23427;&#20204;&#22987;&#20110;&#20851;&#20110;&#20309;&#26102;&#20351;&#29992;ADS&#30340;&#30740;&#35752;&#65292;&#32487;&#32493;&#20110;&#24320;&#21457;ADS&#26102;&#30340;&#36873;&#25321;&#65292;&#24182;&#20197;&#21033;&#29992;ADS&#36755;&#20986;&#20570;&#20915;&#31574;&#32467;&#26463;&#12290;&#26368;&#32456;&#30340;&#32467;&#35770;&#22312;&#32452;&#32455;&#29615;&#22659;&#20013;&#24471;&#20197;&#23454;&#29616;&#65292;&#36890;&#24120;&#26410;&#20998;&#26512;&#20915;&#31574;&#25903;&#25345;&#30340;&#24433;&#21709;&#12290;&#26412;&#25991;&#25506;&#35752;&#20102;&#24320;&#21457;&#21644;&#20351;&#29992;ADS&#20013;&#30340;&#19968;&#20123;&#38382;&#39064;&#65292;&#24182;&#25351;&#20986;&#22312;&#32452;&#32455;&#29615;&#22659;&#20013;&#23454;&#26045;ADS&#26102;&#24212;&#32771;&#34385;&#30340;&#34892;&#20026;&#26041;&#38754;&#12290;&#23427;&#25351;&#20986;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14674v1 Announce Type: cross  Abstract: Algorithmic decision support (ADS), using Machine-Learning-based AI, is becoming a major part of many processes. Organizations introduce ADS to improve decision-making and make optimal use of data, thereby possibly avoiding deviations from the normative "homo economicus" and the biases that characterize human decision-making. A closer look at the development process of ADS systems reveals that ADS itself results from a series of largely unspecified human decisions. They begin with deliberations for which decisions to use ADS, continue with choices while developing the ADS, and end with using the ADS output for decisions. Finally, conclusions are implemented in organizational settings, often without analyzing the implications of the decision support. The paper explores some issues in developing and using ADS, pointing to behavioral aspects that should be considered when implementing ADS in organizational settings. It points out directio
&lt;/p&gt;</description></item><item><title>&#22806;&#20538;&#23545;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#26377;&#27491;&#38754;&#19988;&#26174;&#33879;&#30340;&#24433;&#21709;&#65292;&#22686;&#21152;&#30340;&#22806;&#20538;&#20250;&#23548;&#33268;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30340;&#22686;&#21152;&#12290;&#36896;&#25104;&#36825;&#31181;&#24433;&#21709;&#30340;&#21487;&#33021;&#26426;&#21046;&#20043;&#19968;&#26159;&#65292;&#25919;&#24220;&#30001;&#20110;&#22686;&#21152;&#30340;&#20538;&#21153;&#26381;&#21153;&#21387;&#21147;&#65292;&#26080;&#27861;&#26377;&#25928;&#25191;&#34892;&#29615;&#22659;&#27861;&#35268;&#65292;&#25110;&#34987;&#31169;&#33829;&#37096;&#38376;&#25152;&#25511;&#21046;&#12290;</title><link>https://arxiv.org/abs/2206.01840</link><description>&lt;p&gt;
&#22806;&#20538;&#23545;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The Effect of External Debt on Greenhouse Gas Emissions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2206.01840
&lt;/p&gt;
&lt;p&gt;
&#22806;&#20538;&#23545;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#26377;&#27491;&#38754;&#19988;&#26174;&#33879;&#30340;&#24433;&#21709;&#65292;&#22686;&#21152;&#30340;&#22806;&#20538;&#20250;&#23548;&#33268;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30340;&#22686;&#21152;&#12290;&#36896;&#25104;&#36825;&#31181;&#24433;&#21709;&#30340;&#21487;&#33021;&#26426;&#21046;&#20043;&#19968;&#26159;&#65292;&#25919;&#24220;&#30001;&#20110;&#22686;&#21152;&#30340;&#20538;&#21153;&#26381;&#21153;&#21387;&#21147;&#65292;&#26080;&#27861;&#26377;&#25928;&#25191;&#34892;&#29615;&#22659;&#27861;&#35268;&#65292;&#25110;&#34987;&#31169;&#33829;&#37096;&#38376;&#25152;&#25511;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22312;78&#20010;&#26032;&#20852;&#24066;&#22330;&#21644;&#21457;&#23637;&#20013;&#22269;&#23478;&#30340;&#38754;&#26495;&#25968;&#25454;&#20013;&#20272;&#35745;&#20102;&#22806;&#20538;&#23545;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30340;&#22240;&#26524;&#25928;&#24212;&#65292;&#26102;&#38388;&#36328;&#24230;&#20026;1990&#24180;&#33267;2015&#24180;&#12290;&#19982;&#20197;&#24448;&#25991;&#29486;&#19981;&#21516;&#65292;&#25105;&#20204;&#20351;&#29992;&#22806;&#37096;&#24037;&#20855;&#21464;&#37327;&#26469;&#35299;&#20915;&#22806;&#20538;&#19982;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#20043;&#38388;&#30340;&#28508;&#22312;&#20869;&#29983;&#24615;&#38382;&#39064;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#20351;&#29992;&#22269;&#38469;&#27969;&#21160;&#24615;&#20914;&#20987;&#20316;&#20026;&#22806;&#20538;&#30340;&#24037;&#20855;&#21464;&#37327;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22788;&#29702;&#28508;&#22312;&#20869;&#29983;&#24615;&#38382;&#39064;&#24102;&#26469;&#20102;&#22806;&#20538;&#23545;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30340;&#27491;&#38754;&#19988;&#26174;&#33879;&#24433;&#21709;&#65306;&#22806;&#20538;&#22686;&#21152;1&#20010;&#30334;&#20998;&#28857;&#65288;pp.&#65289;&#65292;&#24179;&#22343;&#20250;&#23548;&#33268;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#22686;&#21152;0.4%&#12290;&#19968;&#20010;&#21487;&#33021;&#30340;&#20316;&#29992;&#26426;&#21046;&#26159;&#65292;&#38543;&#30528;&#22806;&#20538;&#30340;&#22686;&#21152;&#65292;&#25919;&#24220;&#38590;&#20197;&#25191;&#34892;&#29615;&#22659;&#27861;&#35268;&#65292;&#22240;&#20026;&#20182;&#20204;&#30340;&#20027;&#35201;&#20248;&#20808;&#20107;&#39033;&#26159;&#25193;&#22823;&#31246;&#22522;&#20197;&#25903;&#20184;&#19981;&#26029;&#22686;&#21152;&#30340;&#20538;&#21153;&#26381;&#21153;&#65292;&#25110;&#32773;&#22240;&#20026;&#20182;&#20204;&#34987;&#25345;&#26377;&#20538;&#21153;&#30340;&#31169;&#33829;&#37096;&#38376;&#25152;&#25511;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
We estimate the causal effect of external debt on greenhouse gas emissions in a panel of 78 emerging market and developing economies over the 1990-2015 period. Unlike previous literature, we use external instruments to address the potential endogeneity in the relationship between external debt and greenhouse gas emissions. Specifically, we use international liquidity shocks as instrumental variables for external debt. We find that dealing with the potential endogeneity problem brings about a positive and statistically significant effect of external debt on greenhouse gas emissions: a 1 percentage point (pp.) rise in external debt causes, on average, a 0.4% increase in greenhouse gas emissions. One possible mechanism of action could be that, as external debt increases, governments are less able to enforce environmental regulations because their main priority is to increase the tax base to pay increasing debt services or because they are captured by the private sector who owns that debt 
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26102;&#38388;&#21464;&#21270;&#26041;&#27861;&#26469;&#30740;&#31350;&#38544;&#21547;&#27874;&#21160;&#29575;&#24494;&#31505;&#30340;&#24418;&#24577;&#12290;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#24120;&#35265;&#30340;&#21322;&#38808;&#27169;&#22411;&#65292;&#25913;&#36827;&#20102;&#22522;&#20110;&#30697;&#30340;&#20844;&#24335;&#26469;&#36817;&#20284;&#24179;&#20215;&#36873;&#25321;&#26435;&#30340;&#20559;&#26012;&#21644;&#26354;&#29575;&#65292;&#36890;&#36807;&#26126;&#30830;&#35745;&#31639;&#20986;&#36825;&#20123;&#30697;&#65292;&#32771;&#34385;&#20102;&#20960;&#20010;&#27169;&#22411;&#30340;&#26497;&#38480;&#20559;&#26012;&#21644;&#26354;&#29575;&#65292;&#24182;&#36890;&#36807;&#25968;&#20540;&#26041;&#27861;&#21644;&#23454;&#35777;&#25968;&#25454;&#36827;&#34892;&#20102;&#27979;&#35797;&#65292;&#26368;&#21518;&#24212;&#29992;&#20110;&#26657;&#20934;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2401.03776</link><description>&lt;p&gt;
&#20998;&#35299;&#24494;&#31505;&#65306;&#19968;&#31181;&#26102;&#38388;&#21464;&#21270;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Decomposing Smiles: A Time Change Approach. (arXiv:2401.03776v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.03776
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26102;&#38388;&#21464;&#21270;&#26041;&#27861;&#26469;&#30740;&#31350;&#38544;&#21547;&#27874;&#21160;&#29575;&#24494;&#31505;&#30340;&#24418;&#24577;&#12290;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#24120;&#35265;&#30340;&#21322;&#38808;&#27169;&#22411;&#65292;&#25913;&#36827;&#20102;&#22522;&#20110;&#30697;&#30340;&#20844;&#24335;&#26469;&#36817;&#20284;&#24179;&#20215;&#36873;&#25321;&#26435;&#30340;&#20559;&#26012;&#21644;&#26354;&#29575;&#65292;&#36890;&#36807;&#26126;&#30830;&#35745;&#31639;&#20986;&#36825;&#20123;&#30697;&#65292;&#32771;&#34385;&#20102;&#20960;&#20010;&#27169;&#22411;&#30340;&#26497;&#38480;&#20559;&#26012;&#21644;&#26354;&#29575;&#65292;&#24182;&#36890;&#36807;&#25968;&#20540;&#26041;&#27861;&#21644;&#23454;&#35777;&#25968;&#25454;&#36827;&#34892;&#20102;&#27979;&#35797;&#65292;&#26368;&#21518;&#24212;&#29992;&#20110;&#26657;&#20934;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#37319;&#29992;&#19968;&#31181;&#26032;&#39062;&#30340;&#26102;&#38388;&#21464;&#21270;&#26041;&#27861;&#26469;&#30740;&#31350;&#38544;&#21547;&#27874;&#21160;&#29575;&#24494;&#31505;&#30340;&#24418;&#29366;&#12290;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#24120;&#35265;&#30340;&#21322;&#38808;&#27169;&#22411;&#65292;&#21253;&#25324;&#36339;&#36291;&#25193;&#25955;&#27169;&#22411;&#12289;&#31895;&#31961;&#27874;&#21160;&#27169;&#22411;&#21644;&#26080;&#38480;&#27963;&#21160;&#27169;&#22411;&#12290;&#25105;&#20204;&#29992;&#25913;&#36827;&#30340;&#22522;&#20110;&#30697;&#30340;&#20844;&#24335;&#36817;&#20284;&#24179;&#20215;&#36873;&#25321;&#26435;&#30340;&#20559;&#26012;&#21644;&#26354;&#29575;&#12290;&#22312;&#26102;&#38388;&#21464;&#21270;&#26694;&#26550;&#19979;&#26126;&#30830;&#35745;&#31639;&#20986;&#36825;&#20123;&#30697;&#12290;&#23545;&#20110;&#20960;&#20010;&#27169;&#22411;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#26497;&#38480;&#30340;&#20559;&#26012;&#21644;&#26354;&#29575;&#12290;&#25105;&#20204;&#36824;&#36890;&#36807;&#25968;&#20540;&#26041;&#27861;&#21644;&#23454;&#35777;&#25968;&#25454;&#23545;&#30701;&#26399;&#36924;&#36817;&#32467;&#26524;&#30340;&#20934;&#30830;&#24615;&#36827;&#34892;&#20102;&#27979;&#35797;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#35813;&#26041;&#27861;&#24212;&#29992;&#20110;&#26657;&#20934;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a novel time-change approach to study the shape of implied volatility smiles. The method is applicable to common semimartingale models, including jump-diffusion, rough volatility and infinite activity models. We approximate the at-the-money skew and curvature with an improved moment-based formula. The moments are further explicitly computed under a time change framework. The limiting skew and curvature for several models are considered. We also test the accuracy of the short-term approximation results on models via numerical methods and on empirical data. Finally, we apply the method to the calibration problem.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#28201;&#23460;&#27668;&#20307;&#25269;&#28040;&#20449;&#29992;&#24066;&#22330;&#20013;&#30340;&#32435;&#20160;&#22343;&#34913;&#38382;&#39064;&#65292;&#20998;&#26512;&#20102;&#21333;&#21442;&#19982;&#32773;&#21644;&#21452;&#21442;&#19982;&#32773;&#24773;&#20917;&#19979;&#30340;&#26368;&#20339;&#34892;&#20026;&#65292;&#24182;&#25552;&#20986;&#20102;&#35299;&#20915;&#35813;&#38382;&#39064;&#30340;&#25968;&#20540;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2401.01427</link><description>&lt;p&gt;
&#28201;&#23460;&#27668;&#20307;&#25269;&#28040;&#20449;&#29992;&#24066;&#22330;&#20013;&#30340;&#32435;&#20160;&#22343;&#34913;
&lt;/p&gt;
&lt;p&gt;
Nash Equilibria in Greenhouse Gas Offset Credit Markets. (arXiv:2401.01427v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.01427
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#28201;&#23460;&#27668;&#20307;&#25269;&#28040;&#20449;&#29992;&#24066;&#22330;&#20013;&#30340;&#32435;&#20160;&#22343;&#34913;&#38382;&#39064;&#65292;&#20998;&#26512;&#20102;&#21333;&#21442;&#19982;&#32773;&#21644;&#21452;&#21442;&#19982;&#32773;&#24773;&#20917;&#19979;&#30340;&#26368;&#20339;&#34892;&#20026;&#65292;&#24182;&#25552;&#20986;&#20102;&#35299;&#20915;&#35813;&#38382;&#39064;&#30340;&#25968;&#20540;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38024;&#23545;&#20840;&#29699;&#27668;&#20505;&#21361;&#26426;&#65292;&#19990;&#30028;&#21508;&#22269;&#25919;&#24220;&#27491;&#22312;&#24341;&#20837;&#31435;&#27861;&#25514;&#26045;&#65292;&#20197;&#20943;&#23569;&#28201;&#23460;&#27668;&#20307;&#65288;GHG&#65289;&#25490;&#25918;&#65292;&#21161;&#21147;&#32531;&#35299;&#29615;&#22659;&#28798;&#38590;&#12290;&#19968;&#31181;&#20419;&#36827;&#20943;&#25490;&#30340;&#26041;&#27861;&#26159;&#28608;&#21169;&#30899;&#25429;&#33719;&#21644;&#30899;&#20943;&#23569;&#39033;&#30446;&#65292;&#21516;&#26102;&#24809;&#32602;&#36229;&#39069;&#30340;GHG&#25490;&#25918;&#12290;&#25237;&#36164;&#20110;&#30899;&#25429;&#33719;&#39033;&#30446;&#25110;&#20943;&#23569;&#25490;&#25918;&#30340;&#20844;&#21496;&#21487;&#20197;&#33719;&#24471;&#25269;&#28040;&#20449;&#29992;&#65288;OCs&#65289;&#20316;&#20026;&#22238;&#25253;&#12290;&#36825;&#20123;OCs&#21487;&#20197;&#29992;&#20110;&#21512;&#35268;&#26399;&#38388;&#25269;&#28040;&#20854;&#36229;&#39069;&#25490;&#25918;&#30340;&#30417;&#31649;&#30446;&#30340;&#12290;OCs&#20063;&#21487;&#20197;&#22312;&#20225;&#19994;&#20043;&#38388;&#36827;&#34892;&#20132;&#26131;&#12290;&#22240;&#27492;&#65292;&#20225;&#19994;&#21487;&#20197;&#36873;&#25321;&#25237;&#36164;&#20110;&#39033;&#30446;&#26469;&#20135;&#29983;OCs&#65292;&#25110;&#32773;&#20132;&#26131;OCs&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#24066;&#22330;&#26694;&#26550;&#65292;&#24182;&#22312;&#21333;&#21442;&#19982;&#32773;&#21644;&#21452;&#21442;&#19982;&#32773;&#24773;&#20917;&#19979;&#23545;GHG OC&#24066;&#22330;&#21442;&#19982;&#32773;&#30340;&#26368;&#20339;&#34892;&#20026;&#36827;&#34892;&#20102;&#34920;&#24449;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#21333;&#26399;&#21644;&#22810;&#26399;&#30340;&#35774;&#23450;&#12290;&#30001;&#20110;&#24066;&#22330;&#27169;&#22411;&#27809;&#26377;&#38381;&#21512;&#35299;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#25968;&#20540;&#26041;&#27861;&#26469;&#35299;&#20915;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
In response to the global climate crisis, governments worldwide are introducing legislation to reduce greenhouse gas (GHG) emissions to help mitigate environmental catastrophes. One method to encourage emission reductions is to incentivize carbon capturing and carbon reducing projects while simultaneously penalising excess GHG output. Firms that invest in carbon capturing projects or reduce their emissions can receive offset credits (OCs) in return. These OCs can be used for regulatory purposes to offset their excess emissions in a compliance period. OCs may also be traded between firms. Thus, firms have the choice between investing in projects to generate OCs or to trade OCs. In this work, we present a novel market framework and characterise the optimal behaviour of GHG OC market participants in both single-player and two-player settings. We analyse both a single-period and multi-period setting. As the market model does not elicit a closed form solution, we develop a numerical methodo
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#37327;&#23376;&#27169;&#25311;&#31639;&#27861;&#65292;&#21363;&#22810;&#37325;&#20998;&#21106;&#27493;&#39588;&#37327;&#23376;&#34892;&#36208;&#31639;&#27861;&#65292;&#23427;&#32467;&#21512;&#20102;&#21442;&#25968;&#21270;&#37327;&#23376;&#30005;&#36335;&#21644;&#32463;&#20856;&#27169;&#25311;&#22120;&#19978;&#30340;&#21464;&#20998;&#27714;&#35299;&#22120;&#65292;&#21487;&#29992;&#20110;&#23398;&#20064;&#21644;&#21152;&#36733;&#22797;&#26434;&#27010;&#29575;&#20998;&#24067;&#12290;&#35813;&#31639;&#27861;&#36890;&#36807;&#24341;&#20837;&#22810;&#26234;&#33021;&#20307;&#20915;&#31574;&#36807;&#31243;&#65292;&#20351;&#20854;&#36866;&#29992;&#20110;&#37329;&#34701;&#24066;&#22330;&#24314;&#27169;&#65292;&#24182;&#23637;&#31034;&#20986;&#33391;&#22909;&#30340;&#28508;&#21147;&#12290;</title><link>http://arxiv.org/abs/2308.01844</link><description>&lt;p&gt;
&#37327;&#23376;&#37329;&#34701;&#27169;&#25311;&#21644;&#37327;&#23376;&#24577;&#21046;&#22791;&#30340;&#19968;&#31181;&#26032;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A novel approach for quantum financial simulation and quantum state preparation. (arXiv:2308.01844v1 [quant-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01844
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#37327;&#23376;&#27169;&#25311;&#31639;&#27861;&#65292;&#21363;&#22810;&#37325;&#20998;&#21106;&#27493;&#39588;&#37327;&#23376;&#34892;&#36208;&#31639;&#27861;&#65292;&#23427;&#32467;&#21512;&#20102;&#21442;&#25968;&#21270;&#37327;&#23376;&#30005;&#36335;&#21644;&#32463;&#20856;&#27169;&#25311;&#22120;&#19978;&#30340;&#21464;&#20998;&#27714;&#35299;&#22120;&#65292;&#21487;&#29992;&#20110;&#23398;&#20064;&#21644;&#21152;&#36733;&#22797;&#26434;&#27010;&#29575;&#20998;&#24067;&#12290;&#35813;&#31639;&#27861;&#36890;&#36807;&#24341;&#20837;&#22810;&#26234;&#33021;&#20307;&#20915;&#31574;&#36807;&#31243;&#65292;&#20351;&#20854;&#36866;&#29992;&#20110;&#37329;&#34701;&#24066;&#22330;&#24314;&#27169;&#65292;&#24182;&#23637;&#31034;&#20986;&#33391;&#22909;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37327;&#23376;&#24577;&#21046;&#22791;&#22312;&#37327;&#23376;&#35745;&#31639;&#21644;&#20449;&#24687;&#22788;&#29702;&#20013;&#33267;&#20851;&#37325;&#35201;&#12290;&#20934;&#30830;&#21487;&#38752;&#22320;&#21046;&#22791;&#29305;&#23450;&#30340;&#37327;&#23376;&#24577;&#23545;&#20110;&#21508;&#31181;&#24212;&#29992;&#33267;&#20851;&#37325;&#35201;&#12290;&#37327;&#23376;&#35745;&#31639;&#30340;&#19968;&#20010;&#26377;&#24076;&#26395;&#30340;&#24212;&#29992;&#26159;&#37327;&#23376;&#27169;&#25311;&#12290;&#36825;&#38656;&#35201;&#21046;&#22791;&#34920;&#31034;&#25105;&#20204;&#35201;&#27169;&#25311;&#31995;&#32479;&#30340;&#37327;&#23376;&#24577;&#12290;&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#27169;&#25311;&#31639;&#27861;&#65292;&#21363;&#22810;&#37325;&#20998;&#21106;&#27493;&#39588;&#37327;&#23376;&#34892;&#36208;&#65288;multi-SSQW&#65289;&#65292;&#37319;&#29992;&#20511;&#21161;&#21442;&#25968;&#21270;&#37327;&#23376;&#30005;&#36335;&#65288;PQC&#65289;&#21644;&#32463;&#20856;&#27169;&#25311;&#22120;&#19978;&#30340;&#21464;&#20998;&#27714;&#35299;&#22120;&#26469;&#23398;&#20064;&#21644;&#21152;&#36733;&#22797;&#26434;&#27010;&#29575;&#20998;&#24067;&#12290;&#22810;&#37325;&#20998;&#21106;&#27493;&#39588;&#37327;&#23376;&#34892;&#36208;&#31639;&#27861;&#26159;&#20998;&#21106;&#27493;&#39588;&#37327;&#23376;&#34892;&#36208;&#30340;&#25913;&#36827;&#29256;&#26412;&#65292;&#22686;&#21152;&#20102;&#22810;&#26234;&#33021;&#20307;&#20915;&#31574;&#36807;&#31243;&#65292;&#20351;&#20854;&#36866;&#29992;&#20110;&#37329;&#34701;&#24066;&#22330;&#24314;&#27169;&#12290;&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#22810;&#37325;&#20998;&#21106;&#27493;&#39588;&#37327;&#23376;&#34892;&#36208;&#31639;&#27861;&#30340;&#29702;&#35770;&#25551;&#36848;&#21644;&#23454;&#35777;&#35843;&#26597;&#65292;&#20197;&#35777;&#26126;&#20854;&#22312;&#27010;&#29575;&#20998;&#24067;&#27169;&#25311;&#20013;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
Quantum state preparation is vital in quantum computing and information processing. The ability to accurately and reliably prepare specific quantum states is essential for various applications. One of the promising applications of quantum computers is quantum simulation. This requires preparing a quantum state representing the system we are trying to simulate. This research introduces a novel simulation algorithm, the multi-Split-Steps Quantum Walk (multi-SSQW), designed to learn and load complicated probability distributions using parameterized quantum circuits (PQC) with a variational solver on classical simulators. The multi-SSQW algorithm is a modified version of the split-steps quantum walk, enhanced to incorporate a multi-agent decision-making process, rendering it suitable for modeling financial markets. The study provides theoretical descriptions and empirical investigations of the multi-SSQW algorithm to demonstrate its promising capabilities in probability distribution simula
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#37327;&#23376;&#33945;&#29305;&#21345;&#32599;&#31639;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#39640;&#32500;Black-Scholes PDE&#30340;&#39640;&#32500;&#26399;&#26435;&#23450;&#20215;&#65292;&#20854;&#22797;&#26434;&#24230;&#34987;&#22810;&#39033;&#24335;&#22320;&#38480;&#21046;&#65292;&#20811;&#26381;&#20102;&#32500;&#24230;&#35781;&#21650;&#12290;</title><link>http://arxiv.org/abs/2301.09241</link><description>&lt;p&gt;
&#37327;&#23376;&#33945;&#29305;&#21345;&#32599;&#31639;&#27861;&#22312;&#37329;&#34701;&#20013;&#39640;&#32500;&#26399;&#26435;&#23450;&#20215;&#20013;&#35299;&#20915;Black-Scholes PDE&#21450;&#20854;&#20811;&#26381;&#32500;&#24230;&#35781;&#21650;&#30340;&#35777;&#26126;
&lt;/p&gt;
&lt;p&gt;
Quantum Monte Carlo algorithm for solving Black-Scholes PDEs for high-dimensional option pricing in finance and its proof of overcoming the curse of dimensionality. (arXiv:2301.09241v2 [quant-ph] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.09241
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#37327;&#23376;&#33945;&#29305;&#21345;&#32599;&#31639;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#39640;&#32500;Black-Scholes PDE&#30340;&#39640;&#32500;&#26399;&#26435;&#23450;&#20215;&#65292;&#20854;&#22797;&#26434;&#24230;&#34987;&#22810;&#39033;&#24335;&#22320;&#38480;&#21046;&#65292;&#20811;&#26381;&#20102;&#32500;&#24230;&#35781;&#21650;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a quantum Monte Carlo algorithm for high-dimensional option pricing by solving high-dimensional Black-Scholes PDEs with correlation, and proves that its computational complexity is polynomially bounded in the space dimension and the reciprocal of the prescribed accuracy, overcoming the curse of dimensionality.
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#31181;&#37327;&#23376;&#33945;&#29305;&#21345;&#32599;&#31639;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#20855;&#26377;&#30456;&#20851;&#24615;&#30340;&#39640;&#32500;Black-Scholes PDE&#30340;&#39640;&#32500;&#26399;&#26435;&#23450;&#20215;&#12290;&#26399;&#26435;&#30340;&#25903;&#20184;&#20989;&#25968;&#20026;&#19968;&#33324;&#24418;&#24335;&#65292;&#21482;&#38656;&#35201;&#36830;&#32493;&#19988;&#20998;&#27573;&#20223;&#23556;&#65288;CPWA&#65289;&#65292;&#28085;&#30422;&#20102;&#37329;&#34701;&#20013;&#20351;&#29992;&#30340;&#22823;&#22810;&#25968;&#30456;&#20851;&#25903;&#20184;&#20989;&#25968;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#31639;&#27861;&#30340;&#20005;&#26684;&#35823;&#24046;&#20998;&#26512;&#21644;&#22797;&#26434;&#24230;&#20998;&#26512;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#31639;&#27861;&#30340;&#35745;&#31639;&#22797;&#26434;&#24230;&#22312;PDE&#30340;&#31354;&#38388;&#32500;&#24230;$d$&#21644;&#25152;&#38656;&#31934;&#24230;$\varepsilon$&#30340;&#20498;&#25968;&#20013;&#34987;&#22810;&#39033;&#24335;&#22320;&#38480;&#21046;&#65292;&#20174;&#32780;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#37327;&#23376;&#33945;&#29305;&#21345;&#32599;&#31639;&#27861;&#19981;&#20250;&#21463;&#21040;&#32500;&#24230;&#35781;&#21650;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper we provide a quantum Monte Carlo algorithm to solve high-dimensional Black-Scholes PDEs with correlation for high-dimensional option pricing. The payoff function of the option is of general form and is only required to be continuous and piece-wise affine (CPWA), which covers most of the relevant payoff functions used in finance. We provide a rigorous error analysis and complexity analysis of our algorithm. In particular, we prove that the computational complexity of our algorithm is bounded polynomially in the space dimension $d$ of the PDE and the reciprocal of the prescribed accuracy $\varepsilon$ and so demonstrate that our quantum Monte Carlo algorithm does not suffer from the curse of dimensionality.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#33021;&#22815;&#39640;&#25928;&#22788;&#29702;&#23616;&#37096;&#34892;&#20026;&#31867;&#20284;&#20110;&#31283;&#23450;L&#233;vy&#36807;&#31243;&#30340;&#36339;&#36291;&#34892;&#20026;&#30340;It&#244;&#21322;&#38789;&#30340;&#27874;&#21160;&#29575;&#20272;&#35745;&#65292;&#35813;&#26041;&#27861;&#22522;&#20110;&#19968;&#20010;&#20004;&#27493;&#21435;&#20559;&#35823;&#31243;&#24207;&#65292;&#36866;&#29992;&#20110;&#36339;&#36291;&#26159;&#26080;&#30028;&#21464;&#21270;&#30340;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2209.10128</link><description>&lt;p&gt;
&#21033;&#29992;&#21435;&#20559;&#25130;&#26029;&#23454;&#29616;&#27874;&#21160;&#29575;&#20272;&#35745;&#22788;&#29702;&#26080;&#38480;&#21464;&#21270;&#36339;&#36291;&#30340;&#39640;&#25928;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Efficient Integrated Volatility Estimation in the Presence of Infinite Variation Jumps via Debiased Truncated Realized Variations. (arXiv:2209.10128v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.10128
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#33021;&#22815;&#39640;&#25928;&#22788;&#29702;&#23616;&#37096;&#34892;&#20026;&#31867;&#20284;&#20110;&#31283;&#23450;L&#233;vy&#36807;&#31243;&#30340;&#36339;&#36291;&#34892;&#20026;&#30340;It&#244;&#21322;&#38789;&#30340;&#27874;&#21160;&#29575;&#20272;&#35745;&#65292;&#35813;&#26041;&#27861;&#22522;&#20110;&#19968;&#20010;&#20004;&#27493;&#21435;&#20559;&#35823;&#31243;&#24207;&#65292;&#36866;&#29992;&#20110;&#36339;&#36291;&#26159;&#26080;&#30028;&#21464;&#21270;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#39640;&#39057;&#35266;&#27979;&#30340;&#38543;&#26426;&#36807;&#31243;&#30340;&#32479;&#35745;&#25512;&#26029;&#24050;&#32463;&#26159;&#19968;&#20010;&#27963;&#36291;&#30340;&#30740;&#31350;&#39046;&#22495;&#36229;&#36807;&#20108;&#21313;&#24180;&#20102;&#12290;&#20854;&#20013;&#19968;&#20010;&#26368;&#20026;&#33879;&#21517;&#21644;&#24191;&#27867;&#30740;&#31350;&#30340;&#38382;&#39064;&#26159;&#20272;&#35745;&#24102;&#36339;&#36291;&#20998;&#37327;&#30340;It&#244;&#21322;&#38789;&#30340;&#20108;&#27425;&#21464;&#21270;&#37327;&#12290;&#22312;&#36339;&#36291;&#20998;&#37327;&#26159;&#26377;&#30028;&#21464;&#21270;&#30340;&#24773;&#20917;&#19979;&#65292;&#25991;&#29486;&#20013;&#24050;&#32463;&#25552;&#20986;&#20102;&#20960;&#31181;&#36895;&#29575;&#21644;&#26041;&#24046;&#39640;&#25928;&#30340;&#20272;&#35745;&#22120;&#12290;&#28982;&#32780;&#65292;&#21040;&#30446;&#21069;&#20026;&#27490;&#65292;&#20960;&#20046;&#27809;&#26377;&#26041;&#27861;&#21487;&#20197;&#22788;&#29702;&#26080;&#30028;&#21464;&#21270;&#30340;&#36339;&#36291;&#12290;&#36890;&#36807;&#24320;&#21457;&#26576;&#20123;&#23616;&#37096;&#31283;&#23450;L&#233;vy&#36807;&#31243;&#30340;&#25130;&#26029;&#30697;&#30340;&#26032;&#30340;&#39640;&#38454;&#23637;&#24320;&#65292;&#25105;&#20204;&#20026;&#19968;&#31867;It&#244;&#21322;&#38789;&#26500;&#24314;&#20102;&#19968;&#31181;&#26032;&#30340;&#36895;&#29575;&#21644;&#26041;&#24046;&#39640;&#25928;&#30340;&#27874;&#21160;&#29575;&#20272;&#35745;&#22120;&#65292;&#20854;&#20013;&#36339;&#36291;&#34892;&#20026;&#22312;&#23616;&#37096;&#19978;&#31867;&#20284;&#20110;Blumenthal-Getoor&#25351;&#25968;&#20026;$Y\in(1,8/5)$&#65288;&#22240;&#27492;&#26159;&#26080;&#30028;&#21464;&#21270;&#30340;&#65289;&#30340;&#31283;&#23450;L&#233;vy&#36807;&#31243;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#22522;&#20110;&#19968;&#20010;&#20004;&#27493;&#30340;&#21435;&#20559;&#35823;&#31243;&#24207;&#65292;&#29992;&#20110;&#35813;&#36807;&#31243;&#30340;&#25130;&#26029;&#23454;&#29616;&#30340;&#20108;&#27425;&#21464;&#21270;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
Statistical inference for stochastic processes based on high-frequency observations has been an active research area for more than two decades. One of the most well-known and widely studied problems is the estimation of the quadratic variation of the continuous component of an It\^o semimartingale with jumps. Several rate- and variance-efficient estimators have been proposed in the literature when the jump component is of bounded variation. However, to date, very few methods can deal with jumps of unbounded variation. By developing new high-order expansions of the truncated moments of a locally stable L\'evy process, we construct a new rate- and variance-efficient volatility estimator for a class of It\^o semimartingales whose jumps behave locally like those of a stable L\'evy process with Blumenthal-Getoor index $Y\in (1,8/5)$ (hence, of unbounded variation). The proposed method is based on a two-step debiasing procedure for the truncated realized quadratic variation of the process. O
&lt;/p&gt;</description></item></channel></rss>