<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#39044;&#27979;&#26356;&#26032;&#22914;&#20309;&#24433;&#21709;MRP&#35745;&#21010;&#21442;&#25968;&#65292;&#24182;&#25552;&#20986;&#20102;&#25193;&#23637;MRP&#30340;&#26041;&#27861;&#20197;&#20943;&#36731;&#20449;&#24687;&#26356;&#26032;&#23545;&#29983;&#20135;&#35746;&#21333;&#30340;&#24178;&#25200;&#12290;</title><link>https://arxiv.org/abs/2403.11010</link><description>&lt;p&gt;
&#23450;&#26399;&#39044;&#27979;&#26356;&#26032;&#22914;&#20309;&#24433;&#21709;MRP&#35745;&#21010;&#21442;&#25968;&#65306;&#19968;&#39033;&#27169;&#25311;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
How Periodic Forecast Updates Influence MRP Planning Parameters: A Simulation Study
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11010
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#39044;&#27979;&#26356;&#26032;&#22914;&#20309;&#24433;&#21709;MRP&#35745;&#21010;&#21442;&#25968;&#65292;&#24182;&#25552;&#20986;&#20102;&#25193;&#23637;MRP&#30340;&#26041;&#27861;&#20197;&#20943;&#36731;&#20449;&#24687;&#26356;&#26032;&#23545;&#29983;&#20135;&#35746;&#21333;&#30340;&#24178;&#25200;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35768;&#22810;&#20379;&#24212;&#38142;&#20013;&#65292;&#24403;&#21069;&#30340;&#25968;&#23383;&#21270;&#21162;&#21147;&#24050;&#32463;&#23548;&#33268;&#21046;&#36896;&#21830;&#21644;&#23458;&#25143;&#20043;&#38388;&#30340;&#20449;&#24687;&#20132;&#27969;&#24471;&#21040;&#25913;&#21892;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#38656;&#27714;&#39044;&#27979;&#36890;&#24120;&#30001;&#23458;&#25143;&#25552;&#20379;&#65292;&#24182;&#38543;&#30528;&#30456;&#20851;&#23458;&#25143;&#20449;&#24687;&#30340;&#25913;&#21892;&#32780;&#23450;&#26399;&#26356;&#26032;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#39044;&#27979;&#26356;&#26032;&#23545;&#29289;&#26009;&#38656;&#27714;&#35745;&#21010;&#65288;MRP&#65289;&#29983;&#20135;&#35268;&#21010;&#26041;&#27861;&#30340;&#24433;&#21709;&#12290;&#36827;&#34892;&#20102;&#27169;&#25311;&#30740;&#31350;&#65292;&#20197;&#35780;&#20272;&#20449;&#24687;&#26356;&#26032;&#22914;&#20309;&#24433;&#21709;&#28378;&#21160;&#35270;&#37326;MRP&#35745;&#21010;&#29983;&#20135;&#31995;&#32479;&#20013;&#35774;&#32622;&#35268;&#21010;&#21442;&#25968;&#12290;&#30452;&#35266;&#30340;&#32467;&#26524;&#26159;&#20449;&#24687;&#26356;&#26032;&#23548;&#33268;MRP&#26631;&#20934;&#29983;&#20135;&#35746;&#21333;&#20986;&#29616;&#24178;&#25200;&#65292;&#22240;&#27492;&#24320;&#21457;&#20102;&#19968;&#20010;&#25193;&#23637;MRP&#20197;&#20943;&#36731;&#36825;&#20123;&#24433;&#21709;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#22823;&#35268;&#27169;&#30340;&#25968;&#20540;&#27169;&#25311;&#23454;&#39564;&#34920;&#26126;&#65292;&#24320;&#21457;&#30340;MRP&#23433;&#20840;&#24211;&#23384;&#21033;&#29992;&#21551;&#21457;&#24335;&#26041;&#27861;&#26174;&#33879;&#25913;&#21892;&#20102;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11010v1 Announce Type: new  Abstract: In many supply chains, the current efforts at digitalization have led to improved information exchanges between manufacturers and their customers. Specifically, demand forecasts are often provided by the customers and regularly updated as the related customer information improves. In this paper, we investigate the influence of forecast updates on the production planning method of Material Requirements Planning (MRP). A simulation study was carried out to assess how updates in information affect the setting of planning parameters in a rolling horizon MRP planned production system. An intuitive result is that information updates lead to disturbances in the production orders for the MRP standard, and, therefore, an extension for MRP to mitigate these effects is developed. A large numerical simulation experiment shows that the MRP safety stock exploitation heuristic, that has been developed, leads to significantly improved results as far as 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#24378;&#21270;&#23398;&#20064;&#22312;&#37327;&#21270;&#20132;&#26131;&#20013;&#30340;&#36816;&#29992;&#65292;&#25581;&#31034;&#20102;&#22522;&#20110; RL &#30340;&#20132;&#26131;&#31639;&#27861;&#30340;&#26696;&#20363;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#23427;&#26377;&#28508;&#21147;&#20248;&#20110;&#20256;&#32479;&#30340;&#20132;&#26131;&#31639;&#27861;&#12290;&#36825;&#19968;&#30740;&#31350;&#20195;&#34920;&#20102;&#19968;&#20010;&#26377;&#24076;&#26395;&#30340;&#30740;&#31350;&#39046;&#22495;&#65292;&#21487;&#20197;&#28508;&#22312;&#22320;&#24341;&#23548;&#26356;&#20026;&#22797;&#26434;&#21644;&#26377;&#25928;&#30340;&#20132;&#26131;&#31995;&#32479;&#30340;&#24320;&#21457;&#12290;</title><link>http://arxiv.org/abs/2304.06037</link><description>&lt;p&gt;
&#20351;&#29992;&#28145;&#24230; Q &#23398;&#20064;&#36827;&#34892;&#37327;&#21270;&#20132;&#26131;&#12290;
&lt;/p&gt;
&lt;p&gt;
Quantitative Trading using Deep Q Learning. (arXiv:2304.06037v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.06037
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#24378;&#21270;&#23398;&#20064;&#22312;&#37327;&#21270;&#20132;&#26131;&#20013;&#30340;&#36816;&#29992;&#65292;&#25581;&#31034;&#20102;&#22522;&#20110; RL &#30340;&#20132;&#26131;&#31639;&#27861;&#30340;&#26696;&#20363;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#23427;&#26377;&#28508;&#21147;&#20248;&#20110;&#20256;&#32479;&#30340;&#20132;&#26131;&#31639;&#27861;&#12290;&#36825;&#19968;&#30740;&#31350;&#20195;&#34920;&#20102;&#19968;&#20010;&#26377;&#24076;&#26395;&#30340;&#30740;&#31350;&#39046;&#22495;&#65292;&#21487;&#20197;&#28508;&#22312;&#22320;&#24341;&#23548;&#26356;&#20026;&#22797;&#26434;&#21644;&#26377;&#25928;&#30340;&#20132;&#26131;&#31995;&#32479;&#30340;&#24320;&#21457;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24378;&#21270;&#23398;&#20064;&#26159;&#26426;&#22120;&#23398;&#20064;&#30340;&#19968;&#20010;&#20998;&#25903;&#65292;&#24050;&#34987;&#29992;&#20110;&#26426;&#22120;&#20154;&#25216;&#26415;&#12289;&#28216;&#25103;&#29609;&#27861;&#21644;&#33258;&#20027;&#31995;&#32479;&#31561;&#22810;&#31181;&#24212;&#29992;&#12290;&#36817;&#24180;&#26469;&#65292;&#20154;&#20204;&#36234;&#26469;&#36234;&#20851;&#27880;&#24378;&#21270;&#23398;&#20064;&#22312;&#37327;&#21270;&#20132;&#26131;&#39046;&#22495;&#30340;&#24212;&#29992;&#65292;&#26088;&#22312;&#22312;&#37329;&#34701;&#24066;&#22330;&#19978;&#36827;&#34892;&#30408;&#21033;&#20132;&#26131;&#12290;&#26412;&#35770;&#25991;&#25506;&#35752;&#20102; RL &#22312;&#37327;&#21270;&#20132;&#26131;&#20013;&#30340;&#20351;&#29992;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#20110; RL &#30340;&#20132;&#26131;&#31639;&#27861;&#30340;&#26696;&#20363;&#30740;&#31350;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;RL &#21487;&#20197;&#25104;&#20026;&#37327;&#21270;&#20132;&#26131;&#30340;&#24378;&#26377;&#21147;&#24037;&#20855;&#65292;&#24182;&#19988;&#23427;&#26377;&#28508;&#21147;&#20248;&#20110;&#20256;&#32479;&#30340;&#20132;&#26131;&#31639;&#27861;&#12290;&#22312;&#37327;&#21270;&#20132;&#26131;&#20013;&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#20195;&#34920;&#30528;&#19968;&#20010;&#26377;&#24076;&#26395;&#30340;&#30740;&#31350;&#39046;&#22495;&#65292;&#21487;&#20197;&#28508;&#22312;&#22320;&#24341;&#23548;&#26356;&#20026;&#22797;&#26434;&#21644;&#26377;&#25928;&#30340;&#20132;&#26131;&#31995;&#32479;&#30340;&#24320;&#21457;&#12290;&#26410;&#26469;&#30340;&#24037;&#20316;&#21487;&#20197;&#25506;&#32034;&#20351;&#29992;&#26367;&#20195;&#30340;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#65292;&#25972;&#21512;&#20854;&#20182;&#25968;&#25454;&#26469;&#28304;&#65292;&#24182;&#22312;&#19981;&#21516;&#30340;&#36164;&#20135;&#31867;&#21035;&#19978;&#27979;&#35797;&#35813;&#31995;&#32479;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#35777;&#26126;&#20102;&#23427;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
Reinforcement learning (RL) is a branch of machine learning that has been used in a variety of applications such as robotics, game playing, and autonomous systems. In recent years, there has been growing interest in applying RL to quantitative trading, where the goal is to make profitable trades in financial markets. This paper explores the use of RL in quantitative trading and presents a case study of a RL-based trading algorithm. The results show that RL can be a powerful tool for quantitative trading, and that it has the potential to outperform traditional trading algorithms. The use of reinforcement learning in quantitative trading represents a promising area of research that can potentially lead to the development of more sophisticated and effective trading systems. Future work could explore the use of alternative reinforcement learning algorithms, incorporate additional data sources, and test the system on different asset classes. Overall, our research demonstrates the potential 
&lt;/p&gt;</description></item></channel></rss>