<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#37096;&#20998;&#24459;&#27861;&#19981;&#21464;&#24615;&#30340;&#27010;&#24565;&#65292;&#36890;&#36807;&#21051;&#30011;&#37096;&#20998;&#24459;&#27861;&#19981;&#21464;&#30340;&#19968;&#33268;&#39118;&#38505;&#24230;&#37327;&#30340;&#34920;&#31034;&#20844;&#24335;&#65292;&#23558;&#20915;&#31574;&#29702;&#35770;&#21644;&#37329;&#34701;&#39118;&#38505;&#31649;&#29702;&#30340;&#25991;&#29486;&#32852;&#31995;&#36215;&#26469;&#65292;&#25552;&#20986;&#20102;&#26032;&#30340;&#39118;&#38505;&#24230;&#37327;&#65292;&#24182;&#22312;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#30340;&#39118;&#38505;&#35780;&#20272;&#20013;&#23637;&#31034;&#20102;&#20854;&#24212;&#29992;&#12290;</title><link>http://arxiv.org/abs/2401.17265</link><description>&lt;p&gt;
&#37096;&#20998;&#24459;&#27861;&#19981;&#21464;&#39118;&#38505;&#24230;&#37327;
&lt;/p&gt;
&lt;p&gt;
Partially Law-Invariant Risk Measures. (arXiv:2401.17265v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.17265
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#37096;&#20998;&#24459;&#27861;&#19981;&#21464;&#24615;&#30340;&#27010;&#24565;&#65292;&#36890;&#36807;&#21051;&#30011;&#37096;&#20998;&#24459;&#27861;&#19981;&#21464;&#30340;&#19968;&#33268;&#39118;&#38505;&#24230;&#37327;&#30340;&#34920;&#31034;&#20844;&#24335;&#65292;&#23558;&#20915;&#31574;&#29702;&#35770;&#21644;&#37329;&#34701;&#39118;&#38505;&#31649;&#29702;&#30340;&#25991;&#29486;&#32852;&#31995;&#36215;&#26469;&#65292;&#25552;&#20986;&#20102;&#26032;&#30340;&#39118;&#38505;&#24230;&#37327;&#65292;&#24182;&#22312;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#30340;&#39118;&#38505;&#35780;&#20272;&#20013;&#23637;&#31034;&#20102;&#20854;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#37096;&#20998;&#24459;&#27861;&#19981;&#21464;&#24615;&#30340;&#27010;&#24565;&#65292;&#25512;&#24191;&#20102;&#32479;&#35745;&#21644;&#37329;&#34701;&#24212;&#29992;&#20013;&#24191;&#27867;&#20351;&#29992;&#30340;&#24459;&#27861;&#19981;&#21464;&#39118;&#38505;&#24230;&#37327;&#30340;&#27010;&#24565;&#12290;&#36825;&#20010;&#26032;&#27010;&#24565;&#26159;&#30001;&#20915;&#31574;&#29702;&#35770;&#21644;&#37329;&#34701;&#39118;&#38505;&#31649;&#29702;&#30340;&#23454;&#38469;&#32771;&#34385;&#25152;&#28608;&#21457;&#30340;&#65292;&#20174;&#32780;&#36830;&#25509;&#20102;&#20915;&#31574;&#29702;&#35770;&#21644;&#37329;&#34701;&#39118;&#38505;&#31649;&#29702;&#30340;&#25991;&#29486;&#12290;&#25105;&#20204;&#36890;&#36807;&#19968;&#31181;&#26032;&#39062;&#30340;&#34920;&#31034;&#20844;&#24335;&#20805;&#20998;&#22320;&#21051;&#30011;&#20102;&#37096;&#20998;&#24459;&#27861;&#19981;&#21464;&#30340;&#19968;&#33268;&#39118;&#38505;&#24230;&#37327;&#65292;&#36825;&#20010;&#34920;&#31034;&#20844;&#24335;&#19982;&#24459;&#27861;&#19981;&#21464;&#30340;&#19968;&#33268;&#39118;&#38505;&#24230;&#37327;&#30340;&#32463;&#20856;&#20844;&#24335;&#20960;&#20046;&#27809;&#26377;&#30456;&#20284;&#20043;&#22788;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#24378;&#37096;&#20998;&#24459;&#27861;&#19981;&#21464;&#24615;&#30340;&#27010;&#24565;&#65292;&#20174;&#32780;&#21487;&#20197;&#24471;&#21040;&#19982;&#32463;&#20856;&#20844;&#24335;&#31867;&#20284;&#30340;&#34920;&#31034;&#20844;&#24335;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20960;&#31867;&#26032;&#30340;&#39118;&#38505;&#24230;&#37327;&#65292;&#21253;&#25324;&#39044;&#26399;&#25439;&#22833;&#21644;&#29109;&#39118;&#38505;&#24230;&#37327;&#30340;&#37096;&#20998;&#24459;&#27861;&#19981;&#21464;&#29256;&#26412;&#65292;&#24182;&#19988;&#23637;&#31034;&#20102;&#23427;&#20204;&#22312;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#30340;&#39118;&#38505;&#35780;&#20272;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce the concept of partial law invariance, generalizing the concept of law-invariant risk measures widely used in statistical and financial applications. This new concept is motivated by practical considerations of decision-making under uncertainty, thus connecting the literature on decision theory and that on financial risk management. We fully characterize partially law-invariant coherent risk measures via a novel representation formula, which, surprisingly, has little resemblance to the classical formula for law-invariant coherent risk measures. A notion of strong partial law invariance is introduced, allowing for a representation formula akin to the classical one. We propose a few classes of new risk measures, including partially law-invariant versions of the Expected Shortfall and the entropic risk measures, and illustrate their applications in risk assessment under model uncertainty.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21512;&#29702;&#30340;&#26041;&#27861;&#65292;&#22522;&#20110;&#29699;&#38431;&#20043;&#38388;&#30340;&#27604;&#36187;&#26469;&#20998;&#37197;FIFA&#19990;&#30028;&#26479;&#24109;&#20301;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#27431;&#27954;&#21644;&#21335;&#32654;&#29699;&#38431;&#24212;&#35813;&#33719;&#24471;&#26356;&#22810;&#24109;&#20301;&#65292;&#24182;&#24314;&#35758;&#36879;&#26126;&#22320;&#26681;&#25454;&#21382;&#21490;&#34920;&#29616;&#26469;&#20998;&#37197;&#24109;&#20301;&#12290;</title><link>http://arxiv.org/abs/2310.19100</link><description>&lt;p&gt;
&#22522;&#20110;Elo&#26041;&#27861;&#21644;&#20004;&#20004;&#27604;&#36739;&#30340;FIFA&#19990;&#30028;&#26479;&#24109;&#20301;&#20998;&#37197;
&lt;/p&gt;
&lt;p&gt;
The allocation of FIFA World Cup slots based on the Elo method and pairwise comparisons. (arXiv:2310.19100v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.19100
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21512;&#29702;&#30340;&#26041;&#27861;&#65292;&#22522;&#20110;&#29699;&#38431;&#20043;&#38388;&#30340;&#27604;&#36187;&#26469;&#20998;&#37197;FIFA&#19990;&#30028;&#26479;&#24109;&#20301;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#27431;&#27954;&#21644;&#21335;&#32654;&#29699;&#38431;&#24212;&#35813;&#33719;&#24471;&#26356;&#22810;&#24109;&#20301;&#65292;&#24182;&#24314;&#35758;&#36879;&#26126;&#22320;&#26681;&#25454;&#21382;&#21490;&#34920;&#29616;&#26469;&#20998;&#37197;&#24109;&#20301;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#19990;&#30028;&#20307;&#32946;&#38182;&#26631;&#36187;&#30340;&#36164;&#26684;&#36187;&#26159;&#26681;&#25454;&#19981;&#21516;&#30340;&#29699;&#38431;&#32452;&#36827;&#34892;&#27604;&#36187;&#65292;&#20197;&#30830;&#23450;&#32473;&#23450;&#25968;&#37327;&#30340;&#24109;&#20301;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#31181;&#21512;&#29702;&#30340;&#26041;&#27861;&#65292;&#22522;&#20110;&#36825;&#20123;&#29699;&#38431;&#20043;&#38388;&#30340;&#27604;&#36187;&#26469;&#20998;&#37197;&#24109;&#20301;&#12290;&#25105;&#20204;&#37325;&#28857;&#20851;&#27880;FIFA&#19990;&#30028;&#26479;&#65292;&#22240;&#20026;&#23384;&#22312;&#27491;&#24335;&#30340;&#35780;&#32423;&#31995;&#32479;&#65292;&#24182;&#19988;&#26368;&#36817;&#25193;&#23637;&#21040;48&#20010;&#38431;&#20237;&#12290;&#25105;&#20204;&#30340;&#25552;&#35758;&#25913;&#36827;&#20102;FIFA&#19990;&#30028;&#25490;&#21517;&#30340;&#26041;&#27861;&#65292;&#20197;&#27604;&#36739;&#20116;&#20010;&#22823;&#27954;&#30340;&#23454;&#21147;&#12290;&#26681;&#25454;&#26679;&#26412;&#38271;&#24230;&#12289;&#32771;&#34385;&#30340;&#29699;&#38431;&#32452;&#20197;&#21450;&#35780;&#32423;&#26356;&#26032;&#39057;&#29575;&#30340;&#19981;&#21516;&#65292;&#20171;&#32461;&#20102;&#21508;&#31181;&#19981;&#21516;&#30340;&#20998;&#37197;&#26041;&#26696;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#26356;&#22810;&#30340;&#27431;&#27954;&#21644;&#21335;&#32654;&#29699;&#38431;&#24212;&#35813;&#21442;&#21152;FIFA&#19990;&#30028;&#26479;&#12290;&#25353;&#29031;&#24212;&#24471;&#24109;&#20301;&#25968;&#23545;&#22823;&#27954;&#36827;&#34892;&#25490;&#21517;&#19982;FIFA&#25919;&#31574;&#26263;&#31034;&#30340;&#25490;&#21517;&#19981;&#21516;&#12290;&#25105;&#20204;&#24314;&#35758;&#33267;&#23569;&#36890;&#36807;&#36879;&#26126;&#30340;&#26041;&#24335;&#65292;&#22522;&#20110;&#21382;&#21490;&#34920;&#29616;&#26469;&#20998;&#37197;&#19968;&#20123;FIFA&#19990;&#30028;&#26479;&#24109;&#20301;&#65292;&#31867;&#20284;&#20110;&#25509;&#20837;&#21015;&#34920;
&lt;/p&gt;
&lt;p&gt;
Qualifications for several world championships in sports are organised such that different sets of teams play in their own tournament for a predetermined number of slots. This paper provides a reasonable approach to allocate the slots based on matches between these sets of teams. We focus on the FIFA World Cup due to the existence of an official rating system and its recent expansion to 48 teams. Our proposal adapts the methodology of the FIFA World Ranking to compare the strengths of five confederations. Various allocations are presented depending on the length of the sample, the set of teams considered, as well as the frequency of rating updates. The results show that more European and South American teams should play in the FIFA World Cup. The ranking of continents by the number of deserved slots is different from the ranking implied by FIFA policy. We recommend allocating at least some FIFA World Cup slots transparently, based on historical performances, similar to the access list 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#26412;&#22320;&#27874;&#21160;&#29575;&#27169;&#22411;&#65292;&#20854;&#20013;&#27874;&#21160;&#29575;&#22312;&#22522;&#30784;&#20215;&#26684;&#39640;&#20110;&#25110;&#20302;&#20110;&#26576;&#19968;&#38408;&#20540;&#26102;&#20998;&#21035;&#21462;&#20004;&#20010;&#29305;&#23450;&#21462;&#20540;&#12290;&#36890;&#36807;&#32852;&#21512;&#20998;&#24067;&#26041;&#27861;&#65292;&#30830;&#35748;&#20102;&#35813;&#27169;&#22411;&#19979;&#24403;&#38408;&#20540;&#20301;&#20110;&#24179;&#20215;&#22788;&#26102;&#65292;&#38544;&#21547;&#27874;&#21160;&#29575;&#20559;&#26012;&#30340;&#24130;&#24459;&#34892;&#20026;&#12290;</title><link>http://arxiv.org/abs/2305.10849</link><description>&lt;p&gt;
&#20855;&#26377;&#19981;&#36830;&#32493;&#24615;&#30340;&#26412;&#22320;&#27874;&#21160;&#29575;&#27169;&#22411;&#20013;&#30340;&#26497;&#31471;ATM&#20559;&#26012;&#65306;&#32852;&#21512;&#23494;&#24230;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Extreme ATM skew in a local volatility model with discontinuity: joint density approach. (arXiv:2305.10849v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.10849
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#26412;&#22320;&#27874;&#21160;&#29575;&#27169;&#22411;&#65292;&#20854;&#20013;&#27874;&#21160;&#29575;&#22312;&#22522;&#30784;&#20215;&#26684;&#39640;&#20110;&#25110;&#20302;&#20110;&#26576;&#19968;&#38408;&#20540;&#26102;&#20998;&#21035;&#21462;&#20004;&#20010;&#29305;&#23450;&#21462;&#20540;&#12290;&#36890;&#36807;&#32852;&#21512;&#20998;&#24067;&#26041;&#27861;&#65292;&#30830;&#35748;&#20102;&#35813;&#27169;&#22411;&#19979;&#24403;&#38408;&#20540;&#20301;&#20110;&#24179;&#20215;&#22788;&#26102;&#65292;&#38544;&#21547;&#27874;&#21160;&#29575;&#20559;&#26012;&#30340;&#24130;&#24459;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#26412;&#22320;&#27874;&#21160;&#29575;&#27169;&#22411;&#65292;&#20854;&#20013;&#27874;&#21160;&#29575;&#21462;&#20004;&#20010;&#21487;&#33021;&#30340;&#20540;&#65292;&#20855;&#20307;&#21462;&#20915;&#20110;&#22522;&#30784;&#20215;&#26684;&#26159;&#21542;&#39640;&#20110;&#25110;&#20302;&#20110;&#32473;&#23450;&#30340;&#38408;&#20540;&#12290;&#35813;&#27169;&#22411;&#24050;&#30693;&#65292;&#24182;&#19988;&#24050;&#32463;&#24471;&#20986;&#20102;&#35768;&#22810;&#32467;&#26524;&#12290;&#29305;&#21035;&#26159;&#65292;&#26368;&#36817;&#24050;&#32463;&#24471;&#20986;&#20102;&#27431;&#24335;&#26399;&#26435;&#26126;&#30830;&#30340;&#23450;&#20215;&#20844;&#24335;&#65292;&#24182;&#24212;&#29992;&#20110;&#30830;&#23450;&#24403;&#38408;&#20540;&#20301;&#20110;&#24179;&#20215;&#22788;&#26102;&#65292;&#38544;&#21547;&#27874;&#21160;&#29575;&#20559;&#26012;&#30340;&#24130;&#24459;&#34892;&#20026;&#12290;&#36825;&#20123;&#32467;&#26524;&#26159;&#22522;&#20110;&#25289;&#26222;&#25289;&#26031;&#21464;&#25442;&#25216;&#26415;&#33719;&#24471;&#30340;&#12290;&#26412;&#25991;&#30340;&#30446;&#30340;&#26159;&#28436;&#31034;&#22914;&#20309;&#36890;&#36807;&#21478;&#19968;&#31181;&#26041;&#27861;&#33719;&#24471;&#30456;&#21516;&#30340;&#32467;&#26524;&#12290;&#36825;&#31181;&#26367;&#20195;&#26041;&#27861;&#22522;&#20110;&#35813;&#27169;&#22411;&#19982;Skew Brownian&#36816;&#21160;&#30340;&#33258;&#28982;&#20851;&#31995;&#65292;&#24182;&#19988;&#26159;&#36890;&#36807;&#31995;&#32479;&#22320;&#20351;&#29992;&#35813;&#38543;&#26426;&#36807;&#31243;&#21450;&#20854;&#26576;&#20123;&#20989;&#25968;&#30340;&#32852;&#21512;&#20998;&#24067;&#26469;&#23454;&#29616;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper concerns a local volatility model in which volatility takes two possible values, and the specific value depends on whether the underlying price is above or below a given threshold value. The model is known, and a number of results have been obtained for it. In particular, explicit pricing formulas for European options have been recently obtained and applied to establish a power law behaviour of the implied volatility skew in the case when the threshold is taken at the money. These results have been obtained by techniques based on the Laplace transform. The purpose of the present paper is to demonstrate how to obtain the same results by another method. This alternative approach is based on the natural relationship of the model with Skew Brownian motion and consists in the systematic use of the joint distribution of this stochastic process and some of its functionals.
&lt;/p&gt;</description></item></channel></rss>