<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#25506;&#35752;&#20102;&#31639;&#27861;&#24615;&#26263;&#20013;&#21246;&#32467;&#21644;&#20215;&#26684;&#27495;&#35270;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#65292;&#21457;&#29616;&#20102;&#23548;&#33268;&#20849;&#35851;&#32467;&#26524;&#30340;&#20004;&#31181;&#26032;&#26426;&#21046;&#12290;</title><link>https://arxiv.org/abs/2403.06150</link><description>&lt;p&gt;
&#31639;&#27861;&#20849;&#35851;&#19982;&#20215;&#26684;&#27495;&#35270;&#65306;&#25968;&#25454;&#36807;&#24230;&#20351;&#29992;
&lt;/p&gt;
&lt;p&gt;
Algorithmic Collusion and Price Discrimination: The Over-Usage of Data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.06150
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#25506;&#35752;&#20102;&#31639;&#27861;&#24615;&#26263;&#20013;&#21246;&#32467;&#21644;&#20215;&#26684;&#27495;&#35270;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#65292;&#21457;&#29616;&#20102;&#23548;&#33268;&#20849;&#35851;&#32467;&#26524;&#30340;&#20004;&#31181;&#26032;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#20225;&#19994;&#23450;&#20215;&#31574;&#30053;&#36234;&#26469;&#36234;&#20381;&#36182;&#31639;&#27861;&#65292;&#20004;&#20010;&#38382;&#39064;&#24341;&#36215;&#20102;&#20154;&#20204;&#30340;&#20851;&#27880;&#65306;&#31639;&#27861;&#24615;&#26263;&#20013;&#21246;&#32467;&#21644;&#20215;&#26684;&#27495;&#35270;&#12290;&#26412;&#25991;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#20102;&#36825;&#20004;&#20010;&#38382;&#39064;&#20043;&#38388;&#30340;&#20114;&#21160;&#12290;&#27599;&#20010;&#26102;&#26399;&#65292;&#19968;&#20010;&#26032;&#30340;&#20080;&#23478;&#24102;&#30528;&#29420;&#31435;&#21516;&#20998;&#24067;&#30340;&#25903;&#20184;&#24847;&#24895;&#21040;&#26469;&#65292;&#27599;&#23478;&#20844;&#21496;&#35266;&#23519;&#21040;&#20851;&#20110;&#25903;&#20184;&#24847;&#24895;&#30340;&#31169;&#20154;&#20449;&#21495;&#65292;&#37319;&#29992;Q&#23398;&#20064;&#31639;&#27861;&#26469;&#35774;&#23450;&#20215;&#26684;&#12290;&#25105;&#20204;&#35760;&#24405;&#19979;&#20004;&#31181;&#23548;&#33268;&#20849;&#35851;&#32467;&#26524;&#30340;&#26032;&#26426;&#21046;&#12290;&#22312;&#20449;&#24687;&#19981;&#23545;&#31216;&#30340;&#24773;&#20917;&#19979;&#65292;&#20855;&#26377;&#20449;&#24687;&#20248;&#21183;&#30340;&#31639;&#27861;&#37319;&#21462;&#20102;&#8220;&#35825;&#39285;&#21644;&#38480;&#21046;-&#21033;&#29992;&#8221;&#31574;&#30053;&#65292;&#36890;&#36807;&#35774;&#32622;&#26356;&#39640;&#30340;&#20215;&#26684;&#29306;&#29298;&#20102;&#19968;&#20123;&#20449;&#21495;&#19978;&#30340;&#21033;&#28070;&#65292;&#21516;&#26102;&#36890;&#36807;&#35774;&#32622;&#26356;&#20302;&#30340;&#20215;&#26684;&#22312;&#20854;&#20313;&#20449;&#21495;&#19978;&#21033;&#29992;&#26377;&#38480;&#30340;&#21033;&#28070;&#12290;&#22312;&#23545;&#31216;&#20449;&#24687;&#32467;&#26500;&#19979;&#65292;&#23545;&#19968;&#20123;&#20449;&#21495;&#30340;&#31454;&#20105;&#20419;&#36827;&#20102;&#23545;&#20854;&#20313;&#20449;&#21495;&#19978;&#30340;&#36229;&#31454;&#20105;&#20215;&#26684;&#30340;&#25910;&#25947;&#12290;&#31639;&#27861;&#24448;&#24448;&#20250;&#23548;&#33268;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06150v1 Announce Type: new  Abstract: As firms' pricing strategies increasingly rely on algorithms, two concerns have received much attention: algorithmic tacit collusion and price discrimination. This paper investigates the interaction between these two issues through simulations. In each period, a new buyer arrives with independently and identically distributed willingness to pay (WTP), and each firm, observing private signals about WTP, adopts Q-learning algorithms to set prices. We document two novel mechanisms that lead to collusive outcomes. Under asymmetric information, the algorithm with information advantage adopts a Bait-and-Restrained-Exploit strategy, surrendering profits on some signals by setting higher prices, while exploiting limited profits on the remaining signals by setting much lower prices. Under a symmetric information structure, competition on some signals facilitates convergence to supra-competitive prices on the remaining signals. Algorithms tend to 
&lt;/p&gt;</description></item></channel></rss>