<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#23545;&#20110;&#26465;&#20214;&#24615;&#23545;&#25968;&#27491;&#24577;&#30340;SABR&#27169;&#22411;&#65292;&#35777;&#26126;&#20102;&#38646;&#25955;&#24230;&#38544;&#21547;&#27874;&#21160;&#29575;&#26159;&#27874;&#21160;&#29575;&#20114;&#25442;&#34892;&#26435;&#20215;&#30340;&#19979;&#30028;&#65292;&#35813;&#32467;&#35770;&#36866;&#29992;&#20110;&#25152;&#26377;&#30456;&#20851;&#21442;&#25968;&#65292;&#24182;&#19988;&#22312;&#30456;&#20851;&#24615;&#23567;&#20110;&#25110;&#31561;&#20110;&#38646;&#26102;&#27604;&#24179;&#20540;&#38544;&#21547;&#27874;&#21160;&#29575;&#26356;&#20026;&#31934;&#30830;&#12290;</title><link>http://arxiv.org/abs/2306.14602</link><description>&lt;p&gt;
&#19968;&#31181;&#23545;&#25968;&#27491;&#24577;SABR&#27169;&#22411;&#27874;&#21160;&#29575;&#20114;&#25442;&#30340;&#19979;&#30028;
&lt;/p&gt;
&lt;p&gt;
A lower bound for the volatility swap in the lognormal SABR model. (arXiv:2306.14602v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.14602
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23545;&#20110;&#26465;&#20214;&#24615;&#23545;&#25968;&#27491;&#24577;&#30340;SABR&#27169;&#22411;&#65292;&#35777;&#26126;&#20102;&#38646;&#25955;&#24230;&#38544;&#21547;&#27874;&#21160;&#29575;&#26159;&#27874;&#21160;&#29575;&#20114;&#25442;&#34892;&#26435;&#20215;&#30340;&#19979;&#30028;&#65292;&#35813;&#32467;&#35770;&#36866;&#29992;&#20110;&#25152;&#26377;&#30456;&#20851;&#21442;&#25968;&#65292;&#24182;&#19988;&#22312;&#30456;&#20851;&#24615;&#23567;&#20110;&#25110;&#31561;&#20110;&#38646;&#26102;&#27604;&#24179;&#20540;&#38544;&#21547;&#27874;&#21160;&#29575;&#26356;&#20026;&#31934;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35777;&#26126;&#65292;&#22312;&#30701;&#26399;&#21040;&#26399;&#30340;&#38480;&#21046;&#26465;&#20214;&#19979;&#65292;&#23545;&#20110;&#26465;&#20214;&#24615;&#23545;&#25968;&#27491;&#24577;&#30340;SABR&#27169;&#22411;&#65292;&#38646;&#25955;&#24230;&#38544;&#21547;&#27874;&#21160;&#29575;&#26159;&#27874;&#21160;&#29575;&#20114;&#25442;&#34892;&#26435;&#20215;&#30340;&#19979;&#30028;&#12290;&#23545;&#20110;&#25152;&#26377;&#30456;&#20851;&#21442;&#25968;&#65292;&#35813;&#32467;&#26524;&#37117;&#26159;&#26377;&#25928;&#30340;&#65292;&#24182;&#19988;&#22312;&#30456;&#20851;&#24615;&#23567;&#20110;&#25110;&#31561;&#20110;&#38646;&#26102;&#27604;&#24179;&#20540;&#38544;&#21547;&#27874;&#21160;&#29575;&#26356;&#20026;&#31934;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the short time to maturity limit it is proved that for the conditionally lognormal SABR model the zero vanna implied volatility is a lower bound for the volatility swap strike. The result is valid for all values of the correlation parameter and is a sharper lower bound than the at-the-money implied volatility for correlation less than or equal to zero.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20379;&#20102;Expected Shortfall&#22312;&#19968;&#33324;&#27010;&#29575;&#31354;&#38388;&#19978;&#21487;&#31215;&#38543;&#26426;&#21464;&#37327;&#31354;&#38388;&#30340;&#23545;&#20598;&#34920;&#36798;&#24335;&#30340;&#21021;&#31561;&#35777;&#26126;&#65292;&#24182;&#33719;&#24471;&#20102;Expected Shortfall&#27425;&#21152;&#24615;&#30340;&#19968;&#20010;&#26032;&#35777;&#26126;&#12290;</title><link>http://arxiv.org/abs/2306.14506</link><description>&lt;p&gt;
Expected Shortfall&#30340;&#23545;&#20598;&#34920;&#36798;&#24335;&#30340;&#21021;&#31561;&#35777;&#26126;
&lt;/p&gt;
&lt;p&gt;
An elementary proof of the dual representation of Expected Shortfall. (arXiv:2306.14506v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.14506
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;Expected Shortfall&#22312;&#19968;&#33324;&#27010;&#29575;&#31354;&#38388;&#19978;&#21487;&#31215;&#38543;&#26426;&#21464;&#37327;&#31354;&#38388;&#30340;&#23545;&#20598;&#34920;&#36798;&#24335;&#30340;&#21021;&#31561;&#35777;&#26126;&#65292;&#24182;&#33719;&#24471;&#20102;Expected Shortfall&#27425;&#21152;&#24615;&#30340;&#19968;&#20010;&#26032;&#35777;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20379;&#20102;Expected Shortfall&#22312;&#19968;&#33324;&#27010;&#29575;&#31354;&#38388;&#19978;&#21487;&#31215;&#38543;&#26426;&#21464;&#37327;&#31354;&#38388;&#30340;&#23545;&#20598;&#34920;&#36798;&#24335;&#30340;&#21021;&#31561;&#35777;&#26126;&#12290;&#19982;&#29616;&#26377;&#25991;&#29486;&#20013;&#30340;&#32467;&#26524;&#19981;&#21516;&#65292;&#25105;&#20204;&#30340;&#35777;&#26126;&#20165;&#21033;&#29992;&#20102;&#20998;&#20301;&#20989;&#25968;&#30340;&#22522;&#26412;&#23646;&#24615;&#65292;&#22240;&#27492;&#21487;&#20197;&#24456;&#23481;&#26131;&#22320;&#22312;&#20219;&#20309;&#39118;&#38505;&#24230;&#37327;&#30340;&#30740;&#31350;&#29983;&#35838;&#31243;&#20013;&#23454;&#26045;&#12290;&#20316;&#20026;&#21103;&#20135;&#21697;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;Expected Shortfall&#27425;&#21152;&#24615;&#30340;&#19968;&#20010;&#26032;&#35777;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
We provide an elementary proof of the dual representation of Expected Shortfall on the space of integrable random variables over a general probability space. Unlike the results in the extant literature, our proof only exploits basic properties of quantile functions and can thus be easily implemented in any graduate course on risk measures. As a byproduct, we obtain a new proof of the subadditivity of Expected Shortfall.
&lt;/p&gt;</description></item><item><title>&#26412;&#31687;&#35770;&#25991;&#30740;&#31350;&#22914;&#20309;&#36816;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#25552;&#21462;&#20013;&#25991;&#26032;&#38395;&#25991;&#26412;&#20449;&#24687;&#30340;&#24773;&#24863;&#22240;&#32032;&#65292;&#20197;&#26399;&#20419;&#36827;&#30693;&#24773;&#21644;&#39640;&#39057;&#30340;&#25237;&#36164;&#32452;&#21512;&#35843;&#25972;&#12290;&#36890;&#36807;&#24314;&#31435;&#20005;&#26684;&#21644;&#20840;&#38754;&#30340;&#22522;&#20934;&#27979;&#35797;&#19982;&#26631;&#20934;&#21270;&#30340;&#22238;&#27979;&#26694;&#26550;&#65292;&#20316;&#32773;&#23545;&#19981;&#21516;&#31867;&#22411; LLMs &#22312;&#35813;&#39046;&#22495;&#20869;&#30340;&#25928;&#26524;&#36827;&#34892;&#20102;&#23458;&#35266;&#35780;&#20272;&#12290;</title><link>http://arxiv.org/abs/2306.14222</link><description>&lt;p&gt;
&#25581;&#31034;&#24773;&#24863;&#30340;&#28508;&#21147;&#65306;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#33021;&#21542;&#39044;&#27979;&#20013;&#22269;&#32929;&#31080;&#20215;&#26684;&#27874;&#21160;&#65311;
&lt;/p&gt;
&lt;p&gt;
Unveiling the Potential of Sentiment: Can Large Language Models Predict Chinese Stock Price Movements?. (arXiv:2306.14222v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.14222
&lt;/p&gt;
&lt;p&gt;
&#26412;&#31687;&#35770;&#25991;&#30740;&#31350;&#22914;&#20309;&#36816;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#25552;&#21462;&#20013;&#25991;&#26032;&#38395;&#25991;&#26412;&#20449;&#24687;&#30340;&#24773;&#24863;&#22240;&#32032;&#65292;&#20197;&#26399;&#20419;&#36827;&#30693;&#24773;&#21644;&#39640;&#39057;&#30340;&#25237;&#36164;&#32452;&#21512;&#35843;&#25972;&#12290;&#36890;&#36807;&#24314;&#31435;&#20005;&#26684;&#21644;&#20840;&#38754;&#30340;&#22522;&#20934;&#27979;&#35797;&#19982;&#26631;&#20934;&#21270;&#30340;&#22238;&#27979;&#26694;&#26550;&#65292;&#20316;&#32773;&#23545;&#19981;&#21516;&#31867;&#22411; LLMs &#22312;&#35813;&#39046;&#22495;&#20869;&#30340;&#25928;&#26524;&#36827;&#34892;&#20102;&#23458;&#35266;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411; (LLMs) &#30340;&#24555;&#36895;&#21457;&#23637;&#24050;&#24341;&#21457;&#20102;&#24191;&#27867;&#30340;&#35752;&#35770;&#65292;&#20854;&#20013;&#21253;&#25324;&#23427;&#20204;&#23558;&#22914;&#20309;&#25552;&#39640;&#37327;&#21270;&#32929;&#31080;&#20132;&#26131;&#31574;&#30053;&#30340;&#22238;&#25253;&#30340;&#28508;&#21147;&#12290;&#36825;&#20123;&#35752;&#35770;&#20027;&#35201;&#22260;&#32469;&#30528;&#21033;&#29992; LLMs &#30340;&#20986;&#33394;&#29702;&#35299;&#33021;&#21147;&#26469;&#25552;&#21462;&#24773;&#24863;&#22240;&#32032;&#65292;&#20174;&#32780;&#20419;&#36827;&#30693;&#24773;&#21644;&#39640;&#39057;&#30340;&#25237;&#36164;&#32452;&#21512;&#35843;&#25972;&#12290;&#20026;&#20102;&#30830;&#20445;&#36825;&#20123; LLMs &#25104;&#21151;&#22320;&#24212;&#29992;&#20110;&#20013;&#22269;&#37329;&#34701;&#25991;&#26412;&#20998;&#26512;&#21644;&#38543;&#21518;&#30340;&#20013;&#22269;&#32929;&#31080;&#24066;&#22330;&#20132;&#26131;&#31574;&#30053;&#24320;&#21457;&#20013;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#20005;&#26684;&#21644;&#20840;&#38754;&#30340;&#22522;&#20934;&#27979;&#35797;&#20197;&#21450;&#19968;&#20010;&#26631;&#20934;&#21270;&#30340;&#22238;&#27979;&#26694;&#26550;&#65292;&#26088;&#22312;&#23458;&#35266;&#35780;&#20272;&#19981;&#21516;&#31867;&#22411; LLMs &#22312;&#20013;&#25991;&#26032;&#38395;&#25991;&#26412;&#25968;&#25454;&#30340;&#24773;&#24863;&#22240;&#32032;&#25552;&#21462;&#20013;&#30340;&#25928;&#26524;&#12290;&#20026;&#20102;&#35828;&#26126;&#25105;&#20204;&#22522;&#20934;&#27979;&#35797;&#30340;&#24037;&#20316;&#26041;&#24335;&#65292;&#25105;&#20204;&#24341;&#29992;&#20102;&#19977;&#20010;&#19981;&#21516;&#27169;&#22411;&#65306;1&#65289;&#29983;&#25104;&#24335; LLM (ChatGPT)&#65292;2&#65289;&#20013;&#25991;&#35821;&#35328;&#29305;&#23450;&#30340;&#39044;&#35757;&#32451; LLM (&#20108;&#37070;&#31070; RoBERTa)&#65292;&#20197;&#21450;&#8230;&#8230;
&lt;/p&gt;
&lt;p&gt;
The rapid advancement of Large Language Models (LLMs) has led to extensive discourse regarding their potential to boost the return of quantitative stock trading strategies. This discourse primarily revolves around harnessing the remarkable comprehension capabilities of LLMs to extract sentiment factors which facilitate informed and high-frequency investment portfolio adjustments. To ensure successful implementations of these LLMs into the analysis of Chinese financial texts and the subsequent trading strategy development within the Chinese stock market, we provide a rigorous and encompassing benchmark as well as a standardized back-testing framework aiming at objectively assessing the efficacy of various types of LLMs in the specialized domain of sentiment factor extraction from Chinese news text data. To illustrate how our benchmark works, we reference three distinctive models: 1) the generative LLM (ChatGPT), 2) the Chinese language-specific pre-trained LLM (Erlangshen-RoBERTa), and 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#23558;&#39046;&#22495;&#30693;&#35782;&#32534;&#30721;&#24212;&#29992;&#20110;&#30005;&#21147;&#20215;&#26684;&#39044;&#27979;&#20013;&#65292;&#36890;&#36807;&#22312;&#20215;&#26684;&#39044;&#27979;&#38382;&#39064;&#19978;&#26045;&#21152;&#32467;&#26500;&#26469;&#32435;&#20837;&#39046;&#22495;&#30693;&#35782;&#65292;&#24341;&#20837;&#20013;&#38388;&#25968;&#37327;&#39044;&#27979;&#21644;&#20379;&#32473;&#26354;&#32447;&#30340;&#20272;&#35745;&#21487;&#20197;&#26377;&#25928;&#20943;&#23569;&#35757;&#32451;&#25968;&#25454;&#38598;&#30340;&#38656;&#27714;&#65292;&#24182;&#25552;&#39640;&#31934;&#24230;&#12290;</title><link>http://arxiv.org/abs/2306.14186</link><description>&lt;p&gt;
&#32479;&#35745;&#30005;&#21147;&#20215;&#26684;&#39044;&#27979;&#65306;&#19968;&#31181;&#32467;&#26500;&#21270;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Statistical electricity price forecasting: A structural approach. (arXiv:2306.14186v1 [stat.AP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.14186
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#23558;&#39046;&#22495;&#30693;&#35782;&#32534;&#30721;&#24212;&#29992;&#20110;&#30005;&#21147;&#20215;&#26684;&#39044;&#27979;&#20013;&#65292;&#36890;&#36807;&#22312;&#20215;&#26684;&#39044;&#27979;&#38382;&#39064;&#19978;&#26045;&#21152;&#32467;&#26500;&#26469;&#32435;&#20837;&#39046;&#22495;&#30693;&#35782;&#65292;&#24341;&#20837;&#20013;&#38388;&#25968;&#37327;&#39044;&#27979;&#21644;&#20379;&#32473;&#26354;&#32447;&#30340;&#20272;&#35745;&#21487;&#20197;&#26377;&#25928;&#20943;&#23569;&#35757;&#32451;&#25968;&#25454;&#38598;&#30340;&#38656;&#27714;&#65292;&#24182;&#25552;&#39640;&#31934;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19982;&#30005;&#21147;&#26085;&#21069;&#20215;&#26684;&#21644;&#22522;&#26412;&#20215;&#26684;&#24418;&#25104;&#36807;&#31243;&#30456;&#20851;&#30340;&#21382;&#21490;&#25968;&#25454;&#30340;&#21487;&#29992;&#24615;&#26159;&#26377;&#38480;&#30340;&#12290;&#27492;&#22806;&#65292;&#27431;&#27954;&#30005;&#21147;&#24066;&#22330;&#27491;&#22312;&#38754;&#20020;&#24555;&#36895;&#36716;&#22411;&#65292;&#36825;&#38480;&#21046;&#20102;&#29992;&#20110;&#39044;&#27979;&#30446;&#30340;&#30340;&#26087;&#35266;&#23519;&#32467;&#26524;&#30340;&#20195;&#34920;&#24615;&#12290;&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#23558;&#34892;&#19994;&#20869;&#24050;&#32463;&#24314;&#31435;&#30340;&#39046;&#22495;&#30693;&#35782;&#32534;&#30721;&#30340;&#26377;&#25928;&#24615;&#65292;&#20197;&#20943;&#23569;&#22823;&#37327;&#35757;&#32451;&#25968;&#25454;&#38598;&#30340;&#38656;&#27714;&#12290;&#36890;&#36807;&#22312;&#20215;&#26684;&#39044;&#27979;&#38382;&#39064;&#19978;&#26045;&#21152;&#32467;&#26500;&#26469;&#32435;&#20837;&#39046;&#22495;&#30693;&#35782;&#65292;&#23454;&#39564;&#37327;&#21270;&#20102;&#30001;&#27492;&#24102;&#26469;&#30340;&#31934;&#24230;&#25552;&#39640;&#12290;&#19982;&#8220;&#38750;&#32467;&#26500;&#21270;&#8221;&#30340;&#32431;&#32479;&#35745;&#27169;&#22411;&#30456;&#27604;&#65292;&#24341;&#20837;&#36127;&#33655;&#12289;&#21487;&#20877;&#29983;&#33021;&#28304;&#27880;&#20837;&#21644;&#36328;&#30028;&#20132;&#27969;&#30340;&#20013;&#38388;&#25968;&#37327;&#39044;&#27979;&#20197;&#21450;&#20379;&#32473;&#26354;&#32447;&#30340;&#20272;&#35745;&#21487;&#20197;&#20351;NRMSE&#38477;&#20302;0.1&#12290;
&lt;/p&gt;
&lt;p&gt;
The availability of historical data related to electricity day-ahead prices and to the underlying price formation process is limited. In addition, the electricity market in Europe is facing a rapid transformation, which limits the representativeness of older observations for predictive purposes. On the other hand, machine learning methods that gained traction also in the domain of electricity price forecasting typically require large amounts of data. This study analyses the effectiveness of encoding well-established domain knowledge to mitigate the need for large training datasets. The domain knowledge is incorporated by imposing a structure on the price forecasting problem; the resulting accuracy gains are quantified in an experiment. Compared to an "unstructured" purely statistical model, it is shown that introducing intermediate quantity forecasts of load, renewable infeed, and cross-border exchange, paired with the estimation of supply curves, can result in a NRMSE reduction by 0.1
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#30701;&#38754;&#26495;&#20013;&#28508;&#22312;&#22240;&#23376;&#20998;&#26512;&#30340;&#25512;&#29702;&#24037;&#20855;&#65292;&#29983;&#25104;&#20284;&#28982;&#27604;&#32479;&#35745;&#37327;&#24182;&#24471;&#20986;&#20102;AUMPI&#29305;&#24449;&#65292;&#32463;&#23454;&#35777;&#24212;&#29992;&#21457;&#29616;&#30701;&#23376;&#26399;&#29305;&#26377;&#27874;&#21160;&#29575;&#21576;&#19978;&#21319;&#36235;&#21183;&#12290;</title><link>http://arxiv.org/abs/2306.14004</link><description>&lt;p&gt;
&#30701;&#38754;&#26495;&#20013;&#30340;&#28508;&#22312;&#22240;&#23376;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Latent Factor Analysis in Short Panels. (arXiv:2306.14004v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.14004
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#30701;&#38754;&#26495;&#20013;&#28508;&#22312;&#22240;&#23376;&#20998;&#26512;&#30340;&#25512;&#29702;&#24037;&#20855;&#65292;&#29983;&#25104;&#20284;&#28982;&#27604;&#32479;&#35745;&#37327;&#24182;&#24471;&#20986;&#20102;AUMPI&#29305;&#24449;&#65292;&#32463;&#23454;&#35777;&#24212;&#29992;&#21457;&#29616;&#30701;&#23376;&#26399;&#29305;&#26377;&#27874;&#21160;&#29575;&#21576;&#19978;&#21319;&#36235;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#30701;&#38754;&#26495;&#20013;&#28508;&#22312;&#22240;&#23376;&#20998;&#26512;&#30340;&#25512;&#29702;&#24037;&#20855;&#12290; &#22312;&#22823;&#30340;&#27178;&#25130;&#38754;&#32500;&#24230;n&#21644;&#22266;&#23450;&#26102;&#38388;&#24207;&#21015;&#32500;&#24230;T&#30340;&#20266;&#26368;&#22823;&#20284;&#28982;&#35774;&#32622;&#20013;&#65292;&#20381;&#36182;&#20110;&#38169;&#35823;&#30340;&#23545;&#35282;&#32447;T&#215;T&#21327;&#26041;&#24046;&#30697;&#38453;&#65292;&#32780;&#19981;&#24378;&#21152;&#29699;&#24418;&#25110;&#39640;&#26031;&#24615;&#12290; &#25105;&#20204;&#27010;&#36848;&#20102;&#28508;&#22312;&#22240;&#23376;&#21644;&#35823;&#24046;&#21327;&#26041;&#24046;&#20272;&#35745;&#30340;&#28176;&#36817;&#20998;&#24067;&#65292;&#20197;&#21450;&#22522;&#20110;&#20284;&#28982;&#27604;&#32479;&#35745;&#37327;&#30340;&#28176;&#36817;&#19968;&#33268;&#26368;&#26377;&#21147;&#19981;&#21464;&#65288;AUMPI&#65289;&#27979;&#35797;&#30340;&#28176;&#36817;&#20998;&#24067;&#65292;&#27979;&#35797;&#22240;&#23376;&#30340;&#25968;&#37327;&#12290; &#25105;&#20204;&#20174;&#30830;&#20445;&#27491;&#24577;&#21464;&#37327;&#20013;&#27491;&#23450;&#20108;&#27425;&#24418;&#24335;&#30340;&#21333;&#35843;&#20284;&#28982;&#27604;&#23646;&#24615;&#30340;&#19981;&#31561;&#24335;&#20013;&#23548;&#20986;&#20102;AUMPI&#29305;&#24449;&#12290; &#23545;&#32654;&#22269;&#19968;&#22823;&#25209;&#26376;&#24230;&#32929;&#31080;&#25910;&#30410;&#30340;&#23454;&#35777;&#24212;&#29992;&#22522;&#20110;&#25152;&#36873;&#22240;&#23376;&#25968;&#37327;&#65292;&#23558;&#30701;&#23376;&#26399;&#30340;&#29275;&#24066;&#19982;&#29066;&#24066;&#20043;&#21518;&#30340;&#26085;&#26399;&#31995;&#32479;&#21644;&#29305;&#26377;&#39118;&#38505;&#20998;&#24320;&#12290; &#25105;&#20204;&#35266;&#23519;&#21040;&#65292;&#26679;&#26412;&#26399;&#38388;&#29305;&#26377;&#27874;&#21160;&#29575;&#21576;&#19978;&#21319;&#36235;&#21183;&#65292;&#32780;&#31995;&#32479;&#39118;&#38505;&#20445;&#25345;&#31283;&#23450;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop inferential tools for latent factor analysis in short panels. The pseudo maximum likelihood setting under a large cross-sectional dimension $n$ and a fixed time series dimension $T$ relies on a diagonal $T \times T$ covariance matrix of the errors without imposing sphericity or Gaussianity. We outline the asymptotic distributions of the latent factor and error covariance estimates as well as of an asymptotically uniformly most powerful invariant (AUMPI) test based on the likelihood ratio statistic for tests of the number of factors. We derive the AUMPI characterization from inequalities ensuring the monotone likelihood ratio property for positive definite quadratic forms in normal variables. An empirical application to a large panel of monthly U.S. stock returns separates date after date systematic and idiosyncratic risks in short subperiods of bear vs. bull market based on the selected number of factors. We observe an uptrend in idiosyncratic volatility while the systematic
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#25552;&#20986;&#19968;&#20010;&#26032;&#30340;&#30899;&#24378;&#24230;&#27169;&#22411;&#65292;&#35780;&#20272;&#20102;&#36807;&#21435;20&#24180;&#20013;&#22269;&#21644;&#21360;&#24230;&#20303;&#23429;&#24314;&#31569;&#36816;&#33829;&#33073;&#30899;&#30340;&#36827;&#23637;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#23478;&#24237;&#25903;&#20986;&#30456;&#20851;&#30340;&#33021;&#28304;&#24378;&#24230;&#21644;&#25490;&#25918;&#22240;&#32032;&#26159;&#20303;&#23429;&#24314;&#31569;&#33073;&#30899;&#30340;&#20851;&#38190;&#65292;&#24314;&#31569;&#30005;&#27668;&#21270;&#21644;&#21487;&#20877;&#29983;&#33021;&#28304;&#24212;&#29992;&#26159;&#33073;&#30899;&#30340;&#37325;&#35201;&#25163;&#27573;&#65292;&#20294;&#20004;&#22269;&#22312;2030&#24180;&#23454;&#29616;&#36816;&#33829;&#33073;&#30899;&#30446;&#26631;&#20173;&#38754;&#20020;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2306.13858</link><description>&lt;p&gt;
&#20013;&#22269;&#21644;&#21360;&#24230;&#20303;&#23429;&#36816;&#33829;&#30340;&#33073;&#30899;&#27169;&#24335;
&lt;/p&gt;
&lt;p&gt;
Decarbonization patterns of residential building operations in China and India. (arXiv:2306.13858v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.13858
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#25552;&#20986;&#19968;&#20010;&#26032;&#30340;&#30899;&#24378;&#24230;&#27169;&#22411;&#65292;&#35780;&#20272;&#20102;&#36807;&#21435;20&#24180;&#20013;&#22269;&#21644;&#21360;&#24230;&#20303;&#23429;&#24314;&#31569;&#36816;&#33829;&#33073;&#30899;&#30340;&#36827;&#23637;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#23478;&#24237;&#25903;&#20986;&#30456;&#20851;&#30340;&#33021;&#28304;&#24378;&#24230;&#21644;&#25490;&#25918;&#22240;&#32032;&#26159;&#20303;&#23429;&#24314;&#31569;&#33073;&#30899;&#30340;&#20851;&#38190;&#65292;&#24314;&#31569;&#30005;&#27668;&#21270;&#21644;&#21487;&#20877;&#29983;&#33021;&#28304;&#24212;&#29992;&#26159;&#33073;&#30899;&#30340;&#37325;&#35201;&#25163;&#27573;&#65292;&#20294;&#20004;&#22269;&#22312;2030&#24180;&#23454;&#29616;&#36816;&#33829;&#33073;&#30899;&#30446;&#26631;&#20173;&#38754;&#20020;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20316;&#20026;&#20004;&#20010;&#25805;&#20316;&#24615;&#30899;&#25490;&#25918;&#22686;&#38271;&#26368;&#24555;&#30340;&#26032;&#20852;&#25490;&#25918;&#22269;&#65292;&#20013;&#22269;&#21644;&#21360;&#24230;&#30340;&#21382;&#21490;&#25490;&#25918;&#27169;&#24335;&#21644;&#33073;&#30899;&#21162;&#21147;&#20173;&#38656;&#36827;&#19968;&#27493;&#25506;&#35752;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#39318;&#27425;&#25552;&#20986;&#19968;&#20010;&#32771;&#34385;&#32456;&#31471;&#20351;&#29992;&#24615;&#33021;&#30340;&#30899;&#24378;&#24230;&#27169;&#22411;&#65292;&#21033;&#29992;&#25913;&#36827;&#30340;&#32467;&#26500;&#20998;&#35299;&#26041;&#27861;&#35780;&#20272;&#20102;&#36807;&#21435;20&#24180;&#20013;&#22269;&#21644;&#21360;&#24230;&#20303;&#23429;&#24314;&#31569;&#36816;&#33829;&#33073;&#30899;&#36827;&#23637;&#12290;&#32467;&#26524;&#34920;&#26126;&#65306;(1) 2000&#24180;&#33267;2020&#24180;&#38388;&#20013;&#22269;&#21644;&#21360;&#24230;&#20303;&#23429;&#24314;&#31569;&#24635;&#20307;&#36816;&#33829;&#30899;&#24378;&#24230;&#20998;&#21035;&#22686;&#21152;&#20102;1.4%&#21644;2.5%&#12290;&#23478;&#24237;&#25903;&#20986;&#30456;&#20851;&#30340;&#33021;&#28304;&#24378;&#24230;&#21644;&#25490;&#25918;&#22240;&#32032;&#26159;&#20303;&#23429;&#24314;&#31569;&#33073;&#30899;&#30340;&#20851;&#38190;&#12290; (2) &#24314;&#31569;&#30005;&#27668;&#21270;&#22312;&#20303;&#23429;&#31354;&#35843;&#65288;&#20013;&#22269;&#20943;&#23569;&#20102;87.7&#21315;&#20811;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#65292;&#21360;&#24230;&#20943;&#23569;&#20102;130.2&#21315;&#20811;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#65289;&#21644;&#23478;&#29992;&#30005;&#22120;&#65288;&#20013;&#22269;&#20943;&#23569;&#20102;169.7&#21315;&#20811;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#65292;&#21360;&#24230;&#20943;&#23569;&#20102;43.4&#21315;&#20811;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#65289;&#30340;&#33073;&#30899;&#20013;&#21457;&#25381;&#20102;&#37325;&#35201;&#20316;&#29992;&#12290; (3) &#21487;&#20877;&#29983;&#33021;&#28304;&#22312;&#30005;&#21147;&#29983;&#20135;&#20013;&#30340;&#24212;&#29992;&#26159;&#20013;&#22269;&#36816;&#33829;&#30899;&#24378;&#24230;&#19979;&#38477;&#36235;&#21183;&#30340;&#20027;&#35201;&#39537;&#21160;&#22240;&#32032;&#12290;&#20294;&#20004;&#22269;&#22312;2030&#24180;&#23454;&#29616;&#36816;&#33829;&#33073;&#30899;&#30446;&#26631;&#20173;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
As the two largest emerging emitters with the highest growth in operational carbon from residential buildings, the historical emission patterns and decarbonization efforts of China and India warrant further exploration. This study aims to be the first to present a carbon intensity model considering end-use performances, assessing the operational decarbonization progress of residential building in India and China over the past two decades using the improved decomposing structural decomposition approach. Results indicate (1) the overall operational carbon intensity increased by 1.4% and 2.5% in China and India, respectively, between 2000 and 2020. Household expenditure-related energy intensity and emission factors were crucial in decarbonizing residential buildings. (2) Building electrification played a significant role in decarbonizing space cooling (-87.7 in China and -130.2 kilograms of carbon dioxide (kgCO2) per household in India) and appliances (-169.7 in China and -43.4 kgCO2 per 
&lt;/p&gt;</description></item><item><title>&#27668;&#20505;&#21464;&#21270;&#23548;&#33268;&#26497;&#31471;&#39640;&#28201;&#65292;&#25913;&#21464;&#20102;&#20154;&#20204;&#22312;&#20844;&#20849;&#22330;&#25152;&#30340;&#20572;&#30041;&#26102;&#38388;&#65292;&#21152;&#21095;&#31181;&#26063;&#38548;&#31163;&#12290;</title><link>http://arxiv.org/abs/2306.13772</link><description>&lt;p&gt;
&#28909;&#28010;&#21152;&#21095;&#32654;&#22269;&#31181;&#26063;&#38548;&#31163;
&lt;/p&gt;
&lt;p&gt;
Heat increases experienced racial segregation in the United States. (arXiv:2306.13772v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.13772
&lt;/p&gt;
&lt;p&gt;
&#27668;&#20505;&#21464;&#21270;&#23548;&#33268;&#26497;&#31471;&#39640;&#28201;&#65292;&#25913;&#21464;&#20102;&#20154;&#20204;&#22312;&#20844;&#20849;&#22330;&#25152;&#30340;&#20572;&#30041;&#26102;&#38388;&#65292;&#21152;&#21095;&#31181;&#26063;&#38548;&#31163;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26681;&#25454;&#26368;&#36817;&#30340;&#30740;&#31350;&#65292;&#20844;&#20849;&#22330;&#25152;&#25552;&#20379;&#20102;&#20016;&#23500;&#30340;&#26426;&#20250;&#36827;&#34892;&#21508;&#31181;&#26063;&#38388;&#30340;&#20132;&#27969;&#65292;&#20294;&#27668;&#20505;&#21464;&#21270;&#23548;&#33268;&#26497;&#31471;&#39640;&#28201;&#65292;&#20010;&#20307;&#20204;&#20250;&#35843;&#25972;&#22312;&#36825;&#20123;&#22330;&#25152;&#30340;&#20572;&#30041;&#26102;&#38388;&#12290;&#25105;&#20204;&#20351;&#29992;&#20102;2018-2020&#24180;315&#20010;&#32654;&#22269;&#22478;&#24066;&#20960;&#30334;&#19975;&#20010;&#22320;&#28857;&#30340;&#22823;&#35268;&#27169;&#20154;&#27969;&#37327;&#25968;&#25454;&#26469;&#20272;&#35745;&#19981;&#21516;&#26063;&#32676;&#20043;&#38388;&#30340;&#26085;&#24120;&#25308;&#35775;&#23396;&#31435;&#25351;&#25968;&#65292;&#21457;&#29616;&#39640;&#28201;&#21152;&#21095;&#20102;&#31181;&#26063;&#38548;&#31163;&#12290;&#22312;&#27931;&#26441;&#30710;&#31561;&#22478;&#24066;&#20013;&#65292;&#22825;&#27668;&#22312;33&#176;C&#20197;&#19978;&#30340;&#19968;&#21608;&#20250;&#20351;&#24471;&#35775;&#38382;&#23396;&#31435;&#29575;&#19978;&#21319;0.7&#20010;&#30334;&#20998;&#28857;&#65292;&#30456;&#24403;&#20110;&#22686;&#21152;&#20102;14%&#30340;&#38548;&#31163;&#25351;&#25968;&#24046;&#24322;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#34920;&#26126;&#27668;&#20505;&#21464;&#21270;&#21487;&#33021;&#20250;&#21152;&#21095;&#25105;&#20204;&#38754;&#20020;&#30340;&#26368;&#26174;&#33879;&#30340;&#31038;&#20250;&#25361;&#25112;&#20043;&#19968;&#12290;
&lt;/p&gt;
&lt;p&gt;
Segregation on the basis of ethnic groups stands as a pervasive and persistent social challenge in many cities across the globe. Public spaces provide opportunities for diverse encounters but recent research suggests individuals adjust their time spent in such places to cope with extreme temperatures. We evaluate to what extent such adaptation affects racial segregation and thus shed light on a yet unexplored channel through which global warming might affect social welfare. We use large-scale foot traffic data for millions of places in 315 US cities between 2018 and 2020 to estimate an index of experienced isolation in daily visits between whites and other ethnic groups. We find that heat increases segregation. Results from panel regressions imply that a week with temperatures above 33{\deg}C in a city like Los Angeles induces an upward shift of visit isolation by 0.7 percentage points, which equals about 14% of the difference in the isolation index of Los Angeles to the more segregate
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#22312;&#25289;&#26222;&#25289;&#26031;&#27169;&#22411;&#20013;&#30740;&#31350;&#20102;&#27431;&#24335;&#26399;&#26435;&#20013;&#24076;&#33098;&#23383;&#27597;Speed&#30340;&#35299;&#26512;&#34920;&#36798;&#24335;&#65292;&#24182;&#25552;&#20379;&#20102;COS&#26041;&#27861;&#36817;&#20284;Speed&#25152;&#38656;&#28385;&#36275;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#23454;&#39564;&#35777;&#26126;&#26410;&#28385;&#36275;&#26465;&#20214;&#26102;&#32467;&#26524;&#21487;&#33021;&#19981;&#20934;&#30830;&#12290;</title><link>http://arxiv.org/abs/2306.08421</link><description>&lt;p&gt;
&#25289;&#26222;&#25289;&#26031;&#27169;&#22411;&#20013;COS&#26041;&#27861;&#20013;&#24076;&#33098;&#23383;&#27597;&#30340;&#38519;&#38449;
&lt;/p&gt;
&lt;p&gt;
Greeks' pitfalls for the COS method in the Laplace model. (arXiv:2306.08421v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08421
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#25289;&#26222;&#25289;&#26031;&#27169;&#22411;&#20013;&#30740;&#31350;&#20102;&#27431;&#24335;&#26399;&#26435;&#20013;&#24076;&#33098;&#23383;&#27597;Speed&#30340;&#35299;&#26512;&#34920;&#36798;&#24335;&#65292;&#24182;&#25552;&#20379;&#20102;COS&#26041;&#27861;&#36817;&#20284;Speed&#25152;&#38656;&#28385;&#36275;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#23454;&#39564;&#35777;&#26126;&#26410;&#28385;&#36275;&#26465;&#20214;&#26102;&#32467;&#26524;&#21487;&#33021;&#19981;&#20934;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24076;&#33098;&#23383;&#27597;Delta&#65292;Gamma&#21644;Speed&#26159;&#27431;&#24335;&#26399;&#26435;&#30456;&#23545;&#20110;&#26631;&#30340;&#36164;&#20135;&#24403;&#21069;&#20215;&#26684;&#30340;&#19968;&#38454;&#12289;&#20108;&#38454;&#21644;&#19977;&#38454;&#23548;&#25968;&#12290;&#20613;&#37324;&#21494;&#20313;&#24358;&#32423;&#25968;&#23637;&#24320;&#27861;&#65288;COS &#26041;&#27861;&#65289;&#26159;&#19968;&#31181;&#25968;&#20540;&#26041;&#27861;&#65292;&#29992;&#20110;&#36817;&#20284;&#27431;&#24335;&#26399;&#26435;&#30340;&#20215;&#26684;&#21644;&#24076;&#33098;&#23383;&#27597;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#25289;&#26222;&#25289;&#26031;&#27169;&#22411;&#20013;&#21508;&#31181;&#27431;&#24335;&#26399;&#26435;&#30340;Speed&#30340;&#38381;&#21512;&#24418;&#24335;&#34920;&#36798;&#24335;&#65292;&#24182;&#25552;&#20379;&#20102;COS&#26041;&#27861;&#36817;&#20284;Speed&#25152;&#38656;&#28385;&#36275;&#30340;&#20805;&#20998;&#26465;&#20214;&#12290;&#25105;&#20204;&#23454;&#35777;&#34920;&#26126;&#65292;&#22914;&#26524;&#36825;&#20123;&#20805;&#20998;&#26465;&#20214;&#19981;&#28385;&#36275;&#65292;COS&#26041;&#27861;&#21487;&#33021;&#20250;&#20135;&#29983;&#25968;&#23383;&#19978;&#27809;&#26377;&#24847;&#20041;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Greeks Delta, Gamma and Speed are the first, second and third derivative of a European option with respect to the current price of the underlying. The Fourier cosine series expansion method (COS method) is a numerical method for approximating the price and the Greeks of European options. We develop a closed-form expression of Speed of various European options in the Laplace model and we provide sufficient conditions for the COS method to approximate Speed. We show empirically that the COS method may produce numerically nonsensical results if theses sufficient conditions are not met.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#26694;&#26550;&#65292;&#21033;&#29992;ChatGPT&#25216;&#26415;&#22686;&#24378;&#22270;&#31070;&#32463;&#32593;&#32476;&#65292;&#33021;&#22815;&#20174;&#36130;&#32463;&#26032;&#38395;&#20013;&#25552;&#21462;&#20986;&#19981;&#26029;&#21464;&#21270;&#30340;&#32593;&#32476;&#32467;&#26500;&#65292;&#24182;&#29992;&#20110;&#32929;&#31080;&#20215;&#26684;&#39044;&#27979;&#65292;&#33719;&#24471;&#20102;&#36229;&#36807;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#26368;&#26032;&#22522;&#20934;&#30340;&#34920;&#29616;&#65292;&#25552;&#31034;&#20102;ChatGPT&#22312;&#25991;&#26412;&#25512;&#26029;&#21644;&#37329;&#34701;&#39044;&#27979;&#26041;&#38754;&#30340;&#28508;&#21147;&#12290;</title><link>http://arxiv.org/abs/2306.03763</link><description>&lt;p&gt;
ChatGPT&#20449;&#24687;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#29992;&#20110;&#32929;&#31080;&#20215;&#26684;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
ChatGPT Informed Graph Neural Network for Stock Movement Prediction. (arXiv:2306.03763v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.03763
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#26694;&#26550;&#65292;&#21033;&#29992;ChatGPT&#25216;&#26415;&#22686;&#24378;&#22270;&#31070;&#32463;&#32593;&#32476;&#65292;&#33021;&#22815;&#20174;&#36130;&#32463;&#26032;&#38395;&#20013;&#25552;&#21462;&#20986;&#19981;&#26029;&#21464;&#21270;&#30340;&#32593;&#32476;&#32467;&#26500;&#65292;&#24182;&#29992;&#20110;&#32929;&#31080;&#20215;&#26684;&#39044;&#27979;&#65292;&#33719;&#24471;&#20102;&#36229;&#36807;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#26368;&#26032;&#22522;&#20934;&#30340;&#34920;&#29616;&#65292;&#25552;&#31034;&#20102;ChatGPT&#22312;&#25991;&#26412;&#25512;&#26029;&#21644;&#37329;&#34701;&#39044;&#27979;&#26041;&#38754;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
ChatGPT&#24050;&#22312;&#21508;&#31181;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#65288;NLP&#65289;&#20219;&#21153;&#20013;&#23637;&#31034;&#20102;&#20986;&#33394;&#30340;&#33021;&#21147;&#12290;&#28982;&#32780;&#65292;&#23427;&#20174;&#26102;&#38388;&#25991;&#26412;&#25968;&#25454;&#65288;&#23588;&#20854;&#26159;&#36130;&#32463;&#26032;&#38395;&#65289;&#25512;&#26029;&#21160;&#24577;&#32593;&#32476;&#32467;&#26500;&#30340;&#28508;&#21147;&#20173;&#26159;&#19968;&#20010;&#26410;&#24320;&#21457;&#30340;&#39046;&#22495;&#12290;&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#20010;&#26032;&#30340;&#26694;&#26550;&#65292;&#21033;&#29992;ChatGPT&#30340;&#22270;&#25512;&#26029;&#33021;&#21147;&#26469;&#22686;&#24378;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNN&#65289;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#24039;&#22937;&#22320;&#20174;&#25991;&#26412;&#25968;&#25454;&#20013;&#25552;&#21462;&#20986;&#19981;&#26029;&#21464;&#21270;&#30340;&#32593;&#32476;&#32467;&#26500;&#65292;&#24182;&#23558;&#36825;&#20123;&#32593;&#32476;&#32467;&#26500;&#34701;&#21512;&#21040;&#22270;&#31070;&#32463;&#32593;&#32476;&#20013;&#65292;&#36827;&#34892;&#21518;&#32493;&#30340;&#39044;&#27979;&#20219;&#21153;&#12290;&#32929;&#31080;&#20215;&#26684;&#39044;&#27979;&#30340;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#22987;&#32456;&#20248;&#20110;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#26368;&#26032;&#22522;&#20934;&#12290;&#27492;&#22806;&#65292;&#22522;&#20110;&#25105;&#20204;&#27169;&#22411;&#30340;&#20135;&#20986;&#26500;&#24314;&#30340;&#32452;&#21512;&#23637;&#31034;&#20986;&#26356;&#39640;&#30340;&#24180;&#21270;&#32047;&#35745;&#22238;&#25253;&#12289;&#26356;&#20302;&#30340;&#27874;&#21160;&#24615;&#21644;&#26368;&#22823;&#22238;&#25764;&#12290;&#36825;&#31181;&#21331;&#36234;&#34920;&#29616;&#31361;&#26174;&#20102;ChatGPT&#29992;&#20110;&#22522;&#20110;&#25991;&#26412;&#30340;&#32593;&#32476;&#25512;&#26029;&#21644;&#37329;&#34701;&#39044;&#27979;&#24212;&#29992;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
ChatGPT has demonstrated remarkable capabilities across various natural language processing (NLP) tasks. However, its potential for inferring dynamic network structures from temporal textual data, specifically financial news, remains an unexplored frontier. In this research, we introduce a novel framework that leverages ChatGPT's graph inference capabilities to enhance Graph Neural Networks (GNN). Our framework adeptly extracts evolving network structures from textual data, and incorporates these networks into graph neural networks for subsequent predictive tasks. The experimental results from stock movement forecasting indicate our model has consistently outperformed the state-of-the-art Deep Learning-based benchmarks. Furthermore, the portfolios constructed based on our model's outputs demonstrate higher annualized cumulative returns, alongside reduced volatility and maximum drawdown. This superior performance highlights the potential of ChatGPT for text-based network inferences and 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#31163;&#25955;&#26102;&#38388;&#25351;&#25968;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#22312;&#39640;&#26031;&#26694;&#26550;&#19979;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#20854;&#20013;&#32771;&#34385;&#20102;&#25237;&#36164;&#32773;&#30693;&#26195;&#39118;&#38505;&#36164;&#20135;&#20215;&#26684;&#21464;&#21270;&#26377;&#24310;&#36831;&#30340;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2305.18136</link><description>&lt;p&gt;
&#22312;&#31163;&#25955;&#26102;&#38388;&#39640;&#26031;&#26694;&#26550;&#19979;&#30340;&#25351;&#25968;&#25928;&#29992;&#26368;&#22823;&#21270;
&lt;/p&gt;
&lt;p&gt;
Exponential Utility Maximization in a Discrete Time Gaussian Framework. (arXiv:2305.18136v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.18136
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#31163;&#25955;&#26102;&#38388;&#25351;&#25968;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#22312;&#39640;&#26031;&#26694;&#26550;&#19979;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#20854;&#20013;&#32771;&#34385;&#20102;&#25237;&#36164;&#32773;&#30693;&#26195;&#39118;&#38505;&#36164;&#20135;&#20215;&#26684;&#21464;&#21270;&#26377;&#24310;&#36831;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30701;&#25991;&#30340;&#30446;&#30340;&#26159;&#22312;&#22522;&#30784;&#36164;&#20135;&#20855;&#26377;&#22810;&#20803;&#27491;&#24577;&#20998;&#24067;&#30340;&#24773;&#20917;&#19979;&#25552;&#20986;&#31163;&#25955;&#26102;&#38388;&#25351;&#25968;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#38500;&#20102;&#25968;&#23398;&#37329;&#34701;&#20013;&#36890;&#24120;&#32771;&#34385;&#30340;&#24773;&#26223;&#22806;&#65292;&#25105;&#20204;&#36824;&#32771;&#34385;&#20102;&#19968;&#20010;&#20102;&#35299;&#39118;&#38505;&#36164;&#20135;&#20215;&#26684;&#21464;&#21270;&#30340;&#25237;&#36164;&#32773;&#26377;&#24310;&#36831;&#30340;&#24773;&#20917;&#12290;&#25105;&#20204;&#30340;&#35299;&#20915;&#26041;&#26696;&#22522;&#20110;[4]&#20013;&#25552;&#20986;&#30340;&#29702;&#35770;&#21644;&#29468;&#27979;&#26368;&#20248;&#32452;&#21512;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
The aim of this short note is to present a solution to the discrete time exponential utility maximization problem in a case where the underlying asset has a multivariate normal distribution. In addition to the usual setting considered in Mathematical Finance, we also consider an investor who is informed about the risky asset's price changes with a delay. Our method of solution is based on the theory developed in [4] and guessing the optimal portfolio.
&lt;/p&gt;</description></item><item><title>&#20998;&#26512;&#20102;&#24615;&#21035;&#20998;&#21106;&#21171;&#21160;&#21147;&#24066;&#22330;&#22312;&#22269;&#38469;&#36152;&#26131;&#20013;&#30340;&#26412;&#22320;&#24433;&#21709;&#65292;&#29702;&#35770;&#26694;&#26550;&#23637;&#31034;&#20986;&#34892;&#19994;&#23545;&#20110;&#22806;&#37096;&#38656;&#27714;&#20914;&#20987;&#30340;&#21453;&#24212;&#20915;&#23450;&#30528;&#22899;&#24615;&#30456;&#23545;&#20110;&#30007;&#24615;&#23601;&#19994;&#30340;&#27604;&#29575;&#22686;&#21152;&#25110;&#20943;&#23569;&#12290;&#22312;&#31361;&#23612;&#26031;&#30340;&#23454;&#35777;&#32467;&#26524;&#20063;&#35777;&#26126;&#20102;&#27492;&#29702;&#35770;&#12290;</title><link>http://arxiv.org/abs/2301.09252</link><description>&lt;p&gt;
&#8220;&#24615;&#21035;&#20998;&#21106;&#30340;&#21171;&#21160;&#21147;&#24066;&#22330;&#19982;&#36152;&#26131;&#38663;&#33633;&#8221;
&lt;/p&gt;
&lt;p&gt;
Gender-Segmented Labor Markets and Trade Shocks. (arXiv:2301.09252v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.09252
&lt;/p&gt;
&lt;p&gt;
&#20998;&#26512;&#20102;&#24615;&#21035;&#20998;&#21106;&#21171;&#21160;&#21147;&#24066;&#22330;&#22312;&#22269;&#38469;&#36152;&#26131;&#20013;&#30340;&#26412;&#22320;&#24433;&#21709;&#65292;&#29702;&#35770;&#26694;&#26550;&#23637;&#31034;&#20986;&#34892;&#19994;&#23545;&#20110;&#22806;&#37096;&#38656;&#27714;&#20914;&#20987;&#30340;&#21453;&#24212;&#20915;&#23450;&#30528;&#22899;&#24615;&#30456;&#23545;&#20110;&#30007;&#24615;&#23601;&#19994;&#30340;&#27604;&#29575;&#22686;&#21152;&#25110;&#20943;&#23569;&#12290;&#22312;&#31361;&#23612;&#26031;&#30340;&#23454;&#35777;&#32467;&#26524;&#20063;&#35777;&#26126;&#20102;&#27492;&#29702;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#28857;&#30740;&#31350;&#24615;&#21035;&#20998;&#21106;&#21171;&#21160;&#21147;&#24066;&#22330;&#22914;&#20309;&#24433;&#21709;&#22269;&#38469;&#36152;&#26131;&#30340;&#26412;&#22320;&#25928;&#24212;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#26500;&#24314;&#19968;&#20010;&#29702;&#35770;&#26694;&#26550;&#65292;&#23558;&#36152;&#26131;&#21644;&#24615;&#21035;&#20998;&#21106;&#30340;&#21171;&#21160;&#21147;&#24066;&#22330;&#32467;&#21512;&#36215;&#26469;&#65292;&#20197;&#23637;&#31034;&#22806;&#37096;&#38656;&#27714;&#20914;&#20987;&#21487;&#33021;&#22686;&#21152;&#25110;&#20943;&#23569;&#22899;&#24615;&#30456;&#23545;&#20110;&#30007;&#24615;&#30340;&#23601;&#19994;&#27604;&#29575;&#12290;&#20851;&#38190;&#30340;&#29702;&#35770;&#32467;&#26524;&#27491;&#24335;&#34920;&#26126;&#65292;&#36152;&#26131;&#23545;&#24615;&#21035;&#20998;&#21106;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#24433;&#21709;&#20851;&#38190;&#21462;&#20915;&#20110;&#65288;a&#65289;&#38754;&#23545;&#22806;&#22269;&#38656;&#27714;&#20914;&#20987;&#30340;&#34892;&#19994;&#65307;&#20197;&#21450;&#65288;b&#65289;&#38656;&#27714;&#20914;&#20987;&#26469;&#33258;&#30340;&#22269;&#22806;&#24066;&#22330;&#22312;&#22269;&#20869;&#30340;&#30456;&#20851;&#37325;&#35201;&#24615;&#12290;&#22914;&#26524;&#19968;&#20010;&#30456;&#20851;&#24066;&#22330;&#30340;&#22806;&#37096;&#38656;&#27714;&#20914;&#20987;&#21457;&#29983;&#22312;&#19968;&#20010;&#22899;&#24615;&#23494;&#38598;&#65288;&#30007;&#24615;&#23494;&#38598;&#65289;&#30340;&#34892;&#19994;&#20013;&#65292;&#37027;&#20040;&#27169;&#22411;&#39044;&#27979;&#22899;&#24615;&#30456;&#23545;&#20110;&#30007;&#24615;&#30340;&#23601;&#19994;&#27604;&#29575;&#24212;&#35813;&#22686;&#21152;&#65288;&#19979;&#38477;&#65289;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#21033;&#29992;&#31361;&#23612;&#26031;&#26412;&#22320;&#21171;&#21160;&#21147;&#24066;&#22330;&#26292;&#38706;&#20110;&#22806;&#37096;&#38656;&#27714;&#20914;&#20987;&#30340;&#21487;&#20449;&#22806;&#29983;&#21464;&#21270;&#65292;&#24182;&#23637;&#31034;&#23454;&#35777;&#32467;&#26524;&#19982;&#29702;&#35770;&#39044;&#27979;&#19968;&#33268;&#12290;&#22312;&#31361;&#23612;&#26031;&#36825;&#26679;&#19968;&#20010;&#22269;&#23478;&#65292;
&lt;/p&gt;
&lt;p&gt;
This paper focuses on how gender segmentation in labor markets shapes the local effects of international trade. We first develop a theoretical framework that embeds trade and gender-segmented labor markets to show that foreign demand shocks may either increase or decrease the female-to-male employment ratio. The key theoretical result shows formally that the effects of trade on gender-segmented labor markets depend crucially on (a) the sectors that face the foreign demand shock; and (b) the domestic relevance of the foreign countries in which the demand shocks originate from. If the foreign demand shock from a relevant market happens in a female-intensive (male-intensive) sector, the model predicts that the female-to-male employment ratio should increase (decrease). We then use plausibly exogenous variation in the exposure of Tunisian local labor markets to foreign demand shocks and show that the empirical results are consistent with the theoretical prediction. In Tunisia, a country wi
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#24120;&#37327;&#20989;&#25968;&#24066;&#22330;&#21046;&#36896;&#32773;&#65288;CFMM&#65289;&#30340;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#65292;&#21457;&#29616;CFMM&#34920;&#29616;&#19981;&#22914;&#20877;&#24179;&#34913;&#31574;&#30053;&#65292;&#25552;&#20986;&#20102;&#25439;&#22833;&#19982;&#20877;&#24179;&#34913;(LVR)&#30340;&#27010;&#24565;&#65292;&#21487;&#29992;&#20110;&#35780;&#20272;&#25237;&#36164;&#20915;&#31574;&#21644;&#25351;&#23548;&#21327;&#35758;&#35774;&#35745;&#12290;</title><link>http://arxiv.org/abs/2208.06046</link><description>&lt;p&gt;
&#33258;&#21160;&#21270;&#24066;&#22330;&#20570;&#24066;&#21830;&#21450;&#25439;&#22833;&#19982;&#20877;&#24179;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;
Automated Market Making and Loss-Versus-Rebalancing. (arXiv:2208.06046v3 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.06046
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#24120;&#37327;&#20989;&#25968;&#24066;&#22330;&#21046;&#36896;&#32773;&#65288;CFMM&#65289;&#30340;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#65292;&#21457;&#29616;CFMM&#34920;&#29616;&#19981;&#22914;&#20877;&#24179;&#34913;&#31574;&#30053;&#65292;&#25552;&#20986;&#20102;&#25439;&#22833;&#19982;&#20877;&#24179;&#34913;(LVR)&#30340;&#27010;&#24565;&#65292;&#21487;&#29992;&#20110;&#35780;&#20272;&#25237;&#36164;&#20915;&#31574;&#21644;&#25351;&#23548;&#21327;&#35758;&#35774;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20174;&#34987;&#21160;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#35282;&#24230;&#32771;&#34385;&#20102;&#24120;&#37327;&#20989;&#25968;&#24066;&#22330;&#21046;&#36896;&#32773;&#65288;CFMM&#65289;&#30340;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#12290;&#22312;Black-Scholes&#24773;&#22659;&#19979;&#65292;&#25105;&#20204;&#27604;&#36739;CFMM&#30340;&#34920;&#29616;&#19982;&#20877;&#24179;&#34913;&#31574;&#30053;&#30340;&#34920;&#29616;&#65292;&#35813;&#31574;&#30053;&#22312;&#24066;&#22330;&#20215;&#26684;&#19978;&#22797;&#21046;CFMM&#30340;&#20132;&#26131;&#12290;&#30001;&#20110;CFMM&#20197;&#27604;&#24066;&#22330;&#20215;&#26684;&#26356;&#24046;&#30340;&#20215;&#26684;&#25191;&#34892;&#25152;&#26377;&#20132;&#26131;&#65292;&#22240;&#27492;CFMM&#31995;&#32479;&#22320;&#34920;&#29616;&#19981;&#20339;&#12290;&#20004;&#31181;&#31574;&#30053;&#20043;&#38388;&#30340;&#32489;&#25928;&#24046;&#24322;&#8220;&#25439;&#22833;&#19982;&#20877;&#24179;&#34913;&#8221;&#65288;LVR&#65292;&#21457;&#38899;&#20026;&#8220;lever&#8221;&#65289;&#21462;&#20915;&#20110;&#22522;&#30784;&#36164;&#20135;&#30340;&#27874;&#21160;&#29575;&#21644;CFMM bonding&#20989;&#25968;&#30340;&#36793;&#38469;&#27969;&#21160;&#24615;&#12290;&#25105;&#20204;&#27169;&#22411;&#20013;&#30340;CFMM&#25439;&#22833;&#34920;&#36798;&#24335;&#19982;Uniswap v2 WETH-USDC&#23545;&#30340;&#23454;&#38469;&#25439;&#22833;&#30456;&#21305;&#37197;&#12290;LVR&#20026;CFMM&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#25237;&#36164;&#20915;&#31574;&#30340;&#21069;&#21518;&#35780;&#20272;&#25552;&#20379;&#20102;&#21487;&#20132;&#26131;&#30340;&#35265;&#35299;&#65292;&#24182;&#19988;&#36824;&#21487;&#20197;&#25351;&#23548;CFMM&#21327;&#35758;&#30340;&#35774;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the market microstructure of constant function market makers (CFMMs) from the perspective of passive liquidity providers (LPs). In a Black-Scholes setting, we compare the CFMM's performance to that of a rebalancing strategy, which replicates the CFMM's trades at market prices. The CFMM systematically underperforms the rebalancing strategy, because it executes all trades at worse-than-market prices. The performance gap between the two strategies, "loss-versus-rebalancing" (LVR, pronounced "lever"), depends on the volatility of the underlying asset and the marginal liquidity of the CFMM bonding function. Our model's expressions for CFMM losses match actual losses from the Uniswap v2 WETH-USDC pair. LVR provides tradeable insight in both the ex ante and ex post assessment of CFMM LP investment decisions, and can also inform the design of CFMM protocols.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;NMVM&#20998;&#24067;&#65292;&#33719;&#24471;&#20102;&#22343;&#20540;-&#26465;&#20214;&#20215;&#20540;&#39118;&#38505;&#19979;&#30340;&#21069;&#27839;&#25237;&#36164;&#32452;&#21512;&#30340;&#38381;&#21512;&#24418;&#24335;&#34920;&#36798;&#24335;&#12290;</title><link>http://arxiv.org/abs/2202.02488</link><description>&lt;p&gt;
&#22522;&#20110;&#22343;&#20540;-&#26041;&#24046;-&#28151;&#21512;&#27169;&#22411;&#30340;&#38543;&#26426;&#20248;&#21183;&#21644;&#22343;&#20540;-&#26465;&#20214;&#20215;&#20540;&#39118;&#38505;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#38382;&#39064;&#35752;&#35770;
&lt;/p&gt;
&lt;p&gt;
A discussion of stochastic dominance and mean-CVaR optimal portfolio problems based on mean-variance-mixture models. (arXiv:2202.02488v4 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.02488
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;NMVM&#20998;&#24067;&#65292;&#33719;&#24471;&#20102;&#22343;&#20540;-&#26465;&#20214;&#20215;&#20540;&#39118;&#38505;&#19979;&#30340;&#21069;&#27839;&#25237;&#36164;&#32452;&#21512;&#30340;&#38381;&#21512;&#24418;&#24335;&#34920;&#36798;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32463;&#20856;&#30340;&#39532;&#31185;&#32500;&#33576;&#22343;&#20540;-&#26041;&#24046;&#27169;&#22411;&#20351;&#29992;&#26041;&#24046;&#20316;&#20026;&#39118;&#38505;&#24230;&#37327;&#65292;&#24182;&#20351;&#29992;&#26631;&#20934;&#20248;&#21270;&#25216;&#26415;&#35745;&#31639;&#38381;&#21512;&#24418;&#24335;&#30340;&#21069;&#27839;&#25237;&#36164;&#32452;&#21512;&#12290;&#23545;&#20110;&#19968;&#33324;&#30340;&#22343;&#20540;&#39118;&#38505;&#27169;&#22411;&#65292;&#36825;&#26679;&#30340;&#38381;&#21512;&#24418;&#24335;&#30340;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#24456;&#38590;&#33719;&#24471;&#12290;&#26412;&#25991;&#36890;&#36807;&#22312;&#25910;&#30410;&#21521;&#37327;&#20855;&#26377;&#27491;&#24577;&#22343;&#20540;-&#26041;&#24046;&#28151;&#21512;&#20998;&#24067;&#65288;NMVM&#65289;&#30340;&#24773;&#20917;&#19979;&#65292;&#33719;&#24471;&#22343;&#20540;-&#26465;&#20214;&#20215;&#20540;&#39118;&#38505;&#65288;mean-CVaR&#65289;&#20934;&#21017;&#19979;&#30340;&#21069;&#27839;&#25237;&#36164;&#32452;&#21512;&#30340;&#38381;&#21512;&#24418;&#24335;&#34920;&#36798;&#24335;&#12290;&#20026;&#20102;&#36798;&#21040;&#36825;&#20010;&#30446;&#26631;&#65292;&#25105;&#20204;&#39318;&#20808;&#25552;&#20986;&#20102;&#19968;&#32500;NMVM&#27169;&#22411;&#31867;&#20869;&#38543;&#26426;&#20248;&#21183;&#30340;&#24517;&#35201;&#26465;&#20214;&#65292;&#28982;&#21518;&#23558;&#20854;&#24212;&#29992;&#20110;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#12290;&#26412;&#25991;&#30340;&#20027;&#35201;&#32467;&#26524;&#34920;&#26126;&#65306;&#24403;&#25910;&#30410;&#21521;&#37327;&#36981;&#24490;NMVM&#20998;&#24067;&#26102;&#65292;&#30456;&#20851;&#30340;&#22343;&#20540;-CVaR&#21069;&#27839;&#25237;&#36164;&#32452;&#21512;&#21487;&#20197;&#36890;&#36807;&#20248;&#21270;&#36866;&#24403;&#35843;&#25972;&#30340;&#25910;&#30410;&#21521;&#37327;&#30340;&#39532;&#31185;&#32500;&#33576;&#22343;&#20540;-&#26041;&#24046;&#27169;&#22411;&#26469;&#33719;&#24471;&#12290;
&lt;/p&gt;
&lt;p&gt;
The classical Markowitz mean-variance model uses variance as a risk measure and calculates frontier portfolios in closed form by using standard optimization techniques. For general mean-risk models such closed form optimal portfolios are difficult to obtain. In this note, we obtain closed form expressions for frontier portfolios under mean-CVaR criteria when return vectors have normal mean-variance mixture (NMVM) distributions. To achieve this goal, we first present necessary conditions for stochastic dominance within the class of one dimensional NMVM models and then we apply them to portfolio optimization problems. Our main result in this paper states that when return vectors follow NMVM distributions the associated mean- CVaR frontier portfolios can be obtained by optimizing a Markowitz mean-variance model with an appropriately adjusted return vector
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#20351;&#29992;&#22238;&#24402;&#26641;/&#38543;&#26426;&#26862;&#26519;&#20272;&#35745;&#26465;&#20214;&#26399;&#26395;&#65292;&#24182;&#22312;&#25968;&#20540;&#32467;&#26524;&#19978;&#21462;&#24471;&#20102;&#34920;&#29616;&#36229;&#36807;&#20808;&#21069;&#37329;&#34701;&#25991;&#29486;&#30340;&#36827;&#23637;&#12290;</title><link>http://arxiv.org/abs/2201.02587</link><description>&lt;p&gt;
&#20351;&#29992;&#22238;&#24402;&#26641;/&#38543;&#26426;&#26862;&#26519;&#23450;&#20215;&#30334;&#24917;&#22823;&#26399;&#26435;
&lt;/p&gt;
&lt;p&gt;
Pricing Bermudan options using regression trees/random forests. (arXiv:2201.02587v2 [q-fin.CP] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.02587
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20351;&#29992;&#22238;&#24402;&#26641;/&#38543;&#26426;&#26862;&#26519;&#20272;&#35745;&#26465;&#20214;&#26399;&#26395;&#65292;&#24182;&#22312;&#25968;&#20540;&#32467;&#26524;&#19978;&#21462;&#24471;&#20102;&#34920;&#29616;&#36229;&#36807;&#20808;&#21069;&#37329;&#34701;&#25991;&#29486;&#30340;&#36827;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32654;&#24335;&#26399;&#26435;&#30340;&#20215;&#20540;&#26159;&#26399;&#26435;&#25240;&#29616;&#29616;&#37329;&#27969;&#30340;&#26368;&#22823;&#21270;&#20215;&#20540;&#12290;&#22312;&#27599;&#20010;&#26102;&#38388;&#27493;&#39588;&#20013;&#65292;&#38656;&#35201;&#23558;&#21363;&#26102;&#34892;&#26435;&#20215;&#20540;&#19982;&#32487;&#32493;&#20215;&#20540;&#36827;&#34892;&#27604;&#36739;&#65292;&#24182;&#22312;&#34892;&#26435;&#20215;&#20540;&#20005;&#26684;&#22823;&#20110;&#32487;&#32493;&#20215;&#20540;&#26102;&#20915;&#23450;&#34892;&#26435;&#12290;&#25105;&#20204;&#21487;&#20197;&#23558;&#36825;&#20010;&#38382;&#39064;&#21015;&#20026;&#19968;&#20010;&#21160;&#24577;&#35268;&#21010;&#26041;&#31243;&#65292;&#20854;&#20013;&#20027;&#35201;&#22256;&#38590;&#26159;&#35745;&#31639;&#27599;&#20010;&#26102;&#38388;&#27493;&#39588;&#34920;&#31034;&#32487;&#32493;&#20215;&#20540;&#30340;&#26465;&#20214;&#26399;&#26395;&#12290;&#22312;(Longstaff&#21644;Schwartz&#65292;2001)&#20013;&#65292;&#36825;&#20123;&#26465;&#20214;&#26399;&#26395;&#26159;&#21033;&#29992;&#26377;&#38480;&#32500;&#21521;&#37327;&#31354;&#38388;&#65288;&#36890;&#24120;&#26159;&#22810;&#39033;&#24335;&#22522;&#65289;&#19978;&#30340;&#22238;&#24402;&#20272;&#35745;&#20986;&#26469;&#30340;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#36981;&#24490;&#30456;&#21516;&#30340;&#31639;&#27861;&#65307;&#21482;&#26159;&#26465;&#20214;&#26399;&#26395;&#26159;&#37319;&#29992;&#22238;&#24402;&#26641;&#25110;&#38543;&#26426;&#26862;&#26519;&#20272;&#35745;&#20986;&#26469;&#30340;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#24403;&#26631;&#20934;&#26368;&#23567;&#20108;&#20056;&#22238;&#24402;&#34987;&#22238;&#24402;&#26641;&#26367;&#25442;&#26102;&#65292;LS&#31639;&#27861;&#30340;&#25910;&#25947;&#24615;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#25581;&#31034;&#20102;&#19968;&#20123;&#22238;&#24402;&#26641;&#21644;&#38543;&#26426;&#26862;&#26519;&#30340;&#25968;&#20540;&#32467;&#26524;&#65307;&#36825;&#20123;&#32467;&#26524;&#34920;&#26126;&#36825;&#20010;&#26032;&#31639;&#27861;&#25361;&#25112;&#20102;&#20043;&#21069;&#37329;&#34701;&#25991;&#29486;&#30340;&#26368;&#26032;&#30740;&#31350;&#25104;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
The value of an American option is the maximized value of the discounted cash flows from the option. At each time step, one needs to compare the immediate exercise value with the continuation value and decide to exercise as soon as the exercise value is strictly greater than the continuation value. We can formulate this problem as a dynamic programming equation, where the main difficulty comes from the computation of the conditional expectations representing the continuation values at each time step. In (Longstaff and Schwartz, 2001), these conditional expectations were estimated using regressions on a finite-dimensional vector space (typically a polynomial basis). In this paper, we follow the same algorithm; only the conditional expectations are estimated using Regression trees or Random forests. We discuss the convergence of the LS algorithm when the standard least squares regression is replaced with regression trees. Finally, we expose some numerical results with regression trees an
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#38750;&#27954;&#30719;&#19994;&#24320;&#37319;&#23545;&#24403;&#22320;&#32463;&#27982;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#30719;&#20117;&#24320;&#25918;&#20250;&#26174;&#33879;&#20419;&#36827;&#24403;&#22320;&#22478;&#24066;&#22320;&#21306;&#30340;&#22686;&#38271;&#65292;&#20294;&#25919;&#27835;&#36164;&#28304;&#35781;&#21650;&#23384;&#22312;&#20110;&#23041;&#26435;&#20027;&#20041;&#22269;&#23478;&#65292;&#32780;&#30701;&#26242;&#30340;&#22686;&#38271;&#20165;&#20250;&#38543;&#30528;&#30719;&#20117;&#30340;&#20851;&#38381;&#32780;&#20943;&#36864;&#12290;</title><link>http://arxiv.org/abs/2111.05783</link><description>&lt;p&gt;
&#38750;&#27954;&#30719;&#19994;&#23545;&#24403;&#22320;&#32463;&#27982;&#30340;&#24433;&#21709;&#65306;&#22522;&#20110;&#22235;&#21313;&#24180;&#21355;&#26143;&#22270;&#20687;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
The Local Economic Impact of Mineral Mining in Africa: Evidence from Four Decades of Satellite Imagery. (arXiv:2111.05783v4 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2111.05783
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#38750;&#27954;&#30719;&#19994;&#24320;&#37319;&#23545;&#24403;&#22320;&#32463;&#27982;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#30719;&#20117;&#24320;&#25918;&#20250;&#26174;&#33879;&#20419;&#36827;&#24403;&#22320;&#22478;&#24066;&#22320;&#21306;&#30340;&#22686;&#38271;&#65292;&#20294;&#25919;&#27835;&#36164;&#28304;&#35781;&#21650;&#23384;&#22312;&#20110;&#23041;&#26435;&#20027;&#20041;&#22269;&#23478;&#65292;&#32780;&#30701;&#26242;&#30340;&#22686;&#38271;&#20165;&#20250;&#38543;&#30528;&#30719;&#20117;&#30340;&#20851;&#38381;&#32780;&#20943;&#36864;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36816;&#29992;&#35745;&#31639;&#26426;&#35270;&#35273;&#30340;&#26368;&#26032;&#25216;&#26415;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;1984&#24180;&#33267;2019&#24180;&#26399;&#38388;&#35206;&#30422;&#38750;&#27954;&#22823;&#38470;12%&#30340;100&#19975;&#24352;&#21355;&#26143;&#22270;&#20687;&#65292;&#36319;&#36394;1,658&#20010;&#30719;&#24202;&#21608;&#22260;&#30340;&#24403;&#22320;&#21457;&#23637;&#24773;&#20917;&#12290;&#25105;&#20204;&#20351;&#29992;&#22534;&#31215;&#20107;&#20214;&#30740;&#31350;&#21644;&#24046;&#24322;&#27861;&#27169;&#22411;&#26469;&#20272;&#35745;&#30719;&#20117;&#24320;&#25918;&#21644;&#20851;&#38381;&#30340;&#24433;&#21709;&#12290;&#30719;&#20117;&#24320;&#25918;&#30340;&#24433;&#21709;&#31243;&#24230;&#30456;&#24403;&#22823;- 15&#24180;&#21518;&#65292;&#22312;&#24320;&#25918;&#30719;&#20117;20&#20844;&#37324;&#20869;&#30340;&#22478;&#24066;&#22320;&#21306;&#20960;&#20046;&#22686;&#38271;&#20102;&#19968;&#20493;&#12290;&#25105;&#20204;&#21457;&#29616;&#24378;&#26377;&#21147;&#30340;&#25919;&#27835;&#36164;&#28304;&#35781;&#21650;&#22312;&#22320;&#26041;&#23618;&#38754;&#23384;&#22312;&#12290;&#23613;&#31649;&#30719;&#19994;&#22312;&#27665;&#20027;&#22269;&#23478;&#20013;&#25552;&#25391;&#20102;&#24403;&#22320;&#32463;&#27982;&#65292;&#20294;&#22312;&#23041;&#26435;&#20027;&#20041;&#22269;&#23478;&#20013;&#65292;&#36825;&#20123;&#25910;&#30410;&#24494;&#19981;&#36275;&#36947;&#65292;&#24182;&#20197;&#19977;&#20493;&#20110;&#30719;&#19994;&#24320;&#23637;&#21069;&#30340;&#20914;&#31361;&#21487;&#33021;&#24615;&#20026;&#20195;&#20215;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#30719;&#21306;&#21152;&#36895;&#22686;&#38271;&#20165;&#26159;&#26242;&#26102;&#30340;&#65292;&#38543;&#30528;&#30719;&#20117;&#20851;&#38381;&#32780;&#20943;&#36864;&#12290;
&lt;/p&gt;
&lt;p&gt;
Using state-of-the-art techniques in computer vision, we analyze one million satellite images covering 12% of the African continent between 1984 and 2019 to track local development around 1,658 mineral deposits. We use stacked event studies and difference-in-difference models to estimate the impact of mine openings and closings. The magnitude of the effect of mine openings is considerable - after 15 years, urban areas within 20km of an opening mine almost double in size. We find strong evidence of a political resource curse at the local level. Although mining boosts the local economy in democratic countries, these gains are meager in autocracies and come at the expense of tripling the likelihood of conflict relative to prior the onset of mining. Furthermore, our results suggest that the growth acceleration in mining areas is only temporary and diminishes with the closure of the mine.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#26032;&#30340;&#32858;&#25314;&#35782;&#21035;&#31574;&#30053;&#65292;&#20811;&#26381;&#20102;&#24403;&#21069;&#26041;&#27861;&#25935;&#24863;&#24615;&#38382;&#39064;&#65292;&#23637;&#31034;&#20102;&#32858;&#25314;&#24377;&#24615;&#22914;&#20309;&#20381;&#36182;&#20110;&#19981;&#21516;&#30340;&#35782;&#21035;&#20551;&#35774;&#65292;&#24182;&#33719;&#24471;&#20102;&#33258;&#38599;&#21644;&#26410;&#23130;&#32435;&#31246;&#20154;&#30340;&#31283;&#20581;&#20272;&#35745;&#12290;</title><link>http://arxiv.org/abs/2101.01170</link><description>&lt;p&gt;
&#26356;&#22909;&#30340;&#32858;&#25314;&#65292;&#26356;&#22909;&#30340;&#20999;&#21475;&#8212;&#8212;&#19968;&#39033;&#20851;&#20110;&#22870;&#21169;&#35745;&#21010;&#24433;&#21709;&#35780;&#20272;&#26041;&#27861;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Better Bunching, Nicer Notching. (arXiv:2101.01170v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2101.01170
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#26032;&#30340;&#32858;&#25314;&#35782;&#21035;&#31574;&#30053;&#65292;&#20811;&#26381;&#20102;&#24403;&#21069;&#26041;&#27861;&#25935;&#24863;&#24615;&#38382;&#39064;&#65292;&#23637;&#31034;&#20102;&#32858;&#25314;&#24377;&#24615;&#22914;&#20309;&#20381;&#36182;&#20110;&#19981;&#21516;&#30340;&#35782;&#21035;&#20551;&#35774;&#65292;&#24182;&#33719;&#24471;&#20102;&#33258;&#38599;&#21644;&#26410;&#23130;&#32435;&#31246;&#20154;&#30340;&#31283;&#20581;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#29992;&#20110;&#24377;&#24615;&#21442;&#25968;&#30340;&#32858;&#25314;&#35782;&#21035;&#31574;&#30053;&#65292;&#35813;&#21442;&#25968;&#24635;&#32467;&#20102;&#20195;&#29702;&#20154;&#23545;&#20110;&#28608;&#21169;&#35745;&#21010;&#20013;&#26012;&#29575;&#65288;&#25296;&#28857;&#65289;&#25110;&#25130;&#36317;&#65288;&#20999;&#21475;&#65289;&#21464;&#21270;&#30340;&#21453;&#24212;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#24403;&#21069;&#30340;&#32858;&#25314;&#26041;&#27861;&#21487;&#33021;&#38750;&#24120;&#25935;&#24863;&#20110;&#25991;&#29486;&#20013;&#20851;&#20110;&#26410;&#35266;&#27979;&#21040;&#30340;&#20010;&#20307;&#24322;&#36136;&#24615;&#30340;&#38544;&#21547;&#20551;&#35774;&#12290;&#36890;&#36807;&#24341;&#20837;&#26032;&#30340;&#38750;&#21442;&#25968;&#20272;&#35745;&#37327;&#21644;&#21322;&#21442;&#25968;&#20272;&#35745;&#37327;&#65292;&#25105;&#20204;&#20811;&#26381;&#20102;&#36825;&#31181;&#25935;&#24863;&#24615;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#20801;&#35768;&#30740;&#31350;&#20154;&#21592;&#23637;&#31034;&#32858;&#25314;&#24377;&#24615;&#22914;&#20309;&#20381;&#36182;&#20110;&#19981;&#21516;&#30340;&#35782;&#21035;&#20551;&#35774;&#65292;&#20197;&#21450;&#24377;&#24615;&#22312;&#20551;&#35774;&#19979;&#26159;&#21542;&#31283;&#20581;&#12290;&#25105;&#20204;&#36981;&#24490;&#25991;&#29486;&#24182;&#22312;&#31561;&#24377;&#24615;&#25928;&#29992;&#27169;&#22411;&#21644;&#21019;&#36896;&#20998;&#27573;&#32447;&#24615;&#39044;&#31639;&#38480;&#21046;&#30340;&#25152;&#24471;&#31246;&#35745;&#21010;&#30340;&#32972;&#26223;&#19979;&#25512;&#23548;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#22312;&#32654;&#22269;&#33719;&#24471;&#25152;&#24471;&#31246;&#25269;&#20813;&#20013;&#23637;&#31034;&#20102;&#32858;&#25314;&#34892;&#20026;&#25552;&#20379;&#20102;&#33258;&#38599;&#21644;&#26410;&#23130;&#32435;&#31246;&#20154;&#31283;&#20581;&#30340;&#20272;&#35745;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#33258;&#38599;&#21644;&#24050;&#23130;&#32435;&#31246;&#20154;&#30340;&#20272;&#35745;&#20381;&#36182;&#20110;&#20855;&#20307;&#30340;&#35782;&#21035;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies the bunching identification strategy for an elasticity parameter that summarizes agents' responses to changes in slope (kink) or intercept (notch) of a schedule of incentives. We show that current bunching methods may be very sensitive to implicit assumptions in the literature about unobserved individual heterogeneity. We overcome this sensitivity concern with new non- and semi-parametric estimators. Our estimators allow researchers to show how bunching elasticities depend on different identifying assumptions and when elasticities are robust to them. We follow the literature and derive our methods in the context of the iso-elastic utility model and an income tax schedule that creates a piece-wise linear budget constraint. We demonstrate bunching behavior provides robust estimates for self-employed and not-married taxpayers in the context of the U.S. Earned Income Tax Credit. In contrast, estimates for self-employed and married taxpayers depend on specific identifying
&lt;/p&gt;</description></item></channel></rss>