<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#30005;&#21160;&#27773;&#36710;&#20849;&#20139;&#23545;&#26410;&#26469;&#30005;&#21147;&#37096;&#38376;&#30340;&#24433;&#21709;&#36827;&#34892;&#20102;&#30740;&#31350;&#65292;&#32467;&#21512;&#20102;&#19977;&#31181;&#24320;&#28304;&#23450;&#37327;&#26041;&#27861;&#65292;&#26088;&#22312;&#25552;&#20379;&#19968;&#31181;&#35843;&#21644;&#24403;&#21069;&#27773;&#36710;&#20351;&#29992;&#20064;&#24815;&#19982;&#20943;&#23569;&#27773;&#36710;&#36710;&#38431;&#35268;&#27169;&#20043;&#38388;&#30340;&#36884;&#24452;&#12290;</title><link>https://arxiv.org/abs/2402.19380</link><description>&lt;p&gt;
&#30005;&#21160;&#27773;&#36710;&#20849;&#20139;&#23545;&#20855;&#26377;&#21487;&#21464;&#21487;&#20877;&#29983;&#33021;&#28304;&#30340;&#30005;&#21147;&#37096;&#38376;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Not flexible enough? Impacts of electric carsharing on a power sector with variable renewables
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.19380
&lt;/p&gt;
&lt;p&gt;
&#30005;&#21160;&#27773;&#36710;&#20849;&#20139;&#23545;&#26410;&#26469;&#30005;&#21147;&#37096;&#38376;&#30340;&#24433;&#21709;&#36827;&#34892;&#20102;&#30740;&#31350;&#65292;&#32467;&#21512;&#20102;&#19977;&#31181;&#24320;&#28304;&#23450;&#37327;&#26041;&#27861;&#65292;&#26088;&#22312;&#25552;&#20379;&#19968;&#31181;&#35843;&#21644;&#24403;&#21069;&#27773;&#36710;&#20351;&#29992;&#20064;&#24815;&#19982;&#20943;&#23569;&#27773;&#36710;&#36710;&#38431;&#35268;&#27169;&#20043;&#38388;&#30340;&#36884;&#24452;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30005;&#21160;&#21270;&#27773;&#36710;&#36710;&#38431;&#26159;&#20943;&#32531;&#20132;&#36890;&#37096;&#38376;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30340;&#20027;&#35201;&#31574;&#30053;&#12290;&#28982;&#32780;&#65292;&#20165;&#20165;&#30005;&#21160;&#21270;&#24182;&#19981;&#33021;&#35299;&#20915;&#19982;&#27773;&#36710;&#30456;&#20851;&#30340;&#25152;&#26377;&#36127;&#38754;&#22806;&#37096;&#24615;&#12290;&#22312;&#32771;&#34385;&#21040;&#20854;&#20182;&#38382;&#39064;&#65292;&#22914;&#34903;&#36947;&#31354;&#38388;&#20197;&#21450;&#23545;&#29992;&#20110;&#30005;&#27744;&#30005;&#21160;&#27773;&#36710;&#30340;&#30719;&#29289;&#36164;&#28304;&#30340;&#25285;&#24551;&#26102;&#65292;&#20943;&#23569;&#27773;&#36710;&#36710;&#38431;&#35268;&#27169;&#23558;&#26159;&#26377;&#30410;&#30340;&#65292;&#23588;&#20854;&#26159;&#22312;&#22478;&#24066;&#20013;&#12290;&#27773;&#36710;&#20849;&#20139;&#21487;&#20197;&#25552;&#20379;&#19968;&#31181;&#35843;&#21644;&#24403;&#21069;&#27773;&#36710;&#20351;&#29992;&#20064;&#24815;&#19982;&#20943;&#23569;&#27773;&#36710;&#36710;&#38431;&#35268;&#27169;&#20043;&#38388;&#30340;&#36884;&#24452;&#12290;&#28982;&#32780;&#65292;&#23427;&#20063;&#21487;&#33021;&#20943;&#23569;&#30005;&#21160;&#27773;&#36710;&#19982;&#21487;&#21464;&#21487;&#20877;&#29983;&#30005;&#21147;&#30340;&#32593;&#26684;&#20114;&#21160;&#28508;&#21147;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#30005;&#21160;&#27773;&#36710;&#20849;&#20139;&#21487;&#33021;&#22914;&#20309;&#24433;&#21709;&#26410;&#26469;&#30340;&#30005;&#21147;&#37096;&#38376;&#12290;&#25105;&#20204;&#32467;&#21512;&#20102;&#19977;&#31181;&#24320;&#28304;&#23450;&#37327;&#26041;&#27861;&#65292;&#21253;&#25324;&#23545;&#27773;&#36710;&#34892;&#31243;&#26085;&#35760;&#36827;&#34892;&#24207;&#21015;&#32858;&#31867;&#12289;&#29983;&#25104;&#21512;&#25104;&#30005;&#21160;&#36710;&#26102;&#38388;&#24207;&#21015;&#30340;&#27010;&#29575;&#24037;&#20855;&#65292;&#20197;&#21450;&#19968;&#20010;&#20248;&#21270;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.19380v1 Announce Type: new  Abstract: Electrifying the car fleet is a major strategy for mitigating greenhouse gas emissions in the transport sector. However, electrification alone will not solve all the negative externalities associated with cars. In light of other problems such as street space as well as concerns about the use of mineral resources for battery electric cars, reducing the car fleet size would be beneficial, particularly in cities. Carsharing could offer a way to reconcile current car usage habits with a reduction in the car fleet size. However, it could also reduce the potential of electric cars to align their grid interactions with variable renewable electricity generation. We investigate how electric carsharing may impact the power sector in the future. We combine three open-source quantitative methods, including sequence clustering of car travel diaries, a probabilistic tool to generate synthetic electric vehicle time series, and an optimization model of 
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#26694;&#26550;&#65292;&#29992;&#20110;&#35299;&#20915;&#27169;&#22411;&#20989;&#25968;&#20855;&#26377;&#19981;&#36830;&#32493;&#24615;&#21644;/&#25110;&#36755;&#20837;&#21464;&#37327;&#26159;&#31163;&#25955;&#30340;&#24773;&#20917;&#19979;&#30340;&#24046;&#20998;&#25935;&#24863;&#24615;&#35745;&#31639;&#38382;&#39064;&#12290;&#20316;&#32773;&#24212;&#29992;&#35813;&#26694;&#26550;&#36827;&#34892;&#20102;&#22797;&#21512;&#39118;&#38505;&#27169;&#22411;&#30340;&#25935;&#24863;&#24615;&#20998;&#26512;&#21644;&#20877;&#20445;&#38505;&#20449;&#29992;&#39118;&#38505;&#30340;&#25968;&#20540;&#30740;&#31350;&#12290;</title><link>http://arxiv.org/abs/2310.06151</link><description>&lt;p&gt;
&#19981;&#36830;&#32493;&#27169;&#22411;&#20013;&#30340;&#24046;&#20998;&#25935;&#24863;&#24615;
&lt;/p&gt;
&lt;p&gt;
Differential Sensitivity in Discontinuous Models. (arXiv:2310.06151v1 [stat.CO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.06151
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#26694;&#26550;&#65292;&#29992;&#20110;&#35299;&#20915;&#27169;&#22411;&#20989;&#25968;&#20855;&#26377;&#19981;&#36830;&#32493;&#24615;&#21644;/&#25110;&#36755;&#20837;&#21464;&#37327;&#26159;&#31163;&#25955;&#30340;&#24773;&#20917;&#19979;&#30340;&#24046;&#20998;&#25935;&#24863;&#24615;&#35745;&#31639;&#38382;&#39064;&#12290;&#20316;&#32773;&#24212;&#29992;&#35813;&#26694;&#26550;&#36827;&#34892;&#20102;&#22797;&#21512;&#39118;&#38505;&#27169;&#22411;&#30340;&#25935;&#24863;&#24615;&#20998;&#26512;&#21644;&#20877;&#20445;&#38505;&#20449;&#29992;&#39118;&#38505;&#30340;&#25968;&#20540;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24046;&#20998;&#25935;&#24863;&#24615;&#27979;&#24230;&#20026;&#35299;&#37322;&#20174;&#20223;&#30495;&#21040;&#31639;&#27861;&#39044;&#27979;&#31561;&#21508;&#31181;&#24212;&#29992;&#20013;&#20351;&#29992;&#30340;&#22797;&#26434;&#35745;&#31639;&#27169;&#22411;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#24037;&#20855;&#12290;&#23545;&#27169;&#22411;&#36755;&#20986;&#22312;&#27169;&#22411;&#21442;&#25968;&#26041;&#21521;&#19978;&#30340;&#23548;&#25968;&#21487;&#20197;&#25581;&#31034;&#36755;&#20837;-&#36755;&#20986;&#20851;&#31995;&#20197;&#21450;&#27169;&#22411;&#21442;&#25968;&#21644;&#36755;&#20837;&#21464;&#37327;&#30340;&#30456;&#23545;&#37325;&#35201;&#24615;&#12290;&#28982;&#32780;&#65292;&#24403;&#27169;&#22411;&#20989;&#25968;&#20855;&#26377;&#19981;&#36830;&#32493;&#24615;&#21644;/&#25110;&#36755;&#20837;&#21464;&#37327;&#26159;&#31163;&#25955;&#30340;&#26102;&#65292;&#22914;&#20309;&#36827;&#34892;&#36825;&#26679;&#30340;&#23548;&#25968;&#35745;&#31639;&#23578;&#19981;&#28165;&#26970;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;&#26694;&#26550;&#26469;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#32771;&#34385;&#21040;&#19982;&#36890;&#36807;&#38454;&#36291;&#20989;&#25968;&#24433;&#21709;&#27169;&#22411;&#36755;&#20986;&#30340;&#38543;&#26426;&#36755;&#20837;&#21464;&#37327;&#65288;&#39118;&#38505;&#22240;&#23376;&#65289;&#30456;&#20851;&#30340;&#22833;&#30495;&#30340;&#37327;&#21270;&#36755;&#20986;&#39118;&#38505;&#27979;&#24230;&#30340;&#23548;&#25968;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#22312;&#28385;&#36275;&#24369;&#25216;&#26415;&#26465;&#20214;&#30340;&#24773;&#20917;&#19979;&#65292;&#36825;&#20123;&#23548;&#25968;&#26159;&#26377;&#23450;&#20041;&#30340;&#65292;&#24182;&#25512;&#23548;&#20986;&#30456;&#24212;&#30340;&#20844;&#24335;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#32467;&#26524;&#24212;&#29992;&#20110;&#22797;&#21512;&#39118;&#38505;&#27169;&#22411;&#30340;&#25935;&#24863;&#24615;&#20998;&#26512;&#65292;&#24182;&#23545;&#20877;&#20445;&#38505;&#20449;&#29992;&#39118;&#38505;&#36827;&#34892;&#20102;&#25968;&#20540;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Differential sensitivity measures provide valuable tools for interpreting complex computational models used in applications ranging from simulation to algorithmic prediction. Taking the derivative of the model output in direction of a model parameter can reveal input-output relations and the relative importance of model parameters and input variables. Nonetheless, it is unclear how such derivatives should be taken when the model function has discontinuities and/or input variables are discrete. We present a general framework for addressing such problems, considering derivatives of quantile-based output risk measures, with respect to distortions to random input variables (risk factors), which impact the model output through step-functions. We prove that, subject to weak technical conditions, the derivatives are well-defined and derive the corresponding formulas. We apply our results to the sensitivity analysis of compound risk models and to a numerical study of reinsurance credit risk in
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#19968;&#31181;&#38754;&#23545;&#22810;&#31181;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#30340;&#20877;&#20445;&#38505;&#21830;&#31574;&#30053;&#65292;&#20854;&#36890;&#36807;&#35774;&#35745;&#26368;&#22823;&#21270;&#39044;&#26399;&#36130;&#23500;&#30340;&#20877;&#20445;&#38505;&#21512;&#21516;&#65292;&#24182;&#22312;&#20445;&#38505;&#21830;&#27169;&#22411;&#30340;&#37325;&#24515;&#22833;&#30495;&#19979;&#23450;&#20215;&#65292;&#35299;&#20915;&#20102;&#36830;&#32493;&#26102;&#38388;&#30340;&#39046;&#23548;&#32773;-&#36861;&#38543;&#32773;&#21338;&#24328;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2308.11828</link><description>&lt;p&gt;
&#22810;&#23478;&#20445;&#38505;&#21830;&#30340;&#26368;&#20248;&#40065;&#26834;&#20877;&#20445;&#38505;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Optimal Robust Reinsurance with Multiple Insurers. (arXiv:2308.11828v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.11828
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#19968;&#31181;&#38754;&#23545;&#22810;&#31181;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#30340;&#20877;&#20445;&#38505;&#21830;&#31574;&#30053;&#65292;&#20854;&#36890;&#36807;&#35774;&#35745;&#26368;&#22823;&#21270;&#39044;&#26399;&#36130;&#23500;&#30340;&#20877;&#20445;&#38505;&#21512;&#21516;&#65292;&#24182;&#22312;&#20445;&#38505;&#21830;&#27169;&#22411;&#30340;&#37325;&#24515;&#22833;&#30495;&#19979;&#23450;&#20215;&#65292;&#35299;&#20915;&#20102;&#36830;&#32493;&#26102;&#38388;&#30340;&#39046;&#23548;&#32773;-&#36861;&#38543;&#32773;&#21338;&#24328;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#23478;&#38754;&#20020;&#22810;&#20010;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#30340;&#20877;&#20445;&#38505;&#21830;&#12290;&#20877;&#20445;&#38505;&#21830;&#21521;$n$&#23478;&#20445;&#38505;&#21830;&#25552;&#20379;&#21512;&#21516;&#65292;&#20854;&#32034;&#36180;&#36981;&#24490;&#19981;&#21516;&#30340;&#22797;&#21512;&#27850;&#26494;&#36807;&#31243;&#12290;&#30001;&#20110;&#20877;&#20445;&#38505;&#21830;&#23545;&#20110;&#20445;&#38505;&#21830;&#30340;&#32034;&#36180;&#20005;&#37325;&#31243;&#24230;&#20998;&#24067;&#21644;&#39057;&#29575;&#23384;&#22312;&#19981;&#30830;&#23450;&#24615;&#65292;&#20182;&#20204;&#35774;&#35745;&#20102;&#26368;&#22823;&#21270;&#39044;&#26399;&#36130;&#23500;&#30340;&#20877;&#20445;&#38505;&#21512;&#21516;&#65292;&#21516;&#26102;&#36824;&#38656;&#35201;&#25215;&#25285;&#19968;&#20010;&#29109;&#24809;&#32602;&#12290;&#32780;&#20445;&#38505;&#21830;&#21017;&#23547;&#27714;&#22312;&#26080;&#27495;&#20041;&#30340;&#24773;&#20917;&#19979;&#26368;&#22823;&#21270;&#20182;&#20204;&#30340;&#39044;&#26399;&#25928;&#29992;&#12290;&#25105;&#20204;&#35299;&#20915;&#20102;&#36825;&#20010;&#36830;&#32493;&#26102;&#38388;&#30340;&#39046;&#23548;&#32773;-&#36861;&#38543;&#32773;&#21338;&#24328;&#38382;&#39064;&#65292;&#24471;&#21040;&#20877;&#20445;&#38505;&#21830;&#22312;&#20445;&#38505;&#21830;&#27169;&#22411;&#30340;&#37325;&#24515;&#22833;&#30495;&#19979;&#30340;&#23450;&#20215;&#26041;&#24335;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#32467;&#26524;&#24212;&#29992;&#21040;&#27604;&#20363;&#20877;&#20445;&#38505;&#21644;&#36229;&#39069;&#25439;&#22833;&#20877;&#20445;&#38505;&#21512;&#21516;&#65292;&#24182;&#36827;&#34892;&#20102;&#25968;&#20540;&#35299;&#26512;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#35299;&#20915;&#20102;&#20877;&#20445;&#38505;&#21830;&#22312;&#27169;&#31946;&#24773;&#20917;&#19979;&#26368;&#22823;&#21270;&#20182;&#20204;&#30340;&#39044;&#26399;&#25928;&#29992;&#30340;&#30456;&#20851;&#38382;&#39064;&#65292;&#24182;&#27604;&#36739;&#20102;&#35299;&#30340;&#19981;&#21516;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a reinsurer who faces multiple sources of model uncertainty. The reinsurer offers contracts to $n$ insurers whose claims follow different compound Poisson processes. As the reinsurer is uncertain about the insurers' claim severity distributions and frequencies, they design reinsurance contracts that maximise their expected wealth subject to an entropy penalty. Insurers meanwhile seek to maximise their expected utility without ambiguity. We solve this continuous-time Stackelberg game for general reinsurance contracts and find that the reinsurer prices under a distortion of the barycentre of the insurers' models. We apply our results to proportional reinsurance and excess-of-loss reinsurance contracts, and illustrate the solutions numerically. Furthermore, we solve the related problem where the reinsurer maximises, still under ambiguity, their expected utility and compare the solutions.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#25163;&#26426;&#25968;&#25454;&#21457;&#29616;&#65292;&#22312;COVID-19&#22823;&#27969;&#34892;&#26399;&#38388;&#65292;&#29983;&#27963;&#22312;&#20302;&#36130;&#23500;&#31038;&#21306;&#30340;&#22478;&#24066;&#29992;&#25143;&#26356;&#19981;&#21487;&#33021;&#37319;&#21462;&#33258;&#25105;&#38548;&#31163;&#30340;&#34892;&#21160;&#65292;&#36139;&#31351;&#29992;&#25143;&#20013;&#37027;&#20123;&#26366;&#32463;&#36890;&#21220;&#19978;&#29677;&#21040;&#39640;&#36130;&#23500;&#31038;&#21306;&#30340;&#20154;&#21017;&#29305;&#21035;&#23481;&#26131;&#21463;&#21040;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2305.06888</link><description>&lt;p&gt;
&#21457;&#23637;&#20013;&#22269;&#23478;COVID-19&#30123;&#24773;&#26399;&#38388;&#30340;&#31038;&#20250;&#32463;&#27982;&#24046;&#24322;&#19982;&#20986;&#34892;&#34892;&#20026;
&lt;/p&gt;
&lt;p&gt;
Socioeconomic disparities in mobility behavior during the COVID-19 pandemic in developing countries. (arXiv:2305.06888v1 [physics.soc-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.06888
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#25163;&#26426;&#25968;&#25454;&#21457;&#29616;&#65292;&#22312;COVID-19&#22823;&#27969;&#34892;&#26399;&#38388;&#65292;&#29983;&#27963;&#22312;&#20302;&#36130;&#23500;&#31038;&#21306;&#30340;&#22478;&#24066;&#29992;&#25143;&#26356;&#19981;&#21487;&#33021;&#37319;&#21462;&#33258;&#25105;&#38548;&#31163;&#30340;&#34892;&#21160;&#65292;&#36139;&#31351;&#29992;&#25143;&#20013;&#37027;&#20123;&#26366;&#32463;&#36890;&#21220;&#19978;&#29677;&#21040;&#39640;&#36130;&#23500;&#31038;&#21306;&#30340;&#20154;&#21017;&#29305;&#21035;&#23481;&#26131;&#21463;&#21040;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25163;&#26426;&#25968;&#25454;&#22312;&#37327;&#21270;COVID-19&#30123;&#24773;&#26399;&#38388;&#30340;&#20154;&#31867;&#27969;&#21160;&#20013;&#21457;&#25381;&#20102;&#20851;&#38190;&#20316;&#29992;&#12290;&#29616;&#26377;&#30740;&#31350;&#20027;&#35201;&#20851;&#27880;&#39640;&#25910;&#20837;&#22269;&#23478;&#30340;&#22320;&#21306;&#24635;&#20307;&#24773;&#20917;&#65292;&#25513;&#30422;&#20102;&#30123;&#24773;&#23545;&#26368;&#33030;&#24369;&#32676;&#20307;&#30340;&#24378;&#28872;&#24433;&#21709;&#12290;&#25105;&#20204;&#32467;&#21512;&#26469;&#33258;&#31227;&#21160;&#30005;&#35805;&#21644;&#20154;&#21475;&#26222;&#26597;&#30340;&#22320;&#29702;&#20301;&#32622;&#25968;&#25454;&#65292;&#30740;&#31350;&#20102;2020&#24180;3&#26376;&#33267;12&#26376;&#26399;&#38388;3&#20010;&#22823;&#27954;&#30340;6&#20010;&#20013;&#31561;&#25910;&#20837;&#22269;&#23478;&#65292;&#25581;&#31034;&#20102;&#19981;&#21516;&#31038;&#20250;&#32463;&#27982;&#32676;&#20307;&#24212;&#23545;&#30123;&#24773;&#30340;&#34892;&#20026;&#24046;&#24322;&#12290;&#24403;&#30123;&#24773;&#29190;&#21457;&#26102;&#65292;&#29983;&#27963;&#22312;&#20302;&#36130;&#23500;&#31038;&#21306;&#20013;&#30340;&#22478;&#24066;&#29992;&#25143;&#26356;&#19981;&#21487;&#33021;&#36890;&#36807;&#33258;&#25105;&#38548;&#31163;&#22312;&#23478;&#20013;&#12289;&#25644;&#36801;&#21040;&#20892;&#26449;&#22320;&#21306;&#25110;&#32773;&#20572;&#27490;&#36890;&#21220;&#24037;&#20316;&#26469;&#24212;&#23545;&#12290;&#36139;&#31351;&#29992;&#25143;&#20013;&#65292;&#37027;&#20123;&#22312;&#30123;&#24773;&#20043;&#21069;&#26366;&#36890;&#21220;&#19978;&#29677;&#21040;&#39640;&#36130;&#23500;&#31038;&#21306;&#30340;&#20154;&#21017;&#38754;&#20020;&#30528;&#37325;&#22823;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;
Mobile phone data have played a key role in quantifying human mobility during the COVID-19 pandemic. Existing studies on mobility patterns have primarily focused on regional aggregates in high-income countries, obfuscating the accentuated impact of the pandemic on the most vulnerable populations. By combining geolocation data from mobile phones and population census for 6 middle-income countries across 3 continents between March and December 2020, we uncovered common disparities in the behavioral response to the pandemic across socioeconomic groups. When the pandemic hit, urban users living in low-wealth neighborhoods were less likely to respond by self-isolating at home, relocating to rural areas, or refraining from commuting to work. The gap in the behavioral responses between socioeconomic groups persisted during the entire observation period. Among low-wealth users, those who used to commute to work in high-wealth neighborhoods pre-pandemic were particularly at risk, facing both th
&lt;/p&gt;</description></item></channel></rss>