<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20122;&#31283;&#24577;&#38544;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#30340;&#29702;&#35770;&#65292;&#29992;&#20110;&#24314;&#27169;&#37329;&#34701;&#24066;&#22330;&#12290;&#35813;&#29702;&#35770;&#35748;&#20026;&#37329;&#34701;&#24066;&#22330;&#30340;&#29366;&#24577;&#28436;&#21270;&#21487;&#20197;&#34987;&#25551;&#36848;&#20026;&#19968;&#20010;&#20114;&#21160;&#30340;&#39532;&#23572;&#21487;&#22827;&#31995;&#32479;&#65292;&#24182;&#19988;&#20855;&#26377;&#20122;&#31283;&#24577;&#34892;&#20026;&#12290;&#36825;&#20010;&#29702;&#35770;&#20026;&#37329;&#34701;&#32422;&#26463;&#19979;&#30340;&#30456;&#20114;&#20316;&#29992;&#39532;&#23572;&#21487;&#22827;&#31995;&#32479;&#30340;&#21457;&#23637;&#25552;&#20379;&#20102;&#21551;&#31034;&#65292;&#21487;&#20197;&#25913;&#21464;&#37329;&#34701;&#32463;&#27982;&#23398;&#21644;&#22240;&#26524;&#22240;&#23376;&#25237;&#36164;&#30340;&#30740;&#31350;&#33539;&#24335;&#12290;&#21516;&#26102;&#65292;&#35813;&#29702;&#35770;&#24378;&#35843;&#20102;&#24066;&#22330;&#29366;&#24577;&#23545;&#25237;&#36164;&#32489;&#25928;&#30340;&#24433;&#21709;&#65292;&#30456;&#36739;&#20110;&#20854;&#20182;&#21464;&#37327;&#23545;&#25237;&#36164;&#32489;&#25928;&#30340;&#30452;&#25509;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2310.13081</link><description>&lt;p&gt;
&#20122;&#31283;&#24577;&#38544;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#65306;&#24314;&#27169;&#37329;&#34701;&#24066;&#22330;&#30340;&#29702;&#35770;
&lt;/p&gt;
&lt;p&gt;
Metastable Hidden Markov Processes: a theory for modeling financial markets. (arXiv:2310.13081v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.13081
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20122;&#31283;&#24577;&#38544;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#30340;&#29702;&#35770;&#65292;&#29992;&#20110;&#24314;&#27169;&#37329;&#34701;&#24066;&#22330;&#12290;&#35813;&#29702;&#35770;&#35748;&#20026;&#37329;&#34701;&#24066;&#22330;&#30340;&#29366;&#24577;&#28436;&#21270;&#21487;&#20197;&#34987;&#25551;&#36848;&#20026;&#19968;&#20010;&#20114;&#21160;&#30340;&#39532;&#23572;&#21487;&#22827;&#31995;&#32479;&#65292;&#24182;&#19988;&#20855;&#26377;&#20122;&#31283;&#24577;&#34892;&#20026;&#12290;&#36825;&#20010;&#29702;&#35770;&#20026;&#37329;&#34701;&#32422;&#26463;&#19979;&#30340;&#30456;&#20114;&#20316;&#29992;&#39532;&#23572;&#21487;&#22827;&#31995;&#32479;&#30340;&#21457;&#23637;&#25552;&#20379;&#20102;&#21551;&#31034;&#65292;&#21487;&#20197;&#25913;&#21464;&#37329;&#34701;&#32463;&#27982;&#23398;&#21644;&#22240;&#26524;&#22240;&#23376;&#25237;&#36164;&#30340;&#30740;&#31350;&#33539;&#24335;&#12290;&#21516;&#26102;&#65292;&#35813;&#29702;&#35770;&#24378;&#35843;&#20102;&#24066;&#22330;&#29366;&#24577;&#23545;&#25237;&#36164;&#32489;&#25928;&#30340;&#24433;&#21709;&#65292;&#30456;&#36739;&#20110;&#20854;&#20182;&#21464;&#37327;&#23545;&#25237;&#36164;&#32489;&#25928;&#30340;&#30452;&#25509;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#25991;&#29486;&#20013;&#24050;&#25104;&#21151;&#22320;&#21033;&#29992;&#38544;&#39532;&#23572;&#21487;&#22827;&#27169;&#22411;&#23545;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#36827;&#34892;&#24314;&#27169;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#29702;&#35770;&#65292;&#23427;&#22312;&#20551;&#35774;&#23384;&#22312;&#19968;&#20010;&#30001;&#29366;&#24577;&#38543;&#26102;&#38388;&#28436;&#21270;&#30340;&#24066;&#22330;&#30340;&#24773;&#20917;&#19979;&#65292;&#35299;&#37322;&#20102;&#36825;&#31181;&#24314;&#27169;&#26041;&#27861;&#65292;&#35813;&#24066;&#22330;&#30001;&#30456;&#20114;&#20316;&#29992;&#30340;&#39532;&#23572;&#21487;&#22827;&#31995;&#32479;&#24418;&#25104;&#65292;&#35813;&#31995;&#32479;&#20855;&#26377;&#19968;&#20010;&#30001;&#38544;&#39532;&#23572;&#21487;&#22827;&#38142;&#25551;&#36848;&#30340;&#20122;&#31283;&#24577;&#34892;&#20026;&#12290;&#36825;&#20010;&#29702;&#35770;&#26159;&#20122;&#31283;&#24577;&#22312;&#29289;&#29702;&#31995;&#32479;&#24314;&#27169;&#20197;&#22806;&#30340;&#19968;&#31181;&#32597;&#35265;&#24212;&#29992;&#65292;&#21487;&#33021;&#20250;&#28608;&#21457;&#26032;&#30340;&#20855;&#26377;&#37329;&#34701;&#32422;&#26463;&#30340;&#30456;&#20114;&#20316;&#29992;&#39532;&#23572;&#21487;&#22827;&#31995;&#32479;&#30340;&#21457;&#23637;&#12290;&#22312;&#37329;&#34701;&#32463;&#27982;&#23398;&#21644;&#22240;&#26524;&#22240;&#23376;&#25237;&#36164;&#30340;&#32972;&#26223;&#19979;&#65292;&#35813;&#29702;&#35770;&#24847;&#21619;&#30528;&#19968;&#20010;&#26032;&#30340;&#33539;&#24335;&#65292;&#21363;&#25237;&#36164;&#32489;&#25928;&#30340;&#27874;&#21160;&#20027;&#35201;&#30001;&#24066;&#22330;&#29366;&#24577;&#39537;&#21160;&#65292;&#32780;&#19981;&#26159;&#30452;&#25509;&#30001;&#20854;&#20182;&#21464;&#37327;&#24341;&#36215;&#12290;&#23613;&#31649;&#22522;&#20110;&#22240;&#26524;&#25512;&#26029;&#30340;&#24120;&#35268;&#22240;&#26524;&#22240;&#23376;&#25237;&#36164;&#26041;&#27861;&#19982;&#25152;&#25552;&#20986;&#30340;&#29702;&#35770;&#24182;&#19981;&#23436;&#20840;&#30683;&#30462;&#65292;&#20294;&#21518;&#32773;&#20855;&#26377;&#35299;&#37322;&#25237;&#36164;&#32489;&#25928;&#27874;&#21160;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
The modeling of financial time series by hidden Markov models has been performed successfully in the literature. In this paper, we propose a theory that justifies such a modeling under the assumption that there exists a market formed by agents whose states evolve on time as an interacting Markov system that has a metastable behavior described by the hidden Markov chain. This theory is a rare application of metastability outside the modeling of physical systems, and may inspire the development of new interacting Markov systems with financial constraints. In the context of financial economics and causal factor investment, the theory implies a new paradigm in which fluctuations in investment performance are primarily driven by the state of the market, rather than being directly caused by other variables. Even though the usual approach to causal factor investment based on causal inference is not completely inconsistent with the proposed theory, the latter has the advantage of accounting fo
&lt;/p&gt;</description></item></channel></rss>