<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#25193;&#23637;&#20102;&#31283;&#20581;PCE&#36890;&#32960;&#27979;&#24230;&#30340;&#33539;&#22260;&#65292;&#24182;&#35780;&#20272;&#20102;&#19981;&#21516;&#20462;&#21098;&#28857;&#30340;&#39044;&#27979;&#24615;&#33021;&#12290;&#23613;&#31649;&#20462;&#21098;&#28857;&#30340;&#36873;&#25321;&#19982;&#26102;&#38388;&#21644;&#30446;&#26631;&#26377;&#20851;&#65292;&#20294;&#26080;&#27861;&#36873;&#25321;&#21333;&#20010;&#31995;&#21015;&#20316;&#20026;&#26368;&#20339;&#39044;&#27979;&#12290;&#21508;&#31181;&#20462;&#21098;&#26041;&#24335;&#30340;&#24179;&#22343;&#39044;&#27979;&#35823;&#24046;&#30456;&#24403;&#65292;&#20294;&#23545;&#20110;&#36235;&#21183;&#36890;&#32960;&#30340;&#39044;&#27979;&#26377;&#25152;&#19981;&#21516;&#65292;&#24314;&#35758;&#20351;&#29992;&#19968;&#32452;&#25509;&#36817;&#26368;&#20339;&#30340;&#20462;&#21098;&#12290;</title><link>http://arxiv.org/abs/2207.12494</link><description>&lt;p&gt;
&#25193;&#23637;&#31283;&#20581;PCE&#36890;&#32960;&#27979;&#24230;&#30340;&#33539;&#22260;
&lt;/p&gt;
&lt;p&gt;
Extending the Range of Robust PCE Inflation Measures. (arXiv:2207.12494v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.12494
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25193;&#23637;&#20102;&#31283;&#20581;PCE&#36890;&#32960;&#27979;&#24230;&#30340;&#33539;&#22260;&#65292;&#24182;&#35780;&#20272;&#20102;&#19981;&#21516;&#20462;&#21098;&#28857;&#30340;&#39044;&#27979;&#24615;&#33021;&#12290;&#23613;&#31649;&#20462;&#21098;&#28857;&#30340;&#36873;&#25321;&#19982;&#26102;&#38388;&#21644;&#30446;&#26631;&#26377;&#20851;&#65292;&#20294;&#26080;&#27861;&#36873;&#25321;&#21333;&#20010;&#31995;&#21015;&#20316;&#20026;&#26368;&#20339;&#39044;&#27979;&#12290;&#21508;&#31181;&#20462;&#21098;&#26041;&#24335;&#30340;&#24179;&#22343;&#39044;&#27979;&#35823;&#24046;&#30456;&#24403;&#65292;&#20294;&#23545;&#20110;&#36235;&#21183;&#36890;&#32960;&#30340;&#39044;&#27979;&#26377;&#25152;&#19981;&#21516;&#65292;&#24314;&#35758;&#20351;&#29992;&#19968;&#32452;&#25509;&#36817;&#26368;&#20339;&#30340;&#20462;&#21098;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35780;&#20272;&#20102;1960&#24180;&#33267;2022&#24180;&#20043;&#38388;&#30340;&#19968;&#31995;&#21015;&#31283;&#20581;&#36890;&#32960;&#27979;&#24230;&#30340;&#39044;&#27979;&#24615;&#33021;&#65292;&#21253;&#25324;&#23448;&#26041;&#20013;&#20301;&#25968;&#21644;&#20462;&#21098;&#22343;&#20540;&#20010;&#20154;&#28040;&#36153;&#25903;&#20986;&#36890;&#32960;&#12290;&#24403;&#20462;&#21098;&#25481;&#20855;&#26377;&#26368;&#39640;&#21644;&#26368;&#20302;&#36890;&#32960;&#29575;&#30340;&#19981;&#21516;&#25903;&#20986;&#31867;&#21035;&#26102;&#65292;&#25105;&#20204;&#21457;&#29616;&#26368;&#20339;&#20462;&#21098;&#28857;&#22312;&#19981;&#21516;&#26102;&#38388;&#19978;&#24046;&#24322;&#24456;&#22823;&#65292;&#20063;&#21462;&#20915;&#20110;&#30446;&#26631;&#30340;&#36873;&#25321;&#65307;&#24403;&#30446;&#26631;&#26159;&#26410;&#26469;&#30340;&#36235;&#21183;&#36890;&#32960;&#25110;1970&#24180;&#20195;&#33267;1980&#24180;&#20195;&#30340;&#26679;&#26412;&#26102;&#65292;&#26368;&#20339;&#20462;&#21098;&#28857;&#36739;&#39640;&#12290;&#20196;&#20154;&#24778;&#35766;&#30340;&#26159;&#65292;&#22312;&#39044;&#27979;&#24615;&#33021;&#30340;&#22522;&#30784;&#19978;&#36873;&#25321;&#21333;&#20010;&#31995;&#21015;&#26159;&#27809;&#26377;&#26681;&#25454;&#30340;&#12290;&#21253;&#25324;&#23448;&#26041;&#31283;&#20581;&#27979;&#24230;&#22312;&#20869;&#30340;&#21508;&#31181;&#20462;&#21098;&#22343;&#20855;&#26377;&#24179;&#22343;&#39044;&#27979;&#35823;&#24046;&#65292;&#20351;&#23427;&#20204;&#19982;&#34920;&#29616;&#26368;&#20339;&#30340;&#20462;&#21098;&#19981;&#21487;&#21306;&#20998;&#12290;&#23613;&#31649;&#24179;&#22343;&#35823;&#24046;&#19981;&#21487;&#21306;&#20998;&#65292;&#20294;&#36825;&#20123;&#20462;&#21098;&#22312;&#20219;&#20309;&#32473;&#23450;&#26376;&#20221;&#23545;&#20110;&#36235;&#21183;&#36890;&#32960;&#30340;&#39044;&#27979;&#19981;&#21516;&#65292;&#22312;0.5&#21040;1&#20010;&#30334;&#20998;&#28857;&#33539;&#22260;&#20869;&#65292;&#36825;&#34920;&#26126;&#20351;&#29992;&#19968;&#32452;&#25509;&#36817;&#26368;&#20339;&#30340;&#20462;&#21098;&#12290;
&lt;/p&gt;
&lt;p&gt;
We evaluate the forecasting performance of a wide set of robust inflation measures between 1960 and 2022, including official median and trimmed-mean personal-consumption-expenditure inflation. When trimming out different expenditure categories with the highest and lowest inflation rates, we find that the optimal trim points vary widely across time and also depend on the choice of target; optimal trims are higher when targeting future trend inflation or for a 1970s-1980s subsample. Surprisingly, there are no grounds to select a single series on the basis of forecasting performance. A wide range of trims-including those of the official robust measures-have an average prediction error that makes them statistically indistinguishable from the best-performing trim. Despite indistinguishable average errors, these trims imply different predictions for trend inflation in any given month, within a range of 0.5 to 1 percentage points, suggesting the use of a set of near-optimal trims.
&lt;/p&gt;</description></item></channel></rss>