<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#32508;&#36848;&#20102;&#37327;&#23376;&#35745;&#31639;&#22312;&#37329;&#34701;&#39046;&#22495;&#30340;&#26368;&#26032;&#30740;&#31350;&#65292;&#21253;&#25324;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#12289;&#27450;&#35784;&#26816;&#27979;&#21644;&#34893;&#29983;&#21697;&#23450;&#20215;&#39118;&#38505;&#35745;&#31639;&#12290;&#27492;&#22806;&#65292;&#36824;&#27010;&#36848;&#20102;&#37327;&#23376;&#35745;&#31639;&#22312;&#21306;&#22359;&#38142;&#25216;&#26415;&#20013;&#30340;&#24212;&#29992;&#20197;&#21450;&#30456;&#20851;&#30340;&#23433;&#20840;&#24615;&#32771;&#34385;&#12290;</title><link>http://arxiv.org/abs/2307.01155</link><description>&lt;p&gt;
&#20174;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#21040;&#37327;&#23376;&#21306;&#22359;&#38142;&#21644;&#23433;&#20840;&#24615;&#65306;&#37327;&#23376;&#35745;&#31639;&#22312;&#37329;&#34701;&#39046;&#22495;&#30340;&#31995;&#32479;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
From Portfolio Optimization to Quantum Blockchain and Security: A Systematic Review of Quantum Computing in Finance. (arXiv:2307.01155v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01155
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32508;&#36848;&#20102;&#37327;&#23376;&#35745;&#31639;&#22312;&#37329;&#34701;&#39046;&#22495;&#30340;&#26368;&#26032;&#30740;&#31350;&#65292;&#21253;&#25324;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#12289;&#27450;&#35784;&#26816;&#27979;&#21644;&#34893;&#29983;&#21697;&#23450;&#20215;&#39118;&#38505;&#35745;&#31639;&#12290;&#27492;&#22806;&#65292;&#36824;&#27010;&#36848;&#20102;&#37327;&#23376;&#35745;&#31639;&#22312;&#21306;&#22359;&#38142;&#25216;&#26415;&#20013;&#30340;&#24212;&#29992;&#20197;&#21450;&#30456;&#20851;&#30340;&#23433;&#20840;&#24615;&#32771;&#34385;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20174;&#19981;&#21516;&#35282;&#24230;&#23545;&#37327;&#23376;&#37329;&#34701;&#39046;&#22495;&#30340;&#26368;&#26032;&#30740;&#31350;&#36827;&#34892;&#20102;&#27010;&#36848;&#12290;&#25152;&#32771;&#34385;&#30340;&#24212;&#29992;&#21253;&#25324;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#12289;&#27450;&#35784;&#26816;&#27979;&#20197;&#21450;&#29992;&#20110;&#34893;&#29983;&#21697;&#23450;&#20215;&#21644;&#39118;&#38505;&#35745;&#31639;&#30340;&#33945;&#29305;&#21345;&#32599;&#26041;&#27861;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23545;&#37327;&#23376;&#35745;&#31639;&#22312;&#21306;&#22359;&#38142;&#25216;&#26415;&#39046;&#22495;&#30340;&#24212;&#29992;&#36827;&#34892;&#20102;&#20840;&#38754;&#30340;&#32508;&#36848;&#65292;&#36825;&#26159;&#37329;&#34701;&#31185;&#25216;&#20013;&#30340;&#19968;&#20010;&#20027;&#35201;&#27010;&#24565;&#12290;&#22312;&#36825;&#26041;&#38754;&#65292;&#25105;&#20204;&#39318;&#20808;&#20171;&#32461;&#20102;&#21306;&#22359;&#38142;&#30340;&#24635;&#20307;&#27010;&#36848;&#65292;&#20197;&#21450;&#20854;&#20027;&#35201;&#30340;&#21152;&#23494;&#21407;&#35821;&#65292;&#22914;&#25968;&#23383;&#31614;&#21517;&#31639;&#27861;&#12289;&#21704;&#24076;&#20989;&#25968;&#21644;&#38543;&#26426;&#25968;&#29983;&#25104;&#22120;&#65292;&#20197;&#21450;&#22312;&#37327;&#23376;&#35745;&#31639;&#26426;&#34701;&#21512;&#21518;&#32771;&#34385;&#20102;Shor&#30340;&#37327;&#23376;&#22240;&#24335;&#20998;&#35299;&#31639;&#27861;&#21644;Grover&#30340;&#37327;&#23376;&#25628;&#32034;&#31639;&#27861;&#21518;&#30340;&#21306;&#22359;&#38142;&#25216;&#26415;&#30340;&#23433;&#20840;&#28431;&#27934;&#12290;&#28982;&#21518;&#25105;&#20204;&#35752;&#35770;&#20102;&#36890;&#36807;&#38408;&#20540;&#31614;&#21517;&#12289;&#29615;&#31614;&#21517;&#21644;&#38646;&#30693;&#35782;&#35777;&#26126;&#31995;&#32479;&#65288;&#21363;ZK-SNARKs&#65289;&#22312;&#37327;&#23376;&#25239;&#24615;&#21306;&#22359;&#38142;&#20013;&#23454;&#29616;&#38544;&#31169;&#20445;&#25252;&#30340;&#26041;&#27861;&#12290;...
&lt;/p&gt;
&lt;p&gt;
In this paper, we provide an overview of the recent work in the quantum finance realm from various perspectives. The applications in consideration are Portfolio Optimization, Fraud Detection, and Monte Carlo methods for derivative pricing and risk calculation. Furthermore, we give a comprehensive overview of the applications of quantum computing in the field of blockchain technology which is a main concept in fintech. In that sense, we first introduce the general overview of blockchain with its main cryptographic primitives such as digital signature algorithms, hash functions, and random number generators as well as the security vulnerabilities of blockchain technologies after the merge of quantum computers considering Shor's quantum factoring and Grover's quantum search algorithms. We then discuss the privacy preserving quantum-resistant blockchain systems via threshold signatures, ring signatures, and zero-knowledge proof systems i.e. ZK-SNARKs in quantum resistant blockchains. After
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35752;&#35770;&#20102;&#26657;&#20934;&#21487;&#24494;&#20998;&#30340;&#22522;&#20110;Agent&#30340;&#27169;&#22411;&#38754;&#20020;&#30340;&#25361;&#25112;&#65292;&#21516;&#26102;&#25552;&#20986;&#20102;&#28508;&#22312;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>http://arxiv.org/abs/2307.01085</link><description>&lt;p&gt;
&#26657;&#20934;&#21487;&#24494;&#20998;&#30340;&#22522;&#20110;Agent&#30340;&#27169;&#22411;&#30340;&#19968;&#20123;&#25361;&#25112;
&lt;/p&gt;
&lt;p&gt;
Some challenges of calibrating differentiable agent-based models. (arXiv:2307.01085v1 [cs.MA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01085
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#26657;&#20934;&#21487;&#24494;&#20998;&#30340;&#22522;&#20110;Agent&#30340;&#27169;&#22411;&#38754;&#20020;&#30340;&#25361;&#25112;&#65292;&#21516;&#26102;&#25552;&#20986;&#20102;&#28508;&#22312;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;Agent&#30340;&#27169;&#22411;&#26159;&#19968;&#31181;&#26377;&#21069;&#36884;&#30340;&#27169;&#25311;&#21644;&#25512;&#29702;&#22797;&#26434;&#31995;&#32479;&#30340;&#26041;&#27861;&#65292;&#20294;&#26159;&#23427;&#20204;&#30340;&#24212;&#29992;&#21463;&#21040;&#20102;&#22797;&#26434;&#24615;&#12289;&#31163;&#25955;&#24615;&#21644;&#21442;&#25968;&#25512;&#23548;&#21644;&#20248;&#21270;&#20219;&#21153;&#30340;&#22256;&#38590;&#30340;&#38480;&#21046;&#12290;&#36825;&#24341;&#36215;&#20102;&#26500;&#24314;&#21487;&#24494;&#20998;&#30340;&#22522;&#20110;Agent&#30340;&#27169;&#22411;&#20316;&#20026;&#20811;&#26381;&#36825;&#20123;&#22256;&#38590;&#30340;&#31574;&#30053;&#30340;&#20852;&#36259;&#65292;&#28982;&#32780;&#36824;&#23384;&#22312;&#19968;&#20123;&#25361;&#25112;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#35752;&#35770;&#24182;&#23637;&#31034;&#20102;&#19968;&#20123;&#23454;&#39564;&#65292;&#31361;&#20986;&#20102;&#36825;&#20123;&#25361;&#25112;&#20197;&#21450;&#28508;&#22312;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
Agent-based models (ABMs) are a promising approach to modelling and reasoning about complex systems, yet their application in practice is impeded by their complexity, discrete nature, and the difficulty of performing parameter inference and optimisation tasks. This in turn has sparked interest in the construction of differentiable ABMs as a strategy for combatting these difficulties, yet a number of challenges remain. In this paper, we discuss and present experiments that highlight some of these challenges, along with potential solutions.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#22312;&#32473;&#23450;&#36793;&#38469;&#20998;&#24067;&#30340;&#26497;&#31471;&#24066;&#22330;&#27169;&#22411;&#19979;&#65292;&#37329;&#34701;&#34893;&#29983;&#21697;&#30340;&#22797;&#21046;&#38382;&#39064;&#12290;&#40065;&#26834;&#37329;&#34701;&#27169;&#22411;&#26159;&#19968;&#31181;&#33021;&#22815;&#32771;&#34385;&#37329;&#34701;&#24066;&#22330;&#19981;&#30830;&#23450;&#24615;&#21644;&#21464;&#21160;&#30340;&#27169;&#22411;&#65292; Martingale Optimal Transport&#26159;&#20854;&#20013;&#30340;&#37325;&#35201;&#30740;&#31350;&#26041;&#21521;&#12290;</title><link>http://arxiv.org/abs/2307.00807</link><description>&lt;p&gt;
&#22312;&#32473;&#23450;&#36793;&#38469;&#20998;&#24067;&#30340;&#26497;&#31471;&#24066;&#22330;&#27169;&#22411;&#19979;&#30340;&#37329;&#34701;&#34893;&#29983;&#21697;&#22797;&#21046;
&lt;/p&gt;
&lt;p&gt;
Replication of financial derivatives under extreme market models given marginals. (arXiv:2307.00807v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.00807
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#22312;&#32473;&#23450;&#36793;&#38469;&#20998;&#24067;&#30340;&#26497;&#31471;&#24066;&#22330;&#27169;&#22411;&#19979;&#65292;&#37329;&#34701;&#34893;&#29983;&#21697;&#30340;&#22797;&#21046;&#38382;&#39064;&#12290;&#40065;&#26834;&#37329;&#34701;&#27169;&#22411;&#26159;&#19968;&#31181;&#33021;&#22815;&#32771;&#34385;&#37329;&#34701;&#24066;&#22330;&#19981;&#30830;&#23450;&#24615;&#21644;&#21464;&#21160;&#30340;&#27169;&#22411;&#65292; Martingale Optimal Transport&#26159;&#20854;&#20013;&#30340;&#37325;&#35201;&#30740;&#31350;&#26041;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Black-Scholes-Merton&#27169;&#22411;&#26159;&#25551;&#36848;&#37329;&#34701;&#24066;&#22330;&#21160;&#24577;&#30340;&#25968;&#23398;&#27169;&#22411;&#65292;&#21253;&#25324;&#34893;&#29983;&#21697;&#25237;&#36164;&#24037;&#20855;&#65292;&#36890;&#36807;&#35813;&#27169;&#22411;&#30340;&#20844;&#24335;&#21487;&#20197;&#25552;&#20379;&#27431;&#24335;&#26399;&#26435;&#30340;&#29702;&#35770;&#20215;&#26684;&#20272;&#35745;&#12290;&#35813;&#27169;&#22411;&#30340;&#22522;&#26412;&#24605;&#24819;&#26159;&#36890;&#36807;&#20197;&#29305;&#23450;&#26041;&#24335;&#36141;&#20080;&#21644;&#20986;&#21806;&#22522;&#30784;&#36164;&#20135;&#26469;&#23545;&#20914;&#26399;&#26435;&#30340;&#39118;&#38505;&#65292;&#21363;&#36890;&#36807;&#19968;&#20010;&#36164;&#20135;&#32452;&#21512;&#26469;&#22797;&#21046;&#26399;&#26435;&#30340;&#22238;&#25253;&#65292;&#35813;&#36164;&#20135;&#32452;&#21512;&#22312;&#27599;&#20010;&#26102;&#38388;&#28857;&#30340;&#20215;&#20540;&#26159;&#21487;&#20197;&#39564;&#35777;&#30340;&#12290;&#36825;&#20010;&#20219;&#21153;&#30340;&#19968;&#20010;&#26368;&#20851;&#38190;&#20294;&#38480;&#21046;&#24615;&#30340;&#20551;&#35774;&#26159;&#24066;&#22330;&#36981;&#24490;&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;&#65292;&#36825;&#31181;&#20551;&#35774;&#24050;&#32463;&#34987;&#25918;&#26494;&#21644;&#25512;&#24191;&#20102;&#21508;&#31181;&#26041;&#24335;&#12290;&#40065;&#26834;&#37329;&#34701;&#30340;&#27010;&#24565;&#22260;&#32469;&#30528;&#24320;&#21457;&#33021;&#22815;&#32771;&#34385;&#37329;&#34701;&#24066;&#22330;&#30340;&#19981;&#30830;&#23450;&#24615;&#21644;&#21464;&#21160;&#30340;&#27169;&#22411;&#12290;&#21033;&#29992;&#38797;&#28857;&#32763;&#36716;&#29702;&#35770;&#26469;&#25512;&#23548;&#30340;&#40065;&#26834;&#37329;&#34701;&#27169;&#22411;&#26159;&#20854;&#20013;&#26368;&#37325;&#35201;&#30340;&#26041;&#21521;&#20043;&#19968;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;... (&#20869;&#23481;&#22826;&#38271;&#65292;&#21518;&#32493;&#30465;&#30053;)
&lt;/p&gt;
&lt;p&gt;
The Black-Scholes-Merton model is a mathematical model for the dynamics of a financial market that includes derivative investment instruments, and its formula provides a theoretical price estimate of European-style options. The model's fundamental idea is to eliminate risk by hedging the option by purchasing and selling the underlying asset in a specific way, that is, to replicate the payoff of the option with a portfolio (which continuously trades the underlying) whose value at each time can be verified. One of the most crucial, yet restrictive, assumptions for this task is that the market follows a geometric Brownian motion, which has been relaxed and generalized in various ways.  The concept of robust finance revolves around developing models that account for uncertainties and variations in financial markets. Martingale Optimal Transport, which is an adaptation of the Optimal Transport theory to the robust financial framework, is one of the most prominent directions. In this paper, 
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#35777;&#26126;&#20102;&#19968;&#20010;&#36866;&#29992;&#20110;&#26080;&#25705;&#25830;&#24066;&#22330;&#21644;&#20855;&#26377;&#27604;&#20363;&#20132;&#26131;&#25104;&#26412;&#30340;&#36164;&#20135;&#23450;&#20215;&#22522;&#26412;&#23450;&#29702;&#65292;&#19981;&#38656;&#35201;&#28385;&#36275;&#20256;&#32479;&#27169;&#22411;&#20013;&#30340;&#19968;&#20123;&#20551;&#35774;&#26465;&#20214;&#12290;</title><link>http://arxiv.org/abs/2307.00571</link><description>&lt;p&gt;
&#26377;&#26080;&#20132;&#26131;&#25104;&#26412;&#30340;&#36164;&#20135;&#23450;&#20215;&#22522;&#26412;&#23450;&#29702;
&lt;/p&gt;
&lt;p&gt;
The fundamental theorem of asset pricing with and without transaction costs. (arXiv:2307.00571v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.00571
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#35777;&#26126;&#20102;&#19968;&#20010;&#36866;&#29992;&#20110;&#26080;&#25705;&#25830;&#24066;&#22330;&#21644;&#20855;&#26377;&#27604;&#20363;&#20132;&#26131;&#25104;&#26412;&#30340;&#36164;&#20135;&#23450;&#20215;&#22522;&#26412;&#23450;&#29702;&#65292;&#19981;&#38656;&#35201;&#28385;&#36275;&#20256;&#32479;&#27169;&#22411;&#20013;&#30340;&#19968;&#20123;&#20551;&#35774;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36830;&#32493;&#26102;&#38388;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#19968;&#20010;&#22522;&#20110;&#20005;&#26684;&#26080;&#22871;&#21033;&#26465;&#20214;&#30340;&#36164;&#20135;&#23450;&#20215;&#22522;&#26412;&#23450;&#29702;&#65288;FTAP&#65289;&#65292;&#36866;&#29992;&#20110;&#26080;&#25705;&#25830;&#24066;&#22330;&#21644;&#20855;&#26377;&#27604;&#20363;&#20132;&#26131;&#25104;&#26412;&#30340;&#24066;&#22330;&#12290;&#25105;&#20204;&#32771;&#34385;&#19968;&#20010;&#24066;&#22330;&#20013;&#21482;&#26377;&#19968;&#20010;&#39118;&#38505;&#36164;&#20135;&#65292;&#20854;&#21334;&#20215;&#36807;&#31243;&#39640;&#20110;&#31561;&#20110;&#20080;&#20215;&#36807;&#31243;&#12290;&#22312;&#25105;&#20204;&#30340;&#27169;&#22411;&#20013;&#65292;&#19981;&#38656;&#35201;&#28385;&#36275;&#26080;&#25705;&#25830;FTAP&#35777;&#26126;&#20013;&#20351;&#29992;&#30340;&#36130;&#23500;&#36807;&#31243;&#38598;&#30340;&#20018;&#32852;&#24615;&#36136;&#65292;&#20063;&#19981;&#38656;&#35201;&#28385;&#36275;&#20855;&#26377;&#38750;&#38646;&#20080;&#21334;&#20215;&#24046;&#27169;&#22411;&#20013;&#36890;&#24120;&#20551;&#35774;&#30340;&#20132;&#26131;&#31574;&#30053;&#20132;&#26131;&#37327;&#30340;&#26377;&#30028;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;
We prove a version of the fundamental theorem of asset pricing (FTAP) in continuous time that is based on the strict no-arbitrage condition and that is applicable to both frictionless markets and markets with proportional transaction costs. We consider a market with a single risky asset whose ask price process is higher than or equal to its bid price process. Neither the concatenation property of the set of wealth processes, that is used in the proof of the frictionless FTAP, nor some boundedness property of the trading volume of admissible strategies usually argued with in models with a nonvanishing bid-ask spread need to be satisfied in our model.
&lt;/p&gt;</description></item><item><title>&#20351;&#29992;Google Cloud&#30340;AutoML Regressor&#12289;TensorFlow&#31070;&#32463;&#32593;&#32476;&#21644;XGBoost&#26799;&#24230;&#25552;&#21319;&#20915;&#31574;&#26641;&#26469;&#23450;&#20215;&#27431;&#24335;&#26399;&#26435;&#65292;&#36825;&#19977;&#31181;&#27169;&#22411;&#22312;&#24179;&#22343;&#32477;&#23545;&#35823;&#24046;&#26041;&#38754;&#37117;&#33021;&#22815;&#36229;&#36234;Black Scholes&#27169;&#22411;&#12290;&#36825;&#20123;&#32467;&#26524;&#23637;&#31034;&#20102;&#20351;&#29992;&#26399;&#26435;&#22522;&#30784;&#36164;&#20135;&#30340;&#21382;&#21490;&#25968;&#25454;&#26469;&#23450;&#20215;&#27431;&#24335;&#26399;&#26435;&#30340;&#28508;&#21147;&#65292;&#23588;&#20854;&#26159;&#24403;&#20351;&#29992;&#33021;&#22815;&#23398;&#20064;&#20256;&#32479;&#21442;&#25968;&#27169;&#22411;&#27809;&#26377;&#32771;&#34385;&#21040;&#30340;&#22797;&#26434;&#27169;&#24335;&#30340;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#26102;&#12290;</title><link>http://arxiv.org/abs/2307.00476</link><description>&lt;p&gt;
&#20351;&#29992;Google AutoML&#12289;TensorFlow&#21644;XGBoost&#23450;&#20215;&#27431;&#24335;&#26399;&#26435;
&lt;/p&gt;
&lt;p&gt;
Pricing European Options with Google AutoML, TensorFlow, and XGBoost. (arXiv:2307.00476v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.00476
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;Google Cloud&#30340;AutoML Regressor&#12289;TensorFlow&#31070;&#32463;&#32593;&#32476;&#21644;XGBoost&#26799;&#24230;&#25552;&#21319;&#20915;&#31574;&#26641;&#26469;&#23450;&#20215;&#27431;&#24335;&#26399;&#26435;&#65292;&#36825;&#19977;&#31181;&#27169;&#22411;&#22312;&#24179;&#22343;&#32477;&#23545;&#35823;&#24046;&#26041;&#38754;&#37117;&#33021;&#22815;&#36229;&#36234;Black Scholes&#27169;&#22411;&#12290;&#36825;&#20123;&#32467;&#26524;&#23637;&#31034;&#20102;&#20351;&#29992;&#26399;&#26435;&#22522;&#30784;&#36164;&#20135;&#30340;&#21382;&#21490;&#25968;&#25454;&#26469;&#23450;&#20215;&#27431;&#24335;&#26399;&#26435;&#30340;&#28508;&#21147;&#65292;&#23588;&#20854;&#26159;&#24403;&#20351;&#29992;&#33021;&#22815;&#23398;&#20064;&#20256;&#32479;&#21442;&#25968;&#27169;&#22411;&#27809;&#26377;&#32771;&#34385;&#21040;&#30340;&#22797;&#26434;&#27169;&#24335;&#30340;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#26102;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20174;20&#19990;&#32426;90&#24180;&#20195;&#21021;&#20197;&#26469;&#65292;&#30740;&#31350;&#20154;&#21592;&#19968;&#30452;&#22312;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#21644;&#20854;&#20182;&#30456;&#20851;&#30340;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#26469;&#23450;&#20215;&#26399;&#26435;&#12290;&#32463;&#36807;&#19977;&#21313;&#24180;&#26469;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#12289;&#35745;&#31639;&#22788;&#29702;&#33021;&#21147;&#12289;&#20113;&#35745;&#31639;&#21644;&#25968;&#25454;&#21487;&#29992;&#24615;&#30340;&#25913;&#36827;&#65292;&#26412;&#25991;&#33021;&#22815;&#27604;&#36739;&#20351;&#29992;Google Cloud&#30340;AutoML&#22238;&#24402;&#22120;&#12289;TensorFlow&#31070;&#32463;&#32593;&#32476;&#21644;XGBoost&#26799;&#24230;&#25552;&#21319;&#20915;&#31574;&#26641;&#26469;&#23450;&#20215;&#27431;&#24335;&#26399;&#26435;&#12290;&#22312;&#24179;&#22343;&#32477;&#23545;&#35823;&#24046;&#26041;&#38754;&#65292;&#36825;&#19977;&#31181;&#27169;&#22411;&#37117;&#33021;&#22815;&#36229;&#36234;Black Scholes&#27169;&#22411;&#12290;&#36825;&#20123;&#32467;&#26524;&#23637;&#31034;&#20102;&#20351;&#29992;&#26399;&#26435;&#22522;&#30784;&#36164;&#20135;&#30340;&#21382;&#21490;&#25968;&#25454;&#26469;&#23450;&#20215;&#27431;&#24335;&#26399;&#26435;&#30340;&#28508;&#21147;&#65292;&#23588;&#20854;&#26159;&#24403;&#20351;&#29992;&#33021;&#22815;&#23398;&#20064;&#20256;&#32479;&#21442;&#25968;&#27169;&#22411;&#27809;&#26377;&#32771;&#34385;&#21040;&#30340;&#22797;&#26434;&#27169;&#24335;&#30340;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#26102;&#12290;
&lt;/p&gt;
&lt;p&gt;
Researchers have been using Neural Networks and other related machine-learning techniques to price options since the early 1990s. After three decades of improvements in machine learning techniques, computational processing power, cloud computing, and data availability, this paper is able to provide a comparison of using Google Cloud's AutoML Regressor, TensorFlow Neural Networks, and XGBoost Gradient Boosting Decision Trees for pricing European Options. All three types of models were able to outperform the Black Scholes Model in terms of mean absolute error. These results showcase the potential of using historical data from an option's underlying asset for pricing European options, especially when using machine learning algorithms that learn complex patterns that traditional parametric models do not take into account.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#20027;&#25104;&#20998;&#20998;&#26512;&#21644;&#38544;&#34255;&#39532;&#23572;&#21487;&#22827;&#27169;&#22411;&#26469;&#39044;&#27979;&#32929;&#31080;&#22238;&#25253;&#30340;&#26041;&#27861;&#65292;&#22312;&#23454;&#39564;&#20013;&#21457;&#29616;&#65292;&#35813;&#26041;&#27861;&#22312;&#24615;&#33021;&#19978;&#20248;&#20110;&#20256;&#32479;&#30340;&#25345;&#26377;&#31574;&#30053;&#12290;</title><link>http://arxiv.org/abs/2307.00459</link><description>&lt;p&gt;
&#20027;&#25104;&#20998;&#20998;&#26512;&#21644;&#38544;&#34255;&#39532;&#23572;&#21487;&#22827;&#27169;&#22411;&#29992;&#20110;&#39044;&#27979;&#32929;&#31080;&#22238;&#25253;
&lt;/p&gt;
&lt;p&gt;
Principal Component Analysis and Hidden Markov Model for Forecasting Stock Returns. (arXiv:2307.00459v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.00459
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#20027;&#25104;&#20998;&#20998;&#26512;&#21644;&#38544;&#34255;&#39532;&#23572;&#21487;&#22827;&#27169;&#22411;&#26469;&#39044;&#27979;&#32929;&#31080;&#22238;&#25253;&#30340;&#26041;&#27861;&#65292;&#22312;&#23454;&#39564;&#20013;&#21457;&#29616;&#65292;&#35813;&#26041;&#27861;&#22312;&#24615;&#33021;&#19978;&#20248;&#20110;&#20256;&#32479;&#30340;&#25345;&#26377;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#20027;&#25104;&#20998;&#20998;&#26512;&#65288;PCA&#65289;&#21644;&#38544;&#34255;&#39532;&#23572;&#21487;&#22827;&#27169;&#22411;&#65288;HMM&#65289;&#26469;&#39044;&#27979;&#32929;&#31080;&#22238;&#25253;&#30340;&#26041;&#27861;&#65292;&#24182;&#27979;&#35797;&#20102;&#22522;&#20110;&#36825;&#31181;&#26041;&#27861;&#30340;&#32929;&#31080;&#20132;&#26131;&#32467;&#26524;&#12290;&#25105;&#20204;&#23558;&#20027;&#25104;&#20998;&#20998;&#26512;&#24212;&#29992;&#20110;S&amp;P 500&#25351;&#25968;&#20013;&#19978;&#24066;&#20844;&#21496;&#30340;&#32929;&#31080;&#22238;&#25253;&#30340;&#21327;&#26041;&#24046;&#30697;&#38453;&#65292;&#24182;&#23558;&#20027;&#25104;&#20998;&#35299;&#37322;&#20026;&#22240;&#23376;&#22238;&#25253;&#65292;&#28982;&#21518;&#22312;&#23427;&#20204;&#19978;&#24212;&#29992;HMM&#27169;&#22411;&#12290;&#28982;&#21518;&#25105;&#20204;&#20351;&#29992;&#36716;&#25442;&#27010;&#29575;&#30697;&#38453;&#21644;&#29366;&#24577;&#26465;&#20214;&#22343;&#20540;&#26469;&#39044;&#27979;&#22240;&#23376;&#22238;&#25253;&#12290;&#36890;&#36807;&#20351;&#29992;&#29305;&#24449;&#21521;&#37327;&#23558;&#22240;&#23376;&#22238;&#25253;&#39044;&#27979;&#36716;&#25442;&#20026;&#32929;&#31080;&#22238;&#25253;&#65292;&#25105;&#20204;&#33719;&#24471;&#20102;&#32929;&#31080;&#22238;&#25253;&#30340;&#39044;&#27979;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#27491;&#30830;&#30340;&#36229;&#21442;&#25968;&#19979;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#33021;&#22815;&#36890;&#36807;&#24180;&#21270;&#22799;&#26222;&#27604;&#29575;&#22312;&#24615;&#33021;&#19978;&#36229;&#36807;&#25345;&#26377;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a method for predicting stock returns using principal component analysis (PCA) and the hidden Markov model (HMM) and tests the results of trading stocks based on this approach. Principal component analysis is applied to the covariance matrix of stock returns for companies listed in the S&amp;P 500 index, and interpreting principal components as factor returns, we apply the HMM model on them. Then we use the transition probability matrix and state conditional means to forecast the factors returns. Reverting the factor returns forecasts to stock returns using eigenvectors, we obtain forecasts for the stock returns. We find that, with the right hyperparameters, our model yields a strategy that outperforms the buy-and-hold strategy in terms of the annualized Sharpe ratio.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#37325;&#26032;&#35780;&#20272;&#20102;&#20122;&#24403;&#183;&#26031;&#23494;&#30340;&#20215;&#20540;&#29702;&#35770;&#65292;&#35748;&#20026;&#20854;&#23545;&#20110;&#29616;&#20195;&#24066;&#22330;&#20215;&#26684;&#24418;&#25104;&#29702;&#35770;&#30340;&#24314;&#35774;&#25552;&#20379;&#20102;&#26377;&#30410;&#30340;&#22522;&#30784;&#12290;</title><link>http://arxiv.org/abs/2307.00412</link><description>&lt;p&gt;
&#20122;&#24403;&#183;&#26031;&#23494;&#30340;&#20215;&#20540;&#29702;&#35770;&#65306;&#23545;&#21476;&#20856;&#20215;&#26684;&#21457;&#29616;&#30340;&#37325;&#26032;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
Adam Smith's Theory of Value: A Reappraisal of Classical Price Discovery. (arXiv:2307.00412v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.00412
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#35780;&#20272;&#20102;&#20122;&#24403;&#183;&#26031;&#23494;&#30340;&#20215;&#20540;&#29702;&#35770;&#65292;&#35748;&#20026;&#20854;&#23545;&#20110;&#29616;&#20195;&#24066;&#22330;&#20215;&#26684;&#24418;&#25104;&#29702;&#35770;&#30340;&#24314;&#35774;&#25552;&#20379;&#20102;&#26377;&#30410;&#30340;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20122;&#24403;&#183;&#26031;&#23494;&#22312;&#29702;&#35299;&#20154;&#31867;&#36947;&#24503;&#21644;&#31038;&#20250;&#24615;&#26041;&#38754;&#30340;&#30456;&#20851;&#24615;&#22312;&#21508;&#20010;&#23398;&#31185;&#32972;&#26223;&#30340;&#23398;&#32773;&#20013;&#24471;&#21040;&#20102;&#25215;&#35748;&#65292;&#32780;&#22312;&#32463;&#27982;&#23398;&#23478;&#20013;&#65292;&#20122;&#24403;&#183;&#26031;&#23494;&#30340;&#32463;&#27982;&#20215;&#20540;&#29702;&#35770;&#30340;&#37325;&#35201;&#24615;&#21364;&#19981;&#22914;&#21069;&#12290;&#28982;&#32780;&#65292;&#26412;&#25991;&#35748;&#20026;&#65292;&#20122;&#24403;&#183;&#26031;&#23494;&#20851;&#20110;&#24066;&#22330;&#20215;&#26684;&#24418;&#25104;&#30340;&#27010;&#36848;&#20197;&#21450;&#26356;&#19968;&#33324;&#26469;&#35828;&#65292;&#21476;&#20856;&#23398;&#27966;&#23558;&#31454;&#20105;&#35270;&#20026;&#19968;&#20010;&#38598;&#20307;&#35752;&#20215;&#36824;&#20215;&#30340;&#36807;&#31243;&#65292;&#20026;&#26500;&#24314;&#29616;&#20195;&#24066;&#22330;&#20215;&#26684;&#24418;&#25104;&#29702;&#35770;&#25552;&#20379;&#20102;&#26377;&#30410;&#30340;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;
The relevance of Adam Smith for understanding human morality and sociality is recognized in the growing interest in his work on moral sentiments among scholars of various academic backgrounds. But, paradoxically, Adam Smith's theory of economic value enjoys a less prominent stature today among economists, who, while they view him as the 'father of modern economics', considered him more as having had the right intuitions about a market economy than as having developed the right concepts and the technical tools for studying it. Yet the neoclassical tradition, which replaced the classical school around 1870, failed to provide a satisfactory theory of market price formation. Adam Smith's sketch of market price formation (Ch. VII, Book I, Wealth of Nations), and more generally the classical view of competition as a collective higgling and bargaining process, as this paper argues, offers a helpful foundation on which to build a modern theory of market price formation, despite any shortcoming
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#36890;&#36807;&#24341;&#20837;&#32463;&#20856;&#35266;&#28857;&#65292;&#23558;&#31454;&#20105;&#35270;&#20026;&#22522;&#20110;&#39044;&#23450;&#20215;&#26684;&#30340;&#38598;&#20307;&#35752;&#20215;&#36824;&#20215;&#36807;&#31243;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#35299;&#37322;&#25237;&#26426;&#24615;&#36164;&#20135;&#20215;&#26684;&#30340;&#27874;&#21160;&#29305;&#24449;&#12290;&#36890;&#36807;&#23454;&#39564;&#39564;&#35777;&#65292;&#35813;&#27169;&#22411;&#25104;&#21151;&#35299;&#37322;&#20102;&#36807;&#24230;&#27874;&#21160;&#12289;&#23614;&#37096;&#21402;&#23614;&#21644;&#32858;&#31867;&#27874;&#21160;&#31561;&#29616;&#35937;&#12290;</title><link>http://arxiv.org/abs/2307.00410</link><description>&lt;p&gt;
&#22238;&#39038;&#24615;&#22320;&#65292;&#23545;&#20110;&#31454;&#20105;&#24066;&#22330;&#34892;&#20026;&#30340;&#23454;&#39564;&#21457;&#29616;&#21628;&#21796;&#20102;&#26087;&#30340;&#12289;&#32463;&#20856;&#30340;&#31454;&#20105;&#35266;&#28857;&#30340;&#22797;&#20852;&#65292;&#23558;&#31454;&#20105;&#35270;&#20026;&#19968;&#20010;&#38598;&#20307;&#35752;&#20215;&#36824;&#20215;&#36807;&#31243;&#65288;&#32780;&#19981;&#26159;&#20215;&#26684;&#25509;&#21463;&#34892;&#20026;&#65289;&#65292;&#35813;&#36807;&#31243;&#22522;&#20110;&#39044;&#23450;&#20215;&#26684;&#65288;&#32780;&#38750;&#25928;&#29992;&#20989;&#25968;&#65289;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23558;&#32463;&#20856;&#26041;&#27861;&#29305;&#21270;&#20197;&#22788;&#29702;&#20215;&#26684;&#31283;&#23450;&#24615;&#30340;&#19968;&#20010;&#37325;&#35201;&#38459;&#30861;&#8212;&#8212;&#25237;&#26426;&#34892;&#20026;&#12290;&#35813;&#27169;&#22411;&#28041;&#21450;&#21040;&#19968;&#20010;&#29616;&#22330;&#25110;&#23454;&#39564;&#23460;&#36164;&#20135;&#24066;&#22330;&#35774;&#32622;&#30340;&#20856;&#22411;&#29305;&#24449;&#65292;&#24182;&#21487;&#29992;&#20110;&#23545;&#20854;&#29305;&#23450;&#39044;&#27979;&#36827;&#34892;&#23454;&#39564;&#35777;&#26126;&#65307;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#20351;&#29992;&#35813;&#27169;&#22411;&#26469;&#35299;&#37322;&#19977;&#20010;&#19968;&#33324;&#30340;&#29305;&#24449;&#20107;&#23454;&#65292;&#36825;&#20123;&#20107;&#23454;&#22312;&#32463;&#39564;&#21644;&#23454;&#39564;&#19978;&#37117;&#34987;&#20805;&#20998;&#39564;&#35777;&#65306;&#25237;&#26426;&#24615;&#36164;&#20135;&#20215;&#26684;&#30340;&#36807;&#24230;&#27874;&#21160;&#12289;&#23614;&#37096;&#21402;&#23614;&#21644;&#32858;&#31867;&#27874;&#21160;&#12290;&#23614;&#37096;&#21402;&#23614;&#22312;&#27169;&#22411;&#20013;&#30001;&#20110;&#25237;&#26426;&#24615;&#36136;&#30340;&#25918;&#22823;&#23548;&#33268;&#65292;&#20135;&#29983;&#20102;&#19968;&#20010;&#38543;&#26426;&#31995;&#25968;&#33258;&#22238;&#24402;&#25910;&#30410;&#36807;&#31243;&#65288;&#20197;&#21450;&#24130;&#24459;&#23614;&#37096;&#65289;&#65307;&#27874;&#21160;&#30340;&#32858;&#31867;&#24615;&#36136;&#26159;&#30001;&#20132;&#26131;&#32773;&#23545;&#26032;&#38395;&#30340;&#38271;&#26399;&#35760;&#24518;&#25152;&#24341;&#36215;&#30340;&#65307;&#27873;&#27819;&#26159;&#19968;&#31181;
&lt;/p&gt;
&lt;p&gt;
A Classical Model of Speculative Asset Price Dynamics. (arXiv:2307.00410v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.00410
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#36890;&#36807;&#24341;&#20837;&#32463;&#20856;&#35266;&#28857;&#65292;&#23558;&#31454;&#20105;&#35270;&#20026;&#22522;&#20110;&#39044;&#23450;&#20215;&#26684;&#30340;&#38598;&#20307;&#35752;&#20215;&#36824;&#20215;&#36807;&#31243;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#35299;&#37322;&#25237;&#26426;&#24615;&#36164;&#20135;&#20215;&#26684;&#30340;&#27874;&#21160;&#29305;&#24449;&#12290;&#36890;&#36807;&#23454;&#39564;&#39564;&#35777;&#65292;&#35813;&#27169;&#22411;&#25104;&#21151;&#35299;&#37322;&#20102;&#36807;&#24230;&#27874;&#21160;&#12289;&#23614;&#37096;&#21402;&#23614;&#21644;&#32858;&#31867;&#27874;&#21160;&#31561;&#29616;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22238;&#39038;&#24615;&#22320;&#65292;&#23545;&#31454;&#20105;&#24066;&#22330;&#34892;&#20026;&#30340;&#23454;&#39564;&#21457;&#29616;&#24341;&#21457;&#20102;&#23545;&#32463;&#20856;&#31454;&#20105;&#35266;&#28857;&#30340;&#22797;&#20852;&#65292;&#23558;&#31454;&#20105;&#35270;&#20026;&#22522;&#20110;&#39044;&#23450;&#20215;&#26684;&#30340;&#38598;&#20307;&#35752;&#20215;&#36824;&#20215;&#36807;&#31243;&#65292;&#32780;&#19981;&#26159;&#20215;&#26684;&#25509;&#21463;&#34892;&#20026;&#12290;&#26412;&#25991;&#23558;&#32463;&#20856;&#26041;&#27861;&#24212;&#29992;&#20110;&#22788;&#29702;&#20215;&#26684;&#31283;&#23450;&#24615;&#30340;&#37325;&#35201;&#38556;&#30861;&#20043;&#19968;&#8212;&#8212;&#25237;&#26426;&#34892;&#20026;&#12290;&#35813;&#27169;&#22411;&#26159;&#22522;&#20110;&#29616;&#22330;&#25110;&#23454;&#39564;&#23460;&#36164;&#20135;&#24066;&#22330;&#35774;&#32622;&#30340;&#20856;&#22411;&#29305;&#24449;&#65292;&#24182;&#21487;&#29992;&#20110;&#23454;&#39564;&#39564;&#35777;&#20854;&#20855;&#20307;&#39044;&#27979;&#12290;&#26412;&#25991;&#21033;&#29992;&#35813;&#27169;&#22411;&#35299;&#37322;&#20102;&#25237;&#26426;&#24615;&#36164;&#20135;&#20215;&#26684;&#30340;&#19977;&#20010;&#32463;&#39564;&#21644;&#23454;&#39564;&#19978;&#24050;&#32463;&#20805;&#20998;&#39564;&#35777;&#30340;&#19968;&#33324;&#29305;&#24449;&#65306;&#36807;&#24230;&#27874;&#21160;&#12289;&#23614;&#37096;&#21402;&#23614;&#21644;&#32858;&#31867;&#27874;&#21160;&#12290;&#27169;&#22411;&#20013;&#30340;&#23614;&#37096;&#21402;&#23614;&#26159;&#30001;&#20110;&#25237;&#26426;&#24615;&#36136;&#30340;&#25918;&#22823;&#36896;&#25104;&#30340;&#65292;&#20174;&#32780;&#20135;&#29983;&#20102;&#38543;&#26426;&#31995;&#25968;&#33258;&#22238;&#24402;&#30340;&#25910;&#30410;&#36807;&#31243;&#65288;&#20197;&#21450;&#24130;&#24459;&#23614;&#37096;&#65289;&#65307;&#27874;&#21160;&#30340;&#32858;&#31867;&#24615;&#36136;&#26159;&#30001;&#20132;&#26131;&#32773;&#23545;&#26032;&#38395;&#30340;&#38271;&#26399;&#35760;&#24518;&#25152;&#24341;&#36215;&#30340;&#65307;&#32780;&#27873;&#27819;&#26159;&#24066;&#22330;&#30340;&#30701;&#26399;&#20559;&#31163;&#39044;&#26399;&#30340;&#32467;&#26524;&#65292;&#20135;&#29983;&#20102;&#19981;&#21487;&#25345;&#32493;&#30340;&#36164;&#20135;&#20215;&#26684;&#19978;&#28072;&#12290;
&lt;/p&gt;
&lt;p&gt;
In retrospect, the experimental findings on competitive market behavior called for a revival of the old, classical, view of competition as a collective higgling and bargaining process (as opposed to price-taking behaviors) founded on reservation prices (in place of the utility function). In this paper, we specialize the classical methodology to deal with speculation, an important impediment to price stability. The model involves typical features of a field or lab asset market setup and lends itself to an experimental test of its specific predictions; here we use the model to explain three general stylized facts, well established both empirically and experimentally: the excess, fat-tailed, and clustered volatility of speculative asset prices. The fat tails emerge in the model from the amplifying nature of speculation, leading to a random-coefficient autoregressive return process (and power-law tails); the volatility clustering is due to the traders' long memory of news; bubbles are a pe
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#24046;&#24322;&#25511;&#21046;&#19982;&#20107;&#20214;&#30740;&#31350;&#26041;&#27861;&#25506;&#35752;&#20102;&#22320;&#26041;&#35302;&#21457;&#26242;&#20572;&#39537;&#36880;&#20196;&#26159;&#21542;&#23548;&#33268;COVID-19&#30149;&#20363;&#21644;&#27515;&#20129;&#20154;&#25968;&#22686;&#21152;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#35299;&#38500;&#36825;&#20123;&#26242;&#20572;&#25514;&#26045;&#23545;COVID-19&#20256;&#25773;&#24433;&#21709;&#29978;&#24494;&#12290;</title><link>http://arxiv.org/abs/2307.00251</link><description>&lt;p&gt;
&#22320;&#26041;&#39537;&#36880;&#26242;&#20572;&#25514;&#26045;&#19982;COVID-19&#30340;&#20256;&#25773;
&lt;/p&gt;
&lt;p&gt;
Local Eviction Moratoria and the Spread of COVID-19. (arXiv:2307.00251v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.00251
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#24046;&#24322;&#25511;&#21046;&#19982;&#20107;&#20214;&#30740;&#31350;&#26041;&#27861;&#25506;&#35752;&#20102;&#22320;&#26041;&#35302;&#21457;&#26242;&#20572;&#39537;&#36880;&#20196;&#26159;&#21542;&#23548;&#33268;COVID-19&#30149;&#20363;&#21644;&#27515;&#20129;&#20154;&#25968;&#22686;&#21152;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#35299;&#38500;&#36825;&#20123;&#26242;&#20572;&#25514;&#26045;&#23545;COVID-19&#20256;&#25773;&#24433;&#21709;&#29978;&#24494;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;COVID-19&#22823;&#27969;&#34892;&#30340;&#21021;&#26399;&#38454;&#27573;&#65292;&#21508;&#20010;&#32654;&#22269;&#24030;&#21644;&#22320;&#26041;&#25919;&#24220;&#23454;&#26045;&#20102;&#39537;&#36880;&#26242;&#20572;&#25514;&#26045;&#12290;&#36825;&#20123;&#26242;&#20572;&#25514;&#26045;&#30340;&#20027;&#35201;&#30446;&#30340;&#20043;&#19968;&#26159;&#20943;&#32531;COVID-19&#24863;&#26579;&#30340;&#20256;&#25773;&#12290;&#25105;&#20204;&#37319;&#29992;&#21322;&#21442;&#25968;&#24046;&#24322;&#25511;&#21046;&#19982;&#20107;&#20214;&#30740;&#31350;&#35268;&#33539;&#26469;&#27979;&#35797;&#36825;&#20123;&#22320;&#26041;&#26242;&#20572;&#25514;&#26045;&#35299;&#38500;&#26159;&#21542;&#23548;&#33268;COVID-19&#30149;&#20363;&#21644;&#27515;&#20129;&#20154;&#25968;&#30340;&#22686;&#21152;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#21457;&#29616;&#65292;&#22312;&#32771;&#34385;&#23454;&#38469;&#39537;&#36880;&#24773;&#20917;&#24182;&#22312;&#21439;&#32423;&#36827;&#34892;&#20998;&#26512;&#21518;&#65292;&#21508;&#31181;&#35268;&#33539;&#19979;&#30340;&#32467;&#26524;&#24182;&#19981;&#19968;&#33268;&#12290;&#25105;&#20204;&#35748;&#20026;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#26368;&#36817;&#21457;&#23637;&#30340;&#22686;&#24378;&#21512;&#25104;&#25511;&#21046;&#65288;ASCM&#65289;&#26041;&#27861;&#26356;&#20026;&#36866;&#29992;&#12290;&#25105;&#20204;&#30340;ASCM&#32467;&#26524;&#36824;&#34920;&#26126;&#65292;&#35299;&#38500;&#39537;&#36880;&#26242;&#20572;&#25514;&#26045;&#23545;COVID-19&#30149;&#20363;&#21644;&#27515;&#20129;&#20154;&#25968;&#20960;&#20046;&#27809;&#26377;&#24433;&#21709;&#12290;&#22240;&#27492;&#65292;&#20284;&#20046;&#39537;&#36880;&#26242;&#20572;&#25514;&#26045;&#23545;&#20943;&#23569;COVID-19&#20256;&#25773;&#30340;&#24433;&#21709;&#24456;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;
At various stages during the initial onset of the COVID-19 pandemic, various US states and local municipalities enacted eviction moratoria. One of the main aims of these moratoria was to slow the spread of COVID-19 infections. We deploy a semiparametric difference-in-differences approach with an event study specification to test whether the lifting of these local moratoria led to an increase in COVID-19 cases and deaths. Our main findings, across a range of specifications, are inconclusive regarding the impact of the moratoria especially after accounting for the number of actual evictions and conducting the analysis at the county level. We argue that recently developed augmented synthetic control (ASCM) methods are more appropriate in this setting. Our ASCM results also suggest that the lifting of eviction moratoria had little to no impact on COVID-19 cases and deaths. Thus, it seems that eviction moratoria had little to no robust effect on reducing the spread of COVID-19 throwing in
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#31350;&#20102;&#20351;&#29992;ChatGPT&#21450;&#20854;&#20182;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#39044;&#27979;&#32929;&#24066;&#22238;&#25253;&#30340;&#28508;&#21147;&#65292;&#21457;&#29616;ChatGPT&#30340;&#39044;&#27979;&#34920;&#29616;&#20248;&#20110;&#20256;&#32479;&#24773;&#24863;&#20998;&#26512;&#26041;&#27861;&#65292;&#32780;&#22522;&#30784;&#27169;&#22411;&#26080;&#27861;&#20934;&#30830;&#39044;&#27979;&#32929;&#31080;&#20215;&#26684;&#21464;&#21270;&#65292;&#34920;&#26126;&#22797;&#26434;&#27169;&#22411;&#21487;&#39044;&#27979;&#33021;&#21147;&#30340;&#23835;&#36215;&#12290;&#36825;&#34920;&#26126;&#22312;&#25237;&#36164;&#20915;&#31574;&#36807;&#31243;&#20013;&#24341;&#20837;&#20808;&#36827;&#30340;&#35821;&#35328;&#27169;&#22411;&#21487;&#20197;&#25552;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#24182;&#22686;&#24378;&#23450;&#37327;&#20132;&#26131;&#31574;&#30053;&#30340;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2304.07619</link><description>&lt;p&gt;
ChatGPT&#26159;&#21542;&#33021;&#22815;&#39044;&#27979;&#32929;&#31080;&#20215;&#26684;&#27874;&#21160;&#65311;&#22238;&#25253;&#21487;&#39044;&#27979;&#24615;&#19982;&#22823;&#35821;&#35328;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
Can ChatGPT Forecast Stock Price Movements? Return Predictability and Large Language Models. (arXiv:2304.07619v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.07619
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#31350;&#20102;&#20351;&#29992;ChatGPT&#21450;&#20854;&#20182;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#39044;&#27979;&#32929;&#24066;&#22238;&#25253;&#30340;&#28508;&#21147;&#65292;&#21457;&#29616;ChatGPT&#30340;&#39044;&#27979;&#34920;&#29616;&#20248;&#20110;&#20256;&#32479;&#24773;&#24863;&#20998;&#26512;&#26041;&#27861;&#65292;&#32780;&#22522;&#30784;&#27169;&#22411;&#26080;&#27861;&#20934;&#30830;&#39044;&#27979;&#32929;&#31080;&#20215;&#26684;&#21464;&#21270;&#65292;&#34920;&#26126;&#22797;&#26434;&#27169;&#22411;&#21487;&#39044;&#27979;&#33021;&#21147;&#30340;&#23835;&#36215;&#12290;&#36825;&#34920;&#26126;&#22312;&#25237;&#36164;&#20915;&#31574;&#36807;&#31243;&#20013;&#24341;&#20837;&#20808;&#36827;&#30340;&#35821;&#35328;&#27169;&#22411;&#21487;&#20197;&#25552;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#24182;&#22686;&#24378;&#23450;&#37327;&#20132;&#26131;&#31574;&#30053;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;&#24773;&#24863;&#20998;&#26512;&#39044;&#27979;&#32929;&#24066;&#22238;&#25253;&#30340;&#28508;&#21147;&#65292;&#25506;&#35752;&#20102;&#20351;&#29992;ChatGPT&#20197;&#21450;&#20854;&#20182;&#22823;&#35821;&#35328;&#27169;&#22411;&#22312;&#39044;&#27979;&#32929;&#24066;&#22238;&#25253;&#26041;&#38754;&#30340;&#34920;&#29616;&#12290;&#25105;&#20204;&#20351;&#29992;ChatGPT&#21028;&#26029;&#26032;&#38395;&#26631;&#39064;&#23545;&#20844;&#21496;&#32929;&#31080;&#20215;&#26684;&#26159;&#22909;&#28040;&#24687;&#12289;&#22351;&#28040;&#24687;&#25110;&#26080;&#20851;&#28040;&#24687;&#12290;&#36890;&#36807;&#35745;&#31639;&#25968;&#23383;&#20998;&#25968;&#65292;&#25105;&#20204;&#21457;&#29616;&#36825;&#20123;"ChatGPT&#20998;&#25968;"&#21644;&#38543;&#21518;&#30340;&#26085;&#24120;&#32929;&#31080;&#24066;&#22330;&#22238;&#25253;&#20043;&#38388;&#23384;&#22312;&#27491;&#30456;&#20851;&#24615;&#12290;&#32780;&#19988;&#65292;ChatGPT&#30340;&#34920;&#29616;&#20248;&#20110;&#20256;&#32479;&#30340;&#24773;&#24863;&#20998;&#26512;&#26041;&#27861;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#21457;&#29616;GPT-1&#12289;GPT-2&#21644;BERT&#31561;&#22522;&#30784;&#27169;&#22411;&#26080;&#27861;&#20934;&#30830;&#39044;&#27979;&#22238;&#25253;&#65292;&#36825;&#34920;&#26126;&#22238;&#25253;&#21487;&#39044;&#27979;&#24615;&#26159;&#22797;&#26434;&#27169;&#22411;&#30340;&#19968;&#31181;&#26032;&#20852;&#33021;&#21147;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#23558;&#20808;&#36827;&#30340;&#35821;&#35328;&#27169;&#22411;&#32435;&#20837;&#25237;&#36164;&#20915;&#31574;&#36807;&#31243;&#21487;&#20197;&#20135;&#29983;&#26356;&#20934;&#30830;&#30340;&#39044;&#27979;&#65292;&#24182;&#25552;&#39640;&#23450;&#37327;&#20132;&#26131;&#31574;&#30053;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
We examine the potential of ChatGPT, and other large language models, in predicting stock market returns using sentiment analysis of news headlines. We use ChatGPT to indicate whether a given headline is good, bad, or irrelevant news for firms' stock prices. We then compute a numerical score and document a positive correlation between these ``ChatGPT scores'' and subsequent daily stock market returns. Further, ChatGPT outperforms traditional sentiment analysis methods. We find that more basic models such as GPT-1, GPT-2, and BERT cannot accurately forecast returns, indicating return predictability is an emerging capacity of complex models. Our results suggest that incorporating advanced language models into the investment decision-making process can yield more accurate predictions and enhance the performance of quantitative trading strategies.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#20844;&#21496;&#22686;&#38271;&#29575;&#30340;&#30456;&#20851;&#32467;&#26500;&#65292;&#24182;&#21457;&#29616;&#20379;&#24212;&#38142;&#30456;&#36830;&#30340;&#20844;&#21496;&#20855;&#26377;&#26356;&#24378;&#30340;&#30456;&#20851;&#24615;&#12290;&#36890;&#36807;&#21435;&#38500;&#20849;&#21516;&#22240;&#32032;&#65292;&#21487;&#20197;&#26174;&#33879;&#38477;&#20302;&#27809;&#26377;&#20379;&#24212;&#38142;&#20851;&#31995;&#30340;&#20844;&#21496;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#21487;&#20197;&#21033;&#29992;&#36825;&#19968;&#35266;&#23519;&#32467;&#26524;&#37325;&#26500;&#20379;&#24212;&#38142;&#32593;&#32476;&#30340;&#25299;&#25169;&#32467;&#26500;&#12290;</title><link>http://arxiv.org/abs/2302.09906</link><description>&lt;p&gt;
&#25581;&#31034;&#20844;&#21496;&#22686;&#38271;&#21160;&#24577;&#20013;&#30340;&#29983;&#20135;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
Revealing production networks from firm growth dynamics. (arXiv:2302.09906v4 [q-fin.ST] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.09906
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#20844;&#21496;&#22686;&#38271;&#29575;&#30340;&#30456;&#20851;&#32467;&#26500;&#65292;&#24182;&#21457;&#29616;&#20379;&#24212;&#38142;&#30456;&#36830;&#30340;&#20844;&#21496;&#20855;&#26377;&#26356;&#24378;&#30340;&#30456;&#20851;&#24615;&#12290;&#36890;&#36807;&#21435;&#38500;&#20849;&#21516;&#22240;&#32032;&#65292;&#21487;&#20197;&#26174;&#33879;&#38477;&#20302;&#27809;&#26377;&#20379;&#24212;&#38142;&#20851;&#31995;&#30340;&#20844;&#21496;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#21487;&#20197;&#21033;&#29992;&#36825;&#19968;&#35266;&#23519;&#32467;&#26524;&#37325;&#26500;&#20379;&#24212;&#38142;&#32593;&#32476;&#30340;&#25299;&#25169;&#32467;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#20844;&#21496;&#22686;&#38271;&#29575;&#30340;&#30456;&#20851;&#32467;&#26500;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22823;&#22810;&#25968;&#20844;&#21496;&#30340;&#30456;&#20851;&#24615;&#26159;&#30001;&#20110;&#23427;&#20204;&#26292;&#38706;&#20110;&#19968;&#20010;&#20849;&#21516;&#22240;&#32032;&#65292;&#20294;&#36890;&#36807;&#20379;&#24212;&#38142;&#30456;&#36830;&#30340;&#20844;&#21496;&#30340;&#30456;&#20851;&#24615;&#24179;&#22343;&#27604;&#27809;&#26377;&#20851;&#32852;&#30340;&#20844;&#21496;&#26356;&#24378;&#12290;&#21435;&#38500;&#36825;&#20010;&#20849;&#21516;&#22240;&#32032;&#26174;&#33879;&#38477;&#20302;&#20004;&#20010;&#27809;&#26377;&#20379;&#24212;&#38142;&#20851;&#31995;&#30340;&#20844;&#21496;&#20043;&#38388;&#30340;&#24179;&#22343;&#30456;&#20851;&#24615;&#65292;&#21516;&#26102;&#20445;&#25345;&#20004;&#20010;&#30456;&#36830;&#20844;&#21496;&#20043;&#38388;&#30340;&#26174;&#33879;&#30456;&#20851;&#24615;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#26159;&#21542;&#21487;&#20197;&#21033;&#29992;&#36825;&#19968;&#35266;&#23519;&#32467;&#26524;&#20351;&#29992;&#39640;&#26031;&#39532;&#23572;&#31185;&#22827;&#27169;&#22411;&#37325;&#26500;&#20379;&#24212;&#38142;&#32593;&#32476;&#30340;&#25299;&#25169;&#32467;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the correlation structure of firm growth rates. We show that most firms are correlated because of their exposure to a common factor but that firms linked through the supply chain exhibit a stronger correlation on average than firms that are not. Removing this common factor significantly reduces the average correlation between two firms with no relationship in the supply chain while maintaining a significant correlation between two firms that are linked. We then investigate if this observation can be used to reconstruct the topology of a supply chain network using Gaussian Markov Models.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#20840;&#29699;&#20844;&#21496;&#29615;&#22659;&#23454;&#36341;&#30340;&#25968;&#25454;&#24471;&#20986;&#32467;&#35770;&#65306;&#20844;&#21496;&#30340;&#29615;&#22659;&#24433;&#21709;&#19982;&#20854;&#35268;&#27169;&#25104;&#31616;&#21333;&#30340;&#24130;&#24459;&#20851;&#31995;&#65292;&#21487;&#20197;&#26500;&#24314;&#19968;&#20010;&#29305;&#23450;&#20110;&#34892;&#19994;&#12289;&#22823;&#23567;&#30456;&#20851;&#30340;&#22522;&#20934;&#26469;&#35780;&#20272;&#20844;&#21496;&#30340;&#29615;&#22659;&#32489;&#25928;&#65292;&#24182;&#23454;&#26045;&#36825;&#26679;&#30340;&#22522;&#20934;&#21487;&#33021;&#20250;&#23548;&#33268;15%&#30340;&#25490;&#25918;&#20943;&#23569;&#12290;</title><link>http://arxiv.org/abs/2206.03148</link><description>&lt;p&gt;
&#20197;&#20840;&#29699;&#20844;&#21496;&#20026;&#22522;&#20934;&#30340;&#35268;&#27169;&#23450;&#24459;&#20316;&#20026;&#35780;&#20272;&#29615;&#22659;&#32489;&#25928;&#30340;&#22522;&#30784;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Scaling laws in global corporations as a benchmarking approach to assess environmental performance. (arXiv:2206.03148v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.03148
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#20840;&#29699;&#20844;&#21496;&#29615;&#22659;&#23454;&#36341;&#30340;&#25968;&#25454;&#24471;&#20986;&#32467;&#35770;&#65306;&#20844;&#21496;&#30340;&#29615;&#22659;&#24433;&#21709;&#19982;&#20854;&#35268;&#27169;&#25104;&#31616;&#21333;&#30340;&#24130;&#24459;&#20851;&#31995;&#65292;&#21487;&#20197;&#26500;&#24314;&#19968;&#20010;&#29305;&#23450;&#20110;&#34892;&#19994;&#12289;&#22823;&#23567;&#30456;&#20851;&#30340;&#22522;&#20934;&#26469;&#35780;&#20272;&#20844;&#21496;&#30340;&#29615;&#22659;&#32489;&#25928;&#65292;&#24182;&#23454;&#26045;&#36825;&#26679;&#30340;&#22522;&#20934;&#21487;&#33021;&#20250;&#23548;&#33268;15%&#30340;&#25490;&#25918;&#20943;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#26368;&#22823;&#30340;6,529&#23478;&#36328;&#22269;&#20844;&#21496;&#36127;&#36131;&#20102;&#36817;30%&#30340;&#20840;&#29699;CO2e&#25490;&#25918;&#37327;&#12290;&#36234;&#26469;&#36234;&#22810;&#30340;&#32929;&#19996;&#21644;&#21033;&#30410;&#30456;&#20851;&#32773;&#24847;&#35782;&#21040;&#20225;&#19994;&#22312;&#21487;&#25345;&#32493;&#21457;&#23637;&#36947;&#36335;&#19978;&#30340;&#20316;&#29992;&#65292;&#22240;&#27492;&#20182;&#20204;&#36861;&#27714;&#36234;&#26469;&#36234;&#20005;&#26684;&#21644;&#38596;&#24515;&#21187;&#21187;&#30340;&#29615;&#22659;&#30446;&#26631;&#12290;&#20294;&#26159;&#65292;&#22914;&#20309;&#23458;&#35266;&#39640;&#25928;&#22320;&#35780;&#20272;&#20225;&#19994;&#30340;&#29615;&#22659;&#32489;&#25928;&#20173;&#28982;&#26159;&#19968;&#20010;&#24748;&#32780;&#26410;&#20915;&#30340;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#25581;&#31034;&#20102;&#21487;&#20197;&#29992;&#26469;&#26500;&#24314;&#20844;&#21496;&#29615;&#22659;&#24433;&#21709;&#30340;&#23450;&#37327;&#32479;&#19968;&#22270;&#29255;&#30340;&#22522;&#26412;&#21160;&#24577;&#21644;&#32467;&#26500;&#12290;&#26412;&#30740;&#31350;&#34920;&#26126;&#65292;&#20844;&#21496;&#30340;&#29615;&#22659;&#24433;&#21709;&#65288;&#26032;&#38472;&#20195;&#35874;&#65289;CO2e&#33021;&#28304;&#20351;&#29992;&#65292;&#27700;&#21462;&#27700;&#21644;&#24223;&#21697;&#29983;&#20135;&#30340;&#35268;&#27169;&#19982;&#20854;&#35268;&#27169;&#25104;&#31616;&#21333;&#30340;&#24130;&#24459;&#20851;&#31995;&#65292;&#36825;&#24448;&#24448;&#26159;&#27425;&#32447;&#24615;&#30340;&#65292;&#24182;&#19988;&#21487;&#20197;&#29992;&#26469;&#25512;&#23548;&#20986;&#19968;&#20010;&#29305;&#23450;&#20110;&#34892;&#19994;&#65292;&#22823;&#23567;&#30456;&#20851;&#30340;&#22522;&#20934;&#26469;&#26126;&#30830;&#35780;&#20272;&#20844;&#21496;&#30340;&#29615;&#22659;&#32489;&#25928;&#12290;&#23454;&#26045;&#36825;&#26679;&#30340;&#22522;&#20934;&#21487;&#33021;&#20250;&#23548;&#33268;15%&#30340;&#25490;&#25918;&#20943;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;
The largest 6,529 international corporations are accountable for almost 30% of global CO2e emissions. A growing awareness of the role of the corporate world in the path toward sustainability has led many shareholders and stakeholders to pursue increasingly stringent and ambitious environmental goals. However, how to assess the corporate environmental performance objectively and efficiently remains an open question. This study reveals underlying dynamics and structures that can be used to construct a unified quantitative picture of the environmental impact of companies. This study shows that the environmental impact (metabolism) of companies CO2e energy used, water withdrawal and waste production, scales with their size according to a simple power law which is often sublinear, and can be used to derive a sector-specific, size-dependent benchmark to asses unambiguously a company's environmental performance. Enforcing such a benchmark would potentially result in a 15% emissions reduction,
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#23545;&#38543;&#26426;&#26102;&#38047;&#30340;&#26174;&#33879;&#25913;&#36827;&#65292;&#20197;&#23454;&#29616;&#30456;&#21516;&#30446;&#26631;&#20294;&#19981;&#20943;&#23569;&#20132;&#26131;&#25968;&#37327;&#25110;&#25913;&#21464;&#20132;&#26131;&#24378;&#24230;&#12290;&#36890;&#36807;&#19981;&#21516;&#36873;&#25321;&#30340;&#35843;&#33410;&#20869;&#26680;&#65292;&#21487;&#20197;&#36731;&#26494;&#23454;&#29616;&#20219;&#24847;&#39640;&#20559;&#24230;&#21644;&#36229;&#39069;&#23792;&#24230;&#30340;&#25910;&#30410;&#65292;&#24182;&#20998;&#26512;&#20102;&#35843;&#33410;&#26102;&#38047;&#21644;&#28151;&#21512;&#27169;&#22411;&#30340;&#29305;&#24449;&#20197;&#21450;&#20854;&#22312;&#32479;&#35745;&#20272;&#35745;&#12289;&#26399;&#26435;&#23450;&#20215;&#26657;&#20934;&#21644;&#27169;&#25311;&#25216;&#26415;&#20013;&#30340;&#24212;&#29992;&#12290;</title><link>http://arxiv.org/abs/2205.00383</link><description>&lt;p&gt;
&#35843;&#33410;&#38543;&#26426;&#26102;&#38047;
&lt;/p&gt;
&lt;p&gt;
Regulating stochastic clocks. (arXiv:2205.00383v2 [q-fin.ST] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.00383
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#23545;&#38543;&#26426;&#26102;&#38047;&#30340;&#26174;&#33879;&#25913;&#36827;&#65292;&#20197;&#23454;&#29616;&#30456;&#21516;&#30446;&#26631;&#20294;&#19981;&#20943;&#23569;&#20132;&#26131;&#25968;&#37327;&#25110;&#25913;&#21464;&#20132;&#26131;&#24378;&#24230;&#12290;&#36890;&#36807;&#19981;&#21516;&#36873;&#25321;&#30340;&#35843;&#33410;&#20869;&#26680;&#65292;&#21487;&#20197;&#36731;&#26494;&#23454;&#29616;&#20219;&#24847;&#39640;&#20559;&#24230;&#21644;&#36229;&#39069;&#23792;&#24230;&#30340;&#25910;&#30410;&#65292;&#24182;&#20998;&#26512;&#20102;&#35843;&#33410;&#26102;&#38047;&#21644;&#28151;&#21512;&#27169;&#22411;&#30340;&#29305;&#24449;&#20197;&#21450;&#20854;&#22312;&#32479;&#35745;&#20272;&#35745;&#12289;&#26399;&#26435;&#23450;&#20215;&#26657;&#20934;&#21644;&#27169;&#25311;&#25216;&#26415;&#20013;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#26426;&#26102;&#38047;&#26159;&#19968;&#31867;&#23558;&#20132;&#26131;&#27963;&#21160;&#32435;&#20837;&#36830;&#32493;&#26102;&#38388;&#37329;&#34701;&#27169;&#22411;&#30340;&#26102;&#38388;&#21464;&#25442;&#26041;&#27861;&#65292;&#33021;&#22815;&#22788;&#29702;&#37329;&#34701;&#25910;&#30410;&#20013;&#30340;&#20856;&#22411;&#38750;&#23545;&#31216;&#21644;&#23614;&#39118;&#38505;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#23545;&#38543;&#26426;&#26102;&#38047;&#30340;&#26174;&#33879;&#25913;&#36827;&#65292;&#20197;&#23454;&#29616;&#30456;&#21516;&#30446;&#26631;&#20294;&#19981;&#20943;&#23569;&#20132;&#26131;&#25968;&#37327;&#25110;&#25913;&#21464;&#20132;&#26131;&#24378;&#24230;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#38024;&#23545;&#20219;&#20309;L&#233;vy&#19979;&#38477;&#23376;&#65292;&#25110;&#26356;&#19968;&#33324;&#22320;&#38024;&#23545;&#38750;&#36127;&#29420;&#31435;&#22686;&#37327;&#30340;&#36807;&#31243;&#65292;&#24182;&#22522;&#20110;&#26469;&#33258;&#37325;&#22797;&#24179;&#22343;&#30340;&#21508;&#31181;&#35843;&#33410;&#20869;&#26680;&#30340;&#36873;&#25321;&#12290;&#36890;&#36807;&#19982;&#35843;&#33410;&#31243;&#24230;&#30456;&#20851;&#30340;&#36229;&#21442;&#25968;&#65292;&#21487;&#20197;&#36731;&#26494;&#23454;&#29616;&#25910;&#30410;&#30340;&#20219;&#24847;&#39640;&#20559;&#24230;&#21644;&#36229;&#39069;&#23792;&#24230;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#35843;&#33410;&#26102;&#38047;&#21644;&#21518;&#32493;&#28151;&#21512;&#27169;&#22411;&#30340;&#36890;&#29992;&#26102;&#38388;&#25289;&#26222;&#25289;&#26031;&#21464;&#25442;&#65292;&#29305;&#24449;&#19977;&#20803;&#32452;&#21644;&#32047;&#31215;&#37327;&#65292;&#36825;&#20123;&#20998;&#26512;&#21487;&#29992;&#20110;&#32479;&#35745;&#20272;&#35745;&#12289;&#26399;&#26435;&#23450;&#20215;&#26657;&#20934;&#21644;&#27169;&#25311;&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;
Stochastic clocks represent a class of time change methods for incorporating trading activity into continuous-time financial models, with the ability to deal with typical asymmetrical and tail risks in financial returns. In this paper we propose a significant improvement of stochastic clocks for the same objective but without decreasing the number of trades or changing the trading intensity. Our methodology targets any L\'{e}vy subordinator, or more generally any process of nonnegative independent increments, and is based on various choices of regulating kernels motivated from repeated averaging. By way of a hyperparameter linked to the degree of regulation, arbitrarily large skewness and excess kurtosis of returns can be easily achieved. Generic-time Laplace transforms, characterizing triplets, and cumulants of the regulated clocks and subsequent mixed models are analyzed, serving purposes ranging from statistical estimation and option price calibration to simulation techniques. Under
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20004;&#20010;&#28041;&#21450;&#20987;&#20013;&#26102;&#38388;&#30340;McKean-Vlasov&#26041;&#31243;&#30340;&#29190;&#30772;&#20998;&#26512;&#65292;&#24182;&#32473;&#20986;&#20102;&#31616;&#21333;&#26465;&#20214;&#20351;&#24471;&#23545;&#24212;&#30340;Fokker-Planck&#26041;&#31243;&#19981;&#20250;&#29190;&#30772;&#65292;&#20174;&#32780;&#20445;&#35777;&#20102;McKean-Vlasov&#21160;&#21147;&#23398;&#30340;&#20840;&#23616;&#21487;&#35299;&#24615;&#12290;</title><link>http://arxiv.org/abs/2010.14646</link><description>&lt;p&gt;
&#28041;&#21450;&#20987;&#20013;&#26102;&#38388;&#30340;McKean-Vlasov&#26041;&#31243;&#65306;&#29190;&#30772;&#21644;&#20840;&#23616;&#21487;&#35299;&#24615;
&lt;/p&gt;
&lt;p&gt;
McKean-Vlasov equations involving hitting times: blow-ups and global solvability. (arXiv:2010.14646v3 [math.PR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2010.14646
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20004;&#20010;&#28041;&#21450;&#20987;&#20013;&#26102;&#38388;&#30340;McKean-Vlasov&#26041;&#31243;&#30340;&#29190;&#30772;&#20998;&#26512;&#65292;&#24182;&#32473;&#20986;&#20102;&#31616;&#21333;&#26465;&#20214;&#20351;&#24471;&#23545;&#24212;&#30340;Fokker-Planck&#26041;&#31243;&#19981;&#20250;&#29190;&#30772;&#65292;&#20174;&#32780;&#20445;&#35777;&#20102;McKean-Vlasov&#21160;&#21147;&#23398;&#30340;&#20840;&#23616;&#21487;&#35299;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#28041;&#21450;&#20987;&#20013;&#26102;&#38388;&#30340;&#20004;&#20010;McKean-Vlasov&#26041;&#31243;&#30340;&#29190;&#30772;&#20998;&#26512;&#12290;&#35774;$(B(t); \, t \ge 0)$&#20026;&#26631;&#20934;&#24067;&#26391;&#36816;&#21160;&#65292;$\tau:= \inf\{t \ge 0: X(t) \le 0\}$&#20026;&#32473;&#23450;&#36807;&#31243;$X$&#30340;&#38646;&#20987;&#20013;&#26102;&#38388;&#12290;&#31532;&#19968;&#20010;&#26041;&#31243;&#26159;$X(t) = X(0) + B(t) \alpha \mathbb{P}(\tau \le t)$&#12290;&#25105;&#20204;&#32473;&#20986;&#20102;&#20851;&#20110;$\alpha$&#21644;$X(0)$&#20998;&#24067;&#30340;&#31616;&#21333;&#26465;&#20214;&#65292;&#20351;&#24471;&#30456;&#24212;&#30340;Fokker-Planck&#26041;&#31243;&#19981;&#20250;&#29190;&#30772;&#65292;&#20174;&#32780;McKean-Vlasov&#21160;&#21147;&#23398;&#22312;&#25152;&#26377;&#26102;&#38388;$t \ge 0$&#19978;&#37117;&#26159;&#33391;&#23450;&#20041;&#30340;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20381;&#36182;&#20110;McKean-Vlasov&#26041;&#31243;&#19982;&#36807;&#20919;Stefan&#38382;&#39064;&#20043;&#38388;&#30340;&#32852;&#31995;&#65292;&#20197;&#21450;&#20960;&#20010;&#27604;&#36739;&#21407;&#29702;&#12290;&#31532;&#20108;&#20010;&#26041;&#31243;&#26159;$X(t) = X(0) + \beta t + B(t) + \alpha \log \mathbb{P}(\tau &gt; t)$&#65292;&#20854;Fokker-Planck&#26041;&#31243;&#26159;&#38750;&#23616;&#37096;&#30340;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#23545;&#20110;&#20805;&#20998;&#22823;&#30340;$\beta &gt; 0$&#21644;&#19981;&#22823;&#20110;&#19968;&#23450;&#23567;&#27491;&#24120;&#25968;&#30340;$\alpha$&#65292;&#19981;&#23384;&#22312;&#29190;&#30772;&#29616;&#35937;&#65292;&#24182;&#19988;McKean-Vlasov&#21160;&#21147;&#23398;&#26159;&#23384;&#22312;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper is concerned with the analysis of blow-ups for two McKean-Vlasov equations involving hitting times. Let $(B(t); \, t \ge 0)$ be standard Brownian motion, and $\tau:= \inf\{t \ge 0: X(t) \le 0\}$ be the hitting time to zero of a given process $X$. The first equation is $X(t) = X(0) + B(t) \alpha \mathbb{P}(\tau \le t)$. We provide a simple condition on $\alpha$ and the distribution of $X(0)$ such that the corresponding Fokker-Planck equation has no blow-up, and thus the McKean-Vlasov dynamics is well-defined for all time $t \ge 0$. Our approach relies on a connection between the McKean-Vlasov equation and the supercooled Stefan problem, as well as several comparison principles. The second equation is $X(t) = X(0) + \beta t + B(t) + \alpha \log \mathbb{P}(\tau &gt; t)$, whose Fokker-Planck equation is non-local. We prove that for $\beta &gt; 0$ sufficiently large and $\alpha$ no greater than a sufficiently small positive constant, there is no blow-up and the McKean-Vlasov dynamics
&lt;/p&gt;</description></item></channel></rss>