<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;GPT&#65288;&#22823;&#35821;&#35328;&#27169;&#22411;&#65289;&#21644;&#30456;&#20851;&#25216;&#26415;&#23545;&#32654;&#22269;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#28508;&#22312;&#24433;&#21709;&#65292;&#21457;&#29616;&#22823;&#32422;80%&#30340;&#32654;&#22269;&#21171;&#21160;&#21147;&#21487;&#33021;&#20250;&#21463;&#21040;10%&#30340;&#24037;&#20316;&#20219;&#21153;&#30340;&#24433;&#21709;&#65292;&#28085;&#30422;&#20102;&#25152;&#26377;&#24037;&#36164;&#27700;&#24179;&#21644;&#21508;&#34892;&#21508;&#19994;&#65292;&#39044;&#31034;&#30528;&#36825;&#20123;&#27169;&#22411;&#21487;&#33021;&#20855;&#26377;&#26174;&#33879;&#30340;&#32463;&#27982;&#12289;&#31038;&#20250;&#21644;&#25919;&#31574;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2303.10130</link><description>&lt;p&gt;
GPT&#26159;GPT&#65306;&#22823;&#35821;&#35328;&#27169;&#22411;&#23545;&#21171;&#21160;&#21147;&#24066;&#22330;&#24433;&#21709;&#30340;&#26089;&#26399;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
GPTs are GPTs: An Early Look at the Labor Market Impact Potential of Large Language Models. (arXiv:2303.10130v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10130
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;GPT&#65288;&#22823;&#35821;&#35328;&#27169;&#22411;&#65289;&#21644;&#30456;&#20851;&#25216;&#26415;&#23545;&#32654;&#22269;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#28508;&#22312;&#24433;&#21709;&#65292;&#21457;&#29616;&#22823;&#32422;80%&#30340;&#32654;&#22269;&#21171;&#21160;&#21147;&#21487;&#33021;&#20250;&#21463;&#21040;10%&#30340;&#24037;&#20316;&#20219;&#21153;&#30340;&#24433;&#21709;&#65292;&#28085;&#30422;&#20102;&#25152;&#26377;&#24037;&#36164;&#27700;&#24179;&#21644;&#21508;&#34892;&#21508;&#19994;&#65292;&#39044;&#31034;&#30528;&#36825;&#20123;&#27169;&#22411;&#21487;&#33021;&#20855;&#26377;&#26174;&#33879;&#30340;&#32463;&#27982;&#12289;&#31038;&#20250;&#21644;&#25919;&#31574;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#29983;&#25104;&#39044;&#35757;&#32451;&#21464;&#21387;&#22120;&#65288;GPT&#65289;&#27169;&#22411;&#21644;&#30456;&#20851;&#25216;&#26415;&#23545;&#32654;&#22269;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#28508;&#22312;&#24433;&#21709;&#12290;&#20351;&#29992;&#26032;&#30340;&#26631;&#20934;&#65292;&#25105;&#20204;&#35780;&#20272;&#32844;&#19994;&#19982;GPT&#33021;&#21147;&#30340;&#23545;&#24212;&#20851;&#31995;&#65292;&#32467;&#21512;&#20154;&#31867;&#19987;&#19994;&#30693;&#35782;&#21644;GPT-4&#30340;&#20998;&#31867;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#32422;80%&#30340;&#32654;&#22269;&#21171;&#21160;&#21147;&#21487;&#33021;&#20250;&#33267;&#23569;&#26377;10%&#30340;&#24037;&#20316;&#20219;&#21153;&#21463;&#21040;GPT&#24341;&#20837;&#30340;&#24433;&#21709;&#65292;&#32780;&#32422;19%&#30340;&#24037;&#20154;&#21487;&#33021;&#20250;&#30475;&#21040;&#33267;&#23569;50%&#30340;&#20219;&#21153;&#21463;&#21040;&#24433;&#21709;&#12290;&#24433;&#21709;&#33539;&#22260;&#28085;&#30422;&#20102;&#25152;&#26377;&#24037;&#36164;&#27700;&#24179;&#65292;&#39640;&#25910;&#20837;&#24037;&#20316;&#21487;&#33021;&#38754;&#20020;&#26356;&#22823;&#30340;&#39118;&#38505;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#24433;&#21709;&#24182;&#19981;&#23616;&#38480;&#20110;&#26368;&#36817;&#29983;&#20135;&#29575;&#22686;&#38271;&#36739;&#39640;&#30340;&#34892;&#19994;&#12290;&#25105;&#20204;&#24471;&#20986;&#32467;&#35770;&#65292;&#29983;&#25104;&#39044;&#35757;&#32451;&#21464;&#21387;&#22120;&#20855;&#26377;&#36890;&#29992;&#25216;&#26415;&#65288;GPT&#65289;&#30340;&#29305;&#24615;&#65292;&#34920;&#26126;&#36825;&#20123;&#27169;&#22411;&#21487;&#33021;&#20855;&#26377;&#26174;&#33879;&#30340;&#32463;&#27982;&#12289;&#31038;&#20250;&#21644;&#25919;&#31574;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate the potential implications of Generative Pre-trained Transformer (GPT) models and related technologies on the U.S. labor market. Using a new rubric, we assess occupations based on their correspondence with GPT capabilities, incorporating both human expertise and classifications from GPT-4. Our findings indicate that approximately 80% of the U.S. workforce could have at least 10% of their work tasks affected by the introduction of GPTs, while around 19% of workers may see at least 50% of their tasks impacted. The influence spans all wage levels, with higher-income jobs potentially facing greater exposure. Notably, the impact is not limited to industries with higher recent productivity growth. We conclude that Generative Pre-trained Transformers exhibit characteristics of general-purpose technologies (GPTs), suggesting that as these models could have notable economic, social, and policy implications.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#26242;&#26102;&#21644;&#27704;&#20037;&#20215;&#26684;&#24433;&#21709;&#19979;&#30340;&#32929;&#31080;&#26368;&#20248;&#28165;&#31639;&#31574;&#30053;&#65292;&#21033;&#29992;&#21152;&#23494;&#36135;&#24065;&#25968;&#25454;&#35777;&#26126;&#20102;&#24573;&#30053;&#27704;&#20037;&#20215;&#26684;&#24433;&#21709;&#20250;&#23548;&#33268;&#27425;&#20248;&#28165;&#31639;&#31574;&#30053;&#65292;&#24182;&#25552;&#20986;&#20102;&#38750;&#32447;&#24615;&#20989;&#25968;&#24418;&#24335;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#28165;&#31639;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2303.10043</link><description>&lt;p&gt;
&#20855;&#26377;&#26242;&#26102;&#21644;&#27704;&#20037;&#20215;&#26684;&#24433;&#21709;&#30340;&#26368;&#20248;&#28165;&#31639;&#31574;&#30053;&#65306;&#24212;&#29992;&#20110;&#21152;&#23494;&#36135;&#24065;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Optimal liquidation with temporary and permanent price impact, an application to cryptocurrencies. (arXiv:2303.10043v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10043
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#26242;&#26102;&#21644;&#27704;&#20037;&#20215;&#26684;&#24433;&#21709;&#19979;&#30340;&#32929;&#31080;&#26368;&#20248;&#28165;&#31639;&#31574;&#30053;&#65292;&#21033;&#29992;&#21152;&#23494;&#36135;&#24065;&#25968;&#25454;&#35777;&#26126;&#20102;&#24573;&#30053;&#27704;&#20037;&#20215;&#26684;&#24433;&#21709;&#20250;&#23548;&#33268;&#27425;&#20248;&#28165;&#31639;&#31574;&#30053;&#65292;&#24182;&#25552;&#20986;&#20102;&#38750;&#32447;&#24615;&#20989;&#25968;&#24418;&#24335;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#28165;&#31639;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#26242;&#26102;&#21644;&#27704;&#20037;&#20215;&#26684;&#24433;&#21709;&#23384;&#22312;&#19979;&#30340;&#32929;&#31080;&#26368;&#20248;&#28165;&#31639;&#31574;&#30053;&#65292;&#24182;&#20391;&#37325;&#20110;&#21152;&#23494;&#36135;&#24065;&#30340;&#24773;&#20917;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#38024;&#23545;&#32447;&#24615;&#26242;&#26102;&#24433;&#21709;&#12289;&#32447;&#24615;&#21644;&#20108;&#27425;&#27704;&#20037;&#24433;&#21709;&#38382;&#39064;&#30340;&#35299;&#26512;&#35299;&#12290;&#28982;&#21518;&#65292;&#21033;&#29992;BNB&#21152;&#23494;&#36135;&#24065;&#35746;&#21333;&#31807;&#20013;&#30340;&#25968;&#25454;&#65292;&#25105;&#20204;&#20272;&#35745;&#20102;&#19977;&#31181;&#19981;&#21516;&#24773;&#26223;&#19979;&#30340;&#26242;&#26102;&#21644;&#27704;&#20037;&#20215;&#26684;&#24433;&#21709;&#30340;&#20989;&#25968;&#24418;&#24335;&#65306;&#20302;&#20272;&#12289;&#39640;&#20272;&#21644;&#24179;&#22343;&#20272;&#35745;&#65292;&#21457;&#29616;&#27599;&#20010;&#24773;&#26223;&#19979;&#26377;&#19981;&#21516;&#30340;&#20989;&#25968;&#24418;&#24335;&#12290;&#21033;&#29992;&#26377;&#38480;&#24046;&#20998;&#21644;&#26368;&#20248;&#31574;&#30053;&#36845;&#20195;&#65292;&#25105;&#20204;&#36890;&#36807;&#26657;&#20934;&#26242;&#26102;&#21644;&#27704;&#20037;&#20215;&#26684;&#24433;&#21709;&#30340;&#32447;&#24615;&#21644;&#24130;&#20989;&#25968;&#65292;&#25968;&#20540;&#27714;&#35299;&#20102;&#38382;&#39064;&#24182;&#35266;&#23519;&#21040;&#20102;&#26368;&#20248;&#28165;&#31639;&#31574;&#30053;&#30340;&#26377;&#36259;&#21464;&#21270;&#12290;&#28982;&#21518;&#65292;&#21033;&#29992;&#36825;&#20123;&#26368;&#20248;&#31574;&#30053;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#26368;&#20339;&#28165;&#31639;&#36335;&#24452;&#65292;&#24182;&#27169;&#25311;&#20102;&#21021;&#22987;&#28165;&#31639;&#24211;&#23384;&#30340;&#28165;&#31639;&#65292;&#20197;&#27604;&#36739;&#26368;&#20248;&#31574;&#30053;&#21644;&#19968;&#20123;&#22522;&#20934;&#31574;&#30053;&#30340;&#34920;&#29616;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#24573;&#30053;&#27704;&#20037;&#20215;&#26684;&#24433;&#21709;&#20250;&#23548;&#33268;&#27425;&#20248;&#30340;&#28165;&#31639;&#31574;&#30053;&#65292;&#24182;&#19988;&#32771;&#34385;&#20215;&#26684;&#24433;&#21709;&#30340;&#38750;&#32447;&#24615;&#20989;&#25968;&#24418;&#24335;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#28165;&#31639;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies the optimal liquidation of stocks in the presence of temporary and permanent price impacts, and we focus in the case of cryptocurrencies. We start by presenting analytical solutions to the problem with linear temporary impact, and linear and quadratic permanent impact. Then, using data from the order book of the BNB cryptocurrency, we estimate the functional form of the temporary and permanent price impact in three different scenarios: underestimation, overestimation and average estimation, finding different functional forms for each scenario. Using finite differences and optimal policy iteration, we solve the problem numerically and observe interesting changes in the optimal liquidation policy when applying calibrated linear and power forms for the temporary and permanent price impacts. Then, with these optimal policies, we identify optimal liquidation trajectories and simulate the liquidation of initial inventories to compare the performance among the optimal strat
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;&#22810;&#20803;&#27010;&#29575;CRPS&#23398;&#20064;&#26041;&#27861;&#65292;&#24212;&#29992;&#20110;&#26085;&#21069;&#30005;&#20215;&#39044;&#27979;&#20013;&#65292;&#30456;&#27604;&#20110;&#32479;&#19968;&#32452;&#21512;&#22312;CRPS&#26041;&#38754;&#21462;&#24471;&#20102;&#26174;&#33879;&#25913;&#36827;&#12290;</title><link>http://arxiv.org/abs/2303.10019</link><description>&lt;p&gt;
&#22810;&#20803;&#27010;&#29575;CRPS&#23398;&#20064;&#21450;&#20854;&#22312;&#26085;&#21069;&#30005;&#20215;&#39044;&#27979;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Multivariate Probabilistic CRPS Learning with an Application to Day-Ahead Electricity Prices. (arXiv:2303.10019v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10019
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;&#22810;&#20803;&#27010;&#29575;CRPS&#23398;&#20064;&#26041;&#27861;&#65292;&#24212;&#29992;&#20110;&#26085;&#21069;&#30005;&#20215;&#39044;&#27979;&#20013;&#65292;&#30456;&#27604;&#20110;&#32479;&#19968;&#32452;&#21512;&#22312;CRPS&#26041;&#38754;&#21462;&#24471;&#20102;&#26174;&#33879;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#32771;&#34385;&#20998;&#20301;&#25968;&#21644;&#21327;&#21464;&#37327;&#20381;&#36182;&#20851;&#31995;&#30340;&#22810;&#20803;&#27010;&#29575;&#39044;&#27979;&#30340;&#32467;&#21512;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#24179;&#28369;&#36807;&#31243;&#20801;&#35768;&#22312;&#32447;&#23398;&#20064;&#12290;&#36890;&#36807;&#32500;&#25968;&#38477;&#20302;&#21644;&#32602;&#20989;&#25968;&#24179;&#28369;&#31561;&#20004;&#31181;&#24179;&#28369;&#26041;&#27861;&#26469;&#23558;&#26631;&#20934;CRPS&#23398;&#20064;&#26694;&#26550;&#25512;&#24191;&#21040;&#22810;&#20803;&#32500;&#24230;&#20013;&#12290;&#23558;&#35813;&#26041;&#27861;&#24212;&#29992;&#20110;&#39044;&#27979;&#26085;&#21069;&#30005;&#20215;&#65292;&#30456;&#27604;&#20110;&#32479;&#19968;&#32452;&#21512;&#65292;&#22312;CRPS&#26041;&#38754;&#21462;&#24471;&#20102;&#26174;&#33879;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a new method for combining (or aggregating or ensembling) multivariate probabilistic forecasts, taking into account dependencies between quantiles and covariates through a smoothing procedure that allows for online learning. Two smoothing methods are discussed: dimensionality reduction using Basis matrices and penalized smoothing. The new online learning algorithm generalizes the standard CRPS learning framework into multivariate dimensions. It is based on Bernstein Online Aggregation (BOA) and yields optimal asymptotic learning properties. We provide an in-depth discussion on possible extensions of the algorithm and several nested cases related to the existing literature on online forecast combination. The methodology is applied to forecasting day-ahead electricity prices, which are 24-dimensional distributional forecasts. The proposed method yields significant improvements over uniform combination in terms of continuous ranked probability score (CRPS). We discuss 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#20998;&#37197;&#32422;&#26463;&#21644;&#38543;&#26426;&#22240;&#23376;&#24066;&#22330;&#21160;&#24577;&#30340;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#65292;&#25552;&#20379;&#20102;&#19968;&#31181;&#26465;&#20214;&#26469;&#20445;&#35777;HJB PDE&#30340;&#35299;&#26159;&#25351;&#25968;&#20223;&#23556;&#21644;&#21487;&#20998;&#31163;&#30340;&#65292;&#24182;&#25512;&#23548;&#20102;&#22312;&#20855;&#26377;CIR&#27874;&#21160;&#29575;&#21644;&#22810;&#22240;&#23376;OU&#30701;&#26399;&#21033;&#29575;&#30340;&#24066;&#22330;&#20013;&#25910;&#30410;&#29575;&#30340;&#26174;&#24335;&#34920;&#36798;&#24335;&#12290;</title><link>http://arxiv.org/abs/2303.09835</link><description>&lt;p&gt;
&#20855;&#26377;&#20998;&#37197;&#32422;&#26463;&#21644;&#38543;&#26426;&#22240;&#23376;&#24066;&#22330;&#21160;&#24577;&#30340;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
Portfolio Optimization with Allocation Constraints and Stochastic Factor Market Dynamics. (arXiv:2303.09835v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09835
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#20998;&#37197;&#32422;&#26463;&#21644;&#38543;&#26426;&#22240;&#23376;&#24066;&#22330;&#21160;&#24577;&#30340;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#65292;&#25552;&#20379;&#20102;&#19968;&#31181;&#26465;&#20214;&#26469;&#20445;&#35777;HJB PDE&#30340;&#35299;&#26159;&#25351;&#25968;&#20223;&#23556;&#21644;&#21487;&#20998;&#31163;&#30340;&#65292;&#24182;&#25512;&#23548;&#20102;&#22312;&#20855;&#26377;CIR&#27874;&#21160;&#29575;&#21644;&#22810;&#22240;&#23376;OU&#30701;&#26399;&#21033;&#29575;&#30340;&#24066;&#22330;&#20013;&#25910;&#30410;&#29575;&#30340;&#26174;&#24335;&#34920;&#36798;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#19981;&#23436;&#20840;&#30340;&#37329;&#34701;&#24066;&#22330;&#20013;&#30740;&#31350;&#20102;&#39044;&#26399;&#23454;&#29992;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#65292;&#20854;&#20013;&#39118;&#38505;&#36164;&#20135;&#21160;&#24577;&#21462;&#20915;&#20110;&#38543;&#26426;&#22240;&#32032;&#65292;&#25237;&#36164;&#32452;&#21512;&#20998;&#37197;&#21463;&#38480;&#20110;&#32473;&#23450;&#30340;&#20984;&#38598;&#12290;&#25105;&#20204;&#21033;&#29992;&#23454;&#25968;&#32422;&#26463;&#20248;&#21270;&#30340;&#22522;&#26412;&#23545;&#20598;&#32467;&#26524;&#27491;&#24335;&#25512;&#23548;&#20102;&#30456;&#20851;HJB PDE&#30340;&#23545;&#20598;&#34920;&#31034;&#12290;&#21033;&#29992;&#36825;&#31181;&#34920;&#31034;&#26041;&#27861;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#26465;&#20214;&#65292;&#35813;&#26465;&#20214;&#30830;&#20445;HJB PDE&#30340;&#35299;&#26159;&#25351;&#25968;&#20223;&#23556;&#21644;&#21487;&#20998;&#31163;&#30340;&#65292;&#35813;&#26465;&#20214;&#29992;&#20110;&#22312;&#20855;&#26377;CIR&#27874;&#21160;&#29575;&#21644;&#20855;&#26377;&#22810;&#22240;&#23376;OU&#30701;&#26399;&#21033;&#29575;&#30340;&#24066;&#22330;&#20013;&#23548;&#20986;&#25910;&#30410;&#29575;&#30340;&#26174;&#24335;&#34920;&#36798;&#24335;&#65292;&#20197;&#21450;&#19968;&#20010;&#30830;&#23450;&#24615;&#24494;&#23567;&#21270;&#32773;&#21644;Riccati ODE&#31995;&#32479;&#30340;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the expected utility portfolio optimization problem in an incomplete financial market where the risky asset dynamics depend on stochastic factors and the portfolio allocation is constrained to lie within a given convex set. We employ fundamental duality results from real constrained optimization to formally derive a dual representation of the associated HJB PDE. Using this representation, we provide a condition on the market dynamics and the allocation constraints, which ensures that the solution to the HJB PDE is exponentially affine and separable. This condition is used to derive an explicit expression for the optimal allocation-constrained portfolio up to a deterministic minimizer and the solution to a system of Riccati ODEs in a market with CIR volatility and in a market with multi-factor OU short rate.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#21171;&#21160;&#21147;&#36801;&#31227;&#27169;&#22411;&#65292;&#36890;&#36807;&#27169;&#25311;&#21457;&#29616;&#27169;&#22411;&#21487;&#20197;&#20135;&#29983;&#32858;&#38598;&#34892;&#20026;&#65292;&#24182;&#23637;&#29616;&#20102;&#20004;&#20010;&#32463;&#39564;&#35268;&#24459;&#12290;&#26356;&#36827;&#19968;&#27493;&#65292;&#30740;&#31350;&#35777;&#26126;&#20102;&#32463;&#27982;&#24615;&#36235;&#21521;&#24615;&#65292;&#36825;&#26159;&#19968;&#31181;&#26032;&#22411;&#20154;&#31867;&#34892;&#20026;&#20013;&#24515;&#30340;&#36235;&#21521;&#24615;&#65292;&#21487;&#20197;&#35299;&#37322;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#30340;&#21171;&#21160;&#21147;&#32858;&#38598;&#29616;&#35937;&#65292;&#36825;&#19968;&#32467;&#35770;&#31361;&#26174;&#20102;&#22478;&#24066;&#21270;&#19982;&#25152;&#23548;&#20986;&#30340;PDE&#31995;&#32479;&#20013;&#30340;&#21561;&#36215;&#29616;&#35937;&#30340;&#30456;&#20851;&#24615;&#12290;</title><link>http://arxiv.org/abs/2303.09720</link><description>&lt;p&gt;
&#21171;&#21160;&#21147;&#36801;&#31227;&#27169;&#25311;&#20013;&#30340;&#32463;&#27982;&#24615;&#36235;&#21521;&#24615;
&lt;/p&gt;
&lt;p&gt;
Econotaxis in modeling urbanization by labor force migration. (arXiv:2303.09720v1 [nlin.AO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09720
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#21171;&#21160;&#21147;&#36801;&#31227;&#27169;&#22411;&#65292;&#36890;&#36807;&#27169;&#25311;&#21457;&#29616;&#27169;&#22411;&#21487;&#20197;&#20135;&#29983;&#32858;&#38598;&#34892;&#20026;&#65292;&#24182;&#23637;&#29616;&#20102;&#20004;&#20010;&#32463;&#39564;&#35268;&#24459;&#12290;&#26356;&#36827;&#19968;&#27493;&#65292;&#30740;&#31350;&#35777;&#26126;&#20102;&#32463;&#27982;&#24615;&#36235;&#21521;&#24615;&#65292;&#36825;&#26159;&#19968;&#31181;&#26032;&#22411;&#20154;&#31867;&#34892;&#20026;&#20013;&#24515;&#30340;&#36235;&#21521;&#24615;&#65292;&#21487;&#20197;&#35299;&#37322;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#30340;&#21171;&#21160;&#21147;&#32858;&#38598;&#29616;&#35937;&#65292;&#36825;&#19968;&#32467;&#35770;&#31361;&#26174;&#20102;&#22478;&#24066;&#21270;&#19982;&#25152;&#23548;&#20986;&#30340;PDE&#31995;&#32479;&#20013;&#30340;&#21561;&#36215;&#29616;&#35937;&#30340;&#30456;&#20851;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#37319;&#29992;&#20027;&#21160;&#24067;&#26391;&#31890;&#23376;&#26694;&#26550;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#21171;&#21160;&#21147;&#36801;&#31227;&#24494;&#35266;&#27169;&#22411;&#12290;&#36890;&#36807;&#22522;&#20110;&#20195;&#29702;&#30340;&#27169;&#25311;&#65292;&#25105;&#20204;&#21457;&#29616;&#25105;&#20204;&#30340;&#27169;&#22411;&#20135;&#29983;&#20102;&#20174;&#38543;&#26426;&#21021;&#22987;&#20998;&#24067;&#20013;&#32858;&#38598;&#21040;&#19968;&#36215;&#30340;&#19968;&#32676;&#20195;&#29702;&#12290;&#27492;&#22806;&#65292;&#22312;&#25105;&#20204;&#30340;&#27169;&#22411;&#20013;&#35266;&#23519;&#21040;&#20102;Zipf&#21644;Okun&#23450;&#24459;&#36825;&#20004;&#20010;&#32463;&#39564;&#35268;&#24459;&#12290;&#20026;&#20102;&#25581;&#31034;&#20135;&#29983;&#30340;&#32858;&#38598;&#29616;&#35937;&#32972;&#21518;&#30340;&#26426;&#21046;&#65292;&#25105;&#20204;&#20174;&#25105;&#20204;&#30340;&#24494;&#35266;&#27169;&#22411;&#20013;&#23548;&#20986;&#20102;&#19968;&#20010;&#25193;&#23637;&#30340;Keller-Segel&#31995;&#32479;&#12290;&#24471;&#21040;&#30340;&#23439;&#35266;&#31995;&#32479;&#34920;&#26126;&#20154;&#21147;&#36164;&#28304;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#30340;&#32858;&#38598;&#21487;&#20197;&#36890;&#36807;&#19968;&#31181;&#26032;&#22411;&#20154;&#31867;&#34892;&#20026;&#20013;&#24515;&#30340;&#36235;&#21521;&#24615;&#26469;&#35299;&#37322;&#65292;&#36825;&#31361;&#26174;&#20102;&#22478;&#24066;&#21270;&#19982;&#25152;&#23548;&#20986;&#30340;PDE&#31995;&#32479;&#20013;&#30340;&#21561;&#36215;&#29616;&#35937;&#30340;&#30456;&#20851;&#24615;&#12290;&#25105;&#20204;&#23558;&#20854;&#31216;&#20026;&#8220;&#32463;&#27982;&#24615;&#36235;&#21521;&#24615;&#8221;&#12290;
&lt;/p&gt;
&lt;p&gt;
Individual participants in human society collectively exhibit aggregation behavior. In this study, we present a simple microscopic model of labor force migration by employing the active Brownian particles framework. Through agent-based simulations, we find that our model produces clusters of agents from a random initial distribution. Furthermore, two empirical regularities called Zipf's and Okun's laws were observed in our model. To reveal the mechanism underlying the reproduced agglomeration phenomena, we derived an extended Keller-Segel system, a classic model that describes the aggregation behavior of biological organisms called "taxis," from our microscopic model. The obtained macroscopic system indicates that the agglomeration of the workforce in real world can be accounted for through a new type of taxis central to human behavior, which highlights the relevance of urbanization to blow-up phenomena in the derived PDE system. We term it "econotaxis."
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#37329;&#34701;&#39118;&#38505;&#20998;&#26512;&#30340;&#37327;&#23376;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#26041;&#27861;&#65292;&#20854;&#20013;&#23558;&#24773;&#26223;&#29983;&#25104;&#32435;&#20837;&#21040;&#37327;&#23376;&#35745;&#31639;&#20013;&#65292;&#27169;&#25311;&#20102;&#39118;&#38505;&#22240;&#32032;&#38543;&#26102;&#38388;&#30340;&#28436;&#21464;&#65292;&#24182;&#23558;&#20854;&#39304;&#36865;&#21040;QMC&#27169;&#25311;&#20013;&#65292;&#23454;&#29616;&#20272;&#31639;&#37329;&#34701;&#36164;&#20135;&#32452;&#21512;&#30340;&#39118;&#38505;&#20215;&#20540;&#65292;&#30456;&#36739;&#20110;&#20256;&#32479;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#25552;&#20379;&#20102;&#39640;&#36798;800&#20493;&#30340;&#36895;&#24230;&#25552;&#21319;&#12290;</title><link>http://arxiv.org/abs/2303.09682</link><description>&lt;p&gt;
&#37327;&#23376;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#22312;&#37329;&#34701;&#39118;&#38505;&#20998;&#26512;&#20013;&#30340;&#24212;&#29992;&#65306;&#32929;&#26435;&#12289;&#21033;&#29575;&#21644;&#20449;&#29992;&#39118;&#38505;&#22240;&#32032;&#30340;&#24773;&#26223;&#29983;&#25104;
&lt;/p&gt;
&lt;p&gt;
Quantum Monte Carlo simulations for financial risk analytics: scenario generation for equity, rate, and credit risk factors. (arXiv:2303.09682v1 [quant-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09682
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#37329;&#34701;&#39118;&#38505;&#20998;&#26512;&#30340;&#37327;&#23376;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#26041;&#27861;&#65292;&#20854;&#20013;&#23558;&#24773;&#26223;&#29983;&#25104;&#32435;&#20837;&#21040;&#37327;&#23376;&#35745;&#31639;&#20013;&#65292;&#27169;&#25311;&#20102;&#39118;&#38505;&#22240;&#32032;&#38543;&#26102;&#38388;&#30340;&#28436;&#21464;&#65292;&#24182;&#23558;&#20854;&#39304;&#36865;&#21040;QMC&#27169;&#25311;&#20013;&#65292;&#23454;&#29616;&#20272;&#31639;&#37329;&#34701;&#36164;&#20135;&#32452;&#21512;&#30340;&#39118;&#38505;&#20215;&#20540;&#65292;&#30456;&#36739;&#20110;&#20256;&#32479;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#25552;&#20379;&#20102;&#39640;&#36798;800&#20493;&#30340;&#36895;&#24230;&#25552;&#21319;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#22312;&#37329;&#34701;&#39118;&#38505;&#31649;&#29702;&#20013;&#34987;&#24191;&#27867;&#20351;&#29992;&#65292;&#20363;&#22914;&#20272;&#31639;&#39118;&#38505;&#20215;&#20540;&#21644;&#23450;&#20215;&#22330;&#22806;&#34893;&#29983;&#21697;&#12290;&#22240;&#20026;&#38656;&#35201;&#22823;&#37327;&#30340;&#24773;&#26223;&#20197;&#23454;&#29616;&#25910;&#25947;&#65292;&#25152;&#20197;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#38656;&#35201;&#39640;&#26114;&#30340;&#35745;&#31639;&#25104;&#26412;&#12290;&#37327;&#23376;&#33945;&#29305;&#21345;&#32599;&#31639;&#27861;&#26159;&#19968;&#31181;&#26377;&#24076;&#26395;&#30340;&#26367;&#20195;&#26041;&#26696;&#65306;&#23427;&#20204;&#25552;&#20379;&#27604;&#20256;&#32479;&#31639;&#27861;&#26356;&#24555;&#30340;&#36895;&#24230;&#12290;&#26368;&#36817;&#30340;&#30740;&#31350;&#24050;&#32463;&#25506;&#32034;&#20102;&#24120;&#35265;&#39118;&#38505;&#27979;&#24230;&#30340;&#35745;&#31639;&#20197;&#21450;&#36890;&#36807;&#23558;&#36755;&#20837;&#37327;&#23376;&#29366;&#24577;&#21021;&#22987;&#21270;&#20026;&#39044;&#20808;&#35745;&#31639;&#30340;&#27010;&#29575;&#20998;&#24067;&#26469;&#20248;&#21270;QMC&#31639;&#27861;&#12290;&#26412;&#25991;&#30528;&#37325;&#20110;&#23558;&#24773;&#26223;&#29983;&#25104;&#32435;&#20837;&#21040;&#37327;&#23376;&#35745;&#31639;&#20013;&#65292;&#36890;&#36807;&#27169;&#25311;&#39118;&#38505;&#22240;&#32032;&#38543;&#26102;&#38388;&#30340;&#28436;&#21464;&#36827;&#34892;&#39118;&#38505;&#24773;&#26223;&#29983;&#25104;&#30340;&#37327;&#23376;&#30005;&#36335;&#32452;&#35013;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#32452;&#35013;&#20102;&#32929;&#26435;&#65288;&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;&#65289;&#12289;&#21033;&#29575;&#65288;&#22343;&#20540;&#22238;&#24402;&#27169;&#22411;&#65289;&#21644;&#20449;&#29992;&#65288;&#32467;&#26500;&#24615;&#21644;&#32553;&#20943;&#24418;&#24335;&#20449;&#29992;&#27169;&#22411;&#65289;&#39118;&#38505;&#22240;&#32032;&#30340;&#38543;&#26426;&#27169;&#22411;&#30340;&#37327;&#23376;&#30005;&#36335;&#12290;&#28982;&#21518;&#23558;&#36825;&#20123;&#24773;&#26223;&#39304;&#36865;&#21040;QMC&#27169;&#25311;&#20013;&#65292;&#20197;&#20272;&#31639;&#37329;&#34701;&#36164;&#20135;&#32452;&#21512;&#30340;&#39118;&#38505;&#20215;&#20540;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#19982;&#20256;&#32479;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#30456;&#27604;&#65292;&#37327;&#23376;&#33945;&#29305;&#21345;&#32599;&#25552;&#20379;&#20102;&#19968;&#31181;&#20934;&#30830;&#19988;&#39640;&#25928;&#30340;&#20272;&#31639;&#39118;&#38505;&#20215;&#20540;&#30340;&#26041;&#27861;&#65292;&#36895;&#24230;&#25552;&#21319;&#39640;&#36798;800&#20493;&#12290;
&lt;/p&gt;
&lt;p&gt;
Monte Carlo (MC) simulations are widely used in financial risk management, from estimating value-at-risk (VaR) to pricing over-the-counter derivatives. However, they come at a significant computational cost due to the number of scenarios required for convergence. Quantum MC (QMC) algorithms are a promising alternative: they provide a quadratic speed-up as compared to their classical counterparts. Recent studies have explored the calculation of common risk measures and the optimisation of QMC algorithms by initialising the input quantum states with pre-computed probability distributions. In this paper, we focus on incorporating scenario generation into the quantum computation by simulating the evolution of risk factors over time. Specifically, we assemble quantum circuits that implement stochastic models for equity (geometric Brownian motion), interest rate (mean-reversion models), and credit (structural and reduced-form credit models) risk factors. We then feed these scenarios to QMC s
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#21457;&#29616;&#65292;&#36873;&#20030;&#21046;&#24230;&#20013;&#30340;&#27604;&#20363;&#20195;&#34920;&#26041;&#27861;&#21487;&#20197;&#26367;&#20195;&#32929;&#31080;&#20132;&#26131;&#25152;&#20013;&#30340;&#25353;&#27604;&#20363;&#20998;&#37197;&#39034;&#24207;&#30340;&#21305;&#37197;&#31639;&#27861;&#65292;&#25552;&#20379;&#26356;&#25509;&#36817;&#27604;&#20363;&#20998;&#37197;&#30340;&#35746;&#21333;&#20998;&#37197;&#12290;</title><link>http://arxiv.org/abs/2303.09652</link><description>&lt;p&gt;
&#20351;&#29992;&#27604;&#20363;&#20195;&#34920;&#21046;&#26041;&#27861;&#26367;&#20195;&#32929;&#31080;&#20132;&#26131;&#25152;&#20013;&#22522;&#20110;&#27604;&#20363;&#20998;&#37197;&#39034;&#24207;&#30340;&#21305;&#37197;&#31639;&#27861;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On Using Proportional Representation Methods as Alternatives to Pro-Rata Based Order Matching Algorithms in Stock Exchanges. (arXiv:2303.09652v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09652
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21457;&#29616;&#65292;&#36873;&#20030;&#21046;&#24230;&#20013;&#30340;&#27604;&#20363;&#20195;&#34920;&#26041;&#27861;&#21487;&#20197;&#26367;&#20195;&#32929;&#31080;&#20132;&#26131;&#25152;&#20013;&#30340;&#25353;&#27604;&#20363;&#20998;&#37197;&#39034;&#24207;&#30340;&#21305;&#37197;&#31639;&#27861;&#65292;&#25552;&#20379;&#26356;&#25509;&#36817;&#27604;&#20363;&#20998;&#37197;&#30340;&#35746;&#21333;&#20998;&#37197;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30701;&#25991;&#30340;&#20027;&#35201;&#35266;&#23519;&#26159;&#65292;&#29992;&#20110;&#30830;&#23450;&#36873;&#20030;&#21046;&#24230;&#20013;&#27604;&#20363;&#20195;&#34920;&#30340;&#26041;&#27861;&#21487;&#20197;&#20316;&#20026;&#26367;&#20195;&#32929;&#31080;&#20132;&#26131;&#25152;&#20013;&#20351;&#29992;&#30340;&#25353;&#27604;&#20363;&#20998;&#37197;&#35746;&#21333;&#30340;&#21305;&#37197;&#31639;&#27861;&#30340;&#36873;&#25321;&#12290;&#25105;&#20204;&#30340;&#27169;&#25311;&#30740;&#31350;&#24378;&#26377;&#21147;&#22320;&#35777;&#26126;&#65292;&#26480;&#26000;&#36874;/&#24503;&#27721;&#29305;&#21644;&#38886;&#20271;&#26031;&#29305;/&#22307;&#25289;&#26684;&#27604;&#20363;&#20195;&#34920;&#26041;&#27861;&#25552;&#20379;&#30340;&#35746;&#21333;&#20998;&#37197;&#27604;&#25353;&#27604;&#20363;&#20998;&#37197;&#31639;&#27861;&#33719;&#24471;&#30340;&#35746;&#21333;&#20998;&#37197;&#26356;&#25509;&#36817;&#27604;&#20363;&#20998;&#37197;&#12290;
&lt;/p&gt;
&lt;p&gt;
The main observation of this short note is that methods for determining proportional representation in electoral systems may be suitable as alternatives to the pro-rata order matching algorithm used in stock exchanges. Our simulation studies provide strong evidence that the Jefferson/D'Hondt and the Webster/Saint-Lagu\"{e} proportional representation methods provide order allocations which are closer to proportionality than the order allocations obtained from the pro-rata algorithm.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20998;&#26512;&#20102;&#22238;&#25253;&#39118;&#38505;&#24230;&#37327;&#30340;&#21487;&#24341;&#23548;&#24615;&#23646;&#24615;&#65292;&#24182;&#35777;&#26126;&#20102; Orlicz premia &#26159;&#21807;&#19968;&#21487;&#24341;&#23548;&#30340;&#22238;&#25253;&#39118;&#38505;&#24230;&#37327;&#12290;</title><link>http://arxiv.org/abs/2302.13070</link><description>&lt;p&gt;
&#22238;&#25253;&#39118;&#38505;&#24230;&#37327;&#30340;&#21487;&#24341;&#23548;&#24615;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Elicitability of Return Risk Measures. (arXiv:2302.13070v2 [q-fin.RM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13070
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;&#22238;&#25253;&#39118;&#38505;&#24230;&#37327;&#30340;&#21487;&#24341;&#23548;&#24615;&#23646;&#24615;&#65292;&#24182;&#35777;&#26126;&#20102; Orlicz premia &#26159;&#21807;&#19968;&#21487;&#24341;&#23548;&#30340;&#22238;&#25253;&#39118;&#38505;&#24230;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39118;&#38505;&#24230;&#37327;&#22914;&#26524;&#23384;&#22312;&#19968;&#20010;&#21512;&#36866;&#30340;&#24471;&#20998;&#20989;&#25968;&#65292;&#20351;&#24471;&#26368;&#23567;&#21270;&#20854;&#26399;&#26395;&#20540;&#21487;&#20197;&#24674;&#22797;&#39118;&#38505;&#24230;&#37327;&#65292;&#21017; informally &#22320;&#65292;&#35813;&#39118;&#38505;&#24230;&#37327;&#21487;&#24341;&#23548;&#12290;&#26412;&#25991;&#20998;&#26512;&#20102;&#22238;&#25253;&#39118;&#38505;&#24230;&#37327;&#65288;&#21363;&#65292;&#26631;&#20934;&#21270;&#12289;&#21333;&#35843;&#21644;&#27491;&#40784;&#27425;&#39118;&#38505;&#24230;&#37327;&#65289;&#30340;&#21487;&#24341;&#23548;&#24615;&#23646;&#24615;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#20026;&#20984;&#22238;&#25253;&#39118;&#38505;&#24230;&#37327;&#21644;&#20960;&#20309;&#20984;&#22238;&#25253;&#39118;&#38505;&#24230;&#37327;&#25552;&#20379;&#20102;&#21452;&#37325;&#34920;&#31034;&#32467;&#26524;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102; Orlicz premia&#65288;&#21363; Luxemburg norms&#65289;&#30340;&#26032;&#20844;&#35774;&#29305;&#24449;&#12290;&#26356;&#20855;&#20307;&#22320;&#65292;&#22312;&#19981;&#21516;&#30340;&#26465;&#20214;&#19979;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102; Orlicz premia &#33258;&#28982;&#22320;&#25104;&#20026;&#21807;&#19968;&#21487;&#24341;&#23548;&#30340;&#22238;&#25253;&#39118;&#38505;&#24230;&#37327;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#20026; Orlicz premia &#25552;&#20379;&#20102;&#19968;&#20010;&#19968;&#33324;&#30340;&#20005;&#26684;&#19968;&#33268;&#30340;&#24471;&#20998;&#20989;&#25968;&#26063;&#65292;&#20197;&#21450;&#36866;&#29992;&#20110;&#26500;&#36896; Murphy &#22270;&#30340;&#21508;&#31181;&#20855;&#20307;&#31034;&#20363;&#21644;&#28151;&#21512;&#34920;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;
Informally, a risk measure is said to be elicitable if there exists a suitable scoring function such that minimizing its expected value recovers the risk measure. In this paper, we analyze the elicitability properties of the class of return risk measures (i.e., normalized, monotone and positively homogeneous risk measures). First, we provide dual representation results for convex and geometrically convex return risk measures. Next, we establish new axiomatic characterizations of Orlicz premia (i.e., Luxemburg norms). More specifically, we prove, under different sets of conditions, that Orlicz premia naturally arise as the only elicitable return risk measures. Finally, we provide a general family of strictly consistent scoring functions for Orlicz premia, a myriad of specific examples and a mixture representation suitable for constructing Murphy diagrams.
&lt;/p&gt;</description></item></channel></rss>