<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22810;&#26234;&#33021;&#20307;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#24212;&#29992;&#20110;&#24555;&#36895;&#20805;&#30005;&#30005;&#21160;&#36710;&#20013;&#24515;&#30340;&#21160;&#24577;&#23450;&#20215;&#31454;&#20105;&#12290;&#36890;&#36807;&#39044;&#27979;&#24615;&#36141;&#20080;&#30005;&#21147;&#38656;&#27714;&#21644;&#35774;&#23450;&#31454;&#20105;&#24615;&#20215;&#26684;&#31574;&#30053;&#65292;&#20805;&#30005;&#31449;&#21487;&#20197;&#22312;&#31454;&#20105;&#20013;&#36827;&#34892;&#26377;&#25928;&#23450;&#20215;&#12290;</title><link>http://arxiv.org/abs/2401.15108</link><description>&lt;p&gt;
&#22810;&#26234;&#33021;&#20307;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#22312;&#31454;&#20105;&#20013;&#20026;&#24555;&#36895;&#20805;&#30005;&#30005;&#21160;&#36710;&#20013;&#24515;&#30340;&#21160;&#24577;&#23450;&#20215;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Multi-agent Deep Reinforcement Learning for Dynamic Pricing by Fast-charging Electric Vehicle Hubs in ccompetition. (arXiv:2401.15108v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.15108
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22810;&#26234;&#33021;&#20307;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#24212;&#29992;&#20110;&#24555;&#36895;&#20805;&#30005;&#30005;&#21160;&#36710;&#20013;&#24515;&#30340;&#21160;&#24577;&#23450;&#20215;&#31454;&#20105;&#12290;&#36890;&#36807;&#39044;&#27979;&#24615;&#36141;&#20080;&#30005;&#21147;&#38656;&#27714;&#21644;&#35774;&#23450;&#31454;&#20105;&#24615;&#20215;&#26684;&#31574;&#30053;&#65292;&#20805;&#30005;&#31449;&#21487;&#20197;&#22312;&#31454;&#20105;&#20013;&#36827;&#34892;&#26377;&#25928;&#23450;&#20215;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24555;&#36895;&#20805;&#30005;&#31449;&#23558;&#25104;&#20026;&#20840;&#29699;&#26032;&#24314;&#20132;&#36890;&#30005;&#27668;&#21270;&#22522;&#30784;&#35774;&#26045;&#30340;&#19968;&#37096;&#20998;&#12290;&#36825;&#20123;&#20805;&#30005;&#31449;&#23558;&#25215;&#36733;&#35768;&#22810;&#30452;&#27969;&#24555;&#36895;&#20805;&#30005;&#35774;&#22791;&#65292;&#20165;&#21487;&#20379;&#30005;&#21160;&#36710;&#36742;&#20805;&#30005;&#20351;&#29992;&#12290;&#31867;&#20284;&#20110;&#27773;&#27833;&#21152;&#27833;&#31449;&#65292;&#21516;&#19968;&#22320;&#21306;&#30340;&#24555;&#36895;&#20805;&#30005;&#31449;&#23558;&#26681;&#25454;&#31454;&#20105;&#35843;&#25972;&#20215;&#26684;&#20197;&#21560;&#24341;&#21516;&#19968;&#32676;&#30005;&#21160;&#36710;&#20027;&#12290;&#36825;&#20123;&#20805;&#30005;&#31449;&#23558;&#19982;&#30005;&#21147;&#32593;&#32476;&#36827;&#34892;&#20132;&#20114;&#65292;&#36890;&#36807;&#39044;&#27979;&#24615;&#36141;&#20080;&#22312;&#21069;&#19968;&#22825;&#30005;&#21147;&#24066;&#22330;&#19978;&#30340;&#30005;&#21147;&#38656;&#27714;&#65292;&#24182;&#22312;&#23454;&#26102;&#24066;&#22330;&#19978;&#28385;&#36275;&#24046;&#39069;&#38656;&#27714;&#12290;&#20805;&#30005;&#31449;&#21487;&#33021;&#37197;&#22791;&#34917;&#20805;&#30005;&#27744;&#20648;&#33021;&#31995;&#32479;&#29992;&#20110;&#22871;&#21033;&#12290;&#26412;&#25991;&#38024;&#23545;&#20805;&#30005;&#31449;&#31454;&#20105;&#20013;&#24320;&#21457;&#20102;&#19968;&#20010;&#20004;&#27493;&#25968;&#25454;&#39537;&#21160;&#30340;&#21160;&#24577;&#23450;&#20215;&#26041;&#27861;&#12290;&#39318;&#20808;&#36890;&#36807;&#27714;&#35299;&#38543;&#26426;&#30340;&#21069;&#19968;&#22825;&#30005;&#21147;&#38656;&#27714;&#27169;&#22411;&#24471;&#21040;&#32435;&#20837;&#25215;&#35834;&#65292;&#28982;&#21518;&#36890;&#36807;&#23558;&#28216;&#25103;&#24314;&#27169;&#20026;&#31454;&#20105;&#26469;&#24471;&#21040;&#20805;&#30005;&#31449;&#30340;&#20215;&#26684;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;
Fast-charging hubs for electric vehicles will soon become part of the newly built infrastructure for transportation electrification across the world. These hubs are expected to host many DC fast-charging stations and will admit EVs only for charging. Like the gasoline refueling stations, fast-charging hubs in a neighborhood will dynamically vary their prices to compete for the same pool of EV owners. These hubs will interact with the electric power network by making purchase commitments for a significant part of their power needs in the day-ahead (DA) electricity market and meeting the difference from the real-time (RT) market. Hubs may have supplemental battery storage systems (BSS), which they will use for arbitrage. In this paper, we develop a two-step data-driven dynamic pricing methodology for hubs in price competition. We first obtain the DA commitment by solving a stochastic DA commitment model. Thereafter we obtain the hub pricing strategies by modeling the game as a competitiv
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26102;&#38388;&#21464;&#21270;&#26041;&#27861;&#26469;&#30740;&#31350;&#38544;&#21547;&#27874;&#21160;&#29575;&#24494;&#31505;&#30340;&#24418;&#24577;&#12290;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#24120;&#35265;&#30340;&#21322;&#38808;&#27169;&#22411;&#65292;&#25913;&#36827;&#20102;&#22522;&#20110;&#30697;&#30340;&#20844;&#24335;&#26469;&#36817;&#20284;&#24179;&#20215;&#36873;&#25321;&#26435;&#30340;&#20559;&#26012;&#21644;&#26354;&#29575;&#65292;&#36890;&#36807;&#26126;&#30830;&#35745;&#31639;&#20986;&#36825;&#20123;&#30697;&#65292;&#32771;&#34385;&#20102;&#20960;&#20010;&#27169;&#22411;&#30340;&#26497;&#38480;&#20559;&#26012;&#21644;&#26354;&#29575;&#65292;&#24182;&#36890;&#36807;&#25968;&#20540;&#26041;&#27861;&#21644;&#23454;&#35777;&#25968;&#25454;&#36827;&#34892;&#20102;&#27979;&#35797;&#65292;&#26368;&#21518;&#24212;&#29992;&#20110;&#26657;&#20934;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2401.03776</link><description>&lt;p&gt;
&#20998;&#35299;&#24494;&#31505;&#65306;&#19968;&#31181;&#26102;&#38388;&#21464;&#21270;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Decomposing Smiles: A Time Change Approach. (arXiv:2401.03776v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.03776
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26102;&#38388;&#21464;&#21270;&#26041;&#27861;&#26469;&#30740;&#31350;&#38544;&#21547;&#27874;&#21160;&#29575;&#24494;&#31505;&#30340;&#24418;&#24577;&#12290;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#24120;&#35265;&#30340;&#21322;&#38808;&#27169;&#22411;&#65292;&#25913;&#36827;&#20102;&#22522;&#20110;&#30697;&#30340;&#20844;&#24335;&#26469;&#36817;&#20284;&#24179;&#20215;&#36873;&#25321;&#26435;&#30340;&#20559;&#26012;&#21644;&#26354;&#29575;&#65292;&#36890;&#36807;&#26126;&#30830;&#35745;&#31639;&#20986;&#36825;&#20123;&#30697;&#65292;&#32771;&#34385;&#20102;&#20960;&#20010;&#27169;&#22411;&#30340;&#26497;&#38480;&#20559;&#26012;&#21644;&#26354;&#29575;&#65292;&#24182;&#36890;&#36807;&#25968;&#20540;&#26041;&#27861;&#21644;&#23454;&#35777;&#25968;&#25454;&#36827;&#34892;&#20102;&#27979;&#35797;&#65292;&#26368;&#21518;&#24212;&#29992;&#20110;&#26657;&#20934;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#37319;&#29992;&#19968;&#31181;&#26032;&#39062;&#30340;&#26102;&#38388;&#21464;&#21270;&#26041;&#27861;&#26469;&#30740;&#31350;&#38544;&#21547;&#27874;&#21160;&#29575;&#24494;&#31505;&#30340;&#24418;&#29366;&#12290;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#24120;&#35265;&#30340;&#21322;&#38808;&#27169;&#22411;&#65292;&#21253;&#25324;&#36339;&#36291;&#25193;&#25955;&#27169;&#22411;&#12289;&#31895;&#31961;&#27874;&#21160;&#27169;&#22411;&#21644;&#26080;&#38480;&#27963;&#21160;&#27169;&#22411;&#12290;&#25105;&#20204;&#29992;&#25913;&#36827;&#30340;&#22522;&#20110;&#30697;&#30340;&#20844;&#24335;&#36817;&#20284;&#24179;&#20215;&#36873;&#25321;&#26435;&#30340;&#20559;&#26012;&#21644;&#26354;&#29575;&#12290;&#22312;&#26102;&#38388;&#21464;&#21270;&#26694;&#26550;&#19979;&#26126;&#30830;&#35745;&#31639;&#20986;&#36825;&#20123;&#30697;&#12290;&#23545;&#20110;&#20960;&#20010;&#27169;&#22411;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#26497;&#38480;&#30340;&#20559;&#26012;&#21644;&#26354;&#29575;&#12290;&#25105;&#20204;&#36824;&#36890;&#36807;&#25968;&#20540;&#26041;&#27861;&#21644;&#23454;&#35777;&#25968;&#25454;&#23545;&#30701;&#26399;&#36924;&#36817;&#32467;&#26524;&#30340;&#20934;&#30830;&#24615;&#36827;&#34892;&#20102;&#27979;&#35797;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#35813;&#26041;&#27861;&#24212;&#29992;&#20110;&#26657;&#20934;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a novel time-change approach to study the shape of implied volatility smiles. The method is applicable to common semimartingale models, including jump-diffusion, rough volatility and infinite activity models. We approximate the at-the-money skew and curvature with an improved moment-based formula. The moments are further explicitly computed under a time change framework. The limiting skew and curvature for several models are considered. We also test the accuracy of the short-term approximation results on models via numerical methods and on empirical data. Finally, we apply the method to the calibration problem.
&lt;/p&gt;</description></item></channel></rss>