<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#31471;&#21040;&#31471;&#30340;&#26426;&#22120;&#23398;&#20064;&#26694;&#26550;L2GMOM&#65292;&#23427;&#21487;&#20197;&#21516;&#26102;&#23398;&#20064;&#37329;&#34701;&#32593;&#32476;&#21644;&#20248;&#21270;&#32593;&#32476;&#21160;&#37327;&#31574;&#30053;&#30340;&#20132;&#26131;&#20449;&#21495;&#65292;&#35299;&#20915;&#20102;&#20256;&#32479;&#26041;&#27861;&#20381;&#36182;&#26114;&#36149;&#25968;&#25454;&#24211;&#21644;&#37329;&#34701;&#19987;&#19994;&#30693;&#35782;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20379;&#20102;&#39640;&#24230;&#21487;&#35299;&#37322;&#30340;&#21069;&#21521;&#20256;&#25773;&#26550;&#26500;&#12290;</title><link>http://arxiv.org/abs/2308.12212</link><description>&lt;p&gt;
&#23398;&#20064;&#23398;&#20064;&#37329;&#34701;&#32593;&#32476;&#20197;&#20248;&#21270;&#21160;&#21147;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Learning to Learn Financial Networks for Optimising Momentum Strategies. (arXiv:2308.12212v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.12212
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#31471;&#21040;&#31471;&#30340;&#26426;&#22120;&#23398;&#20064;&#26694;&#26550;L2GMOM&#65292;&#23427;&#21487;&#20197;&#21516;&#26102;&#23398;&#20064;&#37329;&#34701;&#32593;&#32476;&#21644;&#20248;&#21270;&#32593;&#32476;&#21160;&#37327;&#31574;&#30053;&#30340;&#20132;&#26131;&#20449;&#21495;&#65292;&#35299;&#20915;&#20102;&#20256;&#32479;&#26041;&#27861;&#20381;&#36182;&#26114;&#36149;&#25968;&#25454;&#24211;&#21644;&#37329;&#34701;&#19987;&#19994;&#30693;&#35782;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20379;&#20102;&#39640;&#24230;&#21487;&#35299;&#37322;&#30340;&#21069;&#21521;&#20256;&#25773;&#26550;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32593;&#32476;&#21160;&#37327;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#22411;&#30340;&#39118;&#38505;&#28322;&#20215;&#65292;&#23427;&#21033;&#29992;&#37329;&#34701;&#32593;&#32476;&#20013;&#36164;&#20135;&#20043;&#38388;&#30340;&#30456;&#20114;&#20851;&#32852;&#26469;&#39044;&#27979;&#26410;&#26469;&#30340;&#22238;&#25253;&#12290;&#28982;&#32780;&#65292;&#30446;&#21069;&#26500;&#24314;&#37329;&#34701;&#32593;&#32476;&#30340;&#36807;&#31243;&#20381;&#36182;&#20110;&#26114;&#36149;&#30340;&#25968;&#25454;&#24211;&#21644;&#37329;&#34701;&#19987;&#19994;&#30693;&#35782;&#65292;&#38480;&#21046;&#20102;&#23567;&#22411;&#21644;&#23398;&#26415;&#26426;&#26500;&#30340;&#21487;&#35775;&#38382;&#24615;&#12290;&#27492;&#22806;&#65292;&#20256;&#32479;&#26041;&#27861;&#23558;&#32593;&#32476;&#26500;&#24314;&#21644;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#35270;&#20026;&#21333;&#29420;&#30340;&#20219;&#21153;&#65292;&#21487;&#33021;&#20250;&#24433;&#21709;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#30340;&#34920;&#29616;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;L2GMOM&#65292;&#19968;&#20010;&#31471;&#21040;&#31471;&#30340;&#26426;&#22120;&#23398;&#20064;&#26694;&#26550;&#65292;&#21487;&#21516;&#26102;&#23398;&#20064;&#37329;&#34701;&#32593;&#32476;&#21644;&#20248;&#21270;&#32593;&#32476;&#21160;&#37327;&#31574;&#30053;&#30340;&#20132;&#26131;&#20449;&#21495;&#12290;L2GMOM&#27169;&#22411;&#26159;&#19968;&#20010;&#20855;&#26377;&#39640;&#24230;&#21487;&#35299;&#37322;&#21069;&#21521;&#20256;&#25773;&#26550;&#26500;&#30340;&#31070;&#32463;&#32593;&#32476;&#65292;&#23427;&#26159;&#20174;&#31639;&#27861;&#23637;&#24320;&#20013;&#25512;&#23548;&#20986;&#26469;&#30340;&#12290;L2GMOM&#20855;&#26377;&#28789;&#27963;&#24615;&#65292;&#24182;&#21487;&#20197;&#20351;&#29992;&#19981;&#21516;&#30340;&#25237;&#36164;&#32452;&#21512;&#32489;&#25928;&#25439;&#22833;&#20989;&#25968;&#36827;&#34892;&#35757;&#32451;&#65292;&#20363;&#22914;&#36127;&#22799;&#26222;&#27604;&#29575;&#12290;&#22312;&#22238;&#27979;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
Network momentum provides a novel type of risk premium, which exploits the interconnections among assets in a financial network to predict future returns. However, the current process of constructing financial networks relies heavily on expensive databases and financial expertise, limiting accessibility for small-sized and academic institutions. Furthermore, the traditional approach treats network construction and portfolio optimisation as separate tasks, potentially hindering optimal portfolio performance. To address these challenges, we propose L2GMOM, an end-to-end machine learning framework that simultaneously learns financial networks and optimises trading signals for network momentum strategies. The model of L2GMOM is a neural network with a highly interpretable forward propagation architecture, which is derived from algorithm unrolling. The L2GMOM is flexible and can be trained with diverse loss functions for portfolio performance, e.g. the negative Sharpe ratio. Backtesting on 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#32511;&#33394;&#20538;&#21048;&#24066;&#22330;&#30701;&#26399;&#21160;&#24577;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#20351;&#29992;&#33258;&#28608;&#21169;&#36807;&#31243;&#21644;&#36830;&#32493;&#26102;&#38388;&#31227;&#21160;&#24179;&#22343;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#20538;&#21048;&#20215;&#26684;&#30340;&#39640;&#39057;&#21160;&#24577;&#65292;&#24182;&#32771;&#34385;&#20102;&#20215;&#26684;&#19978;&#34892;&#21644;&#19979;&#34892;&#36816;&#21160;&#30340;&#20132;&#21449;&#25928;&#24212;&#12290;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#19982;&#21033;&#29575;&#20844;&#21578;&#30456;&#20851;&#30340;&#26102;&#38388;&#27573;&#20013;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#33021;&#28304;&#24066;&#22330;&#20013;&#30340;&#21457;&#34892;&#20154;&#65292;&#23384;&#22312;&#24046;&#24322;&#12290;</title><link>http://arxiv.org/abs/2308.12179</link><description>&lt;p&gt;
&#30740;&#31350;&#32511;&#33394;&#20538;&#21048;&#24066;&#22330;&#30340;&#30701;&#26399;&#21160;&#24577;
&lt;/p&gt;
&lt;p&gt;
Investigating Short-Term Dynamics in Green Bond Markets. (arXiv:2308.12179v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.12179
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#32511;&#33394;&#20538;&#21048;&#24066;&#22330;&#30701;&#26399;&#21160;&#24577;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#20351;&#29992;&#33258;&#28608;&#21169;&#36807;&#31243;&#21644;&#36830;&#32493;&#26102;&#38388;&#31227;&#21160;&#24179;&#22343;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#20538;&#21048;&#20215;&#26684;&#30340;&#39640;&#39057;&#21160;&#24577;&#65292;&#24182;&#32771;&#34385;&#20102;&#20215;&#26684;&#19978;&#34892;&#21644;&#19979;&#34892;&#36816;&#21160;&#30340;&#20132;&#21449;&#25928;&#24212;&#12290;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#19982;&#21033;&#29575;&#20844;&#21578;&#30456;&#20851;&#30340;&#26102;&#38388;&#27573;&#20013;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#33021;&#28304;&#24066;&#22330;&#20013;&#30340;&#21457;&#34892;&#20154;&#65292;&#23384;&#22312;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20174;&#20132;&#26131;&#27963;&#21160;&#30340;&#35282;&#24230;&#30740;&#31350;&#20102;&#20538;&#21048;&#24066;&#22330;&#20013;"&#32511;&#33394;"&#26631;&#31614;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#35748;&#20026;&#65292;&#25910;&#30410;&#21160;&#24577;&#21464;&#21270;&#20013;&#30340;&#36339;&#36291;&#20855;&#26377;&#29305;&#23450;&#30340;&#35760;&#24518;&#24615;&#36136;&#65292;&#21487;&#20197;&#36890;&#36807;&#33258;&#28608;&#21169;&#36807;&#31243;&#24456;&#22909;&#22320;&#34920;&#31034;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#20351;&#29992;&#38669;&#20811;&#26031;&#36807;&#31243;&#65292;&#24182;&#36890;&#36807;&#36830;&#32493;&#26102;&#38388;&#31227;&#21160;&#24179;&#22343;&#27169;&#22411;&#25551;&#36848;&#24378;&#24230;&#65292;&#30740;&#31350;&#20538;&#21048;&#20215;&#26684;&#30340;&#39640;&#39057;&#21160;&#24577;&#12290;&#25105;&#20204;&#36824;&#24341;&#20837;&#20102;&#27169;&#22411;&#30340;&#21452;&#21464;&#37327;&#25193;&#23637;&#65292;&#22788;&#29702;&#20215;&#26684;&#19978;&#34892;&#21644;&#19979;&#34892;&#36816;&#21160;&#30340;&#20132;&#21449;&#25928;&#24212;&#12290;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;&#22914;&#26524;&#32771;&#34385;&#19982;&#21033;&#29575;&#20844;&#21578;&#30456;&#20851;&#30340;&#26102;&#38388;&#27573;&#65292;&#23588;&#20854;&#26159;&#22312;&#33021;&#28304;&#24066;&#22330;&#20013;&#36816;&#33829;&#30340;&#21457;&#34892;&#20154;&#30340;&#24773;&#20917;&#19979;&#65292;&#24046;&#24322;&#20250;&#20986;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
The paper investigates the effect of the label green in bond markets from the lens of the trading activity. The idea is that jumps in the dynamics of returns have a specific memory nature that can be well represented through a self-exciting process. Specifically, using Hawkes processes where the intensity is described through a continuous time moving average model, we study the high-frequency dynamics of bond prices. We also introduce a bivariate extension of the model that deals with the cross-effect of upward and downward price movements. Empirical results suggest that differences emerge if we consider periods with relevant interest rate announcements, especially in the case of an issuer operating in the energy market.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#23558;&#23458;&#25143;&#38656;&#27714;&#30340;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#19982;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#30456;&#32467;&#21512;&#65292;&#24320;&#21457;&#24182;&#27604;&#36739;&#20102;&#21508;&#31181;&#22238;&#24402;&#21644;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#20197;&#20934;&#30830;&#39044;&#27979;&#38646;&#21806;&#38656;&#27714;&#12290;</title><link>http://arxiv.org/abs/2308.11939</link><description>&lt;p&gt;
&#38646;&#21806;&#38656;&#27714;&#39044;&#27979;&#65306;&#22810;&#20803;&#26102;&#38388;&#24207;&#21015;&#30340;&#27604;&#36739;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Retail Demand Forecasting: A Comparative Study for Multivariate Time Series. (arXiv:2308.11939v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.11939
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#23558;&#23458;&#25143;&#38656;&#27714;&#30340;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#19982;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#30456;&#32467;&#21512;&#65292;&#24320;&#21457;&#24182;&#27604;&#36739;&#20102;&#21508;&#31181;&#22238;&#24402;&#21644;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#20197;&#20934;&#30830;&#39044;&#27979;&#38646;&#21806;&#38656;&#27714;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#38646;&#21806;&#34892;&#19994;&#20013;&#65292;&#20934;&#30830;&#30340;&#38656;&#27714;&#39044;&#27979;&#26159;&#36130;&#21153;&#32489;&#25928;&#21644;&#20379;&#24212;&#38142;&#25928;&#29575;&#30340;&#37325;&#35201;&#20915;&#23450;&#22240;&#32032;&#12290;&#38543;&#30528;&#20840;&#29699;&#24066;&#22330;&#26085;&#30410;&#20114;&#32852;&#20114;&#36890;&#65292;&#20225;&#19994;&#24320;&#22987;&#37319;&#29992;&#20808;&#36827;&#30340;&#39044;&#27979;&#27169;&#22411;&#26469;&#33719;&#21462;&#31454;&#20105;&#20248;&#21183;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#25991;&#29486;&#20027;&#35201;&#20851;&#27880;&#21382;&#21490;&#38144;&#21806;&#25968;&#25454;&#65292;&#24573;&#30053;&#20102;&#23439;&#35266;&#32463;&#27982;&#26465;&#20214;&#23545;&#28040;&#36153;&#32773;&#25903;&#20986;&#34892;&#20026;&#30340;&#37325;&#35201;&#24433;&#21709;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#36890;&#36807;&#23558;&#23458;&#25143;&#38656;&#27714;&#30340;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#19982;&#28040;&#36153;&#32773;&#29289;&#20215;&#25351;&#25968;&#65288;CPI&#65289;&#12289;&#28040;&#36153;&#32773;&#20449;&#24515;&#25351;&#25968;&#65288;ICS&#65289;&#21644;&#22833;&#19994;&#29575;&#31561;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#30456;&#32467;&#21512;&#65292;&#24357;&#34917;&#20102;&#36825;&#19968;&#24046;&#36317;&#12290;&#21033;&#29992;&#36825;&#20010;&#32508;&#21512;&#25968;&#25454;&#38598;&#65292;&#25105;&#20204;&#24320;&#21457;&#24182;&#27604;&#36739;&#20102;&#21508;&#31181;&#22238;&#24402;&#21644;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#20197;&#20934;&#30830;&#39044;&#27979;&#38646;&#21806;&#38656;&#27714;&#12290;
&lt;/p&gt;
&lt;p&gt;
Accurate demand forecasting in the retail industry is a critical determinant of financial performance and supply chain efficiency. As global markets become increasingly interconnected, businesses are turning towards advanced prediction models to gain a competitive edge. However, existing literature mostly focuses on historical sales data and ignores the vital influence of macroeconomic conditions on consumer spending behavior. In this study, we bridge this gap by enriching time series data of customer demand with macroeconomic variables, such as the Consumer Price Index (CPI), Index of Consumer Sentiment (ICS), and unemployment rates. Leveraging this comprehensive dataset, we develop and compare various regression and machine learning models to predict retail demand accurately.
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;The Voice&#30005;&#35270;&#33410;&#30446;&#30340;&#30450;&#36873;&#23454;&#39564;&#65292;&#21457;&#29616;&#38599;&#20323;&#36807;&#31243;&#20013;&#30340;&#24615;&#21035;&#20559;&#35265;&#23548;&#33268;&#20102;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#19981;&#24179;&#31561;&#65292;&#24403;&#36873;&#25163;&#26159;&#24322;&#24615;&#25945;&#32451;&#30340;&#25509;&#21463;&#32773;&#26102;&#65292;&#26377;&#26356;&#22823;&#30340;&#21487;&#33021;&#34987;&#36873;&#20013;&#12290;</title><link>http://arxiv.org/abs/2308.11922</link><description>&lt;p&gt;
&#27495;&#35270;&#21644;&#38480;&#21046;&#65306;&#26469;&#33258;The Voice&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Discrimination and Constraints: Evidence from The Voice. (arXiv:2308.11922v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.11922
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;The Voice&#30005;&#35270;&#33410;&#30446;&#30340;&#30450;&#36873;&#23454;&#39564;&#65292;&#21457;&#29616;&#38599;&#20323;&#36807;&#31243;&#20013;&#30340;&#24615;&#21035;&#20559;&#35265;&#23548;&#33268;&#20102;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#19981;&#24179;&#31561;&#65292;&#24403;&#36873;&#25163;&#26159;&#24322;&#24615;&#25945;&#32451;&#30340;&#25509;&#21463;&#32773;&#26102;&#65292;&#26377;&#26356;&#22823;&#30340;&#21487;&#33021;&#34987;&#36873;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24615;&#21035;&#27495;&#35270;&#22312;&#38599;&#20323;&#36807;&#31243;&#20013;&#26159;&#23548;&#33268;&#21171;&#21160;&#21147;&#24066;&#22330;&#19981;&#24179;&#31561;&#30340;&#19968;&#20010;&#37325;&#35201;&#22240;&#32032;&#12290;&#28982;&#32780;&#65292;&#20851;&#20110;&#38599;&#20323;&#32463;&#29702;&#20154;&#30340;&#24615;&#21035;&#20559;&#35265;&#22312;&#36825;&#20123;&#19981;&#24179;&#31561;&#20013;&#36215;&#21040;&#20102;&#22810;&#22823;&#31243;&#24230;&#30340;&#20316;&#29992;&#65292;&#30446;&#21069;&#36824;&#27809;&#26377;&#22826;&#22810;&#35777;&#25454;&#12290;&#26412;&#25991;&#21033;&#29992;The Voice&#30005;&#35270;&#33410;&#30446;&#30340;&#29420;&#29305;&#25968;&#25454;&#38598;&#65292;&#23558;&#20854;&#20316;&#20026;&#19968;&#20010;&#23454;&#39564;&#65292;&#20197;&#35782;&#21035;&#36873;&#25321;&#36807;&#31243;&#20013;&#33258;&#36523;&#30340;&#24615;&#21035;&#20559;&#35265;&#12290;&#22312;&#31532;&#19968;&#36718;&#30005;&#35270;&#21488;&#38754;&#35797;&#20013;&#65292;&#26377;&#22235;&#20301;&#33879;&#21517;&#24405;&#38899;&#33402;&#26415;&#23478;&#25285;&#20219;&#23548;&#24072;&#65292;&#20182;&#20204;&#20250;&#30450;&#36873;&#65288;&#26885;&#23376;&#32972;&#23545;&#33310;&#21488;&#65289;&#20197;&#36991;&#20813;&#30475;&#21040;&#36873;&#25163;&#12290;&#36890;&#36807;&#24046;&#24322;&#27861;&#20272;&#35745;&#31574;&#30053;&#65292;&#21487;&#20197;&#35777;&#26126;&#25945;&#32451;&#65288;&#38599;&#20323;&#20154;&#65289;&#21644;&#33402;&#26415;&#23478;&#30340;&#24615;&#21035;&#26159;&#22806;&#29983;&#30340;&#65292;&#25105;&#21457;&#29616;&#24403;&#36873;&#25163;&#26159;&#24322;&#24615;&#25945;&#32451;&#30340;&#25509;&#21463;&#32773;&#26102;&#65292;&#20182;&#20204;&#26356;&#26377;4.5&#20010;&#30334;&#20998;&#28857;&#65288;11&#65285;&#65289;&#30340;&#21487;&#33021;&#24615;&#34987;&#36873;&#20013;&#12290;&#25105;&#36824;&#20351;&#29992;Athey&#31561;&#20154;&#65288;2018&#65289;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#21253;&#25324;&#22242;&#38431;&#24615;&#21035;&#32452;&#25104;&#30340;&#24322;&#36136;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Gender discrimination in the hiring process is one significant factor contributing to labor market disparities. However, there is little evidence on the extent to which gender bias by hiring managers is responsible for these disparities. In this paper, I exploit a unique dataset of blind auditions of The Voice television show as an experiment to identify own gender bias in the selection process. The first televised stage audition, in which four noteworthy recording artists are coaches, listens to the contestants blindly (chairs facing away from the stage) to avoid seeing the contestant. Using a difference-in-differences estimation strategy, a coach (hiring person) is demonstrably exogenous with respect to the artist's gender, I find that artists are 4.5 percentage points (11 percent) more likely to be selected when they are the recipients of an opposite-gender coach. I also utilize the machine-learning approach in Athey et al. (2018) to include heterogeneity from team gender compositio
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#19968;&#31181;&#38754;&#23545;&#22810;&#31181;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#30340;&#20877;&#20445;&#38505;&#21830;&#31574;&#30053;&#65292;&#20854;&#36890;&#36807;&#35774;&#35745;&#26368;&#22823;&#21270;&#39044;&#26399;&#36130;&#23500;&#30340;&#20877;&#20445;&#38505;&#21512;&#21516;&#65292;&#24182;&#22312;&#20445;&#38505;&#21830;&#27169;&#22411;&#30340;&#37325;&#24515;&#22833;&#30495;&#19979;&#23450;&#20215;&#65292;&#35299;&#20915;&#20102;&#36830;&#32493;&#26102;&#38388;&#30340;&#39046;&#23548;&#32773;-&#36861;&#38543;&#32773;&#21338;&#24328;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2308.11828</link><description>&lt;p&gt;
&#22810;&#23478;&#20445;&#38505;&#21830;&#30340;&#26368;&#20248;&#40065;&#26834;&#20877;&#20445;&#38505;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Optimal Robust Reinsurance with Multiple Insurers. (arXiv:2308.11828v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.11828
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#19968;&#31181;&#38754;&#23545;&#22810;&#31181;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#30340;&#20877;&#20445;&#38505;&#21830;&#31574;&#30053;&#65292;&#20854;&#36890;&#36807;&#35774;&#35745;&#26368;&#22823;&#21270;&#39044;&#26399;&#36130;&#23500;&#30340;&#20877;&#20445;&#38505;&#21512;&#21516;&#65292;&#24182;&#22312;&#20445;&#38505;&#21830;&#27169;&#22411;&#30340;&#37325;&#24515;&#22833;&#30495;&#19979;&#23450;&#20215;&#65292;&#35299;&#20915;&#20102;&#36830;&#32493;&#26102;&#38388;&#30340;&#39046;&#23548;&#32773;-&#36861;&#38543;&#32773;&#21338;&#24328;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#23478;&#38754;&#20020;&#22810;&#20010;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#30340;&#20877;&#20445;&#38505;&#21830;&#12290;&#20877;&#20445;&#38505;&#21830;&#21521;$n$&#23478;&#20445;&#38505;&#21830;&#25552;&#20379;&#21512;&#21516;&#65292;&#20854;&#32034;&#36180;&#36981;&#24490;&#19981;&#21516;&#30340;&#22797;&#21512;&#27850;&#26494;&#36807;&#31243;&#12290;&#30001;&#20110;&#20877;&#20445;&#38505;&#21830;&#23545;&#20110;&#20445;&#38505;&#21830;&#30340;&#32034;&#36180;&#20005;&#37325;&#31243;&#24230;&#20998;&#24067;&#21644;&#39057;&#29575;&#23384;&#22312;&#19981;&#30830;&#23450;&#24615;&#65292;&#20182;&#20204;&#35774;&#35745;&#20102;&#26368;&#22823;&#21270;&#39044;&#26399;&#36130;&#23500;&#30340;&#20877;&#20445;&#38505;&#21512;&#21516;&#65292;&#21516;&#26102;&#36824;&#38656;&#35201;&#25215;&#25285;&#19968;&#20010;&#29109;&#24809;&#32602;&#12290;&#32780;&#20445;&#38505;&#21830;&#21017;&#23547;&#27714;&#22312;&#26080;&#27495;&#20041;&#30340;&#24773;&#20917;&#19979;&#26368;&#22823;&#21270;&#20182;&#20204;&#30340;&#39044;&#26399;&#25928;&#29992;&#12290;&#25105;&#20204;&#35299;&#20915;&#20102;&#36825;&#20010;&#36830;&#32493;&#26102;&#38388;&#30340;&#39046;&#23548;&#32773;-&#36861;&#38543;&#32773;&#21338;&#24328;&#38382;&#39064;&#65292;&#24471;&#21040;&#20877;&#20445;&#38505;&#21830;&#22312;&#20445;&#38505;&#21830;&#27169;&#22411;&#30340;&#37325;&#24515;&#22833;&#30495;&#19979;&#30340;&#23450;&#20215;&#26041;&#24335;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#32467;&#26524;&#24212;&#29992;&#21040;&#27604;&#20363;&#20877;&#20445;&#38505;&#21644;&#36229;&#39069;&#25439;&#22833;&#20877;&#20445;&#38505;&#21512;&#21516;&#65292;&#24182;&#36827;&#34892;&#20102;&#25968;&#20540;&#35299;&#26512;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#35299;&#20915;&#20102;&#20877;&#20445;&#38505;&#21830;&#22312;&#27169;&#31946;&#24773;&#20917;&#19979;&#26368;&#22823;&#21270;&#20182;&#20204;&#30340;&#39044;&#26399;&#25928;&#29992;&#30340;&#30456;&#20851;&#38382;&#39064;&#65292;&#24182;&#27604;&#36739;&#20102;&#35299;&#30340;&#19981;&#21516;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a reinsurer who faces multiple sources of model uncertainty. The reinsurer offers contracts to $n$ insurers whose claims follow different compound Poisson processes. As the reinsurer is uncertain about the insurers' claim severity distributions and frequencies, they design reinsurance contracts that maximise their expected wealth subject to an entropy penalty. Insurers meanwhile seek to maximise their expected utility without ambiguity. We solve this continuous-time Stackelberg game for general reinsurance contracts and find that the reinsurer prices under a distortion of the barycentre of the insurers' models. We apply our results to proportional reinsurance and excess-of-loss reinsurance contracts, and illustrate the solutions numerically. Furthermore, we solve the related problem where the reinsurer maximises, still under ambiguity, their expected utility and compare the solutions.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20351;&#29992;&#21322;&#21442;&#25968;&#20998;&#20301;&#22238;&#24402;&#30740;&#31350;&#20102;&#32929;&#31080;&#23545;&#20316;&#29289;&#20135;&#37327;&#21644;&#20215;&#26684;&#30456;&#20851;&#24615;&#20197;&#21450;&#25910;&#30410;&#20445;&#38505;&#36153;&#29992;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#24809;&#32602;B&#26679;&#26465;&#26469;&#20272;&#35745;&#20648;&#23384;&#26465;&#20214;&#19979;&#30340;&#32852;&#21512;&#20998;&#24067;&#65292;&#24182;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#39564;&#35777;&#20102;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;&#24212;&#29992;&#35813;&#26041;&#27861;&#36827;&#34892;&#20272;&#35745;&#21518;&#21457;&#29616;&#29577;&#31859;&#21644;&#22823;&#35910;&#22312;&#32654;&#22269;&#30340;&#20648;&#23384;&#26465;&#20214;&#19979;&#20855;&#26377;&#30456;&#20851;&#24615;&#65292;&#24182;&#35745;&#31639;&#20986;&#30456;&#24212;&#30340;&#25910;&#30410;&#20445;&#38505;&#36153;&#29992;&#12290;</title><link>http://arxiv.org/abs/2308.11805</link><description>&lt;p&gt;
&#32929;&#31080;&#23545;&#20316;&#29289;&#20135;&#37327;&#21644;&#20215;&#26684;&#30456;&#20851;&#24615;&#20197;&#21450;&#25910;&#30410;&#20445;&#38505;&#36153;&#29992;&#30340;&#24433;&#21709;&#65306;&#20351;&#29992;&#21322;&#21442;&#25968;&#20998;&#20301;&#22238;&#24402;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
The Impact of Stocks on Correlations of Crop Yields and Prices and on Revenue Insurance Premiums using Semiparametric Quantile Regression. (arXiv:2308.11805v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.11805
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#21322;&#21442;&#25968;&#20998;&#20301;&#22238;&#24402;&#30740;&#31350;&#20102;&#32929;&#31080;&#23545;&#20316;&#29289;&#20135;&#37327;&#21644;&#20215;&#26684;&#30456;&#20851;&#24615;&#20197;&#21450;&#25910;&#30410;&#20445;&#38505;&#36153;&#29992;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#24809;&#32602;B&#26679;&#26465;&#26469;&#20272;&#35745;&#20648;&#23384;&#26465;&#20214;&#19979;&#30340;&#32852;&#21512;&#20998;&#24067;&#65292;&#24182;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#39564;&#35777;&#20102;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;&#24212;&#29992;&#35813;&#26041;&#27861;&#36827;&#34892;&#20272;&#35745;&#21518;&#21457;&#29616;&#29577;&#31859;&#21644;&#22823;&#35910;&#22312;&#32654;&#22269;&#30340;&#20648;&#23384;&#26465;&#20214;&#19979;&#20855;&#26377;&#30456;&#20851;&#24615;&#65292;&#24182;&#35745;&#31639;&#20986;&#30456;&#24212;&#30340;&#25910;&#30410;&#20445;&#38505;&#36153;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20316;&#29289;&#20135;&#37327;&#21644;&#25910;&#33719;&#20215;&#26684;&#24120;&#24120;&#34987;&#35748;&#20026;&#26159;&#36127;&#30456;&#20851;&#30340;&#65292;&#22240;&#27492;&#36890;&#36807;&#31283;&#23450;&#25910;&#30410;&#26469;&#20316;&#20026;&#33258;&#28982;&#39118;&#38505;&#31649;&#29702;&#23545;&#20914;&#12290;&#20648;&#23384;&#29702;&#35770;&#35748;&#20026;&#65292;&#35813;&#30456;&#20851;&#24615;&#26159;&#20174;&#21069;&#20960;&#24180;&#30340;&#24211;&#23384;&#20013;&#24471;&#20986;&#30340;&#19968;&#20010;&#36882;&#22686;&#20989;&#25968;&#12290;&#20648;&#23384;&#26465;&#20214;&#19979;&#30340;&#20108;&#38454;&#30697;&#23545;&#20110;&#30701;&#32570;&#26399;&#38388;&#30340;&#20215;&#26684;&#27874;&#21160;&#21644;&#23545;&#20914;&#38656;&#27714;&#20855;&#26377;&#24433;&#21709;&#65292;&#32780;&#31354;&#38388;&#19978;&#21464;&#21270;&#30340;&#20135;&#37327;-&#20215;&#26684;&#30456;&#20851;&#32467;&#26500;&#23545;&#20110;&#35841;&#20174;&#21830;&#21697;&#25903;&#25345;&#25919;&#31574;&#20013;&#21463;&#30410;&#20855;&#26377;&#24433;&#21709;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20351;&#29992;&#24809;&#32602;B&#26679;&#26465;&#30340;&#21322;&#21442;&#25968;&#20998;&#20301;&#22238;&#24402;&#65288;SQR&#65289;&#26469;&#20272;&#35745;&#20648;&#23384;&#26465;&#20214;&#19979;&#30340;&#20135;&#37327;&#21644;&#20215;&#26684;&#30340;&#32852;&#21512;&#20998;&#24067;&#12290;&#36890;&#36807;&#20840;&#38754;&#30340;&#27169;&#25311;&#30740;&#31350;&#39564;&#35777;&#30340;&#25552;&#20986;&#26041;&#27861;&#65292;&#20801;&#35768;&#20351;&#29992;SQR&#20174;&#30495;&#23454;&#30340;&#32852;&#21512;&#20998;&#24067;&#20013;&#25277;&#26679;&#12290;&#28982;&#21518;&#65292;&#23558;&#20854;&#24212;&#29992;&#20110;&#20272;&#35745;&#32654;&#22269;&#29577;&#31859;&#21644;&#22823;&#35910;&#30340;&#20648;&#23384;&#26465;&#20214;&#19979;&#30340;&#30456;&#20851;&#24615;&#21644;&#25910;&#30410;&#20445;&#38505;&#36153;&#29992;&#12290;&#23545;&#20110;&#36825;&#20004;&#31181;&#20316;&#29289;&#65292;Cornbelt c
&lt;/p&gt;
&lt;p&gt;
Crop yields and harvest prices are often considered to be negatively correlated, thus acting as a natural risk management hedge through stabilizing revenues. Storage theory gives reason to believe that the correlation is an increasing function of stocks carried over from previous years. Stock-conditioned second moments have implications for price movements during shortages and for hedging needs, while spatially varying yield-price correlation structures have implications for who benefits from commodity support policies. In this paper, we propose to use semi-parametric quantile regression (SQR) with penalized B-splines to estimate a stock-conditioned joint distribution of yield and price. The proposed method, validated through a comprehensive simulation study, enables sampling from the true joint distribution using SQR. Then it is applied to approximate stock-conditioned correlation and revenue insurance premium for both corn and soybeans in the United States. For both crops, Cornbelt c
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#35774;&#35745;&#19968;&#27454;&#25915;&#38450;&#28216;&#25103;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#20351;&#29992;&#24207;&#21015;&#37329;&#34701;&#25968;&#25454;&#30340;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#30340;&#23545;&#25239;&#25915;&#20987;&#21644;&#38450;&#24481;&#30340;&#29616;&#29366;&#21644;&#21160;&#24577;&#65292;&#24182;&#19988;&#36890;&#36807;&#20998;&#26512;&#27604;&#36187;&#21160;&#24577;&#65292;&#22238;&#31572;&#20102;&#38544;&#34255;&#27169;&#22411;&#20813;&#21463;&#24694;&#24847;&#29992;&#25143;&#25915;&#20987;&#30340;&#37325;&#35201;&#24615;&#20197;&#21450;&#38656;&#35201;&#22810;&#38271;&#26102;&#38388;&#25165;&#33021;&#30772;&#35299;&#27169;&#22411;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2308.11406</link><description>&lt;p&gt;
&#35774;&#35745;&#19968;&#27454;&#25915;&#38450;&#28216;&#25103;&#65306;&#36890;&#36807;&#31454;&#20105;&#26469;&#22686;&#21152;&#37329;&#34701;&#20132;&#26131;&#27169;&#22411;&#30340;&#40065;&#26834;&#24615;
&lt;/p&gt;
&lt;p&gt;
Designing an attack-defense game: how to increase robustness of financial transaction models via a competition. (arXiv:2308.11406v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.11406
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#35774;&#35745;&#19968;&#27454;&#25915;&#38450;&#28216;&#25103;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#20351;&#29992;&#24207;&#21015;&#37329;&#34701;&#25968;&#25454;&#30340;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#30340;&#23545;&#25239;&#25915;&#20987;&#21644;&#38450;&#24481;&#30340;&#29616;&#29366;&#21644;&#21160;&#24577;&#65292;&#24182;&#19988;&#36890;&#36807;&#20998;&#26512;&#27604;&#36187;&#21160;&#24577;&#65292;&#22238;&#31572;&#20102;&#38544;&#34255;&#27169;&#22411;&#20813;&#21463;&#24694;&#24847;&#29992;&#25143;&#25915;&#20987;&#30340;&#37325;&#35201;&#24615;&#20197;&#21450;&#38656;&#35201;&#22810;&#38271;&#26102;&#38388;&#25165;&#33021;&#30772;&#35299;&#27169;&#22411;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37492;&#20110;&#37329;&#34701;&#39046;&#22495;&#24694;&#24847;&#25915;&#20987;&#39118;&#38505;&#19981;&#26029;&#21319;&#32423;&#21644;&#30001;&#27492;&#24341;&#21457;&#30340;&#20005;&#37325;&#25439;&#23475;&#65292;&#23545;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#23545;&#25239;&#31574;&#30053;&#21644;&#40065;&#26834;&#30340;&#38450;&#24481;&#26426;&#21046;&#26377;&#28145;&#20837;&#30340;&#29702;&#35299;&#33267;&#20851;&#37325;&#35201;&#12290;&#38543;&#30528;&#38134;&#34892;&#26085;&#30410;&#24191;&#27867;&#37319;&#29992;&#26356;&#31934;&#30830;&#20294;&#28508;&#22312;&#33030;&#24369;&#30340;&#31070;&#32463;&#32593;&#32476;&#65292;&#36825;&#19968;&#23041;&#32961;&#21464;&#24471;&#26356;&#21152;&#20005;&#37325;&#12290;&#25105;&#20204;&#26088;&#22312;&#35843;&#26597;&#20351;&#29992;&#24207;&#21015;&#37329;&#34701;&#25968;&#25454;&#20316;&#20026;&#36755;&#20837;&#30340;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#30340;&#23545;&#25239;&#25915;&#20987;&#21644;&#38450;&#24481;&#30340;&#24403;&#21069;&#29366;&#24577;&#21644;&#21160;&#24577;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#20010;&#27604;&#36187;&#65292;&#20801;&#35768;&#23545;&#29616;&#20195;&#37329;&#34701;&#20132;&#26131;&#25968;&#25454;&#20013;&#30340;&#38382;&#39064;&#36827;&#34892;&#36924;&#30495;&#32780;&#35814;&#32454;&#30340;&#30740;&#31350;&#12290;&#21442;&#19982;&#32773;&#30452;&#25509;&#31454;&#20105;&#65292;&#22240;&#27492;&#21487;&#33021;&#30340;&#25915;&#20987;&#21644;&#38450;&#24481;&#22312;&#25509;&#36817;&#30495;&#23454;&#26465;&#20214;&#19979;&#36827;&#34892;&#20102;&#26816;&#39564;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#36129;&#29486;&#26159;&#20998;&#26512;&#27604;&#36187;&#21160;&#24577;&#65292;&#22238;&#31572;&#20102;&#38544;&#34255;&#27169;&#22411;&#20813;&#21463;&#24694;&#24847;&#29992;&#25143;&#25915;&#20987;&#30340;&#37325;&#35201;&#24615;&#20197;&#21450;&#38656;&#35201;&#22810;&#38271;&#26102;&#38388;&#25165;&#33021;&#30772;&#35299;&#27169;&#22411;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
Given the escalating risks of malicious attacks in the finance sector and the consequential severe damage, a thorough understanding of adversarial strategies and robust defense mechanisms for machine learning models is critical. The threat becomes even more severe with the increased adoption in banks more accurate, but potentially fragile neural networks. We aim to investigate the current state and dynamics of adversarial attacks and defenses for neural network models that use sequential financial data as the input.  To achieve this goal, we have designed a competition that allows realistic and detailed investigation of problems in modern financial transaction data. The participants compete directly against each other, so possible attacks and defenses are examined in close-to-real-life conditions. Our main contributions are the analysis of the competition dynamics that answers the questions on how important it is to conceal a model from malicious users, how long does it take to break i
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;</title><link>http://arxiv.org/abs/2302.13426</link><description>&lt;p&gt;
&#26399;&#26435;&#30340;&#20215;&#26684;&#21457;&#29616;
&lt;/p&gt;
&lt;p&gt;
Price Discovery for Derivatives. (arXiv:2302.13426v5 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13426
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#19968;&#20010;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#31169;&#26377;&#20449;&#24687;&#21644;&#39640;&#38454;&#20449;&#24687;&#23545;&#26399;&#26435;&#24066;&#22330;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#27169;&#22411;&#20801;&#35768;&#26377;&#31169;&#26377;&#20449;&#24687;&#30340;&#20132;&#26131;&#32773;&#22312;&#29366;&#24577;-&#32034;&#36180;&#38598;&#24066;&#22330;&#19978;&#20132;&#26131;&#12290;&#31561;&#20215;&#30340;&#26399;&#26435;&#24418;&#24335;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#25317;&#26377;&#20851;&#20110;&#22522;&#30784;&#36164;&#20135;&#25910;&#30410;&#30340;&#20998;&#24067;&#30340;&#31169;&#26377;&#20449;&#24687;&#65292;&#24182;&#20801;&#35768;&#20132;&#26131;&#20219;&#24847;&#26399;&#26435;&#32452;&#21512;&#30340;&#25805;&#32437;&#32773;&#12290;&#25105;&#20204;&#24471;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#65292;&#36825;&#20123;&#35299;&#25552;&#20379;&#20102;&#20851;&#20110;&#20869;&#24149;&#20132;&#26131;&#30340;&#39640;&#38454;&#20449;&#24687;&#65292;&#22914;&#20219;&#20309;&#32473;&#23450;&#30340;&#26102;&#21051;&#20132;&#26131;&#26399;&#26435;&#31574;&#30053;&#65292;&#24182;&#23558;&#36825;&#20123;&#31574;&#30053;&#27867;&#21270;&#21040;&#20102;&#27874;&#21160;&#29575;&#20132;&#26131;&#31561;&#23454;&#36341;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;
We obtain a basic theory of price discovery across derivative markets with respect to higher-order information, using a model where an agent with general private information regarding state probabilities is allowed to trade arbitrary portfolios of state-contingent claims. In an equivalent options formulation, the informed agent has private information regarding arbitrary aspects of the payoff distribution of an underlying asset and is allowed to trade arbitrary option portfolios. We characterize, in closed form, the informed demand, price impact, and information efficiency of prices. Our results offer a theory of insider trading on higher moments of the underlying payoff as a special case. The informed demand formula prescribes option strategies for trading on any given moment and extends those used in practice for, e.g. volatility trading.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#23618;&#27425;&#26041;&#27861;&#65292;&#21033;&#29992;&#20225;&#19994;&#21644;&#22269;&#23478;&#23618;&#38754;&#30340;&#25968;&#25454;&#26500;&#24314;&#20102;&#19968;&#32452;&#27773;&#36710;&#29983;&#20135;&#38142;&#21508;&#20010;&#29615;&#33410;&#30340;&#22269;&#23478;&#20869;&#37096;&#20225;&#19994;&#36152;&#26131;&#32593;&#32476;&#12290;&#36890;&#36807;&#22270;&#24418;&#27169;&#24335;&#26816;&#27979;&#26041;&#27861;&#65292;&#25552;&#21462;&#20102;&#28508;&#22312;&#30340;&#22269;&#23478;&#23618;&#38754;&#30340;&#20225;&#19994;&#20869;&#36152;&#26131;&#32852;&#31995;&#12290;</title><link>http://arxiv.org/abs/2202.00409</link><description>&lt;p&gt;
&#22312;&#27773;&#36710;&#34892;&#19994;&#20013;&#30340;&#20225;&#19994;&#20869;&#36152;&#26131;&#30340;&#26144;&#23556;: &#19968;&#31181;&#32593;&#32476;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Mapping intra firm trade in the automotive sector: a network approach. (arXiv:2202.00409v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.00409
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#23618;&#27425;&#26041;&#27861;&#65292;&#21033;&#29992;&#20225;&#19994;&#21644;&#22269;&#23478;&#23618;&#38754;&#30340;&#25968;&#25454;&#26500;&#24314;&#20102;&#19968;&#32452;&#27773;&#36710;&#29983;&#20135;&#38142;&#21508;&#20010;&#29615;&#33410;&#30340;&#22269;&#23478;&#20869;&#37096;&#20225;&#19994;&#36152;&#26131;&#32593;&#32476;&#12290;&#36890;&#36807;&#22270;&#24418;&#27169;&#24335;&#26816;&#27979;&#26041;&#27861;&#65292;&#25552;&#21462;&#20102;&#28508;&#22312;&#30340;&#22269;&#23478;&#23618;&#38754;&#30340;&#20225;&#19994;&#20869;&#36152;&#26131;&#32852;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20225;&#19994;&#20869;&#36152;&#26131;&#25551;&#36848;&#30340;&#26159;&#38468;&#23646;&#20225;&#19994;&#20043;&#38388;&#30340;&#36152;&#26131;&#65292;&#38543;&#30528;&#20840;&#29699;&#29983;&#20135;&#30340;&#20998;&#25955;&#21270;&#65292;&#23427;&#21464;&#24471;&#36234;&#26469;&#36234;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#20851;&#20110;&#20840;&#29699;&#20225;&#19994;&#20869;&#36152;&#26131;&#27169;&#24335;&#30340;&#32479;&#35745;&#25968;&#25454;&#26222;&#36941;&#19981;&#21487;&#24471;&#12290;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22810;&#23618;&#27425;&#26041;&#27861;&#65292;&#23558;&#20225;&#19994;&#21644;&#22269;&#23478;&#23618;&#38754;&#30340;&#25968;&#25454;&#32467;&#21512;&#36215;&#26469;&#65292;&#26500;&#24314;&#20102;&#19968;&#32452;&#27773;&#36710;&#29983;&#20135;&#38142;&#21508;&#20010;&#29615;&#33410;&#30340;&#22269;&#23478;&#20869;&#37096;&#20225;&#19994;&#36152;&#26131;&#32593;&#32476;&#12290;&#22312;&#23439;&#35266;&#23618;&#38754;&#19978;&#26500;&#24314;&#20102;&#19968;&#31181;&#22810;&#23618;&#27425;&#32593;&#32476;&#65292;&#20854;&#20013;&#21253;&#25324;&#22269;&#38469;&#36152;&#26131;&#32593;&#32476;&#12289;&#24494;&#35266;&#23618;&#38754;&#19978;&#30340;&#20225;&#19994;&#25152;&#26377;&#26435;&#32593;&#32476;&#20197;&#21450;&#23558;&#20004;&#32773;&#36830;&#25509;&#36215;&#26469;&#30340;&#20225;&#19994;-&#22269;&#23478;&#38582;&#23646;&#32593;&#32476;&#12290;&#37319;&#29992;&#22270;&#24418;&#27169;&#24335;&#26816;&#27979;&#26041;&#27861;&#26469;&#31579;&#36873;&#36825;&#20123;&#32593;&#32476;&#65292;&#25552;&#21462;&#28508;&#22312;&#30340;&#22269;&#23478;&#20869;&#37096;&#20225;&#19994;&#36152;&#26131;&#32852;&#31995;&#65292;&#20854;&#20013;&#27169;&#24335;&#65288;&#25110;&#23376;&#32467;&#26500;&#65289;&#26159;&#30001;&#36152;&#26131;&#30456;&#36830;&#30340;&#20004;&#20010;&#22269;&#23478;&#65292;&#27599;&#20010;&#22269;&#23478;&#37117;&#38468;&#23646;&#20110;&#19968;&#20010;&#20225;&#19994;&#65292;&#32780;&#36825;&#20004;&#20010;&#20225;&#19994;&#21448;&#36890;&#36807;&#25152;&#26377;&#26435;&#32852;&#31995;&#22312;&#19968;&#36215;&#12290;&#22270;&#24418;&#27169;&#24335;&#26816;&#27979;&#29992;&#20110;&#25552;&#21462;&#28508;&#22312;&#30340;&#22269;&#23478;&#23618;&#38754;&#30340;&#20225;&#19994;&#20869;&#36152;&#26131;&#32852;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
Intra-firm trade describes the trade between affiliated firms and is increasingly important as global production is fragmented. However, statistics and data on global intra-firm trade patterns are widely unavailable. This study proposes a novel multilevel approach combining firm and country level data to construct a set of country intra-firm trade networks for various segments of the automotive production chain. A multilevel network is constructed with a network of international trade at the macro level, a firm ownership network at the micro level and a firm-country affiliation network linking the two, at the meso level. A motif detection approach is used to filter these networks to extract potential intra-firm trade ties between countries, where the motif (or substructure) is two countries linked by trade, each affiliated with a firm, and these two firms linked by ownership. The motif detection is used to extract potential country level intra-firm trade ties. An Exponential Random Gra
&lt;/p&gt;</description></item></channel></rss>