<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#21033;&#29992;P2P&#20511;&#36151;&#24179;&#21488;&#19978;&#20511;&#27454;&#20154;&#25552;&#20379;&#30340;&#25991;&#26412;&#25551;&#36848;&#26469;&#26500;&#24314;&#39118;&#38505;&#25351;&#26631;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#29983;&#25104;&#30340;&#39118;&#38505;&#35780;&#20998;&#21487;&#20197;&#26126;&#26174;&#25552;&#39640;&#20449;&#29992;&#39118;&#38505;&#20998;&#31867;&#22120;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2401.16458</link><description>&lt;p&gt;
&#20449;&#29992;&#39118;&#38505;&#19982;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30456;&#32467;&#21512;&#65306;&#20174;P2P&#20511;&#36151;&#30340;&#36151;&#27454;&#25551;&#36848;&#20013;&#26500;&#24314;&#39118;&#38505;&#25351;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;
Credit Risk Meets Large Language Models: Building a Risk Indicator from Loan Descriptions in P2P Lending. (arXiv:2401.16458v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.16458
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#21033;&#29992;P2P&#20511;&#36151;&#24179;&#21488;&#19978;&#20511;&#27454;&#20154;&#25552;&#20379;&#30340;&#25991;&#26412;&#25551;&#36848;&#26469;&#26500;&#24314;&#39118;&#38505;&#25351;&#26631;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#29983;&#25104;&#30340;&#39118;&#38505;&#35780;&#20998;&#21487;&#20197;&#26126;&#26174;&#25552;&#39640;&#20449;&#29992;&#39118;&#38505;&#20998;&#31867;&#22120;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
P2P&#20511;&#36151;&#20316;&#20026;&#19968;&#31181;&#29420;&#29305;&#30340;&#34701;&#36164;&#26426;&#21046;&#65292;&#36890;&#36807;&#22312;&#32447;&#24179;&#21488;&#23558;&#20511;&#27454;&#20154;&#19982;&#25918;&#27454;&#20154;&#32852;&#31995;&#36215;&#26469;&#12290;&#28982;&#32780;&#65292;P2P&#20511;&#36151;&#38754;&#20020;&#20449;&#24687;&#19981;&#23545;&#31216;&#30340;&#25361;&#25112;&#65292;&#22240;&#20026;&#25918;&#27454;&#20154;&#24448;&#24448;&#32570;&#20047;&#36275;&#22815;&#30340;&#25968;&#25454;&#26469;&#35780;&#20272;&#20511;&#27454;&#20154;&#30340;&#20449;&#29992;&#20215;&#20540;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#21363;&#21033;&#29992;&#20511;&#27454;&#20154;&#22312;&#36151;&#27454;&#30003;&#35831;&#36807;&#31243;&#20013;&#25552;&#20379;&#30340;&#25991;&#26412;&#25551;&#36848;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#28041;&#21450;&#20351;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#22788;&#29702;&#36825;&#20123;&#25991;&#26412;&#25551;&#36848;&#65292;LLM&#26159;&#19968;&#31181;&#33021;&#22815;&#35782;&#21035;&#25991;&#26412;&#20013;&#30340;&#27169;&#24335;&#21644;&#35821;&#20041;&#30340;&#24378;&#22823;&#24037;&#20855;&#12290;&#23558;&#36801;&#31227;&#23398;&#20064;&#24212;&#29992;&#20110;&#23558;LLM&#36866;&#24212;&#29305;&#23450;&#20219;&#21153;&#12290;&#25105;&#20204;&#20174;Lending Club&#25968;&#25454;&#38598;&#30340;&#20998;&#26512;&#32467;&#26524;&#26174;&#31034;&#65292;BERT&#29983;&#25104;&#30340;&#39118;&#38505;&#35780;&#20998;&#26174;&#33879;&#25552;&#39640;&#20102;&#20449;&#29992;&#39118;&#38505;&#20998;&#31867;&#22120;&#30340;&#24615;&#33021;&#12290;&#28982;&#32780;&#65292;&#22522;&#20110;LLM&#30340;&#31995;&#32479;&#22266;&#26377;&#30340;&#19981;&#36879;&#26126;&#24615;&#65292;&#20197;&#21450;&#28508;&#22312;&#20559;&#24046;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#38480;&#21046;&#20102;&#20854;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Peer-to-peer (P2P) lending has emerged as a distinctive financing mechanism, linking borrowers with lenders through online platforms. However, P2P lending faces the challenge of information asymmetry, as lenders often lack sufficient data to assess the creditworthiness of borrowers. This paper proposes a novel approach to address this issue by leveraging the textual descriptions provided by borrowers during the loan application process. Our methodology involves processing these textual descriptions using a Large Language Model (LLM), a powerful tool capable of discerning patterns and semantics within the text. Transfer learning is applied to adapt the LLM to the specific task at hand.  Our results derived from the analysis of the Lending Club dataset show that the risk score generated by BERT, a widely used LLM, significantly improves the performance of credit risk classifiers. However, the inherent opacity of LLM-based systems, coupled with uncertainties about potential biases, unders
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;ESG&#19968;&#33268;&#30340;&#39118;&#38505;&#24230;&#37327;&#21644;ESG&#22238;&#25253;&#39118;&#38505;&#27604;&#30340;&#23450;&#20041;&#65292;&#20026;&#21487;&#25345;&#32493;&#25237;&#36164;&#25552;&#20379;&#20102;&#19968;&#31181;&#32508;&#21512;&#32771;&#34385;&#29615;&#22659;&#12289;&#31038;&#20250;&#21644;&#27835;&#29702;&#22240;&#32032;&#30340;&#35780;&#20272;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2309.05866</link><description>&lt;p&gt;
ESG&#19968;&#33268;&#30340;&#39118;&#38505;&#24230;&#37327;&#29992;&#20110;&#21487;&#25345;&#32493;&#25237;&#36164;
&lt;/p&gt;
&lt;p&gt;
ESG-coherent risk measures for sustainable investing. (arXiv:2309.05866v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.05866
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;ESG&#19968;&#33268;&#30340;&#39118;&#38505;&#24230;&#37327;&#21644;ESG&#22238;&#25253;&#39118;&#38505;&#27604;&#30340;&#23450;&#20041;&#65292;&#20026;&#21487;&#25345;&#32493;&#25237;&#36164;&#25552;&#20379;&#20102;&#19968;&#31181;&#32508;&#21512;&#32771;&#34385;&#29615;&#22659;&#12289;&#31038;&#20250;&#21644;&#27835;&#29702;&#22240;&#32032;&#30340;&#35780;&#20272;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#21487;&#25345;&#32493;&#25237;&#36164;&#36234;&#26469;&#36234;&#24863;&#20852;&#36259;&#65292;&#38656;&#35201;&#19968;&#31181;&#22522;&#20110;&#20844;&#29702;&#30340;&#39118;&#38505;&#21644;&#22238;&#25253;&#24230;&#37327;&#26041;&#27861;&#65292;&#19981;&#20165;&#20851;&#27880;&#36130;&#21153;&#22238;&#25253;&#65292;&#36824;&#20851;&#27880;&#29615;&#22659;&#21644;&#31038;&#20250;&#21487;&#25345;&#32493;&#24615;&#30340;&#24230;&#37327;&#65292;&#21363;&#29615;&#22659;&#12289;&#31038;&#20250;&#21644;&#27835;&#29702;(ESG)&#24471;&#20998;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;ESG&#19968;&#33268;&#30340;&#39118;&#38505;&#24230;&#37327;&#21644;ESG&#22238;&#25253;&#39118;&#38505;&#27604;&#30340;&#23450;&#20041;&#65292;&#22522;&#20110;&#21452;&#21464;&#37327;&#38543;&#26426;&#21464;&#37327;&#30340;&#20989;&#25968;&#65292;&#24212;&#29992;&#20110;&#36130;&#21153;&#22238;&#25253;&#21644;ESG&#24471;&#20998;&#19978;&#65292;&#23558;&#20256;&#32479;&#30340;&#21333;&#21464;&#37327;&#24230;&#37327;&#25193;&#23637;&#21040;ESG&#22330;&#26223;&#20013;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#31034;&#20363;&#24182;&#36827;&#34892;&#20102;&#23454;&#35777;&#20998;&#26512;&#65292;&#20854;&#20013;&#20351;&#29992;ESG&#19968;&#33268;&#30340;&#39118;&#38505;&#24230;&#37327;&#21644;ESG&#22238;&#25253;&#39118;&#38505;&#27604;&#23545;&#32929;&#31080;&#36827;&#34892;&#25490;&#21517;&#12290;
&lt;/p&gt;
&lt;p&gt;
The growing interest in sustainable investing calls for an axiomatic approach to measures of risk and reward that focus not only on financial returns, but also on measures of environmental and social sustainability, i.e. environmental, social, and governance (ESG) scores. We propose definitions for ESG-coherent risk measures and ESG reward-risk ratios based on functions of bivariate random variables that are applied to financial returns and ESG scores, extending the traditional univariate measures to the ESG case. We provide examples and present an empirical analysis in which the ESG-coherent risk measures and ESG reward-risk ratios are used to rank stocks.
&lt;/p&gt;</description></item></channel></rss>