<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20984;&#20989;&#25968;&#24046;&#20998;&#21644;&#32447;&#25628;&#32034;&#30340;&#31639;&#27861;&#65288;BDCA&#65289;&#65292;&#29992;&#20110;&#35299;&#20915;&#32447;&#24615;&#20248;&#21270;&#38382;&#39064;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;&#20854;&#25910;&#25947;&#24615;&#21644;&#20854;&#20182;&#29305;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.09194</link><description>&lt;p&gt;
&#22522;&#20110;&#20984;&#20989;&#25968;&#24046;&#20998;&#31639;&#27861;&#30340;&#20215;&#20540;&#39118;&#38505;&#32422;&#26463;&#32452;&#21512;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
The Boosted Difference of Convex Functions Algorithm for Value-at-Risk Constrained Portfolio Optimization
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09194
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20984;&#20989;&#25968;&#24046;&#20998;&#21644;&#32447;&#25628;&#32034;&#30340;&#31639;&#27861;&#65288;BDCA&#65289;&#65292;&#29992;&#20110;&#35299;&#20915;&#32447;&#24615;&#20248;&#21270;&#38382;&#39064;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;&#20854;&#25910;&#25947;&#24615;&#21644;&#20854;&#20182;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29616;&#20195;&#37329;&#34701;&#20013;&#19968;&#20010;&#38750;&#24120;&#30456;&#20851;&#30340;&#38382;&#39064;&#26159;&#35774;&#35745;&#20215;&#20540;&#39118;&#38505;&#65288;VaR&#65289;&#26368;&#20248;&#32452;&#21512;&#12290;&#30001;&#20110;&#24403;&#20195;&#37329;&#34701;&#30417;&#31649;&#30340;&#35201;&#27714;&#65292;&#38134;&#34892;&#21644;&#20854;&#20182;&#37329;&#34701;&#26426;&#26500;&#38656;&#35201;&#20351;&#29992;&#39118;&#38505;&#24230;&#37327;&#26469;&#25511;&#21046;&#20182;&#20204;&#30340;&#20449;&#29992;&#39118;&#38505;&#12289;&#24066;&#22330;&#39118;&#38505;&#21644;&#36816;&#33829;&#39118;&#38505;&#12290;&#23545;&#20110;&#20855;&#26377;&#31163;&#25955;&#25910;&#30410;&#20998;&#24067;&#21644;&#26377;&#38480;&#20010;&#24773;&#26223;&#30340;&#32452;&#21512;&#65292;&#21487;&#20197;&#25512;&#23548;&#20986;&#20984;&#20989;&#25968;&#24046;&#20998;&#65288;DC&#65289;&#20989;&#25968;&#34920;&#31034;&#30340;VaR&#12290;Wozabal&#65288;2012&#65289;&#35777;&#26126;&#20102;&#36825;&#21487;&#20197;&#36890;&#36807;&#20351;&#29992;&#20984;&#20989;&#25968;&#24046;&#20998;&#31639;&#27861;&#65288;DCA&#65289;&#26469;&#35299;&#20915;VaR&#32422;&#26463;&#30340;Markowitz&#39118;&#26684;&#32452;&#21512;&#36873;&#25321;&#38382;&#39064;&#12290;&#26368;&#36817;&#30340;&#31639;&#27861;&#25193;&#23637;&#26159;Boosted Difference of Convex Functions Algorithm&#65288;BDCA&#65289;&#65292;&#23427;&#36890;&#36807;&#39069;&#22806;&#30340;&#32447;&#25628;&#32034;&#27493;&#39588;&#21152;&#36895;&#25910;&#25947;&#12290;&#24050;&#32463;&#35777;&#26126;BDCA&#23545;&#20110;&#35299;&#20915;&#20855;&#26377;&#32447;&#24615;&#19981;&#31561;&#24335;&#32422;&#26463;&#30340;&#38750;&#20809;&#28369;&#20108;&#27425;&#38382;&#39064;&#20855;&#26377;&#32447;&#24615;&#25910;&#25947;&#24615;&#12290;&#26412;&#25991;&#35777;&#26126;&#20102;&#35813;&#31639;&#27861;&#22312;&#32447;&#24615;&#20248;&#21270;&#38382;&#39064;&#20013;&#30340;&#25910;&#25947;&#24615;&#20197;&#21450;&#20854;&#23427;&#19968;&#20123;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09194v1 Announce Type: cross Abstract: A highly relevant problem of modern finance is the design of Value-at-Risk (VaR) optimal portfolios. Due to contemporary financial regulations, banks and other financial institutions are tied to use the risk measure to control their credit, market and operational risks. For a portfolio with a discrete return distribution and finitely many scenarios, a Difference of Convex (DC) functions representation of the VaR can be derived. Wozabal (2012) showed that this yields a solution to a VaR constrained Markowitz style portfolio selection problem using the Difference of Convex Functions Algorithm (DCA). A recent algorithmic extension is the so-called Boosted Difference of Convex Functions Algorithm (BDCA) which accelerates the convergence due to an additional line search step. It has been shown that the BDCA converges linearly for solving non-smooth quadratic problems with linear inequality constraints. In this paper, we prove that the linear
&lt;/p&gt;</description></item></channel></rss>