<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#36825;&#20221;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#29992;&#20110;&#23450;&#20215;&#36339;&#36291;&#25193;&#25955;&#27169;&#22411;&#19979;&#27431;&#24335;&#31726;&#24335;&#26399;&#26435;&#30340;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#65292;&#37319;&#29992;&#20102;&#38544;&#24335;-&#26174;&#24335;&#26368;&#23567;&#31227;&#21160;&#26041;&#27861;&#20197;&#21450;&#27531;&#24046;&#22411;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#36924;&#36817;&#65292;&#24182;&#36890;&#36807;&#31232;&#30095;&#32593;&#26684;&#39640;&#26031;-&#22467;&#23572;&#31859;&#29305;&#36924;&#36817;&#21644;&#22522;&#20110;ANN&#30340;&#39640;&#32500;&#19987;&#29992;&#27714;&#31215;&#35268;&#21017;&#26469;&#31163;&#25955;&#21270;&#31215;&#20998;&#36816;&#31639;&#31526;&#12290;</title><link>http://arxiv.org/abs/2401.06740</link><description>&lt;p&gt;
&#19968;&#31181;&#29992;&#20110;&#36339;&#36291;&#25193;&#25955;&#27169;&#22411;&#26399;&#26435;&#23450;&#20215;&#30340;&#28145;&#24230;&#38544;&#24335;-&#26174;&#24335;&#26368;&#23567;&#31227;&#21160;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A deep implicit-explicit minimizing movement method for option pricing in jump-diffusion models. (arXiv:2401.06740v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.06740
&lt;/p&gt;
&lt;p&gt;
&#36825;&#20221;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#29992;&#20110;&#23450;&#20215;&#36339;&#36291;&#25193;&#25955;&#27169;&#22411;&#19979;&#27431;&#24335;&#31726;&#24335;&#26399;&#26435;&#30340;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#65292;&#37319;&#29992;&#20102;&#38544;&#24335;-&#26174;&#24335;&#26368;&#23567;&#31227;&#21160;&#26041;&#27861;&#20197;&#21450;&#27531;&#24046;&#22411;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#36924;&#36817;&#65292;&#24182;&#36890;&#36807;&#31232;&#30095;&#32593;&#26684;&#39640;&#26031;-&#22467;&#23572;&#31859;&#29305;&#36924;&#36817;&#21644;&#22522;&#20110;ANN&#30340;&#39640;&#32500;&#19987;&#29992;&#27714;&#31215;&#35268;&#21017;&#26469;&#31163;&#25955;&#21270;&#31215;&#20998;&#36816;&#31639;&#31526;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#23450;&#20215;&#36339;&#36291;&#25193;&#25955;&#21160;&#24577;&#19979;&#30340;&#27431;&#24335;&#31726;&#24335;&#26399;&#26435;&#12290;&#23558;&#26399;&#26435;&#23450;&#20215;&#38382;&#39064;&#34920;&#36848;&#20026;&#19968;&#20010;&#20559;&#31215;&#20998;&#24494;&#20998;&#26041;&#31243;&#65292;&#24182;&#36890;&#36807;&#19968;&#31181;&#26032;&#30340;&#38544;&#24335;-&#26174;&#24335;&#26368;&#23567;&#31227;&#21160;&#26102;&#38388;&#27493;&#27861;&#36827;&#34892;&#36817;&#20284;&#65292;&#35813;&#26041;&#27861;&#20351;&#29992;&#28145;&#24230;&#27531;&#24046;&#22411;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#65288;ANNs&#65289;&#36880;&#27493;&#36924;&#36817;&#12290;&#31215;&#20998;&#36816;&#31639;&#31526;&#36890;&#36807;&#20004;&#31181;&#19981;&#21516;&#30340;&#26041;&#27861;&#31163;&#25955;&#21270;&#65306;a&#65289;&#36890;&#36807;&#31232;&#30095;&#32593;&#26684;&#39640;&#26031;-&#22467;&#23572;&#31859;&#29305;&#36924;&#36817;&#65292;&#37319;&#29992;&#22855;&#24322;&#20540;&#20998;&#35299;&#20135;&#29983;&#30340;&#23616;&#37096;&#22352;&#26631;&#36724;&#65292;&#24182;&#19988;b&#65289;&#36890;&#36807;&#22522;&#20110;ANN&#30340;&#39640;&#32500;&#19987;&#29992;&#27714;&#31215;&#35268;&#21017;&#12290;&#20851;&#38190;&#26159;&#65292;&#25152;&#25552;&#20986;&#30340;ANN&#30340;&#26500;&#36896;&#30830;&#20445;&#20102;&#35299;&#20915;&#26041;&#26696;&#22312;&#26631;&#30340;&#36164;&#20135;&#36739;&#22823;&#20540;&#26102;&#30340;&#28176;&#36817;&#34892;&#20026;&#65292;&#24182;&#19988;&#19982;&#35299;&#20915;&#26041;&#26696;&#20808;&#39564;&#24050;&#30693;&#30340;&#23450;&#24615;&#29305;&#24615;&#30456;&#19968;&#33268;&#36755;&#20986;&#12290;&#23545;&#26041;&#27861;&#32500;&#24230;&#30340;&#24615;&#33021;&#21644;&#40065;&#26834;&#24615;&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a novel deep learning approach for pricing European basket options written on assets that follow jump-diffusion dynamics. The option pricing problem is formulated as a partial integro-differential equation, which is approximated via a new implicit-explicit minimizing movement time-stepping approach, involving approximation by deep, residual-type Artificial Neural Networks (ANNs) for each time step. The integral operator is discretized via two different approaches: a) a sparse-grid Gauss--Hermite approximation following localised coordinate axes arising from singular value decompositions, and b) an ANN-based high-dimensional special-purpose quadrature rule. Crucially, the proposed ANN is constructed to ensure the asymptotic behavior of the solution for large values of the underlyings and also leads to consistent outputs with respect to a priori known qualitative properties of the solution. The performance and robustness with respect to the dimension of the methods are assesse
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#21033;&#29992;&#28508;&#22312;&#27969;&#21160;&#24615;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#32929;&#26435;&#25293;&#21334;&#20013;&#30340;&#21160;&#24577;&#29305;&#24449;&#65292;&#24182;&#25552;&#20379;&#20102;&#30456;&#20851;&#21442;&#25968;&#30340;&#31934;&#30830;&#27979;&#37327;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25293;&#21334;&#25509;&#36817;&#32467;&#26463;&#26102;&#65292;&#20107;&#20214;&#21457;&#29983;&#29575;&#21152;&#24555;&#65292;&#23548;&#33268;&#24066;&#20215;&#21608;&#22260;&#27969;&#21160;&#24615;&#31215;&#32858;&#65292;&#20174;&#32780;&#20943;&#23569;&#24066;&#20215;&#30340;&#20215;&#26684;&#24433;&#21709;&#21644;&#27874;&#21160;&#24615;&#12290;&#21516;&#26102;&#65292;&#30740;&#31350;&#21457;&#29616;&#38480;&#20215;&#22996;&#25176;&#31807;&#30340;&#21160;&#24577;&#21487;&#36890;&#36807;&#28508;&#22312;&#27969;&#21160;&#24615;&#26694;&#26550;&#36827;&#34892;&#25551;&#36848;&#65292;&#24182;&#19988;&#24066;&#20215;&#30340;&#27425;&#25193;&#25955;&#26159;&#19981;&#21487;&#39044;&#27979;&#30340;&#12290;</title><link>http://arxiv.org/abs/2401.06724</link><description>&lt;p&gt;
&#20844;&#24179;&#25293;&#21334;&#21160;&#24577;: &#20855;&#26377;&#27963;&#21160;&#21152;&#36895;&#24230;&#30340;&#28508;&#22312;&#27969;&#21160;&#24615;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Equity auction dynamics: latent liquidity models with activity acceleration. (arXiv:2401.06724v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.06724
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#21033;&#29992;&#28508;&#22312;&#27969;&#21160;&#24615;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#32929;&#26435;&#25293;&#21334;&#20013;&#30340;&#21160;&#24577;&#29305;&#24449;&#65292;&#24182;&#25552;&#20379;&#20102;&#30456;&#20851;&#21442;&#25968;&#30340;&#31934;&#30830;&#27979;&#37327;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25293;&#21334;&#25509;&#36817;&#32467;&#26463;&#26102;&#65292;&#20107;&#20214;&#21457;&#29983;&#29575;&#21152;&#24555;&#65292;&#23548;&#33268;&#24066;&#20215;&#21608;&#22260;&#27969;&#21160;&#24615;&#31215;&#32858;&#65292;&#20174;&#32780;&#20943;&#23569;&#24066;&#20215;&#30340;&#20215;&#26684;&#24433;&#21709;&#21644;&#27874;&#21160;&#24615;&#12290;&#21516;&#26102;&#65292;&#30740;&#31350;&#21457;&#29616;&#38480;&#20215;&#22996;&#25176;&#31807;&#30340;&#21160;&#24577;&#21487;&#36890;&#36807;&#28508;&#22312;&#27969;&#21160;&#24615;&#26694;&#26550;&#36827;&#34892;&#25551;&#36848;&#65292;&#24182;&#19988;&#24066;&#20215;&#30340;&#27425;&#25193;&#25955;&#26159;&#19981;&#21487;&#39044;&#27979;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19982;&#36830;&#32493;&#20132;&#26131;&#30456;&#27604;&#65292;&#32929;&#26435;&#25293;&#21334;&#20855;&#26377;&#20960;&#20010;&#19981;&#21516;&#30340;&#29305;&#28857;&#12290;&#38543;&#30528;&#25293;&#21334;&#26102;&#38388;&#30340;&#20020;&#36817;&#65292;&#20107;&#20214;&#30340;&#21457;&#29983;&#29575;&#21152;&#24555;&#65292;&#23548;&#33268;&#24066;&#20215;&#21608;&#22260;&#20986;&#29616;&#22823;&#37327;&#30340;&#27969;&#21160;&#24615;&#31215;&#32858;&#12290;&#36825;&#21453;&#36807;&#26469;&#20943;&#23569;&#20102;&#24066;&#20215;&#30340;&#20215;&#26684;&#24433;&#21709;&#21644;&#27874;&#21160;&#24615;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#23558;&#28508;&#22312;/&#26174;&#24615;&#35746;&#21333;&#31807;&#26694;&#26550;&#24212;&#29992;&#20110;&#32929;&#26435;&#25293;&#21334;&#30340;&#20855;&#20307;&#24773;&#20917;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#27169;&#22411;&#21442;&#25968;&#30340;&#31934;&#30830;&#27979;&#37327;&#65292;&#21253;&#25324;&#35746;&#21333;&#25552;&#20132;&#12289;&#21462;&#28040;&#21644;&#25193;&#25955;&#36895;&#29575;&#12290;&#25105;&#20204;&#30340;&#35774;&#32622;&#20351;&#25105;&#20204;&#33021;&#22815;&#25551;&#36848;&#24052;&#40654;&#27867;&#27431;&#20132;&#26131;&#25152;&#25910;&#24066;&#25293;&#21334;&#26399;&#38388;&#24179;&#22343;&#35746;&#21333;&#31807;&#30340;&#23436;&#25972;&#21160;&#24577;&#12290;&#36825;&#20123;&#21457;&#29616;&#25903;&#25345;&#28508;&#22312;&#27969;&#21160;&#24615;&#26694;&#26550;&#22312;&#25551;&#36848;&#38480;&#20215;&#22996;&#25176;&#31807;&#21160;&#24577;&#26041;&#38754;&#30340;&#30456;&#20851;&#24615;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#23548;&#33268;&#27425;&#25193;&#25955;&#24066;&#20215;&#30340;&#22240;&#32032;&#65292;&#24182;&#35777;&#26126;&#20102;&#24066;&#20215;&#21487;&#39044;&#27979;&#24615;&#30340;&#32570;&#22833;&#12290;
&lt;/p&gt;
&lt;p&gt;
Equity auctions display several distinctive characteristics in contrast to continuous trading. As the auction time approaches, the rate of events accelerates causing a substantial liquidity buildup around the indicative price. This, in turn, results in a reduced price impact and decreased volatility of the indicative price. In this study, we adapt the latent/revealed order book framework to the specifics of equity auctions. We provide precise measurements of the model parameters, including order submissions, cancellations, and diffusion rates. Our setup allows us to describe the full dynamics of the average order book during closing auctions in Euronext Paris. These findings support the relevance of the latent liquidity framework in describing limit order book dynamics. Lastly, we analyze the factors contributing to a sub-diffusive indicative price and demonstrate the absence of indicative price predictability.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20197;&#20013;&#22830;&#38134;&#34892;&#25968;&#23383;&#36135;&#24065;&#30340;&#21457;&#23637;&#20026;&#35270;&#35282;&#65292;&#24314;&#31435;&#20102;&#20013;&#22830;&#38134;&#34892;&#25968;&#23383;&#36135;&#24065;&#19979;&#30340;&#20132;&#26131;&#36135;&#24065;&#38656;&#27714;&#27169;&#22411;&#65292;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;&#20013;&#22830;&#38134;&#34892;&#25968;&#23383;&#36135;&#24065;&#30340;&#21457;&#34892;&#21644;&#27969;&#36890;&#23558;&#20250;&#20943;&#23569;&#23545;&#20132;&#26131;&#36135;&#24065;&#30340;&#38656;&#27714;&#12290;&#22312;&#20013;&#22830;&#38134;&#34892;&#25968;&#23383;&#36135;&#24065;&#32972;&#26223;&#19979;&#65292;&#20013;&#22269;&#24212;&#25506;&#32034;&#26356;&#26377;&#25928;&#30340;&#36135;&#24065;&#25919;&#31574;&#12290;</title><link>http://arxiv.org/abs/2401.06457</link><description>&lt;p&gt;
&#20013;&#22830;&#38134;&#34892;&#25968;&#23383;&#36135;&#24065;&#23545;&#20132;&#26131;&#36135;&#24065;&#38656;&#27714;&#30340;&#24433;&#21709;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Analysis of the Impact of Central bank Digital Currency on the Demand for Transactional Currency. (arXiv:2401.06457v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.06457
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20197;&#20013;&#22830;&#38134;&#34892;&#25968;&#23383;&#36135;&#24065;&#30340;&#21457;&#23637;&#20026;&#35270;&#35282;&#65292;&#24314;&#31435;&#20102;&#20013;&#22830;&#38134;&#34892;&#25968;&#23383;&#36135;&#24065;&#19979;&#30340;&#20132;&#26131;&#36135;&#24065;&#38656;&#27714;&#27169;&#22411;&#65292;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;&#20013;&#22830;&#38134;&#34892;&#25968;&#23383;&#36135;&#24065;&#30340;&#21457;&#34892;&#21644;&#27969;&#36890;&#23558;&#20250;&#20943;&#23569;&#23545;&#20132;&#26131;&#36135;&#24065;&#30340;&#38656;&#27714;&#12290;&#22312;&#20013;&#22830;&#38134;&#34892;&#25968;&#23383;&#36135;&#24065;&#32972;&#26223;&#19979;&#65292;&#20013;&#22269;&#24212;&#25506;&#32034;&#26356;&#26377;&#25928;&#30340;&#36135;&#24065;&#25919;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20197;&#20013;&#22830;&#38134;&#34892;&#25968;&#23383;&#36135;&#24065;&#30340;&#21457;&#23637;&#20026;&#35270;&#35282;&#65292;&#23558;&#20854;&#32435;&#20837;&#40077;&#22982;&#8212;&#25176;&#23486;&#36135;&#24065;&#38656;&#27714;&#29702;&#35770;&#26694;&#26550;&#65292;&#24314;&#31435;&#20102;&#20013;&#22830;&#38134;&#34892;&#25968;&#23383;&#36135;&#24065;&#19979;&#30340;&#20132;&#26131;&#36135;&#24065;&#38656;&#27714;&#27169;&#22411;&#65292;&#24182;&#23450;&#24615;&#20998;&#26512;&#20102;&#20013;&#22830;&#38134;&#34892;&#25968;&#23383;&#36135;&#24065;&#23545;&#20132;&#26131;&#36135;&#24065;&#38656;&#27714;&#30340;&#24433;&#21709;&#26426;&#21046;&#65307;&#21516;&#26102;&#65292;&#36873;&#25321;2010&#24180;&#33267;2022&#24180;&#30340;&#23395;&#24230;&#25968;&#25454;&#65292;&#36890;&#36807;ARDL&#27169;&#22411;&#27979;&#35797;&#20102;&#20013;&#22830;&#38134;&#34892;&#25968;&#23383;&#36135;&#24065;&#19982;&#20132;&#26131;&#36135;&#24065;&#38656;&#27714;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#36890;&#36807;ARDL&#27169;&#22411;&#65292;&#26816;&#39564;&#20102;&#20013;&#22830;&#38134;&#34892;&#25968;&#23383;&#36135;&#24065;&#38656;&#27714;&#19982;&#20132;&#26131;&#36135;&#24065;&#20043;&#38388;&#30340;&#38271;&#26399;&#22343;&#34913;&#21644;&#30701;&#26399;&#21160;&#24577;&#12290;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;&#20013;&#22830;&#38134;&#34892;&#25968;&#23383;&#36135;&#24065;&#30340;&#21457;&#34892;&#21644;&#27969;&#36890;&#23558;&#20250;&#20943;&#23569;&#23545;&#20132;&#26131;&#36135;&#24065;&#30340;&#38656;&#27714;&#12290;&#22312;&#29702;&#35770;&#20998;&#26512;&#21644;&#23454;&#35777;&#26816;&#39564;&#30340;&#22522;&#30784;&#19978;&#65292;&#26412;&#25991;&#25552;&#20986;&#22312;&#20013;&#22830;&#38134;&#34892;&#25968;&#23383;&#36135;&#24065;&#32972;&#26223;&#19979;&#65292;&#20013;&#22269;&#24212;&#25506;&#32034;&#26356;&#26377;&#25928;&#30340;&#36135;&#24065;&#25919;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper takes the development of Central bank digital currencies as a perspective, introduces it into the Baumol-Tobin money demand theoretical framework, establishes the transactional money demand model under Central bank Digital Currency, and qualitatively analyzes the influence mechanism of Central bank digital currencies on transactional money demand; meanwhile, quarterly data from 2010-2022 are selected to test the relationship between Central bank digital currencies and transactional money demand through the ARDL model. The long-run equilibrium and short-run dynamics between the demand for Central bank digital currencies and transactional currency are examined by ARDL model. The empirical results show that the issuance and circulation of Central bank digital currencies will reduce the demand for transactional money. Based on the theoretical analysis and empirical test, this paper proposes that China should explore a more effective Currency policy in the context of Central bank
&lt;/p&gt;</description></item><item><title>SpotV2Net&#26159;&#19968;&#31181;&#22522;&#20110;&#22270;&#27880;&#24847;&#21147;&#32593;&#32476;&#30340;&#22810;&#20803;&#26085;&#20869;&#29616;&#36135;&#27874;&#21160;&#29575;&#39044;&#27979;&#27169;&#22411;&#65292;&#36890;&#36807;&#23558;&#37329;&#34701;&#36164;&#20135;&#34920;&#31034;&#20026;&#22270;&#20013;&#30340;&#33410;&#28857;&#65292;&#24182;&#32771;&#34385;&#38750;&#21442;&#25968;&#39640;&#39057;&#20613;&#37324;&#21494;&#20272;&#35745;&#30340;&#29616;&#36135;&#27874;&#21160;&#29575;&#21644;&#20849;&#27874;&#21160;&#29575;&#20316;&#20026;&#33410;&#28857;&#29305;&#24449;&#65292;&#20197;&#21450;&#27874;&#21160;&#29575;&#21644;&#20849;&#27874;&#21160;&#29575;&#30340;&#20613;&#37324;&#21494;&#20272;&#35745;&#20316;&#20026;&#33410;&#28857;&#36793;&#32536;&#30340;&#29305;&#24449;&#65292;SpotV2Net&#26174;&#31034;&#20986;&#20102;&#25913;&#36827;&#30340;&#20934;&#30830;&#24615;&#65292;&#24182;&#19988;&#22312;&#26085;&#20869;&#22810;&#27493;&#39044;&#27979;&#26102;&#20445;&#25345;&#20102;&#20934;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.06249</link><description>&lt;p&gt;
SpotV2Net&#65306;&#22522;&#20110;Vol-of-Vol-Informed Graph Attention Networks&#30340;&#22810;&#20803;&#26085;&#20869;&#29616;&#36135;&#27874;&#21160;&#29575;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
SpotV2Net: Multivariate Intraday Spot Volatility Forecasting via Vol-of-Vol-Informed Graph Attention Networks. (arXiv:2401.06249v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.06249
&lt;/p&gt;
&lt;p&gt;
SpotV2Net&#26159;&#19968;&#31181;&#22522;&#20110;&#22270;&#27880;&#24847;&#21147;&#32593;&#32476;&#30340;&#22810;&#20803;&#26085;&#20869;&#29616;&#36135;&#27874;&#21160;&#29575;&#39044;&#27979;&#27169;&#22411;&#65292;&#36890;&#36807;&#23558;&#37329;&#34701;&#36164;&#20135;&#34920;&#31034;&#20026;&#22270;&#20013;&#30340;&#33410;&#28857;&#65292;&#24182;&#32771;&#34385;&#38750;&#21442;&#25968;&#39640;&#39057;&#20613;&#37324;&#21494;&#20272;&#35745;&#30340;&#29616;&#36135;&#27874;&#21160;&#29575;&#21644;&#20849;&#27874;&#21160;&#29575;&#20316;&#20026;&#33410;&#28857;&#29305;&#24449;&#65292;&#20197;&#21450;&#27874;&#21160;&#29575;&#21644;&#20849;&#27874;&#21160;&#29575;&#30340;&#20613;&#37324;&#21494;&#20272;&#35745;&#20316;&#20026;&#33410;&#28857;&#36793;&#32536;&#30340;&#29305;&#24449;&#65292;SpotV2Net&#26174;&#31034;&#20986;&#20102;&#25913;&#36827;&#30340;&#20934;&#30830;&#24615;&#65292;&#24182;&#19988;&#22312;&#26085;&#20869;&#22810;&#27493;&#39044;&#27979;&#26102;&#20445;&#25345;&#20102;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#22270;&#27880;&#24847;&#21147;&#32593;&#32476;&#32467;&#26500;&#30340;&#22810;&#20803;&#26085;&#20869;&#29616;&#36135;&#27874;&#21160;&#29575;&#39044;&#27979;&#27169;&#22411;SpotV2Net&#12290;SpotV2Net&#23558;&#37329;&#34701;&#36164;&#20135;&#34920;&#31034;&#20026;&#22270;&#20013;&#30340;&#33410;&#28857;&#65292;&#24182;&#23558;&#29616;&#36135;&#27874;&#21160;&#29575;&#21644;&#20849;&#27874;&#21160;&#29575;&#30340;&#38750;&#21442;&#25968;&#39640;&#39057;&#20613;&#37324;&#21494;&#20272;&#35745;&#20316;&#20026;&#33410;&#28857;&#29305;&#24449;&#12290;&#27492;&#22806;&#65292;&#23427;&#36824;&#23558;&#27874;&#21160;&#29575;&#30340;&#20613;&#37324;&#21494;&#20272;&#35745;&#21644;&#27874;&#21160;&#29575;&#30340;&#20849;&#27874;&#21160;&#29575;&#20316;&#20026;&#33410;&#28857;&#36793;&#32536;&#30340;&#29305;&#24449;&#12290;&#25105;&#20204;&#20351;&#29992;&#36947;&#29756;&#26031;&#24037;&#19994;&#25351;&#25968;&#25104;&#20998;&#32929;&#30340;&#39640;&#39057;&#20215;&#26684;&#36827;&#34892;&#20102;&#22823;&#37327;&#30340;&#23454;&#35777;&#23454;&#39564;&#26469;&#27979;&#35797;SpotV2Net&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#12290;&#25105;&#20204;&#24471;&#21040;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#19982;&#20854;&#20182;&#35745;&#37327;&#32463;&#27982;&#23398;&#21644;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30456;&#27604;&#65292;SpotV2Net&#26174;&#31034;&#20986;&#26356;&#39640;&#30340;&#20934;&#30830;&#24615;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#32467;&#26524;&#36824;&#34920;&#26126;&#65292;SpotV2Net&#22312;&#36827;&#34892;&#26085;&#20869;&#22810;&#27493;&#39044;&#27979;&#26102;&#20445;&#25345;&#20934;&#30830;&#24615;&#12290;&#20026;&#20102;&#35299;&#37322;SpotV2Net&#20135;&#29983;&#30340;&#39044;&#27979;&#32467;&#26524;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;GNNExplainer&#65292;&#36825;&#26159;&#19968;&#20010;&#19982;&#27169;&#22411;&#26080;&#20851;&#30340;&#21487;&#35299;&#37322;&#24615;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper introduces SpotV2Net, a multivariate intraday spot volatility forecasting model based on a Graph Attention Network architecture. SpotV2Net represents financial assets as nodes within a graph and includes non-parametric high-frequency Fourier estimates of the spot volatility and co-volatility as node features. Further, it incorporates Fourier estimates of the spot volatility of volatility and co-volatility of volatility as features for node edges. We test the forecasting accuracy of SpotV2Net in an extensive empirical exercise, conducted with high-frequency prices of the components of the Dow Jones Industrial Average index. The results we obtain suggest that SpotV2Net shows improved accuracy, compared to alternative econometric and machine-learning-based models. Further, our results show that SpotV2Net maintains accuracy when performing intraday multi-step forecasts. To interpret the forecasts produced by SpotV2Net, we employ GNNExplainer, a model-agnostic interpretability to
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#37329;&#34701;&#39046;&#22495;&#21487;&#25193;&#23637;&#34892;&#20026;&#30340;CNN-DRL&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#36807;&#21435;&#20061;&#21313;&#22825;&#30340;&#27599;&#26085;&#29305;&#24449;&#21521;&#37327;&#25968;&#25454;&#25340;&#25509;&#21040;CNN&#36755;&#20837;&#30697;&#38453;&#20013;&#65292;&#23454;&#29616;&#20102;&#23545;&#29615;&#22659;&#21160;&#24577;&#30340;&#26377;&#25928;&#23398;&#20064;&#65292;&#33719;&#24471;&#20102;&#22870;&#21169;&#30340;&#22686;&#21152;&#12290;</title><link>http://arxiv.org/abs/2401.06179</link><description>&lt;p&gt;
&#37329;&#34701;&#39046;&#22495;&#21487;&#25193;&#23637;&#34892;&#20026;&#30340;CNN-DRL&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
CNN-DRL for Scalable Actions in Finance. (arXiv:2401.06179v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.06179
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#37329;&#34701;&#39046;&#22495;&#21487;&#25193;&#23637;&#34892;&#20026;&#30340;CNN-DRL&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#36807;&#21435;&#20061;&#21313;&#22825;&#30340;&#27599;&#26085;&#29305;&#24449;&#21521;&#37327;&#25968;&#25454;&#25340;&#25509;&#21040;CNN&#36755;&#20837;&#30697;&#38453;&#20013;&#65292;&#23454;&#29616;&#20102;&#23545;&#29615;&#22659;&#21160;&#24577;&#30340;&#26377;&#25928;&#23398;&#20064;&#65292;&#33719;&#24471;&#20102;&#22870;&#21169;&#30340;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#37329;&#34701;&#39046;&#22495;&#65292;&#22522;&#20110;MLP&#30340;DRL&#22312;&#21160;&#20316;&#35268;&#27169;&#22686;&#38271;&#26102;&#38590;&#20197;&#23398;&#20064;&#29615;&#22659;&#21160;&#24577;&#12290;&#22914;&#26524;&#20080;&#21334;&#37327;&#22686;&#21152;&#21040;&#19968;&#21315;&#32929;&#65292;MLP&#20195;&#29702;&#26080;&#27861;&#26377;&#25928;&#36866;&#24212;&#29615;&#22659;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#20010;CNN&#20195;&#29702;&#65292;&#23558;&#36807;&#21435;&#20061;&#21313;&#22825;&#30340;&#27599;&#26085;&#29305;&#24449;&#21521;&#37327;&#25968;&#25454;&#25340;&#25509;&#36215;&#26469;&#21019;&#24314;CNN&#36755;&#20837;&#30697;&#38453;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#22522;&#20110;MLP&#30340;&#20195;&#29702;&#22312;&#21021;&#22987;&#29615;&#22659;&#35774;&#32622;&#19978;&#36973;&#21463;&#25439;&#22833;&#65292;&#32780;&#25105;&#20204;&#35774;&#35745;&#30340;CNN&#20173;&#28982;&#31283;&#23450;&#65292;&#26377;&#25928;&#22320;&#23398;&#20064;&#29615;&#22659;&#65292;&#24182;&#23548;&#33268;&#22870;&#21169;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;
The published MLP-based DRL in finance has difficulties in learning the dynamics of the environment when the action scale increases. If the buying and selling increase to one thousand shares, the MLP agent will not be able to effectively adapt to the environment. To address this, we designed a CNN agent that concatenates the data from the last ninety days of the daily feature vector to create the CNN input matrix. Our extensive experiments demonstrate that the MLP-based agent experiences a loss corresponding to the initial environment setup, while our designed CNN remains stable, effectively learns the environment, and leads to an increase in rewards.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#39044;&#27979;&#32929;&#24066;&#21361;&#26426;&#20107;&#20214;&#65292;&#20027;&#35201;&#38024;&#23545;&#32654;&#22269;&#24066;&#22330;&#12290;&#35770;&#25991;&#27604;&#36739;&#20102;&#38543;&#26426;&#26862;&#26519;&#21644;&#26497;&#38480;&#26799;&#24230;&#25552;&#21319;&#27169;&#22411;&#30340;&#24615;&#33021;&#65292;&#21457;&#29616;&#36825;&#20004;&#31181;&#27169;&#22411;&#21487;&#20197;&#26377;&#25928;&#39044;&#27979;&#32929;&#24066;&#21361;&#26426;&#12290;</title><link>http://arxiv.org/abs/2401.06172</link><description>&lt;p&gt;
&#21361;&#26426;&#35686;&#25253;&#65306;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#39044;&#27979;&#32929;&#24066;&#21361;&#26426;&#20107;&#20214;
&lt;/p&gt;
&lt;p&gt;
CRISIS ALERT:Forecasting Stock Market Crisis Events Using Machine Learning Methods. (arXiv:2401.06172v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.06172
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#39044;&#27979;&#32929;&#24066;&#21361;&#26426;&#20107;&#20214;&#65292;&#20027;&#35201;&#38024;&#23545;&#32654;&#22269;&#24066;&#22330;&#12290;&#35770;&#25991;&#27604;&#36739;&#20102;&#38543;&#26426;&#26862;&#26519;&#21644;&#26497;&#38480;&#26799;&#24230;&#25552;&#21319;&#27169;&#22411;&#30340;&#24615;&#33021;&#65292;&#21457;&#29616;&#36825;&#20004;&#31181;&#27169;&#22411;&#21487;&#20197;&#26377;&#25928;&#39044;&#27979;&#32929;&#24066;&#21361;&#26426;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21382;&#21490;&#19978;&#65292;&#32463;&#27982;&#34928;&#36864;&#24448;&#24448;&#31361;&#28982;&#32780;&#28798;&#38590;&#24615;&#12290;&#20363;&#22914;&#65292;&#22312;2008&#24180;&#37329;&#34701;&#21361;&#26426;&#26399;&#38388;&#65292;&#26631;&#26222;500&#25351;&#25968;&#20174;2007&#24180;10&#26376;&#19979;&#36300;&#20102;46&#65285;&#65292;&#25345;&#32493;&#21040;2009&#24180;3&#26376;&#12290;&#22914;&#26524;&#25105;&#20204;&#33021;&#26089;&#20123;&#21457;&#29616;&#21361;&#26426;&#30340;&#20449;&#21495;&#65292;&#25105;&#20204;&#23601;&#33021;&#37319;&#21462;&#39044;&#38450;&#25514;&#26045;&#12290;&#22240;&#27492;&#65292;&#21463;&#21040;&#36825;&#26679;&#30340;&#21160;&#26426;&#39537;&#20351;&#65292;&#25105;&#20204;&#20351;&#29992;&#20808;&#36827;&#30340;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#65292;&#21253;&#25324;&#38543;&#26426;&#26862;&#26519;&#21644;&#26497;&#38480;&#26799;&#24230;&#25552;&#21319;&#65292;&#20027;&#35201;&#39044;&#27979;&#32654;&#22269;&#24066;&#22330;&#21487;&#33021;&#21457;&#29983;&#30340;&#20219;&#20309;&#28508;&#22312;&#24066;&#22330;&#23849;&#30424;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#24819;&#27604;&#36739;&#36825;&#20123;&#26041;&#27861;&#30340;&#24615;&#33021;&#65292;&#24182;&#26816;&#26597;&#21738;&#31181;&#27169;&#22411;&#26356;&#36866;&#21512;&#39044;&#27979;&#32654;&#22269;&#32929;&#24066;&#26292;&#36300;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#27169;&#22411;&#24212;&#29992;&#20110;&#27599;&#26085;&#37329;&#34701;&#24066;&#22330;&#25968;&#25454;&#65292;&#36825;&#20123;&#25968;&#25454;&#23545;&#20110;&#26356;&#39640;&#30340;&#25253;&#21578;&#39057;&#29575;&#26356;&#20855;&#21709;&#24212;&#24615;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;75&#20010;&#35299;&#37322;&#21464;&#37327;&#65292;&#21253;&#25324;&#24635;&#20307;&#32654;&#22269;&#32929;&#24066;&#25351;&#25968;&#65292;&#26631;&#26222;500&#37096;&#38376;&#25351;&#25968;&#65292;&#20197;&#21450;&#21487;&#29992;&#20110;&#21361;&#26426;&#39044;&#27979;&#30446;&#30340;&#30340;&#24066;&#22330;&#25351;&#26631;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#36873;&#25321;&#30340;&#20998;&#31867;&#25351;&#26631;&#24471;&#20986;&#32467;&#35770;&#65292;&#21363;&#20351;&#29992;&#38543;&#26426;&#26862;&#26519;&#21644;&#26497;&#38480;&#26799;&#24230;&#25552;&#21319;&#27169;&#22411;&#21487;&#20197;&#26377;&#25928;&#39044;&#27979;&#32929;&#24066;&#21361;&#26426;&#20107;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
Historically, the economic recession often came abruptly and disastrously. For instance, during the 2008 financial crisis, the SP 500 fell 46 percent from October 2007 to March 2009. If we could detect the signals of the crisis earlier, we could have taken preventive measures. Therefore, driven by such motivation, we use advanced machine learning techniques, including Random Forest and Extreme Gradient Boosting, to predict any potential market crashes mainly in the US market. Also, we would like to compare the performance of these methods and examine which model is better for forecasting US stock market crashes. We apply our models on the daily financial market data, which tend to be more responsive with higher reporting frequencies. We consider 75 explanatory variables, including general US stock market indexes, SP 500 sector indexes, as well as market indicators that can be used for the purpose of crisis prediction. Finally, we conclude, with selected classification metrics, that the
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#39033;&#22312;&#37329;&#34701;&#25237;&#36164;&#39046;&#22495;&#30340;&#21464;&#38761;&#24615;&#20030;&#25514;&#65292;&#26088;&#22312;&#21033;&#29992;&#22810;&#27169;&#24577;Gen-AI&#25216;&#26415;&#33258;&#21160;&#21270;&#20449;&#24687;&#25688;&#35201;&#21644;&#25237;&#36164;&#28857;&#29983;&#25104;&#65292;&#36890;&#36807;&#31934;&#32454;&#35843;&#25972;&#35821;&#35328;&#27169;&#22411;&#20197;&#23454;&#29616;&#29305;&#23450;&#30340;&#24212;&#29992;&#30446;&#26631;&#65292;&#24182;&#26368;&#32456;&#24320;&#21457;&#19968;&#20010;AI&#20195;&#29702;&#21407;&#22411;&#65292;&#20351;&#20154;&#31867;&#25237;&#36164;&#32773;&#25670;&#33073;&#37325;&#22797;&#24615;&#20219;&#21153;&#65292;&#23558;&#27880;&#24847;&#21147;&#38598;&#20013;&#22312;&#39640;&#23618;&#27425;&#30340;&#25112;&#30053;&#24605;&#32500;&#19978;&#12290;</title><link>http://arxiv.org/abs/2401.06164</link><description>&lt;p&gt;
&#22810;&#27169;&#24577;Gen-AI&#29992;&#20110;&#22522;&#26412;&#25237;&#36164;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Multimodal Gen-AI for Fundamental Investment Research. (arXiv:2401.06164v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.06164
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#39033;&#22312;&#37329;&#34701;&#25237;&#36164;&#39046;&#22495;&#30340;&#21464;&#38761;&#24615;&#20030;&#25514;&#65292;&#26088;&#22312;&#21033;&#29992;&#22810;&#27169;&#24577;Gen-AI&#25216;&#26415;&#33258;&#21160;&#21270;&#20449;&#24687;&#25688;&#35201;&#21644;&#25237;&#36164;&#28857;&#29983;&#25104;&#65292;&#36890;&#36807;&#31934;&#32454;&#35843;&#25972;&#35821;&#35328;&#27169;&#22411;&#20197;&#23454;&#29616;&#29305;&#23450;&#30340;&#24212;&#29992;&#30446;&#26631;&#65292;&#24182;&#26368;&#32456;&#24320;&#21457;&#19968;&#20010;AI&#20195;&#29702;&#21407;&#22411;&#65292;&#20351;&#20154;&#31867;&#25237;&#36164;&#32773;&#25670;&#33073;&#37325;&#22797;&#24615;&#20219;&#21153;&#65292;&#23558;&#27880;&#24847;&#21147;&#38598;&#20013;&#22312;&#39640;&#23618;&#27425;&#30340;&#25112;&#30053;&#24605;&#32500;&#19978;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25253;&#21578;&#27010;&#36848;&#20102;&#22312;&#37329;&#34701;&#25237;&#36164;&#39046;&#22495;&#30340;&#19968;&#39033;&#21464;&#38761;&#24615;&#20030;&#25514;&#65292;&#21363;&#37325;&#22609;&#20256;&#32479;&#30340;&#20915;&#31574;&#36807;&#31243;&#65292;&#24182;&#22312;&#20854;&#20013;&#33258;&#21160;&#21270;&#20449;&#24687;&#25688;&#35201;&#21644;&#25237;&#36164;&#28857;&#29983;&#25104;&#31561;&#20219;&#21153;&#12290;&#36890;&#36807;&#21033;&#29992;&#35821;&#35328;&#27169;&#22411;&#65292;&#25105;&#20204;&#30340;&#23454;&#39564;&#26088;&#22312;&#35780;&#20272;&#22312;&#22522;&#30784;&#27169;&#22411;&#65288;Llama2&#65289;&#19978;&#36827;&#34892;&#31934;&#35843;&#20197;&#23454;&#29616;&#29305;&#23450;&#30340;&#24212;&#29992;&#30446;&#26631;&#65292;&#21253;&#25324;&#25552;&#20379;&#20851;&#20110;&#20107;&#20214;&#23545;&#20844;&#21496;&#21644;&#34892;&#19994;&#30340;&#24433;&#21709;&#30340;&#27934;&#23519;&#65292;&#29702;&#35299;&#24066;&#22330;&#26465;&#20214;&#20851;&#31995;&#65292;&#29983;&#25104;&#19982;&#25237;&#36164;&#32773;&#23545;&#40784;&#30340;&#25237;&#36164;&#28857;&#65292;&#24182;&#20197;&#32929;&#31080;&#24314;&#35758;&#21644;&#35814;&#32454;&#35299;&#37322;&#30340;&#24418;&#24335;&#21576;&#29616;&#32467;&#26524;&#12290;&#36890;&#36807;&#20808;&#36827;&#30340;&#29983;&#25104;&#24314;&#27169;&#25216;&#26415;&#65292;&#26368;&#32456;&#30446;&#26631;&#26159;&#24320;&#21457;&#19968;&#20010;AI&#20195;&#29702;&#21407;&#22411;&#65292;&#20351;&#20154;&#31867;&#25237;&#36164;&#32773;&#25670;&#33073;&#37325;&#22797;&#24615;&#20219;&#21153;&#65292;&#23558;&#27880;&#24847;&#21147;&#38598;&#20013;&#22312;&#39640;&#23618;&#27425;&#30340;&#25112;&#30053;&#24605;&#32500;&#19978;&#12290;&#35813;&#39033;&#30446;&#28085;&#30422;&#20102;&#19968;&#20010;&#22810;&#26679;&#21270;&#30340;&#35821;&#26009;&#24211;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
This report outlines a transformative initiative in the financial investment industry, where the conventional decision-making process, laden with labor-intensive tasks such as sifting through voluminous documents, is being reimagined. Leveraging language models, our experiments aim to automate information summarization and investment idea generation. We seek to evaluate the effectiveness of fine-tuning methods on a base model (Llama2) to achieve specific application-level goals, including providing insights into the impact of events on companies and sectors, understanding market condition relationships, generating investor-aligned investment ideas, and formatting results with stock recommendations and detailed explanations. Through state-of-the-art generative modeling techniques, the ultimate objective is to develop an AI agent prototype, liberating human investors from repetitive tasks and allowing a focus on high-level strategic thinking. The project encompasses a diverse corpus data
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#22797;&#26434;&#32593;&#32476;&#20998;&#26512;&#65292;&#26412;&#30740;&#31350;&#27604;&#36739;&#20998;&#26512;&#20102;&#22696;&#35199;&#21733;&#29926;&#21152;&#26031;&#24030;&#12289;&#38463;&#26681;&#24311;&#25289;&#26222;&#25289;&#22612;&#21644;&#26234;&#21033;&#38463;&#21171;&#21345;&#23612;&#20122;&#22320;&#21306;&#30340;&#22522;&#23618;&#21019;&#26032;&#21442;&#19982;&#32773;&#22312;&#32463;&#27982;&#29983;&#24577;&#31995;&#32479;&#20013;&#30340;&#35282;&#33394;&#65292;&#21457;&#29616;&#22522;&#23618;&#21019;&#26032;&#21442;&#19982;&#32773;&#22312;&#25972;&#20307;&#21019;&#26032;&#39537;&#21160;&#30340;&#20225;&#19994;&#32463;&#27982;&#29983;&#24577;&#31995;&#32479;&#20013;&#21344;&#25454;&#37325;&#35201;&#20301;&#32622;&#65292;&#19988;&#20855;&#26377;&#25112;&#30053;&#22320;&#20301;&#65292;&#24182;&#24378;&#35843;&#20102;&#26356;&#22909;&#25972;&#21512;&#20182;&#20204;&#20197;&#20419;&#36827;&#31038;&#32463;&#21457;&#23637;&#30340;&#28508;&#21147;&#12290;</title><link>http://arxiv.org/abs/2401.06163</link><description>&lt;p&gt;
&#22522;&#23618;&#21019;&#26032;&#21442;&#19982;&#32773;&#65306;&#20182;&#20204;&#22312;&#32463;&#27982;&#29983;&#24577;&#31995;&#32479;&#20013;&#30340;&#35282;&#33394;&#21644;&#23450;&#20301;--&#19968;&#39033;&#36890;&#36807;&#22797;&#26434;&#32593;&#32476;&#20998;&#26512;&#30340;&#27604;&#36739;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Grassroots Innovation Actors: Their Role and Positioning in Economic Ecosystems -- A Comparative Study Through Complex Network Analysis. (arXiv:2401.06163v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.06163
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#22797;&#26434;&#32593;&#32476;&#20998;&#26512;&#65292;&#26412;&#30740;&#31350;&#27604;&#36739;&#20998;&#26512;&#20102;&#22696;&#35199;&#21733;&#29926;&#21152;&#26031;&#24030;&#12289;&#38463;&#26681;&#24311;&#25289;&#26222;&#25289;&#22612;&#21644;&#26234;&#21033;&#38463;&#21171;&#21345;&#23612;&#20122;&#22320;&#21306;&#30340;&#22522;&#23618;&#21019;&#26032;&#21442;&#19982;&#32773;&#22312;&#32463;&#27982;&#29983;&#24577;&#31995;&#32479;&#20013;&#30340;&#35282;&#33394;&#65292;&#21457;&#29616;&#22522;&#23618;&#21019;&#26032;&#21442;&#19982;&#32773;&#22312;&#25972;&#20307;&#21019;&#26032;&#39537;&#21160;&#30340;&#20225;&#19994;&#32463;&#27982;&#29983;&#24577;&#31995;&#32479;&#20013;&#21344;&#25454;&#37325;&#35201;&#20301;&#32622;&#65292;&#19988;&#20855;&#26377;&#25112;&#30053;&#22320;&#20301;&#65292;&#24182;&#24378;&#35843;&#20102;&#26356;&#22909;&#25972;&#21512;&#20182;&#20204;&#20197;&#20419;&#36827;&#31038;&#32463;&#21457;&#23637;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23545;&#22522;&#23618;&#21019;&#26032;&#21442;&#19982;&#32773;&#21450;&#20854;&#22312;&#26356;&#22823;&#32463;&#27982;&#29983;&#24577;&#31995;&#32479;&#20013;&#30340;&#25972;&#21512;&#36827;&#34892;&#20102;&#32771;&#23519;&#12290;&#36890;&#36807;&#22312;&#22696;&#35199;&#21733;&#29926;&#21152;&#26031;&#24030;&#12289;&#38463;&#26681;&#24311;&#25289;&#26222;&#25289;&#22612;&#21644;&#26234;&#21033;&#38463;&#21171;&#21345;&#23612;&#20122;&#22320;&#21306;&#36827;&#34892;&#27604;&#36739;&#20998;&#26512;&#65292;&#36825;&#39033;&#30740;&#31350;&#25581;&#31034;&#20102;&#22522;&#23618;&#21019;&#26032;&#22312;&#26356;&#24191;&#27867;&#32463;&#27982;&#29983;&#24577;&#31995;&#32479;&#20013;&#25152;&#36215;&#30340;&#37325;&#35201;&#20316;&#29992;&#12290;&#21033;&#29992;&#22797;&#26434;&#32593;&#32476;&#20998;&#26512;&#21644;TE-SER&#27169;&#22411;&#65292;&#30740;&#31350;&#25581;&#31034;&#20102;&#36825;&#20123;&#21442;&#19982;&#32773;&#22312;&#22797;&#26434;&#31038;&#20250;&#25361;&#25112;&#29615;&#22659;&#19979;&#22914;&#20309;&#30456;&#20114;&#20316;&#29992;&#12289;&#21512;&#20316;&#21644;&#24433;&#21709;&#20027;&#35201;&#32463;&#27982;&#29983;&#24577;&#31995;&#32479;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#22522;&#23618;&#21019;&#26032;&#29983;&#24577;&#31995;&#32479;&#30340;&#21442;&#19982;&#32773;&#22312;&#25972;&#20010;&#20197;&#21019;&#26032;&#39537;&#21160;&#30340;&#20225;&#19994;&#32463;&#27982;&#29983;&#24577;&#31995;&#32479;&#20013;&#21344;&#25454;&#37325;&#35201;&#20301;&#32622;&#65292;&#19977;&#20010;&#26696;&#20363;&#20013;&#27604;&#20363;&#22312;20%&#33267;30%&#20043;&#38388;&#65292;&#24182;&#19988;&#22312;&#31995;&#32479;&#30340;&#32467;&#26500;&#32593;&#32476;&#20013;&#20855;&#26377;&#25112;&#30053;&#22320;&#20301;&#12290;&#27492;&#22806;&#65292;&#26412;&#30740;&#31350;&#24378;&#35843;&#20102;&#26356;&#22909;&#25972;&#21512;&#22522;&#23618;&#21019;&#26032;&#21442;&#19982;&#32773;&#20197;&#21033;&#29992;&#36164;&#28304;&#21644;&#20419;&#36827;&#31038;&#32463;&#21457;&#23637;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study offers an examination of grassroots innovation actors and their integration within larger economic ecosystems. Through a comparative analysis in Oaxaca, Mexico; La Plata, Argentina; and Araucania, Chile, this research sheds light on the vital role that grassroots innovation plays in broader economic ecosystems. Using Complex Network Analysis and the TE-SER model, the study unveils how these actors interact, collaborate, and influence major economic ecosystems in the context of complex social challenges. The findings highlight that actors from the grassroots innovation ecosystem make up a significant portion of the larger innovation-driven entrepreneurial economic ecosystem, accounting for between 20% and 30% in all three cases and are strategically positioned within the ecosystem's structural network. Additionally, this study emphasizes the potential for greater integration of grassroots innovation actors to leverage resources and foster socio-economic development. The resea
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#32479;&#35745;&#22330;&#24418;&#24335;&#20027;&#20041;&#65292;&#26412;&#25991;&#30740;&#31350;&#20102;&#36164;&#26412;&#22312;&#19981;&#21516;&#37096;&#38376;&#20043;&#38388;&#30340;&#31215;&#32047;&#21644;&#20998;&#37197;&#12290;&#32467;&#26524;&#21457;&#29616;&#65292;&#37329;&#34701;&#36164;&#26412;&#19982;&#32929;&#24687;&#21644;&#32929;&#31080;&#20272;&#20540;&#30456;&#20851;&#65292;&#32780;&#23454;&#29289;&#36164;&#26412;&#19982;&#37329;&#34701;&#37096;&#38376;&#30340;&#36164;&#26412;&#20998;&#37197;&#30456;&#20851;&#12290;</title><link>http://arxiv.org/abs/2401.06142</link><description>&lt;p&gt;
&#23545;&#36164;&#26412;&#20998;&#37197;&#21644;&#31215;&#32047;&#30340;&#32479;&#35745;&#22330;&#35270;&#35282;&#65306;&#20010;&#20307;&#21160;&#21147;&#23398;
&lt;/p&gt;
&lt;p&gt;
A Statistical Field Perspective on Capital Allocation and Accumulation: Individual dynamics. (arXiv:2401.06142v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.06142
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#32479;&#35745;&#22330;&#24418;&#24335;&#20027;&#20041;&#65292;&#26412;&#25991;&#30740;&#31350;&#20102;&#36164;&#26412;&#22312;&#19981;&#21516;&#37096;&#38376;&#20043;&#38388;&#30340;&#31215;&#32047;&#21644;&#20998;&#37197;&#12290;&#32467;&#26524;&#21457;&#29616;&#65292;&#37329;&#34701;&#36164;&#26412;&#19982;&#32929;&#24687;&#21644;&#32929;&#31080;&#20272;&#20540;&#30456;&#20851;&#65292;&#32780;&#23454;&#29289;&#36164;&#26412;&#19982;&#37329;&#34701;&#37096;&#38376;&#30340;&#36164;&#26412;&#20998;&#37197;&#30456;&#20851;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22312;&#19968;&#31995;&#21015;&#25991;&#31456;&#20013;&#34920;&#26126;&#65292;&#23545;&#22823;&#37327;&#32463;&#27982;&#20027;&#20307;&#30340;&#32463;&#20856;&#25551;&#36848;&#21487;&#20197;&#29992;&#32479;&#35745;&#22330;&#24418;&#24335;&#20027;&#20041;&#26469;&#26367;&#20195;&#12290;&#20026;&#20102;&#26356;&#22909;&#22320;&#29702;&#35299;&#19981;&#21516;&#37096;&#38376;&#20043;&#38388;&#30340;&#36164;&#26412;&#31215;&#32047;&#21644;&#20998;&#37197;&#65292;&#26412;&#25991;&#23558;&#36825;&#31181;&#32479;&#35745;&#22330;&#25551;&#36848;&#24212;&#29992;&#20110;&#30001;&#22823;&#37327;&#24322;&#36136;&#20010;&#20307;&#20998;&#20026;&#20004;&#32452;&#30340;&#24773;&#20917;&#12290;&#31532;&#19968;&#32452;&#30001;&#19981;&#21516;&#37096;&#38376;&#30340;&#22823;&#37327;&#20225;&#19994;&#32452;&#25104;&#65292;&#20182;&#20204;&#20849;&#21516;&#25317;&#26377;&#20840;&#37096;&#23454;&#29289;&#36164;&#26412;&#12290;&#31532;&#20108;&#32452;&#21017;&#26159;&#25237;&#36164;&#32773;&#65292;&#25345;&#26377;&#20840;&#37096;&#37329;&#34701;&#36164;&#26412;&#65292;&#24182;&#26681;&#25454;&#25237;&#36164;&#20559;&#22909;&#12289;&#39044;&#26399;&#25910;&#30410;&#21644;&#37329;&#34701;&#24066;&#22330;&#19978;&#30340;&#32929;&#20215;&#21464;&#21160;&#23558;&#20854;&#20998;&#37197;&#32473;&#19981;&#21516;&#37096;&#38376;&#30340;&#20225;&#19994;&#12290;&#20316;&#20026;&#22238;&#25253;&#65292;&#20225;&#19994;&#21521;&#25237;&#36164;&#32773;&#25903;&#20184;&#32929;&#24687;&#12290;&#37329;&#34701;&#36164;&#26412;&#22240;&#27492;&#26159;&#32929;&#24687;&#21644;&#32929;&#31080;&#20272;&#20540;&#30340;&#20989;&#25968;&#65292;&#32780;&#23454;&#29289;&#36164;&#26412;&#21017;&#26159;&#30001;&#37329;&#34701;&#37096;&#38376;&#20998;&#37197;&#30340;&#24635;&#36164;&#26412;&#30340;&#20989;&#25968;&#12290;&#32780;&#25105;&#20204;&#20197;&#21069;&#30340;&#24037;&#20316;&#21017;&#20391;&#37325;&#20110;&#32972;&#26223;&#22330;&#12290;
&lt;/p&gt;
&lt;p&gt;
We have shown, in a series of articles, that a classical description of a large number of economic agents can be replaced by a statistical fields formalism. To better understand the accumulation and allocation of capital among different sectors, the present paper applies this statistical fields description to a large number of heterogeneous agents divided into two groups. The first group is composed of a large number of firms in different sectors that collectively own the entire physical capital. The second group, investors, holds the entire financial capital and allocates it between firms across sectors according to investment preferences, expected returns, and stock prices variations on financial markets. In return, firms pay dividends to their investors. Financial capital is thus a function of dividends and stock valuations, whereas physical capital is a function of the total capital allocated by the financial sector. Whereas our previous work focused on the background fields that d
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#30452;&#25509;&#36164;&#26412;&#29616;&#37329;&#36716;&#31227;&#23545;&#20110;&#36139;&#22256;&#21644;&#26497;&#31471;&#36139;&#22256;&#30340;&#20943;&#36731;&#20316;&#29992;&#12290;&#36890;&#36807;&#27169;&#25311;&#23478;&#24237;&#36164;&#26412;&#30340;Omega&#39118;&#38505;&#36807;&#31243;&#65292;&#21457;&#29616;&#22312;&#36164;&#26412;&#27700;&#24179;&#20302;&#20110;&#19968;&#23450;&#27700;&#24179;&#26102;&#65292;&#22806;&#37096;&#25903;&#25345;&#20197;&#30452;&#25509;&#36716;&#31227;&#24418;&#24335;&#25552;&#20379;&#65292;&#20197;&#24110;&#21161;&#23478;&#24237;&#25670;&#33073;&#36139;&#22256;&#38519;&#38449;&#12290;</title><link>http://arxiv.org/abs/2401.06141</link><description>&lt;p&gt;
&#30452;&#25509;&#36164;&#26412;&#29616;&#37329;&#36716;&#31227;&#23545;&#20110;&#36139;&#22256;&#21644;&#26497;&#31471;&#36139;&#22256;&#20943;&#36731;&#30340;&#20316;&#29992; -- &#19968;&#31181;Omega&#39118;&#38505;&#36807;&#31243;
&lt;/p&gt;
&lt;p&gt;
The Role of Direct Capital Cash Transfers Towards Poverty and Extreme Poverty Alleviation -- An Omega Risk Process. (arXiv:2401.06141v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.06141
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#30452;&#25509;&#36164;&#26412;&#29616;&#37329;&#36716;&#31227;&#23545;&#20110;&#36139;&#22256;&#21644;&#26497;&#31471;&#36139;&#22256;&#30340;&#20943;&#36731;&#20316;&#29992;&#12290;&#36890;&#36807;&#27169;&#25311;&#23478;&#24237;&#36164;&#26412;&#30340;Omega&#39118;&#38505;&#36807;&#31243;&#65292;&#21457;&#29616;&#22312;&#36164;&#26412;&#27700;&#24179;&#20302;&#20110;&#19968;&#23450;&#27700;&#24179;&#26102;&#65292;&#22806;&#37096;&#25903;&#25345;&#20197;&#30452;&#25509;&#36716;&#31227;&#24418;&#24335;&#25552;&#20379;&#65292;&#20197;&#24110;&#21161;&#23478;&#24237;&#25670;&#33073;&#36139;&#22256;&#38519;&#38449;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22256;&#22659;&#25351;&#30340;&#26159;&#23478;&#24237;&#38519;&#20837;&#36139;&#22256;&#21306;&#22495;&#30340;&#24773;&#20917;&#12290;&#29983;&#27963;&#22312;&#36139;&#22256;&#21306;&#22495;&#25110;&#38519;&#20837;&#36139;&#22256;&#21306;&#22495;&#30340;&#23478;&#24237;&#34987;&#31216;&#20026;&#36139;&#22256;&#38519;&#38449;&#30340;&#23478;&#24237;&#65292;&#36139;&#22256;&#38519;&#38449;&#26159;&#19968;&#31181;&#22312;&#27809;&#26377;&#22806;&#37096;&#24110;&#21161;&#30340;&#24773;&#20917;&#19979;&#38590;&#20197;&#36867;&#33073;&#30340;&#36139;&#22256;&#29366;&#24577;&#12290;&#21516;&#26679;&#65292;&#26497;&#31471;&#36139;&#22256;&#34987;&#35748;&#20026;&#26159;&#26368;&#20005;&#37325;&#30340;&#36139;&#22256;&#24418;&#24335;&#65292;&#23478;&#24237;&#22312;&#20854;&#20013;&#32463;&#21382;&#20005;&#37325;&#30340;&#22522;&#26412;&#20154;&#31867;&#38656;&#27714;&#19981;&#36275;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#20855;&#26377;&#30830;&#23450;&#24615;&#22686;&#38271;&#21644;&#20056;&#24615;&#36339;&#36291;&#65288;&#23849;&#28291;&#65289;&#32467;&#26500;&#30340;Omega&#39118;&#38505;&#36807;&#31243;&#26469;&#27169;&#25311;&#23478;&#24237;&#30340;&#36164;&#26412;&#12290;&#20551;&#35774;&#24403;&#19968;&#20010;&#23478;&#24237;&#30340;&#36164;&#26412;&#27700;&#24179;&#39640;&#20110;&#30830;&#23450;&#36164;&#26412;&#22721;&#22418;&#27700;&#24179;&#26102;&#65292;&#30830;&#23450;&#23478;&#24237;&#26159;&#21542;&#26377;&#36164;&#26684;&#21442;&#21152;&#29616;&#37329;&#36164;&#26412;&#36716;&#31227;&#26041;&#26696;&#65292;&#20854;&#36164;&#26412;&#20250;&#25351;&#25968;&#22686;&#38271;&#12290;&#19968;&#26086;&#20854;&#36164;&#26412;&#38477;&#33267;&#36164;&#26412;&#22721;&#22418;&#27700;&#24179;&#20197;&#19979;&#65292;&#36164;&#26412;&#21160;&#24577;&#20250;&#24341;&#20837;&#30452;&#25509;&#36716;&#31227;&#65288;&#36164;&#26412;&#29616;&#37329;&#36716;&#31227;&#65289;&#30340;&#22806;&#37096;&#25903;&#25345;&#65292;&#36825;&#20123;&#25903;&#25345;&#30001;&#25424;&#21161;&#32773;&#25110;&#25919;&#24220;&#25552;&#20379;&#12290;&#21542;&#21017;
&lt;/p&gt;
&lt;p&gt;
Trapping refers to the event when a household falls into the area of poverty. Households that live or fall into the area of poverty are said to be in a poverty trap, where a poverty trap is a state of poverty from which it is difficult to escape without external help. Similarly, extreme poverty is considered as the most severe type of poverty, in which households experience severe deprivation of basic human needs. In this article, we consider an Omega risk process with deterministic growth and a multiplicative jump (collapse) structure to model the capital of a household. It is assumed that, when a household's capital level is above a certain capital barrier level that determines a household's eligibility for a capital cash transfer programme, its capital grows exponentially. As soon as its capital falls below the capital barrier level, the capital dynamics incorporate external support in the form of direct transfers (capital cash transfers) provided by donors or governments. Otherwise
&lt;/p&gt;</description></item><item><title>StockFormer&#26159;&#19968;&#31181;&#22522;&#20110;STL&#20998;&#35299;&#21644;&#33258;&#27880;&#24847;&#21147;&#32593;&#32476;&#30340;&#25670;&#21160;&#20132;&#26131;&#31574;&#30053;&#65292;&#20351;&#29992;TopKDropout&#26041;&#27861;&#26469;&#25552;&#39640;&#32929;&#31080;&#36873;&#21462;&#33021;&#21147;&#12290;&#22312;&#27979;&#35797;&#20013;&#65292;&#20854;&#39044;&#27979;&#32467;&#26524;&#20248;&#20110;&#20854;&#20182;&#21313;&#20010;&#34892;&#19994;&#27169;&#22411;&#65292;&#36798;&#21040;&#20102;62.39%&#30340;&#24066;&#22330;&#36235;&#21183;&#26816;&#27979;&#20934;&#30830;&#29575;&#65292;&#24182;&#21462;&#24471;&#20102;&#22312;&#20851;&#38190;&#39044;&#27979;&#20934;&#30830;&#24230;&#25351;&#26631;&#19978;&#30340;&#20248;&#31168;&#34920;&#29616;&#12290;&#22312;&#22238;&#27979;&#20013;&#65292;StockFormer&#30340;&#25670;&#21160;&#20132;&#26131;&#31574;&#30053;&#32047;&#35745;&#25910;&#30410;&#29575;&#20026;13.19%&#12290;</title><link>http://arxiv.org/abs/2401.06139</link><description>&lt;p&gt;
StockFormer: &#19968;&#31181;&#22522;&#20110;STL&#20998;&#35299;&#21644;&#33258;&#27880;&#24847;&#21147;&#32593;&#32476;&#30340;&#25670;&#21160;&#20132;&#26131;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
StockFormer: A Swing Trading Strategy Based on STL Decomposition and Self-Attention Networks. (arXiv:2401.06139v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.06139
&lt;/p&gt;
&lt;p&gt;
StockFormer&#26159;&#19968;&#31181;&#22522;&#20110;STL&#20998;&#35299;&#21644;&#33258;&#27880;&#24847;&#21147;&#32593;&#32476;&#30340;&#25670;&#21160;&#20132;&#26131;&#31574;&#30053;&#65292;&#20351;&#29992;TopKDropout&#26041;&#27861;&#26469;&#25552;&#39640;&#32929;&#31080;&#36873;&#21462;&#33021;&#21147;&#12290;&#22312;&#27979;&#35797;&#20013;&#65292;&#20854;&#39044;&#27979;&#32467;&#26524;&#20248;&#20110;&#20854;&#20182;&#21313;&#20010;&#34892;&#19994;&#27169;&#22411;&#65292;&#36798;&#21040;&#20102;62.39%&#30340;&#24066;&#22330;&#36235;&#21183;&#26816;&#27979;&#20934;&#30830;&#29575;&#65292;&#24182;&#21462;&#24471;&#20102;&#22312;&#20851;&#38190;&#39044;&#27979;&#20934;&#30830;&#24230;&#25351;&#26631;&#19978;&#30340;&#20248;&#31168;&#34920;&#29616;&#12290;&#22312;&#22238;&#27979;&#20013;&#65292;StockFormer&#30340;&#25670;&#21160;&#20132;&#26131;&#31574;&#30053;&#32047;&#35745;&#25910;&#30410;&#29575;&#20026;13.19%&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#25345;&#32493;&#30340;&#24066;&#22330;&#37325;&#26032;&#26657;&#20934;&#21644;&#25237;&#36164;&#32773;&#20048;&#35266;&#24773;&#32490;&#22686;&#21152;&#30340;&#32972;&#26223;&#19979;&#65292;&#32654;&#22269;&#32929;&#24066;&#27491;&#22312;&#32463;&#21382;&#22797;&#33487;&#65292;&#36825;&#20419;&#20351;&#25105;&#20204;&#38656;&#35201;&#19968;&#20123;&#20808;&#36827;&#30340;&#24037;&#20855;&#26469;&#20445;&#25252;&#21644;&#22686;&#38271;&#25237;&#36164;&#32452;&#21512;&#12290;&#38024;&#23545;&#36825;&#19968;&#38656;&#27714;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;"Stockformer"&#30340;&#20808;&#36827;&#28145;&#24230;&#23398;&#20064;&#26694;&#26550;&#65292;&#29992;&#20110;&#20248;&#21270;&#25670;&#21160;&#20132;&#26131;&#65292;&#24182;&#37319;&#29992;&#20102;TopKDropout&#26041;&#27861;&#26469;&#22686;&#24378;&#32929;&#31080;&#36873;&#21462;&#33021;&#21147;&#12290;&#36890;&#36807;&#25972;&#21512;STL&#20998;&#35299;&#21644;&#33258;&#27880;&#24847;&#21147;&#32593;&#32476;&#65292;Stockformer&#21033;&#29992;&#26631;&#26222;500&#30340;&#22797;&#26434;&#25968;&#25454;&#26469;&#25552;&#21319;&#32929;&#31080;&#25910;&#30410;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21253;&#25324;&#23558;&#25968;&#25454;&#20998;&#20026;&#35757;&#32451;&#21644;&#39564;&#35777;&#38598;&#65288;2021&#24180;1&#26376;&#33267;2023&#24180;1&#26376;&#65289;&#20197;&#21450;&#27979;&#35797;&#38598;&#65288;2023&#24180;2&#26376;&#33267;6&#26376;&#65289;&#12290;&#22312;&#27979;&#35797;&#26399;&#38388;&#65292;Stockformer&#30340;&#39044;&#27979;&#32467;&#26524;&#20248;&#20110;&#20854;&#20182;&#21313;&#20010;&#34892;&#19994;&#27169;&#22411;&#65292;&#22312;&#20851;&#38190;&#39044;&#27979;&#20934;&#30830;&#24230;&#25351;&#26631;&#65288;MAE&#65292;RMSE&#65292;MAPE&#65289;&#26041;&#38754;&#20855;&#26377;&#21331;&#36234;&#30340;&#31934;&#24230;&#65292;&#26816;&#27979;&#24066;&#22330;&#36235;&#21183;&#30340;&#20934;&#30830;&#29575;&#36798;&#21040;&#20102;62.39%&#12290;&#22312;&#25105;&#20204;&#30340;&#22238;&#27979;&#20013;&#65292;Stockformer&#30340;&#25670;&#21160;&#20132;&#26131;&#31574;&#30053;&#32047;&#35745;&#25910;&#30410;&#29575;&#20026;13.19%&#65292;&#24180;&#21270;&#25910;&#30410;&#20026;...
&lt;/p&gt;
&lt;p&gt;
Amidst ongoing market recalibration and increasing investor optimism, the U.S. stock market is experiencing a resurgence, prompting the need for sophisticated tools to protect and grow portfolios. Addressing this, we introduce "Stockformer," a cutting-edge deep learning framework optimized for swing trading, featuring the TopKDropout method for enhanced stock selection. By integrating STL decomposition and self-attention networks, Stockformer utilizes the S&amp;P 500's complex data to refine stock return predictions. Our methodology entailed segmenting data for training and validation (January 2021 to January 2023) and testing (February to June 2023). During testing, Stockformer's predictions outperformed ten industry models, achieving superior precision in key predictive accuracy indicators (MAE, RMSE, MAPE), with a remarkable accuracy rate of 62.39% in detecting market trends. In our backtests, Stockformer's swing trading strategy yielded a cumulative return of 13.19% and an annualized r
&lt;/p&gt;</description></item><item><title>&#20013;&#22269;&#38271;&#27743;&#19977;&#35282;&#27954;&#22320;&#21306;&#30340;&#30740;&#31350;&#34920;&#26126;&#65292;&#22686;&#21152;&#22522;&#26412;&#20844;&#20849;&#26381;&#21153;&#30340;&#22343;&#34913;&#21487;&#20197;&#25552;&#39640;&#20154;&#20204;&#30340;&#24184;&#31119;&#24863;&#12290;&#26412;&#25991;&#37319;&#29992;&#20102;&#32806;&#21512;&#21327;&#35843;&#24230;&#27169;&#22411;&#12289;Moran's I&#25351;&#25968;&#12289;Theil&#25351;&#25968;&#21644;AF&#26041;&#27861;&#26469;&#20998;&#26512;&#35813;&#22320;&#21306;&#30340;&#29616;&#29366;&#24182;&#25552;&#20986;&#20248;&#21270;&#24314;&#35758;&#12290;</title><link>http://arxiv.org/abs/2401.06134</link><description>&lt;p&gt;
&#21512;&#20316;&#36824;&#26159;&#31454;&#20105;&#65311;&#20013;&#22269;&#21306;&#22495;&#29616;&#20195;&#21270;&#19982;&#20844;&#20849;&#26381;&#21153;&#22343;&#34913;&#30340;&#19968;&#30629;&#65306;&#20197;&#20013;&#22269;&#20026;&#26696;&#20363;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Synergy or Rivalry? Glimpses of Regional Modernization and Public Service Equalization: A Case Study from China. (arXiv:2401.06134v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.06134
&lt;/p&gt;
&lt;p&gt;
&#20013;&#22269;&#38271;&#27743;&#19977;&#35282;&#27954;&#22320;&#21306;&#30340;&#30740;&#31350;&#34920;&#26126;&#65292;&#22686;&#21152;&#22522;&#26412;&#20844;&#20849;&#26381;&#21153;&#30340;&#22343;&#34913;&#21487;&#20197;&#25552;&#39640;&#20154;&#20204;&#30340;&#24184;&#31119;&#24863;&#12290;&#26412;&#25991;&#37319;&#29992;&#20102;&#32806;&#21512;&#21327;&#35843;&#24230;&#27169;&#22411;&#12289;Moran's I&#25351;&#25968;&#12289;Theil&#25351;&#25968;&#21644;AF&#26041;&#27861;&#26469;&#20998;&#26512;&#35813;&#22320;&#21306;&#30340;&#29616;&#29366;&#24182;&#25552;&#20986;&#20248;&#21270;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#22823;&#22810;&#25968;&#21457;&#23637;&#20013;&#22269;&#23478;&#26469;&#35828;&#65292;&#22686;&#21152;&#22522;&#26412;&#20844;&#20849;&#26381;&#21153;&#30340;&#22343;&#34913;&#34987;&#24191;&#27867;&#35748;&#20026;&#26159;&#25552;&#39640;&#20154;&#20204;&#24184;&#31119;&#24863;&#30340;&#26377;&#25928;&#36884;&#24452;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#20013;&#22269;&#31561;&#35768;&#22810;&#26032;&#20852;&#32463;&#27982;&#20307;&#26469;&#35828;&#65292;&#22312;&#36895;&#24230;&#21644;&#36136;&#37327;&#21457;&#23637;&#30340;&#26435;&#34913;&#20013;&#65292;&#22522;&#26412;&#20844;&#20849;&#26381;&#21153;&#30340;&#22343;&#34913;&#27700;&#24179;&#24448;&#24448;&#20250;&#34987;&#24573;&#35270;&#12290;&#20197;&#20013;&#22269;&#38271;&#27743;&#19977;&#35282;&#27954;&#22320;&#21306;&#20026;&#20363;&#65292;&#26412;&#25991;&#39318;&#20808;&#37319;&#29992;&#32806;&#21512;&#21327;&#35843;&#24230;&#27169;&#22411;&#26469;&#25506;&#32034;&#35813;&#22320;&#21306;&#22522;&#26412;&#20844;&#20849;&#26381;&#21153;&#30340;&#29616;&#29366;&#65292;&#28982;&#21518;&#21033;&#29992;Moran's I&#25351;&#25968;&#30740;&#31350;&#35813;&#22320;&#21306;&#25972;&#20307;&#21457;&#23637;&#30340;&#22343;&#34913;&#27700;&#24179;&#12290;&#27492;&#22806;&#65292;&#26412;&#25991;&#36824;&#21033;&#29992;Theil&#25351;&#25968;&#20998;&#26512;&#20844;&#20849;&#26381;&#21153;&#27700;&#24179;&#31354;&#38388;&#24046;&#24322;&#30340;&#20027;&#35201;&#21407;&#22240;&#65292;&#24182;&#20351;&#29992;AF&#26041;&#27861;&#20934;&#30830;&#35782;&#21035;&#20986;&#22522;&#26412;&#20844;&#20849;&#26381;&#21153;&#21457;&#23637;&#27700;&#24179;&#26368;&#24369;&#30340;10&#20010;&#22478;&#24066;40&#20010;&#21439;&#30340;&#30830;&#20999;&#32570;&#28857;&#12290;&#22522;&#20110;&#27492;&#65292;&#26412;&#25991;&#25552;&#20379;&#20102;&#38024;&#23545;&#24615;&#30340;&#20248;&#21270;&#20030;&#25514;&#12290;
&lt;/p&gt;
&lt;p&gt;
For most developing countries, increasing the equalization of basic public services is widely recognized as an effective channel to improve people's sense of contentment. However, for many emerging economies like China, the equalization level of basic public services may often be neglected in the trade-off between the speed and quality of development. Taking the Yangtze River Delta region of China as an example, this paper first adopts the coupling coordination degree model to explore current status of basic public services in this region, and then uses Moran's I index to study the overall equalization level of development there. Moreover, this paper uses the Theil index to analyze the main reasons for the spatial differences in the level of public services, followed by the AF method to accurately identify the exact weaknesses of the 40 counties of 10 cities with the weakest level of basic public service development. Based on this, this paper provides targeted optimization initiatives 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20174;&#22240;&#26524;&#24615;&#30340;&#35282;&#24230;&#31995;&#32479;&#30740;&#31350;&#20102;&#37329;&#34701;&#39046;&#22495;&#20013;&#30340;&#19977;&#20010;&#22256;&#22659;&#65306;&#26102;&#38388;&#20998;&#36776;&#29575;&#19981;&#21305;&#37197;&#12289;&#38750;&#24179;&#31283;&#24615;&#21644;&#26410;&#30693;&#22240;&#26524;&#22240;&#32032;&#65292;&#24182;&#25552;&#20986;&#20102;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>http://arxiv.org/abs/2401.05414</link><description>&lt;p&gt;
&#20851;&#20110;&#37329;&#34701;&#20013;&#30340;&#19977;&#20010;&#22240;&#26524;&#24615;&#22256;&#22659;: &#26102;&#38388;&#20998;&#36776;&#29575;&#12289;&#38750;&#24179;&#31283;&#24615;&#21644;&#28508;&#22312;&#22240;&#32032;
&lt;/p&gt;
&lt;p&gt;
On the Three Demons in Causality in Finance: Time Resolution, Nonstationarity, and Latent Factors. (arXiv:2401.05414v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.05414
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20174;&#22240;&#26524;&#24615;&#30340;&#35282;&#24230;&#31995;&#32479;&#30740;&#31350;&#20102;&#37329;&#34701;&#39046;&#22495;&#20013;&#30340;&#19977;&#20010;&#22256;&#22659;&#65306;&#26102;&#38388;&#20998;&#36776;&#29575;&#19981;&#21305;&#37197;&#12289;&#38750;&#24179;&#31283;&#24615;&#21644;&#26410;&#30693;&#22240;&#26524;&#22240;&#32032;&#65292;&#24182;&#25552;&#20986;&#20102;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37329;&#34701;&#25968;&#25454;&#26412;&#36136;&#19978;&#26159;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#65292;&#22240;&#27492;&#23384;&#22312;&#19977;&#20010;&#22522;&#26412;&#38382;&#39064;&#65306;&#26102;&#38388;&#20998;&#36776;&#29575;&#19981;&#21305;&#37197;&#12289;&#20998;&#24067;&#30340;&#26102;&#21464;&#24615;-&#38750;&#24179;&#31283;&#24615;&#20197;&#21450;&#37325;&#35201;&#20294;&#26410;&#30693;/&#26410;&#35266;&#27979;&#30340;&#22240;&#26524;&#22240;&#32032;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20174;&#22240;&#26524;&#24615;&#30340;&#35282;&#24230;&#31995;&#32479;&#22320;&#30740;&#31350;&#37329;&#34701;&#20013;&#30340;&#36825;&#19977;&#20010;&#22256;&#22659;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#37325;&#26032;&#23457;&#35270;&#20102;&#36825;&#20123;&#38382;&#39064;&#65292;&#24182;&#22312;&#22240;&#26524;&#24615;&#30340;&#32972;&#26223;&#19979;&#25552;&#20986;&#20102;&#26032;&#39062;&#32780;&#26377;&#21551;&#21457;&#24615;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#20026;&#26410;&#26469;&#30740;&#31350;&#25552;&#20379;&#19968;&#20010;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;
Financial data is generally time series in essence and thus suffers from three fundamental issues: the mismatch in time resolution, the time-varying property of the distribution - nonstationarity, and causal factors that are important but unknown/unobserved. In this paper, we follow a causal perspective to systematically look into these three demons in finance. Specifically, we reexamine these issues in the context of causality, which gives rise to a novel and inspiring understanding of how the issues can be addressed. Following this perspective, we provide systematic solutions to these problems, which hopefully would serve as a foundation for future research in the area.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#32771;&#34385;&#37329;&#34701;&#21644;&#23454;&#38469;&#37096;&#38376;&#30340;&#26102;&#21464;&#37329;&#34701;&#24341;&#23548;&#27169;&#22411;&#65292;&#36890;&#36807;&#30740;&#31350;&#19981;&#21516;&#30340;&#32654;&#22269;&#32463;&#27982;&#21608;&#26399;&#23792;&#20540;&#65292;&#21457;&#29616;&#21033;&#28070;&#39537;&#21160;&#30340;&#38656;&#27714;&#21644;&#21033;&#28070;&#25380;&#21387;&#30340;&#20998;&#37197;&#20307;&#21046;&#23384;&#22312;&#65292;&#24182;&#19988;&#36825;&#20123;&#20307;&#21046;&#22312;&#8220;&#22823;&#24133;&#32531;&#21644;&#8221;&#26399;&#38388;&#20943;&#24369;&#65292;&#21516;&#26102;&#36824;&#21457;&#29616;&#26631;&#20934;&#30340;Goodwin&#21464;&#37327;&#19982;&#20303;&#23429;&#25237;&#36164;&#21644;&#21033;&#29575;&#24046;&#20043;&#38388;&#23384;&#22312;&#26174;&#33879;&#32852;&#31995;&#12290;</title><link>http://arxiv.org/abs/2310.05153</link><description>&lt;p&gt;
&#19968;&#31181;&#38024;&#23545;&#32654;&#22269;&#32463;&#27982;&#21608;&#26399;&#30340;&#26102;&#21464;&#37329;&#34701;&#24341;&#23548;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
A time-varying finance-led model for U.S. business cycles. (arXiv:2310.05153v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.05153
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#32771;&#34385;&#37329;&#34701;&#21644;&#23454;&#38469;&#37096;&#38376;&#30340;&#26102;&#21464;&#37329;&#34701;&#24341;&#23548;&#27169;&#22411;&#65292;&#36890;&#36807;&#30740;&#31350;&#19981;&#21516;&#30340;&#32654;&#22269;&#32463;&#27982;&#21608;&#26399;&#23792;&#20540;&#65292;&#21457;&#29616;&#21033;&#28070;&#39537;&#21160;&#30340;&#38656;&#27714;&#21644;&#21033;&#28070;&#25380;&#21387;&#30340;&#20998;&#37197;&#20307;&#21046;&#23384;&#22312;&#65292;&#24182;&#19988;&#36825;&#20123;&#20307;&#21046;&#22312;&#8220;&#22823;&#24133;&#32531;&#21644;&#8221;&#26399;&#38388;&#20943;&#24369;&#65292;&#21516;&#26102;&#36824;&#21457;&#29616;&#26631;&#20934;&#30340;Goodwin&#21464;&#37327;&#19982;&#20303;&#23429;&#25237;&#36164;&#21644;&#21033;&#29575;&#24046;&#20043;&#38388;&#23384;&#22312;&#26174;&#33879;&#32852;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#23558;&#23454;&#38469;&#21644;&#37329;&#34701;&#37096;&#38376;&#25972;&#21512;&#36215;&#26469;&#65292;&#23454;&#35777;&#35780;&#20272;Goodwin&#20851;&#20110;&#38656;&#27714;&#21644;&#20998;&#37197;&#20307;&#21046;&#30340;&#21608;&#26399;&#24615;&#22686;&#38271;&#27169;&#22411;&#30340;&#39044;&#27979;&#65292;&#21516;&#26102;&#35780;&#20272;&#20102;&#37329;&#34701;&#21644;&#23601;&#19994;&#20914;&#20987;&#23545;&#20845;&#20010;&#19981;&#21516;&#30340;&#32654;&#22269;&#32463;&#27982;&#21608;&#26399;&#23792;&#20540;&#19978;&#30340;&#21171;&#21160;&#21147;&#24066;&#22330;&#21644;&#36135;&#24065;&#25919;&#31574;&#21464;&#37327;&#30340;&#24433;&#21709;&#12290;&#23427;&#36890;&#36807;&#20351;&#29992;&#21171;&#21160;&#25910;&#20837;&#20221;&#39069;&#12289;&#23601;&#19994;&#29575;&#12289;&#20303;&#23429;&#25237;&#36164;&#21644;&#21033;&#29575;&#24046;&#31561;&#20869;&#29983;&#21464;&#37327;&#30340;&#19968;&#31181;&#31616;&#21270;&#30340;&#20855;&#26377;&#38543;&#26426;&#27874;&#21160;&#30340;&#26102;&#21464;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#65288;TVP-VAR-SV&#65289;&#65292;&#24182;&#37319;&#29992;&#36125;&#21494;&#26031;&#25512;&#26029;&#26041;&#27861;&#65292;&#20851;&#38190;&#32467;&#26524;&#34920;&#26126;&#65288;i&#65289;&#21033;&#28070;&#39537;&#21160;&#30340;&#38656;&#27714;&#21644;&#21033;&#28070;&#25380;&#21387;&#30340;&#20998;&#37197;&#30340;&#32452;&#21512;&#65307;&#65288;ii&#65289;&#22312;&#8220;&#22823;&#24133;&#32531;&#21644;&#8221;&#26399;&#38388;&#36825;&#20123;&#20307;&#21046;&#30340;&#20943;&#24369;&#65307;&#20197;&#21450;&#65288;iii&#65289;&#26631;&#20934;&#30340;Goodwin&#21464;&#37327;&#19982;&#20303;&#23429;&#25237;&#36164;&#21644;&#21033;&#29575;&#24046;&#20043;&#38388;&#23384;&#22312;&#26174;&#33879;&#32852;&#31995;&#12290;&#26412;&#30740;&#31350;&#30340;&#32467;&#26524;&#24635;&#20307;&#19978;&#31526;&#21512;&#37329;&#34701;&#21644;&#21171;&#21160;&#21147;&#24066;&#22330;&#26085;&#30410;&#35299;&#38500;&#31649;&#21046;&#30340;&#36716;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper empirically assesses predictions of Goodwin's model of cyclical growth regarding demand and distributive regimes when integrating the real and financial sectors. In addition, it evaluates how financial and employment shocks affect the labor market and monetary policy variables over six different U.S. business-cycle peaks. It identifies a parsimonious Time-Varying Vector Autoregressive model with Stochastic Volatility (TVP-VAR-SV) with the labor share of income, the employment rate, residential investment, and the interest rate spread as endogenous variables. Using Bayesian inference methods, key results suggest (i) a combination of profit-led demand and profit-squeeze distribution; (ii) weakening of these regimes during the Great Moderation; and (iii) significant connections between the standard Goodwinian variables and residential investment as well as term spreads. Findings presented here broadly conform to the transition to increasingly deregulated financial and labor mar
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#30740;&#31350;&#19968;&#20010;&#31616;&#21333;&#30340;&#37325;&#22797;&#21338;&#24328;&#27169;&#22411;&#65292;&#25105;&#20204;&#21457;&#29616;&#19981;&#21516;&#35266;&#28857;&#23545;&#32676;&#20307;&#29983;&#20135;&#32489;&#25928;&#26377;&#30528;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;&#19981;&#21516;&#30340;&#35266;&#28857;&#20250;&#23548;&#33268;&#19981;&#21516;&#30340;&#25216;&#26415;&#21644;&#21162;&#21147;&#36873;&#25321;&#65292;&#32780;&#35266;&#28857;&#20043;&#38388;&#30340;&#20998;&#27495;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#21487;&#20197;&#28608;&#21169;&#20048;&#35266;&#20027;&#20041;&#32773;&#26356;&#21162;&#21147;&#22320;&#24037;&#20316;&#65292;&#20294;&#20063;&#21487;&#33021;&#38477;&#20302;&#24576;&#30097;&#20027;&#20041;&#32773;&#30340;&#21162;&#21147;&#12290;&#22312;&#23384;&#22312;&#36275;&#22815;&#24378;&#30340;&#22806;&#37096;&#24615;&#19979;&#65292;&#19968;&#20010;&#20855;&#26377;&#20998;&#27495;&#35266;&#28857;&#30340;&#22242;&#38431;&#21487;&#20197;&#22312;&#39044;&#26399;&#20135;&#20986;&#26041;&#38754;&#36229;&#36807;&#19968;&#20010;&#26377;&#31867;&#20284;&#35266;&#28857;&#30340;&#22242;&#38431;&#12290;</title><link>http://arxiv.org/abs/2308.06607</link><description>&lt;p&gt;
&#19981;&#21516;&#35266;&#28857;&#22914;&#20309;&#24433;&#21709;&#19968;&#20010;&#32676;&#20307;&#30340;&#29983;&#20135;&#32489;&#25928;&#65306;&#19968;&#20010;&#31616;&#21333;&#30340;&#37325;&#22797;&#21338;&#24328;&#27169;&#22411;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
The Disagreement Dividend. (arXiv:2308.06607v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.06607
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#30740;&#31350;&#19968;&#20010;&#31616;&#21333;&#30340;&#37325;&#22797;&#21338;&#24328;&#27169;&#22411;&#65292;&#25105;&#20204;&#21457;&#29616;&#19981;&#21516;&#35266;&#28857;&#23545;&#32676;&#20307;&#29983;&#20135;&#32489;&#25928;&#26377;&#30528;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;&#19981;&#21516;&#30340;&#35266;&#28857;&#20250;&#23548;&#33268;&#19981;&#21516;&#30340;&#25216;&#26415;&#21644;&#21162;&#21147;&#36873;&#25321;&#65292;&#32780;&#35266;&#28857;&#20043;&#38388;&#30340;&#20998;&#27495;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#21487;&#20197;&#28608;&#21169;&#20048;&#35266;&#20027;&#20041;&#32773;&#26356;&#21162;&#21147;&#22320;&#24037;&#20316;&#65292;&#20294;&#20063;&#21487;&#33021;&#38477;&#20302;&#24576;&#30097;&#20027;&#20041;&#32773;&#30340;&#21162;&#21147;&#12290;&#22312;&#23384;&#22312;&#36275;&#22815;&#24378;&#30340;&#22806;&#37096;&#24615;&#19979;&#65292;&#19968;&#20010;&#20855;&#26377;&#20998;&#27495;&#35266;&#28857;&#30340;&#22242;&#38431;&#21487;&#20197;&#22312;&#39044;&#26399;&#20135;&#20986;&#26041;&#38754;&#36229;&#36807;&#19968;&#20010;&#26377;&#31867;&#20284;&#35266;&#28857;&#30340;&#22242;&#38431;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#19968;&#20010;&#24102;&#26377;&#26367;&#20195;&#29983;&#20135;&#25216;&#26415;&#21644;&#27491;&#22806;&#37096;&#24615;&#30340;&#31616;&#21333;&#37325;&#22797;&#21338;&#24328;&#20013;&#65292;&#35266;&#28857;&#19981;&#21516;&#22914;&#20309;&#24433;&#21709;&#32676;&#20307;&#30340;&#29983;&#20135;&#32489;&#25928;&#12290;&#21442;&#19982;&#32773;&#21487;&#20197;&#25345;&#26377;&#19981;&#21516;&#30340;&#35266;&#28857;&#65292;&#21363;&#23545;&#25216;&#26415;&#30340;&#29305;&#24615;&#21644;&#36136;&#37327;&#25345;&#26377;&#19981;&#21516;&#30340;&#30475;&#27861;&#12290;&#36825;&#31181;&#20998;&#27495;&#26377;&#20004;&#20010;&#20027;&#35201;&#29305;&#28857;&#12290;&#39318;&#20808;&#65292;&#19981;&#21516;&#30340;&#35266;&#28857;&#20250;&#23548;&#33268;&#19981;&#21516;&#30340;&#25216;&#26415;&#21644;&#21162;&#21147;&#36873;&#25321;--&#8220;&#20048;&#35266;&#8221;&#30340;&#35266;&#28857;&#20250;&#23548;&#33268;&#27604;&#8220;&#24576;&#30097;&#8221;&#30340;&#35266;&#28857;&#26356;&#39640;&#30340;&#21162;&#21147;&#31243;&#24230;&#12290;&#20854;&#27425;&#65292;&#35266;&#28857;&#26159;&#26377;&#38887;&#24615;&#30340;--&#21482;&#26377;&#22312;&#20986;&#20046;&#24847;&#26009;&#30340;&#35777;&#25454;&#35777;&#26126;&#20854;&#20026;&#38169;&#35823;&#26102;&#25165;&#20250;&#21457;&#29983;&#21464;&#21270;&#12290;&#24403;&#21482;&#26377;&#19968;&#31181;&#29983;&#20135;&#25216;&#26415;&#21487;&#29992;&#26102;&#65292;&#23545;&#20854;&#29983;&#20135;&#21147;&#30340;&#20998;&#27495;(i)&#28608;&#21169;&#20048;&#35266;&#20027;&#20041;&#32773;&#27604;&#19982;&#26377;&#31867;&#20284;&#35266;&#28857;&#30340;&#29609;&#23478;&#21305;&#37197;&#26102;&#26356;&#21162;&#21147;&#22320;&#24037;&#20316;&#65307;(ii)&#21487;&#20197;&#38477;&#20302;&#24576;&#30097;&#20027;&#20041;&#32773;&#30340;&#21162;&#21147;&#12290;&#31532;&#19968;&#20010;&#21147;&#37327;&#26500;&#25104;&#20102;&#25105;&#20204;&#25152;&#35859;&#30340;&#8220;&#20998;&#27495;&#32418;&#21033;&#8221;&#30340;&#26680;&#24515;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#26524;&#22806;&#37096;&#24615;&#36275;&#22815;&#24378;&#65292;&#19968;&#20010;&#26377;&#31867;&#20284;&#35266;&#28857;&#30340;&#20048;&#35266;&#20027;&#20041;&#32773;&#22242;&#38431;&#22312;&#39044;&#26399;&#20135;&#20986;&#26041;&#38754;&#20250;&#34987;&#19968;&#20010;&#20855;&#26377;&#20998;&#27495;&#35266;&#28857;&#30340;&#22242;&#38431;&#22312;&#34920;&#29616;&#19978;&#36229;&#36807;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study how disagreement influences the productive performance of a group in a simple repeated game with alternative production technologies and positive externalities. Players can disagree, i.e. hold different views about the characteristics and quality of the technologies. This disagreement has two main characteristics. First, different views lead to different technology and effort choices -- "optimistic" views justify higher effort than "skeptical" views. Second, views are resilient -- changed only if falsified by surprising evidence. When only one production technology is available, disagreement over its productivity (i) incentivizes the optimistic agent to work harder than when matched with a like-minded player; (ii) can reduce the effort of the skeptic agent. The first force lies at the core of what we call the "disagreement dividend." We show that if externalities are sufficiently strong, a team of like-minded optimists is outperformed -- in terms of expected output -- by a dis
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#22522;&#20110;&#31070;&#32463;&#32593;&#32476;&#30340;&#38543;&#26426;&#27874;&#21160;&#29575;&#27169;&#22411;&#26657;&#20934;&#26041;&#27861;&#65292;&#22312;&#19981;&#38656;&#35201;&#25554;&#20540;/&#22806;&#25512;&#25216;&#26415;&#30340;&#24773;&#20917;&#19979;&#32467;&#21512;&#20102;&#32593;&#26684;&#26041;&#27861;&#21644;&#28857;&#23545;&#28857;&#20004;&#27493;&#26657;&#20934;&#12290;&#25105;&#20204;&#36890;&#36807;&#22312;&#38543;&#26426;&#26684;&#19978;&#29983;&#25104;&#21547;&#38544;&#21547;&#27874;&#21160;&#29575;&#38754;&#65292;&#24182;&#23558;&#20854;&#22312;&#35757;&#32451;&#38454;&#27573;&#25552;&#20379;&#32473;&#32593;&#32476;&#65292;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#22312;&#37329;&#34701;&#24037;&#31243;&#23398;&#20013;&#26377;&#30528;&#26377;&#20215;&#20540;&#30340;&#24212;&#29992;&#12290;</title><link>http://arxiv.org/abs/2306.11061</link><description>&lt;p&gt;
&#38543;&#26426;&#32593;&#26684;&#30340;&#28145;&#24230;&#26657;&#20934;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Deep calibration with random grids. (arXiv:2306.11061v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.11061
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#22522;&#20110;&#31070;&#32463;&#32593;&#32476;&#30340;&#38543;&#26426;&#27874;&#21160;&#29575;&#27169;&#22411;&#26657;&#20934;&#26041;&#27861;&#65292;&#22312;&#19981;&#38656;&#35201;&#25554;&#20540;/&#22806;&#25512;&#25216;&#26415;&#30340;&#24773;&#20917;&#19979;&#32467;&#21512;&#20102;&#32593;&#26684;&#26041;&#27861;&#21644;&#28857;&#23545;&#28857;&#20004;&#27493;&#26657;&#20934;&#12290;&#25105;&#20204;&#36890;&#36807;&#22312;&#38543;&#26426;&#26684;&#19978;&#29983;&#25104;&#21547;&#38544;&#21547;&#27874;&#21160;&#29575;&#38754;&#65292;&#24182;&#23558;&#20854;&#22312;&#35757;&#32451;&#38454;&#27573;&#25552;&#20379;&#32473;&#32593;&#32476;&#65292;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#22312;&#37329;&#34701;&#24037;&#31243;&#23398;&#20013;&#26377;&#30528;&#26377;&#20215;&#20540;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#31070;&#32463;&#32593;&#32476;&#30340;&#38543;&#26426;&#27874;&#21160;&#29575;&#27169;&#22411;&#26657;&#20934;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#23558;Horvath&#31561;&#20154;&#65288;2021&#65289;&#30340;&#32593;&#26684;&#26041;&#27861;&#19982;Bayer&#21644;Stemper&#65288;2018&#65289;&#30340;&#28857;&#23545;&#28857;&#20004;&#27493;&#26657;&#20934;&#30456;&#32467;&#21512;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#32487;&#25215;&#20102;&#21069;&#32773;&#30340;&#40065;&#26834;&#24615;&#65292;&#32780;&#19981;&#20250;&#21463;&#21040;&#25554;&#20540;/&#22806;&#25512;&#25216;&#26415;&#30340;&#38656;&#35201;&#25152;&#22256;&#25200;&#65292;&#36825;&#26159;&#28857;&#23545;&#28857;&#26041;&#27861;&#30340;&#26126;&#26174;&#20248;&#21183;&#12290;&#25972;&#20010;&#31243;&#24207;&#30340;&#20851;&#38190;&#22312;&#20110;&#22312;&#38543;&#26426;&#26684;&#19978;&#29983;&#25104;&#21547;&#38544;&#21547;&#27874;&#21160;&#29575;&#38754;&#65292;&#23558;&#20854;&#22312;&#35757;&#32451;&#38454;&#27573;&#25552;&#20379;&#32473;&#32593;&#32476;&#12290;&#25105;&#20204;&#36890;&#36807;&#23545;&#31895;&#31961;Bergomi&#21644;Heston&#27169;&#22411;&#36827;&#34892;&#20960;&#20010;&#32463;&#39564;&#21644;&#33945;&#29305;&#21345;&#32599;&#23454;&#39564;&#26469;&#25903;&#25345;&#25105;&#20204;&#30340;&#26657;&#20934;&#25216;&#26415;&#30340;&#26377;&#25928;&#24615;&#65292;&#36825;&#20123;&#23454;&#39564;&#37319;&#29992;&#20102;&#31616;&#21333;&#32780;&#26377;&#25928;&#30340;&#27491;&#21521;&#26041;&#24046;&#26354;&#32447;&#21442;&#25968;&#21270;&#12290;&#35813;&#26041;&#27861;&#20026;&#37329;&#34701;&#24037;&#31243;&#23398;&#20013;&#30340;&#26377;&#20215;&#20540;&#30340;&#24212;&#29992;&#65288;&#20363;&#22914;&#65292;&#22312;&#26412;&#22320;&#38543;&#26426;&#27874;&#21160;&#29575;&#27169;&#22411;&#19979;&#30340;&#23450;&#20215;&#65289;&#20197;&#21450;&#36335;&#24452;&#30456;&#20851;&#39046;&#22495;&#30340;&#24555;&#36895;&#25193;&#23637;&#38138;&#24179;&#20102;&#36947;&#36335;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a neural network-based approach to calibrating stochastic volatility models, which combines the pioneering grid approach by Horvath et al. (2021) with the pointwise two-stage calibration of Bayer and Stemper (2018). Our methodology inherits robustness from the former while not suffering from the need for interpolation/extrapolation techniques, a clear advantage ensured by the pointwise approach. The crucial point to the entire procedure is the generation of implied volatility surfaces on random grids, which one dispenses to the network in the training phase. We support the validity of our calibration technique with several empirical and Monte Carlo experiments for the rough Bergomi and Heston models under a simple but effective parametrization of the forward variance curve. The approach paves the way for valuable applications in financial engineering - for instance, pricing under local stochastic volatility models - and extensions to the fast-growing field of path-dependent 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#37327;&#23376;&#21462;&#26679;&#30340;&#24037;&#20316;&#37327;&#35777;&#26126;&#20849;&#35782;&#26426;&#21046;(CGBS-PoW)&#65292;&#37319;&#29992;Fock&#24577;&#21644;&#39640;&#26031;&#27874;&#33394;&#23376;&#21462;&#26679;&#65292;&#20855;&#26377;&#24040;&#22823;&#30340;&#21152;&#36895;&#21644;&#33410;&#33021;&#25928;&#30410;&#12290;</title><link>http://arxiv.org/abs/2305.19865</link><description>&lt;p&gt;
&#37327;&#23376;&#21462;&#26679;&#30340;&#24037;&#20316;&#37327;&#35777;&#26126;&#20849;&#35782;&#26426;&#21046;
&lt;/p&gt;
&lt;p&gt;
Proof-of-work consensus by quantum sampling. (arXiv:2305.19865v1 [quant-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.19865
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#37327;&#23376;&#21462;&#26679;&#30340;&#24037;&#20316;&#37327;&#35777;&#26126;&#20849;&#35782;&#26426;&#21046;(CGBS-PoW)&#65292;&#37319;&#29992;Fock&#24577;&#21644;&#39640;&#26031;&#27874;&#33394;&#23376;&#21462;&#26679;&#65292;&#20855;&#26377;&#24040;&#22823;&#30340;&#21152;&#36895;&#21644;&#33410;&#33021;&#25928;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#20854;2011&#24180;&#20986;&#29616;&#20197;&#26469;&#65292;&#27874;&#33394;&#23376;&#21462;&#26679;&#22240;&#20854;&#30456;&#23545;&#20110;&#20854;&#20182;&#37327;&#23376;&#31639;&#27861;&#30340;&#31616;&#21333;&#24615;&#21644;&#36817;&#26399;&#35201;&#27714;&#32780;&#25104;&#20026;&#23637;&#31034;&#37327;&#23376;&#20248;&#21183;&#30340;&#20248;&#36873;&#20505;&#36873;&#12290;&#26412;&#25991;&#25552;&#20986;&#23558;&#19968;&#31181;&#21464;&#31181;&#8212;&#8212;&#31895;&#31890;&#24230;&#27874;&#33394;&#23376;&#21462;&#26679;(CGBS)&#8212;&#8212;&#20316;&#20026;&#21306;&#22359;&#38142;&#20849;&#35782;&#30340;&#37327;&#23376;&#24037;&#20316;&#37327;&#35777;&#26126;(PoW)&#26426;&#21046;&#12290;&#29992;&#25143;&#20351;&#29992;&#20381;&#36182;&#20110;&#24403;&#21069;&#22359;&#20449;&#24687;&#30340;&#36755;&#20837;&#29366;&#24577;&#36827;&#34892;&#27874;&#33394;&#23376;&#21462;&#26679;&#65292;&#24182;&#23558;&#20854;&#25552;&#20132;&#21040;&#32593;&#32476;&#20013;&#12290;&#28982;&#21518;&#30830;&#23450;&#21487;&#29992;&#20110;&#39564;&#35777;&#26679;&#26412;&#21644;&#22870;&#21169;&#25104;&#21151;&#30719;&#24037;&#30340;CGBS&#31574;&#30053;&#12290;&#36890;&#36807;&#23558;&#21521;&#25552;&#20132;&#35802;&#23454;&#26679;&#26412;&#30340;&#30719;&#24037;&#25552;&#20379;&#22870;&#21169;&#24182;&#23545;&#25552;&#20132;&#19981;&#35802;&#23454;&#26679;&#26412;&#30340;&#30719;&#24037;&#36827;&#34892;&#24809;&#32602;&#30340;&#32452;&#21512;&#65292;&#25214;&#21040;&#20102;&#19968;&#20010;&#28608;&#21169;&#35802;&#23454;&#33410;&#28857;&#30340;&#32435;&#20160;&#22343;&#34913;&#12290;&#35813;&#26041;&#26696;&#36866;&#29992;&#20110;Fock&#24577;&#27874;&#33394;&#23376;&#21462;&#26679;&#21644;&#39640;&#26031;&#27874;&#33394;&#23376;&#21462;&#26679;&#65292;&#24182;&#30456;&#23545;&#20110;&#20351;&#29992;&#32463;&#20856;&#30828;&#20214;&#36827;&#34892;&#35745;&#31639;&#25552;&#20379;&#20102;&#24040;&#22823;&#30340;&#21152;&#36895;&#21644;&#33410;&#33021;&#25928;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;
Since its advent in 2011, boson-sampling has been a preferred candidate for demonstrating quantum advantage because of its simplicity and near-term requirements compared to other quantum algorithms. We propose to use a variant, called coarse-grained boson-sampling (CGBS), as a quantum Proof-of-Work (PoW) scheme for blockchain consensus. The users perform boson-sampling using input states that depend on the current block information, and commit their samples to the network. Afterward, CGBS strategies are determined which can be used to both validate samples and to reward successful miners. By combining rewards to miners committing honest samples together with penalties to miners committing dishonest samples, a Nash equilibrium is found that incentivizes honest nodes. The scheme works for both Fock state boson sampling and Gaussian boson sampling and provides dramatic speedup and energy savings relative to computation by classical hardware.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#36339;&#36291;&#25193;&#25955;&#27169;&#22411;&#19979;&#36830;&#32493;&#26102;&#38388;&#30340;&#21333;&#35843;&#22343;&#20540;&#26041;&#24046;&#32452;&#21512;&#36873;&#25321;&#65292;&#24182;&#39318;&#27425;&#32473;&#20986;&#20102;&#19981;&#21516;&#20110;&#20256;&#32479;&#22343;&#20540;&#26041;&#24046;&#20559;&#22909;&#30340;&#26126;&#30830;&#35299;&#20915;&#26041;&#26696;&#12290;&#35813;&#30740;&#31350;&#32467;&#26524;&#23545;&#20110;&#26410;&#26469;&#23545;&#21333;&#35843;&#22343;&#20540;&#26041;&#24046;&#21644;&#21333;&#35843;&#36164;&#26412;&#36164;&#20135;&#23450;&#20215;&#27169;&#22411;&#30340;&#23454;&#35777;&#27979;&#35797;&#20855;&#26377;&#37325;&#35201;&#30340;&#29702;&#35770;&#20381;&#25454;&#12290;</title><link>http://arxiv.org/abs/2211.12168</link><description>&lt;p&gt;
&#36830;&#32493;&#26102;&#38388;&#21333;&#35843;&#22343;&#20540;&#26041;&#24046;&#32452;&#21512;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Continuous-Time Monotone Mean-Variance Portfolio Selection. (arXiv:2211.12168v4 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.12168
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#36339;&#36291;&#25193;&#25955;&#27169;&#22411;&#19979;&#36830;&#32493;&#26102;&#38388;&#30340;&#21333;&#35843;&#22343;&#20540;&#26041;&#24046;&#32452;&#21512;&#36873;&#25321;&#65292;&#24182;&#39318;&#27425;&#32473;&#20986;&#20102;&#19981;&#21516;&#20110;&#20256;&#32479;&#22343;&#20540;&#26041;&#24046;&#20559;&#22909;&#30340;&#26126;&#30830;&#35299;&#20915;&#26041;&#26696;&#12290;&#35813;&#30740;&#31350;&#32467;&#26524;&#23545;&#20110;&#26410;&#26469;&#23545;&#21333;&#35843;&#22343;&#20540;&#26041;&#24046;&#21644;&#21333;&#35843;&#36164;&#26412;&#36164;&#20135;&#23450;&#20215;&#27169;&#22411;&#30340;&#23454;&#35777;&#27979;&#35797;&#20855;&#26377;&#37325;&#35201;&#30340;&#29702;&#35770;&#20381;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#36339;&#36291;&#25193;&#25955;&#27169;&#22411;&#19979;&#30340;&#36830;&#32493;&#26102;&#38388;&#21333;&#35843;&#22343;&#20540;&#26041;&#24046;(MMV)&#20559;&#22909;&#30340;&#32452;&#21512;&#36873;&#25321;&#65292;&#24182;&#32473;&#20986;&#20102;&#19982;&#20256;&#32479;&#22343;&#20540;&#26041;&#24046;(MV)&#20559;&#22909;&#19981;&#21516;&#30340;&#26126;&#30830;&#35299;&#20915;&#26041;&#26696;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;MMV&#30340;&#27169;&#31946;&#24230;&#27979;&#24230;&#21487;&#20197;&#38480;&#21046;&#22312;&#38750;&#36127;&#30340;Dol\'eans-Dade&#25351;&#25968;&#19978;&#12290;&#25105;&#20204;&#21457;&#29616;&#24403;&#37329;&#34701;&#24066;&#22330;&#30340;&#36339;&#36291;&#22823;&#23567;&#21487;&#20197;&#22823;&#20110;&#39118;&#38505;&#24066;&#22330;&#20215;&#26684;&#30340;&#20498;&#25968;&#26102;&#65292;MMV&#21487;&#20197;&#20462;&#22797;MV&#30340;&#38750;&#21333;&#35843;&#24615;&#12290;&#36825;&#20010;&#32467;&#26524;&#19982;Dybvig&#21644;Ingersoll&#30340;&#26368;&#26089;&#32467;&#26524;&#23436;&#20840;&#21487;&#27604;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#39564;&#35777;&#20102;&#20004;&#20010;&#22522;&#37329;&#30340;&#38548;&#31163;&#26377;&#25928;&#24615;&#65292;&#24182;&#24314;&#31435;&#20102;MMV&#25237;&#36164;&#32773;&#30340;&#21333;&#35843;&#36164;&#26412;&#36164;&#20135;&#23450;&#20215;&#27169;&#22411;&#65288;&#21333;&#35843;CAPM&#65289;&#12290;&#25105;&#20204;&#36824;&#30740;&#31350;&#20102;&#22312;&#38480;&#21046;&#20132;&#26131;&#27169;&#22411;&#20013;&#30340;MMV&#65292;&#24182;&#25552;&#20379;&#20102;&#19977;&#20010;&#20855;&#20307;&#30340;&#25968;&#20540;&#31034;&#20363;&#26469;&#23637;&#31034;MMV&#30340;&#25928;&#29575;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#21487;&#20197;&#25104;&#20026;&#26410;&#26469;&#23545;MMV&#21644;&#21333;&#35843;CAPM&#26377;&#25928;&#24615;&#36827;&#34892;&#23454;&#35777;&#27979;&#35797;&#30340;&#37325;&#35201;&#29702;&#35770;&#20381;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the continuous-time portfolio selection under monotone mean-variance (MMV) preferences in a jump-diffusion model and give an explicit solution different from that under classical mean-variance (MV) preferences for the first time. We prove that ambiguity measures of MMV can be restricted on non-negative Dol\'eans-Dade exponentials. We find that MMV can fix the non-monotonicity of MV when the jump size of the financial market can be larger than the inverse of the market price of risk. Such result is completely comparable to the earliest result of Dybvig and Ingersoll. Further, we verify the validity of two-fund separation and establish the monotone capital asset pricing model (monotone CAPM) for MMV investors. We also study MMV in a constrained trading model and provide three specific numerical examples to show MMV's efficiency. Our finding can be an important theoretical basis for future empirical tests of MMV and monotone CAPM's effectiveness.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#27604;&#36739;&#20102;&#22810;&#31181;&#25554;&#20540;&#26041;&#27861;&#65292;&#21457;&#29616;&#39044;&#27979;&#21464;&#37327;&#36890;&#24120;&#29420;&#31435;&#65292;&#22240;&#27492;&#21363;&#20351;&#37319;&#29992;&#29305;&#23450;&#20540;&#20272;&#35745;&#65292;&#26368;&#32456;&#32467;&#26524;&#19982;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#30456;&#20284;&#12290;&#27492;&#22806;&#65292;50&#20010;&#20027;&#25104;&#20998;&#21487;&#25429;&#25417;&#31561;&#26435;&#37325;&#30340;&#26399;&#26395;&#22238;&#25253;&#65292;&#32780;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#25237;&#36164;&#32452;&#21512;&#20063;&#26377;&#31867;&#20284;&#30340;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2207.13071</link><description>&lt;p&gt;
&#32570;&#22833;&#20540;&#21644;&#26399;&#26395;&#22238;&#25253;&#32500;&#24230;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Missing Values and the Dimensionality of Expected Returns. (arXiv:2207.13071v3 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.13071
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#27604;&#36739;&#20102;&#22810;&#31181;&#25554;&#20540;&#26041;&#27861;&#65292;&#21457;&#29616;&#39044;&#27979;&#21464;&#37327;&#36890;&#24120;&#29420;&#31435;&#65292;&#22240;&#27492;&#21363;&#20351;&#37319;&#29992;&#29305;&#23450;&#20540;&#20272;&#35745;&#65292;&#26368;&#32456;&#32467;&#26524;&#19982;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#30456;&#20284;&#12290;&#27492;&#22806;&#65292;50&#20010;&#20027;&#25104;&#20998;&#21487;&#25429;&#25417;&#31561;&#26435;&#37325;&#30340;&#26399;&#26395;&#22238;&#25253;&#65292;&#32780;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#25237;&#36164;&#32452;&#21512;&#20063;&#26377;&#31867;&#20284;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#23558;&#35768;&#22810;&#27178;&#25130;&#38754;&#22238;&#25253;&#39044;&#27979;&#21464;&#37327;&#32452;&#21512;&#22312;&#19968;&#36215;&#65288;&#20363;&#22914;&#65292;&#22312;&#26426;&#22120;&#23398;&#20064;&#20013;&#65289;&#65292;&#36890;&#24120;&#38656;&#35201;&#25554;&#20540;&#32570;&#22833;&#20540;&#12290;&#25105;&#20204;&#27604;&#36739;&#20102;&#20960;&#31181;&#26041;&#27861;&#65292;&#21253;&#25324;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#21644;&#29305;&#23450;&#20540;&#20272;&#35745;&#12290;&#20196;&#20154;&#24778;&#35766;&#30340;&#26159;&#65292;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#21644;&#29305;&#23450;&#20540;&#20272;&#35745;&#20135;&#29983;&#20102;&#31867;&#20284;&#30340;&#32467;&#26524;&#12290;&#36825;&#26159;&#22240;&#20026;&#39044;&#27979;&#21464;&#37327;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#26159;&#29420;&#31435;&#30340;&#65306;&#30456;&#20851;&#24615;&#38598;&#32676;&#25509;&#36817;&#20110;&#38646;&#65292;10&#20010;&#20027;&#25104;&#20998;(PC)&#36328;&#24230;&#23569;&#20110;&#24635;&#26041;&#24046;&#30340;50&#65285;&#12290;&#29420;&#31435;&#24615;&#24847;&#21619;&#30528;&#35266;&#23519;&#21040;&#30340;&#21464;&#37327;&#23545;&#32570;&#22833;&#21464;&#37327;&#27809;&#26377;&#20449;&#24687;&#36129;&#29486;&#65292;&#20351;&#29305;&#23450;&#26041;&#27861;&#26377;&#25928;&#12290; &#22312;PC&#22238;&#24402;&#27979;&#35797;&#20013;&#65292;&#38656;&#35201;50&#20010;PC&#25165;&#33021;&#25429;&#25417;&#31561;&#26435;&#37325;&#26399;&#26395;&#22238;&#25253;&#65288;30&#20010;PC&#26435;&#20540;&#21152;&#26435;&#65289;&#65292;&#19981;&#31649;imputation&#26159;&#20160;&#20040;&#12290; &#25105;&#20204;&#21457;&#29616;&#31070;&#32463;&#32593;&#32476;&#25237;&#36164;&#32452;&#21512;&#20013;&#20063;&#26377;&#31867;&#20284;&#30340;&#19981;&#21464;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Combining many cross-sectional return predictors (for example, in machine learning) often requires imputing missing values. We compare ad-hoc mean imputation with several methods including maximum likelihood. Surprisingly, maximum likelihood and ad-hoc methods lead to similar results. This is because predictors are largely independent: Correlations cluster near zero and 10 principal components (PCs) span less than 50% of total variance. Independence implies observed predictors are uninformative about missing predictors, making ad-hoc methods valid. In PC regression tests, 50 PCs are required to capture equal-weighted expected returns (30 PCs value-weighted), regardless of the imputation. We find similar invariance in neural network portfolios.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#20877;&#29983;&#26680;&#24076;&#23572;&#20271;&#29305;&#31354;&#38388;&#30340;&#22855;&#24322;&#23616;&#37096;&#38543;&#26426;&#27874;&#21160;&#29575;McKean-Vlasov&#27169;&#22411;&#12290;&#36890;&#36807;&#24320;&#21457;&#19968;&#31181;&#26032;&#30340;&#27491;&#21017;&#21270;&#26041;&#27861;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#27491;&#21017;&#21270;&#21518;&#30340;&#27169;&#22411;&#30340;&#33391;&#24577;&#24615;&#65292;&#24182;&#19988;&#36890;&#36807;&#25968;&#20540;&#23454;&#39564;&#23637;&#31034;&#20102;&#27169;&#22411;&#33021;&#22815;&#22797;&#21046;&#20856;&#22411;&#30340;&#23616;&#37096;&#27874;&#21160;&#29575;&#27169;&#22411;&#30340;&#26399;&#26435;&#20215;&#26684;&#12290;</title><link>http://arxiv.org/abs/2203.01160</link><description>&lt;p&gt;
&#22522;&#20110;&#20877;&#29983;&#26680;&#24076;&#23572;&#20271;&#29305;&#31354;&#38388;&#30340;&#22855;&#24322;&#23616;&#37096;&#38543;&#26426;&#27874;&#21160;&#29575;McKean-Vlasov&#27169;&#22411;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
A Reproducing Kernel Hilbert Space approach to singular local stochastic volatility McKean-Vlasov models. (arXiv:2203.01160v2 [q-fin.CP] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.01160
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#20877;&#29983;&#26680;&#24076;&#23572;&#20271;&#29305;&#31354;&#38388;&#30340;&#22855;&#24322;&#23616;&#37096;&#38543;&#26426;&#27874;&#21160;&#29575;McKean-Vlasov&#27169;&#22411;&#12290;&#36890;&#36807;&#24320;&#21457;&#19968;&#31181;&#26032;&#30340;&#27491;&#21017;&#21270;&#26041;&#27861;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#27491;&#21017;&#21270;&#21518;&#30340;&#27169;&#22411;&#30340;&#33391;&#24577;&#24615;&#65292;&#24182;&#19988;&#36890;&#36807;&#25968;&#20540;&#23454;&#39564;&#23637;&#31034;&#20102;&#27169;&#22411;&#33021;&#22815;&#22797;&#21046;&#20856;&#22411;&#30340;&#23616;&#37096;&#27874;&#21160;&#29575;&#27169;&#22411;&#30340;&#26399;&#26435;&#20215;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#37329;&#34701;&#27169;&#22411;&#26657;&#20934;&#30340;&#25361;&#25112;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#25968;&#20540;&#27714;&#35299;&#22855;&#24322;McKean-Vlasov&#26041;&#31243;&#30340;&#38382;&#39064;&#65292;&#20854;&#20013;&#26041;&#31243;&#24418;&#24335;&#20026; $$ d X_t= \sigma(t,X_t) X_t \frac{\sqrt v_t}{\sqrt {E[v_t|X_t]}}dW_t, $$ &#20854;&#20013;$W$&#26159;&#24067;&#26391;&#36816;&#21160;&#65292;$v$&#26159;&#25913;&#36827;&#25193;&#25955;&#36807;&#31243;&#12290;&#35813;&#26041;&#31243;&#21487;&#34987;&#30475;&#20316;&#22855;&#24322;&#23616;&#37096;&#38543;&#26426;&#27874;&#21160;&#29575;&#27169;&#22411;&#12290;&#23613;&#31649;&#36825;&#26679;&#30340;&#27169;&#22411;&#22312;&#23454;&#36341;&#20013;&#24456;&#21463;&#27426;&#36814;&#65292;&#20294;&#26159;&#24456;&#36951;&#25022;&#65292;&#20854;&#33391;&#24577;&#24615;&#36824;&#27809;&#26377;&#23436;&#20840;&#29702;&#35299;&#65292;&#19968;&#33324;&#24773;&#20917;&#19979;&#20063;&#21487;&#33021;&#26080;&#27861;&#20445;&#35777;&#12290;&#25105;&#20204;&#22522;&#20110;&#20877;&#29983;&#26680;&#24076;&#23572;&#20271;&#29305;&#31354;&#38388;(RKHS)&#25216;&#26415;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#27491;&#21017;&#21270;&#26041;&#27861;&#65292;&#24182;&#35777;&#26126;&#20102;&#27491;&#21017;&#21270;&#27169;&#22411;&#30340;&#33391;&#24577;&#24615;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#28151;&#27788;&#20256;&#25773;&#12290;&#25105;&#20204;&#36890;&#36807;&#25968;&#20540;&#23454;&#39564;&#35777;&#26126;&#65292;&#36825;&#20010;&#32463;&#36807;&#27491;&#21017;&#21270;&#30340;&#27169;&#22411;&#33021;&#22815;&#23436;&#32654;&#22320;&#22797;&#21046;&#20856;&#22411;&#30340;&#23616;&#37096;&#27874;&#21160;&#29575;&#27169;&#22411;&#30340;&#26399;&#26435;&#20215;&#26684;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#20063;&#36866;&#29992;&#20110;&#26356;&#19968;&#33324;&#30340;McKean-Vlasov&#26041;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;
Motivated by the challenges related to the calibration of financial models, we consider the problem of numerically solving a singular McKean-Vlasov equation $$ d X_t= \sigma(t,X_t) X_t \frac{\sqrt v_t}{\sqrt {E[v_t|X_t]}}dW_t, $$ where $W$ is a Brownian motion and $v$ is an adapted diffusion process. This equation can be considered as a singular local stochastic volatility model. Whilst such models are quite popular among practitioners, unfortunately, its well-posedness has not been fully understood yet and, in general, is possibly not guaranteed at all. We develop a novel regularization approach based on the reproducing kernel Hilbert space (RKHS) technique and show that the regularized model is well-posed. Furthermore, we prove propagation of chaos. We demonstrate numerically that a thus regularized model is able to perfectly replicate option prices due to typical local volatility models. Our results are also applicable to more general McKean--Vlasov equations.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20855;&#26377;&#20869;&#29983;&#25345;&#20037;&#24066;&#22330;&#24433;&#21709;&#30340;&#19981;&#23436;&#20840;&#37329;&#34701;&#24066;&#22330;&#20013;&#65292;&#22823;&#22411;&#25237;&#36164;&#32773;&#30340;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#12290;&#36890;&#36807;&#35299;&#20915;&#19968;&#32452;&#32806;&#21512;&#30340;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65292;&#25105;&#20204;&#23436;&#20840;&#25551;&#36848;&#20102;&#38382;&#39064;&#30340;&#26368;&#20248;&#24615;&#65292;&#24182;&#19988;&#32473;&#20986;&#20102;&#35299;&#30340;&#23384;&#22312;&#24615;&#21644;&#20809;&#28369;&#24615;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2005.04312</link><description>&lt;p&gt;
&#20869;&#29983;&#23450;&#20215;&#19979;&#30340;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Utility maximization under endogenous pricing. (arXiv:2005.04312v3 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2005.04312
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20855;&#26377;&#20869;&#29983;&#25345;&#20037;&#24066;&#22330;&#24433;&#21709;&#30340;&#19981;&#23436;&#20840;&#37329;&#34701;&#24066;&#22330;&#20013;&#65292;&#22823;&#22411;&#25237;&#36164;&#32773;&#30340;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#12290;&#36890;&#36807;&#35299;&#20915;&#19968;&#32452;&#32806;&#21512;&#30340;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65292;&#25105;&#20204;&#23436;&#20840;&#25551;&#36848;&#20102;&#38382;&#39064;&#30340;&#26368;&#20248;&#24615;&#65292;&#24182;&#19988;&#32473;&#20986;&#20102;&#35299;&#30340;&#23384;&#22312;&#24615;&#21644;&#20809;&#28369;&#24615;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20855;&#26377;&#20869;&#29983;&#25345;&#20037;&#24066;&#22330;&#24433;&#21709;&#30340;&#19981;&#23436;&#20840;&#37329;&#34701;&#24066;&#22330;&#20013;&#65292;&#19968;&#20301;&#22823;&#22411;&#25237;&#36164;&#32773;&#30340;&#39044;&#26399;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#12290;&#20551;&#35774;&#36164;&#20135;&#20215;&#26684;&#36981;&#24490;&#24066;&#22330;&#19978;&#20195;&#34920;&#24615;&#27969;&#21160;&#24615;&#20379;&#24212;&#21830;&#30340;&#25928;&#29992;&#19981;&#21464;&#26354;&#32447;&#20316;&#20026;&#38750;&#32447;&#24615;&#20215;&#26684;&#26354;&#32447;&#12290;&#25105;&#20204;&#36890;&#36807;&#19968;&#32452;&#32806;&#21512;&#30340;&#21069;&#21521;-&#21518;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65288;FBSDEs&#65289;&#23436;&#20840;&#25551;&#36848;&#20986;&#26368;&#20248;&#24615;&#65292;&#35813;&#26041;&#31243;&#32452;&#23545;&#24212;&#38750;&#32447;&#24615;&#21453;&#21521;&#38543;&#26426;&#20559;&#24494;&#20998;&#26041;&#31243;&#65288;BSPDE&#65289;&#12290;&#22312;&#24066;&#22330;&#20195;&#34920;&#24615;&#24066;&#22330;&#21046;&#36896;&#21830;&#30340;&#39537;&#21160;&#20989;&#25968;&#33267;&#23569;&#21576;&#20108;&#27425;&#22686;&#38271;&#25110;&#22823;&#22411;&#25237;&#36164;&#32773;&#30340;&#25928;&#29992;&#20989;&#25968;&#19979;&#38477;&#24471;&#27604;&#20108;&#27425;&#26356;&#24555;&#25110;&#21576;&#25351;&#25968;&#24418;&#24335;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#26368;&#20248;&#25237;&#36164;&#38382;&#39064;&#21644;FBSDEs&#30340;&#35299;&#30340;&#23384;&#22312;&#24615;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;BSPDEs&#35299;&#23384;&#22312;&#30340;&#20809;&#28369;&#24615;&#32467;&#26524;&#12290;&#25991;&#20013;&#25552;&#20379;&#20102;&#23436;&#20840;&#24066;&#22330;&#24773;&#20917;&#19979;&#30340;&#31034;&#20363;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the expected utility maximization problem of a large investor who is allowed to make transactions on tradable assets in an incomplete financial market with endogenous permanent market impacts. The asset prices are assumed to follow a nonlinear price curve quoted in the market as the utility indifference curve of a representative liquidity supplier. We show that optimality can be fully characterized via a system of coupled forward-backward stochastic differential equations (FBSDEs) which corresponds to a non-linear backward stochastic partial differential equation (BSPDE). We show existence of solutions to the optimal investment problem and the FBSDEs in the case where the driver function of the representative market maker grows at least quadratically or the utility function of the large investor falls faster than quadratically or is exponential. Furthermore, we derive smoothness results for the existence of solutions of BSPDEs. Examples are provided when the market is complete
&lt;/p&gt;</description></item></channel></rss>