<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#36890;&#36807;&#20998;&#26512;&#22312;JD.com&#19978;&#30340;&#28023;&#37327;&#20135;&#21697;&#35780;&#20215;&#65292;&#35777;&#26126;&#20102;&#28040;&#36153;&#32773;&#35780;&#35770;&#20013;&#34920;&#36798;&#30340;&#24773;&#32490;&#21487;&#20197;&#24433;&#21709;&#32929;&#31080;&#22238;&#25253;&#65292;&#38416;&#36848;&#20102;&#22312;&#32447;&#28385;&#24847;&#24230;&#21487;&#20197;&#25104;&#20026;&#32929;&#31080;&#24066;&#22330;&#20013;&#30340;&#37325;&#35201;&#22240;&#32032;&#12290;</title><link>http://arxiv.org/abs/2306.12119</link><description>&lt;p&gt;
&#23458;&#25143;&#22312;&#32447;&#28385;&#24847;&#24230;&#23545;&#32929;&#31080;&#22238;&#25253;&#30340;&#24433;&#21709;&#65306;&#20197;&#20013;&#22269;&#30005;&#23376;&#21830;&#21153;&#35780;&#35770;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
The Impact of Customer Online Satisfaction on Stock Returns: Evidence from the E-commerce Reviews in China. (arXiv:2306.12119v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.12119
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#20998;&#26512;&#22312;JD.com&#19978;&#30340;&#28023;&#37327;&#20135;&#21697;&#35780;&#20215;&#65292;&#35777;&#26126;&#20102;&#28040;&#36153;&#32773;&#35780;&#35770;&#20013;&#34920;&#36798;&#30340;&#24773;&#32490;&#21487;&#20197;&#24433;&#21709;&#32929;&#31080;&#22238;&#25253;&#65292;&#38416;&#36848;&#20102;&#22312;&#32447;&#28385;&#24847;&#24230;&#21487;&#20197;&#25104;&#20026;&#32929;&#31080;&#24066;&#22330;&#20013;&#30340;&#37325;&#35201;&#22240;&#32032;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#28040;&#36153;&#32773;&#35266;&#28857;&#19982;&#20215;&#20540;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#20197;&#20013;&#22269;A&#32929;&#24066;&#22330;&#20026;&#20363;&#12290;&#36890;&#36807;&#20998;&#26512;&#22312;JD.com&#19978;&#30340;&#36229;&#36807;1800&#19975;&#20010;&#20135;&#21697;&#35780;&#20215;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#28040;&#36153;&#32773;&#35780;&#35770;&#20013;&#34920;&#36798;&#30340;&#24773;&#32490;&#21487;&#20197;&#24433;&#21709;&#32929;&#31080;&#22238;&#25253;&#65292;&#38416;&#36848;&#20102;&#23458;&#25143;&#35266;&#28857;&#21253;&#21547;&#21487;&#20197;&#24433;&#21709;&#32929;&#31080;&#24066;&#22330;&#30340;&#26377;&#20215;&#20540;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper investigates the significance of consumer opinions in relation to value in China's A-share market. By analyzing a large dataset comprising over 18 million product reviews by customers on JD.com, we demonstrate that sentiments expressed in consumer reviews can influence stock returns, indicating that consumer opinions contain valuable information that can impact the stock market. Our findings show that Customer Negative Sentiment Tendency (CNST) and One-Star Tendency (OST) have a negative effect on expected stock returns, even after controlling for firm characteristics such as market risk, illiquidity, idiosyncratic volatility, and asset growth. Further analysis reveals that the predictive power of CNST is stronger in firms with high sentiment conditions, growth companies, and firms with lower accounting transparency. We also find that CNST negatively predicts revenue surprises, earnings surprises, and cash flow shocks. These results suggest that online satisfaction derived f
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20998;&#26512;&#20102;&#20445;&#25252;&#21435;&#20013;&#24515;&#21270;&#20511;&#36151;&#21327;&#35758;&#20813;&#21463;&#31354;&#22836;&#25915;&#20987;&#30340;&#38590;&#28857;&#65292;&#24182;&#24378;&#35843;&#23454;&#26045;&#24555;&#36895;&#24178;&#39044;&#25152;&#38656;&#30340;&#25514;&#26045;&#12290;</title><link>http://arxiv.org/abs/2302.04068</link><description>&lt;p&gt;
DeFi&#20511;&#36151;&#24066;&#22330;&#20013;&#30340;&#31354;&#22836;&#25915;&#20987;&#65306;&#21435;&#20013;&#24515;&#21270;&#38754;&#20020;&#21361;&#26426;&#65311;
&lt;/p&gt;
&lt;p&gt;
Short Squeeze in DeFi Lending Market: Decentralization in Jeopardy?. (arXiv:2302.04068v2 [cs.CR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.04068
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;&#20445;&#25252;&#21435;&#20013;&#24515;&#21270;&#20511;&#36151;&#21327;&#35758;&#20813;&#21463;&#31354;&#22836;&#25915;&#20987;&#30340;&#38590;&#28857;&#65292;&#24182;&#24378;&#35843;&#23454;&#26045;&#24555;&#36895;&#24178;&#39044;&#25152;&#38656;&#30340;&#25514;&#26045;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;2022&#24180;11&#26376;&#65292;Aave&#31038;&#21306;&#30340;&#28966;&#34385;&#27700;&#24179;&#28608;&#22686;&#65292;&#22240;&#20026;Avi Eisenberg&#23545;Aave&#36827;&#34892;&#20102;&#25915;&#20987;&#12290; Eisenberg&#35797;&#22270;&#36890;&#36807;&#22312;&#21327;&#35758;&#19978;&#20511;&#27454;&#20154;&#20026;&#30340;&#26041;&#24335;&#65292;&#31354;&#22836;CRV&#20195;&#24065;&#65292;&#20154;&#20026;&#21387;&#20302;CRV&#30340;&#20215;&#20540;&#12290;&#23613;&#31649;&#25915;&#20987;&#26368;&#32456;&#22833;&#36133;&#20102;&#65292;&#23427;&#20173;&#35753;Aave&#31038;&#21306;&#24863;&#21040;&#23475;&#24597;&#65292;&#29978;&#33267;&#24341;&#36215;&#20102;&#20851;&#20110;&#21435;&#20013;&#24515;&#21270;&#27835;&#29702;&#19979;&#22823;&#22411;&#20511;&#36151;&#24179;&#21488;&#21487;&#34892;&#24615;&#30340;&#30097;&#38382;&#12290;&#26412;&#25991;&#20998;&#26512;&#20102;Avi Eisenberg&#30340;&#34892;&#21160;&#65292;&#23637;&#31034;&#20102;&#20182;&#22914;&#20309;&#36890;&#36807;&#22312;&#21435;&#20013;&#24515;&#21270;&#21644;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#19978;&#23558;&#22823;&#37327;&#20511;&#26469;&#30340;CRV&#21334;&#20986;&#31283;&#23450;&#24065;&#65292;&#20154;&#20026;&#38477;&#20302;CRV&#30340;&#20215;&#26684;&#12290;&#23613;&#31649;&#25915;&#20987;&#26410;&#36930;&#65292;&#20294;&#20173;&#23548;&#33268;&#36229;&#36807;150&#19975;&#32654;&#20803;&#30340;&#19981;&#21487;&#25405;&#22238;&#30340;&#20538;&#21153;&#65292;&#20174;&#32780;&#20351;&#35813;&#21327;&#35758;&#19981;&#21487;&#25405;&#22238;&#30340;&#20538;&#21153;&#22686;&#21152;&#20102;&#22235;&#20493;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#24378;&#35843;&#20182;&#30340;&#25915;&#20987;&#26159;&#30001;&#20110;&#21487;&#20379;&#20511;&#29992;&#30340;CRV&#27604;&#20363;&#36807;&#22823;&#65292;&#20197;&#21450;Aave&#30340;&#20511;&#36151;&#21327;&#35758;&#35774;&#35745;&#38459;&#30861;&#20102;&#24555;&#36895;&#24178;&#39044;&#32780;&#34987;&#21551;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Anxiety levels in the Aave community spiked in November 2022 as Avi Eisenberg performed an attack on Aave. Eisenberg attempted to short the CRV token by using funds borrowed on the protocol to artificially deflate the value of CRV. While the attack was ultimately unsuccessful, it left the Aave community scared and even raised question marks regarding the feasibility of large lending platforms under decentralized governance.  In this work, we analyze Avi Eisenberg's actions and show how he was able to artificially lower the price of CRV by selling large quantities of borrowed CRV for stablecoins on both decentralized and centralized exchanges. Despite the failure of his attack, it still led to irretrievable debt worth more than 1.5 Mio USD at the time and, thereby, quadrupled the protocol's irretrievable debt. Furthermore, we highlight that his attack was enabled by the vast proportion of CRV available to borrow as well as Aave's lending protocol design hindering rapid intervention. We 
&lt;/p&gt;</description></item><item><title>&#22312;&#30740;&#31350;&#20102;&#30001;12&#20010;&#20013;&#27431;&#22269;&#23478;&#24418;&#25104;&#30340;100%&#21487;&#20877;&#29983;&#33021;&#28304;&#22330;&#26223;&#20013;&#65292;&#24471;&#20986;&#32467;&#26524;&#34920;&#26126;&#65306;&#36328;&#22269;&#22320;&#29702;&#24179;&#34913;&#21487;&#20197;&#23558;&#23384;&#20648;&#38656;&#27714;&#38477;&#20302;&#32422;30%&#65292;&#20854;&#21407;&#22240;&#26159;&#19981;&#21516;&#22320;&#21306;&#30340;&#39118;&#21644;&#22826;&#38451;&#33021;&#33021;&#22815;&#30456;&#20114;&#34917;&#20805;&#21457;&#30005;&#36718;&#24275;&#12290;&#22240;&#27492;&#65292;&#21306;&#22495;&#20043;&#38388;&#30340;&#36827;&#19968;&#27493;&#20114;&#36830;&#21487;&#20197;&#26174;&#33879;&#38477;&#20302;100%&#21487;&#20877;&#29983;&#33021;&#28304;&#31995;&#32479;&#30340;&#25104;&#26412;&#12290;</title><link>http://arxiv.org/abs/2211.16419</link><description>&lt;p&gt;
&#39118;&#30005;&#22320;&#29702;&#24179;&#34913;&#20943;&#23569;&#20102;&#27431;&#27954;&#21487;&#20877;&#29983;&#33021;&#28304;&#21457;&#30005;&#39046;&#22495;&#25152;&#38656;&#23384;&#20648;&#23481;&#37327;&#8212;&#8212;&#19968;&#31181;&#30740;&#31350;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
Geographical balancing of wind power decreases storage needs in a 100% renewable European power sector. (arXiv:2211.16419v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.16419
&lt;/p&gt;
&lt;p&gt;
&#22312;&#30740;&#31350;&#20102;&#30001;12&#20010;&#20013;&#27431;&#22269;&#23478;&#24418;&#25104;&#30340;100%&#21487;&#20877;&#29983;&#33021;&#28304;&#22330;&#26223;&#20013;&#65292;&#24471;&#20986;&#32467;&#26524;&#34920;&#26126;&#65306;&#36328;&#22269;&#22320;&#29702;&#24179;&#34913;&#21487;&#20197;&#23558;&#23384;&#20648;&#38656;&#27714;&#38477;&#20302;&#32422;30%&#65292;&#20854;&#21407;&#22240;&#26159;&#19981;&#21516;&#22320;&#21306;&#30340;&#39118;&#21644;&#22826;&#38451;&#33021;&#33021;&#22815;&#30456;&#20114;&#34917;&#20805;&#21457;&#30005;&#36718;&#24275;&#12290;&#22240;&#27492;&#65292;&#21306;&#22495;&#20043;&#38388;&#30340;&#36827;&#19968;&#27493;&#20114;&#36830;&#21487;&#20197;&#26174;&#33879;&#38477;&#20302;100%&#21487;&#20877;&#29983;&#33021;&#28304;&#31995;&#32479;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20026;&#20102;&#20943;&#23569;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#65292;&#35768;&#22810;&#22269;&#23478;&#35745;&#21010;&#22823;&#35268;&#27169;&#25193;&#24314;&#39118;&#30005;&#21644;&#22826;&#38451;&#33021;&#20809;&#20239;&#21457;&#30005;&#23481;&#37327;&#12290;&#36825;&#20123;&#21487;&#21464;&#30340;&#21487;&#20877;&#29983;&#33021;&#28304;&#38656;&#35201;&#30005;&#21147;&#37096;&#38376;&#20855;&#22791;&#26356;&#39640;&#30340;&#28789;&#27963;&#24615;&#12290;&#36890;&#36807;&#20114;&#36830;&#21487;&#20197;&#23454;&#29616;&#22320;&#29702;&#24179;&#34913;&#65292;&#30005;&#21147;&#23384;&#20648;&#20063;&#21487;&#20197;&#25552;&#20379;&#27492;&#31181;&#28789;&#27963;&#24615;&#12290;&#22312;&#19968;&#20010;&#30001;&#21313;&#20108;&#20010;&#20013;&#27431;&#22269;&#23478;&#26500;&#25104;&#30340;100%&#21487;&#20877;&#29983;&#33021;&#28304;&#22330;&#26223;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#36328;&#22269;&#22320;&#29702;&#24179;&#34913;&#22914;&#20309;&#20943;&#23569;&#30005;&#21147;&#20648;&#23384;&#30340;&#38656;&#35201;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#36129;&#29486;&#26159;&#20174;&#22240;&#32032;&#20998;&#35299;&#30340;&#35282;&#24230;&#20998;&#31163;&#24182;&#37327;&#21270;&#20102;&#21508;&#31181;&#22240;&#32032;&#30340;&#24433;&#21709;&#12290;&#24212;&#29992;&#23481;&#37327;&#25193;&#23637;&#27169;&#22411;&#21644;&#22240;&#23376;&#20998;&#35299;&#26041;&#27861;&#65292;&#36890;&#36807;&#19981;&#21516;&#30340;&#22240;&#32032;&#65306;&#22269;&#23478;&#30340;&#22826;&#38451;&#33021;&#20809;&#20239;&#21644;&#39118;&#21147;&#21457;&#30005;&#21487;&#29992;&#24615;&#27169;&#24335;&#12289;&#36127;&#36733;&#26354;&#32447;&#20197;&#21450;&#27700;&#21147;&#21457;&#30005;&#21644;&#29983;&#29289;&#33021;&#28304;&#23481;&#37327;&#32452;&#21512;&#26469;&#35299;&#24320;&#20114;&#36830;&#23545;&#20110;&#26368;&#20339;&#20648;&#23384;&#33021;&#21147;&#30340;&#24433;&#21709;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#19982;&#20165;&#20855;&#26377;&#23384;&#20648;&#20294;&#19981;&#20855;&#26377;&#20114;&#36830;&#30340;&#22330;&#26223;&#30456;&#27604;&#65292;&#20114;&#36830;&#21487;&#23558;&#23384;&#20648;&#38656;&#27714;&#38477;&#20302;&#32422;30%&#12290;&#20648;&#23384;&#38656;&#27714;&#30340;&#38477;&#20302;&#26159;&#30001;&#20110;&#27431;&#27954;&#19981;&#21516;&#22320;&#21306;&#30340;&#39118;&#21644;&#22826;&#38451;&#33021;&#30340;&#20114;&#34917;&#21457;&#30005;&#36718;&#24275;&#12290;&#36825;&#34920;&#26126;&#22312;&#21306;&#22495;&#20043;&#38388;&#36827;&#19968;&#27493;&#21457;&#23637;&#20114;&#32852;&#33021;&#26497;&#22823;&#22320;&#38477;&#20302;100%&#21487;&#20877;&#29983;&#33021;&#28304;&#31995;&#32479;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
To reduce greenhouse gas emissions, many countries plan to massively expand wind power and solar photovoltaic capacities. These variable renewable energy sources require additional flexibility in the power sector. Both geographical balancing enabled by interconnection and electricity storage can provide such flexibility. In a 100% renewable energy scenario of twelve central European countries, we investigate how geographical balancing between countries reduces the need for electricity storage. Our principal contribution is to separate and quantify the different factors at play. Applying a capacity expansion model and a factorization method, we disentangle the effect of interconnection on optimal storage capacities through distinct factors: differences in countries' solar PV and wind power availability patterns, load profiles, as well as hydropower and bioenergy capacity portfolios. Results show that interconnection reduces storage needs by around 30% in contrast to a scenario without i
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#30001;&#21512;&#20316;&#20154;&#21592;&#21644;&#38750;&#21512;&#20316;&#20154;&#21592;&#32452;&#25104;&#30340;&#24066;&#22330;&#20013;&#35777;&#21048;&#20215;&#26684;&#24418;&#25104;&#30340;&#22343;&#34913;&#27169;&#22411;&#65292;&#25552;&#20986;&#20102;&#20013;&#24515;&#35745;&#21010;&#32773;&#21327;&#35843;&#27599;&#20010;&#21512;&#20316;&#25104;&#21592;&#30340;&#20132;&#26131;&#30340;&#20551;&#35774;&#65292;&#24182;&#35777;&#26126;&#20102;&#22312;&#21512;&#20316;&#20154;&#21475;&#30456;&#23545;&#36739;&#23567;&#30340;&#24773;&#20917;&#19979;&#23384;&#22312;&#21807;&#19968;&#30340;&#22343;&#34913;&#12290;</title><link>http://arxiv.org/abs/2209.12639</link><description>&lt;p&gt;
&#20855;&#26377;&#21512;&#20316;&#21644;&#38750;&#21512;&#20316;&#20154;&#21475;&#30340;&#35777;&#21048;&#22343;&#34913;&#23450;&#20215;&#27169;&#22411;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Equilibrium pricing of securities in the co-presence of cooperative and non-cooperative populations. (arXiv:2209.12639v2 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.12639
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#30001;&#21512;&#20316;&#20154;&#21592;&#21644;&#38750;&#21512;&#20316;&#20154;&#21592;&#32452;&#25104;&#30340;&#24066;&#22330;&#20013;&#35777;&#21048;&#20215;&#26684;&#24418;&#25104;&#30340;&#22343;&#34913;&#27169;&#22411;&#65292;&#25552;&#20986;&#20102;&#20013;&#24515;&#35745;&#21010;&#32773;&#21327;&#35843;&#27599;&#20010;&#21512;&#20316;&#25104;&#21592;&#30340;&#20132;&#26131;&#30340;&#20551;&#35774;&#65292;&#24182;&#35777;&#26126;&#20102;&#22312;&#21512;&#20316;&#20154;&#21475;&#30456;&#23545;&#36739;&#23567;&#30340;&#24773;&#20917;&#19979;&#23384;&#22312;&#21807;&#19968;&#30340;&#22343;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#38024;&#23545;&#30001;&#20004;&#31181;&#19981;&#21516;&#31867;&#22411;&#20154;&#21475;&#32452;&#25104;&#30340;&#24066;&#22330;&#65292;&#21363;&#30001;&#21512;&#20316;&#20154;&#21592;&#21644;&#38750;&#21512;&#20316;&#20154;&#21592;&#32452;&#25104;&#30340;&#24066;&#22330;&#65292;&#24320;&#21457;&#20102;&#19968;&#20010;&#35777;&#21048;&#20215;&#26684;&#24418;&#25104;&#30340;&#22343;&#34913;&#27169;&#22411;&#12290;&#20551;&#35774;&#20013;&#24515;&#35745;&#21010;&#32773;&#21327;&#35843;&#27599;&#20010;&#21512;&#20316;&#25104;&#21592;&#30340;&#20132;&#26131;&#12290;&#22312;&#22823;&#20154;&#21475;&#38382;&#39064;&#20013;&#65292;&#20013;&#22830;&#35745;&#21010;&#32773;&#30340;&#38382;&#39064;&#34987;&#35777;&#26126;&#26159;&#19968;&#20010;&#26465;&#20214;&#25193;&#23637;&#30340;&#22343;&#22330;&#25511;&#21046;&#38382;&#39064;&#12290;&#38500;&#20102;&#20984;&#24615;&#20551;&#35774;&#22806;&#65292;&#22914;&#26524;&#21512;&#20316;&#20154;&#21475;&#30340;&#30456;&#23545;&#22823;&#23567;&#36275;&#22815;&#23567;&#65292;&#21017;&#25105;&#20204;&#33021;&#22815;&#35777;&#26126;&#26377;&#38480;&#20195;&#29702;&#21644;&#22343;&#20540;&#22330;&#19979;&#23384;&#22312;&#21807;&#19968;&#30340;&#22343;&#34913;&#12290;&#22312;&#30456;&#21516;&#26465;&#20214;&#19979;&#36824;&#35777;&#26126;&#20102;&#24378;&#25910;&#25947;&#21040;&#22343;&#20540;&#22330;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this work, we develop an equilibrium model for price formation of securities in a market composed of two populations of different types: the first one consists of cooperative agents, while the other one consists of non-cooperative agents. The trading of every cooperative member is assumed to be coordinated by a central planner. In the large population limit, the problem for the central planner is shown to be a conditional extended mean-field control. In addition to the convexity assumptions, if the relative size of the cooperative population is small enough, then we are able to show the existence of a unique equilibrium for both the finite-agent and the mean-field models. The strong convergence to the mean-field model is also proved under the same conditions.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102; Mack &#27169;&#22411;&#19979;&#20934;&#22791;&#37329;&#21644;&#39044;&#27979;&#22343;&#26041;&#35823;&#24046;&#23545;&#31163;&#32676;&#20540;&#30340;&#25935;&#24863;&#24615;&#65292;&#24182;&#36890;&#36807;&#23548;&#20986;&#24433;&#21709;&#20989;&#25968;&#20998;&#26512;&#24635;&#20934;&#22791;&#37329;&#20551;&#23450;&#20026;&#23545;&#25968;&#27491;&#24577;&#20998;&#24067;&#26102;&#20998;&#20301;&#25968;&#30340;&#24433;&#21709;&#20989;&#25968;&#12290;</title><link>http://arxiv.org/abs/2203.00184</link><description>&lt;p&gt;
&#35770;&#25439;&#22833;&#20934;&#22791;&#20013;&#31163;&#32676;&#20540;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
On the impact of outliers in loss reserving. (arXiv:2203.00184v2 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.00184
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102; Mack &#27169;&#22411;&#19979;&#20934;&#22791;&#37329;&#21644;&#39044;&#27979;&#22343;&#26041;&#35823;&#24046;&#23545;&#31163;&#32676;&#20540;&#30340;&#25935;&#24863;&#24615;&#65292;&#24182;&#36890;&#36807;&#23548;&#20986;&#24433;&#21709;&#20989;&#25968;&#20998;&#26512;&#24635;&#20934;&#22791;&#37329;&#20551;&#23450;&#20026;&#23545;&#25968;&#27491;&#24577;&#20998;&#24067;&#26102;&#20998;&#20301;&#25968;&#30340;&#24433;&#21709;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#25454;&#20013;&#23384;&#22312;&#31163;&#32676;&#20540;&#25110;&#19982;&#27169;&#22411;&#20551;&#35774;&#20559;&#24046;&#23545;&#25439;&#22833;&#20934;&#22791;&#25216;&#26415;&#30340;&#25935;&#24863;&#24615;&#26159;&#19968;&#20010;&#20247;&#25152;&#21608;&#30693;&#30340;&#25361;&#25112;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#27969;&#34892;&#30340;&#38142;&#38145;&#20648;&#22791;&#26041;&#27861;&#38754;&#20020;&#30456;&#24403;&#22823;&#30340;&#39118;&#38505;&#65292;&#22240;&#20026;&#21363;&#20351;&#23384;&#22312;&#19968;&#20010;&#31163;&#32676;&#35266;&#27979;&#20540;&#65292;&#20934;&#22791;&#37329;&#20272;&#35745;&#20063;&#21487;&#33021;&#20250;&#26174;&#33879;&#20559;&#31227;&#12290;&#22240;&#27492;&#65292;&#38142;&#38145;&#20934;&#22791;&#25216;&#26415;&#26159;&#38750;&#40065;&#26834;&#30340;&#12290;&#26412;&#25991;&#36890;&#36807;&#23548;&#20986;&#24433;&#21709;&#20989;&#25968;&#26469;&#30740;&#31350; Mack &#27169;&#22411;&#19979;&#20934;&#22791;&#37329;&#21644;&#39044;&#27979;&#22343;&#26041;&#35823;&#24046;&#23545;&#31163;&#32676;&#20540;&#30340;&#25935;&#24863;&#24615;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#36824;&#25552;&#20379;&#24182;&#35752;&#35770;&#20102;&#24403;&#24635;&#20934;&#22791;&#37329;&#20551;&#23450;&#20026;&#23545;&#25968;&#27491;&#24577;&#20998;&#24067;&#26102;&#65292;&#20998;&#20301;&#25968;&#30340;&#24433;&#21709;&#20989;&#25968;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#27604;&#36739;&#20102; Mack &#27169;&#22411;&#19979;&#20010;&#21035;&#20107;&#25925;&#24180;&#24230;&#20934;&#22791;&#37329;&#21644; Bornhuetter-Ferguson &#26041;&#27861;&#30340;&#24433;&#21709;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
The sensitivity of loss reserving techniques to outliers in the data or deviations from model assumptions is a well known challenge. It has been shown that the popular chain-ladder reserving approach is at significant risk to such aberrant observations in that reserve estimates can be significantly shifted in the presence of even one outlier. As a consequence the chain-ladder reserving technique is non-robust. In this paper we investigate the sensitivity of reserves and mean squared errors of prediction under Mack's Model (Mack, 1993). This is done through the derivation of impact functions which are calculated by taking the first derivative of the relevant statistic of interest with respect to an observation. We also provide and discuss the impact functions for quantiles when total reserves are assumed to be lognormally distributed. Additionally, comparisons are made between the impact functions for individual accident year reserves under Mack's Model and the Bornhuetter-Ferguson meth
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;GNN&#31639;&#27861;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#36890;&#20449;&#32593;&#32476;&#20013;&#22788;&#29702;&#36830;&#25509;&#25925;&#38556;&#24341;&#36215;&#30340;&#32602;&#27454;&#20998;&#24067;&#65292;&#24182;&#21487;&#20197;&#20934;&#30830;&#22320;&#27169;&#25311;&#21508;&#31181;&#29616;&#26377;&#25299;&#25169;&#32467;&#26500;&#20013;&#30340;&#24809;&#32602;&#65292;&#22312;&#23454;&#36341;&#20013;&#36824;&#33719;&#24471;&#20102;&#36229;&#36807;12,000&#20493;&#30340;&#36895;&#24230;&#25552;&#39640;&#12290;</title><link>http://arxiv.org/abs/2201.12263</link><description>&lt;p&gt;
RiskNet:&#19981;&#21487;&#38752;&#36164;&#28304;&#32593;&#32476;&#30340;&#31070;&#32463;&#39118;&#38505;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
RiskNet: Neural Risk Assessment in Networks of Unreliable Resources. (arXiv:2201.12263v2 [cs.NI] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.12263
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;GNN&#31639;&#27861;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#36890;&#20449;&#32593;&#32476;&#20013;&#22788;&#29702;&#36830;&#25509;&#25925;&#38556;&#24341;&#36215;&#30340;&#32602;&#27454;&#20998;&#24067;&#65292;&#24182;&#21487;&#20197;&#20934;&#30830;&#22320;&#27169;&#25311;&#21508;&#31181;&#29616;&#26377;&#25299;&#25169;&#32467;&#26500;&#20013;&#30340;&#24809;&#32602;&#65292;&#22312;&#23454;&#36341;&#20013;&#36824;&#33719;&#24471;&#20102;&#36229;&#36807;12,000&#20493;&#30340;&#36895;&#24230;&#25552;&#39640;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNN&#65289;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#39044;&#27979;&#36890;&#20449;&#32593;&#32476;&#20013;&#30340;&#25925;&#38556;&#24341;&#36215;&#30340;&#32602;&#27454;&#20998;&#24067;&#65292;&#20854;&#20013;&#36830;&#25509;&#21463;&#20849;&#20139;&#20110;&#24037;&#20316;&#36335;&#24452;&#21644;&#22791;&#29992;&#36335;&#24452;&#20043;&#38388;&#30340;&#36164;&#28304;&#20445;&#25252;&#12290;&#35813;GNN&#31639;&#27861;&#20165;&#20351;&#29992;&#36890;&#36807;Barab\'asi-Albert&#27169;&#22411;&#29983;&#25104;&#30340;&#38543;&#26426;&#22270;&#36827;&#34892;&#35757;&#32451;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#25152;&#24471;&#30340;&#27979;&#35797;&#32467;&#26524;&#34920;&#26126;&#25105;&#20204;&#21487;&#20197;&#20934;&#30830;&#22320;&#27169;&#25311;&#21508;&#31181;&#29616;&#26377;&#25299;&#25169;&#32467;&#26500;&#20013;&#30340;&#24809;&#32602;&#12290;GNN&#28040;&#38500;&#20102;&#22312;&#30740;&#31350;&#32593;&#32476;&#25299;&#25169;&#26102;&#27169;&#25311;&#22797;&#26434;&#25925;&#38556;&#22330;&#26223;&#30340;&#38656;&#35201;&#12290;&#22312;&#23454;&#36341;&#20013;&#65292;&#25972;&#20010;&#35774;&#35745;&#25805;&#20316;&#20165;&#21463;&#29616;&#20195;&#30828;&#20214;&#30340;4ms&#30340;&#38480;&#21046;&#12290;&#36825;&#26679;&#65292;&#25105;&#20204;&#21487;&#20197;&#33719;&#24471;&#36229;&#36807;12,000&#20493;&#30340;&#36895;&#24230;&#25552;&#39640;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a graph neural network (GNN)-based method to predict the distribution of penalties induced by outages in communication networks, where connections are protected by resources shared between working and backup paths. The GNN-based algorithm is trained only with random graphs generated with the Barab\'asi-Albert model. Even though, the obtained test results show that we can precisely model the penalties in a wide range of various existing topologies. GNNs eliminate the need to simulate complex outage scenarios for the network topologies under study. In practice, the whole design operation is limited by 4ms on modern hardware. This way, we can gain as much as over 12,000 times in the speed improvement.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#21644;&#26497;&#20540;&#29702;&#35770;&#30340;&#21160;&#24577;&#39118;&#38505;&#27979;&#37327;&#27169;&#22411;&#65292;&#32467;&#21512;&#37325;&#23614;&#20998;&#24067;&#21644;&#26464;&#26438;&#25928;&#24212;&#65292;&#33021;&#22815;&#26356;&#26377;&#25928;&#22320;&#36991;&#20813;&#37329;&#34701;&#39118;&#38505;&#12290;</title><link>http://arxiv.org/abs/2201.09434</link><description>&lt;p&gt;
&#36890;&#36807;MCMC&#22522;&#20110;&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#30340;EVT&#21160;&#24577;&#39118;&#38505;&#27979;&#37327;
&lt;/p&gt;
&lt;p&gt;
Dynamic Risk Measurement by EVT based on Stochastic Volatility models via MCMC. (arXiv:2201.09434v4 [stat.AP] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.09434
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#21644;&#26497;&#20540;&#29702;&#35770;&#30340;&#21160;&#24577;&#39118;&#38505;&#27979;&#37327;&#27169;&#22411;&#65292;&#32467;&#21512;&#37325;&#23614;&#20998;&#24067;&#21644;&#26464;&#26438;&#25928;&#24212;&#65292;&#33021;&#22815;&#26356;&#26377;&#25928;&#22320;&#36991;&#20813;&#37329;&#34701;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26088;&#22312;&#25551;&#36848;&#37329;&#34701;&#24066;&#22330;&#22238;&#25253;&#21644;&#27874;&#21160;&#24615;&#30340;&#20856;&#22411;&#20107;&#23454;&#29305;&#24449;&#65292;&#24182;&#35299;&#20915;&#36164;&#20135;&#22238;&#25253;&#30340;&#23614;&#37096;&#29305;&#24449;&#26410;&#34987;&#20805;&#20998;&#32771;&#34385;&#30340;&#38382;&#39064;&#65292;&#20197;&#26356;&#26377;&#25928;&#22320;&#36991;&#20813;&#39118;&#38505;&#21644;&#29983;&#20135;&#24615;&#22320;&#31649;&#29702;&#32929;&#31080;&#24066;&#22330;&#39118;&#38505;&#12290;&#22240;&#27492;&#65292;&#26412;&#25991;&#23558;&#37325;&#23614;&#20998;&#24067;&#21644;&#26464;&#26438;&#25928;&#24212;&#24341;&#20837;SV&#27169;&#22411;&#12290;&#28982;&#21518;&#65292;&#36890;&#36807;MCMC&#20272;&#31639;&#27169;&#22411;&#21442;&#25968;&#12290;&#38543;&#21518;&#65292;&#20840;&#38754;&#25551;&#36848;&#20102;&#37329;&#34701;&#24066;&#22330;&#22238;&#25253;&#30340;&#37325;&#23614;&#20998;&#24067;&#65292;&#24182;&#23558;&#20854;&#19982;&#26497;&#20540;&#29702;&#35770;&#30456;&#32467;&#21512;&#65292;&#20197;&#25311;&#21512;&#26631;&#20934;&#27531;&#24046;&#30340;&#23614;&#37096;&#20998;&#24067;&#12290;&#20854;&#21518;&#65292;&#24314;&#31435;&#20102;&#19968;&#31181;&#26032;&#30340;&#37329;&#34701;&#39118;&#38505;&#27979;&#37327;&#27169;&#22411;&#65292;&#31216;&#20026;SV-EVT-VaR&#21160;&#24577;&#27169;&#22411;&#12290;&#36890;&#36807;&#20351;&#29992;&#27599;&#26085;&#30340;&#26631;&#26222;500&#25351;&#25968;&#21644;&#27169;&#25311;&#22238;&#25253;&#65292;&#36798;&#25104;&#20102;&#23454;&#35777;&#32467;&#26524;&#65292;&#25581;&#31034;&#20102;SV-EVT&#27169;&#22411;&#22312;&#22806;&#26679;&#26412;&#22238;&#27979;&#20013;&#21487;&#20197;&#20248;&#20110;&#20854;&#20182;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper aims to characterize the typical factual characteristics of financial market returns and volatility and address the problem that the tail characteristics of asset returns have been not sufficiently considered, as an attempt to more effectively avoid risks and productively manage stock market risks. Thus, in this paper, the fat-tailed distribution and the leverage effect are introduced into the SV model. Next, the model parameters are estimated through MCMC. Subsequently, the fat-tailed distribution of financial market returns is comprehensively characterized and then incorporated with extreme value theory to fit the tail distribution of standard residuals. Afterward, a new financial risk measurement model is built, which is termed the SV-EVT-VaR-based dynamic model. With the use of daily S&amp;P 500 index and simulated returns, the empirical results are achieved, which reveal that the SV-EVT-based models can outperform other models for out-of-sample data in backtesting and depic
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23884;&#22871;&#27169;&#25311;&#30340;&#26032;&#26041;&#27861;&#65292;&#23427;&#33021;&#22815;&#22312;&#20445;&#25345;&#26465;&#20214;&#26399;&#26395;&#36275;&#22815;&#24179;&#28369;&#30340;&#24773;&#20917;&#19979;&#65292;&#26377;&#25928;&#22320;&#32531;&#35299;&#39640;&#32500;&#24230;&#20013;&#30340;&#32500;&#24230;&#28798;&#38590;&#65292;&#20197;&#26725;&#25509;&#26631;&#20934;&#23884;&#22871;&#27169;&#25311;&#30340;&#31435;&#26041;&#26681;&#25910;&#25947;&#29575;&#21644;&#26631;&#20934;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#30340;&#24179;&#26041;&#26681;&#25910;&#25947;&#29575;&#20043;&#38388;&#30340;&#24046;&#36317;&#12290;</title><link>http://arxiv.org/abs/2201.02958</link><description>&lt;p&gt;
&#24179;&#28369;&#30340;&#23884;&#22871;&#27169;&#25311;&#26041;&#27861;&#65306;&#22312;&#39640;&#32500;&#24230;&#20013;&#26725;&#25509;&#31435;&#26041;&#21644;&#24179;&#26041;&#26681;&#25910;&#25947;&#29575;
&lt;/p&gt;
&lt;p&gt;
Smooth Nested Simulation: Bridging Cubic and Square Root Convergence Rates in High Dimensions. (arXiv:2201.02958v4 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.02958
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23884;&#22871;&#27169;&#25311;&#30340;&#26032;&#26041;&#27861;&#65292;&#23427;&#33021;&#22815;&#22312;&#20445;&#25345;&#26465;&#20214;&#26399;&#26395;&#36275;&#22815;&#24179;&#28369;&#30340;&#24773;&#20917;&#19979;&#65292;&#26377;&#25928;&#22320;&#32531;&#35299;&#39640;&#32500;&#24230;&#20013;&#30340;&#32500;&#24230;&#28798;&#38590;&#65292;&#20197;&#26725;&#25509;&#26631;&#20934;&#23884;&#22871;&#27169;&#25311;&#30340;&#31435;&#26041;&#26681;&#25910;&#25947;&#29575;&#21644;&#26631;&#20934;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#30340;&#24179;&#26041;&#26681;&#25910;&#25947;&#29575;&#20043;&#38388;&#30340;&#24046;&#36317;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23884;&#22871;&#27169;&#25311;&#26159;&#36890;&#36807;&#27169;&#25311;&#26469;&#20272;&#35745;&#26465;&#20214;&#26399;&#26395;&#30340;&#21151;&#33021;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26680;&#23725;&#22238;&#24402;&#30340;&#26032;&#26041;&#27861;&#65292;&#20197;&#21033;&#29992;&#26465;&#20214;&#26399;&#26395;&#20316;&#20026;&#22810;&#32500;&#35843;&#33410;&#21464;&#37327;&#30340;&#24179;&#28369;&#20989;&#25968;&#12290;&#28176;&#36817;&#20998;&#26512;&#34920;&#26126;&#65292;&#21482;&#35201;&#26465;&#20214;&#26399;&#26395;&#36275;&#22815;&#24179;&#28369;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#33021;&#22815;&#22312;&#27169;&#25311;&#27425;&#25968;&#22686;&#21152;&#26102;&#26377;&#25928;&#22320;&#20943;&#23569;&#32500;&#24230;&#28798;&#38590;&#30340;&#24433;&#21709;&#12290;&#24179;&#28369;&#24615;&#26725;&#25509;&#20102;&#31435;&#26041;&#26681;&#25910;&#25947;&#29575;&#65288;&#21363;&#26631;&#20934;&#23884;&#22871;&#27169;&#25311;&#30340;&#26368;&#20248;&#25910;&#25947;&#29575;&#65289;&#21644;&#24179;&#26041;&#26681;&#25910;&#25947;&#29575;&#65288;&#21363;&#26631;&#20934;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#30340;&#35268;&#33539;&#25910;&#25947;&#29575;&#65289;&#20043;&#38388;&#30340;&#24046;&#36317;&#12290;&#25105;&#20204;&#36890;&#36807;&#32452;&#21512;&#39118;&#38505;&#31649;&#29702;&#21644;&#36755;&#20837;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#30340;&#25968;&#20540;&#31034;&#20363;&#65292;&#23637;&#31034;&#20102;&#25152;&#25552;&#20986;&#26041;&#27861;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Nested simulation concerns estimating functionals of a conditional expectation via simulation. In this paper, we propose a new method based on kernel ridge regression to exploit the smoothness of the conditional expectation as a function of the multidimensional conditioning variable. Asymptotic analysis shows that the proposed method can effectively alleviate the curse of dimensionality on the convergence rate as the simulation budget increases, provided that the conditional expectation is sufficiently smooth. The smoothness bridges the gap between the cubic root convergence rate (that is, the optimal rate for the standard nested simulation) and the square root convergence rate (that is, the canonical rate for the standard Monte Carlo simulation). We demonstrate the performance of the proposed method via numerical examples from portfolio risk management and input uncertainty quantification.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#23558;&#39118;&#38505;&#23545;&#20914;&#25972;&#21512;&#36827;&#20215;&#20540;&#23450;&#20215;&#30340;&#26032;&#38395;&#20379;&#24212;&#21830;&#27169;&#22411;&#20013;&#30340;&#39118;&#38505;&#31649;&#29702;&#27169;&#22411;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#39118;&#38505;&#23545;&#20914;&#31574;&#30053;&#19968;&#33324;&#20250;&#38477;&#20302;&#20225;&#19994;&#30340;&#26368;&#20248;&#21806;&#20215;&#21644;&#34394;&#25311;&#29983;&#20135;&#37327;&#65292;&#38656;&#35201;&#36866;&#24403;&#30340;&#30446;&#26631;&#24179;&#22343;&#25910;&#30410;&#21644;&#38656;&#27714;&#24377;&#24615;&#25165;&#33021;&#20445;&#35777;&#33719;&#24471;&#21033;&#28070;&#25913;&#36827;&#12290;</title><link>http://arxiv.org/abs/2201.01026</link><description>&lt;p&gt;
&#39118;&#38505;&#23545;&#20914;&#22914;&#20309;&#24433;&#21709;&#20225;&#19994;&#36816;&#33829;&#65311;&#26469;&#33258;&#23450;&#20215;&#26032;&#38395;&#20379;&#24212;&#21830;&#27169;&#22411;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
How Does Risk Hedging Impact Operations? Insights from a Price-Setting Newsvendor Model. (arXiv:2201.01026v4 [q-fin.RM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.01026
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#23558;&#39118;&#38505;&#23545;&#20914;&#25972;&#21512;&#36827;&#20215;&#20540;&#23450;&#20215;&#30340;&#26032;&#38395;&#20379;&#24212;&#21830;&#27169;&#22411;&#20013;&#30340;&#39118;&#38505;&#31649;&#29702;&#27169;&#22411;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#39118;&#38505;&#23545;&#20914;&#31574;&#30053;&#19968;&#33324;&#20250;&#38477;&#20302;&#20225;&#19994;&#30340;&#26368;&#20248;&#21806;&#20215;&#21644;&#34394;&#25311;&#29983;&#20135;&#37327;&#65292;&#38656;&#35201;&#36866;&#24403;&#30340;&#30446;&#26631;&#24179;&#22343;&#25910;&#30410;&#21644;&#38656;&#27714;&#24377;&#24615;&#25165;&#33021;&#20445;&#35777;&#33719;&#24471;&#21033;&#28070;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22914;&#26524;&#19968;&#20010;&#37329;&#34701;&#36164;&#20135;&#30340;&#20215;&#26684;&#21464;&#21160;&#20250;&#24433;&#21709;&#21040;&#19968;&#20010;&#20844;&#21496;&#30340;&#20135;&#21697;&#38656;&#27714;&#65292;&#35813;&#20844;&#21496;&#21487;&#20197;&#36890;&#36807;&#35843;&#25972;&#20854;&#36816;&#33829;&#20915;&#31574;&#26469;&#24212;&#23545;&#24433;&#21709;&#12290;&#26412;&#25991;&#36890;&#36807;&#23558;&#39118;&#38505;&#23545;&#20914;&#31574;&#30053;&#19982;&#36816;&#33829;&#20915;&#31574;&#20849;&#21516;&#24212;&#29992;&#20110;&#37329;&#34701;&#36164;&#20135;&#20013;&#65292;&#24320;&#21457;&#21644;&#35299;&#20915;&#20102;&#23558;&#39118;&#38505;&#23545;&#20914;&#25112;&#30053;&#25972;&#21512;&#36827;&#20215;&#20540;&#23450;&#20215;&#30340;&#26032;&#38395;&#20379;&#24212;&#21830;&#27169;&#22411;&#20013;&#30340;&#39118;&#38505;&#31649;&#29702;&#27169;&#22411;&#12290;&#25105;&#20204;&#35745;&#31639;&#20102;&#26368;&#20339;&#23545;&#20914;&#31574;&#30053;&#65292;&#24471;&#20986;&#20102;&#20248;&#21270;&#21806;&#20215;&#21644;&#34394;&#25311;&#29983;&#20135;&#37327;&#65288;VPQ&#65289;&#30340;&#26126;&#30830;&#30446;&#26631;&#20989;&#25968;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#39118;&#38505;&#23545;&#20914;&#36890;&#24120;&#20250;&#38477;&#20302;&#26368;&#20248;&#21806;&#20215;&#65292;&#21516;&#26102;&#20063;&#20250;&#38477;&#20302;&#26368;&#20248;VPQ&#12290;&#20294;&#26159;&#65292;&#39118;&#38505;&#23545;&#20914;&#23548;&#33268;&#30340;&#20215;&#26684;&#19979;&#38477;&#23558;&#20943;&#23569;&#29983;&#20135;&#30340;&#21033;&#28070;&#65292;&#20174;&#32780;&#20943;&#23569;&#20445;&#20540;&#32773;&#30340;&#24635;&#20307;&#21033;&#28070;&#12290;&#20026;&#20102;&#20445;&#35777;&#20174;&#23545;&#20914;&#21644;&#29983;&#20135;&#20013;&#33719;&#24471;&#21033;&#28070;&#25913;&#36827;&#65292;&#38656;&#35201;&#36866;&#24403;&#30340;&#30446;&#26631;&#24179;&#22343;&#25910;&#30410;&#21644;&#38656;&#27714;&#24377;&#24615;&#12290;&#26412;&#25991;&#25552;&#20986;&#30340;&#27169;&#22411;&#20026;&#20225;&#19994;&#30830;&#23450;&#20854;&#26368;&#20339;&#20215;&#20540;&#21644;&#23545;&#20914;&#20915;&#31574;&#25552;&#20379;&#20102;&#24314;&#35774;&#24615;&#30340;&#25351;&#23548;&#12290;
&lt;/p&gt;
&lt;p&gt;
If a financial asset's price movement impacts a firm's product demand, the firm can respond to the impact by adjusting its operational decisions. For example, in the automotive industry, car makers decrease the selling prices of fuel-inefficient cars when the oil price rises. Meanwhile, the firm can implement a risk-hedging strategy using the financial asset jointly with its operational decisions. Motivated by this, we develop and solve a general risk-management model integrating risk hedging into a price-setting newsvendor. The optimal hedging strategy is calculated analytically, which leads to an explicit objective function for optimizing price and ``virtual production quantity'' (VPQ). (The latter determines the service level, i.e., the demand fulfillment probability.) We find that hedging generally reduces the optimal price {when the firm sets the target mean return as its production-only maximum expected profit. With the same condition on the target mean return}, hedging also redu
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#38024;&#23545;&#22810;&#20803;&#20998;&#24067;&#24471;&#20998;&#35268;&#21017;&#30340;&#29702;&#35770;&#26694;&#26550;&#65292;&#24182;&#29983;&#25104;&#20102;&#26032;&#30340;&#24471;&#20998;&#35268;&#21017;&#12290;&#21516;&#26102;&#65292;&#23637;&#31034;&#20102;&#22914;&#20309;&#23558;&#24471;&#20998;&#35268;&#21017;&#20998;&#35299;&#20026;&#31561;&#32423;&#38598;&#19978;&#30340;&#24471;&#20998;&#35268;&#21017;&#12290;&#35813;&#26694;&#26550;&#20026;&#22810;&#20803;&#24471;&#20998;&#35268;&#21017;&#30340;&#32479;&#19968;&#26041;&#27861;&#25552;&#20379;&#20102;&#22522;&#30784;&#12290;</title><link>http://arxiv.org/abs/2002.09578</link><description>&lt;p&gt;
&#22810;&#20803;&#20998;&#24067;&#19982;&#31561;&#32423;&#38598;&#30340;&#24471;&#20998;
&lt;/p&gt;
&lt;p&gt;
Scores for Multivariate Distributions and Level Sets. (arXiv:2002.09578v6 [math.ST] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2002.09578
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#38024;&#23545;&#22810;&#20803;&#20998;&#24067;&#24471;&#20998;&#35268;&#21017;&#30340;&#29702;&#35770;&#26694;&#26550;&#65292;&#24182;&#29983;&#25104;&#20102;&#26032;&#30340;&#24471;&#20998;&#35268;&#21017;&#12290;&#21516;&#26102;&#65292;&#23637;&#31034;&#20102;&#22914;&#20309;&#23558;&#24471;&#20998;&#35268;&#21017;&#20998;&#35299;&#20026;&#31561;&#32423;&#38598;&#19978;&#30340;&#24471;&#20998;&#35268;&#21017;&#12290;&#35813;&#26694;&#26550;&#20026;&#22810;&#20803;&#24471;&#20998;&#35268;&#21017;&#30340;&#32479;&#19968;&#26041;&#27861;&#25552;&#20379;&#20102;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#20803;&#27010;&#29575;&#20998;&#24067;&#30340;&#39044;&#27979;&#22312;&#21508;&#31181;&#24212;&#29992;&#20013;&#37117;&#26159;&#24517;&#35201;&#30340;&#12290;&#24471;&#20998;&#35268;&#21017;&#20351;&#24471;&#21487;&#20197;&#35780;&#20272;&#39044;&#27979;&#20934;&#30830;&#24615;&#65292;&#24182;&#27604;&#36739;&#19981;&#21516;&#30340;&#39044;&#27979;&#26041;&#27861;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#38024;&#23545;&#22810;&#20803;&#20998;&#24067;&#24471;&#20998;&#35268;&#21017;&#30340;&#29702;&#35770;&#26694;&#26550;&#65292;&#20854;&#21253;&#25324;&#29616;&#26377;&#30340;&#20108;&#27425;&#24471;&#20998;&#35268;&#21017;&#21644;&#22810;&#20803;&#36830;&#32493;&#25490;&#21517;&#27010;&#29575;&#24471;&#20998;&#35268;&#21017;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#20351;&#29992;&#36825;&#20010;&#26694;&#26550;&#29983;&#25104;&#26032;&#30340;&#24471;&#20998;&#35268;&#21017;&#12290;&#22312;&#26576;&#20123;&#22810;&#20803;&#24773;&#22659;&#19979;&#65292;&#38656;&#35201;&#39044;&#27979;&#31561;&#32423;&#38598;&#65292;&#20363;&#22914;&#29992;&#20110;&#24322;&#24120;&#26816;&#27979;&#30340;&#23494;&#24230;&#31561;&#32423;&#38598;&#25110;&#32047;&#31215;&#20998;&#24067;&#30340;&#31561;&#32423;&#38598;&#20316;&#20026;&#39118;&#38505;&#24230;&#37327;&#12290;&#36825;&#20419;&#20351;&#32771;&#34385;&#38024;&#23545;&#27492;&#31867;&#31561;&#32423;&#38598;&#30340;&#24471;&#20998;&#20989;&#25968;&#12290;&#23545;&#20110;&#21333;&#21464;&#37327;&#20998;&#24067;&#65292;&#36830;&#32493;&#25490;&#21517;&#27010;&#29575;&#24471;&#20998;&#21487;&#20197;&#34920;&#31034;&#20026;&#20998;&#20301;&#25968;&#24471;&#20998;&#30340;&#31215;&#20998;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#31867;&#20284;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#23558;&#22810;&#20803;&#20998;&#24067;&#30340;&#24471;&#20998;&#35268;&#21017;&#20998;&#35299;&#20026;&#31561;&#32423;&#38598;&#24471;&#20998;&#35268;&#21017;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#26694;&#26550;&#25552;&#20379;&#20102;&#19968;&#31181;&#22810;&#20803;&#24471;&#20998;&#35268;&#21017;&#30340;&#32479;&#19968;&#26041;&#27861;&#65292;&#20026;&#26032;&#30340;&#24471;&#20998;&#20989;&#25968;&#30340;&#24320;&#21457;&#25552;&#20379;&#20102;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;
Forecasts of multivariate probability distributions are required for a variety of applications. Scoring rules enable the evaluation of forecast accuracy, and comparison between forecasting methods. We propose a theoretical framework for scoring rules for multivariate distributions, which encompasses the existing quadratic score and multivariate continuous ranked probability score. We demonstrate how this framework can be used to generate new scoring rules. In some multivariate contexts, it is a forecast of a level set that is needed, such as a density level set for anomaly detection or the level set of the cumulative distribution as a measure of risk. This motivates consideration of scoring functions for such level sets. For univariate distributions, it is well-established that the continuous ranked probability score can be expressed as the integral over a quantile score. We show that, in a similar way, scoring rules for multivariate distributions can be decomposed to obtain scoring fu
&lt;/p&gt;</description></item></channel></rss>