<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#20851;&#20110;&#27668;&#20505;&#20914;&#20987;&#23545;&#20914;&#31361;&#30340;&#26032;&#35777;&#25454;&#65292;&#34920;&#26126;El Ni&#241;o&#20107;&#20214;&#23545;&#20892;&#20316;&#29289;&#29983;&#38271;&#23395;&#21644;&#37319;&#25688;&#21518;&#26399;&#30340;&#20892;&#30000;&#20013;&#30340;&#25919;&#27835;&#26292;&#21147;&#20855;&#26377;&#36127;&#38754;&#24433;&#21709;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#20013;&#24378;&#24230;El Ni&#241;o&#20107;&#20214;&#23548;&#33268;&#30340;&#28023;&#38754;&#28201;&#24230;&#19978;&#21319;1&#176;C&#23558;&#33267;&#23569;&#20943;&#23569;&#19977;&#20010;&#30334;&#20998;&#28857;&#30340;&#25919;&#27835;&#26292;&#21147;&#19982;&#38024;&#23545;&#24179;&#27665;&#30340;&#20914;&#31361;&#12290;&#36825;&#19968;&#21457;&#29616;&#25903;&#25345;&#20102;&#20892;&#19994;&#20316;&#20026;&#36830;&#25509;&#27668;&#20505;&#20914;&#20987;&#21644;&#25919;&#27835;&#26292;&#21147;&#20043;&#38388;&#20851;&#38190;&#36884;&#24452;&#30340;&#35266;&#28857;&#12290;</title><link>http://arxiv.org/abs/2311.16370</link><description>&lt;p&gt;
&#27668;&#20505;&#12289;&#20892;&#20316;&#29289;&#19982;&#37319;&#25688;&#21518;&#20914;&#31361;
&lt;/p&gt;
&lt;p&gt;
Climate, Crops, and Postharvest Conflict. (arXiv:2311.16370v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.16370
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#20851;&#20110;&#27668;&#20505;&#20914;&#20987;&#23545;&#20914;&#31361;&#30340;&#26032;&#35777;&#25454;&#65292;&#34920;&#26126;El Ni&#241;o&#20107;&#20214;&#23545;&#20892;&#20316;&#29289;&#29983;&#38271;&#23395;&#21644;&#37319;&#25688;&#21518;&#26399;&#30340;&#20892;&#30000;&#20013;&#30340;&#25919;&#27835;&#26292;&#21147;&#20855;&#26377;&#36127;&#38754;&#24433;&#21709;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#20013;&#24378;&#24230;El Ni&#241;o&#20107;&#20214;&#23548;&#33268;&#30340;&#28023;&#38754;&#28201;&#24230;&#19978;&#21319;1&#176;C&#23558;&#33267;&#23569;&#20943;&#23569;&#19977;&#20010;&#30334;&#20998;&#28857;&#30340;&#25919;&#27835;&#26292;&#21147;&#19982;&#38024;&#23545;&#24179;&#27665;&#30340;&#20914;&#31361;&#12290;&#36825;&#19968;&#21457;&#29616;&#25903;&#25345;&#20102;&#20892;&#19994;&#20316;&#20026;&#36830;&#25509;&#27668;&#20505;&#20914;&#20987;&#21644;&#25919;&#27835;&#26292;&#21147;&#20043;&#38388;&#20851;&#38190;&#36884;&#24452;&#30340;&#35266;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#25552;&#20986;&#20102;&#27668;&#20505;&#20914;&#20987;&#23545;&#20914;&#31361;&#30340;&#24433;&#21709;&#30340;&#26032;&#35777;&#25454;&#12290;&#21033;&#29992;&#35206;&#30422;1997&#24180;&#33267;2023&#24180;&#25972;&#20010;&#38750;&#27954;&#22823;&#38470;&#30340;&#35814;&#32454;&#20914;&#31361;&#21644;&#22825;&#27668;&#25968;&#25454;&#65292;&#25105;&#21457;&#29616;&#22312;&#20892;&#20316;&#29289;&#29983;&#38271;&#23395;&#36973;&#21463;El Ni&#241;o&#20107;&#20214;&#23545;&#22799;&#23395;&#37319;&#25688;&#21518;&#26399;&#20892;&#30000;&#30340;&#25919;&#27835;&#26292;&#21147;&#20855;&#26377;&#36127;&#24046;&#24322;&#25928;&#24212;&#12290;&#30456;&#23545;&#20110;&#38271;&#26399;&#22343;&#20540;&#65292;&#28909;&#24102;&#22826;&#24179;&#27915;&#28023;&#38754;&#28201;&#24230;&#19978;&#21319;1&#176;C&#65288;&#20856;&#22411;&#30340;&#20013;&#24378;&#24230;El Ni&#241;o&#20107;&#20214;&#30340;&#20195;&#34920;&#65289;&#33267;&#23569;&#23548;&#33268;&#25919;&#27835;&#26292;&#21147;&#19982;&#38024;&#23545;&#24179;&#27665;&#30340;&#20914;&#31361;&#20943;&#23569;&#19977;&#20010;&#30334;&#20998;&#28857;&#12290;&#36825;&#19968;&#20027;&#35201;&#21457;&#29616;&#36890;&#36807;&#19968;&#31995;&#21015;&#31283;&#20581;&#24615;&#26816;&#39564;&#24471;&#21040;&#25903;&#25345;&#65292;&#25903;&#25345;&#20102;&#20892;&#19994;&#26159;&#36830;&#25509;&#27668;&#20505;&#20914;&#20987;&#19982;&#25919;&#27835;&#26292;&#21147;&#20043;&#38388;&#30340;&#20851;&#38190;&#36884;&#24452;&#65292;&#32780;&#36138;&#23146;&#26159;&#20851;&#38190;&#21160;&#26426;&#12290;&#20196;&#20154;&#25918;&#24515;&#30340;&#26159;&#65292;&#24403;&#25105;&#20351;&#29992;&#26356;&#36866;&#21512;&#25581;&#31034;&#25552;&#20986;&#30340;&#26426;&#21046;&#30340;&#25968;&#25454;&#23376;&#38598;&#26102;&#65292;&#20272;&#35745;&#25928;&#24212;&#30340;&#24133;&#24230;&#20960;&#20046;&#32763;&#20102;&#19968;&#30058;&#65292;&#32780;&#36825;&#31181;&#25928;&#24212;&#20165;&#20165;&#23384;&#22312;&#20110;&#20892;&#20316;&#29289;&#29983;&#38271;&#23395;&#21644;&#22799;&#23395;&#37319;&#25688;&#21518;&#26399;&#30340;&#20892;&#30000;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
I present new evidence of the effects of climate shocks on conflict. Using granular conflict and weather data covering the entire continent of Africa from 1997 to 2023, I find that exposure to El Ni\~no events during the crop-growing season has a negative differential effect on political violence against civilians in croplands during the early postharvest season. A 1{\deg}C warming of the sea surface temperature in the tropical Pacific Ocean relative to its long-run mean, a typical proxy for a moderate-strength El Ni\~no event, results in at least a three percent reduction in political violence with civilian targeting. This main finding, backed by a series of robustness checks, supports the idea that agriculture is the key channel and rapacity is the key motive connecting climatic shocks and political violence. Reassuringly, the magnitude of the estimated effect nearly doubles when I use subsets of data that are better suited to unveiling the proposed mechanism, and the effect only man
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#24102;&#38750;&#39532;&#23572;&#31185;&#22827;&#36716;&#25442;&#30340;&#20004;&#20154;&#38646;&#21644;&#32447;&#24615;&#20108;&#27425;&#38543;&#26426;&#24494;&#20998;&#21338;&#24328;&#38382;&#39064;&#65292;&#36890;&#36807;&#24341;&#20837;&#26032;&#30340;&#22810;&#32500;&#24230;&#19981;&#23450;&#38543;&#26426;Riccati&#26041;&#31243;&#21644;&#22810;&#32500;&#32447;&#24615;&#21453;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65292;&#25552;&#20986;&#20102;&#20004;&#21517;&#29609;&#23478;&#30340;&#26368;&#20248;&#21453;&#39304;&#25511;&#21046;&#31574;&#30053;&#23545;&#65292;&#24182;&#35777;&#26126;&#20102;&#26032;&#22411;&#22810;&#32500;&#24230;&#19981;&#23450;SRE&#30340;&#23384;&#22312;&#24615;&#21644;&#21807;&#19968;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.05003</link><description>&lt;p&gt;
&#22810;&#32500;&#19981;&#23450;&#38543;&#26426;Riccati&#26041;&#31243;&#21644;&#24102;&#38750;&#39532;&#23572;&#31185;&#22827;&#36716;&#25442;&#30340;&#38646;&#21644;&#32447;&#24615;&#20108;&#27425;&#38543;&#26426;&#24494;&#20998;&#21338;&#24328;
&lt;/p&gt;
&lt;p&gt;
Multidimensional indefinite stochastic Riccati equations and zero-sum linear-quadratic stochastic differential games with non-markovian regime switching. (arXiv:2309.05003v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.05003
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24102;&#38750;&#39532;&#23572;&#31185;&#22827;&#36716;&#25442;&#30340;&#20004;&#20154;&#38646;&#21644;&#32447;&#24615;&#20108;&#27425;&#38543;&#26426;&#24494;&#20998;&#21338;&#24328;&#38382;&#39064;&#65292;&#36890;&#36807;&#24341;&#20837;&#26032;&#30340;&#22810;&#32500;&#24230;&#19981;&#23450;&#38543;&#26426;Riccati&#26041;&#31243;&#21644;&#22810;&#32500;&#32447;&#24615;&#21453;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65292;&#25552;&#20986;&#20102;&#20004;&#21517;&#29609;&#23478;&#30340;&#26368;&#20248;&#21453;&#39304;&#25511;&#21046;&#31574;&#30053;&#23545;&#65292;&#24182;&#35777;&#26126;&#20102;&#26032;&#22411;&#22810;&#32500;&#24230;&#19981;&#23450;SRE&#30340;&#23384;&#22312;&#24615;&#21644;&#21807;&#19968;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#24102;&#26377;&#36716;&#25442;&#27169;&#22411;&#30340;&#20004;&#20154;&#38646;&#21644;&#32447;&#24615;&#20108;&#27425;&#38543;&#26426;&#24494;&#20998;&#21338;&#24328;&#12290;&#25152;&#25511;&#21046;&#30340;&#38750;&#40784;&#27425;&#31995;&#32479;&#31995;&#25968;&#20381;&#36182;&#20110;&#24213;&#23618;&#22122;&#22768;&#65292;&#22240;&#27492;&#23646;&#20110;&#38750;&#39532;&#23572;&#31185;&#22827;&#36716;&#25442;&#27169;&#22411;&#12290;&#22522;&#20110;&#19968;&#31181;&#26032;&#22411;&#30340;&#22810;&#32500;&#24230;&#19981;&#23450;&#38543;&#26426;Riccati&#26041;&#31243;&#65288;SRE&#65289;&#21644;&#20855;&#26377;&#26080;&#30028;&#31995;&#25968;&#30340;&#22810;&#32500;&#32447;&#24615;&#21453;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65288;BSDE&#65289;&#65292;&#25105;&#20204;&#21487;&#20197;&#20197;&#38381;&#29615;&#24418;&#24335;&#20026;&#20004;&#21517;&#29609;&#23478;&#25552;&#20379;&#26368;&#20248;&#21453;&#39304;&#25511;&#21046;&#31574;&#30053;&#23545;&#12290;&#26412;&#25991;&#30340;&#20027;&#35201;&#36129;&#29486;&#65292;&#22312;BSDE&#29702;&#35770;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#26159;&#35777;&#26126;&#20102;&#26032;&#22411;&#22810;&#32500;&#24230;&#19981;&#23450;SRE&#30340;&#23384;&#22312;&#24615;&#21644;&#21807;&#19968;&#24615;&#12290;&#26377;&#36259;&#30340;&#26159;&#65292;&#35299;&#30340;&#21508;&#20010;&#20998;&#37327;&#21516;&#26102;&#21487;&#20197;&#21462;&#27491;&#12289;&#38646;&#21644;&#36127;&#20540;&#12290;&#25105;&#20204;&#36824;&#22312;&#23553;&#38381;&#20984;&#38181;&#25511;&#21046;&#32422;&#26463;&#19979;&#33719;&#24471;&#20102;&#23545;&#24212;&#30340;&#40784;&#27425;&#31995;&#32479;&#30340;&#26368;&#20248;&#21453;&#39304;&#25511;&#21046;&#31574;&#30053;&#23545;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper is concerned with two-player zero-sum linear-quadratic stochastic differential games in a regime switching model. The controlled inhomogeneous system coefficients depend on the underlying noises, so it is a non-Markovian regime switching model. Based on a new kind of multidimensional indefinite stochastic Riccati equation (SRE) and a multidimensional linear backward stochastic differential equation (BSDE) with unbounded coefficients, we can provide optimal feedback control-strategy pairs for the two players in a closed-loop form. The main contribution of this paper, which is important in its own right from the BSDE theory point of view, is to prove the existence and uniqueness of the new kind of multidimensional indefinite SRE. Interestingly, the components of the solution can take positive, zero and negative values simultaneously. We also obtain the corresponding optimal feedback control-strategy pairs for homogeneous systems under closed convex cone control constraints. Fi
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#36807;&#22871;&#21033;&#20171;&#23548;&#30340;&#37329;&#34701;&#24066;&#22330;&#32858;&#21512;&#24418;&#24335;&#26694;&#26550;&#65292;&#24182;&#36890;&#36807;&#24066;&#22330;&#21160;&#21147;&#29109;&#37327;&#21270;&#20102;&#32858;&#21512;&#23548;&#33268;&#30340;&#27969;&#21160;&#24615;&#25439;&#22833;&#12290;</title><link>http://arxiv.org/abs/2309.04116</link><description>&lt;p&gt;
&#37329;&#34701;&#24066;&#22330;&#30340;&#32858;&#21512;
&lt;/p&gt;
&lt;p&gt;
Aggregation of financial markets. (arXiv:2309.04116v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04116
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#36807;&#22871;&#21033;&#20171;&#23548;&#30340;&#37329;&#34701;&#24066;&#22330;&#32858;&#21512;&#24418;&#24335;&#26694;&#26550;&#65292;&#24182;&#36890;&#36807;&#24066;&#22330;&#21160;&#21147;&#29109;&#37327;&#21270;&#20102;&#32858;&#21512;&#23548;&#33268;&#30340;&#27969;&#21160;&#24615;&#25439;&#22833;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#36807;&#22871;&#21033;&#20171;&#23548;&#30340;&#37329;&#34701;&#24066;&#22330;&#32858;&#21512;&#30340;&#24418;&#24335;&#26694;&#26550;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#24037;&#20855;&#26159;&#36890;&#36807;&#25928;&#29992;&#20989;&#25968;&#26469;&#34920;&#24449;&#24066;&#22330;&#65292;&#24182;&#21033;&#29992;&#19968;&#23545;&#19968;&#30340;&#38480;&#20215;&#35746;&#21333;&#31807;&#29366;&#24577;&#23545;&#24212;&#20851;&#31995;&#12290;&#21463;&#28909;&#21147;&#23398;&#29702;&#35770;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#35748;&#20026;&#22871;&#21033;&#20171;&#23548;&#30340;&#32858;&#21512;&#26426;&#21046;&#24341;&#21457;&#20102;&#19968;&#20010;&#24066;&#22330;&#21160;&#21147;&#29109;&#65292;&#35813;&#29109;&#37327;&#21270;&#20102;&#32858;&#21512;&#25152;&#23548;&#33268;&#30340;&#27969;&#21160;&#24615;&#25439;&#22833;&#12290;&#25105;&#20204;&#36824;&#35752;&#35770;&#20102;&#36825;&#20010;&#26032;&#20852;&#24066;&#22330;&#21160;&#24577;&#29702;&#35770;&#30340;&#26410;&#26469;&#30740;&#31350;&#26041;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a formal framework for the aggregation of financial markets mediated by arbitrage. Our main tool is to characterize markets via utility functions and to employ a one-to-one correspondence to limit order book states. Inspired by the theory of thermodynamics we argue that the arbitrage-mediated aggregation mechanism gives rise to a market-dynamical entropy, which quantifies the loss of liquidity caused by aggregation. We also discuss future directions of research in this emerging theory of market dynamics.
&lt;/p&gt;</description></item></channel></rss>