<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#22312;&#19968;&#20010;&#20462;&#25913;&#24237;&#21806;&#27169;&#22411;&#30340;&#21160;&#21147;&#23398;&#19979;&#65292;&#25105;&#20204;&#36890;&#36807;&#24341;&#20837;&#19968;&#38454;&#24494;&#20998;&#19981;&#31561;&#24335;&#38480;&#21046;&#20102;&#23521;&#22836;&#25919;&#26435;&#30340;&#25509;&#36817;&#31243;&#24230;&#65292;&#24182;&#23637;&#31034;&#20102;&#36825;&#20010;&#25913;&#33391;&#31995;&#32479;&#36866;&#29992;&#20110;&#21305;&#37197;&#30495;&#23454;&#30340;&#36130;&#23500;&#20998;&#24067;&#12290;</title><link>http://arxiv.org/abs/2310.16098</link><description>&lt;p&gt;
&#23545;&#24237;&#21806;&#27169;&#22411;&#21464;&#31181;&#20013;&#23521;&#22836;&#25919;&#26435;&#30340;&#38480;&#21046;
&lt;/p&gt;
&lt;p&gt;
Bounding the approach to oligarchy in a variant of the yard-sale model. (arXiv:2310.16098v1 [cond-mat.stat-mech])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.16098
&lt;/p&gt;
&lt;p&gt;
&#22312;&#19968;&#20010;&#20462;&#25913;&#24237;&#21806;&#27169;&#22411;&#30340;&#21160;&#21147;&#23398;&#19979;&#65292;&#25105;&#20204;&#36890;&#36807;&#24341;&#20837;&#19968;&#38454;&#24494;&#20998;&#19981;&#31561;&#24335;&#38480;&#21046;&#20102;&#23521;&#22836;&#25919;&#26435;&#30340;&#25509;&#36817;&#31243;&#24230;&#65292;&#24182;&#23637;&#31034;&#20102;&#36825;&#20010;&#25913;&#33391;&#31995;&#32479;&#36866;&#29992;&#20110;&#21305;&#37197;&#30495;&#23454;&#30340;&#36130;&#23500;&#20998;&#24067;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#25913;&#33391;&#30340;&#24237;&#21806;&#27169;&#22411;&#21160;&#21147;&#23398;&#19979;&#32463;&#27982;&#19981;&#24179;&#31561;&#30340;&#22522;&#23612;&#31995;&#25968;&#30340;&#20998;&#26512;&#32467;&#26524;&#12290;&#36890;&#36807;&#20462;&#25913;&#32463;&#20856;&#31995;&#32479;&#20013;&#30340;&#20108;&#36827;&#21046;&#20132;&#26131;&#65292;&#24341;&#20837;&#20102;&#24237;&#21806;&#27169;&#22411;&#30340;&#21464;&#31181;&#12290;&#36890;&#36807;&#20351;&#29992;&#19982;&#24494;&#20998;&#26684;&#26391;&#27779;&#23572;&#19981;&#31561;&#24335;&#32467;&#21512;&#30340;&#19968;&#38454;&#24494;&#20998;&#19981;&#31561;&#24335;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#31181;&#21160;&#21147;&#23398;&#19979;&#30340;&#22522;&#23612;&#31995;&#25968;&#26159;&#21333;&#35843;&#30340;&#65292;&#20294;&#23521;&#22836;&#25919;&#26435;&#30340;&#25509;&#36817;&#31243;&#24230;&#21487;&#20197;&#34987;&#38480;&#21046;&#20303;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#24102;&#26377;&#37325;&#26032;&#20998;&#37197;&#31246;&#30340;&#25913;&#33391;&#31995;&#32479;&#30340;&#28176;&#36827;&#24615;&#36136;&#65292;&#24182;&#19988;&#34920;&#26126;&#19982;&#21407;&#22987;&#30340;&#26377;&#31246;&#24237;&#21806;&#27169;&#22411;&#19968;&#33268;&#65292;&#36825;&#26263;&#31034;&#20102;&#36825;&#20010;&#25913;&#33391;&#31995;&#32479;&#36866;&#29992;&#20110;&#21305;&#37197;&#30495;&#23454;&#30340;&#36130;&#23500;&#20998;&#24067;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present analytical results for the Gini coefficient of economic inequality under the dynamics of a modified Yard-Sale Model of kinetic asset exchange. A variant of the Yard-Sale Model is introduced by modifying the underlying binary transaction of the classical system. It is shown that the Gini coefficient is monotone under the resulting dynamics but the approach to oligarchy, as measured by the Gini index, can be bounded by a first-order differential inequality used in conjunction with the differential Gronwall inequality. The asymptotics of the modified system, with a redistributive tax, are derived and shown to agree with the original, taxed Yard-Sale Model, which implies the modified system is as suitable for matching real wealth distributions.
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#37327;&#23376;&#20449;&#21495;&#22788;&#29702;&#30340;&#26041;&#27861;&#65292;&#23558;&#37329;&#34701;&#34893;&#29983;&#21697;&#30340;&#22238;&#25253;&#30452;&#25509;&#32534;&#30721;&#21040;&#37327;&#23376;&#24133;&#24230;&#20013;&#65292;&#20943;&#23569;&#20102;&#23545;&#26114;&#36149;&#30340;&#37327;&#23376;&#31639;&#26415;&#30340;&#38656;&#27714;&#65292;&#24182;&#26174;&#33879;&#38477;&#20302;&#20102;&#25152;&#38656;&#30340;&#37327;&#23376;&#36164;&#28304;&#12290;</title><link>http://arxiv.org/abs/2307.14310</link><description>&lt;p&gt;
&#20351;&#29992;&#37327;&#23376;&#20449;&#21495;&#22788;&#29702;&#36827;&#34892;&#34893;&#29983;&#21697;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
Derivative Pricing using Quantum Signal Processing. (arXiv:2307.14310v1 [quant-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.14310
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#37327;&#23376;&#20449;&#21495;&#22788;&#29702;&#30340;&#26041;&#27861;&#65292;&#23558;&#37329;&#34701;&#34893;&#29983;&#21697;&#30340;&#22238;&#25253;&#30452;&#25509;&#32534;&#30721;&#21040;&#37327;&#23376;&#24133;&#24230;&#20013;&#65292;&#20943;&#23569;&#20102;&#23545;&#26114;&#36149;&#30340;&#37327;&#23376;&#31639;&#26415;&#30340;&#38656;&#27714;&#65292;&#24182;&#26174;&#33879;&#38477;&#20302;&#20102;&#25152;&#38656;&#30340;&#37327;&#23376;&#36164;&#28304;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#37327;&#23376;&#35745;&#31639;&#26426;&#19978;&#36827;&#34892;&#37329;&#34701;&#34893;&#29983;&#21697;&#23450;&#20215;&#36890;&#24120;&#21253;&#25324;&#37327;&#23376;&#31639;&#26415;&#32452;&#20214;&#65292;&#36825;&#20123;&#32452;&#20214;&#23545;&#24212;&#30340;&#30005;&#36335;&#25152;&#38656;&#30340;&#37327;&#23376;&#36164;&#28304;&#24456;&#37325;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#37327;&#23376;&#20449;&#21495;&#22788;&#29702;&#65288;QSP&#65289;&#30340;&#26041;&#27861;&#65292;&#30452;&#25509;&#23558;&#37329;&#34701;&#34893;&#29983;&#21697;&#30340;&#22238;&#25253;&#32534;&#30721;&#21040;&#37327;&#23376;&#24133;&#24230;&#20013;&#65292;&#20943;&#36731;&#20102;&#26114;&#36149;&#30340;&#37327;&#23376;&#31639;&#26415;&#23545;&#37327;&#23376;&#30005;&#36335;&#30340;&#36127;&#25285;&#12290;&#19982;&#29616;&#26377;&#25991;&#29486;&#20013;&#30340;&#24403;&#21069;&#26368;&#20808;&#36827;&#26041;&#27861;&#30456;&#27604;&#65292;&#25105;&#20204;&#21457;&#29616;&#23545;&#20110;&#23454;&#38469;&#24863;&#20852;&#36259;&#30340;&#34893;&#29983;&#21697;&#21512;&#32422;&#65292;&#24212;&#29992;QSP&#26174;&#33879;&#20943;&#23567;&#20102;&#25152;&#26377;&#24230;&#37327;&#26631;&#20934;&#19979;&#25152;&#38656;&#30340;&#36164;&#28304;&#65292;&#23588;&#20854;&#26159;T&#38376;&#30340;&#24635;&#25968;&#32422;&#20943;16&#20493;&#65292;&#36923;&#36753;&#37327;&#23376;&#27604;&#29305;&#25968;&#32422;&#20943;4&#20493;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#20272;&#35745;&#36798;&#21040;&#37327;&#23376;&#20248;&#21183;&#25152;&#38656;&#30340;&#36923;&#36753;&#26102;&#38047;&#36895;&#29575;&#20063;&#38477;&#20302;&#20102;&#32422;5&#20493;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#21457;&#29616;&#36798;&#21040;&#37327;&#23376;&#20248;&#21183;&#25152;&#38656;&#30340;&#36923;&#36753;&#37327;&#23376;&#27604;&#29305;&#20026;4.7k&#20010;&#65292;&#32780;&#33021;&#22815;&#25191;&#34892;10^9&#20010;T&#38376;&#30340;&#37327;&#23376;&#35774;&#22791;&#25152;&#38656;&#12290;
&lt;/p&gt;
&lt;p&gt;
Pricing financial derivatives on quantum computers typically includes quantum arithmetic components which contribute heavily to the quantum resources required by the corresponding circuits. In this manuscript, we introduce a method based on Quantum Signal Processing (QSP) to encode financial derivative payoffs directly into quantum amplitudes, alleviating the quantum circuits from the burden of costly quantum arithmetic. Compared to current state-of-the-art approaches in the literature, we find that for derivative contracts of practical interest, the application of QSP significantly reduces the required resources across all metrics considered, most notably the total number of T-gates by $\sim 16$x and the number of logical qubits by $\sim 4$x. Additionally, we estimate that the logical clock rate needed for quantum advantage is also reduced by a factor of $\sim 5$x. Overall, we find that quantum advantage will require $4.7$k logical qubits, and quantum devices that can execute $10^9$ T
&lt;/p&gt;</description></item></channel></rss>