<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#20010;&#37327;&#23376;&#21452;&#20493;&#25110;&#26080;&#30340;&#28216;&#25103;&#65292;&#25506;&#35752;&#20102;&#31890;&#23376;&#27969;&#20013;&#30340;&#20449;&#24687;&#22914;&#20309;&#24433;&#21709;&#25237;&#27880;&#31574;&#30053;&#65292;&#22312;&#37327;&#23376;&#39046;&#22495;&#20013;&#21457;&#23637;&#20102;&#32452;&#21512;&#20248;&#21270;&#30340;&#26041;&#38754;&#12290;</title><link>http://arxiv.org/abs/2308.01305</link><description>&lt;p&gt;
&#19968;&#20010;&#37327;&#23376;&#21452;&#20493;&#25110;&#26080;&#30340;&#28216;&#25103;&#65306;&#26059;&#36716;&#30340;Kelly&#20934;&#21017;
&lt;/p&gt;
&lt;p&gt;
A quantum double-or-nothing game: The Kelly Criterion for Spins. (arXiv:2308.01305v1 [quant-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01305
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#20010;&#37327;&#23376;&#21452;&#20493;&#25110;&#26080;&#30340;&#28216;&#25103;&#65292;&#25506;&#35752;&#20102;&#31890;&#23376;&#27969;&#20013;&#30340;&#20449;&#24687;&#22914;&#20309;&#24433;&#21709;&#25237;&#27880;&#31574;&#30053;&#65292;&#22312;&#37327;&#23376;&#39046;&#22495;&#20013;&#21457;&#23637;&#20102;&#32452;&#21512;&#20248;&#21270;&#30340;&#26041;&#38754;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23558;&#19968;&#31995;&#21015;&#26497;&#21270;&#22312;&#20004;&#20010;&#21487;&#33021;&#26041;&#21521;&#30340;&#33258;&#26059;-1/2&#31890;&#23376;&#21576;&#29616;&#32473;&#23454;&#39564;&#32773;&#65292;&#20182;&#21487;&#20197;&#22312;&#33258;&#30001;&#36873;&#25321;&#30340;&#26497;&#21270;&#26041;&#21521;&#30340;&#27979;&#37327;&#32467;&#26524;&#19978;&#36827;&#34892;&#21452;&#20493;&#25110;&#26080;&#30340;&#19979;&#27880;&#28216;&#25103;&#12290;&#36890;&#36807;&#31934;&#26126;&#30340;&#25237;&#27880;&#31215;&#32047;&#36130;&#23500;&#12290;&#38543;&#30528;&#20174;&#31890;&#23376;&#27969;&#20013;&#33719;&#24471;&#20449;&#24687;&#65292;&#36880;&#28176;&#35843;&#25972;&#27979;&#37327;&#26041;&#21521;&#65292;&#24182;&#25552;&#39640;&#32452;&#21512;&#22686;&#38271;&#29575;&#12290;&#21033;&#29992;&#25968;&#20540;&#26041;&#27861;&#30830;&#23450;&#20102;&#26368;&#20248;&#30340;&#37327;&#23376;&#31574;&#30053;&#65292;&#24182;&#35777;&#26126;&#19982;&#36890;&#24120;&#19982;Kelly&#20934;&#21017;&#30456;&#20851;&#30340;&#32463;&#20856;&#31574;&#30053;&#19981;&#21516;&#12290;&#26412;&#25991;&#20026;&#37327;&#23376;&#37329;&#34701;&#30340;&#21457;&#23637;&#20570;&#20986;&#20102;&#36129;&#29486;&#65292;&#23558;&#32452;&#21512;&#20248;&#21270;&#30340;&#26041;&#38754;&#25299;&#23637;&#21040;&#37327;&#23376;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;
A sequence of spin-1/2 particles polarised in one of two possible directions is presented to an experimenter, who can wager in a double-or-nothing game on the outcomes of measurements in freely chosen polarisation directions. Wealth is accrued through astute betting. As information is gained from the stream of particles, the measurement directions are progressively adjusted, and the portfolio growth rate is raised. The optimal quantum strategy is determined numerically and shown to differ from the classical strategy, which is associated with the Kelly criterion. The paper contributes to the development of quantum finance, as aspects of portfolio optimisation are extended to the quantum realm.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#20010;&#24615;&#21270;&#26102;&#38388;&#34928;&#20943;&#20989;&#25968;&#30340;&#33258;&#36866;&#24212;&#21327;&#21516;&#36807;&#28388;&#37329;&#34701;&#20135;&#21697;&#25512;&#33616;&#31995;&#32479;&#65292;&#20197;&#35299;&#20915;&#20256;&#32479;&#25512;&#33616;&#31995;&#32479;&#22312;&#21160;&#24577;&#29615;&#22659;&#19979;&#25552;&#20379;&#21487;&#38752;&#25512;&#33616;&#30340;&#25361;&#25112;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#24314;&#27169;&#23458;&#25143;&#21644;&#20135;&#21697;&#20043;&#38388;&#30340;&#21160;&#24577;&#21327;&#21516;&#20449;&#21495;&#65292;&#22788;&#29702;&#37329;&#34701;&#25968;&#25454;&#30340;&#38750;&#24179;&#31283;&#24615;&#65292;&#20026;&#29992;&#25143;&#25552;&#20379;&#21487;&#38752;&#30340;&#25512;&#33616;&#12290;</title><link>http://arxiv.org/abs/2308.01208</link><description>&lt;p&gt;
&#20010;&#24615;&#21270;&#26102;&#38388;&#34928;&#20943;&#20989;&#25968;&#30340;&#33258;&#36866;&#24212;&#21327;&#21516;&#36807;&#28388;&#37329;&#34701;&#20135;&#21697;&#25512;&#33616;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
Adaptive Collaborative Filtering with Personalized Time Decay Functions for Financial Product Recommendation. (arXiv:2308.01208v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01208
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#20010;&#24615;&#21270;&#26102;&#38388;&#34928;&#20943;&#20989;&#25968;&#30340;&#33258;&#36866;&#24212;&#21327;&#21516;&#36807;&#28388;&#37329;&#34701;&#20135;&#21697;&#25512;&#33616;&#31995;&#32479;&#65292;&#20197;&#35299;&#20915;&#20256;&#32479;&#25512;&#33616;&#31995;&#32479;&#22312;&#21160;&#24577;&#29615;&#22659;&#19979;&#25552;&#20379;&#21487;&#38752;&#25512;&#33616;&#30340;&#25361;&#25112;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#24314;&#27169;&#23458;&#25143;&#21644;&#20135;&#21697;&#20043;&#38388;&#30340;&#21160;&#24577;&#21327;&#21516;&#20449;&#21495;&#65292;&#22788;&#29702;&#37329;&#34701;&#25968;&#25454;&#30340;&#38750;&#24179;&#31283;&#24615;&#65292;&#20026;&#29992;&#25143;&#25552;&#20379;&#21487;&#38752;&#30340;&#25512;&#33616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20256;&#32479;&#30340;&#25512;&#33616;&#31995;&#32479;&#36890;&#24120;&#20551;&#35774;&#21382;&#21490;&#25968;&#25454;&#26159;&#19981;&#21464;&#30340;&#65292;&#26080;&#27861;&#32771;&#34385;&#29992;&#25143;&#20559;&#22909;&#30340;&#21160;&#24577;&#24615;&#65292;&#38480;&#21046;&#20102;&#23427;&#20204;&#22312;&#26102;&#38388;&#25935;&#24863;&#29615;&#22659;&#20013;&#25552;&#20379;&#21487;&#38752;&#25512;&#33616;&#30340;&#33021;&#21147;&#12290;&#36825;&#19968;&#20551;&#35774;&#22312;&#37329;&#34701;&#39046;&#22495;&#23588;&#20854;&#26377;&#38382;&#39064;&#65292;&#22240;&#20026;&#37329;&#34701;&#20135;&#21697;&#30340;&#20272;&#20540;&#19981;&#26029;&#21464;&#21270;&#65292;&#23548;&#33268;&#23458;&#25143;&#20852;&#36259;&#39057;&#32321;&#36716;&#31227;&#12290;&#36825;&#20123;&#28436;&#21464;&#30340;&#20852;&#36259;&#21487;&#20197;&#36890;&#36807;&#36807;&#21435;&#23458;&#25143;-&#20135;&#21697;&#20132;&#20114;&#20013;&#24635;&#32467;&#20986;&#26469;&#65292;&#20854;&#25928;&#29992;&#38543;&#30528;&#26102;&#38388;&#30340;&#25512;&#31227;&#20250;&#22240;&#23458;&#25143;&#32780;&#24322;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#19968;&#25361;&#25112;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26102;&#38388;&#30456;&#20851;&#30340;&#21327;&#21516;&#36807;&#28388;&#31639;&#27861;&#65292;&#21487;&#20197;&#20351;&#29992;&#20010;&#24615;&#21270;&#34928;&#20943;&#20989;&#25968;&#33258;&#36866;&#24212;&#22320;&#25240;&#20215;&#36828;&#31163;&#30340;&#23458;&#25143;-&#20135;&#21697;&#20132;&#20114;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#26088;&#22312;&#22788;&#29702;&#37329;&#34701;&#25968;&#25454;&#30340;&#38750;&#24179;&#31283;&#24615;&#65292;&#24182;&#36890;&#36807;&#24314;&#27169;&#23458;&#25143;&#21644;&#20135;&#21697;&#20043;&#38388;&#30340;&#21160;&#24577;&#21327;&#21516;&#20449;&#21495;&#26469;&#20135;&#29983;&#21487;&#38752;&#30340;&#25512;&#33616;&#12290;&#25105;&#20204;&#20351;&#29992;&#19987;&#26377;&#25968;&#25454;&#38598;&#23545;&#25105;&#20204;&#30340;&#26041;&#27861;&#36827;&#34892;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;
Classical recommender systems often assume that historical data are stationary and fail to account for the dynamic nature of user preferences, limiting their ability to provide reliable recommendations in time-sensitive settings. This assumption is particularly problematic in finance, where financial products exhibit continuous changes in valuations, leading to frequent shifts in client interests. These evolving interests, summarized in the past client-product interactions, see their utility fade over time with a degree that might differ from one client to another. To address this challenge, we propose a time-dependent collaborative filtering algorithm that can adaptively discount distant client-product interactions using personalized decay functions. Our approach is designed to handle the non-stationarity of financial data and produce reliable recommendations by modeling the dynamic collaborative signals between clients and products. We evaluate our method using a proprietary dataset 
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26368;&#20248;&#36755;&#36816;&#26041;&#27861;&#35299;&#20915;&#22810;&#20998;&#20301;&#25968;&#23545;&#20914;&#38382;&#39064;&#65292;&#22312;&#38750;&#32447;&#24615;&#24066;&#22330;&#20013;&#65292;&#23558;&#35813;&#38382;&#39064;&#37325;&#26500;&#20026;&#19968;&#20010;&#33945;&#29305;&#21345;&#32599;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#65292;&#22312;&#32447;&#24615;&#24066;&#22330;&#20013;&#24341;&#20837;&#20102;&#21322;&#31163;&#25955;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#65292;&#24182;&#35774;&#35745;&#20102;&#22522;&#20110;SGA&#31639;&#27861;&#30340;&#25968;&#20540;&#26041;&#27861;&#26469;&#35745;&#31639;&#22810;&#20998;&#20301;&#25968;&#23545;&#20914;&#20215;&#26684;&#12290;</title><link>http://arxiv.org/abs/2308.01121</link><description>&lt;p&gt;
&#22810;&#20998;&#20301;&#25968;&#23545;&#20914;&#38382;&#39064;&#30340;&#26368;&#20248;&#36755;&#36816;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
An optimal transport approach for the multiple quantile hedging problem. (arXiv:2308.01121v1 [math.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01121
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26368;&#20248;&#36755;&#36816;&#26041;&#27861;&#35299;&#20915;&#22810;&#20998;&#20301;&#25968;&#23545;&#20914;&#38382;&#39064;&#65292;&#22312;&#38750;&#32447;&#24615;&#24066;&#22330;&#20013;&#65292;&#23558;&#35813;&#38382;&#39064;&#37325;&#26500;&#20026;&#19968;&#20010;&#33945;&#29305;&#21345;&#32599;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#65292;&#22312;&#32447;&#24615;&#24066;&#22330;&#20013;&#24341;&#20837;&#20102;&#21322;&#31163;&#25955;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#65292;&#24182;&#35774;&#35745;&#20102;&#22522;&#20110;SGA&#31639;&#27861;&#30340;&#25968;&#20540;&#26041;&#27861;&#26469;&#35745;&#31639;&#22810;&#20998;&#20301;&#25968;&#23545;&#20914;&#20215;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#22810;&#20998;&#20301;&#25968;&#23545;&#20914;&#38382;&#39064;&#65292;&#36825;&#26159;&#19968;&#31867;&#21253;&#21547;&#20998;&#20301;&#25968;&#23545;&#20914;&#38382;&#39064;&#65288;F{\"o}llmer \&amp; Leukert 1999&#65289;&#21644;PnL&#21305;&#37197;&#38382;&#39064;&#65288;Bouchard \&amp; Vu 2012&#65289;&#20316;&#20026;&#29305;&#20363;&#30340;&#37096;&#20998;&#23545;&#20914;&#38382;&#39064;&#12290;&#22312;&#38750;&#32447;&#24615;&#23436;&#20840;&#24066;&#22330;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#20010;&#38382;&#39064;&#21487;&#20197;&#37325;&#26500;&#20026;&#19968;&#31181;&#33945;&#29305;&#21345;&#32599;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#12290;&#21033;&#29992;&#36825;&#20010;&#35266;&#23519;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#35813;&#38382;&#39064;&#30340;Kantorovitch&#29256;&#26412;&#65292;&#24182;&#35777;&#26126;&#20102;&#20004;&#20010;&#38382;&#39064;&#30340;&#20215;&#20540;&#26159;&#30456;&#31561;&#30340;&#12290;&#22312;&#32447;&#24615;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#24471;&#21040;&#22810;&#20998;&#20301;&#25968;&#23545;&#20914;&#38382;&#39064;&#21487;&#20197;&#30475;&#20316;&#26159;&#19968;&#31181;&#21322;&#31163;&#25955;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#65292;&#24182;&#36827;&#19968;&#27493;&#24341;&#20837;&#20102;&#23545;&#20598;&#38382;&#39064;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#35777;&#26126;&#19981;&#23384;&#22312;&#23545;&#20598;&#38388;&#38553;&#65292;&#20351;&#25105;&#20204;&#33021;&#22815;&#35774;&#35745;&#22522;&#20110;SGA&#31639;&#27861;&#30340;&#25968;&#20540;&#26041;&#27861;&#26469;&#35745;&#31639;&#22810;&#20998;&#20301;&#25968;&#23545;&#20914;&#20215;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the multiple quantile hedging problem, which is a class of partial hedging problems containing as special examples the quantile hedging problem (F{\"o}llmer \&amp; Leukert 1999) and the PnL matching problem (introduced in Bouchard \&amp; Vu 2012). In complete non-linear markets, we show that the problem can be reformulated as a kind of Monge optimal transport problem. Using this observation, we introduce a Kantorovitch version of the problem and prove that the value of both problems coincide. In the linear case, we thus obtain that the multiple quantile hedging problem can be seen as a semi-discrete optimal transport problem, for which we further introduce the dual problem. We then prove that there is no duality gap, allowing us to design a numerical method based on SGA algorithms to compute the multiple quantile hedging price.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#22312;&#26085;&#26412;&#32929;&#24066;&#20061;&#24180;&#26102;&#38388;&#20869;&#36827;&#34892;&#20102;&#23450;&#37327;&#32479;&#35745;&#20998;&#26512;&#65292;&#20851;&#27880;&#20010;&#20154;&#20132;&#26131;&#36134;&#25143;&#30340;&#35746;&#21333;&#25286;&#20998;&#34892;&#20026;&#65292;&#36890;&#36807;&#22823;&#35268;&#27169;&#30340;&#24494;&#35266;&#25968;&#25454;&#38598;&#25552;&#20379;&#20102;&#23545;&#35746;&#21333;&#25286;&#20998;&#34892;&#20026;&#30340;&#23450;&#37327;&#39044;&#27979;&#30340;&#23454;&#36136;&#25903;&#25345;&#12290;</title><link>http://arxiv.org/abs/2308.01112</link><description>&lt;p&gt;
&#26085;&#26412;&#32929;&#24066;&#20010;&#20154;&#20132;&#26131;&#36134;&#25143;&#20061;&#24180;&#26469;&#35746;&#21333;&#25286;&#20998;&#34892;&#20026;&#30340;&#23450;&#37327;&#32479;&#35745;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Quantitative statistical analysis of order-splitting behaviour of individual trading accounts in the Japanese stock market over nine years. (arXiv:2308.01112v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01112
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22312;&#26085;&#26412;&#32929;&#24066;&#20061;&#24180;&#26102;&#38388;&#20869;&#36827;&#34892;&#20102;&#23450;&#37327;&#32479;&#35745;&#20998;&#26512;&#65292;&#20851;&#27880;&#20010;&#20154;&#20132;&#26131;&#36134;&#25143;&#30340;&#35746;&#21333;&#25286;&#20998;&#34892;&#20026;&#65292;&#36890;&#36807;&#22823;&#35268;&#27169;&#30340;&#24494;&#35266;&#25968;&#25454;&#38598;&#25552;&#20379;&#20102;&#23545;&#35746;&#21333;&#25286;&#20998;&#34892;&#20026;&#30340;&#23450;&#37327;&#39044;&#27979;&#30340;&#23454;&#36136;&#25903;&#25345;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#20851;&#27880;&#35746;&#21333;&#25286;&#20998;&#34892;&#20026;&#12290;&#35746;&#21333;&#25286;&#20998;&#26159;&#19968;&#31181;&#20132;&#26131;&#31574;&#30053;&#65292;&#23558;&#22823;&#22411;&#28508;&#22312;&#20803;&#35746;&#21333;&#25286;&#20998;&#20026;&#23567;&#22359;&#65292;&#20197;&#38477;&#20302;&#20132;&#26131;&#25104;&#26412;&#12290;&#36825;&#31181;&#31574;&#30053;&#24615;&#34892;&#20026;&#34987;&#35748;&#20026;&#24456;&#37325;&#35201;&#65292;&#22240;&#20026;&#23427;&#26159;&#38271;&#31243;&#30456;&#20851;&#24615;&#65288;LRC&#65289;&#22312;&#25345;&#32493;&#35746;&#21333;&#27969;&#20013;&#24494;&#35266;&#36215;&#28304;&#30340;&#26377;&#21069;&#26223;&#30340;&#20505;&#36873;&#32773;&#12290;&#23454;&#38469;&#19978;&#65292;&#22312;2005&#24180;&#65292;Lillo&#12289;Mike&#21644;Farmer (LMF) &#25552;&#20986;&#20102;&#19968;&#20010;&#35746;&#21333;&#25286;&#20998;&#20132;&#26131;&#32773;&#30340;&#24494;&#35266;&#27169;&#22411;&#65292;&#20197;&#20174;&#24494;&#35266;&#21160;&#21147;&#23398;&#37327;&#21270;&#39044;&#27979;LRC&#30340;&#28176;&#36817;&#34892;&#20026;&#12290;&#36825;&#20010;&#22330;&#26223;&#30340;&#21512;&#29702;&#24615;&#24050;&#32463;&#30001;Toth&#31561;&#20154;&#22312;2015&#24180;&#36827;&#34892;&#20102;&#23450;&#24615;&#30740;&#31350;&#12290;&#28982;&#32780;&#65292;&#22312;&#32570;&#20047;&#22823;&#22411;&#24494;&#35266;&#25968;&#25454;&#38598;&#30340;&#24773;&#20917;&#19979;&#65292;&#23578;&#26410;&#25552;&#20986;&#20851;&#20110;LMF&#27169;&#22411;&#23450;&#37327;&#39044;&#27979;&#30340;&#23454;&#36136;&#25903;&#25345;&#12290;&#22312;&#26412;&#25253;&#21578;&#20013;&#65292;&#25105;&#20204;&#39318;&#27425;&#25552;&#20379;&#20102;&#27599;&#20010;&#20132;&#26131;&#36134;&#25143;&#32423;&#21035;&#19978;&#35746;&#21333;&#25286;&#20998;&#34892;&#20026;&#30340;&#23450;&#37327;&#32479;&#35745;&#20998;&#26512;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#22823;&#37327;&#30340;&#19996;&#20140;&#32929;&#24066;&#25968;&#25454;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this research, we focus on the order-splitting behavior. The order splitting is a trading strategy to execute their large potential metaorder into small pieces to reduce transaction cost. This strategic behavior is believed to be important because it is a promising candidate for the microscopic origin of the long-range correlation (LRC) in the persistent order flow. Indeed, in 2005, Lillo, Mike, and Farmer (LMF) introduced a microscopic model of the order-splitting traders to predict the asymptotic behavior of the LRC from the microscopic dynamics, even quantitatively. The plausibility of this scenario has been qualitatively investigated by Toth et al. 2015. However, no solid support has been presented yet on the quantitative prediction by the LMF model in the lack of large microscopic datasets. In this report, we have provided the first quantitative statistical analysis of the order-splitting behavior at the level of each trading account. We analyse a large dataset of the Tokyo sto
&lt;/p&gt;</description></item><item><title>&#22522;&#20110;&#28508;&#21147;&#22330;&#29702;&#35770;&#21644;&#36125;&#21494;&#26031;&#26694;&#26550;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#27169;&#22411;&#26469;&#25551;&#32472;&#21152;&#23494;&#36135;&#24065;&#30340;&#32467;&#26500;&#20381;&#36182;&#20851;&#31995;&#24182;&#39044;&#27979;&#24066;&#22330;&#36235;&#21183;&#65292;&#35813;&#27169;&#22411;&#36890;&#36807;&#38750;&#32447;&#24615;&#28508;&#21147;&#20989;&#25968;&#25512;&#26029;&#21560;&#24341;&#23376;&#21644;&#25490;&#26021;&#23376;&#20316;&#20026;&#21487;&#38752;&#30340;&#24066;&#22330;&#25351;&#26631;&#12290;</title><link>http://arxiv.org/abs/2308.01013</link><description>&lt;p&gt;
&#22522;&#20110;&#28508;&#21147;&#22330;&#30340;&#36125;&#21494;&#26031;&#26694;&#26550;&#29992;&#20110;&#25551;&#32472;&#21152;&#23494;&#36135;&#24065;&#24066;&#22330;&#21160;&#24577;&#12289;&#32467;&#26500;&#20381;&#36182;&#21644;&#27874;&#21160;&#24615;
&lt;/p&gt;
&lt;p&gt;
Bayesian framework for characterizing cryptocurrency market dynamics, structural dependency, and volatility using potential field. (arXiv:2308.01013v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01013
&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#28508;&#21147;&#22330;&#29702;&#35770;&#21644;&#36125;&#21494;&#26031;&#26694;&#26550;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#27169;&#22411;&#26469;&#25551;&#32472;&#21152;&#23494;&#36135;&#24065;&#30340;&#32467;&#26500;&#20381;&#36182;&#20851;&#31995;&#24182;&#39044;&#27979;&#24066;&#22330;&#36235;&#21183;&#65292;&#35813;&#27169;&#22411;&#36890;&#36807;&#38750;&#32447;&#24615;&#28508;&#21147;&#20989;&#25968;&#25512;&#26029;&#21560;&#24341;&#23376;&#21644;&#25490;&#26021;&#23376;&#20316;&#20026;&#21487;&#38752;&#30340;&#24066;&#22330;&#25351;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#21152;&#23494;&#36135;&#24065;&#20132;&#26131;&#20013;&#65292;&#35782;&#21035;&#21152;&#23494;&#36135;&#24065;&#20043;&#38388;&#30340;&#32467;&#26500;&#20381;&#36182;&#20851;&#31995;&#24182;&#39044;&#27979;&#24066;&#22330;&#36235;&#21183;&#23545;&#20110;&#26377;&#25928;&#31649;&#29702;&#25237;&#36164;&#32452;&#21512;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#28508;&#21147;&#22330;&#29702;&#35770;&#21644;&#39640;&#26031;&#36807;&#31243;&#30340;&#32479;&#19968;&#30340;&#36125;&#21494;&#26031;&#26694;&#26550;&#65292;&#29992;&#21382;&#21490;&#20215;&#26684;&#20449;&#24687;&#26469;&#25551;&#32472;&#21508;&#31181;&#21152;&#23494;&#36135;&#24065;&#30340;&#32467;&#26500;&#20381;&#36182;&#20851;&#31995;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#24037;&#20316;&#26377;&#20197;&#19979;&#37325;&#35201;&#36129;&#29486;&#65306;(i)&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#27169;&#22411;&#65292;&#23558;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#36816;&#21160;&#35270;&#20026;&#21463;&#26102;&#38388;&#21464;&#21270;&#30340;&#38750;&#32447;&#24615;&#28508;&#21147;&#22330;&#39537;&#21160;&#30340;&#21160;&#21147;&#31995;&#32479;&#30340;&#36712;&#36857;&#12290;(ii)&#36890;&#36807;Lyapunov&#31283;&#23450;&#24615;&#20998;&#26512;&#39564;&#35777;&#20102;&#21152;&#23494;&#36135;&#24065;&#24066;&#22330;&#20013;&#38750;&#32447;&#24615;&#28508;&#21147;&#20989;&#25968;&#30340;&#23384;&#22312;&#12290;(iii)&#24320;&#21457;&#20102;&#19968;&#20010;&#36125;&#21494;&#26031;&#26694;&#26550;&#65292;&#29992;&#20110;&#26681;&#25454;&#35266;&#23519;&#21040;&#30340;&#21152;&#23494;&#36135;&#24065;&#20215;&#26684;&#25512;&#26029;&#38750;&#32447;&#24615;&#28508;&#21147;&#20989;&#25968;&#12290;(iv)&#25552;&#20986;&#20102;&#20174;&#28508;&#21147;&#22330;&#20013;&#25512;&#26029;&#20986;&#30340;&#21560;&#24341;&#23376;&#21644;&#25490;&#26021;&#23376;&#26159;&#21487;&#38752;&#30340;&#21152;&#23494;&#36135;&#24065;&#24066;&#22330;&#25351;&#26631;&#65292;&#36229;&#36234;&#20102;&#29616;&#26377;&#30340;&#23646;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Identifying the structural dependence between the cryptocurrencies and predicting market trend are fundamental for effective portfolio management in cryptocurrency trading. In this paper, we present a unified Bayesian framework based on potential field theory and Gaussian Process to characterize the structural dependency of various cryptocurrencies, using historic price information. The following are our significant contributions: (i) Proposed a novel model for cryptocurrency price movements as a trajectory of a dynamical system governed by a time-varying non-linear potential field. (ii) Validated the existence of the non-linear potential function in cryptocurrency market through Lyapunov stability analysis. (iii) Developed a Bayesian framework for inferring the non-linear potential function from observed cryptocurrency prices. (iv) Proposed that attractors and repellers inferred from the potential field are reliable cryptocurrency market indicators, surpassing existing attributes, suc
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#26088;&#22312;&#24314;&#31435;&#20107;&#20214;&#29305;&#23450;&#30340;&#32593;&#32476;&#20445;&#38505;&#20135;&#21697;&#30340;&#32463;&#27982;&#22522;&#30784;&#65292;&#36890;&#36807;&#20351;&#29992;&#30495;&#23454;&#30340;&#32593;&#32476;&#20107;&#20214;&#25968;&#25454;&#65292;&#30740;&#31350;&#22914;&#20309;&#35774;&#35745;&#20107;&#20214;&#29305;&#23450;&#30340;&#36180;&#20607;&#25514;&#26045;&#65292;&#23454;&#29616;&#20445;&#38505;&#21334;&#26041;&#21644;&#36141;&#20080;&#26041;&#30340;&#24085;&#32047;&#25176;&#26368;&#20248;&#24615;&#12290;</title><link>http://arxiv.org/abs/2308.00921</link><description>&lt;p&gt;
&#20107;&#20214;&#29305;&#23450;&#30340;&#32593;&#32476;&#20445;&#38505;
&lt;/p&gt;
&lt;p&gt;
Incident-Specific Cyber Insurance. (arXiv:2308.00921v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.00921
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26088;&#22312;&#24314;&#31435;&#20107;&#20214;&#29305;&#23450;&#30340;&#32593;&#32476;&#20445;&#38505;&#20135;&#21697;&#30340;&#32463;&#27982;&#22522;&#30784;&#65292;&#36890;&#36807;&#20351;&#29992;&#30495;&#23454;&#30340;&#32593;&#32476;&#20107;&#20214;&#25968;&#25454;&#65292;&#30740;&#31350;&#22914;&#20309;&#35774;&#35745;&#20107;&#20214;&#29305;&#23450;&#30340;&#36180;&#20607;&#25514;&#26045;&#65292;&#23454;&#29616;&#20445;&#38505;&#21334;&#26041;&#21644;&#36141;&#20080;&#26041;&#30340;&#24085;&#32047;&#25176;&#26368;&#20248;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#30446;&#21069;&#30340;&#24066;&#22330;&#23454;&#36341;&#20013;&#65292;&#35768;&#22810;&#32593;&#32476;&#20445;&#38505;&#20135;&#21697;&#20026;&#21508;&#31867;&#20107;&#20214;&#23548;&#33268;&#30340;&#25439;&#22833;&#25552;&#20379;&#25414;&#32465;&#22871;&#39184;&#65292;&#20363;&#22914;&#25968;&#25454;&#27844;&#38706;&#21644;&#21202;&#32034;&#36719;&#20214;&#25915;&#20987;&#65292;&#32780;&#27599;&#31181;&#20107;&#20214;&#31867;&#22411;&#30340;&#20445;&#38505;&#35206;&#30422;&#37117;&#26377;&#21333;&#29420;&#30340;&#38480;&#39069;&#21644;&#20813;&#36180;&#39069;&#12290;&#34429;&#28982;&#36825;&#32473;&#20104;&#20102;&#28508;&#22312;&#30340;&#32593;&#32476;&#20445;&#38505;&#36141;&#20080;&#32773;&#26356;&#22810;&#28789;&#27963;&#24615;&#26469;&#23450;&#21046;&#20445;&#38505;&#35206;&#30422;&#65292;&#24182;&#26356;&#22909;&#22320;&#31649;&#29702;&#21334;&#26041;&#30340;&#39118;&#38505;&#26292;&#38706;&#65292;&#20294;&#36825;&#20063;&#20351;&#24471;&#20915;&#31574;&#36807;&#31243;&#22797;&#26434;&#21270;&#65292;&#38656;&#35201;&#30830;&#23450;&#21452;&#26041;&#20445;&#30041;&#21644;&#36716;&#31227;&#39118;&#38505;&#30340;&#26368;&#20339;&#25968;&#37327;&#12290;&#26412;&#25991;&#26088;&#22312;&#24314;&#31435;&#20107;&#20214;&#29305;&#23450;&#30340;&#32593;&#32476;&#20445;&#38505;&#20135;&#21697;&#30340;&#32463;&#27982;&#22522;&#30784;&#65292;&#37325;&#28857;&#30740;&#31350;&#22914;&#20309;&#20026;&#23454;&#29616;&#20445;&#38505;&#21334;&#26041;&#21644;&#36141;&#20080;&#26041;&#30340;&#24085;&#32047;&#25176;&#26368;&#20248;&#24615;&#32780;&#35774;&#35745;&#20107;&#20214;&#29305;&#23450;&#30340;&#36180;&#20607;&#25514;&#26045;&#12290;&#36890;&#36807;&#20351;&#29992;&#30495;&#23454;&#30340;&#32593;&#32476;&#20107;&#20214;&#25968;&#25454;&#26469;&#35828;&#26126;&#36825;&#31181;&#26041;&#27861;&#30340;&#21487;&#34892;&#24615;&#65292;&#24182;&#35752;&#35770;&#20102;&#20960;&#31181;&#23454;&#36341;&#20013;&#30340;&#23454;&#26045;&#25913;&#36827;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the current market practice, many cyber insurance products offer a coverage bundle for losses arising from various types of incidents, such as data breaches and ransomware attacks, and the coverage for each incident type comes with a separate limit and deductible. Although this gives prospective cyber insurance buyers more flexibility in customizing the coverage and better manages the risk exposures of sellers, it complicates the decision-making process in determining the optimal amount of risks to retain and transfer for both parties. This paper aims to build an economic foundation for these incident-specific cyber insurance products with a focus on how incident-specific indemnities should be designed for achieving Pareto optimality for both the insurance seller and buyer. Real data on cyber incidents is used to illustrate the feasibility of this approach. Several implementation improvement methods for practicality are also discussed.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#32508;&#36848;&#20102;&#21487;&#25345;&#32493;&#36816;&#33829;&#31649;&#29702;&#12289;&#20248;&#21270;&#21644;&#24223;&#27700;&#22788;&#29702;&#39046;&#22495;&#30340;&#30740;&#31350;&#36827;&#23637;&#65292;&#25552;&#20986;&#20102;&#26377;&#25928;&#30340;&#33073;&#30899;&#31574;&#30053;&#21644;&#21487;&#25345;&#32493;&#24615;&#26041;&#27861;&#65292;&#20197;&#23454;&#29616;&#27431;&#27954;&#27668;&#20505;&#20013;&#24615;&#24895;&#26223;&#12290;&#30740;&#31350;&#36824;&#25506;&#35752;&#20102;&#25968;&#23383;&#21270;&#22312;&#20943;&#30899;&#20013;&#30340;&#20316;&#29992;&#65292;&#22238;&#39038;&#20102;&#25919;&#24220;&#34892;&#21160;&#30340;&#33073;&#30899;&#25919;&#31574;&#65292;&#24182;&#23545;&#24212;&#29992;&#20110;&#31185;&#23398;&#25216;&#26415;&#39046;&#22495;&#30340;&#20248;&#21270;&#26041;&#27861;&#36827;&#34892;&#20102;&#32508;&#36848;&#65292;&#24378;&#35843;&#20102;&#38750;&#20256;&#32479;&#33021;&#28304;&#21644;&#20998;&#24067;&#24335;&#21457;&#30005;&#31995;&#32479;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>http://arxiv.org/abs/2308.00808</link><description>&lt;p&gt;
&#36808;&#21521;&#27668;&#20505;&#20013;&#24615;&#65306;&#21487;&#25345;&#32493;&#36816;&#33829;&#31649;&#29702;&#12289;&#20248;&#21270;&#21644;&#24223;&#27700;&#22788;&#29702;&#31574;&#30053;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
Towards Climate Neutrality: A Comprehensive Overview of Sustainable Operations Management, Optimization, and Wastewater Treatment Strategies. (arXiv:2308.00808v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.00808
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32508;&#36848;&#20102;&#21487;&#25345;&#32493;&#36816;&#33829;&#31649;&#29702;&#12289;&#20248;&#21270;&#21644;&#24223;&#27700;&#22788;&#29702;&#39046;&#22495;&#30340;&#30740;&#31350;&#36827;&#23637;&#65292;&#25552;&#20986;&#20102;&#26377;&#25928;&#30340;&#33073;&#30899;&#31574;&#30053;&#21644;&#21487;&#25345;&#32493;&#24615;&#26041;&#27861;&#65292;&#20197;&#23454;&#29616;&#27431;&#27954;&#27668;&#20505;&#20013;&#24615;&#24895;&#26223;&#12290;&#30740;&#31350;&#36824;&#25506;&#35752;&#20102;&#25968;&#23383;&#21270;&#22312;&#20943;&#30899;&#20013;&#30340;&#20316;&#29992;&#65292;&#22238;&#39038;&#20102;&#25919;&#24220;&#34892;&#21160;&#30340;&#33073;&#30899;&#25919;&#31574;&#65292;&#24182;&#23545;&#24212;&#29992;&#20110;&#31185;&#23398;&#25216;&#26415;&#39046;&#22495;&#30340;&#20248;&#21270;&#26041;&#27861;&#36827;&#34892;&#20102;&#32508;&#36848;&#65292;&#24378;&#35843;&#20102;&#38750;&#20256;&#32479;&#33021;&#28304;&#21644;&#20998;&#24067;&#24335;&#21457;&#30005;&#31995;&#32479;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#21487;&#25345;&#32493;&#36816;&#33829;&#31649;&#29702;&#12289;&#20248;&#21270;&#21644;&#24223;&#27700;&#22788;&#29702;&#39046;&#22495;&#36827;&#34892;&#20102;&#35768;&#22810;&#30740;&#31350;&#65292;&#21462;&#24471;&#20102;&#21487;&#25345;&#32493;&#21457;&#23637;&#12290;&#26412;&#25991;&#22312;&#27431;&#27954;&#27668;&#20505;&#20013;&#24615;&#24895;&#26223;&#30340;&#32972;&#26223;&#19979;&#65292;&#22238;&#39038;&#20102;&#26377;&#25928;&#30340;&#33073;&#30899;&#31574;&#30053;&#65292;&#24182;&#25552;&#20986;&#20102;&#21487;&#25345;&#32493;&#24615;&#26041;&#27861;&#26469;&#20943;&#36731;&#24314;&#31569;&#12289;&#33021;&#28304;&#12289;&#24037;&#19994;&#21644;&#20132;&#36890;&#31561;&#21508;&#20010;&#39046;&#22495;&#30340;&#30899;&#21270;&#12290;&#35813;&#30740;&#31350;&#36824;&#25506;&#35752;&#20102;&#25968;&#23383;&#21270;&#22312;&#20943;&#30899;&#20013;&#30340;&#20316;&#29992;&#65292;&#24182;&#22238;&#39038;&#20102;&#33021;&#22815;&#23558;&#25919;&#24220;&#34892;&#21160;&#24341;&#23548;&#21521;&#27668;&#20505;&#20013;&#24615;&#31038;&#20250;&#30340;&#33073;&#30899;&#25919;&#31574;&#12290;&#26412;&#25991;&#36824;&#23545;&#24212;&#29992;&#20110;&#31185;&#23398;&#25216;&#26415;&#39046;&#22495;&#30340;&#20248;&#21270;&#26041;&#27861;&#36827;&#34892;&#20102;&#32508;&#36848;&#65292;&#21253;&#25324;&#22522;&#20110;&#21508;&#31181;&#21516;&#34892;&#35780;&#23457;&#30340;&#30740;&#31350;&#35770;&#25991;&#30340;&#29616;&#20195;&#20248;&#21270;&#25216;&#26415;&#12290;&#23427;&#24378;&#35843;&#20102;&#38750;&#20256;&#32479;&#33021;&#28304;&#21644;&#20998;&#24067;&#24335;&#21457;&#30005;&#31995;&#32479;&#20197;&#21450;&#38750;&#31649;&#21046;&#21644;&#31649;&#21046;&#29615;&#22659;&#12290;&#27492;&#22806;&#65292;&#26412;&#25991;&#25209;&#35780;&#24615;&#22320;&#22238;&#39038;&#20102;&#24615;&#33021;&#21644;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
Various studies have been conducted in the fields of sustainable operations management, optimization, and wastewater treatment, yielding unsubstantiated recovery. In the context of Europes climate neutrality vision, this paper reviews effective decarbonization strategies and proposes sustainable approaches to mitigate carbonization in various sectors such as building, energy, industry, and transportation. The study also explores the role of digitalization in decarbonization and reviews decarbonization policies that can direct governments action towards a climate-neutral society. The paper also presents a review of optimization approaches applied in the fields of science and technology, incorporating modern optimization techniques based on various peer-reviewed published research papers. It emphasizes non-conventional energy and distributed power generating systems along with the deregulated and regulated environment. Additionally, this paper critically reviews the performance and capab
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#22312;&#21333;&#19968;&#23610;&#24230;&#19979;&#23545;&#26080;&#38480;&#32500;&#38480;&#20215;&#22996;&#25176;&#35746;&#21333;&#31807;&#27169;&#22411;&#36827;&#34892;&#20102;&#19968;&#38454;&#21644;&#20108;&#38454;&#36817;&#20284;&#65292;&#24471;&#21040;&#20102;&#38750;&#36864;&#21270;&#30340;&#20215;&#26684;&#21644;&#25104;&#20132;&#37327;&#21160;&#24577;&#65292;&#24182;&#35777;&#26126;&#20102;&#28436;&#21270;&#26041;&#31243;&#30340;&#21807;&#19968;&#35299;&#20197;&#21450;&#26631;&#20934;&#21270;&#30340;LOB&#27169;&#22411;&#24207;&#21015;&#24369;&#25910;&#25947;&#20110;&#35813;&#35299;&#12290;</title><link>http://arxiv.org/abs/2308.00805</link><description>&lt;p&gt;
&#21333;&#23610;&#24230;&#24773;&#20917;&#19979;&#38480;&#20215;&#22996;&#25176;&#35746;&#21333;&#31807;&#30340;&#20108;&#38454;&#36817;&#20284;
&lt;/p&gt;
&lt;p&gt;
Second-Order Approximation of Limit Order Books in a Single-Scale Regime. (arXiv:2308.00805v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.00805
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#21333;&#19968;&#23610;&#24230;&#19979;&#23545;&#26080;&#38480;&#32500;&#38480;&#20215;&#22996;&#25176;&#35746;&#21333;&#31807;&#27169;&#22411;&#36827;&#34892;&#20102;&#19968;&#38454;&#21644;&#20108;&#38454;&#36817;&#20284;&#65292;&#24471;&#21040;&#20102;&#38750;&#36864;&#21270;&#30340;&#20215;&#26684;&#21644;&#25104;&#20132;&#37327;&#21160;&#24577;&#65292;&#24182;&#35777;&#26126;&#20102;&#28436;&#21270;&#26041;&#31243;&#30340;&#21807;&#19968;&#35299;&#20197;&#21450;&#26631;&#20934;&#21270;&#30340;LOB&#27169;&#22411;&#24207;&#21015;&#24369;&#25910;&#25947;&#20110;&#35813;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22312;&#19968;&#20010;&#21333;&#19968;&#30340;&#23610;&#24230;&#24773;&#20917;&#19979;&#24314;&#31435;&#20102;&#19968;&#20010;&#26080;&#38480;&#32500;&#24230;&#30340;&#38480;&#20215;&#22996;&#25176;&#35746;&#21333;&#31807;&#27169;&#22411;(LOB)&#30340;&#19968;&#38454;&#21644;&#20108;&#38454;&#36817;&#20284;&#65292;&#35813;&#27169;&#22411;&#20013;&#24066;&#22330;&#22996;&#25176;&#21644;&#38480;&#20215;&#22996;&#25176;&#22312;&#19968;&#20010;&#20849;&#21516;&#30340;&#26102;&#38388;&#23610;&#24230;&#19979;&#21040;&#36798;&#12290;&#36890;&#36807;&#25105;&#20204;&#36873;&#25321;&#30340;&#23610;&#24230;&#65292;&#25105;&#20204;&#24471;&#21040;&#20215;&#26684;&#21644;&#25104;&#20132;&#37327;&#21160;&#24577;&#30340;&#38750;&#36864;&#21270;&#30340;&#19968;&#38454;&#21644;&#20108;&#38454;&#36817;&#20284;&#12290;&#19968;&#38454;&#36817;&#20284;&#30001;&#19968;&#20010;&#26631;&#20934;&#30340;&#32806;&#21512;ODE-PDE&#31995;&#32479;&#32473;&#20986;&#65292;&#32780;&#20108;&#38454;&#36817;&#20284;&#26159;&#38750;&#26631;&#20934;&#30340;&#65292;&#24182;&#19988;&#29992;&#19968;&#20010;&#30001;&#22278;&#26609;&#24067;&#26391;&#36816;&#21160;&#39537;&#21160;&#30340;&#26080;&#38480;&#32500;&#38543;&#26426;&#28436;&#21270;&#26041;&#31243;&#25551;&#36848;&#12290;&#39537;&#21160;&#22122;&#22768;&#36807;&#31243;&#22312;&#27169;&#22411;&#21442;&#25968;&#26041;&#38754;&#34920;&#29616;&#20986;&#38750;&#24179;&#20961;&#30340;&#30456;&#20851;&#24615;&#12290;&#25105;&#20204;&#35777;&#26126;&#28436;&#21270;&#26041;&#31243;&#26377;&#21807;&#19968;&#30340;&#35299;&#65292;&#24182;&#19988;&#26631;&#20934;&#21270;&#30340;LOB&#27169;&#22411;&#24207;&#21015;&#24369;&#25910;&#25947;&#20110;&#28436;&#21270;&#26041;&#31243;&#30340;&#35299;&#12290;&#35777;&#26126;&#20351;&#29992;&#20102;&#19968;&#20010;&#38750;&#26631;&#20934;&#30340;&#38789;&#38382;&#39064;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#27169;&#22411;&#30340;&#31616;&#21270;&#29256;&#26412;&#26657;&#20934;&#21040;&#24066;&#22330;&#25968;&#25454;&#65292;&#24182;&#23637;&#31034;&#20102;&#27169;&#22411;&#30340;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We establish a first and second-order approximation for an infinite dimensional limit order book model (LOB) in a single (''critical'') scaling regime where market and limit orders arrive at a common time scale. With our choice of scaling we obtain non-degenerate first-order and second-order approximations for the price and volume dynamics. While the first-order approximation is given by a standard coupled ODE-PDE system, the second-order approximation is non-standard and described in terms of an infinite-dimensional stochastic evolution equation driven by a cylindrical Brownian motion. The driving noise processes exhibit a non-trivial correlation in terms of the model parameters. We prove that the evolution equation has a unique solution and that the sequence of standardized LOB models converges weakly to the solution of the evolution equation. The proof uses a non-standard martingale problem. We calibrate a simplified version of our model to market data and show that the model accura
&lt;/p&gt;</description></item><item><title>SARS-CoV-2&#30149;&#27602;&#24341;&#21457;&#20102;&#19968;&#22330;&#20449;&#24687;&#27867;&#28389;&#65292;&#23548;&#33268;&#19981;&#30830;&#23450;&#27675;&#22260;&#30340;&#24314;&#31435;&#12290;&#22269;&#23478;&#21644;&#38750;&#22269;&#23478;&#34892;&#20026;&#32773;&#36890;&#36807;&#25805;&#32437;&#35748;&#30693;&#39046;&#22495;&#36827;&#34892;&#20449;&#24687;&#31649;&#29702;&#65292;&#26500;&#25104;&#20102;&#19968;&#22330;&#35748;&#30693;&#25112;&#20105;&#12290;&#20844;&#27665;&#21644;&#26426;&#26500;&#24212;&#37319;&#21462;&#25209;&#21028;&#24615;&#20998;&#26512;&#24577;&#24230;&#65292;&#22269;&#38469;&#21512;&#20316;&#25919;&#31574;&#21487;&#24110;&#21161;&#25239;&#20987;&#35748;&#30693;&#25112;&#20105;&#24182;&#20943;&#23569;&#20854;&#28798;&#38590;&#24615;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2308.00706</link><description>&lt;p&gt;
Infodemia&#21644;&#22823;&#27969;&#34892;&#30149;&#65306;SARS-CoV-2&#26102;&#20195;&#30340;&#35748;&#30693;&#25112;&#20105;
&lt;/p&gt;
&lt;p&gt;
Infodemia e pandemia: la cognitive warfare ai tempi del SARS-CoV-2. (arXiv:2308.00706v1 [physics.soc-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.00706
&lt;/p&gt;
&lt;p&gt;
SARS-CoV-2&#30149;&#27602;&#24341;&#21457;&#20102;&#19968;&#22330;&#20449;&#24687;&#27867;&#28389;&#65292;&#23548;&#33268;&#19981;&#30830;&#23450;&#27675;&#22260;&#30340;&#24314;&#31435;&#12290;&#22269;&#23478;&#21644;&#38750;&#22269;&#23478;&#34892;&#20026;&#32773;&#36890;&#36807;&#25805;&#32437;&#35748;&#30693;&#39046;&#22495;&#36827;&#34892;&#20449;&#24687;&#31649;&#29702;&#65292;&#26500;&#25104;&#20102;&#19968;&#22330;&#35748;&#30693;&#25112;&#20105;&#12290;&#20844;&#27665;&#21644;&#26426;&#26500;&#24212;&#37319;&#21462;&#25209;&#21028;&#24615;&#20998;&#26512;&#24577;&#24230;&#65292;&#22269;&#38469;&#21512;&#20316;&#25919;&#31574;&#21487;&#24110;&#21161;&#25239;&#20987;&#35748;&#30693;&#25112;&#20105;&#24182;&#20943;&#23569;&#20854;&#28798;&#38590;&#24615;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;SARS-CoV-2&#30340;&#20986;&#29616;&#65292;&#20986;&#29616;&#20102;&#20004;&#31181;&#27969;&#34892;&#30149;&#65306;&#19968;&#31181;&#26159;&#20581;&#24247;&#27969;&#34892;&#30149;&#65292;&#21478;&#19968;&#31181;&#26159;&#20449;&#24687;&#27969;&#34892;&#30149;&#12290;&#35813;&#30149;&#27602;&#24341;&#21457;&#20102;&#19968;&#22330;&#21069;&#25152;&#26410;&#26377;&#30340;&#20449;&#24687;&#27867;&#28389;&#65292;&#20026;&#24314;&#31435;&#26497;&#24230;&#19981;&#30830;&#23450;&#30340;&#27675;&#22260;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;&#22823;&#37327;&#20887;&#20313;&#30340;&#20449;&#24687;&#20063;&#25104;&#20026;&#22269;&#23478;&#21644;&#38750;&#22269;&#23478;&#34892;&#20026;&#32773;&#22312;&#20840;&#29699;&#33539;&#22260;&#20869;&#20256;&#25773;&#23459;&#20256;&#30340;&#26377;&#25928;&#36884;&#24452;&#12290;&#36825;&#26159;&#19968;&#31181;&#30495;&#27491;&#30340;&#25932;&#23545;&#34892;&#20026;&#65292;&#20854;&#20013;&#19981;&#39044;&#35265;&#36523;&#20307;&#26292;&#21147;&#65292;&#32780;&#26159;&#36890;&#36807;&#25805;&#32437;&#35748;&#30693;&#39046;&#22495;&#26469;&#23545;&#20449;&#24687;&#36827;&#34892;&#31995;&#32479;&#31649;&#29702;&#12290;&#22240;&#27492;&#65292;&#20844;&#27665;&#21644;&#26426;&#26500;&#37319;&#21462;&#20027;&#21160;&#30340;&#25209;&#21028;&#24615;&#20998;&#26512;&#24577;&#24230;&#65292;&#20197;&#21450;&#22312;&#22269;&#38469;&#23618;&#38754;&#19978;&#23454;&#26045;&#20849;&#21516;&#25919;&#31574;&#65292;&#26080;&#30097;&#21487;&#20197;&#20419;&#36827;&#23545;&#35748;&#30693;&#25112;&#20105;&#65288;&#25152;&#35859;&#30340;&#35748;&#30693;&#25112;&#20105;&#65289;&#30340;&#26007;&#20105;&#65292;&#24182;&#22240;&#27492;&#38480;&#21046;&#20854;&#28798;&#38590;&#24615;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
With the appearance of SARS-CoV-2, two epidemics have spread: one for health and one for information. The virus has generated an unprecedented infodemic, contributing to the establishment of a climate of great uncertainty. Massive and redundant information has also been an effective vector of propaganda, on a global scale, by state and non-state actors. A real hostile act in which physical violence is not foreseen, but systematic management of information through the manipulation of the cognitive sphere. For this reason, the adoption of an attitude of active critical analysis by citizens and institutions and also the implementation of common policies at an international level could undoubtedly facilitate the fight against cognitive warfare (so-called cognitive warfare) and therefore limit its disastrous effects.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20197;&#20013;&#22269;&#32769;&#23383;&#21495;&#21697;&#29260;&#20225;&#19994;&#20026;&#30740;&#31350;&#23545;&#35937;&#65292;&#36890;&#36807;&#23454;&#35777;&#30740;&#31350;&#20102;&#33410;&#26085;&#25928;&#24212;&#23545;&#20013;&#22269;&#32769;&#23383;&#21495;&#21697;&#29260;&#20225;&#19994;&#19978;&#24066;&#20844;&#21496;&#22238;&#25253;&#30340;&#24433;&#21709;&#12290;&#23454;&#35777;&#32467;&#26524;&#26377;&#21161;&#20110;&#25105;&#20204;&#20102;&#35299;&#20013;&#22269;&#32769;&#23383;&#21495;&#21697;&#29260;&#20225;&#19994;&#30340;&#29305;&#28857;&#21644;&#33410;&#26085;&#25928;&#24212;&#23545;&#20854;&#32929;&#31080;&#24066;&#22330;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2308.00702</link><description>&lt;p&gt;
&#20013;&#22269;&#32769;&#23383;&#21495;&#20225;&#19994;&#33410;&#26085;&#25928;&#24212;&#30340;&#23454;&#35777;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
An Empirical Study on the Holiday Effect of China's Time-Honored Companies. (arXiv:2308.00702v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.00702
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20197;&#20013;&#22269;&#32769;&#23383;&#21495;&#21697;&#29260;&#20225;&#19994;&#20026;&#30740;&#31350;&#23545;&#35937;&#65292;&#36890;&#36807;&#23454;&#35777;&#30740;&#31350;&#20102;&#33410;&#26085;&#25928;&#24212;&#23545;&#20013;&#22269;&#32769;&#23383;&#21495;&#21697;&#29260;&#20225;&#19994;&#19978;&#24066;&#20844;&#21496;&#22238;&#25253;&#30340;&#24433;&#21709;&#12290;&#23454;&#35777;&#32467;&#26524;&#26377;&#21161;&#20110;&#25105;&#20204;&#20102;&#35299;&#20013;&#22269;&#32769;&#23383;&#21495;&#21697;&#29260;&#20225;&#19994;&#30340;&#29305;&#28857;&#21644;&#33410;&#26085;&#25928;&#24212;&#23545;&#20854;&#32929;&#31080;&#24066;&#22330;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20013;&#22269;&#32769;&#23383;&#21495;&#21697;&#29260;&#20225;&#19994;&#30340;&#32929;&#31080;&#26495;&#22359;&#22312;&#35777;&#21048;&#32929;&#31080;&#24066;&#22330;&#20013;&#21344;&#25454;&#37325;&#35201;&#22320;&#20301;&#12290;&#33410;&#26085;&#25928;&#24212;&#26159;&#35777;&#21048;&#24066;&#22330;&#19978;&#20986;&#29616;&#30340;&#24066;&#22330;&#24322;&#24120;&#20043;&#19968;&#65292;&#25351;&#30340;&#26159;&#32929;&#31080;&#24066;&#22330;&#22312;&#33410;&#26085;&#21608;&#22260;&#30340;&#20132;&#26131;&#26085;&#19982;&#20854;&#20182;&#20132;&#26131;&#26085;&#30340;&#22238;&#25253;&#26174;&#33879;&#19981;&#21516;&#30340;&#29616;&#35937;&#12290;&#23545;&#20013;&#22269;&#32769;&#23383;&#21495;&#21697;&#29260;&#20225;&#19994;&#30340;&#33410;&#26085;&#25928;&#24212;&#30340;&#30740;&#31350;&#21487;&#20197;&#20026;&#25105;&#20204;&#30340;&#32769;&#23383;&#21495;&#21697;&#29260;&#25391;&#20852;&#21644;&#32769;&#23383;&#21495;&#20225;&#19994;&#30340;&#25391;&#20852;&#25552;&#20379;&#26032;&#24605;&#36335;&#12290;&#26412;&#25991;&#20197;&#20013;&#22269;&#32769;&#23383;&#21495;&#21697;&#29260;&#20225;&#19994;&#30340;&#19978;&#24066;&#20844;&#21496;&#20026;&#30740;&#31350;&#23545;&#35937;&#65292;&#21033;&#29992;&#20107;&#20214;&#30740;&#31350;&#26041;&#27861;&#65292;&#37325;&#28857;&#30740;&#31350;&#20102;&#33410;&#26085;&#25928;&#24212;&#23545;&#20013;&#22269;&#32769;&#23383;&#21495;&#21697;&#29260;&#20225;&#19994;&#19978;&#24066;&#20844;&#21496;&#30340;&#24433;&#21709;&#65292;&#24182;&#36890;&#36807;&#23454;&#35777;&#20998;&#26512;&#20102;2012&#24180;&#33267;2021&#24180;&#26149;&#33410;&#26399;&#38388;&#20013;&#22269;&#32769;&#23383;&#21495;&#21697;&#29260;&#20225;&#19994;&#19978;&#24066;&#20844;&#21496;&#22238;&#25253;&#30340;&#21464;&#21270;&#12290;&#23454;&#35777;&#32467;&#26524;&#26174;&#31034;&#65306;&#32769;&#23383;&#21495;&#27010;&#24565;&#32929;&#20855;&#26377;
&lt;/p&gt;
&lt;p&gt;
The stock segment of China's time-honored brand enterprises has an important position in our securities stock market. The holiday effect is one of the market anomalies that occur in the securities market, which refers to the phenomenon that the stock market has significantly different returns than other trading days around festivals. The study of the holiday effect of China's time-honored brand enterprises can provide fresh ideas for the revitalization of our time-honored brands and the revitalization of time-honored enterprises. This paper takes listed companies of China's time-honored brand enterprises as the research object and focuses on the impact of the holiday effect on listed companies of China's time-honored brands with the help of the event study, and empirically analyses the changes in the return of listed companies of China time-honored brands during the Spring Festival period from 2012 to 2021. The empirical results reveal that: the time-honored brand concept stocks have a
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;Uniswap&#30340;&#25968;&#25454;&#21457;&#29616;&#65292;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#20013;&#30340;&#22266;&#23450;&#20132;&#26131;&#25104;&#26412;&#23548;&#33268;&#20102;&#23567;&#22411;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#21463;&#21040;&#19981;&#25104;&#27604;&#20363;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#26159;&#20302;&#36153;&#29992;&#27744;&#21644;&#39640;&#36153;&#29992;&#27744;&#20043;&#38388;&#30340;&#27969;&#21160;&#24615;&#20379;&#24212;&#20998;&#35010;&#65292;&#32473;&#22823;&#22411;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#21644;&#23567;&#22411;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#24102;&#26469;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2307.13772</link><description>&lt;p&gt;
&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#30340;&#27969;&#21160;&#24615;&#20998;&#35010;
&lt;/p&gt;
&lt;p&gt;
Liquidity fragmentation on decentralized exchanges. (arXiv:2307.13772v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.13772
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;Uniswap&#30340;&#25968;&#25454;&#21457;&#29616;&#65292;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#20013;&#30340;&#22266;&#23450;&#20132;&#26131;&#25104;&#26412;&#23548;&#33268;&#20102;&#23567;&#22411;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#21463;&#21040;&#19981;&#25104;&#27604;&#20363;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#26159;&#20302;&#36153;&#29992;&#27744;&#21644;&#39640;&#36153;&#29992;&#27744;&#20043;&#38388;&#30340;&#27969;&#21160;&#24615;&#20379;&#24212;&#20998;&#35010;&#65292;&#32473;&#22823;&#22411;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#21644;&#23567;&#22411;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#24102;&#26469;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#20013;&#27969;&#21160;&#24615;&#20379;&#24212;&#30340;&#35268;&#27169;&#32463;&#27982;&#24615;&#65292;&#37325;&#28857;&#20851;&#27880;&#22266;&#23450;&#20132;&#26131;&#25104;&#26412;&#65288;&#20363;&#22914;&#29123;&#27668;&#20215;&#26684;&#65289;&#23545;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65288;LPs&#65289;&#30340;&#24433;&#21709;&#12290;&#23567;&#22411;LPs&#21463;&#21040;&#22266;&#23450;&#25104;&#26412;&#30340;&#19981;&#25104;&#27604;&#20363;&#24433;&#21709;&#65292;&#23548;&#33268;&#20302;&#36153;&#29992;&#27744;&#21644;&#39640;&#36153;&#29992;&#27744;&#20043;&#38388;&#30340;&#27969;&#21160;&#24615;&#20379;&#24212;&#20998;&#35010;&#12290;&#36890;&#36807;&#20998;&#26512;Uniswap&#30340;&#25968;&#25454;&#65292;&#25105;&#20204;&#21457;&#29616;&#39640;&#36153;&#29992;&#27744;&#21560;&#24341;&#20102;56%&#30340;&#27969;&#21160;&#24615;&#20379;&#24212;&#65292;&#20294;&#21482;&#25191;&#34892;&#20102;35%&#30340;&#20132;&#26131;&#37327;&#12290;&#22823;&#22411;&#65288;&#26426;&#26500;&#65289;LPs&#20027;&#23548;&#20302;&#36153;&#29992;&#27744;&#65292;&#32463;&#24120;&#26681;&#25454;&#22823;&#37327;&#20132;&#26131;&#36827;&#34892;&#35843;&#25972;&#12290;&#30456;&#21453;&#65292;&#23567;&#22411;&#65288;&#38646;&#21806;&#65289;LPs&#36235;&#20110;&#39640;&#36153;&#29992;&#27744;&#65292;&#20026;&#20102;&#20943;&#36731;&#36739;&#23567;&#30340;&#27969;&#21160;&#24615;&#31649;&#29702;&#25104;&#26412;&#32780;&#25509;&#21463;&#36739;&#20302;&#30340;&#25191;&#34892;&#27010;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study economies of scale in liquidity provision on decentralized exchanges, focusing on the impact of fixed transaction costs such as gas prices on liquidity providers (LPs). Small LPs are disproportionately affected by the fixed cost, resulting in liquidity supply fragmentation between low- and high-fee pools. Analyzing Uniswap data, we find that high-fee pools attract 56% of liquidity supply but execute only 35% of trading volume. Large (institutional) LPs dominate low-fee pools, frequently adjusting positions in response to substantial trading volume. In contrast, small (retail) LPs converge to high-fee pools, accepting lower execution probabilities to mitigate smaller liquidity management costs.
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27969;&#21160;&#24615;&#30340;&#20998;&#25955;&#39044;&#27979;&#24066;&#22330;&#26694;&#26550;&#65292;&#35813;&#26694;&#26550;&#20855;&#22791;&#21512;&#29702;&#30340;&#37329;&#34701;&#24615;&#36136;&#65292;&#24182;&#25552;&#20986;&#20102;&#26377;&#24847;&#20041;&#30340;&#20132;&#26131;&#36153;&#29992;&#26426;&#21046;&#12290;</title><link>http://arxiv.org/abs/2307.08768</link><description>&lt;p&gt;
&#20998;&#25955;&#39044;&#27979;&#24066;&#22330;&#21644;&#20307;&#32946;&#21338;&#24425;
&lt;/p&gt;
&lt;p&gt;
Decentralized Prediction Markets and Sports Books. (arXiv:2307.08768v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.08768
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27969;&#21160;&#24615;&#30340;&#20998;&#25955;&#39044;&#27979;&#24066;&#22330;&#26694;&#26550;&#65292;&#35813;&#26694;&#26550;&#20855;&#22791;&#21512;&#29702;&#30340;&#37329;&#34701;&#24615;&#36136;&#65292;&#24182;&#25552;&#20986;&#20102;&#26377;&#24847;&#20041;&#30340;&#20132;&#26131;&#36153;&#29992;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#27979;&#24066;&#22330;&#20801;&#35768;&#20132;&#26131;&#32773;&#23545;&#28508;&#22312;&#30340;&#26410;&#26469;&#32467;&#26524;&#36827;&#34892;&#25237;&#27880;&#65292;&#36825;&#20123;&#24066;&#22330;&#23384;&#22312;&#20110;&#22825;&#27668;&#12289;&#25919;&#27835;&#12289;&#20307;&#32946;&#21644;&#32463;&#27982;&#39044;&#27979;&#39046;&#22495;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#20351;&#29992;&#33258;&#21160;&#21270;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMMs&#65289;&#30340;&#20998;&#25955;&#39044;&#27979;&#24066;&#22330;&#26694;&#26550;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#22522;&#20110;&#27969;&#21160;&#24615;&#30340;&#39044;&#27979;&#24066;&#22330; AMM &#32467;&#26500;&#65292;&#35813;&#32467;&#26500;&#22312;&#24213;&#23618;&#25928;&#29992;&#20989;&#25968;&#19978;&#28385;&#36275;&#21512;&#29702;&#30340;&#37329;&#34701;&#24615;&#36136;&#65292;&#21253;&#25324;&#25237;&#27880;&#25104;&#26412;&#21644;&#32467;&#26524;&#23450;&#20215;&#30340;&#30456;&#20851;&#24615;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#27969;&#21160;&#24615;&#22914;&#20309;&#21487;&#20197;&#20174; AMM &#20013;&#27719;&#38598;&#25110;&#25764;&#22238;&#20197;&#21450;&#23545;&#24066;&#22330;&#34892;&#20026;&#30340;&#24433;&#21709;&#12290;&#22312;&#32771;&#34385;&#36825;&#20010;&#20998;&#25955;&#30340;&#26694;&#26550;&#26102;&#65292;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#21487;&#20197;&#29992;&#20110;&#20132;&#26131;&#25910;&#21462;&#26377;&#24847;&#20041;&#36153;&#29992;&#30340;&#24314;&#35758;&#65292;&#20197;&#34917;&#20607;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#23545;&#24066;&#22330;&#30340;&#37325;&#35201;&#21151;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Prediction markets allow traders to bet on potential future outcomes. These markets exist for weather, political, sports, and economic forecasting. Within this work we consider a decentralized framework for prediction markets using automated market makers (AMMs). Specifically, we construct a liquidity-based AMM structure for prediction markets that, under reasonable axioms on the underlying utility function, satisfy meaningful financial properties on the cost of betting and the resulting pricing oracle. Importantly, we study how liquidity can be pooled or withdrawn from the AMM and the resulting implications to the market behavior. In considering this decentralized framework, we additionally propose financially meaningful fees that can be collected for trading to compensate the liquidity providers for their vital market function.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102; ChatGPT&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#35752;&#35770;&#23545;&#32654;&#22269;&#23398;&#29983;&#39044;&#26399;&#21171;&#21160;&#24066;&#22330;&#32467;&#26524;&#30340;&#22240;&#26524;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#23398;&#29983;&#20449;&#24515;&#20250;&#38477;&#20302;&#65292;&#23545;&#26410;&#26469;&#30340;&#25910;&#20837;&#21069;&#26223;&#20445;&#25345;&#24754;&#35266;&#24577;&#24230;&#65292;&#36825;&#31181;&#24433;&#21709;&#24191;&#27867;&#23384;&#22312;&#20110;&#19981;&#21516;&#23398;&#29983;&#32676;&#20307;&#20013;&#12290;&#36825;&#20010;&#30740;&#31350;&#32473;&#25945;&#32946;&#24037;&#20316;&#32773;&#12289;&#31649;&#29702;&#32773;&#21644;&#25919;&#31574;&#21046;&#23450;&#32773;&#25552;&#20379;&#20102;&#19968;&#20010;&#26426;&#20250;&#65292;&#20197;&#26356;&#22909;&#22320;&#20102;&#35299;&#23398;&#29983;&#30340;&#25285;&#24551;&#24182;&#25913;&#36827;&#25945;&#32946;&#35838;&#31243;&#65292;&#20351;&#23398;&#29983;&#26356;&#22909;&#22320;&#20934;&#22791;&#26410;&#26469;&#65292;&#36825;&#20010;&#26410;&#26469;&#24517;&#28982;&#20250;&#34987;AI&#25913;&#21464;&#12290;</title><link>http://arxiv.org/abs/2305.11900</link><description>&lt;p&gt;
ChatGPT&#19982;&#21171;&#21160;&#21147;&#24066;&#22330;&#65306;&#25581;&#31034;AI&#35752;&#35770;&#23545;&#23398;&#29983;&#25910;&#20837;&#39044;&#26399;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
ChatGPT and the Labor Market: Unraveling the Effect of AI Discussions on Students' Earnings Expectations. (arXiv:2305.11900v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.11900
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102; ChatGPT&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#35752;&#35770;&#23545;&#32654;&#22269;&#23398;&#29983;&#39044;&#26399;&#21171;&#21160;&#24066;&#22330;&#32467;&#26524;&#30340;&#22240;&#26524;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#23398;&#29983;&#20449;&#24515;&#20250;&#38477;&#20302;&#65292;&#23545;&#26410;&#26469;&#30340;&#25910;&#20837;&#21069;&#26223;&#20445;&#25345;&#24754;&#35266;&#24577;&#24230;&#65292;&#36825;&#31181;&#24433;&#21709;&#24191;&#27867;&#23384;&#22312;&#20110;&#19981;&#21516;&#23398;&#29983;&#32676;&#20307;&#20013;&#12290;&#36825;&#20010;&#30740;&#31350;&#32473;&#25945;&#32946;&#24037;&#20316;&#32773;&#12289;&#31649;&#29702;&#32773;&#21644;&#25919;&#31574;&#21046;&#23450;&#32773;&#25552;&#20379;&#20102;&#19968;&#20010;&#26426;&#20250;&#65292;&#20197;&#26356;&#22909;&#22320;&#20102;&#35299;&#23398;&#29983;&#30340;&#25285;&#24551;&#24182;&#25913;&#36827;&#25945;&#32946;&#35838;&#31243;&#65292;&#20351;&#23398;&#29983;&#26356;&#22909;&#22320;&#20934;&#22791;&#26410;&#26469;&#65292;&#36825;&#20010;&#26410;&#26469;&#24517;&#28982;&#20250;&#34987;AI&#25913;&#21464;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36127;&#38754;&#21644;&#27491;&#38754; ChatGPT&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#35752;&#35770;&#23545;&#32654;&#22269;&#23398;&#29983;&#39044;&#26399;&#21171;&#21160;&#24066;&#22330;&#32467;&#26524;&#30340;&#22240;&#26524;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#25509;&#35302;AI&#35752;&#35770;&#21518;&#65292;&#23398;&#29983;&#20449;&#24515;&#20250;&#38477;&#20302;&#65292;&#29305;&#21035;&#26159;&#22312;&#38405;&#35835;&#36127;&#38754;&#24773;&#32490;&#30340;&#35752;&#35770;&#25688;&#24405;&#26102;&#65292;&#36825;&#31181;&#24433;&#21709;&#26356;&#21152;&#26126;&#26174;&#12290;&#19982;STEM&#19987;&#19994;&#19981;&#21516;&#65292;&#38750;STEM&#39046;&#22495;&#30340;&#23398;&#29983;&#34920;&#29616;&#20986;&#19981;&#23545;&#31216;&#21644;&#24754;&#35266;&#30340;&#20449;&#20208;&#21464;&#21270;&#65292;&#34920;&#26126;&#20182;&#20204;&#21487;&#33021;&#24863;&#21463;&#21040;&#26032;&#20852;AI&#25216;&#26415;&#30340;&#24433;&#21709;&#26356;&#24378;&#12290;&#23545;&#20110;&#26410;&#26469;&#25910;&#20837;&#30340;&#24754;&#35266;&#20449;&#20208;&#26356;&#26032;&#20063;&#26222;&#36941;&#23384;&#22312;&#20110;&#21508;&#20010;&#24615;&#21035;&#21644;GPA&#27700;&#24179;&#20043;&#38388;&#65292;&#36825;&#34920;&#26126;&#25152;&#26377;&#23398;&#29983;&#32676;&#20307;&#37117;&#23384;&#22312;&#24191;&#27867;&#30340;AI&#25285;&#24551;&#12290;&#25945;&#32946;&#24037;&#20316;&#32773;&#12289;&#31649;&#29702;&#32773;&#21644;&#25919;&#31574;&#21046;&#23450;&#32773;&#21487;&#20197;&#23450;&#26399;&#19982;&#23398;&#29983;&#20114;&#21160;&#20197;&#35299;&#20915;&#20182;&#20204;&#30340;&#25285;&#24551;&#65292;&#24182;&#25913;&#36827;&#25945;&#32946;&#35838;&#31243;&#65292;&#20351;&#20182;&#20204;&#26356;&#22909;&#22320;&#20934;&#22791;&#26410;&#26469;&#65292;&#36825;&#20010;&#26410;&#26469;&#24517;&#28982;&#20250;&#34987;AI&#25913;&#21464;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper investigates the causal impact of negatively and positively framed ChatGPT Artificial Intelligence (AI) discussions on US students' anticipated labor market outcomes. Our findings reveal students reduce their confidence regarding their future earnings prospects after exposure to AI debates, and this effect is more pronounced after reading discussion excerpts with a negative tone. Unlike STEM majors, students in Non-STEM fields show asymmetric and pessimistic belief changes, suggesting that they might feel more vulnerable to emerging AI technologies. Pessimistic belief updates regarding future earnings are also prevalent across gender and GPA levels, indicating widespread AI concerns among all student subgroups. Educators, administrators, and policymakers may regularly engage with students to address their concerns and enhance educational curricula to better prepare them for a future that will be inevitably shaped by AI.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#26085;&#26412;&#32929;&#31080;&#24066;&#22330;&#20013;APT&#30340;&#26102;&#38388;&#19981;&#31283;&#23450;&#24615;&#65292;&#21457;&#29616;APT&#20316;&#20026;&#35299;&#37322;&#26085;&#26412;&#32929;&#31080;&#24066;&#22330;&#30340;&#36866;&#24403;&#27169;&#22411;&#30340;&#26377;&#25928;&#24615;&#38543;&#26102;&#38388;&#21464;&#21270;&#19981;&#31283;&#23450;&#65292;&#39118;&#38505;&#22240;&#32032;&#30340;&#21464;&#21270;&#12289;&#36135;&#24065;&#25919;&#31574;&#21644;&#21830;&#19994;&#21608;&#26399;&#31561;&#22240;&#32032;&#37117;&#21487;&#33021;&#24433;&#21709;&#20854;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2305.05998</link><description>&lt;p&gt;
&#20851;&#20110;APT&#30340;&#26102;&#21464;&#32467;&#26500;&#21450;&#20854;&#22312;&#26085;&#26412;&#32929;&#31080;&#24066;&#22330;&#30340;&#24212;&#29992;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On the Time-Varying Structure of the Arbitrage Pricing Theory using the Japanese Sector Indices. (arXiv:2305.05998v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.05998
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26085;&#26412;&#32929;&#31080;&#24066;&#22330;&#20013;APT&#30340;&#26102;&#38388;&#19981;&#31283;&#23450;&#24615;&#65292;&#21457;&#29616;APT&#20316;&#20026;&#35299;&#37322;&#26085;&#26412;&#32929;&#31080;&#24066;&#22330;&#30340;&#36866;&#24403;&#27169;&#22411;&#30340;&#26377;&#25928;&#24615;&#38543;&#26102;&#38388;&#21464;&#21270;&#19981;&#31283;&#23450;&#65292;&#39118;&#38505;&#22240;&#32032;&#30340;&#21464;&#21270;&#12289;&#36135;&#24065;&#25919;&#31574;&#21644;&#21830;&#19994;&#21608;&#26399;&#31561;&#22240;&#32032;&#37117;&#21487;&#33021;&#24433;&#21709;&#20854;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26159;&#31532;&#19968;&#31687;&#30740;&#31350;&#22312;&#26085;&#26412;&#32929;&#31080;&#24066;&#22330;&#20013;&#32771;&#23519;APT&#26102;&#38388;&#19981;&#31283;&#23450;&#24615;&#30340;&#35770;&#25991;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#37319;&#29992;Fama&#21644;MacBeth&#65288;1973&#65289;&#30340;&#20004;&#27493;&#22238;&#24402;&#21644;Kamstra&#21644;Shi&#65288;2023&#65289;&#30340;&#24191;&#20041;GRS&#27979;&#35797;&#26041;&#27861;&#65292;&#34913;&#37327;&#27599;&#20010;&#39118;&#38505;&#22240;&#23376;&#21464;&#21270;&#23545;&#32929;&#31080;&#39118;&#38505;&#28322;&#20215;&#30340;&#24433;&#21709;&#65292;&#20197;&#32771;&#23519;APT&#30340;&#26377;&#25928;&#24615;&#38543;&#26102;&#38388;&#30340;&#21464;&#21270;&#12290;&#25105;&#20204;&#24635;&#32467;&#25105;&#20204;&#30340;&#23454;&#35777;&#32467;&#26524;&#22914;&#19979;&#65306;&#65288;1&#65289;APT&#22312;&#25972;&#20010;&#26679;&#26412;&#26399;&#38388;&#24471;&#21040;&#25903;&#25345;&#65292;&#20294;&#24182;&#19981;&#24635;&#26159;&#26377;&#25928;&#30340;&#65307;&#65288;2&#65289;&#36135;&#24065;&#25919;&#31574;&#30340;&#21464;&#21270;&#22312;&#26085;&#26412;&#24433;&#21709;APT&#30340;&#26377;&#25928;&#24615;&#65307;&#65288;3&#65289;&#27599;&#20010;&#22240;&#23376;&#30340;&#39118;&#38505;&#28322;&#20215;&#30340;&#26102;&#21464;&#20272;&#35745;&#20063;&#19981;&#31283;&#23450;&#65292;&#21463;&#21040;&#21830;&#19994;&#21608;&#26399;&#21644;&#32463;&#27982;&#21361;&#26426;&#30340;&#24433;&#21709;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#24471;&#20986;&#32467;&#35770;&#65292;APT&#20316;&#20026;&#35299;&#37322;&#26085;&#26412;&#32929;&#31080;&#24066;&#22330;&#30340;&#36866;&#24403;&#27169;&#22411;&#30340;&#26377;&#25928;&#24615;&#38543;&#26102;&#38388;&#30340;&#21464;&#21270;&#24182;&#19981;&#31283;&#23450;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper is the first study to examine the time instability of the APT in the Japanese stock market. In particular, we measure how changes in each risk factor affect the stock risk premiums to investigate the validity of the APT over time, applying the rolling window method to Fama and MacBeth's (1973) two-step regression and Kamstra and Shi's (2023) generalized GRS test. We summarize our empirical results as follows: (1) the APT is supported over the entire sample period but not at all times, (2) the changes in monetary policy greatly affect the validity of the APT in Japan, and (3) the time-varying estimates of the risk premiums for each factor are also unstable over time, and they are affected by the business cycle and economic crises. Therefore, we conclude that the validity of the APT as an appropriate model to explain the Japanese sector index is not stable over time.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#39046;&#22495;&#33258;&#36866;&#24212;&#23398;&#20064;&#21644;&#27169;&#20223;&#30340;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#30005;&#21147;&#22871;&#21033;&#20132;&#26131;&#12290;&#36890;&#36807;&#21033;&#29992;&#22870;&#21169;&#24037;&#31243;&#21644;&#35746;&#21333;&#20998;&#27573;&#30340;&#26041;&#24335;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#25552;&#39640;&#35757;&#32451;&#30340;&#25910;&#25947;&#24615;&#65292;&#22686;&#21152;&#31454;&#26631;&#25104;&#21151;&#29575;&#65292;&#24182;&#26174;&#33879;&#25552;&#39640;&#21033;&#28070;&#21644;&#25439;&#22833;&#12290;</title><link>http://arxiv.org/abs/2301.08360</link><description>&lt;p&gt;
&#39046;&#22495;&#33258;&#36866;&#24212;&#23398;&#20064;&#21644;&#27169;&#20223;&#65306;&#29992;&#20110;&#30005;&#21147;&#22871;&#21033;&#30340;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Domain-adapted Learning and Imitation: DRL for Power Arbitrage. (arXiv:2301.08360v2 [q-fin.TR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.08360
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#39046;&#22495;&#33258;&#36866;&#24212;&#23398;&#20064;&#21644;&#27169;&#20223;&#30340;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#30005;&#21147;&#22871;&#21033;&#20132;&#26131;&#12290;&#36890;&#36807;&#21033;&#29992;&#22870;&#21169;&#24037;&#31243;&#21644;&#35746;&#21333;&#20998;&#27573;&#30340;&#26041;&#24335;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#25552;&#39640;&#35757;&#32451;&#30340;&#25910;&#25947;&#24615;&#65292;&#22686;&#21152;&#31454;&#26631;&#25104;&#21151;&#29575;&#65292;&#24182;&#26174;&#33879;&#25552;&#39640;&#21033;&#28070;&#21644;&#25439;&#22833;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#33655;&#20848;&#30005;&#21147;&#24066;&#22330;&#65292;&#30001;&#26085;&#21069;&#24066;&#22330;&#21644;&#21363;&#26102;&#24179;&#34913;&#24066;&#22330;&#32452;&#25104;&#65292;&#24182;&#19988;&#36816;&#20316;&#26041;&#24335;&#31867;&#20284;&#25293;&#21334;&#12290;&#30001;&#20110;&#20379;&#38656;&#27874;&#21160;&#65292;&#36890;&#24120;&#23384;&#22312;&#19981;&#24179;&#34913;&#23548;&#33268;&#20004;&#20010;&#24066;&#22330;&#20215;&#26684;&#19981;&#21516;&#65292;&#20174;&#32780;&#25552;&#20379;&#22871;&#21033;&#26426;&#20250;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#23545;&#38382;&#39064;&#36827;&#34892;&#20102;&#37325;&#26500;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#21327;&#20316;&#24335;&#21452;&#20195;&#29702;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#27431;&#27954;&#30005;&#21147;&#22871;&#21033;&#20132;&#26131;&#30340;&#21452;&#23618;&#20223;&#30495;&#19982;&#20248;&#21270;&#12290;&#25105;&#20204;&#36824;&#24341;&#20837;&#20102;&#20004;&#31181;&#26032;&#30340;&#23454;&#29616;&#26041;&#24335;&#65292;&#36890;&#36807;&#27169;&#20223;&#30005;&#21147;&#20132;&#26131;&#21592;&#30340;&#20132;&#26131;&#34892;&#20026;&#26469;&#34701;&#20837;&#39046;&#22495;&#29305;&#23450;&#30693;&#35782;&#12290;&#36890;&#36807;&#21033;&#29992;&#22870;&#21169;&#24037;&#31243;&#26469;&#27169;&#20223;&#39046;&#22495;&#19987;&#19994;&#30693;&#35782;&#65292;&#25105;&#20204;&#33021;&#22815;&#37325;&#26032;&#35774;&#35745;&#24378;&#21270;&#23398;&#20064;&#20195;&#29702;&#30340;&#22870;&#21169;&#31995;&#32479;&#65292;&#25913;&#21892;&#35757;&#32451;&#20013;&#30340;&#25910;&#25947;&#24615;&#24182;&#25552;&#39640;&#25972;&#20307;&#24615;&#33021;&#12290;&#27492;&#22806;&#65292;&#35746;&#21333;&#20998;&#27573;&#22686;&#21152;&#20102;&#31454;&#26631;&#25104;&#21151;&#29575;&#65292;&#26174;&#33879;&#25552;&#39640;&#20102;&#21033;&#28070;&#21644;&#25439;&#22833;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#28436;&#31034;&#20102;&#36890;&#36807;&#39046;&#22495;&#33258;&#36866;&#24212;&#23398;&#20064;&#21644;&#27169;&#20223;&#30340;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#22312;&#30005;&#21147;&#22871;&#21033;&#20013;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we discuss the Dutch power market, which is comprised of a day-ahead market and an intraday balancing market that operates like an auction. Due to fluctuations in power supply and demand, there is often an imbalance that leads to different prices in the two markets, providing an opportunity for arbitrage. To address this issue, we restructure the problem and propose a collaborative dual-agent reinforcement learning approach for this bi-level simulation and optimization of European power arbitrage trading. We also introduce two new implementations designed to incorporate domain-specific knowledge by imitating the trading behaviours of power traders. By utilizing reward engineering to imitate domain expertise, we are able to reform the reward system for the RL agent, which improves convergence during training and enhances overall performance. Additionally, the tranching of orders increases bidding success rates and significantly boosts profit and loss (P&amp;L). Our study demo
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#23454;&#38469;&#30340;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#22312;&#22825;&#28982;&#27668;&#26399;&#36135;&#21512;&#32422;&#20132;&#26131;&#20013;&#30340;&#24212;&#29992;&#65292;&#25552;&#39640;&#20102;&#20132;&#26131;&#24615;&#33021;&#24182;&#38477;&#20302;&#20102;&#20132;&#26131;&#25104;&#26412;&#12290;&#21516;&#26102;&#65292;&#36890;&#36807;&#25552;&#20986;&#30340;&#38598;&#25104;&#23398;&#20064;&#26041;&#26696;&#65292;&#25552;&#39640;&#20102;&#27169;&#22411;&#31283;&#23450;&#24615;&#21644;&#40065;&#26834;&#24615;&#12290;</title><link>http://arxiv.org/abs/2301.08359</link><description>&lt;p&gt;
&#39046;&#22495;&#33258;&#36866;&#24212;&#23398;&#20064;&#19982;&#21487;&#35299;&#37322;&#24615;&#65306;&#22825;&#28982;&#27668;&#20132;&#26131;&#30340;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Domain-adapted Learning and Interpretability: DRL for Gas Trading. (arXiv:2301.08359v2 [q-fin.TR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.08359
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#23454;&#38469;&#30340;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#22312;&#22825;&#28982;&#27668;&#26399;&#36135;&#21512;&#32422;&#20132;&#26131;&#20013;&#30340;&#24212;&#29992;&#65292;&#25552;&#39640;&#20102;&#20132;&#26131;&#24615;&#33021;&#24182;&#38477;&#20302;&#20102;&#20132;&#26131;&#25104;&#26412;&#12290;&#21516;&#26102;&#65292;&#36890;&#36807;&#25552;&#20986;&#30340;&#38598;&#25104;&#23398;&#20064;&#26041;&#26696;&#65292;&#25552;&#39640;&#20102;&#27169;&#22411;&#31283;&#23450;&#24615;&#21644;&#40065;&#26834;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#65288;Deep RL&#65289;&#24050;&#32463;&#22312;&#37329;&#34701;&#21644;&#32929;&#31080;&#20132;&#26131;&#31561;&#24456;&#22810;&#24212;&#29992;&#20013;&#24471;&#21040;&#20102;&#25506;&#32034;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#23454;&#38469;&#30340;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#22312;&#22825;&#28982;&#27668;&#26399;&#36135;&#21512;&#32422;&#20132;&#26131;&#20013;&#30340;&#24212;&#29992;&#12290;&#25152;&#24471;&#21040;&#30340;&#22799;&#26222;&#27604;&#29575;&#36229;&#36807;&#20102;&#36235;&#21183;&#36319;&#36394;&#21644;&#22343;&#20540;&#22238;&#24402;&#31574;&#30053;&#25552;&#20379;&#30340;&#22522;&#20934;&#21450;&#25991;&#29486;&#20013;&#30340;&#32467;&#26524;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#31616;&#21333;&#32780;&#26377;&#25928;&#30340;&#38598;&#25104;&#23398;&#20064;&#26041;&#26696;&#65292;&#36890;&#36807;&#25552;&#39640;&#27169;&#22411;&#30340;&#31283;&#23450;&#24615;&#21644;&#40065;&#26834;&#24615;&#20197;&#21450;&#38477;&#20302;&#25442;&#25163;&#29575;&#21644;&#20132;&#26131;&#25104;&#26412;&#26469;&#26174;&#33879;&#25552;&#39640;&#24615;&#33021;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102; resulting Deep RL &#31574;&#30053;&#30340;&#27169;&#22411;&#21487;&#35299;&#37322;&#24615;&#12289;&#20132;&#26131;&#39057;&#29575;&#21644;&#39118;&#38505;&#24230;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
Deep Reinforcement Learning (Deep RL) has been explored for a number of applications in finance and stock trading. In this paper, we present a practical implementation of Deep RL for trading natural gas futures contracts. The Sharpe Ratio obtained exceeds benchmarks given by trend following and mean reversion strategies as well as results reported in literature. Moreover, we propose a simple but effective ensemble learning scheme for trading, which significantly improves performance through enhanced model stability and robustness as well as lower turnover and hence lower transaction cost. We discuss the resulting Deep RL strategy in terms of model explainability, trading frequency and risk measures.
&lt;/p&gt;</description></item></channel></rss>