<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#33487;&#26684;&#20848;&#30340;&#20004;&#20010;&#22810;&#36873;&#20030;&#24182;&#25214;&#21040;&#20102;&#21333;&#35843;&#24615;&#24726;&#35770;&#65292;&#26080;&#20154;&#20986;&#24109;&#21644;&#22996;&#21592;&#20250;&#22823;&#23567;&#24726;&#35770;&#31561;&#24322;&#24120;&#29616;&#35937;&#12290;</title><link>http://arxiv.org/abs/2305.20078</link><description>&lt;p&gt;
&#33487;&#26684;&#20848;&#20004;&#20010;&#22810;&#32988;&#36873;&#20030;&#20013;&#30340;&#24726;&#35770;&#22855;&#24322;&#24615;
&lt;/p&gt;
&lt;p&gt;
Paradoxical Oddities in Two Multiwinner Elections from Scotland. (arXiv:2305.20078v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.20078
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#33487;&#26684;&#20848;&#30340;&#20004;&#20010;&#22810;&#36873;&#20030;&#24182;&#25214;&#21040;&#20102;&#21333;&#35843;&#24615;&#24726;&#35770;&#65292;&#26080;&#20154;&#20986;&#24109;&#21644;&#22996;&#21592;&#20250;&#22823;&#23567;&#24726;&#35770;&#31561;&#24322;&#24120;&#29616;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20197;&#25490;&#21517;&#25237;&#31080;&#26041;&#24335;&#20026;&#22522;&#30784;&#30340;&#36873;&#20030;&#20013;&#65292;&#21333;&#35843;&#24615;&#24726;&#35770;&#31561;&#24322;&#24120;&#29616;&#35937;&#32463;&#36807;&#21019;&#24314;&#20551;&#35774;&#24615;&#31034;&#20363;&#24182;&#22312;&#22810;&#31181;&#36873;&#27665;&#34892;&#20026;&#27169;&#22411;&#19979;&#29983;&#25104;&#36873;&#20030;&#24050;&#24471;&#21040;&#24191;&#27867;&#30740;&#31350;&#12290;&#20294;&#26159;&#65292;&#22312;&#30495;&#23454;&#19990;&#30028;&#20013;&#24456;&#23569;&#21457;&#29616;&#24182;&#20998;&#26512;&#21040;&#36825;&#26679;&#30340;&#25237;&#31080;&#24726;&#35770;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#33487;&#26684;&#20848;&#30340;&#20004;&#20010;&#21333;&#35760;&#21517;&#36873;&#31080;&#36873;&#20030;&#65292;&#36825;&#20123;&#36873;&#20030;&#23637;&#31034;&#20102;&#21333;&#35843;&#24615;, &#26080;&#20154;&#20986;&#24109;&#21644;&#22996;&#21592;&#20250;&#22823;&#23567;&#30340;&#24726;&#35770;&#12290;&#36825;&#20123;&#24726;&#35770;&#22312;&#30495;&#23454;&#19990;&#30028;&#36873;&#20030;&#20013;&#24456;&#23569;&#34987;&#35266;&#23519;&#21040;&#65292;&#36825;&#31687;&#25991;&#31456;&#26159;&#20851;&#20110;&#22810;&#32988;&#36873;&#20030;&#20013;&#27492;&#31867;&#24726;&#35770;&#30340;&#31532;&#19968;&#20010;&#26696;&#20363;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Ranked-choice voting anomalies such as monotonicity paradoxes have been extensively studied through creating hypothetical examples and generating elections under various models of voter behavior. However, very few real-world examples of such voting paradoxes have been found and analyzed. We investigate two single-transferable vote elections from Scotland that demonstrate upward monotonicity, downward monotonicity, no-show, and committee size paradoxes. These paradoxes are rarely observed in real-world elections, and this article is the first case study of such paradoxes in multiwinner elections.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;VaR&#39044;&#27979;&#20013;&#26465;&#20214;&#20998;&#20301;&#25968;&#21160;&#24577;&#27169;&#22411;&#30340;&#24314;&#31435;&#19982;&#35780;&#20272;&#65292;&#36890;&#36807;&#20223;&#30495;&#35780;&#20272;&#23545;&#31216;&#24179;&#22343;&#32477;&#23545;&#20559;&#24046;&#20316;&#20026;&#25439;&#22833;&#20989;&#25968;&#65292;&#20197;&#25490;&#21517;&#39044;&#27979;&#34920;&#29616;&#30340;&#20248;&#21155;&#12290;&#23454;&#35777;&#24212;&#29992;&#20013;&#65292;&#37319;&#29992;&#31227;&#21160;&#39044;&#27979;&#31383;&#21475;&#65292;&#22312;&#20445;&#25345;&#39044;&#27979;&#30340;&#20998;&#20301;&#25968;&#19981;&#21464;&#30340;&#24773;&#20917;&#19979;&#65292;&#20197;&#26174;&#30528;&#25552;&#39640;&#26465;&#20214;&#20998;&#20301;&#25968;&#30340;&#39044;&#27979;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2305.20067</link><description>&lt;p&gt;
VaR&#39044;&#27979;&#20013;&#26465;&#20214;&#20998;&#20301;&#25968;&#21160;&#24577;&#27169;&#22411;&#30340;&#24314;&#31435;&#19982;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
Modeling and evaluating conditional quantile dynamics in VaR forecasts. (arXiv:2305.20067v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.20067
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;VaR&#39044;&#27979;&#20013;&#26465;&#20214;&#20998;&#20301;&#25968;&#21160;&#24577;&#27169;&#22411;&#30340;&#24314;&#31435;&#19982;&#35780;&#20272;&#65292;&#36890;&#36807;&#20223;&#30495;&#35780;&#20272;&#23545;&#31216;&#24179;&#22343;&#32477;&#23545;&#20559;&#24046;&#20316;&#20026;&#25439;&#22833;&#20989;&#25968;&#65292;&#20197;&#25490;&#21517;&#39044;&#27979;&#34920;&#29616;&#30340;&#20248;&#21155;&#12290;&#23454;&#35777;&#24212;&#29992;&#20013;&#65292;&#37319;&#29992;&#31227;&#21160;&#39044;&#27979;&#31383;&#21475;&#65292;&#22312;&#20445;&#25345;&#39044;&#27979;&#30340;&#20998;&#20301;&#25968;&#19981;&#21464;&#30340;&#24773;&#20917;&#19979;&#65292;&#20197;&#26174;&#30528;&#25552;&#39640;&#26465;&#20214;&#20998;&#20301;&#25968;&#30340;&#39044;&#27979;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#19987;&#27880;&#20110;&#23545;&#20110;&#32473;&#23450;&#32622;&#20449;&#27700;&#24179; &#964;&#65292;VaR&#30340;&#26102;&#21464;&#24314;&#27169;&#65292;&#35780;&#20215;&#26631;&#20934;&#26159;&#30001;&#26465;&#20214;&#22343;&#20540;&#21644;&#26631;&#20934;&#24046;&#26631;&#20934;&#21270;&#30340;&#25910;&#30410;&#29575;&#20998;&#24067;&#30340;&#20998;&#20301;&#25968;&#26159;&#21542;&#34920;&#29616;&#20986;&#21487;&#39044;&#27979;&#30340;&#21160;&#24577;&#29305;&#24449;&#12290;&#27169;&#22411;&#36890;&#36807;&#20223;&#30495;&#36827;&#34892;&#35780;&#20272;&#65292;&#36890;&#36807;&#35780;&#20272;&#23545;&#31216;&#24179;&#22343;&#32477;&#23545;&#20559;&#24046;&#20316;&#20026;&#25439;&#22833;&#20989;&#25968;&#65292;&#20197;&#25490;&#21517;&#39044;&#27979;&#34920;&#29616;&#30340;&#20248;&#21155;&#12290;&#22312; Fama-French 25 &#31561;&#26435;&#37325;&#32452;&#21512;&#30340;&#23454;&#35777;&#24212;&#29992;&#20013;&#65292;&#37319;&#29992;&#31227;&#21160;&#39044;&#27979;&#31383;&#21475;&#65292;&#22312;&#20445;&#25345;&#39044;&#27979;&#30340;&#20998;&#20301;&#25968;&#19981;&#21464;&#30340;&#24773;&#20917;&#19979;&#65292;&#38500;&#38750;&#36829;&#35268;&#30340;&#32463;&#39564;&#39057;&#29575;&#33853;&#22312;&#19968;&#20010;&#25968;&#25454;&#39537;&#21160;&#30340;&#964;&#21608;&#22260;&#30340;&#21306;&#38388;&#20043;&#22806;&#65292;&#20197;&#26174;&#30528;&#25552;&#39640;&#26465;&#20214;&#20998;&#20301;&#25968;&#30340;&#39044;&#27979;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
We focus on the time-varying modeling of VaR at a given coverage $\tau$, assessing whether the quantiles of the distribution of the returns standardized by their conditional means and standard deviations exhibit predictable dynamics. Models are evaluated via simulation, determining the merits of the asymmetric Mean Absolute Deviation as a loss function to rank forecast performances. The empirical application on the Fama-French 25 value-weighted portfolios with a moving forecast window shows substantial improvements in forecasting conditional quantiles by keeping the predicted quantile unchanged unless the empirical frequency of violations falls outside a data-driven interval around $\tau$.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#37327;&#23376;&#21462;&#26679;&#30340;&#24037;&#20316;&#37327;&#35777;&#26126;&#20849;&#35782;&#26426;&#21046;(CGBS-PoW)&#65292;&#37319;&#29992;Fock&#24577;&#21644;&#39640;&#26031;&#27874;&#33394;&#23376;&#21462;&#26679;&#65292;&#20855;&#26377;&#24040;&#22823;&#30340;&#21152;&#36895;&#21644;&#33410;&#33021;&#25928;&#30410;&#12290;</title><link>http://arxiv.org/abs/2305.19865</link><description>&lt;p&gt;
&#37327;&#23376;&#21462;&#26679;&#30340;&#24037;&#20316;&#37327;&#35777;&#26126;&#20849;&#35782;&#26426;&#21046;
&lt;/p&gt;
&lt;p&gt;
Proof-of-work consensus by quantum sampling. (arXiv:2305.19865v1 [quant-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.19865
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#37327;&#23376;&#21462;&#26679;&#30340;&#24037;&#20316;&#37327;&#35777;&#26126;&#20849;&#35782;&#26426;&#21046;(CGBS-PoW)&#65292;&#37319;&#29992;Fock&#24577;&#21644;&#39640;&#26031;&#27874;&#33394;&#23376;&#21462;&#26679;&#65292;&#20855;&#26377;&#24040;&#22823;&#30340;&#21152;&#36895;&#21644;&#33410;&#33021;&#25928;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#20854;2011&#24180;&#20986;&#29616;&#20197;&#26469;&#65292;&#27874;&#33394;&#23376;&#21462;&#26679;&#22240;&#20854;&#30456;&#23545;&#20110;&#20854;&#20182;&#37327;&#23376;&#31639;&#27861;&#30340;&#31616;&#21333;&#24615;&#21644;&#36817;&#26399;&#35201;&#27714;&#32780;&#25104;&#20026;&#23637;&#31034;&#37327;&#23376;&#20248;&#21183;&#30340;&#20248;&#36873;&#20505;&#36873;&#12290;&#26412;&#25991;&#25552;&#20986;&#23558;&#19968;&#31181;&#21464;&#31181;&#8212;&#8212;&#31895;&#31890;&#24230;&#27874;&#33394;&#23376;&#21462;&#26679;(CGBS)&#8212;&#8212;&#20316;&#20026;&#21306;&#22359;&#38142;&#20849;&#35782;&#30340;&#37327;&#23376;&#24037;&#20316;&#37327;&#35777;&#26126;(PoW)&#26426;&#21046;&#12290;&#29992;&#25143;&#20351;&#29992;&#20381;&#36182;&#20110;&#24403;&#21069;&#22359;&#20449;&#24687;&#30340;&#36755;&#20837;&#29366;&#24577;&#36827;&#34892;&#27874;&#33394;&#23376;&#21462;&#26679;&#65292;&#24182;&#23558;&#20854;&#25552;&#20132;&#21040;&#32593;&#32476;&#20013;&#12290;&#28982;&#21518;&#30830;&#23450;&#21487;&#29992;&#20110;&#39564;&#35777;&#26679;&#26412;&#21644;&#22870;&#21169;&#25104;&#21151;&#30719;&#24037;&#30340;CGBS&#31574;&#30053;&#12290;&#36890;&#36807;&#23558;&#21521;&#25552;&#20132;&#35802;&#23454;&#26679;&#26412;&#30340;&#30719;&#24037;&#25552;&#20379;&#22870;&#21169;&#24182;&#23545;&#25552;&#20132;&#19981;&#35802;&#23454;&#26679;&#26412;&#30340;&#30719;&#24037;&#36827;&#34892;&#24809;&#32602;&#30340;&#32452;&#21512;&#65292;&#25214;&#21040;&#20102;&#19968;&#20010;&#28608;&#21169;&#35802;&#23454;&#33410;&#28857;&#30340;&#32435;&#20160;&#22343;&#34913;&#12290;&#35813;&#26041;&#26696;&#36866;&#29992;&#20110;Fock&#24577;&#27874;&#33394;&#23376;&#21462;&#26679;&#21644;&#39640;&#26031;&#27874;&#33394;&#23376;&#21462;&#26679;&#65292;&#24182;&#30456;&#23545;&#20110;&#20351;&#29992;&#32463;&#20856;&#30828;&#20214;&#36827;&#34892;&#35745;&#31639;&#25552;&#20379;&#20102;&#24040;&#22823;&#30340;&#21152;&#36895;&#21644;&#33410;&#33021;&#25928;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;
Since its advent in 2011, boson-sampling has been a preferred candidate for demonstrating quantum advantage because of its simplicity and near-term requirements compared to other quantum algorithms. We propose to use a variant, called coarse-grained boson-sampling (CGBS), as a quantum Proof-of-Work (PoW) scheme for blockchain consensus. The users perform boson-sampling using input states that depend on the current block information, and commit their samples to the network. Afterward, CGBS strategies are determined which can be used to both validate samples and to reward successful miners. By combining rewards to miners committing honest samples together with penalties to miners committing dishonest samples, a Nash equilibrium is found that incentivizes honest nodes. The scheme works for both Fock state boson sampling and Gaussian boson sampling and provides dramatic speedup and energy savings relative to computation by classical hardware.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#39046;&#22495;&#36866;&#24212;&#26041;&#27861;&#65292;&#21487;&#20197;&#20998;&#21035;&#34913;&#37327;&#20869;&#37096;&#30456;&#20851;&#32467;&#26500;&#30340;&#24046;&#24322;&#21644;&#36793;&#32536;&#20998;&#24067;&#30340;&#24046;&#24322;&#65292; significantly improves the transfer learning performance.</title><link>http://arxiv.org/abs/2305.19499</link><description>&lt;p&gt;
&#22522;&#20110;&#30456;&#20851;&#24615;&#27491;&#21017;&#21270;&#30340;&#36801;&#31227;&#23398;&#20064;&#65306;&#28145;&#20837;&#25506;&#31350;&#39046;&#22495;&#21464;&#25442;
&lt;/p&gt;
&lt;p&gt;
Deep into The Domain Shift: Transfer Learning through Dependence Regularization. (arXiv:2305.19499v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.19499
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#39046;&#22495;&#36866;&#24212;&#26041;&#27861;&#65292;&#21487;&#20197;&#20998;&#21035;&#34913;&#37327;&#20869;&#37096;&#30456;&#20851;&#32467;&#26500;&#30340;&#24046;&#24322;&#21644;&#36793;&#32536;&#20998;&#24067;&#30340;&#24046;&#24322;&#65292; significantly improves the transfer learning performance.
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20256;&#32479;&#30340;&#39046;&#22495;&#33258;&#36866;&#24212;&#26041;&#27861;&#36890;&#36807;&#35268;&#33539;&#21270;&#28304;&#22495;&#65288;&#26631;&#35760;&#65289;&#20013;&#30340;&#29305;&#24449;&#21644;&#30446;&#26631;&#22495;&#65288;&#26410;&#26631;&#35760;&#65289;&#20013;&#29305;&#24449;&#20043;&#38388;&#30340;&#25972;&#20307;&#20998;&#24067;&#24046;&#24322;&#26469;&#33719;&#24471;&#21487;&#36716;&#31227;&#24615;&#12290;&#28982;&#32780;&#65292;&#23427;&#20204;&#24448;&#24448;&#26080;&#27861;&#21306;&#20998;&#39046;&#22495;&#24046;&#24322;&#26159;&#26469;&#33258;&#36793;&#32536;&#20998;&#24067;&#36824;&#26159;&#30456;&#20851;&#32467;&#26500;&#12290;&#22312;&#35768;&#22810;&#19994;&#21153;&#21644;&#37329;&#34701;&#24212;&#29992;&#20013;&#65292;&#26631;&#35760;&#20989;&#25968;&#36890;&#24120;&#23545;&#19982;&#36793;&#32536;&#20998;&#24067;&#21464;&#21270;&#21644;&#30456;&#20851;&#32467;&#26500;&#21464;&#21270;&#30340;&#25935;&#24863;&#31243;&#24230;&#19981;&#21516;&#12290;&#20165;&#20165;&#27979;&#37327;&#25972;&#20307;&#20998;&#24067;&#24046;&#24322;&#22312;&#33719;&#24471;&#21487;&#36716;&#31227;&#24615;&#26041;&#38754;&#19981;&#22815;&#20855;&#26377;&#21028;&#21035;&#21147;&#12290;&#27809;&#26377;&#24517;&#35201;&#30340;&#32467;&#26500;&#20998;&#36776;&#29575;&#65292;&#23398;&#21040;&#30340;&#36716;&#31227;&#25928;&#26524;&#23601;&#20250;&#19981;&#22815;&#20248;&#21270;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#39046;&#22495;&#36866;&#24212;&#26041;&#27861;&#65292;&#21487;&#20197;&#20998;&#21035;&#34913;&#37327;&#20869;&#37096;&#30456;&#20851;&#32467;&#26500;&#30340;&#24046;&#24322;&#21644;&#36793;&#32536;&#20998;&#24067;&#30340;&#24046;&#24322;&#12290;&#36890;&#36807;&#20248;&#21270;&#23427;&#20204;&#20043;&#38388;&#30340;&#30456;&#23545;&#26435;&#37325;&#65292;&#26032;&#30340;&#35268;&#33539;&#21270;&#31574;&#30053;&#22823;&#22823;&#25918;&#26494;&#20102;&#29616;&#26377;&#26041;&#27861;&#30340;&#20005;&#26684;&#24615;&#65292;&#24182;&#26174;&#33879;&#25552;&#39640;&#20102;&#36716;&#31227;&#23398;&#20064;&#24615;&#33021;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#30456;&#20851;&#24615;&#27491;&#21017;&#21270;&#65288;DR&#65289;&#26041;&#27861;&#26694;&#26550;&#65292;&#20854;&#20013;&#21253;&#21547;&#19968;&#20010;&#26032;&#30340;&#30456;&#20851;&#24615;&#25439;&#22833;&#21644;&#19968;&#20010;&#34701;&#21512;&#21464;&#37327;&#12290;&#36825;&#31181;&#26032;&#26041;&#27861;&#19981;&#20551;&#35774;&#20219;&#20309;&#29305;&#23450;&#30340;&#20998;&#24067;&#24418;&#24335;&#65292;&#21487;&#20197;&#26377;&#25928;&#22320;&#22788;&#29702;&#39640;&#32500;&#25968;&#25454;&#65292;&#24182;&#21487;&#25193;&#23637;&#21040;&#20219;&#20309;&#29616;&#26377;&#30340;&#28145;&#24230;&#36716;&#31227;&#23398;&#20064;&#26041;&#27861;&#12290;&#22312;&#23454;&#39564;&#20013;&#65292;DR &#26041;&#27861;&#22312;&#20960;&#20010;&#22522;&#20934;&#25968;&#25454;&#38598;&#19978;&#20248;&#20110;&#29616;&#26377;&#30340;&#26368;&#20808;&#36827;&#39046;&#22495;&#36866;&#24212;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Classical Domain Adaptation methods acquire transferability by regularizing the overall distributional discrepancies between features in the source domain (labeled) and features in the target domain (unlabeled). They often do not differentiate whether the domain differences come from the marginals or the dependence structures. In many business and financial applications, the labeling function usually has different sensitivities to the changes in the marginals versus changes in the dependence structures. Measuring the overall distributional differences will not be discriminative enough in acquiring transferability. Without the needed structural resolution, the learned transfer is less optimal. This paper proposes a new domain adaptation approach in which one can measure the differences in the internal dependence structure separately from those in the marginals. By optimizing the relative weights among them, the new regularization strategy greatly relaxes the rigidness of the existing ap
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#22522;&#20110;&#22343;&#34913;&#27010;&#24565;&#30340;&#20844;&#24179;&#20998;&#37197;&#31639;&#27861;A-CEEI&#65292;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#21551;&#21457;&#24335;&#31639;&#27861;&#65292;&#20351;&#25105;&#20204;&#31532;&#19968;&#27425;&#33021;&#22815;&#23545;&#30495;&#23454;&#19990;&#30028;&#30340;&#36755;&#20837;&#36827;&#34892;&#23454;&#39564;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#21363;&#20351;&#22312;&#31526;&#21512;EF-TB&#21644;SP-L&#23646;&#24615;&#30340;&#29616;&#23454;&#23454;&#26045;&#20013;&#65292;&#20195;&#29702;&#20063;&#21487;&#33021;&#26377;&#24778;&#20154;&#32780;&#21512;&#29702;&#30340;&#19981;&#30495;&#23454;&#25253;&#21578;&#20559;&#31163;&#12290;</title><link>http://arxiv.org/abs/2305.11406</link><description>&lt;p&gt;
&#22522;&#20110;&#22343;&#34913;&#27010;&#24565;&#30340;&#20844;&#24179;&#20998;&#37197;&#30340;&#23454;&#29992;&#31639;&#27861;&#21644;&#23454;&#39564;&#35777;&#26126;&#65288;A-CEEI&#65289;
&lt;/p&gt;
&lt;p&gt;
Practical algorithms and experimentally validated incentives for equilibrium-based fair division (A-CEEI). (arXiv:2305.11406v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.11406
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#22522;&#20110;&#22343;&#34913;&#27010;&#24565;&#30340;&#20844;&#24179;&#20998;&#37197;&#31639;&#27861;A-CEEI&#65292;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#21551;&#21457;&#24335;&#31639;&#27861;&#65292;&#20351;&#25105;&#20204;&#31532;&#19968;&#27425;&#33021;&#22815;&#23545;&#30495;&#23454;&#19990;&#30028;&#30340;&#36755;&#20837;&#36827;&#34892;&#23454;&#39564;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#21363;&#20351;&#22312;&#31526;&#21512;EF-TB&#21644;SP-L&#23646;&#24615;&#30340;&#29616;&#23454;&#23454;&#26045;&#20013;&#65292;&#20195;&#29702;&#20063;&#21487;&#33021;&#26377;&#24778;&#20154;&#32780;&#21512;&#29702;&#30340;&#19981;&#30495;&#23454;&#25253;&#21578;&#20559;&#31163;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#8220;&#31561;&#25910;&#20837;&#36817;&#20284;&#31454;&#20105;&#22343;&#34913;&#8221;&#65288;A-CEEI&#65289;&#26159;&#19968;&#31181;&#22522;&#20110;&#22343;&#34913;&#27010;&#24565;&#29992;&#20110;&#23558;&#31163;&#25955;&#29289;&#21697;&#20844;&#24179;&#20998;&#37197;&#32473;&#24102;&#26377;&#32452;&#21512;&#38656;&#27714;&#30340;&#20195;&#29702;&#30340;&#35299;&#20915;&#26041;&#26696;&#27010;&#24565;&#12290;&#22312;&#29702;&#35770;&#19978;&#24050;&#32463;&#30693;&#36947;&#65292;&#22312;&#28176;&#36817;&#22823;&#24066;&#22330;&#19978;&#65292;&#23545;&#20110;&#28608;&#21169;&#25514;&#26045;&#65292;A-CEEI&#26426;&#21046;&#26159;&#8220;&#26080;&#23241;&#22930;&#21487;&#20294;&#39035;&#30772;&#22351;&#24179;&#25163;&#8221;&#30340;&#65288;EF-TB&#65289;&#65292;&#36825;&#24847;&#21619;&#30528;&#23427;&#26159;&#8220;&#22823;&#33539;&#22260;&#19978;&#30340;&#31574;&#30053;&#35777;&#26126;&#8221;&#65288;SP-L&#65289;&#12290;&#20174;&#35745;&#31639;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#35745;&#31639;&#22343;&#34913;&#35299;&#26159;&#19968;&#31181;&#35745;&#31639;&#19978;&#19981;&#21487;&#34892;&#30340;&#38382;&#39064;&#65288;&#22312;&#26368;&#22351;&#30340;&#24773;&#20917;&#19979;&#65292;&#20551;&#35774; $\textsf{PPAD} \neq \textsf {FP}$&#65289;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#21551;&#21457;&#24335;&#31639;&#27861;&#65292;&#20854;&#24615;&#33021;&#27604;&#20043;&#21069;&#30340;&#26368;&#20808;&#36827;&#31639;&#27861;&#39640;&#20986;&#22810;&#20010;&#25968;&#37327;&#32423;&#12290;&#36825;&#31181;&#26356;&#24555;&#30340;&#26032;&#31639;&#27861;&#20351;&#25105;&#20204;&#31532;&#19968;&#27425;&#33021;&#22815;&#23545;&#30495;&#23454;&#19990;&#30028;&#30340;&#36755;&#20837;&#36827;&#34892;&#23454;&#39564;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#21363;&#20351;&#22312;&#31526;&#21512;EF-TB&#21644;SP-L&#23646;&#24615;&#30340;&#29616;&#23454;&#23454;&#26045;&#20013;&#65292;&#20195;&#29702;&#20063;&#21487;&#33021;&#26377;&#24778;&#20154;&#32780;&#21512;&#29702;&#30340;&#19981;&#30495;&#23454;&#25253;&#21578;&#20559;&#31163;&#12290;
&lt;/p&gt;
&lt;p&gt;
Approximate Competitive Equilibrium from Equal Incomes (A-CEEI) is an equilibrium-based solution concept for fair division of discrete items to agents with combinatorial demands. In theory, it is known that in asymptotically large markets:  1. For incentives, the A-CEEI mechanism is Envy-Free-but-for-Tie-Breaking (EF-TB), which implies that it is Strategyproof-in-the-Large (SP-L).  2. From a computational perspective, computing the equilibrium solution is unfortunately a computationally intractable problem (in the worst-case, assuming $\textsf{PPAD}\ne \textsf{FP}$).  We develop a new heuristic algorithm that outperforms the previous state-of-the-art by multiple orders of magnitude. This new, faster algorithm lets us perform experiments on real-world inputs for the first time. We discover that with real-world preferences, even in a realistic implementation that satisfies the EF-TB and SP-L properties, agents may have surprisingly simple and plausible deviations from truthful reporting 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21160;&#24577;&#25096;&#30331;&#22686;&#38271;&#27169;&#22411;&#30340;&#23545;&#25968;&#31169;&#20154;&#20844;&#21496;&#20272;&#20540;&#27169;&#22411;&#65292;&#20854;&#20013;&#21253;&#21547;&#38381;&#21512;&#24335;&#26399;&#26435;&#23450;&#20215;&#20844;&#24335;&#12289;&#23545;&#20914;&#20844;&#24335;&#20197;&#21450;&#26435;&#30410;&#36830;&#25509;&#23551;&#38505;&#20135;&#21697;&#30340;&#20928;&#20445;&#36153;&#20844;&#24335;&#12290;&#35813;&#27169;&#22411;&#21487;&#29992;&#20110;&#31169;&#20154;&#20844;&#21496;&#21644;&#20844;&#20849;&#20844;&#21496;&#12290;</title><link>http://arxiv.org/abs/2206.09666</link><description>&lt;p&gt;
&#23545;&#25968;&#31169;&#20154;&#20844;&#21496;&#20272;&#20540;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
The Log Private Company Valuation Model. (arXiv:2206.09666v3 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.09666
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21160;&#24577;&#25096;&#30331;&#22686;&#38271;&#27169;&#22411;&#30340;&#23545;&#25968;&#31169;&#20154;&#20844;&#21496;&#20272;&#20540;&#27169;&#22411;&#65292;&#20854;&#20013;&#21253;&#21547;&#38381;&#21512;&#24335;&#26399;&#26435;&#23450;&#20215;&#20844;&#24335;&#12289;&#23545;&#20914;&#20844;&#24335;&#20197;&#21450;&#26435;&#30410;&#36830;&#25509;&#23551;&#38505;&#20135;&#21697;&#30340;&#20928;&#20445;&#36153;&#20844;&#24335;&#12290;&#35813;&#27169;&#22411;&#21487;&#29992;&#20110;&#31169;&#20154;&#20844;&#21496;&#21644;&#20844;&#20849;&#20844;&#21496;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38024;&#23545;&#31169;&#20154;&#20844;&#21496;&#30001;&#20110;&#20215;&#26684;&#19981;&#21487;&#35266;&#27979;&#32780;&#23548;&#33268;&#26399;&#26435;&#12289;&#23551;&#38505;&#23450;&#20215;&#20197;&#21450;&#23545;&#20914;&#31561;&#20219;&#21153;&#20855;&#26377;&#25361;&#25112;&#24615;&#65292;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#21160;&#24577;&#25096;&#30331;&#22686;&#38271;&#27169;&#22411;&#30340;&#23545;&#25968;&#31169;&#20154;&#20844;&#21496;&#20272;&#20540;&#27169;&#22411;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#38024;&#23545;&#31169;&#20154;&#20844;&#21496;&#30340;&#38381;&#21512;&#24335;&#26399;&#26435;&#23450;&#20215;&#20844;&#24335;&#12289;&#23545;&#20914;&#20844;&#24335;&#20197;&#21450;&#26435;&#30410;&#36830;&#25509;&#23551;&#38505;&#20135;&#21697;&#30340;&#20928;&#20445;&#36153;&#20844;&#24335;&#12290;&#27492;&#22806;&#65292;&#26412;&#25991;&#25552;&#20379;&#20102;&#25105;&#20204;&#27169;&#22411;&#30340;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#22120;&#12289;&#26399;&#26395;&#26497;&#22823;&#21270;&#31639;&#27861;&#21644;&#31169;&#20154;&#20844;&#21496;&#20272;&#20540;&#20844;&#24335;&#12290;&#35813;&#27169;&#22411;&#26082;&#21487;&#29992;&#20110;&#31169;&#20154;&#20844;&#21496;&#65292;&#20063;&#21487;&#29992;&#20110;&#20844;&#20849;&#20844;&#21496;&#12290;
&lt;/p&gt;
&lt;p&gt;
For a public company, the option pricing models, hedging models, and pricing and hedging models of equity--linked life insurance products have been developed. However, for a private company, because of unobserved prices, the option and the life insurance pricing, and the hedging are challenging tasks. For this reason, this paper introduces a log private company valuation model, which is based on the dynamic Gordon growth model. In this paper, we obtain closed-form option pricing formulas, hedging formulas, and net premium formulas of equity-linked life insurance products for a private company. Also, the paper provides ML estimators of our model, EM algorithm, and valuation formula for the private company. The suggested model can be used not only by private companies but also by public companies
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36125;&#21494;&#26031;MS-VAR&#27169;&#22411;&#30340;&#24425;&#34425;&#26399;&#26435;&#21644;&#22238;&#39038;&#26399;&#26435;&#30340;&#23450;&#20215;&#21644;&#23545;&#20914;&#26041;&#27861;&#65292;&#35813;&#27169;&#22411;&#31616;&#21333;&#19988;&#20381;&#36182;&#20110;&#32463;&#27982;&#21464;&#37327;&#12290;</title><link>http://arxiv.org/abs/2112.10447</link><description>&lt;p&gt;
&#22522;&#20110;&#36125;&#21494;&#26031;MS-VAR&#36807;&#31243;&#30340;&#24425;&#34425;&#26399;&#26435;
&lt;/p&gt;
&lt;p&gt;
Rainbow Options under Bayesian MS-VAR Process. (arXiv:2112.10447v3 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2112.10447
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36125;&#21494;&#26031;MS-VAR&#27169;&#22411;&#30340;&#24425;&#34425;&#26399;&#26435;&#21644;&#22238;&#39038;&#26399;&#26435;&#30340;&#23450;&#20215;&#21644;&#23545;&#20914;&#26041;&#27861;&#65292;&#35813;&#27169;&#22411;&#31616;&#21333;&#19988;&#20381;&#36182;&#20110;&#32463;&#27982;&#21464;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;&#36125;&#21494;&#26031;&#39532;&#23572;&#21487;&#22827;&#29366;&#24577;&#36716;&#25442;&#21521;&#37327;&#33258;&#22238;&#24402;&#65288;MS-VAR&#65289; &#36807;&#31243;&#30340;&#24425;&#34425;&#26399;&#26435;&#21644;&#22238;&#39038;&#26399;&#26435;&#30340;&#23450;&#20215;&#21644;&#23545;&#20914;&#26041;&#27861;&#12290;&#25105;&#20204;&#20551;&#35774;&#19968;&#20010;&#29366;&#24577;&#36716;&#25442;&#36807;&#31243;&#30001;&#21516;&#36136;&#39532;&#23572;&#31185;&#22827;&#36807;&#31243;&#20135;&#29983;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#30340;&#20248;&#28857;&#26159;&#20381;&#36182;&#20110;&#32463;&#27982;&#21464;&#37327;&#19988;&#30456;&#23545;&#20110;&#20197;&#21069;&#30340;&#35770;&#25991;&#26356;&#20026;&#31616;&#21333;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents pricing and hedging methods for rainbow options and lookback options under Bayesian Markov-Switching Vector Autoregressive (MS--VAR) process. Here we assumed that a regime-switching process is generated by a homogeneous Markov process. An advantage of our model is it depends on economic variables and simple as compared with previous existing papers.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#36125;&#21494;&#26031;MS-VAR&#36807;&#31243;&#30340;&#26399;&#26435;&#23450;&#20215;&#26041;&#27861;&#65292;&#30456;&#36739;&#20110;&#20808;&#21069;&#20381;&#36182;&#20110;&#20999;&#25442;&#36807;&#31243;&#30340;&#26399;&#26435;&#23450;&#20215;&#26041;&#27861;&#32780;&#35328;&#26356;&#21152;&#26041;&#20415;&#26131;&#29992;&#12290;</title><link>http://arxiv.org/abs/2109.05998</link><description>&lt;p&gt;
&#22522;&#20110;&#36125;&#21494;&#26031;MS-VAR&#36807;&#31243;&#30340;&#26399;&#26435;&#23450;&#20215;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Options Pricing under Bayesian MS-VAR Process. (arXiv:2109.05998v3 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2109.05998
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#36125;&#21494;&#26031;MS-VAR&#36807;&#31243;&#30340;&#26399;&#26435;&#23450;&#20215;&#26041;&#27861;&#65292;&#30456;&#36739;&#20110;&#20808;&#21069;&#20381;&#36182;&#20110;&#20999;&#25442;&#36807;&#31243;&#30340;&#26399;&#26435;&#23450;&#20215;&#26041;&#27861;&#32780;&#35328;&#26356;&#21152;&#26041;&#20415;&#26131;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#39118;&#38505;&#20013;&#24615;&#20272;&#20540;&#26041;&#27861;&#65292;&#22522;&#20110;&#36125;&#21494;&#26031;&#39532;&#23572;&#21487;&#22827;-&#36716;&#25442;&#21521;&#37327;&#33258;&#22238;&#24402;(MS-BVAR)&#36807;&#31243;&#30340;&#26399;&#26435;&#23450;&#20215;&#26041;&#27861;&#12290;&#36125;&#21494;&#26031;MS-VAR&#36807;&#31243;&#30340;&#19968;&#31181;&#29305;&#20363;&#26159;&#20026;&#32463;&#27982;&#21464;&#37327;&#20043;&#38388;&#30340;&#30456;&#20114;&#20381;&#36182;&#21644;&#32463;&#27982;&#21464;&#37327;&#39044;&#27979;&#32780;&#24191;&#27867;&#20351;&#29992;&#30340;BVAR&#36807;&#31243;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20551;&#35774;&#20999;&#25442;&#36807;&#31243;&#30001;&#22343;&#21248;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#21644;&#27531;&#24046;&#36807;&#31243;&#36981;&#24490;&#19968;&#20010;&#26465;&#20214;&#24322;&#26041;&#24046;&#27169;&#22411;&#32780;&#20135;&#29983;&#12290;&#36890;&#36807;&#30452;&#25509;&#35745;&#31639;&#21644;&#27010;&#29575;&#27979;&#24230;&#30340;&#21464;&#25442;&#65292;&#23545;&#20110;&#26576;&#20123;&#24120;&#29992;&#26399;&#26435;&#65292;&#25105;&#20204;&#23548;&#20986;&#20102;&#20215;&#26684;&#20844;&#24335;&#12290;&#25105;&#20204;&#27169;&#22411;&#30340;&#20248;&#28857;&#22312;&#20110;&#20854;&#20381;&#36182;&#20110;&#32463;&#27982;&#21464;&#37327;&#19988;&#26131;&#20110;&#20351;&#29992;&#65292;&#30456;&#36739;&#20110;&#20808;&#21069;&#20381;&#36182;&#20110;&#20999;&#25442;&#36807;&#31243;&#30340;&#26399;&#26435;&#23450;&#20215;&#35770;&#25991;&#32780;&#35328;&#26356;&#21152;&#26041;&#20415;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we have studied option pricing methods that are based on a Bayesian Markov-Switching Vector Autoregressive (MS--BVAR) process using a risk-neutral valuation approach. A BVAR process, which is a special case of the Bayesian MS--VAR process is widely used to model interdependencies of economic variables and forecast economic variables. Here we assumed that a regime-switching process is generated by a homogeneous Markov process and a residual process follows a conditional heteroscedastic model. With a direct calculation and change of probability measure, for some frequently used options, we derived pricing formulas. An advantage of our model is it depends on economic variables and is easy to use compared to previous option pricing papers, which depend on regime-switching.
&lt;/p&gt;</description></item><item><title>&#36825;&#20010;&#35770;&#25991;&#25193;&#23637;&#20102;&#20256;&#32479;&#30340;&#20256;&#26579;&#27169;&#22411;&#65292;&#20801;&#35768;&#19968;&#20010;&#36829;&#32422;&#31995;&#32479;&#23545;&#20854;&#29615;&#22659;&#20135;&#29983;&#20256;&#26579;&#24615;&#24433;&#21709;&#65292;&#35813;&#27169;&#22411;&#30340;&#21019;&#26032;&#22312;&#20110;&#20538;&#21153;&#20154;&#30340;&#36829;&#32422;&#23545;&#26356;&#20840;&#29699;&#32463;&#27982;&#20855;&#26377;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/1709.09255</link><description>&lt;p&gt;
&#24102;&#28322;&#20986;&#20256;&#26579;&#30340;&#36829;&#32422;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
A default system with overspilling contagion. (arXiv:1709.09255v3 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1709.09255
&lt;/p&gt;
&lt;p&gt;
&#36825;&#20010;&#35770;&#25991;&#25193;&#23637;&#20102;&#20256;&#32479;&#30340;&#20256;&#26579;&#27169;&#22411;&#65292;&#20801;&#35768;&#19968;&#20010;&#36829;&#32422;&#31995;&#32479;&#23545;&#20854;&#29615;&#22659;&#20135;&#29983;&#20256;&#26579;&#24615;&#24433;&#21709;&#65292;&#35813;&#27169;&#22411;&#30340;&#21019;&#26032;&#22312;&#20110;&#20538;&#21153;&#20154;&#30340;&#36829;&#32422;&#23545;&#26356;&#20840;&#29699;&#32463;&#27982;&#20855;&#26377;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20256;&#32479;&#30340;&#20256;&#26579;&#27169;&#22411;&#20013;&#65292;&#36829;&#32422;&#31995;&#32479;&#22312;&#35266;&#27979;&#20854;&#38543;&#26426;&#29615;&#22659;&#26465;&#20214;&#19979;&#26159;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#65292;&#20855;&#26377;&#30456;&#20114;&#20316;&#29992;&#30340;&#24378;&#24230;&#12290;&#36825;&#35201;&#27714;&#29615;&#22659;&#33258;&#20027;&#28436;&#21270;&#65292;&#24182;&#19988;&#19981;&#21463;&#21382;&#21490;&#36829;&#32422;&#20107;&#20214;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#25193;&#23637;&#20102;&#20256;&#32479;&#25991;&#29486;&#65292;&#24182;&#20801;&#35768;&#36829;&#32422;&#31995;&#32479;&#23545;&#20854;&#29615;&#22659;&#20135;&#29983;&#20256;&#26579;&#24615;&#24433;&#21709;&#12290;&#22312;&#25105;&#20204;&#30340;&#26694;&#26550;&#20013;&#65292;&#20256;&#26579;&#24615;&#21487;&#20197;&#34987;&#21253;&#21547;&#22312;&#36829;&#32422;&#31995;&#32479;&#20869;&#65288;&#21363;&#65292;&#20174;&#19968;&#23545;&#25163;&#21040;&#21478;&#19968;&#23545;&#25163;&#30340;&#30452;&#25509;&#20256;&#26579;&#65289;&#65292;&#20063;&#21487;&#20197;&#20174;&#36829;&#32422;&#31995;&#32479;&#28322;&#20986;&#21040;&#20854;&#29615;&#22659;&#20013;&#65288;&#38388;&#25509;&#20256;&#26579;&#65289;&#12290;&#27599;&#24403;&#38656;&#35201;&#22312;&#19968;&#20010;&#27169;&#22411;&#20013;&#25429;&#25417;&#26576;&#19968;&#31867;&#20538;&#21153;&#20154;&#30340;&#36829;&#32422;&#23545;&#26356;&#20840;&#29699;&#32463;&#27982;&#21450;&#20854;&#21453;&#21521;&#21487;&#33021;&#20135;&#29983;&#24433;&#21709;&#26102;&#65292;&#36825;&#31181;&#27169;&#22411;&#23601;&#20855;&#26377;&#20852;&#36259;&#12290;
&lt;/p&gt;
&lt;p&gt;
In classical contagion models, default systems are Markovian conditionally on the observation of their stochastic environment, with interacting intensities. This necessitates that the environment evolves autonomously and is not influenced by the history of the default events. We extend the classical literature and allow a default system to have a contagious impact on its environment. In our framework, contagion can either be contained within the default system (i.e., direct contagion from a counterparty to another) or spill from the default system over its environment (indirect contagion). This type of model is of interest whenever one wants to capture within a model possible impacts of the defaults of a class of debtors on the more global economy and vice versa.
&lt;/p&gt;</description></item></channel></rss>