<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Tree-LTC&#30340;&#39640;&#25928;&#21644;&#21487;&#38752;&#30340;&#26641;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#20855;&#26377;LTC&#25903;&#20184;&#21644;GLWB&#30340;&#21487;&#21464;&#24180;&#37329;&#21512;&#21516;&#30340;&#23450;&#20215;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2404.02858</link><description>&lt;p&gt;
&#23551;&#38505;&#24180;&#37329;&#65306;&#22686;&#24378;&#20135;&#21697;&#21151;&#33021;&#24182;&#23436;&#21892;&#23450;&#20215;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
The Life Care Annuity: enhancing product features and refining pricing methods
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02858
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Tree-LTC&#30340;&#39640;&#25928;&#21644;&#21487;&#38752;&#30340;&#26641;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#20855;&#26377;LTC&#25903;&#20184;&#21644;GLWB&#30340;&#21487;&#21464;&#24180;&#37329;&#21512;&#21516;&#30340;&#23450;&#20215;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20026;&#20855;&#26377;LTC&#25903;&#20184;&#21644;GLWB&#30340;&#21487;&#21464;&#24180;&#37329;&#21512;&#21516;&#25552;&#20379;&#20102;&#26356;&#36890;&#29992;&#30340;&#29305;&#24615;&#65292;&#24182;&#23436;&#21892;&#20102;&#20854;&#23450;&#20215;&#26041;&#27861;&#12290;&#29305;&#21035;&#26159;&#65292;&#22312;&#20135;&#21697;&#29305;&#24615;&#26041;&#38754;&#65292;&#25105;&#20204;&#20801;&#35768;&#21160;&#24577;&#25552;&#21462;&#31574;&#30053;&#65292;&#21253;&#25324;&#25237;&#38477;&#36873;&#39033;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#32771;&#34385;&#38543;&#26426;&#21033;&#29575;&#65292;&#30001;Cox-Ingersoll-Ross&#65288;CIR&#65289;&#36807;&#31243;&#25551;&#36848;&#12290;&#33267;&#20110;&#25968;&#20540;&#26041;&#27861;&#65292;&#25105;&#20204;&#36890;&#36807;&#19968;&#20010;&#31283;&#20581;&#30340;&#26641;&#26041;&#27861;&#35299;&#20915;&#20102;&#28041;&#21450;&#36890;&#36807;&#36873;&#25321;&#26368;&#20339;&#25552;&#21462;&#31574;&#30053;&#32780;&#28041;&#21450;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#12290;&#25105;&#20204;&#20351;&#29992;&#36825;&#31181;&#26041;&#27861;&#26469;&#20272;&#35745;&#20135;&#21697;&#30340;&#20844;&#24179;&#20215;&#26684;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#25968;&#20540;&#32467;&#26524;&#26174;&#31034;&#20102;&#26368;&#20339;&#25552;&#21462;&#31574;&#30053;&#22914;&#20309;&#38543;&#30528;&#25237;&#20445;&#20154;&#30340;&#20581;&#24247;&#29366;&#20917;&#32780;&#38543;&#26102;&#38388;&#21464;&#21270;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#26641;&#26041;&#27861;&#65292;&#25105;&#20204;&#21629;&#21517;&#20026;Tree-LTC&#65292;&#22312;&#19982;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#36827;&#34892;&#23545;&#27604;&#26102;&#35777;&#26126;&#26159;&#39640;&#25928;&#19988;&#21487;&#38752;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02858v1 Announce Type: new  Abstract: In this paper we provide more general features for the variable annuity contract with LTC payouts and GLWB proposed by the state-of-the-art and we refine its pricing methods. In particular, as to product features, we allow dynamic withdrawal strategies, including the surrender option. Furthermore, we consider stochastic interest rate, described by a Cox-Ingersoll-Ross (CIR) process. As to the numerical methods, we solve the stochastic control problem involved by the selection of the optimal withdrawal strategy by means of a robust tree method. We use such a method to estimate the fair price of the product. Furthermore, our numerical results show how the optimal withdrawal strategy varies over time with the health status of the policyholder. Our proposed tree method, we name Tree-LTC, proves to be efficient and reliable, when tested against the Monte Carlo approach.
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27969;&#21160;&#24615;&#30340;&#20998;&#25955;&#39044;&#27979;&#24066;&#22330;&#26694;&#26550;&#65292;&#35813;&#26694;&#26550;&#20855;&#22791;&#21512;&#29702;&#30340;&#37329;&#34701;&#24615;&#36136;&#65292;&#24182;&#25552;&#20986;&#20102;&#26377;&#24847;&#20041;&#30340;&#20132;&#26131;&#36153;&#29992;&#26426;&#21046;&#12290;</title><link>http://arxiv.org/abs/2307.08768</link><description>&lt;p&gt;
&#20998;&#25955;&#39044;&#27979;&#24066;&#22330;&#21644;&#20307;&#32946;&#21338;&#24425;
&lt;/p&gt;
&lt;p&gt;
Decentralized Prediction Markets and Sports Books. (arXiv:2307.08768v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.08768
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27969;&#21160;&#24615;&#30340;&#20998;&#25955;&#39044;&#27979;&#24066;&#22330;&#26694;&#26550;&#65292;&#35813;&#26694;&#26550;&#20855;&#22791;&#21512;&#29702;&#30340;&#37329;&#34701;&#24615;&#36136;&#65292;&#24182;&#25552;&#20986;&#20102;&#26377;&#24847;&#20041;&#30340;&#20132;&#26131;&#36153;&#29992;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#27979;&#24066;&#22330;&#20801;&#35768;&#20132;&#26131;&#32773;&#23545;&#28508;&#22312;&#30340;&#26410;&#26469;&#32467;&#26524;&#36827;&#34892;&#25237;&#27880;&#65292;&#36825;&#20123;&#24066;&#22330;&#23384;&#22312;&#20110;&#22825;&#27668;&#12289;&#25919;&#27835;&#12289;&#20307;&#32946;&#21644;&#32463;&#27982;&#39044;&#27979;&#39046;&#22495;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#20351;&#29992;&#33258;&#21160;&#21270;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMMs&#65289;&#30340;&#20998;&#25955;&#39044;&#27979;&#24066;&#22330;&#26694;&#26550;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#22522;&#20110;&#27969;&#21160;&#24615;&#30340;&#39044;&#27979;&#24066;&#22330; AMM &#32467;&#26500;&#65292;&#35813;&#32467;&#26500;&#22312;&#24213;&#23618;&#25928;&#29992;&#20989;&#25968;&#19978;&#28385;&#36275;&#21512;&#29702;&#30340;&#37329;&#34701;&#24615;&#36136;&#65292;&#21253;&#25324;&#25237;&#27880;&#25104;&#26412;&#21644;&#32467;&#26524;&#23450;&#20215;&#30340;&#30456;&#20851;&#24615;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#27969;&#21160;&#24615;&#22914;&#20309;&#21487;&#20197;&#20174; AMM &#20013;&#27719;&#38598;&#25110;&#25764;&#22238;&#20197;&#21450;&#23545;&#24066;&#22330;&#34892;&#20026;&#30340;&#24433;&#21709;&#12290;&#22312;&#32771;&#34385;&#36825;&#20010;&#20998;&#25955;&#30340;&#26694;&#26550;&#26102;&#65292;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#21487;&#20197;&#29992;&#20110;&#20132;&#26131;&#25910;&#21462;&#26377;&#24847;&#20041;&#36153;&#29992;&#30340;&#24314;&#35758;&#65292;&#20197;&#34917;&#20607;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#23545;&#24066;&#22330;&#30340;&#37325;&#35201;&#21151;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Prediction markets allow traders to bet on potential future outcomes. These markets exist for weather, political, sports, and economic forecasting. Within this work we consider a decentralized framework for prediction markets using automated market makers (AMMs). Specifically, we construct a liquidity-based AMM structure for prediction markets that, under reasonable axioms on the underlying utility function, satisfy meaningful financial properties on the cost of betting and the resulting pricing oracle. Importantly, we study how liquidity can be pooled or withdrawn from the AMM and the resulting implications to the market behavior. In considering this decentralized framework, we additionally propose financially meaningful fees that can be collected for trading to compensate the liquidity providers for their vital market function.
&lt;/p&gt;</description></item></channel></rss>