<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20445;&#38505;&#34892;&#19994;&#20013;&#30340;&#26368;&#20248;&#32929;&#21033;&#25903;&#20184;&#38382;&#39064;&#65292;&#22312;&#32771;&#34385;&#40831;&#36718;&#32422;&#26463;&#30340;&#26465;&#20214;&#19979;&#65292;&#20351;&#29992;&#24067;&#26391;&#36816;&#21160;&#21097;&#20313;&#27169;&#22411;&#21644;&#20559;&#24494;&#20998;&#26041;&#31243;&#26041;&#27861;&#25214;&#21040;&#20102;&#26368;&#20248;&#32929;&#21033;&#40831;&#36718;&#31574;&#30053;&#12290;</title><link>http://arxiv.org/abs/2308.15048</link><description>&lt;p&gt;
&#22312;&#24067;&#26391;&#36816;&#21160;&#21097;&#20313;&#19979;&#30340;&#32929;&#21033;&#25903;&#20184;&#38382;&#39064;&#20013;&#30340;&#26368;&#20248;&#40831;&#36718;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Optimal ratcheting of dividend payout under Brownian motion surplus. (arXiv:2308.15048v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.15048
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20445;&#38505;&#34892;&#19994;&#20013;&#30340;&#26368;&#20248;&#32929;&#21033;&#25903;&#20184;&#38382;&#39064;&#65292;&#22312;&#32771;&#34385;&#40831;&#36718;&#32422;&#26463;&#30340;&#26465;&#20214;&#19979;&#65292;&#20351;&#29992;&#24067;&#26391;&#36816;&#21160;&#21097;&#20313;&#27169;&#22411;&#21644;&#20559;&#24494;&#20998;&#26041;&#31243;&#26041;&#27861;&#25214;&#21040;&#20102;&#26368;&#20248;&#32929;&#21033;&#40831;&#36718;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20445;&#38505;&#34892;&#19994;&#20013;&#38271;&#26399;&#23384;&#22312;&#30340;&#24102;&#26377;&#25152;&#35859;&#40831;&#36718;&#32422;&#26463;&#30340;&#26368;&#20248;&#32929;&#21033;&#25903;&#20184;&#38382;&#39064;&#65292;&#21363;&#32929;&#21033;&#25903;&#20184;&#29575;&#22312;&#26102;&#38388;&#19978;&#24212;&#26159;&#38750;&#36882;&#20943;&#30340;&#12290;&#21097;&#20313;&#36807;&#31243;&#26159;&#30001;&#28418;&#31227;&#24067;&#26391;&#36816;&#21160;&#36807;&#31243;&#24314;&#27169;&#30340;&#65292;&#30446;&#26631;&#26159;&#25214;&#21040;&#26368;&#20248;&#30340;&#32929;&#21033;&#40831;&#36718;&#31574;&#30053;&#65292;&#20197;&#26368;&#22823;&#21270;&#30772;&#20135;&#26102;&#38388;&#21069;&#24635;&#36148;&#29616;&#32929;&#21033;&#25903;&#20184;&#30340;&#26399;&#26395;&#12290;&#30001;&#20110;&#36335;&#24452;&#20381;&#36182;&#32422;&#26463;&#65292;&#26631;&#20934;&#25511;&#21046;&#29702;&#35770;&#26080;&#27861;&#30452;&#25509;&#24212;&#29992;&#20110;&#35299;&#20915;&#35813;&#38382;&#39064;&#12290;&#30456;&#20851;&#30340;Hamilton-Jacobi-Bellman&#65288;HJB&#65289;&#26041;&#31243;&#26159;&#19968;&#31181;&#26032;&#22411;&#30340;&#21464;&#20998;&#19981;&#31561;&#24335;&#12290;&#22312;&#25991;&#29486;&#20013;&#65292;&#21482;&#35777;&#26126;&#20102;&#23427;&#20855;&#26377;&#40655;&#24615;&#35299;&#65292;&#36825;&#23545;&#20110;&#20445;&#35777;&#26368;&#20248;&#32929;&#21033;&#40831;&#36718;&#31574;&#30053;&#30340;&#23384;&#22312;&#24615;&#26159;&#19981;&#22815;&#24378;&#30340;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#20559;&#24494;&#20998;&#26041;&#31243;&#26041;&#27861;&#26469;&#30740;&#31350;HJB&#26041;&#31243;&#12290;&#25105;&#20204;&#19981;&#20165;&#22312;&#19968;&#20123;&#26356;&#24378;&#30340;&#20989;&#25968;&#31354;&#38388;&#20013;&#35777;&#26126;&#20102;&#35299;&#30340;&#23384;&#22312;&#24615;&#21644;&#21807;&#19968;&#24615;&#65292;&#32780;&#19988;&#22312;&#24378;&#34920;&#31034;&#35299;&#30340;&#23384;&#22312;&#24615;&#26041;&#38754;&#21462;&#24471;&#20102;&#19968;&#20123;&#21021;&#27493;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper is concerned with a long standing optimal dividend payout problem in insurance subject to the so-called ratcheting constraint, that is, the dividend payout rate shall be non-decreasing over time. The surplus process is modeled by a drifted Brownian motion process and the aim is to find the optimal dividend ratcheting strategy to maximize the expectation of the total discounted dividend payouts until the ruin time. Due to the path-dependent constraint, the standard control theory cannot be directly applied to tackle the problem. The related Hamilton-Jacobi-Bellman (HJB) equation is a new type of variational inequality. In the literature, it is only shown to have a viscosity solution, which is not strong enough to guarantee the existence of an optimal dividend ratcheting strategy. This paper proposes a novel partial differential equation method to study the HJB equation. We not only prove the the existence and uniqueness of the solution in some stronger functional space, but a
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#19968;&#31181;&#38754;&#23545;&#22810;&#31181;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#30340;&#20877;&#20445;&#38505;&#21830;&#31574;&#30053;&#65292;&#20854;&#36890;&#36807;&#35774;&#35745;&#26368;&#22823;&#21270;&#39044;&#26399;&#36130;&#23500;&#30340;&#20877;&#20445;&#38505;&#21512;&#21516;&#65292;&#24182;&#22312;&#20445;&#38505;&#21830;&#27169;&#22411;&#30340;&#37325;&#24515;&#22833;&#30495;&#19979;&#23450;&#20215;&#65292;&#35299;&#20915;&#20102;&#36830;&#32493;&#26102;&#38388;&#30340;&#39046;&#23548;&#32773;-&#36861;&#38543;&#32773;&#21338;&#24328;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2308.11828</link><description>&lt;p&gt;
&#22810;&#23478;&#20445;&#38505;&#21830;&#30340;&#26368;&#20248;&#40065;&#26834;&#20877;&#20445;&#38505;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Optimal Robust Reinsurance with Multiple Insurers. (arXiv:2308.11828v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.11828
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#19968;&#31181;&#38754;&#23545;&#22810;&#31181;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#30340;&#20877;&#20445;&#38505;&#21830;&#31574;&#30053;&#65292;&#20854;&#36890;&#36807;&#35774;&#35745;&#26368;&#22823;&#21270;&#39044;&#26399;&#36130;&#23500;&#30340;&#20877;&#20445;&#38505;&#21512;&#21516;&#65292;&#24182;&#22312;&#20445;&#38505;&#21830;&#27169;&#22411;&#30340;&#37325;&#24515;&#22833;&#30495;&#19979;&#23450;&#20215;&#65292;&#35299;&#20915;&#20102;&#36830;&#32493;&#26102;&#38388;&#30340;&#39046;&#23548;&#32773;-&#36861;&#38543;&#32773;&#21338;&#24328;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#23478;&#38754;&#20020;&#22810;&#20010;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#30340;&#20877;&#20445;&#38505;&#21830;&#12290;&#20877;&#20445;&#38505;&#21830;&#21521;$n$&#23478;&#20445;&#38505;&#21830;&#25552;&#20379;&#21512;&#21516;&#65292;&#20854;&#32034;&#36180;&#36981;&#24490;&#19981;&#21516;&#30340;&#22797;&#21512;&#27850;&#26494;&#36807;&#31243;&#12290;&#30001;&#20110;&#20877;&#20445;&#38505;&#21830;&#23545;&#20110;&#20445;&#38505;&#21830;&#30340;&#32034;&#36180;&#20005;&#37325;&#31243;&#24230;&#20998;&#24067;&#21644;&#39057;&#29575;&#23384;&#22312;&#19981;&#30830;&#23450;&#24615;&#65292;&#20182;&#20204;&#35774;&#35745;&#20102;&#26368;&#22823;&#21270;&#39044;&#26399;&#36130;&#23500;&#30340;&#20877;&#20445;&#38505;&#21512;&#21516;&#65292;&#21516;&#26102;&#36824;&#38656;&#35201;&#25215;&#25285;&#19968;&#20010;&#29109;&#24809;&#32602;&#12290;&#32780;&#20445;&#38505;&#21830;&#21017;&#23547;&#27714;&#22312;&#26080;&#27495;&#20041;&#30340;&#24773;&#20917;&#19979;&#26368;&#22823;&#21270;&#20182;&#20204;&#30340;&#39044;&#26399;&#25928;&#29992;&#12290;&#25105;&#20204;&#35299;&#20915;&#20102;&#36825;&#20010;&#36830;&#32493;&#26102;&#38388;&#30340;&#39046;&#23548;&#32773;-&#36861;&#38543;&#32773;&#21338;&#24328;&#38382;&#39064;&#65292;&#24471;&#21040;&#20877;&#20445;&#38505;&#21830;&#22312;&#20445;&#38505;&#21830;&#27169;&#22411;&#30340;&#37325;&#24515;&#22833;&#30495;&#19979;&#30340;&#23450;&#20215;&#26041;&#24335;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#32467;&#26524;&#24212;&#29992;&#21040;&#27604;&#20363;&#20877;&#20445;&#38505;&#21644;&#36229;&#39069;&#25439;&#22833;&#20877;&#20445;&#38505;&#21512;&#21516;&#65292;&#24182;&#36827;&#34892;&#20102;&#25968;&#20540;&#35299;&#26512;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#35299;&#20915;&#20102;&#20877;&#20445;&#38505;&#21830;&#22312;&#27169;&#31946;&#24773;&#20917;&#19979;&#26368;&#22823;&#21270;&#20182;&#20204;&#30340;&#39044;&#26399;&#25928;&#29992;&#30340;&#30456;&#20851;&#38382;&#39064;&#65292;&#24182;&#27604;&#36739;&#20102;&#35299;&#30340;&#19981;&#21516;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a reinsurer who faces multiple sources of model uncertainty. The reinsurer offers contracts to $n$ insurers whose claims follow different compound Poisson processes. As the reinsurer is uncertain about the insurers' claim severity distributions and frequencies, they design reinsurance contracts that maximise their expected wealth subject to an entropy penalty. Insurers meanwhile seek to maximise their expected utility without ambiguity. We solve this continuous-time Stackelberg game for general reinsurance contracts and find that the reinsurer prices under a distortion of the barycentre of the insurers' models. We apply our results to proportional reinsurance and excess-of-loss reinsurance contracts, and illustrate the solutions numerically. Furthermore, we solve the related problem where the reinsurer maximises, still under ambiguity, their expected utility and compare the solutions.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#35299;&#38599;&#36890;&#30693;&#30340;&#38271;&#24230;&#21464;&#21270;&#65292;&#21306;&#20998;&#20102;&#22833;&#19994;&#26399;&#38480;&#21046;&#21644;&#19981;&#33391;&#36873;&#25321;&#23545;&#22833;&#19994;&#36864;&#20986;&#29575;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;48&#21608;&#22833;&#19994;&#36864;&#20986;&#29575;&#30340;&#19979;&#38477;&#20027;&#35201;&#26159;&#30001;&#20110;&#30041;&#23384;&#27714;&#32844;&#32773;&#30340;&#36136;&#37327;&#24694;&#21270;&#36896;&#25104;&#30340;&#65292;</title><link>http://arxiv.org/abs/2305.17344</link><description>&lt;p&gt;
&#22522;&#20110;&#35299;&#38599;&#25552;&#21069;&#36890;&#30693;&#38271;&#24230;&#30340;&#22833;&#19994;&#26399;&#38480;&#21046;&#21644;&#24322;&#36136;&#24615;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Duration Dependence and Heterogeneity: Learning from Early Notice of Layoff. (arXiv:2305.17344v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.17344
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#35299;&#38599;&#36890;&#30693;&#30340;&#38271;&#24230;&#21464;&#21270;&#65292;&#21306;&#20998;&#20102;&#22833;&#19994;&#26399;&#38480;&#21046;&#21644;&#19981;&#33391;&#36873;&#25321;&#23545;&#22833;&#19994;&#36864;&#20986;&#29575;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;48&#21608;&#22833;&#19994;&#36864;&#20986;&#29575;&#30340;&#19979;&#38477;&#20027;&#35201;&#26159;&#30001;&#20110;&#30041;&#23384;&#27714;&#32844;&#32773;&#30340;&#36136;&#37327;&#24694;&#21270;&#36896;&#25104;&#30340;&#65292;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#35299;&#38599;&#36890;&#30693;&#30340;&#38271;&#24230;&#21464;&#21270;&#26469;&#21306;&#20998;&#22833;&#19994;&#26399;&#38480;&#21046;&#21644;&#19981;&#33391;&#36873;&#25321;&#23545;&#22833;&#19994;&#36864;&#20986;&#29575;&#30340;&#24433;&#21709;&#12290;&#20316;&#32773;&#22312;&#31163;&#25955;&#26102;&#38388;&#19979;&#26500;&#24314;&#20102;&#28151;&#21512;&#39118;&#38505;&#27169;&#22411;&#65292;&#24182;&#35268;&#23450;&#20102;&#21464;&#36890;&#30693;&#38271;&#24230;&#22914;&#20309;&#23454;&#29616;&#23545;&#32467;&#26500;&#22833;&#19994;&#26399;&#38480;&#21046;&#30340;&#37492;&#21035;&#65292;&#21516;&#26102;&#20801;&#35768;&#24037;&#20154;&#38388;&#30340;&#20219;&#24847;&#24322;&#36136;&#24615;&#12290;&#20316;&#32773;&#36816;&#29992;&#24369;&#21270;&#30697;(GMM)&#26041;&#27861;&#23545;&#25968;&#25454;&#36827;&#34892;&#20272;&#35745;&#65292;&#32467;&#26524;&#34920;&#26126;&#65292;48&#21608;&#22833;&#19994;&#36864;&#20986;&#29575;&#30340;&#19979;&#38477;&#20027;&#35201;&#26159;&#30001;&#20110;&#30041;&#23384;&#30340;&#27714;&#32844;&#32773;&#36136;&#37327;&#24694;&#21270;&#36896;&#25104;&#30340;&#12290;&#27492;&#22806;&#65292;&#20316;&#32773;&#21457;&#29616;&#20010;&#20154;&#36864;&#20986;&#22833;&#19994;&#30340;&#21487;&#33021;&#24615;&#19968;&#24320;&#22987;&#20943;&#23569;&#65292;&#28982;&#21518;&#22312;&#22833;&#19994;&#31119;&#21033;&#29992;&#23613;&#20043;&#21069;&#22686;&#21152;&#65292;&#24182;&#22312;&#27492;&#21518;&#20445;&#25345;&#31283;&#23450;&#12290;&#36825;&#20123;&#21457;&#29616;&#19982;&#19968;&#20010;&#26631;&#20934;&#30340;&#25628;&#32034;&#27169;&#22411;&#30456;&#19968;&#33268;&#65292;&#22312;&#36825;&#20010;&#27169;&#22411;&#20013;&#65292;&#25628;&#32034;&#30340;&#22238;&#25253;&#38543;&#30528;&#26102;&#38388;&#30340;&#25512;&#31227;&#32780;&#20943;&#23569;&#65292;&#24182;&#19988;&#19981;&#33391;&#36873;&#25321;&#30340;&#24433;&#21709;&#22312;&#22833;&#19994;&#21021;&#26399;&#26368;&#20026;&#26174;&#33879;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a novel approach to distinguish the impact of duration-dependent forces and adverse selection on the exit rate from unemployment by leveraging variation in the length of layoff notices. I formulate a Mixed Hazard model in discrete time and specify the conditions under which variation in notice length enables the identification of structural duration dependence while allowing for arbitrary heterogeneity across workers. Utilizing data from the Displaced Worker Supplement (DWS), I employ the Generalized Method of Moments (GMM) to estimate the model. According to the estimates, the decline in the exit rate over the first 48 weeks of unemployment is largely due to the worsening composition of surviving jobseekers. Furthermore, I find that an individual's likelihood of exiting unemployment decreases initially, then increases until unemployment benefits run out, and remains steady thereafter. These findings are consistent with a standard search model where returns to searc
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#22312;Merton&#38382;&#39064;&#20013;&#22686;&#21152;&#22522;&#20934;&#36319;&#36394;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#25918;&#26494;&#30340;&#36319;&#36394;&#20844;&#24335;&#65292;&#24182;&#37319;&#29992;&#21453;&#23556;&#36741;&#21161;&#29366;&#24577;&#36807;&#31243;&#65292;&#36890;&#36807;&#21452;&#37325;&#36716;&#25442;&#21644;&#27010;&#29575;&#34920;&#31034;&#65292;&#24471;&#21040;&#20102;&#31561;&#25928;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#65292;&#24182;&#19988;&#21487;&#20197;&#26126;&#30830;&#22320;&#35299;&#20915;&#12290;&#36890;&#36807;&#36825;&#31181;&#26041;&#27861;&#65292;&#25105;&#20204;&#21487;&#20197;&#28165;&#26224;&#22320;&#20102;&#35299;&#36164;&#20135;&#30340;&#32452;&#25104;&#21644;&#32489;&#25928;&#12290;</title><link>http://arxiv.org/abs/2304.10802</link><description>&lt;p&gt;
&#19968;&#31181;&#25299;&#23637;&#30340;Merton&#38382;&#39064;&#35299;&#20915;&#20102;&#25918;&#23485;&#22522;&#20934;&#36319;&#36394;&#30340;&#38590;&#39064;
&lt;/p&gt;
&lt;p&gt;
An extended Merton problem with relaxed benchmark tracking. (arXiv:2304.10802v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10802
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;Merton&#38382;&#39064;&#20013;&#22686;&#21152;&#22522;&#20934;&#36319;&#36394;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#25918;&#26494;&#30340;&#36319;&#36394;&#20844;&#24335;&#65292;&#24182;&#37319;&#29992;&#21453;&#23556;&#36741;&#21161;&#29366;&#24577;&#36807;&#31243;&#65292;&#36890;&#36807;&#21452;&#37325;&#36716;&#25442;&#21644;&#27010;&#29575;&#34920;&#31034;&#65292;&#24471;&#21040;&#20102;&#31561;&#25928;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#65292;&#24182;&#19988;&#21487;&#20197;&#26126;&#30830;&#22320;&#35299;&#20915;&#12290;&#36890;&#36807;&#36825;&#31181;&#26041;&#27861;&#65292;&#25105;&#20204;&#21487;&#20197;&#28165;&#26224;&#22320;&#20102;&#35299;&#36164;&#20135;&#30340;&#32452;&#25104;&#21644;&#32489;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;Merton&#30340;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;&#21644;&#28040;&#36153;&#38382;&#39064;&#65292;&#20854;&#25193;&#23637;&#24418;&#24335;&#21253;&#25324;&#36319;&#36394;&#30001;&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;&#25551;&#36848;&#30340;&#22522;&#20934;&#36807;&#31243;&#12290;&#25105;&#20204;&#32771;&#34385;&#19968;&#31181;&#25918;&#26494;&#30340;&#36319;&#36394;&#20844;&#24335;&#65292;&#21363;&#36164;&#20135;&#36807;&#31243;&#36890;&#36807;&#34394;&#25311;&#36164;&#26412;&#27880;&#20837;&#34920;&#29616;&#20248;&#20110;&#22806;&#37096;&#22522;&#20934;&#12290;&#22522;&#37329;&#32463;&#29702;&#26088;&#22312;&#26368;&#22823;&#21270;&#28040;&#36153;&#30340;&#39044;&#26399;&#25928;&#29992;&#65292;&#20943;&#21435;&#36164;&#26412;&#27880;&#20837;&#25104;&#26412;&#65292;&#21518;&#32773;&#20063;&#21487;&#20197;&#35270;&#20026;&#30456;&#23545;&#20110;&#22522;&#20934;&#30340;&#39044;&#26399;&#26368;&#22823;&#32570;&#21475;&#12290;&#36890;&#36807;&#24341;&#20837;&#19968;&#20010;&#20855;&#26377;&#21453;&#23556;&#30340;&#36741;&#21161;&#29366;&#24577;&#36807;&#31243;&#65292;&#25105;&#20204;&#36890;&#36807;&#21452;&#37325;&#36716;&#25442;&#21644;&#27010;&#29575;&#34920;&#31034;&#21046;&#23450;&#21644;&#35299;&#20915;&#20102;&#31561;&#25928;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#65292;&#20854;&#20013;&#23545;&#20598;PDE&#21487;&#20197;&#26126;&#30830;&#22320;&#35299;&#20915;&#12290;&#20973;&#20511;&#38381;&#24335;&#32467;&#26524;&#30340;&#21147;&#37327;&#65292;&#25105;&#20204;&#21487;&#20197;&#23548;&#20986;&#24182;&#39564;&#35777;&#21407;&#22987;&#25511;&#21046;&#38382;&#39064;&#30340;&#21322;&#35299;&#26512;&#24418;&#24335;&#30340;&#21453;&#39304;&#26368;&#20248;&#25511;&#21046;&#65292;&#20174;&#32780;&#20351;&#25105;&#20204;&#33021;&#22815;&#28165;&#26224;&#22320;&#20102;&#35299;&#36164;&#20135;&#30340;&#32452;&#25104;&#21644;&#32489;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies a Merton's optimal portfolio and consumption problem in an extended formulation incorporating the tracking of a benchmark process described by a geometric Brownian motion. We consider a relaxed tracking formulation such that that the wealth process compensated by a fictitious capital injection outperforms the external benchmark at all times. The fund manager aims to maximize the expected utility of consumption deducted by the cost of the capital injection, where the latter term can also be regarded as the expected largest shortfall with reference to the benchmark. By introducing an auxiliary state process with reflection, we formulate and tackle an equivalent stochastic control problem by means of the dual transform and probabilistic representation, where the dual PDE can be solved explicitly. On the strength of the closed-form results, we can derive and verify the feedback optimal control in the semi-analytical form for the primal control problem, allowing us to obs
&lt;/p&gt;</description></item></channel></rss>