<rss version="2.0"><channel><title>Chat Arxiv stat.ML</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ML</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;Bagged Regularized $k$-Distances for Anomaly Detection (BRDAD)&#30340;&#22522;&#20110;&#36317;&#31163;&#30340;&#31639;&#27861;&#65292;&#36890;&#36807;&#23558;&#38750;&#30417;&#30563;&#24322;&#24120;&#26816;&#27979;&#38382;&#39064;&#36716;&#21270;&#20026;&#20984;&#20248;&#21270;&#38382;&#39064;&#65292;&#25104;&#21151;&#35299;&#20915;&#20102;&#22522;&#20110;&#36317;&#31163;&#31639;&#27861;&#20013;&#36229;&#21442;&#25968;&#36873;&#25321;&#30340;&#25935;&#24863;&#24615;&#25361;&#25112;&#65292;&#24182;&#36890;&#36807;&#21253;&#38598;&#25104;&#26041;&#27861;&#35299;&#20915;&#20102;&#22788;&#29702;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#26102;&#30340;&#25928;&#29575;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2312.01046</link><description>&lt;p&gt;
Bagged Regularized $k$-Distances&#29992;&#20110;&#24322;&#24120;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
Bagged Regularized $k$-Distances for Anomaly Detection
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.01046
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;Bagged Regularized $k$-Distances for Anomaly Detection (BRDAD)&#30340;&#22522;&#20110;&#36317;&#31163;&#30340;&#31639;&#27861;&#65292;&#36890;&#36807;&#23558;&#38750;&#30417;&#30563;&#24322;&#24120;&#26816;&#27979;&#38382;&#39064;&#36716;&#21270;&#20026;&#20984;&#20248;&#21270;&#38382;&#39064;&#65292;&#25104;&#21151;&#35299;&#20915;&#20102;&#22522;&#20110;&#36317;&#31163;&#31639;&#27861;&#20013;&#36229;&#21442;&#25968;&#36873;&#25321;&#30340;&#25935;&#24863;&#24615;&#25361;&#25112;&#65292;&#24182;&#36890;&#36807;&#21253;&#38598;&#25104;&#26041;&#27861;&#35299;&#20915;&#20102;&#22788;&#29702;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#26102;&#30340;&#25928;&#29575;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#38750;&#30417;&#30563;&#24322;&#24120;&#26816;&#27979;&#30340;&#33539;&#24335;&#65292;&#21363;&#22312;&#27809;&#26377;&#26631;&#35760;&#30340;&#24773;&#20917;&#19979;&#35782;&#21035;&#25968;&#25454;&#38598;&#20013;&#30340;&#24322;&#24120;&#20540;&#12290;&#23613;&#31649;&#22522;&#20110;&#36317;&#31163;&#30340;&#26041;&#27861;&#23545;&#20110;&#38750;&#30417;&#30563;&#24322;&#24120;&#26816;&#27979;&#20855;&#26377;&#36739;&#22909;&#30340;&#24615;&#33021;&#65292;&#20294;&#23427;&#20204;&#23545;&#26368;&#36817;&#37051;&#25968;&#37327;&#30340;&#36873;&#25321;&#38750;&#24120;&#25935;&#24863;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22522;&#20110;&#36317;&#31163;&#30340;&#31639;&#27861;&#65292;&#31216;&#20026;Bagged Regularized $k$-Distances for Anomaly Detection (BRDAD)&#65292;&#23558;&#38750;&#30417;&#30563;&#24322;&#24120;&#26816;&#27979;&#38382;&#39064;&#36716;&#21270;&#20026;&#20984;&#20248;&#21270;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;BRDAD&#31639;&#27861;&#36890;&#36807;&#26368;&#23567;&#21270;&#26367;&#20195;&#39118;&#38505;&#65288;&#21363;&#32463;&#39564;&#39118;&#38505;&#30340;&#26377;&#38480;&#26679;&#26412;&#19978;&#30028;&#65289;&#26469;&#36873;&#25321;&#26435;&#37325;&#65292;&#20197;&#29992;&#20110;&#23494;&#24230;&#20272;&#35745;&#30340;&#24102;&#26435;&#37325;&#30340;$k$-distances&#12290;&#36825;&#31181;&#26041;&#27861;&#25104;&#21151;&#35299;&#20915;&#20102;&#22522;&#20110;&#36317;&#31163;&#31639;&#27861;&#20013;&#36229;&#21442;&#25968;&#36873;&#25321;&#30340;&#25935;&#24863;&#24615;&#25361;&#25112;&#12290;&#27492;&#22806;&#65292;&#22312;&#22788;&#29702;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#26102;&#65292;&#25105;&#20204;&#36824;&#21487;&#20197;&#36890;&#36807;&#21253;&#38598;&#25104;&#30340;&#26041;&#27861;&#26469;&#35299;&#20915;&#25928;&#29575;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the paradigm of unsupervised anomaly detection, which involves the identification of anomalies within a dataset in the absence of labeled examples. Though distance-based methods are top-performing for unsupervised anomaly detection, they suffer heavily from the sensitivity to the choice of the number of the nearest neighbors. In this paper, we propose a new distance-based algorithm called bagged regularized $k$-distances for anomaly detection (BRDAD) converting the unsupervised anomaly detection problem into a convex optimization problem. Our BRDAD algorithm selects the weights by minimizing the surrogate risk, i.e., the finite sample bound of the empirical risk of the bagged weighted $k$-distances for density estimation (BWDDE). This approach enables us to successfully address the sensitivity challenge of the hyperparameter choice in distance-based algorithms. Moreover, when dealing with large-scale datasets, the efficiency issues can be addressed by the incorporated baggi
&lt;/p&gt;</description></item></channel></rss>