<rss version="2.0"><channel><title>Chat Arxiv stat.ML</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ML</description><item><title>&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#24322;&#24120;&#26816;&#27979;&#31639;&#27861;"Signature Isolation Forest"&#65292;&#21033;&#29992;&#31895;&#36335;&#24452;&#29702;&#35770;&#30340;&#31614;&#21517;&#21464;&#25442;&#21435;&#38500;&#20102;Functional Isolation Forest&#30340;&#32447;&#24615;&#20869;&#31215;&#21644;&#35789;&#20856;&#36873;&#25321;&#26041;&#38754;&#30340;&#38480;&#21046;&#12290;</title><link>https://arxiv.org/abs/2403.04405</link><description>&lt;p&gt;
Signature Isolation Forest
&lt;/p&gt;
&lt;p&gt;
Signature Isolation Forest
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.04405
&lt;/p&gt;
&lt;p&gt;
&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#24322;&#24120;&#26816;&#27979;&#31639;&#27861;"Signature Isolation Forest"&#65292;&#21033;&#29992;&#31895;&#36335;&#24452;&#29702;&#35770;&#30340;&#31614;&#21517;&#21464;&#25442;&#21435;&#38500;&#20102;Functional Isolation Forest&#30340;&#32447;&#24615;&#20869;&#31215;&#21644;&#35789;&#20856;&#36873;&#25321;&#26041;&#38754;&#30340;&#38480;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Functional Isolation Forest (FIF)&#26159;&#19968;&#31181;&#38024;&#23545;&#21151;&#33021;&#25968;&#25454;&#35774;&#35745;&#30340;&#26368;&#26032;&#19968;&#27969;&#24322;&#24120;&#26816;&#27979;(AD)&#31639;&#27861;&#12290;&#23427;&#20381;&#36182;&#20110;&#19968;&#31181;&#26641;&#20998;&#21306;&#36807;&#31243;&#65292;&#36890;&#36807;&#23558;&#27599;&#20010;&#26354;&#32447;&#35266;&#27979;&#25237;&#24433;&#21040;&#36890;&#36807;&#32447;&#24615;&#20869;&#31215;&#32472;&#21046;&#30340;&#35789;&#20856;&#19978;&#26469;&#35745;&#31639;&#24322;&#24120;&#24471;&#20998;&#12290;&#26412;&#25991;&#36890;&#36807;&#24341;&#20837;&#8220;Signature Isolation Forest&#8221;&#65292;&#19968;&#31181;&#21033;&#29992;&#31895;&#36335;&#24452;&#29702;&#35770;&#31614;&#21517;&#21464;&#25442;&#30340;&#26032;&#39062;AD&#31639;&#27861;&#31867;&#65292;&#26469;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#36890;&#36807;&#25552;&#20986;&#20004;&#31181;&#31639;&#27861;&#26469;&#28040;&#38500;FIF&#26045;&#21152;&#30340;&#38480;&#21046;&#65292;&#36825;&#20004;&#31181;&#31639;&#27861;&#29305;&#21035;&#38024;&#23545;FIF&#20869;&#31215;&#30340;&#32447;&#24615;&#24615;&#21644;&#35789;&#20856;&#30340;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.04405v1 Announce Type: cross  Abstract: Functional Isolation Forest (FIF) is a recent state-of-the-art Anomaly Detection (AD) algorithm designed for functional data. It relies on a tree partition procedure where an abnormality score is computed by projecting each curve observation on a drawn dictionary through a linear inner product. Such linear inner product and the dictionary are a priori choices that highly influence the algorithm's performances and might lead to unreliable results, particularly with complex datasets. This work addresses these challenges by introducing \textit{Signature Isolation Forest}, a novel AD algorithm class leveraging the rough path theory's signature transform. Our objective is to remove the constraints imposed by FIF through the proposition of two algorithms which specifically target the linearity of the FIF inner product and the choice of the dictionary. We provide several numerical experiments, including a real-world applications benchmark sho
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#26041;&#27861;&#26469;&#20998;&#26512;&#38750;&#21442;&#25968; logistic &#22238;&#24402;&#38382;&#39064;&#65292;&#36890;&#36807;&#22312;&#28201;&#21644;&#30340;&#20551;&#35774;&#19979;&#65292;&#22312; Hellinger &#36317;&#31163;&#19979;&#25512;&#23548;&#20986;&#20102;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#22120;&#30340;&#25910;&#25947;&#36895;&#29575;&#12290;</title><link>http://arxiv.org/abs/2401.12482</link><description>&lt;p&gt;
&#38750;&#21442;&#25968; logistic &#22238;&#24402;&#19982;&#28145;&#24230;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Nonparametric logistic regression with deep learning. (arXiv:2401.12482v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12482
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#26041;&#27861;&#26469;&#20998;&#26512;&#38750;&#21442;&#25968; logistic &#22238;&#24402;&#38382;&#39064;&#65292;&#36890;&#36807;&#22312;&#28201;&#21644;&#30340;&#20551;&#35774;&#19979;&#65292;&#22312; Hellinger &#36317;&#31163;&#19979;&#25512;&#23548;&#20986;&#20102;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#22120;&#30340;&#25910;&#25947;&#36895;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32771;&#34385;&#38750;&#21442;&#25968; logistic &#22238;&#24402;&#38382;&#39064;&#12290;&#22312; logistic &#22238;&#24402;&#20013;&#65292;&#25105;&#20204;&#36890;&#24120;&#32771;&#34385;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#22120;&#65292;&#32780;&#36807;&#24230;&#39118;&#38505;&#26159;&#30495;&#23454;&#26465;&#20214;&#31867;&#27010;&#29575;&#21644;&#20272;&#35745;&#26465;&#20214;&#31867;&#27010;&#29575;&#20043;&#38388; Kullback-Leibler (KL) &#25955;&#24230;&#30340;&#26399;&#26395;&#12290;&#28982;&#32780;&#65292;&#22312;&#38750;&#21442;&#25968; logistic &#22238;&#24402;&#20013;&#65292;KL &#25955;&#24230;&#24456;&#23481;&#26131;&#21457;&#25955;&#65292;&#22240;&#27492;&#65292;&#36807;&#24230;&#39118;&#38505;&#30340;&#25910;&#25947;&#24456;&#38590;&#35777;&#26126;&#25110;&#19981;&#25104;&#31435;&#12290;&#33509;&#24178;&#29616;&#26377;&#30740;&#31350;&#34920;&#26126;&#65292;&#22312;&#24378;&#20551;&#35774;&#19979; KL &#25955;&#24230;&#30340;&#25910;&#25947;&#24615;&#12290;&#22312;&#22823;&#22810;&#25968;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#20272;&#35745;&#30495;&#23454;&#30340;&#26465;&#20214;&#31867;&#27010;&#29575;&#12290;&#22240;&#27492;&#65292;&#19981;&#38656;&#35201;&#20998;&#26512;&#36807;&#24230;&#39118;&#38505;&#26412;&#36523;&#65292;&#21482;&#38656;&#22312;&#26576;&#20123;&#21512;&#36866;&#30340;&#24230;&#37327;&#19979;&#35777;&#26126;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#22120;&#30340;&#19968;&#33268;&#24615;&#21363;&#21487;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#31616;&#21333;&#32479;&#19968;&#30340;&#26041;&#27861;&#20998;&#26512;&#38750;&#21442;&#25968;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#22120; (NPMLE)&#65292;&#30452;&#25509;&#25512;&#23548;&#20986; NPMLE &#22312; Hellinger &#36317;&#31163;&#19979;&#30340;&#25910;&#25947;&#36895;&#29575;&#65292;&#22312;&#28201;&#21644;&#30340;&#20551;&#35774;&#19979;&#25104;&#31435;&#12290;
&lt;/p&gt;
&lt;p&gt;
Consider the nonparametric logistic regression problem. In the logistic regression, we usually consider the maximum likelihood estimator, and the excess risk is the expectation of the Kullback-Leibler (KL) divergence between the true and estimated conditional class probabilities. However, in the nonparametric logistic regression, the KL divergence could diverge easily, and thus, the convergence of the excess risk is difficult to prove or does not hold. Several existing studies show the convergence of the KL divergence under strong assumptions. In most cases, our goal is to estimate the true conditional class probabilities. Thus, instead of analyzing the excess risk itself, it suffices to show the consistency of the maximum likelihood estimator in some suitable metric. In this paper, using a simple unified approach for analyzing the nonparametric maximum likelihood estimator (NPMLE), we directly derive the convergence rates of the NPMLE in the Hellinger distance under mild assumptions. 
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#31181;&#20351;&#29992;Wasserstein&#36317;&#31163;&#36827;&#34892;&#21152;&#26435;&#30340;&#31639;&#27861;&#65292;&#22312;&#26631;&#35760;&#30340;&#25968;&#25454;&#38598;&#19978;&#35757;&#32451;&#31070;&#32463;&#32593;&#32476;&#21487;&#20197;&#36924;&#36817;&#22312;&#20854;&#20182;&#25968;&#25454;&#38598;&#19978;&#35757;&#32451;&#24471;&#21040;&#30340;&#32467;&#26524;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#31639;&#27861;&#21487;&#20197;&#36755;&#20986;&#25509;&#36817;&#26368;&#20248;&#30340;&#21152;&#26435;&#65292;&#19988;&#31639;&#27861;&#31616;&#21333;&#21487;&#25193;&#23637;&#12290;&#25105;&#20204;&#30340;&#31639;&#27861;&#21487;&#20197;&#26377;&#24847;&#22320;&#24341;&#20837;&#20998;&#24067;&#20559;&#31227;&#36827;&#34892;&#22810;&#30446;&#26631;&#20248;&#21270;&#12290;&#20316;&#20026;&#24212;&#29992;&#23454;&#20363;&#65292;&#25105;&#20204;&#35757;&#32451;&#20102;&#19968;&#20010;&#31070;&#32463;&#32593;&#32476;&#26469;&#35782;&#21035;&#23545;&#32454;&#32990;&#20449;&#21495;&#20256;&#23548;&#30340;MAP&#28608;&#37238;&#20855;&#26377;&#38750;&#32467;&#21512;&#24615;&#30340;&#23567;&#20998;&#23376;&#32467;&#21512;&#29289;&#12290;</title><link>http://arxiv.org/abs/2401.11562</link><description>&lt;p&gt;
&#20351;&#29992;Wasserstein&#36317;&#31163;&#36827;&#34892;&#21152;&#26435;&#20197;&#22686;&#24378;&#36873;&#25321;&#24615;
&lt;/p&gt;
&lt;p&gt;
Enhancing selectivity using Wasserstein distance based reweighing. (arXiv:2401.11562v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11562
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#31181;&#20351;&#29992;Wasserstein&#36317;&#31163;&#36827;&#34892;&#21152;&#26435;&#30340;&#31639;&#27861;&#65292;&#22312;&#26631;&#35760;&#30340;&#25968;&#25454;&#38598;&#19978;&#35757;&#32451;&#31070;&#32463;&#32593;&#32476;&#21487;&#20197;&#36924;&#36817;&#22312;&#20854;&#20182;&#25968;&#25454;&#38598;&#19978;&#35757;&#32451;&#24471;&#21040;&#30340;&#32467;&#26524;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#31639;&#27861;&#21487;&#20197;&#36755;&#20986;&#25509;&#36817;&#26368;&#20248;&#30340;&#21152;&#26435;&#65292;&#19988;&#31639;&#27861;&#31616;&#21333;&#21487;&#25193;&#23637;&#12290;&#25105;&#20204;&#30340;&#31639;&#27861;&#21487;&#20197;&#26377;&#24847;&#22320;&#24341;&#20837;&#20998;&#24067;&#20559;&#31227;&#36827;&#34892;&#22810;&#30446;&#26631;&#20248;&#21270;&#12290;&#20316;&#20026;&#24212;&#29992;&#23454;&#20363;&#65292;&#25105;&#20204;&#35757;&#32451;&#20102;&#19968;&#20010;&#31070;&#32463;&#32593;&#32476;&#26469;&#35782;&#21035;&#23545;&#32454;&#32990;&#20449;&#21495;&#20256;&#23548;&#30340;MAP&#28608;&#37238;&#20855;&#26377;&#38750;&#32467;&#21512;&#24615;&#30340;&#23567;&#20998;&#23376;&#32467;&#21512;&#29289;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32473;&#23450;&#20004;&#20010;&#26631;&#35760;&#25968;&#25454;&#38598;&#119982;&#21644;&#119983;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#31181;&#31616;&#21333;&#39640;&#25928;&#30340;&#36138;&#23146;&#31639;&#27861;&#26469;&#23545;&#25439;&#22833;&#20989;&#25968;&#36827;&#34892;&#21152;&#26435;&#65292;&#20351;&#24471;&#22312;&#119982;&#19978;&#35757;&#32451;&#24471;&#21040;&#30340;&#31070;&#32463;&#32593;&#32476;&#26435;&#37325;&#30340;&#26497;&#38480;&#20998;&#24067;&#36924;&#36817;&#22312;&#119983;&#19978;&#35757;&#32451;&#24471;&#21040;&#30340;&#26497;&#38480;&#20998;&#24067;&#12290;&#22312;&#29702;&#35770;&#26041;&#38754;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#24403;&#36755;&#20837;&#25968;&#25454;&#38598;&#30340;&#24230;&#37327;&#29109;&#26377;&#30028;&#26102;&#65292;&#25105;&#20204;&#30340;&#36138;&#23146;&#31639;&#27861;&#36755;&#20986;&#25509;&#36817;&#26368;&#20248;&#30340;&#21152;&#26435;&#65292;&#21363;&#32593;&#32476;&#26435;&#37325;&#30340;&#20004;&#20010;&#19981;&#21464;&#20998;&#24067;&#22312;&#24635;&#21464;&#24046;&#36317;&#31163;&#19978;&#21487;&#20197;&#35777;&#26126;&#25509;&#36817;&#12290;&#27492;&#22806;&#65292;&#35813;&#31639;&#27861;&#31616;&#21333;&#21487;&#25193;&#23637;&#65292;&#24182;&#19988;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#31639;&#27861;&#30340;&#25928;&#29575;&#19978;&#30028;&#12290;&#25105;&#20204;&#30340;&#31639;&#27861;&#21487;&#20197;&#26377;&#24847;&#22320;&#24341;&#20837;&#20998;&#24067;&#20559;&#31227;&#20197;&#36827;&#34892;&#65288;&#36719;&#65289;&#22810;&#30446;&#26631;&#20248;&#21270;&#12290;&#20316;&#20026;&#19968;&#20010;&#21160;&#26426;&#24212;&#29992;&#65292;&#25105;&#20204;&#35757;&#32451;&#20102;&#19968;&#20010;&#31070;&#32463;&#32593;&#32476;&#26469;&#35782;&#21035;&#23545;MNK2&#65288;&#19968;&#31181;&#32454;&#32990;&#20449;&#21495;&#20256;&#23548;&#30340;MAP&#28608;&#37238;&#65289;&#20855;&#26377;&#38750;&#32467;&#21512;&#24615;&#30340;&#23567;&#20998;&#23376;&#32467;&#21512;&#29289;&#12290;
&lt;/p&gt;
&lt;p&gt;
Given two labeled data-sets $\mathcal{S}$ and $\mathcal{T}$, we design a simple and efficient greedy algorithm to reweigh the loss function such that the limiting distribution of the neural network weights that result from training on $\mathcal{S}$ approaches the limiting distribution that would have resulted by training on $\mathcal{T}$.  On the theoretical side, we prove that when the metric entropy of the input data-sets is bounded, our greedy algorithm outputs a close to optimal reweighing, i.e., the two invariant distributions of network weights will be provably close in total variation distance. Moreover, the algorithm is simple and scalable, and we prove bounds on the efficiency of the algorithm as well.  Our algorithm can deliberately introduce distribution shift to perform (soft) multi-criteria optimization. As a motivating application, we train a neural net to recognize small molecule binders to MNK2 (a MAP Kinase, responsible for cell signaling) which are non-binders to MNK1
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#22411;&#40065;&#26834;&#30340;&#33258;&#36866;&#24212; $\tau$-Lasso &#20272;&#35745;&#22120;&#65292;&#21516;&#26102;&#37319;&#29992;&#33258;&#36866;&#24212; $\ell_1$-&#33539;&#25968;&#24809;&#32602;&#39033;&#20197;&#38477;&#20302;&#30495;&#23454;&#22238;&#24402;&#31995;&#25968;&#30340;&#20559;&#24046;&#12290;&#23427;&#20855;&#26377;&#21464;&#37327;&#36873;&#25321;&#19968;&#33268;&#24615;&#21644;&#30495;&#23454;&#25903;&#25345;&#19979;&#22238;&#24402;&#21521;&#37327;&#30340;&#28176;&#36817;&#27491;&#24577;&#24615;&#30340;&#26368;&#20248;&#24615;&#36136;&#65292;&#20551;&#23450;&#24050;&#30693;&#30495;&#23454;&#22238;&#24402;&#21521;&#37327;&#30340;&#25903;&#25345;&#12290;</title><link>http://arxiv.org/abs/2304.09310</link><description>&lt;p&gt;
&#33258;&#36866;&#24212; $\tau$-Lasso&#65306;&#20854;&#20581;&#22766;&#24615;&#21644;&#26368;&#20248;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Adaptive $\tau$-Lasso: Its Robustness and Oracle Properties. (arXiv:2304.09310v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.09310
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#22411;&#40065;&#26834;&#30340;&#33258;&#36866;&#24212; $\tau$-Lasso &#20272;&#35745;&#22120;&#65292;&#21516;&#26102;&#37319;&#29992;&#33258;&#36866;&#24212; $\ell_1$-&#33539;&#25968;&#24809;&#32602;&#39033;&#20197;&#38477;&#20302;&#30495;&#23454;&#22238;&#24402;&#31995;&#25968;&#30340;&#20559;&#24046;&#12290;&#23427;&#20855;&#26377;&#21464;&#37327;&#36873;&#25321;&#19968;&#33268;&#24615;&#21644;&#30495;&#23454;&#25903;&#25345;&#19979;&#22238;&#24402;&#21521;&#37327;&#30340;&#28176;&#36817;&#27491;&#24577;&#24615;&#30340;&#26368;&#20248;&#24615;&#36136;&#65292;&#20551;&#23450;&#24050;&#30693;&#30495;&#23454;&#22238;&#24402;&#21521;&#37327;&#30340;&#25903;&#25345;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#29992;&#20110;&#20998;&#26512;&#39640;&#32500;&#25968;&#25454;&#38598;&#30340;&#26032;&#22411;&#27491;&#21017;&#21270;&#40065;&#26834; $\tau$-&#22238;&#24402;&#20272;&#35745;&#22120;&#65292;&#20197;&#24212;&#23545;&#21709;&#24212;&#21464;&#37327;&#21644;&#21327;&#21464;&#37327;&#30340;&#20005;&#37325;&#27745;&#26579;&#12290;&#25105;&#20204;&#31216;&#36825;&#31181;&#20272;&#35745;&#22120;&#20026;&#33258;&#36866;&#24212; $\tau$-Lasso&#65292;&#23427;&#23545;&#24322;&#24120;&#20540;&#21644;&#39640;&#26464;&#26438;&#28857;&#20855;&#26377;&#40065;&#26834;&#24615;&#65292;&#21516;&#26102;&#37319;&#29992;&#33258;&#36866;&#24212; $\ell_1$-&#33539;&#25968;&#24809;&#32602;&#39033;&#26469;&#20943;&#23569;&#30495;&#23454;&#22238;&#24402;&#31995;&#25968;&#30340;&#20559;&#24046;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#35813;&#33258;&#36866;&#24212; $\ell_1$-&#33539;&#25968;&#24809;&#32602;&#39033;&#20026;&#27599;&#20010;&#22238;&#24402;&#31995;&#25968;&#20998;&#37197;&#19968;&#20010;&#26435;&#37325;&#12290;&#23545;&#20110;&#22266;&#23450;&#25968;&#37327;&#30340;&#39044;&#27979;&#21464;&#37327; $p$&#65292;&#25105;&#20204;&#26174;&#31034;&#20986;&#33258;&#36866;&#24212; $\tau$-Lasso &#20855;&#26377;&#21464;&#37327;&#36873;&#25321;&#19968;&#33268;&#24615;&#21644;&#30495;&#23454;&#25903;&#25345;&#19979;&#22238;&#24402;&#21521;&#37327;&#30340;&#28176;&#36817;&#27491;&#24577;&#24615;&#30340;&#26368;&#20248;&#24615;&#36136;&#65292;&#20551;&#23450;&#24050;&#30693;&#30495;&#23454;&#22238;&#24402;&#21521;&#37327;&#30340;&#25903;&#25345;&#12290;&#28982;&#21518;&#25105;&#20204;&#36890;&#36807;&#26377;&#38480;&#26679;&#26412;&#26029;&#28857;&#21644;&#24433;&#21709;&#20989;&#25968;&#26469;&#34920;&#24449;&#20854;&#20581;&#22766;&#24615;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#24191;&#27867;&#30340;&#27169;&#25311;&#26469;&#27604;&#36739;&#19981;&#21516;&#30340;&#20272;&#35745;&#22120;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper introduces a new regularized version of the robust $\tau$-regression estimator for analyzing high-dimensional data sets subject to gross contamination in the response variables and covariates. We call the resulting estimator adaptive $\tau$-Lasso that is robust to outliers and high-leverage points and simultaneously employs adaptive $\ell_1$-norm penalty term to reduce the bias associated with large true regression coefficients. More specifically, this adaptive $\ell_1$-norm penalty term assigns a weight to each regression coefficient. For a fixed number of predictors $p$, we show that the adaptive $\tau$-Lasso has the oracle property with respect to variable-selection consistency and asymptotic normality for the regression vector corresponding to the true support, assuming knowledge of the true regression vector support. We then characterize its robustness via the finite-sample breakdown point and the influence function. We carry-out extensive simulations to compare the per
&lt;/p&gt;</description></item></channel></rss>