<rss version="2.0"><channel><title>Chat Arxiv stat.ML</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ML</description><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#38750;&#32447;&#24615;&#21452;&#26102;&#38388;&#23610;&#24230;&#38543;&#26426;&#36924;&#36817;&#20013;&#26377;&#38480;&#26102;&#38388;&#35299;&#32806;&#25910;&#25947;&#30340;&#28508;&#21147;&#65292;&#24182;&#36890;&#36807;&#24341;&#20837;&#23884;&#22871;&#23616;&#37096;&#32447;&#24615;&#26465;&#20214;&#35777;&#26126;&#20102;&#20854;&#21487;&#34892;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.03893</link><description>&lt;p&gt;
&#38750;&#32447;&#24615;&#21452;&#26102;&#38388;&#23610;&#24230;&#38543;&#26426;&#36924;&#36817;&#20013;&#30340;&#26377;&#38480;&#26102;&#38388;&#35299;&#32806;&#25910;&#25947;
&lt;/p&gt;
&lt;p&gt;
Finite-Time Decoupled Convergence in Nonlinear Two-Time-Scale Stochastic Approximation. (arXiv:2401.03893v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.03893
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#38750;&#32447;&#24615;&#21452;&#26102;&#38388;&#23610;&#24230;&#38543;&#26426;&#36924;&#36817;&#20013;&#26377;&#38480;&#26102;&#38388;&#35299;&#32806;&#25910;&#25947;&#30340;&#28508;&#21147;&#65292;&#24182;&#36890;&#36807;&#24341;&#20837;&#23884;&#22871;&#23616;&#37096;&#32447;&#24615;&#26465;&#20214;&#35777;&#26126;&#20102;&#20854;&#21487;&#34892;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#21452;&#26102;&#38388;&#23610;&#24230;&#38543;&#26426;&#36924;&#36817;&#20013;&#65292;&#20351;&#29992;&#19981;&#21516;&#30340;&#27493;&#38271;&#20197;&#19981;&#21516;&#30340;&#36895;&#24230;&#26356;&#26032;&#20004;&#20010;&#36845;&#20195;&#65292;&#27599;&#27425;&#26356;&#26032;&#37117;&#20250;&#24433;&#21709;&#21478;&#19968;&#20010;&#12290;&#20808;&#21069;&#30340;&#32447;&#24615;&#21452;&#26102;&#38388;&#23610;&#24230;&#38543;&#26426;&#36924;&#36817;&#30740;&#31350;&#21457;&#29616;&#65292;&#36825;&#20123;&#26356;&#26032;&#30340;&#22343;&#26041;&#35823;&#24046;&#30340;&#25910;&#25947;&#36895;&#24230;&#20165;&#20165;&#21462;&#20915;&#20110;&#23427;&#20204;&#21508;&#33258;&#30340;&#27493;&#38271;&#65292;&#23548;&#33268;&#20102;&#25152;&#35859;&#30340;&#35299;&#32806;&#25910;&#25947;&#12290;&#28982;&#32780;&#65292;&#22312;&#38750;&#32447;&#24615;&#38543;&#26426;&#36924;&#36817;&#20013;&#23454;&#29616;&#36825;&#31181;&#35299;&#32806;&#25910;&#25947;&#30340;&#21487;&#33021;&#24615;&#20173;&#19981;&#26126;&#30830;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#25506;&#35752;&#20102;&#38750;&#32447;&#24615;&#21452;&#26102;&#38388;&#23610;&#24230;&#38543;&#26426;&#36924;&#36817;&#20013;&#26377;&#38480;&#26102;&#38388;&#35299;&#32806;&#25910;&#25947;&#30340;&#28508;&#21147;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#36739;&#24369;&#30340;Lipschitz&#26465;&#20214;&#19979;&#65292;&#20256;&#32479;&#20998;&#26512;&#26080;&#27861;&#23454;&#29616;&#35299;&#32806;&#25910;&#25947;&#12290;&#36825;&#19968;&#21457;&#29616;&#22312;&#25968;&#20540;&#19978;&#24471;&#21040;&#20102;&#36827;&#19968;&#27493;&#30340;&#25903;&#25345;&#12290;&#20294;&#26159;&#36890;&#36807;&#24341;&#20837;&#19968;&#20010;&#23884;&#22871;&#23616;&#37096;&#32447;&#24615;&#26465;&#20214;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#36866;&#24403;&#36873;&#25321;&#19982;&#24179;&#28369;&#24230;&#30456;&#20851;&#30340;&#27493;&#38271;&#30340;&#24773;&#20917;&#19979;&#65292;&#35299;&#32806;&#25910;&#25947;&#20173;&#28982;&#26159;&#21487;&#34892;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
In two-time-scale stochastic approximation (SA), two iterates are updated at varying speeds using different step sizes, with each update influencing the other. Previous studies in linear two-time-scale SA have found that the convergence rates of the mean-square errors for these updates are dependent solely on their respective step sizes, leading to what is referred to as decoupled convergence. However, the possibility of achieving this decoupled convergence in nonlinear SA remains less understood. Our research explores the potential for finite-time decoupled convergence in nonlinear two-time-scale SA. We find that under a weaker Lipschitz condition, traditional analyses are insufficient for achieving decoupled convergence. This finding is further numerically supported by a counterexample. But by introducing an additional condition of nested local linearity, we show that decoupled convergence is still feasible, contingent on the appropriate choice of step sizes associated with smoothnes
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20010;&#24615;&#21270;&#21160;&#24577;&#36229;&#32423;&#23398;&#20064;&#31639;&#27861; (POSL)&#65292;&#21487;&#20197;&#23454;&#29616;&#23454;&#26102;&#26356;&#26032;&#30340;&#39044;&#27979;&#12290;&#20316;&#32773;&#36890;&#36807;&#39044;&#27979;&#34880;&#28082;&#36879;&#26512;&#24739;&#32773;&#30340;&#23545;&#27969;&#23481;&#31215;&#65292;&#23637;&#31034;&#20102;POSL&#22312;&#20013;&#20301;&#32477;&#23545;&#35823;&#24046;&#12289;&#22823;&#22411;&#26657;&#20934;&#12289;&#21306;&#20998;&#24230;&#21644;&#20928;&#25910;&#30410;&#26041;&#38754;&#30340;&#20248;&#36234;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2310.08479</link><description>&lt;p&gt;
&#20010;&#24615;&#21270;&#21160;&#24577;&#36229;&#32423;&#23398;&#20064;&#65306;&#22312;&#39044;&#27979;&#34880;&#28082;&#36879;&#26512;&#30340;&#23545;&#27969;&#23481;&#31215;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Personalised dynamic super learning: an application in predicting hemodiafiltration's convection volumes. (arXiv:2310.08479v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.08479
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20010;&#24615;&#21270;&#21160;&#24577;&#36229;&#32423;&#23398;&#20064;&#31639;&#27861; (POSL)&#65292;&#21487;&#20197;&#23454;&#29616;&#23454;&#26102;&#26356;&#26032;&#30340;&#39044;&#27979;&#12290;&#20316;&#32773;&#36890;&#36807;&#39044;&#27979;&#34880;&#28082;&#36879;&#26512;&#24739;&#32773;&#30340;&#23545;&#27969;&#23481;&#31215;&#65292;&#23637;&#31034;&#20102;POSL&#22312;&#20013;&#20301;&#32477;&#23545;&#35823;&#24046;&#12289;&#22823;&#22411;&#26657;&#20934;&#12289;&#21306;&#20998;&#24230;&#21644;&#20928;&#25910;&#30410;&#26041;&#38754;&#30340;&#20248;&#36234;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23454;&#26102;&#26356;&#26032;&#30340;&#39044;&#27979;&#26159;&#20010;&#24615;&#21270;&#21307;&#30103;&#30340;&#19968;&#20010;&#37325;&#22823;&#25361;&#25112;&#12290;&#36890;&#36807;&#32467;&#21512;&#21442;&#25968;&#22238;&#24402;&#21644;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#20010;&#24615;&#21270;&#22312;&#32447;&#36229;&#32423;&#23398;&#20064;&#31639;&#27861;&#65288;POSL&#65289;&#21487;&#20197;&#23454;&#29616;&#21160;&#24577;&#21644;&#20010;&#24615;&#21270;&#30340;&#39044;&#27979;&#12290;&#25105;&#20204;&#23558;POSL&#24212;&#29992;&#20110;&#21160;&#24577;&#39044;&#27979;&#37325;&#22797;&#36830;&#32493;&#32467;&#26524;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#39564;&#35777;&#20010;&#24615;&#21270;&#25110;&#21160;&#24577;&#39044;&#27979;&#27169;&#22411;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#36890;&#36807;&#39044;&#27979;&#36827;&#34892;&#34880;&#28082;&#36879;&#26512;&#30340;&#24739;&#32773;&#30340;&#23545;&#27969;&#23481;&#31215;&#26469;&#23637;&#31034;&#20854;&#24615;&#33021;&#12290;POSL&#22312;&#20013;&#20301;&#32477;&#23545;&#35823;&#24046;&#12289;&#22823;&#22411;&#26657;&#20934;&#12289;&#21306;&#20998;&#24230;&#21644;&#20928;&#25910;&#30410;&#26041;&#38754;&#30340;&#34920;&#29616;&#20248;&#20110;&#20854;&#20505;&#36873;&#23398;&#20064;&#22120;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#35752;&#35770;&#20102;&#20351;&#29992;POSL&#30340;&#36873;&#25321;&#21644;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
Obtaining continuously updated predictions is a major challenge for personalised medicine. Leveraging combinations of parametric regressions and machine learning approaches, the personalised online super learner (POSL) can achieve such dynamic and personalised predictions. We adapt POSL to predict a repeated continuous outcome dynamically and propose a new way to validate such personalised or dynamic prediction models. We illustrate its performance by predicting the convection volume of patients undergoing hemodiafiltration. POSL outperformed its candidate learners with respect to median absolute error, calibration-in-the-large, discrimination, and net benefit. We finally discuss the choices and challenges underlying the use of POSL.
&lt;/p&gt;</description></item></channel></rss>