<rss version="2.0"><channel><title>Chat Arxiv stat.ML</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ML</description><item><title>&#24046;&#20998;&#31169;&#26377;&#22810;&#21464;&#37327;&#20013;&#20301;&#25968;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#33021;&#20445;&#35777;&#20026;&#24120;&#29992;&#28145;&#24230;&#20989;&#25968;&#25552;&#20379;&#20102;&#23574;&#38160;&#30340;&#32467;&#26524;&#65292;&#34920;&#26126;&#37325;&#23614;&#20301;&#32622;&#20272;&#35745;&#30340;&#25104;&#26412;&#36229;&#36807;&#20102;&#38544;&#31169;&#20445;&#25252;&#25104;&#26412;&#12290;</title><link>https://arxiv.org/abs/2210.06459</link><description>&lt;p&gt;
&#24046;&#20998;&#31169;&#26377;&#22810;&#21464;&#37327;&#20013;&#20301;&#25968;
&lt;/p&gt;
&lt;p&gt;
Differentially private multivariate medians
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2210.06459
&lt;/p&gt;
&lt;p&gt;
&#24046;&#20998;&#31169;&#26377;&#22810;&#21464;&#37327;&#20013;&#20301;&#25968;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#33021;&#20445;&#35777;&#20026;&#24120;&#29992;&#28145;&#24230;&#20989;&#25968;&#25552;&#20379;&#20102;&#23574;&#38160;&#30340;&#32467;&#26524;&#65292;&#34920;&#26126;&#37325;&#23614;&#20301;&#32622;&#20272;&#35745;&#30340;&#25104;&#26412;&#36229;&#36807;&#20102;&#38544;&#31169;&#20445;&#25252;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29616;&#20195;&#25968;&#25454;&#20998;&#26512;&#38656;&#35201;&#28385;&#36275;&#20005;&#26684;&#38544;&#31169;&#20445;&#35777;&#30340;&#32479;&#35745;&#24037;&#20855;&#12290;&#20247;&#25152;&#21608;&#30693;&#65292;&#23545;&#27745;&#26579;&#30340;&#40065;&#26834;&#24615;&#19982;&#24046;&#20998;&#38544;&#31169;&#26377;&#20851;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#20351;&#29992;&#22810;&#20803;&#20013;&#20301;&#25968;&#36827;&#34892;&#24046;&#20998;&#31169;&#26377;&#21644;&#40065;&#26834;&#30340;&#22810;&#20803;&#20301;&#32622;&#20272;&#35745;&#23578;&#26410;&#24471;&#21040;&#31995;&#32479;&#30740;&#31350;&#12290;&#25105;&#20204;&#20026;&#24046;&#20998;&#31169;&#26377;&#22810;&#20803;&#28145;&#24230;&#20013;&#20301;&#25968;&#24320;&#21457;&#20102;&#26032;&#39062;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#33021;&#20445;&#35777;&#65292;&#36825;&#20123;&#20445;&#35777;&#22522;&#26412;&#19978;&#26159;&#23574;&#38160;&#30340;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#28085;&#30422;&#20102;&#24120;&#29992;&#30340;&#28145;&#24230;&#20989;&#25968;&#65292;&#22914;&#21322;&#24179;&#38754;&#65288;&#25110;Tukey&#65289;&#28145;&#24230;&#65292;&#31354;&#38388;&#28145;&#24230;&#21644;&#38598;&#25104;&#21452;&#28145;&#24230;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#26607;&#35199;&#36793;&#38469;&#19979;&#65292;&#37325;&#23614;&#20301;&#32622;&#20272;&#35745;&#30340;&#20195;&#20215;&#36229;&#36807;&#20102;&#38544;&#31169;&#30340;&#20195;&#20215;&#12290;&#25105;&#20204;&#22312;&#39640;&#36798;d = 100&#30340;&#32500;&#24230;&#19978;&#20351;&#29992;&#39640;&#26031;&#27745;&#26579;&#27169;&#22411;&#36827;&#34892;&#20102;&#25968;&#20540;&#28436;&#31034;&#65292;&#24182;&#23558;&#20854;&#19982;&#26368;&#20808;&#36827;&#30340;&#31169;&#26377;&#22343;&#20540;&#20272;&#35745;&#31639;&#27861;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;&#20316;&#20026;&#25105;&#20204;&#30740;&#31350;&#30340;&#19968;&#20010;&#21103;&#20135;&#21697;&#65292;
&lt;/p&gt;
&lt;p&gt;
arXiv:2210.06459v2 Announce Type: replace-cross  Abstract: Statistical tools which satisfy rigorous privacy guarantees are necessary for modern data analysis. It is well-known that robustness against contamination is linked to differential privacy. Despite this fact, using multivariate medians for differentially private and robust multivariate location estimation has not been systematically studied. We develop novel finite-sample performance guarantees for differentially private multivariate depth-based medians, which are essentially sharp. Our results cover commonly used depth functions, such as the halfspace (or Tukey) depth, spatial depth, and the integrated dual depth. We show that under Cauchy marginals, the cost of heavy-tailed location estimation outweighs the cost of privacy. We demonstrate our results numerically using a Gaussian contamination model in dimensions up to d = 100, and compare them to a state-of-the-art private mean estimation algorithm. As a by-product of our inv
&lt;/p&gt;</description></item></channel></rss>