<rss version="2.0"><channel><title>Chat Arxiv stat.ML</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ML</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#26694;&#26550;&#65292;&#29992;&#20110;&#35774;&#35745;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#27700;&#21360;&#30340;&#32479;&#35745;&#25928;&#29575;&#21644;&#26816;&#27979;&#35268;&#21017;&#65292;&#36890;&#36807;&#20851;&#38190;&#32479;&#35745;&#37327;&#21644;&#31192;&#23494;&#23494;&#38053;&#25511;&#21046;&#35823;&#25253;&#29575;&#65292;&#21516;&#26102;&#35780;&#20272;&#27700;&#21360;&#26816;&#27979;&#35268;&#21017;&#30340;&#33021;&#21147;&#12290;</title><link>https://arxiv.org/abs/2404.01245</link><description>&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#27700;&#21360;&#30340;&#32479;&#35745;&#26694;&#26550;: &#26530;&#36724;&#12289;&#26816;&#27979;&#25928;&#29575;&#21644;&#26368;&#20248;&#35268;&#21017;
&lt;/p&gt;
&lt;p&gt;
A Statistical Framework of Watermarks for Large Language Models: Pivot, Detection Efficiency and Optimal Rules
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.01245
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#26694;&#26550;&#65292;&#29992;&#20110;&#35774;&#35745;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#27700;&#21360;&#30340;&#32479;&#35745;&#25928;&#29575;&#21644;&#26816;&#27979;&#35268;&#21017;&#65292;&#36890;&#36807;&#20851;&#38190;&#32479;&#35745;&#37327;&#21644;&#31192;&#23494;&#23494;&#38053;&#25511;&#21046;&#35823;&#25253;&#29575;&#65292;&#21516;&#26102;&#35780;&#20272;&#27700;&#21360;&#26816;&#27979;&#35268;&#21017;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;ChatGPT&#20110;2022&#24180;11&#26376;&#25512;&#20986;&#20197;&#26469;&#65292;&#23558;&#20960;&#20046;&#19981;&#21487;&#23519;&#35273;&#30340;&#32479;&#35745;&#20449;&#21495;&#23884;&#20837;&#21040;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#29983;&#25104;&#30340;&#25991;&#26412;&#20013;&#65292;&#20063;&#34987;&#31216;&#20026;&#27700;&#21360;&#65292;&#24050;&#34987;&#29992;&#20316;&#20174;&#20854;&#20154;&#31867;&#25776;&#20889;&#23545;&#24212;&#29289;&#19978;&#21487;&#35777;&#26816;&#27979;LLM&#29983;&#25104;&#25991;&#26412;&#30340;&#21407;&#21017;&#24615;&#26041;&#27861;&#12290; &#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#36890;&#29992;&#28789;&#27963;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#25512;&#29702;&#27700;&#21360;&#30340;&#32479;&#35745;&#25928;&#29575;&#24182;&#35774;&#35745;&#24378;&#22823;&#30340;&#26816;&#27979;&#35268;&#21017;&#12290;&#21463;&#27700;&#21360;&#26816;&#27979;&#30340;&#20551;&#35774;&#26816;&#39564;&#20844;&#24335;&#21551;&#21457;&#65292;&#25105;&#20204;&#30340;&#26694;&#26550;&#39318;&#20808;&#36873;&#25321;&#25991;&#26412;&#30340;&#26530;&#36724;&#32479;&#35745;&#37327;&#21644;&#30001;LLM&#25552;&#20379;&#32473;&#39564;&#35777;&#22120;&#30340;&#31192;&#23494;&#23494;&#38053;&#65292;&#20197;&#23454;&#29616;&#25511;&#21046;&#35823;&#25253;&#29575;&#65288;&#23558;&#20154;&#31867;&#25776;&#20889;&#30340;&#25991;&#26412;&#38169;&#35823;&#22320;&#26816;&#27979;&#20026;LLM&#29983;&#25104;&#30340;&#38169;&#35823;&#65289;&#12290; &#25509;&#19979;&#26469;&#65292;&#35813;&#26694;&#26550;&#20801;&#35768;&#36890;&#36807;&#33719;&#21462;&#28176;&#36817;&#38169;&#35823;&#36127;&#29575;&#65288;&#23558;LLM&#29983;&#25104;&#25991;&#26412;&#38169;&#35823;&#22320;&#26816;&#27979;&#20026;&#20154;&#31867;&#25776;&#20889;&#30340;&#38169;&#35823;&#65289;&#30340;&#23553;&#38381;&#24418;&#24335;&#34920;&#36798;&#24335;&#26469;&#35780;&#20272;&#27700;&#21360;&#26816;&#27979;&#35268;&#21017;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.01245v1 Announce Type: cross  Abstract: Since ChatGPT was introduced in November 2022, embedding (nearly) unnoticeable statistical signals into text generated by large language models (LLMs), also known as watermarking, has been used as a principled approach to provable detection of LLM-generated text from its human-written counterpart. In this paper, we introduce a general and flexible framework for reasoning about the statistical efficiency of watermarks and designing powerful detection rules. Inspired by the hypothesis testing formulation of watermark detection, our framework starts by selecting a pivotal statistic of the text and a secret key -- provided by the LLM to the verifier -- to enable controlling the false positive rate (the error of mistakenly detecting human-written text as LLM-generated). Next, this framework allows one to evaluate the power of watermark detection rules by obtaining a closed-form expression of the asymptotic false negative rate (the error of 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36125;&#21494;&#26031;&#26368;&#20248;&#30340;&#20844;&#24179;&#20998;&#31867;&#26041;&#27861;&#65292;&#36890;&#36807;&#20808;&#22788;&#29702;&#12289;&#20013;&#22788;&#29702;&#21644;&#21518;&#22788;&#29702;&#26469;&#26368;&#23567;&#21270;&#20998;&#31867;&#38169;&#35823;&#65292;&#24182;&#22312;&#32473;&#23450;&#32676;&#20307;&#20844;&#24179;&#24615;&#32422;&#26463;&#30340;&#24773;&#20917;&#19979;&#36827;&#34892;&#20248;&#21270;&#12290;&#35813;&#26041;&#27861;&#24341;&#20837;&#20102;&#32447;&#24615;&#21644;&#21452;&#32447;&#24615;&#24046;&#24322;&#24230;&#37327;&#30340;&#27010;&#24565;&#65292;&#24182;&#25214;&#21040;&#20102;&#36125;&#21494;&#26031;&#26368;&#20248;&#20844;&#24179;&#20998;&#31867;&#22120;&#30340;&#24418;&#24335;&#12290;&#26412;&#26041;&#27861;&#33021;&#22815;&#22788;&#29702;&#22810;&#20010;&#20844;&#24179;&#24615;&#32422;&#26463;&#21644;&#24120;&#35265;&#24773;&#20917;&#12290;</title><link>https://arxiv.org/abs/2402.02817</link><description>&lt;p&gt;
&#22522;&#20110;&#20808;&#22788;&#29702;&#12289;&#20013;&#22788;&#29702;&#21644;&#21518;&#22788;&#29702;&#30340;&#32447;&#24615;&#24046;&#24322;&#32422;&#26463;&#19979;&#30340;&#36125;&#21494;&#26031;&#26368;&#20248;&#20844;&#24179;&#20998;&#31867;
&lt;/p&gt;
&lt;p&gt;
Bayes-Optimal Fair Classification with Linear Disparity Constraints via Pre-, In-, and Post-processing
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02817
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36125;&#21494;&#26031;&#26368;&#20248;&#30340;&#20844;&#24179;&#20998;&#31867;&#26041;&#27861;&#65292;&#36890;&#36807;&#20808;&#22788;&#29702;&#12289;&#20013;&#22788;&#29702;&#21644;&#21518;&#22788;&#29702;&#26469;&#26368;&#23567;&#21270;&#20998;&#31867;&#38169;&#35823;&#65292;&#24182;&#22312;&#32473;&#23450;&#32676;&#20307;&#20844;&#24179;&#24615;&#32422;&#26463;&#30340;&#24773;&#20917;&#19979;&#36827;&#34892;&#20248;&#21270;&#12290;&#35813;&#26041;&#27861;&#24341;&#20837;&#20102;&#32447;&#24615;&#21644;&#21452;&#32447;&#24615;&#24046;&#24322;&#24230;&#37327;&#30340;&#27010;&#24565;&#65292;&#24182;&#25214;&#21040;&#20102;&#36125;&#21494;&#26031;&#26368;&#20248;&#20844;&#24179;&#20998;&#31867;&#22120;&#30340;&#24418;&#24335;&#12290;&#26412;&#26041;&#27861;&#33021;&#22815;&#22788;&#29702;&#22810;&#20010;&#20844;&#24179;&#24615;&#32422;&#26463;&#21644;&#24120;&#35265;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#21487;&#33021;&#23545;&#21463;&#20445;&#25252;&#30340;&#32676;&#20307;&#20135;&#29983;&#19981;&#20844;&#24179;&#30340;&#24433;&#21709;&#12290;&#20026;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#22522;&#20110;&#36125;&#21494;&#26031;&#26368;&#20248;&#30340;&#20844;&#24179;&#20998;&#31867;&#26041;&#27861;&#65292;&#26088;&#22312;&#22312;&#32473;&#23450;&#32676;&#20307;&#20844;&#24179;&#24615;&#32422;&#26463;&#30340;&#24773;&#20917;&#19979;&#26368;&#23567;&#21270;&#20998;&#31867;&#38169;&#35823;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#32447;&#24615;&#24046;&#24322;&#24230;&#37327;&#30340;&#27010;&#24565;&#65292;&#23427;&#20204;&#26159;&#27010;&#29575;&#20998;&#31867;&#22120;&#30340;&#32447;&#24615;&#20989;&#25968;&#65307;&#20197;&#21450;&#21452;&#32447;&#24615;&#24046;&#24322;&#24230;&#37327;&#65292;&#23427;&#20204;&#22312;&#32676;&#20307;&#22238;&#24402;&#20989;&#25968;&#26041;&#38754;&#20063;&#26159;&#32447;&#24615;&#30340;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#20960;&#31181;&#24120;&#35265;&#30340;&#24046;&#24322;&#24230;&#37327;&#65288;&#22914;&#20154;&#21475;&#24179;&#31561;&#12289;&#26426;&#20250;&#24179;&#31561;&#21644;&#39044;&#27979;&#24179;&#31561;&#65289;&#37117;&#26159;&#21452;&#32447;&#24615;&#30340;&#12290;&#25105;&#20204;&#36890;&#36807;&#25581;&#31034;&#19982;Neyman-Pearson&#24341;&#29702;&#30340;&#36830;&#25509;&#65292;&#25214;&#21040;&#20102;&#22312;&#21333;&#19968;&#32447;&#24615;&#24046;&#24322;&#24230;&#37327;&#19979;&#30340;&#36125;&#21494;&#26031;&#26368;&#20248;&#20844;&#24179;&#20998;&#31867;&#22120;&#30340;&#24418;&#24335;&#12290;&#23545;&#20110;&#21452;&#32447;&#24615;&#24046;&#24322;&#24230;&#37327;&#65292;&#36125;&#21494;&#26031;&#26368;&#20248;&#20844;&#24179;&#20998;&#31867;&#22120;&#21464;&#25104;&#20102;&#32676;&#20307;&#38408;&#20540;&#35268;&#21017;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#36824;&#21487;&#20197;&#22788;&#29702;&#22810;&#20010;&#20844;&#24179;&#24615;&#32422;&#26463;&#65288;&#22914;&#24179;&#31561;&#30340;&#20960;&#29575;&#65289;&#21644;&#21463;&#20445;&#25252;&#23646;&#24615;&#24120;&#35265;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
Machine learning algorithms may have disparate impacts on protected groups. To address this, we develop methods for Bayes-optimal fair classification, aiming to minimize classification error subject to given group fairness constraints. We introduce the notion of \emph{linear disparity measures}, which are linear functions of a probabilistic classifier; and \emph{bilinear disparity measures}, which are also linear in the group-wise regression functions. We show that several popular disparity measures -- the deviations from demographic parity, equality of opportunity, and predictive equality -- are bilinear.   We find the form of Bayes-optimal fair classifiers under a single linear disparity measure, by uncovering a connection with the Neyman-Pearson lemma. For bilinear disparity measures, Bayes-optimal fair classifiers become group-wise thresholding rules. Our approach can also handle multiple fairness constraints (such as equalized odds), and the common scenario when the protected attr
&lt;/p&gt;</description></item><item><title>&#20351;&#29992;&#21387;&#32553;&#33258;&#21160;&#32534;&#30721;&#22120;&#20195;&#26367;&#26368;&#20808;&#36827;&#30340;&#29983;&#25104;&#27169;&#22411;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#22270;&#20687;&#24674;&#22797;&#20013;&#30340;&#26032;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2311.17744</link><description>&lt;p&gt;
&#20351;&#29992;&#21387;&#32553;&#33258;&#21160;&#32534;&#30721;&#22120;&#30340;&#21464;&#20998;&#36125;&#21494;&#26031;&#22270;&#20687;&#24674;&#22797;
&lt;/p&gt;
&lt;p&gt;
Variational Bayes image restoration with compressive autoencoders
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.17744
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#21387;&#32553;&#33258;&#21160;&#32534;&#30721;&#22120;&#20195;&#26367;&#26368;&#20808;&#36827;&#30340;&#29983;&#25104;&#27169;&#22411;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#22270;&#20687;&#24674;&#22797;&#20013;&#30340;&#26032;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36870;&#38382;&#39064;&#30340;&#27491;&#21017;&#21270;&#22312;&#35745;&#31639;&#25104;&#20687;&#20013;&#33267;&#20851;&#37325;&#35201;&#12290;&#36817;&#24180;&#26469;&#65292;&#31070;&#32463;&#32593;&#32476;&#23398;&#20064;&#26377;&#25928;&#22270;&#20687;&#34920;&#31034;&#30340;&#33021;&#21147;&#24050;&#34987;&#21033;&#29992;&#26469;&#35774;&#35745;&#24378;&#22823;&#30340;&#25968;&#25454;&#39537;&#21160;&#27491;&#21017;&#21270;&#22120;&#12290;&#26412;&#25991;&#39318;&#20808;&#25552;&#20986;&#20351;&#29992;&#21387;&#32553;&#33258;&#21160;&#32534;&#30721;&#22120;&#12290;&#36825;&#20123;&#32593;&#32476;&#21487;&#20197;&#34987;&#30475;&#20316;&#20855;&#26377;&#28789;&#27963;&#28508;&#22312;&#20808;&#39564;&#30340;&#21464;&#20998;&#33258;&#21160;&#32534;&#30721;&#22120;&#65292;&#27604;&#36215;&#26368;&#20808;&#36827;&#30340;&#29983;&#25104;&#27169;&#22411;&#26356;&#23567;&#26356;&#23481;&#26131;&#35757;&#32451;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.17744v2 Announce Type: replace-cross  Abstract: Regularization of inverse problems is of paramount importance in computational imaging. The ability of neural networks to learn efficient image representations has been recently exploited to design powerful data-driven regularizers. While state-of-the-art plug-and-play methods rely on an implicit regularization provided by neural denoisers, alternative Bayesian approaches consider Maximum A Posteriori (MAP) estimation in the latent space of a generative model, thus with an explicit regularization. However, state-of-the-art deep generative models require a huge amount of training data compared to denoisers. Besides, their complexity hampers the optimization involved in latent MAP derivation. In this work, we first propose to use compressive autoencoders instead. These networks, which can be seen as variational autoencoders with a flexible latent prior, are smaller and easier to train than state-of-the-art generative models. As a
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#22522;&#20110;&#36125;&#21494;&#26031;&#19978;&#19979;&#25991;&#26641;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#30340;&#26102;&#38388;&#24207;&#21015;&#24314;&#27169;&#21644;&#39044;&#27979;&#26041;&#27861;&#65292;&#36890;&#36807;&#23618;&#32423;&#36125;&#21494;&#26031;&#26694;&#26550;&#23558;&#31163;&#25955;&#29366;&#24577;&#21644;&#23454;&#20540;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#32452;&#21512;&#65292;&#26500;&#24314;&#20986;&#28789;&#27963;&#19988;&#21487;&#35299;&#37322;&#30340;&#28151;&#21512;&#27169;&#22411;&#65292;&#24182;&#25552;&#20986;&#20102;&#26377;&#25928;&#30340;&#31639;&#27861;&#26469;&#36827;&#34892;&#36125;&#21494;&#26031;&#25512;&#26029;&#21644;&#39044;&#27979;&#12290;</title><link>http://arxiv.org/abs/2308.00913</link><description>&lt;p&gt;
&#22522;&#20110;&#36125;&#21494;&#26031;&#19978;&#19979;&#25991;&#26641;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#30340;&#26102;&#38388;&#24207;&#21015;&#24314;&#27169;&#21644;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
The Bayesian Context Trees State Space Model for time series modelling and forecasting. (arXiv:2308.00913v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.00913
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#22522;&#20110;&#36125;&#21494;&#26031;&#19978;&#19979;&#25991;&#26641;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#30340;&#26102;&#38388;&#24207;&#21015;&#24314;&#27169;&#21644;&#39044;&#27979;&#26041;&#27861;&#65292;&#36890;&#36807;&#23618;&#32423;&#36125;&#21494;&#26031;&#26694;&#26550;&#23558;&#31163;&#25955;&#29366;&#24577;&#21644;&#23454;&#20540;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#32452;&#21512;&#65292;&#26500;&#24314;&#20986;&#28789;&#27963;&#19988;&#21487;&#35299;&#37322;&#30340;&#28151;&#21512;&#27169;&#22411;&#65292;&#24182;&#25552;&#20986;&#20102;&#26377;&#25928;&#30340;&#31639;&#27861;&#26469;&#36827;&#34892;&#36125;&#21494;&#26031;&#25512;&#26029;&#21644;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#20102;&#19968;&#20010;&#23618;&#32423;&#36125;&#21494;&#26031;&#26694;&#26550;&#65292;&#29992;&#20110;&#24320;&#21457;&#29992;&#20110;&#30495;&#23454;&#20540;&#26102;&#38388;&#24207;&#21015;&#30340;&#20016;&#23500;&#28151;&#21512;&#27169;&#22411;&#65292;&#20197;&#21450;&#19968;&#31995;&#21015;&#26377;&#25928;&#30340;&#23398;&#20064;&#21644;&#25512;&#26029;&#24037;&#20855;&#12290;&#22312;&#39030;&#23618;&#65292;&#36890;&#36807;&#36866;&#24403;&#37327;&#21270;&#26368;&#36817;&#26679;&#26412;&#30340;&#19968;&#20123;&#26377;&#24847;&#20041;&#30340;&#31163;&#25955;&#29366;&#24577;&#26469;&#36827;&#34892;&#37492;&#23450;&#12290;&#36825;&#20123;&#21487;&#35266;&#23519;&#29366;&#24577;&#30340;&#38598;&#21512;&#34987;&#25551;&#36848;&#20026;&#31163;&#25955;&#30340;&#19978;&#19979;&#25991;&#26641;&#27169;&#22411;&#12290;&#28982;&#21518;&#65292;&#22312;&#24213;&#23618;&#65292;&#23558;&#19968;&#20010;&#19981;&#21516;&#30340;&#12289;&#20219;&#24847;&#30340;&#23454;&#20540;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#65288;&#22522;&#26412;&#27169;&#22411;&#65289;&#19982;&#27599;&#20010;&#29366;&#24577;&#30456;&#20851;&#32852;&#12290;&#36825;&#23450;&#20041;&#20102;&#19968;&#20010;&#38750;&#24120;&#36890;&#29992;&#30340;&#26694;&#26550;&#65292;&#21487;&#20197;&#19982;&#20219;&#20309;&#29616;&#26377;&#27169;&#22411;&#31867;&#19968;&#36215;&#20351;&#29992;&#65292;&#26500;&#24314;&#28789;&#27963;&#19988;&#21487;&#35299;&#37322;&#30340;&#28151;&#21512;&#27169;&#22411;&#12290;&#25105;&#20204;&#23558;&#20854;&#31216;&#20026;&#36125;&#21494;&#26031;&#19978;&#19979;&#25991;&#26641;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#65292;&#25110;&#32773;BCT-X&#26694;&#26550;&#12290;&#24341;&#20837;&#20102;&#39640;&#25928;&#30340;&#31639;&#27861;&#65292;&#21487;&#20197;&#23454;&#29616;&#26377;&#25928;&#30340;&#12289;&#31934;&#30830;&#30340;&#36125;&#21494;&#26031;&#25512;&#26029;&#65307;&#29305;&#21035;&#26159;&#21487;&#20197;&#30830;&#23450;&#26368;&#22823;&#21518;&#39564;&#27010;&#29575;&#65288;MAP&#65289;&#19978;&#19979;&#25991;&#26641;&#27169;&#22411;&#12290;&#36825;&#20123;&#31639;&#27861;&#21487;&#20197;&#39034;&#24207;&#26356;&#26032;&#65292;&#20197;&#20415;&#23454;&#29616;&#26377;&#25928;&#30340;&#25512;&#26029;&#21644;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
A hierarchical Bayesian framework is introduced for developing rich mixture models for real-valued time series, along with a collection of effective tools for learning and inference. At the top level, meaningful discrete states are identified as appropriately quantised values of some of the most recent samples. This collection of observable states is described as a discrete context-tree model. Then, at the bottom level, a different, arbitrary model for real-valued time series - a base model - is associated with each state. This defines a very general framework that can be used in conjunction with any existing model class to build flexible and interpretable mixture models. We call this the Bayesian Context Trees State Space Model, or the BCT-X framework. Efficient algorithms are introduced that allow for effective, exact Bayesian inference; in particular, the maximum a posteriori probability (MAP) context-tree model can be identified. These algorithms can be updated sequentially, facili
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#21019;&#26032;&#30340;&#25628;&#32034;&#31639;&#27861;&#65292;&#22312;&#39640;&#32500;&#22270;&#32467;&#26500;&#23398;&#20064;&#20013;&#20351;&#29992;&#36793;&#38469;&#20266;&#20284;&#28982;&#20989;&#25968;&#35299;&#20915;&#35745;&#31639;&#22797;&#26434;&#24615;&#38382;&#39064;&#65292;&#24182;&#19988;&#33021;&#22815;&#22312;&#30701;&#26102;&#38388;&#20869;&#29983;&#25104;&#21487;&#38752;&#30340;&#20272;&#35745;&#12290;&#35813;&#26041;&#27861;&#25552;&#20379;&#20102;R&#36719;&#20214;&#21253;BDgraph&#30340;&#20195;&#30721;&#23454;&#29616;&#12290;</title><link>http://arxiv.org/abs/2307.00127</link><description>&lt;p&gt;
&#39640;&#32500;&#36125;&#21494;&#26031;&#39640;&#26031;&#22270;&#27169;&#22411;&#20013;&#30340;&#32467;&#26500;&#23398;&#20064;&#26041;&#27861;&#8212;&#8212;&#21033;&#29992;&#36793;&#38469;&#20266;&#20284;&#28982;&#20989;&#25968;
&lt;/p&gt;
&lt;p&gt;
High-Dimensional Bayesian Structure Learning in Gaussian Graphical Models using Marginal Pseudo-Likelihood. (arXiv:2307.00127v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.00127
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#21019;&#26032;&#30340;&#25628;&#32034;&#31639;&#27861;&#65292;&#22312;&#39640;&#32500;&#22270;&#32467;&#26500;&#23398;&#20064;&#20013;&#20351;&#29992;&#36793;&#38469;&#20266;&#20284;&#28982;&#20989;&#25968;&#35299;&#20915;&#35745;&#31639;&#22797;&#26434;&#24615;&#38382;&#39064;&#65292;&#24182;&#19988;&#33021;&#22815;&#22312;&#30701;&#26102;&#38388;&#20869;&#29983;&#25104;&#21487;&#38752;&#30340;&#20272;&#35745;&#12290;&#35813;&#26041;&#27861;&#25552;&#20379;&#20102;R&#36719;&#20214;&#21253;BDgraph&#30340;&#20195;&#30721;&#23454;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39640;&#26031;&#22270;&#27169;&#22411;&#20197;&#22270;&#24418;&#24418;&#24335;&#25551;&#32472;&#20102;&#22810;&#20803;&#27491;&#24577;&#20998;&#24067;&#20013;&#21464;&#37327;&#20043;&#38388;&#30340;&#26465;&#20214;&#20381;&#36182;&#20851;&#31995;&#12290;&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#20004;&#31181;&#21019;&#26032;&#30340;&#25628;&#32034;&#31639;&#27861;&#65292;&#21033;&#29992;&#36793;&#38469;&#20266;&#20284;&#28982;&#20989;&#25968;&#26469;&#24212;&#23545;&#39640;&#32500;&#22270;&#32467;&#26500;&#23398;&#20064;&#20013;&#30340;&#35745;&#31639;&#22797;&#26434;&#24615;&#38382;&#39064;&#12290;&#36825;&#20123;&#26041;&#27861;&#21487;&#20197;&#22312;&#26631;&#20934;&#35745;&#31639;&#26426;&#19978;&#22312;&#20960;&#20998;&#38047;&#20869;&#24555;&#36895;&#29983;&#25104;&#23545;&#21253;&#21547;1000&#20010;&#21464;&#37327;&#30340;&#38382;&#39064;&#30340;&#21487;&#38752;&#20272;&#35745;&#12290;&#23545;&#20110;&#23545;&#23454;&#38469;&#24212;&#29992;&#24863;&#20852;&#36259;&#30340;&#20154;&#65292;&#25903;&#25345;&#36825;&#31181;&#26032;&#26041;&#27861;&#30340;&#20195;&#30721;&#36890;&#36807;R&#36719;&#20214;&#21253;BDgraph&#25552;&#20379;&#12290;
&lt;/p&gt;
&lt;p&gt;
Gaussian graphical models depict the conditional dependencies between variables within a multivariate normal distribution in a graphical format. The identification of these graph structures is an area known as structure learning. However, when utilizing Bayesian methodologies in structure learning, computational complexities can arise, especially with high-dimensional graphs surpassing 250 nodes. This paper introduces two innovative search algorithms that employ marginal pseudo-likelihood to address this computational challenge. These methods can swiftly generate reliable estimations for problems encompassing 1000 variables in just a few minutes on standard computers. For those interested in practical applications, the code supporting this new approach is made available through the R package BDgraph.
&lt;/p&gt;</description></item></channel></rss>