<rss version="2.0"><channel><title>Chat Arxiv stat.ML</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ML</description><item><title>&#36890;&#36807;&#28909;&#25193;&#25955;&#23454;&#29616;&#20102;&#39640;&#25928;&#30340;&#32452;&#21512;&#20248;&#21270;&#65292;&#20811;&#26381;&#20102;&#29616;&#26377;&#26041;&#27861;&#22312;&#25628;&#32034;&#20840;&#23616;&#26368;&#20248;&#26102;&#25928;&#29575;&#26377;&#38480;&#30340;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2403.08757</link><description>&lt;p&gt;
&#36890;&#36807;&#28909;&#25193;&#25955;&#23454;&#29616;&#39640;&#25928;&#30340;&#32452;&#21512;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
Efficient Combinatorial Optimization via Heat Diffusion
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.08757
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#28909;&#25193;&#25955;&#23454;&#29616;&#20102;&#39640;&#25928;&#30340;&#32452;&#21512;&#20248;&#21270;&#65292;&#20811;&#26381;&#20102;&#29616;&#26377;&#26041;&#27861;&#22312;&#25628;&#32034;&#20840;&#23616;&#26368;&#20248;&#26102;&#25928;&#29575;&#26377;&#38480;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#25506;&#35752;&#20102;&#36890;&#36807;&#28909;&#25193;&#25955;&#26469;&#23454;&#29616;&#39640;&#25928;&#30340;&#32452;&#21512;&#20248;&#21270;&#12290;&#38024;&#23545;&#29616;&#26377;&#26041;&#27861;&#21482;&#33021;&#22312;&#27599;&#27425;&#36845;&#20195;&#20013;&#35775;&#38382;&#35299;&#31354;&#38388;&#30340;&#19968;&#23567;&#37096;&#20998;&#36825;&#19968;&#38480;&#21046;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26694;&#26550;&#26469;&#35299;&#20915;&#19968;&#33324;&#30340;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#65292;&#24182;&#19988;&#22312;&#19968;&#31995;&#21015;&#26368;&#20855;&#25361;&#25112;&#24615;&#21644;&#24191;&#27867;&#36935;&#21040;&#30340;&#32452;&#21512;&#20248;&#21270;&#20013;&#23637;&#29616;&#20986;&#21331;&#36234;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.08757v1 Announce Type: cross  Abstract: Combinatorial optimization problems are widespread but inherently challenging due to their discrete nature.The primary limitation of existing methods is that they can only access a small fraction of the solution space at each iteration, resulting in limited efficiency for searching the global optimal. To overcome this challenge, diverging from conventional efforts of expanding the solver's search scope, we focus on enabling information to actively propagate to the solver through heat diffusion. By transforming the target function while preserving its optima, heat diffusion facilitates information flow from distant regions to the solver, providing more efficient navigation. Utilizing heat diffusion, we propose a framework for solving general combinatorial optimization problems. The proposed methodology demonstrates superior performance across a range of the most challenging and widely encountered combinatorial optimizations. Echoing rec
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#20004;&#20010;&#22522;&#20110;Frank-Wolfe&#31639;&#27861;&#30340;&#26032;&#30340;&#39640;&#25928;&#27714;&#35299;&#22120;&#26469;&#35299;&#20915;&#20559;&#24046;Gromov-Wasserstein&#38382;&#39064;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;PGW&#38382;&#39064;&#26500;&#25104;&#20102;&#24230;&#37327;&#27979;&#24230;&#31354;&#38388;&#30340;&#24230;&#37327;&#12290;</title><link>https://arxiv.org/abs/2402.03664</link><description>&lt;p&gt;
&#39640;&#25928;&#27714;&#35299;&#20559;&#24046;Gromov-Wasserstein&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Efficient Solvers for Partial Gromov-Wasserstein
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.03664
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#20004;&#20010;&#22522;&#20110;Frank-Wolfe&#31639;&#27861;&#30340;&#26032;&#30340;&#39640;&#25928;&#27714;&#35299;&#22120;&#26469;&#35299;&#20915;&#20559;&#24046;Gromov-Wasserstein&#38382;&#39064;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;PGW&#38382;&#39064;&#26500;&#25104;&#20102;&#24230;&#37327;&#27979;&#24230;&#31354;&#38388;&#30340;&#24230;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20559;&#24046;Gromov-Wasserstein&#65288;PGW&#65289;&#38382;&#39064;&#21487;&#20197;&#27604;&#36739;&#20855;&#26377;&#19981;&#22343;&#21248;&#36136;&#37327;&#30340;&#24230;&#37327;&#31354;&#38388;&#20013;&#30340;&#27979;&#24230;&#65292;&#20174;&#32780;&#23454;&#29616;&#36825;&#20123;&#31354;&#38388;&#20043;&#38388;&#30340;&#19981;&#24179;&#34913;&#21644;&#37096;&#20998;&#21305;&#37197;&#12290;&#26412;&#25991;&#35777;&#26126;&#20102;PGW&#38382;&#39064;&#21487;&#20197;&#36716;&#21270;&#20026;Gromov-Wasserstein&#38382;&#39064;&#30340;&#19968;&#20010;&#21464;&#31181;&#65292;&#31867;&#20284;&#20110;&#25226;&#20559;&#24046;&#26368;&#20248;&#36816;&#36755;&#38382;&#39064;&#36716;&#21270;&#20026;&#26368;&#20248;&#36816;&#36755;&#38382;&#39064;&#12290;&#36825;&#20010;&#36716;&#21270;&#23548;&#33268;&#20102;&#20004;&#20010;&#26032;&#30340;&#27714;&#35299;&#22120;&#65292;&#22522;&#20110;Frank-Wolfe&#31639;&#27861;&#65292;&#25968;&#23398;&#21644;&#35745;&#31639;&#19978;&#31561;&#20215;&#65292;&#25552;&#20379;&#20102;&#39640;&#25928;&#30340;PGW&#38382;&#39064;&#35299;&#20915;&#26041;&#26696;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#35777;&#26126;&#20102;PGW&#38382;&#39064;&#26500;&#25104;&#20102;&#24230;&#37327;&#27979;&#24230;&#31354;&#38388;&#30340;&#24230;&#37327;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#19982;&#29616;&#26377;&#22522;&#32447;&#26041;&#27861;&#22312;&#24418;&#29366;&#21305;&#37197;&#21644;&#27491;&#26679;&#26412;&#26410;&#26631;&#35760;&#23398;&#20064;&#38382;&#39064;&#19978;&#30340;&#35745;&#31639;&#26102;&#38388;&#21644;&#24615;&#33021;&#27604;&#36739;&#65292;&#39564;&#35777;&#20102;&#25105;&#20204;&#25552;&#20986;&#30340;&#27714;&#35299;&#22120;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The partial Gromov-Wasserstein (PGW) problem facilitates the comparison of measures with unequal masses residing in potentially distinct metric spaces, thereby enabling unbalanced and partial matching across these spaces. In this paper, we demonstrate that the PGW problem can be transformed into a variant of the Gromov-Wasserstein problem, akin to the conversion of the partial optimal transport problem into an optimal transport problem. This transformation leads to two new solvers, mathematically and computationally equivalent, based on the Frank-Wolfe algorithm, that provide efficient solutions to the PGW problem. We further establish that the PGW problem constitutes a metric for metric measure spaces. Finally, we validate the effectiveness of our proposed solvers in terms of computation time and performance on shape-matching and positive-unlabeled learning problems, comparing them against existing baselines.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#23558;&#21452;&#26426;&#22120;&#23398;&#20064;&#21644;&#27169;&#22411;&#24179;&#22343;&#21270;&#30456;&#32467;&#21512;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#32467;&#26500;&#21442;&#25968;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#36825;&#31181;&#26041;&#27861;&#27604;&#36215;&#24120;&#35265;&#30340;&#22522;&#20110;&#21333;&#19968;&#23398;&#20064;&#22120;&#30340;&#26367;&#20195;&#26041;&#27861;&#26356;&#21152;&#40065;&#26834;&#65292;&#36866;&#29992;&#20110;&#22788;&#29702;&#37096;&#20998;&#26410;&#30693;&#30340;&#20989;&#25968;&#24418;&#24335;&#12290;</title><link>http://arxiv.org/abs/2401.01645</link><description>&lt;p&gt;
&#27169;&#22411;&#24179;&#22343;&#21270;&#21644;&#21452;&#26426;&#22120;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Model Averaging and Double Machine Learning. (arXiv:2401.01645v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.01645
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#23558;&#21452;&#26426;&#22120;&#23398;&#20064;&#21644;&#27169;&#22411;&#24179;&#22343;&#21270;&#30456;&#32467;&#21512;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#32467;&#26500;&#21442;&#25968;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#36825;&#31181;&#26041;&#27861;&#27604;&#36215;&#24120;&#35265;&#30340;&#22522;&#20110;&#21333;&#19968;&#23398;&#20064;&#22120;&#30340;&#26367;&#20195;&#26041;&#27861;&#26356;&#21152;&#40065;&#26834;&#65292;&#36866;&#29992;&#20110;&#22788;&#29702;&#37096;&#20998;&#26410;&#30693;&#30340;&#20989;&#25968;&#24418;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#23558;&#21452;&#37325;/&#26080;&#20559;&#26426;&#22120;&#23398;&#20064;&#65288;DDML&#65289;&#19982;stacking&#65288;&#19968;&#31181;&#27169;&#22411;&#24179;&#22343;&#21270;&#26041;&#27861;&#65292;&#29992;&#20110;&#32467;&#21512;&#22810;&#20010;&#20505;&#36873;&#23398;&#20064;&#22120;&#65289;&#30456;&#32467;&#21512;&#65292;&#29992;&#20110;&#20272;&#35745;&#32467;&#26500;&#21442;&#25968;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#20004;&#31181;&#26032;&#30340;DDML stacking&#26041;&#27861;&#65306;&#30701;stacking&#21033;&#29992;DDML&#30340;&#20132;&#21449;&#25311;&#21512;&#27493;&#39588;&#22823;&#22823;&#20943;&#23569;&#20102;&#35745;&#31639;&#36127;&#25285;&#65292;&#32780;&#27719;&#24635;stacking&#21487;&#20197;&#22312;&#20132;&#21449;&#25311;&#21512;&#30340;&#25240;&#21472;&#19978;&#24378;&#21046;&#25191;&#34892;&#36890;&#29992; stacking&#26435;&#37325;&#12290;&#36890;&#36807;&#32463;&#36807;&#26657;&#20934;&#30340;&#27169;&#25311;&#30740;&#31350;&#21644;&#20004;&#20010;&#24212;&#29992;&#31243;&#24207;&#65292;&#21363;&#20272;&#35745;&#24341;&#29992;&#21644;&#24037;&#36164;&#20013;&#30340;&#24615;&#21035;&#24046;&#36317;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;DDML&#19982;stacking&#30456;&#27604;&#22522;&#20110;&#21333;&#20010;&#39044;&#36873;&#23398;&#20064;&#22120;&#30340;&#24120;&#35265;&#26367;&#20195;&#26041;&#27861;&#23545;&#20110;&#37096;&#20998;&#26410;&#30693;&#30340;&#20989;&#25968;&#24418;&#24335;&#26356;&#21152;&#40065;&#26834;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#23454;&#29616;&#25105;&#20204;&#26041;&#26696;&#30340;Stata&#21644;R&#36719;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper discusses pairing double/debiased machine learning (DDML) with stacking, a model averaging method for combining multiple candidate learners, to estimate structural parameters. We introduce two new stacking approaches for DDML: short-stacking exploits the cross-fitting step of DDML to substantially reduce the computational burden and pooled stacking enforces common stacking weights over cross-fitting folds. Using calibrated simulation studies and two applications estimating gender gaps in citations and wages, we show that DDML with stacking is more robust to partially unknown functional forms than common alternative approaches based on single pre-selected learners. We provide Stata and R software implementing our proposals.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#21452;&#21464;&#37327;&#28145;&#24230;&#20811;&#37324;&#37329;&#30340;&#26041;&#27861;&#65292;&#23427;&#21033;&#29992;&#31354;&#38388;&#30456;&#20851;&#30340;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;(DNN)&#21644;&#23884;&#20837;&#23618;&#20197;&#21450;&#22522;&#20110;&#33258;&#21161;&#27861;&#21644;&#38598;&#25104;DNN&#30340;&#26080;&#20998;&#24067;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#26041;&#27861;&#65292;&#29992;&#20110;&#22823;&#35268;&#27169;&#31354;&#38388;&#25554;&#20540;&#39118;&#22330;&#30340;&#39044;&#27979;&#21644;&#20272;&#35745;&#12290;</title><link>http://arxiv.org/abs/2307.08038</link><description>&lt;p&gt;
&#22823;&#35268;&#27169;&#31354;&#38388;&#25554;&#20540;&#39118;&#22330;&#30340;&#21452;&#21464;&#37327;&#28145;&#24230;&#20811;&#37324;&#37329;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Bivariate DeepKriging for Large-scale Spatial Interpolation of Wind Fields. (arXiv:2307.08038v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.08038
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#21452;&#21464;&#37327;&#28145;&#24230;&#20811;&#37324;&#37329;&#30340;&#26041;&#27861;&#65292;&#23427;&#21033;&#29992;&#31354;&#38388;&#30456;&#20851;&#30340;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;(DNN)&#21644;&#23884;&#20837;&#23618;&#20197;&#21450;&#22522;&#20110;&#33258;&#21161;&#27861;&#21644;&#38598;&#25104;DNN&#30340;&#26080;&#20998;&#24067;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#26041;&#27861;&#65292;&#29992;&#20110;&#22823;&#35268;&#27169;&#31354;&#38388;&#25554;&#20540;&#39118;&#22330;&#30340;&#39044;&#27979;&#21644;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39640;&#31354;&#38388;&#20998;&#36776;&#29575;&#30340;&#39118;&#22330;&#25968;&#25454;&#23545;&#20110;&#27668;&#20505;&#12289;&#28023;&#27915;&#21644;&#27668;&#35937;&#30740;&#31350;&#20013;&#30340;&#21508;&#31181;&#24212;&#29992;&#33267;&#20851;&#37325;&#35201;&#12290;&#30001;&#20110;&#39118;&#25968;&#25454;&#24448;&#24448;&#20855;&#26377;&#38750;&#39640;&#26031;&#20998;&#24067;&#12289;&#39640;&#31354;&#38388;&#21464;&#24322;&#24615;&#21644;&#24322;&#36136;&#24615;&#65292;&#22240;&#27492;&#23545;&#20855;&#26377;&#20004;&#20010;&#32500;&#24230;&#36895;&#24230;&#30340;&#21452;&#21464;&#37327;&#39118;&#22330;&#36827;&#34892;&#22823;&#35268;&#27169;&#31354;&#38388;&#25554;&#20540;&#25110;&#19979;&#32553;&#25918;&#26159;&#19968;&#39033;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20219;&#21153;&#12290;&#22312;&#31354;&#38388;&#32479;&#35745;&#23398;&#20013;&#65292;&#24120;&#29992;cokriging&#26469;&#39044;&#27979;&#21452;&#21464;&#37327;&#31354;&#38388;&#22330;&#12290;&#28982;&#32780;&#65292;cokriging&#39044;&#27979;&#22120;&#38500;&#20102;&#23545;&#39640;&#26031;&#36807;&#31243;&#26377;&#25928;&#22806;&#65292;&#24182;&#19981;&#26159;&#26368;&#20248;&#30340;&#12290;&#27492;&#22806;&#65292;&#23545;&#20110;&#22823;&#22411;&#25968;&#25454;&#38598;&#65292;cokriging&#35745;&#31639;&#37327;&#24040;&#22823;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;&#21452;&#21464;&#37327;&#28145;&#24230;&#20811;&#37324;&#37329;&#30340;&#26041;&#27861;&#65292;&#23427;&#26159;&#19968;&#20010;&#30001;&#31354;&#38388;&#24452;&#21521;&#22522;&#20989;&#25968;&#26500;&#24314;&#30340;&#31354;&#38388;&#30456;&#20851;&#30340;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;(DNN)&#21644;&#23884;&#20837;&#23618;&#65292;&#29992;&#20110;&#21452;&#21464;&#37327;&#31354;&#38388;&#25968;&#25454;&#39044;&#27979;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#22522;&#20110;&#33258;&#21161;&#27861;&#21644;&#38598;&#25104;DNN&#24320;&#21457;&#20102;&#19968;&#31181;&#26080;&#20998;&#24067;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#26041;&#27861;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#26041;&#27861;&#20248;&#20110;&#20256;&#32479;&#30340;cokriging&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
High spatial resolution wind data are essential for a wide range of applications in climate, oceanographic and meteorological studies. Large-scale spatial interpolation or downscaling of bivariate wind fields having velocity in two dimensions is a challenging task because wind data tend to be non-Gaussian with high spatial variability and heterogeneity. In spatial statistics, cokriging is commonly used for predicting bivariate spatial fields. However, the cokriging predictor is not optimal except for Gaussian processes. Additionally, cokriging is computationally prohibitive for large datasets. In this paper, we propose a method, called bivariate DeepKriging, which is a spatially dependent deep neural network (DNN) with an embedding layer constructed by spatial radial basis functions for bivariate spatial data prediction. We then develop a distribution-free uncertainty quantification method based on bootstrap and ensemble DNN. Our proposed approach outperforms the traditional cokriging 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35752;&#35770;&#20102;&#35299;&#20915;&#24191;&#20041;&#33258;&#30001;&#33021;&#65288;FE&#65289;&#30446;&#26631;&#30340;&#21512;&#25104;&#20027;&#21160;&#25512;&#29702;&#20195;&#29702;&#30340;&#21464;&#20998;&#20449;&#24687;&#26356;&#26032;&#21644;&#28040;&#24687;&#20256;&#36882;&#31639;&#27861;&#65292;&#36890;&#36807;&#23545;T&#24418;&#36855;&#23467;&#23548;&#33322;&#20219;&#21153;&#30340;&#27169;&#25311;&#27604;&#36739;&#65292;&#34920;&#26126;AIF&#21487;&#24341;&#36215;&#35748;&#30693;&#34892;&#20026;&#12290;</title><link>http://arxiv.org/abs/2306.02733</link><description>&lt;p&gt;
&#23454;&#29616;&#21512;&#25104;&#20027;&#21160;&#25512;&#29702;&#20195;&#29702;&#65292;&#31532;&#20108;&#37096;&#20998;&#65306;&#21464;&#20998;&#20449;&#24687;&#26356;&#26032;
&lt;/p&gt;
&lt;p&gt;
Realising Synthetic Active Inference Agents, Part II: Variational Message Updates. (arXiv:2306.02733v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.02733
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#35299;&#20915;&#24191;&#20041;&#33258;&#30001;&#33021;&#65288;FE&#65289;&#30446;&#26631;&#30340;&#21512;&#25104;&#20027;&#21160;&#25512;&#29702;&#20195;&#29702;&#30340;&#21464;&#20998;&#20449;&#24687;&#26356;&#26032;&#21644;&#28040;&#24687;&#20256;&#36882;&#31639;&#27861;&#65292;&#36890;&#36807;&#23545;T&#24418;&#36855;&#23467;&#23548;&#33322;&#20219;&#21153;&#30340;&#27169;&#25311;&#27604;&#36739;&#65292;&#34920;&#26126;AIF&#21487;&#24341;&#36215;&#35748;&#30693;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#30001;&#33021;&#21407;&#29702;&#65288;FEP&#65289;&#25551;&#36848;&#29983;&#29289;&#20195;&#29702;&#36890;&#36807;&#30456;&#24212;&#29615;&#22659;&#30340;&#29983;&#25104;&#27169;&#22411;&#26368;&#23567;&#21270;&#21464;&#20998;&#33258;&#30001;&#33021;&#65288;FE&#65289;&#12290;&#20027;&#21160;&#25512;&#29702;&#65288;AIF&#65289;&#26159;FEP&#30340;&#25512;&#35770;&#65292;&#25551;&#36848;&#20102;&#20195;&#29702;&#20154;&#36890;&#36807;&#26368;&#23567;&#21270;&#26399;&#26395;&#30340;FE&#30446;&#26631;&#26469;&#25506;&#32034;&#21644;&#21033;&#29992;&#20854;&#29615;&#22659;&#12290;&#22312;&#20004;&#31687;&#30456;&#20851;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#36890;&#36807;&#33258;&#30001;&#24418;&#24335;Forney-style&#22240;&#23376;&#22270;&#65288;FFG&#65289;&#19978;&#30340;&#28040;&#24687;&#20256;&#36882;&#65292;&#25551;&#36848;&#20102;&#19968;&#31181;&#21487;&#25193;&#23637;&#30340;&#21512;&#25104;AIF&#20195;&#29702;&#30340;&#35748;&#30693;&#26041;&#27861;&#12290;&#26412;&#25991;&#65288;&#31532;&#20108;&#37096;&#20998;&#65289;&#26681;&#25454;&#21464;&#20998;&#28436;&#31639;&#27861;&#65292;&#23548;&#20986;&#20102;&#26368;&#23567;&#21270;CFFG&#19978;&#65288;&#24191;&#20041;&#65289;FE&#30446;&#26631;&#30340;&#28040;&#24687;&#20256;&#36882;&#31639;&#27861;&#12290;&#27604;&#36739;&#20102;&#27169;&#25311;Bethe&#21644;&#24191;&#20041;FE&#20195;&#29702;&#20043;&#38388;&#30340;&#24046;&#24322;&#65292;&#35828;&#26126;&#20102;&#21512;&#25104;AIF&#22914;&#20309;&#22312;T&#24418;&#36855;&#23467;&#23548;&#33322;&#20219;&#21153;&#19978;&#24341;&#36215;&#35748;&#30693;&#34892;&#20026;&#12290;&#36890;&#36807;&#23545;&#21512;&#25104;AIF&#20195;&#29702;&#30340;&#23436;&#25972;&#28040;&#24687;&#20256;&#36882;&#25551;&#36848;&#65292;&#21487;&#20197;&#25512;&#23548;&#21644;&#37325;&#29992;&#35813;&#20195;&#29702;&#22312;&#19981;&#21516;&#29615;&#22659;&#19979;&#30340;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Free Energy Principle (FEP) describes (biological) agents as minimising a variational Free Energy (FE) with respect to a generative model of their environment. Active Inference (AIF) is a corollary of the FEP that describes how agents explore and exploit their environment by minimising an expected FE objective. In two related papers, we describe a scalable, epistemic approach to synthetic AIF agents, by message passing on free-form Forney-style Factor Graphs (FFGs). A companion paper (part I) introduces a Constrained FFG (CFFG) notation that visually represents (generalised) FE objectives for AIF. The current paper (part II) derives message passing algorithms that minimise (generalised) FE objectives on a CFFG by variational calculus. A comparison between simulated Bethe and generalised FE agents illustrates how synthetic AIF induces epistemic behaviour on a T-maze navigation task. With a full message passing account of synthetic AIF agents, it becomes possible to derive and reuse 
&lt;/p&gt;</description></item></channel></rss>