<rss version="2.0"><channel><title>Chat Arxiv stat.ML</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ML</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#29992;&#20110;&#35757;&#32451;&#21152;&#24615;&#27169;&#22411;&#30340;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;&#31639;&#27861;&#65292;&#20855;&#26377;&#33391;&#22909;&#30340;&#20869;&#23384;&#23384;&#20648;&#21644;&#35745;&#31639;&#35201;&#27714;&#12290;&#22312;&#35268;&#33539;&#24456;&#22909;&#30340;&#24773;&#20917;&#19979;&#65292;&#36890;&#36807;&#20180;&#32454;&#36873;&#25321;&#23398;&#20064;&#29575;&#65292;&#21487;&#20197;&#23454;&#29616;&#26368;&#23567;&#21644;&#26368;&#20248;&#30340;&#39118;&#38505;&#12290;</title><link>https://arxiv.org/abs/2401.00691</link><description>&lt;p&gt;
&#28155;&#21152;&#38750;&#21442;&#25968;&#22238;&#24402;&#30340;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;
&lt;/p&gt;
&lt;p&gt;
Stochastic Gradient Descent for Additive Nonparametric Regression
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2401.00691
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#29992;&#20110;&#35757;&#32451;&#21152;&#24615;&#27169;&#22411;&#30340;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;&#31639;&#27861;&#65292;&#20855;&#26377;&#33391;&#22909;&#30340;&#20869;&#23384;&#23384;&#20648;&#21644;&#35745;&#31639;&#35201;&#27714;&#12290;&#22312;&#35268;&#33539;&#24456;&#22909;&#30340;&#24773;&#20917;&#19979;&#65292;&#36890;&#36807;&#20180;&#32454;&#36873;&#25321;&#23398;&#20064;&#29575;&#65292;&#21487;&#20197;&#23454;&#29616;&#26368;&#23567;&#21644;&#26368;&#20248;&#30340;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#29992;&#20110;&#35757;&#32451;&#21152;&#24615;&#27169;&#22411;&#30340;&#36845;&#20195;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#20855;&#26377;&#33391;&#22909;&#30340;&#20869;&#23384;&#23384;&#20648;&#21644;&#35745;&#31639;&#35201;&#27714;&#12290;&#35813;&#31639;&#27861;&#21487;&#20197;&#30475;&#20316;&#26159;&#23545;&#32452;&#20214;&#20989;&#25968;&#30340;&#25130;&#26029;&#22522;&#25193;&#23637;&#30340;&#31995;&#25968;&#24212;&#29992;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;&#30340;&#20989;&#25968;&#23545;&#24212;&#29289;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#24471;&#21040;&#30340;&#20272;&#35745;&#37327;&#28385;&#36275;&#19968;&#20010;&#22885;&#25289;&#20811;&#19981;&#31561;&#24335;&#65292;&#20801;&#35768;&#27169;&#22411;&#38169;&#35823;&#35268;&#33539;&#12290;&#22312;&#35268;&#33539;&#24456;&#22909;&#30340;&#24773;&#20917;&#19979;&#65292;&#36890;&#36807;&#22312;&#35757;&#32451;&#30340;&#19977;&#20010;&#19981;&#21516;&#38454;&#27573;&#20180;&#32454;&#36873;&#25321;&#23398;&#20064;&#29575;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20854;&#39118;&#38505;&#22312;&#25968;&#25454;&#32500;&#24230;&#21644;&#35757;&#32451;&#26679;&#26412;&#22823;&#23567;&#30340;&#20381;&#36182;&#26041;&#38754;&#26159;&#26368;&#23567;&#21644;&#26368;&#20248;&#30340;&#12290;&#36890;&#36807;&#22312;&#20004;&#20010;&#23454;&#38469;&#25968;&#25454;&#38598;&#19978;&#23558;&#35813;&#26041;&#27861;&#19982;&#20256;&#32479;&#30340;&#21453;&#21521;&#25311;&#21512;&#36827;&#34892;&#27604;&#36739;&#65292;&#25105;&#20204;&#36827;&#19968;&#27493;&#35828;&#26126;&#20102;&#35745;&#31639;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper introduces an iterative algorithm for training additive models that enjoys favorable memory storage and computational requirements. The algorithm can be viewed as the functional counterpart of stochastic gradient descent, applied to the coefficients of a truncated basis expansion of the component functions. We show that the resulting estimator satisfies an oracle inequality that allows for model mis-specification. In the well-specified setting, by choosing the learning rate carefully across three distinct stages of training, we demonstrate that its risk is minimax optimal in terms of the dependence on the dimensionality of the data and the size of the training sample. We further illustrate the computational benefits by comparing the approach with traditional backfitting on two real-world datasets.
&lt;/p&gt;</description></item><item><title>&#21482;&#26377;&#24403;&#32771;&#34385;&#30340;&#25439;&#22833;&#20989;&#25968;&#20026;&#20984;&#20989;&#25968;&#26102;&#65292;&#38598;&#25104;&#27169;&#22411;&#19968;&#30452;&#22312;&#21464;&#24471;&#26356;&#22909;&#65292;&#24403;&#25439;&#22833;&#20989;&#25968;&#20026;&#38750;&#20984;&#20989;&#25968;&#26102;&#65292;&#22909;&#27169;&#22411;&#30340;&#38598;&#25104;&#21464;&#24471;&#26356;&#22909;&#65292;&#22351;&#27169;&#22411;&#30340;&#38598;&#25104;&#21464;&#24471;&#26356;&#31967;&#12290;</title><link>https://arxiv.org/abs/2311.17885</link><description>&lt;p&gt;
&#38598;&#25104;&#27169;&#22411;&#26159;&#21542;&#19968;&#30452;&#22312;&#19981;&#26029;&#36827;&#27493;&#65311;
&lt;/p&gt;
&lt;p&gt;
Are Ensembles Getting Better all the Time?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.17885
&lt;/p&gt;
&lt;p&gt;
&#21482;&#26377;&#24403;&#32771;&#34385;&#30340;&#25439;&#22833;&#20989;&#25968;&#20026;&#20984;&#20989;&#25968;&#26102;&#65292;&#38598;&#25104;&#27169;&#22411;&#19968;&#30452;&#22312;&#21464;&#24471;&#26356;&#22909;&#65292;&#24403;&#25439;&#22833;&#20989;&#25968;&#20026;&#38750;&#20984;&#20989;&#25968;&#26102;&#65292;&#22909;&#27169;&#22411;&#30340;&#38598;&#25104;&#21464;&#24471;&#26356;&#22909;&#65292;&#22351;&#27169;&#22411;&#30340;&#38598;&#25104;&#21464;&#24471;&#26356;&#31967;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38598;&#25104;&#26041;&#27861;&#32467;&#21512;&#20102;&#20960;&#20010;&#22522;&#30784;&#27169;&#22411;&#30340;&#39044;&#27979;&#12290;&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#26159;&#21542;&#22987;&#32456;&#23558;&#26356;&#22810;&#27169;&#22411;&#32435;&#20837;&#38598;&#25104;&#20250;&#25552;&#21319;&#20854;&#24179;&#22343;&#24615;&#33021;&#12290;&#36825;&#20010;&#38382;&#39064;&#21462;&#20915;&#20110;&#25152;&#32771;&#34385;&#30340;&#38598;&#25104;&#31867;&#22411;&#65292;&#20197;&#21450;&#36873;&#25321;&#30340;&#39044;&#27979;&#24230;&#37327;&#12290;&#25105;&#20204;&#19987;&#27880;&#20110;&#25152;&#26377;&#38598;&#25104;&#25104;&#21592;&#34987;&#39044;&#26399;&#34920;&#29616;&#30456;&#21516;&#30340;&#24773;&#20917;&#65292;&#36825;&#26159;&#20960;&#31181;&#27969;&#34892;&#26041;&#27861;&#65288;&#22914;&#38543;&#26426;&#26862;&#26519;&#25110;&#28145;&#24230;&#38598;&#25104;&#65289;&#30340;&#24773;&#20917;&#12290;&#22312;&#36825;&#31181;&#35774;&#23450;&#19979;&#65292;&#25105;&#20204;&#34920;&#26126;&#65292;&#21482;&#26377;&#24403;&#32771;&#34385;&#30340;&#25439;&#22833;&#20989;&#25968;&#20026;&#20984;&#20989;&#25968;&#26102;&#65292;&#38598;&#25104;&#25165;&#20250;&#19968;&#30452;&#21464;&#24471;&#26356;&#22909;&#12290;&#26356;&#20855;&#20307;&#22320;&#35828;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#38598;&#25104;&#30340;&#24179;&#22343;&#25439;&#22833;&#26159;&#27169;&#22411;&#25968;&#37327;&#30340;&#20943;&#20989;&#25968;&#12290;&#24403;&#25439;&#22833;&#20989;&#25968;&#20026;&#38750;&#20984;&#20989;&#25968;&#26102;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#19968;&#31995;&#21015;&#32467;&#26524;&#65292;&#21487;&#20197;&#24635;&#32467;&#20026;&#65306;&#22909;&#27169;&#22411;&#30340;&#38598;&#25104;&#20250;&#21464;&#24471;&#26356;&#22909;&#65292;&#22351;&#27169;&#22411;&#30340;&#38598;&#25104;&#20250;&#21464;&#24471;&#26356;&#31967;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20851;&#20110;&#23614;&#27010;&#29575;&#21333;&#35843;&#24615;&#30340;&#26032;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.17885v2 Announce Type: replace-cross  Abstract: Ensemble methods combine the predictions of several base models. We study whether or not including more models always improves their average performance. This question depends on the kind of ensemble considered, as well as the predictive metric chosen. We focus on situations where all members of the ensemble are a priori expected to perform as well, which is the case of several popular methods such as random forests or deep ensembles. In this setting, we show that ensembles are getting better all the time if, and only if, the considered loss function is convex. More precisely, in that case, the average loss of the ensemble is a decreasing function of the number of models. When the loss function is nonconvex, we show a series of results that can be summarised as: ensembles of good models keep getting better, and ensembles of bad models keep getting worse. To this end, we prove a new result on the monotonicity of tail probabiliti
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#27169;&#22411;L&#233;vyGAN&#65292;&#29992;&#20110;&#29983;&#25104;&#26465;&#20214;&#20110;&#24067;&#26391;&#22686;&#37327;&#30340;L&#233;vy&#21306;&#22495;&#30340;&#36817;&#20284;&#26679;&#26412;&#12290;&#36890;&#36807;&#8220;&#26725;&#32763;&#36716;&#8221;&#25805;&#20316;&#65292;&#36755;&#20986;&#30340;&#26679;&#26412;&#21487;&#20197;&#31934;&#30830;&#21305;&#37197;&#25152;&#26377;&#22855;&#25968;&#38454;&#30697;&#65292;&#35299;&#20915;&#20102;&#38750;&#39640;&#26031;&#24615;&#36136;&#19979;&#30340;&#25277;&#26679;&#22256;&#38590;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2308.02452</link><description>&lt;p&gt;
&#23545;&#39640;&#38454;SDE&#27169;&#25311;&#30340;L&#233;vy&#21306;&#22495;&#36827;&#34892;&#29983;&#25104;&#24314;&#27169;
&lt;/p&gt;
&lt;p&gt;
Generative Modelling of L\'{e}vy Area for High Order SDE Simulation. (arXiv:2308.02452v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.02452
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#27169;&#22411;L&#233;vyGAN&#65292;&#29992;&#20110;&#29983;&#25104;&#26465;&#20214;&#20110;&#24067;&#26391;&#22686;&#37327;&#30340;L&#233;vy&#21306;&#22495;&#30340;&#36817;&#20284;&#26679;&#26412;&#12290;&#36890;&#36807;&#8220;&#26725;&#32763;&#36716;&#8221;&#25805;&#20316;&#65292;&#36755;&#20986;&#30340;&#26679;&#26412;&#21487;&#20197;&#31934;&#30830;&#21305;&#37197;&#25152;&#26377;&#22855;&#25968;&#38454;&#30697;&#65292;&#35299;&#20915;&#20102;&#38750;&#39640;&#26031;&#24615;&#36136;&#19979;&#30340;&#25277;&#26679;&#22256;&#38590;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20247;&#25152;&#21608;&#30693;&#65292;&#24403;&#25968;&#20540;&#27169;&#25311;SDE&#30340;&#35299;&#26102;&#65292;&#35201;&#23454;&#29616;&#24378;&#25910;&#25947;&#36895;&#29575;&#36229;&#36807;O(\sqrt{h})&#65288;&#20854;&#20013;h&#20026;&#27493;&#38271;&#65289;&#65292;&#38656;&#35201;&#20351;&#29992;&#26576;&#20123;&#24067;&#26391;&#36816;&#21160;&#30340;&#36845;&#20195;&#31215;&#20998;&#65292;&#36890;&#24120;&#31216;&#20026;&#20854;&#8220;L&#233;vy&#21306;&#22495;&#8221;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#20854;&#38750;&#39640;&#26031;&#24615;&#36136;&#65292;&#23545;&#20110;d&#32500;&#24067;&#26391;&#36816;&#21160;&#65288;d&gt;2&#65289;&#65292;&#30446;&#21069;&#27809;&#26377;&#24555;&#36895;&#36817;&#20284;&#25277;&#26679;&#31639;&#27861;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;L&#233;vyGAN&#65292;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#27169;&#22411;&#65292;&#29992;&#20110;&#29983;&#25104;&#26465;&#20214;&#20110;&#24067;&#26391;&#22686;&#37327;&#30340;L&#233;vy&#21306;&#22495;&#30340;&#36817;&#20284;&#26679;&#26412;&#12290;&#36890;&#36807;&#8220;&#26725;&#32763;&#36716;&#8221;&#25805;&#20316;&#65292;&#36755;&#20986;&#30340;&#26679;&#26412;&#21487;&#20197;&#31934;&#30830;&#21305;&#37197;&#25152;&#26377;&#22855;&#25968;&#38454;&#30697;&#12290;&#25105;&#20204;&#30340;&#29983;&#25104;&#22120;&#37319;&#29992;&#32463;&#36807;&#37327;&#36523;&#23450;&#21046;&#30340;GNN-inspired&#26550;&#26500;&#65292;&#24378;&#21046;&#36755;&#20986;&#20998;&#24067;&#19982;&#26465;&#20214;&#21464;&#37327;&#20043;&#38388;&#30340;&#27491;&#30830;&#20381;&#36182;&#32467;&#26500;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#32467;&#21512;&#20102;&#22522;&#20110;&#29305;&#24449;&#20989;&#25968;&#30340;&#25968;&#23398;&#21407;&#29702;&#30340;&#21028;&#21035;&#24615;&#24402;&#19968;&#21270;&#25805;&#20316;&#12290;
&lt;/p&gt;
&lt;p&gt;
It is well known that, when numerically simulating solutions to SDEs, achieving a strong convergence rate better than O(\sqrt{h}) (where h is the step size) requires the use of certain iterated integrals of Brownian motion, commonly referred to as its "L\'{e}vy areas". However, these stochastic integrals are difficult to simulate due to their non-Gaussian nature and for a d-dimensional Brownian motion with d &gt; 2, no fast almost-exact sampling algorithm is known.  In this paper, we propose L\'{e}vyGAN, a deep-learning-based model for generating approximate samples of L\'{e}vy area conditional on a Brownian increment. Due to our "Bridge-flipping" operation, the output samples match all joint and conditional odd moments exactly. Our generator employs a tailored GNN-inspired architecture, which enforces the correct dependency structure between the output distribution and the conditioning variable. Furthermore, we incorporate a mathematically principled characteristic-function based discrim
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;ScaledGD(&#120582;)&#26041;&#27861;&#65292;&#30456;&#36739;&#20110;&#20256;&#32479;&#26799;&#24230;&#19979;&#38477;&#27861;&#26356;&#21152;&#40065;&#26834;&#65292;&#24182;&#19988;&#22312;&#22788;&#29702;&#20302;&#31209;&#30697;&#38453;&#24863;&#30693;&#38382;&#39064;&#26102;&#20855;&#26377;&#24456;&#22909;&#30340;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2302.01186</link><description>&lt;p&gt;
&#39044;&#26465;&#20214;&#23545;&#36229;&#21442;&#21270;&#20302;&#31209;&#30697;&#38453;&#24863;&#30693;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The Power of Preconditioning in Overparameterized Low-Rank Matrix Sensing. (arXiv:2302.01186v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.01186
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;ScaledGD(&#120582;)&#26041;&#27861;&#65292;&#30456;&#36739;&#20110;&#20256;&#32479;&#26799;&#24230;&#19979;&#38477;&#27861;&#26356;&#21152;&#40065;&#26834;&#65292;&#24182;&#19988;&#22312;&#22788;&#29702;&#20302;&#31209;&#30697;&#38453;&#24863;&#30693;&#38382;&#39064;&#26102;&#20855;&#26377;&#24456;&#22909;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;ScaledGD(&#120582;)&#26041;&#27861;&#26469;&#35299;&#20915;&#20302;&#31209;&#30697;&#38453;&#24863;&#30693;&#20013;&#30697;&#38453;&#21487;&#33021;&#30149;&#24577;&#20197;&#21450;&#30495;&#23454;&#31209;&#26410;&#30693;&#30340;&#38382;&#39064;&#12290;&#35813;&#26041;&#27861;&#20351;&#29992;&#36229;&#21442;&#24335;&#34920;&#31034;&#65292;&#20174;&#19968;&#20010;&#23567;&#30340;&#38543;&#26426;&#21021;&#22987;&#21270;&#24320;&#22987;&#65292;&#36890;&#36807;&#20351;&#29992;&#29305;&#23450;&#24418;&#24335;&#30340;&#38459;&#23612;&#39044;&#26465;&#20214;&#26799;&#24230;&#19979;&#38477;&#26469;&#23545;&#25239;&#36229;&#21442;&#21270;&#21644;&#30149;&#24577;&#26354;&#29575;&#30340;&#24433;&#21709;&#12290;&#19982;&#22522;&#20934;&#26799;&#24230;&#19979;&#38477;&#65288;GD&#65289;&#30456;&#27604;&#65292;&#23613;&#31649;&#39044;&#22788;&#29702;&#38656;&#35201;&#36731;&#24494;&#30340;&#35745;&#31639;&#24320;&#38144;&#65292;&#20294;ScaledGD&#65288;&#120582;&#65289;&#22312;&#38754;&#23545;&#30149;&#24577;&#38382;&#39064;&#26102;&#34920;&#29616;&#20986;&#20102;&#20986;&#33394;&#30340;&#40065;&#26834;&#24615;&#12290;&#22312;&#39640;&#26031;&#35774;&#35745;&#19979;&#65292;ScaledGD($\lambda$) &#20250;&#22312;&#20165;&#36845;&#20195;&#25968;&#23545;&#25968;&#32423;&#21035;&#30340;&#24773;&#20917;&#19979;&#65292;&#20197;&#32447;&#24615;&#36895;&#29575;&#25910;&#25947;&#21040;&#30495;&#23454;&#30340;&#20302;&#31209;&#30697;&#38453;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose $\textsf{ScaledGD($\lambda$)}$, a preconditioned gradient descent method to tackle the low-rank matrix sensing problem when the true rank is unknown, and when the matrix is possibly ill-conditioned. Using overparametrized factor representations, $\textsf{ScaledGD($\lambda$)}$ starts from a small random initialization, and proceeds by gradient descent with a specific form of damped preconditioning to combat bad curvatures induced by overparameterization and ill-conditioning. At the expense of light computational overhead incurred by preconditioners, $\textsf{ScaledGD($\lambda$)}$ is remarkably robust to ill-conditioning compared to vanilla gradient descent ($\textsf{GD}$) even with overprameterization. Specifically, we show that, under the Gaussian design, $\textsf{ScaledGD($\lambda$)}$ converges to the true low-rank matrix at a constant linear rate after a small number of iterations that scales only logarithmically with respect to the condition number and the problem dimensi
&lt;/p&gt;</description></item></channel></rss>