<rss version="2.0"><channel><title>Chat Arxiv stat.ML</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ML</description><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#32479;&#35745;&#20272;&#35745;&#20013;&#30340;&#20998;&#24067;&#20559;&#31227;&#38382;&#39064;&#65292;&#20027;&#35201;&#20851;&#27880;Wasserstein&#20998;&#24067;&#20559;&#31227;&#65292;&#25552;&#20986;&#20102;&#32852;&#21512;&#20998;&#24067;&#20559;&#31227;&#27010;&#24565;&#65292;&#24182;&#20998;&#26512;&#20102;&#20960;&#20010;&#32479;&#35745;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#27861;&#12290;&#35770;&#25991;&#21457;&#29616;&#20102;&#26368;&#20248;&#30340;&#26497;&#23567;&#26497;&#22823;&#39118;&#38505;&#21644;&#26368;&#19981;&#21033;&#30340;&#25200;&#21160;&#65292;&#24182;&#35777;&#26126;&#20102;&#26679;&#26412;&#22343;&#20540;&#21644;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#37327;&#30340;&#20248;&#36234;&#24615;&#12290;</title><link>http://arxiv.org/abs/2308.01853</link><description>&lt;p&gt;
&#32479;&#35745;&#20272;&#35745;&#20013;&#30340;&#20998;&#24067;&#20559;&#31227;: Wasserstein&#25200;&#21160;&#19982;&#26497;&#23567;&#26497;&#22823;&#29702;&#35770;
&lt;/p&gt;
&lt;p&gt;
Statistical Estimation Under Distribution Shift: Wasserstein Perturbations and Minimax Theory. (arXiv:2308.01853v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01853
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#32479;&#35745;&#20272;&#35745;&#20013;&#30340;&#20998;&#24067;&#20559;&#31227;&#38382;&#39064;&#65292;&#20027;&#35201;&#20851;&#27880;Wasserstein&#20998;&#24067;&#20559;&#31227;&#65292;&#25552;&#20986;&#20102;&#32852;&#21512;&#20998;&#24067;&#20559;&#31227;&#27010;&#24565;&#65292;&#24182;&#20998;&#26512;&#20102;&#20960;&#20010;&#32479;&#35745;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#27861;&#12290;&#35770;&#25991;&#21457;&#29616;&#20102;&#26368;&#20248;&#30340;&#26497;&#23567;&#26497;&#22823;&#39118;&#38505;&#21644;&#26368;&#19981;&#21033;&#30340;&#25200;&#21160;&#65292;&#24182;&#35777;&#26126;&#20102;&#26679;&#26412;&#22343;&#20540;&#21644;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#37327;&#30340;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20998;&#24067;&#20559;&#31227;&#26159;&#29616;&#20195;&#32479;&#35745;&#23398;&#20064;&#20013;&#30340;&#19968;&#20010;&#20005;&#37325;&#38382;&#39064;&#65292;&#22240;&#20026;&#23427;&#20204;&#21487;&#20197;&#23558;&#25968;&#25454;&#30340;&#29305;&#24615;&#20174;&#30495;&#23454;&#24773;&#20917;&#20013;&#31995;&#32479;&#22320;&#25913;&#21464;&#12290;&#25105;&#20204;&#19987;&#27880;&#20110;Wasserstein&#20998;&#24067;&#20559;&#31227;&#65292;&#20854;&#20013;&#27599;&#20010;&#25968;&#25454;&#28857;&#21487;&#33021;&#20250;&#21457;&#29983;&#36731;&#24494;&#25200;&#21160;&#65292;&#32780;&#19981;&#26159;Huber&#27745;&#26579;&#27169;&#22411;&#65292;&#20854;&#20013;&#19968;&#37096;&#20998;&#35266;&#27979;&#20540;&#26159;&#24322;&#24120;&#20540;&#12290;&#25105;&#20204;&#25552;&#20986;&#24182;&#30740;&#31350;&#20102;&#36229;&#20986;&#29420;&#31435;&#25200;&#21160;&#30340;&#20559;&#31227;&#65292;&#25506;&#32034;&#20102;&#32852;&#21512;&#20998;&#24067;&#20559;&#31227;&#65292;&#20854;&#20013;&#27599;&#20010;&#35266;&#27979;&#28857;&#30340;&#25200;&#21160;&#21487;&#20197;&#21327;&#35843;&#36827;&#34892;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#20960;&#20010;&#37325;&#35201;&#30340;&#32479;&#35745;&#38382;&#39064;&#65292;&#21253;&#25324;&#20301;&#32622;&#20272;&#35745;&#12289;&#32447;&#24615;&#22238;&#24402;&#21644;&#38750;&#21442;&#25968;&#23494;&#24230;&#20272;&#35745;&#12290;&#22312;&#22343;&#20540;&#20272;&#35745;&#21644;&#32447;&#24615;&#22238;&#24402;&#30340;&#39044;&#27979;&#35823;&#24046;&#26041;&#24046;&#19979;&#65292;&#25105;&#20204;&#25214;&#21040;&#20102;&#31934;&#30830;&#30340;&#26497;&#23567;&#26497;&#22823;&#39118;&#38505;&#12289;&#26368;&#19981;&#21033;&#30340;&#25200;&#21160;&#65292;&#24182;&#35777;&#26126;&#20102;&#26679;&#26412;&#22343;&#20540;&#21644;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#37327;&#20998;&#21035;&#26159;&#26368;&#20248;&#30340;&#12290;&#36825;&#36866;&#29992;&#20110;&#29420;&#31435;&#21644;&#32852;&#21512;&#20559;&#31227;&#65292;&#20294;&#26368;&#19981;&#21033;&#30340;&#25200;&#21160;&#21644;&#26497;&#23567;&#26497;&#22823;&#39118;&#38505;&#26159;&#19981;&#21516;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Distribution shifts are a serious concern in modern statistical learning as they can systematically change the properties of the data away from the truth. We focus on Wasserstein distribution shifts, where every data point may undergo a slight perturbation, as opposed to the Huber contamination model where a fraction of observations are outliers. We formulate and study shifts beyond independent perturbations, exploring Joint Distribution Shifts, where the per-observation perturbations can be coordinated. We analyze several important statistical problems, including location estimation, linear regression, and non-parametric density estimation. Under a squared loss for mean estimation and prediction error in linear regression, we find the exact minimax risk, a least favorable perturbation, and show that the sample mean and least squares estimators are respectively optimal. This holds for both independent and joint shifts, but the least favorable perturbations and minimax risks differ. For
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35889;&#27969;&#24418;&#23545;&#40784;&#21644;&#25512;&#26029;&#65288;SMAI&#65289;&#26694;&#26550;&#65292;&#36890;&#36807;&#25552;&#20379;&#19968;&#31181;&#32479;&#35745;&#26816;&#39564;&#26041;&#27861;&#26469;&#30830;&#23450;&#21333;&#32454;&#32990;&#25968;&#25454;&#38598;&#20043;&#38388;&#30340;&#23545;&#40784;&#24615;&#65292;&#36991;&#20813;&#35823;&#23548;&#24615;&#25512;&#26029;&#65292;&#24182;&#20445;&#25345;&#25968;&#25454;&#25972;&#21512;&#30340;&#32467;&#26500;&#21644;&#21487;&#35299;&#37322;&#24615;&#12290;</title><link>http://arxiv.org/abs/2308.01839</link><description>&lt;p&gt;
&#24744;&#30340;&#25968;&#25454;&#21487;&#23545;&#40784;&#21527;&#65311;&#22522;&#20110;&#21407;&#21017;&#21644;&#21487;&#35299;&#37322;&#24615;&#30340;&#21333;&#32454;&#32990;&#25968;&#25454;&#23545;&#40784;&#24615;&#27979;&#35797;&#21644;&#25972;&#21512;
&lt;/p&gt;
&lt;p&gt;
Is your data alignable? Principled and interpretable alignability testing and integration of single-cell data. (arXiv:2308.01839v1 [q-bio.QM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01839
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35889;&#27969;&#24418;&#23545;&#40784;&#21644;&#25512;&#26029;&#65288;SMAI&#65289;&#26694;&#26550;&#65292;&#36890;&#36807;&#25552;&#20379;&#19968;&#31181;&#32479;&#35745;&#26816;&#39564;&#26041;&#27861;&#26469;&#30830;&#23450;&#21333;&#32454;&#32990;&#25968;&#25454;&#38598;&#20043;&#38388;&#30340;&#23545;&#40784;&#24615;&#65292;&#36991;&#20813;&#35823;&#23548;&#24615;&#25512;&#26029;&#65292;&#24182;&#20445;&#25345;&#25968;&#25454;&#25972;&#21512;&#30340;&#32467;&#26500;&#21644;&#21487;&#35299;&#37322;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21333;&#32454;&#32990;&#25968;&#25454;&#25972;&#21512;&#21487;&#20197;&#25552;&#20379;&#32454;&#32990;&#30340;&#20840;&#38754;&#20998;&#23376;&#35270;&#22270;&#65292;&#24182;&#19988;&#24050;&#32463;&#24320;&#21457;&#20986;&#35768;&#22810;&#31639;&#27861;&#26469;&#28040;&#38500;&#19981;&#38656;&#35201;&#30340;&#25216;&#26415;&#25110;&#29983;&#29289;&#21464;&#24322;&#65292;&#24182;&#25972;&#21512;&#24322;&#36136;&#30340;&#21333;&#32454;&#32990;&#25968;&#25454;&#38598;&#12290;&#23613;&#31649;&#36825;&#20123;&#26041;&#27861;&#34987;&#24191;&#27867;&#20351;&#29992;&#65292;&#20294;&#29616;&#26377;&#26041;&#27861;&#23384;&#22312;&#19968;&#20123;&#22522;&#26412;&#38480;&#21046;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#32570;&#20047;&#19968;&#31181;&#20005;&#35880;&#30340;&#32479;&#35745;&#26816;&#39564;&#26041;&#27861;&#65292;&#29992;&#20110;&#21028;&#26029;&#20004;&#20010;&#39640;&#32500;&#21333;&#32454;&#32990;&#25968;&#25454;&#38598;&#26159;&#21542;&#21487;&#20197;&#23545;&#40784;&#65288;&#22240;&#27492;&#26159;&#21542;&#24212;&#35813;&#36827;&#34892;&#23545;&#40784;&#65289;&#12290;&#27492;&#22806;&#65292;&#27969;&#34892;&#30340;&#26041;&#27861;&#22312;&#23545;&#40784;&#36807;&#31243;&#20013;&#21487;&#33021;&#20250;&#26126;&#26174;&#30072;&#21464;&#25968;&#25454;&#65292;&#20351;&#24471;&#23545;&#40784;&#21518;&#30340;&#25968;&#25454;&#21644;&#19979;&#28216;&#20998;&#26512;&#38590;&#20197;&#35299;&#37322;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#20123;&#38480;&#21046;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#35889;&#27969;&#24418;&#23545;&#40784;&#21644;&#25512;&#26029;&#65288;SMAI&#65289;&#26694;&#26550;&#65292;&#35813;&#26694;&#26550;&#21487;&#20197;&#23454;&#29616;&#22522;&#20110;&#21407;&#21017;&#21644;&#21487;&#35299;&#37322;&#30340;&#21333;&#32454;&#32990;&#25968;&#25454;&#23545;&#40784;&#24615;&#27979;&#35797;&#21644;&#20445;&#25345;&#32467;&#26500;&#30340;&#25972;&#21512;&#12290;SMAI&#25552;&#20379;&#20102;&#19968;&#31181;&#32479;&#35745;&#26816;&#39564;&#26041;&#27861;&#65292;&#33021;&#22815;&#31283;&#20581;&#22320;&#30830;&#23450;&#25968;&#25454;&#38598;&#20043;&#38388;&#30340;&#23545;&#40784;&#24615;&#65292;&#20197;&#36991;&#20813;&#35823;&#23548;&#24615;&#25512;&#26029;&#65292;&#21516;&#26102;&#20854;&#26041;&#27861;&#20063;&#32463;&#36807;&#20102;&#39640;&#32500;&#25968;&#25454;&#30340;&#27491;&#24403;&#24615;&#35777;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
Single-cell data integration can provide a comprehensive molecular view of cells, and many algorithms have been developed to remove unwanted technical or biological variations and integrate heterogeneous single-cell datasets. Despite their wide usage, existing methods suffer from several fundamental limitations. In particular, we lack a rigorous statistical test for whether two high-dimensional single-cell datasets are alignable (and therefore should even be aligned). Moreover, popular methods can substantially distort the data during alignment, making the aligned data and downstream analysis difficult to interpret. To overcome these limitations, we present a spectral manifold alignment and inference (SMAI) framework, which enables principled and interpretable alignability testing and structure-preserving integration of single-cell data. SMAI provides a statistical test to robustly determine the alignability between datasets to avoid misleading inference, and is justified by high-dimen
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20998;&#24067;&#26080;&#20851;&#30340;&#26041;&#27861;&#26469;&#25512;&#26029;&#20108;&#20803;&#20998;&#31867;&#38382;&#39064;&#20013;&#30340;&#22238;&#24402;&#20989;&#25968;&#65292;&#36890;&#36807;&#26500;&#24314;&#32622;&#20449;&#21306;&#38388;&#26469;&#35299;&#20915;&#35813;&#38382;&#39064;&#65292;&#30456;&#20851;&#31639;&#27861;&#32463;&#36807;&#39564;&#35777;&#20855;&#26377;&#21487;&#38752;&#24615;&#12290;</title><link>http://arxiv.org/abs/2308.01835</link><description>&lt;p&gt;
&#20998;&#24067;&#26080;&#20851;&#25512;&#26029;&#20108;&#20803;&#20998;&#31867;&#30340;&#22238;&#24402;&#20989;&#25968;
&lt;/p&gt;
&lt;p&gt;
Distribution-Free Inference for the Regression Function of Binary Classification. (arXiv:2308.01835v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01835
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20998;&#24067;&#26080;&#20851;&#30340;&#26041;&#27861;&#26469;&#25512;&#26029;&#20108;&#20803;&#20998;&#31867;&#38382;&#39064;&#20013;&#30340;&#22238;&#24402;&#20989;&#25968;&#65292;&#36890;&#36807;&#26500;&#24314;&#32622;&#20449;&#21306;&#38388;&#26469;&#35299;&#20915;&#35813;&#38382;&#39064;&#65292;&#30456;&#20851;&#31639;&#27861;&#32463;&#36807;&#39564;&#35777;&#20855;&#26377;&#21487;&#38752;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20108;&#20803;&#20998;&#31867;&#30340;&#19968;&#20010;&#20851;&#38190;&#23545;&#35937;&#26159;&#22238;&#24402;&#20989;&#25968;&#65292;&#21363;&#32473;&#23450;&#36755;&#20837;&#30340;&#31867;&#21035;&#26631;&#31614;&#30340;&#26465;&#20214;&#26399;&#26395;&#12290;&#36890;&#36807;&#22238;&#24402;&#20989;&#25968;&#65292;&#19981;&#20165;&#21487;&#20197;&#23450;&#20041;&#36125;&#21494;&#26031;&#26368;&#20248;&#20998;&#31867;&#22120;&#65292;&#36824;&#21487;&#20197;&#32534;&#30721;&#23545;&#24212;&#30340;&#38169;&#35823;&#20998;&#31867;&#27010;&#29575;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#37325;&#37319;&#26679;&#26694;&#26550;&#65292;&#29992;&#20110;&#26500;&#24314;&#31934;&#30830;&#12289;&#20998;&#24067;&#26080;&#20851;&#19988;&#38750;&#28176;&#36817;&#20445;&#35777;&#30340;&#30495;&#23454;&#22238;&#24402;&#20989;&#25968;&#30340;&#32622;&#20449;&#21306;&#38388;&#65292;&#26681;&#25454;&#29992;&#25143;&#36873;&#25321;&#30340;&#32622;&#20449;&#27700;&#24179;&#12290;&#28982;&#21518;&#65292;&#25552;&#20986;&#20102;&#29305;&#23450;&#30340;&#31639;&#27861;&#26469;&#28436;&#31034;&#35813;&#26694;&#26550;&#12290;&#35777;&#26126;&#20102;&#26500;&#24314;&#30340;&#32622;&#20449;&#21306;&#38388;&#26159;&#24378;&#19968;&#33268;&#30340;&#65292;&#20063;&#23601;&#26159;&#35828;&#65292;&#20219;&#20309;&#38169;&#35823;&#30340;&#27169;&#22411;&#26368;&#32456;&#34987;&#25490;&#38500;&#30340;&#27010;&#29575;&#20026;1&#12290;&#25490;&#38500;&#30340;&#31243;&#24230;&#20063;&#36890;&#36807;&#21487;&#33021;&#36817;&#20284;&#27491;&#30830;&#31867;&#22411;&#30340;&#30028;&#38480;&#36827;&#34892;&#20102;&#37327;&#21270;&#12290;&#26368;&#21518;&#65292;&#36890;&#36807;&#25968;&#20540;&#23454;&#39564;&#39564;&#35777;&#20102;&#31639;&#27861;&#65292;&#24182;&#23558;&#26041;&#27861;&#19982;&#36817;&#20284;&#28176;&#36817;&#32622;&#20449;&#26925;&#22278;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
One of the key objects of binary classification is the regression function, i.e., the conditional expectation of the class labels given the inputs. With the regression function not only a Bayes optimal classifier can be defined, but it also encodes the corresponding misclassification probabilities. The paper presents a resampling framework to construct exact, distribution-free and non-asymptotically guaranteed confidence regions for the true regression function for any user-chosen confidence level. Then, specific algorithms are suggested to demonstrate the framework. It is proved that the constructed confidence regions are strongly consistent, that is, any false model is excluded in the long run with probability one. The exclusion is quantified with probably approximately correct type bounds, as well. Finally, the algorithms are validated via numerical experiments, and the methods are compared to approximate asymptotic confidence ellipsoids.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#32852;&#21512;&#31934;&#31639;&#31070;&#32463;&#32593;&#32476;&#26694;&#26550;&#30340;&#27178;&#26029;&#38754;&#21644;&#32437;&#21521;&#32034;&#36180;&#35745;&#25968;&#27169;&#22411;&#65292;&#36890;&#36807;&#32467;&#21512;&#20256;&#32479;&#31934;&#31639;&#27169;&#22411;&#21644;&#31070;&#32463;&#32593;&#32476;&#65292;&#20805;&#20998;&#21033;&#29992;&#20102;&#20004;&#20010;&#27169;&#22411;&#30340;&#20248;&#21183;&#12290;</title><link>http://arxiv.org/abs/2308.01729</link><description>&lt;p&gt;
&#22522;&#20110;&#32852;&#21512;&#31934;&#31639;&#31070;&#32463;&#32593;&#32476;&#30340;&#27178;&#26029;&#38754;&#21644;&#32437;&#21521;&#32034;&#36180;&#35745;&#25968;&#25968;&#25454;&#30340;&#36710;&#36733;&#36890;&#20449;&#25216;&#26415;
&lt;/p&gt;
&lt;p&gt;
Telematics Combined Actuarial Neural Networks for Cross-Sectional and Longitudinal Claim Count Data. (arXiv:2308.01729v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01729
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#32852;&#21512;&#31934;&#31639;&#31070;&#32463;&#32593;&#32476;&#26694;&#26550;&#30340;&#27178;&#26029;&#38754;&#21644;&#32437;&#21521;&#32034;&#36180;&#35745;&#25968;&#27169;&#22411;&#65292;&#36890;&#36807;&#32467;&#21512;&#20256;&#32479;&#31934;&#31639;&#27169;&#22411;&#21644;&#31070;&#32463;&#32593;&#32476;&#65292;&#20805;&#20998;&#21033;&#29992;&#20102;&#20004;&#20010;&#27169;&#22411;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;Mario W\"uthrich&#21644;Michael Merz&#25552;&#20986;&#30340;&#32852;&#21512;&#31934;&#31639;&#31070;&#32463;&#32593;&#32476;&#65288;CANN&#65289;&#26694;&#26550;&#30340;&#27178;&#26029;&#38754;&#21644;&#32437;&#21521;&#32034;&#36180;&#35745;&#25968;&#27169;&#22411;&#12290;CANN&#26041;&#27861;&#23558;&#20256;&#32479;&#30340;&#31934;&#31639;&#27169;&#22411;&#65288;&#22914;&#24191;&#20041;&#32447;&#24615;&#27169;&#22411;&#65289;&#19982;&#31070;&#32463;&#32593;&#32476;&#30456;&#32467;&#21512;&#65292;&#24418;&#25104;&#20102;&#19968;&#20010;&#21253;&#21547;&#32463;&#20856;&#22238;&#24402;&#27169;&#22411;&#21644;&#31070;&#32463;&#32593;&#32476;&#37096;&#20998;&#30340;&#21452;&#32452;&#20214;&#27169;&#22411;&#12290;CANN&#27169;&#22411;&#20805;&#20998;&#21033;&#29992;&#20102;&#20004;&#20010;&#27169;&#22411;&#30340;&#20248;&#21183;&#65292;&#26082;&#21487;&#20197;&#25552;&#20379;&#32463;&#20856;&#27169;&#22411;&#30340;&#21487;&#38752;&#24615;&#21644;&#21487;&#35299;&#37322;&#24615;&#65292;&#21448;&#21487;&#20197;&#21033;&#29992;&#31070;&#32463;&#32593;&#32476;&#30340;&#28789;&#27963;&#24615;&#21644;&#23545;&#22797;&#26434;&#20851;&#31995;&#21644;&#20132;&#20114;&#20316;&#29992;&#30340;&#25429;&#25417;&#33021;&#21147;&#12290;&#22312;&#25105;&#20204;&#25552;&#20986;&#30340;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;&#24191;&#20026;&#20154;&#30693;&#30340;&#23545;&#25968;&#32447;&#24615;&#32034;&#36180;&#35745;&#25968;&#22238;&#24402;&#27169;&#22411;&#20316;&#20026;&#32463;&#20856;&#22238;&#24402;&#37096;&#20998;&#65292;&#20351;&#29992;&#20102;&#22810;&#23618;&#24863;&#30693;&#22120;&#65288;MLP&#65289;&#20316;&#20026;&#31070;&#32463;&#32593;&#32476;&#37096;&#20998;&#12290;MLP&#37096;&#20998;&#29992;&#20110;&#22788;&#29702;&#20197;&#21521;&#37327;&#24418;&#24335;&#34920;&#31034;&#30340;&#36710;&#36742;&#39550;&#39542;&#34892;&#20026;&#30340;&#36710;&#36733;&#36890;&#20449;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present novel cross-sectional and longitudinal claim count models for vehicle insurance built upon the Combined Actuarial Neural Network (CANN) framework proposed by Mario W\"uthrich and Michael Merz. The CANN approach combines a classical actuarial model, such as a generalized linear model, with a neural network. This blending of models results in a two-component model comprising a classical regression model and a neural network part. The CANN model leverages the strengths of both components, providing a solid foundation and interpretability from the classical model while harnessing the flexibility and capacity to capture intricate relationships and interactions offered by the neural network. In our proposed models, we use well-known log-linear claim count regression models for the classical regression part and a multilayer perceptron (MLP) for the neural network part. The MLP part is used to process telematics car driving data given as a vector characterizing the driving behavior 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22522;&#20110;&#24352;&#37327;&#26680;&#33539;&#25968;&#30340;&#32422;&#26463;&#26368;&#23567;&#21270;&#26041;&#27861;&#22312;&#20302;&#31209;&#24352;&#37327;&#24674;&#22797;&#20013;&#30340;&#26377;&#25928;&#24615;&#65292;&#25552;&#20986;&#20102;&#36866;&#24403;&#30340;&#20005;&#26684;&#20114;&#34917;&#24615;&#26465;&#20214;&#65292;&#24182;&#19988;&#24471;&#21040;&#20102;&#22312;&#27492;&#26465;&#20214;&#19979;&#30340;&#20027;&#35201;&#32467;&#26524;&#65306;1.&#23545;&#20110;&#29305;&#23450;&#24418;&#24335;&#30340;&#30446;&#26631;&#20989;&#25968;&#65292;&#26631;&#20934;&#25237;&#24433;&#26799;&#24230;&#26041;&#27861;&#20855;&#26377;&#32447;&#24615;&#25910;&#25947;&#36895;&#24230;&#65292;&#23613;&#31649;&#30446;&#26631;&#20989;&#25968;&#19981;&#19968;&#23450;&#26159;&#24378;&#20984;&#30340;&#12290;2.&#23545;&#20110;&#20809;&#28369;&#30340;&#30446;&#26631;&#20989;&#25968;&#65292;&#26631;&#20934;&#26799;&#24230;&#26041;&#27861;&#30340;&#25910;&#25947;&#36895;&#24230;&#21644;&#27599;&#27425;&#36845;&#20195;&#30340;&#36816;&#34892;&#26102;&#38388;&#21487;&#33021;&#26174;&#33879;&#25552;&#39640;&#12290;</title><link>http://arxiv.org/abs/2308.01677</link><description>&lt;p&gt;
&#21033;&#29992;&#24352;&#37327;&#26680;&#33539;&#25968;&#21644;&#20005;&#26684;&#20114;&#34917;&#24615;&#36827;&#34892;&#20302;&#31209;&#24352;&#37327;&#24674;&#22797;&#30340;&#19968;&#38454;&#26041;&#27861;&#30340;&#25928;&#29575;
&lt;/p&gt;
&lt;p&gt;
Efficiency of First-Order Methods for Low-Rank Tensor Recovery with the Tensor Nuclear Norm Under Strict Complementarity. (arXiv:2308.01677v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01677
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22522;&#20110;&#24352;&#37327;&#26680;&#33539;&#25968;&#30340;&#32422;&#26463;&#26368;&#23567;&#21270;&#26041;&#27861;&#22312;&#20302;&#31209;&#24352;&#37327;&#24674;&#22797;&#20013;&#30340;&#26377;&#25928;&#24615;&#65292;&#25552;&#20986;&#20102;&#36866;&#24403;&#30340;&#20005;&#26684;&#20114;&#34917;&#24615;&#26465;&#20214;&#65292;&#24182;&#19988;&#24471;&#21040;&#20102;&#22312;&#27492;&#26465;&#20214;&#19979;&#30340;&#20027;&#35201;&#32467;&#26524;&#65306;1.&#23545;&#20110;&#29305;&#23450;&#24418;&#24335;&#30340;&#30446;&#26631;&#20989;&#25968;&#65292;&#26631;&#20934;&#25237;&#24433;&#26799;&#24230;&#26041;&#27861;&#20855;&#26377;&#32447;&#24615;&#25910;&#25947;&#36895;&#24230;&#65292;&#23613;&#31649;&#30446;&#26631;&#20989;&#25968;&#19981;&#19968;&#23450;&#26159;&#24378;&#20984;&#30340;&#12290;2.&#23545;&#20110;&#20809;&#28369;&#30340;&#30446;&#26631;&#20989;&#25968;&#65292;&#26631;&#20934;&#26799;&#24230;&#26041;&#27861;&#30340;&#25910;&#25947;&#36895;&#24230;&#21644;&#27599;&#27425;&#36845;&#20195;&#30340;&#36816;&#34892;&#26102;&#38388;&#21487;&#33021;&#26174;&#33879;&#25552;&#39640;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#22522;&#20110;&#24352;&#37327;&#26680;&#33539;&#25968;&#35825;&#23548;&#30340;&#29699;&#19978;&#30340;&#32422;&#26463;&#26368;&#23567;&#21270;&#30340;&#20984;&#26494;&#24347;&#26041;&#27861;&#65292;&#29992;&#20110;&#20302;&#31209;&#24352;&#37327;&#24674;&#22797;&#12290;&#25105;&#20204;&#20511;&#37492;&#20102;&#26368;&#36817;&#30340;&#19968;&#31995;&#21015;&#32467;&#26524;&#65292;&#36825;&#20123;&#32467;&#26524;&#32771;&#34385;&#20102;&#29992;&#20110;&#24674;&#22797;&#20302;&#31209;&#30697;&#38453;&#30340;&#20984;&#26494;&#24347;&#26041;&#27861;&#65292;&#24182;&#19988;&#24050;&#32463;&#24314;&#31435;&#20102;&#22312;&#20005;&#26684;&#20114;&#34917;&#24615;&#26465;&#20214;&#19979;&#65292;&#26631;&#20934;&#26799;&#24230;&#26041;&#27861;&#30340;&#25910;&#25947;&#36895;&#24230;&#21644;&#27599;&#27425;&#36845;&#20195;&#30340;&#36816;&#34892;&#26102;&#38388;&#21487;&#33021;&#26174;&#33879;&#25552;&#39640;&#12290;&#25105;&#20204;&#38024;&#23545;&#24352;&#37327;&#26680;&#33539;&#25968;&#29699;&#20307;&#24320;&#21457;&#20102;&#36866;&#24403;&#30340;&#20005;&#26684;&#20114;&#34917;&#24615;&#26465;&#20214;&#65292;&#24182;&#33719;&#24471;&#20102;&#20197;&#19979;&#20027;&#35201;&#32467;&#26524;&#65306;1. &#24403;&#35201;&#26368;&#23567;&#21270;&#30340;&#30446;&#26631;&#20855;&#26377;&#24418;&#24335;$f(\mX)=g(\mA\mX)+\langle{\mC,\mX}\rangle$&#65292;&#20854;&#20013;$g$&#26159;&#24378;&#20984;&#20989;&#25968;&#65292;$\mA$&#26159;&#19968;&#20010;&#32447;&#24615;&#26144;&#23556;&#65288;&#20363;&#22914;&#26368;&#23567;&#20108;&#20056;&#27861;&#65289;&#65292;&#23384;&#22312;&#20108;&#27425;&#22686;&#38271;&#30028;&#65292;&#36825;&#24847;&#21619;&#30528;&#26631;&#20934;&#25237;&#24433;&#26799;&#24230;&#26041;&#27861;&#20855;&#26377;&#32447;&#24615;&#25910;&#25947;&#36895;&#24230;&#65292;&#23613;&#31649;$f$&#19981;&#19968;&#23450;&#26159;&#24378;&#20984;&#30340;&#12290;2.&#23545;&#20110;&#20809;&#28369;&#30340;&#30446;&#26631;&#20989;&#25968;&#65292;
&lt;/p&gt;
&lt;p&gt;
We consider convex relaxations for recovering low-rank tensors based on constrained minimization over a ball induced by the tensor nuclear norm, recently introduced in \cite{tensor_tSVD}. We build on a recent line of results that considered convex relaxations for the recovery of low-rank matrices and established that under a strict complementarity condition (SC), both the convergence rate and per-iteration runtime of standard gradient methods may improve dramatically. We develop the appropriate strict complementarity condition for the tensor nuclear norm ball and obtain the following main results under this condition: 1. When the objective to minimize is of the form $f(\mX)=g(\mA\mX)+\langle{\mC,\mX}\rangle$ , where $g$ is strongly convex and $\mA$ is a linear map (e.g., least squares), a quadratic growth bound holds, which implies linear convergence rates for standard projected gradient methods, despite the fact that $f$ need not be strongly convex. 2. For a smooth objective function,
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#22312;&#30005;&#23376;&#20581;&#24247;&#35760;&#24405;&#20013;&#20351;&#29992;&#22240;&#26524;&#24605;&#32500;&#36827;&#34892;&#20915;&#31574;&#30340;&#24517;&#35201;&#24615;&#21644;&#26041;&#27861;&#12290;&#36890;&#36807;&#27169;&#25311;&#38543;&#26426;&#35797;&#39564;&#26469;&#20010;&#24615;&#21270;&#20915;&#31574;&#65292;&#20197;&#20943;&#23569;&#25968;&#25454;&#20013;&#30340;&#20559;&#35265;&#12290;&#36825;&#23545;&#20110;&#20998;&#26512;&#30005;&#23376;&#20581;&#24247;&#35760;&#24405;&#25110;&#32034;&#36180;&#25968;&#25454;&#20197;&#24471;&#20986;&#22240;&#26524;&#32467;&#35770;&#30340;&#26368;&#37325;&#35201;&#38519;&#38449;&#21644;&#32771;&#34385;&#22240;&#32032;&#36827;&#34892;&#20102;&#37325;&#28857;&#24378;&#35843;&#12290;</title><link>http://arxiv.org/abs/2308.01605</link><description>&lt;p&gt;
&#29992;&#20110;&#20915;&#31574;&#30340;&#22240;&#26524;&#24605;&#32500;&#22312;&#30005;&#23376;&#20581;&#24247;&#35760;&#24405;&#20013;&#30340;&#24212;&#29992;&#65306;&#20026;&#20160;&#20040;&#20197;&#21450;&#22914;&#20309;
&lt;/p&gt;
&lt;p&gt;
Causal thinking for decision making on Electronic Health Records: why and how. (arXiv:2308.01605v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01605
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#22312;&#30005;&#23376;&#20581;&#24247;&#35760;&#24405;&#20013;&#20351;&#29992;&#22240;&#26524;&#24605;&#32500;&#36827;&#34892;&#20915;&#31574;&#30340;&#24517;&#35201;&#24615;&#21644;&#26041;&#27861;&#12290;&#36890;&#36807;&#27169;&#25311;&#38543;&#26426;&#35797;&#39564;&#26469;&#20010;&#24615;&#21270;&#20915;&#31574;&#65292;&#20197;&#20943;&#23569;&#25968;&#25454;&#20013;&#30340;&#20559;&#35265;&#12290;&#36825;&#23545;&#20110;&#20998;&#26512;&#30005;&#23376;&#20581;&#24247;&#35760;&#24405;&#25110;&#32034;&#36180;&#25968;&#25454;&#20197;&#24471;&#20986;&#22240;&#26524;&#32467;&#35770;&#30340;&#26368;&#37325;&#35201;&#38519;&#38449;&#21644;&#32771;&#34385;&#22240;&#32032;&#36827;&#34892;&#20102;&#37325;&#28857;&#24378;&#35843;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20934;&#30830;&#30340;&#39044;&#27979;&#65292;&#22914;&#21516;&#26426;&#22120;&#23398;&#20064;&#19968;&#26679;&#65292;&#21487;&#33021;&#26080;&#27861;&#20026;&#27599;&#20010;&#24739;&#32773;&#25552;&#20379;&#26368;&#20339;&#21307;&#30103;&#20445;&#20581;&#12290;&#30830;&#23454;&#65292;&#39044;&#27979;&#21487;&#33021;&#21463;&#21040;&#25968;&#25454;&#20013;&#30340;&#25463;&#24452;&#65288;&#22914;&#31181;&#26063;&#20559;&#35265;&#65289;&#30340;&#39537;&#21160;&#12290;&#20026;&#25968;&#25454;&#39537;&#21160;&#30340;&#20915;&#31574;&#38656;&#35201;&#22240;&#26524;&#24605;&#32500;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#20171;&#32461;&#20851;&#38190;&#35201;&#32032;&#65292;&#37325;&#28857;&#20851;&#27880;&#24120;&#35268;&#25910;&#38598;&#30340;&#25968;&#25454;&#65292;&#21363;&#30005;&#23376;&#20581;&#24247;&#35760;&#24405;&#65288;EHRs&#65289;&#21644;&#32034;&#36180;&#25968;&#25454;&#12290;&#20351;&#29992;&#36825;&#20123;&#25968;&#25454;&#35780;&#20272;&#24178;&#39044;&#30340;&#20215;&#20540;&#38656;&#35201;&#35880;&#24910;&#65306;&#26102;&#38388;&#20381;&#36182;&#24615;&#21644;&#29616;&#26377;&#23454;&#36341;&#24456;&#23481;&#26131;&#28151;&#28102;&#22240;&#26524;&#25928;&#24212;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#36880;&#27493;&#26694;&#26550;&#65292;&#24110;&#21161;&#20174;&#30495;&#23454;&#24739;&#32773;&#35760;&#24405;&#20013;&#26500;&#24314;&#26377;&#25928;&#30340;&#20915;&#31574;&#65292;&#36890;&#36807;&#27169;&#25311;&#38543;&#26426;&#35797;&#39564;&#26469;&#20010;&#24615;&#21270;&#20915;&#31574;&#65292;&#20363;&#22914;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#24378;&#35843;&#20102;&#20998;&#26512;EHRs&#25110;&#32034;&#36180;&#25968;&#25454;&#20197;&#24471;&#20986;&#22240;&#26524;&#32467;&#35770;&#26102;&#26368;&#37325;&#35201;&#30340;&#38519;&#38449;&#21644;&#32771;&#34385;&#22240;&#32032;&#12290;&#25105;&#20204;&#22312;&#29992;&#20110;&#37325;&#30151;&#21307;&#23398;&#20449;&#24687;&#24066;&#22330;&#20013;&#30340;&#32908;&#37200;&#23545;&#36133;&#34880;&#30151;&#27515;&#20129;&#29575;&#30340;&#24433;&#21709;&#30340;&#30740;&#31350;&#20013;&#35828;&#26126;&#20102;&#21508;&#31181;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;
Accurate predictions, as with machine learning, may not suffice to provide optimal healthcare for every patient. Indeed, prediction can be driven by shortcuts in the data, such as racial biases. Causal thinking is needed for data-driven decisions. Here, we give an introduction to the key elements, focusing on routinely-collected data, electronic health records (EHRs) and claims data. Using such data to assess the value of an intervention requires care: temporal dependencies and existing practices easily confound the causal effect. We present a step-by-step framework to help build valid decision making from real-life patient records by emulating a randomized trial before individualizing decisions, eg with machine learning. Our framework highlights the most important pitfalls and considerations in analysing EHRs or claims data to draw causal conclusions. We illustrate the various choices in studying the effect of albumin on sepsis mortality in the Medical Information Mart for Intensive C
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#24555;&#36895;Slate&#31574;&#30053;&#20248;&#21270;&#26041;&#27861;&#65292;&#36890;&#36807;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;&#31574;&#30053;&#31867;&#65292;&#21487;&#20197;&#22312;&#22823;&#35268;&#27169;&#20915;&#31574;&#31995;&#32479;&#20013;&#26377;&#25928;&#22320;&#20248;&#21270;&#20219;&#24847;&#22870;&#21169;&#20989;&#25968;&#65292;&#32467;&#26524;&#34920;&#26126;&#35813;&#26041;&#27861;&#22312;&#30334;&#19975;&#32423;&#21035;&#21160;&#20316;&#31354;&#38388;&#38382;&#39064;&#19978;&#20855;&#26377;&#24456;&#22909;&#30340;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2308.01566</link><description>&lt;p&gt;
&#24555;&#36895;Slate&#31574;&#30053;&#20248;&#21270;&#65306;&#36229;&#36234;Plackett-Luce
&lt;/p&gt;
&lt;p&gt;
Fast Slate Policy Optimization: Going Beyond Plackett-Luce. (arXiv:2308.01566v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01566
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#24555;&#36895;Slate&#31574;&#30053;&#20248;&#21270;&#26041;&#27861;&#65292;&#36890;&#36807;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;&#31574;&#30053;&#31867;&#65292;&#21487;&#20197;&#22312;&#22823;&#35268;&#27169;&#20915;&#31574;&#31995;&#32479;&#20013;&#26377;&#25928;&#22320;&#20248;&#21270;&#20219;&#24847;&#22870;&#21169;&#20989;&#25968;&#65292;&#32467;&#26524;&#34920;&#26126;&#35813;&#26041;&#27861;&#22312;&#30334;&#19975;&#32423;&#21035;&#21160;&#20316;&#31354;&#38388;&#38382;&#39064;&#19978;&#20855;&#26377;&#24456;&#22909;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#35268;&#27169;&#26426;&#22120;&#23398;&#20064;&#31995;&#32479;&#20013;&#19968;&#20010;&#36234;&#26469;&#36234;&#37325;&#35201;&#30340;&#26500;&#24314;&#27169;&#22359;&#26159;&#36820;&#22238;Slate&#65292;&#21363;&#32473;&#23450;&#19968;&#20010;&#26597;&#35810;&#36820;&#22238;&#26377;&#24207;&#30340;&#39033;&#30446;&#21015;&#34920;&#12290;&#35813;&#25216;&#26415;&#30340;&#24212;&#29992;&#21253;&#25324;&#25628;&#32034;&#12289;&#20449;&#24687;&#26816;&#32034;&#21644;&#25512;&#33616;&#31995;&#32479;&#12290;&#24403;&#34892;&#21160;&#31354;&#38388;&#24456;&#22823;&#26102;&#65292;&#20915;&#31574;&#31995;&#32479;&#20250;&#38480;&#21046;&#22312;&#29305;&#23450;&#32467;&#26500;&#20013;&#20197;&#24555;&#36895;&#23436;&#25104;&#22312;&#32447;&#26597;&#35810;&#12290;&#26412;&#25991;&#35299;&#20915;&#20102;&#36825;&#20123;&#22823;&#35268;&#27169;&#20915;&#31574;&#31995;&#32479;&#22312;&#32473;&#23450;&#20219;&#24847;&#22870;&#21169;&#20989;&#25968;&#19979;&#30340;&#20248;&#21270;&#38382;&#39064;&#12290;&#25105;&#20204;&#23558;&#36825;&#20010;&#23398;&#20064;&#38382;&#39064;&#36716;&#21270;&#20026;&#31574;&#30053;&#20248;&#21270;&#26694;&#26550;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31574;&#30053;&#31867;&#65292;&#23427;&#28304;&#20110;&#20915;&#31574;&#20989;&#25968;&#30340;&#19968;&#31181;&#26032;&#39062;&#25918;&#26494;&#12290;&#36825;&#23548;&#33268;&#20102;&#19968;&#20010;&#31616;&#21333;&#32780;&#39640;&#25928;&#30340;&#23398;&#20064;&#31639;&#27861;&#65292;&#21487;&#20197;&#25193;&#23637;&#21040;&#22823;&#35268;&#27169;&#30340;&#21160;&#20316;&#31354;&#38388;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#26041;&#27861;&#19982;&#24120;&#29992;&#30340;Plackett-Luce&#31574;&#30053;&#31867;&#36827;&#34892;&#27604;&#36739;&#65292;&#24182;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#21160;&#20316;&#31354;&#38388;&#22823;&#23567;&#36798;&#21040;&#30334;&#19975;&#32423;&#21035;&#30340;&#38382;&#39064;&#19978;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
An increasingly important building block of large scale machine learning systems is based on returning slates; an ordered lists of items given a query. Applications of this technology include: search, information retrieval and recommender systems. When the action space is large, decision systems are restricted to a particular structure to complete online queries quickly. This paper addresses the optimization of these large scale decision systems given an arbitrary reward function. We cast this learning problem in a policy optimization framework and propose a new class of policies, born from a novel relaxation of decision functions. This results in a simple, yet efficient learning algorithm that scales to massive action spaces. We compare our method to the commonly adopted Plackett-Luce policy class and demonstrate the effectiveness of our approach on problems with action space sizes in the order of millions.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#26080;&#24207;&#31995;&#32479;&#20013;&#30340;&#26032;&#20852;&#26234;&#33021;&#34892;&#20026;&#65292;&#24182;&#36890;&#36807;&#32479;&#35745;&#29289;&#29702;&#23398;&#25506;&#32034;&#23398;&#20064;&#26426;&#21046;&#21644;&#29289;&#29702;&#21160;&#21147;&#23398;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#20197;&#27492;&#20026;&#25351;&#23548;&#21407;&#21017;&#35774;&#35745;&#26234;&#33021;&#31995;&#32479;&#12290;</title><link>http://arxiv.org/abs/2308.01538</link><description>&lt;p&gt;
&#38750;&#24179;&#34913;&#29289;&#29702;&#23398;&#65306;&#20174;&#33258;&#26059;&#29627;&#29827;&#21040;&#26426;&#22120;&#21644;&#31070;&#32463;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Non-equilibrium physics: from spin glasses to machine and neural learning. (arXiv:2308.01538v1 [cond-mat.dis-nn])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01538
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#26080;&#24207;&#31995;&#32479;&#20013;&#30340;&#26032;&#20852;&#26234;&#33021;&#34892;&#20026;&#65292;&#24182;&#36890;&#36807;&#32479;&#35745;&#29289;&#29702;&#23398;&#25506;&#32034;&#23398;&#20064;&#26426;&#21046;&#21644;&#29289;&#29702;&#21160;&#21147;&#23398;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#20197;&#27492;&#20026;&#25351;&#23548;&#21407;&#21017;&#35774;&#35745;&#26234;&#33021;&#31995;&#32479;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26080;&#24207;&#22810;&#20307;&#31995;&#32479;&#22312;&#19981;&#21516;&#23610;&#24230;&#19978;&#34920;&#29616;&#20986;&#20102;&#21508;&#31181;&#21508;&#26679;&#30340;&#26032;&#20852;&#29616;&#35937;&#12290;&#36825;&#20123;&#22797;&#26434;&#34892;&#20026;&#21487;&#20197;&#29992;&#20110;&#38169;&#35823;&#20462;&#27491;&#12289;&#23398;&#20064;&#21644;&#20248;&#21270;&#31561;&#21508;&#31181;&#20449;&#24687;&#22788;&#29702;&#20219;&#21153;&#12290;&#23613;&#31649;&#21033;&#29992;&#36825;&#20123;&#31995;&#32479;&#36827;&#34892;&#26234;&#33021;&#20219;&#21153;&#30340;&#32463;&#39564;&#25104;&#26524;&#26174;&#33879;&#65292;&#20294;&#20854;&#20986;&#29616;&#30340;&#26234;&#33021;&#34892;&#20026;&#30340;&#22522;&#26412;&#21407;&#21017;&#20173;&#28982;&#22823;&#37096;&#20998;&#26410;&#30693;&#12290;&#22312;&#26412;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#26088;&#22312;&#36890;&#36807;&#32479;&#35745;&#29289;&#29702;&#23398;&#26469;&#34920;&#24449;&#26080;&#24207;&#31995;&#32479;&#20013;&#30340;&#36825;&#31181;&#26032;&#20852;&#26234;&#33021;&#12290;&#25105;&#20204;&#26681;&#25454;&#23398;&#20064;&#26426;&#21046;&#65288;&#38271;&#26399;&#35760;&#24518; vs. &#24037;&#20316;&#35760;&#24518;&#65289;&#21644;&#23398;&#20064;&#21160;&#21147;&#23398;&#65288;&#20154;&#24037; vs. &#33258;&#28982;&#65289;&#36825;&#20004;&#20010;&#26041;&#38754;&#21046;&#23450;&#20102;&#25105;&#20204;&#22312;&#35770;&#25991;&#20013;&#30340;&#21162;&#21147;&#30340;&#36335;&#32447;&#22270;&#12290;&#22312;&#25105;&#20204;&#30340;&#30740;&#31350;&#36807;&#31243;&#20013;&#65292;&#25105;&#20204;&#25581;&#31034;&#20102;&#23398;&#20064;&#26426;&#21046;&#21644;&#29289;&#29702;&#21160;&#21147;&#23398;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#36825;&#20123;&#20851;&#31995;&#21487;&#20197;&#20316;&#20026;&#35774;&#35745;&#26234;&#33021;&#31995;&#32479;&#30340;&#25351;&#23548;&#21407;&#21017;&#12290;&#25105;&#20204;&#24076;&#26395;&#36890;&#36807;&#23545;&#30475;&#20284;&#19981;&#30456;&#20851;&#30340;&#23398;&#20064;&#31995;&#32479;&#30340;&#26032;&#20852;&#26234;&#33021;&#30340;&#30740;&#31350;&#65292;&#33021;&#22815;&#25193;&#23637;&#25105;&#20204;&#24403;&#21069;&#30340;&#35748;&#35782;&#12290;
&lt;/p&gt;
&lt;p&gt;
Disordered many-body systems exhibit a wide range of emergent phenomena across different scales. These complex behaviors can be utilized for various information processing tasks such as error correction, learning, and optimization. Despite the empirical success of utilizing these systems for intelligent tasks, the underlying principles that govern their emergent intelligent behaviors remain largely unknown. In this thesis, we aim to characterize such emergent intelligence in disordered systems through statistical physics. We chart a roadmap for our efforts in this thesis based on two axes: learning mechanisms (long-term memory vs. working memory) and learning dynamics (artificial vs. natural). Throughout our journey, we uncover relationships between learning mechanisms and physical dynamics that could serve as guiding principles for designing intelligent systems. We hope that our investigation into the emergent intelligence of seemingly disparate learning systems can expand our current
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#26032;&#30340;&#20855;&#26377;&#26368;&#36817;&#37051;&#30340;$Q$&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#36830;&#32493;&#29366;&#24577;&#31354;&#38388;&#19979;&#25910;&#25947;&#36895;&#24230;&#24046;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2308.01490</link><description>&lt;p&gt;
&#20855;&#26377;&#26368;&#36817;&#37051;&#30340;&#26497;&#23567;&#26497;&#22823;&#26368;&#20248;$Q$&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Minimax Optimal $Q$ Learning with Nearest Neighbors. (arXiv:2308.01490v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01490
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#26032;&#30340;&#20855;&#26377;&#26368;&#36817;&#37051;&#30340;$Q$&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#36830;&#32493;&#29366;&#24577;&#31354;&#38388;&#19979;&#25910;&#25947;&#36895;&#24230;&#24046;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
$Q$&#23398;&#20064;&#26159;&#19968;&#31181;&#24120;&#35265;&#30340;&#26080;&#27169;&#22411;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#12290;&#29616;&#26377;&#30340;&#22823;&#37096;&#20998;&#24037;&#20316;&#38598;&#20013;&#22312;&#20998;&#26512;&#26377;&#38480;&#29366;&#24577;&#21644;&#21160;&#20316;&#31354;&#38388;&#30340;$Q$&#23398;&#20064;&#12290;&#22914;&#26524;&#29366;&#24577;&#31354;&#38388;&#26159;&#36830;&#32493;&#30340;&#65292;&#37027;&#20040;&#21407;&#22987;&#30340;$Q$&#23398;&#20064;&#26041;&#27861;&#23601;&#26080;&#27861;&#30452;&#25509;&#20351;&#29992;&#12290;(Shah and Xie, 2018) &#25552;&#20986;&#20102;&#21407;&#22987;$Q$&#23398;&#20064;&#26041;&#27861;&#30340;&#20462;&#25913;&#29256;&#65292;&#29992;&#26368;&#36817;&#37051;&#26041;&#27861;&#20272;&#35745;$Q$&#20540;&#12290;&#36825;&#31181;&#20462;&#25913;&#20351;&#24471;$Q$&#23398;&#20064;&#36866;&#29992;&#20110;&#36830;&#32493;&#29366;&#24577;&#31354;&#38388;&#12290;&#35813;&#35770;&#25991;&#25351;&#20986;&#20272;&#35745;$Q$&#20989;&#25968;&#30340;&#25910;&#25947;&#36895;&#24230;&#20026;$\tilde{O}(T^{-1/(d+3)})$&#65292;&#27604;&#26497;&#23567;&#26497;&#22823;&#19979;&#30028;$\tilde{\Omega}(T^{-1/(d+2)})$&#24930;&#65292;&#35828;&#26126;&#35813;&#26041;&#27861;&#25928;&#29575;&#19981;&#39640;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#26032;&#30340;$Q$&#23398;&#20064;&#26041;&#27861;&#65292;&#26469;&#24357;&#21512;(Shah and Xie, 2018)&#20013;&#30340;&#25910;&#25947;&#36895;&#24230;&#24046;&#36317;&#65292;&#20854;&#20013;&#19968;&#31181;&#26159;&#31163;&#32447;&#30340;&#65292;&#21478;&#19968;&#31181;&#26159;&#22312;&#32447;&#30340;&#12290;&#23613;&#31649;&#25105;&#20204;&#20173;&#28982;&#20351;&#29992;&#26368;&#36817;&#37051;&#26041;&#27861;&#26469;&#20272;&#35745;$Q$&#20989;&#25968;&#65292;&#20294;&#31639;&#27861;&#19982;(Shah and Xie, 2018)&#26377;&#26174;&#33879;&#21306;&#21035;&#12290;
&lt;/p&gt;
&lt;p&gt;
$Q$ learning is a popular model free reinforcement learning method. Most of existing works focus on analyzing $Q$ learning for finite state and action spaces. If the state space is continuous, then the original $Q$ learning method can not be directly used. A modification of the original $Q$ learning method was proposed in (Shah and Xie, 2018), which estimates $Q$ values with nearest neighbors. Such modification makes $Q$ learning suitable for continuous state space. (Shah and Xie, 2018) shows that the convergence rate of estimated $Q$ function is $\tilde{O}(T^{-1/(d+3)})$, which is slower than the minimax lower bound $\tilde{\Omega}(T^{-1/(d+2)})$, indicating that this method is not efficient. This paper proposes two new $Q$ learning methods to bridge the gap of convergence rates in (Shah and Xie, 2018), with one of them being offline, while the other is online. Despite that we still use nearest neighbor approach to estimate $Q$ function, the algorithms are crucially different from (Sh
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#39532;&#23572;&#21487;&#22827;&#37319;&#26679;&#19979;&#30340;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;&#20013;&#30340;&#22312;&#32447;&#37325;&#21472;&#25209;&#27425;&#22343;&#20540;&#21327;&#26041;&#24046;&#20272;&#35745;&#22120;&#65292;&#24182;&#35777;&#26126;&#20102;&#20854;&#25910;&#25947;&#36895;&#29575;&#20026;$O\big(\sqrt{d}\,n^{-1/8}(\log n)^{1/4}\big)$&#21644;$O\big(\sqrt{d}\,n^{-1/8}\big)$&#65292;&#20998;&#21035;&#23545;&#24212;&#20110;&#29366;&#24577;&#30456;&#20851;&#21644;&#29366;&#24577;&#26080;&#20851;&#30340;&#39532;&#23572;&#21487;&#22827;&#37319;&#26679;&#12290;&#36825;&#20123;&#36895;&#29575;&#19982;&#29420;&#31435;&#21516;&#20998;&#24067;&#24773;&#20917;&#19979;&#30340;&#26368;&#20339;&#25910;&#25947;&#36895;&#29575;&#30456;&#21305;&#37197;&#65292;&#24182;&#19988;&#20811;&#26381;&#20102;&#30001;&#20110;&#39532;&#23572;&#21487;&#22827;&#37319;&#26679;&#32780;&#24341;&#36215;&#30340;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2308.01481</link><description>&lt;p&gt;
&#22312;&#39532;&#23572;&#21487;&#22827;&#37319;&#26679;&#19979;&#65292;&#29992;&#20110;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;&#30340;&#22312;&#32447;&#21327;&#26041;&#24046;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Online covariance estimation for stochastic gradient descent under Markovian sampling. (arXiv:2308.01481v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01481
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#39532;&#23572;&#21487;&#22827;&#37319;&#26679;&#19979;&#30340;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;&#20013;&#30340;&#22312;&#32447;&#37325;&#21472;&#25209;&#27425;&#22343;&#20540;&#21327;&#26041;&#24046;&#20272;&#35745;&#22120;&#65292;&#24182;&#35777;&#26126;&#20102;&#20854;&#25910;&#25947;&#36895;&#29575;&#20026;$O\big(\sqrt{d}\,n^{-1/8}(\log n)^{1/4}\big)$&#21644;$O\big(\sqrt{d}\,n^{-1/8}\big)$&#65292;&#20998;&#21035;&#23545;&#24212;&#20110;&#29366;&#24577;&#30456;&#20851;&#21644;&#29366;&#24577;&#26080;&#20851;&#30340;&#39532;&#23572;&#21487;&#22827;&#37319;&#26679;&#12290;&#36825;&#20123;&#36895;&#29575;&#19982;&#29420;&#31435;&#21516;&#20998;&#24067;&#24773;&#20917;&#19979;&#30340;&#26368;&#20339;&#25910;&#25947;&#36895;&#29575;&#30456;&#21305;&#37197;&#65292;&#24182;&#19988;&#20811;&#26381;&#20102;&#30001;&#20110;&#39532;&#23572;&#21487;&#22827;&#37319;&#26679;&#32780;&#24341;&#36215;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#29992;&#20110;&#39532;&#23572;&#21487;&#22827;&#37319;&#26679;&#19979;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;&#30340;&#22312;&#32447;&#37325;&#21472;&#25209;&#27425;&#22343;&#20540;&#21327;&#26041;&#24046;&#20272;&#35745;&#22120;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#21327;&#26041;&#24046;&#20272;&#35745;&#22120;&#30340;&#25910;&#25947;&#36895;&#29575;&#20998;&#21035;&#20026;$O\big(\sqrt{d}\,n^{-1/8}(\log n)^{1/4}\big)$&#21644;$O\big(\sqrt{d}\,n^{-1/8}\big)$&#65292;&#20854;&#20013;$d$&#20195;&#34920;&#32500;&#24230;&#65292;$n$&#34920;&#31034;&#35266;&#27979;&#25968;&#37327;&#25110;SGD&#36845;&#20195;&#27425;&#25968;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#36825;&#20123;&#36895;&#29575;&#19982;&#20808;&#21069;&#30001;\cite{zhu2021online}&#22312;&#29420;&#31435;&#21516;&#20998;&#24067;($\iid$)&#24773;&#20917;&#19979;&#24314;&#31435;&#30340;&#26368;&#20339;&#25910;&#25947;&#36895;&#29575;&#30456;&#21305;&#37197;&#65292;&#38500;&#20102;&#23545;&#25968;&#22240;&#23376;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#20811;&#26381;&#20102;&#30001;&#20110;&#39532;&#23572;&#21487;&#22827;&#37319;&#26679;&#32780;&#20135;&#29983;&#30340;&#37325;&#35201;&#25361;&#25112;&#65292;&#24341;&#20837;&#20102;&#39069;&#22806;&#30340;&#35823;&#24046;&#39033;&#21644;&#25209;&#27425;&#22343;&#20540;&#21327;&#26041;&#24046;&#20272;&#35745;&#22120;&#30340;&#22797;&#26434;&#20381;&#36182;&#20851;&#31995;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#24314;&#31435;&#20102;SGD&#21160;&#24577;&#35823;&#24046;$\ell_2$&#33539;&#25968;&#30340;&#21069;&#22235;&#38454;&#30697;&#30340;&#25910;&#25947;&#36895;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the online overlapping batch-means covariance estimator for Stochastic Gradient Descent (SGD) under Markovian sampling. We show that the convergence rates of the covariance estimator are $O\big(\sqrt{d}\,n^{-1/8}(\log n)^{1/4}\big)$ and $O\big(\sqrt{d}\,n^{-1/8}\big)$ under state-dependent and state-independent Markovian sampling, respectively, with $d$ representing dimensionality and $n$ denoting the number of observations or SGD iterations. Remarkably, these rates match the best-known convergence rate previously established for the independent and identically distributed ($\iid$) case by \cite{zhu2021online}, up to logarithmic factors. Our analysis overcomes significant challenges that arise due to Markovian sampling, leading to the introduction of additional error terms and complex dependencies between the blocks of the batch-means covariance estimator. Moreover, we establish the convergence rate for the first four moments of the $\ell_2$ norm of the error of SGD dynamics u
&lt;/p&gt;</description></item><item><title>&#21487;&#35299;&#37322;&#30340;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#34987;&#24191;&#27867;&#29992;&#20110;&#22788;&#29702;&#22823;&#25968;&#25454;&#38598;&#12289;&#21487;&#35270;&#21270;&#39044;&#27979;&#21644;&#25968;&#25454;&#39537;&#21160;&#30340;&#21457;&#29616;&#65292;&#35813;&#35770;&#25991;&#22238;&#39038;&#20102;&#36825;&#19968;&#39046;&#22495;&#24182;&#25506;&#35752;&#20102;&#39564;&#35777;&#21457;&#29616;&#30340;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2308.01475</link><description>&lt;p&gt;
&#21487;&#35299;&#37322;&#30340;&#26426;&#22120;&#23398;&#20064;&#29992;&#20110;&#21457;&#29616;&#65306;&#32479;&#35745;&#25361;&#25112;&#21644;&#26426;&#36935;
&lt;/p&gt;
&lt;p&gt;
Interpretable Machine Learning for Discovery: Statistical Challenges \&amp; Opportunities. (arXiv:2308.01475v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01475
&lt;/p&gt;
&lt;p&gt;
&#21487;&#35299;&#37322;&#30340;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#34987;&#24191;&#27867;&#29992;&#20110;&#22788;&#29702;&#22823;&#25968;&#25454;&#38598;&#12289;&#21487;&#35270;&#21270;&#39044;&#27979;&#21644;&#25968;&#25454;&#39537;&#21160;&#30340;&#21457;&#29616;&#65292;&#35813;&#35770;&#25991;&#22238;&#39038;&#20102;&#36825;&#19968;&#39046;&#22495;&#24182;&#25506;&#35752;&#20102;&#39564;&#35777;&#21457;&#29616;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26032;&#25216;&#26415;&#23548;&#33268;&#20102;&#35768;&#22810;&#31185;&#23398;&#39046;&#22495;&#21644;&#34892;&#19994;&#30340;&#24222;&#22823;&#12289;&#22797;&#26434;&#30340;&#25968;&#25454;&#38598;&#12290;&#20154;&#20204;&#32463;&#24120;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#26469;&#22788;&#29702;&#12289;&#21487;&#35270;&#21270;&#21644;&#39044;&#27979;&#36825;&#20123;&#22823;&#25968;&#25454;&#65292;&#24182;&#36890;&#36807;&#21487;&#35299;&#37322;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#21644;&#25216;&#26415;&#26469;&#36827;&#34892;&#25968;&#25454;&#39537;&#21160;&#30340;&#21457;&#29616;&#12290;&#26412;&#25991;&#35752;&#35770;&#21644;&#22238;&#39038;&#20102;&#21487;&#35299;&#37322;&#30340;&#26426;&#22120;&#23398;&#20064;&#39046;&#22495;&#65292;&#29305;&#21035;&#20851;&#27880;&#36825;&#20123;&#25216;&#26415;&#22312;&#20174;&#22823;&#25968;&#25454;&#38598;&#20013;&#29983;&#25104;&#26032;&#30693;&#35782;&#25110;&#36827;&#34892;&#21457;&#29616;&#26102;&#30340;&#24212;&#29992;&#12290;&#25105;&#20204;&#27010;&#36848;&#20102;&#21487;&#35299;&#37322;&#30340;&#26426;&#22120;&#23398;&#20064;&#22312;&#30417;&#30563;&#21644;&#26080;&#30417;&#30563;&#22330;&#26223;&#19979;&#21487;&#20197;&#23454;&#29616;&#30340;&#21457;&#29616;&#31867;&#22411;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#37325;&#28857;&#35752;&#35770;&#20102;&#22914;&#20309;&#20197;&#25968;&#25454;&#39537;&#21160;&#30340;&#26041;&#24335;&#39564;&#35777;&#36825;&#20123;&#21457;&#29616;&#65292;&#20197;&#20419;&#36827;&#23545;&#26426;&#22120;&#23398;&#20064;&#31995;&#32479;&#30340;&#20449;&#20219;&#21644;&#31185;&#23398;&#20013;&#30340;&#21487;&#37325;&#22797;&#24615;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#39564;&#35777;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
New technologies have led to vast troves of large and complex datasets across many scientific domains and industries. People routinely use machine learning techniques to not only process, visualize, and make predictions from this big data, but also to make data-driven discoveries. These discoveries are often made using Interpretable Machine Learning, or machine learning models and techniques that yield human understandable insights. In this paper, we discuss and review the field of interpretable machine learning, focusing especially on the techniques as they are often employed to generate new knowledge or make discoveries from large data sets. We outline the types of discoveries that can be made using Interpretable Machine Learning in both supervised and unsupervised settings. Additionally, we focus on the grand challenge of how to validate these discoveries in a data-driven manner, which promotes trust in machine learning systems and reproducibility in science. We discuss validation f
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21387;&#32553;&#23545;&#20998;&#24067;&#24335;&#21644;&#32852;&#37030;&#23398;&#20064;&#20013;&#38543;&#26426;&#26799;&#24230;&#31639;&#27861;&#30340;&#24433;&#21709;&#65292;&#36890;&#36807;&#27604;&#36739;&#19981;&#21516;&#30340;&#26080;&#20559;&#21387;&#32553;&#25805;&#20316;&#31526;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#36229;&#36234;&#20102;&#32463;&#20856;&#30340;&#26368;&#22351;&#24773;&#20917;&#20998;&#26512;&#12290;&#38024;&#23545;&#26368;&#23567;&#20108;&#20056;&#22238;&#24402;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#38543;&#26426;&#36924;&#36817;&#31639;&#27861;&#65292;&#24182;&#32771;&#34385;&#20102;&#38543;&#26426;&#22330;&#30340;&#19968;&#33324;&#20551;&#35774;&#21644;&#22122;&#22768;&#21327;&#26041;&#24046;&#30340;&#38480;&#21046;&#65292;&#20197;&#20998;&#26512;&#21508;&#31181;&#38543;&#26426;&#21270;&#26426;&#21046;&#12290;</title><link>http://arxiv.org/abs/2308.01358</link><description>&lt;p&gt;
&#21387;&#32553;&#21644;&#20998;&#24067;&#24335;&#26368;&#23567;&#20108;&#20056;&#22238;&#24402;&#65306;&#25910;&#25947;&#36895;&#24230;&#21450;&#20854;&#22312;&#32852;&#37030;&#23398;&#20064;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Compressed and distributed least-squares regression: convergence rates with applications to Federated Learning. (arXiv:2308.01358v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01358
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21387;&#32553;&#23545;&#20998;&#24067;&#24335;&#21644;&#32852;&#37030;&#23398;&#20064;&#20013;&#38543;&#26426;&#26799;&#24230;&#31639;&#27861;&#30340;&#24433;&#21709;&#65292;&#36890;&#36807;&#27604;&#36739;&#19981;&#21516;&#30340;&#26080;&#20559;&#21387;&#32553;&#25805;&#20316;&#31526;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#36229;&#36234;&#20102;&#32463;&#20856;&#30340;&#26368;&#22351;&#24773;&#20917;&#20998;&#26512;&#12290;&#38024;&#23545;&#26368;&#23567;&#20108;&#20056;&#22238;&#24402;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#38543;&#26426;&#36924;&#36817;&#31639;&#27861;&#65292;&#24182;&#32771;&#34385;&#20102;&#38543;&#26426;&#22330;&#30340;&#19968;&#33324;&#20551;&#35774;&#21644;&#22122;&#22768;&#21327;&#26041;&#24046;&#30340;&#38480;&#21046;&#65292;&#20197;&#20998;&#26512;&#21508;&#31181;&#38543;&#26426;&#21270;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#26426;&#22120;&#23398;&#20064;&#20013;&#24191;&#27867;&#24212;&#29992;&#30340;&#20998;&#24067;&#24335;&#21644;&#32852;&#37030;&#23398;&#20064;&#20013;&#65292;&#21387;&#32553;&#23545;&#38543;&#26426;&#26799;&#24230;&#31639;&#27861;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#24378;&#35843;&#20102;&#20960;&#31181;&#26080;&#20559;&#21387;&#32553;&#25805;&#20316;&#31526;&#20043;&#38388;&#30340;&#25910;&#25947;&#36895;&#24230;&#24046;&#24322;&#65292;&#36825;&#20123;&#25805;&#20316;&#31526;&#37117;&#28385;&#36275;&#30456;&#21516;&#30340;&#26041;&#24046;&#26465;&#20214;&#65292;&#20174;&#32780;&#36229;&#36234;&#20102;&#32463;&#20856;&#30340;&#26368;&#22351;&#24773;&#20917;&#20998;&#26512;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#19987;&#27880;&#20110;&#26368;&#23567;&#20108;&#20056;&#22238;&#24402;&#65288;LSR&#65289;&#30340;&#24773;&#20917;&#65292;&#24182;&#20998;&#26512;&#20102;&#19968;&#20010;&#20381;&#36182;&#20110;&#38543;&#26426;&#22330;&#30340;&#26368;&#23567;&#20108;&#20056;&#22238;&#24402;&#30340;&#38543;&#26426;&#36924;&#36817;&#31639;&#27861;&#12290;&#25105;&#20204;&#23545;&#38543;&#26426;&#22330;&#30340;&#19968;&#33324;&#24615;&#20551;&#35774;&#36827;&#34892;&#20102;&#35814;&#32454;&#20998;&#26512;&#65288;&#29305;&#21035;&#26159;&#26399;&#26395;&#30340;H&#246;lder&#27491;&#21017;&#24615;&#65289;&#24182;&#23545;&#22122;&#22768;&#21327;&#26041;&#24046;&#36827;&#34892;&#20102;&#38480;&#21046;&#65292;&#20197;&#20415;&#20998;&#26512;&#21508;&#31181;&#38543;&#26426;&#21270;&#26426;&#21046;&#65292;&#21253;&#25324;&#21387;&#32553;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#23558;&#32467;&#26524;&#25193;&#23637;&#21040;&#32852;&#37030;&#23398;&#20064;&#30340;&#24773;&#20917;&#19979;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#24378;&#35843;&#20102;&#23545;&#21152;&#24615;&#22122;&#22768;&#30340;&#21327;&#26041;&#24046;&#120226;&#120224;&#120237;&#120232;&#120224;&#23545;&#25910;&#25947;&#24615;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we investigate the impact of compression on stochastic gradient algorithms for machine learning, a technique widely used in distributed and federated learning. We underline differences in terms of convergence rates between several unbiased compression operators, that all satisfy the same condition on their variance, thus going beyond the classical worst-case analysis. To do so, we focus on the case of least-squares regression (LSR) and analyze a general stochastic approximation algorithm for minimizing quadratic functions relying on a random field. We consider weak assumptions on the random field, tailored to the analysis (specifically, expected H\"older regularity), and on the noise covariance, enabling the analysis of various randomizing mechanisms, including compression. We then extend our results to the case of federated learning.  More formally, we highlight the impact on the convergence of the covariance $\mathfrak{C}_{\mathrm{ania}}$ of the additive noise induced 
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#35814;&#32454;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;&#22686;&#37327;&#21333;&#20803;&#26522;&#20030;&#65288;ICE&#65289;&#30340;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#21487;&#20197;&#31934;&#30830;&#35299;&#20915;&#23450;&#32500;&#24230;0-1&#25439;&#22833;&#32447;&#24615;&#20998;&#31867;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2306.12344</link><description>&lt;p&gt;
&#19968;&#31181;&#26377;&#25928;&#19988;&#21487;&#35777;&#26126;&#31934;&#30830;&#30340;0-1&#25439;&#22833;&#32447;&#24615;&#20998;&#31867;&#38382;&#39064;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
An efficient, provably exact algorithm for the 0-1 loss linear classification problem. (arXiv:2306.12344v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.12344
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35814;&#32454;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;&#22686;&#37327;&#21333;&#20803;&#26522;&#20030;&#65288;ICE&#65289;&#30340;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#21487;&#20197;&#31934;&#30830;&#35299;&#20915;&#23450;&#32500;&#24230;0-1&#25439;&#22833;&#32447;&#24615;&#20998;&#31867;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35299;&#20915;&#32447;&#24615;&#20998;&#31867;&#38382;&#39064;&#30340;&#31639;&#27861;&#20855;&#26377;&#24736;&#20037;&#30340;&#21382;&#21490;&#65292;&#33267;&#23569;&#21487;&#20197;&#36861;&#28335;&#21040;1936&#24180;&#30340;&#32447;&#24615;&#21028;&#21035;&#20998;&#26512;&#12290;&#23545;&#20110;&#32447;&#24615;&#21487;&#20998;&#25968;&#25454;&#65292;&#35768;&#22810;&#31639;&#27861;&#21487;&#20197;&#26377;&#25928;&#22320;&#24471;&#21040;&#30456;&#24212;&#30340;0-1&#25439;&#22833;&#20998;&#31867;&#38382;&#39064;&#30340;&#31934;&#30830;&#35299;&#65292;&#20294;&#23545;&#20110;&#38750;&#32447;&#24615;&#21487;&#20998;&#25968;&#25454;&#65292;&#24050;&#32463;&#35777;&#26126;&#36825;&#20010;&#38382;&#39064;&#22312;&#23436;&#20840;&#33539;&#22260;&#20869;&#26159;NP&#38590;&#30340;&#12290;&#25152;&#26377;&#26367;&#20195;&#26041;&#27861;&#37117;&#28041;&#21450;&#26576;&#31181;&#24418;&#24335;&#30340;&#36817;&#20284;&#65292;&#21253;&#25324;&#20351;&#29992;0-1&#25439;&#22833;&#30340;&#20195;&#29702;&#65288;&#20363;&#22914;hinge&#25110;logistic&#25439;&#22833;&#65289;&#25110;&#36817;&#20284;&#30340;&#32452;&#21512;&#25628;&#32034;&#65292;&#36825;&#20123;&#37117;&#19981;&#33021;&#20445;&#35777;&#23436;&#20840;&#35299;&#20915;&#38382;&#39064;&#12290;&#25214;&#21040;&#35299;&#20915;&#23450;&#32500;&#24230;0-1&#25439;&#22833;&#32447;&#24615;&#20998;&#31867;&#38382;&#39064;&#30340;&#20840;&#23616;&#26368;&#20248;&#35299;&#30340;&#26377;&#25928;&#31639;&#27861;&#20173;&#28982;&#26159;&#19968;&#20010;&#26410;&#35299;&#20915;&#30340;&#38382;&#39064;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#35814;&#32454;&#20171;&#32461;&#20102;&#19968;&#20010;&#26032;&#31639;&#27861;&#30340;&#26500;&#24314;&#36807;&#31243;&#65292;&#22686;&#37327;&#21333;&#20803;&#26522;&#20030;&#65288;ICE&#65289;&#65292;&#23427;&#21487;&#20197;&#31934;&#30830;&#35299;&#20915;0-1&#25439;&#22833;&#20998;&#31867;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
Algorithms for solving the linear classification problem have a long history, dating back at least to 1936 with linear discriminant analysis. For linearly separable data, many algorithms can obtain the exact solution to the corresponding 0-1 loss classification problem efficiently, but for data which is not linearly separable, it has been shown that this problem, in full generality, is NP-hard. Alternative approaches all involve approximations of some kind, including the use of surrogates for the 0-1 loss (for example, the hinge or logistic loss) or approximate combinatorial search, none of which can be guaranteed to solve the problem exactly. Finding efficient algorithms to obtain an exact i.e. globally optimal solution for the 0-1 loss linear classification problem with fixed dimension, remains an open problem. In research we report here, we detail the construction of a new algorithm, incremental cell enumeration (ICE), that can solve the 0-1 loss classification problem exactly in po
&lt;/p&gt;</description></item><item><title>&#38024;&#23545;&#26680;&#23725;&#22238;&#24402;&#38382;&#39064;&#65292;&#26412;&#25991;&#24341;&#20837;&#20102;&#20004;&#31181;&#24378;&#20581;&#30340;&#38543;&#26426;&#39044;&#22788;&#29702;&#25216;&#26415;&#65292;&#20998;&#21035;&#35299;&#20915;&#20102;&#20840;&#25968;&#25454;KRR&#38382;&#39064;&#21644;&#38480;&#21046;&#29256;KRR&#38382;&#39064;&#65292;&#20811;&#26381;&#20102;&#20197;&#24448;&#39044;&#22788;&#29702;&#22120;&#30340;&#25925;&#38556;&#27169;&#24335;&#12290;</title><link>http://arxiv.org/abs/2304.12465</link><description>&lt;p&gt;
&#24378;&#20581;&#30340;&#38543;&#26426;&#39044;&#22788;&#29702;&#26041;&#27861;&#35299;&#20915;&#26680;&#23725;&#22238;&#24402;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Robust, randomized preconditioning for kernel ridge regression. (arXiv:2304.12465v1 [math.NA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.12465
&lt;/p&gt;
&lt;p&gt;
&#38024;&#23545;&#26680;&#23725;&#22238;&#24402;&#38382;&#39064;&#65292;&#26412;&#25991;&#24341;&#20837;&#20102;&#20004;&#31181;&#24378;&#20581;&#30340;&#38543;&#26426;&#39044;&#22788;&#29702;&#25216;&#26415;&#65292;&#20998;&#21035;&#35299;&#20915;&#20102;&#20840;&#25968;&#25454;KRR&#38382;&#39064;&#21644;&#38480;&#21046;&#29256;KRR&#38382;&#39064;&#65292;&#20811;&#26381;&#20102;&#20197;&#24448;&#39044;&#22788;&#29702;&#22120;&#30340;&#25925;&#38556;&#27169;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#20004;&#31181;&#38543;&#26426;&#39044;&#22788;&#29702;&#25216;&#26415;&#65292;&#29992;&#20110;&#24378;&#20581;&#22320;&#35299;&#20915;&#20855;&#26377;&#20013;&#22823;&#35268;&#27169;&#25968;&#25454;&#28857;&#65288;$10^4 \leq N \leq 10^7$&#65289;&#30340;&#26680;&#23725;&#22238;&#24402;&#65288;KRR&#65289;&#38382;&#39064;&#12290;&#31532;&#19968;&#31181;&#26041;&#27861;&#65292;RPCholesky&#39044;&#22788;&#29702;&#65292;&#33021;&#22815;&#22312;&#20551;&#35774;&#26680;&#30697;&#38453;&#29305;&#24449;&#20540;&#26377;&#36275;&#22815;&#24555;&#36895;&#30340;&#22810;&#39033;&#24335;&#34928;&#20943;&#30340;&#24773;&#20917;&#19979;&#65292;&#20197;$O&#65288;N ^ 2&#65289;$&#31639;&#27861;&#25805;&#20316;&#20934;&#30830;&#22320;&#35299;&#20915;&#20840;&#25968;&#25454;KRR&#38382;&#39064;&#12290;&#31532;&#20108;&#31181;&#26041;&#27861;&#65292;KRILL&#39044;&#22788;&#29702;&#65292;&#20197;$O&#65288;&#65288;N + k ^ 2&#65289;k \ logk&#65289;$&#30340;&#20195;&#20215;&#65292;&#20026;KRR&#38382;&#39064;&#30340;&#38480;&#21046;&#29256;&#26412;&#25552;&#20379;&#20934;&#30830;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#35813;&#29256;&#26412;&#28041;&#21450;$k \ll N$&#36873;&#25321;&#30340;&#25968;&#25454;&#20013;&#24515;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#35299;&#20915;&#20102;&#24191;&#27867;&#30340;KRR&#38382;&#39064;&#65292;&#20811;&#26381;&#20102;&#20197;&#21069;&#30340;KRR&#39044;&#22788;&#29702;&#22120;&#30340;&#25925;&#38556;&#27169;&#24335;&#65292;&#20351;&#23427;&#20204;&#25104;&#20026;&#23454;&#38469;&#24212;&#29992;&#30340;&#29702;&#24819;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper introduces two randomized preconditioning techniques for robustly solving kernel ridge regression (KRR) problems with a medium to large number of data points ($10^4 \leq N \leq 10^7$). The first method, RPCholesky preconditioning, is capable of accurately solving the full-data KRR problem in $O(N^2)$ arithmetic operations, assuming sufficiently rapid polynomial decay of the kernel matrix eigenvalues. The second method, KRILL preconditioning, offers an accurate solution to a restricted version of the KRR problem involving $k \ll N$ selected data centers at a cost of $O((N + k^2) k \log k)$ operations. The proposed methods solve a broad range of KRR problems and overcome the failure modes of previous KRR preconditioners, making them ideal for practical applications.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#30456;&#20284;&#24615;&#21305;&#37197;&#26041;&#27861;&#30340;&#35268;&#33539;&#26694;&#26550;&#65292;&#21487;&#20197;&#35299;&#20915;&#23548;&#20986;&#31070;&#32463;&#32593;&#32476;&#20013;&#22810;&#23460;&#31070;&#32463;&#20803;&#21644;&#38750;&#28023;&#21338;&#22411;&#21487;&#22609;&#24615;&#30340;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2302.10051</link><description>&lt;p&gt;
&#22522;&#20110;&#22810;&#23460;&#31070;&#32463;&#20803;&#21644;&#38750;&#28023;&#20864;&#24615;&#21487;&#22609;&#24615;&#30340;&#31070;&#32463;&#32593;&#32476;&#23548;&#20986;&#30340;&#35268;&#33539;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
Normative framework for deriving neural networks with multi-compartmental neurons and non-Hebbian plasticity. (arXiv:2302.10051v2 [q-bio.NC] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.10051
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#30456;&#20284;&#24615;&#21305;&#37197;&#26041;&#27861;&#30340;&#35268;&#33539;&#26694;&#26550;&#65292;&#21487;&#20197;&#35299;&#20915;&#23548;&#20986;&#31070;&#32463;&#32593;&#32476;&#20013;&#22810;&#23460;&#31070;&#32463;&#20803;&#21644;&#38750;&#28023;&#21338;&#22411;&#21487;&#22609;&#24615;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29702;&#35299;&#31070;&#32463;&#35745;&#31639;&#30340;&#31639;&#27861;&#22522;&#30784;&#30340;&#24050;&#24314;&#31435;&#30340;&#35268;&#33539;&#26041;&#27861;&#26159;&#20174;&#26377;&#21407;&#21017;&#30340;&#35745;&#31639;&#30446;&#26631;&#23548;&#20986;&#22312;&#32447;&#31639;&#27861;&#65292;&#24182;&#35780;&#20272;&#23427;&#20204;&#19982;&#35299;&#21078;&#21644;&#29983;&#29702;&#35266;&#23519;&#30340;&#20860;&#23481;&#24615;&#12290;&#30456;&#20284;&#24615;&#21305;&#37197;&#30446;&#26631;&#24050;&#32463;&#25104;&#21151;&#20316;&#20026;&#23548;&#20986;&#19982;&#28857;&#31070;&#32463;&#20803;&#21644;&#28023;&#21338;/&#21453;&#28023;&#21338;&#21487;&#22609;&#24615;&#30456;&#21305;&#37197;&#30340;&#22312;&#32447;&#31639;&#27861;&#30340;&#36215;&#28857;&#12290;&#36825;&#20123;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#35299;&#37322;&#20102;&#35768;&#22810;&#35299;&#21078;&#21644;&#29983;&#29702;&#35266;&#23519;&#65292;&#20294;&#30446;&#26631;&#30340;&#35745;&#31639;&#33021;&#21147;&#26377;&#38480;&#65292;&#23548;&#20986;&#30340;&#31070;&#32463;&#32593;&#32476;&#26080;&#27861;&#35299;&#37322;&#20840;&#33041;&#26222;&#36941;&#23384;&#22312;&#30340;&#22810;&#23460;&#31070;&#32463;&#20803;&#32467;&#26500;&#21644;&#38750;&#28023;&#21338;&#22411;&#21487;&#22609;&#24615;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#32479;&#19968;&#21644;&#25512;&#24191;&#20102;&#30456;&#20284;&#24615;&#21305;&#37197;&#26041;&#27861;&#30340;&#26368;&#36817;&#25193;&#23637;&#65292;&#20197;&#35299;&#20915;&#26356;&#22797;&#26434;&#30340;&#30446;&#26631;&#65292;&#21253;&#25324;&#21487;&#20197;&#34920;&#36848;&#20026;&#23545;&#31216;&#24191;&#20041;&#29305;&#24449;&#20540;&#38382;&#39064;&#30340;&#22823;&#31867;&#26080;&#30417;&#30563;&#21644;&#33258;&#25105;&#30417;&#30563;&#23398;&#20064;&#20219;&#21153;&#12290;
&lt;/p&gt;
&lt;p&gt;
An established normative approach for understanding the algorithmic basis of neural computation is to derive online algorithms from principled computational objectives and evaluate their compatibility with anatomical and physiological observations. Similarity matching objectives have served as successful starting points for deriving online algorithms that map onto neural networks (NNs) with point neurons and Hebbian/anti-Hebbian plasticity. These NN models account for many anatomical and physiological observations; however, the objectives have limited computational power and the derived NNs do not explain multi-compartmental neuronal structures and non-Hebbian forms of plasticity that are prevalent throughout the brain. In this article, we unify and generalize recent extensions of the similarity matching approach to address more complex objectives, including a large class of unsupervised and self-supervised learning tasks that can be formulated as symmetric generalized eigenvalue probl
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22343;&#26041;&#24046;&#20272;&#35745;&#32593;&#32476;&#30340;&#26368;&#20248;&#23454;&#29616;&#65292;&#24182;&#21457;&#29616;&#36890;&#36807;&#20351;&#29992;&#39044;&#28909;&#26399;&#21487;&#20197;&#36991;&#20813;&#25910;&#25947;&#22256;&#38590;&#12290;</title><link>http://arxiv.org/abs/2302.08875</link><description>&lt;p&gt;
&#26368;&#20248;&#35757;&#32451;&#22343;&#26041;&#24046;&#20272;&#35745;&#31070;&#32463;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
Optimal Training of Mean Variance Estimation Neural Networks. (arXiv:2302.08875v2 [stat.ML] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.08875
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22343;&#26041;&#24046;&#20272;&#35745;&#32593;&#32476;&#30340;&#26368;&#20248;&#23454;&#29616;&#65292;&#24182;&#21457;&#29616;&#36890;&#36807;&#20351;&#29992;&#39044;&#28909;&#26399;&#21487;&#20197;&#36991;&#20813;&#25910;&#25947;&#22256;&#38590;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22343;&#26041;&#24046;&#20272;&#35745;&#32593;&#32476;&#65288;MVE&#32593;&#32476;&#65289;&#30340;&#26368;&#20248;&#23454;&#29616;&#12290;&#36825;&#31181;&#32593;&#32476;&#32463;&#24120;&#34987;&#29992;&#20316;&#22238;&#24402;&#35774;&#32622;&#20013;&#19981;&#30830;&#23450;&#24615;&#20272;&#35745;&#26041;&#27861;&#30340;&#26500;&#24314;&#27169;&#22359;&#65292;&#20363;&#22914;Concrete dropout&#21644;Deep Ensembles&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;MVE&#32593;&#32476;&#20551;&#35774;&#25968;&#25454;&#26159;&#20174;&#19968;&#20010;&#20855;&#26377;&#22343;&#20540;&#20989;&#25968;&#21644;&#26041;&#24046;&#20989;&#25968;&#30340;&#27491;&#24577;&#20998;&#24067;&#20135;&#29983;&#30340;&#12290;MVE&#32593;&#32476;&#36755;&#20986;&#22343;&#20540;&#21644;&#26041;&#24046;&#30340;&#20272;&#35745;&#65292;&#36890;&#36807;&#26368;&#23567;&#21270;&#36127;&#23545;&#25968;&#20284;&#28982;&#20989;&#25968;&#26469;&#20248;&#21270;&#32593;&#32476;&#21442;&#25968;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#20010;&#37325;&#35201;&#30340;&#35265;&#35299;&#12290;&#39318;&#20808;&#65292;&#26368;&#36817;&#30340;&#30740;&#31350;&#20013;&#25253;&#21578;&#30340;&#25910;&#25947;&#22256;&#38590;&#21487;&#20197;&#36890;&#36807;&#36981;&#24490;&#21407;&#22987;&#20316;&#32773;&#30340;&#31616;&#21333;&#20294;&#32463;&#24120;&#34987;&#24573;&#35270;&#30340;&#24314;&#35758;&#26469;&#30456;&#23545;&#23481;&#26131;&#22320;&#36991;&#20813;&#65292;&#21363;&#20351;&#29992;&#19968;&#20010;&#39044;&#28909;&#26399;&#12290;&#22312;&#36825;&#20010;&#26399;&#38388;&#65292;&#21482;&#20248;&#21270;&#22343;&#20540;&#65292;&#26041;&#24046;&#20445;&#25345;&#22266;&#23450;&#12290;&#25105;&#20204;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#20102;&#36825;&#19968;&#27493;&#39588;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper focusses on the optimal implementation of a Mean Variance Estimation network (MVE network) (Nix and Weigend, 1994). This type of network is often used as a building block for uncertainty estimation methods in a regression setting, for instance Concrete dropout (Gal et al., 2017) and Deep Ensembles (Lakshminarayanan et al., 2017). Specifically, an MVE network assumes that the data is produced from a normal distribution with a mean function and variance function. The MVE network outputs a mean and variance estimate and optimizes the network parameters by minimizing the negative loglikelihood. In our paper, we present two significant insights. Firstly, the convergence difficulties reported in recent work can be relatively easily prevented by following the simple yet often overlooked recommendation from the original authors that a warm-up period should be used. During this period, only the mean is optimized with a fixed variance. We demonstrate the effectiveness of this step thr
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20010;&#20307;&#20844;&#24179;&#24615;(IF)&#21644;&#30697;&#38453;&#20272;&#35745;(ME)&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#36866;&#24403;&#26465;&#20214;&#19979;&#20351;&#29992;ME&#26041;&#27861;&#36827;&#34892;&#25968;&#25454;&#39044;&#22788;&#29702;&#21487;&#20197;&#25913;&#21892;&#31639;&#27861;&#30340;&#20010;&#20307;&#20844;&#24179;&#24615;&#65292;&#24182;&#19988;&#19981;&#20250;&#29306;&#29298;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2302.02096</link><description>&lt;p&gt;
&#20010;&#20307;&#20844;&#24179;&#30340;&#30697;&#38453;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Matrix Estimation for Individual Fairness. (arXiv:2302.02096v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.02096
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20010;&#20307;&#20844;&#24179;&#24615;(IF)&#21644;&#30697;&#38453;&#20272;&#35745;(ME)&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#36866;&#24403;&#26465;&#20214;&#19979;&#20351;&#29992;ME&#26041;&#27861;&#36827;&#34892;&#25968;&#25454;&#39044;&#22788;&#29702;&#21487;&#20197;&#25913;&#21892;&#31639;&#27861;&#30340;&#20010;&#20307;&#20844;&#24179;&#24615;&#65292;&#24182;&#19988;&#19981;&#20250;&#29306;&#29298;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#20986;&#29616;&#20102;&#22810;&#31181;&#31639;&#27861;&#20844;&#24179;&#24615;&#30340;&#27010;&#24565;&#12290;&#20854;&#20013;&#19968;&#31181;&#27010;&#24565;&#26159;&#20010;&#20307;&#20844;&#24179;&#24615;(IF)&#65292;&#35201;&#27714;&#30456;&#20284;&#30340;&#20010;&#20307;&#25509;&#21463;&#30456;&#20284;&#30340;&#23545;&#24453;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#30697;&#38453;&#20272;&#35745;(ME)&#20316;&#20026;&#22788;&#29702;&#20855;&#26377;&#32570;&#22833;&#20540;&#30340;&#22122;&#22768;&#25968;&#25454;&#30340;&#19968;&#31181;&#33258;&#28982;&#33539;&#24335;&#20063;&#20986;&#29616;&#20102;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#23558;&#36825;&#20004;&#20010;&#27010;&#24565;&#36827;&#34892;&#20102;&#32852;&#31995;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#20351;&#29992;ME&#26041;&#27861;&#23545;&#25968;&#25454;&#36827;&#34892;&#39044;&#22788;&#29702;&#21487;&#20197;&#22312;&#19981;&#29306;&#29298;&#24615;&#33021;&#30340;&#24773;&#20917;&#19979;&#25913;&#21892;&#31639;&#27861;&#30340;IF&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#34920;&#26126;&#65292;&#22312;&#36866;&#24403;&#30340;&#26465;&#20214;&#19979;&#65292;&#20351;&#29992;&#19968;&#31181;&#21517;&#20026;&#22855;&#24322;&#20540;&#38408;&#20540;(SVT)&#30340;&#27969;&#34892;ME&#26041;&#27861;&#23545;&#25968;&#25454;&#36827;&#34892;&#39044;&#22788;&#29702;&#21487;&#20197;&#25552;&#20379;&#24378;&#26377;&#21147;&#30340;IF&#20445;&#35777;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#34920;&#26126;&#65292;&#22312;&#31867;&#20284;&#30340;&#26465;&#20214;&#19979;&#65292;SVT&#39044;&#22788;&#29702;&#36824;&#20135;&#29983;&#20102;&#19968;&#33268;&#19988;&#36817;&#20284;&#26368;&#23567;&#21270;&#25932;&#23545;&#39118;&#38505;&#30340;&#20272;&#35745;&#12290;&#22240;&#27492;&#65292;&#22312;&#25152;&#36848;&#26465;&#20214;&#19979;&#65292;ME&#39044;&#22788;&#29702;&#27493;&#39588;&#19981;&#20250;&#22686;&#21152;&#22522;&#26412;&#31639;&#27861;&#30340;&#39044;&#27979;&#35823;&#24046;&#65292;&#21363;&#19981;&#20250;&#32473;&#20844;&#24179;&#24615;&#19982;&#24615;&#33021;&#20043;&#38388;&#24102;&#26469;&#26435;&#34913;&#12290;&#25105;&#20204;&#36890;&#36807;&#21512;&#25104;&#25968;&#25454;&#21644;&#30495;&#23454;&#25968;&#25454;&#38598;&#39564;&#35777;&#20102;&#36825;&#20123;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
In recent years, multiple notions of algorithmic fairness have arisen. One such notion is individual fairness (IF), which requires that individuals who are similar receive similar treatment. In parallel, matrix estimation (ME) has emerged as a natural paradigm for handling noisy data with missing values. In this work, we connect the two concepts. We show that pre-processing data using ME can improve an algorithm's IF without sacrificing performance. Specifically, we show that using a popular ME method known as singular value thresholding (SVT) to pre-process the data provides a strong IF guarantee under appropriate conditions. We then show that, under analogous conditions, SVT pre-processing also yields estimates that are consistent and approximately minimax optimal. As such, the ME pre-processing step does not, under the stated conditions, increase the prediction error of the base algorithm, i.e., does not impose a fairness-performance trade-off. We verify these results on synthetic a
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;Bootstrapped Deep Ensembles&#30340;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#32463;&#20856;&#30340;&#26377;&#38480;&#25968;&#25454;&#25928;&#24212;&#65292;&#26126;&#30830;&#32771;&#34385;&#31070;&#32463;&#32593;&#32476;&#22238;&#24402;&#20013;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#24182;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#26174;&#33879;&#25913;&#36827;&#12290;</title><link>http://arxiv.org/abs/2202.10903</link><description>&lt;p&gt;
&#33258;&#20449;&#30340;&#31070;&#32463;&#32593;&#32476;&#22238;&#24402;&#19982;&#24341;&#23548;&#28145;&#24230;&#38598;&#25104;
&lt;/p&gt;
&lt;p&gt;
Confident Neural Network Regression with Bootstrapped Deep Ensembles. (arXiv:2202.10903v2 [stat.ML] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.10903
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;Bootstrapped Deep Ensembles&#30340;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#32463;&#20856;&#30340;&#26377;&#38480;&#25968;&#25454;&#25928;&#24212;&#65292;&#26126;&#30830;&#32771;&#34385;&#31070;&#32463;&#32593;&#32476;&#22238;&#24402;&#20013;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#24182;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#26174;&#33879;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#31070;&#32463;&#32593;&#32476;&#30340;&#27969;&#34892;&#21644;&#20351;&#29992;&#22686;&#21152;&#65292;&#21487;&#20449;&#30340;&#19981;&#30830;&#23450;&#24615;&#20272;&#35745;&#21464;&#24471;&#36234;&#26469;&#36234;&#37325;&#35201;&#12290;&#20854;&#20013;&#19968;&#20010;&#26368;&#31361;&#20986;&#30340;&#19981;&#30830;&#23450;&#24615;&#20272;&#35745;&#26041;&#27861;&#26159;Deep Ensembles&#65288;Lakshminarayanan&#31561;&#20154;&#65292;2017&#65289;&#12290;&#19968;&#20010;&#32463;&#20856;&#30340;&#21442;&#25968;&#27169;&#22411;&#30001;&#20110;&#24314;&#27169;&#25968;&#25454;&#26159;&#38543;&#26426;&#26679;&#26412;&#65292;&#22240;&#27492;&#20854;&#21442;&#25968;&#23384;&#22312;&#19981;&#30830;&#23450;&#24615;&#12290;&#29616;&#20195;&#31070;&#32463;&#32593;&#32476;&#30001;&#20110;&#32593;&#32476;&#20248;&#21270;&#30340;&#38543;&#26426;&#24615;&#20063;&#20855;&#26377;&#39069;&#22806;&#30340;&#19981;&#30830;&#23450;&#24615;&#25104;&#20998;&#12290;Lakshminarayanan&#31561;&#20154;&#65288;2017&#65289;&#25351;&#20986;&#65292;Deep Ensembles&#26410;&#32771;&#34385;&#21040;&#30001;&#26377;&#38480;&#25968;&#25454;&#25928;&#24212;&#24341;&#36215;&#30340;&#32463;&#20856;&#19981;&#30830;&#23450;&#24615;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22238;&#24402;&#35774;&#32622;&#30340;&#35745;&#31639;&#24265;&#20215;&#24615;&#25193;&#23637;Deep Ensembles&#30340;&#26041;&#27861;&#65292;&#31216;&#20026;Bootstrapped Deep Ensembles&#65292;&#23427;&#20351;&#29992;&#25913;&#36827;&#29256;&#30340;&#21442;&#25968;&#33258;&#21161;&#27861;&#26126;&#30830;&#32771;&#34385;&#20102;&#26377;&#38480;&#25968;&#25454;&#30340;&#32463;&#20856;&#25928;&#24212;&#12290;&#36890;&#36807;&#23454;&#39564;&#30740;&#31350;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#26631;&#20934;&#26041;&#27861;&#30340;&#22522;&#30784;&#19978;&#26126;&#26174;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;
With the rise of the popularity and usage of neural networks, trustworthy uncertainty estimation is becoming increasingly essential. One of the most prominent uncertainty estimation methods is Deep Ensembles (Lakshminarayanan et al., 2017) . A classical parametric model has uncertainty in the parameters due to the fact that the data on which the model is build is a random sample. A modern neural network has an additional uncertainty component since the optimization of the network is random. Lakshminarayanan et al. (2017) noted that Deep Ensembles do not incorporate the classical uncertainty induced by the effect of finite data. In this paper, we present a computationally cheap extension of Deep Ensembles for the regression setting, called Bootstrapped Deep Ensembles, that explicitly takes this classical effect of finite data into account using a modified version of the parametric bootstrap. We demonstrate through an experimental study that our method significantly improves upon standar
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#35780;&#20272;&#26426;&#22120;&#23398;&#20064;&#22238;&#24402;&#20013;&#30340;&#19981;&#30830;&#23450;&#24615;&#20272;&#35745;&#65292;&#21457;&#29616;&#30446;&#21069;&#30340;&#35780;&#20272;&#26041;&#27861;&#23384;&#22312;&#20005;&#37325;&#32570;&#38519;&#65292;&#26080;&#27861;&#20934;&#30830;&#35780;&#20272;&#20272;&#35745;&#36136;&#37327;&#21644;&#39044;&#27979;&#21306;&#38388;&#30340;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2106.03395</link><description>&lt;p&gt;
&#22914;&#20309;&#35780;&#20272;&#26426;&#22120;&#23398;&#20064;&#22238;&#24402;&#20013;&#30340;&#19981;&#30830;&#23450;&#24615;&#20272;&#35745;&#65311;
&lt;/p&gt;
&lt;p&gt;
How to Evaluate Uncertainty Estimates in Machine Learning for Regression?. (arXiv:2106.03395v2 [stat.ML] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2106.03395
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#35780;&#20272;&#26426;&#22120;&#23398;&#20064;&#22238;&#24402;&#20013;&#30340;&#19981;&#30830;&#23450;&#24615;&#20272;&#35745;&#65292;&#21457;&#29616;&#30446;&#21069;&#30340;&#35780;&#20272;&#26041;&#27861;&#23384;&#22312;&#20005;&#37325;&#32570;&#38519;&#65292;&#26080;&#27861;&#20934;&#30830;&#35780;&#20272;&#20272;&#35745;&#36136;&#37327;&#21644;&#39044;&#27979;&#21306;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#31070;&#32463;&#32593;&#32476;&#30340;&#26222;&#21450;&#65292;&#23545;&#20110;&#30456;&#24212;&#30340;&#19981;&#30830;&#23450;&#24615;&#20272;&#35745;&#30340;&#38656;&#27714;&#20063;&#36234;&#26469;&#36234;&#22823;&#12290;&#30446;&#21069;&#26377;&#20004;&#31181;&#20027;&#35201;&#30340;&#26041;&#27861;&#26469;&#27979;&#35797;&#36825;&#20123;&#20272;&#35745;&#30340;&#36136;&#37327;&#12290;&#22823;&#22810;&#25968;&#26041;&#27861;&#36755;&#20986;&#19968;&#20010;&#27010;&#29575;&#23494;&#24230;&#65292;&#21487;&#20197;&#36890;&#36807;&#22312;&#27979;&#35797;&#38598;&#19978;&#35780;&#20272;&#20854;&#23545;&#25968;&#20284;&#28982;&#26469;&#36827;&#34892;&#27604;&#36739;&#12290;&#20854;&#20182;&#26041;&#27861;&#30452;&#25509;&#36755;&#20986;&#19968;&#20010;&#39044;&#27979;&#21306;&#38388;&#65292;&#36890;&#24120;&#36890;&#36807;&#26816;&#26597;&#33853;&#20837;&#30456;&#24212;&#39044;&#27979;&#21306;&#38388;&#30340;&#27979;&#35797;&#28857;&#30340;&#27604;&#20363;&#26469;&#36827;&#34892;&#27979;&#35797;&#12290;&#30452;&#35266;&#19978;&#30475;&#65292;&#36825;&#20004;&#31181;&#26041;&#27861;&#37117;&#26159;&#21512;&#29702;&#30340;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#36890;&#36807;&#29702;&#35770;&#35770;&#35777;&#21644;&#27169;&#25311;&#23454;&#39564;&#34920;&#26126;&#65292;&#35780;&#20272;&#19981;&#30830;&#23450;&#24615;&#20272;&#35745;&#36136;&#37327;&#30340;&#36825;&#20004;&#31181;&#26041;&#24335;&#37117;&#23384;&#22312;&#20005;&#37325;&#32570;&#38519;&#12290;&#39318;&#20808;&#65292;&#36825;&#20004;&#31181;&#26041;&#27861;&#26080;&#27861;&#20998;&#31163;&#20849;&#21516;&#20135;&#29983;&#39044;&#27979;&#19981;&#30830;&#23450;&#24615;&#30340;&#21508;&#20010;&#32452;&#25104;&#37096;&#20998;&#65292;&#20174;&#32780;&#38590;&#20197;&#35780;&#20272;&#36825;&#20123;&#32452;&#25104;&#37096;&#20998;&#30340;&#20272;&#35745;&#36136;&#37327;&#12290;&#20854;&#27425;&#65292;&#26356;&#22909;&#30340;&#23545;&#25968;&#20284;&#28982;&#24182;&#19981;&#20445;&#35777;&#26356;&#22909;&#30340;&#39044;&#27979;&#21306;&#38388;&#65292;&#32780;&#36825;&#36890;&#24120;&#26159;&#36825;&#20123;&#26041;&#27861;&#22312;&#23454;&#36341;&#20013;&#25152;&#29992;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
As neural networks become more popular, the need for accompanying uncertainty estimates increases. There are currently two main approaches to test the quality of these estimates. Most methods output a density. They can be compared by evaluating their loglikelihood on a test set. Other methods output a prediction interval directly. These methods are often tested by examining the fraction of test points that fall inside the corresponding prediction intervals. Intuitively both approaches seem logical. However, we demonstrate through both theoretical arguments and simulations that both ways of evaluating the quality of uncertainty estimates have serious flaws. Firstly, both approaches cannot disentangle the separate components that jointly create the predictive uncertainty, making it difficult to evaluate the quality of the estimates of these components. Secondly, a better loglikelihood does not guarantee better prediction intervals, which is what the methods are often used for in practice
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;"&#38543;&#26426;&#31181;&#26893;&#26862;&#26519;"&#30340;&#31639;&#27861;&#65292;&#36890;&#36807;&#20462;&#25913;&#38543;&#26426;&#26862;&#26519;&#31639;&#27861;&#65292;&#20445;&#30041;&#20999;&#20998;&#21518;&#30340;&#26576;&#20123;&#21494;&#23376;&#65292;&#24418;&#25104;&#38750;&#20108;&#36827;&#21046;&#26641;&#65292;&#23454;&#29616;&#30452;&#25509;&#21487;&#35299;&#37322;&#30340;&#26641;&#38598;&#31639;&#27861;&#12290;&#35813;&#31639;&#27861;&#20855;&#26377;&#36739;&#22909;&#30340;&#39044;&#27979;&#21644;&#21487;&#35270;&#21270;&#29305;&#24615;&#12290;</title><link>http://arxiv.org/abs/2012.14563</link><description>&lt;p&gt;
&#38543;&#26426;&#31181;&#26893;&#26862;&#26519;&#65306;&#19968;&#31181;&#30452;&#25509;&#21487;&#35299;&#37322;&#30340;&#26641;&#38598;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Random Planted Forest: a directly interpretable tree ensemble. (arXiv:2012.14563v3 [stat.ML] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2012.14563
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;"&#38543;&#26426;&#31181;&#26893;&#26862;&#26519;"&#30340;&#31639;&#27861;&#65292;&#36890;&#36807;&#20462;&#25913;&#38543;&#26426;&#26862;&#26519;&#31639;&#27861;&#65292;&#20445;&#30041;&#20999;&#20998;&#21518;&#30340;&#26576;&#20123;&#21494;&#23376;&#65292;&#24418;&#25104;&#38750;&#20108;&#36827;&#21046;&#26641;&#65292;&#23454;&#29616;&#30452;&#25509;&#21487;&#35299;&#37322;&#30340;&#26641;&#38598;&#31639;&#27861;&#12290;&#35813;&#31639;&#27861;&#20855;&#26377;&#36739;&#22909;&#30340;&#39044;&#27979;&#21644;&#21487;&#35270;&#21270;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#21487;&#35299;&#37322;&#30340;&#22522;&#20110;&#26641;&#30340;&#22238;&#24402;&#31639;&#27861;&#12290;&#25105;&#20204;&#30340;&#21160;&#26426;&#26159;&#20174;&#21151;&#33021;&#20998;&#35299;&#30340;&#35282;&#24230;&#20272;&#35745;&#26410;&#30693;&#30340;&#22238;&#24402;&#20989;&#25968;&#65292;&#20854;&#20013;&#21151;&#33021;&#32452;&#20214;&#23545;&#24212;&#20110;&#20302;&#38454;&#20132;&#20114;&#39033;&#12290;&#25105;&#20204;&#30340;&#24605;&#36335;&#26159;&#20462;&#25913;&#38543;&#26426;&#26862;&#26519;&#31639;&#27861;&#65292;&#36890;&#36807;&#22312;&#20999;&#20998;&#21518;&#20445;&#30041;&#26576;&#20123;&#21494;&#23376;&#32780;&#19981;&#26159;&#21024;&#38500;&#23427;&#20204;&#12290;&#36825;&#23548;&#33268;&#38750;&#20108;&#36827;&#21046;&#26641;&#65292;&#25105;&#20204;&#31216;&#20043;&#20026;&#31181;&#26893;&#26641;&#12290;&#23558;&#20854;&#25193;&#23637;&#20026;&#19968;&#20010;&#26862;&#26519;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#25105;&#20204;&#30340;&#38543;&#26426;&#31181;&#26893;&#26862;&#26519;&#31639;&#27861;&#12290;&#27492;&#22806;&#65292;&#21487;&#20197;&#23545;&#21494;&#23376;&#20869;&#21487;&#20197;&#30456;&#20114;&#20316;&#29992;&#30340;&#21327;&#21464;&#37327;&#25968;&#37327;&#36827;&#34892;&#38480;&#21046;&#12290;&#22914;&#26524;&#25105;&#20204;&#23558;&#20132;&#20114;&#38480;&#21046;&#35774;&#32622;&#20026;1&#65292;&#24471;&#21040;&#30340;&#20272;&#35745;&#37327;&#26159;&#19968;&#32500;&#20989;&#25968;&#30340;&#21644;&#12290;&#22312;&#21478;&#19968;&#20010;&#26497;&#31471;&#24773;&#20917;&#19979;&#65292;&#22914;&#26524;&#25105;&#20204;&#19981;&#35774;&#32622;&#38480;&#21046;&#65292;&#24471;&#21040;&#30340;&#20272;&#35745;&#37327;&#21644;&#30456;&#24212;&#30340;&#27169;&#22411;&#23545;&#22238;&#24402;&#20989;&#25968;&#30340;&#24418;&#24335;&#19981;&#21152;&#38480;&#21046;&#12290;&#22312;&#27169;&#25311;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#21457;&#29616;&#25105;&#20204;&#30340;&#38543;&#26426;&#31181;&#26893;&#26862;&#26519;&#31639;&#27861;&#20855;&#26377;&#40723;&#21169;&#20154;&#30340;&#39044;&#27979;&#21644;&#21487;&#35270;&#21270;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a novel interpretable tree based algorithm for prediction in a regression setting. Our motivation is to estimate the unknown regression function from a functional decomposition perspective in which the functional components correspond to lower order interaction terms. The idea is to modify the random forest algorithm by keeping certain leaves after they are split instead of deleting them. This leads to non-binary trees which we refer to as planted trees. An extension to a forest leads to our random planted forest algorithm. Additionally, the maximum number of covariates which can interact within a leaf can be bounded. If we set this interaction bound to one, the resulting estimator is a sum of one-dimensional functions. In the other extreme case, if we do not set a limit, the resulting estimator and corresponding model place no restrictions on the form of the regression function. In a simulation study we find encouraging prediction and visualisation properties of our rando
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#23545;&#25239;&#20803;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#35745;&#31639;&#22312;&#19968;&#32452;&#19982;&#21487;&#29992;&#30693;&#35782;&#30456;&#23481;&#30340;&#20808;&#39564;&#20998;&#24067;&#20013;&#26368;&#23567;&#21270;&#26368;&#22351;&#24773;&#20917;&#30340; Bayes &#39118;&#38505;&#30340; Gamma-Minimax &#20272;&#35745;&#22120;&#65292;&#25991;&#20013;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#31070;&#32463;&#32593;&#32476;&#31867;&#29992;&#20110;&#25552;&#20379;&#20272;&#35745;&#22120;&#31867;&#65292;&#20197;&#21450;&#20004;&#20010;&#23454;&#39564;&#29615;&#33410;&#29992;&#20110;&#35828;&#26126;&#35813;&#26041;&#27861;&#30340;&#24212;&#29992;&#12290;</title><link>http://arxiv.org/abs/2012.05465</link><description>&lt;p&gt;
&#21033;&#29992;&#20808;&#39564;&#30693;&#35782;&#30340; Gamma-Minimax &#20272;&#35745;&#22120;&#30340;&#23545;&#25239;&#20803;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Adversarial Meta-Learning of Gamma-Minimax Estimators That Leverage Prior Knowledge. (arXiv:2012.05465v4 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2012.05465
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#23545;&#25239;&#20803;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#35745;&#31639;&#22312;&#19968;&#32452;&#19982;&#21487;&#29992;&#30693;&#35782;&#30456;&#23481;&#30340;&#20808;&#39564;&#20998;&#24067;&#20013;&#26368;&#23567;&#21270;&#26368;&#22351;&#24773;&#20917;&#30340; Bayes &#39118;&#38505;&#30340; Gamma-Minimax &#20272;&#35745;&#22120;&#65292;&#25991;&#20013;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#31070;&#32463;&#32593;&#32476;&#31867;&#29992;&#20110;&#25552;&#20379;&#20272;&#35745;&#22120;&#31867;&#65292;&#20197;&#21450;&#20004;&#20010;&#23454;&#39564;&#29615;&#33410;&#29992;&#20110;&#35828;&#26126;&#35813;&#26041;&#27861;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36125;&#21494;&#26031;&#20272;&#35745;&#25552;&#20379;&#20102;&#19968;&#31181;&#23558;&#33021;&#22815;&#20197;&#21333;&#20010;&#20808;&#39564;&#20998;&#24067;&#30340;&#24418;&#24335;&#34920;&#36798;&#30340;&#20808;&#39564;&#30693;&#35782;&#32467;&#21512;&#36215;&#26469;&#30340;&#26041;&#24335;&#12290;&#28982;&#32780;&#65292;&#24403;&#36825;&#31181;&#30693;&#35782;&#22826;&#27169;&#31946;&#65292;&#26080;&#27861;&#29992;&#21333;&#20010;&#20808;&#39564;&#34920;&#31034;&#26102;&#65292;&#23601;&#38656;&#35201;&#21478;&#19968;&#31181;&#26041;&#27861;&#12290;Gamma-minimax &#20272;&#35745;&#22120;&#25552;&#20379;&#20102;&#36825;&#26679;&#19968;&#31181;&#26041;&#27861;&#12290;&#36825;&#20123;&#20272;&#35745;&#22120;&#23558;&#22312;&#19982;&#21487;&#29992;&#30693;&#35782;&#30456;&#23481;&#30340;&#19968;&#32452;&#20808;&#39564;&#20998;&#24067; $\Gamma$ &#19978;&#26368;&#23567;&#21270;&#26368;&#22351;&#24773;&#20917;&#30340; Bayes &#39118;&#38505;&#12290;&#20256;&#32479;&#19978;&#65292;Gamma-minimax &#24615;&#36136;&#26159;&#20026;&#21442;&#25968;&#27169;&#22411;&#23450;&#20041;&#30340;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20026;&#19968;&#33324;&#27169;&#22411;&#23450;&#20041; Gamma-minimax &#20272;&#35745;&#22120;&#65292;&#24182;&#25552;&#20986;&#20102;&#21033;&#29992;&#19968;&#33324;&#21270;&#30697;&#38480;&#21046;&#30340;&#23545;&#25239;&#20803;&#23398;&#20064;&#31639;&#27861;&#26469;&#35745;&#31639;&#23427;&#20204;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#31070;&#32463;&#32593;&#32476;&#31867;&#65292;&#23427;&#25552;&#20379;&#20102;&#19968;&#31181;&#20016;&#23500;&#20294;&#26377;&#38480;&#32500;&#24230;&#30340;&#20272;&#35745;&#22120;&#31867;&#65292;&#21487;&#20197;&#20174;&#20013;&#36873;&#25321; Gamma-minimax &#20272;&#35745;&#22120;&#12290;&#25105;&#20204;&#22312;&#20004;&#20010;&#29615;&#33410;&#20013;&#35828;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#21363;&#20272;&#35745;&#26410;&#30693;&#25903;&#25345;&#20998;&#24067;&#30340;&#26679;&#26412;&#29109;&#21644;&#21518;&#20998;&#23618;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
Bayes estimators are well known to provide a means to incorporate prior knowledge that can be expressed in terms of a single prior distribution. However, when this knowledge is too vague to express with a single prior, an alternative approach is needed. Gamma-minimax estimators provide such an approach. These estimators minimize the worst-case Bayes risk over a set $\Gamma$ of prior distributions that are compatible with the available knowledge. Traditionally, Gamma-minimaxity is defined for parametric models. In this work, we define Gamma-minimax estimators for general models and propose adversarial meta-learning algorithms to compute them when the set of prior distributions is constrained by generalized moments. Accompanying convergence guarantees are also provided. We also introduce a neural network class that provides a rich, but finite-dimensional, class of estimators from which a Gamma-minimax estimator can be selected. We illustrate our method in two settings, namely entropy est
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#36890;&#36807;&#24341;&#20837;&#19968;&#31181;&#24230;&#37327;&#23618;&#27425;&#32858;&#31867;&#30340;&#23545;&#24212;&#20132;&#38169;&#36317;&#31163;&#65292;&#30740;&#31350;&#20102;&#19968;&#31181;&#31283;&#23450;&#19968;&#33268;&#30340;&#23494;&#24230;-based&#32858;&#31867;&#31639;&#27861;&#65292;&#25552;&#20379;&#20102;&#19968;&#20010;&#20174;&#19968;&#21442;&#25968;&#23618;&#27425;&#32858;&#31867;&#20013;&#25552;&#21462;&#21333;&#20010;&#32858;&#31867;&#30340;&#31639;&#27861;&#65292;&#24182;&#35777;&#26126;&#20102;&#35813;&#31639;&#27861;&#30340;&#19968;&#33268;&#24615;&#21644;&#31283;&#23450;&#24615;&#12290;</title><link>http://arxiv.org/abs/2005.09048</link><description>&lt;p&gt;
&#31283;&#23450;&#19968;&#33268;&#30340;&#23494;&#24230;-based&#32858;&#31867;&#31639;&#27861;&#36890;&#36807;&#22810;&#21442;&#25968;&#25345;&#32493;&#24615;
&lt;/p&gt;
&lt;p&gt;
Stable and consistent density-based clustering via multiparameter persistence. (arXiv:2005.09048v3 [math.ST] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2005.09048
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#36890;&#36807;&#24341;&#20837;&#19968;&#31181;&#24230;&#37327;&#23618;&#27425;&#32858;&#31867;&#30340;&#23545;&#24212;&#20132;&#38169;&#36317;&#31163;&#65292;&#30740;&#31350;&#20102;&#19968;&#31181;&#31283;&#23450;&#19968;&#33268;&#30340;&#23494;&#24230;-based&#32858;&#31867;&#31639;&#27861;&#65292;&#25552;&#20379;&#20102;&#19968;&#20010;&#20174;&#19968;&#21442;&#25968;&#23618;&#27425;&#32858;&#31867;&#20013;&#25552;&#21462;&#21333;&#20010;&#32858;&#31867;&#30340;&#31639;&#27861;&#65292;&#24182;&#35777;&#26126;&#20102;&#35813;&#31639;&#27861;&#30340;&#19968;&#33268;&#24615;&#21644;&#31283;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#20013;&#30340;&#24230;-Rips&#26500;&#36896;&#65292;&#23427;&#25552;&#20379;&#20102;&#19968;&#31181;&#23494;&#24230;&#25935;&#24863;&#30340;&#22810;&#21442;&#25968;&#23618;&#27425;&#32858;&#31867;&#31639;&#27861;&#12290;&#25105;&#20204;&#20351;&#29992;&#25105;&#20204;&#24341;&#20837;&#30340;&#19968;&#31181;&#24230;&#37327;&#23618;&#27425;&#32858;&#31867;&#30340;&#23545;&#24212;&#20132;&#38169;&#36317;&#31163;&#65292;&#20998;&#26512;&#20102;&#23427;&#23545;&#36755;&#20837;&#25968;&#25454;&#30340;&#25200;&#21160;&#30340;&#31283;&#23450;&#24615;&#12290;&#20174;&#24230;-Rips&#20013;&#21462;&#26576;&#20123;&#19968;&#21442;&#25968;&#20999;&#29255;&#21487;&#20197;&#24674;&#22797;&#20986;&#24050;&#30693;&#30340;&#22522;&#20110;&#23494;&#24230;&#30340;&#32858;&#31867;&#26041;&#27861;&#65292;&#20294;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#20123;&#26041;&#27861;&#26159;&#19981;&#31283;&#23450;&#30340;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20316;&#20026;&#22810;&#21442;&#25968;&#23545;&#35937;&#30340;&#24230;-Rips&#26159;&#31283;&#23450;&#30340;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#20174;&#24230;-Rips&#20013;&#21462;&#20999;&#29255;&#30340;&#26367;&#20195;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#20135;&#29983;&#19968;&#20010;&#20855;&#26377;&#26356;&#22909;&#31283;&#23450;&#24615;&#23646;&#24615;&#30340;&#19968;&#21442;&#25968;&#23618;&#27425;&#32858;&#31867;&#31639;&#27861;&#12290;&#25105;&#20204;&#20351;&#29992;&#23545;&#24212;&#20132;&#38169;&#36317;&#31163;&#35777;&#26126;&#20102;&#35813;&#31639;&#27861;&#30340;&#19968;&#33268;&#24615;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#20174;&#19968;&#21442;&#25968;&#23618;&#27425;&#32858;&#31867;&#20013;&#25552;&#21462;&#21333;&#20010;&#32858;&#31867;&#30340;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#22312;&#23545;&#24212;&#20132;&#38169;&#36317;&#31163;&#26041;&#38754;&#26159;&#31283;&#23450;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the degree-Rips construction from topological data analysis, which provides a density-sensitive, multiparameter hierarchical clustering algorithm. We analyze its stability to perturbations of the input data using the correspondence-interleaving distance, a metric for hierarchical clusterings that we introduce. Taking certain one-parameter slices of degree-Rips recovers well-known methods for density-based clustering, but we show that these methods are unstable. However, we prove that degree-Rips, as a multiparameter object, is stable, and we propose an alternative approach for taking slices of degree-Rips, which yields a one-parameter hierarchical clustering algorithm with better stability properties. We prove that this algorithm is consistent, using the correspondence-interleaving distance. We provide an algorithm for extracting a single clustering from one-parameter hierarchical clusterings, which is stable with respect to the correspondence-interleaving distance. And, we
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35777;&#23454;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#40065;&#26834;&#24615;&#30340;&#32479;&#19968;&#26694;&#26550;&#65292;&#36890;&#36807;&#38543;&#26426;&#24179;&#28369;&#25216;&#26415;&#23454;&#29616;&#23545;&#35268;&#36991;&#21644;&#21518;&#38376;&#25915;&#20987;&#30340;&#40065;&#26834;&#24615;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#40065;&#26834;&#35757;&#32451;&#36807;&#31243;RAB&#65292;&#24182;&#35777;&#26126;&#20854;&#26377;&#25928;&#24615;&#21644;&#32039;&#23494;&#24615;&#12290;&#22312;&#29702;&#35770;&#19978;&#35777;&#26126;&#20102;&#23545;&#21518;&#38376;&#25915;&#20987;&#36827;&#34892;&#40065;&#26834;&#24615;&#20445;&#25252;&#30340;&#21487;&#34892;&#24615;&#12290;</title><link>http://arxiv.org/abs/2003.08904</link><description>&lt;p&gt;
RAB: &#21487;&#35777;&#23454;&#25269;&#25239;&#21518;&#38376;&#25915;&#20987;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
RAB: Provable Robustness Against Backdoor Attacks. (arXiv:2003.08904v8 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2003.08904
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35777;&#23454;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#40065;&#26834;&#24615;&#30340;&#32479;&#19968;&#26694;&#26550;&#65292;&#36890;&#36807;&#38543;&#26426;&#24179;&#28369;&#25216;&#26415;&#23454;&#29616;&#23545;&#35268;&#36991;&#21644;&#21518;&#38376;&#25915;&#20987;&#30340;&#40065;&#26834;&#24615;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#40065;&#26834;&#35757;&#32451;&#36807;&#31243;RAB&#65292;&#24182;&#35777;&#26126;&#20854;&#26377;&#25928;&#24615;&#21644;&#32039;&#23494;&#24615;&#12290;&#22312;&#29702;&#35770;&#19978;&#35777;&#26126;&#20102;&#23545;&#21518;&#38376;&#25915;&#20987;&#36827;&#34892;&#40065;&#26834;&#24615;&#20445;&#25252;&#30340;&#21487;&#34892;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#30340;&#30740;&#31350;&#34920;&#26126;&#65292;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#65288;DNNs&#65289;&#23481;&#26131;&#21463;&#21040;&#23545;&#25239;&#24615;&#25915;&#20987;&#65292;&#21253;&#25324;&#35268;&#36991;&#25915;&#20987;&#21644;&#21518;&#38376;&#65288;&#27602;&#21270;&#65289;&#25915;&#20987;&#12290;&#22312;&#38450;&#24481;&#26041;&#38754;&#65292;&#23545;&#20110;&#35268;&#36991;&#25915;&#20987;&#24050;&#32463;&#36827;&#34892;&#20102;&#23494;&#38598;&#30340;&#25913;&#36827;&#65292;&#21253;&#25324;&#32463;&#39564;&#21644;&#21487;&#35777;&#23454;&#30340;&#40065;&#26834;&#24615;&#65307;&#28982;&#32780;&#65292;&#23545;&#20110;&#21518;&#38376;&#25915;&#20987;&#30340;&#21487;&#35777;&#23454;&#40065;&#26834;&#24615;&#20173;&#28982;&#24456;&#23569;&#34987;&#25506;&#32034;&#12290;&#26412;&#25991;&#38024;&#23545;&#36890;&#29992;&#23041;&#32961;&#27169;&#22411;&#65292;&#29305;&#21035;&#26159;&#21518;&#38376;&#25915;&#20987;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#35777;&#23454;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#40065;&#26834;&#24615;&#30340;&#32479;&#19968;&#26694;&#26550;&#65292;&#24182;&#23637;&#31034;&#20102;&#22914;&#20309;&#21033;&#29992;&#38543;&#26426;&#24179;&#28369;&#25216;&#26415;&#26469;&#20445;&#35777;&#23545;&#35268;&#36991;&#21644;&#21518;&#38376;&#25915;&#20987;&#30340;&#40065;&#26834;&#24615;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#39318;&#20010;&#40065;&#26834;&#35757;&#32451;&#36807;&#31243;RAB&#65292;&#20351;&#35757;&#32451;&#27169;&#22411;&#24179;&#28369;&#24182;&#20445;&#35777;&#20854;&#23545;&#21518;&#38376;&#25915;&#20987;&#30340;&#40065;&#26834;&#24615;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#20351;&#29992;RAB&#35757;&#32451;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#40065;&#26834;&#24615;&#30028;&#38480;&#65292;&#24182;&#35777;&#26126;&#25105;&#20204;&#30340;&#40065;&#26834;&#24615;&#30028;&#38480;&#26159;&#32039;&#23494;&#30340;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#22312;&#29702;&#35770;&#19978;&#23637;&#31034;&#20102;&#23454;&#29616;&#23545;&#21518;&#38376;&#25915;&#20987;&#36827;&#34892;&#40065;&#26834;&#24615;&#20445;&#25252;&#26159;&#21487;&#33021;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recent studies have shown that deep neural networks (DNNs) are vulnerable to adversarial attacks, including evasion and backdoor (poisoning) attacks. On the defense side, there have been intensive efforts on improving both empirical and provable robustness against evasion attacks; however, the provable robustness against backdoor attacks still remains largely unexplored. In this paper, we focus on certifying the machine learning model robustness against general threat models, especially backdoor attacks. We first provide a unified framework via randomized smoothing techniques and show how it can be instantiated to certify the robustness against both evasion and backdoor attacks. We then propose the first robust training process, RAB, to smooth the trained model and certify its robustness against backdoor attacks. We prove the robustness bound for machine learning models trained with RAB and prove that our robustness bound is tight. In addition, we theoretically show that it is possible
&lt;/p&gt;</description></item></channel></rss>