<rss version="2.0"><channel><title>Chat Arxiv stat.ML</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ML</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20132;&#26367;&#26497;&#23567;&#21270;&#22312;&#38750;&#20984;&#20248;&#21270;&#20013;&#30340;&#28176;&#36817;&#21160;&#21147;&#23398;&#29305;&#24615;&#65292;&#36890;&#36807;&#22797;&#21046;&#26041;&#27861;&#36861;&#36394;&#28436;&#21270;&#36807;&#31243;&#65292;&#21457;&#29616;&#20854;&#21487;&#29992;&#20108;&#32500;&#31163;&#25955;&#38543;&#26426;&#36807;&#31243;&#26377;&#25928;&#25551;&#36848;&#65292;&#23384;&#22312;&#35760;&#24518;&#20381;&#36182;&#24615;&#12290;&#35813;&#29702;&#35770;&#26694;&#26550;&#36866;&#29992;&#20110;&#20998;&#26512;&#21508;&#31181;&#36845;&#20195;&#31639;&#27861;&#12290;</title><link>https://arxiv.org/abs/2402.04751</link><description>&lt;p&gt;
&#38750;&#20984;&#20248;&#21270;&#20013;Alternating Minimization&#30340;&#28176;&#36817;&#21160;&#21147;&#23398;
&lt;/p&gt;
&lt;p&gt;
Asymptotic Dynamics of Alternating Minimization for Non-Convex Optimization
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.04751
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20132;&#26367;&#26497;&#23567;&#21270;&#22312;&#38750;&#20984;&#20248;&#21270;&#20013;&#30340;&#28176;&#36817;&#21160;&#21147;&#23398;&#29305;&#24615;&#65292;&#36890;&#36807;&#22797;&#21046;&#26041;&#27861;&#36861;&#36394;&#28436;&#21270;&#36807;&#31243;&#65292;&#21457;&#29616;&#20854;&#21487;&#29992;&#20108;&#32500;&#31163;&#25955;&#38543;&#26426;&#36807;&#31243;&#26377;&#25928;&#25551;&#36848;&#65292;&#23384;&#22312;&#35760;&#24518;&#20381;&#36182;&#24615;&#12290;&#35813;&#29702;&#35770;&#26694;&#26550;&#36866;&#29992;&#20110;&#20998;&#26512;&#21508;&#31181;&#36845;&#20195;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#20855;&#26377;&#27491;&#24577;&#20998;&#24067;&#21327;&#21464;&#37327;&#30340;&#21452;&#32447;&#24615;&#38750;&#20984;&#20989;&#25968;&#20248;&#21270;&#20013;&#24212;&#29992;&#20132;&#26367;&#26497;&#23567;&#21270;&#30340;&#28176;&#36817;&#21160;&#21147;&#23398;&#12290;&#25105;&#20204;&#37319;&#29992;&#32479;&#35745;&#29289;&#29702;&#23398;&#20013;&#30340;&#22797;&#21046;&#26041;&#27861;&#65292;&#36890;&#36807;&#22810;&#27493;&#26041;&#27861;&#31934;&#30830;&#36861;&#36394;&#31639;&#27861;&#30340;&#28436;&#21464;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#21160;&#21147;&#23398;&#21487;&#20197;&#26377;&#25928;&#22320;&#29992;&#19968;&#20010;&#20108;&#32500;&#31163;&#25955;&#38543;&#26426;&#36807;&#31243;&#26469;&#25551;&#36848;&#65292;&#27599;&#19968;&#27493;&#37117;&#20381;&#36182;&#20110;&#25152;&#26377;&#20808;&#21069;&#30340;&#26102;&#38388;&#27493;&#38271;&#65292;&#25581;&#31034;&#20102;&#36807;&#31243;&#20013;&#30340;&#35760;&#24518;&#20381;&#36182;&#24615;&#12290;&#26412;&#25991;&#24320;&#21457;&#30340;&#29702;&#35770;&#26694;&#26550;&#24191;&#27867;&#36866;&#29992;&#20110;&#21508;&#31181;&#36845;&#20195;&#31639;&#27861;&#30340;&#20998;&#26512;&#65292;&#36229;&#36234;&#20102;&#20132;&#26367;&#26497;&#23567;&#21270;&#30340;&#33539;&#22260;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study investigates the asymptotic dynamics of alternating minimization applied to optimize a bilinear non-convex function with normally distributed covariates. We employ the replica method from statistical physics in a multi-step approach to precisely trace the algorithm's evolution. Our findings indicate that the dynamics can be described effectively by a two--dimensional discrete stochastic process, where each step depends on all previous time steps, revealing a memory dependency in the procedure. The theoretical framework developed in this work is broadly applicable for the analysis of various iterative algorithms, extending beyond the scope of alternating minimization.
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#21033;&#29992;&#22810;&#37325;&#20551;&#35774;&#26816;&#39564;&#30340;&#24605;&#24819;&#65292;&#26469;&#35774;&#35745;&#21487;&#38752;&#22320;&#25490;&#21517;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#20013;&#26368;&#37325;&#35201;&#29305;&#24449;&#30340;&#29305;&#24449;&#24402;&#22240;&#26041;&#27861;&#65292;&#26088;&#22312;&#35299;&#20915;SHAP&#21644;LIME&#31561;&#24120;&#29992;&#26041;&#27861;&#30001;&#20110;&#38543;&#26426;&#37319;&#26679;&#23548;&#33268;&#30340;&#39640;&#24230;&#19981;&#31283;&#23450;&#24615;&#38382;&#39064;&#12290;&#23454;&#39564;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#21644;&#35745;&#31639;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2401.15800</link><description>&lt;p&gt;
&#20351;&#29992;SHAP&#21644;LIME&#36827;&#34892;&#21487;&#35777;&#26126;&#31283;&#23450;&#30340;&#29305;&#24449;&#25490;&#21517;
&lt;/p&gt;
&lt;p&gt;
Provably Stable Feature Rankings with SHAP and LIME. (arXiv:2401.15800v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.15800
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#21033;&#29992;&#22810;&#37325;&#20551;&#35774;&#26816;&#39564;&#30340;&#24605;&#24819;&#65292;&#26469;&#35774;&#35745;&#21487;&#38752;&#22320;&#25490;&#21517;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#20013;&#26368;&#37325;&#35201;&#29305;&#24449;&#30340;&#29305;&#24449;&#24402;&#22240;&#26041;&#27861;&#65292;&#26088;&#22312;&#35299;&#20915;SHAP&#21644;LIME&#31561;&#24120;&#29992;&#26041;&#27861;&#30001;&#20110;&#38543;&#26426;&#37319;&#26679;&#23548;&#33268;&#30340;&#39640;&#24230;&#19981;&#31283;&#23450;&#24615;&#38382;&#39064;&#12290;&#23454;&#39564;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#21644;&#35745;&#31639;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29305;&#24449;&#24402;&#22240;&#26159;&#20102;&#35299;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#39044;&#27979;&#30340;&#26222;&#36941;&#24037;&#20855;&#12290;&#28982;&#32780;&#65292;&#29992;&#20110;&#35780;&#20998;&#36755;&#20837;&#21464;&#37327;&#30340;&#24120;&#29992;&#26041;&#27861;&#65292;&#22914;SHAP&#21644;LIME&#65292;&#30001;&#20110;&#38543;&#26426;&#37319;&#26679;&#32780;&#20855;&#26377;&#39640;&#24230;&#19981;&#31283;&#23450;&#24615;&#12290;&#20511;&#37492;&#22810;&#37325;&#20551;&#35774;&#26816;&#39564;&#30340;&#24605;&#24819;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#33021;&#22815;&#20197;&#39640;&#27010;&#29575;&#27491;&#30830;&#25490;&#21517;&#26368;&#37325;&#35201;&#29305;&#24449;&#30340;&#24402;&#22240;&#26041;&#27861;&#12290;&#25105;&#20204;&#30340;&#31639;&#27861;RankSHAP&#20445;&#35777;$K$&#20010;&#26368;&#39640;Shapley&#20540;&#20855;&#26377;&#36229;&#36807;$1-\alpha$&#30340;&#27491;&#30830;&#25490;&#24207;&#27010;&#29575;&#12290;&#23454;&#35777;&#32467;&#26524;&#35777;&#26126;&#20102;&#20854;&#26377;&#25928;&#24615;&#21644;&#20196;&#20154;&#21360;&#35937;&#28145;&#21051;&#30340;&#35745;&#31639;&#25928;&#29575;&#12290;&#25105;&#20204;&#36824;&#22312;&#20043;&#21069;&#30340;&#24037;&#20316;&#22522;&#30784;&#19978;&#20026;LIME&#25552;&#20379;&#20102;&#31867;&#20284;&#30340;&#32467;&#26524;&#65292;&#30830;&#20445;&#20197;&#27491;&#30830;&#39034;&#24207;&#36873;&#25321;&#26368;&#37325;&#35201;&#30340;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;
Feature attributions are ubiquitous tools for understanding the predictions of machine learning models. However, popular methods for scoring input variables such as SHAP and LIME suffer from high instability due to random sampling. Leveraging ideas from multiple hypothesis testing, we devise attribution methods that correctly rank the most important features with high probability. Our algorithm RankSHAP guarantees that the $K$ highest Shapley values have the proper ordering with probability exceeding $1-\alpha$. Empirical results demonstrate its validity and impressive computational efficiency. We also build on previous work to yield similar results for LIME, ensuring the most important features are selected in the right order.
&lt;/p&gt;</description></item></channel></rss>