<rss version="2.0"><channel><title>Chat Arxiv stat.ML</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ML</description><item><title>Cram&#26041;&#27861;&#26159;&#19968;&#31181;&#21516;&#26102;&#23398;&#20064;&#21644;&#35780;&#20272;&#30340;&#39640;&#25928;&#26041;&#27861;&#65292;&#21033;&#29992;&#25972;&#20010;&#26679;&#26412;&#36827;&#34892;&#35757;&#32451;&#21644;&#27979;&#35797;&#65292;&#27604;&#20256;&#32479;&#30340;&#26679;&#26412;&#20998;&#21106;&#31574;&#30053;&#26356;&#39640;&#25928;&#12290;</title><link>https://arxiv.org/abs/2403.07031</link><description>&lt;p&gt;
&#29992;&#20110;&#39640;&#25928;&#21516;&#26102;&#23398;&#20064;&#21644;&#35780;&#20272;&#30340;Cram&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
The Cram Method for Efficient Simultaneous Learning and Evaluation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07031
&lt;/p&gt;
&lt;p&gt;
Cram&#26041;&#27861;&#26159;&#19968;&#31181;&#21516;&#26102;&#23398;&#20064;&#21644;&#35780;&#20272;&#30340;&#39640;&#25928;&#26041;&#27861;&#65292;&#21033;&#29992;&#25972;&#20010;&#26679;&#26412;&#36827;&#34892;&#35757;&#32451;&#21644;&#27979;&#35797;&#65292;&#27604;&#20256;&#32479;&#30340;&#26679;&#26412;&#20998;&#21106;&#31574;&#30053;&#26356;&#39640;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20171;&#32461;&#20102;&#8220;Cram&#8221;&#26041;&#27861;&#65292;&#36825;&#26159;&#19968;&#31181;&#36890;&#29992;&#19988;&#39640;&#25928;&#30340;&#26041;&#27861;&#65292;&#20351;&#29992;&#36890;&#29992;&#30340;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#31639;&#27861;&#36827;&#34892;&#21516;&#26102;&#23398;&#20064;&#21644;&#35780;&#20272;&#12290;&#22312;&#25209;&#22788;&#29702;&#25968;&#25454;&#30340;&#21333;&#27425;&#20256;&#36882;&#20013;&#65292;&#35813;&#26041;&#27861;&#21453;&#22797;&#35757;&#32451;ML&#31639;&#27861;&#24182;&#27979;&#35797;&#20854;&#32463;&#39564;&#24615;&#33021;&#12290;&#30001;&#20110;&#23427;&#21516;&#26102;&#21033;&#29992;&#20102;&#25972;&#20010;&#26679;&#26412;&#36827;&#34892;&#23398;&#20064;&#21644;&#35780;&#20272;&#65292;&#25152;&#20197;Cram&#26041;&#27861;&#27604;&#26679;&#26412;&#20998;&#21106;&#35201;&#39640;&#25928;&#24471;&#22810;&#12290;Cram&#26041;&#27861;&#36824;&#33258;&#28982;&#22320;&#36866;&#29992;&#20110;&#22312;&#32447;&#23398;&#20064;&#31639;&#27861;&#65292;&#20351;&#20854;&#23454;&#26045;&#20855;&#26377;&#35745;&#31639;&#25928;&#29575;&#12290;&#20026;&#20102;&#23637;&#31034;Cram&#26041;&#27861;&#30340;&#24378;&#22823;&#20043;&#22788;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#26631;&#20934;&#31574;&#30053;&#23398;&#20064;&#35774;&#32622;&#65292;&#20854;&#20013;&#23558;Cram&#24212;&#29992;&#20110;&#30456;&#21516;&#25968;&#25454;&#20197;&#24320;&#21457;&#20010;&#24615;&#21270;&#27835;&#30103;&#35268;&#21017;&#65288;ITR&#65289;&#24182;&#20272;&#35745;&#22914;&#26524;&#23398;&#20064;&#30340;ITR&#34987;&#37096;&#32626;&#23558;&#20250;&#20135;&#29983;&#30340;&#24179;&#22343;&#32467;&#26524;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#26368;&#23567;&#19968;&#32452;&#20551;&#35774;&#19979;&#65292;&#30001;&#27492;&#20135;&#29983;&#30340;Cram&#35780;&#20272;&#20272;&#35745;&#22120;&#26159;&#19968;&#33268;&#19988;&#28176;&#36817;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07031v1 Announce Type: new  Abstract: We introduce the "cram" method, a general and efficient approach to simultaneous learning and evaluation using a generic machine learning (ML) algorithm. In a single pass of batched data, the proposed method repeatedly trains an ML algorithm and tests its empirical performance. Because it utilizes the entire sample for both learning and evaluation, cramming is significantly more data-efficient than sample-splitting. The cram method also naturally accommodates online learning algorithms, making its implementation computationally efficient. To demonstrate the power of the cram method, we consider the standard policy learning setting where cramming is applied to the same data to both develop an individualized treatment rule (ITR) and estimate the average outcome that would result if the learned ITR were to be deployed. We show that under a minimal set of assumptions, the resulting crammed evaluation estimator is consistent and asymptoticall
&lt;/p&gt;</description></item></channel></rss>