<rss version="2.0"><channel><title>Chat Arxiv stat.ML</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ML</description><item><title>&#36825;&#39033;&#32508;&#36848;&#20171;&#32461;&#20102;&#31070;&#32463;&#31526;&#21495;&#20154;&#24037;&#26234;&#33021;&#22312;&#30693;&#35782;&#22270;&#35889;&#25512;&#29702;&#26041;&#38754;&#30340;&#30740;&#31350;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#26368;&#36817;&#30340;&#26041;&#27861;&#35797;&#22270;&#23558;&#31526;&#21495;&#25512;&#29702;&#21644;&#28145;&#24230;&#23398;&#20064;&#30456;&#32467;&#21512;&#65292;&#20197;&#29983;&#25104;&#20855;&#26377;&#35299;&#37322;&#24615;&#12289;&#31454;&#20105;&#24615;&#33021;&#21147;&#24182;&#38598;&#25104;&#19987;&#23478;&#30693;&#35782;&#30340;&#27169;&#22411;&#12290;</title><link>https://arxiv.org/abs/2302.07200</link><description>&lt;p&gt;
&#30693;&#35782;&#22270;&#35889;&#25512;&#29702;&#30340;&#31070;&#32463;&#31526;&#21495;&#20154;&#24037;&#26234;&#33021;&#65306;&#19968;&#39033;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
Neurosymbolic AI for Reasoning over Knowledge Graphs: A Survey
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2302.07200
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#32508;&#36848;&#20171;&#32461;&#20102;&#31070;&#32463;&#31526;&#21495;&#20154;&#24037;&#26234;&#33021;&#22312;&#30693;&#35782;&#22270;&#35889;&#25512;&#29702;&#26041;&#38754;&#30340;&#30740;&#31350;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#26368;&#36817;&#30340;&#26041;&#27861;&#35797;&#22270;&#23558;&#31526;&#21495;&#25512;&#29702;&#21644;&#28145;&#24230;&#23398;&#20064;&#30456;&#32467;&#21512;&#65292;&#20197;&#29983;&#25104;&#20855;&#26377;&#35299;&#37322;&#24615;&#12289;&#31454;&#20105;&#24615;&#33021;&#21147;&#24182;&#38598;&#25104;&#19987;&#23478;&#30693;&#35782;&#30340;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31070;&#32463;&#31526;&#21495;&#20154;&#24037;&#26234;&#33021;&#26159;&#19968;&#20010;&#26085;&#30410;&#27963;&#36291;&#30340;&#30740;&#31350;&#39046;&#22495;&#65292;&#23427;&#23558;&#31526;&#21495;&#25512;&#29702;&#26041;&#27861;&#19982;&#28145;&#24230;&#23398;&#20064;&#30456;&#32467;&#21512;&#65292;&#20197;&#21033;&#29992;&#23427;&#20204;&#30340;&#20114;&#34917;&#20248;&#21183;&#12290;&#38543;&#30528;&#30693;&#35782;&#22270;&#35889;&#25104;&#20026;&#34920;&#31034;&#24322;&#26500;&#21644;&#22810;&#20851;&#31995;&#25968;&#25454;&#30340;&#19968;&#31181;&#27969;&#34892;&#26041;&#24335;&#65292;&#23545;&#22270;&#32467;&#26500;&#36827;&#34892;&#25512;&#29702;&#30340;&#26041;&#27861;&#24320;&#22987;&#36981;&#24490;&#36825;&#31181;&#31070;&#32463;&#31526;&#21495;&#33539;&#24335;&#12290;&#20256;&#32479;&#19978;&#65292;&#36825;&#20123;&#26041;&#27861;&#35201;&#20040;&#21033;&#29992;&#22522;&#20110;&#35268;&#21017;&#30340;&#25512;&#29702;&#65292;&#35201;&#20040;&#29983;&#25104;&#20195;&#34920;&#24615;&#30340;&#25968;&#20540;&#23884;&#20837;&#65292;&#20174;&#20013;&#21487;&#20197;&#25552;&#21462;&#20986;&#27169;&#24335;&#12290;&#28982;&#32780;&#65292;&#26368;&#36817;&#30340;&#19968;&#20123;&#30740;&#31350;&#23581;&#35797;&#24357;&#21512;&#36825;&#31181;&#20108;&#20803;&#23545;&#31435;&#65292;&#25552;&#20986;&#20102;&#33021;&#22815;&#20419;&#36827;&#21487;&#35299;&#37322;&#24615;&#12289;&#20445;&#25345;&#31454;&#20105;&#24615;&#33021;&#21147;&#24182;&#38598;&#25104;&#19987;&#23478;&#30693;&#35782;&#30340;&#27169;&#22411;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#35843;&#26597;&#20102;&#22312;&#30693;&#35782;&#22270;&#35889;&#19978;&#25191;&#34892;&#31070;&#32463;&#31526;&#21495;&#25512;&#29702;&#20219;&#21153;&#30340;&#26041;&#27861;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20998;&#31867;&#27861;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19977;&#20010;&#20027;&#35201;&#31867;&#21035;&#65306;&#65288;1&#65289;&#36923;&#36753;&#20449;&#24687;&#23884;&#20837;&#26041;&#27861;&#65292;&#65288;2&#65289;&#22522;&#20110;&#23884;&#20837;&#30340;&#26041;&#27861;&#19982;&#36923;&#36753;&#19968;&#33268;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Neurosymbolic AI is an increasingly active area of research that combines symbolic reasoning methods with deep learning to leverage their complementary benefits. As knowledge graphs are becoming a popular way to represent heterogeneous and multi-relational data, methods for reasoning on graph structures have attempted to follow this neurosymbolic paradigm. Traditionally, such approaches have utilized either rule-based inference or generated representative numerical embeddings from which patterns could be extracted. However, several recent studies have attempted to bridge this dichotomy to generate models that facilitate interpretability, maintain competitive performance, and integrate expert knowledge. Therefore, we survey methods that perform neurosymbolic reasoning tasks on knowledge graphs and propose a novel taxonomy by which we can classify them. Specifically, we propose three major categories: (1) logically-informed embedding approaches, (2) embedding approaches with logical cons
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27169;&#22411;&#30340;&#39044;&#27979;&#19981;&#30830;&#23450;&#24615;&#24230;&#37327;&#65292;&#21363;&#26368;&#23567;&#19981;&#19968;&#33268;&#24230;&#37327;&#65288;LDM&#65289;&#65292;&#29992;&#20110;&#35299;&#20915;&#22797;&#26434;&#20915;&#31574;&#36793;&#30028;&#24773;&#20917;&#19979;&#30340;&#20027;&#21160;&#23398;&#20064;&#38382;&#39064;&#12290;&#36890;&#36807;&#26597;&#35810;&#20855;&#26377;&#26368;&#23567;LDM&#30340;&#26410;&#26631;&#35760;&#25968;&#25454;&#65292;&#21487;&#20197;&#25552;&#39640;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2401.09787</link><description>&lt;p&gt;
&#26597;&#35810;&#26131;&#20110;&#32763;&#36716;&#26679;&#26412;&#30340;&#28145;&#24230;&#20027;&#21160;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Querying Easily Flip-flopped Samples for Deep Active Learning. (arXiv:2401.09787v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.09787
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27169;&#22411;&#30340;&#39044;&#27979;&#19981;&#30830;&#23450;&#24615;&#24230;&#37327;&#65292;&#21363;&#26368;&#23567;&#19981;&#19968;&#33268;&#24230;&#37327;&#65288;LDM&#65289;&#65292;&#29992;&#20110;&#35299;&#20915;&#22797;&#26434;&#20915;&#31574;&#36793;&#30028;&#24773;&#20917;&#19979;&#30340;&#20027;&#21160;&#23398;&#20064;&#38382;&#39064;&#12290;&#36890;&#36807;&#26597;&#35810;&#20855;&#26377;&#26368;&#23567;LDM&#30340;&#26410;&#26631;&#35760;&#25968;&#25454;&#65292;&#21487;&#20197;&#25552;&#39640;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20027;&#21160;&#23398;&#20064;&#26159;&#19968;&#31181;&#26426;&#22120;&#23398;&#20064;&#33539;&#24335;&#65292;&#26088;&#22312;&#36890;&#36807;&#36873;&#25321;&#21644;&#26597;&#35810;&#26410;&#26631;&#35760;&#25968;&#25454;&#26469;&#25552;&#39640;&#27169;&#22411;&#30340;&#24615;&#33021;&#12290;&#19968;&#31181;&#26377;&#25928;&#30340;&#36873;&#25321;&#31574;&#30053;&#26159;&#22522;&#20110;&#27169;&#22411;&#30340;&#39044;&#27979;&#19981;&#30830;&#23450;&#24615;&#65292;&#36825;&#21487;&#20197;&#35299;&#37322;&#20026;&#26679;&#26412;&#30340;&#20449;&#24687;&#37327;&#24230;&#37327;&#12290;&#26679;&#26412;&#21040;&#20915;&#31574;&#36793;&#30028;&#30340;&#36317;&#31163;&#26159;&#19968;&#31181;&#33258;&#28982;&#30340;&#39044;&#27979;&#19981;&#30830;&#23450;&#24615;&#24230;&#37327;&#65292;&#20294;&#36890;&#24120;&#38590;&#20197;&#35745;&#31639;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#22810;&#31867;&#20998;&#31867;&#20219;&#21153;&#20013;&#24418;&#25104;&#30340;&#22797;&#26434;&#20915;&#31574;&#36793;&#30028;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#8220;&#26368;&#23567;&#19981;&#19968;&#33268;&#24230;&#37327;&#8221;&#65288;LDM&#65289;&#65292;&#23450;&#20041;&#20026;&#39044;&#27979;&#26631;&#31614;&#19981;&#19968;&#33268;&#30340;&#26368;&#23567;&#27010;&#29575;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;LDM&#30340;&#20272;&#35745;&#22120;&#22312;&#28201;&#21644;&#20551;&#35774;&#19979;&#26159;&#28176;&#36817;&#19968;&#33268;&#30340;&#12290;&#35813;&#20272;&#35745;&#22120;&#35745;&#31639;&#25928;&#29575;&#39640;&#65292;&#24182;&#19988;&#21487;&#20197;&#36890;&#36807;&#21442;&#25968;&#25200;&#21160;&#36731;&#26494;&#23454;&#29616;&#22312;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#20013;&#20351;&#29992;&#12290;&#22522;&#20110;LDM&#30340;&#20027;&#21160;&#23398;&#20064;&#36890;&#36807;&#26597;&#35810;&#20855;&#26377;&#26368;&#23567;LDM&#30340;&#26410;&#26631;&#35760;&#25968;&#25454;&#26469;&#25191;&#34892;&#12290;
&lt;/p&gt;
&lt;p&gt;
Active learning is a machine learning paradigm that aims to improve the performance of a model by strategically selecting and querying unlabeled data. One effective selection strategy is to base it on the model's predictive uncertainty, which can be interpreted as a measure of how informative a sample is. The sample's distance to the decision boundary is a natural measure of predictive uncertainty, but it is often intractable to compute, especially for complex decision boundaries formed in multiclass classification tasks. To address this issue, this paper proposes the {\it least disagree metric} (LDM), defined as the smallest probability of disagreement of the predicted label, and an estimator for LDM proven to be asymptotically consistent under mild assumptions. The estimator is computationally efficient and can be easily implemented for deep learning models using parameter perturbation. The LDM-based active learning is performed by querying unlabeled data with the smallest LDM. Exper
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#31283;&#23450;&#20272;&#35745;&#29983;&#23384;&#22240;&#26524;&#25928;&#24212;&#30340;&#38382;&#39064;&#65292;&#30740;&#31350;&#34920;&#26126;&#20256;&#32479;&#30340;&#20272;&#35745;&#26041;&#27861;&#23384;&#22312;&#20559;&#24046;&#65292;&#32780;&#36817;&#26399;&#38750;&#20542;&#26012;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#23613;&#31649;&#29702;&#35770;&#19978;&#26377;&#21560;&#24341;&#21147;&#65292;&#20294;&#22312;&#29983;&#23384;&#38382;&#39064;&#20013;&#23384;&#22312;&#19981;&#31283;&#23450;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.02278</link><description>&lt;p&gt;
&#31283;&#23450;&#20272;&#35745;&#29983;&#23384;&#22240;&#26524;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Stable Estimation of Survival Causal Effects. (arXiv:2310.02278v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.02278
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#31283;&#23450;&#20272;&#35745;&#29983;&#23384;&#22240;&#26524;&#25928;&#24212;&#30340;&#38382;&#39064;&#65292;&#30740;&#31350;&#34920;&#26126;&#20256;&#32479;&#30340;&#20272;&#35745;&#26041;&#27861;&#23384;&#22312;&#20559;&#24046;&#65292;&#32780;&#36817;&#26399;&#38750;&#20542;&#26012;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#23613;&#31649;&#29702;&#35770;&#19978;&#26377;&#21560;&#24341;&#21147;&#65292;&#20294;&#22312;&#29983;&#23384;&#38382;&#39064;&#20013;&#23384;&#22312;&#19981;&#31283;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20272;&#35745;&#29983;&#23384;&#22240;&#26524;&#25928;&#24212;&#30340;&#38382;&#39064;&#65292;&#21363;&#34920;&#24449;&#24178;&#39044;&#23545;&#29983;&#23384;&#26102;&#38388;&#30340;&#24433;&#21709;&#65292;&#20363;&#22914;&#33647;&#29289;&#26159;&#21542;&#32553;&#30701;&#20102;&#20837;&#20303;ICU&#30340;&#26102;&#38388;&#25110;&#24191;&#21578;&#27963;&#21160;&#26159;&#21542;&#22686;&#21152;&#20102;&#39038;&#23458;&#20572;&#30041;&#26102;&#38388;&#12290; &#36807;&#21435;&#26368;&#27969;&#34892;&#30340;&#20272;&#35745;&#26041;&#27861;&#26159;&#22522;&#20110;&#21442;&#25968;&#21270;&#25110;&#21322;&#21442;&#25968;&#21270;&#27169;&#22411;&#65288;&#20363;&#22914;&#27604;&#20363;&#39118;&#38505;&#27169;&#22411;&#65289;&#65292;&#28982;&#32780;&#65292;&#36825;&#20123;&#26041;&#27861;&#23384;&#22312;&#26174;&#33879;&#30340;&#20559;&#24046;&#38382;&#39064;&#12290;&#26368;&#36817;&#65292;&#38750;&#20542;&#26012;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#22312;&#22823;&#25968;&#25454;&#38598;&#24212;&#29992;&#20013;&#21464;&#24471;&#36234;&#26469;&#36234;&#27969;&#34892;&#12290;&#28982;&#32780;&#65292;&#23613;&#31649;&#36825;&#20123;&#20272;&#35745;&#26041;&#27861;&#20855;&#26377;&#21560;&#24341;&#20154;&#30340;&#29702;&#35770;&#24615;&#36136;&#65292;&#20294;&#23427;&#20204;&#24448;&#24448;&#26159;&#19981;&#31283;&#23450;&#30340;&#65292;&#22240;&#20026;&#38750;&#20542;&#26012;&#21270;&#27493;&#39588;&#28041;&#21450;&#20351;&#29992;&#23567;&#20272;&#35745;&#27010;&#29575;&#30340;&#20498;&#25968;-&#20272;&#35745;&#27010;&#29575;&#30340;&#23567;&#35823;&#24046;&#21487;&#33021;&#23548;&#33268;&#20498;&#25968;&#21644;&#32467;&#26524;&#20272;&#35745;&#37327;&#21457;&#29983;&#24040;&#22823;&#21464;&#21270;&#12290;&#22312;&#29983;&#23384;&#38382;&#39064;&#20013;&#65292;&#36825;&#20010;&#38382;&#39064;&#26356;&#21152;&#31361;&#20986;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the problem of estimating survival causal effects, where the aim is to characterize the impact of an intervention on survival times, i.e., how long it takes for an event to occur. Applications include determining if a drug reduces the time to ICU discharge or if an advertising campaign increases customer dwell time. Historically, the most popular estimates have been based on parametric or semiparametric (e.g. proportional hazards) models; however, these methods suffer from problematic levels of bias. Recently debiased machine learning approaches are becoming increasingly popular, especially in applications to large datasets. However, despite their appealing theoretical properties, these estimators tend to be unstable because the debiasing step involves the use of the inverses of small estimated probabilities -- small errors in the estimated probabilities can result in huge changes in their inverses and therefore the resulting estimator. This problem is exacerbated in survival 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;&#32479;&#19968;&#24754;&#35266;&#39118;&#38505;&#30340;&#32508;&#21512;$\alpha$-&#39118;&#38505;&#29256;&#26412;&#21644;&#22522;&#20110;&#39118;&#38505;&#33719;&#24471;&#26368;&#20248;&#32452;&#21512;&#30340;&#35745;&#31639;&#31639;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#29992;&#20110;&#20272;&#35745;&#38889;&#22269;&#32929;&#31080;&#30340;&#24754;&#35266;&#26368;&#20248;&#32452;&#21512;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2303.07158</link><description>&lt;p&gt;
&#32479;&#19968;&#24754;&#35266;&#39118;&#38505;&#21644;&#26368;&#20248;&#32452;&#21512;
&lt;/p&gt;
&lt;p&gt;
Uniform Pessimistic Risk and Optimal Portfolio. (arXiv:2303.07158v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.07158
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;&#32479;&#19968;&#24754;&#35266;&#39118;&#38505;&#30340;&#32508;&#21512;$\alpha$-&#39118;&#38505;&#29256;&#26412;&#21644;&#22522;&#20110;&#39118;&#38505;&#33719;&#24471;&#26368;&#20248;&#32452;&#21512;&#30340;&#35745;&#31639;&#31639;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#29992;&#20110;&#20272;&#35745;&#38889;&#22269;&#32929;&#31080;&#30340;&#24754;&#35266;&#26368;&#20248;&#32452;&#21512;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a version of integrated $\alpha$-risk called the uniform pessimistic risk and a computational algorithm to obtain an optimal portfolio based on the risk. The proposed method can be used to estimate the pessimistic optimal portfolio models for Korean stocks.
&lt;/p&gt;
&lt;p&gt;
&#36164;&#20135;&#37197;&#32622;&#30340;&#26368;&#20248;&#24615;&#24050;&#32463;&#22312;&#39118;&#38505;&#24230;&#37327;&#30340;&#29702;&#35770;&#20998;&#26512;&#20013;&#24471;&#21040;&#24191;&#27867;&#35752;&#35770;&#12290;&#24754;&#35266;&#20027;&#20041;&#26159;&#19968;&#31181;&#36229;&#36234;&#20256;&#32479;&#26368;&#20248;&#32452;&#21512;&#27169;&#22411;&#30340;&#26368;&#26377;&#21560;&#24341;&#21147;&#30340;&#26041;&#27861;&#20043;&#19968;&#65292;$\alpha$-&#39118;&#38505;&#22312;&#25512;&#23548;&#20986;&#24191;&#27867;&#30340;&#24754;&#35266;&#26368;&#20248;&#32452;&#21512;&#20013;&#36215;&#30528;&#20851;&#38190;&#20316;&#29992;&#12290;&#28982;&#32780;&#65292;&#30001;&#24754;&#35266;&#39118;&#38505;&#35780;&#20272;&#30340;&#26368;&#20248;&#32452;&#21512;&#30340;&#20272;&#35745;&#20173;&#28982;&#20855;&#26377;&#25361;&#25112;&#24615;&#65292;&#22240;&#20026;&#32570;&#20047;&#21487;&#29992;&#30340;&#20272;&#35745;&#27169;&#22411;&#21644;&#35745;&#31639;&#31639;&#27861;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;&#32479;&#19968;&#24754;&#35266;&#39118;&#38505;&#30340;&#32508;&#21512;$\alpha$-&#39118;&#38505;&#29256;&#26412;&#21644;&#22522;&#20110;&#39118;&#38505;&#33719;&#24471;&#26368;&#20248;&#32452;&#21512;&#30340;&#35745;&#31639;&#31639;&#27861;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#20174;&#22810;&#20010;&#20998;&#20301;&#25968;&#22238;&#24402;&#12289;&#36866;&#24403;&#30340;&#35780;&#20998;&#35268;&#21017;&#21644;&#20998;&#24067;&#40065;&#26834;&#20248;&#21270;&#19977;&#20010;&#19981;&#21516;&#30340;&#26041;&#27861;&#26469;&#30740;&#31350;&#25152;&#25552;&#20986;&#30340;&#39118;&#38505;&#30340;&#29702;&#35770;&#24615;&#36136;&#12290;&#21516;&#26102;&#65292;&#32479;&#19968;&#24754;&#35266;&#39118;&#38505;&#34987;&#24212;&#29992;&#20110;&#20272;&#35745;&#38889;&#22269;&#32929;&#31080;&#30340;&#24754;&#35266;&#26368;&#20248;&#32452;&#21512;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
The optimality of allocating assets has been widely discussed with the theoretical analysis of risk measures. Pessimism is one of the most attractive approaches beyond the conventional optimal portfolio model, and the $\alpha$-risk plays a crucial role in deriving a broad class of pessimistic optimal portfolios. However, estimating an optimal portfolio assessed by a pessimistic risk is still challenging due to the absence of an available estimation model and a computational algorithm. In this study, we propose a version of integrated $\alpha$-risk called the uniform pessimistic risk and the computational algorithm to obtain an optimal portfolio based on the risk. Further, we investigate the theoretical properties of the proposed risk in view of three different approaches: multiple quantile regression, the proper scoring rule, and distributionally robust optimization. Also, the uniform pessimistic risk is applied to estimate the pessimistic optimal portfolio models for the Korean stock 
&lt;/p&gt;</description></item></channel></rss>