{
    "title": "Distributed Multivariate Regression Modeling For Selecting Biomarkers Under Data Protection Constraints. (arXiv:1803.00422v3 [stat.ML] UPDATED)",
    "abstract": "The discovery of clinical biomarkers requires large patient cohorts and is aided by a pooled data approach across institutions. In many countries, data protection constraints, especially in the clinical environment, forbid the exchange of individual-level data between different research institutes, impeding the conduct of a joint analyses. To circumvent this problem, only non-disclosive aggregated data is exchanged, which is often done manually and requires explicit permission before transfer, i.e., the number of data calls and the amount of data should be limited. This does not allow for more complex tasks such as variable selection, as only simple aggregated summary statistics are typically transferred. Other methods have been proposed that require more complex aggregated data or use input data perturbation, but these methods can either not deal with a high number of biomarkers or lose information. Here, we propose a multivariable regression approach for identifying biomarkers by aut",
    "link": "http://arxiv.org/abs/1803.00422",
    "context": "Title: Distributed Multivariate Regression Modeling For Selecting Biomarkers Under Data Protection Constraints. (arXiv:1803.00422v3 [stat.ML] UPDATED)\nAbstract: The discovery of clinical biomarkers requires large patient cohorts and is aided by a pooled data approach across institutions. In many countries, data protection constraints, especially in the clinical environment, forbid the exchange of individual-level data between different research institutes, impeding the conduct of a joint analyses. To circumvent this problem, only non-disclosive aggregated data is exchanged, which is often done manually and requires explicit permission before transfer, i.e., the number of data calls and the amount of data should be limited. This does not allow for more complex tasks such as variable selection, as only simple aggregated summary statistics are typically transferred. Other methods have been proposed that require more complex aggregated data or use input data perturbation, but these methods can either not deal with a high number of biomarkers or lose information. Here, we propose a multivariable regression approach for identifying biomarkers by aut",
    "path": "papers/18/03/1803.00422.json",
    "total_tokens": 868,
    "translated_title": "基于分布式多元回归建模的选择受数据保护约束的生物标志物",
    "translated_abstract": "临床生物标志物的发现需要大量的患者队列，并且通过跨机构间的汇总数据方法进行辅助。在许多国家，特别是在临床环境中，数据保护约束禁止不同研究机构之间交换个体级数据，从而阻碍了联合分析的进行。为了规避这个问题，只能交换非披露式的汇总数据，这通常是通过手动进行，并且在转移之前需要明确的许可，也就是数据调用的数量和数据量应该受到限制。这不允许进行更复杂的任务，例如变量选择，因为通常只传输简单的汇总统计数据。其他方法提出了需要更复杂的汇总数据或使用输入数据扰动的方法，但是这些方法要么不能处理大量的生物标志物，要么会丢失信息。在这里，我们提出了一种多变量回归方法来识别生物标志物。",
    "tldr": "该论文提出了一种基于分布式多元回归建模的选择生物标志物的方法，解决了数据保护约束的问题，并克服了传统方法在处理大量生物标志物时丢失信息的局限性。"
}