{
    "title": "Persuasion with Ambiguous Receiver Preferences. (arXiv:2109.11536v5 [econ.TH] UPDATED)",
    "abstract": "I describe a Bayesian persuasion problem where Receiver has a private type representing a cutoff for choosing Sender's preferred action, and Sender has maxmin preferences over all Receiver type distributions with known mean and bounds. This problem can be represented as a zero-sum game where Sender chooses a distribution of posterior mean beliefs that is a mean-preserving contraction of the prior over states, and an adversarial Nature chooses a Receiver type distribution with the known mean; the player with the higher realization from their chosen distribution wins. I formalize the connection between maxmin persuasion and similar games used to model political spending, all-pay auctions, and competitive persuasion. In both a standard binary-state setting and a new continuous-state setting, Sender optimally linearizes the prior distribution over states to create a distribution of posterior means that is uniform on a known interval with an atom at the lower bound of its support.",
    "link": "http://arxiv.org/abs/2109.11536",
    "context": "Title: Persuasion with Ambiguous Receiver Preferences. (arXiv:2109.11536v5 [econ.TH] UPDATED)\nAbstract: I describe a Bayesian persuasion problem where Receiver has a private type representing a cutoff for choosing Sender's preferred action, and Sender has maxmin preferences over all Receiver type distributions with known mean and bounds. This problem can be represented as a zero-sum game where Sender chooses a distribution of posterior mean beliefs that is a mean-preserving contraction of the prior over states, and an adversarial Nature chooses a Receiver type distribution with the known mean; the player with the higher realization from their chosen distribution wins. I formalize the connection between maxmin persuasion and similar games used to model political spending, all-pay auctions, and competitive persuasion. In both a standard binary-state setting and a new continuous-state setting, Sender optimally linearizes the prior distribution over states to create a distribution of posterior means that is uniform on a known interval with an atom at the lower bound of its support.",
    "path": "papers/21/09/2109.11536.json",
    "total_tokens": 838,
    "translated_title": "具有模糊接收者偏好的说服问题",
    "translated_abstract": "本文描述了一个贝叶斯说服问题，其中接收者具有代表选择发送者首选行动的私有类型，而发送者对已知均值和边界的所有接收者类型分布具有最大-最小偏好。这个问题可以表示为一个零和游戏，发送者选择一个后验均值信念的分布，该分布是状态事前分布的保平均收缩，并且一个对手性质选择一个已知均值的接收者类型分布；选择的分布中较高的实现方获胜。本文正式化了最大-最小说服和用于建模政治支出、全员竞价和竞争性说服的类似游戏之间的关系。在标准二进制状态设置和新的连续状态设置中，发送者通过线性化状态先验分布来创建一个均匀分布的后验均值，该分布在已知区间上有一个支持下界的原子。",
    "tldr": "本文描述了一个贝叶斯说服问题，研究了发送者和接收者之间的零和博弈。发送者通过线性化先验分布，创建了一个均匀分布的后验均值，在不同的背景下优化结果。",
    "en_tdlr": "This paper investigates a Bayesian persuasion problem involving a zero-sum game between Sender and Receiver. The Sender optimizes the outcome by linearizing the prior distribution to create a uniform distribution of posterior means in different contexts."
}