{
    "title": "Autonomous Navigation of Underactuated Bipedal Robots in Height-Constrained Environments. (arXiv:2109.05714v4 [cs.RO] UPDATED)",
    "abstract": "Navigating a large-scaled robot in unknown and cluttered height-constrained environments is challenging. Not only is a fast and reliable planning algorithm required to go around obstacles, the robot should also be able to change its intrinsic dimension by crouching in order to travel underneath height-constrained regions. There are few mobile robots that are capable of handling such a challenge, and bipedal robots provide a solution. However, as bipedal robots have nonlinear and hybrid dynamics, trajectory planning while ensuring dynamic feasibility and safety on these robots is challenging. This paper presents an end-to-end autonomous navigation framework which leverages three layers of planners and a variable walking height controller to enable bipedal robots to safely explore height-constrained environments. A vertically-actuated Spring-Loaded Inverted Pendulum (vSLIP) model is introduced to capture the robot's coupled dynamics of planar walking and vertical walking height. This red",
    "link": "http://arxiv.org/abs/2109.05714",
    "context": "Title: Autonomous Navigation of Underactuated Bipedal Robots in Height-Constrained Environments. (arXiv:2109.05714v4 [cs.RO] UPDATED)\nAbstract: Navigating a large-scaled robot in unknown and cluttered height-constrained environments is challenging. Not only is a fast and reliable planning algorithm required to go around obstacles, the robot should also be able to change its intrinsic dimension by crouching in order to travel underneath height-constrained regions. There are few mobile robots that are capable of handling such a challenge, and bipedal robots provide a solution. However, as bipedal robots have nonlinear and hybrid dynamics, trajectory planning while ensuring dynamic feasibility and safety on these robots is challenging. This paper presents an end-to-end autonomous navigation framework which leverages three layers of planners and a variable walking height controller to enable bipedal robots to safely explore height-constrained environments. A vertically-actuated Spring-Loaded Inverted Pendulum (vSLIP) model is introduced to capture the robot's coupled dynamics of planar walking and vertical walking height. This red",
    "path": "papers/21/09/2109.05714.json",
    "total_tokens": 918,
    "translated_title": "在高度受限环境中自主导航欠驱动双足机器人",
    "translated_abstract": "在未知且杂乱的高度受限环境中导航大型机器人具有挑战性。不仅需要快速可靠的规划算法来绕过障碍物，机器人还应能够通过蹲下改变其内禀维度，以便在高度受限区域下行进。目前很少有能够处理此类挑战的移动机器人，而双足机器人提供了一种解决方案。然而，由于双足机器人具有非线性和混合动力学特性，同时确保在这些机器人上进行动态可行性和安全的轨迹规划具有挑战性。本文提出了一个端到端的自主导航框架，利用三层规划器和可变步行高度控制器，使双足机器人能够安全地探索高度受限的环境。引入了一个垂直驱动的弹簧负载倒立摆（vSLIP）模型，用于捕捉机器人平面行走和垂直行走高度的耦合动力学。",
    "tldr": "本文提出了一个端到端的自主导航框架，使用三层规划器和可变步行高度控制器，使双足机器人能够安全地探索高度受限环境。"
}