{
    "title": "Large-scale Autonomous Flight with Real-time Semantic SLAM under Dense Forest Canopy. (arXiv:2109.06479v5 [cs.RO] UPDATED)",
    "abstract": "Semantic maps represent the environment using a set of semantically meaningful objects. This representation is storage-efficient, less ambiguous, and more informative, thus facilitating large-scale autonomy and the acquisition of actionable information in highly unstructured, GPS-denied environments. In this letter, we propose an integrated system that can perform large-scale autonomous flights and real-time semantic mapping in challenging under-canopy environments. We detect and model tree trunks and ground planes from LiDAR data, which are associated across scans and used to constrain robot poses as well as tree trunk models. The autonomous navigation module utilizes a multi-level planning and mapping framework and computes dynamically feasible trajectories that lead the UAV to build a semantic map of the user-defined region of interest in a computationally and storage efficient manner. A drift-compensation mechanism is designed to minimize the odometry drift using semantic SLAM outp",
    "link": "http://arxiv.org/abs/2109.06479",
    "context": "Title: Large-scale Autonomous Flight with Real-time Semantic SLAM under Dense Forest Canopy. (arXiv:2109.06479v5 [cs.RO] UPDATED)\nAbstract: Semantic maps represent the environment using a set of semantically meaningful objects. This representation is storage-efficient, less ambiguous, and more informative, thus facilitating large-scale autonomy and the acquisition of actionable information in highly unstructured, GPS-denied environments. In this letter, we propose an integrated system that can perform large-scale autonomous flights and real-time semantic mapping in challenging under-canopy environments. We detect and model tree trunks and ground planes from LiDAR data, which are associated across scans and used to constrain robot poses as well as tree trunk models. The autonomous navigation module utilizes a multi-level planning and mapping framework and computes dynamically feasible trajectories that lead the UAV to build a semantic map of the user-defined region of interest in a computationally and storage efficient manner. A drift-compensation mechanism is designed to minimize the odometry drift using semantic SLAM outp",
    "path": "papers/21/09/2109.06479.json",
    "total_tokens": 945,
    "translated_title": "密集森林林冠下的大规模自主飞行与实时语义SLAM",
    "translated_abstract": "语义地图使用一组具有语义意义的对象表示环境。这种表示方式在存储效率、歧义性减少和信息丰富度方面更好，为在高度无结构、无GPS的环境中进行大规模自治飞行和获取可操作信息提供方便。在本文中，我们提出了一个集成系统，能够在具有挑战性的林冠下环境中进行大规模自主飞行和实时语义地图构建。我们使用LiDAR数据检测和建模树干和地面平面，这些信息与扫描数据相关联，并用于约束机器人姿态和树干模型。自主导航模块利用多级规划和地图构建框架，以计算动态可行的轨迹，使无人机以计算和存储有效的方式构建用户定义感兴趣区域的语义地图。设计了漂移补偿机制，通过语义SLAM来最小化里程计漂移。",
    "tldr": "本文提出了一个集成系统，可以在密集森林林冠下进行大规模自主飞行和实时语义地图构建。系统使用LiDAR数据检测和建模树干和地面平面，并利用多级规划和地图构建框架计算动态可行的轨迹，以构建用户定义感兴趣区域的语义地图，并通过语义SLAM来最小化里程计漂移。",
    "en_tdlr": "This paper proposes an integrated system for large-scale autonomous flight and real-time semantic mapping under dense forest canopy. The system detects and models tree trunks and ground planes from LiDAR data, computes dynamically feasible trajectories using a multi-level planning and mapping framework, and minimizes odometry drift using semantic SLAM."
}