{
    "title": "Label-Assemble: Leveraging Multiple Datasets with Partial Labels. (arXiv:2109.12265v4 [cs.CV] UPDATED)",
    "abstract": "The success of deep learning relies heavily on large labeled datasets, but we often only have access to several small datasets associated with partial labels. To address this problem, we propose a new initiative, \"Label-Assemble\", that aims to unleash the full potential of partial labels from an assembly of public datasets. We discovered that learning from negative examples facilitates both computer-aided disease diagnosis and detection. This discovery will be particularly crucial in novel disease diagnosis, where positive examples are hard to collect, yet negative examples are relatively easier to assemble. For example, assembling existing labels from NIH ChestX-ray14 (available since 2017) significantly improves the accuracy of COVID-19 diagnosis from 96.3% to 99.3%. In addition to diagnosis, assembling labels can also improve disease detection, e.g., the detection of pancreatic ductal adenocarcinoma (PDAC) can greatly benefit from leveraging the labels of Cysts and PanNets (two othe",
    "link": "http://arxiv.org/abs/2109.12265",
    "context": "Title: Label-Assemble: Leveraging Multiple Datasets with Partial Labels. (arXiv:2109.12265v4 [cs.CV] UPDATED)\nAbstract: The success of deep learning relies heavily on large labeled datasets, but we often only have access to several small datasets associated with partial labels. To address this problem, we propose a new initiative, \"Label-Assemble\", that aims to unleash the full potential of partial labels from an assembly of public datasets. We discovered that learning from negative examples facilitates both computer-aided disease diagnosis and detection. This discovery will be particularly crucial in novel disease diagnosis, where positive examples are hard to collect, yet negative examples are relatively easier to assemble. For example, assembling existing labels from NIH ChestX-ray14 (available since 2017) significantly improves the accuracy of COVID-19 diagnosis from 96.3% to 99.3%. In addition to diagnosis, assembling labels can also improve disease detection, e.g., the detection of pancreatic ductal adenocarcinoma (PDAC) can greatly benefit from leveraging the labels of Cysts and PanNets (two othe",
    "path": "papers/21/09/2109.12265.json",
    "total_tokens": 1082,
    "translated_title": "多组有Partial Labels的数据集整合的Label-Assemble方法",
    "translated_abstract": "深度学习的成功往往依赖于大规模的标注数据集，但我们通常只能访问几个带有Partial Labels的小型数据集。为了解决这个问题，我们提出了一种新的倡议，即“Label-Assemble”，旨在从公共数据集的组合中释放Partial Labels的全部潜力。我们发现从负样本中学习有助于计算机辅助疾病诊断和检测，这个发现在新型疾病诊断中尤为重要，因为正样本往往难以收集，而负样本相对容易获得。例如，从NIH ChestX-ray14 （自2017年以来可用）中组装现有标签可将 COVID-19 的诊断准确率从96.3％提高到99.3％。除了诊断外，组装标签还可以改善疾病的检测，例如胰腺导管腺癌 (PDAC) 的检测可以从利用囊肿和胰腺内分泌肿瘤 (两种相关疾病) 的标签中获益，因为它们共享相同的成像特征。",
    "tldr": "\"Label-Assemble\"是一种整合带有Partial Labels的公共数据集来释放其全部潜力的方法。在新型疾病诊断中，从负样本中学习对计算机辅助诊断和检测都非常有帮助。具体而言，将NIH ChestX-ray14中的现有标签组装起来，可以将COVID-19的准确诊断率从96.3％提高到99.3％。此外，整合标签还可以提高疾病的检测能力。",
    "en_tdlr": "\"Label-Assemble\" is a method that leverages the partial labels of public datasets to unleash their full potential. Learning from negative examples is particularly helpful in computer-aided diagnosis and detection of novel diseases. Assembling existing labels from NIH ChestX-ray14 significantly improves the accuracy of COVID-19 diagnosis from 96.3% to 99.3%. Moreover, assembling labels can also improve disease detection."
}