{
    "title": "An efficient plasma-surface interaction surrogate model for sputtering processes based on autoencoder neural networks. (arXiv:2109.01406v2 [physics.comp-ph] CROSS LISTED)",
    "abstract": "Simulations of thin film sputter deposition require the separation of the plasma and material transport in the gas-phase from the growth/sputtering processes at the bounding surfaces. Interface models based on analytic expressions or look-up tables inherently restrict this complex interaction to a bare minimum. A machine learning model has recently been shown to overcome this remedy for Ar ions bombarding a Ti-Al composite target. However, the chosen network structure (i.e., a multilayer perceptron) provides approximately 4 million degrees of freedom, which bears the risk of overfitting the relevant dynamics and complicating the model to an unreliable extend. This work proposes a conceptually more sophisticated but parameterwise simplified regression artificial neural network for an extended scenario, considering a variable instead of a single fixed Ti-Al stoichiometry. A convolutional $\\beta$-variational autoencoder is trained to reduce the high-dimensional energy-angular distribution",
    "link": "http://arxiv.org/abs/2109.01406",
    "context": "Title: An efficient plasma-surface interaction surrogate model for sputtering processes based on autoencoder neural networks. (arXiv:2109.01406v2 [physics.comp-ph] CROSS LISTED)\nAbstract: Simulations of thin film sputter deposition require the separation of the plasma and material transport in the gas-phase from the growth/sputtering processes at the bounding surfaces. Interface models based on analytic expressions or look-up tables inherently restrict this complex interaction to a bare minimum. A machine learning model has recently been shown to overcome this remedy for Ar ions bombarding a Ti-Al composite target. However, the chosen network structure (i.e., a multilayer perceptron) provides approximately 4 million degrees of freedom, which bears the risk of overfitting the relevant dynamics and complicating the model to an unreliable extend. This work proposes a conceptually more sophisticated but parameterwise simplified regression artificial neural network for an extended scenario, considering a variable instead of a single fixed Ti-Al stoichiometry. A convolutional $\\beta$-variational autoencoder is trained to reduce the high-dimensional energy-angular distribution",
    "path": "papers/21/09/2109.01406.json",
    "total_tokens": 966,
    "translated_title": "一种基于自编码神经网络的高效等离子体表面相互作用代理模型用于溅射过程",
    "translated_abstract": "薄膜溅射沉积的模拟需要将气相中的等离子体和物质输运与边界表面的生长/溅射过程分离。基于解析表达式或查找表的界面模型在本质上将这种复杂交互作用限制为最少量。最近已经展示了基于机器学习的模型可以克服这一点，用于Ar离子轰击Ti-Al复合靶材。然而，所选的网络结构（即多层感知器）提供了约400万自由度，这存在过度拟合相关动态并将模型复杂化至不可靠的风险。本文提出了一个概念上更为复杂但参数方面简化的回归人工神经网络，针对一个扩展方案考虑变量而不是单个固定的Ti-Al化学计量。训练了一个卷积$\\beta$变分自编码器来减少高维能量角分布",
    "tldr": "本研究提出了一种基于自编码神经网络的高效等离子体表面相互作用代理模型，用于薄膜溅射沉积模拟。通过训练卷积$\\beta$变分自编码器，可以减少高维能量角分布，从而更好地考虑变量而不是单个固定的Ti-Al化学计量。",
    "en_tdlr": "This paper proposes an efficient plasma-surface interaction surrogate model based on autoencoder neural networks for thin film sputter deposition simulation. By training a convolutional $\\beta$-variational autoencoder, high-dimensional energy-angular distribution can be reduced to better consider variables instead of a single fixed Ti-Al stoichiometry."
}