{
    "title": "rSVDdpd: A Robust Scalable Video Surveillance Background Modelling Algorithm. (arXiv:2109.10680v2 [stat.AP] UPDATED)",
    "abstract": "A basic algorithmic task in automated video surveillance is to separate background and foreground objects. Camera tampering, noisy videos, low frame rate, etc., pose difficulties in solving the problem. A general approach that classifies the tampered frames, and performs subsequent analysis on the remaining frames after discarding the tampered ones, results in loss of information. Several robust methods based on robust principal component analysis (PCA) have been introduced to solve this problem. To date, considerable effort has been expended to develop robust PCA via Principal Component Pursuit (PCP) methods with reduced computational cost and visually appealing foreground detection. However, the convex optimizations used in these algorithms do not scale well to real-world large datasets due to large matrix inversion steps. Also, an integral component of these foreground detection algorithms is singular value decomposition which is nonrobust. In this paper, we present a new video surv",
    "link": "http://arxiv.org/abs/2109.10680",
    "context": "Title: rSVDdpd: A Robust Scalable Video Surveillance Background Modelling Algorithm. (arXiv:2109.10680v2 [stat.AP] UPDATED)\nAbstract: A basic algorithmic task in automated video surveillance is to separate background and foreground objects. Camera tampering, noisy videos, low frame rate, etc., pose difficulties in solving the problem. A general approach that classifies the tampered frames, and performs subsequent analysis on the remaining frames after discarding the tampered ones, results in loss of information. Several robust methods based on robust principal component analysis (PCA) have been introduced to solve this problem. To date, considerable effort has been expended to develop robust PCA via Principal Component Pursuit (PCP) methods with reduced computational cost and visually appealing foreground detection. However, the convex optimizations used in these algorithms do not scale well to real-world large datasets due to large matrix inversion steps. Also, an integral component of these foreground detection algorithms is singular value decomposition which is nonrobust. In this paper, we present a new video surv",
    "path": "papers/21/09/2109.10680.json",
    "total_tokens": 936,
    "tldr": "本文提出了一种新的视频监控背景建模算法，通过引入鲁棒主成分分析（PCA）和降低计算成本的方法，解决了相机篡改、嘈杂视频和大型数据集的困难，同时实现了可视化的前景检测。"
}