{
    "title": "WEDGE: Web-Image Assisted Domain Generalization for Semantic Segmentation. (arXiv:2109.14196v3 [cs.CV] UPDATED)",
    "abstract": "Domain generalization for semantic segmentation is highly demanded in real applications, where a trained model is expected to work well in previously unseen domains. One challenge lies in the lack of data which could cover the diverse distributions of the possible unseen domains for training. In this paper, we propose a WEb-image assisted Domain GEneralization (WEDGE) scheme, which is the first to exploit the diversity of web-crawled images for generalizable semantic segmentation. To explore and exploit the real-world data distributions, we collect a web-crawled dataset which presents large diversity in terms of weather conditions, sites, lighting, camera styles, etc. We also present a method which injects the style representation of the web-crawled data into the source domain on-the-fly during training, which enables the network to experience images of diverse styles with reliable labels for effective training. Moreover, we use the web-crawled dataset with predicted pseudo labels for ",
    "link": "http://arxiv.org/abs/2109.14196",
    "context": "Title: WEDGE: Web-Image Assisted Domain Generalization for Semantic Segmentation. (arXiv:2109.14196v3 [cs.CV] UPDATED)\nAbstract: Domain generalization for semantic segmentation is highly demanded in real applications, where a trained model is expected to work well in previously unseen domains. One challenge lies in the lack of data which could cover the diverse distributions of the possible unseen domains for training. In this paper, we propose a WEb-image assisted Domain GEneralization (WEDGE) scheme, which is the first to exploit the diversity of web-crawled images for generalizable semantic segmentation. To explore and exploit the real-world data distributions, we collect a web-crawled dataset which presents large diversity in terms of weather conditions, sites, lighting, camera styles, etc. We also present a method which injects the style representation of the web-crawled data into the source domain on-the-fly during training, which enables the network to experience images of diverse styles with reliable labels for effective training. Moreover, we use the web-crawled dataset with predicted pseudo labels for ",
    "path": "papers/21/09/2109.14196.json",
    "total_tokens": 981,
    "translated_title": "WEDGE：基于网络图像辅助的语义分割领域泛化",
    "translated_abstract": "针对语义分割的领域泛化问题，在现实应用场景中，训练好的模型需要在之前未见过的领域表现出良好的效果，但面临着训练数据无法覆盖各种可能看不见的领域分布的挑战。本文提出了WEb-image辅助的Domain GEneralization（WEDGE）方案，这是首个利用网络抓取图像的多样性来进行普适语义分割的方法。为了探索和利用现实中的数据分布，我们收集了一个网络抓取的数据集，其中包括了不同的天气条件、网站、光照、相机风格等各种多样性。同时，我们提出了一种方法，可以在训练过程中实时地将网络抓取数据的风格表示注入源领域，从而使网络经历具有可靠标签的不同风格的图像以进行有效的训练。此外，我们使用网络抓取数据集和预测伪标签来增强泛化能力，使模型在以前未见过的领域中表现出良好的效果。",
    "tldr": "本研究提出了一种基于网络图像辅助的领域泛化方法，利用网络抓取的大量现实图像数据集来增加数据的多样性，提高模型泛化能力，在未见过的领域中表现良好。",
    "en_tdlr": "This study proposes a web-image assisted domain generalization method for semantic segmentation, which utilizes a diverse dataset of web-crawled images to improve the model's generalization ability and achieve good performance in previously unseen domains. The method injects style representation of the web-crawled data into the source domain during training and uses a web-crawled dataset with predicted pseudo labels to enhance the generalization capability."
}