{
    "title": "Robust Equilibria in General Competing Mechanism Games. (arXiv:2109.13177v3 [econ.TH] UPDATED)",
    "abstract": "This paper proposes the notion of robust PBE in a general competing mechanism game of incomplete information where a mechanism allows its designer to send a message to himself at the same time agents send messages. It identifies the utility environments where the notion of robust PBE coincides with that of strongly robust PBE (Epstein and Peters (1999), Han (2007)) and with that of robust PBE respectively. If each agent's utility function is additively separable with respect to principals' actions, it is possible to provide the full characterization of equilibrium allocations under the notion of robust PBE and its variations, in terms of Bayesian incentive compatible (BIC) direct mechanisms, without reference to the set of arbitrary general mechanisms allowed in the game. However, in the standard competing mechanism agme, the adoption of robust PBE as the solution concept does not lead to the full characterization of equilibrium allocations in terms of BIC direct mechanisms even with a",
    "link": "http://arxiv.org/abs/2109.13177",
    "context": "Title: Robust Equilibria in General Competing Mechanism Games. (arXiv:2109.13177v3 [econ.TH] UPDATED)\nAbstract: This paper proposes the notion of robust PBE in a general competing mechanism game of incomplete information where a mechanism allows its designer to send a message to himself at the same time agents send messages. It identifies the utility environments where the notion of robust PBE coincides with that of strongly robust PBE (Epstein and Peters (1999), Han (2007)) and with that of robust PBE respectively. If each agent's utility function is additively separable with respect to principals' actions, it is possible to provide the full characterization of equilibrium allocations under the notion of robust PBE and its variations, in terms of Bayesian incentive compatible (BIC) direct mechanisms, without reference to the set of arbitrary general mechanisms allowed in the game. However, in the standard competing mechanism agme, the adoption of robust PBE as the solution concept does not lead to the full characterization of equilibrium allocations in terms of BIC direct mechanisms even with a",
    "path": "papers/21/09/2109.13177.json",
    "total_tokens": 1000,
    "translated_title": "一般竞争机制博弈中的稳健均衡",
    "translated_abstract": "本文提出了在不完全信息的一般竞争机制博弈中的稳健纯效益均衡（robust PBE）的概念，其中机制允许设计者在代理发送消息的同时给自己发送消息。该文确定了在效用环境中，稳健纯效益均衡与强稳健纯效益均衡（Epstein and Peters (1999), Han (2007)）以及稳健纯效益均衡概念相一致的情况。如果每个代理的效用函数与负责人的行动是可加可分的，则可以在稳健纯效益均衡及其变种的概念下，通过贝叶斯激励兼容（BIC）直接机制对均衡分配进行全面刻画，而无需引用博弈中允许的任意一般机制集合。然而，在标准竞争机制博弈中，采用稳健纯效益均衡作为解的概念，并不能通过BIC直接机制对均衡分配进行全面刻画，即使使用了限制性的机制集合。",
    "tldr": "本文提出了在一般竞争机制博弈中的稳健纯效益均衡概念，并确定了其与其他稳健概念的一致性。如果代理的效用函数可加可分，则可以通过贝叶斯激励兼容直接机制对稳健纯效益均衡的均衡分配进行全面刻画。",
    "en_tdlr": "This paper proposes the concept of robust PBE in general competing mechanism games and identifies its consistency with other robust concepts. If the utility functions of agents are additively separable, equilibrium allocations under the robust PBE can be fully characterized through Bayesian incentive compatible direct mechanisms."
}