{
    "title": "Optimising Rolling Stock Planning including Maintenance with Constraint Programming and Quantum Annealing. (arXiv:2109.07212v2 [cs.AI] UPDATED)",
    "abstract": "We propose and compare Constraint Programming (CP) and Quantum Annealing (QA) approaches for rolling stock assignment optimisation considering necessary maintenance tasks. In the CP approach, we model the problem with an Alldifferent constraint, extensions of the Element constraint, and logical implications, among others. For the QA approach, we develop a quadratic unconstrained binary optimisation (QUBO) model. For evaluation, we use data sets based on real data from Deutsche Bahn and run the QA approach on real quantum computers from D-Wave. Classical computers are used to evaluate the CP approach as well as tabu search for the QUBO model. At the current development stage of the physical quantum annealers, we find that both approaches tend to produce comparable results.",
    "link": "http://arxiv.org/abs/2109.07212",
    "context": "Title: Optimising Rolling Stock Planning including Maintenance with Constraint Programming and Quantum Annealing. (arXiv:2109.07212v2 [cs.AI] UPDATED)\nAbstract: We propose and compare Constraint Programming (CP) and Quantum Annealing (QA) approaches for rolling stock assignment optimisation considering necessary maintenance tasks. In the CP approach, we model the problem with an Alldifferent constraint, extensions of the Element constraint, and logical implications, among others. For the QA approach, we develop a quadratic unconstrained binary optimisation (QUBO) model. For evaluation, we use data sets based on real data from Deutsche Bahn and run the QA approach on real quantum computers from D-Wave. Classical computers are used to evaluate the CP approach as well as tabu search for the QUBO model. At the current development stage of the physical quantum annealers, we find that both approaches tend to produce comparable results.",
    "path": "papers/21/09/2109.07212.json",
    "total_tokens": 759,
    "translated_title": "优化包括维护在内的机车编组计划的约束编程与量子退火方法",
    "translated_abstract": "我们提出并比较了使用约束编程(CP)和量子退火(QA)方法来优化考虑必要维护任务的机车编组分配。在CP方法中，我们使用AllDifferent约束、Element约束的扩展以及逻辑蕴含等来建模问题。对于QA方法，我们开发了一个二次无约束二进制优化(QUBO)模型。为了评估，我们使用基于德国铁路真实数据的数据集，并在D-Wave的真实量子计算机上运行QA方法。经典计算机用于评估CP方法以及QUBO模型中的禁忌搜索。在当前物理量子退火机器的开发阶段，我们发现两种方法往往产生相当的结果。",
    "tldr": "本文比较了约束编程和量子退火方法在优化机车编组分配与维护任务中的应用，并发现两种方法在当前发展阶段的量子退火机器上产生相当的结果。",
    "en_tdlr": "This paper compares the application of Constraint Programming and Quantum Annealing in optimizing rolling stock assignment with maintenance tasks and concludes that both methods yield comparable results on current-generation quantum annealers."
}