{
    "title": "Willingness to Pay to Prevent Water and Sanitation-Related Diseases Suffered by Slum Dwellers and Beneficiary Households: Evidence from Chittagong, Bangladesh. (arXiv:2109.05421v3 [econ.GN] UPDATED)",
    "abstract": "A significant proportion of slum residents offer vital services that are relied upon by wealthier urban residents. However, the lack of access to clean drinking water and adequate sanitation facilities causes considerable health risks for slum residents, leading to interruption in services and potential transmission of diseases to the beneficiaries. This study explores the willingness of the households benefitting from these services to contribute financially towards the measures that can mitigate the negative externalities of the diseases resulting from poor water and sanitation in slums. This study adopts the Contingent Valuation Method using face-to-face interviews with 260 service-receiving households in Chittagong City Corporation of Bangladesh. Estimating the logistic regression model, the findings indicate that 74 percent of respondents express their willingness to contribute financially towards an improvement of water and sanitation facilities in the slums. Within this group, 1",
    "link": "http://arxiv.org/abs/2109.05421",
    "context": "Title: Willingness to Pay to Prevent Water and Sanitation-Related Diseases Suffered by Slum Dwellers and Beneficiary Households: Evidence from Chittagong, Bangladesh. (arXiv:2109.05421v3 [econ.GN] UPDATED)\nAbstract: A significant proportion of slum residents offer vital services that are relied upon by wealthier urban residents. However, the lack of access to clean drinking water and adequate sanitation facilities causes considerable health risks for slum residents, leading to interruption in services and potential transmission of diseases to the beneficiaries. This study explores the willingness of the households benefitting from these services to contribute financially towards the measures that can mitigate the negative externalities of the diseases resulting from poor water and sanitation in slums. This study adopts the Contingent Valuation Method using face-to-face interviews with 260 service-receiving households in Chittagong City Corporation of Bangladesh. Estimating the logistic regression model, the findings indicate that 74 percent of respondents express their willingness to contribute financially towards an improvement of water and sanitation facilities in the slums. Within this group, 1",
    "path": "papers/21/09/2109.05421.json",
    "total_tokens": 941,
    "translated_title": "慈善贡献中穷人的愿意支付对垃圾住所居民和受益家庭所遭受的水和卫生相关疾病的抗疫费用：孟加拉乍得岗的证据",
    "translated_abstract": "许多贫民窟居民提供着富裕城市居民所依赖的重要服务。然而，缺乏干净饮用水和足够卫生设施，给贫民窟居民带来了巨大的健康风险，导致服务中断，并潜在地将疾病传播给受益人。本研究探讨了从这些服务中受益的家庭在减轻贫民窟水和卫生带来的负外部性疾病方面是否愿意经济上做出贡献。本研究采用了面对面访谈的问卷调查方法，对孟加拉国乍得岗市的260个受服务家庭进行了调查。通过估计回归模型，研究发现有74%的受访者表示愿意经济上为贫民窟水和卫生设施的改善做出贡献。在这一群体中，...",
    "tldr": "孟加拉乍得岗市的研究发现，74%的受访者愿意经济上为贫民窟水和卫生设施的改善做出贡献。",
    "en_tdlr": "The study in Chittagong, Bangladesh found that 74% of respondents were willing to contribute financially towards the improvement of water and sanitation facilities in slums."
}