{
    "title": "bqror: An R package for Bayesian Quantile Regression in Ordinal Models. (arXiv:2109.13606v3 [econ.EM] UPDATED)",
    "abstract": "This article describes an R package bqror that estimates Bayesian quantile regression for ordinal models introduced in Rahman (2016). The paper classifies ordinal models into two types and offers computationally efficient, yet simple, Markov chain Monte Carlo (MCMC) algorithms for estimating ordinal quantile regression. The generic ordinal model with 3 or more outcomes (labeled ORI model) is estimated by a combination of Gibbs sampling and Metropolis-Hastings algorithm. Whereas an ordinal model with exactly 3 outcomes (labeled ORII model) is estimated using Gibbs sampling only. In line with the Bayesian literature, we suggest using marginal likelihood for comparing alternative quantile regression models and explain how to compute the same. The models and their estimation procedures are illustrated via multiple simulation studies and implemented in two applications. The article also describes several other functions contained within the bqror package, which are necessary for estimation,",
    "link": "http://arxiv.org/abs/2109.13606",
    "context": "Title: bqror: An R package for Bayesian Quantile Regression in Ordinal Models. (arXiv:2109.13606v3 [econ.EM] UPDATED)\nAbstract: This article describes an R package bqror that estimates Bayesian quantile regression for ordinal models introduced in Rahman (2016). The paper classifies ordinal models into two types and offers computationally efficient, yet simple, Markov chain Monte Carlo (MCMC) algorithms for estimating ordinal quantile regression. The generic ordinal model with 3 or more outcomes (labeled ORI model) is estimated by a combination of Gibbs sampling and Metropolis-Hastings algorithm. Whereas an ordinal model with exactly 3 outcomes (labeled ORII model) is estimated using Gibbs sampling only. In line with the Bayesian literature, we suggest using marginal likelihood for comparing alternative quantile regression models and explain how to compute the same. The models and their estimation procedures are illustrated via multiple simulation studies and implemented in two applications. The article also describes several other functions contained within the bqror package, which are necessary for estimation,",
    "path": "papers/21/09/2109.13606.json",
    "total_tokens": 1047,
    "translated_title": "bqror: 一种用于序列模型中贝叶斯分位数回归的 R 包",
    "translated_abstract": "本文介绍了一个名为 bqror 的 R 包，用于在 Rahman（2016）中引入的序列模型中估算贝叶斯分位数回归。本文将序列模型分为两类，并提供了计算效率高、但简单的马尔可夫链蒙特卡罗（MCMC）算法来估算序列分位数回归。对于具有 3 个或更多结果的通用序列模型（标记为 ORI 模型），使用 Gibbs 抽样和 Metropolis-Hastings 算法的组合来估算。而对于恰好具有 3 个结果的序列模型（标记为 ORII 模型），则仅使用 Gibbs 抽样进行估算。根据贝叶斯文献，我们建议使用边缘似然来比较不同的分位数回归模型，并解释如何计算边缘似然。模型及其估算过程通过多次模拟研究进行了说明，并在两个应用中实施。本文还介绍了 bqror 包中包含的其他几个函数，这些函数对估算是必要的。",
    "tldr": "bqror是一个R包，用于在序列模型中估算贝叶斯分位数回归。它提供了高效的MCMC算法，可以对具有3个或以上结果的通用序列模型进行估算，对于恰好具有3个结果的序列模型，则只使用Gibbs抽样。与贝叶斯文献一致，使用边缘似然进行模型比较，该文还介绍了一些其他包含在bqror软件包中的函数，这些函数在估算过程中是必要的。"
}