{
    "title": "RIFLE: Imputation and Robust Inference from Low Order Marginals. (arXiv:2109.00644v3 [cs.LG] UPDATED)",
    "abstract": "The ubiquity of missing values in real-world datasets poses a challenge for statistical inference and can prevent similar datasets from being analyzed in the same study, precluding many existing datasets from being used for new analyses. While an extensive collection of packages and algorithms have been developed for data imputation, the overwhelming majority perform poorly if there are many missing values and low sample sizes, which are unfortunately common characteristics in empirical data. Such low-accuracy estimations adversely affect the performance of downstream statistical models. We develop a statistical inference framework for regression and classification in the presence of missing data without imputation. Our framework, RIFLE (Robust InFerence via Low-order moment Estimations), estimates low-order moments of the underlying data distribution with corresponding confidence intervals to learn a distributionally robust model. We specialize our framework to linear regression and n",
    "link": "http://arxiv.org/abs/2109.00644",
    "context": "Title: RIFLE: Imputation and Robust Inference from Low Order Marginals. (arXiv:2109.00644v3 [cs.LG] UPDATED)\nAbstract: The ubiquity of missing values in real-world datasets poses a challenge for statistical inference and can prevent similar datasets from being analyzed in the same study, precluding many existing datasets from being used for new analyses. While an extensive collection of packages and algorithms have been developed for data imputation, the overwhelming majority perform poorly if there are many missing values and low sample sizes, which are unfortunately common characteristics in empirical data. Such low-accuracy estimations adversely affect the performance of downstream statistical models. We develop a statistical inference framework for regression and classification in the presence of missing data without imputation. Our framework, RIFLE (Robust InFerence via Low-order moment Estimations), estimates low-order moments of the underlying data distribution with corresponding confidence intervals to learn a distributionally robust model. We specialize our framework to linear regression and n",
    "path": "papers/21/09/2109.00644.json",
    "total_tokens": 901,
    "translated_title": "RIFLE: 从低阶边缘估计中补全缺失值和稳健推断",
    "translated_abstract": "实际数据集中缺失值的普遍存在给统计推断带来了挑战，并且可能阻止相似数据集进行相同的研究分析，使得许多现有的数据集不能用于新的分析。目前已经开发了大量的数据补全包和算法，但绝大多数在存在大量缺失值和样本量较小的情况下表现不佳，而这在实证数据中是常见的特征。这种低准确度的估计会对下游的统计模型性能产生不利影响。我们开发了一个统计推断框架，用于在缺失数据的情况下进行回归和分类。我们的框架RIFLE（通过低阶矩估计进行稳健推断）通过估计底层数据分布的低阶矩和相应的置信区间来学习一个分布鲁棒的模型，而无需进行数据补全。我们将我们的框架专门应用于线性回归和...",
    "tldr": "RIFLE是一个统计推断框架，可以在缺失数据的情况下进行回归和分类。它通过估计底层数据分布的低阶矩和置信区间来学习一个分布鲁棒的模型，而无需进行数据补全。",
    "en_tdlr": "RIFLE is a statistical inference framework that enables regression and classification in the presence of missing data. It learns a distributionally robust model by estimating low-order moments of the underlying data distribution with confidence intervals, without the need for data imputation."
}