{
    "title": "Training Spiking Neural Networks Using Lessons From Deep Learning. (arXiv:2109.12894v5 [cs.NE] UPDATED)",
    "abstract": "The brain is the perfect place to look for inspiration to develop more efficient neural networks. The inner workings of our synapses and neurons provide a glimpse at what the future of deep learning might look like. This paper serves as a tutorial and perspective showing how to apply the lessons learnt from several decades of research in deep learning, gradient descent, backpropagation and neuroscience to biologically plausible spiking neural neural networks.  We also explore the delicate interplay between encoding data as spikes and the learning process; the challenges and solutions of applying gradient-based learning to spiking neural networks (SNNs); the subtle link between temporal backpropagation and spike timing dependent plasticity, and how deep learning might move towards biologically plausible online learning. Some ideas are well accepted and commonly used amongst the neuromorphic engineering community, while others are presented or justified for the first time here.  The fiel",
    "link": "http://arxiv.org/abs/2109.12894",
    "context": "Title: Training Spiking Neural Networks Using Lessons From Deep Learning. (arXiv:2109.12894v5 [cs.NE] UPDATED)\nAbstract: The brain is the perfect place to look for inspiration to develop more efficient neural networks. The inner workings of our synapses and neurons provide a glimpse at what the future of deep learning might look like. This paper serves as a tutorial and perspective showing how to apply the lessons learnt from several decades of research in deep learning, gradient descent, backpropagation and neuroscience to biologically plausible spiking neural neural networks.  We also explore the delicate interplay between encoding data as spikes and the learning process; the challenges and solutions of applying gradient-based learning to spiking neural networks (SNNs); the subtle link between temporal backpropagation and spike timing dependent plasticity, and how deep learning might move towards biologically plausible online learning. Some ideas are well accepted and commonly used amongst the neuromorphic engineering community, while others are presented or justified for the first time here.  The fiel",
    "path": "papers/21/09/2109.12894.json",
    "total_tokens": 1104,
    "translated_title": "从深度学习中汲取经验教训，训练脉冲神经网络",
    "translated_abstract": "大脑是寻找灵感以开发更有效的神经网络的完美之地。我们的突触和神经元的内部运作提供了对未来深度学习可能呈现的样子的一瞥。本文旨在介绍如何将几十年的深度学习、梯度下降、反向传播和神经科学研究的经验教训应用于生物可行的脉冲神经网络。我们还探讨了将数据编码为脉冲和学习过程之间微妙的相互作用；将基于梯度的学习应用到脉冲神经网络 (SNNs) 的挑战和解决方案；时间反向传播和脉冲时序依赖性可塑性之间微妙的联系以及深度学习如何向着生物可行的在线学习发展。一些想法在神经形态工程界得到了广泛的认可和使用，而其他一些在本文中首次呈现或得到了证明。SNN领域仍处于开发初期，需要解决许多挑战和限制。尽管如此，我们认为脉冲神经网络是理解大脑和开发更有效和智能的人工智能系统的有前途的途径。",
    "tldr": "本论文介绍如何将几十年的深度学习、梯度下降、反向传播和神经科学研究的经验教训应用于生物可行的脉冲神经网络，并探索了将数据编码为脉冲和学习过程之间的微妙相互作用以及生物可行的在线学习的发展方向。",
    "en_tdlr": "This paper introduces how to apply lessons from decades of research in deep learning, gradient descent, backpropagation and neuroscience to biologically plausible spiking neural networks, explores the delicate interplay between encoding data as spikes and the learning process, and the development direction towards biologically plausible online learning."
}