{
    "title": "DemiNet: Dependency-Aware Multi-Interest Network with Self-Supervised Graph Learning for Click-Through Rate Prediction",
    "abstract": "arXiv:2109.12512v2 Announce Type: replace  Abstract: In this paper, we propose a novel model named DemiNet (short for DEpendency-Aware Multi-Interest Network) to address the above two issues. To be specific, we first consider various dependency types between item nodes and perform dependency-aware heterogeneous attention for denoising and obtaining accurate sequence item representations. Secondly, for multiple interests extraction, multi-head attention is conducted on top of the graph embedding. To filter out noisy inter-item correlations and enhance the robustness of extracted interests, self-supervised interest learning is introduced to the above two steps. Thirdly, to aggregate the multiple interests, interest experts corresponding to different interest routes give rating scores respectively, while a specialized network assigns the confidence of each score. Experimental results on three real-world datasets demonstrate that the proposed DemiNet significantly improves the overall reco",
    "link": "https://arxiv.org/abs/2109.12512",
    "context": "Title: DemiNet: Dependency-Aware Multi-Interest Network with Self-Supervised Graph Learning for Click-Through Rate Prediction\nAbstract: arXiv:2109.12512v2 Announce Type: replace  Abstract: In this paper, we propose a novel model named DemiNet (short for DEpendency-Aware Multi-Interest Network) to address the above two issues. To be specific, we first consider various dependency types between item nodes and perform dependency-aware heterogeneous attention for denoising and obtaining accurate sequence item representations. Secondly, for multiple interests extraction, multi-head attention is conducted on top of the graph embedding. To filter out noisy inter-item correlations and enhance the robustness of extracted interests, self-supervised interest learning is introduced to the above two steps. Thirdly, to aggregate the multiple interests, interest experts corresponding to different interest routes give rating scores respectively, while a specialized network assigns the confidence of each score. Experimental results on three real-world datasets demonstrate that the proposed DemiNet significantly improves the overall reco",
    "path": "papers/21/09/2109.12512.json",
    "total_tokens": 850,
    "translated_title": "DemiNet: 基于自监督图学习的依赖感知多兴趣网络用于点击率预测",
    "translated_abstract": "在本文中，我们提出了一个名为DemiNet（DEpendency-Aware Multi-Interest Network的缩写）的新型模型，用于解决上述两个问题。具体而言，我们首先考虑物品节点之间的各种依赖类型，并为去噪和获取准确的序列物品表示进行依赖感知异构注意力。其次，为了提取多个兴趣，我们在图嵌入之上进行多头注意力操作。为了滤除嘈杂的物品间相关性并增强提取兴趣的鲁棒性，我们将自监督兴趣学习引入到上述两个步骤中。第三，为了聚合多个兴趣，对应不同兴趣路线的兴趣专家分别给出评分，而专门的网络分配每个分数的置信度。在三个真实世界数据集上的实验结果表明，所提出的DemiNet显著提高了整体的推荐效果。",
    "tldr": "提出了DemiNet模型，通过依赖感知异构注意力、自监督兴趣学习和兴趣专家进行评分，显著提高点击率预测效果。",
    "en_tdlr": "Proposed DemiNet model significantly improves click-through rate prediction by utilizing dependency-aware heterogeneous attention, self-supervised interest learning, and interest experts for rating."
}