{
    "title": "A Multi-stage Transfer Learning Framework for Diabetic Retinopathy Grading on Small Data. (arXiv:2109.11806v2 [eess.IV] UPDATED)",
    "abstract": "Diabetic retinopathy (DR) is one of the major blindness-causing diseases currently known. Automatic grading of DR using deep learning methods not only speeds up the diagnosis of the disease but also reduces the rate of misdiagnosis. However,problems such as insufficient samples and imbalanced class distribution in small DR datasets have constrained the improvement of grading performance. In this paper, we apply the idea of multi-stage transfer learning into the grading task of DR. The new transfer learning technique utilizes multiple datasets with different scales to enable the model to learn more feature representation information. Meanwhile, to cope with the imbalanced problem of small DR datasets, we present a class-balanced loss function in our work and adopt a simple and easy-to-implement training method for it. The experimental results on IDRiD dataset show that our method can effectively improve the grading performance on small data, obtaining scores of 0.7961 and 0.8763 in term",
    "link": "http://arxiv.org/abs/2109.11806",
    "context": "Title: A Multi-stage Transfer Learning Framework for Diabetic Retinopathy Grading on Small Data. (arXiv:2109.11806v2 [eess.IV] UPDATED)\nAbstract: Diabetic retinopathy (DR) is one of the major blindness-causing diseases currently known. Automatic grading of DR using deep learning methods not only speeds up the diagnosis of the disease but also reduces the rate of misdiagnosis. However,problems such as insufficient samples and imbalanced class distribution in small DR datasets have constrained the improvement of grading performance. In this paper, we apply the idea of multi-stage transfer learning into the grading task of DR. The new transfer learning technique utilizes multiple datasets with different scales to enable the model to learn more feature representation information. Meanwhile, to cope with the imbalanced problem of small DR datasets, we present a class-balanced loss function in our work and adopt a simple and easy-to-implement training method for it. The experimental results on IDRiD dataset show that our method can effectively improve the grading performance on small data, obtaining scores of 0.7961 and 0.8763 in term",
    "path": "papers/21/09/2109.11806.json",
    "total_tokens": 990,
    "translated_title": "面向小数据的糖尿病视网膜病变分级的多阶段迁移学习框架",
    "translated_abstract": "糖尿病视网膜病变(DR)是目前已知的主要盲致病之一。使用深度学习方法对DR进行自动分级不仅可以加快疾病的诊断，还可以降低误诊率。然而，小DR数据集中样本数量不足和类别分布不均衡等问题制约了分级表现的提升。本文将多阶段迁移学习的思想应用于DR的分级任务中。新的迁移学习技术利用多个不同规模的数据集，使模型能够学习更多的特征表示信息。同时，为了应对小DR数据集中的类别不平衡问题，我们提出了一种平衡类损失函数，并采用一种简单易实现的训练方法。在IDRiD数据集上的实验结果表明，我们的方法能够有效地提高小数据集的分级表现，达到0.7961和0.8763的得分。",
    "tldr": "为了解决小数据集中样本数量不足和类别分布不均衡的问题，本论文提出了一个面向糖尿病视网膜病变分级的多阶段迁移学习框架，并采用平衡类损失函数进行训练，实验结果表明在IDRiD数据集上能够有效提高分级表现。",
    "en_tdlr": "This paper proposes a multi-stage transfer learning framework for diabetic retinopathy (DR) grading on small datasets, by utilizing different scales of datasets to improve feature representation and adopting a class-balanced loss function to deal with imbalanced problem. Experimental results show that the proposed method could effectively improve the grading performance on small data, achieving scores of 0.7961 and 0.8763 on IDRiD dataset."
}