{
    "title": "BDG inequalities and their applications for model-free continuous price paths with instant enforcement. (arXiv:2109.07928v4 [q-fin.GN] UPDATED)",
    "abstract": "Shafer and Vovk introduce in their book \\cite{ShaferVovk:2018} the notion of \\emph{instant enforcement} and \\emph{instantly blockable} properties. However, they do not associate these notions with any outer measure, unlike what Vovk did in the case of sets of ''typical'' price paths. In this paper we introduce an outer measure on the space $[0, +\\ns) \\times \\Omega$ which assigns zero value exactly to those sets (properties) of pairs of time $t$ and an elementary event $\\omega$ which are instantly blockable. Next, for a slightly modified measure, we prove It\\^o's isometry and BDG inequalities, and then use them to define an It\\^o-type integral. Additionally, we prove few properties for the quadratic variation of model-free, continuous martingales, which hold with instant enforcement.",
    "link": "http://arxiv.org/abs/2109.07928",
    "context": "Title: BDG inequalities and their applications for model-free continuous price paths with instant enforcement. (arXiv:2109.07928v4 [q-fin.GN] UPDATED)\nAbstract: Shafer and Vovk introduce in their book \\cite{ShaferVovk:2018} the notion of \\emph{instant enforcement} and \\emph{instantly blockable} properties. However, they do not associate these notions with any outer measure, unlike what Vovk did in the case of sets of ''typical'' price paths. In this paper we introduce an outer measure on the space $[0, +\\ns) \\times \\Omega$ which assigns zero value exactly to those sets (properties) of pairs of time $t$ and an elementary event $\\omega$ which are instantly blockable. Next, for a slightly modified measure, we prove It\\^o's isometry and BDG inequalities, and then use them to define an It\\^o-type integral. Additionally, we prove few properties for the quadratic variation of model-free, continuous martingales, which hold with instant enforcement.",
    "path": "papers/21/09/2109.07928.json",
    "total_tokens": 868,
    "translated_title": "BDG不等式及其在无模型连续价格路径中的应用",
    "translated_abstract": "Shafer和Vovk在他们的书中介绍了“即时执行”和“即时阻塞”属性的概念。然而，与Vovk在“典型”价格路径集合的情况不同，他们没有将这些概念与任何外度量联系起来。在本文中，我们引入了一个外度量，它在空间$[0, +\\infty) \\times \\Omega$上赋予那些立即可阻塞的时间$t$和基本事件$\\omega$对的集合（属性）以零值。接下来，对于一个稍微修改的度量，我们证明了It\\^o的等距定理和BDG不等式，然后使用它们定义了一个It\\^o型积分。此外，我们证明了无模型连续鞅的二次变差的几个属性，它们在即时执行的情况下成立。",
    "tldr": "本文介绍了一种外度量，通过其在时间$t$和基本事件$\\omega$对的集合上的取值来表示立即可阻塞的属性，然后利用BDG不等式定义了一个特定类型的积分，并证明了在即时执行的情况下适用的一些性质。",
    "en_tdlr": "This paper introduces an outer measure that represents instantly blockable properties by assigning values on sets of pairs of time $t$ and elementary event $\\omega$, and uses BDG inequalities to define a specific type of integral, proving several properties that hold under instant enforcement."
}