{
    "title": "Deploying clinical machine learning? Consider the following.... (arXiv:2109.06919v3 [cs.LG] UPDATED)",
    "abstract": "Despite the intense attention and considerable investment into clinical machine learning research, relatively few applications have been deployed at a large-scale in a real-world clinical environment. While research is important in advancing the state-of-the-art, translation is equally important in bringing these techniques and technologies into a position to ultimately impact healthcare. We believe a lack of appreciation for several considerations are a major cause for this discrepancy between expectation and reality. To better characterize a holistic perspective among researchers and practitioners, we survey several practitioners with commercial experience in developing CML for clinical deployment. Using these insights, we identify several main categories of challenges in order to better design and develop clinical machine learning applications.",
    "link": "http://arxiv.org/abs/2109.06919",
    "context": "Title: Deploying clinical machine learning? Consider the following.... (arXiv:2109.06919v3 [cs.LG] UPDATED)\nAbstract: Despite the intense attention and considerable investment into clinical machine learning research, relatively few applications have been deployed at a large-scale in a real-world clinical environment. While research is important in advancing the state-of-the-art, translation is equally important in bringing these techniques and technologies into a position to ultimately impact healthcare. We believe a lack of appreciation for several considerations are a major cause for this discrepancy between expectation and reality. To better characterize a holistic perspective among researchers and practitioners, we survey several practitioners with commercial experience in developing CML for clinical deployment. Using these insights, we identify several main categories of challenges in order to better design and develop clinical machine learning applications.",
    "path": "papers/21/09/2109.06919.json",
    "total_tokens": 794,
    "translated_title": "部署临床机器学习？得考虑以下因素....",
    "translated_abstract": "尽管临床机器学习研究受到了密切关注和相当多的投资，但在实际的临床环境中大规模部署的应用程序还比较少。虽然研究对于推动技术的发展至关重要，但翻译同样重要，以便使这些技术最终对医疗保健产生影响。我们认为，对于一些考虑因素的缺乏是导致研究预期与实际差距的主要原因。为了更好地表达研究人员和实践者之间的整体观点，我们对具有开发临床机器学习应用商业经验的几位实践者进行了调查。利用这些见解，我们确定了几个主要的挑战类别，以便更好地设计和开发临床机器学习应用程序。",
    "tldr": "部署临床机器学习应用程序面临多重困难，考虑到一些挑战因素，研究人员和实践者需要从多个方面来更好地设计和开发这些应用程序。",
    "en_tdlr": "Deploying clinical machine learning applications faces multiple challenges. Researchers and practitioners need to better design and develop these applications from multiple aspects by considering certain challenging factors."
}