{
    "title": "Well Googled is Half Done: Multimodal Forecasting of New Fashion Product Sales with Image-based Google Trends. (arXiv:2109.09824v6 [cs.CV] UPDATED)",
    "abstract": "New fashion product sales forecasting is a challenging problem that involves many business dynamics and cannot be solved by classical forecasting approaches. In this paper, we investigate the effectiveness of systematically probing exogenous knowledge in the form of Google Trends time series and combining it with multi-modal information related to a brand-new fashion item, in order to effectively forecast its sales despite the lack of past data. In particular, we propose a neural network-based approach, where an encoder learns a representation of the exogenous time series, while the decoder forecasts the sales based on the Google Trends encoding and the available visual and metadata information. Our model works in a non-autoregressive manner, avoiding the compounding effect of large first-step errors. As a second contribution, we present VISUELLE, a publicly available dataset for the task of new fashion product sales forecasting, containing multimodal information for 5577 real, new pro",
    "link": "http://arxiv.org/abs/2109.09824",
    "context": "Title: Well Googled is Half Done: Multimodal Forecasting of New Fashion Product Sales with Image-based Google Trends. (arXiv:2109.09824v6 [cs.CV] UPDATED)\nAbstract: New fashion product sales forecasting is a challenging problem that involves many business dynamics and cannot be solved by classical forecasting approaches. In this paper, we investigate the effectiveness of systematically probing exogenous knowledge in the form of Google Trends time series and combining it with multi-modal information related to a brand-new fashion item, in order to effectively forecast its sales despite the lack of past data. In particular, we propose a neural network-based approach, where an encoder learns a representation of the exogenous time series, while the decoder forecasts the sales based on the Google Trends encoding and the available visual and metadata information. Our model works in a non-autoregressive manner, avoiding the compounding effect of large first-step errors. As a second contribution, we present VISUELLE, a publicly available dataset for the task of new fashion product sales forecasting, containing multimodal information for 5577 real, new pro",
    "path": "papers/21/09/2109.09824.json",
    "total_tokens": 974,
    "translated_title": "谷歌趋势和多模态信息在新时尚产品销量预测中的应用：多模态基于图像的谷歌趋势",
    "translated_abstract": "新时尚产品销量预测是一个具有挑战性的问题，涉及到许多商业动态，并且不能通过传统的预测方法来解决。本文研究了系统地探索外部知识的有效性，以谷歌趋势时间序列的形式结合与全新时尚产品相关的多模态信息，从而在缺乏过去数据的情况下有效预测其销量。具体而言，我们提出了基于神经网络的方法，在编码器学习外部时间序列的表示的同时，解码器根据谷歌趋势编码和可用的视觉和元数据信息来预测销量。我们的模型以非自回归的方式工作，避免了大的第一步误差的累积效应。作为第二个贡献，我们提供了一个名为VISUELLE的公开可用数据集，用于新时尚产品销量预测任务，其中包含5577个真实的、新的产品的多模态信息。",
    "tldr": "本论文研究了在新时尚产品销量预测中结合谷歌趋势和多模态信息的有效性，提出了一种基于神经网络的非自回归模型，并提供了一个公开可用的数据集。通过将谷歌趋势编码与视觉和元数据信息相结合，我们能够有效预测缺乏过去数据的新时尚产品销量。",
    "en_tdlr": "This paper investigates the effectiveness of combining Google Trends and multi-modal information for forecasting new fashion product sales. It proposes a non-autoregressive neural network model and provides a publicly available dataset. By integrating Google Trends encoding with visual and metadata information, the model achieves accurate sales predictions for new fashion products without relying on past data."
}