{
    "title": "Mapper-type algorithms for complex data and relations. (arXiv:2109.00831v2 [math.AT] UPDATED)",
    "abstract": "Mapper and Ball Mapper are Topological Data Analysis tools used for exploring high dimensional point clouds and visualizing scalar-valued functions on those point clouds. Inspired by open questions in knot theory, new features are added to Ball Mapper that enable encoding of the structure, internal relations and symmetries of the point cloud. Moreover, the strengths of Mapper and Ball Mapper constructions are combined to create a tool for comparing high dimensional data descriptors of a single dataset. This new hybrid algorithm, Mapper on Ball Mapper, is applicable to high dimensional lens functions. As a proof of concept we include applications to knot and game theory, as well as material science and cancer research.",
    "link": "http://arxiv.org/abs/2109.00831",
    "context": "Title: Mapper-type algorithms for complex data and relations. (arXiv:2109.00831v2 [math.AT] UPDATED)\nAbstract: Mapper and Ball Mapper are Topological Data Analysis tools used for exploring high dimensional point clouds and visualizing scalar-valued functions on those point clouds. Inspired by open questions in knot theory, new features are added to Ball Mapper that enable encoding of the structure, internal relations and symmetries of the point cloud. Moreover, the strengths of Mapper and Ball Mapper constructions are combined to create a tool for comparing high dimensional data descriptors of a single dataset. This new hybrid algorithm, Mapper on Ball Mapper, is applicable to high dimensional lens functions. As a proof of concept we include applications to knot and game theory, as well as material science and cancer research.",
    "path": "papers/21/09/2109.00831.json",
    "total_tokens": 837,
    "translated_title": "基于Mapper类型算法的复杂数据和关系处理",
    "translated_abstract": "Mapper和Ball Mapper 是一种拓扑数据分析工具，用于探索高维点云，并可视化点云上的标量值函数。本论文在未解决的结论理论问题的启发下，将新功能添加到Ball Mapper中，使其能够编码点云的结构、内部关系和对称性。此外，本文将Mapper和Ball Mapper的优势结合起来，创造了一种比较单个数据集的高维数据描述符的工具——Mapper on Ball Mapper。这种新型混合算法适用于高维透镜函数。作为概念证明，本研究并将应用于结论理论和博弈理论，以及材料科学和癌症研究领域。",
    "tldr": "本文提出了一种基于 Mapper 和 Ball Mapper 的混合算法，命名为 Mapper on Ball Mapper，可以用于处理高维透镜函数。该算法结合了 Mapper 和 Ball Mapper 的优势，能够同时编码点云的结构、内部关系和对称性，并可用于比较单个数据集的高维数据描述符，适用于结论理论、博弈理论、材料科学和癌症研究等领域。",
    "en_tdlr": "This paper proposes a new hybrid algorithm named Mapper on Ball Mapper based on Mapper and Ball Mapper, which is applicable to high dimensional lens functions and can encode the structure, internal relations, and symmetries of the point cloud. This algorithm can compare high dimensional data descriptors of a single dataset, and has been applied to knot and game theory, material science, and cancer research."
}