{
    "title": "Cross-linguistic differences in gender congruency effects: Evidence from meta-analyses. (arXiv:2109.03490v3 [cs.CL] UPDATED)",
    "abstract": "It has been proposed that the order in which words are prepared for production depends on the speaker's language. When producing the translation equivalent of the small cat, speakers of German or Dutch select the gender-marked determiner at a relatively early stage of production. Speakers of French or Italian postpone the encoding of a determiner or adjective until the phonological form of the noun is available. Hence, even though the words are produced in the same order (e.g., die kleine Katze in German, le petit chat in French), they are not planned in the same order and might require different amounts of advanced planning prior to production onset. This distinction between early and late selection languages was proposed to account for the observation that speakers of Germanic and Slavic languages, but not of Romance languages, are slower to name pictures in the context of a distractor word of a different gender. Meta-analyses are conducted to provide the first direct test of this cr",
    "link": "http://arxiv.org/abs/2109.03490",
    "context": "Title: Cross-linguistic differences in gender congruency effects: Evidence from meta-analyses. (arXiv:2109.03490v3 [cs.CL] UPDATED)\nAbstract: It has been proposed that the order in which words are prepared for production depends on the speaker's language. When producing the translation equivalent of the small cat, speakers of German or Dutch select the gender-marked determiner at a relatively early stage of production. Speakers of French or Italian postpone the encoding of a determiner or adjective until the phonological form of the noun is available. Hence, even though the words are produced in the same order (e.g., die kleine Katze in German, le petit chat in French), they are not planned in the same order and might require different amounts of advanced planning prior to production onset. This distinction between early and late selection languages was proposed to account for the observation that speakers of Germanic and Slavic languages, but not of Romance languages, are slower to name pictures in the context of a distractor word of a different gender. Meta-analyses are conducted to provide the first direct test of this cr",
    "path": "papers/21/09/2109.03490.json",
    "total_tokens": 1151,
    "translated_title": "跨语言性别一致性影响的跨语言差异：基于元分析的证据。",
    "translated_abstract": "有人认为，单词制作的准备顺序取决于说话者所用的语言。当德语或荷兰语的说话者制作小猫的翻译时，会在制作过程的较早阶段选择标记性别的限定词。而法语或意大利语的说话者会将限定词或形容词的编码推迟到可用名词的音韵形式之后。因此，即使单词的顺序相同（例如在德语中是“die kleine Katze”，在法语中是“le petit chat”），它们的计划顺序不同，可能需要在制作开始前进行不同程度的提前计划。这种早期和晚期选择语言之间的区别是为了解释观察到的指出德日等语言但不包括罗曼语系语言中的图片命名速度较慢的性别干扰效应。进行元分析以直接测试这一跨语言性假说。分析表明，在图片命名反应时间中，性别一致效应在日尔曼语言和斯拉夫语言中的稳健性比罗曼语系语言更高。但是，效应大小适中，并且分析还揭示了效应大小在研究之间存在相当的变异性。这些结果指出了性别标记影响语言制作的跨语言差异，同时也强调了考虑影响性别一致性效应大小的方法和语境因素的重要性。",
    "tldr": "通过元分析证实，日尔曼语言和斯拉夫语言中的性别一致效应比罗曼语言更加稳健，但效应大小适中，并且存在研究间的变异性。",
    "en_tdlr": "Meta-analyses confirm that gender congruency effects are more robust in Germanic and Slavic languages than in Romance languages, although the effect size is moderate and there is considerable variability across studies."
}