{
    "title": "From Learning to Analytics: Improving Model Efficacy with Goal-Directed Client Selection",
    "abstract": "arXiv:2404.00371v1 Announce Type: new  Abstract: Federated learning (FL) is an appealing paradigm for learning a global model among distributed clients while preserving data privacy. Driven by the demand for high-quality user experiences, evaluating the well-trained global model after the FL process is crucial. In this paper, we propose a closed-loop model analytics framework that allows for effective evaluation of the trained global model using clients' local data. To address the challenges posed by system and data heterogeneities in the FL process, we study a goal-directed client selection problem based on the model analytics framework by selecting a subset of clients for the model training. This problem is formulated as a stochastic multi-armed bandit (SMAB) problem. We first put forth a quick initial upper confidence bound (Quick-Init UCB) algorithm to solve this SMAB problem under the federated analytics (FA) framework. Then, we further propose a belief propagation-based UCB (BP-U",
    "link": "https://arxiv.org/abs/2404.00371",
    "context": "Title: From Learning to Analytics: Improving Model Efficacy with Goal-Directed Client Selection\nAbstract: arXiv:2404.00371v1 Announce Type: new  Abstract: Federated learning (FL) is an appealing paradigm for learning a global model among distributed clients while preserving data privacy. Driven by the demand for high-quality user experiences, evaluating the well-trained global model after the FL process is crucial. In this paper, we propose a closed-loop model analytics framework that allows for effective evaluation of the trained global model using clients' local data. To address the challenges posed by system and data heterogeneities in the FL process, we study a goal-directed client selection problem based on the model analytics framework by selecting a subset of clients for the model training. This problem is formulated as a stochastic multi-armed bandit (SMAB) problem. We first put forth a quick initial upper confidence bound (Quick-Init UCB) algorithm to solve this SMAB problem under the federated analytics (FA) framework. Then, we further propose a belief propagation-based UCB (BP-U",
    "path": "papers/24/04/2404.00371.json",
    "total_tokens": 812,
    "translated_title": "从学习到分析：通过目标导向的客户选择提高模型效能",
    "translated_abstract": "联邦学习（FL）是一种吸引人的学习范式，可以在分布式客户端之间学习全局模型同时保护数据隐私。本文提出了一个闭环模型分析框架，允许利用客户端的本地数据有效评估训练好的全局模型。为了解决FL过程中系统和数据异构性带来的挑战，我们研究了一个基于模型分析框架的目标导向客户选择问题，通过选择一部分客户端进行模型训练。这个问题被制定为一个随机多臂老虎机（SMAB）问题。我们首先提出了一个快速初始上置信界（Quick-Init UCB）算法来解决这个SMAB问题，即在联邦分析（FA）框架下。然后，我们进一步提出了一个基于信念传播的UCB（BP-U",
    "tldr": "提出闭环模型分析框架，通过目标导向客户选择，解决联邦学习中的系统和数据异构性挑战。",
    "en_tdlr": "Proposed a closed-loop model analytics framework with goal-directed client selection to address system and data heterogeneities challenges in federated learning."
}