{
    "title": "MaiNLP at SemEval-2024 Task 1: Analyzing Source Language Selection in Cross-Lingual Textual Relatedness",
    "abstract": "arXiv:2404.02570v1 Announce Type: new  Abstract: This paper presents our system developed for the SemEval-2024 Task 1: Semantic Textual Relatedness (STR), on Track C: Cross-lingual. The task aims to detect semantic relatedness of two sentences in a given target language without access to direct supervision (i.e. zero-shot cross-lingual transfer). To this end, we focus on different source language selection strategies on two different pre-trained languages models: XLM-R and Furina. We experiment with 1) single-source transfer and select source languages based on typological similarity, 2) augmenting English training data with the two nearest-neighbor source languages, and 3) multi-source transfer where we compare selecting on all training languages against languages from the same family. We further study machine translation-based data augmentation and the impact of script differences. Our submission achieved the first place in the C8 (Kinyarwanda) test set.",
    "link": "https://arxiv.org/abs/2404.02570",
    "context": "Title: MaiNLP at SemEval-2024 Task 1: Analyzing Source Language Selection in Cross-Lingual Textual Relatedness\nAbstract: arXiv:2404.02570v1 Announce Type: new  Abstract: This paper presents our system developed for the SemEval-2024 Task 1: Semantic Textual Relatedness (STR), on Track C: Cross-lingual. The task aims to detect semantic relatedness of two sentences in a given target language without access to direct supervision (i.e. zero-shot cross-lingual transfer). To this end, we focus on different source language selection strategies on two different pre-trained languages models: XLM-R and Furina. We experiment with 1) single-source transfer and select source languages based on typological similarity, 2) augmenting English training data with the two nearest-neighbor source languages, and 3) multi-source transfer where we compare selecting on all training languages against languages from the same family. We further study machine translation-based data augmentation and the impact of script differences. Our submission achieved the first place in the C8 (Kinyarwanda) test set.",
    "path": "papers/24/04/2404.02570.json",
    "total_tokens": 923,
    "translated_title": "SemEval-2024任务1的MaiNLP：跨语言文本相关性中源语言选择的分析",
    "translated_abstract": "本文介绍了我们为SemEval-2024任务1开发的系统：语义文本相关性（STR）的跨语言Track C。该任务旨在在没有直接监督的情况下（即零-shot跨语言转移）检测给定目标语言中两个句子的语义相关性。为此，我们着重于两种不同的预训练语言模型XLM-R和Furina上的不同源语言选择策略。我们尝试了1）单源转移，并基于类型相似性选择源语言，2）用两个最接近的源语言增强英语训练数据，以及3）多源转移，比较所有训练语言与来自同一语言家族的语言的选择。我们进一步研究了基于机器翻译的数据扩充和脚本差异的影响。我们的提交在C8（Kinyarwanda）测试集中取得了第一名。",
    "tldr": "本文研究了在跨语言文本相关性中选择源语言的策略，尤其关注不同的预训练语言模型下的单源转移、多源转移和基于机器翻译的数据增强，最终在C8（Kinyarwanda）测试集中取得了第一名。",
    "en_tdlr": "This paper investigates strategies for selecting the source language in cross-lingual textual relatedness, with a focus on single-source transfer, multi-source transfer, and machine translation-based data augmentation under different pre-trained language models, achieving first place in the C8 (Kinyarwanda) test set."
}