{
    "title": "Optical Text Recognition in Nepali and Bengali: A Transformer-based Approach",
    "abstract": "arXiv:2404.02375v1 Announce Type: new  Abstract: Efforts on the research and development of OCR systems for Low-Resource Languages are relatively new. Low-resource languages have little training data available for training Machine Translation systems or other systems. Even though a vast amount of text has been digitized and made available on the internet the text is still in PDF and Image format, which are not instantly accessible. This paper discusses text recognition for two scripts: Bengali and Nepali; there are about 300 and 40 million Bengali and Nepali speakers respectively. In this study, using encoder-decoder transformers, a model was developed, and its efficacy was assessed using a collection of optical text images, both handwritten and printed. The results signify that the suggested technique corresponds with current approaches and achieves high precision in recognizing text in Bengali and Nepali. This study can pave the way for the advanced and accessible study of linguistic",
    "link": "https://arxiv.org/abs/2404.02375",
    "context": "Title: Optical Text Recognition in Nepali and Bengali: A Transformer-based Approach\nAbstract: arXiv:2404.02375v1 Announce Type: new  Abstract: Efforts on the research and development of OCR systems for Low-Resource Languages are relatively new. Low-resource languages have little training data available for training Machine Translation systems or other systems. Even though a vast amount of text has been digitized and made available on the internet the text is still in PDF and Image format, which are not instantly accessible. This paper discusses text recognition for two scripts: Bengali and Nepali; there are about 300 and 40 million Bengali and Nepali speakers respectively. In this study, using encoder-decoder transformers, a model was developed, and its efficacy was assessed using a collection of optical text images, both handwritten and printed. The results signify that the suggested technique corresponds with current approaches and achieves high precision in recognizing text in Bengali and Nepali. This study can pave the way for the advanced and accessible study of linguistic",
    "path": "papers/24/04/2404.02375.json",
    "total_tokens": 894,
    "translated_title": "尼泊尔语和孟加拉语中的光学文本识别：一种基于Transformer的方法",
    "translated_abstract": "低资源语言的OCR系统的研究与开发工作相对较新。 低资源语言在训练机器翻译系统或其他系统时可用的训练数据较少。 尽管有大量文本已经被数字化并在互联网上提供，但这些文本仍处于PDF和图像格式，这些格式并非立即可访问。 本文讨论了孟加拉语和尼泊尔语两种文字的文本识别；大约有3亿和4千万的孟加拉语和尼泊尔语使用者。 在这项研究中，使用编码器-解码器Transformer，开发了一个模型，并使用一系列光学文本图像（手写和印刷）对其有效性进行了评估。 结果表明，建议的技术与当前方法相符，并在识别孟加拉语和尼泊尔语文本方面具有高精度。 该研究为语言学的先进和易访问性研究铺平了道路",
    "tldr": "该论文介绍了使用编码器-解码器transformer模型进行尼泊尔语和孟加拉语的文本识别研究，高精度识别两种语言文字，有望推动语言学的先进和易访问性研究",
    "en_tdlr": "The paper presents a study on optical text recognition in Nepali and Bengali using encoder-decoder transformer models, achieving high precision in recognizing text in both languages, which could pave the way for advanced and accessible linguistic research."
}