{
    "title": "CSEPrompts: A Benchmark of Introductory Computer Science Prompts",
    "abstract": "arXiv:2404.02540v1 Announce Type: new  Abstract: Recent advances in AI, machine learning, and NLP have led to the development of a new generation of Large Language Models (LLMs) that are trained on massive amounts of data and often have trillions of parameters. Commercial applications (e.g., ChatGPT) have made this technology available to the general public, thus making it possible to use LLMs to produce high-quality texts for academic and professional purposes. Schools and universities are aware of the increasing use of AI-generated content by students and they have been researching the impact of this new technology and its potential misuse. Educational programs in Computer Science (CS) and related fields are particularly affected because LLMs are also capable of generating programming code in various programming languages. To help understand the potential impact of publicly available LLMs in CS education, we introduce CSEPrompts, a framework with hundreds of programming exercise prom",
    "link": "https://arxiv.org/abs/2404.02540",
    "context": "Title: CSEPrompts: A Benchmark of Introductory Computer Science Prompts\nAbstract: arXiv:2404.02540v1 Announce Type: new  Abstract: Recent advances in AI, machine learning, and NLP have led to the development of a new generation of Large Language Models (LLMs) that are trained on massive amounts of data and often have trillions of parameters. Commercial applications (e.g., ChatGPT) have made this technology available to the general public, thus making it possible to use LLMs to produce high-quality texts for academic and professional purposes. Schools and universities are aware of the increasing use of AI-generated content by students and they have been researching the impact of this new technology and its potential misuse. Educational programs in Computer Science (CS) and related fields are particularly affected because LLMs are also capable of generating programming code in various programming languages. To help understand the potential impact of publicly available LLMs in CS education, we introduce CSEPrompts, a framework with hundreds of programming exercise prom",
    "path": "papers/24/04/2404.02540.json",
    "total_tokens": 841,
    "translated_title": "CSEPrompts: 初级计算机科学提示的基准",
    "translated_abstract": "最近人工智能、机器学习和自然语言处理方面的进展导致了新一代大型语言模型（LLMs）的开发，这些模型在海量数据上进行训练，通常拥有数万亿参数。商业应用（如ChatGPT）已使这项技术面向普通大众，因此可以利用LLMs为学术和专业用途生成高质量文本。学校和大学意识到学生越来越多地使用由AI生成的内容，他们一直在研究这种新技术及其潜在的滥用。计算机科学（CS）及相关领域的教育项目尤其受到影响，因为LLMs也能够生成各种编程语言的编程代码。为了帮助理解计算机科学教育中公开可用LLMs的潜在影响，我们引入了CSEPrompts，一个包含数百个编程练习提示的框架。",
    "tldr": "CSEPrompts是一个包含数百个编程练习提示的框架，旨在帮助理解计算机科学教育中公开可用的大型语言模型的潜在影响。",
    "en_tdlr": "CSEPrompts is a framework with hundreds of programming exercise prompts designed to understand the potential impact of publicly available Large Language Models in computer science education."
}