{
    "title": "A Novel Audio Representation for Music Genre Identification in MIR",
    "abstract": "arXiv:2404.01058v1 Announce Type: cross  Abstract: For Music Information Retrieval downstream tasks, the most common audio representation is time-frequency-based, such as Mel spectrograms. In order to identify musical genres, this study explores the possibilities of a new form of audio representation one of the most usual MIR downstream tasks. Therefore, to discretely encoding music using deep vector quantization; a novel audio representation was created for the innovative generative music model i.e. Jukebox. The effectiveness of Jukebox's audio representation is compared to Mel spectrograms using a dataset that is almost equivalent to State-of-the-Art (SOTA) and an almost same transformer design. The results of this study imply that, at least when the transformers are pretrained using a very modest dataset of 20k tracks, Jukebox's audio representation is not superior to Mel spectrograms. This could be explained by the fact that Jukebox's audio representation does not sufficiently take",
    "link": "https://arxiv.org/abs/2404.01058",
    "context": "Title: A Novel Audio Representation for Music Genre Identification in MIR\nAbstract: arXiv:2404.01058v1 Announce Type: cross  Abstract: For Music Information Retrieval downstream tasks, the most common audio representation is time-frequency-based, such as Mel spectrograms. In order to identify musical genres, this study explores the possibilities of a new form of audio representation one of the most usual MIR downstream tasks. Therefore, to discretely encoding music using deep vector quantization; a novel audio representation was created for the innovative generative music model i.e. Jukebox. The effectiveness of Jukebox's audio representation is compared to Mel spectrograms using a dataset that is almost equivalent to State-of-the-Art (SOTA) and an almost same transformer design. The results of this study imply that, at least when the transformers are pretrained using a very modest dataset of 20k tracks, Jukebox's audio representation is not superior to Mel spectrograms. This could be explained by the fact that Jukebox's audio representation does not sufficiently take",
    "path": "papers/24/04/2404.01058.json",
    "total_tokens": 819,
    "translated_title": "音乐流派识别中一种新颖的音频表示",
    "translated_abstract": "对于音乐信息检索的下游任务，最常见的音频表示形式是基于时频的表示，例如Mel频谱图。为了识别音乐流派，本研究探索了一种新形式的音频表示，用于其中最常见的MIR下游任务之一。因此，为了使用深度向量量化离散地编码音乐；为创新的生成式音乐模型Jukebox创建了一种新颖的音频表示。通过使用几乎等同于业界领先水平(SOTA)和几乎相同的变压器设计的数据集来比较Jukebox的音频表示与Mel频谱图的有效性。本研究结果暗示，至少当变压器使用非常适度的数据集（20k首音轨）进行预训练时，Jukebox的音频表示并不优于Mel频谱图。这可能是因为Jukebox的音频表示并未充分考虑到",
    "tldr": "本研究探索了一种新颖的音频表示形式，但发现其在音乐流派识别任务中并不比传统的Mel频谱图更优越。",
    "en_tdlr": "This study explores a novel audio representation but finds that it is not superior to traditional Mel spectrograms in music genre identification task."
}