{
    "title": "Kallaama: A Transcribed Speech Dataset about Agriculture in the Three Most Widely Spoken Languages in Senegal",
    "abstract": "arXiv:2404.01991v1 Announce Type: new  Abstract: This work is part of the Kallaama project, whose objective is to produce and disseminate national languages corpora for speech technologies developments, in the field of agriculture. Except for Wolof, which benefits from some language data for natural language processing, national languages of Senegal are largely ignored by language technology providers. However, such technologies are keys to the protection, promotion and teaching of these languages. Kallaama focuses on the 3 main spoken languages by Senegalese people: Wolof, Pulaar and Sereer. These languages are widely spoken by the population, with around 10 million of native Senegalese speakers, not to mention those outside the country. However, they remain under-resourced in terms of machine-readable data that can be used for automatic processing and language technologies, all the more so in the agricultural sector. We release a transcribed speech dataset containing 125 hours of rec",
    "link": "https://arxiv.org/abs/2404.01991",
    "context": "Title: Kallaama: A Transcribed Speech Dataset about Agriculture in the Three Most Widely Spoken Languages in Senegal\nAbstract: arXiv:2404.01991v1 Announce Type: new  Abstract: This work is part of the Kallaama project, whose objective is to produce and disseminate national languages corpora for speech technologies developments, in the field of agriculture. Except for Wolof, which benefits from some language data for natural language processing, national languages of Senegal are largely ignored by language technology providers. However, such technologies are keys to the protection, promotion and teaching of these languages. Kallaama focuses on the 3 main spoken languages by Senegalese people: Wolof, Pulaar and Sereer. These languages are widely spoken by the population, with around 10 million of native Senegalese speakers, not to mention those outside the country. However, they remain under-resourced in terms of machine-readable data that can be used for automatic processing and language technologies, all the more so in the agricultural sector. We release a transcribed speech dataset containing 125 hours of rec",
    "path": "papers/24/04/2404.01991.json",
    "total_tokens": 854,
    "translated_title": "Kallaama：塞内加尔三种最广泛使用的语言中关于农业的语音数据集",
    "translated_abstract": "这项工作是Kallaama项目的一部分，旨在为农业领域的语音技术发展生产和传播国家语言语料库。除了沃洛夫语外（沃洛夫语已有自然语言处理的一些语言数据），塞内加尔的国家语言在很大程度上被语言技术提供商忽视。然而，这些技术是保护、促进和教授这些语言的关键。Kallaama关注塞内加尔人口中使用最多的3种主要语言：沃洛夫语、普拉语和瑟里尔语。这些语言被人口广泛使用，约有1000万塞内加尔本地使用者，更不用说国外的人了。然而，在农业领域，这些语言在机器可读数据方面仍然资源匮乏，无法用于自动处理和语言技术。",
    "tldr": "Kallaama项目发布了一个包含125小时录音的语音数据集，旨在填补塞内加尔三种主要语言中关于农业领域的机器可读数据不足的空白。",
    "en_tdlr": "The Kallaama project released a transcribed speech dataset of 125 hours to address the lack of machine-readable data in the agricultural sector for the three main languages spoken in Senegal."
}