{
    "title": "Improved model-free bounds for multi-asset options using option-implied information and deep learning",
    "abstract": "arXiv:2404.02343v1 Announce Type: cross  Abstract: We consider the computation of model-free bounds for multi-asset options in a setting that combines dependence uncertainty with additional information on the dependence structure. More specifically, we consider the setting where the marginal distributions are known and partial information, in the form of known prices for multi-asset options, is also available in the market. We provide a fundamental theorem of asset pricing in this setting, as well as a superhedging duality that allows to transform the maximization problem over probability measures in a more tractable minimization problem over trading strategies. The latter is solved using a penalization approach combined with a deep learning approximation using artificial neural networks. The numerical method is fast and the computational time scales linearly with respect to the number of traded assets. We finally examine the significance of various pieces of additional information. Em",
    "link": "https://arxiv.org/abs/2404.02343",
    "context": "Title: Improved model-free bounds for multi-asset options using option-implied information and deep learning\nAbstract: arXiv:2404.02343v1 Announce Type: cross  Abstract: We consider the computation of model-free bounds for multi-asset options in a setting that combines dependence uncertainty with additional information on the dependence structure. More specifically, we consider the setting where the marginal distributions are known and partial information, in the form of known prices for multi-asset options, is also available in the market. We provide a fundamental theorem of asset pricing in this setting, as well as a superhedging duality that allows to transform the maximization problem over probability measures in a more tractable minimization problem over trading strategies. The latter is solved using a penalization approach combined with a deep learning approximation using artificial neural networks. The numerical method is fast and the computational time scales linearly with respect to the number of traded assets. We finally examine the significance of various pieces of additional information. Em",
    "path": "papers/24/04/2404.02343.json",
    "total_tokens": 757,
    "translated_title": "利用期权隐含信息和深度学习改进多资产期权的无模型界限",
    "translated_abstract": "我们考虑在将依赖性不确定性与有关依赖结构的额外信息相结合的情况下计算多资产期权的无模型界限。 更具体地，我们考虑了边际分布已知且市场上也有多资产期权价格的部分信息的情形。 我们在这种情况下给出了资产定价的基本定理，以及一种超对冲对偶，能够将在概率度量上的最大化问题转化为在交易策略上的更易处理的最小化问题。 后者是通过结合罚款方法和借助人工神经网络的深度学习逼近来解决的。 数值方法快速，并且计算时间与交易资产数量成线性比例。 最后，我们检验了各种额外信息的重要性。",
    "tldr": "利用深度学习和期权隐含信息改进多资产期权的无模型上界计算方法",
    "en_tdlr": "Improved model-free bounds for multi-asset options are obtained by leveraging option-implied information and deep learning techniques."
}