{
    "title": "Improve accessibility for Low Vision and Blind people using Machine Learning and Computer Vision",
    "abstract": "arXiv:2404.00043v1 Announce Type: cross  Abstract: With the ever-growing expansion of mobile technology worldwide, there is an increasing need for accommodation for those who are disabled. This project explores how machine learning and computer vision could be utilized to improve accessibility for people with visual impairments. There have been many attempts to develop various software that would improve accessibility in the day-to-day lives of blind people. However, applications on the market have low accuracy and only provide audio feedback. This project will concentrate on building a mobile application that helps blind people to orient in space by receiving audio and haptic feedback, e.g. vibrations, about their surroundings in real-time. The mobile application will have 3 main features. The initial feature is scanning text from the camera and reading it to a user. This feature can be used on paper with text, in the environment, and on road signs. The second feature is detecting obj",
    "link": "https://arxiv.org/abs/2404.00043",
    "context": "Title: Improve accessibility for Low Vision and Blind people using Machine Learning and Computer Vision\nAbstract: arXiv:2404.00043v1 Announce Type: cross  Abstract: With the ever-growing expansion of mobile technology worldwide, there is an increasing need for accommodation for those who are disabled. This project explores how machine learning and computer vision could be utilized to improve accessibility for people with visual impairments. There have been many attempts to develop various software that would improve accessibility in the day-to-day lives of blind people. However, applications on the market have low accuracy and only provide audio feedback. This project will concentrate on building a mobile application that helps blind people to orient in space by receiving audio and haptic feedback, e.g. vibrations, about their surroundings in real-time. The mobile application will have 3 main features. The initial feature is scanning text from the camera and reading it to a user. This feature can be used on paper with text, in the environment, and on road signs. The second feature is detecting obj",
    "path": "papers/24/04/2404.00043.json",
    "total_tokens": 844,
    "translated_title": "利用机器学习和计算机视觉提高低视力和盲人的可访问性",
    "translated_abstract": "随着全球移动技术的不断扩展，残障人士急需得到相应的帮助。该项目探讨了如何利用机器学习和计算机视觉来提高视觉障碍人士的可访问性。过去的尝试开发了许多软件，旨在改善盲人日常生活中的可访问性。然而，市场上的应用准确度较低，并且仅提供音频反馈。该项目将专注于建立一个移动应用，通过实时接收用户周围的音频和触觉反馈（如振动），来帮助盲人在空间中定位。移动应用将具有三个主要功能。首要功能是从相机扫描文本并朗读给用户听。这一功能可用于纸张上的文本、环境中以及道路标识上。",
    "tldr": "该项目利用机器学习和计算机视觉开发移动应用，帮助盲人通过音频和触觉反馈实时定位周围环境，具有扫描文本和朗读、检测物体等功能。"
}