{
    "title": "Accurate Cutting-point Estimation for Robotic Lychee Harvesting through Geometry-aware Learning",
    "abstract": "arXiv:2404.00364v1 Announce Type: cross  Abstract: Accurately identifying lychee-picking points in unstructured orchard environments and obtaining their coordinate locations is critical to the success of lychee-picking robots. However, traditional two-dimensional (2D) image-based object detection methods often struggle due to the complex geometric structures of branches, leaves and fruits, leading to incorrect determination of lychee picking points. In this study, we propose a Fcaf3d-lychee network model specifically designed for the accurate localisation of lychee picking points. Point cloud data of lychee picking points in natural environments are acquired using Microsoft's Azure Kinect DK time-of-flight (TOF) camera through multi-view stitching. We augment the Fully Convolutional Anchor-Free 3D Object Detection (Fcaf3d) model with a squeeze-and-excitation(SE) module, which exploits human visual attention mechanisms for improved feature extraction of lychee picking points. The traine",
    "link": "https://arxiv.org/abs/2404.00364",
    "context": "Title: Accurate Cutting-point Estimation for Robotic Lychee Harvesting through Geometry-aware Learning\nAbstract: arXiv:2404.00364v1 Announce Type: cross  Abstract: Accurately identifying lychee-picking points in unstructured orchard environments and obtaining their coordinate locations is critical to the success of lychee-picking robots. However, traditional two-dimensional (2D) image-based object detection methods often struggle due to the complex geometric structures of branches, leaves and fruits, leading to incorrect determination of lychee picking points. In this study, we propose a Fcaf3d-lychee network model specifically designed for the accurate localisation of lychee picking points. Point cloud data of lychee picking points in natural environments are acquired using Microsoft's Azure Kinect DK time-of-flight (TOF) camera through multi-view stitching. We augment the Fully Convolutional Anchor-Free 3D Object Detection (Fcaf3d) model with a squeeze-and-excitation(SE) module, which exploits human visual attention mechanisms for improved feature extraction of lychee picking points. The traine",
    "path": "papers/24/04/2404.00364.json",
    "total_tokens": 897,
    "translated_title": "通过几何感知学习实现机器人荔枝采摘准确的切割点估计",
    "translated_abstract": "准确识别结构不规则的果园环境中的荔枝采摘点，并获取它们的坐标位置对于荔枝采摘机器人的成功至关重要。然而，传统的基于二维（2D）图像的目标检测方法通常因为树枝、叶子和果实的复杂几何结构而难以应对，导致对荔枝采摘点的错误确定。本研究提出了一个专门用于准确定位荔枝采摘点的 Fcaf3d-lychee 网络模型。我们使用微软的 Azure Kinect DK 飞行时间（TOF）相机通过多视图拼接获取荔枝采摘点在自然环境中的点云数据。我们将完全卷积无锚点 3D 目标检测（Fcaf3d）模型与一个挤压-激发（SE）模块相结合，利用人类视觉注意机制来改进荔枝采摘点的特征提取。",
    "tldr": "提出了一个 Fcaf3d-lychee 网络模型，通过与挤压-激发（SE）模块改进特征提取，实现了对荔枝采摘点的准确定位",
    "en_tdlr": "Proposed a Fcaf3d-lychee network model with improved feature extraction through a squeeze-and-excitation (SE) module for accurate localization of lychee picking points."
}