{
    "title": "Task Agnostic Architecture for Algorithm Induction via Implicit Composition",
    "abstract": "arXiv:2404.02450v1 Announce Type: cross  Abstract: Different fields in applied machine learning such as computer vision, speech or natural language processing have been building domain-specialised solutions. Currently, we are witnessing an opposing trend towards developing more generalist architectures, driven by Large Language Models and multi-modal foundational models. These architectures are designed to tackle a variety of tasks, including those previously unseen and using inputs across multiple modalities. Taking this trend of generalization to the extreme suggests the possibility of a single deep network architecture capable of solving all tasks. This position paper aims to explore developing such a unified architecture and proposes a theoretical framework of how it could be constructed. Our proposal is based on the following assumptions. Firstly, tasks are solved by following a sequence of instructions, typically implemented in code for conventional computing hardware, which inhe",
    "link": "https://arxiv.org/abs/2404.02450",
    "context": "Title: Task Agnostic Architecture for Algorithm Induction via Implicit Composition\nAbstract: arXiv:2404.02450v1 Announce Type: cross  Abstract: Different fields in applied machine learning such as computer vision, speech or natural language processing have been building domain-specialised solutions. Currently, we are witnessing an opposing trend towards developing more generalist architectures, driven by Large Language Models and multi-modal foundational models. These architectures are designed to tackle a variety of tasks, including those previously unseen and using inputs across multiple modalities. Taking this trend of generalization to the extreme suggests the possibility of a single deep network architecture capable of solving all tasks. This position paper aims to explore developing such a unified architecture and proposes a theoretical framework of how it could be constructed. Our proposal is based on the following assumptions. Firstly, tasks are solved by following a sequence of instructions, typically implemented in code for conventional computing hardware, which inhe",
    "path": "papers/24/04/2404.02450.json",
    "total_tokens": 785,
    "translated_title": "通过隐式组合进行算法诱导的任务不可知架构",
    "translated_abstract": "应用机器学习中的不同领域（如计算机视觉、语音或自然语言处理）一直在构建面向特定领域的解决方案。目前，我们正在目睹一个相反的趋势，即向开发更广义的架构发展，这是由大型语言模型和多模式基础模型推动的。这些架构旨在解决各种任务，包括以前未见过的任务，并使用跨多种模式的输入。将这种泛化趋势推向极端意味着可能存在一种能够解决所有任务的单一深度网络架构。本文旨在探索开发这样一个统一架构，并提出了一个理论框架，说明如何构建这样的架构。我们的提议基于以下假设。首先，任务是通过按照一系列指令来解决的，通常在常规计算硬件的代码中实现。",
    "tldr": "探索开发一种统一架构，旨在解决各种任务，包括以前未见过的任务，并使用跨多种模式的输入。",
    "en_tdlr": "Explore the development of a unified architecture aimed at solving various tasks, including previously unseen ones, and using inputs across multiple modalities."
}