{
    "title": "Classification of Short Segment Pediatric Heart Sounds Based on a Transformer-Based Convolutional Neural Network",
    "abstract": "arXiv:2404.00470v1 Announce Type: cross  Abstract: Congenital anomalies arising as a result of a defect in the structure of the heart and great vessels are known as congenital heart diseases or CHDs. A PCG can provide essential details about the mechanical conduction system of the heart and point out specific patterns linked to different kinds of CHD. This study aims to investigate the minimum signal duration required for the automatic classification of heart sounds. This study also investigated the optimum signal quality assessment indicator (Root Mean Square of Successive Differences) RMSSD and (Zero Crossings Rate) ZCR value. Mel-frequency cepstral coefficients (MFCCs) based feature is used as an input to build a Transformer-Based residual one-dimensional convolutional neural network, which is then used for classifying the heart sound. The study showed that 0.4 is the ideal threshold for getting suitable signals for the RMSSD and ZCR indicators. Moreover, a minimum signal length of ",
    "link": "https://arxiv.org/abs/2404.00470",
    "context": "Title: Classification of Short Segment Pediatric Heart Sounds Based on a Transformer-Based Convolutional Neural Network\nAbstract: arXiv:2404.00470v1 Announce Type: cross  Abstract: Congenital anomalies arising as a result of a defect in the structure of the heart and great vessels are known as congenital heart diseases or CHDs. A PCG can provide essential details about the mechanical conduction system of the heart and point out specific patterns linked to different kinds of CHD. This study aims to investigate the minimum signal duration required for the automatic classification of heart sounds. This study also investigated the optimum signal quality assessment indicator (Root Mean Square of Successive Differences) RMSSD and (Zero Crossings Rate) ZCR value. Mel-frequency cepstral coefficients (MFCCs) based feature is used as an input to build a Transformer-Based residual one-dimensional convolutional neural network, which is then used for classifying the heart sound. The study showed that 0.4 is the ideal threshold for getting suitable signals for the RMSSD and ZCR indicators. Moreover, a minimum signal length of ",
    "path": "papers/24/04/2404.00470.json",
    "total_tokens": 914,
    "translated_title": "基于变压器卷积神经网络的儿童心音短段分类",
    "translated_abstract": "先天性心脏病或CHD是由心脏和大血管结构缺陷导致的先天性异常。心脏音频信号可以提供关于心脏机械传导系统的重要细节，并指出与不同类型CHD相关联的特定模式。本研究旨在探讨自动分类心音所需的最小信号持续时间。该研究还调查了最佳信号质量评估指标（连续差的均方根值）RMSSD和（过零率）ZCR值。基于梅尔频率倒谱系数（MFCCs）的特征被用作输入，构建了一个基于变压器的残余一维卷积神经网络，用于分类心音。研究表明0.4是获取适合RMSSD和ZCR指标的信号的理想阈值。此外，为了在基于变压器的卷积神经网络中获得更准确的心音分类结果，研究确定了最佳信号长度。",
    "tldr": "本研究使用变压器卷积神经网络对儿童心音进行短段分类，调查了自动分类所需的最小信号持续时间，并确定了适合RMSSD和ZCR指标的理想阈值。",
    "en_tdlr": "This study proposes a Transformer-Based Convolutional Neural Network for short segment classification of pediatric heart sounds, investigates the minimum signal duration required for automatic classification, and determines the ideal threshold for RMSSD and ZCR indicators."
}