{
    "title": "Predicting the Intention to Interact with a Service Robot:the Role of Gaze Cues",
    "abstract": "arXiv:2404.01986v1 Announce Type: cross  Abstract: For a service robot, it is crucial to perceive as early as possible that an approaching person intends to interact: in this case, it can proactively enact friendly behaviors that lead to an improved user experience. We solve this perception task with a sequence-to-sequence classifier of a potential user intention to interact, which can be trained in a self-supervised way. Our main contribution is a study of the benefit of features representing the person's gaze in this context. Extensive experiments on a novel dataset show that the inclusion of gaze cues significantly improves the classifier performance (AUROC increases from 84.5% to 91.2%); the distance at which an accurate classification can be achieved improves from 2.4 m to 3.2 m. We also quantify the system's ability to adapt to new environments without external supervision. Qualitative experiments show practical applications with a waiter robot.",
    "link": "https://arxiv.org/abs/2404.01986",
    "context": "Title: Predicting the Intention to Interact with a Service Robot:the Role of Gaze Cues\nAbstract: arXiv:2404.01986v1 Announce Type: cross  Abstract: For a service robot, it is crucial to perceive as early as possible that an approaching person intends to interact: in this case, it can proactively enact friendly behaviors that lead to an improved user experience. We solve this perception task with a sequence-to-sequence classifier of a potential user intention to interact, which can be trained in a self-supervised way. Our main contribution is a study of the benefit of features representing the person's gaze in this context. Extensive experiments on a novel dataset show that the inclusion of gaze cues significantly improves the classifier performance (AUROC increases from 84.5% to 91.2%); the distance at which an accurate classification can be achieved improves from 2.4 m to 3.2 m. We also quantify the system's ability to adapt to new environments without external supervision. Qualitative experiments show practical applications with a waiter robot.",
    "path": "papers/24/04/2404.01986.json",
    "total_tokens": 825,
    "translated_title": "预测与服务机器人互动意图：凝视线索的作用",
    "translated_abstract": "对于服务机器人来说，尽快感知一个接近的人是否有意互动至关重要：在这种情况下，它可以主动采取友好行为，从而提高用户体验。我们通过一个潜在用户互动意图的序列到序列分类器来解决这个感知任务，可以以自监督方式进行训练。我们的主要贡献在于研究在这一背景下代表个人凝视的特征的益处。对新颖数据集进行的大量实验证明了凝视线索的包含显著改善了分类器性能（AUROC从84.5%提高到91.2%）；可以实现准确分类的距离从2.4米提高到3.2米。我们还量化了系统在没有外部监督的情况下适应新环境的能力。定性实验展示了服务员机器人的实际应用。",
    "tldr": "凝视线索的有效利用显著提高了服务机器人感知用户互动意图的性能，分类准确性和适应新环境能力。",
    "en_tdlr": "The effective utilization of gaze cues significantly improves the performance of service robots in perceiving users' intention to interact, classification accuracy, and adaptability to new environments."
}