{
    "title": "Unified, Verifiable Neural Simulators for Electromagnetic Wave Inverse Problems",
    "abstract": "arXiv:2404.00545v1 Announce Type: cross  Abstract: Simulators based on neural networks offer a path to orders-of-magnitude faster electromagnetic wave simulations. Existing models, however, only address narrowly tailored classes of problems and only scale to systems of a few dozen degrees of freedom (DoFs). Here, we demonstrate a single, unified model capable of addressing scattering simulations with thousands of DoFs, of any wavelength, any illumination wavefront, and freeform materials, within broad configurable bounds. Based on an attentional multi-conditioning strategy, our method also allows non-recurrent supervision on and prediction of intermediate physical states, which provides improved generalization with no additional data-generation cost. Using this O(1)-time intermediate prediction capability, we propose and prove a rigorous, efficiently computable upper bound on prediction error, allowing accuracy guarantees at inference time for all predictions. After training solely on ",
    "link": "https://arxiv.org/abs/2404.00545",
    "context": "Title: Unified, Verifiable Neural Simulators for Electromagnetic Wave Inverse Problems\nAbstract: arXiv:2404.00545v1 Announce Type: cross  Abstract: Simulators based on neural networks offer a path to orders-of-magnitude faster electromagnetic wave simulations. Existing models, however, only address narrowly tailored classes of problems and only scale to systems of a few dozen degrees of freedom (DoFs). Here, we demonstrate a single, unified model capable of addressing scattering simulations with thousands of DoFs, of any wavelength, any illumination wavefront, and freeform materials, within broad configurable bounds. Based on an attentional multi-conditioning strategy, our method also allows non-recurrent supervision on and prediction of intermediate physical states, which provides improved generalization with no additional data-generation cost. Using this O(1)-time intermediate prediction capability, we propose and prove a rigorous, efficiently computable upper bound on prediction error, allowing accuracy guarantees at inference time for all predictions. After training solely on ",
    "path": "papers/24/04/2404.00545.json",
    "total_tokens": 830,
    "translated_title": "统一、可验证的神经网络模拟器用于电磁波反问题",
    "translated_abstract": "基于神经网络的模拟器为电磁波模拟提供了一条速度快数个数量级的路径。然而，现有模型仅针对狭窄的问题类别，并且仅能扩展到几十个自由度（DoFs）的系统。在这里，我们展示了一个单一、统一的模型，能够处理数千个DoFs的散射模拟，任意波长、任意照明波前和自由形式的材料，且在广泛的可配置范围内。基于注意力多条件策略，我们的方法还允许非递归监督和预测中间物理状态，从而提供了改进的泛化能力，而无需额外的数据生成成本。利用这种O(1)时间的中间预测能力，我们提出并证明了一种严格且高效计算的预测误差上界，允许推断时对所有预测进行准确性保证。",
    "tldr": "提出了一个统一的神经模拟器模型，可以快速处理数千个自由度的散射模拟，并通过中间预测能力提供了准确性保证。",
    "en_tdlr": "A unified neural simulator model is proposed that can efficiently handle scattering simulations with thousands of degrees of freedom, providing accuracy guarantees through intermediate prediction capability."
}