{
    "title": "Methods of Stochastic Field Theory in Non-Equilibrium Systems -- Spontaneous Symmetry Breaking of Ergodicity",
    "abstract": "arXiv:2404.01333v1 Announce Type: cross  Abstract: Recently, a couple of investigations related to symmetry breaking phenomena, 'spontaneous stochasticity' and 'ergodicity breaking' have led to significant impacts in a variety of fields related to the stochastic processes such as economics and finance. We investigate on the origins and effects of those original symmetries in the action from the mathematical and the effective field theory points of view. It is naturally expected that whenever the system respects any symmetry, it would be spontaneously broken once the system falls into a vacuum state which minimizes an effective action of the dynamical system.",
    "link": "https://arxiv.org/abs/2404.01333",
    "context": "Title: Methods of Stochastic Field Theory in Non-Equilibrium Systems -- Spontaneous Symmetry Breaking of Ergodicity\nAbstract: arXiv:2404.01333v1 Announce Type: cross  Abstract: Recently, a couple of investigations related to symmetry breaking phenomena, 'spontaneous stochasticity' and 'ergodicity breaking' have led to significant impacts in a variety of fields related to the stochastic processes such as economics and finance. We investigate on the origins and effects of those original symmetries in the action from the mathematical and the effective field theory points of view. It is naturally expected that whenever the system respects any symmetry, it would be spontaneously broken once the system falls into a vacuum state which minimizes an effective action of the dynamical system.",
    "path": "papers/24/04/2404.01333.json",
    "total_tokens": 673,
    "translated_title": "非平衡系统中随机场理论的方法 -- 随机性破缺的自发对称性",
    "translated_abstract": "最近，几项与对称性破缺现象、'自发随机性'和'遍历性破缺'相关的研究引起了诸多领域的重大影响，例如经济学和金融领域。我们从数学和有效场论的角度探讨了这些原始对称性在作用上的起源和影响。自然地，每当系统遵循某种对称性时，一旦系统陷入最小化动力学系统的有效作用量的真空态，这种对称性将会自发破缺。",
    "tldr": "研究了非平衡系统中随机场理论的方法，探讨了对称性破缺现象和自发对称性破缺的起源和影响。",
    "en_tdlr": "Investigated the methods of stochastic field theory in non-equilibrium systems, examining the origins and effects of symmetry breaking phenomena and spontaneous symmetry breaking."
}