{
    "title": "SGSH: Stimulate Large Language Models with Skeleton Heuristics for Knowledge Base Question Generation",
    "abstract": "arXiv:2404.01923v1 Announce Type: cross  Abstract: Knowledge base question generation (KBQG) aims to generate natural language questions from a set of triplet facts extracted from KB. Existing methods have significantly boosted the performance of KBQG via pre-trained language models (PLMs) thanks to the richly endowed semantic knowledge. With the advance of pre-training techniques, large language models (LLMs) (e.g., GPT-3.5) undoubtedly possess much more semantic knowledge. Therefore, how to effectively organize and exploit the abundant knowledge for KBQG becomes the focus of our study. In this work, we propose SGSH--a simple and effective framework to Stimulate GPT-3.5 with Skeleton Heuristics to enhance KBQG. The framework incorporates \"skeleton heuristics\", which provides more fine-grained guidance associated with each input to stimulate LLMs to generate optimal questions, encompassing essential elements like the question phrase and the auxiliary verb.More specifically, we devise a",
    "link": "https://arxiv.org/abs/2404.01923",
    "context": "Title: SGSH: Stimulate Large Language Models with Skeleton Heuristics for Knowledge Base Question Generation\nAbstract: arXiv:2404.01923v1 Announce Type: cross  Abstract: Knowledge base question generation (KBQG) aims to generate natural language questions from a set of triplet facts extracted from KB. Existing methods have significantly boosted the performance of KBQG via pre-trained language models (PLMs) thanks to the richly endowed semantic knowledge. With the advance of pre-training techniques, large language models (LLMs) (e.g., GPT-3.5) undoubtedly possess much more semantic knowledge. Therefore, how to effectively organize and exploit the abundant knowledge for KBQG becomes the focus of our study. In this work, we propose SGSH--a simple and effective framework to Stimulate GPT-3.5 with Skeleton Heuristics to enhance KBQG. The framework incorporates \"skeleton heuristics\", which provides more fine-grained guidance associated with each input to stimulate LLMs to generate optimal questions, encompassing essential elements like the question phrase and the auxiliary verb.More specifically, we devise a",
    "path": "papers/24/04/2404.01923.json",
    "total_tokens": 776,
    "translated_title": "SGSH：用骨架启发来激发大型语言模型进行知识库问题生成",
    "translated_abstract": "知识库问题生成（KBQG）旨在从从知识库中提取的三元组事实集生成自然语言问题。现有方法通过预训练语言模型（PLMs）显著提升了KBQG的性能，得益于丰富的语义知识。本文提出了SGSH--一个简单有效的框架，通过骨架启发来增强KBQG的性能。该框架包含“骨架启发”，提供了与每个输入相关的更精细的指导，以激发LLMs生成最佳问题，包括问题短语和助动词等关键要素。",
    "tldr": "本研究提出了SGSH框架，通过骨架启发来激发GPT-3.5生成知识库问题，有效地组织和利用丰富的语义知识。",
    "en_tdlr": "This study introduces SGSH framework to stimulate GPT-3.5 with skeleton heuristics for knowledge base question generation, effectively organizing and utilizing abundant semantic knowledge."
}