{
    "title": "Estimating Lexical Complexity from Document-Level Distributions",
    "abstract": "arXiv:2404.01196v1 Announce Type: new  Abstract: Existing methods for complexity estimation are typically developed for entire documents. This limitation in scope makes them inapplicable for shorter pieces of text, such as health assessment tools. These typically consist of lists of independent sentences, all of which are too short for existing methods to apply. The choice of wording in these assessment tools is crucial, as both the cognitive capacity and the linguistic competency of the intended patient groups could vary substantially. As a first step towards creating better tools for supporting health practitioners, we develop a two-step approach for estimating lexical complexity that does not rely on any pre-annotated data. We implement our approach for the Norwegian language and verify its effectiveness using statistical testing and a qualitative evaluation of samples from real assessment tools. We also investigate the relationship between our complexity measure and certain feature",
    "link": "https://arxiv.org/abs/2404.01196",
    "context": "Title: Estimating Lexical Complexity from Document-Level Distributions\nAbstract: arXiv:2404.01196v1 Announce Type: new  Abstract: Existing methods for complexity estimation are typically developed for entire documents. This limitation in scope makes them inapplicable for shorter pieces of text, such as health assessment tools. These typically consist of lists of independent sentences, all of which are too short for existing methods to apply. The choice of wording in these assessment tools is crucial, as both the cognitive capacity and the linguistic competency of the intended patient groups could vary substantially. As a first step towards creating better tools for supporting health practitioners, we develop a two-step approach for estimating lexical complexity that does not rely on any pre-annotated data. We implement our approach for the Norwegian language and verify its effectiveness using statistical testing and a qualitative evaluation of samples from real assessment tools. We also investigate the relationship between our complexity measure and certain feature",
    "path": "papers/24/04/2404.01196.json",
    "total_tokens": 836,
    "translated_title": "从文档级分布中估计词汇复杂度",
    "translated_abstract": "现有的复杂性估计方法通常是针对整个文档开发的。这种范围的限制使得它们无法应用于较短的文本片段，如健康评估工具。这些工具通常由独立句子的列表组成，这些句子都太短，以致于现有的方法无法应用。在这些评估工具中所选择的措辞至关重要，因为受访患者群体的认知能力和语言能力可能存在显著差异。为了为支持卫生从业者创建更好的工具，我们开发了一个不依赖于任何预注释数据的估计词汇复杂度的两步方法。我们实现了这个方法用于挪威语，并使用统计测试和对实际评估工具样本的定性评估验证了其有效性。我们还研究了我们的复杂度测量和某些特征之间的关系。",
    "tldr": "本研究提出了一个从文档级分布中估计词汇复杂度的两步方法，不依赖于任何预注释数据，用于支持健康从业者创建更好的工具。"
}