{
    "title": "Continual Learning for Smart City: A Survey",
    "abstract": "arXiv:2404.00983v1 Announce Type: cross  Abstract: With the digitization of modern cities, large data volumes and powerful computational resources facilitate the rapid update of intelligent models deployed in smart cities. Continual learning (CL) is a novel machine learning paradigm that constantly updates models to adapt to changing environments, where the learning tasks, data, and distributions can vary over time. Our survey provides a comprehensive review of continual learning methods that are widely used in smart city development. The content consists of three parts: 1) Methodology-wise. We categorize a large number of basic CL methods and advanced CL frameworks in combination with other learning paradigms including graph learning, spatial-temporal learning, multi-modal learning, and federated learning. 2) Application-wise. We present numerous CL applications covering transportation, environment, public health, safety, networks, and associated datasets related to urban computing. 3",
    "link": "https://arxiv.org/abs/2404.00983",
    "context": "Title: Continual Learning for Smart City: A Survey\nAbstract: arXiv:2404.00983v1 Announce Type: cross  Abstract: With the digitization of modern cities, large data volumes and powerful computational resources facilitate the rapid update of intelligent models deployed in smart cities. Continual learning (CL) is a novel machine learning paradigm that constantly updates models to adapt to changing environments, where the learning tasks, data, and distributions can vary over time. Our survey provides a comprehensive review of continual learning methods that are widely used in smart city development. The content consists of three parts: 1) Methodology-wise. We categorize a large number of basic CL methods and advanced CL frameworks in combination with other learning paradigms including graph learning, spatial-temporal learning, multi-modal learning, and federated learning. 2) Application-wise. We present numerous CL applications covering transportation, environment, public health, safety, networks, and associated datasets related to urban computing. 3",
    "path": "papers/24/04/2404.00983.json",
    "total_tokens": 801,
    "translated_title": "智慧城市的持续学习：一项调研",
    "translated_abstract": "随着现代城市数字化，庞大的数据量和强大的计算资源促使智慧城市中部署的智能模型迅速更新。持续学习（CL）是一种新颖的机器学习范式，不断更新模型以适应变化的环境，其中学习任务、数据和分布可以随时间变化。我们的调查全面审查了在智慧城市发展中广泛使用的持续学习方法。内容分为三个部分：1）方法论。我们将大量基本的CL方法和结合其他学习范例的高级CL框架进行分类，包括图学习、时空学习、多模态学习和联邦学习。2）应用方面。我们介绍了涵盖交通、环境、公共卫生、安全、网络以及与城市计算相关的相关数据集的众多CL应用。3）",
    "tldr": "该调研综合审查了智慧城市发展中广泛使用的持续学习方法，内容涵盖了方法论分类、多种应用领域和相关数据集。",
    "en_tdlr": "This survey comprehensively reviews continual learning methods widely used in smart city development, covering methodology classification, various application domains, and associated datasets."
}