{
    "title": "I-Design: Personalized LLM Interior Designer",
    "abstract": "arXiv:2404.02838v1 Announce Type: new  Abstract: Interior design allows us to be who we are and live how we want - each design is as unique as our distinct personality. However, it is not trivial for non-professionals to express and materialize this since it requires aligning functional and visual expectations with the constraints of physical space; this renders interior design a luxury. To make it more accessible, we present I-Design, a personalized interior designer that allows users to generate and visualize their design goals through natural language communication. I-Design starts with a team of large language model agents that engage in dialogues and logical reasoning with one another, transforming textual user input into feasible scene graph designs with relative object relationships. Subsequently, an effective placement algorithm determines optimal locations for each object within the scene. The final design is then constructed in 3D by retrieving and integrating assets from an ",
    "link": "https://arxiv.org/abs/2404.02838",
    "context": "Title: I-Design: Personalized LLM Interior Designer\nAbstract: arXiv:2404.02838v1 Announce Type: new  Abstract: Interior design allows us to be who we are and live how we want - each design is as unique as our distinct personality. However, it is not trivial for non-professionals to express and materialize this since it requires aligning functional and visual expectations with the constraints of physical space; this renders interior design a luxury. To make it more accessible, we present I-Design, a personalized interior designer that allows users to generate and visualize their design goals through natural language communication. I-Design starts with a team of large language model agents that engage in dialogues and logical reasoning with one another, transforming textual user input into feasible scene graph designs with relative object relationships. Subsequently, an effective placement algorithm determines optimal locations for each object within the scene. The final design is then constructed in 3D by retrieving and integrating assets from an ",
    "path": "papers/24/04/2404.02838.json",
    "total_tokens": 793,
    "translated_title": "I-Design: 个性化的LLM室内设计师",
    "translated_abstract": "室内设计让我们展示真实的自我，生活方式也由此展现——每个设计都如同我们各自独特的个性。然而，对于非专业人员来说，表达和实现这一点并不是件轻松的事，因为它要求将功能性和视觉期望与物理空间的限制相协调；这使得室内设计成为一种奢侈。为了让它更易于获得，我们提出了I-Design，一个个性化的室内设计师，允许用户通过自然语言交流生成和可视化他们的设计目标。I-Design从一个大型语言模型代理团队开始，他们通过对话和逻辑推理相互交互，将文本用户输入转换为具有相对对象关系的可行场景图设计。随后，一个有效的放置算法确定了场景内每个对象的最佳位置。最终设计会通过从一个",
    "tldr": "I-Design是一个个性化室内设计师，通过自然语言交流生成和可视化用户设计目标，从而使室内设计更具可访问性。",
    "en_tdlr": "I-Design is a personalized interior designer that allows users to generate and visualize their design goals through natural language communication, making interior design more accessible."
}