{
    "title": "DOCMASTER: A Unified Platform for Annotation, Training, & Inference in Document Question-Answering",
    "abstract": "arXiv:2404.00439v1 Announce Type: new  Abstract: The application of natural language processing models to PDF documents is pivotal for various business applications yet the challenge of training models for this purpose persists in businesses due to specific hurdles. These include the complexity of working with PDF formats that necessitate parsing text and layout information for curating training data and the lack of privacy-preserving annotation tools. This paper introduces DOCMASTER, a unified platform designed for annotating PDF documents, model training, and inference, tailored to document question-answering. The annotation interface enables users to input questions and highlight text spans within the PDF file as answers, saving layout information and text spans accordingly. Furthermore, DOCMASTER supports both state-of-the-art layout-aware and text models for comprehensive training purposes. Importantly, as annotations, training, and inference occur on-device, it also safeguards pr",
    "link": "https://arxiv.org/abs/2404.00439",
    "context": "Title: DOCMASTER: A Unified Platform for Annotation, Training, & Inference in Document Question-Answering\nAbstract: arXiv:2404.00439v1 Announce Type: new  Abstract: The application of natural language processing models to PDF documents is pivotal for various business applications yet the challenge of training models for this purpose persists in businesses due to specific hurdles. These include the complexity of working with PDF formats that necessitate parsing text and layout information for curating training data and the lack of privacy-preserving annotation tools. This paper introduces DOCMASTER, a unified platform designed for annotating PDF documents, model training, and inference, tailored to document question-answering. The annotation interface enables users to input questions and highlight text spans within the PDF file as answers, saving layout information and text spans accordingly. Furthermore, DOCMASTER supports both state-of-the-art layout-aware and text models for comprehensive training purposes. Importantly, as annotations, training, and inference occur on-device, it also safeguards pr",
    "path": "papers/24/04/2404.00439.json",
    "total_tokens": 831,
    "translated_title": "DOCMASTER: 一个统一的平台，用于文档问答中的注释、训练和推断",
    "translated_abstract": "将自然语言处理模型应用于PDF文档对于各种业务应用至关重要，但在企业中训练此类模型的挑战仍然存在。这些挑战包括使用PDF格式的复杂性，需要解析文本和布局信息以整理训练数据，以及缺乏保护隐私的注释工具。本文介绍了DOCMASTER，一个统一的平台，用于注释PDF文档、模型训练和推断，专为文档问答而设计。注释界面使用户能够输入问题并在PDF文件中突出显示文本段作为答案，同时保存布局信息和文本段。此外，DOCMASTER支持最先进的布局感知和文本模型，用于全面的训练目的。重要的是，由于注释、训练和推断在设备上进行，因此还保护了隐私。",
    "tldr": "DOCMASTER是一个统一平台，旨在为文档问答提供注释、训练和推断服务，支持用户在PDF文档中输入问题并突出显示文本段作为答案，同时保护隐私。",
    "en_tdlr": "DOCMASTER is a unified platform designed for annotation, training, and inference in document question-answering, enabling users to input questions, highlight text spans within PDF files as answers, and ensuring privacy protection."
}