{
    "title": "Graph-Based Optimisation of Network Expansion in a Dockless Bike Sharing System",
    "abstract": "arXiv:2404.01320v1 Announce Type: cross  Abstract: Bike-sharing systems (BSSs) are deployed in over a thousand cities worldwide and play an important role in many urban transportation systems. BSSs alleviate congestion, reduce pollution and promote physical exercise. It is essential to explore the spatiotemporal patterns of bike-sharing demand, as well as the factors that influence these patterns, in order to optimise system operational efficiency. In this study, an optimised geo-temporal graph is constructed using trip data from Moby Bikes, a dockless BSS operator. The process of optimising the graph unveiled prime locations for erecting new stations during future expansions of the BSS. The Louvain algorithm, a community detection technique, is employed to uncover usage patterns at different levels of temporal granularity. The community detection results reveal largely self-contained sub-networks that exhibit similar usage patterns at their respective levels of temporal granularity. O",
    "link": "https://arxiv.org/abs/2404.01320",
    "context": "Title: Graph-Based Optimisation of Network Expansion in a Dockless Bike Sharing System\nAbstract: arXiv:2404.01320v1 Announce Type: cross  Abstract: Bike-sharing systems (BSSs) are deployed in over a thousand cities worldwide and play an important role in many urban transportation systems. BSSs alleviate congestion, reduce pollution and promote physical exercise. It is essential to explore the spatiotemporal patterns of bike-sharing demand, as well as the factors that influence these patterns, in order to optimise system operational efficiency. In this study, an optimised geo-temporal graph is constructed using trip data from Moby Bikes, a dockless BSS operator. The process of optimising the graph unveiled prime locations for erecting new stations during future expansions of the BSS. The Louvain algorithm, a community detection technique, is employed to uncover usage patterns at different levels of temporal granularity. The community detection results reveal largely self-contained sub-networks that exhibit similar usage patterns at their respective levels of temporal granularity. O",
    "path": "papers/24/04/2404.01320.json",
    "total_tokens": 847,
    "translated_title": "基于图的无桩共享单车系统网络扩张优化",
    "translated_abstract": "自行车共享系统（BSSs）部署在全球一千多个城市，并在许多城市交通系统中发挥重要作用。BSSs缓解了拥堵，减少了污染并促进了体育锻炼。探索共享单车需求的时空模式以及影响这些模式的因素对于优化系统运营效率至关重要。本研究利用Moby Bikes的行程数据构建了一个优化的地理时间图。优化图的过程揭示了在将来扩展BSS时建立新站点的最佳位置。使用Louvain算法，一种社区检测技术，揭示了在不同时间粒度水平上的使用模式。社区检测结果揭示了在各自的时间粒度级别上表现出类似使用模式的主要自包含子网络。",
    "tldr": "本研究利用Moby Bikes的行程数据构建了一个优化的地理时间图，揭示了在扩展共享单车系统时建立新站点的最佳位置，并利用Louvain算法揭示了展现相似使用模式的自包含子网络。"
}