{
    "title": "Explainable AI Integrated Feature Engineering for Wildfire Prediction",
    "abstract": "arXiv:2404.01487v1 Announce Type: new  Abstract: Wildfires present intricate challenges for prediction, necessitating the use of sophisticated machine learning techniques for effective modeling\\cite{jain2020review}. In our research, we conducted a thorough assessment of various machine learning algorithms for both classification and regression tasks relevant to predicting wildfires. We found that for classifying different types or stages of wildfires, the XGBoost model outperformed others in terms of accuracy and robustness. Meanwhile, the Random Forest regression model showed superior results in predicting the extent of wildfire-affected areas, excelling in both prediction error and explained variance. Additionally, we developed a hybrid neural network model that integrates numerical data and image information for simultaneous classification and regression. To gain deeper insights into the decision-making processes of these models and identify key contributing features, we utilized eX",
    "link": "https://arxiv.org/abs/2404.01487",
    "context": "Title: Explainable AI Integrated Feature Engineering for Wildfire Prediction\nAbstract: arXiv:2404.01487v1 Announce Type: new  Abstract: Wildfires present intricate challenges for prediction, necessitating the use of sophisticated machine learning techniques for effective modeling\\cite{jain2020review}. In our research, we conducted a thorough assessment of various machine learning algorithms for both classification and regression tasks relevant to predicting wildfires. We found that for classifying different types or stages of wildfires, the XGBoost model outperformed others in terms of accuracy and robustness. Meanwhile, the Random Forest regression model showed superior results in predicting the extent of wildfire-affected areas, excelling in both prediction error and explained variance. Additionally, we developed a hybrid neural network model that integrates numerical data and image information for simultaneous classification and regression. To gain deeper insights into the decision-making processes of these models and identify key contributing features, we utilized eX",
    "path": "papers/24/04/2404.01487.json",
    "total_tokens": 894,
    "translated_title": "可解释人工智能集成特征工程用于森林火灾预测",
    "translated_abstract": "森林火灾对预测提出了复杂的挑战，需要使用复杂的机器学习技术进行有效建模。在我们的研究中，我们对与预测森林火灾相关的分类和回归任务的各种机器学习算法进行了彻底评估。我们发现，对于分类不同类型或阶段的森林火灾，XGBoost模型在准确性和稳健性方面表现优异。与此同时，随机森林回归模型在预测受影响的森林火灾范围方面表现出色，同时在预测误差和解释方差方面都表现优秀。此外，我们开发了一种集成数值数据和图像信息的混合神经网络模型，用于同时进行分类和回归。为了更深入地了解这些模型的决策过程并识别关键的贡献特征，我们利用eX",
    "tldr": "本研究通过评估各种机器学习算法，发现XGBoost模型在森林火灾分类中具有更好的准确性和随机森林回归模型在预测火灾范围方面表现出色。同时，我们还开发了一种集成数值数据和图像信息的混合神经网络模型。",
    "en_tdlr": "This research evaluates various machine learning algorithms and finds that the XGBoost model outperforms in wildfire classification and the Random Forest regression model excels in predicting wildfire extent. Additionally, a hybrid neural network model integrating numerical data and image information is developed."
}