{
    "title": "The impact of geopolitical risk on the international agricultural market: Empirical analysis based on the GJR-GARCH-MIDAS model",
    "abstract": "arXiv:2404.01641v1 Announce Type: new  Abstract: The current international landscape is turbulent and unstable, with frequent outbreaks of geopolitical conflicts worldwide. Geopolitical risk has emerged as a significant threat to regional and global peace, stability, and economic prosperity, causing serious disruptions to the global food system and food security. Focusing on the international food market, this paper builds different dimensions of geopolitical risk measures based on the random matrix theory and constructs single- and two-factor GJR-GARCH-MIDAS models with fixed time span and rolling window, respectively, to investigate the impact of geopolitical risk on food market volatility. The findings indicate that modeling based on rolling window performs better in describing the overall volatility of the wheat, maize, soybean, and rice markets, and the two-factor models generally exhibit stronger explanatory power in most cases. In terms of short-term fluctuations, all four stapl",
    "link": "https://arxiv.org/abs/2404.01641",
    "context": "Title: The impact of geopolitical risk on the international agricultural market: Empirical analysis based on the GJR-GARCH-MIDAS model\nAbstract: arXiv:2404.01641v1 Announce Type: new  Abstract: The current international landscape is turbulent and unstable, with frequent outbreaks of geopolitical conflicts worldwide. Geopolitical risk has emerged as a significant threat to regional and global peace, stability, and economic prosperity, causing serious disruptions to the global food system and food security. Focusing on the international food market, this paper builds different dimensions of geopolitical risk measures based on the random matrix theory and constructs single- and two-factor GJR-GARCH-MIDAS models with fixed time span and rolling window, respectively, to investigate the impact of geopolitical risk on food market volatility. The findings indicate that modeling based on rolling window performs better in describing the overall volatility of the wheat, maize, soybean, and rice markets, and the two-factor models generally exhibit stronger explanatory power in most cases. In terms of short-term fluctuations, all four stapl",
    "path": "papers/24/04/2404.01641.json",
    "total_tokens": 932,
    "translated_title": "地缘政治风险对国际农产品市场的影响：基于GJR-GARCH-MIDAS模型的实证分析",
    "translated_abstract": "当前国际局势动荡不安，全球范围内地缘冲突频发。地缘政治风险已成为区域和全球和平、稳定和经济繁荣的重大威胁，严重扰乱全球食品体系和粮食安全。本文以国际食品市场为重点，基于随机矩阵理论构建了不同维度的地缘政治风险度量，并分别使用固定时间跨度和滚动窗口构建了单因子和双因子GJR-GARCH-MIDAS模型，以研究地缘政治风险对食品市场波动的影响。研究结果表明，基于滚动窗口的建模在描述小麦、玉米、大豆和稻米市场的总体波动方面表现更好，而双因子模型在大多数情况下展现出更强的解释能力。在短期波动方面，所有四种主要农产品市场均表现出了类似的减少趋势（摘要内容截断）。",
    "tldr": "本研究使用GJR-GARCH-MIDAS模型探讨了地缘政治风险对国际食品市场波动的影响，并发现双因子模型在大多数情况下具有更强的解释力。"
}