{
    "title": "PejorativITy: Disambiguating Pejorative Epithets to Improve Misogyny Detection in Italian Tweets",
    "abstract": "arXiv:2404.02681v1 Announce Type: cross  Abstract: Misogyny is often expressed through figurative language. Some neutral words can assume a negative connotation when functioning as pejorative epithets. Disambiguating the meaning of such terms might help the detection of misogyny. In order to address such task, we present PejorativITy, a novel corpus of 1,200 manually annotated Italian tweets for pejorative language at the word level and misogyny at the sentence level. We evaluate the impact of injecting information about disambiguated words into a model targeting misogyny detection. In particular, we explore two different approaches for injection: concatenation of pejorative information and substitution of ambiguous words with univocal terms. Our experimental results, both on our corpus and on two popular benchmarks on Italian tweets, show that both approaches lead to a major classification improvement, indicating that word sense disambiguation is a promising preliminary step for misog",
    "link": "https://arxiv.org/abs/2404.02681",
    "context": "Title: PejorativITy: Disambiguating Pejorative Epithets to Improve Misogyny Detection in Italian Tweets\nAbstract: arXiv:2404.02681v1 Announce Type: cross  Abstract: Misogyny is often expressed through figurative language. Some neutral words can assume a negative connotation when functioning as pejorative epithets. Disambiguating the meaning of such terms might help the detection of misogyny. In order to address such task, we present PejorativITy, a novel corpus of 1,200 manually annotated Italian tweets for pejorative language at the word level and misogyny at the sentence level. We evaluate the impact of injecting information about disambiguated words into a model targeting misogyny detection. In particular, we explore two different approaches for injection: concatenation of pejorative information and substitution of ambiguous words with univocal terms. Our experimental results, both on our corpus and on two popular benchmarks on Italian tweets, show that both approaches lead to a major classification improvement, indicating that word sense disambiguation is a promising preliminary step for misog",
    "path": "papers/24/04/2404.02681.json",
    "total_tokens": 930,
    "translated_title": "PejorativITy：消除蔑称词以改善意大利推文中的厌恶检测",
    "translated_abstract": "厌恶往往通过比喻语言表达。当一些中性词语作为贬损称谓时，可能会呈现负面含义。澄清这类词语的含义可能有助于检测厌恶。为解决这一任务，我们提出了PejorativITy，这是一个新颖的由1,200条意大利推文构成的语料库，用于在单词级别上标注贬损语言，并在句子级别上标注厌恶。我们评估了将澄清词语信息注入针对厌恶检测模型的影响。具体地，我们探讨了两种不同的注入方法：将贬损信息连接在一起和将模棱两可的词语替换为明确的术语。我们的实验结果，无论是在我们的语料库上还是在意大利推文的两个流行基准上，都表明这两种方法均导致更大的分类改善，表明词义消歧是厌恶检测的有前景的初步步骤。",
    "tldr": "通过澄清词语含义来改善厌恶检测，PejorativITy提出了一个新的意大利推文语料库，揭示了将贬损信息注入模型的两种方法均能显著提高分类性能。",
    "en_tdlr": "By disambiguating the meanings of words to enhance misogyny detection, PejorativITy introduces a novel Italian tweet corpus and demonstrates that injecting pejorative information into models through two approaches significantly improves classification performance."
}