{
    "title": "One Noise to Rule Them All: Multi-View Adversarial Attacks with Universal Perturbation",
    "abstract": "arXiv:2404.02287v1 Announce Type: cross  Abstract: This paper presents a novel universal perturbation method for generating robust multi-view adversarial examples in 3D object recognition. Unlike conventional attacks limited to single views, our approach operates on multiple 2D images, offering a practical and scalable solution for enhancing model scalability and robustness. This generalizable method bridges the gap between 2D perturbations and 3D-like attack capabilities, making it suitable for real-world applications.   Existing adversarial attacks may become ineffective when images undergo transformations like changes in lighting, camera position, or natural deformations. We address this challenge by crafting a single universal noise perturbation applicable to various object views. Experiments on diverse rendered 3D objects demonstrate the effectiveness of our approach. The universal perturbation successfully identified a single adversarial noise for each given set of 3D object rend",
    "link": "https://arxiv.org/abs/2404.02287",
    "context": "Title: One Noise to Rule Them All: Multi-View Adversarial Attacks with Universal Perturbation\nAbstract: arXiv:2404.02287v1 Announce Type: cross  Abstract: This paper presents a novel universal perturbation method for generating robust multi-view adversarial examples in 3D object recognition. Unlike conventional attacks limited to single views, our approach operates on multiple 2D images, offering a practical and scalable solution for enhancing model scalability and robustness. This generalizable method bridges the gap between 2D perturbations and 3D-like attack capabilities, making it suitable for real-world applications.   Existing adversarial attacks may become ineffective when images undergo transformations like changes in lighting, camera position, or natural deformations. We address this challenge by crafting a single universal noise perturbation applicable to various object views. Experiments on diverse rendered 3D objects demonstrate the effectiveness of our approach. The universal perturbation successfully identified a single adversarial noise for each given set of 3D object rend",
    "path": "papers/24/04/2404.02287.json",
    "total_tokens": 731,
    "translated_title": "一种噪声统治所有：多视角带普遍扰动的对抗攻击",
    "translated_abstract": "本文提出了一种新颖的通用扰动方法，用于生成3D物体识别中的多视角对抗样本。与限制在单个视图上的传统攻击不同，我们的方法操作于多个2D图像，为增强模型的可扩展性和鲁棒性提供了实用且可扩展的解决方案。这种通用方法将2D扰动与类似3D的攻击能力联系起来，使其适用于实际应用。",
    "tldr": "这种通用扰动方法架起了2D扰动与类似3D攻击能力之间的桥梁，为生成3D物体识别中的多视角对抗样本提供了实用且可扩展的解决方案。",
    "en_tdlr": "This universal perturbation method bridges the gap between 2D perturbations and 3D-like attack capabilities, offering a practical and scalable solution for generating robust multi-view adversarial examples in 3D object recognition."
}