{
    "title": "Collaboratively adding context to social media posts reduces the sharing of false news",
    "abstract": "arXiv:2404.02803v1 Announce Type: new  Abstract: We build a novel database of around 285,000 notes from the Twitter Community Notes program to analyze the causal influence of appending contextual information to potentially misleading posts on their dissemination. Employing a difference in difference design, our findings reveal that adding context below a tweet reduces the number of retweets by almost half. A significant, albeit smaller, effect is observed when focusing on the number of replies or quotes. Community Notes also increase by 80% the probability that a tweet is deleted by its creator. The post-treatment impact is substantial, but the overall effect on tweet virality is contingent upon the timing of the contextual information's publication. Our research concludes that, although crowdsourced fact-checking is effective, its current speed may not be adequate to substantially reduce the dissemination of misleading information on social media.",
    "link": "https://arxiv.org/abs/2404.02803",
    "context": "Title: Collaboratively adding context to social media posts reduces the sharing of false news\nAbstract: arXiv:2404.02803v1 Announce Type: new  Abstract: We build a novel database of around 285,000 notes from the Twitter Community Notes program to analyze the causal influence of appending contextual information to potentially misleading posts on their dissemination. Employing a difference in difference design, our findings reveal that adding context below a tweet reduces the number of retweets by almost half. A significant, albeit smaller, effect is observed when focusing on the number of replies or quotes. Community Notes also increase by 80% the probability that a tweet is deleted by its creator. The post-treatment impact is substantial, but the overall effect on tweet virality is contingent upon the timing of the contextual information's publication. Our research concludes that, although crowdsourced fact-checking is effective, its current speed may not be adequate to substantially reduce the dissemination of misleading information on social media.",
    "path": "papers/24/04/2404.02803.json",
    "total_tokens": 781,
    "translated_title": "在社交媒体帖子中协作添加背景信息可以减少虚假新闻的传播",
    "translated_abstract": "我们建立了一个包含约285,000个来自Twitter社区笔记计划的笔记的新数据库，以分析在潜在误导性帖子上附加背景信息对它们传播的因果影响。采用区别于设计，我们的发现表明在一条推文下添加背景信息会将转发数减少近一半。当关注回复或引用的数量时，也观察到了一个显著且较小的效果。社区笔记还增加了推文被其创建者删除的概率80%。后续影响很大，但对推文病毒传播的整体影响取决于背景信息发布的时机。我们的研究得出结论，尽管众包事实核查是有效的，但其当前速度可能不足以根本减少社交媒体上误导信息的传播。",
    "tldr": "协作添加背景信息可大幅减少社交媒体虚假新闻传播，但速度也很重要。",
    "en_tdlr": "Collaboratively adding context can significantly reduce the spread of false news on social media, but speed is crucial."
}