{
    "title": "Explainable Multi-hop Question Generation: An End-to-End Approach without Intermediate Question Labeling",
    "abstract": "arXiv:2404.00571v1 Announce Type: new  Abstract: In response to the increasing use of interactive artificial intelligence, the demand for the capacity to handle complex questions has increased. Multi-hop question generation aims to generate complex questions that requires multi-step reasoning over several documents. Previous studies have predominantly utilized end-to-end models, wherein questions are decoded based on the representation of context documents. However, these approaches lack the ability to explain the reasoning process behind the generated multi-hop questions. Additionally, the question rewriting approach, which incrementally increases the question complexity, also has limitations due to the requirement of labeling data for intermediate-stage questions. In this paper, we introduce an end-to-end question rewriting model that increases question complexity through sequential rewriting. The proposed model has the advantage of training with only the final multi-hop questions, w",
    "link": "https://arxiv.org/abs/2404.00571",
    "context": "Title: Explainable Multi-hop Question Generation: An End-to-End Approach without Intermediate Question Labeling\nAbstract: arXiv:2404.00571v1 Announce Type: new  Abstract: In response to the increasing use of interactive artificial intelligence, the demand for the capacity to handle complex questions has increased. Multi-hop question generation aims to generate complex questions that requires multi-step reasoning over several documents. Previous studies have predominantly utilized end-to-end models, wherein questions are decoded based on the representation of context documents. However, these approaches lack the ability to explain the reasoning process behind the generated multi-hop questions. Additionally, the question rewriting approach, which incrementally increases the question complexity, also has limitations due to the requirement of labeling data for intermediate-stage questions. In this paper, we introduce an end-to-end question rewriting model that increases question complexity through sequential rewriting. The proposed model has the advantage of training with only the final multi-hop questions, w",
    "path": "papers/24/04/2404.00571.json",
    "total_tokens": 757,
    "translated_title": "可解释的多跳问题生成：一种无需中间问题标记的端到端方法",
    "translated_abstract": "随着交互式人工智能的增加使用，处理复杂问题的需求也在增加。多跳问题生成旨在生成需要在多个文档上进行多步推理的复杂问题。先前的研究主要采用端到端模型，其中问题是基于上下文文档的表示进行解码的。然而，这些方法缺乏解释生成的多跳问题背后的推理过程的能力。此外，问题重写方法，逐步增加问题的复杂性，也由于需要为中间阶段问题标记数据而存在局限性。在本文中，我们引入一种端到端问题重写模型，通过顺序重写增加问题复杂性。所提出的模型具有仅训练最终的多跳问题的优势。",
    "tldr": "提出了一种端到端问题重写模型，通过顺序重写增加问题复杂性，能够无需中间问题标记训练生成解释性强的多跳问题。"
}