{
    "title": "EEG-SVRec: An EEG Dataset with User Multidimensional Affective Engagement Labels in Short Video Recommendation",
    "abstract": "arXiv:2404.01008v1 Announce Type: new  Abstract: In recent years, short video platforms have gained widespread popularity, making the quality of video recommendations crucial for retaining users. Existing recommendation systems primarily rely on behavioral data, which faces limitations when inferring user preferences due to issues such as data sparsity and noise from accidental interactions or personal habits. To address these challenges and provide a more comprehensive understanding of user affective experience and cognitive activity, we propose EEG-SVRec, the first EEG dataset with User Multidimensional Affective Engagement Labels in Short Video Recommendation. The study involves 30 participants and collects 3,657 interactions, offering a rich dataset that can be used for a deeper exploration of user preference and cognitive activity. By incorporating selfassessment techniques and real-time, low-cost EEG signals, we offer a more detailed understanding user affective experiences (vale",
    "link": "https://arxiv.org/abs/2404.01008",
    "context": "Title: EEG-SVRec: An EEG Dataset with User Multidimensional Affective Engagement Labels in Short Video Recommendation\nAbstract: arXiv:2404.01008v1 Announce Type: new  Abstract: In recent years, short video platforms have gained widespread popularity, making the quality of video recommendations crucial for retaining users. Existing recommendation systems primarily rely on behavioral data, which faces limitations when inferring user preferences due to issues such as data sparsity and noise from accidental interactions or personal habits. To address these challenges and provide a more comprehensive understanding of user affective experience and cognitive activity, we propose EEG-SVRec, the first EEG dataset with User Multidimensional Affective Engagement Labels in Short Video Recommendation. The study involves 30 participants and collects 3,657 interactions, offering a rich dataset that can be used for a deeper exploration of user preference and cognitive activity. By incorporating selfassessment techniques and real-time, low-cost EEG signals, we offer a more detailed understanding user affective experiences (vale",
    "path": "papers/24/04/2404.01008.json",
    "total_tokens": 861,
    "translated_title": "EEG-SVRec：一份带有用户多维情感参与标签的脑电图数据集在短视频推荐中的应用",
    "translated_abstract": "近年来，短视频平台广受欢迎，使得视频推荐的质量对于留住用户至关重要。现有的推荐系统主要依赖于行为数据，但在推断用户喜好方面面临限制，因为存在数据稀疏问题以及来自意外交互或个人习惯的干扰噪音。为了解决这些挑战，提供对用户情感体验和认知活动更全面的理解，我们提出了EEG-SVRec，这是第一个带有用户多维情感参与标签的脑电图数据集在短视频推荐中的应用。该研究涉及30名参与者，收集了3,657次互动，提供了一个丰富的数据集，可用于更深入地探索用户喜好和认知活动。通过结合自我评估技术和实时、低成本的脑电图信号，我们提供了对用户情感体验更详细的理解。",
    "tldr": "EEG-SVRec是第一个在短视频推荐中带有用户多维情感参与标签的脑电图数据集，可以更全面地理解用户情感经验和认知活动。"
}