{
    "title": "Event Detection from Social Media for Epidemic Prediction",
    "abstract": "arXiv:2404.01679v1 Announce Type: new  Abstract: Social media is an easy-to-access platform providing timely updates about societal trends and events. Discussions regarding epidemic-related events such as infections, symptoms, and social interactions can be crucial for informing policymaking during epidemic outbreaks. In our work, we pioneer exploiting Event Detection (ED) for better preparedness and early warnings of any upcoming epidemic by developing a framework to extract and analyze epidemic-related events from social media posts. To this end, we curate an epidemic event ontology comprising seven disease-agnostic event types and construct a Twitter dataset SPEED with human-annotated events focused on the COVID-19 pandemic. Experimentation reveals how ED models trained on COVID-based SPEED can effectively detect epidemic events for three unseen epidemics of Monkeypox, Zika, and Dengue; while models trained on existing ED datasets fail miserably. Furthermore, we show that reporting ",
    "link": "https://arxiv.org/abs/2404.01679",
    "context": "Title: Event Detection from Social Media for Epidemic Prediction\nAbstract: arXiv:2404.01679v1 Announce Type: new  Abstract: Social media is an easy-to-access platform providing timely updates about societal trends and events. Discussions regarding epidemic-related events such as infections, symptoms, and social interactions can be crucial for informing policymaking during epidemic outbreaks. In our work, we pioneer exploiting Event Detection (ED) for better preparedness and early warnings of any upcoming epidemic by developing a framework to extract and analyze epidemic-related events from social media posts. To this end, we curate an epidemic event ontology comprising seven disease-agnostic event types and construct a Twitter dataset SPEED with human-annotated events focused on the COVID-19 pandemic. Experimentation reveals how ED models trained on COVID-based SPEED can effectively detect epidemic events for three unseen epidemics of Monkeypox, Zika, and Dengue; while models trained on existing ED datasets fail miserably. Furthermore, we show that reporting ",
    "path": "papers/24/04/2404.01679.json",
    "total_tokens": 919,
    "translated_title": "社交媒体上的事件检测用于疫情预测",
    "translated_abstract": "社交媒体是一个易于访问的平台，提供有关社会趋势和事件的及时更新。关于流行病相关事件的讨论，如感染、症状和社会互动，对于在流行病爆发期间制定政策至关重要。在我们的工作中，我们开创利用事件检测（ED）来更好地准备和提前预警任何即将到来的流行病，通过开发一个框架从社交媒体帖子中提取和分析与流行病相关的事件。为此，我们策划了一个包括七种与疾病无关的事件类型的流行病事件本体论，并构建了一个名为SPEED的Twitter数据集，其中包含人工注释的重点关注COVID-19流行病的事件。实验揭示了在COVID速度上训练的ED模型如何有效地检测出关于三种未见流行病（猴痘、寨卡病毒和登革热）的流行病事件；而在现有ED数据集上训练的模型则表现不佳。此外，我们展示了报道",
    "tldr": "通过开发一个从社交媒体帖子中提取和分析流行病相关事件的框架，该研究首次利用事件检测技术在COVID-19流行病和其他未见流行病中实现有效的早期预警。",
    "en_tdlr": "This research pioneers the use of Event Detection technology to effectively provide early warnings for COVID-19 and other unseen epidemics by developing a framework to extract and analyze epidemic-related events from social media posts."
}