{
    "title": "A (More) Realistic Evaluation Setup for Generalisation of Community Models on Malicious Content Detection",
    "abstract": "arXiv:2404.01822v1 Announce Type: cross  Abstract: Community models for malicious content detection, which take into account the context from a social graph alongside the content itself, have shown remarkable performance on benchmark datasets. Yet, misinformation and hate speech continue to propagate on social media networks. This mismatch can be partially attributed to the limitations of current evaluation setups that neglect the rapid evolution of online content and the underlying social graph. In this paper, we propose a novel evaluation setup for model generalisation based on our few-shot subgraph sampling approach. This setup tests for generalisation through few labelled examples in local explorations of a larger graph, emulating more realistic application settings. We show this to be a challenging inductive setup, wherein strong performance on the training graph is not indicative of performance on unseen tasks, domains, or graph structures. Lastly, we show that graph meta-learner",
    "link": "https://arxiv.org/abs/2404.01822",
    "context": "Title: A (More) Realistic Evaluation Setup for Generalisation of Community Models on Malicious Content Detection\nAbstract: arXiv:2404.01822v1 Announce Type: cross  Abstract: Community models for malicious content detection, which take into account the context from a social graph alongside the content itself, have shown remarkable performance on benchmark datasets. Yet, misinformation and hate speech continue to propagate on social media networks. This mismatch can be partially attributed to the limitations of current evaluation setups that neglect the rapid evolution of online content and the underlying social graph. In this paper, we propose a novel evaluation setup for model generalisation based on our few-shot subgraph sampling approach. This setup tests for generalisation through few labelled examples in local explorations of a larger graph, emulating more realistic application settings. We show this to be a challenging inductive setup, wherein strong performance on the training graph is not indicative of performance on unseen tasks, domains, or graph structures. Lastly, we show that graph meta-learner",
    "path": "papers/24/04/2404.01822.json",
    "total_tokens": 686,
    "translated_title": "面向恶意内容检测社区模型泛化的更为现实的评估设置",
    "translated_abstract": "用于恶意内容检测的社区模型考虑社交图中的上下文以及内容本身，在基准数据集上表现出色。然而，虚假信息和仇恨言论仍在社交媒体网络上传播。本文提出了基于我们的少样本子图采样方法的模型泛化的新型评估设置。这个设置通过在更大图的局部探索中少量标记示例，模拟更为现实的应用场景，以测试泛化能力。",
    "tldr": "提出了面向恶意内容检测社区模型泛化的更为现实的评估设置，通过少样本子图采样方法测试模型泛化能力。",
    "en_tdlr": "Proposed a more realistic evaluation setup for generalisation of community models on malicious content detection, testing model generalisation through few-shot subgraph sampling approach."
}