{
    "title": "Creating synthetic energy meter data using conditional diffusion and building metadata",
    "abstract": "arXiv:2404.00525v1 Announce Type: new  Abstract: Advances in machine learning and increased computational power have driven progress in energy-related research. However, limited access to private energy data from buildings hinders traditional regression models relying on historical data. While generative models offer a solution, previous studies have primarily focused on short-term generation periods (e.g., daily profiles) and a limited number of meters. Thus, the study proposes a conditional diffusion model for generating high-quality synthetic energy data using relevant metadata. Using a dataset comprising 1,828 power meters from various buildings and countries, this model is compared with traditional methods like Conditional Generative Adversarial Networks (CGAN) and Conditional Variational Auto-Encoders (CVAE). It explicitly handles long-term annual consumption profiles, harnessing metadata such as location, weather, building, and meter type to produce coherent synthetic data that ",
    "link": "https://arxiv.org/abs/2404.00525",
    "context": "Title: Creating synthetic energy meter data using conditional diffusion and building metadata\nAbstract: arXiv:2404.00525v1 Announce Type: new  Abstract: Advances in machine learning and increased computational power have driven progress in energy-related research. However, limited access to private energy data from buildings hinders traditional regression models relying on historical data. While generative models offer a solution, previous studies have primarily focused on short-term generation periods (e.g., daily profiles) and a limited number of meters. Thus, the study proposes a conditional diffusion model for generating high-quality synthetic energy data using relevant metadata. Using a dataset comprising 1,828 power meters from various buildings and countries, this model is compared with traditional methods like Conditional Generative Adversarial Networks (CGAN) and Conditional Variational Auto-Encoders (CVAE). It explicitly handles long-term annual consumption profiles, harnessing metadata such as location, weather, building, and meter type to produce coherent synthetic data that ",
    "path": "papers/24/04/2404.00525.json",
    "total_tokens": 816,
    "translated_title": "使用条件扩散和建筑元数据创建合成能源表数据",
    "translated_abstract": "机器学习的进步和计算能力的增强推动了能源相关研究的进展。然而，对来自建筑物的私人能源数据的有限访问限制了依赖于历史数据的传统回归模型。尽管生成模型提供了一种解决方案，但先前的研究主要集中在短期生成周期（例如，日常配置文件）和有限数量的表计上。因此，该研究提出了一种使用相关元数据生成高质量合成能源数据的条件扩散模型。使用包含来自不同建筑物和国家的1,828个功率表的数据集，将该模型与传统方法（如条件生成对抗网络（CGAN）和条件变分自动编码器（CVAE））进行了比较。它明确处理长期年度消费配置文件，利用位置、天气、建筑物和表类型等元数据产生连贯的合成数据。",
    "tldr": "该研究提出了一种使用条件扩散模型生成高质量合成能源数据的方法，能够处理长期年度消费配置文件并利用元数据产生连贯的数据",
    "en_tdlr": "The study introduces a method of generating high-quality synthetic energy data using a conditional diffusion model, which can handle long-term annual consumption profiles and utilize metadata to produce coherent data."
}