{
    "title": "Enhancing Functional Safety in Automotive AMS Circuits through Unsupervised Machine Learning",
    "abstract": "arXiv:2404.01632v1 Announce Type: new  Abstract: Given the widespread use of safety-critical applications in the automotive field, it is crucial to ensure the Functional Safety (FuSa) of circuits and components within automotive systems. The Analog and Mixed-Signal (AMS) circuits prevalent in these systems are more vulnerable to faults induced by parametric perturbations, noise, environmental stress, and other factors, in comparison to their digital counterparts. However, their continuous signal characteristics present an opportunity for early anomaly detection, enabling the implementation of safety mechanisms to prevent system failure. To address this need, we propose a novel framework based on unsupervised machine learning for early anomaly detection in AMS circuits. The proposed approach involves injecting anomalies at various circuit locations and individual components to create a diverse and comprehensive anomaly dataset, followed by the extraction of features from the observed ci",
    "link": "https://arxiv.org/abs/2404.01632",
    "context": "Title: Enhancing Functional Safety in Automotive AMS Circuits through Unsupervised Machine Learning\nAbstract: arXiv:2404.01632v1 Announce Type: new  Abstract: Given the widespread use of safety-critical applications in the automotive field, it is crucial to ensure the Functional Safety (FuSa) of circuits and components within automotive systems. The Analog and Mixed-Signal (AMS) circuits prevalent in these systems are more vulnerable to faults induced by parametric perturbations, noise, environmental stress, and other factors, in comparison to their digital counterparts. However, their continuous signal characteristics present an opportunity for early anomaly detection, enabling the implementation of safety mechanisms to prevent system failure. To address this need, we propose a novel framework based on unsupervised machine learning for early anomaly detection in AMS circuits. The proposed approach involves injecting anomalies at various circuit locations and individual components to create a diverse and comprehensive anomaly dataset, followed by the extraction of features from the observed ci",
    "path": "papers/24/04/2404.01632.json",
    "total_tokens": 780,
    "translated_title": "通过无监督机器学习增强汽车AMS电路的功能安全性",
    "translated_abstract": "鉴于在汽车领域广泛使用安全关键应用程序，确保汽车系统内的电路和组件的功能安全（FuSa）至关重要。这些系统中普遍存在的模拟和混合信号（AMS）电路比它们的数字对应物更容易受到由参数扰动、噪声、环境压力和其他因素引起的故障影响。然而，它们的连续信号特性为早期异常检测提供了机会，从而实现了实施安全机制以防止系统故障。为了满足这种需求，我们提出了一种基于无监督机器学习的新型框架，用于AMS电路的早期异常检测。所提出的方法涉及在各种电路位置和单独组件注入异常，以创建多样化和全面的异常数据集，然后从观察到的电路中提取特征。",
    "tldr": "通过无监督机器学习实现早期异常检测，以增强汽车AMS电路的功能安全性"
}