{
    "title": "SCANNER: Knowledge-Enhanced Approach for Robust Multi-modal Named Entity Recognition of Unseen Entities",
    "abstract": "arXiv:2404.01914v1 Announce Type: cross  Abstract: Recent advances in named entity recognition (NER) have pushed the boundary of the task to incorporate visual signals, leading to many variants, including multi-modal NER (MNER) or grounded MNER (GMNER). A key challenge to these tasks is that the model should be able to generalize to the entities unseen during the training, and should be able to handle the training samples with noisy annotations. To address this obstacle, we propose SCANNER (Span CANdidate detection and recognition for NER), a model capable of effectively handling all three NER variants. SCANNER is a two-stage structure; we extract entity candidates in the first stage and use it as a query to get knowledge, effectively pulling knowledge from various sources. We can boost our performance by utilizing this entity-centric extracted knowledge to address unseen entities. Furthermore, to tackle the challenges arising from noisy annotations in NER datasets, we introduce a nove",
    "link": "https://arxiv.org/abs/2404.01914",
    "context": "Title: SCANNER: Knowledge-Enhanced Approach for Robust Multi-modal Named Entity Recognition of Unseen Entities\nAbstract: arXiv:2404.01914v1 Announce Type: cross  Abstract: Recent advances in named entity recognition (NER) have pushed the boundary of the task to incorporate visual signals, leading to many variants, including multi-modal NER (MNER) or grounded MNER (GMNER). A key challenge to these tasks is that the model should be able to generalize to the entities unseen during the training, and should be able to handle the training samples with noisy annotations. To address this obstacle, we propose SCANNER (Span CANdidate detection and recognition for NER), a model capable of effectively handling all three NER variants. SCANNER is a two-stage structure; we extract entity candidates in the first stage and use it as a query to get knowledge, effectively pulling knowledge from various sources. We can boost our performance by utilizing this entity-centric extracted knowledge to address unseen entities. Furthermore, to tackle the challenges arising from noisy annotations in NER datasets, we introduce a nove",
    "path": "papers/24/04/2404.01914.json",
    "total_tokens": 913,
    "translated_title": "SCANNER：用于强大的多模式具名实体识别的知识增强方法",
    "translated_abstract": "最近具名实体识别(NER)的进展推动了该任务的边界，将视觉信号纳入其中，导致许多变体，包括多模式NER（MNER）或基于实体的MNER（GMNER）。 这些任务的一个关键挑战是模型应能够推广到训练过程中未见的实体，并能够处理训练样本中带有噪声注释的情况。 为了解决这一障碍，我们提出了SCANNER（用于NER的SpAN CANdidate检测和识别），这是一种能够有效处理所有三种NER变体的模型。 SCANNER是一个两阶段结构；我们在第一阶段提取实体候选，并将其用作查询以获取知识，有效地从各种来源中提取知识。 我们可以通过利用这种以实体为中心的提取知识来提高性能，以解决未见实体。 此外，为了应对NER数据集中由嘈杂注释引起的挑战，我们还介绍了一种新颖的方法。",
    "tldr": "提出了SCANNER模型，通过提取实体候选并利用知识从多种来源获取知识，增强了对未见实体的识别能力，并引入了一种新颖的方法来处理NER数据集中带有噪声注释的挑战。",
    "en_tdlr": "Introduced the SCANNER model, which enhances the recognition of unseen entities by extracting entity candidates, utilizing knowledge from various sources, and introduces a novel approach to address the challenge of noisy annotations in NER datasets."
}