{
    "title": "Clustering for Protein Representation Learning",
    "abstract": "arXiv:2404.00254v1 Announce Type: new  Abstract: Protein representation learning is a challenging task that aims to capture the structure and function of proteins from their amino acid sequences. Previous methods largely ignored the fact that not all amino acids are equally important for protein folding and activity. In this article, we propose a neural clustering framework that can automatically discover the critical components of a protein by considering both its primary and tertiary structure information. Our framework treats a protein as a graph, where each node represents an amino acid and each edge represents a spatial or sequential connection between amino acids. We then apply an iterative clustering strategy to group the nodes into clusters based on their 1D and 3D positions and assign scores to each cluster. We select the highest-scoring clusters and use their medoid nodes for the next iteration of clustering, until we obtain a hierarchical and informative representation of th",
    "link": "https://arxiv.org/abs/2404.00254",
    "context": "Title: Clustering for Protein Representation Learning\nAbstract: arXiv:2404.00254v1 Announce Type: new  Abstract: Protein representation learning is a challenging task that aims to capture the structure and function of proteins from their amino acid sequences. Previous methods largely ignored the fact that not all amino acids are equally important for protein folding and activity. In this article, we propose a neural clustering framework that can automatically discover the critical components of a protein by considering both its primary and tertiary structure information. Our framework treats a protein as a graph, where each node represents an amino acid and each edge represents a spatial or sequential connection between amino acids. We then apply an iterative clustering strategy to group the nodes into clusters based on their 1D and 3D positions and assign scores to each cluster. We select the highest-scoring clusters and use their medoid nodes for the next iteration of clustering, until we obtain a hierarchical and informative representation of th",
    "path": "papers/24/04/2404.00254.json",
    "total_tokens": 873,
    "translated_title": "蛋白质表示学习的聚类",
    "translated_abstract": "蛋白质表示学习是一个具有挑战性的任务，旨在从氨基酸序列中捕获蛋白质的结构和功能。以往的方法很大程度上忽视了并非所有氨基酸对于蛋白质的折叠和活性都同样重要的事实。本文提出了一个神经聚类框架，通过考虑蛋白质的一级和三级结构信息，可以自动发现蛋白质的关键组分。我们的框架将蛋白质视为一个图，其中每个节点代表一个氨基酸，每条边代表氨基酸之间的空间或序列连接。然后，我们应用迭代聚类策略将节点根据它们的一维和三维位置分组，并为每个群分配分数。我们选择得分最高的群，并使用它们的中心节点进行下一轮的聚类，直到获得层次化和信息丰富的表示。",
    "tldr": "该论文提出了一个神经聚类框架，通过考虑蛋白质的一级和三级结构信息，自动发现蛋白质的关键组分，并利用迭代聚类策略创建层次化和信息丰富的蛋白质表示。",
    "en_tdlr": "This paper introduces a neural clustering framework for protein representation learning that automatically discovers critical components of proteins by considering both their primary and tertiary structure information, and creates a hierarchical and informative protein representation through iterative clustering strategy."
}