{
    "title": "Query-driven Relevant Paragraph Extraction from Legal Judgments",
    "abstract": "arXiv:2404.00595v1 Announce Type: new  Abstract: Legal professionals often grapple with navigating lengthy legal judgements to pinpoint information that directly address their queries. This paper focus on this task of extracting relevant paragraphs from legal judgements based on the query. We construct a specialized dataset for this task from the European Court of Human Rights (ECtHR) using the case law guides. We assess the performance of current retrieval models in a zero-shot way and also establish fine-tuning benchmarks using various models. The results highlight the significant gap between fine-tuned and zero-shot performance, emphasizing the challenge of handling distribution shift in the legal domain. We notice that the legal pre-training handles distribution shift on the corpus side but still struggles on query side distribution shift, with unseen legal queries. We also explore various Parameter Efficient Fine-Tuning (PEFT) methods to evaluate their practicality within the cont",
    "link": "https://arxiv.org/abs/2404.00595",
    "context": "Title: Query-driven Relevant Paragraph Extraction from Legal Judgments\nAbstract: arXiv:2404.00595v1 Announce Type: new  Abstract: Legal professionals often grapple with navigating lengthy legal judgements to pinpoint information that directly address their queries. This paper focus on this task of extracting relevant paragraphs from legal judgements based on the query. We construct a specialized dataset for this task from the European Court of Human Rights (ECtHR) using the case law guides. We assess the performance of current retrieval models in a zero-shot way and also establish fine-tuning benchmarks using various models. The results highlight the significant gap between fine-tuned and zero-shot performance, emphasizing the challenge of handling distribution shift in the legal domain. We notice that the legal pre-training handles distribution shift on the corpus side but still struggles on query side distribution shift, with unseen legal queries. We also explore various Parameter Efficient Fine-Tuning (PEFT) methods to evaluate their practicality within the cont",
    "path": "papers/24/04/2404.00595.json",
    "total_tokens": 836,
    "translated_title": "从法律裁决中基于查询提取相关段落",
    "translated_abstract": "法律专业人士经常苦于在漫长的法律裁决中寻找直接解答他们问题的信息。本文关注从法律裁决中基于查询提取相关段落的任务。我们利用欧洲人权法院（ECtHR）的案例法指南构建了一个专门的数据集。我们以零-shot方式评估当前检索模型的性能，并建立使用各种模型的微调基准。结果突出了微调和零-shot性能之间的显著差距，强调了处理法律领域中分布变化的挑战。我们注意到，法律预训练在语料库侧处理分布变化，但在查询侧分布变化（看不见的法律查询）方面仍然有困难。我们还探讨了各种参数高效微调（PEFT）方法，以评估它们在实践中的实用性。",
    "tldr": "本研究侧重于从法律裁决中基于查询提取相关段落的任务，结果表明微调和零-shot性能之间存在显著差距，强调了在法律领域处理分布变化的挑战。",
    "en_tdlr": "This study focuses on extracting relevant paragraphs from legal judgments based on queries, revealing a significant gap between fine-tuned and zero-shot performance, emphasizing the challenge of handling distribution shift in the legal domain."
}