{
    "title": "Interpretable Multi-View Clustering Based on Anchor Graph Tensor Factorization",
    "abstract": "arXiv:2404.00883v1 Announce Type: new  Abstract: The clustering method based on the anchor graph has gained significant attention due to its exceptional clustering performance and ability to process large-scale data. One common approach is to learn bipartite graphs with K-connected components, helping avoid the need for post-processing. However, this method has strict parameter requirements and may not always get K-connected components. To address this issue, an alternative approach is to directly obtain the cluster label matrix by performing non-negative matrix factorization (NMF) on the anchor graph. Nevertheless, existing multi-view clustering methods based on anchor graph factorization lack adequate cluster interpretability for the decomposed matrix and often overlook the inter-view information. We address this limitation by using non-negative tensor factorization to decompose an anchor graph tensor that combines anchor graphs from multiple views. This approach allows us to conside",
    "link": "https://arxiv.org/abs/2404.00883",
    "context": "Title: Interpretable Multi-View Clustering Based on Anchor Graph Tensor Factorization\nAbstract: arXiv:2404.00883v1 Announce Type: new  Abstract: The clustering method based on the anchor graph has gained significant attention due to its exceptional clustering performance and ability to process large-scale data. One common approach is to learn bipartite graphs with K-connected components, helping avoid the need for post-processing. However, this method has strict parameter requirements and may not always get K-connected components. To address this issue, an alternative approach is to directly obtain the cluster label matrix by performing non-negative matrix factorization (NMF) on the anchor graph. Nevertheless, existing multi-view clustering methods based on anchor graph factorization lack adequate cluster interpretability for the decomposed matrix and often overlook the inter-view information. We address this limitation by using non-negative tensor factorization to decompose an anchor graph tensor that combines anchor graphs from multiple views. This approach allows us to conside",
    "path": "papers/24/04/2404.00883.json",
    "total_tokens": 730,
    "translated_title": "基于锚图张量分解的可解释多视图聚类",
    "translated_abstract": "基于锚图的聚类方法因其出色的聚类性能和处理大规模数据的能力而备受关注。一种常见的方法是学习具有K个连接组件的二部图，有助于避免后处理的需要。然而，现有基于锚图因子化的多视图聚类方法缺乏对分解矩阵的充分聚类可解释性，并经常忽视视图间信息。我们通过使用非负张量因子分解来解决这一限制，以分解结合了多视图锚图的锚图张量。这一方法使我们能够同时考虑视图间的相关性，并获得更具解释性的聚类结果。",
    "tldr": "使用非负张量因子分解解决了基于锚图的多视图聚类方法缺乏聚类可解释性和忽视视图间信息的问题",
    "en_tdlr": "Using non-negative tensor factorization addresses the lack of interpretability and overlooking of inter-view information in multi-view clustering methods based on anchor graph factorization."
}