{
    "title": "Supervised Autoencoder MLP for Financial Time Series Forecasting",
    "abstract": "arXiv:2404.01866v1 Announce Type: new  Abstract: This paper investigates the enhancement of financial time series forecasting with the use of neural networks through supervised autoencoders, aiming to improve investment strategy performance. It specifically examines the impact of noise augmentation and triple barrier labeling on risk-adjusted returns, using the Sharpe and Information Ratios. The study focuses on the S&P 500 index, EUR/USD, and BTC/USD as the traded assets from January 1, 2010, to April 30, 2022. Findings indicate that supervised autoencoders, with balanced noise augmentation and bottleneck size, significantly boost strategy effectiveness. However, excessive noise and large bottleneck sizes can impair performance, highlighting the importance of precise parameter tuning. This paper also presents a derivation of a novel optimization metric that can be used with triple barrier labeling. The results of this study have substantial policy implications, suggesting that financi",
    "link": "https://arxiv.org/abs/2404.01866",
    "context": "Title: Supervised Autoencoder MLP for Financial Time Series Forecasting\nAbstract: arXiv:2404.01866v1 Announce Type: new  Abstract: This paper investigates the enhancement of financial time series forecasting with the use of neural networks through supervised autoencoders, aiming to improve investment strategy performance. It specifically examines the impact of noise augmentation and triple barrier labeling on risk-adjusted returns, using the Sharpe and Information Ratios. The study focuses on the S&P 500 index, EUR/USD, and BTC/USD as the traded assets from January 1, 2010, to April 30, 2022. Findings indicate that supervised autoencoders, with balanced noise augmentation and bottleneck size, significantly boost strategy effectiveness. However, excessive noise and large bottleneck sizes can impair performance, highlighting the importance of precise parameter tuning. This paper also presents a derivation of a novel optimization metric that can be used with triple barrier labeling. The results of this study have substantial policy implications, suggesting that financi",
    "path": "papers/24/04/2404.01866.json",
    "total_tokens": 870,
    "translated_title": "监督型自编码器多层感知机用于金融时间序列预测",
    "translated_abstract": "本文研究了如何通过使用神经网络中的监督型自编码器来增强金融时间序列预测，旨在改善投资策略表现。具体研究了噪声增强和三重障碍标记对风险调整回报的影响，使用夏普比率和信息比率。研究重点关注了从2010年1月1日至2022年4月30日期间作为交易资产的标普500指数，EUR/USD和BTC/USD。研究结果表明，具有平衡噪声增强和瓶颈大小的监督型自编码器显著提升了策略效果。然而，过多的噪声和大的瓶颈大小可能会损害表现，突出了精确参数调整的重要性。本文还提出了一种新的优化指标的推导，可与三重障碍标记一起使用。这项研究的结果对政策具有重要影响，暗示金融市场预测工具的持续改进。",
    "tldr": "通过监督型自编码器的使用和参数调整，可以显著提升金融时间序列预测的效果，对投资策略性能有重要影响。",
    "en_tdlr": "The use of supervised autoencoders and parameter tuning significantly enhances the effectiveness of financial time series forecasting, impacting investment strategy performance."
}