{
    "title": "EMONA: Event-level Moral Opinions in News Articles",
    "abstract": "arXiv:2404.01715v1 Announce Type: new  Abstract: Most previous research on moral frames has focused on social media short texts, little work has explored moral sentiment within news articles. In news articles, authors often express their opinions or political stance through moral judgment towards events, specifically whether the event is right or wrong according to social moral rules. This paper initiates a new task to understand moral opinions towards events in news articles. We have created a new dataset, EMONA, and annotated event-level moral opinions in news articles. This dataset consists of 400 news articles containing over 10k sentences and 45k events, among which 9,613 events received moral foundation labels. Extracting event morality is a challenging task, as moral judgment towards events can be very implicit. Baseline models were built for event moral identification and classification. In addition, we also conduct extrinsic evaluations to integrate event-level moral opinions ",
    "link": "https://arxiv.org/abs/2404.01715",
    "context": "Title: EMONA: Event-level Moral Opinions in News Articles\nAbstract: arXiv:2404.01715v1 Announce Type: new  Abstract: Most previous research on moral frames has focused on social media short texts, little work has explored moral sentiment within news articles. In news articles, authors often express their opinions or political stance through moral judgment towards events, specifically whether the event is right or wrong according to social moral rules. This paper initiates a new task to understand moral opinions towards events in news articles. We have created a new dataset, EMONA, and annotated event-level moral opinions in news articles. This dataset consists of 400 news articles containing over 10k sentences and 45k events, among which 9,613 events received moral foundation labels. Extracting event morality is a challenging task, as moral judgment towards events can be very implicit. Baseline models were built for event moral identification and classification. In addition, we also conduct extrinsic evaluations to integrate event-level moral opinions ",
    "path": "papers/24/04/2404.01715.json",
    "total_tokens": 894,
    "translated_title": "EMONA: 新闻文章中的事件级别道德观点",
    "translated_abstract": "大部分关于道德框架的研究集中在社交媒体的短文本上，很少有研究探索新闻文章中的道德情绪。在新闻文章中，作者经常通过对事件的道德判断来表达自己的观点或政治立场，具体来说是根据社会道德规则判断事件是对还是错。本文开始了一项新的任务，即理解新闻文章中对事件的道德观点。我们创建了一个新的数据集EMONA，并对新闻文章中的事件级别道德观点进行了注释。该数据集包含400篇新闻文章，包含超过1万个句子和4.5万个事件，其中9613个事件获得了道德基础标签。提取事件的道德性是一项具有挑战性的任务，因为对事件的道德判断可能非常隐晦。我们建立了用于事件道德识别和分类的基线模型。此外，我们还进行了外部评估，以整合事件级别的道德观点。",
    "tldr": "本文提出了一个新任务，即理解新闻文章中对事件的道德观点，并创建了一个包含事件级别道德观点的新数据集EMONA，为提取事件的道德性在新闻文章中建立了基线模型和进行外部评估。",
    "en_tdlr": "This paper introduces a new task of understanding moral opinions towards events in news articles and presents a new dataset EMONA with event-level moral opinions annotated, establishes baseline models for extracting event morality in news articles, and conducts extrinsic evaluations."
}