{
    "title": "Ensemble Learning for Vietnamese Scene Text Spotting in Urban Environments",
    "abstract": "arXiv:2404.00852v1 Announce Type: cross  Abstract: This paper presents a simple yet efficient ensemble learning framework for Vietnamese scene text spotting. Leveraging the power of ensemble learning, which combines multiple models to yield more accurate predictions, our approach aims to significantly enhance the performance of scene text spotting in challenging urban settings. Through experimental evaluations on the VinText dataset, our proposed method achieves a significant improvement in accuracy compared to existing methods with an impressive accuracy of 5%. These results unequivocally demonstrate the efficacy of ensemble learning in the context of Vietnamese scene text spotting in urban environments, highlighting its potential for real world applications, such as text detection and recognition in urban signage, advertisements, and various text-rich urban scenes.",
    "link": "https://arxiv.org/abs/2404.00852",
    "context": "Title: Ensemble Learning for Vietnamese Scene Text Spotting in Urban Environments\nAbstract: arXiv:2404.00852v1 Announce Type: cross  Abstract: This paper presents a simple yet efficient ensemble learning framework for Vietnamese scene text spotting. Leveraging the power of ensemble learning, which combines multiple models to yield more accurate predictions, our approach aims to significantly enhance the performance of scene text spotting in challenging urban settings. Through experimental evaluations on the VinText dataset, our proposed method achieves a significant improvement in accuracy compared to existing methods with an impressive accuracy of 5%. These results unequivocally demonstrate the efficacy of ensemble learning in the context of Vietnamese scene text spotting in urban environments, highlighting its potential for real world applications, such as text detection and recognition in urban signage, advertisements, and various text-rich urban scenes.",
    "path": "papers/24/04/2404.00852.json",
    "total_tokens": 741,
    "translated_title": "针对越南城市环境的集成学习用于场景文字识别",
    "translated_abstract": "本文提出了一个简单而高效的集成学习框架，用于越南场景文字识别。利用集成学习的强大优势，结合多个模型以提高预测准确性，我们的方法旨在显著提升在具有挑战性的城市环境中的场景文字识别性能。通过对VinText数据集进行实验评估，我们提出的方法在准确性上相较现有方法实现了显著改进，达到了惊人的5%准确性。这些结果无疑展示了集成学习在越南城市环境下场景文字识别中的功效，突显其在城市标识、广告以及各种富含文字的城市场景等实际应用中的潜力。",
    "tldr": "该方法提出了一个简单而高效的集成学习框架，可以显著提升在具有挑战性的城市环境中的越南场景文字识别性能。",
    "en_tdlr": "The paper proposes a simple yet efficient ensemble learning framework to significantly enhance Vietnamese scene text spotting in challenging urban settings."
}