{
    "title": "Leveraging Machine Learning for Early Autism Detection via INDT-ASD Indian Database",
    "abstract": "arXiv:2404.02181v1 Announce Type: cross  Abstract: Machine learning (ML) has advanced quickly, particularly throughout the area of health care. The diagnosis of neurodevelopment problems using ML is a very important area of healthcare. Autism spectrum disorder (ASD) is one of the developmental disorders that is growing the fastest globally. The clinical screening tests used to identify autistic symptoms are expensive and time-consuming. But now that ML has been advanced, it's feasible to identify autism early on. Previously, many different techniques have been used in investigations. Still, none of them have produced the anticipated outcomes when it comes to the capacity to predict autistic features utilizing a clinically validated Indian ASD database. Therefore, this study aimed to develop a simple, quick, and inexpensive technique for identifying ASD by using ML. Various machine learning classifiers, including Adaboost (AB), Gradient Boost (GB), Decision Tree (DT), Logistic Regressio",
    "link": "https://arxiv.org/abs/2404.02181",
    "context": "Title: Leveraging Machine Learning for Early Autism Detection via INDT-ASD Indian Database\nAbstract: arXiv:2404.02181v1 Announce Type: cross  Abstract: Machine learning (ML) has advanced quickly, particularly throughout the area of health care. The diagnosis of neurodevelopment problems using ML is a very important area of healthcare. Autism spectrum disorder (ASD) is one of the developmental disorders that is growing the fastest globally. The clinical screening tests used to identify autistic symptoms are expensive and time-consuming. But now that ML has been advanced, it's feasible to identify autism early on. Previously, many different techniques have been used in investigations. Still, none of them have produced the anticipated outcomes when it comes to the capacity to predict autistic features utilizing a clinically validated Indian ASD database. Therefore, this study aimed to develop a simple, quick, and inexpensive technique for identifying ASD by using ML. Various machine learning classifiers, including Adaboost (AB), Gradient Boost (GB), Decision Tree (DT), Logistic Regressio",
    "path": "papers/24/04/2404.02181.json",
    "total_tokens": 854,
    "translated_title": "利用机器学习通过INDT-ASD印度数据库早期检测自闭症",
    "translated_abstract": "机器学习（ML）在医疗领域发展迅速，神经发育问题的诊断是医疗领域的一个重要领域。自闭症谱系障碍（ASD）是全球增长最快的发展性障碍之一。临床筛查测试用于识别自闭症症状昂贵且耗时。但现在随着ML的进展，早期识别自闭症变得可行。先前进行过许多不同技术的探索，但在利用经过临床验证的印度ASD数据库预测自闭症特征的能力方面，没有一个产生预期结果。因此，本研究旨在通过使用ML开发一种简单、快速、廉价的技术来识别ASD。采用了多种机器学习分类器，包括Adaboost（AB）、Gradient Boost（GB）、决策树（DT）、逻辑回归",
    "tldr": "本研究旨在通过利用机器学习开发一种简单、快速、廉价的技术，利用INDT-ASD印度数据库早期检测自闭症。",
    "en_tdlr": "This study aims to develop a simple, quick, and inexpensive technique for early autism detection using machine learning with the INDT-ASD Indian database."
}