{
    "title": "Interactive Multi-Robot Flocking with Gesture Responsiveness and Musical Accompaniment",
    "abstract": "arXiv:2404.00442v1 Announce Type: cross  Abstract: For decades, robotics researchers have pursued various tasks for multi-robot systems, from cooperative manipulation to search and rescue. These tasks are multi-robot extensions of classical robotic tasks and often optimized on dimensions such as speed or efficiency. As robots transition from commercial and research settings into everyday environments, social task aims such as engagement or entertainment become increasingly relevant. This work presents a compelling multi-robot task, in which the main aim is to enthrall and interest. In this task, the goal is for a human to be drawn to move alongside and participate in a dynamic, expressive robot flock. Towards this aim, the research team created algorithms for robot movements and engaging interaction modes such as gestures and sound. The contributions are as follows: (1) a novel group navigation algorithm involving human and robot agents, (2) a gesture responsive algorithm for real-time",
    "link": "https://arxiv.org/abs/2404.00442",
    "context": "Title: Interactive Multi-Robot Flocking with Gesture Responsiveness and Musical Accompaniment\nAbstract: arXiv:2404.00442v1 Announce Type: cross  Abstract: For decades, robotics researchers have pursued various tasks for multi-robot systems, from cooperative manipulation to search and rescue. These tasks are multi-robot extensions of classical robotic tasks and often optimized on dimensions such as speed or efficiency. As robots transition from commercial and research settings into everyday environments, social task aims such as engagement or entertainment become increasingly relevant. This work presents a compelling multi-robot task, in which the main aim is to enthrall and interest. In this task, the goal is for a human to be drawn to move alongside and participate in a dynamic, expressive robot flock. Towards this aim, the research team created algorithms for robot movements and engaging interaction modes such as gestures and sound. The contributions are as follows: (1) a novel group navigation algorithm involving human and robot agents, (2) a gesture responsive algorithm for real-time",
    "path": "papers/24/04/2404.00442.json",
    "total_tokens": 894,
    "translated_title": "具有手势响应和音乐伴奏的互动多机器人集群",
    "translated_abstract": "数十年来，机器人研究人员一直致力于多机器人系统的各种任务，从合作操纵到搜索和救援。这些任务是传统机器人任务的多机器人扩展，通常在速度或效率等维度上进行了优化。随着机器人从商业和研究领域过渡到日常环境，社交任务目标，如参与或娱乐，变得越来越重要。本研究提出了一个引人入胜且有趣的多机器人任务，其中主要目标是使人着迷并产生兴趣。在这个任务中，目标是让人类被吸引并与动态、富有表现力的机器人群体一起移动并参与其中。为实现这一目标，研究团队创建了涉及机器人运动和引人注意的交互模式，如手势和声音的算法。贡献如下：（1）一种涉及人类和机器人代理的新颖群体导航算法，（2）用于实时的手势响应算法",
    "tldr": "提出了一个互动多机器人集群任务，目的是通过手势和声音引导人类参与机器人群体，并创造了新颖的群体导航和手势响应算法",
    "en_tdlr": "Introduced an interactive multi-robot flocking task with the goal of engaging human participation through gestures and sound, and developed novel algorithms for group navigation and gesture responsiveness."
}