{
    "title": "Generating Faithful and Complete Hospital-Course Summaries from the Electronic Health Record",
    "abstract": "arXiv:2404.01189v1 Announce Type: new  Abstract: The rapid adoption of Electronic Health Records (EHRs) has been instrumental in streamlining administrative tasks, increasing transparency, and enabling continuity of care across providers. An unintended consequence of the increased documentation burden, however, has been reduced face-time with patients and, concomitantly, a dramatic rise in clinician burnout. In this thesis, we pinpoint a particularly time-intensive, yet critical, documentation task: generating a summary of a patient's hospital admissions, and propose and evaluate automated solutions. In Chapter 2, we construct a dataset based on 109,000 hospitalizations (2M source notes) and perform exploratory analyses to motivate future work on modeling and evaluation [NAACL 2021]. In Chapter 3, we address faithfulness from a modeling perspective by revising noisy references [EMNLP 2022] and, to reduce the reliance on references, directly calibrating model outputs to metrics [ACL 202",
    "link": "https://arxiv.org/abs/2404.01189",
    "context": "Title: Generating Faithful and Complete Hospital-Course Summaries from the Electronic Health Record\nAbstract: arXiv:2404.01189v1 Announce Type: new  Abstract: The rapid adoption of Electronic Health Records (EHRs) has been instrumental in streamlining administrative tasks, increasing transparency, and enabling continuity of care across providers. An unintended consequence of the increased documentation burden, however, has been reduced face-time with patients and, concomitantly, a dramatic rise in clinician burnout. In this thesis, we pinpoint a particularly time-intensive, yet critical, documentation task: generating a summary of a patient's hospital admissions, and propose and evaluate automated solutions. In Chapter 2, we construct a dataset based on 109,000 hospitalizations (2M source notes) and perform exploratory analyses to motivate future work on modeling and evaluation [NAACL 2021]. In Chapter 3, we address faithfulness from a modeling perspective by revising noisy references [EMNLP 2022] and, to reduce the reliance on references, directly calibrating model outputs to metrics [ACL 202",
    "path": "papers/24/04/2404.01189.json",
    "total_tokens": 875,
    "translated_title": "从电子健康记录生成忠实完整的医院诊疗摘要",
    "translated_abstract": "电子健康记录的快速普及在简化行政任务、增加透明度以及促进跨医护人员连续性护理方面发挥了重要作用。然而，增加了文档记录负担的一个意外后果是减少了与患者面对面的时间，同时也大幅增加了临床医生的疲劳。本论文着重研究一个尤为耗时但关键的文档记录任务：生成病人住院的摘要，并提出并评估自动化解决方案。在第2章中，我们基于10.9万次住院（2百万源注释）构建了一个数据集，并进行探索性分析以激励未来关于建模和评估的工作[NAACL 2021]。在第3章中，我们从建模角度解决了忠实性问题，通过修订有噪参考[EMNLP 2022]，为了减少对参考的依赖，直接校准模型输出到指标[ACL 202]。",
    "tldr": "本论文研究了如何从电子健康记录生成忠实完整的医院诊疗摘要，并提出并评估了自动化解决方案。",
    "en_tdlr": "This paper investigates how to generate faithful and complete hospital-course summaries from electronic health records and proposes and evaluates automated solutions."
}