{
    "title": "Neuromorphic Wireless Device-Edge Co-Inference via the Directed Information Bottleneck",
    "abstract": "arXiv:2404.01804v1 Announce Type: new  Abstract: An important use case of next-generation wireless systems is device-edge co-inference, where a semantic task is partitioned between a device and an edge server. The device carries out data collection and partial processing of the data, while the remote server completes the given task based on information received from the device. It is often required that processing and communication be run as efficiently as possible at the device, while more computing resources are available at the edge. To address such scenarios, we introduce a new system solution, termed neuromorphic wireless device-edge co-inference. According to it, the device runs sensing, processing, and communication units using neuromorphic hardware, while the server employs conventional radio and computing technologies. The proposed system is designed using a transmitter-centric information-theoretic criterion that targets a reduction of the communication overhead, while retain",
    "link": "https://arxiv.org/abs/2404.01804",
    "context": "Title: Neuromorphic Wireless Device-Edge Co-Inference via the Directed Information Bottleneck\nAbstract: arXiv:2404.01804v1 Announce Type: new  Abstract: An important use case of next-generation wireless systems is device-edge co-inference, where a semantic task is partitioned between a device and an edge server. The device carries out data collection and partial processing of the data, while the remote server completes the given task based on information received from the device. It is often required that processing and communication be run as efficiently as possible at the device, while more computing resources are available at the edge. To address such scenarios, we introduce a new system solution, termed neuromorphic wireless device-edge co-inference. According to it, the device runs sensing, processing, and communication units using neuromorphic hardware, while the server employs conventional radio and computing technologies. The proposed system is designed using a transmitter-centric information-theoretic criterion that targets a reduction of the communication overhead, while retain",
    "path": "papers/24/04/2404.01804.json",
    "total_tokens": 791,
    "translated_title": "通过有向信息瓶颈进行神经形态的无线设备-边缘协同推理",
    "translated_abstract": "下一代无线系统的一个重要用例是设备-边缘协同推理，其中语义任务在设备和边缘服务器之间划分。设备进行数据收集和数据的部分处理，远程服务器根据从设备接收的信息完成给定任务。通常要求在设备处尽可能高效地运行处理和通信，而在边缘有更多的计算资源可用。为了应对这种情况，我们引入了一种新的系统解决方案，称为神经形态的无线设备-边缘协同推理。根据这个系统，设备使用神经形态硬件运行感应、处理和通信单元，而服务器采用传统的无线电和计算技术。",
    "tldr": "提出了一种新的系统解决方案，名为神经形态的无线设备-边缘协同推理，设备使用神经形态硬件进行数据处理，边缘服务器使用传统技术，以降低通信开销。",
    "en_tdlr": "Introduced a new system solution, named Neuromorphic Wireless Device-Edge Co-Inference, where devices utilize neuromorphic hardware for data processing, while edge servers employ conventional technologies, aiming to reduce communication overhead."
}