{
    "title": "Where Are You From? Let Me Guess! Subdialect Recognition of Speeches in Sorani Kurdish",
    "abstract": "arXiv:2404.00124v1 Announce Type: new  Abstract: Classifying Sorani Kurdish subdialects poses a challenge due to the need for publicly available datasets or reliable resources like social media or websites for data collection. We conducted field visits to various cities and villages to address this issue, connecting with native speakers from different age groups, genders, academic backgrounds, and professions. We recorded their voices while engaging in conversations covering diverse topics such as lifestyle, background history, hobbies, interests, vacations, and life lessons. The target area of the research was the Kurdistan Region of Iraq. As a result, we accumulated 29 hours, 16 minutes, and 40 seconds of audio recordings from 107 interviews, constituting an unbalanced dataset encompassing six subdialects. Subsequently, we adapted three deep learning models: ANN, CNN, and RNN-LSTM. We explored various configurations, including different track durations, dataset splitting, and imbalan",
    "link": "https://arxiv.org/abs/2404.00124",
    "context": "Title: Where Are You From? Let Me Guess! Subdialect Recognition of Speeches in Sorani Kurdish\nAbstract: arXiv:2404.00124v1 Announce Type: new  Abstract: Classifying Sorani Kurdish subdialects poses a challenge due to the need for publicly available datasets or reliable resources like social media or websites for data collection. We conducted field visits to various cities and villages to address this issue, connecting with native speakers from different age groups, genders, academic backgrounds, and professions. We recorded their voices while engaging in conversations covering diverse topics such as lifestyle, background history, hobbies, interests, vacations, and life lessons. The target area of the research was the Kurdistan Region of Iraq. As a result, we accumulated 29 hours, 16 minutes, and 40 seconds of audio recordings from 107 interviews, constituting an unbalanced dataset encompassing six subdialects. Subsequently, we adapted three deep learning models: ANN, CNN, and RNN-LSTM. We explored various configurations, including different track durations, dataset splitting, and imbalan",
    "path": "papers/24/04/2404.00124.json",
    "total_tokens": 924,
    "translated_title": "你来自哪里？让我猜猜！索拉尼库尔德语方言识别",
    "translated_abstract": "由于公开可用数据集或可靠资源（如社交媒体或网站）的需求，对索拉尼库尔德语方言进行分类构成一项挑战。我们进行了多个城市和村庄的实地访问，与不同年龄组、性别、学术背景和职业的母语者进行了联系。我们在进行涵盖各种话题如生活方式、背景历史、爱好、兴趣、假期和生活经验的对话过程中录制了他们的声音。研究的目标地区是伊拉克库尔德斯坦地区。因此，我们从107个访谈中积累了29小时16分钟40秒的音频记录，包括六种方言的不平衡数据集。随后，我们采用了三种深度学习模型: 人工神经网络（ANN）、卷积神经网络（CNN）和循环神经网络-长短期记忆（RNN-LSTM）。我们探索了不同的配置，包括不同的跟踪持续时间、数据集拆分和不平衡处理。",
    "tldr": "挑战是缺乏公开可用数据集或可靠资源，针对索拉尼库尔德语方言的六个方言建立了一个不平衡数据集并利用三种深度学习模型进行分析。",
    "en_tdlr": "The challenge lies in the lack of publicly available datasets or reliable resources, and the study established an unbalanced dataset of six subdialects in Sorani Kurdish to utilize three deep learning models."
}