{
    "title": "Corpus Considerations for Annotator Modeling and Scaling",
    "abstract": "arXiv:2404.02340v1 Announce Type: new  Abstract: Recent trends in natural language processing research and annotation tasks affirm a paradigm shift from the traditional reliance on a single ground truth to a focus on individual perspectives, particularly in subjective tasks. In scenarios where annotation tasks are meant to encompass diversity, models that solely rely on the majority class labels may inadvertently disregard valuable minority perspectives. This oversight could result in the omission of crucial information and, in a broader context, risk disrupting the balance within larger ecosystems. As the landscape of annotator modeling unfolds with diverse representation techniques, it becomes imperative to investigate their effectiveness with the fine-grained features of the datasets in view. This study systematically explores various annotator modeling techniques and compares their performance across seven corpora.   From our findings, we show that the commonly used user token mode",
    "link": "https://arxiv.org/abs/2404.02340",
    "context": "Title: Corpus Considerations for Annotator Modeling and Scaling\nAbstract: arXiv:2404.02340v1 Announce Type: new  Abstract: Recent trends in natural language processing research and annotation tasks affirm a paradigm shift from the traditional reliance on a single ground truth to a focus on individual perspectives, particularly in subjective tasks. In scenarios where annotation tasks are meant to encompass diversity, models that solely rely on the majority class labels may inadvertently disregard valuable minority perspectives. This oversight could result in the omission of crucial information and, in a broader context, risk disrupting the balance within larger ecosystems. As the landscape of annotator modeling unfolds with diverse representation techniques, it becomes imperative to investigate their effectiveness with the fine-grained features of the datasets in view. This study systematically explores various annotator modeling techniques and compares their performance across seven corpora.   From our findings, we show that the commonly used user token mode",
    "path": "papers/24/04/2404.02340.json",
    "total_tokens": 748,
    "translated_title": "注解器建模与扩展的语料库考虑",
    "translated_abstract": "自然语言处理研究和注释任务的最新趋势确认了从传统依赖单一“真相标签”转向关注个体视角，尤其是在主观任务中。在注释任务旨在包含多样性的情况下，仅依赖于多数类别标签的模型可能无意中忽视有价值的少数派观点。这种疏漏可能导致关键信息的遗漏，并在更广泛的背景下，可能扰乱更大生态系统中的平衡。随着注解器建模的多样性代表技术的出现，有必要研究它们与数据集的精细特征结合的有效性。本研究系统地探讨了各种注解器建模技术，并比较了它们在七个语料库中的性能。",
    "tldr": "在多样化表示技巧的注解器建模领域，对数据集的细粒度特征进行研究是至关重要的。",
    "en_tdlr": "Investigating the effectiveness of diverse representation techniques in annotator modeling with the fine-grained features of datasets is crucial."
}