{
    "title": "How COVID-19 has Impacted the Anti-Vaccine Discourse: A Large-Scale Twitter Study Spanning Pre-COVID and Post-COVID Era",
    "abstract": "arXiv:2404.01669v1 Announce Type: cross  Abstract: The debate around vaccines has been going on for decades, but the COVID-19 pandemic showed how crucial it is to understand and mitigate anti-vaccine sentiments. While the pandemic may be over, it is still important to understand how the pandemic affected the anti-vaccine discourse, and whether the arguments against non-COVID vaccines (e.g., Flu, MMR, IPV, HPV vaccines) have also changed due to the pandemic. This study attempts to answer these questions through a large-scale study of anti-vaccine posts on Twitter. Almost all prior works that utilized social media to understand anti-vaccine opinions considered only the three broad stances of Anti-Vax, Pro-Vax, and Neutral. There has not been any effort to identify the specific reasons/concerns behind the anti-vax sentiments (e.g., side-effects, conspiracy theories, political reasons) on social media at scale. In this work, we propose two novel methods for classifying tweets into 11 diffe",
    "link": "https://arxiv.org/abs/2404.01669",
    "context": "Title: How COVID-19 has Impacted the Anti-Vaccine Discourse: A Large-Scale Twitter Study Spanning Pre-COVID and Post-COVID Era\nAbstract: arXiv:2404.01669v1 Announce Type: cross  Abstract: The debate around vaccines has been going on for decades, but the COVID-19 pandemic showed how crucial it is to understand and mitigate anti-vaccine sentiments. While the pandemic may be over, it is still important to understand how the pandemic affected the anti-vaccine discourse, and whether the arguments against non-COVID vaccines (e.g., Flu, MMR, IPV, HPV vaccines) have also changed due to the pandemic. This study attempts to answer these questions through a large-scale study of anti-vaccine posts on Twitter. Almost all prior works that utilized social media to understand anti-vaccine opinions considered only the three broad stances of Anti-Vax, Pro-Vax, and Neutral. There has not been any effort to identify the specific reasons/concerns behind the anti-vax sentiments (e.g., side-effects, conspiracy theories, political reasons) on social media at scale. In this work, we propose two novel methods for classifying tweets into 11 diffe",
    "path": "papers/24/04/2404.01669.json",
    "total_tokens": 972,
    "translated_title": "COVID-19如何影响反疫苗言论：一个跨越疫情前后的大规模Twitter研究",
    "translated_abstract": "关于疫苗的争论已经持续了几十年，但COVID-19大流行展示了理解和减少反疫苗情绪的重要性。尽管疫情可能已经结束，但仍然很重要理解疫情如何影响了反疫苗话语，并且在疫情结束后反对非COVID疫苗（如流感、麻疹、脊髓灰质炎、HPV疫苗）的论点是否也因疫情而改变。本研究试图通过对Twitter上的反疫苗帖子进行大规模研究来回答这些问题。几乎所有以社交媒体了解反疫苗观点的先前研究都只考虑反疫苗、赞成疫苗和中立三种广泛立场。迄今为止还没有努力在社交媒体上大规模识别反疫苗情绪背后的具体原因/关注点（如副作用、阴谋论、政治原因）。在这项工作中，我们提出了两种将推文分类为11种不同类型的新方法。",
    "tldr": "通过大规模Twitter研究，本研究尝试理解COVID-19如何影响反疫苗言论，并且提出了两种新的方法去识别具体原因/关注点。"
}