{
    "title": "DELAN: Dual-Level Alignment for Vision-and-Language Navigation by Cross-Modal Contrastive Learning",
    "abstract": "arXiv:2404.01994v1 Announce Type: cross  Abstract: Vision-and-Language navigation (VLN) requires an agent to navigate in unseen environment by following natural language instruction. For task completion, the agent needs to align and integrate various navigation modalities, including instruction, observation and navigation history. Existing works primarily concentrate on cross-modal attention at the fusion stage to achieve this objective. Nevertheless, modality features generated by disparate uni-encoders reside in their own spaces, leading to a decline in the quality of cross-modal fusion and decision. To address this problem, we propose a Dual-levEL AligNment (DELAN) framework by cross-modal contrastive learning. This framework is designed to align various navigation-related modalities before fusion, thereby enhancing cross-modal interaction and action decision-making. Specifically, we divide the pre-fusion alignment into dual levels: instruction-history level and landmark-observation",
    "link": "https://arxiv.org/abs/2404.01994",
    "context": "Title: DELAN: Dual-Level Alignment for Vision-and-Language Navigation by Cross-Modal Contrastive Learning\nAbstract: arXiv:2404.01994v1 Announce Type: cross  Abstract: Vision-and-Language navigation (VLN) requires an agent to navigate in unseen environment by following natural language instruction. For task completion, the agent needs to align and integrate various navigation modalities, including instruction, observation and navigation history. Existing works primarily concentrate on cross-modal attention at the fusion stage to achieve this objective. Nevertheless, modality features generated by disparate uni-encoders reside in their own spaces, leading to a decline in the quality of cross-modal fusion and decision. To address this problem, we propose a Dual-levEL AligNment (DELAN) framework by cross-modal contrastive learning. This framework is designed to align various navigation-related modalities before fusion, thereby enhancing cross-modal interaction and action decision-making. Specifically, we divide the pre-fusion alignment into dual levels: instruction-history level and landmark-observation",
    "path": "papers/24/04/2404.01994.json",
    "total_tokens": 896,
    "translated_title": "DELAN: 通过跨模态对比学习实现视觉与语言导航的双层对齐",
    "translated_abstract": "arXiv:2404.01994v1 公告类型: 交叉  摘要: 视觉与语言导航(VLN)要求代理根据自然语言指示在未知环境中导航。为了完成任务，代理需要对齐和整合各种导航模态，包括指示、观察和导航历史。现有研究主要集中在融合阶段的跨模态注意力，以实现这一目标。然而，由不同单一编码器生成的模态特征位于各自的空间中，导致跨模态融合和决策质量下降。为了解决这一问题，我们提出了通过跨模态对比学习实现的Dual-levEL AligNment (DELAN)框架。该框架旨在在融合之前对齐各种与导航相关的模态，从而增强跨模态交互和行动决策。具体而言，我们将预融合对齐分为两个层次: 指示-历史层和地标-观察",
    "tldr": "通过跨模态对比学习实现的DELAN框架提出了双层对齐方法，以提升视觉与语言导航中的跨模态交互和行动决策。",
    "en_tdlr": "The DELAN framework, implemented through cross-modal contrastive learning, introduces a dual-level alignment approach to enhance cross-modal interaction and action decision-making in vision-and-language navigation."
}