{
    "title": "Temporally Consistent Unbalanced Optimal Transport for Unsupervised Action Segmentation",
    "abstract": "arXiv:2404.01518v1 Announce Type: cross  Abstract: We propose a novel approach to the action segmentation task for long, untrimmed videos, based on solving an optimal transport problem. By encoding a temporal consistency prior into a Gromov-Wasserstein problem, we are able to decode a temporally consistent segmentation from a noisy affinity/matching cost matrix between video frames and action classes. Unlike previous approaches, our method does not require knowing the action order for a video to attain temporal consistency. Furthermore, our resulting (fused) Gromov-Wasserstein problem can be efficiently solved on GPUs using a few iterations of projected mirror descent. We demonstrate the effectiveness of our method in an unsupervised learning setting, where our method is used to generate pseudo-labels for self-training. We evaluate our segmentation approach and unsupervised learning pipeline on the Breakfast, 50-Salads, YouTube Instructions and Desktop Assembly datasets, yielding state",
    "link": "https://arxiv.org/abs/2404.01518",
    "context": "Title: Temporally Consistent Unbalanced Optimal Transport for Unsupervised Action Segmentation\nAbstract: arXiv:2404.01518v1 Announce Type: cross  Abstract: We propose a novel approach to the action segmentation task for long, untrimmed videos, based on solving an optimal transport problem. By encoding a temporal consistency prior into a Gromov-Wasserstein problem, we are able to decode a temporally consistent segmentation from a noisy affinity/matching cost matrix between video frames and action classes. Unlike previous approaches, our method does not require knowing the action order for a video to attain temporal consistency. Furthermore, our resulting (fused) Gromov-Wasserstein problem can be efficiently solved on GPUs using a few iterations of projected mirror descent. We demonstrate the effectiveness of our method in an unsupervised learning setting, where our method is used to generate pseudo-labels for self-training. We evaluate our segmentation approach and unsupervised learning pipeline on the Breakfast, 50-Salads, YouTube Instructions and Desktop Assembly datasets, yielding state",
    "path": "papers/24/04/2404.01518.json",
    "total_tokens": 866,
    "translated_title": "一种用于无监督动作分割的临时一致不平衡最优传输方法",
    "translated_abstract": "我们提出了一种针对长时间未修剪视频的动作分割任务的新方法，基于解决最优传输问题。通过将时间一致性先验编码到Gromov-Wasserstein问题中，我们能够从视频帧和动作类别之间的噪声关联/匹配成本矩阵中解码出一个时间一致的分割。与先前方法不同，我们的方法不需要知道视频的动作顺序来实现时间一致性。此外，我们的结果（融合）Gromov-Wasserstein问题可以在GPU上使用几次投影镜下降迭代高效求解。我们在无监督学习环境中展示了我们方法的有效性，其中我们的方法用于生成自训练的伪标签。我们在Breakfast、50-Salads、YouTube Instructions和Desktop Assembly数据集上评估了我们的分割方法和无监督学习流程，取得了最先进的结果。",
    "tldr": "提出了一种基于解决最优传输问题的动作分割方法，通过在Gromov-Wasserstein问题中编码时间一致性先验来实现从视频帧和动作类别之间的噪声成本中解码时间一致的分割。",
    "en_tdlr": "Introducing an approach for action segmentation based on solving an optimal transport problem, decoding temporally consistent segmentation from noisy affinity/matching cost matrix between video frames and action classes by encoding temporal consistency prior into the Gromov-Wasserstein problem."
}