{
    "title": "Exploring Sustainable Clothing Consumption in Middle-Income Countries: A case study of Romanian consumers",
    "abstract": "arXiv:2404.02612v1 Announce Type: new  Abstract: The overconsumption of consumers under today's increasingly scarce natural resources has overwhelmed the textile industry in middle-income countries, such as Romania. It is becoming more and more essential to encourage sustainable clothing consumption behaviors, such as purchasing recyclable clothes. Notwithstanding there is a limited number of studies trying to understand the intrinsic factors that motivate consumers' purchase intention toward sustainable clothes in middle-income countries. Moreover, the effect of consumers' environmental knowledge on determining their purchase intention of sustainable clothes remains understudied. Consequently, the purpose of this paper is to make a significant contribution to the sustainable consumption literature by providing a consolidated framework that explores the behavioral factors inclining Romanian consumers' purchase intention towards sustainable clothes. The foundation of this study combines",
    "link": "https://arxiv.org/abs/2404.02612",
    "context": "Title: Exploring Sustainable Clothing Consumption in Middle-Income Countries: A case study of Romanian consumers\nAbstract: arXiv:2404.02612v1 Announce Type: new  Abstract: The overconsumption of consumers under today's increasingly scarce natural resources has overwhelmed the textile industry in middle-income countries, such as Romania. It is becoming more and more essential to encourage sustainable clothing consumption behaviors, such as purchasing recyclable clothes. Notwithstanding there is a limited number of studies trying to understand the intrinsic factors that motivate consumers' purchase intention toward sustainable clothes in middle-income countries. Moreover, the effect of consumers' environmental knowledge on determining their purchase intention of sustainable clothes remains understudied. Consequently, the purpose of this paper is to make a significant contribution to the sustainable consumption literature by providing a consolidated framework that explores the behavioral factors inclining Romanian consumers' purchase intention towards sustainable clothes. The foundation of this study combines",
    "path": "papers/24/04/2404.02612.json",
    "total_tokens": 816,
    "translated_title": "在中等收入国家探讨可持续性服装消费：罗马尼亚消费者案例研究",
    "translated_abstract": "消费者在当今日益稀缺的自然资源下的过度消费已经使像罗马尼亚这样的中等收入国家的纺织行业不堪重负。鼓励可持续服装消费行为变得越来越重要，比如购买可回收衣物。然而，试图理解中等收入国家消费者对可持续服装购买意向的动因因内在因素而产生的研究数量有限。此外，消费者的环境知识对于确定他们对可持续服装购买意向的影响仍未受到充分研究。因此，本文的目的是通过提供一个整合框架来探讨促使罗马尼亚消费者购买意向转向可持续服装的行为因素，从而对可持续消费文献做出重要贡献。",
    "tldr": "本研究旨在探讨中等收入国家罗马尼亚消费者购买可持续服装意向的行为因素，填补了相关研究的空白。",
    "en_tdlr": "This study aims to explore the behavioral factors influencing Romanian consumers' intention to purchase sustainable clothing, filling a gap in the existing research."
}