{
    "title": "PerOS: Personalized Self-Adapting Operating Systems in the Cloud",
    "abstract": "arXiv:2404.00057v1 Announce Type: cross  Abstract: Operating systems (OSes) are foundational to computer systems, managing hardware resources and ensuring secure environments for diverse applications. However, despite their enduring importance, the fundamental design objectives of OSes have seen minimal evolution over decades. Traditionally prioritizing aspects like speed, memory efficiency, security, and scalability, these objectives often overlook the crucial aspect of intelligence as well as personalized user experience. The lack of intelligence becomes increasingly critical amid technological revolutions, such as the remarkable advancements in machine learning (ML).   Today's personal devices, evolving into intimate companions for users, pose unique challenges for traditional OSes like Linux and iOS, especially with the emergence of specialized hardware featuring heterogeneous components. Furthermore, the rise of large language models (LLMs) in ML has introduced transformative capa",
    "link": "https://arxiv.org/abs/2404.00057",
    "context": "Title: PerOS: Personalized Self-Adapting Operating Systems in the Cloud\nAbstract: arXiv:2404.00057v1 Announce Type: cross  Abstract: Operating systems (OSes) are foundational to computer systems, managing hardware resources and ensuring secure environments for diverse applications. However, despite their enduring importance, the fundamental design objectives of OSes have seen minimal evolution over decades. Traditionally prioritizing aspects like speed, memory efficiency, security, and scalability, these objectives often overlook the crucial aspect of intelligence as well as personalized user experience. The lack of intelligence becomes increasingly critical amid technological revolutions, such as the remarkable advancements in machine learning (ML).   Today's personal devices, evolving into intimate companions for users, pose unique challenges for traditional OSes like Linux and iOS, especially with the emergence of specialized hardware featuring heterogeneous components. Furthermore, the rise of large language models (LLMs) in ML has introduced transformative capa",
    "path": "papers/24/04/2404.00057.json",
    "total_tokens": 807,
    "translated_title": "PerOS: 在云中的个性化自适应操作系统",
    "translated_abstract": "操作系统（OS）是计算机系统的基础，管理硬件资源并确保多样应用程序的安全环境。然而，尽管它们具有持久重要性，但OS的基本设计目标几十年来几乎没有进化。传统上优先考虑速度、内存效率、安全性和可伸缩性等方面，这些目标常常忽视了情报和个性化用户体验这一关键方面。情报的缺乏在技术革命中变得越发关键，比如机器学习（ML）方面的显著进展。如今的个人设备正在演变成用户的亲密伴侣，对传统OS（如Linux和iOS）提出独特挑战，尤其是随着特殊硬件和异构组件的出现。此外，机器学习中大型语言模型（LLMs）的崛起引入了转变性的能力。",
    "tldr": "PerOS是个性化自适应操作系统，解决了传统OS在情报和用户体验方面的不足，尤其适应了机器学习和大型语言模型的发展。",
    "en_tdlr": "PerOS is a personalized self-adapting operating system that addresses the shortcomings of traditional OSes in intelligence and user experience, particularly catering to the advancements in machine learning and large language models."
}