{
    "title": "Investigating Similarities Across Decentralized Financial (DeFi) Services",
    "abstract": "arXiv:2404.00034v1 Announce Type: cross  Abstract: We explore the adoption of graph representation learning (GRL) algorithms to investigate similarities across services offered by Decentralized Finance (DeFi) protocols. Following existing literature, we use Ethereum transaction data to identify the DeFi building blocks. These are sets of protocol-specific smart contracts that are utilized in combination within single transactions and encapsulate the logic to conduct specific financial services such as swapping or lending cryptoassets. We propose a method to categorize these blocks into clusters based on their smart contract attributes and the graph structure of their smart contract calls. We employ GRL to create embedding vectors from building blocks and agglomerative models for clustering them. To evaluate whether they are effectively grouped in clusters of similar functionalities, we associate them with eight financial functionality categories and use this information as the target l",
    "link": "https://arxiv.org/abs/2404.00034",
    "context": "Title: Investigating Similarities Across Decentralized Financial (DeFi) Services\nAbstract: arXiv:2404.00034v1 Announce Type: cross  Abstract: We explore the adoption of graph representation learning (GRL) algorithms to investigate similarities across services offered by Decentralized Finance (DeFi) protocols. Following existing literature, we use Ethereum transaction data to identify the DeFi building blocks. These are sets of protocol-specific smart contracts that are utilized in combination within single transactions and encapsulate the logic to conduct specific financial services such as swapping or lending cryptoassets. We propose a method to categorize these blocks into clusters based on their smart contract attributes and the graph structure of their smart contract calls. We employ GRL to create embedding vectors from building blocks and agglomerative models for clustering them. To evaluate whether they are effectively grouped in clusters of similar functionalities, we associate them with eight financial functionality categories and use this information as the target l",
    "path": "papers/24/04/2404.00034.json",
    "total_tokens": 818,
    "translated_title": "探究去中心化金融（DeFi）服务之间的相似性",
    "translated_abstract": "我们探讨了采用图表示学习（GRL）算法来研究去中心化金融（DeFi）协议提供的服务之间的相似性。我们使用以太坊交易数据来识别DeFi构建模块，这些是协议特定的智能合约集，它们在单个交易中以组合方式使用，并封装了执行特定金融服务（如加密资产交换或借贷）的逻辑。我们提出了一种基于智能合约属性和智能合约调用的图结构将这些模块分类进集群的方法。我们利用GRL从构建模块创建嵌入向量，并利用凝聚模型对其进行聚类。为了评估它们是否有效地分组为具有相似功能的集群，我们将它们与八个金融功能类别关联，并将此信息用作目标l",
    "tldr": "该研究通过采用图表示学习算法，提出了一种方法来研究去中心化金融协议提供的服务之间的相似性，并成功将这些服务分组为具有相似功能的集群。",
    "en_tdlr": "This study investigates similarities across services offered by Decentralized Finance (DeFi) protocols using graph representation learning algorithms, effectively grouping them into clusters of similar functionalities."
}