{
    "title": "A Universal Deep Neural Network for Signal Detection in Wireless Communication Systems",
    "abstract": "arXiv:2404.02648v1 Announce Type: cross  Abstract: Recently, deep learning (DL) has been emerging as a promising approach for channel estimation and signal detection in wireless communications. The majority of the existing studies investigating the use of DL techniques in this domain focus on analysing channel impulse responses that are generated from only one channel distribution such as additive white Gaussian channel noise and Rayleigh channels. In practice, to cope with the dynamic nature of the wireless channel, DL methods must be re-trained on newly non-aged collected data which is costly, inefficient, and impractical. To tackle this challenge, this paper proposes a novel universal deep neural network (Uni-DNN) that can achieve high detection performance in various wireless environments without retraining the model. In particular, our proposed Uni-DNN model consists of a wireless channel classifier and a signal detector which are constructed by using DNNs. The wireless channel cl",
    "link": "https://arxiv.org/abs/2404.02648",
    "context": "Title: A Universal Deep Neural Network for Signal Detection in Wireless Communication Systems\nAbstract: arXiv:2404.02648v1 Announce Type: cross  Abstract: Recently, deep learning (DL) has been emerging as a promising approach for channel estimation and signal detection in wireless communications. The majority of the existing studies investigating the use of DL techniques in this domain focus on analysing channel impulse responses that are generated from only one channel distribution such as additive white Gaussian channel noise and Rayleigh channels. In practice, to cope with the dynamic nature of the wireless channel, DL methods must be re-trained on newly non-aged collected data which is costly, inefficient, and impractical. To tackle this challenge, this paper proposes a novel universal deep neural network (Uni-DNN) that can achieve high detection performance in various wireless environments without retraining the model. In particular, our proposed Uni-DNN model consists of a wireless channel classifier and a signal detector which are constructed by using DNNs. The wireless channel cl",
    "path": "papers/24/04/2404.02648.json",
    "total_tokens": 785,
    "translated_title": "一种用于无线通信系统信号检测的通用深度神经网络",
    "translated_abstract": "深度学习（DL）近来作为无线通信中信道估计和信号检测的一种有前途的方法不断涌现。现有研究主要关注分析来自单一信道分布（如加性白噪声信道和瑞利信道）生成的信道脉冲响应。在实践中，为了应对无线信道动态性，DL方法必须在新收集的数据上重新训练，这昂贵、低效且不切实际。为解决这一挑战，本文提出了一种新颖的通用深度神经网络（Uni-DNN），可以在各种无线环境中实现高性能检测，无需重新训练模型。具体而言，我们提出的Uni-DNN模型包括无线信道分类器和信号检测器，分别使用DNN构建。",
    "tldr": "提出了一种无需重新训练模型即可在各种无线环境中实现高性能检测的通用深度神经网络。",
    "en_tdlr": "Introduced a universal deep neural network that achieves high performance detection in various wireless environments without the need for retraining the model."
}