{
    "title": "Rematch: Robust and Efficient Matching of Local Knowledge Graphs to Improve Structural and Semantic Similarity",
    "abstract": "arXiv:2404.02126v1 Announce Type: new  Abstract: Knowledge graphs play a pivotal role in various applications, such as question-answering and fact-checking. Abstract Meaning Representation (AMR) represents text as knowledge graphs. Evaluating the quality of these graphs involves matching them structurally to each other and semantically to the source text. Existing AMR metrics are inefficient and struggle to capture semantic similarity. We also lack a systematic evaluation benchmark for assessing structural similarity between AMR graphs. To overcome these limitations, we introduce a novel AMR similarity metric, rematch, alongside a new evaluation for structural similarity called RARE. Among state-of-the-art metrics, rematch ranks second in structural similarity; and first in semantic similarity by 1--5 percentage points on the STS-B and SICK-R benchmarks. Rematch is also five times faster than the next most efficient metric.",
    "link": "https://arxiv.org/abs/2404.02126",
    "context": "Title: Rematch: Robust and Efficient Matching of Local Knowledge Graphs to Improve Structural and Semantic Similarity\nAbstract: arXiv:2404.02126v1 Announce Type: new  Abstract: Knowledge graphs play a pivotal role in various applications, such as question-answering and fact-checking. Abstract Meaning Representation (AMR) represents text as knowledge graphs. Evaluating the quality of these graphs involves matching them structurally to each other and semantically to the source text. Existing AMR metrics are inefficient and struggle to capture semantic similarity. We also lack a systematic evaluation benchmark for assessing structural similarity between AMR graphs. To overcome these limitations, we introduce a novel AMR similarity metric, rematch, alongside a new evaluation for structural similarity called RARE. Among state-of-the-art metrics, rematch ranks second in structural similarity; and first in semantic similarity by 1--5 percentage points on the STS-B and SICK-R benchmarks. Rematch is also five times faster than the next most efficient metric.",
    "path": "papers/24/04/2404.02126.json",
    "total_tokens": 845,
    "translated_title": "重新比赛：改进本地知识图的鲁棒和高效匹配以提高结构和语义相似性",
    "translated_abstract": "知识图在各种应用中发挥着关键作用，例如问答和事实核查。抽象意义表示（AMR）将文本表示为知识图。评估这些图的质量涉及将它们结构化匹配到彼此和语义匹配到源文本。现有的AMR度量效率低，难以捕捉语义相似性。我们也缺乏一个系统性的评估基准，用于评估AMR图之间的结构相似性。为了克服这些限制，我们引入了一种新的AMR相似度度量rematch，以及一种用于评估结构相似性的新评估方法RARE。在最先进的度量中，rematch在结构相似性中排名第二；并且在STS-B和SICK-R基准上的语义相似性最高，与下一个最高效度量相比快五倍。",
    "tldr": "引入一种新的AMR相似度度量rematch以提高结构和语义相似性，结构相似性排名第二，语义相似性最优，快五倍于下一个最高效度量。",
    "en_tdlr": "Introducing a new AMR similarity metric, rematch, to improve structural and semantic similarity, ranking second in structural similarity, first in semantic similarity, and five times faster than the next most efficient metric."
}