{
    "title": "Information Cascade Prediction under Public Emergencies: A Survey",
    "abstract": "arXiv:2404.01319v1 Announce Type: cross  Abstract: With the advent of the era of big data, massive information, expert experience, and high-accuracy models bring great opportunities to the information cascade prediction of public emergencies. However, the involvement of specialist knowledge from various disciplines has resulted in a primarily application-specific focus (e.g., earthquakes, floods, infectious diseases) for information cascade prediction of public emergencies. The lack of a unified prediction framework poses a challenge for classifying intersectional prediction methods across different application fields. This survey paper offers a systematic classification and summary of information cascade modeling, prediction, and application. We aim to help researchers identify cutting-edge research and comprehend models and methods of information cascade prediction under public emergencies. By summarizing open issues and outlining future directions in this field, this paper has the p",
    "link": "https://arxiv.org/abs/2404.01319",
    "context": "Title: Information Cascade Prediction under Public Emergencies: A Survey\nAbstract: arXiv:2404.01319v1 Announce Type: cross  Abstract: With the advent of the era of big data, massive information, expert experience, and high-accuracy models bring great opportunities to the information cascade prediction of public emergencies. However, the involvement of specialist knowledge from various disciplines has resulted in a primarily application-specific focus (e.g., earthquakes, floods, infectious diseases) for information cascade prediction of public emergencies. The lack of a unified prediction framework poses a challenge for classifying intersectional prediction methods across different application fields. This survey paper offers a systematic classification and summary of information cascade modeling, prediction, and application. We aim to help researchers identify cutting-edge research and comprehend models and methods of information cascade prediction under public emergencies. By summarizing open issues and outlining future directions in this field, this paper has the p",
    "path": "papers/24/04/2404.01319.json",
    "total_tokens": 871,
    "translated_title": "公共紧急事件下信息级联预测：一项调查",
    "translated_abstract": "随着大数据时代的到来，海量信息、专家经验和高准确度模型为公共紧急事件下信息级联预测带来了巨大机遇。然而，来自各个学科的专业知识的参与导致了信息级联预测主要集中在特定应用领域（如地震、洪灾、传染病）上。缺乏一个统一的预测框架对跨不同应用领域中的交叉预测方法的分类构成了挑战。本调查论文提供了信息级联建模、预测和应用的系统分类和总结。我们旨在帮助研究人员识别前沿研究，并理解公共紧急事件下信息级联预测的模型和方法。通过总结待解决问题并概述该领域的未来方向，本文对该领域的信息级联预测具有重要的参考价值。",
    "tldr": "大数据时代带来了公共紧急事件下信息级联预测的机遇，但应用领域限制了跨学科预测方法的统一框架，该调查论文系统分类和总结了这一领域，为研究人员提供了前沿研究和未来方向。",
    "en_tdlr": "The era of big data has provided great opportunities for information cascade prediction under public emergencies, but the application-specific focus has restricted a unified framework for interdisciplinary prediction methods. This survey paper systematically classifies and summarizes this field, offering researchers insights into cutting-edge research and future directions."
}