{
    "title": "A finite operator learning technique for mapping the elastic properties of microstructures to their mechanical deformations",
    "abstract": "arXiv:2404.00074v1 Announce Type: new  Abstract: To develop faster solvers for governing physical equations in solid mechanics, we introduce a method that parametrically learns the solution to mechanical equilibrium. The introduced method outperforms traditional ones in terms of computational cost while acceptably maintaining accuracy. Moreover, it generalizes and enhances the standard physics-informed neural networks to learn a parametric solution with rather sharp discontinuities. We focus on micromechanics as an example, where the knowledge of the micro-mechanical solution, i.e., deformation and stress fields for a given heterogeneous microstructure, is crucial. The parameter under investigation is the Young modulus distribution within the heterogeneous solid system. Our method, inspired by operator learning and the finite element method, demonstrates the ability to train without relying on data from other numerical solvers. Instead, we leverage ideas from the finite element approac",
    "link": "https://arxiv.org/abs/2404.00074",
    "context": "Title: A finite operator learning technique for mapping the elastic properties of microstructures to their mechanical deformations\nAbstract: arXiv:2404.00074v1 Announce Type: new  Abstract: To develop faster solvers for governing physical equations in solid mechanics, we introduce a method that parametrically learns the solution to mechanical equilibrium. The introduced method outperforms traditional ones in terms of computational cost while acceptably maintaining accuracy. Moreover, it generalizes and enhances the standard physics-informed neural networks to learn a parametric solution with rather sharp discontinuities. We focus on micromechanics as an example, where the knowledge of the micro-mechanical solution, i.e., deformation and stress fields for a given heterogeneous microstructure, is crucial. The parameter under investigation is the Young modulus distribution within the heterogeneous solid system. Our method, inspired by operator learning and the finite element method, demonstrates the ability to train without relying on data from other numerical solvers. Instead, we leverage ideas from the finite element approac",
    "path": "papers/24/04/2404.00074.json",
    "total_tokens": 858,
    "translated_title": "一种用于将微结构的弹性属性映射到其机械变形的有限算子学习技术",
    "translated_abstract": "为了开发固体力学中控制物理方程的更快求解器，我们引入了一种参数化学习机械平衡解的方法。该方法在计算成本方面优于传统方法，同时保持准确性。此外，它将标准的物理信息神经网络进行了泛化和增强，以学习一个带有相当明显不连续性的参数解。我们以微观力学为例，其中对于给定的异质微结构来说，微观力学解（即变形和应力场）的知识至关重要。我们针对的参数是异质固体系统内的杨氏模量分布。受算子学习和有限元方法的启发，我们的方法展示了无需依赖其他数值求解器数据就能进行训练的能力。相反，我们利用了有限元方法的思想。",
    "tldr": "引入一种有限算子学习技术，通过学习参数化解决了微结构弹性属性映射到机械变形的问题，在计算成本和准确性方面优于传统方法，并能处理具有明显不连续性的解。"
}