{
    "title": "A Survey on Hypergraph Neural Networks: An In-Depth and Step-By-Step Guide",
    "abstract": "arXiv:2404.01039v1 Announce Type: new  Abstract: Higher-order interactions (HOIs) are ubiquitous in real-world complex systems and applications, and thus investigation of deep learning for HOIs has become a valuable agenda for the data mining and machine learning communities. As networks of HOIs are expressed mathematically as hypergraphs, hypergraph neural networks (HNNs) have emerged as a powerful tool for representation learning on hypergraphs. Given the emerging trend, we present the first survey dedicated to HNNs, with an in-depth and step-by-step guide. Broadly, the present survey overviews HNN architectures, training strategies, and applications. First, we break existing HNNs down into four design components: (i) input features, (ii) input structures, (iii) message-passing schemes, and (iv) training strategies. Second, we examine how HNNs address and learn HOIs with each of their components. Third, we overview the recent applications of HNNs in recommendation, biological and med",
    "link": "https://arxiv.org/abs/2404.01039",
    "context": "Title: A Survey on Hypergraph Neural Networks: An In-Depth and Step-By-Step Guide\nAbstract: arXiv:2404.01039v1 Announce Type: new  Abstract: Higher-order interactions (HOIs) are ubiquitous in real-world complex systems and applications, and thus investigation of deep learning for HOIs has become a valuable agenda for the data mining and machine learning communities. As networks of HOIs are expressed mathematically as hypergraphs, hypergraph neural networks (HNNs) have emerged as a powerful tool for representation learning on hypergraphs. Given the emerging trend, we present the first survey dedicated to HNNs, with an in-depth and step-by-step guide. Broadly, the present survey overviews HNN architectures, training strategies, and applications. First, we break existing HNNs down into four design components: (i) input features, (ii) input structures, (iii) message-passing schemes, and (iv) training strategies. Second, we examine how HNNs address and learn HOIs with each of their components. Third, we overview the recent applications of HNNs in recommendation, biological and med",
    "path": "papers/24/04/2404.01039.json",
    "total_tokens": 941,
    "translated_title": "基于超图神经网络的调查：深入和分步指南",
    "translated_abstract": "高阶相互作用在现实世界中的复杂系统和应用中无处不在，因此，对于高阶相互作用的深度学习已成为数据挖掘和机器学习社区的一项重要议程。由于高阶相互作用网络在数学上被表达为超图，超图神经网络（HNNs）已成为在超图上进行表示学习的强大工具。鉴于这一新趋势，我们提出了首份致力于HNNs的调查报告，其中包含深入和分步指南。总体而言，本调查概述了HNN架构、训练策略和应用。首先，我们将现有的HNNs分解为四个设计组成部分：（i）输入特征，（ii）输入结构，（iii）消息传递方案，和（iv）训练策略。其次，我们考察HNNs如何通过各自的组成部分处理和学习高阶相互作用。第三，我们总结了HNNs在推荐、生物和医学中的最新应用。",
    "tldr": "该研究是第一份致力于超图神经网络的调查报告，深入介绍了HNN架构、训练策略和应用，为从事数据挖掘和机器学习的研究人员提供了重要的指导。",
    "en_tdlr": "This study is the first survey dedicated to hypergraph neural networks, providing an in-depth overview of HNN architectures, training strategies, and applications, which offers important guidance for researchers in the field of data mining and machine learning."
}