{
    "title": "DiffAgent: Fast and Accurate Text-to-Image API Selection with Large Language Model",
    "abstract": "arXiv:2404.01342v1 Announce Type: cross  Abstract: Text-to-image (T2I) generative models have attracted significant attention and found extensive applications within and beyond academic research. For example, the Civitai community, a platform for T2I innovation, currently hosts an impressive array of 74,492 distinct models. However, this diversity presents a formidable challenge in selecting the most appropriate model and parameters, a process that typically requires numerous trials. Drawing inspiration from the tool usage research of large language models (LLMs), we introduce DiffAgent, an LLM agent designed to screen the accurate selection in seconds via API calls. DiffAgent leverages a novel two-stage training framework, SFTA, enabling it to accurately align T2I API responses with user input in accordance with human preferences. To train and evaluate DiffAgent's capabilities, we present DABench, a comprehensive dataset encompassing an extensive range of T2I APIs from the community. ",
    "link": "https://arxiv.org/abs/2404.01342",
    "context": "Title: DiffAgent: Fast and Accurate Text-to-Image API Selection with Large Language Model\nAbstract: arXiv:2404.01342v1 Announce Type: cross  Abstract: Text-to-image (T2I) generative models have attracted significant attention and found extensive applications within and beyond academic research. For example, the Civitai community, a platform for T2I innovation, currently hosts an impressive array of 74,492 distinct models. However, this diversity presents a formidable challenge in selecting the most appropriate model and parameters, a process that typically requires numerous trials. Drawing inspiration from the tool usage research of large language models (LLMs), we introduce DiffAgent, an LLM agent designed to screen the accurate selection in seconds via API calls. DiffAgent leverages a novel two-stage training framework, SFTA, enabling it to accurately align T2I API responses with user input in accordance with human preferences. To train and evaluate DiffAgent's capabilities, we present DABench, a comprehensive dataset encompassing an extensive range of T2I APIs from the community. ",
    "path": "papers/24/04/2404.01342.json",
    "total_tokens": 797,
    "translated_title": "DiffAgent：使用大语言模型实现快速准确的文本到图像API选择",
    "translated_abstract": "文本到图像（T2I）生成模型引起了广泛关注，并在学术研究以及其他领域找到了广泛应用。本文中，我们从大语言模型（LLMs）的工具使用研究中汲取灵感，引入了DiffAgent，这是一个经过设计用于通过API调用在几秒钟内进行准确选择的LLM代理。DiffAgent利用了一种全新的两阶段训练框架SFTA，使其能够根据用户偏好精确地将T2I API响应与用户输入对齐。为了训练和评估DiffAgent的能力，我们提出了DABench，这是一个包含大量T2I API的综合数据集，来自社区。",
    "tldr": "DiffAgent利用大语言模型设计了一个新的代理工具，能够快速准确地选择最适合的文本到图像API，并提出了一个综合数据集DABench来评估其性能。",
    "en_tdlr": "DiffAgent leverages a large language model to design a novel agent tool for fast and accurate selection of the most suitable text-to-image API, and introduces a comprehensive dataset DABench to evaluate its performance."
}