{
    "title": "Satellite Federated Edge Learning: Architecture Design and Convergence Analysis",
    "abstract": "arXiv:2404.01875v1 Announce Type: cross  Abstract: The proliferation of low-earth-orbit (LEO) satellite networks leads to the generation of vast volumes of remote sensing data which is traditionally transferred to the ground server for centralized processing, raising privacy and bandwidth concerns. Federated edge learning (FEEL), as a distributed machine learning approach, has the potential to address these challenges by sharing only model parameters instead of raw data. Although promising, the dynamics of LEO networks, characterized by the high mobility of satellites and short ground-to-satellite link (GSL) duration, pose unique challenges for FEEL. Notably, frequent model transmission between the satellites and ground incurs prolonged waiting time and large transmission latency. This paper introduces a novel FEEL algorithm, named FEDMEGA, tailored to LEO mega-constellation networks. By integrating inter-satellite links (ISL) for intra-orbit model aggregation, the proposed algorithm s",
    "link": "https://arxiv.org/abs/2404.01875",
    "context": "Title: Satellite Federated Edge Learning: Architecture Design and Convergence Analysis\nAbstract: arXiv:2404.01875v1 Announce Type: cross  Abstract: The proliferation of low-earth-orbit (LEO) satellite networks leads to the generation of vast volumes of remote sensing data which is traditionally transferred to the ground server for centralized processing, raising privacy and bandwidth concerns. Federated edge learning (FEEL), as a distributed machine learning approach, has the potential to address these challenges by sharing only model parameters instead of raw data. Although promising, the dynamics of LEO networks, characterized by the high mobility of satellites and short ground-to-satellite link (GSL) duration, pose unique challenges for FEEL. Notably, frequent model transmission between the satellites and ground incurs prolonged waiting time and large transmission latency. This paper introduces a novel FEEL algorithm, named FEDMEGA, tailored to LEO mega-constellation networks. By integrating inter-satellite links (ISL) for intra-orbit model aggregation, the proposed algorithm s",
    "path": "papers/24/04/2404.01875.json",
    "total_tokens": 746,
    "translated_title": "卫星联合边缘学习：架构设计与收敛分析",
    "translated_abstract": "低地球轨道（LEO）卫星网络的大量增长导致产生大量遥感数据，传统上这些数据被传输到地面服务器进行集中处理，引发隐私和带宽问题。联合边缘学习（FEEL）作为一种分布式机器学习方法，有潜力通过仅分享模型参数而非原始数据来解决这些挑战。本文介绍了一种针对LEO超级星座网络量身定制的新型FEEL算法，名为FEDMEGA，通过整合卫星间链接（ISL）进行轨道内模型聚合。",
    "tldr": "本文引入了一种针对低地球轨道卫星网络的新型FEEL算法FEDMEGA，通过整合卫星间链接（ISL）进行轨道内模型聚合。",
    "en_tdlr": "This paper introduces a novel FEEL algorithm, named FEDMEGA, tailored to LEO mega-constellation networks by integrating inter-satellite links (ISL) for intra-orbit model aggregation."
}