{
    "title": "Entertainment chatbot for the digital inclusion of elderly people without abstraction capabilities",
    "abstract": "arXiv:2404.01327v1 Announce Type: cross  Abstract: Current language processing technologies allow the creation of conversational chatbot platforms. Even though artificial intelligence is still too immature to support satisfactory user experience in many mass market domains, conversational interfaces have found their way into ad hoc applications such as call centres and online shopping assistants. However, they have not been applied so far to social inclusion of elderly people, who are particularly vulnerable to the digital divide. Many of them relieve their loneliness with traditional media such as TV and radio, which are known to create a feeling of companionship. In this paper we present the EBER chatbot, designed to reduce the digital gap for the elderly. EBER reads news in the background and adapts its responses to the user's mood. Its novelty lies in the concept of \"intelligent radio\", according to which, instead of simplifying a digital information system to make it accessible to",
    "link": "https://arxiv.org/abs/2404.01327",
    "context": "Title: Entertainment chatbot for the digital inclusion of elderly people without abstraction capabilities\nAbstract: arXiv:2404.01327v1 Announce Type: cross  Abstract: Current language processing technologies allow the creation of conversational chatbot platforms. Even though artificial intelligence is still too immature to support satisfactory user experience in many mass market domains, conversational interfaces have found their way into ad hoc applications such as call centres and online shopping assistants. However, they have not been applied so far to social inclusion of elderly people, who are particularly vulnerable to the digital divide. Many of them relieve their loneliness with traditional media such as TV and radio, which are known to create a feeling of companionship. In this paper we present the EBER chatbot, designed to reduce the digital gap for the elderly. EBER reads news in the background and adapts its responses to the user's mood. Its novelty lies in the concept of \"intelligent radio\", according to which, instead of simplifying a digital information system to make it accessible to",
    "path": "papers/24/04/2404.01327.json",
    "total_tokens": 900,
    "translated_title": "无抽象能力的老年人数字包容娱乐聊天机器人",
    "translated_abstract": "当前的语言处理技术允许创建对话式聊天机器人平台。尽管人工智能在许多大众市场领域仍然过于不成熟，无法支持令人满意的用户体验，但对话式界面已经在临时应用中找到了自己的位置，比如电话中心和在线购物助手。然而，目前还没有将其应用于老年人的社会包容，老年人特别容易受到数字鸿沟的影响。许多老年人通过传统媒体如电视和广播来减轻孤独感，这些媒体被认为是创造陪伴感的方式。在本文中，我们介绍了旨在减少老年人数字鸿沟的EBER聊天机器人。EBER会在后台阅读新闻，并根据用户的心情调整回复。其创新之处在于“智能电台”概念，根据该概念，不是简化数字信息系统以使其易于访问，而是根据用户的心情和需求提供相关信息。",
    "tldr": "EBER chatbot是一个旨在减少老年人数字鸿沟的娱乐聊天机器人，其创新之处在于其\"智能电台\"概念，根据用户的心情和需求提供相关信息。",
    "en_tdlr": "The EBER chatbot is designed to reduce the digital gap for elderly people, with its novelty lying in the concept of \"intelligent radio\" that provides relevant information based on user's mood and needs."
}