{
    "title": "Measuring Style Similarity in Diffusion Models",
    "abstract": "arXiv:2404.01292v1 Announce Type: cross  Abstract: Generative models are now widely used by graphic designers and artists. Prior works have shown that these models remember and often replicate content from their training data during generation. Hence as their proliferation increases, it has become important to perform a database search to determine whether the properties of the image are attributable to specific training data, every time before a generated image is used for professional purposes. Existing tools for this purpose focus on retrieving images of similar semantic content. Meanwhile, many artists are concerned with style replication in text-to-image models. We present a framework for understanding and extracting style descriptors from images. Our framework comprises a new dataset curated using the insight that style is a subjective property of an image that captures complex yet meaningful interactions of factors including but not limited to colors, textures, shapes, etc. We a",
    "link": "https://arxiv.org/abs/2404.01292",
    "context": "Title: Measuring Style Similarity in Diffusion Models\nAbstract: arXiv:2404.01292v1 Announce Type: cross  Abstract: Generative models are now widely used by graphic designers and artists. Prior works have shown that these models remember and often replicate content from their training data during generation. Hence as their proliferation increases, it has become important to perform a database search to determine whether the properties of the image are attributable to specific training data, every time before a generated image is used for professional purposes. Existing tools for this purpose focus on retrieving images of similar semantic content. Meanwhile, many artists are concerned with style replication in text-to-image models. We present a framework for understanding and extracting style descriptors from images. Our framework comprises a new dataset curated using the insight that style is a subjective property of an image that captures complex yet meaningful interactions of factors including but not limited to colors, textures, shapes, etc. We a",
    "path": "papers/24/04/2404.01292.json",
    "total_tokens": 828,
    "translated_title": "在扩散模型中测量风格相似性",
    "translated_abstract": "arXiv:2404.01292v1 公告类型：交叉 抽象：生成模型现在被广泛应用于图形设计师和艺术家。先前的作品表明，这些模型在生成过程中会记住并经常复制其训练数据中的内容。因此，随着它们的普及增加，每次在将生成的图像用于专业用途之前，执行数据库搜索以确定图像的属性是否归因于特定的训练数据变得越来越重要。现有工具旨在检索具有相似语义内容的图像。与此同时，许多艺术家关注文本到图像模型中的风格复制。我们提出了一个框架来理解和提取图像的风格描述符。我们的框架包括使用这样一种洞察力筛选的新数据集，即风格是图像的主观属性，捕捉到包括但不限于颜色、纹理、形状等因素的复杂而有意义的相互作用。",
    "tldr": "提出了一个新的框架，用于理解和提取图像的风格描述符，通过新数据集和研究呈现了一种了解图像风格相似性的方法。"
}