{
    "title": "CIRP: Cross-Item Relational Pre-training for Multimodal Product Bundling",
    "abstract": "arXiv:2404.01735v1 Announce Type: new  Abstract: Product bundling has been a prevailing marketing strategy that is beneficial in the online shopping scenario. Effective product bundling methods depend on high-quality item representations, which need to capture both the individual items' semantics and cross-item relations. However, previous item representation learning methods, either feature fusion or graph learning, suffer from inadequate cross-modal alignment and struggle to capture the cross-item relations for cold-start items. Multimodal pre-train models could be the potential solutions given their promising performance on various multimodal downstream tasks. However, the cross-item relations have been under-explored in the current multimodal pre-train models. To bridge this gap, we propose a novel and simple framework Cross-Item Relational Pre-training (CIRP) for item representation learning in product bundling. Specifically, we employ a multimodal encoder to generate image and te",
    "link": "https://arxiv.org/abs/2404.01735",
    "context": "Title: CIRP: Cross-Item Relational Pre-training for Multimodal Product Bundling\nAbstract: arXiv:2404.01735v1 Announce Type: new  Abstract: Product bundling has been a prevailing marketing strategy that is beneficial in the online shopping scenario. Effective product bundling methods depend on high-quality item representations, which need to capture both the individual items' semantics and cross-item relations. However, previous item representation learning methods, either feature fusion or graph learning, suffer from inadequate cross-modal alignment and struggle to capture the cross-item relations for cold-start items. Multimodal pre-train models could be the potential solutions given their promising performance on various multimodal downstream tasks. However, the cross-item relations have been under-explored in the current multimodal pre-train models. To bridge this gap, we propose a novel and simple framework Cross-Item Relational Pre-training (CIRP) for item representation learning in product bundling. Specifically, we employ a multimodal encoder to generate image and te",
    "path": "papers/24/04/2404.01735.json",
    "total_tokens": 836,
    "translated_title": "CIRP: 跨项目关系预训练用于多模态产品捆绑",
    "translated_abstract": "产品捆绑一直是一种盛行的营销策略，对在线购物场景有益。有效的产品捆绑方法取决于捕获个体项目语义和跨项目关系的高质量项目表示。然而，先前的项目表示学习方法，无论是特征融合还是图形学习，都存在跨模态对齐不足并且难以捕捉冷启动项目的跨项目关系。多模态预训练模型可能是潜在的解决方案，因为它们在各种多模态下游任务上表现出色。然而，当前多模态预训练模型中的跨项目关系尚未得到充分探索。为了弥合这一差距，我们提出了一种新颖且简单的框架Cross-Item Relational Pre-training（CIRP），用于产品捆绑中的项目表示学习。具体来说，我们采用多模态编码器生成图像和文字",
    "tldr": "提出了一种名为CIRP的框架，用于产品捆绑中的项目表示学习，旨在解决先前方法中对跨项目关系的不足。",
    "en_tdlr": "Introducing a framework named CIRP for item representation learning in product bundling, aiming to address the shortcomings in capturing cross-item relations in previous methods."
}