{
    "title": "Versatile Navigation under Partial Observability via Value-guided Diffusion Policy",
    "abstract": "arXiv:2404.02176v1 Announce Type: cross  Abstract: Route planning for navigation under partial observability plays a crucial role in modern robotics and autonomous driving. Existing route planning approaches can be categorized into two main classes: traditional autoregressive and diffusion-based methods. The former often fails due to its myopic nature, while the latter either assumes full observability or struggles to adapt to unfamiliar scenarios, due to strong couplings with behavior cloning from experts. To address these deficiencies, we propose a versatile diffusion-based approach for both 2D and 3D route planning under partial observability. Specifically, our value-guided diffusion policy first generates plans to predict actions across various timesteps, providing ample foresight to the planning. It then employs a differentiable planner with state estimations to derive a value function, directing the agent's exploration and goal-seeking behaviors without seeking experts while expl",
    "link": "https://arxiv.org/abs/2404.02176",
    "context": "Title: Versatile Navigation under Partial Observability via Value-guided Diffusion Policy\nAbstract: arXiv:2404.02176v1 Announce Type: cross  Abstract: Route planning for navigation under partial observability plays a crucial role in modern robotics and autonomous driving. Existing route planning approaches can be categorized into two main classes: traditional autoregressive and diffusion-based methods. The former often fails due to its myopic nature, while the latter either assumes full observability or struggles to adapt to unfamiliar scenarios, due to strong couplings with behavior cloning from experts. To address these deficiencies, we propose a versatile diffusion-based approach for both 2D and 3D route planning under partial observability. Specifically, our value-guided diffusion policy first generates plans to predict actions across various timesteps, providing ample foresight to the planning. It then employs a differentiable planner with state estimations to derive a value function, directing the agent's exploration and goal-seeking behaviors without seeking experts while expl",
    "path": "papers/24/04/2404.02176.json",
    "total_tokens": 904,
    "translated_title": "通过价值引导扩散策略实现部分可观察性下的多功能导航",
    "translated_abstract": "在现代机器人技术和自动驾驶中，针对部分可观察性下的导航路线规划起着至关重要的作用。现有的路线规划方法可分为传统自回归和基于扩散的两个主要类别。前者常常由于其近视特性而失败，而后者要么假设完全可观察性，要么在与来自专家的行为克隆的强耦合下难以适应陌生情形。为了解决这些缺陷，我们提出了一种适用于部分可观察性下的2D和3D路线规划的多功能扩散方法。具体而言，我们的价值引导扩散策略首先生成计划以预测各个时间步的动作，为规划提供充分的远见。然后，它利用具有状态估计的可微分规划器得出值函数，指导代理的探索和寻找目标的行为，而无需寻求专家的帮助。",
    "tldr": "提出一种适用于部分可观察性下的多功能扩散方法，通过价值引导扩散策略实现2D和3D路线规划，提供充分远见并指导代理的探索和目标寻找行为，无需专家干预",
    "en_tdlr": "Proposed a versatile diffusion-based approach for navigation under partial observability, utilizing a value-guided diffusion policy for 2D and 3D route planning, providing ample foresight and guiding agent's exploration and goal-seeking behaviors without expert intervention."
}