{
    "title": "On the Importance of Uncertainty in Decision-Making with Large Language Models",
    "abstract": "arXiv:2404.02649v1 Announce Type: new  Abstract: We investigate the role of uncertainty in decision-making problems with natural language as input. For such tasks, using Large Language Models as agents has become the norm. However, none of the recent approaches employ any additional phase for estimating the uncertainty the agent has about the world during the decision-making task. We focus on a fundamental decision-making framework with natural language as input, which is the one of contextual bandits, where the context information consists of text. As a representative of the approaches with no uncertainty estimation, we consider an LLM bandit with a greedy policy, which picks the action corresponding to the largest predicted reward. We compare this baseline to LLM bandits that make active use of uncertainty estimation by integrating the uncertainty in a Thompson Sampling policy. We employ different techniques for uncertainty estimation, such as Laplace Approximation, Dropout, and Epin",
    "link": "https://arxiv.org/abs/2404.02649",
    "context": "Title: On the Importance of Uncertainty in Decision-Making with Large Language Models\nAbstract: arXiv:2404.02649v1 Announce Type: new  Abstract: We investigate the role of uncertainty in decision-making problems with natural language as input. For such tasks, using Large Language Models as agents has become the norm. However, none of the recent approaches employ any additional phase for estimating the uncertainty the agent has about the world during the decision-making task. We focus on a fundamental decision-making framework with natural language as input, which is the one of contextual bandits, where the context information consists of text. As a representative of the approaches with no uncertainty estimation, we consider an LLM bandit with a greedy policy, which picks the action corresponding to the largest predicted reward. We compare this baseline to LLM bandits that make active use of uncertainty estimation by integrating the uncertainty in a Thompson Sampling policy. We employ different techniques for uncertainty estimation, such as Laplace Approximation, Dropout, and Epin",
    "path": "papers/24/04/2404.02649.json",
    "total_tokens": 844,
    "translated_title": "论决策中不确定性的重要性与大型语言模型",
    "translated_abstract": "我们调查了自然语言输入的决策问题中不确定性的作用。对于这样的任务，使用大型语言模型作为代理已经成为常态。然而，最近的方法中没有任何一个额外的阶段用于估计代理在决策任务中对世界的不确定性。我们关注以自然语言为输入的基本决策框架之一，即上下文臂，其中上下文信息包括文本。作为没有不确定性估计的方法代表，我们考虑一个带有贪婪策略的LLM臂，该策略选择对应于最大预测奖励的动作。我们将此基准与通过将不确定性集成到汤普森抽样策略中积极利用不确定性估计的LLM臂进行比较。我们采用不同的技术进行不确定性估计，例如拉普拉斯近似、辍学和Epin。",
    "tldr": "本研究调查了使用大型语言模型作为代理进行自然语言输入决策问题时，不确定性估计的重要性，并提出了集成不确定性估计到汤普森抽样策略的方法。",
    "en_tdlr": "This research investigates the importance of uncertainty estimation when using large language models as agents for decision-making with natural language inputs, and proposes a method to integrate uncertainty estimation into Thompson Sampling policy."
}