{
    "title": "Empowering Biomedical Discovery with AI Agents",
    "abstract": "arXiv:2404.02831v1 Announce Type: new  Abstract: We envision 'AI scientists' as systems capable of skeptical learning and reasoning that empower biomedical research through collaborative agents that integrate machine learning tools with experimental platforms. Rather than taking humans out of the discovery process, biomedical AI agents combine human creativity and expertise with AI's ability to analyze large datasets, navigate hypothesis spaces, and execute repetitive tasks. AI agents are proficient in a variety of tasks, including self-assessment and planning of discovery workflows. These agents use large language models and generative models to feature structured memory for continual learning and use machine learning tools to incorporate scientific knowledge, biological principles, and theories. AI agents can impact areas ranging from hybrid cell simulation, programmable control of phenotypes, and the design of cellular circuits to the development of new therapies.",
    "link": "https://arxiv.org/abs/2404.02831",
    "context": "Title: Empowering Biomedical Discovery with AI Agents\nAbstract: arXiv:2404.02831v1 Announce Type: new  Abstract: We envision 'AI scientists' as systems capable of skeptical learning and reasoning that empower biomedical research through collaborative agents that integrate machine learning tools with experimental platforms. Rather than taking humans out of the discovery process, biomedical AI agents combine human creativity and expertise with AI's ability to analyze large datasets, navigate hypothesis spaces, and execute repetitive tasks. AI agents are proficient in a variety of tasks, including self-assessment and planning of discovery workflows. These agents use large language models and generative models to feature structured memory for continual learning and use machine learning tools to incorporate scientific knowledge, biological principles, and theories. AI agents can impact areas ranging from hybrid cell simulation, programmable control of phenotypes, and the design of cellular circuits to the development of new therapies.",
    "path": "papers/24/04/2404.02831.json",
    "total_tokens": 786,
    "translated_title": "利用AI代理赋能生物医学发现",
    "translated_abstract": "我们设想“AI科学家”作为系统，能够进行怀疑性学习和推理，通过将机器学习工具与实验平台集成的协作代理，赋能生物医学研究。生物医学AI代理不是要剔除人类在发现过程中的作用，而是结合人类的创造力和专业知识，利用AI分析大型数据集、导航假设空间，并执行重复性任务的能力。这些代理擅长各种任务，包括自我评估和规划发现工作流程。它们利用大型语言模型和生成模型进行结构化记忆，以便持续学习，并利用机器学习工具整合科学知识、生物原理和理论。AI代理可以影响从混合细胞模拟、可编程控制表型到细胞电路设计以及新疗法开发等领域。",
    "tldr": "AI科学家代理结合人类创造力和专业知识，利用机器学习工具赋能生物医学研究，对多个领域产生影响。",
    "en_tdlr": "AI scientist agents combine human creativity and expertise with machine learning tools to empower biomedical research and impact multiple domains."
}