{
    "title": "Leveraging the Interplay Between Syntactic and Acoustic Cues for Optimizing Korean TTS Pause Formation",
    "abstract": "arXiv:2404.02592v1 Announce Type: new  Abstract: Contemporary neural speech synthesis models have indeed demonstrated remarkable proficiency in synthetic speech generation as they have attained a level of quality comparable to that of human-produced speech. Nevertheless, it is important to note that these achievements have predominantly been verified within the context of high-resource languages such as English. Furthermore, the Tacotron and FastSpeech variants show substantial pausing errors when applied to the Korean language, which affects speech perception and naturalness. In order to address the aforementioned issues, we propose a novel framework that incorporates comprehensive modeling of both syntactic and acoustic cues that are associated with pausing patterns. Remarkably, our framework possesses the capability to consistently generate natural speech even for considerably more extended and intricate out-of-domain (OOD) sentences, despite its training on short audio clips. Archi",
    "link": "https://arxiv.org/abs/2404.02592",
    "context": "Title: Leveraging the Interplay Between Syntactic and Acoustic Cues for Optimizing Korean TTS Pause Formation\nAbstract: arXiv:2404.02592v1 Announce Type: new  Abstract: Contemporary neural speech synthesis models have indeed demonstrated remarkable proficiency in synthetic speech generation as they have attained a level of quality comparable to that of human-produced speech. Nevertheless, it is important to note that these achievements have predominantly been verified within the context of high-resource languages such as English. Furthermore, the Tacotron and FastSpeech variants show substantial pausing errors when applied to the Korean language, which affects speech perception and naturalness. In order to address the aforementioned issues, we propose a novel framework that incorporates comprehensive modeling of both syntactic and acoustic cues that are associated with pausing patterns. Remarkably, our framework possesses the capability to consistently generate natural speech even for considerably more extended and intricate out-of-domain (OOD) sentences, despite its training on short audio clips. Archi",
    "path": "papers/24/04/2404.02592.json",
    "total_tokens": 812,
    "translated_title": "利用句法和声学线索相互作用优化韩语TTS停顿形成",
    "translated_abstract": "当代神经语音合成模型在合成语音生成方面表现出卓越的熟练度，达到了与人类语音相媲美的质量水平。然而，这些成就主要在英语等高资源语言背景下得到验证。此外，当应用于韩语时，Tacotron和FastSpeech变体显示出相当大的停顿错误，影响了语音感知和自然性。为了解决上述问题，我们提出了一个新颖的框架，结合了与停顿模式相关的句法和声学线索的全面建模。值得注意的是，我们的框架具有在培训时显示长度较短的音频剪辑的情况下，即使针对更为复杂的域外（OOD）句子，也能始终生成自然的语音的能力。",
    "tldr": "提出了一个新框架，利用综合建模句法和声学线索，能够在培训时显示短音频剪辑的情况下，为韩语生成自然语音，解决了停顿错误问题"
}