{
    "title": "Unsupervised Occupancy Learning from Sparse Point Cloud",
    "abstract": "arXiv:2404.02759v1 Announce Type: cross  Abstract: Implicit Neural Representations have gained prominence as a powerful framework for capturing complex data modalities, encompassing a wide range from 3D shapes to images and audio. Within the realm of 3D shape representation, Neural Signed Distance Functions (SDF) have demonstrated remarkable potential in faithfully encoding intricate shape geometry. However, learning SDFs from 3D point clouds in the absence of ground truth supervision remains a very challenging task. In this paper, we propose a method to infer occupancy fields instead of SDFs as they are easier to learn from sparse inputs. We leverage a margin-based uncertainty measure to differentially sample from the decision boundary of the occupancy function and supervise the sampled boundary points using the input point cloud. We further stabilize the optimization process at the early stages of the training by biasing the occupancy function towards minimal entropy fields while max",
    "link": "https://arxiv.org/abs/2404.02759",
    "context": "Title: Unsupervised Occupancy Learning from Sparse Point Cloud\nAbstract: arXiv:2404.02759v1 Announce Type: cross  Abstract: Implicit Neural Representations have gained prominence as a powerful framework for capturing complex data modalities, encompassing a wide range from 3D shapes to images and audio. Within the realm of 3D shape representation, Neural Signed Distance Functions (SDF) have demonstrated remarkable potential in faithfully encoding intricate shape geometry. However, learning SDFs from 3D point clouds in the absence of ground truth supervision remains a very challenging task. In this paper, we propose a method to infer occupancy fields instead of SDFs as they are easier to learn from sparse inputs. We leverage a margin-based uncertainty measure to differentially sample from the decision boundary of the occupancy function and supervise the sampled boundary points using the input point cloud. We further stabilize the optimization process at the early stages of the training by biasing the occupancy function towards minimal entropy fields while max",
    "path": "papers/24/04/2404.02759.json",
    "total_tokens": 874,
    "translated_title": "来自稀疏点云的无监督占用学习",
    "translated_abstract": "隐式神经表示已经成为一个强大的框架，可用于捕获复杂的数据模态，涵盖从3D形状到图像和音频等广泛范围。在3D形状表示领域，神经符号距离函数（SDF）展现出从根本上编码复杂形状几何的显著潜力。然而，在没有地面真实监督的情况下，从3D点云中学习SDF仍然是一项非常具有挑战性的任务。在本文中，我们提出了一种方法来推断占用场而不是SDF，因为它们更容易从稀疏输入中学习。我们利用基于边界不确定性的边际测量，不同地从占用函数的决策边界中采样，并使用输入点云监督采样的边界点。我们在训练的早期阶段通过将占用函数偏向最小熵场来进一步稳定优化过程。",
    "tldr": "提出了一种从稀疏输入学习占用场的无监督学习方法，通过基于边界不确定性的采样和最小熵场优化来解决从3D点云学习SDF的挑战",
    "en_tdlr": "Proposed an unsupervised learning method to learn occupancy fields from sparse inputs, addressing the challenge of learning SDF from 3D point clouds through sampling based on boundary uncertainty and optimizing towards minimal entropy fields."
}