{
    "title": "A Likelihood Ratio Test of Genetic Relationship among Languages",
    "abstract": "arXiv:2404.00284v1 Announce Type: new  Abstract: Lexical resemblances among a group of languages indicate that the languages could be genetically related, i.e., they could have descended from a common ancestral language. However, such resemblances can arise by chance and, hence, need not always imply an underlying genetic relationship. Many tests of significance based on permutation of wordlists and word similarity measures appeared in the past to determine the statistical significance of such relationships. We demonstrate that although existing tests may work well for bilateral comparisons, i.e., on pairs of languages, they are either infeasible by design or are prone to yield false positives when applied to groups of languages or language families. To this end, inspired by molecular phylogenetics, we propose a likelihood ratio test to determine if given languages are related based on the proportion of invariant character sites in the aligned wordlists applied during tree inference. F",
    "link": "https://arxiv.org/abs/2404.00284",
    "context": "Title: A Likelihood Ratio Test of Genetic Relationship among Languages\nAbstract: arXiv:2404.00284v1 Announce Type: new  Abstract: Lexical resemblances among a group of languages indicate that the languages could be genetically related, i.e., they could have descended from a common ancestral language. However, such resemblances can arise by chance and, hence, need not always imply an underlying genetic relationship. Many tests of significance based on permutation of wordlists and word similarity measures appeared in the past to determine the statistical significance of such relationships. We demonstrate that although existing tests may work well for bilateral comparisons, i.e., on pairs of languages, they are either infeasible by design or are prone to yield false positives when applied to groups of languages or language families. To this end, inspired by molecular phylogenetics, we propose a likelihood ratio test to determine if given languages are related based on the proportion of invariant character sites in the aligned wordlists applied during tree inference. F",
    "path": "papers/24/04/2404.00284.json",
    "total_tokens": 766,
    "translated_title": "一种语言间遗传关系的似然比检验",
    "translated_abstract": "一组语言之间的词汇相似性表明这些语言可能存在遗传关系，即它们可能源自共同的祖语。然而，这种相似性可能是偶然产生的，并且不总是意味着存在潜在的遗传关系。过去出现过许多基于单词列表和单词相似性度量的置换检验以确定此类关系的统计显著性。我们证明，尽管现有的测试可能对于双边比较（即语言对）效果良好，但当应用于语言组或语言家族时，它们要么由于设计而不可行，要么易于产生假阳性。因此，受到分子系统发生学的启发，我们提出了一种基于对齐单词列表中不变字符位点比例的似然比检验，以确定给定语言是否相关。",
    "tldr": "提出一种受分子系统发生学启发的似然比检验方法，用于确定语言间是否存在遗传关系。",
    "en_tdlr": "Proposed a likelihood ratio test method inspired by molecular phylogenetics to determine if there are genetic relationships among languages."
}