{
    "title": "Real, fake and synthetic faces - does the coin have three sides?",
    "abstract": "arXiv:2404.01878v1 Announce Type: cross  Abstract: With the ever-growing power of generative artificial intelligence, deepfake and artificially generated (synthetic) media have continued to spread online, which creates various ethical and moral concerns regarding their usage. To tackle this, we thus present a novel exploration of the trends and patterns observed in real, deepfake and synthetic facial images. The proposed analysis is done in two parts: firstly, we incorporate eight deep learning models and analyze their performances in distinguishing between the three classes of images. Next, we look to further delve into the similarities and differences between these three sets of images by investigating their image properties both in the context of the entire image as well as in the context of specific regions within the image. ANOVA test was also performed and provided further clarity amongst the patterns associated between the images of the three classes. From our findings, we obser",
    "link": "https://arxiv.org/abs/2404.01878",
    "context": "Title: Real, fake and synthetic faces - does the coin have three sides?\nAbstract: arXiv:2404.01878v1 Announce Type: cross  Abstract: With the ever-growing power of generative artificial intelligence, deepfake and artificially generated (synthetic) media have continued to spread online, which creates various ethical and moral concerns regarding their usage. To tackle this, we thus present a novel exploration of the trends and patterns observed in real, deepfake and synthetic facial images. The proposed analysis is done in two parts: firstly, we incorporate eight deep learning models and analyze their performances in distinguishing between the three classes of images. Next, we look to further delve into the similarities and differences between these three sets of images by investigating their image properties both in the context of the entire image as well as in the context of specific regions within the image. ANOVA test was also performed and provided further clarity amongst the patterns associated between the images of the three classes. From our findings, we obser",
    "path": "papers/24/04/2404.01878.json",
    "total_tokens": 835,
    "translated_title": "真实、虚假和合成面孔 - 币有三面吗？",
    "translated_abstract": "随着生成人工智能的不断增强，Deepfake和人工生成的（合成）媒体继续在网络上传播，引发了关于它们使用的各种伦理和道德关切。为了解决这个问题，我们对真实、Deepfake和合成面部图像中观察到的趋势和模式进行了新颖的探索。提出的分析分为两部分：首先，我们引入了八个深度学习模型，并分析它们在区分这三类图像方面的性能。接下来，我们进一步研究了这三类图像之间的相似之处和差异，通过分析它们的图像特性，既涵盖整个图像的背景，也包括图像内的特定区域。ANOVA测试也被执行，并为这三类图像之间关联的模式提供了进一步的诠释。通过我们的研究结果，我们发现",
    "tldr": "通过分析真实、Deepfake和合成面部图像，研究了它们在图像性质上的相似和不同之处，以及使用了八个深度学习模型进行区分分析。",
    "en_tdlr": "By analyzing real, Deepfake, and synthetic facial images, the study explored the similarities and differences in their image properties, utilizing eight deep learning models for classification."
}