{
    "title": "Can AI Outperform Human Experts in Creating Social Media Creatives?",
    "abstract": "arXiv:2404.00018v1 Announce Type: cross  Abstract: Artificial Intelligence has outperformed human experts in functional tasks such as chess and baduk. How about creative tasks? This paper evaluates AI's capability in the creative domain compared to human experts, which little research has been conducted so far. We propose a novel Prompt-for-Prompt to generate social media creatives via prompt augmentation by Large Language Models. We take the most popular Instagram posts (with the biggest number of like clicks) in top brands' Instagram accounts to create social media creatives. We give GPT 4 several prompt instructions with text descriptions to generate the most effective prompts for cutting-edge text-to-image generators: Midjourney, DALL E 3, and Stable Diffusion. LLM-augmented prompts can boost AI's abilities by adding objectives, engagement strategy, lighting and brand consistency for social media image creation. We conduct an extensive human evaluation experiment, and find that AI ",
    "link": "https://arxiv.org/abs/2404.00018",
    "context": "Title: Can AI Outperform Human Experts in Creating Social Media Creatives?\nAbstract: arXiv:2404.00018v1 Announce Type: cross  Abstract: Artificial Intelligence has outperformed human experts in functional tasks such as chess and baduk. How about creative tasks? This paper evaluates AI's capability in the creative domain compared to human experts, which little research has been conducted so far. We propose a novel Prompt-for-Prompt to generate social media creatives via prompt augmentation by Large Language Models. We take the most popular Instagram posts (with the biggest number of like clicks) in top brands' Instagram accounts to create social media creatives. We give GPT 4 several prompt instructions with text descriptions to generate the most effective prompts for cutting-edge text-to-image generators: Midjourney, DALL E 3, and Stable Diffusion. LLM-augmented prompts can boost AI's abilities by adding objectives, engagement strategy, lighting and brand consistency for social media image creation. We conduct an extensive human evaluation experiment, and find that AI ",
    "path": "papers/24/04/2404.00018.json",
    "total_tokens": 880,
    "translated_title": "人工智能能否超越人类专家在创建社交媒体创意方面？",
    "translated_abstract": "人工智能在象棋和围棋等功能性任务中已经超越了人类专家。那么在创意任务中呢？本文评估了人工智能在创意领域的能力与人类专家相比，迄今为止很少有研究进行。我们提出了一种新颖的Prompt-for-Prompt方法，通过大型语言模型的提示增强生成社交媒体创意。我们选择了顶级品牌Instagram账号中最受欢迎的帖子（获得最多点赞点击）来创建社交媒体创意。我们给GPT 4提供了几个带有文本描述的提示说明，以生成用于最先进的文本到图像生成器（Midjourney、DALL E 3和Stable Diffusion）的最有效提示。通过LLM增强的提示可以通过添加目标、参与策略、灯光和品牌一致性来提升人工智能在社交媒体图像创作方面的能力。我们进行了大规模的人类评估实验，发现人工智能...",
    "tldr": "本文评估了人工智能相对于人类专家在创意领域的表现，并提出了使用大型语言模型增强提示来生成社交媒体创意的新方法。"
}