{
    "title": "On the True Distribution Approximation of Minimum Bayes-Risk Decoding",
    "abstract": "arXiv:2404.00752v1 Announce Type: cross  Abstract: Minimum Bayes-risk (MBR) decoding has recently gained renewed attention in text generation. MBR decoding considers texts sampled from a model as pseudo-references and selects the text with the highest similarity to the others. Therefore, sampling is one of the key elements of MBR decoding, and previous studies reported that the performance varies by sampling methods. From a theoretical standpoint, this performance variation is likely tied to how closely the samples approximate the true distribution of references. However, this approximation has not been the subject of in-depth study. In this study, we propose using anomaly detection to measure the degree of approximation. We first closely examine the performance variation and then show that previous hypotheses about samples do not correlate well with the variation, but our introduced anomaly scores do. The results are the first to empirically support the link between the performance an",
    "link": "https://arxiv.org/abs/2404.00752",
    "context": "Title: On the True Distribution Approximation of Minimum Bayes-Risk Decoding\nAbstract: arXiv:2404.00752v1 Announce Type: cross  Abstract: Minimum Bayes-risk (MBR) decoding has recently gained renewed attention in text generation. MBR decoding considers texts sampled from a model as pseudo-references and selects the text with the highest similarity to the others. Therefore, sampling is one of the key elements of MBR decoding, and previous studies reported that the performance varies by sampling methods. From a theoretical standpoint, this performance variation is likely tied to how closely the samples approximate the true distribution of references. However, this approximation has not been the subject of in-depth study. In this study, we propose using anomaly detection to measure the degree of approximation. We first closely examine the performance variation and then show that previous hypotheses about samples do not correlate well with the variation, but our introduced anomaly scores do. The results are the first to empirically support the link between the performance an",
    "path": "papers/24/04/2404.00752.json",
    "total_tokens": 835,
    "translated_title": "关于最小贝叶斯风险解码的真实分布近似",
    "translated_abstract": "最小贝叶斯风险（MBR）解码最近在文本生成中重新引起关注。MBR解码将从模型中采样的文本视为伪参考，并选择与其他文本最相似的文本。因此，采样是MBR解码的关键元素之一，先前的研究报告称性能因采样方法而异。从理论上讲，这种性能变化很可能与样本如何接近参考真实分布有关。然而，这种近似尚未深入研究。在本研究中，我们提出使用异常检测来衡量逼近程度。我们首先仔细研究性能的变化，然后展示以往关于样本的假设与变化的相关性不佳，但我们引入的异常分数则相关。这些结果是首次凭经验证明了性能和采样近似度之间的联系。",
    "tldr": "本研究提出使用异常检测来衡量最小贝叶斯风险解码中样本接近真实分布的程度，并验证实验结果首次支持了性能与采样近似度之间的联系。",
    "en_tdlr": "This study proposes using anomaly detection to measure the degree of approximation of samples to the true distribution in Minimum Bayes-Risk decoding, and the empirical results validate for the first time the link between performance and sampling approximation."
}