{
    "title": "CuSINeS: Curriculum-driven Structure Induced Negative Sampling for Statutory Article Retrieval",
    "abstract": "arXiv:2404.00590v1 Announce Type: cross  Abstract: In this paper, we introduce CuSINeS, a negative sampling approach to enhance the performance of Statutory Article Retrieval (SAR). CuSINeS offers three key contributions. Firstly, it employs a curriculum-based negative sampling strategy guiding the model to focus on easier negatives initially and progressively tackle more difficult ones. Secondly, it leverages the hierarchical and sequential information derived from the structural organization of statutes to evaluate the difficulty of samples. Lastly, it introduces a dynamic semantic difficulty assessment using the being-trained model itself, surpassing conventional static methods like BM25, adapting the negatives to the model's evolving competence. Experimental results on a real-world expert-annotated SAR dataset validate the effectiveness of CuSINeS across four different baselines, demonstrating its versatility.",
    "link": "https://arxiv.org/abs/2404.00590",
    "context": "Title: CuSINeS: Curriculum-driven Structure Induced Negative Sampling for Statutory Article Retrieval\nAbstract: arXiv:2404.00590v1 Announce Type: cross  Abstract: In this paper, we introduce CuSINeS, a negative sampling approach to enhance the performance of Statutory Article Retrieval (SAR). CuSINeS offers three key contributions. Firstly, it employs a curriculum-based negative sampling strategy guiding the model to focus on easier negatives initially and progressively tackle more difficult ones. Secondly, it leverages the hierarchical and sequential information derived from the structural organization of statutes to evaluate the difficulty of samples. Lastly, it introduces a dynamic semantic difficulty assessment using the being-trained model itself, surpassing conventional static methods like BM25, adapting the negatives to the model's evolving competence. Experimental results on a real-world expert-annotated SAR dataset validate the effectiveness of CuSINeS across four different baselines, demonstrating its versatility.",
    "path": "papers/24/04/2404.00590.json",
    "total_tokens": 820,
    "translated_title": "CuSINeS：基于课程驱动的结构诱导负采样用于法定文章检索",
    "translated_abstract": "在本文中，我们介绍了CuSINeS，这是一种负采样方法，旨在提高法定文章检索（SAR）的性能。CuSINeS提供了三个关键贡献。首先，它采用了基于课程的负采样策略，引导模型首先关注更容易的负样本，逐渐处理更难的样本。其次，它利用从法规结构组织中获得的分层和序列信息来评估样本的难度。最后，它引入了动态语义难度评估，利用正在训练的模型本身，超越传统的静态方法如BM25，使负样本适应模型不断进化的能力。在一个真实世界的专家注释的SAR数据集上的实验证实了CuSINeS在四种不同基线上的有效性，展示了其多功能性。",
    "tldr": "CuSINeS通过课程驱动的负采样策略、结构化法规信息和动态语义难度评估三方面贡献，提升了法定文章检索的效果。",
    "en_tdlr": "CuSINeS enhances the performance of Statutory Article Retrieval through curriculum-driven negative sampling, leveraging hierarchical information from statutes, and dynamic semantic difficulty assessment."
}