{
    "title": "Worker Robot Cooperation and Integration into the Manufacturing Workcell via the Holonic Control Architecture",
    "abstract": "arXiv:2404.00369v1 Announce Type: cross  Abstract: Worker-Robot Cooperation is a new industrial trend, which aims to sum the advantages of both the human and the industrial robot to afford a new intelligent manufacturing techniques. The cooperative manufacturing between the worker and the robot contains other elements such as the product parts and the manufacturing tools. All these production elements must cooperate in one manufacturing workcell to fulfill the production requirements. The manufacturing control system is the mean to connect all these cooperative elements together in one body. This manufacturing control system is distributed and autonomous due to the nature of the cooperative workcell. Accordingly, this article proposes the holonic control architecture as the manufacturing concept of the cooperative workcell. Furthermore, the article focuses on the feasibility of this manufacturing concept, by applying it over a case study that involves the cooperation between a dual-arm",
    "link": "https://arxiv.org/abs/2404.00369",
    "context": "Title: Worker Robot Cooperation and Integration into the Manufacturing Workcell via the Holonic Control Architecture\nAbstract: arXiv:2404.00369v1 Announce Type: cross  Abstract: Worker-Robot Cooperation is a new industrial trend, which aims to sum the advantages of both the human and the industrial robot to afford a new intelligent manufacturing techniques. The cooperative manufacturing between the worker and the robot contains other elements such as the product parts and the manufacturing tools. All these production elements must cooperate in one manufacturing workcell to fulfill the production requirements. The manufacturing control system is the mean to connect all these cooperative elements together in one body. This manufacturing control system is distributed and autonomous due to the nature of the cooperative workcell. Accordingly, this article proposes the holonic control architecture as the manufacturing concept of the cooperative workcell. Furthermore, the article focuses on the feasibility of this manufacturing concept, by applying it over a case study that involves the cooperation between a dual-arm",
    "path": "papers/24/04/2404.00369.json",
    "total_tokens": 759,
    "translated_title": "通过Holonic控制架构实现工人机器人之间的协作与集成",
    "translated_abstract": "工人机器人合作是一种新的工业趋势，旨在综合人类和工业机器人的优势，以提供新的智能制造技术。工人和机器人之间的合作制造包含产品零部件和制造工具等其他元素。所有这些生产元素必须在一个制造工作单元中合作，以满足生产要求。制造控制系统是连接所有这些合作元素的手段。由于合作工作单元的性质，这种制造控制系统是分布式和自主的。因此，本文提出了Holonic控制架构作为合作工作单元的制造概念。此外，本文关注该制造概念的可行性，通过将其应用于涉及双臂协作的案例研究中。",
    "tldr": "本文提出通过Holonic控制架构实现工人机器人之间的协作与集成，以实现新的智能制造技术。",
    "en_tdlr": "This paper proposes the cooperation and integration between workers and robots through the Holonic control architecture to achieve new intelligent manufacturing techniques."
}