{
    "title": "Face It Yourselves: An LLM-Based Two-Stage Strategy to Localize Configuration Errors via Logs",
    "abstract": "arXiv:2404.00640v1 Announce Type: cross  Abstract: Configurable software systems are prone to configuration errors, resulting in significant losses to companies. However, diagnosing these errors is challenging due to the vast and complex configuration space. These errors pose significant challenges for both experienced maintainers and new end-users, particularly those without access to the source code of the software systems. Given that logs are easily accessible to most end-users, we conduct a preliminary study to outline the challenges and opportunities of utilizing logs in localizing configuration errors. Based on the insights gained from the preliminary study, we propose an LLM-based two-stage strategy for end-users to localize the root-cause configuration properties based on logs. We further implement a tool, LogConfigLocalizer, aligned with the design of the aforementioned strategy, hoping to assist end-users in coping with configuration errors through log analysis.   To the best",
    "link": "https://arxiv.org/abs/2404.00640",
    "context": "Title: Face It Yourselves: An LLM-Based Two-Stage Strategy to Localize Configuration Errors via Logs\nAbstract: arXiv:2404.00640v1 Announce Type: cross  Abstract: Configurable software systems are prone to configuration errors, resulting in significant losses to companies. However, diagnosing these errors is challenging due to the vast and complex configuration space. These errors pose significant challenges for both experienced maintainers and new end-users, particularly those without access to the source code of the software systems. Given that logs are easily accessible to most end-users, we conduct a preliminary study to outline the challenges and opportunities of utilizing logs in localizing configuration errors. Based on the insights gained from the preliminary study, we propose an LLM-based two-stage strategy for end-users to localize the root-cause configuration properties based on logs. We further implement a tool, LogConfigLocalizer, aligned with the design of the aforementioned strategy, hoping to assist end-users in coping with configuration errors through log analysis.   To the best",
    "path": "papers/24/04/2404.00640.json",
    "total_tokens": 845,
    "translated_title": "《面对它们自己：基于LLM的两阶段策略通过日志定位配置错误》",
    "translated_abstract": "可配置软件系统容易出现配置错误，给公司带来重大损失。然而，由于庞大而复杂的配置空间，诊断这些错误具有挑战性。这些错误对有经验的维护者和没有软件系统源代码访问权限的新终端用户都构成重大挑战。鉴于日志对大多数终端用户来说易于访问，我们进行了初步研究，概述了利用日志定位配置错误的挑战和机遇。根据初步研究所得的见解，我们提出了基于LLM的两阶段策略，帮助终端用户通过日志定位配置错误的根本原因。我们进一步实现了一个工具LogConfigLocalizer，符合上述策略的设计，希望通过日志分析帮助终端用户应对配置错误。",
    "tldr": "提出了一种基于LLM的两阶段策略，帮助终端用户通过日志定位配置错误的根本原因，并开发了相应工具LogConfigLocalizer，以帮助终端用户通过日志分析解决配置错误。"
}