{
    "title": "Grappa -- A Machine Learned Molecular Mechanics Force Field",
    "abstract": "arXiv:2404.00050v1 Announce Type: cross  Abstract: Simulating large molecular systems over long timescales requires force fields that are both accurate and efficient. In recent years, E(3) equivariant neural networks have lifted the tension between computational efficiency and accuracy of force fields, but they are still several orders of magnitude more expensive than classical molecular mechanics (MM) force fields.   Here, we propose a novel machine learning architecture to predict MM parameters from the molecular graph, employing a graph attentional neural network and a transformer with symmetry-preserving positional encoding. The resulting force field, Grappa, outperforms established and other machine-learned MM force fields in terms of accuracy at the same computational efficiency and can be used in existing Molecular Dynamics (MD) engines like GROMACS and OpenMM. It predicts energies and forces of small molecules, peptides, RNA and - showcasing its extensibility to uncharted regio",
    "link": "https://arxiv.org/abs/2404.00050",
    "context": "Title: Grappa -- A Machine Learned Molecular Mechanics Force Field\nAbstract: arXiv:2404.00050v1 Announce Type: cross  Abstract: Simulating large molecular systems over long timescales requires force fields that are both accurate and efficient. In recent years, E(3) equivariant neural networks have lifted the tension between computational efficiency and accuracy of force fields, but they are still several orders of magnitude more expensive than classical molecular mechanics (MM) force fields.   Here, we propose a novel machine learning architecture to predict MM parameters from the molecular graph, employing a graph attentional neural network and a transformer with symmetry-preserving positional encoding. The resulting force field, Grappa, outperforms established and other machine-learned MM force fields in terms of accuracy at the same computational efficiency and can be used in existing Molecular Dynamics (MD) engines like GROMACS and OpenMM. It predicts energies and forces of small molecules, peptides, RNA and - showcasing its extensibility to uncharted regio",
    "path": "papers/24/04/2404.00050.json",
    "total_tokens": 820,
    "translated_title": "Grappa--一个机器学习的分子力学势场",
    "translated_abstract": "模拟长时间尺度上的大分子系统需要既准确又高效的力场。近年来，E(3)等变神经网络解决了计算效率和力场准确性之间的张力，但其代价仍比传统的分子力学（MM）力场昂贵数个数量级。在这项研究中，我们提出了一种新颖的机器学习架构，利用图注意力神经网络和具有保持对称性的位置编码的transformer来预测分子图中的MM参数。由此产生的力场Grappa在准确性方面优于已建立的其他机器学习的MM力场，并且能以相同的计算效率在现有的分子动力学（MD）引擎如GROMACS和OpenMM中使用。它可以预测小分子、肽、RNA的能量和力--展示了其可扩展性到未知区域。",
    "tldr": "提出了一个用于预测分子力学参数的机器学习架构Grappa，通过图注意力神经网络和transformer提高了准确性，减少了计算开销，能在现有MD引擎中使用。",
    "en_tdlr": "Introducing a machine learning architecture Grappa for predicting molecular mechanics parameters, which enhances accuracy and reduces computational cost through graph attentional neural networks and transformers, and is compatible with existing MD engines."
}