{
    "title": "Heterogeneous Treatment Effects and Causal Mechanisms",
    "abstract": "arXiv:2404.01566v1 Announce Type: new  Abstract: The credibility revolution advances the use of research designs that permit identification and estimation of causal effects. However, understanding which mechanisms produce measured causal effects remains a challenge. A dominant current approach to the quantitative evaluation of mechanisms relies on the detection of heterogeneous treatment effects with respect to pre-treatment covariates. This paper develops a framework to understand when the existence of such heterogeneous treatment effects can support inferences about the activation of a mechanism. We show first that this design cannot provide evidence of mechanism activation without additional, generally implicit, assumptions. Further, even when these assumptions are satisfied, if a measured outcome is produced by a non-linear transformation of a directly-affected outcome of theoretical interest, heterogeneous treatment effects are not informative of mechanism activation. We provide n",
    "link": "https://arxiv.org/abs/2404.01566",
    "context": "Title: Heterogeneous Treatment Effects and Causal Mechanisms\nAbstract: arXiv:2404.01566v1 Announce Type: new  Abstract: The credibility revolution advances the use of research designs that permit identification and estimation of causal effects. However, understanding which mechanisms produce measured causal effects remains a challenge. A dominant current approach to the quantitative evaluation of mechanisms relies on the detection of heterogeneous treatment effects with respect to pre-treatment covariates. This paper develops a framework to understand when the existence of such heterogeneous treatment effects can support inferences about the activation of a mechanism. We show first that this design cannot provide evidence of mechanism activation without additional, generally implicit, assumptions. Further, even when these assumptions are satisfied, if a measured outcome is produced by a non-linear transformation of a directly-affected outcome of theoretical interest, heterogeneous treatment effects are not informative of mechanism activation. We provide n",
    "path": "papers/24/04/2404.01566.json",
    "total_tokens": 785,
    "translated_title": "异质性治疗效应和因果机制",
    "translated_abstract": "arXiv:2404.01566v1 公告类型:新摘要:可信度革命推动了利用研究设计来识别和估计因果效应的发展。然而，了解哪些机制产生了测量的因果效应仍然是一个挑战。目前关于定量评估机制的主要方法依赖于检测与处理前协变量相关的异质性处理效应。本文开发了一个框架，用于理解在何种情况下这种异质性处理效应的存在能够支持有关机制激活的推断。我们首先展示，这种设计在没有额外、通常是隐含的假设的情况下无法为机制激活提供证据。此外，即使这些假设得到满足，如果一个测量结果是通过直接受影响的感兴趣理论结果的非线性转换产生的，异质性处理效应也不足以推断机制激活。我们提供了n",
    "tldr": "该论文讨论了异质性治疗效应对于因果机制的推断，并指出了存在的挑战和局限性。",
    "en_tdlr": "This paper discusses the inference of causal mechanisms based on heterogeneous treatment effects, highlighting the challenges and limitations involved."
}