{
    "title": "On Train-Test Class Overlap and Detection for Image Retrieval",
    "abstract": "arXiv:2404.01524v1 Announce Type: cross  Abstract: How important is it for training and evaluation sets to not have class overlap in image retrieval? We revisit Google Landmarks v2 clean, the most popular training set, by identifying and removing class overlap with Revisited Oxford and Paris [34], the most popular evaluation set. By comparing the original and the new RGLDv2-clean on a benchmark of reproduced state-of-the-art methods, our findings are striking. Not only is there a dramatic drop in performance, but it is inconsistent across methods, changing the ranking.What does it take to focus on objects or interest and ignore background clutter when indexing? Do we need to train an object detector and the representation separately? Do we need location supervision? We introduce Single-stage Detect-to-Retrieve (CiDeR), an end-to-end, single-stage pipeline to detect objects of interest and extract a global image representation. We outperform previous state-of-the-art on both existing tr",
    "link": "https://arxiv.org/abs/2404.01524",
    "context": "Title: On Train-Test Class Overlap and Detection for Image Retrieval\nAbstract: arXiv:2404.01524v1 Announce Type: cross  Abstract: How important is it for training and evaluation sets to not have class overlap in image retrieval? We revisit Google Landmarks v2 clean, the most popular training set, by identifying and removing class overlap with Revisited Oxford and Paris [34], the most popular evaluation set. By comparing the original and the new RGLDv2-clean on a benchmark of reproduced state-of-the-art methods, our findings are striking. Not only is there a dramatic drop in performance, but it is inconsistent across methods, changing the ranking.What does it take to focus on objects or interest and ignore background clutter when indexing? Do we need to train an object detector and the representation separately? Do we need location supervision? We introduce Single-stage Detect-to-Retrieve (CiDeR), an end-to-end, single-stage pipeline to detect objects of interest and extract a global image representation. We outperform previous state-of-the-art on both existing tr",
    "path": "papers/24/04/2404.01524.json",
    "total_tokens": 898,
    "translated_title": "关于图像检索中的训练-测试类别重叠和检测",
    "translated_abstract": "有多重要，训练和评估集中不要有图像检索中的类别重叠？我们通过识别并移除谷歌地标v2清洁集中的类别重叠，来重新审视Revisited Oxford和Paris，最流行的评估集。通过比较原始和新的RGLDv2-clean在一系列最先进方法的基准上，我们的发现令人瞩目。不仅性能急剧下降，而且在方法之间不一致，改变了排名。当索引时集中关注对象或兴趣并忽略背景杂乱需要什么？我们需要分别训练对象检测器和表示吗？我们需要位置监督吗？我们介绍了一种称为Single-stage Detect-to-Retrieve（CiDeR）的端到端、单阶段流程，用于检测感兴趣的对象并提取全局图像表示。我们在现有测试基准上均表现优异。",
    "tldr": "重新审视了谷歌地标v2的训练集，通过识别和移除类别重叠，引入了一种新的端到端单阶段流程Single-stage Detect-to-Retrieve（CiDeR），旨在检测对象并提取全局图像表示，在现有最先进方法上表现优异。",
    "en_tdlr": "Revisited the training set Google Landmarks v2 by identifying and removing class overlap, introduced a new end-to-end single-stage pipeline Single-stage Detect-to-Retrieve (CiDeR) for object detection and global image representation extraction, outperforming existing state-of-the-art methods."
}