{
    "title": "Uncovering the Text Embedding in Text-to-Image Diffusion Models",
    "abstract": "arXiv:2404.01154v1 Announce Type: cross  Abstract: The correspondence between input text and the generated image exhibits opacity, wherein minor textual modifications can induce substantial deviations in the generated image. While, text embedding, as the pivotal intermediary between text and images, remains relatively underexplored. In this paper, we address this research gap by delving into the text embedding space, unleashing its capacity for controllable image editing and explicable semantic direction attributes within a learning-free framework. Specifically, we identify two critical insights regarding the importance of per-word embedding and their contextual correlations within text embedding, providing instructive principles for learning-free image editing. Additionally, we find that text embedding inherently possesses diverse semantic potentials, and further reveal this property through the lens of singular value decomposition (SVD). These uncovered properties offer practical uti",
    "link": "https://arxiv.org/abs/2404.01154",
    "context": "Title: Uncovering the Text Embedding in Text-to-Image Diffusion Models\nAbstract: arXiv:2404.01154v1 Announce Type: cross  Abstract: The correspondence between input text and the generated image exhibits opacity, wherein minor textual modifications can induce substantial deviations in the generated image. While, text embedding, as the pivotal intermediary between text and images, remains relatively underexplored. In this paper, we address this research gap by delving into the text embedding space, unleashing its capacity for controllable image editing and explicable semantic direction attributes within a learning-free framework. Specifically, we identify two critical insights regarding the importance of per-word embedding and their contextual correlations within text embedding, providing instructive principles for learning-free image editing. Additionally, we find that text embedding inherently possesses diverse semantic potentials, and further reveal this property through the lens of singular value decomposition (SVD). These uncovered properties offer practical uti",
    "path": "papers/24/04/2404.01154.json",
    "total_tokens": 835,
    "translated_title": "揭示文本嵌入在文本到图像扩散模型中的作用",
    "translated_abstract": "输入文本与生成图像之间的对应关系表现为不透明性，即轻微的文本修改会导致生成图像的重大偏差。而文本嵌入作为文本与图像之间的关键中间体仍然相对未被深入探讨。本文通过深入探讨文本嵌入空间，释放其对可控图像编辑和可解释的语义方向属性的能力，在无需学习的框架内。具体来说，我们发现了两个关键见解，即单词嵌入的重要性以及它们在文本嵌入中的上下文相关性，为无需学习的图像编辑提供了指导原则。此外，我们发现文本嵌入固有地具有多样的语义潜力，并通过奇异值分解（SVD）的视角进一步揭示了这一属性。这些揭示出来的特性提供了实用价值",
    "tldr": "本文揭示了文本嵌入在文本到图像扩散模型中的作用，并且提出了关于单词嵌入及其上下文相关性的重要见解，为学习免费图像编辑提供了指导原则。",
    "en_tdlr": "This paper uncovers the role of text embedding in text-to-image diffusion models, identifies critical insights about the importance of per-word embedding and their contextual correlations, providing instructive principles for learning-free image editing."
}