{
    "title": "Solar synthetic imaging: Introducing denoising diffusion probabilistic models on SDO/AIA data",
    "abstract": "arXiv:2404.02552v1 Announce Type: cross  Abstract: Given the rarity of significant solar flares compared to smaller ones, training effective machine learning models for solar activity forecasting is challenging due to insufficient data. This study proposes using generative deep learning models, specifically a Denoising Diffusion Probabilistic Model (DDPM), to create synthetic images of solar phenomena, including flares of varying intensities. By employing a dataset from the AIA instrument aboard the SDO spacecraft, focusing on the 171 {\\AA} band that captures various solar activities, and classifying images with GOES X-ray measurements based on flare intensity, we aim to address the data scarcity issue. The DDPM's performance is evaluated using cluster metrics, Frechet Inception Distance (FID), and F1-score, showcasing promising results in generating realistic solar imagery. We conduct two experiments: one to train a supervised classifier for event identification and another for basic ",
    "link": "https://arxiv.org/abs/2404.02552",
    "context": "Title: Solar synthetic imaging: Introducing denoising diffusion probabilistic models on SDO/AIA data\nAbstract: arXiv:2404.02552v1 Announce Type: cross  Abstract: Given the rarity of significant solar flares compared to smaller ones, training effective machine learning models for solar activity forecasting is challenging due to insufficient data. This study proposes using generative deep learning models, specifically a Denoising Diffusion Probabilistic Model (DDPM), to create synthetic images of solar phenomena, including flares of varying intensities. By employing a dataset from the AIA instrument aboard the SDO spacecraft, focusing on the 171 {\\AA} band that captures various solar activities, and classifying images with GOES X-ray measurements based on flare intensity, we aim to address the data scarcity issue. The DDPM's performance is evaluated using cluster metrics, Frechet Inception Distance (FID), and F1-score, showcasing promising results in generating realistic solar imagery. We conduct two experiments: one to train a supervised classifier for event identification and another for basic ",
    "path": "papers/24/04/2404.02552.json",
    "total_tokens": 867,
    "translated_title": "太阳合成成像：在SDO/AIA数据上引入去噪扩散概率模型",
    "translated_abstract": "鉴于显著太阳耀斑的罕见性相对于较小的耀斑，训练有效的太阳活动预测机器学习模型具有挑战性，因为数据不足。本研究提出使用生成式深度学习模型，特别是去噪扩散概率模型（DDPM），以创建太阳现象的合成图像，包括不同强度的耀斑。通过利用SDO航天器上AIA仪器的数据集，集中在捕捉各种太阳活动的171 Å频段，并根据耀斑强度使用GOES X射线测量对图像进行分类，我们旨在解决数据稀缺问题。使用聚类指标、Frechet Inception Distance（FID）和F1-score评估DDPM的性能，展示了生成逼真太阳图像的有希望结果。我们进行两个实验：一个用于训练监督分类器进行事件识别，另一个用于基本",
    "tldr": "使用去噪扩散概率模型（DDPM）在SDO/AIA数据上创建合成太阳图像，以解决太阳活动预测中的数据稀缺挑战。",
    "en_tdlr": "Generating synthetic solar images using Denoising Diffusion Probabilistic Models (DDPM) on SDO/AIA data to address data scarcity in solar activity forecasting."
}