{
    "title": "Higher education assessment practice in the era of generative AI tools",
    "abstract": "arXiv:2404.01036v1 Announce Type: cross  Abstract: The higher education (HE) sector benefits every nation's economy and society at large. However, their contributions are challenged by advanced technologies like generative artificial intelligence (GenAI) tools. In this paper, we provide a comprehensive assessment of GenAI tools towards assessment and pedagogic practice and, subsequently, discuss the potential impacts. This study experimented using three assessment instruments from data science, data analytics, and construction management disciplines. Our findings are two-fold: first, the findings revealed that GenAI tools exhibit subject knowledge, problem-solving, analytical, critical thinking, and presentation skills and thus can limit learning when used unethically. Secondly, the design of the assessment of certain disciplines revealed the limitations of the GenAI tools. Based on our findings, we made recommendations on how AI tools can be utilised for teaching and learning in HE.",
    "link": "https://arxiv.org/abs/2404.01036",
    "context": "Title: Higher education assessment practice in the era of generative AI tools\nAbstract: arXiv:2404.01036v1 Announce Type: cross  Abstract: The higher education (HE) sector benefits every nation's economy and society at large. However, their contributions are challenged by advanced technologies like generative artificial intelligence (GenAI) tools. In this paper, we provide a comprehensive assessment of GenAI tools towards assessment and pedagogic practice and, subsequently, discuss the potential impacts. This study experimented using three assessment instruments from data science, data analytics, and construction management disciplines. Our findings are two-fold: first, the findings revealed that GenAI tools exhibit subject knowledge, problem-solving, analytical, critical thinking, and presentation skills and thus can limit learning when used unethically. Secondly, the design of the assessment of certain disciplines revealed the limitations of the GenAI tools. Based on our findings, we made recommendations on how AI tools can be utilised for teaching and learning in HE.",
    "path": "papers/24/04/2404.01036.json",
    "total_tokens": 896,
    "translated_title": "在生成人工智能工具时代的高等教育评估实践",
    "translated_abstract": "高等教育（HE）部门对每个国家的经济和社会都有益处，但它们的贡献受到生成人工智能（GenAI）等先进技术的挑战。本文全面评估了GenAI工具对评估和教学实践的影响，并随后讨论了潜在影响。研究使用了数据科学、数据分析和建筑管理学科的三种评估工具进行实验。研究发现有两个方面：首先，结果显示GenAI工具展示了学科知识、问题解决能力、分析能力、批判性思维和表达能力，因此在不道德使用时可能会限制学习。其次，某些学科评估的设计揭示了GenAI工具的局限性。根据研究结果，我们提出了关于如何在高等教育中利用人工智能工具进行教学与学习的建议。",
    "tldr": "该研究评估了生成人工智能工具对高等教育评估实践的影响，发现这些工具展示了学科知识、问题解决、分析能力等技能，但在不道德使用时可能限制学习，同时也揭示了部分学科评估中这些工具的局限性。",
    "en_tdlr": "This study assessed the impact of generative AI tools on higher education assessment practices. The findings show that these tools exhibit subject knowledge, problem-solving, analytical skills, but unethical use may limit learning, and also revealed limitations in certain disciplines' assessment."
}