{
    "title": "Individual Text Corpora Predict Openness, Interests, Knowledge and Level of Education",
    "abstract": "arXiv:2404.00165v1 Announce Type: new  Abstract: Here we examine whether the personality dimension of openness to experience can be predicted from the individual google search history. By web scraping, individual text corpora (ICs) were generated from 214 participants with a mean number of 5 million word tokens. We trained word2vec models and used the similarities of each IC to label words, which were derived from a lexical approach of personality. These IC-label-word similarities were utilized as predictive features in neural models. For training and validation, we relied on 179 participants and held out a test sample of 35 participants. A grid search with varying number of predictive features, hidden units and boost factor was performed. As model selection criterion, we used R2 in the validation samples penalized by the absolute R2 difference between training and validation. The selected neural model explained 35% of the openness variance in the test sample, while an ensemble model w",
    "link": "https://arxiv.org/abs/2404.00165",
    "context": "Title: Individual Text Corpora Predict Openness, Interests, Knowledge and Level of Education\nAbstract: arXiv:2404.00165v1 Announce Type: new  Abstract: Here we examine whether the personality dimension of openness to experience can be predicted from the individual google search history. By web scraping, individual text corpora (ICs) were generated from 214 participants with a mean number of 5 million word tokens. We trained word2vec models and used the similarities of each IC to label words, which were derived from a lexical approach of personality. These IC-label-word similarities were utilized as predictive features in neural models. For training and validation, we relied on 179 participants and held out a test sample of 35 participants. A grid search with varying number of predictive features, hidden units and boost factor was performed. As model selection criterion, we used R2 in the validation samples penalized by the absolute R2 difference between training and validation. The selected neural model explained 35% of the openness variance in the test sample, while an ensemble model w",
    "path": "papers/24/04/2404.00165.json",
    "total_tokens": 903,
    "translated_title": "个人文本语料库预测开放性、兴趣、知识和教育水平",
    "translated_abstract": "在这项研究中，我们调查了个体对体验的开放性这一人格维度是否可以通过个体的谷歌搜索历史进行预测。通过网络抓取，我们生成了来自214名参与者的个人文本语料库，平均词汇量为500万个词元。我们训练了word2vec模型，并使用每个个人文本语料库与标记单词的相似性，这些标记单词来自于人格的词汇方法。这些个人文本语料库-标记单词的相似性被用作神经模型中的预测特征。为了训练和验证，我们依赖179名参与者，并保留了35名参与者的测试样本。我们进行了一个带有不同数量预测特征、隐藏单元和增量因子的网格搜索。作为模型选择标准，我们使用了在验证样本中由绝对R2差异惩罚的R2。选择的神经模型在测试样本中解释了35%的开放性方差，而集成模型…",
    "tldr": "本研究探讨了个人对体验的开放性这一人格维度是否可以通过个体的谷歌搜索历史预测，并通过相似性特征基于个人文本语料库来解释35%的开放性方差。",
    "en_tdlr": "This study investigates whether the personality dimension of openness to experience can be predicted from individual google search history, and explains 35% of the openness variance based on similarities features derived from individual text corpora."
}