{
    "title": "Federated Computing -- Survey on Building Blocks, Extensions and Systems",
    "abstract": "arXiv:2404.02779v1 Announce Type: new  Abstract: In response to the increasing volume and sensitivity of data, traditional centralized computing models face challenges, such as data security breaches and regulatory hurdles. Federated Computing (FC) addresses these concerns by enabling collaborative processing without compromising individual data privacy. This is achieved through a decentralized network of devices, each retaining control over its data, while participating in collective computations. The motivation behind FC extends beyond technical considerations to encompass societal implications. As the need for responsible AI and ethical data practices intensifies, FC aligns with the principles of user empowerment and data sovereignty. FC comprises of Federated Learning (FL) and Federated Analytics (FA). FC systems became more complex over time and they currently lack a clear definition and taxonomy describing its moving pieces. Current surveys capture domain-specific FL use cases, d",
    "link": "https://arxiv.org/abs/2404.02779",
    "context": "Title: Federated Computing -- Survey on Building Blocks, Extensions and Systems\nAbstract: arXiv:2404.02779v1 Announce Type: new  Abstract: In response to the increasing volume and sensitivity of data, traditional centralized computing models face challenges, such as data security breaches and regulatory hurdles. Federated Computing (FC) addresses these concerns by enabling collaborative processing without compromising individual data privacy. This is achieved through a decentralized network of devices, each retaining control over its data, while participating in collective computations. The motivation behind FC extends beyond technical considerations to encompass societal implications. As the need for responsible AI and ethical data practices intensifies, FC aligns with the principles of user empowerment and data sovereignty. FC comprises of Federated Learning (FL) and Federated Analytics (FA). FC systems became more complex over time and they currently lack a clear definition and taxonomy describing its moving pieces. Current surveys capture domain-specific FL use cases, d",
    "path": "papers/24/04/2404.02779.json",
    "total_tokens": 864,
    "translated_title": "联邦计算——构建块、扩展和系统的调研",
    "translated_abstract": "针对数据量增大和敏感性增强，传统的集中式计算模型面临挑战，如数据安全漏洞和监管障碍。联邦计算（FC）通过实现协作处理而不损害个人数据隐私来应对这些问题。这一目标通过分布式设备网络实现，每个设备在参与集体计算的同时保留对其数据的控制。FC的动机不仅限于技术考虑，还包括社会影响。随着对负责任的人工智能和道德数据实践的需求加剧，FC符合用户赋权和数据主权原则。FC包括联邦学习（FL）和联邦分析（FA）。随着时间推移，FC系统变得越来越复杂，目前缺乏明确定义和描述其组成部分的分类。当前的调研只涵盖特定领域的FL应用情况。",
    "tldr": "联邦计算旨在通过建立分布式网络，每个设备保留对自身数据的控制并参与集体计算，从而实现协作处理，其尊重用户隐私和数据主权的原则与当下对负责任AI和道德数据实践的需求相契合。",
    "en_tdlr": "Federated Computing aims to enable collaborative processing by establishing a decentralized network where each device retains control over its data while participating in collective computations, aligning with the principles of respecting user privacy and data sovereignty and meeting the current demand for responsible AI and ethical data practices."
}