{
    "title": "Sentence-level Media Bias Analysis with Event Relation Graph",
    "abstract": "arXiv:2404.01722v1 Announce Type: new  Abstract: Media outlets are becoming more partisan and polarized nowadays. In this paper, we identify media bias at the sentence level, and pinpoint bias sentences that intend to sway readers' opinions. As bias sentences are often expressed in a neutral and factual way, considering broader context outside a sentence can help reveal the bias. In particular, we observe that events in a bias sentence need to be understood in associations with other events in the document. Therefore, we propose to construct an event relation graph to explicitly reason about event-event relations for sentence-level bias identification. The designed event relation graph consists of events as nodes and four common types of event relations: coreference, temporal, causal, and subevent relations. Then, we incorporate event relation graph for bias sentences identification in two steps: an event-aware language model is built to inject the events and event relations knowledge ",
    "link": "https://arxiv.org/abs/2404.01722",
    "context": "Title: Sentence-level Media Bias Analysis with Event Relation Graph\nAbstract: arXiv:2404.01722v1 Announce Type: new  Abstract: Media outlets are becoming more partisan and polarized nowadays. In this paper, we identify media bias at the sentence level, and pinpoint bias sentences that intend to sway readers' opinions. As bias sentences are often expressed in a neutral and factual way, considering broader context outside a sentence can help reveal the bias. In particular, we observe that events in a bias sentence need to be understood in associations with other events in the document. Therefore, we propose to construct an event relation graph to explicitly reason about event-event relations for sentence-level bias identification. The designed event relation graph consists of events as nodes and four common types of event relations: coreference, temporal, causal, and subevent relations. Then, we incorporate event relation graph for bias sentences identification in two steps: an event-aware language model is built to inject the events and event relations knowledge ",
    "path": "papers/24/04/2404.01722.json",
    "total_tokens": 819,
    "translated_title": "基于事件关系图的句子级媒体偏见分析",
    "translated_abstract": "媒体机构现在越来越党派化和极化。本文针对句子级别识别媒体偏见，定位旨在影响读者观点的偏见句。由于偏见句通常以中立客观的方式表达，考虑句子之外的更广泛上下文可以帮助揭示这种偏见。我们观察到偏见句中的事件需要与文档中的其他事件相关联理解。因此，我们提出构建一个事件关系图，以明确推理句子级偏见识别中的事件-事件关系。设计的事件关系图由事件作为节点和四种常见类型的事件关系：指代、时间、因果和子事件关系组成。然后，我们将事件关系图纳入偏见句识别中，分两步进行：建立一个事件感知的语言模型，注入事件和事件关系知识。",
    "tldr": "本文提出了一种基于事件关系图的句子级媒体偏见分析方法，通过构建事件关系图和事件感知的语言模型，实现了对偏见句的识别和表达。",
    "en_tdlr": "This paper proposes a sentence-level media bias analysis method based on event relation graph, which identifies and characterizes bias sentences by constructing the event relation graph and incorporating event-aware language model."
}