{
    "title": "Set-Aligning Framework for Auto-Regressive Event Temporal Graph Generation",
    "abstract": "arXiv:2404.01532v1 Announce Type: new  Abstract: Event temporal graphs have been shown as convenient and effective representations of complex temporal relations between events in text. Recent studies, which employ pre-trained language models to auto-regressively generate linearised graphs for constructing event temporal graphs, have shown promising results. However, these methods have often led to suboptimal graph generation as the linearised graphs exhibit set characteristics which are instead treated sequentially by language models. This discrepancy stems from the conventional text generation objectives, leading to erroneous penalisation of correct predictions caused by the misalignment of elements in target sequences. To address these challenges, we reframe the task as a conditional set generation problem, proposing a Set-aligning Framework tailored for the effective utilisation of Large Language Models (LLMs). The framework incorporates data augmentations and set-property regularis",
    "link": "https://arxiv.org/abs/2404.01532",
    "context": "Title: Set-Aligning Framework for Auto-Regressive Event Temporal Graph Generation\nAbstract: arXiv:2404.01532v1 Announce Type: new  Abstract: Event temporal graphs have been shown as convenient and effective representations of complex temporal relations between events in text. Recent studies, which employ pre-trained language models to auto-regressively generate linearised graphs for constructing event temporal graphs, have shown promising results. However, these methods have often led to suboptimal graph generation as the linearised graphs exhibit set characteristics which are instead treated sequentially by language models. This discrepancy stems from the conventional text generation objectives, leading to erroneous penalisation of correct predictions caused by the misalignment of elements in target sequences. To address these challenges, we reframe the task as a conditional set generation problem, proposing a Set-aligning Framework tailored for the effective utilisation of Large Language Models (LLMs). The framework incorporates data augmentations and set-property regularis",
    "path": "papers/24/04/2404.01532.json",
    "total_tokens": 687,
    "translated_title": "自动回归事件时间图生成的集合对齐框架",
    "translated_abstract": "最近的研究使用预训练语言模型自回归生成线性化图，用于构建事件时间图，取得了令人满意的结果。然而，这些方法通常导致次优图生成，因为线性化图表现出集合特征，而语言模型则按顺序处理这些特征。我们重新构思了任务，将其作为条件集合生成问题，并提出了一种针对大型语言模型的集合对齐框架，以解决这些挑战。",
    "tldr": "提出了针对自动回归事件时间图生成的条件集合生成问题的集合对齐框架，用于解决线性化图和语言模型处理序列不匹配的挑战",
    "en_tdlr": "Proposed a set-aligning framework for conditional set generation in auto-regressive event temporal graph generation to address the challenge of mismatch between linearized graphs and sequential processing by language models."
}