{
    "title": "TSOM: Small Object Motion Detection Neural Network Inspired by Avian Visual Circuit",
    "abstract": "arXiv:2404.00855v1 Announce Type: cross  Abstract: Detecting small moving objects in complex backgrounds from an overhead perspective is a highly challenging task for machine vision systems. As an inspiration from nature, the avian visual system is capable of processing motion information in various complex aerial scenes, and its Retina-OT-Rt visual circuit is highly sensitive to capturing the motion information of small objects from high altitudes. However, more needs to be done on small object motion detection algorithms based on the avian visual system. In this paper, we conducted mathematical modeling based on extensive studies of the biological mechanisms of the Retina-OT-Rt visual circuit. Based on this, we proposed a novel tectum small object motion detection neural network (TSOM). The neural network includes the retina, SGC dendritic, SGC Soma, and Rt layers, each layer corresponding to neurons in the visual pathway. The Retina layer is responsible for accurately projecting inp",
    "link": "https://arxiv.org/abs/2404.00855",
    "context": "Title: TSOM: Small Object Motion Detection Neural Network Inspired by Avian Visual Circuit\nAbstract: arXiv:2404.00855v1 Announce Type: cross  Abstract: Detecting small moving objects in complex backgrounds from an overhead perspective is a highly challenging task for machine vision systems. As an inspiration from nature, the avian visual system is capable of processing motion information in various complex aerial scenes, and its Retina-OT-Rt visual circuit is highly sensitive to capturing the motion information of small objects from high altitudes. However, more needs to be done on small object motion detection algorithms based on the avian visual system. In this paper, we conducted mathematical modeling based on extensive studies of the biological mechanisms of the Retina-OT-Rt visual circuit. Based on this, we proposed a novel tectum small object motion detection neural network (TSOM). The neural network includes the retina, SGC dendritic, SGC Soma, and Rt layers, each layer corresponding to neurons in the visual pathway. The Retina layer is responsible for accurately projecting inp",
    "path": "papers/24/04/2404.00855.json",
    "total_tokens": 760,
    "translated_title": "基于鸟类视觉回路的小物体运动检测神经网络TSOM",
    "translated_abstract": "从俯视角度在复杂背景中检测小运动物体对于机器视觉系统是一个极具挑战性的任务。受自然界启发，鸟类视觉系统能够处理各种复杂的空中场景中的运动信息，其视网膜-OT-Rt视觉回路高度敏感于从高空捕捉小物体的运动信息。然而，基于鸟类视觉系统的小物体运动检测算法还有待进一步研究。本文通过对视网膜-OT-Rt视觉回路生物机制的广泛研究进行数学建模，并提出了一种新颖的tectum小物体运动检测神经网络（TSOM）。",
    "tldr": "本论文基于鸟类视觉系统，提出了一种新型的神经网络TSOM，用于小物体运动检测算法。",
    "en_tdlr": "This paper proposes a novel neural network TSOM inspired by avian visual system for small object motion detection algorithms."
}