{
    "title": "Against The Achilles' Heel: A Survey on Red Teaming for Generative Models",
    "abstract": "arXiv:2404.00629v1 Announce Type: new  Abstract: Generative models are rapidly gaining popularity and being integrated into everyday applications, raising concerns over their safety issues as various vulnerabilities are exposed. Faced with the problem, the field of red teaming is experiencing fast-paced growth, which highlights the need for a comprehensive organization covering the entire pipeline and addressing emerging topics for the community. Our extensive survey, which examines over 120 papers, introduces a taxonomy of fine-grained attack strategies grounded in the inherent capabilities of language models. Additionally, we have developed the searcher framework that unifies various automatic red teaming approaches. Moreover, our survey covers novel areas including multimodal attacks and defenses, risks around multilingual models, overkill of harmless queries, and safety of downstream applications. We hope this survey can provide a systematic perspective on the field and unlock new ",
    "link": "https://arxiv.org/abs/2404.00629",
    "context": "Title: Against The Achilles' Heel: A Survey on Red Teaming for Generative Models\nAbstract: arXiv:2404.00629v1 Announce Type: new  Abstract: Generative models are rapidly gaining popularity and being integrated into everyday applications, raising concerns over their safety issues as various vulnerabilities are exposed. Faced with the problem, the field of red teaming is experiencing fast-paced growth, which highlights the need for a comprehensive organization covering the entire pipeline and addressing emerging topics for the community. Our extensive survey, which examines over 120 papers, introduces a taxonomy of fine-grained attack strategies grounded in the inherent capabilities of language models. Additionally, we have developed the searcher framework that unifies various automatic red teaming approaches. Moreover, our survey covers novel areas including multimodal attacks and defenses, risks around multilingual models, overkill of harmless queries, and safety of downstream applications. We hope this survey can provide a systematic perspective on the field and unlock new ",
    "path": "papers/24/04/2404.00629.json",
    "total_tokens": 810,
    "translated_title": "针对阿喀琉斯之踵：生成模型红队测试的调查",
    "translated_abstract": "生成模型正迅速普及并被整合到日常应用中，但相关的安全问题引起了人们的担忧，因为各种漏洞不断暴露。面对这一问题，红队测试领域正在快速增长，强调了对整个流程进行全面组织并解决社区新兴主题的需求。我们的广泛调查涵盖了120多篇论文，引入了一个基于语言模型固有能力的细粒度攻击策略分类体系。此外，我们开发了一个统一各种自动红队测试方法的搜索框架。此外，我们的调查涵盖了新领域，包括多模式攻击和防御、多语言模型风险、无害查询的过度使用以及下游应用的安全性。",
    "tldr": "通过对生成模型的红队测试进行了广泛调查，引入了基于语言模型能力的细粒度攻击策略分类体系，并开发了一个统一各种自动红队测试方法的搜索框架。",
    "en_tdlr": "A comprehensive survey on red teaming for generative models introduces a taxonomy of fine-grained attack strategies based on language model capabilities and presents a unified framework for various automatic red teaming approaches."
}