{
    "title": "SOAR: Improved Indexing for Approximate Nearest Neighbor Search",
    "abstract": "arXiv:2404.00774v1 Announce Type: new  Abstract: This paper introduces SOAR: Spilling with Orthogonality-Amplified Residuals, a novel data indexing technique for approximate nearest neighbor (ANN) search. SOAR extends upon previous approaches to ANN search, such as spill trees, that utilize multiple redundant representations while partitioning the data to reduce the probability of missing a nearest neighbor during search. Rather than training and computing these redundant representations independently, however, SOAR uses an orthogonality-amplified residual loss, which optimizes each representation to compensate for cases where other representations perform poorly. This drastically improves the overall index quality, resulting in state-of-the-art ANN benchmark performance while maintaining fast indexing times and low memory consumption.",
    "link": "https://arxiv.org/abs/2404.00774",
    "context": "Title: SOAR: Improved Indexing for Approximate Nearest Neighbor Search\nAbstract: arXiv:2404.00774v1 Announce Type: new  Abstract: This paper introduces SOAR: Spilling with Orthogonality-Amplified Residuals, a novel data indexing technique for approximate nearest neighbor (ANN) search. SOAR extends upon previous approaches to ANN search, such as spill trees, that utilize multiple redundant representations while partitioning the data to reduce the probability of missing a nearest neighbor during search. Rather than training and computing these redundant representations independently, however, SOAR uses an orthogonality-amplified residual loss, which optimizes each representation to compensate for cases where other representations perform poorly. This drastically improves the overall index quality, resulting in state-of-the-art ANN benchmark performance while maintaining fast indexing times and low memory consumption.",
    "path": "papers/24/04/2404.00774.json",
    "total_tokens": 761,
    "translated_title": "SOAR: 改进的近似最近邻搜索索引方法",
    "translated_abstract": "本文介绍了SOAR：增强正交残差的泄漏索引技术，这是一种针对近似最近邻（ANN）搜索的新型数据索引技术。SOAR在分区数据时扩展了先前的ANN搜索方法，如泄漏树，这些方法利用多个冗余表示来降低在搜索过程中错过最近邻的概率。然而，与独立训练和计算这些冗余表示不同，SOAR使用了一种增强正交残差损失，优化每个表示以补偿其他表示性能不佳的情况。这大大提高了整体索引质量，实现了最先进的ANN基准性能，同时保持快速索引时间和低内存消耗。",
    "tldr": "SOAR提出了一种针对近似最近邻搜索的新数据索引技术，通过使用增强正交残差损失来优化每个表示，从而改善了索引质量并实现了最先进的性能表现。",
    "en_tdlr": "SOAR proposes a novel data indexing technique for approximate nearest neighbor search by optimizing each representation with orthogonality-amplified residual loss, leading to improved index quality and state-of-the-art performance."
}