{
    "title": "A Review of Modern Recommender Systems Using Generative Models (Gen-RecSys)",
    "abstract": "arXiv:2404.00579v1 Announce Type: cross  Abstract: Traditional recommender systems (RS) have used user-item rating histories as their primary data source, with collaborative filtering being one of the principal methods. However, generative models have recently developed abilities to model and sample from complex data distributions, including not only user-item interaction histories but also text, images, and videos - unlocking this rich data for novel recommendation tasks. Through this comprehensive and multi-disciplinary survey, we aim to connect the key advancements in RS using Generative Models (Gen-RecSys), encompassing: a foundational overview of interaction-driven generative models; the application of large language models (LLM) for generative recommendation, retrieval, and conversational recommendation; and the integration of multimodal models for processing and generating image and video content in RS. Our holistic perspective allows us to highlight necessary paradigms for eval",
    "link": "https://arxiv.org/abs/2404.00579",
    "context": "Title: A Review of Modern Recommender Systems Using Generative Models (Gen-RecSys)\nAbstract: arXiv:2404.00579v1 Announce Type: cross  Abstract: Traditional recommender systems (RS) have used user-item rating histories as their primary data source, with collaborative filtering being one of the principal methods. However, generative models have recently developed abilities to model and sample from complex data distributions, including not only user-item interaction histories but also text, images, and videos - unlocking this rich data for novel recommendation tasks. Through this comprehensive and multi-disciplinary survey, we aim to connect the key advancements in RS using Generative Models (Gen-RecSys), encompassing: a foundational overview of interaction-driven generative models; the application of large language models (LLM) for generative recommendation, retrieval, and conversational recommendation; and the integration of multimodal models for processing and generating image and video content in RS. Our holistic perspective allows us to highlight necessary paradigms for eval",
    "path": "papers/24/04/2404.00579.json",
    "total_tokens": 829,
    "translated_title": "使用生成模型的现代推荐系统（Gen-RecSys）综述",
    "translated_abstract": "传统的推荐系统（RS）通常使用用户-项目评分历史作为主要数据来源，协同过滤是主要方法之一。然而，生成模型最近已经具备了建模和采样复杂数据分布的能力，不仅可以涵盖用户-项目交互历史，还可以包括文本、图像和视频，为新颖的推荐任务解锁了丰富的数据。通过这篇全面的、多学科的调研，我们旨在探讨使用生成模型（Gen-RecSys）在RS中的关键进展，包括：基于交互驱动的生成模型的基础概述；大型语言模型（LLM）在生成推荐、检索和对话推荐中的应用；以及用于处理和生成RS中的图像和视频内容的多模态模型的整合。我们的整体视角使我们能够强调评估所需范式的重要性。",
    "tldr": "生成模型在现代推荐系统中展现出了强大的潜力，能够同时处理用户-项目交互历史、文本、图像和视频等复杂数据，为推荐系统带来了新的可能性。",
    "en_tdlr": "Generative models have shown great potential in modern recommender systems by handling complex data such as user-item interaction histories, text, images, and videos, bringing new possibilities to recommendation tasks."
}