{
    "title": "Red-Teaming Segment Anything Model",
    "abstract": "arXiv:2404.02067v1 Announce Type: cross  Abstract: Foundation models have emerged as pivotal tools, tackling many complex tasks through pre-training on vast datasets and subsequent fine-tuning for specific applications. The Segment Anything Model is one of the first and most well-known foundation models for computer vision segmentation tasks. This work presents a multi-faceted red-teaming analysis that tests the Segment Anything Model against challenging tasks: (1) We analyze the impact of style transfer on segmentation masks, demonstrating that applying adverse weather conditions and raindrops to dashboard images of city roads significantly distorts generated masks. (2) We focus on assessing whether the model can be used for attacks on privacy, such as recognizing celebrities' faces, and show that the model possesses some undesired knowledge in this task. (3) Finally, we check how robust the model is to adversarial attacks on segmentation masks under text prompts. We not only show the",
    "link": "https://arxiv.org/abs/2404.02067",
    "context": "Title: Red-Teaming Segment Anything Model\nAbstract: arXiv:2404.02067v1 Announce Type: cross  Abstract: Foundation models have emerged as pivotal tools, tackling many complex tasks through pre-training on vast datasets and subsequent fine-tuning for specific applications. The Segment Anything Model is one of the first and most well-known foundation models for computer vision segmentation tasks. This work presents a multi-faceted red-teaming analysis that tests the Segment Anything Model against challenging tasks: (1) We analyze the impact of style transfer on segmentation masks, demonstrating that applying adverse weather conditions and raindrops to dashboard images of city roads significantly distorts generated masks. (2) We focus on assessing whether the model can be used for attacks on privacy, such as recognizing celebrities' faces, and show that the model possesses some undesired knowledge in this task. (3) Finally, we check how robust the model is to adversarial attacks on segmentation masks under text prompts. We not only show the",
    "path": "papers/24/04/2404.02067.json",
    "total_tokens": 825,
    "translated_title": "红队测试端分任意模型",
    "translated_abstract": "基础模型已经成为重要的工具，通过在大量数据集上进行预训练，然后对特定应用进行微调，来解决许多复杂任务。端分任意模型是计算机视觉分割任务中第一个也是最知名的基础模型之一。本文提出了一个多方面的红队分析，测试了端分任意模型在挑战性任务上的表现：（1）我们分析了风格迁移对分割掩模的影响，证明将逆境天气条件和雨滴应用于城市道路仪表盘图像显著扭曲生成的掩模。（2）我们专注于评估模型是否可以用于攻击隐私，如识别名人的面孔，并显示出模型在这一任务上具有一些不良知识。（3）最后，我们检查模型在文本提示下对分割掩模的敌对攻击有多强大。我们不仅展示了",
    "tldr": "本文对端分任意模型进行了多方面的红队分析，发现模型在应对风格迁移、隐私攻击和敌对攻击方面存在一些挑战",
    "en_tdlr": "This work presents a multi-faceted red-teaming analysis on the Segment Anything Model, revealing challenges in dealing with style transfer, privacy attacks, and adversarial attacks."
}