{
    "title": "Obfuscated Malware Detection: Investigating Real-world Scenarios through Memory Analysis",
    "abstract": "arXiv:2404.02372v1 Announce Type: cross  Abstract: In the era of the internet and smart devices, the detection of malware has become crucial for system security. Malware authors increasingly employ obfuscation techniques to evade advanced security solutions, making it challenging to detect and eliminate threats. Obfuscated malware, adept at hiding itself, poses a significant risk to various platforms, including computers, mobile devices, and IoT devices. Conventional methods like heuristic-based or signature-based systems struggle against this type of malware, as it leaves no discernible traces on the system. In this research, we propose a simple and cost-effective obfuscated malware detection system through memory dump analysis, utilizing diverse machine-learning algorithms. The study focuses on the CIC-MalMem-2022 dataset, designed to simulate real-world scenarios and assess memory-based obfuscated malware detection. We evaluate the effectiveness of machine learning algorithms, such ",
    "link": "https://arxiv.org/abs/2404.02372",
    "context": "Title: Obfuscated Malware Detection: Investigating Real-world Scenarios through Memory Analysis\nAbstract: arXiv:2404.02372v1 Announce Type: cross  Abstract: In the era of the internet and smart devices, the detection of malware has become crucial for system security. Malware authors increasingly employ obfuscation techniques to evade advanced security solutions, making it challenging to detect and eliminate threats. Obfuscated malware, adept at hiding itself, poses a significant risk to various platforms, including computers, mobile devices, and IoT devices. Conventional methods like heuristic-based or signature-based systems struggle against this type of malware, as it leaves no discernible traces on the system. In this research, we propose a simple and cost-effective obfuscated malware detection system through memory dump analysis, utilizing diverse machine-learning algorithms. The study focuses on the CIC-MalMem-2022 dataset, designed to simulate real-world scenarios and assess memory-based obfuscated malware detection. We evaluate the effectiveness of machine learning algorithms, such ",
    "path": "papers/24/04/2404.02372.json",
    "total_tokens": 776,
    "translated_title": "模糊恶意软件检测：通过内存分析调查真实场景",
    "translated_abstract": "在互联网和智能设备时代，恶意软件的检测对系统安全至关重要。恶意软件作者越来越多地使用模糊技术来规避先进的安全解决方案，使得检测和消除威胁变得具有挑战性。本研究提出了一种简单且具有成本效益的模糊恶意软件检测系统，通过内存转储分析，利用多样化的机器学习算法。该研究聚焦于CIC-MalMem-2022数据集，旨在模拟真实场景并评估基于内存的模糊恶意软件检测。我们评估了机器学习算法的有效性，如...",
    "tldr": "通过内存分析，利用机器学习算法提出了一种简单且成本效益的模糊恶意软件检测系统，重点评估其在真实场景中的效果。",
    "en_tdlr": "A simple and cost-effective obfuscated malware detection system utilizing diverse machine-learning algorithms through memory dump analysis is proposed, focusing on evaluating its effectiveness in real-world scenarios."
}