{
    "title": "Multi-Region Transfer Learning for Segmentation of Crop Field Boundaries in Satellite Images with Limited Labels",
    "abstract": "arXiv:2404.00179v1 Announce Type: cross  Abstract: The goal of field boundary delineation is to predict the polygonal boundaries and interiors of individual crop fields in overhead remotely sensed images (e.g., from satellites or drones). Automatic delineation of field boundaries is a necessary task for many real-world use cases in agriculture, such as estimating cultivated area in a region or predicting end-of-season yield in a field. Field boundary delineation can be framed as an instance segmentation problem, but presents unique research challenges compared to traditional computer vision datasets used for instance segmentation. The practical applicability of previous work is also limited by the assumption that a sufficiently-large labeled dataset is available where field boundary delineation models will be applied, which is not the reality for most regions (especially under-resourced regions such as Sub-Saharan Africa). We present an approach for segmentation of crop field boundarie",
    "link": "https://arxiv.org/abs/2404.00179",
    "context": "Title: Multi-Region Transfer Learning for Segmentation of Crop Field Boundaries in Satellite Images with Limited Labels\nAbstract: arXiv:2404.00179v1 Announce Type: cross  Abstract: The goal of field boundary delineation is to predict the polygonal boundaries and interiors of individual crop fields in overhead remotely sensed images (e.g., from satellites or drones). Automatic delineation of field boundaries is a necessary task for many real-world use cases in agriculture, such as estimating cultivated area in a region or predicting end-of-season yield in a field. Field boundary delineation can be framed as an instance segmentation problem, but presents unique research challenges compared to traditional computer vision datasets used for instance segmentation. The practical applicability of previous work is also limited by the assumption that a sufficiently-large labeled dataset is available where field boundary delineation models will be applied, which is not the reality for most regions (especially under-resourced regions such as Sub-Saharan Africa). We present an approach for segmentation of crop field boundarie",
    "path": "papers/24/04/2404.00179.json",
    "total_tokens": 831,
    "translated_title": "多区域迁移学习用于在卫星图像中分割农田边界",
    "translated_abstract": "田界勾画的目标是在高空感应图像（例如来自卫星或无人机的图像）中预测单个农田的多边形边界和内部。自动勾画田界是许多农业实际用例中必不可少的任务，例如估计一个地区的耕地面积或预测一个田地的季末产量。田界勾画可以被归类为一个实例分割问题，但与传统用于实例分割的计算机视觉数据集相比，它提出了独特的研究挑战。以前作品的实际适用性也受限于一个假设，即在田界勾画模型将被应用的地方有足够大的标记数据集可用，这对大多数地区来说并非现实（尤其是在资源匮乏的地区，如撒哈拉以南的非洲）。我们提出了一种用于农田边界分割的方法。",
    "tldr": "提出了一种多区域迁移学习的方法，用于在卫星图像中分割农田边界，解决了标记数据不足的问题。",
    "en_tdlr": "Proposed a multi-region transfer learning approach for segmentation of crop field boundaries in satellite images, addressing the issue of limited labeled data."
}