{
    "title": "IndoCulture: Exploring Geographically-Influenced Cultural Commonsense Reasoning Across Eleven Indonesian Provinces",
    "abstract": "arXiv:2404.01854v1 Announce Type: new  Abstract: Although commonsense reasoning is greatly shaped by cultural and geographical factors, previous studies on language models have predominantly centered on English cultures, potentially resulting in an Anglocentric bias. In this paper, we introduce IndoCulture, aimed at understanding the influence of geographical factors on language model reasoning ability, with a specific emphasis on the diverse cultures found within eleven Indonesian provinces. In contrast to prior works that relied on templates (Yin et al., 2022) and online scrapping (Fung et al., 2024), we created IndoCulture by asking local people to manually develop the context and plausible options based on predefined topics. Evaluations of 23 language models reveal several insights: (1) even the best open-source model struggles with an accuracy of 53.2%, (2) models often provide more accurate predictions for specific provinces, such as Bali and West Java, and (3) the inclusion of l",
    "link": "https://arxiv.org/abs/2404.01854",
    "context": "Title: IndoCulture: Exploring Geographically-Influenced Cultural Commonsense Reasoning Across Eleven Indonesian Provinces\nAbstract: arXiv:2404.01854v1 Announce Type: new  Abstract: Although commonsense reasoning is greatly shaped by cultural and geographical factors, previous studies on language models have predominantly centered on English cultures, potentially resulting in an Anglocentric bias. In this paper, we introduce IndoCulture, aimed at understanding the influence of geographical factors on language model reasoning ability, with a specific emphasis on the diverse cultures found within eleven Indonesian provinces. In contrast to prior works that relied on templates (Yin et al., 2022) and online scrapping (Fung et al., 2024), we created IndoCulture by asking local people to manually develop the context and plausible options based on predefined topics. Evaluations of 23 language models reveal several insights: (1) even the best open-source model struggles with an accuracy of 53.2%, (2) models often provide more accurate predictions for specific provinces, such as Bali and West Java, and (3) the inclusion of l",
    "path": "papers/24/04/2404.01854.json",
    "total_tokens": 943,
    "translated_title": "IndoCulture: 探索印尼十一个省份间地理影响的文化常识推理",
    "translated_abstract": "尽管常识推理受文化和地理因素的极大影响，先前关于语言模型的研究主要集中在英语文化上，可能导致一种以英语为中心的偏见。本文介绍了IndoCulture，旨在理解地理因素对语言模型推理能力的影响，特别强调了十一个印尼省份内所发现的多样文化。与先前依赖模板（Yin等，2022）和在线抓取（Fung等，2024）的作品不同，我们通过询问当地人手动开发预定义主题的上下文和合理选项来创建IndoCulture。对23个语言模型的评估揭示了几个见解：（1）即使是最好的开源模型也难以达到53.2％的准确性，（2）模型通常为特定省份（如巴厘岛和西爪哇）提供更准确的预测，（3）包含地理信息可显着改善模型的表现。",
    "tldr": "本研究介绍了IndoCulture项目，旨在通过当地人手动收集数据，探索印尼十一个省份间地理影响的文化常识推理。评估发现，即使是最好的语言模型也在特定省份上表现更准确，而添加地理信息有助于提高模型性能。",
    "en_tdlr": "This study introduces the IndoCulture project, aiming to explore geographically-influenced cultural commonsense reasoning across eleven Indonesian provinces through manual data collection from local people. Evaluations reveal that even the best language models perform more accurately on specific provinces, and including geographical information helps improve model performance."
}