{
    "title": "Effector: A Python package for regional explanations",
    "abstract": "arXiv:2404.02629v1 Announce Type: new  Abstract: Global feature effect methods explain a model outputting one plot per feature. The plot shows the average effect of the feature on the output, like the effect of age on the annual income. However, average effects may be misleading when derived from local effects that are heterogeneous, i.e., they significantly deviate from the average. To decrease the heterogeneity, regional effects provide multiple plots per feature, each representing the average effect within a specific subspace. For interpretability, subspaces are defined as hyperrectangles defined by a chain of logical rules, like age's effect on annual income separately for males and females and different levels of professional experience. We introduce Effector, a Python library dedicated to regional feature effects. Effector implements well-established global effect methods, assesses the heterogeneity of each method and, based on that, provides regional effects. Effector automatica",
    "link": "https://arxiv.org/abs/2404.02629",
    "context": "Title: Effector: A Python package for regional explanations\nAbstract: arXiv:2404.02629v1 Announce Type: new  Abstract: Global feature effect methods explain a model outputting one plot per feature. The plot shows the average effect of the feature on the output, like the effect of age on the annual income. However, average effects may be misleading when derived from local effects that are heterogeneous, i.e., they significantly deviate from the average. To decrease the heterogeneity, regional effects provide multiple plots per feature, each representing the average effect within a specific subspace. For interpretability, subspaces are defined as hyperrectangles defined by a chain of logical rules, like age's effect on annual income separately for males and females and different levels of professional experience. We introduce Effector, a Python library dedicated to regional feature effects. Effector implements well-established global effect methods, assesses the heterogeneity of each method and, based on that, provides regional effects. Effector automatica",
    "path": "papers/24/04/2404.02629.json",
    "total_tokens": 798,
    "translated_title": "Effector: 一个用于区域解释的Python软件包",
    "translated_abstract": "全局特征效果方法解释一个输出模型，每个特征对应一个图。该图显示特征对输出的平均效果，例如年龄对年收入的影响。然而，当由异质局部效果推导出平均效果时，平均效果可能具有误导性，即明显偏离平均值。为了减少异质性，区域效果为每个特征提供多个图，每个图代表特定子空间内的平均效果。为了可解释性，子空间被定义为由逻辑规则链定义的超矩形，例如年龄对男性和女性的年收入的影响，以及不同专业经验水平。我们介绍了Effector，一个致力于区域特征效果的Python库。Effector实现了一些成熟的全局效果方法，评估每种方法的异质性，并基于此提供区域效果。",
    "tldr": "Effector是一个专注于区域特征效果的Python软件包，通过引入区域效果来降低全局特征效果方法中可能的异质性。",
    "en_tdlr": "Effector is a Python package dedicated to regional feature effects, reducing potential heterogeneity in global feature effect methods by introducing regional effects."
}