{
    "title": "Verifiable Goal Recognition for Autonomous Driving with Occlusions. (arXiv:2206.14163v2 [cs.RO] UPDATED)",
    "abstract": "Goal recognition (GR) involves inferring the goals of other vehicles, such as a certain junction exit, which can enable more accurate prediction of their future behaviour. In autonomous driving, vehicles can encounter many different scenarios and the environment may be partially observable due to occlusions. We present a novel GR method named Goal Recognition with Interpretable Trees under Occlusion (OGRIT). OGRIT uses decision trees learned from vehicle trajectory data to infer the probabilities of a set of generated goals. We demonstrate that OGRIT can handle missing data due to occlusions and make inferences across multiple scenarios using the same learned decision trees, while being computationally fast, accurate, interpretable and verifiable. We also release the inDO, rounDO and OpenDDO datasets of occluded regions used to evaluate OGRIT.",
    "link": "http://arxiv.org/abs/2206.14163",
    "context": "Title: Verifiable Goal Recognition for Autonomous Driving with Occlusions. (arXiv:2206.14163v2 [cs.RO] UPDATED)\nAbstract: Goal recognition (GR) involves inferring the goals of other vehicles, such as a certain junction exit, which can enable more accurate prediction of their future behaviour. In autonomous driving, vehicles can encounter many different scenarios and the environment may be partially observable due to occlusions. We present a novel GR method named Goal Recognition with Interpretable Trees under Occlusion (OGRIT). OGRIT uses decision trees learned from vehicle trajectory data to infer the probabilities of a set of generated goals. We demonstrate that OGRIT can handle missing data due to occlusions and make inferences across multiple scenarios using the same learned decision trees, while being computationally fast, accurate, interpretable and verifiable. We also release the inDO, rounDO and OpenDDO datasets of occluded regions used to evaluate OGRIT.",
    "path": "papers/22/06/2206.14163.json",
    "total_tokens": 825,
    "translated_title": "具有遮挡的自动驾驶的可验证目标识别",
    "translated_abstract": "目标识别（GR）涉及推断其他车辆的目标，例如特定的路口出口，这可以更准确地预测它们的未来行为。在自动驾驶中，车辆可能会遇到许多不同的情景，由于遮挡，环境可能是部分可观察的。我们提出了一种名为OGRIT（Goal Recognition with Interpretable Trees under Occlusion）的新型GR方法。OGRIT利用从车辆轨迹数据学习到的决策树来推断一组生成目标的概率。我们证明了OGRIT能够处理由于遮挡而导致的数据缺失，并且使用相同的学习决策树在多个场景中进行推理，同时具有计算速度快，准确性高，可解释性强和可验证性的特点。我们还发布了用于评估OGRIT的遮挡区域的inDO，rounDO和OpenDDO数据集。",
    "tldr": "OGRIT是一种用于自动驾驶的目标识别方法，能够处理遮挡导致的数据缺失，并且具有快速、准确、可解释和可验证的特点。"
}