{
    "title": "Cooperative Retriever and Ranker in Deep Recommenders. (arXiv:2206.14649v2 [cs.IR] UPDATED)",
    "abstract": "Deep recommender systems (DRS) are intensively applied in modern web services. To deal with the massive web contents, DRS employs a two-stage workflow: retrieval and ranking, to generate its recommendation results. The retriever aims to select a small set of relevant candidates from the entire items with high efficiency; while the ranker, usually more precise but time-consuming, is supposed to further refine the best items from the retrieved candidates. Traditionally, the two components are trained either independently or within a simple cascading pipeline, which is prone to poor collaboration effect. Though some latest works suggested to train retriever and ranker jointly, there still exist many severe limitations: item distribution shift between training and inference, false negative, and misalignment of ranking order. As such, it remains to explore effective collaborations between retriever and ranker.",
    "link": "http://arxiv.org/abs/2206.14649",
    "context": "Title: Cooperative Retriever and Ranker in Deep Recommenders. (arXiv:2206.14649v2 [cs.IR] UPDATED)\nAbstract: Deep recommender systems (DRS) are intensively applied in modern web services. To deal with the massive web contents, DRS employs a two-stage workflow: retrieval and ranking, to generate its recommendation results. The retriever aims to select a small set of relevant candidates from the entire items with high efficiency; while the ranker, usually more precise but time-consuming, is supposed to further refine the best items from the retrieved candidates. Traditionally, the two components are trained either independently or within a simple cascading pipeline, which is prone to poor collaboration effect. Though some latest works suggested to train retriever and ranker jointly, there still exist many severe limitations: item distribution shift between training and inference, false negative, and misalignment of ranking order. As such, it remains to explore effective collaborations between retriever and ranker.",
    "path": "papers/22/06/2206.14649.json",
    "total_tokens": 906,
    "translated_title": "深度推荐系统中的协作检索器和排名器",
    "translated_abstract": "深度推荐系统(DRS)在现代网络服务中被广泛应用。为了处理海量网络内容，DRS采用了两阶段工作流程：检索和排名，以生成其推荐结果。检索器旨在高效地从整个项目中选择一小组相关候选项；而排名器通常更精确但时间消耗更大，应进一步从检索候选项中优化最佳项目。传统上，两个组件要么独立训练，要么在简单的级联管道内训练，这容易产生合作效果差的问题。尽管最近一些工作建议联合训练检索器和排名器，但仍存在许多严重限制：训练和推理中的项分布转移、假阴性和排名顺序不对齐等。因此，探索检索器和排名器之间的有效协作仍然是必要的。",
    "tldr": "本文介绍了深度推荐系统中的检索和排名两阶段工作流程。传统方法中，这两个组件都是独立训练或使用简单的级联管道，效果不佳。最近一些工作提出联合训练检索器和排名器，但仍存在许多限制。因此，还需要探索更有效的协作方法。",
    "en_tdlr": "The paper presents the two-stage workflow of retrieval and ranking in deep recommender systems. Traditionally, the two components are trained independently or using a simple cascading pipeline, leading to poor collaboration effects. Recent works propose joint training of retriever and ranker, but there are still severe limitations, calling for further exploration of effective collaborations."
}