{
    "title": "A novel physics-informed machine learning strategy to accelerate unsteady heat and mass transfer simulations. (arXiv:2206.06817v2 [physics.flu-dyn] UPDATED)",
    "abstract": "Despite the rapid advancements in the performance of central processing units (CPUs), the simulation of unsteady heat and mass transfer is computationally very costly, particularly in large domains. While a big wave of machine learning (ML) has propagated in accelerating computational fluid dynamics (CFD) studies, recent research has revealed that it is unrealistic to completely suppress the error increase as the gap between the training and prediction times increases in single training approach. In this study, we propose a residual-based physics-informed transfer learning (RePIT) strategy to accelerate unsteady heat and mass transfer simulations using ML-CFD cross computation. Our hypothesis is that long-term CFD simulations become feasible if continuous ML-CFD cross computation is periodically carried out to not only reduce increased residuals but also update network parameters with the latest CFD time series data (transfer learning approach). The cross point of ML-CFD is determined ",
    "link": "http://arxiv.org/abs/2206.06817",
    "context": "Title: A novel physics-informed machine learning strategy to accelerate unsteady heat and mass transfer simulations. (arXiv:2206.06817v2 [physics.flu-dyn] UPDATED)\nAbstract: Despite the rapid advancements in the performance of central processing units (CPUs), the simulation of unsteady heat and mass transfer is computationally very costly, particularly in large domains. While a big wave of machine learning (ML) has propagated in accelerating computational fluid dynamics (CFD) studies, recent research has revealed that it is unrealistic to completely suppress the error increase as the gap between the training and prediction times increases in single training approach. In this study, we propose a residual-based physics-informed transfer learning (RePIT) strategy to accelerate unsteady heat and mass transfer simulations using ML-CFD cross computation. Our hypothesis is that long-term CFD simulations become feasible if continuous ML-CFD cross computation is periodically carried out to not only reduce increased residuals but also update network parameters with the latest CFD time series data (transfer learning approach). The cross point of ML-CFD is determined ",
    "path": "papers/22/06/2206.06817.json",
    "total_tokens": 954,
    "translated_title": "一种新颖的物理约束机器学习策略加速非稳态传热和传质模拟",
    "translated_abstract": "尽管中央处理器（CPU）的性能迅速提升，但非稳态传热和传质模拟在大型领域中的计算成本非常高。尽管机器学习在加速计算流体力学（CFD）研究方面取得了重大进展，但最近的研究表明，在单次训练方法中，随着训练和预测时间之间的差距增加，完全消除错误增长是不现实的。在本研究中，我们提出了一种基于残差的物理约束迁移学习（RePIT）策略，利用ML-CFD交叉计算加速非稳态传热和传质模拟。我们的假设是，如果定期进行连续的ML-CFD交叉计算，不仅可以减小残差的增加，还可以使用最新的CFD时间序列数据更新网络参数（迁移学习方法），从而实现长期CFD模拟的可行性。",
    "tldr": "本研究通过提出一种基于残差的物理约束迁移学习（RePIT）策略，利用ML-CFD交叉计算加速非稳态传热和传质模拟。这种方法可以减小残差的增加，并使用最新的CFD时间序列数据更新网络参数，从而实现长期CFD模拟的可行性。",
    "en_tdlr": "This study proposes a residual-based physics-informed transfer learning (RePIT) strategy to accelerate unsteady heat and mass transfer simulations using ML-CFD cross computation. The approach reduces the error increase and updates network parameters with the latest CFD time series data, enabling long-term CFD simulations."
}