{
    "title": "Shedding a PAC-Bayesian Light on Adaptive Sliced-Wasserstein Distances. (arXiv:2206.03230v3 [stat.ML] UPDATED)",
    "abstract": "The Sliced-Wasserstein distance (SW) is a computationally efficient and theoretically grounded alternative to the Wasserstein distance. Yet, the literature on its statistical properties -- or, more accurately, its generalization properties -- with respect to the distribution of slices, beyond the uniform measure, is scarce. To bring new contributions to this line of research, we leverage the PAC-Bayesian theory and a central observation that SW may be interpreted as an average risk, the quantity PAC-Bayesian bounds have been designed to characterize. We provide three types of results: i) PAC-Bayesian generalization bounds that hold on what we refer as adaptive Sliced-Wasserstein distances, i.e. SW defined with respect to arbitrary distributions of slices (among which data-dependent distributions), ii) a principled procedure to learn the distribution of slices that yields maximally discriminative SW, by optimizing our theoretical bounds, and iii) empirical illustrations of our theoretic",
    "link": "http://arxiv.org/abs/2206.03230",
    "context": "Title: Shedding a PAC-Bayesian Light on Adaptive Sliced-Wasserstein Distances. (arXiv:2206.03230v3 [stat.ML] UPDATED)\nAbstract: The Sliced-Wasserstein distance (SW) is a computationally efficient and theoretically grounded alternative to the Wasserstein distance. Yet, the literature on its statistical properties -- or, more accurately, its generalization properties -- with respect to the distribution of slices, beyond the uniform measure, is scarce. To bring new contributions to this line of research, we leverage the PAC-Bayesian theory and a central observation that SW may be interpreted as an average risk, the quantity PAC-Bayesian bounds have been designed to characterize. We provide three types of results: i) PAC-Bayesian generalization bounds that hold on what we refer as adaptive Sliced-Wasserstein distances, i.e. SW defined with respect to arbitrary distributions of slices (among which data-dependent distributions), ii) a principled procedure to learn the distribution of slices that yields maximally discriminative SW, by optimizing our theoretical bounds, and iii) empirical illustrations of our theoretic",
    "path": "papers/22/06/2206.03230.json",
    "total_tokens": 947,
    "translated_title": "自适应切片瓦砾斯坦距离的 PAC-Bayesian 光照",
    "translated_abstract": "切片瓦砾斯坦距离（SW）是瓦砾斯坦距离的一种计算有效且理论基础良好的替代方法。然而，关于其统计特性（或更准确地说，关于其相对于“切片”的分布的概括特性，超越均匀分布），文献资料极为有限。为了为这一研究方向带来新的贡献，本文利用 PAC-Bayesian 理论和一个核心观察结果：SW 可以被解释为平均风险，PAC-Bayesian 界定其特性的量。本文提供了三种结果：i）PAC-Bayesian 的概括性界限，适用于我们所称的自适应切片瓦砾斯坦距离，即相对于任意分布的切片（包括数据相关分布）定义的 SW；ii）一种基于理论界限的原则性流程，用于学习切片分布，以得到最大判别 SW；iii）我们的理论和算法的实证说明。",
    "tldr": "本文利用 PAC-Bayesian 理论，提出了自适应切片瓦砾斯坦距离的概括特性界限和一种基于界限的切片分布学习流程，以提高 SW 的判别度。",
    "en_tdlr": "This paper proposes PAC-Bayesian generalization bounds and a principled procedure for learning the distribution of slices to optimize the discriminative power of the Sliced-Wasserstein distance, which is interpreted as an average risk and defined with respect to arbitrary distributions of slices."
}