{
    "title": "Inference for Matched Tuples and Fully Blocked Factorial Designs. (arXiv:2206.04157v4 [econ.EM] UPDATED)",
    "abstract": "This paper studies inference in randomized controlled trials with multiple treatments, where treatment status is determined according to a \"matched tuples\" design. Here, by a matched tuples design, we mean an experimental design where units are sampled i.i.d. from the population of interest, grouped into \"homogeneous\" blocks with cardinality equal to the number of treatments, and finally, within each block, each treatment is assigned exactly once uniformly at random. We first study estimation and inference for matched tuples designs in the general setting where the parameter of interest is a vector of linear contrasts over the collection of average potential outcomes for each treatment. Parameters of this form include standard average treatment effects used to compare one treatment relative to another, but also include parameters which may be of interest in the analysis of factorial designs. We first establish conditions under which a sample analogue estimator is asymptotically normal ",
    "link": "http://arxiv.org/abs/2206.04157",
    "context": "Title: Inference for Matched Tuples and Fully Blocked Factorial Designs. (arXiv:2206.04157v4 [econ.EM] UPDATED)\nAbstract: This paper studies inference in randomized controlled trials with multiple treatments, where treatment status is determined according to a \"matched tuples\" design. Here, by a matched tuples design, we mean an experimental design where units are sampled i.i.d. from the population of interest, grouped into \"homogeneous\" blocks with cardinality equal to the number of treatments, and finally, within each block, each treatment is assigned exactly once uniformly at random. We first study estimation and inference for matched tuples designs in the general setting where the parameter of interest is a vector of linear contrasts over the collection of average potential outcomes for each treatment. Parameters of this form include standard average treatment effects used to compare one treatment relative to another, but also include parameters which may be of interest in the analysis of factorial designs. We first establish conditions under which a sample analogue estimator is asymptotically normal ",
    "path": "papers/22/06/2206.04157.json",
    "total_tokens": 915,
    "translated_title": "匹配元组与完全阻塞因子设计中的推断",
    "translated_abstract": "本文研究了随机对照试验中多个治疗方案的推断，其中治疗状态根据“匹配元组”设计确定。这里，“匹配元组”设计是指实验设计，其中单位从感兴趣的人群中独立同分布采样，被分为“同质”块，块的基数等于治疗方案的数量，最后，在每个块中，每种治疗方案都恰好被随机分配一次。我们首先研究了在参数为每种治疗方案的平均潜在结果集合上的线性对比向量时的匹配元组设计的估计和推断。这种形式的参数包括用于比较一种治疗相对于另一种治疗的标准平均治疗效果，但还包括可能在因子设计的分析中感兴趣的参数。我们先建立了一个样本模拟估计的渐近正态条件。",
    "tldr": "本文研究了基于匹配元组设计的随机对照试验中多个治疗方案的推断。通过匹配元组设计，我们可以获得每种治疗方案的平均潜在结果集合上的线性对比向量参数，包括标准的平均治疗效果，同时还可以分析因子设计中的其他参数。",
    "en_tdlr": "This paper studies inference in randomized controlled trials with multiple treatments based on matched tuples design. The parameter of interest is a vector of linear contrasts over the collection of average potential outcomes for each treatment, including standard average treatment effects and other parameters of interest in factorial designs."
}