{
    "title": "RoCourseNet: Distributionally Robust Training of a Prediction Aware Recourse Model. (arXiv:2206.00700v2 [cs.LG] UPDATED)",
    "abstract": "Counterfactual (CF) explanations for machine learning (ML) models are preferred by end-users, as they explain the predictions of ML models by providing a recourse (or contrastive) case to individuals who are adversely impacted by predicted outcomes. Existing CF explanation methods generate recourses under the assumption that the underlying target ML model remains stationary over time. However, due to commonly occurring distributional shifts in training data, ML models constantly get updated in practice, which might render previously generated recourses invalid and diminish end-users trust in our algorithmic framework. To address this problem, we propose RoCourseNet, a training framework that jointly optimizes predictions and recourses that are robust to future data shifts. This work contains four key contributions: (1) We formulate the robust recourse generation problem as a tri-level optimization problem which consists of two sub-problems: (i) a bi-level problem that finds the worst-c",
    "link": "http://arxiv.org/abs/2206.00700",
    "context": "Title: RoCourseNet: Distributionally Robust Training of a Prediction Aware Recourse Model. (arXiv:2206.00700v2 [cs.LG] UPDATED)\nAbstract: Counterfactual (CF) explanations for machine learning (ML) models are preferred by end-users, as they explain the predictions of ML models by providing a recourse (or contrastive) case to individuals who are adversely impacted by predicted outcomes. Existing CF explanation methods generate recourses under the assumption that the underlying target ML model remains stationary over time. However, due to commonly occurring distributional shifts in training data, ML models constantly get updated in practice, which might render previously generated recourses invalid and diminish end-users trust in our algorithmic framework. To address this problem, we propose RoCourseNet, a training framework that jointly optimizes predictions and recourses that are robust to future data shifts. This work contains four key contributions: (1) We formulate the robust recourse generation problem as a tri-level optimization problem which consists of two sub-problems: (i) a bi-level problem that finds the worst-c",
    "path": "papers/22/06/2206.00700.json",
    "total_tokens": 874,
    "translated_title": "RoCourseNet：预测感知回应模型的分布鲁棒训练",
    "translated_abstract": "机器学习模型的因果反事实（CF）解释是最终用户偏好的，因为它们通过为受到预测结果不利影响的个体提供补救（或对比）案例来解释机器学习模型的预测。现有的CF解释方法在假设目标机器学习模型在时间上保持稳定的情况下生成回应。然而，由于训练数据中普遍存在的分布偏移，实际中机器学习模型不断更新，这可能会使先前生成的回应无效，并降低最终用户对我们算法框架的信任。为了解决这个问题，我们提出了RoCourseNet，这是一个同时优化对未来数据偏移鲁棒的预测和回应的训练框架。这项工作包含四个关键贡献：（1）我们将鲁棒的回应生成问题定义为一个三层优化问题，其中包含两个子问题：（i）一个双层问题，找到最坏的",
    "tldr": "RoCourseNet提出了一个分布鲁棒的训练框架，用于同时优化预测和回应，以解决因为训练数据分布偏移造成的回应无效问题。",
    "en_tdlr": "RoCourseNet proposes a distributionally robust training framework to optimize both predictions and recourses, addressing the issue of invalid recourse due to distributional shifts in training data."
}