{
    "title": "Automated GI tract segmentation using deep learning. (arXiv:2206.11048v5 [eess.IV] UPDATED)",
    "abstract": "The job of Radiation oncologists is to deliver x-ray beams pointed toward the tumor and at the same time avoid the stomach and intestines. With MR-Linacs (magnetic resonance imaging and linear accelerator systems), oncologists can visualize the position of the tumor and allow for precise dose according to tumor cell presence which can vary from day to day. The current job of outlining the position of the stomach and intestines to adjust the X-ray beams direction for the dose delivery to the tumor while avoiding the organs. This is a time-consuming and labor-intensive process that can easily prolong treatments from 15 minutes to an hour a day unless deep learning methods can automate the segmentation process. This paper discusses an automated segmentation process using deep learning to make this process faster and allow more patients to get effective treatment.",
    "link": "http://arxiv.org/abs/2206.11048",
    "context": "Title: Automated GI tract segmentation using deep learning. (arXiv:2206.11048v5 [eess.IV] UPDATED)\nAbstract: The job of Radiation oncologists is to deliver x-ray beams pointed toward the tumor and at the same time avoid the stomach and intestines. With MR-Linacs (magnetic resonance imaging and linear accelerator systems), oncologists can visualize the position of the tumor and allow for precise dose according to tumor cell presence which can vary from day to day. The current job of outlining the position of the stomach and intestines to adjust the X-ray beams direction for the dose delivery to the tumor while avoiding the organs. This is a time-consuming and labor-intensive process that can easily prolong treatments from 15 minutes to an hour a day unless deep learning methods can automate the segmentation process. This paper discusses an automated segmentation process using deep learning to make this process faster and allow more patients to get effective treatment.",
    "path": "papers/22/06/2206.11048.json",
    "total_tokens": 842,
    "translated_title": "使用深度学习进行自动化胃肠道分割",
    "translated_abstract": "放射治疗专家的工作是将X射线束指向肿瘤的同时避免胃和肠道。通过MR-Linacs（磁共振成像和线性加速器系统），放射治疗专家可以可视化肿瘤位置，并根据肿瘤细胞的存在情况精确控制剂量，而这种情况每天都可能有所变化。目前的工作是确定胃和肠道的位置，以调整X射线束的方向，以便将剂量准确递送到肿瘤并避免这些器官。这是一个耗时且人力密集的过程，除非采用深度学习方法自动化分割过程，否则治疗时间很容易从15分钟延长到每天1小时。本文讨论了使用深度学习的自动化分割过程，以加快此过程并使更多患者获得有效治疗。",
    "tldr": "本文介绍了使用深度学习的自动化分割过程，旨在加快肿瘤治疗中调整剂量递送路径的流程，避免耗时的手动操作，提高患者治疗效果。",
    "en_tdlr": "This paper discusses an automated segmentation process using deep learning to speed up the process of adjusting dose delivery paths for tumor treatment, avoiding time-consuming manual operations and improving treatment outcomes for patients."
}