{
    "title": "Human Mobility Prediction with Causal and Spatial-constrained Multi-task Network. (arXiv:2206.05731v4 [cs.AI] UPDATED)",
    "abstract": "Modeling human mobility helps to understand how people are accessing resources and physically contacting with each other in cities, and thus contributes to various applications such as urban planning, epidemic control, and location-based advertisement. Next location prediction is one decisive task in individual human mobility modeling and is usually viewed as sequence modeling, solved with Markov or RNN-based methods. However, the existing models paid little attention to the logic of individual travel decisions and the reproducibility of the collective behavior of population. To this end, we propose a Causal and Spatial-constrained Long and Short-term Learner (CSLSL) for next location prediction. CSLSL utilizes a causal structure based on multi-task learning to explicitly model the \"\\textit{when$\\rightarrow$what$\\rightarrow$where}\", a.k.a. \"\\textit{time$\\rightarrow$activity$\\rightarrow$location}\" decision logic. We next propose a spatial-constrained loss function as an auxiliary task, ",
    "link": "http://arxiv.org/abs/2206.05731",
    "context": "Title: Human Mobility Prediction with Causal and Spatial-constrained Multi-task Network. (arXiv:2206.05731v4 [cs.AI] UPDATED)\nAbstract: Modeling human mobility helps to understand how people are accessing resources and physically contacting with each other in cities, and thus contributes to various applications such as urban planning, epidemic control, and location-based advertisement. Next location prediction is one decisive task in individual human mobility modeling and is usually viewed as sequence modeling, solved with Markov or RNN-based methods. However, the existing models paid little attention to the logic of individual travel decisions and the reproducibility of the collective behavior of population. To this end, we propose a Causal and Spatial-constrained Long and Short-term Learner (CSLSL) for next location prediction. CSLSL utilizes a causal structure based on multi-task learning to explicitly model the \"\\textit{when$\\rightarrow$what$\\rightarrow$where}\", a.k.a. \"\\textit{time$\\rightarrow$activity$\\rightarrow$location}\" decision logic. We next propose a spatial-constrained loss function as an auxiliary task, ",
    "path": "papers/22/06/2206.05731.json",
    "total_tokens": 992,
    "translated_title": "基于因果和空间约束的多任务网络的人类流动预测",
    "translated_abstract": "建立人类流动模型有助于理解人们在城市中如何获取资源，与他人接触，因此有助于城市规划、流行病控制和基于位置的广告等各种应用。下一个位置的预测是个人流动模型中的一个决定性任务，通常被视为序列建模，使用马尔可夫或基于RNN的方法来解决。然而，现有的模型并没有给个人旅行决策的逻辑和人口集体行为的再现带来足够的重视。因此，我们提出了一种基于因果和空间约束的长短期学习器(CSLSL)，用于下一个位置的预测。CSLSL利用基于多任务学习的因果结构明确地建模 \"\\textit{when$\\rightarrow$what$\\rightarrow$where}\" 或 \"\\textit{ time$\\rightarrow$activity$\\rightarrow$location}\" 决策逻辑。我们接下来提出一个空间约束的损失函数作为辅助任务，将下一个位置的预测与城市环境的空间配置协调起来。两个大规模真实世界数据集的实验证明，我们的模型在准确性和可解释性方面优于现有的基线模型。",
    "tldr": "本文提出了一种基于因果和空间约束的多任务网络，名为CSLSL，用于人类流动的预测，并且在实验中取得了比现有基线模型更好的准确性和可解释性。",
    "en_tdlr": "The paper introduces a multi-task network named CSLSL utilizing a causal structure and spatial-constrained loss function to predict human mobility, outperforming existing baselines in accuracy and interpretability on real-world datasets."
}