{
    "title": "Inference-Based Quantum Sensing. (arXiv:2206.09919v2 [quant-ph] UPDATED)",
    "abstract": "In a standard Quantum Sensing (QS) task one aims at estimating an unknown parameter $\\theta$, encoded into an $n$-qubit probe state, via measurements of the system. The success of this task hinges on the ability to correlate changes in the parameter to changes in the system response $\\mathcal{R}(\\theta)$ (i.e., changes in the measurement outcomes). For simple cases the form of $\\mathcal{R}(\\theta)$ is known, but the same cannot be said for realistic scenarios, as no general closed-form expression exists. In this work we present an inference-based scheme for QS. We show that, for a general class of unitary families of encoding, $\\mathcal{R}(\\theta)$ can be fully characterized by only measuring the system response at $2n+1$ parameters. This allows us to infer the value of an unknown parameter given the measured response, as well as to determine the sensitivity of the scheme, which characterizes its overall performance. We show that inference error is, with high probability, smaller than ",
    "link": "http://arxiv.org/abs/2206.09919",
    "context": "Title: Inference-Based Quantum Sensing. (arXiv:2206.09919v2 [quant-ph] UPDATED)\nAbstract: In a standard Quantum Sensing (QS) task one aims at estimating an unknown parameter $\\theta$, encoded into an $n$-qubit probe state, via measurements of the system. The success of this task hinges on the ability to correlate changes in the parameter to changes in the system response $\\mathcal{R}(\\theta)$ (i.e., changes in the measurement outcomes). For simple cases the form of $\\mathcal{R}(\\theta)$ is known, but the same cannot be said for realistic scenarios, as no general closed-form expression exists. In this work we present an inference-based scheme for QS. We show that, for a general class of unitary families of encoding, $\\mathcal{R}(\\theta)$ can be fully characterized by only measuring the system response at $2n+1$ parameters. This allows us to infer the value of an unknown parameter given the measured response, as well as to determine the sensitivity of the scheme, which characterizes its overall performance. We show that inference error is, with high probability, smaller than ",
    "path": "papers/22/06/2206.09919.json",
    "total_tokens": 850,
    "translated_title": "推理为基础的量子感知",
    "translated_abstract": "在标准的量子感知任务中，通过对系统的测量，目标是估计一个未知的参数θ，将其编码到一个n比特的探针态中。这个任务的成功取决于将参数的变化与系统响应Ρ（θ）的变化（即测量结果的变化）相关联的能力。对于简单情况，Ρ（θ）的形式是已知的，但对于现实场景来说，一般不存在闭合形式的表达式。在这项工作中，我们提出了一种基于推理的量子感知方案。我们展示了对于一类常规的编码的酉族系列，只需在2n+1个参数处测量系统响应，就可以完全表征Ρ（θ）。这使得我们能够根据测量的响应推断未知参数的值，以及确定该方案的敏感性，从而表征其整体性能。我们证明了推理误差在高概率下小于...",
    "tldr": "这项工作提出了一种基于推理的量子感知方案，可以通过测量系统响应来推断未知参数的值，并确定方案的敏感性。",
    "en_tdlr": "This work presents an inference-based scheme for quantum sensing, which allows for inferring the value of an unknown parameter and determining the sensitivity of the scheme by measuring the system's response."
}