{
    "title": "Adversarial Laser Spot: Robust and Covert Physical-World Attack to DNNs. (arXiv:2206.01034v2 [cs.CV] UPDATED)",
    "abstract": "Most existing deep neural networks (DNNs) are easily disturbed by slight noise. However, there are few researches on physical attacks by deploying lighting equipment. The light-based physical attacks has excellent covertness, which brings great security risks to many vision-based applications (such as self-driving). Therefore, we propose a light-based physical attack, called adversarial laser spot (AdvLS), which optimizes the physical parameters of laser spots through genetic algorithm to perform physical attacks. It realizes robust and covert physical attack by using low-cost laser equipment. As far as we know, AdvLS is the first light-based physical attack that perform physical attacks in the daytime. A large number of experiments in the digital and physical environments show that AdvLS has excellent robustness and covertness. In addition, through in-depth analysis of the experimental data, we find that the adversarial perturbations generated by AdvLS have superior adversarial attack",
    "link": "http://arxiv.org/abs/2206.01034",
    "context": "Title: Adversarial Laser Spot: Robust and Covert Physical-World Attack to DNNs. (arXiv:2206.01034v2 [cs.CV] UPDATED)\nAbstract: Most existing deep neural networks (DNNs) are easily disturbed by slight noise. However, there are few researches on physical attacks by deploying lighting equipment. The light-based physical attacks has excellent covertness, which brings great security risks to many vision-based applications (such as self-driving). Therefore, we propose a light-based physical attack, called adversarial laser spot (AdvLS), which optimizes the physical parameters of laser spots through genetic algorithm to perform physical attacks. It realizes robust and covert physical attack by using low-cost laser equipment. As far as we know, AdvLS is the first light-based physical attack that perform physical attacks in the daytime. A large number of experiments in the digital and physical environments show that AdvLS has excellent robustness and covertness. In addition, through in-depth analysis of the experimental data, we find that the adversarial perturbations generated by AdvLS have superior adversarial attack",
    "path": "papers/22/06/2206.01034.json",
    "total_tokens": 968,
    "translated_title": "对DNNs的健壮和隐蔽的物理攻击: 对抗性激光点攻击",
    "translated_abstract": "大多数现有的深度神经网络（DNN）都容易受到微小噪声的干扰。然而，关于使用照明设备进行物理攻击的研究很少。基于光的物理攻击具有出色的隐蔽性，这给许多基于视觉的应用（如自动驾驶）带来了巨大的安全风险。因此，我们提出了一种名为对抗性激光点（AdvLS）的光学物理攻击，通过遗传算法优化激光点的物理参数进行物理攻击。它利用低成本的激光设备实现了强健和隐蔽的物理攻击。据我们所知，AdvLS是第一个在白天进行物理攻击的基于光的攻击方式。在数字和物理环境中进行了大量的实验，结果表明AdvLS具有出色的健壮性和隐蔽性。此外，通过对实验数据的深入分析，我们发现AdvLS生成的对抗性扰动具有优秀的对抗攻击能力。",
    "tldr": "这篇论文提出了一种名为对抗性激光点（AdvLS）的光学物理攻击，通过遗传算法优化激光点的物理参数进行物理攻击，实现了对DNNs的健壮和隐蔽的物理攻击。",
    "en_tdlr": "This paper proposes AdvLS, a light-based physical attack that optimizes laser spot parameters through genetic algorithm to achieve robust and covert physical attack on DNNs. AdvLS is the first light-based physical attack to perform attacks during the day and has superior adversarial attack capabilities."
}