{
    "title": "Federated Learning in Satellite Constellations. (arXiv:2206.00307v3 [cs.IT] UPDATED)",
    "abstract": "Federated learning (FL) has recently emerged as a distributed machine learning paradigm for systems with limited and intermittent connectivity. This paper presents the new context brought to FL by satellite constellations, where the connectivity patterns are significantly different from the ones observed in conventional terrestrial FL. The focus is on large constellations in low Earth orbit (LEO), where each satellites participates in a data-driven FL task using a locally stored dataset. This scenario is motivated by the trend towards mega constellations of interconnected small satellites in LEO and the integration of artificial intelligence in satellites. We propose a classification of satellite FL based on the communication capabilities of the satellites, the constellation design, and the location of the parameter server. A comprehensive overview of the current state-of-the-art in this field is provided and the unique challenges and opportunities of satellite FL are discussed. Finall",
    "link": "http://arxiv.org/abs/2206.00307",
    "context": "Title: Federated Learning in Satellite Constellations. (arXiv:2206.00307v3 [cs.IT] UPDATED)\nAbstract: Federated learning (FL) has recently emerged as a distributed machine learning paradigm for systems with limited and intermittent connectivity. This paper presents the new context brought to FL by satellite constellations, where the connectivity patterns are significantly different from the ones observed in conventional terrestrial FL. The focus is on large constellations in low Earth orbit (LEO), where each satellites participates in a data-driven FL task using a locally stored dataset. This scenario is motivated by the trend towards mega constellations of interconnected small satellites in LEO and the integration of artificial intelligence in satellites. We propose a classification of satellite FL based on the communication capabilities of the satellites, the constellation design, and the location of the parameter server. A comprehensive overview of the current state-of-the-art in this field is provided and the unique challenges and opportunities of satellite FL are discussed. Finall",
    "path": "papers/22/06/2206.00307.json",
    "total_tokens": 836,
    "translated_title": "卫星星座中的联邦学习",
    "translated_abstract": "联邦学习（FL）是一种分布式机器学习范例，适用于连通性有限和间歇性的系统。本文介绍了卫星星座对FL带来的新环境，其中连接模式明显不同于常规的地面FL。重点是在低地球轨道中的大型卫星星座，每个卫星使用本地存储的数据集参与数据驱动的FL任务。这种情况源于连接小型卫星的兆级星座和卫星中集成人工智能的趋势。我们根据卫星的通信能力、星座设计和参数服务器的位置提出了卫星FL的分类。本文提供了当前领域最新技术的综合概述，并讨论了卫星FL的独特挑战与机遇。",
    "tldr": "本文介绍了卫星星座中的联邦学习，根据卫星的通信能力、星座设计和参数服务器的位置提出了卫星FL的分类。卫星FL面临着独特的挑战和机遇。",
    "en_tdlr": "This paper presents the new environment brought to federated learning (FL) by satellite constellations and proposes a classification of satellite FL based on the communication capabilities of the satellites, the constellation design, and the location of the parameter server. The paper provides an overview of the latest technology in this field and discusses the unique challenges and opportunities of satellite FL."
}