{
    "title": "Reducing Obizhaeva-Wang type trade execution problems to LQ stochastic control problems. (arXiv:2206.03772v2 [math.OC] UPDATED)",
    "abstract": "We start with a stochastic control problem where the control process is of finite variation (possibly with jumps) and acts as integrator both in the state dynamics and in the target functional. Problems of such type arise in the stream of literature on optimal trade execution pioneered by Obizhaeva and Wang (models with finite resilience). We consider a general framework where the price impact and the resilience are stochastic processes. Both are allowed to have diffusive components. First we continuously extend the problem from processes of finite variation to progressively measurable processes. Then we reduce the extended problem to a linear quadratic (LQ) stochastic control problem. Using the well developed theory on LQ problems we describe the solution to the obtained LQ one and trace it back up to the solution to the (extended) initial trade execution problem. Finally, we illustrate our results by several examples. Among other things the examples show the Obizhaeva-Wang model with",
    "link": "http://arxiv.org/abs/2206.03772",
    "context": "Title: Reducing Obizhaeva-Wang type trade execution problems to LQ stochastic control problems. (arXiv:2206.03772v2 [math.OC] UPDATED)\nAbstract: We start with a stochastic control problem where the control process is of finite variation (possibly with jumps) and acts as integrator both in the state dynamics and in the target functional. Problems of such type arise in the stream of literature on optimal trade execution pioneered by Obizhaeva and Wang (models with finite resilience). We consider a general framework where the price impact and the resilience are stochastic processes. Both are allowed to have diffusive components. First we continuously extend the problem from processes of finite variation to progressively measurable processes. Then we reduce the extended problem to a linear quadratic (LQ) stochastic control problem. Using the well developed theory on LQ problems we describe the solution to the obtained LQ one and trace it back up to the solution to the (extended) initial trade execution problem. Finally, we illustrate our results by several examples. Among other things the examples show the Obizhaeva-Wang model with",
    "path": "papers/22/06/2206.03772.json",
    "total_tokens": 878,
    "translated_title": "将Obizhaeva-Wang型交易执行问题简化为LQ随机控制问题",
    "translated_abstract": "我们从一个随机控制问题开始，其中控制过程是有限变化的（可能有跳跃），在状态动力学和目标函数中都作为积分器。这类问题在有限弹性先驱Obizhaeva和Wang的最优交易执行文献中出现。我们考虑了一个价格冲击和弹性都是随机过程的通用框架。两者都被允许有扩散分量。首先，我们将问题从有限变差过程连续延拓到递增可测过程。然后，我们将扩展问题简化为线性二次（LQ）随机控制问题。利用已建立的LQ问题理论，我们描述了得到的LQ问题的解，并将其追溯到（扩展的）初始交易执行问题的解。最后，我们通过几个例子说明了我们的结果。其中，例子中展示了带有Obizhaeva-Wang模型的情况。",
    "tldr": "本文提出了一个通用框架，将Obizhaeva-Wang型交易执行问题简化为LQ随机控制问题，通过连续延拓和线性二次控制理论，解决了这个问题，并给出了几个例子进行验证。",
    "en_tdlr": "This paper presents a general framework for reducing Obizhaeva-Wang type trade execution problems to LQ stochastic control problems. By using continuous extension and linear quadratic control theory, the problem is solved and illustrated with several examples."
}