{
    "title": "Principal Trade-off Analysis. (arXiv:2206.07520v3 [cs.GT] UPDATED)",
    "abstract": "How are the advantage relations between a set of agents playing a game organized and how do they reflect the structure of the game? In this paper, we illustrate \"Principal Trade-off Analysis\" (PTA), a decomposition method that embeds games into a low-dimensional feature space. We argue that the embeddings are more revealing than previously demonstrated by developing an analogy to Principal Component Analysis (PCA). PTA represents an arbitrary two-player zero-sum game as the weighted sum of pairs of orthogonal 2D feature planes. We show that the feature planes represent unique strategic trade-offs and truncation of the sequence provides insightful model reduction. We demonstrate the validity of PTA on a quartet of games (Kuhn poker, RPS+2, Blotto, and Pokemon). In Kuhn poker, PTA clearly identifies the trade-off between bluffing and calling. In Blotto, PTA identifies game symmetries, and specifies strategic trade-offs associated with distinct win conditions. These symmetries reveal limi",
    "link": "http://arxiv.org/abs/2206.07520",
    "context": "Title: Principal Trade-off Analysis. (arXiv:2206.07520v3 [cs.GT] UPDATED)\nAbstract: How are the advantage relations between a set of agents playing a game organized and how do they reflect the structure of the game? In this paper, we illustrate \"Principal Trade-off Analysis\" (PTA), a decomposition method that embeds games into a low-dimensional feature space. We argue that the embeddings are more revealing than previously demonstrated by developing an analogy to Principal Component Analysis (PCA). PTA represents an arbitrary two-player zero-sum game as the weighted sum of pairs of orthogonal 2D feature planes. We show that the feature planes represent unique strategic trade-offs and truncation of the sequence provides insightful model reduction. We demonstrate the validity of PTA on a quartet of games (Kuhn poker, RPS+2, Blotto, and Pokemon). In Kuhn poker, PTA clearly identifies the trade-off between bluffing and calling. In Blotto, PTA identifies game symmetries, and specifies strategic trade-offs associated with distinct win conditions. These symmetries reveal limi",
    "path": "papers/22/06/2206.07520.json",
    "total_tokens": 869,
    "translated_title": "主要权衡分析",
    "translated_abstract": "在这篇论文中，我们介绍了\"主要权衡分析\"（PTA），一种将游戏嵌入低维特征空间的分解方法。我们通过发展与主成分分析（PCA）的类比来论证嵌入结果的可靠性。PTA将任意的两人零和游戏表示为一系列正交的二维特征平面的加权和。我们展示了这些特征平面代表了独特的战略权衡，而序列的截断提供了有洞察力的模型简化。我们在四个游戏（库恩扑克、RPS+2、布洛托和宝可梦）上验证了PTA的有效性。在库恩扑克中，PTA清晰地识别出了虚张声势和跟注之间的权衡。在布洛托中，PTA识别出了游戏的对称性，并指定了与不同胜利条件相关的战略权衡。这些对称性揭示了游戏的局限性。",
    "tldr": "本文介绍了一种名为\"主要权衡分析\"（PTA）的方法，将游戏嵌入低维特征空间，并展示了其在不同游戏中的有效性和洞察力。",
    "en_tdlr": "This paper introduces a method called Principal Trade-off Analysis (PTA) that embeds games into a low-dimensional feature space, and demonstrates its effectiveness and insights in various games."
}