{
    "title": "Computational Doob's h-transforms for Online Filtering of Discretely Observed Diffusions. (arXiv:2206.03369v2 [stat.ML] UPDATED)",
    "abstract": "This paper is concerned with online filtering of discretely observed nonlinear diffusion processes. Our approach is based on the fully adapted auxiliary particle filter, which involves Doob's $h$-transforms that are typically intractable. We propose a computational framework to approximate these $h$-transforms by solving the underlying backward Kolmogorov equations using nonlinear Feynman-Kac formulas and neural networks. The methodology allows one to train a locally optimal particle filter prior to the data-assimilation procedure. Numerical experiments illustrate that the proposed approach can be orders of magnitude more efficient than state-of-the-art particle filters in the regime of highly informative observations, when the observations are extreme under the model, or if the state dimension is large.",
    "link": "http://arxiv.org/abs/2206.03369",
    "context": "Title: Computational Doob's h-transforms for Online Filtering of Discretely Observed Diffusions. (arXiv:2206.03369v2 [stat.ML] UPDATED)\nAbstract: This paper is concerned with online filtering of discretely observed nonlinear diffusion processes. Our approach is based on the fully adapted auxiliary particle filter, which involves Doob's $h$-transforms that are typically intractable. We propose a computational framework to approximate these $h$-transforms by solving the underlying backward Kolmogorov equations using nonlinear Feynman-Kac formulas and neural networks. The methodology allows one to train a locally optimal particle filter prior to the data-assimilation procedure. Numerical experiments illustrate that the proposed approach can be orders of magnitude more efficient than state-of-the-art particle filters in the regime of highly informative observations, when the observations are extreme under the model, or if the state dimension is large.",
    "path": "papers/22/06/2206.03369.json",
    "total_tokens": 848,
    "translated_title": "离散观测扩散过程的计算Doob h变换在线滤波",
    "translated_abstract": "本文关注的是离散观测非线性扩散过程的在线滤波。我们的方法基于完全适应的辅助粒子滤波器，其中包括通常难以处理的Doob h变换。我们提出了一个计算框架，通过使用非线性Feynman-Kac公式和神经网络求解潜在的反向Kolmogorov方程来近似这些h变换。该方法允许在数据同化过程之前训练局部最优的粒子滤波器。数值实验表明，当观测值高度信息化，观测值在模型下极端，或状态维数较大时，所提出的方法比最先进的粒子滤波器高几个数量级的效率。",
    "tldr": "本文提出了一种计算Doob h变换的计算框架，用于离散观测非线性扩散过程的在线滤波。实验证明，该方法在高度信息化、观测值在模型下极端或状态维数较大时比最先进的粒子滤波器高几个数量级的效率。",
    "en_tdlr": "This paper proposes a computational framework for calculating Doob's h-transforms, used for online filtering of discretely observed nonlinear diffusion processes. The proposed approach can be orders of magnitude more efficient than state-of-the-art particle filters in highly informative observations, extreme observations under the model, or large state dimensions, as demonstrated by numerical experiments."
}