{
    "title": "Online Resource Allocation under Horizon Uncertainty. (arXiv:2206.13606v3 [cs.DS] UPDATED)",
    "abstract": "We study stochastic online resource allocation: a decision maker needs to allocate limited resources to stochastically-generated sequentially-arriving requests in order to maximize reward. At each time step, requests are drawn independently from a distribution that is unknown to the decision maker. Online resource allocation and its special cases have been studied extensively in the past, but prior results crucially and universally rely on the strong assumption that the total number of requests (the horizon) is known to the decision maker in advance. In many applications, such as revenue management and online advertising, the number of requests can vary widely because of fluctuations in demand or user traffic intensity. In this work, we develop online algorithms that are robust to horizon uncertainty. In sharp contrast to the known-horizon setting, no algorithm can achieve even a constant asymptotic competitive ratio that is independent of the horizon uncertainty. We introduce a novel ",
    "link": "http://arxiv.org/abs/2206.13606",
    "context": "Title: Online Resource Allocation under Horizon Uncertainty. (arXiv:2206.13606v3 [cs.DS] UPDATED)\nAbstract: We study stochastic online resource allocation: a decision maker needs to allocate limited resources to stochastically-generated sequentially-arriving requests in order to maximize reward. At each time step, requests are drawn independently from a distribution that is unknown to the decision maker. Online resource allocation and its special cases have been studied extensively in the past, but prior results crucially and universally rely on the strong assumption that the total number of requests (the horizon) is known to the decision maker in advance. In many applications, such as revenue management and online advertising, the number of requests can vary widely because of fluctuations in demand or user traffic intensity. In this work, we develop online algorithms that are robust to horizon uncertainty. In sharp contrast to the known-horizon setting, no algorithm can achieve even a constant asymptotic competitive ratio that is independent of the horizon uncertainty. We introduce a novel ",
    "path": "papers/22/06/2206.13606.json",
    "total_tokens": 818,
    "translated_title": "网络资源分配下的不确定性问题研究",
    "translated_abstract": "本论文探讨了随机在线资源分配问题：决策者需要将有限资源分配给以随机方式生成的顺序到达的请求，以最大化收益。在每个时间步长，请求是从一个未知于决策者的分布中独立地抽取的。在线资源分配及其特例在过去得到了广泛的研究，但以前的结果都至关重要且普遍地依赖于一个强假设：即决策者预先知道请求的总数（即时间长度）。在许多应用中，如收入管理和在线广告，由于需求或用户流量强度的波动，请求的数量可能会大幅度变化。在这项工作中，我们开发了对时间长度不确定性具有鲁棒性的在线算法。与已知时间长度环境形成鲜明对比的是，没有任何算法可以实现独立于时间长度不确定性的恒定渐近竞争比。我们引入了一种新颖的算法...",
    "tldr": "本论文研究的是随机在线资源分配问题，并且针对时间长度不确定性，提出了具有鲁棒性的在线算法。",
    "en_tdlr": "This paper studies stochastic online resource allocation problem, and proposes robust online algorithms for handling horizon uncertainty."
}