{
    "title": "Born for Auto-Tagging: Faster and better with new objective functions. (arXiv:2206.07264v2 [cs.CL] UPDATED)",
    "abstract": "Keyword extraction is a task of text mining. It is applied to increase search volume in SEO and ads. Implemented in auto-tagging, it makes tagging on a mass scale of online articles and photos efficiently and accurately. BAT is invented for auto-tagging which served as awoo's AI marketing platform (AMP). awoo AMP not only provides service as a customized recommender system but also increases the converting rate in E-commerce. The strength of BAT converges faster and better than other SOTA models, as its 4-layer structure achieves the best F scores at 50 epochs. In other words, it performs better than other models which require deeper layers at 100 epochs. To generate rich and clean tags, awoo creates new objective functions to maintain similar ${\\rm F_1}$ scores with cross-entropy while enhancing ${\\rm F_2}$ scores simultaneously. To assure the even better performance of F scores awoo revamps the learning rate strategy proposed by Transformer \\cite{Transformer} to increase ${\\rm F_1}$ ",
    "link": "http://arxiv.org/abs/2206.07264",
    "context": "Title: Born for Auto-Tagging: Faster and better with new objective functions. (arXiv:2206.07264v2 [cs.CL] UPDATED)\nAbstract: Keyword extraction is a task of text mining. It is applied to increase search volume in SEO and ads. Implemented in auto-tagging, it makes tagging on a mass scale of online articles and photos efficiently and accurately. BAT is invented for auto-tagging which served as awoo's AI marketing platform (AMP). awoo AMP not only provides service as a customized recommender system but also increases the converting rate in E-commerce. The strength of BAT converges faster and better than other SOTA models, as its 4-layer structure achieves the best F scores at 50 epochs. In other words, it performs better than other models which require deeper layers at 100 epochs. To generate rich and clean tags, awoo creates new objective functions to maintain similar ${\\rm F_1}$ scores with cross-entropy while enhancing ${\\rm F_2}$ scores simultaneously. To assure the even better performance of F scores awoo revamps the learning rate strategy proposed by Transformer \\cite{Transformer} to increase ${\\rm F_1}$ ",
    "path": "papers/22/06/2206.07264.json",
    "total_tokens": 924,
    "translated_title": "为自动标签而生：新目标函数的更快更好。",
    "translated_abstract": "关键词提取是文本挖掘的任务，应用于增加搜索引擎优化和广告的搜索量。在自动标记中实施，可以高效准确地对在线文章和照片进行大规模标记。BAT是为自动标记而发明的，它作为awoo的AI营销平台（AMP）提供服务。awoo AMP不仅提供定制的推荐系统服务，还提高了电子商务的转化率。BAT的优势在于其4层结构在50个epochs达到了最佳的F得分，收敛速度更快，效果更好。换句话说，它比其他模型表现更好，其他模型在100个epochs需要更深的层数。为了生成丰富和清晰的标签，awoo创建了新的目标函数，同时在保持与交叉熵相似的F1得分的同时增强了F2得分。为了保证F得分的更好表现，awoo改进了Transformer提出的学习率策略，增加了F1得分。",
    "tldr": "本论文提出了一种用于自动标签的新目标函数BAT，通过改进模型结构和学习率策略，在50个epochs内实现了更快、更好的收敛速度和F得分，为自动标记提供了更准确和高效的解决方案。",
    "en_tdlr": "This paper introduces a new objective function BAT for auto-tagging, which achieves faster and better convergence speed and F-scores within 50 epochs by improving the model structure and learning rate strategy, providing a more accurate and efficient solution for auto-tagging."
}