{
    "title": "SmartGD: A GAN-Based Graph Drawing Framework for Diverse Aesthetic Goals. (arXiv:2206.06434v3 [cs.LG] UPDATED)",
    "abstract": "While a multitude of studies have been conducted on graph drawing, many existing methods only focus on optimizing a single aesthetic aspect of graph layouts, which can lead to sub-optimal results. There are a few existing methods that have attempted to develop a flexible solution for optimizing different aesthetic aspects measured by different aesthetic criteria. Furthermore, thanks to the significant advance in deep learning techniques, several deep learning-based layout methods were proposed recently. These methods have demonstrated the advantages of deep learning approaches for graph drawing. However, none of these existing methods can be directly applied to optimizing non-differentiable criteria without special accommodation. In this work, we propose a novel Generative Adversarial Network (GAN) based deep learning framework for graph drawing, called SmartGD, which can optimize different quantitative aesthetic goals, regardless of their differentiability. To demonstrate the effectiv",
    "link": "http://arxiv.org/abs/2206.06434",
    "context": "Title: SmartGD: A GAN-Based Graph Drawing Framework for Diverse Aesthetic Goals. (arXiv:2206.06434v3 [cs.LG] UPDATED)\nAbstract: While a multitude of studies have been conducted on graph drawing, many existing methods only focus on optimizing a single aesthetic aspect of graph layouts, which can lead to sub-optimal results. There are a few existing methods that have attempted to develop a flexible solution for optimizing different aesthetic aspects measured by different aesthetic criteria. Furthermore, thanks to the significant advance in deep learning techniques, several deep learning-based layout methods were proposed recently. These methods have demonstrated the advantages of deep learning approaches for graph drawing. However, none of these existing methods can be directly applied to optimizing non-differentiable criteria without special accommodation. In this work, we propose a novel Generative Adversarial Network (GAN) based deep learning framework for graph drawing, called SmartGD, which can optimize different quantitative aesthetic goals, regardless of their differentiability. To demonstrate the effectiv",
    "path": "papers/22/06/2206.06434.json",
    "total_tokens": 824,
    "translated_title": "SmartGD: 一种基于GAN的图形绘制框架，用于实现多样化的美学目标。",
    "translated_abstract": "尽管已经有大量的研究在图形绘制方面进行了，但是许多现有的方法只关注优化图形布局的某一个美学方面，这可能导致次优的结果。已有的一些方法试图开发一种灵活的解决方案，以优化由不同美学标准测量的不同美学方面。此外，由于深度学习技术的重大进展，最近提出了几种基于深度学习的布局方法。这些方法展示了深度学习方法在图形绘制中的优势。然而，这些现有方法都无法直接应用于优化非可微标准而不需要特殊处理。在这项工作中，我们提出了一种新颖的基于生成对抗网络（GAN）的深度学习框架SmartGD，该框架可以优化不同的定量美学目标，无论它们是否可微。",
    "tldr": "SmartGD提出了一种基于GAN的图形绘制框架，可以优化不同的定量美学目标，解决了现有方法只关注单一美学方面的问题。",
    "en_tdlr": "SmartGD proposes a GAN-based graph drawing framework that can optimize different quantitative aesthetic goals, addressing the issue of existing methods focusing only on a single aesthetic aspect."
}