{
    "title": "Fast and Precise: Adjusting Planning Horizon with Adaptive Subgoal Search. (arXiv:2206.00702v8 [cs.AI] UPDATED)",
    "abstract": "Complex reasoning problems contain states that vary in the computational cost required to determine a good action plan. Taking advantage of this property, we propose Adaptive Subgoal Search (AdaSubS), a search method that adaptively adjusts the planning horizon. To this end, AdaSubS generates diverse sets of subgoals at different distances. A verification mechanism is employed to filter out unreachable subgoals swiftly, allowing to focus on feasible further subgoals. In this way, AdaSubS benefits from the efficiency of planning with longer subgoals and the fine control with the shorter ones, and thus scales well to difficult planning problems. We show that AdaSubS significantly surpasses hierarchical planning algorithms on three complex reasoning tasks: Sokoban, the Rubik's Cube, and inequality proving benchmark INT.",
    "link": "http://arxiv.org/abs/2206.00702",
    "context": "Title: Fast and Precise: Adjusting Planning Horizon with Adaptive Subgoal Search. (arXiv:2206.00702v8 [cs.AI] UPDATED)\nAbstract: Complex reasoning problems contain states that vary in the computational cost required to determine a good action plan. Taking advantage of this property, we propose Adaptive Subgoal Search (AdaSubS), a search method that adaptively adjusts the planning horizon. To this end, AdaSubS generates diverse sets of subgoals at different distances. A verification mechanism is employed to filter out unreachable subgoals swiftly, allowing to focus on feasible further subgoals. In this way, AdaSubS benefits from the efficiency of planning with longer subgoals and the fine control with the shorter ones, and thus scales well to difficult planning problems. We show that AdaSubS significantly surpasses hierarchical planning algorithms on three complex reasoning tasks: Sokoban, the Rubik's Cube, and inequality proving benchmark INT.",
    "path": "papers/22/06/2206.00702.json",
    "total_tokens": 880,
    "translated_title": "快速而精确：自适应子目标搜索调整规划长度",
    "translated_abstract": "复杂的推理问题包含需要耗费不同计算成本来确定良好行动计划的状态。针对这一特性，我们提出了一种名为自适应子目标搜索 (AdaSubS) 的搜索方法，可以自适应性地调整规划长度。为此，AdaSubS 生成不同距离下的多样化子目标集。采用验证机制快速过滤出不可达子目标，以便专注于可以实现的后续子目标。通过这种方式，AdaSubS 在计划更长的子目标的效率和在计划更短的子目标方面具有精细控制，并因此在难解的规划问题上扩展得很好。我们展示了 AdaSubS 在三个复杂推理任务 Sokoban、魔方和不等式证明基准 INT 上显著超过分层规划算法。",
    "tldr": "AdaSubS 是一种自适应的子目标搜索方法，它采用验证机制快速过滤出不可达子目标，从而实现在计划更长的子目标的效率和在计划更短的子目标方面具有精细控制，在 Sokoban、魔方和不等式证明基准 INT 等复杂推理任务上表现优越。",
    "en_tdlr": "AdaSubS is an adaptive subgoal search method that benefits from planning with longer and shorter subgoals by using a verification mechanism to swiftly filter out unreachable subgoals. It significantly outperforms hierarchical planning algorithms on complex reasoning tasks such as Sokoban, Rubik's Cube, and the inequality proving benchmark INT."
}