{
    "title": "Transfer Learning with Deep Tabular Models. (arXiv:2206.15306v2 [cs.LG] UPDATED)",
    "abstract": "Recent work on deep learning for tabular data demonstrates the strong performance of deep tabular models, often bridging the gap between gradient boosted decision trees and neural networks. Accuracy aside, a major advantage of neural models is that they learn reusable features and are easily fine-tuned in new domains. This property is often exploited in computer vision and natural language applications, where transfer learning is indispensable when task-specific training data is scarce. In this work, we demonstrate that upstream data gives tabular neural networks a decisive advantage over widely used GBDT models. We propose a realistic medical diagnosis benchmark for tabular transfer learning, and we present a how-to guide for using upstream data to boost performance with a variety of tabular neural network architectures. Finally, we propose a pseudo-feature method for cases where the upstream and downstream feature sets differ, a tabular-specific problem widespread in real-world appli",
    "link": "http://arxiv.org/abs/2206.15306",
    "context": "Title: Transfer Learning with Deep Tabular Models. (arXiv:2206.15306v2 [cs.LG] UPDATED)\nAbstract: Recent work on deep learning for tabular data demonstrates the strong performance of deep tabular models, often bridging the gap between gradient boosted decision trees and neural networks. Accuracy aside, a major advantage of neural models is that they learn reusable features and are easily fine-tuned in new domains. This property is often exploited in computer vision and natural language applications, where transfer learning is indispensable when task-specific training data is scarce. In this work, we demonstrate that upstream data gives tabular neural networks a decisive advantage over widely used GBDT models. We propose a realistic medical diagnosis benchmark for tabular transfer learning, and we present a how-to guide for using upstream data to boost performance with a variety of tabular neural network architectures. Finally, we propose a pseudo-feature method for cases where the upstream and downstream feature sets differ, a tabular-specific problem widespread in real-world appli",
    "path": "papers/22/06/2206.15306.json",
    "total_tokens": 903,
    "translated_title": "深度表格模型的迁移学习",
    "translated_abstract": "最近的关于深度学习用于表格数据的研究表明，深度表格模型展现了强大的性能，通常填补了梯度提升决策树和神经网络之间的差距。除了准确性之外，神经模型的一个主要优势是它们学习了可重复使用的特征，并且在新领域中可以很容易地进行微调。这种特性在计算机视觉和自然语言应用中经常被利用，尤其是在任务特定的训练数据稀缺时，迁移学习变得不可或缺。在这项工作中，我们证明了上游数据为表格神经网络带来了比广泛使用的GBDT模型更具决定性的优势。我们提出了一个适用于表格迁移学习的现实医学诊断基准，并提供了一份使用上游数据提高各种表格神经网络架构性能的指南。最后，我们提出了一种伪特征方法，用于处理上游和下游特征集不同的情况，这是现实世界中广泛存在的表格特定问题。",
    "tldr": "深度表格模型的迁移学习在医学诊断等领域展现出了比传统方法更优异的性能，并且提出了应对上下游特征集不同情况的解决方法。",
    "en_tdlr": "Transfer learning with deep tabular models shows superior performance compared to traditional methods in areas such as medical diagnosis, and proposes a solution for handling different feature sets between upstream and downstream tasks."
}