{
    "title": "Extending regionalization algorithms to explore spatial process heterogeneity. (arXiv:2206.09429v3 [stat.ME] UPDATED)",
    "abstract": "In spatial regression models, spatial heterogeneity may be considered with either continuous or discrete specifications. The latter is related to delineation of spatially connected regions with homogeneous relationships between variables (spatial regimes). Although various regionalization algorithms have been proposed and studied in the field of spatial analytics, methods to optimize spatial regimes have been largely unexplored. In this paper, we propose two new algorithms for spatial regime delineation, two-stage K-Models and Regional-K-Models. We also extend the classic Automatic Zoning Procedure to spatial regression context. The proposed algorithms are applied to a series of synthetic datasets and two real-world datasets. Results indicate that all three algorithms achieve superior or comparable performance to existing approaches, while the two-stage K-Models algorithm largely outperforms existing approaches on model fitting, region reconstruction, and coefficient estimation. Our wo",
    "link": "http://arxiv.org/abs/2206.09429",
    "context": "Title: Extending regionalization algorithms to explore spatial process heterogeneity. (arXiv:2206.09429v3 [stat.ME] UPDATED)\nAbstract: In spatial regression models, spatial heterogeneity may be considered with either continuous or discrete specifications. The latter is related to delineation of spatially connected regions with homogeneous relationships between variables (spatial regimes). Although various regionalization algorithms have been proposed and studied in the field of spatial analytics, methods to optimize spatial regimes have been largely unexplored. In this paper, we propose two new algorithms for spatial regime delineation, two-stage K-Models and Regional-K-Models. We also extend the classic Automatic Zoning Procedure to spatial regression context. The proposed algorithms are applied to a series of synthetic datasets and two real-world datasets. Results indicate that all three algorithms achieve superior or comparable performance to existing approaches, while the two-stage K-Models algorithm largely outperforms existing approaches on model fitting, region reconstruction, and coefficient estimation. Our wo",
    "path": "papers/22/06/2206.09429.json",
    "total_tokens": 892,
    "translated_title": "将区域化算法扩展到探索空间进程异质性",
    "translated_abstract": "在空间回归模型中，空间异质性可以通过连续或离散规范进行考虑。后者涉及到确定具有同质变量之间的均质关系的连续空间区域（空间区域）。尽管在空间分析领域中提出并研究了各种区域化算法，但优化空间区域的方法基本未被探索。本文提出了两种新的空间区域划分算法，即两阶段K模型和区域K模型。我们还将经典的自动分区程序扩展到空间回归背景下。这些算法被应用于一系列合成数据集和两个真实数据集。结果表明，所有三种算法在模型拟合、区域重构和系数估计方面均达到了超越或可比较的性能，而两阶段K模型算法在模型拟合、区域重构和系数估计方面明显优于现有方法。",
    "tldr": "提出两种新的空间区域划分算法，应用于合成和真实数据集，并取得了较好的成果。其中，两阶段K模型算法表现最佳，具有较好的模型拟合、区域重构和系数估计能力。",
    "en_tdlr": "Two new algorithms for spatial regime delineation are proposed, which achieve superior performance in synthetic and real-world datasets. The two-stage K-Models algorithm outperforms existing approaches on model fitting, region reconstruction, and coefficient estimation. The classic Automatic Zoning Procedure is also extended to spatial regression context."
}