{
    "title": "The Symmetric Generalized Eigenvalue Problem as a Nash Equilibrium. (arXiv:2206.04993v2 [cs.LG] UPDATED)",
    "abstract": "The symmetric generalized eigenvalue problem (SGEP) is a fundamental concept in numerical linear algebra. It captures the solution of many classical machine learning problems such as canonical correlation analysis, independent components analysis, partial least squares, linear discriminant analysis, principal components and others. Despite this, most general solvers are prohibitively expensive when dealing with streaming data sets (i.e., minibatches) and research has instead concentrated on finding efficient solutions to specific problem instances. In this work, we develop a game-theoretic formulation of the top-$k$ SGEP whose Nash equilibrium is the set of generalized eigenvectors. We also present a parallelizable algorithm with guaranteed asymptotic convergence to the Nash. Current state-of-the-art methods require $O(d^2k)$ runtime complexity per iteration which is prohibitively expensive when the number of dimensions ($d$) is large. We show how to modify this parallel approach to ac",
    "link": "http://arxiv.org/abs/2206.04993",
    "context": "Title: The Symmetric Generalized Eigenvalue Problem as a Nash Equilibrium. (arXiv:2206.04993v2 [cs.LG] UPDATED)\nAbstract: The symmetric generalized eigenvalue problem (SGEP) is a fundamental concept in numerical linear algebra. It captures the solution of many classical machine learning problems such as canonical correlation analysis, independent components analysis, partial least squares, linear discriminant analysis, principal components and others. Despite this, most general solvers are prohibitively expensive when dealing with streaming data sets (i.e., minibatches) and research has instead concentrated on finding efficient solutions to specific problem instances. In this work, we develop a game-theoretic formulation of the top-$k$ SGEP whose Nash equilibrium is the set of generalized eigenvectors. We also present a parallelizable algorithm with guaranteed asymptotic convergence to the Nash. Current state-of-the-art methods require $O(d^2k)$ runtime complexity per iteration which is prohibitively expensive when the number of dimensions ($d$) is large. We show how to modify this parallel approach to ac",
    "path": "papers/22/06/2206.04993.json",
    "total_tokens": 902,
    "tldr": "该论文提出了一个博弈论公式，其中Nash均衡是广义特征向量集合，为解决对称广义特征值问题（SGEP）提供了一种可并行化的算法，解决了处理数据流块时成本过高的问题。",
    "en_tdlr": "The paper proposes a game-theoretic formulation, where the Nash equilibrium is the set of generalized eigenvectors, to solve the symmetric generalized eigenvalue problem (SGEP). It provides a parallelizable algorithm to solve large-scale SGEP and solves the issue of high cost when dealing with streaming data sets."
}