{
    "title": "E2PN: Efficient SE(3)-Equivariant Point Network. (arXiv:2206.05398v3 [cs.CV] UPDATED)",
    "abstract": "This paper proposes a convolution structure for learning SE(3)-equivariant features from 3D point clouds. It can be viewed as an equivariant version of kernel point convolutions (KPConv), a widely used convolution form to process point cloud data. Compared with existing equivariant networks, our design is simple, lightweight, fast, and easy to be integrated with existing task-specific point cloud learning pipelines. We achieve these desirable properties by combining group convolutions and quotient representations. Specifically, we discretize SO(3) to finite groups for their simplicity while using SO(2) as the stabilizer subgroup to form spherical quotient feature fields to save computations. We also propose a permutation layer to recover SO(3) features from spherical features to preserve the capacity to distinguish rotations. Experiments show that our method achieves comparable or superior performance in various tasks, including object classification, pose estimation, and keypoint-matc",
    "link": "http://arxiv.org/abs/2206.05398",
    "context": "Title: E2PN: Efficient SE(3)-Equivariant Point Network. (arXiv:2206.05398v3 [cs.CV] UPDATED)\nAbstract: This paper proposes a convolution structure for learning SE(3)-equivariant features from 3D point clouds. It can be viewed as an equivariant version of kernel point convolutions (KPConv), a widely used convolution form to process point cloud data. Compared with existing equivariant networks, our design is simple, lightweight, fast, and easy to be integrated with existing task-specific point cloud learning pipelines. We achieve these desirable properties by combining group convolutions and quotient representations. Specifically, we discretize SO(3) to finite groups for their simplicity while using SO(2) as the stabilizer subgroup to form spherical quotient feature fields to save computations. We also propose a permutation layer to recover SO(3) features from spherical features to preserve the capacity to distinguish rotations. Experiments show that our method achieves comparable or superior performance in various tasks, including object classification, pose estimation, and keypoint-matc",
    "path": "papers/22/06/2206.05398.json",
    "total_tokens": 903,
    "translated_title": "E2PN：高效的SE(3)-等变点云网络",
    "translated_abstract": "本文提出了一种卷积结构，用于从3D点云学习SE(3)等变特征。它可以被视为核点卷积(KPConv)的等变版本，KPConv是一种广泛用于处理点云数据的卷积形式。与现有的等变网络相比，我们的设计简单、轻量、快速，易于与现有的特定任务的点云学习流程集成。我们通过组卷积和商表示相结合，实现了这些理想特性。具体而言，我们将SO(3)离散为有限群、使用SO(2)作为稳定子群，形成球形商特征场以节省计算量。我们还提出了一个置换层，从球形特征中恢复SO(3)特征，以保留区分旋转的能力。实验表明，我们的方法在各种任务中实现了可比或优越的性能，包括对象分类、姿态估计和关键点匹配。",
    "tldr": "本文提出了一种简单、轻量、快速的SE(3)-等变点云网络，通过组卷积和商表示相结合实现，用于处理点云数据，同时在对象分类、姿态估计和关键点匹配等任务上实现了可比或优越的性能。",
    "en_tdlr": "This paper proposes a simple, lightweight, and fast SE(3)-equivariant point cloud network for processing point cloud data, which combines group convolutions and quotient representations. It achieves comparable or superior performance in various tasks, including object classification, pose estimation, and keypoint matching."
}