{
    "title": "An Empirical Study of Retrieval-enhanced Graph Neural Networks. (arXiv:2206.00362v4 [cs.LG] UPDATED)",
    "abstract": "Graph Neural Networks (GNNs) are effective tools for graph representation learning. Most GNNs rely on a recursive neighborhood aggregation scheme, named message passing, thereby their theoretical expressive power is limited to the first-order Weisfeiler-Lehman test (1-WL). An effective approach to this challenge is to explicitly retrieve some annotated examples used to enhance GNN models. While retrieval-enhanced models have been proved to be effective in many language and vision domains, it remains an open question how effective retrieval-enhanced GNNs are when applied to graph datasets. Motivated by this, we want to explore how the retrieval idea can help augment the useful information learned in the graph neural networks, and we design a retrieval-enhanced scheme called GRAPHRETRIEVAL, which is agnostic to the choice of graph neural network models. In GRAPHRETRIEVAL, for each input graph, similar graphs together with their ground-true labels are retrieved from an existing database. ",
    "link": "http://arxiv.org/abs/2206.00362",
    "context": "Title: An Empirical Study of Retrieval-enhanced Graph Neural Networks. (arXiv:2206.00362v4 [cs.LG] UPDATED)\nAbstract: Graph Neural Networks (GNNs) are effective tools for graph representation learning. Most GNNs rely on a recursive neighborhood aggregation scheme, named message passing, thereby their theoretical expressive power is limited to the first-order Weisfeiler-Lehman test (1-WL). An effective approach to this challenge is to explicitly retrieve some annotated examples used to enhance GNN models. While retrieval-enhanced models have been proved to be effective in many language and vision domains, it remains an open question how effective retrieval-enhanced GNNs are when applied to graph datasets. Motivated by this, we want to explore how the retrieval idea can help augment the useful information learned in the graph neural networks, and we design a retrieval-enhanced scheme called GRAPHRETRIEVAL, which is agnostic to the choice of graph neural network models. In GRAPHRETRIEVAL, for each input graph, similar graphs together with their ground-true labels are retrieved from an existing database. ",
    "path": "papers/22/06/2206.00362.json",
    "total_tokens": 906,
    "translated_title": "检索增强的图神经网络的实证研究",
    "translated_abstract": "图神经网络（GNNs）是图表示学习的有效工具。大多数GNNs依赖于递归的邻居聚合方案，称为消息传递，因此它们的理论表达能力限于一阶Weisfeiler-Lehman测试（1-WL）。解决这个挑战的一种有效方法是明确地检索用于增强GNN模型的一些已注释的示例。虽然在语言和视觉领域中已经证明了检索增强模型的有效性，但是当应用于图数据集时，检索增强的GNNs的有效性问题仍然是一个悬而未决的问题。出于这个目的，我们想探索检索思想如何帮助增强图神经网络中学习的有用信息，并设计了一个称为GRAPHRETRIEVAL的检索增强方案，该方案对于图神经网络模型的选择是不可知的。在GRAPHRETRIEVAL中，对于每个输入图，从现有数据库中检索出相似的图以及它们的真实标签。",
    "tldr": "这项研究考察了检索增强的图神经网络在图数据集中的有效性，设计了一种称为GRAPHRETRIEVAL的检索增强方案，为图神经网络中学习的有用信息提供了增强。",
    "en_tdlr": "This study investigates the effectiveness of retrieval-enhanced graph neural networks on graph datasets and proposes a retrieval-enhanced scheme called GRAPHRETRIEVAL, which enhances the useful information learned in graph neural networks."
}