{
    "title": "Mining Multi-Label Samples from Single Positive Labels. (arXiv:2206.05764v4 [cs.LG] UPDATED)",
    "abstract": "Conditional generative adversarial networks (cGANs) have shown superior results in class-conditional generation tasks. To simultaneously control multiple conditions, cGANs require multi-label training datasets, where multiple labels can be assigned to each data instance. Nevertheless, the tremendous annotation cost limits the accessibility of multi-label datasets in real-world scenarios. Therefore, in this study we explore the practical setting called the single positive setting, where each data instance is annotated by only one positive label with no explicit negative labels. To generate multi-label data in the single positive setting, we propose a novel sampling approach called single-to-multi-label (S2M) sampling, based on the Markov chain Monte Carlo method. As a widely applicable \"add-on\" method, our proposed S2M sampling method enables existing unconditional and conditional GANs to draw high-quality multi-label data with a minimal annotation cost. Extensive experiments on real im",
    "link": "http://arxiv.org/abs/2206.05764",
    "context": "Title: Mining Multi-Label Samples from Single Positive Labels. (arXiv:2206.05764v4 [cs.LG] UPDATED)\nAbstract: Conditional generative adversarial networks (cGANs) have shown superior results in class-conditional generation tasks. To simultaneously control multiple conditions, cGANs require multi-label training datasets, where multiple labels can be assigned to each data instance. Nevertheless, the tremendous annotation cost limits the accessibility of multi-label datasets in real-world scenarios. Therefore, in this study we explore the practical setting called the single positive setting, where each data instance is annotated by only one positive label with no explicit negative labels. To generate multi-label data in the single positive setting, we propose a novel sampling approach called single-to-multi-label (S2M) sampling, based on the Markov chain Monte Carlo method. As a widely applicable \"add-on\" method, our proposed S2M sampling method enables existing unconditional and conditional GANs to draw high-quality multi-label data with a minimal annotation cost. Extensive experiments on real im",
    "path": "papers/22/06/2206.05764.json",
    "total_tokens": 905,
    "translated_title": "从单一正标签中挖掘多标签样本",
    "translated_abstract": "条件生成对抗网络（cGAN）在类别有条件的生成任务中已经证明具有出色的结果。为了同时控制多个条件，cGAN需要多标签训练数据集，其中可以为每个数据实例分配多个标签。然而，巨大的注释成本限制了多标签数据集在现实场景中的可访问性。因此，在本研究中，我们探索了实际设置的称为单正标签设置，其中每个数据实例仅由一个正标签注释，没有明确的负标签。为了在单正标签设置中生成多标签数据，我们提出了一种基于马尔可夫链蒙特卡罗方法的新型采样方法，称为单到多标签（S2M）采样。作为广泛适用的“附加”方法，我们提出的S2M采样方法使现有的无条件和条件GAN能够以最小的注释成本绘制高质量的多标签数据。在实际图像和文本数据集上进行的大量实验证明了我们提出的方法在各种情况下的有效性。",
    "tldr": "本文提出了一种基于单一正标签的采样方法S2M，以实现对多标签样本的生成，从而避免了多标签数据集制作时高昂的注释成本。",
    "en_tdlr": "The authors propose a novel approach called Single-to-Multi-Label (S2M) sampling, which generates multi-label data from single positive label annotations, enabling existing unconditional and conditional GANs to use high-quality multi-label datasets with minimal annotation costs."
}