{
    "title": "Utilitarian Welfare Optimization in the Generalized Vertex Coloring Games: An Implication to Venue Selection in Events Planning. (arXiv:2206.09153v4 [cs.DM] UPDATED)",
    "abstract": "We consider a general class of multi-agent games in networks, namely the generalized vertex coloring games (G-VCGs), inspired by real-life applications of the venue selection problem in events planning. Certain utility responding to the contemporary coloring assignment will be received by each agent under some particular mechanism, who, striving to maximize his own utility, is restricted to local information thus self-organizing when choosing another color. Our focus is on maximizing some utilitarian-looking welfare objective function concerning the cumulative utilities across the network in a decentralized fashion. Firstly, we investigate on a special class of the G-VCGs, namely Identical Preference VCGs (IP-VCGs) which recovers the rudimentary work by \\cite{chaudhuri2008network}. We reveal its convergence even under a completely greedy policy and completely synchronous settings, with a stochastic bound on the converging rate provided. Secondly, regarding the general G-VCGs, a greedin",
    "link": "http://arxiv.org/abs/2206.09153",
    "context": "Title: Utilitarian Welfare Optimization in the Generalized Vertex Coloring Games: An Implication to Venue Selection in Events Planning. (arXiv:2206.09153v4 [cs.DM] UPDATED)\nAbstract: We consider a general class of multi-agent games in networks, namely the generalized vertex coloring games (G-VCGs), inspired by real-life applications of the venue selection problem in events planning. Certain utility responding to the contemporary coloring assignment will be received by each agent under some particular mechanism, who, striving to maximize his own utility, is restricted to local information thus self-organizing when choosing another color. Our focus is on maximizing some utilitarian-looking welfare objective function concerning the cumulative utilities across the network in a decentralized fashion. Firstly, we investigate on a special class of the G-VCGs, namely Identical Preference VCGs (IP-VCGs) which recovers the rudimentary work by \\cite{chaudhuri2008network}. We reveal its convergence even under a completely greedy policy and completely synchronous settings, with a stochastic bound on the converging rate provided. Secondly, regarding the general G-VCGs, a greedin",
    "path": "papers/22/06/2206.09153.json",
    "total_tokens": 996,
    "translated_title": "广义顶点着色游戏中的效用最大化福利优化：对活动规划中场地选择的意义",
    "translated_abstract": "我们考虑网络中一类多智能体游戏，即广义顶点着色游戏（G-VCGs），受到活动规划中场地选择问题的实际应用的启发。每个智能体在某种特定机制下对当前的着色分配会收到一定效用，他们在选择另一种颜色时受限于局部信息，因此在追求自身效用最大化的同时进行自组织。我们的重点是以分散的方式最大化网络中累积效用的某种效用最优化目标函数。首先，我们研究了G-VCGs的一类特殊情况，即相同偏好的VCGs（IP-VCGs），该情况下恢复了\\cite{chaudhuri2008network}的基础工作。我们揭示了其在完全贪婪策略和完全同步设置下的收敛性，并提供了一个收敛速率的随机界限。其次，对于一般的G-VCGs，采用贪婪式的扩展协议，我们探讨了相应的效用优化模型框架的收敛性和效率。",
    "tldr": "本论文研究了广义顶点着色游戏（G-VCGs）中的效用最大化福利优化问题，探讨了相同偏好的VCGs情况下的收敛性和效率，以及采用贪婪式的扩展协议优化模型的收敛性和效率。",
    "en_tdlr": "This paper explores the utilitarian welfare optimization problem in generalized vertex coloring games (G-VCGs) and investigates the convergence and efficiency of Identical Preference VCGs (IP-VCGs) as well as a greedy-based protocol for optimizing the model in a decentralized manner."
}