{
    "title": "Integrating Symmetry into Differentiable Planning with Steerable Convolutions. (arXiv:2206.03674v3 [cs.LG] UPDATED)",
    "abstract": "We study how group symmetry helps improve data efficiency and generalization for end-to-end differentiable planning algorithms when symmetry appears in decision-making tasks. Motivated by equivariant convolution networks, we treat the path planning problem as \\textit{signals} over grids. We show that value iteration in this case is a linear equivariant operator, which is a (steerable) convolution. This extends Value Iteration Networks (VINs) on using convolutional networks for path planning with additional rotation and reflection symmetry. Our implementation is based on VINs and uses steerable convolution networks to incorporate symmetry. The experiments are performed on four tasks: 2D navigation, visual navigation, and 2 degrees of freedom (2DOFs) configuration space and workspace manipulation. Our symmetric planning algorithms improve training efficiency and generalization by large margins compared to non-equivariant counterparts, VIN and GPPN.",
    "link": "http://arxiv.org/abs/2206.03674",
    "context": "Title: Integrating Symmetry into Differentiable Planning with Steerable Convolutions. (arXiv:2206.03674v3 [cs.LG] UPDATED)\nAbstract: We study how group symmetry helps improve data efficiency and generalization for end-to-end differentiable planning algorithms when symmetry appears in decision-making tasks. Motivated by equivariant convolution networks, we treat the path planning problem as \\textit{signals} over grids. We show that value iteration in this case is a linear equivariant operator, which is a (steerable) convolution. This extends Value Iteration Networks (VINs) on using convolutional networks for path planning with additional rotation and reflection symmetry. Our implementation is based on VINs and uses steerable convolution networks to incorporate symmetry. The experiments are performed on four tasks: 2D navigation, visual navigation, and 2 degrees of freedom (2DOFs) configuration space and workspace manipulation. Our symmetric planning algorithms improve training efficiency and generalization by large margins compared to non-equivariant counterparts, VIN and GPPN.",
    "path": "papers/22/06/2206.03674.json",
    "total_tokens": 913,
    "translated_title": "将对称性融入可微规划中的可控卷积",
    "translated_abstract": "本文研究了在决策任务中出现对称性时，如何利用群对称性改善端到端可微规划算法的数据效率和泛化能力。受等变卷积网络的启发，我们将路径规划问题视为网格上的信号。我们展示了在这种情况下值迭代是一个线性等变算子，即可被（定向）卷积表示。这扩展了值迭代网络（VIN）在使用卷积网络进行路径规划时使用额外的旋转和反射对称性的方法。我们的实现基于VIN，并使用可控卷积网络来融合对称性。我们进行了四个任务的实验：2D导航，视觉导航，自由度（2DOFs）配置空间和工作空间操纵。与非等变对应物VIN和GPPN相比，我们的对称规划算法在训练效率和泛化方面有很大的提升。",
    "tldr": "本文研究了如何在路径规划任务中使用对称性改善数据效率和泛化能力。将值迭代视为网格信号，并使用可控卷积来融合对称性。实验表明，我们的对称规划算法比非等变对应物在训练效率和泛化方面有很大提升。",
    "en_tdlr": "This paper studies how to improve data efficiency and generalization in path planning tasks by incorporating symmetry. By treating value iteration as grid signals and using steerable convolutions to integrate symmetric properties, our symmetric planning algorithms achieve significant improvements in training efficiency and generalization compared to non-equivariant counterparts."
}