{
    "title": "CC-Riddle: A Question Answering Dataset of Chinese Character Riddles. (arXiv:2206.13778v2 [cs.CL] UPDATED)",
    "abstract": "The Chinese character riddle is a unique form of cultural entertainment specific to the Chinese language. It typically comprises two parts: the riddle description and the solution. The solution to the riddle is a single character, while the riddle description primarily describes the glyph of the solution, occasionally supplemented with its explanation and pronunciation. Solving Chinese character riddles is a challenging task that demands understanding of character glyph, general knowledge, and a grasp of figurative language. In this paper, we construct a \\textbf{C}hinese \\textbf{C}haracter riddle dataset named CC-Riddle, which covers the majority of common simplified Chinese characters. The construction process is a combination of web crawling, language model generation and manual filtering. In generation stage, we input the Chinese phonetic alphabet, glyph and meaning of the solution character into the generation model, which then produces multiple riddle descriptions. The generated r",
    "link": "http://arxiv.org/abs/2206.13778",
    "context": "Title: CC-Riddle: A Question Answering Dataset of Chinese Character Riddles. (arXiv:2206.13778v2 [cs.CL] UPDATED)\nAbstract: The Chinese character riddle is a unique form of cultural entertainment specific to the Chinese language. It typically comprises two parts: the riddle description and the solution. The solution to the riddle is a single character, while the riddle description primarily describes the glyph of the solution, occasionally supplemented with its explanation and pronunciation. Solving Chinese character riddles is a challenging task that demands understanding of character glyph, general knowledge, and a grasp of figurative language. In this paper, we construct a \\textbf{C}hinese \\textbf{C}haracter riddle dataset named CC-Riddle, which covers the majority of common simplified Chinese characters. The construction process is a combination of web crawling, language model generation and manual filtering. In generation stage, we input the Chinese phonetic alphabet, glyph and meaning of the solution character into the generation model, which then produces multiple riddle descriptions. The generated r",
    "path": "papers/22/06/2206.13778.json",
    "total_tokens": 849,
    "translated_title": "CC-Riddle：一个中文字谜问答数据集",
    "translated_abstract": "中文字谜是中文特有的一种文化娱乐形式，通常包括谜语描述和谜底两个部分。谜底是一个单字，而谜语描述主要描述了谜底的字形，有时还会附带解释和发音。解决中文字谜是一项具有挑战性的任务，要求理解字形、普通知识和掌握比喻语言。在本论文中，我们构建了一个名为CC-Riddle的中文字谜数据集，该数据集涵盖了大多数常见的简体中文字符。构建过程结合了网络爬虫、语言模型生成和手动过滤。在生成阶段，我们将谜底字的汉语拼音、字形和含义输入到生成模型中，模型会生成多个谜语描述。",
    "tldr": "本论文构建了一个名为CC-Riddle的中文字谜问答数据集，覆盖了大多数常见的简体中文字符。该数据集的构建过程结合了网络爬虫、语言模型生成和手动过滤，为解决中文字谜问题提供了重要资源。",
    "en_tdlr": "This paper presents CC-Riddle, a Chinese character riddle question answering dataset that covers the majority of common simplified Chinese characters. The dataset is constructed using a combination of web crawling, language model generation, and manual filtering, providing a valuable resource for solving Chinese character riddles."
}