{
    "title": "SoccerCPD: Formation and Role Change-Point Detection in Soccer Matches Using Spatiotemporal Tracking Data. (arXiv:2206.10926v2 [stat.AP] UPDATED)",
    "abstract": "In fluid team sports such as soccer and basketball, analyzing team formation is one of the most intuitive ways to understand tactics from domain participants' point of view. However, existing approaches either assume that team formation is consistent throughout a match or assign formations frame-by-frame, which disagree with real situations. To tackle this issue, we propose a change-point detection framework named SoccerCPD that distinguishes tactically intended formation and role changes from temporary changes in soccer matches. We first assign roles to players frame-by-frame and perform two-step change-point detections: (1) formation change-point detection based on the sequence of role-adjacency matrices and (2) role change-point detection based on the sequence of role permutations. The evaluation of SoccerCPD using the ground truth annotated by domain experts shows that our method accurately detects the points of tactical changes and estimates the formation and role assignment per s",
    "link": "http://arxiv.org/abs/2206.10926",
    "context": "Title: SoccerCPD: Formation and Role Change-Point Detection in Soccer Matches Using Spatiotemporal Tracking Data. (arXiv:2206.10926v2 [stat.AP] UPDATED)\nAbstract: In fluid team sports such as soccer and basketball, analyzing team formation is one of the most intuitive ways to understand tactics from domain participants' point of view. However, existing approaches either assume that team formation is consistent throughout a match or assign formations frame-by-frame, which disagree with real situations. To tackle this issue, we propose a change-point detection framework named SoccerCPD that distinguishes tactically intended formation and role changes from temporary changes in soccer matches. We first assign roles to players frame-by-frame and perform two-step change-point detections: (1) formation change-point detection based on the sequence of role-adjacency matrices and (2) role change-point detection based on the sequence of role permutations. The evaluation of SoccerCPD using the ground truth annotated by domain experts shows that our method accurately detects the points of tactical changes and estimates the formation and role assignment per s",
    "path": "papers/22/06/2206.10926.json",
    "total_tokens": 974,
    "translated_title": "基于时空跟踪数据的足球比赛中阵型和角色变化点检测",
    "translated_abstract": "在诸如足球和篮球等流体团队运动中，分析团队阵容是从领域参与者的角度理解战术最直观的方式之一。然而，现有方法要么假定团队阵型在比赛中始终保持一致，要么按帧分配阵型，这与实际情况不符。为解决这个问题，我们提出了一个名为SoccerCPD的变点检测框架，可将足球比赛中的策略意图阵型和角色变化与临时变化区分开来。我们首先按帧分配球员角色，然后执行两步变点检测：（1）基于角色邻接矩阵序列的阵型变点检测，（2）基于角色排列序列的角色变点检测。使用领域专家注释的基本实况评估SoccerCPD，结果显示我们的方法能够准确检测到战术变化点并估计每秒的阵型和角色分配。",
    "tldr": "SoccerCPD是一个新的足球比赛变点检测框架，旨在将足球比赛中的策略意图阵型和角色变化与临时变化区分开来。该框架的两步变点检测在领域专家注释基础上进行验证，结果显示它可以准确检测战术变化并估计每秒的阵型和角色分配。",
    "en_tdlr": "SoccerCPD is a novel change-point detection framework for soccer matches, aimed at distinguishing tactically intended formation and role changes from temporary ones. The two-step change-point detection method of SoccerCPD is evaluated using annotated data from domain experts, indicating high accuracy in detecting tactical changes and estimating formation and role assignments per second."
}