{
    "title": "AVIDA: Alternating method for Visualizing and Integrating Data. (arXiv:2206.00135v2 [q-bio.QM] UPDATED)",
    "abstract": "High-dimensional multimodal data arises in many scientific fields. The integration of multimodal data becomes challenging when there is no known correspondence between the samples and the features of different datasets. To tackle this challenge, we introduce AVIDA, a framework for simultaneously performing data alignment and dimension reduction. In the numerical experiments, Gromov-Wasserstein optimal transport and t-distributed stochastic neighbor embedding are used as the alignment and dimension reduction modules respectively. We show that AVIDA correctly aligns high-dimensional datasets without common features with four synthesized datasets and two real multimodal single-cell datasets. Compared to several existing methods, we demonstrate that AVIDA better preserves structures of individual datasets, especially distinct local structures in the joint low-dimensional visualization, while achieving comparable alignment performance. Such a property is important in multimodal single-cell ",
    "link": "http://arxiv.org/abs/2206.00135",
    "context": "Title: AVIDA: Alternating method for Visualizing and Integrating Data. (arXiv:2206.00135v2 [q-bio.QM] UPDATED)\nAbstract: High-dimensional multimodal data arises in many scientific fields. The integration of multimodal data becomes challenging when there is no known correspondence between the samples and the features of different datasets. To tackle this challenge, we introduce AVIDA, a framework for simultaneously performing data alignment and dimension reduction. In the numerical experiments, Gromov-Wasserstein optimal transport and t-distributed stochastic neighbor embedding are used as the alignment and dimension reduction modules respectively. We show that AVIDA correctly aligns high-dimensional datasets without common features with four synthesized datasets and two real multimodal single-cell datasets. Compared to several existing methods, we demonstrate that AVIDA better preserves structures of individual datasets, especially distinct local structures in the joint low-dimensional visualization, while achieving comparable alignment performance. Such a property is important in multimodal single-cell ",
    "path": "papers/22/06/2206.00135.json",
    "total_tokens": 875,
    "translated_title": "AVIDA: 可视化和整合数据的交替方法",
    "translated_abstract": "高维多模态数据在许多科学领域中出现。当不同数据集之间的样本和特征之间没有已知的对应关系时，多模态数据的整合变得具有挑战性。为了解决这个问题，我们介绍了AVIDA，这是一个同时执行数据对齐和降维的框架。在数值实验中，我们使用Gromov-Wasserstein最优运输和t分布随机邻居嵌入作为对齐和降维模块。我们展示了AVIDA正确地对齐了具有四个合成数据集和两个真实多模态单细胞数据集的高维数据集。与几种现有方法相比，我们证明了AVIDA更好地保留了每个数据集的结构，特别是联合低维可视化中的不同局部结构，同时实现了相当的对齐性能。这种特性在多模态单细胞研究中非常重要。",
    "tldr": "AVIDA是一个可视化和整合数据的框架，它可以同时执行数据对齐和降维，并成功地对齐了高维多模态数据集，保留了每个数据集的结构，特别是联合低维可视化中的不同局部结构。",
    "en_tdlr": "AVIDA is a framework for visualizing and integrating data, which can simultaneously perform data alignment and dimension reduction. It successfully aligns high-dimensional multimodal datasets without common features and preserves the structures of individual datasets, especially distinct local structures in the joint low-dimensional visualization."
}