{
    "title": "Adaptive Local Neighborhood-based Neural Networks for MR Image Reconstruction from Undersampled Data. (arXiv:2206.00775v2 [eess.IV] UPDATED)",
    "abstract": "Recent medical image reconstruction techniques focus on generating high-quality medical images suitable for clinical use at the lowest possible cost and with the fewest possible adverse effects on patients. Recent works have shown significant promise for reconstructing MR images from sparsely sampled k-space data using deep learning. In this work, we propose a technique that rapidly estimates deep neural networks directly at reconstruction time by fitting them on small adaptively estimated neighborhoods of a training set. In brief, our algorithm alternates between searching for neighbors in a data set that are similar to the test reconstruction, and training a local network on these neighbors followed by updating the test reconstruction. Because our reconstruction model is learned on a dataset that is in some sense similar to the image being reconstructed rather than being fit on a large, diverse training set, it is more adaptive to new scans. It can also handle changes in training set",
    "link": "http://arxiv.org/abs/2206.00775",
    "context": "Title: Adaptive Local Neighborhood-based Neural Networks for MR Image Reconstruction from Undersampled Data. (arXiv:2206.00775v2 [eess.IV] UPDATED)\nAbstract: Recent medical image reconstruction techniques focus on generating high-quality medical images suitable for clinical use at the lowest possible cost and with the fewest possible adverse effects on patients. Recent works have shown significant promise for reconstructing MR images from sparsely sampled k-space data using deep learning. In this work, we propose a technique that rapidly estimates deep neural networks directly at reconstruction time by fitting them on small adaptively estimated neighborhoods of a training set. In brief, our algorithm alternates between searching for neighbors in a data set that are similar to the test reconstruction, and training a local network on these neighbors followed by updating the test reconstruction. Because our reconstruction model is learned on a dataset that is in some sense similar to the image being reconstructed rather than being fit on a large, diverse training set, it is more adaptive to new scans. It can also handle changes in training set",
    "path": "papers/22/06/2206.00775.json",
    "total_tokens": 895,
    "translated_title": "基于自适应本地邻域的神经网络用于从稀疏采样数据中重建MR图像",
    "translated_abstract": "最近的医学图像重建技术致力于以尽可能低的成本和对患者产生最小不良影响的方式生成适用于临床使用的高质量医学图像。最近的研究表明，使用深度学习可以从稀疏采样的k空间数据中重建MR图像具有显著的潜力。在本文中，我们提出了一种在重建时通过对训练集的小区域进行适应性估计来快速估计深度神经网络的技术。简而言之，我们的算法在搜索与测试重建相似的数据集邻居和训练这些邻居上的局部网络，然后更新测试重建之间进行交替。由于我们的重建模型是在某种程度上与正在重建的图像相似的数据集上学习而不是在大规模多样的训练集上拟合的，因此它对新的扫描更具适应性。它还可以处理训练集中的变化。",
    "tldr": "本文提出了一种基于自适应本地邻域的神经网络技术，用于从稀疏采样数据中高效重建MR图像，该技术具有较强的适应性和鲁棒性。",
    "en_tdlr": "This paper proposes an adaptive local neighborhood-based neural network technique for efficiently reconstructing MR images from undersampled data, which exhibits strong adaptability and robustness."
}