{
    "title": "Language with Vision: a Study on Grounded Word and Sentence Embeddings. (arXiv:2206.08823v3 [cs.CL] UPDATED)",
    "abstract": "Grounding language in vision is an active field of research seeking to construct cognitively plausible word and sentence representations by incorporating perceptual knowledge from vision into text-based representations. Despite many attempts at language grounding, achieving an optimal equilibrium between textual representations of the language and our embodied experiences remains an open field. Some common concerns are the following. Is visual grounding advantageous for abstract words, or is its effectiveness restricted to concrete words? What is the optimal way of bridging the gap between text and vision? To what extent is perceptual knowledge from images advantageous for acquiring high-quality embeddings? Leveraging the current advances in machine learning and natural language processing, the present study addresses these questions by proposing a simple yet very effective computational grounding model for pre-trained word embeddings. Our model effectively balances the interplay betwe",
    "link": "http://arxiv.org/abs/2206.08823",
    "context": "Title: Language with Vision: a Study on Grounded Word and Sentence Embeddings. (arXiv:2206.08823v3 [cs.CL] UPDATED)\nAbstract: Grounding language in vision is an active field of research seeking to construct cognitively plausible word and sentence representations by incorporating perceptual knowledge from vision into text-based representations. Despite many attempts at language grounding, achieving an optimal equilibrium between textual representations of the language and our embodied experiences remains an open field. Some common concerns are the following. Is visual grounding advantageous for abstract words, or is its effectiveness restricted to concrete words? What is the optimal way of bridging the gap between text and vision? To what extent is perceptual knowledge from images advantageous for acquiring high-quality embeddings? Leveraging the current advances in machine learning and natural language processing, the present study addresses these questions by proposing a simple yet very effective computational grounding model for pre-trained word embeddings. Our model effectively balances the interplay betwe",
    "path": "papers/22/06/2206.08823.json",
    "total_tokens": 825,
    "translated_title": "带有视觉的语言: 对基于感知的词语和句子嵌入的研究",
    "translated_abstract": "将语言与视觉联系起来是一个积极研究的领域，旨在通过将来自视觉的感知知识融入到基于文本的表示中，构建符合认知的词语和句子表示。尽管在语言感知方面已经尝试了许多方法，但在文本表示和人类经验之间实现最优平衡仍然是一个开放的领域。一些常见问题是：视觉感知是否对抽象词语有优势，还是仅限于具体词语？在文本和视觉之间建立联系的最佳方法是什么？图像的感知知识对于获取高质量的嵌入是否有优势？借助当前机器学习和自然语言处理的进展，本研究提出了一个简单且非常有效的计算基于预训练词嵌入的模型，有效平衡了相互作用。",
    "tldr": "本研究通过提出一个简单但非常有效的计算基于预训练词嵌入的模型，有效平衡了文本表示和视觉感知之间的相互作用。"
}