{
    "title": "The Maximum Linear Arrangement Problem for trees under projectivity and planarity. (arXiv:2206.06924v3 [cs.DS] UPDATED)",
    "abstract": "The Maximum Linear Arrangement problem (MaxLA) consists of finding a mapping $\\pi$ from the $n$ vertices of a graph $G$ to distinct consecutive integers that maximizes $D(G)=\\sum_{uv\\in E(G)}|\\pi(u) - \\pi(v)|$. In this setting, vertices are considered to lie on a horizontal line and edges are drawn as semicircles above the line. There exist variants of MaxLA in which the arrangements are constrained. In the planar variant, edge crossings are forbidden. In the projective variant for rooted trees, arrangements are planar and the root cannot be covered by any edge. Here we present $O(n)$-time and $O(n)$-space algorithms that solve planar and projective MaxLA for trees. We also prove several properties of maximum projective and planar arrangements, and show that caterpillar trees maximize planar MaxLA over all trees of a fixed size thereby generalizing a previous extremal result on trees.",
    "link": "http://arxiv.org/abs/2206.06924",
    "context": "Title: The Maximum Linear Arrangement Problem for trees under projectivity and planarity. (arXiv:2206.06924v3 [cs.DS] UPDATED)\nAbstract: The Maximum Linear Arrangement problem (MaxLA) consists of finding a mapping $\\pi$ from the $n$ vertices of a graph $G$ to distinct consecutive integers that maximizes $D(G)=\\sum_{uv\\in E(G)}|\\pi(u) - \\pi(v)|$. In this setting, vertices are considered to lie on a horizontal line and edges are drawn as semicircles above the line. There exist variants of MaxLA in which the arrangements are constrained. In the planar variant, edge crossings are forbidden. In the projective variant for rooted trees, arrangements are planar and the root cannot be covered by any edge. Here we present $O(n)$-time and $O(n)$-space algorithms that solve planar and projective MaxLA for trees. We also prove several properties of maximum projective and planar arrangements, and show that caterpillar trees maximize planar MaxLA over all trees of a fixed size thereby generalizing a previous extremal result on trees.",
    "path": "papers/22/06/2206.06924.json",
    "total_tokens": 945,
    "translated_title": "基于平面性与投影性定义下树的最大线性排列问题（arXiv:2206.06924v3[cs.DS] 更新版）",
    "translated_abstract": "最大线性排列问题(MaxLA)是指找到从图G的n个顶点到不同连续整数的映射$ \\pi $，使得$ D(G)=\\sum_{uv\\in E(G)}|\\pi(u)-\\pi(v)| $最大化。在这种情况下，顶点被认为在一条水平线上，并且边是作为半圆弧画在线上方的。存在一些限制排列的MaxLA变体。在平面变体中，禁止边交叉。在针对根树的投影变体中，排列是平面的，而根不能被任何边覆盖。在这里，我们提出了用于解决树的平面和投影MaxLA的O(n)-时间和O(n）-空间算法。我们还证明了最大投影和平面排列的多个性质，并且表明毛毛虫树在固定大小的所有树中最大化平面MaxLA，因此推广了先前关于树的极值结果。",
    "tldr": "该论文提出了一种解决在平面性和投影性定义下树的最大线性排列问题的算法，证明了最大投影和平面排列的多个性质，发现毛毛虫树最优，推广了之前的极值结果。",
    "en_tdlr": "This paper proposes algorithms for solving the Maximum Linear Arrangement problem (MaxLA) for trees under projectivity and planarity constraints, proves several properties of maximum projective and planar arrangements, shows that caterpillar trees maximize planar MaxLA over all trees of a fixed size, and generalizes a previous extremal result on trees."
}