{
    "title": "MetaGL: Evaluation-Free Selection of Graph Learning Models via Meta-Learning. (arXiv:2206.09280v3 [cs.LG] UPDATED)",
    "abstract": "Given a graph learning task, such as link prediction, on a new graph, how can we select the best method as well as its hyperparameters (collectively called a model) without having to train or evaluate any model on the new graph? Model selection for graph learning has been largely ad hoc. A typical approach has been to apply popular methods to new datasets, but this is often suboptimal. On the other hand, systematically comparing models on the new graph quickly becomes too costly, or even impractical. In this work, we develop the first meta-learning approach for evaluation-free graph learning model selection, called MetaGL, which utilizes the prior performances of existing methods on various benchmark graph datasets to automatically select an effective model for the new graph, without any model training or evaluations. To quantify similarities across a wide variety of graphs, we introduce specialized meta-graph features that capture the structural characteristics of a graph. Then we des",
    "link": "http://arxiv.org/abs/2206.09280",
    "context": "Title: MetaGL: Evaluation-Free Selection of Graph Learning Models via Meta-Learning. (arXiv:2206.09280v3 [cs.LG] UPDATED)\nAbstract: Given a graph learning task, such as link prediction, on a new graph, how can we select the best method as well as its hyperparameters (collectively called a model) without having to train or evaluate any model on the new graph? Model selection for graph learning has been largely ad hoc. A typical approach has been to apply popular methods to new datasets, but this is often suboptimal. On the other hand, systematically comparing models on the new graph quickly becomes too costly, or even impractical. In this work, we develop the first meta-learning approach for evaluation-free graph learning model selection, called MetaGL, which utilizes the prior performances of existing methods on various benchmark graph datasets to automatically select an effective model for the new graph, without any model training or evaluations. To quantify similarities across a wide variety of graphs, we introduce specialized meta-graph features that capture the structural characteristics of a graph. Then we des",
    "path": "papers/22/06/2206.09280.json",
    "total_tokens": 1114,
    "translated_title": "MetaGL: 利用元学习对图学习模型进行免评估选择。",
    "translated_abstract": "给定一个图学习任务，例如在新图中的链接预测，如何在不训练或评估新图上的模型的情况下选择最佳方法以及其超参数（统称为模型）?图学习模型的选择大多是凭经验的。一种常见的方法是将流行的方法应用于新数据集，但这通常不是最优的。另一方面，在新图上系统地比较模型很快就变得过于昂贵，甚至是不切实际的。在这项工作中，我们开发了一种元学习方法，称为MetaGL，用于免评估的图学习模型选择，利用现有方法在各种基准图数据集上的先前表现，自动选择适用于新图的有效模型，无需对新图上的任何模型进行训练或评估。为了量化各种类型图之间的相似度，我们引入了专门的元图特征，捕捉图的结构特征。然后我们描述了一个元学习框架，利用这些元图特征预测各种图学习模型在新图上的性能，而无需在新图上训练或评估任何模型。我们的实证结果表明，MetaGL在几个基准数据集上实现了最先进的性能，并在准确性和效率方面大大优于凭经验的方法。",
    "tldr": "本论文提出了一种名为MetaGL的元学习方法，可以在免评估的情况下选择最佳的图学习模型和超参数，并且通过引入元图特征来预测各种图学习模型在新图上的性能，相比于凭经验的方法具有更好的准确性和效率。",
    "en_tdlr": "This paper proposes a meta-learning approach called MetaGL that can select the best graph learning model and hyperparameters without evaluation on the new graph, and predicts the performance of various graph learning models on a new graph by introducing specialized meta-graph features, which outperform ad hoc approaches in terms of both accuracy and efficiency."
}