{
    "title": "Using Twitter Data to Understand Public Perceptions of Approved versus Off-label Use for COVID-19-related Medications. (arXiv:2206.14358v2 [cs.CY] UPDATED)",
    "abstract": "Understanding public discourse on emergency use of unproven therapeutics is crucial for monitoring safe use and combating misinformation. We developed a natural language processing-based pipeline to comprehend public perceptions of and stances on coronavirus disease 2019 (COVID-19)-related drugs on Twitter over time. This retrospective study included 609,189 US-based tweets from January 29, 2020, to November 30, 2021, about four drugs that garnered significant public attention during the COVID-19 pandemic: (1) Hydroxychloroquine and Ivermectin, therapies with anecdotal evidence; and (2) Molnupiravir and Remdesivir, FDA-approved treatments for eligible patients. Time-trend analysis was employed to understand popularity trends and related events. Content and demographic analyses were conducted to explore potential rationales behind people's stances on each drug. Time-trend analysis indicated that Hydroxychloroquine and Ivermectin were discussed more than Molnupiravir and Remdesivir, part",
    "link": "http://arxiv.org/abs/2206.14358",
    "context": "Title: Using Twitter Data to Understand Public Perceptions of Approved versus Off-label Use for COVID-19-related Medications. (arXiv:2206.14358v2 [cs.CY] UPDATED)\nAbstract: Understanding public discourse on emergency use of unproven therapeutics is crucial for monitoring safe use and combating misinformation. We developed a natural language processing-based pipeline to comprehend public perceptions of and stances on coronavirus disease 2019 (COVID-19)-related drugs on Twitter over time. This retrospective study included 609,189 US-based tweets from January 29, 2020, to November 30, 2021, about four drugs that garnered significant public attention during the COVID-19 pandemic: (1) Hydroxychloroquine and Ivermectin, therapies with anecdotal evidence; and (2) Molnupiravir and Remdesivir, FDA-approved treatments for eligible patients. Time-trend analysis was employed to understand popularity trends and related events. Content and demographic analyses were conducted to explore potential rationales behind people's stances on each drug. Time-trend analysis indicated that Hydroxychloroquine and Ivermectin were discussed more than Molnupiravir and Remdesivir, part",
    "path": "papers/22/06/2206.14358.json",
    "total_tokens": 993,
    "translated_title": "使用Twitter数据了解公众对COVID-19相关药物批准和离标使用的看法",
    "translated_abstract": "理解公众关于未经证实治疗方法的紧急使用的讨论对于监测安全使用和打击错误信息至关重要。我们开发了一种自然语言处理的流程，以理解Twitter上关于冠状病毒病2019（COVID-19）相关药物的公众看法和立场。这项回顾性研究包括了在COVID-19大流行期间，从2020年1月29日到2021年11月30日，关于四种药物的609,189条美国推文，这四种药物在公众中引起了重大关注：（1）羟氯喹和伊维菌素，具有案例证据的治疗方法；（2）莫米匹雷韦和瑞德西韦，FDA批准用于合格患者的治疗方法。利用时间趋势分析了解其受欢迎度趋势和相关事件。进行了内容和人口统计学分析，以探索人们对每种药物立场的潜在理由。",
    "tldr": "通过Twitter数据分析了解公众对COVID-19相关药物的批准和离标使用的看法。Hydroxychloroquine和Ivermectin比Molnupiravir和Remdesivir的讨论更多，时间趋势分析和内容分析揭示了人们对每种药物立场的可能理由。",
    "en_tdlr": "Analyzed Twitter data to understand public perceptions of approved and off-label use of COVID-19-related medications. Hydroxychloroquine and Ivermectin received more discussion compared to Molnupiravir and Remdesivir, and time-trend analysis and content analysis revealed potential rationales behind people's stances on each drug."
}