{
    "title": "Variational Quantum and Quantum-Inspired Clustering. (arXiv:2206.09893v2 [quant-ph] UPDATED)",
    "abstract": "Here we present a quantum algorithm for clustering data based on a variational quantum circuit. The algorithm allows to classify data into many clusters, and can easily be implemented in few-qubit Noisy Intermediate-Scale Quantum (NISQ) devices. The idea of the algorithm relies on reducing the clustering problem to an optimization, and then solving it via a Variational Quantum Eigensolver (VQE) combined with non-orthogonal qubit states. In practice, the method uses maximally-orthogonal states of the target Hilbert space instead of the usual computational basis, allowing for a large number of clusters to be considered even with few qubits. We benchmark the algorithm with numerical simulations using real datasets, showing excellent performance even with one single qubit. Moreover, a tensor network simulation of the algorithm implements, by construction, a quantum-inspired clustering algorithm that can run on current classical hardware.",
    "link": "http://arxiv.org/abs/2206.09893",
    "context": "Title: Variational Quantum and Quantum-Inspired Clustering. (arXiv:2206.09893v2 [quant-ph] UPDATED)\nAbstract: Here we present a quantum algorithm for clustering data based on a variational quantum circuit. The algorithm allows to classify data into many clusters, and can easily be implemented in few-qubit Noisy Intermediate-Scale Quantum (NISQ) devices. The idea of the algorithm relies on reducing the clustering problem to an optimization, and then solving it via a Variational Quantum Eigensolver (VQE) combined with non-orthogonal qubit states. In practice, the method uses maximally-orthogonal states of the target Hilbert space instead of the usual computational basis, allowing for a large number of clusters to be considered even with few qubits. We benchmark the algorithm with numerical simulations using real datasets, showing excellent performance even with one single qubit. Moreover, a tensor network simulation of the algorithm implements, by construction, a quantum-inspired clustering algorithm that can run on current classical hardware.",
    "path": "papers/22/06/2206.09893.json",
    "total_tokens": 975,
    "translated_title": "变分量子和量子启发式聚类",
    "translated_abstract": "在这里，我们提出了一种基于变分量子电路的量子聚类算法。该算法可以将数据分类为多个聚类，并且可以在少量量子比特的噪声中间尺度量子（NISQ）设备上轻松实现。该算法的思想是将聚类问题缩减为一个优化问题，然后通过变分量子本征求解器（VQE）与非正交量子比特状态相结合来解决它。实际上，该方法使用目标希尔伯特空间的最大正交状态而不是通常的计算基础，即使有少量量子比特也可以考虑大量聚类。我们使用真实数据集进行数值模拟来评估算法的性能，结果表明即使只有一个量子比特，算法的性能也很好。此外，通过张量网络模拟算法，我们可以构建一个可以在当前经典硬件上运行的量子启发式聚类算法。",
    "tldr": "这个论文提出了一种基于变分量子电路的量子聚类算法。通过将聚类问题转化为优化问题，并通过变分量子本征求解器（VQE）结合非正交量子比特状态来解决，可以有效地在NISQ设备上实现。数值模拟结果表明，即使只有一个量子比特，算法也具有出色的性能。此外，通过张量网络模拟算法，可以在经典硬件上运行量子启发式聚类算法。",
    "en_tdlr": "This paper presents a quantum clustering algorithm based on a variational quantum circuit. By reducing the clustering problem to an optimization and solving it using a Variational Quantum Eigensolver (VQE) combined with non-orthogonal qubit states, the algorithm can be efficiently implemented on NISQ devices. Numerical simulations show excellent performance even with only one qubit. Additionally, a tensor network simulation allows for a quantum-inspired clustering algorithm to be run on classical hardware."
}