{
    "title": "Bridging the Gap Between Indexing and Retrieval for Differentiable Search Index with Query Generation. (arXiv:2206.10128v3 [cs.IR] UPDATED)",
    "abstract": "The Differentiable Search Index (DSI) is an emerging paradigm for information retrieval. Unlike traditional retrieval architectures where index and retrieval are two different and separate components, DSI uses a single transformer model to perform both indexing and retrieval.  In this paper, we identify and tackle an important issue of current DSI models: the data distribution mismatch that occurs between the DSI indexing and retrieval processes. Specifically, we argue that, at indexing, current DSI methods learn to build connections between the text of long documents and the identifier of the documents, but then retrieval of document identifiers is based on queries that are commonly much shorter than the indexed documents. This problem is further exacerbated when using DSI for cross-lingual retrieval, where document text and query text are in different languages.  To address this fundamental problem of current DSI models, we propose a simple yet effective indexing framework for DSI, c",
    "link": "http://arxiv.org/abs/2206.10128",
    "context": "Title: Bridging the Gap Between Indexing and Retrieval for Differentiable Search Index with Query Generation. (arXiv:2206.10128v3 [cs.IR] UPDATED)\nAbstract: The Differentiable Search Index (DSI) is an emerging paradigm for information retrieval. Unlike traditional retrieval architectures where index and retrieval are two different and separate components, DSI uses a single transformer model to perform both indexing and retrieval.  In this paper, we identify and tackle an important issue of current DSI models: the data distribution mismatch that occurs between the DSI indexing and retrieval processes. Specifically, we argue that, at indexing, current DSI methods learn to build connections between the text of long documents and the identifier of the documents, but then retrieval of document identifiers is based on queries that are commonly much shorter than the indexed documents. This problem is further exacerbated when using DSI for cross-lingual retrieval, where document text and query text are in different languages.  To address this fundamental problem of current DSI models, we propose a simple yet effective indexing framework for DSI, c",
    "path": "papers/22/06/2206.10128.json",
    "total_tokens": 855,
    "translated_title": "将索引和检索桥接起来，为具有查询生成的可微搜索索引填补差距",
    "translated_abstract": "可微搜索索引(DSI)是一种新兴的信息检索范式。与传统的检索架构不同，其中索引和检索是两个不同的组件，DSI使用单个transformer模型来执行索引和检索。在本文中，我们确定并解决了当前DSI模型的一个重要问题：DSI索引和检索过程之间出现的数据分布不匹配。具体而言，我们认为，在索引过程中，当前DSI方法学习构建长文档的文本与文档标识符之间的连接，但检索过程中使用的查询通常比索引的文档要短得多。当将DSI用于跨语言检索时，这个问题进一步加剧，因为文档文本和查询文本处于不同的语言中。为了解决当前DSI模型的这个根本问题，我们提出了一个简单而有效的DSI索引框架，c",
    "tldr": "本文识别和解决了当前可微搜索索引模型的一个重要问题：在索引和检索过程中存在的数据分布不匹配。为了解决这个问题，提出了一个简单而有效的索引框架。",
    "en_tdlr": "This paper identifies and addresses an important issue in current differentiable search index models: the data distribution mismatch between indexing and retrieval processes. To tackle this problem, a simple yet effective indexing framework is proposed."
}