{
    "title": "KeyCLD: Learning Constrained Lagrangian Dynamics in Keypoint Coordinates from Images. (arXiv:2206.11030v2 [cs.LG] UPDATED)",
    "abstract": "We present KeyCLD, a framework to learn Lagrangian dynamics from images. Learned keypoints represent semantic landmarks in images and can directly represent state dynamics. We show that interpreting this state as Cartesian coordinates, coupled with explicit holonomic constraints, allows expressing the dynamics with a constrained Lagrangian. KeyCLD is trained unsupervised end-to-end on sequences of images. Our method explicitly models the mass matrix, potential energy and the input matrix, thus allowing energy based control. We demonstrate learning of Lagrangian dynamics from images on the dm_control pendulum, cartpole and acrobot environments. KeyCLD can be learned on these systems, whether they are unactuated, underactuated or fully actuated. Trained models are able to produce long-term video predictions, showing that the dynamics are accurately learned. We compare with Lag-VAE, Lag-caVAE and HGN, and investigate the benefit of the Lagrangian prior and the constraint function. KeyCLD ",
    "link": "http://arxiv.org/abs/2206.11030",
    "context": "Title: KeyCLD: Learning Constrained Lagrangian Dynamics in Keypoint Coordinates from Images. (arXiv:2206.11030v2 [cs.LG] UPDATED)\nAbstract: We present KeyCLD, a framework to learn Lagrangian dynamics from images. Learned keypoints represent semantic landmarks in images and can directly represent state dynamics. We show that interpreting this state as Cartesian coordinates, coupled with explicit holonomic constraints, allows expressing the dynamics with a constrained Lagrangian. KeyCLD is trained unsupervised end-to-end on sequences of images. Our method explicitly models the mass matrix, potential energy and the input matrix, thus allowing energy based control. We demonstrate learning of Lagrangian dynamics from images on the dm_control pendulum, cartpole and acrobot environments. KeyCLD can be learned on these systems, whether they are unactuated, underactuated or fully actuated. Trained models are able to produce long-term video predictions, showing that the dynamics are accurately learned. We compare with Lag-VAE, Lag-caVAE and HGN, and investigate the benefit of the Lagrangian prior and the constraint function. KeyCLD ",
    "path": "papers/22/06/2206.11030.json",
    "total_tokens": 1047,
    "translated_title": "KeyCLD: 从图像中学习基于关键点坐标的受限拉格朗日动力学",
    "translated_abstract": "我们提出了KeyCLD，一个从图像中学习拉格朗日动力学的框架。学习到的关键点在图像中代表语义地标，可以直接表示状态动力学。我们表明，将这个状态解释为笛卡尔坐标，结合显式的完整约束，可以用受限拉格朗日动力学来表示动力学。KeyCLD在图像序列上进行无监督端到端训练。我们的方法显式地建模了质量矩阵、势能和输入矩阵，从而实现基于能量的控制。我们在dm_control摆、倒立摆和倒立摆机器人环境上展示了从图像中学习拉格朗日动力学的能力。KeyCLD可以在这些系统上进行学习，无论它们是无驱动、亚驱动还是全驱动。训练好的模型能够进行长期视频预测，显示其准确学习了动力学。我们与Lag-VAE、Lag-caVAE和HGN进行了比较，并研究了拉格朗日先验和约束函数的优势。",
    "tldr": "KeyCLD是一个从图像中学习拉格朗日动力学的框架，通过学习关键点坐标表示状态动力学，并结合显式的完整约束来表示动力学。该方法经过无监督端到端训练，在各种环境中展示了准确学习动力学的能力，并实现了长期视频预测。与其他模型进行比较，并研究了拉格朗日先验和约束函数的优势。",
    "en_tdlr": "KeyCLD is a framework for learning Lagrangian dynamics from images, representing state dynamics using learned keypoints and explicit holonomic constraints. Trained unsupervised end-to-end, it demonstrates accurate learning of dynamics in various environments and enables long-term video predictions. Comparison with other models and investigation of the benefits of Lagrangian prior and constraint function are conducted."
}