{
    "title": "On Image Segmentation With Noisy Labels: Characterization and Volume Properties of the Optimal Solutions to Accuracy and Dice. (arXiv:2206.06484v4 [cs.CV] UPDATED)",
    "abstract": "We study two of the most popular performance metrics in medical image segmentation, Accuracy and Dice, when the target labels are noisy. For both metrics, several statements related to characterization and volume properties of the set of optimal segmentations are proved, and associated experiments are provided. Our main insights are: (i) the volume of the solutions to both metrics may deviate significantly from the expected volume of the target, (ii) the volume of a solution to Accuracy is always less than or equal to the volume of a solution to Dice and (iii) the optimal solutions to both of these metrics coincide when the set of feasible segmentations is constrained to the set of segmentations with the volume equal to the expected volume of the target.",
    "link": "http://arxiv.org/abs/2206.06484",
    "context": "Title: On Image Segmentation With Noisy Labels: Characterization and Volume Properties of the Optimal Solutions to Accuracy and Dice. (arXiv:2206.06484v4 [cs.CV] UPDATED)\nAbstract: We study two of the most popular performance metrics in medical image segmentation, Accuracy and Dice, when the target labels are noisy. For both metrics, several statements related to characterization and volume properties of the set of optimal segmentations are proved, and associated experiments are provided. Our main insights are: (i) the volume of the solutions to both metrics may deviate significantly from the expected volume of the target, (ii) the volume of a solution to Accuracy is always less than or equal to the volume of a solution to Dice and (iii) the optimal solutions to both of these metrics coincide when the set of feasible segmentations is constrained to the set of segmentations with the volume equal to the expected volume of the target.",
    "path": "papers/22/06/2206.06484.json",
    "total_tokens": 933,
    "translated_title": "关于带有噪声标签的图像分割问题：Accuracy和Dice的最优解的特性和体积属性的刻画",
    "translated_abstract": "本文研究了医学图像分割中两种最流行的性能测量方法Accuracy和Dice在目标标签存在噪声的情况下的表现。对于这两种测量方法，我们证明了与最佳分割集的特性和体积属性有关的多个命题，并提供了相关实验。我们的主要见解是：（i）两种测量方法的解集的体积可能显著偏离目标的预期体积，（ii）Accuracy的解的体积始终小于等于Dice的解的体积，（iii）当可行分割集被限制为体积等于目标预期体积的分割集时，这两种指标的最优解是一致的。",
    "tldr": "该论文研究了医学图像分割中常用的Accuracy和Dice测量方法在存在噪声标签的情况下的性能表现，并在探究中获得了结论：两种测量方法的最优解集体积可能显著偏离目标预期体积，Accuracy的解的体积始终小于等于Dice的解的体积，但当可行分割集被限制为体积等于目标预期体积的分割集时，两种指标的最优解是一致的。",
    "en_tdlr": "This paper investigates the performance of the commonly used Accuracy and Dice metrics in medical image segmentation with noisy labels and obtains the conclusion that the volume of the optimal solution set for both metrics may deviate significantly from the expected volume of the target, and the volume of a solution to Accuracy is always less than or equal to that of a solution to Dice. However, the optimal solutions to both metrics coincide when the feasible segmentation set is constrained to that with the volume equal to the expected volume of the target."
}