{
    "title": "On the Performance of the Neyman Allocation with Small Pilots",
    "abstract": "arXiv:2206.04643v3 Announce Type: replace  Abstract: The Neyman Allocation is used in many papers on experimental design, which typically assume that researchers have access to large pilot studies. This may be unrealistic. To understand the properties of the Neyman Allocation with small pilots, we study its behavior in an asymptotic framework that takes pilot size to be fixed even as the size of the main wave tends to infinity. Our analysis shows that the Neyman Allocation can lead to estimates of the ATE with higher asymptotic variance than with (non-adaptive) balanced randomization. In particular, this happens when the outcome variable is relatively homoskedastic with respect to treatment status or when it exhibits high kurtosis. We provide a series of empirical examples showing that such situations can arise in practice. Our results suggest that researchers with small pilots should not use the Neyman Allocation if they believe that outcomes are homoskedastic or heavy-tailed. We exam",
    "link": "https://arxiv.org/abs/2206.04643",
    "context": "Title: On the Performance of the Neyman Allocation with Small Pilots\nAbstract: arXiv:2206.04643v3 Announce Type: replace  Abstract: The Neyman Allocation is used in many papers on experimental design, which typically assume that researchers have access to large pilot studies. This may be unrealistic. To understand the properties of the Neyman Allocation with small pilots, we study its behavior in an asymptotic framework that takes pilot size to be fixed even as the size of the main wave tends to infinity. Our analysis shows that the Neyman Allocation can lead to estimates of the ATE with higher asymptotic variance than with (non-adaptive) balanced randomization. In particular, this happens when the outcome variable is relatively homoskedastic with respect to treatment status or when it exhibits high kurtosis. We provide a series of empirical examples showing that such situations can arise in practice. Our results suggest that researchers with small pilots should not use the Neyman Allocation if they believe that outcomes are homoskedastic or heavy-tailed. We exam",
    "path": "papers/22/06/2206.04643.json",
    "total_tokens": 875,
    "translated_title": "在小型试点实验中涅曼分配的性能",
    "translated_abstract": "涅曼分配通常用于实验设计中，但大多数情况下假定研究人员可以获得大型试点研究，这可能并不现实。为了了解小型试点实验中涅曼分配的性质，我们在渐近框架下研究其行为，将试点大小固定，即使主要波浪的大小趋于无穷。我们的分析表明，涅曼分配可能导致对平均因果效应的估计具有比（非自适应的）平衡随机化更高的渐近方差。特别是，在结果变量相对均方差或高峰度时，会出现这种情况。我们提供一系列实证例子，展示这种情况在实践中是可能存在的。我们的结果表明，对于认为结果变量是均方差或重尾特性的研究人员，不应使用涅曼分配。我们进行了研究…",
    "tldr": "小样本试点研究中, 涅曼分配可能导致对于平均因果效应的估计具有比平衡随机化更高的渐近方差，特别是在结果变量相对均方差或高峰度时。"
}