{
    "title": "Counting Markov Equivalent Directed Acyclic Graphs Consistent with Background Knowledge. (arXiv:2206.06744v2 [cs.DS] UPDATED)",
    "abstract": "A polynomial-time exact algorithm for counting the number of directed acyclic graphs in a Markov equivalence class was recently given by Wien\\\"obst, Bannach, and Li\\'skiewicz (AAAI 2021). In this paper, we consider the more general problem of counting the number of directed acyclic graphs in a Markov equivalence class when the directions of some of the edges are also fixed (this setting arises, for example, when interventional data is partially available). This problem has been shown in earlier work to be complexity-theoretically hard. In contrast, we show that the problem is nevertheless tractable in an interesting class of instances, by establishing that it is ``fixed-parameter tractable''. In particular, our counting algorithm runs in time that is bounded by a polynomial in the size of the graph, where the degree of the polynomial does \\emph{not} depend upon the number of additional edges provided as input.",
    "link": "http://arxiv.org/abs/2206.06744",
    "context": "Title: Counting Markov Equivalent Directed Acyclic Graphs Consistent with Background Knowledge. (arXiv:2206.06744v2 [cs.DS] UPDATED)\nAbstract: A polynomial-time exact algorithm for counting the number of directed acyclic graphs in a Markov equivalence class was recently given by Wien\\\"obst, Bannach, and Li\\'skiewicz (AAAI 2021). In this paper, we consider the more general problem of counting the number of directed acyclic graphs in a Markov equivalence class when the directions of some of the edges are also fixed (this setting arises, for example, when interventional data is partially available). This problem has been shown in earlier work to be complexity-theoretically hard. In contrast, we show that the problem is nevertheless tractable in an interesting class of instances, by establishing that it is ``fixed-parameter tractable''. In particular, our counting algorithm runs in time that is bounded by a polynomial in the size of the graph, where the degree of the polynomial does \\emph{not} depend upon the number of additional edges provided as input.",
    "path": "papers/22/06/2206.06744.json",
    "total_tokens": 864,
    "translated_title": "与背景知识一致的计数马尔科夫等价有向无环图",
    "translated_abstract": "最近，Wienobst、Bannach和Liskiewicz（AAAI 2021）提出了一个计算马尔科夫等价类中有向无环图数量的多项式时间精确算法。本文考虑了更一般的问题，即在一些边的方向已确定的情况下计算马尔科夫等价类中的有向无环图数量（例如，在部分干预数据可用的情况下出现这种设置）。早期的研究表明，这个问题在复杂理论上是困难的。相反，我们发现该问题在一个有趣的实例类中仍然是可处理的，并建立了它的“固定参数可处理性”。特别地，我们的计数算法运行时间受到一个多项式的约束，并且这个多项式的度数\\emph{不}依赖于提供的附加边的数量。",
    "tldr": "本文研究如何在给定一些边的方向已确定的情况下，计算马尔科夫等价类中的有向无环图数量，并且提出了一个计数算法，该算法运行时间受到一个多项式的约束。",
    "en_tdlr": "This paper examines how to count the number of directed acyclic graphs in a Markov equivalence class when the directions of some of the edges are fixed and proposes a counting algorithm whose runtime is polynomially bounded, regardless of the number of additional edges provided."
}