{
    "title": "Persistent Homology of Coarse Grained State Space Networks. (arXiv:2206.02530v2 [stat.ML] UPDATED)",
    "abstract": "This work is dedicated to the topological analysis of complex transitional networks for dynamic state detection. Transitional networks are formed from time series data and they leverage graph theory tools to reveal information about the underlying dynamic system. However, traditional tools can fail to summarize the complex topology present in such graphs. In this work, we leverage persistent homology from topological data analysis to study the structure of these networks. We contrast dynamic state detection from time series using a coarse-grained state-space network (CGSSN) and topological data analysis (TDA) to two state of the art approaches: ordinal partition networks (OPNs) combined with TDA and the standard application of persistent homology to the time-delay embedding of the signal. We show that the CGSSN captures rich information about the dynamic state of the underlying dynamical system as evidenced by a significant improvement in dynamic state detection and noise robustness in",
    "link": "http://arxiv.org/abs/2206.02530",
    "context": "Title: Persistent Homology of Coarse Grained State Space Networks. (arXiv:2206.02530v2 [stat.ML] UPDATED)\nAbstract: This work is dedicated to the topological analysis of complex transitional networks for dynamic state detection. Transitional networks are formed from time series data and they leverage graph theory tools to reveal information about the underlying dynamic system. However, traditional tools can fail to summarize the complex topology present in such graphs. In this work, we leverage persistent homology from topological data analysis to study the structure of these networks. We contrast dynamic state detection from time series using a coarse-grained state-space network (CGSSN) and topological data analysis (TDA) to two state of the art approaches: ordinal partition networks (OPNs) combined with TDA and the standard application of persistent homology to the time-delay embedding of the signal. We show that the CGSSN captures rich information about the dynamic state of the underlying dynamical system as evidenced by a significant improvement in dynamic state detection and noise robustness in",
    "path": "papers/22/06/2206.02530.json",
    "total_tokens": 847,
    "translated_title": "粗粒化状态空间网络的持续同调",
    "translated_abstract": "本研究致力于对动态状态检测的复杂过渡网络进行拓扑分析。过渡网络由时间序列数据构成，并利用图论工具揭示底层动态系统的信息。然而，传统工具在总结这种图中的复杂拓扑时可能失败。在这项工作中，我们利用拓扑数据分析中的持续同调来研究这些网络的结构。我们将使用粗粒化状态空间网络（CGSSN）和拓扑数据分析（TDA）对时间序列进行动态状态检测与两种先进方法进行对比：使用TDA结合序数分区网络（OPNs）和将持续同调标准应用于信号的时滞嵌入。我们展示了CGSSN捕捉到底层动态系统的丰富信息，表现为动态状态检测和噪声鲁棒性显著提高。",
    "tldr": "本研究利用持续同调分析复杂过渡网络，发现粗粒化状态空间网络能够更好地捕捉底层动态系统的丰富信息，提高动态状态检测和噪声鲁棒性。",
    "en_tdlr": "This study uses persistent homology to analyze complex transitional networks and finds that coarse-grained state-space networks can better capture rich information about underlying dynamic systems, improving dynamic state detection and noise robustness."
}