{
    "title": "Consistent Attack: Universal Adversarial Perturbation on Embodied Vision Navigation. (arXiv:2206.05751v4 [cs.LG] UPDATED)",
    "abstract": "Embodied agents in vision navigation coupled with deep neural networks have attracted increasing attention. However, deep neural networks have been shown vulnerable to malicious adversarial noises, which may potentially cause catastrophic failures in Embodied Vision Navigation. Among different adversarial noises, universal adversarial perturbations (UAP), i.e., a constant image-agnostic perturbation applied on every input frame of the agent, play a critical role in Embodied Vision Navigation since they are computation-efficient and application-practical during the attack. However, existing UAP methods ignore the system dynamics of Embodied Vision Navigation and might be sub-optimal. In order to extend UAP to the sequential decision setting, we formulate the disturbed environment under the universal noise $\\delta$, as a $\\delta$-disturbed Markov Decision Process ($\\delta$-MDP). Based on the formulation, we analyze the properties of $\\delta$-MDP and propose two novel Consistent Attack me",
    "link": "http://arxiv.org/abs/2206.05751",
    "context": "Title: Consistent Attack: Universal Adversarial Perturbation on Embodied Vision Navigation. (arXiv:2206.05751v4 [cs.LG] UPDATED)\nAbstract: Embodied agents in vision navigation coupled with deep neural networks have attracted increasing attention. However, deep neural networks have been shown vulnerable to malicious adversarial noises, which may potentially cause catastrophic failures in Embodied Vision Navigation. Among different adversarial noises, universal adversarial perturbations (UAP), i.e., a constant image-agnostic perturbation applied on every input frame of the agent, play a critical role in Embodied Vision Navigation since they are computation-efficient and application-practical during the attack. However, existing UAP methods ignore the system dynamics of Embodied Vision Navigation and might be sub-optimal. In order to extend UAP to the sequential decision setting, we formulate the disturbed environment under the universal noise $\\delta$, as a $\\delta$-disturbed Markov Decision Process ($\\delta$-MDP). Based on the formulation, we analyze the properties of $\\delta$-MDP and propose two novel Consistent Attack me",
    "path": "papers/22/06/2206.05751.json",
    "total_tokens": 861,
    "translated_title": "一种基于连续决策的视觉导航普适性对抗扰动生成方法",
    "translated_abstract": "针对使用深度神经网络的视觉导航嵌入式智能体普遍存在的对抗性攻击威胁，本文提出了一种名为\"Consistent Attack\"的普适性对抗扰动生成方法，其在扰动攻击时不仅考虑了系统动态，还优化了对抗扰动，最小化智能体的累积奖励。实验结果表明，该方法在两个流行基准测试上明显优于基线UAP方法，实现了最先进的性能。",
    "tldr": "本文提出了一种Consistent Attack的方法用于生成视觉导航中的普适性对抗扰动，在考虑系统动态的同时优化对抗扰动，实验结果表明该方法优于基线UAP方法且表现最先进。"
}