{
    "title": "Diagnostic Tool for Out-of-Sample Model Evaluation. (arXiv:2206.10982v3 [stat.ML] UPDATED)",
    "abstract": "Assessment of model fitness is a key part of machine learning. The standard paradigm is to learn models by minimizing a chosen loss function averaged over training data, with the aim of achieving small losses on future data. In this paper, we consider the use of a finite calibration data set to characterize the future, out-of-sample losses of a model. We propose a simple model diagnostic tool that provides finite-sample guarantees under weak assumptions. The tool is simple to compute and to interpret. Several numerical experiments are presented to show how the proposed method quantifies the impact of distribution shifts, aids the analysis of regression, and enables model selection as well as hyper-parameter tuning.",
    "link": "http://arxiv.org/abs/2206.10982",
    "context": "Title: Diagnostic Tool for Out-of-Sample Model Evaluation. (arXiv:2206.10982v3 [stat.ML] UPDATED)\nAbstract: Assessment of model fitness is a key part of machine learning. The standard paradigm is to learn models by minimizing a chosen loss function averaged over training data, with the aim of achieving small losses on future data. In this paper, we consider the use of a finite calibration data set to characterize the future, out-of-sample losses of a model. We propose a simple model diagnostic tool that provides finite-sample guarantees under weak assumptions. The tool is simple to compute and to interpret. Several numerical experiments are presented to show how the proposed method quantifies the impact of distribution shifts, aids the analysis of regression, and enables model selection as well as hyper-parameter tuning.",
    "path": "papers/22/06/2206.10982.json",
    "total_tokens": 781,
    "translated_title": "用于外样本模型评估的诊断工具",
    "translated_abstract": "模型适配性评估是机器学习的关键部分。标准范式是通过对训练数据上的选择损失函数进行平均，以实现在未来数据上获得小的损失。在本文中，我们考虑使用有限的校准数据集来表征模型在未来外样本上的损失。我们提出了一个简单的模型诊断工具，在弱假设下提供有限样本的保证。该工具简单易用且易于解释。通过展示几个数值实验，我们展示了提出的方法如何量化分布转变的影响，促进回归分析，以及实现模型选择和超参数调优。",
    "tldr": "本文提出了一种用于外样本模型评估的诊断工具，可以通过有限的校准数据集来表征模型在未来外样本上的损失，并提供了简单易用且易于解释的方法。该工具可以量化分布转变的影响，促进回归分析，帮助实现模型选择和超参数调优。",
    "en_tdlr": "This paper proposes a diagnostic tool for out-of-sample model evaluation, which characterizes the losses of a model on future data using a finite calibration dataset. The tool is simple to compute and interpret, and it can quantify the impact of distribution shifts, aid regression analysis, and facilitate model selection and hyper-parameter tuning."
}