{
    "title": "IBP Regularization for Verified Adversarial Robustness via Branch-and-Bound. (arXiv:2206.14772v2 [cs.LG] UPDATED)",
    "abstract": "Recent works have tried to increase the verifiability of adversarially trained networks by running the attacks over domains larger than the original perturbations and adding various regularization terms to the objective. However, these algorithms either underperform or require complex and expensive stage-wise training procedures, hindering their practical applicability. We present IBP-R, a novel verified training algorithm that is both simple and effective. IBP-R induces network verifiability by coupling adversarial attacks on enlarged domains with a regularization term, based on inexpensive interval bound propagation, that minimizes the gap between the non-convex verification problem and its approximations. By leveraging recent branch-and-bound frameworks, we show that IBP-R obtains state-of-the-art verified robustness-accuracy trade-offs for small perturbations on CIFAR-10 while training significantly faster than relevant previous work. Additionally, we present UPB, a novel branching",
    "link": "http://arxiv.org/abs/2206.14772",
    "context": "Title: IBP Regularization for Verified Adversarial Robustness via Branch-and-Bound. (arXiv:2206.14772v2 [cs.LG] UPDATED)\nAbstract: Recent works have tried to increase the verifiability of adversarially trained networks by running the attacks over domains larger than the original perturbations and adding various regularization terms to the objective. However, these algorithms either underperform or require complex and expensive stage-wise training procedures, hindering their practical applicability. We present IBP-R, a novel verified training algorithm that is both simple and effective. IBP-R induces network verifiability by coupling adversarial attacks on enlarged domains with a regularization term, based on inexpensive interval bound propagation, that minimizes the gap between the non-convex verification problem and its approximations. By leveraging recent branch-and-bound frameworks, we show that IBP-R obtains state-of-the-art verified robustness-accuracy trade-offs for small perturbations on CIFAR-10 while training significantly faster than relevant previous work. Additionally, we present UPB, a novel branching",
    "path": "papers/22/06/2206.14772.json",
    "total_tokens": 942,
    "translated_title": "基于区间传播的IBP正则化方法提高对抗训练网络的验证稳健性",
    "translated_abstract": "近期的工作尝试通过在扩大的领域上运行攻击并向目标函数中添加各种正则项来增加对抗训练网络的可验证性。然而，这些算法要么性能不佳，要么需要复杂和昂贵的分阶段训练过程，从而影响其实际应用。本文提出了一种新颖的验证训练算法IBP-R，它既简单又有效。IBP-R通过在扩大的领域上进行对抗性攻击并结合一种基于廉价区间传播的正则化项来引入网络的可验证性，从而最小化非凸验证问题与其近似之间的差距。通过利用最近的分支定界框架，我们展示了IBP-R在CIFAR-10小扰动上获得了最先进的验证稳健性-准确性平衡，同时比相关先前工作训练速度更快。此外，我们还提出了一种新的分支算法UPB。",
    "tldr": "本文提出了一种基于区间传播的IBP正则化算法，通过在扩大的领域上进行对抗性攻击并结合一种基于廉价区间传播的正则化项来引入网络的可验证性，从而实现对抗训练网络的验证稳健性。",
    "en_tdlr": "This paper presents a novel IBP regularization algorithm based on interval bound propagation to induce network verifiability and improve the verified robustness of adversarially trained networks. Verified training is achieved by coupling adversarial attacks on enlarged domains with a regularization term that minimizes the gap between the non-convex verification problem and its approximations."
}