{
    "title": "Estimating the Gains (and Losses) of Revenue Management. (arXiv:2206.04424v2 [econ.GN] UPDATED)",
    "abstract": "Despite the wide adoption of revenue management in many industries such as airline, railway, and hospitality, there is still scarce empirical evidence on the gains or losses of such strategies compared to uniform pricing or fully flexible strategies. We quantify such gains and losses and identify their underlying sources in the context of French railway transportation. The identification of demand is complicated by censoring and the absence of exogenous price variations. We develop an original identification strategy combining temporal variations in relative prices, consumers' rationality and weak optimality conditions on the firm's pricing strategy. Our results suggest similar or better performance of the actual revenue management compared to optimal uniform pricing, but also substantial losses of up to 16.7% compared to the optimal pricing strategy. We also highlight the key role of revenue management in acquiring information when demand is uncertain.",
    "link": "http://arxiv.org/abs/2206.04424",
    "context": "Title: Estimating the Gains (and Losses) of Revenue Management. (arXiv:2206.04424v2 [econ.GN] UPDATED)\nAbstract: Despite the wide adoption of revenue management in many industries such as airline, railway, and hospitality, there is still scarce empirical evidence on the gains or losses of such strategies compared to uniform pricing or fully flexible strategies. We quantify such gains and losses and identify their underlying sources in the context of French railway transportation. The identification of demand is complicated by censoring and the absence of exogenous price variations. We develop an original identification strategy combining temporal variations in relative prices, consumers' rationality and weak optimality conditions on the firm's pricing strategy. Our results suggest similar or better performance of the actual revenue management compared to optimal uniform pricing, but also substantial losses of up to 16.7% compared to the optimal pricing strategy. We also highlight the key role of revenue management in acquiring information when demand is uncertain.",
    "path": "papers/22/06/2206.04424.json",
    "total_tokens": 917,
    "translated_title": "预估收益管理的盈利和损失",
    "translated_abstract": "尽管收益管理在航空、铁路和酒店等许多行业得到了广泛应用，但与统一定价或完全灵活的策略相比，其收益或损失尚缺乏实证证据。我们在法国铁路运输的背景下量化了这种盈利和损失，并确定了其潜在来源。需求的识别由于审查和外生价格变化的缺失而变得复杂。我们开发了一种原始的识别策略，结合了相对价格的时间变化、消费者的理性和公司定价策略的弱最优性条件。我们的研究结果表明，实际收益管理的表现与最优统一定价相似或更好，但与最优定价策略相比，也存在高达16.7%的实质损失。我们还强调了收益管理在需求不确定时获取信息的关键作用。",
    "tldr": "本论文研究了法国铁路运输中收益管理与统一定价或完全灵活的策略的盈利和损失，提出了一种原始的识别策略，研究结果显示实际收益管理表现相似或更好，但也存在高达16.7%的实质损失，并强调了收益管理在需求不确定时获取信息的关键作用。",
    "en_tdlr": "This paper investigates the gains and losses of revenue management compared to uniform pricing or fully flexible strategies in the context of French railway transportation, presents an original identification strategy, and suggests similar or better performance of revenue management but also substantial losses of up to 16.7%. It also highlights the key role of revenue management in acquiring information when demand is uncertain."
}