{
    "title": "Tree-Guided Rare Feature Selection and Logic Aggregation with Electronic Health Records Data",
    "abstract": "arXiv:2206.09107v2 Announce Type: replace  Abstract: Statistical learning with a large number of rare binary features is commonly encountered in analyzing electronic health records (EHR) data, especially in the modeling of disease onset with prior medical diagnoses and procedures. Dealing with the resulting highly sparse and large-scale binary feature matrix is notoriously challenging as conventional methods may suffer from a lack of power in testing and inconsistency in model fitting while machine learning methods may suffer from the inability of producing interpretable results or clinically-meaningful risk factors. To improve EHR-based modeling and utilize the natural hierarchical structure of disease classification, we propose a tree-guided feature selection and logic aggregation approach for large-scale regression with rare binary features, in which dimension reduction is achieved through not only a sparsity pursuit but also an aggregation promoter with the logic operator of ``or''",
    "link": "https://arxiv.org/abs/2206.09107",
    "context": "Title: Tree-Guided Rare Feature Selection and Logic Aggregation with Electronic Health Records Data\nAbstract: arXiv:2206.09107v2 Announce Type: replace  Abstract: Statistical learning with a large number of rare binary features is commonly encountered in analyzing electronic health records (EHR) data, especially in the modeling of disease onset with prior medical diagnoses and procedures. Dealing with the resulting highly sparse and large-scale binary feature matrix is notoriously challenging as conventional methods may suffer from a lack of power in testing and inconsistency in model fitting while machine learning methods may suffer from the inability of producing interpretable results or clinically-meaningful risk factors. To improve EHR-based modeling and utilize the natural hierarchical structure of disease classification, we propose a tree-guided feature selection and logic aggregation approach for large-scale regression with rare binary features, in which dimension reduction is achieved through not only a sparsity pursuit but also an aggregation promoter with the logic operator of ``or''",
    "path": "papers/22/06/2206.09107.json",
    "total_tokens": 725,
    "translated_title": "电子健康记录数据中的树导向罕见特征选择和逻辑聚合",
    "translated_abstract": "处理具有大量罕见二进制特征的统计学习在分析电子健康记录（EHR）数据时很常见，尤其是在利用先前的医学诊断和程序对疾病发生进行建模时。为了改善基于EHR的建模并利用疾病分类的自然分层结构，我们提出了一种用于大规模回归的树导向特征选择和逻辑聚合方法，通过稀疏追求和“或”逻辑运算符的聚合促进器实现了降维。",
    "tldr": "提出了一种用于大规模回归的树导向特征选择和逻辑聚合方法，旨在改善基于电子健康记录的建模和利用疾病分类的自然分层结构",
    "en_tdlr": "Proposed a tree-guided feature selection and logic aggregation approach for large-scale regression to improve EHR-based modeling and utilize the natural hierarchical structure of disease classification."
}