{
    "title": "Segmentation in large-scale cellular electron microscopy with deep learning: A literature survey. (arXiv:2206.07171v3 [cs.CV] UPDATED)",
    "abstract": "Automated and semi-automated techniques in biomedical electron microscopy (EM) enable the acquisition of large datasets at a high rate. Segmentation methods are therefore essential to analyze and interpret these large volumes of data, which can no longer completely be labeled manually. In recent years, deep learning algorithms achieved impressive results in both pixel-level labeling (semantic segmentation) and the labeling of separate instances of the same class (instance segmentation). In this review, we examine how these algorithms were adapted to the task of segmenting cellular and sub-cellular structures in EM images. The special challenges posed by such images and the network architectures that overcame some of them are described. Moreover, a thorough overview is also provided on the notable datasets that contributed to the proliferation of deep learning in EM. Finally, an outlook of current trends and future prospects of EM segmentation is given, especially in the area of label-f",
    "link": "http://arxiv.org/abs/2206.07171",
    "context": "Title: Segmentation in large-scale cellular electron microscopy with deep learning: A literature survey. (arXiv:2206.07171v3 [cs.CV] UPDATED)\nAbstract: Automated and semi-automated techniques in biomedical electron microscopy (EM) enable the acquisition of large datasets at a high rate. Segmentation methods are therefore essential to analyze and interpret these large volumes of data, which can no longer completely be labeled manually. In recent years, deep learning algorithms achieved impressive results in both pixel-level labeling (semantic segmentation) and the labeling of separate instances of the same class (instance segmentation). In this review, we examine how these algorithms were adapted to the task of segmenting cellular and sub-cellular structures in EM images. The special challenges posed by such images and the network architectures that overcame some of them are described. Moreover, a thorough overview is also provided on the notable datasets that contributed to the proliferation of deep learning in EM. Finally, an outlook of current trends and future prospects of EM segmentation is given, especially in the area of label-f",
    "path": "papers/22/06/2206.07171.json",
    "total_tokens": 1019,
    "translated_title": "深度学习在大规模细胞电子显微镜中的分割：文献综述",
    "translated_abstract": "生物医学电子显微镜中的自动化和半自动化技术使得高速获取大数据集成为了可能。因此，分割方法对于分析和解释这些大量的数据是至关重要的。近年来，深度学习算法在像素级标注（语义分割）和同一类别的不同实例的标注（实例分割）方面取得了令人瞩目的结果。本综述研究了这些算法如何被应用于细胞和亚细胞结构的分割。文章描述了这些图像所产生的特殊挑战以及克服某些挑战的网络体系结构。此外，文章还提供了有关在EM中推动深度学习发展的显著数据集的全面概述。最后，给出了当前趋势和EM分割未来前景的展望，特别是在标签-free的EM中。",
    "tldr": "本文综述了如何使用深度学习算法来处理大规模的电子显微镜数据集。重点讨论了算法如何应用于细胞和亚细胞结构的分割，并介绍了某些网络体系结构如何克服这些图像所产生的特殊挑战。此外，本文还提供了有关在EM中推动深度学习发展的显著数据集的全面概述，并展望了EM分割的当前趋势和未来前景，特别是在标签-free的EM中。",
    "en_tdlr": "This review discusses the use of deep learning algorithms in processing large-scale electron microscopy datasets, with a focus on how the algorithms were applied to segment cellular and sub-cellular structures. Special challenges posed by these images and the network architectures that overcame some of them were also described. Additionally, notable datasets that contributed to the development of deep learning in electron microscopy were comprehensively overviewed, with an outlook on current trends and future prospects of electron microscopy segmentation, especially in label-free EM."
}