{
    "title": "RIS-ADMM: A RIS and ADMM-Based Passive and Sparse Sensing Method With Interference Removal",
    "abstract": "arXiv:2206.06172v2 Announce Type: replace-cross  Abstract: Reconfigurable Intelligent Surfaces (RIS) emerge as promising technologies in future radar and wireless communication domains. This letter addresses the passive sensing issue utilizing wireless communication signals and RIS amidst interference from wireless access points (APs). We introduce an atomic norm minimization (ANM) approach to leverage spatial domain target sparsity and estimate the direction of arrival (DOA). However, the conventional semidefinite programming (SDP)-based solutions for the ANM problem are complex and lack efficient realization. Consequently, we propose a RIS-ADMM method, an innovative alternating direction method of multipliers (ADMM)-based iterative approach. This method yields closed-form expressions and effectively suppresses interference signals. Simulation outcomes affirm that our RIS-ADMM method surpasses existing techniques in DOA estimation accuracy while maintaining low computational complexit",
    "link": "https://arxiv.org/abs/2206.06172",
    "context": "Title: RIS-ADMM: A RIS and ADMM-Based Passive and Sparse Sensing Method With Interference Removal\nAbstract: arXiv:2206.06172v2 Announce Type: replace-cross  Abstract: Reconfigurable Intelligent Surfaces (RIS) emerge as promising technologies in future radar and wireless communication domains. This letter addresses the passive sensing issue utilizing wireless communication signals and RIS amidst interference from wireless access points (APs). We introduce an atomic norm minimization (ANM) approach to leverage spatial domain target sparsity and estimate the direction of arrival (DOA). However, the conventional semidefinite programming (SDP)-based solutions for the ANM problem are complex and lack efficient realization. Consequently, we propose a RIS-ADMM method, an innovative alternating direction method of multipliers (ADMM)-based iterative approach. This method yields closed-form expressions and effectively suppresses interference signals. Simulation outcomes affirm that our RIS-ADMM method surpasses existing techniques in DOA estimation accuracy while maintaining low computational complexit",
    "path": "papers/22/06/2206.06172.json",
    "total_tokens": 873,
    "translated_title": "基于RIS和ADMM的被动稀疏感知方法及干扰去除",
    "translated_abstract": "可重构智能表面（RIS）在未来雷达和无线通信领域崛起为有前途的技术。本文解决了在无线通信信号和RIS中被无线接入点（AP）干扰的情况下利用被动感知的问题。我们引入了一种原子范数最小化（ANM）方法来利用空间域目标稀疏性并估计到达方向（DOA）。然而，用于ANM问题的传统半定规划（SDP）解决方案复杂且缺乏高效实现。因此，我们提出了一种RIS-ADMM方法，这是一种创新的基于交替方向乘子方法（ADMM）的迭代方法。该方法产生闭式表达式并有效抑制干扰信号。仿真结果证实了我们的RIS-ADMM方法在DOA估计精度方面超过了现有技术，同时保持低计算复杂度。",
    "tldr": "本文提出了一种基于RIS和ADMM的被动稀疏感知方法，通过新颖的迭代方法有效抑制干扰信号，显著提高到达方向（DOA）估计的准确性。",
    "en_tdlr": "This paper proposes a passive and sparse sensing method based on RIS and ADMM, which effectively suppresses interference signals through an innovative iterative approach, significantly improving the accuracy of direction of arrival (DOA) estimation."
}