{
    "title": "Hysteretic Behavior Simulation Based on Pyramid Neural Network:Principle, Network Architecture, Case Study and Explanation. (arXiv:2206.03990v2 [cs.LG] UPDATED)",
    "abstract": "An accurate and efficient simulation of the hysteretic behavior of materials and components is essential for structural analysis. The surrogate model based on neural networks shows significant potential in balancing efficiency and accuracy. However, its serial information flow and prediction based on single-level features adversely affect the network performance. Therefore, a weighted stacked pyramid neural network architecture is proposed herein. This network establishes a pyramid architecture by introducing multi-level shortcuts to integrate features directly in the output module. In addition, a weighted stacked strategy is proposed to enhance the conventional feature fusion method. Subsequently, the redesigned architectures are compared with other commonly used network architectures. Results show that the redesigned architectures outperform the alternatives in 87.5% of cases. Meanwhile, the long and short-term memory abilities of different basic network architectures are analyzed th",
    "link": "http://arxiv.org/abs/2206.03990",
    "context": "Title: Hysteretic Behavior Simulation Based on Pyramid Neural Network:Principle, Network Architecture, Case Study and Explanation. (arXiv:2206.03990v2 [cs.LG] UPDATED)\nAbstract: An accurate and efficient simulation of the hysteretic behavior of materials and components is essential for structural analysis. The surrogate model based on neural networks shows significant potential in balancing efficiency and accuracy. However, its serial information flow and prediction based on single-level features adversely affect the network performance. Therefore, a weighted stacked pyramid neural network architecture is proposed herein. This network establishes a pyramid architecture by introducing multi-level shortcuts to integrate features directly in the output module. In addition, a weighted stacked strategy is proposed to enhance the conventional feature fusion method. Subsequently, the redesigned architectures are compared with other commonly used network architectures. Results show that the redesigned architectures outperform the alternatives in 87.5% of cases. Meanwhile, the long and short-term memory abilities of different basic network architectures are analyzed th",
    "path": "papers/22/06/2206.03990.json",
    "total_tokens": 873,
    "translated_title": "基于金字塔神经网络的滞回行为模拟：原理、网络结构、案例研究和解释",
    "translated_abstract": "一种准确高效的材料与构件滞回行为模拟对结构分析至关重要。基于神经网络的代理模型在效率和准确性上具有显著潜力。本文提出一种加权堆叠的金字塔神经网络架构。该网络通过引入多级快捷方式建立金字塔结构，将特征直接集成到输出模块中。此外，还提出了加权堆叠策略来增强传统的特征融合方法。随后，将重新设计的架构与其他常用网络架构进行比较。结果表明，重新设计的架构在87.5%的情况下优于替代方案。同时，分析了不同基本网络架构的长短期记忆能力。",
    "tldr": "本文提出了一种加权堆叠的金字塔神经网络架构，通过引入多级快捷方式建立金字塔结构，将特征直接集成到输出模块中，并提出了加权堆叠策略来增强特征融合方法。在滞回行为模拟中具有较优的效率和准确性。"
}