{
    "title": "Signature Methods in Machine Learning. (arXiv:2206.14674v5 [stat.ML] UPDATED)",
    "abstract": "Signature-based techniques give mathematical insight into the interactions between complex streams of evolving data. These insights can be quite naturally translated into numerical approaches to understanding streamed data, and perhaps because of their mathematical precision, have proved useful in analysing streamed data in situations where the data is irregular, and not stationary, and the dimension of the data and the sample sizes are both moderate. Understanding streamed multi-modal data is exponential: a word in $n$ letters from an alphabet of size $d$ can be any one of $d^n$ messages. Signatures remove the exponential amount of noise that arises from sampling irregularity, but an exponential amount of information still remain. This survey aims to stay in the domain where that exponential scaling can be managed directly. Scalability issues are an important challenge in many problems but would require another survey article and further ideas. This survey describes a range of context",
    "link": "http://arxiv.org/abs/2206.14674",
    "context": "Title: Signature Methods in Machine Learning. (arXiv:2206.14674v5 [stat.ML] UPDATED)\nAbstract: Signature-based techniques give mathematical insight into the interactions between complex streams of evolving data. These insights can be quite naturally translated into numerical approaches to understanding streamed data, and perhaps because of their mathematical precision, have proved useful in analysing streamed data in situations where the data is irregular, and not stationary, and the dimension of the data and the sample sizes are both moderate. Understanding streamed multi-modal data is exponential: a word in $n$ letters from an alphabet of size $d$ can be any one of $d^n$ messages. Signatures remove the exponential amount of noise that arises from sampling irregularity, but an exponential amount of information still remain. This survey aims to stay in the domain where that exponential scaling can be managed directly. Scalability issues are an important challenge in many problems but would require another survey article and further ideas. This survey describes a range of context",
    "path": "papers/22/06/2206.14674.json",
    "total_tokens": 853,
    "translated_title": "机器学习中的签名方法",
    "translated_abstract": "基于签名的技术为理解复杂的流式数据之间的相互作用提供了数学洞察力。这些洞察力可以很自然地转化为理解流式数据的数值方法，也许是因为它们具有数学的精确性，它们在分析非规则、非平稳的流式数据以及数据维度和样本大小都适中的情况下表现出了很有用的性质。对于理解流式多模态数据是指数级的问题：长度为$n$的字母串，来自大小为$d$的字母表，可以是$d^n$种不同的消息。签名消除了由于采样不规则性而产生的指数级的噪声，但仍然存在指数级的信息量。本综述旨在保持在可以直接管理这种指数级缩放的领域内。可扩展性问题是许多问题中的一个重要挑战，但需要另一篇综述文章和进一步的思路。本综述描述了一系列上下文。",
    "tldr": "本综述介绍了机器学习中应用的签名方法，通过数学洞察力理解复杂的流式数据之间的交互，并提供了用于分析非规则、非平稳的流式数据的数值方法。",
    "en_tdlr": "This survey explores signature methods in machine learning, which provide mathematical insights into the interactions between complex streams of data and offer numerical approaches to analyze irregular and non-stationary data."
}