{
    "title": "Beyond RMSE: Do machine-learned models of road user interaction produce human-like behavior?. (arXiv:2206.11110v2 [cs.LG] UPDATED)",
    "abstract": "Autonomous vehicles use a variety of sensors and machine-learned models to predict the behavior of surrounding road users. Most of the machine-learned models in the literature focus on quantitative error metrics like the root mean square error (RMSE) to learn and report their models' capabilities. This focus on quantitative error metrics tends to ignore the more important behavioral aspect of the models, raising the question of whether these models really predict human-like behavior. Thus, we propose to analyze the output of machine-learned models much like we would analyze human data in conventional behavioral research. We introduce quantitative metrics to demonstrate presence of three different behavioral phenomena in a naturalistic highway driving dataset: 1) The kinematics-dependence of who passes a merging point first 2) Lane change by an on-highway vehicle to accommodate an on-ramp vehicle 3) Lane changes by vehicles on the highway to avoid lead vehicle conflicts. Then, we analyz",
    "link": "http://arxiv.org/abs/2206.11110",
    "context": "Title: Beyond RMSE: Do machine-learned models of road user interaction produce human-like behavior?. (arXiv:2206.11110v2 [cs.LG] UPDATED)\nAbstract: Autonomous vehicles use a variety of sensors and machine-learned models to predict the behavior of surrounding road users. Most of the machine-learned models in the literature focus on quantitative error metrics like the root mean square error (RMSE) to learn and report their models' capabilities. This focus on quantitative error metrics tends to ignore the more important behavioral aspect of the models, raising the question of whether these models really predict human-like behavior. Thus, we propose to analyze the output of machine-learned models much like we would analyze human data in conventional behavioral research. We introduce quantitative metrics to demonstrate presence of three different behavioral phenomena in a naturalistic highway driving dataset: 1) The kinematics-dependence of who passes a merging point first 2) Lane change by an on-highway vehicle to accommodate an on-ramp vehicle 3) Lane changes by vehicles on the highway to avoid lead vehicle conflicts. Then, we analyz",
    "path": "papers/22/06/2206.11110.json",
    "total_tokens": 1093,
    "translated_title": "超越RMSE：机器学习模型的道路用户交互是否产生类人行为？",
    "translated_abstract": "自动驾驶汽车使用各种传感器和机器学习模型来预测周围道路用户的行为。大多数文献中的机器学习模型侧重于学习和报告模型的能力的定量误差度量，如均方根误差(RMSE)。这种侧重于定量误差度量的做法往往忽视了模型的更重要的行为方面，引发了这样一个问题：这些模型是否确实预测了类人行为。因此，我们建议以类似于传统行为研究中分析人类数据的方式来分析机器学习模型的输出。我们介绍定量度量来证明自然行驶数据集中存在三种不同行为现象的存在：1）谁先通过合并点取决于运动学 2）在高速公路上，车道变更以适应匝道车辆 3）在高速公路上避免前车冲突的车辆变道。然后，我们分析了三种不同的机器学习模型在执行这三种现象时与人类行为的表现。我们的研究结果表明，尽管机器学习模型在RMSE方面表现良好，但它们可能表现出不同于人类行为的行为，这凸显了在道路用户交互环境中对机器学习模型进行更细致分析的需求。",
    "tldr": "本文研究了机器学习模型在道路用户交互预测方面的行为，并发现尽管这些模型在RMSE方面表现良好，但它们的行为可能与人类不同，需要更细致的分析。"
}