{
    "title": "Semi-Autoregressive Energy Flows: Exploring Likelihood-Free Training of Normalizing Flows. (arXiv:2206.06672v2 [cs.LG] UPDATED)",
    "abstract": "Training normalizing flow generative models can be challenging due to the need to calculate computationally expensive determinants of Jacobians. This paper studies the likelihood-free training of flows and proposes the energy objective, an alternative sample-based loss based on proper scoring rules. The energy objective is determinant-free and supports flexible model architectures that are not easily compatible with maximum likelihood training, including semi-autoregressive energy flows, a novel model family that interpolates between fully autoregressive and non-autoregressive models. Energy flows feature competitive sample quality, posterior inference, and generation speed relative to likelihood-based flows; this performance is decorrelated from the quality of log-likelihood estimates, which are generally very poor. Our findings question the use of maximum likelihood as an objective or a metric, and contribute to a scientific study of its role in generative modeling.",
    "link": "http://arxiv.org/abs/2206.06672",
    "context": "Title: Semi-Autoregressive Energy Flows: Exploring Likelihood-Free Training of Normalizing Flows. (arXiv:2206.06672v2 [cs.LG] UPDATED)\nAbstract: Training normalizing flow generative models can be challenging due to the need to calculate computationally expensive determinants of Jacobians. This paper studies the likelihood-free training of flows and proposes the energy objective, an alternative sample-based loss based on proper scoring rules. The energy objective is determinant-free and supports flexible model architectures that are not easily compatible with maximum likelihood training, including semi-autoregressive energy flows, a novel model family that interpolates between fully autoregressive and non-autoregressive models. Energy flows feature competitive sample quality, posterior inference, and generation speed relative to likelihood-based flows; this performance is decorrelated from the quality of log-likelihood estimates, which are generally very poor. Our findings question the use of maximum likelihood as an objective or a metric, and contribute to a scientific study of its role in generative modeling.",
    "path": "papers/22/06/2206.06672.json",
    "total_tokens": 963,
    "translated_title": "半自回归能量流：探索正则化流的无似然训练。",
    "translated_abstract": "训练正则化流生成模型时，由于需要计算Jacobian行列式，因此会面临计算负担较重的挑战。本论文研究了流的无似然训练，并提出了能量目标，一种基于适当得分规则的替代基于样本的损失函数。能量目标是不需要行列式的，并支持灵活的模型架构，这些架构不容易与最大似然训练兼容，包括半自回归能量流，一种新颖的模型族，可以插值为全自回归和非自回归模型之间。相对于基于似然性的流，能量流具有竞争性的样本质量、后验推断和生成速度等性能；该性能与对数似然度量的质量通常非常差的质量无关。我们的发现对最大似然作为目标或指标的使用提出了质疑，并有助于对其在生成建模中所起的作用进行科学研究。",
    "tldr": "本文研究了正则化流的无似然训练，提出了能量目标，支持半自回归能量流等灵活的模型架构，并相对于基于似然性的流表现出有竞争力的性能，质疑了机器学习领域中以最大似然作为目标或指标的使用，为生成建模的研究做出了贡献。",
    "en_tdlr": "This paper studies likelihood-free training of flows and proposes the energy objective, which supports flexible model architectures and semi-autoregressive energy flows. The energy flows have competitive performance compared to likelihood-based flows, and this challenges the use of maximum likelihood as an objective or metric in generative modeling."
}