{
    "title": "Quantum Advantage Seeker with Kernels (QuASK): a software framework to speed up the research in quantum machine learning. (arXiv:2206.15284v2 [quant-ph] UPDATED)",
    "abstract": "Exploiting the properties of quantum information to the benefit of machine learning models is perhaps the most active field of research in quantum computation. This interest has supported the development of a multitude of software frameworks (e.g. Qiskit, Pennylane, Braket) to implement, simulate, and execute quantum algorithms. Most of them allow us to define quantum circuits, run basic quantum algorithms, and access low-level primitives depending on the hardware such software is supposed to run. For most experiments, these frameworks have to be manually integrated within a larger machine learning software pipeline. The researcher is in charge of knowing different software packages, integrating them through the development of long code scripts, analyzing the results, and generating the plots. Long code often leads to erroneous applications, due to the average number of bugs growing proportional with respect to the program length. Moreover, other researchers will struggle to understand",
    "link": "http://arxiv.org/abs/2206.15284",
    "context": "Title: Quantum Advantage Seeker with Kernels (QuASK): a software framework to speed up the research in quantum machine learning. (arXiv:2206.15284v2 [quant-ph] UPDATED)\nAbstract: Exploiting the properties of quantum information to the benefit of machine learning models is perhaps the most active field of research in quantum computation. This interest has supported the development of a multitude of software frameworks (e.g. Qiskit, Pennylane, Braket) to implement, simulate, and execute quantum algorithms. Most of them allow us to define quantum circuits, run basic quantum algorithms, and access low-level primitives depending on the hardware such software is supposed to run. For most experiments, these frameworks have to be manually integrated within a larger machine learning software pipeline. The researcher is in charge of knowing different software packages, integrating them through the development of long code scripts, analyzing the results, and generating the plots. Long code often leads to erroneous applications, due to the average number of bugs growing proportional with respect to the program length. Moreover, other researchers will struggle to understand",
    "path": "papers/22/06/2206.15284.json",
    "total_tokens": 874,
    "translated_title": "基于内核的量子优势寻求者（QuASK）：加速量子机器学习研究的软件框架",
    "translated_abstract": "利用量子信息的特性来使机器学习模型受益是量子计算中最活跃的研究领域之一。这种兴趣推动了多种软件框架（例如Qiskit、Pennylane、Braket）的开发，用于实现、模拟和执行量子算法。大多数框架允许我们定义量子电路、运行基本量子算法，并根据硬件访问低级别的基本操作。但是，在大多数实验中，这些框架必须手动集成到更大的机器学习软件流水线中。研究人员需要了解不同的软件包，通过开发长代码脚本进行集成，分析结果并生成绘图。长代码往往会导致错误的应用，因为平均错误数量与程序长度成正比增长。此外，其他研究人员也会难以理解。",
    "tldr": "QuASK是一个基于内核的软件框架，旨在加速量子机器学习研究。它解决了手动集成不同软件包和长代码脚本导致的错误应用和代码可读性问题。",
    "en_tdlr": "QuASK is a kernel-based software framework designed to accelerate research in quantum machine learning. It addresses the issues of manual integration of different software packages and the problems of error-prone applications and code readability caused by long code scripts."
}