{
    "title": "Toward multi-target self-organizing pursuit in a partially observable Markov game. (arXiv:2206.12330v3 [cs.MA] UPDATED)",
    "abstract": "The multiple-target self-organizing pursuit (SOP) problem has wide applications and has been considered a challenging self-organization game for distributed systems, in which intelligent agents cooperatively pursue multiple dynamic targets with partial observations. This work proposes a framework for decentralized multi-agent systems to improve the implicit coordination capabilities in search and pursuit. We model a self-organizing system as a partially observable Markov game (POMG) featured by large-scale, decentralization, partial observation, and noncommunication. The proposed distributed algorithm: fuzzy self-organizing cooperative coevolution (FSC2) is then leveraged to resolve the three challenges in multi-target SOP: distributed self-organizing search (SOS), distributed task allocation, and distributed single-target pursuit. FSC2 includes a coordinated multi-agent deep reinforcement learning (MARL) method that enables homogeneous agents to learn natural SOS patterns. Additionall",
    "link": "http://arxiv.org/abs/2206.12330",
    "context": "Title: Toward multi-target self-organizing pursuit in a partially observable Markov game. (arXiv:2206.12330v3 [cs.MA] UPDATED)\nAbstract: The multiple-target self-organizing pursuit (SOP) problem has wide applications and has been considered a challenging self-organization game for distributed systems, in which intelligent agents cooperatively pursue multiple dynamic targets with partial observations. This work proposes a framework for decentralized multi-agent systems to improve the implicit coordination capabilities in search and pursuit. We model a self-organizing system as a partially observable Markov game (POMG) featured by large-scale, decentralization, partial observation, and noncommunication. The proposed distributed algorithm: fuzzy self-organizing cooperative coevolution (FSC2) is then leveraged to resolve the three challenges in multi-target SOP: distributed self-organizing search (SOS), distributed task allocation, and distributed single-target pursuit. FSC2 includes a coordinated multi-agent deep reinforcement learning (MARL) method that enables homogeneous agents to learn natural SOS patterns. Additionall",
    "path": "papers/22/06/2206.12330.json",
    "total_tokens": 1272,
    "translated_title": "面向部分可观察马尔可夫博弈的多目标自主组织追捕",
    "translated_abstract": "多目标自主组织追捕（SOP）问题具有广泛应用，并被认为是分布式系统的具有挑战性的自组织游戏，在该游戏中，智能代理协作地追踪多个动态目标，其中又存在部分可观察。本文提出了一个分散多智能体系统的框架，以改善搜索和追逐中的隐式协调能力。我们将自组织系统建模为一个部分可观察马尔可夫博弈（POMG），该模型具有大规模性、去中心化、部分可观察和非通信等特点。随后，利用模糊自组织协作共同演化（FSC2）分布式算法来解决多目标SOP中的三大挑战：分布式自组织搜索（SOS）、分布式任务分配和分布式单目标追踪。FSC2包括一种协调的多智能体深度强化学习（MARL）方法，使同质智能体学习自然的SOS模式。此外，提出了一种基于模糊推理的分散式任务分配机制，以将搜索任务分配给代理。最后，提出了一种分布式单目标追踪策略，该策略结合了SOS和任务分配的结果，使得追踪目标更加有效率。实验结果表明，所提出的FSC2算法有效提高了多目标SOP任务的准确性和效率。",
    "tldr": "本文提出了一个基于部分可观察马尔可夫博弈（POMG）的多智能体自主组织追捕（SOP）框架，并使用模糊自组织协作共同演化（FSC2）分布式算法来解决SOP中的三大挑战：分布式自组织搜索（SOS）、分布式任务分配和分布式单目标追踪。实验结果表明，所提出的FSC2算法有效提高了多目标SOP任务的准确性和效率。",
    "en_tdlr": "This paper proposes a framework for multi-target self-organizing pursuit (SOP) based on partially observable Markov games (POMG), and uses fuzzy self-organizing cooperative coevolution (FSC2) distributed algorithm to solve the three challenges in SOP: distributed self-organizing search (SOS), distributed task allocation, and distributed single-target pursuit. The experimental results demonstrate the effectiveness of the proposed FSC2 algorithm in improving the accuracy and efficiency of multi-target SOP tasks."
}