{
    "title": "The Log Private Company Valuation Model. (arXiv:2206.09666v3 [q-fin.MF] UPDATED)",
    "abstract": "For a public company, the option pricing models, hedging models, and pricing and hedging models of equity--linked life insurance products have been developed. However, for a private company, because of unobserved prices, the option and the life insurance pricing, and the hedging are challenging tasks. For this reason, this paper introduces a log private company valuation model, which is based on the dynamic Gordon growth model. In this paper, we obtain closed-form option pricing formulas, hedging formulas, and net premium formulas of equity-linked life insurance products for a private company. Also, the paper provides ML estimators of our model, EM algorithm, and valuation formula for the private company. The suggested model can be used not only by private companies but also by public companies",
    "link": "http://arxiv.org/abs/2206.09666",
    "context": "Title: The Log Private Company Valuation Model. (arXiv:2206.09666v3 [q-fin.MF] UPDATED)\nAbstract: For a public company, the option pricing models, hedging models, and pricing and hedging models of equity--linked life insurance products have been developed. However, for a private company, because of unobserved prices, the option and the life insurance pricing, and the hedging are challenging tasks. For this reason, this paper introduces a log private company valuation model, which is based on the dynamic Gordon growth model. In this paper, we obtain closed-form option pricing formulas, hedging formulas, and net premium formulas of equity-linked life insurance products for a private company. Also, the paper provides ML estimators of our model, EM algorithm, and valuation formula for the private company. The suggested model can be used not only by private companies but also by public companies",
    "path": "papers/22/06/2206.09666.json",
    "total_tokens": 754,
    "translated_title": "对数私人公司估值模型",
    "translated_abstract": "针对私人公司由于价格不可观测而导致期权、寿险定价以及对冲等任务具有挑战性，本文介绍了一种基于动态戈登增长模型的对数私人公司估值模型。在本文中，我们得到了针对私人公司的闭合式期权定价公式、对冲公式以及权益连接寿险产品的净保费公式。此外，本文提供了我们模型的极大似然估计器、期望极大化算法和私人公司估值公式。该模型既可用于私人公司，也可用于公共公司。",
    "tldr": "本文提出了一种基于动态戈登增长模型的对数私人公司估值模型，其中包含闭合式期权定价公式、对冲公式以及权益连接寿险产品的净保费公式。该模型可用于私人公司和公共公司。",
    "en_tdlr": "This paper proposes a log private company valuation model based on the dynamic Gordon growth model, which includes closed-form option pricing formulas, hedging formulas, and net premium formulas for equity-linked life insurance products for private companies. The model is applicable not only to private companies but also to public companies."
}