{
    "title": "CARLANE: A Lane Detection Benchmark for Unsupervised Domain Adaptation from Simulation to multiple Real-World Domains. (arXiv:2206.08083v4 [cs.CV] UPDATED)",
    "abstract": "Unsupervised Domain Adaptation demonstrates great potential to mitigate domain shifts by transferring models from labeled source domains to unlabeled target domains. While Unsupervised Domain Adaptation has been applied to a wide variety of complex vision tasks, only few works focus on lane detection for autonomous driving. This can be attributed to the lack of publicly available datasets. To facilitate research in these directions, we propose CARLANE, a 3-way sim-to-real domain adaptation benchmark for 2D lane detection. CARLANE encompasses the single-target datasets MoLane and TuLane and the multi-target dataset MuLane. These datasets are built from three different domains, which cover diverse scenes and contain a total of 163K unique images, 118K of which are annotated. In addition we evaluate and report systematic baselines, including our own method, which builds upon Prototypical Cross-domain Self-supervised Learning. We find that false positive and false negative rates of the eva",
    "link": "http://arxiv.org/abs/2206.08083",
    "context": "Title: CARLANE: A Lane Detection Benchmark for Unsupervised Domain Adaptation from Simulation to multiple Real-World Domains. (arXiv:2206.08083v4 [cs.CV] UPDATED)\nAbstract: Unsupervised Domain Adaptation demonstrates great potential to mitigate domain shifts by transferring models from labeled source domains to unlabeled target domains. While Unsupervised Domain Adaptation has been applied to a wide variety of complex vision tasks, only few works focus on lane detection for autonomous driving. This can be attributed to the lack of publicly available datasets. To facilitate research in these directions, we propose CARLANE, a 3-way sim-to-real domain adaptation benchmark for 2D lane detection. CARLANE encompasses the single-target datasets MoLane and TuLane and the multi-target dataset MuLane. These datasets are built from three different domains, which cover diverse scenes and contain a total of 163K unique images, 118K of which are annotated. In addition we evaluate and report systematic baselines, including our own method, which builds upon Prototypical Cross-domain Self-supervised Learning. We find that false positive and false negative rates of the eva",
    "path": "papers/22/06/2206.08083.json",
    "total_tokens": 1016,
    "translated_title": "CARLANE: 从模拟到多个真实世界领域的无监督域适应的车道检测基准",
    "translated_abstract": "无监督域适应通过将模型从有标签的源领域转移到无标签的目标领域，展示了减轻域漂移的巨大潜力。虽然无监督域适应已经应用于各种复杂的视觉任务，但只有少数工作集中在自动驾驶的车道检测上。这可以归因于缺乏公开可用的数据集。为了促进在这些方向上的研究，我们提出了CARLANE，一个适用于2D车道检测的3向模拟到真实域适应基准。CARLANE包括单目标数据集MoLane和TuLane，以及多目标数据集MuLane。这些数据集来自于三个不同的领域，涵盖了多样的场景，共包含16.3万张独特的图片，其中有11.8万张有注释。此外，我们评估和报告了系统基准，包括我们自己的方法，该方法基于原型交叉域自监督学习。我们发现评估中的误报率和漏报率",
    "tldr": "本论文提出了一个适用于2D车道检测的无监督域适应基准- CARLANE，包括模拟到多个真实世界领域的三个不同数据集。该基准数据集涵盖了多样的场景，并包含大量有注释的图片。此外，研究还提出了系统基准，用以评估方法的性能。",
    "en_tdlr": "This paper proposes a benchmark for unsupervised domain adaptation in 2D lane detection - CARLANE, which includes three different datasets from simulation to multiple real-world domains. The benchmark datasets cover diverse scenes and contain a large number of annotated images. Additionally, the study presents systematic baselines for evaluating the performance of methods."
}