{
    "title": "Evaluating Self-Supervised Learning for Molecular Graph Embeddings. (arXiv:2206.08005v2 [cs.LG] UPDATED)",
    "abstract": "Graph Self-Supervised Learning (GSSL) provides a robust pathway for acquiring embeddings without expert labelling, a capability that carries profound implications for molecular graphs due to the staggering number of potential molecules and the high cost of obtaining labels. However, GSSL methods are designed not for optimisation within a specific domain but rather for transferability across a variety of downstream tasks. This broad applicability complicates their evaluation. Addressing this challenge, we present \"Molecular Graph Representation Evaluation\" (MOLGRAPHEVAL), generating detailed profiles of molecular graph embeddings with interpretable and diversified attributes. MOLGRAPHEVAL offers a suite of probing tasks grouped into three categories: (i) generic graph, (ii) molecular substructure, and (iii) embedding space properties. By leveraging MOLGRAPHEVAL to benchmark existing GSSL methods against both current downstream datasets and our suite of tasks, we uncover significant inco",
    "link": "http://arxiv.org/abs/2206.08005",
    "context": "Title: Evaluating Self-Supervised Learning for Molecular Graph Embeddings. (arXiv:2206.08005v2 [cs.LG] UPDATED)\nAbstract: Graph Self-Supervised Learning (GSSL) provides a robust pathway for acquiring embeddings without expert labelling, a capability that carries profound implications for molecular graphs due to the staggering number of potential molecules and the high cost of obtaining labels. However, GSSL methods are designed not for optimisation within a specific domain but rather for transferability across a variety of downstream tasks. This broad applicability complicates their evaluation. Addressing this challenge, we present \"Molecular Graph Representation Evaluation\" (MOLGRAPHEVAL), generating detailed profiles of molecular graph embeddings with interpretable and diversified attributes. MOLGRAPHEVAL offers a suite of probing tasks grouped into three categories: (i) generic graph, (ii) molecular substructure, and (iii) embedding space properties. By leveraging MOLGRAPHEVAL to benchmark existing GSSL methods against both current downstream datasets and our suite of tasks, we uncover significant inco",
    "path": "papers/22/06/2206.08005.json",
    "total_tokens": 933,
    "translated_title": "评估分子图嵌入的自监督学习",
    "translated_abstract": "图形自监督学习（GSSL）为获取嵌入提供了一个强大的途径，无需专家标注，这种能力对于分子图具有深刻的影响，因为潜在分子的数量惊人，并且获取标签的成本很高。然而，GSSL方法不是为了在特定领域内进行优化，而是为了在各种下游任务之间进行可转移性。这种广泛适用性使它们的评估变得复杂。为了解决这一挑战，我们提出了“分子图表示评估”（MOLGRAPHEVAL），生成具有可解释和多样化属性的分子图嵌入的详细剖析。MOLGRAPHEVAL提供了一组探测任务，分为三类：（i）通用图形，（ii）分子亚结构和（iii）嵌入空间属性。通过利用MOLGRAPHEVAL来基准化现有的GSSL方法，对比当前的下游数据集以及我们的任务套件，我们发现GSSL方法性能存在显著的不一致性，并为未来的研究提供了新的方向。",
    "tldr": "评估分子图嵌入的自监督学习方法的MOLGRAPHEVAL揭示了在不同的下游任务中GSSL方法性能存在显著的不一致性，并为未来研究提供了新的方向。",
    "en_tdlr": "MOLGRAPHEVAL, an evaluation tool for molecular graph embeddings, has unveiled significant inconsistencies in GSSL method performance across different downstream tasks, and identified new directions for future research."
}