{
    "title": "Discriminative and Generative Learning for Linear Estimation of Random Signals [Lecture Notes]. (arXiv:2206.04432v2 [eess.SP] UPDATED)",
    "abstract": "Inference tasks in signal processing are often characterized by the availability of reliable statistical modeling with some missing instance-specific parameters. One conventional approach uses data to estimate these missing parameters and then infers based on the estimated model. Alternatively, data can also be leveraged to directly learn the inference mapping end-to-end. These approaches for combining partially-known statistical models and data in inference are related to the notions of generative and discriminative models used in the machine learning literature, typically considered in the context of classifiers. The goal of this lecture note is to introduce the concepts of generative and discriminative learning for inference with a partially-known statistical model. While machine learning systems often lack the interpretability of traditional signal processing methods, we focus on a simple setting where one can interpret and compare the approaches in a tractable manner that is acces",
    "link": "http://arxiv.org/abs/2206.04432",
    "context": "Title: Discriminative and Generative Learning for Linear Estimation of Random Signals [Lecture Notes]. (arXiv:2206.04432v2 [eess.SP] UPDATED)\nAbstract: Inference tasks in signal processing are often characterized by the availability of reliable statistical modeling with some missing instance-specific parameters. One conventional approach uses data to estimate these missing parameters and then infers based on the estimated model. Alternatively, data can also be leveraged to directly learn the inference mapping end-to-end. These approaches for combining partially-known statistical models and data in inference are related to the notions of generative and discriminative models used in the machine learning literature, typically considered in the context of classifiers. The goal of this lecture note is to introduce the concepts of generative and discriminative learning for inference with a partially-known statistical model. While machine learning systems often lack the interpretability of traditional signal processing methods, we focus on a simple setting where one can interpret and compare the approaches in a tractable manner that is acces",
    "path": "papers/22/06/2206.04432.json",
    "total_tokens": 818,
    "translated_title": "线性估计随机信号的判别学习和生成学习[Lecture Notes]",
    "translated_abstract": "信号处理中的推断任务通常由可靠的统计建模和一些缺失的实例特定参数构成。一种传统的方法是使用数据来估计这些缺失的参数，然后基于估计模型进行推断。或者，数据也可以被利用来直接学习端到端的推断映射。这些将部分已知的统计模型和数据结合起来进行推断的方法与机器学习文献中使用的生成模型和判别模型的概念相关，通常在分类器的上下文中考虑。本讲座的目标是介绍部分已知的统计模型推断中的生成学习和判别学习概念。虽然机器学习系统常常缺乏传统信号处理方法的可解释性，但我们专注于一个简单的设置，可以以可处理的方式解释和比较这些方法。",
    "tldr": "本论文介绍使用数据来直接学习信号处理推断映射的方法，包括生成学习和判别学习。这些方法将可靠的统计建模和数据结合起来进行推断。",
    "en_tdlr": "This paper introduces the methods of learning signal processing inference mapping directly from data, including generative and discriminative learning. These methods combine reliable statistical modeling with data for inference."
}