{
    "title": "Comparative statics with adjustment costs and the le Chatelier principle",
    "abstract": "arXiv:2206.00347v3 Announce Type: replace  Abstract: We develop a theory of monotone comparative statics for models with adjustment costs. We show that comparative-statics conclusions may be drawn under the usual ordinal complementarity assumptions on the objective function, assuming very little about costs: only a mild monotonicity condition is required. We use this insight to prove a general le Chatelier principle: under the ordinal complementarity assumptions, if short-run adjustment is subject to a monotone cost, then the long-run response to a shock is greater than the short-run response. We extend these results to a fully dynamic model of adjustment over time: the le Chatelier principle remains valid, and under slightly stronger assumptions, optimal adjustment follows a monotone path. We apply our results to models of saving, production, pricing, labor supply and investment.",
    "link": "https://arxiv.org/abs/2206.00347",
    "context": "Title: Comparative statics with adjustment costs and the le Chatelier principle\nAbstract: arXiv:2206.00347v3 Announce Type: replace  Abstract: We develop a theory of monotone comparative statics for models with adjustment costs. We show that comparative-statics conclusions may be drawn under the usual ordinal complementarity assumptions on the objective function, assuming very little about costs: only a mild monotonicity condition is required. We use this insight to prove a general le Chatelier principle: under the ordinal complementarity assumptions, if short-run adjustment is subject to a monotone cost, then the long-run response to a shock is greater than the short-run response. We extend these results to a fully dynamic model of adjustment over time: the le Chatelier principle remains valid, and under slightly stronger assumptions, optimal adjustment follows a monotone path. We apply our results to models of saving, production, pricing, labor supply and investment.",
    "path": "papers/22/06/2206.00347.json",
    "total_tokens": 843,
    "translated_title": "带调整成本和勒夏特列原理的比较静态分析",
    "translated_abstract": "我们发展了一个关于带有调整成本模型的单调比较静态分析理论。我们表明，在对目标函数的通常序补完性假设下，可以得出比较静态的结论，只需要对成本做出很少的假设：只需要一个温和的单调性条件。我们利用这一见解来证明一个一般的勒夏特列原理：在序补完性假设下，如果短期调整受到单调成本的影响，那么对冲击的长期响应将大于短期响应。我们将这些结果扩展到一个完全动态的随时间调整模型：勒夏特列原理仍然成立，并且在更强的假设下，最优调整遵循单调路径。我们将我们的结果应用于储蓄、生产、定价、劳动供给和投资模型。",
    "tldr": "基于单调比较静态分析，证明了勒夏特列原理，即在序补完性假设下，如果短期调整受到单调成本影响，则长期对冲击的响应大于短期响应。",
    "en_tdlr": "The paper develops a theory of monotone comparative statics for models with adjustment costs, showing a general le Chatelier principle: under ordinal complementarity assumptions, the long-run response to a shock is greater than the short-run response if short-run adjustment is subject to a monotone cost."
}