{
    "title": "Talent Hoarding in Organizations",
    "abstract": "arXiv:2206.15098v2 Announce Type: replace  Abstract: Most organizations rely on managers to identify talented workers. However, managers who are evaluated on team performance have an incentive to hoard workers. This study provides the first empirical evidence of talent hoarding using personnel records and survey evidence from a large manufacturing firm. Talent hoarding is reported by three-fourths of managers, is detectable in managerial decisions, and occurs more frequently when hoarding incentives are stronger. Using quasi-random variation in exposure to talent hoarding, I demonstrate that hoarding deters workers from applying to new positions, inhibiting worker career progression and altering the allocation of talent in the firm.",
    "link": "https://arxiv.org/abs/2206.15098",
    "context": "Title: Talent Hoarding in Organizations\nAbstract: arXiv:2206.15098v2 Announce Type: replace  Abstract: Most organizations rely on managers to identify talented workers. However, managers who are evaluated on team performance have an incentive to hoard workers. This study provides the first empirical evidence of talent hoarding using personnel records and survey evidence from a large manufacturing firm. Talent hoarding is reported by three-fourths of managers, is detectable in managerial decisions, and occurs more frequently when hoarding incentives are stronger. Using quasi-random variation in exposure to talent hoarding, I demonstrate that hoarding deters workers from applying to new positions, inhibiting worker career progression and altering the allocation of talent in the firm.",
    "path": "papers/22/06/2206.15098.json",
    "total_tokens": 754,
    "translated_title": "组织中的人才囤积",
    "translated_abstract": "大多数组织依赖经理来识别有才华的员工。然而，那些以团队表现为评估标准的经理有囤积员工的动机。这项研究首次提供了使用人事记录和来自一家大型制造公司的调查证据的人才囤积的经验性证据。三分之四的经理报告存在人才囤积现象，这种现象可在经理决策中检测到，并且在囤积动机更强时更频繁发生。通过对人才囤积程度的准随机暴露变化，我证明囤积会阻止员工申请新职位，抑制员工职业发展，并改变公司人才的配置。",
    "tldr": "这项研究提供了首次关于人才囤积的经验性证据，显示大多数经理在团队绩效评估中存在囤积员工的动机，而这种囤积行为会阻止员工职业发展并改变公司内部人才的配置。",
    "en_tdlr": "This study provides the first empirical evidence of talent hoarding in organizations, showing that most managers have an incentive to hoard workers based on team performance evaluations, which hinders worker career progression and alters the allocation of talent within the firm."
}