{
    "title": "ORC: Network Group-based Knowledge Distillation using Online Role Change. (arXiv:2206.01186v2 [cs.LG] UPDATED)",
    "abstract": "In knowledge distillation, since a single, omnipotent teacher network cannot solve all problems, multiple teacher-based knowledge distillations have been studied recently. However, sometimes their improvements are not as good as expected because some immature teachers may transfer the false knowledge to the student. In this paper, to overcome this limitation and take the efficacy of the multiple networks, we divide the multiple networks into teacher and student groups, respectively. That is, the student group is a set of immature networks that require learning the teacher's knowledge, while the teacher group consists of the selected networks that are capable of teaching successfully. We propose our online role change strategy where the top-ranked networks in the student group are able to promote to the teacher group at every iteration. After training the teacher group using the error samples of the student group to refine the teacher group's knowledge, we transfer the collaborative kno",
    "link": "http://arxiv.org/abs/2206.01186",
    "context": "Title: ORC: Network Group-based Knowledge Distillation using Online Role Change. (arXiv:2206.01186v2 [cs.LG] UPDATED)\nAbstract: In knowledge distillation, since a single, omnipotent teacher network cannot solve all problems, multiple teacher-based knowledge distillations have been studied recently. However, sometimes their improvements are not as good as expected because some immature teachers may transfer the false knowledge to the student. In this paper, to overcome this limitation and take the efficacy of the multiple networks, we divide the multiple networks into teacher and student groups, respectively. That is, the student group is a set of immature networks that require learning the teacher's knowledge, while the teacher group consists of the selected networks that are capable of teaching successfully. We propose our online role change strategy where the top-ranked networks in the student group are able to promote to the teacher group at every iteration. After training the teacher group using the error samples of the student group to refine the teacher group's knowledge, we transfer the collaborative kno",
    "path": "papers/22/06/2206.01186.json",
    "total_tokens": 937,
    "translated_title": "ORC: 利用在线角色变换的网络群组知识蒸馏",
    "translated_abstract": "在知识蒸馏中，由于单一的全能教师网络无法解决所有问题，最近研究了基于多个教师的知识蒸馏。然而，有时它们的改进效果并不如预期，因为一些不成熟的教师可能会将错误的知识传输给学生。为了克服这个限制并利用多个网络的能力，本文将多个网络分成教师组和学生组。学生组由需要学习教师知识的不成熟网络组成，而教师组则由能够成功教授的选中网络组成。我们提出了在线角色变换策略，在每次迭代中将学生组中排名靠前的网络晋升为教师组。通过使用学生组的错误样本训练教师组以改进其知识，我们转移协作知识。",
    "tldr": "本文提出了一种利用在线角色变换的网络群组知识蒸馏方法，通过将多个网络分成教师组和学生组，学生组学习教师的知识，使用在线角色变换策略将学生组中排名靠前的网络晋升为教师组，通过训练教师组以改进其知识，实现了更好的知识蒸馏效果。",
    "en_tdlr": "This paper proposes a network group-based knowledge distillation method using online role change. By dividing multiple networks into teacher and student groups, the student group learns the teacher's knowledge, and the top-ranked networks in the student group are promoted to the teacher group using the online role change strategy. Through training the teacher group to refine its knowledge, better knowledge distillation results are achieved."
}