{
    "title": "Accurate Node Feature Estimation with Structured Variational Graph Autoencoder. (arXiv:2206.04516v2 [cs.LG] UPDATED)",
    "abstract": "Given a graph with partial observations of node features, how can we estimate the missing features accurately? Feature estimation is a crucial problem for analyzing real-world graphs whose features are commonly missing during the data collection process. Accurate estimation not only provides diverse information of nodes but also supports the inference of graph neural networks that require the full observation of node features. However, designing an effective approach for estimating high-dimensional features is challenging, since it requires an estimator to have large representation power, increasing the risk of overfitting. In this work, we propose SVGA (Structured Variational Graph Autoencoder), an accurate method for feature estimation. SVGA applies strong regularization to the distribution of latent variables by structured variational inference, which models the prior of variables as Gaussian Markov random field based on the graph structure. As a result, SVGA combines the advantages",
    "link": "http://arxiv.org/abs/2206.04516",
    "context": "Title: Accurate Node Feature Estimation with Structured Variational Graph Autoencoder. (arXiv:2206.04516v2 [cs.LG] UPDATED)\nAbstract: Given a graph with partial observations of node features, how can we estimate the missing features accurately? Feature estimation is a crucial problem for analyzing real-world graphs whose features are commonly missing during the data collection process. Accurate estimation not only provides diverse information of nodes but also supports the inference of graph neural networks that require the full observation of node features. However, designing an effective approach for estimating high-dimensional features is challenging, since it requires an estimator to have large representation power, increasing the risk of overfitting. In this work, we propose SVGA (Structured Variational Graph Autoencoder), an accurate method for feature estimation. SVGA applies strong regularization to the distribution of latent variables by structured variational inference, which models the prior of variables as Gaussian Markov random field based on the graph structure. As a result, SVGA combines the advantages",
    "path": "papers/22/06/2206.04516.json",
    "total_tokens": 911,
    "translated_title": "基于结构化变分图自编码器的准确节点特征估计",
    "translated_abstract": "给定一个包含节点特征部分观测的图，如何精确地估计缺失的特征？特征估计对于分析实际图形是至关重要的，因为在数据收集过程中，这些特征通常会缺失。准确的估计不仅提供节点的多样信息，而且支持需要完整观测节点特征的图神经网络的推理。然而，设计一种有效的方法来估计高维特征是具有挑战性的，因为它需要估计器具有大的表现力，增加了过拟合的风险。在本文中，我们提出了一种准确的特征估计方法SVGA（Structured Variational Graph Autoencoder）。SVGA通过结构化变分推断对潜变量的分布进行强大的正则化，该推断基于图形结构将变量的先验模型建模为高斯马尔科夫随机场。因此，SVGA结合了变分推断和图神经网络的优点，可以在有限的数据情况下提供准确的估计。",
    "tldr": "本论文提出了一种基于结构化变分图自编码器的准确节点特征估计方法，结合了变分推断和图神经网络的优点，可以在有限的数据情况下提供准确的估计。",
    "en_tdlr": "This paper proposes an accurate method for node feature estimation using Structured Variational Graph Autoencoder (SVGA), which combines the advantages of variational inference and graph neural networks, providing accurate estimates with limited data."
}