{
    "title": "Discriminative Models Can Still Outperform Generative Models in Aspect Based Sentiment Analysis. (arXiv:2206.02892v2 [cs.CL] UPDATED)",
    "abstract": "Aspect-based Sentiment Analysis (ABSA) helps to explain customers' opinions towards products and services. In the past, ABSA models were discriminative, but more recently generative models have been used to generate aspects and polarities directly from text. In contrast, discriminative models commonly first select aspects from the text, and then classify the aspect's polarity. Previous results showed that generative models outperform discriminative models on several English ABSA datasets. Here, we evaluate and contrast two state-of-the-art discriminative and generative models in several settings: cross-lingual, cross-domain, and cross-lingual and domain, to understand generalizability in settings other than English mono-lingual in-domain. Our more thorough evaluation shows that, contrary to previous studies, discriminative models can still outperform generative models in almost all settings.",
    "link": "http://arxiv.org/abs/2206.02892",
    "context": "Title: Discriminative Models Can Still Outperform Generative Models in Aspect Based Sentiment Analysis. (arXiv:2206.02892v2 [cs.CL] UPDATED)\nAbstract: Aspect-based Sentiment Analysis (ABSA) helps to explain customers' opinions towards products and services. In the past, ABSA models were discriminative, but more recently generative models have been used to generate aspects and polarities directly from text. In contrast, discriminative models commonly first select aspects from the text, and then classify the aspect's polarity. Previous results showed that generative models outperform discriminative models on several English ABSA datasets. Here, we evaluate and contrast two state-of-the-art discriminative and generative models in several settings: cross-lingual, cross-domain, and cross-lingual and domain, to understand generalizability in settings other than English mono-lingual in-domain. Our more thorough evaluation shows that, contrary to previous studies, discriminative models can still outperform generative models in almost all settings.",
    "path": "papers/22/06/2206.02892.json",
    "total_tokens": 816,
    "translated_title": "判别模型在基于方面的情感分析中仍然优于生成模型",
    "translated_abstract": "基于方面的情感分析（ABSA）有助于解释用户对产品和服务的意见。过去，ABSA模型是判别性的，但最近生成模型已被用于直接从文本中生成方面和极性。相反，判别模型通常首先从文本中选择方面，然后对方面的极性进行分类。以前的结果表明，在几个英语ABSA数据集上，生成模型胜过判别模型。在这里，我们在几个设置中评估和对比两种最先进的判别和生成模型：跨语言、跨领域和跨语言和领域，以了解除了英语单一领域之外的设置中的泛化能力。我们更全面的评估结果表明，与以前的研究相反，在几乎所有的设置中，判别模型仍然可以优于生成模型。",
    "tldr": "本文评估了判别模型和生成模型在基于方面的情感分析中的表现，发现判别模型在几乎所有设置中仍然可以优于生成模型。",
    "en_tdlr": "This paper evaluates and compares the performance of discriminative models and generative models in aspect-based sentiment analysis, and finds that discriminative models can still outperform generative models in almost all settings."
}