{
    "title": "A Machine Learning Data Fusion Model for Soil Moisture Retrieval. (arXiv:2206.09649v3 [physics.ao-ph] UPDATED)",
    "abstract": "We develop a deep learning based convolutional-regression model that estimates the volumetric soil moisture content in the top ~5 cm of soil. Input predictors include Sentinel-1 (active radar), Sentinel-2 (optical imagery), and SMAP (passive radar) as well as geophysical variables from SoilGrids and modelled soil moisture fields from GLDAS. The model was trained and evaluated on data from ~1300 in-situ sensors globally over the period 2015 - 2021 and obtained an average per-sensor correlation of 0.727 and ubRMSE of 0.054, and can be used to produce a soil moisture map at a nominal 320m resolution. These results are benchmarked against 13 other soil moisture works at different locations, and an ablation study was used to identify important predictors.",
    "link": "http://arxiv.org/abs/2206.09649",
    "context": "Title: A Machine Learning Data Fusion Model for Soil Moisture Retrieval. (arXiv:2206.09649v3 [physics.ao-ph] UPDATED)\nAbstract: We develop a deep learning based convolutional-regression model that estimates the volumetric soil moisture content in the top ~5 cm of soil. Input predictors include Sentinel-1 (active radar), Sentinel-2 (optical imagery), and SMAP (passive radar) as well as geophysical variables from SoilGrids and modelled soil moisture fields from GLDAS. The model was trained and evaluated on data from ~1300 in-situ sensors globally over the period 2015 - 2021 and obtained an average per-sensor correlation of 0.727 and ubRMSE of 0.054, and can be used to produce a soil moisture map at a nominal 320m resolution. These results are benchmarked against 13 other soil moisture works at different locations, and an ablation study was used to identify important predictors.",
    "path": "papers/22/06/2206.09649.json",
    "total_tokens": 896,
    "translated_title": "一种用于土壤湿度获取的机器学习数据融合模型",
    "translated_abstract": "我们开发了一种基于深度学习的卷积回归模型，用于估算土壤顶部约5厘米处的体积土壤湿度含量。输入预测因子包括Sentinel-1（主动雷达）、Sentinel-2（光学图像）和SMAP（被动雷达），以及来自SoilGrids的地球物理变量和来自GLDAS的模拟土壤湿度场。该模型在全球范围内的约1300个原地传感器数据上进行了训练和评估，得到了平均每个传感器相关系数为0.727和ubRMSE为0.054的结果，并可用于生成320m分辨率的土壤湿度图。这些结果与其他13个地点的土壤湿度研究进行了基准测试，并使用消减研究来确定重要的预测因子。",
    "tldr": "本研究开发了一种深度学习模型，利用多种传感器数据和地球物理变量，可以准确估算土壤顶部的体积湿度含量。该模型在全球范围内的1300个传感器数据上进行训练和评估，表现出较高的相关性和较小的误差，并可用于生成高分辨率的土壤湿度图。",
    "en_tdlr": "This study develops a deep learning model that accurately estimates the volumetric soil moisture content using multiple sensor data and geophysical variables. The model achieves high correlation and low error on a global dataset and can be used to generate high-resolution soil moisture maps."
}