{
    "title": "ReuseKNN: Neighborhood Reuse for Differentially-Private KNN-Based Recommendations. (arXiv:2206.11561v3 [cs.IR] UPDATED)",
    "abstract": "User-based KNN recommender systems (UserKNN) utilize the rating data of a target user's k nearest neighbors in the recommendation process. This, however, increases the privacy risk of the neighbors since their rating data might be exposed to other users or malicious parties. To reduce this risk, existing work applies differential privacy by adding randomness to the neighbors' ratings, which reduces the accuracy of UserKNN. In this work, we introduce ReuseKNN, a novel differentially-private KNN-based recommender system. The main idea is to identify small but highly reusable neighborhoods so that (i) only a minimal set of users requires protection with differential privacy, and (ii) most users do not need to be protected with differential privacy, since they are only rarely exploited as neighbors. In our experiments on five diverse datasets, we make two key observations: Firstly, ReuseKNN requires significantly smaller neighborhoods, and thus, fewer neighbors need to be protected with di",
    "link": "http://arxiv.org/abs/2206.11561",
    "context": "Title: ReuseKNN: Neighborhood Reuse for Differentially-Private KNN-Based Recommendations. (arXiv:2206.11561v3 [cs.IR] UPDATED)\nAbstract: User-based KNN recommender systems (UserKNN) utilize the rating data of a target user's k nearest neighbors in the recommendation process. This, however, increases the privacy risk of the neighbors since their rating data might be exposed to other users or malicious parties. To reduce this risk, existing work applies differential privacy by adding randomness to the neighbors' ratings, which reduces the accuracy of UserKNN. In this work, we introduce ReuseKNN, a novel differentially-private KNN-based recommender system. The main idea is to identify small but highly reusable neighborhoods so that (i) only a minimal set of users requires protection with differential privacy, and (ii) most users do not need to be protected with differential privacy, since they are only rarely exploited as neighbors. In our experiments on five diverse datasets, we make two key observations: Firstly, ReuseKNN requires significantly smaller neighborhoods, and thus, fewer neighbors need to be protected with di",
    "path": "papers/22/06/2206.11561.json",
    "total_tokens": 965,
    "translated_title": "ReuseKNN: 面向差分隐私的KNN推荐的邻域重用",
    "translated_abstract": "基于用户的KNN推荐系统（UserKNN）在推荐过程中利用目标用户的k个最近邻居的评分数据。然而，这增加了邻居的隐私风险，因为他们的评分数据可能被其他用户或恶意方暴露。为了减小这个风险，现有的工作通过向邻居的评分添加随机性来应用差分隐私，但这会降低UserKNN的准确性。在这项工作中，我们介绍了ReuseKNN，一种新颖的面向差分隐私的KNN推荐系统。主要思想是识别出小但高度可重用的邻域，以便(i)只有一小部分用户需要使用差分隐私进行保护，(ii)大部分用户不需要使用差分隐私进行保护，因为它们很少被利用作为邻居。在我们对五个不同数据集的实验中，我们得出了两个关键观察结果:首先，ReuseKNN需要较小的邻域，因此需要保护的邻居较少。",
    "tldr": "ReuseKNN是一种面向差分隐私的KNN推荐系统，通过识别小但高度可重用的邻域来减少差分隐私的使用，减小了隐私泄露的风险，并且需要保护的邻居较少，从而提高了推荐的准确性。",
    "en_tdlr": "ReuseKNN is a differential privacy KNN-based recommender system that reduces the use of differential privacy by identifying small but highly reusable neighborhoods, thus decreasing the privacy risk while improving the recommendation accuracy with fewer neighbors needing protection."
}