{
    "title": "A Survey on Modern Recommendation System based on Big Data. (arXiv:2206.02631v2 [cs.IR] UPDATED)",
    "abstract": "This survey provides an exhaustive exploration of the evolution and current state of recommendation systems, which have seen widespread integration in various web applications. It focuses on the advancement of personalized recommendation strategies for online products or services. We categorize recommendation techniques into four primary types: content-based, collaborative filtering-based, knowledge-based, and hybrid-based, each addressing unique scenarios. The survey offers a detailed examination of the historical context and the latest innovative approaches in recommendation systems, particularly those employing big data. Additionally, it identifies and discusses key challenges faced by modern recommendation systems, such as data sparsity, scalability issues, and the need for diversity in recommendations. The survey concludes by highlighting these challenges as potential areas for fruitful future research in the field.",
    "link": "http://arxiv.org/abs/2206.02631",
    "context": "Title: A Survey on Modern Recommendation System based on Big Data. (arXiv:2206.02631v2 [cs.IR] UPDATED)\nAbstract: This survey provides an exhaustive exploration of the evolution and current state of recommendation systems, which have seen widespread integration in various web applications. It focuses on the advancement of personalized recommendation strategies for online products or services. We categorize recommendation techniques into four primary types: content-based, collaborative filtering-based, knowledge-based, and hybrid-based, each addressing unique scenarios. The survey offers a detailed examination of the historical context and the latest innovative approaches in recommendation systems, particularly those employing big data. Additionally, it identifies and discusses key challenges faced by modern recommendation systems, such as data sparsity, scalability issues, and the need for diversity in recommendations. The survey concludes by highlighting these challenges as potential areas for fruitful future research in the field.",
    "path": "papers/22/06/2206.02631.json",
    "total_tokens": 784,
    "translated_title": "基于大数据的现代推荐系统综述",
    "translated_abstract": "本综述全面探索了推荐系统的发展和当前状态，这些系统已广泛整合到各种网络应用中。它重点关注个性化推荐策略在在线产品或服务中的进展。我们将推荐技术分为四种主要类型：基于内容的、协同过滤的、基于知识的和混合的，每种类型都解决了独特的情景。本综述详细审视了推荐系统的历史背景和最新的创新方法，特别是那些使用大数据的方法。此外，本综述还确定并讨论了现代推荐系统面临的关键挑战，如数据稀疏性、可扩展性问题以及对推荐的多样性需求。综述最后强调了这些挑战作为未来研究的潜在领域。",
    "tldr": "这份综述全面调研了基于大数据的现代推荐系统的发展和挑战，总结了四种主要类型的推荐技术，并指出了未来研究的潜在领域。",
    "en_tdlr": "This survey provides a comprehensive exploration of the development and challenges of modern recommendation systems based on big data, categorizing them into four main types and identifying potential areas for future research."
}