{
    "title": "3D Object Detection for Autonomous Driving: A Comprehensive Survey. (arXiv:2206.09474v2 [cs.CV] UPDATED)",
    "abstract": "Autonomous driving, in recent years, has been receiving increasing attention for its potential to relieve drivers' burdens and improve the safety of driving. In modern autonomous driving pipelines, the perception system is an indispensable component, aiming to accurately estimate the status of surrounding environments and provide reliable observations for prediction and planning. 3D object detection, which intelligently predicts the locations, sizes, and categories of the critical 3D objects near an autonomous vehicle, is an important part of a perception system. This paper reviews the advances in 3D object detection for autonomous driving. First, we introduce the background of 3D object detection and discuss the challenges in this task. Second, we conduct a comprehensive survey of the progress in 3D object detection from the aspects of models and sensory inputs, including LiDAR-based, camera-based, and multi-modal detection approaches. We also provide an in-depth analysis of the poten",
    "link": "http://arxiv.org/abs/2206.09474",
    "context": "Title: 3D Object Detection for Autonomous Driving: A Comprehensive Survey. (arXiv:2206.09474v2 [cs.CV] UPDATED)\nAbstract: Autonomous driving, in recent years, has been receiving increasing attention for its potential to relieve drivers' burdens and improve the safety of driving. In modern autonomous driving pipelines, the perception system is an indispensable component, aiming to accurately estimate the status of surrounding environments and provide reliable observations for prediction and planning. 3D object detection, which intelligently predicts the locations, sizes, and categories of the critical 3D objects near an autonomous vehicle, is an important part of a perception system. This paper reviews the advances in 3D object detection for autonomous driving. First, we introduce the background of 3D object detection and discuss the challenges in this task. Second, we conduct a comprehensive survey of the progress in 3D object detection from the aspects of models and sensory inputs, including LiDAR-based, camera-based, and multi-modal detection approaches. We also provide an in-depth analysis of the poten",
    "path": "papers/22/06/2206.09474.json",
    "total_tokens": 901,
    "translated_title": "自动驾驶中的3D物体检测：综述",
    "translated_abstract": "近年来，自动驾驶因其减轻驾驶员负担和提高驾驶安全的潜力而受到越来越多的关注。在现代自动驾驶管道中，感知系统是不可或缺的组成部分，旨在准确估计周围环境的状态，并为预测和规划提供可靠的观察。3D物体检测智能地预测自动驾驶车辆附近关键3D物体的位置、大小和类别，是感知系统的重要组成部分。本文回顾了自动驾驶中的3D物体检测进展。首先，我们介绍了3D物体检测的背景，并讨论了该任务面临的挑战。其次，我们从模型和感知输入的方面全面调查了3D物体检测的进展，包括基于LiDAR、基于相机和多模态检测方法。我们还对3D检测方法的潜在应用进行了深入分析。",
    "tldr": "本文综述了自动驾驶中3D物体检测的进展，讨论了该任务所面临的挑战，全面调查了3D物体检测的进展及其潜在应用。",
    "en_tdlr": "This paper provides a comprehensive survey on the advances in 3D object detection for autonomous driving, discussing the challenges and conducting a thorough investigation of the progress in terms of models and sensory inputs including LiDAR-based, camera-based, and multi-modal detection approaches. An in-depth analysis of potential applications is also provided."
}