{
    "title": "Memory-Oriented Design-Space Exploration of Edge-AI Hardware for XR Applications. (arXiv:2206.06780v3 [cs.AR] UPDATED)",
    "abstract": "Low-Power Edge-AI capabilities are essential for on-device extended reality (XR) applications to support the vision of Metaverse. In this work, we investigate two representative XR workloads: (i) Hand detection and (ii) Eye segmentation, for hardware design space exploration. For both applications, we train deep neural networks and analyze the impact of quantization and hardware specific bottlenecks. Through simulations, we evaluate a CPU and two systolic inference accelerator implementations. Next, we compare these hardware solutions with advanced technology nodes. The impact of integrating state-of-the-art emerging non-volatile memory technology (STT/SOT/VGSOT MRAM) into the XR-AI inference pipeline is evaluated. We found that significant energy benefits (>=24%) can be achieved for hand detection (IPS=10) and eye segmentation (IPS=0.1) by introducing non-volatile memory in the memory hierarchy for designs at 7nm node while meeting minimum IPS (inference per second). Moreover, we can ",
    "link": "http://arxiv.org/abs/2206.06780",
    "context": "Title: Memory-Oriented Design-Space Exploration of Edge-AI Hardware for XR Applications. (arXiv:2206.06780v3 [cs.AR] UPDATED)\nAbstract: Low-Power Edge-AI capabilities are essential for on-device extended reality (XR) applications to support the vision of Metaverse. In this work, we investigate two representative XR workloads: (i) Hand detection and (ii) Eye segmentation, for hardware design space exploration. For both applications, we train deep neural networks and analyze the impact of quantization and hardware specific bottlenecks. Through simulations, we evaluate a CPU and two systolic inference accelerator implementations. Next, we compare these hardware solutions with advanced technology nodes. The impact of integrating state-of-the-art emerging non-volatile memory technology (STT/SOT/VGSOT MRAM) into the XR-AI inference pipeline is evaluated. We found that significant energy benefits (>=24%) can be achieved for hand detection (IPS=10) and eye segmentation (IPS=0.1) by introducing non-volatile memory in the memory hierarchy for designs at 7nm node while meeting minimum IPS (inference per second). Moreover, we can ",
    "path": "papers/22/06/2206.06780.json",
    "total_tokens": 1094,
    "translated_title": "面向XR应用的边缘AI硬件记忆导向设计空间探索",
    "translated_abstract": "低功耗的边缘AI能力对于支持“元宇宙”愿景的设备上的扩展现实（XR）应用至关重要。本文研究了两种典型的XR工作负载：（i）手部检测和（ii）眼睛分割，并进行了硬件设计空间探索。对于这两个应用，我们训练深度神经网络，并分析了量化和硬件特定瓶颈的影响。通过模拟，我们评估了一个CPU和两个系统推理加速器实现。接下来，我们将这些硬件解决方案与先进的技术节点进行比较。评估了将最先进的新型非易失性内存技术（STT / SOT / VGSOT MRAM）集成到XR-AI推理管道中的影响。我们发现，在7纳米节点的设计中引入非易失性内存到内存层次结构中可以实现显着的能源效益（>=24％）以支持手部检测（IPS = 10）和眼睛分割（IPS = 0.1），同时满足最小IPS（每秒推理次数）。此外，与仅使用SRAM的设计相比，我们几乎可以减少90％的内存流量。我们的工作为基于内存的边缘AI设计的XR应用提供了深入的见解，并确定了新兴非易失性内存技术的潜力。",
    "tldr": "本文研究了面向XR应用的边缘AI硬件设计空间。通过引入新型非易失性内存技术，在满足最低IPS的同时显著提高了能效，可减少90%的内存流量。",
    "en_tdlr": "This paper investigates the hardware design space exploration of low-power edge-AI for XR applications, focusing on hand detection and eye segmentation. The integration of emerging non-volatile memory technology into the memory hierarchy was evaluated to improve energy efficiency and reduce memory traffic by almost 90%."
}