{
    "title": "Competence-based Multimodal Curriculum Learning for Medical Report Generation. (arXiv:2206.14579v3 [cs.CL] UPDATED)",
    "abstract": "Medical report generation task, which targets to produce long and coherent descriptions of medical images, has attracted growing research interests recently. Different from the general image captioning tasks, medical report generation is more challenging for data-driven neural models. This is mainly due to 1) the serious data bias and 2) the limited medical data. To alleviate the data bias and make best use of available data, we propose a Competence-based Multimodal Curriculum Learning framework (CMCL). Specifically, CMCL simulates the learning process of radiologists and optimizes the model in a step by step manner. Firstly, CMCL estimates the difficulty of each training instance and evaluates the competence of current model; Secondly, CMCL selects the most suitable batch of training instances considering current model competence. By iterating above two steps, CMCL can gradually improve the model's performance. The experiments on the public IU-Xray and MIMIC-CXR datasets show that CMC",
    "link": "http://arxiv.org/abs/2206.14579",
    "context": "Title: Competence-based Multimodal Curriculum Learning for Medical Report Generation. (arXiv:2206.14579v3 [cs.CL] UPDATED)\nAbstract: Medical report generation task, which targets to produce long and coherent descriptions of medical images, has attracted growing research interests recently. Different from the general image captioning tasks, medical report generation is more challenging for data-driven neural models. This is mainly due to 1) the serious data bias and 2) the limited medical data. To alleviate the data bias and make best use of available data, we propose a Competence-based Multimodal Curriculum Learning framework (CMCL). Specifically, CMCL simulates the learning process of radiologists and optimizes the model in a step by step manner. Firstly, CMCL estimates the difficulty of each training instance and evaluates the competence of current model; Secondly, CMCL selects the most suitable batch of training instances considering current model competence. By iterating above two steps, CMCL can gradually improve the model's performance. The experiments on the public IU-Xray and MIMIC-CXR datasets show that CMC",
    "path": "papers/22/06/2206.14579.json",
    "total_tokens": 974,
    "translated_title": "基于能力的多模态课程学习用于医学报告生成",
    "translated_abstract": "近年来，医学报告生成任务吸引了越来越多的研究关注，其目标是生成医学图像的连贯描述。与一般的图像字幕任务不同，医学报告生成对数据驱动的神经模型更具挑战性。主要原因是 1) 严重的数据偏差和 2) 有限的医学数据。为了减轻数据偏差并充分利用可用数据，我们提出了基于能力的多模态课程学习框架（CMCL）。具体来说，CMCL 模拟了放射学家的学习过程，并逐步优化模型。首先，CMCL 估计每个训练实例的难度并评估当前模型的能力; 其次，CMCL 选择最适合的训练实例组合以考虑当前模型的能力。通过迭代上述两个步骤，CMCL 可以逐渐提高模型的性能。在公共的IU-Xray和MIMIC-CXR数据集上的实验表明，CMCL 可以有效地提高医学报告生成的性能，并胜过几种最先进的方法。",
    "tldr": "本论文提出了一个基于能力的多模态课程学习框架（CMCL），通过模拟放射学家的学习过程来逐步优化医学报告生成模型，在公共数据集上实验表明CMCL可以有效地提高模型性能。",
    "en_tdlr": "This paper proposes a Competence-based Multimodal Curriculum Learning framework (CMCL) to improve the performance of medical report generation by simulating the learning process of radiologists, and outperforms several state-of-the-art methods on public datasets."
}