{
    "title": "Deep Isolation Forest for Anomaly Detection. (arXiv:2206.06602v3 [cs.LG] UPDATED)",
    "abstract": "Isolation forest (iForest) has been emerging as arguably the most popular anomaly detector in recent years due to its general effectiveness across different benchmarks and strong scalability. Nevertheless, its linear axis-parallel isolation method often leads to (i) failure in detecting hard anomalies that are difficult to isolate in high-dimensional/non-linear-separable data space, and (ii) notorious algorithmic bias that assigns unexpectedly lower anomaly scores to artefact regions. These issues contribute to high false negative errors. Several iForest extensions are introduced, but they essentially still employ shallow, linear data partition, restricting their power in isolating true anomalies. Therefore, this paper proposes deep isolation forest. We introduce a new representation scheme that utilises casually initialised neural networks to map original data into random representation ensembles, where random axis-parallel cuts are subsequently applied to perform the data partition. ",
    "link": "http://arxiv.org/abs/2206.06602",
    "context": "Title: Deep Isolation Forest for Anomaly Detection. (arXiv:2206.06602v3 [cs.LG] UPDATED)\nAbstract: Isolation forest (iForest) has been emerging as arguably the most popular anomaly detector in recent years due to its general effectiveness across different benchmarks and strong scalability. Nevertheless, its linear axis-parallel isolation method often leads to (i) failure in detecting hard anomalies that are difficult to isolate in high-dimensional/non-linear-separable data space, and (ii) notorious algorithmic bias that assigns unexpectedly lower anomaly scores to artefact regions. These issues contribute to high false negative errors. Several iForest extensions are introduced, but they essentially still employ shallow, linear data partition, restricting their power in isolating true anomalies. Therefore, this paper proposes deep isolation forest. We introduce a new representation scheme that utilises casually initialised neural networks to map original data into random representation ensembles, where random axis-parallel cuts are subsequently applied to perform the data partition. ",
    "path": "papers/22/06/2206.06602.json",
    "total_tokens": 920,
    "translated_title": "深度隔离森林用于异常检测",
    "translated_abstract": "孤立森林（iForest）由于在不同基准测试中的普适有效性和强大的可扩展性而逐渐成为可能是最受欢迎的异常检测器。然而，它的线性轴并行隔离方法经常导致（i）检测难以在高维/非线性可分数据空间中隔离的困难异常的失败，以及（ii）臭名昭着的算法偏差，将预期较低的异常得分分配给工件区域。这些问题导致高误报率。引入了几个iForest扩展，但它们本质上仍然使用浅层的线性数据分区，限制了它们隔离真正异常的能力。因此，本文提出了深度隔离森林。我们引入了一种新的表示方案，利用随意初始化的神经网络将原始数据映射到随机表示集合中，随后应用随机轴并行切割来执行数据分区。",
    "tldr": "本文提出了深度隔离森林，利用神经网络将原始数据映射到随机表示集合中，通过随机轴并行切割来执行数据分区，以解决孤立森林算法不能成功检测高维/非线性可分数据空间中的难以隔离的困难异常的问题。",
    "en_tdlr": "This paper proposes Deep Isolation Forest, which uses neural networks to map original data into random representation ensembles and performs data partition through axis-parallel cuts to address the issue of isolation failure for hard anomalies in high-dimensional/non-linear-separable data space, that the iForest algorithm cannot effectively detect."
}