{
    "title": "Retirement decision with addictive habit persistence in a jump diffusion market",
    "abstract": "arXiv:2011.10166v2 Announce Type: replace  Abstract: This paper investigates the optimal retirement decision, investment, and consumption strategies in a market with jump diffusion, taking into account habit persistence and stock-wage correlation. Our analysis considers multiple stocks and a finite time framework, intending to determine the retirement boundary of the ``wealth-habit-wage\" triplet $(x, h, w)$. To achieve this, we use the habit reduction method and a duality approach to obtain the retirement boundary of the primal variables and feedback forms of optimal strategies. { When dealing with the dual problem, we address technical challenges in the proof of integral equation characterization of optimal retirement boundary using a $C^1$ version of It$\\hat{\\rm o}$'s formula.} Our results show that when the so-called ``de facto wealth\" exceeds a critical proportion of wage, an immediate retirement is the optimal choice for the agent. Additionally, we find that the introduction of ju",
    "link": "https://arxiv.org/abs/2011.10166",
    "context": "Title: Retirement decision with addictive habit persistence in a jump diffusion market\nAbstract: arXiv:2011.10166v2 Announce Type: replace  Abstract: This paper investigates the optimal retirement decision, investment, and consumption strategies in a market with jump diffusion, taking into account habit persistence and stock-wage correlation. Our analysis considers multiple stocks and a finite time framework, intending to determine the retirement boundary of the ``wealth-habit-wage\" triplet $(x, h, w)$. To achieve this, we use the habit reduction method and a duality approach to obtain the retirement boundary of the primal variables and feedback forms of optimal strategies. { When dealing with the dual problem, we address technical challenges in the proof of integral equation characterization of optimal retirement boundary using a $C^1$ version of It$\\hat{\\rm o}$'s formula.} Our results show that when the so-called ``de facto wealth\" exceeds a critical proportion of wage, an immediate retirement is the optimal choice for the agent. Additionally, we find that the introduction of ju",
    "path": "papers/20/11/2011.10166.json",
    "total_tokens": 940,
    "translated_title": "在跳跃扩散市场中考虑成瘾习惯持续性的退休决策",
    "translated_abstract": "本文研究了在跳跃扩散市场中考虑习惯持续性和股票-工资相关性的情况下的最佳退休决策、投资和消费策略。我们的分析考虑了多种股票和有限时间框架，旨在确定“财富-习惯-工资”三元组$(x, h, w)$的退休边界。为了实现这一目的，我们使用了习惯减少方法和对偶方法来获得原始变量的退休边界和最佳策略的反馈形式。在处理对偶问题时，我们通过使用It$\\hat{\\rm o}$'s公式的$C^1$版本来解决最佳退休边界的积分方程表征的技术挑战。我们的结果表明，当所谓的“事实上的财富”超过工资的临界比例时，立即退休是代理人的最佳选择。此外，我们发现引入跳盘后，退休决策受到更大的影响。",
    "tldr": "本文研究了在跳跃扩散市场中考虑成瘾习惯持续性的退休决策问题，结果表明当代理人的“事实上的财富”超过工资的临界比例时，立即退休是最佳选择。",
    "en_tdlr": "This paper investigates the optimal retirement decision, investment, and consumption strategies in a market with jump diffusion while considering habit persistence and stock-wage correlation. The results indicate that immediate retirement is the optimal choice for the agent when the \"de facto wealth\" exceeds a critical proportion of the wage."
}