{
    "title": "Mixed--frequency quantile regressions to forecast Value--at--Risk and Expected Shortfall. (arXiv:2011.00552v3 [q-fin.ST] UPDATED)",
    "abstract": "Although quantile regression to calculate risk measures has been widely established in the financial literature, when considering data observed at mixed--frequency, an extension is needed. In this paper, a model is suggested built on a mixed--frequency quantile regression to directly estimate the Value--at--Risk (VaR) and the Expected Shortfall (ES) measures. In particular, the low--frequency component incorporates information coming from variables observed at, typically, monthly or lower frequencies, while the high--frequency component can include a variety of daily variables, like market indices or realized volatility measures. The conditions for the weak stationarity of the daily return process are derived and the finite sample properties are investigated in an extensive Monte Carlo exercise. The validity of the proposed model is then explored through a real data application using two energy commodities, namely, Crude Oil and Gasoline futures. Results show that our model outperforms",
    "link": "http://arxiv.org/abs/2011.00552",
    "context": "Title: Mixed--frequency quantile regressions to forecast Value--at--Risk and Expected Shortfall. (arXiv:2011.00552v3 [q-fin.ST] UPDATED)\nAbstract: Although quantile regression to calculate risk measures has been widely established in the financial literature, when considering data observed at mixed--frequency, an extension is needed. In this paper, a model is suggested built on a mixed--frequency quantile regression to directly estimate the Value--at--Risk (VaR) and the Expected Shortfall (ES) measures. In particular, the low--frequency component incorporates information coming from variables observed at, typically, monthly or lower frequencies, while the high--frequency component can include a variety of daily variables, like market indices or realized volatility measures. The conditions for the weak stationarity of the daily return process are derived and the finite sample properties are investigated in an extensive Monte Carlo exercise. The validity of the proposed model is then explored through a real data application using two energy commodities, namely, Crude Oil and Gasoline futures. Results show that our model outperforms",
    "path": "papers/20/11/2011.00552.json",
    "total_tokens": 879,
    "translated_title": "混合频率分位数回归在预测风险价值和预期损失中的应用",
    "translated_abstract": "尽管分位数回归被广泛应用于计算风险度量，但在考虑混合频率数据时，则需要进行扩展。本文建立了一个基于混合频率分位数回归的模型，直接估计风险价值（VaR）和预期损失（ES）度量。特别是，低频率部分包含来自通常以月度或更低频率观测的变量的信息，而高频率部分可以包括各种日常变量，如市场指数或实现波动率度量。导出了日收益过程的弱平稳条件，并在广泛的蒙特卡罗实验中研究了有限样本性质。然后通过实际数据应用在两种能源商品，即原油和汽油期货中，探究了所提出模型的有效性。结果表明，我们的模型表现优异。",
    "tldr": "本文提出了一个基于混合频率分位数回归的模型，直接估计风险价值（VaR）和预期损失（ES）度量，既包括低频率部分，又包括高频率部分，提高了预测的准确性。"
}