{
    "title": "Social Diversity and Spread of Pandemic: Evidence from India. (arXiv:2011.05839v2 [econ.GN] UPDATED)",
    "abstract": "Compliance with the public health guidelines during a pandemic requires coordinated community actions which might be undermined in socially diverse areas. In this paper, we assess the relationship between caste-group diversity and the spread of COVID-19 infection during the nationwide lockdown and unlocking period in India. On the extensive margin, we find that caste-homogeneous districts systematically took more days to cross the concentration thresholds of 50 to 500 cases. Estimates on the intensive margin, using daily cases, further show that caste-homogeneous districts experienced slower growth in infection. Overall, the effects of caste-group homogeneity remained positive and statistically significant for 2.5 months (about 76 days) after the beginning of the lockdown and weakened with subsequent phases of the lockdown. The results hold even after accounting for the emergence of initial hotspots before lockdown, broader diffusion patterns through daily fixed effects, region fixed e",
    "link": "http://arxiv.org/abs/2011.05839",
    "context": "Title: Social Diversity and Spread of Pandemic: Evidence from India. (arXiv:2011.05839v2 [econ.GN] UPDATED)\nAbstract: Compliance with the public health guidelines during a pandemic requires coordinated community actions which might be undermined in socially diverse areas. In this paper, we assess the relationship between caste-group diversity and the spread of COVID-19 infection during the nationwide lockdown and unlocking period in India. On the extensive margin, we find that caste-homogeneous districts systematically took more days to cross the concentration thresholds of 50 to 500 cases. Estimates on the intensive margin, using daily cases, further show that caste-homogeneous districts experienced slower growth in infection. Overall, the effects of caste-group homogeneity remained positive and statistically significant for 2.5 months (about 76 days) after the beginning of the lockdown and weakened with subsequent phases of the lockdown. The results hold even after accounting for the emergence of initial hotspots before lockdown, broader diffusion patterns through daily fixed effects, region fixed e",
    "path": "papers/20/11/2011.05839.json",
    "total_tokens": 932,
    "translated_title": "社会多样性与疫情传播：来自印度的证据",
    "translated_abstract": "在疫情期间，遵守公共卫生准则需要协调社区行动，而社会多元化的地区可能受到破坏。本文评估了印度全国封锁和解锁期间种姓群体多样性与COVID-19感染传播之间的关系。我们发现，种姓同质化地区在跨越50至500个病例的浓度阈值方面，需要更多的时间。使用每日病例进行密集度分析，进一步显示种姓同质化地区感染增长较慢。总体而言，在全国封锁开始后的2.5个月（约76天）中，种姓同质化的影响仍然为正且具有统计学意义，并随后逐渐减弱。即使在考虑封锁前的热点出现、每日固定效应、区域固定效应影响后，结果仍然成立。",
    "tldr": "本文研究了印度种姓多样性与COVID-19传播速度的关系。研究发现，在病例浓度阈值方面，种姓同质化地区需要更长的时间，使用每日病例进行分析也发现其传播增长较慢。这些结果持续了约76天，即使在考虑其他因素后也依然成立。",
    "en_tdlr": "This paper examines the relationship between caste-group diversity and the spread of COVID-19 infection in India. The findings suggest that caste-homogeneous districts took more time to cross the concentration thresholds of 50 to 500 cases and experienced slower growth in infection. These effects remained positive for about 76 days, even after accounting for other factors."
}