{
    "title": "Deep learning insights into cosmological structure formation",
    "abstract": "arXiv:2011.10577v3 Announce Type: replace-cross  Abstract: The evolution of linear initial conditions present in the early universe into extended halos of dark matter at late times can be computed using cosmological simulations. However, a theoretical understanding of this complex process remains elusive; in particular, the role of anisotropic information in the initial conditions in establishing the final mass of dark matter halos remains a long-standing puzzle. Here, we build a deep learning framework to investigate this question. We train a three-dimensional convolutional neural network (CNN) to predict the mass of dark matter halos from the initial conditions, and quantify in full generality the amounts of information in the isotropic and anisotropic aspects of the initial density field about final halo masses. We find that anisotropies add a small, albeit statistically significant amount of information over that contained within spherical averages of the density field about final ",
    "link": "https://arxiv.org/abs/2011.10577",
    "context": "Title: Deep learning insights into cosmological structure formation\nAbstract: arXiv:2011.10577v3 Announce Type: replace-cross  Abstract: The evolution of linear initial conditions present in the early universe into extended halos of dark matter at late times can be computed using cosmological simulations. However, a theoretical understanding of this complex process remains elusive; in particular, the role of anisotropic information in the initial conditions in establishing the final mass of dark matter halos remains a long-standing puzzle. Here, we build a deep learning framework to investigate this question. We train a three-dimensional convolutional neural network (CNN) to predict the mass of dark matter halos from the initial conditions, and quantify in full generality the amounts of information in the isotropic and anisotropic aspects of the initial density field about final halo masses. We find that anisotropies add a small, albeit statistically significant amount of information over that contained within spherical averages of the density field about final ",
    "path": "papers/20/11/2011.10577.json",
    "total_tokens": 852,
    "translated_title": "深度学习对宇宙结构形成的洞见",
    "translated_abstract": "通过宇宙模拟可以计算早期宇宙中的线性初始条件如何演变成为后来的暗物质扩展暗团。然而，对于这一复杂过程的理论理解仍然难以捉摸；特别是，初始条件中各向异性信息如何确定最终暗物质暗团质量的角色仍然是一个长期存在的难题。在本文中，我们构建了一个深度学习框架来探讨这个问题。我们训练了一个三维卷积神经网络（CNN）来从初始条件预测暗物质暗团的质量，并全面量化了初始密度场的各向同性和各向异性方面关于最终暗团质量的信息量。我们发现，各向异性确实比密度场的球面平均值所包含的信息量略微增加了一些，尽管在统计上是显著的。",
    "tldr": "通过构建深度学习框架，研究了各向异性信息在初始条件中如何影响暗物质暗团的最终质量，并发现各向异性添加了一些额外信息量。",
    "en_tdlr": "Investigating the impact of anisotropic information in the initial conditions on the final mass of dark matter halos using a deep learning framework, showing that anisotropies contribute additional information beyond spherical averages."
}