{
    "title": "Sustainable Recreational Fishing Using a Novel Electrical Muscle Stimulation (EMS) Lure and Ensemble Network Algorithm to Maximize Catch and Release Survivability",
    "abstract": "arXiv:2006.10125v3 Announce Type: replace-cross  Abstract: With 200-700 million anglers in the world, sportfishing is nearly five times more common than commercial trawling. Worldwide, hundreds of thousands of jobs are linked to the sportfishing industry, which generates billions of dollars for water-side communities and fisheries conservatories alike. However, the sheer popularity of recreational fishing poses threats to aquatic biodiversity that are hard to regulate. For example, as much as 25% of overfished populations can be traced to anglers. This alarming statistic is explained by the average catch and release mortality rate of 43%, which primarily results from hook-related injuries and careless out-of-water handling. The provisional-patented design proposed in this paper addresses both these problems separately First, a novel, electrical muscle stimulation based fishing lure is proposed as a harmless and low cost alternative to sharp hooks. Early prototypes show a constant elect",
    "link": "https://arxiv.org/abs/2006.10125",
    "context": "Title: Sustainable Recreational Fishing Using a Novel Electrical Muscle Stimulation (EMS) Lure and Ensemble Network Algorithm to Maximize Catch and Release Survivability\nAbstract: arXiv:2006.10125v3 Announce Type: replace-cross  Abstract: With 200-700 million anglers in the world, sportfishing is nearly five times more common than commercial trawling. Worldwide, hundreds of thousands of jobs are linked to the sportfishing industry, which generates billions of dollars for water-side communities and fisheries conservatories alike. However, the sheer popularity of recreational fishing poses threats to aquatic biodiversity that are hard to regulate. For example, as much as 25% of overfished populations can be traced to anglers. This alarming statistic is explained by the average catch and release mortality rate of 43%, which primarily results from hook-related injuries and careless out-of-water handling. The provisional-patented design proposed in this paper addresses both these problems separately First, a novel, electrical muscle stimulation based fishing lure is proposed as a harmless and low cost alternative to sharp hooks. Early prototypes show a constant elect",
    "path": "papers/20/06/2006.10125.json",
    "total_tokens": 954,
    "translated_title": "利用新型电肌肉刺激（EMS）鱼饵和集成网络算法进行可持续休闲钓鱼以最大限度提高捕获和释放的可生存性",
    "translated_abstract": "有20亿至7亿垂钓者，垂钓比商业拖网渔业普遍多出近五倍。全球范围内，数十万个工作与垂钓产业相关，为水边社区和渔业保护区带来数十亿美元的收入。然而，垂钓活动的广泛流行对水生生物多样性构成难以规范的威胁。例如，最多25%的过度捕捞种群可以追溯到垂钓者。这一令人担忧的统计数据可通过43%的平均捕捞和释放死亡率来解释，主要是由于钩相关的伤害和手法不当地处理带来的。本文提出的临时专利设计分别解决了这两个问题，首先，提出了一种新型的基于电肌肉刺激的钓鱼饵，作为尖钩的无害和低成本替代方案。早期原型显示了一种持恒的电。。。",
    "tldr": "该论文提出了一种新型电肌肉刺激钓鱼饵和集成网络算法，以解决垂钓损害和释放死亡率较高的问题，对于可持续开展休闲钓鱼具有重要意义。",
    "en_tdlr": "This paper proposes a novel electrical muscle stimulation fishing lure and ensemble network algorithm to address the issues of fishing harm and high release mortality rate, which is of great significance for sustainable recreational fishing."
}