{
    "title": "Learning to Satisfy Unknown Constraints in Iterative MPC. (arXiv:2006.05054v3 [eess.SY] UPDATED)",
    "abstract": "We propose a control design method for linear time-invariant systems that iteratively learns to satisfy unknown polyhedral state constraints. At each iteration of a repetitive task, the method constructs an estimate of the unknown environment constraints using collected closed-loop trajectory data. This estimated constraint set is improved iteratively upon collection of additional data. An MPC controller is then designed to robustly satisfy the estimated constraint set. This paper presents the details of the proposed approach, and provides robust and probabilistic guarantees of constraint satisfaction as a function of the number of executed task iterations. We demonstrate the safety of the proposed framework and explore the safety vs. performance trade-off in a detailed numerical example.",
    "link": "http://arxiv.org/abs/2006.05054",
    "context": "Title: Learning to Satisfy Unknown Constraints in Iterative MPC. (arXiv:2006.05054v3 [eess.SY] UPDATED)\nAbstract: We propose a control design method for linear time-invariant systems that iteratively learns to satisfy unknown polyhedral state constraints. At each iteration of a repetitive task, the method constructs an estimate of the unknown environment constraints using collected closed-loop trajectory data. This estimated constraint set is improved iteratively upon collection of additional data. An MPC controller is then designed to robustly satisfy the estimated constraint set. This paper presents the details of the proposed approach, and provides robust and probabilistic guarantees of constraint satisfaction as a function of the number of executed task iterations. We demonstrate the safety of the proposed framework and explore the safety vs. performance trade-off in a detailed numerical example.",
    "path": "papers/20/06/2006.05054.json",
    "total_tokens": 844,
    "translated_title": "迭代MPC中学习满足未知约束条件的方法",
    "translated_abstract": "本文提出了一种针对线性定常系统的控制设计方法，可以迭代学习满足未知多面体状态约束条件。在重复任务的每个迭代中，该方法使用收集的闭环轨迹数据构建未知环境约束条件的估计。在收集到更多数据后，这个估计的约束集合会得到迭代改进。接着，MPC控制器被设计成可以强健地满足这个估计的约束集合。本文详细介绍了所提出方法的细节，并提供了关于约束满足的稳健性和概率保证，这取决于执行任务迭代的次数。我们在详细的数值例子中展示了所提出框架的安全性，并探索了安全性与性能之间的折衷。",
    "tldr": "本文提出了一种迭代方法来学习满足未知约束条件的控制设计方法，并通过收集的数据改进了约束条件的估计，使用MPC控制器强健地满足估计的约束条件，同时提供了稳健性和概率保证。",
    "en_tdlr": "This paper proposes an iterative method for learning to satisfy unknown constraints in control design, where an estimate of unknown environment constraints is constructed using collected closed-loop trajectory data at each iteration. The estimated constraint set is improved iteratively upon collection of additional data, and an MPC controller is designed to robustly satisfy the estimated constraint set. Robust and probabilistic guarantees of constraint satisfaction are provided, with a detailed numerical example exploring the safety vs. performance trade-off."
}