{
    "title": "Simplified calculus for semimartingales: Multiplicative compensators and changes of measure. (arXiv:2006.12765v4 [math.PR] UPDATED)",
    "abstract": "The paper develops multiplicative compensation for complex-valued semimartingales and studies some of its consequences. It is shown that the stochastic exponential of any complex-valued semimartingale with independent increments becomes a true martingale after multiplicative compensation when such compensation is meaningful. This generalization of the L\\'evy--Khintchin formula fills an existing gap in the literature. It allows, for example, the computation of the Mellin transform of a signed stochastic exponential, which in turn has practical applications in mean--variance portfolio theory. Girsanov-type results based on multiplicatively compensated semimartingales simplify treatment of absolutely continuous measure changes. As an example, we obtain the characteristic function of log returns for a popular class of minimax measures in a L\\'evy setting.",
    "link": "http://arxiv.org/abs/2006.12765",
    "context": "Title: Simplified calculus for semimartingales: Multiplicative compensators and changes of measure. (arXiv:2006.12765v4 [math.PR] UPDATED)\nAbstract: The paper develops multiplicative compensation for complex-valued semimartingales and studies some of its consequences. It is shown that the stochastic exponential of any complex-valued semimartingale with independent increments becomes a true martingale after multiplicative compensation when such compensation is meaningful. This generalization of the L\\'evy--Khintchin formula fills an existing gap in the literature. It allows, for example, the computation of the Mellin transform of a signed stochastic exponential, which in turn has practical applications in mean--variance portfolio theory. Girsanov-type results based on multiplicatively compensated semimartingales simplify treatment of absolutely continuous measure changes. As an example, we obtain the characteristic function of log returns for a popular class of minimax measures in a L\\'evy setting.",
    "path": "papers/20/06/2006.12765.json",
    "total_tokens": 848,
    "translated_title": "半鞅的简化微积分：乘法补偿和测度变换",
    "translated_abstract": "本文开发了适用于复值半鞅的乘法补偿，并研究了其一些结果。当有意义的时候，它表明具有独立增量的任何复值半鞅的随机指数成为真鞅。这种L\\'evy--Khintchin公式的推广填补了文献中的一个现有空白。例如，它允许计算符号随机指数的梅林变换，进而在均值方差组合理论中具有实际应用。基于乘法补偿的半鞅Girsanov类型的结果简化了绝对连续测度变换的处理。作为例子，我们在L\\'evy设置中获得了一类最小极小测度的对数回报的特征函数。",
    "tldr": "本文介绍了适用于复值半鞅的乘法补偿，填补了文献中的一个空白，并简化了测度变换的处理。可以计算符号随机指数的梅林变换，有实际应用于均值方差组合理论中。"
}