{
    "title": "MgSvF: Multi-Grained Slow vs. Fast Framework for Few-Shot Class-Incremental Learning",
    "abstract": "arXiv:2006.15524v4 Announce Type: replace-cross  Abstract: As a challenging problem, few-shot class-incremental learning (FSCIL) continually learns a sequence of tasks, confronting the dilemma between slow forgetting of old knowledge and fast adaptation to new knowledge. In this paper, we concentrate on this \"slow vs. fast\" (SvF) dilemma to determine which knowledge components to be updated in a slow fashion or a fast fashion, and thereby balance old-knowledge preservation and new-knowledge adaptation. We propose a multi-grained SvF learning strategy to cope with the SvF dilemma from two different grains: intra-space (within the same feature space) and inter-space (between two different feature spaces). The proposed strategy designs a novel frequency-aware regularization to boost the intra-space SvF capability, and meanwhile develops a new feature space composition operation to enhance the inter-space SvF learning performance. With the multi-grained SvF learning strategy, our method ou",
    "link": "https://arxiv.org/abs/2006.15524",
    "context": "Title: MgSvF: Multi-Grained Slow vs. Fast Framework for Few-Shot Class-Incremental Learning\nAbstract: arXiv:2006.15524v4 Announce Type: replace-cross  Abstract: As a challenging problem, few-shot class-incremental learning (FSCIL) continually learns a sequence of tasks, confronting the dilemma between slow forgetting of old knowledge and fast adaptation to new knowledge. In this paper, we concentrate on this \"slow vs. fast\" (SvF) dilemma to determine which knowledge components to be updated in a slow fashion or a fast fashion, and thereby balance old-knowledge preservation and new-knowledge adaptation. We propose a multi-grained SvF learning strategy to cope with the SvF dilemma from two different grains: intra-space (within the same feature space) and inter-space (between two different feature spaces). The proposed strategy designs a novel frequency-aware regularization to boost the intra-space SvF capability, and meanwhile develops a new feature space composition operation to enhance the inter-space SvF learning performance. With the multi-grained SvF learning strategy, our method ou",
    "path": "papers/20/06/2006.15524.json",
    "total_tokens": 933,
    "translated_title": "MgSvF：多粒度慢vs.快框架用于少样本类别增量学习",
    "translated_abstract": "作为一个具有挑战性的问题，少样本类别增量学习(FSCIL)不断学习一系列任务，面临着在忘记旧知识和快速适应新知识之间的困境。本文关注这种“慢vs.快”(SvF)困境，确定哪些知识组件应以慢速或快速方式更新，从而平衡保留旧知识和适应新知识。我们提出了一种多粒度SvF学习策略，以应对来自两个不同粒度的SvF困境：内部空间(在相同特征空间内)和外部空间(在两个不同特征空间之间)。所提出的策略设计了一种新颖的频率感知正则化，以提升内部空间SvF能力，并同时开发了一种新的特征空间组合操作，以增强外部空间SvF学习性能。通过多粒度SvF学习策略，我们的方法获得了哪",
    "tldr": "提出了一种多粒度SvF学习策略，通过设计频率感知正则化和特征空间组合操作来平衡保留旧知识与适应新知识，以解决少样本类别增量学习中的\"慢vs.快\"困境",
    "en_tdlr": "Proposed a multi-grained SvF learning strategy to balance the preservation of old knowledge and adaptation to new knowledge in few-shot class-incremental learning, addressing the \"slow vs. fast\" dilemma."
}