{
    "title": "Global Sensitivity and Domain-Selective Testing for Functional-Valued Responses: An Application to Climate Economy Models. (arXiv:2006.13850v3 [stat.ME] UPDATED)",
    "abstract": "Understanding the dynamics and evolution of climate change and associated uncertainties is key for designing robust policy actions. Computer models are key tools in this scientific effort, which have now reached a high level of sophistication and complexity. Model auditing is needed in order to better understand their results, and to deal with the fact that such models are increasingly opaque with respect to their inner workings. Current techniques such as Global Sensitivity Analysis (GSA) are limited to dealing either with multivariate outputs, stochastic ones, or finite-change inputs. This limits their applicability to time-varying variables such as future pathways of greenhouse gases. To provide additional semantics in the analysis of a model ensemble, we provide an extension of GSA methodologies tackling the case of stochastic functional outputs with finite change inputs. To deal with finite change inputs and functional outputs, we propose an extension of currently available GSA me",
    "link": "http://arxiv.org/abs/2006.13850",
    "context": "Title: Global Sensitivity and Domain-Selective Testing for Functional-Valued Responses: An Application to Climate Economy Models. (arXiv:2006.13850v3 [stat.ME] UPDATED)\nAbstract: Understanding the dynamics and evolution of climate change and associated uncertainties is key for designing robust policy actions. Computer models are key tools in this scientific effort, which have now reached a high level of sophistication and complexity. Model auditing is needed in order to better understand their results, and to deal with the fact that such models are increasingly opaque with respect to their inner workings. Current techniques such as Global Sensitivity Analysis (GSA) are limited to dealing either with multivariate outputs, stochastic ones, or finite-change inputs. This limits their applicability to time-varying variables such as future pathways of greenhouse gases. To provide additional semantics in the analysis of a model ensemble, we provide an extension of GSA methodologies tackling the case of stochastic functional outputs with finite change inputs. To deal with finite change inputs and functional outputs, we propose an extension of currently available GSA me",
    "path": "papers/20/06/2006.13850.json",
    "total_tokens": 856,
    "translated_title": "全球敏感性和领域选择性测试用于函数值响应：应用于气候经济模型的方法",
    "translated_abstract": "理解气候变化的动力学和演化以及相关不确定性对于设计稳健的政策行动至关重要。计算机模型是这个科学努力中的关键工具，这些模型已经达到了高度复杂和复杂的水平。模型审计是必要的，以更好地理解它们的结果，并处理这样的事实：这些模型对于其内部工作越来越不透明。当前的技术，如全球敏感性分析（GSA），局限于处理多变量输出、随机输出或有限变化输入。这限制了它们对于未来温室气体路径等时间变化变量的适用性。为了在模型集合的分析中提供附加的语义，我们提供了一个扩展GSA方法的方法，来解决具有有限变化输入的随机功能输出的情况。为了处理有限变化的输入和功能输出，我们提出了当前可用的GSA方法的扩展。",
    "tldr": "这篇论文介绍了一种新的全球敏感性分析方法，可以处理具有有限变化输入和随机功能输出的情况，并应用于气候经济模型。"
}