{
    "title": "Nonparametric approximation of conditional expectation operators. (arXiv:2012.12917v3 [math.ST] UPDATED)",
    "abstract": "Given the joint distribution of two random variables $X,Y$ on some second countable locally compact Hausdorff space, we investigate the statistical approximation of the $L^2$-operator defined by $[Pf](x) := \\mathbb{E}[ f(Y) \\mid X = x ]$ under minimal assumptions. By modifying its domain, we prove that $P$ can be arbitrarily well approximated in operator norm by Hilbert-Schmidt operators acting on a reproducing kernel Hilbert space. This fact allows to estimate $P$ uniformly by finite-rank operators over a dense subspace even when $P$ is not compact. In terms of modes of convergence, we thereby obtain the superiority of kernel-based techniques over classically used parametric projection approaches such as Galerkin methods. This also provides a novel perspective on which limiting object the nonparametric estimate of $P$ converges to. As an application, we show that these results are particularly important for a large family of spectral analysis techniques for Markov transition operators",
    "link": "http://arxiv.org/abs/2012.12917",
    "context": "Title: Nonparametric approximation of conditional expectation operators. (arXiv:2012.12917v3 [math.ST] UPDATED)\nAbstract: Given the joint distribution of two random variables $X,Y$ on some second countable locally compact Hausdorff space, we investigate the statistical approximation of the $L^2$-operator defined by $[Pf](x) := \\mathbb{E}[ f(Y) \\mid X = x ]$ under minimal assumptions. By modifying its domain, we prove that $P$ can be arbitrarily well approximated in operator norm by Hilbert-Schmidt operators acting on a reproducing kernel Hilbert space. This fact allows to estimate $P$ uniformly by finite-rank operators over a dense subspace even when $P$ is not compact. In terms of modes of convergence, we thereby obtain the superiority of kernel-based techniques over classically used parametric projection approaches such as Galerkin methods. This also provides a novel perspective on which limiting object the nonparametric estimate of $P$ converges to. As an application, we show that these results are particularly important for a large family of spectral analysis techniques for Markov transition operators",
    "path": "papers/20/12/2012.12917.json",
    "total_tokens": 968,
    "translated_title": "非参数逼近条件期望算子",
    "translated_abstract": "给定二元随机变量X，Y在某个二可数局部紧致哈斯多夫空间上的联合分布，我们研究了在最小假设下对由[Pf](x) := E[ f(Y) | X = x ]定义的L^2算子的统计逼近。通过修改其定义域，我们证明了P可以在算子范数下通过在一个再现核希尔伯特空间上作用的希尔伯特-施密特算子任意好地逼近。这一事实意味着即使P不是紧致的，我们也可以通过一个稠密子空间上的有限秩算子来统一估计P。在收敛模式方面，这样我们就得到了基于核的技术相对于传统的参数投影方法如Galerkin方法的优势。这也为非参数估计的P收敛到了哪种极限对象提供了新的视角。作为应用，我们展示了这些结果对马尔科夫过渡算子的大家族的谱分析技术是特别重要的。",
    "tldr": "本文研究了在最小假设下对条件期望算子的统计逼近问题，并通过修改其定义域证明了该算子可以被再现核希尔伯特空间上的希尔伯特-施密特算子任意好地逼近。这为非参数估计提供了一种优于传统参数投影方法的方法，并揭示了非参数估计的极限对象。",
    "en_tdlr": "This paper investigates the statistical approximation of conditional expectation operators under minimal assumptions and proves that they can be well approximated by Hilbert-Schmidt operators on reproducing kernel Hilbert spaces. This provides a superior method for nonparametric estimation and reveals the limiting object of the estimation."
}