{
    "title": "Kernel Methods for Unobserved Confounding: Negative Controls, Proxies, and Instruments. (arXiv:2012.10315v5 [stat.ML] UPDATED)",
    "abstract": "Negative control is a strategy for learning the causal relationship between treatment and outcome in the presence of unmeasured confounding. The treatment effect can nonetheless be identified if two auxiliary variables are available: a negative control treatment (which has no effect on the actual outcome), and a negative control outcome (which is not affected by the actual treatment). These auxiliary variables can also be viewed as proxies for a traditional set of control variables, and they bear resemblance to instrumental variables. I propose a family of algorithms based on kernel ridge regression for learning nonparametric treatment effects with negative controls. Examples include dose response curves, dose response curves with distribution shift, and heterogeneous treatment effects. Data may be discrete or continuous, and low, high, or infinite dimensional. I prove uniform consistency and provide finite sample rates of convergence. I estimate the dose response curve of cigarette sm",
    "link": "http://arxiv.org/abs/2012.10315",
    "context": "Title: Kernel Methods for Unobserved Confounding: Negative Controls, Proxies, and Instruments. (arXiv:2012.10315v5 [stat.ML] UPDATED)\nAbstract: Negative control is a strategy for learning the causal relationship between treatment and outcome in the presence of unmeasured confounding. The treatment effect can nonetheless be identified if two auxiliary variables are available: a negative control treatment (which has no effect on the actual outcome), and a negative control outcome (which is not affected by the actual treatment). These auxiliary variables can also be viewed as proxies for a traditional set of control variables, and they bear resemblance to instrumental variables. I propose a family of algorithms based on kernel ridge regression for learning nonparametric treatment effects with negative controls. Examples include dose response curves, dose response curves with distribution shift, and heterogeneous treatment effects. Data may be discrete or continuous, and low, high, or infinite dimensional. I prove uniform consistency and provide finite sample rates of convergence. I estimate the dose response curve of cigarette sm",
    "path": "papers/20/12/2012.10315.json",
    "total_tokens": 931,
    "translated_title": "无法观测到的混淆变量的核方法：负对照、代理变量和工具变量",
    "translated_abstract": "负对照是一种在存在未测量混淆的情况下学习治疗与结果之间因果关系的策略。如果有两个辅助变量可用：一个负对照治疗（对实际结果没有影响）和一个负对照结果（不受实际治疗影响），则仍然可以识别治疗效果。 这些辅助变量也可以视为传统控制变量集的代理变量，并且它们类似于工具变量。我提出了一族基于核岭回归的算法，在负对照下学习非参数治疗效果。示例包括剂量反应曲线、具有分布偏移的剂量反应曲线和异质性治疗效果。 数据可以是离散、连续和低维、高维或无限维。我证明了均匀一致性并提供了有限样本收敛率。 我估计了香烟吸烟剂量反应曲线。",
    "tldr": "该论文提出了一种使用负对照、代理变量和工具变量的核方法，以识别治疗效果并学习非参数治疗效果。 作者证明了算法的一致性和收敛速度，并估计了香烟吸烟的剂量反应曲线。"
}