{
    "title": "The Variational Method of Moments. (arXiv:2012.09422v4 [cs.LG] UPDATED)",
    "abstract": "The conditional moment problem is a powerful formulation for describing structural causal parameters in terms of observables, a prominent example being instrumental variable regression. A standard approach reduces the problem to a finite set of marginal moment conditions and applies the optimally weighted generalized method of moments (OWGMM), but this requires we know a finite set of identifying moments, can still be inefficient even if identifying, or can be theoretically efficient but practically unwieldy if we use a growing sieve of moment conditions. Motivated by a variational minimax reformulation of OWGMM, we define a very general class of estimators for the conditional moment problem, which we term the variational method of moments (VMM) and which naturally enables controlling infinitely-many moments. We provide a detailed theoretical analysis of multiple VMM estimators, including ones based on kernel methods and neural nets, and provide conditions under which these are consist",
    "link": "http://arxiv.org/abs/2012.09422",
    "context": "Title: The Variational Method of Moments. (arXiv:2012.09422v4 [cs.LG] UPDATED)\nAbstract: The conditional moment problem is a powerful formulation for describing structural causal parameters in terms of observables, a prominent example being instrumental variable regression. A standard approach reduces the problem to a finite set of marginal moment conditions and applies the optimally weighted generalized method of moments (OWGMM), but this requires we know a finite set of identifying moments, can still be inefficient even if identifying, or can be theoretically efficient but practically unwieldy if we use a growing sieve of moment conditions. Motivated by a variational minimax reformulation of OWGMM, we define a very general class of estimators for the conditional moment problem, which we term the variational method of moments (VMM) and which naturally enables controlling infinitely-many moments. We provide a detailed theoretical analysis of multiple VMM estimators, including ones based on kernel methods and neural nets, and provide conditions under which these are consist",
    "path": "papers/20/12/2012.09422.json",
    "total_tokens": 798,
    "translated_title": "条件矩问题的变分矩方法",
    "translated_abstract": "条件矩问题是描述结构性因果参数的有力形式化工具。一个常见的方法是将问题转化为有限组的边际矩条件，并应用最优加权广义矩法（OWGMM）。本文提出了一个称之为变分矩方法（VMM）的非常通用的条件矩问题估计器类，并自然地使我们能够控制无限数量的矩。作者对多个VMM估计器进行了详细的理论分析，包括基于核方法和神经网络的估计器，并提供了这些方法在一定条件下一致估计真实因果参数的证明。",
    "tldr": "本文提出了一个非常通用的条件矩问题估计器类 - 变分矩方法，使得我们能够控制无限数量的矩，并提供了基于核方法和神经网络的多个VMM估计器的理论分析和证明。",
    "en_tdlr": "This paper presents a very general class of estimator for the conditional moment problem, called the variational method of moments (VMM), which naturally allows for controlling infinitely-many moments. The paper provides a detailed theoretical analysis of multiple VMM estimators, including ones based on kernel methods and neural nets, and proves conditions under which these estimators consistently estimate the true causal parameters."
}