{
    "title": "Credit Freezes, Equilibrium Multiplicity, and Optimal Bailouts in Financial Networks. (arXiv:2012.12861v2 [cs.GT] UPDATED)",
    "abstract": "We analyze how interdependencies between organizations in financial networks can lead to multiple possible equilibrium outcomes. A multiplicity arises if and only if there exists a certain type of dependency cycle in the network that allows for self-fulfilling chains of defaults. We provide necessary and sufficient conditions for banks' solvency in any equilibrium. Building on these conditions, we characterize the minimum bailout payments needed to ensure systemic solvency, as well as how solvency can be ensured by guaranteeing a specific set of debt payments. Bailout injections needed to eliminate self-fulfilling cycles of defaults (credit freezes) are fully recoverable, while those needed to prevent cascading defaults outside of cycles are not. We show that the minimum bailout problem is computationally hard, but provide an upper bound on optimal payments and show that the problem has intuitive solutions in specific network structures such as those with disjoint cycles or a core-peri",
    "link": "http://arxiv.org/abs/2012.12861",
    "context": "Title: Credit Freezes, Equilibrium Multiplicity, and Optimal Bailouts in Financial Networks. (arXiv:2012.12861v2 [cs.GT] UPDATED)\nAbstract: We analyze how interdependencies between organizations in financial networks can lead to multiple possible equilibrium outcomes. A multiplicity arises if and only if there exists a certain type of dependency cycle in the network that allows for self-fulfilling chains of defaults. We provide necessary and sufficient conditions for banks' solvency in any equilibrium. Building on these conditions, we characterize the minimum bailout payments needed to ensure systemic solvency, as well as how solvency can be ensured by guaranteeing a specific set of debt payments. Bailout injections needed to eliminate self-fulfilling cycles of defaults (credit freezes) are fully recoverable, while those needed to prevent cascading defaults outside of cycles are not. We show that the minimum bailout problem is computationally hard, but provide an upper bound on optimal payments and show that the problem has intuitive solutions in specific network structures such as those with disjoint cycles or a core-peri",
    "path": "papers/20/12/2012.12861.json",
    "total_tokens": 1043,
    "translated_title": "冻结信用、平衡多样性和金融网络中的最佳紧急援助",
    "translated_abstract": "我们分析了金融网络中组织之间的相互依赖关系如何导致多种可能的平衡结果。只有在网络中存在某种类型的依赖循环时，才会出现多样性，从而产生自我实现的违约链条。我们提供了在任何平衡中确保银行偿债能力的充分必要条件。基于这些条件，我们对保证系统偿债能力所需的最低紧急援助支付进行了表征，以及如何通过担保特定的债务支付来确保偿债能力。用于消除自我实现的违约循环（信用冻结）的紧急援助注入是完全可恢复的，而用于防止循环之外的级联违约的紧急援助则不可恢复。我们表明最低紧急援助问题是计算难题，但提供了最优支付的上界，并且在特定网络结构中（如具有不相交循环或核心-边缘结构）该问题具有直观的解决方案。",
    "tldr": "我们研究了金融网络中组织之间的相互依赖关系如何导致多种可能的平衡结果，并提供了确保银行偿债能力的必要条件。我们还研究了保证系统偿债能力所需的最低紧急援助支付以及如何通过担保特定的债务支付来确保偿债能力。我们发现该问题是计算难题，但给出了问题的最优支付上界，并提供了特定网络结构下的解决方案。"
}