{
    "title": "No Need to Know Physics: Resilience of Process-based Model-free Anomaly Detection for Industrial Control Systems. (arXiv:2012.03586v2 [cs.CR] UPDATED)",
    "abstract": "In recent years, a number of process-based anomaly detection schemes for Industrial Control Systems were proposed. In this work, we provide the first systematic analysis of such schemes, and introduce a taxonomy of properties that are verified by those detection systems. We then present a novel general framework to generate adversarial spoofing signals that violate physical properties of the system, and use the framework to analyze four anomaly detectors published at top security conferences. We find that three of those detectors are susceptible to a number of adversarial manipulations (e.g., spoofing with precomputed patterns), which we call Synthetic Sensor Spoofing and one is resilient against our attacks. We investigate the root of its resilience and demonstrate that it comes from the properties that we introduced. Our attacks reduce the Recall (True Positive Rate) of the attacked schemes making them not able to correctly detect anomalies. Thus, the vulnerabilities we discovered in",
    "link": "http://arxiv.org/abs/2012.03586",
    "context": "Title: No Need to Know Physics: Resilience of Process-based Model-free Anomaly Detection for Industrial Control Systems. (arXiv:2012.03586v2 [cs.CR] UPDATED)\nAbstract: In recent years, a number of process-based anomaly detection schemes for Industrial Control Systems were proposed. In this work, we provide the first systematic analysis of such schemes, and introduce a taxonomy of properties that are verified by those detection systems. We then present a novel general framework to generate adversarial spoofing signals that violate physical properties of the system, and use the framework to analyze four anomaly detectors published at top security conferences. We find that three of those detectors are susceptible to a number of adversarial manipulations (e.g., spoofing with precomputed patterns), which we call Synthetic Sensor Spoofing and one is resilient against our attacks. We investigate the root of its resilience and demonstrate that it comes from the properties that we introduced. Our attacks reduce the Recall (True Positive Rate) of the attacked schemes making them not able to correctly detect anomalies. Thus, the vulnerabilities we discovered in",
    "path": "papers/20/12/2012.03586.json",
    "total_tokens": 991,
    "translated_title": "无需物理知识：基于过程的无模型异常检测在工业控制系统中的鲁棒性",
    "translated_abstract": "近年来，已经提出了许多基于过程的工业控制系统异常检测方案。本研究对此类方案进行了系统分析，并介绍了验证这些检测系统的属性分类法。然后，我们提出了一个新的通用框架来生成违反系统物理属性的对抗欺骗信号，并使用该框架来分析在顶级安全会议上发表的四个异常检测器。我们发现其中三个检测器容易受到许多对抗性操作（例如，使用预先计算的模式进行欺骗），我们称之为合成传感器欺骗，只有一个检测器对我们的攻击具有鲁棒性。我们研究了其鲁棒性的根源，并证明了来自我们引入的属性。我们的攻击降低了攻击方案的召回率（真阳性率），使它们无法正确检测异常。因此，我们发现的漏洞",
    "tldr": "本文对基于过程的工业控制系统异常检测方案进行了分析，并介绍了验证这些检测系统的属性分类法。该研究还提出了一种新的通用框架来生成违反系统物理属性的对抗欺骗信号。在已发表的四个检测器中，只有一个具有鲁棒性，其鲁棒性来自于属性的引入。通过攻击，我们成功降低了攻击方案的召回率。"
}