{
    "title": "Ontological Smart Contracts in OASIS: Ontology for Agents, Systems, and Integration of Services (Extended Version)",
    "abstract": "arXiv:2012.01410v4 Announce Type: replace  Abstract: In this contribution we extend an ontology for modelling agents and their interactions, called Ontology for Agents, Systems, and Integration of Services (in short, OASIS), with conditionals and ontological smart contracts (in short, OSCs). OSCs are ontological representations of smart contracts that allow to establish responsibilities and authorizations among agents and set agreements, whereas conditionals allow one to restrict and limit agent interactions, define activation mechanisms that trigger agent actions, and define constraints and contract terms on OSCs. Conditionals and OSCs, as defined in OASIS, are applied to extend with ontological capabilities digital public ledgers such as the blockchain and smart contracts implemented on it. We will also sketch the architecture of a framework based on the OASIS definition of OSCs that exploits the Ethereum platform and the Interplanetary File System.",
    "link": "https://arxiv.org/abs/2012.01410",
    "context": "Title: Ontological Smart Contracts in OASIS: Ontology for Agents, Systems, and Integration of Services (Extended Version)\nAbstract: arXiv:2012.01410v4 Announce Type: replace  Abstract: In this contribution we extend an ontology for modelling agents and their interactions, called Ontology for Agents, Systems, and Integration of Services (in short, OASIS), with conditionals and ontological smart contracts (in short, OSCs). OSCs are ontological representations of smart contracts that allow to establish responsibilities and authorizations among agents and set agreements, whereas conditionals allow one to restrict and limit agent interactions, define activation mechanisms that trigger agent actions, and define constraints and contract terms on OSCs. Conditionals and OSCs, as defined in OASIS, are applied to extend with ontological capabilities digital public ledgers such as the blockchain and smart contracts implemented on it. We will also sketch the architecture of a framework based on the OASIS definition of OSCs that exploits the Ethereum platform and the Interplanetary File System.",
    "path": "papers/20/12/2012.01410.json",
    "total_tokens": 714,
    "translated_title": "OASIS中的本体智能合约：代理、系统和服务集成的本体（扩展版）",
    "translated_abstract": "在这篇论文中，我们通过条件和本体智能合约（简称为OSCs）扩展了一种用于建模代理及其交互的本体，称为代理、系统和服务集成的本体（简称OASIS）。 OASIS中定义的条件和OSCs被应用于扩展具有本体能力的数字公共账本，如区块链和其上实施的智能合约。",
    "tldr": "本文扩展了一种用于代理建模的本体OASIS，引入了条件和本体智能合约（OSCs），将其应用于扩展区块链和智能合约，并提出了基于OASIS OSCs定义的框架架构。",
    "en_tdlr": "This paper extends the ontology OASIS for agent modeling by introducing conditionals and ontological smart contracts (OSCs), applies them to extend blockchain and smart contracts, and proposes a framework architecture based on OASIS OSCs definition."
}