{
    "title": "Learning to Rearrange Deformable Cables, Fabrics, and Bags with Goal-Conditioned Transporter Networks. (arXiv:2012.03385v4 [cs.RO] UPDATED)",
    "abstract": "Rearranging and manipulating deformable objects such as cables, fabrics, and bags is a long-standing challenge in robotic manipulation. The complex dynamics and high-dimensional configuration spaces of deformables, compared to rigid objects, make manipulation difficult not only for multi-step planning, but even for goal specification. Goals cannot be as easily specified as rigid object poses, and may involve complex relative spatial relations such as \"place the item inside the bag\". In this work, we develop a suite of simulated benchmarks with 1D, 2D, and 3D deformable structures, including tasks that involve image-based goal-conditioning and multi-step deformable manipulation. We propose embedding goal-conditioning into Transporter Networks, a recently proposed model architecture for learning robotic manipulation that rearranges deep features to infer displacements that can represent pick and place actions. In simulation and in physical experiments, we demonstrate that goal-conditione",
    "link": "http://arxiv.org/abs/2012.03385",
    "context": "Title: Learning to Rearrange Deformable Cables, Fabrics, and Bags with Goal-Conditioned Transporter Networks. (arXiv:2012.03385v4 [cs.RO] UPDATED)\nAbstract: Rearranging and manipulating deformable objects such as cables, fabrics, and bags is a long-standing challenge in robotic manipulation. The complex dynamics and high-dimensional configuration spaces of deformables, compared to rigid objects, make manipulation difficult not only for multi-step planning, but even for goal specification. Goals cannot be as easily specified as rigid object poses, and may involve complex relative spatial relations such as \"place the item inside the bag\". In this work, we develop a suite of simulated benchmarks with 1D, 2D, and 3D deformable structures, including tasks that involve image-based goal-conditioning and multi-step deformable manipulation. We propose embedding goal-conditioning into Transporter Networks, a recently proposed model architecture for learning robotic manipulation that rearranges deep features to infer displacements that can represent pick and place actions. In simulation and in physical experiments, we demonstrate that goal-conditione",
    "path": "papers/20/12/2012.03385.json",
    "total_tokens": 1025,
    "translated_title": "学习通过目标条件传输网络重新排列可变形电缆、织物和袋子",
    "translated_abstract": "重新排列和操作电缆、织物和袋子等可变形物体一直是机器人操作中的一个长期挑战。与刚性物体相比，可变形物体的复杂动力学和高维配置空间使得不仅对于多步规划，还包括目标规范，操作变得困难。目标不像刚性物体姿态那样容易规定，可能涉及复杂的相对空间关系，例如“把物品放在袋子里”。我们在这项工作中，开发了一套包含1D、2D和3D可变形结构的仿真基准测试，包括涉及基于图像的目标条件和多步可变形操作的任务。我们建议将目标条件嵌入Transporter Networks，这是一种最近提出的模型架构，用于学习机器人操控，并重排深层特征，以推断可以表示取放动作的位移。在仿真和物理实验中，我们证明了可以使用目标条件传输网络来学习操作具有复杂几何形状的可变形物体，并且可以成功执行涉及目标条件和多步操作的任务。我们的方法可应用于广泛的现实世界任务，包括机器人假肢和抓握精细物品。",
    "tldr": "本论文开发了一套仿真基准测试，提出将目标条件嵌入Transporter Networks来学习可变形物体操作，并证明该方法成功地执行了复杂目标条件和多步操作任务。",
    "en_tdlr": "This paper develops a suite of simulated benchmarks and proposes embedding goal-conditioning into Transporter Networks to learn deformable object manipulation, demonstrating success in performing complex goal-conditioned and multi-step manipulation tasks."
}