{
    "title": "Spectral-Spatial Global Graph Reasoning for Hyperspectral Image Classification. (arXiv:2106.13952v2 [cs.CV] UPDATED)",
    "abstract": "Convolutional neural networks have been widely applied to hyperspectral image classification. However, traditional convolutions can not effectively extract features for objects with irregular distributions. Recent methods attempt to address this issue by performing graph convolutions on spatial topologies, but fixed graph structures and local perceptions limit their performances. To tackle these problems, in this paper, different from previous approaches, we perform the superpixel generation on intermediate features during network training to adaptively produce homogeneous regions, obtain graph structures, and further generate spatial descriptors, which are served as graph nodes. Besides spatial objects, we also explore the graph relationships between channels by reasonably aggregating channels to generate spectral descriptors. The adjacent matrices in these graph convolutions are obtained by considering the relationships among all descriptors to realize global perceptions. By combinin",
    "link": "http://arxiv.org/abs/2106.13952",
    "context": "Title: Spectral-Spatial Global Graph Reasoning for Hyperspectral Image Classification. (arXiv:2106.13952v2 [cs.CV] UPDATED)\nAbstract: Convolutional neural networks have been widely applied to hyperspectral image classification. However, traditional convolutions can not effectively extract features for objects with irregular distributions. Recent methods attempt to address this issue by performing graph convolutions on spatial topologies, but fixed graph structures and local perceptions limit their performances. To tackle these problems, in this paper, different from previous approaches, we perform the superpixel generation on intermediate features during network training to adaptively produce homogeneous regions, obtain graph structures, and further generate spatial descriptors, which are served as graph nodes. Besides spatial objects, we also explore the graph relationships between channels by reasonably aggregating channels to generate spectral descriptors. The adjacent matrices in these graph convolutions are obtained by considering the relationships among all descriptors to realize global perceptions. By combinin",
    "path": "papers/21/06/2106.13952.json",
    "total_tokens": 911,
    "translated_title": "全局谱空间图推理用于高光谱图像分类",
    "translated_abstract": "卷积神经网络已广泛应用于高光谱图像分类。然而，传统的卷积在提取不规则分布物体的特征方面效果不佳。近期的方法尝试通过在空间拓扑上执行图卷积来解决这个问题，但固定的图结构和局部感知限制了它们的表现。本文提出了一种新方法，通过在网络训练过程中对中间特征进行超像素生成来适应性生成均质区域、获得图结构并进一步生成空间描述符，这些描述符被用作图节点。除了空间对象，我们还通过合理地聚合通道来生成光谱描述符来探索通道之间的图关系。这些图卷积中的邻接矩阵通过考虑所有描述符之间的关系来实现全局感知。在将光谱和空间信息结合到全局图推理框架中后，我们提出的方法在三个基准高光谱图像分类数据集上实现了最先进的性能。",
    "tldr": "本文提出了一种全局谱空间图推理框架，通过在网络训练中生成超像素并结合光谱和空间信息进行图卷积操作，实现了在三个基准高光谱图像分类数据集上的最先进性能。",
    "en_tdlr": "This paper proposes a spectral-spatial global graph reasoning framework for hyperspectral image classification, which combines spectral and spatial information through generating superpixels and performing graph convolutions, achieving state-of-the-art performance on three benchmark datasets."
}