{
    "title": "GeoT: A Geometry-aware Transformer for Reliable Molecular Property Prediction and Chemically Interpretable Representation Learning. (arXiv:2106.15516v3 [cs.LG] UPDATED)",
    "abstract": "In recent years, molecular representation learning has emerged as a key area of focus in various chemical tasks. However, many existing models fail to fully consider the geometric information of molecular structures, resulting in less intuitive representations. Moreover, the widely used message-passing mechanism is limited to provide the interpretation of experimental results from a chemical perspective. To address these challenges, we introduce a novel Transformer-based framework for molecular representation learning, named the Geometry-aware Transformer (GeoT). GeoT learns molecular graph structures through attention-based mechanisms specifically designed to offer reliable interpretability, as well as molecular property prediction. Consequently, GeoT can generate attention maps of interatomic relationships associated with training objectives. In addition, GeoT demonstrates comparable performance to MPNN-based models while achieving reduced computational complexity. Our comprehensive ",
    "link": "http://arxiv.org/abs/2106.15516",
    "context": "Title: GeoT: A Geometry-aware Transformer for Reliable Molecular Property Prediction and Chemically Interpretable Representation Learning. (arXiv:2106.15516v3 [cs.LG] UPDATED)\nAbstract: In recent years, molecular representation learning has emerged as a key area of focus in various chemical tasks. However, many existing models fail to fully consider the geometric information of molecular structures, resulting in less intuitive representations. Moreover, the widely used message-passing mechanism is limited to provide the interpretation of experimental results from a chemical perspective. To address these challenges, we introduce a novel Transformer-based framework for molecular representation learning, named the Geometry-aware Transformer (GeoT). GeoT learns molecular graph structures through attention-based mechanisms specifically designed to offer reliable interpretability, as well as molecular property prediction. Consequently, GeoT can generate attention maps of interatomic relationships associated with training objectives. In addition, GeoT demonstrates comparable performance to MPNN-based models while achieving reduced computational complexity. Our comprehensive ",
    "path": "papers/21/06/2106.15516.json",
    "total_tokens": 809,
    "translated_title": "GeoT:一种几何感知的Transformer模型用于可靠的分子属性预测和化学可解释表示学习",
    "translated_abstract": "近年来，分子表示学习已成为各种化学任务中的关键领域。然而，许多现有模型未能充分考虑分子结构的几何信息，导致表示不够直观。此外，广泛使用的消息传递机制局限于从化学角度解释实验结果。为了解决这些挑战，我们引入了一种新的基于Transformer的分子表示学习框架，称为几何感知Transformer（GeoT）。GeoT通过专门设计的基于注意力机制学习分子图结构，以提供可靠的解释性以及分子属性预测。因此，GeoT能够生成与训练目标相关联的原子间关系的注意力图。此外，GeoT展示了与基于MPNN模型相当的性能，同时实现了降低的计算复杂性。",
    "tldr": "GeoT是一种几何感知的Transformer模型，用于可靠的分子属性预测和化学可解释表示学习。它通过注意力机制学习分子图结构，并生成与训练目标相关联的注意力图。与基于MPNN模型相比，GeoT具有可比的性能，同时减少了计算复杂性。"
}