{
    "title": "Broadcasted Residual Learning for Efficient Keyword Spotting. (arXiv:2106.04140v4 [cs.SD] UPDATED)",
    "abstract": "Keyword spotting is an important research field because it plays a key role in device wake-up and user interaction on smart devices. However, it is challenging to minimize errors while operating efficiently in devices with limited resources such as mobile phones. We present a broadcasted residual learning method to achieve high accuracy with small model size and computational load. Our method configures most of the residual functions as 1D temporal convolution while still allows 2D convolution together using a broadcasted-residual connection that expands temporal output to frequency-temporal dimension. This residual mapping enables the network to effectively represent useful audio features with much less computation than conventional convolutional neural networks. We also propose a novel network architecture, Broadcasting-residual network (BC-ResNet), based on broadcasted residual learning and describe how to scale up the model according to the target device's resources. BC-ResNets ach",
    "link": "http://arxiv.org/abs/2106.04140",
    "context": "Title: Broadcasted Residual Learning for Efficient Keyword Spotting. (arXiv:2106.04140v4 [cs.SD] UPDATED)\nAbstract: Keyword spotting is an important research field because it plays a key role in device wake-up and user interaction on smart devices. However, it is challenging to minimize errors while operating efficiently in devices with limited resources such as mobile phones. We present a broadcasted residual learning method to achieve high accuracy with small model size and computational load. Our method configures most of the residual functions as 1D temporal convolution while still allows 2D convolution together using a broadcasted-residual connection that expands temporal output to frequency-temporal dimension. This residual mapping enables the network to effectively represent useful audio features with much less computation than conventional convolutional neural networks. We also propose a novel network architecture, Broadcasting-residual network (BC-ResNet), based on broadcasted residual learning and describe how to scale up the model according to the target device's resources. BC-ResNets ach",
    "path": "papers/21/06/2106.04140.json",
    "total_tokens": 993,
    "translated_title": "广播残差学习用于高效关键词检测",
    "translated_abstract": "关键词检测是一个重要的研究领域，因为它在智能设备的唤醒和用户交互中起着关键作用。然而，在资源有限的设备（如手机）上高效运行的同时最小化错误是具有挑战性的。我们提出了一种广播残差学习方法，以实现小模型尺寸和计算负载下的高准确性。我们的方法将大部分残差函数配置为1D时域卷积，同时使用广播残差连接将时域输出扩展到频率-时域维度，使网络能够有效地表示有用的音频特征，计算量比传统的卷积神经网络要少得多。我们还提出了一种新颖的网络架构，广播残差网络（BC-ResNet），基于广播残差学习，并描述了如何根据目标设备的资源来扩展模型。",
    "tldr": "本研究提出了一种广播残差学习方法，用于高效关键词检测。通过配置大部分残差函数为1D时域卷积，并使用广播残差连接将时域输出扩展到频率-时域维度，该方法能够以小模型尺寸和计算负载实现高准确性。此外，还提出了基于广播残差学习的广播残差网络（BC-ResNet），并介绍了如何根据目标设备的资源来扩展模型。"
}