{
    "title": "A Stochastic Sequential Quadratic Optimization Algorithm for Nonlinear Equality Constrained Optimization with Rank-Deficient Jacobians. (arXiv:2106.13015v2 [math.OC] UPDATED)",
    "abstract": "A sequential quadratic optimization algorithm is proposed for solving smooth nonlinear equality constrained optimization problems in which the objective function is defined by an expectation of a stochastic function. The algorithmic structure of the proposed method is based on a step decomposition strategy that is known in the literature to be widely effective in practice, wherein each search direction is computed as the sum of a normal step (toward linearized feasibility) and a tangential step (toward objective decrease in the null space of the constraint Jacobian). However, the proposed method is unique from others in the literature in that it both allows the use of stochastic objective gradient estimates and possesses convergence guarantees even in the setting in which the constraint Jacobians may be rank deficient. The results of numerical experiments demonstrate that the algorithm offers superior performance when compared to popular alternatives.",
    "link": "http://arxiv.org/abs/2106.13015",
    "context": "Title: A Stochastic Sequential Quadratic Optimization Algorithm for Nonlinear Equality Constrained Optimization with Rank-Deficient Jacobians. (arXiv:2106.13015v2 [math.OC] UPDATED)\nAbstract: A sequential quadratic optimization algorithm is proposed for solving smooth nonlinear equality constrained optimization problems in which the objective function is defined by an expectation of a stochastic function. The algorithmic structure of the proposed method is based on a step decomposition strategy that is known in the literature to be widely effective in practice, wherein each search direction is computed as the sum of a normal step (toward linearized feasibility) and a tangential step (toward objective decrease in the null space of the constraint Jacobian). However, the proposed method is unique from others in the literature in that it both allows the use of stochastic objective gradient estimates and possesses convergence guarantees even in the setting in which the constraint Jacobians may be rank deficient. The results of numerical experiments demonstrate that the algorithm offers superior performance when compared to popular alternatives.",
    "path": "papers/21/06/2106.13015.json",
    "total_tokens": 887,
    "translated_title": "一种用于具有秩缺失雅可比矩阵的非线性等式约束优化的随机顺序二次优化算法",
    "translated_abstract": "本文提出了一种针对定义为随机函数期望的平滑非线性等式约束优化问题的顺序二次优化算法。该算法的结构基于一种在文献上被广泛证明在实践中非常有效的步骤分解策略，其中每个搜索方向被计算为正常步骤（朝向线性化可行性）和切向步骤（朝向约束雅可比矩阵零空间内目标下降）的总和。然而，所提出的方法在文献中是独一无二的，因为它既允许使用随机目标梯度估计，又在约束雅可比矩阵可能秩缺失的情况下具有收敛保证。 数值实验的结果表明，与流行的替代方案相比，该算法具有更强的性能。",
    "tldr": "本研究提出了一种针对非线性等式约束优化的顺序二次优化算法，具备使用随机梯度和处理秩缺失雅可比矩阵的能力，实验结果表明其性能优于其他方法。",
    "en_tdlr": "This paper proposes a stochastic sequential quadratic optimization algorithm for smooth nonlinear equality constrained optimization problems with a stochastic objective function, which allows the use of stochastic objective gradient estimates and possesses convergence guarantees even in the setting in which the constraint Jacobians may be rank-deficient. Numerical experiments demonstrate that the algorithm offers superior performance when compared to popular alternatives."
}