{
    "title": "Contextualizing Meta-Learning via Learning to Decompose. (arXiv:2106.08112v2 [cs.LG] UPDATED)",
    "abstract": "Meta-learning has emerged as an efficient approach for constructing target models based on support sets. For example, the meta-learned embeddings enable the construction of target nearest-neighbor classifiers for specific tasks by pulling instances closer to their same-class neighbors. However, a single instance can be annotated from various latent attributes, making visually similar instances inside or across support sets have different labels and diverse relationships with others. Consequently, a uniform meta-learned strategy for inferring the target model from the support set fails to capture the instance-wise ambiguous similarity. To this end, we propose Learning to Decompose Network (LeadNet) to contextualize the meta-learned ``support-to-target'' strategy, leveraging the context of instances with one or mixed latent attributes in a support set. In particular, the comparison relationship between instances is decomposed w.r.t. multiple embedding spaces. LeadNet learns to automatica",
    "link": "http://arxiv.org/abs/2106.08112",
    "context": "Title: Contextualizing Meta-Learning via Learning to Decompose. (arXiv:2106.08112v2 [cs.LG] UPDATED)\nAbstract: Meta-learning has emerged as an efficient approach for constructing target models based on support sets. For example, the meta-learned embeddings enable the construction of target nearest-neighbor classifiers for specific tasks by pulling instances closer to their same-class neighbors. However, a single instance can be annotated from various latent attributes, making visually similar instances inside or across support sets have different labels and diverse relationships with others. Consequently, a uniform meta-learned strategy for inferring the target model from the support set fails to capture the instance-wise ambiguous similarity. To this end, we propose Learning to Decompose Network (LeadNet) to contextualize the meta-learned ``support-to-target'' strategy, leveraging the context of instances with one or mixed latent attributes in a support set. In particular, the comparison relationship between instances is decomposed w.r.t. multiple embedding spaces. LeadNet learns to automatica",
    "path": "papers/21/06/2106.08112.json",
    "total_tokens": 876,
    "translated_title": "通过学习解耦来对元学习进行上下文化",
    "translated_abstract": "元学习已经成为一种基于支持集构建目标模型的高效方法。例如，元学习嵌入使得可以通过将实例拉近到同类邻居来构建特定任务的目标最近邻分类器。然而，单个实例可以从多个潜在属性进行注释，使得在支持集内部或跨支持集的看似相似的实例具有不同的标签和与其他实例的多样关系。因此，对于从支持集推断目标模型的统一元学习策略无法捕捉到实例级的模糊相似性。为此，我们提出了一种学习解耦网络（LeadNet），以在支持集中利用具有一种或混合潜在属性的实例的上下文对元学习的“支持到目标”策略进行上下文化。特别是，实例之间的比较关系在多个嵌入空间中进行解耦。LeadNet学习自动化地...（待完整翻译）",
    "tldr": "通过学习解耦的方法，我们提出了一种上下文化的元学习策略，用于从支持集中推断目标模型。我们的方法能够捕捉到实例级的模糊相似性，从而提高了模型的性能和泛化能力。",
    "en_tdlr": "We propose a contextualized meta-learning strategy using a learning to decompose approach, which enhances model performance and generalization by capturing instance-level ambiguous similarity in support sets."
}