{
    "title": "Real-time Outdoor Localization Using Radio Maps: A Deep Learning Approach. (arXiv:2106.12556v4 [cs.LG] UPDATED)",
    "abstract": "Global Navigation Satellite Systems typically perform poorly in urban environments, where the likelihood of line-of-sight conditions between devices and satellites is low. Therefore, alternative location methods are required to achieve good accuracy. We present LocUNet: A convolutional, end-to-end trained neural network (NN) for the localization task, which is able to estimate the position of a user from the received signal strength (RSS) of a small number of Base Stations (BS). Using estimations of pathloss radio maps of the BSs and the RSS measurements of the users to be localized, LocUNet can localize users with state-of-the-art accuracy and enjoys high robustness to inaccuracies in the estimations of radio maps. The proposed method does not require generating RSS fingerprints of each specific area where the localization task is performed and is suitable for real-time applications. Moreover, two novel datasets that allow for numerical evaluations of RSS and ToA methods in realistic ",
    "link": "http://arxiv.org/abs/2106.12556",
    "context": "Title: Real-time Outdoor Localization Using Radio Maps: A Deep Learning Approach. (arXiv:2106.12556v4 [cs.LG] UPDATED)\nAbstract: Global Navigation Satellite Systems typically perform poorly in urban environments, where the likelihood of line-of-sight conditions between devices and satellites is low. Therefore, alternative location methods are required to achieve good accuracy. We present LocUNet: A convolutional, end-to-end trained neural network (NN) for the localization task, which is able to estimate the position of a user from the received signal strength (RSS) of a small number of Base Stations (BS). Using estimations of pathloss radio maps of the BSs and the RSS measurements of the users to be localized, LocUNet can localize users with state-of-the-art accuracy and enjoys high robustness to inaccuracies in the estimations of radio maps. The proposed method does not require generating RSS fingerprints of each specific area where the localization task is performed and is suitable for real-time applications. Moreover, two novel datasets that allow for numerical evaluations of RSS and ToA methods in realistic ",
    "path": "papers/21/06/2106.12556.json",
    "total_tokens": 871,
    "translated_title": "基于射频地图的实时室外定位：一种深度学习方法",
    "translated_abstract": "全球导航卫星系统在城市环境下表现通常较差，因此需要使用其他定位方法来实现较高的定位精度。本文提出了LocUNet：一种卷积、端到端训练的神经网络，用于定位任务，能够从少量基站的接收信号强度(RSS)估计用户的位置。使用基站的路径损耗射频地图的估计值和待定位用户的RSS测量值，LocUNet可以以最先进的精度定位用户，并具有较高的鲁棒性，可以适应射频地图估计不准确的情况。所提出的方法不需要生成每个特定区域的RSS指纹，并适用于实时应用。此外，创建并公开了两种新的数据集，可用于评估在现实室外场景中的RSS和ToA方法。",
    "tldr": "本文提出了一种使用射频地图进行实时室外定位的深度学习方法，能够实现高精度定位并具有较高的鲁棒性，适用于实时应用，并提供了两种新的数据集用于评估。",
    "en_tdlr": "This paper proposes a deep learning method for real-time outdoor localization using radio maps, which achieves high accuracy and robustness, is suitable for real-time applications, and provides two new datasets for evaluation in realistic outdoor scenarios."
}