{
    "title": "Detecting Errors and Estimating Accuracy on Unlabeled Data with Self-training Ensembles. (arXiv:2106.15728v4 [cs.LG] UPDATED)",
    "abstract": "When a deep learning model is deployed in the wild, it can encounter test data drawn from distributions different from the training data distribution and suffer drop in performance. For safe deployment, it is essential to estimate the accuracy of the pre-trained model on the test data. However, the labels for the test inputs are usually not immediately available in practice, and obtaining them can be expensive. This observation leads to two challenging tasks: (1) unsupervised accuracy estimation, which aims to estimate the accuracy of a pre-trained classifier on a set of unlabeled test inputs; (2) error detection, which aims to identify mis-classified test inputs. In this paper, we propose a principled and practically effective framework that simultaneously addresses the two tasks. The proposed framework iteratively learns an ensemble of models to identify mis-classified data points and performs self-training to improve the ensemble with the identified points. Theoretical analysis demo",
    "link": "http://arxiv.org/abs/2106.15728",
    "context": "Title: Detecting Errors and Estimating Accuracy on Unlabeled Data with Self-training Ensembles. (arXiv:2106.15728v4 [cs.LG] UPDATED)\nAbstract: When a deep learning model is deployed in the wild, it can encounter test data drawn from distributions different from the training data distribution and suffer drop in performance. For safe deployment, it is essential to estimate the accuracy of the pre-trained model on the test data. However, the labels for the test inputs are usually not immediately available in practice, and obtaining them can be expensive. This observation leads to two challenging tasks: (1) unsupervised accuracy estimation, which aims to estimate the accuracy of a pre-trained classifier on a set of unlabeled test inputs; (2) error detection, which aims to identify mis-classified test inputs. In this paper, we propose a principled and practically effective framework that simultaneously addresses the two tasks. The proposed framework iteratively learns an ensemble of models to identify mis-classified data points and performs self-training to improve the ensemble with the identified points. Theoretical analysis demo",
    "path": "papers/21/06/2106.15728.json",
    "total_tokens": 827,
    "translated_title": "通过自学习集合在无标签数据上检测错误并估计准确性",
    "translated_abstract": "当深度学习模型在未知分布的测试数据上运行时，它会遭遇到性能下降的情况。为了安全部署，需要对预训练模型在测试数据上的准确性进行估算。然而，在实践中，测试集的标注通常不会立即提供，并且获得它们可能是昂贵的。本文提出了一个实用、有原则的框架，同时解决了两个挑战性任务：（1）无监督准确性估计，目的是估计预先训练分类器在一组无标签测试样本上的准确性；（2）错误检测，目的是识别被错误分类的测试样本。所提出的框架迭代地学习了一个集合模型来识别被错误分类的数据点，并通过自学习来改进集合模型。理论分析演示了该框架的包容性和正确性。",
    "tldr": "本文提出了一种利用自学习集合框架，同时解决无标签数据上的误差检测和准确性估计的方法。",
    "en_tdlr": "This paper proposes a framework that uses self-training ensembles to simultaneously address error detection and accuracy estimation on unlabeled data."
}