{
    "title": "Intergenerational risk sharing in a Defined Contribution pension system: analysis with Bayesian optimization. (arXiv:2106.13644v3 [econ.GN] UPDATED)",
    "abstract": "We study a fully funded, collective defined-contribution (DC) pension system with multiple overlapping generations. We investigate whether the welfare of participants can be improved by intergenerational risk sharing (IRS) implemented with a realistic investment strategy (e.g., no borrowing) and without an outside entity (e.g., share holders) that helps finance the pension fund. To implement IRS, the pension system uses an automatic adjustment rule for the indexation of individual accounts, which adapts to the notional funding ratio of the pension system. The pension system has two parameters that determine the investment strategy and the strength of the adjustment rule, which are optimized by expected utility maximization using Bayesian optimization. The volatility of the retirement benefits and that of the funding ratio are analyzed, and it is shown that the trade-off between them can be controlled by the optimal adjustment parameter to attain IRS. Compared with the optimal individua",
    "link": "http://arxiv.org/abs/2106.13644",
    "context": "Title: Intergenerational risk sharing in a Defined Contribution pension system: analysis with Bayesian optimization. (arXiv:2106.13644v3 [econ.GN] UPDATED)\nAbstract: We study a fully funded, collective defined-contribution (DC) pension system with multiple overlapping generations. We investigate whether the welfare of participants can be improved by intergenerational risk sharing (IRS) implemented with a realistic investment strategy (e.g., no borrowing) and without an outside entity (e.g., share holders) that helps finance the pension fund. To implement IRS, the pension system uses an automatic adjustment rule for the indexation of individual accounts, which adapts to the notional funding ratio of the pension system. The pension system has two parameters that determine the investment strategy and the strength of the adjustment rule, which are optimized by expected utility maximization using Bayesian optimization. The volatility of the retirement benefits and that of the funding ratio are analyzed, and it is shown that the trade-off between them can be controlled by the optimal adjustment parameter to attain IRS. Compared with the optimal individua",
    "path": "papers/21/06/2106.13644.json",
    "total_tokens": 949,
    "translated_title": "基于贝叶斯优化的定义贡献养老金制度中代际风险共担研究",
    "translated_abstract": "本文研究了一个面向多个重叠代际的完全资本化、集体定义贡献（DC）养老金制度。我们调查了通过代际风险共担（IRS）实现养老金自动调整与投资策略适配的方法，以提高参与者的福利。我们使用了一个自动调整规则来调整个人账户的指数化，该规则根据养老金制度的名义资金比率进行调整。该养老金制度有两个参数，确定了投资策略和调整规则的强度，并通过贝叶斯优化的预期效用最大化来优化。我们分析了退休福利波动和融资比率波动，显示通过最优调整参数控制它们之间的平衡可以实现IRS。与最佳个人投资策略相比，我们的结果表明，IRS可以显著提高参与者的实用效用。",
    "tldr": "本文研究了一种多重代际情况下的定义贡献养老金制度，通过贝叶斯优化实现代际风险共担以提高参与者福利，结果表明代际风险共担可以显著提高实用效用。",
    "en_tdlr": "This paper studies a defined-contribution pension system with multiple overlapping generations and investigates the intergenerational risk sharing (IRS) to improve the welfare of participants through Bayesian optimization. The automatic adjustment rule for individual accounts is used to adapt to the funding ratio of the pension system, and two parameters are optimized for expected utility maximization. The results show that IRS can significantly improve the practical utility of participants compared to the optimal individual investment strategy."
}