{
    "title": "Physics-Guided Discovery of Highly Nonlinear Parametric Partial Differential Equations. (arXiv:2106.01078v4 [cs.LG] UPDATED)",
    "abstract": "Partial differential equations (PDEs) that fit scientific data can represent physical laws with explainable mechanisms for various mathematically-oriented subjects, such as physics and finance. The data-driven discovery of PDEs from scientific data thrives as a new attempt to model complex phenomena in nature, but the effectiveness of current practice is typically limited by the scarcity of data and the complexity of phenomena. Especially, the discovery of PDEs with highly nonlinear coefficients from low-quality data remains largely under-addressed. To deal with this challenge, we propose a novel physics-guided learning method, which can not only encode observation knowledge such as initial and boundary conditions but also incorporate the basic physical principles and laws to guide the model optimization. We theoretically show that our proposed method strictly reduces the coefficient estimation error of existing baselines, and is also robust against noise. Extensive experiments show th",
    "link": "http://arxiv.org/abs/2106.01078",
    "context": "Title: Physics-Guided Discovery of Highly Nonlinear Parametric Partial Differential Equations. (arXiv:2106.01078v4 [cs.LG] UPDATED)\nAbstract: Partial differential equations (PDEs) that fit scientific data can represent physical laws with explainable mechanisms for various mathematically-oriented subjects, such as physics and finance. The data-driven discovery of PDEs from scientific data thrives as a new attempt to model complex phenomena in nature, but the effectiveness of current practice is typically limited by the scarcity of data and the complexity of phenomena. Especially, the discovery of PDEs with highly nonlinear coefficients from low-quality data remains largely under-addressed. To deal with this challenge, we propose a novel physics-guided learning method, which can not only encode observation knowledge such as initial and boundary conditions but also incorporate the basic physical principles and laws to guide the model optimization. We theoretically show that our proposed method strictly reduces the coefficient estimation error of existing baselines, and is also robust against noise. Extensive experiments show th",
    "path": "papers/21/06/2106.01078.json",
    "total_tokens": 875,
    "translated_title": "物理引导下高度非线性参数偏微分方程的发现",
    "translated_abstract": "能够拟合科学数据的偏微分方程（PDE）可以代表多种以数学为导向的学科，例如物理和金融的可解释机制的物理定律。从科学数据中数据驱动地发现偏微分方程是一种模拟自然界中复杂现象的新尝试，但目前的实践效果通常受到数据稀缺性和现象复杂性的限制。特别地，从低质量数据中发现高度非线性系数的PDE仍然面临着相对不足的挑战。为了解决这一难题，我们提出了一种新的物理引导学习方法，既可以编码初值和边界条件等观察知识，也可以纳入基本的物理原理和定律来指导模型优化。我们理论上证明了我们提出的方法严格减小了现有基线系数估计误差，并且还抗噪音鲁棒性高。大量实验证明了该方法在不同数据集和度数系数下的准确性和实用性。",
    "tldr": "该论文提出了一种新的物理引导学习方法，能够从数据中发现高度非线性参数偏微分方程，同时具有更好的鲁棒性和准确性。",
    "en_tdlr": "The paper proposes a novel physics-guided learning method for discovering highly nonlinear parametric partial differential equations from data, which offers better robustness and accuracy."
}