{
    "title": "Meta-Calibration: Learning of Model Calibration Using Differentiable Expected Calibration Error. (arXiv:2106.09613v3 [cs.LG] UPDATED)",
    "abstract": "Calibration of neural networks is a topical problem that is becoming more and more important as neural networks increasingly underpin real-world applications. The problem is especially noticeable when using modern neural networks, for which there is a significant difference between the confidence of the model and the probability of correct prediction. Various strategies have been proposed to improve calibration, yet accurate calibration remains challenging. We propose a novel framework with two contributions: introducing a new differentiable surrogate for expected calibration error (DECE) that allows calibration quality to be directly optimised, and a meta-learning framework that uses DECE to optimise for validation set calibration with respect to model hyper-parameters. The results show that we achieve competitive performance with existing calibration approaches. Our framework opens up a new avenue and toolset for tackling calibration, which we believe will inspire further work on thi",
    "link": "http://arxiv.org/abs/2106.09613",
    "context": "Title: Meta-Calibration: Learning of Model Calibration Using Differentiable Expected Calibration Error. (arXiv:2106.09613v3 [cs.LG] UPDATED)\nAbstract: Calibration of neural networks is a topical problem that is becoming more and more important as neural networks increasingly underpin real-world applications. The problem is especially noticeable when using modern neural networks, for which there is a significant difference between the confidence of the model and the probability of correct prediction. Various strategies have been proposed to improve calibration, yet accurate calibration remains challenging. We propose a novel framework with two contributions: introducing a new differentiable surrogate for expected calibration error (DECE) that allows calibration quality to be directly optimised, and a meta-learning framework that uses DECE to optimise for validation set calibration with respect to model hyper-parameters. The results show that we achieve competitive performance with existing calibration approaches. Our framework opens up a new avenue and toolset for tackling calibration, which we believe will inspire further work on thi",
    "path": "papers/21/06/2106.09613.json",
    "total_tokens": 879,
    "translated_title": "元校准：使用可微之期望校准误差学习模型校准",
    "translated_abstract": "神经网络的校准是一个重要的问题，在神经网络越来越多地应用于现实世界应用的情况下，变得越来越重要。当使用现代神经网络时，模型的置信度与正确预测的概率之间存在明显差异，这一问题尤为明显。已经提出了各种策略来改善校准，但准确的校准仍然具有挑战性。我们提出了一个新的框架，包含两个贡献：引入了一个新的可微代理指标，用于直接优化校准质量的期望校准误差 (DECE)，以及一个元学习框架，使用DECE根据模型超参数优化验证集校准。结果表明，我们的方法在校准方面具有竞争性能。我们的框架为处理校准问题开辟了新的途径和工具，我们相信这将激发更多研究。",
    "tldr": "本论文提出了元校准框架，通过引入可微的期望校准误差代理指标和元学习框架，实现了对模型校准质量的直接优化。实验证明，该方法能够达到与现有校准方法相竞争的性能表现。该框架为进一步解决校准问题提供了新的思路和工具。"
}