{
    "title": "Quantal Response Equilibrium and Rationalizability: Inside the Black Box",
    "abstract": "arXiv:2106.16081v3 Announce Type: replace  Abstract: This paper aims to connect epistemic and behavioral game theory by examining the epistemic foundations of quantal response equilibrium (QRE) in static games. We focus on how much information agents possess about the probability distributions of idiosyncratic payoff shocks, in addition to the standard assumptions of rationality and common belief in rationality. When these distributions are transparent, we obtain a solution concept called $\\Delta^p$-rationalizability, which includes action distributions derived from QRE; we also give a condition under which this relationship holds true in reverse. When agents only have common belief in the monotonicity of these distributions (for example, extreme value distributions), we obtain another solution concept called $\\Delta^M$-rationalizability, which includes action distributions derived from rank-dependent choice equilibrium, a parameter-free variant of QRE. Our solution concepts also provi",
    "link": "https://arxiv.org/abs/2106.16081",
    "context": "Title: Quantal Response Equilibrium and Rationalizability: Inside the Black Box\nAbstract: arXiv:2106.16081v3 Announce Type: replace  Abstract: This paper aims to connect epistemic and behavioral game theory by examining the epistemic foundations of quantal response equilibrium (QRE) in static games. We focus on how much information agents possess about the probability distributions of idiosyncratic payoff shocks, in addition to the standard assumptions of rationality and common belief in rationality. When these distributions are transparent, we obtain a solution concept called $\\Delta^p$-rationalizability, which includes action distributions derived from QRE; we also give a condition under which this relationship holds true in reverse. When agents only have common belief in the monotonicity of these distributions (for example, extreme value distributions), we obtain another solution concept called $\\Delta^M$-rationalizability, which includes action distributions derived from rank-dependent choice equilibrium, a parameter-free variant of QRE. Our solution concepts also provi",
    "path": "papers/21/06/2106.16081.json",
    "total_tokens": 908,
    "translated_title": "定量反应均衡和合理性：黑匣子内部",
    "translated_abstract": "这篇论文旨在通过研究静态博弈中的定量反应均衡（QRE）的认识基础，将认识论和行为博弈理论联系起来。我们关注代理人对个性化收益冲击的概率分布有多少信息，除了合理性和共同信念合理性的标准假设之外。当这些分布是透明的时，我们得到一个称为$\\Delta^p$-合理性的解决方案概念，其中包括从QRE导出的行动分布；我们还给出一个条件，根据这个条件，该关系成立。当代理人只有对这些分布单调性的共同信念（例如，极值分布）时，我们得到另一个解决方案概念，称为$\\Delta^M$-合理性，其中包括从基于排名的选择均衡导出的行动分布，这是QRE的一个无参数变体。我们的解决方案概念还提供了",
    "tldr": "该论文通过研究定量反应均衡的认识基础，提出了$\\Delta^p$-合理性和$\\Delta^M$-合理性这两个解决方案概念，分别包含了从QRE和基于排名的选择均衡导出的行动分布。",
    "en_tdlr": "This paper explores the epistemic foundations of quantal response equilibrium (QRE) in static games, introducing solution concepts $\\Delta^p$-rationalizability and $\\Delta^M$-rationalizability which encompass action distributions derived from QRE and rank-dependent choice equilibrium respectively."
}