{
    "title": "Encoding physics to learn reaction-diffusion processes. (arXiv:2106.04781v2 [cs.LG] UPDATED)",
    "abstract": "Modeling complex spatiotemporal dynamical systems, such as the reaction-diffusion processes, have largely relied on partial differential equations (PDEs). However, due to insufficient prior knowledge on some under-explored dynamical systems, such as those in chemistry, biology, geology, physics and ecology, and the lack of explicit PDE formulation used for describing the nonlinear process of the system variables, to predict the evolution of such a system remains a challenging task. Unifying measurement data and our limited prior physics knowledge via machine learning provides us with a new path to solving this problem. Existing physics-informed learning paradigms impose physics laws through soft penalty constraints, whose solution quality largely depends on a trial-and-error proper setting of hyperparameters. Since the core of such methods is still rooted in black-box neural networks, the resulting model generally lacks interpretability and suffers from critical issues of extrapolation",
    "link": "http://arxiv.org/abs/2106.04781",
    "context": "Title: Encoding physics to learn reaction-diffusion processes. (arXiv:2106.04781v2 [cs.LG] UPDATED)\nAbstract: Modeling complex spatiotemporal dynamical systems, such as the reaction-diffusion processes, have largely relied on partial differential equations (PDEs). However, due to insufficient prior knowledge on some under-explored dynamical systems, such as those in chemistry, biology, geology, physics and ecology, and the lack of explicit PDE formulation used for describing the nonlinear process of the system variables, to predict the evolution of such a system remains a challenging task. Unifying measurement data and our limited prior physics knowledge via machine learning provides us with a new path to solving this problem. Existing physics-informed learning paradigms impose physics laws through soft penalty constraints, whose solution quality largely depends on a trial-and-error proper setting of hyperparameters. Since the core of such methods is still rooted in black-box neural networks, the resulting model generally lacks interpretability and suffers from critical issues of extrapolation",
    "path": "papers/21/06/2106.04781.json",
    "total_tokens": 836,
    "translated_title": "将物理建模用于学习反应-扩散过程",
    "translated_abstract": "建模复杂的时空动态系统，例如反应-扩散过程，大多依赖于偏微分方程(PDE)。然而，由于一些尚未充分探索的动态系统（如化学、生物、地质、物理和生态系统）缺乏先验知识，且用于描述系统变量非线性过程的PDE公式不明确，因此预测这种系统的演化仍然是一个具有挑战性的任务。通过机器学习将测量数据和有限的先验物理知识统一起来，为我们提供了解决这个问题的新途径。现有的物理信息学习范式通过软约束惩罚实施物理定律，其解决方案的质量主要取决于超参数的试错适当设置。由于这些方法的核心仍然根植于黑盒神经网络，所得模型通常缺乏可解释性并且存在外推的重要问题。",
    "tldr": "通过将测量数据和物理知识的有限先验统一来进行机器学习提供了一种新的解决非线性反应-扩散过程的途径。"
}