{
    "title": "DiGS : Divergence guided shape implicit neural representation for unoriented point clouds. (arXiv:2106.10811v3 [cs.CV] UPDATED)",
    "abstract": "Shape implicit neural representations (INRs) have recently shown to be effective in shape analysis and reconstruction tasks. Existing INRs require point coordinates to learn the implicit level sets of the shape. When a normal vector is available for each point, a higher fidelity representation can be learned, however normal vectors are often not provided as raw data. Furthermore, the method's initialization has been shown to play a crucial role for surface reconstruction. In this paper, we propose a divergence guided shape representation learning approach that does not require normal vectors as input. We show that incorporating a soft constraint on the divergence of the distance function favours smooth solutions that reliably orients gradients to match the unknown normal at each point, in some cases even better than approaches that use ground truth normal vectors directly. Additionally, we introduce a novel geometric initialization method for sinusoidal INRs that further improves conve",
    "link": "http://arxiv.org/abs/2106.10811",
    "context": "Title: DiGS : Divergence guided shape implicit neural representation for unoriented point clouds. (arXiv:2106.10811v3 [cs.CV] UPDATED)\nAbstract: Shape implicit neural representations (INRs) have recently shown to be effective in shape analysis and reconstruction tasks. Existing INRs require point coordinates to learn the implicit level sets of the shape. When a normal vector is available for each point, a higher fidelity representation can be learned, however normal vectors are often not provided as raw data. Furthermore, the method's initialization has been shown to play a crucial role for surface reconstruction. In this paper, we propose a divergence guided shape representation learning approach that does not require normal vectors as input. We show that incorporating a soft constraint on the divergence of the distance function favours smooth solutions that reliably orients gradients to match the unknown normal at each point, in some cases even better than approaches that use ground truth normal vectors directly. Additionally, we introduce a novel geometric initialization method for sinusoidal INRs that further improves conve",
    "path": "papers/21/06/2106.10811.json",
    "total_tokens": 953,
    "translated_title": "DiGS：基于散度导向的未定向点云形状隐式神经表示",
    "translated_abstract": "形状隐式神经表示（INR）最近已经在形状分析和重建任务中表现出有效性。现有的INR需要几何坐标来学习形状的隐式水平集。当每个点都有法向量时，可以学习到更高保真度的表示，然而通常原始数据中很少提供法向量。此外，已经表明方法的初始化对于表面重构起着至关重要的作用。在本文中，我们提出了一种不需要法向量作为输入的散度导向形状表示学习方法。我们展示了在距离函数的散度上添加软约束会倾向于平滑的解决方案，从而可靠地定位每个点的未知法向量的梯度，某些情况下甚至比直接使用地面真实法向量的方法表现得更好。此外，我们还引入了一种新的正弦INR几何初始化方法，进一步改善了收敛性能。",
    "tldr": "本文提出了一种新的散度导向形状表示学习方法，无需输入法向量，以软约束倾向于平滑解决方案，可靠地定位每个点的未知法向量的梯度，甚至比使用真实法向量更好。此外，还引入了一种新的正弦INR几何初始化方法，以进一步提高收敛性能。",
    "en_tdlr": "This paper proposes a novel divergence guided shape representation learning approach that does not require input of normal vectors. By incorporating a soft constraint on the divergence of the distance function, the method favors smooth solutions that reliably orient gradients to match the unknown normal at each point, sometimes even better than using ground truth normal vectors directly. Additionally, a new geometric initialization method for sinusoidal INRs is introduced to further improve convergence performance."
}