{
    "title": "Auto-NBA: Efficient and Effective Search Over the Joint Space of Networks, Bitwidths, and Accelerators. (arXiv:2106.06575v2 [cs.LG] UPDATED)",
    "abstract": "While maximizing deep neural networks' (DNNs') acceleration efficiency requires a joint search/design of three different yet highly coupled aspects, including the networks, bitwidths, and accelerators, the challenges associated with such a joint search have not yet been fully understood and addressed. The key challenges include (1) the dilemma of whether to explode the memory consumption due to the huge joint space or achieve sub-optimal designs, (2) the discrete nature of the accelerator design space that is coupled yet different from that of the networks and bitwidths, and (3) the chicken and egg problem associated with network-accelerator co-search, i.e., co-search requires operation-wise hardware cost, which is lacking during search as the optimal accelerator depending on the whole network is still unknown during search. To tackle these daunting challenges towards optimal and fast development of DNN accelerators, we propose a framework dubbed Auto-NBA to enable jointly searching fo",
    "link": "http://arxiv.org/abs/2106.06575",
    "context": "Title: Auto-NBA: Efficient and Effective Search Over the Joint Space of Networks, Bitwidths, and Accelerators. (arXiv:2106.06575v2 [cs.LG] UPDATED)\nAbstract: While maximizing deep neural networks' (DNNs') acceleration efficiency requires a joint search/design of three different yet highly coupled aspects, including the networks, bitwidths, and accelerators, the challenges associated with such a joint search have not yet been fully understood and addressed. The key challenges include (1) the dilemma of whether to explode the memory consumption due to the huge joint space or achieve sub-optimal designs, (2) the discrete nature of the accelerator design space that is coupled yet different from that of the networks and bitwidths, and (3) the chicken and egg problem associated with network-accelerator co-search, i.e., co-search requires operation-wise hardware cost, which is lacking during search as the optimal accelerator depending on the whole network is still unknown during search. To tackle these daunting challenges towards optimal and fast development of DNN accelerators, we propose a framework dubbed Auto-NBA to enable jointly searching fo",
    "path": "papers/21/06/2106.06575.json",
    "total_tokens": 873,
    "translated_title": "Auto-NBA: 针对网络、比特宽度和加速器三个联合空间进行高效搜索的算法",
    "translated_abstract": "要同时优化和加速深度神经网络，需要联合考虑三个不同却高度耦合的方面：网络、比特宽度和加速器。然而，联合搜索面临的挑战尚未被完全理解和解决。这些关键挑战包括（1）是否扩大由于巨大联合空间而导致的内存消耗，还是采用次优设计，（2）加速器设计空间的离散性与网络和比特宽度设计空间相耦合且不同，以及（3）网络-加速器联合搜索中的“鸡生蛋蛋生鸡”问题：即联合搜索需要计算操作的硬件成本，然而在搜索期间，尚不知道整个网络的最佳加速器，因此无法计算这些成本。为了解决这些问题，我们提出了一个名为Auto-NBA的框架，以实现针对网络、比特宽度和加速器三个联合空间的高效搜索。",
    "tldr": "Auto-NBA是一种能够高效搜索深度神经网络加速器的算法，它可以同时考虑优化网络、比特宽度和加速器三个耦合的方面。"
}