{
    "title": "Context-tree weighting for real-valued time series: Bayesian inference with hierarchical mixture models. (arXiv:2106.03023v4 [stat.ME] UPDATED)",
    "abstract": "Real-valued time series are ubiquitous in the sciences and engineering. In this work, a general, hierarchical Bayesian modelling framework is developed for building mixture models for times series. This development is based, in part, on the use of context trees, and it includes a collection of effective algorithmic tools for learning and inference. A discrete context (or 'state') is extracted for each sample, consisting of a discretised version of some of the most recent observations preceding it. The set of all relevant contexts are represented as a discrete context-tree. At the bottom level, a different real-valued time series model is associated with each context-state, i.e., with each leaf of the tree. This defines a very general framework that can be used in conjunction with any existing model class to build flexible and interpretable mixture models. Extending the idea of context-tree weighting leads to algorithms that allow for efficient, exact Bayesian inference in this setting.",
    "link": "http://arxiv.org/abs/2106.03023",
    "context": "Title: Context-tree weighting for real-valued time series: Bayesian inference with hierarchical mixture models. (arXiv:2106.03023v4 [stat.ME] UPDATED)\nAbstract: Real-valued time series are ubiquitous in the sciences and engineering. In this work, a general, hierarchical Bayesian modelling framework is developed for building mixture models for times series. This development is based, in part, on the use of context trees, and it includes a collection of effective algorithmic tools for learning and inference. A discrete context (or 'state') is extracted for each sample, consisting of a discretised version of some of the most recent observations preceding it. The set of all relevant contexts are represented as a discrete context-tree. At the bottom level, a different real-valued time series model is associated with each context-state, i.e., with each leaf of the tree. This defines a very general framework that can be used in conjunction with any existing model class to build flexible and interpretable mixture models. Extending the idea of context-tree weighting leads to algorithms that allow for efficient, exact Bayesian inference in this setting.",
    "path": "papers/21/06/2106.03023.json",
    "total_tokens": 933,
    "translated_title": "带层次混合模型的实值时间序列上下文树加权的贝叶斯推断",
    "translated_abstract": "实值时间序列在科学和工程中非常普遍。本文开发了一个通用的、层次贝叶斯建模框架，用于构建时间序列的混合模型。该框架基于上下文树的使用，并包括一组有效的学习和推断算法工具。为每个样本提取一个离散上下文（或“状态”），其中包括其之前的一些最新观测的离散化版本。所有相关上下文的集合表示为离散上下文树。在最底层，将不同的实值时间序列模型与每个上下文状态（即树的每个叶子）相关联。这定义了一个非常通用的框架，可与任何现有模型类一起使用，以构建灵活且可解释的混合模型。扩展上下文树加权的想法会导致一些算法，允许在此设置中进行高效、确切的贝叶斯推断。",
    "tldr": "本文提出了一个通用的贝叶斯建模框架，用于构建实值时间序列的混合模型。基于上下文树的使用并包含了一组有效算法工具，可以与任何现有模型类一起使用，构建灵活且可解释的混合模型。",
    "en_tdlr": "This paper proposes a general Bayesian modeling framework for building mixture models for real-valued time series, which is based on the use of context trees and includes a set of effective algorithmic tools. It defines a very general framework that can be used in conjunction with any existing model class to build flexible and interpretable mixture models."
}