{
    "title": "Noise-robust Graph Learning by Estimating and Leveraging Pairwise Interactions. (arXiv:2106.07451v2 [cs.LG] UPDATED)",
    "abstract": "Teaching Graph Neural Networks (GNNs) to accurately classify nodes under severely noisy labels is an important problem in real-world graph learning applications, but is currently underexplored. Although pairwise training methods have demonstrated promise in supervised metric learning and unsupervised contrastive learning, they remain less studied on noisy graphs, where the structural pairwise interactions (PI) between nodes are abundant and thus might benefit label noise learning rather than the pointwise methods. This paper bridges the gap by proposing a pairwise framework for noisy node classification on graphs, which relies on the PI as a primary learning proxy in addition to the pointwise learning from the noisy node class labels. Our proposed framework PI-GNN contributes two novel components: (1) a confidence-aware PI estimation model that adaptively estimates the PI labels, which are defined as whether the two nodes share the same node labels, and (2) a decoupled training approac",
    "link": "http://arxiv.org/abs/2106.07451",
    "context": "Title: Noise-robust Graph Learning by Estimating and Leveraging Pairwise Interactions. (arXiv:2106.07451v2 [cs.LG] UPDATED)\nAbstract: Teaching Graph Neural Networks (GNNs) to accurately classify nodes under severely noisy labels is an important problem in real-world graph learning applications, but is currently underexplored. Although pairwise training methods have demonstrated promise in supervised metric learning and unsupervised contrastive learning, they remain less studied on noisy graphs, where the structural pairwise interactions (PI) between nodes are abundant and thus might benefit label noise learning rather than the pointwise methods. This paper bridges the gap by proposing a pairwise framework for noisy node classification on graphs, which relies on the PI as a primary learning proxy in addition to the pointwise learning from the noisy node class labels. Our proposed framework PI-GNN contributes two novel components: (1) a confidence-aware PI estimation model that adaptively estimates the PI labels, which are defined as whether the two nodes share the same node labels, and (2) a decoupled training approac",
    "path": "papers/21/06/2106.07451.json",
    "total_tokens": 871,
    "translated_title": "通过估计和利用成对交互来提高噪声鲁棒性的图学习",
    "translated_abstract": "在真实世界的图学习应用中，教授图神经网络（GNN）准确分类严重噪声标签的节点是一个重要问题，但目前探索不足。本文提出了一种针对噪声图的成对框架，其依赖于节点之间的结构成对交互（PI）作为主要的学习代理，除了从带噪声节点类标签进行的逐点学习之外。我们提出的PI-GNN框架贡献了两个新颖的组件：（1）自适应估计PI标签的可信度感知PI估计模型，其被定义为两个节点是否共享相同的节点标签，以及（2）一种解耦训练方法。",
    "tldr": "本文提出了一种成对框架，可在噪声图上进行节点分类，并利用结构成对交互作为主要的学习代理。提出的PI-GNN框架包含两个新颖的组件，自适应估计PI标签的可信度感知PI估计模型和一种解耦训练方法。",
    "en_tdlr": "This paper proposes a pairwise framework for noisy node classification on graphs, which relies on the structural pairwise interactions (PI) between nodes as a primary learning agent. The proposed PI-GNN framework contains two novel components, a confidence-aware PI estimation model that adaptively estimates the PI labels and a decoupled training approach."
}