{
    "title": "Connection Sensitivity Matters for Training-free DARTS: From Architecture-Level Scoring to Operation-Level Sensitivity Analysis. (arXiv:2106.11542v3 [cs.LG] UPDATED)",
    "abstract": "The recently proposed training-free NAS methods abandon the training phase and design various zero-cost proxies as scores to identify excellent architectures, arousing extreme computational efficiency for neural architecture search. In this paper, we raise an interesting problem: can we properly measure the operation importance in DARTS through a training-free way, with avoiding the parameter-intensive bias? We investigate this question through the lens of edge connectivity, and provide an affirmative answer by defining a connectivity concept, ZERo-cost Operation Sensitivity (ZEROS), to score the importance of candidate operations in DARTS at initialization. By devising an iterative and data-agnostic manner in utilizing ZEROS for NAS, our novel trial leads to a framework called training free differentiable architecture search (FreeDARTS). Based on the theory of Neural Tangent Kernel (NTK), we show the proposed connectivity score provably negatively correlated with the generalization bo",
    "link": "http://arxiv.org/abs/2106.11542",
    "context": "Title: Connection Sensitivity Matters for Training-free DARTS: From Architecture-Level Scoring to Operation-Level Sensitivity Analysis. (arXiv:2106.11542v3 [cs.LG] UPDATED)\nAbstract: The recently proposed training-free NAS methods abandon the training phase and design various zero-cost proxies as scores to identify excellent architectures, arousing extreme computational efficiency for neural architecture search. In this paper, we raise an interesting problem: can we properly measure the operation importance in DARTS through a training-free way, with avoiding the parameter-intensive bias? We investigate this question through the lens of edge connectivity, and provide an affirmative answer by defining a connectivity concept, ZERo-cost Operation Sensitivity (ZEROS), to score the importance of candidate operations in DARTS at initialization. By devising an iterative and data-agnostic manner in utilizing ZEROS for NAS, our novel trial leads to a framework called training free differentiable architecture search (FreeDARTS). Based on the theory of Neural Tangent Kernel (NTK), we show the proposed connectivity score provably negatively correlated with the generalization bo",
    "path": "papers/21/06/2106.11542.json",
    "total_tokens": 907,
    "translated_title": "基于连接敏感性的训练免费DARTS：从架构级评分到操作级敏感性分析",
    "translated_abstract": "最近提出的训练免费NAS方法放弃了训练阶段并设计了各种零成本代理作为评分，以识别出优秀的架构，引起了神经架构搜索的极高计算效率。本文提出了一个有趣的问题：我们能否通过训练免费的方式适当地测量DARTS中的操作重要性，避免参数密集的偏差？我们通过边缘连通性的角度来研究这个问题，并提供了一个肯定的答案，通过定义一个连接概念“ZERo-cost Operation Sensitivity (ZEROS)”，来评分DARTS中候选操作的重要性。通过设计一种迭代和数据不可知的方式来利用ZEROS进行NAS，我们的新尝试导致了一个名为“training free differentiable architecture search (FreeDARTS)”的框架。基于神经切向核(NTK)的理论，我们证明了所提出的连接评分与泛化下降呈负相关。",
    "tldr": "本论文提出一种叫做ZEROS的连接概念来评估DARTS中的操作重要性，使得整个架构的搜索过程更高效，提出了一种基于NTK理论的全新框架FreeDARTS。",
    "en_tdlr": "This paper proposes a connectivity concept called ZEROS to evaluate operation importance in DARTS and a novel framework called FreeDARTS, based on NTK theory, enabling an efficient neural architecture search process."
}