{
    "title": "Fact Check: Analyzing Financial Events from Multilingual News Sources. (arXiv:2106.15221v3 [cs.AI] UPDATED)",
    "abstract": "The explosion in the sheer magnitude and complexity of financial news data in recent years makes it increasingly challenging for investment analysts to extract valuable insights and perform analysis. We propose FactCheck in finance, a web-based news aggregator with deep learning models, to provide analysts with a holistic view of important financial events from multilingual news sources and extract events using an unsupervised clustering method. A web interface is provided to examine the credibility of news articles using a transformer-based fact-checker. The performance of the fact checker is evaluated using a dataset related to merger and acquisition (M\\&A) events and is shown to outperform several strong baselines.",
    "link": "http://arxiv.org/abs/2106.15221",
    "context": "Title: Fact Check: Analyzing Financial Events from Multilingual News Sources. (arXiv:2106.15221v3 [cs.AI] UPDATED)\nAbstract: The explosion in the sheer magnitude and complexity of financial news data in recent years makes it increasingly challenging for investment analysts to extract valuable insights and perform analysis. We propose FactCheck in finance, a web-based news aggregator with deep learning models, to provide analysts with a holistic view of important financial events from multilingual news sources and extract events using an unsupervised clustering method. A web interface is provided to examine the credibility of news articles using a transformer-based fact-checker. The performance of the fact checker is evaluated using a dataset related to merger and acquisition (M\\&A) events and is shown to outperform several strong baselines.",
    "path": "papers/21/06/2106.15221.json",
    "total_tokens": 780,
    "translated_title": "事实核查: 分析多语言新闻源中的金融事件",
    "translated_abstract": "近年来，金融新闻数据的规模和复杂性急剧增加，使得投资分析师越来越难以获取有价值的见解和进行分析。我们提出了一种名为FactCheck in finance的基于深度学习模型的网络新闻聚合器，以从多语言新闻源中提供投资分析师整体视角下的重要金融事件，并使用无监督聚类方法提取事件。我们提供了一个网络界面，使用基于Transformer的事实核查器来检查新闻文章的可信度。该事实核查器的性能使用与并购事件相关的数据集进行评估，并显示优于几个强基准模型。",
    "tldr": "FactCheck in finance是一个基于深度学习模型的网络新闻聚合器，能够从多语言新闻源中提取重要的金融事件，并通过无监督聚类方法对其进行聚类。通过使用Transformer-based事实核查器来检查新闻文章的可信度，该系统显示出优于几个强基准模型的性能。",
    "en_tdlr": "FactCheck in finance is a web-based news aggregator based on deep learning models that extracts important financial events from multilingual news sources and clusters them using unsupervised clustering methods. The system outperforms several strong baselines and evaluates the credibility of news articles using a Transformer-based fact-checker."
}