{
    "title": "Software-Based Dialogue Systems: Survey, Taxonomy and Challenges",
    "abstract": "The use of natural language interfaces in the field of human-computer interaction is undergoing intense study through dedicated scientific and industrial research. The latest contributions in the field, including deep learning approaches like recurrent neural networks, the potential of context-aware strategies and user-centred design approaches, have brought back the attention of the community to software-based dialogue systems, generally known as conversational agents or chatbots. Nonetheless, and given the novelty of the field, a generic, context-independent overview on the current state of research of conversational agents covering all research perspectives involved is missing. Motivated by this context, this paper reports a survey of the current state of research of conversational agents through a systematic literature review of secondary studies. The conducted research is designed to develop an exhaustive perspective through a clear presentation of the aggregated knowledge publish",
    "link": "https://arxiv.org/abs/2106.10901",
    "context": "Title: Software-Based Dialogue Systems: Survey, Taxonomy and Challenges\nAbstract: The use of natural language interfaces in the field of human-computer interaction is undergoing intense study through dedicated scientific and industrial research. The latest contributions in the field, including deep learning approaches like recurrent neural networks, the potential of context-aware strategies and user-centred design approaches, have brought back the attention of the community to software-based dialogue systems, generally known as conversational agents or chatbots. Nonetheless, and given the novelty of the field, a generic, context-independent overview on the current state of research of conversational agents covering all research perspectives involved is missing. Motivated by this context, this paper reports a survey of the current state of research of conversational agents through a systematic literature review of secondary studies. The conducted research is designed to develop an exhaustive perspective through a clear presentation of the aggregated knowledge publish",
    "path": "papers/21/06/2106.10901.json",
    "total_tokens": 868,
    "translated_title": "基于软件的对话系统：调查、分类和挑战",
    "translated_abstract": "在人机交互领域，自然语言界面的使用正受到专门的科学和工业研究的密切关注。该领域的最新贡献包括递归神经网络等深度学习方法、上下文感知策略的潜力和以用户为中心的设计方法，再次引起了社区的关注，软件对话系统通常被称为会话代理或聊天机器人。然而，鉴于该领域的新颖性，缺少涵盖所有研究视角的通用的、上下文无关的对话代理研究现状综述。基于这一背景，本文通过对二次研究的系统文献综述，报告了对话代理研究的当前状态的调查。进行的研究旨在通过对聚合知识的清晰呈现，发展出一个全面的视角。",
    "tldr": "这篇论文通过对二次研究的系统文献综述，调查了基于软件的对话系统研究的当前状态。这个领域的最新贡献包括深度学习方法和上下文感知策略等。当前缺少一个通用的、上下文无关的对话代理研究综述。",
    "en_tdlr": "This paper presents a survey of the current state of research on software-based dialogue systems through a systematic literature review. The latest contributions in this field include deep learning approaches and context-aware strategies. There is currently a lack of a generic, context-independent overview of research on conversational agents."
}