{
    "title": "Local convexity of the TAP free energy and AMP convergence for Z2-synchronization. (arXiv:2106.11428v3 [math.ST] UPDATED)",
    "abstract": "We study mean-field variational Bayesian inference using the TAP approach, for Z2-synchronization as a prototypical example of a high-dimensional Bayesian model. We show that for any signal strength $\\lambda > 1$ (the weak-recovery threshold), there exists a unique local minimizer of the TAP free energy functional near the mean of the Bayes posterior law. Furthermore, the TAP free energy in a local neighborhood of this minimizer is strongly convex. Consequently, a natural-gradient/mirror-descent algorithm achieves linear convergence to this minimizer from a local initialization, which may be obtained by a constant number of iterates of Approximate Message Passing (AMP). This provides a rigorous foundation for variational inference in high dimensions via minimization of the TAP free energy.  We also analyze the finite-sample convergence of AMP, showing that AMP is asymptotically stable at the TAP minimizer for any $\\lambda > 1$, and is linearly convergent to this minimizer from a spectr",
    "link": "http://arxiv.org/abs/2106.11428",
    "context": "Title: Local convexity of the TAP free energy and AMP convergence for Z2-synchronization. (arXiv:2106.11428v3 [math.ST] UPDATED)\nAbstract: We study mean-field variational Bayesian inference using the TAP approach, for Z2-synchronization as a prototypical example of a high-dimensional Bayesian model. We show that for any signal strength $\\lambda > 1$ (the weak-recovery threshold), there exists a unique local minimizer of the TAP free energy functional near the mean of the Bayes posterior law. Furthermore, the TAP free energy in a local neighborhood of this minimizer is strongly convex. Consequently, a natural-gradient/mirror-descent algorithm achieves linear convergence to this minimizer from a local initialization, which may be obtained by a constant number of iterates of Approximate Message Passing (AMP). This provides a rigorous foundation for variational inference in high dimensions via minimization of the TAP free energy.  We also analyze the finite-sample convergence of AMP, showing that AMP is asymptotically stable at the TAP minimizer for any $\\lambda > 1$, and is linearly convergent to this minimizer from a spectr",
    "path": "papers/21/06/2106.11428.json",
    "total_tokens": 1080,
    "translated_title": "TAP自由能函数的局部凸性和Z2同步的AMP收敛性研究",
    "translated_abstract": "本文以Z2同步为高维贝叶斯模型的典型例子，研究了利用TAP方法进行平均场变分贝叶斯推断。我们证明，对于任何信号强度$\\lambda > 1$（弱恢复阈值），TAP自由能泛函在Bayes后验分布均值附近存在唯一局部极小值。此外，在该极小值的局部邻域内，TAP自由能是强凸的。因此，从本地初始化开始，自然梯度/镜像下降算法可以从一定的Approximate Message Passing（AMP）迭代中获得该极小值的线性收敛性。这为通过最小化TAP自由能进行高维变分推断提供了严密的基础。我们还分析了AMP的有限样本收敛性，证明了对于任何$\\lambda >1$，AMP在TAP极小点处是渐进稳定的，并且从谱初始化开始线性收敛到该极小点。",
    "tldr": "本文研究利用TAP方法进行平均场变分贝叶斯推断，并以Z2同步为例进行了探讨。结果表明，TAP自由能泛函在Bayes后验分布均值附近存在唯一局部极小值且具有强凸性。通过自然梯度/镜像下降算法，可以从一定的AMP迭代中获得该极小值的线性收敛性。这为高维变分推断提供了严密的基础。",
    "en_tdlr": "This paper studies mean-field variational Bayesian inference using the TAP approach, and explores Z2-synchronization as an example. The results show that the TAP free energy functional has a unique local minimizer that is strongly convex near the mean of the Bayes posterior law, with linear convergence achieved through a natural-gradient/mirror-descent algorithm using a certain number of Approximate Message Passing (AMP) iterations. This provides a rigorous foundation for high-dimensional variational inference based on minimizing the TAP free energy, and analyzes the finite-sample convergence of AMP, showing asymptotic stability at the TAP minimizer for any $\\lambda > 1$."
}