{
    "title": "A Coupled Design of Exploiting Record Similarity for Practical Vertical Federated Learning. (arXiv:2106.06312v4 [cs.LG] UPDATED)",
    "abstract": "Federated learning is a learning paradigm to enable collaborative learning across different parties without revealing raw data. Notably, vertical federated learning (VFL), where parties share the same set of samples but only hold partial features, has a wide range of real-world applications. However, most existing studies in VFL disregard the \"record linkage\" process. They design algorithms either assuming the data from different parties can be exactly linked or simply linking each record with its most similar neighboring record. These approaches may fail to capture the key features from other less similar records. Moreover, such improper linkage cannot be corrected by training since existing approaches provide no feedback on linkage during training. In this paper, we design a novel coupled training paradigm, FedSim, that integrates one-to-many linkage into the training process. Besides enabling VFL in many real-world applications with fuzzy identifiers, FedSim also achieves better per",
    "link": "http://arxiv.org/abs/2106.06312",
    "context": "Title: A Coupled Design of Exploiting Record Similarity for Practical Vertical Federated Learning. (arXiv:2106.06312v4 [cs.LG] UPDATED)\nAbstract: Federated learning is a learning paradigm to enable collaborative learning across different parties without revealing raw data. Notably, vertical federated learning (VFL), where parties share the same set of samples but only hold partial features, has a wide range of real-world applications. However, most existing studies in VFL disregard the \"record linkage\" process. They design algorithms either assuming the data from different parties can be exactly linked or simply linking each record with its most similar neighboring record. These approaches may fail to capture the key features from other less similar records. Moreover, such improper linkage cannot be corrected by training since existing approaches provide no feedback on linkage during training. In this paper, we design a novel coupled training paradigm, FedSim, that integrates one-to-many linkage into the training process. Besides enabling VFL in many real-world applications with fuzzy identifiers, FedSim also achieves better per",
    "path": "papers/21/06/2106.06312.json",
    "total_tokens": 921,
    "translated_title": "一种利用记录相似性进行实际垂直联邦学习的耦合设计",
    "translated_abstract": "联邦学习是一种学习范式，可以在不公开原始数据的情况下实现跨不同方参与方的协作学习。垂直联邦学习（VFL）是其中一种应用广泛的具体实现，其中参与方共享相同的样本，但只持有部分特征。然而，大多数现有的VFL研究都忽略了\"记录链接\"过程。它们设计的算法要么假设来自不同方的数据可以被准确地链接，要么仅将每个记录链接到其最相似的相邻记录。这些方法可能无法捕捉其他不太相似记录的关键特征。此外，这种不合理的链接不能通过训练进行纠正，因为现有的方法在训练过程中没有提供关于链接的反馈。在本文中，我们设计了一种新的耦合训练范式FedSim，将一对多链接集成到训练过程中。除了为具有模糊标识符的许多实际应用程序提供VFL外，FedSim还实现更好的每个",
    "tldr": "本文提出了一种新的耦合训练范式FedSim，将一对多链接集成到训练过程中，以解决现有VFL方法忽略“记录链接”过程的问题，并实现了更好的性能。",
    "en_tdlr": "This paper proposes a novel coupled training paradigm, FedSim, which integrates one-to-many linkage into the training process to address the issue of ignoring the \"record linkage\" process in existing VFL methods, and achieves better performance."
}