{
    "title": "GitTables: A Large-Scale Corpus of Relational Tables. (arXiv:2106.07258v5 [cs.DB] UPDATED)",
    "abstract": "The success of deep learning has sparked interest in improving relational table tasks, like data preparation and search, with table representation models trained on large table corpora. Existing table corpora primarily contain tables extracted from HTML pages, limiting the capability to represent offline database tables. To train and evaluate high-capacity models for applications beyond the Web, we need resources with tables that resemble relational database tables. Here we introduce GitTables, a corpus of 1M relational tables extracted from GitHub. Our continuing curation aims at growing the corpus to at least 10M tables. Analyses of GitTables show that its structure, content, and topical coverage differ significantly from existing table corpora. We annotate table columns in GitTables with semantic types, hierarchical relations and descriptions from Schema.org and DBpedia. The evaluation of our annotation pipeline on the T2Dv2 benchmark illustrates that our approach provides results o",
    "link": "http://arxiv.org/abs/2106.07258",
    "context": "Title: GitTables: A Large-Scale Corpus of Relational Tables. (arXiv:2106.07258v5 [cs.DB] UPDATED)\nAbstract: The success of deep learning has sparked interest in improving relational table tasks, like data preparation and search, with table representation models trained on large table corpora. Existing table corpora primarily contain tables extracted from HTML pages, limiting the capability to represent offline database tables. To train and evaluate high-capacity models for applications beyond the Web, we need resources with tables that resemble relational database tables. Here we introduce GitTables, a corpus of 1M relational tables extracted from GitHub. Our continuing curation aims at growing the corpus to at least 10M tables. Analyses of GitTables show that its structure, content, and topical coverage differ significantly from existing table corpora. We annotate table columns in GitTables with semantic types, hierarchical relations and descriptions from Schema.org and DBpedia. The evaluation of our annotation pipeline on the T2Dv2 benchmark illustrates that our approach provides results o",
    "path": "papers/21/06/2106.07258.json",
    "total_tokens": 846,
    "translated_title": "GitTables：一个大型关系表语料库",
    "translated_abstract": "深度学习的成功引发了对使用训练于大型表格语料库的表格表示模型改进关系表格任务（如数据准备和搜索）的兴趣。现有的表格语料库主要包含从HTML页面中提取的表格，限制了表示离线数据库表格的能力。为了训练和评估超出Web应用的高容量模型，我们需要拥有类似于关系数据库表格的表格资源。在这里，我们介绍了GitTables，这是一个从GitHub中提取的1M个关系表格的语料库。我们持续更新旨在将此语料库扩展至至少10M个表格。对GitTables的分析显示其结构、内容和主题覆盖范围与现有表格语料库存在显著差异。我们通过Schema.org和DBpedia对GitTables中的表格列进行语义类型、层次关系和描述注释。我们在T2Dv2基准评估上的注释流程验证表明，我们的方法可以提供高质量的结果。",
    "tldr": "GitTables是一个从GitHub中提取的大型语料库，包含1M个关系表格，可以有效训练和评估高容量模型，以改进关系表格任务",
    "en_tdlr": "GitTables is a large corpus of 1M relational tables extracted from GitHub, suitable for training and evaluating high-capacity models to improve relational table tasks, with annotated semantic types, hierarchical relations and descriptions for table columns."
}