{
    "title": "Unifying Revealed Preference and Revealed Rational Inattention. (arXiv:2106.14486v4 [econ.TH] UPDATED)",
    "abstract": "This paper unifies two key results from economic theory, namely, revealed rational inattention and classical revealed preference. Revealed rational inattention tests for rationality of information acquisition for Bayesian decision makers. On the other hand, classical revealed preference tests for utility maximization under known budget constraints. Our first result is an equivalence result - we unify revealed rational inattention and revealed preference through an equivalence map over decision parameters and partial order for payoff monotonicity over the decision space in both setups. Second, we exploit the unification result computationally to extend robustness measures for goodness-of-fit of revealed preference tests in the literature to revealed rational inattention. This extension facilitates quantifying how well a Bayesian decision maker's actions satisfy rational inattention. Finally, we illustrate the significance of the unification result on a real-world YouTube dataset compris",
    "link": "http://arxiv.org/abs/2106.14486",
    "context": "Title: Unifying Revealed Preference and Revealed Rational Inattention. (arXiv:2106.14486v4 [econ.TH] UPDATED)\nAbstract: This paper unifies two key results from economic theory, namely, revealed rational inattention and classical revealed preference. Revealed rational inattention tests for rationality of information acquisition for Bayesian decision makers. On the other hand, classical revealed preference tests for utility maximization under known budget constraints. Our first result is an equivalence result - we unify revealed rational inattention and revealed preference through an equivalence map over decision parameters and partial order for payoff monotonicity over the decision space in both setups. Second, we exploit the unification result computationally to extend robustness measures for goodness-of-fit of revealed preference tests in the literature to revealed rational inattention. This extension facilitates quantifying how well a Bayesian decision maker's actions satisfy rational inattention. Finally, we illustrate the significance of the unification result on a real-world YouTube dataset compris",
    "path": "papers/21/06/2106.14486.json",
    "total_tokens": 842,
    "translated_title": "同一揭示偏好与揭示理性忽视的结合",
    "translated_abstract": "本文统一了经济理论中的两个关键结果，即揭示理性忽视和经典揭示偏好。揭示理性忽视检验贝叶斯决策者信息获取的合理性，而经典揭示偏好则测试已知预算约束下效用最大化。我们的第一个结果是一个等价结果 - 通过决策参数上的等价映射和决策空间上的偏序关系，我们统一了揭示理性忽视和揭示偏好。其次，我们利用这一统一结果在计算上扩展了文献中对揭示偏好测试的适应性测度，以适用于揭示理性忽视。这种扩展有助于量化贝叶斯决策者的行为在理性忽视方面的表现。最后，我们通过一个真实的YouTube数据集展示了统一结果的重要性。",
    "tldr": "本文统一了揭示理性忽视和揭示偏好的两个关键结果，并利用这一统一结果在计算上扩展了对揭示偏好测试的适应性测度，以适用于揭示理性忽视。",
    "en_tdlr": "This paper unifies two key results from economic theory - revealed rational inattention and classical revealed preference, and extends robustness measures for revealed preference tests to revealed rational inattention, quantifying how well a Bayesian decision maker's actions satisfy rational inattention."
}