{
    "title": "Transient Stability Analysis with Physics-Informed Neural Networks. (arXiv:2106.13638v3 [cs.LG] UPDATED)",
    "abstract": "We explore the possibility to use physics-informed neural networks to drastically accelerate the solution of ordinary differential-algebraic equations that govern the power system dynamics. When it comes to transient stability assessment, the traditionally applied methods either carry a significant computational burden, require model simplifications, or use overly conservative surrogate models. Conventional neural networks can circumvent these limitations but are faced with high demand of high-quality training datasets, while they ignore the underlying governing equations. Physics-informed neural networks are different: they incorporate the power system differential algebraic equations directly into the neural network training and drastically reduce the need for training data. This paper takes a deep dive into the performance of physics-informed neural networks for power system transient stability assessment. Introducing a new neural network training procedure to facilitate a thorough ",
    "link": "http://arxiv.org/abs/2106.13638",
    "context": "Title: Transient Stability Analysis with Physics-Informed Neural Networks. (arXiv:2106.13638v3 [cs.LG] UPDATED)\nAbstract: We explore the possibility to use physics-informed neural networks to drastically accelerate the solution of ordinary differential-algebraic equations that govern the power system dynamics. When it comes to transient stability assessment, the traditionally applied methods either carry a significant computational burden, require model simplifications, or use overly conservative surrogate models. Conventional neural networks can circumvent these limitations but are faced with high demand of high-quality training datasets, while they ignore the underlying governing equations. Physics-informed neural networks are different: they incorporate the power system differential algebraic equations directly into the neural network training and drastically reduce the need for training data. This paper takes a deep dive into the performance of physics-informed neural networks for power system transient stability assessment. Introducing a new neural network training procedure to facilitate a thorough ",
    "path": "papers/21/06/2106.13638.json",
    "total_tokens": 850,
    "translated_title": "物理知识嵌入神经网络的暂态稳定性分析",
    "translated_abstract": "本文探讨使用物理知识嵌入神经网络来大幅加速控制电力系统动态的常微分代数方程求解。在进行暂态稳定性计算方面，传统的方法要么计算负载较大、模型简化、或使用过度保守的代理模型。传统神经网络可以回避这些限制，但需要高质量的训练数据，而忽略了潜在的控制方程。物理知识嵌入神经网络不同：它们将电力系统的微分代数方程直接嵌入神经网络的训练中，并大大减少了对训练数据的需求。本文深入研究了物理知识嵌入神经网络在电力系统暂态稳定性评估方面的性能。引入了一种新的神经网络训练程序，以促进全面的解决方案评估。",
    "tldr": "本文介绍了物理知识嵌入神经网络的暂态稳定性分析，该方法直接将电力系统微分代数方程嵌入神经网络的训练中，并大大减少了对训练数据的需求。",
    "en_tdlr": "This paper presents an approach to transient stability analysis using physics-informed neural networks, which incorporate the power system differential algebraic equations directly into the neural network training and drastically reduce the need for training data."
}