{
    "title": "Detecting Identification Failure in Moment Condition Models. (arXiv:1907.13093v5 [econ.EM] UPDATED)",
    "abstract": "This paper develops an approach to detect identification failure in moment condition models. This is achieved by introducing a quasi-Jacobian matrix computed as the slope of a linear approximation of the moments on an estimate of the identified set. It is asymptotically singular when local and/or global identification fails, and equivalent to the usual Jacobian matrix which has full rank when the model is point and locally identified. Building on this property, a simple test with chi-squared critical values is introduced to conduct subvector inferences allowing for strong, semi-strong, and weak identification without \\textit{a priori} knowledge about the underlying identification structure. Monte-Carlo simulations and an empirical application to the Long-Run Risks model illustrate the results.",
    "link": "http://arxiv.org/abs/1907.13093",
    "context": "Title: Detecting Identification Failure in Moment Condition Models. (arXiv:1907.13093v5 [econ.EM] UPDATED)\nAbstract: This paper develops an approach to detect identification failure in moment condition models. This is achieved by introducing a quasi-Jacobian matrix computed as the slope of a linear approximation of the moments on an estimate of the identified set. It is asymptotically singular when local and/or global identification fails, and equivalent to the usual Jacobian matrix which has full rank when the model is point and locally identified. Building on this property, a simple test with chi-squared critical values is introduced to conduct subvector inferences allowing for strong, semi-strong, and weak identification without \\textit{a priori} knowledge about the underlying identification structure. Monte-Carlo simulations and an empirical application to the Long-Run Risks model illustrate the results.",
    "path": "papers/19/07/1907.13093.json",
    "total_tokens": 800,
    "translated_title": "在矩条件模型中检测识别失败的方法",
    "translated_abstract": "本文提出了一种在矩条件模型中检测识别失败的方法。该方法通过引入一个准雅可比矩阵，该矩阵计算为将矩条件在识别集估计上的线性近似斜率。当局部和/或全局识别失败时，准雅可比矩阵是渐进奇异的，并且在模型是点和局部可识别时等价于通常的雅可比矩阵，该矩阵具有满秩性质。基于这个特性，引入了一个简单的检验方法，使用卡方临界值进行子向量推断，不需要对潜在的识别结构有先验的知识。通过蒙特卡洛模拟和对长期风险模型的实证应用，证明了该方法的有效性。",
    "tldr": "本文提出了一种在矩条件模型中检测识别失败的方法，通过引入准雅可比矩阵并进行简单的检验，可以在不需要先验知识的情况下进行子向量推断，这在经济学中具有重要的应用价值。"
}