{
    "title": "Algorithms for Competitive Division of Chores. (arXiv:1907.01766v2 [cs.GT] UPDATED)",
    "abstract": "We study the problem of allocating divisible bads (chores) among multiple agents with additive utilities when monetary transfers are not allowed. The competitive rule is known for its remarkable fairness and efficiency properties in the case of goods. This rule was extended to chores in prior work by Bogomolnaia, Moulin, Sandomirskiy, and Yanovskaya (2017). The rule produces Pareto optimal and envy-free allocations for both goods and chores. In the case of goods, the outcome of the competitive rule can be easily computed. Competitive allocations solve the Eisenberg-Gale convex program; hence the outcome is unique and can be approximately found by standard gradient methods. An exact algorithm that runs in polynomial time in the number of agents and goods was given by Orlin (2010).  In the case of chores, the competitive rule does not solve any convex optimization problem; instead, competitive allocations correspond to local minima, local maxima, and saddle points of the Nash social welf",
    "link": "http://arxiv.org/abs/1907.01766",
    "context": "Title: Algorithms for Competitive Division of Chores. (arXiv:1907.01766v2 [cs.GT] UPDATED)\nAbstract: We study the problem of allocating divisible bads (chores) among multiple agents with additive utilities when monetary transfers are not allowed. The competitive rule is known for its remarkable fairness and efficiency properties in the case of goods. This rule was extended to chores in prior work by Bogomolnaia, Moulin, Sandomirskiy, and Yanovskaya (2017). The rule produces Pareto optimal and envy-free allocations for both goods and chores. In the case of goods, the outcome of the competitive rule can be easily computed. Competitive allocations solve the Eisenberg-Gale convex program; hence the outcome is unique and can be approximately found by standard gradient methods. An exact algorithm that runs in polynomial time in the number of agents and goods was given by Orlin (2010).  In the case of chores, the competitive rule does not solve any convex optimization problem; instead, competitive allocations correspond to local minima, local maxima, and saddle points of the Nash social welf",
    "path": "papers/19/07/1907.01766.json",
    "total_tokens": 981,
    "translated_title": "竞争性分配家务的算法",
    "translated_abstract": "在禁止货币转移的情况下，研究将可分割的无益物品（家务）分配给多个代理人时的问题。竞争性规则在货物情况下具有显著的公平性和效率性。Bogomolnaia、Moulin、Sandomirskiy和Yanovskaya（2017）在先前的工作中将该规则扩展到家务。该规则为货物和家务都提供了帕累托最优和无嫉妒的分配方案。对于货物来说，竞争性规则的结果可以很容易地计算得到。竞争性分配方案解决了Eisenberg-Gale凸优化问题；因此结果是唯一的，并可以通过标准梯度方法近似地找到。Orlin（2010）提供了一种在代理人和货物数量多项式时间内运行的精确算法。对于家务来说，竞争性规则无法解决任何凸优化问题；相反，竞争性分配对应于纳什社会福利的局部最小值、局部最大值和鞍点。",
    "tldr": "本文研究在禁止货币转移的情况下，将可分割的无益物品（家务）分配给多个代理人的问题，并扩展了竞争性规则在货物情况下的应用。竞争性分配方案不同于货物，需要找到局部最小值、局部最大值和鞍点来解决问题。",
    "en_tdlr": "This paper investigates the problem of allocating divisible bads (chores) among multiple agents without monetary transfers and extends the application of the competitive rule in the case of goods. Competitive allocations for chores differ from goods, requiring the identification of local minima, local maxima, and saddle points to solve the problem."
}