{
    "title": "A Kernel Stein Test for Comparing Latent Variable Models. (arXiv:1907.00586v5 [stat.ML] UPDATED)",
    "abstract": "We propose a kernel-based nonparametric test of relative goodness of fit, where the goal is to compare two models, both of which may have unobserved latent variables, such that the marginal distribution of the observed variables is intractable. The proposed test generalizes the recently proposed kernel Stein discrepancy (KSD) tests (Liu et al., 2016, Chwialkowski et al., 2016, Yang et al., 2018) to the case of latent variable models, a much more general class than the fully observed models treated previously. The new test, with a properly calibrated threshold, has a well-controlled type-I error. In the case of certain models with low-dimensional latent structure and high-dimensional observations, our test significantly outperforms the relative Maximum Mean Discrepancy test, which is based on samples from the models and does not exploit the latent structure.",
    "link": "http://arxiv.org/abs/1907.00586",
    "context": "Title: A Kernel Stein Test for Comparing Latent Variable Models. (arXiv:1907.00586v5 [stat.ML] UPDATED)\nAbstract: We propose a kernel-based nonparametric test of relative goodness of fit, where the goal is to compare two models, both of which may have unobserved latent variables, such that the marginal distribution of the observed variables is intractable. The proposed test generalizes the recently proposed kernel Stein discrepancy (KSD) tests (Liu et al., 2016, Chwialkowski et al., 2016, Yang et al., 2018) to the case of latent variable models, a much more general class than the fully observed models treated previously. The new test, with a properly calibrated threshold, has a well-controlled type-I error. In the case of certain models with low-dimensional latent structure and high-dimensional observations, our test significantly outperforms the relative Maximum Mean Discrepancy test, which is based on samples from the models and does not exploit the latent structure.",
    "path": "papers/19/07/1907.00586.json",
    "total_tokens": 813,
    "translated_title": "一种用于比较潜变量模型的核Stein检验",
    "translated_abstract": "我们提出了一种基于核的非参数拟合优度检验，旨在比较两个模型，这两个模型都可能具有未观测的潜变量，且观测变量的边缘分布不可观测。所提出的检验将最近提出的核Stein距离(KSD)检验(Liu et al., 2016, Chwialkowski et al., 2016, Yang et al., 2018)推广到潜变量模型的情况下，是一个比之前处理的全观测模型更加通用的类别。新的检验通过适当的校准阈值，得到良好控制的一类错误。对于某些具有低维潜在结构和高维观测的模型，在我们的测试中，显著优于基于模型样本和不利用潜在结构的相对最大平均距离检测。",
    "tldr": "本研究提出了一种核Stein检验方法，可用于比较具有潜变量的模型，相比于当前方法，性能更好。",
    "en_tdlr": "A kernel Stein test was proposed to compare latent variable models, outperforming current methods for certain models with low-dimensional latent structure and high-dimensional observations."
}