{
    "title": "Proportional Dynamics in Exchange Economies. (arXiv:1907.05037v3 [cs.GT] UPDATED)",
    "abstract": "We study the Proportional Response dynamic in exchange economies, where each player starts with some amount of money and a good. Every day, the players bring one unit of their good and submit bids on goods they like, each good gets allocated in proportion to the bid amounts, and each seller collects the bids received. Then every player updates the bids proportionally to the contribution of each good in their utility. This dynamic models a process of learning how to bid and has been studied in a series of papers on Fisher and production markets, but not in exchange economies. Our main results are as follows:  - For linear utilities, the dynamic converges to market equilibrium utilities and allocations, while the bids and prices may cycle. We give a combinatorial characterization of limit cycles for prices and bids.  - We introduce a lazy version of the dynamic, where players may save money for later, and show this converges in everything: utilities, allocations, and prices.  - For CES u",
    "link": "http://arxiv.org/abs/1907.05037",
    "context": "Title: Proportional Dynamics in Exchange Economies. (arXiv:1907.05037v3 [cs.GT] UPDATED)\nAbstract: We study the Proportional Response dynamic in exchange economies, where each player starts with some amount of money and a good. Every day, the players bring one unit of their good and submit bids on goods they like, each good gets allocated in proportion to the bid amounts, and each seller collects the bids received. Then every player updates the bids proportionally to the contribution of each good in their utility. This dynamic models a process of learning how to bid and has been studied in a series of papers on Fisher and production markets, but not in exchange economies. Our main results are as follows:  - For linear utilities, the dynamic converges to market equilibrium utilities and allocations, while the bids and prices may cycle. We give a combinatorial characterization of limit cycles for prices and bids.  - We introduce a lazy version of the dynamic, where players may save money for later, and show this converges in everything: utilities, allocations, and prices.  - For CES u",
    "path": "papers/19/07/1907.05037.json",
    "total_tokens": 909,
    "translated_title": "交换经济中的比例动态",
    "translated_abstract": "我们研究了交换经济中的比例响应动态，其中每个玩家从一定数量的货币和商品开始。每天，玩家带来一单位的商品并对他们喜欢的商品进行竞标，每个商品按照竞标金额的比例分配，每个卖家收集所收到的竞标。然后每个玩家根据每个商品在其效用中的贡献比例来更新竞标。这种动态模型描述了一种学习如何竞标的过程，并在Fisher和生产市场的一系列论文中进行了研究，但在交换经济中并未涉及。我们的主要结果如下：- 对于线性效用，动态收敛于市场均衡的效用和分配，而竞标和价格可能循环。我们给出了价格和竞标循环的组合特征。- 我们引入了动态的懒惰版本，其中玩家可以节省资金以备后用，并证明该动态在效用、分配和价格方面都收敛。- 对于CES效用函数，我们给出了稳定性条件，指出了何时动态不收敛。",
    "tldr": "该论文研究了交换经济中的比例响应动态，为线性效用提供了市场均衡的效用和分配，引入了懒惰版本使动态在所有方面都收敛。"
}