{
    "title": "On Statistical Discrimination as a Failure of Social Learning: A Multi-Armed Bandit Approach. (arXiv:2010.01079v6 [econ.TH] UPDATED)",
    "abstract": "We analyze statistical discrimination in hiring markets using a multi-armed bandit model. Myopic firms face workers arriving with heterogeneous observable characteristics. The association between the worker's skill and characteristics is unknown ex ante; thus, firms need to learn it. Laissez-faire causes perpetual underestimation: minority workers are rarely hired, and therefore, the underestimation tends to persist. Even a marginal imbalance in the population ratio frequently results in perpetual underestimation. We propose two policy solutions: a novel subsidy rule (the hybrid mechanism) and the Rooney Rule. Our results indicate that temporary affirmative actions effectively alleviate discrimination stemming from insufficient data.",
    "link": "http://arxiv.org/abs/2010.01079",
    "context": "Title: On Statistical Discrimination as a Failure of Social Learning: A Multi-Armed Bandit Approach. (arXiv:2010.01079v6 [econ.TH] UPDATED)\nAbstract: We analyze statistical discrimination in hiring markets using a multi-armed bandit model. Myopic firms face workers arriving with heterogeneous observable characteristics. The association between the worker's skill and characteristics is unknown ex ante; thus, firms need to learn it. Laissez-faire causes perpetual underestimation: minority workers are rarely hired, and therefore, the underestimation tends to persist. Even a marginal imbalance in the population ratio frequently results in perpetual underestimation. We propose two policy solutions: a novel subsidy rule (the hybrid mechanism) and the Rooney Rule. Our results indicate that temporary affirmative actions effectively alleviate discrimination stemming from insufficient data.",
    "path": "papers/20/10/2010.01079.json",
    "total_tokens": 864,
    "translated_title": "对统计歧视作为社会学习失败的研究：一个多臂赌博机方法",
    "translated_abstract": "我们使用一个多臂赌博机模型来分析招聘市场中的统计歧视。目光短浅的公司面临着具有不同可观察特征的工人。工人的技能和特征之间的关联在先验条件下是未知的，因此公司需要学习。自由放任会导致持久性低估：少数族裔工人很少被雇佣，因此低估往往持续存在。即使人口比例稍微不平衡，也经常导致持久性低估。我们提出了两种政策解决方案：一种新颖的补贴规则（混合机制）和罗尼法则。我们的研究结果表明，临时肯定行动可以有效缓解由于数据不足而导致的歧视问题。",
    "tldr": "该论文通过使用多臂赌博机模型分析招聘市场中的统计歧视，发现自由放任会导致对少数族裔工人的持续低估问题。研究提出了两种政策解决方案，即混合机制和罗尼法则，表明临时肯定行动可以有效缓解由于数据不足引起的歧视问题。",
    "en_tdlr": "This paper examines statistical discrimination in hiring markets using a multi-armed bandit model and identifies the persistent underestimation of minority workers as a result of laissez-faire. It proposes two policy solutions, the hybrid mechanism and the Rooney Rule, to effectively alleviate discrimination caused by insufficient data."
}