{
    "title": "Identification and Estimation of Unconditional Policy Effects of an Endogenous Binary Treatment: an Unconditional MTE Approach. (arXiv:2010.15864v4 [econ.EM] UPDATED)",
    "abstract": "This paper studies the identification and estimation of policy effects when treatment status is binary and endogenous. We introduce a new class of unconditional marginal treatment effects (MTE) based on the influence function of the functional underlying the policy target. We show that an unconditional policy effect can be represented as a weighted average of the newly defined unconditional MTEs over the individuals who are indifferent about their treatment status. We provide conditions for point identification of the unconditional policy effects. When a quantile is the functional of interest, we introduce the UNconditional Instrumental Quantile Estimator (UNIQUE) and establish its consistency and asymptotic distribution. In the empirical application, we estimate the effect of changing college enrollment status, induced by higher tuition subsidy, on the quantiles of the wage distribution.",
    "link": "http://arxiv.org/abs/2010.15864",
    "context": "Title: Identification and Estimation of Unconditional Policy Effects of an Endogenous Binary Treatment: an Unconditional MTE Approach. (arXiv:2010.15864v4 [econ.EM] UPDATED)\nAbstract: This paper studies the identification and estimation of policy effects when treatment status is binary and endogenous. We introduce a new class of unconditional marginal treatment effects (MTE) based on the influence function of the functional underlying the policy target. We show that an unconditional policy effect can be represented as a weighted average of the newly defined unconditional MTEs over the individuals who are indifferent about their treatment status. We provide conditions for point identification of the unconditional policy effects. When a quantile is the functional of interest, we introduce the UNconditional Instrumental Quantile Estimator (UNIQUE) and establish its consistency and asymptotic distribution. In the empirical application, we estimate the effect of changing college enrollment status, induced by higher tuition subsidy, on the quantiles of the wage distribution.",
    "path": "papers/20/10/2010.15864.json",
    "total_tokens": 1049,
    "translated_title": "无条件策略影响的识别与估计：一种内生二元处理的无条件MTE方法",
    "translated_abstract": "本文研究了在处理状态为二元且内生时的策略效应的识别和估计。我们基于反映政策目标的函数的影响函数引入了一类新的无条件边际处理效应（MTE）。我们证明了无条件策略效应可以表示为对于对待自己的处理状态处于决策困惑的个体而言新定义的无条件MTE的加权平均。我们提供了识别无条件策略效应的条件。当感兴趣的函数是分位数时，我们引入了无条件工具分位数估计（UNIQUE）并证明了其一致性和渐近分布。在实证应用中，我们估计了通过更高的学费补贴引起的大学入学状态变化对工资分布的分位数的影响。",
    "tldr": "本文介绍了一种基于函数影响函数的无条件边际处理效应（MTE）的新方法，研究了处理状态为二元且内生时策略效应的识别与估计。我们证明了无条件策略效应可以表示为对于对待自己的处理状态处于决策困惑的个体而言新定义的无条件MTE的加权平均。对于感兴趣的分位数，我们引入了无条件工具分位数估计（UNIQUE）并证明了其一致性和渐近分布。在实证应用中，我们估计了通过更高的学费补贴引起的大学入学状态变化对工资分布的分位数的影响。"
}