{
    "title": "Intrinsic Sliced Wasserstein Distances for Comparing Collections of Probability Distributions on Manifolds and Graphs. (arXiv:2010.15285v3 [stat.ME] UPDATED)",
    "abstract": "Collections of probability distributions arise in a variety of applications ranging from user activity pattern analysis to brain connectomics. In practice these distributions can be defined over diverse domain types including finite intervals, circles, cylinders, spheres, other manifolds, and graphs. This paper introduces an approach for detecting differences between two collections of distributions over such general domains. To this end, we propose the intrinsic slicing construction that yields a novel class of Wasserstein distances on manifolds and graphs. These distances are Hilbert embeddable, allowing us to reduce the distribution collection comparison problem to a more familiar mean testing problem in a Hilbert space. We provide two testing procedures one based on resampling and another on combining p-values from coordinate-wise tests. Our experiments in various synthetic and real data settings show that the resulting tests are powerful and the p-values are well-calibrated.",
    "link": "http://arxiv.org/abs/2010.15285",
    "context": "Title: Intrinsic Sliced Wasserstein Distances for Comparing Collections of Probability Distributions on Manifolds and Graphs. (arXiv:2010.15285v3 [stat.ME] UPDATED)\nAbstract: Collections of probability distributions arise in a variety of applications ranging from user activity pattern analysis to brain connectomics. In practice these distributions can be defined over diverse domain types including finite intervals, circles, cylinders, spheres, other manifolds, and graphs. This paper introduces an approach for detecting differences between two collections of distributions over such general domains. To this end, we propose the intrinsic slicing construction that yields a novel class of Wasserstein distances on manifolds and graphs. These distances are Hilbert embeddable, allowing us to reduce the distribution collection comparison problem to a more familiar mean testing problem in a Hilbert space. We provide two testing procedures one based on resampling and another on combining p-values from coordinate-wise tests. Our experiments in various synthetic and real data settings show that the resulting tests are powerful and the p-values are well-calibrated.",
    "path": "papers/20/10/2010.15285.json",
    "total_tokens": 943,
    "translated_title": "内在切片Wasserstein距离用于比较流形和图上的概率分布集合",
    "translated_abstract": "概率分布的集合在各种应用中广泛应用，范围从用户活动模式分析到脑连接学。实际上，这些分布可以定义在各种不同的域类型上，包括有限区间、圆、圆柱、球、其他流形和图。本文介绍了一种方法来检测在这样的一般域上两个概率分布集合之间的差异。为此，我们提出了内在切片构造，得出了一个新的类Wasserstein距离，用于流形和图上的分布。这些距离是希尔伯特可嵌入的，使我们能够将分布集合比较问题减少到希尔伯特空间中更熟悉的均值检验问题。我们提供了两种测试程序，一种基于重采样，另一种基于组合来自坐标化测试的p值。我们在各种合成和实际数据设置中的实验表明，所得到的测试是强有力的，p值是很好地校准过的。",
    "tldr": "该论文介绍了一种新颖的概率分布集合比较方法，能在流形和图上使用，该方法使用内在切片构造，得出一种新的类Wasserstein距离，可将分布集合比较问题减少到希尔伯特空间中更熟悉的均值检验问题。",
    "en_tdlr": "This paper proposes a novel method for comparing collections of probability distributions on manifolds and graphs, using intrinsic slicing construction to obtain a new class of Wasserstein distances, which can reduce the distribution collection comparison problem to a familiar mean testing problem in a Hilbert space."
}