{
    "title": "IRX-1D: A Simple Deep Learning Architecture for Remote Sensing Classifications. (arXiv:2010.03902v2 [cs.CV] UPDATED)",
    "abstract": "We proposes a simple deep learning architecture combining elements of Inception, ResNet and Xception networks. Four new datasets were used for classification with both small and large training samples. Results in terms of classification accuracy suggests improved performance by proposed architecture in comparison to Bayesian optimised 2D-CNN with small training samples. Comparison of results using small training sample with Indiana Pines hyperspectral dataset suggests comparable or better performance by proposed architecture than nine reported works using different deep learning architectures. In spite of achieving high classification accuracy with limited training samples, comparison of classified image suggests different land cover classes are assigned to same area when compared with the classified image provided by the model trained using large training samples with all datasets.",
    "link": "http://arxiv.org/abs/2010.03902",
    "context": "Title: IRX-1D: A Simple Deep Learning Architecture for Remote Sensing Classifications. (arXiv:2010.03902v2 [cs.CV] UPDATED)\nAbstract: We proposes a simple deep learning architecture combining elements of Inception, ResNet and Xception networks. Four new datasets were used for classification with both small and large training samples. Results in terms of classification accuracy suggests improved performance by proposed architecture in comparison to Bayesian optimised 2D-CNN with small training samples. Comparison of results using small training sample with Indiana Pines hyperspectral dataset suggests comparable or better performance by proposed architecture than nine reported works using different deep learning architectures. In spite of achieving high classification accuracy with limited training samples, comparison of classified image suggests different land cover classes are assigned to same area when compared with the classified image provided by the model trained using large training samples with all datasets.",
    "path": "papers/20/10/2010.03902.json",
    "total_tokens": 934,
    "translated_title": "IRX-1D: 一种用于遥感分类的简单深度学习架构",
    "translated_abstract": "我们提出了一种简单的深度学习架构，组合了Inception、ResNet和Xception网络的元素。我们使用了四个新数据集来进行分类，包括小样本和大样本。分类准确度方面的结果表明，与贝叶斯优化的2D-CNN相比，所提出的架构在小样本情况下具有更好的性能。在使用小样本进行比较的结果方面，与印第安娜松树高光谱数据集上使用不同深度学习架构进行的九项报告相比，我们提出的架构表现相当或更好。尽管在使用有限的训练样本时实现了高分类准确度，但分类图像的比较表明，与在所有数据集上使用大样本训练的模型提供的分类图像相比，不同的陆地覆盖类别被分配给了相同的区域。",
    "tldr": "我们提出了一种简单的深度学习架构，用于遥感分类。在小样本情况下，该架构比2D-CNN表现更好；与其他不同深度学习架构相比，在印第安娜松树高光谱数据集上表现相当或更好。但使用有限训练样本得到的分类图像与使用大样本训练的模型得到的分类图像会将不同的陆地覆盖类别分配到相同的区域。",
    "en_tdlr": "We propose a simple deep learning architecture for remote sensing classification that outperforms 2D-CNN in small sample sizes and performs comparably or better than other deep learning architectures on the Indiana Pines hyperspectral dataset. However, when using limited training samples, the classified image differs from that of the model trained with large samples, with different land cover classes assigned to the same area."
}