{
    "title": "Learning Deep Features in Instrumental Variable Regression. (arXiv:2010.07154v4 [cs.LG] UPDATED)",
    "abstract": "Instrumental variable (IV) regression is a standard strategy for learning causal relationships between confounded treatment and outcome variables from observational data by utilizing an instrumental variable, which affects the outcome only through the treatment. In classical IV regression, learning proceeds in two stages: stage 1 performs linear regression from the instrument to the treatment; and stage 2 performs linear regression from the treatment to the outcome, conditioned on the instrument. We propose a novel method, deep feature instrumental variable regression (DFIV), to address the case where relations between instruments, treatments, and outcomes may be nonlinear. In this case, deep neural nets are trained to define informative nonlinear features on the instruments and treatments. We propose an alternating training regime for these features to ensure good end-to-end performance when composing stages 1 and 2, thus obtaining highly flexible feature maps in a computationally eff",
    "link": "http://arxiv.org/abs/2010.07154",
    "context": "Title: Learning Deep Features in Instrumental Variable Regression. (arXiv:2010.07154v4 [cs.LG] UPDATED)\nAbstract: Instrumental variable (IV) regression is a standard strategy for learning causal relationships between confounded treatment and outcome variables from observational data by utilizing an instrumental variable, which affects the outcome only through the treatment. In classical IV regression, learning proceeds in two stages: stage 1 performs linear regression from the instrument to the treatment; and stage 2 performs linear regression from the treatment to the outcome, conditioned on the instrument. We propose a novel method, deep feature instrumental variable regression (DFIV), to address the case where relations between instruments, treatments, and outcomes may be nonlinear. In this case, deep neural nets are trained to define informative nonlinear features on the instruments and treatments. We propose an alternating training regime for these features to ensure good end-to-end performance when composing stages 1 and 2, thus obtaining highly flexible feature maps in a computationally eff",
    "path": "papers/20/10/2010.07154.json",
    "total_tokens": 980,
    "translated_title": "在工具变量回归中学习深度特征",
    "translated_abstract": "工具变量（IV）回归是一种在观测数据中利用仅通过处理影响结果的工具变量来学习混淆的处理和结果变量之间因果关系的标准策略。在传统的IV回归中，学习分为两个阶段：阶段1从工具变量到处理变量进行线性回归；阶段2在工具变量的条件下，从处理变量到结果变量进行线性回归。我们提出了一种新的方法，即深度特征工具变量回归（DFIV），用于处理工具变量、处理变量和结果变量之间可能是非线性关系的情况。在这种情况下，我们训练深度神经网络来定义工具变量和处理变量上的信息性非线性特征。我们提出了一种交替训练机制来训练这些特征，以保证通过组合阶段1和阶段2获得良好的端到端性能，从而在计算上获得高度灵活的特征映射。",
    "tldr": "本论文提出了一种名为深度特征工具变量回归（DFIV）的方法，用于处理观测数据中工具变量、处理变量和结果变量之间的非线性关系。通过训练深度神经网络来定义工具变量和处理变量上的非线性特征，我们提供了一种交替训练机制以获得良好的端到端性能。这种方法可以在计算上获得高度灵活的特征映射。",
    "en_tdlr": "This paper proposes a method called Deep Feature Instrumental Variable Regression (DFIV) to handle the nonlinear relationships between instrumental variables, treatment variables, and outcome variables in observational data. By training deep neural networks to define nonlinear features on instrumental variables and treatment variables, an alternating training regime is employed to achieve good end-to-end performance. This approach allows for highly flexible feature mapping computationally."
}