{
    "title": "Consistent Specification Test of the Quantile Autoregression",
    "abstract": "This paper proposes a test for the joint hypothesis of correct dynamic specification and no omitted latent factors for the Quantile Autoregression. If the composite null is rejected we proceed to disentangle the cause of rejection, i.e., dynamic misspecification or an omitted variable. We establish the asymptotic distribution of the test statistics under fairly weak conditions and show that factor estimation error is negligible. A Monte Carlo study shows that the suggested tests have good finite sample properties. Finally, we undertake an empirical illustration of modelling GDP growth and CPI inflation in the United Kingdom, where we find evidence that factor augmented models are correctly specified in contrast with their non-augmented counterparts when it comes to GDP growth, while also exploring the asymmetric behaviour of the growth and inflation distributions.",
    "link": "https://arxiv.org/abs/2010.03898",
    "context": "Title: Consistent Specification Test of the Quantile Autoregression\nAbstract: This paper proposes a test for the joint hypothesis of correct dynamic specification and no omitted latent factors for the Quantile Autoregression. If the composite null is rejected we proceed to disentangle the cause of rejection, i.e., dynamic misspecification or an omitted variable. We establish the asymptotic distribution of the test statistics under fairly weak conditions and show that factor estimation error is negligible. A Monte Carlo study shows that the suggested tests have good finite sample properties. Finally, we undertake an empirical illustration of modelling GDP growth and CPI inflation in the United Kingdom, where we find evidence that factor augmented models are correctly specified in contrast with their non-augmented counterparts when it comes to GDP growth, while also exploring the asymmetric behaviour of the growth and inflation distributions.",
    "path": "papers/20/10/2010.03898.json",
    "total_tokens": 857,
    "translated_title": "量子自回归的一致规范测试方法",
    "translated_abstract": "本文提出了一种用于量子自回归正确动态规范和无遗漏潜在因素的联合假设的测试方法。如果复合零假设被拒绝，我们进一步分析拒绝的原因，即动态规范错误或遗漏变量。我们在相对较弱的条件下确定了测试统计量的渐近分布，并证明因素估计误差可以忽略不计。蒙特卡罗研究表明，建议的测试具有良好的有限样本性质。最后，我们对英国的 GDP 增长和CPI 通货膨胀建模进行了实证分析，发现与非增强模型相比，因子增强模型在 GDP 增长方面正确规范，并探讨了增长和通货膨胀分布的非对称行为。",
    "tldr": "本文提出了一种用于量子自回归正确动态规范和无遗漏潜在因素的联合假设的测试方法，并且经过蒙特卡罗研究表明该方法具有良好的有限样本性质。同时，在实证分析中发现因子增强模型在 GDP 增长方面正确规范，并探讨了增长和通货膨胀分布的非对称行为。",
    "en_tdlr": "This paper proposes a test for the joint hypothesis of correct dynamic specification and no omitted latent factors for the Quantile Autoregression. The suggested test method has good finite sample properties and shows that factor augmented models are correctly specified for GDP growth, while exploring the asymmetric behavior of the growth and inflation distributions."
}