{
    "title": "Riemannian Langevin Algorithm for Solving Semidefinite Programs. (arXiv:2010.11176v6 [stat.ML] UPDATED)",
    "abstract": "We propose a Langevin diffusion-based algorithm for non-convex optimization and sampling on a product manifold of spheres. Under a logarithmic Sobolev inequality, we establish a guarantee for finite iteration convergence to the Gibbs distribution in terms of Kullback--Leibler divergence. We show that with an appropriate temperature choice, the suboptimality gap to the global minimum is guaranteed to be arbitrarily small with high probability.  As an application, we consider the Burer--Monteiro approach for solving a semidefinite program (SDP) with diagonal constraints, and analyze the proposed Langevin algorithm for optimizing the non-convex objective. In particular, we establish a logarithmic Sobolev inequality for the Burer--Monteiro problem when there are no spurious local minima, but under the presence saddle points. Combining the results, we then provide a global optimality guarantee for the SDP and the Max-Cut problem. More precisely, we show that the Langevin algorithm achieves ",
    "link": "http://arxiv.org/abs/2010.11176",
    "context": "Title: Riemannian Langevin Algorithm for Solving Semidefinite Programs. (arXiv:2010.11176v6 [stat.ML] UPDATED)\nAbstract: We propose a Langevin diffusion-based algorithm for non-convex optimization and sampling on a product manifold of spheres. Under a logarithmic Sobolev inequality, we establish a guarantee for finite iteration convergence to the Gibbs distribution in terms of Kullback--Leibler divergence. We show that with an appropriate temperature choice, the suboptimality gap to the global minimum is guaranteed to be arbitrarily small with high probability.  As an application, we consider the Burer--Monteiro approach for solving a semidefinite program (SDP) with diagonal constraints, and analyze the proposed Langevin algorithm for optimizing the non-convex objective. In particular, we establish a logarithmic Sobolev inequality for the Burer--Monteiro problem when there are no spurious local minima, but under the presence saddle points. Combining the results, we then provide a global optimality guarantee for the SDP and the Max-Cut problem. More precisely, we show that the Langevin algorithm achieves ",
    "path": "papers/20/10/2010.11176.json",
    "total_tokens": 996,
    "translated_title": "用黎曼Langevin算法求解半定向规划",
    "translated_abstract": "我们提出了一种基于 Langevin 扩散的算法，用于在球面的乘积流形上进行非凸优化和采样。在对数 Sobolev 不等式下，我们建立了一个有限迭代收敛到 Gibbs 分布的保证，这个保证是基于 Kullback-Leibler 散度的。我们展示了一个合适的温度选择，可以保证次优解到全局最小值的间隙概率极高地非常小。作为一个应用，我们考虑 Burer-Monteiro 方法用于解决带对角约束的半定向规划(SDP)，并分析了用于优化非凸目标的 Langevin 算法。特别地，我们证明了在没有虚假局部极小值的情况下，Burer-Monteiro 问题的对数 Sobolev 不等式是成立的，但这里存在鞍点。结合这些结果，我们提供了 SDP 和 Max-Cut 问题的全局最优性保证。更具体地说，我们展示了 Langevin 算法实现了这个保证。",
    "tldr": "研究了一种基于Langevin扩散的算法，用于在球面的乘积流形上进行非凸优化和采样，展示了在适当的温度选择下，该算法可以保证次优解到全局最小值的间隙概率非常小，并在此基础上提出了求解半定向规划模型的新方法，并给出了全局最优性的保证。",
    "en_tdlr": "A Langevin diffusion-based algorithm for non-convex optimization and sampling on a product manifold of spheres is proposed, with a guarantee for finite iteration convergence to the Gibbs distribution. An appropriate temperature choice ensures that the suboptimality gap to the global minimum is guaranteed to be arbitrarily small with high probability. The proposed method is applied to solve semidefinite programs with diagonal constraints and provides a global optimality guarantee."
}