{
    "title": "Machine Learning (In) Security: A Stream of Problems. (arXiv:2010.16045v2 [cs.CR] UPDATED)",
    "abstract": "Machine Learning (ML) has been widely applied to cybersecurity and is considered state-of-the-art for solving many of the open issues in that field. However, it is very difficult to evaluate how good the produced solutions are, since the challenges faced in security may not appear in other areas. One of these challenges is the concept drift, which increases the existing arms race between attackers and defenders: malicious actors can always create novel threats to overcome the defense solutions, which may not consider them in some approaches. Due to this, it is essential to know how to properly build and evaluate an ML-based security solution. In this paper, we identify, detail, and discuss the main challenges in the correct application of ML techniques to cybersecurity data. We evaluate how concept drift, evolution, delayed labels, and adversarial ML impact the existing solutions. Moreover, we address how issues related to data collection affect the quality of the results presented in ",
    "link": "http://arxiv.org/abs/2010.16045",
    "context": "Title: Machine Learning (In) Security: A Stream of Problems. (arXiv:2010.16045v2 [cs.CR] UPDATED)\nAbstract: Machine Learning (ML) has been widely applied to cybersecurity and is considered state-of-the-art for solving many of the open issues in that field. However, it is very difficult to evaluate how good the produced solutions are, since the challenges faced in security may not appear in other areas. One of these challenges is the concept drift, which increases the existing arms race between attackers and defenders: malicious actors can always create novel threats to overcome the defense solutions, which may not consider them in some approaches. Due to this, it is essential to know how to properly build and evaluate an ML-based security solution. In this paper, we identify, detail, and discuss the main challenges in the correct application of ML techniques to cybersecurity data. We evaluate how concept drift, evolution, delayed labels, and adversarial ML impact the existing solutions. Moreover, we address how issues related to data collection affect the quality of the results presented in ",
    "path": "papers/20/10/2010.16045.json",
    "total_tokens": 956,
    "translated_title": "机器学习（不）安全性：一系列问题",
    "translated_abstract": "机器学习（ML）已广泛应用于网络安全领域，并被认为是解决该领域许多开放问题的最先进技术。然而，由于安全领域面临的挑战在其他领域可能不会出现，因此很难评估所产生解决方案的好坏。其中一项挑战是概念漂移，它加剧了攻击者和防御者之间的对抗：恶意行为者始终可以创建新的威胁来克服防御解决方案，在某些方法中可能并未考虑这些威胁。因此，了解如何正确构建和评估基于ML的安全解决方案至关重要。在本文中，我们确定、详述和讨论了在将ML技术正确应用于网络安全数据中的主要挑战。我们评估了概念漂移、演化、延迟标签和对抗性ML对现有解决方案的影响。此外，我们还讨论了与数据收集相关的问题如何影响结果的质量。",
    "tldr": "本论文针对机器学习在网络安全领域的应用提出了一系列挑战，包括概念漂移、演化、延迟标签和对抗性机器学习对现有解决方案的影响，强调了正确构建和评估基于机器学习的安全解决方案的重要性。",
    "en_tdlr": "This paper presents a series of challenges in the application of machine learning in the field of cybersecurity, including concept drift, evolution, delayed labels, and the impact of adversarial machine learning on existing solutions, emphasizing the importance of properly building and evaluating ML-based security solutions."
}