{
    "title": "Data Assimilation Networks. (arXiv:2010.09694v3 [cs.LG] UPDATED)",
    "abstract": "Data assimilation (DA) aims at forecasting the state of a dynamical system by combining a mathematical representation of the system with noisy observations taking into account their uncertainties. State of the art methods are based on the Gaussian error statistics and the linearization of the non-linear dynamics which may lead to sub-optimal methods. In this respect, there are still open questions how to improve these methods. In this paper, we propose a fully data driven deep learning architecture generalizing recurrent Elman networks and data assimilation algorithms which approximate a sequence of prior and posterior densities conditioned on noisy observations. By construction our approach can be used for general nonlinear dynamics and non-Gaussian densities. On numerical experiments based on the well-known Lorenz-95 system and with Gaussian error statistics, our architecture achieves comparable performance to EnKF on both the analysis and the propagation of probability density funct",
    "link": "http://arxiv.org/abs/2010.09694",
    "context": "Title: Data Assimilation Networks. (arXiv:2010.09694v3 [cs.LG] UPDATED)\nAbstract: Data assimilation (DA) aims at forecasting the state of a dynamical system by combining a mathematical representation of the system with noisy observations taking into account their uncertainties. State of the art methods are based on the Gaussian error statistics and the linearization of the non-linear dynamics which may lead to sub-optimal methods. In this respect, there are still open questions how to improve these methods. In this paper, we propose a fully data driven deep learning architecture generalizing recurrent Elman networks and data assimilation algorithms which approximate a sequence of prior and posterior densities conditioned on noisy observations. By construction our approach can be used for general nonlinear dynamics and non-Gaussian densities. On numerical experiments based on the well-known Lorenz-95 system and with Gaussian error statistics, our architecture achieves comparable performance to EnKF on both the analysis and the propagation of probability density funct",
    "path": "papers/20/10/2010.09694.json",
    "total_tokens": 787,
    "translated_title": "数据同化网络。",
    "translated_abstract": "数据同化旨在通过结合系统的数学表示和考虑不确定性的嘈杂观察来预测动态系统的状态。现有的方法基于高斯误差统计和非线性动力学的线性化，可能导致次优方法。因此，如何改进这些方法仍有待研究。在本文中，我们提出了一种完全数据驱动的深度学习架构，它推广了循环Elman网络和数据同化算法，这些算法在给定嘈杂观察下近似于一系列先验和后验密度。该方法的构造使其可用于一般非线性动力学和非高斯密度。在基于著名的Lorenz-95系统和高斯误差统计的数字实验中，我们的架构在概率密度函数的分析和传播方面达到了与EnKF相当的性能。",
    "tldr": "本文提出了一种全数据驱动的深度学习架构，用于改进数据同化算法性能，该方法可用于一般非线性动力学和非高斯密度。",
    "en_tdlr": "This paper proposes a fully data-driven deep learning architecture to improve the performance of data assimilation algorithms, which can be used for general nonlinear dynamics and non-Gaussian densities."
}