{
    "title": "A $t$-test for synthetic controls. (arXiv:1812.10820v8 [econ.EM] UPDATED)",
    "abstract": "We propose a practical and robust method for making inferences on average treatment effects estimated by synthetic controls. We develop a $K$-fold cross-fitting procedure for bias correction. To avoid the difficult estimation of the long-run variance, inference is based on a self-normalized $t$-statistic, which has an asymptotically pivotal $t$-distribution. Our $t$-test is easy to implement, provably robust against misspecification, and valid with stationary and non-stationary data. It demonstrates an excellent small sample performance in application-based simulations and performs well relative to alternative methods. We illustrate the usefulness of the $t$-test by revisiting the effect of carbon taxes on emissions.",
    "link": "http://arxiv.org/abs/1812.10820",
    "context": "Title: A $t$-test for synthetic controls. (arXiv:1812.10820v8 [econ.EM] UPDATED)\nAbstract: We propose a practical and robust method for making inferences on average treatment effects estimated by synthetic controls. We develop a $K$-fold cross-fitting procedure for bias correction. To avoid the difficult estimation of the long-run variance, inference is based on a self-normalized $t$-statistic, which has an asymptotically pivotal $t$-distribution. Our $t$-test is easy to implement, provably robust against misspecification, and valid with stationary and non-stationary data. It demonstrates an excellent small sample performance in application-based simulations and performs well relative to alternative methods. We illustrate the usefulness of the $t$-test by revisiting the effect of carbon taxes on emissions.",
    "path": "papers/18/12/1812.10820.json",
    "total_tokens": 856,
    "translated_title": "用于合成控制的$t$检验",
    "translated_abstract": "我们提出了一种实用且鲁棒的方法，用于对合成控制估计的平均处理效应进行推断。我们开发了一个$K$-折交叉拟合的偏差校正程序。为了避免长期方差的困难估计，推断基于自归一化$t$统计量，该统计量在渐近上服从关键的$t$分布。我们的$t$-检验易于实施，证明了在规范错误下的鲁棒性，并且适用于平稳和非平稳数据。在基于应用的模拟中，我们展示了这种方法在小样本情况下的优良性能，并且相对于替代方法表现良好。我们通过重新思考碳税对排放的影响来展示了$t$-检验的有用性。",
    "tldr": "我们提出了一个用于合成控制的$t$检验方法，它易于实施，具有鲁棒性，并且适用于规范错误的情况和平稳与非平稳数据。在模拟实验中表现出良好的小样本性能，并相对于其他方法而言效果良好。我们通过研究碳税对排放的影响展示了该方法的实用性。",
    "en_tdlr": "We propose a $t$-test method for synthetic controls that is easy to implement, robust against misspecification, and valid for both stationary and non-stationary data. It demonstrates excellent performance in small sample scenarios and performs well compared to alternative methods. We illustrate its usefulness by studying the effect of carbon taxes on emissions."
}