{
    "title": "Optimal consumption with loss aversion and reference to past spending maximum",
    "abstract": "arXiv:2108.02648v5 Announce Type: replace-cross  Abstract: This paper studies an optimal consumption problem for a loss-averse agent with reference to past consumption maximum. To account for loss aversion on relative consumption, an S-shaped utility is adopted that measures the difference between the non-negative consumption rate and a fraction of the historical spending peak. We consider the concave envelope of the utility with respect to consumption, allowing us to focus on an auxiliary HJB variational inequality on the strength of concavification principle and dynamic programming arguments. By applying the dual transform and smooth-fit conditions, the auxiliary HJB variational inequality is solved in piecewise closed-form and some thresholds of the wealth variable are obtained. The optimal consumption and investment control can be derived in the piecewise feedback form. The rigorous verification proofs on optimality and concavification principle are provided. Some numerical sensiti",
    "link": "https://arxiv.org/abs/2108.02648",
    "context": "Title: Optimal consumption with loss aversion and reference to past spending maximum\nAbstract: arXiv:2108.02648v5 Announce Type: replace-cross  Abstract: This paper studies an optimal consumption problem for a loss-averse agent with reference to past consumption maximum. To account for loss aversion on relative consumption, an S-shaped utility is adopted that measures the difference between the non-negative consumption rate and a fraction of the historical spending peak. We consider the concave envelope of the utility with respect to consumption, allowing us to focus on an auxiliary HJB variational inequality on the strength of concavification principle and dynamic programming arguments. By applying the dual transform and smooth-fit conditions, the auxiliary HJB variational inequality is solved in piecewise closed-form and some thresholds of the wealth variable are obtained. The optimal consumption and investment control can be derived in the piecewise feedback form. The rigorous verification proofs on optimality and concavification principle are provided. Some numerical sensiti",
    "path": "papers/21/08/2108.02648.json",
    "total_tokens": 875,
    "translated_title": "具有损失厌恶和参考过去消费最大值的最优消费",
    "translated_abstract": "本文研究了具有损失厌恶特征和参考过去消费最大值的最优消费问题。为了考虑相对消费的损失厌恶，采用了一个S形效用函数，该函数衡量非负消费率与历史消费峰值的比例之间的差异。我们考虑了效用相对于消费的凹包络，从而可以集中研究关于辅助HJB变分不等式的凹化原理和动态规划论证。通过应用对偶变换和光滑适配条件，辅助HJB变分不等式被分段闭合式解决，得到了财富变量的一些阈值。最优消费和投资控制可以以分段反馈形式导出。对于最优性与凹化原理的严格验证证明被提供。一些数值灵敏度",
    "tldr": "该论文研究了具有损失厌恶和参考过去消费最大值特征的最优消费问题，提出了一个S形效用函数来衡量相对消费的损失厌恶，通过凹包络的方式以及辅助HJB变分不等式等方法得出了最优消费和投资控制。",
    "en_tdlr": "This paper studies an optimal consumption problem for a loss-averse agent with reference to past consumption maximum, proposing an S-shaped utility to measure loss aversion on relative consumption, and deriving optimal consumption and investment control through methods like concave envelope and auxiliary HJB variational inequality."
}