{
    "title": "Transfer-Recursive-Ensemble Learning for Multi-Day COVID-19 Prediction in India using Recurrent Neural Networks. (arXiv:2108.09131v2 [cs.LG] UPDATED)",
    "abstract": "The current COVID-19 pandemic has put a huge challenge on the Indian health infrastructure. With more and more people getting affected during the second wave, the hospitals were over-burdened, running out of supplies and oxygen. In this scenario, prediction of the number of COVID-19 cases beforehand might have helped in the better utilization of limited resources and supplies. This manuscript deals with the prediction of new COVID-19 cases, new deaths and total active cases for multiple days in advance. The proposed method uses gated recurrent unit networks as the main predicting model. A study is conducted by building four models that are pre-trained on the data from four different countries (United States of America, Brazil, Spain and Bangladesh) and are fine-tuned or retrained on India's data. Since the four countries chosen have experienced different types of infection curves, the pre-training provides a transfer learning to the models incorporating diverse situations into account.",
    "link": "http://arxiv.org/abs/2108.09131",
    "context": "Title: Transfer-Recursive-Ensemble Learning for Multi-Day COVID-19 Prediction in India using Recurrent Neural Networks. (arXiv:2108.09131v2 [cs.LG] UPDATED)\nAbstract: The current COVID-19 pandemic has put a huge challenge on the Indian health infrastructure. With more and more people getting affected during the second wave, the hospitals were over-burdened, running out of supplies and oxygen. In this scenario, prediction of the number of COVID-19 cases beforehand might have helped in the better utilization of limited resources and supplies. This manuscript deals with the prediction of new COVID-19 cases, new deaths and total active cases for multiple days in advance. The proposed method uses gated recurrent unit networks as the main predicting model. A study is conducted by building four models that are pre-trained on the data from four different countries (United States of America, Brazil, Spain and Bangladesh) and are fine-tuned or retrained on India's data. Since the four countries chosen have experienced different types of infection curves, the pre-training provides a transfer learning to the models incorporating diverse situations into account.",
    "path": "papers/21/08/2108.09131.json",
    "total_tokens": 929,
    "translated_title": "基于递归转移集成学习的循环神经网络预测印度多日COVID-19疫情趋势",
    "translated_abstract": "当前的COVID-19大流行给印度的医疗基础设施带来了巨大挑战。在第二波疫情中，越来越多的人感染，医院负担过重，物资和氧气短缺。在这种情况下，提前预测COVID-19病例数量可能有助于更好地利用有限的资源和物资。本文涉及多日预测新的COVID-19病例、新的死亡人数和总活动病例。所提出的方法主要使用门控循环单元网络作为预测模型。通过建立四个预先训练在不同国家（美国、巴西、西班牙和孟加拉国）数据上的模型，并在印度的数据上进行微调或重新训练的研究。由于所选择的四个国家经历了不同类型的感染曲线，因此预训练为模型提供了迁移学习，考虑到了不同的情况。",
    "tldr": "本文提出了基于循环神经网络的预测新冠病例数量的方法，并利用递归转移集成学习和预训练模型，实现了印度多日COVID-19疫情趋势的预测。",
    "en_tdlr": "This paper proposes a method of predicting the number of new COVID-19 cases based on recurrent neural networks, and uses transfer-recursive-ensemble learning and pre-trained models to predict the COVID-19 trends in India for multiple days in advance."
}