{
    "title": "Revisiting Event Study Designs: Robust and Efficient Estimation. (arXiv:2108.12419v3 [econ.EM] UPDATED)",
    "abstract": "We develop a framework for difference-in-differences designs with staggered treatment adoption and heterogeneous causal effects. We show that conventional regression-based estimators fail to provide unbiased estimates of relevant estimands absent strong restrictions on treatment-effect homogeneity. We then derive the efficient estimator addressing this challenge, which takes an intuitive \"imputation\" form when treatment-effect heterogeneity is unrestricted. We characterize the asymptotic behavior of the estimator, propose tools for inference, and develop tests for identifying assumptions. Our method applies with time-varying controls, in triple-difference designs, and with certain non-binary treatments. We show the practical relevance of our results in a simulation study and an application. Studying the consumption response to tax rebates in the United States, we find that the notional marginal propensity to consume is between 8 and 11 percent in the first quarter - about half as large",
    "link": "http://arxiv.org/abs/2108.12419",
    "context": "Title: Revisiting Event Study Designs: Robust and Efficient Estimation. (arXiv:2108.12419v3 [econ.EM] UPDATED)\nAbstract: We develop a framework for difference-in-differences designs with staggered treatment adoption and heterogeneous causal effects. We show that conventional regression-based estimators fail to provide unbiased estimates of relevant estimands absent strong restrictions on treatment-effect homogeneity. We then derive the efficient estimator addressing this challenge, which takes an intuitive \"imputation\" form when treatment-effect heterogeneity is unrestricted. We characterize the asymptotic behavior of the estimator, propose tools for inference, and develop tests for identifying assumptions. Our method applies with time-varying controls, in triple-difference designs, and with certain non-binary treatments. We show the practical relevance of our results in a simulation study and an application. Studying the consumption response to tax rebates in the United States, we find that the notional marginal propensity to consume is between 8 and 11 percent in the first quarter - about half as large",
    "path": "papers/21/08/2108.12419.json",
    "total_tokens": 1012,
    "translated_title": "重新审视事件研究设计：稳健且高效的估计方法",
    "translated_abstract": "我们开发了一种差异法和错落收治采用的设计框架，考虑到异质性因果效应。我们发现，传统的基于回归的估计方法在没有强制要求治疗效应同质性时无法提供相关估计的无偏估计。然后，我们推导了一种解决这一挑战的有效估计方法，当治疗效应的异质性未受限制时，该方法具有直观的“插补”形式。我们表征了该估计器的渐近行为，提出了推断工具，并开展了用于识别假设的测试。我们的方法适用于有时间变化的控制变量、三重差异设计和某些非二进制治疗。通过模拟研究和一个应用研究，我们展示了我们结果的实际相关性。在研究美国税务回扣对消费反应时，我们发现，在第一季度，名义消费倾向边际在8%到11%之间，大约是文献中估计值的一半。",
    "tldr": "本研究对事件研究设计提出了稳健且高效的估计方法，该方法适用于时间变化的控制变量、三重差异设计和某些非二进制治疗。在应用研究中，研究美国税务回扣对消费反应时，发现名义消费倾向边际约为文献中估计值的一半。",
    "en_tdlr": "This study proposes a robust and efficient estimation method for event study designs with staggered treatment adoption and heterogeneous causal effects, which can be applied with time-varying controls, in triple-difference designs, and with certain non-binary treatments. The application of the method in studying the consumption response to tax rebates in the United States finds that the notional marginal propensity to consume is about half as large as estimated in the literature."
}