{
    "title": "A Pomeranzian Growth Theory of the Great Divergence",
    "abstract": "arXiv:2108.03110v3 Announce Type: replace  Abstract: This study constructs a growth model of the Great Divergence that formalizes Pomeranz's (2000) hypothesis that the relief of land constraints in Europe has caused divergence in economic growth between Europe and China since the 19th century. The model consists of the agricultural and manufacturing sectors. The agricultural sector produces subsistence goods from land, intermediate goods from the manufacturing sector, and labor. The manufacturing sector produces goods from labor, and its productivity grows through the learning-by-doing of full-time manufacturing workers. Households make fertility decisions. In the model, a large exogenous positive shock in land supply causes the transition of the economy from the Malthusian state, in which all workers are engaged in agricultural production and per capita income is constant, to the non-Malthusian state, in which the share of workers engaged in agricultural production gradually decreases",
    "link": "https://arxiv.org/abs/2108.03110",
    "context": "Title: A Pomeranzian Growth Theory of the Great Divergence\nAbstract: arXiv:2108.03110v3 Announce Type: replace  Abstract: This study constructs a growth model of the Great Divergence that formalizes Pomeranz's (2000) hypothesis that the relief of land constraints in Europe has caused divergence in economic growth between Europe and China since the 19th century. The model consists of the agricultural and manufacturing sectors. The agricultural sector produces subsistence goods from land, intermediate goods from the manufacturing sector, and labor. The manufacturing sector produces goods from labor, and its productivity grows through the learning-by-doing of full-time manufacturing workers. Households make fertility decisions. In the model, a large exogenous positive shock in land supply causes the transition of the economy from the Malthusian state, in which all workers are engaged in agricultural production and per capita income is constant, to the non-Malthusian state, in which the share of workers engaged in agricultural production gradually decreases",
    "path": "papers/21/08/2108.03110.json",
    "total_tokens": 860,
    "translated_title": "一个关于大分歧的波莫兰增长理论",
    "translated_abstract": "这项研究构建了一个关于大分歧的增长模型，形式化了波莫兰兹（2000）的假设，即欧洲土地限制的缓解导致了自19世纪以来欧洲与中国经济增长之间的分歧。该模型由农业和制造业组成。农业部门从土地上生产生活必需品、来自制造业的中间品和劳动力。制造业部门通过全职制造业工人的实践成长来生产商品。家庭做出生育决策。在模型中，对土地供应的大规模外生性正面冲击使经济从马尔萨斯状态转变为非马尔萨斯状态，其中所有工人都从事农业生产，人均收入恒定，到参与农业生产的工人比例逐渐减少。",
    "tldr": "基于欧洲土地限制缓解导致的大分歧假设，这个研究构建了一个增长模型，对农业和制造业部门进行了形式化，并展示了经济从马尔萨斯状态向非马尔萨斯状态转变的过程。"
}