{
    "title": "Causal Inference with Noncompliance and Unknown Interference. (arXiv:2108.07455v3 [stat.ME] UPDATED)",
    "abstract": "We consider a causal inference model in which individuals interact in a social network and they may not comply with the assigned treatments. In particular, we suppose that the form of network interference is unknown to researchers. To estimate meaningful causal parameters in this situation, we introduce a new concept of exposure mapping, which summarizes potentially complicated spillover effects into a fixed dimensional statistic of instrumental variables. We investigate identification conditions for the intention-to-treat effects and the average treatment effects for compliers, while explicitly considering the possibility of misspecification of exposure mapping. Based on our identification results, we develop nonparametric estimation procedures via inverse probability weighting. Their asymptotic properties, including consistency and asymptotic normality, are investigated using an approximate neighborhood interference framework. For an empirical illustration, we apply our method to exp",
    "link": "http://arxiv.org/abs/2108.07455",
    "context": "Title: Causal Inference with Noncompliance and Unknown Interference. (arXiv:2108.07455v3 [stat.ME] UPDATED)\nAbstract: We consider a causal inference model in which individuals interact in a social network and they may not comply with the assigned treatments. In particular, we suppose that the form of network interference is unknown to researchers. To estimate meaningful causal parameters in this situation, we introduce a new concept of exposure mapping, which summarizes potentially complicated spillover effects into a fixed dimensional statistic of instrumental variables. We investigate identification conditions for the intention-to-treat effects and the average treatment effects for compliers, while explicitly considering the possibility of misspecification of exposure mapping. Based on our identification results, we develop nonparametric estimation procedures via inverse probability weighting. Their asymptotic properties, including consistency and asymptotic normality, are investigated using an approximate neighborhood interference framework. For an empirical illustration, we apply our method to exp",
    "path": "papers/21/08/2108.07455.json",
    "total_tokens": 839,
    "translated_title": "非遵从和未知干扰的因果推断",
    "translated_abstract": "我们考虑一个因果推断模型，其中个体在社交网络中相互作用，并且可能不遵从被分配的治疗方案。特别地，我们假设网络干扰形式对研究人员是未知的。为了在这种情况下估计有意义的因果参数，我们引入了一个新的曝光映射概念，将潜在复杂的溢出效应总结为固定维度的工具变量统计量。我们研究了意向治疗效应和遵从者的平均治疗效应的识别条件，同时明确考虑到曝光映射错误规定的可能性。基于我们的识别结果，我们通过逆概率加权开发了非参数估计过程。它们的渐近性质，包括一种近似邻域干扰框架下的一致性和渐近正态性。为了一个实证示例，我们将我们的方法应用于实验数据。",
    "tldr": "该论文提出了一个基于曝光映射的新概念，以解决个体在社交网络中相互作用且可能不遵从治疗方案的情况下的因果推断问题。",
    "en_tdlr": "This paper proposes a new concept of exposure mapping to address the causal inference problem in which individuals interact in a social network and may not comply with treatment assignments."
}