{
    "title": "Improving Human Sequential Decision-Making with Reinforcement Learning. (arXiv:2108.08454v4 [cs.LG] UPDATED)",
    "abstract": "Workers spend a significant amount of time learning how to make good decisions. Evaluating the efficacy of a given decision, however, can be complicated -- e.g., decision outcomes are often long-term and relate to the original decision in complex ways. Surprisingly, even though learning good decision-making strategies is difficult, they can often be expressed in simple and concise forms. Focusing on sequential decision-making, we design a novel machine learning algorithm that is capable of extracting \"best practices\" from trace data and conveying its insights to humans in the form of interpretable \"tips\". Our algorithm selects the tip that best bridges the gap between the actions taken by human workers and those taken by the optimal policy in a way that accounts for which actions are consequential for achieving higher performance. We evaluate our approach through a series of randomized controlled experiments where participants manage a virtual kitchen. Our experiments show that the tip",
    "link": "http://arxiv.org/abs/2108.08454",
    "context": "Title: Improving Human Sequential Decision-Making with Reinforcement Learning. (arXiv:2108.08454v4 [cs.LG] UPDATED)\nAbstract: Workers spend a significant amount of time learning how to make good decisions. Evaluating the efficacy of a given decision, however, can be complicated -- e.g., decision outcomes are often long-term and relate to the original decision in complex ways. Surprisingly, even though learning good decision-making strategies is difficult, they can often be expressed in simple and concise forms. Focusing on sequential decision-making, we design a novel machine learning algorithm that is capable of extracting \"best practices\" from trace data and conveying its insights to humans in the form of interpretable \"tips\". Our algorithm selects the tip that best bridges the gap between the actions taken by human workers and those taken by the optimal policy in a way that accounts for which actions are consequential for achieving higher performance. We evaluate our approach through a series of randomized controlled experiments where participants manage a virtual kitchen. Our experiments show that the tip",
    "path": "papers/21/08/2108.08454.json",
    "total_tokens": 919,
    "translated_title": "用强化学习改进人类的顺序决策",
    "translated_abstract": "工作者花费大量时间学习如何做出正确决策。然而，评估一个给定决策的有效性可能很复杂，例如，决策结果通常是长期的，并且与原始决策之间存在复杂的关系。令人惊讶的是，尽管学习良好的决策策略很困难，但它们通常可以简洁明了地表达。针对顺序决策，我们设计了一种新颖的机器学习算法，能够从追踪数据中提取“最佳实践”并以可解释的“提示”的形式传达其见解给人类。我们的算法选择最佳的提示，以填补人类工作者采取的行动与最优策略之间的差距，同时考虑哪些行动对于提高性能具有重要意义。我们通过一系列随机对照实验评估了我们的方法，参与者管理一个虚拟厨房。我们的实验证明，提示可以显著提高性能。",
    "tldr": "该论文提出了一种利用机器学习算法从追踪数据中提取\"最佳实践\"并向人类传达的方法，以改进人类的顺序决策。通过一系列实验证实，在虚拟厨房管理任务中，这种方法能够显著提高性能。",
    "en_tdlr": "This paper presents a method that uses machine learning algorithms to extract \"best practices\" from trace data and convey them to humans, aiming to improve human sequential decision-making. Through a series of experiments, the method significantly improves performance in a virtual kitchen management task."
}