{
    "title": "Beyond Cuts in Small Signal Scenarios -- Enhanced Sneutrino Detectability Using Machine Learning. (arXiv:2108.03125v3 [hep-ph] UPDATED)",
    "abstract": "We investigate enhancing the sensitivity of new physics searches at the LHC by machine learning in the case of background dominance and a high degree of overlap between the observables for signal and background. We use two different models, XGBoost and a deep neural network, to exploit correlations between observables and compare this approach to the traditional cut-and-count method. We consider different methods to analyze the models' output, finding that a template fit generally performs better than a simple cut. By means of a Shapley decomposition, we gain additional insight into the relationship between event kinematics and the machine learning model output. We consider a supersymmetric scenario with a metastable sneutrino as a concrete example, but the methodology can be applied to a much wider class of models.",
    "link": "http://arxiv.org/abs/2108.03125",
    "context": "Title: Beyond Cuts in Small Signal Scenarios -- Enhanced Sneutrino Detectability Using Machine Learning. (arXiv:2108.03125v3 [hep-ph] UPDATED)\nAbstract: We investigate enhancing the sensitivity of new physics searches at the LHC by machine learning in the case of background dominance and a high degree of overlap between the observables for signal and background. We use two different models, XGBoost and a deep neural network, to exploit correlations between observables and compare this approach to the traditional cut-and-count method. We consider different methods to analyze the models' output, finding that a template fit generally performs better than a simple cut. By means of a Shapley decomposition, we gain additional insight into the relationship between event kinematics and the machine learning model output. We consider a supersymmetric scenario with a metastable sneutrino as a concrete example, but the methodology can be applied to a much wider class of models.",
    "path": "papers/21/08/2108.03125.json",
    "total_tokens": 948,
    "translated_title": "利用机器学习提高Sneutrino探测效率——在小信号场景中超越削减方法",
    "translated_abstract": "本文提出了一种利用机器学习增强LHC新物理搜索灵敏度的方法，特别是在背景支配和信号与背景在可观测量上存在高度重叠的情况下。我们使用了两种不同的模型，XGBoost和深度神经网络，利用可观测量之间的相关性，并将这种方法与传统的削减-计数方法进行了比较。我们考虑了不同的方法来分析模型的输出，并发现模板拟合通常比简单的削减方法表现更好。通过Shapley分解，我们获得了对事件运动学和机器学习模型输出之间关系的额外洞察。我们以具体的亚稳Sneutrino超对称情景为例，但该方法可以应用于更广泛的模型类别中。",
    "tldr": "本研究提出一种利用机器学习的方式，在信号与背景高度重叠的情况下增强LHC新物理探测的灵敏度。使用XGBoost和深度神经网络模型来利用可观测量之间的相关性比传统的削减-计数方法更有效，并采用模板拟合方法分析模型输出。",
    "en_tdlr": "This study proposes a machine learning approach to enhance the sensitivity of new physics searches at LHC, especially in scenarios with high degree of overlap between signal and background observables. By utilizing XGBoost and deep neural network models to exploit correlations among observables, this approach outperforms the traditional cut-and-count method, and template fit method is found to be generally better. A Shapley decomposition is used to gain additional insights into the relationship between event kinematics and machine learning model output. The methodology is demonstrated by considering a specific supersymmetric scenario with a metastable sneutrino, but it can be applied to a wider class of models."
}