{
    "title": "A Partial Order on Preference Profiles. (arXiv:2108.08465v2 [econ.TH] UPDATED)",
    "abstract": "We propose a theoretical framework under which preference profiles can be meaningfully compared. Specifically, given a finite set of feasible allocations and a preference profile, we first define a ranking vector of an allocation as the vector of all individuals' rankings of this allocation. We then define a partial order on preference profiles and write \"$P \\geq P^{'}$\", if there exists an onto mapping $\\psi$ from the Pareto frontier of $P^{'}$ onto the Pareto frontier of $P$, such that the ranking vector of any Pareto efficient allocation $x$ under $P^{'}$ is weakly dominated by the ranking vector of the image allocation $\\psi(x)$ under $P$. We provide a characterization of the maximal and minimal elements under the partial order. In particular, we illustrate how an individualistic form of social preferences can be maximal in a specific setting. We also discuss how the framework can be further generalized to incorporate additional economic ingredients.",
    "link": "http://arxiv.org/abs/2108.08465",
    "context": "Title: A Partial Order on Preference Profiles. (arXiv:2108.08465v2 [econ.TH] UPDATED)\nAbstract: We propose a theoretical framework under which preference profiles can be meaningfully compared. Specifically, given a finite set of feasible allocations and a preference profile, we first define a ranking vector of an allocation as the vector of all individuals' rankings of this allocation. We then define a partial order on preference profiles and write \"$P \\geq P^{'}$\", if there exists an onto mapping $\\psi$ from the Pareto frontier of $P^{'}$ onto the Pareto frontier of $P$, such that the ranking vector of any Pareto efficient allocation $x$ under $P^{'}$ is weakly dominated by the ranking vector of the image allocation $\\psi(x)$ under $P$. We provide a characterization of the maximal and minimal elements under the partial order. In particular, we illustrate how an individualistic form of social preferences can be maximal in a specific setting. We also discuss how the framework can be further generalized to incorporate additional economic ingredients.",
    "path": "papers/21/08/2108.08465.json",
    "total_tokens": 914,
    "translated_title": "偏好档案的偏序关系",
    "translated_abstract": "我们提出了一个理论框架，可以有意义地比较偏好档案。具体来说，给定一组有限的可行分配和一个偏好档案，我们首先将分配的排序向量定义为该分配所有个体对于该分配的排名的向量。然后我们定义了一个偏好档案的偏序关系，并写作\"$P \\geq P^{'}$\"，如果存在一个到映射$\\psi$，将$P^{'}$的帕累托前沿映射到$P$的帕累托前沿上，使得在$P^{'}$下的任何帕累托高效分配$x$的排名向量都被$P$下的映像分配$\\psi(x)$的排名向量弱支配。我们提供了偏序关系下极大元素和极小元素的刻画。特别地，我们说明了在特定情况下，一种个人主义形式的社会偏好可以成为最大化偏序关系下的极大元素。我们还讨论了如何进一步推广这个框架来包括更多的经济元素。",
    "tldr": "该论文提出了一个理论框架来比较偏好档案，并定义了偏好档案的偏序关系。根据该理论框架，一种个人主义形式的社会偏好可以成为最大化偏序关系下的极大元素。",
    "en_tdlr": "This paper proposes a theoretical framework to compare preference profiles and defines a partial order on preference profiles. According to this framework, an individualistic form of social preferences can be a maximal element in the partial order."
}