{
    "title": "Dynamic Relevance Learning for Few-Shot Object Detection. (arXiv:2108.02235v3 [cs.CV] UPDATED)",
    "abstract": "Expensive bounding-box annotations have limited the development of object detection task. Thus, it is necessary to focus on more challenging task of few-shot object detection. It requires the detector to recognize objects of novel classes with only a few training samples. Nowadays, many existing popular methods adopting training way similar to meta-learning have achieved promising performance, such as Meta R-CNN series. However, support data is only used as the class attention to guide the detecting of query images each time. Their relevance to each other remains unexploited. Moreover, a lot of recent works treat the support data and query images as independent branch without considering the relationship between them. To address this issue, we propose a dynamic relevance learning model, which utilizes the relationship between all support images and Region of Interest (RoI) on the query images to construct a dynamic graph convolutional network (GCN). By adjusting the prediction distribu",
    "link": "http://arxiv.org/abs/2108.02235",
    "context": "Title: Dynamic Relevance Learning for Few-Shot Object Detection. (arXiv:2108.02235v3 [cs.CV] UPDATED)\nAbstract: Expensive bounding-box annotations have limited the development of object detection task. Thus, it is necessary to focus on more challenging task of few-shot object detection. It requires the detector to recognize objects of novel classes with only a few training samples. Nowadays, many existing popular methods adopting training way similar to meta-learning have achieved promising performance, such as Meta R-CNN series. However, support data is only used as the class attention to guide the detecting of query images each time. Their relevance to each other remains unexploited. Moreover, a lot of recent works treat the support data and query images as independent branch without considering the relationship between them. To address this issue, we propose a dynamic relevance learning model, which utilizes the relationship between all support images and Region of Interest (RoI) on the query images to construct a dynamic graph convolutional network (GCN). By adjusting the prediction distribu",
    "path": "papers/21/08/2108.02235.json",
    "total_tokens": 895,
    "translated_title": "少样本目标检测的动态关联学习",
    "translated_abstract": "昂贵的边界框注释限制了目标检测任务的发展。因此，有必要关注更具挑战性的少样本目标检测任务。这需要仅使用少量训练样本的检测器识别新类别的对象。当今，许多现有的流行方法采用类似于元学习的训练方式，如Meta R-CNN系列，已经取得了有前途的性能。然而，支持数据仅作为类别注意力，以引导每次查询图像的检测。它们彼此的相关性仍然未被开发。此外，许多最近的工作将支持数据和查询图像视为独立分支，而不考虑它们之间的关系。为了解决这个问题，我们提出了一个动态关联学习模型，它利用所有支持图像和查询图像上的感兴趣区域（RoI）之间的关系来构建一个动态图卷积网络（GCN）。通过调整预测分布，模型可以适应不同的任务。",
    "tldr": "本研究提出了一种动态关联学习模型来进行少样本目标检测。该模型利用所有支持图像和查询图像上的感兴趣区域之间的关系来构建动态GCN，并适应不同的任务。"
}