{
    "title": "Data-Driven Constitutive Relation Reveals Scaling Law for Hydrodynamic Transport Coefficients. (arXiv:2108.00413v4 [physics.flu-dyn] UPDATED)",
    "abstract": "Finding extended hydrodynamics equations valid from the dense gas region to the rarefied gas region remains a great challenge. The key to success is to obtain accurate constitutive relations for stress and heat flux. Data-driven models offer a new phenomenological approach to learning constitutive relations from data. Such models enable complex constitutive relations that extend Newton's law of viscosity and Fourier's law of heat conduction by regression on higher derivatives. However, the choices of derivatives in these models are ad-hoc without a clear physical explanation. We investigated data-driven models theoretically on a linear system. We argue that these models are equivalent to non-linear length scale scaling laws of transport coefficients. The equivalence to scaling laws justified the physical plausibility and revealed the limitation of data-driven models. Our argument also points out that modeling the scaling law could avoid practical difficulties in data-driven models like",
    "link": "http://arxiv.org/abs/2108.00413",
    "context": "Title: Data-Driven Constitutive Relation Reveals Scaling Law for Hydrodynamic Transport Coefficients. (arXiv:2108.00413v4 [physics.flu-dyn] UPDATED)\nAbstract: Finding extended hydrodynamics equations valid from the dense gas region to the rarefied gas region remains a great challenge. The key to success is to obtain accurate constitutive relations for stress and heat flux. Data-driven models offer a new phenomenological approach to learning constitutive relations from data. Such models enable complex constitutive relations that extend Newton's law of viscosity and Fourier's law of heat conduction by regression on higher derivatives. However, the choices of derivatives in these models are ad-hoc without a clear physical explanation. We investigated data-driven models theoretically on a linear system. We argue that these models are equivalent to non-linear length scale scaling laws of transport coefficients. The equivalence to scaling laws justified the physical plausibility and revealed the limitation of data-driven models. Our argument also points out that modeling the scaling law could avoid practical difficulties in data-driven models like",
    "path": "papers/21/08/2108.00413.json",
    "total_tokens": 858,
    "translated_title": "基于数据的本构关系揭示流体力学传输系数的比例定律",
    "translated_abstract": "寻找从高密度气体到稀薄气体区域均适用的扩展流体力学方程仍是一个重大挑战，成功的关键在于获得精确的应力和热流的本构关系。基于数据的模型通过对高阶导数的回归，使得本构关系能够扩展牛顿粘度定律和傅里叶热传导定律。然而，这些模型中导数的选择是即兴决策的，缺乏明确的物理解释。我们对线性系统进行了理论探究，并认为这些模型相当于非线性长度尺度比例定律。比例定律的等效性证明了它的物理可行性，并揭示了基于数据的模型的局限性。我们的观点还指出，建模比例定律可以避免基于数据的模型中的实际困难，如：",
    "tldr": "本文研究了基于数据的模型中导数选择及其局限性，认为这些模型相当于非线性长度尺度比例定律，建模比例定律可避免实际困难。",
    "en_tdlr": "This paper studies the derivative selection and limitations in data-driven models, and argues that these models are equivalent to non-linear length scale scaling laws of transport coefficients. Modeling scaling laws can avoid practical difficulties in data-driven models."
}