{
    "title": "Cooperation for Scalable Supervision of Autonomy in Mixed Traffic. (arXiv:2112.07569v2 [cs.LG] UPDATED)",
    "abstract": "Advances in autonomy offer the potential for dramatic positive outcomes in a number of domains, yet enabling their safe deployment remains an open problem. This work's motivating question is: In safety-critical settings, can we avoid the need to have one human supervise one machine at all times? The work formalizes this scalable supervision problem by considering remotely located human supervisors and investigating how autonomous agents can cooperate to achieve safety. This article focuses on the safety-critical context of autonomous vehicles (AVs) merging into traffic consisting of a mixture of AVs and human drivers. The analysis establishes high reliability upper bounds on human supervision requirements. It further shows that AV cooperation can improve supervision reliability by orders of magnitude and counterintuitively requires fewer supervisors (per AV) as more AVs are adopted. These analytical results leverage queuing-theoretic analysis, order statistics, and a conservative, reac",
    "link": "http://arxiv.org/abs/2112.07569",
    "context": "Title: Cooperation for Scalable Supervision of Autonomy in Mixed Traffic. (arXiv:2112.07569v2 [cs.LG] UPDATED)\nAbstract: Advances in autonomy offer the potential for dramatic positive outcomes in a number of domains, yet enabling their safe deployment remains an open problem. This work's motivating question is: In safety-critical settings, can we avoid the need to have one human supervise one machine at all times? The work formalizes this scalable supervision problem by considering remotely located human supervisors and investigating how autonomous agents can cooperate to achieve safety. This article focuses on the safety-critical context of autonomous vehicles (AVs) merging into traffic consisting of a mixture of AVs and human drivers. The analysis establishes high reliability upper bounds on human supervision requirements. It further shows that AV cooperation can improve supervision reliability by orders of magnitude and counterintuitively requires fewer supervisors (per AV) as more AVs are adopted. These analytical results leverage queuing-theoretic analysis, order statistics, and a conservative, reac",
    "path": "papers/21/12/2112.07569.json",
    "total_tokens": 946,
    "translated_title": "混合交通中可扩展监管自主性的合作",
    "translated_abstract": "自主性的进步为许多领域带来了巨大的积极成果，但实现其安全部署仍然是一个未解决的问题。本文以如下动机为出发点：在安全关键的情况下，我们能否避免需要一个人始终监督一个机器？通过考虑远程人类监管员的情况，本文规范化了这个可扩展监管问题，并研究了自主代理如何合作以实现安全。本文着重探讨了自动驾驶车辆（AVs）在由AVs和人类驾驶员混合组成的交通中合并的安全关键上下文。分析结果确定了人类监管要求的高可靠性上限。此外，它进一步表明AV合作可以将监管可靠性提高数个数量级，并且令人意想不到的需要更少的监管员（每个AV）随着越来越多的AV采用。这些分析结果利用了排队理论分析、顺序统计学以及保守的反应控制策略——时间到碰撞避难。",
    "tldr": "这项工作研究了在自动驾驶车辆与人类驾驶员混合交通中，如何通过自主代理的合作，实现可扩展且安全的监管，分析结果表明，AV合作可以将监管可靠性提高数个数量级，并且需要更少的监管员。"
}