{
    "title": "Sentiment Analysis and Effect of COVID-19 Pandemic using College SubReddit Data. (arXiv:2112.04351v3 [cs.CL] UPDATED)",
    "abstract": "Background: The COVID-19 pandemic has affected our society and human well-being in various ways. In this study, we investigate how the pandemic has influenced people's emotions and psychological states compared to a pre-pandemic period using real-world data from social media.  Method: We collected Reddit social media data from 2019 (pre-pandemic) and 2020 (pandemic) from the subreddits communities associated with eight universities. We applied the pre-trained Robustly Optimized BERT pre-training approach (RoBERTa) to learn text embedding from the Reddit messages, and leveraged the relational information among posted messages to train a graph attention network (GAT) for sentiment classification. Finally, we applied model stacking to combine the prediction probabilities from RoBERTa and GAT to yield the final classification on sentiment. With the model-predicted sentiment labels on the collected data, we used a generalized linear mixed-effects model to estimate the effects of pandemic an",
    "link": "http://arxiv.org/abs/2112.04351",
    "context": "Title: Sentiment Analysis and Effect of COVID-19 Pandemic using College SubReddit Data. (arXiv:2112.04351v3 [cs.CL] UPDATED)\nAbstract: Background: The COVID-19 pandemic has affected our society and human well-being in various ways. In this study, we investigate how the pandemic has influenced people's emotions and psychological states compared to a pre-pandemic period using real-world data from social media.  Method: We collected Reddit social media data from 2019 (pre-pandemic) and 2020 (pandemic) from the subreddits communities associated with eight universities. We applied the pre-trained Robustly Optimized BERT pre-training approach (RoBERTa) to learn text embedding from the Reddit messages, and leveraged the relational information among posted messages to train a graph attention network (GAT) for sentiment classification. Finally, we applied model stacking to combine the prediction probabilities from RoBERTa and GAT to yield the final classification on sentiment. With the model-predicted sentiment labels on the collected data, we used a generalized linear mixed-effects model to estimate the effects of pandemic an",
    "path": "papers/21/12/2112.04351.json",
    "total_tokens": 889,
    "translated_title": "情绪分析和新冠疫情对大学社区中Reddit数据的影响研究",
    "translated_abstract": "背景：COVID-19疫情以各种方式影响了我们的社会和人类福祉。在这项研究中，我们使用社交媒体的真实数据，调查了疫情如何与疫情前期相比影响了人们的情绪和心理状态。方法：我们收集了与八所大学相关的Reddit社交媒体数据，其中包括2019年（疫情前）和2020年（疫情期间）的数据。我们利用预训练的RoBERTa方法学习Reddit消息的文本嵌入，同时利用发布的消息之间的关系信息训练了一个图注意力网络（GAT）进行情绪分类。最后，我们将RoBERTa和GAT的预测概率进行模型堆叠，得出情绪最终分类结果。通过对收集到的数据进行模型预测的情绪标签，我们使用广义线性混合效应模型估计了疫情和情绪之间的效应。",
    "tldr": "这项研究通过分析大学社区中的Reddit数据，研究了COVID-19疫情对人们情绪和心理状态的影响，并提出了基于RoBERTa和GAT的情绪分类模型。",
    "en_tdlr": "This study investigates the effects of COVID-19 pandemic on people's emotions and psychological states using Reddit data from university communities, and proposes a sentiment classification model based on RoBERTa and GAT."
}