{
    "title": "Forward Composition Propagation for Explainable Neural Reasoning. (arXiv:2112.12717v4 [cs.LG] UPDATED)",
    "abstract": "This paper proposes an algorithm called Forward Composition Propagation (FCP) to explain the predictions of feed-forward neural networks operating on structured classification problems. In the proposed FCP algorithm, each neuron is described by a composition vector indicating the role of each problem feature in that neuron. Composition vectors are initialized using a given input instance and subsequently propagated through the whole network until reaching the output layer. The sign of each composition value indicates whether the corresponding feature excites or inhibits the neuron, while the absolute value quantifies its impact. The FCP algorithm is executed on a post-hoc basis, i.e., once the learning process is completed. Aiming to illustrate the FCP algorithm, this paper develops a case study concerning bias detection in a fairness problem in which the ground truth is known. The simulation results show that the composition values closely align with the expected behavior of protected",
    "link": "http://arxiv.org/abs/2112.12717",
    "context": "Title: Forward Composition Propagation for Explainable Neural Reasoning. (arXiv:2112.12717v4 [cs.LG] UPDATED)\nAbstract: This paper proposes an algorithm called Forward Composition Propagation (FCP) to explain the predictions of feed-forward neural networks operating on structured classification problems. In the proposed FCP algorithm, each neuron is described by a composition vector indicating the role of each problem feature in that neuron. Composition vectors are initialized using a given input instance and subsequently propagated through the whole network until reaching the output layer. The sign of each composition value indicates whether the corresponding feature excites or inhibits the neuron, while the absolute value quantifies its impact. The FCP algorithm is executed on a post-hoc basis, i.e., once the learning process is completed. Aiming to illustrate the FCP algorithm, this paper develops a case study concerning bias detection in a fairness problem in which the ground truth is known. The simulation results show that the composition values closely align with the expected behavior of protected",
    "path": "papers/21/12/2112.12717.json",
    "total_tokens": 900,
    "translated_title": "可解释的神经推理的前向组合传播算法",
    "translated_abstract": "本文提出一种称为前向组合传播（FCP）的算法，用于解释在结构化分类问题上操作的前馈神经网络的预测。在提出的FCP算法中，每个神经元都由一个组合向量描述，该向量指示了每个问题特征在该神经元中的作用。组合向量使用给定的输入实例初始化，并随后通过整个网络传播，直到达到输出层。每个组合值的符号表示相应特征是否激活或抑制神经元，而绝对值 quantifies 了其影响。FCP算法是在后续基础上执行的，即在学习过程完成后。为了说明FCP算法，本文开展了一个关于公平问题中偏见检测的案例研究，其中地面真相是已知的。模拟结果表明，组合值与受保护特征的预期行为紧密对齐。",
    "tldr": "本文提出了一种被称为前向组合传播（FCP）的算法，用于解释前馈神经网络在结构化分类问题上的预测。该算法通过组合向量描述每个神经元中问题特征的作用，并且模拟结果表明组合值与受保护特征的预期行为紧密对齐。",
    "en_tdlr": "This paper introduces an algorithm called Forward Composition Propagation (FCP) to explain the predictions of feed-forward neural networks on structured classification problems. The FCP algorithm uses composition vectors to describe the role of each problem feature in the neurons, and the simulation results demonstrate a close alignment between the composition values and the expected behavior of protected features."
}