{
    "title": "Nonlocality, Nonlinearity, and Time Inconsistency in Stochastic Differential Games. (arXiv:2112.14409v2 [math.AP] UPDATED)",
    "abstract": "This paper proves the existence and uniqueness results (in the sense of maximally defined regularity) as well as the stability analysis for the solutions to a class of nonlocal fully-nonlinear parabolic systems, where the nonlocality stems from the flow feature (controlled by an external temporal parameter) of the systems. The derived mathematical results generalize the theory of stochastic differential games to incorporate with behavioral factors such as time-inconsistent preferences, which facilitate developments of many studies in financial economics including robust stochastic controls and games under relative performance concerns. Moreover, with the well-posedness results, we establish a general multidimensional Feynman--Kac formula in the presence of nonlocality (time inconsistency).",
    "link": "http://arxiv.org/abs/2112.14409",
    "context": "Title: Nonlocality, Nonlinearity, and Time Inconsistency in Stochastic Differential Games. (arXiv:2112.14409v2 [math.AP] UPDATED)\nAbstract: This paper proves the existence and uniqueness results (in the sense of maximally defined regularity) as well as the stability analysis for the solutions to a class of nonlocal fully-nonlinear parabolic systems, where the nonlocality stems from the flow feature (controlled by an external temporal parameter) of the systems. The derived mathematical results generalize the theory of stochastic differential games to incorporate with behavioral factors such as time-inconsistent preferences, which facilitate developments of many studies in financial economics including robust stochastic controls and games under relative performance concerns. Moreover, with the well-posedness results, we establish a general multidimensional Feynman--Kac formula in the presence of nonlocality (time inconsistency).",
    "path": "papers/21/12/2112.14409.json",
    "total_tokens": 852,
    "translated_title": "非局部性、非线性和时间不一致性在随机微分博弈中的应用",
    "translated_abstract": "本文证明了一类非局部完全非线性抛物型系统的解的存在性和唯一性结果（在最大定义的规则性意义上），以及解的稳定性分析，其中非局部性源于系统的流特征（由外部时间参数控制）。得出的数学结果将随机微分博弈理论推广到包含时间不一致偏好等行为因素的范畴，这有助于金融经济学中包括鲁棒随机控制和相对绩效关注下的博弈的许多研究的发展。此外，通过良定义的结果，我们在非局部性（时间不一致性）存在的情况下建立了一个通用的多维 Feynman-Kac 公式。",
    "tldr": "本文在非局部完全非线性抛物型系统中证明了解的存在性和唯一性，并进行了稳定性分析。通过将随机微分博弈理论与时间不一致偏好相结合，扩展了现有研究的范畴，从而在金融经济学中推动了鲁棒随机控制和相对绩效关注下的博弈的发展。",
    "en_tdlr": "This paper establishes the existence and uniqueness of solutions and conducts stability analysis in a class of nonlocal fully-nonlinear parabolic systems. By incorporating time-inconsistent preferences, the paper extends the theory of stochastic differential games and facilitates the development of robust stochastic controls and games under relative performance concerns in financial economics."
}