{
    "title": "Contextually Private Mechanisms. (arXiv:2112.10812v6 [econ.TH] UPDATED)",
    "abstract": "Consider a mechanism designer who employs a dynamic protocol to implement a choice rule. A protocol violates the contextual privacy of an agent if the designer learns more of the agent's private information than is necessary for computing the outcome. Our first main result is a characterization of choice rules that can be implemented without producing any contextual privacy violations. We apply this result to show that many commonly studied and employed choice rules violate some agent's contextual privacy -- the first-price auction and serial dictatorship rules are notable exceptions that can avoid violations altogether. Our second main result is a representation theorem for protocols that are contextual privacy equivalent. We use this result to derive a novel protocol for the second-price auction choice rule, the \\emph{ascending-join} protocol, which is more contextually private than the widespread ascending or English protocol.",
    "link": "http://arxiv.org/abs/2112.10812",
    "context": "Title: Contextually Private Mechanisms. (arXiv:2112.10812v6 [econ.TH] UPDATED)\nAbstract: Consider a mechanism designer who employs a dynamic protocol to implement a choice rule. A protocol violates the contextual privacy of an agent if the designer learns more of the agent's private information than is necessary for computing the outcome. Our first main result is a characterization of choice rules that can be implemented without producing any contextual privacy violations. We apply this result to show that many commonly studied and employed choice rules violate some agent's contextual privacy -- the first-price auction and serial dictatorship rules are notable exceptions that can avoid violations altogether. Our second main result is a representation theorem for protocols that are contextual privacy equivalent. We use this result to derive a novel protocol for the second-price auction choice rule, the \\emph{ascending-join} protocol, which is more contextually private than the widespread ascending or English protocol.",
    "path": "papers/21/12/2112.10812.json",
    "total_tokens": 890,
    "translated_title": "上下文隐私机制",
    "translated_abstract": "考虑一个机制设计者，他采用动态协议来实现一个选择规则。如果协议比计算结果所需的更多了解参与者的私人信息，那么协议就违反了参与者的上下文隐私。我们的第一个主要结果是对可以在不产生任何上下文隐私违规的选择规则进行了表征。我们将这个结果应用于表明许多常见研究和使用的选择规则都违反了某些参与者的上下文隐私——一价拍卖和顺序独裁规则是可以完全避免违规的显著例外。我们的第二个主要结果是对上下文隐私等效的协议进行的表示定理。我们利用这个结果得出了一个新的协议——“递增连接”协议，它在上下文隐私方面比广泛使用的递增或英文协议更加私密。",
    "tldr": "该论文研究了上下文隐私机制，首先定义了可以不违反上下文隐私的选择规则，并证明了许多常见选择规则违反了参与者的上下文隐私；其次提出了上下文隐私等效的协议表示定理，并提出了一个比广泛使用的递增或英文协议更加私密的协议-“递增连接”协议。",
    "en_tdlr": "This paper studies contextually private mechanisms, first defining choice rules that do not violate contextual privacy and proving that many commonly studied choice rules violate contextual privacy; second, presenting a representation theorem for contextually privacy equivalent protocols and introducing a more private protocol - the \"ascending-join\" protocol - than the widely used ascending or English protocols."
}