{
    "title": "Mixed Membership Distribution-Free Model. (arXiv:2112.04389v4 [cs.SI] UPDATED)",
    "abstract": "We consider the problem of community detection in overlapping weighted networks, where nodes can belong to multiple communities and edge weights can be finite real numbers. To model such complex networks, we propose a general framework - the mixed membership distribution-free (MMDF) model. MMDF has no distribution constraints of edge weights and can be viewed as generalizations of some previous models, including the well-known mixed membership stochastic blockmodels. Especially, overlapping signed networks with latent community structures can also be generated from our model. We use an efficient spectral algorithm with a theoretical guarantee of convergence rate to estimate community memberships under the model. We also propose fuzzy weighted modularity to evaluate the quality of community detection for overlapping weighted networks with positive and negative edge weights. We then provide a method to determine the number of communities for weighted networks by taking advantage of our f",
    "link": "http://arxiv.org/abs/2112.04389",
    "context": "Title: Mixed Membership Distribution-Free Model. (arXiv:2112.04389v4 [cs.SI] UPDATED)\nAbstract: We consider the problem of community detection in overlapping weighted networks, where nodes can belong to multiple communities and edge weights can be finite real numbers. To model such complex networks, we propose a general framework - the mixed membership distribution-free (MMDF) model. MMDF has no distribution constraints of edge weights and can be viewed as generalizations of some previous models, including the well-known mixed membership stochastic blockmodels. Especially, overlapping signed networks with latent community structures can also be generated from our model. We use an efficient spectral algorithm with a theoretical guarantee of convergence rate to estimate community memberships under the model. We also propose fuzzy weighted modularity to evaluate the quality of community detection for overlapping weighted networks with positive and negative edge weights. We then provide a method to determine the number of communities for weighted networks by taking advantage of our f",
    "path": "papers/21/12/2112.04389.json",
    "total_tokens": 998,
    "translated_title": "混合成员无分布模型",
    "translated_abstract": "本文考虑在具有重叠加权网络中进行社群检测的问题，其中节点可以属于多个社群，边权可以是有限实数。为了对这样的复杂网络进行建模，我们提出了一个通用框架——混合成员无分布（MMDF）模型。MMDF没有对边权的分布约束，可以被视为一些先前模型的推广，包括著名的混合成员随机块模型。特别地，具有潜在社群结构的重叠符号网络也可以从我们的模型中生成。我们使用具有收敛率理论保证的高效谱算法来估计模型下的社群成员资格。我们还提出了模糊加权模块度来评估具有正负边权的重叠加权网络的社群检测质量。然后，我们提供了一种利用我们的fuzzy weighted modularity来确定加权网络社群数量的方法。",
    "tldr": "本文提出了一种混合成员无分布模型，用于重叠加权网络的社群检测，支持节点所属多个社群和有限实数权值。提出的模型可以推广到之前的模型，包括混合成员随机块模型，并支持具有潜在社群结构的重叠符号网络的生成。我们使用高效谱算法估计模型下的社群成员资格，并提出了模糊加权模块度来评估重叠加权网络的社群检测质量并确定加权网络社群数量。"
}