{
    "title": "Distance Functions and Generalized Means: Duality and Taxonomy. (arXiv:2112.09443v2 [econ.TH] UPDATED)",
    "abstract": "This paper introduces in production theory a large class of efficiency measures that can be derived from the notion of utility function. This article also establishes a relation between these distance functions and Stone-Geary utility functions. More specifically, the paper focusses on new distance function that generalizes several existing efficiency measures. The new distance function is inspired from the Atkinson inequality index and maximizes the sum of the netput expansions required to reach an efficient point. A generalized duality theorem is proved and a duality result linking the new distance functions and the profit function is obtained. For all feasible production vectors, it includes as special cases most of the dual correspondences previously established in the literature. Finally, we identify a large class of measures for which these duality results can be obtained without convexity.",
    "link": "http://arxiv.org/abs/2112.09443",
    "context": "Title: Distance Functions and Generalized Means: Duality and Taxonomy. (arXiv:2112.09443v2 [econ.TH] UPDATED)\nAbstract: This paper introduces in production theory a large class of efficiency measures that can be derived from the notion of utility function. This article also establishes a relation between these distance functions and Stone-Geary utility functions. More specifically, the paper focusses on new distance function that generalizes several existing efficiency measures. The new distance function is inspired from the Atkinson inequality index and maximizes the sum of the netput expansions required to reach an efficient point. A generalized duality theorem is proved and a duality result linking the new distance functions and the profit function is obtained. For all feasible production vectors, it includes as special cases most of the dual correspondences previously established in the literature. Finally, we identify a large class of measures for which these duality results can be obtained without convexity.",
    "path": "papers/21/12/2112.09443.json",
    "total_tokens": 900,
    "translated_title": "距离函数与广义平均数：对偶性和分类",
    "translated_abstract": "本文中引入了一大类可以从效用函数中导出的效率度量，该类度量在生产理论中具有重要作用。同时，文章还建立了这些距离函数与 Stone-Geary 效用函数之间的关系。具体而言，本文关注一种新的距离函数，可以推广多种已有效率度量，并受到 Atkinson 不等式指数的启发，最大化达到有效点所需的净产出扩展之和。证明了一个广义对偶定理，并获得了一个将新的距离函数与利润函数联系起来的对偶结果。对于所有可行的生产向量，它包括先前在文献中建立的大多数对偶对应关系的特殊情况。最后，我们确定了一大类度量，可以在没有凸性的情况下获得这些对偶结果。",
    "tldr": "本文介绍了一类可以从效用函数中导出的效率度量，在此基础上，推广了多种已有效率度量，并得出了一种新的距离函数。通过证明广义对偶定理和将新的距离函数与利润函数联系起来的对偶结果，进一步建立了多个对偶对应关系。"
}