{
    "title": "Artificial Intelligence Ethics and Safety: practical tools for creating \"good\" models. (arXiv:2112.11208v2 [cs.CY] UPDATED)",
    "abstract": "The AI Robotics Ethics Society (AIRES) is a non-profit organization founded in 2018 by Aaron Hui to promote awareness and the importance of ethical implementation and regulation of AI. AIRES is now an organization with chapters at universities such as UCLA (Los Angeles), USC (University of Southern California), Caltech (California Institute of Technology), Stanford University, Cornell University, Brown University, and the Pontifical Catholic University of Rio Grande do Sul (Brazil). AIRES at PUCRS is the first international chapter of AIRES, and as such, we are committed to promoting and enhancing the AIRES Mission. Our mission is to focus on educating the AI leaders of tomorrow in ethical principles to ensure that AI is created ethically and responsibly. As there are still few proposals for how we should implement ethical principles and normative guidelines in the practice of AI system development, the goal of this work is to try to bridge this gap between discourse and praxis. Betwee",
    "link": "http://arxiv.org/abs/2112.11208",
    "context": "Title: Artificial Intelligence Ethics and Safety: practical tools for creating \"good\" models. (arXiv:2112.11208v2 [cs.CY] UPDATED)\nAbstract: The AI Robotics Ethics Society (AIRES) is a non-profit organization founded in 2018 by Aaron Hui to promote awareness and the importance of ethical implementation and regulation of AI. AIRES is now an organization with chapters at universities such as UCLA (Los Angeles), USC (University of Southern California), Caltech (California Institute of Technology), Stanford University, Cornell University, Brown University, and the Pontifical Catholic University of Rio Grande do Sul (Brazil). AIRES at PUCRS is the first international chapter of AIRES, and as such, we are committed to promoting and enhancing the AIRES Mission. Our mission is to focus on educating the AI leaders of tomorrow in ethical principles to ensure that AI is created ethically and responsibly. As there are still few proposals for how we should implement ethical principles and normative guidelines in the practice of AI system development, the goal of this work is to try to bridge this gap between discourse and praxis. Betwee",
    "path": "papers/21/12/2112.11208.json",
    "total_tokens": 686,
    "translated_title": "人工智能伦理和安全：创建“良好”模型的实用工具",
    "translated_abstract": "AI Robotics Ethics Society（AIRES）是由Aaron Hui于2018年创立的非营利组织，旨在推广人工智能的道德实施和监管的意识和重要性。本文的目标是在AI系统开发实践中建立道德原则和规范指南的提案，填补理论和实践之间的差距。",
    "tldr": "本文的目标是推广人工智能开发实践中的道德原则和规范指南，并使人工智能得到道德和负责任的创造。",
    "en_tdlr": "The goal of this paper is to promote ethical principles and normative guidelines in the practice of AI system development, and to ensure that AI is created ethically and responsibly."
}