{
    "title": "Heckman-Selection or Two-Part models for alcohol studies? Depends. (arXiv:2112.10542v2 [econ.EM] UPDATED)",
    "abstract": "Aims: To re-introduce the Heckman model as a valid empirical technique in alcohol studies. Design: To estimate the determinants of problem drinking using a Heckman and a two-part estimation model. Psychological and neuro-scientific studies justify my underlying estimation assumptions and covariate exclusion restrictions. Higher order tests checking for multicollinearity validate the use of Heckman over the use of two-part estimation models. I discuss the generalizability of the two models in applied research. Settings and Participants: Two pooled national population surveys from 2016 and 2017 were used: the Behavioral Risk Factor Surveillance Survey (BRFS), and the National Survey of Drug Use and Health (NSDUH). Measurements: Participation in problem drinking and meeting the criteria for problem drinking. Findings: Both U.S. national surveys perform well with the Heckman model and pass all higher order tests. The Heckman model corrects for selection bias and reveals the direction of bi",
    "link": "http://arxiv.org/abs/2112.10542",
    "context": "Title: Heckman-Selection or Two-Part models for alcohol studies? Depends. (arXiv:2112.10542v2 [econ.EM] UPDATED)\nAbstract: Aims: To re-introduce the Heckman model as a valid empirical technique in alcohol studies. Design: To estimate the determinants of problem drinking using a Heckman and a two-part estimation model. Psychological and neuro-scientific studies justify my underlying estimation assumptions and covariate exclusion restrictions. Higher order tests checking for multicollinearity validate the use of Heckman over the use of two-part estimation models. I discuss the generalizability of the two models in applied research. Settings and Participants: Two pooled national population surveys from 2016 and 2017 were used: the Behavioral Risk Factor Surveillance Survey (BRFS), and the National Survey of Drug Use and Health (NSDUH). Measurements: Participation in problem drinking and meeting the criteria for problem drinking. Findings: Both U.S. national surveys perform well with the Heckman model and pass all higher order tests. The Heckman model corrects for selection bias and reveals the direction of bi",
    "path": "papers/21/12/2112.10542.json",
    "total_tokens": 991,
    "translated_title": "Heckman-Selection或者Two-Part模型在酒精研究中的应用？取决于情况。",
    "translated_abstract": "目的：重新介绍Heckman模型作为酒精研究中有效的经验技术。设计：使用Heckman模型和Two-Part估计模型估计问题饮酒的决定因素。心理学和神经科学研究证明了我基本的估计假设和协变量排除限制的合理性。高阶检验验证了在应用研究中使用Heckman模型而不是Two-Part估计模型的可行性。我讨论了这两个模型在应用研究中的普适性。研究场景和参与者：使用2016年和2017年的两个全国人口调查数据集：行为风险因素监测调查（BRFS）和国家药物使用和健康调查（NSDUH）。测量：问题饮酒的参与和满足问题饮酒的标准。发现：美国的两项全国调查都在Heckman模型下表现良好，并通过了所有的高阶检验。Heckman模型纠正了选择偏差，揭示了生物社会学因素和经济因素对问题饮酒的影响方向。",
    "tldr": "本研究重新介绍了Heckman模型作为酒精研究中的有效经验技术，并通过使用Heckman模型和Two-Part估计模型对问题饮酒的决定因素进行估计。研究结果表明，在应用研究中，Heckman模型相较于Two-Part模型更具可行性和普适性，对选择偏差进行了纠正，并揭示了问题饮酒的影响因素。"
}