{
    "title": "PMFL: Partial Meta-Federated Learning for heterogeneous tasks and its applications on real-world medical records",
    "abstract": "arXiv:2112.05321v2 Announce Type: replace  Abstract: Federated machine learning is a versatile and flexible tool to utilize distributed data from different sources, especially when communication technology develops rapidly and an unprecedented amount of data could be collected on mobile devices nowadays. Federated learning method exploits not only the data but the computational power of all devices in the network to achieve more efficient model training. Nevertheless, while most traditional federated learning methods work well for homogeneous data and tasks, adapting the method to a different heterogeneous data and task distribution is challenging. This limitation has constrained the applications of federated learning in real-world contexts, especially in healthcare settings. Inspired by the fundamental idea of meta-learning, in this study we propose a new algorithm, which is an integration of federated learning and meta-learning, to tackle this issue. In addition, owing to the advanta",
    "link": "https://arxiv.org/abs/2112.05321",
    "context": "Title: PMFL: Partial Meta-Federated Learning for heterogeneous tasks and its applications on real-world medical records\nAbstract: arXiv:2112.05321v2 Announce Type: replace  Abstract: Federated machine learning is a versatile and flexible tool to utilize distributed data from different sources, especially when communication technology develops rapidly and an unprecedented amount of data could be collected on mobile devices nowadays. Federated learning method exploits not only the data but the computational power of all devices in the network to achieve more efficient model training. Nevertheless, while most traditional federated learning methods work well for homogeneous data and tasks, adapting the method to a different heterogeneous data and task distribution is challenging. This limitation has constrained the applications of federated learning in real-world contexts, especially in healthcare settings. Inspired by the fundamental idea of meta-learning, in this study we propose a new algorithm, which is an integration of federated learning and meta-learning, to tackle this issue. In addition, owing to the advanta",
    "path": "papers/21/12/2112.05321.json",
    "total_tokens": 876,
    "translated_title": "PMFL: 针对异构任务的部分元联邦学习及其在现实世界医疗记录中的应用",
    "translated_abstract": "arXiv:2112.05321v2 公告类型: 替换 摘要: 联邦机器学习是一种多功能和灵活的工具，可以利用来自不同来源的分布式数据，尤其是当通信技术高速发展，如今可以在移动设备上收集到前所未有的大量数据时。联邦学习方法利用网络中所有设备的数据和计算能力来实现更高效的模型训练。然而，尽管大多数传统的联邦学习方法适用于同质数据和任务，但将该方法适应不同的异构数据和任务分布具有挑战性。这一限制已经限制了联邦学习在现实世界背景下的应用，特别是在医疗保健领域。在本研究中，受到元学习的基本思想的启发，我们提出了一种新算法，将联邦学习和元学习相结合，以解决这一问题。此外，由于该算法的优势",
    "tldr": "提出了PMFL算法，结合了联邦学习和元学习的思想，针对异构任务的数据分布，解决了传统联邦学习在医疗记录等领域应用受限的问题",
    "en_tdlr": "Introduced PMFL algorithm, combining federated learning and meta-learning techniques to address the challenge of applying traditional federated learning in healthcare settings with heterogeneous data distributions."
}