{
    "title": "Descriptive vs. inferential community detection in networks: pitfalls, myths, and half-truths. (arXiv:2112.00183v7 [physics.soc-ph] UPDATED)",
    "abstract": "Community detection is one of the most important methodological fields of network science, and one which has attracted a significant amount of attention over the past decades. This area deals with the automated division of a network into fundamental building blocks, with the objective of providing a summary of its large-scale structure. Despite its importance and widespread adoption, there is a noticeable gap between what is arguably the state-of-the-art and the methods that are actually used in practice in a variety of fields. Here we attempt to address this discrepancy by dividing existing methods according to whether they have a \"descriptive\" or an \"inferential\" goal. While descriptive methods find patterns in networks based on context-dependent notions of community structure, inferential methods articulate generative models, and attempt to fit them to data. In this way, they are able to provide insights into the mechanisms of network formation, and separate structure from randomnes",
    "link": "http://arxiv.org/abs/2112.00183",
    "context": "Title: Descriptive vs. inferential community detection in networks: pitfalls, myths, and half-truths. (arXiv:2112.00183v7 [physics.soc-ph] UPDATED)\nAbstract: Community detection is one of the most important methodological fields of network science, and one which has attracted a significant amount of attention over the past decades. This area deals with the automated division of a network into fundamental building blocks, with the objective of providing a summary of its large-scale structure. Despite its importance and widespread adoption, there is a noticeable gap between what is arguably the state-of-the-art and the methods that are actually used in practice in a variety of fields. Here we attempt to address this discrepancy by dividing existing methods according to whether they have a \"descriptive\" or an \"inferential\" goal. While descriptive methods find patterns in networks based on context-dependent notions of community structure, inferential methods articulate generative models, and attempt to fit them to data. In this way, they are able to provide insights into the mechanisms of network formation, and separate structure from randomnes",
    "path": "papers/21/12/2112.00183.json",
    "total_tokens": 861,
    "translated_title": "在网络中的描述性与推理性社区检测：陷阱、误解和半真相",
    "translated_abstract": "社区检测是网络科学中最重要的方法学领域之一，过去几十年来引起了相当大的关注。该领域涉及将网络自动划分为基本构建块，以提供其大规模结构的摘要。尽管其重要性和广泛应用，但在实际应用中，目前的方法与被认为是最先进的方法之间存在明显差距。本文试图通过将现有方法分为“描述性”和“推理性”目标来解决这一差距。描述性方法根据依赖于上下文的社区结构概念在网络中发现模式，而推理性方法构建生成模型，并尝试将其拟合到数据中。通过这种方式，它们能够揭示网络形成的机制，并将结构与随机性分离开来。",
    "tldr": "本文将现有的社区检测方法根据目标分为描述性和推理性。描述性方法基于上下文相关的社区结构发现网络模式，而推理性方法通过生成模型拟合数据，揭示网络形成机制并分离结构和随机性。"
}