{
    "title": "Domain-Aware Continual Zero-Shot Learning",
    "abstract": "arXiv:2112.12989v3 Announce Type: replace-cross  Abstract: Modern visual systems have a wide range of potential applications in vision tasks for natural science research, such as aiding in species discovery, monitoring animals in the wild, and so on. However, real-world vision tasks may experience changes in environmental conditions, leading to shifts in how captured images are presented. To address this issue, we introduce Domain-Aware Continual Zero-Shot Learning (DACZSL), a task to recognize images of unseen categories in continuously changing domains. Accordingly, we propose a Domain-Invariant Network (DIN) to learn factorized features for shifting domains and improved textual representation for unseen classes. DIN continually learns a global shared network for domain-invariant and task-invariant features, and per-task private networks for task-specific features. Furthermore, we enhance the dual network with class-wise learnable prompts to improve class-level text representation, t",
    "link": "https://arxiv.org/abs/2112.12989",
    "context": "Title: Domain-Aware Continual Zero-Shot Learning\nAbstract: arXiv:2112.12989v3 Announce Type: replace-cross  Abstract: Modern visual systems have a wide range of potential applications in vision tasks for natural science research, such as aiding in species discovery, monitoring animals in the wild, and so on. However, real-world vision tasks may experience changes in environmental conditions, leading to shifts in how captured images are presented. To address this issue, we introduce Domain-Aware Continual Zero-Shot Learning (DACZSL), a task to recognize images of unseen categories in continuously changing domains. Accordingly, we propose a Domain-Invariant Network (DIN) to learn factorized features for shifting domains and improved textual representation for unseen classes. DIN continually learns a global shared network for domain-invariant and task-invariant features, and per-task private networks for task-specific features. Furthermore, we enhance the dual network with class-wise learnable prompts to improve class-level text representation, t",
    "path": "papers/21/12/2112.12989.json",
    "total_tokens": 843,
    "translated_title": "面向域感知的持续零样本学习",
    "translated_abstract": "现代视觉系统在自然科学研究中具有广泛的潜在应用，如帮助发现物种，监测野生动物等。然而，真实世界中的视觉任务可能会经历环境条件的变化，导致捕捉图像呈现方式的变化。为了解决这个问题，我们引入了面向域感知的持续零样本学习（DACZSL），这是一个持续识别不断变化域中未见类别图像的任务。因此，我们提出了一个域不变网络（DIN），用于学习适应变化域的分解特征和改进的文本表示未见类别。DIN不断学习全局共享网络以获取领域不变和任务不变特征，并为每个任务提供专门的私有网络用于特定任务的特征。",
    "tldr": "DACZSL提出了面向域感知的持续零样本学习任务，引入了域不变网络(DIN)，不断学习全局共享网络用于领域不变和任务不变特征，以及为每个任务提供专门的私有网络用于特定任务的特征",
    "en_tdlr": "DACZSL introduces the Domain-Aware Continual Zero-Shot Learning task and the Domain-Invariant Network (DIN), which continually learns a global shared network for domain-invariant and task-invariant features, as well as providing per-task private networks for task-specific features."
}