{
    "title": "A Survey on Hyperdimensional Computing aka Vector Symbolic Architectures, Part II: Applications, Cognitive Models, and Challenges. (arXiv:2112.15424v3 [cs.AI] UPDATED)",
    "abstract": "This is Part II of the two-part comprehensive survey devoted to a computing framework most commonly known under the names Hyperdimensional Computing and Vector Symbolic Architectures (HDC/VSA). Both names refer to a family of computational models that use high-dimensional distributed representations and rely on the algebraic properties of their key operations to incorporate the advantages of structured symbolic representations and vector distributed representations. Holographic Reduced Representations is an influential HDC/VSA model that is well-known in the machine learning domain and often used to refer to the whole family. However, for the sake of consistency, we use HDC/VSA to refer to the field. Part I of this survey covered foundational aspects of the field, such as the historical context leading to the development of HDC/VSA, key elements of any HDC/VSA model, known HDC/VSA models, and the transformation of input data of various types into high-dimensional vectors suitable for H",
    "link": "http://arxiv.org/abs/2112.15424",
    "context": "Title: A Survey on Hyperdimensional Computing aka Vector Symbolic Architectures, Part II: Applications, Cognitive Models, and Challenges. (arXiv:2112.15424v3 [cs.AI] UPDATED)\nAbstract: This is Part II of the two-part comprehensive survey devoted to a computing framework most commonly known under the names Hyperdimensional Computing and Vector Symbolic Architectures (HDC/VSA). Both names refer to a family of computational models that use high-dimensional distributed representations and rely on the algebraic properties of their key operations to incorporate the advantages of structured symbolic representations and vector distributed representations. Holographic Reduced Representations is an influential HDC/VSA model that is well-known in the machine learning domain and often used to refer to the whole family. However, for the sake of consistency, we use HDC/VSA to refer to the field. Part I of this survey covered foundational aspects of the field, such as the historical context leading to the development of HDC/VSA, key elements of any HDC/VSA model, known HDC/VSA models, and the transformation of input data of various types into high-dimensional vectors suitable for H",
    "path": "papers/21/12/2112.15424.json",
    "total_tokens": 945,
    "translated_title": "超维计算（也被称为向量符号化架构）综述，第二部分：应用、认知模型和挑战",
    "translated_abstract": "这是一篇综述的第二部分，专门介绍一个计算框架，最常被称为超维计算和向量符号化架构（HDC/VSA）。这两个名称都指的是一系列使用高维分布式表示的计算模型，并依赖于其关键操作的代数性质，以融合结构化符号表示和向量分布式表示的优势。全息化简表示是一个有影响力的HDC/VSA模型，在机器学习领域中非常知名，并常用于指代整个家族。然而，出于一致性考虑，我们在这里使用HDC/VSA来称呼该领域。本综述的第一部分涵盖了该领域的基础方面，例如导致HDC/VSA发展的历史背景、任何HDC/VSA模型的关键要素、已知的HDC/VSA模型，以及将各种类型的输入数据转化为适合HDC/VSA的高维向量的方法。",
    "tldr": "超维计算（HDC/VSA）是一种计算框架，利用高维分布式表示和代数操作的特性，结合了结构化符号表示和向量分布式表示的优势。本综述的第二部分介绍了HDC/VSA的应用、认知模型和挑战。",
    "en_tdlr": "Hyperdimensional Computing (HDC/VSA) is a computing framework that combines the advantages of structured symbolic representations and vector distributed representations through the use of high-dimensional distributed representations and algebraic operations. This survey's Part II focuses on the applications, cognitive models, and challenges of HDC/VSA."
}