{
    "title": "Ambiguous Dynamic Treatment Regimes: A Reinforcement Learning Approach. (arXiv:2112.04571v4 [cs.LG] UPDATED)",
    "abstract": "A main research goal in various studies is to use an observational data set and provide a new set of counterfactual guidelines that can yield causal improvements. Dynamic Treatment Regimes (DTRs) are widely studied to formalize this process. However, available methods in finding optimal DTRs often rely on assumptions that are violated in real-world applications (e.g., medical decision-making or public policy), especially when (a) the existence of unobserved confounders cannot be ignored, and (b) the unobserved confounders are time-varying (e.g., affected by previous actions). When such assumptions are violated, one often faces ambiguity regarding the underlying causal model. This ambiguity is inevitable, since the dynamics of unobserved confounders and their causal impact on the observed part of the data cannot be understood from the observed data. Motivated by a case study of finding superior treatment regimes for patients who underwent transplantation in our partner hospital and face",
    "link": "http://arxiv.org/abs/2112.04571",
    "context": "Title: Ambiguous Dynamic Treatment Regimes: A Reinforcement Learning Approach. (arXiv:2112.04571v4 [cs.LG] UPDATED)\nAbstract: A main research goal in various studies is to use an observational data set and provide a new set of counterfactual guidelines that can yield causal improvements. Dynamic Treatment Regimes (DTRs) are widely studied to formalize this process. However, available methods in finding optimal DTRs often rely on assumptions that are violated in real-world applications (e.g., medical decision-making or public policy), especially when (a) the existence of unobserved confounders cannot be ignored, and (b) the unobserved confounders are time-varying (e.g., affected by previous actions). When such assumptions are violated, one often faces ambiguity regarding the underlying causal model. This ambiguity is inevitable, since the dynamics of unobserved confounders and their causal impact on the observed part of the data cannot be understood from the observed data. Motivated by a case study of finding superior treatment regimes for patients who underwent transplantation in our partner hospital and face",
    "path": "papers/21/12/2112.04571.json",
    "total_tokens": 946,
    "translated_abstract": "在各种研究中，主要的研究目标是利用观察数据集，提供一组新的反事实指南，以产生因果改进。动态治疗方案(DTR)被广泛研究来规范这一过程。然而，现有的寻找最佳DTR的方法通常依赖于在现实世界应用中违反的假设(例如，医疗决策或公共政策)，尤其是当(a)不能忽略未观察到的混淆因子的存在，(b)未观察到的混淆因子是时变的(例如，受先前行动的影响)时。当这些假设被违反时，人们常常面临关于潜在因果模型的模糊性。由于未观察混淆因子的动态及其对观察数据的因果影响不能从观察数据中理解，因此这种模糊性是不可避免的。本文的案例研究是针对在我们合作医院接受移植手术的患者寻找更好的治疗方案。",
    "tldr": "治疗方案的优化方法通常假设不存在未观察到的混淆因素，但在现实中这种假设往往无法满足。本论文提出了一种强化学习方法以应对这一问题。"
}