{
    "title": "Last-Iterate Convergence of Saddle-Point Optimizers via High-Resolution Differential Equations. (arXiv:2112.13826v3 [math.OC] UPDATED)",
    "abstract": "Several widely-used first-order saddle-point optimization methods yield an identical continuous-time ordinary differential equation (ODE) that is identical to that of the Gradient Descent Ascent (GDA) method when derived naively. However, the convergence properties of these methods are qualitatively different, even on simple bilinear games. Thus the ODE perspective, which has proved powerful in analyzing single-objective optimization methods, has not played a similar role in saddle-point optimization.  We adopt a framework studied in fluid dynamics -- known as High-Resolution Differential Equations (HRDEs) -- to design differential equation models for several saddle-point optimization methods. Critically, these HRDEs are distinct for various saddle-point optimization methods. Moreover, in bilinear games, the convergence properties of the HRDEs match the qualitative features of the corresponding discrete methods. Additionally, we show that the HRDE of Optimistic Gradient Descent Ascent ",
    "link": "http://arxiv.org/abs/2112.13826",
    "context": "Title: Last-Iterate Convergence of Saddle-Point Optimizers via High-Resolution Differential Equations. (arXiv:2112.13826v3 [math.OC] UPDATED)\nAbstract: Several widely-used first-order saddle-point optimization methods yield an identical continuous-time ordinary differential equation (ODE) that is identical to that of the Gradient Descent Ascent (GDA) method when derived naively. However, the convergence properties of these methods are qualitatively different, even on simple bilinear games. Thus the ODE perspective, which has proved powerful in analyzing single-objective optimization methods, has not played a similar role in saddle-point optimization.  We adopt a framework studied in fluid dynamics -- known as High-Resolution Differential Equations (HRDEs) -- to design differential equation models for several saddle-point optimization methods. Critically, these HRDEs are distinct for various saddle-point optimization methods. Moreover, in bilinear games, the convergence properties of the HRDEs match the qualitative features of the corresponding discrete methods. Additionally, we show that the HRDE of Optimistic Gradient Descent Ascent ",
    "path": "papers/21/12/2112.13826.json",
    "total_tokens": 858,
    "translated_title": "高分辨率微分方程在鞍点优化器的最后迭代收敛中的应用",
    "translated_abstract": "几种广泛使用的一阶鞍点优化方法在衍生时可以得到与梯度下降上升 (GDA) 方法相同的连续时间常微分方程 (ODE)，但是这些方法的收敛性质在简单的双线性博弈中是有差异的。因此，ODE 视角在分析单目标优化方法方面已经发挥了强大的作用，但在鞍点优化中的应用尚不明晰。我们采用在流体动力学中研究的高分辨率微分方程 (HRDEs) 框架来设计几种鞍点优化方法的微分方程模型。尤其需要指出的是，这些 HRDEs 对应于不同的鞍点优化方法是不同的。此外，在双线性博弈中，HRDEs 的收敛性质与相应的离散方法的性质相匹配。",
    "tldr": "本研究利用高分辨率微分方程在鞍点优化中设计了不同的微分方程模型，这些模型在双线性博弈中的收敛性质与离散方法相匹配。"
}