{
    "title": "Physics Constrained Flow Neural Network for Short-Timescale Predictions in Data Communications Networks. (arXiv:2112.12321v3 [cs.LG] UPDATED)",
    "abstract": "Machine learning is gaining growing momentum in various recent models for the dynamic analysis of information flows in data communications networks. These preliminary models often rely on off-the-shelf learning models to predict from historical statistics while disregarding the physics governing the generating behaviors of these flows. This paper instead introduces Flow Neural Network (FlowNN) to improve the feature representation with learned physical bias. This is implemented by an induction layer, working upon the embedding layer, to impose the physics connected data correlations, and a self-supervised learning strategy with stop-gradient to make the learned physics universal. For the short-timescale network prediction tasks, FlowNN achieves 17% - 71% of loss decrease than the state-of-the-art baselines on both synthetic and real-world networking datasets, which shows the strength of this new approach.",
    "link": "http://arxiv.org/abs/2112.12321",
    "context": "Title: Physics Constrained Flow Neural Network for Short-Timescale Predictions in Data Communications Networks. (arXiv:2112.12321v3 [cs.LG] UPDATED)\nAbstract: Machine learning is gaining growing momentum in various recent models for the dynamic analysis of information flows in data communications networks. These preliminary models often rely on off-the-shelf learning models to predict from historical statistics while disregarding the physics governing the generating behaviors of these flows. This paper instead introduces Flow Neural Network (FlowNN) to improve the feature representation with learned physical bias. This is implemented by an induction layer, working upon the embedding layer, to impose the physics connected data correlations, and a self-supervised learning strategy with stop-gradient to make the learned physics universal. For the short-timescale network prediction tasks, FlowNN achieves 17% - 71% of loss decrease than the state-of-the-art baselines on both synthetic and real-world networking datasets, which shows the strength of this new approach.",
    "path": "papers/21/12/2112.12321.json",
    "total_tokens": 834,
    "translated_title": "物理约束流神经网络用于数据通信网络中的短时刻预测",
    "translated_abstract": "机器学习在数据通信网络信息流动的动态分析中得到越来越多的应用。先前的模型经常依靠现成的学习模型通过历史统计数据进行预测，而无视掌控这些信息流生成行为的物理规律。本文提出了Flow Neural Network（FlowNN），通过嵌套层和归纳层引入学习到的物理偏差来改进特征表述，并使用自监督学习策略来普遍地学习这些物理规律。在短时间范围内的网络预测任务中，FlowNN在合成和真实网络数据集上都取得了17%到71%的损失下降，显示了该方法的威力。",
    "tldr": "本文提出了一个新的用于短时刻预测的神经网络模型FlowNN，通过引入物理偏差、使用自监督学习策略来改进特征表述。在合成和真实网络数据集上都取得了17%到71%的损失下降。",
    "en_tdlr": "This paper proposes a new neural network model, FlowNN, for short-term predictions in data communication networks. It improves feature representation by incorporating learned physical bias and utilizes self-supervised learning to universalize the learned physics. FlowNN achieves 17%-71% loss reduction compared to state-of-the-art baselines on both synthetic and real-world datasets."
}