{
    "title": "Leveraging Trust for Joint Multi-Objective and Multi-Fidelity Optimization. (arXiv:2112.13901v3 [cs.LG] UPDATED)",
    "abstract": "In the pursuit of efficient optimization of expensive-to-evaluate systems, this paper investigates a novel approach to Bayesian multi-objective and multi-fidelity (MOMF) optimization. Traditional optimization methods, while effective, often encounter prohibitively high costs in multi-dimensional optimizations of one or more objectives. Multi-fidelity approaches offer potential remedies by utilizing multiple, less costly information sources, such as low-resolution simulations. However, integrating these two strategies presents a significant challenge. We suggest the innovative use of a trust metric to support simultaneous optimization of multiple objectives and data sources. Our method modifies a multi-objective optimization policy to incorporate the trust gain per evaluation cost as one objective in a Pareto optimization problem, enabling simultaneous MOMF at lower costs. We present and compare two MOMF optimization methods: a holistic approach selecting both the input parameters and t",
    "link": "http://arxiv.org/abs/2112.13901",
    "context": "Title: Leveraging Trust for Joint Multi-Objective and Multi-Fidelity Optimization. (arXiv:2112.13901v3 [cs.LG] UPDATED)\nAbstract: In the pursuit of efficient optimization of expensive-to-evaluate systems, this paper investigates a novel approach to Bayesian multi-objective and multi-fidelity (MOMF) optimization. Traditional optimization methods, while effective, often encounter prohibitively high costs in multi-dimensional optimizations of one or more objectives. Multi-fidelity approaches offer potential remedies by utilizing multiple, less costly information sources, such as low-resolution simulations. However, integrating these two strategies presents a significant challenge. We suggest the innovative use of a trust metric to support simultaneous optimization of multiple objectives and data sources. Our method modifies a multi-objective optimization policy to incorporate the trust gain per evaluation cost as one objective in a Pareto optimization problem, enabling simultaneous MOMF at lower costs. We present and compare two MOMF optimization methods: a holistic approach selecting both the input parameters and t",
    "path": "papers/21/12/2112.13901.json",
    "total_tokens": 941,
    "translated_title": "利用信任进行多目标和多保真度优化的研究",
    "translated_abstract": "在追求高效评估代价昂贵系统的优化过程中，本文研究了一种新颖的贝叶斯多目标和多保真度（MOMF）优化方法。传统的优化方法在多维度优化一个或多个目标时常常遇到极高的成本。多保真度方法通过利用多个成本较低的信息来源（如低分辨率模拟）提供潜在的解决方案。然而，将这两种策略整合起来却面临着巨大挑战。我们提出了创新性的信任度量方法，以支持同时优化多个目标和数据来源。我们的方法修改了多目标优化策略，将每次评估成本的信任增益作为一个目标纳入帕累托优化问题中，实现了同时进行MOMF优化并降低成本。我们提出并比较了两种MOMF优化方法：一种整体方法既选择输入参数又选择保真度标准。",
    "tldr": "这篇论文研究了一种利用信任度量来支持多目标和多数据来源优化的方法。通过将信任增益作为目标之一，将多保真度考虑在内，实现了同时进行多目标和多数据来源优化的目标。比较了两种优化方法：同时选择输入参数和保真度标准的整体方法以及基于帕累托优化的方法。"
}