{
    "title": "Bidding in Multi-Unit Auctions under Limited Information. (arXiv:2112.11320v2 [econ.TH] UPDATED)",
    "abstract": "We study multi-unit auctions in which bidders have limited knowledge of opponent strategies and values. We characterize optimal prior-free bids; these bids minimize the maximal loss in expected utility resulting from uncertainty surrounding opponent behavior. Optimal bids are readily computable despite bidders having multi-dimensional private information, and in certain cases admit closed-form solutions. In the pay-as-bid auction the minimax-loss bid is unique; in the uniform-price auction the minimax-loss bid is unique if the bidder is allowed to determine the quantities for which they bid, as in many practical applications. We compare minimax-loss bids and auction outcomes across auction formats, and derive testable predictions.",
    "link": "http://arxiv.org/abs/2112.11320",
    "context": "Title: Bidding in Multi-Unit Auctions under Limited Information. (arXiv:2112.11320v2 [econ.TH] UPDATED)\nAbstract: We study multi-unit auctions in which bidders have limited knowledge of opponent strategies and values. We characterize optimal prior-free bids; these bids minimize the maximal loss in expected utility resulting from uncertainty surrounding opponent behavior. Optimal bids are readily computable despite bidders having multi-dimensional private information, and in certain cases admit closed-form solutions. In the pay-as-bid auction the minimax-loss bid is unique; in the uniform-price auction the minimax-loss bid is unique if the bidder is allowed to determine the quantities for which they bid, as in many practical applications. We compare minimax-loss bids and auction outcomes across auction formats, and derive testable predictions.",
    "path": "papers/21/12/2112.11320.json",
    "total_tokens": 840,
    "translated_title": "有限信息下的多物品拍卖竞标",
    "translated_abstract": "我们研究了拍卖参与者对竞争对手策略和价值有限了解的多物品拍卖。我们描述了最优先验无关的竞标方式；这些竞标方式可以最小化因对手行为不确定性导致的期望效用最大损失。尽管竞标者具有多维私人信息，在某些情况下，最优竞标是可以很容易计算的，并且可以得到闭式解。在以出价付款的拍卖中，最小化最大损失的出价是唯一的；在统一价格拍卖中，如果竞标者被允许确定他们所竞标的数量，像许多实际应用中那样，最小化最大损失的出价是唯一的。我们比较了不同拍卖格式下的最小化最大损失出价和拍卖结果，并推导出可测试的预测。",
    "tldr": "论文研究了有限信息下的多物品拍卖中的最优竞标策略，提出了最优先验无关的竞标方式可以最小化因对手行为不确定性导致的期望效用最大损失，并比较了不同拍卖格式下的最小化最大损失出价和拍卖结果。",
    "en_tdlr": "This paper studies optimal bidding strategies in multi-unit auctions with limited information, proposes optimal prior-free bids that minimize maximal loss in expected utility due to uncertainty surrounding opponent behavior, compares minimax-loss bids and auction outcomes across auction formats, and derives testable predictions."
}