{
    "title": "Deep Efficient Continuous Manifold Learning for Time Series Modeling. (arXiv:2112.03379v2 [cs.LG] UPDATED)",
    "abstract": "Modeling non-Euclidean data is drawing extensive attention along with the unprecedented successes of deep neural networks in diverse fields. Particularly, a symmetric positive definite matrix is being actively studied in computer vision, signal processing, and medical image analysis, due to its ability to learn beneficial statistical representations. However, owing to its rigid constraints, it remains challenging to optimization problems and inefficient computational costs, especially, when incorporating it with a deep learning framework. In this paper, we propose a framework to exploit a diffeomorphism mapping between Riemannian manifolds and a Cholesky space, by which it becomes feasible not only to efficiently solve optimization problems but also to greatly reduce computation costs. Further, for dynamic modeling of time-series data, we devise a continuous manifold learning method by systematically integrating a manifold ordinary differential equation and a gated recurrent neural net",
    "link": "http://arxiv.org/abs/2112.03379",
    "context": "Title: Deep Efficient Continuous Manifold Learning for Time Series Modeling. (arXiv:2112.03379v2 [cs.LG] UPDATED)\nAbstract: Modeling non-Euclidean data is drawing extensive attention along with the unprecedented successes of deep neural networks in diverse fields. Particularly, a symmetric positive definite matrix is being actively studied in computer vision, signal processing, and medical image analysis, due to its ability to learn beneficial statistical representations. However, owing to its rigid constraints, it remains challenging to optimization problems and inefficient computational costs, especially, when incorporating it with a deep learning framework. In this paper, we propose a framework to exploit a diffeomorphism mapping between Riemannian manifolds and a Cholesky space, by which it becomes feasible not only to efficiently solve optimization problems but also to greatly reduce computation costs. Further, for dynamic modeling of time-series data, we devise a continuous manifold learning method by systematically integrating a manifold ordinary differential equation and a gated recurrent neural net",
    "path": "papers/21/12/2112.03379.json",
    "total_tokens": 894,
    "translated_title": "深度高效的连续流形学习用于时间序列建模",
    "translated_abstract": "随着深度神经网络在各个领域取得了空前的成功，对非欧几里得数据进行建模越来越受到关注。特别是对称正定矩阵在计算机视觉、信号处理和医学图像分析等领域得到了广泛研究，因为它具有学习有益的统计表示的能力。然而，由于其严格的约束条件，将其与深度学习框架结合在一起时仍然具有挑战性的优化问题和低效的计算成本。在本文中，我们提出了一个框架，通过在Riemannian流形和Cholesky空间之间利用一个微分同胚映射，不仅可以高效地解决优化问题，而且可以大大减少计算成本。此外，为了对时间序列数据进行动态建模，我们设计了一种连续流形学习方法，通过系统集成流形常微分方程和门控循环神经网络实现。",
    "tldr": "本文提出了一个深度高效的连续流形学习框架，通过在Riemannian流形和Cholesky空间之间利用微分同胚映射，实现了对非欧几里得数据的优化问题高效求解和计算成本的大幅降低。",
    "en_tdlr": "This paper introduces a deep and efficient continuous manifold learning framework that leverages a diffeomorphism mapping between Riemannian manifolds and a Cholesky space, achieving efficient optimization and significantly reducing computation costs for non-Euclidean data."
}