{
    "title": "GREED: A Neural Framework for Learning Graph Distance Functions. (arXiv:2112.13143v3 [cs.LG] UPDATED)",
    "abstract": "Among various distance functions for graphs, graph and subgraph edit distances (GED and SED respectively) are two of the most popular and expressive measures. Unfortunately, exact computations for both are NP-hard. To overcome this computational bottleneck, neural approaches to learn and predict edit distance in polynomial time have received much interest. While considerable progress has been made, there exist limitations that need to be addressed. First, the efficacy of an approximate distance function lies not only in its approximation accuracy, but also in the preservation of its properties. To elaborate, although GED is a metric, its neural approximations do not provide such a guarantee. This prohibits their usage in higher order tasks that rely on metric distance functions, such as clustering or indexing. Second, several existing frameworks for GED do not extend to SED due to SED being asymmetric. In this work, we design a novel siamese graph neural network called GREED, which thr",
    "link": "http://arxiv.org/abs/2112.13143",
    "context": "Title: GREED: A Neural Framework for Learning Graph Distance Functions. (arXiv:2112.13143v3 [cs.LG] UPDATED)\nAbstract: Among various distance functions for graphs, graph and subgraph edit distances (GED and SED respectively) are two of the most popular and expressive measures. Unfortunately, exact computations for both are NP-hard. To overcome this computational bottleneck, neural approaches to learn and predict edit distance in polynomial time have received much interest. While considerable progress has been made, there exist limitations that need to be addressed. First, the efficacy of an approximate distance function lies not only in its approximation accuracy, but also in the preservation of its properties. To elaborate, although GED is a metric, its neural approximations do not provide such a guarantee. This prohibits their usage in higher order tasks that rely on metric distance functions, such as clustering or indexing. Second, several existing frameworks for GED do not extend to SED due to SED being asymmetric. In this work, we design a novel siamese graph neural network called GREED, which thr",
    "path": "papers/21/12/2112.13143.json",
    "total_tokens": 1065,
    "translated_title": "GREED: 一种学习图距离函数的神经框架",
    "translated_abstract": "在各种图的距离函数中，图和子图编辑距离（GED和SED）是最受欢迎和最具有表现力的度量之一。不幸的是，对于它们的精确计算都是NP难问题。为了克服这个计算难点，在多项式时间内学习和预测编辑距离的神经方法受到了广泛的关注。在取得相当进展的同时，存在需要解决的局限性。首先，近似距离函数的功效不仅在于其逼近精度，还在于其属性的保持。虽然GED是一个度量，但其神经逼近并不提供这样的保证。这一点禁止了它们在依赖于度量距离函数的高阶任务（如聚类或索引）中的使用。其次，由于SED是不对称的，因此一些现有的GED框架无法扩展到SED。在这项工作中，我们设计了一种名为GREED的新型连锁图神经网络，通过多任务学习预测GED和SED距离。所提出的框架通过确保学习的距离保持度量属性，并使SED的高效计算成为可能，克服了以前方法的局限性。在基准数据集上进行的广泛实验表明，GREED优于现有的最先进方法。",
    "tldr": "GREED是一种可以学习和预测图编辑距离（GED和SED）的神经网络框架，通过多任务学习来确保距离保持度量属性并使SED的高效计算成为可能，比现有最先进的方法表现更好。",
    "en_tdlr": "GREED is a neural network framework that can learn and predict graph edit distances (GED and SED). Through multi-task learning, it ensures that the learned distances preserve metric properties and enables efficient computation of SED, outperforming existing state-of-the-art methods."
}