{
    "title": "Constrained multi-objective optimization of process design parameters in settings with scarce data: an application to adhesive bonding. (arXiv:2112.08760v3 [cs.NE] UPDATED)",
    "abstract": "Adhesive joints are increasingly used in industry for a wide variety of applications because of their favorable characteristics such as high strength-to-weight ratio, design flexibility, limited stress concentrations, planar force transfer, good damage tolerance, and fatigue resistance. Finding the optimal process parameters for an adhesive bonding process is challenging: the optimization is inherently multi-objective (aiming to maximize break strength while minimizing cost), constrained (the process should not result in any visual damage to the materials, and stress tests should not result in failures that are adhesion-related), and uncertain (testing the same process parameters several times may lead to different break strengths). Real-life physical experiments in the lab are expensive to perform. Traditional evolutionary approaches (such as genetic algorithms) are then ill-suited to solve the problem, due to the prohibitive amount of experiments required for evaluation. Although Bay",
    "link": "http://arxiv.org/abs/2112.08760",
    "context": "Title: Constrained multi-objective optimization of process design parameters in settings with scarce data: an application to adhesive bonding. (arXiv:2112.08760v3 [cs.NE] UPDATED)\nAbstract: Adhesive joints are increasingly used in industry for a wide variety of applications because of their favorable characteristics such as high strength-to-weight ratio, design flexibility, limited stress concentrations, planar force transfer, good damage tolerance, and fatigue resistance. Finding the optimal process parameters for an adhesive bonding process is challenging: the optimization is inherently multi-objective (aiming to maximize break strength while minimizing cost), constrained (the process should not result in any visual damage to the materials, and stress tests should not result in failures that are adhesion-related), and uncertain (testing the same process parameters several times may lead to different break strengths). Real-life physical experiments in the lab are expensive to perform. Traditional evolutionary approaches (such as genetic algorithms) are then ill-suited to solve the problem, due to the prohibitive amount of experiments required for evaluation. Although Bay",
    "path": "papers/21/12/2112.08760.json",
    "total_tokens": 1250,
    "translated_title": "限制条件下稀有数据情况下的过程设计参数多目标优化：一种用于粘接的应用",
    "translated_abstract": "粘接是工业中越来越常用的一种技术，因其高强度重量比、设计灵活性、应力集中有限、平面力传递、良好的耐损性和疲劳抗性等优点而备受青睐。寻找粘接工艺的最佳参数是一项具有挑战性的任务：优化本质上是多目标的（旨在最大化断裂强度并最小化成本），受限制的（工艺不应导致任何材料视觉损伤，应力测试不应导致黏附相关的故障）和不确定的（多次测试同一工艺参数可能导致不同的断裂强度）。实验室中的真实物理实验很昂贵。传统的进化方法（例如遗传算法）则不适合解决这个问题，因为评估所需的实验数量是巨大的。虽然贝叶斯优化可以帮助减少所需的实验数量，但在稀有数据情况下使用仍然具有挑战性。在本文中，我们提出了一种针对粘接的限制条件下稀有数据情况下的多目标优化方法。我们的方法使用自适应采样策略在探索和开发之间平衡探索参数空间。我们还提出了一种基于代理的约束处理技术，以在不显式评估约束条件的情况下将其包含在决策过程中。该方法在真实的工业案例研究中进行了评估，并证明在减少所需实验的同时可以有效地找到高质量的解决方案。",
    "tldr": "本文提出了一种用于稀缺数据情况下的粘接过程设计参数多目标优化方法。通过自适应采样策略和基于代理的约束处理技术，该方法在不显式评估约束条件的情况下，在探索参数空间和平衡开发之间找到高质量的解决方案。"
}