{
    "title": "Joint Learning of Linear Time-Invariant Dynamical Systems. (arXiv:2112.10955v6 [stat.ML] UPDATED)",
    "abstract": "Linear time-invariant systems are very popular models in system theory and applications. A fundamental problem in system identification that remains rather unaddressed in extant literature is to leverage commonalities amongst related linear systems to estimate their transition matrices more accurately. To address this problem, the current paper investigates methods for jointly estimating the transition matrices of multiple systems. It is assumed that the transition matrices are unknown linear functions of some unknown shared basis matrices. We establish finite-time estimation error rates that fully reflect the roles of trajectory lengths, dimension, and number of systems under consideration. The presented results are fairly general and show the significant gains that can be achieved by pooling data across systems in comparison to learning each system individually. Further, they are shown to be robust against model misspecifications. To obtain the results, we develop novel techniques th",
    "link": "http://arxiv.org/abs/2112.10955",
    "context": "Title: Joint Learning of Linear Time-Invariant Dynamical Systems. (arXiv:2112.10955v6 [stat.ML] UPDATED)\nAbstract: Linear time-invariant systems are very popular models in system theory and applications. A fundamental problem in system identification that remains rather unaddressed in extant literature is to leverage commonalities amongst related linear systems to estimate their transition matrices more accurately. To address this problem, the current paper investigates methods for jointly estimating the transition matrices of multiple systems. It is assumed that the transition matrices are unknown linear functions of some unknown shared basis matrices. We establish finite-time estimation error rates that fully reflect the roles of trajectory lengths, dimension, and number of systems under consideration. The presented results are fairly general and show the significant gains that can be achieved by pooling data across systems in comparison to learning each system individually. Further, they are shown to be robust against model misspecifications. To obtain the results, we develop novel techniques th",
    "path": "papers/21/12/2112.10955.json",
    "total_tokens": 812,
    "translated_title": "共同学习线性时不变动力系统",
    "translated_abstract": "线性时不变系统是系统论和应用中非常流行的模型。系统辨识中一个未受到充分关注的基本问题是如何利用相关线性系统之间的共性来更准确地估计它们的转移矩阵。为了解决这个问题，本文研究了联合估计多个系统的转移矩阵的方法。假设转移矩阵是一些未知共享基础矩阵的未知线性函数。我们建立了完全反映考虑的轨迹长度、维度和系统数量的有限时间估计误差率。所呈现的结果相当普遍，并显示了与单独学习每个系统相比，通过系统之间的数据汇集可以获得的显著收益。此外，结果还显示了对模型错误设定具有鲁棒性。为了得到这些结果，我们开发了新的技术方法。",
    "tldr": "本研究探讨了共同估计多个线性时不变系统的转移矩阵的方法，并展示了通过数据汇集可以显著提高估计准确性的重要收益。",
    "en_tdlr": "This paper investigates methods for jointly estimating the transition matrices of multiple linear time-invariant systems, showing significant gains in estimation accuracy by pooling data across systems."
}