{
    "title": "Sufficient-Statistic Memory AMP. (arXiv:2112.15327v4 [cs.IT] UPDATED)",
    "abstract": "Approximate message passing (AMP) type algorithms have been widely used in the signal reconstruction of certain large random linear systems. A key feature of the AMP-type algorithms is that their dynamics can be correctly described by state evolution. While state evolution is a useful analytic tool, its convergence is not guaranteed. To solve the convergence problem of the state evolution of AMP-type algorithms in principle, this paper proposes a sufficient-statistic memory AMP (SS-MAMP) algorithm framework under the conditions of right-unitarily invariant sensing matrices, Lipschitz-continuous local processors and the sufficient-statistic constraint (i.e., the current message of each local processor is a sufficient statistic of the signal vector given the current and all preceding messages). We show that the covariance matrices of SS-MAMP are L-banded and convergent, which is an optimal framework (from the local MMSE/LMMSE perspective) for AMP-type algorithms given the Lipschitz-conti",
    "link": "http://arxiv.org/abs/2112.15327",
    "context": "Title: Sufficient-Statistic Memory AMP. (arXiv:2112.15327v4 [cs.IT] UPDATED)\nAbstract: Approximate message passing (AMP) type algorithms have been widely used in the signal reconstruction of certain large random linear systems. A key feature of the AMP-type algorithms is that their dynamics can be correctly described by state evolution. While state evolution is a useful analytic tool, its convergence is not guaranteed. To solve the convergence problem of the state evolution of AMP-type algorithms in principle, this paper proposes a sufficient-statistic memory AMP (SS-MAMP) algorithm framework under the conditions of right-unitarily invariant sensing matrices, Lipschitz-continuous local processors and the sufficient-statistic constraint (i.e., the current message of each local processor is a sufficient statistic of the signal vector given the current and all preceding messages). We show that the covariance matrices of SS-MAMP are L-banded and convergent, which is an optimal framework (from the local MMSE/LMMSE perspective) for AMP-type algorithms given the Lipschitz-conti",
    "path": "papers/21/12/2112.15327.json",
    "total_tokens": 838,
    "translated_title": "充分统计记忆型AMP算法",
    "translated_abstract": "近似消息传递（AMP）类型的算法在某些大型随机线性系统的信号重构中被广泛使用。AMP类型算法的一个关键特点是它们的动态可以通过状态演化正确地描述。虽然状态演化是一个有用的分析工具，但其收敛性并不保证。为了在原则上解决AMP类型算法的状态演化的收敛问题，本文提出了一种在正确单位不变的感知矩阵、Lipschitz连续的本地处理器和充分统计约束下的充分统计记忆型AMP（SS-MAMP）算法框架。我们证明了SS-MAMP的协方差矩阵是L带状的且收敛，这是一个最优的框架（从本地MMSE/LMMSE角度）给定Lipschitz连续的AMP类型算法。",
    "tldr": "该论文提出了一种在特定条件下解决AMP类型算法收敛性问题的充分统计记忆型AMP算法框架，通过充分统计约束和特定条件下的协方差矩阵性质，实现了有效的信号重构。",
    "en_tdlr": "This paper proposes a sufficient-statistic memory AMP (SS-MAMP) algorithm framework to solve the convergence problem of AMP-type algorithms in certain conditions. By utilizing sufficient-statistic constraint and specific properties of covariance matrices, it achieves efficient signal reconstruction."
}