{
    "title": "Topic Detection and Tracking with Time-Aware Document Embeddings",
    "abstract": "arXiv:2112.06166v2 Announce Type: replace  Abstract: The time at which a message is communicated is a vital piece of metadata in many real-world natural language processing tasks such as Topic Detection and Tracking (TDT). TDT systems aim to cluster a corpus of news articles by event, and in that context, stories that describe the same event are likely to have been written at around the same time. Prior work on time modeling for TDT takes this into account, but does not well capture how time interacts with the semantic nature of the event. For example, stories about a tropical storm are likely to be written within a short time interval, while stories about a movie release may appear over weeks or months. In our work, we design a neural method that fuses temporal and textual information into a single representation of news documents for event detection. We fine-tune these time-aware document embeddings with a triplet loss architecture, integrate the model into downstream TDT systems, an",
    "link": "https://arxiv.org/abs/2112.06166",
    "context": "Title: Topic Detection and Tracking with Time-Aware Document Embeddings\nAbstract: arXiv:2112.06166v2 Announce Type: replace  Abstract: The time at which a message is communicated is a vital piece of metadata in many real-world natural language processing tasks such as Topic Detection and Tracking (TDT). TDT systems aim to cluster a corpus of news articles by event, and in that context, stories that describe the same event are likely to have been written at around the same time. Prior work on time modeling for TDT takes this into account, but does not well capture how time interacts with the semantic nature of the event. For example, stories about a tropical storm are likely to be written within a short time interval, while stories about a movie release may appear over weeks or months. In our work, we design a neural method that fuses temporal and textual information into a single representation of news documents for event detection. We fine-tune these time-aware document embeddings with a triplet loss architecture, integrate the model into downstream TDT systems, an",
    "path": "papers/21/12/2112.06166.json",
    "total_tokens": 829,
    "translated_title": "具有时间感知文档嵌入的主题检测和跟踪",
    "translated_abstract": "一条信息被传播的时间是许多现实世界自然语言处理任务中元数据的关键部分，例如主题检测和跟踪（TDT）。TDT系统旨在通过事件将新闻文章语料库进行聚类，在这种情况下，描述同一事件的故事很可能是在大致相同的时间编写的。先前关于TDT的时间建模的工作考虑到了这一点，但未能很好地捕捉时间如何与事件的语义特性相互作用。例如，关于热带风暴的故事很可能在短时间间隔内编写，而关于电影上映的故事可能会持续几周或几个月。在我们的工作中，我们设计了一种神经方法，将时间和文本信息融合到新闻文档的单一表示中，用于事件检测。我们使用三元损失架构对这些具有时间感知性的文档嵌入进行微调，将模型整合到下游TDT系统中。",
    "tldr": "设计了一种将时间和文本信息融合在新闻文档表示中的神经方法，用于事件检测。",
    "en_tdlr": "A neural method was designed to fuse temporal and textual information into a single representation of news documents for event detection."
}