{
    "title": "Modification-Fair Cluster Editing. (arXiv:2112.03183v2 [cs.DS] UPDATED)",
    "abstract": "The classic Cluster Editing problem (also known as Correlation Clustering) asks to transform a given graph into a disjoint union of cliques (clusters) by a small number of edge modifications. When applied to vertex-colored graphs (the colors representing subgroups), standard algorithms for the NP-hard Cluster Editing problem may yield solutions that are biased towards subgroups of data (e.g., demographic groups), measured in the number of modifications incident to the members of the subgroups. We propose a modification fairness constraint which ensures that the number of edits incident to each subgroup is proportional to its size. To start with, we study Modification-Fair Cluster Editing for graphs with two vertex colors. We show that the problem is NP-hard even if one may only insert edges within a subgroup; note that in the classic \"non-fair\" setting, this case is trivially polynomial-time solvable. However, in the more general editing form, the modification-fair variant remains fixe",
    "link": "http://arxiv.org/abs/2112.03183",
    "context": "Title: Modification-Fair Cluster Editing. (arXiv:2112.03183v2 [cs.DS] UPDATED)\nAbstract: The classic Cluster Editing problem (also known as Correlation Clustering) asks to transform a given graph into a disjoint union of cliques (clusters) by a small number of edge modifications. When applied to vertex-colored graphs (the colors representing subgroups), standard algorithms for the NP-hard Cluster Editing problem may yield solutions that are biased towards subgroups of data (e.g., demographic groups), measured in the number of modifications incident to the members of the subgroups. We propose a modification fairness constraint which ensures that the number of edits incident to each subgroup is proportional to its size. To start with, we study Modification-Fair Cluster Editing for graphs with two vertex colors. We show that the problem is NP-hard even if one may only insert edges within a subgroup; note that in the classic \"non-fair\" setting, this case is trivially polynomial-time solvable. However, in the more general editing form, the modification-fair variant remains fixe",
    "path": "papers/21/12/2112.03183.json",
    "total_tokens": 835,
    "translated_title": "修改公平的集群编辑",
    "translated_abstract": "经典的集群编辑问题（也称为相关聚类）要求通过少量的边缘修改将给定的图形转换为不相交的团（集群）。当应用于顶点着色图时（颜色表示子组），对于 NP-hard 的集群编辑问题的标准算法可能会产生偏向数据子组（例如，人口统计学组）的解决方案，这种偏向是通过与子组成员相关的修改数量来衡量的。我们提出了修改公平约束，确保每个子组的编辑数量与其大小成比例。首先，我们研究了具有两种顶点颜色的图形的修改公平集群编辑问题。我们证明了即使只允许在子组内部插入边缘，该问题仍然是 NP-hard 的；需要注意的是，在经典的“非公平”设置中，此情况可以轻松在多项式时间内解决。然而，在更一般的编辑形式中，修改公平的变体仍然是固定的。",
    "tldr": "这个论文提出了一种修改公平的集群编辑问题，解决了在顶点着色图中标准算法可能产生的偏向子组的解决方案。具体而言，在双色图中，问题是 NP-hard 的，即使只允许在子组内部插入边缘。"
}