{
    "title": "MDPFuzz: Testing Models Solving Markov Decision Processes. (arXiv:2112.02807v4 [cs.SE] UPDATED)",
    "abstract": "The Markov decision process (MDP) provides a mathematical framework for modeling sequential decision-making problems, many of which are crucial to security and safety, such as autonomous driving and robot control. The rapid development of artificial intelligence research has created efficient methods for solving MDPs, such as deep neural networks (DNNs), reinforcement learning (RL), and imitation learning (IL). However, these popular models solving MDPs are neither thoroughly tested nor rigorously reliable.  We present MDPFuzz, the first blackbox fuzz testing framework for models solving MDPs. MDPFuzz forms testing oracles by checking whether the target model enters abnormal and dangerous states. During fuzzing, MDPFuzz decides which mutated state to retain by measuring if it can reduce cumulative rewards or form a new state sequence. We design efficient techniques to quantify the \"freshness\" of a state sequence using Gaussian mixture models (GMMs) and dynamic expectation-maximization ",
    "link": "http://arxiv.org/abs/2112.02807",
    "context": "Title: MDPFuzz: Testing Models Solving Markov Decision Processes. (arXiv:2112.02807v4 [cs.SE] UPDATED)\nAbstract: The Markov decision process (MDP) provides a mathematical framework for modeling sequential decision-making problems, many of which are crucial to security and safety, such as autonomous driving and robot control. The rapid development of artificial intelligence research has created efficient methods for solving MDPs, such as deep neural networks (DNNs), reinforcement learning (RL), and imitation learning (IL). However, these popular models solving MDPs are neither thoroughly tested nor rigorously reliable.  We present MDPFuzz, the first blackbox fuzz testing framework for models solving MDPs. MDPFuzz forms testing oracles by checking whether the target model enters abnormal and dangerous states. During fuzzing, MDPFuzz decides which mutated state to retain by measuring if it can reduce cumulative rewards or form a new state sequence. We design efficient techniques to quantify the \"freshness\" of a state sequence using Gaussian mixture models (GMMs) and dynamic expectation-maximization ",
    "path": "papers/21/12/2112.02807.json",
    "total_tokens": 1029,
    "translated_title": "MDPFuzz: 用于测试解决马尔可夫决策过程的模型的黑盒模糊测试框架",
    "translated_abstract": "马尔可夫决策过程（MDP）提供了一种数学框架，用于建模顺序决策问题，其中许多问题对于安全和可靠性是至关重要的，例如自动驾驶和机器人控制。人工智能研究的快速发展已经创造出了解决MDP的有效方法，例如深度神经网络（DNNs）、强化学习（RL）和模仿学习（IL）。然而，这些受欢迎的解决MDP的模型既没有得到彻底的测试，也不是严格可靠的。本文提出MDPFuzz，这是一种用于模型解决MDP的黑盒模糊测试框架。MDPFuzz通过检查目标模型是否进入异常和危险状态来形成测试预言。在模糊化过程中，MDPFuzz通过测量是否可以减少累积奖励或形成新的状态序列来决定保留哪个突变状态。我们设计了有效的技术来使用高斯混合模型（GMMs）和动态期望最大化量化状态序列的“新鲜度”。",
    "tldr": "MDPFuzz是第一个用于测试解决MDP的模型的黑盒模糊测试框架。该框架通过检查这些模型是否进入异常危险状态来生成测试预言，并使用高斯混合模型及动态期望最大化的方法来量化状态序列的“新鲜度”以决定保留哪个突变状态。",
    "en_tdlr": "MDPFuzz is the first blackbox fuzz testing framework for models solving Markov Decision Processes (MDPs). It generates testing oracles by checking whether the target model enters abnormal and dangerous states and uses efficient techniques, including Gaussian mixture models and dynamic expectation-maximization, to quantify the \"freshness\" of state sequences during fuzzing to determine which mutated state to retain."
}