{
    "title": "Fast Projected Newton-like Method for Precision Matrix Estimation under Total Positivity. (arXiv:2112.01939v4 [cs.LG] UPDATED)",
    "abstract": "We study the problem of estimating precision matrices in Gaussian distributions that are multivariate totally positive of order two ($\\mathrm{MTP}_2$). The precision matrix in such a distribution is an M-matrix. This problem can be formulated as a sign-constrained log-determinant program. Current algorithms are designed using the block coordinate descent method or the proximal point algorithm, which becomes computationally challenging in high-dimensional cases due to the requirement to solve numerous nonnegative quadratic programs or large-scale linear systems. To address this issue, we propose a novel algorithm based on the two-metric projection method, incorporating a carefully designed search direction and variable partitioning scheme. Our algorithm substantially reduces computational complexity, and its theoretical convergence is established. Experimental results on synthetic and real-world datasets demonstrate that our proposed algorithm provides a significant improvement in compu",
    "link": "http://arxiv.org/abs/2112.01939",
    "context": "Title: Fast Projected Newton-like Method for Precision Matrix Estimation under Total Positivity. (arXiv:2112.01939v4 [cs.LG] UPDATED)\nAbstract: We study the problem of estimating precision matrices in Gaussian distributions that are multivariate totally positive of order two ($\\mathrm{MTP}_2$). The precision matrix in such a distribution is an M-matrix. This problem can be formulated as a sign-constrained log-determinant program. Current algorithms are designed using the block coordinate descent method or the proximal point algorithm, which becomes computationally challenging in high-dimensional cases due to the requirement to solve numerous nonnegative quadratic programs or large-scale linear systems. To address this issue, we propose a novel algorithm based on the two-metric projection method, incorporating a carefully designed search direction and variable partitioning scheme. Our algorithm substantially reduces computational complexity, and its theoretical convergence is established. Experimental results on synthetic and real-world datasets demonstrate that our proposed algorithm provides a significant improvement in compu",
    "path": "papers/21/12/2112.01939.json",
    "total_tokens": 914,
    "translated_title": "高精度矩阵估计下的快速投影牛顿样式方法",
    "translated_abstract": "我们研究了在满足二阶多元完全正性（$\\mathrm{MTP}_2$）的高斯分布中估计精确度矩阵的问题。这种分布中的精确度矩阵是M矩阵。这个问题可以被表示为一个符号约束的对数行列式规划。目前的算法使用块坐标下降法或者近端点算法来设计，但在高维情况下由于需要解决大量非负二次规划或大规模线性系统而变得计算困难。为了解决这个问题，我们提出了一种基于双度量投影方法的新算法，结合了精心设计的搜索方向和变量分区方案。我们的算法大大降低了计算复杂度，并且其理论收敛性得到了证明。在合成和真实数据集上的实验结果表明，我们提出的算法在计算效率上有显著改进。",
    "tldr": "本研究解决了在高斯分布中估计满足完全正性的精确度矩阵（$\\mathrm{MTP}_2$）的问题。我们提出了一种基于双度量投影方法的新算法，大幅降低了计算复杂度，并且在合成和真实数据集上的实验证明了其显著改进。",
    "en_tdlr": "This study addresses the problem of estimating precision matrices satisfying total positivity in Gaussian distributions ($\\mathrm{MTP}_2$). A novel algorithm based on the two-metric projection method is proposed, which significantly reduces computational complexity and demonstrates significant improvements in synthetic and real-world datasets."
}