{
    "title": "DegreEmbed: incorporating entity embedding into logic rule learning for knowledge graph reasoning. (arXiv:2112.09933v2 [cs.LG] UPDATED)",
    "abstract": "Knowledge graphs (KGs), as structured representations of real world facts, are intelligent databases incorporating human knowledge that can help machine imitate the way of human problem solving. However, KGs are usually huge and there are inevitably missing facts in KGs, thus undermining applications such as question answering and recommender systems that are based on knowledge graph reasoning. Link prediction for knowledge graphs is the task aiming to complete missing facts by reasoning based on the existing knowledge. Two main streams of research are widely studied: one learns low-dimensional embeddings for entities and relations that can explore latent patterns, and the other gains good interpretability by mining logical rules. Unfortunately, the heterogeneity of modern KGs that involve entities and relations of various types is not well considered in the previous studies. In this paper, we propose DegreEmbed, a model that combines embedding-based learning and logic rule mining for ",
    "link": "http://arxiv.org/abs/2112.09933",
    "context": "Title: DegreEmbed: incorporating entity embedding into logic rule learning for knowledge graph reasoning. (arXiv:2112.09933v2 [cs.LG] UPDATED)\nAbstract: Knowledge graphs (KGs), as structured representations of real world facts, are intelligent databases incorporating human knowledge that can help machine imitate the way of human problem solving. However, KGs are usually huge and there are inevitably missing facts in KGs, thus undermining applications such as question answering and recommender systems that are based on knowledge graph reasoning. Link prediction for knowledge graphs is the task aiming to complete missing facts by reasoning based on the existing knowledge. Two main streams of research are widely studied: one learns low-dimensional embeddings for entities and relations that can explore latent patterns, and the other gains good interpretability by mining logical rules. Unfortunately, the heterogeneity of modern KGs that involve entities and relations of various types is not well considered in the previous studies. In this paper, we propose DegreEmbed, a model that combines embedding-based learning and logic rule mining for ",
    "path": "papers/21/12/2112.09933.json",
    "total_tokens": 1089,
    "translated_title": "DegreEmbed: 将实体嵌入融入逻辑规则学习，用于知识图谱推理",
    "translated_abstract": "知识图谱是一种结构化的现实世界事实表示，它们是智能数据库，将人类知识融入其中，帮助机器模仿人类的问题解决方式。然而，实际的知识图谱通常非常庞大，而且不可避免地存在缺失的事实，从而损害了基于知识图谱推理的问答和推荐系统等应用。知识图谱中的链接预测是通过基于现有知识推理来完成缺失事实的任务。主要有两种研究流派：一种学习实体和关系的低维度嵌入，可以探索潜在模式；另一种通过挖掘逻辑规则获得良好的可解释性。不幸的是，涉及各种类型的实体和关系的现代知识图谱的异质性在先前的研究中没有得到很好的考虑。本文提出了DegreEmbed，一种模型，它将基于嵌入的学习和逻辑规则挖掘相结合，用于知识图谱推理。DegreEmbed将实体嵌入融入逻辑规则学习中，使模型能够同时处理实体属性和关系，并解决知识图谱的异质性问题。基准数据集上的实验结果表明，DegreEmbed在链接预测和规则提取方面优于现有方法。",
    "tldr": "本文介绍了一种将实体嵌入和逻辑规则挖掘相结合的新模型DegreEmbed，用于知识图谱推理。实验结果表明，DegreEmbed在链接预测和规则提取方面优于现有方法。",
    "en_tdlr": "The paper introduces a new model, DegreEmbed, that combines entity embedding and logic rule mining for knowledge graph reasoning. Experimental results show that DegreEmbed outperforms existing methods in link prediction and rule extraction."
}