{
    "title": "Demonstration Informed Specification Search. (arXiv:2112.10807v4 [cs.AI] UPDATED)",
    "abstract": "This paper considers the problem of learning temporal task specifications, e.g. automata and temporal logic, from expert demonstrations. Task specifications are a class of sparse memory augmented rewards with explicit support for temporal and Boolean composition. Three features make learning temporal task specifications difficult: (1) the (countably) infinite number of tasks under consideration; (2) an a-priori ignorance of what memory is needed to encode the task; and (3) the discrete solution space - typically addressed by (brute force) enumeration. To overcome these hurdles, we propose Demonstration Informed Specification Search (DISS): a family of algorithms requiring only black box access to a maximum entropy planner and a task sampler from labeled examples. DISS then works by alternating between conjecturing labeled examples to make the provided demonstrations less surprising and sampling tasks consistent with the conjectured labeled examples. We provide a concrete implementation",
    "link": "http://arxiv.org/abs/2112.10807",
    "context": "Title: Demonstration Informed Specification Search. (arXiv:2112.10807v4 [cs.AI] UPDATED)\nAbstract: This paper considers the problem of learning temporal task specifications, e.g. automata and temporal logic, from expert demonstrations. Task specifications are a class of sparse memory augmented rewards with explicit support for temporal and Boolean composition. Three features make learning temporal task specifications difficult: (1) the (countably) infinite number of tasks under consideration; (2) an a-priori ignorance of what memory is needed to encode the task; and (3) the discrete solution space - typically addressed by (brute force) enumeration. To overcome these hurdles, we propose Demonstration Informed Specification Search (DISS): a family of algorithms requiring only black box access to a maximum entropy planner and a task sampler from labeled examples. DISS then works by alternating between conjecturing labeled examples to make the provided demonstrations less surprising and sampling tasks consistent with the conjectured labeled examples. We provide a concrete implementation",
    "path": "papers/21/12/2112.10807.json",
    "total_tokens": 808,
    "translated_title": "演示指导的规范搜索",
    "translated_abstract": "本文考虑了从专家演示中学习时间任务规范的问题，例如自动机和时间逻辑。任务规范是一类带有明确的时间和布尔组合支持的稀疏记忆增强奖励。学习时间任务规范具有以下三个困难：（1）（可数的）无限数量的任务；（2）不知道编码任务所需的内存；（3）离散解空间通常需要通过（暴力）枚举。为了克服这些困难，我们提出了演示指导的规范搜索（DISS）：一族只需要黑盒访问最大熵规划器和来自标记示例的任务采样器的算法。然后，DISS通过交替猜测标记示例来使提供的演示变得不那么令人惊讶，并采样与猜测的标记示例一致的任务。我们提供了一个具体实现。",
    "tldr": "本文提出了演示指导的规范搜索（DISS）算法，可以从专家演示中学习时间任务规范。",
    "en_tdlr": "This paper proposes the Demonstration Informed Specification Search (DISS) algorithm for learning temporal task specifications from expert demonstrations, overcoming the hurdles of infinite tasks, unknown memory requirements, and discrete solution space."
}