{
    "title": "Linear Discriminant Analysis with High-dimensional Mixed Variables. (arXiv:2112.07145v3 [stat.ME] UPDATED)",
    "abstract": "Datasets containing both categorical and continuous variables are frequently encountered in many areas, and with the rapid development of modern measurement technologies, the dimensions of these variables can be very high. Despite the recent progress made in modelling high-dimensional data for continuous variables, there is a scarcity of methods that can deal with a mixed set of variables. To fill this gap, this paper develops a novel approach for classifying high-dimensional observations with mixed variables. Our framework builds on a location model, in which the distributions of the continuous variables conditional on categorical ones are assumed Gaussian. We overcome the challenge of having to split data into exponentially many cells, or combinations of the categorical variables, by kernel smoothing, and provide new perspectives for its bandwidth choice to ensure an analogue of Bochner's Lemma, which is different to the usual bias-variance tradeoff. We show that the two sets of para",
    "link": "http://arxiv.org/abs/2112.07145",
    "context": "Title: Linear Discriminant Analysis with High-dimensional Mixed Variables. (arXiv:2112.07145v3 [stat.ME] UPDATED)\nAbstract: Datasets containing both categorical and continuous variables are frequently encountered in many areas, and with the rapid development of modern measurement technologies, the dimensions of these variables can be very high. Despite the recent progress made in modelling high-dimensional data for continuous variables, there is a scarcity of methods that can deal with a mixed set of variables. To fill this gap, this paper develops a novel approach for classifying high-dimensional observations with mixed variables. Our framework builds on a location model, in which the distributions of the continuous variables conditional on categorical ones are assumed Gaussian. We overcome the challenge of having to split data into exponentially many cells, or combinations of the categorical variables, by kernel smoothing, and provide new perspectives for its bandwidth choice to ensure an analogue of Bochner's Lemma, which is different to the usual bias-variance tradeoff. We show that the two sets of para",
    "path": "papers/21/12/2112.07145.json",
    "total_tokens": 851,
    "translated_title": "具有高维混合变量的线性判别分析",
    "translated_abstract": "在许多领域中经常遇到同时包含分类和连续变量的数据集，随着现代测量技术的快速发展，这些变量的维度可能非常高。尽管在连续变量的高维数据建模方面取得了一些进展，但对于混合变量集合的处理方法仍然很稀缺。为了填补这一空白，本文提出了一种针对高维混合变量观测的分类新方法。我们的框架建立在一个位置模型上，其中假设连续变量在给定分类变量下的条件分布是高斯分布。通过核平滑克服了将数据分割成指数级别的单元格或分类变量组合的挑战，并对其带宽选择提供了新的视角，以确保Bochner引理的类比，这与通常的偏差-方差权衡不同。我们证明了这两组参数可以同时估计，准确性也有所保证。",
    "tldr": "本文提出了一种针对高维混合变量观测的分类新方法，通过核平滑克服了数据分割和带宽选择的挑战，为解决这一问题提供了新的视角。",
    "en_tdlr": "This paper presents a novel approach for classifying high-dimensional observations with mixed variables, overcoming the challenges of data splitting and bandwidth selection by kernel smoothing and providing new perspectives for addressing this problem."
}