{
    "title": "Welfare v. Consent: On the Optimal Penalty for Harassment. (arXiv:2103.00734v2 [econ.GN] UPDATED)",
    "abstract": "The economic approach to determine optimal legal policies involves maximizing a social welfare function. We propose an alternative: a consent-approach that seeks to promote consensual interactions and deter non-consensual interactions. The consent-approach does not rest upon inter-personal utility comparisons or value judgments about preferences. It does not require any additional information relative to the welfare-approach. We highlight the contrast between the welfare-approach and the consent-approach using a stylized model inspired by seminal cases of harassment and the #MeToo movement. The social welfare maximizing penalty for harassment in our model can be zero under the welfare-approach but not under the consent-approach.",
    "link": "http://arxiv.org/abs/2103.00734",
    "context": "Title: Welfare v. Consent: On the Optimal Penalty for Harassment. (arXiv:2103.00734v2 [econ.GN] UPDATED)\nAbstract: The economic approach to determine optimal legal policies involves maximizing a social welfare function. We propose an alternative: a consent-approach that seeks to promote consensual interactions and deter non-consensual interactions. The consent-approach does not rest upon inter-personal utility comparisons or value judgments about preferences. It does not require any additional information relative to the welfare-approach. We highlight the contrast between the welfare-approach and the consent-approach using a stylized model inspired by seminal cases of harassment and the #MeToo movement. The social welfare maximizing penalty for harassment in our model can be zero under the welfare-approach but not under the consent-approach.",
    "path": "papers/21/03/2103.00734.json",
    "total_tokens": 815,
    "translated_title": "福利与同意：关于骚扰的最优处罚",
    "translated_abstract": "确定最优法律政策的经济学方法涉及最大化社会福利函数。我们提出了一种替代方法：同意方法，旨在促进同意交互和防止非同意交互。同意方法不依赖于人际效用比较或有关偏好的价值判断。它不需要任何相对于福利方法的额外信息。我们使用一个样式化模型来突出福利方法和同意方法之间的差异，该模型受到骚扰的经典案例和MeToo运动的启发。在我们的模型中，根据福利方法，骚扰的社会福利最大化惩罚可以为零，但根据同意方法则不然。",
    "tldr": "该论文提出了一种替代经济学方法，名为同意方法，以促进同意交互和防止非同意交互，突出了同意方法与福利方法之间的差异，其中同意方法对于骚扰的处罚不能为零。",
    "en_tdlr": "This paper proposes an alternative economic approach called the \"consent-approach\" to promote consensual interactions and deter non-consensual interactions. It highlights the contrast between the consent-approach and the traditional welfare-approach using a stylized model inspired by harassment cases and the #MeToo movement, and shows that the social welfare maximizing penalty for harassment may be zero under the welfare-approach but not under the consent-approach."
}