{
    "title": "On the Stability of Nonlinear Receding Horizon Control: A Geometric Perspective. (arXiv:2103.15010v3 [math.OC] UPDATED)",
    "abstract": "%!TEX root = LCSS_main_max.tex  The widespread adoption of nonlinear Receding Horizon Control (RHC) strategies by industry has led to more than 30 years of intense research efforts to provide stability guarantees for these methods. However, current theoretical guarantees require that each (generally nonconvex) planning problem can be solved to (approximate) global optimality, which is an unrealistic requirement for the derivative-based local optimization methods generally used in practical implementations of RHC. This paper takes the first step towards understanding stability guarantees for nonlinear RHC when the inner planning problem is solved to first-order stationary points, but not necessarily global optima. Special attention is given to feedback linearizable systems, and a mixture of positive and negative results are provided. We establish that, under certain strong conditions, first-order solutions to RHC exponentially stabilize linearizable systems. Surprisingly, these conditio",
    "link": "http://arxiv.org/abs/2103.15010",
    "context": "Title: On the Stability of Nonlinear Receding Horizon Control: A Geometric Perspective. (arXiv:2103.15010v3 [math.OC] UPDATED)\nAbstract: %!TEX root = LCSS_main_max.tex  The widespread adoption of nonlinear Receding Horizon Control (RHC) strategies by industry has led to more than 30 years of intense research efforts to provide stability guarantees for these methods. However, current theoretical guarantees require that each (generally nonconvex) planning problem can be solved to (approximate) global optimality, which is an unrealistic requirement for the derivative-based local optimization methods generally used in practical implementations of RHC. This paper takes the first step towards understanding stability guarantees for nonlinear RHC when the inner planning problem is solved to first-order stationary points, but not necessarily global optima. Special attention is given to feedback linearizable systems, and a mixture of positive and negative results are provided. We establish that, under certain strong conditions, first-order solutions to RHC exponentially stabilize linearizable systems. Surprisingly, these conditio",
    "path": "papers/21/03/2103.15010.json",
    "total_tokens": 846,
    "translated_title": "关于非线性滑动视角控制稳定性的几何视角研究",
    "translated_abstract": "非线性滑动视角控制（RHC）策略的广泛应用已经促使人们在这些方法的稳定性保证方面进行了30多年的研究。然而，目前的理论保证要求每个（通常非凸）规划问题都可以被求解为（近似）全局最优解，这对于实际实施RHC的基于导数的局部优化方法来说是不现实的要求。本文在内部规划问题被解决为一阶稳定点而不一定是全局最优解时，首次探索了非线性RHC的稳定性保证。特别关注反馈线性化系统，并提供了正面和负面结果的混合。我们证明，在某些强条件下，RHC的一阶解可以指数级地稳定可线性化系统。令人惊讶的是，这些条件...",
    "tldr": "本文研究了非线性滑动视角控制的稳定性，特别关注反馈线性化系统，并证明了在一定条件下，RHC的一阶解可以使可线性化系统指数级稳定。"
}