{
    "title": "Selling Data to an Agent with Endogenous Information. (arXiv:2103.05788v4 [econ.TH] UPDATED)",
    "abstract": "We consider a model of a data broker selling information to a single agent to maximize his revenue. The agent has a private valuation of the additional information, and upon receiving the signal from the data broker, the agent can conduct her own experiment to refine her posterior belief on the states with additional costs. To maximize expected revenue, only offering full information in general is suboptimal, and the optimal mechanism may contain a continuum of menu options with partial information to prevent the agent from having incentives to acquire additional information from other sources. However, our main result shows that the additional benefit from price discrimination is limited, i.e., posting a deterministic price for revealing full information obtains at least half of the optimal revenue for arbitrary prior and cost functions.",
    "link": "http://arxiv.org/abs/2103.05788",
    "context": "Title: Selling Data to an Agent with Endogenous Information. (arXiv:2103.05788v4 [econ.TH] UPDATED)\nAbstract: We consider a model of a data broker selling information to a single agent to maximize his revenue. The agent has a private valuation of the additional information, and upon receiving the signal from the data broker, the agent can conduct her own experiment to refine her posterior belief on the states with additional costs. To maximize expected revenue, only offering full information in general is suboptimal, and the optimal mechanism may contain a continuum of menu options with partial information to prevent the agent from having incentives to acquire additional information from other sources. However, our main result shows that the additional benefit from price discrimination is limited, i.e., posting a deterministic price for revealing full information obtains at least half of the optimal revenue for arbitrary prior and cost functions.",
    "path": "papers/21/03/2103.05788.json",
    "total_tokens": 729,
    "translated_title": "向内生信息的代理商出售数据",
    "translated_abstract": "我们考虑了一个数据经纪人向单个代理商出售信息以最大化他的收益的模型。代理商对附加信息有私人估值，在从数据经纪人处收到信号后，代理商可以进行自己的实验以改进她对附加成本状态的后验信念。为了最大化预期收入，通常情况下仅提供完整信息是次优的，最优机制可能包含一系列具有部分信息的菜单选项，以防止代理商有动机从其他来源获取附加信息。然而，我们的主要结果表明，价格歧视的附加收益是有限的，即公开确定的完整信息价格至少可以获得任意先验和成本函数下最优收入的一半。",
    "tldr": "该论文研究了一个数据经纪人向代理商出售信息的模型，发现提供完整信息的价格至少可以获得最优收入的一半。",
    "en_tdlr": "This paper examines a model where a data broker sells information to an agent, and finds that offering a price for full information can generate at least half of the optimal revenue."
}