{
    "title": "Approximating Probability Distributions by using Wasserstein Generative Adversarial Networks. (arXiv:2103.10060v4 [cs.LG] UPDATED)",
    "abstract": "Studied here are Wasserstein generative adversarial networks (WGANs) with GroupSort neural networks as their discriminators. It is shown that the error bound of the approximation for the target distribution depends on the width and depth (capacity) of the generators and discriminators and the number of samples in training. A quantified generalization bound is established for the Wasserstein distance between the generated and target distributions. According to the theoretical results, WGANs have a higher requirement for the capacity of discriminators than that of generators, which is consistent with some existing results. More importantly, the results with overly deep and wide (high-capacity) generators may be worse than those with low-capacity generators if discriminators are insufficiently strong. Numerical results obtained using Swiss roll and MNIST datasets confirm the theoretical results.",
    "link": "http://arxiv.org/abs/2103.10060",
    "context": "Title: Approximating Probability Distributions by using Wasserstein Generative Adversarial Networks. (arXiv:2103.10060v4 [cs.LG] UPDATED)\nAbstract: Studied here are Wasserstein generative adversarial networks (WGANs) with GroupSort neural networks as their discriminators. It is shown that the error bound of the approximation for the target distribution depends on the width and depth (capacity) of the generators and discriminators and the number of samples in training. A quantified generalization bound is established for the Wasserstein distance between the generated and target distributions. According to the theoretical results, WGANs have a higher requirement for the capacity of discriminators than that of generators, which is consistent with some existing results. More importantly, the results with overly deep and wide (high-capacity) generators may be worse than those with low-capacity generators if discriminators are insufficiently strong. Numerical results obtained using Swiss roll and MNIST datasets confirm the theoretical results.",
    "path": "papers/21/03/2103.10060.json",
    "total_tokens": 944,
    "translated_title": "使用Wasserstein生成对抗网络近似概率分布",
    "translated_abstract": "本文研究了将GroupSort神经网络作为鉴别器的Wasserstein生成对抗网络（WGANs）。研究结果表明，目标分布的逼近误差界限取决于生成器和鉴别器的宽度和深度（容量）以及训练中的样本数量。针对生成的分布和目标分布之间的Wasserstein距离建立了量化的泛化界限。根据理论结果，WGANs对鉴别器的容量要求比生成器更高，这与一些已有结果一致。更重要的是，如果鉴别器不足够强大，与过度深层和宽度（高容量）的生成器相比，低容量的生成器的结果可能更差。使用Swiss roll和MNIST数据集得到的数值结果证实了理论结果。",
    "tldr": "本文研究了Wasserstein生成对抗网络（WGANs），并使用GroupSort神经网络作为鉴别器。研究结果显示，生成器和鉴别器的容量对目标分布的逼近误差有影响，并且WGANs对鉴别器的容量要求高于生成器。此外，在鉴别器不足够强大时，低容量的生成器可能比过度深层和宽度的生成器效果更好。数值结果证实了理论结果。",
    "en_tdlr": "This paper investigates Wasserstein generative adversarial networks (WGANs) using GroupSort neural networks as discriminators. The study reveals that the approximation error of the target distribution depends on the capacity of the generators and discriminators as well as the training sample size. WGANs require a higher capacity for discriminators compared to generators. Additionally, when the discriminators are not sufficiently strong, low-capacity generators may outperform overly deep and wide generators. Numerical results confirm the theoretical findings."
}