{
    "title": "A Natural Adaptive Process for Collective Decision-Making. (arXiv:2103.14351v4 [econ.TH] UPDATED)",
    "abstract": "Consider an urn filled with balls, each labeled with one of several possible collective decisions. Now, let a random voter draw two balls from the urn and pick her more preferred as the collective decision. Relabel the losing ball with the collective decision, put both balls back into the urn, and repeat. Once in a while, relabel a randomly drawn ball with a random collective decision. We prove that the empirical distribution of collective decisions produced by this process approximates a maximal lottery, a celebrated probabilistic voting rule proposed by Peter C. Fishburn (Rev. Econ. Stud., 51(4), 1984). In fact, the probability that the collective decision in round $n$ is made according to a maximal lottery increases exponentially in $n$. The proposed procedure is more flexible than traditional voting rules and bears strong similarities to natural processes studied in biology, physics, and chemistry as well as algorithms proposed in machine learning.",
    "link": "http://arxiv.org/abs/2103.14351",
    "context": "Title: A Natural Adaptive Process for Collective Decision-Making. (arXiv:2103.14351v4 [econ.TH] UPDATED)\nAbstract: Consider an urn filled with balls, each labeled with one of several possible collective decisions. Now, let a random voter draw two balls from the urn and pick her more preferred as the collective decision. Relabel the losing ball with the collective decision, put both balls back into the urn, and repeat. Once in a while, relabel a randomly drawn ball with a random collective decision. We prove that the empirical distribution of collective decisions produced by this process approximates a maximal lottery, a celebrated probabilistic voting rule proposed by Peter C. Fishburn (Rev. Econ. Stud., 51(4), 1984). In fact, the probability that the collective decision in round $n$ is made according to a maximal lottery increases exponentially in $n$. The proposed procedure is more flexible than traditional voting rules and bears strong similarities to natural processes studied in biology, physics, and chemistry as well as algorithms proposed in machine learning.",
    "path": "papers/21/03/2103.14351.json",
    "total_tokens": 924,
    "translated_title": "一种自然适应性的集体决策过程",
    "translated_abstract": "考虑一个装满小球的瓮，每个小球上标有若干可能的集体决策。现在，让一位随机选民从罐子里抽出两个小球，并选择她更喜欢的作为集体决策。将输掉的小球重新标记为集体决策，在将两个小球放回罐子中并重复。偶尔，将随机抽出的小球重新标记为随机集体决策。我们证明了此过程产生的集体决策的经验分布近似于极大抽签，这是Peter C. Fishburn (Rev. Econ. Stud.，51（4），1984)提出的一种著名的概率性投票规则。事实上，在第$n$轮中采用极大抽签作为集体决策的概率呈指数增长。该过程比传统的投票规则更灵活，并具有类似于生物学、物理学和化学研究中的自然过程以及机器学习中提出的算法的强大相似性。",
    "tldr": "提出了一种灵活的集体决策过程，类似于自然过程和机器学习中的算法，其产生的集体决策经验分布近似于极大抽签，且在时间推移中使用极大抽签作为集体决策的概率呈指数增长。",
    "en_tdlr": "A flexible collective decision-making process similar to natural processes and algorithms in machine learning is proposed, whose empirical distribution of collective decisions approximates a maximal lottery and the probability of using a maximal lottery as the collective decision increases exponentially over time."
}