{
    "title": "SCEI: A Smart-Contract Driven Edge Intelligence Framework for IoT Systems. (arXiv:2103.07050v2 [cs.LG] UPDATED)",
    "abstract": "Federated learning (FL) enables collaborative training of a shared model on edge devices while maintaining data privacy. FL is effective when dealing with independent and identically distributed (iid) datasets, but struggles with non-iid datasets. Various personalized approaches have been proposed, but such approaches fail to handle underlying shifts in data distribution, such as data distribution skew commonly observed in real-world scenarios (e.g., driver behavior in smart transportation systems changing across time and location). Additionally, trust concerns among unacquainted devices and security concerns with the centralized aggregator pose additional challenges. To address these challenges, this paper presents a dynamically optimized personal deep learning scheme based on blockchain and federated learning. Specifically, the innovative smart contract implemented in the blockchain allows distributed edge devices to reach a consensus on the optimal weights of personalized models. Ex",
    "link": "http://arxiv.org/abs/2103.07050",
    "context": "Title: SCEI: A Smart-Contract Driven Edge Intelligence Framework for IoT Systems. (arXiv:2103.07050v2 [cs.LG] UPDATED)\nAbstract: Federated learning (FL) enables collaborative training of a shared model on edge devices while maintaining data privacy. FL is effective when dealing with independent and identically distributed (iid) datasets, but struggles with non-iid datasets. Various personalized approaches have been proposed, but such approaches fail to handle underlying shifts in data distribution, such as data distribution skew commonly observed in real-world scenarios (e.g., driver behavior in smart transportation systems changing across time and location). Additionally, trust concerns among unacquainted devices and security concerns with the centralized aggregator pose additional challenges. To address these challenges, this paper presents a dynamically optimized personal deep learning scheme based on blockchain and federated learning. Specifically, the innovative smart contract implemented in the blockchain allows distributed edge devices to reach a consensus on the optimal weights of personalized models. Ex",
    "path": "papers/21/03/2103.07050.json",
    "total_tokens": 911,
    "translated_title": "SCEI: 一种用于物联网系统的智能合约驱动的边缘智能框架",
    "translated_abstract": "联邦学习（FL）通过在边缘设备上进行协作训练共享模型，同时保持数据隐私。FL在处理独立同分布（iid）数据集时非常有效，但在处理非iid数据集时很困难。已经提出了各种个性化方法，但这些方法无法处理数据分布偏斜等数据分布变化，在现实场景中经常出现（例如，智能交通系统中的驾驶行为随时间和位置的变化）。此外，陌生设备之间的信任问题和集中式聚合器的安全问题也带来了额外的挑战。为了解决这些挑战，本文提出了一种基于区块链和联邦学习的动态优化个性化深度学习方案。具体来说，区块链中实现的创新智能合约使分布式边缘设备能够就个性化模型的最佳权重达成一致。",
    "tldr": "本文提出了一种基于区块链和联邦学习的智能合约驱动的边缘智能框架，用于解决联邦学习在处理非iid数据集和信任问题上的挑战。创新的智能合约允许边缘设备达成一致，确定个性化模型的最佳权重。",
    "en_tdlr": "This paper presents a smart-contract driven edge intelligence framework based on blockchain and federated learning to address the challenges of handling non-iid datasets and trust concerns in federated learning. The innovative smart contract allows edge devices to reach a consensus on the optimal weights of personalized models."
}