{
    "title": "What Do We Get from Two-Way Fixed Effects Regressions? Implications from Numerical Equivalence. (arXiv:2103.12374v5 [econ.EM] UPDATED)",
    "abstract": "In any multiperiod panel, a two-way fixed effects (TWFE) regression is numerically equivalent to a first-difference (FD) regression that pools all possible between-period gaps. Building on this observation, this paper develops numerical and causal interpretations of the TWFE coefficient. At the sample level, the TWFE coefficient is a weighted average of FD coefficients with different between-period gaps. This decomposition is useful for assessing the source of identifying variation for the TWFE coefficient. At the population level, a causal interpretation of the TWFE coefficient requires a common trends assumption for any between-period gap, and the assumption has to be conditional on changes in time-varying covariates. I propose a natural generalization of the TWFE estimator that can relax these requirements.",
    "link": "http://arxiv.org/abs/2103.12374",
    "context": "Title: What Do We Get from Two-Way Fixed Effects Regressions? Implications from Numerical Equivalence. (arXiv:2103.12374v5 [econ.EM] UPDATED)\nAbstract: In any multiperiod panel, a two-way fixed effects (TWFE) regression is numerically equivalent to a first-difference (FD) regression that pools all possible between-period gaps. Building on this observation, this paper develops numerical and causal interpretations of the TWFE coefficient. At the sample level, the TWFE coefficient is a weighted average of FD coefficients with different between-period gaps. This decomposition is useful for assessing the source of identifying variation for the TWFE coefficient. At the population level, a causal interpretation of the TWFE coefficient requires a common trends assumption for any between-period gap, and the assumption has to be conditional on changes in time-varying covariates. I propose a natural generalization of the TWFE estimator that can relax these requirements.",
    "path": "papers/21/03/2103.12374.json",
    "total_tokens": 917,
    "translated_title": "两路固定效应回归有何收获？数值等价性的启示。",
    "translated_abstract": "在任何多期面板数据中，两路固定效应（TWFE）回归在数值上等价于汇集所有可能的区间间隔进行的一阶差分（FD）回归。基于这一观察，本文开展了对TWFE系数的数值和因果解释。在样本水平上，TWFE系数是具有不同区间间隔的FD系数的加权平均。这种分解有助于评估TWFE系数的识别变动的源头。在总体水平上，对TWFE系数的因果解释需要对任何区间间隔进行共同趋势假设，并且该假设必须基于时间变化协变量的变动条件。我提出了一种可以放松这些要求的TWFE估计的自然推广方法。",
    "tldr": "本文通过数值等价性观察，对两路固定效应回归的系数进行了数值和因果解释。在样本水平上，该系数是具有不同区间间隔的一阶差分系数的加权平均，有助于评估识别变动的来源。在总体水平上，因果解释需要共同趋势假设，并且条件于时间变化协变量的变动。提出了可以放松这些要求的TWFE估计的自然推广方法。",
    "en_tdlr": "This paper provides numerical and causal interpretations of the coefficients in a two-way fixed effects regression, showing that at the sample level, the coefficient is a weighted average of first-difference coefficients with different between-period gaps, and at the population level, a causal interpretation requires a common trends assumption and conditioning on changes in time-varying covariates. A natural generalization of the TWFE estimator is proposed to relax these requirements."
}