{
    "title": "Correct-by-construction reach-avoid control of partially observable linear stochastic systems. (arXiv:2103.02398v4 [cs.AI] UPDATED)",
    "abstract": "We study feedback controller synthesis for reach-avoid control of discrete-time, linear time-invariant (LTI) systems with Gaussian process and measurement noise. The problem is to compute a controller such that, with at least some required probability, the system reaches a desired goal state in finite time while avoiding unsafe states. Due to stochasticity and nonconvexity, this problem does not admit exact algorithmic or closed-form solutions in general. Our key contribution is a correct-by-construction controller synthesis scheme based on a finite-state abstraction of a Gaussian belief over the unmeasured state, obtained using a Kalman filter. We formalize this abstraction as a Markov decision process (MDP). To be robust against numerical imprecision in approximating transition probabilities, we use MDPs with intervals of transition probabilities. By construction, any policy on the abstraction can be refined into a piecewise linear feedback controller for the LTI system. We prove tha",
    "link": "http://arxiv.org/abs/2103.02398",
    "context": "Title: Correct-by-construction reach-avoid control of partially observable linear stochastic systems. (arXiv:2103.02398v4 [cs.AI] UPDATED)\nAbstract: We study feedback controller synthesis for reach-avoid control of discrete-time, linear time-invariant (LTI) systems with Gaussian process and measurement noise. The problem is to compute a controller such that, with at least some required probability, the system reaches a desired goal state in finite time while avoiding unsafe states. Due to stochasticity and nonconvexity, this problem does not admit exact algorithmic or closed-form solutions in general. Our key contribution is a correct-by-construction controller synthesis scheme based on a finite-state abstraction of a Gaussian belief over the unmeasured state, obtained using a Kalman filter. We formalize this abstraction as a Markov decision process (MDP). To be robust against numerical imprecision in approximating transition probabilities, we use MDPs with intervals of transition probabilities. By construction, any policy on the abstraction can be refined into a piecewise linear feedback controller for the LTI system. We prove tha",
    "path": "papers/21/03/2103.02398.json",
    "total_tokens": 972,
    "translated_title": "基于构造的可观测线性随机系统的避让控制",
    "translated_abstract": "我们研究了具有高斯过程和测量噪声的离散时间、线性时不变系统的可观测控制器合成问题。问题是计算一个控制器，使得系统在有限时间内以至少一定的概率达到期望的目标状态，同时避免不安全状态。由于随机性和非凸性，该问题通常不具备精确的算法或闭式解。我们的主要贡献是基于使用卡尔曼滤波器获得的对未测量状态的高斯置信度的有限状态抽象，提出了一个基于构造的控制器合成方案。我们将这种抽象形式化为马尔可夫决策过程（MDP）。为了对近似转移概率的数值不精确性具有鲁棒性，我们使用具有转移概率区间的MDP。通过构造，抽象上的任何策略都可以细化为LTI系统的分段线性反馈控制器。我们证明了",
    "tldr": "本文提出了一种基于构造的方法来合成可观测线性随机系统的避让控制器，通过使用卡尔曼滤波器得到未测量状态的高斯置信度的有限状态抽象，并将其形式化为马尔可夫决策过程（MDP）。这种控制器可以以一种鲁棒的方式避免不安全状态。",
    "en_tdlr": "This paper proposes a correct-by-construction approach to synthesize a reach-avoid controller for partially observable linear stochastic systems, leveraging a finite-state abstraction of Gaussian belief over the unmeasured state obtained using a Kalman filter, formalized as a Markov decision process (MDP). This controller enables robust avoidance of unsafe states."
}