{
    "title": "Simultaneous Reconstruction and Uncertainty Quantification for Tomography. (arXiv:2103.15864v2 [stat.AP] UPDATED)",
    "abstract": "Tomographic reconstruction, despite its revolutionary impact on a wide range of applications, suffers from its ill-posed nature in that there is no unique solution because of limited and noisy measurements. Therefore, in the absence of ground truth, quantifying the solution quality is highly desirable but under-explored. In this work, we address this challenge through Gaussian process modeling to flexibly and explicitly incorporate prior knowledge of sample features and experimental noises through the choices of the kernels and noise models. Our proposed method yields not only comparable reconstruction to existing practical reconstruction methods (e.g., regularized iterative solver for inverse problem) but also an efficient way of quantifying solution uncertainties. We demonstrate the capabilities of the proposed approach on various images and show its unique capability of uncertainty quantification in the presence of various noises.",
    "link": "http://arxiv.org/abs/2103.15864",
    "context": "Title: Simultaneous Reconstruction and Uncertainty Quantification for Tomography. (arXiv:2103.15864v2 [stat.AP] UPDATED)\nAbstract: Tomographic reconstruction, despite its revolutionary impact on a wide range of applications, suffers from its ill-posed nature in that there is no unique solution because of limited and noisy measurements. Therefore, in the absence of ground truth, quantifying the solution quality is highly desirable but under-explored. In this work, we address this challenge through Gaussian process modeling to flexibly and explicitly incorporate prior knowledge of sample features and experimental noises through the choices of the kernels and noise models. Our proposed method yields not only comparable reconstruction to existing practical reconstruction methods (e.g., regularized iterative solver for inverse problem) but also an efficient way of quantifying solution uncertainties. We demonstrate the capabilities of the proposed approach on various images and show its unique capability of uncertainty quantification in the presence of various noises.",
    "path": "papers/21/03/2103.15864.json",
    "total_tokens": 879,
    "translated_title": "同时重建和不确定性量化的层析成像",
    "translated_abstract": "层析成像在各种应用中具有革命性的影响，但由于有限和噪声测量导致没有唯一解，因此其重建具有病态性质。因此，在没有基准真实值的情况下，量化解的质量非常有必要但又未充分探索。本文通过高斯过程建模解决了这一挑战，通过选择卷积核和噪声类型灵活且明确地将样品特征和实验噪声的先验知识纳入模型中。我们提出的方法不仅可以得到与现有实用重建方法（例如，反问题的规则迭代求解器）相媲美的重建结果，而且可以有效地量化解的不确定性。我们展示了所提出方法在各种图像中的能力，并展示了其在存在各种噪声情况下进行不确定性量化的独特能力。",
    "tldr": "本文提出了一个通过高斯过程建模灵活且明确地将样品特征和实验噪声的先验知识纳入重建和量化不确定性的方法。这个方法在各种图像中展示了与现有实用重建方法相媲美的重建结果，并具备不确定性量化的独特能力。"
}