{
    "title": "SoK: Decentralized Exchanges (DEX) with Automated Market Maker (AMM) Protocols. (arXiv:2103.12732v7 [q-fin.TR] UPDATED)",
    "abstract": "As an integral part of the decentralized finance (DeFi) ecosystem, decentralized exchanges (DEXs) with automated market maker (AMM) protocols have gained massive traction with the recently revived interest in blockchain and distributed ledger technology (DLT) in general. Instead of matching the buy and sell sides, automated market makers (AMMs) employ a peer-to-pool method and determine asset price algorithmically through a so-called conservation function. To facilitate the improvement and development of automated market maker (AMM)-based decentralized exchanges (DEXs), we create the first systematization of knowledge in this area. We first establish a general automated market maker (AMM) framework describing the economics and formalizing the system's state-space representation. We then employ our framework to systematically compare the top automated market maker (AMM) protocols' mechanics, illustrating their conservation functions, as well as slippage and divergence loss functions. We",
    "link": "http://arxiv.org/abs/2103.12732",
    "context": "Title: SoK: Decentralized Exchanges (DEX) with Automated Market Maker (AMM) Protocols. (arXiv:2103.12732v7 [q-fin.TR] UPDATED)\nAbstract: As an integral part of the decentralized finance (DeFi) ecosystem, decentralized exchanges (DEXs) with automated market maker (AMM) protocols have gained massive traction with the recently revived interest in blockchain and distributed ledger technology (DLT) in general. Instead of matching the buy and sell sides, automated market makers (AMMs) employ a peer-to-pool method and determine asset price algorithmically through a so-called conservation function. To facilitate the improvement and development of automated market maker (AMM)-based decentralized exchanges (DEXs), we create the first systematization of knowledge in this area. We first establish a general automated market maker (AMM) framework describing the economics and formalizing the system's state-space representation. We then employ our framework to systematically compare the top automated market maker (AMM) protocols' mechanics, illustrating their conservation functions, as well as slippage and divergence loss functions. We",
    "path": "papers/21/03/2103.12732.json",
    "total_tokens": 906,
    "translated_title": "SoK：具有自动化做市商（AMM）协议的去中心化交易所（DEX）",
    "translated_abstract": "作为去中心化金融（DeFi）生态系统的重要组成部分，具有自动化做市商（AMM）协议的去中心化交易所（DEX）已经在近期复苏的区块链和分布式账本技术（DLT）中获得了巨大的关注。自动做市商（AMM）不是将买方和卖方匹配，而是采用点对池方法，通过所谓的保值函数算法来确定资产价格。为了促进基于自动化做市商（AMM）的去中心化交易所（DEX）的改进和发展，我们在这个领域创建了第一个知识系统化。我们首先建立了一般化的自动化做市商（AMM）框架，描述经济学并规范系统的状态空间表示。然后，我们应用我们的框架系统地比较顶级的自动化做市商（AMM）协议机制，说明它们的保值函数以及滑点和离散损失函数。",
    "tldr": "本文系统评估了具有自动化做市商（AMM）协议的去中心化交易所（DEX），比较了顶级的AMM协议机制，描述了它们的保值函数以及滑点和离散损失函数。",
    "en_tdlr": "This paper systematically evaluates decentralized exchanges (DEXs) with automated market maker (AMM) protocols, comparing the top AMM protocol mechanisms and illustrating their conservation functions, slippage, and divergence loss functions."
}