{
    "title": "Dual Online Stein Variational Inference for Control and Dynamics. (arXiv:2103.12890v1 [cs.RO] CROSS LISTED)",
    "abstract": "Model predictive control (MPC) schemes have a proven track record for delivering aggressive and robust performance in many challenging control tasks, coping with nonlinear system dynamics, constraints, and observational noise. Despite their success, these methods often rely on simple control distributions, which can limit their performance in highly uncertain and complex environments. MPC frameworks must be able to accommodate changing distributions over system parameters, based on the most recent measurements. In this paper, we devise an implicit variational inference algorithm able to estimate distributions over model parameters and control inputs on-the-fly. The method incorporates Stein Variational gradient descent to approximate the target distributions as a collection of particles, and performs updates based on a Bayesian formulation. This enables the approximation of complex multi-modal posterior distributions, typically occurring in challenging and realistic robot navigation ta",
    "link": "http://arxiv.org/abs/2103.12890",
    "context": "Title: Dual Online Stein Variational Inference for Control and Dynamics. (arXiv:2103.12890v1 [cs.RO] CROSS LISTED)\nAbstract: Model predictive control (MPC) schemes have a proven track record for delivering aggressive and robust performance in many challenging control tasks, coping with nonlinear system dynamics, constraints, and observational noise. Despite their success, these methods often rely on simple control distributions, which can limit their performance in highly uncertain and complex environments. MPC frameworks must be able to accommodate changing distributions over system parameters, based on the most recent measurements. In this paper, we devise an implicit variational inference algorithm able to estimate distributions over model parameters and control inputs on-the-fly. The method incorporates Stein Variational gradient descent to approximate the target distributions as a collection of particles, and performs updates based on a Bayesian formulation. This enables the approximation of complex multi-modal posterior distributions, typically occurring in challenging and realistic robot navigation ta",
    "path": "papers/21/03/2103.12890.json",
    "total_tokens": 776,
    "translated_title": "控制与动力学问题的双在线斯坦变分推理",
    "translated_abstract": "模型预测控制（MPC）方案在许多具有挑战性的控制任务中表现出积极而稳健的性能，能够应对非线性系统动力学、约束和观测噪声。尽管这些方法取得了成功，但它们通常依赖于简单的控制分布，这可能限制了它们在高度不确定和复杂的环境中的性能。MPC框架必须能够根据最新的测量结果适应系统参数的变化分布。在本文中，我们设计了一种隐式变分推理算法，能够实时估计模型参数和控制输入的分布。该方法利用斯坦变分梯度下降来逼近目标分布，通过贝叶斯形式进行更新。这使得可以近似复杂的多模态后验分布，通常出现在具有挑战性和现实的机器人导航任务中。",
    "tldr": "本文提出了一种双在线斯坦变分推理算法，能够实时估计模型参数和控制输入的分布，在复杂环境中适应不确定性。"
}