{
    "title": "Benchmarking Robustness of Deep Learning Classifiers Using Two-Factor Perturbation. (arXiv:2103.03102v5 [cs.LG] UPDATED)",
    "abstract": "This paper adds to the fundamental body of work on benchmarking the robustness of deep learning (DL) classifiers. We innovate a new benchmarking methodology to evaluate robustness of DL classifiers. Also, we introduce a new four-quadrant statistical visualization tool, including minimum accuracy, maximum accuracy, mean accuracy, and coefficient of variation, for benchmarking robustness of DL classifiers. To measure robust DL classifiers, we created a comprehensive 69 benchmarking image set, including a clean set, sets with single factor perturbations, and sets with two-factor perturbation conditions. After collecting experimental results, we first report that using two-factor perturbed images improves both robustness and accuracy of DL classifiers. The two-factor perturbation includes (1) two digital perturbations (salt & pepper noise and Gaussian noise) applied in both sequences, and (2) one digital perturbation (salt & pepper noise) and a geometric perturbation (rotation) applied in ",
    "link": "http://arxiv.org/abs/2103.03102",
    "context": "Title: Benchmarking Robustness of Deep Learning Classifiers Using Two-Factor Perturbation. (arXiv:2103.03102v5 [cs.LG] UPDATED)\nAbstract: This paper adds to the fundamental body of work on benchmarking the robustness of deep learning (DL) classifiers. We innovate a new benchmarking methodology to evaluate robustness of DL classifiers. Also, we introduce a new four-quadrant statistical visualization tool, including minimum accuracy, maximum accuracy, mean accuracy, and coefficient of variation, for benchmarking robustness of DL classifiers. To measure robust DL classifiers, we created a comprehensive 69 benchmarking image set, including a clean set, sets with single factor perturbations, and sets with two-factor perturbation conditions. After collecting experimental results, we first report that using two-factor perturbed images improves both robustness and accuracy of DL classifiers. The two-factor perturbation includes (1) two digital perturbations (salt & pepper noise and Gaussian noise) applied in both sequences, and (2) one digital perturbation (salt & pepper noise) and a geometric perturbation (rotation) applied in ",
    "path": "papers/21/03/2103.03102.json",
    "total_tokens": 1188,
    "translated_title": "使用双因素扰动评估深度学习分类器的鲁棒性",
    "translated_abstract": "本文旨在对深度学习（DL）分类器的鲁棒性进行基准测试。我们创新地提出了一种新的基准测试方法来评估DL分类器的鲁棒性，并引入了一种新的四象限统计可视化工具，包括最小准确性、最大准确性、平均准确性和变异系数，用于评估DL分类器的鲁棒性。我们创建了一个全面的69个基准测试图像集，包括一个干净的集合、单因素扰动的集合和双因素扰动条件的集合，以衡量鲁棒的DL分类器。通过收集实验结果，我们首先报告使用双因素扰动图像可以提高DL分类器的鲁棒性和准确性。双因素扰动包括（1）在两个序列中都应用的两个数字扰动（椒盐噪声和高斯噪声），以及（2）一个数字扰动（椒盐噪声）和一个几何扰动（旋转）。除此之外，通过我们的基准测试工具，我们发现不同的DL模型对两因素扰动有不同的鲁棒性行为，暴露了分类器行为的不均匀性和基准测试的必要性。使用我们的基准测试方法和工具，我们比较了不同的两因素扰动条件下DL分类器的鲁棒性，并为开发更鲁棒的DL分类器提供了见解。",
    "tldr": "本文提出了一种新的基准测试方法和工具，通过双因素扰动来评估深度学习分类器的鲁棒性。使用该方法和工具，作者比较了不同的两因素扰动条件下DL分类器的鲁棒性，并为开发更鲁棒的DL分类器提供了见解。",
    "en_tdlr": "This paper proposes a new benchmarking methodology and tool for evaluating the robustness of deep learning classifiers using two-factor perturbation. The authors report that using two-factor perturbed images improves the robustness and accuracy of DL classifiers, and different DL models have varying behaviors towards two-factor perturbations. The authors provide insights on developing more robust DL classifiers through comparative analysis under various two-factor perturbation conditions."
}