{
    "title": "Missing Value Imputation on Multidimensional Time Series. (arXiv:2103.01600v3 [cs.LG] UPDATED)",
    "abstract": "We present DeepMVI, a deep learning method for missing value imputation in multidimensional time-series datasets. Missing values are commonplace in decision support platforms that aggregate data over long time stretches from disparate sources, and reliable data analytics calls for careful handling of missing data. One strategy is imputing the missing values, and a wide variety of algorithms exist spanning simple interpolation, matrix factorization methods like SVD, statistical models like Kalman filters, and recent deep learning methods. We show that often these provide worse results on aggregate analytics compared to just excluding the missing data. DeepMVI uses a neural network to combine fine-grained and coarse-grained patterns along a time series, and trends from related series across categorical dimensions. After failing with off-the-shelf neural architectures, we design our own network that includes a temporal transformer with a novel convolutional window feature, and kernel regr",
    "link": "http://arxiv.org/abs/2103.01600",
    "context": "Title: Missing Value Imputation on Multidimensional Time Series. (arXiv:2103.01600v3 [cs.LG] UPDATED)\nAbstract: We present DeepMVI, a deep learning method for missing value imputation in multidimensional time-series datasets. Missing values are commonplace in decision support platforms that aggregate data over long time stretches from disparate sources, and reliable data analytics calls for careful handling of missing data. One strategy is imputing the missing values, and a wide variety of algorithms exist spanning simple interpolation, matrix factorization methods like SVD, statistical models like Kalman filters, and recent deep learning methods. We show that often these provide worse results on aggregate analytics compared to just excluding the missing data. DeepMVI uses a neural network to combine fine-grained and coarse-grained patterns along a time series, and trends from related series across categorical dimensions. After failing with off-the-shelf neural architectures, we design our own network that includes a temporal transformer with a novel convolutional window feature, and kernel regr",
    "path": "papers/21/03/2103.01600.json",
    "total_tokens": 870,
    "translated_title": "多维时间序列的缺失值填充方法DeepMVI研究",
    "translated_abstract": "本文提出了DeepMVI，一种用于填充多维时间序列数据中缺失值的深度学习方法。由于来自不同来源的长时间数据聚合会产生大量缺失数据，因此对于可靠的数据分析，需要仔细处理缺失数据。我们的方法使用神经网络来结合时间序列中的精细和粗粒度模式，以及跨分类维度的相关系列趋势。在经过多次不成功的尝试之后，我们设计了自己的网络，其中包括具有新型卷积窗口特征和核回归的时间变形器。在各种真实数据集上的填充设置中，我们展示了比几种最先进的算法更好的结果。",
    "tldr": "本文提出了DeepMVI，一种用于填充多维时间序列数据中缺失值的深度学习方法。该方法结合时间序列中的精细和粗粒度模式，以及跨分类维度的相关系列趋势。经过改进，DeepMVI表现出比其他算法更优秀的结果。"
}