{
    "title": "Rethinking Dimensional Rationale in Graph Contrastive Learning from Causal Perspective. (arXiv:2312.10401v2 [cs.LG] UPDATED)",
    "abstract": "Graph contrastive learning is a general learning paradigm excelling at capturing invariant information from diverse perturbations in graphs. Recent works focus on exploring the structural rationale from graphs, thereby increasing the discriminability of the invariant information. However, such methods may incur in the mis-learning of graph models towards the interpretability of graphs, and thus the learned noisy and task-agnostic information interferes with the prediction of graphs. To this end, with the purpose of exploring the intrinsic rationale of graphs, we accordingly propose to capture the dimensional rationale from graphs, which has not received sufficient attention in the literature. The conducted exploratory experiments attest to the feasibility of the aforementioned roadmap. To elucidate the innate mechanism behind the performance improvement arising from the dimensional rationale, we rethink the dimensional rationale in graph contrastive learning from a causal perspective a",
    "link": "http://arxiv.org/abs/2312.10401",
    "context": "Title: Rethinking Dimensional Rationale in Graph Contrastive Learning from Causal Perspective. (arXiv:2312.10401v2 [cs.LG] UPDATED)\nAbstract: Graph contrastive learning is a general learning paradigm excelling at capturing invariant information from diverse perturbations in graphs. Recent works focus on exploring the structural rationale from graphs, thereby increasing the discriminability of the invariant information. However, such methods may incur in the mis-learning of graph models towards the interpretability of graphs, and thus the learned noisy and task-agnostic information interferes with the prediction of graphs. To this end, with the purpose of exploring the intrinsic rationale of graphs, we accordingly propose to capture the dimensional rationale from graphs, which has not received sufficient attention in the literature. The conducted exploratory experiments attest to the feasibility of the aforementioned roadmap. To elucidate the innate mechanism behind the performance improvement arising from the dimensional rationale, we rethink the dimensional rationale in graph contrastive learning from a causal perspective a",
    "path": "papers/23/12/2312.10401.json",
    "total_tokens": 804,
    "translated_title": "从因果角度重新思考图对比学习中的维度理论",
    "translated_abstract": "图对比学习是一种在图中捕捉不变信息的学习范式。最近的研究专注于探索图的结构理论，从而增加不变信息的可区分性。然而，这些方法可能导致图模型朝向解释图的可解释性进行错误学习，因此学习到的噪声和与任务无关的信息干扰了图的预测。为了探索图的内在理论，我们提出了从图中捕捉维度理论的方法，但这在文献中并没有得到足够的关注。通过实验验证了上述路径的可行性。为了阐明维度理论对性能改进的内在机制，我们从因果角度重新思考图对比学习中的维度理论。",
    "tldr": "本论文从因果角度重新思考图对比学习中的维度理论，并提出在图中捕捉维度理论的方法，以改善性能，并解决图模型学习中的问题。以上方法在实验中得到验证。",
    "en_tdlr": "This paper rethinks the dimensional rationale in graph contrastive learning from a causal perspective and proposes a method to capture the dimensional rationale in graphs to improve performance and address issues in graph model learning. The feasibility of the proposed method is validated through experiments."
}