{
    "title": "Sparse Mean Field Load Balancing in Large Localized Queueing Systems",
    "abstract": "arXiv:2312.12973v2 Announce Type: replace-cross  Abstract: Scalable load balancing algorithms are of great interest in cloud networks and data centers, necessitating the use of tractable techniques to compute optimal load balancing policies for good performance. However, most existing scalable techniques, especially asymptotically scaling methods based on mean field theory, have not been able to model large queueing networks with strong locality. Meanwhile, general multi-agent reinforcement learning techniques can be hard to scale and usually lack a theoretical foundation. In this work, we address this challenge by leveraging recent advances in sparse mean field theory to learn a near-optimal load balancing policy in sparsely connected queueing networks in a tractable manner, which may be preferable to global approaches in terms of wireless communication overhead. Importantly, we obtain a general load balancing framework for a large class of sparse bounded-degree wireless topologies. B",
    "link": "https://arxiv.org/abs/2312.12973",
    "context": "Title: Sparse Mean Field Load Balancing in Large Localized Queueing Systems\nAbstract: arXiv:2312.12973v2 Announce Type: replace-cross  Abstract: Scalable load balancing algorithms are of great interest in cloud networks and data centers, necessitating the use of tractable techniques to compute optimal load balancing policies for good performance. However, most existing scalable techniques, especially asymptotically scaling methods based on mean field theory, have not been able to model large queueing networks with strong locality. Meanwhile, general multi-agent reinforcement learning techniques can be hard to scale and usually lack a theoretical foundation. In this work, we address this challenge by leveraging recent advances in sparse mean field theory to learn a near-optimal load balancing policy in sparsely connected queueing networks in a tractable manner, which may be preferable to global approaches in terms of wireless communication overhead. Importantly, we obtain a general load balancing framework for a large class of sparse bounded-degree wireless topologies. B",
    "path": "papers/23/12/2312.12973.json",
    "total_tokens": 877,
    "translated_title": "大规模局部排队系统中的稀疏均场负载平衡",
    "translated_abstract": "可扩展的负载平衡算法在云网络和数据中心中具有很大的兴趣，需要使用可处理的技术来计算良好性能的最佳负载平衡策略。然而，大多数现有的可扩展技术，特别是基于均场理论的渐近缩放方法，尚无法建模具有强局部性的大型排队网络。与此同时，一般的多Agent强化学习技术很难扩展，并且通常缺乏理论基础。在这项工作中，我们通过利用稀疏均场理论的最新进展，以可处理的方式学习稀疏连接排队网络中的近似最优负载平衡策略，这相对于全局方法可能更可取，从无线通信开销的角度来看。重要的是，我们获得了一个大类稀疏有界度无线拓扑的通用负载平衡框架。",
    "tldr": "本研究利用稀疏均场理论的进展，提出了一种在大型局部排队网络中学习近似最优负载平衡策略的方法，为稀疏有界度无线拓扑提供了通用的负载平衡框架。"
}