{
    "title": "PsyChat: A Client-Centric Dialogue System for Mental Health Support",
    "abstract": "arXiv:2312.04262v2 Announce Type: replace  Abstract: Dialogue systems are increasingly integrated into mental health support to help clients facilitate exploration, gain insight, take action, and ultimately heal themselves. A practical and user-friendly dialogue system should be client-centric, focusing on the client's behaviors. However, existing dialogue systems publicly available for mental health support often concentrate solely on the counselor's strategies rather than the behaviors expressed by clients. This can lead to unreasonable or inappropriate counseling strategies and corresponding responses generated by the dialogue system. To address this issue, we propose PsyChat, a client-centric dialogue system that provides psychological support through online chat. The client-centric dialogue system comprises five modules: client behavior recognition, counselor strategy selection, input packer, response generator, and response selection. Both automatic and human evaluations demonstr",
    "link": "https://arxiv.org/abs/2312.04262",
    "context": "Title: PsyChat: A Client-Centric Dialogue System for Mental Health Support\nAbstract: arXiv:2312.04262v2 Announce Type: replace  Abstract: Dialogue systems are increasingly integrated into mental health support to help clients facilitate exploration, gain insight, take action, and ultimately heal themselves. A practical and user-friendly dialogue system should be client-centric, focusing on the client's behaviors. However, existing dialogue systems publicly available for mental health support often concentrate solely on the counselor's strategies rather than the behaviors expressed by clients. This can lead to unreasonable or inappropriate counseling strategies and corresponding responses generated by the dialogue system. To address this issue, we propose PsyChat, a client-centric dialogue system that provides psychological support through online chat. The client-centric dialogue system comprises five modules: client behavior recognition, counselor strategy selection, input packer, response generator, and response selection. Both automatic and human evaluations demonstr",
    "path": "papers/23/12/2312.04262.json",
    "total_tokens": 812,
    "translated_title": "PsyChat：面向客户的心理健康支持对话系统",
    "translated_abstract": "对话系统越来越多地整合到心理健康支持中，以帮助客户促进探索，获得洞察力，采取行动，最终自愈。一个实用且用户友好的对话系统应当以客户为中心，专注于客户的行为。然而，目前公开可用于心理健康支持的对话系统往往只集中于辅导员的策略，而忽视了客户表达的行为。这可能导致对话系统产生不合理或不适当的辅导策略以及相应的回应。为解决这一问题，我们提出了PsyChat，一个通过在线聊天提供心理支持的面向客户的对话系统。该对话系统包括五个模块：客户行为识别、辅导员策略选择、输入打包器、回应生成器和回应选择。自动和人工评估表明…",
    "tldr": "PsyChat 提出了一个面向客户的对话系统，通过识别客户行为并结合辅导员策略，在线提供心理支持，弥补了现有心理健康支持中对话系统忽视客户行为的不足。",
    "en_tdlr": "PsyChat introduces a client-centric dialogue system that provides psychological support through online chat by recognizing client behavior and combining counselor strategies, addressing the shortcomings of existing mental health support systems that overlook client behaviors."
}