{
    "title": "A Novel Image Classification Framework Based on Variational Quantum Algorithms",
    "abstract": "arXiv:2312.07932v2 Announce Type: replace-cross  Abstract: Image classification is a crucial task in machine learning with widespread practical applications. The existing classical framework for image classification typically utilizes a global pooling operation at the end of the network to reduce computational complexity and mitigate overfitting. However, this operation often results in a significant loss of information, which can affect the performance of classification models. To overcome this limitation, we introduce a novel image classification framework that leverages variational quantum algorithms (VQAs)-hybrid approaches combining quantum and classical computing paradigms within quantum machine learning. The major advantage of our framework is the elimination of the need for the global pooling operation at the end of the network. In this way, our approach preserves more discriminative features and fine-grained details in the images, which enhances classification performance. Add",
    "link": "https://arxiv.org/abs/2312.07932",
    "context": "Title: A Novel Image Classification Framework Based on Variational Quantum Algorithms\nAbstract: arXiv:2312.07932v2 Announce Type: replace-cross  Abstract: Image classification is a crucial task in machine learning with widespread practical applications. The existing classical framework for image classification typically utilizes a global pooling operation at the end of the network to reduce computational complexity and mitigate overfitting. However, this operation often results in a significant loss of information, which can affect the performance of classification models. To overcome this limitation, we introduce a novel image classification framework that leverages variational quantum algorithms (VQAs)-hybrid approaches combining quantum and classical computing paradigms within quantum machine learning. The major advantage of our framework is the elimination of the need for the global pooling operation at the end of the network. In this way, our approach preserves more discriminative features and fine-grained details in the images, which enhances classification performance. Add",
    "path": "papers/23/12/2312.07932.json",
    "total_tokens": 800,
    "translated_title": "基于变分量子算法的新型图像分类框架",
    "translated_abstract": "图像分类在机器学习中是一项至关重要的任务，具有广泛的实际应用。现有的图像分类传统框架通常在网络末端使用全局池化操作来减少计算复杂性并减轻过拟合。然而，该操作通常导致信息严重丢失，影响分类模型的性能。为了克服这一局限性，我们引入了一种新型图像分类框架，利用了变分量子算法（VQAs）- 在量子机器学习中结合了量子和经典计算范式的混合方法。我们框架的主要优势在于消除了网络末端的全局池化操作的需求。通过这种方式，我们的方法保留了图像中更多的判别特征和细粒度细节，从而提升了分类性能。",
    "tldr": "这项研究提出了一种基于变分量子算法的新型图像分类框架，通过消除全局池化操作，保留了更多图像的判别特征和细节，从而增强了分类性能。",
    "en_tdlr": "This study presents a novel image classification framework based on variational quantum algorithms, which preserves more discriminative features and details in images by eliminating the global pooling operation, enhancing the classification performance."
}