{
    "title": "Auto311: A Confidence-guided Automated System for Non-emergency Calls. (arXiv:2312.14185v2 [cs.CL] UPDATED)",
    "abstract": "Emergency and non-emergency response systems are essential services provided by local governments and critical to protecting lives, the environment, and property. The effective handling of (non-)emergency calls is critical for public safety and well-being. By reducing the burden through non-emergency callers, residents in critical need of assistance through 911 will receive a fast and effective response. Collaborating with the Department of Emergency Communications (DEC) in Nashville, we analyzed 11,796 non-emergency call recordings and developed Auto311, the first automated system to handle 311 non-emergency calls, which (1) effectively and dynamically predicts ongoing non-emergency incident types to generate tailored case reports during the call; (2) itemizes essential information from dialogue contexts to complete the generated reports; and (3) strategically structures system-caller dialogues with optimized confidence. We used real-world data to evaluate the system's effectiveness a",
    "link": "http://arxiv.org/abs/2312.14185",
    "context": "Title: Auto311: A Confidence-guided Automated System for Non-emergency Calls. (arXiv:2312.14185v2 [cs.CL] UPDATED)\nAbstract: Emergency and non-emergency response systems are essential services provided by local governments and critical to protecting lives, the environment, and property. The effective handling of (non-)emergency calls is critical for public safety and well-being. By reducing the burden through non-emergency callers, residents in critical need of assistance through 911 will receive a fast and effective response. Collaborating with the Department of Emergency Communications (DEC) in Nashville, we analyzed 11,796 non-emergency call recordings and developed Auto311, the first automated system to handle 311 non-emergency calls, which (1) effectively and dynamically predicts ongoing non-emergency incident types to generate tailored case reports during the call; (2) itemizes essential information from dialogue contexts to complete the generated reports; and (3) strategically structures system-caller dialogues with optimized confidence. We used real-world data to evaluate the system's effectiveness a",
    "path": "papers/23/12/2312.14185.json",
    "total_tokens": 907,
    "translated_title": "Auto311: 一种基于信心指导的自动非紧急通话系统",
    "translated_abstract": "紧急和非紧急响应系统是地方政府提供的基本服务，对于保护生命、环境和财产至关重要。有效处理（非）紧急电话对公共安全和福祉至关重要。通过减轻非紧急电话的负担，亟需911求助的居民将获得快速有效的响应。我们与纳什维尔紧急通信部门合作，分析了11,796个非紧急呼叫录音，并开发了Auto311，第一个处理311非紧急呼叫的自动化系统，该系统（1）有效动态地预测正在进行的非紧急事件类型，以在通话过程中生成个性化的案件报告；（2）从对话上下文中提取关键信息，完成生成的报告；（3）以优化的信心水平安排系统和主叫人之间的对话结构。我们使用实际数据评估了该系统的有效性。",
    "tldr": "Auto311是第一个处理非紧急电话的自动化系统，它通过减轻非紧急电话负担，提供快速有效的响应。通过预测事件类型并生成个性化的案件报告，并从对话上下文中提取关键信息来完善报告，系统与主叫人之间的对话结构得到优化。"
}