{
    "title": "Mean estimation in the add-remove model of differential privacy",
    "abstract": "arXiv:2312.06658v2 Announce Type: replace-cross  Abstract: Differential privacy is often studied under two different models of neighboring datasets: the add-remove model and the swap model. While the swap model is frequently used in the academic literature to simplify analysis, many practical applications rely on the more conservative add-remove model, where obtaining tight results can be difficult. Here, we study the problem of one-dimensional mean estimation under the add-remove model. We propose a new algorithm and show that it is min-max optimal, achieving the best possible constant in the leading term of the mean squared error for all $\\epsilon$, and that this constant is the same as the optimal algorithm under the swap model. These results show that the add-remove and swap models give nearly identical errors for mean estimation, even though the add-remove model cannot treat the size of the dataset as public information. We also demonstrate empirically that our proposed algorithm ",
    "link": "https://arxiv.org/abs/2312.06658",
    "context": "Title: Mean estimation in the add-remove model of differential privacy\nAbstract: arXiv:2312.06658v2 Announce Type: replace-cross  Abstract: Differential privacy is often studied under two different models of neighboring datasets: the add-remove model and the swap model. While the swap model is frequently used in the academic literature to simplify analysis, many practical applications rely on the more conservative add-remove model, where obtaining tight results can be difficult. Here, we study the problem of one-dimensional mean estimation under the add-remove model. We propose a new algorithm and show that it is min-max optimal, achieving the best possible constant in the leading term of the mean squared error for all $\\epsilon$, and that this constant is the same as the optimal algorithm under the swap model. These results show that the add-remove and swap models give nearly identical errors for mean estimation, even though the add-remove model cannot treat the size of the dataset as public information. We also demonstrate empirically that our proposed algorithm ",
    "path": "papers/23/12/2312.06658.json",
    "total_tokens": 863,
    "translated_title": "在差分隐私的添加-删除模型中的均值估计",
    "translated_abstract": "差分隐私通常在两种不同的相邻数据集模型下研究：添加-删除模型和交换模型。虽然交换模型经常在学术文献中用于简化分析，但许多实际应用依赖更保守的添加-删除模型，其中获得紧密结果可能很困难。在这里，我们研究了添加-删除模型下的一维均值估计问题。我们提出了一种新算法，并表明它是最小-最大最优的，在所有$\\epsilon$的均方误差的主导项中实现了最佳常数，而且这个常数与交换模型下的最优算法是相同的。这些结果表明，添加-删除模型和交换模型对于均值估计给出了几乎相同的误差，尽管添加-删除模型无法处理数据集的大小作为公共信息。我们还经验性地证明了我们提出的算法",
    "tldr": "该论文研究了在差分隐私的添加-删除模型中的一维均值估计问题，并提出了一个新算法，证明其在均方误差中达到最佳常数，该常数与交换模型下的最优算法相同。",
    "en_tdlr": "This paper investigates the problem of one-dimensional mean estimation in the add-remove model of differential privacy, proposes a new algorithm that achieves the best constant in the mean squared error, and shows that this constant is the same as the optimal algorithm under the swap model."
}