{
    "title": "A Novel Federated Learning-Based IDS for Enhancing UAVs Privacy and Security",
    "abstract": "arXiv:2312.04135v2 Announce Type: replace-cross  Abstract: Unmanned aerial vehicles (UAVs) operating within Flying Ad-hoc Networks (FANETs) encounter security challenges due to the dynamic and distributed nature of these networks. Previous studies predominantly focused on centralized intrusion detection, assuming a central entity responsible for storing and analyzing data from all devices.However, these approaches face challenges including computation and storage costs, along with a single point of failure risk, threatening data privacy and availability. The widespread dispersion of data across interconnected devices underscores the necessity for decentralized approaches. This paper introduces the Federated Learning-based Intrusion Detection System (FL-IDS), addressing challenges encountered by centralized systems in FANETs. FL-IDS reduces computation and storage costs for both clients and the central server, crucial for resource-constrained UAVs. Operating in a decentralized manner, F",
    "link": "https://arxiv.org/abs/2312.04135",
    "context": "Title: A Novel Federated Learning-Based IDS for Enhancing UAVs Privacy and Security\nAbstract: arXiv:2312.04135v2 Announce Type: replace-cross  Abstract: Unmanned aerial vehicles (UAVs) operating within Flying Ad-hoc Networks (FANETs) encounter security challenges due to the dynamic and distributed nature of these networks. Previous studies predominantly focused on centralized intrusion detection, assuming a central entity responsible for storing and analyzing data from all devices.However, these approaches face challenges including computation and storage costs, along with a single point of failure risk, threatening data privacy and availability. The widespread dispersion of data across interconnected devices underscores the necessity for decentralized approaches. This paper introduces the Federated Learning-based Intrusion Detection System (FL-IDS), addressing challenges encountered by centralized systems in FANETs. FL-IDS reduces computation and storage costs for both clients and the central server, crucial for resource-constrained UAVs. Operating in a decentralized manner, F",
    "path": "papers/23/12/2312.04135.json",
    "total_tokens": 871,
    "translated_title": "基于联邦学习的用于增强无人机隐私和安全的入侵检测系统",
    "translated_abstract": "无人机在飞行自组织网络(FANETs)中运行时会遇到安全挑战，因为这些网络具有动态和分布式的特性。先前的研究主要集中在集中式入侵检测上，假设一个中央实体负责存储和分析来自所有设备的数据。然而，这些方法面临计算和存储成本以及单点故障风险等挑战，威胁到数据隐私和可用性。数据在互连设备之间广泛分散的情况突显了去中心化方法的必要性。本文介绍了基于联邦学习的入侵检测系统(FL-IDS)，解决了FANETs中集中式系统遇到的挑战。FL-IDS在去中心化方式下运行，降低了客户端和中央服务器的计算和存储成本，这对于资源受限的无人机至关重要。",
    "tldr": "本论文引入了基于联邦学习的入侵检测系统(FL-IDS)，旨在解决FANETs中集中式系统所遇到的挑战，降低了计算和存储成本，适合资源受限的无人机。",
    "en_tdlr": "This paper introduces the Federated Learning-based Intrusion Detection System (FL-IDS) to address challenges faced by centralized systems in FANETs, reducing computation and storage costs, suitable for resource-constrained UAVs."
}