{
    "title": "MatterGen: a generative model for inorganic materials design. (arXiv:2312.03687v2 [cond-mat.mtrl-sci] UPDATED)",
    "abstract": "The design of functional materials with desired properties is essential in driving technological advances in areas like energy storage, catalysis, and carbon capture. Generative models provide a new paradigm for materials design by directly generating entirely novel materials given desired property constraints. Despite recent progress, current generative models have low success rate in proposing stable crystals, or can only satisfy a very limited set of property constraints. Here, we present MatterGen, a model that generates stable, diverse inorganic materials across the periodic table and can further be fine-tuned to steer the generation towards a broad range of property constraints. To enable this, we introduce a new diffusion-based generative process that produces crystalline structures by gradually refining atom types, coordinates, and the periodic lattice. We further introduce adapter modules to enable fine-tuning towards any given property constraints with a labeled dataset. Comp",
    "link": "http://arxiv.org/abs/2312.03687",
    "context": "Title: MatterGen: a generative model for inorganic materials design. (arXiv:2312.03687v2 [cond-mat.mtrl-sci] UPDATED)\nAbstract: The design of functional materials with desired properties is essential in driving technological advances in areas like energy storage, catalysis, and carbon capture. Generative models provide a new paradigm for materials design by directly generating entirely novel materials given desired property constraints. Despite recent progress, current generative models have low success rate in proposing stable crystals, or can only satisfy a very limited set of property constraints. Here, we present MatterGen, a model that generates stable, diverse inorganic materials across the periodic table and can further be fine-tuned to steer the generation towards a broad range of property constraints. To enable this, we introduce a new diffusion-based generative process that produces crystalline structures by gradually refining atom types, coordinates, and the periodic lattice. We further introduce adapter modules to enable fine-tuning towards any given property constraints with a labeled dataset. Comp",
    "path": "papers/23/12/2312.03687.json",
    "total_tokens": 847,
    "translated_title": "MatterGen: 无机材料设计的生成模型",
    "translated_abstract": "在能源存储、催化和碳捕集等领域，设计具有期望性能的功能材料对推动技术进步至关重要。生成模型通过直接生成全新的材料，满足特定性质约束，为材料设计提供了新的范式。尽管近年来取得了一些进展，但当前的生成模型在提出稳定晶体的成功率方面较低，或者只能满足非常有限的性质约束。我们在这里介绍了MatterGen，一个能够在周期表上生成稳定多样的无机材料的模型，并且可以通过微调生成过程，满足广泛的性质约束范围。为了实现这一目标，我们引入了一种基于扩散的生成过程，通过逐步改进原子类型、坐标和周期晶格来产生晶体结构。我们进一步引入了适配器模块，以便通过带标签的数据集对任意给定的性质约束进行微调。",
    "tldr": "MatterGen是一个生成模型，在无机材料设计中能够生成稳定多样的材料，并通过适配器模块进行微调以满足广泛的性质约束。",
    "en_tdlr": "MatterGen is a generative model that can create diverse and stable inorganic materials for design, and can be fine-tuned using adapter modules to meet a wide range of property constraints."
}