{
    "title": "Generating Explanations to Understand and Repair Embedding-based Entity Alignment",
    "abstract": "arXiv:2312.04877v3 Announce Type: replace  Abstract: Entity alignment (EA) seeks identical entities in different knowledge graphs, which is a long-standing task in the database research. Recent work leverages deep learning to embed entities in vector space and align them via nearest neighbor search. Although embedding-based EA has gained marked success in recent years, it lacks explanations for alignment decisions. In this paper, we present the first framework that can generate explanations for understanding and repairing embedding-based EA results. Given an EA pair produced by an embedding model, we first compare its neighbor entities and relations to build a matching subgraph as a local explanation. We then construct an alignment dependency graph to understand the pair from an abstract perspective. Finally, we repair the pair by resolving three types of alignment conflicts based on dependency graphs. Experiments on a variety of EA datasets demonstrate the effectiveness, generalizatio",
    "link": "https://arxiv.org/abs/2312.04877",
    "context": "Title: Generating Explanations to Understand and Repair Embedding-based Entity Alignment\nAbstract: arXiv:2312.04877v3 Announce Type: replace  Abstract: Entity alignment (EA) seeks identical entities in different knowledge graphs, which is a long-standing task in the database research. Recent work leverages deep learning to embed entities in vector space and align them via nearest neighbor search. Although embedding-based EA has gained marked success in recent years, it lacks explanations for alignment decisions. In this paper, we present the first framework that can generate explanations for understanding and repairing embedding-based EA results. Given an EA pair produced by an embedding model, we first compare its neighbor entities and relations to build a matching subgraph as a local explanation. We then construct an alignment dependency graph to understand the pair from an abstract perspective. Finally, we repair the pair by resolving three types of alignment conflicts based on dependency graphs. Experiments on a variety of EA datasets demonstrate the effectiveness, generalizatio",
    "path": "papers/23/12/2312.04877.json",
    "total_tokens": 870,
    "translated_title": "生成解释以理解和修复基于嵌入的实体对齐",
    "translated_abstract": "实体对齐（EA）旨在在不同知识图中寻找相同的实体，这是数据库研究中一个长期存在的任务。最近的研究利用深度学习将实体嵌入向量空间，并通过最近邻搜索来对齐它们。尽管基于嵌入的EA在近年取得了显著的成功，但缺乏对齐决策的解释。在本文中，我们提出了第一个能够为理解和修复基于嵌入的EA结果生成解释的框架。给定由嵌入模型产生的EA对，我们首先比较其邻近实体和关系，构建一个匹配子图作为局部解释。然后构建一个对齐依赖图，以抽象的角度理解该对。最后，我们通过基于依赖图解决三种类型的对齐冲突来修复这对。对各种EA数据集的实验表明了其有效性和泛化性。",
    "tldr": "该论文提出了一个可以生成解释以理解和修复基于嵌入的实体对齐结果的框架，通过构建匹配子图和对齐依赖图，解决对齐冲突，实验表明其有效性和泛化性。",
    "en_tdlr": "This paper introduces a framework that can generate explanations to understand and repair embedding-based entity alignment results, resolving alignment conflicts by constructing matching subgraphs and alignment dependency graphs, with experiments demonstrating its effectiveness and generalization."
}