{
    "title": "SIG: Speaker Identification in Literature via Prompt-Based Generation",
    "abstract": "arXiv:2312.14590v2 Announce Type: replace  Abstract: Identifying speakers of quotations in narratives is an important task in literary analysis, with challenging scenarios including the out-of-domain inference for unseen speakers, and non-explicit cases where there are no speaker mentions in surrounding context. In this work, we propose a simple and effective approach SIG, a generation-based method that verbalizes the task and quotation input based on designed prompt templates, which also enables easy integration of other auxiliary tasks that further bolster the speaker identification performance. The prediction can either come from direct generation by the model, or be determined by the highest generation probability of each speaker candidate. Based on our approach design, SIG supports out-of-domain evaluation, and achieves open-world classification paradigm that is able to accept any forms of candidate input. We perform both cross-domain evaluation and in-domain evaluation on PDNC, t",
    "link": "https://arxiv.org/abs/2312.14590",
    "context": "Title: SIG: Speaker Identification in Literature via Prompt-Based Generation\nAbstract: arXiv:2312.14590v2 Announce Type: replace  Abstract: Identifying speakers of quotations in narratives is an important task in literary analysis, with challenging scenarios including the out-of-domain inference for unseen speakers, and non-explicit cases where there are no speaker mentions in surrounding context. In this work, we propose a simple and effective approach SIG, a generation-based method that verbalizes the task and quotation input based on designed prompt templates, which also enables easy integration of other auxiliary tasks that further bolster the speaker identification performance. The prediction can either come from direct generation by the model, or be determined by the highest generation probability of each speaker candidate. Based on our approach design, SIG supports out-of-domain evaluation, and achieves open-world classification paradigm that is able to accept any forms of candidate input. We perform both cross-domain evaluation and in-domain evaluation on PDNC, t",
    "path": "papers/23/12/2312.14590.json",
    "total_tokens": 778,
    "translated_title": "通过基于提示生成的方法在文学作品中进行说话者识别",
    "translated_abstract": "在文学分析中，识别叙述中引用的发言者是一项重要任务，挑战性情景包括对看不见发言者的跨领域推断，以及周围环境中没有提到发言者的非明确情况。本文提出了一种简单且有效的方法SIG，这是一种基于生成的方法，根据设计的提示模板对任务和引语输入进行语言化处理，还可以轻松集成其他进一步增强说话者识别性能的辅助任务。预测可以来自模型的直接生成，也可以由每个发言者候选人的最高生成概率确定。基于我们的方法设计，SIG支持跨领域评估，并实现了能够接受任何候选输入形式的开放世界分类范式。我们在PDNC上进行了跨领域评估和内领域评估。",
    "tldr": "通过基于生成的方法SIG，在文学作品中实现了说话者识别任务，支持跨领域评估和开放世界分类范式。",
    "en_tdlr": "Through a generation-based method SIG, speaker identification task in literary works is achieved, supporting cross-domain evaluation and open-world classification paradigm."
}