{
    "title": "Fast ODE-based Sampling for Diffusion Models in Around 5 Steps",
    "abstract": "arXiv:2312.00094v2 Announce Type: replace-cross  Abstract: Sampling from diffusion models can be treated as solving the corresponding ordinary differential equations (ODEs), with the aim of obtaining an accurate solution with as few number of function evaluations (NFE) as possible. Recently, various fast samplers utilizing higher-order ODE solvers have emerged and achieved better performance than the initial first-order one. However, these numerical methods inherently result in certain approximation errors, which significantly degrades sample quality with extremely small NFE (e.g., around 5). In contrast, based on the geometric observation that each sampling trajectory almost lies in a two-dimensional subspace embedded in the ambient space, we propose Approximate MEan-Direction Solver (AMED-Solver) that eliminates truncation errors by directly learning the mean direction for fast diffusion sampling. Besides, our method can be easily used as a plugin to further improve existing ODE-base",
    "link": "https://arxiv.org/abs/2312.00094",
    "context": "Title: Fast ODE-based Sampling for Diffusion Models in Around 5 Steps\nAbstract: arXiv:2312.00094v2 Announce Type: replace-cross  Abstract: Sampling from diffusion models can be treated as solving the corresponding ordinary differential equations (ODEs), with the aim of obtaining an accurate solution with as few number of function evaluations (NFE) as possible. Recently, various fast samplers utilizing higher-order ODE solvers have emerged and achieved better performance than the initial first-order one. However, these numerical methods inherently result in certain approximation errors, which significantly degrades sample quality with extremely small NFE (e.g., around 5). In contrast, based on the geometric observation that each sampling trajectory almost lies in a two-dimensional subspace embedded in the ambient space, we propose Approximate MEan-Direction Solver (AMED-Solver) that eliminates truncation errors by directly learning the mean direction for fast diffusion sampling. Besides, our method can be easily used as a plugin to further improve existing ODE-base",
    "path": "papers/23/12/2312.00094.json",
    "total_tokens": 861,
    "translated_title": "在大约5个步骤中，用于扩散模型的快速基于ODE的抽样",
    "translated_abstract": "从扩散模型中进行抽样可以被视为解决相应的常微分方程（ODE），旨在以尽可能少的函数评估次数（NFE）获得准确解。最近，出现了利用高阶ODE求解器的各种快速抽样器，并且比最初的一阶求解器表现更好。然而，这些数值方法固有地导致某些近似误差，极大地降低了具有极小NFE（例如，约为5）的样本质量。相反，基于几何观察，每个抽样轨迹几乎位于嵌入在环境空间中的二维子空间中，我们提出了用于快速扩散抽样的AME近似均方向求解器（AMED-Solver），通过直接学习均方向来消除截断误差。此外，我们的方法可以轻松作为插件使用，以进一步改进现有的基于ODE的方法。",
    "tldr": "提出了一种基于几何观察的Approximate MEan-Direction Solver（AMED-Solver），能够通过直接学习均方向来消除截断误差，从而实现快速扩散抽样。",
    "en_tdlr": "Introduced an Approximate MEan-Direction Solver (AMED-Solver) based on geometric observation, which eliminates truncation errors by directly learning the mean direction to achieve fast diffusion sampling."
}