{
    "title": "RDR: the Recap, Deliberate, and Respond Method for Enhanced Language Understanding",
    "abstract": "arXiv:2312.09932v2 Announce Type: replace-cross  Abstract: Natural language understanding (NLU) using neural network pipelines often requires additional context that is not solely present in the input data. Through Prior research, it has been evident that NLU benchmarks are susceptible to manipulation by neural models, wherein these models exploit statistical artifacts within the encoded external knowledge to artificially inflate performance metrics for downstream tasks. Our proposed approach, known as the Recap, Deliberate, and Respond (RDR) paradigm, addresses this issue by incorporating three distinct objectives within the neural network pipeline. Firstly, the Recap objective involves paraphrasing the input text using a paraphrasing model in order to summarize and encapsulate its essence. Secondly, the Deliberation objective entails encoding external graph information related to entities mentioned in the input text, utilizing a graph embedding model. Finally, the Respond objective e",
    "link": "https://arxiv.org/abs/2312.09932",
    "context": "Title: RDR: the Recap, Deliberate, and Respond Method for Enhanced Language Understanding\nAbstract: arXiv:2312.09932v2 Announce Type: replace-cross  Abstract: Natural language understanding (NLU) using neural network pipelines often requires additional context that is not solely present in the input data. Through Prior research, it has been evident that NLU benchmarks are susceptible to manipulation by neural models, wherein these models exploit statistical artifacts within the encoded external knowledge to artificially inflate performance metrics for downstream tasks. Our proposed approach, known as the Recap, Deliberate, and Respond (RDR) paradigm, addresses this issue by incorporating three distinct objectives within the neural network pipeline. Firstly, the Recap objective involves paraphrasing the input text using a paraphrasing model in order to summarize and encapsulate its essence. Secondly, the Deliberation objective entails encoding external graph information related to entities mentioned in the input text, utilizing a graph embedding model. Finally, the Respond objective e",
    "path": "papers/23/12/2312.09932.json",
    "total_tokens": 811,
    "translated_title": "RDR：增强语言理解的回顾、审慎和回应方法",
    "translated_abstract": "自然语言理解（NLU）使用神经网络管道通常需要额外的上下文，而这些上下文并不仅仅存在于输入数据中。通过先前的研究，已经明显地证明了NLU基准测试对神经模型的操纵敏感，这些模型利用编码的外部知识中的统计特征人为地提高了下游任务的性能指标。我们提出的方法称为回顾、审慎和回应（RDR）范式，通过在神经网络管道中引入三个不同的目标来解决这个问题。首先，回顾目标涉及使用一个释义模型对输入文本进行释义，以便对其进行总结和概括。其次，审慎目标涉及利用图嵌入模型对与输入文本中提到的实体相关的外部图信息进行编码。最后，回应目标e",
    "tldr": "RDR方法提出了通过回顾、审慎和回应三个目标来增强语言理解的神经网络管道，解决了神经模型操纵NLU基准测试的问题"
}