{
    "title": "Domain constraints improve risk prediction when outcome data is missing",
    "abstract": "arXiv:2312.03878v2 Announce Type: replace  Abstract: Machine learning models are often trained to predict the outcome resulting from a human decision. For example, if a doctor decides to test a patient for disease, will the patient test positive? A challenge is that historical decision-making determines whether the outcome is observed: we only observe test outcomes for patients doctors historically tested. Untested patients, for whom outcomes are unobserved, may differ from tested patients along observed and unobserved dimensions. We propose a Bayesian model class which captures this setting. The purpose of the model is to accurately estimate risk for both tested and untested patients. Estimating this model is challenging due to the wide range of possibilities for untested patients. To address this, we propose two domain constraints which are plausible in health settings: a prevalence constraint, where the overall disease prevalence is known, and an expertise constraint, where the huma",
    "link": "https://arxiv.org/abs/2312.03878",
    "context": "Title: Domain constraints improve risk prediction when outcome data is missing\nAbstract: arXiv:2312.03878v2 Announce Type: replace  Abstract: Machine learning models are often trained to predict the outcome resulting from a human decision. For example, if a doctor decides to test a patient for disease, will the patient test positive? A challenge is that historical decision-making determines whether the outcome is observed: we only observe test outcomes for patients doctors historically tested. Untested patients, for whom outcomes are unobserved, may differ from tested patients along observed and unobserved dimensions. We propose a Bayesian model class which captures this setting. The purpose of the model is to accurately estimate risk for both tested and untested patients. Estimating this model is challenging due to the wide range of possibilities for untested patients. To address this, we propose two domain constraints which are plausible in health settings: a prevalence constraint, where the overall disease prevalence is known, and an expertise constraint, where the huma",
    "path": "papers/23/12/2312.03878.json",
    "total_tokens": 750,
    "translated_title": "领域约束在缺失结果数据时改善风险预测",
    "translated_abstract": "机器学习模型通常用于预测人类决策结果。然而，历史决策决定了观察结果，我们只观察到医生历史上测试的患者的测试结果。我们提出了一种贝叶斯模型类，能够捕捉到这种情况。模型的目的是准确估计测试和未测试患者的风险。由于未测试患者可能出现各种可能性，因此估计这个模型是具有挑战性的。为解决这个问题，我们提出了两个在健康领域合理的领域约束：预valence约束，其中整体疾病患病率是已知的，专业约束，其中人类",
    "tldr": "提出一种贝叶斯模型类，通过领域约束的设置来改善测试和未测试患者的风险预测",
    "en_tdlr": "Propose a Bayesian model class that improves risk prediction for both tested and untested patients by setting domain constraints."
}