{
    "title": "DarkShot: Lighting Dark Images with Low-Compute and High-Quality. (arXiv:2312.16805v3 [cs.CV] UPDATED)",
    "abstract": "Nighttime photography encounters escalating challenges in extremely low-light conditions, primarily attributable to the ultra-low signal-to-noise ratio. For real-world deployment, a practical solution must not only produce visually appealing results but also require minimal computation. However, most existing methods are either focused on improving restoration performance or employ lightweight models at the cost of quality. This paper proposes a lightweight network that outperforms existing state-of-the-art (SOTA) methods in low-light enhancement tasks while minimizing computation. The proposed network incorporates Siamese Self-Attention Block (SSAB) and Skip-Channel Attention (SCA) modules, which enhance the model's capacity to aggregate global information and are well-suited for high-resolution images. Additionally, based on our analysis of the low-light image restoration process, we propose a Two-Stage Framework that achieves superior results. Our model can restore a UHD 4K resoluti",
    "link": "http://arxiv.org/abs/2312.16805",
    "context": "Title: DarkShot: Lighting Dark Images with Low-Compute and High-Quality. (arXiv:2312.16805v3 [cs.CV] UPDATED)\nAbstract: Nighttime photography encounters escalating challenges in extremely low-light conditions, primarily attributable to the ultra-low signal-to-noise ratio. For real-world deployment, a practical solution must not only produce visually appealing results but also require minimal computation. However, most existing methods are either focused on improving restoration performance or employ lightweight models at the cost of quality. This paper proposes a lightweight network that outperforms existing state-of-the-art (SOTA) methods in low-light enhancement tasks while minimizing computation. The proposed network incorporates Siamese Self-Attention Block (SSAB) and Skip-Channel Attention (SCA) modules, which enhance the model's capacity to aggregate global information and are well-suited for high-resolution images. Additionally, based on our analysis of the low-light image restoration process, we propose a Two-Stage Framework that achieves superior results. Our model can restore a UHD 4K resoluti",
    "path": "papers/23/12/2312.16805.json",
    "total_tokens": 931,
    "translated_title": "DarkShot: 用低计算量和高质量照亮暗图像",
    "translated_abstract": "夜间摄影在极低光条件下遇到越来越多的挑战，主要是由于超低的信噪比。对于实际部署，实用解决方案不仅必须产生视觉上吸引人的结果，还必须要求最小计算量。然而，大多数现有方法要么专注于提高恢复性能，要么采用轻量级模型却牺牲了质量。本文提出了一个轻量级网络，它在低光增强任务中优于现有最先进的方法，同时最小化计算量。所提出的网络结合了Siamese自注意块(SSAB)和Skip-Channel注意力(SCA)模块，增强了模型聚合全局信息的能力，并且非常适用于高分辨率图像。此外，基于我们对低光图像恢复过程的分析，我们提出了一个两阶段框架，可以实现更好的结果。我们的模型可以恢复UHD 4K分辨率的图像。",
    "tldr": "本文提出了一种用低计算量和高质量照亮暗图像的轻量级网络，该网络采用Siamese自注意块和Skip-Channel注意力模块，可以在低光增强任务中超越现有最先进的方法，并提出了一个两阶段框架来实现更好的结果。"
}