{
    "title": "Bespoke Approximation of Multiplication-Accumulation and Activation Targeting Printed Multilayer Perceptrons",
    "abstract": "Printed Electronics (PE) feature distinct and remarkable characteristics that make them a prominent technology for achieving true ubiquitous computing. This is particularly relevant in application domains that require conformal and ultra-low cost solutions, which have experienced limited penetration of computing until now. Unlike silicon-based technologies, PE offer unparalleled features such as non-recurring engineering costs, ultra-low manufacturing cost, and on-demand fabrication of conformal, flexible, non-toxic, and stretchable hardware. However, PE face certain limitations due to their large feature sizes, that impede the realization of complex circuits, such as machine learning classifiers. In this work, we address these limitations by leveraging the principles of Approximate Computing and Bespoke (fully-customized) design. We propose an automated framework for designing ultra-low power Multilayer Perceptron (MLP) classifiers which employs, for the first time, a holistic approac",
    "link": "https://arxiv.org/abs/2312.17612",
    "context": "Title: Bespoke Approximation of Multiplication-Accumulation and Activation Targeting Printed Multilayer Perceptrons\nAbstract: Printed Electronics (PE) feature distinct and remarkable characteristics that make them a prominent technology for achieving true ubiquitous computing. This is particularly relevant in application domains that require conformal and ultra-low cost solutions, which have experienced limited penetration of computing until now. Unlike silicon-based technologies, PE offer unparalleled features such as non-recurring engineering costs, ultra-low manufacturing cost, and on-demand fabrication of conformal, flexible, non-toxic, and stretchable hardware. However, PE face certain limitations due to their large feature sizes, that impede the realization of complex circuits, such as machine learning classifiers. In this work, we address these limitations by leveraging the principles of Approximate Computing and Bespoke (fully-customized) design. We propose an automated framework for designing ultra-low power Multilayer Perceptron (MLP) classifiers which employs, for the first time, a holistic approac",
    "path": "papers/23/12/2312.17612.json",
    "total_tokens": 681,
    "translated_title": "面向印刷多层感知机的定制近似乘积累加和激活技术",
    "translated_abstract": "印刷电子技术具有独特的特性，使其成为实现真正无处不在计算的重要技术。本研究提出了一种自动化框架，用于设计超低功耗的多层感知机（MLP）分类器，通过利用近似计算和定制化设计的原则来克服印刷电子技术中的限制。",
    "tldr": "本研究提出了一种针对印刷电子技术中的限制的自动化框架，用于设计超低功耗的多层感知机（MLP）分类器。"
}