{
    "title": "Functional CLTs for subordinated L\\'evy models in physics, finance, and econometrics. (arXiv:2312.15119v2 [math.PR] UPDATED)",
    "abstract": "We present a simple unifying treatment of a broad class of applications from statistical mechanics, econometrics, mathematical finance, and insurance mathematics, where (possibly subordinated) L\\'evy noise arises as a scaling limit of some form of continuous-time random walk (CTRW). For each application, it is natural to rely on weak convergence results for stochastic integrals on Skorokhod space in Skorokhod's J1 or M1 topologies. As compared to earlier and entirely separate works, we are able to give a more streamlined account while also allowing for greater generality and providing important new insights. For each application, we first elucidate how the fundamental conclusions for J1 convergent CTRWs emerge as special cases of the same general principles, and we then illustrate how the specific settings give rise to different results for strictly M1 convergent CTRWs.",
    "link": "http://arxiv.org/abs/2312.15119",
    "context": "Title: Functional CLTs for subordinated L\\'evy models in physics, finance, and econometrics. (arXiv:2312.15119v2 [math.PR] UPDATED)\nAbstract: We present a simple unifying treatment of a broad class of applications from statistical mechanics, econometrics, mathematical finance, and insurance mathematics, where (possibly subordinated) L\\'evy noise arises as a scaling limit of some form of continuous-time random walk (CTRW). For each application, it is natural to rely on weak convergence results for stochastic integrals on Skorokhod space in Skorokhod's J1 or M1 topologies. As compared to earlier and entirely separate works, we are able to give a more streamlined account while also allowing for greater generality and providing important new insights. For each application, we first elucidate how the fundamental conclusions for J1 convergent CTRWs emerge as special cases of the same general principles, and we then illustrate how the specific settings give rise to different results for strictly M1 convergent CTRWs.",
    "path": "papers/23/12/2312.15119.json",
    "total_tokens": 926,
    "translated_title": "物理学、金融学和计量经济学中受限勒维模型的函数中心极限定理",
    "translated_abstract": "我们提出了一个简单的统一方法，用于处理统计力学、计量经济学、数学金融和保险数学等广泛的应用领域，其中（可能是受限制的）勒维噪声出现为某种形式的连续时间随机行走（CTRW）的缩放极限。对于每个应用，自然地依赖Skorokhod空间上的随机积分的弱收敛结果，在Skorokhod的J1或M1拓扑中。与早期和完全独立的作品相比，我们能够给出一个更简洁的解释，同时也允许更大的广泛性并提供重要的新见解。对于每个应用，我们首先阐明了J1收敛的CTRWs的基本结论如何成为相同一般原理的特例，并且我们随后说明特定的设置如何导致严格的M1收敛的CTRWs产生不同的结果。",
    "tldr": "该论文提出了一个简单的统一方法，用于处理物理学、金融学和计量经济学中受限勒维模型的应用，通过对Skorokhod空间中的随机积分的弱收敛结果进行研究，我们得出了一般原理，并发现了新的见解。",
    "en_tdlr": "This paper presents a simple and unified approach for dealing with applications of subordinated Lévy models in physics, finance, and econometrics. By studying the weak convergence results of stochastic integrals on Skorokhod space, we obtain general principles and provide new insights."
}