{
    "title": "Exploring Adversarial Robustness of LiDAR-Camera Fusion Model in Autonomous Driving. (arXiv:2312.01468v2 [cs.RO] UPDATED)",
    "abstract": "Our study assesses the adversarial robustness of LiDAR-camera fusion models in 3D object detection. We introduce an attack technique that, by simply adding a limited number of physically constrained adversarial points above a car, can make the car undetectable by the fusion model. Experimental results reveal that even without changes to the image data channel, the fusion model can be deceived solely by manipulating the LiDAR data channel. This finding raises safety concerns in the field of autonomous driving. Further, we explore how the quantity of adversarial points, the distance between the front-near car and the LiDAR-equipped car, and various angular factors affect the attack success rate. We believe our research can contribute to the understanding of multi-sensor robustness, offering insights and guidance to enhance the safety of autonomous driving.",
    "link": "http://arxiv.org/abs/2312.01468",
    "context": "Title: Exploring Adversarial Robustness of LiDAR-Camera Fusion Model in Autonomous Driving. (arXiv:2312.01468v2 [cs.RO] UPDATED)\nAbstract: Our study assesses the adversarial robustness of LiDAR-camera fusion models in 3D object detection. We introduce an attack technique that, by simply adding a limited number of physically constrained adversarial points above a car, can make the car undetectable by the fusion model. Experimental results reveal that even without changes to the image data channel, the fusion model can be deceived solely by manipulating the LiDAR data channel. This finding raises safety concerns in the field of autonomous driving. Further, we explore how the quantity of adversarial points, the distance between the front-near car and the LiDAR-equipped car, and various angular factors affect the attack success rate. We believe our research can contribute to the understanding of multi-sensor robustness, offering insights and guidance to enhance the safety of autonomous driving.",
    "path": "papers/23/12/2312.01468.json",
    "total_tokens": 999,
    "translated_title": "在自动驾驶中探索LiDAR-相机融合模型的对抗鲁棒性",
    "translated_abstract": "我们的研究评估了LiDAR-相机融合模型在3D物体检测中的对抗鲁棒性。我们引入了一种攻击技术，通过在车辆上方简单添加一定数量的物理约束的对抗性点，可以使融合模型无法检测到车辆。实验结果表明，即使不对图像数据通道进行更改，光达数据通道的操纵就足以欺骗融合模型。这一发现引发了自动驾驶领域的安全关注。此外，我们还探讨了对抗性点的数量、前方接近车辆与光达设备车辆之间的距离以及各种角度因素对攻击成功率的影响。我们相信我们的研究可以有助于理解多传感器的鲁棒性，并为提高自动驾驶的安全性提供洞见和指导。",
    "tldr": "该研究评估了自动驾驶中的LiDAR-相机融合模型的对抗鲁棒性，发现在不改变图像数据通道的情况下，仅通过操纵LiDAR数据通道即可欺骗融合模型，这引发了自动驾驶领域的安全关注，并探讨了攻击的成功率与对抗性点数量、车辆间距离和角度因素的关系。该研究有助于提高自动驾驶的安全性。",
    "en_tdlr": "This study evaluates the adversarial robustness of LiDAR-camera fusion models in autonomous driving and discovers that the fusion model can be deceived solely by manipulating the LiDAR data channel without changes to the image data channel. This raises safety concerns and explores the relationship between attack success rate and the quantity of adversarial points, distance between vehicles, and angular factors. The research contributes to enhancing the safety of autonomous driving."
}