{
    "title": "Sig-Networks Toolkit: Signature Networks for Longitudinal Language Modelling",
    "abstract": "We present an open-source, pip installable toolkit, Sig-Networks, the first of its kind for longitudinal language modelling. A central focus is the incorporation of Signature-based Neural Network models, which have recently shown success in temporal tasks. We apply and extend published research providing a full suite of signature-based models. Their components can be used as PyTorch building blocks in future architectures. Sig-Networks enables task-agnostic dataset plug-in, seamless pre-processing for sequential data, parameter flexibility, automated tuning across a range of models. We examine signature networks under three different NLP tasks of varying temporal granularity: counselling conversations, rumour stance switch and mood changes in social media threads, showing SOTA performance in all three, and provide guidance for future tasks. We release the Toolkit as a PyTorch package with an introductory video, Git repositories for preprocessing and modelling including sample notebooks",
    "link": "https://arxiv.org/abs/2312.03523",
    "context": "Title: Sig-Networks Toolkit: Signature Networks for Longitudinal Language Modelling\nAbstract: We present an open-source, pip installable toolkit, Sig-Networks, the first of its kind for longitudinal language modelling. A central focus is the incorporation of Signature-based Neural Network models, which have recently shown success in temporal tasks. We apply and extend published research providing a full suite of signature-based models. Their components can be used as PyTorch building blocks in future architectures. Sig-Networks enables task-agnostic dataset plug-in, seamless pre-processing for sequential data, parameter flexibility, automated tuning across a range of models. We examine signature networks under three different NLP tasks of varying temporal granularity: counselling conversations, rumour stance switch and mood changes in social media threads, showing SOTA performance in all three, and provide guidance for future tasks. We release the Toolkit as a PyTorch package with an introductory video, Git repositories for preprocessing and modelling including sample notebooks",
    "path": "papers/23/12/2312.03523.json",
    "total_tokens": 928,
    "translated_title": "Sig-Networks工具包：长期语言建模的签名网络",
    "translated_abstract": "我们提出了一个开源的、可通过pip安装的工具包，Sig-Networks，这是首个用于长期语言建模的工具包，其中的一个重要特点是纳入了基于签名的神经网络模型，这些模型在时间相关任务中已经显示出成功的应用。我们应用并扩展了已发表的研究，提供了一套完整的基于签名的模型。这些模型的组件可以作为PyTorch构建块在未来的架构中使用。Sig-Networks支持无关任务的数据集插件，对于顺序数据的无缝预处理，参数灵活性，以及在一系列模型中的自动调优。我们将签名网络应用于三个不同的NLP任务，涵盖了不同的时间粒度：咨询对话、谣言立场转换和社交媒体主题中的情绪变化，展示了在这三个任务中的最先进性能，并为未来的任务提供了指导。我们以PyTorch包的形式发布了这个工具包，附有一个介绍视频，包括预处理和建模的Git仓库以及示例笔记本",
    "tldr": "Sig-Networks是一个用于长期语言建模的开源工具包，其中集成了基于签名的神经网络模型并在多个NLP任务中取得了最先进的表现。它提供了灵活的参数调节和自动模型选择，并可以作为PyTorch的构建块在未来的架构中使用。",
    "en_tdlr": "Sig-Networks is an open-source toolkit for longitudinal language modelling, incorporating signature-based neural network models and achieving state-of-the-art performance in multiple NLP tasks. It provides flexible parameter tuning, automated model selection, and can be used as building blocks in future architectures using PyTorch."
}