{
    "title": "Federated Learning with Instance-Dependent Noisy Label. (arXiv:2312.10324v3 [cs.LG] UPDATED)",
    "abstract": "Federated learning (FL) with noisy labels poses a significant challenge. Existing methods designed for handling noisy labels in centralized learning tend to lose their effectiveness in the FL setting, mainly due to the small dataset size and the heterogeneity of client data. While some attempts have been made to tackle FL with noisy labels, they primarily focused on scenarios involving class-conditional noise. In this paper, we study the more challenging and practical issue of instance-dependent noise (IDN) in FL. We introduce a novel algorithm called FedBeat (Federated Learning with Bayesian Ensemble-Assisted Transition Matrix Estimation). FedBeat aims to build a global statistically consistent classifier using the IDN transition matrix (IDNTM), which encompasses three synergistic steps: (1) A federated data extraction step that constructs a weak global model and extracts high-confidence data using a Bayesian model ensemble method. (2) A federated transition matrix estimation step in ",
    "link": "http://arxiv.org/abs/2312.10324",
    "context": "Title: Federated Learning with Instance-Dependent Noisy Label. (arXiv:2312.10324v3 [cs.LG] UPDATED)\nAbstract: Federated learning (FL) with noisy labels poses a significant challenge. Existing methods designed for handling noisy labels in centralized learning tend to lose their effectiveness in the FL setting, mainly due to the small dataset size and the heterogeneity of client data. While some attempts have been made to tackle FL with noisy labels, they primarily focused on scenarios involving class-conditional noise. In this paper, we study the more challenging and practical issue of instance-dependent noise (IDN) in FL. We introduce a novel algorithm called FedBeat (Federated Learning with Bayesian Ensemble-Assisted Transition Matrix Estimation). FedBeat aims to build a global statistically consistent classifier using the IDN transition matrix (IDNTM), which encompasses three synergistic steps: (1) A federated data extraction step that constructs a weak global model and extracts high-confidence data using a Bayesian model ensemble method. (2) A federated transition matrix estimation step in ",
    "path": "papers/23/12/2312.10324.json",
    "total_tokens": 948,
    "translated_title": "具有实例相关噪声标签的联邦学习",
    "translated_abstract": "具有噪声标签的联邦学习是一个重要挑战。现有的处理中心化学习中噪声标签的方法在联邦学习环境中往往失效，主要原因是数据集规模小和客户端数据的异质性。虽然已经尝试了一些解决具有噪声标签的联邦学习的方法，但主要集中在涉及类条件噪声的情况。本文主要研究联邦学习中更具挑战性和实际问题，即实例相关噪声。我们提出了一种新颖的算法FedBeat（联邦学习与贝叶斯集成辅助转移矩阵估计），旨在使用实例相关噪声转移矩阵（IDNTM）构建全局统一的分类器。该算法包括三个协同步骤：（1）联邦数据提取步骤，通过贝叶斯模型集成方法构建弱全局模型并提取高置信度数据；（2）联邦转移矩阵估计步骤； in",
    "tldr": "本研究针对具有实例相关噪声的联邦学习问题，提出了一种名为FedBeat的新算法。该算法通过使用实例相关噪声转移矩阵构建全局分类器，包括联邦数据提取和转移矩阵估计两个步骤。"
}