{
    "title": "A Natural Language Processing-Based Classification and Mode-Based Ranking of Musculoskeletal Disorder Risk Factors",
    "abstract": "arXiv:2312.11517v3 Announce Type: replace  Abstract: This research delves into Musculoskeletal Disorder (MSD) risk factors, using a blend of Natural Language Processing (NLP) and mode-based ranking. The aim is to refine understanding, classification, and prioritization for focused prevention and treatment. Eight NLP models are evaluated, combining pre-trained transformers, cosine similarity, and distance metrics to categorize factors into personal, biomechanical, workplace, psychological, and organizational classes. BERT with cosine similarity achieves 28% accuracy; sentence transformer with Euclidean, Bray-Curtis, and Minkowski distances scores 100%. With 10-fold cross-validation, statistical tests ensure robust results. Survey data and mode-based ranking determine severity hierarchy, aligning with the literature. \"Working posture\" is the most severe, highlighting posture's role. Survey insights emphasize \"Job insecurity,\" \"Effort reward imbalance,\" and \"Poor employee facility\" as sig",
    "link": "https://arxiv.org/abs/2312.11517",
    "context": "Title: A Natural Language Processing-Based Classification and Mode-Based Ranking of Musculoskeletal Disorder Risk Factors\nAbstract: arXiv:2312.11517v3 Announce Type: replace  Abstract: This research delves into Musculoskeletal Disorder (MSD) risk factors, using a blend of Natural Language Processing (NLP) and mode-based ranking. The aim is to refine understanding, classification, and prioritization for focused prevention and treatment. Eight NLP models are evaluated, combining pre-trained transformers, cosine similarity, and distance metrics to categorize factors into personal, biomechanical, workplace, psychological, and organizational classes. BERT with cosine similarity achieves 28% accuracy; sentence transformer with Euclidean, Bray-Curtis, and Minkowski distances scores 100%. With 10-fold cross-validation, statistical tests ensure robust results. Survey data and mode-based ranking determine severity hierarchy, aligning with the literature. \"Working posture\" is the most severe, highlighting posture's role. Survey insights emphasize \"Job insecurity,\" \"Effort reward imbalance,\" and \"Poor employee facility\" as sig",
    "path": "papers/23/12/2312.11517.json",
    "total_tokens": 959,
    "translated_title": "基于自然语言处理的肌肉骨骼疾病风险因素分类与基于模式的排名",
    "translated_abstract": "本研究探讨了肌肉骨骼疾病（MSD）风险因素，使用自然语言处理（NLP）和基于模式的排名相结合。旨在精细化理解、分类和优先考虑针对性预防和治疗。评估了八个NLP模型，结合预训练的转换器、余弦相似度和距离度量将因素分类为个人、生物力学、工作场所、心理和组织等类别。BERT与余弦相似度达到28%的准确率；句子转换器与欧氏、布雷曲蒂斯和闵可夫斯基距离得分为100%。通过10倍交叉验证，统计检验确保鲁棒结果。调查数据和基于模式的排名确定了严重性等级，与文献相一致。\"工作姿势\"是最严重的，凸显了姿势的作用。调查结果强调了\"工作不稳定性\"、\"工作努力和回报不平衡\"和\"员工设施差\"等因素的显著性。",
    "tldr": "本研究利用自然语言处理和基于模式的排名方法对肌肉骨骼疾病的风险因素进行了分类和排名，以提高对其理解、分类和优先考虑预防和治疗的能力。",
    "en_tdlr": "This study utilizes natural language processing and mode-based ranking to classify and rank risk factors of musculoskeletal disorders, aiming to improve the understanding, classification, and prioritization for prevention and treatment."
}