{
    "title": "An AI-based solution for the cold start and data sparsity problems in the recommendation systems. (arXiv:2312.01840v2 [cs.IR] UPDATED)",
    "abstract": "In recent years, the amount of data available on the internet and the number of users who utilize the Internet have increased at an unparalleled pace. The exponential development in the quantity of digital information accessible and the number of Internet users has created the possibility for information overload, impeding fast access to items of interest on the Internet. Information retrieval systems like as Google, DevilFinder, and Altavista have partly overcome this challenge, but prioritizing and customization of information (where a system maps accessible material to a user's interests and preferences) were lacking. This has resulted in a higher-than-ever need for recommender systems. Recommender systems are information filtering systems that address the issue of information overload by filtering important information fragments from a huge volume of dynamically produced data based on the user's interests, favorite things, preferences and ratings on the desired item. Recommender sy",
    "link": "http://arxiv.org/abs/2312.01840",
    "context": "Title: An AI-based solution for the cold start and data sparsity problems in the recommendation systems. (arXiv:2312.01840v2 [cs.IR] UPDATED)\nAbstract: In recent years, the amount of data available on the internet and the number of users who utilize the Internet have increased at an unparalleled pace. The exponential development in the quantity of digital information accessible and the number of Internet users has created the possibility for information overload, impeding fast access to items of interest on the Internet. Information retrieval systems like as Google, DevilFinder, and Altavista have partly overcome this challenge, but prioritizing and customization of information (where a system maps accessible material to a user's interests and preferences) were lacking. This has resulted in a higher-than-ever need for recommender systems. Recommender systems are information filtering systems that address the issue of information overload by filtering important information fragments from a huge volume of dynamically produced data based on the user's interests, favorite things, preferences and ratings on the desired item. Recommender sy",
    "path": "papers/23/12/2312.01840.json",
    "total_tokens": 818,
    "translated_title": "基于人工智能的解决推荐系统中冷启动和数据稀疏问题的方案",
    "translated_abstract": "近年来，互联网上可用的数据量以及利用互联网的用户数量以前所未有的速度增长。数字信息量和互联网用户数量的指数级增长，带来了信息超载的可能性，阻碍了对互联网上感兴趣内容的快速访问。像Google、DevilFinder和Altavista等信息检索系统在一定程度上克服了这一挑战，但缺乏信息的优先级和个性化（即系统将可获取的材料映射到用户的兴趣和偏好）处理。这导致了对推荐系统的需求空前增加。推荐系统是信息过滤系统，它通过根据用户的兴趣、喜好以及对所需项目的评级，从大量动态生成的数据中过滤出重要的信息片段，以解决信息超载问题。",
    "tldr": "这项研究提出了一个基于人工智能的解决方案，用于解决推荐系统中的冷启动和数据稀疏问题，以应对信息超载带来的挑战。",
    "en_tdlr": "This study proposes an AI-based solution to address the cold start and data sparsity problems in recommendation systems, in order to tackle the challenges posed by information overload."
}