{
    "title": "Enlighten-Your-Voice: When Multimodal Meets Zero-shot Low-light Image Enhancement",
    "abstract": "Low-light image enhancement is a crucial visual task, and many unsupervised methods tend to overlook the degradation of visible information in low-light scenes, which adversely affects the fusion of complementary information and hinders the generation of satisfactory results. To address this, our study introduces \"Enlighten-Your-Voice\", a multimodal enhancement framework that innovatively enriches user interaction through voice and textual commands. This approach does not merely signify a technical leap but also represents a paradigm shift in user engagement. Our model is equipped with a Dual Collaborative Attention Module (DCAM) that meticulously caters to distinct content and color discrepancies, thereby facilitating nuanced enhancements. Complementarily, we introduce a Semantic Feature Fusion (SFM) plug-and-play module that synergizes semantic context with low-light enhancement operations, sharpening the algorithm's efficacy. Crucially, \"Enlighten-Your-Voice\" showcases remarkable ge",
    "link": "https://rss.arxiv.org/abs/2312.10109",
    "context": "Title: Enlighten-Your-Voice: When Multimodal Meets Zero-shot Low-light Image Enhancement\nAbstract: Low-light image enhancement is a crucial visual task, and many unsupervised methods tend to overlook the degradation of visible information in low-light scenes, which adversely affects the fusion of complementary information and hinders the generation of satisfactory results. To address this, our study introduces \"Enlighten-Your-Voice\", a multimodal enhancement framework that innovatively enriches user interaction through voice and textual commands. This approach does not merely signify a technical leap but also represents a paradigm shift in user engagement. Our model is equipped with a Dual Collaborative Attention Module (DCAM) that meticulously caters to distinct content and color discrepancies, thereby facilitating nuanced enhancements. Complementarily, we introduce a Semantic Feature Fusion (SFM) plug-and-play module that synergizes semantic context with low-light enhancement operations, sharpening the algorithm's efficacy. Crucially, \"Enlighten-Your-Voice\" showcases remarkable ge",
    "path": "papers/23/12/2312.10109.json",
    "total_tokens": 937,
    "translated_title": "Enlighten-Your-Voice: 当多模态遇上零样本低光图像增强技术",
    "translated_abstract": "低光图像增强是一项重要的视觉任务，许多无监督方法往往忽视了低光场景中可见信息的退化，这对于融合互补信息和生成满意的结果产生了不利影响。为了解决这个问题，本研究引入了\"Enlighten-Your-Voice\"，这是一个创新性的多模态增强框架，通过声音和文本命令丰富用户交互。这种方法不仅代表了技术的飞跃，而且代表了用户参与的范式转变。我们的模型配备了一个精确满足不同内容和颜色差异的双重协同注意模块(DCAM)，从而实现了细致入微的增强效果。另外，我们引入了一个语义特征融合(SFM)即插即用模块，将语义上下文与低光增强操作相结合，提高算法的效果。关键是，\"Enlighten-Your-Voice\"展示了卓越的性能。",
    "tldr": "\"Enlighten-Your-Voice\" 是一个创新的多模态增强框架，通过声音和文本命令丰富用户交互，并引入了双重协同注意模块和语义特征融合模块，以解决低光图像增强中的可见信息退化问题和提高增强效果。",
    "en_tdlr": "\"Enlighten-Your-Voice\" is an innovative multimodal enhancement framework that enriches user interaction through voice and textual commands. It introduces a Dual Collaborative Attention Module and a Semantic Feature Fusion module to address the degradation of visible information in low-light scenes and improve enhancement results."
}