{
    "title": "KnowledgeNavigator: Leveraging Large Language Models for Enhanced Reasoning over Knowledge Graph. (arXiv:2312.15880v2 [cs.CL] UPDATED)",
    "abstract": "Large language model (LLM) has achieved outstanding performance on various downstream tasks with its powerful natural language understanding and zero-shot capability, but LLM still suffers from knowledge limitation. Especially in scenarios that require long logical chains or complex reasoning, the hallucination and knowledge limitation of LLM limit its performance in question answering (QA). In this paper, we propose a novel framework KnowledgeNavigator to address these challenges by efficiently and accurately retrieving external knowledge from knowledge graph and using it as a key factor to enhance LLM reasoning. Specifically, KnowledgeNavigator first mines and enhances the potential constraints of the given question to guide the reasoning. Then it retrieves and filters external knowledge that supports answering through iterative reasoning on knowledge graph with the guidance of LLM and the question. Finally, KnowledgeNavigator constructs the structured knowledge into effective prompt",
    "link": "http://arxiv.org/abs/2312.15880",
    "context": "Title: KnowledgeNavigator: Leveraging Large Language Models for Enhanced Reasoning over Knowledge Graph. (arXiv:2312.15880v2 [cs.CL] UPDATED)\nAbstract: Large language model (LLM) has achieved outstanding performance on various downstream tasks with its powerful natural language understanding and zero-shot capability, but LLM still suffers from knowledge limitation. Especially in scenarios that require long logical chains or complex reasoning, the hallucination and knowledge limitation of LLM limit its performance in question answering (QA). In this paper, we propose a novel framework KnowledgeNavigator to address these challenges by efficiently and accurately retrieving external knowledge from knowledge graph and using it as a key factor to enhance LLM reasoning. Specifically, KnowledgeNavigator first mines and enhances the potential constraints of the given question to guide the reasoning. Then it retrieves and filters external knowledge that supports answering through iterative reasoning on knowledge graph with the guidance of LLM and the question. Finally, KnowledgeNavigator constructs the structured knowledge into effective prompt",
    "path": "papers/23/12/2312.15880.json",
    "total_tokens": 842,
    "translated_title": "KnowledgeNavigator: 利用大型语言模型增强知识图谱推理",
    "translated_abstract": "大型语言模型（LLM）以其强大的自然语言理解和零-shot能力，在各种下游任务上取得了出色的表现，但LLM仍然面临知识限制的问题。特别是在需要长逻辑链或复杂推理的场景中，LLM的幻想和知识限制限制了它在问答中的表现。在本文中，我们提出了一种新颖的框架KnowledgeNavigator，通过高效准确地检索知识图谱中的外部知识，并将其作为增强LLM推理的关键因素来解决这些挑战。具体而言，KnowledgeNavigator首先挖掘和增强给定问题的潜在约束以引导推理。然后，在LLM和问题的指导下，通过对知识图谱的迭代推理检索和过滤支持回答的外部知识。最后，KnowledgeNavigator将结构化知识构建成有效的提示。",
    "tldr": "KnowledgeNavigator是一种利用大型语言模型和知识图谱增强推理的框架，通过检索和过滤外部知识来解决LLM在长逻辑链和复杂推理场景中的知识限制问题。",
    "en_tdlr": "KnowledgeNavigator is a framework that leverages large language models and knowledge graphs to enhance reasoning by retrieving and filtering external knowledge, addressing the knowledge limitation issue of LLM in scenarios with long logical chains and complex reasoning."
}