{
    "title": "Autoencoder Based Face Verification System",
    "abstract": "The primary objective of this work is to present an alternative approach aimed at reducing the dependency on labeled data. Our proposed method involves utilizing autoencoder pre-training within a face image recognition task with two step processes. Initially, an autoencoder is trained in an unsupervised manner using a substantial amount of unlabeled training dataset. Subsequently, a deep learning model is trained with initialized parameters from the pre-trained autoencoder. This deep learning training process is conducted in a supervised manner, employing relatively limited labeled training dataset. During evaluation phase, face image embeddings is generated as the output of deep neural network layer. Our training is executed on the CelebA dataset, while evaluation is performed using benchmark face recognition datasets such as Labeled Faces in the Wild (LFW) and YouTube Faces (YTF). Experimental results demonstrate that by initializing the deep neural network with pre-trained autoencod",
    "link": "https://arxiv.org/abs/2312.14301",
    "context": "Title: Autoencoder Based Face Verification System\nAbstract: The primary objective of this work is to present an alternative approach aimed at reducing the dependency on labeled data. Our proposed method involves utilizing autoencoder pre-training within a face image recognition task with two step processes. Initially, an autoencoder is trained in an unsupervised manner using a substantial amount of unlabeled training dataset. Subsequently, a deep learning model is trained with initialized parameters from the pre-trained autoencoder. This deep learning training process is conducted in a supervised manner, employing relatively limited labeled training dataset. During evaluation phase, face image embeddings is generated as the output of deep neural network layer. Our training is executed on the CelebA dataset, while evaluation is performed using benchmark face recognition datasets such as Labeled Faces in the Wild (LFW) and YouTube Faces (YTF). Experimental results demonstrate that by initializing the deep neural network with pre-trained autoencod",
    "path": "papers/23/12/2312.14301.json",
    "total_tokens": 813,
    "translated_title": "基于自编码器的人脸验证系统",
    "translated_abstract": "本研究的主要目标是提出一种减少对标记数据依赖性的替代方法。我们提出的方法涉及在人脸图像识别任务中利用自编码器的预训练，采用两个步骤的过程。首先，使用大量无标签训练数据以无监督方式训练自编码器。随后，使用来自预训练自编码器的初始化参数来训练深度学习模型。这个深度学习训练过程以有监督方式进行，使用相对有限的标记训练数据。在评估阶段，生成人脸图像嵌入作为深度神经网络层的输出。我们在CelebA数据集上进行了训练，而评估则使用了诸如Labeled Faces in the Wild (LFW)和YouTube Faces (YTF)等基准人脸识别数据集。实验结果表明，通过使用预训练的自编码器来初始化深度神经网络，可以达到较好的效果。",
    "tldr": "这篇论文提出了一种基于自编码器的人脸验证系统，通过使用预训练的自编码器初始化深度神经网络，实现对标记数据依赖性的减少，在人脸图像识别任务中取得了较好的效果。"
}