{
    "title": "AdaNAS: Adaptively Post-processing with Self-supervised Neural Architecture Search for Ensemble Rainfall Forecasts",
    "abstract": "Previous post-processing studies on rainfall forecasts using numerical weather prediction (NWP) mainly focus on statistics-based aspects, while learning-based aspects are rarely investigated. Although some manually-designed models are proposed to raise accuracy, they are customized networks, which need to be repeatedly tried and verified, at a huge cost in time and labor. Therefore, a self-supervised neural architecture search (NAS) method without significant manual efforts called AdaNAS is proposed in this study to perform rainfall forecast post-processing and predict rainfall with high accuracy. In addition, we design a rainfall-aware search space to significantly improve forecasts for high-rainfall areas. Furthermore, we propose a rainfall-level regularization function to eliminate the effect of noise data during the training. Validation experiments have been performed under the cases of \\emph{None}, \\emph{Light}, \\emph{Moderate}, \\emph{Heavy} and \\emph{Violent} on a large-scale pre",
    "link": "https://arxiv.org/abs/2312.16046",
    "context": "Title: AdaNAS: Adaptively Post-processing with Self-supervised Neural Architecture Search for Ensemble Rainfall Forecasts\nAbstract: Previous post-processing studies on rainfall forecasts using numerical weather prediction (NWP) mainly focus on statistics-based aspects, while learning-based aspects are rarely investigated. Although some manually-designed models are proposed to raise accuracy, they are customized networks, which need to be repeatedly tried and verified, at a huge cost in time and labor. Therefore, a self-supervised neural architecture search (NAS) method without significant manual efforts called AdaNAS is proposed in this study to perform rainfall forecast post-processing and predict rainfall with high accuracy. In addition, we design a rainfall-aware search space to significantly improve forecasts for high-rainfall areas. Furthermore, we propose a rainfall-level regularization function to eliminate the effect of noise data during the training. Validation experiments have been performed under the cases of \\emph{None}, \\emph{Light}, \\emph{Moderate}, \\emph{Heavy} and \\emph{Violent} on a large-scale pre",
    "path": "papers/23/12/2312.16046.json",
    "total_tokens": 896,
    "translated_title": "AdaNAS：自我监督的神经架构搜索用于集合降雨预报的自适应后处理方法",
    "translated_abstract": "以往关于数值天气预报(NWP)降雨预报的后处理研究主要关注统计方面的内容，较少涉及基于学习的方面。虽然一些手动设计的模型被提出来提高准确性，但它们是定制的网络，需要反复尝试和验证，耗费大量的时间和人力成本。因此，本研究提出了一种无需重要手动工作的自我监督神经架构搜索(NAS)方法，称为AdaNAS，用于进行降雨预报后处理和高准确性的降雨预测。此外，我们设计了一个面向降雨的搜索空间，显著改进了高降雨区域的预报。此外，还提出了一个降雨层级规则化函数，以消除训练过程中噪声数据的影响。在大规模预测实验中，根据\\emph{无雨}，\\emph{小雨}，\\emph{中雨}，\\emph{大雨}和\\emph{暴雨}的情况进行了验证。",
    "tldr": "AdaNAS是一个自适应后处理方法，利用自我监督神经架构搜索对集合降雨预报进行处理，能够提高降雨预测的准确性。它采用面向降雨的搜索空间和降雨层级规则化函数，有效消除噪声数据的影响。"
}