{
    "title": "Emergence and Causality in Complex Systems: A Survey on Causal Emergence and Related Quantitative Studies",
    "abstract": "Emergence and causality are two fundamental concepts for understanding complex systems. They are interconnected. On one hand, emergence refers to the phenomenon where macroscopic properties cannot be solely attributed to the cause of individual properties. On the other hand, causality can exhibit emergence, meaning that new causal laws may arise as we increase the level of abstraction. Causal emergence theory aims to bridge these two concepts and even employs measures of causality to quantify emergence. This paper provides a comprehensive review of recent advancements in quantitative theories and applications of causal emergence. Two key problems are addressed: quantifying causal emergence and identifying it in data. Addressing the latter requires the use of machine learning techniques, thus establishing a connection between causal emergence and artificial intelligence. We highlighted that the architectures used for identifying causal emergence are shared by causal representation learn",
    "link": "https://arxiv.org/abs/2312.16815",
    "context": "Title: Emergence and Causality in Complex Systems: A Survey on Causal Emergence and Related Quantitative Studies\nAbstract: Emergence and causality are two fundamental concepts for understanding complex systems. They are interconnected. On one hand, emergence refers to the phenomenon where macroscopic properties cannot be solely attributed to the cause of individual properties. On the other hand, causality can exhibit emergence, meaning that new causal laws may arise as we increase the level of abstraction. Causal emergence theory aims to bridge these two concepts and even employs measures of causality to quantify emergence. This paper provides a comprehensive review of recent advancements in quantitative theories and applications of causal emergence. Two key problems are addressed: quantifying causal emergence and identifying it in data. Addressing the latter requires the use of machine learning techniques, thus establishing a connection between causal emergence and artificial intelligence. We highlighted that the architectures used for identifying causal emergence are shared by causal representation learn",
    "path": "papers/23/12/2312.16815.json",
    "total_tokens": 831,
    "translated_title": "复杂系统中的出现和因果关系：关于因果出现和相关定量研究的调查",
    "translated_abstract": "出现和因果关系是理解复杂系统的两个基本概念，它们是相互关联的。出现一方面指的是宏观属性不能仅归因于个体属性的原因。另一方面，因果关系可以表现出出现，意味着随着抽象层次的增加，可能会出现新的因果定律。因果出现理论旨在连接这两个概念，甚至采用因果度量来量化出现。本文综述了因果出现定量理论和应用的最新进展。重点解决了两个关键问题：量化因果出现和在数据中识别因果出现。解决后者需要使用机器学习技术，从而建立了因果出现与人工智能之间的联系。我们强调了用于识别因果出现的架构与因果表示学习的共享。",
    "tldr": "本文综述了关于因果出现和相关定量研究的最新进展，重点解决了量化因果出现和在数据中识别因果出现的两个问题，并建立了因果出现与人工智能之间的联系。",
    "en_tdlr": "This paper provides a comprehensive review of recent advancements in quantitative theories and applications of causal emergence, addressing two key problems of quantifying causal emergence and identifying it in data. It establishes a connection between causal emergence and artificial intelligence."
}