{
    "title": "STEAM & MoSAFE: SOTIF Error-and-Failure Model & Analysis for AI-Enabled Driving Automation. (arXiv:2312.09559v2 [cs.LG] UPDATED)",
    "abstract": "Driving Automation Systems (DAS) are subject to complex road environments and vehicle behaviors and increasingly rely on sophisticated sensors and Artificial Intelligence (AI). These properties give rise to unique safety faults stemming from specification insufficiencies and technological performance limitations, where sensors and AI introduce errors that vary in magnitude and temporal patterns, posing potential safety risks. The Safety of the Intended Functionality (SOTIF) standard emerges as a promising framework for addressing these concerns, focusing on scenario-based analysis to identify hazardous behaviors and their causes. Although the current standard provides a basic cause-and-effect model and high-level process guidance, it lacks concepts required to identify and evaluate hazardous errors, especially within the context of AI.  This paper introduces two key contributions to bridge this gap. First, it defines the SOTIF Temporal Error and Failure Model (STEAM) as a refinement of",
    "link": "http://arxiv.org/abs/2312.09559",
    "context": "Title: STEAM & MoSAFE: SOTIF Error-and-Failure Model & Analysis for AI-Enabled Driving Automation. (arXiv:2312.09559v2 [cs.LG] UPDATED)\nAbstract: Driving Automation Systems (DAS) are subject to complex road environments and vehicle behaviors and increasingly rely on sophisticated sensors and Artificial Intelligence (AI). These properties give rise to unique safety faults stemming from specification insufficiencies and technological performance limitations, where sensors and AI introduce errors that vary in magnitude and temporal patterns, posing potential safety risks. The Safety of the Intended Functionality (SOTIF) standard emerges as a promising framework for addressing these concerns, focusing on scenario-based analysis to identify hazardous behaviors and their causes. Although the current standard provides a basic cause-and-effect model and high-level process guidance, it lacks concepts required to identify and evaluate hazardous errors, especially within the context of AI.  This paper introduces two key contributions to bridge this gap. First, it defines the SOTIF Temporal Error and Failure Model (STEAM) as a refinement of",
    "path": "papers/23/12/2312.09559.json",
    "total_tokens": 965,
    "translated_title": "STEAM & MoSAFE: AI-Enabled Driving Automation的SOTIF错误与故障模型分析",
    "translated_abstract": "驾驶自动化系统(DAS)受复杂的道路环境和车辆行为的影响，越来越依赖于先进的传感器和人工智能(AI)。这些特性导致了源自规范不足和技术性能限制的特殊安全故障，其中传感器和AI引入的错误在大小和时间模式上变化，可能造成安全风险。安全的预期功能性(SOTIF)标准是应对这些问题的一种有希望的框架，专注于基于场景的分析以识别危险行为及其原因。尽管当前的标准提供了基本的因果模型和高级流程指导，但在AI的上下文中，它缺乏用于识别和评估危险错误的概念。本文提出了两个关键贡献来填补这一差距。首先，它将SOTIF时间误差与故障模型(STEAM)定义为一种细化的模型，包括用于描述AI引起的各种错误的要素。通过这一模型，可以更好地评估AI驱动的驾驶自动化系统中的安全风险。",
    "tldr": "本文通过定义SOTIF时间误差与故障模型(STEAM)，填补了现有标准中在识别和评估AI引起的危险错误方面的不足，以更好地评估AI驱动的驾驶自动化系统中的安全风险。",
    "en_tdlr": "This paper bridges the gap in identifying and evaluating hazardous errors caused by AI in the context of driving automation systems by introducing the SOTIF Temporal Error and Failure Model (STEAM), enabling better assessment of safety risks in AI-enabled driving automation systems."
}