{
    "title": "Rapid Motor Adaptation for Robotic Manipulator Arms",
    "abstract": "arXiv:2312.04670v2 Announce Type: replace-cross  Abstract: Developing generalizable manipulation skills is a core challenge in embodied AI. This includes generalization across diverse task configurations, encompassing variations in object shape, density, friction coefficient, and external disturbances such as forces applied to the robot. Rapid Motor Adaptation (RMA) offers a promising solution to this challenge. It posits that essential hidden variables influencing an agent's task performance, such as object mass and shape, can be effectively inferred from the agent's action and proprioceptive history. Drawing inspiration from RMA in locomotion and in-hand rotation, we use depth perception to develop agents tailored for rapid motor adaptation in a variety of manipulation tasks. We evaluated our agents on four challenging tasks from the Maniskill2 benchmark, namely pick-and-place operations with hundreds of objects from the YCB and EGAD datasets, peg insertion with precise position and ",
    "link": "https://arxiv.org/abs/2312.04670",
    "context": "Title: Rapid Motor Adaptation for Robotic Manipulator Arms\nAbstract: arXiv:2312.04670v2 Announce Type: replace-cross  Abstract: Developing generalizable manipulation skills is a core challenge in embodied AI. This includes generalization across diverse task configurations, encompassing variations in object shape, density, friction coefficient, and external disturbances such as forces applied to the robot. Rapid Motor Adaptation (RMA) offers a promising solution to this challenge. It posits that essential hidden variables influencing an agent's task performance, such as object mass and shape, can be effectively inferred from the agent's action and proprioceptive history. Drawing inspiration from RMA in locomotion and in-hand rotation, we use depth perception to develop agents tailored for rapid motor adaptation in a variety of manipulation tasks. We evaluated our agents on four challenging tasks from the Maniskill2 benchmark, namely pick-and-place operations with hundreds of objects from the YCB and EGAD datasets, peg insertion with precise position and ",
    "path": "papers/23/12/2312.04670.json",
    "total_tokens": 832,
    "translated_title": "机器人操纵臂的快速电机适应性",
    "translated_abstract": "开发通用机器人操作技能是体现人工智能的核心挑战。这包括跨越各种任务配置的泛化，涵盖了对象形状、密度、摩擦系数的变化以及外部干扰，如施加在机器人身上的力。快速电机适应性（Rapid Motor Adaptation，RMA）为这一挑战提供了一个有前景的解决方案。它认为，影响智能体任务表现的基本隐变量，如对象质量和形状，可以从智能体的动作和本体感性历史中有效地推断出来。我们借鉴了在移动和手内旋转中的RMA，利用深度感知来开发针对各种操纵任务的快速电机适应性代理。我们在Maniskill2基准测试中对我们的代理进行了评估，这些任务包括从YCB和EGAD数据集中数百个对象的取放操作，以及精确定位和",
    "tldr": "快速电机适应性（RMA）为机器人操作技能的泛化提出了解决方案，利用深度感知开发了针对各种操纵任务的代理。",
    "en_tdlr": "RMA provides a solution for generalizing robotic manipulation skills, and agents tailored for various manipulation tasks are developed using depth perception."
}