{
    "title": "Do LLM Agents Exhibit Social Behavior?",
    "abstract": "arXiv:2312.15198v2 Announce Type: replace  Abstract: The advances of Large Language Models (LLMs) are expanding their utility in both academic research and practical applications. Recent social science research has explored the use of these ``black-box'' LLM agents for simulating complex social systems and potentially substituting human subjects in experiments. Our study delves into this emerging domain, investigating the extent to which LLMs exhibit key social interaction principles, such as social learning, social preference, and cooperative behavior (indirect reciprocity), in their interactions with humans and other agents. We develop a framework for our study, wherein classical laboratory experiments involving human subjects are adapted to use LLM agents. This approach involves step-by-step reasoning that mirrors human cognitive processes and zero-shot learning to assess the innate preferences of LLMs. Our analysis of LLM agents' behavior includes both the primary effects and an in",
    "link": "https://arxiv.org/abs/2312.15198",
    "context": "Title: Do LLM Agents Exhibit Social Behavior?\nAbstract: arXiv:2312.15198v2 Announce Type: replace  Abstract: The advances of Large Language Models (LLMs) are expanding their utility in both academic research and practical applications. Recent social science research has explored the use of these ``black-box'' LLM agents for simulating complex social systems and potentially substituting human subjects in experiments. Our study delves into this emerging domain, investigating the extent to which LLMs exhibit key social interaction principles, such as social learning, social preference, and cooperative behavior (indirect reciprocity), in their interactions with humans and other agents. We develop a framework for our study, wherein classical laboratory experiments involving human subjects are adapted to use LLM agents. This approach involves step-by-step reasoning that mirrors human cognitive processes and zero-shot learning to assess the innate preferences of LLMs. Our analysis of LLM agents' behavior includes both the primary effects and an in",
    "path": "papers/23/12/2312.15198.json",
    "total_tokens": 858,
    "translated_title": "LLM代理表现出社会行为吗？",
    "translated_abstract": "大型语言模型（LLMs）的进展正在扩大它们在学术研究和实际应用中的效用。最近的社会科学研究探讨了使用这些“黑匣子”LLM代理来模拟复杂社会系统并潜在地替代人类实验对象的可能性。我们的研究深入探讨了这一新兴领域，调查了LLMs在与人类和其他代理进行互动时展示社会学习、社会偏好和合作行为（间接互惠）等关键社会交互原则的程度。我们为我们的研究制定了一个框架，其中涉及将涉及人类实验对象的经典实验调整为使用LLM代理。这种方法涉及一步一步的推理，模拟人类认知过程和零样本学习，以评估LLMs的天生偏好。我们对LLM代理行为的分析包括主要效应和次要效应。",
    "tldr": "研究探讨了LLM代理在与人类和其他代理互动时展示的社会行为，包括社会学习、社会偏好和合作行为，并开发了一个框架来评估它们与人类实验对象的互动。",
    "en_tdlr": "The study investigates the social behavior exhibited by LLM agents in interactions with humans and other agents, including social learning, social preference, and cooperative behavior, developing a framework to assess their interactions with human subjects."
}