{
    "title": "Offloading and Quality Control for AI Generated Content Services in 6G Mobile Edge Computing Networks",
    "abstract": "arXiv:2312.06203v2 Announce Type: replace  Abstract: AI-Generated Content (AIGC), as a novel manner of providing Metaverse services in the forthcoming Internet paradigm, can resolve the obstacles of immersion requirements. Concurrently, edge computing, as an evolutionary paradigm of computing in communication systems, effectively augments real-time interactive services. In pursuit of enhancing the accessibility of AIGC services, the deployment of AIGC models (e.g., diffusion models) to edge servers and local devices has become a prevailing trend. Nevertheless, this approach faces constraints imposed by battery life and computational resources when tasks are offloaded to local devices, limiting the capacity to deliver high-quality content to users while adhering to stringent latency requirements. So there will be a tradeoff between the utility of AIGC models and offloading decisions in the edge computing paradigm. This paper proposes a joint optimization algorithm for offloading decisio",
    "link": "https://arxiv.org/abs/2312.06203",
    "context": "Title: Offloading and Quality Control for AI Generated Content Services in 6G Mobile Edge Computing Networks\nAbstract: arXiv:2312.06203v2 Announce Type: replace  Abstract: AI-Generated Content (AIGC), as a novel manner of providing Metaverse services in the forthcoming Internet paradigm, can resolve the obstacles of immersion requirements. Concurrently, edge computing, as an evolutionary paradigm of computing in communication systems, effectively augments real-time interactive services. In pursuit of enhancing the accessibility of AIGC services, the deployment of AIGC models (e.g., diffusion models) to edge servers and local devices has become a prevailing trend. Nevertheless, this approach faces constraints imposed by battery life and computational resources when tasks are offloaded to local devices, limiting the capacity to deliver high-quality content to users while adhering to stringent latency requirements. So there will be a tradeoff between the utility of AIGC models and offloading decisions in the edge computing paradigm. This paper proposes a joint optimization algorithm for offloading decisio",
    "path": "papers/23/12/2312.06203.json",
    "total_tokens": 816,
    "translated_title": "在6G移动边缘计算网络中，AI生成内容服务的卸载和质量控制",
    "translated_abstract": "AI生成内容(AIGC)作为在即将到来的互联网范式中提供Metaverse服务的新颖方式，可以解决沉浸需求的障碍。同时，边缘计算作为通信系统中的计算进化范式，有效增强了实时交互服务。为了提高AIGC服务的可访问性，将AIGC模型（如扩散模型）部署到边缘服务器和本地设备已成为一种盛行趋势。然而，当任务卸载到本地设备时，面临的约束包括电池寿命和计算资源，限制了在遵守严格的延迟要求的同时向用户提供高质量内容的能力。因此，在边缘计算范式中，AIGC模型的效用和卸载决策之间将存在权衡。本文提出了一种用于卸载决策的联合优化算法。",
    "tldr": "该论文提出了在6G移动边缘计算网络中针对AI生成内容服务的卸载和质量控制问题的联合优化算法。",
    "en_tdlr": "This paper proposes a joint optimization algorithm for offloading and quality control of AI-generated content services in 6G mobile edge computing networks."
}