{
    "title": "DeRDaVa: Deletion-Robust Data Valuation for Machine Learning. (arXiv:2312.11413v2 [cs.LG] UPDATED)",
    "abstract": "Data valuation is concerned with determining a fair valuation of data from data sources to compensate them or to identify training examples that are the most or least useful for predictions. With the rising interest in personal data ownership and data protection regulations, model owners will likely have to fulfil more data deletion requests. This raises issues that have not been addressed by existing works: Are the data valuation scores still fair with deletions? Must the scores be expensively recomputed? The answer is no. To avoid recomputations, we propose using our data valuation framework DeRDaVa upfront for valuing each data source's contribution to preserving robust model performance after anticipated data deletions. DeRDaVa can be efficiently approximated and will assign higher values to data that are more useful or less likely to be deleted. We further generalize DeRDaVa to Risk-DeRDaVa to cater to risk-averse/seeking model owners who are concerned with the worst/best-cases mo",
    "link": "http://arxiv.org/abs/2312.11413",
    "context": "Title: DeRDaVa: Deletion-Robust Data Valuation for Machine Learning. (arXiv:2312.11413v2 [cs.LG] UPDATED)\nAbstract: Data valuation is concerned with determining a fair valuation of data from data sources to compensate them or to identify training examples that are the most or least useful for predictions. With the rising interest in personal data ownership and data protection regulations, model owners will likely have to fulfil more data deletion requests. This raises issues that have not been addressed by existing works: Are the data valuation scores still fair with deletions? Must the scores be expensively recomputed? The answer is no. To avoid recomputations, we propose using our data valuation framework DeRDaVa upfront for valuing each data source's contribution to preserving robust model performance after anticipated data deletions. DeRDaVa can be efficiently approximated and will assign higher values to data that are more useful or less likely to be deleted. We further generalize DeRDaVa to Risk-DeRDaVa to cater to risk-averse/seeking model owners who are concerned with the worst/best-cases mo",
    "path": "papers/23/12/2312.11413.json",
    "total_tokens": 969,
    "translated_title": "DeRDaVa: 机器学习中的删除鲁棒数据估值",
    "translated_abstract": "数据估值涉及确定在预测中对数据源进行公平估价以补偿它们，或确定最有用或最无用的训练样本。随着个人数据所有权和数据保护法规的增加，模型所有者可能需要满足更多的数据删除请求。这引发了现有工作尚未解决的问题：删除后数据估值分数是否仍然公平？是否必须昂贵地重新计算分数？答案是否定的。为了避免重新计算，我们提出在预测删除后保持模型性能的前提下，使用我们的数据估值框架DeRDaVa来对每个数据源的贡献进行估值。DeRDaVa可以高效地近似，并给更有用或更不容易被删除的数据分配更高的值。我们进一步推广了DeRDaVa到Risk-DeRDaVa，以满足对最坏/最好情况感到风险厌恶/寻求的模型所有者的需求。",
    "tldr": "提出了DeRDaVa：一种适用于机器学习的删除鲁棒数据估值框架。通过在预测删除后保持模型性能的前提下对每个数据源的贡献进行估值，避免了昂贵的重新计算。推广到Risk-DeRDaVa以满足对最坏/最好情况感到风险厌恶/寻求的模型所有者的需求。",
    "en_tdlr": "DeRDaVa: A deletion-robust data valuation framework for machine learning. It avoids expensive recomputations by valuing the contribution of each data source in preserving model performance after data deletions. Generalized to Risk-DeRDaVa to cater to risk-averse/seeking model owners' needs."
}