{
    "title": "Interpretable Causal Inference for Analyzing Wearable, Sensor, and Distributional Data",
    "abstract": "arXiv:2312.10569v2 Announce Type: replace  Abstract: Many modern causal questions ask how treatments affect complex outcomes that are measured using wearable devices and sensors. Current analysis approaches require summarizing these data into scalar statistics (e.g., the mean), but these summaries can be misleading. For example, disparate distributions can have the same means, variances, and other statistics. Researchers can overcome the loss of information by instead representing the data as distributions. We develop an interpretable method for distributional data analysis that ensures trustworthy and robust decision-making: Analyzing Distributional Data via Matching After Learning to Stretch (ADD MALTS). We (i) provide analytical guarantees of the correctness of our estimation strategy, (ii) demonstrate via simulation that ADD MALTS outperforms other distributional data analysis methods at estimating treatment effects, and (iii) illustrate ADD MALTS' ability to verify whether there i",
    "link": "https://arxiv.org/abs/2312.10569",
    "context": "Title: Interpretable Causal Inference for Analyzing Wearable, Sensor, and Distributional Data\nAbstract: arXiv:2312.10569v2 Announce Type: replace  Abstract: Many modern causal questions ask how treatments affect complex outcomes that are measured using wearable devices and sensors. Current analysis approaches require summarizing these data into scalar statistics (e.g., the mean), but these summaries can be misleading. For example, disparate distributions can have the same means, variances, and other statistics. Researchers can overcome the loss of information by instead representing the data as distributions. We develop an interpretable method for distributional data analysis that ensures trustworthy and robust decision-making: Analyzing Distributional Data via Matching After Learning to Stretch (ADD MALTS). We (i) provide analytical guarantees of the correctness of our estimation strategy, (ii) demonstrate via simulation that ADD MALTS outperforms other distributional data analysis methods at estimating treatment effects, and (iii) illustrate ADD MALTS' ability to verify whether there i",
    "path": "papers/23/12/2312.10569.json",
    "total_tokens": 801,
    "translated_title": "适用于分析可穿戴设备、传感器和分布数据的可解释因果推断",
    "translated_abstract": "许多现代因果问题都涉及到治疗如何影响通过可穿戴设备和传感器测量的复杂结果。当前的分析方法要求将这些数据汇总为标量统计数据（例如均值），但这些汇总可能具有误导性。研究人员可以通过将数据表示为分布来克服信息丢失问题。我们开发了一种适用于分布数据分析的可解释方法，确保了值得信赖和稳健的决策制定：通过学习拉伸后匹配的分布数据分析（ADD MALTS）。我们（i）提供了对我们估计策略正确性的分析保证，（ii）通过模拟表明ADD MALTS在估计处理效果方面优于其他分布数据分析方法，并（iii）展示了ADD MALTS验证是否存在比较",
    "tldr": "提出了一种适用于分布数据分析的可解释方法 ADD MALTS，有助于确保可靠和稳健的决策制定，能够优于其他方法估计处理效果",
    "en_tdlr": "Proposed an interpretable method ADD MALTS for analyzing distributional data, which helps ensure trustworthy and robust decision-making and outperforms other methods in estimating treatment effects."
}