{
    "title": "Unlocking Pre-trained Image Backbones for Semantic Image Synthesis. (arXiv:2312.13314v2 [cs.CV] UPDATED)",
    "abstract": "Semantic image synthesis, i.e., generating images from user-provided semantic label maps, is an important conditional image generation task as it allows to control both the content as well as the spatial layout of generated images. Although diffusion models have pushed the state of the art in generative image modeling, the iterative nature of their inference process makes them computationally demanding. Other approaches such as GANs are more efficient as they only need a single feed-forward pass for generation, but the image quality tends to suffer on large and diverse datasets. In this work, we propose a new class of GAN discriminators for semantic image synthesis that generates highly realistic images by exploiting feature backbone networks pre-trained for tasks such as image classification. We also introduce a new generator architecture with better context modeling and using cross-attention to inject noise into latent variables, leading to more diverse generated images. Our model, w",
    "link": "http://arxiv.org/abs/2312.13314",
    "context": "Title: Unlocking Pre-trained Image Backbones for Semantic Image Synthesis. (arXiv:2312.13314v2 [cs.CV] UPDATED)\nAbstract: Semantic image synthesis, i.e., generating images from user-provided semantic label maps, is an important conditional image generation task as it allows to control both the content as well as the spatial layout of generated images. Although diffusion models have pushed the state of the art in generative image modeling, the iterative nature of their inference process makes them computationally demanding. Other approaches such as GANs are more efficient as they only need a single feed-forward pass for generation, but the image quality tends to suffer on large and diverse datasets. In this work, we propose a new class of GAN discriminators for semantic image synthesis that generates highly realistic images by exploiting feature backbone networks pre-trained for tasks such as image classification. We also introduce a new generator architecture with better context modeling and using cross-attention to inject noise into latent variables, leading to more diverse generated images. Our model, w",
    "path": "papers/23/12/2312.13314.json",
    "total_tokens": 774,
    "translated_title": "解锁预训练的图像骨干用于语义图像合成",
    "translated_abstract": "语义图像合成是一项重要的条件性图像生成任务，它可以通过用户提供的语义标签图生成图像，同时控制生成图像的内容和空间布局。本文提出了一种新的GAN鉴别器类别，用于语义图像合成，通过利用预训练的图像分类任务的特征骨干网络生成高度逼真的图像。同时，我们还引入了一种新的生成器架构，具有更好的上下文建模能力，并使用交叉注意力将噪声注入潜变量，从而生成更多样化的图像。",
    "tldr": "本文提出了一种新的GAN鉴别器类别，利用预训练的图像分类任务的特征骨干网络生成高度逼真的图像，并引入了更好的上下文建模和交叉注意力技术，生成更多样化的图像。",
    "en_tdlr": "This paper proposes a new class of GAN discriminators for semantic image synthesis that generates highly realistic images by exploiting feature backbone networks pre-trained for tasks such as image classification. It also introduces a new generator architecture with better context modeling and cross-attention, leading to more diverse generated images."
}