{
    "title": "POND: Multi-Source Time Series Domain Adaptation with Information-Aware Prompt Tuning",
    "abstract": "arXiv:2312.12276v2 Announce Type: replace Abstract: Time series domain adaptation stands as a pivotal and intricate challenge with diverse applications, including but not limited to human activity recognition, sleep stage classification, and machine fault diagnosis. Despite the numerous domain adaptation techniques proposed to tackle this complex problem, they primarily focus on domain adaptation from a single source domain. Yet, it is more crucial to investigate domain adaptation from multiple domains due to the potential for greater improvements. To address this, three important challenges need to be overcome: 1). The lack of exploration to utilize domain-specific information for domain adaptation, 2). The difficulty to learn domain-specific information that changes over time, and 3). The difficulty to evaluate learned domain-specific information. In order to tackle these challenges simultaneously, in this paper, we introduce PrOmpt-based domaiN Discrimination (POND), the first frame",
    "link": "https://arxiv.org/abs/2312.12276",
    "context": "Title: POND: Multi-Source Time Series Domain Adaptation with Information-Aware Prompt Tuning\nAbstract: arXiv:2312.12276v2 Announce Type: replace Abstract: Time series domain adaptation stands as a pivotal and intricate challenge with diverse applications, including but not limited to human activity recognition, sleep stage classification, and machine fault diagnosis. Despite the numerous domain adaptation techniques proposed to tackle this complex problem, they primarily focus on domain adaptation from a single source domain. Yet, it is more crucial to investigate domain adaptation from multiple domains due to the potential for greater improvements. To address this, three important challenges need to be overcome: 1). The lack of exploration to utilize domain-specific information for domain adaptation, 2). The difficulty to learn domain-specific information that changes over time, and 3). The difficulty to evaluate learned domain-specific information. In order to tackle these challenges simultaneously, in this paper, we introduce PrOmpt-based domaiN Discrimination (POND), the first frame",
    "path": "papers/23/12/2312.12276.json",
    "total_tokens": 732,
    "translated_title": "POND: 带有信息感知提示调整的多源时间序列领域适应",
    "translated_abstract": "时间序列领域适应是一个关键而复杂的挑战，具有各种应用，包括人体活动识别、睡眠阶段分类和机器故障诊断等。尽管已经提出了许多领域适应技术来应对这个复杂问题，但它们主要集中在单个源领域的领域适应上。然而，探索来自多个领域的领域适应更为关键，因为它有潜力带来更大的改进。为了同时解决这些挑战，本文提出了基于提示的领域判别（POND），这是第一个可以利用领域特定信息进行领域适应的方法。",
    "tldr": "POND是第一个可以利用领域特定信息进行多源时间序列领域适应的方法。"
}