{
    "title": "WATonoBus: An All Weather Autonomous Shuttle",
    "abstract": "arXiv:2312.00938v1 Announce Type: cross  Abstract: Autonomous vehicle all-weather operation poses significant challenges, encompassing modules from perception and decision-making to path planning and control. The complexity arises from the need to address adverse weather conditions like rain, snow, and fog across the autonomy stack. Conventional model-based and single-module approaches often lack holistic integration with upstream or downstream tasks. We tackle this problem by proposing a multi-module and modular system architecture with considerations for adverse weather across the perception level, through features such as snow covered curb detection, to decision-making and safety monitoring. Through daily weekday service on the WATonoBus platform for almost a year, we demonstrate that our proposed approach is capable of addressing adverse weather conditions and provide valuable learning from edge cases observed during operation.",
    "link": "https://arxiv.org/abs/2312.00938",
    "context": "Title: WATonoBus: An All Weather Autonomous Shuttle\nAbstract: arXiv:2312.00938v1 Announce Type: cross  Abstract: Autonomous vehicle all-weather operation poses significant challenges, encompassing modules from perception and decision-making to path planning and control. The complexity arises from the need to address adverse weather conditions like rain, snow, and fog across the autonomy stack. Conventional model-based and single-module approaches often lack holistic integration with upstream or downstream tasks. We tackle this problem by proposing a multi-module and modular system architecture with considerations for adverse weather across the perception level, through features such as snow covered curb detection, to decision-making and safety monitoring. Through daily weekday service on the WATonoBus platform for almost a year, we demonstrate that our proposed approach is capable of addressing adverse weather conditions and provide valuable learning from edge cases observed during operation.",
    "path": "papers/23/12/2312.00938.json",
    "total_tokens": 820,
    "translated_title": "WATonoBus：一种全天候自动巡航车",
    "translated_abstract": "自动驾驶车辆在全天候运行中面临显著挑战，涵盖了从感知和决策到路径规划和控制的各个模块。复杂性源于需要解决像雨、雪和雾等恶劣天气条件在自主性堆栈中的问题。传统的基于模型和单模块方法通常缺乏与上游或下游任务的整体集成。我们通过提出一个考虑恶劣天气的多模块和模块化系统架构来解决这个问题，涵盖了从感知水平到决策和安全监测的各个方面，例如覆盖雪的路缘检测。通过在WATonoBus平台上每周日常服务近一年，我们展示了我们提出的方法能够解决恶劣天气条件，并从运营中观察到的极端情况中获得宝贵的经验教训。",
    "tldr": "提出了一种考虑恶劣天气的多模块和模块化系统架构，在WATonoBus平台上进行了实际测试，证明其能够解决全天候自动驾驶车辆面临的挑战",
    "en_tdlr": "Proposed a multi-module and modular system architecture considering adverse weather conditions, demonstrated on the WATonoBus platform showing capability to address challenges in all-weather autonomous driving operations."
}