{
    "title": "Knowledge Graph Reasoning Based on Attention GCN. (arXiv:2312.10049v2 [cs.IR] UPDATED)",
    "abstract": "We propose a novel technique to enhance Knowledge Graph Reasoning by combining Graph Convolution Neural Network (GCN) with the Attention Mechanism. This approach utilizes the Attention Mechanism to examine the relationships between entities and their neighboring nodes, which helps to develop detailed feature vectors for each entity. The GCN uses shared parameters to effectively represent the characteristics of adjacent entities. We first learn the similarity of entities for node representation learning. By integrating the attributes of the entities and their interactions, this method generates extensive implicit feature vectors for each entity, improving performance in tasks including entity classification and link prediction, outperforming traditional neural network models. To conclude, this work provides crucial methodological support for a range of applications, such as search engines, question-answering systems, recommendation systems, and data integration tasks.",
    "link": "http://arxiv.org/abs/2312.10049",
    "context": "Title: Knowledge Graph Reasoning Based on Attention GCN. (arXiv:2312.10049v2 [cs.IR] UPDATED)\nAbstract: We propose a novel technique to enhance Knowledge Graph Reasoning by combining Graph Convolution Neural Network (GCN) with the Attention Mechanism. This approach utilizes the Attention Mechanism to examine the relationships between entities and their neighboring nodes, which helps to develop detailed feature vectors for each entity. The GCN uses shared parameters to effectively represent the characteristics of adjacent entities. We first learn the similarity of entities for node representation learning. By integrating the attributes of the entities and their interactions, this method generates extensive implicit feature vectors for each entity, improving performance in tasks including entity classification and link prediction, outperforming traditional neural network models. To conclude, this work provides crucial methodological support for a range of applications, such as search engines, question-answering systems, recommendation systems, and data integration tasks.",
    "path": "papers/23/12/2312.10049.json",
    "total_tokens": 880,
    "translated_title": "基于注意力GCN的知识图谱推理",
    "translated_abstract": "我们提出了一种新颖的技术，通过将图卷积神经网络（GCN）与注意力机制相结合来增强知识图谱推理。该方法利用注意力机制来检查实体之间及其邻居节点之间的关系，从而为每个实体开发详细的特征向量。GCN使用共享参数有效地表示相邻实体的特征。我们首先学习实体之间的相似度，以进行节点表示学习。通过整合实体的属性和它们的相互作用，该方法为每个实体生成了丰富的隐式特征向量，提高了实体分类和链接预测等任务的性能，优于传统的神经网络模型。总之，这项工作为搜索引擎、问答系统、推荐系统和数据整合任务等多个应用领域提供了重要的方法支持。",
    "tldr": "本论文通过将图卷积神经网络（GCN）与注意力机制相结合，提出了一种新颖的技术来增强知识图谱推理，通过检查实体之间及其邻居节点之间的关系以及整合实体的属性和相互作用，生成丰富的隐式特征向量，以提高实体分类和链接预测等任务的性能。",
    "en_tdlr": "This paper proposes a novel technique to enhance Knowledge Graph Reasoning by combining Graph Convolution Neural Network (GCN) with the Attention Mechanism. It utilizes the Attention Mechanism to examine relationships between entities and their neighboring nodes, generating extensive implicit feature vectors to improve performance in tasks such as entity classification and link prediction."
}