{
    "title": "Hybrid Internal Model: Learning Agile Legged Locomotion with Simulated Robot Response. (arXiv:2312.11460v3 [cs.RO] UPDATED)",
    "abstract": "Robust locomotion control depends on accurate state estimations. However, the sensors of most legged robots can only provide partial and noisy observations, making the estimation particularly challenging, especially for external states like terrain frictions and elevation maps. Inspired by the classical Internal Model Control principle, we consider these external states as disturbances and introduce Hybrid Internal Model (HIM) to estimate them according to the response of the robot. The response, which we refer to as the hybrid internal embedding, contains the robot's explicit velocity and implicit stability representation, corresponding to two primary goals for locomotion tasks: explicitly tracking velocity and implicitly maintaining stability. We use contrastive learning to optimize the embedding to be close to the robot's successor state, in which the response is naturally embedded. HIM has several appealing benefits: It only needs the robot's proprioceptions, i.e., those from joint",
    "link": "http://arxiv.org/abs/2312.11460",
    "context": "Title: Hybrid Internal Model: Learning Agile Legged Locomotion with Simulated Robot Response. (arXiv:2312.11460v3 [cs.RO] UPDATED)\nAbstract: Robust locomotion control depends on accurate state estimations. However, the sensors of most legged robots can only provide partial and noisy observations, making the estimation particularly challenging, especially for external states like terrain frictions and elevation maps. Inspired by the classical Internal Model Control principle, we consider these external states as disturbances and introduce Hybrid Internal Model (HIM) to estimate them according to the response of the robot. The response, which we refer to as the hybrid internal embedding, contains the robot's explicit velocity and implicit stability representation, corresponding to two primary goals for locomotion tasks: explicitly tracking velocity and implicitly maintaining stability. We use contrastive learning to optimize the embedding to be close to the robot's successor state, in which the response is naturally embedded. HIM has several appealing benefits: It only needs the robot's proprioceptions, i.e., those from joint",
    "path": "papers/23/12/2312.11460.json",
    "total_tokens": 938,
    "translated_title": "混合内模：通过模拟机器人响应学习敏捷腿部运动",
    "translated_abstract": "健壮的运动控制依赖于准确的状态估计。然而，大多数四足机器人的传感器只能提供部分和嘈杂的观测，使得估计特别具有挑战性，特别是对于外部状态，如地形摩擦和高程图。受经典的内模控制原理的启发，我们将这些外部状态视为干扰，并引入混合内模（HIM）来根据机器人的响应来估计它们。我们将响应称为混合内嵌表示，它包含了机器人的显式速度和隐式稳定性表示，分别对应于运动任务的两个主要目标：显式追踪速度和隐式维持稳定性。我们使用对比学习来优化嵌入式表示，使其接近机器人的后继状态，其中自然嵌入了响应。HIM具有几个吸引人的好处：它只需要机器人的固有感知，即关节感知。",
    "tldr": "本论文提出了一种混合内模方法，通过模拟机器人的响应来估计外部状态，这对于健壮的运动控制非常重要。使用对比学习优化嵌入表示，使其接近机器人的后继状态。这种方法只需要机器人的固有感知。",
    "en_tdlr": "This paper proposes a Hybrid Internal Model (HIM) approach to estimate external states by simulating robot response, which is crucial for robust locomotion control. The embedding representation is optimized using contrastive learning to be close to the robot's successor state. This method only requires the robot's proprioceptions."
}