{
    "title": "Visual Spatial Attention and Proprioceptive Data-Driven Reinforcement Learning for Robust Peg-in-Hole Task Under Variable Conditions",
    "abstract": "arXiv:2312.16438v2 Announce Type: replace-cross  Abstract: Anchor-bolt insertion is a peg-in-hole task performed in the construction field for holes in concrete. Efforts have been made to automate this task, but the variable lighting and hole surface conditions, as well as the requirements for short setup and task execution time make the automation challenging. In this study, we introduce a vision and proprioceptive data-driven robot control model for this task that is robust to challenging lighting and hole surface conditions. This model consists of a spatial attention point network (SAP) and a deep reinforcement learning (DRL) policy that are trained jointly end-to-end to control the robot. The model is trained in an offline manner, with a sample-efficient framework designed to reduce training time and minimize the reality gap when transferring the model to the physical world. Through evaluations with an industrial robot performing the task in 12 unknown holes, starting from 16 diffe",
    "link": "https://arxiv.org/abs/2312.16438",
    "context": "Title: Visual Spatial Attention and Proprioceptive Data-Driven Reinforcement Learning for Robust Peg-in-Hole Task Under Variable Conditions\nAbstract: arXiv:2312.16438v2 Announce Type: replace-cross  Abstract: Anchor-bolt insertion is a peg-in-hole task performed in the construction field for holes in concrete. Efforts have been made to automate this task, but the variable lighting and hole surface conditions, as well as the requirements for short setup and task execution time make the automation challenging. In this study, we introduce a vision and proprioceptive data-driven robot control model for this task that is robust to challenging lighting and hole surface conditions. This model consists of a spatial attention point network (SAP) and a deep reinforcement learning (DRL) policy that are trained jointly end-to-end to control the robot. The model is trained in an offline manner, with a sample-efficient framework designed to reduce training time and minimize the reality gap when transferring the model to the physical world. Through evaluations with an industrial robot performing the task in 12 unknown holes, starting from 16 diffe",
    "path": "papers/23/12/2312.16438.json",
    "total_tokens": 925,
    "translated_title": "视觉空间注意力和本体感知数据驱动的强化学习用于不同条件下鲁棒的插销孔任务",
    "translated_abstract": "锚栓插入是建筑领域中进行混凝土孔插销任务，已经做出了努力自动化这项任务，但是变化多端的光照和孔表面条件以及对短暂设置和任务执行时间的需求使得自动化具有挑战性。在这项研究中，我们引入了一个视觉和本体感知数据驱动的机器人控制模型，用于鲁棒地应对具有挑战性的照明和孔面条件。该模型由空间注意点网络（SAP）和深度强化学习（DRL）策略组成，二者共同端到端地进行训练以控制机器人。该模型以离线方式进行训练，设计了一种样本高效的框架，旨在减少训练时间并最小化在将模型转移到现实世界时的现实差距。通过对一台工业机器人在12个未知孔中进行任务执行的评估，始于16个不同的...",
    "tldr": "提出了一种视觉空间注意力和本体感知数据驱动的机器人控制模型，通过SAP和DRL策略进行端到端训练，鲁棒地解决具有挑战性的照明和孔面条件下的插销孔任务。"
}