{
    "title": "TSRNet: Simple Framework for Real-time ECG Anomaly Detection with Multimodal Time and Spectrogram Restoration Network",
    "abstract": "arXiv:2312.10187v2 Announce Type: replace-cross  Abstract: The electrocardiogram (ECG) is a valuable signal used to assess various aspects of heart health, such as heart rate and rhythm. It plays a crucial role in identifying cardiac conditions and detecting anomalies in ECG data. However, distinguishing between normal and abnormal ECG signals can be a challenging task. In this paper, we propose an approach that leverages anomaly detection to identify unhealthy conditions using solely normal ECG data for training. Furthermore, to enhance the information available and build a robust system, we suggest considering both the time series and time-frequency domain aspects of the ECG signal. As a result, we introduce a specialized network called the Multimodal Time and Spectrogram Restoration Network (TSRNet) designed specifically for detecting anomalies in ECG signals. TSRNet falls into the category of restoration-based anomaly detection and draws inspiration from both the time series and sp",
    "link": "https://arxiv.org/abs/2312.10187",
    "context": "Title: TSRNet: Simple Framework for Real-time ECG Anomaly Detection with Multimodal Time and Spectrogram Restoration Network\nAbstract: arXiv:2312.10187v2 Announce Type: replace-cross  Abstract: The electrocardiogram (ECG) is a valuable signal used to assess various aspects of heart health, such as heart rate and rhythm. It plays a crucial role in identifying cardiac conditions and detecting anomalies in ECG data. However, distinguishing between normal and abnormal ECG signals can be a challenging task. In this paper, we propose an approach that leverages anomaly detection to identify unhealthy conditions using solely normal ECG data for training. Furthermore, to enhance the information available and build a robust system, we suggest considering both the time series and time-frequency domain aspects of the ECG signal. As a result, we introduce a specialized network called the Multimodal Time and Spectrogram Restoration Network (TSRNet) designed specifically for detecting anomalies in ECG signals. TSRNet falls into the category of restoration-based anomaly detection and draws inspiration from both the time series and sp",
    "path": "papers/23/12/2312.10187.json",
    "total_tokens": 891,
    "translated_title": "TSRNet：多模态时间和谱图恢复网络实时心电图异常检测的简单框架",
    "translated_abstract": "心电图（ECG）是一种有价值的信号，用于评估心脏健康的各个方面，如心率和节律。它在识别心脏状况和检测ECG数据中的异常方面起着关键作用。然而，区分正常和异常ECG信号可能是一项具有挑战性的任务。在本文中，我们提出了一种利用异常检测来识别不健康状况的方法，仅使用正常ECG数据进行训练。此外，为了增强可用信息并构建一个强大的系统，我们建议考虑ECG信号的时间序列和时频领域两个方面。因此，我们引入了一种专门用于检测ECG信号异常的名为多模态时间和谱图恢复网络（TSRNet）的网络。TSRNet属于基于恢复的异常检测类别，灵感来源于时间序列和时频领域。",
    "tldr": "本论文提出了TSRNet框架，利用多模态时间和谱图恢复网络进行实时心电图异常检测，通过恢复正常ECG数据训练，结合时间序列和时频领域，实现了对心电图信号异常的检测。",
    "en_tdlr": "This paper introduces the TSRNet framework for real-time ECG anomaly detection using a multimodal time and spectrogram restoration network, trained on normal ECG data, combining time series and time-frequency domain for anomaly detection in ECG signals."
}