{
    "title": "Symbolic Numeric Planning with Patterns. (arXiv:2312.09963v2 [cs.AI] UPDATED)",
    "abstract": "In this paper, we propose a novel approach for solving linear numeric planning problems, called Symbolic Pattern Planning. Given a planning problem $\\Pi$, a bound $n$ and a pattern -- defined as an arbitrary sequence of actions -- we encode the problem of finding a plan for $\\Pi$ with bound $n$ as a formula with fewer variables and/or clauses than the state-of-the-art rolled-up and relaxed-relaxed-$\\exists$ encodings. More importantly, we prove that for any given bound, it is never the case that the latter two encodings allow finding a valid plan while ours does not. On the experimental side, we consider 6 other planning systems -- including the ones which participated in this year's International Planning Competition (IPC) -- and we show that our planner Patty has remarkably good comparative performances on this year's IPC problems.",
    "link": "http://arxiv.org/abs/2312.09963",
    "context": "Title: Symbolic Numeric Planning with Patterns. (arXiv:2312.09963v2 [cs.AI] UPDATED)\nAbstract: In this paper, we propose a novel approach for solving linear numeric planning problems, called Symbolic Pattern Planning. Given a planning problem $\\Pi$, a bound $n$ and a pattern -- defined as an arbitrary sequence of actions -- we encode the problem of finding a plan for $\\Pi$ with bound $n$ as a formula with fewer variables and/or clauses than the state-of-the-art rolled-up and relaxed-relaxed-$\\exists$ encodings. More importantly, we prove that for any given bound, it is never the case that the latter two encodings allow finding a valid plan while ours does not. On the experimental side, we consider 6 other planning systems -- including the ones which participated in this year's International Planning Competition (IPC) -- and we show that our planner Patty has remarkably good comparative performances on this year's IPC problems.",
    "path": "papers/23/12/2312.09963.json",
    "total_tokens": 818,
    "translated_title": "具有模式的符号数值规划",
    "translated_abstract": "本文提出了一种解决线性数值规划问题的新方法，称为符号模式规划。给定一个规划问题Π，一个界限n和一个模式 - 定义为任意动作的序列 - 我们将寻找一个针对Π和界限n的计划问题编码为一个公式，该公式的变量和/或子句比最先进的rolled-up和松弛-松弛-$\\exists$编码更少。更重要的是，我们证明了对于任何给定的界限，后两种编码都不可能找到一个有效的计划，而我们的编码可以。在实验方面，我们考虑了其他6个规划系统 - 包括参加今年国际规划竞赛（IPC）的系统 - 并展示了我们的规划器Patty在今年IPC问题上的非常好的比较性能。",
    "tldr": "本文提出了一种符号模式规划的新方法，通过编码问题为一个公式可以比现有方法更有效地寻找解决方案。在实验中，我们的规划器Patty在今年的IPC问题上表现出优异的性能。",
    "en_tdlr": "This paper presents a novel approach called Symbolic Pattern Planning for solving linear numeric planning problems, which encodes the problem as a formula to find solutions more efficiently than existing methods. Experimental results show that our planner, Patty, achieves remarkable performance on this year's International Planning Competition (IPC) problems."
}