{
    "title": "Plug-and-Play Regularization on Magnitude with Deep Priors for 3D Near-Field MIMO Imaging",
    "abstract": "arXiv:2312.16024v2 Announce Type: replace-cross  Abstract: Near-field radar imaging systems are used in a wide range of applications such as concealed weapon detection and medical diagnosis. In this paper, we consider the problem of reconstructing the three-dimensional (3D) complex-valued reflectivity distribution of the near-field scene by enforcing regularization on its magnitude. We solve this inverse problem by using the alternating direction method of multipliers (ADMM) framework. For this, we provide a general expression for the proximal mapping associated with such regularization functionals. This equivalently corresponds to the solution of a complex-valued denoising problem which involves regularization on the magnitude. By utilizing this expression, we develop a novel and efficient plug-and-play (PnP) reconstruction method that consists of simple update steps. Due to the success of data-adaptive deep priors in imaging, we also train a 3D deep denoiser to exploit within the dev",
    "link": "https://arxiv.org/abs/2312.16024",
    "context": "Title: Plug-and-Play Regularization on Magnitude with Deep Priors for 3D Near-Field MIMO Imaging\nAbstract: arXiv:2312.16024v2 Announce Type: replace-cross  Abstract: Near-field radar imaging systems are used in a wide range of applications such as concealed weapon detection and medical diagnosis. In this paper, we consider the problem of reconstructing the three-dimensional (3D) complex-valued reflectivity distribution of the near-field scene by enforcing regularization on its magnitude. We solve this inverse problem by using the alternating direction method of multipliers (ADMM) framework. For this, we provide a general expression for the proximal mapping associated with such regularization functionals. This equivalently corresponds to the solution of a complex-valued denoising problem which involves regularization on the magnitude. By utilizing this expression, we develop a novel and efficient plug-and-play (PnP) reconstruction method that consists of simple update steps. Due to the success of data-adaptive deep priors in imaging, we also train a 3D deep denoiser to exploit within the dev",
    "path": "papers/23/12/2312.16024.json",
    "total_tokens": 855,
    "translated_title": "基于深度先验的近场3D MIMO成像中的振幅插入和播放正则化",
    "translated_abstract": "近场雷达成像系统被广泛应用于隐蔽武器检测和医学诊断等各种应用。本文考虑通过对振幅施加正则化来重建近场场景的三维复值反射率分布的问题。我们利用交替方向乘子方法（ADMM）框架来解决这个逆问题。为此，我们提供了一个与这种正则化功能相关联的近似映射的一般表达式。这等效于解决一个涉及振幅正则化的复值去噪问题。通过利用这个表达式，我们开发了一种新颖高效的插入和播放（PnP）重建方法，包含简单的更新步骤。由于数据自适应深度先验在成像中的成功，我们还训练了一个3D深度降噪器以在其中加以利用。",
    "tldr": "本文提出了一种基于深度先验的近场3D MIMO成像中振幅正则化问题的插入和播放正则化方法，通过解决复值去噪问题实现了高效的重建方法。",
    "en_tdlr": "This paper presents a plug-and-play regularization method for amplitude regularization in 3D near-field MIMO imaging with deep priors, achieving efficient reconstruction by solving a complex-valued denoising problem."
}