{
    "title": "TEILP: Time Prediction over Knowledge Graphs via Logical Reasoning. (arXiv:2312.15816v2 [cs.CL] UPDATED)",
    "abstract": "Conventional embedding-based models approach event time prediction in temporal knowledge graphs (TKGs) as a ranking problem. However, they often fall short in capturing essential temporal relationships such as order and distance. In this paper, we propose TEILP, a logical reasoning framework that naturally integrates such temporal elements into knowledge graph predictions. We first convert TKGs into a temporal event knowledge graph (TEKG) which has a more explicit representation of time in term of nodes of the graph. The TEKG equips us to develop a differentiable random walk approach to time prediction. Finally, we introduce conditional probability density functions, associated with the logical rules involving the query interval, using which we arrive at the time prediction. We compare TEILP with state-of-the-art methods on five benchmark datasets. We show that our model achieves a significant improvement over baselines while providing interpretable explanations. In particular, we cons",
    "link": "http://arxiv.org/abs/2312.15816",
    "context": "Title: TEILP: Time Prediction over Knowledge Graphs via Logical Reasoning. (arXiv:2312.15816v2 [cs.CL] UPDATED)\nAbstract: Conventional embedding-based models approach event time prediction in temporal knowledge graphs (TKGs) as a ranking problem. However, they often fall short in capturing essential temporal relationships such as order and distance. In this paper, we propose TEILP, a logical reasoning framework that naturally integrates such temporal elements into knowledge graph predictions. We first convert TKGs into a temporal event knowledge graph (TEKG) which has a more explicit representation of time in term of nodes of the graph. The TEKG equips us to develop a differentiable random walk approach to time prediction. Finally, we introduce conditional probability density functions, associated with the logical rules involving the query interval, using which we arrive at the time prediction. We compare TEILP with state-of-the-art methods on five benchmark datasets. We show that our model achieves a significant improvement over baselines while providing interpretable explanations. In particular, we cons",
    "path": "papers/23/12/2312.15816.json",
    "total_tokens": 855,
    "translated_title": "TEILP:通过逻辑推理在知识图谱上进行时间预测",
    "translated_abstract": "传统的基于嵌入模型的方法将时间知识图谱（TKG）中的事件时间预测视为一种排序问题。然而，它们常常无法很好地捕捉到诸如顺序和距离等重要的时间关系。在本文中，我们提出了TEILP，这是一个逻辑推理框架，可以自然地将这些时间要素融入到知识图谱的预测中。我们首先将TKG转换为一个具有更明确时间表示的时间事件知识图谱（TEKG）。TEKG使我们能够开发一种可微分的随机游走方法来进行时间预测。最后，我们引入了与查询时间间隔相关的条件概率密度函数，通过这些函数得出时间预测结果。我们将TEILP与五个基准数据集上的最先进方法进行比较。结果显示，我们的模型在提供可解释性解释的同时，相对于基线模型实现了显著的改进。",
    "tldr": "这篇论文提出了一个名为TEILP的逻辑推理框架，用于在知识图谱中进行时间预测。通过将知识图谱转换为时间事件知识图谱，并使用可微分的随机游走方法和条件概率密度函数，该方法在时间预测方面取得了显著的改进。"
}