{
    "title": "Open Datasheets: Machine-readable Documentation for Open Datasets and Responsible AI Assessments",
    "abstract": "arXiv:2312.06153v2 Announce Type: replace-cross  Abstract: This paper introduces a no-code, machine-readable documentation framework for open datasets, with a focus on responsible AI (RAI) considerations. The framework aims to improve comprehensibility, and usability of open datasets, facilitating easier discovery and use, better understanding of content and context, and evaluation of dataset quality and accuracy. The proposed framework is designed to streamline the evaluation of datasets, helping researchers, data scientists, and other open data users quickly identify datasets that meet their needs and organizational policies or regulations. The paper also discusses the implementation of the framework and provides recommendations to maximize its potential. The framework is expected to enhance the quality and reliability of data used in research and decision-making, fostering the development of more responsible and trustworthy AI systems.",
    "link": "https://arxiv.org/abs/2312.06153",
    "context": "Title: Open Datasheets: Machine-readable Documentation for Open Datasets and Responsible AI Assessments\nAbstract: arXiv:2312.06153v2 Announce Type: replace-cross  Abstract: This paper introduces a no-code, machine-readable documentation framework for open datasets, with a focus on responsible AI (RAI) considerations. The framework aims to improve comprehensibility, and usability of open datasets, facilitating easier discovery and use, better understanding of content and context, and evaluation of dataset quality and accuracy. The proposed framework is designed to streamline the evaluation of datasets, helping researchers, data scientists, and other open data users quickly identify datasets that meet their needs and organizational policies or regulations. The paper also discusses the implementation of the framework and provides recommendations to maximize its potential. The framework is expected to enhance the quality and reliability of data used in research and decision-making, fostering the development of more responsible and trustworthy AI systems.",
    "path": "papers/23/12/2312.06153.json",
    "total_tokens": 877,
    "translated_title": "开放数据表：面向开放数据集和负责任人工智能评估的机器可读文档",
    "translated_abstract": "本文介绍了一种无代码的、面向开放数据集的机器可读文档框架，重点关注负责任人工智能（RAI）考虑因素。该框架旨在提高开放数据集的可理解性和可用性，促进更容易地发现和使用数据集，更好地理解内容和上下文，以及评估数据集的质量和准确性。所提出的框架旨在简化数据集的评估，帮助研究人员、数据科学家和其他开放数据用户快速识别符合其需求和组织政策或法规的数据集。论文还讨论了框架的实施，并提出了最大化其潜力的建议。预期该框架将增强在研究和决策中使用的数据的质量和可靠性，促进更负责任、可信赖的人工智能系统的发展。",
    "tldr": "本文介绍了一种面向开放数据集和负责任人工智能评估的机器可读文档框架，旨在提高数据集的可理解性和可用性，简化数据集评估过程，促进更可靠的数据应用，从而培育更负责任和可信赖的人工智能系统。",
    "en_tdlr": "This paper introduces a machine-readable documentation framework for open datasets and responsible AI assessments, aiming to improve dataset comprehensibility and usability, streamline dataset evaluation, and foster more reliable data applications for the development of responsible and trustworthy AI systems."
}