{
    "title": "Robust Knowledge Extraction from Large Language Models using Social Choice Theory",
    "abstract": "Large-language models (LLMs) can support a wide range of applications like conversational agents, creative writing or general query answering. However, they are ill-suited for query answering in high-stake domains like medicine because they are typically not robust - even the same query can result in different answers when prompted multiple times. In order to improve the robustness of LLM queries, we propose using ranking queries repeatedly and to aggregate the queries using methods from social choice theory. We study ranking queries in diagnostic settings like medical and fault diagnosis and discuss how the Partial Borda Choice function from the literature can be applied to merge multiple query results. We discuss some additional interesting properties in our setting and evaluate the robustness of our approach empirically.",
    "link": "https://arxiv.org/abs/2312.14877",
    "context": "Title: Robust Knowledge Extraction from Large Language Models using Social Choice Theory\nAbstract: Large-language models (LLMs) can support a wide range of applications like conversational agents, creative writing or general query answering. However, they are ill-suited for query answering in high-stake domains like medicine because they are typically not robust - even the same query can result in different answers when prompted multiple times. In order to improve the robustness of LLM queries, we propose using ranking queries repeatedly and to aggregate the queries using methods from social choice theory. We study ranking queries in diagnostic settings like medical and fault diagnosis and discuss how the Partial Borda Choice function from the literature can be applied to merge multiple query results. We discuss some additional interesting properties in our setting and evaluate the robustness of our approach empirically.",
    "path": "papers/23/12/2312.14877.json",
    "total_tokens": 787,
    "translated_title": "使用社会选择理论从大型语言模型中提取稳健知识",
    "translated_abstract": "大型语言模型(LLMs)可以支持很多应用，如对话代理、创意写作或一般查询回答。然而，在高风险领域（如医学）中，它们不适用于查询回答，因为当多次提示相同查询时，它们通常不具有鲁棒性 - 结果可能不同。为了提高LLM查询的鲁棒性，我们提出使用排名查询，并使用社会选择理论的方法来汇总查询结果。我们研究了诊断场景中的排名查询，如医学和故障诊断，并讨论了如何应用文献中的Partial Borda Choice函数来合并多个查询结果。我们还讨论了我们设置中的一些其他有趣属性，并通过实证评估了我们方法的鲁棒性。",
    "tldr": "本研究提出使用排名查询和社会选择理论的方法来提高大型语言模型（LLMs）查询的鲁棒性，特别是在高风险领域如医学中。我们通过实证评估验证了我们方法的鲁棒性和其他有趣属性。"
}