{
    "title": "Managing the unknown: a survey on Open Set Recognition and tangential areas. (arXiv:2312.08785v2 [cs.LG] UPDATED)",
    "abstract": "In real-world scenarios classification models are often required to perform robustly when predicting samples belonging to classes that have not appeared during its training stage. Open Set Recognition addresses this issue by devising models capable of detecting unknown classes from samples arriving during the testing phase, while maintaining a good level of performance in the classification of samples belonging to known classes. This review comprehensively overviews the recent literature related to Open Set Recognition, identifying common practices, limitations, and connections of this field with other machine learning research areas, such as continual learning, out-of-distribution detection, novelty detection, and uncertainty estimation. Our work also uncovers open problems and suggests several research directions that may motivate and articulate future efforts towards more safe Artificial Intelligence methods.",
    "link": "http://arxiv.org/abs/2312.08785",
    "context": "Title: Managing the unknown: a survey on Open Set Recognition and tangential areas. (arXiv:2312.08785v2 [cs.LG] UPDATED)\nAbstract: In real-world scenarios classification models are often required to perform robustly when predicting samples belonging to classes that have not appeared during its training stage. Open Set Recognition addresses this issue by devising models capable of detecting unknown classes from samples arriving during the testing phase, while maintaining a good level of performance in the classification of samples belonging to known classes. This review comprehensively overviews the recent literature related to Open Set Recognition, identifying common practices, limitations, and connections of this field with other machine learning research areas, such as continual learning, out-of-distribution detection, novelty detection, and uncertainty estimation. Our work also uncovers open problems and suggests several research directions that may motivate and articulate future efforts towards more safe Artificial Intelligence methods.",
    "path": "papers/23/12/2312.08785.json",
    "total_tokens": 802,
    "translated_title": "处理未知情况：开集识别及相关领域的综述",
    "translated_abstract": "在实际场景中，分类模型常常需要在预测属于其训练阶段未出现的类别样本时具有鲁棒性。开集识别通过设计能够在测试阶段从样本中检测到未知类别的模型，同时在对属于已知类别的样本进行分类时保持良好的性能来解决这个问题。本综述全面概述了与开集识别相关的最近文献，识别了这个领域的常见做法、限制以及与其他机器学习研究领域（如连续学习、分布外检测、新颖性检测和不确定性估计）的联系。我们的工作还揭示了开放的问题，并提出了几个研究方向，这些方向可能促进和推进未来更安全的人工智能方法。",
    "tldr": "这篇综述主要总结了开集识别的最新研究进展，包括常见做法、限制以及与其他机器学习研究领域的联系，并提出了未来的研究方向。",
    "en_tdlr": "This review comprehensively summarizes the recent research progress in Open Set Recognition, including common practices, limitations, and connections with other machine learning research areas, and proposes future research directions."
}