{
    "title": "PINN surrogate of Li-ion battery models for parameter inference. Part II: Regularization and application of the pseudo-2D model",
    "abstract": "arXiv:2312.17336v2 Announce Type: replace  Abstract: Bayesian parameter inference is useful to improve Li-ion battery diagnostics and can help formulate battery aging models. However, it is computationally intensive and cannot be easily repeated for multiple cycles, multiple operating conditions, or multiple replicate cells. To reduce the computational cost of Bayesian calibration, numerical solvers for physics-based models can be replaced with faster surrogates. A physics-informed neural network (PINN) is developed as a surrogate for the pseudo-2D (P2D) battery model calibration. For the P2D surrogate, additional training regularization was needed as compared to the PINN single-particle model (SPM) developed in Part I. Both the PINN SPM and P2D surrogate models are exercised for parameter inference and compared to data obtained from a direct numerical solution of the governing equations. A parameter inference study highlights the ability to use these PINNs to calibrate scaling paramet",
    "link": "https://arxiv.org/abs/2312.17336",
    "context": "Title: PINN surrogate of Li-ion battery models for parameter inference. Part II: Regularization and application of the pseudo-2D model\nAbstract: arXiv:2312.17336v2 Announce Type: replace  Abstract: Bayesian parameter inference is useful to improve Li-ion battery diagnostics and can help formulate battery aging models. However, it is computationally intensive and cannot be easily repeated for multiple cycles, multiple operating conditions, or multiple replicate cells. To reduce the computational cost of Bayesian calibration, numerical solvers for physics-based models can be replaced with faster surrogates. A physics-informed neural network (PINN) is developed as a surrogate for the pseudo-2D (P2D) battery model calibration. For the P2D surrogate, additional training regularization was needed as compared to the PINN single-particle model (SPM) developed in Part I. Both the PINN SPM and P2D surrogate models are exercised for parameter inference and compared to data obtained from a direct numerical solution of the governing equations. A parameter inference study highlights the ability to use these PINNs to calibrate scaling paramet",
    "path": "papers/23/12/2312.17336.json",
    "total_tokens": 716,
    "translated_title": "Li-ion电池模型的PINN代理用于参数推断。第II部分：正则化和伪二维模型的应用",
    "translated_abstract": "Bayesian参数推断对改进锂离子电池诊断有用，并有助于制定电池老化模型。为了降低Bayesian校准的计算成本，可以用更快的代理替换基于物理的模型的数值求解器。将一个物理信息神经网络（PINN）开发为伪二维（P2D）电池模型校准的代理。",
    "tldr": "开发了物理信息神经网络（PINN）作为伪二维（P2D）电池模型校准的代理，进行了参数推断研究，可以减少Bayesian校准的计算成本。",
    "en_tdlr": "A physics-informed neural network (PINN) was developed as a surrogate for the pseudo-2D (P2D) battery model calibration, reducing the computational cost of Bayesian calibration."
}