{
    "title": "Rational Sensibility: LLM Enhanced Empathetic Response Generation Guided by Self-presentation Theory. (arXiv:2312.08702v3 [cs.AI] UPDATED)",
    "abstract": "Having the ability to empathize is crucial for accurately representing human behavior during conversations. Despite numerous research aim to improve the cognitive capability of models by incorporating external knowledge, there has been limited attention on the sensible and rational expression of the conversation itself, which are crucial components of the cognitive empathy. Guided by self-presentation theory in sociology, we have designed an innovative categorical approach that segregates historical dialogues into sensible and rational sentences and subsequently elucidate the context through the designed attention mechanism. However, the rational information within the conversation is restricted and the external knowledge used in previous methods have limitations of semantic contradiction and narrow vision field. Considering the impressive performance of LLM in the domain of intelligent agent. We employ LLaMA2-70b as a rational brain to analyze the profound logical information maintain",
    "link": "http://arxiv.org/abs/2312.08702",
    "context": "Title: Rational Sensibility: LLM Enhanced Empathetic Response Generation Guided by Self-presentation Theory. (arXiv:2312.08702v3 [cs.AI] UPDATED)\nAbstract: Having the ability to empathize is crucial for accurately representing human behavior during conversations. Despite numerous research aim to improve the cognitive capability of models by incorporating external knowledge, there has been limited attention on the sensible and rational expression of the conversation itself, which are crucial components of the cognitive empathy. Guided by self-presentation theory in sociology, we have designed an innovative categorical approach that segregates historical dialogues into sensible and rational sentences and subsequently elucidate the context through the designed attention mechanism. However, the rational information within the conversation is restricted and the external knowledge used in previous methods have limitations of semantic contradiction and narrow vision field. Considering the impressive performance of LLM in the domain of intelligent agent. We employ LLaMA2-70b as a rational brain to analyze the profound logical information maintain",
    "path": "papers/23/12/2312.08702.json",
    "total_tokens": 864,
    "translated_title": "理性情感：以自我展示理论为指导的增强型同理心回应生成的LLM方法",
    "translated_abstract": "在对话中准确表达人类行为的能力对于同理心至关重要。尽管有许多研究致力于通过引入外部知识来改进模型的认知能力，但对于对话本身的理性表达和合理的表现方面，却受到了有限的关注，而这些是认知同理心的关键组成部分。在社会学中，我们借鉴了自我展示理论，设计了一种创新的分类方法，将历史对话分成合理和理性的句子，并通过设计的注意力机制来阐明上下文。然而，对话中的理性信息受到限制，并且先前方法中使用的外部知识存在语义矛盾和狭窄视野的限制。考虑到LLM在智能代理领域的卓越表现，我们采用LLaMA2-70b作为理性大脑来分析深远的逻辑信息。",
    "tldr": "本文通过以自我展示理论为指导，设计了一种创新的分类方法，将历史对话分成合理和理性的句子，并通过注意力机制来阐明上下文，从而增强同理心回应生成的能力。"
}