{
    "title": "LeanVec: Searching vectors faster by making them fit",
    "abstract": "arXiv:2312.16335v2 Announce Type: replace  Abstract: Modern deep learning models have the ability to generate high-dimensional vectors whose similarity reflects semantic resemblance. Thus, similarity search, i.e., the operation of retrieving those vectors in a large collection that are similar to a given query, has become a critical component of a wide range of applications that demand highly accurate and timely answers. In this setting, the high vector dimensionality puts similarity search systems under compute and memory pressure, leading to subpar performance. Additionally, cross-modal retrieval tasks have become increasingly common, e.g., where a user inputs a text query to find the most relevant images for that query. However, these queries often have different distributions than the database embeddings, making it challenging to achieve high accuracy. In this work, we present LeanVec, a framework that combines linear dimensionality reduction with vector quantization to accelerate ",
    "link": "https://arxiv.org/abs/2312.16335",
    "context": "Title: LeanVec: Searching vectors faster by making them fit\nAbstract: arXiv:2312.16335v2 Announce Type: replace  Abstract: Modern deep learning models have the ability to generate high-dimensional vectors whose similarity reflects semantic resemblance. Thus, similarity search, i.e., the operation of retrieving those vectors in a large collection that are similar to a given query, has become a critical component of a wide range of applications that demand highly accurate and timely answers. In this setting, the high vector dimensionality puts similarity search systems under compute and memory pressure, leading to subpar performance. Additionally, cross-modal retrieval tasks have become increasingly common, e.g., where a user inputs a text query to find the most relevant images for that query. However, these queries often have different distributions than the database embeddings, making it challenging to achieve high accuracy. In this work, we present LeanVec, a framework that combines linear dimensionality reduction with vector quantization to accelerate ",
    "path": "papers/23/12/2312.16335.json",
    "total_tokens": 841,
    "translated_title": "LeanVec: 通过使向量适应来加快搜索速度",
    "translated_abstract": "现代深度学习模型具有生成高维向量的能力，其相似性反映语义相似性。因此，相似性搜索，即在一个大型集合中检索与给定查询相似的向量的操作，已成为许多需要高度准确和及时答案的应用程序的关键组成部分。在这种情况下，高向量维度使得相似性搜索系统承受计算和内存压力，导致性能不佳。此外，跨模态检索任务已经日益普遍，例如用户输入文本查询以找到与该查询最相关的图像。然而，这些查询通常与数据库嵌入具有不同的分布，这使得实现高准确性具有挑战性。在这项工作中，我们提出了LeanVec，这是一个将线性降维与向量量化相结合以加速的框架。",
    "tldr": "LeanVec是一个结合了线性降维和向量量化的框架，旨在加速高维向量的相似性搜索，解决了相似性搜索系统在高向量维度下的计算和内存压力问题，同时应用于跨模态检索任务。",
    "en_tdlr": "LeanVec is a framework that combines linear dimensionality reduction with vector quantization to accelerate similarity search of high-dimensional vectors, addressing the computation and memory pressure issues faced by similarity search systems at high vector dimensions, while also being applicable to cross-modal retrieval tasks."
}