{
    "title": "Variational Self-Supervised Contrastive Learning Using Beta Divergence For Face Understanding",
    "abstract": "arXiv:2312.00824v2 Announce Type: replace-cross  Abstract: Learning a discriminative semantic space using unlabelled and noisy data remains unaddressed in a multi-label setting. We present a contrastive self-supervised learning method which is robust to data noise, grounded in the domain of variational methods. The method (VCL) utilizes variational contrastive learning with beta-divergence to learn robustly from unlabelled datasets, including uncurated and noisy datasets. We demonstrate the effectiveness of the proposed method through rigorous experiments including linear evaluation and fine-tuning scenarios with multi-label datasets in the face understanding domain. In almost all tested scenarios, VCL surpasses the performance of state-of-the-art self-supervised methods, achieving a noteworthy increase in accuracy.",
    "link": "https://arxiv.org/abs/2312.00824",
    "context": "Title: Variational Self-Supervised Contrastive Learning Using Beta Divergence For Face Understanding\nAbstract: arXiv:2312.00824v2 Announce Type: replace-cross  Abstract: Learning a discriminative semantic space using unlabelled and noisy data remains unaddressed in a multi-label setting. We present a contrastive self-supervised learning method which is robust to data noise, grounded in the domain of variational methods. The method (VCL) utilizes variational contrastive learning with beta-divergence to learn robustly from unlabelled datasets, including uncurated and noisy datasets. We demonstrate the effectiveness of the proposed method through rigorous experiments including linear evaluation and fine-tuning scenarios with multi-label datasets in the face understanding domain. In almost all tested scenarios, VCL surpasses the performance of state-of-the-art self-supervised methods, achieving a noteworthy increase in accuracy.",
    "path": "papers/23/12/2312.00824.json",
    "total_tokens": 782,
    "translated_title": "使用Beta Divergence进行变分自监督对比学习用于人脸理解",
    "translated_abstract": "学习如何使用未标记和嘈杂数据构建一个具有辨别性的语义空间在多标签设置中仍未解决。我们提出了一种对数据噪声具有鲁棒性且基于变分方法的对比自监督学习方法。该方法（VCL）利用变分对比学习与beta-divergence从未标记数据集中稳健地学习，包括未加工和嘈杂的数据集。我们通过严格的实验展示了所提出方法的有效性，包括在线性评估和微调场景中使用多标签数据集进行的人脸理解领域。在几乎所有测试场景中，VCL均超越了最先进的自监督方法的性能，实现了显著的准确率增加。",
    "tldr": "提出一种使用Beta Divergence进行变分自监督对比学习的方法，能够从未标记和嘈杂数据集中学习，在人脸理解领域取得显著的准确率提升。"
}