{
    "title": "Enhancing Neural Theorem Proving through Data Augmentation and Dynamic Sampling Method",
    "abstract": "arXiv:2312.14188v2 Announce Type: replace  Abstract: Theorem proving is a fundamental task in mathematics. With the advent of large language models (LLMs) and interactive theorem provers (ITPs) like Lean, there has been growing interest in integrating LLMs and ITPs to automate theorem proving. In this approach, the LLM generates proof steps (tactics), and the ITP checks the applicability of the tactics at the current goal. The two systems work together to complete the proof. In this paper, we introduce DS-Prover, a novel dynamic sampling method for theorem proving. This method dynamically determines the number of tactics to apply to expand the current goal, taking into account the remaining time compared to the total allocated time for proving a theorem. This makes the proof search process more efficient by adjusting the balance between exploration and exploitation as time passes. We also augment the training dataset by decomposing simplification and rewrite tactics with multiple premi",
    "link": "https://arxiv.org/abs/2312.14188",
    "context": "Title: Enhancing Neural Theorem Proving through Data Augmentation and Dynamic Sampling Method\nAbstract: arXiv:2312.14188v2 Announce Type: replace  Abstract: Theorem proving is a fundamental task in mathematics. With the advent of large language models (LLMs) and interactive theorem provers (ITPs) like Lean, there has been growing interest in integrating LLMs and ITPs to automate theorem proving. In this approach, the LLM generates proof steps (tactics), and the ITP checks the applicability of the tactics at the current goal. The two systems work together to complete the proof. In this paper, we introduce DS-Prover, a novel dynamic sampling method for theorem proving. This method dynamically determines the number of tactics to apply to expand the current goal, taking into account the remaining time compared to the total allocated time for proving a theorem. This makes the proof search process more efficient by adjusting the balance between exploration and exploitation as time passes. We also augment the training dataset by decomposing simplification and rewrite tactics with multiple premi",
    "path": "papers/23/12/2312.14188.json",
    "total_tokens": 940,
    "translated_title": "通过数据增强和动态抽样方法增强神经定理证明能力",
    "translated_abstract": "定理证明是数学中的一项基本任务。随着大型语言模型（LLMs）和交互式定理证明器（ITPs）如Lean的出现，人们对将LLMs和ITPs集成以自动化定理证明的兴趣日益增长。在这种方法中，LLM生成证明步骤（策略），而ITP检查这些策略在当前目标上的适用性。这两个系统共同完成证明过程。在本文中，我们介绍了DS-Prover，一种用于定理证明的全新动态抽样方法。该方法通过动态确定要应用于扩展当前目标的策略数量，考虑到剩余时间与总分配时间之间的比较，从而使证明搜索过程更加高效，随着时间的推移调整探索和开发之间的平衡。我们还通过将简化和重写策略与多个前提进行分解来增加训练数据集。",
    "tldr": "本论文提出了一种名为DS-Prover的动态抽样方法，用于增强神经定理证明的能力。该方法通过动态确定应用于扩展当前目标的策略数量，并调整探索和开发之间的平衡，从而使证明搜索过程更加高效。此外，作者还通过增加训练数据集，将简化和重写策略与多个前提进行分解。",
    "en_tdlr": "This paper introduces a novel dynamic sampling method called DS-Prover to enhance the neural theorem proving. By dynamically determining the number of tactics to apply and adjusting the balance between exploration and exploitation, the method makes the proof search process more efficient. Furthermore, the authors augment the training dataset by decomposing simplification and rewrite tactics with multiple premises."
}