{
    "title": "Unsupervised Harmonic Parameter Estimation Using Differentiable DSP and Spectral Optimal Transport. (arXiv:2312.14507v3 [cs.SD] UPDATED)",
    "abstract": "In neural audio signal processing, pitch conditioning has been used to enhance the performance of synthesizers. However, jointly training pitch estimators and synthesizers is a challenge when using standard audio-to-audio reconstruction loss, leading to reliance on external pitch trackers. To address this issue, we propose using a spectral loss function inspired by optimal transportation theory that minimizes the displacement of spectral energy. We validate this approach through an unsupervised autoencoding task that fits a harmonic template to harmonic signals. We jointly estimate the fundamental frequency and amplitudes of harmonics using a lightweight encoder and reconstruct the signals using a differentiable harmonic synthesizer. The proposed approach offers a promising direction for improving unsupervised parameter estimation in neural audio applications.",
    "link": "http://arxiv.org/abs/2312.14507",
    "context": "Title: Unsupervised Harmonic Parameter Estimation Using Differentiable DSP and Spectral Optimal Transport. (arXiv:2312.14507v3 [cs.SD] UPDATED)\nAbstract: In neural audio signal processing, pitch conditioning has been used to enhance the performance of synthesizers. However, jointly training pitch estimators and synthesizers is a challenge when using standard audio-to-audio reconstruction loss, leading to reliance on external pitch trackers. To address this issue, we propose using a spectral loss function inspired by optimal transportation theory that minimizes the displacement of spectral energy. We validate this approach through an unsupervised autoencoding task that fits a harmonic template to harmonic signals. We jointly estimate the fundamental frequency and amplitudes of harmonics using a lightweight encoder and reconstruct the signals using a differentiable harmonic synthesizer. The proposed approach offers a promising direction for improving unsupervised parameter estimation in neural audio applications.",
    "path": "papers/23/12/2312.14507.json",
    "total_tokens": 844,
    "translated_title": "无监督的谐波参数估计：基于可微分DSP和频谱最优传输的方法",
    "translated_abstract": "在神经音频信号处理中，使用音高条件对合成器的性能进行增强已经被广泛应用。然而，当使用标准音频到音频重构损失时，联合训练音高估计器和合成器是具有挑战性的，导致依赖外部音高跟踪器。为了解决这个问题，我们提出了一种受最优传输理论启发的频谱损失函数，该损失函数最小化了频谱能量的位移。我们通过一个无监督的自编码任务来验证这种方法，该任务将谐波信号拟合到谐波模板。我们使用一个轻量级的编码器共同估计基频和谐波的振幅，并使用可微分的谐波合成器重构信号。所提出的方法对于改进神经音频应用中的无监督参数估计具有很大的潜力。",
    "tldr": "本文提出了一种无监督的谐波参数估计方法，利用可微分的DSP和频谱最优传输理论来进行谐波信号的自编码和重构，为神经音频应用中的无监督参数估计提供了一个有希望的方向。",
    "en_tdlr": "This paper proposes an unsupervised method for harmonic parameter estimation by utilizing differentiable DSP and spectral optimal transport, offering a promising direction for improving unsupervised parameter estimation in neural audio applications."
}