{
    "title": "Geo2SigMap: High-Fidelity RF Signal Mapping Using Geographic Databases. (arXiv:2312.14303v2 [eess.SP] UPDATED)",
    "abstract": "Radio frequency (RF) signal mapping, which is the process of analyzing and predicting the RF signal strength and distribution across specific areas, is crucial for cellular network planning and deployment. Traditional approaches to RF signal mapping rely on statistical models constructed based on measurement data, which offer low complexity but often lack accuracy, or ray tracing tools, which provide enhanced precision for the target area but suffer from increased computational complexity. Recently, machine learning (ML) has emerged as a data-driven method for modeling RF signal propagation, which leverages models trained on synthetic datasets to perform RF signal mapping in \"unseen\" areas.  In this paper, we present Geo2SigMap, an ML-based framework for efficient and high-fidelity RF signal mapping using geographic databases. First, we develop an automated framework that seamlessly integrates three open-source tools: OpenStreetMap (geographic databases), Blender (computer graphics), a",
    "link": "http://arxiv.org/abs/2312.14303",
    "context": "Title: Geo2SigMap: High-Fidelity RF Signal Mapping Using Geographic Databases. (arXiv:2312.14303v2 [eess.SP] UPDATED)\nAbstract: Radio frequency (RF) signal mapping, which is the process of analyzing and predicting the RF signal strength and distribution across specific areas, is crucial for cellular network planning and deployment. Traditional approaches to RF signal mapping rely on statistical models constructed based on measurement data, which offer low complexity but often lack accuracy, or ray tracing tools, which provide enhanced precision for the target area but suffer from increased computational complexity. Recently, machine learning (ML) has emerged as a data-driven method for modeling RF signal propagation, which leverages models trained on synthetic datasets to perform RF signal mapping in \"unseen\" areas.  In this paper, we present Geo2SigMap, an ML-based framework for efficient and high-fidelity RF signal mapping using geographic databases. First, we develop an automated framework that seamlessly integrates three open-source tools: OpenStreetMap (geographic databases), Blender (computer graphics), a",
    "path": "papers/23/12/2312.14303.json",
    "total_tokens": 967,
    "translated_title": "Geo2SigMap: 使用地理数据库进行高保真度射频信号映射",
    "translated_abstract": "射频（RF）信号映射是分析和预测特定区域内射频信号强度和分布的过程，对蜂窝网络规划和部署至关重要。传统的射频信号映射方法依赖于基于测量数据构建的统计模型，这种方法复杂度低但通常缺乏准确性，或者依赖射线跟踪工具，该工具提供了对目标区域的增强精度，但计算复杂度较高。最近，机器学习（ML）已经成为一种基于数据的方法，用于建模射频信号传播，它利用在合成数据集上训练的模型在“未知”区域进行射频信号映射。在本文中，我们提出了Geo2SigMap，一种基于ML的使用地理数据库进行高效且高保真度RF信号映射的框架。首先，我们开发了一个自动化框架，无缝集成了三个开源工具：OpenStreetMap（地理数据库）、Blender（计算机图形），",
    "tldr": "本文提出了Geo2SigMap，一种基于地理数据库的高效和高保真度射频信号映射框架。通过无缝集成OpenStreetMap（地理数据库）、Blender（计算机图形）等开源工具，利用机器学习技术对射频信号传播进行建模，实现在“未知”区域进行射频信号映射。",
    "en_tdlr": "This paper presents Geo2SigMap, an ML-based framework that utilizes geographic databases for efficient and high-fidelity RF signal mapping. By seamlessly integrating open-source tools such as OpenStreetMap and Blender, the framework leverages machine learning techniques to model RF signal propagation and perform signal mapping in \"unseen\" areas."
}