{
    "title": "Synthetic images aid the recognition of human-made art forgeries",
    "abstract": "arXiv:2312.14998v3 Announce Type: replace-cross  Abstract: Previous research has shown that Artificial Intelligence is capable of distinguishing between authentic paintings by a given artist and human-made forgeries with remarkable accuracy, provided sufficient training. However, with the limited amount of existing known forgeries, augmentation methods for forgery detection are highly desirable. In this work, we examine the potential of incorporating synthetic artworks into training datasets to enhance the performance of forgery detection. Our investigation focuses on paintings by Vincent van Gogh, for which we release the first dataset specialized for forgery detection. To reinforce our results, we conduct the same analyses on the artists Amedeo Modigliani and Raphael. We train a classifier to distinguish original artworks from forgeries. For this, we use human-made forgeries and imitations in the style of well-known artists and augment our training sets with images in a similar style",
    "link": "https://arxiv.org/abs/2312.14998",
    "context": "Title: Synthetic images aid the recognition of human-made art forgeries\nAbstract: arXiv:2312.14998v3 Announce Type: replace-cross  Abstract: Previous research has shown that Artificial Intelligence is capable of distinguishing between authentic paintings by a given artist and human-made forgeries with remarkable accuracy, provided sufficient training. However, with the limited amount of existing known forgeries, augmentation methods for forgery detection are highly desirable. In this work, we examine the potential of incorporating synthetic artworks into training datasets to enhance the performance of forgery detection. Our investigation focuses on paintings by Vincent van Gogh, for which we release the first dataset specialized for forgery detection. To reinforce our results, we conduct the same analyses on the artists Amedeo Modigliani and Raphael. We train a classifier to distinguish original artworks from forgeries. For this, we use human-made forgeries and imitations in the style of well-known artists and augment our training sets with images in a similar style",
    "path": "papers/23/12/2312.14998.json",
    "total_tokens": 832,
    "translated_title": "合成图像有助于识别人工制作的艺术赝品",
    "translated_abstract": "先前的研究已经表明，人工智能能够以卓越的准确度区分给定艺术家的真迹和人工制作的赝品，前提是有足够的训练。然而，由于已知赝品数量有限，增强赝品检测方法是非常可取的。在这项工作中，我们研究了将合成艺术作品纳入训练数据集以增强赝品检测性能的潜力。我们的研究重点是梵高的绘画作品，并发布了专门用于赝品检测的第一个数据集。为了加强我们的结果，我们还对艺术家亚美迪奥·莫迪利亚尼和拉斐尔进行了相同的分析。我们训练了一个分类器，用于区分原作品和赝品。为此，我们使用了人工制作的赝品和以知名艺术家风格仿制的作品，并将我们的训练集与类似风格的图像进行了增强。",
    "tldr": "通过在训练数据集中加入合成艺术作品，可以提高人工制作艺术赝品的检测性能。"
}