{
    "title": "A framework for conditional diffusion modelling with applications in motif scaffolding for protein design",
    "abstract": "arXiv:2312.09236v2 Announce Type: replace  Abstract: Many protein design applications, such as binder or enzyme design, require scaffolding a structural motif with high precision. Generative modelling paradigms based on denoising diffusion processes emerged as a leading candidate to address this motif scaffolding problem and have shown early experimental success in some cases. In the diffusion paradigm, motif scaffolding is treated as a conditional generation task, and several conditional generation protocols were proposed or imported from the Computer Vision literature. However, most of these protocols are motivated heuristically, e.g. via analogies to Langevin dynamics, and lack a unifying framework, obscuring connections between the different approaches. In this work, we unify conditional training and conditional sampling procedures under one common framework based on the mathematically well-understood Doob's h-transform. This new perspective allows us to draw connections between ex",
    "link": "https://arxiv.org/abs/2312.09236",
    "context": "Title: A framework for conditional diffusion modelling with applications in motif scaffolding for protein design\nAbstract: arXiv:2312.09236v2 Announce Type: replace  Abstract: Many protein design applications, such as binder or enzyme design, require scaffolding a structural motif with high precision. Generative modelling paradigms based on denoising diffusion processes emerged as a leading candidate to address this motif scaffolding problem and have shown early experimental success in some cases. In the diffusion paradigm, motif scaffolding is treated as a conditional generation task, and several conditional generation protocols were proposed or imported from the Computer Vision literature. However, most of these protocols are motivated heuristically, e.g. via analogies to Langevin dynamics, and lack a unifying framework, obscuring connections between the different approaches. In this work, we unify conditional training and conditional sampling procedures under one common framework based on the mathematically well-understood Doob's h-transform. This new perspective allows us to draw connections between ex",
    "path": "papers/23/12/2312.09236.json",
    "total_tokens": 833,
    "translated_title": "一种具有条件扩散建模框架的应用于蛋白设计中的基序支架",
    "translated_abstract": "许多蛋白设计应用，如结合物或酶的设计，需要以高精度搭建具有结构基序的蛋白质。基于去噪扩散过程的生成建模范式已成为解决这一基序支架问题的主要候选方案，并在某些情况下显示出早期实验成功。在扩散范式中，基序支架被视为一种条件生成任务，并提出了几种条件生成协议或从计算机视觉文献中导入。然而，这些协议大多基于启发性动机，例如通过对朗之万动力学的类比，并缺乏统一的框架，使得不同方法之间的联系变得模糊。在这项工作中，我们在一个基于数学上理解良好的Doob's h-transform的共同框架下统一了条件训练和条件抽样程序。这种新的视角使我们能够在不同方法之间建立联系",
    "tldr": "该论文提出一种统一的条件扩散建模框架，基于Doob's h-transform，用于解决蛋白设计中的基序支架问题",
    "en_tdlr": "The paper introduces a unified framework for conditional diffusion modeling based on Doob's h-transform to address motif scaffolding in protein design."
}