{
    "title": "Using Surprise Index for Competency Assessment in Autonomous Decision-Making. (arXiv:2312.09033v2 [cs.RO] UPDATED)",
    "abstract": "This paper considers the problem of evaluating an autonomous system's competency in performing a task, particularly when working in dynamic and uncertain environments. The inherent opacity of machine learning models, from the perspective of the user, often described as a `black box', poses a challenge. To overcome this, we propose using a measure called the Surprise index, which leverages available measurement data to quantify whether the dynamic system performs as expected. We show that the surprise index can be computed in closed form for dynamic systems when observed evidence in a probabilistic model if the joint distribution for that evidence follows a multivariate Gaussian marginal distribution. We then apply it to a nonlinear spacecraft maneuver problem, where actions are chosen by a reinforcement learning agent and show it can indicate how well the trajectory follows the required orbit.",
    "link": "http://arxiv.org/abs/2312.09033",
    "context": "Title: Using Surprise Index for Competency Assessment in Autonomous Decision-Making. (arXiv:2312.09033v2 [cs.RO] UPDATED)\nAbstract: This paper considers the problem of evaluating an autonomous system's competency in performing a task, particularly when working in dynamic and uncertain environments. The inherent opacity of machine learning models, from the perspective of the user, often described as a `black box', poses a challenge. To overcome this, we propose using a measure called the Surprise index, which leverages available measurement data to quantify whether the dynamic system performs as expected. We show that the surprise index can be computed in closed form for dynamic systems when observed evidence in a probabilistic model if the joint distribution for that evidence follows a multivariate Gaussian marginal distribution. We then apply it to a nonlinear spacecraft maneuver problem, where actions are chosen by a reinforcement learning agent and show it can indicate how well the trajectory follows the required orbit.",
    "path": "papers/23/12/2312.09033.json",
    "total_tokens": 793,
    "translated_title": "使用意外指数评估自主决策中的能力评估",
    "translated_abstract": "本文考虑了在动态和不确定环境中评估自主系统在执行任务时的能力的问题。机器学习模型的固有不透明性，从用户的角度来看，通常被描述为“黑匣子”，这是一个挑战。为了克服这个问题，我们提出使用一个称为“意外指数”的度量来利用可用的测量数据来量化动态系统是否按预期运行。我们展示了当观测到的证据在概率模型中的联合分布遵循多元高斯边缘分布时，意外指数可以以闭合形式计算动态系统。然后，我们将其应用于非线性航天器机动问题，在该问题中，动作由强化学习代理选择，并且我们展示它可以指示轨道如何跟随所需轨道。",
    "tldr": "本文提出了一种使用意外指数来评估自主决策中能力的方法，该指标可以利用测量数据量化动态系统是否按预期运行。该方法在非线性航天器机动问题中有应用。",
    "en_tdlr": "This paper proposes a method for assessing competency in autonomous decision-making using the Surprise index, which quantifies whether a dynamic system performs as expected. The approach is demonstrated in a nonlinear spacecraft maneuver problem."
}