{
    "title": "Fully Convolutional Slice-to-Volume Reconstruction for Single-Stack MRI",
    "abstract": "arXiv:2312.03102v2 Announce Type: replace-cross  Abstract: In magnetic resonance imaging (MRI), slice-to-volume reconstruction (SVR) refers to computational reconstruction of an unknown 3D magnetic resonance volume from stacks of 2D slices corrupted by motion. While promising, current SVR methods require multiple slice stacks for accurate 3D reconstruction, leading to long scans and limiting their use in time-sensitive applications such as fetal fMRI. Here, we propose a SVR method that overcomes the shortcomings of previous work and produces state-of-the-art reconstructions in the presence of extreme inter-slice motion. Inspired by the recent success of single-view depth estimation methods, we formulate SVR as a single-stack motion estimation task and train a fully convolutional network to predict a motion stack for a given slice stack, producing a 3D reconstruction as a byproduct of the predicted motion. Extensive experiments on the SVR of adult and fetal brains demonstrate that our f",
    "link": "https://arxiv.org/abs/2312.03102",
    "context": "Title: Fully Convolutional Slice-to-Volume Reconstruction for Single-Stack MRI\nAbstract: arXiv:2312.03102v2 Announce Type: replace-cross  Abstract: In magnetic resonance imaging (MRI), slice-to-volume reconstruction (SVR) refers to computational reconstruction of an unknown 3D magnetic resonance volume from stacks of 2D slices corrupted by motion. While promising, current SVR methods require multiple slice stacks for accurate 3D reconstruction, leading to long scans and limiting their use in time-sensitive applications such as fetal fMRI. Here, we propose a SVR method that overcomes the shortcomings of previous work and produces state-of-the-art reconstructions in the presence of extreme inter-slice motion. Inspired by the recent success of single-view depth estimation methods, we formulate SVR as a single-stack motion estimation task and train a fully convolutional network to predict a motion stack for a given slice stack, producing a 3D reconstruction as a byproduct of the predicted motion. Extensive experiments on the SVR of adult and fetal brains demonstrate that our f",
    "path": "papers/23/12/2312.03102.json",
    "total_tokens": 817,
    "translated_title": "单栈MRI的全卷积切片到体重建",
    "translated_abstract": "在磁共振成像（MRI）中，切片到体重建（SVR）指的是从受运动干扰的2D切片堆叠中对未知的3D磁共振体积进行计算重建。我们提出了一种SVR方法，它克服了先前工作的缺点，在极端切片间运动的情况下产生最先进的重建。受单视图深度估计方法的最新成功启发，我们将SVR构建为单栈运动估计任务，训练一个全卷积网络来预测给定切片栈的运动栈，从而产生3D重建作为预测运动的副产品。对成人和胎儿大脑的SVR进行了大量实验，证明了我们的方法优于现有技术。",
    "tldr": "提出了一种全新的单栈MRI重建方法，通过将SVR构建为单栈运动估计任务，训练全卷积网络进行预测，实现在极端运动情况下的最先进3D重建。",
    "en_tdlr": "Proposed a novel single-stack MRI reconstruction method which formulates SVR as a single-stack motion estimation task, trained a fully convolutional network for prediction, achieving state-of-the-art 3D reconstruction under extreme motion conditions."
}