{
    "title": "Industrial Internet of Things Intelligence Empowering Smart Manufacturing: A Literature Review",
    "abstract": "arXiv:2312.16174v2 Announce Type: replace  Abstract: The fiercely competitive business environment and increasingly personalized customization needs are driving the digital transformation and upgrading of the manufacturing industry. IIoT intelligence, which can provide innovative and efficient solutions for various aspects of the manufacturing value chain, illuminates the path of transformation for the manufacturing industry. It's time to provide a systematic vision of IIoT intelligence. However, existing surveys often focus on specific areas of IIoT intelligence, leading researchers and readers to have biases in their understanding of IIoT intelligence, that is, believing that research in one direction is the most important for the development of IIoT intelligence, while ignoring contributions from other directions. Therefore, this paper provides a comprehensive overview of IIoT intelligence. We first conduct an in-depth analysis of the inevitability of manufacturing transformation an",
    "link": "https://arxiv.org/abs/2312.16174",
    "context": "Title: Industrial Internet of Things Intelligence Empowering Smart Manufacturing: A Literature Review\nAbstract: arXiv:2312.16174v2 Announce Type: replace  Abstract: The fiercely competitive business environment and increasingly personalized customization needs are driving the digital transformation and upgrading of the manufacturing industry. IIoT intelligence, which can provide innovative and efficient solutions for various aspects of the manufacturing value chain, illuminates the path of transformation for the manufacturing industry. It's time to provide a systematic vision of IIoT intelligence. However, existing surveys often focus on specific areas of IIoT intelligence, leading researchers and readers to have biases in their understanding of IIoT intelligence, that is, believing that research in one direction is the most important for the development of IIoT intelligence, while ignoring contributions from other directions. Therefore, this paper provides a comprehensive overview of IIoT intelligence. We first conduct an in-depth analysis of the inevitability of manufacturing transformation an",
    "path": "papers/23/12/2312.16174.json",
    "total_tokens": 795,
    "translated_title": "工业物联网智能赋能智能制造：一篇文献综述",
    "translated_abstract": "竞争激烈的商业环境和日益个性化的定制需求推动着制造业的数字化转型和升级。工业物联网智能能够为制造价值链的各个方面提供创新高效的解决方案，为制造业的转型提供指引。现在是提供工业物联网智能系统性视野的时候了。然而，现有调查往往集中在工业物联网智能的特定领域，导致研究者和读者在理解工业物联网智能时存在偏见，即认为在一个方向上的研究对工业物联网智能的发展最重要，而忽略了其他方向的贡献。因此，本文提供了工业物联网智能的全面概述。我们首先对制造业转型的必然性进行了深入分析",
    "tldr": "本文提供了对工业物联网智能的全面概述，弥补了现有调查偏见，为制造业的转型提供了指引。",
    "en_tdlr": "This paper provides a comprehensive overview of IIoT intelligence, addressing biases in existing surveys and offering guidance for the transformation of the manufacturing industry."
}