{
    "title": "Demand response for residential building heating: Effective Monte Carlo Tree Search control based on physics-informed neural networks. (arXiv:2312.03365v2 [eess.SY] UPDATED)",
    "abstract": "Controlling energy consumption in buildings through demand response (DR) has become increasingly important to reduce global carbon emissions and limit climate change. In this paper, we specifically focus on controlling the heating system of a residential building to optimize its energy consumption while respecting user's thermal comfort. Recent works in this area have mainly focused on either model-based control, e.g., model predictive control (MPC), or model-free reinforcement learning (RL) to implement practical DR algorithms. A specific RL method that recently has achieved impressive success in domains such as board games (go, chess) is Monte Carlo Tree Search (MCTS). Yet, for building control it has remained largely unexplored. Thus, we study MCTS specifically for building demand response. Its natural structure allows a flexible optimization that implicitly integrate exogenous constraints (as opposed, for example, to conventional RL solutions), making MCTS a promising candidate for",
    "link": "http://arxiv.org/abs/2312.03365",
    "context": "Title: Demand response for residential building heating: Effective Monte Carlo Tree Search control based on physics-informed neural networks. (arXiv:2312.03365v2 [eess.SY] UPDATED)\nAbstract: Controlling energy consumption in buildings through demand response (DR) has become increasingly important to reduce global carbon emissions and limit climate change. In this paper, we specifically focus on controlling the heating system of a residential building to optimize its energy consumption while respecting user's thermal comfort. Recent works in this area have mainly focused on either model-based control, e.g., model predictive control (MPC), or model-free reinforcement learning (RL) to implement practical DR algorithms. A specific RL method that recently has achieved impressive success in domains such as board games (go, chess) is Monte Carlo Tree Search (MCTS). Yet, for building control it has remained largely unexplored. Thus, we study MCTS specifically for building demand response. Its natural structure allows a flexible optimization that implicitly integrate exogenous constraints (as opposed, for example, to conventional RL solutions), making MCTS a promising candidate for",
    "path": "papers/23/12/2312.03365.json",
    "total_tokens": 1015,
    "translated_title": "住宅建筑供暖的需求响应：基于物理启发神经网络的有效蒙特卡洛树搜索控制",
    "translated_abstract": "控制建筑物的能源消耗通过需求响应已成为减少全球碳排放和限制气候变化的越来越重要的手段。本文特别关注住宅建筑供暖系统的控制，以优化能源消耗同时保证用户的热舒适度。在这个领域，最近的研究主要集中在基于模型的控制，例如模型预测控制（MPC），或者基于模型无关的强化学习（RL）来实现实际的需求响应算法。蒙特卡洛树搜索（MCTS）是一种最近在棋盘游戏（围棋、国际象棋）等领域取得了令人印象深刻成功的RL方法。然而，在建筑控制方面，MCTS仍然被较少探索。因此，我们专门研究了MCTS在建筑需求响应方面的应用。其自然的结构允许灵活的优化，隐式地集成外部约束条件（与传统的RL解决方案相比），使MCTS成为一个有前景的候选方法。",
    "tldr": "本文重点研究了基于物理启发神经网络的蒙特卡洛树搜索控制方法在住宅建筑供暖的需求响应中的应用，该方法通过灵活的优化整合了外部约束条件，为实现能源消耗的优化和用户热舒适度的保证提供了有前景的解决方案。",
    "en_tdlr": "This paper focuses on the application of physics-informed neural networks and Monte Carlo Tree Search (MCTS) control in demand response for residential building heating. The MCTS method with its flexible optimization, which integrates external constraints implicitly, provides a promising solution for optimizing energy consumption while ensuring user comfort."
}