{
    "title": "FENet: Focusing Enhanced Network for Lane Detection. (arXiv:2312.17163v3 [cs.CV] UPDATED)",
    "abstract": "Inspired by human driving focus, this research pioneers networks augmented with Focusing Sampling, Partial Field of View Evaluation, Enhanced FPN architecture and Directional IoU Loss - targeted innovations addressing obstacles to precise lane detection for autonomous driving. Experiments demonstrate our Focusing Sampling strategy, emphasizing vital distant details unlike uniform approaches, significantly boosts both benchmark and practical curved/distant lane recognition accuracy essential for safety. While FENetV1 achieves state-of-the-art conventional metric performance via enhancements isolating perspective-aware contexts mimicking driver vision, FENetV2 proves most reliable on the proposed Partial Field analysis. Hence we specifically recommend V2 for practical lane navigation despite fractional degradation on standard entire-image measures. Future directions include collecting on-road data and integrating complementary dual frameworks to further breakthroughs guided by human perc",
    "link": "http://arxiv.org/abs/2312.17163",
    "context": "Title: FENet: Focusing Enhanced Network for Lane Detection. (arXiv:2312.17163v3 [cs.CV] UPDATED)\nAbstract: Inspired by human driving focus, this research pioneers networks augmented with Focusing Sampling, Partial Field of View Evaluation, Enhanced FPN architecture and Directional IoU Loss - targeted innovations addressing obstacles to precise lane detection for autonomous driving. Experiments demonstrate our Focusing Sampling strategy, emphasizing vital distant details unlike uniform approaches, significantly boosts both benchmark and practical curved/distant lane recognition accuracy essential for safety. While FENetV1 achieves state-of-the-art conventional metric performance via enhancements isolating perspective-aware contexts mimicking driver vision, FENetV2 proves most reliable on the proposed Partial Field analysis. Hence we specifically recommend V2 for practical lane navigation despite fractional degradation on standard entire-image measures. Future directions include collecting on-road data and integrating complementary dual frameworks to further breakthroughs guided by human perc",
    "path": "papers/23/12/2312.17163.json",
    "total_tokens": 935,
    "translated_title": "FENet: 增强聚焦网络用于车道检测",
    "translated_abstract": "受到人类驾驶注意力的启发，本研究首次开发了增强聚焦采样、部分视野评估、增强FPN架构和定向IoU损失的网络创新，解决了自动驾驶车道检测中的精准性障碍。实验证明，我们的聚焦采样策略，强调远处重要细节，与均匀方法相比，显著提高了基准和实际曲线/远距离车道识别的准确性，这对安全至关重要。虽然FENetV1通过模拟驾驶员视觉的透视感知上下文改进，实现了最先进的传统度量性能，但FENetV2在提出的部分视野分析中证明是最可靠的。因此，我们特别推荐V2用于实际车道导航，尽管在标准的整张图像测量上有轻微的降级。未来的方向包括收集实际道路数据和集成互补的双重框架，以进一步通过人类感知指导实现突破性进展。",
    "tldr": "FENet是一个增强聚焦网络用于精准车道检测，通过聚焦采样和部分视野评估等创新方法，显著提高了检测准确性，尤其适用于曲线和远距离车道，在安全性方面具有重要意义。",
    "en_tdlr": "FENet is an enhanced focusing network for precise lane detection, which significantly improves detection accuracy, especially for curved and distant lanes, through innovative methods such as focusing sampling and partial field evaluation, and has important implications for safety."
}