{
    "title": "Backstepping Neural Operators for $2\\times 2$ Hyperbolic PDEs. (arXiv:2312.16762v2 [math.OC] UPDATED)",
    "abstract": "Deep neural network approximation of nonlinear operators, commonly referred to as DeepONet, has proven capable of approximating PDE backstepping designs in which a single Goursat-form PDE governs a single feedback gain function. In boundary control of coupled PDEs, coupled Goursat-form PDEs govern two or more gain kernels -- a PDE structure unaddressed thus far with DeepONet. In this note, we open the subject of approximating systems of gain kernel PDEs for hyperbolic PDE plants by considering a simple counter-convecting $2\\times 2$ coupled system in whose control a $2\\times 2$ kernel PDE systems in Goursat form arises. Applications include oil drilling, Saint-Venant model of shallow water waves, and Aw-Rascle-Zhang model of stop-and-go instability in congested traffic flow. In this paper we establish the continuity of the mapping from (a total of five) plant PDE functional coefficients to the kernel PDE solutions, prove the existence of an arbitrarily close DeepONet approximation to t",
    "link": "http://arxiv.org/abs/2312.16762",
    "context": "Title: Backstepping Neural Operators for $2\\times 2$ Hyperbolic PDEs. (arXiv:2312.16762v2 [math.OC] UPDATED)\nAbstract: Deep neural network approximation of nonlinear operators, commonly referred to as DeepONet, has proven capable of approximating PDE backstepping designs in which a single Goursat-form PDE governs a single feedback gain function. In boundary control of coupled PDEs, coupled Goursat-form PDEs govern two or more gain kernels -- a PDE structure unaddressed thus far with DeepONet. In this note, we open the subject of approximating systems of gain kernel PDEs for hyperbolic PDE plants by considering a simple counter-convecting $2\\times 2$ coupled system in whose control a $2\\times 2$ kernel PDE systems in Goursat form arises. Applications include oil drilling, Saint-Venant model of shallow water waves, and Aw-Rascle-Zhang model of stop-and-go instability in congested traffic flow. In this paper we establish the continuity of the mapping from (a total of five) plant PDE functional coefficients to the kernel PDE solutions, prove the existence of an arbitrarily close DeepONet approximation to t",
    "path": "papers/23/12/2312.16762.json",
    "total_tokens": 1001,
    "translated_title": "Backstepping神经操作员用于$2\\times 2$双曲PDEs",
    "translated_abstract": "深度神经网络逼近非线性操作员，通常被称为DeepONet，在单个Goursat形式的PDE控制单个反馈增益函数的PDE反向设计中已被证明具有能力。在耦合PDE的边界控制中，耦合的Goursat形式PDE控制两个或多个增益核 - 这是迄今为止DeepONet未解决的PDE结构。在本文中，我们通过考虑一个简单的逆向传播$2\\times 2$耦合系统来打开超卷积$2\\times 2$核PDE系统的近似主题，其控制中出现了Goursat形式的PDE系统。应用包括石油钻井、浅水波的Saint-Venant模型以及密集交通流中的Aw-Rascle-Zhang模型的停车和行驶不稳定性。在本文中，我们建立了从（总共五个）植被PDE的功能系数到核PDE解的映射的连续性，证明了DeepONet逼近核PDE解的存在性",
    "tldr": "本文介绍了一种用于$2\\times 2$双曲PDE的Backstepping神经操作员方法。通过考虑耦合的Goursat形式PDE，并建立了从植被PDE功能系数到核PDE解的映射的连续性，证明了DeepONet逼近核PDE解的存在性",
    "en_tdlr": "This paper presents a Backstepping Neural Operator method for $2\\times 2$ hyperbolic PDEs. By considering coupled Goursat-form PDEs and establishing the continuity mapping from plant PDE functional coefficients to kernel PDE solutions, the existence of a DeepONet approximation to the kernel PDE solutions is proven."
}