{
    "title": "Knowledge Graph Error Detection with Contrastive Confidence Adaption. (arXiv:2312.12108v2 [cs.CL] UPDATED)",
    "abstract": "Knowledge graphs (KGs) often contain various errors. Previous works on detecting errors in KGs mainly rely on triplet embedding from graph structure. We conduct an empirical study and find that these works struggle to discriminate noise from semantically-similar correct triplets. In this paper, we propose a KG error detection model CCA to integrate both textual and graph structural information from triplet reconstruction for better distinguishing semantics. We design interactive contrastive learning to capture the differences between textual and structural patterns. Furthermore, we construct realistic datasets with semantically-similar noise and adversarial noise. Experimental results demonstrate that CCA outperforms state-of-the-art baselines, especially in detecting semantically-similar noise and adversarial noise.",
    "link": "http://arxiv.org/abs/2312.12108",
    "context": "Title: Knowledge Graph Error Detection with Contrastive Confidence Adaption. (arXiv:2312.12108v2 [cs.CL] UPDATED)\nAbstract: Knowledge graphs (KGs) often contain various errors. Previous works on detecting errors in KGs mainly rely on triplet embedding from graph structure. We conduct an empirical study and find that these works struggle to discriminate noise from semantically-similar correct triplets. In this paper, we propose a KG error detection model CCA to integrate both textual and graph structural information from triplet reconstruction for better distinguishing semantics. We design interactive contrastive learning to capture the differences between textual and structural patterns. Furthermore, we construct realistic datasets with semantically-similar noise and adversarial noise. Experimental results demonstrate that CCA outperforms state-of-the-art baselines, especially in detecting semantically-similar noise and adversarial noise.",
    "path": "papers/23/12/2312.12108.json",
    "total_tokens": 795,
    "translated_title": "使用对比置信度调整的知识图谱错误检测",
    "translated_abstract": "知识图谱（KGs）中常常包含各种错误。以往关于KG错误检测的研究主要依赖于从图结构中嵌入的三元组。我们进行了实证研究发现，这些方法在区分噪声和语义相似的正确三元组方面存在困难。本文提出了一种KG错误检测模型CCA，通过从三元组重构中综合文本和图结构信息，更好地区分语义。我们设计了交互式对比学习来捕捉文本和结构模式之间的差异。此外，我们构建了具有语义相似噪声和对抗性噪声的实际数据集。实验结果表明，CCA在检测语义相似噪声和对抗性噪声方面优于当前最先进的基线方法。",
    "tldr": "本文提出了一种使用对比学习和交互式对比学习的知识图谱错误检测模型CCA，通过综合文本和图结构信息，更好地区分语义，从而在检测噪声方面优于当前最先进的方法。"
}