{
    "title": "Unraveling Batch Normalization for Realistic Test-Time Adaptation. (arXiv:2312.09486v2 [cs.CV] UPDATED)",
    "abstract": "While recent test-time adaptations exhibit efficacy by adjusting batch normalization to narrow domain disparities, their effectiveness diminishes with realistic mini-batches due to inaccurate target estimation. As previous attempts merely introduce source statistics to mitigate this issue, the fundamental problem of inaccurate target estimation still persists, leaving the intrinsic test-time domain shifts unresolved. This paper delves into the problem of mini-batch degradation. By unraveling batch normalization, we discover that the inexact target statistics largely stem from the substantially reduced class diversity in batch. Drawing upon this insight, we introduce a straightforward tool, Test-time Exponential Moving Average (TEMA), to bridge the class diversity gap between training and testing batches. Importantly, our TEMA adaptively extends the scope of typical methods beyond the current batch to incorporate a diverse set of class information, which in turn boosts an accurate targe",
    "link": "http://arxiv.org/abs/2312.09486",
    "context": "Title: Unraveling Batch Normalization for Realistic Test-Time Adaptation. (arXiv:2312.09486v2 [cs.CV] UPDATED)\nAbstract: While recent test-time adaptations exhibit efficacy by adjusting batch normalization to narrow domain disparities, their effectiveness diminishes with realistic mini-batches due to inaccurate target estimation. As previous attempts merely introduce source statistics to mitigate this issue, the fundamental problem of inaccurate target estimation still persists, leaving the intrinsic test-time domain shifts unresolved. This paper delves into the problem of mini-batch degradation. By unraveling batch normalization, we discover that the inexact target statistics largely stem from the substantially reduced class diversity in batch. Drawing upon this insight, we introduce a straightforward tool, Test-time Exponential Moving Average (TEMA), to bridge the class diversity gap between training and testing batches. Importantly, our TEMA adaptively extends the scope of typical methods beyond the current batch to incorporate a diverse set of class information, which in turn boosts an accurate targe",
    "path": "papers/23/12/2312.09486.json",
    "total_tokens": 934,
    "translated_title": "揭示用于真实测试时适应的批次归一化方法",
    "translated_abstract": "尽管最近的测试时适应方法通过调整批次归一化来减小领域差异，但是当使用真实的小批量时，它们的有效性会降低，因为目标估计不准确。由于以前的尝试仅仅是引入源统计数据来缓解这个问题，因此目标估计不准确的基本问题仍然存在，使得测试时领域变化问题未解决。本文研究了小批量降级问题。通过揭示批次归一化的内部机制，我们发现不准确的目标统计主要来自于批次中类别多样性的大幅减少。根据这一发现，我们引入了一个直接的工具——测试时指数移动平均（TEMA），来弥补训练和测试批次之间类别多样性的差距。重要的是，我们的TEMA可适应地扩展了典型方法的范围，超越了当前批次的范围，以包含一个多样的类别信息集合，从而提高准确的目标估计。",
    "tldr": "本文研究了测试时领域适应的问题，通过揭示批次归一化的内部机制，并介绍了测试时指数移动平均（TEMA）方法来弥补训练和测试批次之间的类别多样性差距，从而提高了准确的目标估计。",
    "en_tdlr": "This paper investigates the problem of test-time domain adaptation, uncovering the insufficiency of batch normalization and proposing the Test-time Exponential Moving Average (TEMA) method to bridge the class diversity gap between training and testing batches, thus improving target estimation accuracy."
}