{
    "title": "Empowering Autonomous Driving with Large Language Models: A Safety Perspective",
    "abstract": "arXiv:2312.00812v4 Announce Type: replace  Abstract: Autonomous Driving (AD) encounters significant safety hurdles in long-tail unforeseen driving scenarios, largely stemming from the non-interpretability and poor generalization of the deep neural networks within the AD system, particularly in out-of-distribution and uncertain data. To this end, this paper explores the integration of Large Language Models (LLMs) into AD systems, leveraging their robust common-sense knowledge and reasoning abilities. The proposed methodologies employ LLMs as intelligent decision-makers in behavioral planning, augmented with a safety verifier shield for contextual safety learning, for enhancing driving performance and safety. We present two key studies in a simulated environment: an adaptive LLM-conditioned Model Predictive Control (MPC) and an LLM-enabled interactive behavior planning scheme with a state machine. Demonstrating superior performance and safety metrics compared to state-of-the-art approach",
    "link": "https://arxiv.org/abs/2312.00812",
    "context": "Title: Empowering Autonomous Driving with Large Language Models: A Safety Perspective\nAbstract: arXiv:2312.00812v4 Announce Type: replace  Abstract: Autonomous Driving (AD) encounters significant safety hurdles in long-tail unforeseen driving scenarios, largely stemming from the non-interpretability and poor generalization of the deep neural networks within the AD system, particularly in out-of-distribution and uncertain data. To this end, this paper explores the integration of Large Language Models (LLMs) into AD systems, leveraging their robust common-sense knowledge and reasoning abilities. The proposed methodologies employ LLMs as intelligent decision-makers in behavioral planning, augmented with a safety verifier shield for contextual safety learning, for enhancing driving performance and safety. We present two key studies in a simulated environment: an adaptive LLM-conditioned Model Predictive Control (MPC) and an LLM-enabled interactive behavior planning scheme with a state machine. Demonstrating superior performance and safety metrics compared to state-of-the-art approach",
    "path": "papers/23/12/2312.00812.json",
    "total_tokens": 842,
    "translated_title": "用大型语言模型赋能自动驾驶：一个安全的视角",
    "translated_abstract": "自动驾驶（AD）在长尾未知驾驶场景中遇到了重大的安全障碍，主要源自AD系统内部深度神经网络的不可解释性和泛化能力差，特别是在分布外和不确定数据方面。为此，本文探讨了将大型语言模型（LLM）整合到AD系统中，利用它们强大的常识知识和推理能力。所提出的方法将LLM用作行为规划中的智能决策者，配备一个安全验证器护盾进行上下文安全学习，以增强驾驶性能和安全性。我们在模拟环境中展示了两个关键研究：一种自适应LLM调节的模型预测控制（MPC）和一种带有状态机的LLM启用交互式行为规划方案。表现出比现有技术方法更优越的性能和安全度量指标。",
    "tldr": "本文通过整合大型语言模型（LLMs）到自动驾驶系统中，利用其常识知识和推理能力，作为智能决策者来增强驾驶性能和安全性。",
    "en_tdlr": "This paper enhances driving performance and safety by integrating Large Language Models (LLMs) into autonomous driving systems as intelligent decision-makers, leveraging their common-sense knowledge and reasoning abilities."
}