{
    "title": "Commonsense for Zero-Shot Natural Language Video Localization",
    "abstract": "Zero-shot Natural Language-Video Localization (NLVL) methods have exhibited promising results in training NLVL models exclusively with raw video data by dynamically generating video segments and pseudo-query annotations. However, existing pseudo-queries often lack grounding in the source video, resulting in unstructured and disjointed content. In this paper, we investigate the effectiveness of commonsense reasoning in zero-shot NLVL. Specifically, we present CORONET, a zero-shot NLVL framework that leverages commonsense to bridge the gap between videos and generated pseudo-queries via a commonsense enhancement module. CORONET employs Graph Convolution Networks (GCN) to encode commonsense information extracted from a knowledge graph, conditioned on the video, and cross-attention mechanisms to enhance the encoded video and pseudo-query representations prior to localization. Through empirical evaluations on two benchmark datasets, we demonstrate that CORONET surpasses both zero-shot and w",
    "link": "https://arxiv.org/abs/2312.17429",
    "context": "Title: Commonsense for Zero-Shot Natural Language Video Localization\nAbstract: Zero-shot Natural Language-Video Localization (NLVL) methods have exhibited promising results in training NLVL models exclusively with raw video data by dynamically generating video segments and pseudo-query annotations. However, existing pseudo-queries often lack grounding in the source video, resulting in unstructured and disjointed content. In this paper, we investigate the effectiveness of commonsense reasoning in zero-shot NLVL. Specifically, we present CORONET, a zero-shot NLVL framework that leverages commonsense to bridge the gap between videos and generated pseudo-queries via a commonsense enhancement module. CORONET employs Graph Convolution Networks (GCN) to encode commonsense information extracted from a knowledge graph, conditioned on the video, and cross-attention mechanisms to enhance the encoded video and pseudo-query representations prior to localization. Through empirical evaluations on two benchmark datasets, we demonstrate that CORONET surpasses both zero-shot and w",
    "path": "papers/23/12/2312.17429.json",
    "total_tokens": 882,
    "translated_title": "零样本自然语言视频定位中的常识推理",
    "translated_abstract": "零样本自然语言-视频定位（NLVL）方法通过动态生成视频片段和伪查询注释，在仅用原始视频数据训练NLVL模型方面取得了令人期待的结果。然而，现有的伪查询经常缺乏对源视频的扎实基础，导致内容不结构化和不连贯。本文研究了零样本NLVL中常识推理的有效性。具体而言，我们提出了CORONET，一个零样本NLVL框架，通过常识增强模块桥接视频和生成的伪查询之间的差距。CORONET使用图卷积网络（GCN）来编码从知识图中提取的常识信息，条件是视频，以及交叉注意机制来增强编码视频和伪查询表示以进行定位。通过对两个基准数据集进行实证评估，我们证明CORONET在零样本和传统NLVL方法上都取得了优越的结果。",
    "tldr": "本文研究了零样本自然语言-视频定位中常识推理的有效性，并提出了CORONET框架，该框架利用常识进行视频和生成的伪查询之间的桥接。实验证明CORONET在零样本和传统NLVL方法上都取得了优越的结果。"
}