{
    "title": "PINN surrogate of Li-ion battery models for parameter inference. Part I: Implementation and multi-fidelity hierarchies for the single-particle model",
    "abstract": "arXiv:2312.17329v2 Announce Type: replace  Abstract: To plan and optimize energy storage demands that account for Li-ion battery aging dynamics, techniques need to be developed to diagnose battery internal states accurately and rapidly. This study seeks to reduce the computational resources needed to determine a battery's internal states by replacing physics-based Li-ion battery models -- such as the single-particle model (SPM) and the pseudo-2D (P2D) model -- with a physics-informed neural network (PINN) surrogate. The surrogate model makes high-throughput techniques, such as Bayesian calibration, tractable to determine battery internal parameters from voltage responses. This manuscript is the first of a two-part series that introduces PINN surrogates of Li-ion battery models for parameter inference (i.e., state-of-health diagnostics). In this first part, a method is presented for constructing a PINN surrogate of the SPM. A multi-fidelity hierarchical training, where several neural ne",
    "link": "https://arxiv.org/abs/2312.17329",
    "context": "Title: PINN surrogate of Li-ion battery models for parameter inference. Part I: Implementation and multi-fidelity hierarchies for the single-particle model\nAbstract: arXiv:2312.17329v2 Announce Type: replace  Abstract: To plan and optimize energy storage demands that account for Li-ion battery aging dynamics, techniques need to be developed to diagnose battery internal states accurately and rapidly. This study seeks to reduce the computational resources needed to determine a battery's internal states by replacing physics-based Li-ion battery models -- such as the single-particle model (SPM) and the pseudo-2D (P2D) model -- with a physics-informed neural network (PINN) surrogate. The surrogate model makes high-throughput techniques, such as Bayesian calibration, tractable to determine battery internal parameters from voltage responses. This manuscript is the first of a two-part series that introduces PINN surrogates of Li-ion battery models for parameter inference (i.e., state-of-health diagnostics). In this first part, a method is presented for constructing a PINN surrogate of the SPM. A multi-fidelity hierarchical training, where several neural ne",
    "path": "papers/23/12/2312.17329.json",
    "total_tokens": 838,
    "translated_title": "基于 PINN 的锂离子电池参数推断代理模型。第一部分：实现与多保真度等级结构用于单粒子模型",
    "translated_abstract": "规划和优化能量存储需求需要考虑锂离子电池老化动态，因此需要开发技术准确快速地诊断电池内部状态。本研究旨在通过用基于物理的锂离子电池模型（如单粒子模型（SPM）和伪二维（P2D）模型）替代，使用物理信息神经网络（PINN）代理来减少确定电池内部状态所需的计算资源。这项研究是一项两部分系列的第一部分，介绍了用于参数推断（即健康状态诊断）的锂离子电池模型的PINN代理。在这第一部分中，提出了一个构建SPM的PINN代理的方法。通过多保真度分层训练，其中有几个神经网络",
    "tldr": "通过PINN代理模型替代基于物理的锂离子电池模型，帮助减少计算资源，用于快速准确诊断电池内部状态。",
    "en_tdlr": "The study introduces PINN surrogate models for Li-ion battery models to reduce computational resources and accurately diagnose battery internal states."
}