{
    "title": "Learning Unknown Intervention Targets in Structural Causal Models from Heterogeneous Data",
    "abstract": "arXiv:2312.06091v2 Announce Type: replace-cross  Abstract: We study the problem of identifying the unknown intervention targets in structural causal models where we have access to heterogeneous data collected from multiple environments. The unknown intervention targets are the set of endogenous variables whose corresponding exogenous noises change across the environments. We propose a two-phase approach which in the first phase recovers the exogenous noises corresponding to unknown intervention targets whose distributions have changed across environments. In the second phase, the recovered noises are matched with the corresponding endogenous variables. For the recovery phase, we provide sufficient conditions for learning these exogenous noises up to some component-wise invertible transformation. For the matching phase, under the causal sufficiency assumption, we show that the proposed method uniquely identifies the intervention targets. In the presence of latent confounders, the interv",
    "link": "https://arxiv.org/abs/2312.06091",
    "context": "Title: Learning Unknown Intervention Targets in Structural Causal Models from Heterogeneous Data\nAbstract: arXiv:2312.06091v2 Announce Type: replace-cross  Abstract: We study the problem of identifying the unknown intervention targets in structural causal models where we have access to heterogeneous data collected from multiple environments. The unknown intervention targets are the set of endogenous variables whose corresponding exogenous noises change across the environments. We propose a two-phase approach which in the first phase recovers the exogenous noises corresponding to unknown intervention targets whose distributions have changed across environments. In the second phase, the recovered noises are matched with the corresponding endogenous variables. For the recovery phase, we provide sufficient conditions for learning these exogenous noises up to some component-wise invertible transformation. For the matching phase, under the causal sufficiency assumption, we show that the proposed method uniquely identifies the intervention targets. In the presence of latent confounders, the interv",
    "path": "papers/23/12/2312.06091.json",
    "total_tokens": 785,
    "translated_title": "从异构数据中学习结构因果模型中的未知干预目标",
    "translated_abstract": "我们研究了在结构因果模型中识别未知干预目标的问题，其中我们可以访问从多个环境中收集的异构数据。未知干预目标是一组内生变量，其相应的外生噪声在不同环境中发生变化。我们提出了一个两阶段方法，第一阶段中恢复了跨不同环境发生变化的未知干预目标对应的外生噪声。在第二阶段，恢复的噪声与相应的内生变量进行匹配。对于恢复阶段，我们提供了学习这些外生噪声的充分条件，可达到某种分量方向可逆转换。对于匹配阶段，在因果充分性假设下，我们证明了所提方法可以唯一地识别干预目标。",
    "tldr": "在结构因果模型中，通过两阶段方法学习未知干预目标的外生噪声，并将其与相应的内生变量匹配，有效地识别干预目标。",
    "en_tdlr": "Effectively identify intervention targets in structural causal models by learning exogenous noises of unknown intervention targets and matching them with corresponding endogenous variables through a two-phase approach."
}