{
    "title": "Quality-Diversity Generative Sampling for Learning with Synthetic Data",
    "abstract": "arXiv:2312.14369v2 Announce Type: replace-cross  Abstract: Generative models can serve as surrogates for some real data sources by creating synthetic training datasets, but in doing so they may transfer biases to downstream tasks. We focus on protecting quality and diversity when generating synthetic training datasets. We propose quality-diversity generative sampling (QDGS), a framework for sampling data uniformly across a user-defined measure space, despite the data coming from a biased generator. QDGS is a model-agnostic framework that uses prompt guidance to optimize a quality objective across measures of diversity for synthetically generated data, without fine-tuning the generative model. Using balanced synthetic datasets generated by QDGS, we first debias classifiers trained on color-biased shape datasets as a proof-of-concept. By applying QDGS to facial data synthesis, we prompt for desired semantic concepts, such as skin tone and age, to create an intersectional dataset with a c",
    "link": "https://arxiv.org/abs/2312.14369",
    "context": "Title: Quality-Diversity Generative Sampling for Learning with Synthetic Data\nAbstract: arXiv:2312.14369v2 Announce Type: replace-cross  Abstract: Generative models can serve as surrogates for some real data sources by creating synthetic training datasets, but in doing so they may transfer biases to downstream tasks. We focus on protecting quality and diversity when generating synthetic training datasets. We propose quality-diversity generative sampling (QDGS), a framework for sampling data uniformly across a user-defined measure space, despite the data coming from a biased generator. QDGS is a model-agnostic framework that uses prompt guidance to optimize a quality objective across measures of diversity for synthetically generated data, without fine-tuning the generative model. Using balanced synthetic datasets generated by QDGS, we first debias classifiers trained on color-biased shape datasets as a proof-of-concept. By applying QDGS to facial data synthesis, we prompt for desired semantic concepts, such as skin tone and age, to create an intersectional dataset with a c",
    "path": "papers/23/12/2312.14369.json",
    "total_tokens": 865,
    "translated_title": "基于质量-多样性生成抽样的合成数据学习",
    "translated_abstract": "生成模型可以通过创建合成训练数据集作为某些真实数据源的替代品，但在这样做的过程中，它们可能会将偏见传递给下游任务。我们关注在生成合成训练数据时如何保护质量和多样性。我们提出了质量-多样性生成抽样（QDGS），这是一个框架，用于在用户定义的度量空间中均匀抽样数据，尽管数据来自一个存在偏见的生成器。QDGS是一个与模型无关的框架，利用提示指导来优化跨度量多样性的质量目标，而无需微调生成模型。使用QDGS生成的平衡合成数据集，我们首先消除了对基于颜色偏见的形状数据集的分类器的偏见，作为概念验证。通过将QDGS应用于面部数据合成，我们提示需要的语义概念，如肤色和年龄，以创建一个具有交集数据集。",
    "tldr": "提出了质量-多样性生成抽样（QDGS）框架, 实现了在生成合成训练数据时保护质量和多样性的目标, 并成功用于去偏向分类器和面部数据合成领域。"
}