{
    "title": "DeepTreeGANv2: Iterative Pooling of Point Clouds. (arXiv:2312.00042v2 [physics.data-an] UPDATED)",
    "abstract": "In High Energy Physics, detailed and time-consuming simulations are used for particle interactions with detectors. To bypass these simulations with a generative model, the generation of large point clouds in a short time is required, while the complex dependencies between the particles must be correctly modelled. Particle showers are inherently tree-based processes, as each particle is produced by the decay or detector interaction of a particle of the previous generation. In this work, we present a significant extension to DeepTreeGAN, featuring a critic, that is able to aggregate such point clouds iteratively in a tree-based manner. We show that this model can reproduce complex distributions, and we evaluate its performance on the public JetNet 150 dataset.",
    "link": "http://arxiv.org/abs/2312.00042",
    "context": "Title: DeepTreeGANv2: Iterative Pooling of Point Clouds. (arXiv:2312.00042v2 [physics.data-an] UPDATED)\nAbstract: In High Energy Physics, detailed and time-consuming simulations are used for particle interactions with detectors. To bypass these simulations with a generative model, the generation of large point clouds in a short time is required, while the complex dependencies between the particles must be correctly modelled. Particle showers are inherently tree-based processes, as each particle is produced by the decay or detector interaction of a particle of the previous generation. In this work, we present a significant extension to DeepTreeGAN, featuring a critic, that is able to aggregate such point clouds iteratively in a tree-based manner. We show that this model can reproduce complex distributions, and we evaluate its performance on the public JetNet 150 dataset.",
    "path": "papers/23/12/2312.00042.json",
    "total_tokens": 800,
    "translated_title": "DeepTreeGANv2：迭代池化的点云生成网络",
    "translated_abstract": "在高能物理学中，为了模拟粒子与探测器的相互作用，需要进行详细而耗时的模拟。为了通过生成模型绕过这些模拟，需要在短时间内生成大型点云，同时正确建模粒子之间的复杂依赖关系。粒子阵列固有地基于树状过程，因为每个粒子是上一代粒子的衰变或探测器相互作用产生的。在这项工作中，我们提出了DeepTreeGANv2，这是DeepTreeGAN的显著扩展，具有一个评论者，能够以树状方式迭代地聚合这样的点云。我们展示了该模型能够重现复杂分布，并在公共的JetNet 150数据集上评估了其性能。",
    "tldr": "这项工作介绍了DeepTreeGANv2，它是DeepTreeGAN的显著扩展，能够以树状方式迭代地聚合点云，模拟粒子与探测器的相互作用，实现在短时间内生成大型点云的目标。",
    "en_tdlr": "This work presents DeepTreeGANv2, a significant extension to DeepTreeGAN that iteratively aggregates point clouds in a tree-based manner to simulate particle interactions with detectors and achieve the goal of generating large point clouds in a short time."
}