{
    "title": "Towards Verifiable Text Generation with Evolving Memory and Self-Reflection. (arXiv:2312.09075v2 [cs.CL] UPDATED)",
    "abstract": "Despite the remarkable ability of large language models (LLMs) in language comprehension and generation, they often suffer from producing factually incorrect information, also known as hallucination. A promising solution to this issue is verifiable text generation, which prompts LLMs to generate content with citations for accuracy verification. However, verifiable text generation is non-trivial due to the focus-shifting phenomenon, the intricate reasoning needed to align the claim with correct citations, and the dilemma between the precision and breadth of retrieved documents. In this paper, we present VTG, an innovative framework for Verifiable Text Generation with evolving memory and self-reflection. VTG introduces evolving long short-term memory to retain both valuable documents and recent documents. A two-tier verifier equipped with an evidence finder is proposed to rethink and reflect on the relationship between the claim and citations. Furthermore, active retrieval and diverse qu",
    "link": "http://arxiv.org/abs/2312.09075",
    "context": "Title: Towards Verifiable Text Generation with Evolving Memory and Self-Reflection. (arXiv:2312.09075v2 [cs.CL] UPDATED)\nAbstract: Despite the remarkable ability of large language models (LLMs) in language comprehension and generation, they often suffer from producing factually incorrect information, also known as hallucination. A promising solution to this issue is verifiable text generation, which prompts LLMs to generate content with citations for accuracy verification. However, verifiable text generation is non-trivial due to the focus-shifting phenomenon, the intricate reasoning needed to align the claim with correct citations, and the dilemma between the precision and breadth of retrieved documents. In this paper, we present VTG, an innovative framework for Verifiable Text Generation with evolving memory and self-reflection. VTG introduces evolving long short-term memory to retain both valuable documents and recent documents. A two-tier verifier equipped with an evidence finder is proposed to rethink and reflect on the relationship between the claim and citations. Furthermore, active retrieval and diverse qu",
    "path": "papers/23/12/2312.09075.json",
    "total_tokens": 922,
    "translated_title": "实现具有进化记忆和自我反思的可验证文本生成",
    "translated_abstract": "尽管大型语言模型（LLMs）在语言理解和生成方面具有出色能力，但它们往往会产生错误的信息，也被称为幻觉。解决这个问题的一个有希望的方法是可验证的文本生成，它促使LLMs生成具有引用以进行准确性验证的内容。然而，可验证的文本生成并不简单，因为存在焦点转移现象，需要复杂的推理来与正确的引文对齐，而且在检索文档的精确性和广度之间存在着两难。在本文中，我们提出了一种创新的具有进化记忆和自我反思的可验证文本生成框架VTG。VTG引入了进化型长短期记忆以保留有价值的文档和最近的文档。我们提出了一个配备证据发现器的两层验证器，用于重新思考和反思主张与引文之间的关系。此外，还采用主动检索和多样化的方式来提高论证的质量和广度。",
    "tldr": "本研究提出了一种名为VTG的创新框架，用于实现具有进化记忆和自我反思的可验证文本生成。通过引入进化型长短期记忆和两层验证器，VTG解决了大型语言模型在生成过程中出现的信息错误和准确性问题。"
}