{
    "title": "PIA: Your Personalized Image Animator via Plug-and-Play Modules in Text-to-Image Models",
    "abstract": "arXiv:2312.13964v2 Announce Type: replace-cross  Abstract: Recent advancements in personalized text-to-image (T2I) models have revolutionized content creation, empowering non-experts to generate stunning images with unique styles. While promising, adding realistic motions into these personalized images by text poses significant challenges in preserving distinct styles, high-fidelity details, and achieving motion controllability by text. In this paper, we present PIA, a Personalized Image Animator that excels in aligning with condition images, achieving motion controllability by text, and the compatibility with various personalized T2I models without specific tuning. To achieve these goals, PIA builds upon a base T2I model with well-trained temporal alignment layers, allowing for the seamless transformation of any personalized T2I model into an image animation model. A key component of PIA is the introduction of the condition module, which utilizes the condition frame and inter-frame af",
    "link": "https://arxiv.org/abs/2312.13964",
    "context": "Title: PIA: Your Personalized Image Animator via Plug-and-Play Modules in Text-to-Image Models\nAbstract: arXiv:2312.13964v2 Announce Type: replace-cross  Abstract: Recent advancements in personalized text-to-image (T2I) models have revolutionized content creation, empowering non-experts to generate stunning images with unique styles. While promising, adding realistic motions into these personalized images by text poses significant challenges in preserving distinct styles, high-fidelity details, and achieving motion controllability by text. In this paper, we present PIA, a Personalized Image Animator that excels in aligning with condition images, achieving motion controllability by text, and the compatibility with various personalized T2I models without specific tuning. To achieve these goals, PIA builds upon a base T2I model with well-trained temporal alignment layers, allowing for the seamless transformation of any personalized T2I model into an image animation model. A key component of PIA is the introduction of the condition module, which utilizes the condition frame and inter-frame af",
    "path": "papers/23/12/2312.13964.json",
    "total_tokens": 880,
    "translated_title": "PIA:通过插拔式模块在文本到图像模型中实现个性化图像动画",
    "translated_abstract": "最近个性化文本到图像（T2I）模型的进展已经彻底改变了内容创作，使非专家能够生成具有独特风格的惊人图像。然而，通过文本为这些个性化图像增加逼真的动作在保留独特风格、高保真细节和通过文本实现动作可控性方面面临着重大挑战。在本文中，我们提出了PIA，一种个性化图像动画生成器，其在与条件图像对齐、通过文本实现动作可控性以及与各种个性化T2I模型的兼容性上表现出色，无需特定调整。为了实现这些目标，PIA在基础T2I模型的基础上构建了经过良好训练的时间对齐层，从而实现了任何个性化T2I模型向图像动画模型的无缝转换。PIA的一个关键组件是引入条件模块，利用条件帧和帧间",
    "tldr": "PIA通过插拔式模块在文本到图像模型中实现个性化图像动画，并解决了保留独特风格、高保真细节和动作可控性的挑战",
    "en_tdlr": "PIA enables personalized image animation in text-to-image models through plug-and-play modules, addressing challenges in preserving distinct styles, high-fidelity details, and achieving motion controllability."
}