{
    "title": "Student Engagement Detection Using Emotion Analysis, Eye Tracking and Head Movement with Machine Learning. (arXiv:1909.12913v5 [cs.CV] UPDATED)",
    "abstract": "With the increase of distance learning, in general, and e-learning, in particular, having a system capable of determining the engagement of students is of primordial importance, and one of the biggest challenges, both for teachers, researchers and policy makers. Here, we present a system to detect the engagement level of the students. It uses only information provided by the typical built-in web-camera present in a laptop computer, and was designed to work in real time. We combine information about the movements of the eyes and head, and facial emotions to produce a concentration index with three classes of engagement: \"very engaged\", \"nominally engaged\" and \"not engaged at all\". The system was tested in a typical e-learning scenario, and the results show that it correctly identifies each period of time where students were \"very engaged\", \"nominally engaged\" and \"not engaged at all\". Additionally, the results also show that the students with best scores also have higher concentration i",
    "link": "http://arxiv.org/abs/1909.12913",
    "context": "Title: Student Engagement Detection Using Emotion Analysis, Eye Tracking and Head Movement with Machine Learning. (arXiv:1909.12913v5 [cs.CV] UPDATED)\nAbstract: With the increase of distance learning, in general, and e-learning, in particular, having a system capable of determining the engagement of students is of primordial importance, and one of the biggest challenges, both for teachers, researchers and policy makers. Here, we present a system to detect the engagement level of the students. It uses only information provided by the typical built-in web-camera present in a laptop computer, and was designed to work in real time. We combine information about the movements of the eyes and head, and facial emotions to produce a concentration index with three classes of engagement: \"very engaged\", \"nominally engaged\" and \"not engaged at all\". The system was tested in a typical e-learning scenario, and the results show that it correctly identifies each period of time where students were \"very engaged\", \"nominally engaged\" and \"not engaged at all\". Additionally, the results also show that the students with best scores also have higher concentration i",
    "path": "papers/19/09/1909.12913.json",
    "total_tokens": 987,
    "translated_title": "利用情绪分析、眼动和头部运动进行学生参与度检测的机器学习系统",
    "translated_abstract": "随着远程学习和在线学习的不断增多，建立一个能够确定学生参与度的系统对于教师、研究人员和政策制定者来说至关重要。本文提出了一个系统来检测学生参与度。它仅使用笔记本电脑内置的典型网络摄像头提供的信息，并被设计为实时工作。我们结合了眼睛和头部的运动信息以及面部表情来产生带有三种参与度分类的专注度指数：“非常参与度”，“名义上参与度”和“没有参与度”。该系统在典型的在线学习情形下进行了测试，结果显示它能够正确识别学生处于“非常参与度”，“名义上参与度”和“没有参与度”的时期。此外，结果还表明，成绩最好的学生也具有更高的专注度。",
    "tldr": "本文提出了一个利用情绪分析、眼动和头部运动进行学生参与度检测的机器学习系统。该系统能够使用笔记本电脑内置摄像头实时监测学生的专注度，通过结合眼睛和头部的运动信息以及面部表情来识别学生处于三种不同的参与度状态，并在典型的在线学习情境下进行了测试，结果表明其能够正确地识别学生的参与度水平。"
}