{
    "title": "Extending TrOCR for Text Localization-Free OCR of Full-Page Scanned Receipt Images. (arXiv:2212.05525v3 [cs.CL] UPDATED)",
    "abstract": "Digitization of scanned receipts aims to extract text from receipt images and save it into structured documents. This is usually split into two sub-tasks: text localization and optical character recognition (OCR). Most existing OCR models only focus on the cropped text instance images, which require the bounding box information provided by a text region detection model. Introducing an additional detector to identify the text instance images in advance adds complexity, however instance-level OCR models have very low accuracy when processing the whole image for the document-level OCR, such as receipt images containing multiple text lines arranged in various layouts. To this end, we propose a localization-free document-level OCR model for transcribing all the characters in a receipt image into an ordered sequence end-to-end. Specifically, we finetune the pretrained instance-level model TrOCR with randomly cropped image chunks, and gradually increase the image chunk size to generalize the ",
    "link": "http://arxiv.org/abs/2212.05525",
    "context": "Title: Extending TrOCR for Text Localization-Free OCR of Full-Page Scanned Receipt Images. (arXiv:2212.05525v3 [cs.CL] UPDATED)\nAbstract: Digitization of scanned receipts aims to extract text from receipt images and save it into structured documents. This is usually split into two sub-tasks: text localization and optical character recognition (OCR). Most existing OCR models only focus on the cropped text instance images, which require the bounding box information provided by a text region detection model. Introducing an additional detector to identify the text instance images in advance adds complexity, however instance-level OCR models have very low accuracy when processing the whole image for the document-level OCR, such as receipt images containing multiple text lines arranged in various layouts. To this end, we propose a localization-free document-level OCR model for transcribing all the characters in a receipt image into an ordered sequence end-to-end. Specifically, we finetune the pretrained instance-level model TrOCR with randomly cropped image chunks, and gradually increase the image chunk size to generalize the ",
    "path": "papers/22/12/2212.05525.json",
    "total_tokens": 850,
    "translated_title": "扩展TrOCR实现无文本定位的全页扫描收据图像OCR",
    "translated_abstract": "扫描收据的数字化旨在从收据图像中提取文本，并将其保存到结构化文档中。这通常分为两个子任务：文本定位和光学字符识别（OCR）。大多数现有的OCR模型只关注裁剪后的文本实例图像，这需要文本区域检测模型提供的边界框信息。然而，将额外的检测器引入以预先识别文本实例图像会增加复杂性，但基于实例的OCR模型在处理整个图像的文档级OCR时，如包含多行文本以各种布局方式排列的收据图像，准确率非常低。为此，我们提出了一种无需定位的文档级OCR模型，将收据图像中的所有字符转录为有序序列的端到端模型。具体而言，我们使用随机裁剪的图像块对预训练的实例级模型TrOCR进行微调，并逐渐增加图像块的大小以推广该模型的功能。",
    "tldr": "本研究提出了一种无需文本定位的文档级OCR模型，可以将收据图像中的所有字符转录为有序序列的端到端模型。",
    "en_tdlr": "This study proposes a localization-free document-level OCR model that transcribes all the characters in a receipt image into an ordered sequence end-to-end, without the need for text localization."
}