{
    "title": "Quantum Policy Gradient Algorithm with Optimized Action Decoding. (arXiv:2212.06663v2 [quant-ph] CROSS LISTED)",
    "abstract": "Quantum machine learning implemented by variational quantum circuits (VQCs) is considered a promising concept for the noisy intermediate-scale quantum computing era. Focusing on applications in quantum reinforcement learning, we propose a specific action decoding procedure for a quantum policy gradient approach. We introduce a novel quality measure that enables us to optimize the classical post-processing required for action selection, inspired by local and global quantum measurements. The resulting algorithm demonstrates a significant performance improvement in several benchmark environments. With this technique, we successfully execute a full training routine on a 5-qubit hardware device. Our method introduces only negligible classical overhead and has the potential to improve VQC-based algorithms beyond the field of quantum reinforcement learning.",
    "link": "http://arxiv.org/abs/2212.06663",
    "context": "Title: Quantum Policy Gradient Algorithm with Optimized Action Decoding. (arXiv:2212.06663v2 [quant-ph] CROSS LISTED)\nAbstract: Quantum machine learning implemented by variational quantum circuits (VQCs) is considered a promising concept for the noisy intermediate-scale quantum computing era. Focusing on applications in quantum reinforcement learning, we propose a specific action decoding procedure for a quantum policy gradient approach. We introduce a novel quality measure that enables us to optimize the classical post-processing required for action selection, inspired by local and global quantum measurements. The resulting algorithm demonstrates a significant performance improvement in several benchmark environments. With this technique, we successfully execute a full training routine on a 5-qubit hardware device. Our method introduces only negligible classical overhead and has the potential to improve VQC-based algorithms beyond the field of quantum reinforcement learning.",
    "path": "papers/22/12/2212.06663.json",
    "total_tokens": 847,
    "translated_title": "带有优化动作解码的量子策略梯度算法",
    "translated_abstract": "量子机器学习在变分量子电路（VQC）上的实现被认为是嘈杂的中间规模量子计算时代的一个有前途的概念。针对量子强化学习应用，我们提出了一种特定的行动解码程序，用于量子策略梯度方法。我们介绍了一种新的质量度量方法，使我们能够优化所需的经典后处理以进行行动选择，受到局部和全局量子测量的启发。所得到的算法在多个基准环境中表现出显著的性能改进。使用这种技术，我们成功地在一个5量子位硬件设备上执行了完整的训练流程。我们的方法只引入可以忽略不计的经典开销，并且有可能将基于VQC的算法推广到超出量子强化学习领域。",
    "tldr": "该论文介绍了一种带有优化动作解码的量子策略梯度算法，通过引入新的质量度量方法，优化了经典后处理，使其在量子强化学习应用中表现出显著的性能改进，并且该方法可以推广到更多领域中。",
    "en_tdlr": "This paper introduces a quantum policy gradient algorithm with optimized action decoding, which improves the performance for quantum reinforcement learning applications by introducing a novel quality measure to optimize the classical post-processing required for action selection, with negligible classical overhead, and has potential to extend to other fields beyond quantum reinforcement learning."
}