{
    "title": "Imagen Editor and EditBench: Advancing and Evaluating Text-Guided Image Inpainting. (arXiv:2212.06909v2 [cs.CV] UPDATED)",
    "abstract": "Text-guided image editing can have a transformative impact in supporting creative applications. A key challenge is to generate edits that are faithful to input text prompts, while consistent with input images. We present Imagen Editor, a cascaded diffusion model built, by fine-tuning Imagen on text-guided image inpainting. Imagen Editor's edits are faithful to the text prompts, which is accomplished by using object detectors to propose inpainting masks during training. In addition, Imagen Editor captures fine details in the input image by conditioning the cascaded pipeline on the original high resolution image. To improve qualitative and quantitative evaluation, we introduce EditBench, a systematic benchmark for text-guided image inpainting. EditBench evaluates inpainting edits on natural and generated images exploring objects, attributes, and scenes. Through extensive human evaluation on EditBench, we find that object-masking during training leads to across-the-board improvements in t",
    "link": "http://arxiv.org/abs/2212.06909",
    "context": "Title: Imagen Editor and EditBench: Advancing and Evaluating Text-Guided Image Inpainting. (arXiv:2212.06909v2 [cs.CV] UPDATED)\nAbstract: Text-guided image editing can have a transformative impact in supporting creative applications. A key challenge is to generate edits that are faithful to input text prompts, while consistent with input images. We present Imagen Editor, a cascaded diffusion model built, by fine-tuning Imagen on text-guided image inpainting. Imagen Editor's edits are faithful to the text prompts, which is accomplished by using object detectors to propose inpainting masks during training. In addition, Imagen Editor captures fine details in the input image by conditioning the cascaded pipeline on the original high resolution image. To improve qualitative and quantitative evaluation, we introduce EditBench, a systematic benchmark for text-guided image inpainting. EditBench evaluates inpainting edits on natural and generated images exploring objects, attributes, and scenes. Through extensive human evaluation on EditBench, we find that object-masking during training leads to across-the-board improvements in t",
    "path": "papers/22/12/2212.06909.json",
    "total_tokens": 943,
    "translated_abstract": "文本引导的图像编辑可以支持创意应用并产生革命性的影响。其中一个关键挑战是要生成忠实于输入文本提示的编辑，同时与输入图像一致。我们提出了Imagen Editor，这是一个级联扩散模型，通过在文本引导图像修复上微调Imagen来构建。Imagen Editor的编辑和输入的文本提示是一致的，这是通过使用目标检测器在训练过程中提出修复蒙版实现的。此外，Imagen Editor通过将级联流程与原始高分辨率图像相结合，可以捕获输入图像的细节。为了改进定量和定性评估，我们引入了EditBench，一个针对文本引导的图像修复的系统性基准。EditBench在自然和生成的图像上评估修复的效果，探索对象、属性和场景。通过在EditBench上进行广泛的人类评估，我们发现在训练过程中使用对象掩蔽技术可以在各方面提高修复效果。",
    "tldr": "介绍了Imagen Editor，使用级联扩散模型实现文本引导的图像修复，并引入EditBench作为系统性基准进行修复效果的评估，发现在训练过程中使用对象掩蔽技术可以在各方面提高修复效果。",
    "en_tdlr": "This paper introduces Imagen Editor, which achieves text-guided image inpainting through a cascaded diffusion model that is fine-tuned on text prompts, and EditBench as a systematic benchmark for evaluating the performance. Object-masking during training is found to be effective for improving the inpainting results in all aspects based on extensive human evaluation on EditBench."
}