{
    "title": "Agent-based Modeling and Simulation of Human Muscle For Development of Human Gait Analyzer Application",
    "abstract": "arXiv:2212.12760v2 Announce Type: replace  Abstract: Despite the fact that only a small portion of muscles are affected in motion disease and disorders, medical therapies do not distinguish between healthy and unhealthy muscles. In this paper, a method is devised in order to calculate the neural stimuli of the lower body during gait cycle and check if any group of muscles are not acting properly. For this reason, an agent-based model of human muscle is proposed. The agent is able to convert neural stimuli to force generated by the muscle and vice versa. It can be used in many researches including medical education and research and prosthesis development. Then, Boots algorithm is designed based on a biomechanical model of human lower body to do a reverse dynamics of human motion by computing the forces generated by each muscle group. Using the agent-driven model of human muscle and boots algorithm, a user-friendly application is developed which can calculate the number of neural stimuli",
    "link": "https://arxiv.org/abs/2212.12760",
    "context": "Title: Agent-based Modeling and Simulation of Human Muscle For Development of Human Gait Analyzer Application\nAbstract: arXiv:2212.12760v2 Announce Type: replace  Abstract: Despite the fact that only a small portion of muscles are affected in motion disease and disorders, medical therapies do not distinguish between healthy and unhealthy muscles. In this paper, a method is devised in order to calculate the neural stimuli of the lower body during gait cycle and check if any group of muscles are not acting properly. For this reason, an agent-based model of human muscle is proposed. The agent is able to convert neural stimuli to force generated by the muscle and vice versa. It can be used in many researches including medical education and research and prosthesis development. Then, Boots algorithm is designed based on a biomechanical model of human lower body to do a reverse dynamics of human motion by computing the forces generated by each muscle group. Using the agent-driven model of human muscle and boots algorithm, a user-friendly application is developed which can calculate the number of neural stimuli",
    "path": "papers/22/12/2212.12760.json",
    "total_tokens": 914,
    "translated_title": "基于代理的人体肌肉建模与仿真用于人体步态分析应用",
    "translated_abstract": "尽管仅有少部分肌肉受到运动疾病和紊乱的影响，但医疗疗法并未区分健康与不健康肌肉。本文提出了一种方法来计算步态周期中下半身的神经刺激，并检查是否有任何肌肉群没有正常工作。为此，提出了人体肌肉的基于代理的模型。该代理能够将神经刺激转化为肌肉产生的力，反之亦然。它可以在包括医学教育和研究以及假肢开发在内的许多研究中使用。然后，基于人体下半身的生物力学模型设计了Boots算法，通过计算每个肌肉群生成的力来进行人体运动的逆动力学。利用基于代理的人体肌肉模型和Boots算法，开发了一个用户友好的应用程序，可以计算神经刺激的数量。",
    "tldr": "提出了一种基于代理的人体肌肉模型，用于计算步态周期中下半身的神经刺激，检测肌肉群的工作情况，并设计了Boots算法进行人体运动的逆动力学，最终开发出用户友好的应用程序。",
    "en_tdlr": "A proxy-based human muscle model was proposed to calculate neural stimuli during the gait cycle, check the performance of muscle groups, and design the Boots algorithm for inverse dynamics of human motion, leading to the development of a user-friendly application."
}