{
    "title": "Sequential Predictive Conformal Inference for Time Series. (arXiv:2212.03463v3 [stat.ML] UPDATED)",
    "abstract": "We present a new distribution-free conformal prediction algorithm for sequential data (e.g., time series), called the \\textit{sequential predictive conformal inference} (\\texttt{SPCI}). We specifically account for the nature that time series data are non-exchangeable, and thus many existing conformal prediction algorithms are not applicable. The main idea is to adaptively re-estimate the conditional quantile of non-conformity scores (e.g., prediction residuals), upon exploiting the temporal dependence among them. More precisely, we cast the problem of conformal prediction interval as predicting the quantile of a future residual, given a user-specified point prediction algorithm. Theoretically, we establish asymptotic valid conditional coverage upon extending consistency analyses in quantile regression. Using simulation and real-data experiments, we demonstrate a significant reduction in interval width of \\texttt{SPCI} compared to other existing methods under the desired empirical cover",
    "link": "http://arxiv.org/abs/2212.03463",
    "context": "Title: Sequential Predictive Conformal Inference for Time Series. (arXiv:2212.03463v3 [stat.ML] UPDATED)\nAbstract: We present a new distribution-free conformal prediction algorithm for sequential data (e.g., time series), called the \\textit{sequential predictive conformal inference} (\\texttt{SPCI}). We specifically account for the nature that time series data are non-exchangeable, and thus many existing conformal prediction algorithms are not applicable. The main idea is to adaptively re-estimate the conditional quantile of non-conformity scores (e.g., prediction residuals), upon exploiting the temporal dependence among them. More precisely, we cast the problem of conformal prediction interval as predicting the quantile of a future residual, given a user-specified point prediction algorithm. Theoretically, we establish asymptotic valid conditional coverage upon extending consistency analyses in quantile regression. Using simulation and real-data experiments, we demonstrate a significant reduction in interval width of \\texttt{SPCI} compared to other existing methods under the desired empirical cover",
    "path": "papers/22/12/2212.03463.json",
    "total_tokens": 900,
    "translated_title": "时序数据的序列预测置信推断算法",
    "translated_abstract": "我们提出了一种新的分布自由的序列数据（例如时间序列）置信预测算法，称为“序列预测置信推断”（SPCI）。我们特别考虑到时间序列数据是不可交换的性质，因此许多现有的置信预测算法不适用。主要思想是在利用它们之间的时间依赖性时，自适应重新估计非一致性分数（例如预测残差）的条件分位数。更具体地，我们将置信预测区间的问题视为预测未来残差的分位数，给定用户指定的点预测算法。从理论上讲，在扩展分位数回归的一致性分析的基础上，我们建立了渐近有效的条件覆盖。通过模拟和真实数据实验，我们证明了SPCI相对于其他现有方法在所需经验覆盖下的区间宽度显著减小。",
    "tldr": "提出了一种新的适用于时序数据的自适应重新估计条件分位数的置信预测算法SPCI，相较于其他现有方法，SPCI在所需经验覆盖下的区间宽度显著减小。",
    "en_tdlr": "A new distribution-free conformal prediction algorithm for sequential data called Sequential Predictive Conformal Inference (SPCI) is presented, which adaptsively re-estimates the conditional quantile of non-conformity scores for time series data and establishes asymptotic valid conditional coverage. SPCI demonstrates a significant reduction in interval width compared to other existing methods under the desired empirical cover."
}