{
    "title": "Equivalence between the Fitness-Complexity and the Sinkhorn-Knopp algorithms",
    "abstract": "arXiv:2212.12356v2 Announce Type: replace  Abstract: We uncover the connection between the Fitness-Complexity algorithm, developed in the economic complexity field, and the Sinkhorn-Knopp algorithm, widely used in diverse domains ranging from computer science and mathematics to economics. Despite minor formal differences between the two methods, both converge to the same fixed-point solution up to normalization. The discovered connection allows us to derive a rigorous interpretation of the Fitness and the Complexity metrics as the potentials of a suitable energy function. Under this interpretation, high-energy products are unfeasible for low-fitness countries, which explains why the algorithm is effective at displaying nested patterns in bipartite networks. We also show that the proposed interpretation reveals the scale invariance of the Fitness-Complexity algorithm, which has practical implications for the algorithm's implementation in different datasets. Further, analysis of empirica",
    "link": "https://arxiv.org/abs/2212.12356",
    "context": "Title: Equivalence between the Fitness-Complexity and the Sinkhorn-Knopp algorithms\nAbstract: arXiv:2212.12356v2 Announce Type: replace  Abstract: We uncover the connection between the Fitness-Complexity algorithm, developed in the economic complexity field, and the Sinkhorn-Knopp algorithm, widely used in diverse domains ranging from computer science and mathematics to economics. Despite minor formal differences between the two methods, both converge to the same fixed-point solution up to normalization. The discovered connection allows us to derive a rigorous interpretation of the Fitness and the Complexity metrics as the potentials of a suitable energy function. Under this interpretation, high-energy products are unfeasible for low-fitness countries, which explains why the algorithm is effective at displaying nested patterns in bipartite networks. We also show that the proposed interpretation reveals the scale invariance of the Fitness-Complexity algorithm, which has practical implications for the algorithm's implementation in different datasets. Further, analysis of empirica",
    "path": "papers/22/12/2212.12356.json",
    "total_tokens": 850,
    "translated_title": "《健身复杂度算法与Sinkhorn-Knopp算法之间的等效性》",
    "translated_abstract": "我们揭示了经济复杂性领域中发展的健身复杂度算法与在涵盖从计算机科学和数学到经济学等不同领域中广泛使用的Sinkhorn-Knopp算法之间的联系。尽管这两种方法之间存在轻微的形式差异，但两者都收敛到相同的固定点解，直到归一化。发现的连接使我们能够推导出健身和复杂度指标作为适当能量函数的势能的严格解释。在这种解释下，高能量产品对于健身较低的国家是不可行的，这解释了为什么该算法在展示二部网络中嵌套模式方面有效。我们还展示了提出的解释揭示了健身复杂度算法的尺度不变性，这对于该算法在不同数据集中的实现具有实际意义。此外，对经验数据的进一步分析",
    "tldr": "揭示了健身复杂度算法与Sinkhorn-Knopp算法之间的等效性，以及通过固定点解的归一化揭示了健身和复杂度指标的能量函数解释。",
    "en_tdlr": "The paper uncovers the equivalence between the Fitness-Complexity and Sinkhorn-Knopp algorithms, revealing a rigorous interpretation of the Fitness and Complexity metrics as potentials of an energy function through fixed-point solutions up to normalization."
}