{
    "title": "Compositional Learning of Dynamical System Models Using Port-Hamiltonian Neural Networks. (arXiv:2212.00893v2 [cs.LG] UPDATED)",
    "abstract": "Many dynamical systems -- from robots interacting with their surroundings to large-scale multiphysics systems -- involve a number of interacting subsystems. Toward the objective of learning composite models of such systems from data, we present i) a framework for compositional neural networks, ii) algorithms to train these models, iii) a method to compose the learned models, iv) theoretical results that bound the error of the resulting composite models, and v) a method to learn the composition itself, when it is not known a priori. The end result is a modular approach to learning: neural network submodels are trained on trajectory data generated by relatively simple subsystems, and the dynamics of more complex composite systems are then predicted without requiring additional data generated by the composite systems themselves. We achieve this compositionality by representing the system of interest, as well as each of its subsystems, as a port-Hamiltonian neural network (PHNN) -- a class",
    "link": "http://arxiv.org/abs/2212.00893",
    "context": "Title: Compositional Learning of Dynamical System Models Using Port-Hamiltonian Neural Networks. (arXiv:2212.00893v2 [cs.LG] UPDATED)\nAbstract: Many dynamical systems -- from robots interacting with their surroundings to large-scale multiphysics systems -- involve a number of interacting subsystems. Toward the objective of learning composite models of such systems from data, we present i) a framework for compositional neural networks, ii) algorithms to train these models, iii) a method to compose the learned models, iv) theoretical results that bound the error of the resulting composite models, and v) a method to learn the composition itself, when it is not known a priori. The end result is a modular approach to learning: neural network submodels are trained on trajectory data generated by relatively simple subsystems, and the dynamics of more complex composite systems are then predicted without requiring additional data generated by the composite systems themselves. We achieve this compositionality by representing the system of interest, as well as each of its subsystems, as a port-Hamiltonian neural network (PHNN) -- a class",
    "path": "papers/22/12/2212.00893.json",
    "total_tokens": 807,
    "translated_title": "使用端口-哈密顿神经网络进行动态系统模型的组合学习",
    "translated_abstract": "许多动态系统都涉及许多相互作用的子系统，从与其周围环境交互的机器人到大规模的多物理系统。为了从数据中学习这种复合系统的模型，我们提出了一种组合神经网络框架，以及用于训练这些模型的算法，以及一种组合已学习模型的方法。最终结果是一种模块化的学习方法：神经网络子模型是在相对简单的子系统生成的轨迹数据上训练的，然后预测更复杂的复合系统的动力学，而不需要要求复合系统本身生成额外的数据。",
    "tldr": "本论文提出了一种组合学习动态系统模型的方法，使用端口-哈密顿神经网络来训练和组合子模型，从而实现模块化学习，避免需要更多复合系统数据的问题。",
    "en_tdlr": "This paper proposes a method for compositional learning of dynamical system models using Port-Hamiltonian Neural Networks (PHNN), which allows for modular approach to learning without requiring additional data from the composite systems, and introduces theoretical results that bound the error of the resulting composite models."
}