{
    "title": "Further analysis of multilevel Stein variational gradient descent with an application to the Bayesian inference of glacier ice models. (arXiv:2212.03366v2 [math.NA] UPDATED)",
    "abstract": "Multilevel Stein variational gradient descent is a method for particle-based variational inference that leverages hierarchies of surrogate target distributions with varying costs and fidelity to computationally speed up inference. The contribution of this work is twofold. First, an extension of a previous cost complexity analysis is presented that applies even when the exponential convergence rate of single-level Stein variational gradient descent depends on iteration-varying parameters. Second, multilevel Stein variational gradient descent is applied to a large-scale Bayesian inverse problem of inferring discretized basal sliding coefficient fields of the Arolla glacier ice. The numerical experiments demonstrate that the multilevel version achieves orders of magnitude speedups compared to its single-level version.",
    "link": "http://arxiv.org/abs/2212.03366",
    "context": "Title: Further analysis of multilevel Stein variational gradient descent with an application to the Bayesian inference of glacier ice models. (arXiv:2212.03366v2 [math.NA] UPDATED)\nAbstract: Multilevel Stein variational gradient descent is a method for particle-based variational inference that leverages hierarchies of surrogate target distributions with varying costs and fidelity to computationally speed up inference. The contribution of this work is twofold. First, an extension of a previous cost complexity analysis is presented that applies even when the exponential convergence rate of single-level Stein variational gradient descent depends on iteration-varying parameters. Second, multilevel Stein variational gradient descent is applied to a large-scale Bayesian inverse problem of inferring discretized basal sliding coefficient fields of the Arolla glacier ice. The numerical experiments demonstrate that the multilevel version achieves orders of magnitude speedups compared to its single-level version.",
    "path": "papers/22/12/2212.03366.json",
    "total_tokens": 791,
    "translated_title": "多层斯坦变分梯度下降的进一步分析及其在冰川冰模型贝叶斯推断中的应用",
    "translated_abstract": "多层斯坦变分梯度下降是一种基于粒子的变分推断方法，利用具有不同成本和保真度的替代目标分布的层次结构来加速推断。本文的贡献有两个方面：第一，提出了一种之前成本复杂度分析的扩展，即使单层斯坦变分梯度下降的指数收敛速率依赖于迭代变化的参数也适用。第二，将多层斯坦变分梯度下降应用于推断Arolla冰川冰的离散基底滑动系数场的大规模贝叶斯反问题。数值实验表明，多层版本相对于单层版本实现了数量级的加速。",
    "tldr": "本文研究了多层斯坦变分梯度下降在大规模贝叶斯反问题中的应用，实现了数量级的加速。",
    "en_tdlr": "This paper further analyzes the multilevel Stein variational gradient descent method and applies it to a large-scale Bayesian inverse problem in glacier ice modeling, achieving orders of magnitude speedups compared to its single-level version."
}