{
    "title": "A Neural Network Warm-Start Approach for the Inverse Acoustic Obstacle Scattering Problem. (arXiv:2212.08736v2 [math.NA] UPDATED)",
    "abstract": "We consider the inverse acoustic obstacle problem for sound-soft star-shaped obstacles in two dimensions wherein the boundary of the obstacle is determined from measurements of the scattered field at a collection of receivers outside the object. One of the standard approaches for solving this problem is to reformulate it as an optimization problem: finding the boundary of the domain that minimizes the $L^2$ distance between computed values of the scattered field and the given measurement data. The optimization problem is computationally challenging since the local set of convexity shrinks with increasing frequency and results in an increasing number of local minima in the vicinity of the true solution. In many practical experimental settings, low frequency measurements are unavailable due to limitations of the experimental setup or the sensors used for measurement. Thus, obtaining a good initial guess for the optimization problem plays a vital role in this environment.  We present a ne",
    "link": "http://arxiv.org/abs/2212.08736",
    "context": "Title: A Neural Network Warm-Start Approach for the Inverse Acoustic Obstacle Scattering Problem. (arXiv:2212.08736v2 [math.NA] UPDATED)\nAbstract: We consider the inverse acoustic obstacle problem for sound-soft star-shaped obstacles in two dimensions wherein the boundary of the obstacle is determined from measurements of the scattered field at a collection of receivers outside the object. One of the standard approaches for solving this problem is to reformulate it as an optimization problem: finding the boundary of the domain that minimizes the $L^2$ distance between computed values of the scattered field and the given measurement data. The optimization problem is computationally challenging since the local set of convexity shrinks with increasing frequency and results in an increasing number of local minima in the vicinity of the true solution. In many practical experimental settings, low frequency measurements are unavailable due to limitations of the experimental setup or the sensors used for measurement. Thus, obtaining a good initial guess for the optimization problem plays a vital role in this environment.  We present a ne",
    "path": "papers/22/12/2212.08736.json",
    "total_tokens": 900,
    "translated_title": "神经网络热启动方法用于声学障碍物散射问题的逆问题",
    "translated_abstract": "我们考虑在二维中的声学障碍物散射问题的逆问题，在这个问题中，通过对来自物体外部的一系列接收器接收到的散射场的测量来确定障碍物的边界。解决该问题的标准方法之一是将其重新表述为一个优化问题：找到最小化计算的散射场值与给定测量数据之间的$L^2$距离的区域边界。由于局部凸性随着频率增加而收缩，并在真解附近产生越来越多的局部最小值，这个优化问题在计算上具有挑战性。在许多实际实验设置中，由于实验装置或测量传感器的限制，低频测量是不可用的。因此，在这种环境中获得一个良好的优化问题初始猜测至关重要。",
    "tldr": "本文提出了一种神经网络热启动方法，用于解决声学障碍物散射问题的逆问题。该方法通过在计算散射场和给定测量数据之间的$L^2$距离的区域边界中找到良好的初始猜测，以克服计算上的挑战。"
}