{
    "title": "Score-based denoising for atomic structure identification. (arXiv:2212.02421v3 [cond-mat.mtrl-sci] UPDATED)",
    "abstract": "We propose an effective method for removing thermal vibrations that complicate the task of analyzing complex dynamics in atomistic simulation of condensed matter. Our method iteratively subtracts thermal noises or perturbations in atomic positions using a denoising score function trained on synthetically noised but otherwise perfect crystal lattices. The resulting denoised structures clearly reveal underlying crystal order while retaining disorder associated with crystal defects. Purely geometric, agnostic to interatomic potentials, and trained without inputs from explicit simulations, our denoiser can be applied to simulation data generated from vastly different interatomic interactions. The denoiser is shown to improve existing classification methods such as common neighbor analysis and polyhedral template matching, reaching perfect classification accuracy on a recent benchmark dataset of thermally perturbed structures up to the melting point. Demonstrated here in a wide variety of a",
    "link": "http://arxiv.org/abs/2212.02421",
    "context": "Title: Score-based denoising for atomic structure identification. (arXiv:2212.02421v3 [cond-mat.mtrl-sci] UPDATED)\nAbstract: We propose an effective method for removing thermal vibrations that complicate the task of analyzing complex dynamics in atomistic simulation of condensed matter. Our method iteratively subtracts thermal noises or perturbations in atomic positions using a denoising score function trained on synthetically noised but otherwise perfect crystal lattices. The resulting denoised structures clearly reveal underlying crystal order while retaining disorder associated with crystal defects. Purely geometric, agnostic to interatomic potentials, and trained without inputs from explicit simulations, our denoiser can be applied to simulation data generated from vastly different interatomic interactions. The denoiser is shown to improve existing classification methods such as common neighbor analysis and polyhedral template matching, reaching perfect classification accuracy on a recent benchmark dataset of thermally perturbed structures up to the melting point. Demonstrated here in a wide variety of a",
    "path": "papers/22/12/2212.02421.json",
    "total_tokens": 903,
    "translated_title": "基于评分的去噪算法在原子结构识别中的应用",
    "translated_abstract": "本论文提出了一种有效的方法，用于在分子模拟过程中分析复杂动态时去除热振动噪声。我们的算法采用去噪评分函数，通过对合成噪声但在完美晶格上无干扰下进行训练，迭代地消除原子位置中的噪声和扰动。去噪后的结构清晰地展现了晶体的内在有序性，同时保留了与晶体缺陷相关的无序性。我们的去噪器无需依赖于原子间相互作用和显式模拟输入，完全基于几何学理论，且能够适用于大量不同原子间相互作用生成的模拟数据。这一去噪算法能够提高现有分类方法（如公共邻居分析和多面体模板匹配）的识别准确性，并在最近的热扰动结构基准数据集上达到了完美的分类准确性。",
    "tldr": "本论文提出了一种基于评分的去噪算法，可有效去除原子模拟过程中的热振动噪声，适用于不同原子间相互作用生成的模拟数据，并能提高分类方法的准确性。"
}