{
    "title": "End-to-end AI framework for interpretable prediction of molecular and crystal properties. (arXiv:2212.11317v2 [cond-mat.mtrl-sci] UPDATED)",
    "abstract": "We introduce an end-to-end computational framework that allows for hyperparameter optimization using the DeepHyper library, accelerated model training, and interpretable AI inference. The framework is based on state-of-the-art AI models including CGCNN, PhysNet, SchNet, MPNN, MPNN-transformer, and TorchMD-NET. We employ these AI models along with the benchmark QM9, hMOF, and MD17 datasets to showcase how the models can predict user-specified material properties within modern computing environments. We demonstrate transferable applications in the modeling of small molecules, inorganic crystals and nanoporous metal organic frameworks with a unified, standalone framework. We have deployed and tested this framework in the ThetaGPU supercomputer at the Argonne Leadership Computing Facility, and in the Delta supercomputer at the National Center for Supercomputing Applications to provide researchers with modern tools to conduct accelerated AI-driven discovery in leadership-class computing env",
    "link": "http://arxiv.org/abs/2212.11317",
    "context": "Title: End-to-end AI framework for interpretable prediction of molecular and crystal properties. (arXiv:2212.11317v2 [cond-mat.mtrl-sci] UPDATED)\nAbstract: We introduce an end-to-end computational framework that allows for hyperparameter optimization using the DeepHyper library, accelerated model training, and interpretable AI inference. The framework is based on state-of-the-art AI models including CGCNN, PhysNet, SchNet, MPNN, MPNN-transformer, and TorchMD-NET. We employ these AI models along with the benchmark QM9, hMOF, and MD17 datasets to showcase how the models can predict user-specified material properties within modern computing environments. We demonstrate transferable applications in the modeling of small molecules, inorganic crystals and nanoporous metal organic frameworks with a unified, standalone framework. We have deployed and tested this framework in the ThetaGPU supercomputer at the Argonne Leadership Computing Facility, and in the Delta supercomputer at the National Center for Supercomputing Applications to provide researchers with modern tools to conduct accelerated AI-driven discovery in leadership-class computing env",
    "path": "papers/22/12/2212.11317.json",
    "total_tokens": 863,
    "translated_title": "可解释预测分子和晶体属性的端到端AI框架",
    "translated_abstract": "我们引入了一个端到端的计算框架，利用DeepHyper库进行超参数优化，加速模型训练，并进行可解释的AI推断。该框架基于最先进的AI模型，包括CGCNN、PhysNet、SchNet、MPNN、MPNN-transformer和TorchMD-NET。我们利用QM9、hMOF和MD17等基准数据集展示了这些模型如何在现代计算环境中预测用户指定的材料属性。我们演示了该统一、独立框架在小分子、无机晶体和纳米多孔金属有机框架建模中的可迁移应用。我们在Argonne领导计算设施的ThetaGPU超级计算机和国家超级计算应用中心的Delta超级计算机上部署和测试了这个框架，为研究人员提供了进行加速的AI驱动发现的现代工具。",
    "tldr": "我们引入了一个端到端的AI框架，利用最先进的模型和计算环境，可以预测分子和晶体的属性，提供了可解释的推断功能，并在领先的计算设施中进行了部署和测试。",
    "en_tdlr": "We introduce an end-to-end AI framework that uses state-of-the-art models and computing environments to predict molecular and crystal properties. The framework provides interpretable inference and has been deployed and tested in leading computing facilities."
}