{
    "title": "Non-IID Transfer Learning on Graphs. (arXiv:2212.08174v2 [cs.LG] UPDATED)",
    "abstract": "Transfer learning refers to the transfer of knowledge or information from a relevant source domain to a target domain. However, most existing transfer learning theories and algorithms focus on IID tasks, where the source/target samples are assumed to be independent and identically distributed. Very little effort is devoted to theoretically studying the knowledge transferability on non-IID tasks, e.g., cross-network mining. To bridge the gap, in this paper, we propose rigorous generalization bounds and algorithms for cross-network transfer learning from a source graph to a target graph. The crucial idea is to characterize the cross-network knowledge transferability from the perspective of the Weisfeiler-Lehman graph isomorphism test. To this end, we propose a novel Graph Subtree Discrepancy to measure the graph distribution shift between source and target graphs. Then the generalization error bounds on cross-network transfer learning, including both cross-network node classification and",
    "link": "http://arxiv.org/abs/2212.08174",
    "context": "Title: Non-IID Transfer Learning on Graphs. (arXiv:2212.08174v2 [cs.LG] UPDATED)\nAbstract: Transfer learning refers to the transfer of knowledge or information from a relevant source domain to a target domain. However, most existing transfer learning theories and algorithms focus on IID tasks, where the source/target samples are assumed to be independent and identically distributed. Very little effort is devoted to theoretically studying the knowledge transferability on non-IID tasks, e.g., cross-network mining. To bridge the gap, in this paper, we propose rigorous generalization bounds and algorithms for cross-network transfer learning from a source graph to a target graph. The crucial idea is to characterize the cross-network knowledge transferability from the perspective of the Weisfeiler-Lehman graph isomorphism test. To this end, we propose a novel Graph Subtree Discrepancy to measure the graph distribution shift between source and target graphs. Then the generalization error bounds on cross-network transfer learning, including both cross-network node classification and",
    "path": "papers/22/12/2212.08174.json",
    "total_tokens": 1095,
    "translated_title": "图上非独立同分布的迁移学习",
    "translated_abstract": "迁移学习是指从相关的源域到目标域转移知识或信息的过程。然而，大多数现有的迁移学习理论和算法都集中在假设源/目标样本相互独立同分布的IID任务上。很少有研究专门针对图上的非独立同分布任务，例如跨网络挖掘的知识迁移。为了解决这个问题，本文从Weisfeiler-Lehman图同构测试的角度，提出了严格的一般化界限和算法，用于从源图到目标图的跨网络迁移学习。本文提出了一种新的图子树差异度量方法来衡量源图和目标图之间的图分布差异，然后在此基础上推导了跨网络迁移学习的一般化误差界限，包括节点分类和链接预测。此外，本文还开发了一个实用的算法GDSL，通过对齐图子树可以有效地减少跨网络分布偏移。多个真实世界的数据集上的实验表明，我们提出的方法优于现有的几种最先进的方法。",
    "tldr": "本文提出了一种用于图上跨网络迁移学习的新方法，在利用Weisfeiler-Lehman图同构测试的基础上，提出了图子树差异度量算法来衡量源目标之间的图分布差异，进而推导出跨网络迁移学习的一般化误差界限，同时还开发了GDSL算法用于对齐图子树，实验结果表明我们的方法优于现有的最先进方法。",
    "en_tdlr": "This paper proposes a novel method for cross-network transfer learning on graphs, using the Weisfeiler-Lehman graph isomorphism test to characterize cross-network knowledge transferability, and a novel Graph Subtree Discrepancy metric to measure graph distribution shift. The paper derives generalization error bounds and presents GDSL, a practical algorithm to align graph subtrees, demonstrating its superiority over state-of-the-art methods in multiple real-world datasets."
}