{
    "title": "A Comprehensive Study of Gender Bias in Chemical Named Entity Recognition Models",
    "abstract": "arXiv:2212.12799v2 Announce Type: replace  Abstract: Chemical named entity recognition (NER) models are used in many downstream tasks, from adverse drug reaction identification to pharmacoepidemiology. However, it is unknown whether these models work the same for everyone. Performance disparities can potentially cause harm rather than the intended good. This paper assesses gender-related performance disparities in chemical NER systems. We develop a framework for measuring gender bias in chemical NER models using synthetic data and a newly annotated corpus of over 92,405 words with self-identified gender information from Reddit. Our evaluation of multiple biomedical NER models reveals evident biases. For instance, synthetic data suggests female-related names are frequently misclassified as chemicals, especially for brand name mentions. Additionally, we observe performance disparities between female- and male-associated data in both datasets. Many systems fail to detect contraceptives su",
    "link": "https://arxiv.org/abs/2212.12799",
    "context": "Title: A Comprehensive Study of Gender Bias in Chemical Named Entity Recognition Models\nAbstract: arXiv:2212.12799v2 Announce Type: replace  Abstract: Chemical named entity recognition (NER) models are used in many downstream tasks, from adverse drug reaction identification to pharmacoepidemiology. However, it is unknown whether these models work the same for everyone. Performance disparities can potentially cause harm rather than the intended good. This paper assesses gender-related performance disparities in chemical NER systems. We develop a framework for measuring gender bias in chemical NER models using synthetic data and a newly annotated corpus of over 92,405 words with self-identified gender information from Reddit. Our evaluation of multiple biomedical NER models reveals evident biases. For instance, synthetic data suggests female-related names are frequently misclassified as chemicals, especially for brand name mentions. Additionally, we observe performance disparities between female- and male-associated data in both datasets. Many systems fail to detect contraceptives su",
    "path": "papers/22/12/2212.12799.json",
    "total_tokens": 852,
    "translated_title": "化学命名实体识别模型中性别偏见的全面研究",
    "translated_abstract": "化学命名实体识别（NER）模型在许多下游任务中被使用，从不良药物反应识别到药物流行病学。然而，目前尚不清楚这些模型是否对所有人都起作用。性能差异可能会造成实际伤害而不是预期的益处。本文评估了化学NER系统中与性别相关的性能差异。我们开发了一个框架，使用合成数据和来自Reddit的超过92,405个词的自我识别性别信息的新注释语料库，来衡量化学NER模型中的性别偏见。我们对多个生物医学NER模型进行评估，发现了明显的偏见。例如，合成数据表明女性相关名称经常被误分类为化学品，特别是品牌名称的提及。此外，我们观察到两个数据集中的男性和女性关联数据之间的性能差异。许多系统未能检测避孕药物。",
    "tldr": "本文研究了化学命名实体识别模型中的性别偏见，使用合成数据和Reddit上的性别信息注释语料库评估多个生物医学NER模型，揭示了明显的偏见。",
    "en_tdlr": "This paper investigates gender bias in chemical named entity recognition models, evaluating multiple biomedical NER models using synthetic data and gender-annotated corpus from Reddit, revealing evident biases."
}