{
    "title": "Neural Bandits for Data Mining: Searching for Dangerous Polypharmacy. (arXiv:2212.05190v3 [cs.LG] UPDATED)",
    "abstract": "Polypharmacy, most often defined as the simultaneous consumption of five or more drugs at once, is a prevalent phenomenon in the older population. Some of these polypharmacies, deemed inappropriate, may be associated with adverse health outcomes such as death or hospitalization. Considering the combinatorial nature of the problem as well as the size of claims database and the cost to compute an exact association measure for a given drug combination, it is impossible to investigate every possible combination of drugs. Therefore, we propose to optimize the search for potentially inappropriate polypharmacies (PIPs). To this end, we propose the OptimNeuralTS strategy, based on Neural Thompson Sampling and differential evolution, to efficiently mine claims datasets and build a predictive model of the association between drug combinations and health outcomes. We benchmark our method using two datasets generated by an internally developed simulator of polypharmacy data containing 500 drugs an",
    "link": "http://arxiv.org/abs/2212.05190",
    "context": "Title: Neural Bandits for Data Mining: Searching for Dangerous Polypharmacy. (arXiv:2212.05190v3 [cs.LG] UPDATED)\nAbstract: Polypharmacy, most often defined as the simultaneous consumption of five or more drugs at once, is a prevalent phenomenon in the older population. Some of these polypharmacies, deemed inappropriate, may be associated with adverse health outcomes such as death or hospitalization. Considering the combinatorial nature of the problem as well as the size of claims database and the cost to compute an exact association measure for a given drug combination, it is impossible to investigate every possible combination of drugs. Therefore, we propose to optimize the search for potentially inappropriate polypharmacies (PIPs). To this end, we propose the OptimNeuralTS strategy, based on Neural Thompson Sampling and differential evolution, to efficiently mine claims datasets and build a predictive model of the association between drug combinations and health outcomes. We benchmark our method using two datasets generated by an internally developed simulator of polypharmacy data containing 500 drugs an",
    "path": "papers/22/12/2212.05190.json",
    "total_tokens": 901,
    "translated_title": "神经Bandits用于数据挖掘：搜索有害多药疗法",
    "translated_abstract": "多药疗法通常被定义为同时服用五种或更多药物，是老年人中普遍存在的现象。其中一些不当的多药疗法可能与不良健康结果相关，如死亡或住院。考虑到问题的组合性质以及索赔数据库的大小和计算给定药物组合的确切关联度所需的成本，不可能调查每种可能的药物组合。因此，我们建议优化搜索潜在不当的多药疗法（PIPs）。为此，我们提出了基于神经汤普森采样和差分进化的OptimNeuralTS策略，以高效地挖掘索赔数据集并建立药物组合与健康结果之间的预测模型。我们使用一个由内部开发的多药疗法数据模拟器生成的两个数据集来基准测试我们的方法，该模拟器包含500种药物。",
    "tldr": "本研究提出了一种名为OptimNeuralTS的策略，用于搜索有害多药疗法，基于神经汤普森采样和差分进化，能够高效地挖掘索赔数据库并建立药物组合与健康结果之间的预测模型。",
    "en_tdlr": "The OptimNeuralTS strategy based on Neural Thompson Sampling and differential evolution is proposed for efficiently mining claims datasets and building a predictive model of the association between drug combinations and health outcomes, to optimize the search for potentially inappropriate polypharmacies (PIPs)."
}