{
    "title": "SWL-Adapt: An Unsupervised Domain Adaptation Model with Sample Weight Learning for Cross-User Wearable Human Activity Recognition. (arXiv:2212.00724v2 [eess.SP] UPDATED)",
    "abstract": "In practice, Wearable Human Activity Recognition (WHAR) models usually face performance degradation on the new user due to user variance. Unsupervised domain adaptation (UDA) becomes the natural solution to cross-user WHAR under annotation scarcity. Existing UDA models usually align samples across domains without differentiation, which ignores the difference among samples. In this paper, we propose an unsupervised domain adaptation model with sample weight learning (SWL-Adapt) for cross-user WHAR. SWL-Adapt calculates sample weights according to the classification loss and domain discrimination loss of each sample with a parameterized network. We introduce the meta-optimization based update rule to learn this network end-to-end, which is guided by meta-classification loss on the selected pseudo-labeled target samples. Therefore, this network can fit a weighting function according to the cross-user WHAR task at hand, which is superior to existing sample differentiation rules fixed for s",
    "link": "http://arxiv.org/abs/2212.00724",
    "context": "Title: SWL-Adapt: An Unsupervised Domain Adaptation Model with Sample Weight Learning for Cross-User Wearable Human Activity Recognition. (arXiv:2212.00724v2 [eess.SP] UPDATED)\nAbstract: In practice, Wearable Human Activity Recognition (WHAR) models usually face performance degradation on the new user due to user variance. Unsupervised domain adaptation (UDA) becomes the natural solution to cross-user WHAR under annotation scarcity. Existing UDA models usually align samples across domains without differentiation, which ignores the difference among samples. In this paper, we propose an unsupervised domain adaptation model with sample weight learning (SWL-Adapt) for cross-user WHAR. SWL-Adapt calculates sample weights according to the classification loss and domain discrimination loss of each sample with a parameterized network. We introduce the meta-optimization based update rule to learn this network end-to-end, which is guided by meta-classification loss on the selected pseudo-labeled target samples. Therefore, this network can fit a weighting function according to the cross-user WHAR task at hand, which is superior to existing sample differentiation rules fixed for s",
    "path": "papers/22/12/2212.00724.json",
    "total_tokens": 968,
    "translated_title": "SWL-Adapt: 一种基于样本权重学习的跨用户可穿戴人体活动识别无监督领域自适应模型",
    "translated_abstract": "在现实中，可穿戴人体活动识别模型通常面临着跨用户性能下降的问题，主要是由于用户变化引起的。无监督领域自适应成为了跨用户可穿戴人体活动识别的自然解决方案。现有的无监督领域自适应模型通常在领域间对齐样本，但不进行样本间的区分，忽略了样本间的差异。在本文中，我们提出了一种基于样本权重学习的跨用户可穿戴人体活动识别无监督领域自适应模型(SWL-Adapt)。SWL-Adapt根据网络参数计算每个样本的分类损失和领域辨别损失的样本权重。我们引入基于元优化的更新规则，通过选定的伪标记目标样本的元分类损失来指导这个网络的端到端学习。因此，这个网络可以根据手头的跨用户可穿戴人体活动识别任务适应一个加权函数，这优于现有的针对样本细分的规则固定做法。",
    "tldr": "SWL-Adapt是一种新的跨用户可穿戴人体活动识别的无监督领域自适应方法，通过样本权重学习来区分不同样本，提高了该任务的性能表现。",
    "en_tdlr": "SWL-Adapt is a novel unsupervised domain adaptation method for cross-user wearable human activity recognition, which distinguishes different samples through sample weight learning, leading to improved performance on this task."
}