{
    "title": "Reliable Measures of Spread in High Dimensional Latent Spaces. (arXiv:2212.08172v2 [cs.LG] UPDATED)",
    "abstract": "Understanding geometric properties of natural language processing models' latent spaces allows the manipulation of these properties for improved performance on downstream tasks. One such property is the amount of data spread in a model's latent space, or how fully the available latent space is being used. In this work, we define data spread and demonstrate that the commonly used measures of data spread, Average Cosine Similarity and a partition function min/max ratio I(V), do not provide reliable metrics to compare the use of latent space across models. We propose and examine eight alternative measures of data spread, all but one of which improve over these current metrics when applied to seven synthetic data distributions. Of our proposed measures, we recommend one principal component-based measure and one entropy-based measure that provide reliable, relative measures of spread and can be used to compare models of different sizes and dimensionalities.",
    "link": "http://arxiv.org/abs/2212.08172",
    "context": "Title: Reliable Measures of Spread in High Dimensional Latent Spaces. (arXiv:2212.08172v2 [cs.LG] UPDATED)\nAbstract: Understanding geometric properties of natural language processing models' latent spaces allows the manipulation of these properties for improved performance on downstream tasks. One such property is the amount of data spread in a model's latent space, or how fully the available latent space is being used. In this work, we define data spread and demonstrate that the commonly used measures of data spread, Average Cosine Similarity and a partition function min/max ratio I(V), do not provide reliable metrics to compare the use of latent space across models. We propose and examine eight alternative measures of data spread, all but one of which improve over these current metrics when applied to seven synthetic data distributions. Of our proposed measures, we recommend one principal component-based measure and one entropy-based measure that provide reliable, relative measures of spread and can be used to compare models of different sizes and dimensionalities.",
    "path": "papers/22/12/2212.08172.json",
    "total_tokens": 863,
    "translated_title": "高维潜空间中可靠的展开度量方法",
    "translated_abstract": "理解自然语言处理模型潜空间的几何特性可以通过操作这些特性来改善下游任务的性能。其中一个特性是模型潜空间中的数据展开度，即可用潜空间的充分利用程度。在这项工作中，我们定义了数据展开度，并证明了常用的数据展开度度量方法，平均余弦相似度和分区函数的最小/最大比例I（V），不能提供可靠的对比不同模型潜空间使用情况的指标。我们提出并研究了八种备选的数据展开度度量方法，其中除一种外，所有方法在应用于七种合成数据分布时都优于当前的度量方法。在我们提出的度量方法中，推荐使用一种基于主成分的度量方法和一种基于熵的度量方法，它们可以提供可靠的、相对的展开度量，并可用于比较不同大小和维度的模型。",
    "tldr": "本文定义了数据展开度的概念，并发现常用的度量方法不可靠，提出了八种备选的数据展开度量方法，并推荐使用一种基于主成分和一种基于熵的度量方法，这些方法可以可靠地比较不同模型的展开度。",
    "en_tdlr": "This paper defines the concept of data spread and finds that commonly used measures are unreliable. It proposes eight alternative measures and recommends using principal component-based and entropy-based measures that can reliably compare the spread of different models."
}