{
    "title": "Insights into the drivers and spatio-temporal trends of extreme Mediterranean wildfires with statistical deep-learning. (arXiv:2212.01796v3 [stat.AP] UPDATED)",
    "abstract": "Extreme wildfires are a significant cause of human death and biodiversity destruction within countries that encompass the Mediterranean Basin. Recent worrying trends in wildfire activity (i.e., occurrence and spread) suggest that wildfires are likely to be highly impacted by climate change. In order to facilitate appropriate risk mitigation, we must identify the main drivers of extreme wildfires and assess their spatio-temporal trends, with a view to understanding the impacts of global warming on fire activity. We analyse the monthly burnt area due to wildfires over a region encompassing most of Europe and the Mediterranean Basin from 2001 to 2020, and identify high fire activity during this period in Algeria, Italy and Portugal. We build an extreme quantile regression model with a high-dimensional predictor set describing meteorological conditions, land cover usage, and orography. To model the complex relationships between the predictor variables and wildfires, we use a hybrid statist",
    "link": "http://arxiv.org/abs/2212.01796",
    "context": "Title: Insights into the drivers and spatio-temporal trends of extreme Mediterranean wildfires with statistical deep-learning. (arXiv:2212.01796v3 [stat.AP] UPDATED)\nAbstract: Extreme wildfires are a significant cause of human death and biodiversity destruction within countries that encompass the Mediterranean Basin. Recent worrying trends in wildfire activity (i.e., occurrence and spread) suggest that wildfires are likely to be highly impacted by climate change. In order to facilitate appropriate risk mitigation, we must identify the main drivers of extreme wildfires and assess their spatio-temporal trends, with a view to understanding the impacts of global warming on fire activity. We analyse the monthly burnt area due to wildfires over a region encompassing most of Europe and the Mediterranean Basin from 2001 to 2020, and identify high fire activity during this period in Algeria, Italy and Portugal. We build an extreme quantile regression model with a high-dimensional predictor set describing meteorological conditions, land cover usage, and orography. To model the complex relationships between the predictor variables and wildfires, we use a hybrid statist",
    "path": "papers/22/12/2212.01796.json",
    "total_tokens": 1325,
    "translated_title": "用统计深度学习揭示地中海地区极端野火的驱动因素和时空趋势",
    "translated_abstract": "极端野火是地中海盆地国家中人类死亡和生物多样性破坏的重要原因。最近野火活动（即发生和蔓延）的趋势令人担忧，表明野火可能受到气候变化的高度影响。为了促进适当的风险缓解，我们必须确定极端野火的主要驱动因素，并评估它们的时空趋势，以便了解全球变暖对火灾活动的影响。我们分析了欧洲和地中海盆地大部分地区从2001年到2020年因野火而烧毁的月度面积，并确定阿尔及利亚、意大利和葡萄牙在这期间存在高发的野火活动。我们建立了一个高维预测器集描述气象条件、土地覆盖利用和山势的极端分位数回归模型。为了模拟预测变量和野火之间的复杂关系，我们使用了一个混合统计深度学习方法。我们的研究结果表明，气温、降水和风速是极端野火的主要驱动因素，根据季节和地点有不同的影响。我们还发现显著的时空趋势，阿尔及利亚的野火活动正在增加，葡萄牙的趋势正在下降，而意大利的趋势是非线性的。我们的研究为了解气候变化对地中海盆地极端野火当前和潜在的影响提供了重要见解。",
    "tldr": "本研究使用统计深度学习的方法分析了欧洲和地中海盆地2001年至2020年因野火而烧毁的月度面积，研究结果显示气温、降水和风速是极端野火的主要驱动因素，根据季节和地点有不同的影响。阿尔及利亚的野火活动正在增加，葡萄牙的趋势正在下降，而意大利的趋势是非线性的。",
    "en_tdlr": "This study used a statistical deep learning approach to analyze the monthly burnt area due to wildfires over a region encompassing most of Europe and the Mediterranean Basin from 2001 to 2020. The main drivers of extreme wildfires were found to be temperature, precipitation, and wind speed with different impacts according to the season and the location. Significant spatio-temporal trends were also identified, with increasing wildfire activity in Algeria, a decreasing trend in Portugal, and a non-linear trend in Italy."
}