{
    "title": "Retire: Robust Expectile Regression in High Dimensions. (arXiv:2212.05562v2 [stat.ME] UPDATED)",
    "abstract": "High-dimensional data can often display heterogeneity due to heteroscedastic variance or inhomogeneous covariate effects. Penalized quantile and expectile regression methods offer useful tools to detect heteroscedasticity in high-dimensional data. The former is computationally challenging due to the non-smooth nature of the check loss, and the latter is sensitive to heavy-tailed error distributions. In this paper, we propose and study (penalized) robust expectile regression (retire), with a focus on iteratively reweighted $\\ell_1$-penalization which reduces the estimation bias from $\\ell_1$-penalization and leads to oracle properties. Theoretically, we establish the statistical properties of the retire estimator under two regimes: (i) low-dimensional regime in which $d \\ll n$; (ii) high-dimensional regime in which $s\\ll n\\ll d$ with $s$ denoting the number of significant predictors. In the high-dimensional setting, we carefully characterize the solution path of the iteratively reweight",
    "link": "http://arxiv.org/abs/2212.05562",
    "context": "Title: Retire: Robust Expectile Regression in High Dimensions. (arXiv:2212.05562v2 [stat.ME] UPDATED)\nAbstract: High-dimensional data can often display heterogeneity due to heteroscedastic variance or inhomogeneous covariate effects. Penalized quantile and expectile regression methods offer useful tools to detect heteroscedasticity in high-dimensional data. The former is computationally challenging due to the non-smooth nature of the check loss, and the latter is sensitive to heavy-tailed error distributions. In this paper, we propose and study (penalized) robust expectile regression (retire), with a focus on iteratively reweighted $\\ell_1$-penalization which reduces the estimation bias from $\\ell_1$-penalization and leads to oracle properties. Theoretically, we establish the statistical properties of the retire estimator under two regimes: (i) low-dimensional regime in which $d \\ll n$; (ii) high-dimensional regime in which $s\\ll n\\ll d$ with $s$ denoting the number of significant predictors. In the high-dimensional setting, we carefully characterize the solution path of the iteratively reweight",
    "path": "papers/22/12/2212.05562.json",
    "total_tokens": 1130,
    "translated_title": "高维数据中的健壮性expectile回归方法Robust Retire",
    "translated_abstract": "高维数据经常表现出由异方差方差或不均匀协变量效应引起的异质性。惩罚的分位数和expectile回归方法提供了在高维数据中检测异方差性的有用工具。前者由于check loss的非平滑特性而具有计算上的挑战性，而后者对重尾误差分布敏感。在本文中，我们提出并研究了（惩罚）健壮expectile回归（retire），重点是迭代重新加权$\\ell_1$惩罚，它减少了 $\\ell_1$惩罚的估计偏差，并导致了oracle属性。理论上，我们在两种情况下建立了retire估计器的统计性质：（i）当$d\\ll n$时的低维情景；（ii）当$s\\ll n\\ll d$，其中$s$表示显著预测变量的数量。在高维度设定下，我们仔细描述了iteratively reweighted l1-penalized retire estimator的解路径，并开发了有效的算法来解决所得到的优化问题。模拟和实际数据分析表明，所提出的方法在预测精度和变量选择方面优于其他现有的惩罚分位数和expectile回归方法。",
    "tldr": "本文提出了一种适用于高维数据的健壮expectile回归方法（Robust Retire），并针对迭代重新加权l1惩罚提出了oracle属性解决了惩罚分位数的非平滑和expectile回归敏感误差分布的问题。实验表明这种方法在预测和变量选择方面的表现都优于其他现有方法。",
    "en_tdlr": "This paper proposes a Robust Retire method for expectile regression in high-dimensional data, which addresses the non-smoothness issue of penalized quantile regression and sensitivity to heavy-tailed errors of expectile regression. The method has oracle properties with iteratively reweighted l1-penalization, and outperforms other methods in predicting accuracy and variable selection according to simulations and real data analysis."
}