{
    "title": "Language Models as Inductive Reasoners",
    "abstract": "Inductive reasoning is a core component of human intelligence. In the past research of inductive reasoning within computer science, formal language is used as representations of knowledge (facts and rules, more specifically). However, formal language can cause systematic problems for inductive reasoning such as disability of handling raw input such as natural language, sensitiveness to mislabeled data, and incapacity to handle ambiguous input. To this end, we propose a new paradigm (task) for inductive reasoning, which is to induce natural language rules from natural language facts, and create a dataset termed DEER containing 1.2k rule-fact pairs for the task, where rules and facts are written in natural language. New automatic metrics are also proposed and analysed for the evaluation of this task. With DEER, we investigate a modern approach for inductive reasoning where we use natural language as representation for knowledge instead of formal language and use pretrained language model",
    "link": "https://rss.arxiv.org/abs/2212.10923",
    "context": "Title: Language Models as Inductive Reasoners\nAbstract: Inductive reasoning is a core component of human intelligence. In the past research of inductive reasoning within computer science, formal language is used as representations of knowledge (facts and rules, more specifically). However, formal language can cause systematic problems for inductive reasoning such as disability of handling raw input such as natural language, sensitiveness to mislabeled data, and incapacity to handle ambiguous input. To this end, we propose a new paradigm (task) for inductive reasoning, which is to induce natural language rules from natural language facts, and create a dataset termed DEER containing 1.2k rule-fact pairs for the task, where rules and facts are written in natural language. New automatic metrics are also proposed and analysed for the evaluation of this task. With DEER, we investigate a modern approach for inductive reasoning where we use natural language as representation for knowledge instead of formal language and use pretrained language model",
    "path": "papers/22/12/2212.10923.json",
    "total_tokens": 912,
    "translated_title": "语言模型作为归纳推理器",
    "translated_abstract": "归纳推理是人类智能的核心组成部分。在计算机科学中的归纳推理研究中，形式语言被用作知识（事实和规则）的表示。然而，形式语言会给归纳推理带来系统性问题，例如无法处理自然语言这样的原始输入、对错误标记的数据敏感以及处理模糊输入的能力不足。为此，我们提出了一种新的归纳推理范式（任务），即从自然语言事实中归纳出自然语言规则，并创建了一个被称为DEER的数据集，其中包含1.2k个规则-事实对，规则和事实以自然语言书写。还提出并分析了用于评估此任务的新的自动评估指标。通过DEER，我们研究了一种现代的归纳推理方法，其中我们使用自然语言作为知识的表示而不是形式语言，并使用预训练的语言模型。",
    "tldr": "该论文提出了使用自然语言作为知识表示的归纳推理方法，以解决形式语言在处理原始输入、处理错误标记数据和处理模糊输入方面的问题。研究者提出了一个新的归纳推理任务，并创建了一个自然语言规则和事实对的数据集，通过使用预训练的语言模型进行评估。"
}