{
    "title": "Hierarchical Policy Blending As Optimal Transport. (arXiv:2212.01938v2 [cs.RO] UPDATED)",
    "abstract": "We present hierarchical policy blending as optimal transport (HiPBOT). This hierarchical framework adapts the weights of low-level reactive expert policies, adding a look-ahead planning layer on the parameter space of a product of expert policies and agents. Our high-level planner realizes a policy blending via unbalanced optimal transport, consolidating the scaling of underlying Riemannian motion policies, effectively adjusting their Riemannian matrix, and deciding over the priorities between experts and agents, guaranteeing safety and task success. Our experimental results in a range of application scenarios from low-dimensional navigation to high-dimensional whole-body control showcase the efficacy and efficiency of HiPBOT, which outperforms state-of-the-art baselines that either perform probabilistic inference or define a tree structure of experts, paving the way for new applications of optimal transport to robot control. More material at https://sites.google.com/view/hipobot",
    "link": "http://arxiv.org/abs/2212.01938",
    "context": "Title: Hierarchical Policy Blending As Optimal Transport. (arXiv:2212.01938v2 [cs.RO] UPDATED)\nAbstract: We present hierarchical policy blending as optimal transport (HiPBOT). This hierarchical framework adapts the weights of low-level reactive expert policies, adding a look-ahead planning layer on the parameter space of a product of expert policies and agents. Our high-level planner realizes a policy blending via unbalanced optimal transport, consolidating the scaling of underlying Riemannian motion policies, effectively adjusting their Riemannian matrix, and deciding over the priorities between experts and agents, guaranteeing safety and task success. Our experimental results in a range of application scenarios from low-dimensional navigation to high-dimensional whole-body control showcase the efficacy and efficiency of HiPBOT, which outperforms state-of-the-art baselines that either perform probabilistic inference or define a tree structure of experts, paving the way for new applications of optimal transport to robot control. More material at https://sites.google.com/view/hipobot",
    "path": "papers/22/12/2212.01938.json",
    "total_tokens": 939,
    "translated_title": "分级策略混合作为最优输运",
    "translated_abstract": "我们提出了分级策略混合作为最优输运（HiPBOT）。这种分层框架通过对专家策略的低级反应适应权重，在专家策略和代理人的参数空间上添加了一个前瞻规划层。我们的高层规划者通过不平衡的最优传输实现策略混合，巩固底层黎曼运动策略的比例，有效调整它们的黎曼矩阵，并在专家和代理人之间决定优先级，保证安全和任务成功。我们在从低维导航到高维全身控制的一系列应用场景中的实验结果展示了HiPBOT的功效和效率，该方法优于执行概率推断或定义专家树结构的现有基线，为最优输运在机器人控制中的新应用铺平了道路。",
    "tldr": "提出了一种分层策略混合方法，通过不平衡的最优传输实现策略混合，巩固底层黎曼运动策略的比例，有效调整黎曼矩阵，决定专家和代理人之间的优先级，保证安全和任务成功，并在一系列机器人控制的应用场景中超过现有基线。",
    "en_tdlr": "The paper presents Hierarchical Policy Blending as Optimal Transport (HiPBOT), a hierarchical framework that adapts weights of low-level reactive expert policies and adds a look-ahead planning layer. The high-level planner realizes policy blending via unbalanced optimal transport, guaranteeing safety and task success. The experimental results in varied application scenarios showcase the efficacy and efficiency of HiPBOT, surpassing state-of-the-art baselines and paving the way for new applications of optimal transport in robot control."
}