{
    "title": "CHAD: Charlotte Anomaly Dataset. (arXiv:2212.09258v3 [cs.CV] UPDATED)",
    "abstract": "In recent years, we have seen a significant interest in data-driven deep learning approaches for video anomaly detection, where an algorithm must determine if specific frames of a video contain abnormal behaviors. However, video anomaly detection is particularly context-specific, and the availability of representative datasets heavily limits real-world accuracy. Additionally, the metrics currently reported by most state-of-the-art methods often do not reflect how well the model will perform in real-world scenarios. In this article, we present the Charlotte Anomaly Dataset (CHAD). CHAD is a high-resolution, multi-camera anomaly dataset in a commercial parking lot setting. In addition to frame-level anomaly labels, CHAD is the first anomaly dataset to include bounding box, identity, and pose annotations for each actor. This is especially beneficial for skeleton-based anomaly detection, which is useful for its lower computational demand in real-world settings. CHAD is also the first anoma",
    "link": "http://arxiv.org/abs/2212.09258",
    "context": "Title: CHAD: Charlotte Anomaly Dataset. (arXiv:2212.09258v3 [cs.CV] UPDATED)\nAbstract: In recent years, we have seen a significant interest in data-driven deep learning approaches for video anomaly detection, where an algorithm must determine if specific frames of a video contain abnormal behaviors. However, video anomaly detection is particularly context-specific, and the availability of representative datasets heavily limits real-world accuracy. Additionally, the metrics currently reported by most state-of-the-art methods often do not reflect how well the model will perform in real-world scenarios. In this article, we present the Charlotte Anomaly Dataset (CHAD). CHAD is a high-resolution, multi-camera anomaly dataset in a commercial parking lot setting. In addition to frame-level anomaly labels, CHAD is the first anomaly dataset to include bounding box, identity, and pose annotations for each actor. This is especially beneficial for skeleton-based anomaly detection, which is useful for its lower computational demand in real-world settings. CHAD is also the first anoma",
    "path": "papers/22/12/2212.09258.json",
    "total_tokens": 1049,
    "translated_title": "CHAD：夏洛特异常数据集",
    "translated_abstract": "近年来，基于数据驱动的深度学习方法在视频异常检测中受到了广泛关注，其中算法必须确定视频的特定帧是否包含异常行为。然而，视频异常检测特别因情境而异，而代表性数据集的可用性严重限制了现实世界中的准确性。此外，目前大多数最先进的方法报告的指标通常不能反映模型在真实场景中的表现如何。在本文中，我们介绍了夏洛特异常数据集（CHAD）。CHAD是商业停车场环境中的高分辨率、多相机异常数据集。除了帧级别的异常标签外，CHAD还是第一个为每个演员包括边界框、身份和姿势注释的异常数据集。这对于基于骨骼的异常检测特别有益，因为它在现实世界中具有较低的计算需求。CHAD也是第一个包括各种环境因素（例如光照变化、天气条件变化和摄像机视角）的异常数据集。使用CHAD，我们展示了这些环境因素如何对现有最先进的模型提出了重大挑战，最终强调了更准确的异常检测算法所需的现实数据集的重要性。",
    "tldr": "CHAD是一个商业停车场环境的高分辨率、多相机异常数据集，是第一个为每个演员包括边界框、身份和姿势注释的异常数据集，同时包括各种环境因素。使用CHAD强调了更准确的异常检测算法所需的现实数据集的重要性。",
    "en_tdlr": "CHAD is a commercial parking lot environment high-resolution, multi-camera anomaly dataset, the first to include bounding box, identity, and pose annotations for each actor, as well as various environmental factors, emphasizing the importance of realistic datasets for more accurate anomaly detection algorithms."
}