{
    "title": "Multimodal Matching-aware Co-attention Networks with Mutual Knowledge Distillation for Fake News Detection. (arXiv:2212.05699v2 [cs.IR] UPDATED)",
    "abstract": "Fake news often involves multimedia information such as text and image to mislead readers, proliferating and expanding its influence. Most existing fake news detection methods apply the co-attention mechanism to fuse multimodal features while ignoring the consistency of image and text in co-attention. In this paper, we propose multimodal matching-aware co-attention networks with mutual knowledge distillation for improving fake news detection. Specifically, we design an image-text matching-aware co-attention mechanism which captures the alignment of image and text for better multimodal fusion. The image-text matching representation can be obtained via a vision-language pre-trained model. Additionally, based on the designed image-text matching-aware co-attention mechanism, we propose to build two co-attention networks respectively centered on text and image for mutual knowledge distillation to improve fake news detection. Extensive experiments on three benchmark datasets demonstrate that",
    "link": "http://arxiv.org/abs/2212.05699",
    "context": "Title: Multimodal Matching-aware Co-attention Networks with Mutual Knowledge Distillation for Fake News Detection. (arXiv:2212.05699v2 [cs.IR] UPDATED)\nAbstract: Fake news often involves multimedia information such as text and image to mislead readers, proliferating and expanding its influence. Most existing fake news detection methods apply the co-attention mechanism to fuse multimodal features while ignoring the consistency of image and text in co-attention. In this paper, we propose multimodal matching-aware co-attention networks with mutual knowledge distillation for improving fake news detection. Specifically, we design an image-text matching-aware co-attention mechanism which captures the alignment of image and text for better multimodal fusion. The image-text matching representation can be obtained via a vision-language pre-trained model. Additionally, based on the designed image-text matching-aware co-attention mechanism, we propose to build two co-attention networks respectively centered on text and image for mutual knowledge distillation to improve fake news detection. Extensive experiments on three benchmark datasets demonstrate that",
    "path": "papers/22/12/2212.05699.json",
    "total_tokens": 990,
    "translated_title": "基于相互知识蒸馏的多模匹配感知协同注意力网络用于假新闻检测",
    "translated_abstract": "假新闻常常包含文本和图像等多媒体信息来误导读者，从而扩大其影响力。目前大多数的假新闻检测方法使用协同注意力机制来融合多模态特征而忽略了协同注意力中图像和文本的一致性。本文提出了一种基于相互知识蒸馏的多模匹配感知协同注意力网络来改进假新闻检测。具体而言，我们设计了一种图像-文本匹配感知协同机制，用于捕获图像和文本的对齐以实现更好的多模态融合。图像-文本匹配表示可以通过视觉语言预训练模型获得。此外，基于设计的图像-文本匹配感知协同机制，我们提出构建两个分别以文本和图像为中心的协同注意力网络以进行相互知识蒸馏，以提高假新闻检测的性能。在三个基准数据集上的广泛实验表明：",
    "tldr": "提出了一种基于相互知识蒸馏的多模匹配感知协同注意力网络用于改进假新闻检测，通过图像-文本匹配感知协同机制捕获图像和文本的对齐以实现更好的多模态融合，同时利用两个中心分别为文本和图像的协同注意力网络进行相互知识蒸馏。",
    "en_tdlr": "Proposed a multimodal matching-aware co-attention network with mutual knowledge distillation for improving fake news detection, which captures the alignment of image and text for better multimodal fusion through an image-text matching-aware co-attention mechanism, and utilizes two co-attention networks centered on text and image respectively for mutual knowledge distillation."
}