{
    "title": "Complex-valued Retrievals From Noisy Images Using Diffusion Models. (arXiv:2212.03235v3 [cs.CV] UPDATED)",
    "abstract": "In diverse microscopy modalities, sensors measure only real-valued intensities. Additionally, the sensor readouts are affected by Poissonian-distributed photon noise. Traditional restoration algorithms typically aim to minimize the mean squared error (MSE) between the original and recovered images. This often leads to blurry outcomes with poor perceptual quality. Recently, deep diffusion models (DDMs) have proven to be highly capable of sampling images from the a-posteriori probability of the sought variables, resulting in visually pleasing high-quality images. These models have mostly been suggested for real-valued images suffering from Gaussian noise. In this study, we generalize annealed Langevin Dynamics, a type of DDM, to tackle the fundamental challenges in optical imaging of complex-valued objects (and real images) affected by Poisson noise. We apply our algorithm to various optical scenarios, such as Fourier Ptychography, Phase Retrieval, and Poisson denoising. Our algorithm is",
    "link": "http://arxiv.org/abs/2212.03235",
    "context": "Title: Complex-valued Retrievals From Noisy Images Using Diffusion Models. (arXiv:2212.03235v3 [cs.CV] UPDATED)\nAbstract: In diverse microscopy modalities, sensors measure only real-valued intensities. Additionally, the sensor readouts are affected by Poissonian-distributed photon noise. Traditional restoration algorithms typically aim to minimize the mean squared error (MSE) between the original and recovered images. This often leads to blurry outcomes with poor perceptual quality. Recently, deep diffusion models (DDMs) have proven to be highly capable of sampling images from the a-posteriori probability of the sought variables, resulting in visually pleasing high-quality images. These models have mostly been suggested for real-valued images suffering from Gaussian noise. In this study, we generalize annealed Langevin Dynamics, a type of DDM, to tackle the fundamental challenges in optical imaging of complex-valued objects (and real images) affected by Poisson noise. We apply our algorithm to various optical scenarios, such as Fourier Ptychography, Phase Retrieval, and Poisson denoising. Our algorithm is",
    "path": "papers/22/12/2212.03235.json",
    "total_tokens": 943,
    "translated_title": "使用扩散模型从噪声图像中进行复数检索",
    "translated_abstract": "在多样的显微镜模式中，传感器仅测量实值强度。此外，传感器读数受泊松分布的光子噪声影响。传统的恢复算法通常旨在最小化原始图像和恢复图像之间的均方误差（MSE）。这往往导致模糊的结果和质量差的视觉效果。最近，深度扩散模型（DDM）已经被证明能够从所求变量的后验概率中采样图像，从而得到视觉上令人满意的高质量图像。这些模型主要用于受到高斯噪声影响的实值图像。在本研究中，我们将退火朗格朗日动力学（一种DDM类型）推广到解决受泊松噪声影响的光学成像中的复数对象（和实值图像）的基本挑战。我们将算法应用于各种光学场景，如傅立叶光学织构图、相位恢复和泊松去噪。我们的算法是",
    "tldr": "本研究推广了退火朗格朗日动力学（DDM类型）用于处理受泊松噪声影响的光学成像中的复数对象，提出了一种使用扩散模型从噪声图像中进行复数检索的算法。"
}