{
    "title": "Deep Reinforcement Learning for Wind and Energy Storage Coordination in Wholesale Energy and Ancillary Service Markets. (arXiv:2212.13368v2 [eess.SY] UPDATED)",
    "abstract": "Wind energy has been increasingly adopted to mitigate climate change. However, the variability of wind energy causes wind curtailment, resulting in considerable economic losses for wind farm owners. Wind curtailment can be reduced using battery energy storage systems (BESS) as onsite backup sources. Yet, this auxiliary role may significantly weaken the economic potential of BESS in energy trading. Ideal BESS scheduling should balance onsite wind curtailment reduction and market bidding, but practical implementation is challenging due to coordination complexity and the stochastic nature of energy prices and wind generation. We investigate the joint-market bidding strategy of a co-located wind-battery system in the spot and Regulation Frequency Control Ancillary Service markets. We propose a novel deep reinforcement learning-based approach that decouples the system's market participation into two related Markov decision processes for each facility, enabling the BESS to absorb onsite wind",
    "link": "http://arxiv.org/abs/2212.13368",
    "context": "Title: Deep Reinforcement Learning for Wind and Energy Storage Coordination in Wholesale Energy and Ancillary Service Markets. (arXiv:2212.13368v2 [eess.SY] UPDATED)\nAbstract: Wind energy has been increasingly adopted to mitigate climate change. However, the variability of wind energy causes wind curtailment, resulting in considerable economic losses for wind farm owners. Wind curtailment can be reduced using battery energy storage systems (BESS) as onsite backup sources. Yet, this auxiliary role may significantly weaken the economic potential of BESS in energy trading. Ideal BESS scheduling should balance onsite wind curtailment reduction and market bidding, but practical implementation is challenging due to coordination complexity and the stochastic nature of energy prices and wind generation. We investigate the joint-market bidding strategy of a co-located wind-battery system in the spot and Regulation Frequency Control Ancillary Service markets. We propose a novel deep reinforcement learning-based approach that decouples the system's market participation into two related Markov decision processes for each facility, enabling the BESS to absorb onsite wind",
    "path": "papers/22/12/2212.13368.json",
    "total_tokens": 973,
    "translated_title": "风能和能量储存协调在批发能源和辅助服务市场中的深度强化学习",
    "translated_abstract": "风能作为减缓气候变化的手段已经越来越受到采用。然而，风能的可变性导致了风电厂的削减，给风电厂主带来了可观的经济损失。通过将电池储能系统 (BESS) 用作现场备用源，可以减少风电削减。然而，这种辅助角色可能会严重削弱BESS在能源交易中的经济潜力。理想的BESS调度应该平衡现场风电削减和市场投标，但由于协调复杂性和能源价格和风发电的随机性，实际实施很具有挑战性。我们研究了同地风电-电池系统在现货和调频频率控制辅助服务市场中的联合市场投标策略。我们提出了一种新颖的基于深度强化学习的方法，将系统的市场参与分解为每个设施的两个相关马尔可夫决策过程，使BESS能够吸收现场风能",
    "tldr": "本研究提出了一种基于深度强化学习的方法，以提高风能和能量存储系统的市场参与能力。该方法解决了协调复杂性和能源价格随机性的挑战，并实现了平衡现场风电削减和市场投标的目标。",
    "en_tdlr": "This study proposes a deep reinforcement learning-based approach to enhance the market participation of wind energy and energy storage systems. The method addresses the challenges of coordination complexity and stochastic nature of energy prices, and achieves the goal of balancing onsite wind curtailment reduction and market bidding."
}