{
    "title": "T-Projection: High Quality Annotation Projection for Sequence Labeling Tasks. (arXiv:2212.10548v2 [cs.CL] UPDATED)",
    "abstract": "In the absence of readily available labeled data for a given sequence labeling task and language, annotation projection has been proposed as one of the possible strategies to automatically generate annotated data. Annotation projection has often been formulated as the task of transporting, on parallel corpora, the labels pertaining to a given span in the source language into its corresponding span in the target language. In this paper we present T-Projection, a novel approach for annotation projection that leverages large pretrained text-to-text language models and state-of-the-art machine translation technology. T-Projection decomposes the label projection task into two subtasks: (i) A candidate generation step, in which a set of projection candidates using a multilingual T5 model is generated and, (ii) a candidate selection step, in which the generated candidates are ranked based on translation probabilities. We conducted experiments on intrinsic and extrinsic tasks in 5 Indo-Europea",
    "link": "http://arxiv.org/abs/2212.10548",
    "context": "Title: T-Projection: High Quality Annotation Projection for Sequence Labeling Tasks. (arXiv:2212.10548v2 [cs.CL] UPDATED)\nAbstract: In the absence of readily available labeled data for a given sequence labeling task and language, annotation projection has been proposed as one of the possible strategies to automatically generate annotated data. Annotation projection has often been formulated as the task of transporting, on parallel corpora, the labels pertaining to a given span in the source language into its corresponding span in the target language. In this paper we present T-Projection, a novel approach for annotation projection that leverages large pretrained text-to-text language models and state-of-the-art machine translation technology. T-Projection decomposes the label projection task into two subtasks: (i) A candidate generation step, in which a set of projection candidates using a multilingual T5 model is generated and, (ii) a candidate selection step, in which the generated candidates are ranked based on translation probabilities. We conducted experiments on intrinsic and extrinsic tasks in 5 Indo-Europea",
    "path": "papers/22/12/2212.10548.json",
    "total_tokens": 858,
    "translated_title": "T-Projection：高质量的用于序列标注任务的注释投影",
    "translated_abstract": "在缺少特定序列标注任务和语言的标注数据的情况下，注释投影被提出作为一种可能的策略，用于自动生成注释数据。注释投影通常被形式化为在平行语料库上将源语言中给定跨度的标注传输到目标语言中相应的跨度的任务。在本文中，我们提出了T-Projection，一种利用大型预训练文本到文本语言模型和最先进的机器翻译技术实现注释投影的新方法。T-Projection将标注投影任务分解为两个子任务：(i)候选生成步骤，使用多语言T5模型生成一组投影候选，(ii)候选选择步骤，根据翻译概率对生成的候选进行排名。我们在5个印欧语言上进行了内在和外在任务的实验。",
    "tldr": "T-Projection是一种新的注释投影方法，利用大型预训练语言模型和先进的机器翻译技术。它将标注投影任务分解为候选生成和候选选择两个子任务，有效地生成高质量的序列标注数据。",
    "en_tdlr": "T-Projection is a novel approach for annotation projection that leverages large pretrained language models and state-of-the-art machine translation technology. It decomposes the label projection task into candidate generation and candidate selection, effectively generating high-quality annotated data for sequence labeling tasks."
}