{
    "title": "CoRRPUS: Codex-Leveraged Structured Representations for Neurosymbolic Story Understanding. (arXiv:2212.10754v2 [cs.CL] UPDATED)",
    "abstract": "Story generation and understanding -- as with all NLG/NLU tasks -- has seen a surge in neurosymbolic work. Researchers have recognized that, while large language models (LLMs) have tremendous utility, they can be augmented with symbolic means to be even better and to make up for any flaws that the neural networks might have. However, symbolic methods are extremely costly in terms of the amount of time and expertise needed to create them. In this work, we capitalize on state-of-the-art Code-LLMs, such as Codex, to bootstrap the use of symbolic methods for tracking the state of stories and aiding in story understanding. We show that our CoRRPUS system and abstracted prompting procedures can beat current state-of-the-art structured LLM techniques on pre-existing story understanding tasks (bAbI task 2 and Re^3) with minimal hand engineering. We hope that this work can help highlight the importance of symbolic representations and specialized prompting for LLMs as these models require some g",
    "link": "http://arxiv.org/abs/2212.10754",
    "context": "Title: CoRRPUS: Codex-Leveraged Structured Representations for Neurosymbolic Story Understanding. (arXiv:2212.10754v2 [cs.CL] UPDATED)\nAbstract: Story generation and understanding -- as with all NLG/NLU tasks -- has seen a surge in neurosymbolic work. Researchers have recognized that, while large language models (LLMs) have tremendous utility, they can be augmented with symbolic means to be even better and to make up for any flaws that the neural networks might have. However, symbolic methods are extremely costly in terms of the amount of time and expertise needed to create them. In this work, we capitalize on state-of-the-art Code-LLMs, such as Codex, to bootstrap the use of symbolic methods for tracking the state of stories and aiding in story understanding. We show that our CoRRPUS system and abstracted prompting procedures can beat current state-of-the-art structured LLM techniques on pre-existing story understanding tasks (bAbI task 2 and Re^3) with minimal hand engineering. We hope that this work can help highlight the importance of symbolic representations and specialized prompting for LLMs as these models require some g",
    "path": "papers/22/12/2212.10754.json",
    "total_tokens": 844,
    "translated_title": "CoRRPUS: 利用Codex的结构化表示增强神经符号故事理解",
    "translated_abstract": "随着所有自然语言生成/理解任务的神经符号技术的飞速发展，故事生成和理解也得到了极大的改进。本研究利用最先进的Code-LLMs，如Codex，引导符号方法的使用，以跟踪故事状态并帮助故事理解。我们展示了我们的CoRRPUS系统和抽象提示程序如何在最小的手动工程条件下，击败了当前最先进的结构LLM技术，完成了预先存在的故事理解任务（bAbI task 2 和 Re^3）。我们希望本研究能够凸显符号表示和专业提示对LLMs的重要性，因为这些模型需要一些手工优化。",
    "tldr": "本研究利用Code-LLMs引导符号表示以增强神经符号故事理解，通过CoRRPUS系统和抽象提示程序，在最小的手动工程条件下，击败了当前最先进的结构LLM技术。",
    "en_tdlr": "This study utilizes Code-LLMs to guide symbolic representations for enhancing neurosymbolic story understanding and shows that the CoRRPUS system and abstracted prompting procedures can beat current state-of-the-art structured LLM techniques on pre-existing story understanding tasks with minimal hand engineering."
}