{
    "title": "CoCoMIC: Code Completion By Jointly Modeling In-file and Cross-file Context. (arXiv:2212.10007v2 [cs.CL] UPDATED)",
    "abstract": "While pre-trained language models (LM) for code have achieved great success in code completion, they generate code conditioned only on the contents within the file, i.e., in-file context, but ignore the rich semantics in other files within the same project, i.e., cross-file context, a critical source of information that is especially useful in modern modular software development. Such overlooking constrains code language models' capacity in code completion, leading to unexpected behaviors such as generating hallucinated class member functions or function calls with unexpected arguments. In this work, we develop a cross-file context finder tool, CCFINDER, that effectively locates and retrieves the most relevant cross-file context. We propose CoCoMIC, a framework that incorporates cross-file context to learn the in-file and cross-file context jointly on top of pretrained code LMs. CoCoMIC successfully improves the existing code LM with a 33.94% relative increase in exact match and a 28.6",
    "link": "http://arxiv.org/abs/2212.10007",
    "context": "Title: CoCoMIC: Code Completion By Jointly Modeling In-file and Cross-file Context. (arXiv:2212.10007v2 [cs.CL] UPDATED)\nAbstract: While pre-trained language models (LM) for code have achieved great success in code completion, they generate code conditioned only on the contents within the file, i.e., in-file context, but ignore the rich semantics in other files within the same project, i.e., cross-file context, a critical source of information that is especially useful in modern modular software development. Such overlooking constrains code language models' capacity in code completion, leading to unexpected behaviors such as generating hallucinated class member functions or function calls with unexpected arguments. In this work, we develop a cross-file context finder tool, CCFINDER, that effectively locates and retrieves the most relevant cross-file context. We propose CoCoMIC, a framework that incorporates cross-file context to learn the in-file and cross-file context jointly on top of pretrained code LMs. CoCoMIC successfully improves the existing code LM with a 33.94% relative increase in exact match and a 28.6",
    "path": "papers/22/12/2212.10007.json",
    "total_tokens": 1003,
    "translated_title": "CoCoMIC: 基于联合建模文件内外上下文的代码补全",
    "translated_abstract": "预训练的代码语言模型在代码补全方面取得了巨大成功，但它们只根据文件内的内容进行代码补全，即考虑文件内上下文，而忽略了同一项目中其他文件中丰富的语义信息，即跨文件上下文，后者是现代模块化软件开发中特别有用的关键信息来源。这种忽视限制了代码语言模型在代码补全中的能力，导致出现意外行为，例如生成幻想的类成员函数或带有意外参数的函数调用。在这项工作中，我们开发了一个跨文件上下文查找工具CCFINDER，该工具能够有效地定位并检索最相关的跨文件上下文。我们提出了CoCoMIC框架，它在预先训练的代码语言模型之上，将文件内和跨文件上下文联合进行学习。CoCoMIC成功地提高了现有的代码语言模型，在精确匹配率方面相对提高了33.94％，在前5个候选项准确率方面相对提高了28.6％，这证明了对于代码补全，建模跨文件上下文是非常有效的。",
    "tldr": "CoCoMIC是一个能联合建模文件内外上下文的代码补全框架，其中包括一个跨文件上下文查找工具CCFINDER。使用该框架相对提高了33.94％的精确匹配率和28.6％的前5个候选项准确率。",
    "en_tdlr": "CoCoMIC is a code completion framework that can jointly model in-file and cross-file context, including a cross-file context finder tool called CCFINDER. Using this framework results in a relative increase of 33.94% in exact match and 28.6% in top-5 accuracy."
}