{
    "title": "A Distributed Block Chebyshev-Davidson Algorithm for Parallel Spectral Clustering. (arXiv:2212.04443v2 [cs.LG] UPDATED)",
    "abstract": "We develop a distributed Block Chebyshev-Davidson algorithm to solve large-scale leading eigenvalue problems for spectral analysis in spectral clustering. First, the efficiency of the Chebyshev-Davidson algorithm relies on the prior knowledge of the eigenvalue spectrum, which could be expensive to estimate. This issue can be lessened by the analytic spectrum estimation of the Laplacian or normalized Laplacian matrices in spectral clustering, making the proposed algorithm very efficient for spectral clustering. Second, to make the proposed algorithm capable of analyzing big data, a distributed and parallel version has been developed with attractive scalability. The speedup by parallel computing is approximately equivalent to $\\sqrt{p}$, where $p$ denotes the number of processes. {Numerical results will be provided to demonstrate its efficiency in spectral clustering and scalability advantage over existing eigensolvers used for spectral clustering in parallel computing environments.}",
    "link": "http://arxiv.org/abs/2212.04443",
    "context": "Title: A Distributed Block Chebyshev-Davidson Algorithm for Parallel Spectral Clustering. (arXiv:2212.04443v2 [cs.LG] UPDATED)\nAbstract: We develop a distributed Block Chebyshev-Davidson algorithm to solve large-scale leading eigenvalue problems for spectral analysis in spectral clustering. First, the efficiency of the Chebyshev-Davidson algorithm relies on the prior knowledge of the eigenvalue spectrum, which could be expensive to estimate. This issue can be lessened by the analytic spectrum estimation of the Laplacian or normalized Laplacian matrices in spectral clustering, making the proposed algorithm very efficient for spectral clustering. Second, to make the proposed algorithm capable of analyzing big data, a distributed and parallel version has been developed with attractive scalability. The speedup by parallel computing is approximately equivalent to $\\sqrt{p}$, where $p$ denotes the number of processes. {Numerical results will be provided to demonstrate its efficiency in spectral clustering and scalability advantage over existing eigensolvers used for spectral clustering in parallel computing environments.}",
    "path": "papers/22/12/2212.04443.json",
    "total_tokens": 862,
    "translated_title": "一种用于并行谱聚类的分布式块Chebyshev-Davidson算法",
    "translated_abstract": "我们开发了一种分布式块Chebyshev-Davidson算法，用于解决谱聚类中大规模领先特征值问题。首先，Chebyshev-Davidson算法的效率依赖于先前对特征值谱的了解，而对于估计来说可能很昂贵。通过对谱聚类中的拉普拉斯或规范化拉普拉斯矩阵进行解析谱估计，可以减轻这个问题，使得所提出的算法在谱聚类中非常高效。其次，为了使所提出的算法能够分析大数据，我们开发了一个分布式和并行版本，具有可扩展性。并行计算的加速比大约等于$\\sqrt{p}$，其中$p$表示进程的数量。{我们将提供数值结果，以证明它在谱聚类中的效率以及在并行计算环境中与现有特征值求解器相比的可扩展性优势。}",
    "tldr": "本研究开发了一种用于并行谱聚类的分布式块Chebyshev-Davidson算法，通过解析谱估计和分布式并行计算实现高效率和可扩展性。"
}