{
    "title": "Test-Time Mixup Augmentation for Data and Class-Specific Uncertainty Estimation in Deep Learning Image Classification",
    "abstract": "arXiv:2212.00214v3 Announce Type: replace-cross Abstract: Uncertainty estimation of trained deep learning networks is valuable for optimizing learning efficiency and evaluating the reliability of network predictions. In this paper, we propose a method for estimating uncertainty in deep learning image classification using test-time mixup augmentation (TTMA). To improve the ability to distinguish correct and incorrect predictions in existing aleatoric uncertainty, we introduce TTMA data uncertainty (TTMA-DU) by applying mixup augmentation to test data and measuring the entropy of the predicted label histogram. In addition to TTMA-DU, we propose TTMA class-specific uncertainty (TTMA-CSU), which captures aleatoric uncertainty specific to individual classes and provides insight into class confusion and class similarity within the trained network. We validate our proposed methods on the ISIC-18 skin lesion diagnosis dataset and the CIFAR-100 real-world image classification dataset. Our exper",
    "link": "https://arxiv.org/abs/2212.00214",
    "context": "Title: Test-Time Mixup Augmentation for Data and Class-Specific Uncertainty Estimation in Deep Learning Image Classification\nAbstract: arXiv:2212.00214v3 Announce Type: replace-cross Abstract: Uncertainty estimation of trained deep learning networks is valuable for optimizing learning efficiency and evaluating the reliability of network predictions. In this paper, we propose a method for estimating uncertainty in deep learning image classification using test-time mixup augmentation (TTMA). To improve the ability to distinguish correct and incorrect predictions in existing aleatoric uncertainty, we introduce TTMA data uncertainty (TTMA-DU) by applying mixup augmentation to test data and measuring the entropy of the predicted label histogram. In addition to TTMA-DU, we propose TTMA class-specific uncertainty (TTMA-CSU), which captures aleatoric uncertainty specific to individual classes and provides insight into class confusion and class similarity within the trained network. We validate our proposed methods on the ISIC-18 skin lesion diagnosis dataset and the CIFAR-100 real-world image classification dataset. Our exper",
    "path": "papers/22/12/2212.00214.json",
    "total_tokens": 861,
    "translated_title": "深度学习图像分类中的测试时间混合增强方法用于数据和类别特定不确定性估计",
    "translated_abstract": "训练的深度学习网络的不确定性估计对于优化学习效率和评估网络预测的可靠性非常有价值。本文提出了一种使用测试时间混合增强（TTMA）来估计深度学习图像分类中不确定性的方法。为了改善现有确定性不确定性区分正确和错误预测的能力，我们引入了TTMA数据不确定性（TTMA-DU），通过对测试数据进行混合增强并测量预测标签直方图的熵来衡量。除了TTMA-DU外，我们还提出了TTMA类别特定不确定性（TTMA-CSU），它捕捉到了与单个类别相关的确定性不确定性，并提供了关于训练网络内类别混淆和类别相似性的见解。我们在ISIC-18皮肤病诊断数据集和CIFAR-100真实世界图像分类数据集上验证了我们提出的方法。",
    "tldr": "本文提出了一种使用测试时间混合增强来估计深度学习图像分类中的不确定性的方法，并引入了数据不确定性和类别特定不确定性来提高准确性和提供更深入的信息。",
    "en_tdlr": "This paper proposes a method for estimating uncertainty in deep learning image classification using test-time mixup augmentation, and introduces data uncertainty and class-specific uncertainty to improve accuracy and provide deeper insights."
}