{
    "title": "Real-Time Neural Light Field on Mobile Devices. (arXiv:2212.08057v2 [cs.CV] UPDATED)",
    "abstract": "Recent efforts in Neural Rendering Fields (NeRF) have shown impressive results on novel view synthesis by utilizing implicit neural representation to represent 3D scenes. Due to the process of volumetric rendering, the inference speed for NeRF is extremely slow, limiting the application scenarios of utilizing NeRF on resource-constrained hardware, such as mobile devices. Many works have been conducted to reduce the latency of running NeRF models. However, most of them still require high-end GPU for acceleration or extra storage memory, which is all unavailable on mobile devices. Another emerging direction utilizes the neural light field (NeLF) for speedup, as only one forward pass is performed on a ray to predict the pixel color. Nevertheless, to reach a similar rendering quality as NeRF, the network in NeLF is designed with intensive computation, which is not mobile-friendly. In this work, we propose an efficient network that runs in real-time on mobile devices for neural rendering. W",
    "link": "http://arxiv.org/abs/2212.08057",
    "context": "Title: Real-Time Neural Light Field on Mobile Devices. (arXiv:2212.08057v2 [cs.CV] UPDATED)\nAbstract: Recent efforts in Neural Rendering Fields (NeRF) have shown impressive results on novel view synthesis by utilizing implicit neural representation to represent 3D scenes. Due to the process of volumetric rendering, the inference speed for NeRF is extremely slow, limiting the application scenarios of utilizing NeRF on resource-constrained hardware, such as mobile devices. Many works have been conducted to reduce the latency of running NeRF models. However, most of them still require high-end GPU for acceleration or extra storage memory, which is all unavailable on mobile devices. Another emerging direction utilizes the neural light field (NeLF) for speedup, as only one forward pass is performed on a ray to predict the pixel color. Nevertheless, to reach a similar rendering quality as NeRF, the network in NeLF is designed with intensive computation, which is not mobile-friendly. In this work, we propose an efficient network that runs in real-time on mobile devices for neural rendering. W",
    "path": "papers/22/12/2212.08057.json",
    "total_tokens": 839,
    "translated_title": "移动设备上的实时神经光场渲染",
    "translated_abstract": "近期，神经渲染场（NeRF）在利用隐式神经表示法来表示3D场景，并实现新视角合成方面取得了令人印象深刻的成果。由于体积渲染的过程，NeRF的推理速度非常缓慢，限制了在移动设备等资源受限的硬件上利用NeRF的应用场景。有许多工作致力于减少运行NeRF模型的延迟。但是，他们大多仍需要高端GPU进行加速或额外的存储内存，这在移动设备上都不可用。另一个新出现的方向则利用神经光场（NeLF）来进行加速，因为一条射线上只需进行一次向前传递即可预测像素颜色。然而，为了达到与NeRF类似的渲染质量，NeLF中的网络设计需要大量的计算，这对移动设备并不友好。在本文中，我们提出了一种在移动设备上实时运行的高效网络，用于神经渲染。",
    "tldr": "本文提出了一种在移动设备上实时运行的高效网络，用于神经渲染。",
    "en_tdlr": "This paper proposes an efficient network that runs in real-time on mobile devices for neural rendering."
}