{
    "title": "Graphon Pooling for Reducing Dimensionality of Signals and Convolutional Operators on Graphs. (arXiv:2212.08171v2 [cs.LG] UPDATED)",
    "abstract": "In this paper we propose a pooling approach for convolutional information processing on graphs relying on the theory of graphons and limits of dense graph sequences. We present three methods that exploit the induced graphon representation of graphs and graph signals on partitions of [0, 1]2 in the graphon space. As a result we derive low dimensional representations of the convolutional operators, while a dimensionality reduction of the signals is achieved by simple local interpolation of functions in L2([0, 1]). We prove that those low dimensional representations constitute a convergent sequence of graphs and graph signals, respectively. The methods proposed and the theoretical guarantees that we provide show that the reduced graphs and signals inherit spectral-structural properties of the original quantities. We evaluate our approach with a set of numerical experiments performed on graph neural networks (GNNs) that rely on graphon pooling. We observe that graphon pooling performs sign",
    "link": "http://arxiv.org/abs/2212.08171",
    "context": "Title: Graphon Pooling for Reducing Dimensionality of Signals and Convolutional Operators on Graphs. (arXiv:2212.08171v2 [cs.LG] UPDATED)\nAbstract: In this paper we propose a pooling approach for convolutional information processing on graphs relying on the theory of graphons and limits of dense graph sequences. We present three methods that exploit the induced graphon representation of graphs and graph signals on partitions of [0, 1]2 in the graphon space. As a result we derive low dimensional representations of the convolutional operators, while a dimensionality reduction of the signals is achieved by simple local interpolation of functions in L2([0, 1]). We prove that those low dimensional representations constitute a convergent sequence of graphs and graph signals, respectively. The methods proposed and the theoretical guarantees that we provide show that the reduced graphs and signals inherit spectral-structural properties of the original quantities. We evaluate our approach with a set of numerical experiments performed on graph neural networks (GNNs) that rely on graphon pooling. We observe that graphon pooling performs sign",
    "path": "papers/22/12/2212.08171.json",
    "total_tokens": 818,
    "translated_title": "图形池化减小信号和图上卷积运算的维度",
    "translated_abstract": "本文提出了一种在图上进行卷积信息处理的池化方法，该方法基于图的图象理论和密集图序列的极限。我们提出了三种方法，利用图的图握表示和图象在[0, 1]2上的分区进行计算。结果我们得到卷积运算符的低维表示，信号的降维是通过L2([0, 1])中的简单局部插值函数实现的。我们证明了这些低维表示分别构成了图和图象的收敛序列。我们提出的方法和提供的理论保证表明降低后的图和信号继承了原始数量的光谱结构特性。我们通过在依赖图形池化的图神经网络(GNNs)上进行一系列数值实验来评估我们的方法。观察到图形池化的效果很好。",
    "tldr": "本文提出了一种在图上进行卷积信息处理的池化方法，通过利用图的图象理论和密集图序列的极限来实现，得到卷积运算符的低维表示，并通过简单的局部插值函数实现信号的降维，具有较好的效果。"
}