{
    "title": "Detecting Change Intervals with Isolation Distributional Kernel. (arXiv:2212.14630v3 [cs.LG] UPDATED)",
    "abstract": "Detecting abrupt changes in data distribution is one of the most significant tasks in streaming data analysis. Although many unsupervised Change-Point Detection (CPD) methods have been proposed recently to identify those changes, they still suffer from missing subtle changes, poor scalability, or/and sensitivity to outliers. To meet these challenges, we are the first to generalise the CPD problem as a special case of the Change-Interval Detection (CID) problem. Then we propose a CID method, named iCID, based on a recent Isolation Distributional Kernel (IDK). iCID identifies the change interval if there is a high dissimilarity score between two non-homogeneous temporal adjacent intervals. The data-dependent property and finite feature map of IDK enabled iCID to efficiently identify various types of change-points in data streams with the tolerance of outliers. Moreover, the proposed online and offline versions of iCID have the ability to optimise key parameter settings. The effectiveness",
    "link": "http://arxiv.org/abs/2212.14630",
    "context": "Title: Detecting Change Intervals with Isolation Distributional Kernel. (arXiv:2212.14630v3 [cs.LG] UPDATED)\nAbstract: Detecting abrupt changes in data distribution is one of the most significant tasks in streaming data analysis. Although many unsupervised Change-Point Detection (CPD) methods have been proposed recently to identify those changes, they still suffer from missing subtle changes, poor scalability, or/and sensitivity to outliers. To meet these challenges, we are the first to generalise the CPD problem as a special case of the Change-Interval Detection (CID) problem. Then we propose a CID method, named iCID, based on a recent Isolation Distributional Kernel (IDK). iCID identifies the change interval if there is a high dissimilarity score between two non-homogeneous temporal adjacent intervals. The data-dependent property and finite feature map of IDK enabled iCID to efficiently identify various types of change-points in data streams with the tolerance of outliers. Moreover, the proposed online and offline versions of iCID have the ability to optimise key parameter settings. The effectiveness",
    "path": "papers/22/12/2212.14630.json",
    "total_tokens": 857,
    "translated_title": "使用隔离分布核检测变化间隔",
    "translated_abstract": "在流数据分析中，检测数据分布的突变是最重要的任务之一。尽管最近提出了许多无监督的变点检测（CPD）方法来识别这些变化，但它们仍然存在对微小变化的遗漏、可伸缩性差或/和对异常值的敏感性等问题。为了应对这些挑战，我们首次将变点检测问题广义为变间隔检测（CID）问题的特殊情况。然后，我们基于最新的隔离分布核（IDK）提出了一种CID方法，名为iCID。如果两个非均匀时间相邻间隔之间存在高不相似度得分，iCID将识别变化间隔。IDK的数据依赖性和有限特征映射使iCID能够有效识别具有异常值容忍度的数据流中的各种类型的变点。此外，iCID的提出了在线和离线版本，具有优化关键参数设置的能力。",
    "tldr": "这篇论文提出了一种基于隔离分布核的CID方法，用于在数据流中高效识别各种类型的变点并容忍异常值。",
    "en_tdlr": "This paper presents a CID method, named iCID, based on an Isolation Distributional Kernel (IDK), which efficiently identifies various types of change-points in data streams with the tolerance of outliers."
}