{
    "title": "Unsupervised Discontinuous Constituency Parsing with Mildly Context-Sensitive Grammars. (arXiv:2212.09140v2 [cs.CL] UPDATED)",
    "abstract": "We study grammar induction with mildly context-sensitive grammars for unsupervised discontinuous parsing. Using the probabilistic linear context-free rewriting system (LCFRS) formalism, our approach fixes the rule structure in advance and focuses on parameter learning with maximum likelihood. To reduce the computational complexity of both parsing and parameter estimation, we restrict the grammar formalism to LCFRS-2 (i.e., binary LCFRS with fan-out two) and further discard rules that require O(n^6) time to parse, reducing inference to O(n^5). We find that using a large number of nonterminals is beneficial and thus make use of tensor decomposition-based rank-space dynamic programming with an embedding-based parameterization of rule probabilities to scale up the number of nonterminals. Experiments on German and Dutch show that our approach is able to induce linguistically meaningful trees with continuous and discontinuous structures",
    "link": "http://arxiv.org/abs/2212.09140",
    "context": "Title: Unsupervised Discontinuous Constituency Parsing with Mildly Context-Sensitive Grammars. (arXiv:2212.09140v2 [cs.CL] UPDATED)\nAbstract: We study grammar induction with mildly context-sensitive grammars for unsupervised discontinuous parsing. Using the probabilistic linear context-free rewriting system (LCFRS) formalism, our approach fixes the rule structure in advance and focuses on parameter learning with maximum likelihood. To reduce the computational complexity of both parsing and parameter estimation, we restrict the grammar formalism to LCFRS-2 (i.e., binary LCFRS with fan-out two) and further discard rules that require O(n^6) time to parse, reducing inference to O(n^5). We find that using a large number of nonterminals is beneficial and thus make use of tensor decomposition-based rank-space dynamic programming with an embedding-based parameterization of rule probabilities to scale up the number of nonterminals. Experiments on German and Dutch show that our approach is able to induce linguistically meaningful trees with continuous and discontinuous structures",
    "path": "papers/22/12/2212.09140.json",
    "total_tokens": 943,
    "translated_title": "无监督间断性组块句法分析及其与轻度上下文有关的语法",
    "translated_abstract": "本文研究了使用轻度上下文敏感语法进行无监督间断性组块句法分析的语法归纳。我们使用概率线性上下文无关重写系统 (LCFRS) 形式，在保证规则结构的前提下，重点关注最大似然的参数学习。为了降低解析和参数估计的计算复杂度，我们将语法形式限制为 LCFRS-2 (即，具有两个扇出的二元 LCFRS) 并且丢弃需要 O(n^6) 的解析时间的规则，将推理降低到 O(n^5)。我们发现使用大量非终结符是有益的，因此利用基于张量分解的秩空间动态规划和基于嵌入的规则概率参数化来扩大非终结符的数量。对德语和荷兰语的实验证明，我们的方法能够诱导出具有连续和不连续结构的语言学意义的树状结果。",
    "tldr": "本文研究了使用轻度上下文敏感语法进行无监督间断性组块句法分析的语法归纳。在保证规则结构的前提下，我们用最大似然方法进行参数学习，实验证明该方法对大量非终结符具有扩展灵活性。",
    "en_tdlr": "This paper studies unsupervised discontinuous parsing using mildly context-sensitive grammars for grammar induction. The approach focuses on parameter learning with maximum likelihood, while restricting the grammar form to LCFRS-2 and discarding rules that require high parsing complexity, and utilizes tensor decomposition-based rank-space dynamic programming for scalability of nonterminals in experiments on German and Dutch."
}