{
    "title": "Deep learning applied to computational mechanics: A comprehensive review, state of the art, and the classics. (arXiv:2212.08989v3 [cs.LG] UPDATED)",
    "abstract": "Three recent breakthroughs due to AI in arts and science serve as motivation: An award winning digital image, protein folding, fast matrix multiplication. Many recent developments in artificial neural networks, particularly deep learning (DL), applied and relevant to computational mechanics (solid, fluids, finite-element technology) are reviewed in detail. Both hybrid and pure machine learning (ML) methods are discussed. Hybrid methods combine traditional PDE discretizations with ML methods either (1) to help model complex nonlinear constitutive relations, (2) to nonlinearly reduce the model order for efficient simulation (turbulence), or (3) to accelerate the simulation by predicting certain components in the traditional integration methods. Here, methods (1) and (2) relied on Long-Short-Term Memory (LSTM) architecture, with method (3) relying on convolutional neural networks. Pure ML methods to solve (nonlinear) PDEs are represented by Physics-Informed Neural network (PINN) methods, ",
    "link": "http://arxiv.org/abs/2212.08989",
    "context": "Title: Deep learning applied to computational mechanics: A comprehensive review, state of the art, and the classics. (arXiv:2212.08989v3 [cs.LG] UPDATED)\nAbstract: Three recent breakthroughs due to AI in arts and science serve as motivation: An award winning digital image, protein folding, fast matrix multiplication. Many recent developments in artificial neural networks, particularly deep learning (DL), applied and relevant to computational mechanics (solid, fluids, finite-element technology) are reviewed in detail. Both hybrid and pure machine learning (ML) methods are discussed. Hybrid methods combine traditional PDE discretizations with ML methods either (1) to help model complex nonlinear constitutive relations, (2) to nonlinearly reduce the model order for efficient simulation (turbulence), or (3) to accelerate the simulation by predicting certain components in the traditional integration methods. Here, methods (1) and (2) relied on Long-Short-Term Memory (LSTM) architecture, with method (3) relying on convolutional neural networks. Pure ML methods to solve (nonlinear) PDEs are represented by Physics-Informed Neural network (PINN) methods, ",
    "path": "papers/22/12/2212.08989.json",
    "total_tokens": 986,
    "translated_title": "深度学习在计算力学中的应用：综述、现状与经典",
    "translated_abstract": "本文综述深度学习在计算力学中的应用，并讨论了混合和纯深度学习方法的进展。混合方法将传统PDE离散化与深度学习方法相结合，纯深度学习方法则代表为物理信息神经网络（PINN）方法。",
    "tldr": "本文综述了深度学习在计算力学中的应用，讨论了混合和纯深度学习方法的进展。其中，混合方法将传统PDE离散化与深度学习相结合，而纯深度学习方法则代表为物理信息神经网络（PINN）方法。",
    "en_tdlr": "This paper reviews the application of deep learning in computational mechanics, discussing both hybrid and pure machine learning methods and highlighting the use of Long-Short-Term Memory (LSTM) architecture and Physics-Informed Neural network (PINN) methods."
}