{
    "title": "Bipolar Theorems for Sets of Non-negative Random Variables. (arXiv:2212.14259v2 [math.PR] UPDATED)",
    "abstract": "This paper assumes a robust, in general not dominated, probabilistic framework and provides necessary and sufficient conditions for a bipolar representation of subsets of the set of all quasi-sure equivalence classes of non-negative random variables without any further conditions on the underlying measure space. This generalises and unifies existing bipolar theorems proved under stronger assumptions on the robust framework. Moreover, we sketch applications to issues in mathematical finance and a mass transport type duality.",
    "link": "http://arxiv.org/abs/2212.14259",
    "context": "Title: Bipolar Theorems for Sets of Non-negative Random Variables. (arXiv:2212.14259v2 [math.PR] UPDATED)\nAbstract: This paper assumes a robust, in general not dominated, probabilistic framework and provides necessary and sufficient conditions for a bipolar representation of subsets of the set of all quasi-sure equivalence classes of non-negative random variables without any further conditions on the underlying measure space. This generalises and unifies existing bipolar theorems proved under stronger assumptions on the robust framework. Moreover, we sketch applications to issues in mathematical finance and a mass transport type duality.",
    "path": "papers/22/12/2212.14259.json",
    "total_tokens": 624,
    "translated_title": "非负随机变量集合的双极定理",
    "translated_abstract": "本文假设一个强健的、一般不被支配的概率框架，并为非负随机变量的所有准确等价类的子集提供双极表示的必要和充分条件，而不需要对基础测度空间做进一步的限制。这扩展和统一了现有的在强健框架上证明的双极定理。此外，我们概述了在数学金融和运输问题中的应用。",
    "tldr": "本文提出了非负随机变量集合的双极定理的必要和充分条件，扩展和统一了现有的在强健框架上证明的双极定理。",
    "en_tdlr": "This paper presents the necessary and sufficient conditions for the bipolar representation of subsets of non-negative random variables and generalizes and unifies existing bipolar theorems. It also outlines their application in mathematical finance and a mass transport type duality."
}