{
    "title": "On LASSO for High Dimensional Predictive Regression. (arXiv:2212.07052v2 [econ.EM] UPDATED)",
    "abstract": "This paper examines LASSO, a widely-used $L_{1}$-penalized regression method, in high dimensional linear predictive regressions, particularly when the number of potential predictors exceeds the sample size and numerous unit root regressors are present. The consistency of LASSO is contingent upon two key components: the deviation bound of the cross product of the regressors and the error term, and the restricted eigenvalue of the Gram matrix. We present new probabilistic bounds for these components, suggesting that LASSO's rates of convergence are different from those typically observed in cross-sectional cases. When applied to a mixture of stationary, nonstationary, and cointegrated predictors, LASSO maintains its asymptotic guarantee if predictors are scale-standardized. Leveraging machine learning and macroeconomic domain expertise, LASSO demonstrates strong performance in forecasting the unemployment rate, as evidenced by its application to the FRED-MD database.",
    "link": "http://arxiv.org/abs/2212.07052",
    "context": "Title: On LASSO for High Dimensional Predictive Regression. (arXiv:2212.07052v2 [econ.EM] UPDATED)\nAbstract: This paper examines LASSO, a widely-used $L_{1}$-penalized regression method, in high dimensional linear predictive regressions, particularly when the number of potential predictors exceeds the sample size and numerous unit root regressors are present. The consistency of LASSO is contingent upon two key components: the deviation bound of the cross product of the regressors and the error term, and the restricted eigenvalue of the Gram matrix. We present new probabilistic bounds for these components, suggesting that LASSO's rates of convergence are different from those typically observed in cross-sectional cases. When applied to a mixture of stationary, nonstationary, and cointegrated predictors, LASSO maintains its asymptotic guarantee if predictors are scale-standardized. Leveraging machine learning and macroeconomic domain expertise, LASSO demonstrates strong performance in forecasting the unemployment rate, as evidenced by its application to the FRED-MD database.",
    "path": "papers/22/12/2212.07052.json",
    "total_tokens": 899,
    "translated_title": "高维预测回归中LASSO的研究",
    "translated_abstract": "本文研究了LASSO在高维线性预测回归中的应用，特别是在潜在预测变量数量超过样本量且存在大量单位根回归器的情况下。LASSO的一致性取决于两个关键组成部分：回归器和误差项的交叉乘积的偏差界限以及Gram矩阵的受限特征值。我们提出了这些组成部分的新的概率界限，表明LASSO的收敛速度与典型的横断面情况不同。当应用于混合的平稳、非平稳和协整预测器时，如果预测器进行了标度标准化，LASSO仍然保持其渐近保证。利用机器学习和宏观经济领域的专业知识，LASSO在预测失业率方面表现出强大的性能，这一点在其应用于FRED-MD数据库中得到了证实。",
    "tldr": "本文研究了高维预测回归中LASSO的应用，提出了LASSO的收敛速度与横断面情况不同的新的概率界限，并展示了LASSO在预测失业率方面的强大性能。",
    "en_tdlr": "This paper examines the application of LASSO in high dimensional predictive regression, presents new probabilistic bounds for LASSO's convergence rates different from those observed in cross-sectional cases, and demonstrates the strong performance of LASSO in forecasting the unemployment rate."
}