{
    "title": "NISQ-ready community detection based on separation-node identification. (arXiv:2212.14717v2 [quant-ph] UPDATED)",
    "abstract": "The analysis of network structure is essential to many scientific areas, ranging from biology to sociology. As the computational task of clustering these networks into partitions, i.e., solving the community detection problem, is generally NP-hard, heuristic solutions are indispensable. The exploration of expedient heuristics has led to the development of particularly promising approaches in the emerging technology of quantum computing. Motivated by the substantial hardware demands for all established quantum community detection approaches, we introduce a novel QUBO based approach that only needs number-of-nodes many qubits and is represented by a QUBO-matrix as sparse as the input graph's adjacency matrix. The substantial improvement on the sparsity of the QUBO-matrix, which is typically very dense in related work, is achieved through the novel concept of separation-nodes. Instead of assigning every node to a community directly, this approach relies on the identification of a separati",
    "link": "http://arxiv.org/abs/2212.14717",
    "context": "Title: NISQ-ready community detection based on separation-node identification. (arXiv:2212.14717v2 [quant-ph] UPDATED)\nAbstract: The analysis of network structure is essential to many scientific areas, ranging from biology to sociology. As the computational task of clustering these networks into partitions, i.e., solving the community detection problem, is generally NP-hard, heuristic solutions are indispensable. The exploration of expedient heuristics has led to the development of particularly promising approaches in the emerging technology of quantum computing. Motivated by the substantial hardware demands for all established quantum community detection approaches, we introduce a novel QUBO based approach that only needs number-of-nodes many qubits and is represented by a QUBO-matrix as sparse as the input graph's adjacency matrix. The substantial improvement on the sparsity of the QUBO-matrix, which is typically very dense in related work, is achieved through the novel concept of separation-nodes. Instead of assigning every node to a community directly, this approach relies on the identification of a separati",
    "path": "papers/22/12/2212.14717.json",
    "total_tokens": 1060,
    "translated_title": "基于分离节点识别的 NISQ-ready 社区检测",
    "translated_abstract": "网络结构分析在许多科学领域中都是必不可少的，从生物学到社会学。将这些网络聚类成分区的计算任务，即解决社区检测问题，通常是 NP-hard 的，因此启发式解决方案是不可或缺的。在新兴的量子计算技术中，对有效启发式的探索已经导致了特别有前途的方法的发展。由于所有已建立的量子社区检测方法都对硬件存在重大要求，我们引入了一种新的基于 QUBO 的方法，仅需要与节点数量相同的量子比特，并以与输入图的邻接矩阵一样稀疏的 QUBO 矩阵表示。通过分离节点的新概念，实现了 QUBO 矩阵的显著改进，这在相关工作中通常非常密集。这种方法不是直接将每个节点分配到一个社区中，而是依赖于分离节点的识别，从而能够高效地识别社区。我们在基准图上展示了我们方法的有效性，并在状态-of-the-art 的经典和量子社区检测算法中达到了竞争力的结果。",
    "tldr": "本文提出了一种基于 QUBO 的新方法，只需要与节点数量相同的量子比特，并以与输入图的邻接矩阵一样稀疏的 QUBO 矩阵表示，通过分离节点的概念实现了 QUBO 矩阵的显著改进，该方法只需要识别分离节点即可高效识别社区。",
    "en_tdlr": "This paper proposes a novel QUBO based approach for efficient community detection, which only needs a quantum computer with number-of-nodes many qubits and a QUBO-matrix as sparse as the input graph's adjacency matrix. The improvement in QUBO-matrix sparsity is achieved through the innovative concept of separation-nodes, which allows for the identification of communities in an efficient way."
}