{
    "title": "DeepCut: Unsupervised Segmentation using Graph Neural Networks Clustering. (arXiv:2212.05853v3 [cs.CV] UPDATED)",
    "abstract": "Image segmentation is a fundamental task in computer vision. Data annotation for training supervised methods can be labor-intensive, motivating unsupervised methods. Current approaches often rely on extracting deep features from pre-trained networks to construct a graph, and classical clustering methods like k-means and normalized-cuts are then applied as a post-processing step. However, this approach reduces the high-dimensional information encoded in the features to pair-wise scalar affinities. To address this limitation, this study introduces a lightweight Graph Neural Network (GNN) to replace classical clustering methods while optimizing for the same clustering objective function. Unlike existing methods, our GNN takes both the pair-wise affinities between local image features and the raw features as input. This direct connection between the raw features and the clustering objective enables us to implicitly perform classification of the clusters between different graphs, resulting ",
    "link": "http://arxiv.org/abs/2212.05853",
    "context": "Title: DeepCut: Unsupervised Segmentation using Graph Neural Networks Clustering. (arXiv:2212.05853v3 [cs.CV] UPDATED)\nAbstract: Image segmentation is a fundamental task in computer vision. Data annotation for training supervised methods can be labor-intensive, motivating unsupervised methods. Current approaches often rely on extracting deep features from pre-trained networks to construct a graph, and classical clustering methods like k-means and normalized-cuts are then applied as a post-processing step. However, this approach reduces the high-dimensional information encoded in the features to pair-wise scalar affinities. To address this limitation, this study introduces a lightweight Graph Neural Network (GNN) to replace classical clustering methods while optimizing for the same clustering objective function. Unlike existing methods, our GNN takes both the pair-wise affinities between local image features and the raw features as input. This direct connection between the raw features and the clustering objective enables us to implicitly perform classification of the clusters between different graphs, resulting ",
    "path": "papers/22/12/2212.05853.json",
    "total_tokens": 926,
    "translated_title": "DeepCut: 使用图神经网络聚类的无监督分割技术",
    "translated_abstract": "图像分割是计算机视觉中的基本任务。为了训练监督方法需要进行数据注释，这是一项耗时耗力的工作，因此激励了无监督方法的发展。当前的方法通常依赖于从预训练网络中提取深度特征来构建图，然后再应用经典的聚类方法如k-means和归一化割作为后处理步骤。然而，这种方法将特征中的高维信息降维为一对一的标量亲和力。为了解决这个限制，本研究引入了一种轻量级的图神经网络（GNN），用它来替代经典的聚类方法，并在优化相同的聚类目标函数的同时。与现有的方法不同，我们的GNN同时接受局部图像特征之间的一对一亲和力和原始特征作为输入。原始特征与聚类目标之间的直接连接使得我们能够隐式地对不同图之间的聚类进行分类，从而获得更好的分割效果。",
    "tldr": "本研究引入了一种轻量级的图神经网络（GNN）来解决图像分割中特征降维的问题，并采用无监督方法进行分割。与传统方法相比，该方法在构建图时同时使用局部特征和原始特征，从而能更好地进行聚类和分类分割。",
    "en_tdlr": "This study introduces a lightweight Graph Neural Network (GNN) to address the issue of dimensionality reduction in image segmentation, enabling unsupervised segmentation by utilizing both local and raw features for clustering and classification purposes."
}