{
    "title": "Breaking the Spurious Causality of Conditional Generation via Fairness Intervention with Corrective Sampling. (arXiv:2212.02090v2 [cs.CV] UPDATED)",
    "abstract": "To capture the relationship between samples and labels, conditional generative models often inherit spurious correlations from the training dataset. This can result in label-conditional distributions that are imbalanced with respect to another latent attribute. To mitigate this issue, which we call spurious causality of conditional generation, we propose a general two-step strategy. (a) Fairness Intervention (FI): emphasize the minority samples that are hard to generate due to the spurious correlation in the training dataset. (b) Corrective Sampling (CS): explicitly filter the generated samples and ensure that they follow the desired latent attribute distribution. We have designed the fairness intervention to work for various degrees of supervision on the spurious attribute, including unsupervised, weakly-supervised, and semi-supervised scenarios. Our experimental results demonstrate that FICS can effectively resolve spurious causality of conditional generation across various datasets.",
    "link": "http://arxiv.org/abs/2212.02090",
    "context": "Title: Breaking the Spurious Causality of Conditional Generation via Fairness Intervention with Corrective Sampling. (arXiv:2212.02090v2 [cs.CV] UPDATED)\nAbstract: To capture the relationship between samples and labels, conditional generative models often inherit spurious correlations from the training dataset. This can result in label-conditional distributions that are imbalanced with respect to another latent attribute. To mitigate this issue, which we call spurious causality of conditional generation, we propose a general two-step strategy. (a) Fairness Intervention (FI): emphasize the minority samples that are hard to generate due to the spurious correlation in the training dataset. (b) Corrective Sampling (CS): explicitly filter the generated samples and ensure that they follow the desired latent attribute distribution. We have designed the fairness intervention to work for various degrees of supervision on the spurious attribute, including unsupervised, weakly-supervised, and semi-supervised scenarios. Our experimental results demonstrate that FICS can effectively resolve spurious causality of conditional generation across various datasets.",
    "path": "papers/22/12/2212.02090.json",
    "total_tokens": 823,
    "translated_title": "通过公平干预和纠正采样来打破条件生成的伪因果关系",
    "translated_abstract": "为了捕捉样本和标签之间的关系，条件生成模型经常从训练数据集中继承了伪相关性。这可能导致标签条件分布在另一个潜在属性上不平衡。为了减轻这个问题，我们提出了一种通用的两步策略。 （a）公平干预（FI）：强调在训练数据集中由于伪相关性难以生成的少数样本。（b）纠正采样（CS）：显式过滤生成的样本，并确保它们遵循所需的潜在属性分布。我们设计的公平干预可以适用于不同程度的对伪属性的监督，包括无监督、弱监督和半监督场景。我们的实验结果证明，FICS可以有效地解决各种数据集上的条件生成的伪因果关系。",
    "tldr": "本文提出了一种通过公平干预和纠正采样的方法来解决条件生成中的伪因果关系。实验证明，该方法在各种数据集上都能有效地解决这个问题。",
    "en_tdlr": "This paper proposes a method to address the spurious causality of conditional generation through fairness intervention and corrective sampling. Experimental results demonstrate its effectiveness across various datasets."
}