{
    "title": "Machine Learning as an Accurate Predictor for Percolation Threshold of Diverse Networks. (arXiv:2212.14694v2 [physics.soc-ph] UPDATED)",
    "abstract": "The percolation threshold is an important measure to determine the inherent rigidity of large networks. Predictors of the percolation threshold for large networks are computationally intense to run, hence it is a necessity to develop predictors of the percolation threshold of networks, that do not rely on numerical simulations. We demonstrate the efficacy of five machine learning-based regression techniques for the accurate prediction of the percolation threshold. The dataset generated to train the machine learning models contains a total of 777 real and synthetic networks. It consists of 5 statistical and structural properties of networks as features and the numerically computed percolation threshold as the output attribute. We establish that the machine learning models outperform three existing empirical estimators of bond percolation threshold, and extend this experiment to predict site and explosive percolation. Further, we compared the performance of our models in predicting the p",
    "link": "http://arxiv.org/abs/2212.14694",
    "context": "Title: Machine Learning as an Accurate Predictor for Percolation Threshold of Diverse Networks. (arXiv:2212.14694v2 [physics.soc-ph] UPDATED)\nAbstract: The percolation threshold is an important measure to determine the inherent rigidity of large networks. Predictors of the percolation threshold for large networks are computationally intense to run, hence it is a necessity to develop predictors of the percolation threshold of networks, that do not rely on numerical simulations. We demonstrate the efficacy of five machine learning-based regression techniques for the accurate prediction of the percolation threshold. The dataset generated to train the machine learning models contains a total of 777 real and synthetic networks. It consists of 5 statistical and structural properties of networks as features and the numerically computed percolation threshold as the output attribute. We establish that the machine learning models outperform three existing empirical estimators of bond percolation threshold, and extend this experiment to predict site and explosive percolation. Further, we compared the performance of our models in predicting the p",
    "path": "papers/22/12/2212.14694.json",
    "total_tokens": 869,
    "translated_title": "机器学习作为多种网络渗透阈值的精准预测器。",
    "translated_abstract": "渗透阈值是确定大型网络内在刚度的重要度量。预测大型网络的渗透阈值是计算密集型的，因此有必要开发不依赖数值模拟的网络渗透阈值预测器。我们展示了五种基于机器学习的回归技术，用于准确预测渗透阈值。生成用于训练机器学习模型的数据集包含总共777个真实和合成网络。它包括网络的5种统计和结构性质作为特征，以及数值计算得出的渗透阈值作为输出属性。我们证明了机器学习模型优于三种现有的合成估计器的键合渗透阈值，还将此实验扩展到预测位置和爆炸性渗透。此外，我们比较了我们的模型在预测P时的表现。",
    "tldr": "本研究展示了五种机器学习回归技术在精准预测渗透阈值方面的有效性，并证明其优于现有的合成估计器，在预测位置和爆炸性渗透时也有潜力。",
    "en_tdlr": "This study demonstrates the efficacy of five machine learning-based regression techniques in accurately predicting the percolation threshold, and proves their superiority over existing empirical estimators, with potential in predicting site and explosive percolation."
}