{
    "title": "Optimal investment under partial information and robust VaR-type constraint. (arXiv:2212.04394v2 [q-fin.RM] UPDATED)",
    "abstract": "This paper extends the utility maximization literature by combining partial information and (robust) regulatory constraints. Partial information is characterized by the fact that the stock price itself is observable by the optimizing financial institution, but the outcome of the market price of the risk $\\theta$ is unknown to the institution. The regulator develops either a congruent or distinct perception of the market price of risk in comparison to the financial institution when imposing the Value-at-Risk (VaR) constraint. We also discuss a robust VaR constraint in which the regulator uses a worst-case measure. The solution to our optimization problem takes the same form as in the full information case: optimal wealth can be expressed as a decreasing function of state price density. The optimal wealth is equal to the minimum regulatory financing requirement in the intermediate economic states. The key distinction lies in the fact that the price density in the final state depends on t",
    "link": "http://arxiv.org/abs/2212.04394",
    "context": "Title: Optimal investment under partial information and robust VaR-type constraint. (arXiv:2212.04394v2 [q-fin.RM] UPDATED)\nAbstract: This paper extends the utility maximization literature by combining partial information and (robust) regulatory constraints. Partial information is characterized by the fact that the stock price itself is observable by the optimizing financial institution, but the outcome of the market price of the risk $\\theta$ is unknown to the institution. The regulator develops either a congruent or distinct perception of the market price of risk in comparison to the financial institution when imposing the Value-at-Risk (VaR) constraint. We also discuss a robust VaR constraint in which the regulator uses a worst-case measure. The solution to our optimization problem takes the same form as in the full information case: optimal wealth can be expressed as a decreasing function of state price density. The optimal wealth is equal to the minimum regulatory financing requirement in the intermediate economic states. The key distinction lies in the fact that the price density in the final state depends on t",
    "path": "papers/22/12/2212.04394.json",
    "total_tokens": 852,
    "translated_title": "具有部分信息和鲁棒VaR约束下的最优投资",
    "translated_abstract": "本文通过结合部分信息和（鲁棒）监管约束，扩展了效用最大化文献。部分信息的特征是，优化金融机构能观察到股价本身，但市场风险$\\theta$的结果对机构来说是未知的。当强加风险价值（VaR）约束时，监管机构对风险市场价格的感知不同于金融机构。我们还讨论了强鲁棒VaR约束，其中监管机构使用最坏情况度量。我们优化问题的解与完全信息案例的形式相同：最优财富可以表示为状态价格密度的递减函数。最优财富等于中间经济状态下的最低监管融资要求。关键区别在于最终状态的价格密度取决于...",
    "tldr": "本文将部分信息和（鲁棒）监管约束结合在一起，扩展了效用最大化领域的研究。当监管机构强加风险价值(VaR)约束时，对风险市场价格的感知与金融机构不同。在最优解中，最优财富可以表示为状态价格密度的递减函数，并且在中间经济状态下最优财富等于最低监管融资要求。"
}