{
    "title": "Simulator-Based Self-Supervision for Learned 3D Tomography Reconstruction. (arXiv:2212.07431v2 [eess.IV] UPDATED)",
    "abstract": "We propose a deep learning method for 3D volumetric reconstruction in low-dose helical cone-beam computed tomography. Prior machine learning approaches require reference reconstructions computed by another algorithm for training. In contrast, we train our model in a fully self-supervised manner using only noisy 2D X-ray data. This is enabled by incorporating a fast differentiable CT simulator in the training loop. As we do not rely on reference reconstructions, the fidelity of our results is not limited by their potential shortcomings. We evaluate our method on real helical cone-beam projections and simulated phantoms. Our results show significantly higher visual fidelity and better PSNR over techniques that rely on existing reconstructions. When applied to full-dose data, our method produces high-quality results orders of magnitude faster than iterative techniques.",
    "link": "http://arxiv.org/abs/2212.07431",
    "context": "Title: Simulator-Based Self-Supervision for Learned 3D Tomography Reconstruction. (arXiv:2212.07431v2 [eess.IV] UPDATED)\nAbstract: We propose a deep learning method for 3D volumetric reconstruction in low-dose helical cone-beam computed tomography. Prior machine learning approaches require reference reconstructions computed by another algorithm for training. In contrast, we train our model in a fully self-supervised manner using only noisy 2D X-ray data. This is enabled by incorporating a fast differentiable CT simulator in the training loop. As we do not rely on reference reconstructions, the fidelity of our results is not limited by their potential shortcomings. We evaluate our method on real helical cone-beam projections and simulated phantoms. Our results show significantly higher visual fidelity and better PSNR over techniques that rely on existing reconstructions. When applied to full-dose data, our method produces high-quality results orders of magnitude faster than iterative techniques.",
    "path": "papers/22/12/2212.07431.json",
    "total_tokens": 885,
    "translated_title": "基于模拟自监督学习的三维断层成像重建方法",
    "translated_abstract": "我们提出了一种用于低剂量螺旋锥束计算机体层成像的三维体积重建的深度学习方法。先前的机器学习方法需要用另一个算法计算参考重建以进行训练。相比之下，我们使用仅带有噪声的二维X射线数据以完全自我监督的方式训练模型。这是通过在训练循环中结合快速可微的计算机断层成像模拟器实现的。由于我们不依赖于参考重建，因此我们结果的保真度不受其潜在缺陷的限制。我们在真实螺旋锥束投影和模拟幻像上评估了我们的方法。我们的结果显示与依赖现有重建技术的技术相比，具有显着更高的视觉保真度和更好的PSNR。当应用于全剂量数据时，我们的方法产生的高质量结果比迭代技术快几个数量级。",
    "tldr": "这是一种能够利用计算机断层成像模拟器进行自我监督学习的三维断层成像重建方法，相比于之前的方法，不需要参考重建以进行训练，结果保真度更高且速度更快。",
    "en_tdlr": "This is a 3D tomography reconstruction method that utilizes a CT simulator for self-supervised learning, which does not require reference reconstructions for training and produces higher fidelity results at a faster speed."
}