{
    "title": "Partly Linear Instrumental Variables Regressions without Smoothing on the Instruments. (arXiv:2212.11012v2 [econ.EM] UPDATED)",
    "abstract": "We consider a semiparametric partly linear model identified by instrumental variables. We propose an estimation method that does not smooth on the instruments and we extend the Landweber-Fridman regularization scheme to the estimation of this semiparametric model. We then show the asymptotic normality of the parametric estimator and obtain the convergence rate for the nonparametric estimator. Our estimator that does not smooth on the instruments coincides with a typical estimator that does smooth on the instruments but keeps the respective bandwidth fixed as the sample size increases. We propose a data driven method for the selection of the regularization parameter, and in a simulation study we show the attractive performance of our estimators.",
    "link": "http://arxiv.org/abs/2212.11012",
    "context": "Title: Partly Linear Instrumental Variables Regressions without Smoothing on the Instruments. (arXiv:2212.11012v2 [econ.EM] UPDATED)\nAbstract: We consider a semiparametric partly linear model identified by instrumental variables. We propose an estimation method that does not smooth on the instruments and we extend the Landweber-Fridman regularization scheme to the estimation of this semiparametric model. We then show the asymptotic normality of the parametric estimator and obtain the convergence rate for the nonparametric estimator. Our estimator that does not smooth on the instruments coincides with a typical estimator that does smooth on the instruments but keeps the respective bandwidth fixed as the sample size increases. We propose a data driven method for the selection of the regularization parameter, and in a simulation study we show the attractive performance of our estimators.",
    "path": "papers/22/12/2212.11012.json",
    "total_tokens": 795,
    "translated_title": "在仪器变量上部分线性回归的无平滑方法",
    "translated_abstract": "我们考虑了一个由仪器变量确定的半参数部分线性模型。我们提出了一种估计方法，该方法不平滑仪器变量，并将Landweber-Fridman正则化方案推广到该半参数模型的估计中。然后，我们证明了参数估计的渐近正态性，并获得了非参数估计的收敛速率。我们的不平滑仪器变量的估计与典型的平滑仪器变量的估计一致，但在样本大小增加时保持相应的带宽不变。我们提出了一种数据驱动的方法来选择正则化参数，并在模拟研究中展示了我们估计器的优秀性能。",
    "tldr": "该论文介绍了一种在仪器变量上部分线性回归的无平滑方法，通过将Landweber-Fridman正则化方案应用于该半参数模型的估计，实现了参数估计的渐近正态性以及非参数估计的收敛速率。",
    "en_tdlr": "This paper presents a non-smoothing method for partly linear regression on instrumental variables, extending the Landweber-Fridman regularization scheme. The paper demonstrates the asymptotic normality of parametric estimator and the convergence rate for the nonparametric estimator. A data-driven method for regularization parameter selection is proposed and the simulation study shows the attractive performance of the estimators."
}