{
    "title": "Physics-Informed Neural Networks for Material Model Calibration from Full-Field Displacement Data. (arXiv:2212.07723v2 [cs.LG] UPDATED)",
    "abstract": "The identification of material parameters occurring in constitutive models has a wide range of applications in practice. One of these applications is the monitoring and assessment of the actual condition of infrastructure buildings, as the material parameters directly reflect the resistance of the structures to external impacts. Physics-informed neural networks (PINNs) have recently emerged as a suitable method for solving inverse problems. The advantages of this method are a straightforward inclusion of observation data. Unlike grid-based methods, such as the least square finite element method (LS-FEM) approach, no computational grid and no interpolation of the data is required. In the current work, we propose PINNs for the calibration of constitutive models from full-field displacement and global force data in a realistic regime on the example of linear elasticity. We show that conditioning and reformulation of the optimization problem play a crucial role in real-world applications. ",
    "link": "http://arxiv.org/abs/2212.07723",
    "context": "Title: Physics-Informed Neural Networks for Material Model Calibration from Full-Field Displacement Data. (arXiv:2212.07723v2 [cs.LG] UPDATED)\nAbstract: The identification of material parameters occurring in constitutive models has a wide range of applications in practice. One of these applications is the monitoring and assessment of the actual condition of infrastructure buildings, as the material parameters directly reflect the resistance of the structures to external impacts. Physics-informed neural networks (PINNs) have recently emerged as a suitable method for solving inverse problems. The advantages of this method are a straightforward inclusion of observation data. Unlike grid-based methods, such as the least square finite element method (LS-FEM) approach, no computational grid and no interpolation of the data is required. In the current work, we propose PINNs for the calibration of constitutive models from full-field displacement and global force data in a realistic regime on the example of linear elasticity. We show that conditioning and reformulation of the optimization problem play a crucial role in real-world applications. ",
    "path": "papers/22/12/2212.07723.json",
    "total_tokens": 812,
    "translated_title": "利用物理知识的神经网络从全场位移数据中对材料模型进行校准",
    "translated_abstract": "材料参数的鉴定在实际应用中有着广泛的应用。其中之一是监测和评估基础设施建筑物的实际状况，因为材料参数直接反映结构物对外部影响的抵抗力。最近出现的基于物理知识的神经网络（PINN）是解决反问题的合适方法。这种方法的优点是简单地包含观测数据。与基于网格的方法（如最小二乘有限元法（LS-FEM）方法）不同，不需要计算网格和数据的插值。在当前工作中，我们提出了一种适用于线性弹性力学模型的全场位移和全局力数据校准的PINNs。我们展示了优化问题的条件和重构在实际应用中起着关键作用。",
    "tldr": "本文利用物理知识的神经网络从全场位移数据中对材料模型进行校准，并展示在实际应用中优化问题的条件和重构起到了关键作用。",
    "en_tdlr": "This paper proposes physics-informed neural networks for calibrating material models from full-field displacement data, highlighting the crucial role of conditioning and reformulation in real-world applications."
}