{
    "title": "Task-Oriented Communications for NextG: End-to-End Deep Learning and AI Security Aspects. (arXiv:2212.09668v2 [cs.NI] UPDATED)",
    "abstract": "Communications systems to date are primarily designed with the goal of reliable transfer of digital sequences (bits). Next generation (NextG) communication systems are beginning to explore shifting this design paradigm to reliably executing a given task such as in task-oriented communications. In this paper, wireless signal classification is considered as the task for the NextG Radio Access Network (RAN), where edge devices collect wireless signals for spectrum awareness and communicate with the NextG base station (gNodeB) that needs to identify the signal label. Edge devices may not have sufficient processing power and may not be trusted to perform the signal classification task, whereas the transfer of signals to the gNodeB may not be feasible due to stringent delay, rate, and energy restrictions. Task-oriented communications is considered by jointly training the transmitter, receiver and classifier functionalities as an encoder-decoder pair for the edge device and the gNodeB. This a",
    "link": "http://arxiv.org/abs/2212.09668",
    "context": "Title: Task-Oriented Communications for NextG: End-to-End Deep Learning and AI Security Aspects. (arXiv:2212.09668v2 [cs.NI] UPDATED)\nAbstract: Communications systems to date are primarily designed with the goal of reliable transfer of digital sequences (bits). Next generation (NextG) communication systems are beginning to explore shifting this design paradigm to reliably executing a given task such as in task-oriented communications. In this paper, wireless signal classification is considered as the task for the NextG Radio Access Network (RAN), where edge devices collect wireless signals for spectrum awareness and communicate with the NextG base station (gNodeB) that needs to identify the signal label. Edge devices may not have sufficient processing power and may not be trusted to perform the signal classification task, whereas the transfer of signals to the gNodeB may not be feasible due to stringent delay, rate, and energy restrictions. Task-oriented communications is considered by jointly training the transmitter, receiver and classifier functionalities as an encoder-decoder pair for the edge device and the gNodeB. This a",
    "path": "papers/22/12/2212.09668.json",
    "total_tokens": 848,
    "translated_title": "面向任务的通信系统：基于端到端深度学习和AI安全的NextG研究",
    "translated_abstract": "传统通信系统主要设计用于可靠地传输数字数据流（比特流），而新一代通信系统（NextG）开始探索把设计范式转向可靠地执行特定任务，例如任务导向的通信。本文探讨了无线信号分类作为NextG无线接入网络（RAN）的任务，在该任务中，边缘设备收集无线信号以获取频谱感知，然后与需要识别信号标签的NextG基站（gNodeB）进行通信。然而边缘设备可能无法足够处理信号分类任务，并且由于严格的延迟、速率和能量限制，将信号传输到gNodeB可能不可行。为此，本研究考虑了通过联合训练发射机、接收机和分类器的功能作为编码器-解码器对，为边缘设备和gNodeB实现任务导向通信。",
    "tldr": "本文探讨了在NextG无线接入网络中，通过端到端深度学习和AI安全保证信号分类任务，并在保证信号传输效率的情况下进行任务导向通信的方法。",
    "en_tdlr": "This paper discusses a method of ensuring signal classification task through end-to-end deep learning and AI security in the NextG wireless access network, and accomplishing task-oriented communications while ensuring efficient signal transmission."
}