{
    "title": "Answering Complex Logical Queries on Knowledge Graphs via Query Computation Tree Optimization. (arXiv:2212.09567v3 [cs.LG] UPDATED)",
    "abstract": "Answering complex logical queries on incomplete knowledge graphs is a challenging task, and has been widely studied. Embedding-based methods require training on complex queries, and cannot generalize well to out-of-distribution query structures. Recent work frames this task as an end-to-end optimization problem, and it only requires a pretrained link predictor. However, due to the exponentially large combinatorial search space, the optimal solution can only be approximated, limiting the final accuracy. In this work, we propose QTO (Query Computation Tree Optimization) that can efficiently find the exact optimal solution. QTO finds the optimal solution by a forward-backward propagation on the tree-like computation graph, i.e., query computation tree. In particular, QTO utilizes the independence encoded in the query computation tree to reduce the search space, where only local computations are involved during the optimization procedure. Experiments on 3 datasets show that QTO obtains sta",
    "link": "http://arxiv.org/abs/2212.09567",
    "context": "Title: Answering Complex Logical Queries on Knowledge Graphs via Query Computation Tree Optimization. (arXiv:2212.09567v3 [cs.LG] UPDATED)\nAbstract: Answering complex logical queries on incomplete knowledge graphs is a challenging task, and has been widely studied. Embedding-based methods require training on complex queries, and cannot generalize well to out-of-distribution query structures. Recent work frames this task as an end-to-end optimization problem, and it only requires a pretrained link predictor. However, due to the exponentially large combinatorial search space, the optimal solution can only be approximated, limiting the final accuracy. In this work, we propose QTO (Query Computation Tree Optimization) that can efficiently find the exact optimal solution. QTO finds the optimal solution by a forward-backward propagation on the tree-like computation graph, i.e., query computation tree. In particular, QTO utilizes the independence encoded in the query computation tree to reduce the search space, where only local computations are involved during the optimization procedure. Experiments on 3 datasets show that QTO obtains sta",
    "path": "papers/22/12/2212.09567.json",
    "total_tokens": 905,
    "translated_title": "通过查询计算树优化在知识图谱上回答复杂逻辑查询",
    "translated_abstract": "在不完整的知识图谱上回答复杂逻辑查询是一项具有挑战性的任务，并已得到广泛研究。嵌入式方法需要训练复杂查询，并且不能很好地泛化到分布查询结构之外。最近的工作将此任务作为端到端优化问题进行了框架化，只需要预训练的链接预测器。然而，由于指数级的组合搜索空间，最优解只能被近似，限制了最终的准确性。在本文中，我们提出了 QTO（查询计算树优化），可以有效地找到精确的最优解。QTO通过在树状计算图（即查询计算树）上进行正反向传播来找到最优解。特别地，QTO利用了查询计算树中编码的独立性来减少搜索空间，在优化过程中仅涉及局部计算。在三个数据集上的实验表明，QTO获得了令人满意的结果。",
    "tldr": "提出了 QTO（查询计算树优化）以有效地回答复杂逻辑查询，通过查询计算树上的正反向传播找到了精确的最优解，并利用了查询计算树中的独立性来减少搜索空间。",
    "en_tdlr": "QTO is proposed to effectively answer complex logical queries on incomplete knowledge graphs, finding the exact optimal solution by forward-backward propagation on the query computation tree and reducing search space by utilizing the independence encoded in the tree. Experiments show satisfactory results on 3 datasets."
}