{
    "title": "A Unified Algorithm Framework for Unsupervised Discovery of Skills based on Determinantal Point Process. (arXiv:2212.00211v2 [cs.LG] UPDATED)",
    "abstract": "Learning rich skills through temporal abstractions without supervision of external rewards is at the frontier of Reinforcement Learning research. Existing works mainly fall into two distinctive categories: variational and Laplacian-based skill (a.k.a., option) discovery. The former maximizes the diversity of the discovered options through a mutual information loss but overlooks coverage of the state space, while the latter focuses on improving the coverage of options by increasing connectivity during exploration, but does not consider diversity. In this paper, we propose a unified framework that quantifies diversity and coverage through a novel use of the Determinantal Point Process (DPP) and enables unsupervised option discovery explicitly optimizing both objectives. Specifically, we define the DPP kernel matrix with the Laplacian spectrum of the state transition graph and use the expected mode number in the trajectories as the objective to capture and enhance both diversity and cover",
    "link": "http://arxiv.org/abs/2212.00211",
    "context": "Title: A Unified Algorithm Framework for Unsupervised Discovery of Skills based on Determinantal Point Process. (arXiv:2212.00211v2 [cs.LG] UPDATED)\nAbstract: Learning rich skills through temporal abstractions without supervision of external rewards is at the frontier of Reinforcement Learning research. Existing works mainly fall into two distinctive categories: variational and Laplacian-based skill (a.k.a., option) discovery. The former maximizes the diversity of the discovered options through a mutual information loss but overlooks coverage of the state space, while the latter focuses on improving the coverage of options by increasing connectivity during exploration, but does not consider diversity. In this paper, we propose a unified framework that quantifies diversity and coverage through a novel use of the Determinantal Point Process (DPP) and enables unsupervised option discovery explicitly optimizing both objectives. Specifically, we define the DPP kernel matrix with the Laplacian spectrum of the state transition graph and use the expected mode number in the trajectories as the objective to capture and enhance both diversity and cover",
    "path": "papers/22/12/2212.00211.json",
    "total_tokens": 848,
    "translated_title": "基于确定性点过程的无监督技能发现的统一算法框架",
    "translated_abstract": "在强化学习研究中，通过时间抽象学习丰富的技能而无需外部奖励监督是一个前沿问题。现有的工作主要分为两个不同的类别：变分和拉普拉斯基于技能（又称为选项）发现。前者通过互信息损失最大化发现的选项的多样性，但忽视了状态空间的覆盖率，而后者侧重于通过增加探索过程中的连接性来提高选项的覆盖率，但不考虑多样性。本文提出了一个统一的框架，通过对确定性点过程（DPP）的新型使用来量化多样性和覆盖性，并显式优化无监督选项发现的两个目标。具体而言，我们使用状态转换图的拉普拉斯谱定义DPP核矩阵，并使用轨迹中的期望模数作为目标，来捕捉和增强多样性和覆盖率。",
    "tldr": "本文提出了一个使用确定性点过程（DPP）的统一算法框架，实现了对无监督技能发现的多样性和覆盖性的显式优化。"
}