{
    "title": "Deep Learning Methods for Partial Differential Equations and Related Parameter Identification Problems. (arXiv:2212.03130v2 [cs.LG] UPDATED)",
    "abstract": "Recent years have witnessed a growth in mathematics for deep learning--which seeks a deeper understanding of the concepts of deep learning with mathematics and explores how to make it more robust--and deep learning for mathematics, where deep learning algorithms are used to solve problems in mathematics. The latter has popularised the field of scientific machine learning where deep learning is applied to problems in scientific computing. Specifically, more and more neural network architectures have been developed to solve specific classes of partial differential equations (PDEs). Such methods exploit properties that are inherent to PDEs and thus solve the PDEs better than standard feed-forward neural networks, recurrent neural networks, or convolutional neural networks. This has had a great impact in the area of mathematical modeling where parametric PDEs are widely used to model most natural and physical processes arising in science and engineering. In this work, we review such method",
    "link": "http://arxiv.org/abs/2212.03130",
    "context": "Title: Deep Learning Methods for Partial Differential Equations and Related Parameter Identification Problems. (arXiv:2212.03130v2 [cs.LG] UPDATED)\nAbstract: Recent years have witnessed a growth in mathematics for deep learning--which seeks a deeper understanding of the concepts of deep learning with mathematics and explores how to make it more robust--and deep learning for mathematics, where deep learning algorithms are used to solve problems in mathematics. The latter has popularised the field of scientific machine learning where deep learning is applied to problems in scientific computing. Specifically, more and more neural network architectures have been developed to solve specific classes of partial differential equations (PDEs). Such methods exploit properties that are inherent to PDEs and thus solve the PDEs better than standard feed-forward neural networks, recurrent neural networks, or convolutional neural networks. This has had a great impact in the area of mathematical modeling where parametric PDEs are widely used to model most natural and physical processes arising in science and engineering. In this work, we review such method",
    "path": "papers/22/12/2212.03130.json",
    "total_tokens": 891,
    "translated_title": "偏微分方程和相关参数识别问题的深度学习方法",
    "translated_abstract": "近年来，深度学习方法在数学领域得到了越来越广泛的应用，既更深入地理解了深度学习的概念并探索如何使其更加稳健，又将深度学习算法用于解决数学问题，这种方法被称为科学机器学习。具体而言，越来越多的神经网络结构被发展出来来解决特定类别的偏微分方程。这些方法利用了偏微分方程固有的性质，因此比标准前馈神经网络、递归神经网络或卷积神经网络更好地解决了偏微分方程，这在数学建模领域产生了很大的影响。在本研究中，我们回顾了这些方法，并提出了一个统一的框架来理解它们。我们还讨论了几个与偏微分方程相关的参数识别问题，深度学习已经成功地应用于这些问题。",
    "tldr": "本论文回顾了深度学习在解决偏微分方程和相关参数识别问题中的应用，提出了一个统一的框架来理解这些方法和技术。",
    "en_tdlr": "This paper reviews the applications of deep learning in solving partial differential equations and related parameter identification problems, providing a unified framework to understand these methods and technologies."
}