{
    "title": "Summary-Oriented Vision Modeling for Multimodal Abstractive Summarization. (arXiv:2212.07672v2 [cs.CV] UPDATED)",
    "abstract": "Multimodal abstractive summarization (MAS) aims to produce a concise summary given the multimodal data (text and vision). Existing studies mainly focus on how to effectively use the visual features from the perspective of an article, having achieved impressive success on the high-resource English dataset. However, less attention has been paid to the visual features from the perspective of the summary, which may limit the model performance, especially in the low- and zero-resource scenarios. In this paper, we propose to improve the summary quality through summary-oriented visual features. To this end, we devise two auxiliary tasks including vision to summary task and masked image modeling task. Together with the main summarization task, we optimize the MAS model via the training objectives of all these tasks. By these means, the MAS model can be enhanced by capturing the summary-oriented visual features, thereby yielding more accurate summaries. Experiments on 44 languages, covering mid",
    "link": "http://arxiv.org/abs/2212.07672",
    "context": "Title: Summary-Oriented Vision Modeling for Multimodal Abstractive Summarization. (arXiv:2212.07672v2 [cs.CV] UPDATED)\nAbstract: Multimodal abstractive summarization (MAS) aims to produce a concise summary given the multimodal data (text and vision). Existing studies mainly focus on how to effectively use the visual features from the perspective of an article, having achieved impressive success on the high-resource English dataset. However, less attention has been paid to the visual features from the perspective of the summary, which may limit the model performance, especially in the low- and zero-resource scenarios. In this paper, we propose to improve the summary quality through summary-oriented visual features. To this end, we devise two auxiliary tasks including vision to summary task and masked image modeling task. Together with the main summarization task, we optimize the MAS model via the training objectives of all these tasks. By these means, the MAS model can be enhanced by capturing the summary-oriented visual features, thereby yielding more accurate summaries. Experiments on 44 languages, covering mid",
    "path": "papers/22/12/2212.07672.json",
    "total_tokens": 876,
    "translated_title": "以总结为导向的多模态视觉建模用于抽象总结",
    "translated_abstract": "多模态抽象总结(MAS)旨在给定多模态数据(文本和图像)产生简洁摘要。现有研究主要集中在如何有效使用文章视觉特征的角度，已经在高资源的英文数据集上取得了令人印象深刻的成功。但是，对从摘要视觉特征的角度来看的少关注，这可能会限制模型的性能，特别是在低和零资源场景下。在本文中，我们提出通过总结导向的视觉特征来提高总结质量。为此，我们设计了两个辅助任务，包括视觉到总结任务和掩码图像建模任务。与主要摘要任务一起，通过所有这些任务的训练目标对MAS模型进行优化。通过这种方式，MAS模型可以通过捕获总结导向的视觉特征来得到更准确的总结。 在44种语言上进行了实验，包括中...",
    "tldr": "本论文提出了一种以总结为导向的多模态视觉建模方法，通过设计辅助任务，有效提高了抽象总结的质量，实验结果表明该方法在多种语言 上都取得了较好的效果。",
    "en_tdlr": "This paper proposes a summary-oriented multimodal vision modeling method, which effectively improves the quality of abstractive summarization through the design of auxiliary tasks. Experimental results show that this method achieves good performance in multiple languages."
}