{
    "title": "Hybrid Multi-agent Deep Reinforcement Learning for Autonomous Mobility on Demand Systems. (arXiv:2212.07313v2 [cs.LG] UPDATED)",
    "abstract": "We consider the sequential decision-making problem of making proactive request assignment and rejection decisions for a profit-maximizing operator of an autonomous mobility on demand system. We formalize this problem as a Markov decision process and propose a novel combination of multi-agent Soft Actor-Critic and weighted bipartite matching to obtain an anticipative control policy. Thereby, we factorize the operator's otherwise intractable action space, but still obtain a globally coordinated decision. Experiments based on real-world taxi data show that our method outperforms state of the art benchmarks with respect to performance, stability, and computational tractability.",
    "link": "http://arxiv.org/abs/2212.07313",
    "context": "Title: Hybrid Multi-agent Deep Reinforcement Learning for Autonomous Mobility on Demand Systems. (arXiv:2212.07313v2 [cs.LG] UPDATED)\nAbstract: We consider the sequential decision-making problem of making proactive request assignment and rejection decisions for a profit-maximizing operator of an autonomous mobility on demand system. We formalize this problem as a Markov decision process and propose a novel combination of multi-agent Soft Actor-Critic and weighted bipartite matching to obtain an anticipative control policy. Thereby, we factorize the operator's otherwise intractable action space, but still obtain a globally coordinated decision. Experiments based on real-world taxi data show that our method outperforms state of the art benchmarks with respect to performance, stability, and computational tractability.",
    "path": "papers/22/12/2212.07313.json",
    "total_tokens": 787,
    "translated_title": "基于深度强化学习的混合多智能体自主出行系统",
    "translated_abstract": "本文考虑了面向自主移动出行系统中的利润最大化运营商的主动请求分配和拒绝决策的顺序决策问题。我们将这个问题形式化为马尔可夫决策过程，并提出了多智能体Soft Actor-Critic和加权二分图匹配的新颖组合，以获得一种预期的控制策略。因此，我们将运营商的行动空间分解开来，但仍然获得了全局协调的决策。基于真实出租车数据的实验表明，我们的方法在性能、稳定性和计算方面优于现有的基准。",
    "tldr": "本文介绍了一种基于深度强化学习的混合多智能体自主出行系统，采用多智能体Soft Actor-Critic和加权二分图匹配，能够解决自主移动出行系统中的主动请求分配和拒绝决策问题，并在性能、稳定性和计算方面优于现有基准。",
    "en_tdlr": "This paper introduces a hybrid multi-agent autonomous mobility on demand system based on deep reinforcement learning, which uses multi-agent Soft Actor-Critic and weighted bipartite matching to address the proactive request assignment and rejection decisions, and outperforms state of the art benchmarks in terms of performance, stability, and computational tractability."
}