{
    "title": "Expressive architectures enhance interpretability of dynamics-based neural population models. (arXiv:2212.03771v3 [q-bio.NC] UPDATED)",
    "abstract": "Artificial neural networks that can recover latent dynamics from recorded neural activity may provide a powerful avenue for identifying and interpreting the dynamical motifs underlying biological computation. Given that neural variance alone does not uniquely determine a latent dynamical system, interpretable architectures should prioritize accurate and low-dimensional latent dynamics. In this work, we evaluated the performance of sequential autoencoders (SAEs) in recovering latent chaotic attractors from simulated neural datasets. We found that SAEs with widely-used recurrent neural network (RNN)-based dynamics were unable to infer accurate firing rates at the true latent state dimensionality, and that larger RNNs relied upon dynamical features not present in the data. On the other hand, SAEs with neural ordinary differential equation (NODE)-based dynamics inferred accurate rates at the true latent state dimensionality, while also recovering latent trajectories and fixed point structu",
    "link": "http://arxiv.org/abs/2212.03771",
    "context": "Title: Expressive architectures enhance interpretability of dynamics-based neural population models. (arXiv:2212.03771v3 [q-bio.NC] UPDATED)\nAbstract: Artificial neural networks that can recover latent dynamics from recorded neural activity may provide a powerful avenue for identifying and interpreting the dynamical motifs underlying biological computation. Given that neural variance alone does not uniquely determine a latent dynamical system, interpretable architectures should prioritize accurate and low-dimensional latent dynamics. In this work, we evaluated the performance of sequential autoencoders (SAEs) in recovering latent chaotic attractors from simulated neural datasets. We found that SAEs with widely-used recurrent neural network (RNN)-based dynamics were unable to infer accurate firing rates at the true latent state dimensionality, and that larger RNNs relied upon dynamical features not present in the data. On the other hand, SAEs with neural ordinary differential equation (NODE)-based dynamics inferred accurate rates at the true latent state dimensionality, while also recovering latent trajectories and fixed point structu",
    "path": "papers/22/12/2212.03771.json",
    "total_tokens": 957,
    "translated_title": "表现力架构增强基于动力学的神经人群模型的可解释性",
    "translated_abstract": "能够从记录的神经活动中恢复潜在动力学的人工神经网络可能为识别和解释生物计算中潜在的动力学模式提供了一种强大的方法。鉴于仅凭神经方差无法唯一确定潜在的动力学系统，具有解释性的架构应该优先考虑准确和低维的潜在动力学。在这项工作中，我们评估了顺序自动编码器（SAEs）在从模拟的神经数据集中恢复潜在的混沌吸引子方面的表现。我们发现，采用广泛使用的循环神经网络（RNN）为动力学基础的SAEs无法在真实的潜在状态维度上推断出准确的发射率，并且更大的RNNs依赖于数据中不存在的动态特征。另一方面，采用神经常微分方程（NODE）为基础的SAEs在真实的潜在状态维度上推断出准确的率，同时还恢复了潜在轨迹和固定点结构。",
    "tldr": "研究通过顺序自动编码器从神经数据集中恢复潜在的混沌吸引子，发现采用神经常微分方程为基础的 SAES 在准确率和维度方面优于采用循环神经网络的 SAES。",
    "en_tdlr": "This study evaluated the use of sequential autoencoders (SAEs) for recovering latent chaotic attractors from simulated neural datasets and found that SAEs with neural ordinary differential equation (NODE)-based dynamics outperformed those with widely-used recurrent neural network (RNN)-based dynamics both in accuracy and dimensionality."
}