{
    "title": "Leveraging Natural Language Processing to Augment Structured Social Determinants of Health Data in the Electronic Health Record. (arXiv:2212.07538v2 [cs.CL] UPDATED)",
    "abstract": "Objective: Social determinants of health (SDOH) impact health outcomes and are documented in the electronic health record (EHR) through structured data and unstructured clinical notes. However, clinical notes often contain more comprehensive SDOH information, detailing aspects such as status, severity, and temporality. This work has two primary objectives: i) develop a natural language processing (NLP) information extraction model to capture detailed SDOH information and ii) evaluate the information gain achieved by applying the SDOH extractor to clinical narratives and combining the extracted representations with existing structured data.  Materials and Methods: We developed a novel SDOH extractor using a deep learning entity and relation extraction architecture to characterize SDOH across various dimensions. In an EHR case study, we applied the SDOH extractor to a large clinical data set with 225,089 patients and 430,406 notes with social history sections and compared the extracted S",
    "link": "http://arxiv.org/abs/2212.07538",
    "context": "Title: Leveraging Natural Language Processing to Augment Structured Social Determinants of Health Data in the Electronic Health Record. (arXiv:2212.07538v2 [cs.CL] UPDATED)\nAbstract: Objective: Social determinants of health (SDOH) impact health outcomes and are documented in the electronic health record (EHR) through structured data and unstructured clinical notes. However, clinical notes often contain more comprehensive SDOH information, detailing aspects such as status, severity, and temporality. This work has two primary objectives: i) develop a natural language processing (NLP) information extraction model to capture detailed SDOH information and ii) evaluate the information gain achieved by applying the SDOH extractor to clinical narratives and combining the extracted representations with existing structured data.  Materials and Methods: We developed a novel SDOH extractor using a deep learning entity and relation extraction architecture to characterize SDOH across various dimensions. In an EHR case study, we applied the SDOH extractor to a large clinical data set with 225,089 patients and 430,406 notes with social history sections and compared the extracted S",
    "path": "papers/22/12/2212.07538.json",
    "total_tokens": 787,
    "translated_title": "利用自然语言处理增强电子病历中的结构化社会卫生因素数据",
    "translated_abstract": "目的：社会卫生因素（SDOH）影响健康结果，并通过结构化数据和非结构化临床记录在电子病历（EHR）中进行记录。然而，临床记录通常包含更全面的SDOH信息，详细说明方面，例如状态、严重程度和时间性。本文有两个主要目标：i）开发自然语言处理（NLP）信息提取模型，以捕获详细的SDOH信息；ii）通过将SDOH抽取器应用于临床叙述并将提取的表示与现有的结构化数据组合来评估所获得的信息增益。",
    "tldr": "本文开发了一个SDOH信息提取器，通过将其应用于EHR中的临床叙述，捕获详细的SDOH信息，并将提取的表示与现有的结构化数据进行组合以获得信息增益。",
    "en_tdlr": "This paper develops an SDOH extractor that captures detailed SDOH information by applying it to clinical narratives in EHR, and evaluates the information gain achieved by combining the extracted representation with existing structured data."
}