{
    "title": "Graph Convolutional Neural Networks with Diverse Negative Samples via Decomposed Determinant Point Processes. (arXiv:2212.02055v2 [cs.LG] UPDATED)",
    "abstract": "Graph convolutional networks (GCNs) have achieved great success in graph representation learning by extracting high-level features from nodes and their topology. Since GCNs generally follow a message-passing mechanism, each node aggregates information from its first-order neighbour to update its representation. As a result, the representations of nodes with edges between them should be positively correlated and thus can be considered positive samples. However, there are more non-neighbour nodes in the whole graph, which provide diverse and useful information for the representation update. Two non-adjacent nodes usually have different representations, which can be seen as negative samples. Besides the node representations, the structural information of the graph is also crucial for learning. In this paper, we used quality-diversity decomposition in determinant point processes (DPP) to obtain diverse negative samples. When defining a distribution on diverse subsets of all non-neighbourin",
    "link": "http://arxiv.org/abs/2212.02055",
    "context": "Title: Graph Convolutional Neural Networks with Diverse Negative Samples via Decomposed Determinant Point Processes. (arXiv:2212.02055v2 [cs.LG] UPDATED)\nAbstract: Graph convolutional networks (GCNs) have achieved great success in graph representation learning by extracting high-level features from nodes and their topology. Since GCNs generally follow a message-passing mechanism, each node aggregates information from its first-order neighbour to update its representation. As a result, the representations of nodes with edges between them should be positively correlated and thus can be considered positive samples. However, there are more non-neighbour nodes in the whole graph, which provide diverse and useful information for the representation update. Two non-adjacent nodes usually have different representations, which can be seen as negative samples. Besides the node representations, the structural information of the graph is also crucial for learning. In this paper, we used quality-diversity decomposition in determinant point processes (DPP) to obtain diverse negative samples. When defining a distribution on diverse subsets of all non-neighbourin",
    "path": "papers/22/12/2212.02055.json",
    "total_tokens": 740,
    "translated_title": "通过分解行列式点过程使用多样的负样本来进行图卷积神经网络",
    "translated_abstract": "图卷积网络（GCNs）通过从节点和它们的拓扑中提取高级特征来实现图表示学习。本文采用了一种基于行列式点过程（DPP）的质量-多样性分解方法来获取多样的负样本，除边缘节点之外的所有节点都被考虑在内，这些节点通过提供不同的信息有利于表示更新。",
    "tldr": "本论文提出了基于DPP的方法来获取多样的负样本，在图卷积神经网络中实现图表示学习，通过提供不同的信息来更新节点的表示，从而提高了准确性。",
    "en_tdlr": "This paper proposes a DPP-based method to obtain diverse negative samples for graph convolutional neural networks, which improves the accuracy of graph representation learning by updating node representations with different information provided by non-neighbour nodes."
}