{
    "title": "Caching Contents with Varying Popularity using Restless Bandits. (arXiv:2212.03291v3 [cs.NI] UPDATED)",
    "abstract": "Mobile networks are experiencing prodigious increase in data volume and user density , which exerts a great burden on mobile core networks and backhaul links. An efficient technique to lessen this problem is to use caching i.e. to bring the data closer to the users by making use of the caches of edge network nodes, such as fixed or mobile access points and even user devices. The performance of a caching depends on contents that are cached. In this paper, we examine the problem of content caching at the wireless edge(i.e. base stations) to minimize the discounted cost incurred over infinite horizon. We formulate this problem as a restless bandit problem, which is hard to solve. We begin by showing an optimal policy is of threshold type. Using these structural results, we prove the indexability of the problem, and use Whittle index policy to minimize the discounted cost.",
    "link": "http://arxiv.org/abs/2212.03291",
    "context": "Title: Caching Contents with Varying Popularity using Restless Bandits. (arXiv:2212.03291v3 [cs.NI] UPDATED)\nAbstract: Mobile networks are experiencing prodigious increase in data volume and user density , which exerts a great burden on mobile core networks and backhaul links. An efficient technique to lessen this problem is to use caching i.e. to bring the data closer to the users by making use of the caches of edge network nodes, such as fixed or mobile access points and even user devices. The performance of a caching depends on contents that are cached. In this paper, we examine the problem of content caching at the wireless edge(i.e. base stations) to minimize the discounted cost incurred over infinite horizon. We formulate this problem as a restless bandit problem, which is hard to solve. We begin by showing an optimal policy is of threshold type. Using these structural results, we prove the indexability of the problem, and use Whittle index policy to minimize the discounted cost.",
    "path": "papers/22/12/2212.03291.json",
    "total_tokens": 810,
    "translated_title": "无休止赌博算法在缓存不断变化的流行度内容中的应用",
    "translated_abstract": "移动网络对数据量和用户密度的需求不断增长，这给移动核心网络和回程链路带来了巨大的负担。一种有效的技术是使用缓存，即利用边缘网络节点的缓存（如固定或移动接入点甚至用户设备）将数据靠近用户。缓存的性能取决于缓存内容。本文研究在无线边缘（即基站）处缓存内容的问题，以最小化无限视野下产生的贴现成本。我们将这个问题形式化为一个无休止的赌博问题，该问题很难求解。我们首先展示了优化策略是阈值型的。利用这些结构性结果，我们证明了问题的可指标性，并使用Whittle指数策略以最小化贴现成本。",
    "tldr": "本文研究了如何在无线边缘处缓存内容以减轻移动网络对核心网络和回程链路带来的负担。通过无休止赌博算法将问题最小化。",
    "en_tdlr": "This paper investigates how to cache contents at the wireless edge to alleviate the burden on mobile networks and proposes the use of restless bandits algorithm to minimize the cost."
}