{
    "title": "Yggdrasil Decision Forests: A Fast and Extensible Decision Forests Library. (arXiv:2212.02934v2 [cs.LG] UPDATED)",
    "abstract": "Yggdrasil Decision Forests is a library for the training, serving and interpretation of decision forest models, targeted both at research and production work, implemented in C++, and available in C++, command line interface, Python (under the name TensorFlow Decision Forests), JavaScript, Go, and Google Sheets (under the name Simple ML for Sheets). The library has been developed organically since 2018 following a set of four design principles applicable to machine learning libraries and frameworks: simplicity of use, safety of use, modularity and high-level abstraction, and integration with other machine learning libraries. In this paper, we describe those principles in detail and present how they have been used to guide the design of the library. We then showcase the use of our library on a set of classical machine learning problems. Finally, we report a benchmark comparing our library to related solutions.",
    "link": "http://arxiv.org/abs/2212.02934",
    "context": "Title: Yggdrasil Decision Forests: A Fast and Extensible Decision Forests Library. (arXiv:2212.02934v2 [cs.LG] UPDATED)\nAbstract: Yggdrasil Decision Forests is a library for the training, serving and interpretation of decision forest models, targeted both at research and production work, implemented in C++, and available in C++, command line interface, Python (under the name TensorFlow Decision Forests), JavaScript, Go, and Google Sheets (under the name Simple ML for Sheets). The library has been developed organically since 2018 following a set of four design principles applicable to machine learning libraries and frameworks: simplicity of use, safety of use, modularity and high-level abstraction, and integration with other machine learning libraries. In this paper, we describe those principles in detail and present how they have been used to guide the design of the library. We then showcase the use of our library on a set of classical machine learning problems. Finally, we report a benchmark comparing our library to related solutions.",
    "path": "papers/22/12/2212.02934.json",
    "total_tokens": 910,
    "translated_title": "Yggdrasil Decision Forests：一种快速且可扩展的决策森林库",
    "translated_abstract": "Yggdrasil Decision Forests是一个用于训练、服务和解释决策森林模型的库，旨在为研究和生产工作提供支持，使用C++实现，并提供C++命令行界面、Python（名称为TensorFlow Decision Forests）、JavaScript、Go和Google Sheets（名称为Simple ML for Sheets）等语言接口。该库自2018年以来按照四个机器学习库和框架的设计原则进行有机开发：易用性、安全性、模块化和高层抽象以及与其他机器学习库的集成。在本文中，我们详细描述了这些原则，并展示了它们如何指导库的设计。然后，我们在一组经典机器学习问题上展示了我们的库的使用。最后，我们报告了一个将我们的库与相关解决方案进行比较的基准测试结果。",
    "tldr": "Yggdrasil Decision Forests是一种快速且可扩展的决策森林库，旨在为研究和生产工作提供支持。该库的设计原则为易用性、安全性、模块化和高层抽象以及与其他机器学习库的集成，并在经典机器学习问题上展示了其使用，并在基准测试中取得了成功。",
    "en_tdlr": "Yggdrasil Decision Forests is a fast and extensible decision forests library aimed at supporting research and production work. The design principles of the library are usability, safety, modularity and high-level abstraction, and integration with other machine learning libraries. Its usage is showcased on classical machine learning problems, and it performs well in benchmark testing."
}