{
    "title": "Deep conv-attention model for diagnosing left bundle branch block from 12-lead electrocardiograms. (arXiv:2212.04936v2 [eess.SP] UPDATED)",
    "abstract": "Cardiac resynchronization therapy (CRT) is a treatment that is used to compensate for irregularities in the heartbeat. Studies have shown that this treatment is more effective in heart patients with left bundle branch block (LBBB) arrhythmia. Therefore, identifying this arrhythmia is an important initial step in determining whether or not to use CRT. On the other hand, traditional methods for detecting LBBB on electrocardiograms (ECG) are often associated with errors. Thus, there is a need for an accurate method to diagnose this arrhythmia from ECG data. Machine learning, as a new field of study, has helped to increase human systems' performance. Deep learning, as a newer subfield of machine learning, has more power to analyze data and increase systems accuracy. This study presents a deep learning model for the detection of LBBB arrhythmia from 12-lead ECG data. This model consists of 1D dilated convolutional layers. Attention mechanism has also been used to identify important input da",
    "link": "http://arxiv.org/abs/2212.04936",
    "context": "Title: Deep conv-attention model for diagnosing left bundle branch block from 12-lead electrocardiograms. (arXiv:2212.04936v2 [eess.SP] UPDATED)\nAbstract: Cardiac resynchronization therapy (CRT) is a treatment that is used to compensate for irregularities in the heartbeat. Studies have shown that this treatment is more effective in heart patients with left bundle branch block (LBBB) arrhythmia. Therefore, identifying this arrhythmia is an important initial step in determining whether or not to use CRT. On the other hand, traditional methods for detecting LBBB on electrocardiograms (ECG) are often associated with errors. Thus, there is a need for an accurate method to diagnose this arrhythmia from ECG data. Machine learning, as a new field of study, has helped to increase human systems' performance. Deep learning, as a newer subfield of machine learning, has more power to analyze data and increase systems accuracy. This study presents a deep learning model for the detection of LBBB arrhythmia from 12-lead ECG data. This model consists of 1D dilated convolutional layers. Attention mechanism has also been used to identify important input da",
    "path": "papers/22/12/2212.04936.json",
    "total_tokens": 993,
    "translated_title": "基于深度卷积-关注模型的12导联心电图左束支传导阻滞诊断",
    "translated_abstract": "心脏重新同步治疗（CRT）是一种用于补偿心跳不规则的治疗方法。研究表明，这种治疗在患有左束支传导阻滞（LBBB）心律不齐的心脏患者中更有效。因此，确定该心律不齐是确定是否使用CRT的重要初始步骤。然而，传统的心电图（ECG）检测LBBB的方法通常存在误差。因此，需要一种准确的方法从ECG数据中诊断这种心律不齐。本研究提出了一种深度学习模型，用于从12导联ECG数据检测LBBB心律不齐。该模型由1D稀疏卷积层构成，同时采用注意力机制来识别重要输入数据。该模型在PTB诊断ECG数据库上进行了训练和验证，实现了高达99.8%的准确率，优于其他最先进的模型。",
    "tldr": "本研究提出了一种使用深度学习模型的注意力机制，能够从12导联ECG数据中准确检测出LBBB心律不齐，准确率高达99.8%，优于其他最先进的模型。",
    "en_tdlr": "This study presents a deep learning model with attention mechanism for accurately detecting LBBB arrhythmia from 12-lead ECG data, achieving a high accuracy of 99.8% on the PTB Diagnostic ECG Database, outperforming other state-of-the-art models."
}