{
    "title": "Average Profits of Prejudiced Algorithms. (arXiv:2212.00578v2 [econ.TH] UPDATED)",
    "abstract": "We investigate the level of success a firm achieves depending on which of two common scoring algorithms is used to screen qualified applicants belonging to a disadvantaged group. Both algorithms are trained on data generated by a prejudiced decision-maker independently of the firm. One algorithm favors disadvantaged individuals, while the other algorithm exemplifies prejudice in the training data. We deliver sharp guarantees for when the firm finds more success with one algorithm over the other, depending on the prejudice level of the decision-maker.",
    "link": "http://arxiv.org/abs/2212.00578",
    "context": "Title: Average Profits of Prejudiced Algorithms. (arXiv:2212.00578v2 [econ.TH] UPDATED)\nAbstract: We investigate the level of success a firm achieves depending on which of two common scoring algorithms is used to screen qualified applicants belonging to a disadvantaged group. Both algorithms are trained on data generated by a prejudiced decision-maker independently of the firm. One algorithm favors disadvantaged individuals, while the other algorithm exemplifies prejudice in the training data. We deliver sharp guarantees for when the firm finds more success with one algorithm over the other, depending on the prejudice level of the decision-maker.",
    "path": "papers/22/12/2212.00578.json",
    "total_tokens": 674,
    "translated_title": "偏见算法的平均利润",
    "translated_abstract": "我们研究了一个公司在筛选属于弱势群体的合格申请者时使用两种常见评分算法的成功水平。这两种算法都是根据一个独立于公司的、由有偏见的决策者生成的数据进行训练的。一种算法偏向于弱势个体，而另一种算法在训练数据中展现了偏见。我们对公司在偏见程度不同的决策者下使用某一算法时，相对于另一算法能否获得更多成功给出了明确的保证。",
    "tldr": "我们研究了使用两种针对不同群体的评分算法时，对于一个公司来说哪一种算法能够获得更多成功。我们给出了在不同偏见程度下，公司选择哪个算法能够获得更好结果的明确保证。",
    "en_tdlr": "We investigate the level of success a firm achieves depending on which scoring algorithm is used for screening qualified applicants from disadvantaged groups. We provide sharp guarantees for when the firm finds more success with one algorithm over the other, depending on the level of prejudice."
}