{
    "title": "What to Read in a Contract? Party-Specific Summarization of Legal Obligations, Entitlements, and Prohibitions. (arXiv:2212.09825v2 [cs.CL] UPDATED)",
    "abstract": "Reviewing and comprehending key obligations, entitlements, and prohibitions in legal contracts can be a tedious task due to their length and domain-specificity. Furthermore, the key rights and duties requiring review vary for each contracting party. In this work, we propose a new task of party-specific extractive summarization for legal contracts to facilitate faster reviewing and improved comprehension of rights and duties. To facilitate this, we curate a dataset comprising of party-specific pairwise importance comparisons annotated by legal experts, covering ~293K sentence pairs that include obligations, entitlements, and prohibitions extracted from lease agreements. Using this dataset, we train a pairwise importance ranker and propose a pipeline-based extractive summarization system that generates a party-specific contract summary. We establish the need for incorporating domain-specific notion of importance during summarization by comparing our system against various baselines using",
    "link": "http://arxiv.org/abs/2212.09825",
    "context": "Title: What to Read in a Contract? Party-Specific Summarization of Legal Obligations, Entitlements, and Prohibitions. (arXiv:2212.09825v2 [cs.CL] UPDATED)\nAbstract: Reviewing and comprehending key obligations, entitlements, and prohibitions in legal contracts can be a tedious task due to their length and domain-specificity. Furthermore, the key rights and duties requiring review vary for each contracting party. In this work, we propose a new task of party-specific extractive summarization for legal contracts to facilitate faster reviewing and improved comprehension of rights and duties. To facilitate this, we curate a dataset comprising of party-specific pairwise importance comparisons annotated by legal experts, covering ~293K sentence pairs that include obligations, entitlements, and prohibitions extracted from lease agreements. Using this dataset, we train a pairwise importance ranker and propose a pipeline-based extractive summarization system that generates a party-specific contract summary. We establish the need for incorporating domain-specific notion of importance during summarization by comparing our system against various baselines using",
    "path": "papers/22/12/2212.09825.json",
    "total_tokens": 957,
    "translated_title": "《合同中要读些什么？对法律义务、权益和禁止的各方特定摘要》",
    "translated_abstract": "由于合同长度和领域特定性，审查和理解法律合同中的重要义务、权益和禁止可能是一项繁琐的任务。此外，需要审查的主要权利和义务在每个合约方之间也存在差异。在本文中，我们提出了一种新任务，即用于法律合同的各方特定摘要提取，以促进更快的审查和提高对权利和义务的理解。为了实现这一目标，我们策划了一个数据集，包括法律专家注释的各方特定重要性比较，涵盖了从租赁协议中提取的大约293K个句子对，包括义务、权益和禁止。利用这个数据集，我们训练了一个重要性排序模型，并提出了一个基于流水线的提取性摘要系统，生成了各方特定的合同摘要。通过与各种基准模型进行比较，我们证明了在摘要中引入领域特定重要性的必要性。",
    "tldr": "本论文提出了一种用于法律合同的各方特定摘要提取任务，旨在帮助更快地审查和理解重要的权利和义务。通过使用法律专家注释的数据集和基于流水线的摘要系统，我们证明了摘要中引入领域特定重要性的必要性。",
    "en_tdlr": "This paper introduces a task of party-specific extractive summarization for legal contracts, aiming to facilitate faster reviewing and improved comprehension of important rights and duties. Using a curated dataset and a pipeline-based summarization system, the paper demonstrates the necessity of incorporating domain-specific notion of importance in summarization."
}