{
    "title": "Zero-Shot Rumor Detection with Propagation Structure via Prompt Learning. (arXiv:2212.01117v3 [cs.CL] UPDATED)",
    "abstract": "The spread of rumors along with breaking events seriously hinders the truth in the era of social media. Previous studies reveal that due to the lack of annotated resources, rumors presented in minority languages are hard to be detected. Furthermore, the unforeseen breaking events not involved in yesterday's news exacerbate the scarcity of data resources. In this work, we propose a novel zero-shot framework based on prompt learning to detect rumors falling in different domains or presented in different languages. More specifically, we firstly represent rumor circulated on social media as diverse propagation threads, then design a hierarchical prompt encoding mechanism to learn language-agnostic contextual representations for both prompts and rumor data. To further enhance domain adaptation, we model the domain-invariant structural features from the propagation threads, to incorporate structural position representations of influential community response. In addition, a new virtual respon",
    "link": "http://arxiv.org/abs/2212.01117",
    "context": "Title: Zero-Shot Rumor Detection with Propagation Structure via Prompt Learning. (arXiv:2212.01117v3 [cs.CL] UPDATED)\nAbstract: The spread of rumors along with breaking events seriously hinders the truth in the era of social media. Previous studies reveal that due to the lack of annotated resources, rumors presented in minority languages are hard to be detected. Furthermore, the unforeseen breaking events not involved in yesterday's news exacerbate the scarcity of data resources. In this work, we propose a novel zero-shot framework based on prompt learning to detect rumors falling in different domains or presented in different languages. More specifically, we firstly represent rumor circulated on social media as diverse propagation threads, then design a hierarchical prompt encoding mechanism to learn language-agnostic contextual representations for both prompts and rumor data. To further enhance domain adaptation, we model the domain-invariant structural features from the propagation threads, to incorporate structural position representations of influential community response. In addition, a new virtual respon",
    "path": "papers/22/12/2212.01117.json",
    "total_tokens": 904,
    "translated_title": "基于Prompt学习与传播结构的零样本谣言检测",
    "translated_abstract": "在社交媒体时代，谣言随着事件的发生而传播，严重影响了真相的传播。之前的研究表明，由于缺乏标注资源，很难检测出使用少数语言的谣言。而且，昨天没有涉及到的非预料中断事件加剧了数据资源的稀缺性。本文提出了一种基于Prompt学习的新型零样本框架，用于检测不同领域或用不同语言展现的谣言。具体地说，我们首先将社交媒体上传播的谣言表示为多样的传播线程，然后设计了一个分层Prompt编码机制，学习了无语言环境下的上下文表示，以用于促进对不同领域和语言下的谣言数据转换。此外，我们从传播线程中建模领域不变的结构特征，以整合有影响力的社区反应的结构位置表示，以进一步增强领域适应性。同时，我们引入新的虚拟响应机制，以加强模型的推断能力。",
    "tldr": "本文提出了一种基于Prompt学习和传播结构的零样本谣言检测框架，其能够有效地检测不同领域和语言的谣言，并可适应非预料中断事件的影响。",
    "en_tdlr": "This paper proposes a novel zero-shot framework for rumor detection based on prompt learning and propagation structure. It can effectively detect rumors in different domains and languages and adapt to the impact of unforeseen breaking events."
}