{
    "title": "Harmonic (Quantum) Neural Networks. (arXiv:2212.07462v2 [cs.LG] UPDATED)",
    "abstract": "Harmonic functions are abundant in nature, appearing in limiting cases of Maxwell's, Navier-Stokes equations, the heat and the wave equation. Consequently, there are many applications of harmonic functions from industrial process optimisation to robotic path planning and the calculation of first exit times of random walks. Despite their ubiquity and relevance, there have been few attempts to incorporate inductive biases towards harmonic functions in machine learning contexts. In this work, we demonstrate effective means of representing harmonic functions in neural networks and extend such results also to quantum neural networks to demonstrate the generality of our approach. We benchmark our approaches against (quantum) physics-informed neural networks, where we show favourable performance.",
    "link": "http://arxiv.org/abs/2212.07462",
    "context": "Title: Harmonic (Quantum) Neural Networks. (arXiv:2212.07462v2 [cs.LG] UPDATED)\nAbstract: Harmonic functions are abundant in nature, appearing in limiting cases of Maxwell's, Navier-Stokes equations, the heat and the wave equation. Consequently, there are many applications of harmonic functions from industrial process optimisation to robotic path planning and the calculation of first exit times of random walks. Despite their ubiquity and relevance, there have been few attempts to incorporate inductive biases towards harmonic functions in machine learning contexts. In this work, we demonstrate effective means of representing harmonic functions in neural networks and extend such results also to quantum neural networks to demonstrate the generality of our approach. We benchmark our approaches against (quantum) physics-informed neural networks, where we show favourable performance.",
    "path": "papers/22/12/2212.07462.json",
    "total_tokens": 757,
    "translated_title": "谐波（量子）神经网络",
    "translated_abstract": "谐波函数在自然界中非常常见，在麦克斯韦方程、纳维-斯托克斯方程、热传导方程和波动方程的极限情况中都出现。因此，谐波函数有许多应用，从工业过程优化到机器人路径规划和随机行走的首次退出时间的计算。尽管谐波函数非常普遍和相关，但在机器学习环境中很少尝试将其归纳偏好引入其中。在这项工作中，我们展示了在神经网络中有效表示谐波函数的方法，并将这些结果扩展到量子神经网络中以展示我们方法的普适性。我们将我们的方法与（量子）物理信息神经网络进行了基准测试，结果显示我们的方法表现较好。",
    "tldr": "本文介绍了一种在神经网络中表示谐波函数的有效方法，并将这一方法扩展到了量子神经网络中，通过对比基准测试发现其性能优越。",
    "en_tdlr": "This paper presents an effective method of representing harmonic functions in neural networks and extends this approach to quantum neural networks, demonstrating superior performance compared to (quantum) physics-informed neural networks."
}