{
    "title": "Modeling Instance Interactions for Joint Information Extraction with Neural High-Order Conditional Random Field. (arXiv:2212.08929v2 [cs.CL] UPDATED)",
    "abstract": "Prior works on joint Information Extraction (IE) typically model instance (e.g., event triggers, entities, roles, relations) interactions by representation enhancement, type dependencies scoring, or global decoding. We find that the previous models generally consider binary type dependency scoring of a pair of instances, and leverage local search such as beam search to approximate global solutions. To better integrate cross-instance interactions, in this work, we introduce a joint IE framework (CRFIE) that formulates joint IE as a high-order Conditional Random Field. Specifically, we design binary factors and ternary factors to directly model interactions between not only a pair of instances but also triplets. Then, these factors are utilized to jointly predict labels of all instances. To address the intractability problem of exact high-order inference, we incorporate a high-order neural decoder that is unfolded from a mean-field variational inference method, which achieves consistent ",
    "link": "http://arxiv.org/abs/2212.08929",
    "context": "Title: Modeling Instance Interactions for Joint Information Extraction with Neural High-Order Conditional Random Field. (arXiv:2212.08929v2 [cs.CL] UPDATED)\nAbstract: Prior works on joint Information Extraction (IE) typically model instance (e.g., event triggers, entities, roles, relations) interactions by representation enhancement, type dependencies scoring, or global decoding. We find that the previous models generally consider binary type dependency scoring of a pair of instances, and leverage local search such as beam search to approximate global solutions. To better integrate cross-instance interactions, in this work, we introduce a joint IE framework (CRFIE) that formulates joint IE as a high-order Conditional Random Field. Specifically, we design binary factors and ternary factors to directly model interactions between not only a pair of instances but also triplets. Then, these factors are utilized to jointly predict labels of all instances. To address the intractability problem of exact high-order inference, we incorporate a high-order neural decoder that is unfolded from a mean-field variational inference method, which achieves consistent ",
    "path": "papers/22/12/2212.08929.json",
    "total_tokens": 922,
    "translated_title": "用神经高阶条件随机场模型建模实例信息交互的联合信息抽取",
    "translated_abstract": "先前的联合信息抽取模型一般通过表示增强、类型依赖评分或全局解码来建模实例（例如事件触发器、实体、角色、关系）之间的交互。我们发现以前的模型通常考虑了一对实例的二进制类型依赖性评分，并利用诸如波束搜索之类的局部搜索来近似全局解决方案。为了更好地集成跨实例交互，在本研究中，我们引入了一个联合信息抽取框架（CRFIE），将联合信息抽取作为高阶条件随机场进行建模。具体地，我们设计了二元因子和三元因子，直接建模不仅一对实例而且三元组之间的交互。然后，利用这些因子共同预测所有实例的标签。为解决精确高阶推理的难解性问题，我们结合了一个高阶神经解码器，该解码器是从平均场变分推理方法展开的，实现了与以前模型一致的性能提升。",
    "tldr": "本文介绍了一种利用神经高阶条件随机场进行联合信息抽取的框架，可以更好地集成跨实例交互，并通过高阶神经解码器解决了精确高阶推理的难解性问题。",
    "en_tdlr": "This paper introduces a joint information extraction framework using neural high-order conditional random field, which can better integrate cross-instance interactions and solves the intractability problem of exact high-order inference through a high-order neural decoder."
}