{
    "title": "Scalable and adaptive variational Bayes methods for Hawkes processes. (arXiv:2212.00293v2 [math.ST] UPDATED)",
    "abstract": "Hawkes processes are often applied to model dependence and interaction phenomena in multivariate event data sets, such as neuronal spike trains, social interactions, and financial transactions. In the nonparametric setting, learning the temporal dependence structure of Hawkes processes is generally a computationally expensive task, all the more with Bayesian estimation methods. In particular, for generalised nonlinear Hawkes processes, Monte-Carlo Markov Chain methods applied to compute the doubly intractable posterior distribution are not scalable to high-dimensional processes in practice. Recently, efficient algorithms targeting a mean-field variational approximation of the posterior distribution have been proposed. In this work, we first unify existing variational Bayes approaches under a general nonparametric inference framework, and analyse the asymptotic properties of these methods under easily verifiable conditions on the prior, the variational class, and the nonlinear model. Se",
    "link": "http://arxiv.org/abs/2212.00293",
    "context": "Title: Scalable and adaptive variational Bayes methods for Hawkes processes. (arXiv:2212.00293v2 [math.ST] UPDATED)\nAbstract: Hawkes processes are often applied to model dependence and interaction phenomena in multivariate event data sets, such as neuronal spike trains, social interactions, and financial transactions. In the nonparametric setting, learning the temporal dependence structure of Hawkes processes is generally a computationally expensive task, all the more with Bayesian estimation methods. In particular, for generalised nonlinear Hawkes processes, Monte-Carlo Markov Chain methods applied to compute the doubly intractable posterior distribution are not scalable to high-dimensional processes in practice. Recently, efficient algorithms targeting a mean-field variational approximation of the posterior distribution have been proposed. In this work, we first unify existing variational Bayes approaches under a general nonparametric inference framework, and analyse the asymptotic properties of these methods under easily verifiable conditions on the prior, the variational class, and the nonlinear model. Se",
    "path": "papers/22/12/2212.00293.json",
    "total_tokens": 880,
    "translated_title": "可扩展和自适应的Hawkes过程变分贝叶斯方法",
    "translated_abstract": "Hawkes过程常用于建模多元事件数据集中的依赖和相互作用现象，如神经尖峰序列、社交互动和金融交易。在非参数设置中，学习Hawkes过程的时间依赖结构通常是一项计算成本高昂的任务，尤其是对于贝叶斯估计方法。特别是对于广义非线性Hawkes过程，应用于计算难以处理的后验分布的马尔可夫链蒙特卡罗方法在实践中无法扩展到高维过程。最近，提出了针对后验分布平均场变分逼近的高效算法。在这项工作中，我们首先在一个通用的非参数推断框架下统一了现有的变分贝叶斯方法，并分析了这些方法在先验、变分类和非线性模型上的易于验证的渐近性质。",
    "tldr": "这项研究提出了一种可扩展和自适应的变分贝叶斯方法，用于处理Hawkes过程的依赖关系和非参数推断。通过分析先验、变分类和非线性模型的条件，我们统一了现有的方法，并证明了其渐近性质。"
}