{
    "title": "Can Evolutionary Clustering Have Theoretical Guarantees?. (arXiv:2212.01771v2 [cs.NE] UPDATED)",
    "abstract": "Clustering is a fundamental problem in many areas, which aims to partition a given data set into groups based on some distance measure, such that the data points in the same group are similar while that in different groups are dissimilar. Due to its importance and NP-hardness, a lot of methods have been proposed, among which evolutionary algorithms are a class of popular ones. Evolutionary clustering has found many successful applications, but all the results are empirical, lacking theoretical support. This paper fills this gap by proving that the approximation performance of the GSEMO (a simple multi-objective evolutionary algorithm) for solving four formulations of clustering, i.e., $k$-tMM, $k$-center, discrete $k$-median and $k$-means, can be theoretically guaranteed. Furthermore, we consider clustering under fairness, which tries to avoid algorithmic bias, and has recently been an important research topic in machine learning. We prove that for discrete $k$-median clustering under ",
    "link": "http://arxiv.org/abs/2212.01771",
    "context": "Title: Can Evolutionary Clustering Have Theoretical Guarantees?. (arXiv:2212.01771v2 [cs.NE] UPDATED)\nAbstract: Clustering is a fundamental problem in many areas, which aims to partition a given data set into groups based on some distance measure, such that the data points in the same group are similar while that in different groups are dissimilar. Due to its importance and NP-hardness, a lot of methods have been proposed, among which evolutionary algorithms are a class of popular ones. Evolutionary clustering has found many successful applications, but all the results are empirical, lacking theoretical support. This paper fills this gap by proving that the approximation performance of the GSEMO (a simple multi-objective evolutionary algorithm) for solving four formulations of clustering, i.e., $k$-tMM, $k$-center, discrete $k$-median and $k$-means, can be theoretically guaranteed. Furthermore, we consider clustering under fairness, which tries to avoid algorithmic bias, and has recently been an important research topic in machine learning. We prove that for discrete $k$-median clustering under ",
    "path": "papers/22/12/2212.01771.json",
    "total_tokens": 893,
    "translated_title": "进化聚类是否有理论保证?",
    "translated_abstract": "聚类是许多领域中的一个基本问题，其目标是基于某种距离度量将给定的数据集分成不同的组，使得同一组中的数据点相似而不同组中的数据点不相似。由于其重要性和 NP 困难性，已经提出了许多方法，其中进化算法是一类常用的方法。进化聚类已经在许多应用中取得了成功，但所有的结果都是经验主义的，缺乏理论支持。本文通过证明 GSEMO（一种简单的多目标进化算法）在解决四种聚类形式：k-总距离最小化、k-中心、离散 k-中位数和 k-均值时，其近似性能可以在理论上得到保证，填补了这一空白。此外，我们考虑了公平的聚类问题，即尽量避免算法的偏见，这在机器学习中最近成为一个重要的研究课题。我们证明了在离散 k-中位数聚类下的公平聚类。",
    "tldr": "本文证明了进化聚类算法 GSEMO 可以在理论上保证解决四种聚类问题，并介绍了在离散 k-中位数聚类中的公平聚类问题。",
    "en_tdlr": "This paper proves that the evolutionary clustering algorithm GSEMO can theoretically guarantee the solution to four clustering problems and introduces the fair clustering problem in discrete k-median clustering."
}