{
    "title": "ObjectMatch: Robust Registration using Canonical Object Correspondences. (arXiv:2212.01985v2 [cs.CV] UPDATED)",
    "abstract": "We present ObjectMatch, a semantic and object-centric camera pose estimator for RGB-D SLAM pipelines. Modern camera pose estimators rely on direct correspondences of overlapping regions between frames; however, they cannot align camera frames with little or no overlap. In this work, we propose to leverage indirect correspondences obtained via semantic object identification. For instance, when an object is seen from the front in one frame and from the back in another frame, we can provide additional pose constraints through canonical object correspondences. We first propose a neural network to predict such correspondences on a per-pixel level, which we then combine in our energy formulation with state-of-the-art keypoint matching solved with a joint Gauss-Newton optimization. In a pairwise setting, our method improves registration recall of state-of-the-art feature matching, including from 24% to 45% in pairs with 10% or less inter-frame overlap. In registering RGB-D sequences, our meth",
    "link": "http://arxiv.org/abs/2212.01985",
    "context": "Title: ObjectMatch: Robust Registration using Canonical Object Correspondences. (arXiv:2212.01985v2 [cs.CV] UPDATED)\nAbstract: We present ObjectMatch, a semantic and object-centric camera pose estimator for RGB-D SLAM pipelines. Modern camera pose estimators rely on direct correspondences of overlapping regions between frames; however, they cannot align camera frames with little or no overlap. In this work, we propose to leverage indirect correspondences obtained via semantic object identification. For instance, when an object is seen from the front in one frame and from the back in another frame, we can provide additional pose constraints through canonical object correspondences. We first propose a neural network to predict such correspondences on a per-pixel level, which we then combine in our energy formulation with state-of-the-art keypoint matching solved with a joint Gauss-Newton optimization. In a pairwise setting, our method improves registration recall of state-of-the-art feature matching, including from 24% to 45% in pairs with 10% or less inter-frame overlap. In registering RGB-D sequences, our meth",
    "path": "papers/22/12/2212.01985.json",
    "total_tokens": 891,
    "translated_title": "ObjectMatch: 使用规范对象对应关系的鲁棒注册方法",
    "translated_abstract": "本文提出了ObjectMatch，一种基于语义和物体中心的RGB-D SLAM相机姿态估计器。现代相机姿态估计器依赖于帧之间的直接对应关系，然而它们无法对齐具有很少或没有重叠的相机帧。本文提出了利用通过语义对象识别获得的间接对应关系。我们首先提出了一个神经网络来预测每个像素级别的对应关系，然后将其与最先进的关键点匹配相结合，并使用联合高斯牛顿优化来解决能量公式。在成对设置中，我们的方法提高了最先进的特征匹配的注册召回率，包括在帧之间重叠率低于10%的对中，从24%到45%。在注册RGB-D序列时，我们的方法在三个公共数据集中达到了最先进的准确性。",
    "tldr": "ObjectMatch是一种利用语义对象识别来实现间接对应关系的鲁棒性注册方法，在处理很少或没有帧之间重叠的情况下表现出了显著的优势，并在 RGB-D 序列的三个公共数据集中实现了最先进的准确性。",
    "en_tdlr": "ObjectMatch is a robust registration method that leverages indirect correspondences obtained via semantic object identification, and achieves state-of-the-art accuracy in registering RGB-D sequences across three public datasets."
}