{
    "title": "Simultaneous Inference of a Partially Linear Model in Time Series. (arXiv:2212.10359v2 [stat.ME] UPDATED)",
    "abstract": "We introduce a new methodology to conduct simultaneous inference of the nonparametric component in partially linear time series regression models where the nonparametric part is a multivariate unknown function. In particular, we construct a simultaneous confidence region (SCR) for the multivariate function by extending the high-dimensional Gaussian approximation to dependent processes with continuous index sets. Our results allow for a more general dependence structure compared to previous works and are widely applicable to a variety of linear and nonlinear autoregressive processes. We demonstrate the validity of our proposed methodology by examining the finite-sample performance in the simulation study. Finally, an application in time series, the forward premium regression, is presented, where we construct the SCR for the foreign exchange risk premium from the exchange rate and macroeconomic data.",
    "link": "http://arxiv.org/abs/2212.10359",
    "context": "Title: Simultaneous Inference of a Partially Linear Model in Time Series. (arXiv:2212.10359v2 [stat.ME] UPDATED)\nAbstract: We introduce a new methodology to conduct simultaneous inference of the nonparametric component in partially linear time series regression models where the nonparametric part is a multivariate unknown function. In particular, we construct a simultaneous confidence region (SCR) for the multivariate function by extending the high-dimensional Gaussian approximation to dependent processes with continuous index sets. Our results allow for a more general dependence structure compared to previous works and are widely applicable to a variety of linear and nonlinear autoregressive processes. We demonstrate the validity of our proposed methodology by examining the finite-sample performance in the simulation study. Finally, an application in time series, the forward premium regression, is presented, where we construct the SCR for the foreign exchange risk premium from the exchange rate and macroeconomic data.",
    "path": "papers/22/12/2212.10359.json",
    "total_tokens": 887,
    "translated_title": "在时间序列中部分线性模型的同时推断",
    "translated_abstract": "我们介绍了一种新的方法来进行同时推断部分线性时间序列回归模型中的非参数部分，其中非参数部分是一个多元未知函数。具体而言，我们通过将高维高斯近似方法推广到具有连续指标集的相关过程，构建了多元函数的同时置信区间（SCR）。与先前的工作相比，我们的结果允许更一般的依赖结构，并且广泛适用于各种线性和非线性自回归过程。通过模拟研究，我们展示了所提出方法的有限样本性能的有效性。最后，我们给出了一个在时间序列中应用的例子，即前瞻性回归，我们通过外汇率和宏观经济数据构造了外汇风险溢价的SCR。",
    "tldr": "该论文介绍了一种在时间序列中进行部分线性模型的同时推断的新方法，通过构建同时置信区间来推断非参数部分中的多元函数。这种方法具有更一般的依赖结构，适用于各种线性和非线性自回归过程，并且通过模拟研究验证了其有效性。在应用方面，通过外汇率和宏观经济数据构造了外汇风险溢价的同时置信区间。",
    "en_tdlr": "This paper introduces a new method for simultaneous inference of the partially linear model in time series, constructing a simultaneous confidence region for the multivariate function. The method allows for a more general dependence structure and is applicable to various linear and nonlinear autoregressive processes. Its validity is demonstrated through simulation study, and an application to the forward premium regression is provided."
}