{
    "title": "Needle in a Haystack: An Analysis of High-Agreement Workers on MTurk for Summarization. (arXiv:2212.10397v3 [cs.CL] UPDATED)",
    "abstract": "To prevent the costly and inefficient use of resources on low-quality annotations, we want a method for creating a pool of dependable annotators who can effectively complete difficult tasks, such as evaluating automatic summarization. Thus, we investigate the recruitment of high-quality Amazon Mechanical Turk workers via a two-step pipeline. We show that we can successfully filter out subpar workers before they carry out the evaluations and obtain high-agreement annotations with similar constraints on resources. Although our workers demonstrate a strong consensus among themselves and CloudResearch workers, their alignment with expert judgments on a subset of the data is not as expected and needs further training in correctness. This paper still serves as a best practice for the recruitment of qualified annotators in other challenging annotation tasks.",
    "link": "http://arxiv.org/abs/2212.10397",
    "context": "Title: Needle in a Haystack: An Analysis of High-Agreement Workers on MTurk for Summarization. (arXiv:2212.10397v3 [cs.CL] UPDATED)\nAbstract: To prevent the costly and inefficient use of resources on low-quality annotations, we want a method for creating a pool of dependable annotators who can effectively complete difficult tasks, such as evaluating automatic summarization. Thus, we investigate the recruitment of high-quality Amazon Mechanical Turk workers via a two-step pipeline. We show that we can successfully filter out subpar workers before they carry out the evaluations and obtain high-agreement annotations with similar constraints on resources. Although our workers demonstrate a strong consensus among themselves and CloudResearch workers, their alignment with expert judgments on a subset of the data is not as expected and needs further training in correctness. This paper still serves as a best practice for the recruitment of qualified annotators in other challenging annotation tasks.",
    "path": "papers/22/12/2212.10397.json",
    "total_tokens": 829,
    "translated_title": "弃石成金：MTurk中高一致性工作者对自动摘要的分析",
    "translated_abstract": "为避免在低质量注释上浪费昂贵而低效的资源，我们需要一种方法来创建一组可靠的注释者，他们可以有效地完成困难的任务，例如评估自动摘要。因此，我们通过两步流程调查招募高质量的Amazon Mechanical Turk工作者。我们表明，我们可以在他们进行评估之前成功地过滤掉劣质的工作者，并在类似资源约束的情况下获得高度一致的注释。尽管我们的工作者彼此之间以及CloudResearch工作者之间表现出强烈的共识，但他们与专家对数据子集的判断一致性并不像预期那样，需要进一步在正确性方面进行培训。本文仍然作为在其他具有挑战性注释任务中招募合格的注释者的最佳实践。",
    "tldr": "本研究调查了在MTurk上高一致性工作者对自动摘要的评估，通过两步筛选找到高质量的工作者，为其他具有挑战性注释任务的招募提供了最佳实践。",
    "en_tdlr": "This paper investigates the evaluation of automatic summarization by high-agreement workers on MTurk and provides a best practice for recruiting qualified annotators in other challenging annotation tasks by filtering out subpar workers through a two-step pipeline."
}