{
    "title": "OASum: Large-Scale Open Domain Aspect-based Summarization. (arXiv:2212.09233v2 [cs.CL] UPDATED)",
    "abstract": "Aspect or query-based summarization has recently caught more attention, as it can generate differentiated summaries based on users' interests. However, the current dataset for aspect or query-based summarization either focuses on specific domains, contains relatively small-scale instances, or includes only a few aspect types. Such limitations hinder further explorations in this direction. In this work, we take advantage of crowd-sourcing knowledge on Wikipedia.org and automatically create a high-quality, large-scale open-domain aspect-based summarization dataset named OASum, which contains more than 3.7 million instances with around 1 million different aspects on 2 million Wikipedia pages. We provide benchmark results on OASum and demonstrate its ability for diverse aspect-based summarization generation. To overcome the data scarcity problem on specific domains, we also perform zero-shot, few-shot, and fine-tuning on seven downstream datasets. Specifically, zero/few-shot and fine-tunin",
    "link": "http://arxiv.org/abs/2212.09233",
    "context": "Title: OASum: Large-Scale Open Domain Aspect-based Summarization. (arXiv:2212.09233v2 [cs.CL] UPDATED)\nAbstract: Aspect or query-based summarization has recently caught more attention, as it can generate differentiated summaries based on users' interests. However, the current dataset for aspect or query-based summarization either focuses on specific domains, contains relatively small-scale instances, or includes only a few aspect types. Such limitations hinder further explorations in this direction. In this work, we take advantage of crowd-sourcing knowledge on Wikipedia.org and automatically create a high-quality, large-scale open-domain aspect-based summarization dataset named OASum, which contains more than 3.7 million instances with around 1 million different aspects on 2 million Wikipedia pages. We provide benchmark results on OASum and demonstrate its ability for diverse aspect-based summarization generation. To overcome the data scarcity problem on specific domains, we also perform zero-shot, few-shot, and fine-tuning on seven downstream datasets. Specifically, zero/few-shot and fine-tunin",
    "path": "papers/22/12/2212.09233.json",
    "total_tokens": 928,
    "translated_title": "OASum：大规模开放领域基于特定方面的摘要",
    "translated_abstract": "近来方面或基于查询的总结引起了更多关注，因为它可以基于用户的兴趣生成不同的总结。然而，现有的方面或基于查询的总结数据集通常侧重于特定领域，包含的实例规模相对较小，或者仅包含少量方面类型。这些限制阻碍了在这个方向上的进一步探索。在这项工作中，我们利用维基百科.org上的众包知识，并自动生成一个高质量的、大规模的开放领域基于特定方面的摘要数据集，命名为OASum，其中包含了超过370万个实例，在200万个维基百科页面中涉及了约100万个不同的方面。我们在OASum上提供了基准结果，并展示了其进行多样化方面基础的总结生成的能力。为了克服特定领域数据稀缺问题，我们还通过对七个下游数据集进行零-shot、少-shot和微调进行训练。",
    "tldr": "本文提出了一种大规模开放领域基于特定方面的摘要生成方法，通过对维基百科进行众包知识的利用，构建了高质量的OASum数据集，并在七个下游数据集上进行训练。该方法可以进行多样化的方面基础的总结生成。"
}