{
    "title": "Privacy-Preserving Domain Adaptation of Semantic Parsers. (arXiv:2212.10520v2 [cs.CL] UPDATED)",
    "abstract": "Task-oriented dialogue systems often assist users with personal or confidential matters. For this reason, the developers of such a system are generally prohibited from observing actual usage. So how can they know where the system is failing and needs more training data or new functionality? In this work, we study ways in which realistic user utterances can be generated synthetically, to help increase the linguistic and functional coverage of the system, without compromising the privacy of actual users. To this end, we propose a two-stage Differentially Private (DP) generation method which first generates latent semantic parses, and then generates utterances based on the parses. Our proposed approach improves MAUVE by 2.5X and parse tree function type overlap by 1.3X relative to current approaches for private synthetic data generation, improving both on fluency and semantic coverage. We further validate our approach on a realistic domain adaptation task of adding new functionality from ",
    "link": "http://arxiv.org/abs/2212.10520",
    "context": "Title: Privacy-Preserving Domain Adaptation of Semantic Parsers. (arXiv:2212.10520v2 [cs.CL] UPDATED)\nAbstract: Task-oriented dialogue systems often assist users with personal or confidential matters. For this reason, the developers of such a system are generally prohibited from observing actual usage. So how can they know where the system is failing and needs more training data or new functionality? In this work, we study ways in which realistic user utterances can be generated synthetically, to help increase the linguistic and functional coverage of the system, without compromising the privacy of actual users. To this end, we propose a two-stage Differentially Private (DP) generation method which first generates latent semantic parses, and then generates utterances based on the parses. Our proposed approach improves MAUVE by 2.5X and parse tree function type overlap by 1.3X relative to current approaches for private synthetic data generation, improving both on fluency and semantic coverage. We further validate our approach on a realistic domain adaptation task of adding new functionality from ",
    "path": "papers/22/12/2212.10520.json",
    "total_tokens": 896,
    "translated_title": "隐私保护的语义解析器领域自适应研究",
    "translated_abstract": "任务导向的对话系统通常辅助用户处理个人或机密事务。因此，此类系统的开发人员通常被禁止观察实际使用情况。那么，他们如何知道系统在哪些方面存在失败并需要更多的训练数据或新功能呢？在这项工作中，我们研究了如何合成真实用户语句来帮助增加系统的语言和功能覆盖范围，同时不会危及实际用户的隐私。为此，我们提出了一种两阶段差分隐私生成方法，首先生成潜在的语义解析，然后根据解析生成语句。我们的方法在私有合成数据生成方面相对于当前方法提高了MAUVE 2.5倍和语义覆盖1.3倍，提高了流畅性和语义覆盖度。我们进一步在一个实际的领域适应任务中验证了我们的方法，即添加新功能。",
    "tldr": "本文提出了一个隐私保护的语义解析器领域自适应的方法，通过合成真实用户语句来帮助增加系统的语言和功能覆盖范围，同时不会危及实际用户的隐私。"
}