{
    "title": "A Novel Deep Reinforcement Learning Based Automated Stock Trading System Using Cascaded LSTM Networks. (arXiv:2212.02721v2 [q-fin.CP] UPDATED)",
    "abstract": "More and more stock trading strategies are constructed using deep reinforcement learning (DRL) algorithms, but DRL methods originally widely used in the gaming community are not directly adaptable to financial data with low signal-to-noise ratios and unevenness, and thus suffer from performance shortcomings. In this paper, to capture the hidden information, we propose a DRL based stock trading system using cascaded LSTM, which first uses LSTM to extract the time-series features from stock daily data, and then the features extracted are fed to the agent for training, while the strategy functions in reinforcement learning also use another LSTM for training. Experiments in DJI in the US market and SSE50 in the Chinese stock market show that our model outperforms previous baseline models in terms of cumulative returns and Sharp ratio, and this advantage is more significant in the Chinese stock market, a merging market. It indicates that our proposed method is a promising way to build a aut",
    "link": "http://arxiv.org/abs/2212.02721",
    "context": "Title: A Novel Deep Reinforcement Learning Based Automated Stock Trading System Using Cascaded LSTM Networks. (arXiv:2212.02721v2 [q-fin.CP] UPDATED)\nAbstract: More and more stock trading strategies are constructed using deep reinforcement learning (DRL) algorithms, but DRL methods originally widely used in the gaming community are not directly adaptable to financial data with low signal-to-noise ratios and unevenness, and thus suffer from performance shortcomings. In this paper, to capture the hidden information, we propose a DRL based stock trading system using cascaded LSTM, which first uses LSTM to extract the time-series features from stock daily data, and then the features extracted are fed to the agent for training, while the strategy functions in reinforcement learning also use another LSTM for training. Experiments in DJI in the US market and SSE50 in the Chinese stock market show that our model outperforms previous baseline models in terms of cumulative returns and Sharp ratio, and this advantage is more significant in the Chinese stock market, a merging market. It indicates that our proposed method is a promising way to build a aut",
    "path": "papers/22/12/2212.02721.json",
    "total_tokens": 948,
    "translated_title": "使用级联LSTM网络的一种新型基于深度强化学习的自动股票交易系统",
    "translated_abstract": "越来越多的股票交易策略是使用深度强化学习（DRL）算法构建的，但是DRL方法最初在游戏界广泛使用，直接适应金融数据的低信噪比和不均匀性会导致性能不足。为了捕捉隐藏的信息，本文提出了一种使用级联LSTM的DRL股票交易系统，首先使用LSTM从股票日常数据中提取时间序列特征，然后将提取的特征馈给代理进行训练，同时强化学习中的策略函数也使用另一个LSTM进行训练。在美国市场的DJI和中国股市的SSE50上的实验证明，我们的模型在累积回报和夏普比率方面优于以前的基准模型，并且在中国股市这一新兴市场中优势更为显著。这表明我们提出的方法是一种有前景的构建自动股票交易系统的方式。",
    "tldr": "本文提出了一种使用级联LSTM网络的基于深度强化学习的自动股票交易系统，通过对股票数据进行特征提取和策略函数训练，我们的模型在累积回报和夏普比率方面优于基准模型，特别在中国股市这一新兴市场中表现更为突出。"
}