{
    "title": "Active Classification of Moving Targets with Learned Control Policies. (arXiv:2212.03068v3 [cs.RO] UPDATED)",
    "abstract": "In this paper, we consider the problem where a drone has to collect semantic information to classify multiple moving targets. In particular, we address the challenge of computing control inputs that move the drone to informative viewpoints, position and orientation, when the information is extracted using a \"black-box\" classifier, e.g., a deep learning neural network. These algorithms typically lack of analytical relationships between the viewpoints and their associated outputs, preventing their use in information-gathering schemes. To fill this gap, we propose a novel attention-based architecture, trained via Reinforcement Learning (RL), that outputs the next viewpoint for the drone favoring the acquisition of evidence from as many unclassified targets as possible while reasoning about their movement, orientation, and occlusions. Then, we use a low-level MPC controller to move the drone to the desired viewpoint taking into account its actual dynamics. We show that our approach not onl",
    "link": "http://arxiv.org/abs/2212.03068",
    "context": "Title: Active Classification of Moving Targets with Learned Control Policies. (arXiv:2212.03068v3 [cs.RO] UPDATED)\nAbstract: In this paper, we consider the problem where a drone has to collect semantic information to classify multiple moving targets. In particular, we address the challenge of computing control inputs that move the drone to informative viewpoints, position and orientation, when the information is extracted using a \"black-box\" classifier, e.g., a deep learning neural network. These algorithms typically lack of analytical relationships between the viewpoints and their associated outputs, preventing their use in information-gathering schemes. To fill this gap, we propose a novel attention-based architecture, trained via Reinforcement Learning (RL), that outputs the next viewpoint for the drone favoring the acquisition of evidence from as many unclassified targets as possible while reasoning about their movement, orientation, and occlusions. Then, we use a low-level MPC controller to move the drone to the desired viewpoint taking into account its actual dynamics. We show that our approach not onl",
    "path": "papers/22/12/2212.03068.json",
    "total_tokens": 953,
    "translated_title": "使用学习控制策略主动对移动目标进行分类",
    "translated_abstract": "本文研究了一个问题，在该问题中，一架无人机必须收集语义信息以对多个移动目标进行分类。我们特别解决了使用“黑盒”分类器（如深度学习神经网络）提取信息时的控制输入计算挑战。这些算法通常缺乏视点与其关联输出之间的分析关系，导致无法在信息收集方案中使用。为了填补这个空白，我们提出了一种基于注意力机制的新型架构，通过强化学习（RL）进行训练，并输出下一个视点，以便无人机能够有利地获取尽可能多未分类目标的证据，并推理其运动、方向和遮挡情况。然后，我们使用低级MPC控制器将无人机移动到所需视点，考虑到其实际动态。我们展示了我们的方法不仅会分类准确率得到提高，还能提高目标分类所需的视点数量，并且在多目标环境中也能取得良好效果。",
    "tldr": "本文提出了一种使用学习控制策略的方法，通过强化学习训练一种基于注意力的架构来指导无人机选择下一个视点，以收集尽可能多未分类目标的证据，并考虑目标的运动、方向和遮挡情况。该方法不仅提高了分类准确率，还在多目标环境中取得了良好效果。",
    "en_tdlr": "This paper proposes a method using learned control policies, where a reinforcement learning-trained attention-based architecture guides a drone to select the next viewpoint for collecting evidence from as many unclassified moving targets as possible, considering their movement, orientation, and occlusions. This method improves classification accuracy and performs well in multi-target scenarios."
}