{
    "title": "Execution-Based Evaluation for Open-Domain Code Generation. (arXiv:2212.10481v2 [cs.SE] UPDATED)",
    "abstract": "To extend the scope of coding queries to more realistic settings, we propose ODEX, the first Open-Domain EXecution-based natural language (NL) to Python code generation dataset. ODEX has 945 NL-Code pairs spanning 79 diverse libraries, along with 1,707 human-written test cases for execution. Our NL-Code pairs are harvested from StackOverflow forums to encourage natural and practical coding queries. Moreover, ODEX supports four natural languages as intents, in English, Spanish, Japanese, and Russian. ODEX unveils intriguing behavioral differences among top-performing code language models (LM). While CODEX achieves better overall results, CODEGEN improves effectively via scaling -- CODEGEN 6.1B performs comparably with CODEX 12B. Both models show substantial gaps between open and closed domains, but CODEGEN gaps tend to decrease with model size while CODEX gaps increase. We release ODEX to facilitate research into open-domain problems for the code generation community.",
    "link": "http://arxiv.org/abs/2212.10481",
    "context": "Title: Execution-Based Evaluation for Open-Domain Code Generation. (arXiv:2212.10481v2 [cs.SE] UPDATED)\nAbstract: To extend the scope of coding queries to more realistic settings, we propose ODEX, the first Open-Domain EXecution-based natural language (NL) to Python code generation dataset. ODEX has 945 NL-Code pairs spanning 79 diverse libraries, along with 1,707 human-written test cases for execution. Our NL-Code pairs are harvested from StackOverflow forums to encourage natural and practical coding queries. Moreover, ODEX supports four natural languages as intents, in English, Spanish, Japanese, and Russian. ODEX unveils intriguing behavioral differences among top-performing code language models (LM). While CODEX achieves better overall results, CODEGEN improves effectively via scaling -- CODEGEN 6.1B performs comparably with CODEX 12B. Both models show substantial gaps between open and closed domains, but CODEGEN gaps tend to decrease with model size while CODEX gaps increase. We release ODEX to facilitate research into open-domain problems for the code generation community.",
    "path": "papers/22/12/2212.10481.json",
    "total_tokens": 912,
    "translated_title": "基于执行的方法评估开放域代码生成",
    "translated_abstract": "为了将编码查询的范围扩展到更加实际的环境，我们提出了ODEx，第一个基于开放域执行的自然语言（NL）到Python代码生成数据集。ODEx共有945个NL-Code对，涵盖79个不同的库，以及1,707个供执行的人工编写的测试用例。我们从StackOverflow论坛获得NL-Code对，鼓励自然和实用的编码查询。此外，ODEx支持四种自然语言，即英语、西班牙语、日语和俄语。ODEx揭示了最高执行效果代码语言模型之间的有趣行为差异。虽然CODEX的总体结果更好，但CODEGEN通过扩展而有效地提高了性能 - CODEGEN 6.1B与CODEX 12B表现相当。两个模型都显示出开放域和封闭域之间的显著差距，但CODEGEN差距往往随着模型规模的增加而减少，而CODEX差距则会增加。我们释放ODEx以促进对代码生成社区的开放域问题的研究。",
    "tldr": "ODEX是第一个基于开放域执行的自然语言到Python代码生成数据集。CODEX和CODEGEN分别表现不同的行为。ODEx将有助于进一步研究代码生成的开放域问题。",
    "en_tdlr": "ODEX is the first execution-based natural language to Python code generation dataset for open-domain problems. CODEX and CODEGEN show different behaviors. ODEX will facilitate further research into open-domain problems for the code generation community."
}