{
    "title": "Arbitrage theory in a market of stochastic dimension. (arXiv:2212.04623v2 [q-fin.MF] UPDATED)",
    "abstract": "This paper studies an equity market of stochastic dimension, where the number of assets fluctuates over time. In such a market, we develop the fundamental theorem of asset pricing, which provides the equivalence of the following statements: (i) there exists a supermartingale num\\'eraire portfolio; (ii) each dissected market, which is of a fixed dimension between dimensional jumps, has locally finite growth; (iii) there is no arbitrage of the first kind; (iv) there exists a local martingale deflator; (v) the market is viable. We also present the optional decomposition theorem, which characterizes a given nonnegative process as the wealth process of some investment-consumption strategy. Furthermore, similar results still hold in an open market embedded in the entire market of stochastic dimension, where investors can only invest in a fixed number of large capitalization stocks. These results are developed in an equity market model where the price process is given by a piecewise continuou",
    "link": "http://arxiv.org/abs/2212.04623",
    "context": "Title: Arbitrage theory in a market of stochastic dimension. (arXiv:2212.04623v2 [q-fin.MF] UPDATED)\nAbstract: This paper studies an equity market of stochastic dimension, where the number of assets fluctuates over time. In such a market, we develop the fundamental theorem of asset pricing, which provides the equivalence of the following statements: (i) there exists a supermartingale num\\'eraire portfolio; (ii) each dissected market, which is of a fixed dimension between dimensional jumps, has locally finite growth; (iii) there is no arbitrage of the first kind; (iv) there exists a local martingale deflator; (v) the market is viable. We also present the optional decomposition theorem, which characterizes a given nonnegative process as the wealth process of some investment-consumption strategy. Furthermore, similar results still hold in an open market embedded in the entire market of stochastic dimension, where investors can only invest in a fixed number of large capitalization stocks. These results are developed in an equity market model where the price process is given by a piecewise continuou",
    "path": "papers/22/12/2212.04623.json",
    "total_tokens": 1028,
    "translated_title": "随机维度市场的套利理论",
    "translated_abstract": "本文研究了一个随机维度的股票市场，在该市场中，资产数量会随着时间波动。我们开发了资产定价的基本定理，并提出了选择性分解定理。此外，类似的结果仍然适用于一个开放的市场。这些结果是在一个由分段连续构成的股票市场模型中得出的。",
    "tldr": "该论文研究了随机维度市场的套利理论，提出了资产定价的基本定理和选择性分解定理。",
    "en_tdlr": "This paper studies arbitrage theory in a market of stochastic dimension and develops the fundamental theorem of asset pricing as well as the optional decomposition theorem. The results also hold in an open market and are developed in a piecewise continuous equity market model."
}