{
    "title": "Deep Unfolding-based Weighted Averaging for Federated Learning in Heterogeneous Environments. (arXiv:2212.12191v2 [cs.LG] UPDATED)",
    "abstract": "Federated learning is a collaborative model training method that iterates model updates by multiple clients and aggregation of the updates by a central server. Device and statistical heterogeneity of participating clients cause significant performance degradation so that an appropriate aggregation weight should be assigned to each client in the aggregation phase of the server. To adjust the aggregation weights, this paper employs deep unfolding, which is known as the parameter tuning method that leverages both learning capability using training data like deep learning and domain knowledge. This enables us to directly incorporate the heterogeneity of the environment of interest into the tuning of the aggregation weights. The proposed approach can be combined with various federated learning algorithms. The results of numerical experiments indicate that a higher test accuracy for unknown class-balanced data can be obtained with the proposed method than that with conventional heuristic wei",
    "link": "http://arxiv.org/abs/2212.12191",
    "context": "Title: Deep Unfolding-based Weighted Averaging for Federated Learning in Heterogeneous Environments. (arXiv:2212.12191v2 [cs.LG] UPDATED)\nAbstract: Federated learning is a collaborative model training method that iterates model updates by multiple clients and aggregation of the updates by a central server. Device and statistical heterogeneity of participating clients cause significant performance degradation so that an appropriate aggregation weight should be assigned to each client in the aggregation phase of the server. To adjust the aggregation weights, this paper employs deep unfolding, which is known as the parameter tuning method that leverages both learning capability using training data like deep learning and domain knowledge. This enables us to directly incorporate the heterogeneity of the environment of interest into the tuning of the aggregation weights. The proposed approach can be combined with various federated learning algorithms. The results of numerical experiments indicate that a higher test accuracy for unknown class-balanced data can be obtained with the proposed method than that with conventional heuristic wei",
    "path": "papers/22/12/2212.12191.json",
    "total_tokens": 869,
    "translated_title": "基于深度展开的异构环境联邦学习加权平均方法",
    "translated_abstract": "联邦学习是一种协作模型训练方法，通过多个客户端的模型更新和中央服务器的聚合来迭代模型更新。参与客户端的设备和统计异质性导致了显著的性能下降，因此在服务器的聚合阶段应为每个客户端分配适当的聚合权重。为了调整聚合权重，本文采用了深度展开方法，这是一种利用训练数据进行学习的能力和领域知识的参数调整方法。这使得我们能够直接将感兴趣环境的异质性纳入聚合权重的调整中。所提出的方法可以与各种联邦学习算法结合使用。数值实验证明，与传统的启发式加权方法相比，所提出的方法可以获得更高的未知类平衡数据的测试准确性。",
    "tldr": "本文提出了一种基于深度展开的加权平均方法，用于解决异质环境下的联邦学习问题。通过直接将环境的异质性纳入聚合权重的调整中，该方法能够获得更高的未知类平衡数据的测试准确性。"
}