{
    "title": "DeepJoin: Joinable Table Discovery with Pre-trained Language Models. (arXiv:2212.07588v2 [cs.DB] UPDATED)",
    "abstract": "Due to the usefulness in data enrichment for data analysis tasks, joinable table discovery has become an important operation in data lake management. Existing approaches target equi-joins, the most common way of combining tables for creating a unified view, or semantic joins, which tolerate misspellings and different formats to deliver more join results. They are either exact solutions whose running time is linear in the sizes of query column and target table repository or approximate solutions lacking precision. In this paper, we propose Deepjoin, a deep learning model for accurate and efficient joinable table discovery. Our solution is an embedding-based retrieval, which employs a pre-trained language model (PLM) and is designed as one framework serving both equi- and semantic joins. We propose a set of contextualization options to transform column contents to a text sequence. The PLM reads the sequence and is fine-tuned to embed columns to vectors such that columns are expected to b",
    "link": "http://arxiv.org/abs/2212.07588",
    "context": "Title: DeepJoin: Joinable Table Discovery with Pre-trained Language Models. (arXiv:2212.07588v2 [cs.DB] UPDATED)\nAbstract: Due to the usefulness in data enrichment for data analysis tasks, joinable table discovery has become an important operation in data lake management. Existing approaches target equi-joins, the most common way of combining tables for creating a unified view, or semantic joins, which tolerate misspellings and different formats to deliver more join results. They are either exact solutions whose running time is linear in the sizes of query column and target table repository or approximate solutions lacking precision. In this paper, we propose Deepjoin, a deep learning model for accurate and efficient joinable table discovery. Our solution is an embedding-based retrieval, which employs a pre-trained language model (PLM) and is designed as one framework serving both equi- and semantic joins. We propose a set of contextualization options to transform column contents to a text sequence. The PLM reads the sequence and is fine-tuned to embed columns to vectors such that columns are expected to b",
    "path": "papers/22/12/2212.07588.json",
    "total_tokens": 993,
    "translated_title": "DeepJoin: 基于预训练语言模型的可连接表发现",
    "translated_abstract": "可连接表发现在数据湖管理中变得越来越重要，因为它能够丰富数据并帮助数据分析任务。现有的方法主要针对等值连接或语义连接，但要么是精确但运行时间长，要么缺乏准确性的近似解。本文提出了 Deepjoin，这是一个基于深度学习的模型，用于精确高效地发现可连接表。我们的解决方案是基于嵌入的检索，采用预训练语言模型，旨在同时服务于等值和语义连接。我们提出了一组上下文化选项，将列内容转换为文本序列。PLM读取序列，并进行微调，将列嵌入向量中，使得如果它们可以形成连接，则这些向量会更接近。Deepjoin还允许用户指定模板，以处理更复杂的连接条件。实验结果表明，Deepjoin在效率和准确性方面显著优于现有的最先进方法。",
    "tldr": "本文提出了 Deepjoin，一个基于深度学习的模型，用于精确高效地发现可连接表。通过预训练语言模型进行嵌入式检索，能够同时服务于等值和语义连接，并允许用户自定义模板。实验结果表明 Deepjoin 在效率和准确性方面显著优于现有的最先进方法。",
    "en_tdlr": "This paper proposes Deepjoin, a deep learning model for accurate and efficient joinable table discovery. It employs a pre-trained language model for embedding-based retrieval, serving both equi- and semantic joins and allowing for user-specified templates. Experimental results show that Deepjoin outperforms state-of-the-art methods in terms of efficiency and accuracy."
}