{
    "title": "Estimating Higher-Order Mixed Memberships via the $\\ell_{2,\\infty}$ Tensor Perturbation Bound. (arXiv:2212.08642v2 [math.ST] UPDATED)",
    "abstract": "Higher-order multiway data is ubiquitous in machine learning and statistics and often exhibits community-like structures, where each component (node) along each different mode has a community membership associated with it. In this paper we propose the tensor mixed-membership blockmodel, a generalization of the tensor blockmodel positing that memberships need not be discrete, but instead are convex combinations of latent communities. We establish the identifiability of our model and propose a computationally efficient estimation procedure based on the higher-order orthogonal iteration algorithm (HOOI) for tensor SVD composed with a simplex corner-finding algorithm. We then demonstrate the consistency of our estimation procedure by providing a per-node error bound, which showcases the effect of higher-order structures on estimation accuracy. To prove our consistency result, we develop the $\\ell_{2,\\infty}$ tensor perturbation bound for HOOI under independent, possibly heteroskedastic, su",
    "link": "http://arxiv.org/abs/2212.08642",
    "context": "Title: Estimating Higher-Order Mixed Memberships via the $\\ell_{2,\\infty}$ Tensor Perturbation Bound. (arXiv:2212.08642v2 [math.ST] UPDATED)\nAbstract: Higher-order multiway data is ubiquitous in machine learning and statistics and often exhibits community-like structures, where each component (node) along each different mode has a community membership associated with it. In this paper we propose the tensor mixed-membership blockmodel, a generalization of the tensor blockmodel positing that memberships need not be discrete, but instead are convex combinations of latent communities. We establish the identifiability of our model and propose a computationally efficient estimation procedure based on the higher-order orthogonal iteration algorithm (HOOI) for tensor SVD composed with a simplex corner-finding algorithm. We then demonstrate the consistency of our estimation procedure by providing a per-node error bound, which showcases the effect of higher-order structures on estimation accuracy. To prove our consistency result, we develop the $\\ell_{2,\\infty}$ tensor perturbation bound for HOOI under independent, possibly heteroskedastic, su",
    "path": "papers/22/12/2212.08642.json",
    "total_tokens": 999,
    "translated_title": "通过$\\ell_{2,\\infty}$张量扰动界限估计更高阶混合成员关系",
    "translated_abstract": "更高阶的多样化数据在机器学习和统计中非常普遍，并经常表现出类似社区的结构，其中每个分量（节点）在每个不同的模式上都有一个与之关联的社区成员资格。本文提出了张量混合成员模型，这是张量块模型的一个推广，其假设成员关系不需要是离散的，而是潜在社区的凸组合。我们证明了我们模型的可辨识性，并提出了一种基于高阶正交迭代算法（HOOI）与单纯形角点寻找算法组合的计算效率估计过程。然后，我们通过提供每个节点的误差界限来证明我们的估计过程的一致性，这展示了高阶结构对估计精度的影响。为了证明我们的一致性结果，我们开发了独立的、可能异方差的$\\ell_{2,\\infty}$张量扰动界限的HOOI方法。",
    "tldr": "本文提出了一种用于估计更高阶混合成员关系的方法，该方法基于$\\ell_{2,\\infty}$张量扰动界限，通过张量混合成员模型对多样化数据的社区结构进行建模，并使用高阶正交迭代算法进行估计过程。通过提供每个节点的误差界限来证明了估计过程的一致性，展示了高阶结构对估计精度的影响。",
    "en_tdlr": "This paper proposes a method to estimate higher-order mixed memberships using the $\\ell_{2,\\infty}$ tensor perturbation bound. It models the community-like structures in multiway data using the tensor mixed-membership blockmodel and employs the higher-order orthogonal iteration algorithm for estimation. The consistency of the estimation procedure is demonstrated by providing per-node error bounds, highlighting the impact of higher-order structures on estimation accuracy."
}