{
    "title": "Naamapadam: A Large-Scale Named Entity Annotated Data for Indic Languages. (arXiv:2212.10168v2 [cs.CL] UPDATED)",
    "abstract": "We present, Naamapadam, the largest publicly available Named Entity Recognition (NER) dataset for the 11 major Indian languages from two language families. The dataset contains more than 400k sentences annotated with a total of at least 100k entities from three standard entity categories (Person, Location, and, Organization) for 9 out of the 11 languages. The training dataset has been automatically created from the Samanantar parallel corpus by projecting automatically tagged entities from an English sentence to the corresponding Indian language translation. We also create manually annotated testsets for 9 languages. We demonstrate the utility of the obtained dataset on the Naamapadam-test dataset. We also release IndicNER, a multilingual IndicBERT model fine-tuned on Naamapadam training set. IndicNER achieves an F1 score of more than $80$ for $7$ out of $9$ test languages. The dataset and models are available under open-source licences at https://ai4bharat.iitm.ac.in/naamapadam.",
    "link": "http://arxiv.org/abs/2212.10168",
    "context": "Title: Naamapadam: A Large-Scale Named Entity Annotated Data for Indic Languages. (arXiv:2212.10168v2 [cs.CL] UPDATED)\nAbstract: We present, Naamapadam, the largest publicly available Named Entity Recognition (NER) dataset for the 11 major Indian languages from two language families. The dataset contains more than 400k sentences annotated with a total of at least 100k entities from three standard entity categories (Person, Location, and, Organization) for 9 out of the 11 languages. The training dataset has been automatically created from the Samanantar parallel corpus by projecting automatically tagged entities from an English sentence to the corresponding Indian language translation. We also create manually annotated testsets for 9 languages. We demonstrate the utility of the obtained dataset on the Naamapadam-test dataset. We also release IndicNER, a multilingual IndicBERT model fine-tuned on Naamapadam training set. IndicNER achieves an F1 score of more than $80$ for $7$ out of $9$ test languages. The dataset and models are available under open-source licences at https://ai4bharat.iitm.ac.in/naamapadam.",
    "path": "papers/22/12/2212.10168.json",
    "total_tokens": 964,
    "translated_title": "Naamapadam：开发印度语言大规模命名实体标注数据集",
    "translated_abstract": "我们呈现了Naamapadam，这是最大的公开命名实体识别（NER）数据集，包括来自两个语系的11种主要印度语言。该数据集包含超过400,000个句子，注释了来自三种标准实体类别（人物，位置和组织）的至少100,000个实体，其中9种语言的数据集已经被自动创建。训练数据集是从Samanantar并行语料库中自动生成的，通过将自动标记的实体从英语句子投射到相应的印度语翻译中。我们还为9种语言创建了手动标注的测试集。我们论证了该数据集在Naamapadam-test数据集上的实用性。我们还发布了IndicNER，这是一个在Naamapadam训练集上微调的多语言IndicBERT模型。IndicNER在7个测试语言中获得了超过80的F1分数。该数据集和模型可在https://ai4bharat.iitm.ac.in/naamapadam获得开源许可。",
    "tldr": "这个论文介绍了Naamapadam，一个拥有11种主要印度语言的最大的命名实体识别（NER）数据集，内容超过4万个句子，标注了至少10万个实体，并发布了IndicNER模型，取得了较好的效果。",
    "en_tdlr": "This paper presents Naamapadam, the largest Named Entity Recognition (NER) dataset for 11 major Indian languages, including over 400k annotated sentences with at least 100k entities in 3 standard categories. The authors also release IndicNER, a fine-tuned multilingual IndicBERT model achieving high scores on 7 out of 9 test languages."
}