{
    "title": "APOLLO: An Optimized Training Approach for Long-form Numerical Reasoning",
    "abstract": "arXiv:2212.07249v3 Announce Type: replace  Abstract: Long-form numerical reasoning in financial analysis aims to generate a reasoning program to calculate the correct answer for a given question. Previous work followed a retriever-generator framework, where the retriever selects key facts from a long-form document, and the generator generates a reasoning program based on retrieved facts. However, they treated all facts equally without considering the different contributions of facts with and without numbers. Meanwhile, the program consistency were ignored under supervised training, resulting in lower training accuracy and diversity. To solve these problems, we proposed APOLLO to improve the long-form numerical reasoning framework. For the retriever, we adopt a number-aware negative sampling strategy to enable the retriever to be more discriminative on key numerical facts. For the generator, we design consistency-based reinforcement learning and target program augmentation strategy base",
    "link": "https://arxiv.org/abs/2212.07249",
    "context": "Title: APOLLO: An Optimized Training Approach for Long-form Numerical Reasoning\nAbstract: arXiv:2212.07249v3 Announce Type: replace  Abstract: Long-form numerical reasoning in financial analysis aims to generate a reasoning program to calculate the correct answer for a given question. Previous work followed a retriever-generator framework, where the retriever selects key facts from a long-form document, and the generator generates a reasoning program based on retrieved facts. However, they treated all facts equally without considering the different contributions of facts with and without numbers. Meanwhile, the program consistency were ignored under supervised training, resulting in lower training accuracy and diversity. To solve these problems, we proposed APOLLO to improve the long-form numerical reasoning framework. For the retriever, we adopt a number-aware negative sampling strategy to enable the retriever to be more discriminative on key numerical facts. For the generator, we design consistency-based reinforcement learning and target program augmentation strategy base",
    "path": "papers/22/12/2212.07249.json",
    "total_tokens": 705,
    "translated_title": "APOLLO: 一种用于长篇数字推理的优化训练方法",
    "translated_abstract": "本文针对财务分析中长篇数字推理提出了一种优化训练方法，旨在生成一个推理程序以计算给定问题的正确答案。我们提出了APOLLO来改善长篇数字推理框架，针对相关性选择器，我们采用了数字感知的负采样策略，使其能够更加辨别关键的数字事实。而对于生成器，我们设计了基于一致性的强化学习和目标程序增强策略。",
    "tldr": "APOLLO提出了一种优化的训练方法，通过数字感知的负采样策略和基于一致性的强化学习，提高了长篇数字推理框架的准确性和多样性。",
    "en_tdlr": "APOLLO proposed an optimized training approach for long-form numerical reasoning, improving the accuracy and diversity of the framework by utilizing a number-aware negative sampling strategy and consistency-based reinforcement learning."
}