{
    "title": "CausalDialogue: Modeling Utterance-level Causality in Conversations. (arXiv:2212.10515v2 [cs.CL] UPDATED)",
    "abstract": "Despite their widespread adoption, neural conversation models have yet to exhibit natural chat capabilities with humans. In this research, we examine user utterances as causes and generated responses as effects, recognizing that changes in a cause should produce a different effect. To further explore this concept, we have compiled and expanded upon a new dataset called CausalDialogue through crowd-sourcing. This dataset includes multiple cause-effect pairs within a directed acyclic graph (DAG) structure. Our analysis reveals that traditional loss functions struggle to effectively incorporate the DAG structure, leading us to propose a causality-enhanced method called Exponential Maximum Average Treatment Effect (ExMATE) to enhance the impact of causality at the utterance level in training neural conversation models. To evaluate the needs of considering causality in dialogue generation, we built a comprehensive benchmark on CausalDialogue dataset using different models, inference, and tr",
    "link": "http://arxiv.org/abs/2212.10515",
    "context": "Title: CausalDialogue: Modeling Utterance-level Causality in Conversations. (arXiv:2212.10515v2 [cs.CL] UPDATED)\nAbstract: Despite their widespread adoption, neural conversation models have yet to exhibit natural chat capabilities with humans. In this research, we examine user utterances as causes and generated responses as effects, recognizing that changes in a cause should produce a different effect. To further explore this concept, we have compiled and expanded upon a new dataset called CausalDialogue through crowd-sourcing. This dataset includes multiple cause-effect pairs within a directed acyclic graph (DAG) structure. Our analysis reveals that traditional loss functions struggle to effectively incorporate the DAG structure, leading us to propose a causality-enhanced method called Exponential Maximum Average Treatment Effect (ExMATE) to enhance the impact of causality at the utterance level in training neural conversation models. To evaluate the needs of considering causality in dialogue generation, we built a comprehensive benchmark on CausalDialogue dataset using different models, inference, and tr",
    "path": "papers/22/12/2212.10515.json",
    "total_tokens": 925,
    "translated_title": "CausalDialogue: 对话中话语级因果关系的建模",
    "translated_abstract": "尽管它们被广泛采用，但神经对话模型尚未展现出与人类自然交流的能力。在这项研究中，我们将用户话语视为因果关系，将生成的回应视为效果，并认识到对因果关系的改变应产生不同的效果。为了进一步探索这个概念，我们通过众包编制了一个名为CausalDialogue的新数据集，并对其进行了扩展。该数据集包含了一个有向无环图(DAG)结构中的多个因果对。我们的分析发现，传统的损失函数难以有效地整合DAG结构，因此我们提出了一种增强话语级因果关系在训练神经对话模型中影响力的方法，称为指数最大平均治疗效应(ExMATE)。为了评估在对话生成中考虑因果关系的需求，我们利用不同的模型、推理和训练方法在CausalDialogue数据集上构建了一个全面的基准测试。",
    "tldr": "本研究通过建立CausalDialogue数据集并提出了ExMATE方法来模拟对话中话语级的因果关系，并表明传统的损失函数难以整合有向无环图结构。研究结果为训练神经对话模型提供了一种增强因果关系影响力的方法。"
}