{
    "title": "PAC-Bayesian Treatment Allocation Under Budget Constraints. (arXiv:2212.09007v2 [econ.EM] UPDATED)",
    "abstract": "This paper considers the estimation of treatment assignment rules when the policy maker faces a general budget or resource constraint. Utilizing the PAC-Bayesian framework, we propose new treatment assignment rules that allow for flexible notions of treatment outcome, treatment cost, and a budget constraint. For example, the constraint setting allows for cost-savings, when the costs of non-treatment exceed those of treatment for a subpopulation, to be factored into the budget. It also accommodates simpler settings, such as quantity constraints, and doesn't require outcome responses and costs to have the same unit of measurement. Importantly, the approach accounts for settings where budget or resource limitations may preclude treating all that can benefit, where costs may vary with individual characteristics, and where there may be uncertainty regarding the cost of treatment rules of interest. Despite the nomenclature, our theoretical analysis examines frequentist properties of the prop",
    "link": "http://arxiv.org/abs/2212.09007",
    "context": "Title: PAC-Bayesian Treatment Allocation Under Budget Constraints. (arXiv:2212.09007v2 [econ.EM] UPDATED)\nAbstract: This paper considers the estimation of treatment assignment rules when the policy maker faces a general budget or resource constraint. Utilizing the PAC-Bayesian framework, we propose new treatment assignment rules that allow for flexible notions of treatment outcome, treatment cost, and a budget constraint. For example, the constraint setting allows for cost-savings, when the costs of non-treatment exceed those of treatment for a subpopulation, to be factored into the budget. It also accommodates simpler settings, such as quantity constraints, and doesn't require outcome responses and costs to have the same unit of measurement. Importantly, the approach accounts for settings where budget or resource limitations may preclude treating all that can benefit, where costs may vary with individual characteristics, and where there may be uncertainty regarding the cost of treatment rules of interest. Despite the nomenclature, our theoretical analysis examines frequentist properties of the prop",
    "path": "papers/22/12/2212.09007.json",
    "total_tokens": 970,
    "translated_title": "PAC-Bayesian治疗分配在预算约束下的应用",
    "translated_abstract": "本文考虑了在政策制定者面临一般的预算或资源约束时，治疗分配规则的估计。利用PAC-Bayesian框架，我们提出了新的治疗分配规则，允许灵活的治疗结果观念、治疗费用和预算约束。例如，约束设置允许成本节省，当未治疗的成本超过了一个子群体的治疗成本时，可以将其纳入预算考虑。它还适用于更简单的设置，如数量约束，并不要求结果反应和成本具有相同的测量单位。重要的是，该方法解决了预算或资源限制可能阻止所有受益者得到治疗，成本可能随个体特征而变化，以及可能存在对感兴趣治疗规则的成本不确定性的情况。尽管是术语，但我们的理论分析着眼于所提出方法的频率属性。我们针对治疗分配规则的外样本性能提供有限样本保证并在实际数据上验证了该方法。",
    "tldr": "本研究提出一种基于PAC-Bayesian框架的治疗分配规则，能够在预算约束下灵活考虑治疗结果和治疗费用等因素，并能应对成本不确定性等实际问题，该方法在实际数据上得到了验证。"
}