{
    "title": "StyleGAN as a Utility-Preserving Face De-identification Method. (arXiv:2212.02611v2 [cs.CV] UPDATED)",
    "abstract": "Face de-identification methods have been proposed to preserve users' privacy by obscuring their faces. These methods, however, can degrade the quality of photos, and they usually do not preserve the utility of faces, i.e., their age, gender, pose, and facial expression. Recently, GANs, such as StyleGAN, have been proposed, which generate realistic, high-quality imaginary faces. In this paper, we investigate the use of StyleGAN in generating de-identified faces through style mixing. We examined this de-identification method for preserving utility and privacy by implementing several face detection, verification, and identification attacks and conducting a user study. The results from our extensive experiments, human evaluation, and comparison with two state-of-the-art methods, i.e., CIAGAN and DeepPrivacy, show that StyleGAN performs on par or better than these methods, preserving users' privacy and images' utility. In particular, the results of the machine learning-based experiments sho",
    "link": "http://arxiv.org/abs/2212.02611",
    "context": "Title: StyleGAN as a Utility-Preserving Face De-identification Method. (arXiv:2212.02611v2 [cs.CV] UPDATED)\nAbstract: Face de-identification methods have been proposed to preserve users' privacy by obscuring their faces. These methods, however, can degrade the quality of photos, and they usually do not preserve the utility of faces, i.e., their age, gender, pose, and facial expression. Recently, GANs, such as StyleGAN, have been proposed, which generate realistic, high-quality imaginary faces. In this paper, we investigate the use of StyleGAN in generating de-identified faces through style mixing. We examined this de-identification method for preserving utility and privacy by implementing several face detection, verification, and identification attacks and conducting a user study. The results from our extensive experiments, human evaluation, and comparison with two state-of-the-art methods, i.e., CIAGAN and DeepPrivacy, show that StyleGAN performs on par or better than these methods, preserving users' privacy and images' utility. In particular, the results of the machine learning-based experiments sho",
    "path": "papers/22/12/2212.02611.json",
    "total_tokens": 889,
    "translated_title": "StyleGAN作为一种保持实用性的人脸去识别方法",
    "translated_abstract": "人脸去识别方法被提出来通过模糊人脸来保护用户的隐私。然而，这些方法会降低照片的质量，并且通常不能保持人脸的实用性，即年龄、性别、姿势和表情。最近，提出了一种名为StyleGAN的GAN模型，它可以生成逼真高质量的虚拟人脸。本文通过风格混合来研究StyleGAN在生成去识别人脸方面的应用。我们通过实施多种人脸检测、验证和识别攻击，并进行用户研究来评估这种去识别方法的实用性和隐私保护效果。我们广泛的实验、人工评估和与CIAGAN和DeepPrivacy两种最先进方法的比较结果显示，StyleGAN在保护用户隐私和图片实用性方面表现出色甚至更好。特别是，基于机器学习的实验结果显示……",
    "tldr": "本文研究了使用StyleGAN生成去识别人脸的方法，通过风格混合，StyleGAN能够在保护用户隐私的同时保持图像的实用性，与其他两种最先进的方法相比表现出色。"
}