{
    "title": "Causal Inference via Style Transfer for Out-of-distribution Generalisation. (arXiv:2212.03063v2 [cs.CV] UPDATED)",
    "abstract": "Out-of-distribution (OOD) generalisation aims to build a model that can generalise well on an unseen target domain using knowledge from multiple source domains. To this end, the model should seek the causal dependence between inputs and labels, which may be determined by the semantics of inputs and remain invariant across domains. However, statistical or non-causal methods often cannot capture this dependence and perform poorly due to not considering spurious correlations learnt from model training via unobserved confounders. A well-known existing causal inference method like back-door adjustment cannot be applied to remove spurious correlations as it requires the observation of confounders. In this paper, we propose a novel method that effectively deals with hidden confounders by successfully implementing front-door adjustment (FA). FA requires the choice of a mediator, which we regard as the semantic information of images that helps access the causal mechanism without the need for ob",
    "link": "http://arxiv.org/abs/2212.03063",
    "context": "Title: Causal Inference via Style Transfer for Out-of-distribution Generalisation. (arXiv:2212.03063v2 [cs.CV] UPDATED)\nAbstract: Out-of-distribution (OOD) generalisation aims to build a model that can generalise well on an unseen target domain using knowledge from multiple source domains. To this end, the model should seek the causal dependence between inputs and labels, which may be determined by the semantics of inputs and remain invariant across domains. However, statistical or non-causal methods often cannot capture this dependence and perform poorly due to not considering spurious correlations learnt from model training via unobserved confounders. A well-known existing causal inference method like back-door adjustment cannot be applied to remove spurious correlations as it requires the observation of confounders. In this paper, we propose a novel method that effectively deals with hidden confounders by successfully implementing front-door adjustment (FA). FA requires the choice of a mediator, which we regard as the semantic information of images that helps access the causal mechanism without the need for ob",
    "path": "papers/22/12/2212.03063.json",
    "total_tokens": 875,
    "translated_title": "风格转移用于因果推断，实现领域外泛化",
    "translated_abstract": "领域外泛化旨在构建一个模型，该模型可以使用多个源领域的知识，在未见目标领域上实现良好的泛化。为此，模型应寻求输入和标签之间因果依赖性，该依赖性可能由输入的语义决定，并在多个领域中保持不变。然而，统计或非因果方法通常无法捕捉到这种依赖性，并因未考虑由未观测到的混淆因素学习的表观相关性而表现不佳。现有的众所周知的因果推断方法，如后门调整，无法应用于消除表观相关性，因为它需要观察混淆因素。在本文中，我们提出了一种新方法，该方法通过成功实现前门调整（FA）有效地处理隐藏的混淆因素。FA需要选择一个中介人，我们认为这个中介人是图像的语义信息，它有助于不需要观察混淆因素，就能访问因果机制。",
    "tldr": "本文提出一种基于风格转移的方法，使用前门调整来解决因果推断中存在的混淆因素，实现领域外泛化。",
    "en_tdlr": "This paper proposes a style transfer-based method that uses front-door adjustment to address the confounding factors in causal inference and achieve out-of-distribution generalisation."
}