{
    "title": "Breaking Down the Lockdown: The Causal Effects of Stay-At-Home Mandates on Uncertainty and Sentiments During the COVID-19 Pandemic. (arXiv:2212.01705v3 [stat.AP] UPDATED)",
    "abstract": "We study the causal effects of lockdown measures on uncertainty and sentiment on Twitter. To this end, we exploit the quasi-experimental framework created by the first COVID-19 lockdown in a high-income economy--the unexpected Italian lockdown in February 2020. We measure changes in public sentiment using deep learning and dictionary-based methods on the text of daily tweets geolocated within and near the locked-down areas, before and after the treatment. We classify tweets into four categories--economics, health, politics, and lockdown policy--to examine how the policy affected emotions heterogeneously. Using a staggered difference-in-differences approach, we show that the lockdown did not have a significantly robust impact on economic uncertainty and sentiment. However, the policy came at the price of higher uncertainty on health and politics and more negative political sentiments. These results, which are robust to a battery of robustness tests, show that lockdowns have relevant non",
    "link": "http://arxiv.org/abs/2212.01705",
    "context": "Title: Breaking Down the Lockdown: The Causal Effects of Stay-At-Home Mandates on Uncertainty and Sentiments During the COVID-19 Pandemic. (arXiv:2212.01705v3 [stat.AP] UPDATED)\nAbstract: We study the causal effects of lockdown measures on uncertainty and sentiment on Twitter. To this end, we exploit the quasi-experimental framework created by the first COVID-19 lockdown in a high-income economy--the unexpected Italian lockdown in February 2020. We measure changes in public sentiment using deep learning and dictionary-based methods on the text of daily tweets geolocated within and near the locked-down areas, before and after the treatment. We classify tweets into four categories--economics, health, politics, and lockdown policy--to examine how the policy affected emotions heterogeneously. Using a staggered difference-in-differences approach, we show that the lockdown did not have a significantly robust impact on economic uncertainty and sentiment. However, the policy came at the price of higher uncertainty on health and politics and more negative political sentiments. These results, which are robust to a battery of robustness tests, show that lockdowns have relevant non",
    "path": "papers/22/12/2212.01705.json",
    "total_tokens": 928,
    "translated_title": "打破封锁：COVID-19大流行期间“居家令”对不确定性和情感的因果影响",
    "translated_abstract": "我们研究了封锁措施对推特上不确定性和情感的因果影响。我们利用第一次COVID-19封锁——意大利在2020年2月实施的意外封锁的拟实验框架。我们使用深度学习和基于词典的方法测量了在受限区域内和附近地区地理定位的每日推文的文本，以评估治疗前后公众情感的变化。我们将推文分为经济、健康、政治和封锁政策四类，以检查政策如何异质地影响情感。使用错位差分和差分方法，我们显示封锁对经济不确定性和情感没有显着的稳健影响。然而，这项政策的代价是增加了健康和政治方面的不确定性以及更消极的政治情绪。这些结果经过了一系列鲁棒性测试的验证，表明封锁措施具有重要的非",
    "tldr": "研究发现，COVID-19大流行期间“居家令”对经济不确定性和情感影响不显著，但是增加了健康和政治方面的不确定性和更消极的政治情绪。",
    "en_tdlr": "This study found that stay-at-home mandates during the COVID-19 pandemic had no significant impact on economic uncertainty and sentiment, but resulted in increased uncertainty and negative political sentiment regarding health and politics."
}