{
    "title": "Curiosity creates Diversity in Policy Search. (arXiv:2212.03530v2 [cs.NE] UPDATED)",
    "abstract": "When searching for policies, reward-sparse environments often lack sufficient information about which behaviors to improve upon or avoid. In such environments, the policy search process is bound to blindly search for reward-yielding transitions and no early reward can bias this search in one direction or another. A way to overcome this is to use intrinsic motivation in order to explore new transitions until a reward is found. In this work, we use a recently proposed definition of intrinsic motivation, Curiosity, in an evolutionary policy search method. We propose Curiosity-ES, an evolutionary strategy adapted to use Curiosity as a fitness metric. We compare Curiosity with Novelty, a commonly used diversity metric, and find that Curiosity can generate higher diversity over full episodes without the need for an explicit diversity criterion and lead to multiple policies which find reward.",
    "link": "http://arxiv.org/abs/2212.03530",
    "context": "Title: Curiosity creates Diversity in Policy Search. (arXiv:2212.03530v2 [cs.NE] UPDATED)\nAbstract: When searching for policies, reward-sparse environments often lack sufficient information about which behaviors to improve upon or avoid. In such environments, the policy search process is bound to blindly search for reward-yielding transitions and no early reward can bias this search in one direction or another. A way to overcome this is to use intrinsic motivation in order to explore new transitions until a reward is found. In this work, we use a recently proposed definition of intrinsic motivation, Curiosity, in an evolutionary policy search method. We propose Curiosity-ES, an evolutionary strategy adapted to use Curiosity as a fitness metric. We compare Curiosity with Novelty, a commonly used diversity metric, and find that Curiosity can generate higher diversity over full episodes without the need for an explicit diversity criterion and lead to multiple policies which find reward.",
    "path": "papers/22/12/2212.03530.json",
    "total_tokens": 881,
    "translated_title": "好奇心在策略搜索中促进多样性",
    "translated_abstract": "在搜索策略时，奖励稀疏的环境通常缺乏足够的信息来确定应该改进或避免的行为。在这种环境中，策略搜索过程往往会盲目地搜索产生奖励的转换，没有早期奖励可以偏向于某个方向。克服这个问题的一种方式是使用内在动机来探索新的转换，直到找到奖励。在这项工作中，我们使用了最近提出的内在动机定义——好奇心，结合进化策略搜索方法。我们提出了Curiosity-ES，一种适应于使用好奇心作为适应度度量的进化策略。我们将好奇心与常用的多样性度量指标——新颖性进行比较，并发现好奇心能够在完整的回合中生成更高的多样性，而无需明确的多样性标准，并且能够找到多种能够获得奖励的策略。",
    "tldr": "本研究使用好奇心作为内在动机，并将其应用于进化策略搜索方法中。与常用的多样性度量指标相比，好奇心能够在没有明确的多样性标准的情况下生成更高的多样性，并找到多种能够获得奖励的策略。",
    "en_tdlr": "This study uses curiosity as an intrinsic motivation and applies it to an evolutionary policy search method. Compared to commonly used diversity metrics, curiosity can generate higher diversity without an explicit diversity criterion and find multiple reward-yielding policies."
}