{
    "title": "Efficient aggregation of face embeddings for decentralized face recognition deployments (extended version). (arXiv:2212.10108v2 [cs.CR] UPDATED)",
    "abstract": "Biometrics are one of the most privacy-sensitive data. Ubiquitous authentication systems with a focus on privacy favor decentralized approaches as they reduce potential attack vectors, both on a technical and organizational level. The gold standard is to let the user be in control of where their own data is stored, which consequently leads to a high variety of devices used. Moreover, in comparison with a centralized system, designs with higher end-user freedom often incur additional network overhead. Therefore, when using face recognition for biometric authentication, an efficient way to compare faces is important in practical deployments, because it reduces both network and hardware requirements that are essential to encourage device diversity. This paper proposes an efficient way to aggregate embeddings used for face recognition based on an extensive analysis on different datasets and the use of different aggregation strategies. As part of this analysis, a new dataset has been collec",
    "link": "http://arxiv.org/abs/2212.10108",
    "context": "Title: Efficient aggregation of face embeddings for decentralized face recognition deployments (extended version). (arXiv:2212.10108v2 [cs.CR] UPDATED)\nAbstract: Biometrics are one of the most privacy-sensitive data. Ubiquitous authentication systems with a focus on privacy favor decentralized approaches as they reduce potential attack vectors, both on a technical and organizational level. The gold standard is to let the user be in control of where their own data is stored, which consequently leads to a high variety of devices used. Moreover, in comparison with a centralized system, designs with higher end-user freedom often incur additional network overhead. Therefore, when using face recognition for biometric authentication, an efficient way to compare faces is important in practical deployments, because it reduces both network and hardware requirements that are essential to encourage device diversity. This paper proposes an efficient way to aggregate embeddings used for face recognition based on an extensive analysis on different datasets and the use of different aggregation strategies. As part of this analysis, a new dataset has been collec",
    "path": "papers/22/12/2212.10108.json",
    "total_tokens": 853,
    "translated_title": "面向去中心化人脸识别部署的有效聚合面部嵌入（扩展版）",
    "translated_abstract": "生物识别是最敏感的数据之一。以隐私为重点的 ubiquitous 认证系统倾向于使用去中心化方法，因为它们减少了潜在的攻击向量，在技术和组织层面上都是如此。最理想的情况是让用户控制其数据存储的位置，这将导致使用多种设备。此外，与集中式系统相比，设计更注重用户自由的系统通常会增加额外的网络开销。因此，在使用人脸识别进行生物识别验证时，一种有效比较面部的方法在实际部署中是至关重要的，因为它可以减少网络和硬件需求，从而鼓励设备的多样性。本文提出了一种有效的方式来聚合用于人脸识别的嵌入，该方式基于对不同数据集和使用不同聚合策略的广泛分析。作为分析的一部分，还收集了一个新的数据集。",
    "tldr": "本文提出了一种在去中心化人脸识别部署中有效聚合面部嵌入的方式，旨在减少网络和硬件需求以鼓励设备多样性。",
    "en_tdlr": "This paper proposes an efficient way to aggregate embeddings used for face recognition in decentralized deployments, aiming to reduce network and hardware requirements to encourage device diversity."
}