{
    "title": "A Survey on Natural Language Processing for Programming. (arXiv:2212.05773v2 [cs.CL] UPDATED)",
    "abstract": "Natural language processing for programming aims to use NLP techniques to assist programming. It is increasingly prevalent for its effectiveness in improving productivity. Distinct from natural language, a programming language is highly structured and functional. Constructing a structure-based representation and a functionality-oriented algorithm is at the heart of program understanding and generation. In this paper, we conduct a systematic review covering tasks, datasets, evaluation methods, techniques, and models from the perspective of the structure-based and functionality-oriented property, aiming to understand the role of the two properties in each component. Based on the analysis, we illustrate unexplored areas and suggest potential directions for future work.",
    "link": "http://arxiv.org/abs/2212.05773",
    "context": "Title: A Survey on Natural Language Processing for Programming. (arXiv:2212.05773v2 [cs.CL] UPDATED)\nAbstract: Natural language processing for programming aims to use NLP techniques to assist programming. It is increasingly prevalent for its effectiveness in improving productivity. Distinct from natural language, a programming language is highly structured and functional. Constructing a structure-based representation and a functionality-oriented algorithm is at the heart of program understanding and generation. In this paper, we conduct a systematic review covering tasks, datasets, evaluation methods, techniques, and models from the perspective of the structure-based and functionality-oriented property, aiming to understand the role of the two properties in each component. Based on the analysis, we illustrate unexplored areas and suggest potential directions for future work.",
    "path": "papers/22/12/2212.05773.json",
    "total_tokens": 748,
    "translated_title": "自然语言处理在编程中的应用综述",
    "translated_abstract": "自然语言处理在编程中的应用旨在利用NLP技术来辅助编程。它因提高生产力的有效性而日益普遍。编程语言与自然语言不同，它具有高度结构化和功能性。构建基于结构的表示和功能导向的算法是程序理解和生成的核心。在本文中，我们从结构化和功能导向的属性的角度进行系统综述，涵盖任务、数据集、评估方法、技术和模型，旨在了解每个组件中这两个属性的作用。基于分析，我们阐述了未被开发的领域，并提出了未来工作的潜在方向。",
    "tldr": "本文通过系统综述，从结构化和功能导向的属性的角度，涵盖了自然语言处理在编程中的应用领域的任务、数据集、评估方法、技术和模型，揭示了它们在程序理解和生成方面的作用，并提出了未来工作的潜在方向。",
    "en_tdlr": "This paper presents a systematic review of natural language processing for programming, covering tasks, datasets, evaluation methods, techniques, and models. It highlights the role of structure-based and functionality-oriented properties in program understanding and generation, and proposes potential directions for future work."
}