{
    "title": "Few-shot human motion prediction for heterogeneous sensors. (arXiv:2212.11771v2 [cs.LG] UPDATED)",
    "abstract": "Human motion prediction is a complex task as it involves forecasting variables over time on a graph of connected sensors. This is especially true in the case of few-shot learning, where we strive to forecast motion sequences for previously unseen actions based on only a few examples. Despite this, almost all related approaches for few-shot motion prediction do not incorporate the underlying graph, while it is a common component in classical motion prediction. Furthermore, state-of-the-art methods for few-shot motion prediction are restricted to motion tasks with a fixed output space meaning these tasks are all limited to the same sensor graph. In this work, we propose to extend recent works on few-shot time-series forecasting with heterogeneous attributes with graph neural networks to introduce the first few-shot motion approach that explicitly incorporates the spatial graph while also generalizing across motion tasks with heterogeneous sensors. In our experiments on motion tasks with ",
    "link": "http://arxiv.org/abs/2212.11771",
    "context": "Title: Few-shot human motion prediction for heterogeneous sensors. (arXiv:2212.11771v2 [cs.LG] UPDATED)\nAbstract: Human motion prediction is a complex task as it involves forecasting variables over time on a graph of connected sensors. This is especially true in the case of few-shot learning, where we strive to forecast motion sequences for previously unseen actions based on only a few examples. Despite this, almost all related approaches for few-shot motion prediction do not incorporate the underlying graph, while it is a common component in classical motion prediction. Furthermore, state-of-the-art methods for few-shot motion prediction are restricted to motion tasks with a fixed output space meaning these tasks are all limited to the same sensor graph. In this work, we propose to extend recent works on few-shot time-series forecasting with heterogeneous attributes with graph neural networks to introduce the first few-shot motion approach that explicitly incorporates the spatial graph while also generalizing across motion tasks with heterogeneous sensors. In our experiments on motion tasks with ",
    "path": "papers/22/12/2212.11771.json",
    "total_tokens": 782,
    "translated_title": "异构传感器情境下的少样本人体运动预测",
    "translated_abstract": "人体运动预测是一项复杂的任务，因为它涉及在连接的传感器图中预测随时间变化的变量。本文提出了一种利用图神经网络扩展具有异构属性的少样本时间序列预测方法，来明确纳入空间图，同时跨越具有异构传感器的两个运动任务中进行预测时表现出色。",
    "tldr": "本研究提出了一种扩展时间序列预测方法来考虑异构传感器对人体运动预测的影响，并成功将其应用于不同传感器情境下的少样本有限运动任务中。"
}