{
    "title": "COmic: Convolutional Kernel Networks for Interpretable End-to-End Learning on (Multi-)Omics Data. (arXiv:2212.02504v2 [q-bio.QM] UPDATED)",
    "abstract": "Motivation: The size of available omics datasets is steadily increasing with technological advancement in recent years. While this increase in sample size can be used to improve the performance of relevant prediction tasks in healthcare, models that are optimized for large datasets usually operate as black boxes. In high stakes scenarios, like healthcare, using a black-box model poses safety and security issues. Without an explanation about molecular factors and phenotypes that affected the prediction, healthcare providers are left with no choice but to blindly trust the models. We propose a new type of artificial neural network, named Convolutional Omics Kernel Network (COmic). By combining convolutional kernel networks with pathway-induced kernels, our method enables robust and interpretable end-to-end learning on omics datasets ranging in size from a few hundred to several hundreds of thousands of samples. Furthermore, COmic can be easily adapted to utilize multi-omics data.  Result",
    "link": "http://arxiv.org/abs/2212.02504",
    "context": "Title: COmic: Convolutional Kernel Networks for Interpretable End-to-End Learning on (Multi-)Omics Data. (arXiv:2212.02504v2 [q-bio.QM] UPDATED)\nAbstract: Motivation: The size of available omics datasets is steadily increasing with technological advancement in recent years. While this increase in sample size can be used to improve the performance of relevant prediction tasks in healthcare, models that are optimized for large datasets usually operate as black boxes. In high stakes scenarios, like healthcare, using a black-box model poses safety and security issues. Without an explanation about molecular factors and phenotypes that affected the prediction, healthcare providers are left with no choice but to blindly trust the models. We propose a new type of artificial neural network, named Convolutional Omics Kernel Network (COmic). By combining convolutional kernel networks with pathway-induced kernels, our method enables robust and interpretable end-to-end learning on omics datasets ranging in size from a few hundred to several hundreds of thousands of samples. Furthermore, COmic can be easily adapted to utilize multi-omics data.  Result",
    "path": "papers/22/12/2212.02504.json",
    "total_tokens": 846,
    "translated_title": "COmic：用于（多）组学数据解释性端到端学习的卷积核网络",
    "translated_abstract": "随着近年来技术的进步，可用组学数据集的大小稳步增加。虽然这种样本量的增加可以用于改善医疗保健中相关预测任务的性能，但针对大型数据集优化的模型通常作为黑盒操作。在高风险场景（如医疗保健）中，使用黑盒模型会带来安全和保密问题。如果没有关于影响预测的分子因素和表型的解释，保健提供者只能盲目信任模型。我们提出了一种新的人工神经网络类型，名为卷积组学核网络（COmic）。通过将卷积核网络与通路诱导核相结合，我们的方法实现了在从几百个到几十万个样本的组学数据集上稳健和可解释的端到端学习。此外，COmic可以轻松适应多组学数据。",
    "tldr": "COmic是一种结合了卷积核网络和通路诱导核的人工神经网络，用于（多）组学数据的稳健和可解释的端到端学习。",
    "en_tdlr": "COmic is an artificial neural network that combines convolutional kernel networks with pathway-induced kernels for robust and interpretable end-to-end learning on (multi-)omics data."
}