{
    "title": "Robust convex biclustering with a tuning-free method. (arXiv:2212.03122v3 [stat.ME] UPDATED)",
    "abstract": "Biclustering is widely used in different kinds of fields including gene information analysis, text mining, and recommendation system by effectively discovering the local correlation between samples and features. However, many biclustering algorithms will collapse when facing heavy-tailed data. In this paper, we propose a robust version of convex biclustering algorithm with Huber loss. Yet, the newly introduced robustification parameter brings an extra burden to selecting the optimal parameters. Therefore, we propose a tuning-free method for automatically selecting the optimal robustification parameter with high efficiency. The simulation study demonstrates the more fabulous performance of our proposed method than traditional biclustering methods when encountering heavy-tailed noise. A real-life biomedical application is also presented. The R package RcvxBiclustr is available at https://github.com/YifanChen3/RcvxBiclustr.",
    "link": "http://arxiv.org/abs/2212.03122",
    "context": "Title: Robust convex biclustering with a tuning-free method. (arXiv:2212.03122v3 [stat.ME] UPDATED)\nAbstract: Biclustering is widely used in different kinds of fields including gene information analysis, text mining, and recommendation system by effectively discovering the local correlation between samples and features. However, many biclustering algorithms will collapse when facing heavy-tailed data. In this paper, we propose a robust version of convex biclustering algorithm with Huber loss. Yet, the newly introduced robustification parameter brings an extra burden to selecting the optimal parameters. Therefore, we propose a tuning-free method for automatically selecting the optimal robustification parameter with high efficiency. The simulation study demonstrates the more fabulous performance of our proposed method than traditional biclustering methods when encountering heavy-tailed noise. A real-life biomedical application is also presented. The R package RcvxBiclustr is available at https://github.com/YifanChen3/RcvxBiclustr.",
    "path": "papers/22/12/2212.03122.json",
    "total_tokens": 797,
    "translated_title": "鲁棒的凸二聚类方法中使用了无需调参的方法",
    "translated_abstract": "二聚类广泛应用于基因信息分析、文本挖掘和推荐系统等领域，通过有效地发现样本和特征之间的局部相关性。然而，许多二聚类算法在面对重尾数据时容易崩溃。本文提出了一个鲁棒的凸二聚类算法，使用了Huber损失函数。然而，新引入的鲁棒化参数会增加选择最佳参数的额外负担。因此，我们提出了一种无需调参的方法，实现自动选择最佳的鲁棒化参数，并具有高效性。模拟研究表明，我们提出的方法在面对重尾噪声时比传统的二聚类方法表现更好。同时，还提供了一个真实生物医学应用示例。R包RcvxBiclustr可在https://github.com/YifanChen3/RcvxBiclustr 上获取。",
    "tldr": "本文提出了一个鲁棒的凸二聚类算法，使用了无需调参的方法，该算法在面对重尾数据时表现出更好的性能。",
    "en_tdlr": "This paper proposes a robust convex biclustering algorithm with a tuning-free method, which performs better when facing heavy-tailed data."
}