{
    "title": "Delving into Semantic Scale Imbalance. (arXiv:2212.14613v8 [cs.CV] UPDATED)",
    "abstract": "Model bias triggered by long-tailed data has been widely studied. However, measure based on the number of samples cannot explicate three phenomena simultaneously: (1) Given enough data, the classification performance gain is marginal with additional samples. (2) Classification performance decays precipitously as the number of training samples decreases when there is insufficient data. (3) Model trained on sample-balanced datasets still has different biases for different classes. In this work, we define and quantify the semantic scale of classes, which is used to measure the feature diversity of classes. It is exciting to find experimentally that there is a marginal effect of semantic scale, which perfectly describes the first two phenomena. Further, the quantitative measurement of semantic scale imbalance is proposed, which can accurately reflect model bias on multiple datasets, even on sample-balanced data, revealing a novel perspective for the study of class imbalance. Due to the pre",
    "link": "http://arxiv.org/abs/2212.14613",
    "context": "Title: Delving into Semantic Scale Imbalance. (arXiv:2212.14613v8 [cs.CV] UPDATED)\nAbstract: Model bias triggered by long-tailed data has been widely studied. However, measure based on the number of samples cannot explicate three phenomena simultaneously: (1) Given enough data, the classification performance gain is marginal with additional samples. (2) Classification performance decays precipitously as the number of training samples decreases when there is insufficient data. (3) Model trained on sample-balanced datasets still has different biases for different classes. In this work, we define and quantify the semantic scale of classes, which is used to measure the feature diversity of classes. It is exciting to find experimentally that there is a marginal effect of semantic scale, which perfectly describes the first two phenomena. Further, the quantitative measurement of semantic scale imbalance is proposed, which can accurately reflect model bias on multiple datasets, even on sample-balanced data, revealing a novel perspective for the study of class imbalance. Due to the pre",
    "path": "papers/22/12/2212.14613.json",
    "total_tokens": 969,
    "tldr": "本论文提出了语义尺度不平衡的概念，并通过量化衡量类别的特征多样性来解释长尾数据中存在的三个现象。该研究进一步提出了语义尺度不平衡的定量度量方法，可以精确地反映模型对多个数据集的偏差，甚至在样本平衡的数据上，揭示了类别不平衡研究的新视角。"
}