{
    "title": "Learning to Bound Counterfactual Inference from Observational, Biased and Randomised Data. (arXiv:2212.02932v2 [cs.AI] UPDATED)",
    "abstract": "We address the problem of integrating data from multiple, possibly biased, observational and interventional studies, to eventually compute counterfactuals in structural causal models. We start from the case of a single observational dataset affected by a selection bias. We show that the likelihood of the available data has no local maxima. This enables us to use the causal expectation-maximisation scheme to compute approximate bounds for partially identifiable counterfactual queries, which are the focus of this paper. We then show how the same approach can solve the general case of multiple datasets, no matter whether interventional or observational, biased or unbiased, by remapping it into the former one via graphical transformations. Systematic numerical experiments and a case study on palliative care show the effectiveness and accuracy of our approach, while hinting at the benefits of integrating heterogeneous data to get informative bounds in case of partial identifiability.",
    "link": "http://arxiv.org/abs/2212.02932",
    "context": "Title: Learning to Bound Counterfactual Inference from Observational, Biased and Randomised Data. (arXiv:2212.02932v2 [cs.AI] UPDATED)\nAbstract: We address the problem of integrating data from multiple, possibly biased, observational and interventional studies, to eventually compute counterfactuals in structural causal models. We start from the case of a single observational dataset affected by a selection bias. We show that the likelihood of the available data has no local maxima. This enables us to use the causal expectation-maximisation scheme to compute approximate bounds for partially identifiable counterfactual queries, which are the focus of this paper. We then show how the same approach can solve the general case of multiple datasets, no matter whether interventional or observational, biased or unbiased, by remapping it into the former one via graphical transformations. Systematic numerical experiments and a case study on palliative care show the effectiveness and accuracy of our approach, while hinting at the benefits of integrating heterogeneous data to get informative bounds in case of partial identifiability.",
    "path": "papers/22/12/2212.02932.json",
    "total_tokens": 937,
    "translated_title": "从观测、有偏和随机数据中学习边界反事实推断",
    "translated_abstract": "我们解决了将来自多个可能有偏见的观测和干预研究的数据集集成起来，最终计算结构性因果模型中的反事实的问题。我们从具有选择偏差的单个观测数据集开始。我们证明了可用数据的似然函数没有局部最大值。这使我们能够使用因果期望最大化方案计算部分可识别反事实查询的近似边界，这是本文的重点。然后我们展示了如何通过图形变换将通用的多个数据集（无论是干预还是观测数据，有偏或无偏）映射到前者从而解决同样的问题。系统的数字实验和对姑息治疗的案例研究展示了我们方法的效果和准确性，同时也提示在部分可识别性的情况下，整合异构数据以获得信息丰富的边界的好处。",
    "tldr": "本文提出了从多个可能有偏见的观测和干预研究的数据集中计算结构性因果模型中的反事实的方法，并通过图形转换解决了通用的多个数据集的问题。实验证明了该方法的效果和准确性，同时也提示整合异构数据以获得信息丰富的边界的好处。",
    "en_tdlr": "This paper proposes a method to compute counterfactuals in structural causal models from multiple possibly biased observational and interventional studies and solves the general case of multiple datasets via graphical transformations. The effectiveness and accuracy of the approach are demonstrated by numerical experiments and a case study on palliative care, indicating the benefits of integrating heterogeneous data for informative bounds in case of partial identifiability."
}