{
    "title": "Quantum-Inspired Tensor Neural Networks for Option Pricing",
    "abstract": "arXiv:2212.14076v2 Announce Type: replace-cross  Abstract: Recent advances in deep learning have enabled us to address the curse of dimensionality (COD) by solving problems in higher dimensions. A subset of such approaches of addressing the COD has led us to solving high-dimensional PDEs. This has resulted in opening doors to solving a variety of real-world problems ranging from mathematical finance to stochastic control for industrial applications. Although feasible, these deep learning methods are still constrained by training time and memory. Tackling these shortcomings, Tensor Neural Networks (TNN) demonstrate that they can provide significant parameter savings while attaining the same accuracy as compared to the classical Dense Neural Network (DNN). In addition, we also show how TNN can be trained faster than DNN for the same accuracy. Besides TNN, we also introduce Tensor Network Initializer (TNN Init), a weight initialization scheme that leads to faster convergence with smaller ",
    "link": "https://arxiv.org/abs/2212.14076",
    "context": "Title: Quantum-Inspired Tensor Neural Networks for Option Pricing\nAbstract: arXiv:2212.14076v2 Announce Type: replace-cross  Abstract: Recent advances in deep learning have enabled us to address the curse of dimensionality (COD) by solving problems in higher dimensions. A subset of such approaches of addressing the COD has led us to solving high-dimensional PDEs. This has resulted in opening doors to solving a variety of real-world problems ranging from mathematical finance to stochastic control for industrial applications. Although feasible, these deep learning methods are still constrained by training time and memory. Tackling these shortcomings, Tensor Neural Networks (TNN) demonstrate that they can provide significant parameter savings while attaining the same accuracy as compared to the classical Dense Neural Network (DNN). In addition, we also show how TNN can be trained faster than DNN for the same accuracy. Besides TNN, we also introduce Tensor Network Initializer (TNN Init), a weight initialization scheme that leads to faster convergence with smaller ",
    "path": "papers/22/12/2212.14076.json",
    "total_tokens": 848,
    "translated_title": "量子启发的张量神经网络用于期权定价",
    "translated_abstract": "深度学习的最新进展使我们能够通过在更高维度解决问题来解决维度诅咒（COD）。解决COD的这类方法之一导致我们解决高维PDE问题。这已经为解决从数学金融到工业应用中的随机控制等各种实际问题敞开了大门。尽管可行，但这些深度学习方法仍受到训练时间和内存的限制。Tensor神经网络（TNN）解决了这些缺点，它们证明可以在获得与经典密集神经网络（DNN）相同精度的情况下提供显著的参数节省。此外，我们还展示了相比DNN，TNN的训练速度更快，除了TNN，我们还介绍了张量网络初始化器（TNN Init），这是一种权重初始化方案，可以实现更快的收敛速度和更小的",
    "tldr": "引入了Tensor神经网络（TNN）和张量网络初始化器（TNN Init），TNN可以在获得与DNN相同精度的情况下提供显著的参数节省，并展示了训练速度更快的优点。",
    "en_tdlr": "Introducing Tensor Neural Networks (TNN) and Tensor Network Initializer (TNN Init), TNN offers significant parameter savings while attaining the same accuracy as DNN and demonstrates faster training speed."
}