{
    "title": "The quintic Ornstein-Uhlenbeck volatility model that jointly calibrates SPX & VIX smiles. (arXiv:2212.10917v2 [q-fin.MF] UPDATED)",
    "abstract": "The quintic Ornstein-Uhlenbeck volatility model is a stochastic volatility model where the volatility process is a polynomial function of degree five of a single Ornstein-Uhlenbeck process with fast mean reversion and large vol-of-vol. The model is able to achieve remarkable joint fits of the SPX-VIX smiles with only 6 effective parameters and an input curve that allows to match certain term structures. We provide several practical specifications of the input curve, study their impact on the joint calibration problem and consider additionally time-dependent parameters to help achieve better fits for longer maturities going beyond 1 year. Even better, the model remains very simple and tractable for pricing and calibration: the VIX squared is again polynomial in the Ornstein-Uhlenbeck process, leading to efficient VIX derivative pricing by a simple integration against a Gaussian density; simulation of the volatility process is exact; and pricing SPX products derivatives can be done effic",
    "link": "http://arxiv.org/abs/2212.10917",
    "context": "Title: The quintic Ornstein-Uhlenbeck volatility model that jointly calibrates SPX & VIX smiles. (arXiv:2212.10917v2 [q-fin.MF] UPDATED)\nAbstract: The quintic Ornstein-Uhlenbeck volatility model is a stochastic volatility model where the volatility process is a polynomial function of degree five of a single Ornstein-Uhlenbeck process with fast mean reversion and large vol-of-vol. The model is able to achieve remarkable joint fits of the SPX-VIX smiles with only 6 effective parameters and an input curve that allows to match certain term structures. We provide several practical specifications of the input curve, study their impact on the joint calibration problem and consider additionally time-dependent parameters to help achieve better fits for longer maturities going beyond 1 year. Even better, the model remains very simple and tractable for pricing and calibration: the VIX squared is again polynomial in the Ornstein-Uhlenbeck process, leading to efficient VIX derivative pricing by a simple integration against a Gaussian density; simulation of the volatility process is exact; and pricing SPX products derivatives can be done effic",
    "path": "papers/22/12/2212.10917.json",
    "total_tokens": 928,
    "translated_title": "联合校准SPX和VIX smiles的五次Ornstein-Uhlenbeck波动率模型",
    "translated_abstract": "五次Ornstein-Uhlenbeck波动率模型是一种随机波动率模型，其中波动率过程是单个具有快速均值回归和大波动率的五次代数函数的Ornstein-Uhlenbeck过程。该模型只使用6个有效参数和一个输入曲线即可实现SPX-VIX smiles的显著联合拟合，该输入曲线允许匹配某些期限结构。我们提供了输入曲线的几个实际规格，研究了它们对联合校准问题的影响，并考虑时间相关参数以帮助更好地拟合超过1年的较长到期日。更好的是，该模型仍然非常简单和易于处理：VIX平方再次是Ornstein-Uhlenbeck过程的多项式，通过对高斯密度的简单积分实现了高效的VIX衍生品定价；波动性过程的模拟是精确的；并且SPX产品衍生品的定价可以有效地完成。",
    "tldr": "五次Ornstein-Uhlenbeck波动率模型可以联合拟合SPX和VIX smiles，并且只需使用6个参数和一个输入曲线即可实现。模型非常简单和易于处理，能够实现精确的波动率过程模拟和高效的衍生品定价。",
    "en_tdlr": "The quintic Ornstein-Uhlenbeck volatility model is capable of jointly fitting the SPX-VIX smiles with only 6 parameters and an input curve. The model is simple and tractable, allowing for accurate simulation of volatility and efficient pricing of derivatives."
}