{
    "title": "Robust Design and Evaluation of Predictive Algorithms under Unobserved Confounding. (arXiv:2212.09844v4 [econ.EM] UPDATED)",
    "abstract": "Predictive algorithms inform consequential decisions in settings where the outcome is selectively observed given some choices made by human decision makers. There often exists unobserved confounders that affected the decision maker's choice and the outcome. We propose a unified methodology for the robust design and evaluation of predictive algorithms in selectively observed data under such unobserved confounding. Our approach imposes general assumptions on how much the outcome may vary on average between unselected and selected units conditional on observed covariates and identified nuisance parameters, formalizing popular empirical strategies for imputing missing data such as proxy outcomes and instrumental variables. We develop debiased machine learning estimators for the bounds on a large class of predictive performance estimands, such as the conditional likelihood of the outcome, a predictive algorithm's mean square error, true/false positive rate, and many others, under these assu",
    "link": "http://arxiv.org/abs/2212.09844",
    "context": "Title: Robust Design and Evaluation of Predictive Algorithms under Unobserved Confounding. (arXiv:2212.09844v4 [econ.EM] UPDATED)\nAbstract: Predictive algorithms inform consequential decisions in settings where the outcome is selectively observed given some choices made by human decision makers. There often exists unobserved confounders that affected the decision maker's choice and the outcome. We propose a unified methodology for the robust design and evaluation of predictive algorithms in selectively observed data under such unobserved confounding. Our approach imposes general assumptions on how much the outcome may vary on average between unselected and selected units conditional on observed covariates and identified nuisance parameters, formalizing popular empirical strategies for imputing missing data such as proxy outcomes and instrumental variables. We develop debiased machine learning estimators for the bounds on a large class of predictive performance estimands, such as the conditional likelihood of the outcome, a predictive algorithm's mean square error, true/false positive rate, and many others, under these assu",
    "path": "papers/22/12/2212.09844.json",
    "total_tokens": 909,
    "translated_title": "在未观察到的混淆下，预测算法的鲁棒设计和评估",
    "translated_abstract": "预测算法在人类决策者作出选择后选择性地观察到结果的情境中进行重要决策。通常存在着未观察到的混淆因素影响决策者的选择和结果。我们提出了一种统一的方法，用于在存在未观察到的混淆数据下对预测算法进行鲁棒设计和评估。我们的方法对于预测算法的条件平均结果在已观察到的协变量和已识别的干扰参数上可能的变化程度提出了一般性的假设，从而形式化了用于填充缺失数据的常用实证策略，如代理结果和工具变量。我们开发了去偏倚的机器学习估计器，用于对大类预测性能估计量的边界，例如结果的条件似然、预测算法的均方误差、真/假阳性率等等。",
    "tldr": "本文提出了一种统一的方法来设计和评估在存在未观察到的混淆数据中的预测算法，通过对预测性能估计量的边界进行去偏倚的机器学习估计，从而解决了预测算法在选择性观察情境中的问题。",
    "en_tdlr": "This paper proposes a unified methodology for the robust design and evaluation of predictive algorithms under unobserved confounding. It addresses the issue of selectively observed data by developing debiased machine learning estimators for predictive performance estimands, providing bounds on various performance metrics, such as mean square error and true/false positive rates."
}