{
    "title": "Probabilistic Symmetry for Multi-Agent Dynamics. (arXiv:2205.01927v3 [cs.LG] UPDATED)",
    "abstract": "Learning multi-agent dynamics is a core AI problem with broad applications in robotics and autonomous driving. While most existing works focus on deterministic prediction, producing probabilistic forecasts to quantify uncertainty and assess risks is critical for downstream decision-making tasks such as motion planning and collision avoidance. Multi-agent dynamics often contains internal symmetry. By leveraging symmetry, specifically rotation equivariance, we can improve not only the prediction accuracy but also uncertainty calibration. We introduce Energy Score, a proper scoring rule, to evaluate probabilistic predictions. We propose a novel deep dynamics model, Probabilistic Equivariant Continuous COnvolution (PECCO) for probabilistic prediction of multi-agent trajectories. PECCO extends equivariant continuous convolution to model the joint velocity distribution of multiple agents. It uses dynamics integration to propagate the uncertainty from velocity to position. On both synthetic a",
    "link": "http://arxiv.org/abs/2205.01927",
    "context": "Title: Probabilistic Symmetry for Multi-Agent Dynamics. (arXiv:2205.01927v3 [cs.LG] UPDATED)\nAbstract: Learning multi-agent dynamics is a core AI problem with broad applications in robotics and autonomous driving. While most existing works focus on deterministic prediction, producing probabilistic forecasts to quantify uncertainty and assess risks is critical for downstream decision-making tasks such as motion planning and collision avoidance. Multi-agent dynamics often contains internal symmetry. By leveraging symmetry, specifically rotation equivariance, we can improve not only the prediction accuracy but also uncertainty calibration. We introduce Energy Score, a proper scoring rule, to evaluate probabilistic predictions. We propose a novel deep dynamics model, Probabilistic Equivariant Continuous COnvolution (PECCO) for probabilistic prediction of multi-agent trajectories. PECCO extends equivariant continuous convolution to model the joint velocity distribution of multiple agents. It uses dynamics integration to propagate the uncertainty from velocity to position. On both synthetic a",
    "path": "papers/22/05/2205.01927.json",
    "total_tokens": 889,
    "translated_title": "多智能体动力学的概率对称性",
    "translated_abstract": "学习多智能体动态是人工智能的核心问题，广泛应用于机器人和自主驾驶等领域。多数现有的研究侧重于确定性预测，而产生概率预测以量化不确定性与评估风险方面对下游决策制定任务，如运动规划与避碰至关重要。多智能体动态通常包含内部对称性。通过利用对称性，特别是旋转等变性，我们不仅可以提高预测精度，还可以改善不确定性校准。我们引入能量评分作为适当的评分规则来评估概率预测表现。我们提出了一种新颖的深度动力学模型，即概率等变连续卷积（PECCO），用于多智能体轨迹的概率预测。PECCO将等变的连续卷积扩展到多智能体的联合速度分布建模上。它使用动态积分将不确定性从速度传播到位置。我们在合成和现实场景的结果中验证了PECCO模型的性能。",
    "tldr": "该论文提出了PECCO模型，通过利用多智能体间的对称性和能量评分规则，可以更准确地预测多智能体轨迹并量化不确定性，为下游决策提供重要支持。"
}