{
    "title": "A Review and Evaluation of Elastic Distance Functions for Time Series Clustering. (arXiv:2205.15181v2 [cs.LG] UPDATED)",
    "abstract": "Time series clustering is the act of grouping time series data without recourse to a label. Algorithms that cluster time series can be classified into two groups: those that employ a time series specific distance measure; and those that derive features from time series. Both approaches usually rely on traditional clustering algorithms such as $k$-means. Our focus is on distance based time series that employ elastic distance measures, i.e. distances that perform some kind of realignment whilst measuring distance. We describe nine commonly used elastic distance measures and compare their performance with k-means and k-medoids clustering. Our findings are surprising. The most popular technique, dynamic time warping (DTW), performs worse than Euclidean distance with k-means, and even when tuned, is no better. Using k-medoids rather than k-means improved the clusterings for all nine distance measures. DTW is not significantly better than Euclidean distance with k-medoids. Generally, distanc",
    "link": "http://arxiv.org/abs/2205.15181",
    "context": "Title: A Review and Evaluation of Elastic Distance Functions for Time Series Clustering. (arXiv:2205.15181v2 [cs.LG] UPDATED)\nAbstract: Time series clustering is the act of grouping time series data without recourse to a label. Algorithms that cluster time series can be classified into two groups: those that employ a time series specific distance measure; and those that derive features from time series. Both approaches usually rely on traditional clustering algorithms such as $k$-means. Our focus is on distance based time series that employ elastic distance measures, i.e. distances that perform some kind of realignment whilst measuring distance. We describe nine commonly used elastic distance measures and compare their performance with k-means and k-medoids clustering. Our findings are surprising. The most popular technique, dynamic time warping (DTW), performs worse than Euclidean distance with k-means, and even when tuned, is no better. Using k-medoids rather than k-means improved the clusterings for all nine distance measures. DTW is not significantly better than Euclidean distance with k-medoids. Generally, distanc",
    "path": "papers/22/05/2205.15181.json",
    "total_tokens": 978,
    "translated_title": "弹性距离函数在时间序列聚类中的综述和评估",
    "translated_abstract": "时间序列聚类是将时间序列数据分组的行为，不需要标签。聚类时间序列数据的算法可以分为两组：使用时间序列特定距离度量的算法和从时间序列推导特征的算法。两种方法通常都依赖于传统的聚类算法，比如$k$-means。我们的重点是基于弹性距离度量的时间序列距离算法，即在测量距离时执行某种实际对其操作的距离度量。我们描述了九种常用的弹性距离度量，并将它们与k-means和k-medoids聚类的性能进行了比较。我们的发现令人意外。最受欢迎的技术-动态时间规整(DTW)，在与k-means结合时比欧几里得距离表现更差，即使进行了调整，效果也不好。使用k-medoids而不是k-means对所有九个距离度量都改善了聚类效果。DTW与k-medoids中的欧几里得距离没有显著差异。一般而言，距离度量方法的影响取决于聚类的算法和数据集的特性。",
    "tldr": "本文针对时间序列聚类中的弹性距离度量算法进行了综述和评估，发现常用的距离度量方法之一-DTW，在与k-means结合时表现不如欧几里得距离。使用k-medoids可以改善聚类效果。",
    "en_tdlr": "This paper reviews and evaluates elastic distance measures for time series clustering and finds that the popular dynamic time warping (DTW) algorithm performs worse than Euclidean distance with k-means, while using k-medoids can improve the clustering performance for all nine distance measures."
}