{
    "title": "Assessing Confidence with Assurance 2.0. (arXiv:2205.04522v3 [cs.AI] UPDATED)",
    "abstract": "An assurance case is intended to provide justifiable confidence in the truth of its top claim, which typically concerns safety or security. A natural question is then \"how much\" confidence does the case provide? We argue that confidence cannot be reduced to a single attribute or measurement. Instead, we suggest it should be based on attributes that draw on three different perspectives: positive, negative, and residual doubts.  Positive Perspectives consider the extent to which the evidence and overall argument of the case combine to make a positive statement justifying belief in its claims. We set a high bar for justification, requiring it to be indefeasible. The primary positive measure for this is soundness, which interprets the argument as a logical proof. Confidence in evidence can be expressed probabilistically and we use confirmation measures to ensure that the \"weight\" of evidence crosses some threshold. In addition, probabilities can be aggregated from evidence through the step",
    "link": "http://arxiv.org/abs/2205.04522",
    "context": "Title: Assessing Confidence with Assurance 2.0. (arXiv:2205.04522v3 [cs.AI] UPDATED)\nAbstract: An assurance case is intended to provide justifiable confidence in the truth of its top claim, which typically concerns safety or security. A natural question is then \"how much\" confidence does the case provide? We argue that confidence cannot be reduced to a single attribute or measurement. Instead, we suggest it should be based on attributes that draw on three different perspectives: positive, negative, and residual doubts.  Positive Perspectives consider the extent to which the evidence and overall argument of the case combine to make a positive statement justifying belief in its claims. We set a high bar for justification, requiring it to be indefeasible. The primary positive measure for this is soundness, which interprets the argument as a logical proof. Confidence in evidence can be expressed probabilistically and we use confirmation measures to ensure that the \"weight\" of evidence crosses some threshold. In addition, probabilities can be aggregated from evidence through the step",
    "path": "papers/22/05/2205.04522.json",
    "total_tokens": 813,
    "translated_title": "评估“Assurance 2.0”中的信心",
    "translated_abstract": "保证案例旨在对其顶级声明（通常涉及安全性或安全）提供可证明的信心。那么问题来了，“这种信心”有多少？我们认为信心不能归结为单一属性或测量。相反，我们建议它应该基于三个不同视角的属性：积极，消极和剩余疑虑。积极视角考虑证据和整个案例的程度，将积极声明合理化为支持其主张的信仰。我们对证明设立了高门槛，要求证明是不可否认的。其中主要的正面措施是完备性，将该论证解释为逻辑证明。证据的信心可以以概率方式表达，并使用确认措施确保证据的\"重量\"越过某个阈值。此外，概率可以从证据中聚合，通过将证据视为贝叶斯网络节点来完成。",
    "tldr": "本文提出了从三个方面考虑信心的属性来评估保证案例，其中主要的措施是将论证解释为逻辑证明的完备性。"
}