{
    "title": "A Structured Span Selector. (arXiv:2205.03977v3 [cs.CL] UPDATED)",
    "abstract": "Many natural language processing tasks, e.g., coreference resolution and semantic role labeling, require selecting text spans and making decisions about them. A typical approach to such tasks is to score all possible spans and greedily select spans for task-specific downstream processing. This approach, however, does not incorporate any inductive bias about what sort of spans ought to be selected, e.g., that selected spans tend to be syntactic constituents. In this paper, we propose a novel grammar-based structured span selection model which learns to make use of the partial span-level annotation provided for such problems. Compared to previous approaches, our approach gets rid of the heuristic greedy span selection scheme, allowing us to model the downstream task on an optimal set of spans. We evaluate our model on two popular span prediction tasks: coreference resolution and semantic role labeling. We show empirical improvements on both.",
    "link": "http://arxiv.org/abs/2205.03977",
    "context": "Title: A Structured Span Selector. (arXiv:2205.03977v3 [cs.CL] UPDATED)\nAbstract: Many natural language processing tasks, e.g., coreference resolution and semantic role labeling, require selecting text spans and making decisions about them. A typical approach to such tasks is to score all possible spans and greedily select spans for task-specific downstream processing. This approach, however, does not incorporate any inductive bias about what sort of spans ought to be selected, e.g., that selected spans tend to be syntactic constituents. In this paper, we propose a novel grammar-based structured span selection model which learns to make use of the partial span-level annotation provided for such problems. Compared to previous approaches, our approach gets rid of the heuristic greedy span selection scheme, allowing us to model the downstream task on an optimal set of spans. We evaluate our model on two popular span prediction tasks: coreference resolution and semantic role labeling. We show empirical improvements on both.",
    "path": "papers/22/05/2205.03977.json",
    "total_tokens": 830,
    "translated_title": "结构化跨度选择器",
    "translated_abstract": "许多自然语言处理任务，例如共指消解和语义角色标注，需要选择文本跨度并对其进行决策。这些任务的一种典型方法是对所有可能的跨度进行评分，并贪婪地选择跨度进行特定任务的下游处理。然而，这种方法并没有结合任何归纳偏置来确定应该选择哪种跨度，例如选择的跨度往往是句法成分。在本文中，我们提出了一种新颖的基于语法的结构化跨度选择模型，该模型学习利用为这些问题提供的部分跨度级注释。与先前的方法相比，我们的方法摒弃了启发式的贪婪跨度选择方案，使我们能够在最佳一组跨度上对下游任务进行建模。我们在两个常见的跨度预测任务：共指消解和语义角色标注上评估了我们的模型，并展示了实证改进。",
    "tldr": "提出了一种新颖的基于语法的结构化跨度选择模型，通过利用部分跨度级注释，摒弃了贪心跨度选择方案，为共指消解和语义角色标注任务带来了实证改进。",
    "en_tdlr": "A novel grammar-based structured span selection model is proposed, which achieves empirical improvements in coreference resolution and semantic role labeling tasks by utilizing partial span-level annotation and getting rid of the greedy span selection scheme."
}