{
    "title": "DPMS: An ADD-Based Symbolic Approach for Generalized MaxSAT Solving. (arXiv:2205.03747v2 [cs.AI] UPDATED)",
    "abstract": "Boolean MaxSAT, as well as generalized formulations such as Min-MaxSAT and Max-hybrid-SAT, are fundamental optimization problems in Boolean reasoning. Existing methods for MaxSAT have been successful in solving benchmarks in CNF format. They lack, however, the ability to handle 1) (non-CNF) hybrid constraints, such as XORs and 2) generalized MaxSAT problems natively. To address this issue, we propose a novel dynamic-programming approach for solving generalized MaxSAT problems with hybrid constraints -- called \\emph{Dynamic-Programming-MaxSAT} or DPMS for short -- based on Algebraic Decision Diagrams (ADDs). With the power of ADDs and the (graded) project-join-tree builder, our versatile framework admits many generalizations of CNF-MaxSAT, such as MaxSAT, Min-MaxSAT, and MinSAT with hybrid constraints. Moreover, DPMS scales provably well on instances with low width. Empirical results indicate that DPMS is able to solve certain problems quickly, where other algorithms based on various te",
    "link": "http://arxiv.org/abs/2205.03747",
    "context": "Title: DPMS: An ADD-Based Symbolic Approach for Generalized MaxSAT Solving. (arXiv:2205.03747v2 [cs.AI] UPDATED)\nAbstract: Boolean MaxSAT, as well as generalized formulations such as Min-MaxSAT and Max-hybrid-SAT, are fundamental optimization problems in Boolean reasoning. Existing methods for MaxSAT have been successful in solving benchmarks in CNF format. They lack, however, the ability to handle 1) (non-CNF) hybrid constraints, such as XORs and 2) generalized MaxSAT problems natively. To address this issue, we propose a novel dynamic-programming approach for solving generalized MaxSAT problems with hybrid constraints -- called \\emph{Dynamic-Programming-MaxSAT} or DPMS for short -- based on Algebraic Decision Diagrams (ADDs). With the power of ADDs and the (graded) project-join-tree builder, our versatile framework admits many generalizations of CNF-MaxSAT, such as MaxSAT, Min-MaxSAT, and MinSAT with hybrid constraints. Moreover, DPMS scales provably well on instances with low width. Empirical results indicate that DPMS is able to solve certain problems quickly, where other algorithms based on various te",
    "path": "papers/22/05/2205.03747.json",
    "total_tokens": 936,
    "translated_title": "DPMS: 一种基于ADD符号化方法的广义MaxSAT求解算法",
    "translated_abstract": "布尔最大可满足性（MaxSAT）问题以及广义形式，如Min-MaxSAT和Max-hybrid-SAT，在布尔推理中是基本的优化问题。现有的MaxSAT方法已成功解决CNF格式基准测试问题。然而，它们缺乏处理1）（非CNF）混合约束，例如XOR，和2）广义MaxSAT问题的能力。为解决这个问题，我们提出了一种新颖的动态编程方法来解决具有混合约束的广义MaxSAT问题，称为\\emph{Dynamic-Programming-MaxSAT} （DPMS）——基于代数决策图（ADDs）。凭借ADDs和（分级）项目连接树生成器的强大功能，我们的通用框架可以接受许多CNF-MaxSAT的泛化，例如具有混合约束的MaxSAT、Min-MaxSAT和MinSAT。此外，DPMS在宽度低的实例上具有可证明的良好扩展性。实验结果表明，DPMS能够快速解决某些问题，其他基于各种技术的算法则无法解决。",
    "tldr": "该研究提出了DPMS算法，一种基于ADD符号化方法的广义MaxSAT求解算法，可以处理非CNF混合约束的广义MaxSAT问题，并在实验中表现优秀。",
    "en_tdlr": "This study proposes DPMS, a novel symbolic approach based on Algebraic Decision Diagrams (ADDs) for solving generalized MaxSAT problems with hybrid constraints. DPMS exhibits good scalability and outperforms other algorithms in certain benchmarks in experiments."
}