{
    "title": "Recent Contributions to Theories of Discrimination. (arXiv:2205.05994v3 [econ.TH] UPDATED)",
    "abstract": "This paper surveys the literature on theories of discrimination, focusing mainly on new contributions. Recent theories expand on the traditional taste-based and statistical discrimination frameworks by considering specific features of learning and signaling environments, often using novel informationand mechanism-design language; analyzing learning and decision making by algorithms; and introducing agents with behavioral biases and misspecified beliefs. This survey also attempts to narrow the gap between the economic perspective on ``theories of discrimination'' and the broader study of discrimination in the social science literature. In that respect, I first contribute by identifying a class of models of discriminatory institutions, made up of theories of discriminatory social norms and discriminatory institutional design. Second, I discuss issues relating to the measurement of discrimination, and the classification of discrimination as bias or statistical, direct or systemic, and a",
    "link": "http://arxiv.org/abs/2205.05994",
    "context": "Title: Recent Contributions to Theories of Discrimination. (arXiv:2205.05994v3 [econ.TH] UPDATED)\nAbstract: This paper surveys the literature on theories of discrimination, focusing mainly on new contributions. Recent theories expand on the traditional taste-based and statistical discrimination frameworks by considering specific features of learning and signaling environments, often using novel informationand mechanism-design language; analyzing learning and decision making by algorithms; and introducing agents with behavioral biases and misspecified beliefs. This survey also attempts to narrow the gap between the economic perspective on ``theories of discrimination'' and the broader study of discrimination in the social science literature. In that respect, I first contribute by identifying a class of models of discriminatory institutions, made up of theories of discriminatory social norms and discriminatory institutional design. Second, I discuss issues relating to the measurement of discrimination, and the classification of discrimination as bias or statistical, direct or systemic, and a",
    "path": "papers/22/05/2205.05994.json",
    "total_tokens": 945,
    "translated_title": "歧视理论的近期贡献",
    "translated_abstract": "本文综述了关于歧视理论的文献，主要关注于新的研究成果。最近的理论扩展了传统的基于品味和统计歧视框架，通过考虑学习和信号环境的特定特点，经常使用新的信息和机制设计语言；通过分析算法的学习和决策制定；并引入具有行为偏差和误设信念的代理。该综述还尝试缩小经济学角度对“歧视理论”的看法与社会科学文献中更广泛的歧视研究之间的差距。在这方面，我首先通过确定一个由歧视性社会规范和歧视性制度设计理论组成的歧视性机构模型类别做出贡献。其次，讨论涉及歧视测量和将歧视分类为偏见或统计学，直接或系统性以及世界性等问题。",
    "tldr": "本文对歧视理论进行了综述并提出了新的研究成果，包括特定学习和信令环境下的思考，算法学习和决策制定，以及引入行为偏差和误设信念的代理。此外，该文确定了一个由歧视性社会规范和歧视性制度设计理论组成的歧视性机构模型类别，探讨了关于歧视测量和歧视分类的问题。",
    "en_tdlr": "This paper provides a survey of the literature on theories of discrimination, with a focus on recent contributions that expand traditional frameworks, such as considering learning and signaling environments, analyzing algorithmic decision making, and introducing behavioral biases and misspecified beliefs. The paper also contributes to the study of discriminatory institutions by identifying a class of models of discriminatory social norms and discriminatory institutional design. Issues related to discrimination measurement and classification are also discussed."
}