{
    "title": "NMA: Neural Multi-slot Auctions with Externalities for Online Advertising. (arXiv:2205.10018v3 [cs.AI] UPDATED)",
    "abstract": "Online advertising driven by auctions brings billions of dollars in revenue for social networking services and e-commerce platforms. GSP auctions, which are simple and easy to understand for advertisers, have almost become the benchmark for ad auction mechanisms in the industry. However, most GSP-based industrial practices assume that the user click only relies on the ad itself, which overlook the effect of external items, referred to as externalities. Recently, DNA has attempted to upgrade GSP with deep neural networks and models local externalities to some extent. However, it only considers set-level contexts from auctions and ignores the order and displayed position of ads, which is still suboptimal. Although VCG-based multi-slot auctions (e.g., VCG, WVCG) make it theoretically possible to model global externalities (e.g., the order and positions of ads and so on), they lack an efficient balance of both revenue and social welfare. In this paper, we propose novel auction mechanisms n",
    "link": "http://arxiv.org/abs/2205.10018",
    "context": "Title: NMA: Neural Multi-slot Auctions with Externalities for Online Advertising. (arXiv:2205.10018v3 [cs.AI] UPDATED)\nAbstract: Online advertising driven by auctions brings billions of dollars in revenue for social networking services and e-commerce platforms. GSP auctions, which are simple and easy to understand for advertisers, have almost become the benchmark for ad auction mechanisms in the industry. However, most GSP-based industrial practices assume that the user click only relies on the ad itself, which overlook the effect of external items, referred to as externalities. Recently, DNA has attempted to upgrade GSP with deep neural networks and models local externalities to some extent. However, it only considers set-level contexts from auctions and ignores the order and displayed position of ads, which is still suboptimal. Although VCG-based multi-slot auctions (e.g., VCG, WVCG) make it theoretically possible to model global externalities (e.g., the order and positions of ads and so on), they lack an efficient balance of both revenue and social welfare. In this paper, we propose novel auction mechanisms n",
    "path": "papers/22/05/2205.10018.json",
    "total_tokens": 749,
    "translated_title": "NMA: 神经网络多槽广告拍卖带有外部性",
    "translated_abstract": "在线广告拍卖为社交网络服务和电子商务平台带来了数十亿美元的收入。GSP拍卖机制已成为行业中广告拍卖机制的基准，但大多数基于GSP的工业实践假设用户点击仅与广告本身有关，忽视了外部性的影响。本文提出了一种新颖的拍卖机制NMA，它利用深度神经网络模型来考虑广告展示顺序和位置对用户点击的影响，从而更好地模拟全局的外部性。",
    "tldr": "NMA是一种新颖的在线广告拍卖机制，利用深度神经网络模型考虑广告展示顺序和位置对用户点击的影响，更好地模拟全局的外部性。",
    "en_tdlr": "NMA is a novel online advertising auction mechanism that uses deep neural networks to consider the impact of ad display order and position on user clicks, better simulating global externalities."
}