{
    "title": "HierarchyNet: Learning to Summarize Source Code with Heterogeneous Representations. (arXiv:2205.15479v3 [cs.SE] UPDATED)",
    "abstract": "We propose a novel method for code summarization utilizing Heterogeneous Code Representations (HCRs) and our specially designed HierarchyNet. HCRs effectively capture essential code features at lexical, syntactic, and semantic levels by abstracting coarse-grained code elements and incorporating fine-grained program elements in a hierarchical structure. Our HierarchyNet method processes each layer of the HCR separately through a unique combination of the Heterogeneous Graph Transformer, a Tree-based CNN, and a Transformer Encoder. This approach preserves dependencies between code elements and captures relations through a novel Hierarchical-Aware Cross Attention layer. Our method surpasses current state-of-the-art techniques, such as PA-Former, CAST, and NeuralCodeSum.",
    "link": "http://arxiv.org/abs/2205.15479",
    "context": "Title: HierarchyNet: Learning to Summarize Source Code with Heterogeneous Representations. (arXiv:2205.15479v3 [cs.SE] UPDATED)\nAbstract: We propose a novel method for code summarization utilizing Heterogeneous Code Representations (HCRs) and our specially designed HierarchyNet. HCRs effectively capture essential code features at lexical, syntactic, and semantic levels by abstracting coarse-grained code elements and incorporating fine-grained program elements in a hierarchical structure. Our HierarchyNet method processes each layer of the HCR separately through a unique combination of the Heterogeneous Graph Transformer, a Tree-based CNN, and a Transformer Encoder. This approach preserves dependencies between code elements and captures relations through a novel Hierarchical-Aware Cross Attention layer. Our method surpasses current state-of-the-art techniques, such as PA-Former, CAST, and NeuralCodeSum.",
    "path": "papers/22/05/2205.15479.json",
    "total_tokens": 766,
    "translated_title": "HierarchyNet: 利用异构表示学习代码摘要",
    "translated_abstract": "我们提出了一种使用异构代码表示(HCRs)和我们特别设计的HierarchyNet来进行代码摘要的新方法。通过对粗粒度的代码元素进行抽象，并在层次结构中纳入细粒度的程序元素，HCRs有效地捕获了词法、语法和语义层面上的代码要素。我们的HierarchyNet方法分别通过异构图变换器、基于树的CNN和变换器编码器独特地处理HCR的每一层。此方法通过新颖的层次感知交叉注意力层保留了代码元素之间的依赖关系和捕捉他们之间的关系。我们的方法在PA-Former、CAST和NeuralCodeSum等当前最先进的技术上表现出了更好的结果。",
    "tldr": "HierarchyNet是一种优秀的代码摘要方法，它基于异构代码表示和层次感知交叉注意层，可以有效地捕获词法、语法和语义层面上的代码要素。",
    "en_tdlr": "HierarchyNet is an excellent method for code summarization, which is based on Heterogeneous Code Representations and a Hierarchical-Aware Cross Attention layer, and can effectively capture essential code features at lexical, syntactic, and semantic levels."
}