{
    "title": "Hybrid quantum ResNet for car classification and its hyperparameter optimization. (arXiv:2205.04878v2 [quant-ph] UPDATED)",
    "abstract": "Image recognition is one of the primary applications of machine learning algorithms. Nevertheless, machine learning models used in modern image recognition systems consist of millions of parameters that usually require significant computational time to be adjusted. Moreover, adjustment of model hyperparameters leads to additional overhead. Because of this, new developments in machine learning models and hyperparameter optimization techniques are required. This paper presents a quantum-inspired hyperparameter optimization technique and a hybrid quantum-classical machine learning model for supervised learning. We benchmark our hyperparameter optimization method over standard black-box objective functions and observe performance improvements in the form of reduced expected run times and fitness in response to the growth in the size of the search space. We test our approaches in a car image classification task and demonstrate a full-scale implementation of the hybrid quantum ResNet model w",
    "link": "http://arxiv.org/abs/2205.04878",
    "context": "Title: Hybrid quantum ResNet for car classification and its hyperparameter optimization. (arXiv:2205.04878v2 [quant-ph] UPDATED)\nAbstract: Image recognition is one of the primary applications of machine learning algorithms. Nevertheless, machine learning models used in modern image recognition systems consist of millions of parameters that usually require significant computational time to be adjusted. Moreover, adjustment of model hyperparameters leads to additional overhead. Because of this, new developments in machine learning models and hyperparameter optimization techniques are required. This paper presents a quantum-inspired hyperparameter optimization technique and a hybrid quantum-classical machine learning model for supervised learning. We benchmark our hyperparameter optimization method over standard black-box objective functions and observe performance improvements in the form of reduced expected run times and fitness in response to the growth in the size of the search space. We test our approaches in a car image classification task and demonstrate a full-scale implementation of the hybrid quantum ResNet model w",
    "path": "papers/22/05/2205.04878.json",
    "total_tokens": 847,
    "translated_title": "混合量子ResNet用于汽车分类及其超参数优化",
    "translated_abstract": "图像识别是机器学习算法的主要应用之一。然而，现代图像识别系统中使用的机器学习模型通常由数百万个参数组成，通常需要大量计算时间进行调整。此外，调整模型超参数会产生额外的开销。因此，需要新的机器学习模型和超参数优化技术的发展。本文提出了一种灵感于量子的超参数优化技术和混合量子-经典机器学习模型用于监督学习。我们对标准黑盒目标函数进行了超参数优化方法的基准测试，观察到随着搜索空间大小的增加，预期运行时间和适应度的降低的性能改善。我们通过对汽车图像分类任务进行测试，并展示了混合量子ResNet模型的全面实现。",
    "tldr": "本文提出了一种混合量子-经典机器学习模型和基于量子灵感的超参数优化技术，用于图像识别任务中的汽车分类。我们的研究在标准黑盒目标函数上进行了基准测试，证明了我们的方法在减少期望运行时间和适应度方面的性能改善。"
}