{
    "title": "Most Equitable Voting Rules. (arXiv:2205.14838v3 [cs.GT] UPDATED)",
    "abstract": "In social choice theory, anonymity (all agents being treated equally) and neutrality (all alternatives being treated equally) are widely regarded as ``minimal demands'' and ``uncontroversial'' axioms of equity and fairness. However, the ANR impossibility -- there is no voting rule that satisfies anonymity, neutrality, and resolvability (always choosing one winner) -- holds even in the simple setting of two alternatives and two agents. How to design voting rules that optimally satisfy anonymity, neutrality, and resolvability remains an open question.  We address the optimal design question for a wide range of preferences and decisions that include ranked lists and committees. Our conceptual contribution is a novel and strong notion of most equitable refinements that optimally preserves anonymity and neutrality for any irresolute rule that satisfies the two axioms. Our technical contributions are twofold. First, we characterize the conditions for the ANR impossibility to hold under gener",
    "link": "http://arxiv.org/abs/2205.14838",
    "context": "Title: Most Equitable Voting Rules. (arXiv:2205.14838v3 [cs.GT] UPDATED)\nAbstract: In social choice theory, anonymity (all agents being treated equally) and neutrality (all alternatives being treated equally) are widely regarded as ``minimal demands'' and ``uncontroversial'' axioms of equity and fairness. However, the ANR impossibility -- there is no voting rule that satisfies anonymity, neutrality, and resolvability (always choosing one winner) -- holds even in the simple setting of two alternatives and two agents. How to design voting rules that optimally satisfy anonymity, neutrality, and resolvability remains an open question.  We address the optimal design question for a wide range of preferences and decisions that include ranked lists and committees. Our conceptual contribution is a novel and strong notion of most equitable refinements that optimally preserves anonymity and neutrality for any irresolute rule that satisfies the two axioms. Our technical contributions are twofold. First, we characterize the conditions for the ANR impossibility to hold under gener",
    "path": "papers/22/05/2205.14838.json",
    "total_tokens": 946,
    "translated_title": "最公平的投票规则",
    "translated_abstract": "在社会选择理论中，匿名性（所有代理人被平等对待）和中立性（所有替代方案被平等对待）被普遍认为是公平性和公正性的“最低要求”和“无争议”的公理。然而，ANR不可能性——没有满足匿名性、中立性和可解决性（总是选择一个获胜者）的投票规则——甚至在只有两个替代方案和两个代理人的简单情况下也成立。如何设计满足匿名性、中立性和可解决性的最佳投票规则仍然是一个开放的问题。我们解决了一种广泛的偏好和决策的最佳设计问题，包括排名列表和委员会。我们的概念贡献是一种新的和强大的最公平改进的概念，它对满足两个公理的任何不确定规则都能最优地保持匿名性和中立性。我们的技术贡献有两个方面。首先，我们刻画了ANR不可能性在普遍情况下成立的条件。",
    "tldr": "该论文探讨了在社会选择理论中设计满足匿名性、中立性和可解决性的最佳投票规则的开放问题。作者提出了一种最公平改进的概念，该概念对满足两个公理的任何不确定规则都能最优地保持匿名性和中立性。",
    "en_tdlr": "This paper addresses the open question of designing optimal voting rules that satisfy anonymity, neutrality, and resolvability in social choice theory. The authors propose a novel notion of most equitable refinements that optimally preserves anonymity and neutrality for any irresolute rule satisfying these axioms."
}