{
    "title": "Principal Component Analysis based frameworks for efficient missing data imputation algorithms. (arXiv:2205.15150v3 [cs.LG] UPDATED)",
    "abstract": "Missing data is a commonly occurring problem in practice. Many imputation methods have been developed to fill in the missing entries. However, not all of them can scale to high-dimensional data, especially the multiple imputation techniques. Meanwhile, the data nowadays tends toward high-dimensional. Therefore, in this work, we propose Principal Component Analysis Imputation (PCAI), a simple but versatile framework based on Principal Component Analysis (PCA) to speed up the imputation process and alleviate memory issues of many available imputation techniques, without sacrificing the imputation quality in term of MSE. In addition, the frameworks can be used even when some or all of the missing features are categorical, or when the number of missing features is large. Next, we introduce PCA Imputation - Classification (PIC), an application of PCAI for classification problems with some adjustments. We validate our approach by experiments on various scenarios, which shows that PCAI and PI",
    "link": "http://arxiv.org/abs/2205.15150",
    "context": "Title: Principal Component Analysis based frameworks for efficient missing data imputation algorithms. (arXiv:2205.15150v3 [cs.LG] UPDATED)\nAbstract: Missing data is a commonly occurring problem in practice. Many imputation methods have been developed to fill in the missing entries. However, not all of them can scale to high-dimensional data, especially the multiple imputation techniques. Meanwhile, the data nowadays tends toward high-dimensional. Therefore, in this work, we propose Principal Component Analysis Imputation (PCAI), a simple but versatile framework based on Principal Component Analysis (PCA) to speed up the imputation process and alleviate memory issues of many available imputation techniques, without sacrificing the imputation quality in term of MSE. In addition, the frameworks can be used even when some or all of the missing features are categorical, or when the number of missing features is large. Next, we introduce PCA Imputation - Classification (PIC), an application of PCAI for classification problems with some adjustments. We validate our approach by experiments on various scenarios, which shows that PCAI and PI",
    "path": "papers/22/05/2205.15150.json",
    "total_tokens": 936,
    "translated_title": "基于主成分分析的高效缺失数据插补算法框架",
    "translated_abstract": "缺失数据是实践中普遍存在的问题。许多填补缺失值的方法已经被开发出来。然而，并不是所有的方法都能够适用于高维数据，特别是多重插补技术。同时，如今的数据趋向于高维。因此，在这项工作中，我们提出了基于主成分分析（PCA）的简单而通用的缺失值插补框架PCA Imputation（PCAI），以加快插补过程并减轻许多可用插补技术的内存问题，而不会牺牲均方误差方面的插补质量。此外，即使部分或全部缺失特征是分类的，或者缺失特征数量较大，该框架也可以使用。接下来，我们介绍PCA Imputation - Classification（PIC），这是对具有一些调整的分类问题PCAI的应用。我们通过各种情况的实验验证了我们的方法，表明PCA I和PIC可以显著优于基线方法，同时在分类任务中实现可比较或更好的分类准确性。",
    "tldr": "本文提出了基于主成分分析的缺失数据插补框架，可适用于高维数据，能够显著优于基线方法，同时在分类任务中实现可比较或更好的分类准确性。",
    "en_tdlr": "This paper proposes a PCA-based missing data imputation framework that can be applied to high-dimensional data, significantly outperforming baseline methods, while achieving comparable or better classification accuracy in classification tasks."
}