{
    "title": "NeuPSL: Neural Probabilistic Soft Logic. (arXiv:2205.14268v3 [cs.LG] UPDATED)",
    "abstract": "In this paper, we introduce Neural Probabilistic Soft Logic (NeuPSL), a novel neuro-symbolic (NeSy) framework that unites state-of-the-art symbolic reasoning with the low-level perception of deep neural networks. To model the boundary between neural and symbolic representations, we propose a family of energy-based models, NeSy Energy-Based Models, and show that they are general enough to include NeuPSL and many other NeSy approaches. Using this framework, we show how to seamlessly integrate neural and symbolic parameter learning and inference in NeuPSL. Through an extensive empirical evaluation, we demonstrate the benefits of using NeSy methods, achieving upwards of 30% improvement over independent neural network models. On a well-established NeSy task, MNIST-Addition, NeuPSL demonstrates its joint reasoning capabilities by outperforming existing NeSy approaches by up to 10% in low-data settings. Furthermore, NeuPSL achieves a 5% boost in performance over state-of-the-art NeSy methods ",
    "link": "http://arxiv.org/abs/2205.14268",
    "context": "Title: NeuPSL: Neural Probabilistic Soft Logic. (arXiv:2205.14268v3 [cs.LG] UPDATED)\nAbstract: In this paper, we introduce Neural Probabilistic Soft Logic (NeuPSL), a novel neuro-symbolic (NeSy) framework that unites state-of-the-art symbolic reasoning with the low-level perception of deep neural networks. To model the boundary between neural and symbolic representations, we propose a family of energy-based models, NeSy Energy-Based Models, and show that they are general enough to include NeuPSL and many other NeSy approaches. Using this framework, we show how to seamlessly integrate neural and symbolic parameter learning and inference in NeuPSL. Through an extensive empirical evaluation, we demonstrate the benefits of using NeSy methods, achieving upwards of 30% improvement over independent neural network models. On a well-established NeSy task, MNIST-Addition, NeuPSL demonstrates its joint reasoning capabilities by outperforming existing NeSy approaches by up to 10% in low-data settings. Furthermore, NeuPSL achieves a 5% boost in performance over state-of-the-art NeSy methods ",
    "path": "papers/22/05/2205.14268.json",
    "total_tokens": 1066,
    "translated_title": "NeuPSL: 神经概率软逻辑",
    "translated_abstract": "本文介绍了神经概率软逻辑（NeuPSL），一种新颖的神经符号框架，将现代符号推理与深度神经网络的低级感知相结合。我们提出了一类基于能量的模型——NeSy能量模型，用于建模神经和符号表示之间的边界，并证明它们足够通用，包括NeuPSL和许多其他NeSy方法。使用这个框架，我们展示了如何无缝地集成神经和符号参数学习和推理。通过广泛的实证评估，我们展示了使用NeSy方法的好处，相对于独立神经网络模型实现了多达30％的提升。在一个已经建立的NeSy任务MNIST-Addition上，NeuPSL通过在低数据环境中的最高10％超越了现有的NeSy方法，展示了其联合推理能力。此外，NeuPSL相对于现有领先的NeSy方法性能提升了5％。",
    "tldr": "该论文介绍了神经概率软逻辑 (NeuPSL) 这一种新颖的神经符号融合框架。通过NeSy能量模型建模神经和符号表示之间的边界，无缝融合神经和符号参数学习和推理。在实际评测中，相对于独立的神经网络模型，该方法实现了多达 30% 的提升，在MNIST-Addition任务上的表现也高达当前最先进的方法的5%。"
}