{
    "title": "Scalable Stochastic Parametric Verification with Stochastic Variational Smoothed Model Checking. (arXiv:2205.05398v3 [cs.LG] UPDATED)",
    "abstract": "Parametric verification of linear temporal properties for stochastic models can be expressed as computing the satisfaction probability of a certain property as a function of the parameters of the model. Smoothed model checking (smMC) aims at inferring the satisfaction function over the entire parameter space from a limited set of observations obtained via simulation. As observations are costly and noisy, smMC is framed as a Bayesian inference problem so that the estimates have an additional quantification of the uncertainty. In smMC the authors use Gaussian Processes (GP), inferred by means of the Expectation Propagation algorithm. This approach provides accurate reconstructions with statistically sound quantification of the uncertainty. However, it inherits the well-known scalability issues of GP. In this paper, we exploit recent advances in probabilistic machine learning to push this limitation forward, making Bayesian inference of smMC scalable to larger datasets and enabling its ap",
    "link": "http://arxiv.org/abs/2205.05398",
    "context": "Title: Scalable Stochastic Parametric Verification with Stochastic Variational Smoothed Model Checking. (arXiv:2205.05398v3 [cs.LG] UPDATED)\nAbstract: Parametric verification of linear temporal properties for stochastic models can be expressed as computing the satisfaction probability of a certain property as a function of the parameters of the model. Smoothed model checking (smMC) aims at inferring the satisfaction function over the entire parameter space from a limited set of observations obtained via simulation. As observations are costly and noisy, smMC is framed as a Bayesian inference problem so that the estimates have an additional quantification of the uncertainty. In smMC the authors use Gaussian Processes (GP), inferred by means of the Expectation Propagation algorithm. This approach provides accurate reconstructions with statistically sound quantification of the uncertainty. However, it inherits the well-known scalability issues of GP. In this paper, we exploit recent advances in probabilistic machine learning to push this limitation forward, making Bayesian inference of smMC scalable to larger datasets and enabling its ap",
    "path": "papers/22/05/2205.05398.json",
    "total_tokens": 861,
    "translated_title": "带随机变量的参数化验证-随机变分光滑模型检验的可扩展性研究",
    "translated_abstract": "针对随机模型的线性时态性属性的参数化验证可以表示为计算满足一定属性的概率，函数的参数为这个模型的参数。平滑模型检验(smMC)旨在从通过模拟获得的有限的观测值中推断出整个参数空间上的满足函数。由于观测成本高且噪声大，因此smMC被构建为贝叶斯推理问题，使估计值具有额外的不确定性量化。在smMC中，作者使用由期望传播算法推断出的高斯过程(GP)。这种方法提供了准确的重构和统计上合理的不确定性量化。然而，它继承了GP的著名可扩展性问题。因此，本文利用概率机器学习的最新进展，将贝叶斯推理的smMC扩展到更大的数据集，并使其适用于实际问题。",
    "tldr": "本论文提出了一种利用概率机器学习扩展平滑模型检验(smMC)方法的思路，从而使贝叶斯推理的smMC适用于更大的数据集和实际问题。",
    "en_tdlr": "This paper proposes a method to extend the smoothed model checking (smMC) approach using probabilistic machine learning, making Bayesian inference of smMC applicable to larger datasets and real-world problems."
}