{
    "title": "Penguins Don't Fly: Reasoning about Generics through Instantiations and Exceptions. (arXiv:2205.11658v3 [cs.CL] UPDATED)",
    "abstract": "Generics express generalizations about the world (e.g., birds can fly) that are not universally true (e.g., newborn birds and penguins cannot fly). Commonsense knowledge bases, used extensively in NLP, encode some generic knowledge but rarely enumerate such exceptions and knowing when a generic statement holds or does not hold true is crucial for developing a comprehensive understanding of generics. We present a novel framework informed by linguistic theory to generate exemplars -- specific cases when a generic holds true or false. We generate ~19k exemplars for ~650 generics and show that our framework outperforms a strong GPT-3 baseline by 12.8 precision points. Our analysis highlights the importance of linguistic theory-based controllability for generating exemplars, the insufficiency of knowledge bases as a source of exemplars, and the challenges exemplars pose for the task of natural language inference.",
    "link": "http://arxiv.org/abs/2205.11658",
    "context": "Title: Penguins Don't Fly: Reasoning about Generics through Instantiations and Exceptions. (arXiv:2205.11658v3 [cs.CL] UPDATED)\nAbstract: Generics express generalizations about the world (e.g., birds can fly) that are not universally true (e.g., newborn birds and penguins cannot fly). Commonsense knowledge bases, used extensively in NLP, encode some generic knowledge but rarely enumerate such exceptions and knowing when a generic statement holds or does not hold true is crucial for developing a comprehensive understanding of generics. We present a novel framework informed by linguistic theory to generate exemplars -- specific cases when a generic holds true or false. We generate ~19k exemplars for ~650 generics and show that our framework outperforms a strong GPT-3 baseline by 12.8 precision points. Our analysis highlights the importance of linguistic theory-based controllability for generating exemplars, the insufficiency of knowledge bases as a source of exemplars, and the challenges exemplars pose for the task of natural language inference.",
    "path": "papers/22/05/2205.11658.json",
    "total_tokens": 885,
    "translated_title": "企鹅不能飞：通过实例和异常推理泛化问题",
    "translated_abstract": "泛化表达了世界上的概括（例如，鸟可以飞翔），但并非普遍适用（例如，新生儿鸟和企鹅不能飞翔）。常识知识库通常编码一些泛化知识，但很少列举这些异常。知道何时泛化语句成立或不成立对于开发对泛化问题的全面理解至关重要。本文提出了一种新颖的框架，基于语言学理论生成实例，即泛化成立或不成立的具体情况。我们为大约650个泛型生成了约19k个实例，并展示了我们的框架比强劲的GPT-3基线高出12.8个精度点。我们的分析突显了基于语言学理论的可控性在生成实例中的重要性，知识库作为实例来源的不足之处，以及实例对自然语言推理任务的挑战。",
    "tldr": "本文提出了一个基于语言学理论的框架，通过生成具体情况的实例，解决了泛化问题中的例外和普遍性的挑战，并在650个泛型上比GPT-3基线高出12.8个精度点。",
    "en_tdlr": "This paper proposes a novel framework based on linguistic theory to address the challenge of exceptions and universality in generics by generating exemplars, and shows that it outperforms the strong GPT-3 baseline by 12.8 precision points on around 650 generics."
}