{
    "title": "TFLEX: Temporal Feature-Logic Embedding Framework for Complex Reasoning over Temporal Knowledge Graph. (arXiv:2205.14307v2 [cs.LG] UPDATED)",
    "abstract": "Multi-hop logical reasoning over knowledge graph (KG) plays a fundamental role in many artificial intelligence tasks. Recent complex query embedding (CQE) methods for reasoning focus on static KGs, while temporal knowledge graphs (TKGs) have not been fully explored. Reasoning over TKGs has two challenges: 1. The query should answer entities or timestamps; 2. The operators should consider both set logic on entity set and temporal logic on timestamp set. To bridge this gap, we define the multi-hop logical reasoning problem on TKGs. With generated three datasets, we propose the first temporal CQE named Temporal Feature-Logic Embedding framework (TFLEX) to answer the temporal complex queries. We utilize vector logic to compute the logic part of Temporal Feature-Logic embeddings, thus naturally modeling all First-Order Logic (FOL) operations on entity set. In addition, our framework extends vector logic on timestamp set to cope with three extra temporal operators (After, Before and Between)",
    "link": "http://arxiv.org/abs/2205.14307",
    "context": "Title: TFLEX: Temporal Feature-Logic Embedding Framework for Complex Reasoning over Temporal Knowledge Graph. (arXiv:2205.14307v2 [cs.LG] UPDATED)\nAbstract: Multi-hop logical reasoning over knowledge graph (KG) plays a fundamental role in many artificial intelligence tasks. Recent complex query embedding (CQE) methods for reasoning focus on static KGs, while temporal knowledge graphs (TKGs) have not been fully explored. Reasoning over TKGs has two challenges: 1. The query should answer entities or timestamps; 2. The operators should consider both set logic on entity set and temporal logic on timestamp set. To bridge this gap, we define the multi-hop logical reasoning problem on TKGs. With generated three datasets, we propose the first temporal CQE named Temporal Feature-Logic Embedding framework (TFLEX) to answer the temporal complex queries. We utilize vector logic to compute the logic part of Temporal Feature-Logic embeddings, thus naturally modeling all First-Order Logic (FOL) operations on entity set. In addition, our framework extends vector logic on timestamp set to cope with three extra temporal operators (After, Before and Between)",
    "path": "papers/22/05/2205.14307.json",
    "total_tokens": 943,
    "translated_title": "TFLEX: 时间特征逻辑嵌入框架用于时间知识图谱上的复杂推理",
    "translated_abstract": "在许多人工智能任务中，知识图谱上的多跳逻辑推理发挥着基本作用。最近的复杂查询嵌入（CQE）方法侧重于静态知识图谱，而时间知识图谱（TKG）尚未得到充分探索。TKG上的推理面临两个挑战：1.查询应该回答实体或时间戳；2.运算符应该同时考虑实体集上的集合逻辑和时间戳集上的时间逻辑。为了解决这个问题，我们定义了TKG上的多跳逻辑推理问题。通过三个生成的数据集，我们提出了第一个名为TFLEX的时间CQE，用于回答时间复杂查询。我们利用向量逻辑计算Temporal Feature-Logic嵌入的逻辑部分，从而自然地建模实体集上的所有一阶逻辑（FOL）运算。此外，我们的框架扩展时间戳集上的向量逻辑，以处理三个额外的时间运算符（After，Before和Between）。",
    "tldr": "本文提出了第一个用于时间知识图谱的复杂查询嵌入方法TFLEX，能够自然地建模所有一阶逻辑（FOL）运算，同时扩展了向量逻辑以处理三个额外的时间运算符。",
    "en_tdlr": "This paper proposes the first temporal complex query embedding method called TFLEX for temporal knowledge graphs. It models all first-order logic (FOL) operations on entity set and extends vector logic to handle three extra temporal operators, After, Before, and Between."
}