{
    "title": "New Lower Bounds for Private Estimation and a Generalized Fingerprinting Lemma. (arXiv:2205.08532v4 [cs.DS] UPDATED)",
    "abstract": "We prove new lower bounds for statistical estimation tasks under the constraint of $(\\varepsilon, \\delta)$-differential privacy. First, we provide tight lower bounds for private covariance estimation of Gaussian distributions. We show that estimating the covariance matrix in Frobenius norm requires $\\Omega(d^2)$ samples, and in spectral norm requires $\\Omega(d^{3/2})$ samples, both matching upper bounds up to logarithmic factors. The latter bound verifies the existence of a conjectured statistical gap between the private and the non-private sample complexities for spectral estimation of Gaussian covariances. We prove these bounds via our main technical contribution, a broad generalization of the fingerprinting method to exponential families. Additionally, using the private Assouad method of Acharya, Sun, and Zhang, we show a tight $\\Omega(d/(\\alpha^2 \\varepsilon))$ lower bound for estimating the mean of a distribution with bounded covariance to $\\alpha$-error in $\\ell_2$-distance. Prio",
    "link": "http://arxiv.org/abs/2205.08532",
    "context": "Title: New Lower Bounds for Private Estimation and a Generalized Fingerprinting Lemma. (arXiv:2205.08532v4 [cs.DS] UPDATED)\nAbstract: We prove new lower bounds for statistical estimation tasks under the constraint of $(\\varepsilon, \\delta)$-differential privacy. First, we provide tight lower bounds for private covariance estimation of Gaussian distributions. We show that estimating the covariance matrix in Frobenius norm requires $\\Omega(d^2)$ samples, and in spectral norm requires $\\Omega(d^{3/2})$ samples, both matching upper bounds up to logarithmic factors. The latter bound verifies the existence of a conjectured statistical gap between the private and the non-private sample complexities for spectral estimation of Gaussian covariances. We prove these bounds via our main technical contribution, a broad generalization of the fingerprinting method to exponential families. Additionally, using the private Assouad method of Acharya, Sun, and Zhang, we show a tight $\\Omega(d/(\\alpha^2 \\varepsilon))$ lower bound for estimating the mean of a distribution with bounded covariance to $\\alpha$-error in $\\ell_2$-distance. Prio",
    "path": "papers/22/05/2205.08532.json",
    "total_tokens": 922,
    "translated_title": "隐私估计的新下界和广义指纹引理",
    "translated_abstract": "我们证明了在$(\\varepsilon, \\delta)$-差分隐私约束下统计估计任务的新的下界。首先，我们给出了高斯分布隐私协方差估计的严格下界。我们证明，在Frobenius范数下估计协方差矩阵需要$\\Omega(d^2)$个样本，在谱范数下需要$\\Omega(d^{3/2})$个样本，两者都匹配上界，除了对数因子。后一项下界验证了一个关于高斯协方差谱估计的隐私和非隐私样本复杂度的猜想统计差距的存在。我们通过将指纹方法广义化到指数家族来证明这些下界是正确的技术贡献。此外，使用Acharya，Sun和Zhang提出的差分隐私Assouad方法，我们在$\\ell_2$-距离下表明了在有界协方差分布的均值估计中，到$\\alpha$误差的严格$\\Omega(d/(\\alpha^2 \\varepsilon))$下界。",
    "tldr": "本文提供了针对高斯分布隐私协方差估计和有界协方差分布的均值估计的新下界，通过广义化指纹法到指数家族来证明这些下界的正确性。",
    "en_tdlr": "This paper provides new lower bounds for private covariance estimation of Gaussian distributions and mean estimation of bounded covariance distributions, respectively. The technical contribution is the generalization of the fingerprinting method to exponential families."
}