{
    "title": "Strategic Classification with Graph Neural Networks. (arXiv:2205.15765v3 [cs.LG] UPDATED)",
    "abstract": "Strategic classification studies learning in settings where users can modify their features to obtain favorable predictions. Most current works focus on simple classifiers that trigger independent user responses. Here we examine the implications of learning with more elaborate models that break the independence assumption. Motivated by the idea that applications of strategic classification are often social in nature, we focus on \\emph{graph neural networks}, which make use of social relations between users to improve predictions. Using a graph for learning introduces inter-user dependencies in prediction; our key point is that strategic users can exploit these to promote their goals. As we show through analysis and simulation, this can work either against the system -- or for it. Based on this, we propose a differentiable framework for strategically-robust learning of graph-based classifiers. Experiments on several real networked datasets demonstrate the utility of our approach.",
    "link": "http://arxiv.org/abs/2205.15765",
    "context": "Title: Strategic Classification with Graph Neural Networks. (arXiv:2205.15765v3 [cs.LG] UPDATED)\nAbstract: Strategic classification studies learning in settings where users can modify their features to obtain favorable predictions. Most current works focus on simple classifiers that trigger independent user responses. Here we examine the implications of learning with more elaborate models that break the independence assumption. Motivated by the idea that applications of strategic classification are often social in nature, we focus on \\emph{graph neural networks}, which make use of social relations between users to improve predictions. Using a graph for learning introduces inter-user dependencies in prediction; our key point is that strategic users can exploit these to promote their goals. As we show through analysis and simulation, this can work either against the system -- or for it. Based on this, we propose a differentiable framework for strategically-robust learning of graph-based classifiers. Experiments on several real networked datasets demonstrate the utility of our approach.",
    "path": "papers/22/05/2205.15765.json",
    "total_tokens": 900,
    "translated_title": "基于图神经网络的战略分类",
    "translated_abstract": "战略分类研究用户可以修改其特征以获得有利预测的学习设置。大多数现有的作品都着重于触发独立用户响应的简单分类器。本文研究了使用更复杂的模型进行学习的影响，这些模型打破了独立性假设。受到战略分类应用通常具有社交性质的思路的启发，我们专注于使用社交关系来提高预测的“图神经网络”。使用图进行学习引入了预测中的用户间相互依赖；我们的关键点是战略用户可以利用这些依赖来促进他们的目标。正如我们通过分析和模拟所展示的那样，这可能要么对系统不利，要么对系统有利。基于此，我们提出了一种可微分的框架，用于学习基于图的分类器的战略鲁棒性。在几个真实的网络数据集上的实验证明了我们方法的实用性。",
    "tldr": "本文介绍了一种基于图神经网络的战略分类方法，利用社交关系来提高预测，并提出一种可微分的框架，用于学习基于图的分类器的战略鲁棒性，实验表明该方法在几个真实的网络数据集上十分实用。",
    "en_tdlr": "This paper introduces a strategic classification method based on graph neural networks, which utilizes social relations to improve predictions, and proposes a differentiable framework for strategically-robust learning of graph-based classifiers. Experiments demonstrate the utility of the approach on several real networked datasets."
}