{
    "title": "Interpreting Neural Min-Sum Decoders. (arXiv:2205.10684v2 [cs.IT] UPDATED)",
    "abstract": "In decoding linear block codes, it was shown that noticeable reliability gains can be achieved by introducing learnable parameters to the Belief Propagation (BP) decoder. Despite the success of these methods, there are two key open problems. The first is the lack of interpretation of the learned weights, and the other is the lack of analysis for non-AWGN channels. In this work, we aim to bridge this gap by providing insights into the weights learned and their connection to the structure of the underlying code. We show that the weights are heavily influenced by the distribution of short cycles in the code. We next look at the performance of these decoders in non-AWGN channels, both synthetic and over-the-air channels, and study the complexity vs. performance trade-offs, demonstrating that increasing the number of parameters helps significantly in complex channels. Finally, we show that the decoders with learned weights achieve higher reliability than those with weights optimized analyti",
    "link": "http://arxiv.org/abs/2205.10684",
    "context": "Title: Interpreting Neural Min-Sum Decoders. (arXiv:2205.10684v2 [cs.IT] UPDATED)\nAbstract: In decoding linear block codes, it was shown that noticeable reliability gains can be achieved by introducing learnable parameters to the Belief Propagation (BP) decoder. Despite the success of these methods, there are two key open problems. The first is the lack of interpretation of the learned weights, and the other is the lack of analysis for non-AWGN channels. In this work, we aim to bridge this gap by providing insights into the weights learned and their connection to the structure of the underlying code. We show that the weights are heavily influenced by the distribution of short cycles in the code. We next look at the performance of these decoders in non-AWGN channels, both synthetic and over-the-air channels, and study the complexity vs. performance trade-offs, demonstrating that increasing the number of parameters helps significantly in complex channels. Finally, we show that the decoders with learned weights achieve higher reliability than those with weights optimized analyti",
    "path": "papers/22/05/2205.10684.json",
    "total_tokens": 919,
    "translated_title": "解读神经最小总和解码器",
    "translated_abstract": "在线性分组码的解码中，引入可学习参数到置信传播（BP）解码器中可以实现明显的可靠性增益。尽管这些方法取得成功，但有两个关键的未解决问题。第一个是对学习权重缺乏解释，另一个是对非AWGN信道缺乏分析。本文旨在通过提供对学习权重及其与基础码的结构的关系的见解来弥合这一差距。我们展示了权重受到代码短周期分布的严重影响。接下来，我们研究了这些解码器在非AWGN信道上的性能，包括合成信道和空中信道，并研究了复杂性与性能之间的权衡，证明增加参数数量可以在复杂信道上有显著的帮助。最后，我们展示了具有学习权重的解码器比那些经过解析优化的权重具有更高的可靠性。",
    "tldr": "本文研究了在解码线性分组码中引入可学习参数到BP解码器中的方法，发现这些参数受到代码短周期分布的影响，学习权重的解码器比那些经过解析优化的权重具有更高的可靠性，并在复杂信道上有显著的帮助。"
}