{
    "title": "Collaborative likelihood-ratio estimation over graphs",
    "abstract": "Assuming we have iid observations from two unknown probability density functions (pdfs), $p$ and $q$, the likelihood-ratio estimation (LRE) is an elegant approach to compare the two pdfs only by relying on the available data. In this paper, we introduce the first -to the best of our knowledge-graph-based extension of this problem, which reads as follows: Suppose each node $v$ of a fixed graph has access to observations coming from two unknown node-specific pdfs, $p_v$ and $q_v$, and the goal is to estimate for each node the likelihood-ratio between both pdfs by also taking into account the information provided by the graph structure. The node-level estimation tasks are supposed to exhibit similarities conveyed by the graph, which suggests that the nodes could collaborate to solve them more efficiently. We develop this idea in a concrete non-parametric method that we call Graph-based Relative Unconstrained Least-squares Importance Fitting (GRULSIF). We derive convergence rates for our c",
    "link": "https://arxiv.org/abs/2205.14461",
    "context": "Title: Collaborative likelihood-ratio estimation over graphs\nAbstract: Assuming we have iid observations from two unknown probability density functions (pdfs), $p$ and $q$, the likelihood-ratio estimation (LRE) is an elegant approach to compare the two pdfs only by relying on the available data. In this paper, we introduce the first -to the best of our knowledge-graph-based extension of this problem, which reads as follows: Suppose each node $v$ of a fixed graph has access to observations coming from two unknown node-specific pdfs, $p_v$ and $q_v$, and the goal is to estimate for each node the likelihood-ratio between both pdfs by also taking into account the information provided by the graph structure. The node-level estimation tasks are supposed to exhibit similarities conveyed by the graph, which suggests that the nodes could collaborate to solve them more efficiently. We develop this idea in a concrete non-parametric method that we call Graph-based Relative Unconstrained Least-squares Importance Fitting (GRULSIF). We derive convergence rates for our c",
    "path": "papers/22/05/2205.14461.json",
    "total_tokens": 821,
    "translated_title": "图上的协同似然比估计",
    "translated_abstract": "假设我们有来自两个未知概率密度函数 (pdfs) p 和 q 的独立同分布的观测值，似然比估计（LRE）是一种优雅的方法，只依靠现有数据来比较这两个概率密度函数。在本文中，我们介绍了目前为止首个基于图的扩展问题，其假设固定图的每个节点 v 都可以访问来自两个未知节点特定概率密度函数 p_v 和 q_v 的观测值，并且目标是通过同时考虑图结构提供的信息来估计每个节点之间的似然比。节点级别的估计任务应该展现出图传递的相似性，这暗示着节点可以协作来更有效地解决它们。我们以一个具体的非参数方法 GRULSIF 来开发这个想法。我们推导了我们方法的收敛速度。",
    "tldr": "该论文提出了基于图的协同似然比估计方法，通过考虑图结构信息，估计每个节点间的似然比，节点可以协作来更高效地解决问题。",
    "en_tdlr": "This paper introduces a graph-based collaborative likelihood-ratio estimation method, which estimates the likelihood-ratio between nodes by considering the graph structure information, allowing nodes to collaborate for more efficient solutions."
}