{
    "title": "Improved Algorithms for Bandit with Graph Feedback via Regret Decomposition. (arXiv:2205.15076v2 [cs.LG] UPDATED)",
    "abstract": "The problem of bandit with graph feedback generalizes both the multi-armed bandit (MAB) problem and the learning with expert advice problem by encoding in a directed graph how the loss vector can be observed in each round of the game. The mini-max regret is closely related to the structure of the feedback graph and their connection is far from being fully understood. We propose a new algorithmic framework for the problem based on a partition of the feedback graph. Our analysis reveals the interplay between various parts of the graph by decomposing the regret to the sum of the regret caused by small parts and the regret caused by their interaction. As a result, our algorithm can be viewed as an interpolation and generalization of the optimal algorithms for MAB and learning with expert advice. Our framework unifies previous algorithms for both strongly observable graphs and weakly observable graphs, resulting in improved and optimal regret bounds on a wide range of graph families includi",
    "link": "http://arxiv.org/abs/2205.15076",
    "context": "Title: Improved Algorithms for Bandit with Graph Feedback via Regret Decomposition. (arXiv:2205.15076v2 [cs.LG] UPDATED)\nAbstract: The problem of bandit with graph feedback generalizes both the multi-armed bandit (MAB) problem and the learning with expert advice problem by encoding in a directed graph how the loss vector can be observed in each round of the game. The mini-max regret is closely related to the structure of the feedback graph and their connection is far from being fully understood. We propose a new algorithmic framework for the problem based on a partition of the feedback graph. Our analysis reveals the interplay between various parts of the graph by decomposing the regret to the sum of the regret caused by small parts and the regret caused by their interaction. As a result, our algorithm can be viewed as an interpolation and generalization of the optimal algorithms for MAB and learning with expert advice. Our framework unifies previous algorithms for both strongly observable graphs and weakly observable graphs, resulting in improved and optimal regret bounds on a wide range of graph families includi",
    "path": "papers/22/05/2205.15076.json",
    "total_tokens": 940,
    "translated_title": "通过遗憾分解改进了带有图反馈的赌博机算法",
    "translated_abstract": "带有图反馈的赌博机问题通过在有向图中编码损失向量在每轮游戏中的观测方式，将多臂赌博机问题和学习与专家建议问题进行了推广。最小最大遗憾与反馈图的结构密切相关，但二者的关系尚未完全理解。我们提出了一种基于反馈图划分的新算法框架。通过将遗憾分解为由小部分和它们之间相互作用引起的遗憾之和，我们的分析揭示了图的各个部分之间的相互作用。因此，我们的算法可以被看作是多臂赌博机和学习与专家建议的最优算法的插值和推广。我们的框架统一了先前针对强观测图和弱观测图的算法，对包括许多图类族在内的范围更广的图家族得到了改进和最优遗憾界限。",
    "tldr": "通过遗憾分解，我们提出了一种基于反馈图划分的新算法框架，该框架统一了多臂赌博机和学习与专家建议的最优算法，对包括许多图类族在内的范围更广的图家族得到了改进和最优遗憾界限。",
    "en_tdlr": "By decomposing regret, we propose a new algorithmic framework based on feedback graph partition, which unifies optimal algorithms for multi-armed bandit and learning with expert advice and improves optimal regret bounds on a wider range of graph families, including many graph class families."
}