{
    "title": "Gradient Aligned Attacks via a Few Queries. (arXiv:2205.09518v2 [cs.CV] UPDATED)",
    "abstract": "Black-box query attacks, which rely only on the output of the victim model, have proven to be effective in attacking deep learning models. However, existing black-box query attacks show low performance in a novel scenario where only a few queries are allowed. To address this issue, we propose gradient aligned attacks (GAA), which use the gradient aligned losses (GAL) we designed on the surrogate model to estimate the accurate gradient to improve the attack performance on the victim model. Specifically, we propose a gradient aligned mechanism to ensure that the derivatives of the loss function with respect to the logit vector have the same weight coefficients between the surrogate and victim models. Using this mechanism, we transform the cross-entropy (CE) loss and margin loss into gradient aligned forms, i.e. the gradient aligned CE or margin losses. These losses not only improve the attack performance of our gradient aligned attacks in the novel scenario but also increase the query ef",
    "link": "http://arxiv.org/abs/2205.09518",
    "context": "Title: Gradient Aligned Attacks via a Few Queries. (arXiv:2205.09518v2 [cs.CV] UPDATED)\nAbstract: Black-box query attacks, which rely only on the output of the victim model, have proven to be effective in attacking deep learning models. However, existing black-box query attacks show low performance in a novel scenario where only a few queries are allowed. To address this issue, we propose gradient aligned attacks (GAA), which use the gradient aligned losses (GAL) we designed on the surrogate model to estimate the accurate gradient to improve the attack performance on the victim model. Specifically, we propose a gradient aligned mechanism to ensure that the derivatives of the loss function with respect to the logit vector have the same weight coefficients between the surrogate and victim models. Using this mechanism, we transform the cross-entropy (CE) loss and margin loss into gradient aligned forms, i.e. the gradient aligned CE or margin losses. These losses not only improve the attack performance of our gradient aligned attacks in the novel scenario but also increase the query ef",
    "path": "papers/22/05/2205.09518.json",
    "total_tokens": 749,
    "translated_title": "通过少量查询实现梯度对齐攻击",
    "translated_abstract": "黑盒查询攻击已被证明在攻击深度学习模型方面很有效。然而，在只允许少量查询的新颖情况下，现有的黑盒查询攻击展现出很低的性能。为了解决这个问题，我们提出了梯度对齐攻击（GAA），使用梯度对齐损失（GAL）在代理模型上估计准确梯度，从而提高对受害模型的攻击效果。",
    "tldr": "该论文提出了一种梯度对齐攻击方法，通过设计梯度对齐损失在代理模型上估计准确梯度，提高在少量查询的情况下对深度学习模型的攻击效果。",
    "en_tdlr": "This paper proposes a gradient aligned attack method to improve the attack performance on deep learning models with only a few queries allowed. The method uses gradient aligned losses on a surrogate model to estimate the accurate gradient and transforms the cross-entropy loss and margin loss into gradient aligned forms."
}