{
    "title": "Action Languages Based Actual Causality for Computational Ethics: a Sound and Complete Implementation in ASP. (arXiv:2205.02919v2 [cs.AI] UPDATED)",
    "abstract": "Although moral responsibility is not circumscribed by causality, they are both closely intermixed. Furthermore, rationally understanding the evolution of the physical world is inherently linked with the idea of causality. Thus, the decision-making applications based on automated planning inevitably have to deal with causality, especially if they consider imputability aspects or integrate references to ethical norms. The many debates around causation in the last decades have shown how complex this notion is and thus, how difficult is its integration with planning. As a result, much of the work in computational ethics relegates causality to the background, despite the considerations stated above. This paper's contribution is to provide a complete and sound translation into logic programming from an actual causation definition suitable for action languages, this definition is a formalisation of Wright's NESS test. The obtained logic program allows to deal with complex causal relations. In",
    "link": "http://arxiv.org/abs/2205.02919",
    "context": "Title: Action Languages Based Actual Causality for Computational Ethics: a Sound and Complete Implementation in ASP. (arXiv:2205.02919v2 [cs.AI] UPDATED)\nAbstract: Although moral responsibility is not circumscribed by causality, they are both closely intermixed. Furthermore, rationally understanding the evolution of the physical world is inherently linked with the idea of causality. Thus, the decision-making applications based on automated planning inevitably have to deal with causality, especially if they consider imputability aspects or integrate references to ethical norms. The many debates around causation in the last decades have shown how complex this notion is and thus, how difficult is its integration with planning. As a result, much of the work in computational ethics relegates causality to the background, despite the considerations stated above. This paper's contribution is to provide a complete and sound translation into logic programming from an actual causation definition suitable for action languages, this definition is a formalisation of Wright's NESS test. The obtained logic program allows to deal with complex causal relations. In",
    "path": "papers/22/05/2205.02919.json",
    "total_tokens": 961,
    "translated_title": "基于行动语言的实际因果关系对计算伦理学的影响：ASP的一个完整且可靠的实现（arXiv:2205.02919v2 [cs.AI] 更新版）",
    "translated_abstract": "尽管道德责任并不局限于因果关系，但它们密不可分地交织在一起。此外，理性地理解物理世界的演化与因果关系的概念有着固有的联系。因此，基于自动化规划的决策应用程序不可避免地必须处理因果关系，特别是如果它们考虑可归因性方面或整合对伦理规范的引用。尽管存在上述考虑，但过去几十年关于因果关系的许多辩论都表明了这个概念是多么的复杂，因此与规划的整合是多么的困难。因此，尽管存在上述考虑，计算伦理学中的许多工作仍将因果关系降到次要地位。本文的贡献是提供从适用于行动语言的实际因果关系定义到逻辑编程的完整且可靠的转换，该定义是Wright的NESS测试的形式化。所得到的逻辑程序可以处理复杂的因果关系。",
    "tldr": "本论文提供了一种从实际因果关系（NESS测试）定义到逻辑编程的转换方法，可以处理复杂的因果关系，这对于计算伦理学中涉及道德责任和伦理规范的决策应用程序尤为重要。",
    "en_tdlr": "This paper provides a sound and complete translation into logic programming from an actual causation definition suitable for action languages, allowing for the handling of complex causal relations, which is crucial for decision-making applications in computational ethics involving moral responsibility and ethical norms."
}