{
    "title": "ELQA: A Corpus of Metalinguistic Questions and Answers about English. (arXiv:2205.00395v2 [cs.CL] UPDATED)",
    "abstract": "We present ELQA, a corpus of questions and answers in and about the English language. Collected from two online forums, the >70k questions (from English learners and others) cover wide-ranging topics including grammar, meaning, fluency, and etymology. The answers include descriptions of general properties of English vocabulary and grammar as well as explanations about specific (correct and incorrect) usage examples. Unlike most NLP datasets, this corpus is metalinguistic -- it consists of language about language. As such, it can facilitate investigations of the metalinguistic capabilities of NLU models, as well as educational applications in the language learning domain. To study this, we define a free-form question answering task on our dataset and conduct evaluations on multiple LLMs (Large Language Models) to analyze their capacity to generate metalinguistic answers.",
    "link": "http://arxiv.org/abs/2205.00395",
    "context": "Title: ELQA: A Corpus of Metalinguistic Questions and Answers about English. (arXiv:2205.00395v2 [cs.CL] UPDATED)\nAbstract: We present ELQA, a corpus of questions and answers in and about the English language. Collected from two online forums, the >70k questions (from English learners and others) cover wide-ranging topics including grammar, meaning, fluency, and etymology. The answers include descriptions of general properties of English vocabulary and grammar as well as explanations about specific (correct and incorrect) usage examples. Unlike most NLP datasets, this corpus is metalinguistic -- it consists of language about language. As such, it can facilitate investigations of the metalinguistic capabilities of NLU models, as well as educational applications in the language learning domain. To study this, we define a free-form question answering task on our dataset and conduct evaluations on multiple LLMs (Large Language Models) to analyze their capacity to generate metalinguistic answers.",
    "path": "papers/22/05/2205.00395.json",
    "total_tokens": 811,
    "translated_title": "ELQA: 一个关于英语的元语言问题与答案的语料库",
    "translated_abstract": "我们提出了ELQA，一个关于英语语言的问题与答案的语料库。该语料库收集自两个在线论坛，涵盖丰富的主题，包括语法、意义、流利度和词源。答案包括对英语词汇和语法的一般性描述，以及关于特定用法例子的解释（正确和错误）。与大多数自然语言处理数据集不同，这个语料库是元语言的，即它由语言关于语言的内容组成。因此，它可以促进对自然语言理解模型的元语言能力的研究，以及在语言学习领域的教育应用。为了研究这一点，我们在我们的数据集上定义了一个自由形式的问答任务，并对多个大型语言模型进行评估，以分析它们生成元语言答案的能力。",
    "tldr": "ELQA是一个关于英语的元语言问题与答案的语料库，可以用于研究NLU模型的元语言能力和语言学习应用。"
}