{
    "title": "Mapping the landscape of histomorphological cancer phenotypes using self-supervised learning on unlabeled, unannotated pathology slides. (arXiv:2205.01931v3 [cs.CV] UPDATED)",
    "abstract": "Definitive cancer diagnosis and management depend upon the extraction of information from microscopy images by pathologists. These images contain complex information requiring time-consuming expert human interpretation that is prone to human bias. Supervised deep learning approaches have proven powerful for classification tasks, but they are inherently limited by the cost and quality of annotations used for training these models. To address this limitation of supervised methods, we developed Histomorphological Phenotype Learning (HPL), a fully blue{self-}supervised methodology that requires no expert labels or annotations and operates via the automatic discovery of discriminatory image features in small image tiles. Tiles are grouped into morphologically similar clusters which constitute a library of histomorphological phenotypes, revealing trajectories from benign to malignant tissue via inflammatory and reactive phenotypes. These clusters have distinct features which can be identifie",
    "link": "http://arxiv.org/abs/2205.01931",
    "context": "Title: Mapping the landscape of histomorphological cancer phenotypes using self-supervised learning on unlabeled, unannotated pathology slides. (arXiv:2205.01931v3 [cs.CV] UPDATED)\nAbstract: Definitive cancer diagnosis and management depend upon the extraction of information from microscopy images by pathologists. These images contain complex information requiring time-consuming expert human interpretation that is prone to human bias. Supervised deep learning approaches have proven powerful for classification tasks, but they are inherently limited by the cost and quality of annotations used for training these models. To address this limitation of supervised methods, we developed Histomorphological Phenotype Learning (HPL), a fully blue{self-}supervised methodology that requires no expert labels or annotations and operates via the automatic discovery of discriminatory image features in small image tiles. Tiles are grouped into morphologically similar clusters which constitute a library of histomorphological phenotypes, revealing trajectories from benign to malignant tissue via inflammatory and reactive phenotypes. These clusters have distinct features which can be identifie",
    "path": "papers/22/05/2205.01931.json",
    "total_tokens": 933,
    "translated_title": "使用自监督学习在未标记、未注释的病理切片上绘制组织形态学癌症表型的地图",
    "translated_abstract": "癌症的确诊和治疗依赖于病理学家从显微镜图像中提取信息。这些图像包含复杂的信息，需要耗时的专家人工解读，存在人为偏见的问题。虽然监督深度学习方法在分类任务中表现出强大的能力，但它们在训练模型时受到注释成本和质量的固有限制。为了解决监督方法的这种限制，我们开发了组织形态学表型学习 (Histomorphological Phenotype Learning, HPL) 方法，这是一种完全基于自监督的方法，不需要专家标签或注释，并通过自动发现小图像块中的区分性图像特征来进行操作。图像块被分组成形态相似的聚类，构成组织形态学表型的库，揭示了从良性到恶性组织经过炎症和反应性表型的轨迹。这些聚类具有独特的特征，可以被识别出来。",
    "tldr": "本研究提出了一种名为组织形态学表型学习的自监督方法，可以在未标记、未注释的病理切片上绘制出癌症组织的地图，从而揭示出不同表型间的特征和转变过程。",
    "en_tdlr": "This study presents a self-supervised learning method called Histomorphological Phenotype Learning (HPL) to map the landscape of cancer phenotypes on unlabeled and unannotated pathology slides, revealing features and transitions between different phenotypes."
}