{
    "title": "Cyber Risk Assessment for Capital Management. (arXiv:2205.08435v3 [q-fin.RM] UPDATED)",
    "abstract": "Cyber risk is an omnipresent risk in the increasingly digitized world that is known to be difficult to manage. This paper proposes a two-pillar cyber risk management framework to address such difficulty. The first pillar, cyber risk assessment, blends the frequency-severity model in insurance with the cascade model in cybersecurity, to capture the unique feature of cyber risk. The second pillar, cyber capital management, provides informative decision-making on a balanced cyber risk management strategy, which includes cybersecurity investments, insurance coverage, and reserves. This framework is demonstrated by a case study based on a historical cyber incident dataset, which shows that a comprehensive cost-benefit analysis is necessary for a budget-constrained company with competing objectives for cyber risk management. Sensitivity analysis also illustrates that the best strategy depends on various factors, such as the amount of cybersecurity investments and the effectiveness of cyberse",
    "link": "http://arxiv.org/abs/2205.08435",
    "context": "Title: Cyber Risk Assessment for Capital Management. (arXiv:2205.08435v3 [q-fin.RM] UPDATED)\nAbstract: Cyber risk is an omnipresent risk in the increasingly digitized world that is known to be difficult to manage. This paper proposes a two-pillar cyber risk management framework to address such difficulty. The first pillar, cyber risk assessment, blends the frequency-severity model in insurance with the cascade model in cybersecurity, to capture the unique feature of cyber risk. The second pillar, cyber capital management, provides informative decision-making on a balanced cyber risk management strategy, which includes cybersecurity investments, insurance coverage, and reserves. This framework is demonstrated by a case study based on a historical cyber incident dataset, which shows that a comprehensive cost-benefit analysis is necessary for a budget-constrained company with competing objectives for cyber risk management. Sensitivity analysis also illustrates that the best strategy depends on various factors, such as the amount of cybersecurity investments and the effectiveness of cyberse",
    "path": "papers/22/05/2205.08435.json",
    "total_tokens": 909,
    "translated_title": "资本管理的网络风险评估",
    "translated_abstract": "网络风险是一个在日益数字化的世界中无处不在的风险，众所周知，这种风险很难管理。本文提出了一个两柱网络风险管理框架来解决这个问题。第一柱，网络风险评估，将保险中的频率-严重性模型与网络安全中的级联模型相结合，以捕捉网络风险的独特特征。第二柱，网络资本管理，提供了有关平衡网络风险管理策略的信息决策，包括网络安全投资、保险覆盖和储备金。这个框架通过基于历史网络事件数据集的案例研究进行了演示，表明对于预算有限、目标多样化的公司来说，全面的成本效益分析对于网络风险管理至关重要。敏感性分析还说明了最佳策略取决于诸多因素，如网络安全投资的数量和效果。",
    "tldr": "本文提出了一个两柱网络风险管理框架，其中包括网络风险评估和网络资本管理。通过基于历史网络事件数据集的案例研究，展示了全面的成本效益分析对于网络风险管理的重要性，并说明最佳策略取决于不同因素。",
    "en_tdlr": "This paper proposes a two-pillar cyber risk management framework, including cyber risk assessment and cyber capital management. A comprehensive cost-benefit analysis is shown to be important for cyber risk management through a case study based on a historical cyber incident dataset, and it is highlighted that the best strategy depends on various factors."
}