{
    "title": "PLAtE: A Large-scale Dataset for List Page Web Extraction. (arXiv:2205.12386v2 [cs.CL] UPDATED)",
    "abstract": "Recently, neural models have been leveraged to significantly improve the performance of information extraction from semi-structured websites. However, a barrier for continued progress is the small number of datasets large enough to train these models. In this work, we introduce the PLAtE (Pages of Lists Attribute Extraction) benchmark dataset as a challenging new web extraction task. PLAtE focuses on shopping data, specifically extractions from product review pages with multiple items encompassing the tasks of: (1) finding product-list segmentation boundaries and (2) extracting attributes for each product. PLAtE is composed of 52, 898 items collected from 6, 694 pages and 156, 014 attributes, making it the first largescale list page web extraction dataset. We use a multi-stage approach to collect and annotate the dataset and adapt three state-of-the-art web extraction models to the two tasks comparing their strengths and weaknesses both quantitatively and qualitatively.",
    "link": "http://arxiv.org/abs/2205.12386",
    "context": "Title: PLAtE: A Large-scale Dataset for List Page Web Extraction. (arXiv:2205.12386v2 [cs.CL] UPDATED)\nAbstract: Recently, neural models have been leveraged to significantly improve the performance of information extraction from semi-structured websites. However, a barrier for continued progress is the small number of datasets large enough to train these models. In this work, we introduce the PLAtE (Pages of Lists Attribute Extraction) benchmark dataset as a challenging new web extraction task. PLAtE focuses on shopping data, specifically extractions from product review pages with multiple items encompassing the tasks of: (1) finding product-list segmentation boundaries and (2) extracting attributes for each product. PLAtE is composed of 52, 898 items collected from 6, 694 pages and 156, 014 attributes, making it the first largescale list page web extraction dataset. We use a multi-stage approach to collect and annotate the dataset and adapt three state-of-the-art web extraction models to the two tasks comparing their strengths and weaknesses both quantitatively and qualitatively.",
    "path": "papers/22/05/2205.12386.json",
    "total_tokens": 896,
    "translated_title": "PLAtE: 一个大规模的列表页网络抽取数据集",
    "translated_abstract": "最近，神经模型被利用来显著提高从半结构化网站中提取信息的性能。然而，继续进步的障碍是训练这些模型的数据集数量太少。在这项工作中，我们介绍了 PLAtE （Pages of Lists Attribute Extraction）基准数据集作为一个具有挑战性的新网络抽取任务。PLAtE 主要关注购物数据，特别是从包含多个项目的产品评论页面中提取，包含两个任务：（1）查找产品列表分割边界和（2）提取每个产品的属性。PLAtE由来自6,694个页面的52,898个项目和156,014个属性组成，是第一个大规模的列表页网络抽取数据集。我们使用多阶段方法来收集和注释数据集，并将三个最先进的网络抽取模型适应于两个任务，定量和定性比较它们的优缺点。",
    "tldr": "这个工作介绍了一个名为PLAtE的大规模列表页网络抽取数据集，用于从产品评论页面中提取商品列表和产品属性。数据集由52,898个项目和156,014个属性组成，是第一个大规模的列表页网络抽取数据集。",
    "en_tdlr": "This work introduces a large-scale dataset called PLAtE for list page web extraction, which aims to extract product-list segmentation boundaries and attributes from product review pages. This dataset, consisting of 52,898 items and 156,014 attributes, is the first large-scale dataset for list page web extraction. Three state-of-the-art web extraction models are adapted and compared in this work."
}