{
    "title": "Real-time Cooperative Vehicle Coordination at Unsignalized Road Intersections. (arXiv:2205.01278v2 [eess.SY] UPDATED)",
    "abstract": "Cooperative coordination at unsignalized road intersections, which aims to improve the driving safety and traffic throughput for connected and automated vehicles, has attracted increasing interests in recent years. However, most existing investigations either suffer from computational complexity or cannot harness the full potential of the road infrastructure. To this end, we first present a dedicated intersection coordination framework, where the involved vehicles hand over their control authorities and follow instructions from a centralized coordinator. Then a unified cooperative trajectory optimization problem will be formulated to maximize the traffic throughput while ensuring the driving safety and long-term stability of the coordination system. To address the key computational challenges in the real-world deployment, we reformulate this non-convex sequential decision problem into a model-free Markov Decision Process (MDP) and tackle it by devising a Twin Delayed Deep Deterministic",
    "link": "http://arxiv.org/abs/2205.01278",
    "context": "Title: Real-time Cooperative Vehicle Coordination at Unsignalized Road Intersections. (arXiv:2205.01278v2 [eess.SY] UPDATED)\nAbstract: Cooperative coordination at unsignalized road intersections, which aims to improve the driving safety and traffic throughput for connected and automated vehicles, has attracted increasing interests in recent years. However, most existing investigations either suffer from computational complexity or cannot harness the full potential of the road infrastructure. To this end, we first present a dedicated intersection coordination framework, where the involved vehicles hand over their control authorities and follow instructions from a centralized coordinator. Then a unified cooperative trajectory optimization problem will be formulated to maximize the traffic throughput while ensuring the driving safety and long-term stability of the coordination system. To address the key computational challenges in the real-world deployment, we reformulate this non-convex sequential decision problem into a model-free Markov Decision Process (MDP) and tackle it by devising a Twin Delayed Deep Deterministic",
    "path": "papers/22/05/2205.01278.json",
    "total_tokens": 1125,
    "translated_title": "无信号道路交叉口的实时车辆协同协调",
    "translated_abstract": "为了提高连接和自动化车辆的行驶安全和交通通行能力，无信号道路交叉口的协作协调近年来越来越受到关注。然而，大多数现有的研究要么存在计算复杂度问题，要么不能充分利用道路基础设施的潜力。为此，我们首先提出了一个专用的交叉口协调框架，其中涉及的车辆交出控制权限，并遵循来自集中协调器的指令。然后，将制定一个统一的协作轨迹优化问题，以最大化交通通行能力，同时确保驾驶安全和协调系统的长期稳定性。为了解决实际部署中的主要计算挑战，我们将这个非凸顺序决策问题重新制定为一个无模型马尔可夫决策过程（MDP），并通过设计具有两个并行神经网络的双延迟深度确定性网络（T3D）算法来解决它。我们提出的方法可以实现低计算复杂度和高可扩展性的实时车辆协同协调。广泛的仿真结果证明了我们的方法在交通通行能力、驾驶安全和协调稳定性方面的优越性。",
    "tldr": "该论文提出了一种实时车辆协同协调框架，涉及的车辆交出控制权限，并通过解决非凸顺序决策问题的方式，利用双延迟深度确定性网络（T3D）算法实现最大化交通通行能力，同时确保驾驶安全和协调系统的长期稳定性。广泛的仿真结果证明了该方法在交通通行能力、驾驶安全和协调稳定性方面的优越性。",
    "en_tdlr": "This paper proposes a real-time vehicle coordination framework where vehicles hand over control and follow centralized instructions, and uses a Twin Delayed Deep Deterministic Network algorithm to solve a unified cooperative trajectory optimization problem. The proposed method achieves high scalability and low computational complexity, with simulation results demonstrating its superiority in terms of traffic throughput, driving safety, and coordination stability."
}