{
    "title": "Subgeometrically ergodic autoregressions with autoregressive conditional heteroskedasticity. (arXiv:2205.11953v2 [econ.EM] UPDATED)",
    "abstract": "In this paper, we consider subgeometric (specifically, polynomial) ergodicity of univariate nonlinear autoregressions with autoregressive conditional heteroskedasticity (ARCH). The notion of subgeometric ergodicity was introduced in the Markov chain literature in 1980s and it means that the transition probability measures converge to the stationary measure at a rate slower than geometric; this rate is also closely related to the convergence rate of $\\beta$-mixing coefficients. While the existing literature on subgeometrically ergodic autoregressions assumes a homoskedastic error term, this paper provides an extension to the case of conditionally heteroskedastic ARCH-type errors, considerably widening the scope of potential applications. Specifically, we consider suitably defined higher-order nonlinear autoregressions with possibly nonlinear ARCH errors and show that they are, under appropriate conditions, subgeometrically ergodic at a polynomial rate. An empirical example using energy ",
    "link": "http://arxiv.org/abs/2205.11953",
    "context": "Title: Subgeometrically ergodic autoregressions with autoregressive conditional heteroskedasticity. (arXiv:2205.11953v2 [econ.EM] UPDATED)\nAbstract: In this paper, we consider subgeometric (specifically, polynomial) ergodicity of univariate nonlinear autoregressions with autoregressive conditional heteroskedasticity (ARCH). The notion of subgeometric ergodicity was introduced in the Markov chain literature in 1980s and it means that the transition probability measures converge to the stationary measure at a rate slower than geometric; this rate is also closely related to the convergence rate of $\\beta$-mixing coefficients. While the existing literature on subgeometrically ergodic autoregressions assumes a homoskedastic error term, this paper provides an extension to the case of conditionally heteroskedastic ARCH-type errors, considerably widening the scope of potential applications. Specifically, we consider suitably defined higher-order nonlinear autoregressions with possibly nonlinear ARCH errors and show that they are, under appropriate conditions, subgeometrically ergodic at a polynomial rate. An empirical example using energy ",
    "path": "papers/22/05/2205.11953.json",
    "total_tokens": 997,
    "translated_title": "考虑自回归条件异方差的次几何遍历自回归",
    "translated_abstract": "本文研究具有自回归条件异方差(ARCH)的非线性单变量自回归的次几何（具体而言是多项式几何）遍历性。次几何遍历性是1980年代在马尔科夫链文献中引入的概念，它意味着转移概率测度以比几何级数更慢的速率收敛于稳态测度；而这个速率也与$\\beta$混合系数的收敛速率密切相关。现有次几何遍历自回归文献假设误差项是同方差的，本文提供了一个扩展，涵盖了有条件异方差ARCH类型误差的情况，从而极大地扩展了潜在应用的范围。具体而言，我们考虑适当定义的高阶非线性自回归，可能具有非线性的ARCH误差，并表明在适当条件下，它们是次几何遍历的，且速率是多项式的。并且我们利用能源数据提供了一个实证例子。",
    "tldr": "本文研究了具有条件异方差的高阶非线性自回归，证明了在适当条件下它们是次几何遍历的。这个结果极大地扩展了其潜在应用范围。",
    "en_tdlr": "This paper studies subgeometrically ergodic polynomial univariate nonlinear autoregressions with autoregressive conditional heteroskedasticity (ARCH). It extends the existing literature by considering the case with conditionally heteroskedastic ARCH-type errors, and shows that suitably defined higher-order nonlinear autoregressions are subgeometrically ergodic at a polynomial rate under appropriate conditions. The result considerably widens the potential applications of the subgeometrically ergodic autoregressions."
}