{
    "title": "Pattern reconstruction with restricted Boltzmann machines. (arXiv:2205.07087v3 [math.PR] UPDATED)",
    "abstract": "Restricted Boltzmann machines are energy models made of a visible and a hidden layer. We identify an effective energy function describing the zero-temperature landscape on the visible units and depending only on the tail behaviour of the hidden layer prior distribution. Studying the location of the local minima of such an energy function, we show that the ability of a restricted Boltzmann machine to reconstruct a random pattern depends indeed only on the tail of the hidden prior distribution. We find that hidden priors with strictly super-Gaussian tails give only a logarithmic loss in pattern retrieval, while an efficient retrieval is much harder with hidden units with strictly sub-Gaussian tails; if the hidden prior has Gaussian tails, the retrieval capability is determined by the number of hidden units (as in the Hopfield model).",
    "link": "http://arxiv.org/abs/2205.07087",
    "context": "Title: Pattern reconstruction with restricted Boltzmann machines. (arXiv:2205.07087v3 [math.PR] UPDATED)\nAbstract: Restricted Boltzmann machines are energy models made of a visible and a hidden layer. We identify an effective energy function describing the zero-temperature landscape on the visible units and depending only on the tail behaviour of the hidden layer prior distribution. Studying the location of the local minima of such an energy function, we show that the ability of a restricted Boltzmann machine to reconstruct a random pattern depends indeed only on the tail of the hidden prior distribution. We find that hidden priors with strictly super-Gaussian tails give only a logarithmic loss in pattern retrieval, while an efficient retrieval is much harder with hidden units with strictly sub-Gaussian tails; if the hidden prior has Gaussian tails, the retrieval capability is determined by the number of hidden units (as in the Hopfield model).",
    "path": "papers/22/05/2205.07087.json",
    "total_tokens": 782,
    "translated_title": "限制玻尔兹曼机的模式重构",
    "translated_abstract": "限制玻尔兹曼机是由可见层和隐藏层组成的能量模型。我们找到了描述可见单元上零温度状态的有效能量函数，该函数只依赖于隐藏层先验分布的尾部行为。通过研究该能量函数的局部极小值的位置，我们表明限制玻尔兹曼机重构随机模式的能力确实只取决于隐藏先验分布的尾部。我们发现，具有严格超高斯尾部的隐藏先验仅导致对模式恢复的对数损失，而具有严格次高斯尾部的隐藏单元则导致更难进行有效的恢复；如果隐藏先验具有高斯尾部，恢复能力取决于隐藏单元的数量（与霍普菲尔德模型类似）。",
    "tldr": "该论文研究了限制玻尔兹曼机在模式重构中的能力，发现隐藏层先验分布的尾部行为对于恢复随机模式的效果有关键影响。",
    "en_tdlr": "This paper investigates the ability of restricted Boltzmann machines in pattern reconstruction and finds that the tail behavior of the hidden layer prior distribution plays a crucial role in the effectiveness of retrieving random patterns."
}