{
    "title": "A cGAN Ensemble-based Uncertainty-aware Surrogate Model for Offline Model-based Optimization in Industrial Control Problems",
    "abstract": "arXiv:2205.07250v2 Announce Type: replace-cross  Abstract: This study focuses on two important problems related to applying offline model-based optimization to real-world industrial control problems. The first problem is how to create a reliable probabilistic model that accurately captures the dynamics present in noisy industrial data. The second problem is how to reliably optimize control parameters without actively collecting feedback from industrial systems. Specifically, we introduce a novel cGAN ensemble-based uncertainty-aware surrogate model for reliable offline model-based optimization in industrial control problems. The effectiveness of the proposed method is demonstrated through extensive experiments conducted on two representative cases, namely a discrete control case and a continuous control case. The results of these experiments show that our method outperforms several competitive baselines in the field of offline model-based optimization for industrial control.",
    "link": "https://arxiv.org/abs/2205.07250",
    "context": "Title: A cGAN Ensemble-based Uncertainty-aware Surrogate Model for Offline Model-based Optimization in Industrial Control Problems\nAbstract: arXiv:2205.07250v2 Announce Type: replace-cross  Abstract: This study focuses on two important problems related to applying offline model-based optimization to real-world industrial control problems. The first problem is how to create a reliable probabilistic model that accurately captures the dynamics present in noisy industrial data. The second problem is how to reliably optimize control parameters without actively collecting feedback from industrial systems. Specifically, we introduce a novel cGAN ensemble-based uncertainty-aware surrogate model for reliable offline model-based optimization in industrial control problems. The effectiveness of the proposed method is demonstrated through extensive experiments conducted on two representative cases, namely a discrete control case and a continuous control case. The results of these experiments show that our method outperforms several competitive baselines in the field of offline model-based optimization for industrial control.",
    "path": "papers/22/05/2205.07250.json",
    "total_tokens": 813,
    "translated_title": "一个基于cGAN集成的关注不确定性的离线模型优化工业控制问题的替代模型",
    "translated_abstract": "本研究关注将离线模型优化应用于真实世界工业控制问题时遇到的两个重要问题。第一个问题是如何创建一个可靠的概率模型，准确捕捉嘈杂工业数据中存在的动态特性。第二个问题是如何在不主动收集工业系统反馈的情况下可靠地优化控制参数。具体来说，我们引入了一个新颖的基于cGAN集成的关注不确定性的替代模型，用于可靠地处理工业控制问题中的离线模型优化。通过在两个代表性案例上进行的大量实验来证明所提方法的有效性，即离散控制案例和连续控制案例。这些实验结果表明，我们的方法在工业控制的离线模型优化领域中胜过了几个竞争基线模型。",
    "tldr": "引入了一个基于cGAN集成的关注不确定性的替代模型，用于可靠处理工业控制问题中的离线模型优化，实验结果表明其优于竞争基线模型。",
    "en_tdlr": "Introduced a novel cGAN ensemble-based uncertainty-aware surrogate model for reliable offline model-based optimization in industrial control problems, which outperforms competitive baselines according to experimental results."
}