{
    "title": "Automated Algorithm Selection for Radar Network Configuration. (arXiv:2205.03670v2 [cs.NE] UPDATED)",
    "abstract": "The configuration of radar networks is a complex problem that is often performed manually by experts with the help of a simulator. Different numbers and types of radars as well as different locations that the radars shall cover give rise to different instances of the radar configuration problem. The exact modeling of these instances is complex, as the quality of the configurations depends on a large number of parameters, on internal radar processing, and on the terrains on which the radars need to be placed. Classic optimization algorithms can therefore not be applied to this problem, and we rely on \"trial-and-error\" black-box approaches.  In this paper, we study the performances of 13 black-box optimization algorithms on 153 radar network configuration problem instances. The algorithms perform considerably better than human experts. Their ranking, however, depends on the budget of configurations that can be evaluated and on the elevation profile of the location. We therefore also inve",
    "link": "http://arxiv.org/abs/2205.03670",
    "context": "Title: Automated Algorithm Selection for Radar Network Configuration. (arXiv:2205.03670v2 [cs.NE] UPDATED)\nAbstract: The configuration of radar networks is a complex problem that is often performed manually by experts with the help of a simulator. Different numbers and types of radars as well as different locations that the radars shall cover give rise to different instances of the radar configuration problem. The exact modeling of these instances is complex, as the quality of the configurations depends on a large number of parameters, on internal radar processing, and on the terrains on which the radars need to be placed. Classic optimization algorithms can therefore not be applied to this problem, and we rely on \"trial-and-error\" black-box approaches.  In this paper, we study the performances of 13 black-box optimization algorithms on 153 radar network configuration problem instances. The algorithms perform considerably better than human experts. Their ranking, however, depends on the budget of configurations that can be evaluated and on the elevation profile of the location. We therefore also inve",
    "path": "papers/22/05/2205.03670.json",
    "total_tokens": 789,
    "translated_title": "自动化雷达网络配置算法选择",
    "translated_abstract": "雷达网络的配置是一个复杂的问题，通常需要专家使用模拟器手动完成。不同数量和类型的雷达以及雷达应涵盖的不同位置给雷达配置问题带来了不同的实例。准确建模这些实例是复杂的，因为配置质量取决于大量参数、内部雷达处理以及雷达需要放置的地形。经典的优化算法因此不能应用于这个问题，我们依靠“试错”黑盒方法。本文研究了13种黑盒优化算法在153个雷达网络配置问题实例上的表现。这些算法的表现比人类专家要好得多。然而，它们的排名取决于可评估配置的预算和所处位置的高程文件。",
    "tldr": "研究了13种黑盒优化算法在153个雷达网络配置问题实例上的表现，这些算法比人类专家要更好。但它们的排名取决于预算和位置高程。",
    "en_tdlr": "This paper studies the performance of 13 black-box optimization algorithms on 153 instances of the radar network configuration problem and finds that these algorithms outperform human experts, although their ranking depends on the budget of configurations that can be evaluated and on the elevation profile of the location."
}