{
    "title": "Selective Inference for Sparse Multitask Regression with Applications in Neuroimaging. (arXiv:2205.14220v3 [stat.ME] UPDATED)",
    "abstract": "Multi-task learning is frequently used to model a set of related response variables from the same set of features, improving predictive performance and modeling accuracy relative to methods that handle each response variable separately. Despite the potential of multi-task learning to yield more powerful inference than single-task alternatives, prior work in this area has largely omitted uncertainty quantification. Our focus in this paper is a common multi-task problem in neuroimaging, where the goal is to understand the relationship between multiple cognitive task scores (or other subject-level assessments) and brain connectome data collected from imaging. We propose a framework for selective inference to address this problem, with the flexibility to: (i) jointly identify the relevant covariates for each task through a sparsity-inducing penalty, and (ii) conduct valid inference in a model based on the estimated sparsity structure. Our framework offers a new conditional procedure for in",
    "link": "http://arxiv.org/abs/2205.14220",
    "context": "Title: Selective Inference for Sparse Multitask Regression with Applications in Neuroimaging. (arXiv:2205.14220v3 [stat.ME] UPDATED)\nAbstract: Multi-task learning is frequently used to model a set of related response variables from the same set of features, improving predictive performance and modeling accuracy relative to methods that handle each response variable separately. Despite the potential of multi-task learning to yield more powerful inference than single-task alternatives, prior work in this area has largely omitted uncertainty quantification. Our focus in this paper is a common multi-task problem in neuroimaging, where the goal is to understand the relationship between multiple cognitive task scores (or other subject-level assessments) and brain connectome data collected from imaging. We propose a framework for selective inference to address this problem, with the flexibility to: (i) jointly identify the relevant covariates for each task through a sparsity-inducing penalty, and (ii) conduct valid inference in a model based on the estimated sparsity structure. Our framework offers a new conditional procedure for in",
    "path": "papers/22/05/2205.14220.json",
    "total_tokens": 923,
    "translated_title": "多任务稀疏回归的选择推断及其在神经影像学中的应用",
    "translated_abstract": "多任务学习被广泛应用于从同一特征集中模拟一组相关响应变量，相比于单独处理每个响应变量的方法，可以提高预测性能和建模精度。但多任务学习在推断不确定性方面的研究还较少。本文通过稀疏性信号加强方法，针对神经影像学中的常见多任务问题，提出了一种选择推断框架，具有灵活性，可以同时识别出每个任务相关的协变量，并建立基于稀疏结构的有效推断模型。",
    "tldr": "本文提出了一种多任务稀疏回归的选择推断框架，在神经影像学中应用，可以提高建模精度和预测性能。",
    "en_tdlr": "This paper proposes a selective inference framework for sparse multitask regression, which is applied in neuroimaging to improve modeling accuracy and predictive performance. The framework identifies relevant covariates for each task through a sparsity-inducing penalty and conducts valid inference based on the estimated sparsity structure."
}