{
    "title": "Lifelong Ensemble Learning based on Multiple Representations for Few-Shot Object Recognition. (arXiv:2205.01982v4 [cs.RO] UPDATED)",
    "abstract": "Service robots are integrating more and more into our daily lives to help us with various tasks. In such environments, robots frequently face new objects while working in the environment and need to learn them in an open-ended fashion. Furthermore, such robots must be able to recognize a wide range of object categories. In this paper, we present a lifelong ensemble learning approach based on multiple representations to address the few-shot object recognition problem. In particular, we form ensemble methods based on deep representations and handcrafted 3D shape descriptors. To facilitate lifelong learning, each approach is equipped with a memory unit for storing and retrieving object information instantly. The proposed model is suitable for open-ended learning scenarios where the number of 3D object categories is not fixed and can grow over time. We have performed extensive sets of experiments to assess the performance of the proposed approach in offline, and open-ended scenarios. For t",
    "link": "http://arxiv.org/abs/2205.01982",
    "context": "Title: Lifelong Ensemble Learning based on Multiple Representations for Few-Shot Object Recognition. (arXiv:2205.01982v4 [cs.RO] UPDATED)\nAbstract: Service robots are integrating more and more into our daily lives to help us with various tasks. In such environments, robots frequently face new objects while working in the environment and need to learn them in an open-ended fashion. Furthermore, such robots must be able to recognize a wide range of object categories. In this paper, we present a lifelong ensemble learning approach based on multiple representations to address the few-shot object recognition problem. In particular, we form ensemble methods based on deep representations and handcrafted 3D shape descriptors. To facilitate lifelong learning, each approach is equipped with a memory unit for storing and retrieving object information instantly. The proposed model is suitable for open-ended learning scenarios where the number of 3D object categories is not fixed and can grow over time. We have performed extensive sets of experiments to assess the performance of the proposed approach in offline, and open-ended scenarios. For t",
    "path": "papers/22/05/2205.01982.json",
    "total_tokens": 901,
    "translated_title": "基于多重表示的终身集成学习在少样本目标识别中的应用",
    "translated_abstract": "服务机器人越来越多地融入我们的日常生活，帮助我们处理各种任务。在这样的环境中，机器人经常面对新的物体，并需要以开放式方式学习它们。此外，这样的机器人必须能够识别各种物体类别。本文提出了一种基于多重表示的终身集成学习方法，以解决少样本目标识别问题。具体地，我们基于深度表示和手工制作的3D形状描述符形成集成方法。为了促进终身学习，每种方法都配备了一个存储和瞬间检索物体信息的记忆单元。所提出的模型适用于三维物体类别数量不固定、随时间增长的开放式学习场景。我们进行了广泛的实验，评估了所提出方法在离线及开放式场景下的性能。",
    "tldr": "本文提出了一种基于多重表示的终身集成学习方法，用于开放式场景下的少样本目标识别问题，适用于三维物体类别数量不固定、随时间增长的场景。模型针对各种类型物体进行处理，并进行了广泛实验。"
}