{
    "title": "DPSNN: A Differentially Private Spiking Neural Network with Temporal Enhanced Pooling. (arXiv:2205.12718v3 [cs.NE] UPDATED)",
    "abstract": "Privacy protection is a crucial issue in machine learning algorithms, and the current privacy protection is combined with traditional artificial neural networks based on real values. Spiking neural network (SNN), the new generation of artificial neural networks, plays a crucial role in many fields. Therefore, research on the privacy protection of SNN is urgently needed. This paper combines the differential privacy(DP) algorithm with SNN and proposes a differentially private spiking neural network (DPSNN). The SNN uses discrete spike sequences to transmit information, combined with the gradient noise introduced by DP so that SNN maintains strong privacy protection. At the same time, to make SNN maintain high performance while obtaining high privacy protection, we propose the temporal enhanced pooling (TEP) method. It fully integrates the temporal information of SNN into the spatial information transfer, which enables SNN to perform better information transfer. We conduct experiments on ",
    "link": "http://arxiv.org/abs/2205.12718",
    "context": "Title: DPSNN: A Differentially Private Spiking Neural Network with Temporal Enhanced Pooling. (arXiv:2205.12718v3 [cs.NE] UPDATED)\nAbstract: Privacy protection is a crucial issue in machine learning algorithms, and the current privacy protection is combined with traditional artificial neural networks based on real values. Spiking neural network (SNN), the new generation of artificial neural networks, plays a crucial role in many fields. Therefore, research on the privacy protection of SNN is urgently needed. This paper combines the differential privacy(DP) algorithm with SNN and proposes a differentially private spiking neural network (DPSNN). The SNN uses discrete spike sequences to transmit information, combined with the gradient noise introduced by DP so that SNN maintains strong privacy protection. At the same time, to make SNN maintain high performance while obtaining high privacy protection, we propose the temporal enhanced pooling (TEP) method. It fully integrates the temporal information of SNN into the spatial information transfer, which enables SNN to perform better information transfer. We conduct experiments on ",
    "path": "papers/22/05/2205.12718.json",
    "total_tokens": 998,
    "translated_title": "DPSNN: 差分隐私脉冲神经网络与时序增强池化",
    "translated_abstract": "隐私保护是机器学习算法中至关重要的问题，目前的隐私保护方法常常结合传统基于实数的人工神经网络。作为新一代人工神经网络，脉冲神经网络（SNN）在许多领域中发挥着关键作用，因此，有必要对SNN的隐私保护进行研究。本文将差分隐私（DP）算法与SNN相结合，提出了一种差分隐私脉冲神经网络（DPSNN）。SNN使用离散的脉冲序列来传输信息，并结合DP引入的梯度噪声，从而使SNN保持强大的隐私保护。同时，为了使SNN在获得高隐私保护的同时保持高性能，我们提出了时序增强池化（TEP）方法。该方法充分将SNN的时序信息与空间信息传输结合起来，使SNN能够更好地进行信息传输。我们对DPSNN在MNIST和CIFAR-10数据集上进行了实验证明了其有效性。",
    "tldr": "本文提出了一种差分隐私脉冲神经网络（DPSNN），将差分隐私算法与脉冲神经网络相结合，保持了SNN的强隐私保护；同时提出了时序增强池化（TEP）方法，使SNN能够获得更好的信息传输。在MNIST和CIFAR-10数据集上进行实验验证了该方法的有效性。"
}