{
    "title": "DDAC-SpAM: A Distributed Algorithm for Fitting High-dimensional Sparse Additive Models with Feature Division and Decorrelation. (arXiv:2205.07932v2 [cs.LG] UPDATED)",
    "abstract": "Distributed statistical learning has become a popular technique for large-scale data analysis. Most existing work in this area focuses on dividing the observations, but we propose a new algorithm, DDAC-SpAM, which divides the features under a high-dimensional sparse additive model. Our approach involves three steps: divide, decorrelate, and conquer. The decorrelation operation enables each local estimator to recover the sparsity pattern for each additive component without imposing strict constraints on the correlation structure among variables. The effectiveness and efficiency of the proposed algorithm are demonstrated through theoretical analysis and empirical results on both synthetic and real data. The theoretical results include both the consistent sparsity pattern recovery as well as statistical inference for each additive functional component. Our approach provides a practical solution for fitting sparse additive models, with promising applications in a wide range of domains.",
    "link": "http://arxiv.org/abs/2205.07932",
    "context": "Title: DDAC-SpAM: A Distributed Algorithm for Fitting High-dimensional Sparse Additive Models with Feature Division and Decorrelation. (arXiv:2205.07932v2 [cs.LG] UPDATED)\nAbstract: Distributed statistical learning has become a popular technique for large-scale data analysis. Most existing work in this area focuses on dividing the observations, but we propose a new algorithm, DDAC-SpAM, which divides the features under a high-dimensional sparse additive model. Our approach involves three steps: divide, decorrelate, and conquer. The decorrelation operation enables each local estimator to recover the sparsity pattern for each additive component without imposing strict constraints on the correlation structure among variables. The effectiveness and efficiency of the proposed algorithm are demonstrated through theoretical analysis and empirical results on both synthetic and real data. The theoretical results include both the consistent sparsity pattern recovery as well as statistical inference for each additive functional component. Our approach provides a practical solution for fitting sparse additive models, with promising applications in a wide range of domains.",
    "path": "papers/22/05/2205.07932.json",
    "total_tokens": 904,
    "translated_title": "DDAC-SpAM: 一种用特征划分和去相关性的方法拟合高维稀疏加性模型的分布式算法",
    "translated_abstract": "分布式统计学习已成为大规模数据分析的常用技术。现有的大部分工作都是关注观察值的划分，但我们提出了一种新的算法DDAC-SpAM，在高维稀疏加性模型中对特征进行划分。我们的方法包括三个步骤：划分、去相关和征服。去相关操作使每个局部估计器能够恢复每个加性组分的稀疏模式，而不对变量之间的相关性结构施加严格的约束。通过理论分析和在合成数据和真实数据上的实证结果，证明了该算法的有效性和效率。理论结果包括一致的稀疏模式恢复以及对每个加性函数组成部分的统计推断。我们的方法为拟合稀疏加性模型提供了实际可行的解决方案，在各个领域有着广泛的应用前景。",
    "tldr": "DDAC-SpAM是一种在高维稀疏加性模型中利用特征划分和去相关的分布式算法。去相关操作使得每个局部估计器能够恢复每个加性组分的稀疏模式，同时不对变量之间的相关性结构施加严格的约束。该算法在理论和实证分析中证明了其有效性和效率，为拟合稀疏加性模型提供了实际解决方案。"
}