{
    "title": "VAE-Loco: Versatile Quadruped Locomotion by Learning a Disentangled Gait Representation. (arXiv:2205.01179v2 [cs.RO] UPDATED)",
    "abstract": "Quadruped locomotion is rapidly maturing to a degree where robots are able to realise highly dynamic manoeuvres. However, current planners are unable to vary key gait parameters of the in-swing feet midair. In this work we address this limitation and show that it is pivotal in increasing controller robustness by learning a latent space capturing the key stance phases constituting a particular gait. This is achieved via a generative model trained on a single trot style, which encourages disentanglement such that application of a drive signal to a single dimension of the latent state induces holistic plans synthesising a continuous variety of trot styles. We demonstrate that specific properties of the drive signal map directly to gait parameters such as cadence, footstep height and full stance duration. Due to the nature of our approach these synthesised gaits are continuously variable online during robot operation. The use of a generative model facilitates the detection and mitigation o",
    "link": "http://arxiv.org/abs/2205.01179",
    "context": "Title: VAE-Loco: Versatile Quadruped Locomotion by Learning a Disentangled Gait Representation. (arXiv:2205.01179v2 [cs.RO] UPDATED)\nAbstract: Quadruped locomotion is rapidly maturing to a degree where robots are able to realise highly dynamic manoeuvres. However, current planners are unable to vary key gait parameters of the in-swing feet midair. In this work we address this limitation and show that it is pivotal in increasing controller robustness by learning a latent space capturing the key stance phases constituting a particular gait. This is achieved via a generative model trained on a single trot style, which encourages disentanglement such that application of a drive signal to a single dimension of the latent state induces holistic plans synthesising a continuous variety of trot styles. We demonstrate that specific properties of the drive signal map directly to gait parameters such as cadence, footstep height and full stance duration. Due to the nature of our approach these synthesised gaits are continuously variable online during robot operation. The use of a generative model facilitates the detection and mitigation o",
    "path": "papers/22/05/2205.01179.json",
    "total_tokens": 908,
    "translated_title": "VAE-Loco：通过学习解缠踏步表示实现多功能四足动态步态",
    "translated_abstract": "四足动态步态正在快速发展，使得机器人能够实现高度动态的机动动作。然而，当前的规划器无法在空中改变摆动脚的关键步态参数。在这项工作中，我们解决了这个限制，并展示了通过学习捕捉构成特定步态的关键支撑阶段的潜在空间，可以增加控制器的稳健性。通过在单一驰步风格上训练的生成模型实现此目标，该模型鼓励解缠，使得对潜在状态的单一维度施加驱动信号能够综合连续多样化的驰步风格合成全面性计划。我们证明了驱动信号的特定属性直接映射到步态参数，如节奏、脚步高度和全阶段持续时间。由于我们方法的特点，这些合成的步态在机器人运行过程中可以在线持续变化。生成模型的使用有助于检测和缓解问题。",
    "tldr": "本论文通过学习一个解缠的步态表示来解决四足机器人步态参数无法在空中变化的问题，实现了多样化的连续合成步态，增加了控制器的稳健性。",
    "en_tdlr": "This paper addresses the limitation of fixed gait parameters in aerial swing feet by learning a disentangled gait representation, allowing for continuous synthesis of versatile gaits and improving controller robustness."
}