{
    "title": "Bongard-HOI: Benchmarking Few-Shot Visual Reasoning for Human-Object Interactions. (arXiv:2205.13803v2 [cs.CV] UPDATED)",
    "abstract": "A significant gap remains between today's visual pattern recognition models and human-level visual cognition especially when it comes to few-shot learning and compositional reasoning of novel concepts. We introduce Bongard-HOI, a new visual reasoning benchmark that focuses on compositional learning of human-object interactions (HOIs) from natural images. It is inspired by two desirable characteristics from the classical Bongard problems (BPs): 1) few-shot concept learning, and 2) context-dependent reasoning. We carefully curate the few-shot instances with hard negatives, where positive and negative images only disagree on action labels, making mere recognition of object categories insufficient to complete our benchmarks. We also design multiple test sets to systematically study the generalization of visual learning models, where we vary the overlap of the HOI concepts between the training and test sets of few-shot instances, from partial to no overlaps. Bongard-HOI presents a substanti",
    "link": "http://arxiv.org/abs/2205.13803",
    "context": "Title: Bongard-HOI: Benchmarking Few-Shot Visual Reasoning for Human-Object Interactions. (arXiv:2205.13803v2 [cs.CV] UPDATED)\nAbstract: A significant gap remains between today's visual pattern recognition models and human-level visual cognition especially when it comes to few-shot learning and compositional reasoning of novel concepts. We introduce Bongard-HOI, a new visual reasoning benchmark that focuses on compositional learning of human-object interactions (HOIs) from natural images. It is inspired by two desirable characteristics from the classical Bongard problems (BPs): 1) few-shot concept learning, and 2) context-dependent reasoning. We carefully curate the few-shot instances with hard negatives, where positive and negative images only disagree on action labels, making mere recognition of object categories insufficient to complete our benchmarks. We also design multiple test sets to systematically study the generalization of visual learning models, where we vary the overlap of the HOI concepts between the training and test sets of few-shot instances, from partial to no overlaps. Bongard-HOI presents a substanti",
    "path": "papers/22/05/2205.13803.json",
    "total_tokens": 1065,
    "translated_title": "Bongard-HOI：基于人-物交互的几种情况视觉推理基准测试",
    "translated_abstract": "目前，当涉及到新概念的几种情况学习和组合推理时，今天的视觉图案识别模型和人类级别的视觉认知之间仍存在巨大差距。本文引入了Bongard-HOI，这是一个新的视觉推理基准测试，侧重于从自然图像中学习人-物交互的组合性学习。它受到古典的Bongard问题（BPs）中的两个可取特征的启发：1）几种情况的概念学习和2）上下文相关的推理。我们精心策划了少样本实例包含困难的负例，其中正负图像仅在动作标签上存在差异，仅仅对对象类别的识别不足以完成我们的基准测试。我们还设计了多个测试集，以系统研究视觉学习模型的泛化能力，其中我们改变了几种情况实例的训练和测试集之间的HOI概念重叠程度，从部分到没有重叠。Bongard-HOI对现有的最先进模型提出了实质性挑战，并为开发可以进行组合推理并能够推广到新的HOI概念的新算法提供了强有力的动力。",
    "tldr": "本文提出了一个新的视觉推理基准测试Bongard-HOI，它专注于从自然图像中学习人-物交互的组合性学习，挑战了现有最先进模型，鼓励开发更好的算法进行组合推理和泛化到新的HOI概念。",
    "en_tdlr": "The paper introduces a new visual reasoning benchmark, Bongard-HOI, focusing on compositional learning of human-object interactions from natural images. It presents a substantial challenge for existing state-of-the-art models and provides a strong incentive for developing new algorithms that can reason compositionally and generalize to new HOI concepts."
}