{
    "title": "Can Bad Teaching Induce Forgetting? Unlearning in Deep Networks using an Incompetent Teacher. (arXiv:2205.08096v2 [cs.LG] UPDATED)",
    "abstract": "Machine unlearning has become an important area of research due to an increasing need for machine learning (ML) applications to comply with the emerging data privacy regulations. It facilitates the provision for removal of certain set or class of data from an already trained ML model without requiring retraining from scratch. Recently, several efforts have been put in to make unlearning to be effective and efficient. We propose a novel machine unlearning method by exploring the utility of competent and incompetent teachers in a student-teacher framework to induce forgetfulness. The knowledge from the competent and incompetent teachers is selectively transferred to the student to obtain a model that doesn't contain any information about the forget data. We experimentally show that this method generalizes well, is fast and effective. Furthermore, we introduce the zero retrain forgetting (ZRF) metric to evaluate any unlearning method. Unlike the existing unlearning metrics, the ZRF score ",
    "link": "http://arxiv.org/abs/2205.08096",
    "context": "Title: Can Bad Teaching Induce Forgetting? Unlearning in Deep Networks using an Incompetent Teacher. (arXiv:2205.08096v2 [cs.LG] UPDATED)\nAbstract: Machine unlearning has become an important area of research due to an increasing need for machine learning (ML) applications to comply with the emerging data privacy regulations. It facilitates the provision for removal of certain set or class of data from an already trained ML model without requiring retraining from scratch. Recently, several efforts have been put in to make unlearning to be effective and efficient. We propose a novel machine unlearning method by exploring the utility of competent and incompetent teachers in a student-teacher framework to induce forgetfulness. The knowledge from the competent and incompetent teachers is selectively transferred to the student to obtain a model that doesn't contain any information about the forget data. We experimentally show that this method generalizes well, is fast and effective. Furthermore, we introduce the zero retrain forgetting (ZRF) metric to evaluate any unlearning method. Unlike the existing unlearning metrics, the ZRF score ",
    "path": "papers/22/05/2205.08096.json",
    "total_tokens": 941,
    "translated_title": "糟糕的教学会导致遗忘吗？使用无能教师在深度网络中进行取消学习。",
    "translated_abstract": "由于越来越多的机器学习应用需要遵守新兴的数据隐私法规，机器取消学习已成为研究的重要领域。它便于从已经训练好的机器学习模型中删除某个集合或类别的数据，而无需重新训练。我们提出了一种新颖的机器取消学习方法，通过在学生-教师框架中利用有能力和无能力的教师引导遗忘。我们选择性地将有能力和无能力教师的知识传递给学生，以获得一个不包含任何被遗忘数据信息的模型。我们实验表明，这种方法具有良好的泛化性和快速有效性。此外，我们引入“零重新训练遗忘（ZRF）”指标来评估任何取消学习方法。与现有的取消学习指标不同，ZRF得分...",
    "tldr": "该论文提出了一种新颖的机器取消学习方法，通过在学生-教师框架中利用有能力和无能力的教师来引导遗忘，以便随时从已经训练好的机器学习模型中删除某个集合或类别的数据，而无需重新训练。",
    "en_tdlr": "This paper proposes a novel machine unlearning method using competent and incompetent teachers in a student-teacher framework to induce forgetfulness, which enables the removal of certain data from a trained machine learning model without requiring retraining from scratch. The method is fast and effective and introduces a new evaluation metric, ZRF, for unlearning methods."
}