{
    "title": "Calibration Matters: Tackling Maximization Bias in Large-scale Advertising Recommendation Systems. (arXiv:2205.09809v5 [cs.LG] UPDATED)",
    "abstract": "Calibration is defined as the ratio of the average predicted click rate to the true click rate. The optimization of calibration is essential to many online advertising recommendation systems because it directly affects the downstream bids in ads auctions and the amount of money charged to advertisers. Despite its importance, calibration optimization often suffers from a problem called \"maximization bias\". Maximization bias refers to the phenomenon that the maximum of predicted values overestimates the true maximum. The problem is introduced because the calibration is computed on the set selected by the prediction model itself. It persists even if unbiased predictions can be achieved on every datapoint and worsens when covariate shifts exist between the training and test sets. To mitigate this problem, we theorize the quantification of maximization bias and propose a variance-adjusting debiasing (VAD) meta-algorithm in this paper. The algorithm is efficient, robust, and practical as it ",
    "link": "http://arxiv.org/abs/2205.09809",
    "context": "Title: Calibration Matters: Tackling Maximization Bias in Large-scale Advertising Recommendation Systems. (arXiv:2205.09809v5 [cs.LG] UPDATED)\nAbstract: Calibration is defined as the ratio of the average predicted click rate to the true click rate. The optimization of calibration is essential to many online advertising recommendation systems because it directly affects the downstream bids in ads auctions and the amount of money charged to advertisers. Despite its importance, calibration optimization often suffers from a problem called \"maximization bias\". Maximization bias refers to the phenomenon that the maximum of predicted values overestimates the true maximum. The problem is introduced because the calibration is computed on the set selected by the prediction model itself. It persists even if unbiased predictions can be achieved on every datapoint and worsens when covariate shifts exist between the training and test sets. To mitigate this problem, we theorize the quantification of maximization bias and propose a variance-adjusting debiasing (VAD) meta-algorithm in this paper. The algorithm is efficient, robust, and practical as it ",
    "path": "papers/22/05/2205.09809.json",
    "total_tokens": 940,
    "translated_title": "标定至关重要：解决大规模广告推荐系统中的极大化偏差问题",
    "translated_abstract": "标定是指平均预测点击率与真实点击率之比。标定的优化对许多在线广告推荐系统至关重要，因为它直接影响广告竞价和向广告客户收取的费用。尽管其重要性，标定优化经常受到称为“极大化偏差”的问题的困扰。极大化偏差指的是预测值的最大值高估了真正的最大值的现象。该问题是由于标定是在预测模型本身选择的集合上计算的。即使可以在每个数据点上实现无偏的预测，该问题仍然存在，并且在训练和测试集之间存在协变量移位时会变得更糟。为了缓解这个问题，本文提出了一个理论上对极大化偏差进行量化并提出方差调整去偏（VAD）元算法的算法。该算法高效、稳健且实用，因为它具有线性时间和空间复杂度。",
    "tldr": "本文提出了一种有效、稳健且实用的方差调整去偏（VAD）算法，用于解决大规模广告推荐系统中的极大化偏差问题，该算法可以缓解标定经常受到的极大化偏差问题，并提高广告推荐系统的实用性能。",
    "en_tdlr": "This paper proposes an effective, robust, and practical variance-adjusting debiasing (VAD) algorithm to mitigate the maximization bias problem in large-scale advertising recommendation systems, which can improve the practical performance of advertising recommendation systems by alleviating the problem of maximization bias that often occurs in calibration optimization."
}