{
    "title": "Dynamic Operads, Dynamic Categories: From Deep Learning to Prediction Markets. (arXiv:2205.03906v4 [math.CT] UPDATED)",
    "abstract": "Natural organized systems adapt to internal and external pressures and this happens at all levels of the abstraction hierarchy. Wanting to think clearly about this idea motivates our paper, and so the idea is elaborated extensively in the introduction, which should be broadly accessible to a philosophically-interested audience. In the remaining sections, we turn to more compressed category theory. We define the monoidal double category Org of dynamic organizations, we provide definitions of Org-enriched, or dynamic, categorical structures -- e.g. dynamic categories, operads, and monoidal categories -- and we show how they instantiate the motivating philosophical ideas. We give two examples of dynamic categorical structures: prediction markets as a dynamic operad and deep learning as a dynamic monoidal category.",
    "link": "http://arxiv.org/abs/2205.03906",
    "context": "Title: Dynamic Operads, Dynamic Categories: From Deep Learning to Prediction Markets. (arXiv:2205.03906v4 [math.CT] UPDATED)\nAbstract: Natural organized systems adapt to internal and external pressures and this happens at all levels of the abstraction hierarchy. Wanting to think clearly about this idea motivates our paper, and so the idea is elaborated extensively in the introduction, which should be broadly accessible to a philosophically-interested audience. In the remaining sections, we turn to more compressed category theory. We define the monoidal double category Org of dynamic organizations, we provide definitions of Org-enriched, or dynamic, categorical structures -- e.g. dynamic categories, operads, and monoidal categories -- and we show how they instantiate the motivating philosophical ideas. We give two examples of dynamic categorical structures: prediction markets as a dynamic operad and deep learning as a dynamic monoidal category.",
    "path": "papers/22/05/2205.03906.json",
    "total_tokens": 761,
    "translated_title": "动态操作符，动态类别：从深度学习到预测市场",
    "translated_abstract": "自然组织系统适应内外压力，这发生在抽象层次的所有级别上。我们的论文旨在清晰地思考这个想法，并在前言中广泛阐述这个想法，使其对具有哲学兴趣的读者有普遍的可理解性。在剩下的章节中，我们转向更紧凑的范畴论。我们定义了动态组织的幺半双范畴Org，我们提供了Org丰富的，或称为动态的，范畴结构的定义，例如动态范畴、操作符和幺半范畴，并展示它们如何实现激励哲学思想。我们给出了两个动态范畴结构的例子：预测市场作为动态操作符，深度学习作为动态幺半范畴。",
    "tldr": "本文研究了动态操作符和动态类别的概念，并将其应用于预测市场和深度学习领域。",
    "en_tdlr": "This paper investigates the concepts of dynamic operads and dynamic categories, and applies them to prediction markets and deep learning."
}