{
    "title": "Experimental Design for Causal Effect Identification. (arXiv:2205.02232v3 [cs.LG] UPDATED)",
    "abstract": "Pearl's do calculus is a complete axiomatic approach to learn the identifiable causal effects from observational data. When such an effect is not identifiable, it is necessary to perform a collection of often costly interventions in the system to learn the causal effect. In this work, we consider the problem of designing the collection of interventions with the minimum cost to identify the desired effect. First, we prove that this problem is NP-hard, and subsequently propose an algorithm that can either find the optimal solution or a logarithmic-factor approximation of it. This is done by establishing a connection between our problem and the minimum hitting set problem. Additionally, we propose several polynomial-time heuristic algorithms to tackle the computational complexity of the problem. Although these algorithms could potentially stumble on sub-optimal solutions, our simulations show that they achieve small regrets on random graphs.",
    "link": "http://arxiv.org/abs/2205.02232",
    "context": "Title: Experimental Design for Causal Effect Identification. (arXiv:2205.02232v3 [cs.LG] UPDATED)\nAbstract: Pearl's do calculus is a complete axiomatic approach to learn the identifiable causal effects from observational data. When such an effect is not identifiable, it is necessary to perform a collection of often costly interventions in the system to learn the causal effect. In this work, we consider the problem of designing the collection of interventions with the minimum cost to identify the desired effect. First, we prove that this problem is NP-hard, and subsequently propose an algorithm that can either find the optimal solution or a logarithmic-factor approximation of it. This is done by establishing a connection between our problem and the minimum hitting set problem. Additionally, we propose several polynomial-time heuristic algorithms to tackle the computational complexity of the problem. Although these algorithms could potentially stumble on sub-optimal solutions, our simulations show that they achieve small regrets on random graphs.",
    "path": "papers/22/05/2205.02232.json",
    "total_tokens": 774,
    "translated_title": "因果效应识别的实验设计",
    "translated_abstract": "Pearl的做法是一种从观测数据中学习可识别的因果效应的完整公理方法。当这种效应不可识别时，需要执行一系列通常昂贵的干预来学习因果效应。本研究考虑设计最小成本的干预集合来识别所需效应的问题。首先，我们证明了该问题是NP-hard的，随后提出了一个算法，可以找到最优解或其对数因子的近似解。这是通过建立我们的问题与最小命中集问题之间的联系实现的。此外，我们提出了几种多项式时间启发式算法来解决问题的计算复杂性。尽管这些算法可能找到次优解，但我们的模拟结果表明它们在随机图上取得了较小的遗憾。",
    "tldr": "本文研究了设计最小成本的干预集合来识别因果效应的问题，证明了问题的NP-hard性质，并提出了可以找到最优解或近似解的算法，使用多项式时间启发式算法来解决计算复杂性，并在随机图上进行了模拟实验验证算法的效果。"
}