{
    "title": "Sparse Graph Learning from Spatiotemporal Time Series. (arXiv:2205.13492v3 [cs.LG] UPDATED)",
    "abstract": "Outstanding achievements of graph neural networks for spatiotemporal time series analysis show that relational constraints introduce an effective inductive bias into neural forecasting architectures. Often, however, the relational information characterizing the underlying data-generating process is unavailable and the practitioner is left with the problem of inferring from data which relational graph to use in the subsequent processing stages. We propose novel, principled - yet practical - probabilistic score-based methods that learn the relational dependencies as distributions over graphs while maximizing end-to-end the performance at task. The proposed graph learning framework is based on consolidated variance reduction techniques for Monte Carlo score-based gradient estimation, is theoretically grounded, and, as we show, effective in practice. In this paper, we focus on the time series forecasting problem and show that, by tailoring the gradient estimators to the graph learning prob",
    "link": "http://arxiv.org/abs/2205.13492",
    "context": "Title: Sparse Graph Learning from Spatiotemporal Time Series. (arXiv:2205.13492v3 [cs.LG] UPDATED)\nAbstract: Outstanding achievements of graph neural networks for spatiotemporal time series analysis show that relational constraints introduce an effective inductive bias into neural forecasting architectures. Often, however, the relational information characterizing the underlying data-generating process is unavailable and the practitioner is left with the problem of inferring from data which relational graph to use in the subsequent processing stages. We propose novel, principled - yet practical - probabilistic score-based methods that learn the relational dependencies as distributions over graphs while maximizing end-to-end the performance at task. The proposed graph learning framework is based on consolidated variance reduction techniques for Monte Carlo score-based gradient estimation, is theoretically grounded, and, as we show, effective in practice. In this paper, we focus on the time series forecasting problem and show that, by tailoring the gradient estimators to the graph learning prob",
    "path": "papers/22/05/2205.13492.json",
    "total_tokens": 841,
    "translated_title": "稀疏图学习在时空时间序列上的应用",
    "translated_abstract": "著名的图神经网络在时空时间序列分析中的杰出成果表明，关系约束为神经预测架构引入了有效的归纳偏差。然而，通常情况下，表征底层数据生成过程的关系信息是不可用的，从而使从数据中推断在后续处理阶段中使用哪个关系图成为了一个问题。我们提出了一种新颖的、有理论依据的概率评分方法，通过最大化任务整个过程的性能来学习关系依赖的图分布。所提出的图学习框架基于蒙特卡洛评分梯度估计的巩固方差缩减技术，并且在理论上有基础，并且在实践中有效。本文主要关注时间序列预测问题，并展示了通过将梯度估计器调整为图学习问题的有效性。",
    "tldr": "本论文提出了一种基于概率评分的方法，通过学习关系依赖的图分布来解决在时空时间序列分析中关系信息不可用的问题，并在时间序列预测问题上展示了有效性。",
    "en_tdlr": "This paper proposes a probabilistic score-based method to learn the distribution of relational dependencies for addressing the issue of unavailable relational information in spatiotemporal time series analysis, and demonstrates its effectiveness in the context of time series forecasting."
}