{
    "title": "Deep Direct Discriminative Decoders for High-dimensional Time-series Data Analysis. (arXiv:2205.10947v2 [cs.LG] UPDATED)",
    "abstract": "The state-space models (SSMs) are widely utilized in the analysis of time-series data. SSMs rely on an explicit definition of the state and observation processes. Characterizing these processes is not always easy and becomes a modeling challenge when the dimension of observed data grows or the observed data distribution deviates from the normal distribution. Here, we propose a new formulation of SSM for high-dimensional observation processes. We call this solution the deep direct discriminative decoder (D4). The D4 brings deep neural networks' expressiveness and scalability to the SSM formulation letting us build a novel solution that efficiently estimates the underlying state processes through high-dimensional observation signal. We demonstrate the D4 solutions in simulated and real data such as Lorenz attractors, Langevin dynamics, random walk dynamics, and rat hippocampus spiking neural data and show that the D4 performs better than traditional SSMs and RNNs. The D4 can be applied t",
    "link": "http://arxiv.org/abs/2205.10947",
    "context": "Title: Deep Direct Discriminative Decoders for High-dimensional Time-series Data Analysis. (arXiv:2205.10947v2 [cs.LG] UPDATED)\nAbstract: The state-space models (SSMs) are widely utilized in the analysis of time-series data. SSMs rely on an explicit definition of the state and observation processes. Characterizing these processes is not always easy and becomes a modeling challenge when the dimension of observed data grows or the observed data distribution deviates from the normal distribution. Here, we propose a new formulation of SSM for high-dimensional observation processes. We call this solution the deep direct discriminative decoder (D4). The D4 brings deep neural networks' expressiveness and scalability to the SSM formulation letting us build a novel solution that efficiently estimates the underlying state processes through high-dimensional observation signal. We demonstrate the D4 solutions in simulated and real data such as Lorenz attractors, Langevin dynamics, random walk dynamics, and rat hippocampus spiking neural data and show that the D4 performs better than traditional SSMs and RNNs. The D4 can be applied t",
    "path": "papers/22/05/2205.10947.json",
    "total_tokens": 976,
    "translated_title": "高维时间序列数据分析的深度直接判别解码器",
    "translated_abstract": "状态空间模型（SSMs）被广泛应用于时间序列数据分析中。SSMs依赖于对状态和观测过程的明确定义。当观测数据的维度增加或观测数据分布偏离正态分布时，描述这些过程并不总是容易的，这成为建模的挑战。在这里，我们提出了一种用于高维观测过程的新的SSM表达形式。我们将这个解决方案称为深度直接判别解码器（D4）。D4将深度神经网络的表达能力和可扩展性引入到SSM表达形式中，使我们能够构建一个新的解决方案，通过高维观测信号高效地估计潜在的状态过程。我们在模拟和真实数据（如Lorenz吸引子、Langevin动力学、随机行走动力学和大鼠海马鞭状神经数据）上演示了D4解决方案，并展示了它比传统的SSMs和RNNs更好的性能。D4可以应用于",
    "tldr": "这篇论文提出了一种用于高维时间序列数据分析的新方法，即深度直接判别解码器（D4）。D4通过引入深度神经网络的表达能力和可扩展性，有效地估计了高维观测信号下的潜在状态过程，并在多个数据集上展示了比传统方法更好的性能。",
    "en_tdlr": "This paper proposes a new approach for high-dimensional time-series data analysis called Deep Direct Discriminative Decoder (D4). The D4 utilizes the expressive power and scalability of deep neural networks to efficiently estimate the underlying state processes in high-dimensional observation signals, and demonstrates better performance compared to traditional methods on multiple datasets."
}