{
    "title": "Group Equality in Adaptive Submodular Maximization. (arXiv:2207.03364v3 [cs.LG] UPDATED)",
    "abstract": "In this paper, we study the classic submodular maximization problem subject to a group equality constraint under both non-adaptive and adaptive settings. It has been shown that the utility function of many machine learning applications, including data summarization, influence maximization in social networks, and personalized recommendation, satisfies the property of submodularity. Hence, maximizing a submodular function subject to various constraints can be found at the heart of many of those applications. On a high level, submodular maximization aims to select a group of most representative items (e.g., data points). However, the design of most existing algorithms does not incorporate the fairness constraint, leading to under- or over-representation of some particular groups. This motivates us to study the submodular maximization problem with group equality, where we aim to select a group of items to maximize a (possibly non-monotone) submodular utility function subject to a group equ",
    "link": "http://arxiv.org/abs/2207.03364",
    "context": "Title: Group Equality in Adaptive Submodular Maximization. (arXiv:2207.03364v3 [cs.LG] UPDATED)\nAbstract: In this paper, we study the classic submodular maximization problem subject to a group equality constraint under both non-adaptive and adaptive settings. It has been shown that the utility function of many machine learning applications, including data summarization, influence maximization in social networks, and personalized recommendation, satisfies the property of submodularity. Hence, maximizing a submodular function subject to various constraints can be found at the heart of many of those applications. On a high level, submodular maximization aims to select a group of most representative items (e.g., data points). However, the design of most existing algorithms does not incorporate the fairness constraint, leading to under- or over-representation of some particular groups. This motivates us to study the submodular maximization problem with group equality, where we aim to select a group of items to maximize a (possibly non-monotone) submodular utility function subject to a group equ",
    "path": "papers/22/07/2207.03364.json",
    "total_tokens": 922,
    "translated_title": "在自适应子模块最大化中的群体平等",
    "translated_abstract": "本论文研究了在非自适应和自适应设置下，受群体平等约束的经典子模块最大化问题。已经证明，许多机器学习应用的效用函数，包括数据汇总、社交网络中的影响最大化和个性化推荐，满足子模块性质。因此，在许多应用中，子模块最大化的核心是在各种约束下选择最具代表性的项（例如，数据点）。然而，大多数现有算法的设计没有考虑公平性约束，导致某些特定群体的欠代表或过代表。这激发了我们研究具有群体平等的子模块最大化问题，即在群体平等约束下选择一组项以最大化一个（可能非单调）的子模块效用函数。",
    "tldr": "本论文研究了非自适应和自适应情况下，受群体平等约束的经典子模块最大化问题。研究发现，现有算法没有考虑公平性约束，导致一些特定群体的欠代表或过代表。因此，我们研究了在群体平等约束下选择一组项以最大化子模块效用函数。",
    "en_tdlr": "This paper studies the classic problem of submodular maximization subject to group equality constraints under both non-adaptive and adaptive settings. It is found that existing algorithms do not incorporate fairness constraints, leading to under- or over-representation of certain groups. Therefore, this research focuses on selecting a group of items under group equality constraints to maximize the submodular utility function."
}