{
    "title": "Cost-efficient Payoffs under Model Ambiguity. (arXiv:2207.02948v2 [q-fin.PM] UPDATED)",
    "abstract": "Dybvig (1988a,b) solves in a complete market setting the problem of finding a payoff that is cheapest possible in reaching a given target distribution (\"cost-efficient payoff\"). In the presence of ambiguity, the distribution of a payoff is, however, no longer known with certainty. We study the problem of finding the cheapest possible payoff whose worst-case distribution stochastically dominates a given target distribution (\"robust cost-efficient payoff\") and determine solutions under certain conditions. We study the link between \"robust cost-efficiency\" and the maxmin expected utility setting of Gilboa and Schmeidler, as well as more generally with robust preferences in a possibly non-expected utility setting. Specifically, we show that solutions to maxmin robust expected utility are necessarily robust cost-efficient. We illustrate our study with examples involving uncertainty both on the drift and on the volatility of the risky asset.",
    "link": "http://arxiv.org/abs/2207.02948",
    "context": "Title: Cost-efficient Payoffs under Model Ambiguity. (arXiv:2207.02948v2 [q-fin.PM] UPDATED)\nAbstract: Dybvig (1988a,b) solves in a complete market setting the problem of finding a payoff that is cheapest possible in reaching a given target distribution (\"cost-efficient payoff\"). In the presence of ambiguity, the distribution of a payoff is, however, no longer known with certainty. We study the problem of finding the cheapest possible payoff whose worst-case distribution stochastically dominates a given target distribution (\"robust cost-efficient payoff\") and determine solutions under certain conditions. We study the link between \"robust cost-efficiency\" and the maxmin expected utility setting of Gilboa and Schmeidler, as well as more generally with robust preferences in a possibly non-expected utility setting. Specifically, we show that solutions to maxmin robust expected utility are necessarily robust cost-efficient. We illustrate our study with examples involving uncertainty both on the drift and on the volatility of the risky asset.",
    "path": "papers/22/07/2207.02948.json",
    "total_tokens": 925,
    "translated_title": "模型不确定性下的成本效益收益",
    "translated_abstract": "Dybvig（1988a，b）在完全市场的条件下解决了寻找最便宜的达成给定目标分布的收益（“成本效益收益”）的问题。然而，在不确定性存在的情况下，收益的分布不再确定。我们研究了在满足一定条件下找到最便宜的收益，其最差情况下的分布随机优于给定目标分布（“鲁棒成本效益收益”）的问题，并确定了解决方案。我们还研究了Gilboa和Schmeidler的最大最小期望效用设置和在可能的非期望效用设置中的鲁棒偏好与“鲁棒成本效益收益”之间的联系。具体来说，我们证明了最大最小鲁棒期望效用的解必然是鲁棒成本效益收益。我们通过包括风险资产的漂移和波动性的不确定性的示例来说明我们的研究。",
    "tldr": "该论文研究了在模型不确定性下寻找成本效益收益的问题，并确定了鲁棒成本效益收益的解决方案。研究表明最大最小鲁棒期望效用的解也是鲁棒成本效益收益的解。通过示例说明了不确定性对收益的影响。",
    "en_tdlr": "This paper investigates the problem of finding cost-efficient payoffs under model ambiguity and provides solutions for robust cost-efficient payoffs. The study shows a connection between maxmin robust expected utility and robust cost-efficiency, and presents examples illustrating the impact of uncertainty on payoffs."
}