{
    "title": "Learning to correct spectral methods for simulating turbulent flows. (arXiv:2207.00556v2 [cs.LG] UPDATED)",
    "abstract": "Despite their ubiquity throughout science and engineering, only a handful of partial differential equations (PDEs) have analytical, or closed-form solutions. This motivates a vast amount of classical work on numerical simulation of PDEs and more recently, a whirlwind of research into data-driven techniques leveraging machine learning (ML). A recent line of work indicates that a hybrid of classical numerical techniques and machine learning can offer significant improvements over either approach alone. In this work, we show that the choice of the numerical scheme is crucial when incorporating physics-based priors. We build upon Fourier-based spectral methods, which are known to be more efficient than other numerical schemes for simulating PDEs with smooth and periodic solutions. Specifically, we develop ML-augmented spectral solvers for three common PDEs of fluid dynamics. Our models are more accurate (2-4x) than standard spectral solvers at the same resolution but have longer overall ru",
    "link": "http://arxiv.org/abs/2207.00556",
    "context": "Title: Learning to correct spectral methods for simulating turbulent flows. (arXiv:2207.00556v2 [cs.LG] UPDATED)\nAbstract: Despite their ubiquity throughout science and engineering, only a handful of partial differential equations (PDEs) have analytical, or closed-form solutions. This motivates a vast amount of classical work on numerical simulation of PDEs and more recently, a whirlwind of research into data-driven techniques leveraging machine learning (ML). A recent line of work indicates that a hybrid of classical numerical techniques and machine learning can offer significant improvements over either approach alone. In this work, we show that the choice of the numerical scheme is crucial when incorporating physics-based priors. We build upon Fourier-based spectral methods, which are known to be more efficient than other numerical schemes for simulating PDEs with smooth and periodic solutions. Specifically, we develop ML-augmented spectral solvers for three common PDEs of fluid dynamics. Our models are more accurate (2-4x) than standard spectral solvers at the same resolution but have longer overall ru",
    "path": "papers/22/07/2207.00556.json",
    "total_tokens": 842,
    "translated_title": "学习纠正用于模拟湍流的谱方法",
    "translated_abstract": "尽管部分微分方程（PDE）在科学和工程中无处不在，但其中只有少数具有解析或闭合形式的解。这激发了大量经典的 PDE 数值模拟工作以及更近期的利用机器学习（ML）的数据驱动技术研究。最近的研究表明，经典数值技术和机器学习的混合可以比单独使用任一方法带来显着的改进。在本文中，我们展示了当加入基于物理学先验知识时，数值方案的选择至关重要。我们基于 Fourier 谱方法进行了改进，这种谱方法已知比其他数值方案更适合模拟具有平滑和周期性解的 PDE。具体而言，我们开发了用于三个流体力学常见 PDE 的 ML增强的谱求解器。在相同的解析度下，我们的模型比标准的谱求解器更准确（2-4倍），但整体运行时间更长。",
    "tldr": "通过机器学习的谱求解器在物理先验知识的指导下可以比传统求解器更准确地模拟流体动力学问题。"
}