{
    "title": "Harnessing Out-Of-Distribution Examples via Augmenting Content and Style. (arXiv:2207.03162v2 [cs.LG] UPDATED)",
    "abstract": "Machine learning models are vulnerable to Out-Of-Distribution (OOD) examples, and such a problem has drawn much attention. However, current methods lack a full understanding of different types of OOD data: there are benign OOD data that can be properly adapted to enhance the learning performance, while other malign OOD data would severely degenerate the classification result. To Harness OOD data, this paper proposes a HOOD method that can leverage the content and style from each image instance to identify benign and malign OOD data. Particularly, we design a variational inference framework to causally disentangle content and style features by constructing a structural causal model. Subsequently, we augment the content and style through an intervention process to produce malign and benign OOD data, respectively. The benign OOD data contain novel styles but hold our interested contents, and they can be leveraged to help train a style-invariant model. In contrast, the malign OOD data inhe",
    "link": "http://arxiv.org/abs/2207.03162",
    "context": "Title: Harnessing Out-Of-Distribution Examples via Augmenting Content and Style. (arXiv:2207.03162v2 [cs.LG] UPDATED)\nAbstract: Machine learning models are vulnerable to Out-Of-Distribution (OOD) examples, and such a problem has drawn much attention. However, current methods lack a full understanding of different types of OOD data: there are benign OOD data that can be properly adapted to enhance the learning performance, while other malign OOD data would severely degenerate the classification result. To Harness OOD data, this paper proposes a HOOD method that can leverage the content and style from each image instance to identify benign and malign OOD data. Particularly, we design a variational inference framework to causally disentangle content and style features by constructing a structural causal model. Subsequently, we augment the content and style through an intervention process to produce malign and benign OOD data, respectively. The benign OOD data contain novel styles but hold our interested contents, and they can be leveraged to help train a style-invariant model. In contrast, the malign OOD data inhe",
    "path": "papers/22/07/2207.03162.json",
    "total_tokens": 977,
    "translated_title": "通过增强内容和风格来利用OOD例子",
    "translated_abstract": "机器学习模型容易受到OOD例子的影响，这已经引起了很多关注。然而，现有的方法缺乏对不同类型OOD数据完整的理解：有一些良性的OOD数据可以适当地进行改进以增强学习性能，但其他恶劣的OOD数据则会严重降低分类结果。为了利用OOD数据，本文提出了一种HOOD方法，该方法可以利用每个图像实例的内容和风格来识别良性和恶性OOD数据。具体而言，我们设计了一个变分推断框架，通过构建结构因果模型来因果地分离内容和样式特征。随后，我们通过干预过程增强内容和风格，分别产生恶性和良性OOD数据。良性OOD数据包含新的风格，但保留了我们感兴趣的内容，可以帮助训练一个具有样式不变性的模型。相反，恶性OOD数据具有不受欢迎的内容，并可以用于训练一个更加稳健的抵御OOD例子的模型。实验结果证明了我们提出的方法的有效性，在各种基准数据集上优于现有的各种方法。",
    "tldr": "本文提出一种HOOD方法，可以通过增强内容和风格来识别良性和恶性OOD数据，并在各种基准数据集上优于现有的各种方法。",
    "en_tdlr": "This paper proposes a HOOD method that can identify benign and malign OOD data by leveraging the content and style from each image instance, and outperforms state-of-the-art methods on various benchmark datasets."
}