{
    "title": "Conditioning Normalizing Flows for Rare Event Sampling. (arXiv:2207.14530v2 [physics.comp-ph] UPDATED)",
    "abstract": "Understanding the dynamics of complex molecular processes is often linked to the study of infrequent transitions between long-lived stable states. The standard approach to the sampling of such rare events is to generate an ensemble of transition paths using a random walk in trajectory space. This, however, comes with the drawback of strong correlations between subsequently sampled paths and with an intrinsic difficulty in parallelizing the sampling process. We propose a transition path sampling scheme based on neural-network generated configurations. These are obtained employing normalizing flows, a neural network class able to generate statistically independent samples from a given distribution. With this approach, not only are correlations between visited paths removed, but the sampling process becomes easily parallelizable. Moreover, by conditioning the normalizing flow, the sampling of configurations can be steered towards regions of interest. We show that this approach enables the",
    "link": "http://arxiv.org/abs/2207.14530",
    "context": "Title: Conditioning Normalizing Flows for Rare Event Sampling. (arXiv:2207.14530v2 [physics.comp-ph] UPDATED)\nAbstract: Understanding the dynamics of complex molecular processes is often linked to the study of infrequent transitions between long-lived stable states. The standard approach to the sampling of such rare events is to generate an ensemble of transition paths using a random walk in trajectory space. This, however, comes with the drawback of strong correlations between subsequently sampled paths and with an intrinsic difficulty in parallelizing the sampling process. We propose a transition path sampling scheme based on neural-network generated configurations. These are obtained employing normalizing flows, a neural network class able to generate statistically independent samples from a given distribution. With this approach, not only are correlations between visited paths removed, but the sampling process becomes easily parallelizable. Moreover, by conditioning the normalizing flow, the sampling of configurations can be steered towards regions of interest. We show that this approach enables the",
    "path": "papers/22/07/2207.14530.json",
    "total_tokens": 854,
    "translated_title": "利用归一化流进行稀有事件采样的条件化方法",
    "translated_abstract": "理解复杂分子过程的动力学通常涉及研究长寿命稳定态之间的不经常转换。通常采用的稀有事件采样方法是使用轨迹空间中的随机游走生成转换路径的集合。但是，这种方法存在随后采样路径之间的强相关性以及在并行化采样过程中存在固有难度。我们提出了一种基于神经网络生成配置的转换路径采样方案。这些配置是通过归一化流获得的，这是一种神经网络类，能够从给定的分布生成统计独立的样本。采用这种方法，不仅消除了所访问路径之间的相关性，而且采样过程易于并行化。此外，通过对归一化流进行条件设置，可以将配置的采样引导到感兴趣的区域。我们演示了这种方法使得...",
    "tldr": "该论文提出了一种基于神经网络生成配置的转换路径采样方案，使用归一化流消除采样路径之间的相关性，易于并行化采样过程，通过条件设置将配置采样引导到感兴趣的区域。",
    "en_tdlr": "This paper proposes a transition path sampling scheme based on neural-network generated configurations, which uses normalizing flows to remove correlations between sampled paths and make the sampling process easily parallelizable. By conditioning the normalizing flow, the sampling of configurations can be steered towards regions of interest."
}