{
    "title": "Fuzzy Labeling Semantics for Quantitative Argumentation. (arXiv:2207.07339v2 [cs.AI] UPDATED)",
    "abstract": "Evaluating argument strength in quantitative argumentation systems has received increasing attention in the field of abstract argumentation. The concept of acceptability degree is widely adopted in gradual semantics, however, it may not be sufficient in many practical applications. In this paper, we provide a novel quantitative method called fuzzy labeling for fuzzy argumentation systems, in which a triple of acceptability, rejectability, and undecidability degrees is used to evaluate argument strength. Such a setting sheds new light on defining argument strength and provides a deeper understanding of the status of arguments. More specifically, we investigate the postulates of fuzzy labeling, which present the rationality requirements for semantics concerning the acceptability, rejectability, and undecidability degrees. We then propose a class of fuzzy labeling semantics conforming to the above postulates and investigate the relations between fuzzy labeling semantics and existing work ",
    "link": "http://arxiv.org/abs/2207.07339",
    "context": "Title: Fuzzy Labeling Semantics for Quantitative Argumentation. (arXiv:2207.07339v2 [cs.AI] UPDATED)\nAbstract: Evaluating argument strength in quantitative argumentation systems has received increasing attention in the field of abstract argumentation. The concept of acceptability degree is widely adopted in gradual semantics, however, it may not be sufficient in many practical applications. In this paper, we provide a novel quantitative method called fuzzy labeling for fuzzy argumentation systems, in which a triple of acceptability, rejectability, and undecidability degrees is used to evaluate argument strength. Such a setting sheds new light on defining argument strength and provides a deeper understanding of the status of arguments. More specifically, we investigate the postulates of fuzzy labeling, which present the rationality requirements for semantics concerning the acceptability, rejectability, and undecidability degrees. We then propose a class of fuzzy labeling semantics conforming to the above postulates and investigate the relations between fuzzy labeling semantics and existing work ",
    "path": "papers/22/07/2207.07339.json",
    "total_tokens": 893,
    "translated_title": "用于定量论证的模糊标签语义",
    "translated_abstract": "在抽象论证领域中，评估定量论证系统中的论证强度日益受到关注。可接受度概念在渐进语义中被广泛采用，然而，在许多实际应用中可能不足够。本文提供了一种新颖的定量方法，称为模糊标签化，用于模糊论证系统，其中使用可接受度、可拒绝度和不确定度三个程度评估论证的强度。这种设定为界定论证强度提供了新的视角，并深入理解了论证的状态。具体而言，我们研究了模糊标签的假设，这些假设提出了关于可接受度、可拒绝度和不确定度的语义的合理性要求。然后，我们提出了一类符合上述假设的模糊标签语义，并研究了模糊标签语义与现有工作的关系。",
    "tldr": "本论文提出了一种新颖的定量方法——模糊标签化，用于评估模糊论证系统中的论证强度。通过使用可接受度、可拒绝度和不确定度三个程度，该方法为界定论证强度提供了新的视角，并对论证的状态进行了深入理解。"
}