{
    "title": "A Data-driven Latent Semantic Analysis for Automatic Text Summarization using LDA Topic Modelling. (arXiv:2207.14687v7 [cs.IR] UPDATED)",
    "abstract": "With the advent and popularity of big data mining and huge text analysis in modern times, automated text summarization became prominent for extracting and retrieving important information from documents. This research investigates aspects of automatic text summarization from the perspectives of single and multiple documents. Summarization is a task of condensing huge text articles into short, summarized versions. The text is reduced in size for summarization purpose but preserving key vital information and retaining the meaning of the original document. This study presents the Latent Dirichlet Allocation (LDA) approach used to perform topic modelling from summarised medical science journal articles with topics related to genes and diseases. In this study, PyLDAvis web-based interactive visualization tool was used to visualise the selected topics. The visualisation provides an overarching view of the main topics while allowing and attributing deep meaning to the prevalence individual to",
    "link": "http://arxiv.org/abs/2207.14687",
    "context": "Title: A Data-driven Latent Semantic Analysis for Automatic Text Summarization using LDA Topic Modelling. (arXiv:2207.14687v7 [cs.IR] UPDATED)\nAbstract: With the advent and popularity of big data mining and huge text analysis in modern times, automated text summarization became prominent for extracting and retrieving important information from documents. This research investigates aspects of automatic text summarization from the perspectives of single and multiple documents. Summarization is a task of condensing huge text articles into short, summarized versions. The text is reduced in size for summarization purpose but preserving key vital information and retaining the meaning of the original document. This study presents the Latent Dirichlet Allocation (LDA) approach used to perform topic modelling from summarised medical science journal articles with topics related to genes and diseases. In this study, PyLDAvis web-based interactive visualization tool was used to visualise the selected topics. The visualisation provides an overarching view of the main topics while allowing and attributing deep meaning to the prevalence individual to",
    "path": "papers/22/07/2207.14687.json",
    "total_tokens": 900,
    "translated_title": "基于LDA主题建模的自动文本摘要的数据驱动潜在语意分析",
    "translated_abstract": "随着现代时代大数据挖掘和大文本分析的到来和普及，自动文本摘要成为从文档中提取和检索重要信息的重要手段。本研究从单个和多个文档的角度探讨了自动文本摘要的各个方面。摘要是将庞大的文本文章压缩为短小汇总版本的任务。目的是缩小文本的大小，但要保留关键重要信息并保持原始文档的意义。“潜在狄利克雷分配”（LDA）方法被用于从与基因和疾病相关的医学科学期刊文章中进行主题建模。在本研究中，使用PyLDAvis的基于网页的交互式可视化工具来可视化所选主题。这种可视化提供了主要主题的总体视图，同时允许深入理解个体的普遍性。",
    "tldr": "本研究使用LDA主题建模方法进行文本摘要，针对与基因和疾病相关的医学科学期刊文章进行研究，提供了一个能够保留关键信息并保持原始意义的压缩版本，并使用PyLDAvis进行交互式可视化。"
}