{
    "title": "Simultaneity in Binary Outcome Models with an Application to Employment for Couples. (arXiv:2207.07343v2 [econ.EM] UPDATED)",
    "abstract": "Two of Peter Schmidt's many contributions to econometrics have been to introduce a simultaneous logit model for bivariate binary outcomes and to study estimation of dynamic linear fixed effects panel data models using short panels. In this paper, we study a dynamic panel data version of the bivariate model introduced in Schmidt and Strauss (1975) that allows for lagged dependent variables and fixed effects as in Ahn and Schmidt (1995). We combine a conditional likelihood approach with a method of moments approach to obtain an estimation strategy for the resulting model. We apply this estimation strategy to a simple model for the intra-household relationship in employment. Our main conclusion is that the within-household dependence in employment differs significantly by the ethnicity composition of the couple even after one allows for unobserved household specific heterogeneity.",
    "link": "http://arxiv.org/abs/2207.07343",
    "context": "Title: Simultaneity in Binary Outcome Models with an Application to Employment for Couples. (arXiv:2207.07343v2 [econ.EM] UPDATED)\nAbstract: Two of Peter Schmidt's many contributions to econometrics have been to introduce a simultaneous logit model for bivariate binary outcomes and to study estimation of dynamic linear fixed effects panel data models using short panels. In this paper, we study a dynamic panel data version of the bivariate model introduced in Schmidt and Strauss (1975) that allows for lagged dependent variables and fixed effects as in Ahn and Schmidt (1995). We combine a conditional likelihood approach with a method of moments approach to obtain an estimation strategy for the resulting model. We apply this estimation strategy to a simple model for the intra-household relationship in employment. Our main conclusion is that the within-household dependence in employment differs significantly by the ethnicity composition of the couple even after one allows for unobserved household specific heterogeneity.",
    "path": "papers/22/07/2207.07343.json",
    "total_tokens": 855,
    "translated_title": "二元结果模型中的同时性及其在夫妻就业中的应用",
    "translated_abstract": "彼得·施密特在计量经济学发展中做出了许多贡献，其中包括引入联立logit模型以及研究短面板下动态线性固定效应面板数据模型的估计方法。本文研究了施密特和斯特劳斯（1975）引入的二元模型的动态面板数据版本，该模型允许滞后的因变量和固定效应，类似于安和施密特（1995）的模型。我们将条件似然方法与矩估计方法相结合，得出了模型的估计策略。我们将这种估计策略应用于夫妻就业关系的简单模型中。我们的主要结论是，在考虑未观测到的家庭特定异质性的情况下，夫妻之间的就业依赖关系因夫妻的族裔构成而异。",
    "tldr": "本文研究了施密特提出的二元联立模型在动态面板数据版本下的应用，发现夫妻就业关系的依赖程度因夫妻的族裔构成而异。",
    "en_tdlr": "This paper studies the application of Schmidt's bivariate simultaneous logit model in the dynamic panel data version, and finds that the within-household dependence in employment for couples differs significantly by the ethnic composition of the couple even after accounting for unobserved household specific heterogeneity."
}