{
    "title": "Multi-aspect Multilingual and Cross-lingual Parliamentary Speech Analysis. (arXiv:2207.01054v2 [cs.CL] UPDATED)",
    "abstract": "Parliamentary and legislative debate transcripts provide informative insight into elected politicians' opinions, positions, and policy preferences. They are interesting for political and social sciences as well as linguistics and natural language processing (NLP) research. While existing research studied individual parliaments, we apply advanced NLP methods to a joint and comparative analysis of six national parliaments (Bulgarian, Czech, French, Slovene, Spanish, and United Kingdom) between 2017 and 2020. We analyze emotions and sentiment in the transcripts from the ParlaMint dataset collection and assess if the age, gender, and political orientation of speakers can be detected from their speeches. The results show some commonalities and many surprising differences among the analyzed countries.",
    "link": "http://arxiv.org/abs/2207.01054",
    "context": "Title: Multi-aspect Multilingual and Cross-lingual Parliamentary Speech Analysis. (arXiv:2207.01054v2 [cs.CL] UPDATED)\nAbstract: Parliamentary and legislative debate transcripts provide informative insight into elected politicians' opinions, positions, and policy preferences. They are interesting for political and social sciences as well as linguistics and natural language processing (NLP) research. While existing research studied individual parliaments, we apply advanced NLP methods to a joint and comparative analysis of six national parliaments (Bulgarian, Czech, French, Slovene, Spanish, and United Kingdom) between 2017 and 2020. We analyze emotions and sentiment in the transcripts from the ParlaMint dataset collection and assess if the age, gender, and political orientation of speakers can be detected from their speeches. The results show some commonalities and many surprising differences among the analyzed countries.",
    "path": "papers/22/07/2207.01054.json",
    "total_tokens": 843,
    "translated_title": "多方位多语言与跨语言的议会演讲分析",
    "translated_abstract": "议会和立法辩论记录提供了有关选定政治家意见、立场和政策偏好的有价值的见解。它们对政治和社会科学以及语言学和自然语言处理（NLP）研究非常有趣。虽然现有的研究研究了个别的议会，但我们将先进的NLP方法应用于对2017年至2020年期间六个国家议会（保加利亚、捷克、法国、斯洛文尼亚、西班牙和英国）进行联合和比较分析。我们分析了ParlaMint数据集收集的记录中的情感和情绪，并评估是否可以从演讲中检测到发言者的年龄、性别和政治倾向。研究结果显示，这些分析国家之间有一些共同点和许多令人惊讶的差异。",
    "tldr": "本研究使用先进的自然语言处理方法，对2017年至2020年间保加利亚、捷克、法国、斯洛文尼亚、西班牙和英国六个国家的议会记录进行了联合和比较分析。结果显示出了这些国家之间的差异和共同点。",
    "en_tdlr": "This study applies advanced natural language processing methods to a joint and comparative analysis of parliamentary transcripts from six national parliaments between 2017 and 2020, showing both differences and commonalities among these countries."
}