{
    "title": "Differentially Private Graph Learning via Sensitivity-Bounded Personalized PageRank",
    "abstract": "Personalized PageRank (PPR) is a fundamental tool in unsupervised learning of graph representations such as node ranking, labeling, and graph embedding. However, while data privacy is one of the most important recent concerns, existing PPR algorithms are not designed to protect user privacy. PPR is highly sensitive to the input graph edges: the difference of only one edge may cause a big change in the PPR vector, potentially leaking private user data.   In this work, we propose an algorithm which outputs an approximate PPR and has provably bounded sensitivity to input edges. In addition, we prove that our algorithm achieves similar accuracy to non-private algorithms when the input graph has large degrees. Our sensitivity-bounded PPR directly implies private algorithms for several tools of graph learning, such as, differentially private (DP) PPR ranking, DP node classification, and DP node embedding. To complement our theoretical analysis, we also empirically verify the practical perfor",
    "link": "https://arxiv.org/abs/2207.06944",
    "context": "Title: Differentially Private Graph Learning via Sensitivity-Bounded Personalized PageRank\nAbstract: Personalized PageRank (PPR) is a fundamental tool in unsupervised learning of graph representations such as node ranking, labeling, and graph embedding. However, while data privacy is one of the most important recent concerns, existing PPR algorithms are not designed to protect user privacy. PPR is highly sensitive to the input graph edges: the difference of only one edge may cause a big change in the PPR vector, potentially leaking private user data.   In this work, we propose an algorithm which outputs an approximate PPR and has provably bounded sensitivity to input edges. In addition, we prove that our algorithm achieves similar accuracy to non-private algorithms when the input graph has large degrees. Our sensitivity-bounded PPR directly implies private algorithms for several tools of graph learning, such as, differentially private (DP) PPR ranking, DP node classification, and DP node embedding. To complement our theoretical analysis, we also empirically verify the practical perfor",
    "path": "papers/22/07/2207.06944.json",
    "total_tokens": 876,
    "translated_title": "差分隐私图学习的敏感性有界个性化PageRank算法",
    "translated_abstract": "个性化PageRank(PPR)是一种基本工具，用于无监督学习图表示，如节点排序、标注和图嵌入。然而，随着数据隐私成为最近最重要的关注点之一，现有的PPR算法并未设计用于保护用户隐私。PPR对输入图的边非常敏感：仅差一个边的差异可能会导致PPR向量发生巨大改变，从而可能泄漏用户私密数据。在这篇论文中，我们提出了一种算法，该算法输出近似PPR，并对输入边具有可证明的敏感性边界。此外，我们证明了当输入图具有大度数时，我们的算法达到与非私密算法相似的准确性。我们敏感性有界PPR直接意味着图学习的几种私密算法，如差分隐私(DP)PPR排序、DP节点分类和DP节点嵌入。为了补充我们的理论分析，我们还通过实验证明了算法的实际性能。",
    "tldr": "本论文提出了一种敏感性有界的个性化PageRank算法，能够保护用户隐私。该算法在保持准确性的同时，实现了差分隐私图学习的几种工具。",
    "en_tdlr": "This paper proposes a sensitivity-bounded personalized PageRank algorithm that protects user privacy. The algorithm achieves similar accuracy as non-private algorithms and enables differentially private graph learning for various tools."
}