{
    "title": "Semi-supervised Predictive Clustering Trees for (Hierarchical) Multi-label Classification",
    "abstract": "arXiv:2207.09237v2 Announce Type: replace-cross  Abstract: Semi-supervised learning (SSL) is a common approach to learning predictive models using not only labeled examples, but also unlabeled examples. While SSL for the simple tasks of classification and regression has received a lot of attention from the research community, this is not properly investigated for complex prediction tasks with structurally dependent variables. This is the case of multi-label classification and hierarchical multi-label classification tasks, which may require additional information, possibly coming from the underlying distribution in the descriptive space provided by unlabeled examples, to better face the challenging task of predicting simultaneously multiple class labels.   In this paper, we investigate this aspect and propose a (hierarchical) multi-label classification method based on semi-supervised learning of predictive clustering trees. We also extend the method towards ensemble learning and propose",
    "link": "https://arxiv.org/abs/2207.09237",
    "context": "Title: Semi-supervised Predictive Clustering Trees for (Hierarchical) Multi-label Classification\nAbstract: arXiv:2207.09237v2 Announce Type: replace-cross  Abstract: Semi-supervised learning (SSL) is a common approach to learning predictive models using not only labeled examples, but also unlabeled examples. While SSL for the simple tasks of classification and regression has received a lot of attention from the research community, this is not properly investigated for complex prediction tasks with structurally dependent variables. This is the case of multi-label classification and hierarchical multi-label classification tasks, which may require additional information, possibly coming from the underlying distribution in the descriptive space provided by unlabeled examples, to better face the challenging task of predicting simultaneously multiple class labels.   In this paper, we investigate this aspect and propose a (hierarchical) multi-label classification method based on semi-supervised learning of predictive clustering trees. We also extend the method towards ensemble learning and propose",
    "path": "papers/22/07/2207.09237.json",
    "total_tokens": 756,
    "translated_title": "半监督预测聚类树用于（分层）多标签分类",
    "translated_abstract": "半监督学习（SSL）是一种常见的学习预测模型的方法，不仅使用标记的示例，还使用未标记的示例。尽管SSL在简单的分类和回归任务上得到了研究界的关注，但对于具有结构相关变量的复杂预测任务尚未得到充分调查。这种情况出现在多标签分类和分层多标签分类任务中，这可能需要额外的信息，可能来自描述空间中由未标记示例提供的基础分布，以更好地面对挑战性的同时预测多个类标签的任务。在本文中，我们研究了这一方面，并提出了一种基于半监督学习的预测聚类树的（分层）多标签分类方法。我们还将该方法扩展到集成学习，并提出",
    "tldr": "提出了一种基于半监督学习的预测聚类树的（分层）多标签分类方法。",
    "en_tdlr": "Proposed a semi-supervised learning method based on predictive clustering trees for (hierarchical) multi-label classification."
}