{
    "title": "RealTime QA: What's the Answer Right Now?",
    "abstract": "arXiv:2207.13332v2 Announce Type: replace  Abstract: We introduce REALTIME QA, a dynamic question answering (QA) platform that announces questions and evaluates systems on a regular basis (weekly in this version). REALTIME QA inquires about the current world, and QA systems need to answer questions about novel events or information. It therefore challenges static, conventional assumptions in open-domain QA datasets and pursues instantaneous applications. We build strong baseline models upon large pretrained language models, including GPT-3 and T5. Our benchmark is an ongoing effort, and this paper presents real-time evaluation results over the past year. Our experimental results show that GPT-3 can often properly update its generation results, based on newly-retrieved documents, highlighting the importance of up-to-date information retrieval. Nonetheless, we find that GPT-3 tends to return outdated answers when retrieved documents do not provide sufficient information to find an answer",
    "link": "https://arxiv.org/abs/2207.13332",
    "context": "Title: RealTime QA: What's the Answer Right Now?\nAbstract: arXiv:2207.13332v2 Announce Type: replace  Abstract: We introduce REALTIME QA, a dynamic question answering (QA) platform that announces questions and evaluates systems on a regular basis (weekly in this version). REALTIME QA inquires about the current world, and QA systems need to answer questions about novel events or information. It therefore challenges static, conventional assumptions in open-domain QA datasets and pursues instantaneous applications. We build strong baseline models upon large pretrained language models, including GPT-3 and T5. Our benchmark is an ongoing effort, and this paper presents real-time evaluation results over the past year. Our experimental results show that GPT-3 can often properly update its generation results, based on newly-retrieved documents, highlighting the importance of up-to-date information retrieval. Nonetheless, we find that GPT-3 tends to return outdated answers when retrieved documents do not provide sufficient information to find an answer",
    "path": "papers/22/07/2207.13332.json",
    "total_tokens": 839,
    "translated_title": "实时问答系统：现在的答案是什么？",
    "translated_abstract": "我们介绍了REALTIME QA，这是一个动态问答平台，定期发布问题并评估系统（本版本每周一次）。REALTIME QA询问当前世界，QA系统需要回答关于新事件或信息的问题。因此，它挑战了开放领域QA数据集中的静态、传统假设，并追求即时应用。我们基于大型预训练语言模型（包括GPT-3和T5）构建了强大的基线模型。我们的基准测试工作是一个持续的努力，本文呈现了过去一年的实时评估结果。我们的实验结果表明，GPT-3通常可以根据新检索的文档正确地更新其生成结果，突显了更新至关重要的信息检索的重要性。然而，我们发现在检索到的文档未提供足够信息以找到答案时，GPT-3往往会返回过时的答案。",
    "tldr": "该论文介绍了REALTIME QA，一个动态问答平台，挑战静态开放领域QA数据集假设，强调对实时信息的重要性，并展示了基于GPT-3的实时评估结果。",
    "en_tdlr": "This paper introduces REALTIME QA, a dynamic question answering platform that challenges static assumptions in open-domain QA datasets, emphasizes the importance of real-time information, and presents real-time evaluation results based on GPT-3."
}