{
    "title": "FreeREA: Training-Free Evolution-based Architecture Search. (arXiv:2207.05135v2 [cs.NE] UPDATED)",
    "abstract": "In the last decade, most research in Machine Learning contributed to the improvement of existing models, with the aim of increasing the performance of neural networks for the solution of a variety of different tasks. However, such advancements often come at the cost of an increase of model memory and computational requirements. This represents a significant limitation for the deployability of research output in realistic settings, where the cost, the energy consumption, and the complexity of the framework play a crucial role. To solve this issue, the designer should search for models that maximise the performance while limiting its footprint. Typical approaches to reach this goal rely either on manual procedures, which cannot guarantee the optimality of the final design, or upon Neural Architecture Search algorithms to automatise the process, at the expenses of extremely high computational time. This paper provides a solution for the fast identification of a neural network that maximis",
    "link": "http://arxiv.org/abs/2207.05135",
    "context": "Title: FreeREA: Training-Free Evolution-based Architecture Search. (arXiv:2207.05135v2 [cs.NE] UPDATED)\nAbstract: In the last decade, most research in Machine Learning contributed to the improvement of existing models, with the aim of increasing the performance of neural networks for the solution of a variety of different tasks. However, such advancements often come at the cost of an increase of model memory and computational requirements. This represents a significant limitation for the deployability of research output in realistic settings, where the cost, the energy consumption, and the complexity of the framework play a crucial role. To solve this issue, the designer should search for models that maximise the performance while limiting its footprint. Typical approaches to reach this goal rely either on manual procedures, which cannot guarantee the optimality of the final design, or upon Neural Architecture Search algorithms to automatise the process, at the expenses of extremely high computational time. This paper provides a solution for the fast identification of a neural network that maximis",
    "path": "papers/22/07/2207.05135.json",
    "total_tokens": 989,
    "translated_title": "FreeREA: 无需训练的进化式架构搜索算法",
    "translated_abstract": "在过去的十年中，机器学习领域的大部分研究都是为了改进现有模型，以增加神经网络在各种不同任务的解决方案中的性能。然而，这样的进步往往以增加模型内存和计算需求的代价为代价。这对于研究成果在实际环境中的部署具有相当大的限制性，其中成本、能源消耗和框架的复杂性发挥着至关重要的作用。本文提出了一种新颖的进化式架构搜索算法FreeREA，通过该算法可以快速识别性能最大化且内存占用最小化的神经网络，而无需训练步骤，并在目标硬件上直接优化架构搜索，无需代理指标。实验结果表明了FreeREA的有效性，它能够在需要少达487倍计算资源的情况下，胜过最先进的手动设计架构。",
    "tldr": "本研究提出了一种无需训练步骤的进化式架构搜索算法FreeREA，可直接在目标硬件上优化搜索，且能够在性能最大化的同时，极大地减小内存占用。实验结果证明其比手动设计更高效。"
}