{
    "title": "Estimating and Controlling for Equalized Odds via Sensitive Attribute Predictors. (arXiv:2207.12497v4 [cs.LG] UPDATED)",
    "abstract": "As the use of machine learning models in real world high-stakes decision settings continues to grow, it is highly important that we are able to audit and control for any potential fairness violations these models may exhibit towards certain groups. To do so, one naturally requires access to sensitive attributes, such as demographics, gender, or other potentially sensitive features that determine group membership. Unfortunately, in many settings, this information is often unavailable. In this work we study the well known \\emph{equalized odds} (EOD) definition of fairness. In a setting without sensitive attributes, we first provide tight and computable upper bounds for the EOD violation of a predictor. These bounds precisely reflect the worst possible EOD violation. Second, we demonstrate how one can provably control the worst-case EOD by a new post-processing correction method. Our results characterize when directly controlling for EOD with respect to the predicted sensitive attributes ",
    "link": "http://arxiv.org/abs/2207.12497",
    "context": "Title: Estimating and Controlling for Equalized Odds via Sensitive Attribute Predictors. (arXiv:2207.12497v4 [cs.LG] UPDATED)\nAbstract: As the use of machine learning models in real world high-stakes decision settings continues to grow, it is highly important that we are able to audit and control for any potential fairness violations these models may exhibit towards certain groups. To do so, one naturally requires access to sensitive attributes, such as demographics, gender, or other potentially sensitive features that determine group membership. Unfortunately, in many settings, this information is often unavailable. In this work we study the well known \\emph{equalized odds} (EOD) definition of fairness. In a setting without sensitive attributes, we first provide tight and computable upper bounds for the EOD violation of a predictor. These bounds precisely reflect the worst possible EOD violation. Second, we demonstrate how one can provably control the worst-case EOD by a new post-processing correction method. Our results characterize when directly controlling for EOD with respect to the predicted sensitive attributes ",
    "path": "papers/22/07/2207.12497.json",
    "total_tokens": 880,
    "translated_title": "通过敏感属性预测器估计和控制平等机会",
    "translated_abstract": "随着机器学习模型在现实中高风险决策场景中的使用不断增长，我们能够审计和控制这些模型向某些群体表现出的任何潜在公平性违规非常重要。为此，自然需要访问敏感属性，例如人口统计数据、性别或其他可能决定组成员身份的敏感特征。不幸的是，在许多情况下，这些信息通常不可用。在本文中，我们研究了公平性的众所周知的“平等机会”（EOD）定义。在没有敏感属性的情况下，我们首先为预测器的EOD违规提供了紧密且可计算的上界。这些边界正好反映了最坏的EOD违规。其次，我们展示了如何用一种新的后处理校正方法有保证地控制最坏情况下的EOD。我们的结果表明了直接针对预测的敏感属性控制EOD的情况。",
    "tldr": "本文提出了一种新的方法，可以在没有敏感属性的情况下估计和控制平等机会的违规，其通过一种后处理校正方法可以实现具有保证的EOD控制。"
}