{
    "title": "Optimal Clustering by Lloyd Algorithm for Low-Rank Mixture Model. (arXiv:2207.04600v2 [math.ST] UPDATED)",
    "abstract": "This paper investigates the computational and statistical limits in clustering matrix-valued observations. We propose a low-rank mixture model (LrMM), adapted from the classical Gaussian mixture model (GMM) to treat matrix-valued observations, which assumes low-rankness for population center matrices. A computationally efficient clustering method is designed by integrating Lloyd's algorithm and low-rank approximation. Once well-initialized, the algorithm converges fast and achieves an exponential-type clustering error rate that is minimax optimal. Meanwhile, we show that a tensor-based spectral method delivers a good initial clustering. Comparable to GMM, the minimax optimal clustering error rate is decided by the separation strength, i.e., the minimal distance between population center matrices. By exploiting low-rankness, the proposed algorithm is blessed with a weaker requirement on the separation strength. Unlike GMM, however, the computational difficulty of LrMM is characterized b",
    "link": "http://arxiv.org/abs/2207.04600",
    "context": "Title: Optimal Clustering by Lloyd Algorithm for Low-Rank Mixture Model. (arXiv:2207.04600v2 [math.ST] UPDATED)\nAbstract: This paper investigates the computational and statistical limits in clustering matrix-valued observations. We propose a low-rank mixture model (LrMM), adapted from the classical Gaussian mixture model (GMM) to treat matrix-valued observations, which assumes low-rankness for population center matrices. A computationally efficient clustering method is designed by integrating Lloyd's algorithm and low-rank approximation. Once well-initialized, the algorithm converges fast and achieves an exponential-type clustering error rate that is minimax optimal. Meanwhile, we show that a tensor-based spectral method delivers a good initial clustering. Comparable to GMM, the minimax optimal clustering error rate is decided by the separation strength, i.e., the minimal distance between population center matrices. By exploiting low-rankness, the proposed algorithm is blessed with a weaker requirement on the separation strength. Unlike GMM, however, the computational difficulty of LrMM is characterized b",
    "path": "papers/22/07/2207.04600.json",
    "total_tokens": 945,
    "translated_title": "低秩混合模型的Lloyd算法最优聚类",
    "translated_abstract": "本文研究了基于矩阵观测值的聚类的计算和统计限制。我们提出了一种低秩混合模型(LrMM)，该模型从经典的高斯混合模型(GMM)中演化而来，用于处理矩阵观测值，假设种群中心矩阵的低秩性。通过集成Lloyd算法和低秩逼近，设计了一种计算高效的聚类方法。一旦初始化良好，该算法收敛快速，具有一种指数型的聚类误差率，达到最小化的渐进次优性。与GMM相比，我们展示了基于张量的谱方法提供了一个良好的初始聚类。最小化渐进次优的聚类误差率由分离强度决定，即种群中心矩阵之间的最小距离。通过利用低秩性，所提出的算法在分离强度的要求上具有较弱的限制。但与GMM不同的是，LrMM的计算难度被特征化为一个最优控制问题。",
    "tldr": "本文提出了一种名为LrMM的低秩混合模型，结合了Lloyd算法和低秩逼近的聚类方法，能在较弱的限制下处理矩阵观测值，在达到最小化渐进次优的聚类误差率方面表现出众。"
}