{
    "title": "Reliable Representations Make A Stronger Defender: Unsupervised Structure Refinement for Robust GNN. (arXiv:2207.00012v4 [cs.LG] UPDATED)",
    "abstract": "Benefiting from the message passing mechanism, Graph Neural Networks (GNNs) have been successful on flourish tasks over graph data. However, recent studies have shown that attackers can catastrophically degrade the performance of GNNs by maliciously modifying the graph structure. A straightforward solution to remedy this issue is to model the edge weights by learning a metric function between pairwise representations of two end nodes, which attempts to assign low weights to adversarial edges. The existing methods use either raw features or representations learned by supervised GNNs to model the edge weights. However, both strategies are faced with some immediate problems: raw features cannot represent various properties of nodes (e.g., structure information), and representations learned by supervised GNN may suffer from the poor performance of the classifier on the poisoned graph. We need representations that carry both feature information and as mush correct structure information as p",
    "link": "http://arxiv.org/abs/2207.00012",
    "context": "Title: Reliable Representations Make A Stronger Defender: Unsupervised Structure Refinement for Robust GNN. (arXiv:2207.00012v4 [cs.LG] UPDATED)\nAbstract: Benefiting from the message passing mechanism, Graph Neural Networks (GNNs) have been successful on flourish tasks over graph data. However, recent studies have shown that attackers can catastrophically degrade the performance of GNNs by maliciously modifying the graph structure. A straightforward solution to remedy this issue is to model the edge weights by learning a metric function between pairwise representations of two end nodes, which attempts to assign low weights to adversarial edges. The existing methods use either raw features or representations learned by supervised GNNs to model the edge weights. However, both strategies are faced with some immediate problems: raw features cannot represent various properties of nodes (e.g., structure information), and representations learned by supervised GNN may suffer from the poor performance of the classifier on the poisoned graph. We need representations that carry both feature information and as mush correct structure information as p",
    "path": "papers/22/07/2207.00012.json",
    "total_tokens": 1269,
    "translated_title": "可靠表示使防御者更强大：鲁棒GNN的无监督结构优化",
    "translated_abstract": "由于消息传递机制，图神经网络（GNN）在处理图形数据方面在许多任务上取得了成功。然而，最近的研究表明，攻击者可以通过恶意修改图形结构来灾难性地降低GNN的性能。解决这个问题的直接方法是通过学习两个端节点之间的成对表示的度量函数来建模边缘权重，试图为对抗性边缘分配低权重。现有的方法使用原始特征或由有监督GNN学习的表示来模拟边缘权重。然而，这两种策略都面临一些直接问题：原始特征不能表示节点的各种属性（例如结构信息），而由有监督GNN学习的表示可能会受到在污染图上分类器性能差的影响。我们需要表示既携带特征信息，又尽可能多地携带正确结构信息。在本文中，我们提出了一种名为可靠表示优化的新型无监督结构优化框架，用于鲁棒GNN。R3首先通过删除对抗性边缘从输入图形中学习辅助图形，然后通过重建原始图形结构来优化该辅助图形上的节点表示。此外，我们研究了不同预训练策略对学习节点表示质量的影响。针对图形抗性评估的几个基准数据集的实验结果表明，R3可以有效减少结构和基于特征的攻击的影响，并胜过现有的最先进基线模型。",
    "tldr": "本文提出了一种名为可靠表示优化（R3）的新型无监督结构优化框架，用于提高GNN的鲁棒性能，通过学习辅助图形并重建原始图形结构来优化节点表示，可有效减少结构和基于特征的攻击的影响，并胜过现有的最先进基线模型。",
    "en_tdlr": "This paper proposes a novel unsupervised structure refinement framework called R3 for robust GNNs, which can effectively reduce the impact of both structural and feature-based attacks, and outperform state-of-the-art baselines. The framework learns an auxiliary graph by removing adversarial edges and refines the node representations on this graph by reconstructing the original graph structure."
}