{
    "title": "Provable Defense Against Geometric Transformations. (arXiv:2207.11177v3 [cs.LG] UPDATED)",
    "abstract": "Geometric image transformations that arise in the real world, such as scaling and rotation, have been shown to easily deceive deep neural networks (DNNs). Hence, training DNNs to be certifiably robust to these perturbations is critical. However, no prior work has been able to incorporate the objective of deterministic certified robustness against geometric transformations into the training procedure, as existing verifiers are exceedingly slow. To address these challenges, we propose the first provable defense for deterministic certified geometric robustness. Our framework leverages a novel GPU-optimized verifier that can certify images between 60$\\times$ to 42,600$\\times$ faster than existing geometric robustness verifiers, and thus unlike existing works, is fast enough for use in training. Across multiple datasets, our results show that networks trained via our framework consistently achieve state-of-the-art deterministic certified geometric robustness and clean accuracy. Furthermore,",
    "link": "http://arxiv.org/abs/2207.11177",
    "context": "Title: Provable Defense Against Geometric Transformations. (arXiv:2207.11177v3 [cs.LG] UPDATED)\nAbstract: Geometric image transformations that arise in the real world, such as scaling and rotation, have been shown to easily deceive deep neural networks (DNNs). Hence, training DNNs to be certifiably robust to these perturbations is critical. However, no prior work has been able to incorporate the objective of deterministic certified robustness against geometric transformations into the training procedure, as existing verifiers are exceedingly slow. To address these challenges, we propose the first provable defense for deterministic certified geometric robustness. Our framework leverages a novel GPU-optimized verifier that can certify images between 60$\\times$ to 42,600$\\times$ faster than existing geometric robustness verifiers, and thus unlike existing works, is fast enough for use in training. Across multiple datasets, our results show that networks trained via our framework consistently achieve state-of-the-art deterministic certified geometric robustness and clean accuracy. Furthermore,",
    "path": "papers/22/07/2207.11177.json",
    "total_tokens": 1000,
    "translated_title": "几何变换的可证明防御",
    "translated_abstract": "在现实世界中出现的几何图像变换（如缩放和旋转）已被证明可以轻松欺骗深度神经网络（DNN）。因此，训练DNN以在这些扰动下有认证的鲁棒性至关重要。然而，迄今为止，由于现有的验证器速度过慢，未能将确定性认证鲁棒性对抗几何变换的目标纳入训练过程中。为了解决这些挑战，我们提出了第一个可证明的确定性认证几何鲁棒性的防御框架。我们的框架利用了一种新颖的GPU优化验证器，其可以比现有的几何鲁棒性验证器快60倍到42,600倍，因此与现有的作品不同，我们的防御框架足够快，适用于训练。在多个数据集上，我们的结果表明，通过我们的框架训练的网络始终达到最先进的确定性认证几何鲁棒性和干净准确度。此外，我们展示了我们的防御可以有效地提高基于扰动训练的DNNs的准确性。",
    "tldr": "提出了第一个可证明的确定性认证几何鲁棒性防御框架，利用了一种新颖的GPU优化验证器，能够快速地训练鲁棒的DNNs，并在多个数据集上 consistently achieve state-of-the-art deterministic certified geometric robustness 和干净准确度的效果。",
    "en_tdlr": "The paper proposes the first provable defense for deterministic certified geometric robustness against geometric image transformations by leveraging a novel GPU-optimized verifier, which can certify images between 60x to 42,600x faster than existing verifiers. The proposed framework is fast enough for use in training and consistently achieves state-of-the-art deterministic certified geometric robustness and clean accuracy on multiple datasets."
}