{
    "title": "Detecting Grouped Local Average Treatment Effects and Selecting True Instruments. (arXiv:2207.04481v2 [econ.EM] UPDATED)",
    "abstract": "Under an endogenous binary treatment with heterogeneous effects and multiple instruments, we propose a two-step procedure for identifying complier groups with identical local average treatment effects (LATE) despite relying on distinct instruments, even if several instruments violate the identifying assumptions. We use the fact that the LATE is homogeneous for instruments which (i) satisfy the LATE assumptions (instrument validity and treatment monotonicity in the instrument) and (ii) generate identical complier groups in terms of treatment propensities given the respective instruments. We propose a two-step procedure, where we first cluster the propensity scores in the first step and find groups of IVs with the same reduced form parameters in the second step. Under the plurality assumption that within each set of instruments with identical treatment propensities, instruments truly satisfying the LATE assumptions are the largest group, our procedure permits identifying these true instr",
    "link": "http://arxiv.org/abs/2207.04481",
    "context": "Title: Detecting Grouped Local Average Treatment Effects and Selecting True Instruments. (arXiv:2207.04481v2 [econ.EM] UPDATED)\nAbstract: Under an endogenous binary treatment with heterogeneous effects and multiple instruments, we propose a two-step procedure for identifying complier groups with identical local average treatment effects (LATE) despite relying on distinct instruments, even if several instruments violate the identifying assumptions. We use the fact that the LATE is homogeneous for instruments which (i) satisfy the LATE assumptions (instrument validity and treatment monotonicity in the instrument) and (ii) generate identical complier groups in terms of treatment propensities given the respective instruments. We propose a two-step procedure, where we first cluster the propensity scores in the first step and find groups of IVs with the same reduced form parameters in the second step. Under the plurality assumption that within each set of instruments with identical treatment propensities, instruments truly satisfying the LATE assumptions are the largest group, our procedure permits identifying these true instr",
    "path": "papers/22/07/2207.04481.json",
    "total_tokens": 846,
    "translated_title": "检测分组的局部平均处理效应并选择真正的工具",
    "translated_abstract": "在具有异质效应和多个工具的内生二元处理中，我们提出了一个两步骤的过程，用于识别具有相同局部平均处理效应（LATE）的响应组，尽管依赖于不同的工具，即使有几个工具违反了识别假设。我们利用了LATE对于满足LATE假设（工具有效性和处理在工具上单调性）和在给定相应工具的情况下生成相同响应组的工具来说是均匀的这一事实。我们提出了一个两步骤的过程，第一步我们首先聚类倾向得分，在第二步中找到具有相同减少形式参数的IV组。在众数假设下，对于具有相同处理倾向的工具集合，真正满足LATE假设的工具是最大的组，我们的方法可以识别出这些真正的工具。",
    "tldr": "我们提出了一个两步骤的过程来识别具有相同局部平均处理效应的响应组，并且即使有一些工具违反了识别假设，也可以选择真正满足假设的工具。",
    "en_tdlr": "We propose a two-step procedure for identifying response groups with the same local average treatment effects, even if some instruments violate the identifying assumptions, and selecting the instruments that truly satisfy the assumptions."
}