{
    "title": "An Equity-Aware Recommender System for Curating Art Exhibits Based on Locally-Constrained Graph Matching. (arXiv:2207.14367v2 [cs.IR] UPDATED)",
    "abstract": "Public art shapes our shared spaces. Public art should speak to community and context, and yet, recent work has demonstrated numerous instances of art in prominent institutions favoring outdated cultural norms and legacy communities. Motivated by this, we develop a novel recommender system to curate public art exhibits with built-in equity objectives and a local value-based allocation of constrained resources. We develop a cost matrix by drawing on Schelling's model of segregation. Using the cost matrix as an input, the scoring function is optimized via a projected gradient descent to obtain a soft assignment matrix. Our optimization program allocates artwork to public spaces in a way that de-prioritizes \"in-group\" preferences, by satisfying minimum representation and exposure criteria. We draw on existing literature to develop a fairness metric for our algorithmic output, and we assess the effectiveness of our approach and discuss its potential pitfalls from both a curatorial and equi",
    "link": "http://arxiv.org/abs/2207.14367",
    "context": "Title: An Equity-Aware Recommender System for Curating Art Exhibits Based on Locally-Constrained Graph Matching. (arXiv:2207.14367v2 [cs.IR] UPDATED)\nAbstract: Public art shapes our shared spaces. Public art should speak to community and context, and yet, recent work has demonstrated numerous instances of art in prominent institutions favoring outdated cultural norms and legacy communities. Motivated by this, we develop a novel recommender system to curate public art exhibits with built-in equity objectives and a local value-based allocation of constrained resources. We develop a cost matrix by drawing on Schelling's model of segregation. Using the cost matrix as an input, the scoring function is optimized via a projected gradient descent to obtain a soft assignment matrix. Our optimization program allocates artwork to public spaces in a way that de-prioritizes \"in-group\" preferences, by satisfying minimum representation and exposure criteria. We draw on existing literature to develop a fairness metric for our algorithmic output, and we assess the effectiveness of our approach and discuss its potential pitfalls from both a curatorial and equi",
    "path": "papers/22/07/2207.14367.json",
    "total_tokens": 1002,
    "translated_title": "一种基于局部约束图匹配的注重公正性的艺术展推荐系统",
    "translated_abstract": "公共艺术塑造了我们共享的空间。公共艺术应该与社区和背景相关，然而最近的研究表明，许多知名机构的艺术作品偏向于过时的文化规范和传统社群。鉴于此，我们开发了一种新颖的推荐系统，用于以内置公正目标和局部基于价值的有限资源分配来策划公共艺术展览。我们利用Schelling的种族分离模型构建了成本矩阵。使用成本矩阵作为输入，通过投影梯度下降优化得到了一个软分配矩阵的评分函数。我们的优化程序以一种方式将艺术作品分配给公共空间，以降低“内部群体”偏好，并满足最低代表性和曝光标准。我们借鉴现有的文献为算法输出开发了一个公正性指标，并评估了我们的方法的效果，并从策展和公正性的角度讨论其潜在问题。",
    "tldr": "这个论文介绍了一种注重公正性的艺术展推荐系统，通过局部约束图匹配和价值导向的资源分配，实现公共艺术展览的策划。该系统采用Schelling模型构建成本矩阵，并通过优化评分函数，软分配艺术作品到公共空间，以减少内部群体偏好、满足最低代表性和曝光标准。"
}