{
    "title": "Machine Learning Security in Industry: A Quantitative Survey. (arXiv:2207.05164v2 [cs.LG] UPDATED)",
    "abstract": "Despite the large body of academic work on machine learning security, little is known about the occurrence of attacks on machine learning systems in the wild. In this paper, we report on a quantitative study with 139 industrial practitioners. We analyze attack occurrence and concern and evaluate statistical hypotheses on factors influencing threat perception and exposure. Our results shed light on real-world attacks on deployed machine learning. On the organizational level, while we find no predictors for threat exposure in our sample, the amount of implement defenses depends on exposure to threats or expected likelihood to become a target. We also provide a detailed analysis of practitioners' replies on the relevance of individual machine learning attacks, unveiling complex concerns like unreliable decision making, business information leakage, and bias introduction into models. Finally, we find that on the individual level, prior knowledge about machine learning security influences t",
    "link": "http://arxiv.org/abs/2207.05164",
    "raw_ret": "{\n    \"translated_title\": \"工业中的机器学习安全：定量调查\",\n    \"translated_abstract\": \"尽管有大量关于机器学习安全的学术工作，但对于在野外对机器学习系统的攻击发生情况知之甚少。在本文中，我们对139名工业从业人员进行了定量研究。我们分析了攻击发生和关注情况，并评估了影响威胁感知和曝光的因素的统计假设。我们的结果揭示了部署的机器学习受到的真实攻击情况。在组织层面上，虽然我们在样本中没有找到威胁曝光的预测因素，但实施防御的数量取决于威胁曝光或成为目标的预期可能性。我们还提供了有关从业人员关于单个机器学习攻击相关性的详细分析，揭示了像不可靠的决策制定、业务信息泄漏和模型中引入偏差等复杂问题。最后，我们发现在个人层面上，关于机器学习安全的先前知识影响了...\",\n    \"tldr\": \"本文研究了139名工业从业人员对机器学习系统攻击的发生和关注情况，并对影响威胁感知和曝光的因素进行了统计假设评估。他们提供了有关从业人员关于单个机器学习攻击相关性的详细分析，揭示了像不可靠的决策制定、业务信息泄漏和模型中引入偏差等复杂问题。最后，我们发现在个人层面上，关于机器学习安全的先前知识影响了...\" \n}<|im_sep|>",
    "total_tokens": 967,
    "ret": {
        "translated_title": "工业中的机器学习安全：定量调查",
        "translated_abstract": "尽管有大量关于机器学习安全的学术工作，但对于在野外对机器学习系统的攻击发生情况知之甚少。在本文中，我们对139名工业从业人员进行了定量研究。我们分析了攻击发生和关注情况，并评估了影响威胁感知和曝光的因素的统计假设。我们的结果揭示了部署的机器学习受到的真实攻击情况。在组织层面上，虽然我们在样本中没有找到威胁曝光的预测因素，但实施防御的数量取决于威胁曝光或成为目标的预期可能性。我们还提供了有关从业人员关于单个机器学习攻击相关性的详细分析，揭示了像不可靠的决策制定、业务信息泄漏和模型中引入偏差等复杂问题。最后，我们发现在个人层面上，关于机器学习安全的先前知识影响了...",
        "tldr": "本文研究了139名工业从业人员对机器学习系统攻击的发生和关注情况，并对影响威胁感知和曝光的因素进行了统计假设评估。他们提供了有关从业人员关于单个机器学习攻击相关性的详细分析，揭示了像不可靠的决策制定、业务信息泄漏和模型中引入偏差等复杂问题。最后，我们发现在个人层面上，关于机器学习安全的先前知识影响了..."
    }
}