{
    "title": "Flexible global forecast combinations. (arXiv:2207.07318v2 [econ.EM] UPDATED)",
    "abstract": "Forecast combination -- the aggregation of individual forecasts from multiple experts or models -- is a proven approach to economic forecasting. To date, research on economic forecasting has concentrated on local combination methods, which handle separate but related forecasting tasks in isolation. Yet, it has been known for over two decades in the machine learning community that global methods, which exploit task-relatedness, can improve on local methods that ignore it. Motivated by the possibility for improvement, this paper introduces a framework for globally combining forecasts while being flexible to the level of task-relatedness. Through our framework, we develop global versions of several existing forecast combinations. To evaluate the efficacy of these new global forecast combinations, we conduct extensive comparisons using synthetic and real data. Our real data comparisons, which involve forecasts of core economic indicators in the Eurozone, provide empirical evidence that the",
    "link": "http://arxiv.org/abs/2207.07318",
    "context": "Title: Flexible global forecast combinations. (arXiv:2207.07318v2 [econ.EM] UPDATED)\nAbstract: Forecast combination -- the aggregation of individual forecasts from multiple experts or models -- is a proven approach to economic forecasting. To date, research on economic forecasting has concentrated on local combination methods, which handle separate but related forecasting tasks in isolation. Yet, it has been known for over two decades in the machine learning community that global methods, which exploit task-relatedness, can improve on local methods that ignore it. Motivated by the possibility for improvement, this paper introduces a framework for globally combining forecasts while being flexible to the level of task-relatedness. Through our framework, we develop global versions of several existing forecast combinations. To evaluate the efficacy of these new global forecast combinations, we conduct extensive comparisons using synthetic and real data. Our real data comparisons, which involve forecasts of core economic indicators in the Eurozone, provide empirical evidence that the",
    "path": "papers/22/07/2207.07318.json",
    "total_tokens": 851,
    "translated_title": "灵活的全球预测组合",
    "translated_abstract": "预测组合——将多个专家或模型的个别预测聚合起来——是一种经过验证的经济预测方法。迄今为止，经济预测研究集中在局部组合方法上，这些方法处理单独但相关的预测任务。然而，机器学习社区早在20多年前就已经知道，利用任务相关性的全局方法可以改善忽略相关性的局部方法。受到改进可能性的启发，本文介绍了一个灵活的框架，用于在考虑任务相关性的基础上全局组合预测。通过我们的框架，我们开发了几种现有预测组合的全局版本。为了评估这些新的全球预测组合的功效，我们使用合成和真实数据进行了广泛的比较。我们的真实数据比较涉及到欧元区核心经济指标的预测，提供了经验证据证明这些全球预测组合的有效性。",
    "tldr": "本文介绍了一种灵活的全球预测组合框架，能够在考虑任务相关性的基础上聚合多个专家或模型的预测。通过合成和真实数据的比较，证明了这些全球预测组合的有效性。"
}