{
    "title": "Mean-field Variational Inference via Wasserstein Gradient Flow. (arXiv:2207.08074v2 [math.ST] UPDATED)",
    "abstract": "Variational inference, such as the mean-field (MF) approximation, requires certain conjugacy structures for efficient computation. These can impose unnecessary restrictions on the viable prior distribution family and further constraints on the variational approximation family. In this work, we introduce a general computational framework to implement MF variational inference for Bayesian models, with or without latent variables, using the Wasserstein gradient flow (WGF), a modern mathematical technique for realizing a gradient flow over the space of probability measures. Theoretically, we analyze the algorithmic convergence of the proposed approaches, providing an explicit expression for the contraction factor. We also strengthen existing results on MF variational posterior concentration from a polynomial to an exponential contraction, by utilizing the fixed point equation of the time-discretized WGF. Computationally, we propose a new constraint-free function approximation method using ",
    "link": "http://arxiv.org/abs/2207.08074",
    "context": "Title: Mean-field Variational Inference via Wasserstein Gradient Flow. (arXiv:2207.08074v2 [math.ST] UPDATED)\nAbstract: Variational inference, such as the mean-field (MF) approximation, requires certain conjugacy structures for efficient computation. These can impose unnecessary restrictions on the viable prior distribution family and further constraints on the variational approximation family. In this work, we introduce a general computational framework to implement MF variational inference for Bayesian models, with or without latent variables, using the Wasserstein gradient flow (WGF), a modern mathematical technique for realizing a gradient flow over the space of probability measures. Theoretically, we analyze the algorithmic convergence of the proposed approaches, providing an explicit expression for the contraction factor. We also strengthen existing results on MF variational posterior concentration from a polynomial to an exponential contraction, by utilizing the fixed point equation of the time-discretized WGF. Computationally, we propose a new constraint-free function approximation method using ",
    "path": "papers/22/07/2207.08074.json",
    "total_tokens": 839,
    "translated_title": "通过Wasserstein梯度流进行均场变分推理",
    "translated_abstract": "变分推理，如均场（MF）近似，对于高效计算需要特定的共轭结构。这可能对可行的先验分布族和变分近似族施加不必要的限制。在这项工作中，我们引入了一种通用的计算框架，使用Wasserstein梯度流（WGF）实现贝叶斯模型的均场变分推理，无论是否存在潜变量。在理论上，我们分析了提出方法的算法收敛性，提供了收缩因子的显式表达式。通过利用时间离散化的WGF的不动点方程，我们还将现有的关于MF变分后验集中性的结果从多项式收缩强化到指数收缩。在计算上，我们提出了一种新的无约束函数逼近方法",
    "tldr": "本文介绍了一种使用Wasserstein梯度流实现贝叶斯模型的均场变分推理的通用计算框架，克服了先验和变分近似所需的特定共轭结构限制，并展示了算法的收敛性和MF变分后验集中性的强化结果。"
}