{
    "title": "Error Analysis of Tensor-Train Cross Approximation. (arXiv:2207.04327v3 [cs.LG] UPDATED)",
    "abstract": "Tensor train decomposition is widely used in machine learning and quantum physics due to its concise representation of high-dimensional tensors, overcoming the curse of dimensionality. Cross approximation-originally developed for representing a matrix from a set of selected rows and columns-is an efficient method for constructing a tensor train decomposition of a tensor from few of its entries. While tensor train cross approximation has achieved remarkable performance in practical applications, its theoretical analysis, in particular regarding the error of the approximation, is so far lacking. To our knowledge, existing results only provide element-wise approximation accuracy guarantees, which lead to a very loose bound when extended to the entire tensor. In this paper, we bridge this gap by providing accuracy guarantees in terms of the entire tensor for both exact and noisy measurements. Our results illustrate how the choice of selected subtensors affects the quality of the cross appr",
    "link": "http://arxiv.org/abs/2207.04327",
    "context": "Title: Error Analysis of Tensor-Train Cross Approximation. (arXiv:2207.04327v3 [cs.LG] UPDATED)\nAbstract: Tensor train decomposition is widely used in machine learning and quantum physics due to its concise representation of high-dimensional tensors, overcoming the curse of dimensionality. Cross approximation-originally developed for representing a matrix from a set of selected rows and columns-is an efficient method for constructing a tensor train decomposition of a tensor from few of its entries. While tensor train cross approximation has achieved remarkable performance in practical applications, its theoretical analysis, in particular regarding the error of the approximation, is so far lacking. To our knowledge, existing results only provide element-wise approximation accuracy guarantees, which lead to a very loose bound when extended to the entire tensor. In this paper, we bridge this gap by providing accuracy guarantees in terms of the entire tensor for both exact and noisy measurements. Our results illustrate how the choice of selected subtensors affects the quality of the cross appr",
    "path": "papers/22/07/2207.04327.json",
    "total_tokens": 906,
    "translated_title": "张量列车交叉逼近的误差分析",
    "translated_abstract": "张量列车分解由于其对高维张量的简洁表示克服了维度灾难，因此在机器学习和量子物理中被广泛使用。交叉逼近最初是针对从一组选定的行和列中表示矩阵的有效方法，并且是从其少量元素中构建张量列车分解的高效方法。尽管张量列车交叉逼近在实际应用中取得了显著的性能，但其理论分析，特别是关于逼近误差的分析，迄今仍然缺乏。据我们所知，现有的结果仅提供逐元素逼近准确性保证，当延伸到整个张量时会导致非常松散的界限。在本文中，我们通过提供精确和有噪声测量的整个张量的准确性保证来弥合这一差距。我们的结果阐明了所选子张量的选择如何影响交叉逼近的质量，并提供了如何平衡计算成本和逼近准确性的见解。",
    "tldr": "本文提供了张量列车交叉逼近的误差分析，给出了精确和有噪声测量的整个张量的准确性保证，并提供了如何在计算成本和逼近准确性之间取得平衡的见解。",
    "en_tdlr": "This paper provides an error analysis of tensor train cross approximation, giving accuracy guarantees for both exact and noisy measurements of the entire tensor, and offering insights on how to balance computational cost and approximation accuracy."
}