{
    "title": "Reinforcement Learning Assisted Recursive QAOA",
    "abstract": "Variational quantum algorithms such as the Quantum Approximation Optimization Algorithm (QAOA) in recent years have gained popularity as they provide the hope of using NISQ devices to tackle hard combinatorial optimization problems. It is, however, known that at low depth, certain locality constraints of QAOA limit its performance. To go beyond these limitations, a non-local variant of QAOA, namely recursive QAOA (RQAOA), was proposed to improve the quality of approximate solutions. The RQAOA has been studied comparatively less than QAOA, and it is less understood, for instance, for what family of instances it may fail to provide high quality solutions. However, as we are tackling $\\mathsf{NP}$-hard problems (specifically, the Ising spin model), it is expected that RQAOA does fail, raising the question of designing even better quantum algorithms for combinatorial optimization. In this spirit, we identify and analyze cases where RQAOA fails and, based on this, propose a reinforcement le",
    "link": "https://arxiv.org/abs/2207.06294",
    "context": "Title: Reinforcement Learning Assisted Recursive QAOA\nAbstract: Variational quantum algorithms such as the Quantum Approximation Optimization Algorithm (QAOA) in recent years have gained popularity as they provide the hope of using NISQ devices to tackle hard combinatorial optimization problems. It is, however, known that at low depth, certain locality constraints of QAOA limit its performance. To go beyond these limitations, a non-local variant of QAOA, namely recursive QAOA (RQAOA), was proposed to improve the quality of approximate solutions. The RQAOA has been studied comparatively less than QAOA, and it is less understood, for instance, for what family of instances it may fail to provide high quality solutions. However, as we are tackling $\\mathsf{NP}$-hard problems (specifically, the Ising spin model), it is expected that RQAOA does fail, raising the question of designing even better quantum algorithms for combinatorial optimization. In this spirit, we identify and analyze cases where RQAOA fails and, based on this, propose a reinforcement le",
    "path": "papers/22/07/2207.06294.json",
    "total_tokens": 895,
    "translated_title": "加强学习辅助的递归QAOA",
    "translated_abstract": "近年来，诸如量子近似优化算法（QAOA）之类的变分量子算法因为它们有望利用NISQ设备解决困难的组合优化问题而变得流行。然而，已知在低深度下，QAOA的某些局部性约束限制了其性能。为了超越这些限制，提出了一种非局部的QAOA变体，即递归QAOA（RQAOA），以提高近似解的质量。RQAOA相对于QAOA的研究较少，人们对其了解较少，例如在哪些实例族上可能无法提供高质量的解。然而，由于我们处理的是NP难问题（具体而言是伊辛自旋模型），预计RQAOA会失败，这引发了设计更好的量子算法来解决组合优化问题的问题。在这种精神下，我们确定并分析了RQAOA失败的案例，并基于此提出了一种强化学习辅助的方法。",
    "tldr": "递归QAOA是一种非局部的QAOA变体，用于改善近似解的质量。本文通过识别和分析RQAOA失败的案例，提出了一种使用强化学习辅助的方法。"
}