{
    "title": "Deep neural networks on diffeomorphism groups for optimal shape reparameterization. (arXiv:2207.11141v2 [math.OC] UPDATED)",
    "abstract": "One of the fundamental problems in shape analysis is to align curves or surfaces before computing geodesic distances between their shapes. Finding the optimal reparametrization realizing this alignment is a computationally demanding task, typically done by solving an optimization problem on the diffeomorphism group. In this paper, we propose an algorithm for constructing approximations of orientation-preserving diffeomorphisms by composition of elementary diffeomorphisms. The algorithm is implemented using PyTorch, and is applicable for both unparametrized curves and surfaces. Moreover, we show universal approximation properties for the constructed architectures, and obtain bounds for the Lipschitz constants of the resulting diffeomorphisms.",
    "link": "http://arxiv.org/abs/2207.11141",
    "context": "Title: Deep neural networks on diffeomorphism groups for optimal shape reparameterization. (arXiv:2207.11141v2 [math.OC] UPDATED)\nAbstract: One of the fundamental problems in shape analysis is to align curves or surfaces before computing geodesic distances between their shapes. Finding the optimal reparametrization realizing this alignment is a computationally demanding task, typically done by solving an optimization problem on the diffeomorphism group. In this paper, we propose an algorithm for constructing approximations of orientation-preserving diffeomorphisms by composition of elementary diffeomorphisms. The algorithm is implemented using PyTorch, and is applicable for both unparametrized curves and surfaces. Moreover, we show universal approximation properties for the constructed architectures, and obtain bounds for the Lipschitz constants of the resulting diffeomorphisms.",
    "path": "papers/22/07/2207.11141.json",
    "total_tokens": 764,
    "translated_title": "对于优化形状重新参数化，基于微分同胚群的深度神经网络",
    "translated_abstract": "形状分析中的一个基本问题是在计算形状之间的测地距离之前，将曲线或表面对齐。找到实现此对齐的最佳重新参数化是一个计算量庞大的任务，通常通过在微分同胚群上解决优化问题来完成。在本文中，我们提出了一种通过基本微分同胚的组合构造保持方向的微分同胚的算法。该算法使用PyTorch实现，并适用于非参数曲线和表面。此外，我们证明了构造的架构具有普遍逼近性质，并获得了所得微分同胚的Lipschitz常数的界限。",
    "tldr": "本文提出了一种基于深度神经网络在微分同胚群上进行形状重新参数化的方法，通过构造近似的保持方向的微分同胚，并证明了其具有普遍逼近性质和Lipschitz常数的界限。",
    "en_tdlr": "This paper proposes a method for shape reparameterization on diffeomorphism groups using deep neural networks, by constructing approximations of orientation-preserving diffeomorphisms and proving their universal approximation properties and bounds on Lipschitz constants."
}