{
    "title": "Robust Output Analysis with Monte-Carlo Methodology. (arXiv:2207.13612v3 [stat.ME] UPDATED)",
    "abstract": "In predictive modeling with simulation or machine learning, it is critical to accurately assess the quality of estimated values through output analysis. In recent decades output analysis has become enriched with methods that quantify the impact of input data uncertainty in the model outputs to increase robustness. However, most developments are applicable assuming that the input data adheres to a parametric family of distributions. We propose a unified output analysis framework for simulation and machine learning outputs through the lens of Monte Carlo sampling. This framework provides nonparametric quantification of the variance and bias induced in the outputs with higher-order accuracy. Our new bias-corrected estimation from the model outputs leverages the extension of fast iterative bootstrap sampling and higher-order influence functions. For the scalability of the proposed estimation methods, we devise budget-optimal rules and leverage control variates for variance reduction. Our t",
    "link": "http://arxiv.org/abs/2207.13612",
    "context": "Title: Robust Output Analysis with Monte-Carlo Methodology. (arXiv:2207.13612v3 [stat.ME] UPDATED)\nAbstract: In predictive modeling with simulation or machine learning, it is critical to accurately assess the quality of estimated values through output analysis. In recent decades output analysis has become enriched with methods that quantify the impact of input data uncertainty in the model outputs to increase robustness. However, most developments are applicable assuming that the input data adheres to a parametric family of distributions. We propose a unified output analysis framework for simulation and machine learning outputs through the lens of Monte Carlo sampling. This framework provides nonparametric quantification of the variance and bias induced in the outputs with higher-order accuracy. Our new bias-corrected estimation from the model outputs leverages the extension of fast iterative bootstrap sampling and higher-order influence functions. For the scalability of the proposed estimation methods, we devise budget-optimal rules and leverage control variates for variance reduction. Our t",
    "path": "papers/22/07/2207.13612.json",
    "total_tokens": 898,
    "translated_title": "鲁棒的蒙特卡洛方法输出分析",
    "translated_abstract": "在使用模拟或机器学习进行预测建模时，准确评估估计值的质量是非常重要的，因此需要进行输出分析。近几十年来，输出分析方法已经得到了丰富，并且提出了各种方法来量化输入数据不确定性对模型输出的影响，以增加鲁棒性。然而，大多数方法都是基于假设输入数据符合参数分布族的情况。本文提出了一个统一的输出分析框架，通过蒙特卡洛抽样的方式对模拟和机器学习输出进行分析。该框架可以对输出中引入的方差和偏差进行非参数化的量化，并具有更高阶的准确性。我们通过扩展快速迭代自举抽样和高阶影响函数，提出了一种新的从模型输出中校正偏差的估计方法。为了提高所提方法的可扩展性，我们设计了预算最优规则，并利用控制变量减少方差。",
    "tldr": "本论文提出了一个统一的蒙特卡洛抽样输出分析框架，通过对模拟和机器学习输出进行分析，能够非参数化地量化输出的方差和偏差，并提出了一种新的偏差校正估计方法，以提高鲁棒性。",
    "en_tdlr": "This paper proposes a unified Monte Carlo sampling framework for output analysis of simulation and machine learning models, providing nonparametric quantification of variance and bias in the outputs. It also introduces a new bias-corrected estimation method to improve robustness."
}