{
    "title": "Functional Generalized Empirical Likelihood Estimation for Conditional Moment Restrictions",
    "abstract": "arXiv:2207.04771v2 Announce Type: replace  Abstract: Important problems in causal inference, economics, and, more generally, robust machine learning can be expressed as conditional moment restrictions, but estimation becomes challenging as it requires solving a continuum of unconditional moment restrictions. Previous works addressed this problem by extending the generalized method of moments (GMM) to continuum moment restrictions. In contrast, generalized empirical likelihood (GEL) provides a more general framework and has been shown to enjoy favorable small-sample properties compared to GMM-based estimators. To benefit from recent developments in machine learning, we provide a functional reformulation of GEL in which arbitrary models can be leveraged. Motivated by a dual formulation of the resulting infinite dimensional optimization problem, we devise a practical method and explore its asymptotic properties. Finally, we provide kernel- and neural network-based implementations of the e",
    "link": "https://arxiv.org/abs/2207.04771",
    "context": "Title: Functional Generalized Empirical Likelihood Estimation for Conditional Moment Restrictions\nAbstract: arXiv:2207.04771v2 Announce Type: replace  Abstract: Important problems in causal inference, economics, and, more generally, robust machine learning can be expressed as conditional moment restrictions, but estimation becomes challenging as it requires solving a continuum of unconditional moment restrictions. Previous works addressed this problem by extending the generalized method of moments (GMM) to continuum moment restrictions. In contrast, generalized empirical likelihood (GEL) provides a more general framework and has been shown to enjoy favorable small-sample properties compared to GMM-based estimators. To benefit from recent developments in machine learning, we provide a functional reformulation of GEL in which arbitrary models can be leveraged. Motivated by a dual formulation of the resulting infinite dimensional optimization problem, we devise a practical method and explore its asymptotic properties. Finally, we provide kernel- and neural network-based implementations of the e",
    "path": "papers/22/07/2207.04771.json",
    "total_tokens": 809,
    "translated_title": "条件矩限制的功能化广义经验似然估计",
    "translated_abstract": "在因果推断、经济学习以及更一般的鲁棒机器学习中，重要问题可以被表达为条件矩限制，但由于需要解决一系列的无条件矩限制，估计变得具有挑战性。先前的工作通过将广义矩法（GMM）扩展到连续矩限制来解决这个问题。与此相反，广义经验似然（GEL）提供了一个更一般的框架，并且已经被证明在小样本性能上优于基于GMM的估计量。为了从最近的机器学习发展中受益，我们提供了GEL的功能重构，其中可以利用任意模型。受结果的无限维优化问题的对偶形式启发，我们设计了一个实用方法并探讨了其渐近性质。最后，我们提供了基于核和神经网络的实现方式。",
    "tldr": "提供了条件矩限制问题的功能化广义经验似然估计方法，并探索了其在小样本性能上的优势，同时提供了基于核和神经网络的实现方式。",
    "en_tdlr": "Introduces a functional generalized empirical likelihood estimation for conditional moment restrictions, explores its superior small-sample properties, and provides kernel- and neural network-based implementations."
}