{
    "title": "Retweet-BERT: Political Leaning Detection Using Language Features and Information Diffusion on Social Networks. (arXiv:2207.08349v3 [cs.SI] UPDATED)",
    "abstract": "Estimating the political leanings of social media users is a challenging and ever more pressing problem given the increase in social media consumption. We introduce Retweet-BERT, a simple and scalable model to estimate the political leanings of Twitter users. Retweet-BERT leverages the retweet network structure and the language used in users' profile descriptions. Our assumptions stem from patterns of networks and linguistics homophily among people who share similar ideologies. Retweet-BERT demonstrates competitive performance against other state-of-the-art baselines, achieving 96%-97% macro-F1 on two recent Twitter datasets (a COVID-19 dataset and a 2020 United States presidential elections dataset). We also perform manual validation to validate the performance of Retweet-BERT on users not in the training data. Finally, in a case study of COVID-19, we illustrate the presence of political echo chambers on Twitter and show that it exists primarily among right-leaning users. Our code is ",
    "link": "http://arxiv.org/abs/2207.08349",
    "context": "Title: Retweet-BERT: Political Leaning Detection Using Language Features and Information Diffusion on Social Networks. (arXiv:2207.08349v3 [cs.SI] UPDATED)\nAbstract: Estimating the political leanings of social media users is a challenging and ever more pressing problem given the increase in social media consumption. We introduce Retweet-BERT, a simple and scalable model to estimate the political leanings of Twitter users. Retweet-BERT leverages the retweet network structure and the language used in users' profile descriptions. Our assumptions stem from patterns of networks and linguistics homophily among people who share similar ideologies. Retweet-BERT demonstrates competitive performance against other state-of-the-art baselines, achieving 96%-97% macro-F1 on two recent Twitter datasets (a COVID-19 dataset and a 2020 United States presidential elections dataset). We also perform manual validation to validate the performance of Retweet-BERT on users not in the training data. Finally, in a case study of COVID-19, we illustrate the presence of political echo chambers on Twitter and show that it exists primarily among right-leaning users. Our code is ",
    "path": "papers/22/07/2207.08349.json",
    "total_tokens": 988,
    "translated_title": "Retweet-BERT：基于语言特征和社交网络信息扩散的政治倾向检测",
    "translated_abstract": "估计社交媒体用户的政治倾向是一个具有挑战性和越来越紧迫的问题，因为社交媒体消费量的增加。我们引入了Retweet-BERT，这是一个简单而可扩展的模型，用于估计Twitter用户的政治倾向。Retweet-BERT利用转发网络结构和用户个人资料描述中使用的语言。我们的假设来自于网络和语言同质性的模式，这些模式在那些分享相似意识形态的人们中非常普遍。Retweet-BERT在两个最近的Twitter数据集（一个COVID-19数据集和一个2020年美国总统选举数据集）上展现出与其他最新基线的有竞争力的性能，实现了96%-97%的宏F1。我们还进行了手动验证，以验证Retweet-BERT在训练数据之外的用户上的性能。最后，在COVID-19的案例研究中，我们展示了Twitter上政治回音室的存在，并表明这主要存在于右倾用户之间。我们的代码已开源。",
    "tldr": "Retweet-BERT是一个简单而可扩展的模型，用于估计Twitter用户的政治倾向。该模型利用转发网络结构和用户语言特征，并在COVID-19和2020年美国总统选举数据集上展现出有竞争力的性能。研究还表明，在Twitter上存在着右倾用户之间的政治回音室。"
}