{
    "title": "Inside the West Wing: Lobbying as a contest. (arXiv:2207.00800v2 [econ.TH] UPDATED)",
    "abstract": "When a government makes many different policy decisions, lobbying can be viewed as a contest between the government and many different special interest groups. The government fights lobbying by interest groups with its own political capital. In this world, we find that a government wants to `sell protection' -- give favourable treatment in exchange for contributions -- to certain interest groups. It does this in order to build its own `war chest' of political capital, which improves its position in fights with other interest groups. And it does so until it wins all remaining contests with certainty. This stands in contrast to existing models that often view lobbying as driven by information or agency problems.",
    "link": "http://arxiv.org/abs/2207.00800",
    "context": "Title: Inside the West Wing: Lobbying as a contest. (arXiv:2207.00800v2 [econ.TH] UPDATED)\nAbstract: When a government makes many different policy decisions, lobbying can be viewed as a contest between the government and many different special interest groups. The government fights lobbying by interest groups with its own political capital. In this world, we find that a government wants to `sell protection' -- give favourable treatment in exchange for contributions -- to certain interest groups. It does this in order to build its own `war chest' of political capital, which improves its position in fights with other interest groups. And it does so until it wins all remaining contests with certainty. This stands in contrast to existing models that often view lobbying as driven by information or agency problems.",
    "path": "papers/22/07/2207.00800.json",
    "total_tokens": 815,
    "translated_title": "西翼内幕：游说作为一场竞赛",
    "translated_abstract": "当政府做出许多不同的政策决策时，游说可以被视为政府和许多特殊利益集团之间的竞赛。政府通过其自身的政治资本与利益集团进行斗争。在这个世界中，我们发现政府想要“出售保护”，即在交换捐款的同时给予特定利益集团有利待遇。它这样做是为了建立自己的“战争基金”，提高在与其他利益集团争斗中的地位。直到它能够确定地赢得所有剩余的竞争。这与现有模型的观点形成鲜明对比，后者通常将游说视为信息或代理问题驱动的。",
    "tldr": "这篇论文研究了当一个政府做出多个政策决策时，游说可以被看作是政府和特殊利益集团之间的竞争，并发现政府会通过给予特定利益集团特殊待遇来建立自己的政治资本，以在与其他利益集团的斗争中取得优势。",
    "en_tdlr": "This paper examines lobbying as a contest between government and special interest groups when multiple policy decisions are made, and finds that the government seeks to \"sell protection\" by offering favorable treatment in exchange for contributions to build its own political capital, gaining an advantage in fights with other interest groups."
}