{
    "title": "A Comparison of Group Criticality Notions for Simple Games. (arXiv:2207.03565v2 [econ.TH] UPDATED)",
    "abstract": "We define a notion of the criticality of a player for simple monotone games based on cooperation with other players, either to form a winning coalition or to break a winning one, with an essential role for all the players involved. We compare it with the notion of differential criticality given by Beisbart that measures power as the opportunity left by other players.  We prove that our proposal satisfies an extension of the strong monotonicity introduced by Young, it assigns no power to dummy players and free riders, and it can easily be computed from the minimal winning and blocking coalitions. Our analysis shows that the measures of group criticality defined so far cannot weigh essential players while only remaining an opportunity measure. We propose a group opportunity test to reconcile the two views.",
    "link": "http://arxiv.org/abs/2207.03565",
    "context": "Title: A Comparison of Group Criticality Notions for Simple Games. (arXiv:2207.03565v2 [econ.TH] UPDATED)\nAbstract: We define a notion of the criticality of a player for simple monotone games based on cooperation with other players, either to form a winning coalition or to break a winning one, with an essential role for all the players involved. We compare it with the notion of differential criticality given by Beisbart that measures power as the opportunity left by other players.  We prove that our proposal satisfies an extension of the strong monotonicity introduced by Young, it assigns no power to dummy players and free riders, and it can easily be computed from the minimal winning and blocking coalitions. Our analysis shows that the measures of group criticality defined so far cannot weigh essential players while only remaining an opportunity measure. We propose a group opportunity test to reconcile the two views.",
    "path": "papers/22/07/2207.03565.json",
    "total_tokens": 847,
    "translated_title": "简单游戏中群体重要性概念的比较",
    "translated_abstract": "我们基于玩家之间的合作（或分裂）来定义简单单调博弈中玩家的关键程度概念，要求所有参与者都具有重要角色。我们将其与Beisbart提出的差分关键性概念进行比较，后者将权力定义为其他玩家留下的机会。我们证明了我们的提议满足Young引入的强单调性的扩展，不会为哑元玩家和自由骑手分配任何权力，并且可以从最小的获胜和阻塞联盟中轻松计算。我们的分析表明，迄今为止定义的群体关键性度量无法衡量重要的玩家，同时仅保持为机会度量。我们提出了一个群体机会测试来协调两种观点。",
    "tldr": "本文比较了简单游戏中基于合作和分裂的关键程度概念和差分关键性概念，提出了满足扩展强单调性、不分配权力给哑元玩家和自由骑手的新概念，并介绍了一个群体机会测试来统一两种观点。",
    "en_tdlr": "This paper compares the notions of criticality based on cooperation and division with the notion of differential criticality in simple games, proposes a new concept that satisfies the extension of strong monotonicity and does not allocate power to dummy players and free riders, and introduces a group opportunity test to reconcile the two views."
}