{
    "title": "Generalizing to Unseen Domains with Wasserstein Distributional Robustness under Limited Source Knowledge",
    "abstract": "arXiv:2207.04913v2 Announce Type: replace  Abstract: Domain generalization aims at learning a universal model that performs well on unseen target domains, incorporating knowledge from multiple source domains. In this research, we consider the scenario where different domain shifts occur among conditional distributions of different classes across domains. When labeled samples in the source domains are limited, existing approaches are not sufficiently robust. To address this problem, we propose a novel domain generalization framework called {Wasserstein Distributionally Robust Domain Generalization} (WDRDG), inspired by the concept of distributionally robust optimization. We encourage robustness over conditional distributions within class-specific Wasserstein uncertainty sets and optimize the worst-case performance of a classifier over these uncertainty sets. We further develop a test-time adaptation module leveraging optimal transport to quantify the relationship between the unseen targ",
    "link": "https://arxiv.org/abs/2207.04913",
    "context": "Title: Generalizing to Unseen Domains with Wasserstein Distributional Robustness under Limited Source Knowledge\nAbstract: arXiv:2207.04913v2 Announce Type: replace  Abstract: Domain generalization aims at learning a universal model that performs well on unseen target domains, incorporating knowledge from multiple source domains. In this research, we consider the scenario where different domain shifts occur among conditional distributions of different classes across domains. When labeled samples in the source domains are limited, existing approaches are not sufficiently robust. To address this problem, we propose a novel domain generalization framework called {Wasserstein Distributionally Robust Domain Generalization} (WDRDG), inspired by the concept of distributionally robust optimization. We encourage robustness over conditional distributions within class-specific Wasserstein uncertainty sets and optimize the worst-case performance of a classifier over these uncertainty sets. We further develop a test-time adaptation module leveraging optimal transport to quantify the relationship between the unseen targ",
    "path": "papers/22/07/2207.04913.json",
    "total_tokens": 821,
    "translated_title": "具有有限源知识下的Wasserstein分布鲁棒性对未知领域的泛化",
    "translated_abstract": "域泛化旨在学习一个通用模型，可以在未知目标领域上表现良好，并结合来自多个源域的知识。本研究考虑了在不同类别的条件分布之间发生不同领域转变的情形。当源域中标记样本有限时，现有方法不够健壮。为了解决这一问题，我们提出了一种新颖的领域泛化框架，称为{Wasserstein分布鲁棒领域泛化} (WDRDG)，灵感来自分布鲁棒优化的概念。我们鼓励在类别特定Wasserstein不确定性集合中的条件分布上的鲁棒性，并优化分类器在这些不确定性集合上的最坏情况性能。我们进一步开发了一个利用最优输运的测试时间适应模块，以量化未知目标之间关系。",
    "tldr": "提出了一种WDRDG框架，通过优化类别特定的Wasserstein不确定性集合中的条件分布，实现在未知领域中基于有限源知识的泛化。",
    "en_tdlr": "Introduced a WDRDG framework that achieves generalization to unseen domains based on limited source knowledge by optimizing the conditional distributions within class-specific Wasserstein uncertainty sets."
}