{
    "title": "Stochastic Optimal Control for Collective Variable Free Sampling of Molecular Transition Paths. (arXiv:2207.02149v2 [q-bio.BM] UPDATED)",
    "abstract": "We consider the problem of sampling transition paths between two given metastable states of a molecular system, e.g. a folded and unfolded protein or products and reactants of a chemical reaction. Due to the existence of high energy barriers separating the states, these transition paths are unlikely to be sampled with standard Molecular Dynamics (MD) simulation. Traditional methods to augment MD with a bias potential to increase the probability of the transition rely on a dimensionality reduction step based on Collective Variables (CVs). Unfortunately, selecting appropriate CVs requires chemical intuition and traditional methods are therefore not always applicable to larger systems. Additionally, when incorrect CVs are used, the bias potential might not be minimal and bias the system along dimensions irrelevant to the transition. Showing a formal relation between the problem of sampling molecular transition paths, the Schr\\\"odinger bridge problem and stochastic optimal control with neu",
    "link": "http://arxiv.org/abs/2207.02149",
    "context": "Title: Stochastic Optimal Control for Collective Variable Free Sampling of Molecular Transition Paths. (arXiv:2207.02149v2 [q-bio.BM] UPDATED)\nAbstract: We consider the problem of sampling transition paths between two given metastable states of a molecular system, e.g. a folded and unfolded protein or products and reactants of a chemical reaction. Due to the existence of high energy barriers separating the states, these transition paths are unlikely to be sampled with standard Molecular Dynamics (MD) simulation. Traditional methods to augment MD with a bias potential to increase the probability of the transition rely on a dimensionality reduction step based on Collective Variables (CVs). Unfortunately, selecting appropriate CVs requires chemical intuition and traditional methods are therefore not always applicable to larger systems. Additionally, when incorrect CVs are used, the bias potential might not be minimal and bias the system along dimensions irrelevant to the transition. Showing a formal relation between the problem of sampling molecular transition paths, the Schr\\\"odinger bridge problem and stochastic optimal control with neu",
    "path": "papers/22/07/2207.02149.json",
    "total_tokens": 805,
    "translated_title": "分子转变路径的随机最优控制方法的集合变量自由采样",
    "translated_abstract": "本文考虑了在分子系统中采样两个给定亚稳态之间的转变路径的问题，例如折叠和展开的蛋白质或化学反应的产物和反应物。由于存在高能屏障，标准的分子动力学模拟很难采样到这些转变路径。传统的方法通过在分子动力学模拟中引入偏倚势场来增加转变的概率，但这需要基于集合变量的降维步骤，选择合适的集合变量需要化学直觉，因此传统方法不适用于较大的系统。此外，当使用不正确的集合变量时，偏倚势场可能不是最小的，使系统在与转变无关的维度上发生偏倚。本文展示了采样分子转变路径问题、Schr\\\"odinger桥问题和随机最优控制与神经网络之间的形式关系。",
    "tldr": "本文介绍了一种解决分子转变路径采样问题的新方法，通过随机最优控制采样，避免了传统方法中需要选择集合变量的问题，能够适用于较大的系统。"
}