{
    "title": "Mitigating Propagation Failures in Physics-informed Neural Networks using Retain-Resample-Release (R3) Sampling. (arXiv:2207.02338v3 [cs.LG] UPDATED)",
    "abstract": "Despite the success of physics-informed neural networks (PINNs) in approximating partial differential equations (PDEs), PINNs can sometimes fail to converge to the correct solution in problems involving complicated PDEs. This is reflected in several recent studies on characterizing the \"failure modes\" of PINNs, although a thorough understanding of the connection between PINN failure modes and sampling strategies is missing. In this paper, we provide a novel perspective of failure modes of PINNs by hypothesizing that training PINNs relies on successful \"propagation\" of solution from initial and/or boundary condition points to interior points. We show that PINNs with poor sampling strategies can get stuck at trivial solutions if there are propagation failures, characterized by highly imbalanced PDE residual fields. To mitigate propagation failures, we propose a novel Retain-Resample-Release sampling (R3) algorithm that can incrementally accumulate collocation points in regions of high PD",
    "link": "http://arxiv.org/abs/2207.02338",
    "context": "Title: Mitigating Propagation Failures in Physics-informed Neural Networks using Retain-Resample-Release (R3) Sampling. (arXiv:2207.02338v3 [cs.LG] UPDATED)\nAbstract: Despite the success of physics-informed neural networks (PINNs) in approximating partial differential equations (PDEs), PINNs can sometimes fail to converge to the correct solution in problems involving complicated PDEs. This is reflected in several recent studies on characterizing the \"failure modes\" of PINNs, although a thorough understanding of the connection between PINN failure modes and sampling strategies is missing. In this paper, we provide a novel perspective of failure modes of PINNs by hypothesizing that training PINNs relies on successful \"propagation\" of solution from initial and/or boundary condition points to interior points. We show that PINNs with poor sampling strategies can get stuck at trivial solutions if there are propagation failures, characterized by highly imbalanced PDE residual fields. To mitigate propagation failures, we propose a novel Retain-Resample-Release sampling (R3) algorithm that can incrementally accumulate collocation points in regions of high PD",
    "path": "papers/22/07/2207.02338.json",
    "total_tokens": 942,
    "translated_title": "利用Retain-Resample-Release (R3)采样方法减轻物理信息神经网络中的传播失败",
    "translated_abstract": "尽管物理信息神经网络（PINN）在近似偏微分方程（PDE）方面取得了成功，但在涉及复杂PDE的问题中，PINN有时会无法收敛到正确的解。这反映在近期关于“失败模式”特征的几项研究中，尽管缺乏关于PINN失败模式和采样策略之间连接的深入理解。在本文中，我们提出了一种新的PINN失败模式的视角，即假设训练PINN基于从初始和/或边界条件点到内部点的解“传播”的成功。我们发现，如果存在传播失败，则采用糟糕采样策略的PINN可能会卡在平凡解上，表现为高度不平衡的PDE残差场。为了减轻传播失败，我们提出了一种新的Retain-Resample-Release采样（R3）算法，该算法可以在高PD区域逐步累积重合点。",
    "tldr": "本文提出了一种新的Retain-Resample-Release采样（R3）算法，通过减轻传播失败，使得物理信息神经网络（PINN）能够成功地从边界点传播解决方案到内部点。",
    "en_tdlr": "This paper introduces a novel Retain-Resample-Release sampling (R3) algorithm to mitigate propagation failures in physics-informed neural networks (PINNs), which can get stuck at trivial solutions due to poor sampling strategies. The R3 algorithm incrementally accumulates collocation points in regions of high PD to successfully propagate the solution from boundary points to interior points."
}