{
    "title": "Feed-Forward Latent Domain Adaptation",
    "abstract": "We study a new highly-practical problem setting that enables resource-constrained edge devices to adapt a pre-trained model to their local data distributions. Recognizing that device's data are likely to come from multiple latent domains that include a mixture of unlabelled domain-relevant and domain-irrelevant examples, we focus on the comparatively under-studied problem of latent domain adaptation. Considering limitations of edge devices, we aim to only use a pre-trained model and adapt it in a feed-forward way, without using back-propagation and without access to the source data. Modelling these realistic constraints bring us to the novel and practically important problem setting of feed-forward latent domain adaptation. Our solution is to meta-learn a network capable of embedding the mixed-relevance target dataset and dynamically adapting inference for target examples using cross-attention. The resulting framework leads to consistent improvements over strong ERM baselines. We also ",
    "link": "https://arxiv.org/abs/2207.07624",
    "context": "Title: Feed-Forward Latent Domain Adaptation\nAbstract: We study a new highly-practical problem setting that enables resource-constrained edge devices to adapt a pre-trained model to their local data distributions. Recognizing that device's data are likely to come from multiple latent domains that include a mixture of unlabelled domain-relevant and domain-irrelevant examples, we focus on the comparatively under-studied problem of latent domain adaptation. Considering limitations of edge devices, we aim to only use a pre-trained model and adapt it in a feed-forward way, without using back-propagation and without access to the source data. Modelling these realistic constraints bring us to the novel and practically important problem setting of feed-forward latent domain adaptation. Our solution is to meta-learn a network capable of embedding the mixed-relevance target dataset and dynamically adapting inference for target examples using cross-attention. The resulting framework leads to consistent improvements over strong ERM baselines. We also ",
    "path": "papers/22/07/2207.07624.json",
    "total_tokens": 862,
    "translated_title": "前馈潜在领域自适应",
    "translated_abstract": "我们研究了一种新的高度实用的问题设置，使资源受限的边缘设备能够适应其本地数据分布的预训练模型。认识到设备的数据很可能来自包含混合未标记的领域相关和领域不相关示例的多个潜在领域，我们专注于相对较少研究的潜在领域自适应问题。考虑到边缘设备的局限性，我们目标是仅使用预训练模型，并以前馈方式进行适应，而无需使用反向传播和无需访问源数据。建模这些现实约束将我们带到前馈潜在领域自适应的新颖和实用重要的问题设置。我们的解决方案是元学习一个网络，能够将混合相关目标数据集嵌入，并使用交叉注意力动态地适应目标示例的推理。所得到的框架相对于强ERM基线方法能够持续改进。",
    "tldr": "本文研究了前馈潜在领域自适应的问题，提出了一种通过元学习和交叉注意力实现动态适应的方法，该方法在资源受限的边缘设备上取得了一致的改进。",
    "en_tdlr": "This paper studies the problem of feed-forward latent domain adaptation and proposes a method that achieves dynamic adaptation through meta-learning and cross-attention, leading to consistent improvements on resource-constrained edge devices."
}