{
    "title": "Wasserstein Graph Distance Based on $L_1$-Approximated Tree Edit Distance between Weisfeiler-Lehman Subtrees. (arXiv:2207.04216v2 [cs.LG] UPDATED)",
    "abstract": "The Weisfeiler-Lehman (WL) test is a widely used algorithm in graph machine learning, including graph kernels, graph metrics, and graph neural networks. However, it focuses only on the consistency of the graph, which means that it is unable to detect slight structural differences. Consequently, this limits its ability to capture structural information, which also limits the performance of existing models that rely on the WL test. This limitation is particularly severe for traditional metrics defined by the WL test, which cannot precisely capture slight structural differences. In this paper, we propose a novel graph metric called the Wasserstein WL Subtree (WWLS) distance to address this problem. Our approach leverages the WL subtree as structural information for node neighborhoods and defines node metrics using the $L_1$-approximated tree edit distance ($L_1$-TED) between WL subtrees of nodes. Subsequently, we combine the Wasserstein distance and the $L_1$-TED to define the WWLS distan",
    "link": "http://arxiv.org/abs/2207.04216",
    "context": "Title: Wasserstein Graph Distance Based on $L_1$-Approximated Tree Edit Distance between Weisfeiler-Lehman Subtrees. (arXiv:2207.04216v2 [cs.LG] UPDATED)\nAbstract: The Weisfeiler-Lehman (WL) test is a widely used algorithm in graph machine learning, including graph kernels, graph metrics, and graph neural networks. However, it focuses only on the consistency of the graph, which means that it is unable to detect slight structural differences. Consequently, this limits its ability to capture structural information, which also limits the performance of existing models that rely on the WL test. This limitation is particularly severe for traditional metrics defined by the WL test, which cannot precisely capture slight structural differences. In this paper, we propose a novel graph metric called the Wasserstein WL Subtree (WWLS) distance to address this problem. Our approach leverages the WL subtree as structural information for node neighborhoods and defines node metrics using the $L_1$-approximated tree edit distance ($L_1$-TED) between WL subtrees of nodes. Subsequently, we combine the Wasserstein distance and the $L_1$-TED to define the WWLS distan",
    "path": "papers/22/07/2207.04216.json",
    "total_tokens": 957,
    "translated_title": "基于 Weisfeiler-Lehman 子树 L1-近似树编辑距离的 Wasserstein 图距离",
    "translated_abstract": "Weisfeiler-Lehman (WL)测试是图机器学习中广泛使用的算法，包括图内核、图度量和图神经网络。然而，它仅关注图的一致性，无法检测轻微的结构差异。因此，这限制了它捕捉结构信息的能力，也限制了依赖WL测试的现有模型的性能。本文提出一种名为Wasserstein WL子树(WWLS)距离的新型图距离，以解决这个问题。我们的方法利用WL子树作为节点邻域的结构信息，并使用节点的WL子树之间的L1-近似树编辑距离(L1-TED)定义节点度量。随后，我们结合了Wasserstein距离和L1-TED来定义WWLS距离",
    "tldr": "本文提出一种名为Wasserstein WL子树(WWLS)距离的新型图距离，通过利用WL子树作为节点邻域的结构信息，使用节点的WL子树之间的L1-近似树编辑距离(L1-TED)定义节点度量，解决了WL测试无法捕捉轻微结构差异的问题",
    "en_tdlr": "This paper proposes a novel graph metric called the Wasserstein WL Subtree (WWLS) distance, which addresses the limitation of the Weisfeiler-Lehman (WL) test in capturing slight structural differences by leveraging the WL subtree as structural information for node neighborhoods and defining node metrics using the $L_1$-approximated tree edit distance ($L_1$-TED) between WL subtrees of nodes, combined with the Wasserstein distance."
}