{
    "title": "Should Bank Stress Tests Be Fair?. (arXiv:2207.13319v2 [stat.ML] UPDATED)",
    "abstract": "Regulatory stress tests have become one of the main tools for setting capital requirements at the largest U.S. banks. The Federal Reserve uses confidential models to evaluate bank-specific outcomes for bank-specific portfolios in shared stress scenarios. As a matter of policy, the same models are used for all banks, despite considerable heterogeneity across institutions; individual banks have contended that some models are not suited to their businesses. Motivated by this debate, we ask, what is a fair aggregation of individually tailored models into a common model? We argue that simply pooling data across banks treats banks equally but is subject to two deficiencies: it may distort the impact of legitimate portfolio features, and it is vulnerable to implicit misdirection of legitimate information to infer bank identity. We compare various notions of regression fairness to address these deficiencies, considering both forecast accuracy and equal treatment. In the setting of linear model",
    "link": "http://arxiv.org/abs/2207.13319",
    "context": "Title: Should Bank Stress Tests Be Fair?. (arXiv:2207.13319v2 [stat.ML] UPDATED)\nAbstract: Regulatory stress tests have become one of the main tools for setting capital requirements at the largest U.S. banks. The Federal Reserve uses confidential models to evaluate bank-specific outcomes for bank-specific portfolios in shared stress scenarios. As a matter of policy, the same models are used for all banks, despite considerable heterogeneity across institutions; individual banks have contended that some models are not suited to their businesses. Motivated by this debate, we ask, what is a fair aggregation of individually tailored models into a common model? We argue that simply pooling data across banks treats banks equally but is subject to two deficiencies: it may distort the impact of legitimate portfolio features, and it is vulnerable to implicit misdirection of legitimate information to infer bank identity. We compare various notions of regression fairness to address these deficiencies, considering both forecast accuracy and equal treatment. In the setting of linear model",
    "path": "papers/22/07/2207.13319.json",
    "total_tokens": 884,
    "translated_title": "银行压力测试是否应该公正?",
    "translated_abstract": "监管压力测试已成为设定美国最大银行资本要求的主要工具。联邦储备系统使用保密模型，在共享压力情景中评估特定银行投资组合的银行特定结果。尽管不同机构之间存在相当大的异质性，但根据政策，所有银行均使用相同的模型，而个别银行认为某些模型不适合其业务。在这场辩论的推动下，我们要问的是，如何将个性化定制模型聚合成一个共同的模型是公平的？我们认为，仅简单地将数据汇集到银行并列处理虽然对所有银行公平，但存在两个弊端:它可能歪曲合法投资组合特征的影响，且容易将合法的信息差向银行身份的推断。我们比较了各种回归公平性的概念，以解决这些缺陷，考虑到预测准确性和平等待遇。在线性模型的设置中",
    "tldr": "本文讨论了银行压力测试中模型的公平性问题，主要解决了不同机构之间存在的差异性以及简单汇集数据可能导致的问题，提供了回归公平性的概念以解决这些缺陷。",
    "en_tdlr": "This paper discusses the fairness of models used in bank stress tests, addressing issues of heterogeneity among different institutions and the potential bias of simply pooling data across all banks. The authors provide concepts of regression fairness to mitigate these deficiencies."
}