{
    "title": "Ranking In Generalized Linear Bandits. (arXiv:2207.00109v2 [stat.ML] UPDATED)",
    "abstract": "We study the ranking problem in generalized linear bandits. At each time, the learning agent selects an ordered list of items and observes stochastic outcomes. In recommendation systems, displaying an ordered list of the most attractive items is not always optimal as both position and item dependencies result in a complex reward function. A very naive example is the lack of diversity when all the most attractive items are from the same category. We model the position and item dependencies in the ordered list and design UCB and Thompson Sampling type algorithms for this problem. Our work generalizes existing studies in several directions, including position dependencies where position discount is a particular case, and connecting the ranking problem to graph theory.",
    "link": "http://arxiv.org/abs/2207.00109",
    "context": "Title: Ranking In Generalized Linear Bandits. (arXiv:2207.00109v2 [stat.ML] UPDATED)\nAbstract: We study the ranking problem in generalized linear bandits. At each time, the learning agent selects an ordered list of items and observes stochastic outcomes. In recommendation systems, displaying an ordered list of the most attractive items is not always optimal as both position and item dependencies result in a complex reward function. A very naive example is the lack of diversity when all the most attractive items are from the same category. We model the position and item dependencies in the ordered list and design UCB and Thompson Sampling type algorithms for this problem. Our work generalizes existing studies in several directions, including position dependencies where position discount is a particular case, and connecting the ranking problem to graph theory.",
    "path": "papers/22/07/2207.00109.json",
    "total_tokens": 791,
    "translated_title": "广义线性Bandits中的排名问题研究",
    "translated_abstract": "我们研究了广义线性Bandits中的排名问题。在每个时刻，学习代理选择一个有序的物品列表，并观察随机结果。在推荐系统中，显示一个有序的最具吸引力的物品列表并不总是最优的，因为位置和物品之间存在复杂的奖励函数。一个非常简单的例子是当所有最具吸引力的物品都来自同一类别时缺乏多样性。我们对有序列表中的位置和物品之间的依赖关系进行建模，并设计了用于解决这个问题的UCB和Thompson Sampling类型的算法。我们的工作在几个方向上推广了现有的研究，包括位置依赖性，其中位置折扣是一个特例，并将排名问题与图论相联系。",
    "tldr": "本文研究了广义线性Bandits中的排名问题，设计了UCB和Thompson Sampling类型算法来解决该问题，并对位置和物品之间的依赖关系进行了建模。研究结果在位置依赖性和排名问题与图论的连接等方面进行了推广。",
    "en_tdlr": "This paper studies the ranking problem in generalized linear bandits and proposes UCB and Thompson Sampling algorithms to address it. The work models the dependencies between positions and items in the ordered list and generalizes existing studies in areas such as position dependencies and the connection between ranking problem and graph theory."
}