{
    "title": "Towards Unconstrained Audio Splicing Detection and Localization with Neural Networks. (arXiv:2207.14682v3 [cs.SD] UPDATED)",
    "abstract": "Freely available and easy-to-use audio editing tools make it straightforward to perform audio splicing. Convincing forgeries can be created by combining various speech samples from the same person. Detection of such splices is important both in the public sector when considering misinformation, and in a legal context to verify the integrity of evidence. Unfortunately, most existing detection algorithms for audio splicing use handcrafted features and make specific assumptions. However, criminal investigators are often faced with audio samples from unconstrained sources with unknown characteristics, which raises the need for more generally applicable methods.  With this work, we aim to take a first step towards unconstrained audio splicing detection to address this need. We simulate various attack scenarios in the form of post-processing operations that may disguise splicing. We propose a Transformer sequence-to-sequence (seq2seq) network for splicing detection and localization. Our exte",
    "link": "http://arxiv.org/abs/2207.14682",
    "context": "Title: Towards Unconstrained Audio Splicing Detection and Localization with Neural Networks. (arXiv:2207.14682v3 [cs.SD] UPDATED)\nAbstract: Freely available and easy-to-use audio editing tools make it straightforward to perform audio splicing. Convincing forgeries can be created by combining various speech samples from the same person. Detection of such splices is important both in the public sector when considering misinformation, and in a legal context to verify the integrity of evidence. Unfortunately, most existing detection algorithms for audio splicing use handcrafted features and make specific assumptions. However, criminal investigators are often faced with audio samples from unconstrained sources with unknown characteristics, which raises the need for more generally applicable methods.  With this work, we aim to take a first step towards unconstrained audio splicing detection to address this need. We simulate various attack scenarios in the form of post-processing operations that may disguise splicing. We propose a Transformer sequence-to-sequence (seq2seq) network for splicing detection and localization. Our exte",
    "path": "papers/22/07/2207.14682.json",
    "total_tokens": 1000,
    "translated_title": "基于神经网络的无约束音频拼接检测与定位方法研究",
    "translated_abstract": "容易获取且易于使用的音频编辑工具使得音频拼接变得简单。可通过组合同一人的各种语音样本来创建令人信服的伪造品。检测此类拼接在公共领域中考虑到虚假信息甚至在法律背景下核实证据的完整性都至关重要。然而，大多数现有的音频拼接检测算法使用手工制作的特征并做出了特定的假设。但是，刑事调查人员通常面临来自未知来源具有未知特征的音频样本，这引发了对更普适的方法的需求。本文旨在朝着无约束音频拼接检测方向迈出第一步以满足这一需求。我们通过各种攻击形式的后处理操作来模拟不同的攻击场景，可能掩盖拼接存在。我们提出了一种基于 Transformer 序列到序列（seq2seq）网络用于拼接检测和定位。我们广泛的实验表明所提出的方法优于几种最先进的方法，能够检测和定位甚至存在强烈失真和背景噪声的拼接。",
    "tldr": "研究提出了一种基于 Transformer 序列到序列（seq2seq）网络的音频拼接检测与定位方法，能够在各种攻击场景中准确检测出拼接并定位，具有普适性和鲁棒性。",
    "en_tdlr": "The study proposes a Transformer sequence-to-sequence (seq2seq) network for audio splicing detection and localization, which shows promising results in detecting and localizing splices even in the presence of strong distortions and background noise."
}