{
    "title": "Green, Quantized Federated Learning over Wireless Networks: An Energy-Efficient Design. (arXiv:2207.09387v3 [cs.LG] UPDATED)",
    "abstract": "In this paper, a green-quantized FL framework, which represents data with a finite precision level in both local training and uplink transmission, is proposed. Here, the finite precision level is captured through the use of quantized neural networks (QNNs) that quantize weights and activations in fixed-precision format. In the considered FL model, each device trains its QNN and transmits a quantized training result to the base station. Energy models for the local training and the transmission with quantization are rigorously derived. To minimize the energy consumption and the number of communication rounds simultaneously, a multi-objective optimization problem is formulated with respect to the number of local iterations, the number of selected devices, and the precision levels for both local training and transmission while ensuring convergence under a target accuracy constraint. To solve this problem, the convergence rate of the proposed FL system is analytically derived with respect t",
    "link": "http://arxiv.org/abs/2207.09387",
    "context": "Title: Green, Quantized Federated Learning over Wireless Networks: An Energy-Efficient Design. (arXiv:2207.09387v3 [cs.LG] UPDATED)\nAbstract: In this paper, a green-quantized FL framework, which represents data with a finite precision level in both local training and uplink transmission, is proposed. Here, the finite precision level is captured through the use of quantized neural networks (QNNs) that quantize weights and activations in fixed-precision format. In the considered FL model, each device trains its QNN and transmits a quantized training result to the base station. Energy models for the local training and the transmission with quantization are rigorously derived. To minimize the energy consumption and the number of communication rounds simultaneously, a multi-objective optimization problem is formulated with respect to the number of local iterations, the number of selected devices, and the precision levels for both local training and transmission while ensuring convergence under a target accuracy constraint. To solve this problem, the convergence rate of the proposed FL system is analytically derived with respect t",
    "path": "papers/22/07/2207.09387.json",
    "total_tokens": 904,
    "translated_title": "绿色，量化的无线网络联合学习：一种节能设计",
    "translated_abstract": "本文提出了一种绿色量化的无线网络联合学习框架，在本地训练和上行传输中使用有限精度级别来表示数据。这里，有限精度级别通过使用量化神经网络（QNNs）来实现，该网络以固定精度格式量化权重和激活函数。在考虑的联合学习模型中，每个设备训练其QNN并将量化的训练结果传输给基站。本文严格推导了本地训练和量化传输的能量模型。为了同时最小化能量消耗和通信轮次数量，本文制定了一个多目标优化问题，该问题涉及本地迭代次数、选定设备数量以及本地训练和传输的精度级别，并确保在目标准确度约束下的收敛性。为了解决这个问题，本文还分析推导了所提出的联合学习系统的收敛速度。",
    "tldr": "本文提出了一种绿色量化的无线网络联合学习框架，通过使用量化神经网络来实现有限精度级别的数据表示。针对能量消耗和通信轮次数量的最小化，提出了一个多目标优化问题，并分析推导了系统的收敛速度。"
}