{
    "title": "Adaptive deep learning for nonlinear time series models. (arXiv:2207.02546v2 [math.ST] UPDATED)",
    "abstract": "In this paper, we develop a general theory for adaptive nonparametric estimation of the mean function of a non-stationary and nonlinear time series model using deep neural networks (DNNs). We first consider two types of DNN estimators, non-penalized and sparse-penalized DNN estimators, and establish their generalization error bounds for general non-stationary time series. We then derive minimax lower bounds for estimating mean functions belonging to a wide class of nonlinear autoregressive (AR) models that include nonlinear generalized additive AR, single index, and threshold AR models. Building upon the results, we show that the sparse-penalized DNN estimator is adaptive and attains the minimax optimal rates up to a poly-logarithmic factor for many nonlinear AR models. Through numerical simulations, we demonstrate the usefulness of the DNN methods for estimating nonlinear AR models with intrinsic low-dimensional structures and discontinuous or rough mean functions, which is consistent",
    "link": "http://arxiv.org/abs/2207.02546",
    "context": "Title: Adaptive deep learning for nonlinear time series models. (arXiv:2207.02546v2 [math.ST] UPDATED)\nAbstract: In this paper, we develop a general theory for adaptive nonparametric estimation of the mean function of a non-stationary and nonlinear time series model using deep neural networks (DNNs). We first consider two types of DNN estimators, non-penalized and sparse-penalized DNN estimators, and establish their generalization error bounds for general non-stationary time series. We then derive minimax lower bounds for estimating mean functions belonging to a wide class of nonlinear autoregressive (AR) models that include nonlinear generalized additive AR, single index, and threshold AR models. Building upon the results, we show that the sparse-penalized DNN estimator is adaptive and attains the minimax optimal rates up to a poly-logarithmic factor for many nonlinear AR models. Through numerical simulations, we demonstrate the usefulness of the DNN methods for estimating nonlinear AR models with intrinsic low-dimensional structures and discontinuous or rough mean functions, which is consistent",
    "path": "papers/22/07/2207.02546.json",
    "total_tokens": 952,
    "translated_title": "自适应深度学习用于非线性时间序列模型",
    "translated_abstract": "本文提出了一种基于深度神经网络的非参数自适应估计理论，用于非平稳和非线性的时间序列模型的均值函数估计。我们首先考虑了两种类型的深度神经网络估计器，即非惩罚和稀疏惩罚的估计器，并为一般的非平稳时间序列建立了它们的泛化误差界限。然后，我们推导了估计属于广泛类别的非线性自回归模型（包括非线性广义可加自回归、单指数和阈值自回归模型）均值函数的极小下界。在这些结果的基础上，我们展示了稀疏惩罚的深度神经网络估计器在许多非线性自回归模型中是自适应的，并达到极小下界的最优速率，仅有多对数因子的差距。通过数值模拟，我们证明了深度神经网络方法在估计具有内在低维结构和不连续或粗糙均值函数的非线性自回归模型中的实用性。",
    "tldr": "本文提出了一种自适应深度学习方法用于非线性时间序列模型的均值函数估计，证明了稀疏惩罚的深度神经网络估计器在许多非线性自回归模型中达到了极小下界的最优速率。",
    "en_tdlr": "This paper presents an adaptive deep learning approach for estimating the mean function of nonlinear time series models, and demonstrates that the sparse-penalized deep neural network estimator achieves the minimax optimal rates for many nonlinear autoregressive models."
}