{
    "title": "Space-based gravitational wave signal detection and extraction with deep neural network. (arXiv:2207.07414v3 [gr-qc] UPDATED)",
    "abstract": "Space-based gravitational wave (GW) detectors will be able to observe signals from sources that are otherwise nearly impossible from current ground-based detection. Consequently, the well established signal detection method, matched filtering, will require a complex template bank, leading to a computational cost that is too expensive in practice. Here, we develop a high-accuracy GW signal detection and extraction method for all space-based GW sources. As a proof of concept, we show that a science-driven and uniform multi-stage self-attention-based deep neural network can identify synthetic signals that are submerged in Gaussian noise. Our method exhibits a detection rate exceeding 99% in identifying signals from various sources, with the signal-to-noise ratio at 50, at a false alarm rate of 1%. while obtaining at least 95% similarity compared with target signals. We further demonstrate the interpretability and strong generalization behavior for several extended scenarios.",
    "link": "http://arxiv.org/abs/2207.07414",
    "context": "Title: Space-based gravitational wave signal detection and extraction with deep neural network. (arXiv:2207.07414v3 [gr-qc] UPDATED)\nAbstract: Space-based gravitational wave (GW) detectors will be able to observe signals from sources that are otherwise nearly impossible from current ground-based detection. Consequently, the well established signal detection method, matched filtering, will require a complex template bank, leading to a computational cost that is too expensive in practice. Here, we develop a high-accuracy GW signal detection and extraction method for all space-based GW sources. As a proof of concept, we show that a science-driven and uniform multi-stage self-attention-based deep neural network can identify synthetic signals that are submerged in Gaussian noise. Our method exhibits a detection rate exceeding 99% in identifying signals from various sources, with the signal-to-noise ratio at 50, at a false alarm rate of 1%. while obtaining at least 95% similarity compared with target signals. We further demonstrate the interpretability and strong generalization behavior for several extended scenarios.",
    "path": "papers/22/07/2207.07414.json",
    "total_tokens": 925,
    "translated_title": "基于深度神经网络的空间引力波信号检测和提取",
    "translated_abstract": "空间引力波探测器将能够观测到地面探测器几乎无法观测到的信号源。因此，传统的信号检测方法，匹配滤波，将需要一个复杂的模板库，导致了实际上过于昂贵的计算成本。在这里，我们开发了一种高精度的用于所有空间引力波源的信号检测和提取方法。作为概念验证，我们展示了一种科学驱动和统一的多阶段自注意力深度神经网络能够识别在高斯噪声中潜在的信号。我们的方法在识别来自不同源的信号时表现出超过99%的检测率，信噪比为50，虚警率为1%，与目标信号相比至少达到95%的相似性。我们进一步展示了在几个扩展场景下的可解释性和强大的泛化行为。",
    "tldr": "本研究开发了一种高精度的使用深度神经网络的空间引力波信号检测和提取方法，能够在高斯噪声中识别各种源的信号，达到了超过99%的检测率和至少95%的相似性。该方法具有较低的虚警率和强大的泛化行为。"
}