{
    "title": "Do t-Statistic Hurdles Need to be Raised?. (arXiv:2204.10275v2 [q-fin.GN] UPDATED)",
    "abstract": "Many scholars have called for raising statistical hurdles to guard against false discoveries in academic publications. I show these calls are unlikely to be justified empirically. Published data exhibit bias: results that fail to meet existing hurdles are often unobserved. These unobserved results must be extrapolated, leading to weak identification of revised hurdles. In contrast, statistics that can target only published findings (e.g. empirical Bayes shrinkage and the local FDR) can be strongly identified, as data on published findings is plentiful. I demonstrate these results in a general theory and in an empirical analysis of the cross-sectional return predictability literature.",
    "link": "http://arxiv.org/abs/2204.10275",
    "context": "Title: Do t-Statistic Hurdles Need to be Raised?. (arXiv:2204.10275v2 [q-fin.GN] UPDATED)\nAbstract: Many scholars have called for raising statistical hurdles to guard against false discoveries in academic publications. I show these calls are unlikely to be justified empirically. Published data exhibit bias: results that fail to meet existing hurdles are often unobserved. These unobserved results must be extrapolated, leading to weak identification of revised hurdles. In contrast, statistics that can target only published findings (e.g. empirical Bayes shrinkage and the local FDR) can be strongly identified, as data on published findings is plentiful. I demonstrate these results in a general theory and in an empirical analysis of the cross-sectional return predictability literature.",
    "path": "papers/22/04/2204.10275.json",
    "total_tokens": 837,
    "translated_title": "是否需要提高t-统计障碍？",
    "translated_abstract": "许多学者呼吁提高统计障碍，以防止学术出版物中的错误发现。我展示了这些呼吁在经验上不太可能被证明成立。已发表的数据存在偏差：未能达到现有障碍的结果经常是不可观测的。这些未观察到的结果必须进行外推，导致修订障碍的识别能力不强。相比之下，只能针对已发表发现的统计方法（例如经验贝叶斯收缩和局部FDR）可以被强烈识别，因为有关已发表发现的数据非常丰富。我在一个一般理论和关于截面回报可预测性文献的实证分析中证明了这些结果。",
    "tldr": "许多学者呼吁提高统计障碍来防止错误发现，但经验证明这些呼吁在实践中不太合理。已发表的数据存在偏差，未观察到的结果需要外推，导致修订障碍的识别能力不强。与之相反，只针对已发表的发现进行统计分析可以得到较强的识别能力。",
    "en_tdlr": "Many scholars have called for raising statistical hurdles to guard against false discoveries in academic publications, but it has been empirically shown that these calls are unlikely to be justified. Published data exhibit bias and unobserved results must be extrapolated, leading to weak identification of revised hurdles. In contrast, statistics that target only published findings can be strongly identified, as data on published findings is plentiful."
}