{
    "title": "Interpretable Battery Cycle Life Range Prediction Using Early Degradation Data at Cell Level. (arXiv:2204.12420v2 [eess.SY] UPDATED)",
    "abstract": "Battery cycle life prediction using early degradation data has many potential applications throughout the battery product life cycle. For that reason, various data-driven methods have been proposed for point prediction of battery cycle life with minimum knowledge of the battery degradation mechanisms. However, managing the rapidly increasing amounts of batteries at end-of-life with lower economic and technical risk requires prediction of cycle life with quantified uncertainty, which is still lacking. The interpretability (i.e., the reason for high prediction accuracy) of these advanced data-driven methods is also worthy of investigation. Here, a Quantile Regression Forest (QRF) model, having the advantage of not assuming any specific distribution of cycle life, is introduced to make cycle life range prediction with uncertainty quantified as the width of the prediction interval, in addition to point predictions with high accuracy. The hyperparameters of the QRF model are optimized with ",
    "link": "http://arxiv.org/abs/2204.12420",
    "context": "Title: Interpretable Battery Cycle Life Range Prediction Using Early Degradation Data at Cell Level. (arXiv:2204.12420v2 [eess.SY] UPDATED)\nAbstract: Battery cycle life prediction using early degradation data has many potential applications throughout the battery product life cycle. For that reason, various data-driven methods have been proposed for point prediction of battery cycle life with minimum knowledge of the battery degradation mechanisms. However, managing the rapidly increasing amounts of batteries at end-of-life with lower economic and technical risk requires prediction of cycle life with quantified uncertainty, which is still lacking. The interpretability (i.e., the reason for high prediction accuracy) of these advanced data-driven methods is also worthy of investigation. Here, a Quantile Regression Forest (QRF) model, having the advantage of not assuming any specific distribution of cycle life, is introduced to make cycle life range prediction with uncertainty quantified as the width of the prediction interval, in addition to point predictions with high accuracy. The hyperparameters of the QRF model are optimized with ",
    "path": "papers/22/04/2204.12420.json",
    "total_tokens": 829,
    "translated_title": "利用电池早期退化数据进行可解释的电池循环寿命范围预测",
    "translated_abstract": "利用早期退化数据预测电池循环寿命在电池产品生命周期中有很多潜在应用。因此，为了管理数量急剧增加的电池末处理，并降低经济和技术风险，需要预测具有量化不确定性的循环寿命范围，但目前还缺乏该方面的研究。这里引入了一种Quantile Regression Forest (QRF)模型，该模型不假设任何特定的循环寿命分布，在高精度的点预测的基础上，通过预测区间宽度来量化不确定性，实现了循环寿命范围的预测，并探究了高预测精度的原因。",
    "tldr": "该论文提出了一种利用电池早期退化数据预测电池循环寿命范围的方法，其QRF模型能够实现高精度的点预测，并通过预测区间宽度来量化不确定性，具有可解释性。",
    "en_tdlr": "This paper proposes a method for predicting the battery cycle life range using early degradation data, and introduces the QRF model that can achieve high-precision point predictions and quantify uncertainty by predicting the width of the prediction interval, with interpretability."
}