{
    "title": "POSTER: A Pyramid Cross-Fusion Transformer Network for Facial Expression Recognition. (arXiv:2204.04083v2 [cs.CV] UPDATED)",
    "abstract": "Facial expression recognition (FER) is an important task in computer vision, having practical applications in areas such as human-computer interaction, education, healthcare, and online monitoring. In this challenging FER task, there are three key issues especially prevalent: inter-class similarity, intra-class discrepancy, and scale sensitivity. While existing works typically address some of these issues, none have fully addressed all three challenges in a unified framework. In this paper, we propose a two-stream Pyramid crOss-fuSion TransformER network (POSTER), that aims to holistically solve all three issues. Specifically, we design a transformer-based cross-fusion method that enables effective collaboration of facial landmark features and image features to maximize proper attention to salient facial regions. Furthermore, POSTER employs a pyramid structure to promote scale invariance. Extensive experimental results demonstrate that our POSTER achieves new state-of-the-art results o",
    "link": "http://arxiv.org/abs/2204.04083",
    "context": "Title: POSTER: A Pyramid Cross-Fusion Transformer Network for Facial Expression Recognition. (arXiv:2204.04083v2 [cs.CV] UPDATED)\nAbstract: Facial expression recognition (FER) is an important task in computer vision, having practical applications in areas such as human-computer interaction, education, healthcare, and online monitoring. In this challenging FER task, there are three key issues especially prevalent: inter-class similarity, intra-class discrepancy, and scale sensitivity. While existing works typically address some of these issues, none have fully addressed all three challenges in a unified framework. In this paper, we propose a two-stream Pyramid crOss-fuSion TransformER network (POSTER), that aims to holistically solve all three issues. Specifically, we design a transformer-based cross-fusion method that enables effective collaboration of facial landmark features and image features to maximize proper attention to salient facial regions. Furthermore, POSTER employs a pyramid structure to promote scale invariance. Extensive experimental results demonstrate that our POSTER achieves new state-of-the-art results o",
    "path": "papers/22/04/2204.04083.json",
    "total_tokens": 946,
    "translated_title": "POSTER:一种金字塔交叉融合变压器网络用于面部表情识别",
    "translated_abstract": "面部表情识别（FER）是计算机视觉中的一项重要任务，在人机交互、教育、医疗和在线监控等领域具有实际应用。在这个具有挑战性的FER任务中，存在三个主要问题: 类间相似性、类内差异性和尺度敏感性。虽然现有的作品通常解决其中的一些问题，但没有一个统一框架完全解决了这三个挑战。在本文中，我们提出了一种称为POSTER的双流金字塔交叉融合变压器网络，旨在全面解决这三个问题。具体而言，我们设计了一种基于变压器的交叉融合方法，以实现面部标志特征和图像特征的有效协作，最大限度地关注显著的面部区域。此外，POSTER采用了金字塔结构来提高尺度不变性。广泛的实验结果表明，我们的POSTER取得了新的最先进的结果。",
    "tldr": "POSTER是一种金字塔交叉融合变压器网络，旨在全面解决面部表情识别中的类间相似性、类内差异性和尺度敏感性问题。通过设计变压器的交叉融合方法和采用金字塔结构，POSTER达到了最先进的效果。",
    "en_tdlr": "POSTER is a Pyramid Cross-Fusion Transformer network that aims to holistically solve the challenges of inter-class similarity, intra-class discrepancy, and scale sensitivity in facial expression recognition. With a transformer-based cross-fusion method and a pyramid structure, POSTER achieves state-of-the-art results."
}