{
    "title": "Partially Linear Models under Data Combination. (arXiv:2204.05175v3 [econ.EM] UPDATED)",
    "abstract": "We study partially linear models when the outcome of interest and some of the covariates are observed in two different datasets that cannot be linked. This type of data combination problem arises very frequently in empirical microeconomics. Using recent tools from optimal transport theory, we derive a constructive characterization of the sharp identified set. We then build on this result and develop a novel inference method that exploits the specific geometric properties of the identified set. Our method exhibits good performances in finite samples, while remaining very tractable. We apply our approach to study intergenerational income mobility over the period 1850-1930 in the United States. Our method allows us to relax the exclusion restrictions used in earlier work, while delivering confidence regions that are informative.",
    "link": "http://arxiv.org/abs/2204.05175",
    "context": "Title: Partially Linear Models under Data Combination. (arXiv:2204.05175v3 [econ.EM] UPDATED)\nAbstract: We study partially linear models when the outcome of interest and some of the covariates are observed in two different datasets that cannot be linked. This type of data combination problem arises very frequently in empirical microeconomics. Using recent tools from optimal transport theory, we derive a constructive characterization of the sharp identified set. We then build on this result and develop a novel inference method that exploits the specific geometric properties of the identified set. Our method exhibits good performances in finite samples, while remaining very tractable. We apply our approach to study intergenerational income mobility over the period 1850-1930 in the United States. Our method allows us to relax the exclusion restrictions used in earlier work, while delivering confidence regions that are informative.",
    "path": "papers/22/04/2204.05175.json",
    "total_tokens": 852,
    "translated_title": "数据组合下的部分线性模型",
    "translated_abstract": "本研究在观测到感兴趣的结果和一些协变量来自于不能链接的两个数据集的情况下，研究了部分线性模型。这种数据组合问题在实证微观经济学中经常出现。利用最优传输理论的最新工具，我们对尖锐识别集合进行了构造性的描述。然后，基于此结果，我们开发了一种新的推断方法，利用了识别集合的特定几何特性。我们的方法在有限样本中表现良好，同时保持非常可行。我们应用该方法研究了1850年至1930年间在美国的代际收入流动性。我们的方法允许放宽早期研究中使用的排除约束，并提供信息丰富的置信区间。",
    "tldr": "在实证微观经济学中经常出现的数据组合问题中，我们使用最优传输理论的工具研究了部分线性模型。通过构造性描述尖锐识别集合，并利用其几何特性开发了一种新的推断方法。我们的方法在有限样本中表现良好，同时允许放宽排除约束，并提供信息丰富的置信区间。",
    "en_tdlr": "We study partially linear models in the context of data combination problems that frequently arise in empirical microeconomics. By using tools from optimal transport theory, we derive a constructive characterization of the sharp identified set and develop a novel inference method that exploits its geometric properties. Our method performs well in finite samples, allows for relaxing exclusion restrictions, and provides informative confidence regions."
}