{
    "title": "Probabilistic AutoRegressive Neural Networks for Accurate Long-range Forecasting. (arXiv:2204.09640v3 [stat.ML] UPDATED)",
    "abstract": "Forecasting time series data is a critical area of research with applications spanning from stock prices to early epidemic prediction. While numerous statistical and machine learning methods have been proposed, real-life prediction problems often require hybrid solutions that bridge classical forecasting approaches and modern neural network models. In this study, we introduce the Probabilistic AutoRegressive Neural Networks (PARNN), capable of handling complex time series data exhibiting non-stationarity, nonlinearity, non-seasonality, long-range dependence, and chaotic patterns. PARNN is constructed by improving autoregressive neural networks (ARNN) using autoregressive integrated moving average (ARIMA) feedback error, combining the explainability, scalability, and \"white-box-like\" prediction behavior of both models. Notably, the PARNN model provides uncertainty quantification through prediction intervals, setting it apart from advanced deep learning tools. Through comprehensive compu",
    "link": "http://arxiv.org/abs/2204.09640",
    "context": "Title: Probabilistic AutoRegressive Neural Networks for Accurate Long-range Forecasting. (arXiv:2204.09640v3 [stat.ML] UPDATED)\nAbstract: Forecasting time series data is a critical area of research with applications spanning from stock prices to early epidemic prediction. While numerous statistical and machine learning methods have been proposed, real-life prediction problems often require hybrid solutions that bridge classical forecasting approaches and modern neural network models. In this study, we introduce the Probabilistic AutoRegressive Neural Networks (PARNN), capable of handling complex time series data exhibiting non-stationarity, nonlinearity, non-seasonality, long-range dependence, and chaotic patterns. PARNN is constructed by improving autoregressive neural networks (ARNN) using autoregressive integrated moving average (ARIMA) feedback error, combining the explainability, scalability, and \"white-box-like\" prediction behavior of both models. Notably, the PARNN model provides uncertainty quantification through prediction intervals, setting it apart from advanced deep learning tools. Through comprehensive compu",
    "path": "papers/22/04/2204.09640.json",
    "total_tokens": 916,
    "translated_title": "准确的长期预测的概率自回归神经网络",
    "translated_abstract": "预测时间序列数据是一个严重的研究领域，应用范围从股票价格到早期传染病预测。虽然已经提出了许多统计和机器学习方法，但实际预测问题通常需要将传统预测方法和现代神经网络模型相结合的混合解决方案。在这项研究中，我们介绍了概率自回归神经网络（PARNN），能够处理表现出非平稳性、非线性、非周期性、长期依赖和混沌模式的复杂时间序列数据。PARNN是通过改进自回归神经网络（ARNN）使用自回归积分移动平均（ARIMA）反馈误差进行构建的，结合了两种模型的可解释性、可扩展性和“白盒子般”的预测行为。值得注意的是，PARNN模型通过预测区间提供不确定性量化，使其与先进的深度学习工具区别开来。通过全面的计算。",
    "tldr": "PARNN是一种概率自回归神经网络模型，能够准确预测具有非平稳性、非线性、非周期性、长期依赖和混沌模式的复杂时间序列数据，并通过预测区间提供不确定性量化。",
    "en_tdlr": "PARNN is a probabilistic autoregressive neural network model capable of accurately forecasting complex time series data with non-stationarity, nonlinearity, non-seasonality, long-range dependence, and chaotic patterns, providing uncertainty quantification through prediction intervals."
}