{
    "title": "CycleSense: Detecting Near Miss Incidents in Bicycle Traffic from Mobile Motion Sensors. (arXiv:2204.10416v2 [cs.LG] UPDATED)",
    "abstract": "In cities worldwide, cars cause health and traffic problems whichcould be partly mitigated through an increased modal share of bicycles. Many people, however, avoid cycling due to a lack of perceived safety. For city planners, addressing this is hard as they lack insights intowhere cyclists feel safe and where they do not. To gain such insights,we have in previous work proposed the crowdsourcing platform SimRa,which allows cyclists to record their rides and report near miss incidentsvia a smartphone app. In this paper, we present CycleSense, a combination of signal pro-cessing and Machine Learning techniques, which partially automatesthe detection of near miss incidents, thus making the reporting of nearmiss incidents easier. Using the SimRa data set, we evaluate CycleSenseby comparing it to a baseline method used by SimRa and show that itsignificantly improves incident detection.",
    "link": "http://arxiv.org/abs/2204.10416",
    "context": "Title: CycleSense: Detecting Near Miss Incidents in Bicycle Traffic from Mobile Motion Sensors. (arXiv:2204.10416v2 [cs.LG] UPDATED)\nAbstract: In cities worldwide, cars cause health and traffic problems whichcould be partly mitigated through an increased modal share of bicycles. Many people, however, avoid cycling due to a lack of perceived safety. For city planners, addressing this is hard as they lack insights intowhere cyclists feel safe and where they do not. To gain such insights,we have in previous work proposed the crowdsourcing platform SimRa,which allows cyclists to record their rides and report near miss incidentsvia a smartphone app. In this paper, we present CycleSense, a combination of signal pro-cessing and Machine Learning techniques, which partially automatesthe detection of near miss incidents, thus making the reporting of nearmiss incidents easier. Using the SimRa data set, we evaluate CycleSenseby comparing it to a baseline method used by SimRa and show that itsignificantly improves incident detection.",
    "path": "papers/22/04/2204.10416.json",
    "total_tokens": 918,
    "translated_title": "CycleSense：利用移动动作传感器检测自行车交通中的擦肩而过事件",
    "translated_abstract": "在全球的城市中，汽车引起了健康和交通问题，增加自行车的使用率可能在一定程度上缓解这些问题。然而，许多人由于缺乏感知安全来避免骑自行车。对于城市规划者来说，解决这个问题很难，因为他们缺乏关于自行车安全感的洞察力。为了获得这样的洞见，我们之前提出了众包平台SimRa，它允许自行车手通过智能手机应用程序记录其骑行并报告擦肩而过事件。在本文中，我们提出了CycleSense，这是一种信号处理和机器学习技术的组合，部分自动化检测擦肩而过事件，从而使擦肩而过事件报告更加容易。使用SimRa数据集，我们通过将其与SimRa使用的基线方法进行比较来评估CycleSense，并表明它显着改善了事件检测。",
    "tldr": "CycleSense是一种利用移动动作传感器检测自行车交通中的擦肩而过事件的技术，可以帮助自行车手更轻松地报告险情。这种技术的使用可以帮助城市规划者更好地了解自行车安全感问题，有望缓解城市交通问题。"
}