{
    "title": "Metaphorical User Simulators for Evaluating Task-oriented Dialogue Systems. (arXiv:2204.00763v5 [cs.CL] UPDATED)",
    "abstract": "Task-oriented dialogue systems (TDSs) are assessed mainly in an offline setting or through human evaluation. The evaluation is often limited to single-turn or is very time-intensive. As an alternative, user simulators that mimic user behavior allow us to consider a broad set of user goals to generate human-like conversations for simulated evaluation. Employing existing user simulators to evaluate TDSs is challenging as user simulators are primarily designed to optimize dialogue policies for TDSs and have limited evaluation capabilities. Moreover, the evaluation of user simulators is an open challenge.  In this work, we propose a metaphorical user simulator for end-to-end TDS evaluation, where we define a simulator to be metaphorical if it simulates user's analogical thinking in interactions with systems. We also propose a tester-based evaluation framework to generate variants, i.e., dialogue systems with different capabilities. Our user simulator constructs a metaphorical user model th",
    "link": "http://arxiv.org/abs/2204.00763",
    "context": "Title: Metaphorical User Simulators for Evaluating Task-oriented Dialogue Systems. (arXiv:2204.00763v5 [cs.CL] UPDATED)\nAbstract: Task-oriented dialogue systems (TDSs) are assessed mainly in an offline setting or through human evaluation. The evaluation is often limited to single-turn or is very time-intensive. As an alternative, user simulators that mimic user behavior allow us to consider a broad set of user goals to generate human-like conversations for simulated evaluation. Employing existing user simulators to evaluate TDSs is challenging as user simulators are primarily designed to optimize dialogue policies for TDSs and have limited evaluation capabilities. Moreover, the evaluation of user simulators is an open challenge.  In this work, we propose a metaphorical user simulator for end-to-end TDS evaluation, where we define a simulator to be metaphorical if it simulates user's analogical thinking in interactions with systems. We also propose a tester-based evaluation framework to generate variants, i.e., dialogue systems with different capabilities. Our user simulator constructs a metaphorical user model th",
    "path": "papers/22/04/2204.00763.json",
    "total_tokens": 902,
    "translated_title": "用于评估任务导向的对话系统的隐喻用户模拟器",
    "translated_abstract": "任务导向的对话系统（TDS）主要在离线环境中或通过人工评估进行评估。评估通常仅限于单轮或非常耗时。作为一个替代方案，模拟用户行为的用户模拟器可以让我们考虑一系列用户目标，以生成类似人类对话的模拟评估。然而，利用现有用户模拟器评估TDS具有挑战性，因为用户模拟器主要设计用于优化TDS的对话策略，并具有有限的评估能力。此外，用户模拟器的评估是一个开放性挑战。在这项工作中，我们提出了一种用于端到端TDS评估的隐喻用户模拟器，其中我们将模拟器定义为隐喻性的，如果它在与系统的交互中模拟用户的类比思维。我们还提出了一个基于测试者的评估框架来生成具有不同能力的对话系统变体。我们的用户模拟器构建了一个隐喻性用户模型。",
    "tldr": "本文提出了一种用于评估任务导向的对话系统的隐喻用户模拟器。该模拟器可以生成类似人类对话的模拟评估，并且提供了一个测试者框架来生成不同能力的对话系统变体。",
    "en_tdlr": "This paper proposes a metaphorical user simulator for evaluating task-oriented dialogue systems. The simulator can generate simulated evaluations that resemble human conversations and provides a tester framework to generate dialogue system variants with different capabilities."
}