{
    "title": "A First Runtime Analysis of the NSGA-II on a Multimodal Problem. (arXiv:2204.13750v5 [cs.NE] UPDATED)",
    "abstract": "Very recently, the first mathematical runtime analyses of the multi-objective evolutionary optimizer NSGA-II have been conducted. We continue this line of research with a first runtime analysis of this algorithm on a benchmark problem consisting of two multimodal objectives. We prove that if the population size $N$ is at least four times the size of the Pareto front, then the NSGA-II with four different ways to select parents and bit-wise mutation optimizes the OneJumpZeroJump benchmark with jump size~$2 \\le k \\le n/4$ in time $O(N n^k)$. When using fast mutation, a recently proposed heavy-tailed mutation operator, this guarantee improves by a factor of $k^{\\Omega(k)}$. Overall, this work shows that the NSGA-II copes with the local optima of the OneJumpZeroJump problem at least as well as the global SEMO algorithm.",
    "link": "http://arxiv.org/abs/2204.13750",
    "context": "Title: A First Runtime Analysis of the NSGA-II on a Multimodal Problem. (arXiv:2204.13750v5 [cs.NE] UPDATED)\nAbstract: Very recently, the first mathematical runtime analyses of the multi-objective evolutionary optimizer NSGA-II have been conducted. We continue this line of research with a first runtime analysis of this algorithm on a benchmark problem consisting of two multimodal objectives. We prove that if the population size $N$ is at least four times the size of the Pareto front, then the NSGA-II with four different ways to select parents and bit-wise mutation optimizes the OneJumpZeroJump benchmark with jump size~$2 \\le k \\le n/4$ in time $O(N n^k)$. When using fast mutation, a recently proposed heavy-tailed mutation operator, this guarantee improves by a factor of $k^{\\Omega(k)}$. Overall, this work shows that the NSGA-II copes with the local optima of the OneJumpZeroJump problem at least as well as the global SEMO algorithm.",
    "path": "papers/22/04/2204.13750.json",
    "total_tokens": 868,
    "translated_title": "NSGA-II在多模式问题上的第一次运行时间分析",
    "translated_abstract": "最近，对多目标进化优化器NSGA-II进行了第一次数学运行时间分析。我们继续这项研究，在一个包含两个多模式目标的基准问题上进行了该算法的第一个运行时间分析。我们证明，如果种群大小N至少是帕累托前沿大小的四倍，则带有四种不同选择父代和位突变的NSGA-II能够在时间复杂度为O(N n^k)内优化OneJumpZeroJump基准问题，其中2≤k≤n/4。当使用快速突变时，最近提出的重尾突变算子可以将这一保证提高至k^Ω(k)倍。总体而言，这项工作表明，NSGA-II至少与全局SEMO算法一样能够处理OneJumpZeroJump问题的局部最优解。",
    "tldr": "本论文对多目标进化优化器NSGA-II在多模式问题上的运行时间进行了第一次分析，证明了当种群大小足够大时，NSGA-II能够在时间复杂度为O(N n^k)内优化OneJumpZeroJump基准问题，且使用快速突变算子可以提高优化效果。"
}