{
    "title": "Domain Adversarial Graph Convolutional Network Based on RSSI and Crowdsensing for Indoor Localization. (arXiv:2204.05184v3 [cs.NI] UPDATED)",
    "abstract": "In recent years, the use of WiFi fingerprints for indoor positioning has grown in popularity, largely due to the widespread availability of WiFi and the proliferation of mobile communication devices. However, many existing methods for constructing fingerprint datasets rely on labor-intensive and time-consuming processes of collecting large amounts of data. Additionally, these methods often focus on ideal laboratory environments, rather than considering the practical challenges of large multi-floor buildings. To address these issues, we present a novel WiDAGCN model that can be trained using a small number of labeled site survey data and large amounts of unlabeled crowdsensed WiFi fingerprints. By constructing heterogeneous graphs based on received signal strength indicators (RSSIs) between waypoints and WiFi access points (APs), our model is able to effectively capture the topological structure of the data. We also incorporate graph convolutional networks (GCNs) to extract graph-level ",
    "link": "http://arxiv.org/abs/2204.05184",
    "context": "Title: Domain Adversarial Graph Convolutional Network Based on RSSI and Crowdsensing for Indoor Localization. (arXiv:2204.05184v3 [cs.NI] UPDATED)\nAbstract: In recent years, the use of WiFi fingerprints for indoor positioning has grown in popularity, largely due to the widespread availability of WiFi and the proliferation of mobile communication devices. However, many existing methods for constructing fingerprint datasets rely on labor-intensive and time-consuming processes of collecting large amounts of data. Additionally, these methods often focus on ideal laboratory environments, rather than considering the practical challenges of large multi-floor buildings. To address these issues, we present a novel WiDAGCN model that can be trained using a small number of labeled site survey data and large amounts of unlabeled crowdsensed WiFi fingerprints. By constructing heterogeneous graphs based on received signal strength indicators (RSSIs) between waypoints and WiFi access points (APs), our model is able to effectively capture the topological structure of the data. We also incorporate graph convolutional networks (GCNs) to extract graph-level ",
    "path": "papers/22/04/2204.05184.json",
    "total_tokens": 1045,
    "translated_title": "基于RSSI和众包感知的域对抗图卷积网络室内定位方法",
    "translated_abstract": "近年来，使用WiFi指纹进行室内定位越来越受欢迎，这主要是由于WiFi广泛可用和移动通信设备的普及。然而，许多现有的指纹数据集构建方法依赖于耗时费力的数据收集过程。此外，这些方法通常关注理想的实验室环境，而忽略了大型多层建筑的实际挑战。为了解决这些问题，我们提出了一种新的WiDAGCN模型，该模型可以使用少量标记的站点调查数据和大量未标记的众包WiFi指纹进行训练。通过基于测向信号强度指示器（RSSI）构建收发点和WiFi接入点（AP）之间的异构图，我们的模型能够有效地捕捉数据的拓扑结构。我们还结合了图卷积网络（GCNs）来提取图层次特征，并使用域对抗性训练来减少站点调查数据和众包数据之间的域差异。实验结果表明，与现有方法相比，我们提出的方法在基准数据集上实现了显著的定位精度改进。",
    "tldr": "本文提出了一种基于RSSI和众包感知的域对抗图卷积网络室内定位方法，可通过少量标记的站点调查数据和大量未标记的众包WiFi指纹进行训练，能够有效地捕捉数据的拓扑结构，并在基准数据集上实现了显著的定位精度改进。"
}