{
    "title": "AutoOpt: A General Framework for Automatically Designing Metaheuristic Optimization Algorithms with Diverse Structures. (arXiv:2204.00998v6 [cs.NE] UPDATED)",
    "abstract": "Metaheuristics are widely recognized gradient-free solvers to hard problems that do not meet the rigorous mathematical assumptions of conventional solvers. The automated design of metaheuristic algorithms provides an attractive path to relieve manual design effort and gain enhanced performance beyond human-made algorithms. However, the specific algorithm prototype and linear algorithm representation in the current automated design pipeline restrict the design within a fixed algorithm structure, which hinders discovering novelties and diversity across the metaheuristic family. To address this challenge, this paper proposes a general framework, AutoOpt, for automatically designing metaheuristic algorithms with diverse structures. AutoOpt contains three innovations: (i) A general algorithm prototype dedicated to covering the metaheuristic family as widely as possible. It promotes high-quality automated design on different problems by fully discovering potentials and novelties across the f",
    "link": "http://arxiv.org/abs/2204.00998",
    "context": "Title: AutoOpt: A General Framework for Automatically Designing Metaheuristic Optimization Algorithms with Diverse Structures. (arXiv:2204.00998v6 [cs.NE] UPDATED)\nAbstract: Metaheuristics are widely recognized gradient-free solvers to hard problems that do not meet the rigorous mathematical assumptions of conventional solvers. The automated design of metaheuristic algorithms provides an attractive path to relieve manual design effort and gain enhanced performance beyond human-made algorithms. However, the specific algorithm prototype and linear algorithm representation in the current automated design pipeline restrict the design within a fixed algorithm structure, which hinders discovering novelties and diversity across the metaheuristic family. To address this challenge, this paper proposes a general framework, AutoOpt, for automatically designing metaheuristic algorithms with diverse structures. AutoOpt contains three innovations: (i) A general algorithm prototype dedicated to covering the metaheuristic family as widely as possible. It promotes high-quality automated design on different problems by fully discovering potentials and novelties across the f",
    "path": "papers/22/04/2204.00998.json",
    "total_tokens": 890,
    "translated_title": "AutoOpt：一个自动设计多样化结构元启发式优化算法的通用框架",
    "translated_abstract": "元启发式算法被广泛认可为解决不满足常规求解器严格数学假设的难题的无梯度求解器。自动设计元启发式算法提供了一条吸引人的路径，可以减轻手工设计的工作量，并获得超越人造算法的增强性能。然而，当前自动设计流水线中具体的算法原型和线性算法表示将设计限制在固定的算法结构内，这阻碍了发现元启发式家族中的新颖性和多样性。为了解决这一挑战，本文提出了一个自动设计多样化结构元启发式算法的通用框架——AutoOpt。AutoOpt包含三个创新点：（1）一个通用的算法原型，专门涵盖了尽可能广泛的元启发式算法家族。它通过完全发掘潜力和新颖性，在不同的问题上促进高质量的自动设计。",
    "tldr": "本文提出了一个通用的框架AutoOpt，用于自动设计具有多样化结构的元启发式算法，通过发布一个通用的算法原型，它可以更好地发掘元启发式算法家族的潜力和新颖性，从而提高设计的质量。",
    "en_tdlr": "This paper proposes a general framework, AutoOpt, for automatically designing metaheuristic algorithms with diverse structures. The framework contains a universal algorithm prototype that promotes high-quality automated design by fully discovering potentials and novelties across the metaheuristic family."
}