{
    "title": "Retrieval Enhanced Data Augmentation for Question Answering on Privacy Policies. (arXiv:2204.08952v3 [cs.CL] UPDATED)",
    "abstract": "Prior studies in privacy policies frame the question answering (QA) task as identifying the most relevant text segment or a list of sentences from a policy document given a user query. Existing labeled datasets are heavily imbalanced (only a few relevant segments), limiting the QA performance in this domain. In this paper, we develop a data augmentation framework based on ensembling retriever models that captures the relevant text segments from unlabeled policy documents and expand the positive examples in the training set. In addition, to improve the diversity and quality of the augmented data, we leverage multiple pre-trained language models (LMs) and cascade them with noise reduction filter models. Using our augmented data on the PrivacyQA benchmark, we elevate the existing baseline by a large margin (10\\% F1) and achieve a new state-of-the-art F1 score of 50\\%. Our ablation studies provide further insights into the effectiveness of our approach.",
    "link": "http://arxiv.org/abs/2204.08952",
    "context": "Title: Retrieval Enhanced Data Augmentation for Question Answering on Privacy Policies. (arXiv:2204.08952v3 [cs.CL] UPDATED)\nAbstract: Prior studies in privacy policies frame the question answering (QA) task as identifying the most relevant text segment or a list of sentences from a policy document given a user query. Existing labeled datasets are heavily imbalanced (only a few relevant segments), limiting the QA performance in this domain. In this paper, we develop a data augmentation framework based on ensembling retriever models that captures the relevant text segments from unlabeled policy documents and expand the positive examples in the training set. In addition, to improve the diversity and quality of the augmented data, we leverage multiple pre-trained language models (LMs) and cascade them with noise reduction filter models. Using our augmented data on the PrivacyQA benchmark, we elevate the existing baseline by a large margin (10\\% F1) and achieve a new state-of-the-art F1 score of 50\\%. Our ablation studies provide further insights into the effectiveness of our approach.",
    "path": "papers/22/04/2204.08952.json",
    "total_tokens": 1015,
    "translated_title": "面向隐私政策的问答检索增强数据增强",
    "translated_abstract": "在隐私政策领域，先前的研究将问答任务框架化为根据用户查询从政策文件中识别最相关的文本段落或句子列表。现有的标记数据集极度不平衡（只有少数相关段落），限制了该领域中QA的性能。本文提出一种基于集成检索模型的数据增强框架，从未标记的政策文件中捕获相关的文本段并扩展训练集中的正例。此外，为了提高增强数据的多样性和质量，我们利用多个预训练语言模型（LMs）并将它们级联噪声减少滤波模型。在PrivacyQA基准测试中使用我们的增强数据，我们将现有基线提高了很大程度（10\\% F1），并取得了50\\%的新的最优F1得分。我们的消融研究进一步揭示了我们方法的有效性。",
    "tldr": "本文提出了一种集成检索模型的数据增强框架，并应用于隐私政策问答中，成功地提高了性能。该方法捕获政策文档中的相关文本段并利用多个预训练语言模型，通过对增强数据进行级联和噪声减少滤波来提高数据多样性和质量，获得了该领域的新最优F1分数50\\%。",
    "en_tdlr": "This paper proposes a data augmentation framework based on ensembling retriever models, which captures the relevant text segments from unlabeled policy documents and expands the positive examples in the training set for question answering (QA) on privacy policies. The improved diversity and quality of augmented data is achieved by leveraging multiple pre-trained language models and noise reduction filter models. The method significantly enhances the existing baseline (10\\% F1) and achieves a new state-of-the-art F1 score of 50\\% on PrivacyQA benchmark. Ablation studies are conducted to further demonstrate the effectiveness of this approach."
}