{
    "title": "Towards Power-Efficient Design of Myoelectric Controller based on Evolutionary Computation. (arXiv:2204.02179v2 [cs.NE] UPDATED)",
    "abstract": "Myoelectric pattern recognition is one of the important aspects in the design of the control strategy for various applications including upper-limb prostheses and bio-robotic hand movement systems. The current work has proposed an approach to design an energy-efficient EMG-based controller by considering a supervised learning framework using a kernelized SVM classifier for decoding the information of surface electromyography (sEMG) signals to infer the underlying muscle movements. In order to achieve the optimized performance of the EMG-based controller, our main strategy of classifier design is to reduce the false movements of the overall system (when the EMG-based controller is at the `Rest' position). To this end, unlike the traditional single training objective of soft margin kernelized SVM, we have formulated the training algorithm of the proposed supervised learning system as a general constrained multi-objective optimization problem. An elitist multi-objective evolutionary algor",
    "link": "http://arxiv.org/abs/2204.02179",
    "context": "Title: Towards Power-Efficient Design of Myoelectric Controller based on Evolutionary Computation. (arXiv:2204.02179v2 [cs.NE] UPDATED)\nAbstract: Myoelectric pattern recognition is one of the important aspects in the design of the control strategy for various applications including upper-limb prostheses and bio-robotic hand movement systems. The current work has proposed an approach to design an energy-efficient EMG-based controller by considering a supervised learning framework using a kernelized SVM classifier for decoding the information of surface electromyography (sEMG) signals to infer the underlying muscle movements. In order to achieve the optimized performance of the EMG-based controller, our main strategy of classifier design is to reduce the false movements of the overall system (when the EMG-based controller is at the `Rest' position). To this end, unlike the traditional single training objective of soft margin kernelized SVM, we have formulated the training algorithm of the proposed supervised learning system as a general constrained multi-objective optimization problem. An elitist multi-objective evolutionary algor",
    "path": "papers/22/04/2204.02179.json",
    "total_tokens": 1047,
    "translated_title": "基于进化计算的肌电控制器的功耗设计",
    "translated_abstract": "肌电模式识别是各种应用程序（包括上肢假肢和生物机器人手部运动系统）的控制策略设计中的重要方面。本文提出了一种方法，通过考虑使用核化SVM分类器对表面肌电图（sEMG）信号的信息进行解码来推断潜在的肌肉运动，设计一种能量高效的基于EMG的控制器。为了实现EMG控制器的优化性能，我们的主要分类器设计策略是减少整个系统误动作（当EMG控制器处于“休息”位置时）。为此，与传统的软间隔核化SVM单个训练目标不同，我们将所提出的监督学习系统的训练算法制定为一般约束多目标优化问题。采用精英多目标进化算法NSGA-II来找到受限制的多目标优化问题的帕累托最优解，并根据支持向量的数量和分类准确率之间的权衡选择最终分类器。在公开可用的sEMG数据集上的实验结果表明，所提出的方法在功率效率和分类精度方面优于现有技术的方法。",
    "tldr": "本文提出了一种基于核化SVM分类器的监督学习方法，通过约束的多目标优化问题实现肌电信号的高效控制，实验结果表明该方法在功率和分类准确性方面优于现有技术。"
}