{
    "title": "Multi-Label Clinical Time-Series Generation via Conditional GAN. (arXiv:2204.04797v2 [cs.LG] UPDATED)",
    "abstract": "In recent years, deep learning has been successfully adopted in a wide range of applications related to electronic health records (EHRs) such as representation learning and clinical event prediction. However, due to privacy constraints, limited access to EHR becomes a bottleneck for deep learning research. To mitigate these concerns, generative adversarial networks (GANs) have been successfully used for generating EHR data. However, there are still challenges in high-quality EHR generation, including generating time-series EHR data and imbalanced uncommon diseases. In this work, we propose a Multi-label Time-series GAN (MTGAN) to generate EHR and simultaneously improve the quality of uncommon disease generation. The generator of MTGAN uses a gated recurrent unit (GRU) with a smooth conditional matrix to generate sequences and uncommon diseases. The critic gives scores using Wasserstein distance to recognize real samples from synthetic samples by considering both data and temporal featu",
    "link": "http://arxiv.org/abs/2204.04797",
    "context": "Title: Multi-Label Clinical Time-Series Generation via Conditional GAN. (arXiv:2204.04797v2 [cs.LG] UPDATED)\nAbstract: In recent years, deep learning has been successfully adopted in a wide range of applications related to electronic health records (EHRs) such as representation learning and clinical event prediction. However, due to privacy constraints, limited access to EHR becomes a bottleneck for deep learning research. To mitigate these concerns, generative adversarial networks (GANs) have been successfully used for generating EHR data. However, there are still challenges in high-quality EHR generation, including generating time-series EHR data and imbalanced uncommon diseases. In this work, we propose a Multi-label Time-series GAN (MTGAN) to generate EHR and simultaneously improve the quality of uncommon disease generation. The generator of MTGAN uses a gated recurrent unit (GRU) with a smooth conditional matrix to generate sequences and uncommon diseases. The critic gives scores using Wasserstein distance to recognize real samples from synthetic samples by considering both data and temporal featu",
    "path": "papers/22/04/2204.04797.json",
    "total_tokens": 952,
    "translated_title": "通过条件GAN生成多标签临床时间序列",
    "translated_abstract": "近年来，深度学习在与电子健康记录（EHR）相关的各种应用中取得了成功，如表示学习和临床事件预测。然而，由于隐私约束，对EHR的有限访问成为深度学习研究的瓶颈。为了缓解这些问题，生成对抗网络（GANs）已被成功用于生成EHR数据。然而，高质量EHR生成仍面临挑战，包括生成时间序列EHR数据和不平衡的罕见疾病。在这项工作中，我们提出了一个多标签时间序列GAN（MTGAN），用于生成EHR并同时提高罕见疾病生成的质量。MTGAN的生成器使用带有平滑条件矩阵的门控循环单元（GRU）生成序列和罕见疾病。评论家使用Wasserstein距离给出得分，通过考虑数据和时间特征来识别真实样本和合成样本。",
    "tldr": "本论文提出了一种通过条件GAN生成多标签临床时间序列的方法，用于解决EHR数据生成中的挑战，包括时间序列数据和不平衡的罕见疾病。生成器使用门控循环单元和平滑条件矩阵生成序列和罕见疾病，评论家使用Wasserstein距离评分来区分真实样本和合成样本。",
    "en_tdlr": "This paper proposes a method for generating multi-label clinical time-series using conditional GAN, addressing challenges in EHR data generation including time-series data and imbalanced uncommon diseases. The generator utilizes gated recurrent units and a smooth conditional matrix to generate sequences and uncommon diseases, while the critic distinguishes real and synthetic samples using Wasserstein distance."
}