{
    "title": "Random Manifold Sampling and Joint Sparse Regularization for Multi-label Feature Selection. (arXiv:2204.06445v3 [stat.ML] UPDATED)",
    "abstract": "Multi-label learning is usually used to mine the correlation between features and labels, and feature selection can retain as much information as possible through a small number of features. $\\ell_{2,1}$ regularization method can get sparse coefficient matrix, but it can not solve multicollinearity problem effectively. The model proposed in this paper can obtain the most relevant few features by solving the joint constrained optimization problems of $\\ell_{2,1}$ and $\\ell_{F}$ regularization.In manifold regularization, we implement random walk strategy based on joint information matrix, and get a highly robust neighborhood graph.In addition, we given the algorithm for solving the model and proved its convergence.Comparative experiments on real-world data sets show that the proposed method outperforms other methods.",
    "link": "http://arxiv.org/abs/2204.06445",
    "context": "Title: Random Manifold Sampling and Joint Sparse Regularization for Multi-label Feature Selection. (arXiv:2204.06445v3 [stat.ML] UPDATED)\nAbstract: Multi-label learning is usually used to mine the correlation between features and labels, and feature selection can retain as much information as possible through a small number of features. $\\ell_{2,1}$ regularization method can get sparse coefficient matrix, but it can not solve multicollinearity problem effectively. The model proposed in this paper can obtain the most relevant few features by solving the joint constrained optimization problems of $\\ell_{2,1}$ and $\\ell_{F}$ regularization.In manifold regularization, we implement random walk strategy based on joint information matrix, and get a highly robust neighborhood graph.In addition, we given the algorithm for solving the model and proved its convergence.Comparative experiments on real-world data sets show that the proposed method outperforms other methods.",
    "path": "papers/22/04/2204.06445.json",
    "total_tokens": 858,
    "translated_title": "随机流形采样和联合稀疏正则化的多标签特征选择",
    "translated_abstract": "多标签学习通常用于挖掘特征和标签之间的相关性，特征选择可以通过少量特征保留尽可能多的信息。 $\\ell_{2,1}$ 正则化可以获得稀疏系数矩阵，但不能有效地解决多重共线性问题。本文提出的模型通过解决 $\\ell_{2,1}$ 和 $\\ell_{F}$ 正则化的联合约束优化问题来获取最相关的几个特征。在流形正则化中，我们根据联合信息矩阵实现了基于随机游走策略的高度稳健的邻域图。此外，我们还给出了解决该模型的算法并证明了其收敛性。在真实数据集上的比较实验表明，所提出的方法优于其他方法。",
    "tldr": "本文提出了一种基于联合约束优化问题的 $\\ell_{2,1}$ 和 $\\ell_{F}$ 正则化方法来获得最相关的几个特征，并在流形正则化中实现了基于随机游走策略的高度稳健的邻域图。该方法在真实数据集上的比较实验中表现优异。"
}