{
    "title": "Asymptotic Theory for Unit Root Moderate Deviations in Quantile Autoregressions and Predictive Regressions. (arXiv:2204.02073v2 [econ.EM] UPDATED)",
    "abstract": "We establish the asymptotic theory in quantile autoregression when the model parameter is specified with respect to moderate deviations from the unit boundary of the form (1 + c / k) with a convergence sequence that diverges at a rate slower than the sample size n. Then, extending the framework proposed by Phillips and Magdalinos (2007), we consider the limit theory for the near-stationary and the near-explosive cases when the model is estimated with a conditional quantile specification function and model parameters are quantile-dependent. Additionally, a Bahadur-type representation and limiting distributions based on the M-estimators of the model parameters are derived. Specifically, we show that the serial correlation coefficient converges in distribution to a ratio of two independent random variables. Monte Carlo simulations illustrate the finite-sample performance of the estimation procedure under investigation.",
    "link": "http://arxiv.org/abs/2204.02073",
    "context": "Title: Asymptotic Theory for Unit Root Moderate Deviations in Quantile Autoregressions and Predictive Regressions. (arXiv:2204.02073v2 [econ.EM] UPDATED)\nAbstract: We establish the asymptotic theory in quantile autoregression when the model parameter is specified with respect to moderate deviations from the unit boundary of the form (1 + c / k) with a convergence sequence that diverges at a rate slower than the sample size n. Then, extending the framework proposed by Phillips and Magdalinos (2007), we consider the limit theory for the near-stationary and the near-explosive cases when the model is estimated with a conditional quantile specification function and model parameters are quantile-dependent. Additionally, a Bahadur-type representation and limiting distributions based on the M-estimators of the model parameters are derived. Specifically, we show that the serial correlation coefficient converges in distribution to a ratio of two independent random variables. Monte Carlo simulations illustrate the finite-sample performance of the estimation procedure under investigation.",
    "path": "papers/22/04/2204.02073.json",
    "total_tokens": 884,
    "translated_title": "单位根中度偏差的分位数自回归和预测回归的渐近理论",
    "translated_abstract": "我们建立了分位数自回归的渐近理论，当模型参数相对于形式为（1+c/k）的单位边界的中度偏差指定时，收敛序列的发散速度比样本量n慢。然后，扩展了Phillips和Magdalinos（2007）提出的框架，我们考虑了当模型用条件分位数规范函数估计时，近稳态和近爆炸情况的极限理论，并推导了基于模型参数的M-估计的Bahadur型表示和极限分布。具体而言，我们展示了串行相关系数收敛于两个独立随机变量的比例的分布。蒙特卡洛模拟说明了所研究估计过程的有限样本性能。",
    "tldr": "该论文研究了分位数自回归和预测回归中，当模型参数相对于单位边界的中度偏差指定时，渐近理论和极限分布。具体推导了基于M-估计的模型参数的Bahadur型表示和极限分布，并展示了有限样本性能。",
    "en_tdlr": "This paper investigates the asymptotic theory and limit distributions in quantile autoregressions and predictive regressions, when the model parameter is specified with respect to moderate deviations from the unit boundary. The paper derives a Bahadur-type representation and limiting distributions based on M-estimators of the model parameters, and demonstrates the finite-sample performance through Monte Carlo simulations."
}