{
    "title": "A Part-of-Speech Tagger for Yiddish. (arXiv:2204.01175v2 [cs.CL] UPDATED)",
    "abstract": "We describe the construction and evaluation of a part-of-speech tagger for Yiddish. This is the first step in a larger project of automatically assigning part-of-speech tags and syntactic structure to Yiddish text for purposes of linguistic research. We combine two resources for the current work - an 80K-word subset of the Penn Parsed Corpus of Historical Yiddish (PPCHY) and 650 million words of OCR'd Yiddish text from the Yiddish Book Center (YBC). Yiddish orthography in the YBC corpus has many spelling inconsistencies, and we present some evidence that even simple non-contextualized embeddings trained on YBC are able to capture the relationships among spelling variants without the need to first \"standardize\" the corpus. We also use YBC for continued pretraining of contexualized embeddings, which are then integrated into a tagger model trained and evaluated on the PPCHY. We evaluate the tagger performance on a 10-fold cross-validation split, showing that the use of the YBC text for th",
    "link": "http://arxiv.org/abs/2204.01175",
    "context": "Title: A Part-of-Speech Tagger for Yiddish. (arXiv:2204.01175v2 [cs.CL] UPDATED)\nAbstract: We describe the construction and evaluation of a part-of-speech tagger for Yiddish. This is the first step in a larger project of automatically assigning part-of-speech tags and syntactic structure to Yiddish text for purposes of linguistic research. We combine two resources for the current work - an 80K-word subset of the Penn Parsed Corpus of Historical Yiddish (PPCHY) and 650 million words of OCR'd Yiddish text from the Yiddish Book Center (YBC). Yiddish orthography in the YBC corpus has many spelling inconsistencies, and we present some evidence that even simple non-contextualized embeddings trained on YBC are able to capture the relationships among spelling variants without the need to first \"standardize\" the corpus. We also use YBC for continued pretraining of contexualized embeddings, which are then integrated into a tagger model trained and evaluated on the PPCHY. We evaluate the tagger performance on a 10-fold cross-validation split, showing that the use of the YBC text for th",
    "path": "papers/22/04/2204.01175.json",
    "total_tokens": 966,
    "translated_title": "一种用于意第绪语的词性标注器",
    "translated_abstract": "我们描述了一种用于意第绪语的词性标注器的构建和评估。这是一个更大项目的第一步，旨在自动分配意第绪语文本的词性标签和句法结构，以供语言学研究之用。我们在这项工作中使用了两个资源 - 历史意第绪语Penn解析语料库（PPCHY）的一个80K字子集和来自意第绪书籍中心（YBC）的650百万字的OCR意第绪语文本。YBC语料库中的意第绪语正字法存在许多拼写不一致之处，我们提供一些证据表明，即使在YBC上训练的简单非上下文化的嵌入也能够捕捉到拼写变体之间的关系，而无需先“标准化”语料库。我们还使用YBC进行上下文化嵌入的持续预训练，然后将其整合到在PPCHY上训练和评估的标注器模型中。我们通过10折交叉验证分析了标注器的性能，展示了利用YBC文本的效果。",
    "tldr": "这项研究描述了一种用于意第绪语的词性标注器的构建和评估。通过结合两个资源，即历史意第绪语Penn解析语料库和OCR意第绪语文本，研究人员展示了在无需先“标准化”语料库的情况下，简单的非上下文化嵌入也能够捕捉到拼写变体之间的关系，并通过交叉验证展示了标注器的性能。"
}