{
    "title": "Hyperbolic Hierarchical Knowledge Graph Embeddings for Link Prediction in Low Dimensions",
    "abstract": "arXiv:2204.13704v2 Announce Type: replace-cross  Abstract: Knowledge graph embeddings (KGE) have been validated as powerful methods for inferring missing links in knowledge graphs (KGs) that they typically map entities into Euclidean space and treat relations as transformations of entities. Recently, some Euclidean KGE methods have been enhanced to model semantic hierarchies commonly found in KGs, improving the performance of link prediction. To embed hierarchical data, hyperbolic space has emerged as a promising alternative to traditional Euclidean space, offering high fidelity and lower memory consumption. Unlike Euclidean, hyperbolic space provides countless curvatures to choose from. However, it is difficult for existing hyperbolic KGE methods to obtain the optimal curvature settings manually, thereby limiting their ability to effectively model semantic hierarchies. To address this limitation, we propose a novel KGE model called $\\textbf{Hyp}$erbolic $\\textbf{H}$ierarchical $\\textb",
    "link": "https://arxiv.org/abs/2204.13704",
    "context": "Title: Hyperbolic Hierarchical Knowledge Graph Embeddings for Link Prediction in Low Dimensions\nAbstract: arXiv:2204.13704v2 Announce Type: replace-cross  Abstract: Knowledge graph embeddings (KGE) have been validated as powerful methods for inferring missing links in knowledge graphs (KGs) that they typically map entities into Euclidean space and treat relations as transformations of entities. Recently, some Euclidean KGE methods have been enhanced to model semantic hierarchies commonly found in KGs, improving the performance of link prediction. To embed hierarchical data, hyperbolic space has emerged as a promising alternative to traditional Euclidean space, offering high fidelity and lower memory consumption. Unlike Euclidean, hyperbolic space provides countless curvatures to choose from. However, it is difficult for existing hyperbolic KGE methods to obtain the optimal curvature settings manually, thereby limiting their ability to effectively model semantic hierarchies. To address this limitation, we propose a novel KGE model called $\\textbf{Hyp}$erbolic $\\textbf{H}$ierarchical $\\textb",
    "path": "papers/22/04/2204.13704.json",
    "total_tokens": 864,
    "translated_title": "超几何分层知识图嵌入的低维链接预测",
    "translated_abstract": "知识图嵌入（KGE）已被证实是推断知识图（KGs）中缺失链接的强大方法，它们通常将实体映射到欧几里得空间，并将关系视为实体的转换。 最近，一些欧几里得KGE方法已经增强，以建模KGs中常见的语义层次结构，提高链接预测性能。 为了嵌入分层数据，超几何空间已经成为传统欧几里得空间的一种有前途的替代方法，具有高度保真度和较低的内存消耗。 与欧几里得空间不同，超几何空间提供了无数可供选择的曲率。 但是，现有的超几何KGE方法难以手动获取最佳曲率设置，从而限制了它们有效地对语义层次结构进行建模的能力。 为解决这一限制，我们提出了一种名为$\\textbf{Hyp}$erbolic $\\textbf{H}$ierarchical $\\textb",
    "tldr": "提出了一种新颖的KGE模型，名为HypH，利用超几何空间嵌入分层数据，以提高知识图中链接预测的性能",
    "en_tdlr": "Propose a novel KGE model, named HypH, utilizing hyperbolic space to embed hierarchical data for improved link prediction in knowledge graphs"
}