{
    "title": "On Parametric Optimal Execution and Machine Learning Surrogates. (arXiv:2204.08581v3 [q-fin.TR] UPDATED)",
    "abstract": "We investigate optimal order execution problems in discrete time with instantaneous price impact and stochastic resilience. First, in the setting of linear transient price impact we derive a closed-form recursion for the optimal strategy, extending the deterministic results from Obizhaeva and Wang (J Financial Markets, 2013). Second, we develop a numerical algorithm based on dynamic programming and deep learning for the case of nonlinear transient price impact as proposed by Bouchaud et al. (Quant. Finance, 2004). Specifically, we utilize an actor-critic framework that constructs two neural-network (NN) surrogates for the value function and the feedback control. The flexible scalability of NN functional approximators enables parametric learning, i.e., incorporating several model or market parameters as part of the input space. Precise calibration of price impact, resilience, etc., is known to be extremely challenging and hence it is critical to understand sensitivity of the execution p",
    "link": "http://arxiv.org/abs/2204.08581",
    "context": "Title: On Parametric Optimal Execution and Machine Learning Surrogates. (arXiv:2204.08581v3 [q-fin.TR] UPDATED)\nAbstract: We investigate optimal order execution problems in discrete time with instantaneous price impact and stochastic resilience. First, in the setting of linear transient price impact we derive a closed-form recursion for the optimal strategy, extending the deterministic results from Obizhaeva and Wang (J Financial Markets, 2013). Second, we develop a numerical algorithm based on dynamic programming and deep learning for the case of nonlinear transient price impact as proposed by Bouchaud et al. (Quant. Finance, 2004). Specifically, we utilize an actor-critic framework that constructs two neural-network (NN) surrogates for the value function and the feedback control. The flexible scalability of NN functional approximators enables parametric learning, i.e., incorporating several model or market parameters as part of the input space. Precise calibration of price impact, resilience, etc., is known to be extremely challenging and hence it is critical to understand sensitivity of the execution p",
    "path": "papers/22/04/2204.08581.json",
    "total_tokens": 1030,
    "translated_title": "关于参数化最优执行和机器学习替代品的研究",
    "translated_abstract": "我们研究了具有瞬时价格影响和随机弹性的离散时间最优订单执行问题。首先，在线性瞬时价格影响的情况下，我们推导出最优策略的闭式递归公式，扩展了Obizhaeva和Wang（2013年，《金融市场杂志》）的确定性结果。其次，我们基于动态规划和深度学习开发了一个数值算法，用于处理Bouchaud等人（2004年，《量化金融》）提出的非线性瞬时价格影响的情况。具体而言，我们利用了一个演员-评论家框架，构建了两个神经网络（NN）的替代品，用于价值函数和反馈控制。NN功能逼近器的灵活可伸缩性使得参数化学习成为可能，即将几个模型或市场参数作为输入空间的一部分。精确校准价格影响、弹性等是极具挑战性的，因此了解执行策略对这些参数的敏感度至关重要。",
    "tldr": "本论文研究了离散时间中具有瞬时价格影响和随机弹性的最优订单执行问题。首先，我们扩展了线性瞬时价格影响情况下的最优策略，然后开发了一个基于动态规划和深度学习的数值算法来处理非线性瞬时价格影响情况。我们的方法利用神经网络替代品在参数化学习中具有灵活可伸缩性，对于精确校准价格影响和弹性等参数非常重要。"
}