{
    "title": "A Hierarchical Block Distance Model for Ultra Low-Dimensional Graph Representations. (arXiv:2204.05885v2 [cs.SI] UPDATED)",
    "abstract": "Graph Representation Learning (GRL) has become central for characterizing structures of complex networks and performing tasks such as link prediction, node classification, network reconstruction, and community detection. Whereas numerous generative GRL models have been proposed, many approaches have prohibitive computational requirements hampering large-scale network analysis, fewer are able to explicitly account for structure emerging at multiple scales, and only a few explicitly respect important network properties such as homophily and transitivity. This paper proposes a novel scalable graph representation learning method named the Hierarchical Block Distance Model (HBDM). The HBDM imposes a multiscale block structure akin to stochastic block modeling (SBM) and accounts for homophily and transitivity by accurately approximating the latent distance model (LDM) throughout the inferred hierarchy. The HBDM naturally accommodates unipartite, directed, and bipartite networks whereas the h",
    "link": "http://arxiv.org/abs/2204.05885",
    "context": "Title: A Hierarchical Block Distance Model for Ultra Low-Dimensional Graph Representations. (arXiv:2204.05885v2 [cs.SI] UPDATED)\nAbstract: Graph Representation Learning (GRL) has become central for characterizing structures of complex networks and performing tasks such as link prediction, node classification, network reconstruction, and community detection. Whereas numerous generative GRL models have been proposed, many approaches have prohibitive computational requirements hampering large-scale network analysis, fewer are able to explicitly account for structure emerging at multiple scales, and only a few explicitly respect important network properties such as homophily and transitivity. This paper proposes a novel scalable graph representation learning method named the Hierarchical Block Distance Model (HBDM). The HBDM imposes a multiscale block structure akin to stochastic block modeling (SBM) and accounts for homophily and transitivity by accurately approximating the latent distance model (LDM) throughout the inferred hierarchy. The HBDM naturally accommodates unipartite, directed, and bipartite networks whereas the h",
    "path": "papers/22/04/2204.05885.json",
    "total_tokens": 866,
    "translated_title": "通过层次分块距离模型进行超低维图表示",
    "translated_abstract": "图表示学习已经成为表征复杂网络结构和进行链接预测、节点分类、网络重构和社区检测等任务的核心。虽然已经提出了很多生成式图表示学习模型，但许多方法由于计算要求过高而限制了大规模网络分析，很少能够明确考虑多尺度结构的出现，并且只有很少一部分明确考虑到重要的网络属性，如同质性和传递性。本文提出了一种新的可扩展的图表示学习方法，称为层次分块距离模型（HBDM）。HBDM 强制实施了一种类似于随机分块建模（SBM）的多尺度分块结构，并通过准确逼近潜在距离模型（LDM）在推理的分层中考虑同质性和传递性。HBDM 自然地适用于单分区、有向和双分区网络。",
    "tldr": "本文提出了一种层次分块距离模型（HBDM）用于图表示学习，可以处理大规模网络分析，考虑多尺度结构并且明确考虑到网络的同质性和传递性。",
    "en_tdlr": "This paper proposes a Hierarchical Block Distance Model (HBDM) for graph representation learning, which can handle large-scale network analysis, consider multiple-scale structures, and explicitly take into account the homophily and transitivity of the network."
}