{
    "title": "Investigating Temporal Convolutional Neural Networks for Satellite Image Time Series Classification: A survey. (arXiv:2204.08461v2 [cs.CV] UPDATED)",
    "abstract": "Satellite Image Time Series (SITS) of the Earth's surface provide detailed land cover maps, with their quality in the spatial and temporal dimensions consistently improving. These image time series are integral for developing systems that aim to produce accurate, up-to-date land cover maps of the Earth's surface. Applications are wide-ranging, with notable examples including ecosystem mapping, vegetation process monitoring and anthropogenic land-use change tracking. Recently proposed methods for SITS classification have demonstrated respectable merit, but these methods tend to lack native mechanisms that exploit the temporal dimension of the data; commonly resulting in extensive data pre-processing contributing to prohibitively long training times. To overcome these shortcomings, Temporal CNNs have recently been employed for SITS classification tasks with encouraging results. This paper seeks to survey this method against a plethora of other contemporary methods for SITS classification",
    "link": "http://arxiv.org/abs/2204.08461",
    "context": "Title: Investigating Temporal Convolutional Neural Networks for Satellite Image Time Series Classification: A survey. (arXiv:2204.08461v2 [cs.CV] UPDATED)\nAbstract: Satellite Image Time Series (SITS) of the Earth's surface provide detailed land cover maps, with their quality in the spatial and temporal dimensions consistently improving. These image time series are integral for developing systems that aim to produce accurate, up-to-date land cover maps of the Earth's surface. Applications are wide-ranging, with notable examples including ecosystem mapping, vegetation process monitoring and anthropogenic land-use change tracking. Recently proposed methods for SITS classification have demonstrated respectable merit, but these methods tend to lack native mechanisms that exploit the temporal dimension of the data; commonly resulting in extensive data pre-processing contributing to prohibitively long training times. To overcome these shortcomings, Temporal CNNs have recently been employed for SITS classification tasks with encouraging results. This paper seeks to survey this method against a plethora of other contemporary methods for SITS classification",
    "path": "papers/22/04/2204.08461.json",
    "total_tokens": 829,
    "translated_title": "探索时间卷积神经网络在卫星图像时序分类中的应用：一项调查研究",
    "translated_abstract": "地球表面的遥感时序图像提供了详细的地表覆盖地图，其在时空维度上的质量持续提高，对于开发旨在产生准确、实时地表覆盖地图的系统至关重要。这些图像时序在生态系统制图、植被过程监测和人类土地利用变化跟踪等广泛应用中具有重要作用。最近提出了卫星图像时序分类的一些方法，取得了不错的效果，但这些方法往往缺乏利用数据时间维度的本地机制；常常导致大量数据预处理和过长的训练时间。为了克服这些不足，最近开始在卫星图像时序分类中应用了时序卷积神经网络，并取得了令人鼓舞的结果。本文旨在对这一方法与其他当代时序分类方法进行比较调查。",
    "tldr": "本文调查研究探讨了将时间卷积神经网络应用于卫星图像时序分类的方法，相比其他现代方法具有更好的表现。",
    "en_tdlr": "This paper surveys the application of temporal convolutional neural networks for satellite image time series classification, which has demonstrated better performance compared to other contemporary methods."
}