{
    "title": "TeleGraph: A Benchmark Dataset for Hierarchical Link Prediction. (arXiv:2204.07703v2 [cs.SI] UPDATED)",
    "abstract": "Link prediction is a key problem for network-structured data, attracting considerable research efforts owing to its diverse applications. The current link prediction methods focus on general networks and are overly dependent on either the closed triangular structure of networks or node attributes. Their performance on sparse or highly hierarchical networks has not been well studied. On the other hand, the available tree-like benchmark datasets are either simulated, with limited node information, or small in scale. To bridge this gap, we present a new benchmark dataset TeleGraph, a highly sparse and hierarchical telecommunication network associated with rich node attributes, for assessing and fostering the link inference techniques. Our empirical results suggest that most of the algorithms fail to produce a satisfactory performance on a nearly tree-like dataset, which calls for special attention when designing or deploying the link prediction algorithm in practice.",
    "link": "http://arxiv.org/abs/2204.07703",
    "context": "Title: TeleGraph: A Benchmark Dataset for Hierarchical Link Prediction. (arXiv:2204.07703v2 [cs.SI] UPDATED)\nAbstract: Link prediction is a key problem for network-structured data, attracting considerable research efforts owing to its diverse applications. The current link prediction methods focus on general networks and are overly dependent on either the closed triangular structure of networks or node attributes. Their performance on sparse or highly hierarchical networks has not been well studied. On the other hand, the available tree-like benchmark datasets are either simulated, with limited node information, or small in scale. To bridge this gap, we present a new benchmark dataset TeleGraph, a highly sparse and hierarchical telecommunication network associated with rich node attributes, for assessing and fostering the link inference techniques. Our empirical results suggest that most of the algorithms fail to produce a satisfactory performance on a nearly tree-like dataset, which calls for special attention when designing or deploying the link prediction algorithm in practice.",
    "path": "papers/22/04/2204.07703.json",
    "total_tokens": 905,
    "translated_title": "TeleGraph: 用于层次链接预测的基准数据集",
    "translated_abstract": "链接预测是网络结构化数据中的一个关键问题，由于其各种应用而吸引了大量的研究工作。目前的链接预测方法针对一般网络，并且过度依赖于网络的封闭三角形结构或节点属性。它们在稀疏或高度分层的网络上的性能尚未得到很好地研究。另一方面，现有的类似树状的基准数据集要么是模拟的，节点信息有限，要么规模较小。为了弥补这一差距，我们提出了一个新的基准数据集TeleGraph，这是一个高度稀疏且层次结构的电信网络，关联着丰富的节点属性，用于评估和促进链接推断技术。我们的实证结果表明，大多数算法在近乎树状的数据集上无法产生令人满意的性能，在实践中设计或部署链接预测算法时需要特别注意。",
    "tldr": "本研究提出了一个新的基准数据集TeleGraph，用于评估和促进链接推断技术。研究结果表明，在近乎树状的网络上，现有的链接预测算法大多数无法产生满意的性能，这对实践中的链接预测算法设计和部署提出了特殊要求。",
    "en_tdlr": "This study introduces a new benchmark dataset, TeleGraph, for evaluating and promoting link inference techniques. The results indicate that existing link prediction algorithms fail to perform satisfactorily on nearly tree-like networks, emphasizing the need for special attention in designing and deploying link prediction algorithms in practice."
}