{
    "title": "ASR data augmentation in low-resource settings using cross-lingual multi-speaker TTS and cross-lingual voice conversion. (arXiv:2204.00618v5 [eess.AS] UPDATED)",
    "abstract": "We explore cross-lingual multi-speaker speech synthesis and cross-lingual voice conversion applied to data augmentation for automatic speech recognition (ASR) systems in low/medium-resource scenarios. Through extensive experiments, we show that our approach permits the application of speech synthesis and voice conversion to improve ASR systems using only one target-language speaker during model training. We also managed to close the gap between ASR models trained with synthesized versus human speech compared to other works that use many speakers. Finally, we show that it is possible to obtain promising ASR training results with our data augmentation method using only a single real speaker in a target language.",
    "link": "http://arxiv.org/abs/2204.00618",
    "context": "Title: ASR data augmentation in low-resource settings using cross-lingual multi-speaker TTS and cross-lingual voice conversion. (arXiv:2204.00618v5 [eess.AS] UPDATED)\nAbstract: We explore cross-lingual multi-speaker speech synthesis and cross-lingual voice conversion applied to data augmentation for automatic speech recognition (ASR) systems in low/medium-resource scenarios. Through extensive experiments, we show that our approach permits the application of speech synthesis and voice conversion to improve ASR systems using only one target-language speaker during model training. We also managed to close the gap between ASR models trained with synthesized versus human speech compared to other works that use many speakers. Finally, we show that it is possible to obtain promising ASR training results with our data augmentation method using only a single real speaker in a target language.",
    "path": "papers/22/04/2204.00618.json",
    "total_tokens": 847,
    "translated_title": "低资源情况下使用跨语言多说话人TTS和跨语言语音转换进行ASR数据增广",
    "translated_abstract": "我们研究了跨语言多说话人语音合成和跨语言语音转换在低/中资源情境下自动语音识别（ASR）系统数据增广的应用。通过大量实验，我们展示了只使用一个目标语言说话人在模型训练过程中应用语音合成和语音转换可以改善ASR系统。我们还展示了相比使用多说话人的人工和合成语音训练ASR模型间的差距得以缩小。最后，我们展示了只使用目标语言的单一真实说话人的数据增广方法可以获得有希望的ASR训练结果。",
    "tldr": "本文探索了一种在低资源情况下使用跨语言多说话人TTS和跨语言语音转换进行ASR数据增广的方法，其可以通过只使用一个说话人改善ASR系统，并且能够缩小ASR模型间使用人工和合成语音训练的差距，同时使用单一真实说话人的数据增广方法同样能够获得有希望的ASR训练结果。"
}