{
    "title": "Maximum entropy optimal density control of discrete-time linear systems and Schr\\\"odinger bridges. (arXiv:2204.05263v2 [math.OC] UPDATED)",
    "abstract": "We consider an entropy-regularized version of optimal density control of deterministic discrete-time linear systems. Entropy regularization, or a maximum entropy (MaxEnt) method for optimal control has attracted much attention especially in reinforcement learning due to its many advantages such as a natural exploration strategy. Despite the merits, high-entropy control policies induced by the regularization introduce probabilistic uncertainty into systems, which severely limits the applicability of MaxEnt optimal control to safety-critical systems. To remedy this situation, we impose a Gaussian density constraint at a specified time on the MaxEnt optimal control to directly control state uncertainty. Specifically, we derive the explicit form of the MaxEnt optimal density control. In addition, we also consider the case where density constraints are replaced by fixed point constraints. Then, we characterize the associated state process as a pinned process, which is a generalization of th",
    "link": "http://arxiv.org/abs/2204.05263",
    "context": "Title: Maximum entropy optimal density control of discrete-time linear systems and Schr\\\"odinger bridges. (arXiv:2204.05263v2 [math.OC] UPDATED)\nAbstract: We consider an entropy-regularized version of optimal density control of deterministic discrete-time linear systems. Entropy regularization, or a maximum entropy (MaxEnt) method for optimal control has attracted much attention especially in reinforcement learning due to its many advantages such as a natural exploration strategy. Despite the merits, high-entropy control policies induced by the regularization introduce probabilistic uncertainty into systems, which severely limits the applicability of MaxEnt optimal control to safety-critical systems. To remedy this situation, we impose a Gaussian density constraint at a specified time on the MaxEnt optimal control to directly control state uncertainty. Specifically, we derive the explicit form of the MaxEnt optimal density control. In addition, we also consider the case where density constraints are replaced by fixed point constraints. Then, we characterize the associated state process as a pinned process, which is a generalization of th",
    "path": "papers/22/04/2204.05263.json",
    "total_tokens": 891,
    "translated_title": "离散时间线性系统和Schr\\\"odinger桥的最大熵最优密度控制",
    "translated_abstract": "我们考虑了确定性离散时间线性系统的熵正则化版本的最优密度控制。熵正则化或最大熵（MaxEnt）方法在最优控制中引起了广泛关注，特别是在强化学习中，由于其自然的探索策略等许多优点。尽管有这些优点，由正则化引起的高熵控制策略将概率不确定性引入系统，这严重限制了MaxEnt最优控制在安全关键系统中的适用性。为了解决这个问题，我们在指定的时间点对MaxEnt最优控制施加了一个Gaussian密度约束，以直接控制状态的不确定性。具体地，我们推导出了MaxEnt最优密度控制的显式形式。此外，我们还考虑了将密度约束替换为定点约束的情况。然后，我们将相关的状态过程描述为一个固定过程，这是对经典Schr\\\"odinger桥模型的一般化。",
    "tldr": "本文研究了离散时间线性系统和Schr\\\"odinger桥的最大熵最优密度控制问题，通过引入特定时间点的高斯密度约束来直接控制系统状态的不确定性。"
}