{
    "title": "ZETAR: Modeling and Computational Design of Strategic and Adaptive Compliance Policies. (arXiv:2204.02294v2 [cs.GT] UPDATED)",
    "abstract": "Compliance management plays an important role in mitigating insider threats. Incentive design is a proactive and non-invasive approach to achieving compliance by aligning an insider's incentive with the defender's security objective, which motivates (rather than commands) an insider to act in the organization's interests. Controlling insiders' incentives for population-level compliance is challenging because they are neither precisely known nor directly controllable. To this end, we develop ZETAR, a zero-trust audit and recommendation framework, to provide a quantitative approach to model insiders' incentives and design customized recommendation policies to improve their compliance. We formulate primal and dual convex programs to compute the optimal bespoke recommendation policies. We create the theoretical underpinning for understanding trust, compliance, and satisfaction, which leads to scoring mechanisms of how compliant and persuadable an insider is. After classifying insiders as m",
    "link": "http://arxiv.org/abs/2204.02294",
    "context": "Title: ZETAR: Modeling and Computational Design of Strategic and Adaptive Compliance Policies. (arXiv:2204.02294v2 [cs.GT] UPDATED)\nAbstract: Compliance management plays an important role in mitigating insider threats. Incentive design is a proactive and non-invasive approach to achieving compliance by aligning an insider's incentive with the defender's security objective, which motivates (rather than commands) an insider to act in the organization's interests. Controlling insiders' incentives for population-level compliance is challenging because they are neither precisely known nor directly controllable. To this end, we develop ZETAR, a zero-trust audit and recommendation framework, to provide a quantitative approach to model insiders' incentives and design customized recommendation policies to improve their compliance. We formulate primal and dual convex programs to compute the optimal bespoke recommendation policies. We create the theoretical underpinning for understanding trust, compliance, and satisfaction, which leads to scoring mechanisms of how compliant and persuadable an insider is. After classifying insiders as m",
    "path": "papers/22/04/2204.02294.json",
    "total_tokens": 966,
    "translated_title": "ZETAR:战略和自适应合规政策的建模与计算设计",
    "translated_abstract": "合规管理在减轻内部威胁中起着重要作用。激励设计是一种积极的、非侵入性的方法，通过将内部人员的激励与防御者的安全目标相一致，激励内部人员以组织的利益为动机行动，从而实现合规。控制人群级合规的内部人员的激励具有挑战性，因为他们既不是精确可知的，也无法直接控制。为此，我们开发了ZETAR，一个零信任的审计和推荐框架，提供了一种定量的方法来建模内部人员的激励，并设计定制的推荐政策来提高他们的合规性。我们制定了原始和对偶凸规划来计算最佳的定制推荐政策。我们创建了理论基础来理解信任、合规和满意度，从而导致了如何评估内部人员合规性和可说服性的评分机制。",
    "tldr": "本研究提出了ZETAR框架，用于建模内部人员的激励，并设计定制的推荐政策来提高合规性。通过原始和对偶凸规划，计算出最佳的推荐政策。该研究为理解信任、合规和满意度提供了理论基础，并提出了评估内部人员合规性和可说服性的评分机制。",
    "en_tdlr": "This paper introduces the ZETAR framework for modeling insider incentives and designing customized recommendation policies to enhance compliance. It formulates primal and dual convex programs to compute optimal recommendation policies, and provides a theoretical foundation for understanding trust, compliance, and satisfaction, along with scoring mechanisms for evaluating insider compliance and persuasiveness."
}