{
    "title": "A Survey on Non-Autoregressive Generation for Neural Machine Translation and Beyond. (arXiv:2204.09269v2 [cs.CL] UPDATED)",
    "abstract": "Non-autoregressive (NAR) generation, which is first proposed in neural machine translation (NMT) to speed up inference, has attracted much attention in both machine learning and natural language processing communities. While NAR generation can significantly accelerate inference speed for machine translation, the speedup comes at the cost of sacrificed translation accuracy compared to its counterpart, autoregressive (AR) generation. In recent years, many new models and algorithms have been designed/proposed to bridge the accuracy gap between NAR generation and AR generation. In this paper, we conduct a systematic survey with comparisons and discussions of various non-autoregressive translation (NAT) models from different aspects. Specifically, we categorize the efforts of NAT into several groups, including data manipulation, modeling methods, training criterion, decoding algorithms, and the benefit from pre-trained models. Furthermore, we briefly review other applications of NAR models ",
    "link": "http://arxiv.org/abs/2204.09269",
    "context": "Title: A Survey on Non-Autoregressive Generation for Neural Machine Translation and Beyond. (arXiv:2204.09269v2 [cs.CL] UPDATED)\nAbstract: Non-autoregressive (NAR) generation, which is first proposed in neural machine translation (NMT) to speed up inference, has attracted much attention in both machine learning and natural language processing communities. While NAR generation can significantly accelerate inference speed for machine translation, the speedup comes at the cost of sacrificed translation accuracy compared to its counterpart, autoregressive (AR) generation. In recent years, many new models and algorithms have been designed/proposed to bridge the accuracy gap between NAR generation and AR generation. In this paper, we conduct a systematic survey with comparisons and discussions of various non-autoregressive translation (NAT) models from different aspects. Specifically, we categorize the efforts of NAT into several groups, including data manipulation, modeling methods, training criterion, decoding algorithms, and the benefit from pre-trained models. Furthermore, we briefly review other applications of NAR models ",
    "path": "papers/22/04/2204.09269.json",
    "total_tokens": 959,
    "translated_title": "针对神经机器翻译及其扩展的非自回归生成的调查",
    "translated_abstract": "非自回归（NAR）生成首次在神经机器翻译（NMT）中提出，旨在加速推理过程，并引起了机器学习和自然语言处理领域的广泛关注。尽管NAR生成可以显著加快机器翻译的推理速度，但与其对应的自回归（AR）生成相比，其翻译准确性有所降低。近年来，许多新模型和算法已被设计/提出以弥补NAR生成与AR生成之间的准确性差距。在本文中，我们对不同方面的各种非自回归翻译（NAT）模型进行了系统调查，并进行了比较和讨论。具体而言，我们将NAT的努力分成了几个方向，包括数据处理、建模方法、训练标准、解码算法以及来自预训练模型的益处。此外，我们还简要回顾了NAR模型的其他应用。",
    "tldr": "这项调查研究了非自回归生成在神经机器翻译以及其他领域的应用。研究发现，尽管非自回归生成可以加快推理速度，但与自回归生成相比存在翻译准确性的损失。然而，通过各种方法和算法的改进，可以缩小这一准确性差距。",
    "en_tdlr": "This survey explores the application of non-autoregressive generation in neural machine translation and other domains. The study finds that while non-autoregressive generation can speed up inference, there is a trade-off in translation accuracy compared to autoregressive generation. However, through various methods and algorithms, the gap in accuracy can be reduced."
}