{
    "title": "INSPIRE: Distributed Bayesian Optimization for ImproviNg SPatIal REuse in Dense WLANs. (arXiv:2204.10184v3 [cs.NI] UPDATED)",
    "abstract": "WLANs, which have overtaken wired networks to become the primary means of connecting devices to the Internet, are prone to performance issues due to the scarcity of space in the radio spectrum. As a response, IEEE 802.11ax and subsequent amendments aim at increasing the spatial reuse of a radio channel by allowing the dynamic update of two key parameters in wireless transmission: the transmission power (TX_POWER) and the sensitivity threshold (OBSS_PD). In this paper, we present INSPIRE, a distributed solution performing local Bayesian optimizations based on Gaussian processes to improve the spatial reuse in WLANs. INSPIRE makes no explicit assumptions about the topology of WLANs and favors altruistic behaviors of the access points, leading them to find adequate configurations of their TX_POWER and OBSS_PD parameters for the \"greater good\" of the WLANs. We demonstrate the superiority of INSPIRE over other state-of-the-art strategies using the ns-3 simulator and two examples inspired by",
    "link": "http://arxiv.org/abs/2204.10184",
    "context": "Title: INSPIRE: Distributed Bayesian Optimization for ImproviNg SPatIal REuse in Dense WLANs. (arXiv:2204.10184v3 [cs.NI] UPDATED)\nAbstract: WLANs, which have overtaken wired networks to become the primary means of connecting devices to the Internet, are prone to performance issues due to the scarcity of space in the radio spectrum. As a response, IEEE 802.11ax and subsequent amendments aim at increasing the spatial reuse of a radio channel by allowing the dynamic update of two key parameters in wireless transmission: the transmission power (TX_POWER) and the sensitivity threshold (OBSS_PD). In this paper, we present INSPIRE, a distributed solution performing local Bayesian optimizations based on Gaussian processes to improve the spatial reuse in WLANs. INSPIRE makes no explicit assumptions about the topology of WLANs and favors altruistic behaviors of the access points, leading them to find adequate configurations of their TX_POWER and OBSS_PD parameters for the \"greater good\" of the WLANs. We demonstrate the superiority of INSPIRE over other state-of-the-art strategies using the ns-3 simulator and two examples inspired by",
    "path": "papers/22/04/2204.10184.json",
    "total_tokens": 821,
    "translated_title": "INSPIRE：面向密集WLAN中空间复用的分布式贝叶斯优化",
    "translated_abstract": "WLANs已经取代有线网络成为连接设备到互联网的主要手段，但由于无线电频谱空间有限，容易出现性能问题。为此，IEEE 802.11ax和随后的修正案旨在通过允许无线传输中两个关键参数（传输功率和灵敏度阈值）的动态更新，提高无线信道的空间复用。本文提出了一种名为INSPIRE的分布式解决方案，它基于高斯过程执行本地贝叶斯优化，以提高WLAN中的空间复用。INSPIRE不对WLAN的拓扑做出明确假设，青睐无线接入点的无私行为，使其找到适当的传输功率和灵敏度阈值参数配置，以实现WLAN的“最大利益”。我们使用ns-3模拟器和两个示例表明了INSPIRE相对于其他最先进策略的优越性。",
    "tldr": "INSPIRE是一种面向密集WLAN中空间复用的分布式贝叶斯优化解决方案，通过无线传输参数的优化，提高WLAN的性能。"
}