{
    "title": "Solving AC Power Flow with Graph Neural Networks under Realistic Constraints. (arXiv:2204.07000v2 [cs.LG] UPDATED)",
    "abstract": "In this paper, we propose a graph neural network architecture to solve the AC power flow problem under realistic constraints. To ensure a safe and resilient operation of distribution grids, AC power flow calculations are the means of choice to determine grid operating limits or analyze grid asset utilization in planning procedures. In our approach, we demonstrate the development of a framework that uses graph neural networks to learn the physical constraints of the power flow. We present our model architecture on which we perform unsupervised training to learn a general solution of the AC power flow formulation independent of the specific topologies and supply tasks used for training. Finally, we demonstrate, validate and discuss our results on medium voltage benchmark grids. In our approach, we focus on the physical and topological properties of distribution grids to provide scalable solutions for real grid topologies. Therefore, we take a data-driven approach, using large and diverse",
    "link": "http://arxiv.org/abs/2204.07000",
    "context": "Title: Solving AC Power Flow with Graph Neural Networks under Realistic Constraints. (arXiv:2204.07000v2 [cs.LG] UPDATED)\nAbstract: In this paper, we propose a graph neural network architecture to solve the AC power flow problem under realistic constraints. To ensure a safe and resilient operation of distribution grids, AC power flow calculations are the means of choice to determine grid operating limits or analyze grid asset utilization in planning procedures. In our approach, we demonstrate the development of a framework that uses graph neural networks to learn the physical constraints of the power flow. We present our model architecture on which we perform unsupervised training to learn a general solution of the AC power flow formulation independent of the specific topologies and supply tasks used for training. Finally, we demonstrate, validate and discuss our results on medium voltage benchmark grids. In our approach, we focus on the physical and topological properties of distribution grids to provide scalable solutions for real grid topologies. Therefore, we take a data-driven approach, using large and diverse",
    "path": "papers/22/04/2204.07000.json",
    "total_tokens": 944,
    "translated_title": "使用图神经网络解决考虑实际约束条件下的交流电功率流问题",
    "translated_abstract": "本文提出了一种使用图神经网络架构解决考虑实际约束条件下的交流电功率流问题的方法。为了确保配电网的安全和弹性运行，交流电功率流计算是确定网格运行限制或分析网格资产利用情况的选择手段。在我们的方法中，我们展示了一个使用图神经网络学习电力流物理约束的框架的开发。我们在模型架构上进行了无监督训练，以学习独立于用于训练的具体拓扑和供应任务的交流电功率流公式的通用解。最后，我们在中压基准网格上展示、验证和讨论了我们的结果。在我们的方法中，我们关注配电网的物理和拓扑特性，以提供适用于实际网格拓扑的可扩展解决方案。因此，我们采用了数据驱动的方法，使用大规模多样化的数据集进行训练。",
    "tldr": "本文提出了一种使用图神经网络解决考虑实际约束条件下的交流电功率流问题的方法。我们开发了一个框架，通过无监督训练学习交流电功率流的物理约束，从而实现了独立于具体拓扑和供应任务的通用解。我们在中压基准网格上验证了我们的方法的可行性。"
}