{
    "title": "Calibrating distribution models from PELVE. (arXiv:2204.08882v4 [q-fin.RM] UPDATED)",
    "abstract": "The Value-at-Risk (VaR) and the Expected Shortfall (ES) are the two most popular risk measures in banking and insurance regulation. To bridge between the two regulatory risk measures, the Probability Equivalent Level of VaR-ES (PELVE) was recently proposed to convert a level of VaR to that of ES. It is straightforward to compute the value of PELVE for a given distribution model. In this paper, we study the converse problem of PELVE calibration, that is, to find a distribution model that yields a given PELVE, which may either be obtained from data or from expert opinion. We discuss separately the cases when one-point, two-point, n-point and curve constraints are given. In the most complicated case of a curve constraint, we convert the calibration problem to that of an advanced differential equation. We apply the model calibration techniques to estimation and simulation for datasets used in insurance. We further study some technical properties of PELVE by offering a few new results on mo",
    "link": "http://arxiv.org/abs/2204.08882",
    "context": "Title: Calibrating distribution models from PELVE. (arXiv:2204.08882v4 [q-fin.RM] UPDATED)\nAbstract: The Value-at-Risk (VaR) and the Expected Shortfall (ES) are the two most popular risk measures in banking and insurance regulation. To bridge between the two regulatory risk measures, the Probability Equivalent Level of VaR-ES (PELVE) was recently proposed to convert a level of VaR to that of ES. It is straightforward to compute the value of PELVE for a given distribution model. In this paper, we study the converse problem of PELVE calibration, that is, to find a distribution model that yields a given PELVE, which may either be obtained from data or from expert opinion. We discuss separately the cases when one-point, two-point, n-point and curve constraints are given. In the most complicated case of a curve constraint, we convert the calibration problem to that of an advanced differential equation. We apply the model calibration techniques to estimation and simulation for datasets used in insurance. We further study some technical properties of PELVE by offering a few new results on mo",
    "path": "papers/22/04/2204.08882.json",
    "total_tokens": 945,
    "translated_title": "从PELVE校准分布模型",
    "translated_abstract": "Value-at-Risk (VaR)和Expected Shortfall (ES)是银行和保险监管中最常用的风险度量指标。为了连接这两个监管风险度量指标，最近提出了将VaR的水平转换为ES的概率等效水平（PELVE）。对于给定的分布模型，计算PELVE的值是直观的。本文研究PELVE校准的反向问题，即找到一个能够产生给定PELVE的分布模型，可能是从数据或专家意见中获得的。我们分别讨论了给定单点、双点、n点和曲线约束的情况。在最复杂的曲线约束情况下，我们将校准问题转化为一个高级微分方程问题。我们将模型校准技术应用于保险使用的数据集的估计和模拟。我们进一步通过提供一些关于PELVE的新结果来研究其一些技术特性。",
    "tldr": "本文研究了PELVE校准的反向问题，即找到一个能够产生给定PELVE的分布模型。我们讨论了不同约束条件下的校准问题，并将其转化为高级微分方程问题。同时，我们将模型校准技术应用于保险数据集的估计和模拟，并研究了PELVE的一些技术特性。",
    "en_tdlr": "This paper addresses the inverse problem of PELVE calibration, finding a distribution model that yields a given PELVE. Various constraint scenarios are discussed and converted into advanced differential equations. Model calibration techniques are applied to insurance datasets for estimation and simulation, while exploring technical properties of PELVE."
}