{
    "title": "The Multimarginal Optimal Transport Formulation of Adversarial Multiclass Classification. (arXiv:2204.12676v3 [cs.LG] UPDATED)",
    "abstract": "We study a family of adversarial multiclass classification problems and provide equivalent reformulations in terms of: 1) a family of generalized barycenter problems introduced in the paper and 2) a family of multimarginal optimal transport problems where the number of marginals is equal to the number of classes in the original classification problem. These new theoretical results reveal a rich geometric structure of adversarial learning problems in multiclass classification and extend recent results restricted to the binary classification setting. A direct computational implication of our results is that by solving either the barycenter problem and its dual, or the MOT problem and its dual, we can recover the optimal robust classification rule and the optimal adversarial strategy for the original adversarial problem. Examples with synthetic and real data illustrate our results.",
    "link": "http://arxiv.org/abs/2204.12676",
    "context": "Title: The Multimarginal Optimal Transport Formulation of Adversarial Multiclass Classification. (arXiv:2204.12676v3 [cs.LG] UPDATED)\nAbstract: We study a family of adversarial multiclass classification problems and provide equivalent reformulations in terms of: 1) a family of generalized barycenter problems introduced in the paper and 2) a family of multimarginal optimal transport problems where the number of marginals is equal to the number of classes in the original classification problem. These new theoretical results reveal a rich geometric structure of adversarial learning problems in multiclass classification and extend recent results restricted to the binary classification setting. A direct computational implication of our results is that by solving either the barycenter problem and its dual, or the MOT problem and its dual, we can recover the optimal robust classification rule and the optimal adversarial strategy for the original adversarial problem. Examples with synthetic and real data illustrate our results.",
    "path": "papers/22/04/2204.12676.json",
    "total_tokens": 875,
    "translated_title": "对抗性多类分类问题的多重边际最优输运公式",
    "translated_abstract": "我们研究了一类对抗性多类分类问题，并提供等价重述。其中一种是基于本文引入的一组广义几何重心问题；另一种是使用多重边际最优输运问题，其中边际的数量等于原始分类问题中的类数。这些新的理论结果揭示了多类分类中对抗性学习问题的丰富几何结构，并扩展了之前仅限于二分类设置的相关结果。我们的结果的一个直接计算含义是，通过解决重心问题及其对偶，或者是 MOT 问题及其对偶，我们可以恢复原始对抗性问题的最优稳健分类规则和最优对抗策略。我们使用合成和真实数据的示例来说明我们的结果。",
    "tldr": "本文研究了一类对抗性多类分类问题，提供了等价的广义几何重心问题和多重边际最优输运问题的重述，揭示了其丰富的几何结构，扩展了之前仅限于二分类设置的相关结果。通过本文提出的方法，可以恢复原始对抗性问题的最优稳健分类规则和最优对抗策略。",
    "en_tdlr": "This paper studies a family of adversarial multiclass classification problems and provides equivalent formulations in terms of generalized barycenter problems and multimarginal optimal transport problems, revealing the rich geometric structure of adversarial learning problems in multiclass classification and extending recent results restricted to the binary classification setting. The proposed methods can recover the optimal robust classification rule and the optimal adversarial strategy for the original adversarial problem."
}