{
    "title": "Scale Dependencies and Self-Similar Models with Wavelet Scattering Spectra. (arXiv:2204.10177v2 [physics.data-an] UPDATED)",
    "abstract": "We introduce the wavelet scattering spectra which provide non-Gaussian models of time-series having stationary increments. A complex wavelet transform computes signal variations at each scale. Dependencies across scales are captured by the joint correlation across time and scales of wavelet coefficients and their modulus. This correlation matrix is nearly diagonalized by a second wavelet transform, which defines the scattering spectra. We show that this vector of moments characterizes a wide range of non-Gaussian properties of multi-scale processes. We prove that self-similar processes have scattering spectra which are scale invariant. This property can be tested statistically on a single realization and defines a class of wide-sense self-similar processes. We build maximum entropy models conditioned by scattering spectra coefficients, and generate new time-series with a microcanonical sampling algorithm. Applications are shown for highly non-Gaussian financial and turbulence time-seri",
    "link": "http://arxiv.org/abs/2204.10177",
    "context": "Title: Scale Dependencies and Self-Similar Models with Wavelet Scattering Spectra. (arXiv:2204.10177v2 [physics.data-an] UPDATED)\nAbstract: We introduce the wavelet scattering spectra which provide non-Gaussian models of time-series having stationary increments. A complex wavelet transform computes signal variations at each scale. Dependencies across scales are captured by the joint correlation across time and scales of wavelet coefficients and their modulus. This correlation matrix is nearly diagonalized by a second wavelet transform, which defines the scattering spectra. We show that this vector of moments characterizes a wide range of non-Gaussian properties of multi-scale processes. We prove that self-similar processes have scattering spectra which are scale invariant. This property can be tested statistically on a single realization and defines a class of wide-sense self-similar processes. We build maximum entropy models conditioned by scattering spectra coefficients, and generate new time-series with a microcanonical sampling algorithm. Applications are shown for highly non-Gaussian financial and turbulence time-seri",
    "path": "papers/22/04/2204.10177.json",
    "total_tokens": 876,
    "translated_title": "基于小波散射谱的尺度依赖性和自相似模型",
    "translated_abstract": "我们提出了小波散射谱，提供了一种具有平稳增量的时间序列的非高斯模型。复小波变换计算每个尺度上的信号变化。跨尺度的依赖关系由小波系数及其模数在时间和尺度上的联合相关性所捕获。该相关矩阵由第二个小波变换近似对角化，定义了散射谱。我们证明了自相似过程具有散射谱的尺度不变性。该特性可以在单个实现上进行统计测试，并定义了一类宽义自相似过程。我们通过散射谱系数构建最大熵模型，并使用微正则采样算法生成新的时间序列。展示了高度非高斯的金融和湍流时间序列的应用。",
    "tldr": "本论文提出了小波散射谱方法，可以用于建模具有平稳增量的时间序列的非高斯特性，其系数可以用于构建最大熵模型和生成新的时间序列，同时证明了自相似过程具有散射谱的尺度不变性。"
}