{
    "title": "Dimensionality Expansion of Load Monitoring Time Series and Transfer Learning for EMS. (arXiv:2204.02802v4 [cs.LG] UPDATED)",
    "abstract": "Energy management systems (EMS) rely on (non)-intrusive load monitoring (N)ILM to monitor and manage appliances and help residents be more energy efficient and thus more frugal. The robustness as well as the transfer potential of the most promising machine learning solutions for (N)ILM is not yet fully understood as they are trained and evaluated on relatively limited data. In this paper, we propose a new approach for load monitoring in building EMS based on dimensionality expansion of time series and transfer learning. We perform an extensive evaluation on 5 different low-frequency datasets. The proposed feature dimensionality expansion using video-like transformation and resource-aware deep learning architecture achieves an average weighted F1 score of 0.88 across the datasets with 29 appliances and is computationally more efficient compared to the state-of-the-art imaging methods. Investigating the proposed method for cross-dataset intra-domain transfer learning, we find that 1) our",
    "link": "http://arxiv.org/abs/2204.02802",
    "context": "Title: Dimensionality Expansion of Load Monitoring Time Series and Transfer Learning for EMS. (arXiv:2204.02802v4 [cs.LG] UPDATED)\nAbstract: Energy management systems (EMS) rely on (non)-intrusive load monitoring (N)ILM to monitor and manage appliances and help residents be more energy efficient and thus more frugal. The robustness as well as the transfer potential of the most promising machine learning solutions for (N)ILM is not yet fully understood as they are trained and evaluated on relatively limited data. In this paper, we propose a new approach for load monitoring in building EMS based on dimensionality expansion of time series and transfer learning. We perform an extensive evaluation on 5 different low-frequency datasets. The proposed feature dimensionality expansion using video-like transformation and resource-aware deep learning architecture achieves an average weighted F1 score of 0.88 across the datasets with 29 appliances and is computationally more efficient compared to the state-of-the-art imaging methods. Investigating the proposed method for cross-dataset intra-domain transfer learning, we find that 1) our",
    "path": "papers/22/04/2204.02802.json",
    "total_tokens": 858,
    "translated_title": "应用维度扩展和迁移学习于EMS负荷监测中",
    "translated_abstract": "能源管理系统（EMS）通过（非）侵入式负载监测（(N)ILM）监控和管理电器，帮助居民提高能源效率以及节省用电费用。本文提出了一种新的基于时间序列维度扩展和迁移学习的负载监测方法。我们在5个不同的低频数据集上进行了广泛的评估，并使用类似视频的转换和资源感知深度学习架构提出了特征维度扩展的方法，方法在29种电器的数据集上获得了平均加权F1得分0.88，相较于最先进的成像方法，具有更高的计算效率。此外，我们还研究了该方法在跨数据集内领域迁移学习方面的可行性。",
    "tldr": "本文提出了一种维度扩展和迁移学习的负载监测方法，该方法在5个不同的低频数据集上表现良好，可以更高效地计算。研究表明在跨数据集内领域迁移学习方面也有良好的效果。",
    "en_tdlr": "This paper proposes a load monitoring method based on dimensionality expansion of time series and transfer learning for building energy management systems (EMS), which achieves a higher computational efficiency and shows great potential in cross-dataset intra-domain transfer learning."
}