{
    "title": "Towards cost-effective and resource-aware aggregation at Edge for Federated Learning. (arXiv:2204.07767v2 [cs.LG] UPDATED)",
    "abstract": "Federated Learning (FL) is a machine learning approach that addresses privacy and data transfer costs by computing data at the source. It's particularly popular for Edge and IoT applications where the aggregator server of FL is in resource-capped edge data centers for reducing communication costs. Existing cloud-based aggregator solutions are resource-inefficient and expensive at the Edge, leading to low scalability and high latency. To address these challenges, this study compares prior and new aggregation methodologies under the changing demands of IoT and Edge applications. This work is the first to propose an adaptive FL aggregator at the Edge, enabling users to manage the cost and efficiency trade-off. An extensive comparative analysis demonstrates that the design improves scalability by up to 4X, time efficiency by 8X, and reduces costs by more than 2X compared to extant cloud-based static methodologies.",
    "link": "http://arxiv.org/abs/2204.07767",
    "context": "Title: Towards cost-effective and resource-aware aggregation at Edge for Federated Learning. (arXiv:2204.07767v2 [cs.LG] UPDATED)\nAbstract: Federated Learning (FL) is a machine learning approach that addresses privacy and data transfer costs by computing data at the source. It's particularly popular for Edge and IoT applications where the aggregator server of FL is in resource-capped edge data centers for reducing communication costs. Existing cloud-based aggregator solutions are resource-inefficient and expensive at the Edge, leading to low scalability and high latency. To address these challenges, this study compares prior and new aggregation methodologies under the changing demands of IoT and Edge applications. This work is the first to propose an adaptive FL aggregator at the Edge, enabling users to manage the cost and efficiency trade-off. An extensive comparative analysis demonstrates that the design improves scalability by up to 4X, time efficiency by 8X, and reduces costs by more than 2X compared to extant cloud-based static methodologies.",
    "path": "papers/22/04/2204.07767.json",
    "total_tokens": 862,
    "translated_title": "边缘资源感知的低成本边缘聚合方法在联邦学习中的应用",
    "translated_abstract": "联邦学习是一种机器学习方法，通过在数据源处计算数据来解决隐私和数据传输成本问题。它在边缘和物联网应用中特别受欢迎，其中联邦学习的聚合服务器位于资源受限的边缘数据中心，以减少通信成本。现有基于云的聚合解决方案在边缘上既资源低效又昂贵，导致可扩展性低和延迟高。为了应对这些挑战，本研究比较了在物联网和边缘应用需求变化下的先前和新的聚合方法。这项工作首次提出了一种自适应的边缘联邦学习聚合器，使用户能够管理成本和效率的权衡。广泛的比较分析表明，与现有的基于云的静态方法相比，该设计提高了可扩展性最多4倍，时间效率提高了8倍，并将成本降低了超过2倍。",
    "tldr": "本研究提出了一种边缘联邦学习聚合器，通过在边缘进行自适应聚合，提高了可扩展性和时间效率，同时降低了成本。",
    "en_tdlr": "This study proposes an adaptive federated learning aggregator at the edge, improving scalability and time efficiency while reducing costs."
}