{
    "title": "Robust stabilization of polytopic systems via fast and reliable neural network-based approximations. (arXiv:2204.13209v2 [eess.SY] UPDATED)",
    "abstract": "We consider the design of fast and reliable neural network (NN)-based approximations of traditional stabilizing controllers for linear systems with polytopic uncertainty, including control laws with variable structure and those based on a (minimal) selection policy. Building upon recent approaches for the design of reliable control surrogates with guaranteed structural properties, we develop a systematic procedure to certify the closed-loop stability and performance of a linear uncertain system when a trained rectified linear unit (ReLU)-based approximation replaces such traditional controllers. First, we provide a sufficient condition, which involves the worst-case approximation error between ReLU-based and traditional controller-based state-to-input mappings, ensuring that the system is ultimately bounded within a set with adjustable size and convergence rate. Then, we develop an offline, mixed-integer optimization-based method that allows us to compute that quantity exactly.",
    "link": "http://arxiv.org/abs/2204.13209",
    "context": "Title: Robust stabilization of polytopic systems via fast and reliable neural network-based approximations. (arXiv:2204.13209v2 [eess.SY] UPDATED)\nAbstract: We consider the design of fast and reliable neural network (NN)-based approximations of traditional stabilizing controllers for linear systems with polytopic uncertainty, including control laws with variable structure and those based on a (minimal) selection policy. Building upon recent approaches for the design of reliable control surrogates with guaranteed structural properties, we develop a systematic procedure to certify the closed-loop stability and performance of a linear uncertain system when a trained rectified linear unit (ReLU)-based approximation replaces such traditional controllers. First, we provide a sufficient condition, which involves the worst-case approximation error between ReLU-based and traditional controller-based state-to-input mappings, ensuring that the system is ultimately bounded within a set with adjustable size and convergence rate. Then, we develop an offline, mixed-integer optimization-based method that allows us to compute that quantity exactly.",
    "path": "papers/22/04/2204.13209.json",
    "total_tokens": 847,
    "translated_title": "通过快速可靠的神经网络近似对多顶点系统进行坚固稳定化",
    "translated_abstract": "本文考虑使用快速可靠的神经网络（NN）近似传统稳定控制器的设计，用于具有多顶点不确定性的线性系统，包括具有可变结构和基于选择策略的控制律。在最近的可靠控制替代设计方法基础上，我们开发了一种系统的过程，用于在训练得到的修正线性单元（ReLU）近似替代传统控制器时，证明线性不确定系统的闭环稳定性和性能。首先，提供了一种充分条件，其中包括ReLU基于传统控制器的状态到输入映射的最坏情况近似误差，确保系统在可调整大小和收敛速度的集合内最终有界。然后，我们开发了一种离线的混合整数优化方法，可以精确计算该数量。",
    "tldr": "本文通过快速可靠的神经网络近似方法，实现了对多顶点系统进行稳定化控制。离线的混合整数优化方法确保了系统在可调整大小和收敛速度的集合内保持有界。",
    "en_tdlr": "This paper presents a fast and reliable neural network-based approximation method for stabilizing polytopic systems. An offline, mixed-integer optimization method is used to guarantee that the system stays within a bounded set with adjustable size and convergence rate."
}