{
    "title": "GUARD: Graph Universal Adversarial Defense. (arXiv:2204.09803v4 [cs.LG] UPDATED)",
    "abstract": "Graph convolutional networks (GCNs) have been shown to be vulnerable to small adversarial perturbations, which becomes a severe threat and largely limits their applications in security-critical scenarios. To mitigate such a threat, considerable research efforts have been devoted to increasing the robustness of GCNs against adversarial attacks. However, current defense approaches are typically designed to prevent GCNs from untargeted adversarial attacks and focus on overall performance, making it challenging to protect important local nodes from more powerful targeted adversarial attacks. Additionally, a trade-off between robustness and performance is often made in existing research. Such limitations highlight the need for developing an effective and efficient approach that can defend local nodes against targeted attacks, without compromising the overall performance of GCNs. In this work, we present a simple yet effective method, named Graph Universal Adversarial Defense (GUARD). Unlike",
    "link": "http://arxiv.org/abs/2204.09803",
    "context": "Title: GUARD: Graph Universal Adversarial Defense. (arXiv:2204.09803v4 [cs.LG] UPDATED)\nAbstract: Graph convolutional networks (GCNs) have been shown to be vulnerable to small adversarial perturbations, which becomes a severe threat and largely limits their applications in security-critical scenarios. To mitigate such a threat, considerable research efforts have been devoted to increasing the robustness of GCNs against adversarial attacks. However, current defense approaches are typically designed to prevent GCNs from untargeted adversarial attacks and focus on overall performance, making it challenging to protect important local nodes from more powerful targeted adversarial attacks. Additionally, a trade-off between robustness and performance is often made in existing research. Such limitations highlight the need for developing an effective and efficient approach that can defend local nodes against targeted attacks, without compromising the overall performance of GCNs. In this work, we present a simple yet effective method, named Graph Universal Adversarial Defense (GUARD). Unlike",
    "path": "papers/22/04/2204.09803.json",
    "total_tokens": 879,
    "translated_title": "GUARD: 图形通用对抗防御",
    "translated_abstract": "图形卷积网络（GCNs）已被证明对小的对抗性扰动具有脆弱性，这成为安全关键场景下应用的严重威胁并且极大限制了其应用。为了减轻这种威胁，已经投入大量研究工作来增加GCNs对抗性攻击的鲁棒性。然而，当前的防御方法通常被设计用于防止GCNs遭受非针对性的对抗性攻击并且着重于整体性能，这使得保护重要局部节点免受更强有力的针对性攻击变得具有挑战性。此外，现有研究往往在鲁棒性和性能之间进行权衡。这些限制凸显了开发一种能够防御针对性攻击的局部节点而不损害GCNs整体性能的有效且高效方法的必要性。在这项工作中，我们提出了一种简单而有效的方法，名为Graph Universal Adversarial Defense（GUARD）。",
    "tldr": "GUARD是一种新颖的图形通用对抗防御方法，旨在提高GCNs对针对性攻击的局部节点的鲁棒性，并在不降低整体性能的情况下进行防御。",
    "en_tdlr": "GUARD is a novel Graph Universal Adversarial Defense method that aims to enhance the robustness of local nodes against targeted attacks in GCNs, without compromising the overall performance."
}