{
    "title": "PyGOD: A Python Library for Graph Outlier Detection",
    "abstract": "arXiv:2204.12095v2 Announce Type: replace  Abstract: PyGOD is an open-source Python library for detecting outliers in graph data. As the first comprehensive library of its kind, PyGOD supports a wide array of leading graph-based methods for outlier detection under an easy-to-use, well-documented API designed for use by both researchers and practitioners. PyGOD provides modularized components of the different detectors implemented so that users can easily customize each detector for their purposes. To ease the construction of detection workflows, PyGOD offers numerous commonly used utility functions. To scale computation to large graphs, PyGOD supports functionalities for deep models such as sampling and mini-batch processing. PyGOD uses best practices in fostering code reliability and maintainability, including unit testing, continuous integration, and code coverage. To facilitate accessibility, PyGOD is released under a BSD 2-Clause license at https://pygod.org and at the Python Packa",
    "link": "https://arxiv.org/abs/2204.12095",
    "context": "Title: PyGOD: A Python Library for Graph Outlier Detection\nAbstract: arXiv:2204.12095v2 Announce Type: replace  Abstract: PyGOD is an open-source Python library for detecting outliers in graph data. As the first comprehensive library of its kind, PyGOD supports a wide array of leading graph-based methods for outlier detection under an easy-to-use, well-documented API designed for use by both researchers and practitioners. PyGOD provides modularized components of the different detectors implemented so that users can easily customize each detector for their purposes. To ease the construction of detection workflows, PyGOD offers numerous commonly used utility functions. To scale computation to large graphs, PyGOD supports functionalities for deep models such as sampling and mini-batch processing. PyGOD uses best practices in fostering code reliability and maintainability, including unit testing, continuous integration, and code coverage. To facilitate accessibility, PyGOD is released under a BSD 2-Clause license at https://pygod.org and at the Python Packa",
    "path": "papers/22/04/2204.12095.json",
    "total_tokens": 858,
    "translated_title": "PyGOD: 一个用于图异常检测的Python库",
    "translated_abstract": "PyGOD是一个用于检测图数据中异常值的开源Python库。作为这类库中首个综合性工具，PyGOD支持多种领先的基于图的异常检测方法，提供了易于使用、有详细文档支持的API，旨在供研究人员和从业者使用。PyGOD提供了不同检测器的模块化组件，使用户可以轻松定制每个检测器以适应其用途。为简化检测工作流的构建，PyGOD提供了许多常用的实用程序函数。为了将计算扩展到大型图形，PyGOD支持深度模型的功能，如采样和小批量处理。PyGOD采用了促进代码可靠性和可维护性的最佳实践，包括单元测试、持续集成和代码覆盖。为了方便访问，PyGOD以BSD 2-Clause许可证发布在https://pygod.org 和 Python包中。",
    "tldr": "PyGOD是一个开源Python库，支持多种领先的基于图的异常检测方法，提供了易于使用的API和丰富的实用程序函数，同时采用了最佳的代码可靠性和可维护性实践。",
    "en_tdlr": "PyGOD is an open-source Python library that supports various leading graph-based outlier detection methods, provides an easy-to-use API and rich utility functions, and adopts best practices in code reliability and maintainability."
}