{
    "title": "Optimal Learning Rates for Regularized Least-Squares with a Fourier Capacity Condition. (arXiv:2204.07856v4 [math.ST] UPDATED)",
    "abstract": "We derive minimax adaptive rates for a new, broad class of Tikhonov-regularized learning problems in Hilbert scales under general source conditions. Our analysis does not require the regression function to be contained in the hypothesis class, and most notably does not employ the conventional \\textit{a priori} assumptions on kernel eigendecay. Using the theory of interpolation, we demonstrate that the spectrum of the Mercer operator can be inferred in the presence of ``tight'' $L^{\\infty}(\\mathcal{X})$ embeddings of suitable Hilbert scales. Our analysis utilizes a new Fourier isocapacitary condition, which captures the interplay of the kernel Dirichlet capacities and small ball probabilities via the optimal Hilbert scale function.",
    "link": "http://arxiv.org/abs/2204.07856",
    "context": "Title: Optimal Learning Rates for Regularized Least-Squares with a Fourier Capacity Condition. (arXiv:2204.07856v4 [math.ST] UPDATED)\nAbstract: We derive minimax adaptive rates for a new, broad class of Tikhonov-regularized learning problems in Hilbert scales under general source conditions. Our analysis does not require the regression function to be contained in the hypothesis class, and most notably does not employ the conventional \\textit{a priori} assumptions on kernel eigendecay. Using the theory of interpolation, we demonstrate that the spectrum of the Mercer operator can be inferred in the presence of ``tight'' $L^{\\infty}(\\mathcal{X})$ embeddings of suitable Hilbert scales. Our analysis utilizes a new Fourier isocapacitary condition, which captures the interplay of the kernel Dirichlet capacities and small ball probabilities via the optimal Hilbert scale function.",
    "path": "papers/22/04/2204.07856.json",
    "total_tokens": 831,
    "translated_title": "带有傅立叶容量条件的正则化最小二乘问题的最优学习率",
    "translated_abstract": "我们在Hilbert空间中的广泛类别的Tikhonov正则化学习问题中推导出最小化自适应率，不需要回归函数包含在假设集中，并且最重要的是不使用传统的内核特征衰减的先验假设。通过插值理论，我们证明了在适当的Hilbert空间的“紧”$L^{\\infty}(\\mathcal{X})$嵌入的情况下，可以推断出Mercer算子的频谱。我们的分析利用了一种新的傅立叶等容性条件，通过最优Hilbert尺度函数捕捉了内核Dirichlet容量和小球概率之间的相互作用。",
    "tldr": "本论文研究了具有傅立叶容量条件的正则化最小二乘问题的最优学习率，通过插值理论和新的傅立叶等容性条件，我们推导出了广泛类别的Tikhonov正则化学习问题的最小化自适应率，不需要回归函数包含在假设集中。",
    "en_tdlr": "This paper investigates the optimal learning rates for regularized least-squares problems with a Fourier capacity condition. By utilizing interpolation theory and a new Fourier isocapacitary condition, the minimax adaptive rates for a broad class of Tikhonov-regularized learning problems are derived without requiring the regression function to be contained in the hypothesis class."
}