{
    "title": "Streaming Algorithms for High-Dimensional Robust Statistics. (arXiv:2204.12399v2 [cs.DS] UPDATED)",
    "abstract": "We study high-dimensional robust statistics tasks in the streaming model. A recent line of work obtained computationally efficient algorithms for a range of high-dimensional robust estimation tasks. Unfortunately, all previous algorithms require storing the entire dataset, incurring memory at least quadratic in the dimension. In this work, we develop the first efficient streaming algorithms for high-dimensional robust statistics with near-optimal memory requirements (up to logarithmic factors). Our main result is for the task of high-dimensional robust mean estimation in (a strengthening of) Huber's contamination model. We give an efficient single-pass streaming algorithm for this task with near-optimal error guarantees and space complexity nearly-linear in the dimension. As a corollary, we obtain streaming algorithms with near-optimal space complexity for several more complex tasks, including robust covariance estimation, robust regression, and more generally robust stochastic optimiz",
    "link": "http://arxiv.org/abs/2204.12399",
    "context": "Title: Streaming Algorithms for High-Dimensional Robust Statistics. (arXiv:2204.12399v2 [cs.DS] UPDATED)\nAbstract: We study high-dimensional robust statistics tasks in the streaming model. A recent line of work obtained computationally efficient algorithms for a range of high-dimensional robust estimation tasks. Unfortunately, all previous algorithms require storing the entire dataset, incurring memory at least quadratic in the dimension. In this work, we develop the first efficient streaming algorithms for high-dimensional robust statistics with near-optimal memory requirements (up to logarithmic factors). Our main result is for the task of high-dimensional robust mean estimation in (a strengthening of) Huber's contamination model. We give an efficient single-pass streaming algorithm for this task with near-optimal error guarantees and space complexity nearly-linear in the dimension. As a corollary, we obtain streaming algorithms with near-optimal space complexity for several more complex tasks, including robust covariance estimation, robust regression, and more generally robust stochastic optimiz",
    "path": "papers/22/04/2204.12399.json",
    "total_tokens": 894,
    "translated_title": "面向高维健壮统计学的流算法",
    "translated_abstract": "本文研究流模型下的高维健壮统计学问题。最近的一些工作针对一系列高维健壮估计任务提出了计算有效率的算法。不幸的是，所有之前的算法都需要存储整个数据集，使得内存至少呈二次方与维度同阶。本研究提出了首个高维健壮统计学流算法，其具有几乎最优的存储需求（以对数因子表示）。本文主要结果是在Huber污染模型下的高维健壮均值估计任务，我们给出了一个高效的单遍流算法，具有几乎最优的误差保证和空间复杂度几乎线性于维度。作为推论，我们得到了几个更复杂的任务的几乎最优空间复杂度的流算法，包括健壮协方差估计，健壮回归，更普遍的健壮随机优化等。",
    "tldr": "本研究提出了首个高维健壮统计学流算法，具有几乎最优的存储需求，特别是在Huber污染模型下的高维健壮均值估计任务中，提供了一个高效的单遍流算法。",
    "en_tdlr": "This paper proposes the first efficient streaming algorithms for high-dimensional robust statistics with near-optimal memory requirements, especially for the task of high-dimensional robust mean estimation in Huber's contamination model. The proposed algorithms have nearly-linear space complexity and provide near-optimal error guarantees."
}