{
    "title": "Successes and critical failures of neural networks in capturing human-like speech recognition. (arXiv:2204.03740v4 [cs.SD] UPDATED)",
    "abstract": "Natural and artificial audition can in principle acquire different solutions to a given problem. The constraints of the task, however, can nudge the cognitive science and engineering of audition to qualitatively converge, suggesting that a closer mutual examination would potentially enrich artificial hearing systems and process models of the mind and brain. Speech recognition an area ripe for such exploration - is inherently robust in humans to a number transformations at various spectrotemporal granularities. To what extent are these robustness profiles accounted for by high-performing neural network systems? We bring together experiments in speech recognition under a single synthesis framework to evaluate state-of-the-art neural networks as stimulus-computable, optimized observers. In a series of experiments, we (1) clarify how influential speech manipulations in the literature relate to each other and to natural speech, (2) show the granularities at which machines exhibit out-of-d",
    "link": "http://arxiv.org/abs/2204.03740",
    "context": "Title: Successes and critical failures of neural networks in capturing human-like speech recognition. (arXiv:2204.03740v4 [cs.SD] UPDATED)\nAbstract: Natural and artificial audition can in principle acquire different solutions to a given problem. The constraints of the task, however, can nudge the cognitive science and engineering of audition to qualitatively converge, suggesting that a closer mutual examination would potentially enrich artificial hearing systems and process models of the mind and brain. Speech recognition an area ripe for such exploration - is inherently robust in humans to a number transformations at various spectrotemporal granularities. To what extent are these robustness profiles accounted for by high-performing neural network systems? We bring together experiments in speech recognition under a single synthesis framework to evaluate state-of-the-art neural networks as stimulus-computable, optimized observers. In a series of experiments, we (1) clarify how influential speech manipulations in the literature relate to each other and to natural speech, (2) show the granularities at which machines exhibit out-of-d",
    "path": "papers/22/04/2204.03740.json",
    "total_tokens": 902,
    "translated_title": "神经网络在模拟人类语音识别方面的成功和关键失败",
    "translated_abstract": "自然与人工听觉原则上可以获得不同的给定问题的解决方案。然而，任务的约束可以促使听觉认知科学和工程定性收敛，表明更紧密的相互审查有可能丰富人工听觉系统和大脑的处理模型。语音识别是一个值得探索的领域，它在人类中天生对于各种光谱时间尺度的转换具有鲁棒性。到目前为止，高性能神经网络系统是否完全考虑了这些鲁棒性特征仍有待确定。我们将语音识别实验集成到一个综合框架中，以评估最先进的神经网络作为可计算、优化的观察器。通过一系列实验，我们（1）澄清了文献中有影响力的语音处理与自然语音之间的关系，（2）展示了机器表现出带有噪声的语音识别能力的时间范围。",
    "tldr": "本文综合了语音识别实验，评估了最先进的神经网络作为可计算、优化的观察器。实验结果展示了机器在带有噪声的语音识别能力的时间范围上表现出来的鲁棒性特征。",
    "en_tdlr": "This paper evaluates state-of-the-art neural networks as stimulus-computable, optimized observers for speech recognition through a series of experiments, and shows the robustness profiles exhibited by machines in the time range for recognizing noisy speech."
}