{
    "title": "Separate and conquer heuristic allows robust mining of contrast sets in classification, regression, and survival data. (arXiv:2204.00497v3 [cs.DB] UPDATED)",
    "abstract": "Identifying differences between groups is one of the most important knowledge discovery problems. The procedure, also known as contrast sets mining, is applied in a wide range of areas like medicine, industry, or economics.  In the paper we present RuleKit-CS, an algorithm for contrast set mining based on separate and conquer - a well established heuristic for decision rule induction. Multiple passes accompanied with an attribute penalization scheme provide contrast sets describing same examples with different attributes, distinguishing presented approach from the standard separate and conquer. The algorithm was also generalized for regression and survival data allowing identification of contrast sets whose label attribute/survival prognosis is consistent with the label/prognosis for the predefined contrast groups. This feature, not provided by the existing approaches, further extends the usability of RuleKit-CS.  Experiments on over 130 data sets from various areas and detailed analys",
    "link": "http://arxiv.org/abs/2204.00497",
    "total_tokens": 963,
    "translated_title": "分离征服启发式算法允许在分类、回归和生存数据中进行强大的对比集挖掘",
    "translated_abstract": "识别群体之间的差异是最重要的知识发现问题之一。该过程，也称为对比集挖掘，在医学、工业或经济等广泛领域中应用。在本文中，我们提出了RuleKit-CS，一种基于分离征服的对比集挖掘算法——一种用于决策规则归纳的成熟启发式算法。多次通过伴随属性惩罚方案提供描述具有不同属性的相同示例的对比集，区别于标准的分离征服。该算法还被推广到回归和生存数据，允许识别标签属性/生存预测与预定义对比组的标签/预测一致的对比集。这个特性，不是现有方法所提供的，进一步扩展了RuleKit-CS的可用性。在来自各个领域的130多个数据集上进行的实验和详细分析。",
    "tldr": "本文提出了一种基于分离征服的对比集挖掘算法RuleKit-CS，该算法通过多次通过伴随属性惩罚方案提供描述具有不同属性的相同示例的对比集，区别于标准的分离征服。该算法还被推广到回归和生存数据，允许识别标签属性/生存预测与预定义对比组的标签/预测一致的对比集。",
    "en_tldr": "This paper proposes a contrast set mining algorithm, RuleKit-CS, based on the separate and conquer heuristic, which provides contrast sets describing the same examples with different attributes through multiple passes accompanied with an attribute penalization scheme. The algorithm is also generalized for regression and survival data, allowing identification of contrast sets whose label attribute/survival prognosis is consistent with the label/prognosis for the predefined contrast groups."
}