{
    "title": "Simulate Time-integrated Coarse-grained Molecular Dynamics with Multi-Scale Graph Networks. (arXiv:2204.10348v3 [cs.LG] UPDATED)",
    "abstract": "Molecular dynamics (MD) simulation is essential for various scientific domains but computationally expensive. Learning-based force fields have made significant progress in accelerating ab-initio MD simulation but are not fast enough for many real-world applications due to slow inference for large systems and small time steps (femtosecond-level). We aim to address these challenges by learning a multi-scale graph neural network that directly simulates coarse-grained MD with a very large time step (nanosecond-level) and a novel refinement module based on diffusion models to mitigate simulation instability. The effectiveness of our method is demonstrated in two complex systems: single-chain coarse-grained polymers and multi-component Li-ion polymer electrolytes. For evaluation, we simulate trajectories much longer than the training trajectories for systems with different chemical compositions that the model is not trained on. Structural and dynamical properties can be accurately recovered ",
    "link": "http://arxiv.org/abs/2204.10348",
    "context": "Title: Simulate Time-integrated Coarse-grained Molecular Dynamics with Multi-Scale Graph Networks. (arXiv:2204.10348v3 [cs.LG] UPDATED)\nAbstract: Molecular dynamics (MD) simulation is essential for various scientific domains but computationally expensive. Learning-based force fields have made significant progress in accelerating ab-initio MD simulation but are not fast enough for many real-world applications due to slow inference for large systems and small time steps (femtosecond-level). We aim to address these challenges by learning a multi-scale graph neural network that directly simulates coarse-grained MD with a very large time step (nanosecond-level) and a novel refinement module based on diffusion models to mitigate simulation instability. The effectiveness of our method is demonstrated in two complex systems: single-chain coarse-grained polymers and multi-component Li-ion polymer electrolytes. For evaluation, we simulate trajectories much longer than the training trajectories for systems with different chemical compositions that the model is not trained on. Structural and dynamical properties can be accurately recovered ",
    "path": "papers/22/04/2204.10348.json",
    "total_tokens": 950,
    "translated_title": "模拟时间积分的粗粒化分子动力学与多尺度图网络",
    "translated_abstract": "分子动力学（MD）模拟对于各种科学领域至关重要，但计算成本很高。基于学习的力场在加速从头算MD模拟方面取得了显著进展，但对于大系统和小时间步长（飞秒级）的实际应用来说推理速度仍然太慢。我们旨在通过学习一个多尺度图神经网络，直接模拟粗粒化MD，使用非常大的时间步长（纳秒级），并基于扩散模型的新颖细化模块来减轻模拟不稳定性。我们的方法在两个复杂系统中得到了验证：单链粗粒化聚合物和多组分锂离子聚合物电解质。为了评估，我们模拟了比训练轨迹长得多的轨迹，适用于模型未经训练的具有不同化学组成的系统。结构和动力学性质可以准确恢复。",
    "tldr": "本论文提出了一种学习多尺度图神经网络的方法，通过直接模拟粗粒化分子动力学来加速模拟过程，使用非常大的时间步长和新颖的细化模块来提高稳定性。在两个复杂系统中进行的实验表明该方法在不同化学组成的系统中可以准确恢复结构和动力学性质。"
}