{
    "title": "COVID-Net Biochem: An Explainability-driven Framework to Building Machine Learning Models for Predicting Survival and Kidney Injury of COVID-19 Patients from Clinical and Biochemistry Data. (arXiv:2204.11210v2 [cs.LG] UPDATED)",
    "abstract": "Since the World Health Organization declared COVID-19 a pandemic in 2020, the global community has faced ongoing challenges in controlling and mitigating the transmission of the SARS-CoV-2 virus, as well as its evolving subvariants and recombinants. A significant challenge during the pandemic has not only been the accurate detection of positive cases but also the efficient prediction of risks associated with complications and patient survival probabilities. These tasks entail considerable clinical resource allocation and attention.In this study, we introduce COVID-Net Biochem, a versatile and explainable framework for constructing machine learning models. We apply this framework to predict COVID-19 patient survival and the likelihood of developing Acute Kidney Injury during hospitalization, utilizing clinical and biochemical data in a transparent, systematic approach. The proposed approach advances machine learning model design by seamlessly integrating domain expertise with explainabi",
    "link": "http://arxiv.org/abs/2204.11210",
    "context": "Title: COVID-Net Biochem: An Explainability-driven Framework to Building Machine Learning Models for Predicting Survival and Kidney Injury of COVID-19 Patients from Clinical and Biochemistry Data. (arXiv:2204.11210v2 [cs.LG] UPDATED)\nAbstract: Since the World Health Organization declared COVID-19 a pandemic in 2020, the global community has faced ongoing challenges in controlling and mitigating the transmission of the SARS-CoV-2 virus, as well as its evolving subvariants and recombinants. A significant challenge during the pandemic has not only been the accurate detection of positive cases but also the efficient prediction of risks associated with complications and patient survival probabilities. These tasks entail considerable clinical resource allocation and attention.In this study, we introduce COVID-Net Biochem, a versatile and explainable framework for constructing machine learning models. We apply this framework to predict COVID-19 patient survival and the likelihood of developing Acute Kidney Injury during hospitalization, utilizing clinical and biochemical data in a transparent, systematic approach. The proposed approach advances machine learning model design by seamlessly integrating domain expertise with explainabi",
    "path": "papers/22/04/2204.11210.json",
    "total_tokens": 937,
    "translated_title": "COVID-Net生化：基于可解释性的框架构建机器学习模型，用于预测COVID-19患者的生存和肾损伤状况的临床和生化数据",
    "translated_abstract": "自从世界卫生组织在2020年宣布COVID-19为全球大流行病以来，全球社会一直面临着控制和缓解SARS-CoV-2病毒及其不断进化的亚型和重组物传播的持续挑战。在大流行期间的一个重要挑战不仅是准确检测阳性病例，还包括高效预测并发症风险和患者生存概率。这些任务需要相当量的临床资源分配和关注。在本研究中，我们介绍了COVID-Net生化，这是一个灵活且可解释的框架，用于构建机器学习模型。我们使用临床和生化数据以透明、系统的方式，利用这个框架来预测COVID-19患者的生存和住院期间发展急性肾损伤的可能性。所提出的方法通过将领域专业知识与可解释性方法无缝集成，推进了机器学习模型设计的发展。",
    "tldr": "COVID-Net Biochem是一个可解释的框架，通过整合领域专业知识，利用临床和生化数据来预测COVID-19患者的生存和肾损伤风险。",
    "en_tdlr": "COVID-Net Biochem is an explainable framework that integrates domain expertise and utilizes clinical and biochemical data to predict the survival and kidney injury risk of COVID-19 patients."
}