{
    "title": "Detection of Small Holes by the Scale-Invariant Robust Density-Aware Distance (RDAD) Filtration",
    "abstract": "arXiv:2204.07821v3 Announce Type: replace-cross  Abstract: A novel topological-data-analytical (TDA) method is proposed to distinguish, from noise, small holes surrounded by high-density regions of a probability density function. The proposed method is robust against additive noise and outliers. Traditional TDA tools, like those based on the distance filtration, often struggle to distinguish small features from noise, because both have short persistences. An alternative filtration, called the Robust Density-Aware Distance (RDAD) filtration, is proposed to prolong the persistences of small holes of high-density regions. This is achieved by weighting the distance function by the density in the sense of Bell et al. The concept of distance-to-measure is incorporated to enhance stability and mitigate noise. The persistence-prolonging property and robustness of the proposed filtration are rigorously established, and numerical experiments are presented to demonstrate the proposed filtration's",
    "link": "https://arxiv.org/abs/2204.07821",
    "context": "Title: Detection of Small Holes by the Scale-Invariant Robust Density-Aware Distance (RDAD) Filtration\nAbstract: arXiv:2204.07821v3 Announce Type: replace-cross  Abstract: A novel topological-data-analytical (TDA) method is proposed to distinguish, from noise, small holes surrounded by high-density regions of a probability density function. The proposed method is robust against additive noise and outliers. Traditional TDA tools, like those based on the distance filtration, often struggle to distinguish small features from noise, because both have short persistences. An alternative filtration, called the Robust Density-Aware Distance (RDAD) filtration, is proposed to prolong the persistences of small holes of high-density regions. This is achieved by weighting the distance function by the density in the sense of Bell et al. The concept of distance-to-measure is incorporated to enhance stability and mitigate noise. The persistence-prolonging property and robustness of the proposed filtration are rigorously established, and numerical experiments are presented to demonstrate the proposed filtration's",
    "path": "papers/22/04/2204.07821.json",
    "total_tokens": 891,
    "translated_title": "通过标度不变的鲁棒密度感知距离（RDAD）过滤检测小孔",
    "translated_abstract": "提出了一种新颖的拓扑数据分析（TDA）方法，用于区分概率密度函数中被高密度区域包围的小孔与噪声。该方法对附加噪声和异常值具有鲁棒性。传统的TDA工具，如基于距离过滤的工具，通常难以区分小特征和噪声，因为两者的持续时间较短。提出了一种名为鲁棒密度感知距离（RDAD）过滤的备用过滤，用于延长高密度区域的小孔的持续时间。这是通过根据Bell等人的观点将距离函数加权密度实现的。引入了距离-测度的概念以增强稳定性和减少噪声。提出过滤的持续时间延长性和鲁棒性得到了严格论证，并提供了数值实验以证明所提过滤的有效性。",
    "tldr": "通过引入鲁棒密度感知距离（RDAD）过滤，该方法能够在概率密度函数中准确区分被高密度区域包围的小孔，对噪声和异常值具有鲁棒性。",
    "en_tdlr": "The method proposed can accurately distinguish small holes surrounded by high-density regions in a probability density function by introducing the Robust Density-Aware Distance (RDAD) filtration, showing robustness against noise and outliers."
}