{
    "title": "Heterogeneous Treatment Effect Bounds under Sample Selection with an Application to the Effects of Social Media on Political Polarization. (arXiv:2209.04329v3 [econ.EM] UPDATED)",
    "abstract": "We propose a method for estimation and inference for bounds for heterogeneous causal effect parameters in general sample selection models where the treatment can affect whether an outcome is observed and no exclusion restrictions are available. The method provides conditional effect bounds as functions of policy relevant pre-treatment variables. It allows for conducting valid statistical inference on the unidentified conditional effects. We use a flexible debiased/double machine learning approach that can accommodate non-linear functional forms and high-dimensional confounders. Easily verifiable high-level conditions for estimation, misspecification robust confidence intervals, and uniform confidence bands are provided as well. Re-analyzing data from a large scale field experiment on Facebook, we find significant depolarization effects of counter-attitudinal news subscription nudges. The effect bounds are highly heterogeneous and suggest strong depolarization effects for moderates, con",
    "link": "http://arxiv.org/abs/2209.04329",
    "context": "Title: Heterogeneous Treatment Effect Bounds under Sample Selection with an Application to the Effects of Social Media on Political Polarization. (arXiv:2209.04329v3 [econ.EM] UPDATED)\nAbstract: We propose a method for estimation and inference for bounds for heterogeneous causal effect parameters in general sample selection models where the treatment can affect whether an outcome is observed and no exclusion restrictions are available. The method provides conditional effect bounds as functions of policy relevant pre-treatment variables. It allows for conducting valid statistical inference on the unidentified conditional effects. We use a flexible debiased/double machine learning approach that can accommodate non-linear functional forms and high-dimensional confounders. Easily verifiable high-level conditions for estimation, misspecification robust confidence intervals, and uniform confidence bands are provided as well. Re-analyzing data from a large scale field experiment on Facebook, we find significant depolarization effects of counter-attitudinal news subscription nudges. The effect bounds are highly heterogeneous and suggest strong depolarization effects for moderates, con",
    "path": "papers/22/09/2209.04329.json",
    "total_tokens": 984,
    "tldr": "本文提出了一种推断异质因果效应参数边界的估计方法，用于处理处理可能影响是否观察到结果的一般样本选择模型，提供了政策前处理变量函数的条件效应边界，重新分析了一项关于Facebook的大规模现场实验数据，结果发现了反态度新闻订阅推动的显著去极化效应。",
    "en_tdlr": "This paper proposes a method for estimation and inference for bounds for heterogeneous causal effect parameters in general sample selection models where the treatment can affect whether an outcome is observed and no exclusion restrictions are available. The method provides conditional effect bounds as functions of policy relevant pre-treatment variables, and was re-analyzing data from a large scale field experiment on Facebook, which resulted in significant depolarization effects of counter-attitudinal news subscription nudges."
}