{
    "title": "USE-Evaluator: Performance Metrics for Medical Image Segmentation Models with Uncertain, Small or Empty Reference Annotations. (arXiv:2209.13008v4 [eess.IV] UPDATED)",
    "abstract": "Performance metrics for medical image segmentation models are used to measure the agreement between the reference annotation and the predicted segmentation. Usually, overlap metrics, such as the Dice, are used as a metric to evaluate the performance of these models in order for results to be comparable. However, there is a mismatch between the distributions of cases and difficulty level of segmentation tasks in public data sets compared to clinical practice. Common metrics fail to measure the impact of this mismatch, especially for clinical data sets that include low signal pathologies, a difficult segmentation task, and uncertain, small, or empty reference annotations. This limitation may result in ineffective research of machine learning practitioners in designing and optimizing models. Dimensions of evaluating clinical value include consideration of the uncertainty of reference annotations, independence from reference annotation volume size, and evaluation of classification of empty",
    "link": "http://arxiv.org/abs/2209.13008",
    "context": "Title: USE-Evaluator: Performance Metrics for Medical Image Segmentation Models with Uncertain, Small or Empty Reference Annotations. (arXiv:2209.13008v4 [eess.IV] UPDATED)\nAbstract: Performance metrics for medical image segmentation models are used to measure the agreement between the reference annotation and the predicted segmentation. Usually, overlap metrics, such as the Dice, are used as a metric to evaluate the performance of these models in order for results to be comparable. However, there is a mismatch between the distributions of cases and difficulty level of segmentation tasks in public data sets compared to clinical practice. Common metrics fail to measure the impact of this mismatch, especially for clinical data sets that include low signal pathologies, a difficult segmentation task, and uncertain, small, or empty reference annotations. This limitation may result in ineffective research of machine learning practitioners in designing and optimizing models. Dimensions of evaluating clinical value include consideration of the uncertainty of reference annotations, independence from reference annotation volume size, and evaluation of classification of empty",
    "path": "papers/22/09/2209.13008.json",
    "total_tokens": 853,
    "translated_title": "USE-Evaluator: 带有不确定、小型或空白参考注释的医学图像分割模型的性能度量",
    "translated_abstract": "用于医学图像分割模型的性能度量主要用于衡量参考注释与预测分割之间的一致性。通常使用重叠度量，例如Dice系数，作为评估模型性能的指标，以便结果具有可比性。然而，公共数据集中的病例分布和分割任务难度与临床实践存在不匹配之处。常规指标未能衡量到这种不匹配的影响，特别是针对包含低信号病理、难度较大的分割任务以及不确定、小型或空白参考注释的临床数据集。这一限制可能导致机器学习从业者在设计和优化模型时效果不佳。评估临床价值的维度包括考虑参考注释的不确定性、与参考注释体积大小的独立性以及对空白分类的评估。",
    "tldr": "USE-Evaluator是一种用于医学图像分割模型的性能度量方法，可以解决由于参考注释不确定、小型或空白导致的常规指标无法适用于临床数据集的问题。",
    "en_tdlr": "USE-Evaluator is a performance metric method for medical image segmentation models, which addresses the issue that conventional metrics fail to work for clinical datasets due to uncertain, small, or empty reference annotations."
}