{
    "title": "Extremely Simple Activation Shaping for Out-of-Distribution Detection. (arXiv:2209.09858v2 [cs.LG] UPDATED)",
    "abstract": "The separation between training and deployment of machine learning models implies that not all scenarios encountered in deployment can be anticipated during training, and therefore relying solely on advancements in training has its limits. Out-of-distribution (OOD) detection is an important area that stress-tests a model's ability to handle unseen situations: Do models know when they don't know? Existing OOD detection methods either incur extra training steps, additional data or make nontrivial modifications to the trained network. In contrast, in this work, we propose an extremely simple, post-hoc, on-the-fly activation shaping method, ASH, where a large portion (e.g. 90%) of a sample's activation at a late layer is removed, and the rest (e.g. 10%) simplified or lightly adjusted. The shaping is applied at inference time, and does not require any statistics calculated from training data. Experiments show that such a simple treatment enhances in-distribution and out-of-distribution dist",
    "link": "http://arxiv.org/abs/2209.09858",
    "context": "Title: Extremely Simple Activation Shaping for Out-of-Distribution Detection. (arXiv:2209.09858v2 [cs.LG] UPDATED)\nAbstract: The separation between training and deployment of machine learning models implies that not all scenarios encountered in deployment can be anticipated during training, and therefore relying solely on advancements in training has its limits. Out-of-distribution (OOD) detection is an important area that stress-tests a model's ability to handle unseen situations: Do models know when they don't know? Existing OOD detection methods either incur extra training steps, additional data or make nontrivial modifications to the trained network. In contrast, in this work, we propose an extremely simple, post-hoc, on-the-fly activation shaping method, ASH, where a large portion (e.g. 90%) of a sample's activation at a late layer is removed, and the rest (e.g. 10%) simplified or lightly adjusted. The shaping is applied at inference time, and does not require any statistics calculated from training data. Experiments show that such a simple treatment enhances in-distribution and out-of-distribution dist",
    "path": "papers/22/09/2209.09858.json",
    "total_tokens": 795,
    "translated_title": "极其简单的激活形状法用于识别离群点",
    "translated_abstract": "机器学习模型在训练和部署之间的区别意味着无法预测部署中可能遇到的所有情况，因此仅依靠训练的进步具有其局限性。本文提出了一种极其简单的后处理激活形状方法ASH，可以应用于模型训练后的网络，用于离群点检测。该方法在推理时应用，不需要从训练数据中计算任何统计数据。实验表明，这种简单的处理可以增强正常数据和异常数据的区分能力。",
    "tldr": "该论文提出了一种极其简单的后处理激活形状方法ASH，用于离群点检测，该方法不需要额外的训练步骤、额外的数据或对训练网络进行非常规修改，就能增强模型对未知情况的处理能力。"
}