{
    "title": "Literature Review of the Recent Trends and Applications in various Fuzzy Rule based systems. (arXiv:2209.07175v2 [cs.AI] UPDATED)",
    "abstract": "Fuzzy rule based systems (FRBSs) is a rule-based system which uses linguistic fuzzy variables as antecedents and consequent to represent human understandable knowledge. They have been applied to various applications and areas throughout the soft computing literature. However, FRBSs suffers from many drawbacks such as uncertainty representation, high number of rules, interpretability loss, high computational time for learning etc. To overcome these issues with FRBSs, there exists many extensions of FRBSs. This paper presents an overview and literature review of recent trends on various types and prominent areas of fuzzy systems (FRBSs) namely genetic fuzzy system (GFS), hierarchical fuzzy system (HFS), neuro fuzzy system (NFS), evolving fuzzy system (eFS), FRBSs for big data, FRBSs for imbalanced data, interpretability in FRBSs and FRBSs which use cluster centroids as fuzzy rules. The review is for years 2010-2021. This paper also highlights important contributions, publication statisti",
    "link": "http://arxiv.org/abs/2209.07175",
    "context": "Title: Literature Review of the Recent Trends and Applications in various Fuzzy Rule based systems. (arXiv:2209.07175v2 [cs.AI] UPDATED)\nAbstract: Fuzzy rule based systems (FRBSs) is a rule-based system which uses linguistic fuzzy variables as antecedents and consequent to represent human understandable knowledge. They have been applied to various applications and areas throughout the soft computing literature. However, FRBSs suffers from many drawbacks such as uncertainty representation, high number of rules, interpretability loss, high computational time for learning etc. To overcome these issues with FRBSs, there exists many extensions of FRBSs. This paper presents an overview and literature review of recent trends on various types and prominent areas of fuzzy systems (FRBSs) namely genetic fuzzy system (GFS), hierarchical fuzzy system (HFS), neuro fuzzy system (NFS), evolving fuzzy system (eFS), FRBSs for big data, FRBSs for imbalanced data, interpretability in FRBSs and FRBSs which use cluster centroids as fuzzy rules. The review is for years 2010-2021. This paper also highlights important contributions, publication statisti",
    "path": "papers/22/09/2209.07175.json",
    "total_tokens": 995,
    "translated_title": "多种模糊规则系统的最新趋势和应用的文献综述",
    "translated_abstract": "模糊规则系统（FRBS）是一种基于规则的系统，它使用语言模糊变量作为前提和结论来表示人可理解的知识。它们已经应用于软计算文献中的各个应用和领域。然而，FRBS面临许多缺点，例如不确定性表示，规则数量过多，解释能力丧失，学习所需的计算时间长等。为了克服FRBS的这些问题，存在许多FRBS的扩展。本文概述和文献综述了模糊系统（FRBS）的各种类型和突出领域的最新趋势，包括遗传模糊系统（GFS）、层级模糊系统（HFS）、神经模糊系统（NFS）、进化模糊系统（eFS）、用于大数据的FRBS、用于不平衡数据的FRBS、FRBS中的可解释性以及将聚类中心用作模糊规则的FRBS。综述的时间范围为2010年至2021年。本文还强调了重要的贡献、出版统计数据等。",
    "tldr": "本文综述了模糊规则系统的最新趋势和应用，包括GFS、HFS、NFS、eFS、用于大数据和不平衡数据的FRBS以及可解释性和使用聚类中心作为模糊规则的FRBS。重点突出其重要贡献和出版统计数据。",
    "en_tdlr": "This paper reviews recent trends and applications in a variety of fuzzy rule-based systems, including GFS, HFS, NFS, eFS, FRBSs for big and imbalanced data, interpretability in FRBSs, and FRBSs that use cluster centroids as fuzzy rules. Important contributions and publication statistics are highlighted."
}