{
    "title": "clusterBMA: Bayesian model averaging for clustering. (arXiv:2209.04117v2 [stat.ME] UPDATED)",
    "abstract": "Various methods have been developed to combine inference across multiple sets of results for unsupervised clustering, within the ensemble clustering literature. The approach of reporting results from one `best' model out of several candidate clustering models generally ignores the uncertainty that arises from model selection, and results in inferences that are sensitive to the particular model and parameters chosen. Bayesian model averaging (BMA) is a popular approach for combining results across multiple models that offers some attractive benefits in this setting, including probabilistic interpretation of the combined cluster structure and quantification of model-based uncertainty.  In this work we introduce clusterBMA, a method that enables weighted model averaging across results from multiple unsupervised clustering algorithms. We use clustering internal validation criteria to develop an approximation of the posterior model probability, used for weighting the results from each model",
    "link": "http://arxiv.org/abs/2209.04117",
    "context": "Title: clusterBMA: Bayesian model averaging for clustering. (arXiv:2209.04117v2 [stat.ME] UPDATED)\nAbstract: Various methods have been developed to combine inference across multiple sets of results for unsupervised clustering, within the ensemble clustering literature. The approach of reporting results from one `best' model out of several candidate clustering models generally ignores the uncertainty that arises from model selection, and results in inferences that are sensitive to the particular model and parameters chosen. Bayesian model averaging (BMA) is a popular approach for combining results across multiple models that offers some attractive benefits in this setting, including probabilistic interpretation of the combined cluster structure and quantification of model-based uncertainty.  In this work we introduce clusterBMA, a method that enables weighted model averaging across results from multiple unsupervised clustering algorithms. We use clustering internal validation criteria to develop an approximation of the posterior model probability, used for weighting the results from each model",
    "path": "papers/22/09/2209.04117.json",
    "total_tokens": 820,
    "translated_title": "clusterBMA：用于聚类的贝叶斯模型平均法",
    "translated_abstract": "在组合聚类文献中，已经开发了各种方法来组合跨多个结果集的推断，以进行非监督聚类。通过从多个候选聚类模型中报告单个“最佳”模型的结果的方法通常忽略了由模型选择带来的不确定性，并且会产生对特定模型和参数敏感的推断。贝叶斯模型平均（BMA）是一种流行的方法，可用于在多个模型之间组合结果，并且在这种设置中提供了一些有吸引力的优点，包括组合聚类结构的概率解释和基于模型的不确定性的量化。在这项工作中，我们介绍了clusterBMA，一种使多个非监督聚类算法的结果进行加权模型平均的方法。我们使用聚类内部验证标准开发了后验模型概率的近似，用于加权每个模型的结果。",
    "tldr": "clusterBMA是一种结合多个非监督聚类算法结果的贝叶斯模型平均法，提供了组合聚类结构的概率解释和模型不确定性的量化。",
    "en_tdlr": "clusterBMA is a Bayesian model averaging method that combines results from multiple unsupervised clustering algorithms, offering probability interpretation of the combined cluster structure and quantification of model-based uncertainty."
}