{
    "title": "SynthA1c: Towards Clinically Interpretable Patient Representations for Diabetes Risk Stratification. (arXiv:2209.10043v2 [cs.LG] UPDATED)",
    "abstract": "Early diagnosis of Type 2 Diabetes Mellitus (T2DM) is crucial to enable timely therapeutic interventions and lifestyle modifications. As the time available for clinical office visits shortens and medical imaging data become more widely available, patient image data could be used to opportunistically identify patients for additional T2DM diagnostic workup by physicians. We investigated whether image-derived phenotypic data could be leveraged in tabular learning classifier models to predict T2DM risk in an automated fashion to flag high-risk patients without the need for additional blood laboratory measurements. In contrast to traditional binary classifiers, we leverage neural networks and decision tree models to represent patient data as 'SynthA1c' latent variables, which mimic blood hemoglobin A1c empirical lab measurements, that achieve sensitivities as high as 87.6%. To evaluate how SynthA1c models may generalize to other patient populations, we introduce a novel generalizable metric",
    "link": "http://arxiv.org/abs/2209.10043",
    "context": "Title: SynthA1c: Towards Clinically Interpretable Patient Representations for Diabetes Risk Stratification. (arXiv:2209.10043v2 [cs.LG] UPDATED)\nAbstract: Early diagnosis of Type 2 Diabetes Mellitus (T2DM) is crucial to enable timely therapeutic interventions and lifestyle modifications. As the time available for clinical office visits shortens and medical imaging data become more widely available, patient image data could be used to opportunistically identify patients for additional T2DM diagnostic workup by physicians. We investigated whether image-derived phenotypic data could be leveraged in tabular learning classifier models to predict T2DM risk in an automated fashion to flag high-risk patients without the need for additional blood laboratory measurements. In contrast to traditional binary classifiers, we leverage neural networks and decision tree models to represent patient data as 'SynthA1c' latent variables, which mimic blood hemoglobin A1c empirical lab measurements, that achieve sensitivities as high as 87.6%. To evaluate how SynthA1c models may generalize to other patient populations, we introduce a novel generalizable metric",
    "path": "papers/22/09/2209.10043.json",
    "total_tokens": 939,
    "translated_title": "SynthA1c:针对糖尿病风险分层的临床解释型患者表示方法",
    "translated_abstract": "及时诊断2型糖尿病(T2DM)对于启动及时的治疗干预和生活方式改变至关重要。随着临床诊所访问时间的缩短和医学影像数据的广泛应用，可以利用患者图像数据机会性地通过医生对T2DM进行额外诊断工作。我们研究了是否可以利用图像衍生的表型数据在表格学习分类器模型中预测T2DM风险，以自动地确定高风险患者，而不需要额外的血液实验室测试。与传统的二分类器相比，我们利用神经网络和决策树模型将患者数据表示为“SynthA1c”潜在变量，这些变量模拟了血红蛋白A1c的经验实验室测量结果，其敏感性高达87.6%。为了评估SynthA1c模型在其他患者群体中的泛化能力，我们引入了一种新颖的可推广度量。",
    "tldr": "该论文提出了一种名为SynthA1c的方法，利用图像数据来预测2型糖尿病风险，避免了额外的血液实验室测量，其敏感性高达87.6%。"
}