{
    "title": "Learning When to Advise Human Decision Makers. (arXiv:2209.13578v2 [cs.AI] UPDATED)",
    "abstract": "Artificial intelligence (AI) systems are increasingly used for providing advice to facilitate human decision making in a wide range of domains, such as healthcare, criminal justice, and finance. Motivated by limitations of the current practice where algorithmic advice is provided to human users as a constant element in the decision-making pipeline, in this paper we raise the question of when should algorithms provide advice? We propose a novel design of AI systems in which the algorithm interacts with the human user in a two-sided manner and aims to provide advice only when it is likely to be beneficial for the user in making their decision. The results of a large-scale experiment show that our advising approach manages to provide advice at times of need and to significantly improve human decision making compared to fixed, non-interactive, advising approaches. This approach has additional advantages in facilitating human learning, preserving complementary strengths of human decision ma",
    "link": "http://arxiv.org/abs/2209.13578",
    "context": "Title: Learning When to Advise Human Decision Makers. (arXiv:2209.13578v2 [cs.AI] UPDATED)\nAbstract: Artificial intelligence (AI) systems are increasingly used for providing advice to facilitate human decision making in a wide range of domains, such as healthcare, criminal justice, and finance. Motivated by limitations of the current practice where algorithmic advice is provided to human users as a constant element in the decision-making pipeline, in this paper we raise the question of when should algorithms provide advice? We propose a novel design of AI systems in which the algorithm interacts with the human user in a two-sided manner and aims to provide advice only when it is likely to be beneficial for the user in making their decision. The results of a large-scale experiment show that our advising approach manages to provide advice at times of need and to significantly improve human decision making compared to fixed, non-interactive, advising approaches. This approach has additional advantages in facilitating human learning, preserving complementary strengths of human decision ma",
    "path": "papers/22/09/2209.13578.json",
    "total_tokens": 860,
    "translated_title": "学习什么时候为人类决策者提供建议",
    "translated_abstract": "人工智能系统越来越多地被用于提供建议，以促进在医疗、刑事司法和金融等各个领域的人类决策。我们提出一个新颖的人工智能系统设计，其中算法与人类用户以双向互动的方式交互，旨在仅在对用户的决策有益时提供建议。一项大规模实验的结果表明，与固定的非交互式建议方法相比，我们的建议方法能够在需要的时候提供建议，并显著改善人类的决策能力。这种方法在促进人类学习、保留人类决策的补充优势方面还具有额外的优势。",
    "tldr": "本文提出了一种新颖的人工智能系统设计，其中算法与人类用户以双向互动的方式交互，仅在对用户的决策有益时提供建议。实验证明，这种方法能够改善人类的决策能力，并在促进人类学习、保留人类决策的补充优势方面具有额外的优势。",
    "en_tdlr": "This paper proposes a novel design of AI systems where algorithms interact with human users in a two-sided manner and provide advice only when it is likely to be beneficial. The experimental results show that this approach improves human decision making and has additional advantages in facilitating human learning and preserving complementary strengths of human decision making."
}