{
    "title": "DiGress: Discrete Denoising diffusion for graph generation. (arXiv:2209.14734v4 [cs.LG] UPDATED)",
    "abstract": "This work introduces DiGress, a discrete denoising diffusion model for generating graphs with categorical node and edge attributes. Our model utilizes a discrete diffusion process that progressively edits graphs with noise, through the process of adding or removing edges and changing the categories. A graph transformer network is trained to revert this process, simplifying the problem of distribution learning over graphs into a sequence of node and edge classification tasks. We further improve sample quality by introducing a Markovian noise model that preserves the marginal distribution of node and edge types during diffusion, and by incorporating auxiliary graph-theoretic features. A procedure for conditioning the generation on graph-level features is also proposed. DiGress achieves state-of-the-art performance on molecular and non-molecular datasets, with up to 3x validity improvement on a planar graph dataset. It is also the first model to scale to the large GuacaMol dataset contain",
    "link": "http://arxiv.org/abs/2209.14734",
    "context": "Title: DiGress: Discrete Denoising diffusion for graph generation. (arXiv:2209.14734v4 [cs.LG] UPDATED)\nAbstract: This work introduces DiGress, a discrete denoising diffusion model for generating graphs with categorical node and edge attributes. Our model utilizes a discrete diffusion process that progressively edits graphs with noise, through the process of adding or removing edges and changing the categories. A graph transformer network is trained to revert this process, simplifying the problem of distribution learning over graphs into a sequence of node and edge classification tasks. We further improve sample quality by introducing a Markovian noise model that preserves the marginal distribution of node and edge types during diffusion, and by incorporating auxiliary graph-theoretic features. A procedure for conditioning the generation on graph-level features is also proposed. DiGress achieves state-of-the-art performance on molecular and non-molecular datasets, with up to 3x validity improvement on a planar graph dataset. It is also the first model to scale to the large GuacaMol dataset contain",
    "path": "papers/22/09/2209.14734.json",
    "total_tokens": 910,
    "translated_title": "DiGress：离散去噪扩散生成图",
    "translated_abstract": "本文提出了一个离散去噪扩散模型 DiGress，用于生成带有分类节点和边属性的图形。我们的模型利用离散扩散过程，通过添加或删除边缘和更改类别，逐步编辑带噪声的图形。训练了一个图形转换网络来反转此过程，将图形分布学习问题简化为一系列节点和边缘分类任务。我们通过引入保留扩散期间节点和边缘类型边际分布的马尔可夫噪声模型以及融合辅助图形特征来进一步改进样本质量。还提出了一种在图形级别特征上进行生成的过程。DiGress在分子和非分子数据集上实现了最新的性能，平面图数据集上的有效性提高了3倍。它也是第一个可扩展到大型 GuacaMol 数据集的模型。",
    "tldr": "DiGress是一种能生成带有分类节点和边属性的图形的离散去噪扩散模型，该模型在分子和非分子数据集上的性能达到了最新的水平，并在平面图数据集上提高了3倍的有效性。它还是第一个可扩展到大型 GuacaMol 数据集的模型。",
    "en_tdlr": "DiGress is a discrete denoising diffusion model that can generate graphs with categorical node and edge attributes. It achieves state-of-the-art performance on molecular and non-molecular datasets and improves validity by up to 3x on a planar graph dataset. Additionally, it is the first model to scale to the large GuacaMol dataset."
}