{
    "title": "Temporal Analysis on Topics Using Word2Vec. (arXiv:2209.11717v2 [cs.CL] UPDATED)",
    "abstract": "The present study proposes a novel method of trend detection and visualization - more specifically, modeling the change in a topic over time. Where current models used for the identification and visualization of trends only convey the popularity of a singular word based on stochastic counting of usage, the approach in the present study illustrates the popularity and direction that a topic is moving in. The direction in this case is a distinct subtopic within the selected corpus. Such trends are generated by modeling the movement of a topic by using k-means clustering and cosine similarity to group the distances between clusters over time. In a convergent scenario, it can be inferred that the topics as a whole are meshing (tokens between topics, becoming interchangeable). On the contrary, a divergent scenario would imply that each topics' respective tokens would not be found in the same context (the words are increasingly different to each other). The methodology was tested on a group o",
    "link": "http://arxiv.org/abs/2209.11717",
    "context": "Title: Temporal Analysis on Topics Using Word2Vec. (arXiv:2209.11717v2 [cs.CL] UPDATED)\nAbstract: The present study proposes a novel method of trend detection and visualization - more specifically, modeling the change in a topic over time. Where current models used for the identification and visualization of trends only convey the popularity of a singular word based on stochastic counting of usage, the approach in the present study illustrates the popularity and direction that a topic is moving in. The direction in this case is a distinct subtopic within the selected corpus. Such trends are generated by modeling the movement of a topic by using k-means clustering and cosine similarity to group the distances between clusters over time. In a convergent scenario, it can be inferred that the topics as a whole are meshing (tokens between topics, becoming interchangeable). On the contrary, a divergent scenario would imply that each topics' respective tokens would not be found in the same context (the words are increasingly different to each other). The methodology was tested on a group o",
    "path": "papers/22/09/2209.11717.json",
    "total_tokens": 880,
    "translated_title": "使用Word2Vec进行主题的时间分析",
    "translated_abstract": "本研究提出了一种新颖的趋势检测和可视化方法，具体来说，是对主题随时间变化进行建模。目前用于识别和可视化趋势的模型仅基于使用的随机计数来传达单词的流行程度，而本研究的方法则展示了主题的流行程度和发展方向。在本案例中，这个方向是所选语料库中的一个独特子主题。这些趋势是通过使用k均值聚类和余弦相似度对簇之间的距离进行分组来建模主题的移动而产生的。在收敛的情况下，可以推断整体主题正在融合（主题之间的标记变得可互换）。相反，分散的情况则意味着每个主题的标记在相同的上下文中不会被发现（单词之间越来越不同）。该方法在一个群体上进行了测试",
    "tldr": "本研究提出了一种使用Word2Vec进行主题的时间分析的新方法，该方法通过建模主题的移动并利用k均值聚类和余弦相似度对距离进行分组，实现了识别和可视化主题随时间变化的趋势。"
}