{
    "title": "Pathway to Future Symbiotic Creativity. (arXiv:2209.02388v2 [cs.AI] UPDATED)",
    "abstract": "This report presents a comprehensive view of our vision on the development path of the human-machine symbiotic art creation. We propose a classification of the creative system with a hierarchy of 5 classes, showing the pathway of creativity evolving from a mimic-human artist (Turing Artists) to a Machine artist in its own right. We begin with an overview of the limitations of the Turing Artists then focus on the top two-level systems, Machine Artists, emphasizing machine-human communication in art creation. In art creation, it is necessary for machines to understand humans' mental states, including desires, appreciation, and emotions, humans also need to understand machines' creative capabilities and limitations. The rapid development of immersive environment and further evolution into the new concept of metaverse enable symbiotic art creation through unprecedented flexibility of bi-directional communication between artists and art manifestation environments. By examining the latest se",
    "link": "http://arxiv.org/abs/2209.02388",
    "context": "Title: Pathway to Future Symbiotic Creativity. (arXiv:2209.02388v2 [cs.AI] UPDATED)\nAbstract: This report presents a comprehensive view of our vision on the development path of the human-machine symbiotic art creation. We propose a classification of the creative system with a hierarchy of 5 classes, showing the pathway of creativity evolving from a mimic-human artist (Turing Artists) to a Machine artist in its own right. We begin with an overview of the limitations of the Turing Artists then focus on the top two-level systems, Machine Artists, emphasizing machine-human communication in art creation. In art creation, it is necessary for machines to understand humans' mental states, including desires, appreciation, and emotions, humans also need to understand machines' creative capabilities and limitations. The rapid development of immersive environment and further evolution into the new concept of metaverse enable symbiotic art creation through unprecedented flexibility of bi-directional communication between artists and art manifestation environments. By examining the latest se",
    "path": "papers/22/09/2209.02388.json",
    "total_tokens": 951,
    "translated_title": "未来共生创造的路径",
    "translated_abstract": "本报告提出了我们对人机共生艺术创作发展路径的全面观点。我们提出了一个创造系统的分类，其中包括5个层级，展示了创造力从模仿人类艺术家（图灵艺术家）逐渐发展为具备独立创作能力的机器艺术家的路径。我们首先概述了图灵艺术家的局限性，然后重点关注了顶层的两级系统，机器艺术家，强调了机器与人类在艺术创作中的交流。在艺术创作中，机器需要理解人类的心理状态，包括欲望、欣赏和情感，而人类也需要理解机器的创造能力和局限性。沉浸式环境的快速发展以及进一步演变成元宇宙的新概念，为艺术家与艺术表现环境之间的双向沟通提供了前所未有的灵活性，实现了共生艺术创作。通过研究最新的...",
    "tldr": "本文提出了人机共生艺术创作的发展路径，从模仿人类艺术家逐渐发展为具备独立创作能力的机器艺术家。在这条路径上，需要机器理解人类的心理状态，并通过沉浸式环境和元宇宙的发展实现双向沟通，以实现共生艺术创作。",
    "en_tdlr": "This paper presents the development path of human-machine symbiotic art creation, progressing from mimicking human artists to machine artists with independent creative abilities. Along this path, machines need to understand human mental states and achieve bi-directional communication through immersive environments and the evolution of the metaverse, enabling symbiotic art creation."
}