{
    "title": "Efficient multi-relational network representation using primes. (arXiv:2209.06575v2 [cs.LG] UPDATED)",
    "abstract": "In this work, we propose a novel representation of complex multi-relational networks, which is compact and allows very efficient network analysis. Multi-relational networks capture complex data relationships and have a variety of applications, ranging from biomedical to financial, social, etc. As they get to be used with ever larger quantities of data, it is crucial to find efficient ways to represent and analyse such networks. This paper introduces the concept of Prime Adjacency Matrices (PAMs), which utilize prime numbers, to represent the relations of the network. Due to the fundamental theorem of arithmetic, this allows for a lossless, compact representation of a complete multi-relational graph, using a single adjacency matrix. Moreover, this representation enables the fast computation of multi-hop adjacency matrices, which can be useful for a variety of downstream tasks. We illustrate the benefits of using the proposed approach through various simple and complex network analysis t",
    "link": "http://arxiv.org/abs/2209.06575",
    "context": "Title: Efficient multi-relational network representation using primes. (arXiv:2209.06575v2 [cs.LG] UPDATED)\nAbstract: In this work, we propose a novel representation of complex multi-relational networks, which is compact and allows very efficient network analysis. Multi-relational networks capture complex data relationships and have a variety of applications, ranging from biomedical to financial, social, etc. As they get to be used with ever larger quantities of data, it is crucial to find efficient ways to represent and analyse such networks. This paper introduces the concept of Prime Adjacency Matrices (PAMs), which utilize prime numbers, to represent the relations of the network. Due to the fundamental theorem of arithmetic, this allows for a lossless, compact representation of a complete multi-relational graph, using a single adjacency matrix. Moreover, this representation enables the fast computation of multi-hop adjacency matrices, which can be useful for a variety of downstream tasks. We illustrate the benefits of using the proposed approach through various simple and complex network analysis t",
    "path": "papers/22/09/2209.06575.json",
    "total_tokens": 864,
    "translated_abstract": "本文提出了一种新颖的复杂多关系网络表示方法，它是紧凑的，可以进行非常有效的网络分析。多关系网络捕捉复杂的数据关系，并具有各种应用，从生物医学到金融、社交等等。随着它们被越来越多的数据使用，找到有效的表示和分析这样的网络是至关重要的。本文引入了质数邻接矩阵（PAM）的概念，利用质数来表示网络的关系。由于算术基本定理，这使得使用单个邻接矩阵对完整的多关系图进行无损、紧凑的表示成为可能。此外，这种表示方法使得可以快速计算多跳邻接矩阵，这对各种下游任务都非常有用。通过各种简单和复杂网络分析，我们展示了使用所提出的方法的好处。",
    "tldr": "本文提出了使用质数邻接矩阵（PAM）的概念来表示多关系网络，其具有紧凑、无损的优点，并且可以快速计算多跳邻接矩阵，从而实现了高效分析。"
}