{
    "title": "UCEpic: Unifying Aspect Planning and Lexical Constraints for Generating Explanations in Recommendation. (arXiv:2209.13885v2 [cs.AI] UPDATED)",
    "abstract": "Personalized natural language generation for explainable recommendations plays a key role in justifying why a recommendation might match a user's interests. Existing models usually control the generation process by aspect planning. While promising, these aspect-planning methods struggle to generate specific information correctly, which prevents generated explanations from being convincing. In this paper, we claim that introducing lexical constraints can alleviate the above issues. We propose a model, UCEpic, that generates high-quality personalized explanations for recommendation results by unifying aspect planning and lexical constraints in an insertion-based generation manner.  Methodologically, to ensure text generation quality and robustness to various lexical constraints, we pre-train a non-personalized text generator via our proposed robust insertion process. Then, to obtain personalized explanations under this framework of insertion-based generation, we design a method of incorp",
    "link": "http://arxiv.org/abs/2209.13885",
    "context": "Title: UCEpic: Unifying Aspect Planning and Lexical Constraints for Generating Explanations in Recommendation. (arXiv:2209.13885v2 [cs.AI] UPDATED)\nAbstract: Personalized natural language generation for explainable recommendations plays a key role in justifying why a recommendation might match a user's interests. Existing models usually control the generation process by aspect planning. While promising, these aspect-planning methods struggle to generate specific information correctly, which prevents generated explanations from being convincing. In this paper, we claim that introducing lexical constraints can alleviate the above issues. We propose a model, UCEpic, that generates high-quality personalized explanations for recommendation results by unifying aspect planning and lexical constraints in an insertion-based generation manner.  Methodologically, to ensure text generation quality and robustness to various lexical constraints, we pre-train a non-personalized text generator via our proposed robust insertion process. Then, to obtain personalized explanations under this framework of insertion-based generation, we design a method of incorp",
    "path": "papers/22/09/2209.13885.json",
    "total_tokens": 793,
    "translated_title": "UCEpic：统一考虑方面规划和词汇约束，生成解释型推荐",
    "translated_abstract": "为了对解释型推荐进行个性化自然语言生成，本文提出了一种将方面规划和词汇约束统一考虑的模型UCEpic，通过插入式生成的方式生成高质量个性化的推荐结果解释。通过在模型的预训练和个性化推荐生成过程中引入词汇约束，可以显著提高生成解释的流畅性、连贯性和匹配能力。实验结果表明，UCEpic方法在两个基准数据集上显著优于现有最先进方法。",
    "tldr": "UCEpic通过将方面规划和词汇约束统一考虑，提出了一种插入式生成的个性化解释型推荐模型，显著提高了解释的流畅性、连贯性和匹配能力。",
    "en_tdlr": "UCEpic proposes a unified model for aspect planning and lexical constraints to generate personalized explanations for recommendation, achieving significant improvement in fluency, coherence, and matching ability through insertion-based generation."
}