{
    "title": "Improving Generalizability of Graph Anomaly Detection Models via Data Augmentation. (arXiv:2209.10168v2 [cs.LG] UPDATED)",
    "abstract": "Graph anomaly detection (GAD) is a vital task since even a few anomalies can pose huge threats to benign users. Recent semi-supervised GAD methods, which can effectively leverage the available labels as prior knowledge, have achieved superior performances than unsupervised methods. In practice, people usually need to identify anomalies on new (sub)graphs to secure their business, but they may lack labels to train an effective detection model. One natural idea is to directly adopt a trained GAD model to the new (sub)graph for testing. However, we find that existing semi-supervised GAD methods suffer from poor generalization issue, i.e., well-trained models could not perform well on an unseen area (i.e., not accessible in training) of the same graph. It may cause great troubles. In this paper, we base on the phenomenon and propose a general and novel research problem of generalized graph anomaly detection that aims to effectively identify anomalies on both the training-domain graph and u",
    "link": "http://arxiv.org/abs/2209.10168",
    "context": "Title: Improving Generalizability of Graph Anomaly Detection Models via Data Augmentation. (arXiv:2209.10168v2 [cs.LG] UPDATED)\nAbstract: Graph anomaly detection (GAD) is a vital task since even a few anomalies can pose huge threats to benign users. Recent semi-supervised GAD methods, which can effectively leverage the available labels as prior knowledge, have achieved superior performances than unsupervised methods. In practice, people usually need to identify anomalies on new (sub)graphs to secure their business, but they may lack labels to train an effective detection model. One natural idea is to directly adopt a trained GAD model to the new (sub)graph for testing. However, we find that existing semi-supervised GAD methods suffer from poor generalization issue, i.e., well-trained models could not perform well on an unseen area (i.e., not accessible in training) of the same graph. It may cause great troubles. In this paper, we base on the phenomenon and propose a general and novel research problem of generalized graph anomaly detection that aims to effectively identify anomalies on both the training-domain graph and u",
    "path": "papers/22/09/2209.10168.json",
    "total_tokens": 957,
    "translated_title": "通过数据增强提高图异常检测模型的泛化能力",
    "translated_abstract": "图异常检测（GAD）是一项重要的任务，因为即使少数异常都可能对良性用户造成巨大威胁。最近的半监督GAD方法，可以有效地利用可用的标签作为先验知识，比无监督方法取得了更好的性能。在实践中，人们通常需要在新的（子）图上识别异常以确保业务安全，但他们可能缺乏标签来训练有效的检测模型。一个自然的想法是直接将训练好的GAD模型应用于新的（子）图进行测试。然而，我们发现现有的半监督GAD方法存在泛化能力差的问题，即训练良好的模型在同一图的未训练区域（即训练中无法访问的区域）上表现不佳。这可能会带来很大的麻烦。在本文中，我们基于这一现象，提出了一个通用且新颖的研究问题，即广义图异常检测，旨在有效地识别训练领域图和未训练领域图上的异常。",
    "tldr": "通过数据增强技术，本文针对图异常检测中存在的泛化能力差问题，提出了一种通用且新颖的研究问题：广义图异常检测，旨在同时有效识别训练领域图和未训练领域图上的异常。"
}