{
    "title": "Active Learning for Optimal Intervention Design in Causal Models. (arXiv:2209.04744v2 [cs.LG] UPDATED)",
    "abstract": "Sequential experimental design to discover interventions that achieve a desired outcome is a key problem in various domains including science, engineering and public policy. When the space of possible interventions is large, making an exhaustive search infeasible, experimental design strategies are needed. In this context, encoding the causal relationships between the variables, and thus the effect of interventions on the system, is critical for identifying desirable interventions more efficiently. Here, we develop a causal active learning strategy to identify interventions that are optimal, as measured by the discrepancy between the post-interventional mean of the distribution and a desired target mean. The approach employs a Bayesian update for the causal model and prioritizes interventions using a carefully designed, causally informed acquisition function. This acquisition function is evaluated in closed form, allowing for fast optimization. The resulting algorithms are theoreticall",
    "link": "http://arxiv.org/abs/2209.04744",
    "context": "Title: Active Learning for Optimal Intervention Design in Causal Models. (arXiv:2209.04744v2 [cs.LG] UPDATED)\nAbstract: Sequential experimental design to discover interventions that achieve a desired outcome is a key problem in various domains including science, engineering and public policy. When the space of possible interventions is large, making an exhaustive search infeasible, experimental design strategies are needed. In this context, encoding the causal relationships between the variables, and thus the effect of interventions on the system, is critical for identifying desirable interventions more efficiently. Here, we develop a causal active learning strategy to identify interventions that are optimal, as measured by the discrepancy between the post-interventional mean of the distribution and a desired target mean. The approach employs a Bayesian update for the causal model and prioritizes interventions using a carefully designed, causally informed acquisition function. This acquisition function is evaluated in closed form, allowing for fast optimization. The resulting algorithms are theoreticall",
    "path": "papers/22/09/2209.04744.json",
    "total_tokens": 861,
    "translated_title": "因果模型中的最优干预设计的主动学习",
    "translated_abstract": "在科学、工程和公共政策等各个领域，顺序实验设计以发现实现期望结果的干预策略是一个关键问题。当可能的干预空间很大时，完全搜索是不可行的，需要使用实验设计策略。在这种情况下，编码变量之间的因果关系，特别是干预对系统的影响，对于更有效地确定理想的干预是至关重要的。在这里，我们开发了一种因果主动学习策略，通过后干预分布的均值与期望目标均值之间的差异来确定最优干预措施。该方法利用贝叶斯更新进行因果模型的建立，并使用精心设计的，基于因果关系的获取函数来优先考虑干预措施。该获取函数可以以闭合形式进行评估，从而实现快速优化。最终得到的算法在理论上是可行的。",
    "tldr": "本研究开发了一种因果主动学习策略，通过推断因果模型中的变量之间的关系以及干预对系统的影响，快速确定最优的干预措施，从而解决了在大干预空间下进行实验设计的问题。",
    "en_tdlr": "This study develops a causal active learning strategy to efficiently identify optimal interventions by inferring the causal relationships between variables and the effects of interventions on the system, addressing the problem of experimental design in a large intervention space."
}