{
    "title": "An Interpretable and Efficient Infinite-Order Vector Autoregressive Model for High-Dimensional Time Series",
    "abstract": "arXiv:2209.01172v4 Announce Type: replace-cross  Abstract: As a special infinite-order vector autoregressive (VAR) model, the vector autoregressive moving average (VARMA) model can capture much richer temporal patterns than the widely used finite-order VAR model. However, its practicality has long been hindered by its non-identifiability, computational intractability, and difficulty of interpretation, especially for high-dimensional time series. This paper proposes a novel sparse infinite-order VAR model for high-dimensional time series, which avoids all above drawbacks while inheriting essential temporal patterns of the VARMA model. As another attractive feature, the temporal and cross-sectional structures of the VARMA-type dynamics captured by this model can be interpreted separately, since they are characterized by different sets of parameters. This separation naturally motivates the sparsity assumption on the parameters determining the cross-sectional dependence. As a result, great",
    "link": "https://arxiv.org/abs/2209.01172",
    "context": "Title: An Interpretable and Efficient Infinite-Order Vector Autoregressive Model for High-Dimensional Time Series\nAbstract: arXiv:2209.01172v4 Announce Type: replace-cross  Abstract: As a special infinite-order vector autoregressive (VAR) model, the vector autoregressive moving average (VARMA) model can capture much richer temporal patterns than the widely used finite-order VAR model. However, its practicality has long been hindered by its non-identifiability, computational intractability, and difficulty of interpretation, especially for high-dimensional time series. This paper proposes a novel sparse infinite-order VAR model for high-dimensional time series, which avoids all above drawbacks while inheriting essential temporal patterns of the VARMA model. As another attractive feature, the temporal and cross-sectional structures of the VARMA-type dynamics captured by this model can be interpreted separately, since they are characterized by different sets of parameters. This separation naturally motivates the sparsity assumption on the parameters determining the cross-sectional dependence. As a result, great",
    "path": "papers/22/09/2209.01172.json",
    "total_tokens": 874,
    "translated_title": "一种可解释且高效的高维时间序列无穷阶向量自回归模型",
    "translated_abstract": "作为一种特殊的无穷阶向量自回归（VAR）模型，向量自回归移动平均（VARMA）模型可以捕捉比广泛使用的有限阶VAR模型更丰富的时间模式。然而，由于其不可辨识性、计算难度和解释困难，特别是对于高维时间序列，其实用性长期受到阻碍。本文提出了一种新颖的稀疏高维时间序列无穷阶VAR模型，避免了上述所有缺点，同时继承了VARMA模型的基本时序模式。作为另一个吸引人的特征，该模型捕捉到的VARMA类型动态的时间和横截面结构可以分开解释，因为它们由不同的参数集表征。这种分离自然地激发了对确定横截面依赖性的参数的稀疏性假设。结果，great",
    "tldr": "提出了一种针对高维时间序列的新型稀疏无穷阶VAR模型，既避免了非可辨识性和计算难度，又能分别解释VARMA类型动态的时间和横截面结构。",
    "en_tdlr": "Proposed a novel sparse infinite-order VAR model for high-dimensional time series that avoids non-identifiability and computational complexity, while separately interpreting the temporal and cross-sectional structures of VARMA-type dynamics."
}