{
    "title": "How many inner simulations to compute conditional expectations with least-square Monte Carlo?. (arXiv:2209.04153v2 [math.ST] UPDATED)",
    "abstract": "The problem of computing the conditional expectation E[f (Y)|X] with least-square Monte-Carlo is of general importance and has been widely studied. To solve this problem, it is usually assumed that one has as many samples of Y as of X. However, when samples are generated by computer simulation and the conditional law of Y given X can be simulated, it may be relevant to sample K $\\in$ N values of Y for each sample of X. The present work determines the optimal value of K for a given computational budget, as well as a way to estimate it. The main take away message is that the computational gain can be all the more important that the computational cost of sampling Y given X is small with respect to the computational cost of sampling X. Numerical illustrations on the optimal choice of K and on the computational gain are given on different examples including one inspired by risk management.",
    "link": "http://arxiv.org/abs/2209.04153",
    "context": "Title: How many inner simulations to compute conditional expectations with least-square Monte Carlo?. (arXiv:2209.04153v2 [math.ST] UPDATED)\nAbstract: The problem of computing the conditional expectation E[f (Y)|X] with least-square Monte-Carlo is of general importance and has been widely studied. To solve this problem, it is usually assumed that one has as many samples of Y as of X. However, when samples are generated by computer simulation and the conditional law of Y given X can be simulated, it may be relevant to sample K $\\in$ N values of Y for each sample of X. The present work determines the optimal value of K for a given computational budget, as well as a way to estimate it. The main take away message is that the computational gain can be all the more important that the computational cost of sampling Y given X is small with respect to the computational cost of sampling X. Numerical illustrations on the optimal choice of K and on the computational gain are given on different examples including one inspired by risk management.",
    "path": "papers/22/09/2209.04153.json",
    "total_tokens": 850,
    "translated_title": "如何在最小二乘蒙特卡罗中计算条件期望值时模拟内部样本的个数？",
    "translated_abstract": "使用最小二乘蒙特卡罗计算条件期望E[f(Y)|X]的问题具有普遍重要性并已被广泛研究。为了解决这个问题，通常假设Y和X的样本数量相同。然而，当样本由计算机模拟产生，并且可以模拟出给定X的Y的条件概率分布时，每个X的样本可以取K个Y的值可能是相关的。本研究确定了给定计算预算时K的最优值，以及估计K的方法。最重要的观点是，当给定X时，采样Y的计算成本相对于采样X的计算成本较小，计算收益可能更为重要。通过使用不同的示例，包括一个启发式的风险管理示例，展示了关于最佳K值和计算收益的数值说明。",
    "tldr": "本研究确定了给定计算预算时模拟条件期望中K的最优值，强调了采样Y的计算成本相对较小时可以获得更多的计算收益。",
    "en_tdlr": "This study determines the optimal number of samples of Y for each sample of X in order to compute the conditional expectation E[f(Y)|X] with least-square Monte Carlo, and emphasizes that a smaller computational cost of sampling Y given X can lead to greater computational gains."
}