{
    "title": "Covariance regression with random forests. (arXiv:2209.08173v3 [stat.ME] UPDATED)",
    "abstract": "Capturing the conditional covariances or correlations among the elements of a multivariate response vector based on covariates is important to various fields including neuroscience, epidemiology and biomedicine. We propose a new method called Covariance Regression with Random Forests (CovRegRF) to estimate the covariance matrix of a multivariate response given a set of covariates, using a random forest framework. Random forest trees are built with a splitting rule specially designed to maximize the difference between the sample covariance matrix estimates of the child nodes. We also propose a significance test for the partial effect of a subset of covariates. We evaluate the performance of the proposed method and significance test through a simulation study which shows that the proposed method provides accurate covariance matrix estimates and that the Type-1 error is well controlled. An application of the proposed method to thyroid disease data is also presented. CovRegRF is implemente",
    "link": "http://arxiv.org/abs/2209.08173",
    "context": "Title: Covariance regression with random forests. (arXiv:2209.08173v3 [stat.ME] UPDATED)\nAbstract: Capturing the conditional covariances or correlations among the elements of a multivariate response vector based on covariates is important to various fields including neuroscience, epidemiology and biomedicine. We propose a new method called Covariance Regression with Random Forests (CovRegRF) to estimate the covariance matrix of a multivariate response given a set of covariates, using a random forest framework. Random forest trees are built with a splitting rule specially designed to maximize the difference between the sample covariance matrix estimates of the child nodes. We also propose a significance test for the partial effect of a subset of covariates. We evaluate the performance of the proposed method and significance test through a simulation study which shows that the proposed method provides accurate covariance matrix estimates and that the Type-1 error is well controlled. An application of the proposed method to thyroid disease data is also presented. CovRegRF is implemente",
    "path": "papers/22/09/2209.08173.json",
    "total_tokens": 1010,
    "translated_title": "随机森林进行协方差回归分析",
    "translated_abstract": "在包括神经科学、流行病学、生物医学等多个领域，基于协变量捕获多元响应矢量的条件协方差或相关性是非常重要的。我们提出一种新方法——基于随机森林框架的协方差回归分析(Covariance Regression with Random Forests, CovRegRF)，用于估算在给定协变量情况下多元响应的协方差矩阵。随机森林树的分割规则是专门设计的，以最大化子节点的样本协方差矩阵估计之间的差异。此外，我们还提出了一个有关某些协变量偏效应的显著性检验方法。通过模拟研究评估了所提出方法和显著性检验的性能，结果显示CovRegRF方法提供了准确的协方差矩阵估计，并且Type-1误差得到了良好控制。该方法在甲状腺疾病数据上的应用也被提出。CovRegRF已经实现在R包\"CovRegRF\"中。",
    "tldr": "基于随机森林框架的协方差回归分析(Covariance Regression with Random Forests, CovRegRF)被提出，可以用于估算在给定协变量情况下多元响应的协方差矩阵，并且提供了一个有关某些协变量偏效应的显著性检验方法。",
    "en_tdlr": "Covariance Regression with Random Forests (CovRegRF) is proposed as a new method for estimating the covariance matrix of a multivariate response given a set of covariates using a random forest framework, and a significance test for the partial effect of a subset of covariates is also presented. The proposed method provides accurate covariance matrix estimates and is implemented in the R package \"CovRegRF\"."
}