{
    "title": "Progressive Domain Adaptation with Contrastive Learning for Object Detection in the Satellite Imagery. (arXiv:2209.02564v3 [cs.CV] UPDATED)",
    "abstract": "State-of-the-art object detection methods applied to satellite and drone imagery largely fail to identify small and dense objects. One reason is the high variability of content in the overhead imagery due to the terrestrial region captured and the high variability of acquisition conditions. Another reason is that the number and size of objects in aerial imagery are very different than in the consumer data. In this work, we propose a small object detection pipeline that improves the feature extraction process by spatial pyramid pooling, cross-stage partial networks, heatmap-based region proposal network, and object localization and identification through a novel image difficulty score that adapts the overall focal loss measure based on the image difficulty. Next, we propose novel contrastive learning with progressive domain adaptation to produce domain-invariant features across aerial datasets using local and global components. We show we can alleviate the degradation of object identifi",
    "link": "http://arxiv.org/abs/2209.02564",
    "context": "Title: Progressive Domain Adaptation with Contrastive Learning for Object Detection in the Satellite Imagery. (arXiv:2209.02564v3 [cs.CV] UPDATED)\nAbstract: State-of-the-art object detection methods applied to satellite and drone imagery largely fail to identify small and dense objects. One reason is the high variability of content in the overhead imagery due to the terrestrial region captured and the high variability of acquisition conditions. Another reason is that the number and size of objects in aerial imagery are very different than in the consumer data. In this work, we propose a small object detection pipeline that improves the feature extraction process by spatial pyramid pooling, cross-stage partial networks, heatmap-based region proposal network, and object localization and identification through a novel image difficulty score that adapts the overall focal loss measure based on the image difficulty. Next, we propose novel contrastive learning with progressive domain adaptation to produce domain-invariant features across aerial datasets using local and global components. We show we can alleviate the degradation of object identifi",
    "path": "papers/22/09/2209.02564.json",
    "total_tokens": 910,
    "translated_title": "高分辨率卫星图像中基于对比学习的渐进域自适应对象检测",
    "translated_abstract": "如今在卫星和无人机图像上应用的最先进的对象检测方法往往无法识别小而密集的对象。其中一个原因是由于拍摄的地面区域和采集条件的高变异性，导致航拍图像中的内容变异性大。另一个原因是航拍图像中的对象数量和大小与消费者数据大不相同。本文提出了一种小物体检测管线，通过空间金字塔池化、跨层部分网络、基于热图的区域候选网络以及通过新颖的图像难度评分来适应整体焦点损失度量的对象定位和识别，改进了特征提取过程。接下来，我们提出了一种新颖的对比学习方法，通过渐进域自适应在航拍数据集中生成域不变的特征，使用局部和全局组件。我们证明我们可以减轻对象识别效果的衰减。",
    "tldr": "本文提出了一种在高分辨率卫星图像中改进对象检测的小物体检测管线，通过对特征提取过程的改进和对图像难度评分的应用，以及利用对比学习和渐进域自适应生成域不变的特征，有效提高了对象识别效果。"
}