{
    "title": "Spillover of Antisocial Behavior from Fringe Platforms: The Unintended Consequences of Community Banning. (arXiv:2209.09803v2 [cs.SI] UPDATED)",
    "abstract": "Online platforms face pressure to keep their communities civil and respectful. Thus, the bannings of problematic online communities from mainstream platforms like Reddit and Facebook are often met with enthusiastic public reactions. However, this policy can lead users to migrate to alternative fringe platforms with lower moderation standards and where antisocial behaviors like trolling and harassment are widely accepted. As users of these communities often remain co-active across mainstream and fringe platforms, antisocial behaviors may spill over onto the mainstream platform. We study this possible spillover by analyzing around 70,000 users from three banned communities that migrated to fringe platforms: r/The_Donald, r/GenderCritical, and r/Incels. Using a difference-in-differences design, we contrast co-active users with matched counterparts to estimate the causal effect of fringe platform participation on users' antisocial behavior on Reddit. Our results show that participating in ",
    "link": "http://arxiv.org/abs/2209.09803",
    "context": "Title: Spillover of Antisocial Behavior from Fringe Platforms: The Unintended Consequences of Community Banning. (arXiv:2209.09803v2 [cs.SI] UPDATED)\nAbstract: Online platforms face pressure to keep their communities civil and respectful. Thus, the bannings of problematic online communities from mainstream platforms like Reddit and Facebook are often met with enthusiastic public reactions. However, this policy can lead users to migrate to alternative fringe platforms with lower moderation standards and where antisocial behaviors like trolling and harassment are widely accepted. As users of these communities often remain co-active across mainstream and fringe platforms, antisocial behaviors may spill over onto the mainstream platform. We study this possible spillover by analyzing around 70,000 users from three banned communities that migrated to fringe platforms: r/The_Donald, r/GenderCritical, and r/Incels. Using a difference-in-differences design, we contrast co-active users with matched counterparts to estimate the causal effect of fringe platform participation on users' antisocial behavior on Reddit. Our results show that participating in ",
    "path": "papers/22/09/2209.09803.json",
    "total_tokens": 967,
    "translated_title": "边缘平台上的反社会行为外溢：社区禁止的意外后果",
    "translated_abstract": "在线平台面临着保持社区文明和尊重的压力。因此，像Reddit和Facebook这样的主流平台禁止问题社区通常会受到热烈的公众反应。然而，这种政策可能导致用户迁移到监管标准较低且允许像喷子和骚扰这样反社会行为的替代边缘平台。由于这些社区的用户通常在主流和边缘平台上保持共同活动，所以反社会行为可能会波及到主流平台。我们通过分析从r/The_Donald、r/GenderCritical和r/Incels迁移到边缘平台的约70,000名用户来研究这种可能的外溢效应。使用差异分离设计，我们将共同活动用户与匹配的对照组对比，估计边缘平台参与对Reddit用户反社会行为的因果影响。我们的结果显示，在监管标准较低的边缘平台上参与可能导致Reddit用户的反社会行为增加。这突显了社区禁止的意外后果，并建议需要更加考虑周全的监管政策。",
    "tldr": "研究表明，禁止问题社区可能导致用户迁移到监管标准较低的边缘平台，而参与这些平台可能会导致在主流平台上的反社会行为增加。",
    "en_tdlr": "The banning of problematic online communities from mainstream platforms may lead users to migrate to alternative fringe platforms with lower moderation standards, resulting in an increase in antisocial behavior on mainstream platforms."
}