{
    "title": "LL-GNN: Low Latency Graph Neural Networks on FPGAs for High Energy Physics. (arXiv:2209.14065v4 [cs.AR] UPDATED)",
    "abstract": "This work presents a novel reconfigurable architecture for Low Latency Graph Neural Network (LL-GNN) designs for particle detectors, delivering unprecedented low latency performance. Incorporating FPGA-based GNNs into particle detectors presents a unique challenge since it requires sub-microsecond latency to deploy the networks for online event selection with a data rate of hundreds of terabytes per second in the Level-1 triggers at the CERN Large Hadron Collider experiments. This paper proposes a novel outer-product based matrix multiplication approach, which is enhanced by exploiting the structured adjacency matrix and a column-major data layout. Moreover, a fusion step is introduced to further reduce the end-to-end design latency by eliminating unnecessary boundaries. Furthermore, a GNN-specific algorithm-hardware co-design approach is presented which not only finds a design with a much better latency but also finds a high accuracy design under given latency constraints. To facilita",
    "link": "http://arxiv.org/abs/2209.14065",
    "context": "Title: LL-GNN: Low Latency Graph Neural Networks on FPGAs for High Energy Physics. (arXiv:2209.14065v4 [cs.AR] UPDATED)\nAbstract: This work presents a novel reconfigurable architecture for Low Latency Graph Neural Network (LL-GNN) designs for particle detectors, delivering unprecedented low latency performance. Incorporating FPGA-based GNNs into particle detectors presents a unique challenge since it requires sub-microsecond latency to deploy the networks for online event selection with a data rate of hundreds of terabytes per second in the Level-1 triggers at the CERN Large Hadron Collider experiments. This paper proposes a novel outer-product based matrix multiplication approach, which is enhanced by exploiting the structured adjacency matrix and a column-major data layout. Moreover, a fusion step is introduced to further reduce the end-to-end design latency by eliminating unnecessary boundaries. Furthermore, a GNN-specific algorithm-hardware co-design approach is presented which not only finds a design with a much better latency but also finds a high accuracy design under given latency constraints. To facilita",
    "path": "papers/22/09/2209.14065.json",
    "total_tokens": 1007,
    "translated_title": "LL-GNN: 基于FPGA的低延迟图神经网络在高能物理领域的应用",
    "translated_abstract": "本文提出了一种新型的可重构架构，用于实现基于FPGA的低延迟图神经网络(LL-GNN)，以支持具有前所未有的低延迟性能的粒子探测器。由于在欧洲核子研究中心大型强子对撞机实验的一级触发器中需要以每秒数百太字节的数据速率进行在线事件选择，因此将基于FPGA的GNNs应用于粒子探测器面临着独特的挑战，需要在亚微秒级别内部署网络。本文提出了一种基于外积的矩阵乘法方法，并利用结构化邻接矩阵和列主数据布局进行了优化。此外，还引入了一种融合步骤，通过消除不必要的边界进一步降低了端到端设计的延迟。此外，本文还提出了一种GNN特定的算法-硬件协同设计方法，在给定延迟限制下寻找更好延迟和更高精度的设计。",
    "tldr": "本文提出了一种新型的基于FPGA的低延迟图神经网络(LL-GNN)架构，针对粒子探测器领域的特殊需求，通过外积矩阵乘法方法、结构化邻接矩阵和列主数据布局等优化措施，实现了亚微秒级别的网络部署，并提供了一种GNN特定的算法-硬件协同设计方法。",
    "en_tdlr": "This paper proposes a novel FPGA-based low latency graph neural network (LL-GNN) architecture for particle detectors, achieving sub-microsecond network deployment by using outer-product matrix multiplication and optimized structured adjacency matrix and column-major data layout, and providing a GNN-specific algorithm-hardware co-design approach for better latency and accuracy under given constraints."
}