{
    "title": "Natural Language Processing Methods to Identify Oncology Patients at High Risk for Acute Care with Clinical Notes. (arXiv:2209.13860v2 [cs.CL] UPDATED)",
    "abstract": "Clinical notes are an essential component of a health record. This paper evaluates how natural language processing (NLP) can be used to identify the risk of acute care use (ACU) in oncology patients, once chemotherapy starts. Risk prediction using structured health data (SHD) is now standard, but predictions using free-text formats are complex. This paper explores the use of free-text notes for the prediction of ACU instead of SHD. Deep Learning models were compared to manually engineered language features. Results show that SHD models minimally outperform NLP models; an l1-penalised logistic regression with SHD achieved a C-statistic of 0.748 (95%-CI: 0.735, 0.762), while the same model with language features achieved 0.730 (95%-CI: 0.717, 0.745) and a transformer-based model achieved 0.702 (95%-CI: 0.688, 0.717). This paper shows how language models can be used in clinical applications and underlines how risk bias is different for diverse patient groups, even using only free-text dat",
    "link": "http://arxiv.org/abs/2209.13860",
    "context": "Title: Natural Language Processing Methods to Identify Oncology Patients at High Risk for Acute Care with Clinical Notes. (arXiv:2209.13860v2 [cs.CL] UPDATED)\nAbstract: Clinical notes are an essential component of a health record. This paper evaluates how natural language processing (NLP) can be used to identify the risk of acute care use (ACU) in oncology patients, once chemotherapy starts. Risk prediction using structured health data (SHD) is now standard, but predictions using free-text formats are complex. This paper explores the use of free-text notes for the prediction of ACU instead of SHD. Deep Learning models were compared to manually engineered language features. Results show that SHD models minimally outperform NLP models; an l1-penalised logistic regression with SHD achieved a C-statistic of 0.748 (95%-CI: 0.735, 0.762), while the same model with language features achieved 0.730 (95%-CI: 0.717, 0.745) and a transformer-based model achieved 0.702 (95%-CI: 0.688, 0.717). This paper shows how language models can be used in clinical applications and underlines how risk bias is different for diverse patient groups, even using only free-text dat",
    "path": "papers/22/09/2209.13860.json",
    "total_tokens": 1108,
    "translated_title": "自然语言处理方法识别在临床记录中高风险的癌症患者",
    "translated_abstract": "临床记录是健康记录中的重要组成部分。本篇论文评估了如何利用自然语言处理（NLP）识别化疗开始后癌症患者急救护理（ACU）的风险。使用结构化卫生数据（SHD）进行风险预测已成为标准，但使用自由文本格式进行预测更为复杂。本文探讨了使用自由文本笔记而非SHD进行ACU预测的方法。深度学习模型与手动构建的语言特征进行了比较。结果表明，SHD模型略胜于NLP模型； SHD的l1-罚项逻辑回归模型实现的C统计量为0.748（95％-CI：0.735，0.762），而具有语言特征的相同模型实现的C统计量为0.730（95％-CI：0.717，0.745），而基于变压器的模型实现的C统计量为0.702（95％-CI：0.688，0.717）。本文展示了语言模型在临床应用中的应用，并强调不同患者群体的风险偏差是不同的，即使只使用自由文本数据也是如此。",
    "tldr": "本文研究了利用自然语言处理方法识别化疗后癌症患者急救护理风险的问题，与以往使用结构化卫生数据进行预测的模型相比较，结果表明两者差异不大，从而说明了在临床应用中采用语言模型的可行性以及不同患者群体风险偏差的存在。",
    "en_tdlr": "This paper explores how natural language processing can be used to identify the risk of acute care use in oncology patients, with results showing that language models perform comparably to models using structured health data. The study highlights the feasibility of using language models in clinical applications and the presence of different risk biases among diverse patient groups, even when only free-text data is used."
}