{
    "title": "AnaMeta: A Table Understanding Dataset of Field Metadata Knowledge Shared by Multi-dimensional Data Analysis Tasks. (arXiv:2209.00946v2 [cs.DB] UPDATED)",
    "abstract": "Tabular data analysis is performed every day across various domains. It requires an accurate understanding of field semantics to correctly operate on table fields and find common patterns in daily analysis. In this paper, we introduce the AnaMeta dataset, a collection of 467k tables with derived supervision labels for four types of commonly used field metadata: measure/dimension dichotomy, common field roles, semantic field type, and default aggregation function. We evaluate a wide range of models for inferring metadata as the benchmark. We also propose a multi-encoder framework, called KDF, which improves the metadata understanding capability of tabular models by incorporating distribution and knowledge information. Furthermore, we propose four interfaces for incorporating field metadata into downstream analysis tasks.",
    "link": "http://arxiv.org/abs/2209.00946",
    "context": "Title: AnaMeta: A Table Understanding Dataset of Field Metadata Knowledge Shared by Multi-dimensional Data Analysis Tasks. (arXiv:2209.00946v2 [cs.DB] UPDATED)\nAbstract: Tabular data analysis is performed every day across various domains. It requires an accurate understanding of field semantics to correctly operate on table fields and find common patterns in daily analysis. In this paper, we introduce the AnaMeta dataset, a collection of 467k tables with derived supervision labels for four types of commonly used field metadata: measure/dimension dichotomy, common field roles, semantic field type, and default aggregation function. We evaluate a wide range of models for inferring metadata as the benchmark. We also propose a multi-encoder framework, called KDF, which improves the metadata understanding capability of tabular models by incorporating distribution and knowledge information. Furthermore, we propose four interfaces for incorporating field metadata into downstream analysis tasks.",
    "path": "papers/22/09/2209.00946.json",
    "total_tokens": 805,
    "translated_title": "AnaMeta：多维数据分析任务共享的表格元数据知识的理解数据集",
    "translated_abstract": "表格数据分析在各个领域每天都在进行，它需要准确地理解字段语义才能正确地操作表格字段并在日常分析中找到共同模式。本文介绍了AnaMeta数据集，其中包含467k张表格以及常用字段元数据的四种衍生监督标签：衡量/维度二分法、常见字段角色、语义字段类型和默认聚合函数。我们评估了一系列模型来推断元数据作为基准。我们还提出了一种名为KDF的多编码器框架，通过结合分布和知识信息来提高表格模型的元数据理解能力。此外，我们提出了四个接口，将字段元数据纳入下游分析任务中。",
    "tldr": "AnaMeta是一个包含467k张表格的数据集，它提供了常用字段元数据的四种衍生监督标签，同时推出了一种新的多编码器框架（KDF）提高了表格模型的元数据理解能力，并且提出了四个接口将元数据纳入下游分析任务中。",
    "en_tdlr": "AnaMeta is a dataset with 467k tables that provides four types of commonly used field metadata, and introduces a new multi-encoder framework (KDF) to improve the metadata understanding capability of tabular models. It also proposes four interfaces to incorporate field metadata into downstream analysis tasks."
}