{
    "title": "Variance Covariance Regularization Enforces Pairwise Independence in Self-Supervised Representations",
    "abstract": "arXiv:2209.14905v2 Announce Type: replace Abstract: Self-Supervised Learning (SSL) methods such as VICReg, Barlow Twins or W-MSE avoid collapse of their joint embedding architectures by constraining or regularizing the covariance matrix of their projector's output. This study highlights important properties of such strategy, which we coin Variance-Covariance regularization (VCReg). More precisely, we show that {\\em VCReg combined to a MLP projector enforces pairwise independence between the features of the learned representation}. This result emerges by bridging VCReg applied on the projector's output to kernel independence criteria applied on the projector's input. We empirically validate our findings where (i) we put in evidence which projector's characteristics favor pairwise independence, (ii) we demonstrate pairwise independence to be beneficial for out-of-domain generalization, (iii) we demonstrate that the scope of VCReg goes beyond SSL by using it to solve Independent Component",
    "link": "https://arxiv.org/abs/2209.14905",
    "context": "Title: Variance Covariance Regularization Enforces Pairwise Independence in Self-Supervised Representations\nAbstract: arXiv:2209.14905v2 Announce Type: replace Abstract: Self-Supervised Learning (SSL) methods such as VICReg, Barlow Twins or W-MSE avoid collapse of their joint embedding architectures by constraining or regularizing the covariance matrix of their projector's output. This study highlights important properties of such strategy, which we coin Variance-Covariance regularization (VCReg). More precisely, we show that {\\em VCReg combined to a MLP projector enforces pairwise independence between the features of the learned representation}. This result emerges by bridging VCReg applied on the projector's output to kernel independence criteria applied on the projector's input. We empirically validate our findings where (i) we put in evidence which projector's characteristics favor pairwise independence, (ii) we demonstrate pairwise independence to be beneficial for out-of-domain generalization, (iii) we demonstrate that the scope of VCReg goes beyond SSL by using it to solve Independent Component",
    "path": "papers/22/09/2209.14905.json",
    "total_tokens": 853,
    "translated_title": "方差协方差正则化在自监督表示中强制实现成对独立性",
    "translated_abstract": "自监督学习方法（如VICReg、Barlow Twins或W-MSE）通过约束或正则化它们的投影器输出的协方差矩阵来避免联合嵌入结构的坍塌。本研究突出了这种策略的重要性质，我们称之为方差协方差正则化（VCReg）。更具体地说，我们证明了“VCReg与MLP投影器结合，在学习表示的特征之间实现了成对独立性”。这个结果通过将应用于投影器输入的核独立性标准与应用于投影器输出的VCReg相结合来得出。我们在实证上验证了我们的发现：（i）我们突出了哪些投影器的特性有利于成对独立性，（ii）我们证明成对独立性对于域外泛化具有益处，（iii）我们证明VCReg的范围超出了自监督学习，我们可以用它来解决独立成分问题。",
    "tldr": "本研究发现，方差协方差正则化与MLP投影器结合，在学习表示的特征之间实现了成对独立性，并对成对独立性在自监督学习和域外泛化方面的价值进行了验证。"
}