{
    "title": "Nonparametric estimates of option prices via Hermite basis functions. (arXiv:2209.09656v2 [q-fin.PR] UPDATED)",
    "abstract": "We consider approximate pricing formulas for European options based on approximating the logarithmic return's density of the underlying by a linear combination of rescaled Hermite polynomials. The resulting models, that can be seen as perturbations of the classical Black-Scholes one, are nonpararametric in the sense that the distribution of logarithmic returns at fixed times to maturity is only assumed to have a square-integrable density. We extensively investigate the empirical performance, defined in terms of out-of-sample relative pricing error, of this class of approximating models, depending on their order (that is, roughly speaking, the degree of the polynomial expansion) as well as on several ways to calibrate them to observed data. Empirical results suggest that such approximate pricing formulas, when compared with simple nonparametric estimates based on interpolation and extrapolation on the implied volatility curve, perform reasonably well only for options with strike price n",
    "link": "http://arxiv.org/abs/2209.09656",
    "context": "Title: Nonparametric estimates of option prices via Hermite basis functions. (arXiv:2209.09656v2 [q-fin.PR] UPDATED)\nAbstract: We consider approximate pricing formulas for European options based on approximating the logarithmic return's density of the underlying by a linear combination of rescaled Hermite polynomials. The resulting models, that can be seen as perturbations of the classical Black-Scholes one, are nonpararametric in the sense that the distribution of logarithmic returns at fixed times to maturity is only assumed to have a square-integrable density. We extensively investigate the empirical performance, defined in terms of out-of-sample relative pricing error, of this class of approximating models, depending on their order (that is, roughly speaking, the degree of the polynomial expansion) as well as on several ways to calibrate them to observed data. Empirical results suggest that such approximate pricing formulas, when compared with simple nonparametric estimates based on interpolation and extrapolation on the implied volatility curve, perform reasonably well only for options with strike price n",
    "path": "papers/22/09/2209.09656.json",
    "total_tokens": 890,
    "translated_title": "非参数化通过Hermite基函数估计期权价格",
    "translated_abstract": "我们考虑基于将标的资产的对数收益率密度用一组缩放的Hermite多项式线性组合来逼近的欧式期权的近似定价公式。由此得出的模型可以看作是经典的Black-Scholes模型的扰动，从统计学意义上来说是非参数化的，即在固定到期时间点的对数收益率分布只需假设有可积的平方密度。我们广泛研究了这类近似模型的经验表现，通过样本外相对定价误差来定义，其表现受到多项式展开的阶数以及根据观察数据进行校准的多种方式的影响。实证结果表明，与基于隐含波动率曲线的插值和外推的简单非参数化估计相比，这种近似定价公式只对价格接近行权价格的期权表现良好。",
    "tldr": "本研究通过使用Hermite基函数逼近对数收益率密度，提出了一种非参数化的欧式期权定价方法。经验结果表明，相比于基于隐含波动率曲线的插值和外推方法，这种方法在价格接近行权价格的期权上表现良好。"
}