{
    "title": "Detecting Political Biases of Named Entities and Hashtags on Twitter. (arXiv:2209.08110v2 [cs.SI] UPDATED)",
    "abstract": "Ideological divisions in the United States have become increasingly prominent in daily communication. Accordingly, there has been much research on political polarization, including many recent efforts that take a computational perspective. By detecting political biases in a corpus of text, one can attempt to describe and discern the polarity of that text. Intuitively, the named entities (i.e., the nouns and the phrases that act as nouns) and hashtags in text often carry information about political views. For example, people who use the term \"pro-choice\" are likely to be liberal, whereas people who use the term \"pro-life\" are likely to be conservative. In this paper, we seek to reveal political polarities in social-media text data and to quantify these polarities by explicitly assigning a polarity score to entities and hashtags. Although this idea is straightforward, it is difficult to perform such inference in a trustworthy quantitative way. Key challenges include the small number of k",
    "link": "http://arxiv.org/abs/2209.08110",
    "context": "Title: Detecting Political Biases of Named Entities and Hashtags on Twitter. (arXiv:2209.08110v2 [cs.SI] UPDATED)\nAbstract: Ideological divisions in the United States have become increasingly prominent in daily communication. Accordingly, there has been much research on political polarization, including many recent efforts that take a computational perspective. By detecting political biases in a corpus of text, one can attempt to describe and discern the polarity of that text. Intuitively, the named entities (i.e., the nouns and the phrases that act as nouns) and hashtags in text often carry information about political views. For example, people who use the term \"pro-choice\" are likely to be liberal, whereas people who use the term \"pro-life\" are likely to be conservative. In this paper, we seek to reveal political polarities in social-media text data and to quantify these polarities by explicitly assigning a polarity score to entities and hashtags. Although this idea is straightforward, it is difficult to perform such inference in a trustworthy quantitative way. Key challenges include the small number of k",
    "path": "papers/22/09/2209.08110.json",
    "total_tokens": 821,
    "translated_title": "在Twitter上检测命名实体和标签的政治偏见",
    "translated_abstract": "美国的意识形态分歧在日常交流中变得日益突出。因此，有很多关于政治极化的研究，包括许多最近从计算的角度来看的研究。通过检测文本语料中的政治偏见，可以尝试描述和区分该文本的情感极性。直观地说，文本中的命名实体（即充当名词的名词和短语）和标签通常都携带有关政治观点的信息。在本文中，我们试图揭示社交媒体文本数据中的政治极性，并通过明确地为实体和标签分配极性分数来量化这些极性。尽管这个想法很直观，但是以可信的数量方式执行这样的推断很困难。主要挑战包括实体和标签的数量较少。",
    "tldr": "本篇论文旨在通过分析Twitter上的命名实体和标签的使用来检测文本中的政治偏见，并分配极性分数进行量化。",
    "en_tdlr": "This paper aims to detect political biases in text by analyzing the usage of named entities and hashtags on Twitter, and quantifying the polarities by assigning polarity scores."
}