{
    "title": "DynDepNet: Learning Time-Varying Dependency Structures from fMRI Data via Dynamic Graph Structure Learning. (arXiv:2209.13513v3 [cs.LG] UPDATED)",
    "abstract": "Graph neural networks (GNNs) have demonstrated success in learning representations of brain graphs derived from functional magnetic resonance imaging (fMRI) data. However, existing GNN methods assume brain graphs are static over time and the graph adjacency matrix is known prior to model training. These assumptions contradict evidence that brain graphs are time-varying with a connectivity structure that depends on the choice of functional connectivity measure. Incorrectly representing fMRI data with noisy brain graphs can adversely affect GNN performance. To address this, we propose DynDepNet, a novel method for learning the optimal time-varying dependency structure of fMRI data induced by downstream prediction tasks. Experiments on real-world fMRI datasets, for the task of sex classification, demonstrate that DynDepNet achieves state-of-the-art results, outperforming the best baseline in terms of accuracy by approximately 8 and 6 percentage points, respectively. Furthermore, analysis ",
    "link": "http://arxiv.org/abs/2209.13513",
    "context": "Title: DynDepNet: Learning Time-Varying Dependency Structures from fMRI Data via Dynamic Graph Structure Learning. (arXiv:2209.13513v3 [cs.LG] UPDATED)\nAbstract: Graph neural networks (GNNs) have demonstrated success in learning representations of brain graphs derived from functional magnetic resonance imaging (fMRI) data. However, existing GNN methods assume brain graphs are static over time and the graph adjacency matrix is known prior to model training. These assumptions contradict evidence that brain graphs are time-varying with a connectivity structure that depends on the choice of functional connectivity measure. Incorrectly representing fMRI data with noisy brain graphs can adversely affect GNN performance. To address this, we propose DynDepNet, a novel method for learning the optimal time-varying dependency structure of fMRI data induced by downstream prediction tasks. Experiments on real-world fMRI datasets, for the task of sex classification, demonstrate that DynDepNet achieves state-of-the-art results, outperforming the best baseline in terms of accuracy by approximately 8 and 6 percentage points, respectively. Furthermore, analysis ",
    "path": "papers/22/09/2209.13513.json",
    "total_tokens": 846,
    "translated_title": "DynDepNet:通过动态图结构学习从fMRI数据中学习时变的依赖关系结构",
    "translated_abstract": "图神经网络（GNNs）在学习基于功能磁共振成像（fMRI）数据的大脑图表示方面取得了成功。然而，现有的GNN方法假设大脑图在时间上是静态的，并且在模型训练之前已知图邻接矩阵。这些假设与证据相矛盾，即大脑图在时间上是变化的，并且其连接结构取决于功能连接测量的选择。用噪声大脑图错误地表示fMRI数据会对GNN的性能产生不利影响。为了解决这个问题，我们提出了DynDepNet，一种通过下游预测任务所引发的fMRI数据的最优时变依赖结构的学习方法。对于性别分类任务，对真实世界的fMRI数据集进行的实验证明DynDepNet取得了最先进的结果，准确率分别比最佳基准线提高了约8个百分点和6个百分点。",
    "tldr": "DynDepNet是一种学习fMRI数据中时变依赖结构的新方法，在性别分类任务中取得了最先进的结果。",
    "en_tdlr": "DynDepNet is a novel method for learning time-varying dependency structures from fMRI data and achieves state-of-the-art results in sex classification tasks."
}