{
    "title": "Adaptive-SpikeNet: Event-based Optical Flow Estimation using Spiking Neural Networks with Learnable Neuronal Dynamics. (arXiv:2209.11741v2 [cs.CV] UPDATED)",
    "abstract": "Event-based cameras have recently shown great potential for high-speed motion estimation owing to their ability to capture temporally rich information asynchronously. Spiking Neural Networks (SNNs), with their neuro-inspired event-driven processing can efficiently handle such asynchronous data, while neuron models such as the leaky-integrate and fire (LIF) can keep track of the quintessential timing information contained in the inputs. SNNs achieve this by maintaining a dynamic state in the neuron memory, retaining important information while forgetting redundant data over time. Thus, we posit that SNNs would allow for better performance on sequential regression tasks compared to similarly sized Analog Neural Networks (ANNs). However, deep SNNs are difficult to train due to vanishing spikes at later layers. To that effect, we propose an adaptive fully-spiking framework with learnable neuronal dynamics to alleviate the spike vanishing problem. We utilize surrogate gradient-based backpro",
    "link": "http://arxiv.org/abs/2209.11741",
    "context": "Title: Adaptive-SpikeNet: Event-based Optical Flow Estimation using Spiking Neural Networks with Learnable Neuronal Dynamics. (arXiv:2209.11741v2 [cs.CV] UPDATED)\nAbstract: Event-based cameras have recently shown great potential for high-speed motion estimation owing to their ability to capture temporally rich information asynchronously. Spiking Neural Networks (SNNs), with their neuro-inspired event-driven processing can efficiently handle such asynchronous data, while neuron models such as the leaky-integrate and fire (LIF) can keep track of the quintessential timing information contained in the inputs. SNNs achieve this by maintaining a dynamic state in the neuron memory, retaining important information while forgetting redundant data over time. Thus, we posit that SNNs would allow for better performance on sequential regression tasks compared to similarly sized Analog Neural Networks (ANNs). However, deep SNNs are difficult to train due to vanishing spikes at later layers. To that effect, we propose an adaptive fully-spiking framework with learnable neuronal dynamics to alleviate the spike vanishing problem. We utilize surrogate gradient-based backpro",
    "path": "papers/22/09/2209.11741.json",
    "total_tokens": 1104,
    "translated_title": "自适应脉冲网络：使用可学习神经动力学的脉冲神经网络进行事件驱动光流估计",
    "translated_abstract": "最近，事件驱动相机凭借其异步捕捉丰富时间信息的能力，展现出高速运动估计的巨大潜力。脉冲神经网络（SNN）凭借其神经启发式事件驱动处理，可以有效地处理此类异步数据，而类似漏电整流与放电（LIF）的神经元模型可以跟踪输入中包含的关键时间信息。脉冲神经网络通过在神经元内存中维护动态状态来实现这一点，保留重要信息同时随着时间流逝遗忘冗余数据。因此，我们认为与同样大小的模拟神经网络相比，脉冲神经网络将允许在顺序回归任务上取得更好的性能。然而，由于后面的神经元处的脉冲消失问题，深度脉冲神经网络很难训练。为此，我们在神经元动态中引入了可学习的自适应阈值，通过梯度衰减反向传播解决了脉冲消失问题。在光流估计这一高速运动估计任务上，我们通过在许多公共基准测试中显著减少参数使用的方式，获得了最先进的性能。",
    "tldr": "本文提出了一种自适应脉冲神经网络框架，用于事件驱动光流估计任务，并通过神经动力学来解决脉冲消失问题。实验结果表明，该方法在各项公共基准测试中均取得了最先进的性能。",
    "en_tdlr": "This paper proposes an adaptive fully-spiking framework with learnable neuronal dynamics for event-based optical flow estimation. It introduces an adaptive threshold for neurons and uses surrogate gradient-based backpropagation to alleviate the spike vanishing problem. The results show that the method achieves state-of-the-art performance on various publicly available benchmarks."
}