{
    "title": "FusionRetro: Molecule Representation Fusion via In-context Reactions for Retrosynthetic Planning. (arXiv:2209.15315v3 [cs.LG] UPDATED)",
    "abstract": "Retrosynthetic planning aims to devise a complete multi-step synthetic route from starting materials to a target molecule. Current strategies use a decoupled approach of single-step retrosynthesis models and search algorithms, taking only the product as the input to predict the reactants for each planning step and ignoring valuable context information along the synthetic route. In this work, we propose a novel framework that utilizes context information for improved retrosynthetic planning. We view synthetic routes as reaction graphs and propose to incorporate context through three principled steps: encode molecules into embeddings, aggregate information over routes, and readout to predict reactants. Our approach is the first attempt to utilize in-context reactions for retrosynthetic planning. The entire framework can be efficiently optimized in an end-to-end fashion and produce more practical and accurate predictions. Comprehensive experiments demonstrate that by fusing in the context",
    "link": "http://arxiv.org/abs/2209.15315",
    "context": "Title: FusionRetro: Molecule Representation Fusion via In-context Reactions for Retrosynthetic Planning. (arXiv:2209.15315v3 [cs.LG] UPDATED)\nAbstract: Retrosynthetic planning aims to devise a complete multi-step synthetic route from starting materials to a target molecule. Current strategies use a decoupled approach of single-step retrosynthesis models and search algorithms, taking only the product as the input to predict the reactants for each planning step and ignoring valuable context information along the synthetic route. In this work, we propose a novel framework that utilizes context information for improved retrosynthetic planning. We view synthetic routes as reaction graphs and propose to incorporate context through three principled steps: encode molecules into embeddings, aggregate information over routes, and readout to predict reactants. Our approach is the first attempt to utilize in-context reactions for retrosynthetic planning. The entire framework can be efficiently optimized in an end-to-end fashion and produce more practical and accurate predictions. Comprehensive experiments demonstrate that by fusing in the context",
    "path": "papers/22/09/2209.15315.json",
    "total_tokens": 862,
    "translated_title": "通过上下文反应实现分子表示融合的反合成规划技术",
    "translated_abstract": "反合成规划的目标是从起始物质到目标分子设计出一个完整的多步合成路线。当前策略采用一种解耦的方法，即单步反合成模型和搜索算法，只将产物作为输入来预测每个规划步骤的反应物，并忽略了沿着合成路线的有价值的上下文信息。本文提出了一种新颖的框架，利用上下文信息来改善反合成规划。我们将合成路线视为反应图，并提出通过三个原则步骤来整合信息和预测反应物。我们的方法是利用上下文反应进行反合成规划的首次尝试。整个框架可以高效地端到端地优化，产生更实用和准确的预测。全面的实验证明，通过在上下文中融合分子表示，我们的方法可以取得更好的反合成规划结果。",
    "tldr": "本文提出了一种新的反合成规划框架，能够利用上下文信息来改善预测准确性，从而实现更实用和准确的反合成规划结果。",
    "en_tdlr": "This paper proposes a novel framework for retrosynthetic planning, which utilizes context information to improve the accuracy of predictions and achieve more practical and accurate results. The approach incorporates context through three principled steps, and is the first attempt to utilize in-context reactions for retrosynthetic planning."
}