{
    "title": "Continuous Mixtures of Tractable Probabilistic Models. (arXiv:2209.10584v3 [cs.LG] UPDATED)",
    "abstract": "Probabilistic models based on continuous latent spaces, such as variational autoencoders, can be understood as uncountable mixture models where components depend continuously on the latent code. They have proven to be expressive tools for generative and probabilistic modelling, but are at odds with tractable probabilistic inference, that is, computing marginals and conditionals of the represented probability distribution. Meanwhile, tractable probabilistic models such as probabilistic circuits (PCs) can be understood as hierarchical discrete mixture models, and thus are capable of performing exact inference efficiently but often show subpar performance in comparison to continuous latent-space models. In this paper, we investigate a hybrid approach, namely continuous mixtures of tractable models with a small latent dimension. While these models are analytically intractable, they are well amenable to numerical integration schemes based on a finite set of integration points. With a large ",
    "link": "http://arxiv.org/abs/2209.10584",
    "context": "Title: Continuous Mixtures of Tractable Probabilistic Models. (arXiv:2209.10584v3 [cs.LG] UPDATED)\nAbstract: Probabilistic models based on continuous latent spaces, such as variational autoencoders, can be understood as uncountable mixture models where components depend continuously on the latent code. They have proven to be expressive tools for generative and probabilistic modelling, but are at odds with tractable probabilistic inference, that is, computing marginals and conditionals of the represented probability distribution. Meanwhile, tractable probabilistic models such as probabilistic circuits (PCs) can be understood as hierarchical discrete mixture models, and thus are capable of performing exact inference efficiently but often show subpar performance in comparison to continuous latent-space models. In this paper, we investigate a hybrid approach, namely continuous mixtures of tractable models with a small latent dimension. While these models are analytically intractable, they are well amenable to numerical integration schemes based on a finite set of integration points. With a large ",
    "path": "papers/22/09/2209.10584.json",
    "total_tokens": 907,
    "translated_title": "可计算概率模型的连续混合",
    "translated_abstract": "基于连续潜空间的概率模型，如变分自编码器，可以理解为在潜变量上连续依赖的不可数混合模型。它们已被证明是表达生成和概率建模的有效工具，但与能够计算所表示的概率分布的较为简单的可计算概率推断方法存在矛盾。与此同时，可计算概率模型，如概率电路(PCs)，可以理解为层次离散混合模型，因此能够高效地进行准确推断，但在与连续潜空间模型相比时通常表现不佳。在本文中，我们研究了一种混合方法，即具有小潜变量维度的可计算模型的连续混合。尽管这些模型在解析上是难以处理的，但它们适合于基于有限积分点集的数值积分方案。通过足够大的积分点集，我们可以紧密地近似概率模型并进行高效推断。",
    "tldr": "本文研究了一种连续混合的方法，将可计算概率模型和基于连续潜空间的模型结合起来，从而实现了高效的概率推断。",
    "en_tdlr": "This paper proposes a hybrid approach, continuous mixtures of tractable models with a small latent dimension, to combine the benefits of both continuous latent-space models and tractable probabilistic models, providing an efficient solution for probabilistic inference."
}