{
    "title": "Holographic-(V)AE: an end-to-end SO(3)-Equivariant (Variational) Autoencoder in Fourier Space. (arXiv:2209.15567v2 [cs.LG] UPDATED)",
    "abstract": "Group-equivariant neural networks have emerged as a data-efficient approach to solve classification and regression tasks, while respecting the relevant symmetries of the data. However, little work has been done to extend this paradigm to the unsupervised and generative domains. Here, we present Holographic-(Variational) Auto Encoder (H-(V)AE), a fully end-to-end SO(3)-equivariant (variational) autoencoder in Fourier space, suitable for unsupervised learning and generation of data distributed around a specified origin in 3D. H-(V)AE is trained to reconstruct the spherical Fourier encoding of data, learning in the process a low-dimensional representation of the data (i.e., a latent space) with a maximally informative rotationally invariant embedding alongside an equivariant frame describing the orientation of the data. We extensively test the performance of H-(V)AE on diverse datasets. We show that the learned latent space efficiently encodes the categorical features of spherical images.",
    "link": "http://arxiv.org/abs/2209.15567",
    "context": "Title: Holographic-(V)AE: an end-to-end SO(3)-Equivariant (Variational) Autoencoder in Fourier Space. (arXiv:2209.15567v2 [cs.LG] UPDATED)\nAbstract: Group-equivariant neural networks have emerged as a data-efficient approach to solve classification and regression tasks, while respecting the relevant symmetries of the data. However, little work has been done to extend this paradigm to the unsupervised and generative domains. Here, we present Holographic-(Variational) Auto Encoder (H-(V)AE), a fully end-to-end SO(3)-equivariant (variational) autoencoder in Fourier space, suitable for unsupervised learning and generation of data distributed around a specified origin in 3D. H-(V)AE is trained to reconstruct the spherical Fourier encoding of data, learning in the process a low-dimensional representation of the data (i.e., a latent space) with a maximally informative rotationally invariant embedding alongside an equivariant frame describing the orientation of the data. We extensively test the performance of H-(V)AE on diverse datasets. We show that the learned latent space efficiently encodes the categorical features of spherical images.",
    "path": "papers/22/09/2209.15567.json",
    "total_tokens": 948,
    "translated_title": "Holographic-(V)AE:一种在傅立叶空间中的SO(3)-等变性(Variational)自编码器",
    "translated_abstract": "群等变性神经网络已成为数据效率高的解决分类和回归任务的方法，同时也尊重数据的相关对称性。然而，在无监督生成方面，这种范例的研究还很少。本文提出了一种称为全息式-(变分)自编码器（Holographic-(V)AE）的全尺寸SO(3)等变(Variational)自编码器，适用于分布在三维指定原点周围的数据的无监督学习和生成。H-(V)AE被训练为重构数据的球形傅立叶编码，学习过程中获得具有最大信息内容的旋转不变嵌入和用于描述数据方向的等变帧的低维数据表征（即潜空间）。我们对H-(V)AE在多种数据集上的性能进行了广泛测试。结果显示，学习到的潜空间有效地编码了球面图像的分类特征。",
    "tldr": "Holographic-(V)AE是一种在傅立叶空间中的SO(3)-等变性(Variational)自编码器，用于无监督学习和生成分布于指定3D原点周围的数据，并且对应的潜空间编码了球面图像的分类特征。",
    "en_tdlr": "Holographic-(V)AE is an end-to-end SO(3)-equivariant (variational) autoencoder in Fourier space, used for unsupervised learning and generation of data distributed around a specified origin in 3D, and its corresponding latent space efficiently encodes the categorical features of spherical images."
}