{
    "title": "Self-supervised Representation Learning on Electronic Health Records with Graph Kernel Infomax",
    "abstract": "arXiv:2209.00655v2 Announce Type: replace  Abstract: Learning Electronic Health Records (EHRs) representation is a preeminent yet under-discovered research topic. It benefits various clinical decision support applications, e.g., medication outcome prediction or patient similarity search. Current approaches focus on task-specific label supervision on vectorized sequential EHR, which is not applicable to large-scale unsupervised scenarios. Recently, contrastive learning shows great success on self-supervised representation learning problems. However, complex temporality often degrades the performance. We propose Graph Kernel Infomax, a self-supervised graph kernel learning approach on the graphical representation of EHR, to overcome the previous problems. Unlike the state-of-the-art, we do not change the graph structure to construct augmented views. Instead, we use Kernel Subspace Augmentation to embed nodes into two geometrically different manifold views. The entire framework is trained",
    "link": "https://arxiv.org/abs/2209.00655",
    "context": "Title: Self-supervised Representation Learning on Electronic Health Records with Graph Kernel Infomax\nAbstract: arXiv:2209.00655v2 Announce Type: replace  Abstract: Learning Electronic Health Records (EHRs) representation is a preeminent yet under-discovered research topic. It benefits various clinical decision support applications, e.g., medication outcome prediction or patient similarity search. Current approaches focus on task-specific label supervision on vectorized sequential EHR, which is not applicable to large-scale unsupervised scenarios. Recently, contrastive learning shows great success on self-supervised representation learning problems. However, complex temporality often degrades the performance. We propose Graph Kernel Infomax, a self-supervised graph kernel learning approach on the graphical representation of EHR, to overcome the previous problems. Unlike the state-of-the-art, we do not change the graph structure to construct augmented views. Instead, we use Kernel Subspace Augmentation to embed nodes into two geometrically different manifold views. The entire framework is trained",
    "path": "papers/22/09/2209.00655.json",
    "total_tokens": 682,
    "translated_title": "基于图核Infomax的电子健康记录自监督表征学习",
    "translated_abstract": "学习电子健康记录（EHRs）表征是一个重要但尚未被充分发掘的研究课题。这有利于各种临床决策支持应用，例如药物结果预测或患者相似性搜索。我们提出了一种自监督图核学习方法，称为Graph Kernel Infomax，用于处理EHR的图形表征，以克服先前的问题。",
    "tldr": "提出了一种名为Graph Kernel Infomax的自监督图核学习方法，用于处理电子健康记录的表征，克服了复杂时间性对性能的影响。",
    "en_tdlr": "Proposed a self-supervised graph kernel learning approach called Graph Kernel Infomax for representation learning on electronic health records, overcoming the performance degradation caused by complex temporality."
}