{
    "title": "Predicting Swarm Equatorial Plasma Bubbles via Machine Learning and Shapley Values. (arXiv:2209.13482v2 [physics.space-ph] UPDATED)",
    "abstract": "In this study we present AI Prediction of Equatorial Plasma Bubbles (APE), a machine learning model that can accurately predict the Ionospheric Bubble Index (IBI) on the Swarm spacecraft. IBI is a correlation ($R^2$) between perturbations in plasma density and the magnetic field, whose source can be Equatorial Plasma Bubbles (EPBs). EPBs have been studied for a number of years, but their day-to-day variability has made predicting them a considerable challenge. We build an ensemble machine learning model to predict IBI. We use data from 2014-22 at a resolution of 1sec, and transform it from a time-series into a 6-dimensional space with a corresponding EPB $R^2$ (0-1) acting as the label. APE performs well across all metrics, exhibiting a skill, association and root mean squared error score of 0.96, 0.98 and 0.08 respectively. The model performs best post-sunset, in the American/Atlantic sector, around the equinoxes, and when solar activity is high. This is promising because EPBs are mos",
    "link": "http://arxiv.org/abs/2209.13482",
    "context": "Title: Predicting Swarm Equatorial Plasma Bubbles via Machine Learning and Shapley Values. (arXiv:2209.13482v2 [physics.space-ph] UPDATED)\nAbstract: In this study we present AI Prediction of Equatorial Plasma Bubbles (APE), a machine learning model that can accurately predict the Ionospheric Bubble Index (IBI) on the Swarm spacecraft. IBI is a correlation ($R^2$) between perturbations in plasma density and the magnetic field, whose source can be Equatorial Plasma Bubbles (EPBs). EPBs have been studied for a number of years, but their day-to-day variability has made predicting them a considerable challenge. We build an ensemble machine learning model to predict IBI. We use data from 2014-22 at a resolution of 1sec, and transform it from a time-series into a 6-dimensional space with a corresponding EPB $R^2$ (0-1) acting as the label. APE performs well across all metrics, exhibiting a skill, association and root mean squared error score of 0.96, 0.98 and 0.08 respectively. The model performs best post-sunset, in the American/Atlantic sector, around the equinoxes, and when solar activity is high. This is promising because EPBs are mos",
    "path": "papers/22/09/2209.13482.json",
    "total_tokens": 1000,
    "translated_title": "使用机器学习和Shapley值预测群集赤道等离子体泡的论文",
    "translated_abstract": "本研究中，我们提出了一种名为APE的机器学习模型，可以准确预测Swarm航天器上的电离层泡指数（IBI）。IBI是等离子体密度扰动与磁场之间的相关性（$R^2$），其来源可以是赤道等离子体泡（EPB）。EPB已经研究了多年，但其天天变化使得对其进行预测成为一项相当大的挑战。我们构建了一个集成机器学习模型来预测IBI。我们使用2014-22年的数据，分辨率为1秒，并将其转换为一个具有相应EPB $R^2$（0-1）标签的6维空间。APE在所有指标上表现良好，展示了分数、关联和均方根误差分别为0.96、0.98和0.08。该模型在日落后、美洲/大西洋地区、春秋分和太阳活动较高时表现最佳。这是一个有希望的结果，因为EPB是最重要的等离子体物理现象之一。",
    "tldr": "本研究提出了一种名为APE的机器学习模型，可以准确预测Swarm航天器上的等离子体泡指数。该模型在各项指标上表现良好，对赤道等离子体泡的预测具有重要意义。"
}