{
    "title": "Just Noticeable Difference Modeling for Face Recognition System. (arXiv:2209.05856v2 [cs.CV] UPDATED)",
    "abstract": "High-quality face images are required to guarantee the stability and reliability of automatic face recognition (FR) systems in surveillance and security scenarios. However, a massive amount of face data is usually compressed before being analyzed due to limitations on transmission or storage. The compressed images may lose the powerful identity information, resulting in the performance degradation of the FR system. Herein, we make the first attempt to study just noticeable difference (JND) for the FR system, which can be defined as the maximum distortion that the FR system cannot notice. More specifically, we establish a JND dataset including 3530 original images and 137,670 compressed images generated by advanced reference encoding/decoding software based on the Versatile Video Coding (VVC) standard (VTM-15.0). Subsequently, we develop a novel JND prediction model to directly infer JND images for the FR system. In particular, in order to maximum redundancy removal without impairment o",
    "link": "http://arxiv.org/abs/2209.05856",
    "context": "Title: Just Noticeable Difference Modeling for Face Recognition System. (arXiv:2209.05856v2 [cs.CV] UPDATED)\nAbstract: High-quality face images are required to guarantee the stability and reliability of automatic face recognition (FR) systems in surveillance and security scenarios. However, a massive amount of face data is usually compressed before being analyzed due to limitations on transmission or storage. The compressed images may lose the powerful identity information, resulting in the performance degradation of the FR system. Herein, we make the first attempt to study just noticeable difference (JND) for the FR system, which can be defined as the maximum distortion that the FR system cannot notice. More specifically, we establish a JND dataset including 3530 original images and 137,670 compressed images generated by advanced reference encoding/decoding software based on the Versatile Video Coding (VVC) standard (VTM-15.0). Subsequently, we develop a novel JND prediction model to directly infer JND images for the FR system. In particular, in order to maximum redundancy removal without impairment o",
    "path": "papers/22/09/2209.05856.json",
    "total_tokens": 880,
    "translated_title": "人脸识别系统中的可察觉差异建模",
    "translated_abstract": "监控和安全场景中，为确保自动人脸识别（FR）系统的稳定性和可靠性，需要高质量的人脸图像。然而，由于传输或存储的限制，通常会对大量人脸数据进行压缩分析。压缩后的图像可能会丢失重要的身份信息，导致FR系统性能下降。本文首次尝试研究FR系统的可察觉差异（JND），即FR系统无法注意到的最大失真。具体而言，我们建立了一个包括3530个原始图像和137,670个由先进的参考编解码软件基于Versatile Video Coding（VVC）标准（VTM-15.0）生成的压缩图像的JND数据集。随后，我们开发了一种新颖的JND预测模型，用于直接推断FR系统的JND图像。特别地，我们旨在最大限度地去除冗余而不损害 FR 系统。",
    "tldr": "本研究探讨了人脸识别系统中的可察觉差异（JND），建立了JND数据集，并开发了一种新颖的JND预测模型，以提升自动人脸识别系统的性能。"
}