{
    "title": "Deep Convolutional Pooling Transformer for Deepfake Detection. (arXiv:2209.05299v4 [cs.CV] UPDATED)",
    "abstract": "Recently, Deepfake has drawn considerable public attention due to security and privacy concerns in social media digital forensics. As the wildly spreading Deepfake videos on the Internet become more realistic, traditional detection techniques have failed in distinguishing between real and fake. Most existing deep learning methods mainly focus on local features and relations within the face image using convolutional neural networks as a backbone. However, local features and relations are insufficient for model training to learn enough general information for Deepfake detection. Therefore, the existing Deepfake detection methods have reached a bottleneck to further improve the detection performance. To address this issue, we propose a deep convolutional Transformer to incorporate the decisive image features both locally and globally. Specifically, we apply convolutional pooling and re-attention to enrich the extracted features and enhance efficacy. Moreover, we employ the barely discusse",
    "link": "http://arxiv.org/abs/2209.05299",
    "context": "Title: Deep Convolutional Pooling Transformer for Deepfake Detection. (arXiv:2209.05299v4 [cs.CV] UPDATED)\nAbstract: Recently, Deepfake has drawn considerable public attention due to security and privacy concerns in social media digital forensics. As the wildly spreading Deepfake videos on the Internet become more realistic, traditional detection techniques have failed in distinguishing between real and fake. Most existing deep learning methods mainly focus on local features and relations within the face image using convolutional neural networks as a backbone. However, local features and relations are insufficient for model training to learn enough general information for Deepfake detection. Therefore, the existing Deepfake detection methods have reached a bottleneck to further improve the detection performance. To address this issue, we propose a deep convolutional Transformer to incorporate the decisive image features both locally and globally. Specifically, we apply convolutional pooling and re-attention to enrich the extracted features and enhance efficacy. Moreover, we employ the barely discusse",
    "path": "papers/22/09/2209.05299.json",
    "total_tokens": 1002,
    "translated_title": "深度卷积池化变换器用于Deepfake检测",
    "translated_abstract": "最近，由于社交媒体数字取证中的安全和隐私问题，Deepfake引起了广泛的公众关注。随着互联网上越来越多逼真的Deepfake视频的传播，传统的检测技术已经无法区分真伪。大多数现有的深度学习方法主要集中在使用卷积神经网络作为骨干，以局部特征和脸部图像内关系为重点。然而，局部特征和关系对于模型训练学习足够的一般信息来进行Deepfake检测是不充分的。因此，现有的Deepfake检测方法已经达到了进一步提高检测性能的瓶颈。为了解决这个问题，我们提出了一种深度卷积变换器，以同时在局部和全局上合并关键的图像特征。具体来说，我们应用了卷积池化和重新注意力机制来丰富提取的特征和增强效能。此外，我们采用了鲜为人知的注意力掩模丢失方法来进一步提高模型的泛化能力。实验结果表明，我们提出的方法在多个基准数据集上实现了最先进的性能。",
    "tldr": "本文提出了一种深度卷积池化变换器用于Deepfake检测，能够全面地融合局部和全局的图像特征，并采用注意力掩模丢失方法提高模型泛化能力，获得了多个基准数据集上的最优检测性能。",
    "en_tdlr": "This paper proposes a deep convolutional pooling transformer for Deepfake detection, which comprehensively integrates local and global image features, and incorporates attention mask dropout approach to improve the model's generalization ability, achieving state-of-the-art performance on multiple benchmark datasets."
}