{
    "title": "Recipro-CAM: Fast gradient-free visual explanations for convolutional neural networks. (arXiv:2209.14074v3 [cs.CV] UPDATED)",
    "abstract": "The Convolutional Neural Network (CNN) is a widely used deep learning architecture for computer vision. However, its black box nature makes it difficult to interpret the behavior of the model. To mitigate this issue, AI practitioners have explored explainable AI methods like Class Activation Map (CAM) and Grad-CAM. Although these methods have shown promise, they are limited by architectural constraints or the burden of gradient computing. To overcome this issue, Score-CAM and Ablation-CAM have been proposed as gradient-free methods, but they have longer execution times compared to CAM or Grad-CAM based methods, making them unsuitable for real-world solution though they resolved gradient related issues and enabled inference mode XAI. To address this challenge, we propose a fast gradient-free Reciprocal CAM (Recipro-CAM) method. Our approach involves spatially masking the extracted feature maps to exploit the correlation between activation maps and network predictions for target classes.",
    "link": "http://arxiv.org/abs/2209.14074",
    "total_tokens": 995,
    "translated_title": "Recipro-CAM: 基于快速无梯度的可解释性卷积神经网络的视觉解释方法",
    "translated_abstract": "卷积神经网络（CNN）是计算机视觉中广泛使用的深度学习架构。然而，它的黑盒本质使得难以解释模型的行为。为了缓解这个问题，AI从业者探索了可解释性AI方法，如Class Activation Map（CAM）和Grad-CAM。虽然这些方法表现出了很好的前景，但它们受到架构限制或梯度计算负担的限制。为了解决这个问题，提出了Score-CAM和Ablation-CAM作为无梯度方法，但与基于CAM或Grad-CAM的方法相比，它们具有更长的执行时间，使它们不适合实际解决方案，尽管它们解决了梯度相关问题并启用了推理模式XAI。为了解决这个挑战，我们提出了一种快速无梯度的Recipro-CAM方法。我们的方法涉及对提取的特征图进行空间掩蔽，以利用激活图和目标类别的网络预测之间的相关性。",
    "tldr": "Recipro-CAM是一种快速无梯度的可解释性卷积神经网络的视觉解释方法，通过对提取的特征图进行空间掩蔽，利用激活图和目标类别的网络预测之间的相关性，解决了CAM和Grad-CAM方法的架构限制和梯度计算负担问题，具有更短的执行时间，适用于实际解决方案。",
    "en_tldr": "Recipro-CAM is a fast gradient-free visual explanation method for interpretable convolutional neural networks. It solves the architectural constraints and gradient computing burden issues of CAM and Grad-CAM methods by spatially masking the extracted feature maps to exploit the correlation between activation maps and network predictions for target classes, with shorter execution time and practical applicability."
}