{
    "title": "Extractive is not Faithful: An Investigation of Broad Unfaithfulness Problems in Extractive Summarization. (arXiv:2209.03549v2 [cs.CL] UPDATED)",
    "abstract": "The problems of unfaithful summaries have been widely discussed under the context of abstractive summarization. Though extractive summarization is less prone to the common unfaithfulness issues of abstractive summaries, does that mean extractive is equal to faithful? Turns out that the answer is no. In this work, we define a typology with five types of broad unfaithfulness problems (including and beyond not-entailment) that can appear in extractive summaries, including incorrect coreference, incomplete coreference, incorrect discourse, incomplete discourse, as well as other misleading information. We ask humans to label these problems out of 1600 English summaries produced by 16 diverse extractive systems. We find that 30% of the summaries have at least one of the five issues. To automatically detect these problems, we find that 5 existing faithfulness evaluation metrics for summarization have poor correlations with human judgment. To remedy this, we propose a new metric, ExtEval, that",
    "link": "http://arxiv.org/abs/2209.03549",
    "context": "Title: Extractive is not Faithful: An Investigation of Broad Unfaithfulness Problems in Extractive Summarization. (arXiv:2209.03549v2 [cs.CL] UPDATED)\nAbstract: The problems of unfaithful summaries have been widely discussed under the context of abstractive summarization. Though extractive summarization is less prone to the common unfaithfulness issues of abstractive summaries, does that mean extractive is equal to faithful? Turns out that the answer is no. In this work, we define a typology with five types of broad unfaithfulness problems (including and beyond not-entailment) that can appear in extractive summaries, including incorrect coreference, incomplete coreference, incorrect discourse, incomplete discourse, as well as other misleading information. We ask humans to label these problems out of 1600 English summaries produced by 16 diverse extractive systems. We find that 30% of the summaries have at least one of the five issues. To automatically detect these problems, we find that 5 existing faithfulness evaluation metrics for summarization have poor correlations with human judgment. To remedy this, we propose a new metric, ExtEval, that",
    "path": "papers/22/09/2209.03549.json",
    "total_tokens": 953,
    "translated_title": "抽取式总结的不忠实性：广泛的不忠实问题调查",
    "translated_abstract": "在抽象式总结的背景下，不忠实总结的问题已经被广泛讨论。虽然相较于抽象式总结，抽取式总结更少倾向于普遍的不忠实问题，但这是否意味着抽取式总结等同于忠实呢？结果证明并非如此。在这项工作中，我们定义了一种五种广泛的不忠实问题（包括和超出非蕴含）的分类，这些问题可能出现在抽取式总结中，包括不正确的共指、不完整的共指、不正确的话语、不完整的话语，以及其他具有误导性的信息。我们要求人类对由16个不同的抽取式系统产生的1600篇英文摘要进行标注，我们发现30%的摘要中至少存在五个问题中的一个。为了自动检测这些问题，我们发现5种现有的总结忠实度评估度量与人类评判的相关性差。为了解决这个问题，我们提出了一个新的度量标准 ExtEval。",
    "tldr": "本论文调查抽取式总结中存在的五种广泛的不忠实问题，并发现30%的抽取式摘要存在至少一种问题。为了自动检测这些问题，提出了新的度量标准 ExtEval。"
}