{
    "title": "Kernel Learning for Explainable Climate Science. (arXiv:2209.04947v2 [cs.LG] UPDATED)",
    "abstract": "The Upper Indus Basin, Himalayas provides water for 270 million people and countless ecosystems. However, precipitation, a key component to hydrological modelling, is poorly understood in this area. A key challenge surrounding this uncertainty comes from the complex spatial-temporal distribution of precipitation across the basin. In this work we propose Gaussian processes with structured non-stationary kernels to model precipitation patterns in the UIB. Previous attempts to quantify or model precipitation in the Hindu Kush Karakoram Himalayan region have often been qualitative or include crude assumptions and simplifications which cannot be resolved at lower resolutions. This body of research also provides little to no error propagation. We account for the spatial variation in precipitation with a non-stationary Gibbs kernel parameterised with an input dependent lengthscale. This allows the posterior function samples to adapt to the varying precipitation patterns inherent in the distin",
    "link": "http://arxiv.org/abs/2209.04947",
    "context": "Title: Kernel Learning for Explainable Climate Science. (arXiv:2209.04947v2 [cs.LG] UPDATED)\nAbstract: The Upper Indus Basin, Himalayas provides water for 270 million people and countless ecosystems. However, precipitation, a key component to hydrological modelling, is poorly understood in this area. A key challenge surrounding this uncertainty comes from the complex spatial-temporal distribution of precipitation across the basin. In this work we propose Gaussian processes with structured non-stationary kernels to model precipitation patterns in the UIB. Previous attempts to quantify or model precipitation in the Hindu Kush Karakoram Himalayan region have often been qualitative or include crude assumptions and simplifications which cannot be resolved at lower resolutions. This body of research also provides little to no error propagation. We account for the spatial variation in precipitation with a non-stationary Gibbs kernel parameterised with an input dependent lengthscale. This allows the posterior function samples to adapt to the varying precipitation patterns inherent in the distin",
    "path": "papers/22/09/2209.04947.json",
    "total_tokens": 855,
    "translated_title": "可解释的气候科学的核心学习",
    "translated_abstract": "喜马拉雅山上游印度河流域为2.7亿人口和无数生态系统提供水资源。然而，降水作为水文模拟的关键组成部分，在这个地区的理解还很有限。这种不确定性围绕在河流域的复杂时空降水分布。本文提出使用具有结构化非平稳核的高斯过程来模拟上游印度河流域的降水模式。以往在印度喜马拉雅山区量化或模拟降水的尝试往往是定性的，包括了粗糙的假设和简化，无法解决低分辨率下的问题。此外，这些研究几乎没有考虑误差传播。我们利用非平稳的吉布斯核和依赖输入的长度参数来考虑降水的空间变化，使得后验函数样本能够适应这一区域固有的降水模式的多样性。",
    "tldr": "本文通过使用具有结构化非平稳核的高斯过程来模拟上游印度河流域的降水模式，解决了对该地区复杂时空降水分布的理解不足的问题。",
    "en_tdlr": "This paper addresses the limited understanding of complex spatial-temporal distribution of precipitation in the Upper Indus Basin by proposing Gaussian processes with structured non-stationary kernels for modeling precipitation patterns in the region."
}