{
    "title": "Granger Causal Chain Discovery for Sepsis-Associated Derangements via Continuous-Time Hawkes Processes. (arXiv:2209.04480v5 [stat.AP] UPDATED)",
    "abstract": "Modern health care systems are conducting continuous, automated surveillance of the electronic medical record (EMR) to identify adverse events with increasing frequency; however, many events such as sepsis do not have elucidated prodromes (i.e., event chains) that can be used to identify and intercept the adverse event early in its course. Clinically relevant and interpretable results require a framework that can (i) infer temporal interactions across multiple patient features found in EMR data (e.g., Labs, vital signs, etc.) and (ii) identify patterns that precede and are specific to an impending adverse event (e.g., sepsis). In this work, we propose a linear multivariate Hawkes process model, coupled with ReLU link function, to recover a Granger Causal (GC) graph with both exciting and inhibiting effects. We develop a scalable two-phase gradient-based method to obtain a maximum surrogate-likelihood estimator, which is shown to be effective via extensive numerical simulation. Our meth",
    "link": "http://arxiv.org/abs/2209.04480",
    "context": "Title: Granger Causal Chain Discovery for Sepsis-Associated Derangements via Continuous-Time Hawkes Processes. (arXiv:2209.04480v5 [stat.AP] UPDATED)\nAbstract: Modern health care systems are conducting continuous, automated surveillance of the electronic medical record (EMR) to identify adverse events with increasing frequency; however, many events such as sepsis do not have elucidated prodromes (i.e., event chains) that can be used to identify and intercept the adverse event early in its course. Clinically relevant and interpretable results require a framework that can (i) infer temporal interactions across multiple patient features found in EMR data (e.g., Labs, vital signs, etc.) and (ii) identify patterns that precede and are specific to an impending adverse event (e.g., sepsis). In this work, we propose a linear multivariate Hawkes process model, coupled with ReLU link function, to recover a Granger Causal (GC) graph with both exciting and inhibiting effects. We develop a scalable two-phase gradient-based method to obtain a maximum surrogate-likelihood estimator, which is shown to be effective via extensive numerical simulation. Our meth",
    "path": "papers/22/09/2209.04480.json",
    "total_tokens": 1095,
    "translated_title": "基于连续时间霍克过程的败血症相关异常的Granger因果链发现",
    "translated_abstract": "现代医疗保健系统正在增加对电子病历（EMR）进行连续自动监测，以更频繁地识别不良事件; 但是，许多事件（如败血症）没有已阐明的前驱症状（即事件链），可以用于在其病程早期识别和截获不良事件。临床相关且可解释的结果需要一个框架，该框架可以（i）推断EMR数据中多个患者特征之间的时间交互作用（例如实验室检查、生命体征等），并且可以（ii）确定在即将发生的不良事件（例如败血症）之前先导且特定的模式。在这项工作中，我们提出了一个线性多元霍克过程模型，结合ReLU链接函数，以恢复具有兴奋和抑制效应的Granger因果（GC）图。我们开发了一个可扩展的两阶段梯度下降方法，以获得最大似然估计值，通过广泛的数值模拟证明了其有效性。我们的方法在大型EMR数据集上进行了验证，并显示败血症相关实验室异常的可解释的时间模式。这些模式建议了一条实验室价值观的链，可以帮助早期检测和管理败血症相关异常。",
    "tldr": "本文提出了一个基于连续时间霍克过程的Granger因果链发现方法，可用于推断EMR数据中多个患者特征之间的时间交互作用，并确定败血症相关异常的实验室值链。",
    "en_tdlr": "This paper proposes a Granger causal chain discovery method based on continuous-time Hawkes processes to infer temporal interactions across multiple patient features found in EMR data and identify a laboratory value chain that could help in early detection and management of sepsis-associated derangements."
}