{
    "title": "PePe: Personalized Post-editing Model utilizing User-generated Post-edits. (arXiv:2209.10139v2 [cs.CL] UPDATED)",
    "abstract": "Incorporating personal preference is crucial in advanced machine translation tasks. Despite the recent advancement of machine translation, it remains a demanding task to properly reflect personal style. In this paper, we introduce a personalized automatic post-editing framework to address this challenge, which effectively generates sentences considering distinct personal behaviors. To build this framework, we first collect post-editing data that connotes the user preference from a live machine translation system. Specifically, real-world users enter source sentences for translation and edit the machine-translated outputs according to the user's preferred style. We then propose a model that combines a discriminator module and user-specific parameters on the APE framework. Experimental results show that the proposed method outperforms other baseline models on four different metrics (i.e., BLEU, TER, YiSi-1, and human evaluation).",
    "link": "http://arxiv.org/abs/2209.10139",
    "context": "Title: PePe: Personalized Post-editing Model utilizing User-generated Post-edits. (arXiv:2209.10139v2 [cs.CL] UPDATED)\nAbstract: Incorporating personal preference is crucial in advanced machine translation tasks. Despite the recent advancement of machine translation, it remains a demanding task to properly reflect personal style. In this paper, we introduce a personalized automatic post-editing framework to address this challenge, which effectively generates sentences considering distinct personal behaviors. To build this framework, we first collect post-editing data that connotes the user preference from a live machine translation system. Specifically, real-world users enter source sentences for translation and edit the machine-translated outputs according to the user's preferred style. We then propose a model that combines a discriminator module and user-specific parameters on the APE framework. Experimental results show that the proposed method outperforms other baseline models on four different metrics (i.e., BLEU, TER, YiSi-1, and human evaluation).",
    "path": "papers/22/09/2209.10139.json",
    "total_tokens": 922,
    "translated_title": "PePe: 利用用户生成的后编辑实现个性化的后编辑模型",
    "translated_abstract": "在先进的机器翻译任务中，将个人的偏好加以考虑至关重要。尽管机器翻译已经取得了近期的重大进展，但是正确反映个人风格仍然是一个具有挑战性的任务。在本论文中，我们引入了一个个性化的自动后编辑框架来解决这个难题，这个框架能够有效地生成考虑到不同个人行为的句子。为了构建这个框架，我们首先从实时机器翻译系统中收集包含用户偏好的后编辑数据。具体而言，真实用户输入想要翻译的源语句，并根据用户的风格偏好编辑机器翻译的输出。接着，我们提出了一个模型，在APE框架上结合了一个判别模块和用户特定的参数。实验结果表明，所提出的方法在四种不同的度量标准（即BLEU，TER，YiSi-1和人类评估）上优于其他基线模型。",
    "tldr": "本文提出了一种个性化的自动后编辑框架PePe，在一个实时的机器翻译系统中，通过收集用户后编辑数据，结合判别模块和用户特定参数，能够有效地生成考虑到不同个人行为的句子，并在多个度量标准上优于其他基线模型。",
    "en_tdlr": "This paper proposes a personalized automatic post-editing framework, PePe, which collects user post-editing data from a live machine translation system and effectively generates sentences with distinct personal behaviors through combining a discriminator module and user-specific parameters in the APE framework. The proposed method outperforms other baseline models on four different metrics."
}