{
    "title": "Unified Control Framework for Real-Time Interception and Obstacle Avoidance of Fast-Moving Objects with Diffusion Variational Autoencoder",
    "abstract": "arXiv:2209.13628v2 Announce Type: replace-cross  Abstract: Real-time interception of fast-moving objects by robotic arms in dynamic environments poses a formidable challenge due to the need for rapid reaction times, often within milliseconds, amidst dynamic obstacles. This paper introduces a unified control framework to address the above challenge by simultaneously intercepting dynamic objects and avoiding moving obstacles. Central to our approach is using diffusion-based variational autoencoder for motion planning to perform both object interception and obstacle avoidance. We begin by encoding the high-dimensional temporal information from streaming events into a two-dimensional latent manifold, enabling the discrimination between safe and colliding trajectories, culminating in the construction of an offline densely connected trajectory graph. Subsequently, we employ an extended Kalman filter to achieve precise real-time tracking of the moving object. Leveraging a graph-traversing str",
    "link": "https://arxiv.org/abs/2209.13628",
    "context": "Title: Unified Control Framework for Real-Time Interception and Obstacle Avoidance of Fast-Moving Objects with Diffusion Variational Autoencoder\nAbstract: arXiv:2209.13628v2 Announce Type: replace-cross  Abstract: Real-time interception of fast-moving objects by robotic arms in dynamic environments poses a formidable challenge due to the need for rapid reaction times, often within milliseconds, amidst dynamic obstacles. This paper introduces a unified control framework to address the above challenge by simultaneously intercepting dynamic objects and avoiding moving obstacles. Central to our approach is using diffusion-based variational autoencoder for motion planning to perform both object interception and obstacle avoidance. We begin by encoding the high-dimensional temporal information from streaming events into a two-dimensional latent manifold, enabling the discrimination between safe and colliding trajectories, culminating in the construction of an offline densely connected trajectory graph. Subsequently, we employ an extended Kalman filter to achieve precise real-time tracking of the moving object. Leveraging a graph-traversing str",
    "path": "papers/22/09/2209.13628.json",
    "total_tokens": 693,
    "translated_title": "统一控制框架：利用扩散变分自编码器实现快速移动物体的实时拦截和避障",
    "translated_abstract": "在动态环境中通过机器人臂实现对快速移动物体的实时拦截面临巨大挑战，原因是需要在动态障碍物中迅速做出反应，通常在毫秒级别内。本文引入了一个统一的控制框架来解决上述挑战，通过同时拦截动态物体和避开移动障碍物。我们的方法的核心是使用基于扩散的变分自编码器进行运动规划，以执行物体拦截和障碍物避开。",
    "tldr": "使用扩散变分自编码器实现快速移动物体的实时拦截和避障",
    "en_tdlr": "Real-time interception and obstacle avoidance of fast-moving objects achieved through diffusion variational autoencoder."
}