{
    "title": "Learning to Exploit Elastic Actuators for Quadruped Locomotion. (arXiv:2209.07171v2 [cs.RO] UPDATED)",
    "abstract": "Spring-based actuators in legged locomotion provide energy-efficiency and improved performance, but increase the difficulty of controller design. While previous work has focused on extensive modeling and simulation to find optimal controllers for such systems, we propose to learn model-free controllers directly on the real robot. In our approach, gaits are first synthesized by central pattern generators (CPGs), whose parameters are optimized to quickly obtain an open-loop controller that achieves efficient locomotion. Then, to make this controller more robust and further improve the performance, we use reinforcement learning to close the loop, to learn corrective actions on top of the CPGs. We evaluate the proposed approach on the DLR elastic quadruped bert. Our results in learning trotting and pronking gaits show that exploitation of the spring actuator dynamics emerges naturally from optimizing for dynamic motions, yielding high-performing locomotion despite being model-free. The who",
    "link": "http://arxiv.org/abs/2209.07171",
    "context": "Title: Learning to Exploit Elastic Actuators for Quadruped Locomotion. (arXiv:2209.07171v2 [cs.RO] UPDATED)\nAbstract: Spring-based actuators in legged locomotion provide energy-efficiency and improved performance, but increase the difficulty of controller design. While previous work has focused on extensive modeling and simulation to find optimal controllers for such systems, we propose to learn model-free controllers directly on the real robot. In our approach, gaits are first synthesized by central pattern generators (CPGs), whose parameters are optimized to quickly obtain an open-loop controller that achieves efficient locomotion. Then, to make this controller more robust and further improve the performance, we use reinforcement learning to close the loop, to learn corrective actions on top of the CPGs. We evaluate the proposed approach on the DLR elastic quadruped bert. Our results in learning trotting and pronking gaits show that exploitation of the spring actuator dynamics emerges naturally from optimizing for dynamic motions, yielding high-performing locomotion despite being model-free. The who",
    "path": "papers/22/09/2209.07171.json",
    "total_tokens": 908,
    "translated_title": "学习利用弹性执行器进行四足动物的运动控制",
    "translated_abstract": "在四足运动中，基于弹簧的执行器可以提高能效和性能，但也增加了控制器设计的难度。以往的工作主要是通过建模与仿真来寻找最优的控制器，而本文提出直接在真实机器人上学习无模型控制器。我们的方法是首先由中央模式发生器（CPGs）合成步态，通过优化这些参数得到一种能够实现高效运动的开环控制器。然后，为了使控制器更加稳健并进一步提高性能，本文采用强化学习来闭环控制，学习在CPGs之上的矫正动作。我们在DLR弹性四足机器人上评估了所提出的方法。学习到的慢跑和跳跃步态表明，在优化动态运动时利用弹性执行器动力学是自然发生的，尽管无模型控制器，但仍可实现高性能的运动控制。",
    "tldr": "本文提出了一种直接在真实机器人上学习无模型控制器的方法，利用弹性执行器的动力学性质优化动态运动控制，学习到的控制器可实现高性能的四足运动控制。"
}