{
    "title": "A challenge-based survey of e-recruitment recommendation systems. (arXiv:2209.05112v2 [cs.IR] UPDATED)",
    "abstract": "E-recruitment recommendation systems recommend jobs to job seekers and job seekers to recruiters. The recommendations are generated based on the suitability of the job seekers for the positions as well as the job seekers' and the recruiters' preferences. Therefore, e-recruitment recommendation systems could greatly impact job seekers' careers. Moreover, by affecting the hiring processes of the companies, e-recruitment recommendation systems play an important role in shaping the companies' competitive edge in the market. Hence, the domain of e-recruitment recommendation deserves specific attention. Existing surveys on this topic tend to discuss past studies from the algorithmic perspective, e.g., by categorizing them into collaborative filtering, content based, and hybrid methods. This survey, instead, takes a complementary, challenge-based approach, which we believe might be more practical to developers facing a concrete e-recruitment design task with a specific set of challenges, as w",
    "link": "http://arxiv.org/abs/2209.05112",
    "context": "Title: A challenge-based survey of e-recruitment recommendation systems. (arXiv:2209.05112v2 [cs.IR] UPDATED)\nAbstract: E-recruitment recommendation systems recommend jobs to job seekers and job seekers to recruiters. The recommendations are generated based on the suitability of the job seekers for the positions as well as the job seekers' and the recruiters' preferences. Therefore, e-recruitment recommendation systems could greatly impact job seekers' careers. Moreover, by affecting the hiring processes of the companies, e-recruitment recommendation systems play an important role in shaping the companies' competitive edge in the market. Hence, the domain of e-recruitment recommendation deserves specific attention. Existing surveys on this topic tend to discuss past studies from the algorithmic perspective, e.g., by categorizing them into collaborative filtering, content based, and hybrid methods. This survey, instead, takes a complementary, challenge-based approach, which we believe might be more practical to developers facing a concrete e-recruitment design task with a specific set of challenges, as w",
    "path": "papers/22/09/2209.05112.json",
    "total_tokens": 859,
    "translated_title": "一个基于挑战的电子招聘推荐系统调查",
    "translated_abstract": "电子招聘推荐系统会为求职者推荐工作，也会为招聘者推荐求职者。推荐是根据求职者适合职位以及求职者和招聘者的偏好生成的。因此，电子招聘推荐系统对求职者的职业发展有着重要影响。此外，通过影响公司的招聘流程，电子招聘推荐系统在塑造公司在市场的竞争优势方面扮演着重要角色。因此，电子招聘推荐领域值得特别关注。现有的调查往往从算法的角度讨论过去的研究，例如将它们分为协同过滤、基于内容和混合方法。而这项调查则采取了一个互补的、基于挑战的方法，我们认为这对于面临具体招聘设计任务和一系列具体挑战的开发人员更加实用。",
    "tldr": "这篇论文提供了一个基于挑战的电子招聘推荐系统调查，该调查以实用性为导向，适用于面临具体招聘设计任务和挑战的开发人员。",
    "en_tdlr": "This paper presents a challenge-based survey of e-recruitment recommendation systems, which takes a practical approach suitable for developers facing specific design tasks and challenges in the field of recruitment."
}