{
    "title": "Keypoint-GraspNet: Keypoint-based 6-DoF Grasp Generation from the Monocular RGB-D input. (arXiv:2209.08752v3 [cs.RO] UPDATED)",
    "abstract": "Great success has been achieved in the 6-DoF grasp learning from the point cloud input, yet the computational cost due to the point set orderlessness remains a concern. Alternatively, we explore the grasp generation from the RGB-D input in this paper. The proposed solution, Keypoint-GraspNet, detects the projection of the gripper keypoints in the image space and then recover the SE(3) poses with a PnP algorithm. A synthetic dataset based on the primitive shape and the grasp family is constructed to examine our idea. Metric-based evaluation reveals that our method outperforms the baselines in terms of the grasp proposal accuracy, diversity, and the time cost. Finally, robot experiments show high success rate, demonstrating the potential of the idea in the real-world applications.",
    "link": "http://arxiv.org/abs/2209.08752",
    "context": "Title: Keypoint-GraspNet: Keypoint-based 6-DoF Grasp Generation from the Monocular RGB-D input. (arXiv:2209.08752v3 [cs.RO] UPDATED)\nAbstract: Great success has been achieved in the 6-DoF grasp learning from the point cloud input, yet the computational cost due to the point set orderlessness remains a concern. Alternatively, we explore the grasp generation from the RGB-D input in this paper. The proposed solution, Keypoint-GraspNet, detects the projection of the gripper keypoints in the image space and then recover the SE(3) poses with a PnP algorithm. A synthetic dataset based on the primitive shape and the grasp family is constructed to examine our idea. Metric-based evaluation reveals that our method outperforms the baselines in terms of the grasp proposal accuracy, diversity, and the time cost. Finally, robot experiments show high success rate, demonstrating the potential of the idea in the real-world applications.",
    "path": "papers/22/09/2209.08752.json",
    "total_tokens": 873,
    "translated_title": "基于关键点的单目RGB-D输入下的六自由度抓取点生成",
    "translated_abstract": "目前已经在点云输入的六自由度抓取点学习中取得了很大的成功，但由于点集无序性而导致的计算成本仍然是一个问题。本文探索了从RGB-D输入中生成抓取点的方法。我们提出了Keypoint-GraspNet解决方案，该方案在图像空间中检测夹持器关键点的投影，然后使用PnP算法恢复SE(3)姿态。基于三维形体和抓取家族构建了一个合成数据集来检验我们的想法。基于度量的评估表明，我们的方法在抓取点提案的精度、多样性和时间成本方面优于基线。最后，机器人实验展示了高成功率，证明了这种方法在实际应用中的潜力。",
    "tldr": "本文提出了一种基于关键点的单目RGB-D输入下的六自由度抓取点生成方法，该方法可以通过PnP算法恢复SE(3)姿态。机器人实验表明，我们的方法在抓取点提案的精度、多样性和时间成本方面优于其他方法并具有很强的应用潜力。",
    "en_tdlr": "This paper proposes a keypoint-based 6-DoF grasp generation method from monocular RGB-D input, which uses a PnP algorithm to recover SE(3) poses. Robot experiments show that our method outperforms baselines in terms of grasp proposal accuracy, diversity, and time cost and has strong potential for real-world applications."
}