{
    "title": "Efficient Multi-view Clustering via Unified and Discrete Bipartite Graph Learning. (arXiv:2209.04187v2 [cs.LG] UPDATED)",
    "abstract": "Although previous graph-based multi-view clustering algorithms have gained significant progress, most of them are still faced with three limitations. First, they often suffer from high computational complexity, which restricts their applications in large-scale scenarios. Second, they usually perform graph learning either at the single-view level or at the view-consensus level, but often neglect the possibility of the joint learning of single-view and consensus graphs. Third, many of them rely on the k-means for discretization of the spectral embeddings, which lack the ability to directly learn the graph with discrete cluster structure. In light of this, this paper presents an efficient multi-view clustering approach via unified and discrete bipartite graph learning (UDBGL). Specifically, the anchor-based subspace learning is incorporated to learn the view-specific bipartite graphs from multiple views, upon which the bipartite graph fusion is leveraged to learn a view-consensus bipartit",
    "link": "http://arxiv.org/abs/2209.04187",
    "context": "Title: Efficient Multi-view Clustering via Unified and Discrete Bipartite Graph Learning. (arXiv:2209.04187v2 [cs.LG] UPDATED)\nAbstract: Although previous graph-based multi-view clustering algorithms have gained significant progress, most of them are still faced with three limitations. First, they often suffer from high computational complexity, which restricts their applications in large-scale scenarios. Second, they usually perform graph learning either at the single-view level or at the view-consensus level, but often neglect the possibility of the joint learning of single-view and consensus graphs. Third, many of them rely on the k-means for discretization of the spectral embeddings, which lack the ability to directly learn the graph with discrete cluster structure. In light of this, this paper presents an efficient multi-view clustering approach via unified and discrete bipartite graph learning (UDBGL). Specifically, the anchor-based subspace learning is incorporated to learn the view-specific bipartite graphs from multiple views, upon which the bipartite graph fusion is leveraged to learn a view-consensus bipartit",
    "path": "papers/22/09/2209.04187.json",
    "total_tokens": 1223,
    "translated_title": "一种通过统一离散的双向图学习实现高效多视图聚类的方法",
    "translated_abstract": "尽管以往基于图的多视图聚类算法已经取得了重大进展，但它们大多仍然面临三个限制。首先，它们往往遭受高计算复杂度的困扰，限制了它们在大规模场景中的应用。其次，它们通常在单视图级别或视图一致性级别上执行图学习，但常常忽略了单视图和一致性图的联合学习可能性。第三，许多算法依赖于k-means对谱嵌入进行离散化，但缺乏直接学习带离散聚类结构的图的能力。因此，本文提出了一种通过统一离散的双向图学习实现高效多视图聚类的方法（UDBGL）。具体来说，该方法采用了基于锚点的子空间学习，从多个视图中学习了视图特定的双向图，然后利用双向图融合学习了视图一致性双向图。在此过程中，UDBGL通过采用低秩矩阵近似和加速交替方向乘数法避免了高计算复杂度。此外，通过最小化统一目标函数，它实现了单视图和一致性图的联合学习。最后，为了解决第三个限制，提出了一种离散优化方法，直接学习所学图的离散聚类结构。在各种数据集上的实验结果表明，UDBGL优于几种最新的多视图聚类算法。",
    "tldr": "本文提出了一种高效的多视图聚类方法，通过基于锚点的子空间学习、双向图学习和离散优化实现了单视图和一致性图的联合学习，避免了高计算复杂度，并在多个数据集上取得了优异的性能表现。",
    "en_tdlr": "This paper proposes an efficient multi-view clustering method, UDBGL, which achieves joint learning of single-view and consensus graphs via anchor-based subspace learning, bipartite graph fusion, and discrete optimization, avoiding high computational complexity, and outperforming several state-of-the-art multi-view clustering algorithms on various datasets."
}