{
    "title": "Risk-aware linear bandits with convex loss. (arXiv:2209.07154v2 [stat.ML] UPDATED)",
    "abstract": "In decision-making problems such as the multi-armed bandit, an agent learns sequentially by optimizing a certain feedback. While the mean reward criterion has been extensively studied, other measures that reflect an aversion to adverse outcomes, such as mean-variance or conditional value-at-risk (CVaR), can be of interest for critical applications (healthcare, agriculture). Algorithms have been proposed for such risk-aware measures under bandit feedback without contextual information. In this work, we study contextual bandits where such risk measures can be elicited as linear functions of the contexts through the minimization of a convex loss. A typical example that fits within this framework is the expectile measure, which is obtained as the solution of an asymmetric least-square problem. Using the method of mixtures for supermartingales, we derive confidence sequences for the estimation of such risk measures. We then propose an optimistic UCB algorithm to learn optimal risk-aware act",
    "link": "http://arxiv.org/abs/2209.07154",
    "context": "Title: Risk-aware linear bandits with convex loss. (arXiv:2209.07154v2 [stat.ML] UPDATED)\nAbstract: In decision-making problems such as the multi-armed bandit, an agent learns sequentially by optimizing a certain feedback. While the mean reward criterion has been extensively studied, other measures that reflect an aversion to adverse outcomes, such as mean-variance or conditional value-at-risk (CVaR), can be of interest for critical applications (healthcare, agriculture). Algorithms have been proposed for such risk-aware measures under bandit feedback without contextual information. In this work, we study contextual bandits where such risk measures can be elicited as linear functions of the contexts through the minimization of a convex loss. A typical example that fits within this framework is the expectile measure, which is obtained as the solution of an asymmetric least-square problem. Using the method of mixtures for supermartingales, we derive confidence sequences for the estimation of such risk measures. We then propose an optimistic UCB algorithm to learn optimal risk-aware act",
    "path": "papers/22/09/2209.07154.json",
    "total_tokens": 917,
    "translated_title": "带凸损失的风险感知线性赌博机",
    "translated_abstract": "在多臂赌博机等决策问题中，代理通过优化某种反馈进行顺序学习。虽然平均回报标准已被广泛研究，但反映对不良结果的厌恶的其他度量，例如方差、条件风险价值（CVaR），可能对关键应用（医疗保健、农业）有用。在没有上下文信息的赌博反馈下提出了用于此类风险感知度量的算法。在这项工作中，我们研究了具有上下文的赌徒，在这些赌博机反馈下，可以通过凸损失的最小化来提取这种风险度量作为上下文的线性函数。符合此框架的典型示例是expectile度量，它是通过不对称最小二乘问题的解得到的。使用卡曼超融合方法，我们导出了用于估计此类风险度量的置信序列。然后，我们提出了一种乐观的UCB算法，以学习最佳的风险感知行为。",
    "tldr": "本论文研究了带上下文的风险感知线性赌博机问题，提出了一种用于估计风险度量的置信序列，并提出了一种乐观的UCB算法以学习最佳的风险感知行为。",
    "en_tdlr": "This paper studies risk-aware contextual linear bandits, proposes a confidence sequence for estimating risk measures, and presents an optimistic UCB algorithm to learn optimal risk-aware actions."
}