{
    "title": "What does a platypus look like? Generating customized prompts for zero-shot image classification. (arXiv:2209.03320v2 [cs.CV] UPDATED)",
    "abstract": "Open-vocabulary models are a promising new paradigm for image classification. Unlike traditional classification models, open-vocabulary models classify among any arbitrary set of categories specified with natural language during inference. This natural language, called \"prompts\", typically consists of a set of hand-written templates (e.g., \"a photo of a {}\") which are completed with each of the category names. This work introduces a simple method to generate higher accuracy prompts, without relying on any explicit knowledge of the task domain and with far fewer hand-constructed sentences. To achieve this, we combine open-vocabulary models with large language models (LLMs) to create Customized Prompts via Language models (CuPL, pronounced \"couple\"). In particular, we leverage the knowledge contained in LLMs in order to generate many descriptive sentences that contain important discriminating characteristics of the image categories. This allows the model to place a greater importance on ",
    "link": "http://arxiv.org/abs/2209.03320",
    "context": "Title: What does a platypus look like? Generating customized prompts for zero-shot image classification. (arXiv:2209.03320v2 [cs.CV] UPDATED)\nAbstract: Open-vocabulary models are a promising new paradigm for image classification. Unlike traditional classification models, open-vocabulary models classify among any arbitrary set of categories specified with natural language during inference. This natural language, called \"prompts\", typically consists of a set of hand-written templates (e.g., \"a photo of a {}\") which are completed with each of the category names. This work introduces a simple method to generate higher accuracy prompts, without relying on any explicit knowledge of the task domain and with far fewer hand-constructed sentences. To achieve this, we combine open-vocabulary models with large language models (LLMs) to create Customized Prompts via Language models (CuPL, pronounced \"couple\"). In particular, we leverage the knowledge contained in LLMs in order to generate many descriptive sentences that contain important discriminating characteristics of the image categories. This allows the model to place a greater importance on ",
    "path": "papers/22/09/2209.03320.json",
    "total_tokens": 849,
    "translated_title": "长什么样的鸭嘴兽？生成自定义提示以进行零样本图像分类",
    "translated_abstract": "开放词汇模型是图像分类的一种有前景的新范式。与传统的分类模型不同，开放词汇模型在推断时对任意指定的类别集合进行分类，这些类别由自然语言表示。这种自然语言通常包含一组手写模板（例如，“一张{}的照片”），每个类别名称都会填充进去。本文介绍了一种简单的方法来生成更高准确度的提示，而不依赖于任务领域的显式知识，并且需要更少的手工构建句子。为了实现这一目标，我们将开放词汇模型与大型语言模型（LLMs）结合起来，创建出通过语言模型生成的自定义提示（CuPL，读作“couple”）。具体而言，我们利用LLMs中包含的知识来生成包含图像类别的重要区分特征的描述性句子。这使得模型更加重视这些特征。",
    "tldr": "本文介绍了一种通过结合大型语言模型和开放词汇模型生成自定义提示的方法，以提高零样本图像分类的准确性和效率。通过利用语言模型生成描述性句子的方式，这种方法能够捕捉图像类别的重要区分特征。"
}