{
    "title": "Automatic Data Augmentation via Invariance-Constrained Learning. (arXiv:2209.15031v2 [cs.LG] UPDATED)",
    "abstract": "Underlying data structures, such as symmetries or invariances to transformations, are often exploited to improve the solution of learning tasks. However, embedding these properties in models or learning algorithms can be challenging and computationally intensive. Data augmentation, on the other hand, induces these symmetries during training by applying multiple transformations to the input data. Despite its ubiquity, its effectiveness depends on the choices of which transformations to apply, when to do so, and how often. In fact, there is both empirical and theoretical evidence that the indiscriminate use of data augmentation can introduce biases that outweigh its benefits. This work tackles these issues by automatically adapting the data augmentation while solving the learning task. To do so, it formulates data augmentation as an invariance-constrained learning problem and leverages Monte Carlo Markov Chain (MCMC) sampling to solve it. The result is a practical algorithm that not only",
    "link": "http://arxiv.org/abs/2209.15031",
    "context": "Title: Automatic Data Augmentation via Invariance-Constrained Learning. (arXiv:2209.15031v2 [cs.LG] UPDATED)\nAbstract: Underlying data structures, such as symmetries or invariances to transformations, are often exploited to improve the solution of learning tasks. However, embedding these properties in models or learning algorithms can be challenging and computationally intensive. Data augmentation, on the other hand, induces these symmetries during training by applying multiple transformations to the input data. Despite its ubiquity, its effectiveness depends on the choices of which transformations to apply, when to do so, and how often. In fact, there is both empirical and theoretical evidence that the indiscriminate use of data augmentation can introduce biases that outweigh its benefits. This work tackles these issues by automatically adapting the data augmentation while solving the learning task. To do so, it formulates data augmentation as an invariance-constrained learning problem and leverages Monte Carlo Markov Chain (MCMC) sampling to solve it. The result is a practical algorithm that not only",
    "path": "papers/22/09/2209.15031.json",
    "total_tokens": 932,
    "translated_title": "通过不变性约束学习实现自动数据增强",
    "translated_abstract": "基于底层数据结构（如对称性或变换不变性），经常被利用来改善学习任务的解决方案。然而，将这些属性嵌入到模型或学习算法中可能具有挑战性且计算密集。另一方面，数据增强通过对输入数据应用多个变换来在训练过程中引入这些对称性。尽管广泛应用，但其有效性取决于应用哪些变换，何时应用以及多久应用的选择。事实上，经验和理论证据都表明，不加选择地使用数据增强可能会引入偏见，超过其好处。本研究通过在解决学习任务时自动适应数据增强来解决这些问题。为此，它将数据增强表述为一个基于不变性约束的学习问题，并利用马尔可夫链蒙特卡洛（MCMC）采样来解决它。结果是一个实用算法，不仅能够自动适应数据增强，而且能够优化学习任务的解决方案。",
    "tldr": "本论文提出了一种通过在解决学习任务时自动适应数据增强的方法，将数据增强表述为基于不变性约束的学习问题，并利用蒙特卡洛采样来解决，提出的算法能够优化学习任务的解决方案。",
    "en_tdlr": "This paper proposes a method that automatically adapts data augmentation while solving learning tasks, formulating it as an invariance-constrained learning problem and leveraging Monte Carlo sampling for solution. The proposed algorithm optimizes the solution of learning tasks."
}