{
    "title": "A Robust and Constrained Multi-Agent Reinforcement Learning Electric Vehicle Rebalancing Method in AMoD Systems. (arXiv:2209.08230v2 [cs.MA] UPDATED)",
    "abstract": "Electric vehicles (EVs) play critical roles in autonomous mobility-on-demand (AMoD) systems, but their unique charging patterns increase the model uncertainties in AMoD systems (e.g. state transition probability). Since there usually exists a mismatch between the training and test/true environments, incorporating model uncertainty into system design is of critical importance in real-world applications. However, model uncertainties have not been considered explicitly in EV AMoD system rebalancing by existing literature yet, and the coexistence of model uncertainties and constraints that the decision should satisfy makes the problem even more challenging. In this work, we design a robust and constrained multi-agent reinforcement learning (MARL) framework with state transition kernel uncertainty for EV AMoD systems. We then propose a robust and constrained MARL algorithm (ROCOMA) with robust natural policy gradients (RNPG) that trains a robust EV rebalancing policy to balance the supply-d",
    "link": "http://arxiv.org/abs/2209.08230",
    "context": "Title: A Robust and Constrained Multi-Agent Reinforcement Learning Electric Vehicle Rebalancing Method in AMoD Systems. (arXiv:2209.08230v2 [cs.MA] UPDATED)\nAbstract: Electric vehicles (EVs) play critical roles in autonomous mobility-on-demand (AMoD) systems, but their unique charging patterns increase the model uncertainties in AMoD systems (e.g. state transition probability). Since there usually exists a mismatch between the training and test/true environments, incorporating model uncertainty into system design is of critical importance in real-world applications. However, model uncertainties have not been considered explicitly in EV AMoD system rebalancing by existing literature yet, and the coexistence of model uncertainties and constraints that the decision should satisfy makes the problem even more challenging. In this work, we design a robust and constrained multi-agent reinforcement learning (MARL) framework with state transition kernel uncertainty for EV AMoD systems. We then propose a robust and constrained MARL algorithm (ROCOMA) with robust natural policy gradients (RNPG) that trains a robust EV rebalancing policy to balance the supply-d",
    "path": "papers/22/09/2209.08230.json",
    "total_tokens": 963,
    "translated_title": "AMoD系统中的稳健和约束多智能体强化学习电动汽车再平衡方法",
    "translated_abstract": "电动汽车在自主移动出行（AMoD）系统中发挥着关键作用，但其独特的充电模式增加了AMoD系统中的模型不确定性（例如状态转移概率）。由于训练环境和测试/真实环境之间通常存在不匹配情况，将模型不确定性纳入系统设计是实际应用中至关重要的。然而，现有文献尚未明确考虑模型不确定性对电动汽车AMoD系统再平衡的影响，而决策需要满足的模型不确定性和约束的共存使问题变得更加具有挑战性。在这项工作中，我们设计了一个具有状态转移核不确定性的稳健和约束的多智能体强化学习（MARL）框架用于电动汽车AMoD系统。然后，我们提出了一个使用稳健自然策略梯度（RNPG）训练稳健的电动汽车再平衡策略的稳健和约束的MARL算法（ROCOMA）。",
    "tldr": "该论文提出了一个稳健和约束的多智能体强化学习框架，用于解决电动汽车AMoD系统中的再平衡问题，并考虑了模型不确定性和决策约束。该方法能够设计出稳健的电动汽车再平衡策略，提高系统性能。"
}