{
    "title": "Dual Contrastive Network for Sequential Recommendation with User and Item-Centric Perspectives. (arXiv:2209.08446v3 [cs.IR] UPDATED)",
    "abstract": "With the outbreak of today's streaming data, the sequential recommendation is a promising solution to achieve time-aware personalized modeling. It aims to infer the next interacted item of a given user based on the history item sequence. Some recent works tend to improve the sequential recommendation via random masking on the history item so as to generate self-supervised signals. But such approaches will indeed result in sparser item sequence and unreliable signals. Besides, the existing sequential recommendation models are only user-centric, i.e., based on the historical items by chronological order to predict the probability of candidate items, which ignores whether the items from a provider can be successfully recommended. Such user-centric recommendation will make it impossible for the provider to expose their new items and result in popular bias.  In this paper, we propose a novel Dual Contrastive Network (DCN) to generate ground-truth self-supervised signals for sequential recom",
    "link": "http://arxiv.org/abs/2209.08446",
    "context": "Title: Dual Contrastive Network for Sequential Recommendation with User and Item-Centric Perspectives. (arXiv:2209.08446v3 [cs.IR] UPDATED)\nAbstract: With the outbreak of today's streaming data, the sequential recommendation is a promising solution to achieve time-aware personalized modeling. It aims to infer the next interacted item of a given user based on the history item sequence. Some recent works tend to improve the sequential recommendation via random masking on the history item so as to generate self-supervised signals. But such approaches will indeed result in sparser item sequence and unreliable signals. Besides, the existing sequential recommendation models are only user-centric, i.e., based on the historical items by chronological order to predict the probability of candidate items, which ignores whether the items from a provider can be successfully recommended. Such user-centric recommendation will make it impossible for the provider to expose their new items and result in popular bias.  In this paper, we propose a novel Dual Contrastive Network (DCN) to generate ground-truth self-supervised signals for sequential recom",
    "path": "papers/22/09/2209.08446.json",
    "total_tokens": 963,
    "translated_title": "纵向推荐中用户和物品视角的双重对比网络",
    "translated_abstract": "随着流媒体数据的爆发，纵向推荐成为实现时间感知个性化建模的一种有前途的解决方案。本文提出了一种新颖的双重对比网络（DCN），通过两个组件——基于用户的对比学习和基于物品的对比学习，充分利用了用户和物品两个视角，以生成地面真实的自监督信号，解决了随机屏蔽历史物品带来的序列稀疏性和不可靠信号的问题。实验结果表明，在三个真实数据集上，我们的方法优于当前最先进的纵向推荐方法。",
    "tldr": "本文提出了一种新颖的双重对比网络（DCN），通过两个组件充分利用了用户和物品两个视角，以生成地面真实的自监督信号，解决了随机屏蔽历史物品带来的序列稀疏性和不可靠信号的问题。实验结果表明，在三个真实数据集上，我们的方法优于当前最先进的纵向推荐方法。",
    "en_tdlr": "This paper proposes a novel Dual Contrastive Network (DCN) which makes full use of both user and item perspectives, to generate reliable self-supervised signals for sequential recommendation. DCN solves the sparsity issue caused by random masking and outperforms current state-of-the-art methods on three real-world datasets."
}