{
    "title": "Causal Modeling of Policy Interventions From Sequences of Treatments and Outcomes. (arXiv:2209.04142v5 [cs.LG] UPDATED)",
    "abstract": "A treatment policy defines when and what treatments are applied to affect some outcome of interest. Data-driven decision-making requires the ability to predict what happens if a policy is changed. Existing methods that predict how the outcome evolves under different scenarios assume that the tentative sequences of future treatments are fixed in advance, while in practice the treatments are determined stochastically by a policy and may depend, for example, on the efficiency of previous treatments. Therefore, the current methods are not applicable if the treatment policy is unknown or a counterfactual analysis is needed. To handle these limitations, we model the treatments and outcomes jointly in continuous time, by combining Gaussian processes and point processes. Our model enables the estimation of a treatment policy from observational sequences of treatments and outcomes, and it can predict the interventional and counterfactual progression of the outcome after an intervention on the t",
    "link": "http://arxiv.org/abs/2209.04142",
    "context": "Title: Causal Modeling of Policy Interventions From Sequences of Treatments and Outcomes. (arXiv:2209.04142v5 [cs.LG] UPDATED)\nAbstract: A treatment policy defines when and what treatments are applied to affect some outcome of interest. Data-driven decision-making requires the ability to predict what happens if a policy is changed. Existing methods that predict how the outcome evolves under different scenarios assume that the tentative sequences of future treatments are fixed in advance, while in practice the treatments are determined stochastically by a policy and may depend, for example, on the efficiency of previous treatments. Therefore, the current methods are not applicable if the treatment policy is unknown or a counterfactual analysis is needed. To handle these limitations, we model the treatments and outcomes jointly in continuous time, by combining Gaussian processes and point processes. Our model enables the estimation of a treatment policy from observational sequences of treatments and outcomes, and it can predict the interventional and counterfactual progression of the outcome after an intervention on the t",
    "path": "papers/22/09/2209.04142.json",
    "total_tokens": 908,
    "translated_abstract": "治疗策略定义了何时以及应如何应用治疗来影响感兴趣的结果。数据驱动的决策需要有能力预测政策改变时会发生什么。现有的方法预测在不同情境下结果如何演变时，假设未来的治疗序列是固定的，而实际上治疗是随机确定的，并且可能依赖于先前治疗的效果，因此如果治疗政策未知或需要进行反事实分析，则当前方法不适用。为了解决这些限制，我们将治疗和结果连续地建模，将高斯过程和点过程相结合。我们的模型使得可以从观测到的治疗和结果序列中估计治疗策略，并且可以预测干预和反事实情境下结果的进展。",
    "tldr": "本文提出了一种新的方法来处理治疗政策未知或需要进行反事实分析时的数据驱动决策，将高斯过程和点过程相结合建模，使得可以从观测到的治疗和结果序列中估计治疗策略，并且可以预测干预和反事实情境下结果的进展。"
}