{
    "title": "Spiking Neural Networks for event-based action recognition: A new task to understand their advantage. (arXiv:2209.14915v2 [cs.CV] UPDATED)",
    "abstract": "Spiking Neural Networks (SNN) are characterised by their unique temporal dynamics, but the properties and advantages of such computations are still not well understood. In order to provide answers, in this work we demonstrate how Spiking neurons can enable temporal feature extraction in feed-forward neural networks without the need for recurrent synapses, showing how their bio-inspired computing principles can be successfully exploited beyond energy efficiency gains and evidencing their differences with respect to conventional neurons. This is demonstrated by proposing a new task, DVS-Gesture-Chain (DVS-GC), which allows, for the first time, to evaluate the perception of temporal dependencies in a real event-based action recognition dataset. Our study proves how the widely used DVS Gesture benchmark could be solved by networks without temporal feature extraction, unlike the new DVS-GC which demands an understanding of the ordering of the events. Furthermore, this setup allowed us to un",
    "link": "http://arxiv.org/abs/2209.14915",
    "context": "Title: Spiking Neural Networks for event-based action recognition: A new task to understand their advantage. (arXiv:2209.14915v2 [cs.CV] UPDATED)\nAbstract: Spiking Neural Networks (SNN) are characterised by their unique temporal dynamics, but the properties and advantages of such computations are still not well understood. In order to provide answers, in this work we demonstrate how Spiking neurons can enable temporal feature extraction in feed-forward neural networks without the need for recurrent synapses, showing how their bio-inspired computing principles can be successfully exploited beyond energy efficiency gains and evidencing their differences with respect to conventional neurons. This is demonstrated by proposing a new task, DVS-Gesture-Chain (DVS-GC), which allows, for the first time, to evaluate the perception of temporal dependencies in a real event-based action recognition dataset. Our study proves how the widely used DVS Gesture benchmark could be solved by networks without temporal feature extraction, unlike the new DVS-GC which demands an understanding of the ordering of the events. Furthermore, this setup allowed us to un",
    "path": "papers/22/09/2209.14915.json",
    "total_tokens": 819,
    "translated_title": "基于脉冲神经网络的事件驱动动作识别：理解其优势的新任务",
    "translated_abstract": "脉冲神经网络具有独特的时间动态特性，但是这种计算的性质和优势仍然不太被了解。为了提供答案，本文展示了如何在前馈神经网络中利用脉冲神经元实现时间特征提取，无需递归突触，并展示了它们与传统神经元的差异。通过提出一个新任务DVS-Gesture-Chain（DVS-GC），我们首次对现实中的事件驱动动作识别数据集中的时间依赖进行了评估。我们的研究证明了广泛使用的DVS Gesture基准可以被不进行时间特征提取的网络解决，而新的DVS-GC则需要对事件的顺序进行理解。",
    "tldr": "本文通过提出新任务DVS-GC并进行实证研究，展示了脉冲神经网络在事件驱动动作识别中的优势，包括实现时间特征提取和对事件顺序的理解。",
    "en_tdlr": "This paper demonstrates the advantages of spiking neural networks in event-based action recognition by proposing a new task, DVS-GC, which involves temporal feature extraction and understanding the ordering of events."
}