{
    "title": "Characterizing Graph Datasets for Node Classification: Homophily-Heterophily Dichotomy and Beyond. (arXiv:2209.06177v3 [cs.SI] UPDATED)",
    "abstract": "Homophily is a graph property describing the tendency of edges to connect similar nodes; the opposite is called heterophily. It is often believed that heterophilous graphs are challenging for standard message-passing graph neural networks (GNNs), and much effort has been put into developing efficient methods for this setting. However, there is no universally agreed-upon measure of homophily in the literature. In this work, we show that commonly used homophily measures have critical drawbacks preventing the comparison of homophily levels across different datasets. For this, we formalize desirable properties for a proper homophily measure and verify which measures satisfy which properties. In particular, we show that a measure that we call adjusted homophily satisfies more desirable properties than other popular homophily measures while being rarely used in graph machine learning literature. Then, we go beyond the homophily-heterophily dichotomy and propose a new characteristic that allo",
    "link": "http://arxiv.org/abs/2209.06177",
    "context": "Title: Characterizing Graph Datasets for Node Classification: Homophily-Heterophily Dichotomy and Beyond. (arXiv:2209.06177v3 [cs.SI] UPDATED)\nAbstract: Homophily is a graph property describing the tendency of edges to connect similar nodes; the opposite is called heterophily. It is often believed that heterophilous graphs are challenging for standard message-passing graph neural networks (GNNs), and much effort has been put into developing efficient methods for this setting. However, there is no universally agreed-upon measure of homophily in the literature. In this work, we show that commonly used homophily measures have critical drawbacks preventing the comparison of homophily levels across different datasets. For this, we formalize desirable properties for a proper homophily measure and verify which measures satisfy which properties. In particular, we show that a measure that we call adjusted homophily satisfies more desirable properties than other popular homophily measures while being rarely used in graph machine learning literature. Then, we go beyond the homophily-heterophily dichotomy and propose a new characteristic that allo",
    "path": "papers/22/09/2209.06177.json",
    "total_tokens": 1011,
    "translated_title": "用于节点分类的图形数据集的特征化：同质性-异质性二分法及其延伸",
    "translated_abstract": "同质性是描述边连接相似节点倾向的图形属性；相反的概念为异质性。人们通常认为异质性图对于标准的消息传递图神经网络（GNN）是具有挑战性的，并且已经付出了许多努力来开发这种情况下的高效方法。然而，目前在文献中没有普遍被接受的同质性测量指标。在这项工作中，我们展示了常用的同质性测量方法存在严重缺陷，无法比较不同数据集中的同质性水平。为此，我们为正确的同质性测量指标形式化了期望的特性，并验证了哪些指标满足哪些特性。特别是，我们发现一种我们称之为调整同质性的指标满足比其他流行同质性测量方法更多的期望特性，而在图形机器学习文献中很少被使用。然后，我们超越了同质性-异质性二分法，提出了一种新的特征，使得...",
    "tldr": "本论文研究了用于节点分类的图形数据集的特征化，发现目前常用的同质性测量方法存在严重缺陷，无法比较不同数据集中的同质性水平。作者提出了一种新的同质性测量指标，称为调整同质性，该指标满足更多期望特性，并具有较少在图形机器学习文献中使用的特点。",
    "en_tdlr": "This paper investigates the characterization of graph datasets for node classification and identifies critical drawbacks in commonly used homophily measures. It proposes a new homophily measure, called adjusted homophily, that satisfies more desired properties and is less used in graph machine learning literature."
}