{
    "title": "The role of entanglement for enhancing the efficiency of quantum kernels towards classification. (arXiv:2209.05142v2 [quant-ph] UPDATED)",
    "abstract": "Quantum kernels are considered as potential resources to illustrate benefits of quantum computing in machine learning. Considering the impact of hyperparameters on the performance of a classical machine learning model, it is imperative to identify promising hyperparameters using quantum kernel methods in order to achieve quantum advantages. In this work, we analyse and classify sentiments of textual data using a new quantum kernel based on linear and full entangled circuits as hyperparameters for controlling the correlation among words. We also find that the use of linear and full entanglement further controls the expressivity of the Quantum Support Vector Machine (QSVM). In addition, we also compare the efficiency of the proposed circuit with other quantum circuits and classical machine learning algorithms. Our results show that the proposed fully entangled circuit outperforms all other fully or linearly entangled circuits in addition to classical algorithms for most of the features. ",
    "link": "http://arxiv.org/abs/2209.05142",
    "context": "Title: The role of entanglement for enhancing the efficiency of quantum kernels towards classification. (arXiv:2209.05142v2 [quant-ph] UPDATED)\nAbstract: Quantum kernels are considered as potential resources to illustrate benefits of quantum computing in machine learning. Considering the impact of hyperparameters on the performance of a classical machine learning model, it is imperative to identify promising hyperparameters using quantum kernel methods in order to achieve quantum advantages. In this work, we analyse and classify sentiments of textual data using a new quantum kernel based on linear and full entangled circuits as hyperparameters for controlling the correlation among words. We also find that the use of linear and full entanglement further controls the expressivity of the Quantum Support Vector Machine (QSVM). In addition, we also compare the efficiency of the proposed circuit with other quantum circuits and classical machine learning algorithms. Our results show that the proposed fully entangled circuit outperforms all other fully or linearly entangled circuits in addition to classical algorithms for most of the features. ",
    "path": "papers/22/09/2209.05142.json",
    "total_tokens": 895,
    "translated_title": "通过加强量子核函数的效率来提高分类准确性的纠缠作用",
    "translated_abstract": "量子核函数被认为是展示量子计算在机器学习中优势的潜在资源。考虑到超参数对经典机器学习模型性能的影响，使用基于量子核的方法识别有前途的超参数以实现量子优势至关重要。在此工作中，我们使用一种新的基于线性和全纠缠电路的量子核，作为控制单词之间相关性的超参数，以分析和分类文本数据的情感。我们发现，使用线性和全纠缠电路进一步控制量子支持向量机（QSVM）的表达能力。此外，我们还比较了所提出电路与其他量子电路和经典机器学习算法的效率。结果表明，所提出的全纠缠电路在大多数特征上优于所有其他全纠缠或线性纠缠电路以及经典算法。",
    "tldr": "本论文通过使用基于线性和全纠缠电路作为超参数的量子核函数，在量子支持向量机中加强了纠缠作用，提高了分类准确性和表达能力。所提出的全纠缠电路在大多数特征上优于其他全纠缠或线性纠缠电路以及经典算法。",
    "en_tdlr": "This paper enhances the efficiency of quantum kernel towards classification by using linear and fully entangled circuits as hyperparameters to control the expression and correlation among words in Quantum Support Vector Machine (QSVM). The proposed fully entangled circuit outperforms other quantum circuits and classical algorithms in most features."
}