{
    "title": "State-specific protein-ligand complex structure prediction with a multi-scale deep generative model. (arXiv:2209.15171v2 [q-bio.QM] UPDATED)",
    "abstract": "The binding complexes formed by proteins and small molecule ligands are ubiquitous and critical to life. Despite recent advancements in protein structure prediction, existing algorithms are so far unable to systematically predict the binding ligand structures along with their regulatory effects on protein folding. To address this discrepancy, we present NeuralPLexer, a computational approach that can directly predict protein-ligand complex structures solely using protein sequence and ligand molecular graph inputs. NeuralPLexer adopts a deep generative model to sample the 3D structures of the binding complex and their conformational changes at an atomistic resolution. The model is based on a diffusion process that incorporates essential biophysical constraints and a multi-scale geometric deep learning system to iteratively sample residue-level contact maps and all heavy-atom coordinates in a hierarchical manner. NeuralPLexer achieves state-of-the-art performance compared to all existing",
    "link": "http://arxiv.org/abs/2209.15171",
    "context": "Title: State-specific protein-ligand complex structure prediction with a multi-scale deep generative model. (arXiv:2209.15171v2 [q-bio.QM] UPDATED)\nAbstract: The binding complexes formed by proteins and small molecule ligands are ubiquitous and critical to life. Despite recent advancements in protein structure prediction, existing algorithms are so far unable to systematically predict the binding ligand structures along with their regulatory effects on protein folding. To address this discrepancy, we present NeuralPLexer, a computational approach that can directly predict protein-ligand complex structures solely using protein sequence and ligand molecular graph inputs. NeuralPLexer adopts a deep generative model to sample the 3D structures of the binding complex and their conformational changes at an atomistic resolution. The model is based on a diffusion process that incorporates essential biophysical constraints and a multi-scale geometric deep learning system to iteratively sample residue-level contact maps and all heavy-atom coordinates in a hierarchical manner. NeuralPLexer achieves state-of-the-art performance compared to all existing",
    "path": "papers/22/09/2209.15171.json",
    "total_tokens": 953,
    "tldr": "NeuralPLexer是一种基于多尺度深度生成模型的计算方法，可以直接预测蛋白质-配体复合物结构，其通过采样残基水平的接触图和所有重原子坐标，在原子水平上对结合复合物的3D结构及其构象变化进行采样，达到了最先进的性能水平。"
}