{
    "title": "TFN: An Interpretable Neural Network with Time-Frequency Transform Embedded for Intelligent Fault Diagnosis. (arXiv:2209.01992v2 [cs.AI] UPDATED)",
    "abstract": "Convolutional Neural Networks (CNNs) are widely used in fault diagnosis of mechanical systems due to their powerful feature extraction and classification capabilities. However, the CNN is a typical black-box model, and the mechanism of CNN's decision-making are not clear, which limits its application in high-reliability-required fault diagnosis scenarios. To tackle this issue, we propose a novel interpretable neural network termed as Time-Frequency Network (TFN), where the physically meaningful time-frequency transform (TFT) method is embedded into the traditional convolutional layer as an adaptive preprocessing layer. This preprocessing layer named as time-frequency convolutional (TFconv) layer, is constrained by a well-designed kernel function to extract fault-related time-frequency information. It not only improves the diagnostic performance but also reveals the logical foundation of the CNN prediction in the frequency domain. Different TFT methods correspond to different kernel fun",
    "link": "http://arxiv.org/abs/2209.01992",
    "context": "Title: TFN: An Interpretable Neural Network with Time-Frequency Transform Embedded for Intelligent Fault Diagnosis. (arXiv:2209.01992v2 [cs.AI] UPDATED)\nAbstract: Convolutional Neural Networks (CNNs) are widely used in fault diagnosis of mechanical systems due to their powerful feature extraction and classification capabilities. However, the CNN is a typical black-box model, and the mechanism of CNN's decision-making are not clear, which limits its application in high-reliability-required fault diagnosis scenarios. To tackle this issue, we propose a novel interpretable neural network termed as Time-Frequency Network (TFN), where the physically meaningful time-frequency transform (TFT) method is embedded into the traditional convolutional layer as an adaptive preprocessing layer. This preprocessing layer named as time-frequency convolutional (TFconv) layer, is constrained by a well-designed kernel function to extract fault-related time-frequency information. It not only improves the diagnostic performance but also reveals the logical foundation of the CNN prediction in the frequency domain. Different TFT methods correspond to different kernel fun",
    "path": "papers/22/09/2209.01992.json",
    "total_tokens": 1132,
    "translated_title": "TFN：基于时频转换的可解释神经网络用于智能故障诊断",
    "translated_abstract": "卷积神经网络（CNN）因其强大的特征提取和分类能力而广泛应用于机械系统的故障诊断。然而，CNN是一种典型的黑匣子模型，其决策机制不清晰，这限制了它在高可靠性的故障诊断场景中的应用。为解决这个问题，我们提出了一种新的可解释神经网络，称为时频网络（TFN），其中物理上有意义的时频变换（TFT）方法嵌入到传统卷积层中作为自适应预处理层。这个预处理层称为时频卷积（TFconv）层，受到一个精心设计的核函数的限制，用于提取与故障相关的时频信息。它不仅提高了诊断性能，而且揭示了CNN在频率域内预测的逻辑基础。不同的TFT方法对应着TFconv层的不同核函数，使网络结构可解释，故障诊断过程透明。轴承故障数据集和齿轮箱振动数据集上的实验结果表明，所提出的TFN相对于现有的基于CNN的故障诊断方法具有更优的诊断性能，而提取的时频特征可以有效地揭示故障频率特征和突出潜在故障源。",
    "tldr": "提出一种新的可解释神经网络模型——时频网络（TFN）。在传统卷积层中嵌入了物理上有意义的时频变换（TFT）方法作为自适应预处理层，该层不仅提高了诊断性能，还使得网络结构可以可解释，故障诊断过程透明。",
    "en_tdlr": "A novel interpretable neural network model, Time-Frequency Network (TFN), is proposed for fault diagnosis. Physically meaningful time-frequency transform (TFT) method is embedded in the traditional convolutional layer as an adaptive preprocessing layer, which not only improves the diagnostic performance but also makes the network structure interpretable and the fault diagnosis process transparent."
}