{
    "title": "Expanding the Deployment Envelope of Behavior Prediction via Adaptive Meta-Learning. (arXiv:2209.11820v4 [cs.LG] UPDATED)",
    "abstract": "Learning-based behavior prediction methods are increasingly being deployed in real-world autonomous systems, e.g., in fleets of self-driving vehicles, which are beginning to commercially operate in major cities across the world. Despite their advancements, however, the vast majority of prediction systems are specialized to a set of well-explored geographic regions or operational design domains, complicating deployment to additional cities, countries, or continents. Towards this end, we present a novel method for efficiently adapting behavior prediction models to new environments. Our approach leverages recent advances in meta-learning, specifically Bayesian regression, to augment existing behavior prediction models with an adaptive layer that enables efficient domain transfer via offline fine-tuning, online adaptation, or both. Experiments across multiple real-world datasets demonstrate that our method can efficiently adapt to a variety of unseen environments.",
    "link": "http://arxiv.org/abs/2209.11820",
    "context": "Title: Expanding the Deployment Envelope of Behavior Prediction via Adaptive Meta-Learning. (arXiv:2209.11820v4 [cs.LG] UPDATED)\nAbstract: Learning-based behavior prediction methods are increasingly being deployed in real-world autonomous systems, e.g., in fleets of self-driving vehicles, which are beginning to commercially operate in major cities across the world. Despite their advancements, however, the vast majority of prediction systems are specialized to a set of well-explored geographic regions or operational design domains, complicating deployment to additional cities, countries, or continents. Towards this end, we present a novel method for efficiently adapting behavior prediction models to new environments. Our approach leverages recent advances in meta-learning, specifically Bayesian regression, to augment existing behavior prediction models with an adaptive layer that enables efficient domain transfer via offline fine-tuning, online adaptation, or both. Experiments across multiple real-world datasets demonstrate that our method can efficiently adapt to a variety of unseen environments.",
    "path": "papers/22/09/2209.11820.json",
    "total_tokens": 844,
    "translated_title": "通过自适应元学习扩展行为预测的部署范围",
    "translated_abstract": "基于学习的行为预测方法在实际的自主系统中被广泛部署，例如在商业化运营的自动驾驶车队中开始在世界各大城市中运行。尽管这些方法已经取得了很大进展，但其中绝大多数预测系统都专门设计于一组经过深入探索的地理区域或操作设计域，这使得它们难以部署到其他城市、国家或洲际。为了解决这个问题，我们提出了一种新颖的方法，可以有效地使行为预测模型适应新环境。我们的方法利用了元学习的最新进展，特别是贝叶斯回归，通过增加自适应层，使得预测模型可以进行高效的域转移，无论是离线微调、在线适应或两者结合。在多个实际数据集上的实验表明，我们的方法可以有效地适应各种未知的环境。",
    "tldr": "该方法利用元学习的贝叶斯回归技术，通过增加自适应层，实现了高效的行为预测模型域转移，可适应各种未知环境。",
    "en_tdlr": "The proposed method uses Bayesian regression through adaptive layer based on meta-learning to achieve efficient domain transfer of behavior prediction model, which can adapt to a variety of unknown environments."
}