{
    "title": "Integrated storage assignment for an e-grocery fulfilment centre: Accounting for day-of-week demand patterns. (arXiv:2209.03998v2 [econ.GN] UPDATED)",
    "abstract": "In this paper, we deal with a storage assignment problem arising in a fulfilment centre of a major European e-grocery retailer. The centre can be characterised as a hybrid warehouse consisting of a highly efficient and partially automated fast-picking area designed as a pick-and-pass system with multiple stations, and a picker-to-parts area. The storage assignment problem considered in this paper comprises the decisions to select the products to be allocated to the fast-picking area, the assignment of the products to picking stations and the determination of a shelf within the assigned station. The objective is to achieve a high level of picking efficiency while respecting station workload balancing and precedence order constraints. We propose to solve this three-level problem using an integrated MILP model. In computational experiments with real-world data, we show that using the proposed integrated approach yields significantly better results than a sequential approach in which the s",
    "link": "http://arxiv.org/abs/2209.03998",
    "context": "Title: Integrated storage assignment for an e-grocery fulfilment centre: Accounting for day-of-week demand patterns. (arXiv:2209.03998v2 [econ.GN] UPDATED)\nAbstract: In this paper, we deal with a storage assignment problem arising in a fulfilment centre of a major European e-grocery retailer. The centre can be characterised as a hybrid warehouse consisting of a highly efficient and partially automated fast-picking area designed as a pick-and-pass system with multiple stations, and a picker-to-parts area. The storage assignment problem considered in this paper comprises the decisions to select the products to be allocated to the fast-picking area, the assignment of the products to picking stations and the determination of a shelf within the assigned station. The objective is to achieve a high level of picking efficiency while respecting station workload balancing and precedence order constraints. We propose to solve this three-level problem using an integrated MILP model. In computational experiments with real-world data, we show that using the proposed integrated approach yields significantly better results than a sequential approach in which the s",
    "path": "papers/22/09/2209.03998.json",
    "total_tokens": 858,
    "translated_title": "电子杂货配送中心集成储存分配：考虑日内需求模式(arXiv:2209.03998v2 [econ.GN] UPDATED)",
    "translated_abstract": "本文研究了一家欧洲主要电子杂货零售商的配送中心中出现的储存分配问题。该中心可以被描述为一个混合仓库，包括一个高效和部分自动化的快速拣选区域和一个分拣区域。所考虑的储存分配问题包括选择要分配给快速拣选区域的产品、将产品分配给挑选站和确定分配站内的货架的决策。目标是在尊重站点负载平衡和优先级约束的情况下实现高效率的拣选。我们提出使用一个综合MILP模型解决这个三级问题。在使用真实数据的计算实验中，我们证明使用所提议的集成方法比顺序方法显著地提高了结果。",
    "tldr": "本文提出了一个综合的MILP模型，用于实现高效捡货并尊重站点负载平衡和优先级约束。在电子杂货配送中心中，该模型显著优于顺序方法。",
    "en_tdlr": "This paper proposes an integrated MILP model to achieve efficient picking while respecting station workload balancing and precedence order constraints in an e-grocery fulfilment centre. The proposed approach significantly outperforms a sequential approach in a real-world data experiment."
}