{
    "title": "Switchback Experiments under Geometric Mixing. (arXiv:2209.00197v2 [stat.ME] UPDATED)",
    "abstract": "The switchback is an experimental design that measures treatment effects by repeatedly turning an intervention on and off for a whole system. Switchback experiments are a robust way to overcome cross-unit spillover effects; however, they are vulnerable to bias from temporal carryovers. In this paper, we consider properties of switchback experiments in Markovian systems that mix at a geometric rate. We find that, in this setting, standard switchback designs suffer considerably from carryover bias: Their estimation error decays as $T^{-1/3}$ in terms of the experiment horizon $T$, whereas in the absence of carryovers a faster rate of $T^{-1/2}$ would have been possible. We also show, however, that judicious use of burn-in periods can considerably improve the situation, and enables errors that decay as $\\log(T)^{1/2}T^{-1/2}$. Our formal results are mirrored in an empirical evaluation.",
    "link": "http://arxiv.org/abs/2209.00197",
    "context": "Title: Switchback Experiments under Geometric Mixing. (arXiv:2209.00197v2 [stat.ME] UPDATED)\nAbstract: The switchback is an experimental design that measures treatment effects by repeatedly turning an intervention on and off for a whole system. Switchback experiments are a robust way to overcome cross-unit spillover effects; however, they are vulnerable to bias from temporal carryovers. In this paper, we consider properties of switchback experiments in Markovian systems that mix at a geometric rate. We find that, in this setting, standard switchback designs suffer considerably from carryover bias: Their estimation error decays as $T^{-1/3}$ in terms of the experiment horizon $T$, whereas in the absence of carryovers a faster rate of $T^{-1/2}$ would have been possible. We also show, however, that judicious use of burn-in periods can considerably improve the situation, and enables errors that decay as $\\log(T)^{1/2}T^{-1/2}$. Our formal results are mirrored in an empirical evaluation.",
    "path": "papers/22/09/2209.00197.json",
    "total_tokens": 939,
    "translated_title": "几何混合条件下的切换试验",
    "translated_abstract": "切换试验是一种通过反复对整个系统开启和关闭干预来测量治疗效果的实验设计。切换试验是克服单元间溢出效应的一种强大方法；然而，它们容易受到时间延续的偏差影响。本文研究在几何混合条件下的马尔可夫系统中的切换试验性质。我们发现，在这种情况下，标准的切换设计在延续偏差方面受到了较大的影响：它们的估计误差随着实验时间跨度$T$的增加而衰减为$T^{-1/3}$，而在没有延续效应的情况下，更快的$T^{-1/2}$衰减速度是可能的。然而，我们还展示了谨慎使用初始燃烧期可以大大改善情况，并且实现误差以$\\log(T)^{1/2}T^{-1/2}$的速度衰减。我们的形式结果在实证评估中得到了验证。",
    "tldr": "本文研究了几何混合条件下的切换试验性质，并发现在该设置下，标准的切换设计受到了延续偏差的影响，但是通过谨慎使用初始燃烧期可以显著改善情况，实现误差以更慢的速度衰减。",
    "en_tdlr": "This paper examines the properties of switchback experiments under geometric mixing conditions and finds that standard switchback designs suffer from carryover bias but careful use of burn-in periods can significantly improve the situation, leading to slower decay of errors."
}