{
    "title": "CodeQueries: A Dataset of Semantic Queries over Code. (arXiv:2209.08372v2 [cs.SE] UPDATED)",
    "abstract": "Developers often have questions about semantic aspects of code they are working on, e.g., \"Is there a class whose parent classes declare a conflicting attribute?\". Answering them requires understanding code semantics such as attributes and inheritance relation of classes. An answer to such a question should identify code spans constituting the answer (e.g., the declaration of the subclass) as well as supporting facts (e.g., the definitions of the conflicting attributes). The existing work on question-answering over code has considered yes/no questions or method-level context. We contribute a labeled dataset, called CodeQueries, of semantic queries over Python code. Compared to the existing datasets, in CodeQueries, the queries are about code semantics, the context is file level and the answers are code spans. We curate the dataset based on queries supported by a widely-used static analysis tool, CodeQL, and include both positive and negative examples, and queries requiring single-hop a",
    "link": "http://arxiv.org/abs/2209.08372",
    "context": "Title: CodeQueries: A Dataset of Semantic Queries over Code. (arXiv:2209.08372v2 [cs.SE] UPDATED)\nAbstract: Developers often have questions about semantic aspects of code they are working on, e.g., \"Is there a class whose parent classes declare a conflicting attribute?\". Answering them requires understanding code semantics such as attributes and inheritance relation of classes. An answer to such a question should identify code spans constituting the answer (e.g., the declaration of the subclass) as well as supporting facts (e.g., the definitions of the conflicting attributes). The existing work on question-answering over code has considered yes/no questions or method-level context. We contribute a labeled dataset, called CodeQueries, of semantic queries over Python code. Compared to the existing datasets, in CodeQueries, the queries are about code semantics, the context is file level and the answers are code spans. We curate the dataset based on queries supported by a widely-used static analysis tool, CodeQL, and include both positive and negative examples, and queries requiring single-hop a",
    "path": "papers/22/09/2209.08372.json",
    "total_tokens": 762,
    "translated_title": "CodeQueries：一个关于代码语义查询的数据集",
    "translated_abstract": "开发人员常常对他们正在操作的代码的语义方面有疑问，例如，“是否有一个类的父类声明了一个冲突的属性？”回答这些问题需要理解代码的语义，比如类的属性和继承关系。对于这样的问题，答案应该标识出构成答案的代码段（例如，子类的声明）以及支持的事实（例如，冲突属性的定义）。现有的关于代码问题回答的研究主要关注是或否的问题或方法级别的上下文。我们贡献了一个命名为CodeQueries的Python代码的语义查询的标记数据集。与现有数据集相比，CodeQueries的查询是关于代码语义的，上下文是文件级别的，答案是代码段。我们根据一个广泛使用的静态分析工具CodeQL支持的查询来筛选和整理数据集，并包含正负例和需要单跳问题查询。",
    "tldr": "CodeQueries是一个关于Python代码语义查询的数据集，与现有数据集相比，它具有文件级别的上下文和代码段答案。"
}