{
    "title": "Simulation-Assisted Optimization for Large-Scale Evacuation Planning with Congestion-Dependent Delays. (arXiv:2209.01535v5 [cs.AI] UPDATED)",
    "abstract": "Evacuation planning is a crucial part of disaster management. However, joint optimization of its two essential components, routing and scheduling, with objectives such as minimizing average evacuation time or evacuation completion time, is a computationally hard problem. To approach it, we present MIP-LNS, a scalable optimization method that utilizes heuristic search with mathematical optimization and can optimize a variety of objective functions. We also present the method MIP-LNS-SIM, where we combine agent-based simulation with MIP-LNS to estimate delays due to congestion, as well as, find optimized plans considering such delays. We use Harris County in Houston, Texas, as our study area. We show that, within a given time limit, MIP-LNS finds better solutions than existing methods in terms of three different metrics. However, when congestion dependent delay is considered, MIP-LNS-SIM outperforms MIP-LNS in multiple performance metrics. In addition, MIP-LNS-SIM has a significantly low",
    "link": "http://arxiv.org/abs/2209.01535",
    "context": "Title: Simulation-Assisted Optimization for Large-Scale Evacuation Planning with Congestion-Dependent Delays. (arXiv:2209.01535v5 [cs.AI] UPDATED)\nAbstract: Evacuation planning is a crucial part of disaster management. However, joint optimization of its two essential components, routing and scheduling, with objectives such as minimizing average evacuation time or evacuation completion time, is a computationally hard problem. To approach it, we present MIP-LNS, a scalable optimization method that utilizes heuristic search with mathematical optimization and can optimize a variety of objective functions. We also present the method MIP-LNS-SIM, where we combine agent-based simulation with MIP-LNS to estimate delays due to congestion, as well as, find optimized plans considering such delays. We use Harris County in Houston, Texas, as our study area. We show that, within a given time limit, MIP-LNS finds better solutions than existing methods in terms of three different metrics. However, when congestion dependent delay is considered, MIP-LNS-SIM outperforms MIP-LNS in multiple performance metrics. In addition, MIP-LNS-SIM has a significantly low",
    "path": "papers/22/09/2209.01535.json",
    "total_tokens": 955,
    "translated_title": "利用模拟辅助优化大规模疏散计划中的拥堵依赖延迟问题",
    "translated_abstract": "疏散计划是灾难管理的重要组成部分。然而，将路线和调度两个关键组成部分进行联合优化，以达到最小化平均疏散时间或疏散完成时间等目标，是一个计算难题。为了解决这个问题，我们提出了MIP-LNS，这是一种可扩展的优化方法，利用启发式搜索和数学优化来优化各种目标函数。我们还提出了MIP-LNS-SIM方法，结合基于代理的模拟以估计由于拥堵而引起的延迟，并找到考虑这些延迟的优化计划。我们以得克萨斯州休斯顿市的哈里斯县作为研究区域。我们发现，在给定的时间限制下，MIP-LNS相对于现有方法在三个不同指标方面找到更好的解。然而，当考虑到拥堵依赖的延迟时，MIP-LNS-SIM在多个性能指标上优于MIP-LNS。此外，MIP-LNS-SIM具有明显较低的求解时间。",
    "tldr": "本研究提出了一种通过模拟辅助优化的方法，能够在考虑拥堵依赖延迟的情况下，提高大规模疏散计划的性能表现，相比现有方法表现更优。",
    "en_tdlr": "This study proposes a simulation-assisted optimization method that can improve the performance of large-scale evacuation plans by considering congestion-dependent delays, outperforming existing methods in various performance metrics."
}