{
    "title": "On Quantum Speedups for Nonconvex Optimization via Quantum Tunneling Walks. (arXiv:2209.14501v2 [quant-ph] UPDATED)",
    "abstract": "Classical algorithms are often not effective for solving nonconvex optimization problems where local minima are separated by high barriers. In this paper, we explore possible quantum speedups for nonconvex optimization by leveraging the global effect of quantum tunneling. Specifically, we introduce a quantum algorithm termed the quantum tunneling walk (QTW) and apply it to nonconvex problems where local minima are approximately global minima. We show that QTW achieves quantum speedup over classical stochastic gradient descents (SGD) when the barriers between different local minima are high but thin and the minima are flat. Based on this observation, we construct a specific double-well landscape, where classical algorithms cannot efficiently hit one target well knowing the other well but QTW can when given proper initial states near the known well. Finally, we corroborate our findings with numerical experiments.",
    "link": "http://arxiv.org/abs/2209.14501",
    "context": "Title: On Quantum Speedups for Nonconvex Optimization via Quantum Tunneling Walks. (arXiv:2209.14501v2 [quant-ph] UPDATED)\nAbstract: Classical algorithms are often not effective for solving nonconvex optimization problems where local minima are separated by high barriers. In this paper, we explore possible quantum speedups for nonconvex optimization by leveraging the global effect of quantum tunneling. Specifically, we introduce a quantum algorithm termed the quantum tunneling walk (QTW) and apply it to nonconvex problems where local minima are approximately global minima. We show that QTW achieves quantum speedup over classical stochastic gradient descents (SGD) when the barriers between different local minima are high but thin and the minima are flat. Based on this observation, we construct a specific double-well landscape, where classical algorithms cannot efficiently hit one target well knowing the other well but QTW can when given proper initial states near the known well. Finally, we corroborate our findings with numerical experiments.",
    "path": "papers/22/09/2209.14501.json",
    "total_tokens": 935,
    "translated_title": "关于量子隧穿行走在非凸优化中的加速效应",
    "translated_abstract": "经常情况下，经典算法不能有效解决局部极小值由高能壁隔开的非凸优化问题。本文探讨了通过利用量子隧穿的全局影响可能产生的非凸优化量子加速效应。具体而言，我们介绍了一种称为量子隧穿行走（QTW）的量子算法，并将其应用于局部极小值大约是全局极小值的非凸问题上。我们发现，在不同局部极小值之间的障碍很高但很薄，同时极小值是平坦的情况下，QTW相对于经典随机梯度下降（SGD）实现了量子加速。基于这一观察，我们构建了一个特定的双阱景观，在已知井陷的情况下，经典算法无法有效地攻击一个目标井陷，但是在给定合适的初始状态附近，QTW可以。最后，我们用数值实验验证了我们的发现。",
    "tldr": "本文探究了使用量子隧穿行走（QTW）在非凸优化问题中产生的量子加速效应。当不同的局部极小值由高但薄的势垒分隔而极小值是平坦的时候，QTW对比经典随机梯度下降（SGD）实现了加速。",
    "en_tdlr": "This paper investigates the quantum speedup effect in nonconvex optimization problems using the quantum tunneling walk (QTW) algorithm. When local minima are separated by high but thin barriers and the minima are flat, QTW achieves quantum speedup compared to classical stochastic gradient descent (SGD)."
}