{
    "title": "Turning Normalizing Flows into Monge Maps with Geodesic Gaussian Preserving Flows. (arXiv:2209.10873v4 [cs.LG] UPDATED)",
    "abstract": "Normalizing Flows (NF) are powerful likelihood-based generative models that are able to trade off between expressivity and tractability to model complex densities. A now well established research avenue leverages optimal transport (OT) and looks for Monge maps, i.e. models with minimal effort between the source and target distributions. This paper introduces a method based on Brenier's polar factorization theorem to transform any trained NF into a more OT-efficient version without changing the final density. We do so by learning a rearrangement of the source (Gaussian) distribution that minimizes the OT cost between the source and the final density. We further constrain the path leading to the estimated Monge map to lie on a geodesic in the space of volume-preserving diffeomorphisms thanks to Euler's equations. The proposed method leads to smooth flows with reduced OT cost for several existing models without affecting the model performance.",
    "link": "http://arxiv.org/abs/2209.10873",
    "context": "Title: Turning Normalizing Flows into Monge Maps with Geodesic Gaussian Preserving Flows. (arXiv:2209.10873v4 [cs.LG] UPDATED)\nAbstract: Normalizing Flows (NF) are powerful likelihood-based generative models that are able to trade off between expressivity and tractability to model complex densities. A now well established research avenue leverages optimal transport (OT) and looks for Monge maps, i.e. models with minimal effort between the source and target distributions. This paper introduces a method based on Brenier's polar factorization theorem to transform any trained NF into a more OT-efficient version without changing the final density. We do so by learning a rearrangement of the source (Gaussian) distribution that minimizes the OT cost between the source and the final density. We further constrain the path leading to the estimated Monge map to lie on a geodesic in the space of volume-preserving diffeomorphisms thanks to Euler's equations. The proposed method leads to smooth flows with reduced OT cost for several existing models without affecting the model performance.",
    "path": "papers/22/09/2209.10873.json",
    "total_tokens": 947,
    "translated_title": "将正规化流转换为保持测地线高斯流的蒙热映射",
    "translated_abstract": "正规化流（NF）是一种强大的基于似然的生成模型，能够在表现力和可建模复杂密度的可处理性之间进行权衡。现在已经成为一个成熟的研究方向是利用最优传输（OT）寻找蒙热映射，即源分布与目标分布之间具有最小成本的模型。本文介绍了一种基于Brenier极分解定理的方法，将任何训练好的NF转换为更具OT效率版本，而不改变最终密度。我们通过学习源（高斯）分布的重新排列，最小化源与最终密度之间的OT成本。我们进一步通过欧拉方程约束导致估计的蒙热映射路径位于保持体积的微分同胚空间中的测地线上。所提出的方法导致多个现有模型的平滑流，并降低了OT成本，而不影响模型性能。",
    "tldr": "本文提出了一种将正规化流转换为 OT 效率更高的蒙热映射的方法，通过学习源分布的重新排列实现，同时通过欧拉方程约束导致估计的蒙热映射路径位于保持体积的微分同胚空间中的测地线上。",
    "en_tdlr": "This paper proposes a method to transform normalizing flows into more optimal transport-efficient Monge maps without changing the final density, by learning a rearrangement of the Gaussian source distribution and constraining the estimated Monge map to lie on a geodesic in the space of volume-preserving diffeomorphisms using Euler's equations."
}