{
    "title": "Deep Variational Free Energy Approach to Dense Hydrogen. (arXiv:2209.06095v2 [cond-mat.str-el] UPDATED)",
    "abstract": "We developed a deep generative model-based variational free energy approach to the equations of state of dense hydrogen. We employ a normalizing flow network to model the proton Boltzmann distribution and a fermionic neural network to model the electron wave function at given proton positions. By jointly optimizing the two neural networks we reached a comparable variational free energy to the previous coupled electron-ion Monte Carlo calculation. The predicted equation of state of dense hydrogen under planetary conditions is denser than the findings of ab initio molecular dynamics calculation and empirical chemical model. Moreover, direct access to the entropy and free energy of dense hydrogen opens new opportunities in planetary modeling and high-pressure physics research.",
    "link": "http://arxiv.org/abs/2209.06095",
    "context": "Title: Deep Variational Free Energy Approach to Dense Hydrogen. (arXiv:2209.06095v2 [cond-mat.str-el] UPDATED)\nAbstract: We developed a deep generative model-based variational free energy approach to the equations of state of dense hydrogen. We employ a normalizing flow network to model the proton Boltzmann distribution and a fermionic neural network to model the electron wave function at given proton positions. By jointly optimizing the two neural networks we reached a comparable variational free energy to the previous coupled electron-ion Monte Carlo calculation. The predicted equation of state of dense hydrogen under planetary conditions is denser than the findings of ab initio molecular dynamics calculation and empirical chemical model. Moreover, direct access to the entropy and free energy of dense hydrogen opens new opportunities in planetary modeling and high-pressure physics research.",
    "path": "papers/22/09/2209.06095.json",
    "total_tokens": 894,
    "translated_title": "密集氢的深度变分自由能方法",
    "translated_abstract": "我们开发了一种基于深度生成模型的变分自由能方法，用于密集氢的状态方程。我们使用一个归一化流网络来建模质子的玻尔兹曼分布，并使用一个费米子神经网络来建模给定质子位置的电子波函数。通过联合优化这两个神经网络，我们达到了与之前的耦合电子-离子蒙特卡洛计算相当的变分自由能。在行星条件下，密集氢的预测状态方程比从头分子动力学计算和经验化学模型的发现更加致密。而且，直接访问密集氢的熵和自由能在行星模拟和高压物理研究中开辟了新的机会。",
    "tldr": "该论文提出了一种基于深度生成模型的变分自由能方法，用于研究密集氢的状态方程。通过优化两个神经网络，研究者达到了与先前的耦合电子-离子蒙特卡洛计算相当的变分自由能。在行星条件下，预测的密集氢状态方程比其他计算方法更致密。这种方法还可以直接获得密集氢的熵和自由能，为行星模拟和高压物理研究提供了新的机会。",
    "en_tdlr": "This paper proposes a deep generative model-based variational free energy approach to study the equation of state of dense hydrogen. By optimizing two neural networks, the researchers achieved a comparable variational free energy to previous calculations. The predicted equation of state for dense hydrogen under planetary conditions is denser than other calculation methods. This method also provides direct access to the entropy and free energy of dense hydrogen, opening up new opportunities in planetary modeling and high-pressure physics research."
}