{
    "title": "Learning Variational Models with Unrolling and Bilevel Optimization. (arXiv:2209.12651v4 [stat.ML] UPDATED)",
    "abstract": "In this paper we consider the problem of learning variational models in the context of supervised learning via risk minimization. Our goal is to provide a deeper understanding of the two approaches of learning of variational models via bilevel optimization and via algorithm unrolling. The former considers the variational model as a lower level optimization problem below the risk minimization problem, while the latter replaces the lower level optimization problem by an algorithm that solves said problem approximately. Both approaches are used in practice, but unrolling is much simpler from a computational point of view. To analyze and compare the two approaches, we consider a simple toy model, and compute all risks and the respective estimators explicitly. We show that unrolling can be better than the bilevel optimization approach, but also that the performance of unrolling can depend significantly on further parameters, sometimes in unexpected ways: While the stepsize of the unrolled a",
    "link": "http://arxiv.org/abs/2209.12651",
    "context": "Title: Learning Variational Models with Unrolling and Bilevel Optimization. (arXiv:2209.12651v4 [stat.ML] UPDATED)\nAbstract: In this paper we consider the problem of learning variational models in the context of supervised learning via risk minimization. Our goal is to provide a deeper understanding of the two approaches of learning of variational models via bilevel optimization and via algorithm unrolling. The former considers the variational model as a lower level optimization problem below the risk minimization problem, while the latter replaces the lower level optimization problem by an algorithm that solves said problem approximately. Both approaches are used in practice, but unrolling is much simpler from a computational point of view. To analyze and compare the two approaches, we consider a simple toy model, and compute all risks and the respective estimators explicitly. We show that unrolling can be better than the bilevel optimization approach, but also that the performance of unrolling can depend significantly on further parameters, sometimes in unexpected ways: While the stepsize of the unrolled a",
    "path": "papers/22/09/2209.12651.json",
    "total_tokens": 924,
    "tldr": "本文研究了通过风险最小化的监督学习来学习变分模型的问题。通过比较双层优化和算法展开的两种方法，我们表明，展开算法虽然比双层优化更简单，但其性能对进一步的参数有较大依赖。"
}