{
    "title": "From algorithms to action: improving patient care requires causality",
    "abstract": "arXiv:2209.07397v2 Announce Type: replace  Abstract: In cancer research there is much interest in building and validating outcome predicting outcomes to support treatment decisions. However, because most outcome prediction models are developed and validated without regard to the causal aspects of treatment decision making, many published outcome prediction models may cause harm when used for decision making, despite being found accurate in validation studies. Guidelines on prediction model validation and the checklist for risk model endorsement by the American Joint Committee on Cancer do not protect against prediction models that are accurate during development and validation but harmful when used for decision making. We explain why this is the case and how to build and validate models that are useful for decision making.",
    "link": "https://arxiv.org/abs/2209.07397",
    "context": "Title: From algorithms to action: improving patient care requires causality\nAbstract: arXiv:2209.07397v2 Announce Type: replace  Abstract: In cancer research there is much interest in building and validating outcome predicting outcomes to support treatment decisions. However, because most outcome prediction models are developed and validated without regard to the causal aspects of treatment decision making, many published outcome prediction models may cause harm when used for decision making, despite being found accurate in validation studies. Guidelines on prediction model validation and the checklist for risk model endorsement by the American Joint Committee on Cancer do not protect against prediction models that are accurate during development and validation but harmful when used for decision making. We explain why this is the case and how to build and validate models that are useful for decision making.",
    "path": "papers/22/09/2209.07397.json",
    "total_tokens": 765,
    "translated_title": "从算法到行动：改进患者护理需要因果关系",
    "translated_abstract": "在癌症研究中，建立和验证预测结果的兴趣很大，以支持治疗决策。然而，由于大多数结果预测模型是在不考虑治疗决策的因果关系的情况下开发和验证的，许多已发表的结果预测模型在用于决策时可能会造成伤害，尽管在验证研究中被发现准确。《美国联合癌症委员会风险模型认可核查单》对预测模型的验证指南和风险模型认可核查表无法防止在开发和验证过程中准确但在用于决策时有害的预测模型的出现。我们解释了为什么会出现这种情况以及如何构建和验证对决策有用的模型。",
    "tldr": "改进患者护理需要考虑因果关系，建立和验证的预测模型必须对治疗决策的因果关系进行考虑，以避免在决策时造成伤害。",
    "en_tdlr": "Improving patient care requires consideration of causality, outcome prediction models must take into account the causal aspects of treatment decision making to avoid harm during decision making."
}