{
    "title": "Learning Driver Models for Automated Vehicles via Knowledge Sharing and Personalization. (arXiv:2308.16870v1 [cs.RO])",
    "abstract": "This paper describes a framework for learning Automated Vehicles (AVs) driver models via knowledge sharing between vehicles and personalization. The innate variability in the transportation system makes it exceptionally challenging to expose AVs to all possible driving scenarios during empirical experimentation or testing. Consequently, AVs could be blind to certain encounters that are deemed detrimental to their safe and efficient operation. It is then critical to share knowledge across AVs that increase exposure to driving scenarios occurring in the real world. This paper explores a method to collaboratively train a driver model by sharing knowledge and borrowing strength across vehicles while retaining a personalized model tailored to the vehicle's unique conditions and properties. Our model brings a federated learning approach to collaborate between multiple vehicles while circumventing the need to share raw data between them. We showcase our method's performance in experimental si",
    "link": "http://arxiv.org/abs/2308.16870",
    "context": "Title: Learning Driver Models for Automated Vehicles via Knowledge Sharing and Personalization. (arXiv:2308.16870v1 [cs.RO])\nAbstract: This paper describes a framework for learning Automated Vehicles (AVs) driver models via knowledge sharing between vehicles and personalization. The innate variability in the transportation system makes it exceptionally challenging to expose AVs to all possible driving scenarios during empirical experimentation or testing. Consequently, AVs could be blind to certain encounters that are deemed detrimental to their safe and efficient operation. It is then critical to share knowledge across AVs that increase exposure to driving scenarios occurring in the real world. This paper explores a method to collaboratively train a driver model by sharing knowledge and borrowing strength across vehicles while retaining a personalized model tailored to the vehicle's unique conditions and properties. Our model brings a federated learning approach to collaborate between multiple vehicles while circumventing the need to share raw data between them. We showcase our method's performance in experimental si",
    "path": "papers/23/08/2308.16870.json",
    "total_tokens": 924,
    "translated_title": "通过知识共享和个性化学习驾驶员模型以用于自动驾驶车辆",
    "translated_abstract": "本文描述了一种通过车辆之间的知识共享和个性化学习自动驾驶车辆（AVs）驾驶员模型的框架。交通运输系统中的固有变异使得将AVs暴露于所有可能的驾驶情景在实证实验或测试中极具挑战性。因此，AVs可能会对某些被认为对其安全和高效运行有害的遭遇视而不见。因此，跨AVs共享知识，增加其在真实世界中驾驶情景的暴露，就显得至关重要。本文探索了一种方法，通过共享知识和借用多个车辆之间的强度，协同培训驾驶员模型，同时保留适应车辆的独特条件和特性的个性化模型。我们的模型采用联邦学习方法，在多个车辆之间进行协作，同时避免了它们之间共享原始数据的需要。我们展示了我们的方法在实验中的性能。",
    "tldr": "本文提出了一种通过知识共享和个性化学习驾驶员模型的方法，以用于自动驾驶车辆。通过跨车辆共享知识，增加AVs在真实驾驶情景中的暴露，同时保留个性化的模型，以适应不同车辆的条件和特性。",
    "en_tdlr": "This paper proposes a method for learning driver models for automated vehicles through knowledge sharing and personalization. By sharing knowledge across vehicles, it increases the exposure of AVs to real-world driving scenarios while retaining personalized models to adapt to different vehicle conditions and properties."
}