{
    "title": "Heterogeneous Knowledge Fusion: A Novel Approach for Personalized Recommendation via LLM. (arXiv:2308.03333v2 [cs.IR] UPDATED)",
    "abstract": "The analysis and mining of user heterogeneous behavior are of paramount importance in recommendation systems. However, the conventional approach of incorporating various types of heterogeneous behavior into recommendation models leads to feature sparsity and knowledge fragmentation issues. To address this challenge, we propose a novel approach for personalized recommendation via Large Language Model (LLM), by extracting and fusing heterogeneous knowledge from user heterogeneous behavior information. In addition, by combining heterogeneous knowledge and recommendation tasks, instruction tuning is performed on LLM for personalized recommendations. The experimental results demonstrate that our method can effectively integrate user heterogeneous behavior and significantly improve recommendation performance.",
    "link": "http://arxiv.org/abs/2308.03333",
    "context": "Title: Heterogeneous Knowledge Fusion: A Novel Approach for Personalized Recommendation via LLM. (arXiv:2308.03333v2 [cs.IR] UPDATED)\nAbstract: The analysis and mining of user heterogeneous behavior are of paramount importance in recommendation systems. However, the conventional approach of incorporating various types of heterogeneous behavior into recommendation models leads to feature sparsity and knowledge fragmentation issues. To address this challenge, we propose a novel approach for personalized recommendation via Large Language Model (LLM), by extracting and fusing heterogeneous knowledge from user heterogeneous behavior information. In addition, by combining heterogeneous knowledge and recommendation tasks, instruction tuning is performed on LLM for personalized recommendations. The experimental results demonstrate that our method can effectively integrate user heterogeneous behavior and significantly improve recommendation performance.",
    "path": "papers/23/08/2308.03333.json",
    "total_tokens": 706,
    "translated_title": "异构知识融合: 通过LLM进行个性化推荐的新方法",
    "translated_abstract": "分析和挖掘用户异构行为对于推荐系统至关重要。然而，将各种类型的异构行为纳入推荐模型的常规方法会导致特征稀疏和知识碎片化的问题。为了解决这个挑战，我们提出了一种通过大型语言模型（LLM）从用户异构行为信息中提取和融合异构知识的新方法，通过将异构知识和推荐任务结合，对LLM进行指令调整以实现个性化推荐。实验结果表明，我们的方法能够有效地整合用户异构行为并显著提高推荐性能。",
    "tldr": "本文提出了一种通过大型语言模型（LLM）从用户行为信息中提取和融合异构知识的新方法，通过指令调整实现个性化推荐，有效地提高了推荐性能。",
    "en_tdlr": "This paper proposes a novel approach for personalized recommendation by extracting and fusing heterogeneous knowledge from user behavior information using Large Language Model (LLM), which effectively improves recommendation performance through instruction tuning."
}