{
    "title": "Edge of stability echo state networks. (arXiv:2308.02902v2 [cs.LG] UPDATED)",
    "abstract": "Echo State Networks (ESNs) are time-series processing models working under the Echo State Property (ESP) principle. The ESP is a notion of stability that imposes an asymptotic fading of the memory of the input. On the other hand, the resulting inherent architectural bias of ESNs may lead to an excessive loss of information, which in turn harms the performance in certain tasks with long short-term memory requirements. With the goal of bringing together the fading memory property and the ability to retain as much memory as possible, in this paper we introduce a new ESN architecture, called the Edge of Stability Echo State Network (ES$^2$N). The introduced ES$^2$N model is based on defining the reservoir layer as a convex combination of a nonlinear reservoir (as in the standard ESN), and a linear reservoir that implements an orthogonal transformation. We provide a thorough mathematical analysis of the introduced model, proving that the whole eigenspectrum of the Jacobian of the ES$^2$N ma",
    "link": "http://arxiv.org/abs/2308.02902",
    "context": "Title: Edge of stability echo state networks. (arXiv:2308.02902v2 [cs.LG] UPDATED)\nAbstract: Echo State Networks (ESNs) are time-series processing models working under the Echo State Property (ESP) principle. The ESP is a notion of stability that imposes an asymptotic fading of the memory of the input. On the other hand, the resulting inherent architectural bias of ESNs may lead to an excessive loss of information, which in turn harms the performance in certain tasks with long short-term memory requirements. With the goal of bringing together the fading memory property and the ability to retain as much memory as possible, in this paper we introduce a new ESN architecture, called the Edge of Stability Echo State Network (ES$^2$N). The introduced ES$^2$N model is based on defining the reservoir layer as a convex combination of a nonlinear reservoir (as in the standard ESN), and a linear reservoir that implements an orthogonal transformation. We provide a thorough mathematical analysis of the introduced model, proving that the whole eigenspectrum of the Jacobian of the ES$^2$N ma",
    "path": "papers/23/08/2308.02902.json",
    "total_tokens": 906,
    "translated_title": "边缘稳定的回声状态网络",
    "translated_abstract": "回声状态网络（ESNs）是基于回声状态属性（ESP）原理工作的时间序列处理模型。ESP是指对输入的记忆在渐进衰减。然而，ESNs的固有架构偏差可能导致过多信息的丢失，进而影响在某些长期记忆任务中的性能。为了将渐进记忆属性与尽可能保留更多记忆的能力结合起来，本文介绍了一种新的ESN架构，称为边缘稳定回声状态网络（ES$^2$N）。引入的ES$^2$N模型基于将储备层定义为非线性储备（与标准ESN相同）和实现正交变换的线性储备的凸组合。我们对引入的模型进行了彻底的数学分析，并证明了ES$^2$N的雅可比矩阵的整个特征谱...",
    "tldr": "本文介绍了一种新的边缘稳定回声状态网络（ES$^2$N）架构，结合了渐进记忆属性和尽可能保留更多记忆的能力，通过将储备层定义为非线性和线性的凸组合，提供了网络稳定性和性能的增强。",
    "en_tdlr": "This paper introduces a new architecture, Edge of Stability Echo State Network (ES$^2$N), which combines the fading memory property and the ability to retain as much memory as possible. By defining the reservoir layer as a convex combination of a nonlinear reservoir and a linear reservoir, the ES$^2$N enhances both network stability and performance."
}