{
    "title": "A stochastic block model for community detection in attributed networks. (arXiv:2308.16382v1 [cs.SI])",
    "abstract": "Community detection is an important content in complex network analysis. The existing community detection methods in attributed networks mostly focus on only using network structure, while the methods of integrating node attributes is mainly for the traditional community structures, and cannot detect multipartite structures and mixture structures in network. In addition, the model-based community detection methods currently proposed for attributed networks do not fully consider unique topology information of nodes, such as betweenness centrality and clustering coefficient. Therefore, a stochastic block model that integrates betweenness centrality and clustering coefficient of nodes for community detection in attributed networks, named BCSBM, is proposed in this paper. Different from other generative models for attributed networks, the generation process of links and attributes in BCSBM model follows the Poisson distribution, and the probability between community is considered based on ",
    "link": "http://arxiv.org/abs/2308.16382",
    "context": "Title: A stochastic block model for community detection in attributed networks. (arXiv:2308.16382v1 [cs.SI])\nAbstract: Community detection is an important content in complex network analysis. The existing community detection methods in attributed networks mostly focus on only using network structure, while the methods of integrating node attributes is mainly for the traditional community structures, and cannot detect multipartite structures and mixture structures in network. In addition, the model-based community detection methods currently proposed for attributed networks do not fully consider unique topology information of nodes, such as betweenness centrality and clustering coefficient. Therefore, a stochastic block model that integrates betweenness centrality and clustering coefficient of nodes for community detection in attributed networks, named BCSBM, is proposed in this paper. Different from other generative models for attributed networks, the generation process of links and attributes in BCSBM model follows the Poisson distribution, and the probability between community is considered based on ",
    "path": "papers/23/08/2308.16382.json",
    "total_tokens": 812,
    "translated_title": "基于属性网络的社区检测的随机块模型",
    "translated_abstract": "社区检测是复杂网络分析中的重要内容。现有的基于属性网络的社区检测方法大多仅关注网络结构，而集成节点属性的方法主要用于传统的社区结构，无法检测网络中的多方结构和混合结构。此外，目前针对属性网络提出的基于模型的社区检测方法并没有充分考虑节点的独特拓扑信息，例如介数中心度和聚类系数。因此，本文提出了一种集成节点介数中心度和聚类系数的随机块模型用于属性网络的社区检测，称为BCSBM模型。与其他属性网络生成模型不同，BCSBM模型中链接和属性的生成过程遵循泊松分布，并考虑了社区之间的概率。",
    "tldr": "本文提出了一种基于属性网络的社区检测方法，使用了集成节点介数中心度和聚类系数的随机块模型。与其他方法不同的是，该模型还考虑了社区之间的概率，可以检测多方结构和混合结构。",
    "en_tdlr": "This paper proposes a method for community detection in attributed networks using a stochastic block model that integrates betweenness centrality and clustering coefficient of nodes. Unlike other methods, this model also considers the probability between communities and can detect multipartite structures and mixture structures."
}