{
    "title": "SurvBeX: An explanation method of the machine learning survival models based on the Beran estimator. (arXiv:2308.03730v1 [cs.LG])",
    "abstract": "An explanation method called SurvBeX is proposed to interpret predictions of the machine learning survival black-box models. The main idea behind the method is to use the modified Beran estimator as the surrogate explanation model. Coefficients, incorporated into Beran estimator, can be regarded as values of the feature impacts on the black-box model prediction. Following the well-known LIME method, many points are generated in a local area around an example of interest. For every generated example, the survival function of the black-box model is computed, and the survival function of the surrogate model (the Beran estimator) is constructed as a function of the explanation coefficients. In order to find the explanation coefficients, it is proposed to minimize the mean distance between the survival functions of the black-box model and the Beran estimator produced by the generated examples. Many numerical experiments with synthetic and real survival data demonstrate the SurvBeX efficienc",
    "link": "http://arxiv.org/abs/2308.03730",
    "context": "Title: SurvBeX: An explanation method of the machine learning survival models based on the Beran estimator. (arXiv:2308.03730v1 [cs.LG])\nAbstract: An explanation method called SurvBeX is proposed to interpret predictions of the machine learning survival black-box models. The main idea behind the method is to use the modified Beran estimator as the surrogate explanation model. Coefficients, incorporated into Beran estimator, can be regarded as values of the feature impacts on the black-box model prediction. Following the well-known LIME method, many points are generated in a local area around an example of interest. For every generated example, the survival function of the black-box model is computed, and the survival function of the surrogate model (the Beran estimator) is constructed as a function of the explanation coefficients. In order to find the explanation coefficients, it is proposed to minimize the mean distance between the survival functions of the black-box model and the Beran estimator produced by the generated examples. Many numerical experiments with synthetic and real survival data demonstrate the SurvBeX efficienc",
    "path": "papers/23/08/2308.03730.json",
    "total_tokens": 859,
    "translated_title": "SurvBeX:一种基于Beran估计器的机器学习生存模型解释方法",
    "translated_abstract": "提出了一种名为SurvBeX的解释方法，用于解释机器学习生存黑盒模型的预测。该方法的主要思想是使用改进的Beran估计器作为替代解释模型。合并到Beran估计器中的系数可以被视为特征对黑盒模型预测的影响值。通过在感兴趣的示例周围的局部区域生成许多点，按照著名的LIME方法，为每个生成的示例计算黑盒模型的生存函数，并构建替代模型（Beran估计器）的生存函数，作为解释系数的函数。为了找到解释系数，建议通过最小化生成示例产生的黑盒模型和Beran估计器的生存函数之间的平均距离来实现。许多使用合成和真实生存数据的数值实验证明了SurvBeX的效果。",
    "tldr": "提出了一种名为SurvBeX的机器学习生存模型解释方法，通过使用改进的Beran估计器作为替代解释模型，来解释机器学习生存黑盒模型的预测。实验结果表明SurvBeX的效果。",
    "en_tdlr": "A machine learning survival model explanation method called SurvBeX is proposed, which interprets the predictions of black-box models using a modified Beran estimator. Experimental results demonstrate the effectiveness of SurvBeX."
}