{
    "title": "Targeted and Troublesome: Tracking and Advertising on Children's Websites. (arXiv:2308.04887v1 [cs.CY])",
    "abstract": "On the modern web, trackers and advertisers frequently construct and monetize users' detailed behavioral profiles without consent. Despite various studies on web tracking mechanisms and advertisements, there has been no rigorous study focusing on websites targeted at children. To address this gap, we present a measurement of tracking and (targeted) advertising on websites directed at children. Motivated by lacking a comprehensive list of child-directed (i.e., targeted at children) websites, we first build a multilingual classifier based on web page titles and descriptions. Applying this classifier to over two million pages, we compile a list of two thousand child-directed websites. Crawling these sites from five vantage points, we measure the prevalence of trackers, fingerprinting scripts, and advertisements. Our crawler detects ads displayed on child-directed websites and determines if ad targeting is enabled by scraping ad disclosure pages whenever available. Our results show that ar",
    "link": "http://arxiv.org/abs/2308.04887",
    "context": "Title: Targeted and Troublesome: Tracking and Advertising on Children's Websites. (arXiv:2308.04887v1 [cs.CY])\nAbstract: On the modern web, trackers and advertisers frequently construct and monetize users' detailed behavioral profiles without consent. Despite various studies on web tracking mechanisms and advertisements, there has been no rigorous study focusing on websites targeted at children. To address this gap, we present a measurement of tracking and (targeted) advertising on websites directed at children. Motivated by lacking a comprehensive list of child-directed (i.e., targeted at children) websites, we first build a multilingual classifier based on web page titles and descriptions. Applying this classifier to over two million pages, we compile a list of two thousand child-directed websites. Crawling these sites from five vantage points, we measure the prevalence of trackers, fingerprinting scripts, and advertisements. Our crawler detects ads displayed on child-directed websites and determines if ad targeting is enabled by scraping ad disclosure pages whenever available. Our results show that ar",
    "path": "papers/23/08/2308.04887.json",
    "total_tokens": 1043,
    "translated_title": "瞄准且麻烦：追踪和广告在儿童网站上的问题",
    "translated_abstract": "在现代网络上，追踪器和广告商经常在未经同意的情况下构建和利用用户的详细行为配置文件。尽管对网络追踪机制和广告进行了各种研究，但还没有对面向儿童的网站进行严格的研究。为了填补这一空白，我们提出了一种针对面向儿童的网站进行追踪和（定向）广告的测量方法。在缺乏全面的针对儿童的网站（即面向儿童的网站）列表的基础上，我们首先构建了一个基于网页标题和描述的多语言分类器。将该分类器应用于超过两百万个网页中，我们编制了一个包含两千个儿童网站的列表。通过从五个观测点爬取这些网站，我们测量了追踪器、指纹脚本和广告的普遍存在。我们的爬虫检测到在面向儿童的网站上显示的广告，并通过抓取广告披露页面来确定是否启用了广告定向。我们的结果显示，ar",
    "tldr": "这项研究提供了针对面向儿童的网站进行追踪和广告的详细测量。通过构建一个多语言分类器，并对过两百万个网页进行分类，研究者们编制了一个儿童网站列表。通过对这些网站进行爬取和分析，研究发现追踪器、指纹脚本和广告都存在于这些网站上。同时，研究还检测到这些广告是否启用了定向。",
    "en_tdlr": "This study provides a detailed measurement of tracking and advertising on websites targeted at children. By building a multilingual classifier and classifying over two million web pages, researchers compiled a list of child-directed websites. Through crawling and analysis, the study found the presence of trackers, fingerprinting scripts, and advertisements on these websites. Additionally, the study detected whether ad targeting was enabled."
}