{
    "title": "Adversarial Training Using Feedback Loops. (arXiv:2308.11881v1 [cs.LG])",
    "abstract": "Deep neural networks (DNN) have found wide applicability in numerous fields due to their ability to accurately learn very complex input-output relations. Despite their accuracy and extensive use, DNNs are highly susceptible to adversarial attacks due to limited generalizability. For future progress in the field, it is essential to build DNNs that are robust to any kind of perturbations to the data points. In the past, many techniques have been proposed to robustify DNNs using first-order derivative information of the network.  This paper proposes a new robustification approach based on control theory. A neural network architecture that incorporates feedback control, named Feedback Neural Networks, is proposed. The controller is itself a neural network, which is trained using regular and adversarial data such as to stabilize the system outputs. The novel adversarial training approach based on the feedback control architecture is called Feedback Looped Adversarial Training (FLAT). Numeri",
    "link": "http://arxiv.org/abs/2308.11881",
    "context": "Title: Adversarial Training Using Feedback Loops. (arXiv:2308.11881v1 [cs.LG])\nAbstract: Deep neural networks (DNN) have found wide applicability in numerous fields due to their ability to accurately learn very complex input-output relations. Despite their accuracy and extensive use, DNNs are highly susceptible to adversarial attacks due to limited generalizability. For future progress in the field, it is essential to build DNNs that are robust to any kind of perturbations to the data points. In the past, many techniques have been proposed to robustify DNNs using first-order derivative information of the network.  This paper proposes a new robustification approach based on control theory. A neural network architecture that incorporates feedback control, named Feedback Neural Networks, is proposed. The controller is itself a neural network, which is trained using regular and adversarial data such as to stabilize the system outputs. The novel adversarial training approach based on the feedback control architecture is called Feedback Looped Adversarial Training (FLAT). Numeri",
    "path": "papers/23/08/2308.11881.json",
    "total_tokens": 901,
    "translated_title": "使用反馈循环的对抗训练",
    "translated_abstract": "深度神经网络(DNN)由于能够准确地学习非常复杂的输入-输出关系而在许多领域得到了广泛应用。尽管DNN准确性高且使用广泛，但由于泛化能力有限，它们对对抗性攻击非常敏感。为了未来在这个领域取得进展，构建对任何数据点的扰动都具有抵抗能力的DNN是至关重要的。过去提出了许多使用网络的一阶导数信息来增强DNN的技术。本文提出了一种基于控制论的新型增强方法。提出了一种将反馈控制纳入神经网络架构的神经网络架构，称为反馈神经网络。控制器本身是一个神经网络，通过使用常规和对抗性数据进行训练，以稳定系统的输出。基于反馈控制架构的新型对抗训练方法称为反馈循环对抗训练(FLAT)。",
    "tldr": "本文提出了一种基于反馈控制的新型对抗训练方法，通过将反馈控制纳入神经网络架构中进行训练，以增强DNN对对抗性攻击的鲁棒性。"
}