{
    "title": "CBCL-PR: A Cognitively Inspired Model for Class-Incremental Learning in Robotics. (arXiv:2308.00199v1 [cs.RO])",
    "abstract": "For most real-world applications, robots need to adapt and learn continually with limited data in their environments. In this paper, we consider the problem of Few-Shot class Incremental Learning (FSIL), in which an AI agent is required to learn incrementally from a few data samples without forgetting the data it has previously learned. To solve this problem, we present a novel framework inspired by theories of concept learning in the hippocampus and the neocortex. Our framework represents object classes in the form of sets of clusters and stores them in memory. The framework replays data generated by the clusters of the old classes, to avoid forgetting when learning new classes. Our approach is evaluated on two object classification datasets resulting in state-of-the-art (SOTA) performance for class-incremental learning and FSIL. We also evaluate our framework for FSIL on a robot demonstrating that the robot can continually learn to classify a large set of household objects with limit",
    "link": "http://arxiv.org/abs/2308.00199",
    "context": "Title: CBCL-PR: A Cognitively Inspired Model for Class-Incremental Learning in Robotics. (arXiv:2308.00199v1 [cs.RO])\nAbstract: For most real-world applications, robots need to adapt and learn continually with limited data in their environments. In this paper, we consider the problem of Few-Shot class Incremental Learning (FSIL), in which an AI agent is required to learn incrementally from a few data samples without forgetting the data it has previously learned. To solve this problem, we present a novel framework inspired by theories of concept learning in the hippocampus and the neocortex. Our framework represents object classes in the form of sets of clusters and stores them in memory. The framework replays data generated by the clusters of the old classes, to avoid forgetting when learning new classes. Our approach is evaluated on two object classification datasets resulting in state-of-the-art (SOTA) performance for class-incremental learning and FSIL. We also evaluate our framework for FSIL on a robot demonstrating that the robot can continually learn to classify a large set of household objects with limit",
    "path": "papers/23/08/2308.00199.json",
    "total_tokens": 1016,
    "translated_title": "CBCL-PR：一种灵感来自认知的机器人类增量学习模型",
    "translated_abstract": "对于大多数实际应用，机器人需要在环境中有限的数据下进行不断地自适应和学习。本文考虑了少样本类增量学习（FSIL）的问题，即要求人工智能代理在只有少量数据样本的情况下进行增量学习，同时不会忘记之前学习的数据。为了解决这个问题，我们提出了一种新颖的框架，灵感来自海马体和新皮层的概念学习理论。我们的框架将对象类表示为一组簇，并将其存储在内存中。框架通过回放旧类别的簇生成的数据来避免在学习新类别时忘记。我们的方法在两个目标分类数据集上进行了评估，得到了类增量学习和FSIL方面的最新性能。我们还在机器人上评估了我们的框架在FSIL方面，结果表明机器人可以不断学习分类大量的家庭物品，且分类性能优秀。",
    "tldr": "本论文提出了CBCL-PR框架，灵感来自海马体和新皮层的概念学习理论，用于解决机器人领域中少样本类增量学习的问题。该框架通过回放旧类别的数据来避免遗忘，在目标分类方面取得了最新的性能。同时，在机器人上的实验也证实了该框架在大量家庭物品的分类任务中有着优秀的表现。"
}