{
    "title": "AskIt: Unified Programming Interface for Programming with Large Language Models. (arXiv:2308.15645v1 [cs.PL])",
    "abstract": "In the evolving landscape of software development, Large Language Models (LLMs) exhibit a unique phenomenon known as emergent abilities, demonstrating adeptness across numerous tasks, from text summarization to code generation. While these abilities open up novel avenues in software design and crafting, their incorporation presents substantial challenges. Developers grapple with decisions surrounding the direct embedding of LLMs within applications versus employing them for code generation. Moreover, effective prompt design becomes a critical concern, given the necessity of data extraction from natural language outputs. To address these intricacies, this paper introduces AskIt, a domain-specific language (DSL) specifically designed for LLMs. AskIt simplifies LLM integration, offering type-guided output control, template-based function definitions, and a unified interface that diminishes the distinction between LLM-based code generation and application integration. Furthermore, through ",
    "link": "http://arxiv.org/abs/2308.15645",
    "context": "Title: AskIt: Unified Programming Interface for Programming with Large Language Models. (arXiv:2308.15645v1 [cs.PL])\nAbstract: In the evolving landscape of software development, Large Language Models (LLMs) exhibit a unique phenomenon known as emergent abilities, demonstrating adeptness across numerous tasks, from text summarization to code generation. While these abilities open up novel avenues in software design and crafting, their incorporation presents substantial challenges. Developers grapple with decisions surrounding the direct embedding of LLMs within applications versus employing them for code generation. Moreover, effective prompt design becomes a critical concern, given the necessity of data extraction from natural language outputs. To address these intricacies, this paper introduces AskIt, a domain-specific language (DSL) specifically designed for LLMs. AskIt simplifies LLM integration, offering type-guided output control, template-based function definitions, and a unified interface that diminishes the distinction between LLM-based code generation and application integration. Furthermore, through ",
    "path": "papers/23/08/2308.15645.json",
    "total_tokens": 834,
    "translated_title": "AskIt: 大型语言模型的统一编程接口",
    "translated_abstract": "在软件开发的不断发展中，大型语言模型 (LLMs) 展示了一种独特的现象，即 emergent abilities，展示了在多个任务中的熟练能力，从文本摘要到代码生成。虽然这些能力在软件设计和开发方面开辟了新的途径，但它们的整合也带来了重大挑战。开发者面临着将LLMs直接嵌入应用程序或将其用于代码生成的决策。此外，有效的提示设计成为一个关键问题，考虑到从自然语言输出中提取数据的必要性。为了解决这些复杂性，本文介绍了AskIt，一种专为LLMs设计的领域特定语言 (DSL)。AskIt简化了LLM的集成，提供了类型指导的输出控制，基于模板的函数定义以及统一的接口，减少了LLM的基于代码生成和应用程序集成之间的区别。",
    "tldr": "AskIt是一个专为大型语言模型设计的领域特定语言，通过简化LLM的集成和提供统一的接口，解决了LLM嵌入应用程序和代码生成的挑战。",
    "en_tdlr": "AskIt is a domain-specific language designed for Large Language Models (LLMs), which simplifies LLM integration and provides a unified interface to address the challenges of incorporating LLMs into applications and code generation."
}