{
    "title": "Knowledge-enhanced Neuro-Symbolic AI for Cybersecurity and Privacy. (arXiv:2308.02031v1 [cs.CY])",
    "abstract": "Neuro-Symbolic Artificial Intelligence (AI) is an emerging and quickly advancing field that combines the subsymbolic strengths of (deep) neural networks and explicit, symbolic knowledge contained in knowledge graphs to enhance explainability and safety in AI systems. This approach addresses a key criticism of current generation systems, namely their inability to generate human-understandable explanations for their outcomes and ensure safe behaviors, especially in scenarios with \\textit{unknown unknowns} (e.g. cybersecurity, privacy). The integration of neural networks, which excel at exploring complex data spaces, and symbolic knowledge graphs, which represent domain knowledge, allows AI systems to reason, learn, and generalize in a manner understandable to experts. This article describes how applications in cybersecurity and privacy, two most demanding domains in terms of the need for AI to be explainable while being highly accurate in complex environments, can benefit from Neuro-Symb",
    "link": "http://arxiv.org/abs/2308.02031",
    "context": "Title: Knowledge-enhanced Neuro-Symbolic AI for Cybersecurity and Privacy. (arXiv:2308.02031v1 [cs.CY])\nAbstract: Neuro-Symbolic Artificial Intelligence (AI) is an emerging and quickly advancing field that combines the subsymbolic strengths of (deep) neural networks and explicit, symbolic knowledge contained in knowledge graphs to enhance explainability and safety in AI systems. This approach addresses a key criticism of current generation systems, namely their inability to generate human-understandable explanations for their outcomes and ensure safe behaviors, especially in scenarios with \\textit{unknown unknowns} (e.g. cybersecurity, privacy). The integration of neural networks, which excel at exploring complex data spaces, and symbolic knowledge graphs, which represent domain knowledge, allows AI systems to reason, learn, and generalize in a manner understandable to experts. This article describes how applications in cybersecurity and privacy, two most demanding domains in terms of the need for AI to be explainable while being highly accurate in complex environments, can benefit from Neuro-Symb",
    "path": "papers/23/08/2308.02031.json",
    "total_tokens": 905,
    "translated_title": "基于知识增强的神经符号人工智能用于网络安全和隐私保护",
    "translated_abstract": "神经符号人工智能是一个新兴且快速发展的领域，它将（深度）神经网络的子符号优势与知识图中的显式符号知识相结合，以提高人工智能系统的可解释性和安全性。这种方法解决了当前一代系统的关键问题，即它们无法为其结果生成人类可理解的解释，并在存在“未知未知”（例如网络安全、隐私）情况下确保安全行为。神经网络（擅长探索复杂数据空间）和符号知识图的整合（代表领域知识）使得人工智能系统能够以专家可理解的方式进行推理、学习和泛化。本文描述了神经符号人工智能如何在网络安全和隐私保护领域中应用，并且这两个领域对于人工智能的可解释性和在复杂环境中的高准确性需求最大，可以从神经符号人工智能中获益。",
    "tldr": "知识增强的神经符号人工智能将深度神经网络和符号知识图相结合，提高了人工智能系统的可解释性和安全性，在网络安全和隐私保护领域具有潜在应用价值。",
    "en_tdlr": "Knowledge-enhanced Neuro-Symbolic AI combines deep neural networks with symbolic knowledge graphs to improve the explainability and safety of AI systems, showing potential applications in cybersecurity and privacy protection."
}