{
    "title": "Active learning for fast and slow modeling attacks on Arbiter PUFs. (arXiv:2308.13645v1 [cs.CR])",
    "abstract": "Modeling attacks, in which an adversary uses machine learning techniques to model a hardware-based Physically Unclonable Function (PUF) pose a great threat to the viability of these hardware security primitives. In most modeling attacks, a random subset of challenge-response-pairs (CRPs) are used as the labeled data for the machine learning algorithm. Here, for the arbiter-PUF, a delay based PUF which may be viewed as a linear threshold function with random weights (due to manufacturing imperfections), we investigate the role of active learning in Support Vector Machine (SVM) learning. We focus on challenge selection to help SVM algorithm learn ``fast'' and learn ``slow''. Our methods construct challenges rather than relying on a sample pool of challenges as in prior work. Using active learning to learn ``fast'' (less CRPs revealed, higher accuracies) may help manufacturers learn the manufactured PUFs more efficiently, or may form a more powerful attack when the attacker may query the ",
    "link": "http://arxiv.org/abs/2308.13645",
    "context": "Title: Active learning for fast and slow modeling attacks on Arbiter PUFs. (arXiv:2308.13645v1 [cs.CR])\nAbstract: Modeling attacks, in which an adversary uses machine learning techniques to model a hardware-based Physically Unclonable Function (PUF) pose a great threat to the viability of these hardware security primitives. In most modeling attacks, a random subset of challenge-response-pairs (CRPs) are used as the labeled data for the machine learning algorithm. Here, for the arbiter-PUF, a delay based PUF which may be viewed as a linear threshold function with random weights (due to manufacturing imperfections), we investigate the role of active learning in Support Vector Machine (SVM) learning. We focus on challenge selection to help SVM algorithm learn ``fast'' and learn ``slow''. Our methods construct challenges rather than relying on a sample pool of challenges as in prior work. Using active learning to learn ``fast'' (less CRPs revealed, higher accuracies) may help manufacturers learn the manufactured PUFs more efficiently, or may form a more powerful attack when the attacker may query the ",
    "path": "papers/23/08/2308.13645.json",
    "total_tokens": 999,
    "translated_title": "Arbiter PUF对快速和慢速建模攻击的主动学习",
    "translated_abstract": "建模攻击是指对基于硬件的物理不可克隆函数 (PUF) 进行建模的攻击，这对这些硬件安全原语的可行性构成了巨大威胁。在大多数建模攻击中，一部分随机的挑战-响应对 (CRP) 被用作机器学习算法的标记数据。在这里，针对阀值函数带来的 aribiter-PUF 进行了研究，该阈值函数由于制造缺陷而具有随机权重。我们研究了在支持向量机 (SVM) 学习中主动学习的作用。我们关注的是通过挑战选择来帮助 SVM 算法实现“快速”学习和“慢速”学习。我们的方法是构建挑战，而不是像先前的工作中依赖样本池的挑战。使用主动学习实现“快速”学习（揭示更少的 CRPs，得到更高的准确性）可能有助于制造商更高效地学习制造的 PUF，或者在攻击者可以查询并收集较少的CRPs信息时形成更强大的攻击。",
    "tldr": "本论文研究了在物理不可克隆函数中的主动学习对于建模攻击的作用，使用率阀值函数提出了一种新的挑战选择方法，通过主动学习实现“快速”学习可以提高准确性，并有效地学习制造的PUF。",
    "en_tdlr": "This paper investigates the role of active learning in modeling attacks on Physically Unclonable Functions (PUFs), proposes a new challenge selection method for threshold functions, and shows that using active learning to achieve \"fast\" learning can improve accuracy and effectively learn manufactured PUFs."
}