{
    "title": "Scaling Data Science Solutions with Semantics and Machine Learning: Bosch Case. (arXiv:2308.01094v1 [cs.AI])",
    "abstract": "Industry 4.0 and Internet of Things (IoT) technologies unlock unprecedented amount of data from factory production, posing big data challenges in volume and variety. In that context, distributed computing solutions such as cloud systems are leveraged to parallelise the data processing and reduce computation time. As the cloud systems become increasingly popular, there is increased demand that more users that were originally not cloud experts (such as data scientists, domain experts) deploy their solutions on the cloud systems. However, it is non-trivial to address both the high demand for cloud system users and the excessive time required to train them. To this end, we propose SemCloud, a semantics-enhanced cloud system, that couples cloud system with semantic technologies and machine learning. SemCloud relies on domain ontologies and mappings for data integration, and parallelises the semantic data integration and data analysis on distributed computing nodes. Furthermore, SemCloud ado",
    "link": "http://arxiv.org/abs/2308.01094",
    "context": "Title: Scaling Data Science Solutions with Semantics and Machine Learning: Bosch Case. (arXiv:2308.01094v1 [cs.AI])\nAbstract: Industry 4.0 and Internet of Things (IoT) technologies unlock unprecedented amount of data from factory production, posing big data challenges in volume and variety. In that context, distributed computing solutions such as cloud systems are leveraged to parallelise the data processing and reduce computation time. As the cloud systems become increasingly popular, there is increased demand that more users that were originally not cloud experts (such as data scientists, domain experts) deploy their solutions on the cloud systems. However, it is non-trivial to address both the high demand for cloud system users and the excessive time required to train them. To this end, we propose SemCloud, a semantics-enhanced cloud system, that couples cloud system with semantic technologies and machine learning. SemCloud relies on domain ontologies and mappings for data integration, and parallelises the semantic data integration and data analysis on distributed computing nodes. Furthermore, SemCloud ado",
    "path": "papers/23/08/2308.01094.json",
    "total_tokens": 973,
    "translated_title": "使用语义和机器学习扩展数据科学解决方案：博世案例研究",
    "translated_abstract": "工业4.0和物联网技术释放了大量的工厂生产数据，导致了大数据方面的挑战。在这种情况下，云系统等分布式计算解决方案被用来并行处理数据并减少计算时间。随着云系统越来越受欢迎，更多原本不是云专家的用户（如数据科学家、领域专家）需要在云系统上部署解决方案，但是如何满足云系统用户的高需求以及训练他们所需的过长时间是一个非常复杂的问题。因此，我们提出了SemCloud，一个结合了语义技术和机器学习的语义增强云系统。SemCloud依赖于领域本体和映射进行数据集成，并在分布式计算节点上并行进行语义数据集成和数据分析。此外，SemCloud还采用了自适应学习算法来降低训练时间。",
    "tldr": "该论文提出了SemCloud，一个结合了语义技术和机器学习的语义增强云系统，以应对工业4.0和物联网时代大数据处理的挑战。该系统通过使用领域本体和映射来进行数据集成，并在分布式计算节点上并行处理语义数据和分析任务。此外，SemCloud还采用了自适应学习算法来降低用户训练时间的要求。",
    "en_tdlr": "This paper proposes SemCloud, a semantics-enhanced cloud system that combines semantic technologies and machine learning to address the challenges of big data processing in the Industry 4.0 and IoT era. The system integrates data through domain ontologies and mappings, and parallelizes semantic data integration and analysis on distributed computing nodes. In addition, SemCloud adopts adaptive learning algorithms to reduce the training time for users."
}