{
    "title": "Generalising sequence models for epigenome predictions with tissue and assay embeddings. (arXiv:2308.11671v1 [q-bio.GN])",
    "abstract": "Sequence modelling approaches for epigenetic profile prediction have recently expanded in terms of sequence length, model size, and profile diversity. However, current models cannot infer on many experimentally feasible tissue and assay pairs due to poor usage of contextual information, limiting $\\textit{in silico}$ understanding of regulatory genomics. We demonstrate that strong correlation can be achieved across a large range of experimental conditions by integrating tissue and assay embeddings into a Contextualised Genomic Network (CGN). In contrast to previous approaches, we enhance long-range sequence embeddings with contextual information in the input space, rather than expanding the output space. We exhibit the efficacy of our approach across a broad set of epigenetic profiles and provide the first insights into the effect of genetic variants on epigenetic sequence model training. Our general approach to context integration exceeds state of the art in multiple settings while emp",
    "link": "http://arxiv.org/abs/2308.11671",
    "context": "Title: Generalising sequence models for epigenome predictions with tissue and assay embeddings. (arXiv:2308.11671v1 [q-bio.GN])\nAbstract: Sequence modelling approaches for epigenetic profile prediction have recently expanded in terms of sequence length, model size, and profile diversity. However, current models cannot infer on many experimentally feasible tissue and assay pairs due to poor usage of contextual information, limiting $\\textit{in silico}$ understanding of regulatory genomics. We demonstrate that strong correlation can be achieved across a large range of experimental conditions by integrating tissue and assay embeddings into a Contextualised Genomic Network (CGN). In contrast to previous approaches, we enhance long-range sequence embeddings with contextual information in the input space, rather than expanding the output space. We exhibit the efficacy of our approach across a broad set of epigenetic profiles and provide the first insights into the effect of genetic variants on epigenetic sequence model training. Our general approach to context integration exceeds state of the art in multiple settings while emp",
    "path": "papers/23/08/2308.11671.json",
    "total_tokens": 913,
    "translated_title": "使用组织和实验嵌入推广序列模型进行表观基因组预测",
    "translated_abstract": "近年来，用于表观遗传图谱预测的序列建模方法在序列长度、模型规模和图谱多样性方面有了进一步发展。然而，由于对上下文信息的利用不足，当前模型无法对许多实验可行的组织和实验组合进行推理，限制了对调控基因组的$\\textit{in silico}$理解。我们演示了通过将组织和实验嵌入纳入到上下文化的基因组网络（CGN）中，可以在广泛的实验条件下实现强相关性。与以前的方法不同，我们通过在输入空间中增强长程序列嵌入来提供上下文信息，而不是扩展输出空间。我们展示了我们方法在广泛的表观遗传图谱中的有效性，并首次揭示了遗传变异对表观序列模型训练的影响。我们的上下文集成方法在多种设置中超越了现有技术水平。",
    "tldr": "本文提出了一种将组织和实验嵌入到上下文化的基因组网络（CGN）中的方法，通过在输入空间中增强长程序列嵌入来提供上下文信息，实现了广泛的实验条件下的强相关性，并在多种设置中超越了现有技术水平。"
}