{
    "title": "Terrain Diffusion Network: Climatic-Aware Terrain Generation with Geological Sketch Guidance. (arXiv:2308.16725v1 [cs.CV])",
    "abstract": "Sketch-based terrain generation seeks to create realistic landscapes for virtual environments in various applications such as computer games, animation and virtual reality. Recently, deep learning based terrain generation has emerged, notably the ones based on generative adversarial networks (GAN). However, these methods often struggle to fulfill the requirements of flexible user control and maintain generative diversity for realistic terrain. Therefore, we propose a novel diffusion-based method, namely terrain diffusion network (TDN), which actively incorporates user guidance for enhanced controllability, taking into account terrain features like rivers, ridges, basins, and peaks. Instead of adhering to a conventional monolithic denoising process, which often compromises the fidelity of terrain details or the alignment with user control, a multi-level denoising scheme is proposed to generate more realistic terrains by taking into account fine-grained details, particularly those relate",
    "link": "http://arxiv.org/abs/2308.16725",
    "context": "Title: Terrain Diffusion Network: Climatic-Aware Terrain Generation with Geological Sketch Guidance. (arXiv:2308.16725v1 [cs.CV])\nAbstract: Sketch-based terrain generation seeks to create realistic landscapes for virtual environments in various applications such as computer games, animation and virtual reality. Recently, deep learning based terrain generation has emerged, notably the ones based on generative adversarial networks (GAN). However, these methods often struggle to fulfill the requirements of flexible user control and maintain generative diversity for realistic terrain. Therefore, we propose a novel diffusion-based method, namely terrain diffusion network (TDN), which actively incorporates user guidance for enhanced controllability, taking into account terrain features like rivers, ridges, basins, and peaks. Instead of adhering to a conventional monolithic denoising process, which often compromises the fidelity of terrain details or the alignment with user control, a multi-level denoising scheme is proposed to generate more realistic terrains by taking into account fine-grained details, particularly those relate",
    "path": "papers/23/08/2308.16725.json",
    "total_tokens": 869,
    "translated_title": "地形扩散网络：具有地质草图引导的气候感知地形生成",
    "translated_abstract": "基于草图的地形生成旨在为虚拟环境创建逼真的景观，广泛应用于计算机游戏、动画和虚拟现实等领域。最近，基于深度学习的地形生成方法不断涌现，尤其是基于生成对抗网络（GAN）的方法。然而，这些方法常常难以满足用户灵活控制和保持生成多样性以实现逼真地形的要求。因此，我们提出了一种全新的基于扩散的方法，即地形扩散网络（TDN），它主动融合用户引导以增强可控性，并考虑到河流、山脊、盆地和山峰等地形特征。与传统的单一去噪方法不同，该方法提出了多层次的去噪方案，通过考虑细粒度的细节，特别是与用户控制相关的细节，生成更加逼真的地形。",
    "tldr": "提出了一种基于扩散的地形生成方法，名为地形扩散网络（TDN），该方法通过用户引导以实现更好的可控性，并考虑地形特征为虚拟环境生成逼真的地形。",
    "en_tdlr": "A diffusion-based method, called Terrain Diffusion Network (TDN), is proposed for terrain generation, which enhances controllability through user guidance and takes into account terrain features to generate realistic terrains for virtual environments."
}