{
    "title": "Scalable and Equitable Math Problem Solving Strategy Prediction in Big Educational Data. (arXiv:2308.03892v1 [cs.LG])",
    "abstract": "Understanding a student's problem-solving strategy can have a significant impact on effective math learning using Intelligent Tutoring Systems (ITSs) and Adaptive Instructional Systems (AISs). For instance, the ITS/AIS can better personalize itself to correct specific misconceptions that are indicated by incorrect strategies, specific problems can be designed to improve strategies and frustration can be minimized by adapting to a student's natural way of thinking rather than trying to fit a standard strategy for all. While it may be possible for human experts to identify strategies manually in classroom settings with sufficient student interaction, it is not possible to scale this up to big data. Therefore, we leverage advances in Machine Learning and AI methods to perform scalable strategy prediction that is also fair to students at all skill levels. Specifically, we develop an embedding called MVec where we learn a representation based on the mastery of students. We then cluster thes",
    "link": "http://arxiv.org/abs/2308.03892",
    "context": "Title: Scalable and Equitable Math Problem Solving Strategy Prediction in Big Educational Data. (arXiv:2308.03892v1 [cs.LG])\nAbstract: Understanding a student's problem-solving strategy can have a significant impact on effective math learning using Intelligent Tutoring Systems (ITSs) and Adaptive Instructional Systems (AISs). For instance, the ITS/AIS can better personalize itself to correct specific misconceptions that are indicated by incorrect strategies, specific problems can be designed to improve strategies and frustration can be minimized by adapting to a student's natural way of thinking rather than trying to fit a standard strategy for all. While it may be possible for human experts to identify strategies manually in classroom settings with sufficient student interaction, it is not possible to scale this up to big data. Therefore, we leverage advances in Machine Learning and AI methods to perform scalable strategy prediction that is also fair to students at all skill levels. Specifically, we develop an embedding called MVec where we learn a representation based on the mastery of students. We then cluster thes",
    "path": "papers/23/08/2308.03892.json",
    "total_tokens": 695,
    "translated_title": "可扩展且公平的大规模教育数据中数学问题解决策略预测",
    "translated_abstract": "理解学生的问题解决策略对于使用智能辅导系统和自适应教学系统具有重要影响。然而，在大规模数据中手动识别策略是不可行的，因此我们利用机器学习和人工智能方法进行可扩展且公平的策略预测。具体而言，我们开发了一种称为MVec的嵌入，通过学生掌握程度来学习表示，并对学生进行聚类。",
    "tldr": "本研究通过机器学习和人工智能方法实现了可扩展且公平的大规模教育数据中数学问题解决策略预测。"
}