{
    "title": "Interpretable Goal-Based model for Vehicle Trajectory Prediction in Interactive Scenarios. (arXiv:2308.04312v1 [cs.AI])",
    "abstract": "The abilities to understand the social interaction behaviors between a vehicle and its surroundings while predicting its trajectory in an urban environment are critical for road safety in autonomous driving. Social interactions are hard to explain because of their uncertainty. In recent years, neural network-based methods have been widely used for trajectory prediction and have been shown to outperform hand-crafted methods. However, these methods suffer from their lack of interpretability. In order to overcome this limitation, we combine the interpretability of a discrete choice model with the high accuracy of a neural network-based model for the task of vehicle trajectory prediction in an interactive environment. We implement and evaluate our model using the INTERACTION dataset and demonstrate the effectiveness of our proposed architecture to explain its predictions without compromising the accuracy.",
    "link": "http://arxiv.org/abs/2308.04312",
    "context": "Title: Interpretable Goal-Based model for Vehicle Trajectory Prediction in Interactive Scenarios. (arXiv:2308.04312v1 [cs.AI])\nAbstract: The abilities to understand the social interaction behaviors between a vehicle and its surroundings while predicting its trajectory in an urban environment are critical for road safety in autonomous driving. Social interactions are hard to explain because of their uncertainty. In recent years, neural network-based methods have been widely used for trajectory prediction and have been shown to outperform hand-crafted methods. However, these methods suffer from their lack of interpretability. In order to overcome this limitation, we combine the interpretability of a discrete choice model with the high accuracy of a neural network-based model for the task of vehicle trajectory prediction in an interactive environment. We implement and evaluate our model using the INTERACTION dataset and demonstrate the effectiveness of our proposed architecture to explain its predictions without compromising the accuracy.",
    "path": "papers/23/08/2308.04312.json",
    "total_tokens": 823,
    "translated_title": "可解释的目标导向模型用于交互场景中的车辆轨迹预测",
    "translated_abstract": "在自动驾驶中，理解车辆与周围环境之间的社交互动行为并预测其在城市环境中的轨迹是确保道路安全的关键。由于不确定性，社交互动很难解释。近年来，基于神经网络的方法已广泛用于轨迹预测，并且已被证明优于手工设计的方法。然而，这些方法缺乏可解释性。为了克服这一局限性，我们将离散选择模型的可解释性与基于神经网络的模型的高准确性相结合，用于交互环境中的车辆轨迹预测任务。我们使用INTERACTION数据集实现和评估了我们的模型，并展示了我们提出的架构在解释预测时不会影响准确性的有效性。",
    "tldr": "本论文提出了一个可解释的目标导向模型，通过结合离散选择模型的可解释性和基于神经网络的模型的高准确性，在交互环境中预测车辆轨迹。使用INTERACTION数据集验证了该模型的有效性。",
    "en_tdlr": "This paper proposes an interpretable goal-based model that combines the interpretability of a discrete choice model with the high accuracy of a neural network-based model to predict vehicle trajectories in interactive scenarios. The effectiveness of the model is demonstrated using the INTERACTION dataset."
}