{
    "title": "Using ScrutinAI for Visual Inspection of DNN Performance in a Medical Use Case. (arXiv:2308.01220v1 [cs.LG])",
    "abstract": "Our Visual Analytics (VA) tool ScrutinAI supports human analysts to investigate interactively model performanceand data sets. Model performance depends on labeling quality to a large extent. In particular in medical settings, generation of high quality labels requires in depth expert knowledge and is very costly. Often, data sets are labeled by collecting opinions of groups of experts. We use our VA tool to analyse the influence of label variations between different experts on the model performance. ScrutinAI facilitates to perform a root cause analysis that distinguishes weaknesses of deep neural network (DNN) models caused by varying or missing labeling quality from true weaknesses. We scrutinize the overall detection of intracranial hemorrhages and the more subtle differentiation between subtypes in a publicly available data set.",
    "link": "http://arxiv.org/abs/2308.01220",
    "context": "Title: Using ScrutinAI for Visual Inspection of DNN Performance in a Medical Use Case. (arXiv:2308.01220v1 [cs.LG])\nAbstract: Our Visual Analytics (VA) tool ScrutinAI supports human analysts to investigate interactively model performanceand data sets. Model performance depends on labeling quality to a large extent. In particular in medical settings, generation of high quality labels requires in depth expert knowledge and is very costly. Often, data sets are labeled by collecting opinions of groups of experts. We use our VA tool to analyse the influence of label variations between different experts on the model performance. ScrutinAI facilitates to perform a root cause analysis that distinguishes weaknesses of deep neural network (DNN) models caused by varying or missing labeling quality from true weaknesses. We scrutinize the overall detection of intracranial hemorrhages and the more subtle differentiation between subtypes in a publicly available data set.",
    "path": "papers/23/08/2308.01220.json",
    "total_tokens": 821,
    "translated_title": "在医学应用中使用ScrutinAI进行DNN性能的视觉检查",
    "translated_abstract": "我们的可视化分析工具ScrutinAI支持人工分析师交互式地研究模型性能和数据集。模型性能在很大程度上取决于标注质量。特别是在医学环境中，生成高质量的标注需要深入的专业知识，并且非常昂贵。通常，数据集通过收集专家群体的意见进行标注。我们使用我们的可视化分析工具来分析不同专家之间标注变异对模型性能的影响。ScrutinAI有助于进行根本原因分析，将由标注质量不同或缺失引起的深度神经网络（DNN）模型的缺点与真正的缺陷区别开来。我们详细检查了公开可用的数据集中颅内出血的整体检测和亚型之间更细微的区分。",
    "tldr": "我们使用可视化分析工具ScrutinAI来研究医疗领域的模型性能和数据集标注质量对模型性能的影响，以及分析深度神经网络模型的缺点和真正的缺陷之间的区别。",
    "en_tdlr": "We use the visual analytics tool ScrutinAI to investigate the impact of model performance, data labeling quality, and weaknesses of deep neural network models in a medical context."
}