{
    "title": "Context-aware Event Forecasting via Graph Disentanglement. (arXiv:2308.06480v1 [cs.IR])",
    "abstract": "Event forecasting has been a demanding and challenging task throughout the entire human history. It plays a pivotal role in crisis alarming and disaster prevention in various aspects of the whole society. The task of event forecasting aims to model the relational and temporal patterns based on historical events and makes forecasting to what will happen in the future. Most existing studies on event forecasting formulate it as a problem of link prediction on temporal event graphs. However, such pure structured formulation suffers from two main limitations: 1) most events fall into general and high-level types in the event ontology, and therefore they tend to be coarse-grained and offers little utility which inevitably harms the forecasting accuracy; and 2) the events defined by a fixed ontology are unable to retain the out-of-ontology contextual information. To address these limitations, we propose a novel task of context-aware event forecasting which incorporates auxiliary contextual in",
    "link": "http://arxiv.org/abs/2308.06480",
    "context": "Title: Context-aware Event Forecasting via Graph Disentanglement. (arXiv:2308.06480v1 [cs.IR])\nAbstract: Event forecasting has been a demanding and challenging task throughout the entire human history. It plays a pivotal role in crisis alarming and disaster prevention in various aspects of the whole society. The task of event forecasting aims to model the relational and temporal patterns based on historical events and makes forecasting to what will happen in the future. Most existing studies on event forecasting formulate it as a problem of link prediction on temporal event graphs. However, such pure structured formulation suffers from two main limitations: 1) most events fall into general and high-level types in the event ontology, and therefore they tend to be coarse-grained and offers little utility which inevitably harms the forecasting accuracy; and 2) the events defined by a fixed ontology are unable to retain the out-of-ontology contextual information. To address these limitations, we propose a novel task of context-aware event forecasting which incorporates auxiliary contextual in",
    "path": "papers/23/08/2308.06480.json",
    "total_tokens": 868,
    "translated_title": "基于图解缠结的上下文感知事件预测",
    "translated_abstract": "事件预测一直是一个艰巨而具有挑战性的任务，在整个人类历史中都扮演着重要角色。它在危机警报和灾害预防等社会各个方面起着关键作用。事件预测的任务旨在基于历史事件建模关系和时间模式，并预测未来的发展。大多数现有的事件预测研究将其制定为基于时间事件图上的链接预测问题。然而，这种纯结构化的制定方式存在两个主要限制：1) 大多数事件属于事件本体论中的一般和高级类型，因此它们倾向于粗粒度，并且提供了少量的实用性，这不可避免地损害了预测准确性；2) 通过固定本体论定义的事件无法保留超出本体之外的上下文信息。为了解决这些限制，我们提出了一种新颖的上下文感知事件预测任务，其将辅助上下文信息集成进来。",
    "tldr": "通过图解缠结的方式，我们提出了一种上下文感知的事件预测方法，以解决现有方法中事件粒度过粗和无法保留超出本体之外的上下文信息的问题。",
    "en_tdlr": "We propose a context-aware event forecasting method using graph disentanglement to address the limitations of existing methods in terms of coarse event granularity and the inability to retain out-of-ontology contextual information."
}