{
    "title": "Predictive Modeling of Menstrual Cycle Length: A Time Series Forecasting Approach. (arXiv:2308.07927v1 [cs.LG])",
    "abstract": "A proper forecast of the menstrual cycle is meaningful for women's health, as it allows individuals to take preventive actions to minimize cycle-associated discomforts. In addition, precise prediction can be useful for planning important events in a woman's life, such as family planning. In this work, we explored the use of machine learning techniques to predict regular and irregular menstrual cycles. We implemented some time series forecasting algorithm approaches, such as AutoRegressive Integrated Moving Average, Huber Regression, Lasso Regression, Orthogonal Matching Pursuit, and Long Short-Term Memory Network. Moreover, we generated synthetic data to achieve our purposes. The results showed that it is possible to accurately predict the onset and duration of menstrual cycles using machine learning techniques.",
    "link": "http://arxiv.org/abs/2308.07927",
    "context": "Title: Predictive Modeling of Menstrual Cycle Length: A Time Series Forecasting Approach. (arXiv:2308.07927v1 [cs.LG])\nAbstract: A proper forecast of the menstrual cycle is meaningful for women's health, as it allows individuals to take preventive actions to minimize cycle-associated discomforts. In addition, precise prediction can be useful for planning important events in a woman's life, such as family planning. In this work, we explored the use of machine learning techniques to predict regular and irregular menstrual cycles. We implemented some time series forecasting algorithm approaches, such as AutoRegressive Integrated Moving Average, Huber Regression, Lasso Regression, Orthogonal Matching Pursuit, and Long Short-Term Memory Network. Moreover, we generated synthetic data to achieve our purposes. The results showed that it is possible to accurately predict the onset and duration of menstrual cycles using machine learning techniques.",
    "path": "papers/23/08/2308.07927.json",
    "total_tokens": 752,
    "translated_title": "\"月经周期长度的预测建模：一种时间序列预测方法\"",
    "translated_abstract": "正确预测月经周期对女性健康至关重要，因为它可以让个体采取预防措施来减少与周期相关的不适。此外，精确的预测对于规划女性生活中的重要事件，如计划生育，也是有用的。本研究探索了使用机器学习技术来预测规律和不规律月经周期的方法。我们实现了一些时间序列预测算法，如自回归综合移动平均、Huber回归、Lasso回归、正交匹配追踪和长短期记忆网络。此外，我们还生成了合成数据来实现我们的目的。结果表明，使用机器学习技术可以准确预测月经周期的开始和持续时间。",
    "tldr": "本研究通过使用机器学习技术，探索了预测月经周期的方法，结果表明可以准确预测月经周期的开始和持续时间。"
}