{
    "title": "Predicting Resilience with Neural Networks. (arXiv:2308.06309v1 [eess.SY])",
    "abstract": "Resilience engineering studies the ability of a system to survive and recover from disruptive events, which finds applications in several domains. Most studies emphasize resilience metrics to quantify system performance, whereas recent studies propose statistical modeling approaches to project system recovery time after degradation. Moreover, past studies are either performed on data after recovering or limited to idealized trends. Therefore, this paper proposes three alternative neural network (NN) approaches including (i) Artificial Neural Networks, (ii) Recurrent Neural Networks, and (iii) Long-Short Term Memory (LSTM) to model and predict system performance, including negative and positive factors driving resilience to quantify the impact of disruptive events and restorative activities. Goodness-of-fit measures are computed to evaluate the models and compared with a classical statistical model, including mean squared error and adjusted R squared. Our results indicate that NN models",
    "link": "http://arxiv.org/abs/2308.06309",
    "context": "Title: Predicting Resilience with Neural Networks. (arXiv:2308.06309v1 [eess.SY])\nAbstract: Resilience engineering studies the ability of a system to survive and recover from disruptive events, which finds applications in several domains. Most studies emphasize resilience metrics to quantify system performance, whereas recent studies propose statistical modeling approaches to project system recovery time after degradation. Moreover, past studies are either performed on data after recovering or limited to idealized trends. Therefore, this paper proposes three alternative neural network (NN) approaches including (i) Artificial Neural Networks, (ii) Recurrent Neural Networks, and (iii) Long-Short Term Memory (LSTM) to model and predict system performance, including negative and positive factors driving resilience to quantify the impact of disruptive events and restorative activities. Goodness-of-fit measures are computed to evaluate the models and compared with a classical statistical model, including mean squared error and adjusted R squared. Our results indicate that NN models",
    "path": "papers/23/08/2308.06309.json",
    "total_tokens": 887,
    "translated_title": "用神经网络预测弹性",
    "translated_abstract": "弹性工程研究系统在遭受破坏性事件后的存活和恢复能力，在多个领域有应用。大部分研究强调弹性度量来量化系统性能，而最近的研究提出了统计建模方法来预测系统在退化后的恢复时间。此外，过去的研究要么在恢复后的数据上进行，要么局限于理想化的趋势。因此，本文提出了三种替代的神经网络（NN）方法，包括（i）人工神经网络，（ii）循环神经网络，（iii）长短期记忆（LSTM），用于建模和预测系统性能，包括驱动弹性的负面和正面因素，以量化破坏性事件和恢复活动的影响。使用均方误差和调整R平方等拟合度量指标来评估这些模型并与经典的统计模型进行比较。我们的结果表明NN模型可以有效预测系统的弹性。",
    "tldr": "本文提出了三种神经网络方法来预测系统的弹性，包括负面和正面因素的影响，对破坏性事件和恢复活动进行建模和预测。实验结果显示神经网络模型可以有效预测系统的弹性。"
}