{
    "title": "Adaptation Speed Analysis for Fairness-aware Causal Models. (arXiv:2308.16879v1 [cs.AI])",
    "abstract": "For example, in machine translation tasks, to achieve bidirectional translation between two languages, the source corpus is often used as the target corpus, which involves the training of two models with opposite directions. The question of which one can adapt most quickly to a domain shift is of significant importance in many fields. Specifically, consider an original distribution p that changes due to an unknown intervention, resulting in a modified distribution p*. In aligning p with p*, several factors can affect the adaptation rate, including the causal dependencies between variables in p. In real-life scenarios, however, we have to consider the fairness of the training process, and it is particularly crucial to involve a sensitive variable (bias) present between a cause and an effect variable. To explore this scenario, we examine a simple structural causal model (SCM) with a cause-bias-effect structure, where variable A acts as a sensitive variable between cause (X) and effect (Y",
    "link": "http://arxiv.org/abs/2308.16879",
    "context": "Title: Adaptation Speed Analysis for Fairness-aware Causal Models. (arXiv:2308.16879v1 [cs.AI])\nAbstract: For example, in machine translation tasks, to achieve bidirectional translation between two languages, the source corpus is often used as the target corpus, which involves the training of two models with opposite directions. The question of which one can adapt most quickly to a domain shift is of significant importance in many fields. Specifically, consider an original distribution p that changes due to an unknown intervention, resulting in a modified distribution p*. In aligning p with p*, several factors can affect the adaptation rate, including the causal dependencies between variables in p. In real-life scenarios, however, we have to consider the fairness of the training process, and it is particularly crucial to involve a sensitive variable (bias) present between a cause and an effect variable. To explore this scenario, we examine a simple structural causal model (SCM) with a cause-bias-effect structure, where variable A acts as a sensitive variable between cause (X) and effect (Y",
    "path": "papers/23/08/2308.16879.json",
    "total_tokens": 956,
    "translated_title": "适应速度分析公平感知因果模型",
    "translated_abstract": "举例如机器翻译任务，在两种语言之间实现双向翻译时，通常将源语料库用作目标语料库，这涉及到训练两个具有相反方向的模型。在许多领域中，哪个模型可以最快地适应领域转变的问题具有重要意义。具体而言，考虑一个由于未知干预而改变的原始分布p，导致出现修改后的分布p*。在将p与p*对齐时，有多种因素可能影响适应速率，包括p中变量之间的因果依赖关系。然而，在实际场景中，我们必须考虑训练过程的公平性，并且在因果关系中涉及到一个敏感变量（偏差）在原因变量和效果变量之间是尤为关键的。为了探索这种情况，我们研究了一个带有因果-偏差-效果结构的简单结构因果模型（SCM)，其中变量A在原因（X）和效果（Y）之间充当敏感变量。",
    "tldr": "本研究考虑了适应速度分析公平感知因果模型的问题，通过研究带有因果-偏差-效果结构的简单结构因果模型，探讨了在训练过程中考虑敏感变量（偏差）的公平性和适应速率的相关因素。",
    "en_tdlr": "This study investigates the issue of adaptation speed analysis for fairness-aware causal models, exploring the factors related to the fairness and adaptation rate by examining a simple structural causal model with a cause-bias-effect structure and considering the involvement of a sensitive variable (bias) in the training process."
}