{
    "title": "Path Shadowing Monte-Carlo. (arXiv:2308.01486v1 [q-fin.MF])",
    "abstract": "We introduce a Path Shadowing Monte-Carlo method, which provides prediction of future paths, given any generative model. At any given date, it averages future quantities over generated price paths whose past history matches, or `shadows', the actual (observed) history. We test our approach using paths generated from a maximum entropy model of financial prices, based on a recently proposed multi-scale analogue of the standard skewness and kurtosis called `Scattering Spectra'. This model promotes diversity of generated paths while reproducing the main statistical properties of financial prices, including stylized facts on volatility roughness. Our method yields state-of-the-art predictions for future realized volatility and allows one to determine conditional option smiles for the S\\&P500 that outperform both the current version of the Path-Dependent Volatility model and the option market itself.",
    "link": "http://arxiv.org/abs/2308.01486",
    "context": "Title: Path Shadowing Monte-Carlo. (arXiv:2308.01486v1 [q-fin.MF])\nAbstract: We introduce a Path Shadowing Monte-Carlo method, which provides prediction of future paths, given any generative model. At any given date, it averages future quantities over generated price paths whose past history matches, or `shadows', the actual (observed) history. We test our approach using paths generated from a maximum entropy model of financial prices, based on a recently proposed multi-scale analogue of the standard skewness and kurtosis called `Scattering Spectra'. This model promotes diversity of generated paths while reproducing the main statistical properties of financial prices, including stylized facts on volatility roughness. Our method yields state-of-the-art predictions for future realized volatility and allows one to determine conditional option smiles for the S\\&P500 that outperform both the current version of the Path-Dependent Volatility model and the option market itself.",
    "path": "papers/23/08/2308.01486.json",
    "total_tokens": 911,
    "translated_title": "路径阴影蒙特卡洛方法",
    "translated_abstract": "我们介绍了一种路径阴影蒙特卡洛方法，可以根据任何生成模型对未来路径进行预测。在任何给定日期，该方法通过对生成的价格路径进行平均，其中过去的历史与实际观察到的历史相匹配或“阴影”。我们使用从金融价格的最大熵模型生成的路径进行测试，该模型基于最近提出的标准偏斜度和峰度的多尺度模拟称为“散射谱”。该模型促进了生成路径的多样性，同时重现了金融价格的主要统计特性，包括波动率粗糙度的特征事实。我们的方法为未来实现波动率提供了最先进的预测，并且可以确定超越当前版本的路径依赖波动率模型和期权市场本身的S\\&P500的条件期权笑曲线。",
    "tldr": "该论文提出了一种路径阴影蒙特卡洛方法，可以根据任何生成模型对未来路径进行预测，并通过对生成的价格路径进行平均来实现。该方法可以产生最先进的未来实现波动率预测，并且在确定S\\&P500的条件期权笑曲线方面优于当前版本的路径依赖波动率模型和期权市场本身。"
}