{
    "title": "Variational Label-Correlation Enhancement for Congestion Prediction. (arXiv:2308.00529v1 [cs.LG])",
    "abstract": "The physical design process of large-scale designs is a time-consuming task, often requiring hours to days to complete, with routing being the most critical and complex step. As the the complexity of Integrated Circuits (ICs) increases, there is an increased demand for accurate routing quality prediction. Accurate congestion prediction aids in identifying design flaws early on, thereby accelerating circuit design and conserving resources. Despite the advancements in current congestion prediction methodologies, an essential aspect that has been largely overlooked is the spatial label-correlation between different grids in congestion prediction. The spatial label-correlation is a fundamental characteristic of circuit design, where the congestion status of a grid is not isolated but inherently influenced by the conditions of its neighboring grids. In order to fully exploit the inherent spatial label-correlation between neighboring grids, we propose a novel approach, {\\ours}, i.e., VAriati",
    "link": "http://arxiv.org/abs/2308.00529",
    "context": "Title: Variational Label-Correlation Enhancement for Congestion Prediction. (arXiv:2308.00529v1 [cs.LG])\nAbstract: The physical design process of large-scale designs is a time-consuming task, often requiring hours to days to complete, with routing being the most critical and complex step. As the the complexity of Integrated Circuits (ICs) increases, there is an increased demand for accurate routing quality prediction. Accurate congestion prediction aids in identifying design flaws early on, thereby accelerating circuit design and conserving resources. Despite the advancements in current congestion prediction methodologies, an essential aspect that has been largely overlooked is the spatial label-correlation between different grids in congestion prediction. The spatial label-correlation is a fundamental characteristic of circuit design, where the congestion status of a grid is not isolated but inherently influenced by the conditions of its neighboring grids. In order to fully exploit the inherent spatial label-correlation between neighboring grids, we propose a novel approach, {\\ours}, i.e., VAriati",
    "path": "papers/23/08/2308.00529.json",
    "total_tokens": 894,
    "translated_title": "变分标签相关增强方法用于拥塞预测",
    "translated_abstract": "大规模设计的物理设计过程是一项耗时的任务，通常需要几小时到几天才能完成，其中路由是最关键和复杂的步骤。随着集成电路（IC）的复杂性增加，对准确的路由质量预测的需求也增加。准确的拥塞预测有助于及早发现设计缺陷，从而加快电路设计并节约资源。尽管当前拥塞预测方法取得了一定的进展，但一个重要的方面却往往被忽视，即不同格子之间的空间标签相关性。空间标签相关性是电路设计的基本特征，一个格子的拥塞情况不仅与其自身有关，还受其相邻格子的影响。为了充分利用相邻格子之间的内在空间标签相关性，我们提出了一种新颖的方法，即VAriational Label-Correlation Enhancement for Congestion Prediction（{\\ours}）。",
    "tldr": "本文提出了一种名为VAriational Label-Correlation Enhancement for Congestion Prediction（{\\ours}）的方法，用于准确预测集成电路中的拥塞情况。这种方法利用了格子之间的空间标签相关性，能够更好地识别设计缺陷，加快电路设计过程。",
    "en_tdlr": "This paper presents a method called VAriational Label-Correlation Enhancement for Congestion Prediction ({\\ours}), which accurately predicts congestion in integrated circuits by utilizing the spatial label-correlation between grids. This method allows for early detection of design flaws and accelerates the circuit design process."
}