{
    "title": "Boosting Adverse Drug Event Normalization on Social Media: General-Purpose Model Initialization and Biomedical Semantic Text Similarity Benefit Zero-Shot Linking in Informal Contexts. (arXiv:2308.00157v1 [cs.CL])",
    "abstract": "Biomedical entity linking, also known as biomedical concept normalization, has recently witnessed the rise to prominence of zero-shot contrastive models. However, the pre-training material used for these models has, until now, largely consisted of specialist biomedical content such as MIMIC-III clinical notes (Johnson et al., 2016) and PubMed papers (Sayers et al., 2021; Gao et al., 2020). While the resulting in-domain models have shown promising results for many biomedical tasks, adverse drug event normalization on social media texts has so far remained challenging for them (Portelli et al., 2022). In this paper, we propose a new approach for adverse drug event normalization on social media relying on general-purpose model initialization via BioLORD (Remy et al., 2022) and a semantic-text-similarity fine-tuning named STS. Our experimental results on several social media datasets demonstrate the effectiveness of our proposed approach, by achieving state-of-the-art performance. Based on",
    "link": "http://arxiv.org/abs/2308.00157",
    "context": "Title: Boosting Adverse Drug Event Normalization on Social Media: General-Purpose Model Initialization and Biomedical Semantic Text Similarity Benefit Zero-Shot Linking in Informal Contexts. (arXiv:2308.00157v1 [cs.CL])\nAbstract: Biomedical entity linking, also known as biomedical concept normalization, has recently witnessed the rise to prominence of zero-shot contrastive models. However, the pre-training material used for these models has, until now, largely consisted of specialist biomedical content such as MIMIC-III clinical notes (Johnson et al., 2016) and PubMed papers (Sayers et al., 2021; Gao et al., 2020). While the resulting in-domain models have shown promising results for many biomedical tasks, adverse drug event normalization on social media texts has so far remained challenging for them (Portelli et al., 2022). In this paper, we propose a new approach for adverse drug event normalization on social media relying on general-purpose model initialization via BioLORD (Remy et al., 2022) and a semantic-text-similarity fine-tuning named STS. Our experimental results on several social media datasets demonstrate the effectiveness of our proposed approach, by achieving state-of-the-art performance. Based on",
    "path": "papers/23/08/2308.00157.json",
    "total_tokens": 930,
    "translated_title": "在社交媒体上提升不良药物事件归一化：通用模型初始化和生物医学语义文本相似性在非正式环境中受益的零样例链接",
    "translated_abstract": "生物医学实体链接，也被称为生物医学概念归一化，最近出现了零样例对比模型的兴起。然而，直到现在，这些模型的预训练材料主要包括专门的生物医学内容，比如MIMIC-III临床笔记和PubMed论文。虽然产生的领域内模型在许多生物医学任务中已经显示出了有希望的结果，但社交媒体文本上的不良药物事件归一化仍然具有挑战性。在本文中，我们提出了一种新的方法，通过BioLORD的通用模型初始化和名为STS的语义文本相似性微调，对社交媒体上的不良药物事件归一化进行研究。我们在几个社交媒体数据集上的实验结果证明了我们提出的方法的有效性，达到了最先进的性能。",
    "tldr": "本论文提出了一种新的方法，通过通用模型初始化和语义文本相似性微调，在社交媒体上提升不良药物事件归一化的效果，并取得了最先进的性能。"
}