{
    "title": "Predictive Sparse Manifold Transform. (arXiv:2308.14207v1 [stat.ML])",
    "abstract": "We present Predictive Sparse Manifold Transform (PSMT), a minimalistic, interpretable and biologically plausible framework for learning and predicting natural dynamics. PSMT incorporates two layers where the first sparse coding layer represents the input sequence as sparse coefficients over an overcomplete dictionary and the second manifold learning layer learns a geometric embedding space that captures topological similarity and dynamic temporal linearity in sparse coefficients. We apply PSMT on a natural video dataset and evaluate the reconstruction performance with respect to contextual variability, the number of sparse coding basis functions and training samples. We then interpret the dynamic topological organization in the embedding space. We next utilize PSMT to predict future frames compared with two baseline methods with a static embedding space. We demonstrate that PSMT with a dynamic embedding space can achieve better prediction performance compared to static baselines. Our w",
    "link": "http://arxiv.org/abs/2308.14207",
    "context": "Title: Predictive Sparse Manifold Transform. (arXiv:2308.14207v1 [stat.ML])\nAbstract: We present Predictive Sparse Manifold Transform (PSMT), a minimalistic, interpretable and biologically plausible framework for learning and predicting natural dynamics. PSMT incorporates two layers where the first sparse coding layer represents the input sequence as sparse coefficients over an overcomplete dictionary and the second manifold learning layer learns a geometric embedding space that captures topological similarity and dynamic temporal linearity in sparse coefficients. We apply PSMT on a natural video dataset and evaluate the reconstruction performance with respect to contextual variability, the number of sparse coding basis functions and training samples. We then interpret the dynamic topological organization in the embedding space. We next utilize PSMT to predict future frames compared with two baseline methods with a static embedding space. We demonstrate that PSMT with a dynamic embedding space can achieve better prediction performance compared to static baselines. Our w",
    "path": "papers/23/08/2308.14207.json",
    "total_tokens": 851,
    "translated_title": "预测稀疏流形变换",
    "translated_abstract": "我们提出了预测稀疏流形变换（PSMT），这是一个简约、可解释且生物可行的框架，用于学习和预测自然动态。PSMT包含两个层次，第一个稀疏编码层将输入序列表示为过完备字典上的稀疏系数，第二个流形学习层学习一个几何嵌入空间，该空间捕捉了稀疏系数的拓扑相似性和动态时间线性。我们在自然视频数据集上应用PSMT，并通过上下文可变性、稀疏编码基函数的数量和训练样本进行重建性能评估。然后，我们解释了嵌入空间中的动态拓扑结构。接下来，我们利用PSMT与静态嵌入空间的两种基准方法进行未来帧的预测。我们证明了与静态基准方法相比，具有动态嵌入空间的PSMT可以实现更好的预测性能。",
    "tldr": "预测稀疏流形变换是一个简约、可解释且生物可行的框架，用于学习和预测自然动态。它通过稀疏编码和流形学习实现了更好的预测性能。"
}