{
    "title": "SAILOR: Structural Augmentation Based Tail Node Representation Learning. (arXiv:2308.06801v2 [cs.LG] UPDATED)",
    "abstract": "Graph Neural Networks (GNNs) have achieved state-of-the-art performance in representation learning for graphs recently. However, the effectiveness of GNNs, which capitalize on the key operation of message propagation, highly depends on the quality of the topology structure. Most of the graphs in real-world scenarios follow a long-tailed distribution on their node degrees, that is, a vast majority of the nodes in the graph are tail nodes with only a few connected edges. GNNs produce inferior node representations for tail nodes since they lack structural information. In the pursuit of promoting the expressiveness of GNNs for tail nodes, we explore how the deficiency of structural information deteriorates the performance of tail nodes and propose a general Structural Augmentation based taIL nOde Representation learning framework, dubbed as SAILOR, which can jointly learn to augment the graph structure and extract more informative representations for tail nodes. Extensive experiments on pu",
    "link": "http://arxiv.org/abs/2308.06801",
    "context": "Title: SAILOR: Structural Augmentation Based Tail Node Representation Learning. (arXiv:2308.06801v2 [cs.LG] UPDATED)\nAbstract: Graph Neural Networks (GNNs) have achieved state-of-the-art performance in representation learning for graphs recently. However, the effectiveness of GNNs, which capitalize on the key operation of message propagation, highly depends on the quality of the topology structure. Most of the graphs in real-world scenarios follow a long-tailed distribution on their node degrees, that is, a vast majority of the nodes in the graph are tail nodes with only a few connected edges. GNNs produce inferior node representations for tail nodes since they lack structural information. In the pursuit of promoting the expressiveness of GNNs for tail nodes, we explore how the deficiency of structural information deteriorates the performance of tail nodes and propose a general Structural Augmentation based taIL nOde Representation learning framework, dubbed as SAILOR, which can jointly learn to augment the graph structure and extract more informative representations for tail nodes. Extensive experiments on pu",
    "path": "papers/23/08/2308.06801.json",
    "total_tokens": 851,
    "translated_title": "SAILOR: 基于结构增强的尾节点表示学习",
    "translated_abstract": "近期，图神经网络（GNN）在图表示学习方面取得了最先进的性能。然而，GNN的有效性主要依赖于拓扑结构的质量，而大多数真实场景中的图节点度数呈现长尾分布，即图中大部分节点都是只有少数连接边的尾节点。由于缺乏结构信息，GNN对尾节点产生较差的节点表示。为了提升GNN对尾节点的表达能力，我们研究了结构信息不足如何恶化尾节点的性能，并提出了一种名为SAILOR的通用结构增强的尾节点表示学习框架，该框架可以同时学习增强图结构和提取更多有信息的尾节点表示。",
    "tldr": "SAILOR是一种基于结构增强的尾节点表示学习框架，针对真实场景中长尾分布的图节点度数，通过学习增强图结构和提取更有信息的尾节点表示，解决了GNN在尾节点表示上的性能退化问题。",
    "en_tdlr": "SAILOR is a framework for structural augmentation based tail node representation learning. It addresses the issue of performance degradation in graph neural networks (GNNs) for tail nodes by learning to enhance the graph structure and extract more informative representations for them, especially in real-world scenarios where nodes follow a long-tailed distribution in their degrees."
}