{
    "title": "A Satellite Imagery Dataset for Long-Term Sustainable Development in United States Cities. (arXiv:2308.00465v1 [cs.CV])",
    "abstract": "Cities play an important role in achieving sustainable development goals (SDGs) to promote economic growth and meet social needs. Especially satellite imagery is a potential data source for studying sustainable urban development. However, a comprehensive dataset in the United States (U.S.) covering multiple cities, multiple years, multiple scales, and multiple indicators for SDG monitoring is lacking. To support the research on SDGs in U.S. cities, we develop a satellite imagery dataset using deep learning models for five SDGs containing 25 sustainable development indicators. The proposed dataset covers the 100 most populated U.S. cities and corresponding Census Block Groups from 2014 to 2023. Specifically, we collect satellite imagery and identify objects with state-of-the-art object detection and semantic segmentation models to observe cities' bird's-eye view. We further gather population, nighttime light, survey, and built environment data to depict SDGs regarding poverty, health, e",
    "link": "http://arxiv.org/abs/2308.00465",
    "context": "Title: A Satellite Imagery Dataset for Long-Term Sustainable Development in United States Cities. (arXiv:2308.00465v1 [cs.CV])\nAbstract: Cities play an important role in achieving sustainable development goals (SDGs) to promote economic growth and meet social needs. Especially satellite imagery is a potential data source for studying sustainable urban development. However, a comprehensive dataset in the United States (U.S.) covering multiple cities, multiple years, multiple scales, and multiple indicators for SDG monitoring is lacking. To support the research on SDGs in U.S. cities, we develop a satellite imagery dataset using deep learning models for five SDGs containing 25 sustainable development indicators. The proposed dataset covers the 100 most populated U.S. cities and corresponding Census Block Groups from 2014 to 2023. Specifically, we collect satellite imagery and identify objects with state-of-the-art object detection and semantic segmentation models to observe cities' bird's-eye view. We further gather population, nighttime light, survey, and built environment data to depict SDGs regarding poverty, health, e",
    "path": "papers/23/08/2308.00465.json",
    "total_tokens": 956,
    "translated_title": "美国城市可持续发展的卫星图像数据集",
    "translated_abstract": "城市在实现可持续发展目标（SDG）和促进经济增长、满足社会需求方面起着重要作用。尤其是卫星图像是研究可持续城市发展的潜在数据源。然而，在美国缺乏一个涵盖多个城市、多年份、多尺度和多个SDG指标的综合数据集，用于监测SDG。为了支持对美国城市SDG的研究，我们使用深度学习模型开发了一个卫星图像数据集，包含25个可持续发展指标的五个SDG。所提出的数据集涵盖了美国人口最多的100个城市和相应的人口普查区块群，时间跨度为2014年至2023年。具体而言，我们收集卫星图像，并使用最先进的目标检测和语义分割模型识别城市的鸟瞰图。我们还收集了人口、夜间光线、调查和建筑环境数据，描述了与贫困、健康相关的SDG指标。",
    "tldr": "该论文开发了一个卫星图像数据集，覆盖了美国最多人口的100个城市以及相应的人口普查区块群，时间跨度为2014年至2023年。这个数据集可用于研究美国城市的可持续发展目标，特别是与贫困、健康相关的SDG指标。",
    "en_tdlr": "The paper presents a satellite imagery dataset covering the 100 most populated U.S. cities and corresponding Census Block Groups from 2014 to 2023. It can be used for studying sustainable development goals in U.S. cities, particularly the indicators related to poverty and health."
}