{
    "title": "Combining feature aggregation and geometric similarity for re-identification of patterned animals. (arXiv:2308.06335v1 [cs.CV])",
    "abstract": "Image-based re-identification of animal individuals allows gathering of information such as migration patterns of the animals over time. This, together with large image volumes collected using camera traps and crowdsourcing, opens novel possibilities to study animal populations. For many species, the re-identification can be done by analyzing the permanent fur, feather, or skin patterns that are unique to each individual. In this paper, we address the re-identification by combining two types of pattern similarity metrics: 1) pattern appearance similarity obtained by pattern feature aggregation and 2) geometric pattern similarity obtained by analyzing the geometric consistency of pattern similarities. The proposed combination allows to efficiently utilize both the local and global pattern features, providing a general re-identification approach that can be applied to a wide variety of different pattern types. In the experimental part of the work, we demonstrate that the method achieves ",
    "link": "http://arxiv.org/abs/2308.06335",
    "context": "Title: Combining feature aggregation and geometric similarity for re-identification of patterned animals. (arXiv:2308.06335v1 [cs.CV])\nAbstract: Image-based re-identification of animal individuals allows gathering of information such as migration patterns of the animals over time. This, together with large image volumes collected using camera traps and crowdsourcing, opens novel possibilities to study animal populations. For many species, the re-identification can be done by analyzing the permanent fur, feather, or skin patterns that are unique to each individual. In this paper, we address the re-identification by combining two types of pattern similarity metrics: 1) pattern appearance similarity obtained by pattern feature aggregation and 2) geometric pattern similarity obtained by analyzing the geometric consistency of pattern similarities. The proposed combination allows to efficiently utilize both the local and global pattern features, providing a general re-identification approach that can be applied to a wide variety of different pattern types. In the experimental part of the work, we demonstrate that the method achieves ",
    "path": "papers/23/08/2308.06335.json",
    "total_tokens": 876,
    "translated_title": "组合特征聚合和几何相似性用于图案动物的重新识别",
    "translated_abstract": "基于图像的动物个体重新识别可以获取动物随时间的迁徙模式等信息。这与使用相机陷阱和众包收集的大量图像卷打开了研究动物种群的新可能性。对于许多物种，可以通过分析每个个体独有的永久毛、羽毛或皮肤图案来进行重新识别。在本文中，我们通过组合两种类型的图案相似度度量来解决重新识别问题：1）通过图案特征聚合获得的图案外观相似度和2）通过分析图案相似度的几何一致性获得的几何图案相似度。所提出的组合方法可以有效地利用局部和全局图案特征，提供了一种通用的重新识别方法，可应用于各种不同的图案类型。在实验部分中，我们证明了该方法可以实现。",
    "tldr": "本文提出了一种组合特征聚合和几何相似性的方法，用于图案动物的重新识别。该方法利用图案的外观相似度和几何一致性来实现综合性的重新识别，可以适用于各种不同类型的图案。",
    "en_tdlr": "This paper proposes a method that combines feature aggregation and geometric similarity for re-identification of patterned animals. The method utilizes both the appearance similarity and the geometric consistency of patterns, providing a comprehensive approach that can be applied to various types of patterns."
}