{
    "title": "Detecting Inactive Cyberwarriors from Online Forums. (arXiv:2308.15491v1 [cs.SI])",
    "abstract": "The proliferation of misinformation has emerged as a new form of warfare in the information age. This type of warfare involves cyberwarriors, who deliberately propagate messages aimed at defaming opponents or fostering unity among allies. In this study, we investigate the level of activity exhibited by cyberwarriors within a large online forum, and remarkably, we discover that only a minute fraction of cyberwarriors are active users. Surprisingly, despite their expected role of actively disseminating misinformation, cyberwarriors remain predominantly silent during peacetime and only spring into action when necessary. Moreover, we analyze the challenges associated with identifying cyberwarriors and provide evidence that detecting inactive cyberwarriors is considerably more challenging than identifying their active counterparts. Finally, we discuss potential methodologies to more effectively identify cyberwarriors during their inactive phases, offering insights into better capturing thei",
    "link": "http://arxiv.org/abs/2308.15491",
    "context": "Title: Detecting Inactive Cyberwarriors from Online Forums. (arXiv:2308.15491v1 [cs.SI])\nAbstract: The proliferation of misinformation has emerged as a new form of warfare in the information age. This type of warfare involves cyberwarriors, who deliberately propagate messages aimed at defaming opponents or fostering unity among allies. In this study, we investigate the level of activity exhibited by cyberwarriors within a large online forum, and remarkably, we discover that only a minute fraction of cyberwarriors are active users. Surprisingly, despite their expected role of actively disseminating misinformation, cyberwarriors remain predominantly silent during peacetime and only spring into action when necessary. Moreover, we analyze the challenges associated with identifying cyberwarriors and provide evidence that detecting inactive cyberwarriors is considerably more challenging than identifying their active counterparts. Finally, we discuss potential methodologies to more effectively identify cyberwarriors during their inactive phases, offering insights into better capturing thei",
    "path": "papers/23/08/2308.15491.json",
    "total_tokens": 947,
    "translated_title": "从在线论坛中检测不活跃的网络战士",
    "translated_abstract": "在信息时代，虚假信息的传播成为一种新形式的战争。这种战争涉及到网络战士，他们有意传播旨在诽谤对手或团结盟友的信息。在这项研究中，我们调查了大型在线论坛中网络战士的活动水平，令人惊讶的是，我们发现只有少数网络战士是活跃用户。令人意外的是，尽管他们被期望积极传播虚假信息，在和平时期网络战士却保持沉默，只在必要时才行动起来。此外，我们分析了识别网络战士所面临的挑战，并提供证据表明检测不活跃的网络战士比识别活跃的网络战士要难得多。最后，我们讨论了更有效地在网络战士不活跃的阶段识别他们的潜在方法，为更好地捕捉他们的行动提供了洞察。",
    "tldr": "本研究调查了大型在线论坛中网络战士的活动水平，发现只有少数网络战士是活跃用户，他们在和平时期保持沉默，只在必要时行动。此外，检测不活跃的网络战士比识别活跃的网络战士更具挑战性。研究提供了更好捕捉网络战士行动的方法。",
    "en_tdlr": "This study investigates the activity level of cyberwarriors in online forums and finds that only a small fraction of them are active users. It also highlights the challenge of detecting inactive cyberwarriors compared to their active counterparts. The research offers insights into better identifying and capturing the actions of cyberwarriors during their inactive phases."
}