{
    "title": "Assistive Chatbots for healthcare: a succinct review. (arXiv:2308.04178v1 [cs.AI])",
    "abstract": "Artificial Intelligence (AI) for supporting healthcare services has never been more necessitated than by the recent global pandemic. Here, we review the state-of-the-art in AI-enabled Chatbots in healthcare proposed during the last 10 years (2013-2023). The focus on AI-enabled technology is because of its potential for enhancing the quality of human-machine interaction via Chatbots, reducing dependence on human-human interaction and saving man-hours. Our review indicates that there are a handful of (commercial) Chatbots that are being used for patient support, while there are others (non-commercial) that are in the clinical trial phases. However, there is a lack of trust on this technology regarding patient safety and data protection, as well as a lack of wider awareness on its benefits among the healthcare workers and professionals. Also, patients have expressed dissatisfaction with Natural Language Processing (NLP) skills of the Chatbots in comparison to humans. Notwithstanding the r",
    "link": "http://arxiv.org/abs/2308.04178",
    "context": "Title: Assistive Chatbots for healthcare: a succinct review. (arXiv:2308.04178v1 [cs.AI])\nAbstract: Artificial Intelligence (AI) for supporting healthcare services has never been more necessitated than by the recent global pandemic. Here, we review the state-of-the-art in AI-enabled Chatbots in healthcare proposed during the last 10 years (2013-2023). The focus on AI-enabled technology is because of its potential for enhancing the quality of human-machine interaction via Chatbots, reducing dependence on human-human interaction and saving man-hours. Our review indicates that there are a handful of (commercial) Chatbots that are being used for patient support, while there are others (non-commercial) that are in the clinical trial phases. However, there is a lack of trust on this technology regarding patient safety and data protection, as well as a lack of wider awareness on its benefits among the healthcare workers and professionals. Also, patients have expressed dissatisfaction with Natural Language Processing (NLP) skills of the Chatbots in comparison to humans. Notwithstanding the r",
    "path": "papers/23/08/2308.04178.json",
    "total_tokens": 928,
    "translated_title": "卫生保健辅助聊天机器人：一个简洁的综述",
    "translated_abstract": "人工智能在支持医疗服务方面的需求，从最近的全球大流行病来看，从未达到如此之高。在这里，我们回顾了过去10年（2013-2023年）提出的医疗保健人工智能聊天机器人的最新技术。对于人工智能技术的关注是因为它具有提高人机交互质量、减少对人际交互的依赖和节省人力的潜力。我们的综述表明，目前有一些（商业化的）聊天机器人正在被用于患者支持，同时还有一些（非商业化的）聊天机器人正在临床试验阶段。然而，关于这项技术在患者安全和数据保护方面缺乏信任，以及医护人员对其好处缺乏更广泛的认知。此外，患者在与人类相比，对聊天机器人的自然语言处理（NLP）技能表示不满。尽管如此，对于改善医疗服务和患者支持的潜力，辅助聊天机器人仍有许多待解决的问题。",
    "tldr": "医疗保健领域的辅助聊天机器人在过去10年取得了一些进展，但在患者信任和与人类交互能力方面仍存在挑战。",
    "en_tdlr": "Assistive chatbots in healthcare have made progress in the past decade, but still face challenges in gaining patient trust and improving interaction capabilities with humans."
}