{
    "title": "Constructive Incremental Learning for Fault Diagnosis of Rolling Bearings with Ensemble Domain Adaptation. (arXiv:2308.14983v1 [cs.AI])",
    "abstract": "Given the prevalence of rolling bearing fault diagnosis as a practical issue across various working conditions, the limited availability of samples compounds the challenge. Additionally, the complexity of the external environment and the structure of rolling bearings often manifests faults characterized by randomness and fuzziness, hindering the effective extraction of fault characteristics and restricting the accuracy of fault diagnosis. To overcome these problems, this paper presents a novel approach termed constructive Incremental learning-based ensemble domain adaptation (CIL-EDA) approach. Specifically, it is implemented on stochastic configuration networks (SCN) to constructively improve its adaptive performance in multi-domains. Concretely, a cloud feature extraction method is employed in conjunction with wavelet packet decomposition (WPD) to capture the uncertainty of fault information from multiple resolution aspects. Subsequently, constructive Incremental learning-based domai",
    "link": "http://arxiv.org/abs/2308.14983",
    "context": "Title: Constructive Incremental Learning for Fault Diagnosis of Rolling Bearings with Ensemble Domain Adaptation. (arXiv:2308.14983v1 [cs.AI])\nAbstract: Given the prevalence of rolling bearing fault diagnosis as a practical issue across various working conditions, the limited availability of samples compounds the challenge. Additionally, the complexity of the external environment and the structure of rolling bearings often manifests faults characterized by randomness and fuzziness, hindering the effective extraction of fault characteristics and restricting the accuracy of fault diagnosis. To overcome these problems, this paper presents a novel approach termed constructive Incremental learning-based ensemble domain adaptation (CIL-EDA) approach. Specifically, it is implemented on stochastic configuration networks (SCN) to constructively improve its adaptive performance in multi-domains. Concretely, a cloud feature extraction method is employed in conjunction with wavelet packet decomposition (WPD) to capture the uncertainty of fault information from multiple resolution aspects. Subsequently, constructive Incremental learning-based domai",
    "path": "papers/23/08/2308.14983.json",
    "total_tokens": 921,
    "translated_title": "基于增量构建学习和集成域适应的滚动轴承故障诊断",
    "translated_abstract": "鉴于滚动轴承故障诊断在各种工况下的实际问题普遍存在，样本的有限可用性增加了挑战。此外，外部环境的复杂性和滚动轴承的结构经常表现出具有随机性和模糊性的故障，从而阻碍了故障特征的有效提取，并限制了故障诊断的准确性。为了解决这些问题，本文提出了一种称为构造增量学习的集成域适应（CIL-EDA）方法。具体而言，它在随机配置网络（SCN）上实施，以在多个域中构建其自适应性能。具体地，采用云特征提取方法结合小波包分解（WPD）来捕捉来自多个分辨率方面的故障信息的不确定性。随后，采用增量构建学习的域适应方案。",
    "tldr": "本文提出了一种基于增量构建学习和集成域适应的方法，用于滚动轴承故障诊断。该方法通过在随机配置网络上实施增量学习，结合云特征提取和小波包分解，提高了故障诊断的准确性和适应性。",
    "en_tdlr": "This paper presents a novel approach called constructive Incremental learning-based ensemble domain adaptation (CIL-EDA) for fault diagnosis of rolling bearings. By implementing incremental learning on stochastic configuration networks (SCN) and combining cloud feature extraction with wavelet packet decomposition (WPD), the approach improves the accuracy and adaptability of fault diagnosis."
}