{
    "title": "Counterfactual Graph Augmentation for Consumer Unfairness Mitigation in Recommender Systems. (arXiv:2308.12083v1 [cs.IR])",
    "abstract": "In recommendation literature, explainability and fairness are becoming two prominent perspectives to consider. However, prior works have mostly addressed them separately, for instance by explaining to consumers why a certain item was recommended or mitigating disparate impacts in recommendation utility. None of them has leveraged explainability techniques to inform unfairness mitigation. In this paper, we propose an approach that relies on counterfactual explanations to augment the set of user-item interactions, such that using them while inferring recommendations leads to fairer outcomes. Modeling user-item interactions as a bipartite graph, our approach augments the latter by identifying new user-item edges that not only can explain the original unfairness by design, but can also mitigate it. Experiments on two public data sets show that our approach effectively leads to a better trade-off between fairness and recommendation utility compared with state-of-the-art mitigation procedure",
    "link": "http://arxiv.org/abs/2308.12083",
    "context": "Title: Counterfactual Graph Augmentation for Consumer Unfairness Mitigation in Recommender Systems. (arXiv:2308.12083v1 [cs.IR])\nAbstract: In recommendation literature, explainability and fairness are becoming two prominent perspectives to consider. However, prior works have mostly addressed them separately, for instance by explaining to consumers why a certain item was recommended or mitigating disparate impacts in recommendation utility. None of them has leveraged explainability techniques to inform unfairness mitigation. In this paper, we propose an approach that relies on counterfactual explanations to augment the set of user-item interactions, such that using them while inferring recommendations leads to fairer outcomes. Modeling user-item interactions as a bipartite graph, our approach augments the latter by identifying new user-item edges that not only can explain the original unfairness by design, but can also mitigate it. Experiments on two public data sets show that our approach effectively leads to a better trade-off between fairness and recommendation utility compared with state-of-the-art mitigation procedure",
    "path": "papers/23/08/2308.12083.json",
    "total_tokens": 848,
    "translated_title": "消费者不公平性在推荐系统中的对策：反事实图增强",
    "translated_abstract": "在推荐系统文献中，可解释性和公平性成为了两个重要的考虑角度。然而，先前的研究大多单独处理这两个问题，例如向消费者解释为什么推荐了某个物品或者减轻推荐效用中的差异影响。没有任何一项研究利用可解释性技术来提供关于不公平性的信息。本文提出了一种方法，利用反事实解释来增强用户-物品交互集合，以便在推荐过程中使用它们可以得到更公平的结果。通过将用户-物品交互建模为二分图，我们的方法通过识别新的用户-物品边来增强二分图，这些边不仅可以解释原来的不公平性，并且还可以减轻不公平性。通过在两个公共数据集上进行实验，我们的方法有效地在公平性和推荐效用之间找到了更好的平衡，超越了最先进的减轻过程。",
    "tldr": "本文提出了一种利用反事实解释来增强用户-物品交互集合的方法，以在推荐过程中实现更公平的结果。",
    "en_tdlr": "This paper proposes an approach that leverages counterfactual explanations to augment the set of user-item interactions, leading to fairer outcomes in the recommendation process."
}