{
    "title": "Freshness or Accuracy, Why Not Both? Addressing Delayed Feedback via Dynamic Graph Neural Networks. (arXiv:2308.08071v1 [cs.LG])",
    "abstract": "The delayed feedback problem is one of the most pressing challenges in predicting the conversion rate since users' conversions are always delayed in online commercial systems. Although new data are beneficial for continuous training, without complete feedback information, i.e., conversion labels, training algorithms may suffer from overwhelming fake negatives. Existing methods tend to use multitask learning or design data pipelines to solve the delayed feedback problem. However, these methods have a trade-off between data freshness and label accuracy. In this paper, we propose Delayed Feedback Modeling by Dynamic Graph Neural Network (DGDFEM). It includes three stages, i.e., preparing a data pipeline, building a dynamic graph, and training a CVR prediction model. In the model training, we propose a novel graph convolutional method named HLGCN, which leverages both high-pass and low-pass filters to deal with conversion and non-conversion relationships. The proposed method achieves both ",
    "link": "http://arxiv.org/abs/2308.08071",
    "context": "Title: Freshness or Accuracy, Why Not Both? Addressing Delayed Feedback via Dynamic Graph Neural Networks. (arXiv:2308.08071v1 [cs.LG])\nAbstract: The delayed feedback problem is one of the most pressing challenges in predicting the conversion rate since users' conversions are always delayed in online commercial systems. Although new data are beneficial for continuous training, without complete feedback information, i.e., conversion labels, training algorithms may suffer from overwhelming fake negatives. Existing methods tend to use multitask learning or design data pipelines to solve the delayed feedback problem. However, these methods have a trade-off between data freshness and label accuracy. In this paper, we propose Delayed Feedback Modeling by Dynamic Graph Neural Network (DGDFEM). It includes three stages, i.e., preparing a data pipeline, building a dynamic graph, and training a CVR prediction model. In the model training, we propose a novel graph convolutional method named HLGCN, which leverages both high-pass and low-pass filters to deal with conversion and non-conversion relationships. The proposed method achieves both ",
    "path": "papers/23/08/2308.08071.json",
    "total_tokens": 899,
    "translated_title": "鲜度或准确性，为什么不能两者兼得？通过动态图神经网络解决延迟反馈问题",
    "translated_abstract": "在在线商业系统中，延迟反馈问题是预测转化率面临的最紧迫挑战之一，因为用户的转化总是延迟发生。虽然新数据有益于持续训练，但是没有完整的反馈信息，即转化标签，训练算法可能会遭受大量的假负面影响。现有方法往往使用多任务学习或设计数据流程来解决延迟反馈问题。然而，这些方法在数据新鲜度和标签准确性之间存在一个折中。在本文中，我们提出了通过动态图神经网络进行延迟反馈建模 （DGDFEM）。它包括三个阶段，即准备数据流程、构建动态图以及训练CVR预测模型。在模型训练中，我们提出了一种名为HLGCN的新颖图卷积方法，它利用高通和低通滤波器来处理转化和非转化关系。所提出的方法实现了数据新鲜度和标签准确性的双重要求。",
    "tldr": "本论文提出了一种通过动态图神经网络解决延迟反馈问题的方法，该方法在数据新鲜度和标签准确性之间取得了平衡。",
    "en_tdlr": "This paper proposes a method using dynamic graph neural networks to address the problem of delayed feedback, achieving a balance between data freshness and label accuracy."
}