{
    "title": "Learning beyond sensations: how dreams organize neuronal representations. (arXiv:2308.01830v1 [q-bio.NC])",
    "abstract": "Semantic representations in higher sensory cortices form the basis for robust, yet flexible behavior. These representations are acquired over the course of development in an unsupervised fashion and continuously maintained over an organism's lifespan. Predictive learning theories propose that these representations emerge from predicting or reconstructing sensory inputs. However, brains are known to generate virtual experiences, such as during imagination and dreaming, that go beyond previously experienced inputs. Here, we suggest that virtual experiences may be just as relevant as actual sensory inputs in shaping cortical representations.In particular, we discuss two complementary learning principles that organize representations through the generation of virtual experiences. First, \"adversarial dreaming\" proposes that creative dreams support a cortical implementation of adversarial learning in which feedback and feedforward pathways engage in a productive game of trying to fool each o",
    "link": "http://arxiv.org/abs/2308.01830",
    "context": "Title: Learning beyond sensations: how dreams organize neuronal representations. (arXiv:2308.01830v1 [q-bio.NC])\nAbstract: Semantic representations in higher sensory cortices form the basis for robust, yet flexible behavior. These representations are acquired over the course of development in an unsupervised fashion and continuously maintained over an organism's lifespan. Predictive learning theories propose that these representations emerge from predicting or reconstructing sensory inputs. However, brains are known to generate virtual experiences, such as during imagination and dreaming, that go beyond previously experienced inputs. Here, we suggest that virtual experiences may be just as relevant as actual sensory inputs in shaping cortical representations.In particular, we discuss two complementary learning principles that organize representations through the generation of virtual experiences. First, \"adversarial dreaming\" proposes that creative dreams support a cortical implementation of adversarial learning in which feedback and feedforward pathways engage in a productive game of trying to fool each o",
    "path": "papers/23/08/2308.01830.json",
    "total_tokens": 845,
    "translated_title": "超越感觉的学习: 梦如何组织神经表示",
    "translated_abstract": "高级感觉皮层中的语义表示是稳健而灵活行为的基础。这些表示是在发育过程中以无监督的方式获得的，并在生物的整个生命周期中持续维持。预测性学习理论认为，这些表示是通过预测或重建感觉输入而产生的。然而，众所周知，大脑会产生虚拟经验，例如在想象和梦境中，超越先前经历的输入。在这里，我们提出虚拟经验可能与实际感觉输入同样重要，能够塑造皮层表示。特别是，我们讨论了通过生成虚拟经验来组织表示的两个互补学习原则。首先，“对抗性梦想”提出创造性梦想支持了在皮层中实现对抗性学习，其中反馈和前馈路径参与到相互欺骗的有益游戏中。",
    "tldr": "梦境和想象不仅仅是感觉输入的再现，它们对于塑造大脑皮层的语义表示同样重要，可以通过生成虚拟经验来影响和组织这些表示。"
}