{
    "title": "T-Fusion Net: A Novel Deep Neural Network Augmented with Multiple Localizations based Spatial Attention Mechanisms for Covid-19 Detection. (arXiv:2308.00053v1 [eess.IV])",
    "abstract": "In recent years, deep neural networks are yielding better performance in image classification tasks. However, the increasing complexity of datasets and the demand for improved performance necessitate the exploration of innovative techniques. The present work proposes a new deep neural network (called as, T-Fusion Net) that augments multiple localizations based spatial attention. This attention mechanism allows the network to focus on relevant image regions, improving its discriminative power. A homogeneous ensemble of the said network is further used to enhance image classification accuracy. For ensembling, the proposed approach considers multiple instances of individual T-Fusion Net. The model incorporates fuzzy max fusion to merge the outputs of individual nets. The fusion process is optimized through a carefully chosen parameter to strike a balance on the contributions of the individual models. Experimental evaluations on benchmark Covid-19 (SARS-CoV-2 CT scan) dataset demonstrate t",
    "link": "http://arxiv.org/abs/2308.00053",
    "context": "Title: T-Fusion Net: A Novel Deep Neural Network Augmented with Multiple Localizations based Spatial Attention Mechanisms for Covid-19 Detection. (arXiv:2308.00053v1 [eess.IV])\nAbstract: In recent years, deep neural networks are yielding better performance in image classification tasks. However, the increasing complexity of datasets and the demand for improved performance necessitate the exploration of innovative techniques. The present work proposes a new deep neural network (called as, T-Fusion Net) that augments multiple localizations based spatial attention. This attention mechanism allows the network to focus on relevant image regions, improving its discriminative power. A homogeneous ensemble of the said network is further used to enhance image classification accuracy. For ensembling, the proposed approach considers multiple instances of individual T-Fusion Net. The model incorporates fuzzy max fusion to merge the outputs of individual nets. The fusion process is optimized through a carefully chosen parameter to strike a balance on the contributions of the individual models. Experimental evaluations on benchmark Covid-19 (SARS-CoV-2 CT scan) dataset demonstrate t",
    "path": "papers/23/08/2308.00053.json",
    "total_tokens": 929,
    "translated_title": "T-Fusion Net：一种新颖的深度神经网络，基于多个定位的空间注意机制用于Covid-19检测",
    "translated_abstract": "最近几年，深度神经网络在图像分类任务中表现出更好的性能。然而，数据集的不断复杂化和对改进性能的需求需要探索创新技术。本研究提出了一种新的深度神经网络（称为T-Fusion Net），它增强了基于多个定位的空间注意机制。这种注意机制使得网络能够专注于相关的图像区域，提高其判别能力。进一步使用这种网络的均质模型来提高图像分类准确性。对于合并，提出的方法考虑了每个T-Fusion Net个体的多个实例。模型通过模糊最大融合来合并个体网络的输出。融合过程通过精心选择的参数进行优化，以在个体模型的贡献方面取得平衡。在基准Covid-19（SARS-CoV-2 CT扫描）数据集上的实验评估结果表明...（未完待续）",
    "tldr": "T-Fusion Net是一种新颖的深度神经网络，通过多个定位的空间注意机制提高了图像分类的性能。通过使用模糊最大融合的方法合并多个模型的输出，进一步提高了准确性。实验结果表明在Covid-19数据集上取得了良好的效果。",
    "en_tdlr": "T-Fusion Net is a novel deep neural network that improves image classification performance through multiple localization-based spatial attention mechanisms. By merging the outputs of multiple models using fuzzy max fusion, accuracy is further enhanced. Experimental results demonstrate good performance on the Covid-19 dataset."
}