{
    "title": "Patient-specific, mechanistic models of tumor growth incorporating artificial intelligence and big data. (arXiv:2308.14925v1 [physics.med-ph])",
    "abstract": "Despite the remarkable advances in cancer diagnosis, treatment, and management that have occurred over the past decade, malignant tumors remain a major public health problem. Further progress in combating cancer may be enabled by personalizing the delivery of therapies according to the predicted response for each individual patient. The design of personalized therapies requires patient-specific information integrated into an appropriate mathematical model of tumor response. A fundamental barrier to realizing this paradigm is the current lack of a rigorous, yet practical, mathematical theory of tumor initiation, development, invasion, and response to therapy. In this review, we begin by providing an overview of different approaches to modeling tumor growth and treatment, including mechanistic as well as data-driven models based on ``big data\" and artificial intelligence. Next, we present illustrative examples of mathematical models manifesting their utility and discussing the limitation",
    "link": "http://arxiv.org/abs/2308.14925",
    "context": "Title: Patient-specific, mechanistic models of tumor growth incorporating artificial intelligence and big data. (arXiv:2308.14925v1 [physics.med-ph])\nAbstract: Despite the remarkable advances in cancer diagnosis, treatment, and management that have occurred over the past decade, malignant tumors remain a major public health problem. Further progress in combating cancer may be enabled by personalizing the delivery of therapies according to the predicted response for each individual patient. The design of personalized therapies requires patient-specific information integrated into an appropriate mathematical model of tumor response. A fundamental barrier to realizing this paradigm is the current lack of a rigorous, yet practical, mathematical theory of tumor initiation, development, invasion, and response to therapy. In this review, we begin by providing an overview of different approaches to modeling tumor growth and treatment, including mechanistic as well as data-driven models based on ``big data\" and artificial intelligence. Next, we present illustrative examples of mathematical models manifesting their utility and discussing the limitation",
    "path": "papers/23/08/2308.14925.json",
    "total_tokens": 886,
    "translated_title": "患者特异性的机械模型结合人工智能和大数据的肿瘤生长",
    "translated_abstract": "尽管过去十年中癌症诊断、治疗和管理取得了显著进展，但恶性肿瘤仍然是一个重大的公共健康问题。个性化治疗的进一步发展可能通过根据每个患者的预测反应来个性化治疗的方式实现。个性化治疗的设计需要将患者特异性的信息整合到适当的肿瘤反应的数学模型中。实现这一范 Paradigm的一个基本障碍是目前缺乏严格但实用的肿瘤发生、发展、侵袭和治疗反应的数学理论。在本文中，我们首先概述了不同的肿瘤生长和治疗模型的方法，包括基于“大数据”和人工智能的机械模型以及数据驱动模型。接着，我们提供了数学模型的实例，展示了它们的实用性并讨论了其局限性。",
    "tldr": "本文综述了肿瘤生长和治疗模型的不同方法，包括基于“大数据”和人工智能的机械模型以及数据驱动模型。同时指出了当前肿瘤研究中存在的问题和局限性。"
}