{
    "title": "CSPM: A Contrastive Spatiotemporal Preference Model for CTR Prediction in On-Demand Food Delivery Services. (arXiv:2308.08446v1 [cs.IR])",
    "abstract": "Click-through rate (CTR) prediction is a crucial task in the context of an online on-demand food delivery (OFD) platform for precisely estimating the probability of a user clicking on food items. Unlike universal e-commerce platforms such as Taobao and Amazon, user behaviors and interests on the OFD platform are more location and time-sensitive due to limited delivery ranges and regional commodity supplies. However, existing CTR prediction algorithms in OFD scenarios concentrate on capturing interest from historical behavior sequences, which fails to effectively model the complex spatiotemporal information within features, leading to poor performance. To address this challenge, this paper introduces the Contrastive Sres under different search states using three modules: contrastive spatiotemporal representation learning (CSRL), spatiotemporal preference extractor (StPE), and spatiotemporal information filter (StIF). CSRL utilizes a contrastive learning framework to generate a spatiotem",
    "link": "http://arxiv.org/abs/2308.08446",
    "context": "Title: CSPM: A Contrastive Spatiotemporal Preference Model for CTR Prediction in On-Demand Food Delivery Services. (arXiv:2308.08446v1 [cs.IR])\nAbstract: Click-through rate (CTR) prediction is a crucial task in the context of an online on-demand food delivery (OFD) platform for precisely estimating the probability of a user clicking on food items. Unlike universal e-commerce platforms such as Taobao and Amazon, user behaviors and interests on the OFD platform are more location and time-sensitive due to limited delivery ranges and regional commodity supplies. However, existing CTR prediction algorithms in OFD scenarios concentrate on capturing interest from historical behavior sequences, which fails to effectively model the complex spatiotemporal information within features, leading to poor performance. To address this challenge, this paper introduces the Contrastive Sres under different search states using three modules: contrastive spatiotemporal representation learning (CSRL), spatiotemporal preference extractor (StPE), and spatiotemporal information filter (StIF). CSRL utilizes a contrastive learning framework to generate a spatiotem",
    "path": "papers/23/08/2308.08446.json",
    "total_tokens": 872,
    "translated_title": "CSPM: 用于按需食品配送CTR预测的对比时空偏好模型",
    "translated_abstract": "点击率（CTR）预测是在线按需食品配送（OFD）平台中一项关键任务，用于准确估计用户点击食品项目的概率。与淘宝和亚马逊等通用电商平台不同，OFD平台上的用户行为和兴趣更加与地点和时间相关，这是因为存在有限的配送范围和区域商品供应。然而，现有的OFD场景下的CTR预测算法主要集中于捕捉来自历史行为序列的兴趣，未能有效地对特征中的复杂时空信息进行建模，导致性能较差。为解决这一挑战，本文提出了对比时空偏好模型（CSPM），通过对比时空表示学习（CSRL）、时空偏好提取器（StPE）和时空信息过滤器（StIF）三个模块，对不同搜索状态下的用户偏好进行建模。",
    "tldr": "本研究提出了CSPM模型，通过对比学习和时空偏好提取来解决按需食品配送CTR预测中的时空信息建模问题。"
}