{
    "title": "GraphCC: A Practical Graph Learning-based Approach to Congestion Control in Datacenters. (arXiv:2308.04905v1 [cs.NI])",
    "abstract": "Congestion Control (CC) plays a fundamental role in optimizing traffic in Data Center Networks (DCN). Currently, DCNs mainly implement two main CC protocols: DCTCP and DCQCN. Both protocols -- and their main variants -- are based on Explicit Congestion Notification (ECN), where intermediate switches mark packets when they detect congestion. The ECN configuration is thus a crucial aspect on the performance of CC protocols. Nowadays, network experts set static ECN parameters carefully selected to optimize the average network performance. However, today's high-speed DCNs experience quick and abrupt changes that severely change the network state (e.g., dynamic traffic workloads, incast events, failures). This leads to under-utilization and sub-optimal performance. This paper presents GraphCC, a novel Machine Learning-based framework for in-network CC optimization. Our distributed solution relies on a novel combination of Multi-agent Reinforcement Learning (MARL) and Graph Neural Networks (",
    "link": "http://arxiv.org/abs/2308.04905",
    "context": "Title: GraphCC: A Practical Graph Learning-based Approach to Congestion Control in Datacenters. (arXiv:2308.04905v1 [cs.NI])\nAbstract: Congestion Control (CC) plays a fundamental role in optimizing traffic in Data Center Networks (DCN). Currently, DCNs mainly implement two main CC protocols: DCTCP and DCQCN. Both protocols -- and their main variants -- are based on Explicit Congestion Notification (ECN), where intermediate switches mark packets when they detect congestion. The ECN configuration is thus a crucial aspect on the performance of CC protocols. Nowadays, network experts set static ECN parameters carefully selected to optimize the average network performance. However, today's high-speed DCNs experience quick and abrupt changes that severely change the network state (e.g., dynamic traffic workloads, incast events, failures). This leads to under-utilization and sub-optimal performance. This paper presents GraphCC, a novel Machine Learning-based framework for in-network CC optimization. Our distributed solution relies on a novel combination of Multi-agent Reinforcement Learning (MARL) and Graph Neural Networks (",
    "path": "papers/23/08/2308.04905.json",
    "total_tokens": 921,
    "translated_title": "GraphCC: 数据中心拥塞控制的实用图学习方法",
    "translated_abstract": "拥塞控制（CC）在优化数据中心网络（DCN）中的流量方面起着基础作用。目前，DCN主要实现了两种主要的CC协议：DCTCP和DCQCN。这两个协议及其主要变体都基于显式拥塞通知（ECN），其中中间交换机在检测到拥塞时标记数据包。ECN配置因此成为CC协议性能的关键因素。现在，网络专家设定静态ECN参数，精心选择以优化网络的平均性能。然而，现今的高速DCN经历快速和突然的变化，严重改变了网络状态（例如，动态流量工作负载，incast事件，故障）。这导致了低效利用和次优性能。本文提出了一种名为GraphCC的新颖的基于机器学习的网络内CC优化框架。我们的分布式解决方案依赖于多智能体强化学习（MARL）和图神经网络。",
    "tldr": "本论文提出了一种名为GraphCC的实用图学习方法，用于优化数据中心的拥塞控制。通过结合多智能体强化学习（MARL）和图神经网络，该方法能够适应快速和突然的网络状态变化，并提高网络的性能。"
}