{
    "title": "SHIELD: Sustainable Hybrid Evolutionary Learning Framework for Carbon, Wastewater, and Energy-Aware Data Center Management. (arXiv:2308.13086v1 [cs.DC])",
    "abstract": "Today's cloud data centers are often distributed geographically to provide robust data services. But these geo-distributed data centers (GDDCs) have a significant associated environmental impact due to their increasing carbon emissions and water usage, which needs to be curtailed. Moreover, the energy costs of operating these data centers continue to rise. This paper proposes a novel framework to co-optimize carbon emissions, water footprint, and energy costs of GDDCs, using a hybrid workload management framework called SHIELD that integrates machine learning guided local search with a decomposition-based evolutionary algorithm. Our framework considers geographical factors and time-based differences in power generation/use, costs, and environmental impacts to intelligently manage workload distribution across GDDCs and data center operation. Experimental results show that SHIELD can realize 34.4x speedup and 2.1x improvement in Pareto Hypervolume while reducing the carbon footprint by u",
    "link": "http://arxiv.org/abs/2308.13086",
    "context": "Title: SHIELD: Sustainable Hybrid Evolutionary Learning Framework for Carbon, Wastewater, and Energy-Aware Data Center Management. (arXiv:2308.13086v1 [cs.DC])\nAbstract: Today's cloud data centers are often distributed geographically to provide robust data services. But these geo-distributed data centers (GDDCs) have a significant associated environmental impact due to their increasing carbon emissions and water usage, which needs to be curtailed. Moreover, the energy costs of operating these data centers continue to rise. This paper proposes a novel framework to co-optimize carbon emissions, water footprint, and energy costs of GDDCs, using a hybrid workload management framework called SHIELD that integrates machine learning guided local search with a decomposition-based evolutionary algorithm. Our framework considers geographical factors and time-based differences in power generation/use, costs, and environmental impacts to intelligently manage workload distribution across GDDCs and data center operation. Experimental results show that SHIELD can realize 34.4x speedup and 2.1x improvement in Pareto Hypervolume while reducing the carbon footprint by u",
    "path": "papers/23/08/2308.13086.json",
    "total_tokens": 973,
    "translated_title": "SHIELD: 可持续混合进化学习框架用于碳，废水和能源感知的数据中心管理",
    "translated_abstract": "当今的云数据中心通常分布在地理上，以提供强大的数据服务。但是，这些地理分布的数据中心（GDDC）由于不断增加的碳排放和水使用量而对环境产生重大影响，需要加以控制。此外，操作这些数据中心的能源成本不断上升。本文提出了一种新颖的框架，使用称为SHIELD的混合工作负载管理框架，通过将机器学习引导的局部搜索与基于分解的进化算法相结合，来协同优化GDDC的碳排放量，水足迹和能源成本。我们的框架考虑了地理因素和时间差异对功率生成/使用成本和环境影响的影响，以智能地管理GDDC和数据中心的工作负载分配。实验结果表明，SHIELD可以实现34.4倍的加速和2.1倍的帕累托超体积改进，在减少碳足迹的同时，实现了速度和效率的提升。",
    "tldr": "这项研究提出了一种名为SHIELD的混合学习框架，用于数据中心管理，旨在优化碳排放、水足迹和能源成本。通过整合机器学习引导的局部搜索和分解式进化算法，该框架可以智能地管理工作负载分配，实现较高的效率和速度。",
    "en_tdlr": "This study introduces a hybrid learning framework called SHIELD, which aims to optimize carbon emissions, water footprint, and energy costs in data center management. By integrating machine learning guided local search and decomposition-based evolutionary algorithm, the framework enables intelligent workload distribution, leading to improved efficiency and speed."
}