{
    "title": "Solving Witness-type Triangle Puzzles Faster with an Automatically Learned Human-Explainable Predicate. (arXiv:2308.02666v1 [cs.AI])",
    "abstract": "Automatically solving puzzle instances in the game The Witness can guide players toward solutions and help puzzle designers generate better puzzles. In the latter case such an Artificial Intelligence puzzle solver can inform a human puzzle designer and procedural puzzle generator to produce better instances. The puzzles, however, are combinatorially difficult and search-based solvers can require large amounts of time and memory. We accelerate such search by automatically learning a human-explainable predicate that predicts whether a partial path to a Witness-type puzzle is not completable to a solution path. We prove a key property of the learned predicate which allows us to use it for pruning successor states in search thereby accelerating search by an average of six times while maintaining completeness of the underlying search. Conversely given a fixed search time budget per puzzle our predicate-accelerated search can solve more puzzle instances of larger sizes than the baseline sear",
    "link": "http://arxiv.org/abs/2308.02666",
    "context": "Title: Solving Witness-type Triangle Puzzles Faster with an Automatically Learned Human-Explainable Predicate. (arXiv:2308.02666v1 [cs.AI])\nAbstract: Automatically solving puzzle instances in the game The Witness can guide players toward solutions and help puzzle designers generate better puzzles. In the latter case such an Artificial Intelligence puzzle solver can inform a human puzzle designer and procedural puzzle generator to produce better instances. The puzzles, however, are combinatorially difficult and search-based solvers can require large amounts of time and memory. We accelerate such search by automatically learning a human-explainable predicate that predicts whether a partial path to a Witness-type puzzle is not completable to a solution path. We prove a key property of the learned predicate which allows us to use it for pruning successor states in search thereby accelerating search by an average of six times while maintaining completeness of the underlying search. Conversely given a fixed search time budget per puzzle our predicate-accelerated search can solve more puzzle instances of larger sizes than the baseline sear",
    "path": "papers/23/08/2308.02666.json",
    "total_tokens": 780,
    "translated_title": "用自动学习的可解释人类谓词更快解决见证型三角谜题",
    "translated_abstract": "自动解决游戏《见证人》中的谜题实例可以指导玩家找到解决方案，并帮助谜题设计者生成更好的谜题。然而，这些谜题在组合上很难，并且基于搜索的求解器可能需要大量的时间和内存。我们通过自动学习一个可解释的人类谓词，加速搜索，预测不可完成到解决路径的部分路径，从而提升搜索效率。相较于基准搜索，平均加速六倍，同时保持搜索的完整性。对于给定的每个谜题的固定搜索时间预算，使用谓词加速的搜索能够解决更大规模的谜题实例。",
    "tldr": "使用自动学习的人类可解释谓词加速搜索，解决《见证人》游戏中的谜题实例，比基准搜索提升六倍速度，且能处理更大规模的谜题。",
    "en_tdlr": "Solve puzzle instances in The Witness game faster by using an automatically learned human-explainable predicate, which accelerates search by six times compared to baseline search and can handle larger puzzle instances."
}