{
    "title": "Storyfier: Exploring Vocabulary Learning Support with Text Generation Models. (arXiv:2308.03864v1 [cs.HC])",
    "abstract": "Vocabulary learning support tools have widely exploited existing materials, e.g., stories or video clips, as contexts to help users memorize each target word. However, these tools could not provide a coherent context for any target words of learners' interests, and they seldom help practice word usage. In this paper, we work with teachers and students to iteratively develop Storyfier, which leverages text generation models to enable learners to read a generated story that covers any target words, conduct a story cloze test, and use these words to write a new story with adaptive AI assistance. Our within-subjects study (N=28) shows that learners generally favor the generated stories for connecting target words and writing assistance for easing their learning workload. However, in the read-cloze-write learning sessions, participants using Storyfier perform worse in recalling and using target words than learning with a baseline tool without our AI features. We discuss insights into suppor",
    "link": "http://arxiv.org/abs/2308.03864",
    "context": "Title: Storyfier: Exploring Vocabulary Learning Support with Text Generation Models. (arXiv:2308.03864v1 [cs.HC])\nAbstract: Vocabulary learning support tools have widely exploited existing materials, e.g., stories or video clips, as contexts to help users memorize each target word. However, these tools could not provide a coherent context for any target words of learners' interests, and they seldom help practice word usage. In this paper, we work with teachers and students to iteratively develop Storyfier, which leverages text generation models to enable learners to read a generated story that covers any target words, conduct a story cloze test, and use these words to write a new story with adaptive AI assistance. Our within-subjects study (N=28) shows that learners generally favor the generated stories for connecting target words and writing assistance for easing their learning workload. However, in the read-cloze-write learning sessions, participants using Storyfier perform worse in recalling and using target words than learning with a baseline tool without our AI features. We discuss insights into suppor",
    "path": "papers/23/08/2308.03864.json",
    "total_tokens": 968,
    "translated_title": "Storyfier: 使用文本生成模型探索词汇学习支持",
    "translated_abstract": "词汇学习支持工具广泛利用现有材料，如故事或视频片段，作为帮助用户记忆每个目标单词的上下文。然而，这些工具无法为学习者感兴趣的任何目标词提供连贯的上下文，并且它们很少帮助实践单词的使用。在本文中，我们与教师和学生合作，迭代地开发了Storyfier，它利用文本生成模型使学习者能够阅读覆盖任何目标词的生成故事，进行故事克隆测试，并使用这些单词撰写一个适应性人工智能辅助的新故事。我们的被试研究（N = 28）显示，学习者普遍喜欢生成的故事，因为它们可以连接目标词并减轻学习负担。然而，在阅读-克隆-写学习会话中，使用Storyfier的参与者在回忆和使用目标词方面表现不如基线工具（不含我们的人工智能特性）。我们讨论了对支持词汇学习的洞察。",
    "tldr": "Storyfier利用文本生成模型为学习者提供了有助于记忆词汇的生成故事，并提供适应性的AI辅助撰写新故事。然而，在实验中，使用Storyfier的学习者在回忆和使用目标词方面表现较差。",
    "en_tdlr": "Storyfier leverages text generation models to provide learners with generated stories that facilitate vocabulary memorization and adaptive AI assistance in writing new stories. However, in the experiment, learners using Storyfier performed worse in recalling and using target words."
}