{
    "title": "Disease Insight through Digital Biomarkers Developed by Remotely Collected Wearables and Smartphone Data. (arXiv:2308.02043v1 [cs.CY])",
    "abstract": "Digital Biomarkers and remote patient monitoring can provide valuable and timely insights into how a patient is coping with their condition (disease progression, treatment response, etc.), complementing treatment in traditional healthcare settings.Smartphones with embedded and connected sensors have immense potential for improving healthcare through various apps and mHealth (mobile health) platforms. This capability could enable the development of reliable digital biomarkers from long-term longitudinal data collected remotely from patients. We built an open-source platform, RADAR-base, to support large-scale data collection in remote monitoring studies. RADAR-base is a modern remote data collection platform built around Confluent's Apache Kafka, to support scalability, extensibility, security, privacy and quality of data. It provides support for study design and set-up, active (eg PROMs) and passive (eg. phone sensors, wearable devices and IoT) remote data collection capabilities with ",
    "link": "http://arxiv.org/abs/2308.02043",
    "context": "Title: Disease Insight through Digital Biomarkers Developed by Remotely Collected Wearables and Smartphone Data. (arXiv:2308.02043v1 [cs.CY])\nAbstract: Digital Biomarkers and remote patient monitoring can provide valuable and timely insights into how a patient is coping with their condition (disease progression, treatment response, etc.), complementing treatment in traditional healthcare settings.Smartphones with embedded and connected sensors have immense potential for improving healthcare through various apps and mHealth (mobile health) platforms. This capability could enable the development of reliable digital biomarkers from long-term longitudinal data collected remotely from patients. We built an open-source platform, RADAR-base, to support large-scale data collection in remote monitoring studies. RADAR-base is a modern remote data collection platform built around Confluent's Apache Kafka, to support scalability, extensibility, security, privacy and quality of data. It provides support for study design and set-up, active (eg PROMs) and passive (eg. phone sensors, wearable devices and IoT) remote data collection capabilities with ",
    "path": "papers/23/08/2308.02043.json",
    "total_tokens": 919,
    "translated_title": "通过远程收集穿戴设备和智能手机数据开发的数字生物标志物对疾病的洞察力",
    "translated_abstract": "数字生物标志物和远程患者监测可以及时提供有价值的见解，了解患者应对病情（疾病进展、治疗反应等）的情况，以补充传统医疗环境中的治疗。嵌入和连接传感器的智能手机通过各种应用和移动健康（mHealth）平台具有巨大的改进医疗保健的潜力。这种能力可以通过远程收集患者的长期纵向数据来开发可靠的数字生物标志物。我们构建了一个开源平台RADAR-base，以支持远程监测研究中的大规模数据收集。RADAR-base是一个现代化的远程数据收集平台，基于Confluent的Apache Kafka构建，支持可扩展性、可拓展性、安全性、隐私性和数据质量。它提供了研究设计和设置、主动（如患者报告的测量）和被动（如手机传感器、可穿戴设备和物联网）远程数据收集能力。",
    "tldr": "通过远程收集患者数据，利用数字生物标志物和远程监测技术可以提供有价值的疾病洞察力，从而补充传统医疗环境中的治疗方法。",
    "en_tdlr": "Valuable insights into diseases can be gained through the use of digital biomarkers and remote patient monitoring, complementing traditional healthcare treatments."
}