{
    "title": "Toward Optimized VR/AR Ergonomics: Modeling and Predicting User Neck Muscle Contraction. (arXiv:2308.14841v1 [cs.HC])",
    "abstract": "Ergonomic efficiency is essential to the mass and prolonged adoption of VR/AR experiences. While VR/AR head-mounted displays unlock users' natural wide-range head movements during viewing, their neck muscle comfort is inevitably compromised by the added hardware weight. Unfortunately, little quantitative knowledge for understanding and addressing such an issue is available so far.  Leveraging electromyography devices, we measure, model, and predict VR users' neck muscle contraction levels (MCL) while they move their heads to interact with the virtual environment. Specifically, by learning from collected physiological data, we develop a bio-physically inspired computational model to predict neck MCL under diverse head kinematic states. Beyond quantifying the cumulative MCL of completed head movements, our model can also predict potential MCL requirements with target head poses only. A series of objective evaluations and user studies demonstrate its prediction accuracy and generality, as",
    "link": "http://arxiv.org/abs/2308.14841",
    "context": "Title: Toward Optimized VR/AR Ergonomics: Modeling and Predicting User Neck Muscle Contraction. (arXiv:2308.14841v1 [cs.HC])\nAbstract: Ergonomic efficiency is essential to the mass and prolonged adoption of VR/AR experiences. While VR/AR head-mounted displays unlock users' natural wide-range head movements during viewing, their neck muscle comfort is inevitably compromised by the added hardware weight. Unfortunately, little quantitative knowledge for understanding and addressing such an issue is available so far.  Leveraging electromyography devices, we measure, model, and predict VR users' neck muscle contraction levels (MCL) while they move their heads to interact with the virtual environment. Specifically, by learning from collected physiological data, we develop a bio-physically inspired computational model to predict neck MCL under diverse head kinematic states. Beyond quantifying the cumulative MCL of completed head movements, our model can also predict potential MCL requirements with target head poses only. A series of objective evaluations and user studies demonstrate its prediction accuracy and generality, as",
    "path": "papers/23/08/2308.14841.json",
    "total_tokens": 999,
    "translated_title": "优化虚拟现实/增强现实人机工程学：建模和预测用户颈部肌肉收缩",
    "translated_abstract": "对于大规模和长期采用VR/AR体验来说，人体工程学效率是至关重要的。虽然VR/AR头戴显示器在观看时解锁了用户自然的广泛头部运动，但由于增加的硬件重量，不可避免地影响了他们的颈部肌肉舒适度。不幸的是，到目前为止，还没有多少量化的知识来理解和解决这个问题。利用肌电图设备，我们测量、建模和预测VR用户在与虚拟环境交互时头部运动时的颈部肌肉收缩水平（MCL）。具体来说，通过学习收集的生理数据，我们开发了一个生物物理启发式的计算模型，可以预测在不同头部运动状态下的颈部MCL。除了量化完成的头部运动的累积MCL之外，我们的模型还可以预测仅通过目标头部姿势的潜在MCL需求。一系列客观评估和用户研究证明了其预测准确性和普适性。",
    "tldr": "该研究利用肌电图设备测量、建模和预测了VR用户在与虚拟环境交互时的颈部肌肉收缩水平，开发了一个生物物理启发式的计算模型，可以准确预测不同头部运动状态下的颈部收缩水平，并且可以预测仅通过目标头部姿势的潜在收缩需求。",
    "en_tdlr": "This research measures, models, and predicts neck muscle contraction levels of VR users while they interact with the virtual environment. A computational model is developed based on physiological data, which accurately predicts neck muscle contraction under different head movement states and can also predict potential contraction requirements with target head poses."
}