{
    "title": "Self-Supervised Knowledge-Driven Deep Learning for 3D Magnetic Inversion. (arXiv:2308.12193v1 [physics.geo-ph])",
    "abstract": "The magnetic inversion method is one of the non-destructive geophysical methods, which aims to estimate the subsurface susceptibility distribution from surface magnetic anomaly data. Recently, supervised deep learning methods have been widely utilized in lots of geophysical fields including magnetic inversion. However, these methods rely heavily on synthetic training data, whose performance is limited since the synthetic data is not independently and identically distributed with the field data. Thus, we proposed to realize magnetic inversion by self-supervised deep learning. The proposed self-supervised knowledge-driven 3D magnetic inversion method (SSKMI) learns on the target field data by a closed loop of the inversion and forward models. Given that the parameters of the forward model are preset, SSKMI can optimize the inversion model by minimizing the mean absolute error between observed and re-estimated surface magnetic anomalies. Besides, there is a knowledge-driven module in the ",
    "link": "http://arxiv.org/abs/2308.12193",
    "context": "Title: Self-Supervised Knowledge-Driven Deep Learning for 3D Magnetic Inversion. (arXiv:2308.12193v1 [physics.geo-ph])\nAbstract: The magnetic inversion method is one of the non-destructive geophysical methods, which aims to estimate the subsurface susceptibility distribution from surface magnetic anomaly data. Recently, supervised deep learning methods have been widely utilized in lots of geophysical fields including magnetic inversion. However, these methods rely heavily on synthetic training data, whose performance is limited since the synthetic data is not independently and identically distributed with the field data. Thus, we proposed to realize magnetic inversion by self-supervised deep learning. The proposed self-supervised knowledge-driven 3D magnetic inversion method (SSKMI) learns on the target field data by a closed loop of the inversion and forward models. Given that the parameters of the forward model are preset, SSKMI can optimize the inversion model by minimizing the mean absolute error between observed and re-estimated surface magnetic anomalies. Besides, there is a knowledge-driven module in the ",
    "path": "papers/23/08/2308.12193.json",
    "total_tokens": 965,
    "translated_title": "3D磁性反演的自监督知识驱动深度学习方法",
    "translated_abstract": "磁性反演方法是一种非破坏性地球物理方法，旨在通过地表磁异常数据估计地下磁化率分布。最近，监督式深度学习方法在包括磁性反演在内的地球物理领域得到了广泛应用。然而，这些方法严重依赖于合成训练数据，其性能受限于合成数据与实际场数据的分布不独立且不相同。因此，我们提出了一种基于自监督深度学习的磁性反演方法。该方法通过反演和正演模型的闭环学习目标场地数据，实现磁性反演。在预设的正演模型参数的情况下，自监督知识驱动3D磁性反演方法(SSKMI)通过最小化观测和重新估计的地表磁异常之间的绝对误差来优化反演模型。此外，在该方法中还有一个知识驱动模块。",
    "tldr": "提出了一种基于自监督深度学习方法的3D磁性反演方法，通过闭环学习目标场地数据的反演和正演模型来实现磁性反演。在预设的正演模型参数的条件下，该方法通过优化反演模型来实现最小化观测和重新估计的地表磁异常之间的绝对误差。"
}