{
    "title": "E3-UAV: An Edge-based Energy-Efficient Object Detection System for Unmanned Aerial Vehicles. (arXiv:2308.04774v1 [cs.RO])",
    "abstract": "Motivated by the advances in deep learning techniques, the application of Unmanned Aerial Vehicle (UAV)-based object detection has proliferated across a range of fields, including vehicle counting, fire detection, and city monitoring. While most existing research studies only a subset of the challenges inherent to UAV-based object detection, there are few studies that balance various aspects to design a practical system for energy consumption reduction. In response, we present the E3-UAV, an edge-based energy-efficient object detection system for UAVs. The system is designed to dynamically support various UAV devices, edge devices, and detection algorithms, with the aim of minimizing energy consumption by deciding the most energy-efficient flight parameters (including flight altitude, flight speed, detection algorithm, and sampling rate) required to fulfill the detection requirements of the task. We first present an effective evaluation metric for actual tasks and construct a transpare",
    "link": "http://arxiv.org/abs/2308.04774",
    "context": "Title: E3-UAV: An Edge-based Energy-Efficient Object Detection System for Unmanned Aerial Vehicles. (arXiv:2308.04774v1 [cs.RO])\nAbstract: Motivated by the advances in deep learning techniques, the application of Unmanned Aerial Vehicle (UAV)-based object detection has proliferated across a range of fields, including vehicle counting, fire detection, and city monitoring. While most existing research studies only a subset of the challenges inherent to UAV-based object detection, there are few studies that balance various aspects to design a practical system for energy consumption reduction. In response, we present the E3-UAV, an edge-based energy-efficient object detection system for UAVs. The system is designed to dynamically support various UAV devices, edge devices, and detection algorithms, with the aim of minimizing energy consumption by deciding the most energy-efficient flight parameters (including flight altitude, flight speed, detection algorithm, and sampling rate) required to fulfill the detection requirements of the task. We first present an effective evaluation metric for actual tasks and construct a transpare",
    "path": "papers/23/08/2308.04774.json",
    "total_tokens": 858,
    "translated_title": "E3-UAV:一种面向边缘的能量高效无人机目标检测系统",
    "translated_abstract": "随着深度学习技术的进步，基于无人机的目标检测在车辆计数、火灾检测和城市监测等领域得到了广泛应用。然而，现有研究大多只关注无人机目标检测中某些挑战的子集，缺乏在各个方面平衡来设计一个实际能量消耗降低的系统。为解决这个问题，本文提出了一种面向边缘的能量高效无人机目标检测系统E3-UAV。该系统通过决定满足任务检测要求的最节能飞行参数（包括飞行高度、飞行速度、检测算法和采样率），从而动态支持各种无人机设备、边缘设备和检测算法，以最大程度地减少能量消耗。我们首先提出了一个有效的评估指标来评估实际任务，并构建了一个透明的...",
    "tldr": "E3-UAV是一种面向边缘的能量高效无人机目标检测系统，通过动态调整飞行参数和检测算法，最大程度地减少能量消耗。"
}