{
    "title": "HiFiHR: Enhancing 3D Hand Reconstruction from a Single Image via High-Fidelity Texture. (arXiv:2308.13628v1 [cs.CV])",
    "abstract": "We present HiFiHR, a high-fidelity hand reconstruction approach that utilizes render-and-compare in the learning-based framework from a single image, capable of generating visually plausible and accurate 3D hand meshes while recovering realistic textures. Our method achieves superior texture reconstruction by employing a parametric hand model with predefined texture assets, and by establishing a texture reconstruction consistency between the rendered and input images during training. Moreover, based on pretraining the network on an annotated dataset, we apply varying degrees of supervision using our pipeline, i.e., self-supervision, weak supervision, and full supervision, and discuss the various levels of contributions of the learned high-fidelity textures in enhancing hand pose and shape estimation. Experimental results on public benchmarks including FreiHAND and HO-3D demonstrate that our method outperforms the state-of-the-art hand reconstruction methods in texture reconstruction qu",
    "link": "http://arxiv.org/abs/2308.13628",
    "context": "Title: HiFiHR: Enhancing 3D Hand Reconstruction from a Single Image via High-Fidelity Texture. (arXiv:2308.13628v1 [cs.CV])\nAbstract: We present HiFiHR, a high-fidelity hand reconstruction approach that utilizes render-and-compare in the learning-based framework from a single image, capable of generating visually plausible and accurate 3D hand meshes while recovering realistic textures. Our method achieves superior texture reconstruction by employing a parametric hand model with predefined texture assets, and by establishing a texture reconstruction consistency between the rendered and input images during training. Moreover, based on pretraining the network on an annotated dataset, we apply varying degrees of supervision using our pipeline, i.e., self-supervision, weak supervision, and full supervision, and discuss the various levels of contributions of the learned high-fidelity textures in enhancing hand pose and shape estimation. Experimental results on public benchmarks including FreiHAND and HO-3D demonstrate that our method outperforms the state-of-the-art hand reconstruction methods in texture reconstruction qu",
    "path": "papers/23/08/2308.13628.json",
    "total_tokens": 885,
    "translated_title": "HiFiHR：通过高保真纹理增强来自单张图像的3D手部重建",
    "translated_abstract": "我们提出了HiFiHR，一种高保真手部重建方法，利用了从单张图像中基于学习的渲染和比较能力，能够生成逼真且准确的3D手部网格，并恢复真实的纹理。我们的方法通过使用预定义纹理资源的参数化手部模型，并在训练过程中在渲染和输入图像之间建立纹理重建一致性来实现卓越的纹理重建效果。此外，我们在一个标注数据集上对网络进行预训练，并使用我们的管道以不同程度的监督方式（自监督、弱监督和全监督）进行实验，讨论了学习到的高保真纹理在改善手部姿态和形状估计中的不同贡献水平。在包括FreiHAND和HO-3D在内的公共基准测试上的实验结果表明，我们的方法在纹理重建质量方面优于现有的手部重建方法。",
    "tldr": "HiFiHR是一种通过高保真纹理增强来自单张图像的3D手部重建方法，能够生成逼真且准确的手部网格，并通过各种程度的监督方式改善手部姿态和形状估计。",
    "en_tdlr": "HiFiHR is an approach that enhances 3D hand reconstruction from a single image by using high-fidelity texture, generating visually plausible and accurate hand meshes, and improving hand pose and shape estimation through various levels of supervision."
}