{
    "title": "Local Consensus Enhanced Siamese Network with Reciprocal Loss for Two-view Correspondence Learning. (arXiv:2308.03217v1 [cs.CV] CROSS LISTED)",
    "abstract": "Recent studies of two-view correspondence learning usually establish an end-to-end network to jointly predict correspondence reliability and relative pose. We improve such a framework from two aspects. First, we propose a Local Feature Consensus (LFC) plugin block to augment the features of existing models. Given a correspondence feature, the block augments its neighboring features with mutual neighborhood consensus and aggregates them to produce an enhanced feature. As inliers obey a uniform cross-view transformation and share more consistent learned features than outliers, feature consensus strengthens inlier correlation and suppresses outlier distraction, which makes output features more discriminative for classifying inliers/outliers. Second, existing approaches supervise network training with the ground truth correspondences and essential matrix projecting one image to the other for an input image pair, without considering the information from the reverse mapping. We extend existi",
    "link": "http://arxiv.org/abs/2308.03217",
    "context": "Title: Local Consensus Enhanced Siamese Network with Reciprocal Loss for Two-view Correspondence Learning. (arXiv:2308.03217v1 [cs.CV] CROSS LISTED)\nAbstract: Recent studies of two-view correspondence learning usually establish an end-to-end network to jointly predict correspondence reliability and relative pose. We improve such a framework from two aspects. First, we propose a Local Feature Consensus (LFC) plugin block to augment the features of existing models. Given a correspondence feature, the block augments its neighboring features with mutual neighborhood consensus and aggregates them to produce an enhanced feature. As inliers obey a uniform cross-view transformation and share more consistent learned features than outliers, feature consensus strengthens inlier correlation and suppresses outlier distraction, which makes output features more discriminative for classifying inliers/outliers. Second, existing approaches supervise network training with the ground truth correspondences and essential matrix projecting one image to the other for an input image pair, without considering the information from the reverse mapping. We extend existi",
    "path": "papers/23/08/2308.03217.json",
    "total_tokens": 945,
    "translated_title": "本地一致增强的Siamese网络与循环损失用于双视图对应学习",
    "translated_abstract": "最近的双视图对应学习研究通常建立一个端到端网络来共同预测对应可靠性和相对姿态。我们从两个方面改进了这样一个框架。首先，我们提出了一个本地特征一致性（LFC）插件块来增强现有模型的特征。给定一个对应特征，该块通过相互邻域一致性增强其相邻特征，并将它们聚合以产生增强特征。由于内点服从统一的跨视图变换，并且共享比异常点更一致的学习特征，特征一致性增强了内点之间的相关性，并抑制了异常点的干扰，从而使输出特征更具辨别力，可以用于分类内点/异常点。其次，现有的方法在网络训练中使用地面真实对应和本质矩阵将一个图像投影到另一个图像的输入图像对，而不考虑反向映射的信息。我们扩展现有的途径来同时利用正向和反向映射的信息来监督网络训练。",
    "tldr": "本文提出了一种本地一致增强的Siamese网络用于双视图对应学习，通过增强特征的一致性强化内点相关性、抑制异常点的干扰，并使用正向和反向映射的信息来监督网络训练。",
    "en_tdlr": "This paper presents a Local Consensus Enhanced Siamese Network for two-view correspondence learning, which strengthens the correlation of inliers, suppresses outlier distraction through enhanced feature consistency, and utilizes both forward and reverse mapping information to supervise network training."
}