{
    "title": "An Efficient Distributed Multi-Agent Reinforcement Learning for EV Charging Network Control. (arXiv:2308.12921v1 [cs.MA])",
    "abstract": "The increasing trend in adopting electric vehicles (EVs) will significantly impact the residential electricity demand, which results in an increased risk of transformer overload in the distribution grid. To mitigate such risks, there are urgent needs to develop effective EV charging controllers. Currently, the majority of the EV charge controllers are based on a centralized approach for managing individual EVs or a group of EVs. In this paper, we introduce a decentralized Multi-agent Reinforcement Learning (MARL) charging framework that prioritizes the preservation of privacy for EV owners. We employ the Centralized Training Decentralized Execution-Deep Deterministic Policy Gradient (CTDE-DDPG) scheme, which provides valuable information to users during training while maintaining privacy during execution. Our results demonstrate that the CTDE framework improves the performance of the charging network by reducing the network costs. Moreover, we show that the Peak-to-Average Ratio (PAR) ",
    "link": "http://arxiv.org/abs/2308.12921",
    "context": "Title: An Efficient Distributed Multi-Agent Reinforcement Learning for EV Charging Network Control. (arXiv:2308.12921v1 [cs.MA])\nAbstract: The increasing trend in adopting electric vehicles (EVs) will significantly impact the residential electricity demand, which results in an increased risk of transformer overload in the distribution grid. To mitigate such risks, there are urgent needs to develop effective EV charging controllers. Currently, the majority of the EV charge controllers are based on a centralized approach for managing individual EVs or a group of EVs. In this paper, we introduce a decentralized Multi-agent Reinforcement Learning (MARL) charging framework that prioritizes the preservation of privacy for EV owners. We employ the Centralized Training Decentralized Execution-Deep Deterministic Policy Gradient (CTDE-DDPG) scheme, which provides valuable information to users during training while maintaining privacy during execution. Our results demonstrate that the CTDE framework improves the performance of the charging network by reducing the network costs. Moreover, we show that the Peak-to-Average Ratio (PAR) ",
    "path": "papers/23/08/2308.12921.json",
    "total_tokens": 855,
    "translated_title": "一种高效的分布式多智能体强化学习用于电动汽车充电网络控制",
    "translated_abstract": "电动汽车（EV）的普及趋势将显著影响住宅电力需求，导致配电网变压器超负荷风险增加。为了减轻这种风险，迫切需要开发有效的EV充电控制器。目前，大多数EV充电控制器基于集中式方法管理单个EV或一组EV。本文引入了一种分散式多智能体强化学习（MARL）充电框架，优先保护EV车主的隐私。我们采用了集中式训练分散式执行-深度确定性策略梯度（CTDE-DDPG）模式，在训练过程中向用户提供有价值的信息，同时在执行过程中保护隐私。我们的结果表明，CTDE框架通过减少网络成本提高了充电网络的性能。此外，我们还展示了峰值-平均比（PAR）的",
    "tldr": "这个论文提出了一种分散式多智能体强化学习的EV充电控制框架，通过保护隐私和减少网络成本来改善充电网络的性能。"
}