{
    "title": "SEM-GAT: Explainable Semantic Pose Estimation using Learned Graph Attention. (arXiv:2308.03718v2 [cs.RO] UPDATED)",
    "abstract": "This paper proposes a Graph Neural Network(GNN)-based method for exploiting semantics and local geometry to guide the identification of reliable pointcloud registration candidates. Semantic and morphological features of the environment serve as key reference points for registration, enabling accurate lidar-based pose estimation. Our novel lightweight static graph structure informs our attention-based node aggregation network by identifying semantic-instance relationships, acting as an inductive bias to significantly reduce the computational burden of pointcloud registration. By connecting candidate nodes and exploiting cross-graph attention, we identify confidence scores for all potential registration correspondences and estimate the displacement between pointcloud scans. Our pipeline enables introspective analysis of the model's performance by correlating it with the individual contributions of local structures in the environment, providing valuable insights into the system's behaviou",
    "link": "http://arxiv.org/abs/2308.03718",
    "context": "Title: SEM-GAT: Explainable Semantic Pose Estimation using Learned Graph Attention. (arXiv:2308.03718v2 [cs.RO] UPDATED)\nAbstract: This paper proposes a Graph Neural Network(GNN)-based method for exploiting semantics and local geometry to guide the identification of reliable pointcloud registration candidates. Semantic and morphological features of the environment serve as key reference points for registration, enabling accurate lidar-based pose estimation. Our novel lightweight static graph structure informs our attention-based node aggregation network by identifying semantic-instance relationships, acting as an inductive bias to significantly reduce the computational burden of pointcloud registration. By connecting candidate nodes and exploiting cross-graph attention, we identify confidence scores for all potential registration correspondences and estimate the displacement between pointcloud scans. Our pipeline enables introspective analysis of the model's performance by correlating it with the individual contributions of local structures in the environment, providing valuable insights into the system's behaviou",
    "path": "papers/23/08/2308.03718.json",
    "total_tokens": 875,
    "translated_title": "SEM-GAT: 使用学习到的图注意力进行可解释的语义姿态估计",
    "translated_abstract": "本文提出了一种基于图神经网络(GNN)的方法，利用语义和局部几何信息指导可靠的点云注册候选点的确定。环境的语义和形态学特征作为注册的关键参考点，实现了精确的激光雷达姿态估计。我们提出了一种轻量级的静态图结构，通过识别语义-实例关系，为注意力聚合网络提供指导，显著减少了点云注册的计算负担。通过连接候选节点并利用跨图注意力，我们识别了所有可能注册对应的置信度分数，并估计点云扫描之间的位移。我们的方法可通过将模型的表现与环境中局部结构的个体贡献相关联，实现对模型性能的内省分析，从而提供有价值的洞察力。",
    "tldr": "本文提出了一种新颖的基于图神经网络的方法，通过利用语义和局部几何信息指导可靠的点云注册，实现精确的激光雷达姿态估计。该方法利用静态图结构和跨图注意力，有效减少了点云注册的计算负担，并提供了对模型性能的内省分析。"
}