{
    "title": "Fair Models in Credit: Intersectional Discrimination and the Amplification of Inequity. (arXiv:2308.02680v1 [cs.CY])",
    "abstract": "The increasing usage of new data sources and machine learning (ML) technology in credit modeling raises concerns with regards to potentially unfair decision-making that rely on protected characteristics (e.g., race, sex, age) or other socio-economic and demographic data. The authors demonstrate the impact of such algorithmic bias in the microfinance context. Difficulties in assessing credit are disproportionately experienced among vulnerable groups, however, very little is known about inequities in credit allocation between groups defined, not only by single, but by multiple and intersecting social categories. Drawing from the intersectionality paradigm, the study examines intersectional horizontal inequities in credit access by gender, age, marital status, single parent status and number of children. This paper utilizes data from the Spanish microfinance market as its context to demonstrate how pluralistic realities and intersectional identities can shape patterns of credit allocation",
    "link": "http://arxiv.org/abs/2308.02680",
    "context": "Title: Fair Models in Credit: Intersectional Discrimination and the Amplification of Inequity. (arXiv:2308.02680v1 [cs.CY])\nAbstract: The increasing usage of new data sources and machine learning (ML) technology in credit modeling raises concerns with regards to potentially unfair decision-making that rely on protected characteristics (e.g., race, sex, age) or other socio-economic and demographic data. The authors demonstrate the impact of such algorithmic bias in the microfinance context. Difficulties in assessing credit are disproportionately experienced among vulnerable groups, however, very little is known about inequities in credit allocation between groups defined, not only by single, but by multiple and intersecting social categories. Drawing from the intersectionality paradigm, the study examines intersectional horizontal inequities in credit access by gender, age, marital status, single parent status and number of children. This paper utilizes data from the Spanish microfinance market as its context to demonstrate how pluralistic realities and intersectional identities can shape patterns of credit allocation",
    "path": "papers/23/08/2308.02680.json",
    "total_tokens": 907,
    "translated_title": "信贷中的公平模型：交叉歧视和不平等的放大",
    "translated_abstract": "在信贷建模中，新数据来源和机器学习技术的增加引发了对潜在不公平决策的关注，这些决策依赖于受保护的特征（如种族、性别、年龄）或其他社会经济和人口统计数据。作者在小额信贷背景下展示了这种算法偏见的影响。在信用评估方面存在不平等的困难在弱势群体中更为凸显，然而，我们对由多个交叉社会类别定义的群体之间的信贷分配不平等非常了解。本研究借鉴交叉性理论，探讨了按性别、年龄、婚姻状况、单亲状态和子女数量交叉的水平不平等在信贷获得中的影响。本文利用西班牙小额信贷市场的数据，展示了多元化的现实和交叉身份如何塑造信贷分配模式。",
    "tldr": "本文研究了信贷领域中的公平模型，通过借鉴交叉性理论，揭示了在性别、年龄、婚姻状况、单亲状态和子女数量等多个交叉社会类别的影响下，信贷分配中存在的不平等现象。",
    "en_tdlr": "This paper investigates fair models in credit by examining the intersectionality of social categories such as gender, age, marital status, single parent status, and number of children, and reveals the inequalities in credit allocation within these intersecting groups."
}