{
    "title": "Enhancing Phrase Representation by Information Bottleneck Guided Text Diffusion Process for Keyphrase Extraction. (arXiv:2308.08739v1 [cs.CL])",
    "abstract": "Keyphrase extraction (KPE) is an important task in Natural Language Processing for many scenarios, which aims to extract keyphrases that are present in a given document. Many existing supervised methods treat KPE as sequential labeling, span-level classification, or generative tasks. However, these methods lack the ability to utilize keyphrase information, which may result in biased results. In this study, we propose Diff-KPE, which leverages the supervised Variational Information Bottleneck (VIB) to guide the text diffusion process for generating enhanced keyphrase representations. Diff-KPE first generates the desired keyphrase embeddings conditioned on the entire document and then injects the generated keyphrase embeddings into each phrase representation. A ranking network and VIB are then optimized together with rank loss and classification loss, respectively. This design of Diff-KPE allows us to rank each candidate phrase by utilizing both the information of keyphrases and the docu",
    "link": "http://arxiv.org/abs/2308.08739",
    "context": "Title: Enhancing Phrase Representation by Information Bottleneck Guided Text Diffusion Process for Keyphrase Extraction. (arXiv:2308.08739v1 [cs.CL])\nAbstract: Keyphrase extraction (KPE) is an important task in Natural Language Processing for many scenarios, which aims to extract keyphrases that are present in a given document. Many existing supervised methods treat KPE as sequential labeling, span-level classification, or generative tasks. However, these methods lack the ability to utilize keyphrase information, which may result in biased results. In this study, we propose Diff-KPE, which leverages the supervised Variational Information Bottleneck (VIB) to guide the text diffusion process for generating enhanced keyphrase representations. Diff-KPE first generates the desired keyphrase embeddings conditioned on the entire document and then injects the generated keyphrase embeddings into each phrase representation. A ranking network and VIB are then optimized together with rank loss and classification loss, respectively. This design of Diff-KPE allows us to rank each candidate phrase by utilizing both the information of keyphrases and the docu",
    "path": "papers/23/08/2308.08739.json",
    "total_tokens": 894,
    "translated_title": "使用信息瓶颈引导的文本扩散过程增强短语表示的关键词提取方法",
    "translated_abstract": "关键词提取(KPE)是自然语言处理中的一个重要任务，用于从给定文档中提取关键词。许多现有的监督方法将KPE视为序列标注、跨度级分类或生成任务。然而，这些方法缺乏利用关键词信息的能力，可能导致结果有偏差。在本研究中，我们提出了Diff-KPE，它利用监督的变分信息瓶颈(VIB)来引导文本扩散过程，生成增强的关键词表示。Diff-KPE首先根据整个文档生成所需的关键词嵌入，然后将生成的关键词嵌入注入到每个短语表示中。然后，通过排名网络和VIB同时进行排名损失和分类损失的优化。Diff-KPE的设计允许我们利用关键词和文档的信息对每个候选短语进行排名。",
    "tldr": "本研究提出了一种利用信息瓶颈引导的文本扩散过程来增强短语表示的关键词提取方法。该方法充分利用关键词信息，通过优化排名网络和变分信息瓶颈来提高关键词提取的效果。",
    "en_tdlr": "This study proposes a keyphrase extraction method that enhances phrase representation by utilizing an information bottleneck guided text diffusion process. The method leverages keyphrase information and optimizes a ranking network and variational information bottleneck to improve keyphrase extraction performance."
}