{
    "title": "PURL: Safe and Effective Sanitization of Link Decoration",
    "abstract": "arXiv:2308.03417v2 Announce Type: replace-cross  Abstract: While privacy-focused browsers have taken steps to block third-party cookies and mitigate browser fingerprinting, novel tracking techniques that can bypass existing countermeasures continue to emerge. Since trackers need to share information from the client-side to the server-side through link decoration regardless of the tracking technique they employ, a promising orthogonal approach is to detect and sanitize tracking information in decorated links. To this end, we present PURL (pronounced purel-l), a machine-learning approach that leverages a cross-layer graph representation of webpage execution to safely and effectively sanitize link decoration. Our evaluation shows that PURL significantly outperforms existing countermeasures in terms of accuracy and reducing website breakage while being robust to common evasion techniques. PURL's deployment on a sample of top-million websites shows that link decoration is abused for trackin",
    "link": "https://arxiv.org/abs/2308.03417",
    "context": "Title: PURL: Safe and Effective Sanitization of Link Decoration\nAbstract: arXiv:2308.03417v2 Announce Type: replace-cross  Abstract: While privacy-focused browsers have taken steps to block third-party cookies and mitigate browser fingerprinting, novel tracking techniques that can bypass existing countermeasures continue to emerge. Since trackers need to share information from the client-side to the server-side through link decoration regardless of the tracking technique they employ, a promising orthogonal approach is to detect and sanitize tracking information in decorated links. To this end, we present PURL (pronounced purel-l), a machine-learning approach that leverages a cross-layer graph representation of webpage execution to safely and effectively sanitize link decoration. Our evaluation shows that PURL significantly outperforms existing countermeasures in terms of accuracy and reducing website breakage while being robust to common evasion techniques. PURL's deployment on a sample of top-million websites shows that link decoration is abused for trackin",
    "path": "papers/23/08/2308.03417.json",
    "total_tokens": 850,
    "translated_title": "PURL: 链接装饰的安全有效清洁",
    "translated_abstract": "尽管以隐私为重点的浏览器已经采取了阻止第三方cookie和减少浏览器指纹识别的措施，但仍然不断出现可以绕过现有对策的新型跟踪技术。鉴于跟踪器需要通过链接装饰从客户端向服务器端共享信息，无论他们采用何种跟踪技术，一个有前途的方法是检测和清洁装饰链接中的跟踪信息。为此，我们提出了PURL（发音为purel-l），这是一种利用网页执行的跨层图表示来安全有效地清洁链接装饰的机器学习方法。我们的评估显示，PURL在准确性和减少网站破坏方面明显优于现有的对策，并且对常见的规避技术具有很强的鲁棒性。在一部分前一百万网站上部署PURL的结果显示，链接装饰被滥用用于跟踪。",
    "tldr": "使用机器学习方法的PURL能够安全有效地清洁链接装饰，显着优于现有对策，而且对常见规避技术具有很强的鲁棒性。"
}