{
    "title": "Building Emotional Support Chatbots in the Era of LLMs. (arXiv:2308.11584v1 [cs.CL])",
    "abstract": "The integration of emotional support into various conversational scenarios presents profound societal benefits, such as social interactions, mental health counseling, and customer service. However, there are unsolved challenges that hinder real-world applications in this field, including limited data availability and the absence of well-accepted model training paradigms. This work endeavors to navigate these challenges by harnessing the capabilities of Large Language Models (LLMs). We introduce an innovative methodology that synthesizes human insights with the computational prowess of LLMs to curate an extensive emotional support dialogue dataset. Our approach is initiated with a meticulously designed set of dialogues spanning diverse scenarios as generative seeds. By utilizing the in-context learning potential of ChatGPT, we recursively generate an ExTensible Emotional Support dialogue dataset, named ExTES. Following this, we deploy advanced tuning techniques on the LLaMA model, exami",
    "link": "http://arxiv.org/abs/2308.11584",
    "context": "Title: Building Emotional Support Chatbots in the Era of LLMs. (arXiv:2308.11584v1 [cs.CL])\nAbstract: The integration of emotional support into various conversational scenarios presents profound societal benefits, such as social interactions, mental health counseling, and customer service. However, there are unsolved challenges that hinder real-world applications in this field, including limited data availability and the absence of well-accepted model training paradigms. This work endeavors to navigate these challenges by harnessing the capabilities of Large Language Models (LLMs). We introduce an innovative methodology that synthesizes human insights with the computational prowess of LLMs to curate an extensive emotional support dialogue dataset. Our approach is initiated with a meticulously designed set of dialogues spanning diverse scenarios as generative seeds. By utilizing the in-context learning potential of ChatGPT, we recursively generate an ExTensible Emotional Support dialogue dataset, named ExTES. Following this, we deploy advanced tuning techniques on the LLaMA model, exami",
    "path": "papers/23/08/2308.11584.json",
    "total_tokens": 931,
    "translated_title": "在LLMs时代构建情感支持聊天机器人",
    "translated_abstract": "将情感支持集成到各种对话场景中具有深远的社会效益，如社交互动、心理健康咨询和客户服务。然而，在这一领域存在一些未解决的挑战，包括有限的数据可用性和缺乏被广泛接受的模型训练范例。本研究通过利用大型语言模型（LLMs）的能力，试图解决这些挑战。我们引入一种创新方法，将人类见解与LLMs的计算能力相结合，构建了一个广泛的情感支持对话数据集。我们的方法从精心设计的涵盖多种场景的对话集合作为生成种子开始。通过利用ChatGPT的上下文学习潜力，我们递归地生成了一个可扩展的情感支持对话数据集，命名为ExTES。在此基础上，我们对LLaMA模型进行了高级调优技术的部署，检验了其性能。",
    "tldr": "本研究利用大型语言模型（LLMs）的能力，通过合成人类见解与计算能力，构建了一个广泛的情感支持对话数据集。最终提出了一种名为ExTES的可扩展情感支持对话数据集，并部署了高级调优技术，以解决情感支持聊天机器人在实际应用中遇到的挑战。",
    "en_tdlr": "This research leverages the capabilities of Large Language Models (LLMs) to curate an extensive emotional support dialogue dataset by synthesizing human insights with computational prowess. The proposed ExTES dataset addresses the challenges of emotional support chatbots in real-world applications, and advanced tuning techniques are deployed to enhance performance."
}