{
    "title": "Deep Learning and Bayesian inference for Inverse Problems. (arXiv:2308.15492v1 [stat.ML])",
    "abstract": "Inverse problems arise anywhere we have indirect measurement. As, in general they are ill-posed, to obtain satisfactory solutions for them needs prior knowledge. Classically, different regularization methods and Bayesian inference based methods have been proposed. As these methods need a great number of forward and backward computations, they become costly in computation, in particular, when the forward or generative models are complex and the evaluation of the likelihood becomes very costly. Using Deep Neural Network surrogate models and approximate computation can become very helpful. However, accounting for the uncertainties, we need first understand the Bayesian Deep Learning and then, we can see how we can use them for inverse problems. In this work, we focus on NN, DL and more specifically the Bayesian DL particularly adapted for inverse problems. We first give details of Bayesian DL approximate computations with exponential families, then we will see how we can use them for inve",
    "link": "http://arxiv.org/abs/2308.15492",
    "context": "Title: Deep Learning and Bayesian inference for Inverse Problems. (arXiv:2308.15492v1 [stat.ML])\nAbstract: Inverse problems arise anywhere we have indirect measurement. As, in general they are ill-posed, to obtain satisfactory solutions for them needs prior knowledge. Classically, different regularization methods and Bayesian inference based methods have been proposed. As these methods need a great number of forward and backward computations, they become costly in computation, in particular, when the forward or generative models are complex and the evaluation of the likelihood becomes very costly. Using Deep Neural Network surrogate models and approximate computation can become very helpful. However, accounting for the uncertainties, we need first understand the Bayesian Deep Learning and then, we can see how we can use them for inverse problems. In this work, we focus on NN, DL and more specifically the Bayesian DL particularly adapted for inverse problems. We first give details of Bayesian DL approximate computations with exponential families, then we will see how we can use them for inve",
    "path": "papers/23/08/2308.15492.json",
    "total_tokens": 887,
    "translated_title": "深度学习与贝叶斯推断在反问题中的应用",
    "translated_abstract": "反问题在任何间接测量的情况下都会出现。由于通常情况下它们是病态的，为了得到令人满意的解决方案，需要先有先验知识。经典方法包括不同的正则化方法和基于贝叶斯推断的方法。由于这些方法需要大量的正向和反向计算，尤其是当正向或生成模型复杂且似然函数的评估非常昂贵时，计算成本就会变高。使用深度神经网络代理模型和近似计算可以非常有帮助。但是，为了考虑不确定性，我们需要先了解贝叶斯深度学习，然后再看如何将其用于反问题。本研究重点关注神经网络、深度学习，特别是适用于反问题的贝叶斯深度学习。我们首先详细介绍了贝叶斯深度学习近似计算与指数族的方法，然后再看如何将其应用于反问题中。",
    "tldr": "这项研究探讨了在反问题中应用深度学习和贝叶斯推断的方法。通过使用深度神经网络代理模型和近似计算，可以有效地解决复杂的反问题，并考虑不确定性。",
    "en_tdlr": "This study explores the use of deep learning and Bayesian inference in inverse problems. By utilizing deep neural network surrogate models and approximate computation, complex inverse problems can be effectively solved while considering uncertainties."
}