{
    "title": "Open-set Face Recognition with Neural Ensemble, Maximal Entropy Loss and Feature Augmentation. (arXiv:2308.12371v1 [cs.CV])",
    "abstract": "Open-set face recognition refers to a scenario in which biometric systems have incomplete knowledge of all existing subjects. Therefore, they are expected to prevent face samples of unregistered subjects from being identified as previously enrolled identities. This watchlist context adds an arduous requirement that calls for the dismissal of irrelevant faces by focusing mainly on subjects of interest. As a response, this work introduces a novel method that associates an ensemble of compact neural networks with a margin-based cost function that explores additional samples. Supplementary negative samples can be obtained from external databases or synthetically built at the representation level in training time with a new mix-up feature augmentation approach. Deep neural networks pre-trained on large face datasets serve as the preliminary feature extraction module. We carry out experiments on well-known LFW and IJB-C datasets where results show that the approach is able to boost closed an",
    "link": "http://arxiv.org/abs/2308.12371",
    "context": "Title: Open-set Face Recognition with Neural Ensemble, Maximal Entropy Loss and Feature Augmentation. (arXiv:2308.12371v1 [cs.CV])\nAbstract: Open-set face recognition refers to a scenario in which biometric systems have incomplete knowledge of all existing subjects. Therefore, they are expected to prevent face samples of unregistered subjects from being identified as previously enrolled identities. This watchlist context adds an arduous requirement that calls for the dismissal of irrelevant faces by focusing mainly on subjects of interest. As a response, this work introduces a novel method that associates an ensemble of compact neural networks with a margin-based cost function that explores additional samples. Supplementary negative samples can be obtained from external databases or synthetically built at the representation level in training time with a new mix-up feature augmentation approach. Deep neural networks pre-trained on large face datasets serve as the preliminary feature extraction module. We carry out experiments on well-known LFW and IJB-C datasets where results show that the approach is able to boost closed an",
    "path": "papers/23/08/2308.12371.json",
    "total_tokens": 977,
    "translated_title": "带有神经集合、最大熵损失和特征增强的开放集人脸识别",
    "translated_abstract": "开放集人脸识别是指生物识别系统对所有已存在主体的知识不完整的情况。因此，人们期望它们能够防止将未注册主体的人脸样本识别为先前注册的身份。这种监视列表的背景增加了一个艰巨的要求，要求主要关注感兴趣的主体，从而排除不相关的人脸。为此，本文引入了一种新的方法，该方法将一组紧凑的神经网络与基于边缘的成本函数相结合，该函数探索附加样本。辅助负样本可以从外部数据库中获得，或者在训练时通过新的混合特征增强方法在表示层次上进行合成构建。预先在大型人脸数据集上训练的深度神经网络作为初步特征提取模块。我们在知名的LFW和IJB-C数据集上进行了实验证明，该方法能够提升封闭集的",
    "tldr": "本文介绍了一种新颖的方法，将一组紧凑的神经网络与基于边缘的成本函数相结合，通过探索附加样本来提高开放集人脸识别的准确性。该方法利用外部数据库获取辅助负样本或通过混合特征增强方法在训练过程中合成建立负样本。实验结果表明，该方法能够提升封闭集的准确性。",
    "en_tdlr": "This paper introduces a novel method that combines a set of compact neural networks with a margin-based cost function to improve the accuracy of open-set face recognition. The method explores additional samples by utilizing external databases to obtain supplementary negative samples or synthesizing them through a feature augmentation approach. Experimental results demonstrate that the method is able to boost closed-set accuracy."
}