{
    "title": "Beyond expectations: Residual Dynamic Mode Decomposition and Variance for Stochastic Dynamical Systems. (arXiv:2308.10697v2 [math.DS] UPDATED)",
    "abstract": "Koopman operators linearize nonlinear dynamical systems, making their spectral information of crucial interest. Numerous algorithms have been developed to approximate these spectral properties, and Dynamic Mode Decomposition (DMD) stands out as the poster child of projection-based methods. Although the Koopman operator itself is linear, the fact that it acts in an infinite-dimensional space of observables poses challenges. These include spurious modes, essential spectra, and the verification of Koopman mode decompositions. While recent work has addressed these challenges for deterministic systems, there remains a notable gap in verified DMD methods for stochastic systems, where the Koopman operator measures the expectation of observables. We show that it is necessary to go beyond expectations to address these issues. By incorporating variance into the Koopman framework, we address these challenges. Through an additional DMD-type matrix, we approximate the sum of a squared residual and ",
    "link": "http://arxiv.org/abs/2308.10697",
    "context": "Title: Beyond expectations: Residual Dynamic Mode Decomposition and Variance for Stochastic Dynamical Systems. (arXiv:2308.10697v2 [math.DS] UPDATED)\nAbstract: Koopman operators linearize nonlinear dynamical systems, making their spectral information of crucial interest. Numerous algorithms have been developed to approximate these spectral properties, and Dynamic Mode Decomposition (DMD) stands out as the poster child of projection-based methods. Although the Koopman operator itself is linear, the fact that it acts in an infinite-dimensional space of observables poses challenges. These include spurious modes, essential spectra, and the verification of Koopman mode decompositions. While recent work has addressed these challenges for deterministic systems, there remains a notable gap in verified DMD methods for stochastic systems, where the Koopman operator measures the expectation of observables. We show that it is necessary to go beyond expectations to address these issues. By incorporating variance into the Koopman framework, we address these challenges. Through an additional DMD-type matrix, we approximate the sum of a squared residual and ",
    "path": "papers/23/08/2308.10697.json",
    "total_tokens": 924,
    "translated_title": "超越预期：随机动力系统的剩余动态模式分解和方差",
    "translated_abstract": "Koopman算符将非线性动力系统线性化，使得其谱信息至关重要。已经开发了许多算法来近似这些谱特性，其中动态模式分解(DMD)是基于投影方法的典型代表。尽管Koopman算符本身是线性的，但它在无穷维的可观测空间中起作用，这带来了挑战，包括虚假模式，本征谱和Koopman模式分解的验证。虽然最近的研究已经解决了确定性系统的这些挑战，但对于随机系统的已验证的DMD方法仍存在明显的差距，其中Koopman算符测量可观测量的期望值。我们表明，需要超越预期来解决这些问题。通过将方差纳入Koopman框架，我们解决了这些挑战。通过额外的类似DMD的矩阵，我们近似一个残差平方和的和以及方差。",
    "tldr": "本文研究了随机动力系统中的动态模式分解(DMD)方法。通过在Koopman框架中引入方差来解决挑战，包括虚假模式和本征谱。结果表明，需要超越预期来有效处理随机系统。",
    "en_tdlr": "This paper investigates the Dynamic Mode Decomposition (DMD) method for stochastic dynamical systems. By incorporating variance into the Koopman framework, the challenges including spurious modes and essential spectra are addressed. The results indicate the necessity to go beyond expectations for effective handling of stochastic systems."
}