{
    "title": "JusticeBot: A Methodology for Building Augmented Intelligence Tools for Laypeople to Increase Access to Justice. (arXiv:2308.02032v1 [cs.CY])",
    "abstract": "Laypeople (i.e. individuals without legal training) may often have trouble resolving their legal problems. In this work, we present the JusticeBot methodology. This methodology can be used to build legal decision support tools, that support laypeople in exploring their legal rights in certain situations, using a hybrid case-based and rule-based reasoning approach. The system ask the user questions regarding their situation and provides them with legal information, references to previous similar cases and possible next steps. This information could potentially help the user resolve their issue, e.g. by settling their case or enforcing their rights in court. We present the methodology for building such tools, which consists of discovering typically applied legal rules from legislation and case law, and encoding previous cases to support the user. We also present an interface to build tools using this methodology and a case study of the first deployed JusticeBot version, focused on landlo",
    "link": "http://arxiv.org/abs/2308.02032",
    "context": "Title: JusticeBot: A Methodology for Building Augmented Intelligence Tools for Laypeople to Increase Access to Justice. (arXiv:2308.02032v1 [cs.CY])\nAbstract: Laypeople (i.e. individuals without legal training) may often have trouble resolving their legal problems. In this work, we present the JusticeBot methodology. This methodology can be used to build legal decision support tools, that support laypeople in exploring their legal rights in certain situations, using a hybrid case-based and rule-based reasoning approach. The system ask the user questions regarding their situation and provides them with legal information, references to previous similar cases and possible next steps. This information could potentially help the user resolve their issue, e.g. by settling their case or enforcing their rights in court. We present the methodology for building such tools, which consists of discovering typically applied legal rules from legislation and case law, and encoding previous cases to support the user. We also present an interface to build tools using this methodology and a case study of the first deployed JusticeBot version, focused on landlo",
    "path": "papers/23/08/2308.02032.json",
    "total_tokens": 910,
    "translated_title": "JusticeBot：一种为非法律专业人士构建增强智能工具以增加公众获取司法资源的方法论",
    "translated_abstract": "非法律专业人士常常在解决法律问题时遇到困难。在这项工作中，我们提出了JusticeBot方法论。该方法论可以用于构建法律决策支持工具，以混合案例和规则推理的方式帮助非法律专业人士探讨他们在特定情况下的法律权利。系统会询问用户与他们情况相关的问题，并为他们提供法律信息、参考以前类似案例和可能的下一步行动。这些信息可能有助于用户解决问题，例如通过和解案件或在法庭上维护自己的权益。我们提出了构建此类工具的方法论，包括从法规和案例法中发现通常适用的法律规则，并对以前的案例进行编码以支持用户。我们还介绍了使用该方法论构建工具的界面，并展示了首个部署的JusticeBot版本的案例研究，重点关注土地租赁。",
    "tldr": "JusticeBot是一种为非法律专业人士提供法律决策支持的增强智能工具，通过混合案例和规则推理的方法，帮助用户探索他们在特定情况下的法律权利，并提供相关的法律信息和案例参考。"
}