{
    "title": "Compressor-Based Classification for Atrial Fibrillation Detection. (arXiv:2308.13328v1 [eess.SP])",
    "abstract": "Atrial fibrillation (AF) is one of the most common arrhythmias with challenging public health implications. Automatic detection of AF episodes is therefore one of the most important tasks in biomedical engineering. In this paper, we apply the recently introduced method of compressor-based text classification to the task of AF detection (binary classification between heart rhythms). We investigate the normalised compression distance applied to $\\Delta$RR and RR-interval sequences, the configuration of the k-Nearest Neighbour classifier, and an optimal window length. We achieve good classification results (avg. sensitivity = 97.1%, avg. specificity = 91.7%, best sensitivity of 99.8%, best specificity of 97.6% with 5-fold cross-validation). Obtained performance is close to the best specialised AF detection algorithms. Our results suggest that gzip classification, originally proposed for texts, is suitable for biomedical data and continuous stochastic sequences in general.",
    "link": "http://arxiv.org/abs/2308.13328",
    "context": "Title: Compressor-Based Classification for Atrial Fibrillation Detection. (arXiv:2308.13328v1 [eess.SP])\nAbstract: Atrial fibrillation (AF) is one of the most common arrhythmias with challenging public health implications. Automatic detection of AF episodes is therefore one of the most important tasks in biomedical engineering. In this paper, we apply the recently introduced method of compressor-based text classification to the task of AF detection (binary classification between heart rhythms). We investigate the normalised compression distance applied to $\\Delta$RR and RR-interval sequences, the configuration of the k-Nearest Neighbour classifier, and an optimal window length. We achieve good classification results (avg. sensitivity = 97.1%, avg. specificity = 91.7%, best sensitivity of 99.8%, best specificity of 97.6% with 5-fold cross-validation). Obtained performance is close to the best specialised AF detection algorithms. Our results suggest that gzip classification, originally proposed for texts, is suitable for biomedical data and continuous stochastic sequences in general.",
    "path": "papers/23/08/2308.13328.json",
    "total_tokens": 947,
    "translated_title": "基于压缩机的房颤检测分类器",
    "translated_abstract": "房颤是最常见的心律失常之一，对公共健康有重大影响。自动检测房颤发作是生物医学工程中最重要的任务之一。本文将最近引入的基于压缩机的文本分类方法应用于房颤检测任务（心律之间的二分类）。我们研究了对ΔRR和RR间期序列应用归一化压缩距离，k-最近邻分类器的配置，以及最佳窗口长度。我们实现了良好的分类结果（平均敏感度=97.1%，平均特异度=91.7%，最佳敏感度为99.8%，最佳特异度为97.6% 5折交叉验证）。所获得的性能接近于最佳的专门的房颤检测算法。我们的结果表明，gzip分类器，最初用于文本，也适用于生物医学数据和连续随机序列。",
    "tldr": "本文研究了基于压缩机的文本分类方法在房颤检测中的应用。通过对心律间隔序列进行压缩距离计算和最近邻分类器模型优化，我们实现了良好的分类性能，接近于最佳的房颤检测算法。这表明gzip分类器适用于生物医学数据和连续随机序列的分类。",
    "en_tdlr": "This paper investigates the application of compressor-based text classification for atrial fibrillation (AF) detection. By calculating compression distances and optimizing the k-Nearest Neighbour classifier for interval sequences, the authors achieved good classification performance close to the best specialized AF detection algorithms. This suggests that the gzip classifier is suitable for classifying biomedical data and continuous stochastic sequences."
}