{
    "title": "Fourier neural operator for real-time simulation of 3D dynamic urban microclimate. (arXiv:2308.03985v1 [cs.LG])",
    "abstract": "Global urbanization has underscored the significance of urban microclimates for human comfort, health, and building/urban energy efficiency. They profoundly influence building design and urban planning as major environmental impacts. Understanding local microclimates is essential for cities to prepare for climate change and effectively implement resilience measures. However, analyzing urban microclimates requires considering a complex array of outdoor parameters within computational domains at the city scale over a longer period than indoors. As a result, numerical methods like Computational Fluid Dynamics (CFD) become computationally expensive when evaluating the impact of urban microclimates. The rise of deep learning techniques has opened new opportunities for accelerating the modeling of complex non-linear interactions and system dynamics. Recently, the Fourier Neural Operator (FNO) has been shown to be very promising in accelerating solving the Partial Differential Equations (PDEs",
    "link": "http://arxiv.org/abs/2308.03985",
    "context": "Title: Fourier neural operator for real-time simulation of 3D dynamic urban microclimate. (arXiv:2308.03985v1 [cs.LG])\nAbstract: Global urbanization has underscored the significance of urban microclimates for human comfort, health, and building/urban energy efficiency. They profoundly influence building design and urban planning as major environmental impacts. Understanding local microclimates is essential for cities to prepare for climate change and effectively implement resilience measures. However, analyzing urban microclimates requires considering a complex array of outdoor parameters within computational domains at the city scale over a longer period than indoors. As a result, numerical methods like Computational Fluid Dynamics (CFD) become computationally expensive when evaluating the impact of urban microclimates. The rise of deep learning techniques has opened new opportunities for accelerating the modeling of complex non-linear interactions and system dynamics. Recently, the Fourier Neural Operator (FNO) has been shown to be very promising in accelerating solving the Partial Differential Equations (PDEs",
    "path": "papers/23/08/2308.03985.json",
    "total_tokens": 892,
    "translated_title": "傅里叶神经运算器用于实时模拟3D动态城市微气候",
    "translated_abstract": "全球城市化凸显了城市微气候对人类舒适度、健康和建筑/城市能效的重要性。它们对建筑设计和城市规划产生重大的环境影响。理解局部微气候对于城市应对气候变化和有效实施弹性措施至关重要。然而，分析城市微气候需要在计算域内考虑复杂的室外参数，涵盖较长时期，并涵盖城市规模。因此，数值方法如计算流体力学（CFD）在评估城市微气候的影响时变得计算复杂。深度学习技术的兴起为加速复杂非线性相互作用和系统动力学建模提供了新机会。最近，傅里叶神经运算器（FNO）在加速解决偏微分方程方面表现出了非常有希望的结果。",
    "tldr": "该论文介绍了傅里叶神经运算器（FNO）用于实时模拟3D动态城市微气候。通过深度学习技术，FNO在加速解决复杂非线性相互作用和系统动力学建模方面表现出很大的潜力。",
    "en_tdlr": "This paper introduces the Fourier Neural Operator (FNO) for real-time simulation of 3D dynamic urban microclimate. Through deep learning techniques, FNO shows great potential in accelerating the modeling of complex non-linear interactions and system dynamics."
}