{
    "title": "Deep Neural Networks Fused with Textures for Image Classification. (arXiv:2308.01813v1 [cs.CV])",
    "abstract": "Fine-grained image classification (FGIC) is a challenging task in computer vision for due to small visual differences among inter-subcategories, but, large intra-class variations. Deep learning methods have achieved remarkable success in solving FGIC. In this paper, we propose a fusion approach to address FGIC by combining global texture with local patch-based information. The first pipeline extracts deep features from various fixed-size non-overlapping patches and encodes features by sequential modelling using the long short-term memory (LSTM). Another path computes image-level textures at multiple scales using the local binary patterns (LBP). The advantages of both streams are integrated to represent an efficient feature vector for image classification. The method is tested on eight datasets representing the human faces, skin lesions, food dishes, marine lives, etc. using four standard backbone CNNs. Our method has attained better classification accuracy over existing methods with no",
    "link": "http://arxiv.org/abs/2308.01813",
    "context": "Title: Deep Neural Networks Fused with Textures for Image Classification. (arXiv:2308.01813v1 [cs.CV])\nAbstract: Fine-grained image classification (FGIC) is a challenging task in computer vision for due to small visual differences among inter-subcategories, but, large intra-class variations. Deep learning methods have achieved remarkable success in solving FGIC. In this paper, we propose a fusion approach to address FGIC by combining global texture with local patch-based information. The first pipeline extracts deep features from various fixed-size non-overlapping patches and encodes features by sequential modelling using the long short-term memory (LSTM). Another path computes image-level textures at multiple scales using the local binary patterns (LBP). The advantages of both streams are integrated to represent an efficient feature vector for image classification. The method is tested on eight datasets representing the human faces, skin lesions, food dishes, marine lives, etc. using four standard backbone CNNs. Our method has attained better classification accuracy over existing methods with no",
    "path": "papers/23/08/2308.01813.json",
    "total_tokens": 933,
    "translated_title": "深度神经网络与纹理相结合的图像分类方法",
    "translated_abstract": "细粒度图像分类是计算机视觉中的一个具有挑战性的任务，由于亚类别之间视觉差异较小，但是类内变化较大。深度学习方法在解决细粒度图像分类方面取得了显著的成功。本文提出了一种融合方法来解决细粒度图像分类问题，通过将全局纹理与基于局部补丁信息的特征相结合。第一个步骤从各种固定大小的非重叠补丁中提取深层特征，并使用长短期记忆（LSTM）进行特征编码。另一个步骤使用局部二值模式（LBP）在多个尺度上计算图像级纹理。两个流的优点被整合到表示高效特征向量的方法中，用于图像分类。该方法在代表人脸、皮肤病变、食物盘子、海洋生物等的八个数据集上经过四个标准骨干卷积神经网络的测试。与现有方法相比，我们的方法在分类准确性上取得了更好的结果。",
    "tldr": "本论文提出了一种将全局纹理与局部补丁信息相结合的新方法，用于解决细粒度图像分类问题。通过提取深层特征和计算图像级纹理，将两者的优势相结合，实现了更高的分类准确性。",
    "en_tdlr": "This paper proposes a new method for fine-grained image classification by combining global texture with local patch-based information. By extracting deep features and computing image-level textures, the advantages of both approaches are integrated to achieve higher classification accuracy."
}