{
    "title": "Adaptive Taxonomy Learning and Historical Patterns Modelling for Patent Classification. (arXiv:2308.05385v1 [cs.AI])",
    "abstract": "Patent classification aims to assign multiple International Patent Classification (IPC) codes to a given patent. Recent methods for automatically classifying patents mainly focus on analyzing the text descriptions of patents. However, apart from the texts, each patent is also associated with some assignees, and the knowledge of their applied patents is often valuable for classification. Furthermore, the hierarchical taxonomy formulated by the IPC system provides important contextual information and enables models to leverage the correlations between IPC codes for more accurate classification. However, existing methods fail to incorporate the above aspects. In this paper, we propose an integrated framework that comprehensively considers the information on patents for patent classification. To be specific, we first present an IPC codes correlations learning module to derive their semantic representations via adaptively passing and aggregating messages within the same level and across dif",
    "link": "http://arxiv.org/abs/2308.05385",
    "context": "Title: Adaptive Taxonomy Learning and Historical Patterns Modelling for Patent Classification. (arXiv:2308.05385v1 [cs.AI])\nAbstract: Patent classification aims to assign multiple International Patent Classification (IPC) codes to a given patent. Recent methods for automatically classifying patents mainly focus on analyzing the text descriptions of patents. However, apart from the texts, each patent is also associated with some assignees, and the knowledge of their applied patents is often valuable for classification. Furthermore, the hierarchical taxonomy formulated by the IPC system provides important contextual information and enables models to leverage the correlations between IPC codes for more accurate classification. However, existing methods fail to incorporate the above aspects. In this paper, we propose an integrated framework that comprehensively considers the information on patents for patent classification. To be specific, we first present an IPC codes correlations learning module to derive their semantic representations via adaptively passing and aggregating messages within the same level and across dif",
    "path": "papers/23/08/2308.05385.json",
    "total_tokens": 832,
    "translated_title": "自适应分类学习和历史模式建模用于专利分类",
    "translated_abstract": "专利分类旨在为给定的专利分配多个国际专利分类（IPC）代码。最近用于自动分类专利的方法主要集中于分析专利的文本描述。然而，除了文本之外，每个专利还与一些权利人相关联，了解他们申请的专利对于分类往往是有价值的。此外，IPC系统制定的层次化分类法提供了重要的上下文信息，并且使模型可以利用IPC代码之间的相关性进行更准确的分类。然而，现有方法未能综合考虑上述方面。在本文中，我们提出了一个综合考虑专利信息的整合框架来进行专利分类。具体而言，我们首先提出了一个IPC代码相关性学习模块，通过在同一层级和不同层级之间自适应地传递和聚合消息，从而得到它们的语义表示。",
    "tldr": "本文介绍了一种综合考虑专利信息的框架，旨在为专利分类提供更准确的方法。该框架综合了专利的文本描述、权利人信息和IPC代码的相关性，从而为专利分类提供更全面的上下文信息。",
    "en_tdlr": "This paper presents an integrated framework that comprehensively considers patent information for more accurate patent classification. The framework combines text descriptions, assignee information, and correlations between IPC codes to provide a more comprehensive contextual information for patent classification."
}