{
    "title": "Simple and Efficient Partial Graph Adversarial Attack: A New Perspective. (arXiv:2308.07834v1 [cs.LG])",
    "abstract": "As the study of graph neural networks becomes more intensive and comprehensive, their robustness and security have received great research interest. The existing global attack methods treat all nodes in the graph as their attack targets. Although existing methods have achieved excellent results, there is still considerable space for improvement. The key problem is that the current approaches rigidly follow the definition of global attacks. They ignore an important issue, i.e., different nodes have different robustness and are not equally resilient to attacks. From a global attacker's view, we should arrange the attack budget wisely, rather than wasting them on highly robust nodes. To this end, we propose a totally new method named partial graph attack (PGA), which selects the vulnerable nodes as attack targets. First, to select the vulnerable items, we propose a hierarchical target selection policy, which allows attackers to only focus on easy-to-attack nodes. Then, we propose a cost-e",
    "link": "http://arxiv.org/abs/2308.07834",
    "context": "Title: Simple and Efficient Partial Graph Adversarial Attack: A New Perspective. (arXiv:2308.07834v1 [cs.LG])\nAbstract: As the study of graph neural networks becomes more intensive and comprehensive, their robustness and security have received great research interest. The existing global attack methods treat all nodes in the graph as their attack targets. Although existing methods have achieved excellent results, there is still considerable space for improvement. The key problem is that the current approaches rigidly follow the definition of global attacks. They ignore an important issue, i.e., different nodes have different robustness and are not equally resilient to attacks. From a global attacker's view, we should arrange the attack budget wisely, rather than wasting them on highly robust nodes. To this end, we propose a totally new method named partial graph attack (PGA), which selects the vulnerable nodes as attack targets. First, to select the vulnerable items, we propose a hierarchical target selection policy, which allows attackers to only focus on easy-to-attack nodes. Then, we propose a cost-e",
    "path": "papers/23/08/2308.07834.json",
    "total_tokens": 897,
    "translated_title": "简单高效的部分图对抗攻击: 一个新的视角",
    "translated_abstract": "随着图神经网络的研究变得更加深入和全面，它们的稳健性和安全性也受到了广泛的关注。现有的全局攻击方法将图中的所有节点视为攻击目标。尽管现有方法已经取得了很好的结果，但仍有很大的改进空间。关键问题是当前方法过于僵化地遵循全局攻击的定义。它们忽视了一个重要问题，即不同的节点具有不同的稳健性，对攻击不具有相等的韧性。从全局攻击者的角度来看，我们应该明智地安排攻击预算，而不是浪费在具有高稳健性的节点上。为此，我们提出了一种全新的方法，命名为部分图攻击(PGA)，它选取了脆弱的节点作为攻击目标。首先，为了选择脆弱的节点，我们提出了一种层次化的目标选择策略，允许攻击者只关注易于攻击的节点。然后，我们提出了一个成本效率的…",
    "tldr": "提出了一种名为部分图攻击 (PGA) 的全新方法，它选取脆弱节点作为攻击目标，相比现有的全局攻击方法有更高的效率和改进的空间。"
}