{
    "title": "Balancing between the Local and Global Structures (LGS) in Graph Embedding. (arXiv:2308.16403v1 [cs.HC])",
    "abstract": "We present a method for balancing between the Local and Global Structures (LGS) in graph embedding, via a tunable parameter. Some embedding methods aim to capture global structures, while others attempt to preserve local neighborhoods. Few methods attempt to do both, and it is not always possible to capture well both local and global information in two dimensions, which is where most graph drawing live. The choice of using a local or a global embedding for visualization depends not only on the task but also on the structure of the underlying data, which may not be known in advance. For a given graph, LGS aims to find a good balance between the local and global structure to preserve. We evaluate the performance of LGS with synthetic and real-world datasets and our results indicate that it is competitive with the state-of-the-art methods, using established quality metrics such as stress and neighborhood preservation. We introduce a novel quality metric, cluster distance preservation, to ",
    "link": "http://arxiv.org/abs/2308.16403",
    "context": "Title: Balancing between the Local and Global Structures (LGS) in Graph Embedding. (arXiv:2308.16403v1 [cs.HC])\nAbstract: We present a method for balancing between the Local and Global Structures (LGS) in graph embedding, via a tunable parameter. Some embedding methods aim to capture global structures, while others attempt to preserve local neighborhoods. Few methods attempt to do both, and it is not always possible to capture well both local and global information in two dimensions, which is where most graph drawing live. The choice of using a local or a global embedding for visualization depends not only on the task but also on the structure of the underlying data, which may not be known in advance. For a given graph, LGS aims to find a good balance between the local and global structure to preserve. We evaluate the performance of LGS with synthetic and real-world datasets and our results indicate that it is competitive with the state-of-the-art methods, using established quality metrics such as stress and neighborhood preservation. We introduce a novel quality metric, cluster distance preservation, to ",
    "path": "papers/23/08/2308.16403.json",
    "total_tokens": 994,
    "translated_title": "在图嵌入中平衡局部和全局结构（LGS）的方法",
    "translated_abstract": "我们提出了一种通过可调参数在图嵌入中平衡局部和全局结构（LGS）的方法。一些嵌入方法旨在捕捉全局结构，而其他方法则试图保留局部邻域。很少有方法尝试同时做到这两点，并且在二维空间中很难很好地捕捉到局部和全局信息，而大部分图的绘制都是在这个空间中进行的。根据任务和底层数据的结构选择使用局部还是全局嵌入来进行可视化不仅取决于任务本身，还取决于底层数据的结构，而这是事先不知道的。对于给定的图，LGS旨在找到一个良好的平衡，以保留局部和全局结构。我们用合成和真实世界的数据集评估了LGS的性能，并且我们的结果表明，它在使用了诸如压力和邻域保持等已建立的质量指标时与最先进的方法相竞争。我们引入了一种新颖的质量指标，聚类距离保持，用于评估嵌入的质量。",
    "tldr": "本论文提出了一种在图嵌入中平衡局部和全局结构的方法，通过可调参数进行调节。我们的结果表明，该方法在合成和真实世界的数据集上与最先进的方法相竞争，并引入了一种新颖的质量指标，聚类距离保持，用于评估嵌入的质量。",
    "en_tdlr": "This paper proposes a method for balancing between local and global structures in graph embedding by using a tunable parameter. The results show that the method is competitive with state-of-the-art methods on synthetic and real-world datasets and introduces a novel quality metric, cluster distance preservation, for evaluating the quality of the embedding."
}