{
    "title": "kTrans: Knowledge-Aware Transformer for Binary Code Embedding. (arXiv:2308.12659v1 [cs.SE])",
    "abstract": "Binary Code Embedding (BCE) has important applications in various reverse engineering tasks such as binary code similarity detection, type recovery, control-flow recovery and data-flow analysis. Recent studies have shown that the Transformer model can comprehend the semantics of binary code to support downstream tasks. However, existing models overlooked the prior knowledge of assembly language. In this paper, we propose a novel Transformer-based approach, namely kTrans, to generate knowledge-aware binary code embedding. By feeding explicit knowledge as additional inputs to the Transformer, and fusing implicit knowledge with a novel pre-training task, kTrans provides a new perspective to incorporating domain knowledge into a Transformer framework. We inspect the generated embeddings with outlier detection and visualization, and also apply kTrans to 3 downstream tasks: Binary Code Similarity Detection (BCSD), Function Type Recovery (FTR) and Indirect Call Recognition (ICR). Evaluation r",
    "link": "http://arxiv.org/abs/2308.12659",
    "context": "Title: kTrans: Knowledge-Aware Transformer for Binary Code Embedding. (arXiv:2308.12659v1 [cs.SE])\nAbstract: Binary Code Embedding (BCE) has important applications in various reverse engineering tasks such as binary code similarity detection, type recovery, control-flow recovery and data-flow analysis. Recent studies have shown that the Transformer model can comprehend the semantics of binary code to support downstream tasks. However, existing models overlooked the prior knowledge of assembly language. In this paper, we propose a novel Transformer-based approach, namely kTrans, to generate knowledge-aware binary code embedding. By feeding explicit knowledge as additional inputs to the Transformer, and fusing implicit knowledge with a novel pre-training task, kTrans provides a new perspective to incorporating domain knowledge into a Transformer framework. We inspect the generated embeddings with outlier detection and visualization, and also apply kTrans to 3 downstream tasks: Binary Code Similarity Detection (BCSD), Function Type Recovery (FTR) and Indirect Call Recognition (ICR). Evaluation r",
    "path": "papers/23/08/2308.12659.json",
    "total_tokens": 920,
    "translated_title": "kTrans:知识感知的二进制代码嵌入",
    "translated_abstract": "二进制代码嵌入(BCE)在各种逆向工程任务中有重要应用，如二进制代码相似性检测、类型恢复、控制流恢复和数据流分析。最近的研究表明，Transformer模型可以理解二进制代码的语义以支持下游任务。然而，现有模型忽视了汇编语言的先验知识。在本文中，我们提出了一种新颖的基于Transformer的方法，即kTrans，用于生成知识感知的二进制代码嵌入。通过将显式知识作为额外的输入馈送给Transformer，并将隐式知识与新颖的预训练任务融合，kTrans为将领域知识合并到Transformer框架中提供了新的视角。我们用离群值检测和可视化来检查生成的嵌入，并将kTrans应用于3个下游任务：二进制代码相似性检测(BCSD)、函数类型恢复(FTR)和间接调用识别(ICR)。",
    "tldr": "kTrans是一种知识感知的二进制代码嵌入方法，通过将显式知识和隐式知识与Transformer模型结合，提供了一种将领域知识融入Transformer框架的新视角。它在二进制代码相似性检测、函数类型恢复和间接调用识别等任务中具有优异的表现。"
}