{
    "title": "IIHT: Medical Report Generation with Image-to-Indicator Hierarchical Transformer. (arXiv:2308.05633v1 [cs.CV])",
    "abstract": "Automated medical report generation has become increasingly important in medical analysis. It can produce computer-aided diagnosis descriptions and thus significantly alleviate the doctors' work. Inspired by the huge success of neural machine translation and image captioning, various deep learning methods have been proposed for medical report generation. However, due to the inherent properties of medical data, including data imbalance and the length and correlation between report sequences, the generated reports by existing methods may exhibit linguistic fluency but lack adequate clinical accuracy. In this work, we propose an image-to-indicator hierarchical transformer (IIHT) framework for medical report generation. It consists of three modules, i.e., a classifier module, an indicator expansion module and a generator module. The classifier module first extracts image features from the input medical images and produces disease-related indicators with their corresponding states. The dise",
    "link": "http://arxiv.org/abs/2308.05633",
    "context": "Title: IIHT: Medical Report Generation with Image-to-Indicator Hierarchical Transformer. (arXiv:2308.05633v1 [cs.CV])\nAbstract: Automated medical report generation has become increasingly important in medical analysis. It can produce computer-aided diagnosis descriptions and thus significantly alleviate the doctors' work. Inspired by the huge success of neural machine translation and image captioning, various deep learning methods have been proposed for medical report generation. However, due to the inherent properties of medical data, including data imbalance and the length and correlation between report sequences, the generated reports by existing methods may exhibit linguistic fluency but lack adequate clinical accuracy. In this work, we propose an image-to-indicator hierarchical transformer (IIHT) framework for medical report generation. It consists of three modules, i.e., a classifier module, an indicator expansion module and a generator module. The classifier module first extracts image features from the input medical images and produces disease-related indicators with their corresponding states. The dise",
    "path": "papers/23/08/2308.05633.json",
    "total_tokens": 844,
    "translated_title": "IIHT: 基于图像到指示器层次Transformer的医学报告生成",
    "translated_abstract": "自动化医学报告生成在医疗分析中变得越来越重要。它可以产生计算机辅助诊断描述，从而极大地减轻医生的工作。受到神经机器翻译和图像描述的巨大成功的启发，已经提出了各种深度学习方法用于医学报告生成。然而，由于医学数据的固有特性，包括数据不平衡、报告序列的长度和相关性，现有方法生成的报告可能在语言流畅性上表现出色，但缺乏足够的临床准确性。在这项工作中，我们提出了一种基于图像到指示器层次Transformer的医学报告生成框架（IIHT）。它包括三个模块，即分类器模块、指示器扩展模块和生成器模块。分类器模块首先从输入的医学图像中提取图像特征，并生成与其对应状态的与疾病相关的指示器。",
    "tldr": "IIHT是一种用于医学报告生成的基于图像到指示器层次Transformer的框架，可以提取医学图像的特征并生成与疾病相关的指示器。"
}