{
    "title": "MDDial: A Multi-turn Differential Diagnosis Dialogue Dataset with Reliability Evaluation. (arXiv:2308.08147v1 [cs.CL])",
    "abstract": "Dialogue systems for Automatic Differential Diagnosis (ADD) have a wide range of real-life applications. These dialogue systems are promising for providing easy access and reducing medical costs. Building end-to-end ADD dialogue systems requires dialogue training datasets. However, to the best of our knowledge, there is no publicly available ADD dialogue dataset in English (although non-English datasets exist). Driven by this, we introduce MDDial, the first differential diagnosis dialogue dataset in English which can aid to build and evaluate end-to-end ADD dialogue systems. Additionally, earlier studies present the accuracy of diagnosis and symptoms either individually or as a combined weighted score. This method overlooks the connection between the symptoms and the diagnosis. We introduce a unified score for the ADD system that takes into account the interplay between symptoms and diagnosis. This score also indicates the system's reliability. To the end, we train two moderate-size of",
    "link": "http://arxiv.org/abs/2308.08147",
    "context": "Title: MDDial: A Multi-turn Differential Diagnosis Dialogue Dataset with Reliability Evaluation. (arXiv:2308.08147v1 [cs.CL])\nAbstract: Dialogue systems for Automatic Differential Diagnosis (ADD) have a wide range of real-life applications. These dialogue systems are promising for providing easy access and reducing medical costs. Building end-to-end ADD dialogue systems requires dialogue training datasets. However, to the best of our knowledge, there is no publicly available ADD dialogue dataset in English (although non-English datasets exist). Driven by this, we introduce MDDial, the first differential diagnosis dialogue dataset in English which can aid to build and evaluate end-to-end ADD dialogue systems. Additionally, earlier studies present the accuracy of diagnosis and symptoms either individually or as a combined weighted score. This method overlooks the connection between the symptoms and the diagnosis. We introduce a unified score for the ADD system that takes into account the interplay between symptoms and diagnosis. This score also indicates the system's reliability. To the end, we train two moderate-size of",
    "path": "papers/23/08/2308.08147.json",
    "total_tokens": 863,
    "translated_title": "MDDial: 一份带有可靠性评估的多轮差异诊断对话数据集",
    "translated_abstract": "自动差异诊断（ADD）的对话系统在现实生活中具有广泛的应用。这些对话系统有望提供便捷访问和降低医疗成本。构建端到端的ADD对话系统需要对话训练数据集。然而，据我们所知，尽管非英语数据集存在，但目前还没有公开可用的英语ADD对话数据集。基于这一背景，我们介绍了MDDial，这是第一个英语差异诊断对话数据集，可以帮助构建和评估端到端的ADD对话系统。此外，之前的研究通常单独或者通过一个综合加权分数来评估诊断准确性和症状。这种方法忽略了症状和诊断之间的连接。我们引入了一种统一的评分方法来衡量ADD系统，考虑了症状和诊断之间的相互作用。该评分还表示系统的可靠性。",
    "tldr": "MDDial是第一个英语差异诊断对话数据集，可以帮助构建和评估端到端的ADD对话系统，并引入了一种统一的评分方法来衡量ADD系统的可靠性。"
}