{
    "title": "Thespian: Multi-Character Text Role-Playing Game Agents. (arXiv:2308.01872v1 [cs.AI])",
    "abstract": "Text-adventure games and text role-playing games are grand challenges for reinforcement learning game playing agents. Text role-playing games are open-ended environments where an agent must faithfully play a particular character. We consider the distinction between characters and actors, where an actor agent has the ability to play multiple characters. We present a framework we call a thespian agent that can learn to emulate multiple characters along with a soft prompt that can be used to direct it as to which character to play at any time. We further describe an attention mechanism that allows the agent to learn new characters that are based on previously learned characters in a few-shot fashion. We show that our agent outperforms the state of the art agent framework in multi-character learning and few-shot learning.",
    "link": "http://arxiv.org/abs/2308.01872",
    "context": "Title: Thespian: Multi-Character Text Role-Playing Game Agents. (arXiv:2308.01872v1 [cs.AI])\nAbstract: Text-adventure games and text role-playing games are grand challenges for reinforcement learning game playing agents. Text role-playing games are open-ended environments where an agent must faithfully play a particular character. We consider the distinction between characters and actors, where an actor agent has the ability to play multiple characters. We present a framework we call a thespian agent that can learn to emulate multiple characters along with a soft prompt that can be used to direct it as to which character to play at any time. We further describe an attention mechanism that allows the agent to learn new characters that are based on previously learned characters in a few-shot fashion. We show that our agent outperforms the state of the art agent framework in multi-character learning and few-shot learning.",
    "path": "papers/23/08/2308.01872.json",
    "total_tokens": 868,
    "translated_title": "Thespian: 多角色文本角色扮演游戏智能体",
    "translated_abstract": "文本冒险游戏和文本角色扮演游戏是强化学习游戏智能体的重大挑战。文本角色扮演游戏是开放式环境，智能体必须忠实地扮演特定角色。文章考虑到了字符和演员之间的区别，演员智能体能够扮演多个角色。我们提出了一个名为\"Thespian\"的框架，使其能够学习模仿多个角色，并使用柔性提示来指导其在任何时候扮演特定角色。此外，我们还描述了一个注意机制，允许智能体以少量示例的方式学习基于先前学习的角色的新角色。我们证明了我们的智能体在多角色学习和少量示例学习方面优于现有的智能体框架。",
    "tldr": "\"Thespian\"是一种多角色的文本角色扮演游戏智能体框架，具有学习模仿多个角色的能力，并通过柔性提示进行指导。该框架还使用注意机制以少量示例学习新角色，并在多角色学习和少量示例学习方面表现优于现有框架。",
    "en_tdlr": "\"Thespian\" is a multi-character text role-playing game agent framework that has the ability to learn to emulate multiple characters and is guided by a soft prompt. The framework also uses an attention mechanism to learn new characters based on a few-shot fashion and outperforms existing frameworks in multi-character learning and few-shot learning."
}