{
    "title": "You talk what you read: Understanding News Comment Behavior by Dispositional and Situational Attribution. (arXiv:2308.02168v1 [cs.CL])",
    "abstract": "Many news comment mining studies are based on the assumption that comment is explicitly linked to the corresponding news. In this paper, we observed that users' comments are also heavily influenced by their individual characteristics embodied by the interaction history. Therefore, we position to understand news comment behavior by considering both the dispositional factors from news interaction history, and the situational factors from corresponding news. A three-part encoder-decoder framework is proposed to model the generative process of news comment. The resultant dispositional and situational attribution contributes to understanding user focus and opinions, which are validated in applications of reader-aware news summarization and news aspect-opinion forecasting.",
    "link": "http://arxiv.org/abs/2308.02168",
    "context": "Title: You talk what you read: Understanding News Comment Behavior by Dispositional and Situational Attribution. (arXiv:2308.02168v1 [cs.CL])\nAbstract: Many news comment mining studies are based on the assumption that comment is explicitly linked to the corresponding news. In this paper, we observed that users' comments are also heavily influenced by their individual characteristics embodied by the interaction history. Therefore, we position to understand news comment behavior by considering both the dispositional factors from news interaction history, and the situational factors from corresponding news. A three-part encoder-decoder framework is proposed to model the generative process of news comment. The resultant dispositional and situational attribution contributes to understanding user focus and opinions, which are validated in applications of reader-aware news summarization and news aspect-opinion forecasting.",
    "path": "papers/23/08/2308.02168.json",
    "total_tokens": 809,
    "translated_title": "你说你读的东西：通过归宿和场合归因来理解新闻评论行为",
    "translated_abstract": "许多新闻评论挖掘研究基于评论与相应新闻的明确关联的假设。在本文中，我们观察到用户的评论也受到其互动历史所体现的个体特征的影响。因此，我们通过考虑来自新闻互动历史的归宿因素和来自相应新闻的场合因素来理解新闻评论行为。我们提出了一个包含三个部分的编码器-解码器框架，用于建模新闻评论的生成过程。所得到的归宿和场合归因有助于理解用户的关注点和观点，并在读者感知新闻摘要和新闻方面-观点预测的应用中进行验证。",
    "tldr": "本文通过考虑来自新闻互动历史的归宿因素和来自相应新闻的场合因素，提出了一个编码器-解码器框架来理解新闻评论行为，同时验证了该方法在读者感知新闻摘要和新闻方面-观点预测中的应用价值。"
}