{
    "title": "Neural Latent Aligner: Cross-trial Alignment for Learning Representations of Complex, Naturalistic Neural Data. (arXiv:2308.06443v1 [cs.LG])",
    "abstract": "Understanding the neural implementation of complex human behaviors is one of the major goals in neuroscience. To this end, it is crucial to find a true representation of the neural data, which is challenging due to the high complexity of behaviors and the low signal-to-ratio (SNR) of the signals. Here, we propose a novel unsupervised learning framework, Neural Latent Aligner (NLA), to find well-constrained, behaviorally relevant neural representations of complex behaviors. The key idea is to align representations across repeated trials to learn cross-trial consistent information. Furthermore, we propose a novel, fully differentiable time warping model (TWM) to resolve the temporal misalignment of trials. When applied to intracranial electrocorticography (ECoG) of natural speaking, our model learns better representations for decoding behaviors than the baseline models, especially in lower dimensional space. The TWM is empirically validated by measuring behavioral coherence between align",
    "link": "http://arxiv.org/abs/2308.06443",
    "context": "Title: Neural Latent Aligner: Cross-trial Alignment for Learning Representations of Complex, Naturalistic Neural Data. (arXiv:2308.06443v1 [cs.LG])\nAbstract: Understanding the neural implementation of complex human behaviors is one of the major goals in neuroscience. To this end, it is crucial to find a true representation of the neural data, which is challenging due to the high complexity of behaviors and the low signal-to-ratio (SNR) of the signals. Here, we propose a novel unsupervised learning framework, Neural Latent Aligner (NLA), to find well-constrained, behaviorally relevant neural representations of complex behaviors. The key idea is to align representations across repeated trials to learn cross-trial consistent information. Furthermore, we propose a novel, fully differentiable time warping model (TWM) to resolve the temporal misalignment of trials. When applied to intracranial electrocorticography (ECoG) of natural speaking, our model learns better representations for decoding behaviors than the baseline models, especially in lower dimensional space. The TWM is empirically validated by measuring behavioral coherence between align",
    "path": "papers/23/08/2308.06443.json",
    "total_tokens": 959,
    "translated_title": "神经潜在对齐器：用于学习复杂自然神经数据表示的跨试验对齐",
    "translated_abstract": "理解复杂人类行为的神经实现是神经科学的主要目标之一。为此，寻找神经数据的真实表示是至关重要的，这由于行为的高复杂性和信号到噪声比（SNR）低而具有挑战性。本文提出了一种新的无监督学习框架，神经潜在对齐器（NLA），用于找到具有行为相关性的受限神经表示。其关键思想是通过对齐重复试验的表示来学习跨试验一致的信息。此外，我们提出了一种新颖的全可微分时间弯曲模型（TWM），以解决试验之间的时间不对齐问题。当应用于自然言语的颅内脑电图（ECoG）时，我们的模型在降维空间中比基准模型更好地学习解码行为的表示。通过测量对齐和行为之间的关联性，TWM在实验证实了。",
    "tldr": "本研究提出了一种名为神经潜在对齐器的框架，用于学习复杂行为的神经表示。通过对齐重复试验的表示，并使用时间弯曲模型解决时间不对齐问题，该模型能够在降维空间中学习到更好的行为解码表示。"
}