{
    "title": "Specious Sites: Tracking the Spread and Sway of Spurious News Stories at Scale. (arXiv:2308.02068v1 [cs.SI])",
    "abstract": "Misinformation, propaganda, and outright lies proliferate on the web, with some narratives having dangerous real-world consequences on public health, elections, and individual safety. However, despite the impact of misinformation, the research community largely lacks automated and programmatic approaches for tracking news narratives across online platforms. In this work, utilizing daily scrapes of 1,404 unreliable news websites, the large-language model MPNet, and DP-Means clustering, we introduce a system to automatically isolate and analyze the narratives spread within online ecosystems. Identifying 55,301 narratives on these 1,404 websites, we describe the most prevalent narratives spread in 2022 and identify the most influential websites that originate and magnify narratives. Finally, we show how our system can be utilized to detect new narratives originating from unreliable news websites and aid fact-checkers like Politifact, Reuters, and AP News in more quickly addressing misinfo",
    "link": "http://arxiv.org/abs/2308.02068",
    "context": "Title: Specious Sites: Tracking the Spread and Sway of Spurious News Stories at Scale. (arXiv:2308.02068v1 [cs.SI])\nAbstract: Misinformation, propaganda, and outright lies proliferate on the web, with some narratives having dangerous real-world consequences on public health, elections, and individual safety. However, despite the impact of misinformation, the research community largely lacks automated and programmatic approaches for tracking news narratives across online platforms. In this work, utilizing daily scrapes of 1,404 unreliable news websites, the large-language model MPNet, and DP-Means clustering, we introduce a system to automatically isolate and analyze the narratives spread within online ecosystems. Identifying 55,301 narratives on these 1,404 websites, we describe the most prevalent narratives spread in 2022 and identify the most influential websites that originate and magnify narratives. Finally, we show how our system can be utilized to detect new narratives originating from unreliable news websites and aid fact-checkers like Politifact, Reuters, and AP News in more quickly addressing misinfo",
    "path": "papers/23/08/2308.02068.json",
    "total_tokens": 1051,
    "translated_title": "虚假网站：在规模上追踪和影响虚假新闻故事的传播",
    "translated_abstract": "虚假信息、宣传和彻头彻尾的谎言在网络上大量传播，其中一些叙述对公共健康、选举和个人安全产生危险的现实影响。然而，尽管虚假信息的影响，研究界在追踪在线平台上的新闻叙述方面主要缺乏自动化和程序化的方法。在这项研究中，利用对1,404个不可靠新闻网站的日常抓取、大型语言模型MPNet和DP-Means聚类，我们介绍了一个系统来自动分离和分析在线生态系统中传播的叙述。我们在这些1,404个网站上识别了55,301个叙述，描述了2022年传播最广泛的叙述，并确定了起源和放大叙述的最具影响力的网站。最后，我们展示了如何利用我们的系统来检测源自不可靠新闻网站的新叙述，并帮助Politifact、路透社和美联社等事实核查组织更快地应对错误信息。",
    "tldr": "本研究利用日常抓取的1,404个不可靠新闻网站以及大型语言模型和聚类算法，提出了一个自动分析网络生态系统中传播的叙述的系统。通过识别55,301个叙述，描述了2022年传播最广泛的叙述，并确定了最具影响力的起源和放大叙述的网站。该系统可用于检测来自不可靠新闻网站的新叙述，并帮助事实核查组织更快地应对错误信息。",
    "en_tdlr": "This paper presents a system that automatically analyzes narratives spread within online ecosystems by utilizing daily scrapes of 1,404 unreliable news websites, a large-language model, and clustering algorithms. It identifies the most prevalent narratives in 2022 and the most influential websites that originate and magnify these narratives. The system can also detect new narratives from unreliable news websites and assist fact-checking organizations in addressing misinformation more quickly."
}