{
    "title": "Network Momentum across Asset Classes. (arXiv:2308.11294v1 [q-fin.PM])",
    "abstract": "We investigate the concept of network momentum, a novel trading signal derived from momentum spillover across assets. Initially observed within the confines of pairwise economic and fundamental ties, such as the stock-bond connection of the same company and stocks linked through supply-demand chains, momentum spillover implies a propagation of momentum risk premium from one asset to another. The similarity of momentum risk premium, exemplified by co-movement patterns, has been spotted across multiple asset classes including commodities, equities, bonds and currencies. However, studying the network effect of momentum spillover across these classes has been challenging due to a lack of readily available common characteristics or economic ties beyond the company level. In this paper, we explore the interconnections of momentum features across a diverse range of 64 continuous future contracts spanning these four classes. We utilise a linear and interpretable graph learning model with minim",
    "link": "http://arxiv.org/abs/2308.11294",
    "context": "Title: Network Momentum across Asset Classes. (arXiv:2308.11294v1 [q-fin.PM])\nAbstract: We investigate the concept of network momentum, a novel trading signal derived from momentum spillover across assets. Initially observed within the confines of pairwise economic and fundamental ties, such as the stock-bond connection of the same company and stocks linked through supply-demand chains, momentum spillover implies a propagation of momentum risk premium from one asset to another. The similarity of momentum risk premium, exemplified by co-movement patterns, has been spotted across multiple asset classes including commodities, equities, bonds and currencies. However, studying the network effect of momentum spillover across these classes has been challenging due to a lack of readily available common characteristics or economic ties beyond the company level. In this paper, we explore the interconnections of momentum features across a diverse range of 64 continuous future contracts spanning these four classes. We utilise a linear and interpretable graph learning model with minim",
    "path": "papers/23/08/2308.11294.json",
    "total_tokens": 891,
    "translated_title": "跨资产类别的网络动量",
    "translated_abstract": "我们研究了网络动量概念，这是一种从资产间动量传递中得出的新型交易信号。起初，我们只在经济和基本联系中观察到这种现象，例如同一公司的股票-债券关系和通过供求链相连的股票，动量传递意味着动量风险溢价从一个资产传递到另一个资产。动量风险溢价的相似性，如共动性模式所示，已经在多个资产类别中被发现，包括商品、股票、债券和货币。然而，由于缺乏公司层面之外的共同特征或经济联系，研究动量传递的网络效应在这些类别之间一直面临挑战。在本文中，我们探索了跨越这四个类别的64个连续期货合约的动量特征之间的相互关系。我们利用了一个线性且可解释的图学习模型，通过最小化损失函数来学习网络中的动量特征。",
    "tldr": "本文研究了跨资产类别的网络动量，通过观察资产间动量传递，提出了一种新的交易信号，并探索了不同类别的连续期货合约之间的动量特征的相互关系。",
    "en_tdlr": "This paper investigates network momentum across asset classes, proposing a novel trading signal derived from momentum spillover. It explores the interconnections of momentum features across different types of continuous future contracts, providing insights into the network effect of momentum spillover."
}