{
    "title": "Quality Diversity under Sparse Reward and Sparse Interaction: Application to Grasping in Robotics. (arXiv:2308.05483v1 [cs.RO])",
    "abstract": "Quality-Diversity (QD) methods are algorithms that aim to generate a set of diverse and high-performing solutions to a given problem. Originally developed for evolutionary robotics, most QD studies are conducted on a limited set of domains - mainly applied to locomotion, where the fitness and the behavior signal are dense. Grasping is a crucial task for manipulation in robotics. Despite the efforts of many research communities, this task is yet to be solved. Grasping cumulates unprecedented challenges in QD literature: it suffers from reward sparsity, behavioral sparsity, and behavior space misalignment. The present work studies how QD can address grasping. Experiments have been conducted on 15 different methods on 10 grasping domains, corresponding to 2 different robot-gripper setups and 5 standard objects. An evaluation framework that distinguishes the evaluation of an algorithm from its internal components has also been proposed for a fair comparison. The obtained results show that ",
    "link": "http://arxiv.org/abs/2308.05483",
    "context": "Title: Quality Diversity under Sparse Reward and Sparse Interaction: Application to Grasping in Robotics. (arXiv:2308.05483v1 [cs.RO])\nAbstract: Quality-Diversity (QD) methods are algorithms that aim to generate a set of diverse and high-performing solutions to a given problem. Originally developed for evolutionary robotics, most QD studies are conducted on a limited set of domains - mainly applied to locomotion, where the fitness and the behavior signal are dense. Grasping is a crucial task for manipulation in robotics. Despite the efforts of many research communities, this task is yet to be solved. Grasping cumulates unprecedented challenges in QD literature: it suffers from reward sparsity, behavioral sparsity, and behavior space misalignment. The present work studies how QD can address grasping. Experiments have been conducted on 15 different methods on 10 grasping domains, corresponding to 2 different robot-gripper setups and 5 standard objects. An evaluation framework that distinguishes the evaluation of an algorithm from its internal components has also been proposed for a fair comparison. The obtained results show that ",
    "path": "papers/23/08/2308.05483.json",
    "total_tokens": 967,
    "translated_title": "机器人抓取中的稀疏奖励和稀疏交互下的优质多样性：应用于机器人学中的抓取任务",
    "translated_abstract": "优质多样性（Quality-Diversity，QD）方法旨在生成一组多样性和高性能的解决方案来解决给定问题。在进化机器人学中最初开发，大多数QD研究都是在有限的一组领域中进行的，主要应用于运动，其中适应度和行为信号是密集的。抓取是机器人操作中的关键任务。尽管许多研究社区的努力，但该任务尚未得到解决。抓取在QD文献中面临着前所未有的挑战：奖励稀疏性，行为稀疏性和行为空间错位。本研究探讨了QD如何解决抓取问题。在10个抓取领域上进行了15种不同方法的实验，对应于2种不同的机器人夹持器设置和5种标准物体。还提出了一个评估框架，以区分算法的评估与其内部组件的评估，以便进行公平比较。得到的结果表明：",
    "tldr": "这项研究针对机器人抓取任务中的奖励稀疏性、行为稀疏性和行为空间错位等挑战，探讨了优质多样性方法解决该问题的能力。通过在多个实验领域中进行实验，结果表明..."
}