{
    "title": "SLPT: Selective Labeling Meets Prompt Tuning on Label-Limited Lesion Segmentation. (arXiv:2308.04911v1 [cs.CV])",
    "abstract": "Medical image analysis using deep learning is often challenged by limited labeled data and high annotation costs. Fine-tuning the entire network in label-limited scenarios can lead to overfitting and suboptimal performance. Recently, prompt tuning has emerged as a more promising technique that introduces a few additional tunable parameters as prompts to a task-agnostic pre-trained model, and updates only these parameters using supervision from limited labeled data while keeping the pre-trained model unchanged. However, previous work has overlooked the importance of selective labeling in downstream tasks, which aims to select the most valuable downstream samples for annotation to achieve the best performance with minimum annotation cost. To address this, we propose a framework that combines selective labeling with prompt tuning (SLPT) to boost performance in limited labels. Specifically, we introduce a feature-aware prompt updater to guide prompt tuning and a TandEm Selective LAbeling (",
    "link": "http://arxiv.org/abs/2308.04911",
    "context": "Title: SLPT: Selective Labeling Meets Prompt Tuning on Label-Limited Lesion Segmentation. (arXiv:2308.04911v1 [cs.CV])\nAbstract: Medical image analysis using deep learning is often challenged by limited labeled data and high annotation costs. Fine-tuning the entire network in label-limited scenarios can lead to overfitting and suboptimal performance. Recently, prompt tuning has emerged as a more promising technique that introduces a few additional tunable parameters as prompts to a task-agnostic pre-trained model, and updates only these parameters using supervision from limited labeled data while keeping the pre-trained model unchanged. However, previous work has overlooked the importance of selective labeling in downstream tasks, which aims to select the most valuable downstream samples for annotation to achieve the best performance with minimum annotation cost. To address this, we propose a framework that combines selective labeling with prompt tuning (SLPT) to boost performance in limited labels. Specifically, we introduce a feature-aware prompt updater to guide prompt tuning and a TandEm Selective LAbeling (",
    "path": "papers/23/08/2308.04911.json",
    "total_tokens": 866,
    "translated_title": "SLPT：选择性标注与提示调整在有限标注的病变分割中的应用",
    "translated_abstract": "使用深度学习进行医学图像分析常常面临有限标注数据和高昂的标注成本的挑战。在有限标注的情况下对整个网络进行微调可能导致过拟合和性能不佳。最近，提示调整作为一种更有前景的技术出现，它向独立于任务的预训练模型引入了一些额外的可调参数作为提示，并仅使用有限的标注数据来更新这些参数，而保持预训练模型不变。然而，以前的研究忽视了选择性标注在下游任务中的重要性，它旨在选择最有价值的下游样本以实现最佳性能和最小的标注成本。为了解决这个问题，我们提出了一个将选择性标注与提示调整相结合的框架(SLPT)，以提升有限标签下的性能。具体地，我们引入了一个基于特征的提示更新器来引导提示调整，并使用TandEm Selective LAbeling方法。",
    "tldr": "在有限标注数据的医学图像分析中存在困难，我们提出了一个新的框架SLPT，将选择性标注和提示调整相结合，以提高性能并减少标注成本。",
    "en_tdlr": "We propose a novel framework, SLPT, that combines selective labeling and prompt tuning to enhance the performance and reduce annotation costs in medical image analysis with limited labeled data."
}