{
    "title": "Task-Aware Machine Unlearning and Its Application in Load Forecasting",
    "abstract": "arXiv:2308.14412v2 Announce Type: replace  Abstract: Data privacy and security have become a non-negligible factor in load forecasting. Previous researches mainly focus on training stage enhancement. However, once the model is trained and deployed, it may need to `forget' (i.e., remove the impact of) part of training data if the these data are found to be malicious or as requested by the data owner. This paper introduces the concept of machine unlearning which is specifically designed to remove the influence of part of the dataset on an already trained forecaster. However, direct unlearning inevitably degrades the model generalization ability. To balance between unlearning completeness and model performance, a performance-aware algorithm is proposed by evaluating the sensitivity of local model parameter change using influence function and sample re-weighting. Furthermore, we observe that the statistical criterion such as mean squared error, cannot fully reflect the operation cost of th",
    "link": "https://arxiv.org/abs/2308.14412",
    "context": "Title: Task-Aware Machine Unlearning and Its Application in Load Forecasting\nAbstract: arXiv:2308.14412v2 Announce Type: replace  Abstract: Data privacy and security have become a non-negligible factor in load forecasting. Previous researches mainly focus on training stage enhancement. However, once the model is trained and deployed, it may need to `forget' (i.e., remove the impact of) part of training data if the these data are found to be malicious or as requested by the data owner. This paper introduces the concept of machine unlearning which is specifically designed to remove the influence of part of the dataset on an already trained forecaster. However, direct unlearning inevitably degrades the model generalization ability. To balance between unlearning completeness and model performance, a performance-aware algorithm is proposed by evaluating the sensitivity of local model parameter change using influence function and sample re-weighting. Furthermore, we observe that the statistical criterion such as mean squared error, cannot fully reflect the operation cost of th",
    "path": "papers/23/08/2308.14412.json",
    "total_tokens": 847,
    "translated_title": "面向任务的机器遗忘及其在负荷预测中的应用",
    "translated_abstract": "数据隐私和安全已成为负载预测中一个不可忽视的因素。以往的研究主要集中在训练阶段的增强上。然而，一旦模型被训练和部署，如果发现这些数据是恶意的或被数据所有者要求，可能需要“遗忘”（即去除）部分训练数据的影响。本文介绍了机器遗忘的概念，其专门设计用于消除已经训练的预测器上数据集的影响。然而，直接遗忘不可避免地会降低模型的泛化能力。为了在遗忘的完整性和模型性能之间取得平衡，提出了一种性能感知算法，通过使用影响函数和样本重新加权来评估本地模型参数变化的敏感性。此外，我们观察到统计准则（如均方误差）无法完全反映操作成本。",
    "tldr": "该论文介绍了一种面向任务的机器遗忘概念，在负荷预测中应用该概念可以平衡遗忘完整性和模型性能之间的关系。"
}