{
    "title": "Unifying Distributionally Robust Optimization via Optimal Transport Theory. (arXiv:2308.05414v1 [math.OC])",
    "abstract": "In the past few years, there has been considerable interest in two prominent approaches for Distributionally Robust Optimization (DRO): Divergence-based and Wasserstein-based methods. The divergence approach models misspecification in terms of likelihood ratios, while the latter models it through a measure of distance or cost in actual outcomes. Building upon these advances, this paper introduces a novel approach that unifies these methods into a single framework based on optimal transport (OT) with conditional moment constraints. Our proposed approach, for example, makes it possible for optimal adversarial distributions to simultaneously perturb likelihood and outcomes, while producing an optimal (in an optimal transport sense) coupling between the baseline model and the adversarial model.Additionally, the paper investigates several duality results and presents tractable reformulations that enhance the practical applicability of this unified framework.",
    "link": "http://arxiv.org/abs/2308.05414",
    "context": "Title: Unifying Distributionally Robust Optimization via Optimal Transport Theory. (arXiv:2308.05414v1 [math.OC])\nAbstract: In the past few years, there has been considerable interest in two prominent approaches for Distributionally Robust Optimization (DRO): Divergence-based and Wasserstein-based methods. The divergence approach models misspecification in terms of likelihood ratios, while the latter models it through a measure of distance or cost in actual outcomes. Building upon these advances, this paper introduces a novel approach that unifies these methods into a single framework based on optimal transport (OT) with conditional moment constraints. Our proposed approach, for example, makes it possible for optimal adversarial distributions to simultaneously perturb likelihood and outcomes, while producing an optimal (in an optimal transport sense) coupling between the baseline model and the adversarial model.Additionally, the paper investigates several duality results and presents tractable reformulations that enhance the practical applicability of this unified framework.",
    "path": "papers/23/08/2308.05414.json",
    "total_tokens": 852,
    "translated_title": "通过最优输运理论统一分布鲁棒优化",
    "translated_abstract": "在过去几年中，对于分布鲁棒优化 (DRO) 有两种主要方法引起了相当大的关注：基于散度和基于Wasserstein的方法。散度方法使用似然比来建模错配，而后者使用实际结果的距离或成本来建模错配。在这些进展的基础上，本文引入了一种新的方法，将这些方法统一到一个基于最优输运 (OT) 和条件矩约束的框架中。例如，我们提出的方法可以使得最优对抗分布同时扰动似然和结果，并在基线模型和对抗模型之间产生一个最优 (从最优输运意义上) 的耦合。此外，本文还研究了几个对偶结果，并提出了可行的改进，增强了这个统一框架的实际适用性。",
    "tldr": "本文通过最优输运理论将分布鲁棒优化的散度方法和Wasserstein方法统一到一个框架中，并且提出了可以同时扰动似然和结果的最优对抗分布。这个统一框架在实际应用中具有较强的可行性和实用性。",
    "en_tdlr": "This paper unifies the divergence-based and Wasserstein-based methods in distributionally robust optimization through optimal transport theory, and introduces a novel approach that allows for simultaneous perturbation of likelihood and outcomes in optimal adversarial distributions. The unified framework is highly feasible and practical in real-world applications."
}