{
    "title": "Multi-Task Hypergraphs for Semi-supervised Learning using Earth Observations. (arXiv:2308.11021v1 [cs.CV])",
    "abstract": "There are many ways of interpreting the world and they are highly interdependent. We exploit such complex dependencies and introduce a powerful multi-task hypergraph, in which every node is a task and different paths through the hypergraph reaching a given task become unsupervised teachers, by forming ensembles that learn to generate reliable pseudolabels for that task. Each hyperedge is part of an ensemble teacher for a given task and it is also a student of the self-supervised hypergraph system. We apply our model to one of the most important problems of our times, that of Earth Observation, which is highly multi-task and it often suffers from missing ground-truth data. By performing extensive experiments on the NASA NEO Dataset, spanning a period of 22 years, we demonstrate the value of our multi-task semi-supervised approach, by consistent improvements over strong baselines and recent work. We also show that the hypergraph can adapt unsupervised to gradual data distribution shifts ",
    "link": "http://arxiv.org/abs/2308.11021",
    "context": "Title: Multi-Task Hypergraphs for Semi-supervised Learning using Earth Observations. (arXiv:2308.11021v1 [cs.CV])\nAbstract: There are many ways of interpreting the world and they are highly interdependent. We exploit such complex dependencies and introduce a powerful multi-task hypergraph, in which every node is a task and different paths through the hypergraph reaching a given task become unsupervised teachers, by forming ensembles that learn to generate reliable pseudolabels for that task. Each hyperedge is part of an ensemble teacher for a given task and it is also a student of the self-supervised hypergraph system. We apply our model to one of the most important problems of our times, that of Earth Observation, which is highly multi-task and it often suffers from missing ground-truth data. By performing extensive experiments on the NASA NEO Dataset, spanning a period of 22 years, we demonstrate the value of our multi-task semi-supervised approach, by consistent improvements over strong baselines and recent work. We also show that the hypergraph can adapt unsupervised to gradual data distribution shifts ",
    "path": "papers/23/08/2308.11021.json",
    "total_tokens": 961,
    "translated_title": "多任务超图用于利用地球观测进行半监督学习",
    "translated_abstract": "世界有许多不同的解释方式，它们之间高度相互依赖。我们利用这种复杂的依赖关系，引入了一个强大的多任务超图，其中每个节点是一个任务，通过超图中到达给定任务的不同路径形成无监督学习的教师，通过形成学习可靠伪标签的集成。每个超边是给定任务的一个集成教师的一部分，并且还是自监督超图系统的学生。我们将我们的模型应用于时下最重要的问题之一地球观测，这是一个高度多任务的问题，往往存在缺少地面真实数据的情况。通过在NASA NEO数据集上进行了为期22年的广泛实验证明了我们的多任务半监督方法的价值，通过相对强基线和最新工作的一贯改进。我们还展示了超图可以自适应地无监督地适应逐渐的数据分布变化。",
    "tldr": "本文介绍了使用多任务超图进行半监督学习的方法，并将其应用于地球观测问题。通过形成集成教师并生成可靠伪标签，我们的方法在NASA NEO数据集上表现出相对强基线和最新工作的改进。此外，我们展示了超图可以自适应地无监督地适应逐渐的数据分布变化。"
}