{
    "title": "HAlf-MAsked Model for Named Entity Sentiment analysis. (arXiv:2308.15793v1 [cs.CL])",
    "abstract": "Named Entity Sentiment analysis (NESA) is one of the most actively developing application domains in Natural Language Processing (NLP). Social media NESA is a significant field of opinion analysis since detecting and tracking sentiment trends in the news flow is crucial for building various analytical systems and monitoring the media image of specific people or companies. In this paper, we study different transformers-based solutions NESA in RuSentNE-23 evaluation. Despite the effectiveness of the BERT-like models, they can still struggle with certain challenges, such as overfitting, which appeared to be the main obstacle in achieving high accuracy on the RuSentNE-23 data. We present several approaches to overcome this problem, among which there is a novel technique of additional pass over given data with masked entity before making the final prediction so that we can combine logits from the model when it knows the exact entity it predicts sentiment for and when it does not. Utilizing ",
    "link": "http://arxiv.org/abs/2308.15793",
    "context": "Title: HAlf-MAsked Model for Named Entity Sentiment analysis. (arXiv:2308.15793v1 [cs.CL])\nAbstract: Named Entity Sentiment analysis (NESA) is one of the most actively developing application domains in Natural Language Processing (NLP). Social media NESA is a significant field of opinion analysis since detecting and tracking sentiment trends in the news flow is crucial for building various analytical systems and monitoring the media image of specific people or companies. In this paper, we study different transformers-based solutions NESA in RuSentNE-23 evaluation. Despite the effectiveness of the BERT-like models, they can still struggle with certain challenges, such as overfitting, which appeared to be the main obstacle in achieving high accuracy on the RuSentNE-23 data. We present several approaches to overcome this problem, among which there is a novel technique of additional pass over given data with masked entity before making the final prediction so that we can combine logits from the model when it knows the exact entity it predicts sentiment for and when it does not. Utilizing ",
    "path": "papers/23/08/2308.15793.json",
    "total_tokens": 962,
    "translated_title": "HAlf-MAsked模型用于命名实体情感分析",
    "translated_abstract": "命名实体情感分析（NESA）是自然语言处理（NLP）中最活跃的应用领域之一。社交媒体NESA是意见分析的重要领域，因为检测和跟踪新闻流中的情感趋势对于构建各种分析系统和监测特定人物或公司的媒体形象至关重要。在本文中，我们研究了基于transformer的不同解决方案在RuSentNE-23评估中的NESA。尽管BERT等模型的效果很好，但它们仍然可能在某些挑战上遇到困难，例如过拟合问题，这是在RuSentNE-23数据上实现高准确性的主要障碍。我们提出了几种方法来解决这个问题，其中包括一种新颖的技术，在最终预测之前，对给定数据进行额外的掩码实体传递，以便在模型知道预测情感的确切实体和不知道的情况下，可以合并来自模型的逻辑。利用",
    "tldr": "在命名实体情感分析中，研究了解决基于BERT模型过拟合问题的多种方法，包括一种新颖的技术，在最终预测之前，对给定数据进行额外的掩码实体传递，以便在模型知道预测情感的确切实体和不知道的情况下，可以合并来自模型的逻辑。"
}