{
    "title": "PFL-GAN: When Client Heterogeneity Meets Generative Models in Personalized Federated Learning. (arXiv:2308.12454v1 [cs.LG])",
    "abstract": "Recent advances of generative learning models are accompanied by the growing interest in federated learning (FL) based on generative adversarial network (GAN) models. In the context of FL, GAN can capture the underlying client data structure, and regenerate samples resembling the original data distribution without compromising the private raw data. Although most existing GAN-based FL works focus on training a global model, Personalized FL (PFL) sometimes can be more effective in view of client data heterogeneity in terms of distinct data sample distributions, feature spaces, and labels. To cope with client heterogeneity in GAN-based FL, we propose a novel GAN sharing and aggregation strategy for PFL. The proposed PFL-GAN addresses the client heterogeneity in different scenarios. More specially, we first learn the similarity among clients and then develop an weighted collaborative data aggregation. The empirical results through the rigorous experimentation on several well-known datasets",
    "link": "http://arxiv.org/abs/2308.12454",
    "context": "Title: PFL-GAN: When Client Heterogeneity Meets Generative Models in Personalized Federated Learning. (arXiv:2308.12454v1 [cs.LG])\nAbstract: Recent advances of generative learning models are accompanied by the growing interest in federated learning (FL) based on generative adversarial network (GAN) models. In the context of FL, GAN can capture the underlying client data structure, and regenerate samples resembling the original data distribution without compromising the private raw data. Although most existing GAN-based FL works focus on training a global model, Personalized FL (PFL) sometimes can be more effective in view of client data heterogeneity in terms of distinct data sample distributions, feature spaces, and labels. To cope with client heterogeneity in GAN-based FL, we propose a novel GAN sharing and aggregation strategy for PFL. The proposed PFL-GAN addresses the client heterogeneity in different scenarios. More specially, we first learn the similarity among clients and then develop an weighted collaborative data aggregation. The empirical results through the rigorous experimentation on several well-known datasets",
    "path": "papers/23/08/2308.12454.json",
    "total_tokens": 901,
    "translated_title": "PFL-GAN：当客户异质性与生成模型相遇在个性化联合学习中",
    "translated_abstract": "近期生成学习模型的进展伴随着对基于生成对抗网络（GAN）模型的联合学习（FL）的日益关注。在FL的背景下，GAN可以捕捉底层客户数据结构，并重新生成类似于原始数据分布的样本，而不损害私有原始数据。虽然大多数现有基于GAN的FL工作集中在训练全局模型上，但在客户数据异质性方面，个性化FL（PFL）有时可能更加有效，因为它涉及到不同数据样本分布、特征空间和标签。为了应对GAN-based FL中的客户异质性，我们提出了一种针对PFL的新型GAN共享和聚合策略。所提出的PFL-GAN解决了不同场景下的客户异质性问题。具体而言，我们首先学习客户之间的相似度，然后开发一个加权的协同数据聚合方法。通过在几个知名数据集上进行严格的实验来验证此方法的实际效果。",
    "tldr": "PFL-GAN是一种在个性化联合学习中解决客户异质性的新型GAN共享和聚合策略，通过学习客户间的相似度并采用加权协同数据聚合方法来实现。",
    "en_tdlr": "PFL-GAN is a novel GAN sharing and aggregation strategy in personalized federated learning that addresses client heterogeneity by learning clients' similarity and implementing weighted collaborative data aggregation."
}