{
    "title": "Discrimination and Constraints: Evidence from The Voice. (arXiv:2308.11922v1 [econ.GN])",
    "abstract": "Gender discrimination in the hiring process is one significant factor contributing to labor market disparities. However, there is little evidence on the extent to which gender bias by hiring managers is responsible for these disparities. In this paper, I exploit a unique dataset of blind auditions of The Voice television show as an experiment to identify own gender bias in the selection process. The first televised stage audition, in which four noteworthy recording artists are coaches, listens to the contestants blindly (chairs facing away from the stage) to avoid seeing the contestant. Using a difference-in-differences estimation strategy, a coach (hiring person) is demonstrably exogenous with respect to the artist's gender, I find that artists are 4.5 percentage points (11 percent) more likely to be selected when they are the recipients of an opposite-gender coach. I also utilize the machine-learning approach in Athey et al. (2018) to include heterogeneity from team gender compositio",
    "link": "http://arxiv.org/abs/2308.11922",
    "context": "Title: Discrimination and Constraints: Evidence from The Voice. (arXiv:2308.11922v1 [econ.GN])\nAbstract: Gender discrimination in the hiring process is one significant factor contributing to labor market disparities. However, there is little evidence on the extent to which gender bias by hiring managers is responsible for these disparities. In this paper, I exploit a unique dataset of blind auditions of The Voice television show as an experiment to identify own gender bias in the selection process. The first televised stage audition, in which four noteworthy recording artists are coaches, listens to the contestants blindly (chairs facing away from the stage) to avoid seeing the contestant. Using a difference-in-differences estimation strategy, a coach (hiring person) is demonstrably exogenous with respect to the artist's gender, I find that artists are 4.5 percentage points (11 percent) more likely to be selected when they are the recipients of an opposite-gender coach. I also utilize the machine-learning approach in Athey et al. (2018) to include heterogeneity from team gender compositio",
    "path": "papers/23/08/2308.11922.json",
    "total_tokens": 888,
    "translated_title": "歧视和限制：来自The Voice的证据",
    "translated_abstract": "性别歧视在雇佣过程中是导致劳动力市场不平等的一个重要因素。然而，关于雇佣经理人的性别偏见在这些不平等中起到了多大程度的作用，目前还没有太多证据。本文利用The Voice电视节目的独特数据集，将其作为一个实验，以识别选择过程中自身的性别偏见。在第一轮电视台面试中，有四位著名录音艺术家担任导师，他们会盲选（椅子背对舞台）以避免看到选手。通过差异法估计策略，可以证明教练（雇佣人）和艺术家的性别是外生的，我发现当选手是异性教练的接受者时，他们更有4.5个百分点（11％）的可能性被选中。我还使用Athey等人（2018）的机器学习方法，包括团队性别组成的异质性。",
    "tldr": "通过The Voice电视节目的盲选实验，发现雇佣过程中的性别偏见导致了劳动力市场的不平等，当选手是异性教练的接受者时，有更大的可能被选中。",
    "en_tdlr": "Gender bias in the hiring process contributes to labor market disparities. This paper uses blind auditions from The Voice to identify own gender bias, finding that artists have a higher chance of selection when they have an opposite-gender coach."
}