{
    "title": "MT-IceNet -- A Spatial and Multi-Temporal Deep Learning Model for Arctic Sea Ice Forecasting. (arXiv:2308.04511v1 [physics.ao-ph])",
    "abstract": "Arctic amplification has altered the climate patterns both regionally and globally, resulting in more frequent and more intense extreme weather events in the past few decades. The essential part of Arctic amplification is the unprecedented sea ice loss as demonstrated by satellite observations. Accurately forecasting Arctic sea ice from sub-seasonal to seasonal scales has been a major research question with fundamental challenges at play. In addition to physics-based Earth system models, researchers have been applying multiple statistical and machine learning models for sea ice forecasting. Looking at the potential of data-driven approaches to study sea ice variations, we propose MT-IceNet - a UNet based spatial and multi-temporal (MT) deep learning model for forecasting Arctic sea ice concentration (SIC). The model uses an encoder-decoder architecture with skip connections and processes multi-temporal input streams to regenerate spatial maps at future timesteps. Using bi-monthly and m",
    "link": "http://arxiv.org/abs/2308.04511",
    "context": "Title: MT-IceNet -- A Spatial and Multi-Temporal Deep Learning Model for Arctic Sea Ice Forecasting. (arXiv:2308.04511v1 [physics.ao-ph])\nAbstract: Arctic amplification has altered the climate patterns both regionally and globally, resulting in more frequent and more intense extreme weather events in the past few decades. The essential part of Arctic amplification is the unprecedented sea ice loss as demonstrated by satellite observations. Accurately forecasting Arctic sea ice from sub-seasonal to seasonal scales has been a major research question with fundamental challenges at play. In addition to physics-based Earth system models, researchers have been applying multiple statistical and machine learning models for sea ice forecasting. Looking at the potential of data-driven approaches to study sea ice variations, we propose MT-IceNet - a UNet based spatial and multi-temporal (MT) deep learning model for forecasting Arctic sea ice concentration (SIC). The model uses an encoder-decoder architecture with skip connections and processes multi-temporal input streams to regenerate spatial maps at future timesteps. Using bi-monthly and m",
    "path": "papers/23/08/2308.04511.json",
    "total_tokens": 936,
    "translated_title": "MT-IceNet - 一种用于北极海冰预测的空间和多时序深度学习模型",
    "translated_abstract": "北极放大已经改变了区域和全球的气候模式，导致过去几十年中更频繁和更强烈的极端天气事件。北极放大的关键部分是卫星观测所证实的前所未有的海冰消失。准确地从次季节到季节性尺度预测北极海冰一直是一个重要的研究问题，存在根本性挑战。除了基于物理学的地球系统模型，研究者一直应用多种统计和机器学习模型进行海冰预测。回顾数据驱动方法研究海冰变化的潜力，我们提出了MT-IceNet - 一种基于UNet的空间和多时序深度学习模型，用于预测北极海冰浓度（SIC）。该模型采用编码器-解码器架构，具有跳跃连接，并处理多时序输入流以在未来的时间步骤中重新生成空间地图。",
    "tldr": "提出了一种名为MT-IceNet的深度学习模型，用于预测北极海冰浓度。该模型采用了空间和多时序结构，利用编码器-解码器架构和跳跃连接处理多时序输入流，并可生成未来时间步骤的空间地图。",
    "en_tdlr": "A deep learning model called MT-IceNet is proposed for forecasting Arctic sea ice concentration. The model utilizes a spatial and multi-temporal structure, employing an encoder-decoder architecture with skip connections to process multi-temporal input streams and generate spatial maps for future time steps."
}