{
    "title": "Cooperative Multi-Type Multi-Agent Deep Reinforcement Learning for Resource Management in Space-Air-Ground Integrated Networks. (arXiv:2308.03995v1 [cs.MA])",
    "abstract": "The Space-Air-Ground Integrated Network (SAGIN), integrating heterogeneous devices including low earth orbit (LEO) satellites, unmanned aerial vehicles (UAVs), and ground users (GUs), holds significant promise for advancing smart city applications. However, resource management of the SAGIN is a challenge requiring urgent study in that inappropriate resource management will cause poor data transmission, and hence affect the services in smart cities. In this paper, we develop a comprehensive SAGIN system that encompasses five distinct communication links and propose an efficient cooperative multi-type multi-agent deep reinforcement learning (CMT-MARL) method to address the resource management issue. The experimental results highlight the efficacy of the proposed CMT-MARL, as evidenced by key performance indicators such as the overall transmission rate and transmission success rate. These results underscore the potential value and feasibility of future implementation of the SAGIN.",
    "link": "http://arxiv.org/abs/2308.03995",
    "context": "Title: Cooperative Multi-Type Multi-Agent Deep Reinforcement Learning for Resource Management in Space-Air-Ground Integrated Networks. (arXiv:2308.03995v1 [cs.MA])\nAbstract: The Space-Air-Ground Integrated Network (SAGIN), integrating heterogeneous devices including low earth orbit (LEO) satellites, unmanned aerial vehicles (UAVs), and ground users (GUs), holds significant promise for advancing smart city applications. However, resource management of the SAGIN is a challenge requiring urgent study in that inappropriate resource management will cause poor data transmission, and hence affect the services in smart cities. In this paper, we develop a comprehensive SAGIN system that encompasses five distinct communication links and propose an efficient cooperative multi-type multi-agent deep reinforcement learning (CMT-MARL) method to address the resource management issue. The experimental results highlight the efficacy of the proposed CMT-MARL, as evidenced by key performance indicators such as the overall transmission rate and transmission success rate. These results underscore the potential value and feasibility of future implementation of the SAGIN.",
    "path": "papers/23/08/2308.03995.json",
    "total_tokens": 849,
    "translated_title": "合作式多类型多智能体深度强化学习在空天地一体化网络资源管理中的应用",
    "translated_abstract": "空天地一体化网络（SAGIN）将包括低地球轨道卫星（LEO）、无人机（UAV）和地面用户（GU）在内的异构设备整合起来，有望推动智能城市应用的发展。然而，SAGIN的资源管理是一个挑战，需要紧急研究，因为不恰当的资源管理会导致数据传输质量差，进而影响智能城市的服务。本文开发了一个综合的SAGIN系统，包括五种不同的通信链路，并提出了一种高效的合作式多类型多智能体深度强化学习（CMT-MARL）方法来解决资源管理问题。实验结果突出了所提出的CMT-MARL的有效性，如整体传输速率和传输成功率等关键性能指标。这些结果强调了未来SAGIN实施的潜在价值和可行性。",
    "tldr": "本文提出了一种合作式多类型多智能体深度强化学习方法，应用于空天地一体化网络的资源管理，实验结果表明其有效性和潜在价值。",
    "en_tdlr": "This paper proposes a cooperative multi-type multi-agent deep reinforcement learning method for resource management in space-air-ground integrated networks, and experimental results demonstrate its effectiveness and potential value."
}