{
    "title": "Deep Learning for Morphological Identification of Extended Radio Galaxies using Weak Labels. (arXiv:2308.05166v1 [astro-ph.IM])",
    "abstract": "The present work discusses the use of a weakly-supervised deep learning algorithm that reduces the cost of labelling pixel-level masks for complex radio galaxies with multiple components. The algorithm is trained on weak class-level labels of radio galaxies to get class activation maps (CAMs). The CAMs are further refined using an inter-pixel relations network (IRNet) to get instance segmentation masks over radio galaxies and the positions of their infrared hosts. We use data from the Australian Square Kilometre Array Pathfinder (ASKAP) telescope, specifically the Evolutionary Map of the Universe (EMU) Pilot Survey, which covered a sky area of 270 square degrees with an RMS sensitivity of 25-35 $\\mu$Jy/beam. We demonstrate that weakly-supervised deep learning algorithms can achieve high accuracy in predicting pixel-level information, including masks for the extended radio emission encapsulating all galaxy components and the positions of the infrared host galaxies. We evaluate the perfo",
    "link": "http://arxiv.org/abs/2308.05166",
    "context": "Title: Deep Learning for Morphological Identification of Extended Radio Galaxies using Weak Labels. (arXiv:2308.05166v1 [astro-ph.IM])\nAbstract: The present work discusses the use of a weakly-supervised deep learning algorithm that reduces the cost of labelling pixel-level masks for complex radio galaxies with multiple components. The algorithm is trained on weak class-level labels of radio galaxies to get class activation maps (CAMs). The CAMs are further refined using an inter-pixel relations network (IRNet) to get instance segmentation masks over radio galaxies and the positions of their infrared hosts. We use data from the Australian Square Kilometre Array Pathfinder (ASKAP) telescope, specifically the Evolutionary Map of the Universe (EMU) Pilot Survey, which covered a sky area of 270 square degrees with an RMS sensitivity of 25-35 $\\mu$Jy/beam. We demonstrate that weakly-supervised deep learning algorithms can achieve high accuracy in predicting pixel-level information, including masks for the extended radio emission encapsulating all galaxy components and the positions of the infrared host galaxies. We evaluate the perfo",
    "path": "papers/23/08/2308.05166.json",
    "total_tokens": 873,
    "translated_title": "使用弱标签进行扩展射电星系形态识别的深度学习",
    "translated_abstract": "本研究讨论了一种弱监督深度学习算法的使用，该算法降低了对具有多个组成部分的复杂射电星系进行像素级标签标注的成本。该算法通过使用射电星系的弱类别级别标签训练得到类激活图（CAMs）。然后使用像素间关系网络（IRNet）进一步优化这些CAMs，得到射电星系的实例分割掩膜以及它们的红外主机位置。我们使用了来自澳大利亚平方公里阵（ASKAP）望远镜的数据，特别是演化宇宙图（EMU）试验，该试验覆盖了270平方度的天区，RMS灵敏度为25-35微Jy/beam。我们证明了弱监督深度学习算法可以在预测像素级信息方面取得高准确性，包括扩展射电辐射的掩膜和红外主机星系的位置。",
    "tldr": "本研究提出了一种使用弱标签进行扩展射电星系形态识别的深度学习算法，降低了标注成本并取得了高准确性。",
    "en_tdlr": "This study proposes a deep learning algorithm for morphological identification of extended radio galaxies using weak labels, reducing the labeling cost and achieving high accuracy."
}