{
    "title": "A Novel Temporal Multi-Gate Mixture-of-Experts Approach for Vehicle Trajectory and Driving Intention Prediction. (arXiv:2308.00533v1 [cs.LG])",
    "abstract": "Accurate Vehicle Trajectory Prediction is critical for automated vehicles and advanced driver assistance systems. Vehicle trajectory prediction consists of two essential tasks, i.e., longitudinal position prediction and lateral position prediction. There is a significant correlation between driving intentions and vehicle motion. In existing work, the three tasks are often conducted separately without considering the relationships between the longitudinal position, lateral position, and driving intention. In this paper, we propose a novel Temporal Multi-Gate Mixture-of-Experts (TMMOE) model for simultaneously predicting the vehicle trajectory and driving intention. The proposed model consists of three layers: a shared layer, an expert layer, and a fully connected layer. In the model, the shared layer utilizes Temporal Convolutional Networks (TCN) to extract temporal features. Then the expert layer is built to identify different information according to the three tasks. Moreover, the ful",
    "link": "http://arxiv.org/abs/2308.00533",
    "context": "Title: A Novel Temporal Multi-Gate Mixture-of-Experts Approach for Vehicle Trajectory and Driving Intention Prediction. (arXiv:2308.00533v1 [cs.LG])\nAbstract: Accurate Vehicle Trajectory Prediction is critical for automated vehicles and advanced driver assistance systems. Vehicle trajectory prediction consists of two essential tasks, i.e., longitudinal position prediction and lateral position prediction. There is a significant correlation between driving intentions and vehicle motion. In existing work, the three tasks are often conducted separately without considering the relationships between the longitudinal position, lateral position, and driving intention. In this paper, we propose a novel Temporal Multi-Gate Mixture-of-Experts (TMMOE) model for simultaneously predicting the vehicle trajectory and driving intention. The proposed model consists of three layers: a shared layer, an expert layer, and a fully connected layer. In the model, the shared layer utilizes Temporal Convolutional Networks (TCN) to extract temporal features. Then the expert layer is built to identify different information according to the three tasks. Moreover, the ful",
    "path": "papers/23/08/2308.00533.json",
    "total_tokens": 956,
    "translated_title": "一种用于车辆轨迹和驾驶意图预测的新颖时序多门专家混合模型方法",
    "translated_abstract": "准确的车辆轨迹预测对于自动驾驶车辆和先进驾驶辅助系统至关重要。车辆轨迹预测包括纵向位置预测和横向位置预测这两个关键任务。驾驶意图与车辆运动之间存在着重要的相关性。现有的研究往往将这三个任务分开进行，没有考虑纵向位置、横向位置和驾驶意图之间的关系。本文提出了一种新颖的时序多门专家混合模型（TMMOE），以同时预测车辆轨迹和驾驶意图。该模型由共享层、专家层和全连接层组成。在模型中，共享层利用时序卷积网络（TCN）提取时序特征。然后，专家层根据三个任务的需要进行不同的信息识别。此外，全连接层用于预测车辆轨迹和驾驶意图之间的关系。",
    "tldr": "本文提出了一种新颖的时序多门专家混合模型（TMMOE），以同时预测车辆轨迹和驾驶意图。该模型利用共享层和专家层进行特征提取和信息识别，实现了对纵向位置、横向位置和驾驶意图之间关系的综合预测。",
    "en_tdlr": "This paper proposes a novel Temporal Multi-Gate Mixture-of-Experts (TMMOE) model for simultaneously predicting vehicle trajectory and driving intention. The model utilizes shared and expert layers for feature extraction and information identification, achieving comprehensive prediction of the relationships between longitudinal position, lateral position, and driving intention."
}