{
    "title": "Boosting Multi-modal Model Performance with Adaptive Gradient Modulation. (arXiv:2308.07686v1 [cs.CV])",
    "abstract": "While the field of multi-modal learning keeps growing fast, the deficiency of the standard joint training paradigm has become clear through recent studies. They attribute the sub-optimal performance of the jointly trained model to the modality competition phenomenon. Existing works attempt to improve the jointly trained model by modulating the training process. Despite their effectiveness, those methods can only apply to late fusion models. More importantly, the mechanism of the modality competition remains unexplored. In this paper, we first propose an adaptive gradient modulation method that can boost the performance of multi-modal models with various fusion strategies. Extensive experiments show that our method surpasses all existing modulation methods. Furthermore, to have a quantitative understanding of the modality competition and the mechanism behind the effectiveness of our modulation method, we introduce a novel metric to measure the competition strength. This metric is built ",
    "link": "http://arxiv.org/abs/2308.07686",
    "context": "Title: Boosting Multi-modal Model Performance with Adaptive Gradient Modulation. (arXiv:2308.07686v1 [cs.CV])\nAbstract: While the field of multi-modal learning keeps growing fast, the deficiency of the standard joint training paradigm has become clear through recent studies. They attribute the sub-optimal performance of the jointly trained model to the modality competition phenomenon. Existing works attempt to improve the jointly trained model by modulating the training process. Despite their effectiveness, those methods can only apply to late fusion models. More importantly, the mechanism of the modality competition remains unexplored. In this paper, we first propose an adaptive gradient modulation method that can boost the performance of multi-modal models with various fusion strategies. Extensive experiments show that our method surpasses all existing modulation methods. Furthermore, to have a quantitative understanding of the modality competition and the mechanism behind the effectiveness of our modulation method, we introduce a novel metric to measure the competition strength. This metric is built ",
    "path": "papers/23/08/2308.07686.json",
    "total_tokens": 832,
    "translated_title": "Boosting Multi-modal Model Performance with Adaptive Gradient Modulation. (arXiv:2308.07686v1 [cs.CV])",
    "translated_abstract": "尽管多模态学习领域发展迅速，但近期研究表明标准的联合训练模式的缺陷已经变得明显。研究指出联合训练模型性能亚优的原因是模态竞争现象。现有方法试图通过调控训练过程来改善联合训练模型。尽管这些方法有效，但只能应用于后期融合模型。更重要的是，模态竞争的机制仍未被探究。本文首先提出了一种自适应梯度调节方法，可以提升具有不同融合策略的多模态模型的性能。大量实验证明了我们的方法超越了所有现有的调控方法。此外，为了对模态竞争以及我们调节方法效果背后的机制有量化的理解，我们引入了一种新的度量竞争强度的指标。该指标被构建",
    "tldr": "本论文提出了一种自适应梯度调节方法，能够提升多模态模型的性能，并引入了一种新的度量竞争强度的指标。"
}