{
    "title": "Model of models -- Part 1. (arXiv:2308.04600v1 [cs.AI])",
    "abstract": "This paper proposes a new cognitive model, acting as the main component of an AGI agent. The model is introduced in its mature intelligence state, and as an extension of previous models, DENN, and especially AKREM, by including operational models (frames/classes) and will. This model's core assumption is that cognition is about operating on accumulated knowledge, with the guidance of an appropriate will. Also, we assume that the actions, part of knowledge, are learning to be aligned with will, during the evolution phase that precedes the mature intelligence state. In addition, this model is mainly based on the duality principle in every known intelligent aspect, such as exhibiting both top-down and bottom-up model learning, generalization verse specialization, and more. Furthermore, a holistic approach is advocated for AGI designing, and cognition under constraints or efficiency is proposed, in the form of reusability and simplicity. Finally, reaching this mature state is described via",
    "link": "http://arxiv.org/abs/2308.04600",
    "context": "Title: Model of models -- Part 1. (arXiv:2308.04600v1 [cs.AI])\nAbstract: This paper proposes a new cognitive model, acting as the main component of an AGI agent. The model is introduced in its mature intelligence state, and as an extension of previous models, DENN, and especially AKREM, by including operational models (frames/classes) and will. This model's core assumption is that cognition is about operating on accumulated knowledge, with the guidance of an appropriate will. Also, we assume that the actions, part of knowledge, are learning to be aligned with will, during the evolution phase that precedes the mature intelligence state. In addition, this model is mainly based on the duality principle in every known intelligent aspect, such as exhibiting both top-down and bottom-up model learning, generalization verse specialization, and more. Furthermore, a holistic approach is advocated for AGI designing, and cognition under constraints or efficiency is proposed, in the form of reusability and simplicity. Finally, reaching this mature state is described via",
    "path": "papers/23/08/2308.04600.json",
    "total_tokens": 834,
    "translated_title": "模型的模型--第一部分",
    "translated_abstract": "本文提出了一种新的认知模型，作为AGI代理的主要组成部分。该模型是在其成熟的智能状态下引入的，是DENN和特别是AKREM之前模型的延伸，包括操作模型（框架/类别）和意愿。该模型的核心假设是认知是在适当的意愿引导下对累积的知识进行操作。此外，我们假设在成熟的智能状态之前的演化阶段，行为（知识的一部分）是学习与意愿对齐的。此外，该模型主要基于每个已知智能方面的二元性原则，例如上下学习模型，泛化与特化，等等。此外，倡导一种整体的AGI设计方法，并提出了在约束条件下的认知或效率问题，以可重用性和简洁性的形式。最后，通过实现知识和规则之间的双重叠加方式来描述达到这种成熟状态。",
    "tldr": "本文提出了一种新的认知模型，该模型在成熟智能状态下操作累积的知识，并依赖适当的意愿进行指导。"
}