{
    "title": "WS-SfMLearner: Self-supervised Monocular Depth and Ego-motion Estimation on Surgical Videos with Unknown Camera Parameters. (arXiv:2308.11776v1 [cs.CV])",
    "abstract": "Depth estimation in surgical video plays a crucial role in many image-guided surgery procedures. However, it is difficult and time consuming to create depth map ground truth datasets in surgical videos due in part to inconsistent brightness and noise in the surgical scene. Therefore, building an accurate and robust self-supervised depth and camera ego-motion estimation system is gaining more attention from the computer vision community. Although several self-supervision methods alleviate the need for ground truth depth maps and poses, they still need known camera intrinsic parameters, which are often missing or not recorded. Moreover, the camera intrinsic prediction methods in existing works depend heavily on the quality of datasets. In this work, we aimed to build a self-supervised depth and ego-motion estimation system which can predict not only accurate depth maps and camera pose, but also camera intrinsic parameters. We proposed a cost-volume-based supervision manner to give the sy",
    "link": "http://arxiv.org/abs/2308.11776",
    "context": "Title: WS-SfMLearner: Self-supervised Monocular Depth and Ego-motion Estimation on Surgical Videos with Unknown Camera Parameters. (arXiv:2308.11776v1 [cs.CV])\nAbstract: Depth estimation in surgical video plays a crucial role in many image-guided surgery procedures. However, it is difficult and time consuming to create depth map ground truth datasets in surgical videos due in part to inconsistent brightness and noise in the surgical scene. Therefore, building an accurate and robust self-supervised depth and camera ego-motion estimation system is gaining more attention from the computer vision community. Although several self-supervision methods alleviate the need for ground truth depth maps and poses, they still need known camera intrinsic parameters, which are often missing or not recorded. Moreover, the camera intrinsic prediction methods in existing works depend heavily on the quality of datasets. In this work, we aimed to build a self-supervised depth and ego-motion estimation system which can predict not only accurate depth maps and camera pose, but also camera intrinsic parameters. We proposed a cost-volume-based supervision manner to give the sy",
    "path": "papers/23/08/2308.11776.json",
    "total_tokens": 907,
    "translated_title": "WS-SfMLearner: 自助监督式在未知相机参数情况下进行手术视频的单目深度和自我运动估计。",
    "translated_abstract": "手术视频中的深度估计在许多图像引导手术程序中起着关键作用。然而，由于手术场景中的亮度和噪声不一致，创建深度地图真实数据集是困难且耗时的。因此，构建一个准确且鲁棒的自助监督深度和相机自我运动估计系统引起了计算机视觉社区的更多关注。尽管一些自助监督方法减轻了对真实深度地图和位姿的需求，但它们仍需要已知的相机内参数，而这些参数通常缺失或未记录。此外，现有工作中相机内参数预测方法在很大程度上依赖于数据集的质量。在这项工作中，我们的目标是构建一个自助监督深度和自我运动估计系统，可以预测精确的深度地图、相机位姿和相机内参数。我们提出了一个基于成本体积的监督方式来提供系统的自我匹配。",
    "tldr": "本文提出了一种自助监督深度和自我运动估计系统，可以在手术视频中预测精确的深度地图、相机位姿和相机内参数。"
}