{
    "title": "Computing the Distance between unbalanced Distributions -- The flat Metric. (arXiv:2308.01039v1 [cs.LG])",
    "abstract": "We provide an implementation to compute the flat metric in any dimension. The flat metric, also called dual bounded Lipschitz distance, generalizes the well-known Wasserstein distance W1 to the case that the distributions are of unequal total mass. This is of particular interest for unbalanced optimal transport tasks and for the analysis of data distributions where the sample size is important or normalization is not possible. The core of the method is based on a neural network to determine on optimal test function realizing the distance between two given measures. Special focus was put on achieving comparability of pairwise computed distances from independently trained networks. We tested the quality of the output in several experiments where ground truth was available as well as with simulated data.",
    "link": "http://arxiv.org/abs/2308.01039",
    "context": "Title: Computing the Distance between unbalanced Distributions -- The flat Metric. (arXiv:2308.01039v1 [cs.LG])\nAbstract: We provide an implementation to compute the flat metric in any dimension. The flat metric, also called dual bounded Lipschitz distance, generalizes the well-known Wasserstein distance W1 to the case that the distributions are of unequal total mass. This is of particular interest for unbalanced optimal transport tasks and for the analysis of data distributions where the sample size is important or normalization is not possible. The core of the method is based on a neural network to determine on optimal test function realizing the distance between two given measures. Special focus was put on achieving comparability of pairwise computed distances from independently trained networks. We tested the quality of the output in several experiments where ground truth was available as well as with simulated data.",
    "path": "papers/23/08/2308.01039.json",
    "total_tokens": 792,
    "translated_title": "计算不平衡分布之间的距离 - 平坦度量",
    "translated_abstract": "我们提供了一个在任意维度计算平坦度量的实现。平坦度量，也称为双边界Lipschitz距离，将众所周知的Wasserstein距离W1推广到了分布总质量不平衡的情况。这对于不平衡最优输运任务和数据分布分析中，样本大小重要或者归一化不可能的情况具有特殊的意义。该方法的核心是基于神经网络来确定实现两个给定测度之间距离的最佳测试函数。我们特别注重实现了从独立训练的网络计算出的成对距离的可比性。我们通过几个实验证明了输出的质量，其中包括了一些有实际真值的实验以及使用模拟数据的实验。",
    "tldr": "该论文提出了一种计算不平衡分布之间距离的方法，基于平坦度量，该方法可以推广到分布总质量不平衡的情况下，特别适用于不平衡最优输运和数据分布分析。论文实现了一个基于神经网络的方法，可以计算出两个给定测度之间距离的最佳测试函数，并通过多个实验验证了方法的准确性。"
}