{
    "title": "Stress representations for tensor basis neural networks: alternative formulations to Finger-Rivlin-Ericksen. (arXiv:2308.11080v1 [cond-mat.soft])",
    "abstract": "Data-driven constitutive modeling frameworks based on neural networks and classical representation theorems have recently gained considerable attention due to their ability to easily incorporate constitutive constraints and their excellent generalization performance. In these models, the stress prediction follows from a linear combination of invariant-dependent coefficient functions and known tensor basis generators. However, thus far the formulations have been limited to stress representations based on the classical Rivlin and Ericksen form, while the performance of alternative representations has yet to be investigated. In this work, we survey a variety of tensor basis neural network models for modeling hyperelastic materials in a finite deformation context, including a number of so far unexplored formulations which use theoretically equivalent invariants and generators to Finger-Rivlin-Ericksen. Furthermore, we compare potential-based and coefficient-based approaches, as well as dif",
    "link": "http://arxiv.org/abs/2308.11080",
    "context": "Title: Stress representations for tensor basis neural networks: alternative formulations to Finger-Rivlin-Ericksen. (arXiv:2308.11080v1 [cond-mat.soft])\nAbstract: Data-driven constitutive modeling frameworks based on neural networks and classical representation theorems have recently gained considerable attention due to their ability to easily incorporate constitutive constraints and their excellent generalization performance. In these models, the stress prediction follows from a linear combination of invariant-dependent coefficient functions and known tensor basis generators. However, thus far the formulations have been limited to stress representations based on the classical Rivlin and Ericksen form, while the performance of alternative representations has yet to be investigated. In this work, we survey a variety of tensor basis neural network models for modeling hyperelastic materials in a finite deformation context, including a number of so far unexplored formulations which use theoretically equivalent invariants and generators to Finger-Rivlin-Ericksen. Furthermore, we compare potential-based and coefficient-based approaches, as well as dif",
    "path": "papers/23/08/2308.11080.json",
    "total_tokens": 902,
    "translated_title": "张量基神经网络的应力表示：Finger-Rivlin-Ericksen的替代公式",
    "translated_abstract": "基于神经网络和经典表示定理的数据驱动本构模型框架近年来引起了广泛关注，因为它们能够轻松地融入本构约束条件，并具有出色的泛化性能。在这些模型中，应力预测是基于不变性相关系数函数和已知张量基生成器的线性组合。然而，迄今为止，该公式仅限于基于经典Rivlin和Ericksen形式的应力表示，而其他替代公式的性能尚未得到研究。在本工作中，我们调查了一系列在有限变形情况下用于建模超弹性材料的张量基神经网络模型，包括一些迄今未探索的使用理论上等价的不变量和生成器的公式，以取代Finger-Rivlin-Ericksen。此外，我们比较了基于势能和基于系数的方法，以及差异。",
    "tldr": "本研究通过探索一系列张量基神经网络模型，研究不同的应力表示方法，以替代传统的Finger-Rivlin-Ericksen形式。通过比较基于势能和基于系数的方法，以及差异，进一步拓展了在有限变形情况下建模超弹性材料的可能性。"
}