{
    "title": "Dialogue Possibilities between a Human Supervisor and UAM Air Traffic Management: Route Alteration. (arXiv:2308.06411v1 [cs.AI])",
    "abstract": "This paper introduces a novel approach to detour management in Urban Air Traffic Management (UATM) using knowledge representation and reasoning. It aims to understand the complexities and requirements of UAM detours, enabling a method that quickly identifies safe and efficient routes in a carefully sampled environment. This method implemented in Answer Set Programming uses non-monotonic reasoning and a two-phase conversation between a human manager and the UATM system, considering factors like safety and potential impacts. The robustness and efficacy of the proposed method were validated through several queries from two simulation scenarios, contributing to the symbiosis of human knowledge and advanced AI techniques. The paper provides an introduction, citing relevant studies, problem formulation, solution, discussions, and concluding comments.",
    "link": "http://arxiv.org/abs/2308.06411",
    "context": "Title: Dialogue Possibilities between a Human Supervisor and UAM Air Traffic Management: Route Alteration. (arXiv:2308.06411v1 [cs.AI])\nAbstract: This paper introduces a novel approach to detour management in Urban Air Traffic Management (UATM) using knowledge representation and reasoning. It aims to understand the complexities and requirements of UAM detours, enabling a method that quickly identifies safe and efficient routes in a carefully sampled environment. This method implemented in Answer Set Programming uses non-monotonic reasoning and a two-phase conversation between a human manager and the UATM system, considering factors like safety and potential impacts. The robustness and efficacy of the proposed method were validated through several queries from two simulation scenarios, contributing to the symbiosis of human knowledge and advanced AI techniques. The paper provides an introduction, citing relevant studies, problem formulation, solution, discussions, and concluding comments.",
    "path": "papers/23/08/2308.06411.json",
    "total_tokens": 813,
    "translated_title": "人类监管者与城市空中交通管理之间的对话可能性：路径更改",
    "translated_abstract": "本文介绍了一种利用知识表示和推理在城市空中交通管理（UATM）中进行绕行管理的新方法。它旨在了解UAM绕行的复杂性和要求，实现一种能够在经过仔细采样的环境中快速确定安全和高效路线的方法。该方法采用了非单调推理和人类经理与UATM系统之间的两阶段对话，考虑了安全性和潜在影响等因素。通过两个模拟场景中的几个查询验证了所提出方法的稳健性和效力，为人类知识和先进AI技术的共生做出了贡献。本文提供了引言、引用相关研究、问题阐述、解决方案、讨论和结论性评论。",
    "tldr": "本文介绍了一种基于知识表示和推理的方法，在城市空中交通管理中实现了人类监管者和系统之间的对话，并通过验证了该方法的稳健性和效力，为人类知识和先进AI技术的共生做出了贡献。"
}