{
    "title": "BI-LAVA: Biocuration with Hierarchical Image Labeling through Active Learning and Visual Analysis. (arXiv:2308.08003v1 [cs.HC])",
    "abstract": "In the biomedical domain, taxonomies organize the acquisition modalities of scientific images in hierarchical structures. Such taxonomies leverage large sets of correct image labels and provide essential information about the importance of a scientific publication, which could then be used in biocuration tasks. However, the hierarchical nature of the labels, the overhead of processing images, the absence or incompleteness of labeled data, and the expertise required to label this type of data impede the creation of useful datasets for biocuration. From a multi-year collaboration with biocurators and text-mining researchers, we derive an iterative visual analytics and active learning strategy to address these challenges. We implement this strategy in a system called BI-LAVA Biocuration with Hierarchical Image Labeling through Active Learning and Visual Analysis. BI-LAVA leverages a small set of image labels, a hierarchical set of image classifiers, and active learning to help model build",
    "link": "http://arxiv.org/abs/2308.08003",
    "context": "Title: BI-LAVA: Biocuration with Hierarchical Image Labeling through Active Learning and Visual Analysis. (arXiv:2308.08003v1 [cs.HC])\nAbstract: In the biomedical domain, taxonomies organize the acquisition modalities of scientific images in hierarchical structures. Such taxonomies leverage large sets of correct image labels and provide essential information about the importance of a scientific publication, which could then be used in biocuration tasks. However, the hierarchical nature of the labels, the overhead of processing images, the absence or incompleteness of labeled data, and the expertise required to label this type of data impede the creation of useful datasets for biocuration. From a multi-year collaboration with biocurators and text-mining researchers, we derive an iterative visual analytics and active learning strategy to address these challenges. We implement this strategy in a system called BI-LAVA Biocuration with Hierarchical Image Labeling through Active Learning and Visual Analysis. BI-LAVA leverages a small set of image labels, a hierarchical set of image classifiers, and active learning to help model build",
    "path": "papers/23/08/2308.08003.json",
    "total_tokens": 875,
    "translated_title": "BI-LAVA：通过主动学习和视觉分析进行层级图像标签的生物鉴定",
    "translated_abstract": "在生物医学领域，分类法通过层级结构组织科学图像的获取方式。这些分类法利用大量正确的图像标签，并提供关于科学出版物重要性的重要信息，这可以在生物鉴定任务中使用。然而，标签的层级性质、图像处理的开销、标记数据的缺失或不完整性，以及标记这种类型数据所需要的专业知识都阻碍了用于生物鉴定的有用数据集的创建。根据与生物鉴定员和文本挖掘研究人员多年的合作，我们提出了一种迭代的视觉分析和主动学习策略来解决这些挑战。我们在一个名为BI-LAVA的系统中实现了这个策略，它通过主动学习和视觉分析来使用一小组图像标签、一套层级图像分类器来帮助模型构建。",
    "tldr": "BI-LAVA是一个通过主动学习和视觉分析进行层级图像标签的生物鉴定系统，它解决了标签层级性质、数据处理开销、标记数据缺失等问题，并帮助模型构建。"
}