{
    "title": "Distributed multi-agent target search and tracking with Gaussian process and reinforcement learning. (arXiv:2308.14971v1 [cs.RO])",
    "abstract": "Deploying multiple robots for target search and tracking has many practical applications, yet the challenge of planning over unknown or partially known targets remains difficult to address. With recent advances in deep learning, intelligent control techniques such as reinforcement learning have enabled agents to learn autonomously from environment interactions with little to no prior knowledge. Such methods can address the exploration-exploitation tradeoff of planning over unknown targets in a data-driven manner, eliminating the reliance on heuristics typical of traditional approaches and streamlining the decision-making pipeline with end-to-end training. In this paper, we propose a multi-agent reinforcement learning technique with target map building based on distributed Gaussian process. We leverage the distributed Gaussian process to encode belief over the target locations and efficiently plan over unknown targets. We evaluate the performance and transferability of the trained polic",
    "link": "http://arxiv.org/abs/2308.14971",
    "context": "Title: Distributed multi-agent target search and tracking with Gaussian process and reinforcement learning. (arXiv:2308.14971v1 [cs.RO])\nAbstract: Deploying multiple robots for target search and tracking has many practical applications, yet the challenge of planning over unknown or partially known targets remains difficult to address. With recent advances in deep learning, intelligent control techniques such as reinforcement learning have enabled agents to learn autonomously from environment interactions with little to no prior knowledge. Such methods can address the exploration-exploitation tradeoff of planning over unknown targets in a data-driven manner, eliminating the reliance on heuristics typical of traditional approaches and streamlining the decision-making pipeline with end-to-end training. In this paper, we propose a multi-agent reinforcement learning technique with target map building based on distributed Gaussian process. We leverage the distributed Gaussian process to encode belief over the target locations and efficiently plan over unknown targets. We evaluate the performance and transferability of the trained polic",
    "path": "papers/23/08/2308.14971.json",
    "total_tokens": 856,
    "translated_title": "分布式多智能体目标搜索和跟踪：高斯过程与强化学习",
    "translated_abstract": "部署多个机器人用于目标搜索和跟踪在实际应用中有很多困难，特别是在未知或部分已知目标的情况下。最近深度学习的进展使得智能控制技术如强化学习能够让智能体在与环境交互中从零到有一定的自主学习能力。这种方法可以通过数据驱动的方式解决未知目标规划中的勘探和利用的权衡，消除传统方法中对启发式算法的依赖，并简化决策流程。本文提出了一种基于分布式高斯过程的多智能体强化学习技术，用于目标地图构建。我们利用分布式高斯过程对目标位置进行置信度编码，并高效地规划未知目标。我们评估了训练策略的性能和可迁移性",
    "tldr": "本研究提出了一种基于强化学习和高斯过程的多智能体目标搜索和跟踪方法，在未知目标场景下通过数据驱动的方式实现目标探索和决策规划，提高效率和准确性。",
    "en_tdlr": "This study proposes a multi-agent target search and tracking approach based on reinforcement learning and Gaussian process, which achieves target exploration and decision planning in unknown target scenarios through data-driven methods, thus improving efficiency and accuracy."
}