{
    "title": "Crowdsourcing Fraud Detection over Heterogeneous Temporal MMMA Graph. (arXiv:2308.02793v1 [cs.SI])",
    "abstract": "The rise of the click farm business using Multi-purpose Messaging Mobile Apps (MMMAs) tempts cybercriminals to perpetrate crowdsourcing frauds that cause financial losses to click farm workers. In this paper, we propose a novel contrastive multi-view learning method named CMT for crowdsourcing fraud detection over the heterogeneous temporal graph (HTG) of MMMA. CMT captures both heterogeneity and dynamics of HTG and generates high-quality representations for crowdsourcing fraud detection in a self-supervised manner. We deploy CMT to detect crowdsourcing frauds on an industry-size HTG of a representative MMMA WeChat and it significantly outperforms other methods. CMT also shows promising results for fraud detection on a large-scale public financial HTG, indicating that it can be applied in other graph anomaly detection tasks.",
    "link": "http://arxiv.org/abs/2308.02793",
    "context": "Title: Crowdsourcing Fraud Detection over Heterogeneous Temporal MMMA Graph. (arXiv:2308.02793v1 [cs.SI])\nAbstract: The rise of the click farm business using Multi-purpose Messaging Mobile Apps (MMMAs) tempts cybercriminals to perpetrate crowdsourcing frauds that cause financial losses to click farm workers. In this paper, we propose a novel contrastive multi-view learning method named CMT for crowdsourcing fraud detection over the heterogeneous temporal graph (HTG) of MMMA. CMT captures both heterogeneity and dynamics of HTG and generates high-quality representations for crowdsourcing fraud detection in a self-supervised manner. We deploy CMT to detect crowdsourcing frauds on an industry-size HTG of a representative MMMA WeChat and it significantly outperforms other methods. CMT also shows promising results for fraud detection on a large-scale public financial HTG, indicating that it can be applied in other graph anomaly detection tasks.",
    "path": "papers/23/08/2308.02793.json",
    "total_tokens": 961,
    "translated_title": "在异构时间MMMA图上进行众包欺诈检测",
    "translated_abstract": "点击农场业务的兴起利用多用途消息移动应用程序（MMMA）诱使网络犯罪分子进行众包欺诈，给点击农场工人造成财务损失。在本文中，我们提出了一种名为CMT的新型对比多视图学习方法，用于在MMMA的异构时间图（HTG）上进行众包欺诈检测。CMT以自我监督的方式捕捉HTG的异质性和动态性，并生成用于众包欺诈检测的高质量表征。我们使用CMT在代表性MMMA微信的行业规模HTG上检测众包欺诈，并且其表现明显优于其他方法。CMT还显示出在大规模公共金融HTG上进行欺诈检测的有希望的结果，表明它可以应用于其他图异常检测任务。",
    "tldr": "本文提出了一种新颖的对比多视图学习方法CMT，用于在异构时间MMMA图上进行众包欺诈检测。CMT以自我监督的方式捕捉图的异质性和动态性，并生成高质量的表示。实验证明，CMT在代表性MMMA微信的行业规模HTG上表现出色，也显示出在大规模公共金融HTG上有希望的结果，可应用于其他图异常检测任务。"
}