{
    "title": "Flexible Isosurface Extraction for Gradient-Based Mesh Optimization. (arXiv:2308.05371v1 [cs.GR])",
    "abstract": "This work considers gradient-based mesh optimization, where we iteratively optimize for a 3D surface mesh by representing it as the isosurface of a scalar field, an increasingly common paradigm in applications including photogrammetry, generative modeling, and inverse physics. Existing implementations adapt classic isosurface extraction algorithms like Marching Cubes or Dual Contouring; these techniques were designed to extract meshes from fixed, known fields, and in the optimization setting they lack the degrees of freedom to represent high-quality feature-preserving meshes, or suffer from numerical instabilities. We introduce FlexiCubes, an isosurface representation specifically designed for optimizing an unknown mesh with respect to geometric, visual, or even physical objectives. Our main insight is to introduce additional carefully-chosen parameters into the representation, which allow local flexible adjustments to the extracted mesh geometry and connectivity. These parameters are ",
    "link": "http://arxiv.org/abs/2308.05371",
    "context": "Title: Flexible Isosurface Extraction for Gradient-Based Mesh Optimization. (arXiv:2308.05371v1 [cs.GR])\nAbstract: This work considers gradient-based mesh optimization, where we iteratively optimize for a 3D surface mesh by representing it as the isosurface of a scalar field, an increasingly common paradigm in applications including photogrammetry, generative modeling, and inverse physics. Existing implementations adapt classic isosurface extraction algorithms like Marching Cubes or Dual Contouring; these techniques were designed to extract meshes from fixed, known fields, and in the optimization setting they lack the degrees of freedom to represent high-quality feature-preserving meshes, or suffer from numerical instabilities. We introduce FlexiCubes, an isosurface representation specifically designed for optimizing an unknown mesh with respect to geometric, visual, or even physical objectives. Our main insight is to introduce additional carefully-chosen parameters into the representation, which allow local flexible adjustments to the extracted mesh geometry and connectivity. These parameters are ",
    "path": "papers/23/08/2308.05371.json",
    "total_tokens": 838,
    "translated_title": "基于梯度的网格优化的灵活等值面提取",
    "translated_abstract": "本文考虑了基于梯度的网格优化，通过将其表示为标量场的等值面来迭代地优化三维表面网格，这在摄影测量、生成建模和反向物理等应用中越来越常见。现有的实现方式是将经典的等值面提取算法（如Marching Cubes或Dual Contouring）进行调整；然而，在优化环境中，这些技术缺乏表示高质量保留特征的网格的自由度，或者会遭受数值不稳定性的问题。我们介绍了FlexiCubes，一种专为优化未知网格而设计的等值面表示方法，以便于几何、视觉甚至物理目标。我们的主要创新是引入额外的精心选择的参数到表示方法中，从而允许对提取的网格几何和连通性进行本地灵活调整。",
    "tldr": "本文提出了一种名为FlexiCubes的灵活等值面表示方法，用于基于梯度的网格优化，允许对提取的网格几何和连通性进行灵活调整，从而高质量地保留特征。",
    "en_tdlr": "This paper introduces FlexiCubes, a flexible isosurface representation method for gradient-based mesh optimization, allowing for flexible adjustments to the extracted mesh geometry and connectivity, thus preserving features with high quality."
}