{
    "title": "Echocardiographic View Classification with Integrated Out-of-Distribution Detection for Enhanced Automatic Echocardiographic Analysis. (arXiv:2308.16483v1 [eess.SP])",
    "abstract": "In the rapidly evolving field of automatic echocardiographic analysis and interpretation, automatic view classification is a critical yet challenging task, owing to the inherent complexity and variability of echocardiographic data. This study presents ECHOcardiography VIew Classification with Out-of-Distribution dEtection (ECHO-VICODE), a novel deep learning-based framework that effectively addresses this challenge by training to classify 31 classes, surpassing previous studies and demonstrating its capacity to handle a wide range of echocardiographic views. Furthermore, ECHO-VICODE incorporates an integrated out-of-distribution (OOD) detection function, leveraging the relative Mahalanobis distance to effectively identify 'near-OOD' instances commonly encountered in echocardiographic data. Through extensive experimentation, we demonstrated the outstanding performance of ECHO-VICODE in terms of view classification and OOD detection, significantly reducing the potential for errors in ech",
    "link": "http://arxiv.org/abs/2308.16483",
    "context": "Title: Echocardiographic View Classification with Integrated Out-of-Distribution Detection for Enhanced Automatic Echocardiographic Analysis. (arXiv:2308.16483v1 [eess.SP])\nAbstract: In the rapidly evolving field of automatic echocardiographic analysis and interpretation, automatic view classification is a critical yet challenging task, owing to the inherent complexity and variability of echocardiographic data. This study presents ECHOcardiography VIew Classification with Out-of-Distribution dEtection (ECHO-VICODE), a novel deep learning-based framework that effectively addresses this challenge by training to classify 31 classes, surpassing previous studies and demonstrating its capacity to handle a wide range of echocardiographic views. Furthermore, ECHO-VICODE incorporates an integrated out-of-distribution (OOD) detection function, leveraging the relative Mahalanobis distance to effectively identify 'near-OOD' instances commonly encountered in echocardiographic data. Through extensive experimentation, we demonstrated the outstanding performance of ECHO-VICODE in terms of view classification and OOD detection, significantly reducing the potential for errors in ech",
    "path": "papers/23/08/2308.16483.json",
    "total_tokens": 871,
    "translated_title": "具有集成离群检测的超声心动图视图分类，以增强自动超声心动图分析",
    "translated_abstract": "在快速发展的自动超声心动图分析和解释领域中，自动视图分类是一个关键但具有挑战性的任务，这是由于超声心动图数据的固有复杂性和可变性。本研究提出了ECHO-VICODE（超声心动图视图分类与离群检测），这是一个基于深度学习的新型框架，通过训练来分类31个类别，超过了先前的研究，并展示了其处理多种超声心动图视图的能力。此外，ECHO-VICODE还加入了一个集成的离群检测功能，利用相对马氏距离有效识别常见的“接近离群”实例。通过大量实验，我们展示了ECHO-VICODE在视图分类和离群检测方面的出色性能，显著降低了超声心动图中潜在错误的可能性。",
    "tldr": "ECHO-VICODE是一个深度学习框架，通过训练来分类超声心动图的31个视图类别，并具有集成的离群检测功能，可以显著降低超声心动图中的错误可能性。"
}