{
    "title": "Learning Sequential Information in Task-based fMRI for Synthetic Data Augmentation. (arXiv:2308.15564v1 [eess.IV])",
    "abstract": "Insufficiency of training data is a persistent issue in medical image analysis, especially for task-based functional magnetic resonance images (fMRI) with spatio-temporal imaging data acquired using specific cognitive tasks. In this paper, we propose an approach for generating synthetic fMRI sequences that can then be used to create augmented training datasets in downstream learning tasks. To synthesize high-resolution task-specific fMRI, we adapt the $\\alpha$-GAN structure, leveraging advantages of both GAN and variational autoencoder models, and propose different alternatives in aggregating temporal information. The synthetic images are evaluated from multiple perspectives including visualizations and an autism spectrum disorder (ASD) classification task. The results show that the synthetic task-based fMRI can provide effective data augmentation in learning the ASD classification task.",
    "link": "http://arxiv.org/abs/2308.15564",
    "context": "Title: Learning Sequential Information in Task-based fMRI for Synthetic Data Augmentation. (arXiv:2308.15564v1 [eess.IV])\nAbstract: Insufficiency of training data is a persistent issue in medical image analysis, especially for task-based functional magnetic resonance images (fMRI) with spatio-temporal imaging data acquired using specific cognitive tasks. In this paper, we propose an approach for generating synthetic fMRI sequences that can then be used to create augmented training datasets in downstream learning tasks. To synthesize high-resolution task-specific fMRI, we adapt the $\\alpha$-GAN structure, leveraging advantages of both GAN and variational autoencoder models, and propose different alternatives in aggregating temporal information. The synthetic images are evaluated from multiple perspectives including visualizations and an autism spectrum disorder (ASD) classification task. The results show that the synthetic task-based fMRI can provide effective data augmentation in learning the ASD classification task.",
    "path": "papers/23/08/2308.15564.json",
    "total_tokens": 852,
    "translated_title": "在任务驱动的fMRI中学习序列信息用于合成数据增益",
    "translated_abstract": "在医学图像分析中，训练数据不足是一个持续存在的问题，特别是对于使用特定认知任务获取的时空成像数据的任务驱动功能性磁共振图像(fMRI)。本文提出了一种生成合成fMRI序列的方法，可以用于创建下游学习任务的增强训练数据集。为了合成高分辨率的任务特定fMRI，我们采用了α-GAN结构，充分利用了GAN和变分自编码器模型的优势，并提出了在聚合时序信息方面的不同选择。通过可视化和自闭症谱系障碍(ASD)分类任务对合成图像进行评估。结果表明，合成的任务驱动fMRI可以在学习ASD分类任务中提供有效的数据增益。",
    "tldr": "本文提出了一种方法，通过生成合成fMRI序列来增强训练数据集，以解决医学图像分析中训练数据不足的问题。通过适应α-GAN结构和聚合时序信息，合成的任务驱动fMRI可以有效地提供数据增益，并在自闭症谱系障碍(ASD)分类任务中取得了良好的结果。",
    "en_tdlr": "This paper proposes an approach for generating synthetic fMRI sequences to augment training datasets in medical image analysis. By adapting the α-GAN structure and aggregating temporal information, the synthetic task-based fMRI provides effective data augmentation and achieves promising results in the autism spectrum disorder (ASD) classification task."
}