{
    "title": "NP-SemiSeg: When Neural Processes meet Semi-Supervised Semantic Segmentation. (arXiv:2308.02866v1 [cs.CV])",
    "abstract": "Semi-supervised semantic segmentation involves assigning pixel-wise labels to unlabeled images at training time. This is useful in a wide range of real-world applications where collecting pixel-wise labels is not feasible in time or cost. Current approaches to semi-supervised semantic segmentation work by predicting pseudo-labels for each pixel from a class-wise probability distribution output by a model. If the predicted probability distribution is incorrect, however, this leads to poor segmentation results, which can have knock-on consequences in safety critical systems, like medical images or self-driving cars. It is, therefore, important to understand what a model does not know, which is mainly achieved by uncertainty quantification. Recently, neural processes (NPs) have been explored in semi-supervised image classification, and they have been a computationally efficient and effective method for uncertainty quantification. In this work, we move one step forward by adapting NPs to s",
    "link": "http://arxiv.org/abs/2308.02866",
    "context": "Title: NP-SemiSeg: When Neural Processes meet Semi-Supervised Semantic Segmentation. (arXiv:2308.02866v1 [cs.CV])\nAbstract: Semi-supervised semantic segmentation involves assigning pixel-wise labels to unlabeled images at training time. This is useful in a wide range of real-world applications where collecting pixel-wise labels is not feasible in time or cost. Current approaches to semi-supervised semantic segmentation work by predicting pseudo-labels for each pixel from a class-wise probability distribution output by a model. If the predicted probability distribution is incorrect, however, this leads to poor segmentation results, which can have knock-on consequences in safety critical systems, like medical images or self-driving cars. It is, therefore, important to understand what a model does not know, which is mainly achieved by uncertainty quantification. Recently, neural processes (NPs) have been explored in semi-supervised image classification, and they have been a computationally efficient and effective method for uncertainty quantification. In this work, we move one step forward by adapting NPs to s",
    "path": "papers/23/08/2308.02866.json",
    "total_tokens": 858,
    "translated_title": "NP-SemiSeg: 当神经过程遇见半监督语义分割",
    "translated_abstract": "半监督语义分割涉及在训练时为无标签图像分配逐像素标签。在无法及时或成本高昂地收集逐像素标签的各种实际应用中，这是很有用的。当前的半监督语义分割方法通过从模型输出的类别概率分布中预测每个像素的伪标签来工作。然而，如果预测的概率分布是错误的，这会导致分割结果不佳，对于医疗图像或自动驾驶汽车等安全关键系统来说，可能产生连锁影响。因此，了解模型不知道的内容是很重要的，这主要通过不确定性量化来实现。最近，神经过程（NPs）已被应用于半监督图像分类，并且它们是一种计算高效且有效的不确定性量化方法。在这项工作中，我们进一步将NPs应用于半监督语义分割。",
    "tldr": "将神经过程（NPs）应用于半监督语义分割，通过不确定性量化实现了模型对于未知内容的认知，提高了分割结果的质量和安全性。",
    "en_tdlr": "NP-SemiSeg combines neural processes (NPs) with semi-supervised semantic segmentation to improve the quality and safety of segmentation results by quantifying model uncertainty and understanding unknown content."
}