{
    "title": "TSLiNGAM: DirectLiNGAM under heavy tails. (arXiv:2308.05422v1 [stat.ME])",
    "abstract": "One of the established approaches to causal discovery consists of combining directed acyclic graphs (DAGs) with structural causal models (SCMs) to describe the functional dependencies of effects on their causes. Possible identifiability of SCMs given data depends on assumptions made on the noise variables and the functional classes in the SCM. For instance, in the LiNGAM model, the functional class is restricted to linear functions and the disturbances have to be non-Gaussian.  In this work, we propose TSLiNGAM, a new method for identifying the DAG of a causal model based on observational data. TSLiNGAM builds on DirectLiNGAM, a popular algorithm which uses simple OLS regression for identifying causal directions between variables. TSLiNGAM leverages the non-Gaussianity assumption of the error terms in the LiNGAM model to obtain more efficient and robust estimation of the causal structure. TSLiNGAM is justified theoretically and is studied empirically in an extensive simulation study. I",
    "link": "http://arxiv.org/abs/2308.05422",
    "context": "Title: TSLiNGAM: DirectLiNGAM under heavy tails. (arXiv:2308.05422v1 [stat.ME])\nAbstract: One of the established approaches to causal discovery consists of combining directed acyclic graphs (DAGs) with structural causal models (SCMs) to describe the functional dependencies of effects on their causes. Possible identifiability of SCMs given data depends on assumptions made on the noise variables and the functional classes in the SCM. For instance, in the LiNGAM model, the functional class is restricted to linear functions and the disturbances have to be non-Gaussian.  In this work, we propose TSLiNGAM, a new method for identifying the DAG of a causal model based on observational data. TSLiNGAM builds on DirectLiNGAM, a popular algorithm which uses simple OLS regression for identifying causal directions between variables. TSLiNGAM leverages the non-Gaussianity assumption of the error terms in the LiNGAM model to obtain more efficient and robust estimation of the causal structure. TSLiNGAM is justified theoretically and is studied empirically in an extensive simulation study. I",
    "path": "papers/23/08/2308.05422.json",
    "total_tokens": 904,
    "translated_title": "TSLiNGAM: 在重尾分布下的DirectLiNGAM",
    "translated_abstract": "因果推断的一种已建立的方法是将有向无环图(DAGs)与结构性因果模型(SCMs)结合起来，以描述效应对其因果的功能依赖关系。给定数据下SCMs的可能可辨识性取决于对噪声变量和SCM中功能类的假设。例如，在LiNGAM模型中，功能类受限于线性函数，扰动必须是非高斯的。在这项工作中，我们提出了TSLiNGAM，一种基于观测数据识别因果模型DAG的新方法。TSLiNGAM建立在DirectLiNGAM之上，它是一种使用简单的OLS回归来识别变量间因果方向的流行算法。TSLiNGAM利用了LiNGAM模型中误差项的非高斯性假设，从而获得更高效和更稳健的因果结构估计。TSLiNGAM在理论上被证明是合理的，并在广泛的模拟研究中进行了实证研究。",
    "tldr": "TSLiNGAM是一种能够在重尾分布下进行因果推断的新方法，通过利用LiNGAM模型中误差项的非高斯性假设，实现了更高效和更稳健的因果结构估计。"
}