{
    "title": "Emoji Promotes Developer Participation and Issue Resolution on GitHub. (arXiv:2308.16360v1 [cs.CY])",
    "abstract": "Although remote working is increasingly adopted during the pandemic, many are concerned by the low-efficiency in the remote working. Missing in text-based communication are non-verbal cues such as facial expressions and body language, which hinders the effective communication and negatively impacts the work outcomes. Prevalent on social media platforms, emojis, as alternative non-verbal cues, are gaining popularity in the virtual workspaces well. In this paper, we study how emoji usage influences developer participation and issue resolution in virtual workspaces. To this end, we collect GitHub issues for a one-year period and apply causal inference techniques to measure the causal effect of emojis on the outcome of issues, controlling for confounders such as issue content, repository, and author information. We find that emojis can significantly reduce the resolution time of issues and attract more user participation. We also compare the heterogeneous effect on different types of issue",
    "link": "http://arxiv.org/abs/2308.16360",
    "context": "Title: Emoji Promotes Developer Participation and Issue Resolution on GitHub. (arXiv:2308.16360v1 [cs.CY])\nAbstract: Although remote working is increasingly adopted during the pandemic, many are concerned by the low-efficiency in the remote working. Missing in text-based communication are non-verbal cues such as facial expressions and body language, which hinders the effective communication and negatively impacts the work outcomes. Prevalent on social media platforms, emojis, as alternative non-verbal cues, are gaining popularity in the virtual workspaces well. In this paper, we study how emoji usage influences developer participation and issue resolution in virtual workspaces. To this end, we collect GitHub issues for a one-year period and apply causal inference techniques to measure the causal effect of emojis on the outcome of issues, controlling for confounders such as issue content, repository, and author information. We find that emojis can significantly reduce the resolution time of issues and attract more user participation. We also compare the heterogeneous effect on different types of issue",
    "path": "papers/23/08/2308.16360.json",
    "total_tokens": 921,
    "translated_title": "表情符号促进了GitHub上开发者的参与和问题解决",
    "translated_abstract": "尽管在疫情期间远程工作越来越普遍，但许多人对远程工作的低效率表示担忧。在基于文本的沟通中缺乏面部表情和肢体语言等非语言线索，这妨碍了有效的沟通，并对工作结果产生负面影响。作为替代的非语言线索，在社交媒体平台上广泛使用的表情符号在虚拟工作空间中也越来越受欢迎。本文研究了表情符号的使用如何影响虚拟工作空间中开发者的参与和问题解决。为此，我们收集了GitHub的一个一年周期内的问题，并应用因果推断技术来衡量表情符号对问题结果的因果效应，控制问题内容、仓库和作者信息等混淆因素。我们发现表情符号可以显著缩短问题的解决时间，并吸引更多用户参与。我们还比较了不同类型问题的异质效应。",
    "tldr": "本研究探讨了表情符号在虚拟工作空间中的使用对开发者参与和问题解决的影响。研究发现，表情符号可以显著缩短问题的解决时间，并吸引更多用户参与。不同类型问题对表情符号的效果也存在差异。"
}