{
    "title": "BAN-PL: a Novel Polish Dataset of Banned Harmful and Offensive Content from Wykop.pl web service. (arXiv:2308.10592v2 [cs.CL] UPDATED)",
    "abstract": "Advances in automated detection of offensive language online, including hate speech and cyberbullying, require improved access to publicly available datasets comprising social media content. In this paper, we introduce BAN-PL, the first open dataset in the Polish language that encompasses texts flagged as harmful and subsequently removed by professional moderators. The dataset encompasses a total of 691,662 pieces of content from a popular social networking service, Wykop, often referred to as the \"Polish Reddit\", including both posts and comments, and is evenly distributed into two distinct classes: \"harmful\" and \"neutral\". We provide a comprehensive description of the data collection and preprocessing procedures, as well as highlight the linguistic specificity of the data. The BAN-PL dataset, along with advanced preprocessing scripts for, i.a., unmasking profanities, will be publicly available.",
    "link": "http://arxiv.org/abs/2308.10592",
    "context": "Title: BAN-PL: a Novel Polish Dataset of Banned Harmful and Offensive Content from Wykop.pl web service. (arXiv:2308.10592v2 [cs.CL] UPDATED)\nAbstract: Advances in automated detection of offensive language online, including hate speech and cyberbullying, require improved access to publicly available datasets comprising social media content. In this paper, we introduce BAN-PL, the first open dataset in the Polish language that encompasses texts flagged as harmful and subsequently removed by professional moderators. The dataset encompasses a total of 691,662 pieces of content from a popular social networking service, Wykop, often referred to as the \"Polish Reddit\", including both posts and comments, and is evenly distributed into two distinct classes: \"harmful\" and \"neutral\". We provide a comprehensive description of the data collection and preprocessing procedures, as well as highlight the linguistic specificity of the data. The BAN-PL dataset, along with advanced preprocessing scripts for, i.a., unmasking profanities, will be publicly available.",
    "path": "papers/23/08/2308.10592.json",
    "total_tokens": 863,
    "translated_title": "BAN-PL: 一份来自Wykop.pl网站的禁止有害和攻击性内容的新波兰数据集",
    "translated_abstract": "在自动检测互联网上的冒犯性语言、仇恨言论和网络欺凌方面取得的进展需要改进对包含社交媒体内容的公开可用数据集的访问。在本文中，我们介绍了BAN-PL，这是第一个以波兰语提供的开放数据集，它包含了被专业审查员标记为有害并随后被删除的文本。数据集共包含来自Wykop这个颇受欢迎的社交网络服务的691,662条内容，其中包括帖子和评论，并且平均分为两个不同的类别：“有害”和“中立”。我们提供了数据收集和预处理程序的详细说明，并强调了数据的语言特殊性。BAN-PL数据集以及用于预处理脏话的高级脚本将公开提供。",
    "tldr": "BAN-PL是波兰语的第一个开放数据集，包含来自Wykop这个类似\"波兰版Reddit\"的社交网络服务的被标记为有害并删除的内容，将有助于改进自动检测互联网上的冒犯性语言的技术。"
}