{
    "title": "A Critical Review of Physics-Informed Machine Learning Applications in Subsurface Energy Systems. (arXiv:2308.04457v1 [cs.LG])",
    "abstract": "Machine learning has emerged as a powerful tool in various fields, including computer vision, natural language processing, and speech recognition. It can unravel hidden patterns within large data sets and reveal unparalleled insights, revolutionizing many industries and disciplines. However, machine and deep learning models lack interpretability and limited domain-specific knowledge, especially in applications such as physics and engineering. Alternatively, physics-informed machine learning (PIML) techniques integrate physics principles into data-driven models. By combining deep learning with domain knowledge, PIML improves the generalization of the model, abidance by the governing physical laws, and interpretability. This paper comprehensively reviews PIML applications related to subsurface energy systems, mainly in the oil and gas industry. The review highlights the successful utilization of PIML for tasks such as seismic applications, reservoir simulation, hydrocarbons production fo",
    "link": "http://arxiv.org/abs/2308.04457",
    "context": "Title: A Critical Review of Physics-Informed Machine Learning Applications in Subsurface Energy Systems. (arXiv:2308.04457v1 [cs.LG])\nAbstract: Machine learning has emerged as a powerful tool in various fields, including computer vision, natural language processing, and speech recognition. It can unravel hidden patterns within large data sets and reveal unparalleled insights, revolutionizing many industries and disciplines. However, machine and deep learning models lack interpretability and limited domain-specific knowledge, especially in applications such as physics and engineering. Alternatively, physics-informed machine learning (PIML) techniques integrate physics principles into data-driven models. By combining deep learning with domain knowledge, PIML improves the generalization of the model, abidance by the governing physical laws, and interpretability. This paper comprehensively reviews PIML applications related to subsurface energy systems, mainly in the oil and gas industry. The review highlights the successful utilization of PIML for tasks such as seismic applications, reservoir simulation, hydrocarbons production fo",
    "path": "papers/23/08/2308.04457.json",
    "total_tokens": 884,
    "translated_title": "对地下能源系统中物理驱动机器学习应用的批判性评论",
    "translated_abstract": "机器学习已经成为各个领域的强大工具，包括计算机视觉、自然语言处理和语音识别。它可以揭示大数据集中隐藏的模式，并揭示无与伦比的洞察力，从而革新许多行业和学科。然而，机器和深度学习模型缺乏可解释性和有限的领域专业知识，特别是在物理和工程等应用中。相反，物理驱动的机器学习（PIML）技术将物理原理融入到数据驱动模型中。通过将深度学习与领域知识相结合，PIML提高了模型的泛化能力，遵守治理物理定律，以及可解释性。本文全面回顾了与地下能源系统相关的PIML应用，主要集中在石油和天然气行业。回顾突出了PIML在地震应用、油藏模拟和油气生产等任务中的成功利用。",
    "tldr": "本文批判性地审查了物理驱动的机器学习在地下能源系统中的应用，强调了PIML在地震应用、油藏模拟和油气生产等任务中的成功利用。"
}