{
    "title": "A Hierarchical Destroy and Repair Approach for Solving Very Large-Scale Travelling Salesman Problem. (arXiv:2308.04639v1 [cs.AI])",
    "abstract": "For prohibitively large-scale Travelling Salesman Problems (TSPs), existing algorithms face big challenges in terms of both computational efficiency and solution quality. To address this issue, we propose a hierarchical destroy-and-repair (HDR) approach, which attempts to improve an initial solution by applying a series of carefully designed destroy-and-repair operations. A key innovative concept is the hierarchical search framework, which recursively fixes partial edges and compresses the input instance into a small-scale TSP under some equivalence guarantee. This neat search framework is able to deliver highly competitive solutions within a reasonable time. Fair comparisons based on nineteen famous large-scale instances (with 10,000 to 10,000,000 cities) show that HDR is highly competitive against existing state-of-the-art TSP algorithms, in terms of both efficiency and solution quality. Notably, on two large instances with 3,162,278 and 10,000,000 cities, HDR breaks the world record",
    "link": "http://arxiv.org/abs/2308.04639",
    "context": "Title: A Hierarchical Destroy and Repair Approach for Solving Very Large-Scale Travelling Salesman Problem. (arXiv:2308.04639v1 [cs.AI])\nAbstract: For prohibitively large-scale Travelling Salesman Problems (TSPs), existing algorithms face big challenges in terms of both computational efficiency and solution quality. To address this issue, we propose a hierarchical destroy-and-repair (HDR) approach, which attempts to improve an initial solution by applying a series of carefully designed destroy-and-repair operations. A key innovative concept is the hierarchical search framework, which recursively fixes partial edges and compresses the input instance into a small-scale TSP under some equivalence guarantee. This neat search framework is able to deliver highly competitive solutions within a reasonable time. Fair comparisons based on nineteen famous large-scale instances (with 10,000 to 10,000,000 cities) show that HDR is highly competitive against existing state-of-the-art TSP algorithms, in terms of both efficiency and solution quality. Notably, on two large instances with 3,162,278 and 10,000,000 cities, HDR breaks the world record",
    "path": "papers/23/08/2308.04639.json",
    "total_tokens": 967,
    "translated_title": "一种层次化的破坏和修复方法用于解决极大规模的旅行推销员问题",
    "translated_abstract": "对于规模庞大的旅行推销员问题(TSP)，现有算法在计算效率和解决方案质量方面面临巨大挑战。为解决这个问题，我们提出了一种层次化的破坏和修复(HDR)方法，该方法通过一系列精心设计的破坏和修复操作来改进初始解决方案。一个关键的创新概念是层次化搜索框架，它递归修复部分边，并将输入实例压缩为具有某种等价保证的小规模TSP。这个简单明了的搜索框架能够在合理的时间内提供高竞争力的解决方案。基于十九个著名的大规模实例(包含10,000到10,000,000个城市)的公平比较表明，HDR在计算效率和解决方案质量方面与现有最先进的TSP算法具有很高的竞争力。值得注意的是，在具有3,162,278和10,000,000个城市的两个大规模实例上，HDR打破了世界纪录。",
    "tldr": "提出了一种层次化的破坏和修复方法用于解决极大规模的旅行推销员问题。该方法采用了递归修复和压缩输入实例的层次化搜索框架，能够在合理的时间内提供高竞争力的解决方案。",
    "en_tdlr": "A hierarchical destroy and repair (HDR) approach is proposed to solve very large-scale Travelling Salesman Problem (TSP). The method utilizes a recursive fix and compress framework to deliver highly competitive solutions within a reasonable time."
}