{
    "title": "Uncertainty and Explainable Analysis of Machine Learning Model for Reconstruction of Sonic Slowness Logs. (arXiv:2308.12625v1 [cs.LG])",
    "abstract": "Logs are valuable information for oil and gas fields as they help to determine the lithology of the formations surrounding the borehole and the location and reserves of subsurface oil and gas reservoirs. However, important logs are often missing in horizontal or old wells, which poses a challenge in field applications. In this paper, we utilize data from the 2020 machine learning competition of the SPWLA, which aims to predict the missing compressional wave slowness and shear wave slowness logs using other logs in the same borehole. We employ the NGBoost algorithm to construct an Ensemble Learning model that can predicate the results as well as their uncertainty. Furthermore, we combine the SHAP method to investigate the interpretability of the machine learning model. We compare the performance of the NGBosst model with four other commonly used Ensemble Learning methods, including Random Forest, GBDT, XGBoost, LightGBM. The results show that the NGBoost model performs well in the testi",
    "link": "http://arxiv.org/abs/2308.12625",
    "context": "Title: Uncertainty and Explainable Analysis of Machine Learning Model for Reconstruction of Sonic Slowness Logs. (arXiv:2308.12625v1 [cs.LG])\nAbstract: Logs are valuable information for oil and gas fields as they help to determine the lithology of the formations surrounding the borehole and the location and reserves of subsurface oil and gas reservoirs. However, important logs are often missing in horizontal or old wells, which poses a challenge in field applications. In this paper, we utilize data from the 2020 machine learning competition of the SPWLA, which aims to predict the missing compressional wave slowness and shear wave slowness logs using other logs in the same borehole. We employ the NGBoost algorithm to construct an Ensemble Learning model that can predicate the results as well as their uncertainty. Furthermore, we combine the SHAP method to investigate the interpretability of the machine learning model. We compare the performance of the NGBosst model with four other commonly used Ensemble Learning methods, including Random Forest, GBDT, XGBoost, LightGBM. The results show that the NGBoost model performs well in the testi",
    "path": "papers/23/08/2308.12625.json",
    "total_tokens": 981,
    "translated_title": "重建声速测井曲线的机器学习模型的不确定性和可解释性分析",
    "translated_abstract": "测井曲线对于油气田来说是宝贵的信息，它们帮助确定井孔周围地层的岩性以及地下油气储层的位置和储量。然而，在水平或旧井中经常缺少重要的测井曲线，这给现场应用带来了挑战。本文利用SPWLA的2020年机器学习竞赛的数据，旨在利用同一井眼中的其他测井曲线来预测缺失的压缩波慢度和剪切波慢度测井曲线。我们采用NGBoost算法构建了一个集成学习模型，可以预测结果及其不确定性。此外，我们结合了SHAP方法来研究机器学习模型的可解释性。我们将NGBosst模型与其他四种常用的集成学习方法进行了性能比较，包括随机森林、GBDT、XGBoost和LightGBM。结果表明，NGBoost模型在测试中表现良好。",
    "tldr": "本论文提出了一种利用机器学习模型重建声速测井曲线的方法，并通过NGBoost算法构建了一个能够预测结果及其不确定性的集成学习模型，同时结合了SHAP方法进行模型的可解释性分析。实验结果表明，NGBoost模型在测试中表现良好。",
    "en_tdlr": "This paper presents a method for reconstructing sonic slowness logs using machine learning model, and builds an ensemble learning model with NGBoost algorithm that can predict the results and their uncertainties. The interpretability of the model is also investigated using the SHAP method. Experimental results show that the NGBoost model performs well in the test."
}