{
    "title": "Alexa, play with robot: Introducing the First Alexa Prize SimBot Challenge on Embodied AI. (arXiv:2308.05221v1 [cs.HC])",
    "abstract": "The Alexa Prize program has empowered numerous university students to explore, experiment, and showcase their talents in building conversational agents through challenges like the SocialBot Grand Challenge and the TaskBot Challenge. As conversational agents increasingly appear in multimodal and embodied contexts, it is important to explore the affordances of conversational interaction augmented with computer vision and physical embodiment. This paper describes the SimBot Challenge, a new challenge in which university teams compete to build robot assistants that complete tasks in a simulated physical environment. This paper provides an overview of the SimBot Challenge, which included both online and offline challenge phases. We describe the infrastructure and support provided to the teams including Alexa Arena, the simulated environment, and the ML toolkit provided to teams to accelerate their building of vision and language models. We summarize the approaches the participating teams to",
    "link": "http://arxiv.org/abs/2308.05221",
    "context": "Title: Alexa, play with robot: Introducing the First Alexa Prize SimBot Challenge on Embodied AI. (arXiv:2308.05221v1 [cs.HC])\nAbstract: The Alexa Prize program has empowered numerous university students to explore, experiment, and showcase their talents in building conversational agents through challenges like the SocialBot Grand Challenge and the TaskBot Challenge. As conversational agents increasingly appear in multimodal and embodied contexts, it is important to explore the affordances of conversational interaction augmented with computer vision and physical embodiment. This paper describes the SimBot Challenge, a new challenge in which university teams compete to build robot assistants that complete tasks in a simulated physical environment. This paper provides an overview of the SimBot Challenge, which included both online and offline challenge phases. We describe the infrastructure and support provided to the teams including Alexa Arena, the simulated environment, and the ML toolkit provided to teams to accelerate their building of vision and language models. We summarize the approaches the participating teams to",
    "path": "papers/23/08/2308.05221.json",
    "total_tokens": 922,
    "translated_title": "Alexa，与机器人一起玩耍：引入第一届Alexa奖Embibod AI SimBot挑战",
    "translated_abstract": "Alexa Prize计划赋予了许多大学生探索、实验和展示他们在构建会话代理方面的才能的机会，通过SocialBot大挑战和TaskBot挑战等挑战。随着会话代理在多模态和具体化的情境中越来越多地出现，探索通过计算机视觉和物理具体化增强的会话交互的能力变得重要。本文描述了SimBot挑战，这是一个新的挑战，在其中大学团队竞相构建能够在模拟物理环境中完成任务的机器人助手。本文概述了SimBot挑战，其中包括在线和离线挑战阶段。我们描述了为团队提供的基础设施和支持，包括Alexa Arena，模拟环境以及提供给团队加速构建视觉和语言模型的ML工具包。我们总结了参与团队的方法",
    "tldr": "这篇论文介绍了第一届Alexa奖Embibod AI SimBot挑战，它是一个新的挑战，大学团队需要构建能够在模拟物理环境中完成任务的机器人助手。论文总结了挑战的概述和为团队提供的基础设施和支持，以及参与团队的方法。",
    "en_tdlr": "This paper introduces the first Alexa Prize Embodied AI SimBot Challenge, a new challenge where university teams compete to build robot assistants that complete tasks in a simulated physical environment. The paper provides an overview of the challenge, the infrastructure and support provided to the teams, and the approaches taken by the participating teams."
}