{
    "title": "Optimizing Factual Accuracy in Text Generation through Dynamic Knowledge Selection. (arXiv:2308.15711v1 [cs.CL])",
    "abstract": "Language models (LMs) have revolutionized the way we interact with information, but they often generate nonfactual text, raising concerns about their reliability. Previous methods use external knowledge as references for text generation to enhance factuality but often struggle with the knowledge mix-up(e.g., entity mismatch) of irrelevant references. Besides,as the length of the output text grows, the randomness of sampling can escalate, detrimentally impacting the factual accuracy of the generated text. In this paper, we present DKGen, which divide the text generation process into an iterative process. In each iteration, DKGen takes the input query, the previously generated text and a subset of the reference passages as input to generate short text. During the process, the subset is dynamically selected from the full passage set based on their relevance to the previously generated text and the query, largely eliminating the irrelevant references from input. To further enhance DKGen's ",
    "link": "http://arxiv.org/abs/2308.15711",
    "context": "Title: Optimizing Factual Accuracy in Text Generation through Dynamic Knowledge Selection. (arXiv:2308.15711v1 [cs.CL])\nAbstract: Language models (LMs) have revolutionized the way we interact with information, but they often generate nonfactual text, raising concerns about their reliability. Previous methods use external knowledge as references for text generation to enhance factuality but often struggle with the knowledge mix-up(e.g., entity mismatch) of irrelevant references. Besides,as the length of the output text grows, the randomness of sampling can escalate, detrimentally impacting the factual accuracy of the generated text. In this paper, we present DKGen, which divide the text generation process into an iterative process. In each iteration, DKGen takes the input query, the previously generated text and a subset of the reference passages as input to generate short text. During the process, the subset is dynamically selected from the full passage set based on their relevance to the previously generated text and the query, largely eliminating the irrelevant references from input. To further enhance DKGen's ",
    "path": "papers/23/08/2308.15711.json",
    "total_tokens": 852,
    "translated_title": "通过动态知识选择优化文本生成中的事实准确性",
    "translated_abstract": "语言模型（LMs）在我们与信息互动方面产生了革命性的影响，但它们往往会生成非事实性的文本，引发对其可靠性的担忧。以往的方法通过使用外部知识作为文本生成的参考来增强事实性，但往往在无关参考的知识混乱（如实体不匹配）方面遇到困难。此外，随着输出文本的长度增加，随机采样的随意性会加剧，对生成文本的事实准确性产生不利影响。在本文中，我们提出了DKGen，将文本生成过程划分为迭代过程。在每个迭代中，DKGen将输入的查询、先前生成的文本和一部分参考段落作为输入来生成短文本。在此过程中，根据先前生成的文本和查询与之的相关性，动态选择子集，从完整的段落集中大量消除了不相关的参考内容的输入。为进一步增强DKGen的能力，",
    "tldr": "本文提出了DKGen系统，通过动态选择知识参考，消除了文本生成过程中的非关联参考，从而提高了生成文本的事实准确性。"
}