{
    "title": "The Anatomy of Conspirators: Unveiling Traits using a Comprehensive Twitter Dataset. (arXiv:2308.15154v1 [cs.SI])",
    "abstract": "The discourse around conspiracy theories is currently thriving amidst the rampant misinformation prevalent in online environments. Research in this field has been focused on detecting conspiracy theories on social media, often relying on limited datasets. In this study, we present a novel methodology for constructing a Twitter dataset that encompasses accounts engaged in conspiracy-related activities throughout the year 2022. Our approach centers on data collection that is independent of specific conspiracy theories and information operations. Additionally, our dataset includes a control group comprising randomly selected users who can be fairly compared to the individuals involved in conspiracy activities. This comprehensive collection effort yielded a total of 15K accounts and 37M tweets extracted from their timelines. We conduct a comparative analysis of the two groups across three dimensions: topics, profiles, and behavioral characteristics. The results indicate that conspiracy and",
    "link": "http://arxiv.org/abs/2308.15154",
    "context": "Title: The Anatomy of Conspirators: Unveiling Traits using a Comprehensive Twitter Dataset. (arXiv:2308.15154v1 [cs.SI])\nAbstract: The discourse around conspiracy theories is currently thriving amidst the rampant misinformation prevalent in online environments. Research in this field has been focused on detecting conspiracy theories on social media, often relying on limited datasets. In this study, we present a novel methodology for constructing a Twitter dataset that encompasses accounts engaged in conspiracy-related activities throughout the year 2022. Our approach centers on data collection that is independent of specific conspiracy theories and information operations. Additionally, our dataset includes a control group comprising randomly selected users who can be fairly compared to the individuals involved in conspiracy activities. This comprehensive collection effort yielded a total of 15K accounts and 37M tweets extracted from their timelines. We conduct a comparative analysis of the two groups across three dimensions: topics, profiles, and behavioral characteristics. The results indicate that conspiracy and",
    "path": "papers/23/08/2308.15154.json",
    "total_tokens": 833,
    "translated_title": "阴谋者的解剖学：揭示性格特点的全面Twitter数据集",
    "translated_abstract": "在充斥着在线环境中的大量错误信息中，关于阴谋论的讨论正在蓬勃发展。在这个领域的研究主要集中在社交媒体上检测阴谋论，往往依赖于有限的数据集。在本研究中，我们提出了一种新的方法论，用于构建一个包含2022年全年涉及阴谋相关活动的Twitter数据集。我们的方法着重于独立于特定阴谋论和信息操作的数据收集。此外，我们的数据集包括一个对照组，其中随机选择用户可以与涉及阴谋活动的个体进行公正比较。这次全面的收集工作总共得到了15K个账户和从他们的时间线中提取的37M条推文。我们对两个群体在主题、个人资料和行为特征这三个维度上进行了比较分析。结果表明，阴谋和",
    "tldr": "本研究通过构建一种全面的Twitter数据集，揭示了参与阴谋相关活动的用户的特点和行为特征，为阴谋论的检测提供了新的方法和依据。"
}