{
    "title": "Physics informed Neural Networks applied to the description of wave-particle resonance in kinetic simulations of fusion plasmas. (arXiv:2308.12312v1 [physics.comp-ph])",
    "abstract": "The Vlasov-Poisson system is employed in its reduced form version (1D1V) as a test bed for the applicability of Physics Informed Neural Network (PINN) to the wave-particle resonance. Two examples are explored: the Landau damping and the bump-on-tail instability. PINN is first tested as a compression method for the solution of the Vlasov-Poisson system and compared to the standard neural networks. Second, the application of PINN to solving the Vlasov-Poisson system is also presented with the special emphasis on the integral part, which motivates the implementation of a PINN variant, called Integrable PINN (I-PINN), based on the automatic-differentiation to solve the partial differential equation and on the automatic-integration to solve the integral equation.",
    "link": "http://arxiv.org/abs/2308.12312",
    "context": "Title: Physics informed Neural Networks applied to the description of wave-particle resonance in kinetic simulations of fusion plasmas. (arXiv:2308.12312v1 [physics.comp-ph])\nAbstract: The Vlasov-Poisson system is employed in its reduced form version (1D1V) as a test bed for the applicability of Physics Informed Neural Network (PINN) to the wave-particle resonance. Two examples are explored: the Landau damping and the bump-on-tail instability. PINN is first tested as a compression method for the solution of the Vlasov-Poisson system and compared to the standard neural networks. Second, the application of PINN to solving the Vlasov-Poisson system is also presented with the special emphasis on the integral part, which motivates the implementation of a PINN variant, called Integrable PINN (I-PINN), based on the automatic-differentiation to solve the partial differential equation and on the automatic-integration to solve the integral equation.",
    "path": "papers/23/08/2308.12312.json",
    "total_tokens": 852,
    "translated_title": "应用物理信息神经网络描述等离子体融合动力学模拟中的波粒共振",
    "translated_abstract": "通过将Vlasov-Poisson系统的简化形式（1D1V）应用于物理信息神经网络（PINN）对波粒共振的适用性进行了测试。研究了两个例子：Landau衰减和尾巴上的颠簸不稳定性。首先，将PINN作为Vlasov-Poisson系统解的压缩方法进行测试，并与标准神经网络进行了比较。其次，还介绍了将PINN应用于解决Vlasov-Poisson系统的方法，特别强调了积分部分，并提出了一种基于自动微分解决偏微分方程和自动积分解决积分方程的PINN变体，称为可积PINN（I-PINN）。",
    "tldr": "本论文测试了物理信息神经网络（PINN）在描述等离子体融合动力学模拟中的波粒共振问题方面的适用性，提出了一种名为I-PINN的PINN变体，该方法基于自动微分和自动积分解决偏微分方程和积分方程。"
}