{
    "title": "On-Premise AIOps Infrastructure for a Software Editor SME: An Experience Report. (arXiv:2308.11225v1 [cs.SE])",
    "abstract": "Information Technology has become a critical component in various industries, leading to an increased focus on software maintenance and monitoring. With the complexities of modern software systems, traditional maintenance approaches have become insufficient. The concept of AIOps has emerged to enhance predictive maintenance using Big Data and Machine Learning capabilities. However, exploiting AIOps requires addressing several challenges related to the complexity of data and incident management. Commercial solutions exist, but they may not be suitable for certain companies due to high costs, data governance issues, and limitations in covering private software. This paper investigates the feasibility of implementing on-premise AIOps solutions by leveraging open-source tools. We introduce a comprehensive AIOps infrastructure that we have successfully deployed in our company, and we provide the rationale behind different choices that we made to build its various components. Particularly, w",
    "link": "http://arxiv.org/abs/2308.11225",
    "context": "Title: On-Premise AIOps Infrastructure for a Software Editor SME: An Experience Report. (arXiv:2308.11225v1 [cs.SE])\nAbstract: Information Technology has become a critical component in various industries, leading to an increased focus on software maintenance and monitoring. With the complexities of modern software systems, traditional maintenance approaches have become insufficient. The concept of AIOps has emerged to enhance predictive maintenance using Big Data and Machine Learning capabilities. However, exploiting AIOps requires addressing several challenges related to the complexity of data and incident management. Commercial solutions exist, but they may not be suitable for certain companies due to high costs, data governance issues, and limitations in covering private software. This paper investigates the feasibility of implementing on-premise AIOps solutions by leveraging open-source tools. We introduce a comprehensive AIOps infrastructure that we have successfully deployed in our company, and we provide the rationale behind different choices that we made to build its various components. Particularly, w",
    "path": "papers/23/08/2308.11225.json",
    "total_tokens": 844,
    "translated_title": "中小型软件编辑公司的本地AIOps基础设施：一份经验报告",
    "translated_abstract": "信息技术已成为各行各业的关键组成部分，导致对软件维护和监控的关注增加。随着现代软件系统的复杂性，传统的维护方法已经不足够。AIOps的概念应运而生，通过使用大数据和机器学习能力来增强预测性维护。然而，利用AIOps需要解决与数据和事件管理复杂性相关的几个挑战。商业解决方案存在，但由于高昂的成本、数据治理问题和不覆盖私有软件的限制，它们可能不适合某些公司。本文通过利用开源工具来实施本地AIOps解决方案的可行性进行了研究。我们介绍了我们在公司成功部署的一种综合AIOps基础设施，并提供了构建其各个组件的不同选择的理由。",
    "tldr": "本文研究了通过利用开源工具实施本地AIOps解决方案的可行性。我们成功部署了一种综合AIOps基础设施，并提供了构建其各个组件的不同选择的理由。",
    "en_tdlr": "This paper investigates the feasibility of implementing on-premise AIOps solutions using open-source tools. We successfully deployed a comprehensive AIOps infrastructure and provide the rationale behind different choices made for its various components."
}