{
    "title": "Mercury: An Automated Remote Side-channel Attack to Nvidia Deep Learning Accelerator. (arXiv:2308.01193v1 [cs.CR])",
    "abstract": "DNN accelerators have been widely deployed in many scenarios to speed up the inference process and reduce the energy consumption. One big concern about the usage of the accelerators is the confidentiality of the deployed models: model inference execution on the accelerators could leak side-channel information, which enables an adversary to preciously recover the model details. Such model extraction attacks can not only compromise the intellectual property of DNN models, but also facilitate some adversarial attacks.  Although previous works have demonstrated a number of side-channel techniques to extract models from DNN accelerators, they are not practical for two reasons. (1) They only target simplified accelerator implementations, which have limited practicality in the real world. (2) They require heavy human analysis and domain knowledge. To overcome these limitations, this paper presents Mercury, the first automated remote side-channel attack against the off-the-shelf Nvidia DNN acc",
    "link": "http://arxiv.org/abs/2308.01193",
    "context": "Title: Mercury: An Automated Remote Side-channel Attack to Nvidia Deep Learning Accelerator. (arXiv:2308.01193v1 [cs.CR])\nAbstract: DNN accelerators have been widely deployed in many scenarios to speed up the inference process and reduce the energy consumption. One big concern about the usage of the accelerators is the confidentiality of the deployed models: model inference execution on the accelerators could leak side-channel information, which enables an adversary to preciously recover the model details. Such model extraction attacks can not only compromise the intellectual property of DNN models, but also facilitate some adversarial attacks.  Although previous works have demonstrated a number of side-channel techniques to extract models from DNN accelerators, they are not practical for two reasons. (1) They only target simplified accelerator implementations, which have limited practicality in the real world. (2) They require heavy human analysis and domain knowledge. To overcome these limitations, this paper presents Mercury, the first automated remote side-channel attack against the off-the-shelf Nvidia DNN acc",
    "path": "papers/23/08/2308.01193.json",
    "total_tokens": 758,
    "translated_title": "Mercury:一种用于Nvidia深度学习加速器的自动远程侧信道攻击",
    "translated_abstract": "DNN加速器被广泛用于许多场景，以加速推理过程并减少能源消耗。然而，使用加速器的一个重大关注点是已部署模型的保密性：在加速器上进行模型推理执行可能会泄露侧信道信息，使得对手能够精确地恢复模型详情。这种模型提取攻击不仅会危及DNN模型的知识产权，还会促使某些对抗性攻击。",
    "tldr": "该论文介绍了Mercury，这是一种针对现成的Nvidia DNN加速器的自动化远程侧信道攻击。它能够克服现有工作中的几个限制，包括只针对简化的加速器实现和需要大量人工分析和领域知识等。",
    "en_tdlr": "The paper presents Mercury, the first automated remote side-channel attack against the off-the-shelf Nvidia DNN accelerator. It overcomes the limitations of previous works including targeting only simplified accelerator implementations and requiring heavy human analysis and domain knowledge."
}