{
    "title": "Self-Supervised Learning for WiFi CSI-Based Human Activity Recognition: A Systematic Study. (arXiv:2308.02412v1 [eess.SP])",
    "abstract": "Recently, with the advancement of the Internet of Things (IoT), WiFi CSI-based HAR has gained increasing attention from academic and industry communities. By integrating the deep learning technology with CSI-based HAR, researchers achieve state-of-the-art performance without the need of expert knowledge. However, the scarcity of labeled CSI data remains the most prominent challenge when applying deep learning models in the context of CSI-based HAR due to the privacy and incomprehensibility of CSI-based HAR data. On the other hand, SSL has emerged as a promising approach for learning meaningful representations from data without heavy reliance on labeled examples. Therefore, considerable efforts have been made to address the challenge of insufficient data in deep learning by leveraging SSL algorithms. In this paper, we undertake a comprehensive inventory and analysis of the potential held by different categories of SSL algorithms, including those that have been previously studied and tho",
    "link": "http://arxiv.org/abs/2308.02412",
    "context": "Title: Self-Supervised Learning for WiFi CSI-Based Human Activity Recognition: A Systematic Study. (arXiv:2308.02412v1 [eess.SP])\nAbstract: Recently, with the advancement of the Internet of Things (IoT), WiFi CSI-based HAR has gained increasing attention from academic and industry communities. By integrating the deep learning technology with CSI-based HAR, researchers achieve state-of-the-art performance without the need of expert knowledge. However, the scarcity of labeled CSI data remains the most prominent challenge when applying deep learning models in the context of CSI-based HAR due to the privacy and incomprehensibility of CSI-based HAR data. On the other hand, SSL has emerged as a promising approach for learning meaningful representations from data without heavy reliance on labeled examples. Therefore, considerable efforts have been made to address the challenge of insufficient data in deep learning by leveraging SSL algorithms. In this paper, we undertake a comprehensive inventory and analysis of the potential held by different categories of SSL algorithms, including those that have been previously studied and tho",
    "path": "papers/23/08/2308.02412.json",
    "total_tokens": 1024,
    "translated_title": "基于WiFi CSI的自监督学习的人体活动识别：系统性研究",
    "translated_abstract": "最近，随着物联网（IoT）的发展，基于WiFi CSI的人体活动识别(HAR)引起了学术界和工业界的越来越多的关注。通过将深度学习技术与基于CSI的HAR相结合，研究人员在不需要专家知识的情况下实现了最先进的性能。然而，在基于CSI的HAR的背景下，标记CSI数据的稀缺性仍然是应用深度学习模型时最突出的挑战，这是由于CSI数据的隐私性和不可理解性。另一方面，自监督学习（SSL）作为一种在不重视标记示例的情况下从数据中学习有意义表示的有前途的方法已经出现。因此，通过利用SSL算法来解决深度学习中数据不足的挑战已经做出了相当大的努力。在本文中，我们对不同类型的SSL算法的潜力进行了全面的整理和分析，包括以前研究过的算法和那些还没有得到广泛研究的算法。",
    "tldr": "本研究对基于WiFi CSI的人体活动识别进行了自监督学习，提出了一种解决深度学习中数据不足的方法。通过将深度学习技术与CSI数据相结合，实现了最先进的性能，无需专家知识。研究人员通过分析不同类型的自监督学习算法的潜力，对缺乏标记CSI数据的挑战进行了全面的整理和分析。",
    "en_tdlr": "In this study, self-supervised learning was applied to WiFi CSI-based human activity recognition, addressing the challenge of insufficient labeled data in deep learning. By integrating deep learning technology with CSI data, state-of-the-art performance was achieved without the need for expert knowledge. Researchers conducted a comprehensive inventory and analysis of different categories of self-supervised learning algorithms to overcome the scarcity of labeled CSI data."
}