{
    "title": "Towards Lightweight Data Integration using Multi-workflow Provenance and Data Observability. (arXiv:2308.09004v1 [cs.DC])",
    "abstract": "Modern large-scale scientific discovery requires multidisciplinary collaboration across diverse computing facilities, including High Performance Computing (HPC) machines and the Edge-to-Cloud continuum. Integrated data analysis plays a crucial role in scientific discovery, especially in the current AI era, by enabling Responsible AI development, FAIR, Reproducibility, and User Steering. However, the heterogeneous nature of science poses challenges such as dealing with multiple supporting tools, cross-facility environments, and efficient HPC execution. Building on data observability, adapter system design, and provenance, we propose MIDA: an approach for lightweight runtime Multi-workflow Integrated Data Analysis. MIDA defines data observability strategies and adaptability methods for various parallel systems and machine learning tools. With observability, it intercepts the dataflows in the background without requiring instrumentation while integrating domain, provenance, and telemetry ",
    "link": "http://arxiv.org/abs/2308.09004",
    "context": "Title: Towards Lightweight Data Integration using Multi-workflow Provenance and Data Observability. (arXiv:2308.09004v1 [cs.DC])\nAbstract: Modern large-scale scientific discovery requires multidisciplinary collaboration across diverse computing facilities, including High Performance Computing (HPC) machines and the Edge-to-Cloud continuum. Integrated data analysis plays a crucial role in scientific discovery, especially in the current AI era, by enabling Responsible AI development, FAIR, Reproducibility, and User Steering. However, the heterogeneous nature of science poses challenges such as dealing with multiple supporting tools, cross-facility environments, and efficient HPC execution. Building on data observability, adapter system design, and provenance, we propose MIDA: an approach for lightweight runtime Multi-workflow Integrated Data Analysis. MIDA defines data observability strategies and adaptability methods for various parallel systems and machine learning tools. With observability, it intercepts the dataflows in the background without requiring instrumentation while integrating domain, provenance, and telemetry ",
    "path": "papers/23/08/2308.09004.json",
    "total_tokens": 909,
    "translated_title": "以多工作流可信度和数据可观测性为基础的轻量级数据集成",
    "translated_abstract": "现代大规模科学发现需要跨多个计算设施进行多学科合作，包括高性能计算（HPC）机器和边缘到云的连续体。集成的数据分析在科学发现中起着至关重要的作用，特别是在当前人工智能时代，通过支持负责任的AI开发、FAIR、可复现性和用户操控。然而，科学的异构性带来了挑战，如处理多个支持工具、跨设施环境和高效的HPC执行。在数据可观测性、适配器系统设计和可信度的基础上，我们提出了MIDA：一种轻量级运行时多工作流集成数据分析的方法。MIDA定义了各种并行系统和机器学习工具的数据可观测策略和适应性方法。通过可观测性，它在后台拦截数据流，无需仪器化，同时集成领域、可信度和遥测数据。",
    "tldr": "本论文提出MIDA方法，以多工作流可信度和数据可观测性为基础，实现了轻量级的运行时集成数据分析。该方法通过定义数据可观测策略和适应性方法，可以处理异构科学环境下多个支持工具和高效的HPC执行。"
}