{
    "title": "Improving Generative Model-based Unfolding with Schr\\\"{o}dinger Bridges. (arXiv:2308.12351v1 [hep-ph])",
    "abstract": "Machine learning-based unfolding has enabled unbinned and high-dimensional differential cross section measurements. Two main approaches have emerged in this research area: one based on discriminative models and one based on generative models. The main advantage of discriminative models is that they learn a small correction to a starting simulation while generative models scale better to regions of phase space with little data. We propose to use Schroedinger Bridges and diffusion models to create SBUnfold, an unfolding approach that combines the strengths of both discriminative and generative models. The key feature of SBUnfold is that its generative model maps one set of events into another without having to go through a known probability density as is the case for normalizing flows and standard diffusion models. We show that SBUnfold achieves excellent performance compared to state of the art methods on a synthetic Z+jets dataset.",
    "link": "http://arxiv.org/abs/2308.12351",
    "context": "Title: Improving Generative Model-based Unfolding with Schr\\\"{o}dinger Bridges. (arXiv:2308.12351v1 [hep-ph])\nAbstract: Machine learning-based unfolding has enabled unbinned and high-dimensional differential cross section measurements. Two main approaches have emerged in this research area: one based on discriminative models and one based on generative models. The main advantage of discriminative models is that they learn a small correction to a starting simulation while generative models scale better to regions of phase space with little data. We propose to use Schroedinger Bridges and diffusion models to create SBUnfold, an unfolding approach that combines the strengths of both discriminative and generative models. The key feature of SBUnfold is that its generative model maps one set of events into another without having to go through a known probability density as is the case for normalizing flows and standard diffusion models. We show that SBUnfold achieves excellent performance compared to state of the art methods on a synthetic Z+jets dataset.",
    "path": "papers/23/08/2308.12351.json",
    "total_tokens": 870,
    "translated_title": "用Schrödinger桥改进基于生成模型的展开",
    "translated_abstract": "基于机器学习的展开已经实现了无bin和高维微分截面测量。这个研究领域出现了两种主要方法：一种基于判别模型，一种基于生成模型。判别模型的主要优势在于，它们学习了对起始模拟的小修正，而生成模型在数据稀疏的相空间区域具有更好的扩展性。我们提出使用Schrödinger桥和扩散模型创建SBUnfold，一种将判别模型和生成模型的优势结合起来的展开方法。SBUnfold的关键特点是它的生成模型将一组事件映射到另一组事件，而无需通过已知的概率密度（与标准扩散模型和标准扩散模型不同）。我们展示了SBUnfold在合成的Z+jets数据集上与最先进方法相比的出色性能。",
    "tldr": "本研究提出了一种使用Schrödinger桥和扩散模型创建的展开方法SBUnfold，它将判别模型和生成模型的优势结合起来。与最先进方法相比，在合成的Z+jets数据集上获得了卓越的性能。"
}