{
    "title": "Generative Model for Models: Rapid DNN Customization for Diverse Tasks and Resource Constraints. (arXiv:2308.15003v1 [cs.AI])",
    "abstract": "Unlike cloud-based deep learning models that are often large and uniform, edge-deployed models usually demand customization for domain-specific tasks and resource-limited environments. Such customization processes can be costly and time-consuming due to the diversity of edge scenarios and the training load for each scenario. Although various approaches have been proposed for rapid resource-oriented customization and task-oriented customization respectively, achieving both of them at the same time is challenging. Drawing inspiration from the generative AI and the modular composability of neural networks, we introduce NN-Factory, an one-for-all framework to generate customized lightweight models for diverse edge scenarios. The key idea is to use a generative model to directly produce the customized models, instead of training them. The main components of NN-Factory include a modular supernet with pretrained modules that can be conditionally activated to accomplish different tasks and a g",
    "link": "http://arxiv.org/abs/2308.15003",
    "context": "Title: Generative Model for Models: Rapid DNN Customization for Diverse Tasks and Resource Constraints. (arXiv:2308.15003v1 [cs.AI])\nAbstract: Unlike cloud-based deep learning models that are often large and uniform, edge-deployed models usually demand customization for domain-specific tasks and resource-limited environments. Such customization processes can be costly and time-consuming due to the diversity of edge scenarios and the training load for each scenario. Although various approaches have been proposed for rapid resource-oriented customization and task-oriented customization respectively, achieving both of them at the same time is challenging. Drawing inspiration from the generative AI and the modular composability of neural networks, we introduce NN-Factory, an one-for-all framework to generate customized lightweight models for diverse edge scenarios. The key idea is to use a generative model to directly produce the customized models, instead of training them. The main components of NN-Factory include a modular supernet with pretrained modules that can be conditionally activated to accomplish different tasks and a g",
    "path": "papers/23/08/2308.15003.json",
    "total_tokens": 880,
    "translated_title": "模型的生成模型：针对各种任务和资源限制的快速深度神经网络定制",
    "translated_abstract": "与通常大而统一的基于云的深度学习模型不同，部署在边缘的模型通常需要针对特定领域任务和资源有限环境的定制化。由于边缘场景的多样性和每个场景的训练负载，这种定制化过程可能是昂贵和耗时的。尽管已经提出了各种方法来分别实现快速面向资源的定制化和面向任务的定制化，但同时实现这两者仍然具有挑战性。受到生成型人工智能和神经网络模块可组合性的启示，我们引入了NN-Factory，一个一站式框架，用于为各种边缘场景生成定制轻量级模型。关键思想是使用生成模型直接生成定制的模型，而不是进行训练。NN-Factory的主要组成部分包括一个模块化超网络和可以有条件激活以完成不同任务的预训练模块。",
    "tldr": "该论文提出了一个一站式框架NN-Factory，通过使用生成模型直接生成定制的轻量级模型，实现了快速针对各种边缘场景的资源定制化和任务定制化。",
    "en_tdlr": "This paper introduces NN-Factory, a one-for-all framework that uses a generative model to generate customized lightweight models for diverse edge scenarios. It achieves rapid resource-oriented customization and task-oriented customization by directly producing the customized models instead of training them."
}