{
    "title": "ECG classification using Deep CNN and Gramian Angular Field. (arXiv:2308.02395v1 [eess.SP])",
    "abstract": "This paper study provides a novel contribution to the field of signal processing and DL for ECG signal analysis by introducing a new feature representation method for ECG signals. The proposed method is based on transforming time frequency 1D vectors into 2D images using Gramian Angular Field transform. Moving on, the classification of the transformed ECG signals is performed using Convolutional Neural Networks (CNN). The obtained results show a classification accuracy of 97.47% and 98.65% for anomaly detection. Accordingly, in addition to improving the classification performance compared to the state-of-the-art, the feature representation helps identify and visualize temporal patterns in the ECG signal, such as changes in heart rate, rhythm, and morphology, which may not be apparent in the original signal. This has significant implications in the diagnosis and treatment of cardiovascular diseases and detection of anomalies.",
    "link": "http://arxiv.org/abs/2308.02395",
    "context": "Title: ECG classification using Deep CNN and Gramian Angular Field. (arXiv:2308.02395v1 [eess.SP])\nAbstract: This paper study provides a novel contribution to the field of signal processing and DL for ECG signal analysis by introducing a new feature representation method for ECG signals. The proposed method is based on transforming time frequency 1D vectors into 2D images using Gramian Angular Field transform. Moving on, the classification of the transformed ECG signals is performed using Convolutional Neural Networks (CNN). The obtained results show a classification accuracy of 97.47% and 98.65% for anomaly detection. Accordingly, in addition to improving the classification performance compared to the state-of-the-art, the feature representation helps identify and visualize temporal patterns in the ECG signal, such as changes in heart rate, rhythm, and morphology, which may not be apparent in the original signal. This has significant implications in the diagnosis and treatment of cardiovascular diseases and detection of anomalies.",
    "path": "papers/23/08/2308.02395.json",
    "total_tokens": 911,
    "translated_title": "使用深度卷积神经网络和Gramm角度场的ECG分类研究",
    "translated_abstract": "本文通过引入一种新的特征表示方法，即Gramm角度场变换，为ECG信号分析的信号处理和深度学习领域提供了一项创新贡献。所提出的方法是将时间频率1D向量转换为2D图像，然后使用卷积神经网络(CNN)对转换后的ECG信号进行分类。实验结果显示，异常检测的分类准确率达到了97.47%和98.65%。与最先进的方法相比，该特征表示方法不仅改善了分类性能，还有助于识别和可视化ECG信号中的时域模式，例如心率、节律和形态的变化，这在心血管疾病的诊断和治疗以及异常检测中具有重要意义。",
    "tldr": "本文介绍了一种使用深度卷积神经网络和Gramm角度场的ECG分类方法，通过将时间频率1D向量转换为2D图像，并对转换后的ECG信号进行分类，达到了高准确率。该方法改善了分类性能，同时还有助于识别和可视化ECG信号中的时域模式，在心血管疾病诊断和治疗以及异常检测方面具有重要意义。",
    "en_tdlr": "This paper presents a novel ECG classification method using deep convolutional neural networks and Gramian Angular Field, achieving high accuracy by transforming 1D vectors into 2D images and performing classification. The method not only improves classification performance, but also helps identify and visualize temporal patterns in ECG signals, with significant implications in cardiovascular disease diagnosis and treatment as well as anomaly detection."
}