{
    "title": "Objective-Agnostic Enhancement of Molecule Properties via Multi-Stage VAE. (arXiv:2308.13066v1 [cs.LG])",
    "abstract": "Variational autoencoder (VAE) is a popular method for drug discovery and various architectures and pipelines have been proposed to improve its performance. However, VAE approaches are known to suffer from poor manifold recovery when the data lie on a low-dimensional manifold embedded in a higher dimensional ambient space [Dai and Wipf, 2019]. The consequences of it in drug discovery are somewhat under-explored. In this paper, we explore applying a multi-stage VAE approach, that can improve manifold recovery on a synthetic dataset, to the field of drug discovery. We experimentally evaluate our multi-stage VAE approach using the ChEMBL dataset and demonstrate its ability to improve the property statistics of generated molecules substantially from pre-existing methods without incorporating property predictors into the training pipeline. We further fine-tune our models on two curated and much smaller molecule datasets that target different proteins. Our experiments show an increase in the ",
    "link": "http://arxiv.org/abs/2308.13066",
    "context": "Title: Objective-Agnostic Enhancement of Molecule Properties via Multi-Stage VAE. (arXiv:2308.13066v1 [cs.LG])\nAbstract: Variational autoencoder (VAE) is a popular method for drug discovery and various architectures and pipelines have been proposed to improve its performance. However, VAE approaches are known to suffer from poor manifold recovery when the data lie on a low-dimensional manifold embedded in a higher dimensional ambient space [Dai and Wipf, 2019]. The consequences of it in drug discovery are somewhat under-explored. In this paper, we explore applying a multi-stage VAE approach, that can improve manifold recovery on a synthetic dataset, to the field of drug discovery. We experimentally evaluate our multi-stage VAE approach using the ChEMBL dataset and demonstrate its ability to improve the property statistics of generated molecules substantially from pre-existing methods without incorporating property predictors into the training pipeline. We further fine-tune our models on two curated and much smaller molecule datasets that target different proteins. Our experiments show an increase in the ",
    "path": "papers/23/08/2308.13066.json",
    "total_tokens": 844,
    "translated_title": "通过多阶段VAE对分子属性进行客观无关的改进",
    "translated_abstract": "变分自编码器（VAE）是药物发现的一种流行方法，已经提出了各种架构和流程来改善其性能。然而，已知VAE方法在数据位于高维环境空间中嵌入的低维流形上时，很难恢复流形。在药物发现领域，这一问题尚未得到充分探索。本文中，我们探索了一种可以改善合成数据集上的流形恢复的多阶段VAE方法，并将其应用到药物发现领域。我们使用ChEMBL数据集对我们的多阶段VAE方法进行了实验评估，并展示了该方法在不将属性预测器纳入训练流程的前提下，显著改善了所生成分子的属性统计。我们进一步在两个精心策划且较小的分子数据集上对模型进行了微调，这两个数据集针对不同的蛋白质。实验结果显示了属性的增加。",
    "tldr": "本文提出了一种多阶段VAE方法，可以改善在药物发现领域中恢复低维流形的问题。实验结果表明，该方法显著改善了生成分子的属性统计，而无需集成属性预测器。"
}