{
    "title": "Practical Anomaly Detection over Multivariate Monitoring Metrics for Online Services. (arXiv:2308.09937v1 [cs.SE])",
    "abstract": "As modern software systems continue to grow in terms of complexity and volume, anomaly detection on multivariate monitoring metrics, which profile systems' health status, becomes more and more critical and challenging. In particular, the dependency between different metrics and their historical patterns plays a critical role in pursuing prompt and accurate anomaly detection. Existing approaches fall short of industrial needs for being unable to capture such information efficiently. To fill this significant gap, in this paper, we propose CMAnomaly, an anomaly detection framework on multivariate monitoring metrics based on collaborative machine. The proposed collaborative machine is a mechanism to capture the pairwise interactions along with feature and temporal dimensions with linear time complexity. Cost-effective models can then be employed to leverage both the dependency between monitoring metrics and their historical patterns for anomaly detection. The proposed framework is extensiv",
    "link": "http://arxiv.org/abs/2308.09937",
    "context": "Title: Practical Anomaly Detection over Multivariate Monitoring Metrics for Online Services. (arXiv:2308.09937v1 [cs.SE])\nAbstract: As modern software systems continue to grow in terms of complexity and volume, anomaly detection on multivariate monitoring metrics, which profile systems' health status, becomes more and more critical and challenging. In particular, the dependency between different metrics and their historical patterns plays a critical role in pursuing prompt and accurate anomaly detection. Existing approaches fall short of industrial needs for being unable to capture such information efficiently. To fill this significant gap, in this paper, we propose CMAnomaly, an anomaly detection framework on multivariate monitoring metrics based on collaborative machine. The proposed collaborative machine is a mechanism to capture the pairwise interactions along with feature and temporal dimensions with linear time complexity. Cost-effective models can then be employed to leverage both the dependency between monitoring metrics and their historical patterns for anomaly detection. The proposed framework is extensiv",
    "path": "papers/23/08/2308.09937.json",
    "total_tokens": 835,
    "translated_title": "在线服务的多变量监测指标实用异常检测",
    "translated_abstract": "随着现代软件系统在复杂性和数据量方面不断增长，对多变量监测指标进行异常检测变得越来越重要和具有挑战性。特别是不同指标之间的依赖关系及其历史模式在追求及时准确的异常检测中起着关键作用。现有方法无法高效捕捉这种信息，无法满足工业需求。为了填补这一重要差距，本文提出了一种基于协同机制的多变量监测指标异常检测框架CMAnomaly。所提出的协同机制是一种能够以线性时间复杂度捕捉特征和时间维度上的成对交互的机制。然后可以使用成本效益模型来利用监测指标之间的依赖关系和其历史模式进行异常检测。该提出的框架得到了广泛应用。",
    "tldr": "本论文提出了一个基于协同机制的多变量监测指标异常检测框架，能够高效捕捉不同指标之间的依赖关系及其历史模式，实现了在线服务的实用异常检测。",
    "en_tdlr": "This paper proposes a collaborative mechanism-based framework for anomaly detection on multivariate monitoring metrics, which efficiently captures the dependency between different metrics and their historical patterns, achieving practical anomaly detection for online services."
}