{
    "title": "Hybrid Genetic Algorithm and Hill Climbing Optimization for the Neural Network. (arXiv:2308.13099v1 [cs.NE])",
    "abstract": "In this paper, we propose a hybrid model combining genetic algorithm and hill climbing algorithm for optimizing Convolutional Neural Networks (CNNs) on the CIFAR-100 dataset. The proposed model utilizes a population of chromosomes that represent the hyperparameters of the CNN model. The genetic algorithm is used for selecting and breeding the fittest chromosomes to generate new offspring. The hill climbing algorithm is then applied to the offspring to further optimize their hyperparameters. The mutation operation is introduced to diversify the population and to prevent the algorithm from getting stuck in local optima. The Genetic Algorithm is used for global search and exploration of the search space, while Hill Climbing is used for local optimization of promising solutions. The objective function is the accuracy of the trained neural network on the CIFAR-100 test set. The performance of the hybrid model is evaluated by comparing it with the standard genetic algorithm and hill-climbing",
    "link": "http://arxiv.org/abs/2308.13099",
    "context": "Title: Hybrid Genetic Algorithm and Hill Climbing Optimization for the Neural Network. (arXiv:2308.13099v1 [cs.NE])\nAbstract: In this paper, we propose a hybrid model combining genetic algorithm and hill climbing algorithm for optimizing Convolutional Neural Networks (CNNs) on the CIFAR-100 dataset. The proposed model utilizes a population of chromosomes that represent the hyperparameters of the CNN model. The genetic algorithm is used for selecting and breeding the fittest chromosomes to generate new offspring. The hill climbing algorithm is then applied to the offspring to further optimize their hyperparameters. The mutation operation is introduced to diversify the population and to prevent the algorithm from getting stuck in local optima. The Genetic Algorithm is used for global search and exploration of the search space, while Hill Climbing is used for local optimization of promising solutions. The objective function is the accuracy of the trained neural network on the CIFAR-100 test set. The performance of the hybrid model is evaluated by comparing it with the standard genetic algorithm and hill-climbing",
    "path": "papers/23/08/2308.13099.json",
    "total_tokens": 950,
    "translated_title": "混合遗传算法和爬山算法优化神经网络",
    "translated_abstract": "本文提出了一种混合模型，将遗传算法和爬山算法结合起来，用于在CIFAR-100数据集上优化卷积神经网络（CNN）。该模型利用一个染色体种群来表示CNN模型的超参数。遗传算法用于选择和繁殖最适应的染色体生成新的后代。然后，爬山算法被应用于后代上，进一步优化它们的超参数。引入变异操作以使种群多样化，并防止算法陷入局部最优解。遗传算法用于全局搜索和探索搜索空间，而爬山算法用于局部优化有前景的解决方案。目标函数是在CIFAR-100测试集上训练的神经网络的准确率。通过与标准的遗传算法和爬山算法进行比较，评估了混合模型的性能。",
    "tldr": "本文提出了一种混合遗传算法和爬山算法的模型，用于在CIFAR-100数据集上优化卷积神经网络。该模型利用遗传算法进行全局搜索和探索搜索空间，在此基础上使用爬山算法进行局部优化，并引入变异操作以避免局部最优解。评估结果表明该模型相较于标准的遗传算法和爬山算法在性能上有所提升。",
    "en_tdlr": "This paper proposes a hybrid model combining genetic algorithm and hill climbing algorithm to optimize convolutional neural networks on the CIFAR-100 dataset. The model utilizes genetic algorithm for global search and exploration, and hill climbing algorithm for local optimization, with the introduction of mutation operation to avoid local optima. Evaluation results demonstrate that the proposed model outperforms standard genetic algorithm and hill climbing algorithm in terms of performance."
}