{
    "title": "Aphid Cluster Recognition and Detection in the Wild Using Deep Learning Models. (arXiv:2308.05881v1 [cs.CV])",
    "abstract": "Aphid infestation poses a significant threat to crop production, rural communities, and global food security. While chemical pest control is crucial for maximizing yields, applying chemicals across entire fields is both environmentally unsustainable and costly. Hence, precise localization and management of aphids are essential for targeted pesticide application. The paper primarily focuses on using deep learning models for detecting aphid clusters. We propose a novel approach for estimating infection levels by detecting aphid clusters. To facilitate this research, we have captured a large-scale dataset from sorghum fields, manually selected 5,447 images containing aphids, and annotated each individual aphid cluster within these images. To facilitate the use of machine learning models, we further process the images by cropping them into patches, resulting in a labeled dataset comprising 151,380 image patches. Then, we implemented and compared the performance of four state-of-the-art obj",
    "link": "http://arxiv.org/abs/2308.05881",
    "context": "Title: Aphid Cluster Recognition and Detection in the Wild Using Deep Learning Models. (arXiv:2308.05881v1 [cs.CV])\nAbstract: Aphid infestation poses a significant threat to crop production, rural communities, and global food security. While chemical pest control is crucial for maximizing yields, applying chemicals across entire fields is both environmentally unsustainable and costly. Hence, precise localization and management of aphids are essential for targeted pesticide application. The paper primarily focuses on using deep learning models for detecting aphid clusters. We propose a novel approach for estimating infection levels by detecting aphid clusters. To facilitate this research, we have captured a large-scale dataset from sorghum fields, manually selected 5,447 images containing aphids, and annotated each individual aphid cluster within these images. To facilitate the use of machine learning models, we further process the images by cropping them into patches, resulting in a labeled dataset comprising 151,380 image patches. Then, we implemented and compared the performance of four state-of-the-art obj",
    "path": "papers/23/08/2308.05881.json",
    "total_tokens": 916,
    "translated_title": "采用深度学习模型在野外识别和检测蚜虫集群",
    "translated_abstract": "蚜虫侵害对农作物生产、农村社区和全球粮食安全构成重大威胁。虽然化学杀虫剂对于最大化产量至关重要，但在整个田地上施药既不环保也昂贵。因此，准确定位和管理蚜虫对于有针对性地施药至关重要。该论文主要关注使用深度学习模型来检测蚜虫集群。我们提出了一种新颖的方法，通过检测蚜虫集群来估计感染水平。为了促进这项研究，我们从高粱田采集了一组大规模的数据集，手动选择了5,447张包含蚜虫的图像，并在这些图像中注释了每个单独的蚜虫集群。为了方便机器学习模型的使用，我们进一步将这些图像裁剪成小块进行处理，得到一个包含151,380个图像块的标记数据集。然后，我们实现并比较了四种最先进的目标检测算法的性能。",
    "tldr": "该论文使用深度学习模型识别和检测野外的蚜虫集群，提出了一种新的方法来估计感染水平，并通过采集大规模数据集进行了验证和比较。"
}