{
    "title": "Using Visual and Vehicular Sensors for Driver Behavior Analysis: A Survey. (arXiv:2308.13406v1 [cs.LG])",
    "abstract": "Risky drivers account for 70% of fatal accidents in the United States. With recent advances in sensors and intelligent vehicular systems, there has been significant research on assessing driver behavior to improve driving experiences and road safety. This paper examines the various techniques used to analyze driver behavior using visual and vehicular data, providing an overview of the latest research in this field. The paper also discusses the challenges and open problems in the field and offers potential recommendations for future research. The survey concludes that integrating vision and vehicular information can significantly enhance the accuracy and effectiveness of driver behavior analysis, leading to improved safety measures and reduced traffic accidents.",
    "link": "http://arxiv.org/abs/2308.13406",
    "context": "Title: Using Visual and Vehicular Sensors for Driver Behavior Analysis: A Survey. (arXiv:2308.13406v1 [cs.LG])\nAbstract: Risky drivers account for 70% of fatal accidents in the United States. With recent advances in sensors and intelligent vehicular systems, there has been significant research on assessing driver behavior to improve driving experiences and road safety. This paper examines the various techniques used to analyze driver behavior using visual and vehicular data, providing an overview of the latest research in this field. The paper also discusses the challenges and open problems in the field and offers potential recommendations for future research. The survey concludes that integrating vision and vehicular information can significantly enhance the accuracy and effectiveness of driver behavior analysis, leading to improved safety measures and reduced traffic accidents.",
    "path": "papers/23/08/2308.13406.json",
    "total_tokens": 787,
    "translated_title": "使用视觉和车辆传感器进行驾驶行为分析：一项综述",
    "translated_abstract": "在美国，高风险驾驶者占致命事故的70%。随着传感器和智能车载系统的最新进展，对于评估驾驶行为以改善驾驶体验和道路安全的研究显著增加。本文通过检查使用视觉和车辆数据分析驾驶行为的各种技术，概述了该领域的最新研究。本文还讨论了该领域面临的挑战和未解决问题，并提供了未来研究的潜在建议。综述得出结论，将视觉和车辆信息相结合可以显著提高驾驶行为分析的准确性和效果，从而改善安全措施并减少交通事故。",
    "tldr": "该综述介绍了使用视觉和车辆传感器分析驾驶行为的技术，指出将视觉和车辆信息相结合可以提高分析的准确性和效果，从而改善驾驶安全和减少交通事故。",
    "en_tdlr": "This survey examines the techniques of analyzing driver behavior using visual and vehicular sensors, and concludes that integrating vision and vehicular information can enhance the accuracy and effectiveness of the analysis, leading to improved driving safety and reduced traffic accidents."
}