{
    "title": "Ten Years of Generative Adversarial Nets (GANs): A survey of the state-of-the-art. (arXiv:2308.16316v1 [cs.LG])",
    "abstract": "Since their inception in 2014, Generative Adversarial Networks (GANs) have rapidly emerged as powerful tools for generating realistic and diverse data across various domains, including computer vision and other applied areas. Consisting of a discriminative network and a generative network engaged in a Minimax game, GANs have revolutionized the field of generative modeling. In February 2018, GAN secured the leading spot on the ``Top Ten Global Breakthrough Technologies List'' issued by the Massachusetts Science and Technology Review. Over the years, numerous advancements have been proposed, leading to a rich array of GAN variants, such as conditional GAN, Wasserstein GAN, CycleGAN, and StyleGAN, among many others. This survey aims to provide a general overview of GANs, summarizing the latent architecture, validation metrics, and application areas of the most widely recognized variants. We also delve into recent theoretical developments, exploring the profound connection between the adve",
    "link": "http://arxiv.org/abs/2308.16316",
    "context": "Title: Ten Years of Generative Adversarial Nets (GANs): A survey of the state-of-the-art. (arXiv:2308.16316v1 [cs.LG])\nAbstract: Since their inception in 2014, Generative Adversarial Networks (GANs) have rapidly emerged as powerful tools for generating realistic and diverse data across various domains, including computer vision and other applied areas. Consisting of a discriminative network and a generative network engaged in a Minimax game, GANs have revolutionized the field of generative modeling. In February 2018, GAN secured the leading spot on the ``Top Ten Global Breakthrough Technologies List'' issued by the Massachusetts Science and Technology Review. Over the years, numerous advancements have been proposed, leading to a rich array of GAN variants, such as conditional GAN, Wasserstein GAN, CycleGAN, and StyleGAN, among many others. This survey aims to provide a general overview of GANs, summarizing the latent architecture, validation metrics, and application areas of the most widely recognized variants. We also delve into recent theoretical developments, exploring the profound connection between the adve",
    "path": "papers/23/08/2308.16316.json",
    "total_tokens": 962,
    "translated_title": "十年生成对抗网络（GANs）的综述：最新技术的调查",
    "translated_abstract": "自2014年诞生以来，生成对抗网络（GANs）迅速成为在计算机视觉和其他应用领域生成逼真且多样化数据的强大工具。GANs由一个判别网络和一个生成网络组成，它们在一个极小极大博弈中相互对抗，彻底改变了生成建模领域。在2018年2月，GAN被马萨诸塞州科技评论发布的“全球十大突破性技术列表”中排名第一。多年来，人们提出了许多先进技术，导致了各种GAN变种的丰富。这篇综述旨在提供GANs的概述，总结了广泛认可的变种的潜在架构、验证指标和应用领域。我们还深入研究了最近的理论发展，探索了对抗网络与统计学、信息论和优化方法之间的深刻联系。",
    "tldr": "生成对抗网络（GANs）自2014年诞生以来快速发展，它是一种在计算机视觉和其他领域生成逼真且多样化数据的强大工具。本文综述了GANs的最新技术发展和应用领域，并深入研究了GAN与统计学、信息论和优化方法之间的关系。",
    "en_tdlr": "Generative Adversarial Networks (GANs) have rapidly developed since their inception in 2014, and they are a powerful tool for generating realistic and diverse data in computer vision and other domains. This survey reviews the latest technological developments and application areas of GANs, and explores the profound connection between GANs and statistics, information theory, and optimization methods."
}