{
    "title": "Gaussian Image Anomaly Detection with Greedy Eigencomponent Selection. (arXiv:2308.04944v1 [cs.CV])",
    "abstract": "Anomaly detection (AD) in images, identifying significant deviations from normality, is a critical issue in computer vision. This paper introduces a novel approach to dimensionality reduction for AD using pre-trained convolutional neural network (CNN) that incorporate EfficientNet models. We investigate the importance of component selection and propose two types of tree search approaches, both employing a greedy strategy, for optimal eigencomponent selection. Our study conducts three main experiments to evaluate the effectiveness of our approach. The first experiment explores the influence of test set performance on component choice, the second experiment examines the performance when we train on one anomaly type and evaluate on all other types, and the third experiment investigates the impact of using a minimum number of images for training and selecting them based on anomaly types. Our approach aims to find the optimal subset of components that deliver the highest performance score, ",
    "link": "http://arxiv.org/abs/2308.04944",
    "context": "Title: Gaussian Image Anomaly Detection with Greedy Eigencomponent Selection. (arXiv:2308.04944v1 [cs.CV])\nAbstract: Anomaly detection (AD) in images, identifying significant deviations from normality, is a critical issue in computer vision. This paper introduces a novel approach to dimensionality reduction for AD using pre-trained convolutional neural network (CNN) that incorporate EfficientNet models. We investigate the importance of component selection and propose two types of tree search approaches, both employing a greedy strategy, for optimal eigencomponent selection. Our study conducts three main experiments to evaluate the effectiveness of our approach. The first experiment explores the influence of test set performance on component choice, the second experiment examines the performance when we train on one anomaly type and evaluate on all other types, and the third experiment investigates the impact of using a minimum number of images for training and selecting them based on anomaly types. Our approach aims to find the optimal subset of components that deliver the highest performance score, ",
    "path": "papers/23/08/2308.04944.json",
    "total_tokens": 849,
    "translated_title": "使用贪婪特征值分量选择的高斯图像异常检测",
    "translated_abstract": "图像中的异常检测是计算机视觉中的关键问题，可以识别与正常情况明显偏离的地方。本文介绍了一种新的降维方法，用于采用EfficientNet模型的预训练卷积神经网络（CNN）来进行异常检测。我们研究了特征值分量选择的重要性，并提出了两种采用贪婪策略的树搜索方法，用于选择最优的特征值分量。我们的研究通过三个主要的实验来评估我们方法的有效性。第一个实验探索了测试集性能对特征值分量选择的影响，第二个实验研究了当我们在一个异常类型上进行训练并在所有其他类型上进行评估时的性能，第三个实验调查了使用最少数量的图像进行训练并根据异常类型选择这些图像的影响。我们的方法旨在找到最优的分量子集，以实现最高的性能得分。",
    "tldr": "本文提出了一种使用预训练的卷积神经网络进行图像异常检测的新方法，通过贪婪策略的特征值分量选择，寻找最优子集以提高性能得分。",
    "en_tdlr": "This paper presents a novel approach for image anomaly detection using pre-trained CNN, incorporating greedy eigencomponent selection to find an optimal subset for improved performance scores."
}