{
    "title": "Parental Health Penalty on Adult Children's Employment: Gender Difference and Long-Term Consequence. (arXiv:2308.13156v1 [econ.GN])",
    "abstract": "This paper examines the long-term gender-specific impacts of parental health shocks on adult children's employment in China. We build up an inter-temporal cooperative framework to analyze household work decisions in response to parental health deterioration. Then employing an event-study approach, we establish a causal link between parental health shocks and a notable decline in female employment rates. Male employment, however, remains largely unaffected. This negative impact shows no abatement up to eight years that are observable by the sample. These findings indicate the consequence of \"growing old before getting rich\" for developing countries.",
    "link": "http://arxiv.org/abs/2308.13156",
    "context": "Title: Parental Health Penalty on Adult Children's Employment: Gender Difference and Long-Term Consequence. (arXiv:2308.13156v1 [econ.GN])\nAbstract: This paper examines the long-term gender-specific impacts of parental health shocks on adult children's employment in China. We build up an inter-temporal cooperative framework to analyze household work decisions in response to parental health deterioration. Then employing an event-study approach, we establish a causal link between parental health shocks and a notable decline in female employment rates. Male employment, however, remains largely unaffected. This negative impact shows no abatement up to eight years that are observable by the sample. These findings indicate the consequence of \"growing old before getting rich\" for developing countries.",
    "path": "papers/23/08/2308.13156.json",
    "total_tokens": 721,
    "translated_title": "父母健康问题对成年子女就业的影响：性别差异和长期后果",
    "translated_abstract": "本文研究了父母健康冲击对中国成年子女就业的长期性别特定影响。我们建立了一个跨时合作框架，分析了在父母健康恶化的情况下家庭工作决策。然后使用事件研究方法，我们建立了父母健康冲击与女性就业率显著下降之间的因果关系。然而，男性就业率基本上没有受到影响。这种负面影响在样本可观察到的八年内没有减少。这些发现表明了发展中国家“在变富之前老去”的后果。",
    "tldr": "本文研究了父母健康冲击对中国成年子女就业的长期性别特定影响，发现女性就业率显著下降，而男性则基本上没有受到影响。",
    "en_tdlr": "This paper examines the long-term gender-specific impacts of parental health shocks on adult children's employment in China and finds that female employment rates decline significantly while male employment remains largely unaffected."
}