{
    "title": "Robust Representation Learning for Unreliable Partial Label Learning. (arXiv:2308.16718v1 [cs.LG])",
    "abstract": "Partial Label Learning (PLL) is a type of weakly supervised learning where each training instance is assigned a set of candidate labels, but only one label is the ground-truth. However, this idealistic assumption may not always hold due to potential annotation inaccuracies, meaning the ground-truth may not be present in the candidate label set. This is known as Unreliable Partial Label Learning (UPLL) that introduces an additional complexity due to the inherent unreliability and ambiguity of partial labels, often resulting in a sub-optimal performance with existing methods. To address this challenge, we propose the Unreliability-Robust Representation Learning framework (URRL) that leverages unreliability-robust contrastive learning to help the model fortify against unreliable partial labels effectively. Concurrently, we propose a dual strategy that combines KNN-based candidate label set correction and consistency-regularization-based label disambiguation to refine label quality and enh",
    "link": "http://arxiv.org/abs/2308.16718",
    "context": "Title: Robust Representation Learning for Unreliable Partial Label Learning. (arXiv:2308.16718v1 [cs.LG])\nAbstract: Partial Label Learning (PLL) is a type of weakly supervised learning where each training instance is assigned a set of candidate labels, but only one label is the ground-truth. However, this idealistic assumption may not always hold due to potential annotation inaccuracies, meaning the ground-truth may not be present in the candidate label set. This is known as Unreliable Partial Label Learning (UPLL) that introduces an additional complexity due to the inherent unreliability and ambiguity of partial labels, often resulting in a sub-optimal performance with existing methods. To address this challenge, we propose the Unreliability-Robust Representation Learning framework (URRL) that leverages unreliability-robust contrastive learning to help the model fortify against unreliable partial labels effectively. Concurrently, we propose a dual strategy that combines KNN-based candidate label set correction and consistency-regularization-based label disambiguation to refine label quality and enh",
    "path": "papers/23/08/2308.16718.json",
    "total_tokens": 903,
    "translated_title": "可靠性部分标签学习的鲁棒表示学习",
    "translated_abstract": "部分标签学习是一种弱监督学习，其中每个训练实例被分配一个候选标签集，但只有一个标签是真实的。然而，由于潜在的注释不准确性，这个理想化的假设并不总是成立，意味着真实标签可能不在候选标签集中。这被称为不可靠的部分标签学习，在现有方法中由于部分标签的不可靠性和不确定性而导致性能亚优。为了解决这个挑战，我们提出了一种名为可靠性鲁棒表示学习框架（URRL）的方法，它利用鲁棒对比学习来帮助模型有效地抵御不可靠的部分标签。同时，我们提出了一种双重策略，结合基于KNN的候选标签集校正和基于一致性正则化的标签消除来改进标签质量和提高性能。",
    "tldr": "本文介绍了一种解决不可靠部分标签学习问题的鲁棒表示学习方法，通过利用鲁棒对比学习和标签质量改进策略，提高模型性能并抵抗不准确部分标签的影响。",
    "en_tdlr": "This paper presents a robust representation learning approach to address the issue of unreliable partial label learning. By leveraging robust contrastive learning and label quality improvement strategies, it improves model performance and mitigates the impact of inaccurate partial labels."
}