{
    "title": "Data Collaboration Analysis applied to Compound Datasets and the Introduction of Projection data to Non-IID settings. (arXiv:2308.00280v1 [cs.LG])",
    "abstract": "Given the time and expense associated with bringing a drug to market, numerous studies have been conducted to predict the properties of compounds based on their structure using machine learning. Federated learning has been applied to compound datasets to increase their prediction accuracy while safeguarding potentially proprietary information. However, federated learning is encumbered by low accuracy in not identically and independently distributed (non-IID) settings, i.e., data partitioning has a large label bias, and is considered unsuitable for compound datasets, which tend to have large label bias. To address this limitation, we utilized an alternative method of distributed machine learning to chemical compound data from open sources, called data collaboration analysis (DC). We also proposed data collaboration analysis using projection data (DCPd), which is an improved method that utilizes auxiliary PubChem data. This improves the quality of individual user-side data transformation",
    "link": "http://arxiv.org/abs/2308.00280",
    "context": "Title: Data Collaboration Analysis applied to Compound Datasets and the Introduction of Projection data to Non-IID settings. (arXiv:2308.00280v1 [cs.LG])\nAbstract: Given the time and expense associated with bringing a drug to market, numerous studies have been conducted to predict the properties of compounds based on their structure using machine learning. Federated learning has been applied to compound datasets to increase their prediction accuracy while safeguarding potentially proprietary information. However, federated learning is encumbered by low accuracy in not identically and independently distributed (non-IID) settings, i.e., data partitioning has a large label bias, and is considered unsuitable for compound datasets, which tend to have large label bias. To address this limitation, we utilized an alternative method of distributed machine learning to chemical compound data from open sources, called data collaboration analysis (DC). We also proposed data collaboration analysis using projection data (DCPd), which is an improved method that utilizes auxiliary PubChem data. This improves the quality of individual user-side data transformation",
    "path": "papers/23/08/2308.00280.json",
    "total_tokens": 880,
    "translated_title": "数据协作分析在化合物数据集上的应用以及引入投影数据到非独立同分布的环境中",
    "translated_abstract": "鉴于把一种药物推向市场所需要的时间和费用，已经进行了许多研究，利用机器学习根据其结构预测化合物的性质。联邦学习已经应用于化合物数据集中，以提高其预测准确性，同时保护可能的专有信息。然而，在非独立同分布（non-IID）的情况下，联邦学习的准确性较低，即数据分区具有很大的标签偏差，并被认为不适用于化合物数据集，这往往具有较大的标签偏差。为解决这个限制，我们利用了一种分布式机器学习的替代方法，对来自开放源的化合物数据进行了数据协作分析（DC）。我们还提出了使用投影数据的数据协作分析方法（DCPd），该方法利用了辅助的PubChem数据。这提高了个体用户侧数据转换的质量。",
    "tldr": "该论文介绍了应用于化合物数据集的数据协作分析，以及引入投影数据到非独立同分布环境中。这种方法通过数据合作和使用辅助数据的方式提高了预测准确性。",
    "en_tdlr": "This paper presents the use of data collaboration analysis on compound datasets and the introduction of projection data to non-IID settings. The method improves prediction accuracy by utilizing data collaboration and auxiliary data."
}