{
    "title": "Machine learning in parameter estimation of nonlinear systems. (arXiv:2308.12393v1 [cs.LG])",
    "abstract": "Accurately estimating parameters in complex nonlinear systems is crucial across scientific and engineering fields. We present a novel approach for parameter estimation using a neural network with the Huber loss function. This method taps into deep learning's abilities to uncover parameters governing intricate behaviors in nonlinear equations. We validate our approach using synthetic data and predefined functions that model system dynamics. By training the neural network with noisy time series data, it fine-tunes the Huber loss function to converge to accurate parameters. We apply our method to damped oscillators, Van der Pol oscillators, Lotka-Volterra systems, and Lorenz systems under multiplicative noise. The trained neural network accurately estimates parameters, evident from closely matching latent dynamics. Comparing true and estimated trajectories visually reinforces our method's precision and robustness. Our study underscores the Huber loss-guided neural network as a versatile t",
    "link": "http://arxiv.org/abs/2308.12393",
    "context": "Title: Machine learning in parameter estimation of nonlinear systems. (arXiv:2308.12393v1 [cs.LG])\nAbstract: Accurately estimating parameters in complex nonlinear systems is crucial across scientific and engineering fields. We present a novel approach for parameter estimation using a neural network with the Huber loss function. This method taps into deep learning's abilities to uncover parameters governing intricate behaviors in nonlinear equations. We validate our approach using synthetic data and predefined functions that model system dynamics. By training the neural network with noisy time series data, it fine-tunes the Huber loss function to converge to accurate parameters. We apply our method to damped oscillators, Van der Pol oscillators, Lotka-Volterra systems, and Lorenz systems under multiplicative noise. The trained neural network accurately estimates parameters, evident from closely matching latent dynamics. Comparing true and estimated trajectories visually reinforces our method's precision and robustness. Our study underscores the Huber loss-guided neural network as a versatile t",
    "path": "papers/23/08/2308.12393.json",
    "total_tokens": 863,
    "translated_title": "机器学习在非线性系统参数估计中的应用",
    "translated_abstract": "在科学和工程领域中，准确估计复杂非线性系统的参数至关重要。我们提出了一种使用具有Huber损失函数的神经网络进行参数估计的新方法。该方法利用深度学习的能力来揭示非线性方程中的复杂行为的参数。我们使用合成数据和预定义的模型系统动力学函数来验证我们的方法。通过使用带有噪声时间序列数据训练神经网络，它可以对参数进行精确调整，使其收敛到准确值。我们将我们的方法应用于阻尼振荡子、Van der Pol振荡子、Lotka-Volterra系统和Lorenz系统在乘法噪声下的情况。训练后的神经网络从与潜在动态密切匹配的结果中准确估计参数。通过对比真实轨迹和估计轨迹的可视化，进一步证明了我们的方法的精确性和鲁棒性。我们的研究强调了以Huber损失为指导的神经网络作为一种多功能的方法。",
    "tldr": "该论文提出了一种使用神经网络和Huber损失函数进行非线性系统参数估计的新方法，并通过验证实验展示了其精确性和鲁棒性。",
    "en_tdlr": "This paper presents a novel approach for parameter estimation in nonlinear systems using a neural network with the Huber loss function, and demonstrates its accuracy and robustness through validation experiments."
}