{
    "title": "Characteristics of networks generated by kernel growing neural gas. (arXiv:2308.08163v1 [cs.LG])",
    "abstract": "This research aims to develop kernel GNG, a kernelized version of the growing neural gas (GNG) algorithm, and to investigate the features of the networks generated by the kernel GNG. The GNG is an unsupervised artificial neural network that can transform a dataset into an undirected graph, thereby extracting the features of the dataset as a graph. The GNG is widely used in vector quantization, clustering, and 3D graphics. Kernel methods are often used to map a dataset to feature space, with support vector machines being the most prominent application. This paper introduces the kernel GNG approach and explores the characteristics of the networks generated by kernel GNG. Five kernels, including Gaussian, Laplacian, Cauchy, inverse multiquadric, and log kernels, are used in this study.",
    "link": "http://arxiv.org/abs/2308.08163",
    "context": "Title: Characteristics of networks generated by kernel growing neural gas. (arXiv:2308.08163v1 [cs.LG])\nAbstract: This research aims to develop kernel GNG, a kernelized version of the growing neural gas (GNG) algorithm, and to investigate the features of the networks generated by the kernel GNG. The GNG is an unsupervised artificial neural network that can transform a dataset into an undirected graph, thereby extracting the features of the dataset as a graph. The GNG is widely used in vector quantization, clustering, and 3D graphics. Kernel methods are often used to map a dataset to feature space, with support vector machines being the most prominent application. This paper introduces the kernel GNG approach and explores the characteristics of the networks generated by kernel GNG. Five kernels, including Gaussian, Laplacian, Cauchy, inverse multiquadric, and log kernels, are used in this study.",
    "path": "papers/23/08/2308.08163.json",
    "total_tokens": 844,
    "translated_title": "由核生长神经气体生成的网络的特性",
    "translated_abstract": "本研究旨在开发核化的生长神经气体（GNG）算法的核GNG，并研究由核GNG生成的网络的特征。GNG是一种无监督的人工神经网络，可以将数据集转化为无向图，从而提取数据集的特征作为图形。GNG被广泛应用于向量量化、聚类和三维图形中。核方法常用于将数据集映射到特征空间，其中支持向量机是最重要的应用之一。本文介绍了核GNG方法，并探索了由核GNG生成的网络的特性。本研究中使用了五种核函数，包括高斯核、拉普拉斯核、柯西核、反多项式核和对数核。",
    "tldr": "本研究开发了核化的生长神经气体算法，并研究了由此算法生成的网络的特性。研究发现，核生长神经气体算法可以将数据集转化为无向图，并提取数据集的特征作为图形。五种核函数被用于此研究。",
    "en_tdlr": "This research develops a kernelized version of the growing neural gas (GNG) algorithm and investigates the characteristics of the networks generated by it. The kernel GNG algorithm transforms a dataset into an undirected graph, extracting its features. Five different kernel functions, including Gaussian, Laplacian, Cauchy, inverse multiquadric, and log kernels, are utilized in this study."
}