{
    "title": "Supply chain emission estimation using large language models. (arXiv:2308.01741v1 [cs.CL])",
    "abstract": "Large enterprises face a crucial imperative to achieve the Sustainable Development Goals (SDGs), especially goal 13, which focuses on combating climate change and its impacts. To mitigate the effects of climate change, reducing enterprise Scope 3 (supply chain emissions) is vital, as it accounts for more than 90\\% of total emission inventories. However, tracking Scope 3 emissions proves challenging, as data must be collected from thousands of upstream and downstream suppliers.To address the above mentioned challenges, we propose a first-of-a-kind framework that uses domain-adapted NLP foundation models to estimate Scope 3 emissions, by utilizing financial transactions as a proxy for purchased goods and services. We compared the performance of the proposed framework with the state-of-art text classification models such as TF-IDF, word2Vec, and Zero shot learning. Our results show that the domain-adapted foundation model outperforms state-of-the-art text mining techniques and performs as",
    "link": "http://arxiv.org/abs/2308.01741",
    "context": "Title: Supply chain emission estimation using large language models. (arXiv:2308.01741v1 [cs.CL])\nAbstract: Large enterprises face a crucial imperative to achieve the Sustainable Development Goals (SDGs), especially goal 13, which focuses on combating climate change and its impacts. To mitigate the effects of climate change, reducing enterprise Scope 3 (supply chain emissions) is vital, as it accounts for more than 90\\% of total emission inventories. However, tracking Scope 3 emissions proves challenging, as data must be collected from thousands of upstream and downstream suppliers.To address the above mentioned challenges, we propose a first-of-a-kind framework that uses domain-adapted NLP foundation models to estimate Scope 3 emissions, by utilizing financial transactions as a proxy for purchased goods and services. We compared the performance of the proposed framework with the state-of-art text classification models such as TF-IDF, word2Vec, and Zero shot learning. Our results show that the domain-adapted foundation model outperforms state-of-the-art text mining techniques and performs as",
    "path": "papers/23/08/2308.01741.json",
    "total_tokens": 956,
    "translated_title": "使用大型语言模型估计供应链排放量",
    "translated_abstract": "大型企业面临着实现可持续发展目标（SDGs）的关键任务，尤其是目标13，专注于应对气候变化及其影响。为了减轻气候变化的影响，减少企业的范围3（供应链排放）至关重要，因为它占总排放清单的90％以上。然而，跟踪范围3排放面临挑战，因为必须从数千个上游和下游供应商中收集数据。为了解决上述挑战，我们提出了一个首创框架，该框架利用领域适应的自然语言处理基础模型，通过使用金融交易作为购买的商品和服务的代理来估计范围3排放。我们将所提出的框架的性能与TF-IDF、word2Vec和零样本学习等最新文本分类模型进行了比较。结果显示，领域适应的基础模型优于最新的文本挖掘技术，并有着相似的性能。",
    "tldr": "本论文提出了一个使用领域适应的自然语言处理基础模型估计供应链范围3排放量的框架，通过利用金融交易代理购买的商品和服务，可以准确跟踪范围3排放。实验证明该框架优于最新的文本挖掘技术，并具有相似的性能。"
}