{
    "title": "Threshold Regression in Heterogeneous Panel Data with Interactive Fixed Effects. (arXiv:2308.04057v1 [econ.EM])",
    "abstract": "This paper introduces unit-specific heterogeneity in panel data threshold regression. Both slope coefficients and threshold parameters are allowed to vary by unit. The heterogeneous threshold parameters manifest via a unit-specific empirical quantile transformation of a common underlying threshold parameter which is estimated efficiently from the whole panel. In the errors, the unobserved heterogeneity of the panel takes the general form of interactive fixed effects. The newly introduced parameter heterogeneity has implications for model identification, estimation, interpretation, and asymptotic inference. The assumption of a shrinking threshold magnitude now implies shrinking heterogeneity and leads to faster estimator rates of convergence than previously encountered. The asymptotic theory for the proposed estimators is derived and Monte Carlo simulations demonstrate its usefulness in small samples. The new model is employed to examine the Feldstein-Horioka puzzle and it is found that",
    "link": "http://arxiv.org/abs/2308.04057",
    "context": "Title: Threshold Regression in Heterogeneous Panel Data with Interactive Fixed Effects. (arXiv:2308.04057v1 [econ.EM])\nAbstract: This paper introduces unit-specific heterogeneity in panel data threshold regression. Both slope coefficients and threshold parameters are allowed to vary by unit. The heterogeneous threshold parameters manifest via a unit-specific empirical quantile transformation of a common underlying threshold parameter which is estimated efficiently from the whole panel. In the errors, the unobserved heterogeneity of the panel takes the general form of interactive fixed effects. The newly introduced parameter heterogeneity has implications for model identification, estimation, interpretation, and asymptotic inference. The assumption of a shrinking threshold magnitude now implies shrinking heterogeneity and leads to faster estimator rates of convergence than previously encountered. The asymptotic theory for the proposed estimators is derived and Monte Carlo simulations demonstrate its usefulness in small samples. The new model is employed to examine the Feldstein-Horioka puzzle and it is found that",
    "path": "papers/23/08/2308.04057.json",
    "total_tokens": 863,
    "translated_title": "异质面板数据中的阈值回归与交互固定效应",
    "translated_abstract": "本文介绍了在面板数据阈值回归中引入了单位特定的异质性。斜率系数和阈值参数都允许因单位而异。异质阈值参数通过单位专有的经验分位数转换来表示，该转换由整个面板数据高效估计得出。在误差项中，面板数据的未观测异质性采用了交互固定效应的一般形式。这种新引入的参数异质性对模型的识别、估计、解释和渐近推断都有重要影响。假设阈值幅度收缩，现在意味着异质性的收缩，使得估计器的收敛速度比以前更快。我们推导了所提出估计器的渐近理论，蒙特卡洛模拟结果表明其在小样本中的有效性。我们应用新模型对费尔斯坦-宝里奥卡之谜进行了研究，发现……",
    "tldr": "本文介绍了在面板数据阈值回归中引入了单位特定的异质性，并提出了一种新的参数估计方法，该方法可以更快地收敛。对费尔斯坦-宝里奥卡之谜的研究结果表明……"
}