{
    "title": "Out of the Box Thinking: Improving Customer Lifetime Value Modelling via Expert Routing and Game Whale Detection. (arXiv:2308.12729v1 [cs.IR])",
    "abstract": "Customer lifetime value (LTV) prediction is essential for mobile game publishers trying to optimize the advertising investment for each user acquisition based on the estimated worth. In mobile games, deploying microtransactions is a simple yet effective monetization strategy, which attracts a tiny group of game whales who splurge on in-game purchases. The presence of such game whales may impede the practicality of existing LTV prediction models, since game whales' purchase behaviours always exhibit varied distribution from general users. Consequently, identifying game whales can open up new opportunities to improve the accuracy of LTV prediction models. However, little attention has been paid to applying game whale detection in LTV prediction, and existing works are mainly specialized for the long-term LTV prediction with the assumption that the high-quality user features are available, which is not applicable in the UA stage. In this paper, we propose ExpLTV, a novel multi-task framew",
    "link": "http://arxiv.org/abs/2308.12729",
    "context": "Title: Out of the Box Thinking: Improving Customer Lifetime Value Modelling via Expert Routing and Game Whale Detection. (arXiv:2308.12729v1 [cs.IR])\nAbstract: Customer lifetime value (LTV) prediction is essential for mobile game publishers trying to optimize the advertising investment for each user acquisition based on the estimated worth. In mobile games, deploying microtransactions is a simple yet effective monetization strategy, which attracts a tiny group of game whales who splurge on in-game purchases. The presence of such game whales may impede the practicality of existing LTV prediction models, since game whales' purchase behaviours always exhibit varied distribution from general users. Consequently, identifying game whales can open up new opportunities to improve the accuracy of LTV prediction models. However, little attention has been paid to applying game whale detection in LTV prediction, and existing works are mainly specialized for the long-term LTV prediction with the assumption that the high-quality user features are available, which is not applicable in the UA stage. In this paper, we propose ExpLTV, a novel multi-task framew",
    "path": "papers/23/08/2308.12729.json",
    "total_tokens": 894,
    "translated_title": "独特思维：通过专家路径选择和游戏鲸鱼检测改进客户终身价值建模",
    "translated_abstract": "客户终身价值（LTV）预测对于试图根据估计价值优化广告投资的移动游戏发行商至关重要。在移动游戏中，部署微交易是一种简单而有效的货币化策略，吸引了一小群在游戏内购买上大量消费的游戏鲸鱼。这种游戏鲸鱼的存在可能阻碍现有LTV预测模型的实用性，因为游戏鲸鱼的购买行为总是表现出与普通用户不同的分布。因此，识别游戏鲸鱼可以为改进LTV预测模型的准确性打开新机会。然而，目前在LTV预测中应用游戏鲸鱼检测的研究很少，现有工作主要针对假设可获得高质量用户特征的长期LTV预测，这在用户获取阶段不适用。在本文中，我们提出了一种新颖的多任务框架ExpLTV。",
    "tldr": "本文提出了一种新颖的多任务框架ExpLTV，利用游戏鲸鱼的检测来改进客户终身价值预测模型的准确性。",
    "en_tdlr": "This paper proposes a novel multi-task framework, ExpLTV, which improves the accuracy of customer lifetime value prediction models by utilizing game whale detection."
}