{
    "title": "Ontologies in Digital Twins: A Systematic Literature Review. (arXiv:2308.15168v1 [cs.AI])",
    "abstract": "Digital Twins (DT) facilitate monitoring and reasoning processes in cyber-physical systems. They have progressively gained popularity over the past years because of intense research activity and industrial advancements. Cognitive Twins is a novel concept, recently coined to refer to the involvement of Semantic Web technology in DTs. Recent studies address the relevance of ontologies and knowledge graphs in the context of DTs, in terms of knowledge representation, interoperability and automatic reasoning. However, there is no comprehensive analysis of how semantic technologies, and specifically ontologies, are utilized within DTs. This Systematic Literature Review (SLR) is based on the analysis of 82 research articles, that either propose or benefit from ontologies with respect to DT. The paper uses different analysis perspectives, including a structural analysis based on a reference DT architecture, and an application-specific analysis to specifically address the different domains, suc",
    "link": "http://arxiv.org/abs/2308.15168",
    "context": "Title: Ontologies in Digital Twins: A Systematic Literature Review. (arXiv:2308.15168v1 [cs.AI])\nAbstract: Digital Twins (DT) facilitate monitoring and reasoning processes in cyber-physical systems. They have progressively gained popularity over the past years because of intense research activity and industrial advancements. Cognitive Twins is a novel concept, recently coined to refer to the involvement of Semantic Web technology in DTs. Recent studies address the relevance of ontologies and knowledge graphs in the context of DTs, in terms of knowledge representation, interoperability and automatic reasoning. However, there is no comprehensive analysis of how semantic technologies, and specifically ontologies, are utilized within DTs. This Systematic Literature Review (SLR) is based on the analysis of 82 research articles, that either propose or benefit from ontologies with respect to DT. The paper uses different analysis perspectives, including a structural analysis based on a reference DT architecture, and an application-specific analysis to specifically address the different domains, suc",
    "path": "papers/23/08/2308.15168.json",
    "total_tokens": 826,
    "translated_title": "数字孪生中的本体论: 一项系统性文献综述",
    "translated_abstract": "数字孪生(DT)在网络物理系统中促进监控和推理过程。由于密集的研究活动和工业进展，它们在近年来逐渐受到关注。在DT中，本体和知识图在知识表示、互操作性和自动推理方面的重要性受到了研究。然而，目前还没有对语义技术，特别是本体论，在DT中的具体应用进行全面的分析。本文基于对82篇与DT相关的研究文章的分析，提出了一项系统性文献综述。论文采用不同的分析角度，包括基于参考DT架构的结构分析和基于应用领域的特定分析，以具体的方式处理不同领域的问题。",
    "tldr": "本文是一项对数字孪生中本体论的系统性文献综述，通过分析82篇研究论文的途径，探讨了本体论在数字孪生中的应用和贡献，包括知识表示、互操作性和自动推理方面。",
    "en_tdlr": "This paper is a systematic literature review on the role of ontologies in digital twins. Through analyzing 82 research articles, it explores the application and contributions of ontologies in digital twins, including knowledge representation, interoperability, and automatic reasoning."
}