{
    "title": "Deep Learning for Structure-Preserving Universal Stable Koopman-Inspired Embeddings for Nonlinear Canonical Hamiltonian Dynamics. (arXiv:2308.13835v1 [cs.LG])",
    "abstract": "Discovering a suitable coordinate transformation for nonlinear systems enables the construction of simpler models, facilitating prediction, control, and optimization for complex nonlinear systems. To that end, Koopman operator theory offers a framework for global linearization for nonlinear systems, thereby allowing the usage of linear tools for design studies. In this work, we focus on the identification of global linearized embeddings for canonical nonlinear Hamiltonian systems through a symplectic transformation. While this task is often challenging, we leverage the power of deep learning to discover the desired embeddings. Furthermore, to overcome the shortcomings of Koopman operators for systems with continuous spectra, we apply the lifting principle and learn global cubicized embeddings. Additionally, a key emphasis is paid to enforce the bounded stability for the dynamics of the discovered embeddings. We demonstrate the capabilities of deep learning in acquiring compact symplect",
    "link": "http://arxiv.org/abs/2308.13835",
    "context": "Title: Deep Learning for Structure-Preserving Universal Stable Koopman-Inspired Embeddings for Nonlinear Canonical Hamiltonian Dynamics. (arXiv:2308.13835v1 [cs.LG])\nAbstract: Discovering a suitable coordinate transformation for nonlinear systems enables the construction of simpler models, facilitating prediction, control, and optimization for complex nonlinear systems. To that end, Koopman operator theory offers a framework for global linearization for nonlinear systems, thereby allowing the usage of linear tools for design studies. In this work, we focus on the identification of global linearized embeddings for canonical nonlinear Hamiltonian systems through a symplectic transformation. While this task is often challenging, we leverage the power of deep learning to discover the desired embeddings. Furthermore, to overcome the shortcomings of Koopman operators for systems with continuous spectra, we apply the lifting principle and learn global cubicized embeddings. Additionally, a key emphasis is paid to enforce the bounded stability for the dynamics of the discovered embeddings. We demonstrate the capabilities of deep learning in acquiring compact symplect",
    "path": "papers/23/08/2308.13835.json",
    "total_tokens": 895,
    "translated_title": "深度学习用于保持结构的非线性标准哈密顿动力学的通用稳定库普曼嵌入",
    "translated_abstract": "发现非线性系统的适当坐标变换可以构建更简单的模型，从而便于复杂非线性系统的预测、控制和优化。为此，库普曼算子理论提供了一种用于非线性系统的全局线性化的框架，从而允许使用线性工具进行设计研究。在这项工作中，我们关注通过辛变换识别标准非线性哈密顿系统的全局线性化嵌入。尽管这个任务通常很具挑战性，我们利用深度学习的能力来发现所需的嵌入。此外，为了克服库普曼算子在具有连续频谱的系统中的缺点，我们应用了抬升原理并学习全局的立方嵌入。此外，我们着重强调了所发现嵌入的动力学的有界稳定性的强制性要求。我们展示了深度学习在获取紧凑辛嵌入中的能力。",
    "tldr": "该论文利用深度学习为非线性哈密顿系统发现了保持结构的全局线性化嵌入，通过辛变换获得紧凑辛嵌入，并重点关注其动力学的有界稳定性。"
}