{
    "title": "Athena 2.0: Discourse and User Modeling in Open Domain Dialogue. (arXiv:2308.01887v1 [cs.CL])",
    "abstract": "Conversational agents are consistently growing in popularity and many people interact with them every day. While many conversational agents act as personal assistants, they can have many different goals. Some are task-oriented, such as providing customer support for a bank or making a reservation. Others are designed to be empathetic and to form emotional connections with the user. The Alexa Prize Challenge aims to create a socialbot, which allows the user to engage in coherent conversations, on a range of popular topics that will interest the user. Here we describe Athena 2.0, UCSC's conversational agent for Amazon's Socialbot Grand Challenge 4. Athena 2.0 utilizes a novel knowledge-grounded discourse model that tracks the entity links that Athena introduces into the dialogue, and uses them to constrain named-entity recognition and linking, and coreference resolution. Athena 2.0 also relies on a user model to personalize topic selection and other aspects of the conversation to individ",
    "link": "http://arxiv.org/abs/2308.01887",
    "context": "Title: Athena 2.0: Discourse and User Modeling in Open Domain Dialogue. (arXiv:2308.01887v1 [cs.CL])\nAbstract: Conversational agents are consistently growing in popularity and many people interact with them every day. While many conversational agents act as personal assistants, they can have many different goals. Some are task-oriented, such as providing customer support for a bank or making a reservation. Others are designed to be empathetic and to form emotional connections with the user. The Alexa Prize Challenge aims to create a socialbot, which allows the user to engage in coherent conversations, on a range of popular topics that will interest the user. Here we describe Athena 2.0, UCSC's conversational agent for Amazon's Socialbot Grand Challenge 4. Athena 2.0 utilizes a novel knowledge-grounded discourse model that tracks the entity links that Athena introduces into the dialogue, and uses them to constrain named-entity recognition and linking, and coreference resolution. Athena 2.0 also relies on a user model to personalize topic selection and other aspects of the conversation to individ",
    "path": "papers/23/08/2308.01887.json",
    "total_tokens": 907,
    "translated_title": "Athena 2.0: 开放领域对话中的语篇和用户建模。",
    "translated_abstract": "会话代理的受欢迎程度不断增长，许多人每天都与它们进行交互。虽然许多会话代理充当个人助手，但它们可以有许多不同的目标。一些是面向任务的，例如提供银行客户支持或进行预订。其他人则旨在表达同情，并与用户建立情感联系。Alexa Prize Challenge旨在创建一个社交机器人，使用户能够进行连贯的对话，涉及用户感兴趣的各种热门话题。在这里，我们介绍了阿蒂娜2.0，UCSC的亚马逊社交机器人大挑战4中的会话代理。阿蒂娜2.0使用新颖的知识导向的语篇模型，跟踪阿蒂娜引入对话中的实体链接，并利用它们来限制命名实体识别和链接，以及共指消解。阿蒂娜2.0还依赖于用户模型，以个性化主题选择和对话的其他方面。",
    "tldr": "Athena 2.0 是 UCSC的会话代理，使用了知识导向的语篇模型和用户模型来实现个性化对话，并在Amazon的社交机器人大挑战中取得了创新广泛关注。"
}