{
    "title": "Fully Embedded Time-Series Generative Adversarial Networks. (arXiv:2308.15730v1 [cs.LG])",
    "abstract": "Generative Adversarial Networks (GANs) should produce synthetic data that fits the underlying distribution of the data being modeled. For real valued time-series data, this implies the need to simultaneously capture the static distribution of the data, but also the full temporal distribution of the data for any potential time horizon. This temporal element produces a more complex problem that can potentially leave current solutions under-constrained, unstable during training, or prone to varying degrees of mode collapse. In FETSGAN, entire sequences are translated directly to the generator's sampling space using a seq2seq style adversarial auto encoder (AAE), where adversarial training is used to match the training distribution in both the feature space and the lower dimensional sampling space. This additional constraint provides a loose assurance that the temporal distribution of the synthetic samples will not collapse. In addition, the First Above Threshold (FAT) operator is introduc",
    "link": "http://arxiv.org/abs/2308.15730",
    "context": "Title: Fully Embedded Time-Series Generative Adversarial Networks. (arXiv:2308.15730v1 [cs.LG])\nAbstract: Generative Adversarial Networks (GANs) should produce synthetic data that fits the underlying distribution of the data being modeled. For real valued time-series data, this implies the need to simultaneously capture the static distribution of the data, but also the full temporal distribution of the data for any potential time horizon. This temporal element produces a more complex problem that can potentially leave current solutions under-constrained, unstable during training, or prone to varying degrees of mode collapse. In FETSGAN, entire sequences are translated directly to the generator's sampling space using a seq2seq style adversarial auto encoder (AAE), where adversarial training is used to match the training distribution in both the feature space and the lower dimensional sampling space. This additional constraint provides a loose assurance that the temporal distribution of the synthetic samples will not collapse. In addition, the First Above Threshold (FAT) operator is introduc",
    "path": "papers/23/08/2308.15730.json",
    "total_tokens": 887,
    "translated_title": "完全嵌入的时间序列生成对抗网络",
    "translated_abstract": "生成对抗网络（GANs）应产生与所建模数据的潜在分布相符的合成数据。针对实值时间序列数据，这意味着需要同时捕获数据的静态分布以及任何潜在时间范围的完整时间分布。这个时间要素产生了一个更复杂的问题，可能导致当前的解决方案受限、训练不稳定或易于发生模式崩溃。在完全嵌入的时间序列生成对抗网络（FETSGAN）中，整个序列通过一个seq2seq风格的对抗性自编码器（AAE）直接转换为生成器的采样空间，其中对抗性训练用于在特征空间和较低维度的采样空间匹配训练分布。这个额外的约束条件提供了对合成样本的时间分布不会崩溃的松散保证。此外，引入了第一个超过阈值（FAT）操作符。",
    "tldr": "这篇论文提出了一种完全嵌入的时间序列生成对抗网络（FETSGAN），通过对抗性训练匹配特征空间和低维度采样空间的训练分布，确保合成样本的时间分布不会崩溃。"
}