{
    "title": "A discretization scheme for path-dependent FBSDEs. (arXiv:2308.07029v1 [math.PR])",
    "abstract": "This paper studies a discretization scheme for solutions to forward-backward stochastic differential equations (FBSDEs) with path-dependent coefficients. We show the convergence of the Picard-type iteration to the FBDSE solution and provide its convergence rate. To the best of our knowledge, this is the first result of discretization scheme for path-dependent FBSDEs. Using this result, we establish a numerical method for solutions to second-order parabolic path-dependent partial differential equations. To achieve this, weak approximation of martingale representation theorem (Cont, Rama, and Yi Lu. ``Weak approximation of martingale representations.\" Stochastic Processes and their Applications 2016) is employed. Our results generalize the scheme for Markovian cases in (Bender, Christian, and Robert Denk. ``A forward scheme for backward SDEs.\" Stochastic processes and their applications, 2007)",
    "link": "http://arxiv.org/abs/2308.07029",
    "context": "Title: A discretization scheme for path-dependent FBSDEs. (arXiv:2308.07029v1 [math.PR])\nAbstract: This paper studies a discretization scheme for solutions to forward-backward stochastic differential equations (FBSDEs) with path-dependent coefficients. We show the convergence of the Picard-type iteration to the FBDSE solution and provide its convergence rate. To the best of our knowledge, this is the first result of discretization scheme for path-dependent FBSDEs. Using this result, we establish a numerical method for solutions to second-order parabolic path-dependent partial differential equations. To achieve this, weak approximation of martingale representation theorem (Cont, Rama, and Yi Lu. ``Weak approximation of martingale representations.\" Stochastic Processes and their Applications 2016) is employed. Our results generalize the scheme for Markovian cases in (Bender, Christian, and Robert Denk. ``A forward scheme for backward SDEs.\" Stochastic processes and their applications, 2007)",
    "path": "papers/23/08/2308.07029.json",
    "total_tokens": 771,
    "translated_title": "一种路径相关的FBSDE的离散化方案",
    "translated_abstract": "本文研究了一种用于具有路径相关系数的前向-后向随机微分方程（FBSDE）解的离散化方案。我们证明了Picard型迭代对FBDSE解的收敛性，并给出了其收敛速度。据我们所知，这是关于路径相关的FBSDE离散化方案的首个结果。利用这个结果，我们建立了一个用于二阶抛物型路径相关偏微分方程解的数值方法。为了实现这一点，我们采用了鞅表示定理的弱逼近（Cont, Rama, and Yi Lu. ``Weak approximation of martingale representations.\" Stochastic Processes and their Applications 2016）。我们的结果推广了(Bender, Christian, and Robert Denk. ``A forward scheme for backward SDEs.\" Stochastic processes and their applications, 2007)中马尔可夫情况的方案。",
    "tldr": "本文研究了一种用于路径相关的FBSDE解的离散化方案，并证明了其收敛性和收敛速度。",
    "en_tdlr": "This paper proposes a discretization scheme for solutions to path-dependent FBSDEs and proves its convergence and convergence rate."
}