{
    "title": "Exploiting Time-Frequency Conformers for Music Audio Enhancement. (arXiv:2308.12599v1 [cs.SD])",
    "abstract": "With the proliferation of video platforms on the internet, recording musical performances by mobile devices has become commonplace. However, these recordings often suffer from degradation such as noise and reverberation, which negatively impact the listening experience. Consequently, the necessity for music audio enhancement (referred to as music enhancement from this point onward), involving the transformation of degraded audio recordings into pristine high-quality music, has surged to augment the auditory experience. To address this issue, we propose a music enhancement system based on the Conformer architecture that has demonstrated outstanding performance in speech enhancement tasks. Our approach explores the attention mechanisms of the Conformer and examines their performance to discover the best approach for the music enhancement task. Our experimental results show that our proposed model achieves state-of-the-art performance on single-stem music enhancement. Furthermore, our sys",
    "link": "http://arxiv.org/abs/2308.12599",
    "context": "Title: Exploiting Time-Frequency Conformers for Music Audio Enhancement. (arXiv:2308.12599v1 [cs.SD])\nAbstract: With the proliferation of video platforms on the internet, recording musical performances by mobile devices has become commonplace. However, these recordings often suffer from degradation such as noise and reverberation, which negatively impact the listening experience. Consequently, the necessity for music audio enhancement (referred to as music enhancement from this point onward), involving the transformation of degraded audio recordings into pristine high-quality music, has surged to augment the auditory experience. To address this issue, we propose a music enhancement system based on the Conformer architecture that has demonstrated outstanding performance in speech enhancement tasks. Our approach explores the attention mechanisms of the Conformer and examines their performance to discover the best approach for the music enhancement task. Our experimental results show that our proposed model achieves state-of-the-art performance on single-stem music enhancement. Furthermore, our sys",
    "path": "papers/23/08/2308.12599.json",
    "total_tokens": 807,
    "translated_title": "利用时频适配器进行音乐音频增强",
    "translated_abstract": "随着互联网上视频平台的普及，使用移动设备录制音乐演出已经成为常见现象。然而，这些录音往往受到噪音和混响等问题的影响，对听众的体验产生负面影响。因此，音乐音频增强（以下简称音频增强）的需求不断增长，旨在将受损的音频录音转化为高品质的音乐，以提升听觉体验。为了解决这个问题，我们提出了一种基于Conformer架构的音频增强系统，该架构在语音增强任务中表现出色。我们的方法探索了Conformer的注意机制，并测试其在音频增强任务中的性能，以找到最佳的方法。实验结果表明，我们提出的模型在单音乐音频增强方面达到了最先进的性能。",
    "tldr": "这项研究提出了一种基于Conformer架构的音频增强系统，通过探索其注意机制并测试性能，实现了在单音乐音频增强方面的最先进性能。"
}