{
    "title": "AsyncET: Asynchronous Learning for Knowledge Graph Entity Typing with Auxiliary Relations. (arXiv:2308.16055v1 [cs.CL])",
    "abstract": "Knowledge graph entity typing (KGET) is a task to predict the missing entity types in knowledge graphs (KG). Previously, KG embedding (KGE) methods tried to solve the KGET task by introducing an auxiliary relation, 'hasType', to model the relationship between entities and their types. However, a single auxiliary relation has limited expressiveness for diverse entity-type patterns. We improve the expressiveness of KGE methods by introducing multiple auxiliary relations in this work. Similar entity types are grouped to reduce the number of auxiliary relations and improve their capability to model entity-type patterns with different granularities. With the presence of multiple auxiliary relations, we propose a method adopting an Asynchronous learning scheme for Entity Typing, named AsyncET, which updates the entity and type embeddings alternatively to keep the learned entity embedding up-to-date and informative for entity type prediction. Experiments are conducted on two commonly used KGE",
    "link": "http://arxiv.org/abs/2308.16055",
    "context": "Title: AsyncET: Asynchronous Learning for Knowledge Graph Entity Typing with Auxiliary Relations. (arXiv:2308.16055v1 [cs.CL])\nAbstract: Knowledge graph entity typing (KGET) is a task to predict the missing entity types in knowledge graphs (KG). Previously, KG embedding (KGE) methods tried to solve the KGET task by introducing an auxiliary relation, 'hasType', to model the relationship between entities and their types. However, a single auxiliary relation has limited expressiveness for diverse entity-type patterns. We improve the expressiveness of KGE methods by introducing multiple auxiliary relations in this work. Similar entity types are grouped to reduce the number of auxiliary relations and improve their capability to model entity-type patterns with different granularities. With the presence of multiple auxiliary relations, we propose a method adopting an Asynchronous learning scheme for Entity Typing, named AsyncET, which updates the entity and type embeddings alternatively to keep the learned entity embedding up-to-date and informative for entity type prediction. Experiments are conducted on two commonly used KGE",
    "path": "papers/23/08/2308.16055.json",
    "total_tokens": 881,
    "translated_title": "异步学习的知识图谱实体类型推断方法与辅助关系的应用",
    "translated_abstract": "知识图谱实体类型推断（KGET）是预测知识图谱中缺失实体类型的任务。以前，知识图谱嵌入（KGE）方法通过引入辅助关系“hasType”来建模实体与其类型之间的关系，尝试解决KGET任务。然而，单个辅助关系在表达多样的实体类型模式方面具有限制性。我们通过引入多个辅助关系来提高KGE方法的表达能力。类似的实体类型被分组，以减少辅助关系的数量，并提高它们对不同粒度的实体类型模式建模的能力。在多个辅助关系存在的情况下，我们提出了一种名为AsyncET的实体类型异步学习方法，该方法通过交替更新实体和类型嵌入来保持学到的实体嵌入对于实体类型推断的最新和信息丰富。在两个常用的KGE数据集上进行了实验。",
    "tldr": "本文介绍了一种采用异步学习方法并引入多个辅助关系的知识图谱实体类型推断方法。实验结果表明，该方法在不同粒度的实体类型模式建模方面具有更强的表达能力。",
    "en_tdlr": "This paper presents an asynchronous learning approach and introduces multiple auxiliary relations for knowledge graph entity typing. Experimental results show that this method has stronger expressive power in modeling entity-type patterns at different granularities."
}