{
    "title": "CLAMS: A Cluster Ambiguity Measure for Estimating Perceptual Variability in Visual Clustering. (arXiv:2308.00284v1 [cs.HC])",
    "abstract": "Visual clustering is a common perceptual task in scatterplots that supports diverse analytics tasks (e.g., cluster identification). However, even with the same scatterplot, the ways of perceiving clusters (i.e., conducting visual clustering) can differ due to the differences among individuals and ambiguous cluster boundaries. Although such perceptual variability casts doubt on the reliability of data analysis based on visual clustering, we lack a systematic way to efficiently assess this variability. In this research, we study perceptual variability in conducting visual clustering, which we call Cluster Ambiguity. To this end, we introduce CLAMS, a data-driven visual quality measure for automatically predicting cluster ambiguity in monochrome scatterplots. We first conduct a qualitative study to identify key factors that affect the visual separation of clusters (e.g., proximity or size difference between clusters). Based on study findings, we deploy a regression module that estimates t",
    "link": "http://arxiv.org/abs/2308.00284",
    "context": "Title: CLAMS: A Cluster Ambiguity Measure for Estimating Perceptual Variability in Visual Clustering. (arXiv:2308.00284v1 [cs.HC])\nAbstract: Visual clustering is a common perceptual task in scatterplots that supports diverse analytics tasks (e.g., cluster identification). However, even with the same scatterplot, the ways of perceiving clusters (i.e., conducting visual clustering) can differ due to the differences among individuals and ambiguous cluster boundaries. Although such perceptual variability casts doubt on the reliability of data analysis based on visual clustering, we lack a systematic way to efficiently assess this variability. In this research, we study perceptual variability in conducting visual clustering, which we call Cluster Ambiguity. To this end, we introduce CLAMS, a data-driven visual quality measure for automatically predicting cluster ambiguity in monochrome scatterplots. We first conduct a qualitative study to identify key factors that affect the visual separation of clusters (e.g., proximity or size difference between clusters). Based on study findings, we deploy a regression module that estimates t",
    "path": "papers/23/08/2308.00284.json",
    "total_tokens": 962,
    "translated_title": "CLAMS:一种用于估计视觉聚类中感知变异性的聚类模糊度测量方法",
    "translated_abstract": "视觉聚类是散点图中常见的感知任务，支持各种分析任务（例如聚类识别）。然而，即使使用相同的散点图，由于个体间的差异和模糊的聚类边界，感知聚类的方式（即进行视觉聚类）可能会有所不同。尽管这种感知变异性对于基于视觉聚类的数据分析的可靠性提出了疑问，但我们缺乏一种系统评估这种变异性的有效方法。在这项研究中，我们研究了进行视觉聚类中的感知变异性，我们称之为聚类模糊度。为此，我们引入CLAMS，一种用于自动预测单色散点图中聚类模糊度的数据驱动的视觉质量测量方法。我们首先进行了定性研究，以确定影响聚类的视觉分离的关键因素（例如聚类间的接近度或大小差异）。基于研究结果，我们部署了一个回归模块来估计聚类的模糊度。",
    "tldr": "本研究提出一种名为CLAMS的聚类模糊度测量方法，用于估计视觉聚类中的感知变异性。通过定性研究，我们确定了影响聚类的关键因素，并通过回归模块对聚类的模糊度进行估计。",
    "en_tdlr": "This research introduces CLAMS, a cluster ambiguity measure, for estimating perceptual variability in visual clustering. It provides a systematic way to assess the variability in conducting visual clustering by identifying key factors that affect cluster separation and deploying a regression module to estimate cluster ambiguity."
}