{
    "title": "An Encoder-Decoder Approach for Packing Circles. (arXiv:2308.07335v1 [cs.AI])",
    "abstract": "The problem of packing smaller objects within a larger object has been of interest since decades. In these problems, in addition to the requirement that the smaller objects must lie completely inside the larger objects, they are expected to not overlap or have minimum overlap with each other. Due to this, the problem of packing turns out to be a non-convex problem, obtaining whose optimal solution is challenging. As such, several heuristic approaches have been used for obtaining sub-optimal solutions in general, and provably optimal solutions for some special instances. In this paper, we propose a novel encoder-decoder architecture consisting of an encoder block, a perturbation block and a decoder block, for packing identical circles within a larger circle. In our approach, the encoder takes the index of a circle to be packed as an input and outputs its center through a normalization layer, the perturbation layer adds controlled perturbations to the center, ensuring that it does not de",
    "link": "http://arxiv.org/abs/2308.07335",
    "context": "Title: An Encoder-Decoder Approach for Packing Circles. (arXiv:2308.07335v1 [cs.AI])\nAbstract: The problem of packing smaller objects within a larger object has been of interest since decades. In these problems, in addition to the requirement that the smaller objects must lie completely inside the larger objects, they are expected to not overlap or have minimum overlap with each other. Due to this, the problem of packing turns out to be a non-convex problem, obtaining whose optimal solution is challenging. As such, several heuristic approaches have been used for obtaining sub-optimal solutions in general, and provably optimal solutions for some special instances. In this paper, we propose a novel encoder-decoder architecture consisting of an encoder block, a perturbation block and a decoder block, for packing identical circles within a larger circle. In our approach, the encoder takes the index of a circle to be packed as an input and outputs its center through a normalization layer, the perturbation layer adds controlled perturbations to the center, ensuring that it does not de",
    "path": "papers/23/08/2308.07335.json",
    "total_tokens": 929,
    "translated_title": "一个编码-解码的方法用于装填圆形",
    "translated_abstract": "自从几十年以来，将较小的物体完全放置在较大的物体内一直是一个有趣的问题。在这些问题中，除了要求较小的物体必须完全位于较大的物体内，还要求它们不重叠或尽量最小化重叠面积。因此，装填问题成为一个非凸问题，其最优解的获取具有挑战性。因此，在一般情况下，我们使用了一些启发式方法来获取亚最优解，并针对某些特殊情况获得了可证明最优解。在本文中，我们提出了一种新颖的编码-解码架构，包括编码器块、扰动块和解码器块，用于将相同的圆形放置在一个较大的圆形中。在我们的方法中，编码器以要放置的圆的索引作为输入，并通过标准化层输出其中心，扰动层对中心添加受控扰动，以确保它不会超出边界。解码器通过反转编码器过程来恢复圆的位置。通过训练集进行训练和优化，我们的方法可以有效地解决圆形装填问题，并取得了很好的效果。",
    "tldr": "本文提出了一个编码-解码的方法，用于将相同的圆形放置在一个较大的圆形中。该方法通过编码和解码过程，以及添加受控扰动来有效解决装填问题。",
    "en_tdlr": "This paper proposes an encoder-decoder approach for packing identical circles within a larger circle. The method effectively solves the packing problem through encoding, decoding, and controlled perturbations."
}