{
    "title": "Deep learning assisted robust detection techniques for a chipless RFID sensor tag. (arXiv:2308.13944v1 [eess.SP])",
    "abstract": "In this paper, we present a new approach for robust reading of identification and sensor data from chipless RFID sensor tags. For the first time, Machine Learning (ML) and Deep Learning (DL) regression modelling techniques are applied to a dataset of measured Radar Cross Section (RCS) data that has been derived from large-scale robotic measurements of custom-designed, 3-bit chipless RFID sensor tags. The robotic system is implemented using the first-of-its-kind automated data acquisition method using an ur16e industry-standard robot. A large data set of 9,600 Electromagnetic (EM) RCS signatures collected using the automated system is used to train and validate four ML models and four 1-dimensional Convolutional Neural Network (1D CNN) architectures. For the first time, we report an end-to-end design and implementation methodology for robust detection of identification (ID) and sensing data using ML/DL models. Also, we report, for the first time, the effect of varying tag surface shapes",
    "link": "http://arxiv.org/abs/2308.13944",
    "context": "Title: Deep learning assisted robust detection techniques for a chipless RFID sensor tag. (arXiv:2308.13944v1 [eess.SP])\nAbstract: In this paper, we present a new approach for robust reading of identification and sensor data from chipless RFID sensor tags. For the first time, Machine Learning (ML) and Deep Learning (DL) regression modelling techniques are applied to a dataset of measured Radar Cross Section (RCS) data that has been derived from large-scale robotic measurements of custom-designed, 3-bit chipless RFID sensor tags. The robotic system is implemented using the first-of-its-kind automated data acquisition method using an ur16e industry-standard robot. A large data set of 9,600 Electromagnetic (EM) RCS signatures collected using the automated system is used to train and validate four ML models and four 1-dimensional Convolutional Neural Network (1D CNN) architectures. For the first time, we report an end-to-end design and implementation methodology for robust detection of identification (ID) and sensing data using ML/DL models. Also, we report, for the first time, the effect of varying tag surface shapes",
    "path": "papers/23/08/2308.13944.json",
    "total_tokens": 918,
    "translated_title": "用于无芯片RFID传感器标签的深度学习辅助的鲁棒检测技术",
    "translated_abstract": "本文提出了一种新的方法，可以从无芯片RFID传感器标签中稳定读取识别和传感数据。首次将机器学习（ML）和深度学习（DL）回归建模技术应用于由大规模机器人测量的定制3位无芯片RFID传感器标签的雷达散射截面（RCS）数据集。该机器人系统采用ur16e行业标准机器人，使用首创的自动数据采集方法实现。使用自动系统收集的9600个电磁（EM）RCS签名的大型数据集用于训练和验证四种ML模型和四种一维卷积神经网络（1D CNN）架构。首次报道了用于使用ML/DL模型进行识别（ID）和传感数据的鲁棒检测的端到端设计和实现方法。此外，我们还首次报道了不同标签表面形状变化的影响。",
    "tldr": "本文首次将机器学习和深度学习应用于无芯片RFID传感器标签的鲁棒检测中，并提出了一种端到端的设计和实现方法。同时，首次报告了不同标签表面形状变化对检测的影响。"
}