{
    "title": "Analyzing the Reporting Error of Public Transport Trips in the Danish National Travel Survey Using Smart Card Data. (arXiv:2308.01198v1 [stat.AP])",
    "abstract": "Household travel surveys have been used for decades to collect individuals and households' travel behavior. However, self-reported surveys are subject to recall bias, as respondents might struggle to recall and report their activities accurately. This study addresses examines the time reporting error of public transit users in a nationwide household travel survey by matching, at the individual level, five consecutive years of data from two sources, namely the Danish National Travel Survey (TU) and the Danish Smart Card system (Rejsekort). Survey respondents are matched with travel cards from the Rejsekort data solely based on the respondents' declared spatiotemporal travel behavior. Approximately, 70% of the respondents were successfully matched with Rejsekort travel cards. The findings reveal a median time reporting error of 11.34 minutes, with an Interquartile Range of 28.14 minutes. Furthermore, a statistical analysis was performed to explore the relationships between the survey res",
    "link": "http://arxiv.org/abs/2308.01198",
    "context": "Title: Analyzing the Reporting Error of Public Transport Trips in the Danish National Travel Survey Using Smart Card Data. (arXiv:2308.01198v1 [stat.AP])\nAbstract: Household travel surveys have been used for decades to collect individuals and households' travel behavior. However, self-reported surveys are subject to recall bias, as respondents might struggle to recall and report their activities accurately. This study addresses examines the time reporting error of public transit users in a nationwide household travel survey by matching, at the individual level, five consecutive years of data from two sources, namely the Danish National Travel Survey (TU) and the Danish Smart Card system (Rejsekort). Survey respondents are matched with travel cards from the Rejsekort data solely based on the respondents' declared spatiotemporal travel behavior. Approximately, 70% of the respondents were successfully matched with Rejsekort travel cards. The findings reveal a median time reporting error of 11.34 minutes, with an Interquartile Range of 28.14 minutes. Furthermore, a statistical analysis was performed to explore the relationships between the survey res",
    "path": "papers/23/08/2308.01198.json",
    "total_tokens": 884,
    "translated_title": "使用智能卡数据分析丹麦全国出行调查中公共交通的报告误差",
    "translated_abstract": "家庭出行调查已经用于数十年来收集个人和家庭的出行行为。然而，自我报告的调查存在回忆偏差，因为受访者可能难以准确回忆和报告他们的活动。本研究通过将两个数据源的连续五年数据在个体层面进行匹配（即丹麦国家出行调查和丹麦智能卡系统），来研究全国范围内家庭出行调查中公共交通用户的时间报告误差。调查受访者与智能卡数据中的旅行卡进行匹配，匹配仅基于受访者声明的时空旅行行为。大约70%的受访者成功与智能卡进行匹配。研究结果显示，中位数的时间报告误差为11.34分钟，四分位范围为28.14分钟。此外，进行了统计分析来探索调查响应者特征和报告误差之间的关系。",
    "tldr": "本研究使用丹麦智能卡数据和全国出行调查数据，发现在公共交通用户的时间报告中存在中位数为11.34分钟的报告误差。",
    "en_tdlr": "This study investigates the time reporting error of public transit users in a nationwide survey, finding a median reporting error of 11.34 minutes using Danish smart card data."
}