{
    "title": "DMFC-GraspNet: Differentiable Multi-Fingered Robotic Grasp Generation in Cluttered Scenes. (arXiv:2308.00456v1 [cs.RO])",
    "abstract": "Robotic grasping is a fundamental skill required for object manipulation in robotics. Multi-fingered robotic hands, which mimic the structure of the human hand, can potentially perform complex object manipulations. Nevertheless, current techniques for multi-fingered robotic grasping frequently predict only a single grasp for each inference time, limiting their versatility and efficiency. This paper proposes a differentiable multi-fingered grasp generation network (DMFC-GraspNet) with two main contributions to address this challenge. Firstly, a novel neural grasp planner is proposed, which predicts a new grasp representation to enable versatile and dense grasp predictions. Secondly, a scene creation and label mapping method is developed for dense labeling of multi-fingered robotic hands, which allows a dense association of ground truth grasps. The proposed approach is evaluated through simulation studies and compared to existing approaches. The results demonstrate the effectiveness of t",
    "link": "http://arxiv.org/abs/2308.00456",
    "context": "Title: DMFC-GraspNet: Differentiable Multi-Fingered Robotic Grasp Generation in Cluttered Scenes. (arXiv:2308.00456v1 [cs.RO])\nAbstract: Robotic grasping is a fundamental skill required for object manipulation in robotics. Multi-fingered robotic hands, which mimic the structure of the human hand, can potentially perform complex object manipulations. Nevertheless, current techniques for multi-fingered robotic grasping frequently predict only a single grasp for each inference time, limiting their versatility and efficiency. This paper proposes a differentiable multi-fingered grasp generation network (DMFC-GraspNet) with two main contributions to address this challenge. Firstly, a novel neural grasp planner is proposed, which predicts a new grasp representation to enable versatile and dense grasp predictions. Secondly, a scene creation and label mapping method is developed for dense labeling of multi-fingered robotic hands, which allows a dense association of ground truth grasps. The proposed approach is evaluated through simulation studies and compared to existing approaches. The results demonstrate the effectiveness of t",
    "path": "papers/23/08/2308.00456.json",
    "total_tokens": 965,
    "translated_title": "DMFC-GraspNet: 多指机器人在杂乱场景中可微的抓取生成",
    "translated_abstract": "机器人抓取是机器人操作中必备的基本技能。模仿人手结构的多指机器人手可以进行复杂的物体操作。然而，目前的多指机器人抓取技术通常在每次推理中只能预测一次抓取，限制了其多样性和效率。本文提出了一种可微的多指抓取生成网络（DMFC-GraspNet），针对这一挑战做出了两个主要贡献。首先，提出了一种新颖的神经抓取规划器，预测了一种新的抓取表示方法，实现了多样化而稠密的抓取预测。其次，开发了一种场景创建和标签映射方法，用于多指机器人手的稠密标注，实现了与真实抓取的密切关联。通过仿真研究对所提出的方法进行了评估，并与现有方法进行了比较。结果表明了该方法的有效性。",
    "tldr": "本文提出了DMFC-GraspNet，在多指机器人抓取生成领域做出了两个主要贡献：一是提出了可微的多指抓取规划方法，实现了多样化和稠密的抓取预测；二是开发了一种稠密标注方法，使得多指机器人手与真实抓取密切关联。结果表明了该方法的有效性。"
}