{
    "title": "Omega-Regular Reward Machines. (arXiv:2308.07469v1 [cs.LG])",
    "abstract": "Reinforcement learning (RL) is a powerful approach for training agents to perform tasks, but designing an appropriate reward mechanism is critical to its success. However, in many cases, the complexity of the learning objectives goes beyond the capabilities of the Markovian assumption, necessitating a more sophisticated reward mechanism. Reward machines and omega-regular languages are two formalisms used to express non-Markovian rewards for quantitative and qualitative objectives, respectively. This paper introduces omega-regular reward machines, which integrate reward machines with omega-regular languages to enable an expressive and effective reward mechanism for RL. We present a model-free RL algorithm to compute epsilon-optimal strategies against omega-egular reward machines and evaluate the effectiveness of the proposed algorithm through experiments.",
    "link": "http://arxiv.org/abs/2308.07469",
    "context": "Title: Omega-Regular Reward Machines. (arXiv:2308.07469v1 [cs.LG])\nAbstract: Reinforcement learning (RL) is a powerful approach for training agents to perform tasks, but designing an appropriate reward mechanism is critical to its success. However, in many cases, the complexity of the learning objectives goes beyond the capabilities of the Markovian assumption, necessitating a more sophisticated reward mechanism. Reward machines and omega-regular languages are two formalisms used to express non-Markovian rewards for quantitative and qualitative objectives, respectively. This paper introduces omega-regular reward machines, which integrate reward machines with omega-regular languages to enable an expressive and effective reward mechanism for RL. We present a model-free RL algorithm to compute epsilon-optimal strategies against omega-egular reward machines and evaluate the effectiveness of the proposed algorithm through experiments.",
    "path": "papers/23/08/2308.07469.json",
    "total_tokens": 769,
    "translated_title": "Omega-Regular Reward Machines. (arXiv:2308.07469v1 [cs.LG])",
    "translated_abstract": "强化学习（RL）是一种强大的训练代理执行任务的方法，但设计适当的奖励机制对其成功至关重要。然而，在许多情况下，学习目标的复杂性超出了马尔可夫假设的能力范围，需要更复杂的奖励机制。奖励机器和ω-正规语言是用于表示定量和定性目标的非马尔可夫奖励的两种形式化方法。本文引入了ω-正规奖励机器，将奖励机器与ω-正规语言集成在一起，为RL提供了一种表达能力强且有效的奖励机制。我们提出了一种无模型RL算法来计算针对ω-正规奖励机器的ε-最优策略，并通过实验证明了所提算法的有效性。",
    "tldr": "本文引入了ω-正规奖励机器，将奖励机器与ω-正规语言集成在一起，为RL提供了一种表达能力强且有效的奖励机制。",
    "en_tdlr": "This paper introduces omega-regular reward machines, which integrate reward machines with omega-regular languages to provide an expressive and effective reward mechanism for RL."
}