{
    "title": "Aspect based sentimental analysis for travellers' reviews. (arXiv:2308.02548v1 [cs.CL])",
    "abstract": "Airport service quality evaluation is commonly found on social media, including Google Maps. This valuable for airport management in order to enhance the quality of services provided. However; prior studies either provide general review for topics discussed by travellers or provide sentimental value to tag the entire review without specifically mentioning the airport service that is behind such value. Accordingly, this work proposes using aspect based sentimental analysis in order to provide more detailed analysis for travellers reviews. This works applied aspect based sentimental analysis on data collected from Google Map about Dubai and Doha airports. The results provide tangible reasons to use aspect based sentimental analysis in order to understand more the travellers and spot airport services that are in need for improvement.",
    "link": "http://arxiv.org/abs/2308.02548",
    "context": "Title: Aspect based sentimental analysis for travellers' reviews. (arXiv:2308.02548v1 [cs.CL])\nAbstract: Airport service quality evaluation is commonly found on social media, including Google Maps. This valuable for airport management in order to enhance the quality of services provided. However; prior studies either provide general review for topics discussed by travellers or provide sentimental value to tag the entire review without specifically mentioning the airport service that is behind such value. Accordingly, this work proposes using aspect based sentimental analysis in order to provide more detailed analysis for travellers reviews. This works applied aspect based sentimental analysis on data collected from Google Map about Dubai and Doha airports. The results provide tangible reasons to use aspect based sentimental analysis in order to understand more the travellers and spot airport services that are in need for improvement.",
    "path": "papers/23/08/2308.02548.json",
    "total_tokens": 751,
    "translated_title": "旅行者评论的基于方面的情感分析",
    "translated_abstract": "机场服务质量评估通常可以在社交媒体上找到，包括谷歌地图。这对于机场管理来说是很有价值的，可以提高所提供服务的质量。然而，先前的研究要么提供旅行者讨论的主题的总体评论，要么提供情感值来标记整个评论，而没有具体提及背后的机场服务。因此，本研究提出使用基于方面的情感分析，以提供对旅行者评论的更详细的分析。本研究在谷歌地图关于迪拜和多哈机场的数据上应用了基于方面的情感分析。结果提供了使用基于方面的情感分析来更好地了解旅行者和发现需要改进的机场服务的可触及的原因。",
    "tldr": "本论文提出了一种基于方面的情感分析方法，能够更详细地分析旅行者的评论，从而帮助机场管理了解旅行者的需求，并发现需要改进的机场服务。",
    "en_tdlr": "This paper proposes an aspect based sentimental analysis method to provide detailed analysis of travellers' reviews, helping airport management understand the needs of travellers and identify areas for improvement in airport services."
}