{
    "title": "A Comparative Study of Sentence Embedding Models for Assessing Semantic Variation. (arXiv:2308.04625v1 [cs.CL])",
    "abstract": "Analyzing the pattern of semantic variation in long real-world texts such as books or transcripts is interesting from the stylistic, cognitive, and linguistic perspectives. It is also useful for applications such as text segmentation, document summarization, and detection of semantic novelty. The recent emergence of several vector-space methods for sentence embedding has made such analysis feasible. However, this raises the issue of how consistent and meaningful the semantic representations produced by various methods are in themselves. In this paper, we compare several recent sentence embedding methods via time-series of semantic similarity between successive sentences and matrices of pairwise sentence similarity for multiple books of literature. In contrast to previous work using target tasks and curated datasets to compare sentence embedding methods, our approach provides an evaluation of the methods 'in the wild'. We find that most of the sentence embedding methods considered do in",
    "link": "http://arxiv.org/abs/2308.04625",
    "context": "Title: A Comparative Study of Sentence Embedding Models for Assessing Semantic Variation. (arXiv:2308.04625v1 [cs.CL])\nAbstract: Analyzing the pattern of semantic variation in long real-world texts such as books or transcripts is interesting from the stylistic, cognitive, and linguistic perspectives. It is also useful for applications such as text segmentation, document summarization, and detection of semantic novelty. The recent emergence of several vector-space methods for sentence embedding has made such analysis feasible. However, this raises the issue of how consistent and meaningful the semantic representations produced by various methods are in themselves. In this paper, we compare several recent sentence embedding methods via time-series of semantic similarity between successive sentences and matrices of pairwise sentence similarity for multiple books of literature. In contrast to previous work using target tasks and curated datasets to compare sentence embedding methods, our approach provides an evaluation of the methods 'in the wild'. We find that most of the sentence embedding methods considered do in",
    "path": "papers/23/08/2308.04625.json",
    "total_tokens": 823,
    "translated_title": "句子嵌入模型在评估语义变化中的比较研究",
    "translated_abstract": "分析长篇真实世界文本（如书籍或记录）中语义变化的模式在文体、认知和语言学的角度上很有趣。它也有助于诸如文本分段、文档摘要和语义新颖性检测等应用。最近出现的几种句子嵌入方法使得这种分析成为可能。然而，这引发了不同方法产生的语义表示在自身上是否一致和有意义的问题。在本文中，我们通过时间序列的连续句子语义相似度和多本文学作品的句子对语义相似度矩阵来比较几种最近的句子嵌入方法。与以前使用目标任务和策划数据集来比较句子嵌入方法的工作相比，我们的方法在\"野外\"提供了对方法的评估。我们发现，大多数考虑的句子嵌入方法确实可以获得良好的效果。",
    "tldr": "本研究比较了几种最近的句子嵌入方法在分析语义变化方面的一致性和有效性，并通过真实世界文本进行了评估。"
}