{
    "title": "A Computational Evaluation Framework for Singable Lyric Translation. (arXiv:2308.13715v1 [cs.CL])",
    "abstract": "Lyric translation plays a pivotal role in amplifying the global resonance of music, bridging cultural divides, and fostering universal connections. Translating lyrics, unlike conventional translation tasks, requires a delicate balance between singability and semantics. In this paper, we present a computational framework for the quantitative evaluation of singable lyric translation, which seamlessly integrates musical, linguistic, and cultural dimensions of lyrics. Our comprehensive framework consists of four metrics that measure syllable count distance, phoneme repetition similarity, musical structure distance, and semantic similarity. To substantiate the efficacy of our framework, we collected a singable lyrics dataset, which precisely aligns English, Japanese, and Korean lyrics on a line-by-line and section-by-section basis, and conducted a comparative analysis between singable and non-singable lyrics. Our multidisciplinary approach provides insights into the key components that unde",
    "link": "http://arxiv.org/abs/2308.13715",
    "context": "Title: A Computational Evaluation Framework for Singable Lyric Translation. (arXiv:2308.13715v1 [cs.CL])\nAbstract: Lyric translation plays a pivotal role in amplifying the global resonance of music, bridging cultural divides, and fostering universal connections. Translating lyrics, unlike conventional translation tasks, requires a delicate balance between singability and semantics. In this paper, we present a computational framework for the quantitative evaluation of singable lyric translation, which seamlessly integrates musical, linguistic, and cultural dimensions of lyrics. Our comprehensive framework consists of four metrics that measure syllable count distance, phoneme repetition similarity, musical structure distance, and semantic similarity. To substantiate the efficacy of our framework, we collected a singable lyrics dataset, which precisely aligns English, Japanese, and Korean lyrics on a line-by-line and section-by-section basis, and conducted a comparative analysis between singable and non-singable lyrics. Our multidisciplinary approach provides insights into the key components that unde",
    "path": "papers/23/08/2308.13715.json",
    "total_tokens": 919,
    "translated_title": "《一种用于可唱歌词翻译的计算评估框架》",
    "translated_abstract": "歌词翻译在放大音乐的全球共鸣、弥合文化分歧和促进普遍联系中起着关键作用。与传统的翻译任务不同，歌词翻译需要在可唱性和语义之间保持微妙的平衡。本文提出了一个用于量化评估可唱歌词翻译的计算框架，将歌词的音乐、语言和文化维度无缝集成。我们的综合框架包括四个指标，分别衡量音节数目距离、音素重复相似性、音乐结构距离和语义相似性。为了实证我们框架的有效性，在英文、日文和韩文的歌词上，我们采集了一个可唱歌词数据集，并对可唱和不可唱歌词进行了比较分析。我们的跨学科方法揭示了构成可唱歌词翻译的关键要素。",
    "tldr": "提出了一个用于量化评估可唱歌词翻译的计算框架，通过综合考量音乐、语言和文化维度，研究歌词的音节、音素、音乐结构和语义等方面的相似性指标，揭示了构成可唱歌词翻译的关键要素。"
}