{
    "title": "Multiobjective Evolutionary Component Effect on Algorithm behavior. (arXiv:2308.02527v1 [cs.NE])",
    "abstract": "The performance of multiobjective evolutionary algorithms (MOEAs) varies across problems, making it hard to develop new algorithms or apply existing ones to new problems. To simplify the development and application of new multiobjective algorithms, there has been an increasing interest in their automatic design from their components. These automatically designed metaheuristics can outperform their human-developed counterparts. However, it is still unknown what are the most influential components that lead to performance improvements. This study specifies a new methodology to investigate the effects of the final configuration of an automatically designed algorithm. We apply this methodology to a tuned Multiobjective Evolutionary Algorithm based on Decomposition (MOEA/D) designed by the iterated racing (irace) configuration package on constrained problems of 3 groups: (1) analytical real-world problems, (2) analytical artificial problems and (3) simulated real-world. We then compare the ",
    "link": "http://arxiv.org/abs/2308.02527",
    "context": "Title: Multiobjective Evolutionary Component Effect on Algorithm behavior. (arXiv:2308.02527v1 [cs.NE])\nAbstract: The performance of multiobjective evolutionary algorithms (MOEAs) varies across problems, making it hard to develop new algorithms or apply existing ones to new problems. To simplify the development and application of new multiobjective algorithms, there has been an increasing interest in their automatic design from their components. These automatically designed metaheuristics can outperform their human-developed counterparts. However, it is still unknown what are the most influential components that lead to performance improvements. This study specifies a new methodology to investigate the effects of the final configuration of an automatically designed algorithm. We apply this methodology to a tuned Multiobjective Evolutionary Algorithm based on Decomposition (MOEA/D) designed by the iterated racing (irace) configuration package on constrained problems of 3 groups: (1) analytical real-world problems, (2) analytical artificial problems and (3) simulated real-world. We then compare the ",
    "path": "papers/23/08/2308.02527.json",
    "total_tokens": 819,
    "translated_title": "多目标进化组件对算法行为影响的研究",
    "translated_abstract": "多目标进化算法的性能因问题而异，这使得开发新算法或将现有算法应用于新问题变得困难。为了简化新的多目标算法的开发和应用，人们对其组件的自动设计越来越感兴趣。这些自动设计的元启发式算法可以优于人工开发的对应算法。然而，目前仍不清楚导致性能改进的最具影响力的组件是什么。本研究提出一种新的方法来研究自动设计算法的最终配置的影响。我们将这种方法应用于基于分解的经过调整的多目标进化算法(MOEA/D)，该算法由迭代竞速(irace)配置包设计，应用于三组有约束问题：(1)分析真实世界问题，(2)分析人工问题，(3)模拟真实世界问题。",
    "tldr": "本研究探索了多目标进化算法中最具影响力的组件，通过自动设计出的元启发式算法来提高性能，对不同类型的问题进行了测试和比较。",
    "en_tdlr": "This study investigates the most influential components in multiobjective evolutionary algorithms, improving performance through automatically designed metaheuristics, and tests and compares them on different types of problems."
}