{
    "title": "Time-Varying Quasi-Closed-Phase Analysis for Accurate Formant Tracking in Speech Signals. (arXiv:2308.16540v1 [eess.AS])",
    "abstract": "In this paper, we propose a new method for the accurate estimation and tracking of formants in speech signals using time-varying quasi-closed-phase (TVQCP) analysis. Conventional formant tracking methods typically adopt a two-stage estimate-and-track strategy wherein an initial set of formant candidates are estimated using short-time analysis (e.g., 10--50 ms), followed by a tracking stage based on dynamic programming or a linear state-space model. One of the main disadvantages of these approaches is that the tracking stage, however good it may be, cannot improve upon the formant estimation accuracy of the first stage. The proposed TVQCP method provides a single-stage formant tracking that combines the estimation and tracking stages into one. TVQCP analysis combines three approaches to improve formant estimation and tracking: (1) it uses temporally weighted quasi-closed-phase analysis to derive closed-phase estimates of the vocal tract with reduced interference from the excitation sour",
    "link": "http://arxiv.org/abs/2308.16540",
    "context": "Title: Time-Varying Quasi-Closed-Phase Analysis for Accurate Formant Tracking in Speech Signals. (arXiv:2308.16540v1 [eess.AS])\nAbstract: In this paper, we propose a new method for the accurate estimation and tracking of formants in speech signals using time-varying quasi-closed-phase (TVQCP) analysis. Conventional formant tracking methods typically adopt a two-stage estimate-and-track strategy wherein an initial set of formant candidates are estimated using short-time analysis (e.g., 10--50 ms), followed by a tracking stage based on dynamic programming or a linear state-space model. One of the main disadvantages of these approaches is that the tracking stage, however good it may be, cannot improve upon the formant estimation accuracy of the first stage. The proposed TVQCP method provides a single-stage formant tracking that combines the estimation and tracking stages into one. TVQCP analysis combines three approaches to improve formant estimation and tracking: (1) it uses temporally weighted quasi-closed-phase analysis to derive closed-phase estimates of the vocal tract with reduced interference from the excitation sour",
    "path": "papers/23/08/2308.16540.json",
    "total_tokens": 985,
    "translated_title": "针对语音信号准确追踪共振峰的时变准封闭相位分析方法",
    "translated_abstract": "本文提出了一种利用时变准封闭相位（TVQCP）分析进行语音信号共振峰的准确估计和追踪的新方法。传统的共振峰追踪方法通常采用两阶段的估计和追踪策略，首先利用短时分析（例如10-50毫秒）估计得到初步的共振峰候选集，然后根据动态规划或线性状态空间模型进行追踪。这些方法的主要缺点之一是，无论追踪阶段如何优秀，都无法提高第一阶段的共振峰估计准确度。所提出的TVQCP方法将估计和追踪两个阶段合并为一个单一阶段的共振峰追踪方法。TVQCP分析结合了三种方法来提高共振峰估计和追踪的准确性：（1）利用时域加权的准封闭相位分析，以减少激励源的干扰。",
    "tldr": "本文提出了一种新的方法，利用时变准封闭相位分析进行语音信号共振峰的准确估计和追踪，通过将估计和追踪两个阶段合并为一个单一阶段，提高了共振峰估计和追踪的准确性。",
    "en_tdlr": "This paper proposes a new method for accurate estimation and tracking of formants in speech signals using time-varying quasi-closed-phase (TVQCP) analysis. By combining the estimation and tracking stages into one single stage, the proposed method improves the accuracy of formant estimation and tracking."
}