{
    "title": "GRINN: A Physics-Informed Neural Network for solving hydrodynamic systems in the presence of self-gravity. (arXiv:2308.08010v1 [cs.LG])",
    "abstract": "Modeling self-gravitating gas flows is essential to answering many fundamental questions in astrophysics. This spans many topics including planet-forming disks, star-forming clouds, galaxy formation, and the development of large-scale structures in the Universe. However, the nonlinear interaction between gravity and fluid dynamics offers a formidable challenge to solving the resulting time-dependent partial differential equations (PDEs) in three dimensions (3D). By leveraging the universal approximation capabilities of a neural network within a mesh-free framework, physics informed neural networks (PINNs) offer a new way of addressing this challenge. We introduce the gravity-informed neural network (GRINN), a PINN-based code, to simulate 3D self-gravitating hydrodynamic systems. Here, we specifically study gravitational instability and wave propagation in an isothermal gas. Our results match a linear analytic solution to within 1\\% in the linear regime and a conventional grid code solu",
    "link": "http://arxiv.org/abs/2308.08010",
    "context": "Title: GRINN: A Physics-Informed Neural Network for solving hydrodynamic systems in the presence of self-gravity. (arXiv:2308.08010v1 [cs.LG])\nAbstract: Modeling self-gravitating gas flows is essential to answering many fundamental questions in astrophysics. This spans many topics including planet-forming disks, star-forming clouds, galaxy formation, and the development of large-scale structures in the Universe. However, the nonlinear interaction between gravity and fluid dynamics offers a formidable challenge to solving the resulting time-dependent partial differential equations (PDEs) in three dimensions (3D). By leveraging the universal approximation capabilities of a neural network within a mesh-free framework, physics informed neural networks (PINNs) offer a new way of addressing this challenge. We introduce the gravity-informed neural network (GRINN), a PINN-based code, to simulate 3D self-gravitating hydrodynamic systems. Here, we specifically study gravitational instability and wave propagation in an isothermal gas. Our results match a linear analytic solution to within 1\\% in the linear regime and a conventional grid code solu",
    "path": "papers/23/08/2308.08010.json",
    "total_tokens": 918,
    "translated_title": "GRINN:一种物理信息导向的神经网络，在自重存在的情况下求解流体动力学系统",
    "translated_abstract": "建模自重气体流动对于回答天体物理学中的许多基本问题是至关重要的。这涉及众多话题，包括行星形成盘、星云形成、星系形成以及宇宙中大尺度结构的发展。然而，重力与流体动力学之间的非线性相互作用对求解所得到的三维时变偏微分方程（PDEs）提出了巨大的挑战。通过在一个无网格框架中利用神经网络的普适逼近能力，物理信息导向的神经网络（PINNs）提供了解决这一挑战的新方法。我们介绍了一种基于PINN的码，名为GRINN，用于模拟三维自重流体动力学系统。在这里，我们特别研究一个等温气体中的重力不稳定性和波传播。我们的结果在线性区域内与线性解相匹配，误差在1%以内，与传统网格码求解的结果一致。",
    "tldr": "GRINN是一种物理信息导向的神经网络，用于在自重存在的情况下求解三维流体动力学系统。它在模拟重力不稳定性和波传播方面取得了良好的结果。",
    "en_tdlr": "GRINN is a physics-informed neural network designed to solve 3D hydrodynamic systems in the presence of self-gravity. It successfully simulates gravitational instability and wave propagation in an isothermal gas with high accuracy."
}