{
    "title": "Diffusion Models for Interferometric Satellite Aperture Radar. (arXiv:2308.16847v1 [cs.CV])",
    "abstract": "Probabilistic Diffusion Models (PDMs) have recently emerged as a very promising class of generative models, achieving high performance in natural image generation. However, their performance relative to non-natural images, like radar-based satellite data, remains largely unknown. Generating large amounts of synthetic (and especially labelled) satellite data is crucial to implement deep-learning approaches for the processing and analysis of (interferometric) satellite aperture radar data. Here, we leverage PDMs to generate several radar-based satellite image datasets. We show that PDMs succeed in generating images with complex and realistic structures, but that sampling time remains an issue. Indeed, accelerated sampling strategies, which work well on simple image datasets like MNIST, fail on our radar datasets. We provide a simple and versatile open-source https://github.com/thomaskerdreux/PDM_SAR_InSAR_generation to train, sample and evaluate PDMs using any dataset on a single GPU.",
    "link": "http://arxiv.org/abs/2308.16847",
    "context": "Title: Diffusion Models for Interferometric Satellite Aperture Radar. (arXiv:2308.16847v1 [cs.CV])\nAbstract: Probabilistic Diffusion Models (PDMs) have recently emerged as a very promising class of generative models, achieving high performance in natural image generation. However, their performance relative to non-natural images, like radar-based satellite data, remains largely unknown. Generating large amounts of synthetic (and especially labelled) satellite data is crucial to implement deep-learning approaches for the processing and analysis of (interferometric) satellite aperture radar data. Here, we leverage PDMs to generate several radar-based satellite image datasets. We show that PDMs succeed in generating images with complex and realistic structures, but that sampling time remains an issue. Indeed, accelerated sampling strategies, which work well on simple image datasets like MNIST, fail on our radar datasets. We provide a simple and versatile open-source https://github.com/thomaskerdreux/PDM_SAR_InSAR_generation to train, sample and evaluate PDMs using any dataset on a single GPU.",
    "path": "papers/23/08/2308.16847.json",
    "total_tokens": 969,
    "translated_title": "干涉合成孔径雷达的扩散模型",
    "translated_abstract": "概率扩散模型（PDMs）最近被证明是一类非常有前景的生成模型，能够在自然图像生成方面取得高性能。然而，与非自然图像（如基于雷达的卫星数据）相比，它们在性能上还是大部分未知的。生成大量的合成（尤其是标记的）卫星数据对于实现深度学习方法来处理和分析（干涉）卫星孔径雷达数据至关重要。在这里，我们利用PDMs生成了几个基于雷达的卫星图像数据集。我们展示了PDMs成功生成了具有复杂和逼真结构的图像，但采样时间仍然是一个问题。事实上，加速采样策略在简单的图像数据集（如MNIST）上效果良好，但在我们的雷达数据集上失败了。我们提供了一个简单而多功能的开源工具https://github.com/thomaskerdreux/PDM_SAR_InSAR_generation，可以在单个GPU上训练、采样和评估PDMs使用任何数据集。",
    "tldr": "该论文使用概率扩散模型（PDMs）生成了基于雷达的卫星图像数据集，展示了PDMs成功生成了复杂和逼真结构的图像，但采样时间仍然是一个问题。他们还提供了一个简单而多功能的开源工具，可以在单个GPU上训练、采样和评估PDMs使用任何数据集。",
    "en_tdlr": "This paper presents the use of Probabilistic Diffusion Models (PDMs) to generate radar-based satellite image datasets, showing successful generation of complex and realistic images, but highlighting the issue of sampling time. They also provide a versatile open-source tool for training, sampling, and evaluating PDMs on any dataset using a single GPU."
}