{
    "title": "ERA*: Enhanced Relaxed A* algorithm for Solving the Shortest Path Problem in Regular Grid Maps. (arXiv:2308.10988v1 [cs.AI])",
    "abstract": "This paper introduces a novel algorithm for solving the point-to-point shortest path problem in a static regular 8-neighbor connectivity (G8) grid. This algorithm can be seen as a generalization of Hadlock algorithm to G8 grids, and is shown to be theoretically equivalent to the relaxed $A^*$ ($RA^*$) algorithm in terms of the provided solution's path length, but with substantial time and memory savings, due to a completely different computation strategy, based on defining a set of lookup matrices. Through an experimental study on grid maps of various types and sizes (1290 runs on 43 maps), it is proven to be 2.25 times faster than $RA^*$ and 17 times faster than the original $A^*$, in average. Moreover, it is more memory-efficient, since it does not need to store a G score matrix.",
    "link": "http://arxiv.org/abs/2308.10988",
    "context": "Title: ERA*: Enhanced Relaxed A* algorithm for Solving the Shortest Path Problem in Regular Grid Maps. (arXiv:2308.10988v1 [cs.AI])\nAbstract: This paper introduces a novel algorithm for solving the point-to-point shortest path problem in a static regular 8-neighbor connectivity (G8) grid. This algorithm can be seen as a generalization of Hadlock algorithm to G8 grids, and is shown to be theoretically equivalent to the relaxed $A^*$ ($RA^*$) algorithm in terms of the provided solution's path length, but with substantial time and memory savings, due to a completely different computation strategy, based on defining a set of lookup matrices. Through an experimental study on grid maps of various types and sizes (1290 runs on 43 maps), it is proven to be 2.25 times faster than $RA^*$ and 17 times faster than the original $A^*$, in average. Moreover, it is more memory-efficient, since it does not need to store a G score matrix.",
    "path": "papers/23/08/2308.10988.json",
    "total_tokens": 878,
    "translated_title": "ERA*: 改进的放松A*算法用于解决规则网格地图中的最短路径问题",
    "translated_abstract": "本文介绍了一种新的算法，用于解决静态规则8邻接连通（G8）网格中的点对点最短路径问题。这个算法可以视为将Hadlock算法推广到G8网格的结果，并且在所提供的解的路径长度方面在理论上等价于放松A* (RA*)算法，但由于完全不同的计算策略（基于定义一组查找矩阵），能够节省大量的时间和内存。通过对各种类型和大小的网格地图进行实验研究（在43个地图上进行了1290次运行），平均证明它比RA*快2.25倍，比原始A*快17倍。此外，它更节省内存，因为不需要存储G得分矩阵。",
    "tldr": "本文介绍了一种改进的放松A*算法，用于解决规则网格地图中的最短路径问题。相较于现有算法，该算法在时间和内存方面具有显著的优势，并通过实验证明其在各种类型和大小的地图上都表现出高效性能。",
    "en_tdlr": "This paper presents an enhanced relaxed A* algorithm for solving the shortest path problem in regular grid maps. The algorithm is theoretically equivalent to the relaxed A* algorithm but offers substantial time and memory savings due to a different computation strategy. Experimental results demonstrate that the proposed algorithm outperforms existing algorithms in terms of speed and memory efficiency across various types and sizes of grid maps."
}