{
    "title": "Physics-inspired Equivariant Descriptors of Non-bonded Interactions. (arXiv:2308.13208v1 [physics.chem-ph])",
    "abstract": "Most of the existing machine-learning schemes applied to atomic-scale simulations rely on a local description of the geometry of a structure, and struggle to model effects that are driven by long-range physical interactions. Efforts to overcome these limitations have focused on the direct incorporation of electrostatics, which is the most prominent effect, often relying on architectures that mirror the functional form of explicit physical models. Including other forms of non-bonded interactions, or predicting properties other than the interatomic potential, requires ad hoc modifications. We propose an alternative approach that extends the long-distance equivariant (LODE) framework to generate local descriptors of an atomic environment that resemble non-bonded potentials with arbitrary asymptotic behaviors, ranging from point-charge electrostatics to dispersion forces. We show that the LODE formalism is amenable to a direct physical interpretation in terms of a generalized multipole exp",
    "link": "http://arxiv.org/abs/2308.13208",
    "context": "Title: Physics-inspired Equivariant Descriptors of Non-bonded Interactions. (arXiv:2308.13208v1 [physics.chem-ph])\nAbstract: Most of the existing machine-learning schemes applied to atomic-scale simulations rely on a local description of the geometry of a structure, and struggle to model effects that are driven by long-range physical interactions. Efforts to overcome these limitations have focused on the direct incorporation of electrostatics, which is the most prominent effect, often relying on architectures that mirror the functional form of explicit physical models. Including other forms of non-bonded interactions, or predicting properties other than the interatomic potential, requires ad hoc modifications. We propose an alternative approach that extends the long-distance equivariant (LODE) framework to generate local descriptors of an atomic environment that resemble non-bonded potentials with arbitrary asymptotic behaviors, ranging from point-charge electrostatics to dispersion forces. We show that the LODE formalism is amenable to a direct physical interpretation in terms of a generalized multipole exp",
    "path": "papers/23/08/2308.13208.json",
    "total_tokens": 843,
    "translated_title": "受物理启发的非键相互作用等变描述符",
    "translated_abstract": "大多数应用于原子尺度模拟的现有机器学习方案依赖于对结构几何的局部描述，并且在建模由长程物理相互作用驱动的效应方面困难重重。克服这些限制的努力集中于直接将静电引入，这是最突出的效应，通常依赖于与显式物理模型的功能形式相似的体系结构。包括其他形式的非键相互作用，或者预测除了原子间势能之外的性质，需要进行临时修改。我们提出了一种替代方法，将远程等变（LODE）框架扩展到生成类似任意渐近行为的非键位势的原子环境的局部描述符，从点电荷静电到色散力。我们证明，LODE形式主义可通过广义多极展开直观地解释。",
    "tldr": "基于物理启发，我们提出了一种受物理启发的非键相互作用等变描述符框架，该框架能够模拟长程物理相互作用，并且能够生成类似非键位势的局部描述符。"
}