{
    "title": "A Multilayer Perceptron-based Fast Sunlight Assessment for the Conceptual Design of Residential Neighborhoods under Chinese Policy. (arXiv:2308.07616v1 [cs.LG])",
    "abstract": "In Chinese building codes, it is required that residential buildings receive a minimum number of hours of natural, direct sunlight on a specified winter day, which represents the worst sunlight condition in a year. This requirement is a prerequisite for obtaining a building permit during the conceptual design of a residential project. Thus, officially sanctioned software is usually used to assess the sunlight performance of buildings. These software programs predict sunlight hours based on repeated shading calculations, which is time-consuming. This paper proposed a multilayer perceptron-based method, a one-stage prediction approach, which outputs a shading time interval caused by the inputted cuboid-form building. The sunlight hours of a site can be obtained by calculating the union of the sunlight time intervals (complement of shading time interval) of all the buildings. Three numerical experiments, i.e., horizontal level and slope analysis, and simulation-based optimization are carr",
    "link": "http://arxiv.org/abs/2308.07616",
    "context": "Title: A Multilayer Perceptron-based Fast Sunlight Assessment for the Conceptual Design of Residential Neighborhoods under Chinese Policy. (arXiv:2308.07616v1 [cs.LG])\nAbstract: In Chinese building codes, it is required that residential buildings receive a minimum number of hours of natural, direct sunlight on a specified winter day, which represents the worst sunlight condition in a year. This requirement is a prerequisite for obtaining a building permit during the conceptual design of a residential project. Thus, officially sanctioned software is usually used to assess the sunlight performance of buildings. These software programs predict sunlight hours based on repeated shading calculations, which is time-consuming. This paper proposed a multilayer perceptron-based method, a one-stage prediction approach, which outputs a shading time interval caused by the inputted cuboid-form building. The sunlight hours of a site can be obtained by calculating the union of the sunlight time intervals (complement of shading time interval) of all the buildings. Three numerical experiments, i.e., horizontal level and slope analysis, and simulation-based optimization are carr",
    "path": "papers/23/08/2308.07616.json",
    "total_tokens": 986,
    "translated_title": "基于多层感知器的快速阳光评估法用于中国住宅小区的概念设计",
    "translated_abstract": "在中国的建筑规范中，要求住宅建筑在指定的冬季日子上接收到最低小时数的自然直射阳光，这代表了一年中最差的阳光条件。这一要求是在住宅项目的概念设计阶段获取建筑许可的先决条件。因此，通常使用官方认可的软件来评估建筑的阳光性能。这些软件根据重复的遮挡计算来预测阳光小时数，这是一项耗时的工作。本文提出了一种基于多层感知器的方法，即一阶段预测方法，该方法输出由输入的长方体形式建筑所引起的遮挡时间间隔。通过计算所有建筑的阳光时间间隔的并集（遮挡时间间隔的补集），可以得到一个地块的阳光小时数。进行了三个数值实验，即水平水平和坡度分析以及基于模拟的优化。",
    "tldr": "本研究提出了一种基于多层感知器的方法，用于快速评估中国住宅小区的阳光条件。该方法通过一阶段预测，输出输入立方体形状建筑导致的遮挡时间间隔，从而得到建筑的阳光小时数。这种方法比传统软件更快速，可以在概念设计阶段使用，有助于优化建筑阳光性能。"
}