{
    "title": "IDVT: Interest-aware Denoising and View-guided Tuning for Social Recommendation. (arXiv:2308.15926v1 [cs.AI])",
    "abstract": "In the information age, recommendation systems are vital for efficiently filtering information and identifying user preferences. Online social platforms have enriched these systems by providing valuable auxiliary information. Socially connected users are assumed to share similar preferences, enhancing recommendation accuracy and addressing cold start issues. However, empirical findings challenge the assumption, revealing that certain social connections can actually harm system performance. Our statistical analysis indicates a significant amount of noise in the social network, where many socially connected users do not share common interests. To address this issue, we propose an innovative \\underline{I}nterest-aware \\underline{D}enoising and \\underline{V}iew-guided \\underline{T}uning (IDVT) method for the social recommendation. The first ID part effectively denoises social connections. Specifically, the denoising process considers both social network structure and user interaction inter",
    "link": "http://arxiv.org/abs/2308.15926",
    "context": "Title: IDVT: Interest-aware Denoising and View-guided Tuning for Social Recommendation. (arXiv:2308.15926v1 [cs.AI])\nAbstract: In the information age, recommendation systems are vital for efficiently filtering information and identifying user preferences. Online social platforms have enriched these systems by providing valuable auxiliary information. Socially connected users are assumed to share similar preferences, enhancing recommendation accuracy and addressing cold start issues. However, empirical findings challenge the assumption, revealing that certain social connections can actually harm system performance. Our statistical analysis indicates a significant amount of noise in the social network, where many socially connected users do not share common interests. To address this issue, we propose an innovative \\underline{I}nterest-aware \\underline{D}enoising and \\underline{V}iew-guided \\underline{T}uning (IDVT) method for the social recommendation. The first ID part effectively denoises social connections. Specifically, the denoising process considers both social network structure and user interaction inter",
    "path": "papers/23/08/2308.15926.json",
    "total_tokens": 835,
    "translated_title": "IDVT: 面向社交推荐的兴趣感知去噪和视图引导调节",
    "translated_abstract": "在信息时代，推荐系统对于高效过滤信息和识别用户偏好至关重要。在线社交平台通过提供有价值的辅助信息丰富了这些系统。社交连接的用户被认为具有相似的偏好，增强了推荐准确性并解决了冷启动问题。然而，实证研究发现，某些社交连接实际上会损害系统性能。我们的统计分析表明，社交网络中存在大量的噪声，许多社交连接的用户并不共享相同的兴趣。为了解决这个问题，我们提出了一种创新的面向社交推荐的兴趣感知去噪和视图引导调节（IDVT）方法。第一个去噪部分有效地去除了社交连接。具体而言，去噪过程考虑了社交网络结构和用户交互之间的关系。",
    "tldr": "IDVT是一种创新的面向社交推荐的方法，通过兴趣感知去噪和视图引导调节来解决社交网络中的噪声问题，并提高推荐系统的准确性。"
}