{
    "title": "CLE Diffusion: Controllable Light Enhancement Diffusion Model. (arXiv:2308.06725v2 [cs.CV] UPDATED)",
    "abstract": "Low light enhancement has gained increasing importance with the rapid development of visual creation and editing. However, most existing enhancement algorithms are designed to homogeneously increase the brightness of images to a pre-defined extent, limiting the user experience. To address this issue, we propose Controllable Light Enhancement Diffusion Model, dubbed CLE Diffusion, a novel diffusion framework to provide users with rich controllability. Built with a conditional diffusion model, we introduce an illumination embedding to let users control their desired brightness level. Additionally, we incorporate the Segment-Anything Model (SAM) to enable user-friendly region controllability, where users can click on objects to specify the regions they wish to enhance. Extensive experiments demonstrate that CLE Diffusion achieves competitive performance regarding quantitative metrics, qualitative results, and versatile controllability. Project page: https://yuyangyin.github.io/CLEDiffusio",
    "link": "http://arxiv.org/abs/2308.06725",
    "context": "Title: CLE Diffusion: Controllable Light Enhancement Diffusion Model. (arXiv:2308.06725v2 [cs.CV] UPDATED)\nAbstract: Low light enhancement has gained increasing importance with the rapid development of visual creation and editing. However, most existing enhancement algorithms are designed to homogeneously increase the brightness of images to a pre-defined extent, limiting the user experience. To address this issue, we propose Controllable Light Enhancement Diffusion Model, dubbed CLE Diffusion, a novel diffusion framework to provide users with rich controllability. Built with a conditional diffusion model, we introduce an illumination embedding to let users control their desired brightness level. Additionally, we incorporate the Segment-Anything Model (SAM) to enable user-friendly region controllability, where users can click on objects to specify the regions they wish to enhance. Extensive experiments demonstrate that CLE Diffusion achieves competitive performance regarding quantitative metrics, qualitative results, and versatile controllability. Project page: https://yuyangyin.github.io/CLEDiffusio",
    "path": "papers/23/08/2308.06725.json",
    "total_tokens": 897,
    "translated_title": "CLE扩散：可控性光增强扩散模型",
    "translated_abstract": "随着视觉创作和编辑的快速发展，低光增强变得越来越重要。然而，现有的大多数增强算法都设计为均匀增加图像的亮度到预定义的程度，限制了用户体验。为了解决这个问题，我们提出了一种新颖的扩散框架——可控光增强扩散模型(CLE Diffusion)，以提供丰富的可控性给用户。通过条件扩散模型构建，我们引入了光照嵌入，让用户可以控制所需的亮度水平。此外，我们还结合“任意分割模型”(Segment-Anything Model, SAM)，实现了用户友好的区域可控性，用户可以点击对象来指定他们希望增强的区域。广泛的实验证明，CLE Diffusion在定量指标、定性结果和多样化可控性方面具有竞争力。",
    "tldr": "CLE扩散是一种可控的光增强扩散模型，通过条件扩散和光照嵌入，让用户可以控制亮度水平，并结合任意分割模型实现用户友好的区域可控性。实验证明CLE Diffusion在各项指标上具有竞争力。",
    "en_tdlr": "CLE Diffusion is a controllable light enhancement diffusion model that allows users to control brightness level through conditional diffusion and illumination embedding, and incorporates a segment-anything model for user-friendly region controllability. Experimental results show that CLE Diffusion achieves competitive performance in various metrics."
}