{
    "title": "Unbiased Decisions Reduce Regret: Adversarial Domain Adaptation for the Bank Loan Problem. (arXiv:2308.08051v1 [cs.LG])",
    "abstract": "In many real world settings binary classification decisions are made based on limited data in near real-time, e.g. when assessing a loan application. We focus on a class of these problems that share a common feature: the true label is only observed when a data point is assigned a positive label by the principal, e.g. we only find out whether an applicant defaults if we accepted their loan application. As a consequence, the false rejections become self-reinforcing and cause the labelled training set, that is being continuously updated by the model decisions, to accumulate bias. Prior work mitigates this effect by injecting optimism into the model, however this comes at the cost of increased false acceptance rate. We introduce adversarial optimism (AdOpt) to directly address bias in the training set using adversarial domain adaptation. The goal of AdOpt is to learn an unbiased but informative representation of past data, by reducing the distributional shift between the set of accepted da",
    "link": "http://arxiv.org/abs/2308.08051",
    "context": "Title: Unbiased Decisions Reduce Regret: Adversarial Domain Adaptation for the Bank Loan Problem. (arXiv:2308.08051v1 [cs.LG])\nAbstract: In many real world settings binary classification decisions are made based on limited data in near real-time, e.g. when assessing a loan application. We focus on a class of these problems that share a common feature: the true label is only observed when a data point is assigned a positive label by the principal, e.g. we only find out whether an applicant defaults if we accepted their loan application. As a consequence, the false rejections become self-reinforcing and cause the labelled training set, that is being continuously updated by the model decisions, to accumulate bias. Prior work mitigates this effect by injecting optimism into the model, however this comes at the cost of increased false acceptance rate. We introduce adversarial optimism (AdOpt) to directly address bias in the training set using adversarial domain adaptation. The goal of AdOpt is to learn an unbiased but informative representation of past data, by reducing the distributional shift between the set of accepted da",
    "path": "papers/23/08/2308.08051.json",
    "total_tokens": 890,
    "translated_title": "减少后悔的无偏决策：面向银行贷款问题的对抗领域适应",
    "translated_abstract": "在许多实际情景中，基于有限数据进行二元分类决策是基于近实时的，例如在审批贷款申请时。我们专注于一类具有共同特征的问题：只有在数据点被指派为正标签时才能观察到真实标签，例如，只有在我们接受贷款申请之后才能发现申请人是否违约。因此，错误拒绝会变得自我强化，并导致由模型决策不断更新的标记训练集累积偏差。先前的研究通过将乐观主义注入模型来减轻这种效应，但这会增加错误接受率的代价。我们引入对抗乐观主义（AdOpt），通过对抗性领域适应直接解决训练集中的偏差问题。AdOpt的目标是通过减少被接受数据集的分布偏移来学习过去数据的无偏但信息丰富的表示。",
    "tldr": "该论文介绍了对抗领域适应的方法来解决银行贷款问题中训练集偏差问题，旨在学习无偏但信息丰富的过去数据表示。"
}