{
    "title": "Hierarchical Topological Ordering with Conditional Independence Test for Limited Time Series. (arXiv:2308.08148v1 [cs.LG])",
    "abstract": "Learning directed acyclic graphs (DAGs) to identify causal relations underlying observational data is crucial but also poses significant challenges. Recently, topology-based methods have emerged as a two-step approach to discovering DAGs by first learning the topological ordering of variables and then eliminating redundant edges, while ensuring that the graph remains acyclic. However, one limitation is that these methods would generate numerous spurious edges that require subsequent pruning. To overcome this limitation, in this paper, we propose an improvement to topology-based methods by introducing limited time series data, consisting of only two cross-sectional records that need not be adjacent in time and are subject to flexible timing. By incorporating conditional instrumental variables as exogenous interventions, we aim to identify descendant nodes for each variable. Following this line, we propose a hierarchical topological ordering algorithm with conditional independence test (",
    "link": "http://arxiv.org/abs/2308.08148",
    "context": "Title: Hierarchical Topological Ordering with Conditional Independence Test for Limited Time Series. (arXiv:2308.08148v1 [cs.LG])\nAbstract: Learning directed acyclic graphs (DAGs) to identify causal relations underlying observational data is crucial but also poses significant challenges. Recently, topology-based methods have emerged as a two-step approach to discovering DAGs by first learning the topological ordering of variables and then eliminating redundant edges, while ensuring that the graph remains acyclic. However, one limitation is that these methods would generate numerous spurious edges that require subsequent pruning. To overcome this limitation, in this paper, we propose an improvement to topology-based methods by introducing limited time series data, consisting of only two cross-sectional records that need not be adjacent in time and are subject to flexible timing. By incorporating conditional instrumental variables as exogenous interventions, we aim to identify descendant nodes for each variable. Following this line, we propose a hierarchical topological ordering algorithm with conditional independence test (",
    "path": "papers/23/08/2308.08148.json",
    "total_tokens": 848,
    "translated_title": "有限时间序列的层次化拓扑排序与条件独立性测试",
    "translated_abstract": "学习有向无环图（DAG）以识别观测数据中的因果关系既至关重要又具有重要挑战。最近，基于拓扑的方法作为一种两步法来发现DAG，首先学习变量的拓扑排序，然后消除冗余边，同时确保图形保持无环。然而，其中一个限制是这些方法会生成大量的虚假边，需要后续修剪。为了克服这一限制，在本文中，我们提出了一种改进的基于拓扑的方法，通过引入有限时间序列数据，其中仅包含两个不必相邻且具有灵活时间的横截面记录。通过将条件工具变量作为外生干预变量，我们旨在为每个变量识别后代节点。在这一基础上，我们提出了一种具有条件独立性测试的层次化拓扑排序算法。",
    "tldr": "本文提出了一种改进的基于拓扑的方法，通过引入有限时间序列数据和条件独立性测试，目的是克服传统方法在生成冗余边方面的限制，从而更准确地识别观测数据中的因果关系。",
    "en_tdlr": "This paper proposes an improved topology-based method by introducing limited time series data and conditional independence test to overcome the limitation of traditional methods in generating redundant edges, thereby accurately identifying causal relations in observational data."
}