{
    "title": "Optimizing Machine Translation through Prompt Engineering: An Investigation into ChatGPT's Customizability. (arXiv:2308.01391v1 [cs.CL])",
    "abstract": "This paper explores the influence of integrating the purpose of the translation and the target audience into prompts on the quality of translations produced by ChatGPT. Drawing on previous translation studies, industry practices, and ISO standards, the research underscores the significance of the pre-production phase in the translation process. The study reveals that the inclusion of suitable prompts in large-scale language models like ChatGPT can yield flexible translations, a feat yet to be realized by conventional Machine Translation (MT). The research scrutinizes the changes in translation quality when prompts are used to generate translations that meet specific conditions. The evaluation is conducted from a practicing translator's viewpoint, both subjectively and qualitatively, supplemented by the use of OpenAI's word embedding API for cosine similarity calculations. The findings suggest that the integration of the purpose and target audience into prompts can indeed modify the gen",
    "link": "http://arxiv.org/abs/2308.01391",
    "context": "Title: Optimizing Machine Translation through Prompt Engineering: An Investigation into ChatGPT's Customizability. (arXiv:2308.01391v1 [cs.CL])\nAbstract: This paper explores the influence of integrating the purpose of the translation and the target audience into prompts on the quality of translations produced by ChatGPT. Drawing on previous translation studies, industry practices, and ISO standards, the research underscores the significance of the pre-production phase in the translation process. The study reveals that the inclusion of suitable prompts in large-scale language models like ChatGPT can yield flexible translations, a feat yet to be realized by conventional Machine Translation (MT). The research scrutinizes the changes in translation quality when prompts are used to generate translations that meet specific conditions. The evaluation is conducted from a practicing translator's viewpoint, both subjectively and qualitatively, supplemented by the use of OpenAI's word embedding API for cosine similarity calculations. The findings suggest that the integration of the purpose and target audience into prompts can indeed modify the gen",
    "path": "papers/23/08/2308.01391.json",
    "total_tokens": 909,
    "translated_title": "通过提示工程优化机器翻译：ChatGPT可定制性的研究",
    "translated_abstract": "本文探讨将翻译目的和目标受众融入到ChatGPT提示中对翻译质量的影响。研究借鉴了之前的翻译研究、行业实践和ISO标准，强调了翻译过程中预生产阶段的重要性。研究发现，在像ChatGPT这样的大规模语言模型中使用适当的提示可以产生灵活的翻译，这是传统的机器翻译所没有实现的。研究审查了在生成满足特定条件的翻译时，提示对翻译质量的影响。评估从实际翻译师的角度进行，主观和定性相结合，还使用了OpenAI的词嵌入API进行余弦相似度计算。研究结果表明，将翻译目的和目标受众融入到提示中确实可以修改生成的翻译。",
    "tldr": "本文研究了通过在ChatGPT中运用合适的提示将翻译目的和目标受众融入进去对翻译质量的影响。研究发现，这种方法可以产生灵活的翻译结果，相比传统机器翻译更具定制性。",
    "en_tdlr": "This paper investigates the impact of integrating the purpose and target audience into prompts on the quality of translations produced by ChatGPT. The study shows that this approach can yield flexible translations, making them more customizable compared to conventional Machine Translation."
}