{
    "title": "DatasetEquity: Are All Samples Created Equal? In The Quest For Equity Within Datasets. (arXiv:2308.09878v1 [cs.CV])",
    "abstract": "Data imbalance is a well-known issue in the field of machine learning, attributable to the cost of data collection, the difficulty of labeling, and the geographical distribution of the data. In computer vision, bias in data distribution caused by image appearance remains highly unexplored. Compared to categorical distributions using class labels, image appearance reveals complex relationships between objects beyond what class labels provide. Clustering deep perceptual features extracted from raw pixels gives a richer representation of the data. This paper presents a novel method for addressing data imbalance in machine learning. The method computes sample likelihoods based on image appearance using deep perceptual embeddings and clustering. It then uses these likelihoods to weigh samples differently during training with a proposed \\textbf{Generalized Focal Loss} function. This loss can be easily integrated with deep learning algorithms. Experiments validate the method's effectiveness a",
    "link": "http://arxiv.org/abs/2308.09878",
    "context": "Title: DatasetEquity: Are All Samples Created Equal? In The Quest For Equity Within Datasets. (arXiv:2308.09878v1 [cs.CV])\nAbstract: Data imbalance is a well-known issue in the field of machine learning, attributable to the cost of data collection, the difficulty of labeling, and the geographical distribution of the data. In computer vision, bias in data distribution caused by image appearance remains highly unexplored. Compared to categorical distributions using class labels, image appearance reveals complex relationships between objects beyond what class labels provide. Clustering deep perceptual features extracted from raw pixels gives a richer representation of the data. This paper presents a novel method for addressing data imbalance in machine learning. The method computes sample likelihoods based on image appearance using deep perceptual embeddings and clustering. It then uses these likelihoods to weigh samples differently during training with a proposed \\textbf{Generalized Focal Loss} function. This loss can be easily integrated with deep learning algorithms. Experiments validate the method's effectiveness a",
    "path": "papers/23/08/2308.09878.json",
    "total_tokens": 919,
    "translated_title": "DatasetEquity: 所有样本是否平等？在数据集中追求公平性。",
    "translated_abstract": "数据不平衡是机器学习领域中一个众所周知的问题，归因于数据收集的成本、标签的困难以及数据的地理分布。在计算机视觉中，图像外观引起的数据分布偏差仍未得到很好的研究。与使用类别标签的分类分布相比，图像外观展示了超出类别标签所提供的对象之间的复杂关系。通过对从原始像素中提取的深层感知特征进行聚类，可以获得更丰富的数据表示。本文提出了一种新的解决机器学习中数据不平衡问题的方法。该方法使用基于图像外观的深层感知嵌入和聚类计算样本的似然性，然后利用这些似然性在训练过程中对样本进行不同的加权，使用提出的\\textbf{广义聚焦损失}函数。该损失函数可以很容易地与深度学习算法集成。实验验证了该方法的有效性。",
    "tldr": "该论文提出了一种新的方法来解决机器学习中数据不平衡的问题，通过使用深层感知嵌入和聚类来计算样本的似然性，并使用广义聚焦损失函数在训练过程中对样本进行不同的加权。实验验证了该方法的有效性。",
    "en_tdlr": "This paper presents a novel method for addressing data imbalance in machine learning by calculating sample likelihoods using deep perceptual embeddings and clustering, and weighing samples differently during training with a proposed Generalized Focal Loss function. Experiments validate the method's effectiveness."
}