{
    "title": "Parametric entropy based Cluster Centriod Initialization for k-means clustering of various Image datasets. (arXiv:2308.07705v1 [cs.IT])",
    "abstract": "One of the most employed yet simple algorithm for cluster analysis is the k-means algorithm. k-means has successfully witnessed its use in artificial intelligence, market segmentation, fraud detection, data mining, psychology, etc., only to name a few. The k-means algorithm, however, does not always yield the best quality results. Its performance heavily depends upon the number of clusters supplied and the proper initialization of the cluster centroids or seeds. In this paper, we conduct an analysis of the performance of k-means on image data by employing parametric entropies in an entropy based centroid initialization method and propose the best fitting entropy measures for general image datasets. We use several entropies like Taneja entropy, Kapur entropy, Aczel Daroczy entropy, Sharma Mittal entropy. We observe that for different datasets, different entropies provide better results than the conventional methods. We have applied our proposed algorithm on these datasets: Satellite, To",
    "link": "http://arxiv.org/abs/2308.07705",
    "context": "Title: Parametric entropy based Cluster Centriod Initialization for k-means clustering of various Image datasets. (arXiv:2308.07705v1 [cs.IT])\nAbstract: One of the most employed yet simple algorithm for cluster analysis is the k-means algorithm. k-means has successfully witnessed its use in artificial intelligence, market segmentation, fraud detection, data mining, psychology, etc., only to name a few. The k-means algorithm, however, does not always yield the best quality results. Its performance heavily depends upon the number of clusters supplied and the proper initialization of the cluster centroids or seeds. In this paper, we conduct an analysis of the performance of k-means on image data by employing parametric entropies in an entropy based centroid initialization method and propose the best fitting entropy measures for general image datasets. We use several entropies like Taneja entropy, Kapur entropy, Aczel Daroczy entropy, Sharma Mittal entropy. We observe that for different datasets, different entropies provide better results than the conventional methods. We have applied our proposed algorithm on these datasets: Satellite, To",
    "path": "papers/23/08/2308.07705.json",
    "total_tokens": 859,
    "translated_title": "基于参数熵的k-means聚类中心初始化方法在不同图像数据集上的应用",
    "translated_abstract": "k-means算法是一种被广泛应用且简单的聚类分析算法。它在人工智能、市场细分、欺诈检测、数据挖掘、心理学等领域取得了成功的应用。然而，k-means算法并不总是能产生最优质的结果。它的性能严重依赖于提供的聚类数和合适的聚类中心或种子的初始化方法。本文通过使用参数熵进行熵-based聚类中心初始化方法，并提出了适用于一般图像数据集的最佳匹配熵度量，对k-means在图像数据上的性能进行了分析。我们使用了多种熵度量，如Taneja熵、Kapur熵、Aczel Daroczy熵、Sharma Mittal熵。观察到对于不同的数据集，不同的熵度量比传统方法提供了更好的结果。我们在以下数据集上应用了我们提出的算法：Satellite...",
    "tldr": "本文提出了一种基于参数熵的k-means聚类中心初始化方法，在图像数据集上进行了分析，并得出了适用于不同数据集的最佳熵度量。",
    "en_tdlr": "This paper proposes a parametric entropy-based method for initializing cluster centroids in k-means clustering and analyzes its performance on image datasets, identifying the best entropy measures for different datasets."
}