{
    "title": "A One-dimensional HEVC video steganalysis method using the Optimality of Predicted Motion Vectors. (arXiv:2308.06464v1 [cs.CR])",
    "abstract": "Among steganalysis techniques, detection against motion vector (MV) domain-based video steganography in High Efficiency Video Coding (HEVC) standard remains a hot and challenging issue. For the purpose of improving the detection performance, this paper proposes a steganalysis feature based on the optimality of predicted MVs with a dimension of one. Firstly, we point out that the motion vector prediction (MVP) of the prediction unit (PU) encoded using the Advanced Motion Vector Prediction (AMVP) technique satisfies the local optimality in the cover video. Secondly, we analyze that in HEVC video, message embedding either using MVP index or motion vector differences (MVD) may destroy the above optimality of MVP. And then, we define the optimal rate of MVP in HEVC video as a steganalysis feature. Finally, we conduct steganalysis detection experiments on two general datasets for three popular steganography methods and compare the performance with four state-of-the-art steganalysis methods. ",
    "link": "http://arxiv.org/abs/2308.06464",
    "context": "Title: A One-dimensional HEVC video steganalysis method using the Optimality of Predicted Motion Vectors. (arXiv:2308.06464v1 [cs.CR])\nAbstract: Among steganalysis techniques, detection against motion vector (MV) domain-based video steganography in High Efficiency Video Coding (HEVC) standard remains a hot and challenging issue. For the purpose of improving the detection performance, this paper proposes a steganalysis feature based on the optimality of predicted MVs with a dimension of one. Firstly, we point out that the motion vector prediction (MVP) of the prediction unit (PU) encoded using the Advanced Motion Vector Prediction (AMVP) technique satisfies the local optimality in the cover video. Secondly, we analyze that in HEVC video, message embedding either using MVP index or motion vector differences (MVD) may destroy the above optimality of MVP. And then, we define the optimal rate of MVP in HEVC video as a steganalysis feature. Finally, we conduct steganalysis detection experiments on two general datasets for three popular steganography methods and compare the performance with four state-of-the-art steganalysis methods. ",
    "path": "papers/23/08/2308.06464.json",
    "total_tokens": 905,
    "translated_title": "一种使用预测运动矢量最优性的一维HEVC视频隐写分析方法",
    "translated_abstract": "在隐写分析技术中，对基于运动矢量（MV）域的HEVC视频隐写术的检测仍然是一个热门和具有挑战性的问题。为了提高检测性能，本文提出了一种基于一维预测MV最优性的隐写分析特征。首先，我们指出使用高级运动矢量预测（AMVP）技术编码的预测单元（PU）的运动矢量预测（MVP）满足封面视频中的局部最优性。其次，我们分析HEVC视频中使用MVP索引或运动矢量差（MVD）进行消息嵌入可能破坏上述MVP的最优性。然后，我们定义了HEVC视频中MVP的最优比特率作为一种隐写分析特征。最后，我们在两个常见数据集上对三种流行隐写方法进行了隐写分析检测实验，并与四种最先进的隐写分析方法进行了性能比较。",
    "tldr": "本文提出一种基于一维预测运动矢量最优性的HEVC视频隐写分析方法，通过分析和定义最优比特率作为隐写分析特征，提高了检测性能。",
    "en_tdlr": "This paper proposes a one-dimensional HEVC video steganalysis method based on the optimality of predicted motion vectors. By analyzing and defining the optimal rate as a steganalysis feature, it improves the detection performance."
}