{
    "title": "IMM: An Imitative Reinforcement Learning Approach with Predictive Representation Learning for Automatic Market Making. (arXiv:2308.08918v1 [cs.LG])",
    "abstract": "Market making (MM) has attracted significant attention in financial trading owing to its essential function in ensuring market liquidity. With strong capabilities in sequential decision-making, Reinforcement Learning (RL) technology has achieved remarkable success in quantitative trading. Nonetheless, most existing RL-based MM methods focus on optimizing single-price level strategies which fail at frequent order cancellations and loss of queue priority. Strategies involving multiple price levels align better with actual trading scenarios. However, given the complexity that multi-price level strategies involves a comprehensive trading action space, the challenge of effectively training profitable RL agents for MM persists. Inspired by the efficient workflow of professional human market makers, we propose Imitative Market Maker (IMM), a novel RL framework leveraging both knowledge from suboptimal signal-based experts and direct policy interactions to develop multi-price level MM strategi",
    "link": "http://arxiv.org/abs/2308.08918",
    "context": "Title: IMM: An Imitative Reinforcement Learning Approach with Predictive Representation Learning for Automatic Market Making. (arXiv:2308.08918v1 [cs.LG])\nAbstract: Market making (MM) has attracted significant attention in financial trading owing to its essential function in ensuring market liquidity. With strong capabilities in sequential decision-making, Reinforcement Learning (RL) technology has achieved remarkable success in quantitative trading. Nonetheless, most existing RL-based MM methods focus on optimizing single-price level strategies which fail at frequent order cancellations and loss of queue priority. Strategies involving multiple price levels align better with actual trading scenarios. However, given the complexity that multi-price level strategies involves a comprehensive trading action space, the challenge of effectively training profitable RL agents for MM persists. Inspired by the efficient workflow of professional human market makers, we propose Imitative Market Maker (IMM), a novel RL framework leveraging both knowledge from suboptimal signal-based experts and direct policy interactions to develop multi-price level MM strategi",
    "path": "papers/23/08/2308.08918.json",
    "total_tokens": 949,
    "translated_title": "基于预测表示学习的模仿增强学习方法在自动做市中的应用",
    "translated_abstract": "做市（MM）在金融交易中引起了广泛关注，因为它在确保市场流动性方面具有至关重要的功能。在顺序决策方面具有强大能力的强化学习（RL）技术在量化交易方面取得了显著的成功。然而，大多数现有的基于RL的MM方法都专注于优化单一价格水平策略，而对于频繁撤销订单和丢失队列优先级等问题无法解决。涉及多个价格水平的策略更符合实际交易场景。然而，由于多价格水平策略涉及到全面的交易行为空间的复杂性，有效训练盈利的RL代理人在MM方面仍然是一个挑战。受到专业做市商高效工作流程的启发，我们提出了一种新颖的RL框架，即模仿市场做市商（IMM），它利用子优信号专家的知识和直接策略交互的方式来开发多价格水平的MM策略。",
    "tldr": "本研究提出了一种基于预测表示学习的模仿增强学习方法，在自动做市中应用。该方法通过借鉴专业人类做市商的工作流程，结合子优信号专家的知识和直接策略交互，开发了适用于多价格水平的做市策略。",
    "en_tdlr": "This paper proposes an imitative reinforcement learning approach with predictive representation learning for automatic market making. It leverages knowledge from suboptimal signal-based experts and direct policy interactions to develop multi-price level market making strategies, inspired by the efficient workflow of professional human market makers."
}