{
    "title": "SYENet: A Simple Yet Effective Network for Multiple Low-Level Vision Tasks with Real-time Performance on Mobile Device. (arXiv:2308.08137v1 [cs.CV])",
    "abstract": "With the rapid development of AI hardware accelerators, applying deep learning-based algorithms to solve various low-level vision tasks on mobile devices has gradually become possible. However, two main problems still need to be solved: task-specific algorithms make it difficult to integrate them into a single neural network architecture, and large amounts of parameters make it difficult to achieve real-time inference. To tackle these problems, we propose a novel network, SYENet, with only $~$6K parameters, to handle multiple low-level vision tasks on mobile devices in a real-time manner. The SYENet consists of two asymmetrical branches with simple building blocks. To effectively connect the results by asymmetrical branches, a Quadratic Connection Unit(QCU) is proposed. Furthermore, to improve performance, a new Outlier-Aware Loss is proposed to process the image. The proposed method proves its superior performance with the best PSNR as compared with other networks in real-time applica",
    "link": "http://arxiv.org/abs/2308.08137",
    "context": "Title: SYENet: A Simple Yet Effective Network for Multiple Low-Level Vision Tasks with Real-time Performance on Mobile Device. (arXiv:2308.08137v1 [cs.CV])\nAbstract: With the rapid development of AI hardware accelerators, applying deep learning-based algorithms to solve various low-level vision tasks on mobile devices has gradually become possible. However, two main problems still need to be solved: task-specific algorithms make it difficult to integrate them into a single neural network architecture, and large amounts of parameters make it difficult to achieve real-time inference. To tackle these problems, we propose a novel network, SYENet, with only $~$6K parameters, to handle multiple low-level vision tasks on mobile devices in a real-time manner. The SYENet consists of two asymmetrical branches with simple building blocks. To effectively connect the results by asymmetrical branches, a Quadratic Connection Unit(QCU) is proposed. Furthermore, to improve performance, a new Outlier-Aware Loss is proposed to process the image. The proposed method proves its superior performance with the best PSNR as compared with other networks in real-time applica",
    "path": "papers/23/08/2308.08137.json",
    "total_tokens": 955,
    "translated_title": "SYENet：一种在移动设备上具有实时性能的简单而有效的多低级视觉任务网络",
    "translated_abstract": "随着AI硬件加速器的快速发展，将基于深度学习的算法应用于移动设备上解决各种低级视觉任务逐渐成为可能。然而，仍然需要解决两个主要问题：任务特定的算法使它们难以集成到单个神经网络架构中，大量的参数使得实时推理变得困难。为了解决这些问题，我们提出了一种新的网络SYENet，只有大约6K个参数，以实时方式处理移动设备上的多个低级视觉任务。SYENet由两个不对称分支和简单的构建模块组成。为了有效地连接不对称分支的结果，提出了一种二次连接单元（QCU）。此外，为了提高性能，提出了一种新的异常值感知损失来处理图像。所提出的方法通过与实时应用中的其他网络相比具有最佳PSNR来证明其优越性能。",
    "tldr": "SYENet是一种简单而有效的网络，用于在移动设备上进行多个低级视觉任务的实时处理。该网络具有较少的参数量，并通过特定的构建模块和二次连接单元实现了不对称分支结果的有效连接。通过引入异常值感知损失来提高性能，并在实时应用中表现出优秀的PSNR性能。",
    "en_tdlr": "SYENet is a simple yet effective network for real-time processing of multiple low-level vision tasks on mobile devices. It has a small number of parameters and effectively connects the results of asymmetrical branches through specific building blocks and quadratic connection unit. It improves performance by introducing an outlier-aware loss and demonstrates superior PSNR performance in real-time applications."
}