{
    "title": "Hyperbolic Convolutional Neural Networks. (arXiv:2308.15639v1 [cs.LG])",
    "abstract": "Deep Learning is mostly responsible for the surge of interest in Artificial Intelligence in the last decade. So far, deep learning researchers have been particularly successful in the domain of image processing, where Convolutional Neural Networks are used. Although excelling at image classification, Convolutional Neural Networks are quite naive in that no inductive bias is set on the embedding space for images. Similar flaws are also exhibited by another type of Convolutional Networks - Graph Convolutional Neural Networks. However, using non-Euclidean space for embedding data might result in more robust and explainable models. One example of such a non-Euclidean space is hyperbolic space. Hyperbolic spaces are particularly useful due to their ability to fit more data in a low-dimensional space and tree-likeliness properties. These attractive properties have been previously used in multiple papers which indicated that they are beneficial for building hierarchical embeddings using shall",
    "link": "http://arxiv.org/abs/2308.15639",
    "context": "Title: Hyperbolic Convolutional Neural Networks. (arXiv:2308.15639v1 [cs.LG])\nAbstract: Deep Learning is mostly responsible for the surge of interest in Artificial Intelligence in the last decade. So far, deep learning researchers have been particularly successful in the domain of image processing, where Convolutional Neural Networks are used. Although excelling at image classification, Convolutional Neural Networks are quite naive in that no inductive bias is set on the embedding space for images. Similar flaws are also exhibited by another type of Convolutional Networks - Graph Convolutional Neural Networks. However, using non-Euclidean space for embedding data might result in more robust and explainable models. One example of such a non-Euclidean space is hyperbolic space. Hyperbolic spaces are particularly useful due to their ability to fit more data in a low-dimensional space and tree-likeliness properties. These attractive properties have been previously used in multiple papers which indicated that they are beneficial for building hierarchical embeddings using shall",
    "path": "papers/23/08/2308.15639.json",
    "total_tokens": 865,
    "translated_title": "双曲卷积神经网络",
    "translated_abstract": "在过去的十年里，深度学习主要推动了人工智能领域的兴趣。迄今为止，深度学习研究人员在图像处理领域取得了显著的成功，其中使用了卷积神经网络。尽管在图像分类方面表现出色，但卷积神经网络在图像嵌入空间上没有设定归纳偏置，可以说相当幼稚。另一种类型的卷积网络 - 图卷积神经网络也存在类似的缺陷。然而，使用非欧几里德空间来嵌入数据可能会产生更强大和可解释的模型。非欧几里德空间中的一个例子就是双曲空间。由于能够将更多的数据适应于低维空间并具有树状特性，双曲空间尤其有用。先前的多篇论文已经表明，这些吸引人的特性有助于使用浅层嵌入来构建层次化嵌入。",
    "tldr": "双曲卷积神经网络利用双曲空间进行数据嵌入，具有更强大和可解释的模型特性。浅层嵌入构建了层次化嵌入。",
    "en_tdlr": "Hyperbolic Convolutional Neural Networks utilize hyperbolic space for data embedding, resulting in more powerful and interpretable models. Shallow embedding enables hierarchical embeddings."
}