{
    "title": "May the Force be with You: Unified Force-Centric Pre-Training for 3D Molecular Conformations. (arXiv:2308.14759v1 [physics.chem-ph])",
    "abstract": "Recent works have shown the promise of learning pre-trained models for 3D molecular representation. However, existing pre-training models focus predominantly on equilibrium data and largely overlook off-equilibrium conformations. It is challenging to extend these methods to off-equilibrium data because their training objective relies on assumptions of conformations being the local energy minima. We address this gap by proposing a force-centric pretraining model for 3D molecular conformations covering both equilibrium and off-equilibrium data. For off-equilibrium data, our model learns directly from their atomic forces. For equilibrium data, we introduce zero-force regularization and forced-based denoising techniques to approximate near-equilibrium forces. We obtain a unified pre-trained model for 3D molecular representation with over 15 million diverse conformations. Experiments show that, with our pre-training objective, we increase forces accuracy by around 3 times compared to the un",
    "link": "http://arxiv.org/abs/2308.14759",
    "context": "Title: May the Force be with You: Unified Force-Centric Pre-Training for 3D Molecular Conformations. (arXiv:2308.14759v1 [physics.chem-ph])\nAbstract: Recent works have shown the promise of learning pre-trained models for 3D molecular representation. However, existing pre-training models focus predominantly on equilibrium data and largely overlook off-equilibrium conformations. It is challenging to extend these methods to off-equilibrium data because their training objective relies on assumptions of conformations being the local energy minima. We address this gap by proposing a force-centric pretraining model for 3D molecular conformations covering both equilibrium and off-equilibrium data. For off-equilibrium data, our model learns directly from their atomic forces. For equilibrium data, we introduce zero-force regularization and forced-based denoising techniques to approximate near-equilibrium forces. We obtain a unified pre-trained model for 3D molecular representation with over 15 million diverse conformations. Experiments show that, with our pre-training objective, we increase forces accuracy by around 3 times compared to the un",
    "path": "papers/23/08/2308.14759.json",
    "total_tokens": 1033,
    "translated_title": "愿原力与你同在：统一的力导向预训练用于3D分子构型",
    "translated_abstract": "最近的研究显示了学习预训练模型在3D分子表示方面的潜力。然而，现有的预训练模型主要关注平衡数据，很大程度上忽视了非平衡构型。将这些方法扩展到非平衡数据是具有挑战性的，因为它们的训练目标依赖于构型是局部能量极小值的假设。我们通过提出一种力导向的预训练模型来填补这一差距，用于3D分子构型的平衡和非平衡数据。对于非平衡数据，我们的模型直接从原子力中学习。对于平衡数据，我们引入零力正则化和基于力的去噪技术来近似近平衡力。我们获得了一个具有超过1500万个多样的构型的统一预训练模型。实验表明，相比于未预训练的模型，在我们的预训练目标下，我们将力的准确性提高了大约3倍。",
    "tldr": "本论文提出了一种统一的力导向预训练模型用于3D分子构型，涵盖了平衡和非平衡数据。通过直接从原子力中学习非平衡数据和使用零力正则化和基于力的去噪技术近似近平衡力，我们获得了一个包含超过1500万个多样构型的预训练模型，相比于未预训练的模型，我们将力的准确性提高了大约3倍。",
    "en_tdlr": "This paper proposes a unified force-centric pre-training model for 3D molecular conformations, covering both equilibrium and off-equilibrium data. By learning directly from atomic forces for off-equilibrium data and approximating near-equilibrium forces using zero-force regularization and forced-based denoising techniques for equilibrium data, we achieve a pre-trained model with over 15 million diverse conformations. Experimental results show a 3-fold increase in force accuracy compared to non-pre-trained models."
}