{
    "title": "Spatial Gated Multi-Layer Perceptron for Land Use and Land Cover Mapping. (arXiv:2308.05235v1 [cs.CV])",
    "abstract": "Convolutional Neural Networks (CNNs) are models that are utilized extensively for the hierarchical extraction of features. Vision transformers (ViTs), through the use of a self-attention mechanism, have recently achieved superior modeling of global contextual information compared to CNNs. However, to realize their image classification strength, ViTs require substantial training datasets. Where the available training data are limited, current advanced multi-layer perceptrons (MLPs) can provide viable alternatives to both deep CNNs and ViTs. In this paper, we developed the SGU-MLP, a learning algorithm that effectively uses both MLPs and spatial gating units (SGUs) for precise land use land cover (LULC) mapping. Results illustrated the superiority of the developed SGU-MLP classification algorithm over several CNN and CNN-ViT-based models, including HybridSN, ResNet, iFormer, EfficientFormer and CoAtNet. The proposed SGU-MLP algorithm was tested through three experiments in Houston, USA, ",
    "link": "http://arxiv.org/abs/2308.05235",
    "context": "Title: Spatial Gated Multi-Layer Perceptron for Land Use and Land Cover Mapping. (arXiv:2308.05235v1 [cs.CV])\nAbstract: Convolutional Neural Networks (CNNs) are models that are utilized extensively for the hierarchical extraction of features. Vision transformers (ViTs), through the use of a self-attention mechanism, have recently achieved superior modeling of global contextual information compared to CNNs. However, to realize their image classification strength, ViTs require substantial training datasets. Where the available training data are limited, current advanced multi-layer perceptrons (MLPs) can provide viable alternatives to both deep CNNs and ViTs. In this paper, we developed the SGU-MLP, a learning algorithm that effectively uses both MLPs and spatial gating units (SGUs) for precise land use land cover (LULC) mapping. Results illustrated the superiority of the developed SGU-MLP classification algorithm over several CNN and CNN-ViT-based models, including HybridSN, ResNet, iFormer, EfficientFormer and CoAtNet. The proposed SGU-MLP algorithm was tested through three experiments in Houston, USA, ",
    "path": "papers/23/08/2308.05235.json",
    "total_tokens": 954,
    "translated_title": "空间门控多层感知机用于土地利用和土地覆盖绘图",
    "translated_abstract": "卷积神经网络（CNN）被广泛应用于特征的分层提取。通过使用自注意机制，视觉变压器（ViTs）最近在全局背景信息建模方面取得了优于CNN的成果。然而，要发挥它们在图像分类方面的优势，ViTs需要大量的训练数据。当可用的训练数据有限时，目前的先进多层感知机（MLPs）可以作为深度CNN和ViTs的可行替代方案。本文中，我们开发了SGU-MLP，这是一种有效利用MLPs和空间门控单元（SGUs）进行精确土地利用土地覆盖（LULC）绘图的学习算法。结果表明，所开发的SGU-MLP分类算法在多个基于CNN和CNN-ViT模型（包括HybridSN、ResNet、iFormer、EfficientFormer和CoAtNet）上优势明显。所提出的SGU-MLP算法通过在美国休斯顿进行的三个实验中进行了测试。",
    "tldr": "本文提出了一种称为SGU-MLP的学习算法，它利用MLPs和空间门控单元（SGUs）来精确地进行土地利用和土地覆盖绘图。实验结果显示，SGU-MLP算法在多个基于CNN和CNN-ViT模型上具有明显的优势。",
    "en_tdlr": "This paper proposes a learning algorithm called SGU-MLP that effectively utilizes MLPs and spatial gating units (SGUs) for precise land use and land cover mapping. Experimental results demonstrate the superiority of the SGU-MLP algorithm over multiple CNN and CNN-ViT-based models."
}