{
    "title": "Source-Free Collaborative Domain Adaptation via Multi-Perspective Feature Enrichment for Functional MRI Analysis. (arXiv:2308.12495v1 [cs.CV])",
    "abstract": "Resting-state functional MRI (rs-fMRI) is increasingly employed in multi-site research to aid neurological disorder analysis. Existing studies usually suffer from significant cross-site/domain data heterogeneity caused by site effects such as differences in scanners/protocols. Many methods have been proposed to reduce fMRI heterogeneity between source and target domains, heavily relying on the availability of source data. But acquiring source data is challenging due to privacy concerns and/or data storage burdens in multi-site studies. To this end, we design a source-free collaborative domain adaptation (SCDA) framework for fMRI analysis, where only a pretrained source model and unlabeled target data are accessible. Specifically, a multi-perspective feature enrichment method (MFE) is developed for target fMRI analysis, consisting of multiple collaborative branches to dynamically capture fMRI features of unlabeled target data from multiple views. Each branch has a data-feeding module, a",
    "link": "http://arxiv.org/abs/2308.12495",
    "context": "Title: Source-Free Collaborative Domain Adaptation via Multi-Perspective Feature Enrichment for Functional MRI Analysis. (arXiv:2308.12495v1 [cs.CV])\nAbstract: Resting-state functional MRI (rs-fMRI) is increasingly employed in multi-site research to aid neurological disorder analysis. Existing studies usually suffer from significant cross-site/domain data heterogeneity caused by site effects such as differences in scanners/protocols. Many methods have been proposed to reduce fMRI heterogeneity between source and target domains, heavily relying on the availability of source data. But acquiring source data is challenging due to privacy concerns and/or data storage burdens in multi-site studies. To this end, we design a source-free collaborative domain adaptation (SCDA) framework for fMRI analysis, where only a pretrained source model and unlabeled target data are accessible. Specifically, a multi-perspective feature enrichment method (MFE) is developed for target fMRI analysis, consisting of multiple collaborative branches to dynamically capture fMRI features of unlabeled target data from multiple views. Each branch has a data-feeding module, a",
    "path": "papers/23/08/2308.12495.json",
    "total_tokens": 984,
    "translated_title": "无源协作领域适应：多角度特征增强在功能磁共振成像分析中的应用",
    "translated_abstract": "静息态功能磁共振成像（rs-fMRI）在多地点研究中越来越常用于辅助神经学疾病分析。现有研究通常受到跨站点/领域数据异质性的影响，这是由于不同的扫描仪/协议导致的。许多方法已被提出以减少源域和目标域之间的fMRI异质性，但这往往需要源数据的可用性。然而，在多地点研究中由于隐私和/或数据存储负担的问题，获取源数据很具挑战性。为此，我们设计了一种无源协作领域适应（SCDA）框架用于fMRI分析，其中仅能访问预先训练的源模型和无标签的目标数据。具体地，我们开发了一种多角度特征增强方法（MFE）用于目标fMRI分析，由多个协作分支组成，动态地捕捉来自多个视角的无标签目标数据的fMRI特征。每个分支都具有一个数据进给模块，",
    "tldr": "通过无需源数据，使用多角度特征增强的方法提出了一种无源协作领域适应（SCDA）框架，用于静息态功能磁共振成像（rs-fMRI）分析。该方法能够减少不同扫描仪/协议导致的跨站点/领域数据异质性。",
    "en_tdlr": "A source-free collaborative domain adaptation (SCDA) framework is proposed for resting-state functional MRI (rs-fMRI) analysis, which utilizes multi-perspective feature enrichment to reduce cross-site/domain data heterogeneity caused by differences in scanners/protocols."
}