{
    "title": "Towards Automated Animal Density Estimation with Acoustic Spatial Capture-Recapture. (arXiv:2308.12859v1 [cs.SD])",
    "abstract": "Passive acoustic monitoring can be an effective way of monitoring wildlife populations that are acoustically active but difficult to survey visually. Digital recorders allow surveyors to gather large volumes of data at low cost, but identifying target species vocalisations in these data is non-trivial. Machine learning (ML) methods are often used to do the identification. They can process large volumes of data quickly, but they do not detect all vocalisations and they do generate some false positives (vocalisations that are not from the target species). Existing wildlife abundance survey methods have been designed specifically to deal with the first of these mistakes, but current methods of dealing with false positives are not well-developed. They do not take account of features of individual vocalisations, some of which are more likely to be false positives than others. We propose three methods for acoustic spatial capture-recapture inference that integrate individual-level measures o",
    "link": "http://arxiv.org/abs/2308.12859",
    "context": "Title: Towards Automated Animal Density Estimation with Acoustic Spatial Capture-Recapture. (arXiv:2308.12859v1 [cs.SD])\nAbstract: Passive acoustic monitoring can be an effective way of monitoring wildlife populations that are acoustically active but difficult to survey visually. Digital recorders allow surveyors to gather large volumes of data at low cost, but identifying target species vocalisations in these data is non-trivial. Machine learning (ML) methods are often used to do the identification. They can process large volumes of data quickly, but they do not detect all vocalisations and they do generate some false positives (vocalisations that are not from the target species). Existing wildlife abundance survey methods have been designed specifically to deal with the first of these mistakes, but current methods of dealing with false positives are not well-developed. They do not take account of features of individual vocalisations, some of which are more likely to be false positives than others. We propose three methods for acoustic spatial capture-recapture inference that integrate individual-level measures o",
    "path": "papers/23/08/2308.12859.json",
    "total_tokens": 810,
    "translated_title": "采用声学空间捕获-再捕获方法实现自动动物密度估计",
    "translated_abstract": "无声动物的被动声学监测是一种有效的监测方法，但难以进行视觉调查。数字录音仪可以以较低的成本收集大量的数据，但在这些数据中识别目标物种的声音是非常困难的。机器学习方法通常用于进行声音识别，它们可以快速处理大量的数据，但不能检测到所有的声音，并且会产生一些误报（不属于目标物种的声音）。现有的野生动物种群密度估计方法已经专门设计用于处理这些错误中的第一个，但目前处理误报的方法还不够成熟。它们并没有考虑到个体声音特征，其中一些特征更有可能是误报。我们提出了三种声学空间捕获-再捕获推断方法，将个体级测量特征综合进去。",
    "tldr": "本论文提出了一种声学空间捕获-再捕获方法，通过结合个体级别的测量特征，实现了自动动物密度估计。"
}