{
    "title": "The Five-Dollar Model: Generating Game Maps and Sprites from Sentence Embeddings. (arXiv:2308.04052v1 [cs.LG])",
    "abstract": "The five-dollar model is a lightweight text-to-image generative architecture that generates low dimensional images from an encoded text prompt. This model can successfully generate accurate and aesthetically pleasing content in low dimensional domains, with limited amounts of training data. Despite the small size of both the model and datasets, the generated images are still able to maintain the encoded semantic meaning of the textual prompt. We apply this model to three small datasets: pixel art video game maps, video game sprite images, and down-scaled emoji images and apply novel augmentation strategies to improve the performance of our model on these limited datasets. We evaluate our models performance using cosine similarity score between text-image pairs generated by the CLIP VIT-B/32 model.",
    "link": "http://arxiv.org/abs/2308.04052",
    "context": "Title: The Five-Dollar Model: Generating Game Maps and Sprites from Sentence Embeddings. (arXiv:2308.04052v1 [cs.LG])\nAbstract: The five-dollar model is a lightweight text-to-image generative architecture that generates low dimensional images from an encoded text prompt. This model can successfully generate accurate and aesthetically pleasing content in low dimensional domains, with limited amounts of training data. Despite the small size of both the model and datasets, the generated images are still able to maintain the encoded semantic meaning of the textual prompt. We apply this model to three small datasets: pixel art video game maps, video game sprite images, and down-scaled emoji images and apply novel augmentation strategies to improve the performance of our model on these limited datasets. We evaluate our models performance using cosine similarity score between text-image pairs generated by the CLIP VIT-B/32 model.",
    "path": "papers/23/08/2308.04052.json",
    "total_tokens": 767,
    "translated_title": "五美元模型：从句子嵌入生成游戏地图和精灵角色",
    "translated_abstract": "五美元模型是一种轻量级的文本到图像生成架构，可以从编码的文本提示中生成低维度的图片。这个模型可以在低维度领域中成功生成准确且美观的内容，即使只有有限的训练数据。尽管模型和数据集都很小，但生成的图片仍然能够保持文本提示的语义含义。我们将这个模型应用于三个小型数据集：像素艺术的游戏地图、游戏角色精灵图像和缩小的表情符号图像，并应用了新颖的扩充策略来提高模型在这些有限数据集上的性能。我们使用CLIP VIT-B/32模型生成的文本-图像对之间的余弦相似度评估了我们模型的性能。",
    "tldr": "五美元模型是一种轻量级的文本到图像生成架构，可以从编码的文本提示中生成低维度的图片，并在有限数据集上保持语义含义。",
    "en_tdlr": "The Five-Dollar Model is a lightweight text-to-image generative architecture that generates low-dimensional images from encoded text prompts, while maintaining semantic meaning on limited datasets."
}