{
    "title": "Varying-coefficients for regional quantile via KNN-based LASSO with applications to health outcome study. (arXiv:2308.04212v1 [stat.ML])",
    "abstract": "Health outcomes, such as body mass index and cholesterol levels, are known to be dependent on age and exhibit varying effects with their associated risk factors. In this paper, we propose a novel framework for dynamic modeling of the associations between health outcomes and risk factors using varying-coefficients (VC) regional quantile regression via K-nearest neighbors (KNN) fused Lasso, which captures the time-varying effects of age. The proposed method has strong theoretical properties, including a tight estimation error bound and the ability to detect exact clustered patterns under certain regularity conditions. To efficiently solve the resulting optimization problem, we develop an alternating direction method of multipliers (ADMM) algorithm. Our empirical results demonstrate the efficacy of the proposed method in capturing the complex age-dependent associations between health outcomes and their risk factors.",
    "link": "http://arxiv.org/abs/2308.04212",
    "context": "Title: Varying-coefficients for regional quantile via KNN-based LASSO with applications to health outcome study. (arXiv:2308.04212v1 [stat.ML])\nAbstract: Health outcomes, such as body mass index and cholesterol levels, are known to be dependent on age and exhibit varying effects with their associated risk factors. In this paper, we propose a novel framework for dynamic modeling of the associations between health outcomes and risk factors using varying-coefficients (VC) regional quantile regression via K-nearest neighbors (KNN) fused Lasso, which captures the time-varying effects of age. The proposed method has strong theoretical properties, including a tight estimation error bound and the ability to detect exact clustered patterns under certain regularity conditions. To efficiently solve the resulting optimization problem, we develop an alternating direction method of multipliers (ADMM) algorithm. Our empirical results demonstrate the efficacy of the proposed method in capturing the complex age-dependent associations between health outcomes and their risk factors.",
    "path": "papers/23/08/2308.04212.json",
    "total_tokens": 849,
    "translated_title": "基于KNN-基于LASSO的区域分位数变系数模型在健康结果研究中的应用",
    "translated_abstract": "健康结果，如身体质量指数和胆固醇水平，已知依赖于年龄，并表现出与其相关危险因素的变化影响。本文提出了一种新颖的框架，通过K最近邻(Lasso)基于区域分位数回归来动态建模健康结果和危险因素之间的关联，以捕捉年龄的时变效应。所提出的方法具有强大的理论性质，包括紧密的估计误差界限和在某些正则条件下检测精确的聚类模式的能力。为了高效解决所得到的优化问题，我们开发了一种交替方向乘法器(ADMM)算法。我们的实证结果表明，所提出的方法能够捕捉健康结果和其风险因素之间复杂的年龄相关关联。",
    "tldr": "本文提出了一种基于KNN-基于LASSO的方法，在健康结果研究中建立了动态模型，能够准确捕捉健康结果和危险因素之间的年龄相关关联。",
    "en_tdlr": "This paper proposes a novel framework based on KNN-based LASSO for dynamic modeling of health outcomes, capturing the age-dependent associations between health outcomes and risk factors accurately."
}