{
    "title": "Deep Reinforcement Learning-driven Cross-Community Energy Interaction Optimal Scheduling. (arXiv:2308.12554v1 [eess.SY])",
    "abstract": "In order to coordinate energy interactions among various communities and energy conversions among multi-energy subsystems within the multi-community integrated energy system under uncertain conditions, and achieve overall optimization and scheduling of the comprehensive energy system, this paper proposes a comprehensive scheduling model that utilizes a multi-agent deep reinforcement learning algorithm to learn load characteristics of different communities and make decisions based on this knowledge. In this model, the scheduling problem of the integrated energy system is transformed into a Markov decision process and solved using a data-driven deep reinforcement learning algorithm, which avoids the need for modeling complex energy coupling relationships between multi-communities and multi-energy subsystems. The simulation results show that the proposed method effectively captures the load characteristics of different communities and utilizes their complementary features to coordinate re",
    "link": "http://arxiv.org/abs/2308.12554",
    "context": "Title: Deep Reinforcement Learning-driven Cross-Community Energy Interaction Optimal Scheduling. (arXiv:2308.12554v1 [eess.SY])\nAbstract: In order to coordinate energy interactions among various communities and energy conversions among multi-energy subsystems within the multi-community integrated energy system under uncertain conditions, and achieve overall optimization and scheduling of the comprehensive energy system, this paper proposes a comprehensive scheduling model that utilizes a multi-agent deep reinforcement learning algorithm to learn load characteristics of different communities and make decisions based on this knowledge. In this model, the scheduling problem of the integrated energy system is transformed into a Markov decision process and solved using a data-driven deep reinforcement learning algorithm, which avoids the need for modeling complex energy coupling relationships between multi-communities and multi-energy subsystems. The simulation results show that the proposed method effectively captures the load characteristics of different communities and utilizes their complementary features to coordinate re",
    "path": "papers/23/08/2308.12554.json",
    "total_tokens": 817,
    "translated_title": "基于深度强化学习的跨社区能量交互优化调度",
    "translated_abstract": "为了在不确定的条件下协调各个社区之间的能量交互和多能源子系统之间的能量转换，并实现综合能量系统的整体优化和调度，本文提出了一种综合调度模型，利用多智能体深度强化学习算法学习不同社区的负载特性，并基于该知识做出决策。在该模型中，综合能量系统的调度问题被转化为马尔科夫决策过程，并使用数据驱动的深度强化学习算法解决，从而避免了对多社区和多能源子系统之间复杂能量耦合关系的建模需求。模拟结果表明，所提出的方法能够有效捕捉不同社区的负载特性，并利用其互补特性进行协调。",
    "tldr": "本文提出了一种基于深度强化学习的跨社区能量交互优化调度模型，通过学习不同社区的负载特性，并基于该知识做出决策，实现综合能量系统的整体优化和调度。",
    "en_tdlr": "This paper proposes a comprehensive scheduling model for cross-community energy interaction optimization using deep reinforcement learning, which learns the load characteristics of different communities and makes decisions based on this knowledge to achieve overall optimization and scheduling of the comprehensive energy system."
}