{
    "title": "Differentiable short-time Fourier transform with respect to the hop length. (arXiv:2308.02421v1 [eess.SP])",
    "abstract": "In this paper, we propose a differentiable version of the short-time Fourier transform (STFT) that allows for gradient-based optimization of the hop length or the frame temporal position by making these parameters continuous. Our approach provides improved control over the temporal positioning of frames, as the continuous nature of the hop length allows for a more finely-tuned optimization. Furthermore, our contribution enables the use of optimization methods such as gradient descent, which are more computationally efficient than conventional discrete optimization methods. Our differentiable STFT can also be easily integrated into existing algorithms and neural networks. We present a simulated illustration to demonstrate the efficacy of our approach and to garner interest from the research community.",
    "link": "http://arxiv.org/abs/2308.02421",
    "context": "Title: Differentiable short-time Fourier transform with respect to the hop length. (arXiv:2308.02421v1 [eess.SP])\nAbstract: In this paper, we propose a differentiable version of the short-time Fourier transform (STFT) that allows for gradient-based optimization of the hop length or the frame temporal position by making these parameters continuous. Our approach provides improved control over the temporal positioning of frames, as the continuous nature of the hop length allows for a more finely-tuned optimization. Furthermore, our contribution enables the use of optimization methods such as gradient descent, which are more computationally efficient than conventional discrete optimization methods. Our differentiable STFT can also be easily integrated into existing algorithms and neural networks. We present a simulated illustration to demonstrate the efficacy of our approach and to garner interest from the research community.",
    "path": "papers/23/08/2308.02421.json",
    "total_tokens": 790,
    "translated_title": "基于跳步长度可微分的短时傅里叶变换",
    "translated_abstract": "在本文中，我们提出了一种基于跳步长度可微分的短时傅里叶变换（STFT），通过使这些参数连续，使跳步长度或帧时间位置可以基于梯度进行优化。我们的方法提供了对帧的时间定位更好的控制，因为跳步长度的连续性允许进行更精细的优化。此外，我们的贡献还可以使用诸如梯度下降之类的优化方法，这些方法比传统的离散优化方法更加高效。我们的可微分STFT也可以轻松集成到现有的算法和神经网络中。我们展示了一个模拟实例，以展示我们方法的有效性，并引起研究界的兴趣。",
    "tldr": "本文提出了一种基于跳步长度可微分的短时傅里叶变换，通过使跳步长度连续，实现了梯度优化的时间定位控制，提供了更好的优化效果和更高的计算效率。该方法可以轻松集成到现有算法和神经网络中。",
    "en_tdlr": "This paper presents a differentiable version of the short-time Fourier transform (STFT) that allows for gradient-based optimization of the hop length, enabling improved temporal positioning and computational efficiency. It can be easily integrated into existing algorithms and neural networks."
}