{
    "title": "Ske2Grid: Skeleton-to-Grid Representation Learning for Action Recognition. (arXiv:2308.07571v1 [cs.CV])",
    "abstract": "This paper presents Ske2Grid, a new representation learning framework for improved skeleton-based action recognition. In Ske2Grid, we define a regular convolution operation upon a novel grid representation of human skeleton, which is a compact image-like grid patch constructed and learned through three novel designs. Specifically, we propose a graph-node index transform (GIT) to construct a regular grid patch through assigning the nodes in the skeleton graph one by one to the desired grid cells. To ensure that GIT is a bijection and enrich the expressiveness of the grid representation, an up-sampling transform (UPT) is learned to interpolate the skeleton graph nodes for filling the grid patch to the full. To resolve the problem when the one-step UPT is aggressive and further exploit the representation capability of the grid patch with increasing spatial size, a progressive learning strategy (PLS) is proposed which decouples the UPT into multiple steps and aligns them to multiple paired",
    "link": "http://arxiv.org/abs/2308.07571",
    "context": "Title: Ske2Grid: Skeleton-to-Grid Representation Learning for Action Recognition. (arXiv:2308.07571v1 [cs.CV])\nAbstract: This paper presents Ske2Grid, a new representation learning framework for improved skeleton-based action recognition. In Ske2Grid, we define a regular convolution operation upon a novel grid representation of human skeleton, which is a compact image-like grid patch constructed and learned through three novel designs. Specifically, we propose a graph-node index transform (GIT) to construct a regular grid patch through assigning the nodes in the skeleton graph one by one to the desired grid cells. To ensure that GIT is a bijection and enrich the expressiveness of the grid representation, an up-sampling transform (UPT) is learned to interpolate the skeleton graph nodes for filling the grid patch to the full. To resolve the problem when the one-step UPT is aggressive and further exploit the representation capability of the grid patch with increasing spatial size, a progressive learning strategy (PLS) is proposed which decouples the UPT into multiple steps and aligns them to multiple paired",
    "path": "papers/23/08/2308.07571.json",
    "total_tokens": 909,
    "translated_title": "Ske2Grid：骨架到网格表示学习的动作识别",
    "translated_abstract": "本文提出了Ske2Grid，一种用于改进基于骨架的动作识别的新型表示学习框架。在Ske2Grid中，我们定义了一个规则的卷积操作，用于人体骨架的一种新颖的网格表示，它是通过三个新颖设计构建和学习的紧凑的类似图像的网格图像块。具体来说，我们提出了一个图节点索引变换（GIT），通过一一将骨架图中的节点分配到所需的网格单元，构建一个规则的网格图像块。为了确保GIT是一个双射，并丰富网格表示的表达能力，我们学习了一个上采样变换（UPT），以插值填充网格图像块的骨架图节点，使其达到完整。为了解决当单步UPT过于激进时的问题，并进一步发掘随着空间尺寸增加的网格图像块的表示能力，我们提出了一种渐进学习策略（PLS），将UPT分解为多个步骤并将其与多个配对对齐。",
    "tldr": "Ske2Grid是一种用于改进基于骨架的动作识别的新型表示学习框架，通过定义规则卷积操作和新颖设计的网格表示，实现了更好的识别效果。",
    "en_tdlr": "Ske2Grid is a novel representation learning framework for improved skeleton-based action recognition. It defines a regular convolution operation and a compact grid representation, leading to better recognition performance."
}