{
    "title": "Falcon: Accelerating Homomorphically Encrypted Convolutions for Efficient Private Mobile Network Inference. (arXiv:2308.13189v1 [cs.CR])",
    "abstract": "Efficient networks, e.g., MobileNetV2, EfficientNet, etc, achieves state-of-the-art (SOTA) accuracy with lightweight computation. However, existing homomorphic encryption (HE)-based two-party computation (2PC) frameworks are not optimized for these networks and suffer from a high inference overhead. We observe the inefficiency mainly comes from the packing algorithm, which ignores the computation characteristics and the communication bottleneck of homomorphically encrypted depthwise convolutions. Therefore, in this paper, we propose Falcon, an effective dense packing algorithm for HE-based 2PC frameworks. Falcon features a zero-aware greedy packing algorithm and a communication-aware operator tiling strategy to improve the packing density for depthwise convolutions. Compared to SOTA HE-based 2PC frameworks, e.g., CrypTFlow2, Iron and Cheetah, Falcon achieves more than 15.6x, 5.1x and 1.8x latency reduction, respectively, at operator level. Meanwhile, at network level, Falcon allows for",
    "link": "http://arxiv.org/abs/2308.13189",
    "context": "Title: Falcon: Accelerating Homomorphically Encrypted Convolutions for Efficient Private Mobile Network Inference. (arXiv:2308.13189v1 [cs.CR])\nAbstract: Efficient networks, e.g., MobileNetV2, EfficientNet, etc, achieves state-of-the-art (SOTA) accuracy with lightweight computation. However, existing homomorphic encryption (HE)-based two-party computation (2PC) frameworks are not optimized for these networks and suffer from a high inference overhead. We observe the inefficiency mainly comes from the packing algorithm, which ignores the computation characteristics and the communication bottleneck of homomorphically encrypted depthwise convolutions. Therefore, in this paper, we propose Falcon, an effective dense packing algorithm for HE-based 2PC frameworks. Falcon features a zero-aware greedy packing algorithm and a communication-aware operator tiling strategy to improve the packing density for depthwise convolutions. Compared to SOTA HE-based 2PC frameworks, e.g., CrypTFlow2, Iron and Cheetah, Falcon achieves more than 15.6x, 5.1x and 1.8x latency reduction, respectively, at operator level. Meanwhile, at network level, Falcon allows for",
    "path": "papers/23/08/2308.13189.json",
    "total_tokens": 975,
    "translated_title": "Falcon: 加速基于同态加密的卷积以实现高效的私密移动网络推断",
    "translated_abstract": "高效网络，如MobileNetV2、EfficientNet等，在轻量级计算下实现了最先进的准确率。然而，现有的基于同态加密的两方计算框架对于这些网络并没有进行优化，并且在推断过程中存在高开销。我们观察到低效主要来自于打包算法，该算法忽略了计算特性和同态加密深度卷积的通信瓶颈。因此，在本文中，我们提出了Falcon，一种用于基于同态加密的两方计算框架的有效密集打包算法。Falcon采用了一种零感知的贪心打包算法和一种通信感知的操作器平铺策略，以提高深度卷积的打包密度。与SOTA的基于同态加密的两方计算框架（如CrypTFlow2、Iron和Cheetah）相比，Falcon在运算器级别分别实现了超过15.6倍、5.1倍和1.8倍的延迟降低。同时，在网络级别上，Falcon可以实现更高的加密推断速度。",
    "tldr": "Falcon是一种用于加速基于同态加密的卷积的密集打包算法，通过优化打包密度和降低通信开销，实现了在运算器级别上超过15.6倍的延迟降低，并且在网络级别上提供了更高的加密推断速度。",
    "en_tdlr": "Falcon is a dense packing algorithm for accelerating homomorphically encrypted convolutions. By optimizing the packing density and reducing communication overhead, it achieves a latency reduction of over 15.6x at the operator level and provides higher encrypted inference speed at the network level."
}