{
    "title": "Inverse Lithography Physics-informed Deep Neural Level Set for Mask Optimization. (arXiv:2308.12299v1 [eess.IV])",
    "abstract": "As the feature size of integrated circuits continues to decrease, optical proximity correction (OPC) has emerged as a crucial resolution enhancement technology for ensuring high printability in the lithography process. Recently, level set-based inverse lithography technology (ILT) has drawn considerable attention as a promising OPC solution, showcasing its powerful pattern fidelity, especially in advanced process. However, massive computational time consumption of ILT limits its applicability to mainly correcting partial layers and hotspot regions. Deep learning (DL) methods have shown great potential in accelerating ILT. However, lack of domain knowledge of inverse lithography limits the ability of DL-based algorithms in process window (PW) enhancement and etc. In this paper, we propose an inverse lithography physics-informed deep neural level set (ILDLS) approach for mask optimization. This approach utilizes level set based-ILT as a layer within the DL framework and iteratively condu",
    "link": "http://arxiv.org/abs/2308.12299",
    "context": "Title: Inverse Lithography Physics-informed Deep Neural Level Set for Mask Optimization. (arXiv:2308.12299v1 [eess.IV])\nAbstract: As the feature size of integrated circuits continues to decrease, optical proximity correction (OPC) has emerged as a crucial resolution enhancement technology for ensuring high printability in the lithography process. Recently, level set-based inverse lithography technology (ILT) has drawn considerable attention as a promising OPC solution, showcasing its powerful pattern fidelity, especially in advanced process. However, massive computational time consumption of ILT limits its applicability to mainly correcting partial layers and hotspot regions. Deep learning (DL) methods have shown great potential in accelerating ILT. However, lack of domain knowledge of inverse lithography limits the ability of DL-based algorithms in process window (PW) enhancement and etc. In this paper, we propose an inverse lithography physics-informed deep neural level set (ILDLS) approach for mask optimization. This approach utilizes level set based-ILT as a layer within the DL framework and iteratively condu",
    "path": "papers/23/08/2308.12299.json",
    "total_tokens": 888,
    "translated_title": "反向成像物理知识驱动的深度神经级集用于掩膜优化",
    "translated_abstract": "随着集成电路特征尺寸的不断减小，光学邻近修正（OPC）已成为保证光刻过程中高印刷性的关键分辨率增强技术。近年来，基于级集的反向成像技术（ILT）作为一种有前途的OPC解决方案，展示了其强大的图案保真度，特别是在先进工艺中。然而，ILT的巨大计算时间消耗限制了其主要用于修正部分层和热点区域。深度学习（DL）方法在加速ILT方面显示出巨大潜力。然而，缺乏反向成像领域知识限制了基于DL的算法在工艺窗口（PW）增强等方面的能力。本文提出了一种反向成像物理知识驱动的深度神经级集（ILDLS）方法来进行掩膜优化。该方法利用级集为DL框架中的一层，并在迭代中进行。",
    "tldr": "本文提出了一种反向成像物理知识驱动的深度神经级集（ILDLS）方法用于掩膜优化，并在迭代过程中利用级集为深度学习框架的一部分。"
}