{
    "title": "Bias in Unsupervised Anomaly Detection in Brain MRI. (arXiv:2308.13861v1 [eess.IV])",
    "abstract": "Unsupervised anomaly detection methods offer a promising and flexible alternative to supervised approaches, holding the potential to revolutionize medical scan analysis and enhance diagnostic performance.  In the current landscape, it is commonly assumed that differences between a test case and the training distribution are attributed solely to pathological conditions, implying that any disparity indicates an anomaly. However, the presence of other potential sources of distributional shift, including scanner, age, sex, or race, is frequently overlooked. These shifts can significantly impact the accuracy of the anomaly detection task. Prominent instances of such failures have sparked concerns regarding the bias, credibility, and fairness of anomaly detection.  This work presents a novel analysis of biases in unsupervised anomaly detection. By examining potential non-pathological distributional shifts between the training and testing distributions, we shed light on the extent of these bi",
    "link": "http://arxiv.org/abs/2308.13861",
    "context": "Title: Bias in Unsupervised Anomaly Detection in Brain MRI. (arXiv:2308.13861v1 [eess.IV])\nAbstract: Unsupervised anomaly detection methods offer a promising and flexible alternative to supervised approaches, holding the potential to revolutionize medical scan analysis and enhance diagnostic performance.  In the current landscape, it is commonly assumed that differences between a test case and the training distribution are attributed solely to pathological conditions, implying that any disparity indicates an anomaly. However, the presence of other potential sources of distributional shift, including scanner, age, sex, or race, is frequently overlooked. These shifts can significantly impact the accuracy of the anomaly detection task. Prominent instances of such failures have sparked concerns regarding the bias, credibility, and fairness of anomaly detection.  This work presents a novel analysis of biases in unsupervised anomaly detection. By examining potential non-pathological distributional shifts between the training and testing distributions, we shed light on the extent of these bi",
    "path": "papers/23/08/2308.13861.json",
    "total_tokens": 857,
    "translated_title": "无监督异常检测中的偏差问题在脑部MRI中的应用",
    "translated_abstract": "无监督异常检测方法为监督方法提供了一种有潜力的灵活替代方案，能够革新医学扫描分析，提高诊断性能。当前环境中，人们常常假设测试样本与训练分布之间的差异仅归因于病理条件，这意味着任何差异都被视为异常。然而，常常忽视了其他可能导致分布偏移的潜在因素，包括扫描仪、年龄、性别或种族。这些偏移会严重影响异常检测任务的准确性。一些突出的失败案例引发了对异常检测的偏见、可信度和公平性的担忧。本研究对无监督异常检测中的偏差进行了新颖的分析。通过检查训练和测试分布之间的可能的非病理性分布偏移，我们揭示了这些偏移的程度。",
    "tldr": "本论文针对无监督异常检测中的偏差问题进行了分析。通过研究训练与测试分布之间的非病理性偏移，揭示了这些偏移的程度。",
    "en_tdlr": "This paper provides a novel analysis of biases in unsupervised anomaly detection. By examining non-pathological distributional shifts between the training and testing distributions, it sheds light on the extent of these shifts."
}