{
    "title": "GraPhSyM: Graph Physical Synthesis Model. (arXiv:2308.03944v1 [cs.LG])",
    "abstract": "In this work, we introduce GraPhSyM, a Graph Attention Network (GATv2) model for fast and accurate estimation of post-physical synthesis circuit delay and area metrics from pre-physical synthesis circuit netlists. Once trained, GraPhSyM provides accurate visibility of final design metrics to early EDA stages, such as logic synthesis, without running the slow physical synthesis flow, enabling global co-optimization across stages. Additionally, the swift and precise feedback provided by GraPhSym is instrumental for machine-learning-based EDA optimization frameworks. Given a gate-level netlist of a circuit represented as a graph, GraPhSyM utilizes graph structure, connectivity, and electrical property features to predict the impact of physical synthesis transformations such as buffer insertion and gate sizing. When trained on a dataset of 6000 prefix adder designs synthesized at an aggressive delay target, GraPhSyM can accurately predict the post-synthesis delay (98.3%) and area (96.1%) m",
    "link": "http://arxiv.org/abs/2308.03944",
    "context": "Title: GraPhSyM: Graph Physical Synthesis Model. (arXiv:2308.03944v1 [cs.LG])\nAbstract: In this work, we introduce GraPhSyM, a Graph Attention Network (GATv2) model for fast and accurate estimation of post-physical synthesis circuit delay and area metrics from pre-physical synthesis circuit netlists. Once trained, GraPhSyM provides accurate visibility of final design metrics to early EDA stages, such as logic synthesis, without running the slow physical synthesis flow, enabling global co-optimization across stages. Additionally, the swift and precise feedback provided by GraPhSym is instrumental for machine-learning-based EDA optimization frameworks. Given a gate-level netlist of a circuit represented as a graph, GraPhSyM utilizes graph structure, connectivity, and electrical property features to predict the impact of physical synthesis transformations such as buffer insertion and gate sizing. When trained on a dataset of 6000 prefix adder designs synthesized at an aggressive delay target, GraPhSyM can accurately predict the post-synthesis delay (98.3%) and area (96.1%) m",
    "path": "papers/23/08/2308.03944.json",
    "total_tokens": 987,
    "translated_title": "GraPhSyM: 图形物理综合模型",
    "translated_abstract": "在这项工作中，我们介绍了GraPhSyM，一种用于从物理合成电路网表中快速准确地估计后物理合成电路延迟和面积指标的图形注意力网络（GATv2）模型。一旦训练完毕，GraPhSyM可以提供准确的设计指标可见性给早期的EDA阶段，如逻辑综合，而无需运行缓慢的物理合成流程，从而实现跨阶段的全局协同优化。此外，GraPhSym提供的快速而精确的反馈对基于机器学习的EDA优化框架至关重要。给定一个表示为图形的电路门级网表，GraPhSyM利用图形结构、连接性和电性特征来预测物理合成转换（如缓冲器插入和门尺寸调整）对电路的影响。当在一个包含6000个前缀加法器设计的数据集上训练（合成到激进延迟目标），GraPhSyM可以准确预测后合成的延迟（98.3%）和面积（96.1%）。",
    "tldr": "GraPhSyM是一种用于从物理合成电路网表中快速准确地估计后物理合成电路延迟和面积指标的模型，提供了准确的指标可见性给早期的EDA阶段，可用于全局协同优化，并对基于机器学习的EDA优化框架具有重要的作用。",
    "en_tdlr": "GraPhSyM is a model that accurately estimates post-physical synthesis circuit delay and area metrics from pre-physical synthesis circuit netlists. It provides accurate visibility of design metrics to early EDA stages, enables global co-optimization, and is instrumental for machine-learning-based EDA optimization frameworks."
}