{
    "title": "Enhancing Network Management Using Code Generated by Large Language Models. (arXiv:2308.06261v1 [cs.NI])",
    "abstract": "Analyzing network topologies and communication graphs plays a crucial role in contemporary network management. However, the absence of a cohesive approach leads to a challenging learning curve, heightened errors, and inefficiencies. In this paper, we introduce a novel approach to facilitate a natural-language-based network management experience, utilizing large language models (LLMs) to generate task-specific code from natural language queries. This method tackles the challenges of explainability, scalability, and privacy by allowing network operators to inspect the generated code, eliminating the need to share network data with LLMs, and concentrating on application-specific requests combined with general program synthesis techniques. We design and evaluate a prototype system using benchmark applications, showcasing high accuracy, cost-effectiveness, and the potential for further enhancements using complementary program synthesis techniques.",
    "link": "http://arxiv.org/abs/2308.06261",
    "context": "Title: Enhancing Network Management Using Code Generated by Large Language Models. (arXiv:2308.06261v1 [cs.NI])\nAbstract: Analyzing network topologies and communication graphs plays a crucial role in contemporary network management. However, the absence of a cohesive approach leads to a challenging learning curve, heightened errors, and inefficiencies. In this paper, we introduce a novel approach to facilitate a natural-language-based network management experience, utilizing large language models (LLMs) to generate task-specific code from natural language queries. This method tackles the challenges of explainability, scalability, and privacy by allowing network operators to inspect the generated code, eliminating the need to share network data with LLMs, and concentrating on application-specific requests combined with general program synthesis techniques. We design and evaluate a prototype system using benchmark applications, showcasing high accuracy, cost-effectiveness, and the potential for further enhancements using complementary program synthesis techniques.",
    "path": "papers/23/08/2308.06261.json",
    "total_tokens": 861,
    "translated_title": "使用大型语言模型生成的代码增强网络管理",
    "translated_abstract": "分析网络拓扑和通信图在当代网络管理中起着至关重要的作用。然而，缺乏一种一致的方法导致了学习曲线的挑战性增加、错误率的增加和效率的降低。在本文中，我们提出了一种新颖的方法，利用大型语言模型（LLMs）从自然语言查询中生成特定任务的代码，以方便自然语言网络管理体验。这种方法通过允许网络运营商检查生成的代码来解决了可解释性、可扩展性和隐私性方面的挑战，避免了与LLMs共享网络数据，并集中工作于应用程序特定请求与通用程序综合技术相结合。我们设计和评估了一个原型系统，使用基准应用程序展示了高准确性、成本效益以及使用互补程序综合技术进一步增强的潜力。",
    "tldr": "本论文介绍了一种利用大型语言模型生成代码的方法来增强网络管理，通过自然语言查询生成特定任务的代码，解决了可解释性、可扩展性和隐私性方面的挑战，并展示了高准确性、成本效益以及后续使用程序综合技术进一步增强的潜力。"
}