{
    "title": "LEMMA: Learning Language-Conditioned Multi-Robot Manipulation. (arXiv:2308.00937v1 [cs.RO])",
    "abstract": "Complex manipulation tasks often require robots with complementary capabilities to collaborate. We introduce a benchmark for LanguagE-Conditioned Multi-robot MAnipulation (LEMMA) focused on task allocation and long-horizon object manipulation based on human language instructions in a tabletop setting. LEMMA features 8 types of procedurally generated tasks with varying degree of complexity, some of which require the robots to use tools and pass tools to each other. For each task, we provide 800 expert demonstrations and human instructions for training and evaluations. LEMMA poses greater challenges compared to existing benchmarks, as it requires the system to identify each manipulator's limitations and assign sub-tasks accordingly while also handling strong temporal dependencies in each task. To address these challenges, we propose a modular hierarchical planning approach as a baseline. Our results highlight the potential of LEMMA for developing future language-conditioned multi-robot s",
    "link": "http://arxiv.org/abs/2308.00937",
    "context": "Title: LEMMA: Learning Language-Conditioned Multi-Robot Manipulation. (arXiv:2308.00937v1 [cs.RO])\nAbstract: Complex manipulation tasks often require robots with complementary capabilities to collaborate. We introduce a benchmark for LanguagE-Conditioned Multi-robot MAnipulation (LEMMA) focused on task allocation and long-horizon object manipulation based on human language instructions in a tabletop setting. LEMMA features 8 types of procedurally generated tasks with varying degree of complexity, some of which require the robots to use tools and pass tools to each other. For each task, we provide 800 expert demonstrations and human instructions for training and evaluations. LEMMA poses greater challenges compared to existing benchmarks, as it requires the system to identify each manipulator's limitations and assign sub-tasks accordingly while also handling strong temporal dependencies in each task. To address these challenges, we propose a modular hierarchical planning approach as a baseline. Our results highlight the potential of LEMMA for developing future language-conditioned multi-robot s",
    "path": "papers/23/08/2308.00937.json",
    "total_tokens": 897,
    "translated_title": "LEMMA: 学习语言条件下的多机器人操作",
    "translated_abstract": "复杂的操纵任务通常需要具有互补功能的机器人进行协作。我们引入了一种基于人类语言指令的桌面设置中任务分配和长时间跨度物体操作的LanguagE-Conditioned Multi-robot MAnipulation (LEMMA)基准。LEMMA具有8种类型的程序生成任务，具有不同的复杂度，其中一些任务要求机器人使用工具并相互传递工具。对于每个任务，我们提供800个专家示范和人类指令进行培训和评估。与现有基准相比，LEMMA提出了更大的挑战，因为它要求系统识别每个操纵器的限制，并相应地分配子任务，同时处理每个任务中的强时间依赖关系。为了解决这些挑战，我们提出了一种模块化分层规划方法作为基线。我们的结果突出了LEMMA在开发未来语言条件下的多机器人操作方面的潜力。",
    "tldr": "LEMMA是一个学习语言条件下的多机器人操作的基准，通过专家示范和人类指令进行任务分配和长时间跨度物体操作。它提供了涉及工具使用和传递的复杂操纵任务，并提出了一种模块化分层规划方法作为基线。"
}