{
    "title": "DeSCo: Towards Generalizable and Scalable Deep Subgraph Counting. (arXiv:2308.08198v1 [cs.LG])",
    "abstract": "Subgraph counting is the problem of counting the occurrences of a given query graph in a large target graph. Large-scale subgraph counting is useful in various domains, such as motif counting for social network analysis and loop counting for money laundering detection on transaction networks. Recently, to address the exponential runtime complexity of scalable subgraph counting, neural methods are proposed. However, existing neural counting approaches fall short in three aspects. Firstly, the counts of the same query can vary from zero to millions on different target graphs, posing a much larger challenge than most graph regression tasks. Secondly, current scalable graph neural networks have limited expressive power and fail to efficiently distinguish graphs in count prediction. Furthermore, existing neural approaches cannot predict the occurrence position of queries in the target graph.  Here we design DeSCo, a scalable neural deep subgraph counting pipeline, which aims to accurately p",
    "link": "http://arxiv.org/abs/2308.08198",
    "context": "Title: DeSCo: Towards Generalizable and Scalable Deep Subgraph Counting. (arXiv:2308.08198v1 [cs.LG])\nAbstract: Subgraph counting is the problem of counting the occurrences of a given query graph in a large target graph. Large-scale subgraph counting is useful in various domains, such as motif counting for social network analysis and loop counting for money laundering detection on transaction networks. Recently, to address the exponential runtime complexity of scalable subgraph counting, neural methods are proposed. However, existing neural counting approaches fall short in three aspects. Firstly, the counts of the same query can vary from zero to millions on different target graphs, posing a much larger challenge than most graph regression tasks. Secondly, current scalable graph neural networks have limited expressive power and fail to efficiently distinguish graphs in count prediction. Furthermore, existing neural approaches cannot predict the occurrence position of queries in the target graph.  Here we design DeSCo, a scalable neural deep subgraph counting pipeline, which aims to accurately p",
    "path": "papers/23/08/2308.08198.json",
    "total_tokens": 865,
    "translated_title": "DeSCo:面向通用且可扩展的深度子图计数方法",
    "translated_abstract": "子图计数是在大型目标图中计算给定查询图的出现次数的问题。大规模的子图计数在各个领域中都很有用，比如社交网络分析中的图案计数和交易网络上的反洗钱检测中的循环计数。最近，为了解决可扩展子图计数的指数级运行时间复杂度，提出了神经方法。然而，现有的神经计数方法在三个方面存在不足。首先，相同查询的计数在不同目标图上可以从零到数百万，比大多数图回归任务都要困难得多。其次，目前的可扩展图神经网络具有有限的表达能力，无法高效地区分计数预测中的图形。此外，现有的神经方法无法预测查询在目标图中的出现位置。在这里，我们设计了DeSCo，这是一个可扩展的神经深度子图计数流水线，旨在准确地预测子图的计数和出现位置。",
    "tldr": "DeSCo是一个通用且可扩展的深度子图计数方法，它解决了现有神经计数方法在计数准确性、图形区分和出现位置预测方面存在的问题。",
    "en_tdlr": "DeSCo is a generalizable and scalable deep subgraph counting method that addresses the limitations of existing neural counting methods in counting accuracy, graph discrimination, and occurrence position prediction."
}