{
    "title": "Choir Transformer: Generating Polyphonic Music with Relative Attention on Transformer. (arXiv:2308.02531v1 [eess.AS])",
    "abstract": "Polyphonic music generation is still a challenge direction due to its correct between generating melody and harmony. Most of the previous studies used RNN-based models. However, the RNN-based models are hard to establish the relationship between long-distance notes. In this paper, we propose a polyphonic music generation neural network named Choir Transformer[ https://github.com/Zjy0401/choir-transformer], with relative positional attention to better model the structure of music. We also proposed a music representation suitable for polyphonic music generation. The performance of Choir Transformer surpasses the previous state-of-the-art accuracy of 4.06%. We also measures the harmony metrics of polyphonic music. Experiments show that the harmony metrics are close to the music of Bach. In practical application, the generated melody and rhythm can be adjusted according to the specified input, with different styles of music like folk music or pop music and so on.",
    "link": "http://arxiv.org/abs/2308.02531",
    "context": "Title: Choir Transformer: Generating Polyphonic Music with Relative Attention on Transformer. (arXiv:2308.02531v1 [eess.AS])\nAbstract: Polyphonic music generation is still a challenge direction due to its correct between generating melody and harmony. Most of the previous studies used RNN-based models. However, the RNN-based models are hard to establish the relationship between long-distance notes. In this paper, we propose a polyphonic music generation neural network named Choir Transformer[ https://github.com/Zjy0401/choir-transformer], with relative positional attention to better model the structure of music. We also proposed a music representation suitable for polyphonic music generation. The performance of Choir Transformer surpasses the previous state-of-the-art accuracy of 4.06%. We also measures the harmony metrics of polyphonic music. Experiments show that the harmony metrics are close to the music of Bach. In practical application, the generated melody and rhythm can be adjusted according to the specified input, with different styles of music like folk music or pop music and so on.",
    "path": "papers/23/08/2308.02531.json",
    "total_tokens": 859,
    "translated_title": "Choir Transformer: 使用Transformer上的相对注意力生成多声部音乐",
    "translated_abstract": "由于旋律和和声之间的正确联系，多声部音乐生成仍然是一个具有挑战性的方向。大部分以前的研究都使用基于RNN的模型，然而，基于RNN的模型难以建立长距离音符之间的关系。在本文中，我们提出了一种名为Choir Transformer的多声部音乐生成神经网络，利用相对位置注意力来更好地建模音乐结构。我们还提出了适用于多声部音乐生成的音乐表示方法。Choir Transformer的性能超过了4.06%的前期最先进精度。我们还测量了多声部音乐的和声指标，实验表明和声指标接近巴赫的音乐。在实际应用中，生成的旋律和节奏可以根据指定的输入进行调整，具有不同风格的音乐，如民间音乐或流行音乐等。",
    "tldr": "本论文提出了一种名为Choir Transformer的神经网络模型，通过使用相对位置注意力来生成多声部音乐。实验结果表明，该模型在精度和和声指标方面都超过了之前的最先进方法。"
}