{
    "title": "Incorporating Nonlocal Traffic Flow Model in Physics-informed Neural Networks. (arXiv:2308.11818v1 [cs.LG])",
    "abstract": "This research contributes to the advancement of traffic state estimation methods by leveraging the benefits of the nonlocal LWR model within a physics-informed deep learning framework. The classical LWR model, while useful, falls short of accurately representing real-world traffic flows. The nonlocal LWR model addresses this limitation by considering the speed as a weighted mean of the downstream traffic density. In this paper, we propose a novel PIDL framework that incorporates the nonlocal LWR model. We introduce both fixed-length and variable-length kernels and develop the required mathematics. The proposed PIDL framework undergoes a comprehensive evaluation, including various convolutional kernels and look-ahead windows, using data from the NGSIM and CitySim datasets. The results demonstrate improvements over the baseline PIDL approach using the local LWR model. The findings highlight the potential of the proposed approach to enhance the accuracy and reliability of traffic state es",
    "link": "http://arxiv.org/abs/2308.11818",
    "context": "Title: Incorporating Nonlocal Traffic Flow Model in Physics-informed Neural Networks. (arXiv:2308.11818v1 [cs.LG])\nAbstract: This research contributes to the advancement of traffic state estimation methods by leveraging the benefits of the nonlocal LWR model within a physics-informed deep learning framework. The classical LWR model, while useful, falls short of accurately representing real-world traffic flows. The nonlocal LWR model addresses this limitation by considering the speed as a weighted mean of the downstream traffic density. In this paper, we propose a novel PIDL framework that incorporates the nonlocal LWR model. We introduce both fixed-length and variable-length kernels and develop the required mathematics. The proposed PIDL framework undergoes a comprehensive evaluation, including various convolutional kernels and look-ahead windows, using data from the NGSIM and CitySim datasets. The results demonstrate improvements over the baseline PIDL approach using the local LWR model. The findings highlight the potential of the proposed approach to enhance the accuracy and reliability of traffic state es",
    "path": "papers/23/08/2308.11818.json",
    "total_tokens": 841,
    "translated_title": "将非局部交通流模型引入物理信息感知神经网络",
    "translated_abstract": "本研究利用非局部LWR模型在物理信息感知深度学习框架中的优势，为交通状态估计方法的进展做出了贡献。经典的LWR模型在准确表示实际交通流方面存在局限。非局部LWR模型通过将速度视为下游交通密度的加权均值来克服这一限制。本文提出了一种新颖的PIDL框架，将非局部LWR模型纳入其中。我们引入了固定长度和可变长度的卷积核，并开发了所需的数学方法。通过使用NGSIM和CitySim数据集的数据，对所提出的PIDL框架进行了全面评估，包括各种卷积核和前瞻窗口。结果显示，相对于使用局部LWR模型的基线PIDL方法，所提出的方法取得了改进。研究结果突出了所提出方法提高交通状态估计准确性和可靠性的潜力。",
    "tldr": "本研究在物理信息感知深度学习框架中引入非局部交通流模型，以提高交通状态估计的准确性和可靠性。"
}