{
    "title": "Back to Basics: A Sanity Check on Modern Time Series Classification Algorithms. (arXiv:2308.07886v1 [cs.LG])",
    "abstract": "The state-of-the-art in time series classification has come a long way, from the 1NN-DTW algorithm to the ROCKET family of classifiers. However, in the current fast-paced development of new classifiers, taking a step back and performing simple baseline checks is essential. These checks are often overlooked, as researchers are focused on establishing new state-of-the-art results, developing scalable algorithms, and making models explainable. Nevertheless, there are many datasets that look like time series at first glance, but classic algorithms such as tabular methods with no time ordering may perform better on such problems. For example, for spectroscopy datasets, tabular methods tend to significantly outperform recent time series methods. In this study, we compare the performance of tabular models using classic machine learning approaches (e.g., Ridge, LDA, RandomForest) with the ROCKET family of classifiers (e.g., Rocket, MiniRocket, MultiRocket). Tabular models are simple and very e",
    "link": "http://arxiv.org/abs/2308.07886",
    "context": "Title: Back to Basics: A Sanity Check on Modern Time Series Classification Algorithms. (arXiv:2308.07886v1 [cs.LG])\nAbstract: The state-of-the-art in time series classification has come a long way, from the 1NN-DTW algorithm to the ROCKET family of classifiers. However, in the current fast-paced development of new classifiers, taking a step back and performing simple baseline checks is essential. These checks are often overlooked, as researchers are focused on establishing new state-of-the-art results, developing scalable algorithms, and making models explainable. Nevertheless, there are many datasets that look like time series at first glance, but classic algorithms such as tabular methods with no time ordering may perform better on such problems. For example, for spectroscopy datasets, tabular methods tend to significantly outperform recent time series methods. In this study, we compare the performance of tabular models using classic machine learning approaches (e.g., Ridge, LDA, RandomForest) with the ROCKET family of classifiers (e.g., Rocket, MiniRocket, MultiRocket). Tabular models are simple and very e",
    "path": "papers/23/08/2308.07886.json",
    "total_tokens": 830,
    "translated_title": "回归基础：对现代时间序列分类算法的合理检查",
    "translated_abstract": "时间序列分类的最新发展，从1NN-DTW算法到ROCKET分类器家族，已经取得了长足的进步。然而，在目前快速发展新分类器的过程中，退一步进行简单的基准检查是必要的。这些检查经常被忽视，因为研究人员专注于建立新的最先进结果，开发可扩展的算法，并使模型能够解释。然而，有许多数据集一开始看起来像是时间序列，但经典的无时间顺序的表格方法可能在这些问题上表现更好。例如，对于光谱数据集，表格方法往往能明显优于最近的时间序列方法。在本研究中，我们将经典的机器学习方法（例如Ridge、LDA、RandomForest）与ROCKET分类器家族（例如Rocket、MiniRocket、MultiRocket）的效果进行比较。表格模型简单且性能很好。",
    "tldr": "对现代时间序列分类算法的回归基础进行了合理检查，发现在某些问题上经典的无时间顺序的表格方法表现更好。",
    "en_tdlr": "A sanity check on modern time series classification algorithms reveals that classic tabular methods with no time ordering often outperform recent time series methods in certain cases."
}