{
    "title": "SpaDen : Sparse and Dense Keypoint Estimation for Real-World Chart Understanding. (arXiv:2308.01971v1 [cs.CV])",
    "abstract": "We introduce a novel bottom-up approach for the extraction of chart data. Our model utilizes images of charts as inputs and learns to detect keypoints (KP), which are used to reconstruct the components within the plot area. Our novelty lies in detecting a fusion of continuous and discrete KP as predicted heatmaps. A combination of sparse and dense per-pixel objectives coupled with a uni-modal self-attention-based feature-fusion layer is applied to learn KP embeddings. Further leveraging deep metric learning for unsupervised clustering, allows us to segment the chart plot area into various objects. By further matching the chart components to the legend, we are able to obtain the data series names. A post-processing threshold is applied to the KP embeddings to refine the object reconstructions and improve accuracy. Our extensive experiments include an evaluation of different modules for KP estimation and the combination of deep layer aggregation and corner pooling approaches. The results",
    "link": "http://arxiv.org/abs/2308.01971",
    "context": "Title: SpaDen : Sparse and Dense Keypoint Estimation for Real-World Chart Understanding. (arXiv:2308.01971v1 [cs.CV])\nAbstract: We introduce a novel bottom-up approach for the extraction of chart data. Our model utilizes images of charts as inputs and learns to detect keypoints (KP), which are used to reconstruct the components within the plot area. Our novelty lies in detecting a fusion of continuous and discrete KP as predicted heatmaps. A combination of sparse and dense per-pixel objectives coupled with a uni-modal self-attention-based feature-fusion layer is applied to learn KP embeddings. Further leveraging deep metric learning for unsupervised clustering, allows us to segment the chart plot area into various objects. By further matching the chart components to the legend, we are able to obtain the data series names. A post-processing threshold is applied to the KP embeddings to refine the object reconstructions and improve accuracy. Our extensive experiments include an evaluation of different modules for KP estimation and the combination of deep layer aggregation and corner pooling approaches. The results",
    "path": "papers/23/08/2308.01971.json",
    "total_tokens": 891,
    "translated_title": "SpaDen: 用于现实世界图表理解的稀疏和稠密关键点估计",
    "translated_abstract": "我们引入了一种新颖的自下而上方法来提取图表数据。我们的模型利用图表图像作为输入，并学习检测关键点（KP），用于重构绘图区域内的组件。我们的创新点在于检测连续和离散KP的融合，作为预测的热图。我们应用稀疏和稠密逐像素目标的组合，结合单模态自注意力特征融合层来学习KP嵌入。进一步利用深度度量学习进行无监督聚类，可以将图表绘图区域分割成各种对象。通过将图表组件与图例进行匹配，我们能够获得数据系列名称。对KP嵌入应用后处理阈值，以进一步改进对象的重构并提高准确性。我们的实验包括评估不同模块用于KP估计以及深层聚合和角点池化方法的组合。",
    "tldr": "本文介绍了一种用于提取图表数据的新型自下而上方法。通过检测连续和离散的关键点来实现对绘图区域内组件的重构，进而获取数据系列名称。实验结果证明了该方法的有效性。",
    "en_tdlr": "This paper presents a novel bottom-up approach for extracting chart data, by detecting a fusion of continuous and discrete keypoints. The method reconstructs components within the plot area and obtains data series names. Experimental results demonstrate the effectiveness of this approach."
}