{
    "title": "ViCo: Engaging Video Comment Generation with Human Preference Rewards. (arXiv:2308.11171v1 [cs.CV])",
    "abstract": "Engaging video comments play an important role in video social media, as they are the carrier of feelings, thoughts, or humor of the audience. Preliminary works have made initial exploration for video comment generation by adopting caption-style encoder-decoder models. However, comment generation presents some unique challenges distinct from caption generation, which makes these methods somewhat less effective at generating engaging comments. In contrast to the objective and descriptive nature of captions, comments tend to be inherently subjective, making it hard to quantify and evaluate the engagement of comments. Furthermore, the scarcity of truly engaging comments brings difficulty to collecting enough high-quality training examples. In this paper, we propose ViCo with three novel designs to tackle the above challenges for generating engaging Video Comments. Firstly, to quantify the engagement of comments, we utilize the number of \"likes\" each comment receives as a proxy of human pr",
    "link": "http://arxiv.org/abs/2308.11171",
    "context": "Title: ViCo: Engaging Video Comment Generation with Human Preference Rewards. (arXiv:2308.11171v1 [cs.CV])\nAbstract: Engaging video comments play an important role in video social media, as they are the carrier of feelings, thoughts, or humor of the audience. Preliminary works have made initial exploration for video comment generation by adopting caption-style encoder-decoder models. However, comment generation presents some unique challenges distinct from caption generation, which makes these methods somewhat less effective at generating engaging comments. In contrast to the objective and descriptive nature of captions, comments tend to be inherently subjective, making it hard to quantify and evaluate the engagement of comments. Furthermore, the scarcity of truly engaging comments brings difficulty to collecting enough high-quality training examples. In this paper, we propose ViCo with three novel designs to tackle the above challenges for generating engaging Video Comments. Firstly, to quantify the engagement of comments, we utilize the number of \"likes\" each comment receives as a proxy of human pr",
    "path": "papers/23/08/2308.11171.json",
    "total_tokens": 901,
    "translated_title": "ViCo: 利用人类偏好奖励进行有趣视频评论生成",
    "translated_abstract": "有趣的视频评论在视频社交媒体中起着重要作用，因为它们是观众情感、思想或幽默的载体。早期的研究通过采用标题样式的编码器-解码器模型对视频评论生成进行了初步探索。然而，评论生成与标题生成存在一些独特的挑战，这使得这些方法在生成有趣评论方面不够有效。与标题的客观描述性质不同，评论往往具有固有的主观性，这使得评论的参与度难以量化和评估。此外，真正有趣的评论的稀缺性给收集足够高质量的训练样本带来了困难。在本文中，我们提出了ViCo，通过三种新颖的设计来解决上述挑战，以生成有趣的视频评论。首先，为了量化评论的参与度，我们利用每条评论收到的“赞”数作为人类偏好的代理指标。",
    "tldr": "本文提出了ViCo，通过三种新颖的设计来解决视频评论生成中的挑战，包括评论的主观性难以量化和评估，以及高质量训练样本的稀缺性。利用人类偏好奖励的方法，ViCo能够生成有趣的视频评论。"
}