{
    "title": "Anomaly-Aware Semantic Segmentation via Style-Aligned OoD Augmentation. (arXiv:2308.09965v1 [cs.CV])",
    "abstract": "Within the context of autonomous driving, encountering unknown objects becomes inevitable during deployment in the open world. Therefore, it is crucial to equip standard semantic segmentation models with anomaly awareness. Many previous approaches have utilized synthetic out-of-distribution (OoD) data augmentation to tackle this problem. In this work, we advance the OoD synthesis process by reducing the domain gap between the OoD data and driving scenes, effectively mitigating the style difference that might otherwise act as an obvious shortcut during training. Additionally, we propose a simple fine-tuning loss that effectively induces a pre-trained semantic segmentation model to generate a ``none of the given classes\" prediction, leveraging per-pixel OoD scores for anomaly segmentation. With minimal fine-tuning effort, our pipeline enables the use of pre-trained models for anomaly segmentation while maintaining the performance on the original task.",
    "link": "http://arxiv.org/abs/2308.09965",
    "context": "Title: Anomaly-Aware Semantic Segmentation via Style-Aligned OoD Augmentation. (arXiv:2308.09965v1 [cs.CV])\nAbstract: Within the context of autonomous driving, encountering unknown objects becomes inevitable during deployment in the open world. Therefore, it is crucial to equip standard semantic segmentation models with anomaly awareness. Many previous approaches have utilized synthetic out-of-distribution (OoD) data augmentation to tackle this problem. In this work, we advance the OoD synthesis process by reducing the domain gap between the OoD data and driving scenes, effectively mitigating the style difference that might otherwise act as an obvious shortcut during training. Additionally, we propose a simple fine-tuning loss that effectively induces a pre-trained semantic segmentation model to generate a ``none of the given classes\" prediction, leveraging per-pixel OoD scores for anomaly segmentation. With minimal fine-tuning effort, our pipeline enables the use of pre-trained models for anomaly segmentation while maintaining the performance on the original task.",
    "path": "papers/23/08/2308.09965.json",
    "total_tokens": 942,
    "translated_title": "基于风格对齐的畸变感知语义分割",
    "translated_abstract": "在自动驾驶的背景下，在开放世界中遇到未知对象成为不可避免的。因此，将标准的语义分割模型配备异常感知是至关重要的。许多先前的方法利用合成的离群分布（OoD）数据增强来解决这个问题。本文通过减小OoD数据和驾驶场景之间的域差异，有效减少了培训过程中可能作为明显捷径的风格差异，从而改进了OoD合成过程。此外，我们提出了一种简单的微调损失函数，有效地导致预训练的语义分割模型生成“给定类别之外”的预测结果，利用每个像素的OoD分数进行异常分割。通过最小的微调工作，我们的流水线使得预训练模型能够用于异常分割，同时保持原任务的性能。",
    "tldr": "在自动驾驶中遇到未知对象是不可避免的，为了解决这个问题，我们提出了一种基于风格对齐的畸变感知语义分割方法。通过减小OoD数据和驾驶场景之间的域差异，我们改进了OoD合成过程，并利用预训练模型生成“给定类别之外”的预测结果进行异常分割，从而提高了性能。",
    "en_tdlr": "Encountering unknown objects is inevitable in autonomous driving, and to address this problem, we propose an anomaly-aware semantic segmentation method based on style alignment. By reducing the domain gap between OoD data and driving scenes, we improve the OoD synthesis process and leverage pre-trained models to generate \"none of the given classes\" predictions for anomaly segmentation, thereby enhancing performance."
}