{
    "title": "Anisotropic Hybrid Networks for liver tumor segmentation with uncertainty quantification. (arXiv:2308.11969v1 [eess.IV])",
    "abstract": "The burden of liver tumors is important, ranking as the fourth leading cause of cancer mortality. In case of hepatocellular carcinoma (HCC), the delineation of liver and tumor on contrast-enhanced magnetic resonance imaging (CE-MRI) is performed to guide the treatment strategy. As this task is time-consuming, needs high expertise and could be subject to inter-observer variability there is a strong need for automatic tools. However, challenges arise from the lack of available training data, as well as the high variability in terms of image resolution and MRI sequence. In this work we propose to compare two different pipelines based on anisotropic models to obtain the segmentation of the liver and tumors. The first pipeline corresponds to a baseline multi-class model that performs the simultaneous segmentation of the liver and tumor classes. In the second approach, we train two distinct binary models, one segmenting the liver only and the other the tumors. Our results show that both pipe",
    "link": "http://arxiv.org/abs/2308.11969",
    "context": "Title: Anisotropic Hybrid Networks for liver tumor segmentation with uncertainty quantification. (arXiv:2308.11969v1 [eess.IV])\nAbstract: The burden of liver tumors is important, ranking as the fourth leading cause of cancer mortality. In case of hepatocellular carcinoma (HCC), the delineation of liver and tumor on contrast-enhanced magnetic resonance imaging (CE-MRI) is performed to guide the treatment strategy. As this task is time-consuming, needs high expertise and could be subject to inter-observer variability there is a strong need for automatic tools. However, challenges arise from the lack of available training data, as well as the high variability in terms of image resolution and MRI sequence. In this work we propose to compare two different pipelines based on anisotropic models to obtain the segmentation of the liver and tumors. The first pipeline corresponds to a baseline multi-class model that performs the simultaneous segmentation of the liver and tumor classes. In the second approach, we train two distinct binary models, one segmenting the liver only and the other the tumors. Our results show that both pipe",
    "path": "papers/23/08/2308.11969.json",
    "total_tokens": 1049,
    "translated_title": "不均匀混合网络用于带不确定性评估的肝脏肿瘤分割",
    "translated_abstract": "肝脏肿瘤的负担很重要，是癌症死亡的第四大原因。对于肝细胞癌（HCC），在对比增强磁共振成像（CE-MRI）上的肝脏和肿瘤进行界定，以指导治疗策略。由于这个任务耗时，需要高度的专业知识，且可能存在观察者之间的差异，因此迫切需要自动化工具。然而，缺乏可用的训练数据以及图像分辨率和MRI序列的高度变异性都带来了挑战。在本研究中，我们提出了两种基于不均匀模型的不同流程，用于获取肝脏和肿瘤的分割。第一个流程是基于多类模型的基线模型，可以同时分割肝脏和肿瘤类别。在第二种方法中，我们训练了两个不同的二进制模型，一个用于分割肝脏，另一个用于分割肿瘤。我们的结果表明，这两种流程都可以取得良好的分割效果。",
    "tldr": "本研究提出了两种不同的基于不均匀模型的流程，用于带有不确定性评估的肝脏肿瘤分割。第一个流程使用多类模型同时分割肝脏和肿瘤，而第二个流程使用两个二进制模型分别分割肝脏和肿瘤。结果表明这两种流程在分割肝脏和肿瘤方面都取得了良好效果。"
}