{
    "title": "Tightest Admissible Shortest Path. (arXiv:2308.08453v1 [cs.DS])",
    "abstract": "The shortest path problem in graphs is fundamental to AI. Nearly all variants of the problem and relevant algorithms that solve them ignore edge-weight computation time and its common relation to weight uncertainty. This implies that taking these factors into consideration can potentially lead to a performance boost in relevant applications. Recently, a generalized framework for weighted directed graphs was suggested, where edge-weight can be computed (estimated) multiple times, at increasing accuracy and run-time expense. We build on this framework to introduce the problem of finding the tightest admissible shortest path (TASP); a path with the tightest suboptimality bound on the optimal cost. This is a generalization of the shortest path problem to bounded uncertainty, where edge-weight uncertainty can be traded for computational cost. We present a complete algorithm for solving TASP, with guarantees on solution quality. Empirical evaluation supports the effectiveness of this approac",
    "link": "http://arxiv.org/abs/2308.08453",
    "context": "Title: Tightest Admissible Shortest Path. (arXiv:2308.08453v1 [cs.DS])\nAbstract: The shortest path problem in graphs is fundamental to AI. Nearly all variants of the problem and relevant algorithms that solve them ignore edge-weight computation time and its common relation to weight uncertainty. This implies that taking these factors into consideration can potentially lead to a performance boost in relevant applications. Recently, a generalized framework for weighted directed graphs was suggested, where edge-weight can be computed (estimated) multiple times, at increasing accuracy and run-time expense. We build on this framework to introduce the problem of finding the tightest admissible shortest path (TASP); a path with the tightest suboptimality bound on the optimal cost. This is a generalization of the shortest path problem to bounded uncertainty, where edge-weight uncertainty can be traded for computational cost. We present a complete algorithm for solving TASP, with guarantees on solution quality. Empirical evaluation supports the effectiveness of this approac",
    "path": "papers/23/08/2308.08453.json",
    "total_tokens": 825,
    "translated_title": "最严格可接受的最短路径",
    "translated_abstract": "图中的最短路径问题对于人工智能来说是基础性的。几乎所有问题的变种和相关算法都忽略了边权计算时间及其与权重不确定性的常见关系。这意味着考虑这些因素可能会在相关应用中带来性能提升。最近，提出了一种针对加权有向图的推广框架，可以多次计算（估计）边权，随着精度的增加和运行时间的增加。我们在此框架上引入了寻找最严格可接受的最短路径（TASP）的问题；这是将最短路径问题推广到有界不确定性的情况，其中可以通过计算成本来交换边权的不确定性。我们提出了一个完整的算法来解决TASP，并保证了解的质量。实证评估支持这种方法的有效性。",
    "tldr": "该论文提出了一种针对加权有向图的最严格可接受的最短路径问题，利用边权不确定性进行计算成本交换，并提供了一个完整的算法来解决此问题，并保证解的质量。",
    "en_tdlr": "This paper presents the problem of finding the tightest admissible shortest path in weighted directed graphs, where edge-weight uncertainty can be traded for computational cost. It provides a complete algorithm with guarantees on solution quality."
}