{
    "title": "Data Augmentation-Based Unsupervised Domain Adaptation In Medical Imaging. (arXiv:2308.04395v1 [eess.IV])",
    "abstract": "Deep learning-based models in medical imaging often struggle to generalize effectively to new scans due to data heterogeneity arising from differences in hardware, acquisition parameters, population, and artifacts. This limitation presents a significant challenge in adopting machine learning models for clinical practice. We propose an unsupervised method for robust domain adaptation in brain MRI segmentation by leveraging MRI-specific augmentation techniques. To evaluate the effectiveness of our method, we conduct extensive experiments across diverse datasets, modalities, and segmentation tasks, comparing against the state-of-the-art methods. The results show that our proposed approach achieves high accuracy, exhibits broad applicability, and showcases remarkable robustness against domain shift in various tasks, surpassing the state-of-the-art performance in the majority of cases.",
    "link": "http://arxiv.org/abs/2308.04395",
    "context": "Title: Data Augmentation-Based Unsupervised Domain Adaptation In Medical Imaging. (arXiv:2308.04395v1 [eess.IV])\nAbstract: Deep learning-based models in medical imaging often struggle to generalize effectively to new scans due to data heterogeneity arising from differences in hardware, acquisition parameters, population, and artifacts. This limitation presents a significant challenge in adopting machine learning models for clinical practice. We propose an unsupervised method for robust domain adaptation in brain MRI segmentation by leveraging MRI-specific augmentation techniques. To evaluate the effectiveness of our method, we conduct extensive experiments across diverse datasets, modalities, and segmentation tasks, comparing against the state-of-the-art methods. The results show that our proposed approach achieves high accuracy, exhibits broad applicability, and showcases remarkable robustness against domain shift in various tasks, surpassing the state-of-the-art performance in the majority of cases.",
    "path": "papers/23/08/2308.04395.json",
    "total_tokens": 845,
    "translated_title": "基于数据增强的医学图像无监督领域适应",
    "translated_abstract": "基于深度学习的医学图像模型经常在新的扫描中难以有效推广，这是由于硬件、采集参数、人群和伪影引起的数据异质性。这个限制在临床实践中应用机器学习模型时带来了重大挑战。我们提出了一种基于MRI特定增强技术的大脑MRI分割的无监督领域适应方法。为了评估我们方法的有效性，我们在不同的数据集、模态和分割任务上进行了广泛的实验，并与最先进的方法进行了比较。结果表明，我们提出的方法在大多数情况下都能取得高精度，具有广泛的适用性，并且在各种任务中都展现出了显著的对抗领域偏移的鲁棒性，超过了现有技术的性能。",
    "tldr": "本论文提出了一种基于数据增强的医学图像无监督领域适应方法，在大脑MRI分割任务中显示出高准确性、广泛适用性和对抗领域偏移的鲁棒性，超过现有技术的性能。",
    "en_tdlr": "This paper proposes an unsupervised domain adaptation method for medical imaging using data augmentation techniques. The method achieves high accuracy, broad applicability, and remarkable robustness against domain shift in brain MRI segmentation tasks, surpassing the state-of-the-art performance."
}