{
    "title": "Digital Twin-Oriented Complex Networked Systems based on Heterogeneous node features and interaction rules. (arXiv:2308.11034v1 [cs.SI])",
    "abstract": "This study proposes an extendable modelling framework for Digital Twin-Oriented Complex Networked Systems (DT-CNSs) with a goal of generating networks that faithfully represent real systems. Modelling process focuses on (i) features of nodes and (ii) interaction rules for creating connections that are built based on individual node's preferences. We conduct experiments on simulation-based DT-CNSs that incorporate various features and rules about network growth and different transmissibilities related to an epidemic spread on these networks. We present a case study on disaster resilience of social networks given an epidemic outbreak by investigating the infection occurrence within specific time and social distance. The experimental results show how different levels of the structural and dynamics complexities, concerned with feature diversity and flexibility of interaction rules respectively, influence network growth and epidemic spread. The analysis revealed that, to achieve maximum dis",
    "link": "http://arxiv.org/abs/2308.11034",
    "context": "Title: Digital Twin-Oriented Complex Networked Systems based on Heterogeneous node features and interaction rules. (arXiv:2308.11034v1 [cs.SI])\nAbstract: This study proposes an extendable modelling framework for Digital Twin-Oriented Complex Networked Systems (DT-CNSs) with a goal of generating networks that faithfully represent real systems. Modelling process focuses on (i) features of nodes and (ii) interaction rules for creating connections that are built based on individual node's preferences. We conduct experiments on simulation-based DT-CNSs that incorporate various features and rules about network growth and different transmissibilities related to an epidemic spread on these networks. We present a case study on disaster resilience of social networks given an epidemic outbreak by investigating the infection occurrence within specific time and social distance. The experimental results show how different levels of the structural and dynamics complexities, concerned with feature diversity and flexibility of interaction rules respectively, influence network growth and epidemic spread. The analysis revealed that, to achieve maximum dis",
    "path": "papers/23/08/2308.11034.json",
    "total_tokens": 928,
    "translated_title": "基于异构节点特征和交互规则的面向数字孪生的复杂网络系统",
    "translated_abstract": "本研究提出了一种可扩展的建模框架，用于数字孪生导向的复杂网络系统（DT-CNS），旨在生成能够真实表示实际系统的网络。建模过程关注节点的特征和基于个体节点偏好创建连接的交互规则。我们对基于模拟的DT-CNS进行了实验，其中包括各种特征和规则，以及与传染病在这些网络中的传播相关的不同传染能力。我们通过调查特定时间和社交距离内的感染情况，对社交网络的灾害韧性进行了案例研究。实验结果显示了结构复杂性和动态复杂性的不同级别对网络增长和疫情传播的影响，分别涉及特征多样性和交互规则的灵活性。分析表明，要实现最大的灾害韧性，需要在DT-CNS中平衡这些复杂性水平。",
    "tldr": "本研究提出了一种面向数字孪生的复杂网络系统的可扩展建模框架，重点关注节点特征和交互规则。通过实验研究了网络增长和疫情传播的不同级别的复杂性对系统的影响，结果表明需要在DT-CNS中平衡这些复杂性水平。",
    "en_tdlr": "This study proposes an extendable modelling framework for Digital Twin-Oriented Complex Networked Systems (DT-CNSs), focusing on node features and interaction rules. Experimental results show how different levels of complexity in network growth and epidemic spread influence the system, highlighting the need to balance these complexities in DT-CNSs."
}