{
    "title": "Modelling the Spread of COVID-19 in Indoor Spaces using Automated Probabilistic Planning. (arXiv:2308.08190v1 [cs.AI])",
    "abstract": "The coronavirus disease 2019 (COVID-19) pandemic has been ongoing for around 3 years, and has infected over 750 million people and caused over 6 million deaths worldwide at the time of writing. Throughout the pandemic, several strategies for controlling the spread of the disease have been debated by healthcare professionals, government authorities, and international bodies. To anticipate the potential impact of the disease, and to simulate the effectiveness of different mitigation strategies, a robust model of disease spread is needed. In this work, we explore a novel approach based on probabilistic planning and dynamic graph analysis to model the spread of COVID-19 in indoor spaces. We endow the planner with means to control the spread of the disease through non-pharmaceutical interventions (NPIs) such as mandating masks and vaccines, and we compare the impact of crowds and capacity limits on the spread of COVID-19 in these settings. We demonstrate that the use of probabilistic planni",
    "link": "http://arxiv.org/abs/2308.08190",
    "context": "Title: Modelling the Spread of COVID-19 in Indoor Spaces using Automated Probabilistic Planning. (arXiv:2308.08190v1 [cs.AI])\nAbstract: The coronavirus disease 2019 (COVID-19) pandemic has been ongoing for around 3 years, and has infected over 750 million people and caused over 6 million deaths worldwide at the time of writing. Throughout the pandemic, several strategies for controlling the spread of the disease have been debated by healthcare professionals, government authorities, and international bodies. To anticipate the potential impact of the disease, and to simulate the effectiveness of different mitigation strategies, a robust model of disease spread is needed. In this work, we explore a novel approach based on probabilistic planning and dynamic graph analysis to model the spread of COVID-19 in indoor spaces. We endow the planner with means to control the spread of the disease through non-pharmaceutical interventions (NPIs) such as mandating masks and vaccines, and we compare the impact of crowds and capacity limits on the spread of COVID-19 in these settings. We demonstrate that the use of probabilistic planni",
    "path": "papers/23/08/2308.08190.json",
    "total_tokens": 740,
    "translated_title": "使用自动概率规划建模COVID-19在室内空间中的传播",
    "translated_abstract": "在这项工作中，我们探索了一种基于概率规划和动态图分析的新方法，以模拟COVID-19在室内空间中的传播。我们通过非药物干预控制疾病的传播，如强制佩戴口罩和接种疫苗，并比较拥挤和容量限制对COVID-19传播的影响。我们证明了使用概率规划可以预测不同干预策略的效果。",
    "tldr": "本论文使用自动概率规划和动态图分析建模COVID-19在室内空间的传播，通过非药物干预控制疾病的传播，并比较不同干预策略的效果。",
    "en_tdlr": "This paper models the spread of COVID-19 in indoor spaces using automated probabilistic planning and dynamic graph analysis. It controls the spread of the disease through non-pharmaceutical interventions and compares the effectiveness of different mitigation strategies."
}