{
    "title": "Ahead of the Text: Leveraging Entity Preposition for Financial Relation Extraction. (arXiv:2308.04534v1 [cs.CL])",
    "abstract": "In the context of the ACM KDF-SIGIR 2023 competition, we undertook an entity relation task on a dataset of financial entity relations called REFind. Our top-performing solution involved a multi-step approach. Initially, we inserted the provided entities at their corresponding locations within the text. Subsequently, we fine-tuned the transformer-based language model roberta-large for text classification by utilizing a labeled training set to predict the entity relations. Lastly, we implemented a post-processing phase to identify and handle improbable predictions generated by the model. As a result of our methodology, we achieved the 1st place ranking on the competition's public leaderboard.",
    "link": "http://arxiv.org/abs/2308.04534",
    "context": "Title: Ahead of the Text: Leveraging Entity Preposition for Financial Relation Extraction. (arXiv:2308.04534v1 [cs.CL])\nAbstract: In the context of the ACM KDF-SIGIR 2023 competition, we undertook an entity relation task on a dataset of financial entity relations called REFind. Our top-performing solution involved a multi-step approach. Initially, we inserted the provided entities at their corresponding locations within the text. Subsequently, we fine-tuned the transformer-based language model roberta-large for text classification by utilizing a labeled training set to predict the entity relations. Lastly, we implemented a post-processing phase to identify and handle improbable predictions generated by the model. As a result of our methodology, we achieved the 1st place ranking on the competition's public leaderboard.",
    "path": "papers/23/08/2308.04534.json",
    "total_tokens": 668,
    "translated_title": "提前文本：利用实体介词进行财务关系提取",
    "translated_abstract": "在ACM KDF-SIGIR 2023竞赛的背景下，我们在一个名为REFind的财务实体关系数据集上进行了一个实体关系任务。我们的最佳解决方案采用了一个多步骤的方法。首先，我们将提供的实体插入到文本中对应的位置。然后，我们利用带标签的训练集对基于transformer的语言模型roberta-large进行了文本分类的微调，以预测实体关系。最后，我们实施了后处理阶段，以识别和处理模型生成的不太可能的预测。由于我们的方法，我们在比赛的公共排行榜上获得了第一名的排名。",
    "tldr": "本文在ACM KDF-SIGIR 2023竞赛中提出了一种利用实体介词进行财务关系提取的方法，在比赛中赢得了第一名。"
}