{
    "title": "Towards Self-Adaptive Machine Learning-Enabled Systems Through QoS-Aware Model Switching. (arXiv:2308.09960v1 [cs.SE])",
    "abstract": "Machine Learning (ML), particularly deep learning, has seen vast advancements, leading to the rise of Machine Learning-Enabled Systems (MLS). However, numerous software engineering challenges persist in propelling these MLS into production, largely due to various run-time uncertainties that impact the overall Quality of Service (QoS). These uncertainties emanate from ML models, software components, and environmental factors. Self-adaptation techniques present potential in managing run-time uncertainties, but their application in MLS remains largely unexplored. As a solution, we propose the concept of a Machine Learning Model Balancer, focusing on managing uncertainties related to ML models by using multiple models. Subsequently, we introduce AdaMLS, a novel self-adaptation approach that leverages this concept and extends the traditional MAPE-K loop for continuous MLS adaptation. AdaMLS employs lightweight unsupervised learning for dynamic model switching, thereby ensuring consistent Qo",
    "link": "http://arxiv.org/abs/2308.09960",
    "context": "Title: Towards Self-Adaptive Machine Learning-Enabled Systems Through QoS-Aware Model Switching. (arXiv:2308.09960v1 [cs.SE])\nAbstract: Machine Learning (ML), particularly deep learning, has seen vast advancements, leading to the rise of Machine Learning-Enabled Systems (MLS). However, numerous software engineering challenges persist in propelling these MLS into production, largely due to various run-time uncertainties that impact the overall Quality of Service (QoS). These uncertainties emanate from ML models, software components, and environmental factors. Self-adaptation techniques present potential in managing run-time uncertainties, but their application in MLS remains largely unexplored. As a solution, we propose the concept of a Machine Learning Model Balancer, focusing on managing uncertainties related to ML models by using multiple models. Subsequently, we introduce AdaMLS, a novel self-adaptation approach that leverages this concept and extends the traditional MAPE-K loop for continuous MLS adaptation. AdaMLS employs lightweight unsupervised learning for dynamic model switching, thereby ensuring consistent Qo",
    "path": "papers/23/08/2308.09960.json",
    "total_tokens": 897,
    "translated_title": "通过QoS感知的模型切换实现自适应机器学习系统",
    "translated_abstract": "机器学习（ML），特别是深度学习，取得了巨大的进展，导致了机器学习驱动的系统（MLS）的兴起。然而，在推进这些MLS进入生产中仍然存在许多软件工程挑战，主要是由于影响整体服务质量（QoS）的各种运行时不确定性。这些不确定性来自ML模型、软件组件和环境因素。自适应技术在管理运行时不确定性方面具有潜力，但在MLS中的应用仍然较少探索。作为解决方案，我们提出了机器学习模型平衡器的概念，重点解决与ML模型相关的不确定性通过使用多个模型进行管理。随后，我们引入了AdaMLS，一种新颖的自适应方法，它利用这一概念并扩展了传统的MAPE-K循环以实现持续的MLS自适应。AdaMLS采用轻量级无监督学习用于动态模型切换，从而确保一致的Qo",
    "tldr": "通过使用多个模型管理ML模型相关的不确定性，我们提出了一种自适应机器学习系统，该系统利用自适应技术和动态模型切换以提高整体服务质量（QoS）。",
    "en_tdlr": "We propose a self-adaptive machine learning system that manages uncertainties related to ML models by using multiple models, improving the overall Quality of Service (QoS) through adaptive techniques and dynamic model switching."
}