{
    "title": "Trustworthiness of Children Stories Generated by Large Language Models. (arXiv:2308.00073v1 [cs.CL])",
    "abstract": "Large Language Models (LLMs) have shown a tremendous capacity for generating literary text. However, their effectiveness in generating children's stories has yet to be thoroughly examined. In this study, we evaluate the trustworthiness of children's stories generated by LLMs using various measures, and we compare and contrast our results with both old and new children's stories to better assess their significance. Our findings suggest that LLMs still struggle to generate children's stories at the level of quality and nuance found in actual stories",
    "link": "http://arxiv.org/abs/2308.00073",
    "context": "Title: Trustworthiness of Children Stories Generated by Large Language Models. (arXiv:2308.00073v1 [cs.CL])\nAbstract: Large Language Models (LLMs) have shown a tremendous capacity for generating literary text. However, their effectiveness in generating children's stories has yet to be thoroughly examined. In this study, we evaluate the trustworthiness of children's stories generated by LLMs using various measures, and we compare and contrast our results with both old and new children's stories to better assess their significance. Our findings suggest that LLMs still struggle to generate children's stories at the level of quality and nuance found in actual stories",
    "path": "papers/23/08/2308.00073.json",
    "total_tokens": 692,
    "translated_title": "大型语言模型生成的儿童故事的可信度研究",
    "translated_abstract": "大型语言模型（LLM）展示了生成文学文本的巨大能力。然而，它们在生成儿童故事方面的效果尚未得到充分的检验。在这项研究中，我们使用各种指标评估了LLM生成的儿童故事的可信度，并将我们的结果与旧有和新的儿童故事进行比较和对比，以更好地评估它们的重要性。我们的研究结果表明，LLM在生成儿童故事的质量和细微差别方面仍存在困难，无法达到实际故事的水平。",
    "tldr": "本研究评估了大型语言模型生成的儿童故事的可信度，并发现它们在质量和细节方面仍然有困难，无法达到实际故事的水平。",
    "en_tdlr": "This study evaluates the trustworthiness of children's stories generated by large language models and finds that they still struggle to meet the level of quality and nuance found in actual stories."
}