{
    "title": "Evaluating the structure of cognitive tasks with transfer learning. (arXiv:2308.02408v1 [eess.SP])",
    "abstract": "Electroencephalography (EEG) decoding is a challenging task due to the limited availability of labelled data. While transfer learning is a promising technique to address this challenge, it assumes that transferable data domains and task are known, which is not the case in this setting. This study investigates the transferability of deep learning representations between different EEG decoding tasks. We conduct extensive experiments using state-of-the-art decoding models on two recently released EEG datasets, ERP CORE and M$^3$CV, containing over 140 subjects and 11 distinct cognitive tasks. We measure the transferability of learned representations by pre-training deep neural networks on one task and assessing their ability to decode subsequent tasks. Our experiments demonstrate that, even with linear probing transfer, significant improvements in decoding performance can be obtained, with gains of up to 28% compare with the pure supervised approach. Additionally, we discover evidence tha",
    "link": "http://arxiv.org/abs/2308.02408",
    "context": "Title: Evaluating the structure of cognitive tasks with transfer learning. (arXiv:2308.02408v1 [eess.SP])\nAbstract: Electroencephalography (EEG) decoding is a challenging task due to the limited availability of labelled data. While transfer learning is a promising technique to address this challenge, it assumes that transferable data domains and task are known, which is not the case in this setting. This study investigates the transferability of deep learning representations between different EEG decoding tasks. We conduct extensive experiments using state-of-the-art decoding models on two recently released EEG datasets, ERP CORE and M$^3$CV, containing over 140 subjects and 11 distinct cognitive tasks. We measure the transferability of learned representations by pre-training deep neural networks on one task and assessing their ability to decode subsequent tasks. Our experiments demonstrate that, even with linear probing transfer, significant improvements in decoding performance can be obtained, with gains of up to 28% compare with the pure supervised approach. Additionally, we discover evidence tha",
    "path": "papers/23/08/2308.02408.json",
    "total_tokens": 912,
    "translated_title": "通过迁移学习评估认知任务的结构",
    "translated_abstract": "由于标记数据有限，脑电图（EEG）解码是一项具有挑战性的任务。虽然迁移学习是解决这一挑战的一种有前景的技术，但它假设可传递的数据领域和任务是已知的，而在这个设置中并非如此。本研究调查了不同EEG解码任务之间深度学习表示的可迁移性。我们使用最先进的解码模型对最近发布的ERP CORE和M$^3$CV两个EEG数据集进行了大量实验，这两个数据集包含超过140个受试者和11个不同的认知任务。我们通过在一个任务上对深度神经网络进行预训练，并评估它们解码后续任务的能力，来衡量学到的表示的可迁移性。我们的实验表明，即使是线性探测转移，也可以获得显著的解码性能改进，相较于纯监督方法，改进幅度高达28%。此外，我们发现了证据证明...",
    "tldr": "本研究通过迁移学习探索了在脑电图解码任务中，不同任务之间深度学习表征的可迁移性，并展示了即使是线性探测转移，也可以显著提高解码性能，相较于纯监督方法，改进幅度高达28%。",
    "en_tdlr": "This study investigates the transferability of deep learning representations between different cognitive tasks in EEG decoding, demonstrating significant performance improvements even with linear probing transfer, achieving gains of up to 28% compared with the pure supervised approach."
}