{
    "title": "GARHCX-NoVaS: A Model-free Approach to Incorporate Exogenous Variables. (arXiv:2308.13346v1 [econ.EM])",
    "abstract": "In this work, we further explore the forecasting ability of a recently proposed normalizing and variance-stabilizing (NoVaS) transformation after wrapping exogenous variables. In practice, especially in the area of financial econometrics, extra knowledge such as fundamentals- and sentiments-based information could be beneficial to improve the prediction accuracy of market volatility if they are incorporated into the forecasting process. In a classical approach, people usually apply GARCHX-type methods to include the exogenous variables. Being a Model-free prediction method, NoVaS has been shown to be more accurate and stable than classical GARCH-type methods. We are interested in whether the novel NoVaS method can also sustain its superiority after exogenous covariates are taken into account. We provide the NoVaS transformation based on GARCHX model and then claim the corresponding prediction procedure with exogenous variables existing. Also, simulation studies verify that the NoVaS me",
    "link": "http://arxiv.org/abs/2308.13346",
    "context": "Title: GARHCX-NoVaS: A Model-free Approach to Incorporate Exogenous Variables. (arXiv:2308.13346v1 [econ.EM])\nAbstract: In this work, we further explore the forecasting ability of a recently proposed normalizing and variance-stabilizing (NoVaS) transformation after wrapping exogenous variables. In practice, especially in the area of financial econometrics, extra knowledge such as fundamentals- and sentiments-based information could be beneficial to improve the prediction accuracy of market volatility if they are incorporated into the forecasting process. In a classical approach, people usually apply GARCHX-type methods to include the exogenous variables. Being a Model-free prediction method, NoVaS has been shown to be more accurate and stable than classical GARCH-type methods. We are interested in whether the novel NoVaS method can also sustain its superiority after exogenous covariates are taken into account. We provide the NoVaS transformation based on GARCHX model and then claim the corresponding prediction procedure with exogenous variables existing. Also, simulation studies verify that the NoVaS me",
    "path": "papers/23/08/2308.13346.json",
    "total_tokens": 867,
    "translated_title": "GARHCX-NoVaS：一种无模型方法用于引入外生变量",
    "translated_abstract": "在这项工作中，我们进一步探讨了最近提出的正态化和方差稳定（NoVaS）转化在包含外生变量后的预测能力。在实践中，尤其是在金融计量经济学领域，如果将基本面和情绪等额外知识纳入预测过程中，可能有助于提高市场波动率的预测准确性。在经典方法中，人们通常应用GARCHX型方法来包括外生变量。作为一种无模型预测方法，已经证明NoVaS比经典的GARCHX型方法更准确、更稳定。我们关注的是在考虑外生协变量后，新颖的NoVaS方法是否仍然保持其优势。我们提供了基于GARCHX模型的NoVaS转换，并声明了包含外生变量的相应预测过程。同时，模拟研究验证了NoVaS的性能。",
    "tldr": "这项工作探索了一种无模型方法GARHCX-NoVaS，将外生变量引入预测过程，提高市场波动率的预测准确性。模拟研究证实了NoVaS的优越性。",
    "en_tdlr": "This work explores a model-free method called GARHCX-NoVaS to incorporate exogenous variables and improve the prediction accuracy of market volatility. Simulation studies confirm the superiority of NoVaS."
}