{
    "title": "An Adaptive Approach for Probabilistic Wind Power Forecasting Based on Meta-Learning. (arXiv:2308.07980v1 [eess.SY])",
    "abstract": "This paper studies an adaptive approach for probabilistic wind power forecasting (WPF) including offline and online learning procedures. In the offline learning stage, a base forecast model is trained via inner and outer loop updates of meta-learning, which endows the base forecast model with excellent adaptability to different forecast tasks, i.e., probabilistic WPF with different lead times or locations. In the online learning stage, the base forecast model is applied to online forecasting combined with incremental learning techniques. On this basis, the online forecast takes full advantage of recent information and the adaptability of the base forecast model. Two applications are developed based on our proposed approach concerning forecasting with different lead times (temporal adaptation) and forecasting for newly established wind farms (spatial adaptation), respectively. Numerical tests were conducted on real-world wind power data sets. Simulation results validate the advantages i",
    "link": "http://arxiv.org/abs/2308.07980",
    "context": "Title: An Adaptive Approach for Probabilistic Wind Power Forecasting Based on Meta-Learning. (arXiv:2308.07980v1 [eess.SY])\nAbstract: This paper studies an adaptive approach for probabilistic wind power forecasting (WPF) including offline and online learning procedures. In the offline learning stage, a base forecast model is trained via inner and outer loop updates of meta-learning, which endows the base forecast model with excellent adaptability to different forecast tasks, i.e., probabilistic WPF with different lead times or locations. In the online learning stage, the base forecast model is applied to online forecasting combined with incremental learning techniques. On this basis, the online forecast takes full advantage of recent information and the adaptability of the base forecast model. Two applications are developed based on our proposed approach concerning forecasting with different lead times (temporal adaptation) and forecasting for newly established wind farms (spatial adaptation), respectively. Numerical tests were conducted on real-world wind power data sets. Simulation results validate the advantages i",
    "path": "papers/23/08/2308.07980.json",
    "total_tokens": 868,
    "translated_title": "基于元学习的自适应概率风电功率预测方法研究",
    "translated_abstract": "本文研究了一种包括离线学习和在线学习过程的自适应概率风电功率预测方法。在离线学习阶段，通过元学习的内外层更新训练基准预测模型，使其具有适应不同预测任务（即具有不同提前时间或位置的概率风电功率预测）的优异能力。在在线学习阶段，将基准预测模型应用于在线预测，结合增量学习技术，使在线预测充分利用最近的信息和基准预测模型的适应性。基于所提出的方法，分别开发了两个应用：不同提前时间的预测（时间适应性）和新建风电场的预测（空间适应性）。在真实世界的风电数据集上进行了数值测试。仿真结果验证了该方法的优势。",
    "tldr": "本文提出了一种基于元学习的自适应概率风电功率预测方法，通过离线学习和在线学习过程，在不同的预测任务中展现出优异的适应性能力。数值测试结果验证了该方法的优势。",
    "en_tdlr": "This paper proposes an adaptive approach for probabilistic wind power forecasting based on meta-learning. The approach demonstrates excellent adaptability to different forecast tasks through offline and online learning procedures. Numerical tests validate the advantages of this approach."
}