{
    "title": "Transfusor: Transformer Diffusor for Controllable Human-like Generation of Vehicle Lane Changing Trajectories. (arXiv:2308.14943v1 [cs.AI])",
    "abstract": "With ongoing development of autonomous driving systems and increasing desire for deployment, researchers continue to seek reliable approaches for ADS systems. The virtual simulation test (VST) has become a prominent approach for testing autonomous driving systems (ADS) and advanced driver assistance systems (ADAS) due to its advantages of fast execution, low cost, and high repeatability. However, the success of these simulation-based experiments heavily relies on the realism of the testing scenarios. It is needed to create more flexible and high-fidelity testing scenarios in VST in order to increase the safety and reliabilityof ADS and ADAS.To address this challenge, this paper introduces the \"Transfusor\" model, which leverages the transformer and diffusor models (two cutting-edge deep learning generative technologies). The primary objective of the Transfusor model is to generate highly realistic and controllable human-like lane-changing trajectories in highway scenarios. Extensive exp",
    "link": "http://arxiv.org/abs/2308.14943",
    "context": "Title: Transfusor: Transformer Diffusor for Controllable Human-like Generation of Vehicle Lane Changing Trajectories. (arXiv:2308.14943v1 [cs.AI])\nAbstract: With ongoing development of autonomous driving systems and increasing desire for deployment, researchers continue to seek reliable approaches for ADS systems. The virtual simulation test (VST) has become a prominent approach for testing autonomous driving systems (ADS) and advanced driver assistance systems (ADAS) due to its advantages of fast execution, low cost, and high repeatability. However, the success of these simulation-based experiments heavily relies on the realism of the testing scenarios. It is needed to create more flexible and high-fidelity testing scenarios in VST in order to increase the safety and reliabilityof ADS and ADAS.To address this challenge, this paper introduces the \"Transfusor\" model, which leverages the transformer and diffusor models (two cutting-edge deep learning generative technologies). The primary objective of the Transfusor model is to generate highly realistic and controllable human-like lane-changing trajectories in highway scenarios. Extensive exp",
    "path": "papers/23/08/2308.14943.json",
    "total_tokens": 869,
    "translated_title": "Transfusor：用于可控人类般生成车辆换道轨迹的Transformer Diffusor",
    "translated_abstract": "随着自动驾驶系统的不断发展和部署需求的增加，研究人员不断寻求可靠的自动驾驶系统的方法。虚拟模拟测试（VST）已经成为测试自动驾驶系统（ADS）和高级驾驶员辅助系统（ADAS）的主要方法，因为它具有快速执行、低成本和高重复性的优势。然而，这些基于模拟的实验的成功程度严重依赖于测试场景的逼真程度。为了增加ADS和ADAS的安全性和可靠性，需要在VST中创建更灵活和高保真度的测试场景。为了应对这一挑战，本文引入了“Transfusor”模型，该模型利用了Transformer和Diffusor模型（两种前沿的深度学习生成技术）。Transfusor模型的主要目标是在高速公路场景中生成高度逼真且可控的类人换道轨迹。",
    "tldr": "Transfusor模型是一个使用Transformer和Diffusor模型的创新方法，旨在在高速公路场景中生成高度逼真且可控的类人换道轨迹。",
    "en_tdlr": "The Transfusor model is an innovative approach that utilizes Transformer and Diffusor models to generate highly realistic and controllable human-like lane-changing trajectories in highway scenarios."
}