{
    "title": "Leveraging the Edge and Cloud for V2X-Based Real-Time Object Detection in Autonomous Driving. (arXiv:2308.05234v1 [cs.CV])",
    "abstract": "Environmental perception is a key element of autonomous driving because the information received from the perception module influences core driving decisions. An outstanding challenge in real-time perception for autonomous driving lies in finding the best trade-off between detection quality and latency. Major constraints on both computation and power have to be taken into account for real-time perception in autonomous vehicles. Larger object detection models tend to produce the best results, but are also slower at runtime. Since the most accurate detectors cannot run in real-time locally, we investigate the possibility of offloading computation to edge and cloud platforms, which are less resource-constrained. We create a synthetic dataset to train object detection models and evaluate different offloading strategies. Using real hardware and network simulations, we compare different trade-offs between prediction quality and end-to-end delay. Since sending raw frames over the network impl",
    "link": "http://arxiv.org/abs/2308.05234",
    "context": "Title: Leveraging the Edge and Cloud for V2X-Based Real-Time Object Detection in Autonomous Driving. (arXiv:2308.05234v1 [cs.CV])\nAbstract: Environmental perception is a key element of autonomous driving because the information received from the perception module influences core driving decisions. An outstanding challenge in real-time perception for autonomous driving lies in finding the best trade-off between detection quality and latency. Major constraints on both computation and power have to be taken into account for real-time perception in autonomous vehicles. Larger object detection models tend to produce the best results, but are also slower at runtime. Since the most accurate detectors cannot run in real-time locally, we investigate the possibility of offloading computation to edge and cloud platforms, which are less resource-constrained. We create a synthetic dataset to train object detection models and evaluate different offloading strategies. Using real hardware and network simulations, we compare different trade-offs between prediction quality and end-to-end delay. Since sending raw frames over the network impl",
    "path": "papers/23/08/2308.05234.json",
    "total_tokens": 960,
    "translated_title": "利用边缘和云端技术实现自动驾驶中的实时物体检测",
    "translated_abstract": "环境感知是自动驾驶的关键因素，因为感知模块接收到的信息会影响核心驾驶决策。实时感知在自动驾驶中的一大挑战在于在检测质量和延迟之间找到最佳权衡。对于自动驾驶中的实时感知，必须考虑到计算和功耗方面的主要限制。较大的物体检测模型往往能产生最佳结果，但在运行时也更慢。由于最准确的检测器无法在本地实时运行，我们研究将计算外部化到边缘和云平台的可能性，这些平台资源受限较少。我们创建了一个合成数据集来训练物体检测模型，并评估不同的外部化策略。我们使用真实硬件和网络模拟来比较不同的预测质量和端到端延迟之间的权衡。由于通过网络传送原始帧的实现存在困难和挑战，我们引入了压缩技术来降低数据传输量。",
    "tldr": "本论文研究利用边缘和云端技术实现自动驾驶中的实时物体检测。通过创建合成数据集，评估不同的外部化策略，并使用真实硬件和网络模拟进行比较，找到了权衡预测质量和端到端延迟的最佳方法。",
    "en_tdlr": "This paper investigates the use of edge and cloud technologies for real-time object detection in autonomous driving. By creating a synthetic dataset, evaluating different offloading strategies, and comparing them using real hardware and network simulations, the optimal trade-off between prediction quality and end-to-end delay is identified."
}