{
    "title": "An Interpretable and Attention-based Method for Gaze Estimation Using Electroencephalography. (arXiv:2308.05768v1 [eess.SP])",
    "abstract": "Eye movements can reveal valuable insights into various aspects of human mental processes, physical well-being, and actions. Recently, several datasets have been made available that simultaneously record EEG activity and eye movements. This has triggered the development of various methods to predict gaze direction based on brain activity. However, most of these methods lack interpretability, which limits their technology acceptance. In this paper, we leverage a large data set of simultaneously measured Electroencephalography (EEG) and Eye tracking, proposing an interpretable model for gaze estimation from EEG data. More specifically, we present a novel attention-based deep learning framework for EEG signal analysis, which allows the network to focus on the most relevant information in the signal and discard problematic channels. Additionally, we provide a comprehensive evaluation of the presented framework, demonstrating its superiority over current methods in terms of accuracy and rob",
    "link": "http://arxiv.org/abs/2308.05768",
    "context": "Title: An Interpretable and Attention-based Method for Gaze Estimation Using Electroencephalography. (arXiv:2308.05768v1 [eess.SP])\nAbstract: Eye movements can reveal valuable insights into various aspects of human mental processes, physical well-being, and actions. Recently, several datasets have been made available that simultaneously record EEG activity and eye movements. This has triggered the development of various methods to predict gaze direction based on brain activity. However, most of these methods lack interpretability, which limits their technology acceptance. In this paper, we leverage a large data set of simultaneously measured Electroencephalography (EEG) and Eye tracking, proposing an interpretable model for gaze estimation from EEG data. More specifically, we present a novel attention-based deep learning framework for EEG signal analysis, which allows the network to focus on the most relevant information in the signal and discard problematic channels. Additionally, we provide a comprehensive evaluation of the presented framework, demonstrating its superiority over current methods in terms of accuracy and rob",
    "path": "papers/23/08/2308.05768.json",
    "total_tokens": 859,
    "translated_title": "使用脑电图的可解释和基于注意力机制的凝视估计方法",
    "translated_abstract": "眼动可以揭示人类心理过程、身体健康和行为的宝贵洞察力。最近，一些同时记录脑电活动和眼动的数据集可用，这引发了基于脑活动预测凝视方向的各种方法的发展。然而，大多数这些方法缺乏可解释性，从而限制了它们的技术可接受性。在本文中，我们利用同时测量的脑电图（EEG）和眼动跟踪的大型数据集，提出了一种从EEG数据估计凝视的可解释模型。具体而言，我们提出了一种基于注意力机制的深度学习框架来分析EEG信号，该框架允许网络将注意力集中在信号中最相关的信息上，并且忽略有问题的通道。此外，我们对所提出的框架进行了全面的评估，并展示了它在准确性和鲁棒性方面优于当前方法的优势。",
    "tldr": "本文提出了一种基于注意力机制的深度学习框架，用于从脑电图数据中解读凝视信息，其在准确性和可解释性方面优于当前方法。",
    "en_tdlr": "This paper proposes an attention-based deep learning framework for interpreting gaze information from EEG data, which outperforms current methods in terms of accuracy and interpretability."
}