{
    "title": "A short review of the main concerns in A.I. development and application within the public sector supported by NLP and TM. (arXiv:2308.02042v1 [cs.CY])",
    "abstract": "Artificial Intelligence is not a new subject, and business, industry and public sectors have used it in different ways and contexts and considering multiple concerns. This work reviewed research papers published in ACM Digital Library and IEEE Xplore conference proceedings in the last two years supported by fundamental concepts of Natural Language Processing (NLP) and Text Mining (TM). The objective was to capture insights regarding data privacy, ethics, interpretability, explainability, trustworthiness, and fairness in the public sector. The methodology has saved analysis time and could retrieve papers containing relevant information. The results showed that fairness was the most frequent concern. The least prominent topic was data privacy (although embedded in most articles), while the most prominent was trustworthiness. Finally, gathering helpful insights about those concerns regarding A.I. applications in the public sector was also possible.",
    "link": "http://arxiv.org/abs/2308.02042",
    "context": "Title: A short review of the main concerns in A.I. development and application within the public sector supported by NLP and TM. (arXiv:2308.02042v1 [cs.CY])\nAbstract: Artificial Intelligence is not a new subject, and business, industry and public sectors have used it in different ways and contexts and considering multiple concerns. This work reviewed research papers published in ACM Digital Library and IEEE Xplore conference proceedings in the last two years supported by fundamental concepts of Natural Language Processing (NLP) and Text Mining (TM). The objective was to capture insights regarding data privacy, ethics, interpretability, explainability, trustworthiness, and fairness in the public sector. The methodology has saved analysis time and could retrieve papers containing relevant information. The results showed that fairness was the most frequent concern. The least prominent topic was data privacy (although embedded in most articles), while the most prominent was trustworthiness. Finally, gathering helpful insights about those concerns regarding A.I. applications in the public sector was also possible.",
    "path": "papers/23/08/2308.02042.json",
    "total_tokens": 941,
    "translated_title": "在公共部门中支持自然语言处理和文本挖掘的人工智能发展和应用的主要关注点的简要回顾",
    "translated_abstract": "人工智能并不是一个新的课题，商业、工业和公共部门以不同的方式和背景使用它，考虑多个关注点。本研究通过对ACM Digital Library和IEEE Xplore会议论文集中过去两年发表的研究论文进行回顾，并结合自然语言处理和文本挖掘的基本概念，旨在捕捉公共部门中数据隐私、伦理、可解释性、可信度和公平的洞察。该方法节省了分析时间，并能检索到包含相关信息的论文。结果显示，公平性是最频繁引起关注的问题。最不突出的话题是数据隐私（尽管嵌入在大多数文章中），而最突出的是可信度。最后，也成功地获得了有关公共部门中人工智能应用相关问题的有益见解。",
    "tldr": "本文通过回顾过去两年发表的研究论文，结合自然语言处理和文本挖掘的基本概念，捕捉了公共部门中人工智能发展和应用的数据隐私、伦理、可解释性、可信度和公平性等关注点。其中，公平性是最频繁关注的问题，而数据隐私是最不突出的话题。"
}