{
    "title": "Occupational Retirement and Pension Reform: The Roles of Physical and Cognitive Health. (arXiv:2308.13153v1 [econ.GN])",
    "abstract": "Despite increasing cognitive demands of jobs, knowledge about the role of health in retirement has centered on its physical dimensions. This paper estimates a dynamic programming model of retirement that incorporates multiple health dimensions, allowing differential effects on labor supply across occupations. Results show that the effect of cognitive health surges exponentially after age 65, and it explains a notable share of employment declines in cognitively demanding occupations. Under pension reforms, physical constraint mainly impedes manual workers from delaying retirement, whereas cognitive constraint dampens the response of clerical and professional workers. Multidimensional health thus unevenly exacerbate welfare losses across occupations.",
    "link": "http://arxiv.org/abs/2308.13153",
    "context": "Title: Occupational Retirement and Pension Reform: The Roles of Physical and Cognitive Health. (arXiv:2308.13153v1 [econ.GN])\nAbstract: Despite increasing cognitive demands of jobs, knowledge about the role of health in retirement has centered on its physical dimensions. This paper estimates a dynamic programming model of retirement that incorporates multiple health dimensions, allowing differential effects on labor supply across occupations. Results show that the effect of cognitive health surges exponentially after age 65, and it explains a notable share of employment declines in cognitively demanding occupations. Under pension reforms, physical constraint mainly impedes manual workers from delaying retirement, whereas cognitive constraint dampens the response of clerical and professional workers. Multidimensional health thus unevenly exacerbate welfare losses across occupations.",
    "path": "papers/23/08/2308.13153.json",
    "total_tokens": 872,
    "translated_title": "职业退休和养老金改革：身体和认知健康的作用",
    "translated_abstract": "尽管工作对认知要求越来越高，但对健康在退休中的作用的了解主要集中在身体维度上。本文估计了一个动态规划模型，考虑了多个健康维度，在不同职业中对劳动力供应产生不同影响。结果显示，在65岁之后，认知健康的影响呈指数增加，并且它解释了认知要求高的职业就业下降的相当大一部分。在养老金改革下，身体限制主要阻碍了手工工人延迟退休，而认知限制减缓了文职和专业工人的反应。因此，多维健康在不同职业中不平等地加剧了福利损失。",
    "tldr": "本文研究了职业退休和养老金改革中身体和认知健康的作用。结果表明，65岁后认知健康的影响呈指数增加，并且解释了认知要求高的职业就业下降的相当大一部分。在养老金改革下，身体限制主要阻碍了手工工人的延迟退休，而认知限制减缓了文职和专业工人的反应。",
    "en_tdlr": "This study explores the roles of physical and cognitive health in occupational retirement and pension reform. The results indicate that cognitive health has an exponential impact after the age of 65 and explains a significant portion of employment declines in cognitively demanding occupations. Under pension reforms, physical constraints mainly affect manual workers' ability to delay retirement, while cognitive constraints dampen the response of clerical and professional workers."
}