{
    "title": "Class Binarization to NeuroEvolution for Multiclass Classification. (arXiv:2308.13876v1 [cs.LG])",
    "abstract": "Multiclass classification is a fundamental and challenging task in machine learning. The existing techniques of multiclass classification can be categorized as (i) decomposition into binary (ii) extension from binary and (iii) hierarchical classification. Decomposing multiclass classification into a set of binary classifications that can be efficiently solved by using binary classifiers, called class binarization, which is a popular technique for multiclass classification. Neuroevolution, a general and powerful technique for evolving the structure and weights of neural networks, has been successfully applied to binary classification. In this paper, we apply class binarization techniques to a neuroevolution algorithm, NeuroEvolution of Augmenting Topologies (NEAT), that is used to generate neural networks for multiclass classification. We propose a new method that applies Error-Correcting Output Codes (ECOC) to design the class binarization strategies on the neuroevolution for multiclas",
    "link": "http://arxiv.org/abs/2308.13876",
    "context": "Title: Class Binarization to NeuroEvolution for Multiclass Classification. (arXiv:2308.13876v1 [cs.LG])\nAbstract: Multiclass classification is a fundamental and challenging task in machine learning. The existing techniques of multiclass classification can be categorized as (i) decomposition into binary (ii) extension from binary and (iii) hierarchical classification. Decomposing multiclass classification into a set of binary classifications that can be efficiently solved by using binary classifiers, called class binarization, which is a popular technique for multiclass classification. Neuroevolution, a general and powerful technique for evolving the structure and weights of neural networks, has been successfully applied to binary classification. In this paper, we apply class binarization techniques to a neuroevolution algorithm, NeuroEvolution of Augmenting Topologies (NEAT), that is used to generate neural networks for multiclass classification. We propose a new method that applies Error-Correcting Output Codes (ECOC) to design the class binarization strategies on the neuroevolution for multiclas",
    "path": "papers/23/08/2308.13876.json",
    "total_tokens": 740,
    "translated_title": "类别二值化到神经进化的多类别分类",
    "translated_abstract": "多类别分类是机器学习中一项基础且具有挑战性的任务。现有的多类别分类技术可分为三类：(i)将多类别分类分解为二值化分类，使用二值化分类器高效解决。(ii)从二值化分类中扩展而来。(iii)层次分类。本文将类别二值化技术应用于神经进化算法NeuroEvolution of Augmenting Topologies (NEAT)，以生成用于多类别分类的神经网络。我们提出了一种新方法，将纠错输出码 (ECOC) 应用于神经进化算法，用于设计类别二值化策略。",
    "tldr": "本文将类别二值化技术应用于神经进化算法，提出了一种新方法将纠错输出码(ECOC)应用于神经进化算法，用于多类别分类。"
}