{
    "title": "Understanding User Intent Modeling for Conversational Recommender Systems: A Systematic Literature Review. (arXiv:2308.08496v1 [cs.IR])",
    "abstract": "Context: User intent modeling is a crucial process in Natural Language Processing that aims to identify the underlying purpose behind a user's request, enabling personalized responses. With a vast array of approaches introduced in the literature (over 13,000 papers in the last decade), understanding the related concepts and commonly used models in AI-based systems is essential. Method: We conducted a systematic literature review to gather data on models typically employed in designing conversational recommender systems. From the collected data, we developed a decision model to assist researchers in selecting the most suitable models for their systems. Additionally, we performed two case studies to evaluate the effectiveness of our proposed decision model. Results: Our study analyzed 59 distinct models and identified 74 commonly used features. We provided insights into potential model combinations, trends in model selection, quality concerns, evaluation measures, and frequently used dat",
    "link": "http://arxiv.org/abs/2308.08496",
    "context": "Title: Understanding User Intent Modeling for Conversational Recommender Systems: A Systematic Literature Review. (arXiv:2308.08496v1 [cs.IR])\nAbstract: Context: User intent modeling is a crucial process in Natural Language Processing that aims to identify the underlying purpose behind a user's request, enabling personalized responses. With a vast array of approaches introduced in the literature (over 13,000 papers in the last decade), understanding the related concepts and commonly used models in AI-based systems is essential. Method: We conducted a systematic literature review to gather data on models typically employed in designing conversational recommender systems. From the collected data, we developed a decision model to assist researchers in selecting the most suitable models for their systems. Additionally, we performed two case studies to evaluate the effectiveness of our proposed decision model. Results: Our study analyzed 59 distinct models and identified 74 commonly used features. We provided insights into potential model combinations, trends in model selection, quality concerns, evaluation measures, and frequently used dat",
    "path": "papers/23/08/2308.08496.json",
    "total_tokens": 897,
    "translated_title": "理解对话式推荐系统中用户意图建模：一项系统文献综述",
    "translated_abstract": "背景：用户意图建模是自然语言处理中的一个关键过程，旨在识别用户请求背后的潜在目的，从而实现个性化的响应。在过去十年中，文献中引入了大量的方法（超过13,000篇论文），理解人工智能系统中相关概念和常用模型是至关重要的。方法：我们进行了一项系统文献综述，收集了设计对话式推荐系统中通常采用的模型的数据。从收集到的数据中，我们开发了一个决策模型，以帮助研究人员选择最适合其系统的模型。此外，我们进行了两个案例研究，评估我们提出的决策模型的有效性。结果：我们的研究分析了59个不同的模型，并确定了74个常用的特征。我们提供了关于潜在的模型组合、模型选择趋势、质量问题、评估指标以及经常使用的数据的见解。",
    "tldr": "该论文进行了一项系统文献综述，研究了对话式推荐系统中用户意图建模的相关模型和特征。研究结果为研究人员提供了模型选择、质量问题和评估指标等方面的洞察。",
    "en_tdlr": "This paper presents a systematic literature review on user intent modeling in conversational recommender systems, analyzing the models and features commonly used in this field. The study provides insights for researchers in model selection, quality concerns, and evaluation measures."
}