{
    "title": "Imputing Brain Measurements Across Data Sets via Graph Neural Networks. (arXiv:2308.09907v1 [cs.LG])",
    "abstract": "Publicly available data sets of structural MRIs might not contain specific measurements of brain Regions of Interests (ROIs) that are important for training machine learning models. For example, the curvature scores computed by Freesurfer are not released by the Adolescent Brain Cognitive Development (ABCD) Study. One can address this issue by simply reapplying Freesurfer to the data set. However, this approach is generally computationally and labor intensive (e.g., requiring quality control). An alternative is to impute the missing measurements via a deep learning approach. However, the state-of-the-art is designed to estimate randomly missing values rather than entire measurements. We therefore propose to re-frame the imputation problem as a prediction task on another (public) data set that contains the missing measurements and shares some ROI measurements with the data sets of interest. A deep learning model is then trained to predict the missing measurements from the shared ones an",
    "link": "http://arxiv.org/abs/2308.09907",
    "context": "Title: Imputing Brain Measurements Across Data Sets via Graph Neural Networks. (arXiv:2308.09907v1 [cs.LG])\nAbstract: Publicly available data sets of structural MRIs might not contain specific measurements of brain Regions of Interests (ROIs) that are important for training machine learning models. For example, the curvature scores computed by Freesurfer are not released by the Adolescent Brain Cognitive Development (ABCD) Study. One can address this issue by simply reapplying Freesurfer to the data set. However, this approach is generally computationally and labor intensive (e.g., requiring quality control). An alternative is to impute the missing measurements via a deep learning approach. However, the state-of-the-art is designed to estimate randomly missing values rather than entire measurements. We therefore propose to re-frame the imputation problem as a prediction task on another (public) data set that contains the missing measurements and shares some ROI measurements with the data sets of interest. A deep learning model is then trained to predict the missing measurements from the shared ones an",
    "path": "papers/23/08/2308.09907.json",
    "total_tokens": 743,
    "translated_title": "通过图神经网络在数据集之间填补脑部测量值",
    "translated_abstract": "公开可用的结构性MRI数据集可能不包含用于训练机器学习模型的重要脑部感兴趣区域（ROI）的具体测量值。本文提出了使用深度学习方法填补缺失测量值的替代方案，将插补问题重新定义为在包含缺失测量值并与感兴趣的数据集共享某些ROI测量的另一个（公开）数据集上的预测任务。通过训练深度学习模型从共享的测量中预测缺失的测量。",
    "tldr": "本研究提出了一种通过在另一个包含缺失测量值的数据集上进行预测任务，使用图神经网络填补跨数据集脑部测量值的方法。"
}