{
    "title": "Artificial-Intelligence-Based Hybrid Extended Phase Shift Modulation for the Dual Active Bridge Converter with Full ZVS Range and Optimal Efficiency. (arXiv:2308.00381v1 [eess.SY])",
    "abstract": "Dual active bridge (DAB) converter is the key enabler in many popular applications such as wireless charging, electric vehicle and renewable energy. ZVS range and efficiency are two significant performance indicators for DAB converter. To obtain the desired ZVS and efficiency performance, modulation should be carefully designed. Hybrid modulation considers several single modulation strategies to achieve good comprehensive performance. Conventionally, to design a hybrid modulation, harmonic approach or piecewise approach is used, but they suffer from time-consuming model building process and inaccuracy. Therefore, an artificial-intelligence-based hybrid extended phase shift (HEPS) modulation is proposed. Generally, the HEPS modulation is developed in an automated fashion, which alleviates cumbersome model building process while keeping high model accuracy. In HEPS modulation, two EPS strategies are considered to realize optimal efficiency with full ZVS operation over entire operating ra",
    "link": "http://arxiv.org/abs/2308.00381",
    "context": "Title: Artificial-Intelligence-Based Hybrid Extended Phase Shift Modulation for the Dual Active Bridge Converter with Full ZVS Range and Optimal Efficiency. (arXiv:2308.00381v1 [eess.SY])\nAbstract: Dual active bridge (DAB) converter is the key enabler in many popular applications such as wireless charging, electric vehicle and renewable energy. ZVS range and efficiency are two significant performance indicators for DAB converter. To obtain the desired ZVS and efficiency performance, modulation should be carefully designed. Hybrid modulation considers several single modulation strategies to achieve good comprehensive performance. Conventionally, to design a hybrid modulation, harmonic approach or piecewise approach is used, but they suffer from time-consuming model building process and inaccuracy. Therefore, an artificial-intelligence-based hybrid extended phase shift (HEPS) modulation is proposed. Generally, the HEPS modulation is developed in an automated fashion, which alleviates cumbersome model building process while keeping high model accuracy. In HEPS modulation, two EPS strategies are considered to realize optimal efficiency with full ZVS operation over entire operating ra",
    "path": "papers/23/08/2308.00381.json",
    "total_tokens": 920,
    "translated_title": "基于人工智能的混合扩展相移调制对双有源桥变换器的全零电压开关范围和最优效率进行协同控制",
    "translated_abstract": "双有源桥（DAB）变换器是许多流行应用领域（如无线充电、电动汽车和可再生能源）的关键支持技术。DAB变换器的零电压开关范围和效率是两个重要的性能指标。为了达到所需的零电压开关范围和效率，调制必须被精心设计。混合调制考虑了多种单一调制策略，以实现良好的综合性能。传统上，为了设计混合调制，使用谐波方法或分段方法，但它们都存在模型建立过程耗时和不准确的问题。因此，提出了一种基于人工智能的混合扩展相移（HEPS）调制。一般来说，HEPS调制是以自动化方式开发的，它减轻了繁琐的模型建立过程，同时保持了高模型精度。在HEPS调制中，考虑了两种EPS策略，以实现在整个工作范围内的全零电压开关操作和最优效率。",
    "tldr": "本文提出了一种基于人工智能的混合扩展相移调制方法，以实现双有源桥变换器的全零电压开关范围和最优效率。",
    "en_tdlr": "This paper proposes an artificial-intelligence-based hybrid extended phase shift modulation method to achieve full zero voltage switching range and optimal efficiency for dual active bridge converters."
}