{
    "title": "Wirelessly Powered Federated Learning Networks: Joint Power Transfer, Data Sensing, Model Training, and Resource Allocation. (arXiv:2308.04953v1 [cs.NI])",
    "abstract": "Federated learning (FL) has found many successes in wireless networks; however, the implementation of FL has been hindered by the energy limitation of mobile devices (MDs) and the availability of training data at MDs. How to integrate wireless power transfer and mobile crowdsensing towards sustainable FL solutions is a research topic entirely missing from the open literature. This work for the first time investigates a resource allocation problem in collaborative sensing-assisted sustainable FL (S2FL) networks with the goal of minimizing the total completion time. We investigate a practical harvesting-sensing-training-transmitting protocol in which energy-limited MDs first harvest energy from RF signals, use it to gain a reward for user participation, sense the training data from the environment, train the local models at MDs, and transmit the model updates to the server. The total completion time minimization problem of jointly optimizing power transfer, transmit power allocation, dat",
    "link": "http://arxiv.org/abs/2308.04953",
    "context": "Title: Wirelessly Powered Federated Learning Networks: Joint Power Transfer, Data Sensing, Model Training, and Resource Allocation. (arXiv:2308.04953v1 [cs.NI])\nAbstract: Federated learning (FL) has found many successes in wireless networks; however, the implementation of FL has been hindered by the energy limitation of mobile devices (MDs) and the availability of training data at MDs. How to integrate wireless power transfer and mobile crowdsensing towards sustainable FL solutions is a research topic entirely missing from the open literature. This work for the first time investigates a resource allocation problem in collaborative sensing-assisted sustainable FL (S2FL) networks with the goal of minimizing the total completion time. We investigate a practical harvesting-sensing-training-transmitting protocol in which energy-limited MDs first harvest energy from RF signals, use it to gain a reward for user participation, sense the training data from the environment, train the local models at MDs, and transmit the model updates to the server. The total completion time minimization problem of jointly optimizing power transfer, transmit power allocation, dat",
    "path": "papers/23/08/2308.04953.json",
    "total_tokens": 953,
    "translated_title": "无线供电联合学习网络：联合功率传输、数据感知、模型训练和资源分配",
    "translated_abstract": "联合学习（FL）在无线网络中取得了许多成功，然而，FL的实施受到移动设备（MDs）的能源限制和MDs上训练数据的可用性的限制。如何将无线能量传输和移动众包感知整合到可持续的FL解决方案中，是开放文献中完全缺失的研究课题。本文首次研究了协作感知辅助可持续FL（S2FL）网络中的资源分配问题，旨在最小化总完成时间。我们研究了一种实用的采集-感知-训练-传输协议，在这个协议中，能量有限的MDs首先从射频信号中收集能量，用来奖励用户参与，从环境中感知训练数据，在MDs上训练本地模型，并将模型更新传输给服务器。我们通过联合优化功率传输、传输功率分配、数据感知，以及模型训练参数等方式来最小化总完成时间。",
    "tldr": "本论文研究了无线供电联合学习网络中的资源分配问题，提出了一种实用的采集-感知-训练-传输协议，并通过联合优化功率传输、传输功率分配、数据感知和模型训练参数等方式来最小化总完成时间。",
    "en_tdlr": "This paper investigates the resource allocation problem in wirelessly powered federated learning networks and proposes a practical harvest-sensing-training-transmitting protocol to minimize the total completion time. By jointly optimizing power transfer, transmit power allocation, data sensing, and model training parameters, the research aims to achieve sustainable and efficient federated learning."
}