{
    "title": "Multimodal Pretrained Models for Sequential Decision-Making: Synthesis, Verification, Grounding, and Perception. (arXiv:2308.05295v1 [cs.AI])",
    "abstract": "Recently developed pretrained models can encode rich world knowledge expressed in multiple modalities, such as text and images. However, the outputs of these models cannot be integrated into algorithms to solve sequential decision-making tasks. We develop an algorithm that utilizes the knowledge from pretrained models to construct and verify controllers for sequential decision-making tasks, and to ground these controllers to task environments through visual observations. In particular, the algorithm queries a pretrained model with a user-provided, text-based task description and uses the model's output to construct an automaton-based controller that encodes the model's task-relevant knowledge. It then verifies whether the knowledge encoded in the controller is consistent with other independently available knowledge, which may include abstract information on the environment or user-provided specifications. If this verification step discovers any inconsistency, the algorithm automaticall",
    "link": "http://arxiv.org/abs/2308.05295",
    "context": "Title: Multimodal Pretrained Models for Sequential Decision-Making: Synthesis, Verification, Grounding, and Perception. (arXiv:2308.05295v1 [cs.AI])\nAbstract: Recently developed pretrained models can encode rich world knowledge expressed in multiple modalities, such as text and images. However, the outputs of these models cannot be integrated into algorithms to solve sequential decision-making tasks. We develop an algorithm that utilizes the knowledge from pretrained models to construct and verify controllers for sequential decision-making tasks, and to ground these controllers to task environments through visual observations. In particular, the algorithm queries a pretrained model with a user-provided, text-based task description and uses the model's output to construct an automaton-based controller that encodes the model's task-relevant knowledge. It then verifies whether the knowledge encoded in the controller is consistent with other independently available knowledge, which may include abstract information on the environment or user-provided specifications. If this verification step discovers any inconsistency, the algorithm automaticall",
    "path": "papers/23/08/2308.05295.json",
    "total_tokens": 850,
    "translated_title": "多模态预训练模型用于序列决策：综合、验证、基础和感知",
    "translated_abstract": "最近开发的预训练模型可以编码以多种形式表达的丰富世界知识，例如文本和图像。然而，这些模型的输出不能集成到解决序列决策任务的算法中。我们开发了一种算法，利用预训练模型的知识来构建和验证序列决策任务的控制器，并通过视觉观测将这些控制器与任务环境相连接。具体而言，该算法通过用户提供的基于文本的任务描述查询预训练模型，并使用模型的输出构建基于自动机的控制器，以编码模型的任务相关知识。然后，它验证控制器中编码的知识是否与其他独立可用的知识一致，这些知识可能包括环境的抽象信息或用户提供的规范。如果验证步骤发现任何不一致性，算法会自动纠正并重新验证，直到所有知识一致。",
    "tldr": "该论文介绍了一种利用预训练模型的知识来解决序列决策任务的算法，通过构建和验证控制器，并通过视觉观测来与任务环境相连接。",
    "en_tdlr": "This paper presents an algorithm that utilizes knowledge from pretrained models to address sequential decision-making tasks by constructing and verifying controllers and connecting them to task environments through visual observations."
}