{
    "title": "CktGNN: Circuit Graph Neural Network for Electronic Design Automation. (arXiv:2308.16406v1 [cs.LG])",
    "abstract": "The electronic design automation of analog circuits has been a longstanding challenge in the integrated circuit field due to the huge design space and complex design trade-offs among circuit specifications. In the past decades, intensive research efforts have mostly been paid to automate the transistor sizing with a given circuit topology. By recognizing the graph nature of circuits, this paper presents a Circuit Graph Neural Network (CktGNN) that simultaneously automates the circuit topology generation and device sizing based on the encoder-dependent optimization subroutines. Particularly, CktGNN encodes circuit graphs using a two-level GNN framework (of nested GNN) where circuits are represented as combinations of subgraphs in a known subgraph basis. In this way, it significantly improves design efficiency by reducing the number of subgraphs to perform message passing. Nonetheless, another critical roadblock to advancing learning-assisted circuit design automation is a lack of public",
    "link": "http://arxiv.org/abs/2308.16406",
    "context": "Title: CktGNN: Circuit Graph Neural Network for Electronic Design Automation. (arXiv:2308.16406v1 [cs.LG])\nAbstract: The electronic design automation of analog circuits has been a longstanding challenge in the integrated circuit field due to the huge design space and complex design trade-offs among circuit specifications. In the past decades, intensive research efforts have mostly been paid to automate the transistor sizing with a given circuit topology. By recognizing the graph nature of circuits, this paper presents a Circuit Graph Neural Network (CktGNN) that simultaneously automates the circuit topology generation and device sizing based on the encoder-dependent optimization subroutines. Particularly, CktGNN encodes circuit graphs using a two-level GNN framework (of nested GNN) where circuits are represented as combinations of subgraphs in a known subgraph basis. In this way, it significantly improves design efficiency by reducing the number of subgraphs to perform message passing. Nonetheless, another critical roadblock to advancing learning-assisted circuit design automation is a lack of public",
    "path": "papers/23/08/2308.16406.json",
    "total_tokens": 853,
    "translated_title": "CktGNN：用于电子设计自动化的电路图神经网络",
    "translated_abstract": "由于巨大的设计空间和复杂的设计权衡，模拟电路的电子设计自动化一直是集成电路领域的一个长期挑战。在过去的几十年中，人们大多数关注于在给定电路拓扑的情况下自动调整晶体管尺寸。通过识别电路的图形特性，本文提出了一种电路图神经网络(CktGNN)，它基于编码器依赖的优化子程序，同时自动化电路拓扑生成和器件尺寸调整。特别是，CktGNN使用两级GNN框架（嵌套GNN）对电路图进行编码，其中电路表示为已知子图基础上的子图组合。通过这种方式，它通过减少子图数量来显著提高设计效率以执行消息传递。",
    "tldr": "本文提出了一种名为CktGNN的电路图神经网络，通过识别电路的图形特性，同时自动化电路拓扑生成和器件尺寸调整。它使用两级GNN框架对电路图进行编码，并在设计效率上取得了显著的提升。"
}