{
    "title": "MSLE: An ontology for Materials Science Laboratory Equipment. Large-Scale Devices for Materials Characterization. (arXiv:2308.07325v1 [cs.AI])",
    "abstract": "This paper introduces a new ontology for Materials Science Laboratory Equipment, termed MSLE. A fundamental issue with materials science laboratory (hereafter lab) equipment in the real world is that scientists work with various types of equipment with multiple specifications. For example, there are many electron microscopes with different parameters in chemical and physical labs. A critical development to unify the description is to build an equipment domain ontology as basic semantic knowledge and to guide the user to work with the equipment appropriately. Here, we propose to develop a consistent ontology for equipment, the MSLE ontology. In the MSLE, two main existing ontologies, the Semantic Sensor Network (SSN) and the Material Vocabulary (MatVoc), have been integrated into the MSLE core to build a coherent ontology. Since various acronyms and terms have been used for equipment, this paper proposes an approach to use a Simple Knowledge Organization System (SKOS) to represent the h",
    "link": "http://arxiv.org/abs/2308.07325",
    "context": "Title: MSLE: An ontology for Materials Science Laboratory Equipment. Large-Scale Devices for Materials Characterization. (arXiv:2308.07325v1 [cs.AI])\nAbstract: This paper introduces a new ontology for Materials Science Laboratory Equipment, termed MSLE. A fundamental issue with materials science laboratory (hereafter lab) equipment in the real world is that scientists work with various types of equipment with multiple specifications. For example, there are many electron microscopes with different parameters in chemical and physical labs. A critical development to unify the description is to build an equipment domain ontology as basic semantic knowledge and to guide the user to work with the equipment appropriately. Here, we propose to develop a consistent ontology for equipment, the MSLE ontology. In the MSLE, two main existing ontologies, the Semantic Sensor Network (SSN) and the Material Vocabulary (MatVoc), have been integrated into the MSLE core to build a coherent ontology. Since various acronyms and terms have been used for equipment, this paper proposes an approach to use a Simple Knowledge Organization System (SKOS) to represent the h",
    "path": "papers/23/08/2308.07325.json",
    "total_tokens": 909,
    "translated_title": "MSLE：一种用于材料科学实验室设备的本体论。用于材料表征的大规模设备。",
    "translated_abstract": "本论文介绍了一种用于材料科学实验室设备的新本体论，称为MSLE。现实世界中材料科学实验室设备的一个基本问题是科学家们使用各种类型和多个规格的设备。例如，在化学和物理实验室中有许多具有不同参数的电子显微镜。统一描述的一个关键发展是建立一个设备领域本体论作为基本的语义知识，并指导用户适当地使用设备。在这里，我们提议开发一种一致的设备本体论，即MSLE本体论。在MSLE中，将两个主要的现有本体论，语义传感器网络（SSN）和材料词汇（MatVoc），集成到MSLE核心中以建立一个一致的本体论。由于设备使用了各种缩写词和术语，本论文提出了使用简单知识组织系统（SKOS）来表示将这些表示处理成本体论术语的方法。",
    "tldr": "本论文提出了一种用于材料科学实验室设备的新本体论MSLE，通过整合现有的本体论，建立一个一致的设备描述，为科学家们提供指导，解决了多种设备类型和规格的统一描述问题。",
    "en_tdlr": "This paper presents a new ontology MSLE for materials science laboratory equipment, which integrates existing ontologies to establish a consistent equipment description, providing guidance for scientists and addressing the issue of unifying the description of various equipment types and specifications."
}