{
    "title": "Ideological Ambiguity and Political Spectrum. (arXiv:2308.05912v1 [econ.GN])",
    "abstract": "This study examines the relationship between ambiguity and the ideological positioning of political parties across the political spectrum. We identify a strong non-monotonic (inverted U-shaped) relationship between party ideology and ambiguity within a sample of 202 European political parties. This pattern is observed across all ideological dimensions covered in the data. To explain this pattern, we propose a novel theory that suggests centrist parties are perceived as less risky by voters compared to extremist parties, giving them an advantage in employing ambiguity to attract more voters at a lower cost. We support our explanation with additional evidence from electoral outcomes and economic indicators in the respective party countries.",
    "link": "http://arxiv.org/abs/2308.05912",
    "context": "Title: Ideological Ambiguity and Political Spectrum. (arXiv:2308.05912v1 [econ.GN])\nAbstract: This study examines the relationship between ambiguity and the ideological positioning of political parties across the political spectrum. We identify a strong non-monotonic (inverted U-shaped) relationship between party ideology and ambiguity within a sample of 202 European political parties. This pattern is observed across all ideological dimensions covered in the data. To explain this pattern, we propose a novel theory that suggests centrist parties are perceived as less risky by voters compared to extremist parties, giving them an advantage in employing ambiguity to attract more voters at a lower cost. We support our explanation with additional evidence from electoral outcomes and economic indicators in the respective party countries.",
    "path": "papers/23/08/2308.05912.json",
    "total_tokens": 837,
    "translated_title": "意识形态模糊与政治光谱的关系",
    "translated_abstract": "本研究探讨了政党意识形态与模糊性在政治光谱上的关系。我们在202个欧洲政党的样本中发现，政党意识形态与模糊性之间存在着强烈的非单调（倒U型）关系。这种模式在数据所涵盖的所有意识形态维度上都有观察到。为了解释这种模式，我们提出了一个新理论，认为相比极端主义政党，中间派政党被选民视为风险较小，因此在利用模糊性吸引更多选民时具有更大的优势。我们通过选举结果和各个政党所在国家的经济指标提供了额外的证据来支持我们的解释。",
    "tldr": "本研究发现在政治光谱上，政党意识形态与模糊性之间存在着强烈的非单调关系。中间派政党相比极端主义政党被选民视为风险较小，因此它们更容易利用模糊性吸引更多选民。这一结论得到了选举结果和各个政党所在国家的经济指标的支持。"
}