{
    "title": "Entrepreneurial Higher Education Education, Knowledge and Wealth Creation. (arXiv:2308.08808v1 [econ.GN])",
    "abstract": "This book presents detailed discussion on the role of higher education in terms of serving basic knowledge creation, teaching, and doing applied research for commercialization. The book presents an historical account on how this challenge was addressed earlier in education history, the cases of successful academic commercialization, the marriage between basic and applied science and how universities develop economies of the regions and countries. This book also discusses cultural and social challenges in research commercialization and pathways to break the status quo.",
    "link": "http://arxiv.org/abs/2308.08808",
    "context": "Title: Entrepreneurial Higher Education Education, Knowledge and Wealth Creation. (arXiv:2308.08808v1 [econ.GN])\nAbstract: This book presents detailed discussion on the role of higher education in terms of serving basic knowledge creation, teaching, and doing applied research for commercialization. The book presents an historical account on how this challenge was addressed earlier in education history, the cases of successful academic commercialization, the marriage between basic and applied science and how universities develop economies of the regions and countries. This book also discusses cultural and social challenges in research commercialization and pathways to break the status quo.",
    "path": "papers/23/08/2308.08808.json",
    "total_tokens": 652,
    "translated_title": "企业家式高等教育：教育、知识与财富创造",
    "translated_abstract": "本书详细讨论了高等教育在基础知识创造、教学和应用研究以商业化方面的作用。本书提供了教育历史上如何解决这一挑战，成功的学术商业化案例，基础科学与应用科学的结合以及大学如何发展地区和国家经济的历史账户。本书还讨论了研究商业化中的文化和社会挑战，以及打破现状的途径。",
    "tldr": "这本书讨论了高等教育在知识创造、教学和应用研究方面的角色，并分析了成功的学术商业化案例以及大学如何推动地区和国家的经济发展。",
    "en_tdlr": "This book discusses the role of higher education in knowledge creation, teaching, and applied research, and analyzes successful cases of academic commercialization as well as how universities drive regional and national economic development."
}