{
    "title": "The $10 Million ANA Avatar XPRIZE Competition Advanced Immersive Telepresence Systems. (arXiv:2308.07878v1 [cs.RO])",
    "abstract": "The $10M ANA Avatar XPRIZE aimed to create avatar systems that can transport human presence to remote locations in real time. The participants of this multi-year competition developed robotic systems that allow operators to see, hear, and interact with a remote environment in a way that feels as if they are truly there. On the other hand, people in the remote environment were given the impression that the operator was present inside the avatar robot. At the competition finals, held in November 2022 in Long Beach, CA, USA, the avatar systems were evaluated on their support for remotely interacting with humans, exploring new environments, and employing specialized skills. This article describes the competition stages with tasks and evaluation procedures, reports the results, presents the winning teams' approaches, and discusses lessons learned.",
    "link": "http://arxiv.org/abs/2308.07878",
    "context": "Title: The $10 Million ANA Avatar XPRIZE Competition Advanced Immersive Telepresence Systems. (arXiv:2308.07878v1 [cs.RO])\nAbstract: The $10M ANA Avatar XPRIZE aimed to create avatar systems that can transport human presence to remote locations in real time. The participants of this multi-year competition developed robotic systems that allow operators to see, hear, and interact with a remote environment in a way that feels as if they are truly there. On the other hand, people in the remote environment were given the impression that the operator was present inside the avatar robot. At the competition finals, held in November 2022 in Long Beach, CA, USA, the avatar systems were evaluated on their support for remotely interacting with humans, exploring new environments, and employing specialized skills. This article describes the competition stages with tasks and evaluation procedures, reports the results, presents the winning teams' approaches, and discusses lessons learned.",
    "path": "papers/23/08/2308.07878.json",
    "total_tokens": 850,
    "translated_title": "1000万美元的ANA Avatar XPRIZE竞赛先进的沉浸式远程交互系统",
    "translated_abstract": "1000万美元的ANA Avatar XPRIZE旨在创建能够实时传送人类存在感到远程位置的化身系统。这个多年的竞赛中，参与者开发了机器人系统，使运营者能够以真实存在的方式在远程环境中看到、听到和交互。另一方面，远程环境中的人们会觉得操作者就在化身机器人内。在2022年11月于美国加利福尼亚州长滩举行的竞赛决赛中，化身系统根据其对远程与人类进行互动的支持、探索新环境以及使用专业技能进行评估。本文描述了竞赛阶段的任务和评估程序，报告了结果，介绍了获胜团队的方法，并讨论了所得到的经验教训。",
    "tldr": "1000万美元的ANA Avatar XPRIZE竞赛旨在开发能够实时传送人类存在感到远程位置的化身系统。竞赛决赛中，参与者展示了对远程与人类进行互动的支持、探索新环境以及使用专业技能的能力。",
    "en_tdlr": "The $10 million ANA Avatar XPRIZE aimed to create avatar systems that can transport human presence to remote locations in real time. At the competition finals, the participants demonstrated their ability to support remote interaction with humans, explore new environments, and employ specialized skills."
}