{
    "title": "Measuring income inequality via percentile relativities. (arXiv:2308.03708v1 [stat.ME])",
    "abstract": "\"The rich are getting richer\" implies that the population income distributions are getting more right skewed and heavily tailed. For such distributions, the mean is not the best measure of the center, but the classical indices of income inequality, including the celebrated Gini index, are all mean-based. In view of this, Professor Gastwirth sounded an alarm back in 2014 by suggesting to incorporate the median into the definition of the Gini index, although noted a few shortcomings of his proposed index. In the present paper we make a further step in the modification of classical indices and, to acknowledge the possibility of differing viewpoints, arrive at three median-based indices of inequality. They avoid the shortcomings of the previous indices and can be used even when populations are ultra heavily tailed, that is, when their first moments are infinite. The new indices are illustrated both analytically and numerically using parametric families of income distributions, and further ",
    "link": "http://arxiv.org/abs/2308.03708",
    "context": "Title: Measuring income inequality via percentile relativities. (arXiv:2308.03708v1 [stat.ME])\nAbstract: \"The rich are getting richer\" implies that the population income distributions are getting more right skewed and heavily tailed. For such distributions, the mean is not the best measure of the center, but the classical indices of income inequality, including the celebrated Gini index, are all mean-based. In view of this, Professor Gastwirth sounded an alarm back in 2014 by suggesting to incorporate the median into the definition of the Gini index, although noted a few shortcomings of his proposed index. In the present paper we make a further step in the modification of classical indices and, to acknowledge the possibility of differing viewpoints, arrive at three median-based indices of inequality. They avoid the shortcomings of the previous indices and can be used even when populations are ultra heavily tailed, that is, when their first moments are infinite. The new indices are illustrated both analytically and numerically using parametric families of income distributions, and further ",
    "path": "papers/23/08/2308.03708.json",
    "total_tokens": 878,
    "translated_title": "通过百分位相对性度量收入不平等",
    "translated_abstract": "“富人越来越富”暗示着人口收入分布正变得更加右偏和重尾。对于这种分布，均值并不是中心的最佳衡量指标，但传统的收入不平等指标，包括著名的基尼系数，都是基于均值的。鉴于此，2014年，Gastwirth教授发出了警报，建议将中位数纳入基尼系数的定义中，尽管他提出的指标存在一些缺陷。在本文中，我们在修改传统指标的基础上更进一步，并考虑了不同观点的可能性，提出了三个基于中位数的不平等指数。它们避免了以前指数的缺点，并且即使是在人口分布超重尾的情况下（即它们的一阶矩是无穷大的情况下），也可以使用这些指数。通过使用参数化的收入分布的解析和数值实例对这些新指数进行了说明，进一步证明了其有效性。",
    "tldr": "本文通过修改传统指标，在考虑不同观点的基础上，提出了三个基于中位数的收入不平等指数。这些指数避免了以前指数的缺点，并可以在人口分布重尾的情况下使用。",
    "en_tdlr": "This paper proposes three median-based income inequality indices that address the shortcomings of traditional indices and can be used for heavily tailed income distributions."
}