{
    "title": "Quantification of Predictive Uncertainty via Inference-Time Sampling. (arXiv:2308.01731v1 [cs.LG])",
    "abstract": "Predictive variability due to data ambiguities has typically been addressed via construction of dedicated models with built-in probabilistic capabilities that are trained to predict uncertainty estimates as variables of interest. These approaches require distinct architectural components and training mechanisms, may include restrictive assumptions and exhibit overconfidence, i.e., high confidence in imprecise predictions. In this work, we propose a post-hoc sampling strategy for estimating predictive uncertainty accounting for data ambiguity. The method can generate different plausible outputs for a given input and does not assume parametric forms of predictive distributions. It is architecture agnostic and can be applied to any feed-forward deterministic network without changes to the architecture or training procedure. Experiments on regression tasks on imaging and non-imaging input data show the method's ability to generate diverse and multi-modal predictive distributions, and a des",
    "link": "http://arxiv.org/abs/2308.01731",
    "context": "Title: Quantification of Predictive Uncertainty via Inference-Time Sampling. (arXiv:2308.01731v1 [cs.LG])\nAbstract: Predictive variability due to data ambiguities has typically been addressed via construction of dedicated models with built-in probabilistic capabilities that are trained to predict uncertainty estimates as variables of interest. These approaches require distinct architectural components and training mechanisms, may include restrictive assumptions and exhibit overconfidence, i.e., high confidence in imprecise predictions. In this work, we propose a post-hoc sampling strategy for estimating predictive uncertainty accounting for data ambiguity. The method can generate different plausible outputs for a given input and does not assume parametric forms of predictive distributions. It is architecture agnostic and can be applied to any feed-forward deterministic network without changes to the architecture or training procedure. Experiments on regression tasks on imaging and non-imaging input data show the method's ability to generate diverse and multi-modal predictive distributions, and a des",
    "path": "papers/23/08/2308.01731.json",
    "total_tokens": 831,
    "translated_title": "通过推断时间采样量化预测不确定性",
    "translated_abstract": "由于数据模糊性而导致的预测变异性通常通过构建具有内置概率能力的专用模型来解决，这些模型被训练以预测不确定性估计作为感兴趣的变量。这些方法需要不同的结构组件和训练机制，可能包含限制性的假设并表现出过于自信，即对不精确预测的高置信度。在这项工作中，我们提出了一种后续采样策略，用于估计考虑数据模糊性的预测不确定性。该方法可以为给定的输入生成不同的合理输出，并且不假设预测分布的参数形式。它是架构不可知的，并且可以应用于任何前馈确定性网络，而无需对架构或训练过程进行更改。在图像和非图像输入数据上的回归任务实验显示该方法生成多样化和多模态的预测分布的能力，以及-",
    "tldr": "该论文提出了一种后续采样策略，用于估计考虑数据模糊性的预测不确定性，可以生成不同的合理输出，并且不假设预测分布的参数形式。",
    "en_tdlr": "This paper proposes a post-hoc sampling strategy for estimating predictive uncertainty accounting for data ambiguity, which can generate different plausible outputs without assuming parametric forms of predictive distributions."
}