{
    "title": "Grandma Karl is 27 years old -- research agenda for pseudonymization of research data. (arXiv:2308.16109v1 [cs.CL])",
    "abstract": "Accessibility of research data is critical for advances in many research fields, but textual data often cannot be shared due to the personal and sensitive information which it contains, e.g names or political opinions. General Data Protection Regulation (GDPR) suggests pseudonymization as a solution to secure open access to research data, but we need to learn more about pseudonymization as an approach before adopting it for manipulation of research data. This paper outlines a research agenda within pseudonymization, namely need of studies into the effects of pseudonymization on unstructured data in relation to e.g. readability and language assessment, as well as the effectiveness of pseudonymization as a way of protecting writer identity, while also exploring different ways of developing context-sensitive algorithms for detection, labelling and replacement of personal information in unstructured data. The recently granted project on pseudonymization Grandma Karl is 27 years old address",
    "link": "http://arxiv.org/abs/2308.16109",
    "context": "Title: Grandma Karl is 27 years old -- research agenda for pseudonymization of research data. (arXiv:2308.16109v1 [cs.CL])\nAbstract: Accessibility of research data is critical for advances in many research fields, but textual data often cannot be shared due to the personal and sensitive information which it contains, e.g names or political opinions. General Data Protection Regulation (GDPR) suggests pseudonymization as a solution to secure open access to research data, but we need to learn more about pseudonymization as an approach before adopting it for manipulation of research data. This paper outlines a research agenda within pseudonymization, namely need of studies into the effects of pseudonymization on unstructured data in relation to e.g. readability and language assessment, as well as the effectiveness of pseudonymization as a way of protecting writer identity, while also exploring different ways of developing context-sensitive algorithms for detection, labelling and replacement of personal information in unstructured data. The recently granted project on pseudonymization Grandma Karl is 27 years old address",
    "path": "papers/23/08/2308.16109.json",
    "total_tokens": 927,
    "translated_title": "Grandma Karl今年27岁——研究匿名化研究数据的议程",
    "translated_abstract": "研究数据的可访问性对于许多研究领域的进展至关重要，但由于其中包含个人和敏感信息（如姓名或政治观点），文本数据通常不能被共享。《通用数据保护条例》（GDPR）建议使用假名化作为一种解决方案，以确保对研究数据的开放访问的安全性，但在采用假名化方法处理研究数据之前，我们需要更多地了解假名化。本文概述了一个关于假名化的研究议程，包括对无结构化数据中假名化对可读性和语言评估等影响的研究需求，以及假名化作为保护作者身份的方式的有效性，并探讨了开发上下文敏感算法用于检测、标记和替换无结构化数据中个人信息的不同方法。最近获得的关于假名化的项目“Grandma Karl今年27岁”解决了其中一部分议程。",
    "tldr": "研究数据的共享面临个人和敏感信息保护的问题，该论文提出了一个关于假名化的研究议程，包括对假名化对无结构化数据的影响，假名化作为保护作者身份的有效性，以及开发上下文敏感算法用于处理个人信息。"
}