{
    "title": "RSpell: Retrieval-augmented Framework for Domain Adaptive Chinese Spelling Check. (arXiv:2308.08176v1 [cs.CL])",
    "abstract": "Chinese Spelling Check (CSC) refers to the detection and correction of spelling errors in Chinese texts. In practical application scenarios, it is important to make CSC models have the ability to correct errors across different domains. In this paper, we propose a retrieval-augmented spelling check framework called RSpell, which searches corresponding domain terms and incorporates them into CSC models. Specifically, we employ pinyin fuzzy matching to search for terms, which are combined with the input and fed into the CSC model. Then, we introduce an adaptive process control mechanism to dynamically adjust the impact of external knowledge on the model. Additionally, we develop an iterative strategy for the RSpell framework to enhance reasoning capabilities. We conducted experiments on CSC datasets in three domains: law, medicine, and official document writing. The results demonstrate that RSpell achieves state-of-the-art performance in both zero-shot and fine-tuning scenarios, demonstr",
    "link": "http://arxiv.org/abs/2308.08176",
    "context": "Title: RSpell: Retrieval-augmented Framework for Domain Adaptive Chinese Spelling Check. (arXiv:2308.08176v1 [cs.CL])\nAbstract: Chinese Spelling Check (CSC) refers to the detection and correction of spelling errors in Chinese texts. In practical application scenarios, it is important to make CSC models have the ability to correct errors across different domains. In this paper, we propose a retrieval-augmented spelling check framework called RSpell, which searches corresponding domain terms and incorporates them into CSC models. Specifically, we employ pinyin fuzzy matching to search for terms, which are combined with the input and fed into the CSC model. Then, we introduce an adaptive process control mechanism to dynamically adjust the impact of external knowledge on the model. Additionally, we develop an iterative strategy for the RSpell framework to enhance reasoning capabilities. We conducted experiments on CSC datasets in three domains: law, medicine, and official document writing. The results demonstrate that RSpell achieves state-of-the-art performance in both zero-shot and fine-tuning scenarios, demonstr",
    "path": "papers/23/08/2308.08176.json",
    "total_tokens": 939,
    "translated_title": "RSpell：用于领域适应的中文拼写检查的检索增强框架",
    "translated_abstract": "中文拼写检查（CSC）是指在中文文本中检测和纠正拼写错误。在实际应用场景中，使CSC模型具备跨领域纠错能力非常重要。在本文中，我们提出了一种称为RSpell的检索增强拼写检查框架，该框架搜索相应的领域术语并将其整合到CSC模型中。具体而言，我们采用拼音模糊匹配来搜索术语，并将其与输入组合后输入到CSC模型中。然后，我们引入了一种自适应过程控制机制，动态调整外部知识对模型的影响。此外，我们还开发了一种迭代策略，用于增强RSpell框架的推理能力。我们在法律、医学和公文写作三个领域的CSC数据集上进行了实验证明，RSpell在零样本和微调场景下都能达到最先进的性能水平。",
    "tldr": "RSpell是一种用于中文拼写检查的检索增强框架，它使用拼音模糊匹配来搜索领域术语，并将其整合到CSC模型中。通过引入自适应过程控制机制和迭代策略，RSpell在零样本和微调场景下都能达到最先进的性能水平。",
    "en_tdlr": "RSpell is a retrieval-augmented framework for Chinese spelling check that uses pinyin fuzzy matching to search domain terms and incorporates them into the CSC model. With the introduction of an adaptive process control mechanism and an iterative strategy, RSpell achieves state-of-the-art performance in both zero-shot and fine-tuning scenarios."
}