{
    "title": "Deep graphical regression for jointly moderate and extreme Australian wildfires. (arXiv:2308.14547v1 [stat.AP])",
    "abstract": "Recent wildfires in Australia have led to considerable economic loss and property destruction, and there is increasing concern that climate change may exacerbate their intensity, duration, and frequency. hazard quantification for extreme wildfires is an important component of wildfire management, as it facilitates efficient resource distribution, adverse effect mitigation, and recovery efforts. However, although extreme wildfires are typically the most impactful, both small and moderate fires can still be devastating to local communities and ecosystems. Therefore, it is imperative to develop robust statistical methods to reliably model the full distribution of wildfire spread. We do so for a novel dataset of Australian wildfires from 1999 to 2019, and analyse monthly spread over areas approximately corresponding to Statistical Areas Level 1 and 2 (SA1/SA2) regions. Given the complex nature of wildfire ignition and spread, we exploit recent advances in statistical deep learning and extr",
    "link": "http://arxiv.org/abs/2308.14547",
    "context": "Title: Deep graphical regression for jointly moderate and extreme Australian wildfires. (arXiv:2308.14547v1 [stat.AP])\nAbstract: Recent wildfires in Australia have led to considerable economic loss and property destruction, and there is increasing concern that climate change may exacerbate their intensity, duration, and frequency. hazard quantification for extreme wildfires is an important component of wildfire management, as it facilitates efficient resource distribution, adverse effect mitigation, and recovery efforts. However, although extreme wildfires are typically the most impactful, both small and moderate fires can still be devastating to local communities and ecosystems. Therefore, it is imperative to develop robust statistical methods to reliably model the full distribution of wildfire spread. We do so for a novel dataset of Australian wildfires from 1999 to 2019, and analyse monthly spread over areas approximately corresponding to Statistical Areas Level 1 and 2 (SA1/SA2) regions. Given the complex nature of wildfire ignition and spread, we exploit recent advances in statistical deep learning and extr",
    "path": "papers/23/08/2308.14547.json",
    "total_tokens": 987,
    "translated_title": "深度图形回归用于联合调节和极端澳大利亚野火",
    "translated_abstract": "澳大利亚最近的野火造成了巨大的经济损失和财产破坏，人们越来越担心气候变化可能加剧其强度、持续时间和频率。对于极端野火的灾害评估是野火管理的重要组成部分，它有助于资源分配的高效性、负面影响的减轻和恢复工作的开展。然而，虽然极端野火通常具有最大的影响力，但小规模和中等规模的火灾仍然可以对当地社区和生态系统造成毁灭性的影响。因此，我们迫切需要开发稳健的统计方法来可靠地建模野火的全分布。我们对1999年至2019年的澳大利亚野火进行了新的数据集分析，并分析了大约相当于统计区域层次1和层次2（SA1/SA2）区域的火灾月度蔓延。鉴于野火点燃和蔓延的复杂性，我们利用了统计深度学习和外部信息的最新进展。",
    "tldr": "该论文介绍了一种利用深度图形回归方法来联合调节和预测澳大利亚野火的新方法。研究结果表明，对于火灾的全分布建模是非常关键的，因为极端野火可能导致巨大的影响，而小规模和中等规模火灾仍然会对当地社区和生态系统造成重大破坏。"
}