{
    "title": "Target Search and Navigation in Heterogeneous Robot Systems with Deep Reinforcement Learning. (arXiv:2308.00331v1 [cs.RO])",
    "abstract": "Collaborative heterogeneous robot systems can greatly improve the efficiency of target search and navigation tasks. In this paper, we design a heterogeneous robot system consisting of a UAV and a UGV for search and rescue missions in unknown environments. The system is able to search for targets and navigate to them in a maze-like mine environment with the policies learned through deep reinforcement learning algorithms. During the training process, if two robots are trained simultaneously, the rewards related to their collaboration may not be properly obtained. Hence, we introduce a multi-stage reinforcement learning framework and a curiosity module to encourage agents to explore unvisited environments. Experiments in simulation environments show that our framework can train the heterogeneous robot system to achieve the search and navigation with unknown target locations while existing baselines may not, and accelerate the training speed.",
    "link": "http://arxiv.org/abs/2308.00331",
    "context": "Title: Target Search and Navigation in Heterogeneous Robot Systems with Deep Reinforcement Learning. (arXiv:2308.00331v1 [cs.RO])\nAbstract: Collaborative heterogeneous robot systems can greatly improve the efficiency of target search and navigation tasks. In this paper, we design a heterogeneous robot system consisting of a UAV and a UGV for search and rescue missions in unknown environments. The system is able to search for targets and navigate to them in a maze-like mine environment with the policies learned through deep reinforcement learning algorithms. During the training process, if two robots are trained simultaneously, the rewards related to their collaboration may not be properly obtained. Hence, we introduce a multi-stage reinforcement learning framework and a curiosity module to encourage agents to explore unvisited environments. Experiments in simulation environments show that our framework can train the heterogeneous robot system to achieve the search and navigation with unknown target locations while existing baselines may not, and accelerate the training speed.",
    "path": "papers/23/08/2308.00331.json",
    "total_tokens": 879,
    "translated_title": "异构机器人系统中的目标搜索和导航与深度强化学习",
    "translated_abstract": "协作的异构机器人系统可以大大提高目标搜索和导航任务的效率。本文设计了一个由无人机和无人车组成的异构机器人系统，用于在未知环境中进行搜索和救援任务。该系统能够通过深度强化学习算法学习出的策略在类似迷宫的矿井环境中搜索目标并导航到目标位置。在训练过程中，如果同时训练两个机器人，可能无法正确获得与协作相关的奖励。因此，我们引入了一个多阶段强化学习框架和一个好奇模块来鼓励智能体探索未访问的环境。在模拟环境中的实验表明，我们的框架能够训练出异构机器人系统实现未知目标位置的搜索和导航，而现有的基线方法可能无法做到，并且加速了训练速度。",
    "tldr": "本文设计了一个异构机器人系统，通过深度强化学习算法学习出的策略能够在迷宫般的矿井环境中搜索并导航到未知目标位置。引入多阶段强化学习框架和好奇模块加速了训练速度。"
}