{
    "title": "Serendipity in Science. (arXiv:2308.07519v1 [econ.EM])",
    "abstract": "Serendipity plays an important role in scientific discovery. Indeed, many of the most important breakthroughs, ranging from penicillin to the electric battery, have been made by scientists who were stimulated by a chance exposure to unsought but useful information. However, not all scientists are equally likely to benefit from such serendipitous exposure. Although scholars generally agree that scientists with a prepared mind are most likely to benefit from serendipitous encounters, there is much less consensus over what precisely constitutes a prepared mind, with some research suggesting the importance of openness and others emphasizing the need for deep prior experience in a particular domain. In this paper, we empirically investigate the role of serendipity in science by leveraging a policy change that exogenously shifted the shelving location of journals in university libraries and subsequently exposed scientists to unsought scientific information. Using large-scale data on 2.4 mill",
    "link": "http://arxiv.org/abs/2308.07519",
    "context": "Title: Serendipity in Science. (arXiv:2308.07519v1 [econ.EM])\nAbstract: Serendipity plays an important role in scientific discovery. Indeed, many of the most important breakthroughs, ranging from penicillin to the electric battery, have been made by scientists who were stimulated by a chance exposure to unsought but useful information. However, not all scientists are equally likely to benefit from such serendipitous exposure. Although scholars generally agree that scientists with a prepared mind are most likely to benefit from serendipitous encounters, there is much less consensus over what precisely constitutes a prepared mind, with some research suggesting the importance of openness and others emphasizing the need for deep prior experience in a particular domain. In this paper, we empirically investigate the role of serendipity in science by leveraging a policy change that exogenously shifted the shelving location of journals in university libraries and subsequently exposed scientists to unsought scientific information. Using large-scale data on 2.4 mill",
    "path": "papers/23/08/2308.07519.json",
    "total_tokens": 935,
    "translated_title": "科学中的偶然性",
    "translated_abstract": "偶然性在科学发现中起着重要作用。事实上，从青霉素到电池，许多重要突破都是由于科学家偶然接触到未被寻求但有用的信息而实现的。然而，并不是所有科学家都同样有可能受益于这种偶然的曝光。尽管学者们普遍认为拥有一个预先准备好的头脑的科学家最有可能从偶然的相遇中受益，但对于什么构成预先准备好的头脑的定义，还没有太多共识，一些研究表明开放心态的重要性，而其他人则强调在特定领域需要深入的先验经验。在本文中，通过利用一个政策变化，将大学图书馆的杂志存放位置进行外在性的移动，并随之使科学家接触到未被寻求的科学信息，我们对科学中偶然性的作用进行了经验研究。我们使用包含240万篇论文的大规模数据进行研究。",
    "tldr": "本文通过研究科学中的偶然性，探讨了偶然性在科学发现中的作用。研究发现，拥有开放心态和深入的先验经验的科学家更有可能从偶然相遇中受益。通过对大规模数据的分析，本研究提供了证据支持这一观点。",
    "en_tdlr": "This paper investigates the role of serendipity in scientific discovery, finding that scientists with an open mindset and deep prior experience are more likely to benefit from chance encounters. The study provides empirical evidence supporting this notion based on large-scale data analysis."
}