{
    "title": "The Performance of Transferability Metrics does not Translate to Medical Tasks. (arXiv:2308.07444v1 [cs.CV])",
    "abstract": "Transfer learning boosts the performance of medical image analysis by enabling deep learning (DL) on small datasets through the knowledge acquired from large ones. As the number of DL architectures explodes, exhaustively attempting all candidates becomes unfeasible, motivating cheaper alternatives for choosing them. Transferability scoring methods emerge as an enticing solution, allowing to efficiently calculate a score that correlates with the architecture accuracy on any target dataset. However, since transferability scores have not been evaluated on medical datasets, their use in this context remains uncertain, preventing them from benefiting practitioners. We fill that gap in this work, thoroughly evaluating seven transferability scores in three medical applications, including out-of-distribution scenarios. Despite promising results in general-purpose datasets, our results show that no transferability score can reliably and consistently estimate target performance in medical contex",
    "link": "http://arxiv.org/abs/2308.07444",
    "context": "Title: The Performance of Transferability Metrics does not Translate to Medical Tasks. (arXiv:2308.07444v1 [cs.CV])\nAbstract: Transfer learning boosts the performance of medical image analysis by enabling deep learning (DL) on small datasets through the knowledge acquired from large ones. As the number of DL architectures explodes, exhaustively attempting all candidates becomes unfeasible, motivating cheaper alternatives for choosing them. Transferability scoring methods emerge as an enticing solution, allowing to efficiently calculate a score that correlates with the architecture accuracy on any target dataset. However, since transferability scores have not been evaluated on medical datasets, their use in this context remains uncertain, preventing them from benefiting practitioners. We fill that gap in this work, thoroughly evaluating seven transferability scores in three medical applications, including out-of-distribution scenarios. Despite promising results in general-purpose datasets, our results show that no transferability score can reliably and consistently estimate target performance in medical contex",
    "path": "papers/23/08/2308.07444.json",
    "total_tokens": 867,
    "translated_title": "转移能力指标的性能并不能转化为医学任务",
    "translated_abstract": "通过从大型数据集中获取的知识，转移学习提高了医学图像分析的性能，使得在小型数据集上进行深度学习成为可能。随着深度学习架构的数量急剧增加，耗尽所有候选者的尝试变得不可行，这促使人们寻找更便宜的选择方法。转移性评分方法成为一种有吸引力的解决方案，它可以有效地计算出与任何目标数据集上架构准确性相关的分数。然而，由于转移性评分在医学数据集上尚未得到评估，它们在这种情况下的使用仍然存在不确定性，无法使从业人员受益。我们在这项工作中填补了这一空白，对三个医学应用程序中的七个转移能力评分进行了全面评估，包括跨分布的情景。尽管在通用数据集中取得了有希望的结果，但我们的结果表明，没有一个转移能力评分能够可靠且一致地估计目标在医学环境中的性能。",
    "tldr": "该论文研究了转移能力指标在医学任务中的表现，并发现现有的转移能力指标无法可靠地估计目标在医学环境中的性能。",
    "en_tdlr": "This paper investigates the performance of transferability metrics in medical tasks and finds that existing metrics cannot reliably estimate target performance in the medical context."
}