{
    "title": "Artificial Intelligence for Smart Transportation. (arXiv:2308.07457v1 [cs.AI])",
    "abstract": "There are more than 7,000 public transit agencies in the U.S. (and many more private agencies), and together, they are responsible for serving 60 billion passenger miles each year. A well-functioning transit system fosters the growth and expansion of businesses, distributes social and economic benefits, and links the capabilities of community members, thereby enhancing what they can accomplish as a society. Since affordable public transit services are the backbones of many communities, this work investigates ways in which Artificial Intelligence (AI) can improve efficiency and increase utilization from the perspective of transit agencies. This book chapter discusses the primary requirements, objectives, and challenges related to the design of AI-driven smart transportation systems. We focus on three major topics. First, we discuss data sources and data. Second, we provide an overview of how AI can aid decision-making with a focus on transportation. Lastly, we discuss computational prob",
    "link": "http://arxiv.org/abs/2308.07457",
    "context": "Title: Artificial Intelligence for Smart Transportation. (arXiv:2308.07457v1 [cs.AI])\nAbstract: There are more than 7,000 public transit agencies in the U.S. (and many more private agencies), and together, they are responsible for serving 60 billion passenger miles each year. A well-functioning transit system fosters the growth and expansion of businesses, distributes social and economic benefits, and links the capabilities of community members, thereby enhancing what they can accomplish as a society. Since affordable public transit services are the backbones of many communities, this work investigates ways in which Artificial Intelligence (AI) can improve efficiency and increase utilization from the perspective of transit agencies. This book chapter discusses the primary requirements, objectives, and challenges related to the design of AI-driven smart transportation systems. We focus on three major topics. First, we discuss data sources and data. Second, we provide an overview of how AI can aid decision-making with a focus on transportation. Lastly, we discuss computational prob",
    "path": "papers/23/08/2308.07457.json",
    "total_tokens": 838,
    "translated_title": "智能交通的人工智能研究",
    "translated_abstract": "在美国有超过7,000家公共交通机构（还有更多的私营机构），它们一年为600亿乘客提供服务。一个运行良好的交通系统可以促进企业的增长和扩张，分发社会和经济福利，并连接社区成员的能力，从而提高他们作为一个社会的成就。由于经济实惠的公共交通服务是许多社区的支柱，本研究探讨了人工智能如何从交通机构的角度提高效率和增加利用率。这篇书章讨论了与设计基于人工智能的智能交通系统相关的主要需求、目标和挑战。我们重点关注三个主要主题。首先，我们讨论数据来源和数据。其次，我们总结了人工智能如何帮助交通决策。最后，我们讨论了计算问题。",
    "tldr": "本论文调查了人工智能如何从交通机构的角度提高效率和增加利用率，以改善智能交通系统的设计，重点关注数据来源与数据、人工智能辅助决策和计算问题。",
    "en_tdlr": "This paper investigates how Artificial Intelligence can improve efficiency and increase utilization from the perspective of transit agencies, aiming to enhance the design of smart transportation systems. The primary focus is on data sources and data, AI-assisted decision-making, and computational problems."
}