{
    "title": "Adding Why to What? Analyses of an Everyday Explanation. (arXiv:2308.04187v1 [cs.AI])",
    "abstract": "In XAI it is important to consider that, in contrast to explanations for professional audiences, one cannot assume common expertise when explaining for laypeople. But such explanations between humans vary greatly, making it difficult to research commonalities across explanations. We used the dual nature theory, a techno-philosophical approach, to cope with these challenges. According to it, one can explain, for example, an XAI's decision by addressing its dual nature: by focusing on the Architecture (e.g., the logic of its algorithms) or the Relevance (e.g., the severity of a decision, the implications of a recommendation). We investigated 20 game explanations using the theory as an analytical framework. We elaborate how we used the theory to quickly structure and compare explanations of technological artifacts. We supplemented results from analyzing the explanation contents with results from a video recall to explore how explainers justified their explanation. We found that explainers",
    "link": "http://arxiv.org/abs/2308.04187",
    "context": "Title: Adding Why to What? Analyses of an Everyday Explanation. (arXiv:2308.04187v1 [cs.AI])\nAbstract: In XAI it is important to consider that, in contrast to explanations for professional audiences, one cannot assume common expertise when explaining for laypeople. But such explanations between humans vary greatly, making it difficult to research commonalities across explanations. We used the dual nature theory, a techno-philosophical approach, to cope with these challenges. According to it, one can explain, for example, an XAI's decision by addressing its dual nature: by focusing on the Architecture (e.g., the logic of its algorithms) or the Relevance (e.g., the severity of a decision, the implications of a recommendation). We investigated 20 game explanations using the theory as an analytical framework. We elaborate how we used the theory to quickly structure and compare explanations of technological artifacts. We supplemented results from analyzing the explanation contents with results from a video recall to explore how explainers justified their explanation. We found that explainers",
    "path": "papers/23/08/2308.04187.json",
    "total_tokens": 893,
    "translated_title": "为何添加到什么中？对一种日常解释的分析。",
    "translated_abstract": "在可解释性人工智能（XAI）中，重要的是要考虑到，与专业观众的解释不同，当为一般人解释时，不能假设有共同的专业知识。但是这样人与人之间的解释差异很大，很难研究解释的共同点。我们使用了双重性理论，这是一种技术哲学方法，来应对这些挑战。根据该理论，可以通过关注架构（例如算法逻辑）或相关性（例如决策的严重性，推荐的影响等）来解释XAI的决策。我们使用该理论作为分析框架研究了20种游戏解释。我们详细阐述了如何使用该理论快速结构化和比较技术产品的解释。我们通过分析解释内容的结果，并结合视频回想的结果，探索解释者是如何为他们的解释进行合理化的。我们发现，解释者...",
    "tldr": "该论文研究了在解释技术产品时应用的双重性理论，通过关注架构和相关性，对解释进行了快速结构化和比较。通过分析解释内容和视频回想，探索了解释者如何进行解释的合理化。研究发现...",
    "en_tdlr": "This paper investigates the application of the dual nature theory in explaining technological artifacts, by focusing on architecture and relevance. It explores how explainers justify their explanations through analyzing the content and video recall. The study findings reveal..."
}