{
    "title": "DOMINO: Domain-invariant Hyperdimensional Classification for Multi-Sensor Time Series Data. (arXiv:2308.03295v2 [cs.LG] UPDATED)",
    "abstract": "With the rapid evolution of the Internet of Things, many real-world applications utilize heterogeneously connected sensors to capture time-series information. Edge-based machine learning (ML) methodologies are often employed to analyze locally collected data. However, a fundamental issue across data-driven ML approaches is distribution shift. It occurs when a model is deployed on a data distribution different from what it was trained on, and can substantially degrade model performance. Additionally, increasingly sophisticated deep neural networks (DNNs) have been proposed to capture spatial and temporal dependencies in multi-sensor time series data, requiring intensive computational resources beyond the capacity of today's edge devices. While brain-inspired hyperdimensional computing (HDC) has been introduced as a lightweight solution for edge-based learning, existing HDCs are also vulnerable to the distribution shift challenge. In this paper, we propose DOMINO, a novel HDC learning fr",
    "link": "http://arxiv.org/abs/2308.03295",
    "context": "Title: DOMINO: Domain-invariant Hyperdimensional Classification for Multi-Sensor Time Series Data. (arXiv:2308.03295v2 [cs.LG] UPDATED)\nAbstract: With the rapid evolution of the Internet of Things, many real-world applications utilize heterogeneously connected sensors to capture time-series information. Edge-based machine learning (ML) methodologies are often employed to analyze locally collected data. However, a fundamental issue across data-driven ML approaches is distribution shift. It occurs when a model is deployed on a data distribution different from what it was trained on, and can substantially degrade model performance. Additionally, increasingly sophisticated deep neural networks (DNNs) have been proposed to capture spatial and temporal dependencies in multi-sensor time series data, requiring intensive computational resources beyond the capacity of today's edge devices. While brain-inspired hyperdimensional computing (HDC) has been introduced as a lightweight solution for edge-based learning, existing HDCs are also vulnerable to the distribution shift challenge. In this paper, we propose DOMINO, a novel HDC learning fr",
    "path": "papers/23/08/2308.03295.json",
    "total_tokens": 850,
    "translated_title": "DOMINO: 多个传感器时间序列数据的领域不变的高维分类",
    "translated_abstract": "随着物联网的快速发展，许多现实应用利用异构连接的传感器来捕捉时间序列信息。边缘机器学习方法常被用于分析本地收集的数据。然而，数据驱动的机器学习方法面临一个基本问题，即分布偏移。当一个模型部署在与其训练不同的数据分布上时，分布偏移会严重降低模型性能。此外，越来越复杂的深度神经网络(DNNs)已被提出用于捕捉多个传感器时间序列数据中的空间和时间依赖关系，而这需要超出当今边缘设备容量的大量计算资源。而大脑启发的高维计算(HDC)作为边缘学习的一种轻量级解决方案已被引入，但现有的HDC在面对分布偏移挑战时仍然脆弱。本文提出了DOMINO，一种新颖的HDC学习方法。",
    "tldr": "DOMINO是一种领域不变的高维分类方法，适用于多传感器时间序列数据；解决了分布偏移和计算资源的问题。",
    "en_tdlr": "DOMINO is a domain-invariant hyperdimensional classification method for multi-sensor time series data, addressing the issues of distribution shift and computational resources."
}