{
    "title": "Interest Rate Dynamics and Commodity Prices. (arXiv:2308.07577v1 [econ.TH])",
    "abstract": "Monetary conditions are frequently cited as a significant factor influencing fluctuations in commodity prices. However, the precise channels of transmission are less well identified. In this paper, we develop a unified theory to study the impact of interest rates on commodity prices and the underlying mechanisms. To that end, we extend the competitive storage model to accommodate stochastically evolving interest rates, and establish general conditions under which (i) a unique rational expectations equilibrium exists and can be efficiently computed, and (ii) interest rates are negatively correlated with commodity prices. As an application, we quantify the impact of interest rates on commodity prices through the speculative channel, namely, the role of speculators in the physical market whose incentive to hold inventories is influenced by interest rate movements. Our findings demonstrate that real interest rates have nontrivial and persistent negative effect on commodity prices, and the ",
    "link": "http://arxiv.org/abs/2308.07577",
    "context": "Title: Interest Rate Dynamics and Commodity Prices. (arXiv:2308.07577v1 [econ.TH])\nAbstract: Monetary conditions are frequently cited as a significant factor influencing fluctuations in commodity prices. However, the precise channels of transmission are less well identified. In this paper, we develop a unified theory to study the impact of interest rates on commodity prices and the underlying mechanisms. To that end, we extend the competitive storage model to accommodate stochastically evolving interest rates, and establish general conditions under which (i) a unique rational expectations equilibrium exists and can be efficiently computed, and (ii) interest rates are negatively correlated with commodity prices. As an application, we quantify the impact of interest rates on commodity prices through the speculative channel, namely, the role of speculators in the physical market whose incentive to hold inventories is influenced by interest rate movements. Our findings demonstrate that real interest rates have nontrivial and persistent negative effect on commodity prices, and the ",
    "path": "papers/23/08/2308.07577.json",
    "total_tokens": 832,
    "translated_title": "利率动态和商品价格",
    "translated_abstract": "货币条件经常被认为是影响商品价格波动的重要因素。然而，传输机制的具体渠道还没有被明确定义。本文中，我们发展了一个统一的理论来研究利率对商品价格及其基本机制的影响。为此，我们扩展了竞争储存模型以适应随机演化的利率，并确定了普遍条件，即(i)存在唯一的理性预期均衡并能有效计算，以及(ii)利率与商品价格呈负相关。作为应用，我们通过投机渠道量化了利率对商品价格的影响，即物理市场上持有库存的投机者的激励受利率变动的影响。我们的研究发现，实际利率对商品价格具有重要而持续的负面影响，且该影响并不平凡。",
    "tldr": "本文发展了一个统一的理论来研究利率对商品价格的影响，并扩展了竞争储存模型以适应随机演化的利率。研究结果表明，实际利率对商品价格具有重要而持续的负面影响。",
    "en_tdlr": "This paper develops a unified theory to study the impact of interest rates on commodity prices and extends the competitive storage model to accommodate stochastically evolving interest rates. The findings demonstrate that real interest rates have significant and persistent negative effect on commodity prices."
}