{
    "title": "Analytical valuation of vulnerable derivative contracts with bilateral cash flows under credit, funding and wrong-way risks. (arXiv:2308.10568v1 [q-fin.PR])",
    "abstract": "We study the problem of valuing a vulnerable derivative with bilateral cash flows between two counterparties in the presence of funding, credit and wrong-way risks, and derive a closed-form valuation formula for an at-the-money (ATM) forward contract as well as a second order approximation for the general case. We posit a model with heterogeneous interest rates and default occurrence and infer a Cauchy problem for the pre-default valuation function of the contract, which includes ab initio any counterparty risk - as opposed to calculating valuation adjustments collectively known as XVA. Under a specific funding policy which linearises the Cauchy problem, we obtain a generic probabilistic representation for the pre-default valuation (Theorem 1). We apply this general framework to the valuation of an equity forward and establish the contract can be expressed as a continuous portfolio of European options with suitably chosen strikes and expiries under a particular probability measure (The",
    "link": "http://arxiv.org/abs/2308.10568",
    "context": "Title: Analytical valuation of vulnerable derivative contracts with bilateral cash flows under credit, funding and wrong-way risks. (arXiv:2308.10568v1 [q-fin.PR])\nAbstract: We study the problem of valuing a vulnerable derivative with bilateral cash flows between two counterparties in the presence of funding, credit and wrong-way risks, and derive a closed-form valuation formula for an at-the-money (ATM) forward contract as well as a second order approximation for the general case. We posit a model with heterogeneous interest rates and default occurrence and infer a Cauchy problem for the pre-default valuation function of the contract, which includes ab initio any counterparty risk - as opposed to calculating valuation adjustments collectively known as XVA. Under a specific funding policy which linearises the Cauchy problem, we obtain a generic probabilistic representation for the pre-default valuation (Theorem 1). We apply this general framework to the valuation of an equity forward and establish the contract can be expressed as a continuous portfolio of European options with suitably chosen strikes and expiries under a particular probability measure (The",
    "path": "papers/23/08/2308.10568.json",
    "total_tokens": 971,
    "translated_title": "对于存在信用、资金和反向风险的具有双边现金流的易损衍生品合约的分析估值",
    "translated_abstract": "我们研究了在存在资金、信用和反向风险的情况下，对具有双边现金流的易损衍生品进行估值的问题，并导出了一个关于平值（ATM）远期合约的闭合形式估值公式，以及一个对于一般情况的二阶近似。我们假设了一个具有异质利率和违约发生的模型，并推导出合约的违约前估值函数的Cauchy问题，其中包括任何供应方风险 - 与计算估值调整（统称XVA）不同。在一个特定的资金策略下，线性化Cauchy问题，我们得到了违约前估值的通用概率表示（定理1）。我们将这个通用框架应用于股票远期合约的估值，并建立了合约可以在特定概率测度下表示为具有适当选择的执行价和到期日的欧式期权的连续投资组合。",
    "tldr": "我们研究了存在信用、资金和反向风险的双边现金流易损衍生品合约的估值问题，并开发了一个闭合形式的估值公式和二阶近似方法。通过使用特定的资金策略，我们得到了违约前估值的通用概率表示，并将其应用于股票远期合约的估值。",
    "en_tdlr": "We study the valuation problem of vulnerable derivative contracts with bilateral cash flows under credit, funding, and wrong-way risks. We derive a closed-form valuation formula and second order approximation for these contracts. By applying a specific funding policy, we obtain a generic probabilistic representation for the pre-default valuation, which we then use to value equity forward contracts."
}