{
    "title": "A Robust Method for Microforecasting and Estimation of Random Effects. (arXiv:2308.01596v1 [econ.EM])",
    "abstract": "We propose a method for forecasting individual outcomes and estimating random effects in linear panel data models and value-added models when the panel has a short time dimension. The method is robust, trivial to implement and requires minimal assumptions. The idea is to take a weighted average of time series- and pooled forecasts/estimators, with individual weights that are based on time series information. We show the forecast optimality of individual weights, both in terms of minimax-regret and of mean squared forecast error. We then provide feasible weights that ensure good performance under weaker assumptions than those required by existing approaches. Unlike existing shrinkage methods, our approach borrows the strength - but avoids the tyranny - of the majority, by targeting individual (instead of group) accuracy and letting the data decide how much strength each individual should borrow. Unlike existing empirical Bayesian methods, our frequentist approach requires no distributio",
    "link": "http://arxiv.org/abs/2308.01596",
    "context": "Title: A Robust Method for Microforecasting and Estimation of Random Effects. (arXiv:2308.01596v1 [econ.EM])\nAbstract: We propose a method for forecasting individual outcomes and estimating random effects in linear panel data models and value-added models when the panel has a short time dimension. The method is robust, trivial to implement and requires minimal assumptions. The idea is to take a weighted average of time series- and pooled forecasts/estimators, with individual weights that are based on time series information. We show the forecast optimality of individual weights, both in terms of minimax-regret and of mean squared forecast error. We then provide feasible weights that ensure good performance under weaker assumptions than those required by existing approaches. Unlike existing shrinkage methods, our approach borrows the strength - but avoids the tyranny - of the majority, by targeting individual (instead of group) accuracy and letting the data decide how much strength each individual should borrow. Unlike existing empirical Bayesian methods, our frequentist approach requires no distributio",
    "path": "papers/23/08/2308.01596.json",
    "total_tokens": 1053,
    "translated_title": "一种微观预测和随机效应估计的稳健方法",
    "translated_abstract": "我们提出了一种方法，在面板数据模型和增值模型中，对个体结果进行预测和估计随机效应，当面板数据的时间维度较短时。该方法稳健且易于实现，需要的假设很少。该方法的思想是，在时间序列信息的基础上，将时序和汇总的预测/估计的加权平均值，其中个体权重基于时间序列信息。我们展示了个体权重的预测最优性，无论是在最小化最大遗憾还是均方预测误差方面。然后，我们提供了可行的权重，以在弱于现有方法所需假设的情况下确保良好的性能。与现有的收缩方法不同，我们的方法利用了多数的优势，但避免了专制，通过针对个人（而不是群体）的准确性，并让数据决定每个个体应借用多少力量。与现有的经验贝叶斯方法不同，我们的频率主义方法不需要任何分布假设。",
    "tldr": "我们提出了一种稳健的方法，用于在面板数据模型和增值模型中预测个体结果和估计随机效应，特别是在时间维度较短的情况下。该方法通过加权平均值结合了时序和汇总的预测/估计，并利用个体权重来提高预测的准确性。与现有方法相比，我们的方法不仅假设较少，而且可以在更弱的假设下获得良好的性能。该方法还避免了专制，通过让数据决定每个个体应借用多少力量。"
}