{
    "title": "Generative Interpretation. (arXiv:2308.06907v1 [cs.CL])",
    "abstract": "We introduce generative interpretation, a new approach to estimating contractual meaning using large language models. As AI triumphalism is the order of the day, we proceed by way of grounded case studies, each illustrating the capabilities of these novel tools in distinct ways. Taking well-known contracts opinions, and sourcing the actual agreements that they adjudicated, we show that AI models can help factfinders ascertain ordinary meaning in context, quantify ambiguity, and fill gaps in parties' agreements. We also illustrate how models can calculate the probative value of individual pieces of extrinsic evidence. After offering best practices for the use of these models given their limitations, we consider their implications for judicial practice and contract theory. Using LLMs permits courts to estimate what the parties intended cheaply and accurately, and as such generative interpretation unsettles the current interpretative stalemate. Their use responds to efficiency-minded text",
    "link": "http://arxiv.org/abs/2308.06907",
    "context": "Title: Generative Interpretation. (arXiv:2308.06907v1 [cs.CL])\nAbstract: We introduce generative interpretation, a new approach to estimating contractual meaning using large language models. As AI triumphalism is the order of the day, we proceed by way of grounded case studies, each illustrating the capabilities of these novel tools in distinct ways. Taking well-known contracts opinions, and sourcing the actual agreements that they adjudicated, we show that AI models can help factfinders ascertain ordinary meaning in context, quantify ambiguity, and fill gaps in parties' agreements. We also illustrate how models can calculate the probative value of individual pieces of extrinsic evidence. After offering best practices for the use of these models given their limitations, we consider their implications for judicial practice and contract theory. Using LLMs permits courts to estimate what the parties intended cheaply and accurately, and as such generative interpretation unsettles the current interpretative stalemate. Their use responds to efficiency-minded text",
    "path": "papers/23/08/2308.06907.json",
    "total_tokens": 951,
    "translated_title": "生成性解释",
    "translated_abstract": "我们引入了一种新的方法，即生成性解释，使用大型语言模型来估计合同含义。我们通过具体案例研究来展示这些新工具的能力。通过分析已知的合同意见，并获取相关的协议，我们展示了AI模型可以帮助事实找到者在上下文中确定普通含义、量化歧义，并填补各方协议中的空白。我们还展示了模型如何计算外部证据的证据价值。在考虑到模型的限制后，我们提供了使用这些模型的最佳实践，并思考了它们对司法实践和合同理论的影响。使用大型语言模型可以让法院以廉价和准确的方式估计各方意图，这使得生成性解释打破了当前的解释僵局。它们的使用回应了效率导向的文本处理需求。",
    "tldr": "本论文介绍了生成性解释，一种利用大型语言模型估计合同含义的新方法。通过案例研究，论文展示了这一方法在确定普通含义、量化歧义、填补合同空白以及计算外部证据的证据价值方面的能力。该方法对司法实践和合同理论有着重要的影响，因为它可以以廉价和准确的方式帮助法院估计各方意图，从而改变了现有的解释困境。",
    "en_tdlr": "This paper introduces generative interpretation, a new approach that uses large language models to estimate contractual meaning. Through case studies, the paper demonstrates the capabilities of this approach in determining ordinary meaning, quantifying ambiguity, filling gaps in contracts, and calculating the probative value of extrinsic evidence. This method has important implications for judicial practice and contract theory as it allows courts to estimate party intentions cheaply and accurately, disrupting the current interpretative stalemate."
}