{
    "title": "Can A Single Human Supervise A Swarm of 100 Heterogeneous Robots?. (arXiv:2308.00102v1 [cs.RO])",
    "abstract": "An open research question has been whether a single human can supervise a true heterogeneous swarm of robots completing tasks in real world environments. A general concern is whether or not the human's workload will be taxed to the breaking point. The Defense Advanced Research Projects Agency's OFFsensive Swarm-Enabled Tactics program's field exercises that occurred at U.S. Army urban training sites provided the opportunity to understand the impact of achieving such swarm deployments. The Command and Control of Aggregate Swarm Tactics integrator team's swarm commander users the heterogeneous robot swarm to conduct relevant missions. During the final OFFSET program field exercise, the team collected objective and subjective metrics related to teh swarm commander's human performance. A multi-dimensional workload algorithm that estimates overall workload based on five components of workload was used to analyze the results. While the swarm commander's workload estimate did cross the overlo",
    "link": "http://arxiv.org/abs/2308.00102",
    "context": "Title: Can A Single Human Supervise A Swarm of 100 Heterogeneous Robots?. (arXiv:2308.00102v1 [cs.RO])\nAbstract: An open research question has been whether a single human can supervise a true heterogeneous swarm of robots completing tasks in real world environments. A general concern is whether or not the human's workload will be taxed to the breaking point. The Defense Advanced Research Projects Agency's OFFsensive Swarm-Enabled Tactics program's field exercises that occurred at U.S. Army urban training sites provided the opportunity to understand the impact of achieving such swarm deployments. The Command and Control of Aggregate Swarm Tactics integrator team's swarm commander users the heterogeneous robot swarm to conduct relevant missions. During the final OFFSET program field exercise, the team collected objective and subjective metrics related to teh swarm commander's human performance. A multi-dimensional workload algorithm that estimates overall workload based on five components of workload was used to analyze the results. While the swarm commander's workload estimate did cross the overlo",
    "path": "papers/23/08/2308.00102.json",
    "total_tokens": 901,
    "translated_title": "一个人能够监督100个异构机器人的群体吗？",
    "translated_abstract": "一个未解决的研究问题是，一个人是否能够在真实环境中监督一个异构机器人群体完成任务。一个普遍的担忧是人类的工作负荷是否会到达极限。美国国防高级研究计划局的OFFsensive Swarm-Enabled Tactics计划在美国陆军城市训练场地上进行了一系列军事演习，为我们了解实现这种群体部署的影响提供了机会。指挥和控制群体战术整合团队的群体指挥官使用异构机器人群体执行相关任务。在最终的OFFSET计划现场演习中，团队收集了与群体指挥官的人类表现相关的客观和主观指标。使用一个多维的工作负荷算法，根据工作负荷的五个组成部分估计整体工作负荷，并对结果进行了分析。虽然群体指挥官的工作负荷估计确实超过了负荷极限。",
    "tldr": "这项研究研究了一个人是否能够监督一个真实环境中的异构机器人群体，结果表明，在适当的工作负荷算法支持下，一个人可以有效地指挥和控制这样的群体。",
    "en_tdlr": "This research investigates whether a single human can supervise a true heterogeneous swarm of robots in a real-world environment. The results indicate that, with proper workload algorithms support, a single human can effectively command and control such a swarm."
}