{
    "title": "The divergence time of protein structures modelled by Markov matrices and its relation to the divergence of sequences. (arXiv:2308.06292v1 [q-bio.QM])",
    "abstract": "A complete time-parameterized statistical model quantifying the divergent evolution of protein structures in terms of the patterns of conservation of their secondary structures is inferred from a large collection of protein 3D structure alignments. This provides a better alternative to time-parameterized sequence-based models of protein relatedness, that have clear limitations dealing with twilight and midnight zones of sequence relationships. Since protein structures are far more conserved due to the selection pressure directly placed on their function, divergence time estimates can be more accurate when inferred from structures. We use the Bayesian and information-theoretic framework of Minimum Message Length to infer a time-parameterized stochastic matrix (accounting for perturbed structural states of related residues) and associated Dirichlet models (accounting for insertions and deletions during the evolution of protein domains). These are used in concert to estimate the Markov ti",
    "link": "http://arxiv.org/abs/2308.06292",
    "context": "Title: The divergence time of protein structures modelled by Markov matrices and its relation to the divergence of sequences. (arXiv:2308.06292v1 [q-bio.QM])\nAbstract: A complete time-parameterized statistical model quantifying the divergent evolution of protein structures in terms of the patterns of conservation of their secondary structures is inferred from a large collection of protein 3D structure alignments. This provides a better alternative to time-parameterized sequence-based models of protein relatedness, that have clear limitations dealing with twilight and midnight zones of sequence relationships. Since protein structures are far more conserved due to the selection pressure directly placed on their function, divergence time estimates can be more accurate when inferred from structures. We use the Bayesian and information-theoretic framework of Minimum Message Length to infer a time-parameterized stochastic matrix (accounting for perturbed structural states of related residues) and associated Dirichlet models (accounting for insertions and deletions during the evolution of protein domains). These are used in concert to estimate the Markov ti",
    "path": "papers/23/08/2308.06292.json",
    "total_tokens": 876,
    "translated_title": "蛋白质结构的分化时间模型与序列分化的关系",
    "translated_abstract": "通过大量蛋白质三维结构对齐的方式，推导出一个完整的、时间参数化的统计模型，用于量化蛋白质结构的分化演化，该模型以二级结构的保守性模式为指标。相对于以序列为基础的时间参数化模型，该模型能更好地处理序列关系的黄昏区和午夜区的限制。由于蛋白质结构受功能直接施加的选择压力更大，从结构推断分化时间的估计更准确。我们使用最小信息长度的贝叶斯和信息论框架来推断一个时间参数化的随机矩阵（考虑相关残基的扰动结构状态）和相关的Dirichlet模型（考虑蛋白质域演化过程中的插入和删除）。这些模型共同用于估计马尔可夫链的分化时间。",
    "tldr": "通过蛋白质结构的保守性模式，建立了一个时间参数化的统计模型，用于量化蛋白质结构的分化演化，并与序列的分化关系进行对比。这个模型能更准确估计蛋白质结构的分化时间。",
    "en_tdlr": "A time-parameterized statistical model is developed to quantify the divergent evolution of protein structures based on the patterns of conservation of their secondary structures. Compared to sequence-based models, this approach provides more accurate estimates of protein structure divergence."
}