{
    "title": "Machine learning methods for the search for L&T brown dwarfs in the data of modern sky surveys. (arXiv:2308.03045v2 [astro-ph.SR] UPDATED)",
    "abstract": "According to various estimates, brown dwarfs (BD) should account for up to 25 percent of all objects in the Galaxy. However, few of them are discovered and well-studied, both individually and as a population. Homogeneous and complete samples of brown dwarfs are needed for these kinds of studies. Due to their weakness, spectral studies of brown dwarfs are rather laborious. For this reason, creating a significant reliable sample of brown dwarfs, confirmed by spectroscopic observations, seems unattainable at the moment. Numerous attempts have been made to search for and create a set of brown dwarfs using their colours as a decision rule applied to a vast amount of survey data. In this work, we use machine learning methods such as Random Forest Classifier, XGBoost, SVM Classifier and TabNet on PanStarrs DR1, 2MASS and WISE data to distinguish L and T brown dwarfs from objects of other spectral and luminosity classes. The explanation of the models is discussed. We also compare our models wi",
    "link": "http://arxiv.org/abs/2308.03045",
    "context": "Title: Machine learning methods for the search for L&T brown dwarfs in the data of modern sky surveys. (arXiv:2308.03045v2 [astro-ph.SR] UPDATED)\nAbstract: According to various estimates, brown dwarfs (BD) should account for up to 25 percent of all objects in the Galaxy. However, few of them are discovered and well-studied, both individually and as a population. Homogeneous and complete samples of brown dwarfs are needed for these kinds of studies. Due to their weakness, spectral studies of brown dwarfs are rather laborious. For this reason, creating a significant reliable sample of brown dwarfs, confirmed by spectroscopic observations, seems unattainable at the moment. Numerous attempts have been made to search for and create a set of brown dwarfs using their colours as a decision rule applied to a vast amount of survey data. In this work, we use machine learning methods such as Random Forest Classifier, XGBoost, SVM Classifier and TabNet on PanStarrs DR1, 2MASS and WISE data to distinguish L and T brown dwarfs from objects of other spectral and luminosity classes. The explanation of the models is discussed. We also compare our models wi",
    "path": "papers/23/08/2308.03045.json",
    "total_tokens": 1022,
    "translated_title": "用于在现代星空调查数据中搜索L＆T类棕矮星的机器学习方法",
    "translated_abstract": "根据各种估计，棕矮星（BD）应占银河系中所有天体的25％。然而，很少有棕矮星被发现并得到深入研究，无论是个体还是整体。这些研究需要均匀和完整的棕矮星样本。由于其弱信号，棕矮星的光谱研究相当耗费精力。因此，通过光谱观测确认的大量可靠的棕矮星样本似乎在目前是不可企及的。已经尝试了许多方法来利用其颜色作为决策规则应用于大量的勘测数据来搜索和创建一组棕矮星。在这项工作中，我们使用随机森林分类器、XGBoost、支持向量机分类器和TabNet等机器学习方法在PanStarrs DR1、2MASS和WISE数据上区分L类和T类棕矮星与其他光谱和亮度类别的天体。讨论了模型的解释。我们还将我们的模型与其他方法进行了比较。",
    "tldr": "在这项研究中，我们使用机器学习方法对PanStarrs DR1、2MASS和WISE数据进行分析，以区分L类和T类棕矮星和其他光谱和亮度类别的天体。这有助于建立一个均匀且完整的棕矮星样本，为研究提供可靠的数据集。"
}