{
    "title": "ICoNIK: Generating Respiratory-Resolved Abdominal MR Reconstructions Using Neural Implicit Representations in k-Space. (arXiv:2308.08830v1 [eess.IV])",
    "abstract": "Motion-resolved reconstruction for abdominal magnetic resonance imaging (MRI) remains a challenge due to the trade-off between residual motion blurring caused by discretized motion states and undersampling artefacts. In this work, we propose to generate blurring-free motion-resolved abdominal reconstructions by learning a neural implicit representation directly in k-space (NIK). Using measured sampling points and a data-derived respiratory navigator signal, we train a network to generate continuous signal values. To aid the regularization of sparsely sampled regions, we introduce an additional informed correction layer (ICo), which leverages information from neighboring regions to correct NIK's prediction. Our proposed generative reconstruction methods, NIK and ICoNIK, outperform standard motion-resolved reconstruction techniques and provide a promising solution to address motion artefacts in abdominal MRI.",
    "link": "http://arxiv.org/abs/2308.08830",
    "context": "Title: ICoNIK: Generating Respiratory-Resolved Abdominal MR Reconstructions Using Neural Implicit Representations in k-Space. (arXiv:2308.08830v1 [eess.IV])\nAbstract: Motion-resolved reconstruction for abdominal magnetic resonance imaging (MRI) remains a challenge due to the trade-off between residual motion blurring caused by discretized motion states and undersampling artefacts. In this work, we propose to generate blurring-free motion-resolved abdominal reconstructions by learning a neural implicit representation directly in k-space (NIK). Using measured sampling points and a data-derived respiratory navigator signal, we train a network to generate continuous signal values. To aid the regularization of sparsely sampled regions, we introduce an additional informed correction layer (ICo), which leverages information from neighboring regions to correct NIK's prediction. Our proposed generative reconstruction methods, NIK and ICoNIK, outperform standard motion-resolved reconstruction techniques and provide a promising solution to address motion artefacts in abdominal MRI.",
    "path": "papers/23/08/2308.08830.json",
    "total_tokens": 907,
    "translated_title": "ICoNIK: 使用k空间中的神经隐式表示生成呼吸相关的腹部MR重建",
    "translated_abstract": "腹部磁共振成像中运动分辨重建仍然存在挑战，由离散化运动状态引起的残余运动模糊与欠采样伪影之间需要权衡。在本文中，我们提出了使用在k空间中直接学习神经隐式表示（NIK）来生成无模糊的运动分辨腹部重建。通过使用测量的采样点和数据导出的呼吸导航信号，训练网络生成连续的信号值。为了帮助稀疏采样区域的正则化，我们引入了一个额外的信息校正层（ICo），利用邻近区域的信息来纠正NIK的预测。我们提出的生成重建方法NIK和ICoNIK在标准的运动分辨重建技术上表现优异，并为解决腹部磁共振成像中的运动伪影提供了一个有希望的解决方案。",
    "tldr": "本文提出了使用在k空间中学习神经隐式表示的方法来生成无模糊的运动分辨腹部MR重建。通过引入信息校正层，进一步改进了重建结果。这种方法在解决腹部MRI中的运动伪影问题上表现出色。",
    "en_tdlr": "This paper proposes a method that uses neural implicit representations in k-space to generate motion-resolved abdominal MR reconstructions without blurring. By introducing an informed correction layer, the reconstruction results are further improved. This approach shows promising results in addressing motion artifacts in abdominal MRI."
}