{
    "title": "PEvoLM: Protein Sequence Evolutionary Information Language Model. (arXiv:2308.08578v1 [q-bio.QM])",
    "abstract": "With the exponential increase of the protein sequence databases over time, multiple-sequence alignment (MSA) methods, like PSI-BLAST, perform exhaustive and time-consuming database search to retrieve evolutionary information. The resulting position-specific scoring matrices (PSSMs) of such search engines represent a crucial input to many machine learning (ML) models in the field of bioinformatics and computational biology. A protein sequence is a collection of contiguous tokens or characters called amino acids (AAs). The analogy to natural language allowed us to exploit the recent advancements in the field of Natural Language Processing (NLP) and therefore transfer NLP state-of-the-art algorithms to bioinformatics. This research presents an Embedding Language Model (ELMo), converting a protein sequence to a numerical vector representation. While the original ELMo trained a 2-layer bidirectional Long Short-Term Memory (LSTMs) network following a two-path architecture, one for the forwar",
    "link": "http://arxiv.org/abs/2308.08578",
    "context": "Title: PEvoLM: Protein Sequence Evolutionary Information Language Model. (arXiv:2308.08578v1 [q-bio.QM])\nAbstract: With the exponential increase of the protein sequence databases over time, multiple-sequence alignment (MSA) methods, like PSI-BLAST, perform exhaustive and time-consuming database search to retrieve evolutionary information. The resulting position-specific scoring matrices (PSSMs) of such search engines represent a crucial input to many machine learning (ML) models in the field of bioinformatics and computational biology. A protein sequence is a collection of contiguous tokens or characters called amino acids (AAs). The analogy to natural language allowed us to exploit the recent advancements in the field of Natural Language Processing (NLP) and therefore transfer NLP state-of-the-art algorithms to bioinformatics. This research presents an Embedding Language Model (ELMo), converting a protein sequence to a numerical vector representation. While the original ELMo trained a 2-layer bidirectional Long Short-Term Memory (LSTMs) network following a two-path architecture, one for the forwar",
    "path": "papers/23/08/2308.08578.json",
    "total_tokens": 827,
    "translated_title": "PEvoLM: 蛋白质序列进化信息语言模型",
    "translated_abstract": "随着蛋白质序列数据库的指数增长，多序列比对(PSI-BLAST等)通过耗费时间的数据库搜索来获取进化信息。这些搜索引擎生成的位置特异性评分矩阵(PSSMs)对于生物信息学和计算生物学领域的许多机器学习模型来说是至关重要的输入。蛋白序列是由称为氨基酸(AAs)的连续标记或字符组成的。类比自然语言使我们能够利用自然语言处理(NLP)领域的最新进展，将NLP的最先进算法应用于生物信息学。本研究提出了一种嵌入式语言模型(ELMo)，将蛋白质序列转换为数字向量表示。尽管原始ELMo采用了一个两层双向长短期记忆网络(LSTMs)以及一个用于正向处理的双路径架构，",
    "tldr": "PEvoLM是一种蛋白质序列进化信息语言模型，它利用嵌入式语言模型将蛋白质序列转换为数字向量表示。",
    "en_tdlr": "PEvoLM is a protein sequence evolutionary information language model that converts protein sequences into numerical vector representations using an embedding language model."
}