{
    "title": "Exploiting the dynamics of commodity futures curves. (arXiv:2308.00383v1 [q-fin.GN])",
    "abstract": "The Nelson-Siegel framework is employed to model the term structure of commodity futures prices. Exploiting the information embedded in the level, slope and curvature parameters, we develop novel investment strategies that assume short-term continuation of recent parallel, slope or butterfly movements of futures curves. Systematic strategies based on the change in the slope generate significant profits that are unrelated to previously documented risk factors and can survive reasonable transaction costs. Further analysis demonstrates that the profitability of the slope strategy increases with investor sentiment and is in part a compensation for the drawdowns incurred during economic slowdowns. The profitability can also be magnified through timing and persists under alternative specifications of the Nelson-Siegel model.",
    "link": "http://arxiv.org/abs/2308.00383",
    "context": "Title: Exploiting the dynamics of commodity futures curves. (arXiv:2308.00383v1 [q-fin.GN])\nAbstract: The Nelson-Siegel framework is employed to model the term structure of commodity futures prices. Exploiting the information embedded in the level, slope and curvature parameters, we develop novel investment strategies that assume short-term continuation of recent parallel, slope or butterfly movements of futures curves. Systematic strategies based on the change in the slope generate significant profits that are unrelated to previously documented risk factors and can survive reasonable transaction costs. Further analysis demonstrates that the profitability of the slope strategy increases with investor sentiment and is in part a compensation for the drawdowns incurred during economic slowdowns. The profitability can also be magnified through timing and persists under alternative specifications of the Nelson-Siegel model.",
    "path": "papers/23/08/2308.00383.json",
    "total_tokens": 786,
    "translated_title": "利用商品期货曲线的动态特性",
    "translated_abstract": "本文使用Nelson-Siegel模型对商品期货价格的期限结构进行建模。利用水平、斜率和曲率参数中嵌入的信息，我们开发了新颖的投资策略，假设最近期货曲线的平行、斜率或蝶形变化会在短期内持续。基于斜率变化的系统性策略可以产生显著的利润，与先前记录的风险因素无关，并且可以在合理的交易成本下存活。进一步分析表明，斜率策略的盈利性随着投资者情绪的增强而增加，并在经济放缓期间部分抵消了回撤带来的损失。通过合理的市场时间选择，盈利性也可以放大，并且在Nelson-Siegel模型的替代规范下仍然存在。",
    "tldr": "本文利用Nelson-Siegel模型对商品期货价格进行了建模，开发了基于斜率变化的投资策略，能够在短期内产生显著的利润，并且可以抵消经济放缓期间的回撤损失。",
    "en_tdlr": "This paper utilizes the Nelson-Siegel framework to model commodity futures prices and develops investment strategies based on changes in slope that generate significant profits in the short term and can offset drawdown losses during economic slowdowns."
}