{
    "title": "An optimal transport approach for the multiple quantile hedging problem. (arXiv:2308.01121v1 [math.PR])",
    "abstract": "We consider the multiple quantile hedging problem, which is a class of partial hedging problems containing as special examples the quantile hedging problem (F{\\\"o}llmer \\& Leukert 1999) and the PnL matching problem (introduced in Bouchard \\& Vu 2012). In complete non-linear markets, we show that the problem can be reformulated as a kind of Monge optimal transport problem. Using this observation, we introduce a Kantorovitch version of the problem and prove that the value of both problems coincide. In the linear case, we thus obtain that the multiple quantile hedging problem can be seen as a semi-discrete optimal transport problem, for which we further introduce the dual problem. We then prove that there is no duality gap, allowing us to design a numerical method based on SGA algorithms to compute the multiple quantile hedging price.",
    "link": "http://arxiv.org/abs/2308.01121",
    "context": "Title: An optimal transport approach for the multiple quantile hedging problem. (arXiv:2308.01121v1 [math.PR])\nAbstract: We consider the multiple quantile hedging problem, which is a class of partial hedging problems containing as special examples the quantile hedging problem (F{\\\"o}llmer \\& Leukert 1999) and the PnL matching problem (introduced in Bouchard \\& Vu 2012). In complete non-linear markets, we show that the problem can be reformulated as a kind of Monge optimal transport problem. Using this observation, we introduce a Kantorovitch version of the problem and prove that the value of both problems coincide. In the linear case, we thus obtain that the multiple quantile hedging problem can be seen as a semi-discrete optimal transport problem, for which we further introduce the dual problem. We then prove that there is no duality gap, allowing us to design a numerical method based on SGA algorithms to compute the multiple quantile hedging price.",
    "path": "papers/23/08/2308.01121.json",
    "total_tokens": 872,
    "translated_title": "多分位数对冲问题的最优输运方法",
    "translated_abstract": "我们考虑多分位数对冲问题，这是一类包含分位数对冲问题（F{\\\"o}llmer \\& Leukert 1999）和PnL匹配问题（Bouchard \\& Vu 2012）作为特例的部分对冲问题。在非线性完全市场中，我们展示了这个问题可以重构为一种蒙特卡罗最优输运问题。利用这个观察，我们引入了该问题的Kantorovitch版本，并证明了两个问题的价值是相等的。在线性情况下，我们得到多分位数对冲问题可以看作是一种半离散最优输运问题，并进一步引入了对偶问题。然后，我们证明不存在对偶间隙，使我们能够设计基于SGA算法的数值方法来计算多分位数对冲价格。",
    "tldr": "这篇论文提出了一种最优输运方法解决多分位数对冲问题，在非线性市场中，将该问题重构为一个蒙特卡罗最优输运问题，在线性市场中引入了半离散最优输运问题，并设计了基于SGA算法的数值方法来计算多分位数对冲价格。",
    "en_tdlr": "This paper proposes an optimal transport approach to solve the multiple quantile hedging problem. In non-linear markets, the problem is reformulated as a Monge optimal transport problem, while in linear markets, it is treated as a semi-discrete optimal transport problem. A numerical method based on SGA algorithms is designed to compute the multiple quantile hedging price."
}