{
    "title": "Investigation Toward The Economic Feasibility of Personalized Medicine For Healthcare Service Providers: The Case of Bladder Cancer. (arXiv:2308.07924v1 [cs.IR])",
    "abstract": "In today's complex healthcare landscape, the pursuit of delivering optimal patient care while navigating intricate economic dynamics poses a significant challenge for healthcare service providers (HSPs). In this already complex dynamics, the emergence of clinically promising personalized medicine based treatment aims to revolutionize medicine. While personalized medicine holds tremendous potential for enhancing therapeutic outcomes, its integration within resource-constrained HSPs presents formidable challenges. In this study, we investigate the economic feasibility of implementing personalized medicine. The central objective is to strike a balance between catering to individual patient needs and making economically viable decisions. Unlike conventional binary approaches to personalized treatment, we propose a more nuanced perspective by treating personalization as a spectrum. This approach allows for greater flexibility in decision-making and resource allocation. To this end, we propo",
    "link": "http://arxiv.org/abs/2308.07924",
    "context": "Title: Investigation Toward The Economic Feasibility of Personalized Medicine For Healthcare Service Providers: The Case of Bladder Cancer. (arXiv:2308.07924v1 [cs.IR])\nAbstract: In today's complex healthcare landscape, the pursuit of delivering optimal patient care while navigating intricate economic dynamics poses a significant challenge for healthcare service providers (HSPs). In this already complex dynamics, the emergence of clinically promising personalized medicine based treatment aims to revolutionize medicine. While personalized medicine holds tremendous potential for enhancing therapeutic outcomes, its integration within resource-constrained HSPs presents formidable challenges. In this study, we investigate the economic feasibility of implementing personalized medicine. The central objective is to strike a balance between catering to individual patient needs and making economically viable decisions. Unlike conventional binary approaches to personalized treatment, we propose a more nuanced perspective by treating personalization as a spectrum. This approach allows for greater flexibility in decision-making and resource allocation. To this end, we propo",
    "path": "papers/23/08/2308.07924.json",
    "total_tokens": 887,
    "translated_title": "探讨个性化医疗对医疗服务提供者的经济可行性：以膀胱癌为例",
    "translated_abstract": "在当今复杂的医疗环境中，医疗服务提供者在平衡优化患者护理和复杂经济动态方面面临巨大挑战。个性化医疗基于临床上有前景的个性化药物治疗的出现旨在改变医学。尽管个性化医疗有着巨大的潜力提高治疗效果，但在资源有限的医疗服务提供者中进行整合面临巨大挑战。本研究旨在调查实施个性化医疗的经济可行性。其核心目标是在满足个体患者需求和做出经济可行的决策之间取得平衡。与传统的二元个性化治疗方法不同，我们提出了一个更细致的视角，将个性化视为一个连续的过程。这种方法能够在决策和资源配置中提供更大的灵活性。",
    "tldr": "本研究调查了个性化医疗的经济可行性，旨在平衡个体患者需求和经济决策之间的关系。通过将个性化视为一个连续的过程，提供了更大的灵活性。",
    "en_tdlr": "This study investigates the economic feasibility of personalized medicine, aiming to strike a balance between individual patient needs and economic decisions. By treating personalization as a continuous process, it provides greater flexibility."
}