{
    "title": "Towards Spontaneous Style Modeling with Semi-supervised Pre-training for Conversational Text-to-Speech Synthesis. (arXiv:2308.16593v1 [cs.SD])",
    "abstract": "The spontaneous behavior that often occurs in conversations makes speech more human-like compared to reading-style. However, synthesizing spontaneous-style speech is challenging due to the lack of high-quality spontaneous datasets and the high cost of labeling spontaneous behavior. In this paper, we propose a semi-supervised pre-training method to increase the amount of spontaneous-style speech and spontaneous behavioral labels. In the process of semi-supervised learning, both text and speech information are considered for detecting spontaneous behaviors labels in speech. Moreover, a linguistic-aware encoder is used to model the relationship between each sentence in the conversation. Experimental results indicate that our proposed method achieves superior expressive speech synthesis performance with the ability to model spontaneous behavior in spontaneous-style speech and predict reasonable spontaneous behavior from text.",
    "link": "http://arxiv.org/abs/2308.16593",
    "context": "Title: Towards Spontaneous Style Modeling with Semi-supervised Pre-training for Conversational Text-to-Speech Synthesis. (arXiv:2308.16593v1 [cs.SD])\nAbstract: The spontaneous behavior that often occurs in conversations makes speech more human-like compared to reading-style. However, synthesizing spontaneous-style speech is challenging due to the lack of high-quality spontaneous datasets and the high cost of labeling spontaneous behavior. In this paper, we propose a semi-supervised pre-training method to increase the amount of spontaneous-style speech and spontaneous behavioral labels. In the process of semi-supervised learning, both text and speech information are considered for detecting spontaneous behaviors labels in speech. Moreover, a linguistic-aware encoder is used to model the relationship between each sentence in the conversation. Experimental results indicate that our proposed method achieves superior expressive speech synthesis performance with the ability to model spontaneous behavior in spontaneous-style speech and predict reasonable spontaneous behavior from text.",
    "path": "papers/23/08/2308.16593.json",
    "total_tokens": 813,
    "translated_title": "通过半监督预训练实现自发风格建模用于对话文本到语音合成",
    "translated_abstract": "对话中经常发生的自发行为使得语音听起来更加像人类，而不是像朗读。然而，合成自发风格的语音具有挑战性，因为缺乏高质量的自发数据集，并且标记自发行为的成本较高。在本文中，我们提出了一种半监督预训练方法，以增加自发风格语音和自发行为标签的数量。在半监督学习的过程中，考虑了文本和语音信息，以便在语音中检测自发行为标签。此外，使用了一个语言感知编码器来建模对话中每个句子之间的关系。实验结果表明，我们提出的方法在表达性语音合成性能方面具有优越性，能够在自发风格的语音中建模自发行为，并从文本中预测合理的自发行为。",
    "tldr": "本文提出了一种半监督预训练方法，通过增加自发风格语音和自发行为标签的数量，以实现自发风格建模用于对话文本到语音合成。实验结果显示，该方法能够在自发风格的语音中建模自发行为，并从文本中预测合理的自发行为。"
}