{
    "title": "A Novel Self-training Approach for Low-resource Speech Recognition. (arXiv:2308.05269v1 [cs.CL])",
    "abstract": "In this paper, we propose a self-training approach for automatic speech recognition (ASR) for low-resource settings. While self-training approaches have been extensively developed and evaluated for high-resource languages such as English, their applications to low-resource languages like Punjabi have been limited, despite the language being spoken by millions globally. The scarcity of annotated data has hindered the development of accurate ASR systems, especially for low-resource languages (e.g., Punjabi and M\\=aori languages). To address this issue, we propose an effective self-training approach that generates highly accurate pseudo-labels for unlabeled low-resource speech. Our experimental analysis demonstrates that our approach significantly improves word error rate, achieving a relative improvement of 14.94% compared to a baseline model across four real speech datasets. Further, our proposed approach reports the best results on the Common Voice Punjabi dataset.",
    "link": "http://arxiv.org/abs/2308.05269",
    "context": "Title: A Novel Self-training Approach for Low-resource Speech Recognition. (arXiv:2308.05269v1 [cs.CL])\nAbstract: In this paper, we propose a self-training approach for automatic speech recognition (ASR) for low-resource settings. While self-training approaches have been extensively developed and evaluated for high-resource languages such as English, their applications to low-resource languages like Punjabi have been limited, despite the language being spoken by millions globally. The scarcity of annotated data has hindered the development of accurate ASR systems, especially for low-resource languages (e.g., Punjabi and M\\=aori languages). To address this issue, we propose an effective self-training approach that generates highly accurate pseudo-labels for unlabeled low-resource speech. Our experimental analysis demonstrates that our approach significantly improves word error rate, achieving a relative improvement of 14.94% compared to a baseline model across four real speech datasets. Further, our proposed approach reports the best results on the Common Voice Punjabi dataset.",
    "path": "papers/23/08/2308.05269.json",
    "total_tokens": 857,
    "translated_title": "一种新颖的自训练方法用于低资源语音识别",
    "translated_abstract": "本文提出了一种自训练方法，用于低资源设置下的自动语音识别（ASR）。尽管自训练方法在英语等高资源语言上得到了广泛的发展和评估，但在像旁遮普语这样的低资源语言上的应用却很有限，尽管旁遮普语被全球数百万人口使用。标注数据的稀缺性阻碍了准确ASR系统的开发，特别是对于低资源语言（如旁遮普语和毛利语）。为解决这个问题，我们提出了一种有效的自训练方法，为无标签的低资源语音生成高准确度的伪标签。我们的实验分析表明，相对于基线模型，我们的方法显著改善了单词错误率，实现了14.94%的相对改进，同时在四个真实语音数据集上实现了最好的结果。",
    "tldr": "本文提出了一种新颖的自训练方法，用于低资源设置下的自动语音识别，通过生成高准确度的伪标签，显著改善了单词错误率，相对改进达到14.94%。",
    "en_tdlr": "This paper proposes a novel self-training approach for automatic speech recognition (ASR) in low-resource settings. By generating highly accurate pseudo-labels, the proposed approach significantly improves word error rate, achieving a relative improvement of 14.94%."
}