{
    "title": "Fairness and Privacy in Federated Learning and Their Implications in Healthcare. (arXiv:2308.07805v1 [cs.CR])",
    "abstract": "Currently, many contexts exist where distributed learning is difficult or otherwise constrained by security and communication limitations. One common domain where this is a consideration is in Healthcare where data is often governed by data-use-ordinances like HIPAA. On the other hand, larger sample sizes and shared data models are necessary to allow models to better generalize on account of the potential for more variability and balancing underrepresented classes. Federated learning is a type of distributed learning model that allows data to be trained in a decentralized manner. This, in turn, addresses data security, privacy, and vulnerability considerations as data itself is not shared across a given learning network nodes. Three main challenges to federated learning include node data is not independent and identically distributed (iid), clients requiring high levels of communication overhead between peers, and there is the heterogeneity of different clients within a network with re",
    "link": "http://arxiv.org/abs/2308.07805",
    "context": "Title: Fairness and Privacy in Federated Learning and Their Implications in Healthcare. (arXiv:2308.07805v1 [cs.CR])\nAbstract: Currently, many contexts exist where distributed learning is difficult or otherwise constrained by security and communication limitations. One common domain where this is a consideration is in Healthcare where data is often governed by data-use-ordinances like HIPAA. On the other hand, larger sample sizes and shared data models are necessary to allow models to better generalize on account of the potential for more variability and balancing underrepresented classes. Federated learning is a type of distributed learning model that allows data to be trained in a decentralized manner. This, in turn, addresses data security, privacy, and vulnerability considerations as data itself is not shared across a given learning network nodes. Three main challenges to federated learning include node data is not independent and identically distributed (iid), clients requiring high levels of communication overhead between peers, and there is the heterogeneity of different clients within a network with re",
    "path": "papers/23/08/2308.07805.json",
    "total_tokens": 809,
    "translated_title": "在联邦学习中的公平性和隐私问题及其在医疗保健中的影响",
    "translated_abstract": "目前存在许多情境，分布式学习由于安全和通信限制而变得困难。一个常见的考虑因素是医疗保健领域，在这个领域中，数据通常受到HIPAA等数据使用条例的管制。另一方面，更大的样本量和共享数据模型是必要的，以允许模型更好地推广，考虑到更多的变异性和平衡不足的类别。联邦学习是一种分布式学习模型，它允许数据以分散的方式进行训练。这反过来解决了数据安全、隐私和漏洞考虑，因为数据本身并不在给定的学习网络节点之间共享。联邦学习面临的三个主要挑战包括节点数据不是独立同分布的(iid)，客户机需要在对等节点之间进行高水平的通信开销，以及网络中不同客户机的异构性。",
    "tldr": "联邦学习在解决分布式学习中的安全和隐私问题方面具有重要的应用价值，特别是在医疗保健领域。"
}