{
    "title": "Deploying Deep Reinforcement Learning Systems: A Taxonomy of Challenges. (arXiv:2308.12438v1 [cs.LG])",
    "abstract": "Deep reinforcement learning (DRL), leveraging Deep Learning (DL) in reinforcement learning, has shown significant potential in achieving human-level autonomy in a wide range of domains, including robotics, computer vision, and computer games. This potential justifies the enthusiasm and growing interest in DRL in both academia and industry. However, the community currently focuses mostly on the development phase of DRL systems, with little attention devoted to DRL deployment. In this paper, we propose an empirical study on Stack Overflow (SO), the most popular Q&A forum for developers, to uncover and understand the challenges practitioners faced when deploying DRL systems. Specifically, we categorized relevant SO posts by deployment platforms: server/cloud, mobile/embedded system, browser, and game engine. After filtering and manual analysis, we examined 357 SO posts about DRL deployment, investigated the current state, and identified the challenges related to deploying DRL systems. The",
    "link": "http://arxiv.org/abs/2308.12438",
    "context": "Title: Deploying Deep Reinforcement Learning Systems: A Taxonomy of Challenges. (arXiv:2308.12438v1 [cs.LG])\nAbstract: Deep reinforcement learning (DRL), leveraging Deep Learning (DL) in reinforcement learning, has shown significant potential in achieving human-level autonomy in a wide range of domains, including robotics, computer vision, and computer games. This potential justifies the enthusiasm and growing interest in DRL in both academia and industry. However, the community currently focuses mostly on the development phase of DRL systems, with little attention devoted to DRL deployment. In this paper, we propose an empirical study on Stack Overflow (SO), the most popular Q&A forum for developers, to uncover and understand the challenges practitioners faced when deploying DRL systems. Specifically, we categorized relevant SO posts by deployment platforms: server/cloud, mobile/embedded system, browser, and game engine. After filtering and manual analysis, we examined 357 SO posts about DRL deployment, investigated the current state, and identified the challenges related to deploying DRL systems. The",
    "path": "papers/23/08/2308.12438.json",
    "total_tokens": 919,
    "translated_title": "部署深度强化学习系统：挑战分类",
    "translated_abstract": "深度强化学习（DRL）利用深度学习（DL）在强化学习中，已经在包括机器人、计算机视觉和电脑游戏等领域显示出显著潜力，以实现人类水平的自主能力。这种潜力引起了学术界和工业界对DRL的热情和日益增长的兴趣。然而，目前社区主要集中在DRL系统开发阶段，对DRL部署关注较少。在本文中，我们对开发者最流行的问答论坛Stack Overflow（SO）进行了一项实证研究，以揭示和了解从业人员在部署DRL系统时遇到的挑战。具体而言，我们按部署平台对相关SO帖子进行了分类：服务器/云、移动/嵌入式系统、浏览器和游戏引擎。经过过滤和手动分析，我们研究了357个有关DRL部署的SO帖子，调查了当前状况，并确定了与部署DRL系统相关的挑战。",
    "tldr": "本文通过对开发者问答论坛Stack Overflow上的帖子进行实证研究，总结了部署深度强化学习系统所面临的挑战，并针对不同的部署平台进行了分类。",
    "en_tdlr": "This paper presents an empirical study on Stack Overflow to uncover and understand the challenges faced when deploying deep reinforcement learning (DRL) systems. It categorizes the challenges based on different deployment platforms and provides insights into the current state of DRL deployment."
}