{
    "title": "REB: Reducing Biases in Representation for Industrial Anomaly Detection. (arXiv:2308.12577v1 [cs.CV])",
    "abstract": "Existing K-nearest neighbor (KNN) retrieval-based methods usually conduct industrial anomaly detection in two stages: obtain feature representations with a pre-trained CNN model and perform distance measures for defect detection. However, the features are not fully exploited as they ignore domain bias and the difference of local density in feature space, which limits the detection performance. In this paper, we propose Reducing Biases (REB) in representation by considering the domain bias of the pre-trained model and building a self-supervised learning task for better domain adaption with a defect generation strategy (DefectMaker) imitating the natural defects. Additionally, we propose a local density KNN (LDKNN) to reduce the local density bias and obtain effective anomaly detection. We achieve a promising result of 99.5\\% AUROC on the widely used MVTec AD benchmark. We also achieve 88.0\\% AUROC on the challenging MVTec LOCO AD dataset and bring an improvement of 4.7\\% AUROC to the st",
    "link": "http://arxiv.org/abs/2308.12577",
    "context": "Title: REB: Reducing Biases in Representation for Industrial Anomaly Detection. (arXiv:2308.12577v1 [cs.CV])\nAbstract: Existing K-nearest neighbor (KNN) retrieval-based methods usually conduct industrial anomaly detection in two stages: obtain feature representations with a pre-trained CNN model and perform distance measures for defect detection. However, the features are not fully exploited as they ignore domain bias and the difference of local density in feature space, which limits the detection performance. In this paper, we propose Reducing Biases (REB) in representation by considering the domain bias of the pre-trained model and building a self-supervised learning task for better domain adaption with a defect generation strategy (DefectMaker) imitating the natural defects. Additionally, we propose a local density KNN (LDKNN) to reduce the local density bias and obtain effective anomaly detection. We achieve a promising result of 99.5\\% AUROC on the widely used MVTec AD benchmark. We also achieve 88.0\\% AUROC on the challenging MVTec LOCO AD dataset and bring an improvement of 4.7\\% AUROC to the st",
    "path": "papers/23/08/2308.12577.json",
    "total_tokens": 943,
    "translated_title": "REB：降低工业异常检测中的表示偏差",
    "translated_abstract": "现有的K最近邻（KNN）检索方法通常分为两个阶段进行工业异常检测：使用预训练的CNN模型获取特征表示，并执行距离度量进行缺陷检测。然而，由于忽略了领域偏差和特征空间中的局部密度差异，这些特征没有被充分利用，限制了检测性能。本文提出了一种通过考虑预训练模型的领域偏差和构建自监督学习任务以实现更好的领域适应性的方法——Reducing Biases（REB）。同时，通过模仿自然缺陷的缺陷生成策略（DefectMaker），提出了一种本地密度K最近邻（LDKNN）方法来减少局部密度偏差并实现有效的异常检测。我们在广泛使用的MVTec AD基准上实现了99.5％的AUROC，并在具有挑战性的MVTec LOCO AD数据集上实现了88.0％的AUROC，并将AUROC提高了4.7％。",
    "tldr": "本文提出了一种名为REB的方法，通过考虑领域偏差和构建自监督学习任务，以及使用本地密度K最近邻方法，从而降低工业异常检测中的表示偏差，并取得了显著的改进。"
}