{
    "title": "A Controllable Co-Creative Agent for Game System Design. (arXiv:2308.02317v1 [cs.AI])",
    "abstract": "Many advancements have been made in procedural content generation for games, and with mixed-initiative co-creativity, have the potential for great benefits to human designers. However, co-creative systems for game generation are typically limited to specific genres, rules, or games, limiting the creativity of the designer. We seek to model games abstractly enough to apply to any genre, focusing on designing game systems and mechanics, and create a controllable, co-creative agent that can collaborate on these designs. We present a model of games using state-machine-like components and resource flows, a set of controllable metrics, a design evaluator simulating playthroughs with these metrics, and an evolutionary design balancer and generator. We find this system to be both able to express a wide range of games and able to be human-controllable for future co-creative applications.",
    "link": "http://arxiv.org/abs/2308.02317",
    "context": "Title: A Controllable Co-Creative Agent for Game System Design. (arXiv:2308.02317v1 [cs.AI])\nAbstract: Many advancements have been made in procedural content generation for games, and with mixed-initiative co-creativity, have the potential for great benefits to human designers. However, co-creative systems for game generation are typically limited to specific genres, rules, or games, limiting the creativity of the designer. We seek to model games abstractly enough to apply to any genre, focusing on designing game systems and mechanics, and create a controllable, co-creative agent that can collaborate on these designs. We present a model of games using state-machine-like components and resource flows, a set of controllable metrics, a design evaluator simulating playthroughs with these metrics, and an evolutionary design balancer and generator. We find this system to be both able to express a wide range of games and able to be human-controllable for future co-creative applications.",
    "path": "papers/23/08/2308.02317.json",
    "total_tokens": 843,
    "translated_title": "一种可控的合作创作代理用于游戏系统设计",
    "translated_abstract": "在游戏中，程序化内容生成取得了许多进展，并且通过混合倡议合作，对人类设计师具有巨大的潜力。然而，用于游戏生成的合作创作系统通常局限于特定的类型、规则或游戏，限制了设计师的创造力。我们希望对游戏进行足够抽象的建模，以适用于任何类型的游戏，并重点关注游戏系统和机制的设计，并创建一个可控的合作创作代理来共同设计这些游戏。我们提出了使用类似状态机的组件和资源流的游戏模型，一组可控的度量标准，使用这些度量标准进行模拟游玩的设计评估器，以及进化设计平衡器和生成器。我们发现这个系统能够表达广泛的游戏，并且可以为未来的合作创作应用提供人类可控性。",
    "tldr": "这项研究通过创建一个可控的合作创作代理，改善了游戏系统设计中合作创作的局限性，使其适用于任何类型的游戏，并解决了人类设计师的创造力问题。",
    "en_tdlr": "This study improves the limitations of co-creative systems in game system design by creating a controllable co-creative agent that can be applied to any genre of games, thus addressing the creativity issues of human designers."
}