{
    "title": "Spellburst: A Node-based Interface for Exploratory Creative Coding with Natural Language Prompts. (arXiv:2308.03921v1 [cs.SE] CROSS LISTED)",
    "abstract": "Creative coding tasks are often exploratory in nature. When producing digital artwork, artists usually begin with a high-level semantic construct such as a \"stained glass filter\" and programmatically implement it by varying code parameters such as shape, color, lines, and opacity to produce visually appealing results. Based on interviews with artists, it can be effortful to translate semantic constructs to program syntax, and current programming tools don't lend well to rapid creative exploration. To address these challenges, we introduce Spellburst, a large language model (LLM) powered creative-coding environment. Spellburst provides (1) a node-based interface that allows artists to create generative art and explore variations through branching and merging operations, (2) expressive prompt-based interactions to engage in semantic programming, and (3) dynamic prompt-driven interfaces and direct code editing to seamlessly switch between semantic and syntactic exploration. Our evaluation",
    "link": "http://arxiv.org/abs/2308.03921",
    "context": "Title: Spellburst: A Node-based Interface for Exploratory Creative Coding with Natural Language Prompts. (arXiv:2308.03921v1 [cs.SE] CROSS LISTED)\nAbstract: Creative coding tasks are often exploratory in nature. When producing digital artwork, artists usually begin with a high-level semantic construct such as a \"stained glass filter\" and programmatically implement it by varying code parameters such as shape, color, lines, and opacity to produce visually appealing results. Based on interviews with artists, it can be effortful to translate semantic constructs to program syntax, and current programming tools don't lend well to rapid creative exploration. To address these challenges, we introduce Spellburst, a large language model (LLM) powered creative-coding environment. Spellburst provides (1) a node-based interface that allows artists to create generative art and explore variations through branching and merging operations, (2) expressive prompt-based interactions to engage in semantic programming, and (3) dynamic prompt-driven interfaces and direct code editing to seamlessly switch between semantic and syntactic exploration. Our evaluation",
    "path": "papers/23/08/2308.03921.json",
    "total_tokens": 937,
    "translated_title": "Spellburst：基于节点的自然语言提示的探索性创意编码界面",
    "translated_abstract": "创意编码任务通常是探索性的。在制作数字艺术品时，艺术家通常从高级语义构造开始，如“玻璃窗滤镜”，并通过改变代码参数（如形状、颜色、线条和不透明度）来实现它以产生视觉吸引力的结果。根据与艺术家的访谈，将语义构造转化为程序语法可能是费力的，目前的编程工具不利于快速的创造性探索。为了解决这些挑战，我们引入了Spellburst，一个以大型语言模型（LLM）为动力的创意编码环境。Spellburst提供（1）基于节点的界面，允许艺术家创建生成艺术并通过分支和合并操作进行变化探索，（2）基于表达式的提示交互，用于进行语义编程交互，以及（3）基于提示驱动的界面和直接代码编辑，以在语义和句法探索之间无缝切换。",
    "tldr": "Spellburst是一个基于节点的界面，利用大型语言模型（LLM）提供创意编码环境，艺术家可以通过分支和合并操作探索生成艺术的变化，通过基于表达式的提示交互进行语义编程，并且能够在语义和句法探索之间无缝切换。",
    "en_tdlr": "Spellburst is a node-based interface powered by a large language model (LLM) that provides a creative coding environment for artists to explore variations in generative art through branching and merging operations, engage in semantic programming using expressive prompt-based interactions, and seamlessly switch between semantic and syntactic exploration."
}