{
    "title": "Likelihood-based inference and forecasting for trawl processes: a stochastic optimization approach. (arXiv:2308.16092v1 [stat.ME])",
    "abstract": "We consider trawl processes, which are stationary and infinitely divisible stochastic processes and can describe a wide range of statistical properties, such as heavy tails and long memory. In this paper, we develop the first likelihood-based methodology for the inference of real-valued trawl processes and introduce novel deterministic and probabilistic forecasting methods. Being non-Markovian, with a highly intractable likelihood function, trawl processes require the use of composite likelihood functions to parsimoniously capture their statistical properties. We formulate the composite likelihood estimation as a stochastic optimization problem for which it is feasible to implement iterative gradient descent methods. We derive novel gradient estimators with variances that are reduced by several orders of magnitude. We analyze both the theoretical properties and practical implementation details of these estimators and release a Python library which can be used to fit a large class of tr",
    "link": "http://arxiv.org/abs/2308.16092",
    "context": "Title: Likelihood-based inference and forecasting for trawl processes: a stochastic optimization approach. (arXiv:2308.16092v1 [stat.ME])\nAbstract: We consider trawl processes, which are stationary and infinitely divisible stochastic processes and can describe a wide range of statistical properties, such as heavy tails and long memory. In this paper, we develop the first likelihood-based methodology for the inference of real-valued trawl processes and introduce novel deterministic and probabilistic forecasting methods. Being non-Markovian, with a highly intractable likelihood function, trawl processes require the use of composite likelihood functions to parsimoniously capture their statistical properties. We formulate the composite likelihood estimation as a stochastic optimization problem for which it is feasible to implement iterative gradient descent methods. We derive novel gradient estimators with variances that are reduced by several orders of magnitude. We analyze both the theoretical properties and practical implementation details of these estimators and release a Python library which can be used to fit a large class of tr",
    "path": "papers/23/08/2308.16092.json",
    "total_tokens": 900,
    "translated_title": "基于似然的渔网过程推断和预测：一种随机优化方法",
    "translated_abstract": "本文考虑渔网过程，渔网过程是平稳且无限可分的随机过程，可以描述各种统计特性，如重尾和长记忆。我们开发了第一种基于似然的方法来推断实值渔网过程，并引入了新颖的确定性和概率预测方法。由于渔网过程是非马尔科夫过程，似然函数高度复杂，需要使用复合似然函数来简化捕捉其统计特性。我们将复合似然估计问题表示为随机优化问题，可以使用迭代梯度下降方法进行实现。我们提出了具有几个数量级减小方差的新颖梯度估计器。我们分析了这些估计器的理论性质和实际实施细节，并发布了一个Python库，可以用于拟合大类渔网过程。",
    "tldr": "本研究开发了一种基于似然的方法来推断渔网过程，并引入了新颖的预测方法。通过使用复合似然函数和迭代梯度下降方法，我们成功地估计了渔网过程的参数，并减小了估计器的方差。这项研究为进一步研究渔网过程提供了重要的方法学基础。",
    "en_tdlr": "This study develops a likelihood-based methodology for inferring trawl processes and introduces novel forecasting methods. By utilizing composite likelihood functions and iterative gradient descent methods, the parameters of trawl processes are estimated with reduced variance. This research provides important methodological foundations for further investigating trawl processes."
}