{
    "title": "Branches of a Tree: Taking Derivatives of Programs with Discrete and Branching Randomness in High Energy Physics. (arXiv:2308.16680v1 [stat.ML])",
    "abstract": "We propose to apply several gradient estimation techniques to enable the differentiation of programs with discrete randomness in High Energy Physics. Such programs are common in High Energy Physics due to the presence of branching processes and clustering-based analysis. Thus differentiating such programs can open the way for gradient based optimization in the context of detector design optimization, simulator tuning, or data analysis and reconstruction optimization. We discuss several possible gradient estimation strategies, including the recent Stochastic AD method, and compare them in simplified detector design experiments. In doing so we develop, to the best of our knowledge, the first fully differentiable branching program.",
    "link": "http://arxiv.org/abs/2308.16680",
    "context": "Title: Branches of a Tree: Taking Derivatives of Programs with Discrete and Branching Randomness in High Energy Physics. (arXiv:2308.16680v1 [stat.ML])\nAbstract: We propose to apply several gradient estimation techniques to enable the differentiation of programs with discrete randomness in High Energy Physics. Such programs are common in High Energy Physics due to the presence of branching processes and clustering-based analysis. Thus differentiating such programs can open the way for gradient based optimization in the context of detector design optimization, simulator tuning, or data analysis and reconstruction optimization. We discuss several possible gradient estimation strategies, including the recent Stochastic AD method, and compare them in simplified detector design experiments. In doing so we develop, to the best of our knowledge, the first fully differentiable branching program.",
    "path": "papers/23/08/2308.16680.json",
    "total_tokens": 784,
    "translated_title": "树的分支：在高能物理中对具有离散和分支随机性的程序进行求导",
    "translated_abstract": "我们提出应用多种梯度估计技术来实现对在高能物理中具有离散随机性的程序进行求导。由于存在分支过程和基于聚类的分析，此类程序在高能物理中很常见。因此，对这类程序进行求导可以为梯度优化在探测器设计优化、模拟器调整或数据分析和重构优化等方面开辟道路。我们讨论了几种可能的梯度估计策略，包括最近的随机自动微分（Stochastic AD）方法，并在简化的探测器设计实验中进行了比较。在这样做的过程中，我们开发了迄今为止首个完全可微分的分支程序。",
    "tldr": "该论文提出了应用多种梯度估计技术实现对具有离散和分支随机性的程序进行求导的方法，并发展了首个完全可微分的分支程序，这项工作的贡献在于为高能物理中的梯度优化提供了新的可能性。",
    "en_tdlr": "This paper proposes to apply various gradient estimation techniques to enable the differentiation of programs with discrete and branching randomness in High Energy Physics, and develops the first fully differentiable branching program, contributing to new possibilities for gradient optimization in high energy physics."
}