{
    "title": "Guaranteed Stable Quadratic Models and their applications in SINDy and Operator Inference. (arXiv:2308.13819v1 [cs.LG])",
    "abstract": "Scientific machine learning for learning dynamical systems is a powerful tool that combines data-driven modeling models, physics-based modeling, and empirical knowledge. It plays an essential role in an engineering design cycle and digital twinning. In this work, we primarily focus on an operator inference methodology that builds dynamical models, preferably in low-dimension, with a prior hypothesis on the model structure, often determined by known physics or given by experts. Then, for inference, we aim to learn the operators of a model by setting up an appropriate optimization problem. One of the critical properties of dynamical systems is{stability. However, such a property is not guaranteed by the inferred models. In this work, we propose inference formulations to learn quadratic models, which are stable by design. Precisely, we discuss the parameterization of quadratic systems that are locally and globally stable. Moreover, for quadratic systems with no stable point yet bounded (e",
    "link": "http://arxiv.org/abs/2308.13819",
    "context": "Title: Guaranteed Stable Quadratic Models and their applications in SINDy and Operator Inference. (arXiv:2308.13819v1 [cs.LG])\nAbstract: Scientific machine learning for learning dynamical systems is a powerful tool that combines data-driven modeling models, physics-based modeling, and empirical knowledge. It plays an essential role in an engineering design cycle and digital twinning. In this work, we primarily focus on an operator inference methodology that builds dynamical models, preferably in low-dimension, with a prior hypothesis on the model structure, often determined by known physics or given by experts. Then, for inference, we aim to learn the operators of a model by setting up an appropriate optimization problem. One of the critical properties of dynamical systems is{stability. However, such a property is not guaranteed by the inferred models. In this work, we propose inference formulations to learn quadratic models, which are stable by design. Precisely, we discuss the parameterization of quadratic systems that are locally and globally stable. Moreover, for quadratic systems with no stable point yet bounded (e",
    "path": "papers/23/08/2308.13819.json",
    "total_tokens": 832,
    "translated_title": "保证稳定的二次模型及其在SINDy和操作推断中的应用",
    "translated_abstract": "科学机器学习用于学习动力系统是一种强大的工具，它将数据驱动建模、基于物理建模和经验知识相结合。在工程设计循环和数字双胞胎中起着重要的作用。本文主要关注一种操作推断方法，该方法通过在模型结构上提出先验假设（通常由已知物理学或专家给出），从而构建低维动态模型。然后，我们通过设置适当的优化问题来学习模型的运算符以进行推断。动态系统的一个关键属性是稳定性。然而，推断模型无法保证这种属性。本文提出了一种学习二次模型的推断公式，这些模型在设计上是稳定的。具体而言，我们讨论了局部和全局稳定的二次系统的参数化。此外，对于没有稳定点但有界的二次系统：",
    "tldr": "本研究提出了一种学习稳定二次模型的推断方法，通过设置适当的优化问题，可以构建具有局部和全局稳定性的二次系统模型。",
    "en_tdlr": "This study proposes an inference method for learning stable quadratic models, where appropriate optimization problems are set to construct quadratic system models with both local and global stability."
}