{
    "title": "Dual Governance: The intersection of centralized regulation and crowdsourced safety mechanisms for Generative AI. (arXiv:2308.04448v1 [cs.CY])",
    "abstract": "Generative Artificial Intelligence (AI) has seen mainstream adoption lately, especially in the form of consumer-facing, open-ended, text and image generating models. However, the use of such systems raises significant ethical and safety concerns, including privacy violations, misinformation and intellectual property theft. The potential for generative AI to displace human creativity and livelihoods has also been under intense scrutiny. To mitigate these risks, there is an urgent need of policies and regulations responsible and ethical development in the field of generative AI. Existing and proposed centralized regulations by governments to rein in AI face criticisms such as not having sufficient clarity or uniformity, lack of interoperability across lines of jurisdictions, restricting innovation, and hindering free market competition. Decentralized protections via crowdsourced safety tools and mechanisms are a potential alternative. However, they have clear deficiencies in terms of lac",
    "link": "http://arxiv.org/abs/2308.04448",
    "context": "Title: Dual Governance: The intersection of centralized regulation and crowdsourced safety mechanisms for Generative AI. (arXiv:2308.04448v1 [cs.CY])\nAbstract: Generative Artificial Intelligence (AI) has seen mainstream adoption lately, especially in the form of consumer-facing, open-ended, text and image generating models. However, the use of such systems raises significant ethical and safety concerns, including privacy violations, misinformation and intellectual property theft. The potential for generative AI to displace human creativity and livelihoods has also been under intense scrutiny. To mitigate these risks, there is an urgent need of policies and regulations responsible and ethical development in the field of generative AI. Existing and proposed centralized regulations by governments to rein in AI face criticisms such as not having sufficient clarity or uniformity, lack of interoperability across lines of jurisdictions, restricting innovation, and hindering free market competition. Decentralized protections via crowdsourced safety tools and mechanisms are a potential alternative. However, they have clear deficiencies in terms of lac",
    "path": "papers/23/08/2308.04448.json",
    "total_tokens": 959,
    "translated_title": "双重治理：集中监管与众包安全机制在生成AI中的交集",
    "translated_abstract": "生成人工智能（AI）最近在消费者面向的、开放式的文本和图像生成模型方面得到了广泛应用。然而，使用这样的系统引发了重要的伦理和安全问题，包括隐私侵犯、虚假信息和知识产权盗窃。生成AI可能取代人类的创造力和谋生方式也受到了严格审查。为了缓解这些风险，在生成AI领域需要一种负责任和道德的发展政策和监管机制。现有和提议的政府集中监管AI的规定面临诸多批评，例如缺乏足够的明确性和统一性，在不同司法辖区之间缺乏互操作性，限制创新，阻碍自由市场竞争。分散的众包安全工具和机制是一个潜在的替代方案。然而，它们在缺乏统一性、合规性和透明性方面存在明显的不足。",
    "tldr": "本文讨论了生成AI领域的治理问题，提出了将集中监管与众包安全机制相结合的双重治理方式。集中监管存在缺乏明确性和统一性等问题，而众包安全机制则存在缺乏统一性和合规性的不足。该研究旨在促进生成AI领域的负责任和道德发展。",
    "en_tdlr": "This paper discusses the governance issues in the field of generative AI and proposes dual governance by combining centralized regulation and crowdsourced safety mechanisms. Centralized regulation faces criticisms such as lack of clarity and uniformity, while crowdsourced safety mechanisms have deficiencies in terms of uniformity and compliance. The study aims to promote responsible and ethical development in the field of generative AI."
}