{
    "title": "Seeing through the Brain: Image Reconstruction of Visual Perception from Human Brain Signals. (arXiv:2308.02510v1 [eess.IV])",
    "abstract": "Seeing is believing, however, the underlying mechanism of how human visual perceptions are intertwined with our cognitions is still a mystery. Thanks to the recent advances in both neuroscience and artificial intelligence, we have been able to record the visually evoked brain activities and mimic the visual perception ability through computational approaches. In this paper, we pay attention to visual stimuli reconstruction by reconstructing the observed images based on portably accessible brain signals, i.e., electroencephalography (EEG) data. Since EEG signals are dynamic in the time-series format and are notorious to be noisy, processing and extracting useful information requires more dedicated efforts; In this paper, we propose a comprehensive pipeline, named NeuroImagen, for reconstructing visual stimuli images from EEG signals. Specifically, we incorporate a novel multi-level perceptual information decoding to draw multi-grained outputs from the given EEG data. A latent diffusion ",
    "link": "http://arxiv.org/abs/2308.02510",
    "context": "Title: Seeing through the Brain: Image Reconstruction of Visual Perception from Human Brain Signals. (arXiv:2308.02510v1 [eess.IV])\nAbstract: Seeing is believing, however, the underlying mechanism of how human visual perceptions are intertwined with our cognitions is still a mystery. Thanks to the recent advances in both neuroscience and artificial intelligence, we have been able to record the visually evoked brain activities and mimic the visual perception ability through computational approaches. In this paper, we pay attention to visual stimuli reconstruction by reconstructing the observed images based on portably accessible brain signals, i.e., electroencephalography (EEG) data. Since EEG signals are dynamic in the time-series format and are notorious to be noisy, processing and extracting useful information requires more dedicated efforts; In this paper, we propose a comprehensive pipeline, named NeuroImagen, for reconstructing visual stimuli images from EEG signals. Specifically, we incorporate a novel multi-level perceptual information decoding to draw multi-grained outputs from the given EEG data. A latent diffusion ",
    "path": "papers/23/08/2308.02510.json",
    "total_tokens": 860,
    "translated_title": "窥视大脑：通过人脑信号重建视觉知觉的图像",
    "translated_abstract": "见到就信，然而人类视觉知觉与认知的基本机制仍是一个谜。由于神经科学和人工智能的最近进展，我们能够记录到视觉诱发的脑活动，并通过计算方法模拟视觉感知能力。本文关注通过重建观察到的图像来重建视觉刺激，基于易于获得的脑信号，即脑电图（EEG）数据。由于脑电图信号是动态的时间序列格式，同时也因有噪音而臭名昭著，处理和提取有用信息需要更多的专门工作；在本文中，我们提出了一个综合管道，名为NeuroImagen，用于从脑电图信号中重建视觉刺激图像。具体来说，我们结合了新颖的多层感知信息解码方法，以从给定的脑电图数据中获取多粒度的输出。",
    "tldr": "本文通过重建观察到的图像来揭示人脑对视觉刺激的知觉机制，并提出了一种名为NeuroImagen的综合管道，利用脑电图信号重建视觉刺激图像。",
    "en_tdlr": "This paper reveals the mechanism of human brain's perception of visual stimuli by reconstructing observed images, and proposes a comprehensive pipeline called NeuroImagen to reconstruct visual stimuli images using EEG signals."
}