{
    "title": "AMaizeD: An End to End Pipeline for Automatic Maize Disease Detection. (arXiv:2308.03766v1 [cs.CV])",
    "abstract": "This research paper presents AMaizeD: An End to End Pipeline for Automatic Maize Disease Detection, an automated framework for early detection of diseases in maize crops using multispectral imagery obtained from drones. A custom hand-collected dataset focusing specifically on maize crops was meticulously gathered by expert researchers and agronomists. The dataset encompasses a diverse range of maize varieties, cultivation practices, and environmental conditions, capturing various stages of maize growth and disease progression. By leveraging multispectral imagery, the framework benefits from improved spectral resolution and increased sensitivity to subtle changes in plant health. The proposed framework employs a combination of convolutional neural networks (CNNs) as feature extractors and segmentation techniques to identify both the maize plants and their associated diseases. Experimental results demonstrate the effectiveness of the framework in detecting a range of maize diseases, incl",
    "link": "http://arxiv.org/abs/2308.03766",
    "context": "Title: AMaizeD: An End to End Pipeline for Automatic Maize Disease Detection. (arXiv:2308.03766v1 [cs.CV])\nAbstract: This research paper presents AMaizeD: An End to End Pipeline for Automatic Maize Disease Detection, an automated framework for early detection of diseases in maize crops using multispectral imagery obtained from drones. A custom hand-collected dataset focusing specifically on maize crops was meticulously gathered by expert researchers and agronomists. The dataset encompasses a diverse range of maize varieties, cultivation practices, and environmental conditions, capturing various stages of maize growth and disease progression. By leveraging multispectral imagery, the framework benefits from improved spectral resolution and increased sensitivity to subtle changes in plant health. The proposed framework employs a combination of convolutional neural networks (CNNs) as feature extractors and segmentation techniques to identify both the maize plants and their associated diseases. Experimental results demonstrate the effectiveness of the framework in detecting a range of maize diseases, incl",
    "path": "papers/23/08/2308.03766.json",
    "total_tokens": 863,
    "translated_title": "AMaizeD: 一种自动玉米病害检测的端到端流程",
    "translated_abstract": "本研究论文提出了一种名为AMaizeD的自动化框架，用于利用来自无人机的多光谱图像对玉米作物中病害的早期检测。专家研究人员和农学家通过精心收集的数据集，聚焦于玉米作物，收集了各种玉米品种、栽培实践和环境条件，捕捉了玉米生长和病害发展的各个阶段。通过利用多光谱图像，该框架可以获得改进的光谱分辨率和对植物健康微小变化的增强敏感性。所提出的框架采用卷积神经网络（CNN）作为特征提取器和分割技术，识别玉米植株及其相关病害。实验结果表明，该框架在检测各种玉米病害方面具有有效性。",
    "tldr": "AMaizeD是一种自动化框架，利用无人机获取的多光谱图像，通过卷积神经网络和分割技术实现了对玉米作物病害的早期检测。"
}