{
    "title": "ALFA -- Leveraging All Levels of Feature Abstraction for Enhancing the Generalization of Histopathology Image Classification Across Unseen Hospitals. (arXiv:2308.03936v1 [cs.CV])",
    "abstract": "We propose an exhaustive methodology that leverages all levels of feature abstraction, targeting an enhancement in the generalizability of image classification to unobserved hospitals. Our approach incorporates augmentation-based self-supervision with common distribution shifts in histopathology scenarios serving as the pretext task. This enables us to derive invariant features from training images without relying on training labels, thereby covering different abstraction levels. Moving onto the subsequent abstraction level, we employ a domain alignment module to facilitate further extraction of invariant features across varying training hospitals. To represent the highly specific features of participating hospitals, an encoder is trained to classify hospital labels, independent of their diagnostic labels. The features from each of these encoders are subsequently disentangled to minimize redundancy and segregate the features. This representation, which spans a broad spectrum of semanti",
    "link": "http://arxiv.org/abs/2308.03936",
    "context": "Title: ALFA -- Leveraging All Levels of Feature Abstraction for Enhancing the Generalization of Histopathology Image Classification Across Unseen Hospitals. (arXiv:2308.03936v1 [cs.CV])\nAbstract: We propose an exhaustive methodology that leverages all levels of feature abstraction, targeting an enhancement in the generalizability of image classification to unobserved hospitals. Our approach incorporates augmentation-based self-supervision with common distribution shifts in histopathology scenarios serving as the pretext task. This enables us to derive invariant features from training images without relying on training labels, thereby covering different abstraction levels. Moving onto the subsequent abstraction level, we employ a domain alignment module to facilitate further extraction of invariant features across varying training hospitals. To represent the highly specific features of participating hospitals, an encoder is trained to classify hospital labels, independent of their diagnostic labels. The features from each of these encoders are subsequently disentangled to minimize redundancy and segregate the features. This representation, which spans a broad spectrum of semanti",
    "path": "papers/23/08/2308.03936.json",
    "total_tokens": 916,
    "translated_title": "ALFA - 利用各个层次的特征抽象来增强组织病理学图像分类在未知医院中的泛化能力",
    "translated_abstract": "我们提出了一种全面的方法，利用各个层次的特征抽象，旨在提高图像分类在未知医院中的泛化能力。我们的方法结合了基于增强的自监督学习和病理学场景中的常见分布偏移作为前提任务。这使我们能够从训练图像中提取不变特征，而不依赖于训练标签，从而涵盖不同的抽象层次。在进一步的抽象层次上，我们利用域对齐模块来进一步提取在不同训练医院中的不变特征。为了表示参与医院的高度特定特征，我们训练了一个编码器来对医院标签进行分类，而不考虑诊断标签。然后，我们对来自每个编码器的特征进行解缠以最小化冗余并分离特征。这种表示涵盖了广泛的语义特征。",
    "tldr": "ALFA使用各个层次的特征抽象来增强组织病理学图像分类在未知医院中的泛化能力，并通过自监督学习和域对齐实现了对不变特征的提取，以及对参与医院的高度特定特征的表示与分类。"
}