{
    "title": "Generating and Explaining Corner Cases Using Learnt Probabilistic Lane Graphs. (arXiv:2308.13658v1 [cs.AI])",
    "abstract": "Validating the safety of Autonomous Vehicles (AVs) operating in open-ended, dynamic environments is challenging as vehicles will eventually encounter safety-critical situations for which there is not representative training data. By increasing the coverage of different road and traffic conditions and by including corner cases in simulation-based scenario testing, the safety of AVs can be improved. However, the creation of corner case scenarios including multiple agents is non-trivial. Our approach allows engineers to generate novel, realistic corner cases based on historic traffic data and to explain why situations were safety-critical. In this paper, we introduce Probabilistic Lane Graphs (PLGs) to describe a finite set of lane positions and directions in which vehicles might travel. The structure of PLGs is learnt directly from spatio-temporal traffic data. The graph model represents the actions of the drivers in response to a given state in the form of a probabilistic policy. We use",
    "link": "http://arxiv.org/abs/2308.13658",
    "context": "Title: Generating and Explaining Corner Cases Using Learnt Probabilistic Lane Graphs. (arXiv:2308.13658v1 [cs.AI])\nAbstract: Validating the safety of Autonomous Vehicles (AVs) operating in open-ended, dynamic environments is challenging as vehicles will eventually encounter safety-critical situations for which there is not representative training data. By increasing the coverage of different road and traffic conditions and by including corner cases in simulation-based scenario testing, the safety of AVs can be improved. However, the creation of corner case scenarios including multiple agents is non-trivial. Our approach allows engineers to generate novel, realistic corner cases based on historic traffic data and to explain why situations were safety-critical. In this paper, we introduce Probabilistic Lane Graphs (PLGs) to describe a finite set of lane positions and directions in which vehicles might travel. The structure of PLGs is learnt directly from spatio-temporal traffic data. The graph model represents the actions of the drivers in response to a given state in the form of a probabilistic policy. We use",
    "path": "papers/23/08/2308.13658.json",
    "total_tokens": 870,
    "translated_title": "使用学习到的概率车道图来生成和解释角落情况",
    "translated_abstract": "在开放动态环境中验证自动驾驶汽车（AV）的安全性具有挑战性，因为车辆最终会遇到没有代表性训练数据的安全关键情况。通过在基于模拟的场景测试中增加不同的道路和交通条件的覆盖范围，并包括角落情况，可以提高AV的安全性。然而，包含多个代理的角落情况场景的创建是非常困难的。我们的方法可以让工程师基于历史交通数据生成新颖而逼真的角落情况，并解释为什么这些情况是安全关键的。在本文中，我们引入了概率车道图（PLGs）来描述车辆可能行驶的有限一组车道位置和方向。PLGs的结构是直接从时空交通数据中学习得到的。图模型以概率策略的形式表示驾驶员对给定状态的响应行为。",
    "tldr": "本论文提出了使用概率车道图生成和解释角落情况的方法，该方法基于历史交通数据生成新颖而逼真的角落情况，以提高自动驾驶车辆的安全性。",
    "en_tdlr": "This paper introduces a method for generating and explaining corner cases using probabilistic lane graphs, which allows engineers to generate novel and realistic corner cases based on historical traffic data to improve the safety of autonomous vehicles."
}