{
    "title": "Thermodynamic Computing via Autonomous Quantum Thermal Machines. (arXiv:2308.15905v1 [quant-ph])",
    "abstract": "We develop a physics-based model for classical computation based on autonomous quantum thermal machines. These machines consist of few interacting quantum bits (qubits) connected to several environments at different temperatures. Heat flows through the machine are here exploited for computing. The process starts by setting the temperatures of the environments according to the logical input. The machine evolves, eventually reaching a non-equilibrium steady state, from which the output of the computation can be determined via the temperature of an auxilliary finite-size reservoir. Such a machine, which we term a \"thermodynamic neuron\", can implement any linearly-separable function, and we discuss explicitly the cases of NOT, 3-majority and NOR gates. In turn, we show that a network of thermodynamic neurons can perform any desired function. We discuss the close connection between our model and artificial neurons (perceptrons), and argue that our model provides an alternative physics-based",
    "link": "http://arxiv.org/abs/2308.15905",
    "context": "Title: Thermodynamic Computing via Autonomous Quantum Thermal Machines. (arXiv:2308.15905v1 [quant-ph])\nAbstract: We develop a physics-based model for classical computation based on autonomous quantum thermal machines. These machines consist of few interacting quantum bits (qubits) connected to several environments at different temperatures. Heat flows through the machine are here exploited for computing. The process starts by setting the temperatures of the environments according to the logical input. The machine evolves, eventually reaching a non-equilibrium steady state, from which the output of the computation can be determined via the temperature of an auxilliary finite-size reservoir. Such a machine, which we term a \"thermodynamic neuron\", can implement any linearly-separable function, and we discuss explicitly the cases of NOT, 3-majority and NOR gates. In turn, we show that a network of thermodynamic neurons can perform any desired function. We discuss the close connection between our model and artificial neurons (perceptrons), and argue that our model provides an alternative physics-based",
    "path": "papers/23/08/2308.15905.json",
    "total_tokens": 877,
    "translated_title": "通过自主量子热机实现热力学计算",
    "translated_abstract": "我们基于自主量子热机开发了一个基于物理的模型，用于经典计算。这些机器由少数相互作用的量子位（qubits）与不同温度的几个环境相连。通过机器的热流进行计算。过程从根据逻辑输入设定环境温度开始。机器演化，最终达到非平衡稳态，通过辅助有限尺寸储存池的温度可以确定计算结果。这样的机器，我们称之为“热力学神经元”，可以实现任何线性可分离函数，我们明确讨论了NOT，3-majority和NOR门的情况。反过来，我们展示了热力学神经元网络可以执行任何需要的函数。我们讨论了我们的模型与人工神经元（感知器）之间的密切关系，并认为我们的模型提供了一种基于物理的替代方法。",
    "tldr": "通过自主量子热机实现了热力学计算模型。通过热流进行计算，可实现任何线性可分离函数，并可扩展到神经元网络执行任何 needed功能。"
}