{
    "title": "A Transformer-based Prediction Method for Depth of Anesthesia During Target-controlled Infusion of Propofol and Remifentanil. (arXiv:2308.01929v1 [cs.LG])",
    "abstract": "Accurately predicting anesthetic effects is essential for target-controlled infusion systems. The traditional (PK-PD) models for Bispectral index (BIS) prediction require manual selection of model parameters, which can be challenging in clinical settings. Recently proposed deep learning methods can only capture general trends and may not predict abrupt changes in BIS. To address these issues, we propose a transformer-based method for predicting the depth of anesthesia (DOA) using drug infusions of propofol and remifentanil. Our method employs long short-term memory (LSTM) and gate residual network (GRN) networks to improve the efficiency of feature fusion and applies an attention mechanism to discover the interactions between the drugs. We also use label distribution smoothing and reweighting losses to address data imbalance. Experimental results show that our proposed method outperforms traditional PK-PD models and previous deep learning methods, effectively predicting anesthetic dept",
    "link": "http://arxiv.org/abs/2308.01929",
    "context": "Title: A Transformer-based Prediction Method for Depth of Anesthesia During Target-controlled Infusion of Propofol and Remifentanil. (arXiv:2308.01929v1 [cs.LG])\nAbstract: Accurately predicting anesthetic effects is essential for target-controlled infusion systems. The traditional (PK-PD) models for Bispectral index (BIS) prediction require manual selection of model parameters, which can be challenging in clinical settings. Recently proposed deep learning methods can only capture general trends and may not predict abrupt changes in BIS. To address these issues, we propose a transformer-based method for predicting the depth of anesthesia (DOA) using drug infusions of propofol and remifentanil. Our method employs long short-term memory (LSTM) and gate residual network (GRN) networks to improve the efficiency of feature fusion and applies an attention mechanism to discover the interactions between the drugs. We also use label distribution smoothing and reweighting losses to address data imbalance. Experimental results show that our proposed method outperforms traditional PK-PD models and previous deep learning methods, effectively predicting anesthetic dept",
    "path": "papers/23/08/2308.01929.json",
    "total_tokens": 1043,
    "translated_title": "一种基于Transformer的预测靶控输注丙泊酚和瑞芬太尼麻醉深度的方法",
    "translated_abstract": "准确预测麻醉效果对于靶控输注系统至关重要。传统的药物动力学-药效学模型需要手动选择模型参数，在临床环境中可能具有挑战性。最近提出的深度学习方法只能捕捉到一般趋势，可能无法预测BIS的突变。为了解决这些问题，我们提出了一种基于Transformer的方法，利用丙泊酚和瑞芬太尼的药物输注来预测麻醉深度。我们的方法采用了长短时记忆（LSTM）和门控残差网络（GRN）来提高特征融合的效率，并应用了注意机制来发现药物之间的相互作用。我们还使用标签分布平滑和重新加权损失来处理数据不平衡。实验结果表明，我们提出的方法优于传统的PK-PD模型和先前的深度学习方法，能够有效预测麻醉深度。",
    "tldr": "这项研究提出了一种基于Transformer的方法来预测丙泊酚和瑞芬太尼的麻醉深度。该方法通过利用长短时记忆和门控残差网络来提高特征融合的效率，并应用注意机制来发现药物之间的相互作用。实验证明，该方法优于传统的PK-PD模型和先前的深度学习方法，能够有效预测麻醉深度。",
    "en_tdlr": "This study proposes a Transformer-based method for predicting the depth of anesthesia using propofol and remifentanil drug infusions. The method improves feature fusion efficiency using long short-term memory and gate residual network, and utilizes an attention mechanism to discover drug interactions. Experimental results show that it outperforms traditional PK-PD models and previous deep learning methods in accurately predicting anesthesia depth."
}