{
    "title": "HopPG: Self-Iterative Program Generation for Multi-Hop Question Answering over Heterogeneous Knowledge. (arXiv:2308.11257v1 [cs.CL])",
    "abstract": "The semantic parsing-based method is an important research branch for knowledge-based question answering. It usually generates executable programs lean upon the question and then conduct them to reason answers over a knowledge base. Benefit from this inherent mechanism, it has advantages in the performance and the interpretability. However,traditional semantic parsing methods usually generate a complete program before executing it, which struggles with multi-hop question answering over heterogeneous knowledge. Firstly,a complete multi-hop program relies on multiple heterogeneous supporting facts, and it is difficult for models to receive these facts simultaneously. Secondly,these methods ignore the interaction information between the previous-hop execution result and the current-hop program generation. To alleviate these challenges, we propose a self-iterative framework for multi-hop program generation (HopPG) over heterogeneous knowledge, which leverages the previous-hop execution res",
    "link": "http://arxiv.org/abs/2308.11257",
    "context": "Title: HopPG: Self-Iterative Program Generation for Multi-Hop Question Answering over Heterogeneous Knowledge. (arXiv:2308.11257v1 [cs.CL])\nAbstract: The semantic parsing-based method is an important research branch for knowledge-based question answering. It usually generates executable programs lean upon the question and then conduct them to reason answers over a knowledge base. Benefit from this inherent mechanism, it has advantages in the performance and the interpretability. However,traditional semantic parsing methods usually generate a complete program before executing it, which struggles with multi-hop question answering over heterogeneous knowledge. Firstly,a complete multi-hop program relies on multiple heterogeneous supporting facts, and it is difficult for models to receive these facts simultaneously. Secondly,these methods ignore the interaction information between the previous-hop execution result and the current-hop program generation. To alleviate these challenges, we propose a self-iterative framework for multi-hop program generation (HopPG) over heterogeneous knowledge, which leverages the previous-hop execution res",
    "path": "papers/23/08/2308.11257.json",
    "total_tokens": 854,
    "translated_title": "HopPG：自我迭代的异构知识多跳问答程序生成",
    "translated_abstract": "语义解析方法是基于知识的问答研究中的一个重要分支。它通常基于问题生成可执行程序，并通过知识库进行推理得出答案。由于这种内在机制，它在性能和可解释性方面具有优势。然而，传统的语义解析方法通常在执行之前生成完整的程序，这在处理多跳问题和异构知识时存在困难。首先，完整的多跳程序依赖于多个异构的支持事实，模型很难同时获取这些事实。其次，这些方法忽视了前几跳执行结果与当前跳程序生成之间的交互信息。为了解决这些挑战，我们提出了一种针对异构知识的自我迭代多跳程序生成框架（HopPG），它利用了前几跳的执行结果，并根据它们生成下一跳的程序。",
    "tldr": "本文提出了一种针对多跳问答的自我迭代程序生成框架（HopPG），该框架解决了处理异构知识和多跳问题时所面临的困难，并利用了前几跳的执行结果来生成下一跳的程序。",
    "en_tdlr": "This paper proposes a self-iterative program generation framework (HopPG) for multi-hop question answering, which addresses challenges in dealing with heterogeneous knowledge and multi-hop questions, and utilizes the execution results of previous hops to generate the program for the next hop."
}