{
    "title": "FocalDreamer: Text-driven 3D Editing via Focal-fusion Assembly. (arXiv:2308.10608v2 [cs.CV] UPDATED)",
    "abstract": "While text-3D editing has made significant strides in leveraging score distillation sampling, emerging approaches still fall short in delivering separable, precise and consistent outcomes that are vital to content creation. In response, we introduce FocalDreamer, a framework that merges base shape with editable parts according to text prompts for fine-grained editing within desired regions. Specifically, equipped with geometry union and dual-path rendering, FocalDreamer assembles independent 3D parts into a complete object, tailored for convenient instance reuse and part-wise control. We propose geometric focal loss and style consistency regularization, which encourage focal fusion and congruent overall appearance. Furthermore, FocalDreamer generates high-fidelity geometry and PBR textures which are compatible with widely-used graphics engines. Extensive experiments have highlighted the superior editing capabilities of FocalDreamer in both quantitative and qualitative evaluations.",
    "link": "http://arxiv.org/abs/2308.10608",
    "context": "Title: FocalDreamer: Text-driven 3D Editing via Focal-fusion Assembly. (arXiv:2308.10608v2 [cs.CV] UPDATED)\nAbstract: While text-3D editing has made significant strides in leveraging score distillation sampling, emerging approaches still fall short in delivering separable, precise and consistent outcomes that are vital to content creation. In response, we introduce FocalDreamer, a framework that merges base shape with editable parts according to text prompts for fine-grained editing within desired regions. Specifically, equipped with geometry union and dual-path rendering, FocalDreamer assembles independent 3D parts into a complete object, tailored for convenient instance reuse and part-wise control. We propose geometric focal loss and style consistency regularization, which encourage focal fusion and congruent overall appearance. Furthermore, FocalDreamer generates high-fidelity geometry and PBR textures which are compatible with widely-used graphics engines. Extensive experiments have highlighted the superior editing capabilities of FocalDreamer in both quantitative and qualitative evaluations.",
    "path": "papers/23/08/2308.10608.json",
    "total_tokens": 904,
    "translated_title": "FocalDreamer:基于文本驱动的焦点融合装配的3D编辑",
    "translated_abstract": "虽然文本驱动的3D编辑在利用分数蒸馏采样方面取得了显著进展，但新兴方法仍然无法提供内容创作所必需的可分离、精确和一致的结果。为了解决这个问题，我们介绍了FocalDreamer，这是一个根据文本提示将基本形状与可编辑部分合并的框架，用于对所需区域进行细粒度编辑。具体来说，FocalDreamer使用几何联合和双路径渲染将独立的3D部分组装成完整的对象，方便实例重用和部分控制。我们提出了几何焦点损失和风格一致性正则化，促进焦点融合和一致的整体外观。此外，FocalDreamer生成与广泛使用的图形引擎兼容的高保真度的几何和PBR纹理。大量实验证明了FocalDreamer在定量和定性评估中的优秀编辑能力。",
    "tldr": "FocalDreamer是一个基于文本驱动的3D编辑框架，能够通过焦点融合装配的方式实现精细化编辑，并且在几何和风格上能够保持整体一致性。实验证明了FocalDreamer在编辑能力上的优势。",
    "en_tdlr": "FocalDreamer is a text-driven 3D editing framework that allows fine-grained editing through focal-fusion assembly and maintains overall consistency in geometry and style. The experiments demonstrate the superior editing capabilities of FocalDreamer."
}