{
    "title": "Skill Transformer: A Monolithic Policy for Mobile Manipulation. (arXiv:2308.09873v1 [cs.LG])",
    "abstract": "We present Skill Transformer, an approach for solving long-horizon robotic tasks by combining conditional sequence modeling and skill modularity. Conditioned on egocentric and proprioceptive observations of a robot, Skill Transformer is trained end-to-end to predict both a high-level skill (e.g., navigation, picking, placing), and a whole-body low-level action (e.g., base and arm motion), using a transformer architecture and demonstration trajectories that solve the full task. It retains the composability and modularity of the overall task through a skill predictor module while reasoning about low-level actions and avoiding hand-off errors, common in modular approaches. We test Skill Transformer on an embodied rearrangement benchmark and find it performs robust task planning and low-level control in new scenarios, achieving a 2.5x higher success rate than baselines in hard rearrangement problems.",
    "link": "http://arxiv.org/abs/2308.09873",
    "context": "Title: Skill Transformer: A Monolithic Policy for Mobile Manipulation. (arXiv:2308.09873v1 [cs.LG])\nAbstract: We present Skill Transformer, an approach for solving long-horizon robotic tasks by combining conditional sequence modeling and skill modularity. Conditioned on egocentric and proprioceptive observations of a robot, Skill Transformer is trained end-to-end to predict both a high-level skill (e.g., navigation, picking, placing), and a whole-body low-level action (e.g., base and arm motion), using a transformer architecture and demonstration trajectories that solve the full task. It retains the composability and modularity of the overall task through a skill predictor module while reasoning about low-level actions and avoiding hand-off errors, common in modular approaches. We test Skill Transformer on an embodied rearrangement benchmark and find it performs robust task planning and low-level control in new scenarios, achieving a 2.5x higher success rate than baselines in hard rearrangement problems.",
    "path": "papers/23/08/2308.09873.json",
    "total_tokens": 856,
    "translated_title": "Skill Transformer: 移动操作的单体策略",
    "translated_abstract": "我们提出了Skill Transformer，一种通过结合条件序列建模和技能模块化来解决长时间跨度机器人任务的方法。在机器人的自我中心和感知观察的条件下，Skill Transformer被端到端地训练以预测高级技能（如导航、拾取、放置）和整体低级动作（如底盘和手臂运动），采用transformer架构和解决完整任务的示范轨迹。通过技能预测模块，它保持了整体任务的组合性和模块性，同时推理低级动作并避免了模块方法中常见的交接错误。我们在一个基于实体的重新排列基准测试上对Skill Transformer进行了测试，并发现它在新场景中表现出强大的任务规划和低级控制能力，在困难的重新排列问题上的成功率比基准模型高出2.5倍。",
    "tldr": "Skill Transformer是一个解决长时间跨度机器人任务的方法，通过结合条件序列建模和技能模块化，它能够在新场景中实现强大的任务规划和低级控制能力，相比基准模型，成功率提高了2.5倍。",
    "en_tdlr": "Skill Transformer is an approach for solving long-horizon robotic tasks by combining conditional sequence modeling and skill modularity. It achieves robust task planning and low-level control in new scenarios, with a 2.5x higher success rate than baselines in hard rearrangement problems."
}