{
    "title": "Exploring Deep Learning for Full-disk Solar Flare Prediction with Empirical Insights from Guided Grad-CAM Explanations. (arXiv:2308.15712v1 [astro-ph.SR])",
    "abstract": "This study progresses solar flare prediction research by presenting a full-disk deep-learning model to forecast $\\geq$M-class solar flares and evaluating its efficacy on both central (within $\\pm$70$^\\circ$) and near-limb (beyond $\\pm$70$^\\circ$) events, showcasing qualitative assessment of post hoc explanations for the model's predictions, and providing empirical findings from human-centered quantitative assessments of these explanations. Our model is trained using hourly full-disk line-of-sight magnetogram images to predict $\\geq$M-class solar flares within the subsequent 24-hour prediction window. Additionally, we apply the Guided Gradient-weighted Class Activation Mapping (Guided Grad-CAM) attribution method to interpret our model's predictions and evaluate the explanations. Our analysis unveils that full-disk solar flare predictions correspond with active region characteristics. The following points represent the most important findings of our study: (1) Our deep learning models a",
    "link": "http://arxiv.org/abs/2308.15712",
    "context": "Title: Exploring Deep Learning for Full-disk Solar Flare Prediction with Empirical Insights from Guided Grad-CAM Explanations. (arXiv:2308.15712v1 [astro-ph.SR])\nAbstract: This study progresses solar flare prediction research by presenting a full-disk deep-learning model to forecast $\\geq$M-class solar flares and evaluating its efficacy on both central (within $\\pm$70$^\\circ$) and near-limb (beyond $\\pm$70$^\\circ$) events, showcasing qualitative assessment of post hoc explanations for the model's predictions, and providing empirical findings from human-centered quantitative assessments of these explanations. Our model is trained using hourly full-disk line-of-sight magnetogram images to predict $\\geq$M-class solar flares within the subsequent 24-hour prediction window. Additionally, we apply the Guided Gradient-weighted Class Activation Mapping (Guided Grad-CAM) attribution method to interpret our model's predictions and evaluate the explanations. Our analysis unveils that full-disk solar flare predictions correspond with active region characteristics. The following points represent the most important findings of our study: (1) Our deep learning models a",
    "path": "papers/23/08/2308.15712.json",
    "total_tokens": 916,
    "translated_title": "用指导的Grad-CAM解释探索深度学习在全球盘面太阳耀斑预测中的应用",
    "translated_abstract": "本研究通过展示一个全盘面深度学习模型来进一步推进太阳耀斑预测研究，并在中心（在±70°范围内）和近旁（超过±70°范围外）事件上评估其有效性，并展示了模型预测的事后解释的定性评估，并提供了基于人为评估这些解释的经验性发现。我们的模型使用每小时的全盘面磁线图像进行训练，以预测在接下来的24小时预测窗口内的M级太阳耀斑。此外，我们采用了指导的梯度权重类激活映射（Guided Grad-CAM）归因方法来解释我们模型的预测并评估解释的结果。我们的分析揭示了全盘面太阳耀斑预测与活动区特征的相对应关系。",
    "tldr": "本研究通过引入指导的Grad-CAM解释，展示了一个全盘面的深度学习模型在太阳耀斑预测中的应用，并通过定性和定量的评估分析发现了活动区特征与太阳耀斑预测之间的关联。",
    "en_tdlr": "This study explores the application of a full-disk deep learning model for solar flare prediction using guided Grad-CAM explanations. The findings reveal the correlation between active region characteristics and solar flare predictions, as evaluated through qualitative and quantitative assessments."
}