{
    "title": "Business Metric-Aware Forecasting for Inventory Management. (arXiv:2308.13118v1 [cs.LG])",
    "abstract": "Time-series forecasts play a critical role in business planning. However, forecasters typically optimize objectives that are agnostic to downstream business goals and thus can produce forecasts misaligned with business preferences. In this work, we demonstrate that optimization of conventional forecasting metrics can often lead to sub-optimal downstream business performance. Focusing on the inventory management setting, we derive an efficient procedure for computing and optimizing proxies of common downstream business metrics in an end-to-end differentiable manner. We explore a wide range of plausible cost trade-off scenarios, and empirically demonstrate that end-to-end optimization often outperforms optimization of standard business-agnostic forecasting metrics (by up to 45.7% for a simple scaling model, and up to 54.0% for an LSTM encoder-decoder model). Finally, we discuss how our findings could benefit other business contexts.",
    "link": "http://arxiv.org/abs/2308.13118",
    "context": "Title: Business Metric-Aware Forecasting for Inventory Management. (arXiv:2308.13118v1 [cs.LG])\nAbstract: Time-series forecasts play a critical role in business planning. However, forecasters typically optimize objectives that are agnostic to downstream business goals and thus can produce forecasts misaligned with business preferences. In this work, we demonstrate that optimization of conventional forecasting metrics can often lead to sub-optimal downstream business performance. Focusing on the inventory management setting, we derive an efficient procedure for computing and optimizing proxies of common downstream business metrics in an end-to-end differentiable manner. We explore a wide range of plausible cost trade-off scenarios, and empirically demonstrate that end-to-end optimization often outperforms optimization of standard business-agnostic forecasting metrics (by up to 45.7% for a simple scaling model, and up to 54.0% for an LSTM encoder-decoder model). Finally, we discuss how our findings could benefit other business contexts.",
    "path": "papers/23/08/2308.13118.json",
    "total_tokens": 821,
    "translated_title": "面向库存管理的业务指标感知预测",
    "translated_abstract": "时间序列预测在业务规划中起着至关重要的作用。然而，预测者通常优化与业务目标无关的目标，从而可能产生与业务偏好不一致的预测结果。在这项工作中，我们证明传统预测指标的优化通常会导致次优的业务绩效。针对库存管理的情境，我们在一个端到端可微分的方式下推导出了计算和优化常见业务指标代理的高效过程。我们探索了各种可能的成本权衡情境，并通过实证研究表明，端到端优化通常优于优化标准的与业务无关的预测指标（对于简单的缩放模型，提升高达45.7%，对于LSTM编码器-解码器模型，提升高达54.0%）。最后，我们讨论了我们的研究结果如何在其他业务环境中受益。",
    "tldr": "本研究针对库存管理设置，通过端到端优化预测指标，相较于优化传统标准的与业务无关的指标，能够显著提升业务绩效。",
    "en_tdlr": "This study focuses on inventory management and demonstrates that end-to-end optimization of forecasting metrics, compared to optimization of business-agnostic metrics, significantly improves business performance."
}