{
    "title": "A survey on bias in machine learning research. (arXiv:2308.11254v1 [cs.LG])",
    "abstract": "Current research on bias in machine learning often focuses on fairness, while overlooking the roots or causes of bias. However, bias was originally defined as a \"systematic error,\" often caused by humans at different stages of the research process. This article aims to bridge the gap between past literature on bias in research by providing taxonomy for potential sources of bias and errors in data and models. The paper focus on bias in machine learning pipelines. Survey analyses over forty potential sources of bias in the machine learning (ML) pipeline, providing clear examples for each. By understanding the sources and consequences of bias in machine learning, better methods can be developed for its detecting and mitigating, leading to fairer, more transparent, and more accurate ML models.",
    "link": "http://arxiv.org/abs/2308.11254",
    "context": "Title: A survey on bias in machine learning research. (arXiv:2308.11254v1 [cs.LG])\nAbstract: Current research on bias in machine learning often focuses on fairness, while overlooking the roots or causes of bias. However, bias was originally defined as a \"systematic error,\" often caused by humans at different stages of the research process. This article aims to bridge the gap between past literature on bias in research by providing taxonomy for potential sources of bias and errors in data and models. The paper focus on bias in machine learning pipelines. Survey analyses over forty potential sources of bias in the machine learning (ML) pipeline, providing clear examples for each. By understanding the sources and consequences of bias in machine learning, better methods can be developed for its detecting and mitigating, leading to fairer, more transparent, and more accurate ML models.",
    "path": "papers/23/08/2308.11254.json",
    "total_tokens": 888,
    "translated_title": "机器学习研究中偏差的调查",
    "translated_abstract": "当前对机器学习中偏差的研究通常关注公平性，却忽视了偏差的根源或原因。然而，偏差最初被定义为“系统性错误”，通常是由研究过程中不同阶段的人类引起的。本文旨在通过提供偏差和数据模型中潜在偏差和错误的分类，弥补过去关于偏差研究的差距。该文重点研究机器学习流程中的偏差。调查分析了机器学习（ML）流程中超过四十种潜在的偏差来源，并为每种情况提供了清晰的示例。通过理解机器学习中偏差的来源和后果，可以开发出更好的方法来检测和减轻偏差，从而实现更公平、更透明、更准确的ML模型。",
    "tldr": "本文调查了机器学习研究中的偏差问题，提供了偏差和错误的分类，并分析了机器学习流程中超过四十种潜在的偏差来源，为每种情况提供了清晰的示例。通过理解和减轻机器学习中的偏差，可以开发出更公平、更透明、更准确的ML模型。",
    "en_tdlr": "This article surveys biases in machine learning research, provides a taxonomy for potential sources of bias and errors in data and models, and analyzes over forty potential sources of bias in the machine learning pipeline, offering clear examples for each. Understanding and mitigating biases in machine learning can lead to the development of fairer, more transparent, and more accurate ML models."
}