{
    "title": "OCTAL: Graph Representation Learning for LTL Model Checking. (arXiv:2308.13474v1 [cs.LO])",
    "abstract": "Model Checking is widely applied in verifying the correctness of complex and concurrent systems against a specification. Pure symbolic approaches while popular, suffer from the state space explosion problem due to cross product operations required that make them prohibitively expensive for large-scale systems and/or specifications. In this paper, we propose to use graph representation learning (GRL) for solving linear temporal logic (LTL) model checking, where the system and the specification are expressed by a B{\\\"u}chi automaton and an LTL formula, respectively. A novel GRL-based framework \\model, is designed to learn the representation of the graph-structured system and specification, which reduces the model checking problem to binary classification. Empirical experiments on two model checking scenarios show that \\model achieves promising accuracy, with up to $11\\times$ overall speedup against canonical SOTA model checkers and $31\\times$ for satisfiability checking alone.",
    "link": "http://arxiv.org/abs/2308.13474",
    "context": "Title: OCTAL: Graph Representation Learning for LTL Model Checking. (arXiv:2308.13474v1 [cs.LO])\nAbstract: Model Checking is widely applied in verifying the correctness of complex and concurrent systems against a specification. Pure symbolic approaches while popular, suffer from the state space explosion problem due to cross product operations required that make them prohibitively expensive for large-scale systems and/or specifications. In this paper, we propose to use graph representation learning (GRL) for solving linear temporal logic (LTL) model checking, where the system and the specification are expressed by a B{\\\"u}chi automaton and an LTL formula, respectively. A novel GRL-based framework \\model, is designed to learn the representation of the graph-structured system and specification, which reduces the model checking problem to binary classification. Empirical experiments on two model checking scenarios show that \\model achieves promising accuracy, with up to $11\\times$ overall speedup against canonical SOTA model checkers and $31\\times$ for satisfiability checking alone.",
    "path": "papers/23/08/2308.13474.json",
    "total_tokens": 850,
    "translated_title": "OCTAL: 用于LTL模型检测的图形表示学习",
    "translated_abstract": "模型检测广泛应用于验证复杂和并发系统是否符合规范。纯符号方法虽然流行，但由于需要进行交叉乘积操作而导致状态空间膨胀问题，对于大规模系统和/或规范来说成本太高。本文提出使用图形表示学习（GRL）来解决线性时态逻辑（LTL）模型检测问题，系统和规范分别用Büchi自动机和LTL公式表示。设计了一种基于GRL的新框架\\model，用于学习图形结构化系统和规范的表示，从而将模型检测问题转化为二元分类。在两个模型检测场景上的实证实验表明，\\model取得了很有希望的准确性，与规范典型SOTA模型检查器相比，整体加速了高达11倍，仅仅进行可满足性检查的加速率达到了31倍。",
    "tldr": "本文提出了一个基于图形表示学习的框架，用于解决LTL模型检测问题。实证实验结果表明，该框架相比传统方法具有较高的准确性和速度优势。",
    "en_tdlr": "This paper proposes a framework based on graph representation learning for solving LTL model checking problems. Empirical experiments show that this framework achieves high accuracy and speed advantages compared to traditional methods."
}