{
    "title": "BIRP: Bitcoin Information Retrieval Prediction Model Based on Multimodal Pattern Matching. (arXiv:2308.08558v1 [q-fin.ST])",
    "abstract": "Financial time series have historically been assumed to be a martingale process under the Random Walk hypothesis. Instead of making investment decisions using the raw prices alone, various multimodal pattern matching algorithms have been developed to help detect subtly hidden repeatable patterns within the financial market. Many of the chart-based pattern matching tools only retrieve similar past chart (PC) patterns given the current chart (CC) pattern, and leaves the entire interpretive and predictive analysis, thus ultimately the final investment decision, to the investors. In this paper, we propose an approach of ranking similar PC movements given the CC information and show that exploiting this as additional features improves the directional prediction capacity of our model. We apply our ranking and directional prediction modeling methodologies on Bitcoin due to its highly volatile prices that make it challenging to predict its future movements.",
    "link": "http://arxiv.org/abs/2308.08558",
    "context": "Title: BIRP: Bitcoin Information Retrieval Prediction Model Based on Multimodal Pattern Matching. (arXiv:2308.08558v1 [q-fin.ST])\nAbstract: Financial time series have historically been assumed to be a martingale process under the Random Walk hypothesis. Instead of making investment decisions using the raw prices alone, various multimodal pattern matching algorithms have been developed to help detect subtly hidden repeatable patterns within the financial market. Many of the chart-based pattern matching tools only retrieve similar past chart (PC) patterns given the current chart (CC) pattern, and leaves the entire interpretive and predictive analysis, thus ultimately the final investment decision, to the investors. In this paper, we propose an approach of ranking similar PC movements given the CC information and show that exploiting this as additional features improves the directional prediction capacity of our model. We apply our ranking and directional prediction modeling methodologies on Bitcoin due to its highly volatile prices that make it challenging to predict its future movements.",
    "path": "papers/23/08/2308.08558.json",
    "total_tokens": 831,
    "translated_title": "BIRP: 基于多模式匹配的比特币信息检索预测模型",
    "translated_abstract": "在随机行走假设下，金融时间序列被认为是鞅过程。为了发现金融市场中隐藏的可重复模式，人们开发了各种多模式匹配算法，而不仅仅依靠原始价格进行投资决策。许多基于图表的模式匹配工具只能在当前图表模式的基础上检索类似的过去图表模式，并将整个解释和预测分析以及最终的投资决策留给投资者。本文提出了一种基于当前图表信息对相似过去图表运动进行排序的方法，并证明利用这些额外特征可以提高我们模型的方向预测能力。由于比特币具有高度波动的价格，使其难以预测其未来走势，因此我们将我们的排序和方向预测建模方法应用于比特币。",
    "tldr": "本文提出了一种基于多模式匹配的比特币信息检索预测模型(BIRP)，通过排列相似的过去图表运动来提高预测能力，应用于比特币市场。",
    "en_tdlr": "This paper proposes a Bitcoin Information Retrieval Prediction Model (BIRP) based on multimodal pattern matching, which improves the predictive capacity by ranking similar past chart movements and is applied in the highly volatile Bitcoin market."
}