{
    "title": "Effects of Daily News Sentiment on Stock Price Forecasting. (arXiv:2308.08549v1 [q-fin.ST])",
    "abstract": "Predicting future prices of a stock is an arduous task to perform. However, incorporating additional elements can significantly improve our predictions, rather than relying solely on a stock's historical price data to forecast its future price. Studies have demonstrated that investor sentiment, which is impacted by daily news about the company, can have a significant impact on stock price swings. There are numerous sources from which we can get this information, but they are cluttered with a lot of noise, making it difficult to accurately extract the sentiments from them. Hence the focus of our research is to design an efficient system to capture the sentiments from the news about the NITY50 stocks and investigate how much the financial news sentiment of these stocks are affecting their prices over a period of time. This paper presents a robust data collection and preprocessing framework to create a news database for a timeline of around 3.7 years, consisting of almost half a million n",
    "link": "http://arxiv.org/abs/2308.08549",
    "context": "Title: Effects of Daily News Sentiment on Stock Price Forecasting. (arXiv:2308.08549v1 [q-fin.ST])\nAbstract: Predicting future prices of a stock is an arduous task to perform. However, incorporating additional elements can significantly improve our predictions, rather than relying solely on a stock's historical price data to forecast its future price. Studies have demonstrated that investor sentiment, which is impacted by daily news about the company, can have a significant impact on stock price swings. There are numerous sources from which we can get this information, but they are cluttered with a lot of noise, making it difficult to accurately extract the sentiments from them. Hence the focus of our research is to design an efficient system to capture the sentiments from the news about the NITY50 stocks and investigate how much the financial news sentiment of these stocks are affecting their prices over a period of time. This paper presents a robust data collection and preprocessing framework to create a news database for a timeline of around 3.7 years, consisting of almost half a million n",
    "path": "papers/23/08/2308.08549.json",
    "total_tokens": 894,
    "translated_title": "每日新闻情绪对股票价格预测的影响",
    "translated_abstract": "预测股票的未来价格是一项艰巨的任务。然而，引入额外的因素可以显著改善我们的预测，而不仅仅依靠股票的历史价格数据来预测其未来价格。研究表明，投资者情绪受到有关公司的每日新闻的影响，可以对股票价格波动产生重大影响。虽然有很多信息来源可以获取这些信息，但它们往往充斥着大量的噪声，使得准确提取情感变得困难。因此，我们的研究重点是设计一个高效的系统，从关于NITY50股票的新闻中获取情绪，并研究这些股票的财经新闻情绪在一段时间内对其价格的影响程度。本文介绍了一个强大的数据收集和预处理框架，用于创建一个历时约3.7年的新闻数据库，包含了近50万条新闻数据。",
    "tldr": "本研究探讨了每日新闻情绪对股票价格预测的影响，并设计了一个高效的系统从新闻中提取情绪影响因素。研究发现投资者情绪对股票价格波动有显著影响。",
    "en_tdlr": "This study examines the impact of daily news sentiment on stock price forecasting and proposes an efficient system to extract sentiment factors from news. It finds that investor sentiment has a significant impact on stock price swings."
}