{
    "title": "Bang and the Artefacts are Gone! Rapid Artefact Removal and Tissue Segmentation in Haematoxylin and Eosin Stained Biopsies. (arXiv:2308.13304v1 [eess.IV])",
    "abstract": "We present H&E Otsu thresholding, a scheme for rapidly detecting tissue in whole-slide images (WSIs) that eliminates a wide range of undesirable artefacts such as pen marks and scanning artefacts. Our method involves obtaining a bid-modal representation of a low-magnification RGB overview image which enables simple Otsu thresholding to separate tissue from background and artefacts. We demonstrate our method on WSIs prepared from a wide range of institutions and WSI digital scanners, each containing substantial artefacts that cause other methods to fail. The beauty of our approach lies in its simplicity: manipulating RGB colour space and using Otsu thresholding allows for the rapid removal of artefacts and segmentation of tissue.",
    "link": "http://arxiv.org/abs/2308.13304",
    "context": "Title: Bang and the Artefacts are Gone! Rapid Artefact Removal and Tissue Segmentation in Haematoxylin and Eosin Stained Biopsies. (arXiv:2308.13304v1 [eess.IV])\nAbstract: We present H&E Otsu thresholding, a scheme for rapidly detecting tissue in whole-slide images (WSIs) that eliminates a wide range of undesirable artefacts such as pen marks and scanning artefacts. Our method involves obtaining a bid-modal representation of a low-magnification RGB overview image which enables simple Otsu thresholding to separate tissue from background and artefacts. We demonstrate our method on WSIs prepared from a wide range of institutions and WSI digital scanners, each containing substantial artefacts that cause other methods to fail. The beauty of our approach lies in its simplicity: manipulating RGB colour space and using Otsu thresholding allows for the rapid removal of artefacts and segmentation of tissue.",
    "path": "papers/23/08/2308.13304.json",
    "total_tokens": 828,
    "translated_title": "激光和标本消失了！快速去除标本残留物和组织分割在血染乙酸洋红染色活检中",
    "translated_abstract": "我们提出了一种H&E Otsu thresholding方案，用于快速检测全幻灯片图像中的组织，可以消除笔迹和扫描残留等各种不良标本残留物。我们的方法涉及到获取低放大倍率RGB全景图像的双峰表示，从而可以简单地使用Otsu thresholding方法将组织与背景和残留物分离。我们在来自各种机构和WSI数字扫描仪的WSI制备的图像上演示了我们的方法，每张图像都包含大量的残留物，其他方法都无法处理。我们方法的美妙之处在于其简洁性：通过操作RGB颜色空间并使用Otsu thresholding可以快速去除残留物并分割组织。",
    "tldr": "该论文提出了一种基于H&E Otsu thresholding的方案，可以快速去除标本残留物和分割组织，在血染乙酸洋红染色的活检中取得了良好的效果。",
    "en_tdlr": "This paper presents a scheme based on H&E Otsu thresholding for rapid artefact removal and tissue segmentation in haematoxylin and eosin stained biopsies, achieving good results."
}