{
    "title": "Concentrating on the Impact: Consequence-based Explanations in Recommender Systems. (arXiv:2308.16708v1 [cs.IR])",
    "abstract": "Recommender systems assist users in decision-making, where the presentation of recommended items and their explanations are critical factors for enhancing the overall user experience. Although various methods for generating explanations have been proposed, there is still room for improvement, particularly for users who lack expertise in a specific item domain. In this study, we introduce the novel concept of \\textit{consequence-based explanations}, a type of explanation that emphasizes the individual impact of consuming a recommended item on the user, which makes the effect of following recommendations clearer. We conducted an online user study to examine our assumption about the appreciation of consequence-based explanations and their impacts on different explanation aims in recommender systems. Our findings highlight the importance of consequence-based explanations, which were well-received by users and effectively improved user satisfaction in recommender systems. These results prov",
    "link": "http://arxiv.org/abs/2308.16708",
    "context": "Title: Concentrating on the Impact: Consequence-based Explanations in Recommender Systems. (arXiv:2308.16708v1 [cs.IR])\nAbstract: Recommender systems assist users in decision-making, where the presentation of recommended items and their explanations are critical factors for enhancing the overall user experience. Although various methods for generating explanations have been proposed, there is still room for improvement, particularly for users who lack expertise in a specific item domain. In this study, we introduce the novel concept of \\textit{consequence-based explanations}, a type of explanation that emphasizes the individual impact of consuming a recommended item on the user, which makes the effect of following recommendations clearer. We conducted an online user study to examine our assumption about the appreciation of consequence-based explanations and their impacts on different explanation aims in recommender systems. Our findings highlight the importance of consequence-based explanations, which were well-received by users and effectively improved user satisfaction in recommender systems. These results prov",
    "path": "papers/23/08/2308.16708.json",
    "total_tokens": 818,
    "translated_title": "专注于影响：基于后果的推荐系统解释",
    "translated_abstract": "推荐系统在用户决策中起到辅助作用，推荐项的呈现方式和解释是提升用户体验的关键因素。尽管已经提出了各种生成解释的方法，但仍有改进的空间，特别是对于在特定领域缺乏专业知识的用户。在本研究中，我们引入了一种新概念，即基于后果的解释，这种解释强调推荐项对用户个人消费行为的影响，使得遵循推荐的效果更加清晰。我们进行了一项在线用户研究，以验证关于后果解释的欣赏度以及在推荐系统中的不同解释目标上的影响的假设。研究结果显示，后果解释的重要性得到了用户的认可，并且在推荐系统中有效地提高了用户满意度。",
    "tldr": "本研究介绍了一种新概念，即基于后果的解释，以强调推荐项对用户个人消费行为的影响，从而提升推荐系统的用户体验和满意度。"
}