{
    "title": "Denoising Attention for Query-aware User Modeling in Personalized Search. (arXiv:2308.15968v1 [cs.IR])",
    "abstract": "The personalization of search results has gained increasing attention in the past few years, thanks to the development of Neural Networks-based approaches for Information Retrieval and the importance of personalization in many search scenarios. Recent works have proposed to build user models at query time by leveraging the Attention mechanism, which allows weighing the contribution of the user-related information w.r.t. the current query. This approach allows taking into account the diversity of the user's interests by giving more importance to those related to the current search performed by the user.  In this paper, we first discuss some shortcomings of the standard Attention formulation when employed for personalization. In particular, we focus on issues related to its normalization mechanism and its inability to entirely filter out noisy user-related information. Then, we introduce the Denoising Attention mechanism: an Attention variant that directly tackles the above shortcomings ",
    "link": "http://arxiv.org/abs/2308.15968",
    "context": "Title: Denoising Attention for Query-aware User Modeling in Personalized Search. (arXiv:2308.15968v1 [cs.IR])\nAbstract: The personalization of search results has gained increasing attention in the past few years, thanks to the development of Neural Networks-based approaches for Information Retrieval and the importance of personalization in many search scenarios. Recent works have proposed to build user models at query time by leveraging the Attention mechanism, which allows weighing the contribution of the user-related information w.r.t. the current query. This approach allows taking into account the diversity of the user's interests by giving more importance to those related to the current search performed by the user.  In this paper, we first discuss some shortcomings of the standard Attention formulation when employed for personalization. In particular, we focus on issues related to its normalization mechanism and its inability to entirely filter out noisy user-related information. Then, we introduce the Denoising Attention mechanism: an Attention variant that directly tackles the above shortcomings ",
    "path": "papers/23/08/2308.15968.json",
    "total_tokens": 791,
    "translated_title": "在个性化搜索中去噪注意力以实现查询感知用户建模",
    "translated_abstract": "过去几年中，由于神经网络在信息检索中的应用以及在许多搜索场景中的个性化重要性，个性化搜索结果的个性化受到了越来越多的关注。最近的研究提出了通过利用注意力机制在查询时间构建用户模型，这样可以根据当前查询的相关性权衡用户相关信息的贡献。这种方法通过给予与用户当前搜索相关的兴趣更多的重要性来考虑用户兴趣的多样性。本文首先讨论了标准注意力公式在个性化方面的一些缺点。特别是，我们关注其归一化机制和其不能完全过滤掉嘈杂的用户相关信息的问题。然后，我们介绍了去噪注意力机制：一种注意力的变体，直接解决了以上问题。",
    "tldr": "本文提出了一种去噪注意力机制，用于个性化搜索中的查询感知用户建模，通过解决标准注意力公式的缺点来提高个性化效果。",
    "en_tdlr": "This paper introduces a denoising attention mechanism for query-aware user modeling in personalized search, which improves personalization by addressing the shortcomings of the standard attention formulation."
}