{
    "title": "Towards Low-Barrier Cybersecurity Research and Education for Industrial Control Systems. (arXiv:2308.16769v1 [cs.CR])",
    "abstract": "The protection of Industrial Control Systems (ICS) that are employed in public critical infrastructures is of utmost importance due to catastrophic physical damages cyberattacks may cause. The research community requires testbeds for validation and comparing various intrusion detection algorithms to protect ICS. However, there exist high barriers to entry for research and education in the ICS cybersecurity domain due to expensive hardware, software, and inherent dangers of manipulating real-world systems. To close the gap, built upon recently developed 3D high-fidelity simulators, we further showcase our integrated framework to automatically launch cyberattacks, collect data, train machine learning models, and evaluate for practical chemical and manufacturing processes. On our testbed, we validate our proposed intrusion detection model called Minimal Threshold and Window SVM (MinTWin SVM) that utilizes unsupervised machine learning via a one-class SVM in combination with a sliding wind",
    "link": "http://arxiv.org/abs/2308.16769",
    "context": "Title: Towards Low-Barrier Cybersecurity Research and Education for Industrial Control Systems. (arXiv:2308.16769v1 [cs.CR])\nAbstract: The protection of Industrial Control Systems (ICS) that are employed in public critical infrastructures is of utmost importance due to catastrophic physical damages cyberattacks may cause. The research community requires testbeds for validation and comparing various intrusion detection algorithms to protect ICS. However, there exist high barriers to entry for research and education in the ICS cybersecurity domain due to expensive hardware, software, and inherent dangers of manipulating real-world systems. To close the gap, built upon recently developed 3D high-fidelity simulators, we further showcase our integrated framework to automatically launch cyberattacks, collect data, train machine learning models, and evaluate for practical chemical and manufacturing processes. On our testbed, we validate our proposed intrusion detection model called Minimal Threshold and Window SVM (MinTWin SVM) that utilizes unsupervised machine learning via a one-class SVM in combination with a sliding wind",
    "path": "papers/23/08/2308.16769.json",
    "total_tokens": 1019,
    "translated_title": "朝着工业控制系统低门槛的网络安全研究和教育发展",
    "translated_abstract": "保护用于公共关键基础设施的工业控制系统(ICS)对于防止网络攻击造成灾难性的物理损害至关重要。研究界需要测试平台来验证和比较各种入侵检测算法以保护ICS。然而，由于昂贵的硬件、软件和操纵现实系统的固有危险性，ICS网络安全领域的研究和教育存在高门槛。为了弥补这一差距，我们在最近开发的三维高保真模拟器基础上，进一步展示了我们的集成框架，可以自动发动网络攻击、收集数据、训练机器学习模型，并针对实际的化学和制造过程进行评估。在我们的测试平台上，我们验证了我们提出的入侵检测模型，称为Minimal Threshold and Window SVM (MinTWin SVM)，它结合了一类SVM的无监督机器学习和滑动窗口",
    "tldr": "该论文介绍了在工业控制系统网络安全领域进行低门槛研究和教育的重要性。通过利用开发的高保真模拟器，作者构建了一个集成框架用于自动发动网络攻击、收集数据、训练机器学习模型，并针对实际的化学和制造过程进行评估。作者还提出了一种名为MinTWin SVM的入侵检测模型，它结合了无监督机器学习和滑动窗口的方法。",
    "en_tdlr": "This paper emphasizes the importance of low-barrier research and education in the field of cybersecurity for industrial control systems. The authors propose an integrated framework using high-fidelity simulators to automatically launch cyberattacks, collect data, train machine learning models, and evaluate practical chemical and manufacturing processes. They also introduce a intrusion detection model called MinTWin SVM, which combines unsupervised machine learning with a sliding window approach."
}