{
    "title": "Hybrid Retrieval and Multi-stage Text Ranking Solution at TREC 2022 Deep Learning Track. (arXiv:2308.12039v1 [cs.IR])",
    "abstract": "Large-scale text retrieval technology has been widely used in various practical business scenarios. This paper presents our systems for the TREC 2022 Deep Learning Track. We explain the hybrid text retrieval and multi-stage text ranking method adopted in our solution. The retrieval stage combined the two structures of traditional sparse retrieval and neural dense retrieval. In the ranking stage, in addition to the full interaction-based ranking model built on large pre-trained language model, we also proposes a lightweight sub-ranking module to further enhance the final text ranking performance. Evaluation results demonstrate the effectiveness of our proposed approach. Our models achieve the 1st and 4th rank on the test set of passage ranking and document ranking respectively.",
    "link": "http://arxiv.org/abs/2308.12039",
    "context": "Title: Hybrid Retrieval and Multi-stage Text Ranking Solution at TREC 2022 Deep Learning Track. (arXiv:2308.12039v1 [cs.IR])\nAbstract: Large-scale text retrieval technology has been widely used in various practical business scenarios. This paper presents our systems for the TREC 2022 Deep Learning Track. We explain the hybrid text retrieval and multi-stage text ranking method adopted in our solution. The retrieval stage combined the two structures of traditional sparse retrieval and neural dense retrieval. In the ranking stage, in addition to the full interaction-based ranking model built on large pre-trained language model, we also proposes a lightweight sub-ranking module to further enhance the final text ranking performance. Evaluation results demonstrate the effectiveness of our proposed approach. Our models achieve the 1st and 4th rank on the test set of passage ranking and document ranking respectively.",
    "path": "papers/23/08/2308.12039.json",
    "total_tokens": 874,
    "translated_title": "TREC 2022深度学习赛道的混合检索和多阶段文本排名解决方案",
    "translated_abstract": "大规模文本检索技术在各种实际业务场景中被广泛使用。本文介绍了我们在TREC 2022深度学习赛道中的系统。我们解释了我们解决方案中采用的混合文本检索和多阶段文本排名方法。检索阶段结合了传统稀疏检索和神经稠密检索的两种结构。在排名阶段，除了基于大型预训练语言模型构建的全交互式排名模型外，我们还提出了一个轻量级的子排名模块，进一步提升了最终的文本排名性能。评估结果证明了我们提出的方法的有效性。我们的模型在段落排名和文档排名的测试集上分别达到了第1名和第4名。",
    "tldr": "本论文介绍了在 TREC 2022 深度学习赛道中，我们采用的混合文本检索和多阶段文本排名方法，在检索阶段结合了传统稀疏检索和神经稠密检索的两种结构，在排名阶段构建了全交互式排名模型和轻量级子排名模块，评估结果证明了方法的有效性。",
    "en_tdlr": "This paper presents a hybrid text retrieval and multi-stage text ranking method used in TREC 2022 Deep Learning Track, with the combination of traditional sparse retrieval and neural dense retrieval in the retrieval stage, and the utilization of a full interaction-based ranking model and a lightweight sub-ranking module in the ranking stage, achieving effective results in passage ranking and document ranking."
}