{
    "title": "Exploring the Limits of Historical Information for Temporal Knowledge Graph Extrapolation. (arXiv:2308.15002v1 [cs.AI])",
    "abstract": "Temporal knowledge graphs, representing the dynamic relationships and interactions between entities over time, have been identified as a promising approach for event forecasting. However, a limitation of most temporal knowledge graph reasoning methods is their heavy reliance on the recurrence or periodicity of events, which brings challenges to inferring future events related to entities that lack historical interaction. In fact, the current state of affairs is often the result of a combination of historical information and underlying factors that are not directly observable. To this end, we investigate the limits of historical information for temporal knowledge graph extrapolation and propose a new event forecasting model called Contrastive Event Network (CENET) based on a novel training framework of historical contrastive learning. CENET learns both the historical and non-historical dependency to distinguish the most potential entities that best match the given query. Simultaneously,",
    "link": "http://arxiv.org/abs/2308.15002",
    "context": "Title: Exploring the Limits of Historical Information for Temporal Knowledge Graph Extrapolation. (arXiv:2308.15002v1 [cs.AI])\nAbstract: Temporal knowledge graphs, representing the dynamic relationships and interactions between entities over time, have been identified as a promising approach for event forecasting. However, a limitation of most temporal knowledge graph reasoning methods is their heavy reliance on the recurrence or periodicity of events, which brings challenges to inferring future events related to entities that lack historical interaction. In fact, the current state of affairs is often the result of a combination of historical information and underlying factors that are not directly observable. To this end, we investigate the limits of historical information for temporal knowledge graph extrapolation and propose a new event forecasting model called Contrastive Event Network (CENET) based on a novel training framework of historical contrastive learning. CENET learns both the historical and non-historical dependency to distinguish the most potential entities that best match the given query. Simultaneously,",
    "path": "papers/23/08/2308.15002.json",
    "total_tokens": 865,
    "translated_title": "探索历史信息在时间知识图推断中的限制",
    "translated_abstract": "时间知识图是表示实体之间动态关系和交互的一种方法，被认为是事件预测的有前景的方法。然而，大多数时间知识图推理方法存在一个局限性，就是过于依赖事件的重复性或周期性，这给推断与缺乏历史交互的实体相关的未来事件带来挑战。事实上，当前事态往往是历史信息和不直接可观察的潜在因素的组合结果。为了解决这个问题，我们探讨了历史信息在时间知识图推断中的限制，并提出了一种新的事件预测模型，称为对比事件网络（CENET），基于一种新颖的历史对比学习的训练框架。CENET通过学习历史和非历史的依赖关系，区分最有潜力的实体，以最佳匹配给定的查询。",
    "tldr": "本研究探索了时间知识图推断中历史信息的限制，并提出了一种新的事件预测模型CENET，通过历史对比学习框架学习历史和非历史依赖关系，以区分最有潜力的实体。",
    "en_tdlr": "This study explores the limitations of historical information in temporal knowledge graph extrapolation and proposes a new event forecasting model called CENET, which learns both historical and non-historical dependencies through a framework of historical contrastive learning to distinguish the most potential entities."
}