{
    "title": "ZADU: A Python Library for Evaluating the Reliability of Dimensionality Reduction Embeddings. (arXiv:2308.00282v1 [cs.LG])",
    "abstract": "Dimensionality reduction (DR) techniques inherently distort the original structure of input high-dimensional data, producing imperfect low-dimensional embeddings. Diverse distortion measures have thus been proposed to evaluate the reliability of DR embeddings. However, implementing and executing distortion measures in practice has so far been time-consuming and tedious. To address this issue, we present ZADU, a Python library that provides distortion measures. ZADU is not only easy to install and execute but also enables comprehensive evaluation of DR embeddings through three key features. First, the library covers a wide range of distortion measures. Second, it automatically optimizes the execution of distortion measures, substantially reducing the running time required to execute multiple measures. Last, the library informs how individual points contribute to the overall distortions, facilitating the detailed analysis of DR embeddings. By simulating a real-world scenario of optimizin",
    "link": "http://arxiv.org/abs/2308.00282",
    "context": "Title: ZADU: A Python Library for Evaluating the Reliability of Dimensionality Reduction Embeddings. (arXiv:2308.00282v1 [cs.LG])\nAbstract: Dimensionality reduction (DR) techniques inherently distort the original structure of input high-dimensional data, producing imperfect low-dimensional embeddings. Diverse distortion measures have thus been proposed to evaluate the reliability of DR embeddings. However, implementing and executing distortion measures in practice has so far been time-consuming and tedious. To address this issue, we present ZADU, a Python library that provides distortion measures. ZADU is not only easy to install and execute but also enables comprehensive evaluation of DR embeddings through three key features. First, the library covers a wide range of distortion measures. Second, it automatically optimizes the execution of distortion measures, substantially reducing the running time required to execute multiple measures. Last, the library informs how individual points contribute to the overall distortions, facilitating the detailed analysis of DR embeddings. By simulating a real-world scenario of optimizin",
    "path": "papers/23/08/2308.00282.json",
    "total_tokens": 854,
    "translated_title": "ZADU: 评估降维嵌入可靠性的Python库",
    "translated_abstract": "降维技术本质上会扭曲原始高维数据的结构，产生不完美的低维嵌入。为了评估降维嵌入的可靠性，提出了各种扭曲度量方法。然而，在实践中实现和执行扭曲度量一直是耗时且繁琐的。为了解决这个问题，本文介绍了一个Python库ZADU，提供了扭曲度量方法。ZADU不仅易于安装和执行，还通过三个关键特性实现了对降维嵌入的全面评估。首先，该库涵盖了各种扭曲度量方法。其次，它自动优化扭曲度量的执行，大大减少了执行多个度量所需的运行时间。最后，该库可显示个别数据点对整体扭曲的贡献，便于对降维嵌入进行详细分析。",
    "tldr": "ZADU是一个Python库，通过提供扭曲度量方法可以高效评估降维嵌入的可靠性，并通过优化执行和分析各个数据点的贡献提供全面评估。",
    "en_tdlr": "ZADU is a Python library that efficiently evaluates the reliability of dimensionality reduction embeddings by providing distortion measures. It offers a wide range of distortion measures, optimizes their execution, and facilitates detailed analysis through the contribution of individual data points."
}