{
    "title": "GRU-D-Weibull: A Novel Real-Time Individualized Endpoint Prediction. (arXiv:2308.07452v1 [cs.LG])",
    "abstract": "Accurate prediction models for individual-level endpoints and time-to-endpoints are crucial in clinical practice. In this study, we propose a novel approach, GRU-D-Weibull, which combines gated recurrent units with decay (GRU-D) to model the Weibull distribution. Our method enables real-time individualized endpoint prediction and population-level risk management. Using a cohort of 6,879 patients with stage 4 chronic kidney disease (CKD4), we evaluated the performance of GRU-D-Weibull in endpoint prediction. The C-index of GRU-D-Weibull was ~0.7 at the index date and increased to ~0.77 after 4.3 years of follow-up, similar to random survival forest. Our approach achieved an absolute L1-loss of ~1.1 years (SD 0.95) at the CKD4 index date and a minimum of ~0.45 years (SD0.3) at 4 years of follow-up, outperforming competing methods significantly. GRU-D-Weibull consistently constrained the predicted survival probability at the time of an event within a smaller and more fixed range compared ",
    "link": "http://arxiv.org/abs/2308.07452",
    "context": "Title: GRU-D-Weibull: A Novel Real-Time Individualized Endpoint Prediction. (arXiv:2308.07452v1 [cs.LG])\nAbstract: Accurate prediction models for individual-level endpoints and time-to-endpoints are crucial in clinical practice. In this study, we propose a novel approach, GRU-D-Weibull, which combines gated recurrent units with decay (GRU-D) to model the Weibull distribution. Our method enables real-time individualized endpoint prediction and population-level risk management. Using a cohort of 6,879 patients with stage 4 chronic kidney disease (CKD4), we evaluated the performance of GRU-D-Weibull in endpoint prediction. The C-index of GRU-D-Weibull was ~0.7 at the index date and increased to ~0.77 after 4.3 years of follow-up, similar to random survival forest. Our approach achieved an absolute L1-loss of ~1.1 years (SD 0.95) at the CKD4 index date and a minimum of ~0.45 years (SD0.3) at 4 years of follow-up, outperforming competing methods significantly. GRU-D-Weibull consistently constrained the predicted survival probability at the time of an event within a smaller and more fixed range compared ",
    "path": "papers/23/08/2308.07452.json",
    "total_tokens": 1060,
    "translated_title": "GRU-D-Weibull:一种新型的实时个体化终点预测方法",
    "translated_abstract": "在临床实践中，准确的个体级终点和终点时间预测模型至关重要。本研究提出了一种新的方法，GRU-D-Weibull，它将门控循环单元与衰减技术（GRU-D）结合，来建模威布尔分布。我们的方法实现了实时个体化终点预测和群体级风险管理。我们使用一个包含6,879名慢性肾脏疾病（CKD4）患者的队列，评估了GRU-D-Weibull在终点预测中的性能。在指标日期，GRU-D-Weibull的C-指数约为0.7，随着4.3年的随访，C-指数提高到约0.77，类似于随机生存森林。我们的方法在CKD4指标日期的绝对L1损失约为1.1年（标准差0.95），随访4年后的最小L1损失约为0.45年（标准差0.3），明显优于其他竞争方法。相比之下，GRU-D-Weibull在事件发生时的预测生存概率范围更小且更固定。",
    "tldr": "GRU-D-Weibull是一种新型的实时个体化终点预测方法，结合了门控循环单元和衰减技术，用于建模威布尔分布。通过在慢性肾脏疾病患者队列中的评估，发现该方法在终点预测方面的性能优于其他竞争方法。",
    "en_tdlr": "GRU-D-Weibull is a novel real-time individualized endpoint prediction method that combines gated recurrent units with decay technique to model the Weibull distribution. Through evaluation in a cohort of chronic kidney disease patients, it outperforms other competing methods in endpoint prediction."
}