{
    "title": "On the Practicality of Dynamic Updates in Fast Searchable Encryption. (arXiv:2308.13486v1 [cs.CR])",
    "abstract": "Searchable encrypted (SE) indexing systems are a useful tool for utilizing cloud services to store and manage sensitive information. However, much of the work on SE systems to date has remained theoretical. In order to make them of practical use, more work is needed to develop optimal protocols and working models for them. This includes, in particular, the creation of a working update model in order to maintain an encrypted index of a dynamic document set such as an email inbox. I have created a working, real-world end-to-end SE implementation that satisfies these needs, including the first empirical performance evaluation of the dynamic SE update operation. In doing so, I show a viable path to move from the theoretical concepts described by previous researchers to a future production-worthy implementation and identify issues for follow-on investigation.",
    "link": "http://arxiv.org/abs/2308.13486",
    "context": "Title: On the Practicality of Dynamic Updates in Fast Searchable Encryption. (arXiv:2308.13486v1 [cs.CR])\nAbstract: Searchable encrypted (SE) indexing systems are a useful tool for utilizing cloud services to store and manage sensitive information. However, much of the work on SE systems to date has remained theoretical. In order to make them of practical use, more work is needed to develop optimal protocols and working models for them. This includes, in particular, the creation of a working update model in order to maintain an encrypted index of a dynamic document set such as an email inbox. I have created a working, real-world end-to-end SE implementation that satisfies these needs, including the first empirical performance evaluation of the dynamic SE update operation. In doing so, I show a viable path to move from the theoretical concepts described by previous researchers to a future production-worthy implementation and identify issues for follow-on investigation.",
    "path": "papers/23/08/2308.13486.json",
    "total_tokens": 786,
    "translated_title": "关于快速可搜索加密中动态更新的实用性研究",
    "translated_abstract": "可搜索加密(SE)索引系统是一种利用云服务存储和管理敏感信息的有用工具。然而，迄今为止，SE系统的大部分工作仍停留在理论阶段。为了使其实用化，需要更多工作来开发最优的协议和工作模型。这包括特别创建一个可工作的更新模型，以保持对动态文档集合（如电子邮件收件箱）进行加密索引的能力。我已经创建了一个实际运行的、端到端的SE实施，满足了这些需求，并进行了动态SE更新操作的第一次实证性性能评估。通过这样做，我展示了从先前研究人员描述的理论概念转向未来可投入生产的实施的可行路径，并确定了需要进一步研究的问题。",
    "tldr": "本论文研究了可搜索加密(SE)索引系统的实用性问题，并提出了一个实际运行的、端到端的SE实施，对动态SE更新操作进行了首次实证性性能评估。"
}