{
    "title": "Software Doping Analysis for Human Oversight. (arXiv:2308.06186v1 [cs.CY])",
    "abstract": "This article introduces a framework that is meant to assist in mitigating societal risks that software can pose. Concretely, this encompasses facets of software doping as well as unfairness and discrimination in high-risk decision-making systems. The term software doping refers to software that contains surreptitiously added functionality that is against the interest of the user. A prominent example of software doping are the tampered emission cleaning systems that were found in millions of cars around the world when the diesel emissions scandal surfaced. The first part of this article combines the formal foundations of software doping analysis with established probabilistic falsification techniques to arrive at a black-box analysis technique for identifying undesired effects of software. We apply this technique to emission cleaning systems in diesel cars but also to high-risk systems that evaluate humans in a possibly unfair or discriminating way. We demonstrate how our approach can a",
    "link": "http://arxiv.org/abs/2308.06186",
    "context": "Title: Software Doping Analysis for Human Oversight. (arXiv:2308.06186v1 [cs.CY])\nAbstract: This article introduces a framework that is meant to assist in mitigating societal risks that software can pose. Concretely, this encompasses facets of software doping as well as unfairness and discrimination in high-risk decision-making systems. The term software doping refers to software that contains surreptitiously added functionality that is against the interest of the user. A prominent example of software doping are the tampered emission cleaning systems that were found in millions of cars around the world when the diesel emissions scandal surfaced. The first part of this article combines the formal foundations of software doping analysis with established probabilistic falsification techniques to arrive at a black-box analysis technique for identifying undesired effects of software. We apply this technique to emission cleaning systems in diesel cars but also to high-risk systems that evaluate humans in a possibly unfair or discriminating way. We demonstrate how our approach can a",
    "path": "papers/23/08/2308.06186.json",
    "total_tokens": 930,
    "translated_title": "软件滥用分析与人类监督",
    "translated_abstract": "本文介绍了一个旨在减轻软件可能带来的社会风险的框架。具体而言，这包括了软件滥用、不公平和高风险决策系统中的歧视。软件滥用是指包含了针对用户利益的秘密添加功能的软件。一个著名的软件滥用示例就是柴油排放丑闻曝光时在全球数百万辆汽车中发现的操纵排放清洁系统。本文的第一部分将软件滥用分析的形式基础与已建立的概率伪造技术相结合，得出了一种用于识别软件不良效果的黑箱分析技术。我们将这种技术应用于柴油汽车排放清洁系统，也应用于以可能不公平或歧视的方式评估人类的高风险系统。我们演示了我们的方法如何可以对决策结果进行评估，并为改进系统提出了建议。",
    "tldr": "本文介绍了一个旨在减轻软件可能带来的社会风险的框架，该框架结合了软件滥用分析的形式基础与概率伪造技术，用于识别软件不良效果。作者应用该技术来评估柴油汽车排放清洁系统和高风险评估人类的决策系统，并提出了改进建议。",
    "en_tdlr": "This article introduces a framework aimed at mitigating the social risks posed by software, combining formal software doping analysis and probabilistic falsification techniques to identify undesired software effects. The authors apply this technique to evaluate emission cleaning systems in diesel cars and high-risk decision-making systems, offering improvement suggestions."
}