{
    "title": "Visual Crowd Analysis: Open Research Problems. (arXiv:2308.10677v2 [cs.CV] UPDATED)",
    "abstract": "Over the last decade, there has been a remarkable surge in interest in automated crowd monitoring within the computer vision community. Modern deep-learning approaches have made it possible to develop fully-automated vision-based crowd-monitoring applications. However, despite the magnitude of the issue at hand, the significant technological advancements, and the consistent interest of the research community, there are still numerous challenges that need to be overcome. In this article, we delve into six major areas of visual crowd analysis, emphasizing the key developments in each of these areas. We outline the crucial unresolved issues that must be tackled in future works, in order to ensure that the field of automated crowd monitoring continues to progress and thrive. Several surveys related to this topic have been conducted in the past. Nonetheless, this article thoroughly examines and presents a more intuitive categorization of works, while also depicting the latest breakthroughs ",
    "link": "http://arxiv.org/abs/2308.10677",
    "context": "Title: Visual Crowd Analysis: Open Research Problems. (arXiv:2308.10677v2 [cs.CV] UPDATED)\nAbstract: Over the last decade, there has been a remarkable surge in interest in automated crowd monitoring within the computer vision community. Modern deep-learning approaches have made it possible to develop fully-automated vision-based crowd-monitoring applications. However, despite the magnitude of the issue at hand, the significant technological advancements, and the consistent interest of the research community, there are still numerous challenges that need to be overcome. In this article, we delve into six major areas of visual crowd analysis, emphasizing the key developments in each of these areas. We outline the crucial unresolved issues that must be tackled in future works, in order to ensure that the field of automated crowd monitoring continues to progress and thrive. Several surveys related to this topic have been conducted in the past. Nonetheless, this article thoroughly examines and presents a more intuitive categorization of works, while also depicting the latest breakthroughs ",
    "path": "papers/23/08/2308.10677.json",
    "total_tokens": 847,
    "translated_title": "可视化人群分析：开放的研究问题",
    "translated_abstract": "在过去的十年中，计算机视觉领域对自动化人群监测的兴趣迅猛增长。现代深度学习方法使得开发全自动基于视觉的人群监测应用成为可能。然而，尽管问题的规模庞大，技术的显著进步以及研究界的持续关注，仍然存在许多需要解决的挑战。在本文中，我们深入探讨了可视化人群分析的六个主要领域，强调了每个领域的关键发展。我们概述了必须在未来的工作中解决的重大未解决问题，以确保自动人群监测领域继续取得进展和繁荣。过去已经进行了一些相关主题的调查。尽管如此，本文全面考察并呈现了更直观的作品分类，同时描述了最新的突破。",
    "tldr": "本文深入探讨了可视化人群分析的六个主要领域，并概述了在未来工作中需要解决的关键问题，以确保自动人群监测领域的进展和繁荣。",
    "en_tdlr": "This article delves into six major areas of visual crowd analysis, outlining the key developments and unresolved issues to ensure the progress and prosperity of automated crowd monitoring."
}