{
    "title": "MONDEO: Multistage Botnet Detection. (arXiv:2308.16570v1 [cs.CR])",
    "abstract": "Mobile devices have widespread to become the most used piece of technology. Due to their characteristics, they have become major targets for botnet-related malware. FluBot is one example of botnet malware that infects mobile devices. In particular, FluBot is a DNS-based botnet that uses Domain Generation Algorithms (DGA) to establish communication with the Command and Control Server (C2). MONDEO is a multistage mechanism with a flexible design to detect DNS-based botnet malware. MONDEO is lightweight and can be deployed without requiring the deployment of software, agents, or configuration in mobile devices, allowing easy integration in core networks. MONDEO comprises four detection stages: Blacklisting/Whitelisting, Query rate analysis, DGA analysis, and Machine learning evaluation. It was created with the goal of processing streams of packets to identify attacks with high efficiency, in the distinct phases. MONDEO was tested against several datasets to measure its efficiency and perf",
    "link": "http://arxiv.org/abs/2308.16570",
    "context": "Title: MONDEO: Multistage Botnet Detection. (arXiv:2308.16570v1 [cs.CR])\nAbstract: Mobile devices have widespread to become the most used piece of technology. Due to their characteristics, they have become major targets for botnet-related malware. FluBot is one example of botnet malware that infects mobile devices. In particular, FluBot is a DNS-based botnet that uses Domain Generation Algorithms (DGA) to establish communication with the Command and Control Server (C2). MONDEO is a multistage mechanism with a flexible design to detect DNS-based botnet malware. MONDEO is lightweight and can be deployed without requiring the deployment of software, agents, or configuration in mobile devices, allowing easy integration in core networks. MONDEO comprises four detection stages: Blacklisting/Whitelisting, Query rate analysis, DGA analysis, and Machine learning evaluation. It was created with the goal of processing streams of packets to identify attacks with high efficiency, in the distinct phases. MONDEO was tested against several datasets to measure its efficiency and perf",
    "path": "papers/23/08/2308.16570.json",
    "total_tokens": 876,
    "translated_title": "MONDEO: 多阶段僵尸网络检测",
    "translated_abstract": "移动设备已广泛成为最常用的技术设备。由于其特性，它们成为僵尸网络恶意软件的主要目标。FluBot是一种感染移动设备的候选僵尸网恶意软件的例子。特别是，FluBot是一种基于DNS的僵尸网络，使用域名生成算法(DGA)与命令和控制服务器(C2)进行通信。MONDEO是一种多阶段机制，具有灵活的设计，用于检测基于DNS的僵尸网络恶意软件。MONDEO轻巧，并且可以在手机设备中部署而不需要部署软件、代理或配置，方便地集成到核心网络中。MONDEO包括四个检测阶段：黑名单/白名单，查询率分析， DGA分析和机器学习评估。它被设计用来处理数据包流以高效地识别在不同阶段中的攻击。MONDEO通过对多个数据集进行测试以衡量其效率和性能。",
    "tldr": "MONDEO是一种多阶段机制，用于检测基于DNS的僵尸网络恶意软件，它轻巧且可以在手机设备中部署，通过处理数据包流进行高效的攻击识别。",
    "en_tdlr": "MONDEO is a multistage mechanism for detecting DNS-based botnet malware that can be deployed in mobile devices and efficiently identify attacks by processing packet streams."
}