{
    "title": "Towards Ontology-Mediated Planning with OWL DL Ontologies (Extended Version). (arXiv:2308.08200v1 [cs.AI])",
    "abstract": "While classical planning languages make the closed-domain and closed-world assumption, there have been various approaches to extend those with DL reasoning, which is then interpreted under the usual open-world semantics. Current approaches for planning with DL ontologies integrate the DL directly into the planning language, and practical approaches have been developed based on first-order rewritings or rewritings into datalog. We present here a new approach in which the planning specification and ontology are kept separate, and are linked together using an interface. This allows planning experts to work in a familiar formalism, while existing ontologies can be easily integrated and extended by ontology experts. Our approach for planning with those ontology-mediated planning problems is optimized for cases with comparatively small domains, and supports the whole OWL DL fragment. The idea is to rewrite the ontology-mediated planning problem into a classical planning problem to be process",
    "link": "http://arxiv.org/abs/2308.08200",
    "context": "Title: Towards Ontology-Mediated Planning with OWL DL Ontologies (Extended Version). (arXiv:2308.08200v1 [cs.AI])\nAbstract: While classical planning languages make the closed-domain and closed-world assumption, there have been various approaches to extend those with DL reasoning, which is then interpreted under the usual open-world semantics. Current approaches for planning with DL ontologies integrate the DL directly into the planning language, and practical approaches have been developed based on first-order rewritings or rewritings into datalog. We present here a new approach in which the planning specification and ontology are kept separate, and are linked together using an interface. This allows planning experts to work in a familiar formalism, while existing ontologies can be easily integrated and extended by ontology experts. Our approach for planning with those ontology-mediated planning problems is optimized for cases with comparatively small domains, and supports the whole OWL DL fragment. The idea is to rewrite the ontology-mediated planning problem into a classical planning problem to be process",
    "path": "papers/23/08/2308.08200.json",
    "total_tokens": 863,
    "translated_title": "基于OWL DL本体论的规划方法（扩展版本）",
    "translated_abstract": "传统的规划语言假设领域是封闭的，并具有封闭世界的属性。为了扩展这些语言，已经提出了各种方法来与DL推理结合，然后按照通常的开放世界语义进行解释。目前的DL本体规划方法将DL直接集成到规划语言中，并基于一阶重写或重写为datalog来开发实际方法。本文提出了一种新的方法，将规划规范和本体分开，并通过接口将它们连接在一起。这使得规划专家能够使用熟悉的形式化语言工作，同时本体专家可以轻松集成和扩展现有本体。我们的方法针对相对较小的领域进行了优化，并支持整个OWL DL片段。具体思路是将本体规划问题重写为经典的规划问题进行处理。",
    "tldr": "该论文提出了一种基于OWL DL本体论的规划方法，通过将规划规范和本体分开，并使用接口将其连接在一起，实现了规划专家与本体专家的紧密合作。这种方法优化了相对较小领域下的本体问题，并支持整个OWL DL片段。",
    "en_tdlr": "This paper presents an approach towards ontology-mediated planning with OWL DL ontologies, by separating the planning specification and ontology and linking them together using an interface. The approach optimizes planning for small domains and supports the entire OWL DL fragment."
}