{
    "title": "Augmenting medical image classifiers with synthetic data from latent diffusion models. (arXiv:2308.12453v1 [cs.CV])",
    "abstract": "While hundreds of artificial intelligence (AI) algorithms are now approved or cleared by the US Food and Drugs Administration (FDA), many studies have shown inconsistent generalization or latent bias, particularly for underrepresented populations. Some have proposed that generative AI could reduce the need for real data, but its utility in model development remains unclear. Skin disease serves as a useful case study in synthetic image generation due to the diversity of disease appearance, particularly across the protected attribute of skin tone. Here we show that latent diffusion models can scalably generate images of skin disease and that augmenting model training with these data improves performance in data-limited settings. These performance gains saturate at synthetic-to-real image ratios above 10:1 and are substantially smaller than the gains obtained from adding real images. As part of our analysis, we generate and analyze a new dataset of 458,920 synthetic images produced using ",
    "link": "http://arxiv.org/abs/2308.12453",
    "context": "Title: Augmenting medical image classifiers with synthetic data from latent diffusion models. (arXiv:2308.12453v1 [cs.CV])\nAbstract: While hundreds of artificial intelligence (AI) algorithms are now approved or cleared by the US Food and Drugs Administration (FDA), many studies have shown inconsistent generalization or latent bias, particularly for underrepresented populations. Some have proposed that generative AI could reduce the need for real data, but its utility in model development remains unclear. Skin disease serves as a useful case study in synthetic image generation due to the diversity of disease appearance, particularly across the protected attribute of skin tone. Here we show that latent diffusion models can scalably generate images of skin disease and that augmenting model training with these data improves performance in data-limited settings. These performance gains saturate at synthetic-to-real image ratios above 10:1 and are substantially smaller than the gains obtained from adding real images. As part of our analysis, we generate and analyze a new dataset of 458,920 synthetic images produced using ",
    "path": "papers/23/08/2308.12453.json",
    "total_tokens": 913,
    "translated_title": "利用潜在扩散模型的合成数据增强医学图像分类器",
    "translated_abstract": "虽然现在有数百种人工智能算法已获得美国食品和药物管理局的批准或清除，但许多研究显示其一致性泛化或潜在偏差存在不一致，特别是对于少数群体。有人提出生成式人工智能可以减少对真实数据的需求，但其在模型开发中的效用尚不清楚。皮肤疾病是合成图像生成的有用案例研究，因为疾病外观具有多样性，特别是在皮肤色调这一保护属性上。我们展示了潜在扩散模型可以可扩展地生成皮肤疾病图像，并且在数据受限情况下，将这些数据用于模型训练可以提高性能。这种性能提升在合成到真实图像比例超过10：1后达到饱和，并且比添加真实图像所获得的提升要小得多。作为我们分析的一部分，我们生成并分析了一个新的数据集，其中包括458,920个合成图像。",
    "tldr": "使用潜在扩散模型生成的合成数据可提高医学图像分类器的性能，在数据受限的情况下表现出饱和效果，比添加真实图像获得的性能提升要小得多。"
}