{
    "title": "Value of Assistance for Mobile Agents. (arXiv:2308.11961v1 [cs.RO])",
    "abstract": "Mobile robotic agents often suffer from localization uncertainty which grows with time and with the agents' movement. This can hinder their ability to accomplish their task. In some settings, it may be possible to perform assistive actions that reduce uncertainty about a robot's location. For example, in a collaborative multi-robot system, a wheeled robot can request assistance from a drone that can fly to its estimated location and reveal its exact location on the map or accompany it to its intended location. Since assistance may be costly and limited, and may be requested by different members of a team, there is a need for principled ways to support the decision of which assistance to provide to an agent and when, as well as to decide which agent to help within a team. For this purpose, we propose Value of Assistance (VOA) to represent the expected cost reduction that assistance will yield at a given point of execution. We offer ways to compute VOA based on estimations of the robot's",
    "link": "http://arxiv.org/abs/2308.11961",
    "context": "Title: Value of Assistance for Mobile Agents. (arXiv:2308.11961v1 [cs.RO])\nAbstract: Mobile robotic agents often suffer from localization uncertainty which grows with time and with the agents' movement. This can hinder their ability to accomplish their task. In some settings, it may be possible to perform assistive actions that reduce uncertainty about a robot's location. For example, in a collaborative multi-robot system, a wheeled robot can request assistance from a drone that can fly to its estimated location and reveal its exact location on the map or accompany it to its intended location. Since assistance may be costly and limited, and may be requested by different members of a team, there is a need for principled ways to support the decision of which assistance to provide to an agent and when, as well as to decide which agent to help within a team. For this purpose, we propose Value of Assistance (VOA) to represent the expected cost reduction that assistance will yield at a given point of execution. We offer ways to compute VOA based on estimations of the robot's",
    "path": "papers/23/08/2308.11961.json",
    "total_tokens": 899,
    "translated_title": "移动机器人的辅助价值",
    "translated_abstract": "移动机器人代理经常受到时间和机器人移动导致的位置不确定性的困扰，这可能会影响它们完成任务的能力。在某些情况下，可以执行辅助操作来减少机器人位置的不确定性。例如，在协作多机器人系统中，一个轮式机器人可以请求一架无人机的帮助，无人机可以飞到其预估位置上，并在地图上显示其确切位置，或者陪同其到达目标位置。由于辅助可能昂贵且有限，并且可能由团队的不同成员提出请求，因此有必要提供有原则的方法来支持何时以及向代理提供哪种辅助的决策，以及在团队中决定帮助哪个代理。为此，我们提出了辅助价值（Value of Assistance，VOA）来表示在执行的特定点辅助将产生的预期成本减少。我们提供了一种基于机器人位置估计的方法来计算VOA。",
    "tldr": "该论文提出了一种称为辅助价值（VOA）的概念，用于表示在移动机器人执行过程中提供辅助所产生的预期成本减少，以及决定何时以及向哪个代理提供辅助的决策。",
    "en_tdlr": "This paper proposes the concept of Value of Assistance (VOA) to represent the expected cost reduction that assistance can provide during the execution of mobile robotic agents, and to support the decision of when and which agent to assist."
}