{
    "title": "DeLELSTM: Decomposition-based Linear Explainable LSTM to Capture Instantaneous and Long-term Effects in Time Series. (arXiv:2308.13797v1 [cs.LG])",
    "abstract": "Time series forecasting is prevalent in various real-world applications. Despite the promising results of deep learning models in time series forecasting, especially the Recurrent Neural Networks (RNNs), the explanations of time series models, which are critical in high-stakes applications, have received little attention. In this paper, we propose a Decomposition-based Linear Explainable LSTM (DeLELSTM) to improve the interpretability of LSTM. Conventionally, the interpretability of RNNs only concentrates on the variable importance and time importance. We additionally distinguish between the instantaneous influence of new coming data and the long-term effects of historical data. Specifically, DeLELSTM consists of two components, i.e., standard LSTM and tensorized LSTM. The tensorized LSTM assigns each variable with a unique hidden state making up a matrix $\\mathbf{h}_t$, and the standard LSTM models all the variables with a shared hidden state $\\mathbf{H}_t$. By decomposing the $\\mathb",
    "link": "http://arxiv.org/abs/2308.13797",
    "context": "Title: DeLELSTM: Decomposition-based Linear Explainable LSTM to Capture Instantaneous and Long-term Effects in Time Series. (arXiv:2308.13797v1 [cs.LG])\nAbstract: Time series forecasting is prevalent in various real-world applications. Despite the promising results of deep learning models in time series forecasting, especially the Recurrent Neural Networks (RNNs), the explanations of time series models, which are critical in high-stakes applications, have received little attention. In this paper, we propose a Decomposition-based Linear Explainable LSTM (DeLELSTM) to improve the interpretability of LSTM. Conventionally, the interpretability of RNNs only concentrates on the variable importance and time importance. We additionally distinguish between the instantaneous influence of new coming data and the long-term effects of historical data. Specifically, DeLELSTM consists of two components, i.e., standard LSTM and tensorized LSTM. The tensorized LSTM assigns each variable with a unique hidden state making up a matrix $\\mathbf{h}_t$, and the standard LSTM models all the variables with a shared hidden state $\\mathbf{H}_t$. By decomposing the $\\mathb",
    "path": "papers/23/08/2308.13797.json",
    "total_tokens": 916,
    "translated_title": "DeLELSTM: 基于分解的线性可解释LSTM模型，能够捕捉时序数据的瞬时和长期影响",
    "translated_abstract": "时序预测在各种实际应用中非常常见。尽管深度学习模型，尤其是循环神经网络（RNNs）在时序预测中取得了有希望的结果，但对于关键的高风险应用中，时序模型的解释却鲜有研究。在本文中，我们提出了一种基于分解的线性可解释LSTM（DeLELSTM）来提高LSTM的可解释性。传统上，RNNs的可解释性只关注变量重要性和时间重要性。我们额外区分了新数据的瞬时影响和历史数据的长期影响。具体而言，DeLELSTM包括两个组成部分，即标准LSTM和张量化LSTM。张量化LSTM为每个变量分配一个唯一的隐藏状态，构成一个矩阵 $\\mathbf{h}_t$，标准LSTM则使用共享的隐藏状态 $\\mathbf{H}_t$ 来对所有变量进行建模。",
    "tldr": "本文提出了一种基于分解的线性可解释LSTM（DeLELSTM）模型，用于提高时序模型的可解释性。与传统方法不同的是，DeLELSTM能够区分新数据的瞬时影响和历史数据的长期影响。这一方法包含了标准LSTM和张量化LSTM两部分，分别处理不同的影响。"
}