{
    "title": "Unveiling the Role of Message Passing in Dual-Privacy Preservation on GNNs. (arXiv:2308.13513v1 [cs.LG])",
    "abstract": "Graph Neural Networks (GNNs) are powerful tools for learning representations on graphs, such as social networks. However, their vulnerability to privacy inference attacks restricts their practicality, especially in high-stake domains. To address this issue, privacy-preserving GNNs have been proposed, focusing on preserving node and/or link privacy. This work takes a step back and investigates how GNNs contribute to privacy leakage. Through theoretical analysis and simulations, we identify message passing under structural bias as the core component that allows GNNs to \\textit{propagate} and \\textit{amplify} privacy leakage. Building upon these findings, we propose a principled privacy-preserving GNN framework that effectively safeguards both node and link privacy, referred to as dual-privacy preservation. The framework comprises three major modules: a Sensitive Information Obfuscation Module that removes sensitive information from node embeddings, a Dynamic Structure Debiasing Module th",
    "link": "http://arxiv.org/abs/2308.13513",
    "context": "Title: Unveiling the Role of Message Passing in Dual-Privacy Preservation on GNNs. (arXiv:2308.13513v1 [cs.LG])\nAbstract: Graph Neural Networks (GNNs) are powerful tools for learning representations on graphs, such as social networks. However, their vulnerability to privacy inference attacks restricts their practicality, especially in high-stake domains. To address this issue, privacy-preserving GNNs have been proposed, focusing on preserving node and/or link privacy. This work takes a step back and investigates how GNNs contribute to privacy leakage. Through theoretical analysis and simulations, we identify message passing under structural bias as the core component that allows GNNs to \\textit{propagate} and \\textit{amplify} privacy leakage. Building upon these findings, we propose a principled privacy-preserving GNN framework that effectively safeguards both node and link privacy, referred to as dual-privacy preservation. The framework comprises three major modules: a Sensitive Information Obfuscation Module that removes sensitive information from node embeddings, a Dynamic Structure Debiasing Module th",
    "path": "papers/23/08/2308.13513.json",
    "total_tokens": 876,
    "translated_title": "揭示GNN中消息传递在双隐私保护上的作用",
    "translated_abstract": "图神经网络（GNN）是学习图形表示的强大工具，如社交网络。然而，它们易受隐私推断攻击的影响限制了它们的实用性，特别是在高风险领域。为了解决这个问题，提出了保护隐私的GNN，并着重于保护节点和/或链路隐私。本研究回顾了GNN对隐私泄露的贡献，并通过理论分析和模拟，确定了结构偏差下的消息传递作为GNN“传播”和“放大”隐私泄露的核心组成部分。基于这些发现，我们提出了一种有原则的双隐私保护GNN框架，有效地保护节点和链路隐私。该框架包括三个主要模块：一个敏感信息混淆模块，从节点嵌入中删除敏感信息；一个动态结构去偏模块。",
    "tldr": "本论文揭示了GNN中消息传递在隐私泄露中的核心作用，并提出了一种有原则的双隐私保护GNN框架，有效保护节点和链路的隐私。",
    "en_tdlr": "This paper unveils the crucial role of message passing in privacy leakage on GNNs and proposes a principled dual-privacy preservation GNN framework that effectively protects both node and link privacy."
}