{
    "title": "Optimal ratcheting of dividend payout under Brownian motion surplus. (arXiv:2308.15048v1 [q-fin.MF])",
    "abstract": "This paper is concerned with a long standing optimal dividend payout problem in insurance subject to the so-called ratcheting constraint, that is, the dividend payout rate shall be non-decreasing over time. The surplus process is modeled by a drifted Brownian motion process and the aim is to find the optimal dividend ratcheting strategy to maximize the expectation of the total discounted dividend payouts until the ruin time. Due to the path-dependent constraint, the standard control theory cannot be directly applied to tackle the problem. The related Hamilton-Jacobi-Bellman (HJB) equation is a new type of variational inequality. In the literature, it is only shown to have a viscosity solution, which is not strong enough to guarantee the existence of an optimal dividend ratcheting strategy. This paper proposes a novel partial differential equation method to study the HJB equation. We not only prove the the existence and uniqueness of the solution in some stronger functional space, but a",
    "link": "http://arxiv.org/abs/2308.15048",
    "context": "Title: Optimal ratcheting of dividend payout under Brownian motion surplus. (arXiv:2308.15048v1 [q-fin.MF])\nAbstract: This paper is concerned with a long standing optimal dividend payout problem in insurance subject to the so-called ratcheting constraint, that is, the dividend payout rate shall be non-decreasing over time. The surplus process is modeled by a drifted Brownian motion process and the aim is to find the optimal dividend ratcheting strategy to maximize the expectation of the total discounted dividend payouts until the ruin time. Due to the path-dependent constraint, the standard control theory cannot be directly applied to tackle the problem. The related Hamilton-Jacobi-Bellman (HJB) equation is a new type of variational inequality. In the literature, it is only shown to have a viscosity solution, which is not strong enough to guarantee the existence of an optimal dividend ratcheting strategy. This paper proposes a novel partial differential equation method to study the HJB equation. We not only prove the the existence and uniqueness of the solution in some stronger functional space, but a",
    "path": "papers/23/08/2308.15048.json",
    "total_tokens": 909,
    "translated_title": "在布朗运动剩余下的股利支付问题中的最优齿轮问题",
    "translated_abstract": "本文研究了保险行业中长期存在的带有所谓齿轮约束的最优股利支付问题，即股利支付率在时间上应是非递减的。剩余过程是由漂移布朗运动过程建模的，目标是找到最优的股利齿轮策略，以最大化破产时间前总贴现股利支付的期望。由于路径依赖约束，标准控制理论无法直接应用于解决该问题。相关的Hamilton-Jacobi-Bellman（HJB）方程是一种新型的变分不等式。在文献中，只证明了它具有黏性解，这对于保证最优股利齿轮策略的存在性是不够强的。本文提出了一种新颖的偏微分方程方法来研究HJB方程。我们不仅在一些更强的函数空间中证明了解的存在性和唯一性，而且在强表示解的存在性方面取得了一些初步结果。",
    "tldr": "本文研究了保险行业中的最优股利支付问题，在考虑齿轮约束的条件下，使用布朗运动剩余模型和偏微分方程方法找到了最优股利齿轮策略。"
}