{
    "title": "A Flow Artist for High-Dimensional Cellular Data. (arXiv:2308.00176v1 [cs.LG])",
    "abstract": "We consider the problem of embedding point cloud data sampled from an underlying manifold with an associated flow or velocity. Such data arises in many contexts where static snapshots of dynamic entities are measured, including in high-throughput biology such as single-cell transcriptomics. Existing embedding techniques either do not utilize velocity information or embed the coordinates and velocities independently, i.e., they either impose velocities on top of an existing point embedding or embed points within a prescribed vector field. Here we present FlowArtist, a neural network that embeds points while jointly learning a vector field around the points. The combination allows FlowArtist to better separate and visualize velocity-informed structures. Our results, on toy datasets and single-cell RNA velocity data, illustrate the value of utilizing coordinate and velocity information in tandem for embedding and visualizing high-dimensional data.",
    "link": "http://arxiv.org/abs/2308.00176",
    "context": "Title: A Flow Artist for High-Dimensional Cellular Data. (arXiv:2308.00176v1 [cs.LG])\nAbstract: We consider the problem of embedding point cloud data sampled from an underlying manifold with an associated flow or velocity. Such data arises in many contexts where static snapshots of dynamic entities are measured, including in high-throughput biology such as single-cell transcriptomics. Existing embedding techniques either do not utilize velocity information or embed the coordinates and velocities independently, i.e., they either impose velocities on top of an existing point embedding or embed points within a prescribed vector field. Here we present FlowArtist, a neural network that embeds points while jointly learning a vector field around the points. The combination allows FlowArtist to better separate and visualize velocity-informed structures. Our results, on toy datasets and single-cell RNA velocity data, illustrate the value of utilizing coordinate and velocity information in tandem for embedding and visualizing high-dimensional data.",
    "path": "papers/23/08/2308.00176.json",
    "total_tokens": 825,
    "translated_title": "一个用于高维细胞数据的流动艺术家",
    "translated_abstract": "本文考虑了将采样自相关流动或速度的底层流形的点云数据嵌入其中的问题。这样的数据在许多情况下出现，包括高通量生物学（如单细胞转录组学）中测量动态实体的静态快照。现有的嵌入技术要么不利用速度信息，要么独立地嵌入坐标和速度，即在现有点嵌入的基础上施加速度，或将点嵌入到一个预先指定的向量场中。在这里，我们提出了一种名为FlowArtist的神经网络，它在嵌入点的同时学习了一个围绕点的向量场。这种组合使得FlowArtist能够更好地分离和可视化基于速度的结构。我们的结果，在玩具数据集和单细胞RNA速度数据上，说明了利用坐标和速度信息同步进行嵌入和可视化高维数据的价值。",
    "tldr": "本研究提出了一个名为FlowArtist的神经网络，可以同时嵌入点和学习围绕点的向量场，从而更好地分离和可视化基于速度的结构。"
}