{
    "title": "Adaptive Thresholding Heuristic for KPI Anomaly Detection. (arXiv:2308.10504v1 [cs.LG])",
    "abstract": "A plethora of outlier detectors have been explored in the time series domain, however, in a business sense, not all outliers are anomalies of interest. Existing anomaly detection solutions are confined to certain outlier detectors limiting their applicability to broader anomaly detection use cases. Network KPIs (Key Performance Indicators) tend to exhibit stochastic behaviour producing statistical outliers, most of which do not adversely affect business operations. Thus, a heuristic is required to capture the business definition of an anomaly for time series KPI. This article proposes an Adaptive Thresholding Heuristic (ATH) to dynamically adjust the detection threshold based on the local properties of the data distribution and adapt to changes in time series patterns. The heuristic derives the threshold based on the expected periodicity and the observed proportion of anomalies minimizing false positives and addressing concept drift. ATH can be used in conjunction with any underlying s",
    "link": "http://arxiv.org/abs/2308.10504",
    "context": "Title: Adaptive Thresholding Heuristic for KPI Anomaly Detection. (arXiv:2308.10504v1 [cs.LG])\nAbstract: A plethora of outlier detectors have been explored in the time series domain, however, in a business sense, not all outliers are anomalies of interest. Existing anomaly detection solutions are confined to certain outlier detectors limiting their applicability to broader anomaly detection use cases. Network KPIs (Key Performance Indicators) tend to exhibit stochastic behaviour producing statistical outliers, most of which do not adversely affect business operations. Thus, a heuristic is required to capture the business definition of an anomaly for time series KPI. This article proposes an Adaptive Thresholding Heuristic (ATH) to dynamically adjust the detection threshold based on the local properties of the data distribution and adapt to changes in time series patterns. The heuristic derives the threshold based on the expected periodicity and the observed proportion of anomalies minimizing false positives and addressing concept drift. ATH can be used in conjunction with any underlying s",
    "path": "papers/23/08/2308.10504.json",
    "total_tokens": 883,
    "translated_title": "适应性阈值启发式方法用于KPI异常检测",
    "translated_abstract": "在时间序列领域中，已经探索了大量的异常检测方法，然而从商业角度讲，并不是所有的异常都是我们关心的。现有的异常检测解决方案局限于某些异常检测算法，限制了其在更广泛的异常检测场景中的适用性。网络KPI（关键性能指标）往往表现出随机行为，产生统计异常，其中大部分不会对业务运营产生不利影响。因此，需要一种启发式方法来捕捉时间序列KPI中异常的商业定义。本文提出了一种自适应阈值启发式方法（ATH），通过根据数据分布的局部属性动态调整检测阈值，并适应于时间序列模式的变化。该方法基于预期的周期性和观察到的异常比例来确定阈值，以最小化误报和应对概念漂移。ATH可以与任何基础的异常检测方法结合使用。",
    "tldr": "该论文提出了一种自适应阈值启发式方法（ATH），用于时间序列KPI的异常检测。该方法通过根据数据分布的局部属性动态调整检测阈值，并适应于时间序列模式的变化，以最小化误报和应对概念漂移。"
}