{
    "title": "TAI-GAN: Temporally and Anatomically Informed GAN for early-to-late frame conversion in dynamic cardiac PET motion correction. (arXiv:2308.12443v1 [eess.IV])",
    "abstract": "The rapid tracer kinetics of rubidium-82 ($^{82}$Rb) and high variation of cross-frame distribution in dynamic cardiac positron emission tomography (PET) raise significant challenges for inter-frame motion correction, particularly for the early frames where conventional intensity-based image registration techniques are not applicable. Alternatively, a promising approach utilizes generative methods to handle the tracer distribution changes to assist existing registration methods. To improve frame-wise registration and parametric quantification, we propose a Temporally and Anatomically Informed Generative Adversarial Network (TAI-GAN) to transform the early frames into the late reference frame using an all-to-one mapping. Specifically, a feature-wise linear modulation layer encodes channel-wise parameters generated from temporal tracer kinetics information, and rough cardiac segmentations with local shifts serve as the anatomical information. We validated our proposed method on a clinica",
    "link": "http://arxiv.org/abs/2308.12443",
    "context": "Title: TAI-GAN: Temporally and Anatomically Informed GAN for early-to-late frame conversion in dynamic cardiac PET motion correction. (arXiv:2308.12443v1 [eess.IV])\nAbstract: The rapid tracer kinetics of rubidium-82 ($^{82}$Rb) and high variation of cross-frame distribution in dynamic cardiac positron emission tomography (PET) raise significant challenges for inter-frame motion correction, particularly for the early frames where conventional intensity-based image registration techniques are not applicable. Alternatively, a promising approach utilizes generative methods to handle the tracer distribution changes to assist existing registration methods. To improve frame-wise registration and parametric quantification, we propose a Temporally and Anatomically Informed Generative Adversarial Network (TAI-GAN) to transform the early frames into the late reference frame using an all-to-one mapping. Specifically, a feature-wise linear modulation layer encodes channel-wise parameters generated from temporal tracer kinetics information, and rough cardiac segmentations with local shifts serve as the anatomical information. We validated our proposed method on a clinica",
    "path": "papers/23/08/2308.12443.json",
    "total_tokens": 905,
    "translated_title": "TAI-GAN：时间和解剖信息感知的生成对抗网络，用于动态心脏PET运动校正中的早期到晚期帧转换",
    "translated_abstract": "鲍比铷引物($^{82}$Rb)的快速示踪剂动力学和动态心脏正电子发射断层显像(PET)中帧间分布的高变异性给帧间运动校正提出了显著的挑战，尤其是在传统的基于强度的图像配准技术不适用的早期帧上。作为替代方法，一种有希望的方法是利用生成方法处理示踪剂分布变化，以辅助现有的配准方法。为了改进逐帧配准和参数化量化，我们提出了一种时间和解剖信息感知的生成对抗网络(TAI-GAN)，将早期帧转换为晚期参考帧，使用一个对一的映射。具体地，一个特征逐通道线性调制层编码来自时间示踪剂动力学信息生成的通道参数，粗略的心脏分割带有局部移位作为解剖信息。我们在临床数据上验证了我们提出的方法。",
    "tldr": "TAI-GAN是一种用于动态心脏PET运动校正的生成对抗网络，通过时间和解剖信息感知实现早期到晚期帧的转换。",
    "en_tdlr": "TAI-GAN is a generative adversarial network for dynamic cardiac PET motion correction, enabling early-to-late frame conversion through the use of temporal and anatomical information."
}