{
    "title": "Generalised Winograd Schema and its Contextuality. (arXiv:2308.16498v1 [cs.CL])",
    "abstract": "Ambiguities in natural language give rise to probability distributions over interpretations. The distributions are often over multiple ambiguous words at a time; a multiplicity which makes them a suitable topic for sheaf-theoretic models of quantum contextuality. Previous research showed that different quantitative measures of contextuality correlate well with Psycholinguistic research on lexical ambiguities. In this work, we focus on coreference ambiguities and investigate the Winograd Schema Challenge (WSC), a test proposed by Levesque in 2011 to evaluate the intelligence of machines. The WSC consists of a collection of multiple-choice questions that require disambiguating pronouns in sentences structured according to the Winograd schema, in a way that makes it difficult for machines to determine the correct referents but remains intuitive for human comprehension. In this study, we propose an approach that analogously models the Winograd schema as an experiment in quantum physics. Ho",
    "link": "http://arxiv.org/abs/2308.16498",
    "context": "Title: Generalised Winograd Schema and its Contextuality. (arXiv:2308.16498v1 [cs.CL])\nAbstract: Ambiguities in natural language give rise to probability distributions over interpretations. The distributions are often over multiple ambiguous words at a time; a multiplicity which makes them a suitable topic for sheaf-theoretic models of quantum contextuality. Previous research showed that different quantitative measures of contextuality correlate well with Psycholinguistic research on lexical ambiguities. In this work, we focus on coreference ambiguities and investigate the Winograd Schema Challenge (WSC), a test proposed by Levesque in 2011 to evaluate the intelligence of machines. The WSC consists of a collection of multiple-choice questions that require disambiguating pronouns in sentences structured according to the Winograd schema, in a way that makes it difficult for machines to determine the correct referents but remains intuitive for human comprehension. In this study, we propose an approach that analogously models the Winograd schema as an experiment in quantum physics. Ho",
    "path": "papers/23/08/2308.16498.json",
    "total_tokens": 839,
    "translated_title": "广义Winograd Schema及其上下文性",
    "translated_abstract": "自然语言中的歧义会引起对解释的概率分布。这些分布通常涉及到多个模棱两可的词汇，这使得它们成为适合量子上下文性拟设模型的研究主题。以前的研究表明，上下文性的不同定量度量与心理语言学研究中的词义歧义有很好的相关性。在本研究中，我们关注指代的歧义，并研究了Winograd模式挑战（WSC），这是Levesque在2011年提出的用于评估机器智能的测试。WSC包含一系列多项选择问题，需要在按照Winograd模式构造的句子中消除代词的歧义，这对机器来说很难确定正确的代词指向，但对人类理解来说却很直观。在本研究中，我们提出了一种类似地将Winograd模式建模为量子物理实验的方法。",
    "tldr": "本文研究了广义Winograd Schema在上下文性方面的应用，提出了一种利用量子物理实验模型来解决Winograd模式挑战的方法。",
    "en_tdlr": "This paper investigates the applicability of Generalised Winograd Schema in the contextuality field and proposes an approach that uses a quantum physics experiment model to solve the Winograd Schema Challenge."
}