{
    "title": "On stable wrapper-based parameter selection method for efficient ANN-based data-driven modeling of turbulent flows. (arXiv:2308.02602v1 [physics.flu-dyn])",
    "abstract": "To model complex turbulent flow and heat transfer phenomena, this study aims to analyze and develop a reduced modeling approach based on artificial neural network (ANN) and wrapper methods. This approach has an advantage over other methods such as the correlation-based filter method in terms of removing redundant or irrelevant parameters even under non-linearity among them. As a downside, the overfitting and randomness of ANN training may produce inconsistent subsets over selection trials especially in a higher physical dimension. This study analyzes a few existing ANN-based wrapper methods and develops a revised one based on the gradient-based subset selection indices to minimize the loss in the total derivative or the directional consistency at each elimination step. To examine parameter reduction performance and consistency-over-trials, we apply these methods to a manufactured subset selection problem, modeling of the bubble size in a turbulent bubbly flow, and modeling of the spati",
    "link": "http://arxiv.org/abs/2308.02602",
    "context": "Title: On stable wrapper-based parameter selection method for efficient ANN-based data-driven modeling of turbulent flows. (arXiv:2308.02602v1 [physics.flu-dyn])\nAbstract: To model complex turbulent flow and heat transfer phenomena, this study aims to analyze and develop a reduced modeling approach based on artificial neural network (ANN) and wrapper methods. This approach has an advantage over other methods such as the correlation-based filter method in terms of removing redundant or irrelevant parameters even under non-linearity among them. As a downside, the overfitting and randomness of ANN training may produce inconsistent subsets over selection trials especially in a higher physical dimension. This study analyzes a few existing ANN-based wrapper methods and develops a revised one based on the gradient-based subset selection indices to minimize the loss in the total derivative or the directional consistency at each elimination step. To examine parameter reduction performance and consistency-over-trials, we apply these methods to a manufactured subset selection problem, modeling of the bubble size in a turbulent bubbly flow, and modeling of the spati",
    "path": "papers/23/08/2308.02602.json",
    "total_tokens": 942,
    "translated_title": "基于稳定的包装器参数选择方法用于高效的基于ANN的湍流数据驱动建模",
    "translated_abstract": "为了模拟复杂的湍流流动和传热现象，本研究旨在分析和开发一种基于人工神经网络(ANN)和包装器方法的简化建模方法。这种方法相对于其他方法（如基于相关性的过滤方法）具有优势，可以在参数之间存在非线性关系的情况下去除冗余或无关的参数。然而，ANN训练的过度拟合和随机性可能会导致在更高的物理维度下特别是在选择试验中产生不一致的子集。本研究分析了几种现有的基于ANN的包装器方法，并基于基于梯度的子集选择指标开发了修订版方法，以在每个消除步骤中最小化总导数的损失或方向一致性。为了检验参数减少性能和试验一致性，我们将这些方法应用于一个制造的子集选择问题，即湍流气泡流中气泡尺寸的建模，以及空间建模。",
    "tldr": "本研究针对复杂的湍流流动现象，提出了一种基于ANN和包装器方法的简化建模方法，通过基于梯度的子集选择指标，在每个消除步骤中最小化总导数的损失或方向一致性。该方法相对于其他方法具有优势，可以有效去除冗余或无关的参数。"
}