{
    "title": "A Comparative Study on TF-IDF feature Weighting Method and its Analysis using Unstructured Dataset. (arXiv:2308.04037v1 [cs.CL])",
    "abstract": "Text Classification is the process of categorizing text into the relevant categories and its algorithms are at the core of many Natural Language Processing (NLP). Term Frequency-Inverse Document Frequency (TF-IDF) and NLP are the most highly used information retrieval methods in text classification. We have investigated and analyzed the feature weighting method for text classification on unstructured data. The proposed model considered two features N-Grams and TF-IDF on the IMDB movie reviews and Amazon Alexa reviews dataset for sentiment analysis. Then we have used the state-of-the-art classifier to validate the method i.e., Support Vector Machine (SVM), Logistic Regression, Multinomial Naive Bayes (Multinomial NB), Random Forest, Decision Tree, and k-nearest neighbors (KNN). From those two feature extractions, a significant increase in feature extraction with TF-IDF features rather than based on N-Gram. TF-IDF got the maximum accuracy (93.81%), precision (94.20%), recall (93.81%), an",
    "link": "http://arxiv.org/abs/2308.04037",
    "context": "Title: A Comparative Study on TF-IDF feature Weighting Method and its Analysis using Unstructured Dataset. (arXiv:2308.04037v1 [cs.CL])\nAbstract: Text Classification is the process of categorizing text into the relevant categories and its algorithms are at the core of many Natural Language Processing (NLP). Term Frequency-Inverse Document Frequency (TF-IDF) and NLP are the most highly used information retrieval methods in text classification. We have investigated and analyzed the feature weighting method for text classification on unstructured data. The proposed model considered two features N-Grams and TF-IDF on the IMDB movie reviews and Amazon Alexa reviews dataset for sentiment analysis. Then we have used the state-of-the-art classifier to validate the method i.e., Support Vector Machine (SVM), Logistic Regression, Multinomial Naive Bayes (Multinomial NB), Random Forest, Decision Tree, and k-nearest neighbors (KNN). From those two feature extractions, a significant increase in feature extraction with TF-IDF features rather than based on N-Gram. TF-IDF got the maximum accuracy (93.81%), precision (94.20%), recall (93.81%), an",
    "path": "papers/23/08/2308.04037.json",
    "total_tokens": 919,
    "translated_title": "TF-IDF特征加权方法的比较研究及其在非结构化数据集中的分析",
    "translated_abstract": "文本分类是将文本分类到相关类别中的过程，其算法是自然语言处理 (NLP) 的核心。在文本分类中，术语频率-逆文件频率 (TF-IDF) 和 NLP 是最常用的信息检索方法。我们研究和分析了在非结构化数据上进行文本分类的特征加权方法。提出的模型考虑了两个特征 N-Gram 和 TF-IDF，用于情感分析的 IMDB 电影评论和亚马逊 Alexa 评论数据集。然后我们使用了最先进的分类器来验证该方法，即支持向量机 (SVM)、逻辑回归、多项式朴素贝叶斯 (Multinomial NB)、随机森林、决策树和 K 最近邻 (KNN)。从这两个特征提取中，使用 TF-IDF 特征相比基于 N-Gram 有了显著的特征提取增加。TF-IDF 获得了最高的准确率 (93.81%)、精确率 (94.20%)、召回率 (93.81%)，",
    "tldr": "该论文比较研究了TF-IDF特征加权方法并使用非结构化数据集进行了分析，结果发现相比于N-Gram，使用TF-IDF特征可以显著提高特征提取效果。",
    "en_tdlr": "This paper conducts a comparative study on TF-IDF feature weighting method and analyzes its effectiveness using unstructured dataset. The results show that TF-IDF features significantly outperform N-Gram in feature extraction."
}