{
    "title": "Solving Math Word Problem with Problem Type Classification. (arXiv:2308.13844v1 [cs.CL])",
    "abstract": "Math word problems (MWPs) require analyzing text descriptions and generating mathematical equations to derive solutions. Existing works focus on solving MWPs with two types of solvers: tree-based solver and large language model (LLM) solver. However, these approaches always solve MWPs by a single solver, which will bring the following problems: (1) Single type of solver is hard to solve all types of MWPs well. (2) A single solver will result in poor performance due to over-fitting. To address these challenges, this paper utilizes multiple ensemble approaches to improve MWP-solving ability. Firstly, We propose a problem type classifier that combines the strengths of the tree-based solver and the LLM solver. This ensemble approach leverages their respective advantages and broadens the range of MWPs that can be solved. Furthermore, we also apply ensemble techniques to both tree-based solver and LLM solver to improve their performance. For the tree-based solver, we propose an ensemble lear",
    "link": "http://arxiv.org/abs/2308.13844",
    "context": "Title: Solving Math Word Problem with Problem Type Classification. (arXiv:2308.13844v1 [cs.CL])\nAbstract: Math word problems (MWPs) require analyzing text descriptions and generating mathematical equations to derive solutions. Existing works focus on solving MWPs with two types of solvers: tree-based solver and large language model (LLM) solver. However, these approaches always solve MWPs by a single solver, which will bring the following problems: (1) Single type of solver is hard to solve all types of MWPs well. (2) A single solver will result in poor performance due to over-fitting. To address these challenges, this paper utilizes multiple ensemble approaches to improve MWP-solving ability. Firstly, We propose a problem type classifier that combines the strengths of the tree-based solver and the LLM solver. This ensemble approach leverages their respective advantages and broadens the range of MWPs that can be solved. Furthermore, we also apply ensemble techniques to both tree-based solver and LLM solver to improve their performance. For the tree-based solver, we propose an ensemble lear",
    "path": "papers/23/08/2308.13844.json",
    "total_tokens": 832,
    "translated_title": "使用问题类型分类解决数学应用题",
    "translated_abstract": "数学应用题需要分析文本描述并生成数学方程来推导解决方案。现有的方法主要通过基于树的求解器和大型语言模型求解器来解决数学应用题。然而，这些方法总是通过单一求解器来解决数学应用题，会带来以下问题：(1) 单一类型的求解器难以很好地解决所有类型的数学应用题。 (2) 单一求解器会导致过拟合，性能不佳。为了解决这些挑战，本文利用多种集成方法来提高解决数学应用题的能力。首先，我们提出了一个问题类型分类器，结合了基于树的求解器和大型语言模型求解器的优势。这种集成方法利用它们各自的优点，扩大了可以解决的数学应用题的范围。此外，我们还将集成技术应用于基于树的求解器和大型语言模型求解器，以提高它们的性能。",
    "tldr": "本文提出了一个使用问题类型分类的方法来解决数学应用题，通过集成多种方法来提高解决能力，并且利用集成技术提高基于树的求解器和大型语言模型求解器的性能。"
}