{
    "title": "Fragment and Integrate Network (FIN): A Novel Spatial-Temporal Modeling Based on Long Sequential Behavior for Online Food Ordering Click-Through Rate Prediction. (arXiv:2308.15703v1 [cs.IR])",
    "abstract": "Spatial-temporal information has been proven to be of great significance for click-through rate prediction tasks in online Location-Based Services (LBS), especially in mainstream food ordering platforms such as DoorDash, Uber Eats, Meituan, and Ele.me. Modeling user spatial-temporal preferences with sequential behavior data has become a hot topic in recommendation systems and online advertising. However, most of existing methods either lack the representation of rich spatial-temporal information or only handle user behaviors with limited length, e.g. 100. In this paper, we tackle these problems by designing a new spatial-temporal modeling paradigm named Fragment and Integrate Network (FIN). FIN consists of two networks: (i) Fragment Network (FN) extracts Multiple Sub-Sequences (MSS) from lifelong sequential behavior data, and captures the specific spatial-temporal representation by modeling each MSS respectively. Here both a simplified attention and a complicated attention are adopted ",
    "link": "http://arxiv.org/abs/2308.15703",
    "context": "Title: Fragment and Integrate Network (FIN): A Novel Spatial-Temporal Modeling Based on Long Sequential Behavior for Online Food Ordering Click-Through Rate Prediction. (arXiv:2308.15703v1 [cs.IR])\nAbstract: Spatial-temporal information has been proven to be of great significance for click-through rate prediction tasks in online Location-Based Services (LBS), especially in mainstream food ordering platforms such as DoorDash, Uber Eats, Meituan, and Ele.me. Modeling user spatial-temporal preferences with sequential behavior data has become a hot topic in recommendation systems and online advertising. However, most of existing methods either lack the representation of rich spatial-temporal information or only handle user behaviors with limited length, e.g. 100. In this paper, we tackle these problems by designing a new spatial-temporal modeling paradigm named Fragment and Integrate Network (FIN). FIN consists of two networks: (i) Fragment Network (FN) extracts Multiple Sub-Sequences (MSS) from lifelong sequential behavior data, and captures the specific spatial-temporal representation by modeling each MSS respectively. Here both a simplified attention and a complicated attention are adopted ",
    "path": "papers/23/08/2308.15703.json",
    "total_tokens": 926,
    "translated_title": "基于长期顺序行为的在线食品订购点击率预测的新型时空建模方法-Fragment and Integrate Network (FIN)",
    "translated_abstract": "空间-时间信息已被证明在在线基于位置的服务（LBS）中的点击率预测任务中具有重要意义，特别是在主流的食品订购平台上，如DoorDash、Uber Eats、美团和饿了么。通过顺序行为数据建模用户的空间-时间偏好已成为推荐系统和在线广告的热门话题。然而，现有方法大多缺乏对丰富的空间-时间信息的表示，或者仅处理长度有限的用户行为，例如100。在本文中，我们通过设计一种名为Fragment and Integrate Network (FIN)的新型空间-时间建模范式来解决这些问题。FIN包括两个网络：片段网络（FN）从终身顺序行为数据中提取多个子序列（MSS），通过分别对每个MSS进行建模来捕捉特定的空间-时间表示。这里采用了简化的注意力机制和复杂的注意力机制。",
    "tldr": "本文提出了一种名为Fragment and Integrate Network (FIN)的新型空间-时间建模方法，用于在线食品订购点击率预测。该方法通过从顺序行为数据中提取多个子序列，分别对每个子序列进行建模，从而捕捉用户的空间-时间偏好。",
    "en_tdlr": "This paper proposes a novel spatial-temporal modeling method called Fragment and Integrate Network (FIN) for online food ordering click-through rate prediction. The method extracts multiple sub-sequences from sequential behavior data and models each sub-sequence separately to capture user's spatial-temporal preferences."
}