{
    "title": "Nest-DGIL: Nesterov-optimized Deep Geometric Incremental Learning for CS Image Reconstruction. (arXiv:2308.03807v1 [eess.IV])",
    "abstract": "Proximal gradient-based optimization is one of the most common strategies for solving image inverse problems as well as easy to implement. However, these techniques often generate heavy artifacts in image reconstruction. One of the most popular refinement methods is to fine-tune the regularization parameter to alleviate such artifacts, but it may not always be sufficient or applicable due to increased computational costs. In this work, we propose a deep geometric incremental learning framework based on second Nesterov proximal gradient optimization. The proposed end-to-end network not only has the powerful learning ability for high/low frequency image features,but also can theoretically guarantee that geometric texture details will be reconstructed from preliminary linear reconstruction.Furthermore, it can avoid the risk of intermediate reconstruction results falling outside the geometric decomposition domains and achieve fast convergence. Our reconstruction framework is decomposed int",
    "link": "http://arxiv.org/abs/2308.03807",
    "context": "Title: Nest-DGIL: Nesterov-optimized Deep Geometric Incremental Learning for CS Image Reconstruction. (arXiv:2308.03807v1 [eess.IV])\nAbstract: Proximal gradient-based optimization is one of the most common strategies for solving image inverse problems as well as easy to implement. However, these techniques often generate heavy artifacts in image reconstruction. One of the most popular refinement methods is to fine-tune the regularization parameter to alleviate such artifacts, but it may not always be sufficient or applicable due to increased computational costs. In this work, we propose a deep geometric incremental learning framework based on second Nesterov proximal gradient optimization. The proposed end-to-end network not only has the powerful learning ability for high/low frequency image features,but also can theoretically guarantee that geometric texture details will be reconstructed from preliminary linear reconstruction.Furthermore, it can avoid the risk of intermediate reconstruction results falling outside the geometric decomposition domains and achieve fast convergence. Our reconstruction framework is decomposed int",
    "path": "papers/23/08/2308.03807.json",
    "total_tokens": 851,
    "translated_title": "Nest-DGIL: Nesterov优化的深度几何增量学习用于CS图像重构",
    "translated_abstract": "近端梯度优化是解决图像反问题的常用策略之一，易于实现。然而，这些技术在图像重构中通常会产生严重的伪影。一种常用的改进方法是通过微调正则化参数来减轻这些伪影，但由于增加了计算成本，这种方法并不总是足够或适用。在这项工作中，我们提出了一种基于第二Nesterov近端梯度优化的深度几何增量学习框架。所提出的端到端网络不仅具有对高/低频图像特征的强大学习能力，还可以在初步线性重建中从理论上保证几何纹理细节的重建。此外，它可以避免中间重建结果超出几何分解域的风险，并实现快速收敛。我们的重建框架被分解为两个子问题:图像初步线性重建和深度增量学习。",
    "tldr": "提出了一种基于第二Nesterov近端梯度优化的深度几何增量学习框架，能够在图像重建时减轻伪影，同时实现快速收敛。",
    "en_tdlr": "A deep geometric incremental learning framework based on second Nesterov proximal gradient optimization is proposed to alleviate artifacts and achieve fast convergence in image reconstruction."
}