{
    "title": "GNN4FR: A Lossless GNN-based Federated Recommendation Framework. (arXiv:2308.01197v1 [cs.IR])",
    "abstract": "Graph neural networks (GNNs) have gained wide popularity in recommender systems due to their capability to capture higher-order structure information among the nodes of users and items. However, these methods need to collect personal interaction data between a user and the corresponding items and then model them in a central server, which would break the privacy laws such as GDPR. So far, no existing work can construct a global graph without leaking each user's private interaction data (i.e., his or her subgraph). In this paper, we are the first to design a novel lossless federated recommendation framework based on GNN, which achieves full-graph training with complete high-order structure information, enabling the training process to be equivalent to the corresponding un-federated counterpart. In addition, we use LightGCN to instantiate an example of our framework and show its equivalence.",
    "link": "http://arxiv.org/abs/2308.01197",
    "context": "Title: GNN4FR: A Lossless GNN-based Federated Recommendation Framework. (arXiv:2308.01197v1 [cs.IR])\nAbstract: Graph neural networks (GNNs) have gained wide popularity in recommender systems due to their capability to capture higher-order structure information among the nodes of users and items. However, these methods need to collect personal interaction data between a user and the corresponding items and then model them in a central server, which would break the privacy laws such as GDPR. So far, no existing work can construct a global graph without leaking each user's private interaction data (i.e., his or her subgraph). In this paper, we are the first to design a novel lossless federated recommendation framework based on GNN, which achieves full-graph training with complete high-order structure information, enabling the training process to be equivalent to the corresponding un-federated counterpart. In addition, we use LightGCN to instantiate an example of our framework and show its equivalence.",
    "path": "papers/23/08/2308.01197.json",
    "total_tokens": 813,
    "translated_title": "GNN4FR:一种无损基于图神经网络的联邦推荐框架",
    "translated_abstract": "图神经网络（GNN）由于能够捕捉用户和物品节点之间的高阶结构信息，在推荐系统中受到广泛关注。然而，这些方法需要收集用户和相应物品之间的个人交互数据，并在中心服务器中对其进行建模，这可能违反GDPR等隐私法律。至今没有现有的工作可以构建一个全局图，同时又不泄露每个用户的私人交互数据（即他或她的子图）。本文首次设计了一种基于GNN的新型无损联邦推荐框架，实现了具有完整高阶结构信息的全图训练，使训练过程等价于相应的非联邦对应物。此外，我们使用LightGCN来实例化我们的框架，并展示其等价性。",
    "tldr": "这篇论文设计了一种基于无损图神经网络（GNN）的联邦推荐框架，可以实现全图训练，捕捉高阶结构信息，并在保护用户隐私的前提下有效推荐。",
    "en_tdlr": "This paper presents a novel lossless federated recommendation framework based on graph neural networks (GNN), which achieves full-graph training and captures higher-order structure information while protecting user privacy effectively."
}