{
    "title": "Performance Comparison of Design Optimization and Deep Learning-based Inverse Design. (arXiv:2308.13000v1 [math.OC])",
    "abstract": "Surrogate model-based optimization has been increasingly used in the field of engineering design. It involves creating a surrogate model with objective functions or constraints based on the data obtained from simulations or real-world experiments, and then finding the optimal solution from the model using numerical optimization methods. Recent advancements in deep learning-based inverse design methods have made it possible to generate real-time optimal solutions for engineering design problems, eliminating the requirement for iterative optimization processes. Nevertheless, no comprehensive study has yet closely examined the specific advantages and disadvantages of this novel approach compared to the traditional design optimization method. The objective of this paper is to compare the performance of traditional design optimization methods with deep learning-based inverse design methods by employing benchmark problems across various scenarios. Based on the findings of this study, we prov",
    "link": "http://arxiv.org/abs/2308.13000",
    "context": "Title: Performance Comparison of Design Optimization and Deep Learning-based Inverse Design. (arXiv:2308.13000v1 [math.OC])\nAbstract: Surrogate model-based optimization has been increasingly used in the field of engineering design. It involves creating a surrogate model with objective functions or constraints based on the data obtained from simulations or real-world experiments, and then finding the optimal solution from the model using numerical optimization methods. Recent advancements in deep learning-based inverse design methods have made it possible to generate real-time optimal solutions for engineering design problems, eliminating the requirement for iterative optimization processes. Nevertheless, no comprehensive study has yet closely examined the specific advantages and disadvantages of this novel approach compared to the traditional design optimization method. The objective of this paper is to compare the performance of traditional design optimization methods with deep learning-based inverse design methods by employing benchmark problems across various scenarios. Based on the findings of this study, we prov",
    "path": "papers/23/08/2308.13000.json",
    "total_tokens": 790,
    "translated_title": "设计优化和基于深度学习的逆向设计性能比较",
    "translated_abstract": "基于代理模型的优化方法在工程设计领域越来越广泛应用。它涉及使用仿真或实际实验数据创建基于目标函数或约束条件的代理模型，然后使用数值优化方法从模型中找到最优解。近年来，基于深度学习的逆向设计方法的进展使得实时生成工程设计问题的最优解成为可能，从而消除了迭代优化过程的要求。然而，迄今为止，还没有一项全面的研究仔细比较了这种新方法与传统设计优化方法之间的具体优缺点。本文的目的是通过采用各种情景的基准问题来比较传统设计优化方法和基于深度学习的逆向设计方法的性能。根据本研究的发现，我们证明了...",
    "tldr": "本文对比了传统设计优化方法与基于深度学习的逆向设计方法的性能，通过采用各种情景的基准问题来进行比较。根据研究结果，证明了..."
}