{
    "title": "Learning the solution operator of two-dimensional incompressible Navier-Stokes equations using physics-aware convolutional neural networks. (arXiv:2308.02137v1 [math.NA])",
    "abstract": "In recent years, the concept of introducing physics to machine learning has become widely popular. Most physics-inclusive ML-techniques however are still limited to a single geometry or a set of parametrizable geometries. Thus, there remains the need to train a new model for a new geometry, even if it is only slightly modified. With this work we introduce a technique with which it is possible to learn approximate solutions to the steady-state Navier--Stokes equations in varying geometries without the need of parametrization. This technique is based on a combination of a U-Net-like CNN and well established discretization methods from the field of the finite difference method.The results of our physics-aware CNN are compared to a state-of-the-art data-based approach. Additionally, it is also shown how our approach performs when combined with the data-based approach.",
    "link": "http://arxiv.org/abs/2308.02137",
    "context": "Title: Learning the solution operator of two-dimensional incompressible Navier-Stokes equations using physics-aware convolutional neural networks. (arXiv:2308.02137v1 [math.NA])\nAbstract: In recent years, the concept of introducing physics to machine learning has become widely popular. Most physics-inclusive ML-techniques however are still limited to a single geometry or a set of parametrizable geometries. Thus, there remains the need to train a new model for a new geometry, even if it is only slightly modified. With this work we introduce a technique with which it is possible to learn approximate solutions to the steady-state Navier--Stokes equations in varying geometries without the need of parametrization. This technique is based on a combination of a U-Net-like CNN and well established discretization methods from the field of the finite difference method.The results of our physics-aware CNN are compared to a state-of-the-art data-based approach. Additionally, it is also shown how our approach performs when combined with the data-based approach.",
    "path": "papers/23/08/2308.02137.json",
    "total_tokens": 859,
    "translated_title": "使用物理感知的卷积神经网络学习二维不可压缩Navier-Stokes方程的解算子",
    "translated_abstract": "近年来，将物理引入机器学习的概念变得广受欢迎。然而，大多数包含物理的机器学习技术仍然局限于单一几何形状或一组可参数化的几何形状。因此，即使仅略微修改，仍然需要针对新的几何形状训练新模型。我们的工作介绍了一种技术，可以在不需要参数化的情况下学习在不同几何形状中的稳态Navier-Stokes方程的近似解。这种技术基于U-Net-like CNN和来自有限差分方法领域的成熟离散化方法的组合。我们将物理感知的CNN的结果与最先进的基于数据的方法进行了比较。此外，还展示了我们的方法与基于数据的方法结合时的性能。",
    "tldr": "本论文提出了一种使用物理感知的卷积神经网络学习不同几何形状中稳态Navier-Stokes方程解的近似解的技术，无需参数化，在结果上与基于数据的方法进行了比较。",
    "en_tdlr": "This paper presents a technique that uses physics-aware convolutional neural networks to learn approximate solutions to the steady-state Navier-Stokes equations in varying geometries without the need of parametrization, and it is compared to a state-of-the-art data-based approach."
}