{
    "title": "Generating Modern Persian Carpet Map by Style-transfer. (arXiv:2308.04529v1 [cs.CV])",
    "abstract": "Today, the great performance of Deep Neural Networks(DNN) has been proven in various fields. One of its most attractive applications is to produce artistic designs. A carpet that is known as a piece of art is one of the most important items in a house, which has many enthusiasts all over the world. The first stage of producing a carpet is to prepare its map, which is a difficult, time-consuming, and expensive task. In this research work, our purpose is to use DNN for generating a Modern Persian Carpet Map. To reach this aim, three different DNN style transfer methods are proposed and compared against each other. In the proposed methods, the Style-Swap method is utilized to create the initial carpet map, and in the following, to generate more diverse designs, methods Clip-Styler, Gatys, and Style-Swap are used separately. In addition, some methods are examined and introduced for coloring the produced carpet maps. The designed maps are evaluated via the results of filled questionnaires w",
    "link": "http://arxiv.org/abs/2308.04529",
    "context": "Title: Generating Modern Persian Carpet Map by Style-transfer. (arXiv:2308.04529v1 [cs.CV])\nAbstract: Today, the great performance of Deep Neural Networks(DNN) has been proven in various fields. One of its most attractive applications is to produce artistic designs. A carpet that is known as a piece of art is one of the most important items in a house, which has many enthusiasts all over the world. The first stage of producing a carpet is to prepare its map, which is a difficult, time-consuming, and expensive task. In this research work, our purpose is to use DNN for generating a Modern Persian Carpet Map. To reach this aim, three different DNN style transfer methods are proposed and compared against each other. In the proposed methods, the Style-Swap method is utilized to create the initial carpet map, and in the following, to generate more diverse designs, methods Clip-Styler, Gatys, and Style-Swap are used separately. In addition, some methods are examined and introduced for coloring the produced carpet maps. The designed maps are evaluated via the results of filled questionnaires w",
    "path": "papers/23/08/2308.04529.json",
    "total_tokens": 959,
    "translated_title": "通过风格迁移生成现代波斯地毯地图",
    "translated_abstract": "如今，深度神经网络(DNN)在各个领域中都展现出了出色的性能。其中最有吸引力的应用之一是生成艺术设计。作为一种被认为是艺术品的地毯是房子中最重要的物品之一，拥有全球各地的众多爱好者。生成地毯的第一步是准备它的地图，这是一项困难、耗时且昂贵的任务。在这项研究中，我们的目的是使用DNN来生成现代波斯地毯地图。为了实现这个目标，提出并比较了三种不同的DNN风格迁移方法。在提出的方法中，使用Style-Swap方法创建初始地毯地图，并在接下来使用Clip-Styler、Gatys和Style-Swap方法分别生成更多样化的设计。此外，还对一些着色方法进行了研究和介绍，以给生成的地毯地图上色。通过填写问卷的结果来评估设计的地图。",
    "tldr": "本研究旨在利用深度神经网络(DNN)生成现代波斯地毯地图，并提出了三种不同的DNN风格迁移方法。通过使用Style-Swap方法创建初始地图，并使用Clip-Styler、Gatys和Style-Swap方法生成更多样化的设计，同时还考虑了对地图进行着色的方法。",
    "en_tdlr": "This research aims to generate Modern Persian Carpet Maps using Deep Neural Networks (DNN) and proposes three different DNN style transfer methods. The initial map is created using the Style-Swap method, and diversity in designs is achieved by using the Clip-Styler, Gatys, and Style-Swap methods. Different coloring methods for the maps are also explored."
}