{
    "title": "Group-Conditional Conformal Prediction via Quantile Regression Calibration for Crop and Weed Classification. (arXiv:2308.15094v1 [cs.CV])",
    "abstract": "As deep learning predictive models become an integral part of a large spectrum of precision agricultural systems, a barrier to the adoption of such automated solutions is the lack of user trust in these highly complex, opaque and uncertain models. Indeed, deep neural networks are not equipped with any explicit guarantees that can be used to certify the system's performance, especially in highly varying uncontrolled environments such as the ones typically faced in computer vision for agriculture.Fortunately, certain methods developed in other communities can prove to be important for agricultural applications. This article presents the conformal prediction framework that provides valid statistical guarantees on the predictive performance of any black box prediction machine, with almost no assumptions, applied to the problem of deep visual classification of weeds and crops in real-world conditions. The framework is exposed with a focus on its practical aspects and special attention accor",
    "link": "http://arxiv.org/abs/2308.15094",
    "context": "Title: Group-Conditional Conformal Prediction via Quantile Regression Calibration for Crop and Weed Classification. (arXiv:2308.15094v1 [cs.CV])\nAbstract: As deep learning predictive models become an integral part of a large spectrum of precision agricultural systems, a barrier to the adoption of such automated solutions is the lack of user trust in these highly complex, opaque and uncertain models. Indeed, deep neural networks are not equipped with any explicit guarantees that can be used to certify the system's performance, especially in highly varying uncontrolled environments such as the ones typically faced in computer vision for agriculture.Fortunately, certain methods developed in other communities can prove to be important for agricultural applications. This article presents the conformal prediction framework that provides valid statistical guarantees on the predictive performance of any black box prediction machine, with almost no assumptions, applied to the problem of deep visual classification of weeds and crops in real-world conditions. The framework is exposed with a focus on its practical aspects and special attention accor",
    "path": "papers/23/08/2308.15094.json",
    "total_tokens": 891,
    "translated_title": "通过分位数回归校准实现基于群体条件的符合预测，用于作物与杂草分类",
    "translated_abstract": "随着深度学习预测模型成为精准农业系统中不可或缺的一部分，一个阻碍采用这些自动化解决方案的障碍是用户对这些高度复杂、不透明和不确定的模型缺乏信任。实际上，深度神经网络没有任何明确的保证，可以用来证明系统的性能，在高度变化的以及无法控制的环境中，比如典型的农业计算机视觉中所面临的环境。幸运的是，其他领域开发的某些方法对农业应用非常重要。本文提出了符合预测框架，该框架对任何黑盒子预测机器的预测性能提供有效的统计保证，几乎不需要任何假设，应用于实际条件下的深度可视化杂草和作物分类问题。本文重点介绍了框架的实际方面，并特别注意了细节。",
    "tldr": "通过分位数回归校准实现基于群体条件的符合预测框架，解决了深度学习预测模型的不确定性问题，并应用于实际农业计算机视觉中的作物与杂草分类问题。",
    "en_tdlr": "A group-conditional conformal prediction framework based on quantile regression calibration is presented to address the uncertainty issue of deep learning predictive models, and applied to the classification of crops and weeds in computer vision for agriculture."
}