{
    "title": "Virtual histological staining of unlabeled autopsy tissue. (arXiv:2308.00920v1 [physics.med-ph])",
    "abstract": "Histological examination is a crucial step in an autopsy; however, the traditional histochemical staining of post-mortem samples faces multiple challenges, including the inferior staining quality due to autolysis caused by delayed fixation of cadaver tissue, as well as the resource-intensive nature of chemical staining procedures covering large tissue areas, which demand substantial labor, cost, and time. These challenges can become more pronounced during global health crises when the availability of histopathology services is limited, resulting in further delays in tissue fixation and more severe staining artifacts. Here, we report the first demonstration of virtual staining of autopsy tissue and show that a trained neural network can rapidly transform autofluorescence images of label-free autopsy tissue sections into brightfield equivalent images that match hematoxylin and eosin (H&E) stained versions of the same samples, eliminating autolysis-induced severe staining artifacts inhere",
    "link": "http://arxiv.org/abs/2308.00920",
    "context": "Title: Virtual histological staining of unlabeled autopsy tissue. (arXiv:2308.00920v1 [physics.med-ph])\nAbstract: Histological examination is a crucial step in an autopsy; however, the traditional histochemical staining of post-mortem samples faces multiple challenges, including the inferior staining quality due to autolysis caused by delayed fixation of cadaver tissue, as well as the resource-intensive nature of chemical staining procedures covering large tissue areas, which demand substantial labor, cost, and time. These challenges can become more pronounced during global health crises when the availability of histopathology services is limited, resulting in further delays in tissue fixation and more severe staining artifacts. Here, we report the first demonstration of virtual staining of autopsy tissue and show that a trained neural network can rapidly transform autofluorescence images of label-free autopsy tissue sections into brightfield equivalent images that match hematoxylin and eosin (H&E) stained versions of the same samples, eliminating autolysis-induced severe staining artifacts inhere",
    "path": "papers/23/08/2308.00920.json",
    "total_tokens": 929,
    "translated_title": "未标记尸体解剖组织的虚拟组织学染色",
    "translated_abstract": "组织学检查是尸体解剖的关键步骤，然而，传统的组织化学染色方法面临多个挑战，包括因尸体组织延迟固定引起的自溶所致染色质量较差，以及覆盖大面积组织所需的化学染色程序资源密集型，需要大量的人力、成本和时间。在全球卫生危机中，组织病理学服务的可用性有限，这些挑战可能会更加明显，导致组织固定的进一步延迟和更严重的染色伪影。在这里，我们首次展示了对尸体解剖组织的虚拟染色，并表明训练有素的神经网络能够快速将无标记尸体解剖组织切片的自荧光图像转换为与同一样本的血红素和嗪染色（H＆E）相匹配的亮场等效图像，从而消除了自溶导致的严重染色伪影。",
    "tldr": "该研究展示了针对未标记尸体解剖组织进行虚拟染色的方法，通过训练神经网络可以将自荧光图像转换为与传统染色样本相匹配的亮场图像，去除了自溶引起的严重染色伪影。",
    "en_tdlr": "This study demonstrates a method for virtual staining of unlabeled autopsy tissue, where a trained neural network can transform autofluorescence images into brightfield equivalent images, matching conventional stained samples and eliminating severe staining artifacts caused by autolysis."
}