{
    "title": "A distributed neural network architecture for dynamic sensor selection with application to bandwidth-constrained body-sensor networks. (arXiv:2308.08379v1 [cs.LG])",
    "abstract": "We propose a dynamic sensor selection approach for deep neural networks (DNNs), which is able to derive an optimal sensor subset selection for each specific input sample instead of a fixed selection for the entire dataset. This dynamic selection is jointly learned with the task model in an end-to-end way, using the Gumbel-Softmax trick to allow the discrete decisions to be learned through standard backpropagation. We then show how we can use this dynamic selection to increase the lifetime of a wireless sensor network (WSN) by imposing constraints on how often each node is allowed to transmit. We further improve performance by including a dynamic spatial filter that makes the task-DNN more robust against the fact that it now needs to be able to handle a multitude of possible node subsets. Finally, we explain how the selection of the optimal channels can be distributed across the different nodes in a WSN. We validate this method on a use case in the context of body-sensor networks, where",
    "link": "http://arxiv.org/abs/2308.08379",
    "context": "Title: A distributed neural network architecture for dynamic sensor selection with application to bandwidth-constrained body-sensor networks. (arXiv:2308.08379v1 [cs.LG])\nAbstract: We propose a dynamic sensor selection approach for deep neural networks (DNNs), which is able to derive an optimal sensor subset selection for each specific input sample instead of a fixed selection for the entire dataset. This dynamic selection is jointly learned with the task model in an end-to-end way, using the Gumbel-Softmax trick to allow the discrete decisions to be learned through standard backpropagation. We then show how we can use this dynamic selection to increase the lifetime of a wireless sensor network (WSN) by imposing constraints on how often each node is allowed to transmit. We further improve performance by including a dynamic spatial filter that makes the task-DNN more robust against the fact that it now needs to be able to handle a multitude of possible node subsets. Finally, we explain how the selection of the optimal channels can be distributed across the different nodes in a WSN. We validate this method on a use case in the context of body-sensor networks, where",
    "path": "papers/23/08/2308.08379.json",
    "total_tokens": 915,
    "translated_title": "一种用于动态传感器选择的分布式神经网络架构，适用于带宽受限的身体传感器网络。",
    "translated_abstract": "我们提出了一种用于深度神经网络（DNN）的动态传感器选择方法，能够针对每个特定输入样本推导出最佳的传感器子集选择，而不是整个数据集的固定选择。这种动态选择与任务模型一起在端到端的方式中联合学习，使用Gumbel-Softmax技巧通过标准反向传播来学习离散决策。然后我们展示了如何利用这种动态选择通过限制每个节点的传输频率来增加无线传感器网络（WSN）的寿命。我们进一步通过包括动态空间滤波器来提高性能，使任务-DNN对于现在需要处理的多种可能节点子集更具鲁棒性。最后，我们解释了如何将最佳通道的选择分布到WSN中的不同节点上。我们在身体传感器网络的一个使用案例中验证了这种方法。",
    "tldr": "提出了一种用于神经网络的动态传感器选择方法，并结合使用Gumbel-Softmax技巧通过标准反向传播来学习离散决策。该方法可以增加无线传感器网络的寿命，并提高任务-DNN处理多种可能节点子集的能力。",
    "en_tdlr": "A dynamic sensor selection approach for deep neural networks is proposed, which utilizes the Gumbel-Softmax trick and allows for learning discrete decisions through standard backpropagation. This method increases the lifetime of wireless sensor networks and improves the capability of task-DNN in handling multiple potential node subsets."
}