{
    "title": "A Bibliographic Study on Artificial Intelligence Research: Global Panorama and Indian Appearance. (arXiv:2308.00705v1 [cs.DL])",
    "abstract": "The present study identifies and assesses the bibliographic trend in Artificial Intelligence (AI) research for the years 2015-2020 using the science mapping method of bibliometric study. The required data has been collected from the Scopus database. To make the collected data analysis-ready, essential data transformation was performed manually and with the help of a tool viz. OpenRefine. For determining the trend and performing the mapping techniques, top five open access and commercial journals of AI have been chosen based on their citescore driven ranking. The work includes 6880 articles published in the specified period for analysis. The trend is based on Country-wise publications, year-wise publications, topical terms in AI, top-cited articles, prominent authors, major institutions, involvement of industries in AI and Indian appearance. The results show that compared to open access journals; commercial journals have a higher citescore and number of articles published over the years",
    "link": "http://arxiv.org/abs/2308.00705",
    "context": "Title: A Bibliographic Study on Artificial Intelligence Research: Global Panorama and Indian Appearance. (arXiv:2308.00705v1 [cs.DL])\nAbstract: The present study identifies and assesses the bibliographic trend in Artificial Intelligence (AI) research for the years 2015-2020 using the science mapping method of bibliometric study. The required data has been collected from the Scopus database. To make the collected data analysis-ready, essential data transformation was performed manually and with the help of a tool viz. OpenRefine. For determining the trend and performing the mapping techniques, top five open access and commercial journals of AI have been chosen based on their citescore driven ranking. The work includes 6880 articles published in the specified period for analysis. The trend is based on Country-wise publications, year-wise publications, topical terms in AI, top-cited articles, prominent authors, major institutions, involvement of industries in AI and Indian appearance. The results show that compared to open access journals; commercial journals have a higher citescore and number of articles published over the years",
    "path": "papers/23/08/2308.00705.json",
    "total_tokens": 939,
    "translated_title": "人工智能研究的文献研究：全球概况与印度的出现",
    "translated_abstract": "本研究使用文献计量学的科学映射方法，识别和评估了2015-2020年间人工智能研究的文献趋势。所需数据来自Scopus数据库。通过手动和使用OpenRefine工具进行必要的数据转换，使得收集到的数据可以进行分析。为了确定趋势和进行映射技术，根据其引用分数驱动的排名，选择了人工智能领域的五个开放获取和商业期刊。该研究分析了该期间发表的6880篇文章。趋势包括各国的出版物，年度出版物，人工智能领域的主题词，被引用次数最多的文章，重要作者，主要机构，工业界对人工智能的参与以及印度的出现。结果显示，与开放获取期刊相比，商业期刊在多年的引用分数和发表文章数量上较高。",
    "tldr": "本研究使用文献计量学方法分析了2015-2020年间人工智能研究的文献趋势，发现商业期刊在引用分数和发表数量上表现更好，同时还研究了各国的出版情况和印度在人工智能研究中的重要性。"
}