{
    "title": "Towards Semi-supervised Learning with Non-random Missing Labels. (arXiv:2308.08872v1 [cs.LG])",
    "abstract": "Semi-supervised learning (SSL) tackles the label missing problem by enabling the effective usage of unlabeled data. While existing SSL methods focus on the traditional setting, a practical and challenging scenario called label Missing Not At Random (MNAR) is usually ignored. In MNAR, the labeled and unlabeled data fall into different class distributions resulting in biased label imputation, which deteriorates the performance of SSL models. In this work, class transition tracking based Pseudo-Rectifying Guidance (PRG) is devised for MNAR. We explore the class-level guidance information obtained by the Markov random walk, which is modeled on a dynamically created graph built over the class tracking matrix. PRG unifies the historical information of class distribution and class transitions caused by the pseudo-rectifying procedure to maintain the model's unbiased enthusiasm towards assigning pseudo-labels to all classes, so as the quality of pseudo-labels on both popular classes and rare c",
    "link": "http://arxiv.org/abs/2308.08872",
    "context": "Title: Towards Semi-supervised Learning with Non-random Missing Labels. (arXiv:2308.08872v1 [cs.LG])\nAbstract: Semi-supervised learning (SSL) tackles the label missing problem by enabling the effective usage of unlabeled data. While existing SSL methods focus on the traditional setting, a practical and challenging scenario called label Missing Not At Random (MNAR) is usually ignored. In MNAR, the labeled and unlabeled data fall into different class distributions resulting in biased label imputation, which deteriorates the performance of SSL models. In this work, class transition tracking based Pseudo-Rectifying Guidance (PRG) is devised for MNAR. We explore the class-level guidance information obtained by the Markov random walk, which is modeled on a dynamically created graph built over the class tracking matrix. PRG unifies the historical information of class distribution and class transitions caused by the pseudo-rectifying procedure to maintain the model's unbiased enthusiasm towards assigning pseudo-labels to all classes, so as the quality of pseudo-labels on both popular classes and rare c",
    "path": "papers/23/08/2308.08872.json",
    "total_tokens": 930,
    "translated_title": "面向非随机缺失标签的半监督学习",
    "translated_abstract": "半监督学习（SSL）通过有效利用无标签数据来解决标签缺失问题。现有的SSL方法主要关注传统的情景，忽略了一个实际且具有挑战性的场景，即标签缺失非随机（MNAR）。在MNAR中，有标签和无标签数据属于不同的类别分布，导致了有偏的标签插补，降低了SSL模型的性能。本文提出了基于类别转换跟踪的伪修正指导（PRG）方法来处理MNAR问题。我们通过基于马尔可夫随机游走的方式得到类别级别的引导信息，该信息基于动态创建的图在类别跟踪矩阵之上建模。PRG方法通过将类别分布的历史信息和伪修正过程引起的类别转换统一起来，以保持模型对所有类别分配伪标签的无偏热情，从而提高伪标签在常见类别和罕见类别上的质量。",
    "tldr": "本研究针对标签缺失非随机（MNAR）问题，提出了一种基于类别转换跟踪的伪修正指导（PRG）方法，通过利用历史信息和动态创建的图模型，来改善半监督学习（SSL）中的标签缺失问题。",
    "en_tdlr": "This paper introduces a Pseudo-Rectifying Guidance (PRG) method based on class transition tracking to address the issue of label Missing Not At Random (MNAR) in semi-supervised learning (SSL), which utilizes historical information and a dynamically created graph model to improve the problem of label missing in SSL."
}