{
    "title": "PePNet: A Periodicity-Perceived Workload Prediction Network Supporting Rare Occurrence of Heavy Workload. (arXiv:2308.01917v1 [cs.DC])",
    "abstract": "Cloud providers can greatly benefit from accurate workload prediction. However, the workload of cloud servers is highly variable, with occasional heavy workload bursts. This makes workload prediction challenging.  There are mainly two categories of workload prediction methods: statistical methods and neural-network-based ones. The former ones rely on strong mathematical assumptions and have reported low accuracy when predicting highly variable workload. The latter ones offer higher overall accuracy, yet they are vulnerable to data imbalance between heavy workload and common one. This impairs the prediction accuracy of neural network-based models on heavy workload.  Either the overall inaccuracy of statistic methods or the heavy-workload inaccuracy of neural-network-based models can cause service level agreement violations.  Thus, we propose PePNet to improve overall especially heavy workload prediction accuracy. It has two distinctive characteristics:  (i) A Periodicity-Perceived Mecha",
    "link": "http://arxiv.org/abs/2308.01917",
    "context": "Title: PePNet: A Periodicity-Perceived Workload Prediction Network Supporting Rare Occurrence of Heavy Workload. (arXiv:2308.01917v1 [cs.DC])\nAbstract: Cloud providers can greatly benefit from accurate workload prediction. However, the workload of cloud servers is highly variable, with occasional heavy workload bursts. This makes workload prediction challenging.  There are mainly two categories of workload prediction methods: statistical methods and neural-network-based ones. The former ones rely on strong mathematical assumptions and have reported low accuracy when predicting highly variable workload. The latter ones offer higher overall accuracy, yet they are vulnerable to data imbalance between heavy workload and common one. This impairs the prediction accuracy of neural network-based models on heavy workload.  Either the overall inaccuracy of statistic methods or the heavy-workload inaccuracy of neural-network-based models can cause service level agreement violations.  Thus, we propose PePNet to improve overall especially heavy workload prediction accuracy. It has two distinctive characteristics:  (i) A Periodicity-Perceived Mecha",
    "path": "papers/23/08/2308.01917.json",
    "total_tokens": 927,
    "translated_title": "PePNet: 一种支持罕见重负载的周期性感知工作负载预测网络",
    "translated_abstract": "云提供商可以从准确的工作负载预测中获得巨大的好处。然而，云服务器的工作负载高度变化，有时会发生重负载突发事件，这使得工作负载预测具有挑战性。目前有两种主要的工作负载预测方法：统计方法和基于神经网络的方法。前者依赖于强大的数学假设，当预测高度变化的工作负载时，其准确性较低。而后者在整体准确性上更高，但容易受到重负载和常见负载之间数据不平衡的影响，这会影响神经网络模型对重负载的预测准确性。无论是统计方法的整体不准确性还是基于神经网络的模型对重负载的不准确性都会导致服务级别协议的违规。因此，我们提出了PePNet来提高整体特别是重负载预测的准确性。它具有两个独特的特点：周期性感知机制和融合多尺度序列学习的能力。",
    "tldr": "PePNet是一种支持罕见重负载的工作负载预测网络，通过周期性感知机制和融合多尺度序列学习的能力提高了整体特别是重负载的准确性。"
}