{
    "title": "Multicriteria Optimization Techniques for Understanding the Case Mix Landscape of a Hospital. (arXiv:2308.07322v1 [cs.AI])",
    "abstract": "Various medical and surgical units operate in a typical hospital and to treat their patients these units compete for infrastructure like operating rooms (OR) and ward beds. How that competition is regulated affects the capacity and output of a hospital. This article considers the impact of treating different patient case mix (PCM) in a hospital. As each case mix has an economic consequence and a unique profile of hospital resource usage, this consideration is important. To better understand the case mix landscape and to identify those which are optimal from a capacity utilisation perspective, an improved multicriteria optimization (MCO) approach is proposed. As there are many patient types in a typical hospital, the task of generating an archive of non-dominated (i.e., Pareto optimal) case mix is computationally challenging. To generate a better archive, an improved parallelised epsilon constraint method (ECM) is introduced. Our parallel random corrective approach is significantly fast",
    "link": "http://arxiv.org/abs/2308.07322",
    "context": "Title: Multicriteria Optimization Techniques for Understanding the Case Mix Landscape of a Hospital. (arXiv:2308.07322v1 [cs.AI])\nAbstract: Various medical and surgical units operate in a typical hospital and to treat their patients these units compete for infrastructure like operating rooms (OR) and ward beds. How that competition is regulated affects the capacity and output of a hospital. This article considers the impact of treating different patient case mix (PCM) in a hospital. As each case mix has an economic consequence and a unique profile of hospital resource usage, this consideration is important. To better understand the case mix landscape and to identify those which are optimal from a capacity utilisation perspective, an improved multicriteria optimization (MCO) approach is proposed. As there are many patient types in a typical hospital, the task of generating an archive of non-dominated (i.e., Pareto optimal) case mix is computationally challenging. To generate a better archive, an improved parallelised epsilon constraint method (ECM) is introduced. Our parallel random corrective approach is significantly fast",
    "path": "papers/23/08/2308.07322.json",
    "total_tokens": 840,
    "translated_title": "医院病例组成的多准则优化技术",
    "translated_abstract": "一个典型医院内有各种医疗和手术单位，为了治疗患者，这些单位竞争手术室和病房资源。如何管控这种竞争对医院的能力和产出有着重要影响。本文考虑了在医院中治疗不同病例组成的影响。由于每种病例组成都有经济后果和独特的医院资源使用特征，因此这一考虑非常重要。为了更好地理解病例组成的情况，并从容量利用角度确定最优的病例组成，提出了一种改进的多准则优化方法。在典型医院中有很多病患类型，生成一组非支配（即帕累托最优）病例组成的存档是一项具有计算挑战性的任务。为了生成更好的存档，引入了一种改进的并行化ε约束方法 (ECM)。我们的并行随机修正方法速度显著加快。",
    "tldr": "本文提出了一种多准则优化方法来理解医院的病例组成，通过改进的并行化方法生成非支配病例组成存档，以提高容量利用率。"
}