{
    "title": "TFDNet: Time-Frequency Enhanced Decomposed Network for Long-term Time Series Forecasting. (arXiv:2308.13386v1 [cs.LG])",
    "abstract": "Long-term time series forecasting is a vital task and has a wide range of real applications. Recent methods focus on capturing the underlying patterns from one single domain (e.g. the time domain or the frequency domain), and have not taken a holistic view to process long-term time series from the time-frequency domains. In this paper, we propose a Time-Frequency Enhanced Decomposed Network (TFDNet) to capture both the long-term underlying patterns and temporal periodicity from the time-frequency domain. In TFDNet, we devise a multi-scale time-frequency enhanced encoder backbone and develop two separate trend and seasonal time-frequency blocks to capture the distinct patterns within the decomposed trend and seasonal components in multi-resolutions. Diverse kernel learning strategies of the kernel operations in time-frequency blocks have been explored, by investigating and incorporating the potential different channel-wise correlation patterns of multivariate time series. Experimental e",
    "link": "http://arxiv.org/abs/2308.13386",
    "context": "Title: TFDNet: Time-Frequency Enhanced Decomposed Network for Long-term Time Series Forecasting. (arXiv:2308.13386v1 [cs.LG])\nAbstract: Long-term time series forecasting is a vital task and has a wide range of real applications. Recent methods focus on capturing the underlying patterns from one single domain (e.g. the time domain or the frequency domain), and have not taken a holistic view to process long-term time series from the time-frequency domains. In this paper, we propose a Time-Frequency Enhanced Decomposed Network (TFDNet) to capture both the long-term underlying patterns and temporal periodicity from the time-frequency domain. In TFDNet, we devise a multi-scale time-frequency enhanced encoder backbone and develop two separate trend and seasonal time-frequency blocks to capture the distinct patterns within the decomposed trend and seasonal components in multi-resolutions. Diverse kernel learning strategies of the kernel operations in time-frequency blocks have been explored, by investigating and incorporating the potential different channel-wise correlation patterns of multivariate time series. Experimental e",
    "path": "papers/23/08/2308.13386.json",
    "total_tokens": 819,
    "translated_title": "TFDNet：增强时频分解网络用于长期时间序列预测",
    "translated_abstract": "长期时间序列预测是一项重要任务，并且具有广泛的实际应用。最近的方法专注于捕获来自单一域（例如时间域或频率域）的基本模式，并且没有从时频域综合处理长期时间序列。在本文中，我们提出了一种称为时频增强分解网络（TFDNet）的方法，可以在时频域捕获长期的基本模式和时间周期性。在TFDNet中，我们设计了一个多尺度时频增强编码器主干，并开发两个分别用于捕获多分辨率中分解趋势和季节分量中的不同模式的趋势和季节时频块。通过研究和整合多变量时间序列的潜在不同通道相关模式，我们探索了时频块中核操作的多样化内核学习策略。",
    "tldr": "这篇论文提出了一种称为TFDNet的时频增强分解网络，用于从时频域捕获长期时间序列的基本模式和时间周期性。",
    "en_tdlr": "This paper proposes a Time-Frequency Enhanced Decomposed Network (TFDNet) for capturing the underlying patterns and temporal periodicity of long-term time series from the time-frequency domain."
}