{
    "title": "Donut Regression Discontinuity Designs. (arXiv:2308.14464v1 [econ.EM])",
    "abstract": "We study the econometric properties of so-called donut regression discontinuity (RD) designs, a robustness exercise which involves repeating estimation and inference without the data points in some area around the treatment threshold. This approach is often motivated by concerns that possible systematic sorting of units, or similar data issues, in some neighborhood of the treatment threshold might distort estimation and inference of RD treatment effects. We show that donut RD estimators can have substantially larger bias and variance than contentional RD estimators, and that the corresponding confidence intervals can be substantially longer. We also provide a formal testing framework for comparing donut and conventional RD estimation results.",
    "link": "http://arxiv.org/abs/2308.14464",
    "context": "Title: Donut Regression Discontinuity Designs. (arXiv:2308.14464v1 [econ.EM])\nAbstract: We study the econometric properties of so-called donut regression discontinuity (RD) designs, a robustness exercise which involves repeating estimation and inference without the data points in some area around the treatment threshold. This approach is often motivated by concerns that possible systematic sorting of units, or similar data issues, in some neighborhood of the treatment threshold might distort estimation and inference of RD treatment effects. We show that donut RD estimators can have substantially larger bias and variance than contentional RD estimators, and that the corresponding confidence intervals can be substantially longer. We also provide a formal testing framework for comparing donut and conventional RD estimation results.",
    "path": "papers/23/08/2308.14464.json",
    "total_tokens": 828,
    "translated_title": "甜甜圈回归不连续设计",
    "translated_abstract": "我们研究了所谓的甜甜圈回归不连续设计的计量性质，这是一种鲁棒性练习，它涉及在某一治疗阈值周围的某些数据点不重复估计和推断。这种方法常常是出于担心治疗阈值附近可能存在的单位的系统性分拣或类似数据问题可能扭曲回归不连续治疗效应的估计和推断。我们发现甜甜圈回归不连续估计器的偏差和方差可能比传统回归不连续估计器要大得多，并且对应的置信区间可能要长得多。我们还提供了一个形式化的测试框架来比较甜甜圈和传统回归不连续估计的结果。",
    "tldr": "本文研究了甜甜圈回归不连续设计的计量性质，并发现甜甜圈回归不连续估计器的偏差和方差可能比传统回归不连续估计器要大得多。此外，我们还提供了一个比较甜甜圈和传统回归不连续估计结果的形式化测试框架。",
    "en_tdlr": "This paper examines the econometric properties of donut regression discontinuity designs and finds that the donut RD estimators can have significantly larger bias and variance than conventional RD estimators. Additionally, a formal testing framework is provided for comparing the results of donut and conventional RD estimation."
}