{
    "title": "UniRecSys: A Unified Framework for Personalized, Group, Package, and Package-to-Group Recommendations. (arXiv:2308.04247v1 [cs.IR])",
    "abstract": "Recommender systems aim to enhance the overall user experience by providing tailored recommendations for a variety of products and services. These systems help users make more informed decisions, leading to greater user satisfaction with the platform. However, the implementation of these systems largely depends on the context, which can vary from recommending an item or package to a user or a group. This requires careful exploration of several models during the deployment, as there is no comprehensive and unified approach that deals with recommendations at different levels. Furthermore, these individual models must be closely attuned to their generated recommendations depending on the context to prevent significant variation in their generated recommendations. In this paper, we propose a novel unified recommendation framework that addresses all four recommendation tasks, namely personalized, group, package, or package-to-group recommendation, filling the gap in the current research lan",
    "link": "http://arxiv.org/abs/2308.04247",
    "context": "Title: UniRecSys: A Unified Framework for Personalized, Group, Package, and Package-to-Group Recommendations. (arXiv:2308.04247v1 [cs.IR])\nAbstract: Recommender systems aim to enhance the overall user experience by providing tailored recommendations for a variety of products and services. These systems help users make more informed decisions, leading to greater user satisfaction with the platform. However, the implementation of these systems largely depends on the context, which can vary from recommending an item or package to a user or a group. This requires careful exploration of several models during the deployment, as there is no comprehensive and unified approach that deals with recommendations at different levels. Furthermore, these individual models must be closely attuned to their generated recommendations depending on the context to prevent significant variation in their generated recommendations. In this paper, we propose a novel unified recommendation framework that addresses all four recommendation tasks, namely personalized, group, package, or package-to-group recommendation, filling the gap in the current research lan",
    "path": "papers/23/08/2308.04247.json",
    "total_tokens": 828,
    "translated_title": "统一推荐系统：个性化、群组、套餐和套餐到群组的推荐的统一框架",
    "translated_abstract": "推荐系统旨在通过为各种产品和服务提供定制推荐来提高用户体验。这些系统帮助用户做出更明智的决策，提高用户对平台的满意度。然而，这些系统的实施在很大程度上取决于上下文，从向用户或群组推荐项目或套餐中都有所不同。这就需要在部署过程中仔细探索多个模型，因为目前没有一个统一的方法来处理不同层面的推荐。此外，这些个体模型必须根据上下文密切调整其生成的推荐结果，以防止其生成的推荐结果产生显著差异。在本文中，我们提出了一种新颖的统一推荐框架，解决了个性化、群组、套餐或套餐到群组推荐四个任务，填补了当前研究中的空白部分。",
    "tldr": "这篇论文提出了一个新的统一推荐框架，可以处理个性化、群组、套餐和套餐到群组推荐这四种任务，填补了当前研究的空白部分。"
}