{
    "title": "A tailored Handwritten-Text-Recognition System for Medieval Latin. (arXiv:2308.09368v1 [cs.CV])",
    "abstract": "The Bavarian Academy of Sciences and Humanities aims to digitize its Medieval Latin Dictionary. This dictionary entails record cards referring to lemmas in medieval Latin, a low-resource language. A crucial step of the digitization process is the Handwritten Text Recognition (HTR) of the handwritten lemmas found on these record cards. In our work, we introduce an end-to-end pipeline, tailored to the medieval Latin dictionary, for locating, extracting, and transcribing the lemmas. We employ two state-of-the-art (SOTA) image segmentation models to prepare the initial data set for the HTR task. Furthermore, we experiment with different transformer-based models and conduct a set of experiments to explore the capabilities of different combinations of vision encoders with a GPT-2 decoder. Additionally, we also apply extensive data augmentation resulting in a highly competitive model. The best-performing setup achieved a Character Error Rate (CER) of 0.015, which is even superior to the comme",
    "link": "http://arxiv.org/abs/2308.09368",
    "context": "Title: A tailored Handwritten-Text-Recognition System for Medieval Latin. (arXiv:2308.09368v1 [cs.CV])\nAbstract: The Bavarian Academy of Sciences and Humanities aims to digitize its Medieval Latin Dictionary. This dictionary entails record cards referring to lemmas in medieval Latin, a low-resource language. A crucial step of the digitization process is the Handwritten Text Recognition (HTR) of the handwritten lemmas found on these record cards. In our work, we introduce an end-to-end pipeline, tailored to the medieval Latin dictionary, for locating, extracting, and transcribing the lemmas. We employ two state-of-the-art (SOTA) image segmentation models to prepare the initial data set for the HTR task. Furthermore, we experiment with different transformer-based models and conduct a set of experiments to explore the capabilities of different combinations of vision encoders with a GPT-2 decoder. Additionally, we also apply extensive data augmentation resulting in a highly competitive model. The best-performing setup achieved a Character Error Rate (CER) of 0.015, which is even superior to the comme",
    "path": "papers/23/08/2308.09368.json",
    "total_tokens": 972,
    "translated_title": "针对中世纪拉丁语的定制手写文本识别系统",
    "translated_abstract": "巴伐利亚科学和人文学院旨在数字化其中世纪拉丁语词典。该词典包含了涉及中世纪拉丁语引文的记录卡片, 这是一种低资源语言。数字化过程的关键步骤是识别这些记录卡片上手写的引文的手写文本识别（HTR）。我们引入了一个端到端的流水线，专门针对中世纪拉丁语词典进行定制，用于定位、提取和转录引文。我们采用了两个最先进的图像分割模型来准备HTR任务的初始数据集。此外，我们尝试了不同的基于Transformer的模型，并进行了一系列实验，探索了不同组合的视觉编码器和GPT-2解码器的能力。此外，我们还应用了大量的数据增强，得到了一个竞争力极高的模型。最佳表现的配置实现了0.015的字符错误率（CER），甚至优于现有公认的技术。",
    "tldr": "这个论文提出了一个针对中世纪拉丁语词典的定制手写文本识别系统，通过引入端到端的流水线和最新的图像分割模型，成功地定位、提取和转录引文，并且通过使用Transformer模型和数据增强等方法，实现了优于现有技术的字符错误率。",
    "en_tdlr": "This paper presents a tailored Handwritten Text Recognition (HTR) system for Medieval Latin dictionary, which achieves successful locating, extracting, and transcribing of handwritten lemmas by employing an end-to-end pipeline and state-of-the-art image segmentation models. Through the use of Transformer models and extensive data augmentation, the system achieves a superior Character Error Rate (CER) compared to existing technologies."
}