{
    "title": "Video Captioning with Aggregated Features Based on Dual Graphs and Gated Fusion. (arXiv:2308.06685v1 [cs.CV])",
    "abstract": "The application of video captioning models aims at translating the content of videos by using accurate natural language. Due to the complex nature inbetween object interaction in the video, the comprehensive understanding of spatio-temporal relations of objects remains a challenging task. Existing methods often fail in generating sufficient feature representations of video content. In this paper, we propose a video captioning model based on dual graphs and gated fusion: we adapt two types of graphs to generate feature representations of video content and utilize gated fusion to further understand these different levels of information. Using a dual-graphs model to generate appearance features and motion features respectively can utilize the content correlation in frames to generate various features from multiple perspectives. Among them, dual-graphs reasoning can enhance the content correlation in frame sequences to generate advanced semantic features; The gated fusion, on the other han",
    "link": "http://arxiv.org/abs/2308.06685",
    "context": "Title: Video Captioning with Aggregated Features Based on Dual Graphs and Gated Fusion. (arXiv:2308.06685v1 [cs.CV])\nAbstract: The application of video captioning models aims at translating the content of videos by using accurate natural language. Due to the complex nature inbetween object interaction in the video, the comprehensive understanding of spatio-temporal relations of objects remains a challenging task. Existing methods often fail in generating sufficient feature representations of video content. In this paper, we propose a video captioning model based on dual graphs and gated fusion: we adapt two types of graphs to generate feature representations of video content and utilize gated fusion to further understand these different levels of information. Using a dual-graphs model to generate appearance features and motion features respectively can utilize the content correlation in frames to generate various features from multiple perspectives. Among them, dual-graphs reasoning can enhance the content correlation in frame sequences to generate advanced semantic features; The gated fusion, on the other han",
    "path": "papers/23/08/2308.06685.json",
    "total_tokens": 846,
    "translated_title": "基于双图和门控融合的聚合特征视频字幕生成",
    "translated_abstract": "视频字幕生成模型旨在通过准确的自然语言翻译视频内容。由于视频中对象之间的复杂相互作用，对象的时空关系的全面理解仍然是一个具有挑战性的任务。现有方法往往在生成足够的视频内容特征表示方面存在缺陷。在本文中，我们提出了一种基于双图和门控融合的视频字幕生成模型：我们适应了两种类型的图来生成视频内容的特征表示，并利用门控融合来进一步理解这些不同层次的信息。使用双图模型分别生成外观特征和动作特征可以利用帧间的内容相关性从多个角度生成多样的特征。其中，双图推理可以增强帧序列中的内容相关性，生成高级语义特征；另一方面，门控融合可以组合不同层次的特征，以更好地表示视频内容。",
    "tldr": "本文提出了一种基于双图和门控融合的视频字幕生成模型，通过适应两种类型的图来生成多样的特征表示，并利用门控融合来更好地理解视频内容。"
}