{
    "title": "DREAMWALKER: Mental Planning for Continuous Vision-Language Navigation. (arXiv:2308.07498v1 [cs.CV])",
    "abstract": "VLN-CE is a recently released embodied task, where AI agents need to navigate a freely traversable environment to reach a distant target location, given language instructions. It poses great challenges due to the huge space of possible strategies. Driven by the belief that the ability to anticipate the consequences of future actions is crucial for the emergence of intelligent and interpretable planning behavior, we propose DREAMWALKER -- a world model based VLN-CE agent. The world model is built to summarize the visual, topological, and dynamic properties of the complicated continuous environment into a discrete, structured, and compact representation. DREAMWALKER can simulate and evaluate possible plans entirely in such internal abstract world, before executing costly actions. As opposed to existing model-free VLN-CE agents simply making greedy decisions in the real world, which easily results in shortsighted behaviors, DREAMWALKER is able to make strategic planning through large amou",
    "link": "http://arxiv.org/abs/2308.07498",
    "context": "Title: DREAMWALKER: Mental Planning for Continuous Vision-Language Navigation. (arXiv:2308.07498v1 [cs.CV])\nAbstract: VLN-CE is a recently released embodied task, where AI agents need to navigate a freely traversable environment to reach a distant target location, given language instructions. It poses great challenges due to the huge space of possible strategies. Driven by the belief that the ability to anticipate the consequences of future actions is crucial for the emergence of intelligent and interpretable planning behavior, we propose DREAMWALKER -- a world model based VLN-CE agent. The world model is built to summarize the visual, topological, and dynamic properties of the complicated continuous environment into a discrete, structured, and compact representation. DREAMWALKER can simulate and evaluate possible plans entirely in such internal abstract world, before executing costly actions. As opposed to existing model-free VLN-CE agents simply making greedy decisions in the real world, which easily results in shortsighted behaviors, DREAMWALKER is able to make strategic planning through large amou",
    "path": "papers/23/08/2308.07498.json",
    "total_tokens": 905,
    "translated_title": "DREAMWALKER:连续视觉-语言导航的心理规划",
    "translated_abstract": "VLN-CE是一项最近发布的任务，AI代理需要根据语言指令在自由可穿越的环境中导航到达一个远处的目标位置。由于可能策略的巨大空间，这个任务带来了巨大的挑战。基于我们相信能够预期未来行动的后果对于智能和可解释的规划行为的出现至关重要的信念，我们提出了基于世界模型的VLN-CE代理DREAMWALKER。这个世界模型将复杂连续环境的视觉、拓扑和动态特性总结为离散、结构化和紧凑的表示。DREAMWALKER可以在这种内部抽象世界中模拟和评估可能的计划，然后再执行昂贵的行动。与现有的基于模型的VLN-CE代理只在真实世界中作贪婪决策相反，这很容易导致短视行为，DREAMWALKER能够通过大量的规划进行战略性的规划。",
    "tldr": "DREAMWALKER是一种基于世界模型的连续视觉-语言导航代理，通过在内部抽象世界中模拟和评估可能的计划，实现了智能的和可解释的规划行为。"
}