{
    "title": "Green or greedy: the relationship between perceived benefits and homeowners' intention to adopt residential low-carbon technologies. (arXiv:2308.10104v1 [econ.GN])",
    "abstract": "Transitioning to a net-zero economy requires a nuanced understanding of homeowners decision-making pathways when considering the adoption of Low Carbon Technologies (LCTs). These LCTs present both personal and collective benefits, with positive perceptions critically influencing attitudes and intentions. Our study analyses the relationship between two primary benefits: the household-level financial gain and the broader environmental advantage. Focusing on the intention to adopt Rooftop Photovoltaic Systems, Energy Efficient Appliances, and Green Electricity Tariffs, we employ Partial Least Squares Structural Equation Modeling to demonstrate that the adoption intention of the LCTs is underpinned by the Theory of Planned Behaviour. Attitudes toward the LCTs are more strongly related to product-specific benefits than affective constructs. In terms of evaluative benefits, environmental benefits exhibit a higher positive association with attitude formation compared to financial benefits. Ho",
    "link": "http://arxiv.org/abs/2308.10104",
    "context": "Title: Green or greedy: the relationship between perceived benefits and homeowners' intention to adopt residential low-carbon technologies. (arXiv:2308.10104v1 [econ.GN])\nAbstract: Transitioning to a net-zero economy requires a nuanced understanding of homeowners decision-making pathways when considering the adoption of Low Carbon Technologies (LCTs). These LCTs present both personal and collective benefits, with positive perceptions critically influencing attitudes and intentions. Our study analyses the relationship between two primary benefits: the household-level financial gain and the broader environmental advantage. Focusing on the intention to adopt Rooftop Photovoltaic Systems, Energy Efficient Appliances, and Green Electricity Tariffs, we employ Partial Least Squares Structural Equation Modeling to demonstrate that the adoption intention of the LCTs is underpinned by the Theory of Planned Behaviour. Attitudes toward the LCTs are more strongly related to product-specific benefits than affective constructs. In terms of evaluative benefits, environmental benefits exhibit a higher positive association with attitude formation compared to financial benefits. Ho",
    "path": "papers/23/08/2308.10104.json",
    "total_tokens": 935,
    "translated_title": "绿色还是贪婪：感知收益与业主采用低碳技术的意向之间的关系",
    "translated_abstract": "过渡到零排放经济需要深入了解业主在考虑采用低碳技术时的决策路径。这些低碳技术既带来个人收益，也带来集体收益，积极的感知关键影响态度和意愿。我们的研究分析了两种主要收益之间的关系：家庭级财务收益和更广泛的环境优势。我们关注屋顶光伏系统、节能家电和绿色电力电费的采用意愿，利用偏最小二乘结构方程模型来证明低碳技术采用意愿基于计划行为理论。对低碳技术的态度与产品特定收益联系更强，而不是情感构建。在评估收益方面，环境收益与态度形成的正向关联比财务收益更高。",
    "tldr": "该研究分析了业主在考虑采用低碳技术时的决策路径，发现其采用意愿受计划行为理论影响。研究结果表明，对于低碳技术的态度更与产品特定收益相关，而环境收益对态度形成的正向关联比财务收益更高。"
}