{
    "title": "EditSum: A Retrieve-and-Edit Framework for Source Code Summarization. (arXiv:2308.13775v1 [cs.SE])",
    "abstract": "Existing studies show that code summaries help developers understand and maintain source code. Unfortunately, these summaries are often missing or outdated in software projects. Code summarization aims to generate natural language descriptions automatically for source code. Code summaries are highly structured and have repetitive patterns. Besides the patternized words, a code summary also contains important keywords, which are the key to reflecting the functionality of the code. However, the state-of-the-art approaches perform poorly on predicting the keywords, which leads to the generated summaries suffering a loss in informativeness. To alleviate this problem, this paper proposes a novel retrieve-and-edit approach named EditSum for code summarization. Specifically, EditSum first retrieves a similar code snippet from a pre-defined corpus and treats its summary as a prototype summary to learn the pattern. Then, EditSum edits the prototype automatically to combine the pattern in the pr",
    "link": "http://arxiv.org/abs/2308.13775",
    "context": "Title: EditSum: A Retrieve-and-Edit Framework for Source Code Summarization. (arXiv:2308.13775v1 [cs.SE])\nAbstract: Existing studies show that code summaries help developers understand and maintain source code. Unfortunately, these summaries are often missing or outdated in software projects. Code summarization aims to generate natural language descriptions automatically for source code. Code summaries are highly structured and have repetitive patterns. Besides the patternized words, a code summary also contains important keywords, which are the key to reflecting the functionality of the code. However, the state-of-the-art approaches perform poorly on predicting the keywords, which leads to the generated summaries suffering a loss in informativeness. To alleviate this problem, this paper proposes a novel retrieve-and-edit approach named EditSum for code summarization. Specifically, EditSum first retrieves a similar code snippet from a pre-defined corpus and treats its summary as a prototype summary to learn the pattern. Then, EditSum edits the prototype automatically to combine the pattern in the pr",
    "path": "papers/23/08/2308.13775.json",
    "total_tokens": 811,
    "translated_title": "EditSum: 一种基于检索和编辑的源代码摘要框架",
    "translated_abstract": "现有研究表明，代码摘要有助于开发人员理解和维护源代码。不幸的是，软件项目中经常缺乏或过时的摘要。代码摘要旨在自动生成源代码的自然语言描述。代码摘要非常结构化，并具有重复的模式。除了模式化的单词外，代码摘要还包含重要的关键词，这些关键词是反映代码功能的关键。然而，现有技术在预测关键词方面表现较差，导致生成的摘要信息丧失了信息量。为了缓解这个问题，本文提出了一种名为EditSum的新型检索和编辑方法用于代码摘要。具体而言，EditSum首先从预定义的语料库中检索一个相似的代码片段，并将其摘要视为原型摘要以学习模式。然后，EditSum自动编辑原型摘要，以结合其中的模式。",
    "tldr": "本文提出了一种基于检索和编辑的源代码摘要框架(EditSum)，用于自动生成结构化、信息丰富的代码摘要。"
}