{
    "title": "Towards Probabilistic Causal Discovery, Inference & Explanations for Autonomous Drones in Mine Surveying Tasks. (arXiv:2308.10047v2 [cs.RO] UPDATED)",
    "abstract": "Causal modelling offers great potential to provide autonomous agents the ability to understand the data-generation process that governs their interactions with the world. Such models capture formal knowledge as well as probabilistic representations of noise and uncertainty typically encountered by autonomous robots in real-world environments. Thus, causality can aid autonomous agents in making decisions and explaining outcomes, but deploying causality in such a manner introduces new challenges. Here we identify challenges relating to causality in the context of a drone system operating in a salt mine. Such environments are challenging for autonomous agents because of the presence of confounders, non-stationarity, and a difficulty in building complete causal models ahead of time. To address these issues, we propose a probabilistic causal framework consisting of: causally-informed POMDP planning, online SCM adaptation, and post-hoc counterfactual explanations. Further, we outline planned",
    "link": "http://arxiv.org/abs/2308.10047",
    "context": "Title: Towards Probabilistic Causal Discovery, Inference & Explanations for Autonomous Drones in Mine Surveying Tasks. (arXiv:2308.10047v2 [cs.RO] UPDATED)\nAbstract: Causal modelling offers great potential to provide autonomous agents the ability to understand the data-generation process that governs their interactions with the world. Such models capture formal knowledge as well as probabilistic representations of noise and uncertainty typically encountered by autonomous robots in real-world environments. Thus, causality can aid autonomous agents in making decisions and explaining outcomes, but deploying causality in such a manner introduces new challenges. Here we identify challenges relating to causality in the context of a drone system operating in a salt mine. Such environments are challenging for autonomous agents because of the presence of confounders, non-stationarity, and a difficulty in building complete causal models ahead of time. To address these issues, we propose a probabilistic causal framework consisting of: causally-informed POMDP planning, online SCM adaptation, and post-hoc counterfactual explanations. Further, we outline planned",
    "path": "papers/23/08/2308.10047.json",
    "total_tokens": 933,
    "translated_title": "面向矿山勘测任务的自主无人机的概率因果发现、推理和解释",
    "translated_abstract": "因果建模为自主代理提供了解析其与世界互动的数据生成过程的潜力。这些模型捕捉了正式的知识和概率性的噪声和不确定性表示，这些特征在实际环境中的自主机器人遇到是常见的。因此，因果关系可以帮助自主代理进行决策和解释结果，但是以这种方式应用因果关系会引入新的挑战。本文在盐矿中无人机系统的环境中，识别了与因果关系相关的挑战。这样的环境对自主代理来说是具有挑战性的，因为存在混淆变量、非平稳性，并且难以提前构建完整的因果模型。为了解决这些问题，我们提出了一个概率因果框架，包括：基于因果的POMDP规划、在线SCM适应和事后因果推断解释。此外，我们还概述了计划中的研究方向。",
    "tldr": "本文针对无人机在盐矿勘测任务中面临的因果挑战，提出了一个概率因果框架，包括因果规划、在线适应和事后解释，以解决混淆变量、非平稳性和建模困难等问题。"
}