{
    "title": "Beyond Reality: The Pivotal Role of Generative AI in the Metaverse. (arXiv:2308.06272v1 [cs.HC])",
    "abstract": "Imagine stepping into a virtual world that's as rich, dynamic, and interactive as our physical one. This is the promise of the Metaverse, and it's being brought to life by the transformative power of Generative Artificial Intelligence (AI). This paper offers a comprehensive exploration of how generative AI technologies are shaping the Metaverse, transforming it into a dynamic, immersive, and interactive virtual world. We delve into the applications of text generation models like ChatGPT and GPT-3, which are enhancing conversational interfaces with AI-generated characters. We explore the role of image generation models such as DALL-E and MidJourney in creating visually stunning and diverse content. We also examine the potential of 3D model generation technologies like Point-E and Lumirithmic in creating realistic virtual objects that enrich the Metaverse experience. But the journey doesn't stop there. We also address the challenges and ethical considerations of implementing these techno",
    "link": "http://arxiv.org/abs/2308.06272",
    "context": "Title: Beyond Reality: The Pivotal Role of Generative AI in the Metaverse. (arXiv:2308.06272v1 [cs.HC])\nAbstract: Imagine stepping into a virtual world that's as rich, dynamic, and interactive as our physical one. This is the promise of the Metaverse, and it's being brought to life by the transformative power of Generative Artificial Intelligence (AI). This paper offers a comprehensive exploration of how generative AI technologies are shaping the Metaverse, transforming it into a dynamic, immersive, and interactive virtual world. We delve into the applications of text generation models like ChatGPT and GPT-3, which are enhancing conversational interfaces with AI-generated characters. We explore the role of image generation models such as DALL-E and MidJourney in creating visually stunning and diverse content. We also examine the potential of 3D model generation technologies like Point-E and Lumirithmic in creating realistic virtual objects that enrich the Metaverse experience. But the journey doesn't stop there. We also address the challenges and ethical considerations of implementing these techno",
    "path": "papers/23/08/2308.06272.json",
    "total_tokens": 1072,
    "translated_title": "超越现实：生成式人工智能在元宇宙中的关键作用",
    "translated_abstract": "想象一下，进入一个与我们物理世界一样丰富、动态和互动的虚拟世界。这就是元宇宙的承诺，而生成式人工智能的变革力量正在给它注入生命。本文全面探讨了生成式人工智能技术如何塑造元宇宙，将其转变为一个充满活力、沉浸式和互动式的虚拟世界。我们深入研究了文本生成模型（如ChatGPT和GPT-3）在增强带有人工智能生成角色的对话界面方面的应用。我们探索了图像生成模型（如DALL-E和MidJourney）在创建视觉上令人惊艳和多样化的内容方面的作用。我们还考察了三维模型生成技术（如Point-E和Lumirithmic）在创建丰富元宇宙体验的逼真虚拟物体方面的潜力。但旅程并不止于此。我们还讨论了实施这些技术所面临的挑战和伦理考虑。",
    "tldr": "本文全面探讨了生成式人工智能技术如何塑造元宇宙，将其转变为一个充满活力、沉浸式和互动式的虚拟世界。我们深入研究了文本生成模型（如ChatGPT和GPT-3）和图像生成模型（如DALL-E和MidJourney）的应用，以及三维模型生成技术（如Point-E和Lumirithmic）的潜力。同时，我们还讨论了实施这些技术所面临的挑战和伦理考虑。",
    "en_tdlr": "This paper comprehensively explores how generative AI technologies are shaping the Metaverse, transforming it into a dynamic, immersive, and interactive virtual world. We delve into the applications of text generation models like ChatGPT and GPT-3, image generation models such as DALL-E and MidJourney, and 3D model generation technologies like Point-E and Lumirithmic. The challenges and ethical considerations of implementing these technologies are also addressed."
}