{
    "title": "A Survey of Imbalanced Learning on Graphs: Problems, Techniques, and Future Directions. (arXiv:2308.13821v1 [cs.LG])",
    "abstract": "Graphs represent interconnected structures prevalent in a myriad of real-world scenarios. Effective graph analytics, such as graph learning methods, enables users to gain profound insights from graph data, underpinning various tasks including node classification and link prediction. However, these methods often suffer from data imbalance, a common issue in graph data where certain segments possess abundant data while others are scarce, thereby leading to biased learning outcomes. This necessitates the emerging field of imbalanced learning on graphs, which aims to correct these data distribution skews for more accurate and representative learning outcomes. In this survey, we embark on a comprehensive review of the literature on imbalanced learning on graphs. We begin by providing a definitive understanding of the concept and related terminologies, establishing a strong foundational understanding for readers. Following this, we propose two comprehensive taxonomies: (1) the problem taxono",
    "link": "http://arxiv.org/abs/2308.13821",
    "context": "Title: A Survey of Imbalanced Learning on Graphs: Problems, Techniques, and Future Directions. (arXiv:2308.13821v1 [cs.LG])\nAbstract: Graphs represent interconnected structures prevalent in a myriad of real-world scenarios. Effective graph analytics, such as graph learning methods, enables users to gain profound insights from graph data, underpinning various tasks including node classification and link prediction. However, these methods often suffer from data imbalance, a common issue in graph data where certain segments possess abundant data while others are scarce, thereby leading to biased learning outcomes. This necessitates the emerging field of imbalanced learning on graphs, which aims to correct these data distribution skews for more accurate and representative learning outcomes. In this survey, we embark on a comprehensive review of the literature on imbalanced learning on graphs. We begin by providing a definitive understanding of the concept and related terminologies, establishing a strong foundational understanding for readers. Following this, we propose two comprehensive taxonomies: (1) the problem taxono",
    "path": "papers/23/08/2308.13821.json",
    "total_tokens": 843,
    "translated_title": "图上不平衡学习的综述：问题、技术和未来方向",
    "translated_abstract": "图表示与世界各种场景中普遍存在的相互连接的结构。有效的图分析技术，如图学习方法，使用户能够从图数据中获得深刻的洞察力，为节点分类和链路预测等各种任务提供支持。然而，这些方法常常面临数据不平衡的问题，即在图数据中某些片段拥有大量数据而其他数据稀缺，从而导致偏倚的学习结果。这就需要出现了图上不平衡学习的新兴领域，旨在纠正这些数据分布偏差，以获得更准确和代表性的学习结果。在本综述中，我们对图上不平衡学习的文献进行了全面的审视。我们首先提供了对该概念和相关术语的明确理解，为读者建立了扎实的基础知识。随后，我们提出了两个全面的分类法：（1）问题分类法（Problem Taxonomy）。",
    "tldr": "本综述对图上不平衡学习进行了全面的审视，旨在纠正数据分布偏差，以获得更准确和代表性的学习结果。",
    "en_tdlr": "This survey provides a comprehensive review of imbalanced learning on graphs, aiming to correct data distribution skews for more accurate and representative learning outcomes."
}