{
    "title": "EnsembleFollower: A Hybrid Car-Following Framework Based On Reinforcement Learning and Hierarchical Planning. (arXiv:2308.16008v1 [cs.RO])",
    "abstract": "Car-following models have made significant contributions to our understanding of longitudinal driving behavior. However, they often exhibit limited accuracy and flexibility, as they cannot fully capture the complexity inherent in car-following processes, or may falter in unseen scenarios due to their reliance on confined driving skills present in training data. It is worth noting that each car-following model possesses its own strengths and weaknesses depending on specific driving scenarios. Therefore, we propose EnsembleFollower, a hierarchical planning framework for achieving advanced human-like car-following. The EnsembleFollower framework involves a high-level Reinforcement Learning-based agent responsible for judiciously managing multiple low-level car-following models according to the current state, either by selecting an appropriate low-level model to perform an action or by allocating different weights across all low-level components. Moreover, we propose a jerk-constrained kin",
    "link": "http://arxiv.org/abs/2308.16008",
    "context": "Title: EnsembleFollower: A Hybrid Car-Following Framework Based On Reinforcement Learning and Hierarchical Planning. (arXiv:2308.16008v1 [cs.RO])\nAbstract: Car-following models have made significant contributions to our understanding of longitudinal driving behavior. However, they often exhibit limited accuracy and flexibility, as they cannot fully capture the complexity inherent in car-following processes, or may falter in unseen scenarios due to their reliance on confined driving skills present in training data. It is worth noting that each car-following model possesses its own strengths and weaknesses depending on specific driving scenarios. Therefore, we propose EnsembleFollower, a hierarchical planning framework for achieving advanced human-like car-following. The EnsembleFollower framework involves a high-level Reinforcement Learning-based agent responsible for judiciously managing multiple low-level car-following models according to the current state, either by selecting an appropriate low-level model to perform an action or by allocating different weights across all low-level components. Moreover, we propose a jerk-constrained kin",
    "path": "papers/23/08/2308.16008.json",
    "total_tokens": 844,
    "translated_title": "EnsembleFollower: 基于强化学习和分层规划的混合车辆跟驰框架",
    "translated_abstract": "车辆跟驰模型对于我们对纵向行驶行为的理解做出了重要贡献。然而，它们常常表现出有限的准确性和灵活性，因为它们无法完全捕捉到跟驰过程中的复杂性，或者由于依赖于训练数据中存在的受限驾驶技能而在未知情况下出现问题。值得注意的是，每种车辆跟驰模型在特定驾驶场景中具有自己的优势和劣势。因此，我们提出了一种名为EnsembleFollower的分层规划框架，用于实现先进的类人车辆跟驰。EnsembleFollower框架涉及一个高层强化学习代理的使用，负责根据当前状态，通过选择适当的低层模型执行动作或分配不同的权重来管理多个低层车辆跟驰模型。",
    "tldr": "EnsembleFollower是一个采用分层规划和强化学习的混合车辆跟驰框架，能够实现先进的类人车辆跟驰。",
    "en_tdlr": "EnsembleFollower is a hybrid car-following framework that combines hierarchical planning and reinforcement learning to achieve advanced human-like car-following."
}