{
    "title": "Estimating Effects of Long-Term Treatments. (arXiv:2308.08152v1 [econ.EM])",
    "abstract": "Estimating the effects of long-term treatments in A/B testing presents a significant challenge. Such treatments -- including updates to product functions, user interface designs, and recommendation algorithms -- are intended to remain in the system for a long period after their launches. On the other hand, given the constraints of conducting long-term experiments, practitioners often rely on short-term experimental results to make product launch decisions. It remains an open question how to accurately estimate the effects of long-term treatments using short-term experimental data. To address this question, we introduce a longitudinal surrogate framework. We show that, under standard assumptions, the effects of long-term treatments can be decomposed into a series of functions, which depend on the user attributes, the short-term intermediate metrics, and the treatment assignments. We describe the identification assumptions, the estimation strategies, and the inference technique under thi",
    "link": "http://arxiv.org/abs/2308.08152",
    "context": "Title: Estimating Effects of Long-Term Treatments. (arXiv:2308.08152v1 [econ.EM])\nAbstract: Estimating the effects of long-term treatments in A/B testing presents a significant challenge. Such treatments -- including updates to product functions, user interface designs, and recommendation algorithms -- are intended to remain in the system for a long period after their launches. On the other hand, given the constraints of conducting long-term experiments, practitioners often rely on short-term experimental results to make product launch decisions. It remains an open question how to accurately estimate the effects of long-term treatments using short-term experimental data. To address this question, we introduce a longitudinal surrogate framework. We show that, under standard assumptions, the effects of long-term treatments can be decomposed into a series of functions, which depend on the user attributes, the short-term intermediate metrics, and the treatment assignments. We describe the identification assumptions, the estimation strategies, and the inference technique under thi",
    "path": "papers/23/08/2308.08152.json",
    "total_tokens": 820,
    "translated_title": "估计长期治疗效果",
    "translated_abstract": "在A/B测试中，估计长期治疗的效果是一个巨大的挑战。这种治疗措施包括产品功能的更新、用户界面设计和推荐算法等，旨在在其发布后长期存在系统中。然而，由于长期试验的限制，从业者通常依赖短期实验结果来做产品发布决策。如何使用短期实验数据准确估计长期治疗效果仍然是一个未解决的问题。为了解决这个问题，我们引入了一个纵向替代框架。我们展示了，在标准假设下，长期治疗效果可以分解为一系列函数，这些函数依赖于用户属性、短期中间指标和治疗分配。我们描述了识别假设、估计策略和推理技术。",
    "tldr": "本论文介绍了一个纵向替代框架，用于准确估计长期治疗的效果。论文通过分解长期治疗效果为一系列函数，考虑用户属性、短期中间指标和治疗分配等因素。",
    "en_tdlr": "This paper introduces a longitudinal surrogate framework for accurately estimating the effects of long-term treatments. The paper decomposes the effects into a series of functions, considering factors such as user attributes, short-term intermediate metrics, and treatment assignments."
}