{
    "title": "Leveraging Symmetries in Pick and Place. (arXiv:2308.07948v1 [cs.RO])",
    "abstract": "Robotic pick and place tasks are symmetric under translations and rotations of both the object to be picked and the desired place pose. For example, if the pick object is rotated or translated, then the optimal pick action should also rotate or translate. The same is true for the place pose; if the desired place pose changes, then the place action should also transform accordingly. A recently proposed pick and place framework known as Transporter Net captures some of these symmetries, but not all. This paper analytically studies the symmetries present in planar robotic pick and place and proposes a method of incorporating equivariant neural models into Transporter Net in a way that captures all symmetries. The new model, which we call Equivariant Transporter Net, is equivariant to both pick and place symmetries and can immediately generalize pick and place knowledge to different pick and place poses. We evaluate the new model empirically and show that it is much more sample efficient t",
    "link": "http://arxiv.org/abs/2308.07948",
    "context": "Title: Leveraging Symmetries in Pick and Place. (arXiv:2308.07948v1 [cs.RO])\nAbstract: Robotic pick and place tasks are symmetric under translations and rotations of both the object to be picked and the desired place pose. For example, if the pick object is rotated or translated, then the optimal pick action should also rotate or translate. The same is true for the place pose; if the desired place pose changes, then the place action should also transform accordingly. A recently proposed pick and place framework known as Transporter Net captures some of these symmetries, but not all. This paper analytically studies the symmetries present in planar robotic pick and place and proposes a method of incorporating equivariant neural models into Transporter Net in a way that captures all symmetries. The new model, which we call Equivariant Transporter Net, is equivariant to both pick and place symmetries and can immediately generalize pick and place knowledge to different pick and place poses. We evaluate the new model empirically and show that it is much more sample efficient t",
    "path": "papers/23/08/2308.07948.json",
    "total_tokens": 870,
    "translated_title": "利用对称性在物品搬运中的应用",
    "translated_abstract": "机器人的物品搬运任务在物品和目标放置位置的平移和旋转下具有对称性。例如，如果物品被旋转或平移，最佳搬运动作也应该旋转或平移。对于放置位置也是如此，如果目标放置位置发生变化，放置动作也应相应改变。最近提出的搬运框架Transporter Net捕捉了部分这些对称性，但不完全。本文通过分析平面机器人物品搬运中的对称性，提出了一种将等变神经模型整合到Transporter Net中以捕捉所有对称性的方法。这个新模型被称为等变Transporter Net，对于物品的搬运和放置具有等变性，可以立即将搬运知识推广到不同的搬运位置。我们通过实验证明了这个新模型的效果，并显示它比传统模型更加高效。",
    "tldr": "该论文研究了物品搬运任务中的对称性，提出了一种称为等变Transporter Net的模型，利用等变神经模型捕捉了所有对称性，能够在不同的搬运位置推广搬运知识。",
    "en_tdlr": "This paper studies the symmetries in pick and place tasks and proposes a model called Equivariant Transporter Net that captures all the symmetries using equivariant neural models, enabling knowledge transfer to different pick and place poses."
}