{
    "title": "Collaborative Route Planning of UAVs, Workers and Cars for Crowdsensing in Disaster Response. (arXiv:2308.11088v1 [cs.AI])",
    "abstract": "Efficiently obtaining the up-to-date information in the disaster-stricken area is the key to successful disaster response. Unmanned aerial vehicles (UAVs), workers and cars can collaborate to accomplish sensing tasks, such as data collection, in disaster-stricken areas. In this paper, we explicitly address the route planning for a group of agents, including UAVs, workers, and cars, with the goal of maximizing the task completion rate. We propose MANF-RL-RP, a heterogeneous multi-agent route planning algorithm that incorporates several efficient designs, including global-local dual information processing and a tailored model structure for heterogeneous multi-agent systems. Global-local dual information processing encompasses the extraction and dissemination of spatial features from global information, as well as the partitioning and filtering of local information from individual agents. Regarding the construction of the model structure for heterogeneous multi-agent, we perform the follo",
    "link": "http://arxiv.org/abs/2308.11088",
    "context": "Title: Collaborative Route Planning of UAVs, Workers and Cars for Crowdsensing in Disaster Response. (arXiv:2308.11088v1 [cs.AI])\nAbstract: Efficiently obtaining the up-to-date information in the disaster-stricken area is the key to successful disaster response. Unmanned aerial vehicles (UAVs), workers and cars can collaborate to accomplish sensing tasks, such as data collection, in disaster-stricken areas. In this paper, we explicitly address the route planning for a group of agents, including UAVs, workers, and cars, with the goal of maximizing the task completion rate. We propose MANF-RL-RP, a heterogeneous multi-agent route planning algorithm that incorporates several efficient designs, including global-local dual information processing and a tailored model structure for heterogeneous multi-agent systems. Global-local dual information processing encompasses the extraction and dissemination of spatial features from global information, as well as the partitioning and filtering of local information from individual agents. Regarding the construction of the model structure for heterogeneous multi-agent, we perform the follo",
    "path": "papers/23/08/2308.11088.json",
    "total_tokens": 882,
    "translated_title": "UAV、工人和汽车的协同路径规划在灾难响应中的众包感知",
    "translated_abstract": "高效地获取灾区最新信息是成功的灾难响应的关键。无人机、工人和汽车可以协同完成诸如数据收集等感知任务。本文针对包括无人机、工人和汽车在内的一组代理人的路径规划问题，旨在最大化任务完成率。我们提出了一种多智能体路径规划算法MANF-RL-RP，该算法包括了多种有效的设计，包括全局-局部双重信息处理和针对多智能体系统的定制模型结构。全局-局部双重信息处理涵盖了从全局信息中提取和传播空间特征，以及从个体代理人中分割和过滤本地信息。对于多智能体的模型结构构建，我们完成了以下工作：",
    "tldr": "这篇论文研究了在灾难响应中，无人机、工人和汽车的协同路径规划问题，旨在最大化任务完成率。研究者提出了一种多智能体路径规划算法MANF-RL-RP，该算法包括了全局-局部双重信息处理和针对多智能体系统的定制模型结构。",
    "en_tdlr": "This paper investigates the collaborative route planning problem of UAVs, workers, and cars in disaster response to maximize the task completion rate. The authors propose a multi-agent route planning algorithm called MANF-RL-RP, which incorporates global-local dual information processing and a tailored model structure for heterogeneous multi-agent systems."
}