{
    "title": "Multiple Augmented Reduced Rank Regression for Pan-Cancer Analysis. (arXiv:2308.16333v1 [stat.ME])",
    "abstract": "Statistical approaches that successfully combine multiple datasets are more powerful, efficient, and scientifically informative than separate analyses. To address variation architectures correctly and comprehensively for high-dimensional data across multiple sample sets (i.e., cohorts), we propose multiple augmented reduced rank regression (maRRR), a flexible matrix regression and factorization method to concurrently learn both covariate-driven and auxiliary structured variation. We consider a structured nuclear norm objective that is motivated by random matrix theory, in which the regression or factorization terms may be shared or specific to any number of cohorts. Our framework subsumes several existing methods, such as reduced rank regression and unsupervised multi-matrix factorization approaches, and includes a promising novel approach to regression and factorization of a single dataset (aRRR) as a special case. Simulations demonstrate substantial gains in power from combining mult",
    "link": "http://arxiv.org/abs/2308.16333",
    "context": "Title: Multiple Augmented Reduced Rank Regression for Pan-Cancer Analysis. (arXiv:2308.16333v1 [stat.ME])\nAbstract: Statistical approaches that successfully combine multiple datasets are more powerful, efficient, and scientifically informative than separate analyses. To address variation architectures correctly and comprehensively for high-dimensional data across multiple sample sets (i.e., cohorts), we propose multiple augmented reduced rank regression (maRRR), a flexible matrix regression and factorization method to concurrently learn both covariate-driven and auxiliary structured variation. We consider a structured nuclear norm objective that is motivated by random matrix theory, in which the regression or factorization terms may be shared or specific to any number of cohorts. Our framework subsumes several existing methods, such as reduced rank regression and unsupervised multi-matrix factorization approaches, and includes a promising novel approach to regression and factorization of a single dataset (aRRR) as a special case. Simulations demonstrate substantial gains in power from combining mult",
    "path": "papers/23/08/2308.16333.json",
    "total_tokens": 887,
    "translated_title": "多增强缩减秩回归用于全癌症分析",
    "translated_abstract": "成功结合多个数据集的统计方法比单独分析更强大、高效和科学信息丰富。为了正确和全面地处理高维数据在多个样本集（即队列）中的变化结构，我们提出了多增强缩减秩回归（maRRR），一种灵活的矩阵回归和分解方法，同时学习协变驱动和辅助结构化变异。我们考虑了受随机矩阵理论启发的结构核范数目标，其中回归或分解项可以是共享的，也可以特定于任意数量的队列。我们的框架包含了减少秩回归和无监督多矩阵分解方法等多种现有方法，并将单个数据集（aRRR）的回归和分解作为特例进行了有希望的创新性探索。模拟实验表明，通过组合多个数据集可以获得显著的功率增益。",
    "tldr": "多增强缩减秩回归（maRRR）是一种灵活的矩阵回归和分解方法，用于同时学习协变驱动和辅助结构化变异。通过组合多个数据集，maRRR在全癌症分析中实现了显著的功率增益。",
    "en_tdlr": "Multiple augmented reduced rank regression (maRRR) is a flexible matrix regression and factorization method that simultaneously learns covariate-driven and auxiliary structured variation. Through combining multiple datasets, maRRR achieves substantial power gains in pan-cancer analysis."
}