{
    "title": "A Global Transport Capacity Risk Prediction Method for Rail Transit Based on Gaussian Bayesian Network. (arXiv:2308.01556v1 [cs.AI])",
    "abstract": "Aiming at the prediction problem of transport capacity risk caused by the mismatch between the carrying capacity of rail transit network and passenger flow demand, this paper proposes an explainable prediction method of rail transit network transport capacity risk based on linear Gaussian Bayesian network. This method obtains the training data of the prediction model based on the simulation model of the rail transit system with a three-layer structure including rail transit network, train flow and passenger flow. A Bayesian network structure construction method based on the topology of the rail transit network is proposed, and the MLE (Maximum Likelihood Estimation) method is used to realize the parameter learning of the Bayesian network. Finally, the effectiveness of the proposed method is verified by simulation examples.",
    "link": "http://arxiv.org/abs/2308.01556",
    "context": "Title: A Global Transport Capacity Risk Prediction Method for Rail Transit Based on Gaussian Bayesian Network. (arXiv:2308.01556v1 [cs.AI])\nAbstract: Aiming at the prediction problem of transport capacity risk caused by the mismatch between the carrying capacity of rail transit network and passenger flow demand, this paper proposes an explainable prediction method of rail transit network transport capacity risk based on linear Gaussian Bayesian network. This method obtains the training data of the prediction model based on the simulation model of the rail transit system with a three-layer structure including rail transit network, train flow and passenger flow. A Bayesian network structure construction method based on the topology of the rail transit network is proposed, and the MLE (Maximum Likelihood Estimation) method is used to realize the parameter learning of the Bayesian network. Finally, the effectiveness of the proposed method is verified by simulation examples.",
    "path": "papers/23/08/2308.01556.json",
    "total_tokens": 827,
    "translated_title": "基于高斯贝叶斯网络的轨道交通全球运输能力风险预测方法",
    "translated_abstract": "针对轨道交通网络承载能力与乘客流量需求之间不匹配所引起的运输能力风险预测问题，本文提出了一种基于线性高斯贝叶斯网络的轨道交通网络运输能力风险可解释性预测方法。该方法通过包括轨道交通网络、列车流和乘客流的三层结构的轨道交通系统仿真模型获取预测模型的训练数据。提出了一种基于轨道交通网络拓扑结构的贝叶斯网络结构构建方法，并利用MLE（最大似然估计）方法实现了贝叶斯网络的参数学习。最后，通过仿真实例验证了所提出方法的有效性。",
    "tldr": "本文提出了一种基于高斯贝叶斯网络的轨道交通全球运输能力风险预测方法，通过构建贝叶斯网络结构并利用最大似然估计方法进行参数学习，实现了对轨道交通网络的运输能力风险的预测和解释。",
    "en_tdlr": "This paper proposes an explainable prediction method for global transport capacity risk of rail transit based on Gaussian Bayesian network. The method constructs a Bayesian network structure using the topology of the rail transit network and utilizes the Maximum Likelihood Estimation method for parameter learning, enabling the prediction and explanation of the transport capacity risk in rail transit networks."
}