{
    "title": "Training normalizing flows with computationally intensive target probability distributions. (arXiv:2308.13294v1 [cs.LG])",
    "abstract": "Machine learning techniques, in particular the so-called normalizing flows, are becoming increasingly popular in the context of Monte Carlo simulations as they can effectively approximate target probability distributions. In the case of lattice field theories (LFT) the target distribution is given by the exponential of the action. The common loss function's gradient estimator based on the \"reparametrization trick\" requires the calculation of the derivative of the action with respect to the fields. This can present a significant computational cost for complicated, non-local actions like e.g. fermionic action in QCD. In this contribution, we propose an estimator for normalizing flows based on the REINFORCE algorithm that avoids this issue. We apply it to two dimensional Schwinger model with Wilson fermions at criticality and show that it is up to ten times faster in terms of the wall-clock time as well as requiring up to $30\\%$ less memory than the reparameterization trick estimator. It ",
    "link": "http://arxiv.org/abs/2308.13294",
    "context": "Title: Training normalizing flows with computationally intensive target probability distributions. (arXiv:2308.13294v1 [cs.LG])\nAbstract: Machine learning techniques, in particular the so-called normalizing flows, are becoming increasingly popular in the context of Monte Carlo simulations as they can effectively approximate target probability distributions. In the case of lattice field theories (LFT) the target distribution is given by the exponential of the action. The common loss function's gradient estimator based on the \"reparametrization trick\" requires the calculation of the derivative of the action with respect to the fields. This can present a significant computational cost for complicated, non-local actions like e.g. fermionic action in QCD. In this contribution, we propose an estimator for normalizing flows based on the REINFORCE algorithm that avoids this issue. We apply it to two dimensional Schwinger model with Wilson fermions at criticality and show that it is up to ten times faster in terms of the wall-clock time as well as requiring up to $30\\%$ less memory than the reparameterization trick estimator. It ",
    "path": "papers/23/08/2308.13294.json",
    "total_tokens": 938,
    "translated_title": "训练具有计算密集型目标概率分布的归一化流",
    "translated_abstract": "机器学习技术，特别是所谓的归一化流，在蒙特卡洛模拟中越来越受欢迎，因为它们可以有效地近似目标概率分布。在格点场论（LFT）的情况下，目标分布由作用的指数给出。基于“重新参数化技巧”的常见损失函数的梯度估计器需要对场的导数进行计算。对于复杂的非局部作用，如QCD中的费米子作用，这可能会带来显著的计算成本。在本文中，我们提出了一种基于REINFORCE算法的归一化流估计器，以避免这个问题。我们将其应用于关键性的二维Schwinger模型与Wilson费米子，并展示了它相对于重新参数化技巧估计器在墙时钟时间上快10倍以及在内存使用上节省30%的优势。",
    "tldr": "本文提出了一种基于REINFORCE算法的归一化流估计器，用于训练具有计算密集型目标概率分布的问题。在二维Schwinger模型中的应用结果表明，相较于重新参数化技巧估计器，该方法能够在墙时钟时间上快10倍，且内存使用上节省30%。",
    "en_tdlr": "This paper presents an estimator for training normalizing flows with computationally intensive target probability distributions. The proposed estimator, based on the REINFORCE algorithm, shows significant advantages over the reparameterization trick estimator in terms of wall-clock time (10 times faster) and memory usage (30% less), as demonstrated in the application to the two-dimensional Schwinger model with Wilson fermions."
}