{
    "title": "Recap: Detecting Deepfake Video with Unpredictable Tampered Traces via Recovering Faces and Mapping Recovered Faces. (arXiv:2308.09921v1 [cs.CV])",
    "abstract": "The exploitation of Deepfake techniques for malicious intentions has driven significant research interest in Deepfake detection. Deepfake manipulations frequently introduce random tampered traces, leading to unpredictable outcomes in different facial regions. However, existing detection methods heavily rely on specific forgery indicators, and as the forgery mode improves, these traces become increasingly randomized, resulting in a decline in the detection performance of methods reliant on specific forgery traces. To address the limitation, we propose Recap, a novel Deepfake detection model that exposes unspecific facial part inconsistencies by recovering faces and enlarges the differences between real and fake by mapping recovered faces. In the recovering stage, the model focuses on randomly masking regions of interest (ROIs) and reconstructing real faces without unpredictable tampered traces, resulting in a relatively good recovery effect for real faces while a poor recovery effect fo",
    "link": "http://arxiv.org/abs/2308.09921",
    "context": "Title: Recap: Detecting Deepfake Video with Unpredictable Tampered Traces via Recovering Faces and Mapping Recovered Faces. (arXiv:2308.09921v1 [cs.CV])\nAbstract: The exploitation of Deepfake techniques for malicious intentions has driven significant research interest in Deepfake detection. Deepfake manipulations frequently introduce random tampered traces, leading to unpredictable outcomes in different facial regions. However, existing detection methods heavily rely on specific forgery indicators, and as the forgery mode improves, these traces become increasingly randomized, resulting in a decline in the detection performance of methods reliant on specific forgery traces. To address the limitation, we propose Recap, a novel Deepfake detection model that exposes unspecific facial part inconsistencies by recovering faces and enlarges the differences between real and fake by mapping recovered faces. In the recovering stage, the model focuses on randomly masking regions of interest (ROIs) and reconstructing real faces without unpredictable tampered traces, resulting in a relatively good recovery effect for real faces while a poor recovery effect fo",
    "path": "papers/23/08/2308.09921.json",
    "total_tokens": 931,
    "translated_title": "累计: 通过恢复面部并映射恢复的面部检测不可预测篡改痕迹的Deepfake视频",
    "translated_abstract": "恶意使用Deepfake技术已经引起了对Deepfake检测的重要研究兴趣。Deepfake操纵经常引入随机篡改痕迹，在不同的面部区域产生不可预测的结果。然而，现有的检测方法严重依赖于特定的伪造指标，随着伪造模式的改进，这些痕迹变得越来越随机化，导致依赖于特定伪造痕迹的方法的检测性能下降。为了解决这个限制，我们提出了一种新型的Deepfake检测模型Recap，通过恢复面部和映射恢复的面部，暴露了非特定的面部不一致性，扩大了真实和伪造之间的差异。在恢复阶段，模型专注于随机遮盖感兴趣区域，并在没有不可预测的篡改痕迹的情况下重建真实的面部，从而为真实的面部产生相对较好的恢复效果，而为伪造的面部产生较差的恢复效果。",
    "tldr": "提出了一种新型的Deepfake检测模型Recap，通过恢复面部并映射恢复的面部暴露了非特定的面部不一致性，扩大了真实和伪造之间的差异。"
}