{
    "title": "Ramifications of generalized Feller theory. (arXiv:2308.03858v1 [math.PR])",
    "abstract": "Generalized Feller theory provides an important analog to Feller theory beyond locally compact state spaces. This is very useful for solutions of certain stochastic partial differential equations, Markovian lifts of fractional processes, or infinite dimensional affine and polynomial processes which appear prominently in the theory of signature stochastic differential equations. We extend several folklore results related to generalized Feller processes, in particular on their construction and path properties, and provide the often quite sophisticated proofs in full detail. We also introduce the new concept of extended Feller processes and compare them with standard and generalized ones. A key example relates generalized Feller semigroups of algebra homomorphisms via the method of characteristics to transport equations and continuous semiflows on weighted spaces, i.e. a remarkably generic way to treat differential equations on weighted spaces. We also provide a counterexample, which show",
    "link": "http://arxiv.org/abs/2308.03858",
    "context": "Title: Ramifications of generalized Feller theory. (arXiv:2308.03858v1 [math.PR])\nAbstract: Generalized Feller theory provides an important analog to Feller theory beyond locally compact state spaces. This is very useful for solutions of certain stochastic partial differential equations, Markovian lifts of fractional processes, or infinite dimensional affine and polynomial processes which appear prominently in the theory of signature stochastic differential equations. We extend several folklore results related to generalized Feller processes, in particular on their construction and path properties, and provide the often quite sophisticated proofs in full detail. We also introduce the new concept of extended Feller processes and compare them with standard and generalized ones. A key example relates generalized Feller semigroups of algebra homomorphisms via the method of characteristics to transport equations and continuous semiflows on weighted spaces, i.e. a remarkably generic way to treat differential equations on weighted spaces. We also provide a counterexample, which show",
    "path": "papers/23/08/2308.03858.json",
    "total_tokens": 871,
    "translated_title": "广义费勒理论的影响",
    "translated_abstract": "广义费勒理论提供了除了局部紧致状态空间以外的重要模拟。这在解决某些随机偏微分方程、分数过程的马尔可夫提升，或无限维度的仿射和多项式过程中非常有用，在特征随机微分方程理论中占据重要地位。我们扩展了一些与广义费勒过程相关的常识结果，特别是它们的构造和路径特性，并详细提供了通常相当复杂的证明。我们还引入了延伸的费勒过程的概念，并将其与标准和广义过程进行比较。一个关键的例子是将代数同态的广义费勒半群通过特征方法与输运方程和加权空间上的连续半流相关联，即一种非常通用的处理加权空间上微分方程的方法。我们还提供了一个反例，展示了...",
    "tldr": "广义费勒理论提供了除了局部紧致状态空间以外的重要模拟，扩展了与广义费勒过程相关的常识结果，并引入了延伸的费勒过程概念，通过代数同态的广义费勒半群与输运方程和加权空间上的连续半流相关联。",
    "en_tdlr": "Generalized Feller theory provides an important analog beyond locally compact state spaces, extending the results and introducing the concept of extended Feller processes. It establishes a connection between generalized Feller semigroups and transport equations in weighted spaces using the method of characteristics."
}