{
    "title": "Online Distillation-enhanced Multi-modal Transformer for Sequential Recommendation. (arXiv:2308.04067v1 [cs.IR])",
    "abstract": "Multi-modal recommendation systems, which integrate diverse types of information, have gained widespread attention in recent years. However, compared to traditional collaborative filtering-based multi-modal recommendation systems, research on multi-modal sequential recommendation is still in its nascent stages. Unlike traditional sequential recommendation models that solely rely on item identifier (ID) information and focus on network structure design, multi-modal recommendation models need to emphasize item representation learning and the fusion of heterogeneous data sources. This paper investigates the impact of item representation learning on downstream recommendation tasks and examines the disparities in information fusion at different stages. Empirical experiments are conducted to demonstrate the need to design a framework suitable for collaborative learning and fusion of diverse information. Based on this, we propose a new model-agnostic framework for multi-modal sequential recom",
    "link": "http://arxiv.org/abs/2308.04067",
    "context": "Title: Online Distillation-enhanced Multi-modal Transformer for Sequential Recommendation. (arXiv:2308.04067v1 [cs.IR])\nAbstract: Multi-modal recommendation systems, which integrate diverse types of information, have gained widespread attention in recent years. However, compared to traditional collaborative filtering-based multi-modal recommendation systems, research on multi-modal sequential recommendation is still in its nascent stages. Unlike traditional sequential recommendation models that solely rely on item identifier (ID) information and focus on network structure design, multi-modal recommendation models need to emphasize item representation learning and the fusion of heterogeneous data sources. This paper investigates the impact of item representation learning on downstream recommendation tasks and examines the disparities in information fusion at different stages. Empirical experiments are conducted to demonstrate the need to design a framework suitable for collaborative learning and fusion of diverse information. Based on this, we propose a new model-agnostic framework for multi-modal sequential recom",
    "path": "papers/23/08/2308.04067.json",
    "total_tokens": 844,
    "translated_title": "在线蒸馏增强的多模态变压器用于顺序推荐",
    "translated_abstract": "多模态推荐系统在近年来受到广泛关注, 它整合了各种类型的信息。然而,与传统的基于协同过滤的多模态推荐系统相比, 多模态顺序推荐的研究仍处于初级阶段。不同于仅依赖于物品标识符（ID）信息并关注网络结构设计的传统顺序推荐模型, 多模态推荐模型需要强调物品表示学习和异构数据源的融合。本文研究了物品表示学习对下游推荐任务的影响, 并检验了不同阶段信息融合的差异。通过实证实验, 我们证明了需要设计一个适合协同学习和融合多样信息的框架。基于此, 我们提出了一个新的模型不可知的框架用于多模态顺序推荐。",
    "tldr": "本文研究了多模态顺序推荐中物品表示学习对推荐任务的影响以及不同阶段信息融合的差异，并提出了一个适合协同学习和融合多样信息的新的模型不可知的框架。",
    "en_tdlr": "This paper investigates the impact of item representation learning on downstream recommendation tasks and examines the disparities in information fusion at different stages in multi-modal sequential recommendation. A new model-agnostic framework suitable for collaborative learning and fusion of diverse information is proposed."
}