{
    "title": "Design Space Exploration on Efficient and Accurate Human Pose Estimation from Sparse IMU-Sensing. (arXiv:2308.02397v1 [eess.SP])",
    "abstract": "Human Pose Estimation (HPE) to assess human motion in sports, rehabilitation or work safety requires accurate sensing without compromising the sensitive underlying personal data. Therefore, local processing is necessary and the limited energy budget in such systems can be addressed by Inertial Measurement Units (IMU) instead of common camera sensing. The central trade-off between accuracy and efficient use of hardware resources is rarely discussed in research. We address this trade-off by a simulative Design Space Exploration (DSE) of a varying quantity and positioning of IMU-sensors. First, we generate IMU-data from a publicly available body model dataset for different sensor configurations and train a deep learning model with this data. Additionally, we propose a combined metric to assess the accuracy-resource trade-off. We used the DSE as a tool to evaluate sensor configurations and identify beneficial ones for a specific use case. Exemplary, for a system with equal importance of ac",
    "link": "http://arxiv.org/abs/2308.02397",
    "context": "Title: Design Space Exploration on Efficient and Accurate Human Pose Estimation from Sparse IMU-Sensing. (arXiv:2308.02397v1 [eess.SP])\nAbstract: Human Pose Estimation (HPE) to assess human motion in sports, rehabilitation or work safety requires accurate sensing without compromising the sensitive underlying personal data. Therefore, local processing is necessary and the limited energy budget in such systems can be addressed by Inertial Measurement Units (IMU) instead of common camera sensing. The central trade-off between accuracy and efficient use of hardware resources is rarely discussed in research. We address this trade-off by a simulative Design Space Exploration (DSE) of a varying quantity and positioning of IMU-sensors. First, we generate IMU-data from a publicly available body model dataset for different sensor configurations and train a deep learning model with this data. Additionally, we propose a combined metric to assess the accuracy-resource trade-off. We used the DSE as a tool to evaluate sensor configurations and identify beneficial ones for a specific use case. Exemplary, for a system with equal importance of ac",
    "path": "papers/23/08/2308.02397.json",
    "total_tokens": 925,
    "translated_title": "从稀疏IMU感测中高效准确地进行人体姿势估计的设计空间探索",
    "translated_abstract": "鉴于敏感的个人数据，对于评估运动、康复或工作安全中的人体运动的人体姿势估计（HPE），需要准确的感测。因此，本地处理是必要的，并且在此类系统中，有限的能源预算可以通过使用惯性测量单元（IMU）而不是常见的相机感测来解决。研究中很少讨论精度和硬件资源的有效利用之间的核心折衷。我们通过模拟情况下的设计空间探索来解决这个折衷问题，它涉及不同的IMU传感器数量和摆放位置。首先，我们使用公开可用的人体模型数据集为不同的传感器配置生成IMU数据，并用这些数据训练深度学习模型。此外，我们提出了一个组合度量来评估精度和资源利用的折衷。我们将设计空间探索用作评估传感器配置并确定特定用例的有益配置的工具。例如，对于一个同等重要性的系统...",
    "tldr": "本论文通过模拟情况下的设计空间探索，研究了人体姿势估计中精度和硬件资源之间的折衷，提出了利用IMU感测进行高效准确的人体姿势估计的方法。",
    "en_tdlr": "This paper explores the trade-off between accuracy and hardware resources in human pose estimation by simulative design space exploration, and proposes a method for efficient and accurate human pose estimation using IMU sensing."
}