{
    "title": "An Analytical Study of Covid-19 Dataset using Graph-Based Clustering Algorithms. (arXiv:2308.04697v1 [cs.LG])",
    "abstract": "Corona VIrus Disease abbreviated as COVID-19 is a novel virus which is initially identified in Wuhan of China in December of 2019 and now this deadly disease has spread all over the world. According to World Health Organization (WHO), a total of 3,124,905 people died from 2019 to 2021, April. In this case, many methods, AI base techniques, and machine learning algorithms have been researched and are being used to save people from this pandemic. The SARS-CoV and the 2019-nCoV, SARS-CoV-2 virus invade our bodies, causing some differences in the structure of cell proteins. Protein-protein interaction (PPI) is an essential process in our cells and plays a very important role in the development of medicines and gives ideas about the disease. In this study, we performed clustering on PPI networks generated from 92 genes of the Covi-19 dataset. We have used three graph-based clustering algorithms to give intuition to the analysis of clusters.",
    "link": "http://arxiv.org/abs/2308.04697",
    "context": "Title: An Analytical Study of Covid-19 Dataset using Graph-Based Clustering Algorithms. (arXiv:2308.04697v1 [cs.LG])\nAbstract: Corona VIrus Disease abbreviated as COVID-19 is a novel virus which is initially identified in Wuhan of China in December of 2019 and now this deadly disease has spread all over the world. According to World Health Organization (WHO), a total of 3,124,905 people died from 2019 to 2021, April. In this case, many methods, AI base techniques, and machine learning algorithms have been researched and are being used to save people from this pandemic. The SARS-CoV and the 2019-nCoV, SARS-CoV-2 virus invade our bodies, causing some differences in the structure of cell proteins. Protein-protein interaction (PPI) is an essential process in our cells and plays a very important role in the development of medicines and gives ideas about the disease. In this study, we performed clustering on PPI networks generated from 92 genes of the Covi-19 dataset. We have used three graph-based clustering algorithms to give intuition to the analysis of clusters.",
    "path": "papers/23/08/2308.04697.json",
    "total_tokens": 970,
    "translated_title": "使用基于图的聚类算法对Covid-19数据集进行分析的研究",
    "translated_abstract": "冠状病毒疾病(COVID-19)是一种新型病毒，最早在2019年12月在中国武汉发现，现在这种致命疾病已经传播到世界各地。根据世界卫生组织（WHO）的数据，从2019年到2021年4月，共有312万4905人死亡。在这种情况下，许多方法、人工智能技术和机器学习算法被研究并用于拯救人们免受这一大流行病的伤害。SARS-CoV和2019-nCoV、SARS-CoV-2病毒侵入我们的身体，导致细胞蛋白质结构上的一些差异。蛋白质-蛋白质相互作用(PPI)是我们细胞中的一个重要过程，在药物研发和疾病方面起着非常重要的作用。在这项研究中，我们对由Covi-19数据集的92个基因生成的PPI网络进行了聚类分析。我们使用了三种基于图的聚类算法，以对聚类分析提供直观理解。",
    "tldr": "该研究使用基于图的聚类算法对Covid-19数据集进行了分析。研究结果对疾病药物研发和人们免受大流行病伤害具有重要意义。",
    "en_tdlr": "This study presents an analytical study of the Covid-19 dataset using graph-based clustering algorithms, providing important insights for disease drug development and mitigating the impact of pandemics."
}