{
    "title": "Combining predictive distributions of electricity prices: Does minimizing the CRPS lead to optimal decisions in day-ahead bidding?. (arXiv:2308.15443v1 [q-fin.ST])",
    "abstract": "Probabilistic price forecasting has recently gained attention in power trading because decisions based on such predictions can yield significantly higher profits than those made with point forecasts alone. At the same time, methods are being developed to combine predictive distributions, since no model is perfect and averaging generally improves forecasting performance. In this article we address the question of whether using CRPS learning, a novel weighting technique minimizing the continuous ranked probability score (CRPS), leads to optimal decisions in day-ahead bidding. To this end, we conduct an empirical study using hourly day-ahead electricity prices from the German EPEX market. We find that increasing the diversity of an ensemble can have a positive impact on accuracy. At the same time, the higher computational cost of using CRPS learning compared to an equal-weighted aggregation of distributions is not offset by higher profits, despite significantly more accurate predictions.",
    "link": "http://arxiv.org/abs/2308.15443",
    "context": "Title: Combining predictive distributions of electricity prices: Does minimizing the CRPS lead to optimal decisions in day-ahead bidding?. (arXiv:2308.15443v1 [q-fin.ST])\nAbstract: Probabilistic price forecasting has recently gained attention in power trading because decisions based on such predictions can yield significantly higher profits than those made with point forecasts alone. At the same time, methods are being developed to combine predictive distributions, since no model is perfect and averaging generally improves forecasting performance. In this article we address the question of whether using CRPS learning, a novel weighting technique minimizing the continuous ranked probability score (CRPS), leads to optimal decisions in day-ahead bidding. To this end, we conduct an empirical study using hourly day-ahead electricity prices from the German EPEX market. We find that increasing the diversity of an ensemble can have a positive impact on accuracy. At the same time, the higher computational cost of using CRPS learning compared to an equal-weighted aggregation of distributions is not offset by higher profits, despite significantly more accurate predictions.",
    "path": "papers/23/08/2308.15443.json",
    "total_tokens": 902,
    "translated_title": "结合电价的预测分布：最小化CRPS是否在提前竞标中导致最佳决策？",
    "translated_abstract": "近年来，基于概率的价格预测在电力交易中引起了关注，因为基于这种预测的决策可以比仅仅基于点预测获得显著更高的利润。与此同时，正在开发方法来结合预测分布，因为没有一个模型是完美的，平均通常可以改善预测性能。在本文中，我们探讨了使用CRPS学习的权重技术（最小化连续排名概率评分）是否在提前竞标中导致最佳决策。为此，我们进行了一项实证研究，使用了来自德国EPEX市场的小时级提前电力价格。我们发现，增加集合的多样性可以对准确性产生积极影响。与此同时，与等权重聚合分布相比，使用CRPS学习的较高计算成本不能通过更高的利润来抵消，尽管预测更准确。",
    "tldr": "这篇论文研究了在电力交易中使用概率价格预测和结合预测分布的技术。通过实证研究发现，增加集合的多样性可以提高准确性，但使用最小化CRPS的权重技术并不能带来更高的利润。",
    "en_tdlr": "This paper investigates the use of probabilistic price forecasting and ensemble combination techniques in power trading. Through empirical study, it is found that increasing the diversity of the ensemble improves accuracy, but using the CRPS weighting technique does not lead to higher profits."
}