{
    "title": "Spatial and Spatiotemporal Volatility Models: A Review. (arXiv:2308.13061v1 [econ.EM])",
    "abstract": "Spatial and spatiotemporal volatility models are a class of models designed to capture spatial dependence in the volatility of spatial and spatiotemporal data. Spatial dependence in the volatility may arise due to spatial spillovers among locations; that is, if two locations are in close proximity, they can exhibit similar volatilities. In this paper, we aim to provide a comprehensive review of the recent literature on spatial and spatiotemporal volatility models. We first briefly review time series volatility models and their multivariate extensions to motivate their spatial and spatiotemporal counterparts. We then review various spatial and spatiotemporal volatility specifications proposed in the literature along with their underlying motivations and estimation strategies. Through this analysis, we effectively compare all models and provide practical recommendations for their appropriate usage. We highlight possible extensions and conclude by outlining directions for future research.",
    "link": "http://arxiv.org/abs/2308.13061",
    "context": "Title: Spatial and Spatiotemporal Volatility Models: A Review. (arXiv:2308.13061v1 [econ.EM])\nAbstract: Spatial and spatiotemporal volatility models are a class of models designed to capture spatial dependence in the volatility of spatial and spatiotemporal data. Spatial dependence in the volatility may arise due to spatial spillovers among locations; that is, if two locations are in close proximity, they can exhibit similar volatilities. In this paper, we aim to provide a comprehensive review of the recent literature on spatial and spatiotemporal volatility models. We first briefly review time series volatility models and their multivariate extensions to motivate their spatial and spatiotemporal counterparts. We then review various spatial and spatiotemporal volatility specifications proposed in the literature along with their underlying motivations and estimation strategies. Through this analysis, we effectively compare all models and provide practical recommendations for their appropriate usage. We highlight possible extensions and conclude by outlining directions for future research.",
    "path": "papers/23/08/2308.13061.json",
    "total_tokens": 840,
    "translated_title": "空间和时空波动模型：综述",
    "translated_abstract": "空间和时空波动模型是一类旨在捕捉空间和时空数据波动性中的空间依赖关系的模型。波动性的空间依赖性可能是由于位置之间的空间溢出效应而引起的；也就是说，如果两个位置相邻，它们可能具有相似的波动性。本文旨在全面回顾关于空间和时空波动模型的最新文献。我们首先简要回顾时间序列波动模型及其多元扩展，以激发对空间和时空对应模型的兴趣。然后，我们回顾文献中提出的各种空间和时空波动模型规范及其潜在动机和估计策略。通过这个分析，我们有效地比较了所有模型，并为其适当的使用提供了实践建议。我们重点介绍了可能的扩展，并概述了未来研究的方向。",
    "tldr": "本综述回顾了最新关于空间和时空波动模型的文献，分析了不同模型的优缺点，并提出了实用推荐和未来研究方向。",
    "en_tdlr": "This review examines recent literature on spatial and spatiotemporal volatility models, analyzes the strengths and weaknesses of different models, and provides practical recommendations and future research directions."
}