{
    "title": "Optimization on Pareto sets: On a theory of multi-objective optimization. (arXiv:2308.02145v1 [math.OC])",
    "abstract": "In multi-objective optimization, a single decision vector must balance the trade-offs between many objectives. Solutions achieving an optimal trade-off are said to be Pareto optimal: these are decision vectors for which improving any one objective must come at a cost to another. But as the set of Pareto optimal vectors can be very large, we further consider a more practically significant Pareto-constrained optimization problem, where the goal is to optimize a preference function constrained to the Pareto set.  We investigate local methods for solving this constrained optimization problem, which poses significant challenges because the constraint set is (i) implicitly defined, and (ii) generally non-convex and non-smooth, even when the objectives are. We define notions of optimality and stationarity, and provide an algorithm with a last-iterate convergence rate of $O(K^{-1/2})$ to stationarity when the objectives are strongly convex and Lipschitz smooth.",
    "link": "http://arxiv.org/abs/2308.02145",
    "context": "Title: Optimization on Pareto sets: On a theory of multi-objective optimization. (arXiv:2308.02145v1 [math.OC])\nAbstract: In multi-objective optimization, a single decision vector must balance the trade-offs between many objectives. Solutions achieving an optimal trade-off are said to be Pareto optimal: these are decision vectors for which improving any one objective must come at a cost to another. But as the set of Pareto optimal vectors can be very large, we further consider a more practically significant Pareto-constrained optimization problem, where the goal is to optimize a preference function constrained to the Pareto set.  We investigate local methods for solving this constrained optimization problem, which poses significant challenges because the constraint set is (i) implicitly defined, and (ii) generally non-convex and non-smooth, even when the objectives are. We define notions of optimality and stationarity, and provide an algorithm with a last-iterate convergence rate of $O(K^{-1/2})$ to stationarity when the objectives are strongly convex and Lipschitz smooth.",
    "path": "papers/23/08/2308.02145.json",
    "total_tokens": 862,
    "translated_title": "Pareto集合上的优化：多目标优化理论研究",
    "translated_abstract": "在多目标优化中，一个决策向量必须在多个目标之间平衡权衡。实现最佳权衡的解决方案被称为Pareto最优：这些是决策向量，通过改善任何一个目标，必然会以牺牲另一个目标为代价。但由于Pareto最优向量的集合可能非常大，我们进一步考虑了一个更实际重要的Pareto约束优化问题：目标是将偏好函数优化到Pareto集合约束下。我们研究了解决这个约束优化问题的局部方法，这个问题存在重要挑战，因为约束集合(i)通过隐式定义，且(ii)一般情况下非凸非光滑，即使目标是凸光滑的。我们定义了最优性和稳定性的概念，并提供了一个算法，当目标是强凸的且Lipschitz光滑时，它具有末次迭代的收敛速率为$O(K^{-1/2})$。",
    "tldr": "该论文研究了在多目标优化中，如何解决Pareto集合上的约束优化问题，提出了局部算法，并给出了收敛速率。",
    "en_tdlr": "This paper investigates how to solve constrained optimization problems on Pareto sets in multi-objective optimization, proposes local algorithms, and gives convergence rates."
}