{
    "title": "Extending Cross-Modal Retrieval with Interactive Learning to Improve Image Retrieval Performance in Forensics. (arXiv:2308.14786v1 [cs.IR])",
    "abstract": "Nowadays, one of the critical challenges in forensics is analyzing the enormous amounts of unstructured digital evidence, such as images. Often, unstructured digital evidence contains precious information for forensic investigations. Therefore, a retrieval system that can effectively identify forensically relevant images is paramount. In this work, we explored the effectiveness of interactive learning in improving image retrieval performance in the forensic domain by proposing Excalibur - a zero-shot cross-modal image retrieval system extended with interactive learning. Excalibur was evaluated using both simulations and a user study. The simulations reveal that interactive learning is highly effective in improving retrieval performance in the forensic domain. Furthermore, user study participants could effectively leverage the power of interactive learning. Finally, they considered Excalibur effective and straightforward to use and expressed interest in using it in their daily practice.",
    "link": "http://arxiv.org/abs/2308.14786",
    "context": "Title: Extending Cross-Modal Retrieval with Interactive Learning to Improve Image Retrieval Performance in Forensics. (arXiv:2308.14786v1 [cs.IR])\nAbstract: Nowadays, one of the critical challenges in forensics is analyzing the enormous amounts of unstructured digital evidence, such as images. Often, unstructured digital evidence contains precious information for forensic investigations. Therefore, a retrieval system that can effectively identify forensically relevant images is paramount. In this work, we explored the effectiveness of interactive learning in improving image retrieval performance in the forensic domain by proposing Excalibur - a zero-shot cross-modal image retrieval system extended with interactive learning. Excalibur was evaluated using both simulations and a user study. The simulations reveal that interactive learning is highly effective in improving retrieval performance in the forensic domain. Furthermore, user study participants could effectively leverage the power of interactive learning. Finally, they considered Excalibur effective and straightforward to use and expressed interest in using it in their daily practice.",
    "path": "papers/23/08/2308.14786.json",
    "total_tokens": 872,
    "translated_title": "在执法学中通过交互式学习扩展跨模态检索以提高图像检索性能",
    "translated_abstract": "如今，在执法学中面临的关键挑战之一是分析大量的非结构化数字证据，例如图像。往往，非结构化数字证据包含了执法调查中宝贵的信息。因此，一个能够有效识别与执法相关图像的检索系统至关重要。在这项工作中，我们通过提出名为Excalibur的零样本跨模态图像检索系统，探索了交互式学习在提高执法学中图像检索性能方面的有效性。Excalibur通过模拟和用户研究进行了评估。模拟结果表明，交互式学习在执法学中提高检索性能方面非常有效。此外，用户研究参与者能够有效地利用交互式学习的力量。最后，他们认为Excalibur易于使用且有效，并对将其应用于日常实践表达了兴趣。",
    "tldr": "本研究通过提出名为Excalibur的零样本跨模态图像检索系统，探索了交互式学习在提高执法学中图像检索性能方面的有效性，并通过模拟和用户研究证明了其显著的改进效果。"
}