{
    "title": "A Large Language Model Enhanced Conversational Recommender System. (arXiv:2308.06212v1 [cs.IR])",
    "abstract": "Conversational recommender systems (CRSs) aim to recommend high-quality items to users through a dialogue interface. It usually contains multiple sub-tasks, such as user preference elicitation, recommendation, explanation, and item information search. To develop effective CRSs, there are some challenges: 1) how to properly manage sub-tasks; 2) how to effectively solve different sub-tasks; and 3) how to correctly generate responses that interact with users. Recently, Large Language Models (LLMs) have exhibited an unprecedented ability to reason and generate, presenting a new opportunity to develop more powerful CRSs. In this work, we propose a new LLM-based CRS, referred to as LLMCRS, to address the above challenges. For sub-task management, we leverage the reasoning ability of LLM to effectively manage sub-task. For sub-task solving, we collaborate LLM with expert models of different sub-tasks to achieve the enhanced performance. For response generation, we utilize the generation abili",
    "link": "http://arxiv.org/abs/2308.06212",
    "context": "Title: A Large Language Model Enhanced Conversational Recommender System. (arXiv:2308.06212v1 [cs.IR])\nAbstract: Conversational recommender systems (CRSs) aim to recommend high-quality items to users through a dialogue interface. It usually contains multiple sub-tasks, such as user preference elicitation, recommendation, explanation, and item information search. To develop effective CRSs, there are some challenges: 1) how to properly manage sub-tasks; 2) how to effectively solve different sub-tasks; and 3) how to correctly generate responses that interact with users. Recently, Large Language Models (LLMs) have exhibited an unprecedented ability to reason and generate, presenting a new opportunity to develop more powerful CRSs. In this work, we propose a new LLM-based CRS, referred to as LLMCRS, to address the above challenges. For sub-task management, we leverage the reasoning ability of LLM to effectively manage sub-task. For sub-task solving, we collaborate LLM with expert models of different sub-tasks to achieve the enhanced performance. For response generation, we utilize the generation abili",
    "path": "papers/23/08/2308.06212.json",
    "total_tokens": 887,
    "translated_title": "一个基于大型语言模型的增强对话推荐系统",
    "translated_abstract": "对话推荐系统旨在通过对话界面向用户推荐高质量的物品。它通常包含多个子任务，如用户偏好获取、推荐、解释和物品信息搜索。为了开发有效的对话推荐系统，面临一些挑战：1）如何正确管理子任务；2）如何有效解决不同的子任务；3）如何正确生成与用户交互的回应。最近，大型语言模型展示了前所未有的推理和生成能力，为开发更强大的对话推荐系统提供了新的机会。在这项工作中，我们提出了一种新的基于大型语言模型的对话推荐系统，称为LLMCRS，来解决上述挑战。在子任务管理方面，我们利用大型语言模型的推理能力来有效地管理子任务。在子任务解决方面，我们将大型语言模型与不同子任务的专家模型相结合，实现了增强性能。在回应生成方面，我们利用生成能力来生成回应。",
    "tldr": "一种基于大型语言模型的增强对话推荐系统，通过利用大型语言模型的推理和生成能力，有效地管理子任务、解决不同的子任务，并生成与用户交互的回应。",
    "en_tdlr": "A large language model enhanced conversational recommender system, which effectively manages sub-tasks, solves different sub-tasks, and generates interactive responses by leveraging the reasoning and generation abilities of large language models."
}