{
    "title": "Path convergence of Markov chains on large graphs. (arXiv:2308.09214v1 [math.PR])",
    "abstract": "We consider two classes of natural stochastic processes on finite unlabeled graphs. These are Euclidean stochastic optimization algorithms on the adjacency matrix of weighted graphs and a modified version of the Metropolis MCMC algorithm on stochastic block models over unweighted graphs. In both cases we show that, as the size of the graph goes to infinity, the random trajectories of the stochastic processes converge to deterministic limits. These deterministic limits are curves on the space of measure-valued graphons. Measure-valued graphons, introduced by Lov\\'{a}sz and Szegedy, are a refinement of the concept of graphons that can distinguish between two infinite exchangeable arrays that give rise to the same graphon limit. We introduce new metrics on this space which provide us with a natural notion of convergence for our limit theorems. This notion is equivalent to the convergence of infinite-exchangeable arrays. Under a suitable time-scaling, the Metropolis chain admits a diffusio",
    "link": "http://arxiv.org/abs/2308.09214",
    "context": "Title: Path convergence of Markov chains on large graphs. (arXiv:2308.09214v1 [math.PR])\nAbstract: We consider two classes of natural stochastic processes on finite unlabeled graphs. These are Euclidean stochastic optimization algorithms on the adjacency matrix of weighted graphs and a modified version of the Metropolis MCMC algorithm on stochastic block models over unweighted graphs. In both cases we show that, as the size of the graph goes to infinity, the random trajectories of the stochastic processes converge to deterministic limits. These deterministic limits are curves on the space of measure-valued graphons. Measure-valued graphons, introduced by Lov\\'{a}sz and Szegedy, are a refinement of the concept of graphons that can distinguish between two infinite exchangeable arrays that give rise to the same graphon limit. We introduce new metrics on this space which provide us with a natural notion of convergence for our limit theorems. This notion is equivalent to the convergence of infinite-exchangeable arrays. Under a suitable time-scaling, the Metropolis chain admits a diffusio",
    "path": "papers/23/08/2308.09214.json",
    "total_tokens": 908,
    "translated_title": "大图上马尔可夫链的路径收敛性",
    "translated_abstract": "我们研究了有限无标度图上的两类自然随机过程。这些过程包括在加权图的邻接矩阵上的欧几里德随机优化算法以及在无权图上的Metropolis MCMC算法的改进版本。在这两种情况下，我们证明随着图的规模趋近于无穷大，随机过程的随机轨迹收敛于确定性极限。这些确定性极限是测度值图上的曲线。由Lov\\'{a}sz和Szegedy引入的测度值图是图构架概念的细化，能够区分使得相同图构架极限的两个无穷可交换数组。我们在这个空间上引入了新的度量，为我们的极限定理提供了自然的收敛概念。这个概念等价于无穷可交换数组的收敛。在适当的时间缩放下，Metropolis链具有扩散属性。",
    "tldr": "本文研究了大图上的马尔可夫链收敛性。通过研究欧几里德随机优化算法和Metropolis MCMC算法的改进版本在图上的表现，我们得出了随着图大小趋近于无穷大，随机过程的轨迹会收敛到确定性极限的结论。这些极限是测度值图上的曲线，通过引入新的度量，在这个空间中提供了自然的收敛概念。"
}