{
    "title": "More Than Meets the Eye: Analyzing Anesthesiologists' Visual Attention in the Operating Room Using Deep Learning Models. (arXiv:2308.05501v1 [cs.AI])",
    "abstract": "Patient's vital signs, which are displayed on monitors, make the anesthesiologist's visual attention (VA) a key component in the safe management of patients under general anesthesia; moreover, the distribution of said VA and the ability to acquire specific cues throughout the anesthetic, may have a direct impact on patient's outcome. Currently, most studies employ wearable eye-tracking technologies to analyze anesthesiologists' visual patterns. Albeit being able to produce meticulous data, wearable devices are not a sustainable solution for large-scale or long-term use for data collection in the operating room (OR). Thus, by utilizing a novel eye-tracking method in the form of deep learning models that process monitor-mounted webcams, we collected continuous behavioral data and gained insight into the anesthesiologist's VA distribution with minimal disturbance to their natural workflow. In this study, we collected OR video recordings using the proposed framework and compared different ",
    "link": "http://arxiv.org/abs/2308.05501",
    "context": "Title: More Than Meets the Eye: Analyzing Anesthesiologists' Visual Attention in the Operating Room Using Deep Learning Models. (arXiv:2308.05501v1 [cs.AI])\nAbstract: Patient's vital signs, which are displayed on monitors, make the anesthesiologist's visual attention (VA) a key component in the safe management of patients under general anesthesia; moreover, the distribution of said VA and the ability to acquire specific cues throughout the anesthetic, may have a direct impact on patient's outcome. Currently, most studies employ wearable eye-tracking technologies to analyze anesthesiologists' visual patterns. Albeit being able to produce meticulous data, wearable devices are not a sustainable solution for large-scale or long-term use for data collection in the operating room (OR). Thus, by utilizing a novel eye-tracking method in the form of deep learning models that process monitor-mounted webcams, we collected continuous behavioral data and gained insight into the anesthesiologist's VA distribution with minimal disturbance to their natural workflow. In this study, we collected OR video recordings using the proposed framework and compared different ",
    "path": "papers/23/08/2308.05501.json",
    "total_tokens": 922,
    "translated_title": "超乎寻常的眼观六路：利用深度学习模型分析手术室中麻醉师的视觉注意力",
    "translated_abstract": "患者的生命体征在监视器上显示，麻醉师的视觉注意力是安全管理全麻患者的关键组成部分；此外，视觉注意力的分布和在全程麻醉过程中获取特定线索的能力可能直接影响患者的结果。目前，大多数研究使用可穿戴的眼动追踪技术来分析麻醉师的视觉模式。虽然能够产生详细的数据，但可穿戴设备对于手术室中的大规模或长期数据收集并不可持续。因此，通过利用深度学习模型处理以监视器为基础的网络摄像头，我们使用了一种新颖的眼动追踪方法，收集连续的行为数据，并在最小干扰下了解麻醉师的视觉注意力分布。在本研究中，我们使用提出的框架收集手术室的视频录像，并比较了不同的方法。",
    "tldr": "使用深度学习模型分析手术室中麻醉师的视觉注意力分布，通过处理监视器装置的摄像头收集连续的行为数据，以及比较了不同的方法。"
}