{
    "title": "Uncovering Promises and Challenges of Federated Learning to Detect Cardiovascular Diseases: A Scoping Literature Review. (arXiv:2308.13714v1 [cs.LG])",
    "abstract": "Cardiovascular diseases (CVD) are the leading cause of death globally, and early detection can significantly improve outcomes for patients. Machine learning (ML) models can help diagnose CVDs early, but their performance is limited by the data available for model training. Privacy concerns in healthcare make it harder to acquire data to train accurate ML models. Federated learning (FL) is an emerging approach to machine learning that allows models to be trained on data from multiple sources without compromising the privacy of the individual data owners. This survey paper provides an overview of the current state-of-the-art in FL for CVD detection. We review the different FL models proposed in various papers and discuss their advantages and challenges. We also compare FL with traditional centralized learning approaches and highlight the differences in terms of model accuracy, privacy, and data distribution handling capacity. Finally, we provide a critical analysis of FL's current challe",
    "link": "http://arxiv.org/abs/2308.13714",
    "context": "Title: Uncovering Promises and Challenges of Federated Learning to Detect Cardiovascular Diseases: A Scoping Literature Review. (arXiv:2308.13714v1 [cs.LG])\nAbstract: Cardiovascular diseases (CVD) are the leading cause of death globally, and early detection can significantly improve outcomes for patients. Machine learning (ML) models can help diagnose CVDs early, but their performance is limited by the data available for model training. Privacy concerns in healthcare make it harder to acquire data to train accurate ML models. Federated learning (FL) is an emerging approach to machine learning that allows models to be trained on data from multiple sources without compromising the privacy of the individual data owners. This survey paper provides an overview of the current state-of-the-art in FL for CVD detection. We review the different FL models proposed in various papers and discuss their advantages and challenges. We also compare FL with traditional centralized learning approaches and highlight the differences in terms of model accuracy, privacy, and data distribution handling capacity. Finally, we provide a critical analysis of FL's current challe",
    "path": "papers/23/08/2308.13714.json",
    "total_tokens": 1033,
    "translated_title": "揭示联邦学习在心血管疾病检测中的优势与挑战：一个综述文献回顾",
    "translated_abstract": "心血管疾病是全球死亡的主要原因，早期检测可显著改善患者的预后。机器学习模型可以帮助早期诊断心血管疾病，但其性能受限于用于模型训练的数据。医疗保护隐私的隐私问题使得获取准确的机器学习模型训练数据更加困难。联邦学习是一种新兴的机器学习方法，它允许在不损害个体数据所有者隐私的情况下训练模型使用来自多个数据源的数据。本综述文献提供了联邦学习在心血管疾病检测中的现状概述。我们回顾了在各种论文中提出的不同联邦学习模型，并讨论了它们的优势和挑战。我们还将联邦学习与传统的集中式学习方法进行了比较，并在模型准确性、隐私和数据分布处理能力等方面突出了差异。最后，我们对联邦学习目前面临的挑战进行了批判性分析。",
    "tldr": "该论文综述了联邦学习在心血管疾病检测中的应用现状，并讨论了其优势和挑战。研究比较了联邦学习与传统集中式学习方法的模型准确性、隐私和数据分布处理能力。最后，提供了对联邦学习当前挑战的批判性分析。",
    "en_tdlr": "This paper provides an overview of the current state-of-the-art in federated learning for cardiovascular disease detection, comparing it with traditional centralized learning approaches. The study highlights the advantages and challenges of federated learning and provides a critical analysis of its current challenges."
}