{
    "title": "Machine Unlearning for Causal Inference. (arXiv:2308.13559v1 [cs.LG])",
    "abstract": "Machine learning models play a vital role in making predictions and deriving insights from data and are being increasingly used for causal inference. To preserve user privacy, it is important to enable the model to forget some of its learning/captured information about a given user (machine unlearning). This paper introduces the concept of machine unlearning for causal inference, particularly propensity score matching and treatment effect estimation, which aims to refine and improve the performance of machine learning models for causal analysis given the above unlearning requirements. The paper presents a methodology for machine unlearning using a neural network-based propensity score model. The dataset used in the study is the Lalonde dataset, a widely used dataset for evaluating the effectiveness i.e. the treatment effect of job training programs. The methodology involves training an initial propensity score model on the original dataset and then creating forget sets by selectively r",
    "link": "http://arxiv.org/abs/2308.13559",
    "context": "Title: Machine Unlearning for Causal Inference. (arXiv:2308.13559v1 [cs.LG])\nAbstract: Machine learning models play a vital role in making predictions and deriving insights from data and are being increasingly used for causal inference. To preserve user privacy, it is important to enable the model to forget some of its learning/captured information about a given user (machine unlearning). This paper introduces the concept of machine unlearning for causal inference, particularly propensity score matching and treatment effect estimation, which aims to refine and improve the performance of machine learning models for causal analysis given the above unlearning requirements. The paper presents a methodology for machine unlearning using a neural network-based propensity score model. The dataset used in the study is the Lalonde dataset, a widely used dataset for evaluating the effectiveness i.e. the treatment effect of job training programs. The methodology involves training an initial propensity score model on the original dataset and then creating forget sets by selectively r",
    "path": "papers/23/08/2308.13559.json",
    "total_tokens": 882,
    "translated_title": "机器去学习用于因果推断的方法",
    "translated_abstract": "机器学习模型在预测和从数据中得出洞察力方面起着关键作用，并且越来越多地被用于因果推断。为了保护用户隐私，使模型能够忘记有关给定用户的一些学习/捕捉到的信息是很重要的（机器去学习）。本文介绍了用于因果推断的机器去学习的概念，特别是倾向得分匹配和处理效应估计，旨在在满足上述去学习要求的前提下，改进和提高机器学习模型进行因果分析的性能。本文提出了一种基于神经网络的倾向得分模型的机器去学习方法。研究中使用的数据集是Lalonde数据集，这是一个广泛用于评估职业培训计划的有效性（即处理效应）的数据集。该方法涉及在原始数据集上训练初始倾向得分模型，然后通过选择性地创建遗忘集来进行机器去学习。",
    "tldr": "本文介绍了一种机器去学习的方法，用于因果推断中的倾向得分匹配和处理效应估计。研究使用Lalonde数据集，通过神经网络模型进行机器去学习以提高因果分析的性能。"
}