{
    "title": "Improving Probabilistic Bisimulation for MDPs Using Machine Learning. (arXiv:2308.02519v1 [cs.LO])",
    "abstract": "The utilization of model checking has been suggested as a formal verification technique for analyzing critical systems. However, the primary challenge in applying to complex systems is state space explosion problem. To address this issue, bisimulation minimization has emerged as a prominent method for reducing the number of states in a labeled transition system, aiming to overcome the difficulties associated with the state space explosion problem. In the case of systems exhibiting stochastic behaviors, probabilistic bisimulation is employed to minimize a given model, obtaining its equivalent form with fewer states. Recently, various techniques have been introduced to decrease the time complexity of the iterative methods used to compute probabilistic bisimulation for stochastic systems that display nondeterministic behaviors. In this paper, we propose a new technique to partition the state space of a given probabilistic model to its bisimulation classes. This technique uses the PRISM pr",
    "link": "http://arxiv.org/abs/2308.02519",
    "context": "Title: Improving Probabilistic Bisimulation for MDPs Using Machine Learning. (arXiv:2308.02519v1 [cs.LO])\nAbstract: The utilization of model checking has been suggested as a formal verification technique for analyzing critical systems. However, the primary challenge in applying to complex systems is state space explosion problem. To address this issue, bisimulation minimization has emerged as a prominent method for reducing the number of states in a labeled transition system, aiming to overcome the difficulties associated with the state space explosion problem. In the case of systems exhibiting stochastic behaviors, probabilistic bisimulation is employed to minimize a given model, obtaining its equivalent form with fewer states. Recently, various techniques have been introduced to decrease the time complexity of the iterative methods used to compute probabilistic bisimulation for stochastic systems that display nondeterministic behaviors. In this paper, we propose a new technique to partition the state space of a given probabilistic model to its bisimulation classes. This technique uses the PRISM pr",
    "path": "papers/23/08/2308.02519.json",
    "total_tokens": 773,
    "translated_title": "使用机器学习改进MDPs的概率双向建模",
    "translated_abstract": "模型检验被提议作为一种形式化验证技术，用于分析关键系统。然而，在应用于复杂系统时，最大的挑战是状态空间爆炸问题。为了解决这个问题，双向最小化已经成为一种主要方法，用于减少带标记的转换系统中的状态数，旨在克服与状态空间爆炸问题相关的困难。对于具有随机行为的系统，采用概率双向建模来最小化给定模型，从而获得具有较少状态的等效形式。最近，引入了各种技术来降低用于计算具有非确定性行为的随机系统的概率双向建模的迭代方法的时间复杂度。在本文中，我们提出了一种新的技术，将给定概率模型的状态空间划分为其双向建模类。",
    "tldr": "本文提出了一种使用机器学习改进MDPs的概率双向建模的新技术。"
}