{
    "title": "Vector Autoregression in Cryptocurrency Markets: Unraveling Complex Causal Networks. (arXiv:2308.15769v1 [physics.soc-ph])",
    "abstract": "Methodologies to infer financial networks from the price series of speculative assets vary, however, they generally involve bivariate or multivariate predictive modelling to reveal causal and correlational structures within the time series data. The required model complexity intimately relates to the underlying market efficiency, where one expects a highly developed and efficient market to display very few simple relationships in price data. This has spurred research into the applications of complex nonlinear models for developed markets. However, it remains unclear if simple models can provide meaningful and insightful descriptions of the dependency and interconnectedness of the rapidly developed cryptocurrency market. Here we show that multivariate linear models can create informative cryptocurrency networks that reflect economic intuition, and demonstrate the importance of high-influence nodes. The resulting network confirms that node degree, a measure of influence, is significantly",
    "link": "http://arxiv.org/abs/2308.15769",
    "context": "Title: Vector Autoregression in Cryptocurrency Markets: Unraveling Complex Causal Networks. (arXiv:2308.15769v1 [physics.soc-ph])\nAbstract: Methodologies to infer financial networks from the price series of speculative assets vary, however, they generally involve bivariate or multivariate predictive modelling to reveal causal and correlational structures within the time series data. The required model complexity intimately relates to the underlying market efficiency, where one expects a highly developed and efficient market to display very few simple relationships in price data. This has spurred research into the applications of complex nonlinear models for developed markets. However, it remains unclear if simple models can provide meaningful and insightful descriptions of the dependency and interconnectedness of the rapidly developed cryptocurrency market. Here we show that multivariate linear models can create informative cryptocurrency networks that reflect economic intuition, and demonstrate the importance of high-influence nodes. The resulting network confirms that node degree, a measure of influence, is significantly",
    "path": "papers/23/08/2308.15769.json",
    "total_tokens": 788,
    "translated_title": "加密货币市场中的向量自回归：揭示复杂因果网络",
    "translated_abstract": "从投机资产价格序列中推断金融网络的方法因其揭示时间序列数据中的因果和相关结构而有所不同，然而，它们通常涉及双变量或多变量预测建模。所需的模型复杂性密切相关于市场效率，即一个高度发达和高效的市场在价格数据中显示出很少的简单关系。这推动了对复杂非线性模型在发达市场的应用的研究。然而，目前尚不清楚简单模型是否能够提供有意义和有见地的描述迅速发展的加密货币市场的依赖性和相互关联性。在这里，我们展示了多变量线性模型可以创建反映经济直觉的信息性加密货币网络，并展示了高影响节点的重要性。所得网络证实了节点度数作为一个影响度量是显著的。",
    "tldr": "通过多变量线性模型，我们证明可以建立反映经济直觉的加密货币网络，并展示高影响节点的重要性。"
}