{
    "title": "Machine Learning-based Positioning using Multivariate Time Series Classification for Factory Environments. (arXiv:2308.11670v1 [eess.SP])",
    "abstract": "Indoor Positioning Systems (IPS) gained importance in many industrial applications. State-of-the-art solutions heavily rely on external infrastructures and are subject to potential privacy compromises, external information requirements, and assumptions, that make it unfavorable for environments demanding privacy and prolonged functionality. In certain environments deploying supplementary infrastructures for indoor positioning could be infeasible and expensive. Recent developments in machine learning (ML) offer solutions to address these limitations relying only on the data from onboard sensors of IoT devices. However, it is unclear which model fits best considering the resource constraints of IoT devices. This paper presents a machine learning-based indoor positioning system, using motion and ambient sensors, to localize a moving entity in privacy concerned factory environments. The problem is formulated as a multivariate time series classification (MTSC) and a comparative analysis of ",
    "link": "http://arxiv.org/abs/2308.11670",
    "context": "Title: Machine Learning-based Positioning using Multivariate Time Series Classification for Factory Environments. (arXiv:2308.11670v1 [eess.SP])\nAbstract: Indoor Positioning Systems (IPS) gained importance in many industrial applications. State-of-the-art solutions heavily rely on external infrastructures and are subject to potential privacy compromises, external information requirements, and assumptions, that make it unfavorable for environments demanding privacy and prolonged functionality. In certain environments deploying supplementary infrastructures for indoor positioning could be infeasible and expensive. Recent developments in machine learning (ML) offer solutions to address these limitations relying only on the data from onboard sensors of IoT devices. However, it is unclear which model fits best considering the resource constraints of IoT devices. This paper presents a machine learning-based indoor positioning system, using motion and ambient sensors, to localize a moving entity in privacy concerned factory environments. The problem is formulated as a multivariate time series classification (MTSC) and a comparative analysis of ",
    "path": "papers/23/08/2308.11670.json",
    "total_tokens": 853,
    "translated_title": "使用多元时间序列分类的基于机器学习的工厂环境定位系统",
    "translated_abstract": "室内定位系统在许多工业应用中变得越来越重要。现有解决方案严重依赖于外部基础设施，可能涉及潜在的隐私妥协、外部信息要求和假设，这使得这些解决方案对于需要保护隐私和延长功能的环境不利。在某些环境中，部署辅助基础设施进行室内定位可能是不可行和昂贵的。机器学习的最新发展提供了解决这些限制的方案，仅依靠物联网设备的内部传感器数据。然而，针对物联网设备的资源限制，目前还不清楚哪种模型最合适。本文提出了一种基于机器学习的室内定位系统，使用运动和环境传感器，在关注隐私的工厂环境中定位移动实体。该问题被构建为多元时间序列分类 (MTSC)，并进行了比较分析。",
    "tldr": "本文提出了一种基于机器学习的室内定位系统，使用多元时间序列分类，通过IoT设备的内部传感器数据实现在工厂环境中定位移动实体。",
    "en_tdlr": "This paper proposes a machine learning-based indoor positioning system using multivariate time series classification, which leverages onboard sensors of IoT devices for locating moving entities in factory environments where privacy is a concern."
}