{
    "title": "The Cycle of Value The Cycle of Value -- A Conservationist Approach to Economics. (arXiv:2308.07185v1 [econ.GN])",
    "abstract": "A representation of economic activity in the form of a law of conservation of value is presented based on the definition of value as potential to act in an environment. This allows the encapsulation of the term as a conserved quantity throughout transactions. Marginal value and speed of marginal value are defined as derivatives of value and marginal value, respectively. Traditional economic statements are represented here as cycles of value where value is conserved. Producer-consumer dyads, shortage and surplus, as well as the role of the value in representing the market and the economy are explored. The role of the government in the economy is also explained through the cycles of value the government is involved in. Traditional economic statements and assumptions produce existing hypotheses as outcomes of the law of conservation of value.",
    "link": "http://arxiv.org/abs/2308.07185",
    "context": "Title: The Cycle of Value The Cycle of Value -- A Conservationist Approach to Economics. (arXiv:2308.07185v1 [econ.GN])\nAbstract: A representation of economic activity in the form of a law of conservation of value is presented based on the definition of value as potential to act in an environment. This allows the encapsulation of the term as a conserved quantity throughout transactions. Marginal value and speed of marginal value are defined as derivatives of value and marginal value, respectively. Traditional economic statements are represented here as cycles of value where value is conserved. Producer-consumer dyads, shortage and surplus, as well as the role of the value in representing the market and the economy are explored. The role of the government in the economy is also explained through the cycles of value the government is involved in. Traditional economic statements and assumptions produce existing hypotheses as outcomes of the law of conservation of value.",
    "path": "papers/23/08/2308.07185.json",
    "total_tokens": 861,
    "translated_title": "价值的循环——一种保护主义经济学方法的价值循环",
    "translated_abstract": "提出了以价值定义为环境中行动的潜力，并将其作为交易中保持不变的量的经济活动的表示。定义价值和边际价值的速度作为价值和边际价值的导数。将传统经济陈述表示为价值循环，其中价值得到保护。探讨了生产者-消费者二元对、短缺和过剩以及价值在代表市场和经济方面的角色。通过参与价值循环的角色来解释政府在经济中的作用。传统的经济陈述和假设根据价值守恒法则产生现有的假设。",
    "tldr": "本论文提出了一种以价值定义为环境中行动的潜力，并将其视为交易中保持不变的量的经济活动表示。研究了生产者-消费者关系、短缺和过剩等与价值相关的概念，并探讨了市场和经济中价值的角色。通过研究价值循环，解释了政府在经济中的作用和传统经济理论的假设。",
    "en_tdlr": "This paper presents an economic representation based on the potential of value as actions in the environment and considers it as a conserved quantity in transactions. It explores concepts such as producer-consumer relationships, shortage and surplus, and the role of value in the market and economy. By studying the cycles of value, it explains the role of the government in the economy and the hypotheses produced by traditional economic theories."
}