{
    "title": "Alternative Pseudo-Labeling for Semi-Supervised Automatic Speech Recognition. (arXiv:2308.06547v1 [eess.AS])",
    "abstract": "When labeled data is insufficient, semi-supervised learning with the pseudo-labeling technique can significantly improve the performance of automatic speech recognition. However, pseudo-labels are often noisy, containing numerous incorrect tokens. Taking noisy labels as ground-truth in the loss function results in suboptimal performance. Previous works attempted to mitigate this issue by either filtering out the nosiest pseudo-labels or improving the overall quality of pseudo-labels. While these methods are effective to some extent, it is unrealistic to entirely eliminate incorrect tokens in pseudo-labels. In this work, we propose a novel framework named alternative pseudo-labeling to tackle the issue of noisy pseudo-labels from the perspective of the training objective. The framework comprises several components. Firstly, a generalized CTC loss function is introduced to handle noisy pseudo-labels by accepting alternative tokens in the positions of incorrect tokens. Applying this loss ",
    "link": "http://arxiv.org/abs/2308.06547",
    "context": "Title: Alternative Pseudo-Labeling for Semi-Supervised Automatic Speech Recognition. (arXiv:2308.06547v1 [eess.AS])\nAbstract: When labeled data is insufficient, semi-supervised learning with the pseudo-labeling technique can significantly improve the performance of automatic speech recognition. However, pseudo-labels are often noisy, containing numerous incorrect tokens. Taking noisy labels as ground-truth in the loss function results in suboptimal performance. Previous works attempted to mitigate this issue by either filtering out the nosiest pseudo-labels or improving the overall quality of pseudo-labels. While these methods are effective to some extent, it is unrealistic to entirely eliminate incorrect tokens in pseudo-labels. In this work, we propose a novel framework named alternative pseudo-labeling to tackle the issue of noisy pseudo-labels from the perspective of the training objective. The framework comprises several components. Firstly, a generalized CTC loss function is introduced to handle noisy pseudo-labels by accepting alternative tokens in the positions of incorrect tokens. Applying this loss ",
    "path": "papers/23/08/2308.06547.json",
    "total_tokens": 1016,
    "translated_title": "半监督自动语音识别的替代伪标签方法",
    "translated_abstract": "当标记数据不足时，使用伪标签技术的半监督学习可以显著提高自动语音识别的性能。然而，伪标签通常包含许多错误的标记，将噪声标签视为损失函数中的真实标记会导致次优性能。先前的研究尝试通过过滤最嘈杂的伪标签或提高伪标签的整体质量来缓解这个问题。虽然这些方法在一定程度上是有效的，但完全消除伪标签中的错误标记是不现实的。在本工作中，我们提出了一种名为替代伪标签的新框架，以从训练目标的角度解决嘈杂伪标签的问题。该框架包括几个组成部分。首先，引入了广义的CTC损失函数来处理噪声伪标签，接受在错误标记的位置上的替代标记。然后，在训练过程中使用自适应伪标签更新策略，不仅能减轻伪标签的噪声，还可以帮助模型收敛到更好的结果。最后，通过自适应伪标签消融正则化来加强模型的泛化能力，并进一步提高性能。",
    "tldr": "本论文提出了一种称为替代伪标签的半监督学习框架，以解决伪标签噪声的问题。通过引入广义的CTC损失函数处理噪声伪标签，并使用自适应伪标签更新策略和消融正则化来改进模型的性能和泛化能力。"
}