{
    "title": "Tirtha -- An Automated Platform to Crowdsource Images and Create 3D Models of Heritage Sites. (arXiv:2308.01246v1 [cs.CV])",
    "abstract": "Digital preservation of Cultural Heritage (CH) sites is crucial to protect them against damage from natural disasters or human activities. Creating 3D models of CH sites has become a popular method of digital preservation thanks to advancements in computer vision and photogrammetry. However, the process is time-consuming, expensive, and typically requires specialized equipment and expertise, posing challenges in resource-limited developing countries. Additionally, the lack of an open repository for 3D models hinders research and public engagement with their heritage. To address these issues, we propose Tirtha, a web platform for crowdsourcing images of CH sites and creating their 3D models. Tirtha utilizes state-of-the-art Structure from Motion (SfM) and Multi-View Stereo (MVS) techniques. It is modular, extensible and cost-effective, allowing for the incorporation of new techniques as photogrammetry advances. Tirtha is accessible through a web interface at https://tirtha.niser.ac.in a",
    "link": "http://arxiv.org/abs/2308.01246",
    "context": "Title: Tirtha -- An Automated Platform to Crowdsource Images and Create 3D Models of Heritage Sites. (arXiv:2308.01246v1 [cs.CV])\nAbstract: Digital preservation of Cultural Heritage (CH) sites is crucial to protect them against damage from natural disasters or human activities. Creating 3D models of CH sites has become a popular method of digital preservation thanks to advancements in computer vision and photogrammetry. However, the process is time-consuming, expensive, and typically requires specialized equipment and expertise, posing challenges in resource-limited developing countries. Additionally, the lack of an open repository for 3D models hinders research and public engagement with their heritage. To address these issues, we propose Tirtha, a web platform for crowdsourcing images of CH sites and creating their 3D models. Tirtha utilizes state-of-the-art Structure from Motion (SfM) and Multi-View Stereo (MVS) techniques. It is modular, extensible and cost-effective, allowing for the incorporation of new techniques as photogrammetry advances. Tirtha is accessible through a web interface at https://tirtha.niser.ac.in a",
    "path": "papers/23/08/2308.01246.json",
    "total_tokens": 986,
    "translated_title": "Tirtha -- 一个自动化平台，用于众包图像并创建历史遗址的三维模型",
    "translated_abstract": "数字化保存文化遗产（CH）遗址对于保护它们免受自然灾害或人类活动的损害至关重要。创建文化遗产遗址的三维模型已经成为数字化保存的流行方法，得益于计算机视觉和摄影测量的进展。然而，这个过程耗时、昂贵，并且通常需要专门的设备和专业知识，在资源有限的发展中国家存在挑战。此外，缺乏一个开放的三维模型存储库阻碍了对遗产的研究和公众参与。为了解决这些问题，我们提出了Tirtha，一个用于众包文化遗址图像和三维模型创建的网络平台。Tirtha利用了最先进的结构运动（SfM）和多视图立体（MVS）技术。它是模块化、可扩展和具有成本效益的，可以随着摄影测量的进展而引入新技术。Tirtha可以通过https://tirtha.niser.ac.in作为网页界面访问。",
    "tldr": "Tirtha是一个自动化平台，用于众包文化遗址的图像并创建它们的三维模型。这个平台利用了最先进的结构运动和多视图立体技术，具有模块化、可扩展和成本效益的特点，在资源有限的发展中国家具有重要意义。",
    "en_tdlr": "Tirtha is an automated platform for crowdsourcing images of cultural heritage sites and creating their 3D models. The platform utilizes state-of-the-art structure from motion and multi-view stereo techniques, and is modular, extensible, and cost-effective, making it significant in resource-limited developing countries."
}