{
    "title": "Dynamic Mode Decomposition for data-driven analysis and reduced-order modelling of ExB plasmas: II. dynamics forecasting. (arXiv:2308.13727v1 [physics.plasm-ph])",
    "abstract": "In part I of the article, we demonstrated that a variant of the Dynamic Mode Decomposition (DMD) algorithm based on variable projection optimization, called Optimized DMD (OPT-DMD), enables a robust identification of the dominant spatiotemporally coherent modes underlying the data across various test cases representing different physical parameters in an ExB simulation configuration. As the OPT-DMD can be constrained to produce stable reduced-order models (ROMs) by construction, in this paper, we extend the application of the OPT-DMD and investigate the capabilities of the linear ROM from this algorithm toward forecasting in time of the plasma dynamics in configurations representative of the radial-azimuthal and axial-azimuthal cross-sections of a Hall thruster and over a range of simulation parameters in each test case. The predictive capacity of the OPT-DMD ROM is assessed primarily in terms of short-term dynamics forecast or, in other words, for large ratios of training-to-test data",
    "link": "http://arxiv.org/abs/2308.13727",
    "context": "Title: Dynamic Mode Decomposition for data-driven analysis and reduced-order modelling of ExB plasmas: II. dynamics forecasting. (arXiv:2308.13727v1 [physics.plasm-ph])\nAbstract: In part I of the article, we demonstrated that a variant of the Dynamic Mode Decomposition (DMD) algorithm based on variable projection optimization, called Optimized DMD (OPT-DMD), enables a robust identification of the dominant spatiotemporally coherent modes underlying the data across various test cases representing different physical parameters in an ExB simulation configuration. As the OPT-DMD can be constrained to produce stable reduced-order models (ROMs) by construction, in this paper, we extend the application of the OPT-DMD and investigate the capabilities of the linear ROM from this algorithm toward forecasting in time of the plasma dynamics in configurations representative of the radial-azimuthal and axial-azimuthal cross-sections of a Hall thruster and over a range of simulation parameters in each test case. The predictive capacity of the OPT-DMD ROM is assessed primarily in terms of short-term dynamics forecast or, in other words, for large ratios of training-to-test data",
    "path": "papers/23/08/2308.13727.json",
    "total_tokens": 901,
    "translated_title": "动态模态分解用于基于数据驱动的ExB等离子体分析和降阶建模：II. 动力学预测。",
    "translated_abstract": "在第一部分的文章中，我们证明了一种基于变量投影优化的动态模态分解（DMD）算法的变种，称为优化DMD（OPT-DMD），能够在不同物理参数的ExB模拟配置中鲁棒地识别数据中潜在的时空相干模式。由于OPT-DMD可以通过构造被限制为产生稳定的降阶模型（ROMs），因此在本文中，我们扩展了OPT-DMD的应用，并研究了该算法中线性ROMs在类似于Hall推力器的径向-方位和轴向-方位截面以及每个测试案例的一系列模拟参数下预测等离子体动力学的能力。OPT-DMD ROM的预测能力主要通过短期动力学预测进行评估，或者换句话说，用于训练-测试数据比大的情况。",
    "tldr": "本文介绍了一种基于动态模态分解（DMD）算法的优化版本（OPT-DMD），用于分析ExB等离子体的数据驱动降阶建模，并评估了该算法在不同物理参数下预测等离子体动力学的能力。"
}