{
    "title": "DOLCE: A Descriptive Ontology for Linguistic and Cognitive Engineering. (arXiv:2308.01597v1 [cs.AI])",
    "abstract": "DOLCE, the first top-level (foundational) ontology to be axiomatized, has remained stable for twenty years and today is broadly used in a variety of domains. DOLCE is inspired by cognitive and linguistic considerations and aims to model a commonsense view of reality, like the one human beings exploit in everyday life in areas as diverse as socio-technical systems, manufacturing, financial transactions and cultural heritage. DOLCE clearly lists the ontological choices it is based upon, relies on philosophical principles, is richly formalized, and is built according to well-established ontological methodologies, e.g. OntoClean. Because of these features, it has inspired most of the existing top-level ontologies and has been used to develop or improve standards and public domain resources (e.g. CIDOC CRM, DBpedia and WordNet). Being a foundational ontology, DOLCE is not directly concerned with domain knowledge. Its purpose is to provide the general categories and relations needed to give ",
    "link": "http://arxiv.org/abs/2308.01597",
    "context": "Title: DOLCE: A Descriptive Ontology for Linguistic and Cognitive Engineering. (arXiv:2308.01597v1 [cs.AI])\nAbstract: DOLCE, the first top-level (foundational) ontology to be axiomatized, has remained stable for twenty years and today is broadly used in a variety of domains. DOLCE is inspired by cognitive and linguistic considerations and aims to model a commonsense view of reality, like the one human beings exploit in everyday life in areas as diverse as socio-technical systems, manufacturing, financial transactions and cultural heritage. DOLCE clearly lists the ontological choices it is based upon, relies on philosophical principles, is richly formalized, and is built according to well-established ontological methodologies, e.g. OntoClean. Because of these features, it has inspired most of the existing top-level ontologies and has been used to develop or improve standards and public domain resources (e.g. CIDOC CRM, DBpedia and WordNet). Being a foundational ontology, DOLCE is not directly concerned with domain knowledge. Its purpose is to provide the general categories and relations needed to give ",
    "path": "papers/23/08/2308.01597.json",
    "total_tokens": 987,
    "translated_title": "DOLCE：用于语言和认知工程的描述性本体论",
    "translated_abstract": "DOLCE是第一个被公理化的顶层（基础性）本体论，在过去的20年中保持稳定，如今被广泛应用于各个领域。DOLCE受认知和语言考虑的启发，旨在建模人类在日常生活中利用的常识观点，涵盖领域包括社会技术系统、制造业、金融交易和文化遗产等各个方面。DOLCE清晰列出了它所基于的本体论选择，依赖于哲学原则，具有丰富的形式化，并根据良好建立的本体论方法（例如OntoClean）进行构建。由于这些特性，它是大多数现有顶层本体论的灵感来源，并已被用于开发或改进标准和公共领域资源（例如CIDOC CRM、DBpedia和WordNet）。作为基础性本体论，DOLCE并不直接涉及领域知识，其目的是提供提供一般的类别和关系，以提供给特定领域的具体知识建模的基础。",
    "tldr": "DOLCE是一种描述性本体论，具有广泛的应用领域。它基于认知和语言考虑，旨在建模人类在不同领域中的常识观点。DOLCE不直接涉及特定领域的知识，而是提供了一般的类别和关系，用于指导特定领域的知识建模。",
    "en_tdlr": "DOLCE is a descriptive ontology widely used in various domains. It is inspired by cognitive and linguistic considerations and aims to model the commonsense view of reality in different areas. DOLCE does not directly involve domain-specific knowledge, but provides general categories and relations to guide domain-specific knowledge modeling."
}