{
    "title": "SoTaNa: The Open-Source Software Development Assistant. (arXiv:2308.13416v1 [cs.SE])",
    "abstract": "Software development plays a crucial role in driving innovation and efficiency across modern societies. To meet the demands of this dynamic field, there is a growing need for an effective software development assistant. However, existing large language models represented by ChatGPT suffer from limited accessibility, including training data and model weights. Although other large open-source models like LLaMA have shown promise, they still struggle with understanding human intent. In this paper, we present SoTaNa, an open-source software development assistant. SoTaNa utilizes ChatGPT to generate high-quality instruction-based data for the domain of software engineering and employs a parameter-efficient fine-tuning approach to enhance the open-source foundation model, LLaMA. We evaluate the effectiveness of \\our{} in answering Stack Overflow questions and demonstrate its capabilities. Additionally, we discuss its capabilities in code summarization and generation, as well as the impact of",
    "link": "http://arxiv.org/abs/2308.13416",
    "context": "Title: SoTaNa: The Open-Source Software Development Assistant. (arXiv:2308.13416v1 [cs.SE])\nAbstract: Software development plays a crucial role in driving innovation and efficiency across modern societies. To meet the demands of this dynamic field, there is a growing need for an effective software development assistant. However, existing large language models represented by ChatGPT suffer from limited accessibility, including training data and model weights. Although other large open-source models like LLaMA have shown promise, they still struggle with understanding human intent. In this paper, we present SoTaNa, an open-source software development assistant. SoTaNa utilizes ChatGPT to generate high-quality instruction-based data for the domain of software engineering and employs a parameter-efficient fine-tuning approach to enhance the open-source foundation model, LLaMA. We evaluate the effectiveness of \\our{} in answering Stack Overflow questions and demonstrate its capabilities. Additionally, we discuss its capabilities in code summarization and generation, as well as the impact of",
    "path": "papers/23/08/2308.13416.json",
    "total_tokens": 795,
    "translated_title": "SoTaNa: 开源软件开发助手",
    "translated_abstract": "软件开发在推动现代社会的创新和效率方面起着关键作用。为满足这一动态领域的需求，迫切需要一种有效的软件开发助手。然而，现有的大型语言模型如ChatGPT存在训练数据和模型权重等可及性有限的问题。虽然像LLaMA这样的其他大型开源模型已显示出潜力，但它们仍然难以理解人类意图。在本文中，我们介绍了SoTaNa，一种开源软件开发助手。SoTaNa利用ChatGPT生成基于指导的高质量软件工程领域的数据，并采用参数高效微调方法来增强开源基础模型LLaMA。我们通过评估\\our{}在回答Stack Overflow问题方面的效果，并展示了其能力。此外，我们还讨论了它在代码摘要和生成方面的能力，以及其影响。",
    "tldr": "SoTaNa是一种开源软件开发助手，利用ChatGPT生成高质量数据并通过参数高效微调方法增强LLaMA模型。它在回答Stack Overflow问题和代码摘要和生成方面展示了出色的能力。"
}