{
    "title": "Extracting Relational Triples Based on Graph Recursive Neural Network via Dynamic Feedback Forest Algorithm. (arXiv:2308.11411v1 [cs.CL])",
    "abstract": "Extracting relational triples (subject, predicate, object) from text enables the transformation of unstructured text data into structured knowledge. The named entity recognition (NER) and the relation extraction (RE) are two foundational subtasks in this knowledge generation pipeline. The integration of subtasks poses a considerable challenge due to their disparate nature. This paper presents a novel approach that converts the triple extraction task into a graph labeling problem, capitalizing on the structural information of dependency parsing and graph recursive neural networks (GRNNs). To integrate subtasks, this paper proposes a dynamic feedback forest algorithm that connects the representations of subtasks by inference operations during model training. Experimental results demonstrate the effectiveness of the proposed method.",
    "link": "http://arxiv.org/abs/2308.11411",
    "context": "Title: Extracting Relational Triples Based on Graph Recursive Neural Network via Dynamic Feedback Forest Algorithm. (arXiv:2308.11411v1 [cs.CL])\nAbstract: Extracting relational triples (subject, predicate, object) from text enables the transformation of unstructured text data into structured knowledge. The named entity recognition (NER) and the relation extraction (RE) are two foundational subtasks in this knowledge generation pipeline. The integration of subtasks poses a considerable challenge due to their disparate nature. This paper presents a novel approach that converts the triple extraction task into a graph labeling problem, capitalizing on the structural information of dependency parsing and graph recursive neural networks (GRNNs). To integrate subtasks, this paper proposes a dynamic feedback forest algorithm that connects the representations of subtasks by inference operations during model training. Experimental results demonstrate the effectiveness of the proposed method.",
    "path": "papers/23/08/2308.11411.json",
    "total_tokens": 748,
    "translated_title": "基于图递归神经网络和动态反馈森林算法的关系三元组提取",
    "translated_abstract": "从文本中提取关系三元组（主体，谓词，客体）可以将非结构化文本数据转化为结构化知识。命名实体识别（NER）和关系抽取（RE）是知识生成流程中的两个基础子任务。由于它们的差异性，子任务的整合带来了相当大的挑战。本文提出了一种新的方法，将三元组提取任务转化为图标记问题，利用依赖解析和图递归神经网络（GRNN）的结构信息。为了整合子任务，本文提出了一种动态反馈森林算法，在模型训练期间通过推理操作连接子任务的表示。实验结果表明了所提方法的有效性。",
    "tldr": "本文提出了一种基于图递归神经网络和动态反馈森林算法的新方法，用于从文本中提取关系三元组，并成功通过实验证明了其有效性。",
    "en_tdlr": "This paper presents a novel approach based on graph recursive neural networks and dynamic feedback forest algorithm for extracting relational triples from text, and its effectiveness is successfully demonstrated through experiments."
}