{
    "title": "ML-Powered Index Tuning: An Overview of Recent Progress and Open Challenges. (arXiv:2308.13641v1 [cs.DB])",
    "abstract": "The scale and complexity of workloads in modern cloud services have brought into sharper focus a critical challenge in automated index tuning -- the need to recommend high-quality indexes while maintaining index tuning scalability. This challenge is further compounded by the requirement for automated index implementations to introduce minimal query performance regressions in production deployments, representing a significant barrier to achieving scalability and full automation. This paper directs attention to these challenges within automated index tuning and explores ways in which machine learning (ML) techniques provide new opportunities in their mitigation. In particular, we reflect on recent efforts in developing ML techniques for workload selection, candidate index filtering, speeding up index configuration search, reducing the amount of query optimizer calls, and lowering the chances of performance regressions. We highlight the key takeaways from these efforts and underline the g",
    "link": "http://arxiv.org/abs/2308.13641",
    "context": "Title: ML-Powered Index Tuning: An Overview of Recent Progress and Open Challenges. (arXiv:2308.13641v1 [cs.DB])\nAbstract: The scale and complexity of workloads in modern cloud services have brought into sharper focus a critical challenge in automated index tuning -- the need to recommend high-quality indexes while maintaining index tuning scalability. This challenge is further compounded by the requirement for automated index implementations to introduce minimal query performance regressions in production deployments, representing a significant barrier to achieving scalability and full automation. This paper directs attention to these challenges within automated index tuning and explores ways in which machine learning (ML) techniques provide new opportunities in their mitigation. In particular, we reflect on recent efforts in developing ML techniques for workload selection, candidate index filtering, speeding up index configuration search, reducing the amount of query optimizer calls, and lowering the chances of performance regressions. We highlight the key takeaways from these efforts and underline the g",
    "path": "papers/23/08/2308.13641.json",
    "total_tokens": 929,
    "translated_title": "通过机器学习进行索引调优：最新进展与开放挑战的概述",
    "translated_abstract": "现代云服务中工作负载的规模和复杂性使得自动索引调优面临着一个关键挑战——在保持索引调优可扩展性的同时推荐高质量的索引。这一挑战进一步受到自动索引实现在生产环境中引入最小查询性能回归的要求的影响，这构成了实现可扩展性和全自动化的重要障碍。本文关注自动索引调优中的这些挑战，并探讨机器学习技术在缓解这些挑战方面提供的新机遇。具体来说，我们回顾了在工作负载选择、候选索引过滤、加速索引配置搜索、减少查询优化器调用的数量以及降低性能回归机会方面开展的最新工作。我们强调这些工作的关键要点，并强调其创新与贡献。",
    "tldr": "本文总结了现代云服务中自动索引调优面临的主要挑战，以及机器学习技术在解决这些挑战方面的最新进展。该研究主要关注工作负载选择、候选索引过滤、加速索引配置搜索、减少查询优化器调用的数量和降低性能回归机会等方面，并提出创新的解决方案。",
    "en_tdlr": "This paper provides an overview of the main challenges in automated index tuning in modern cloud services and explores the latest progress in using machine learning techniques to address these challenges. The paper focuses on workload selection, candidate index filtering, speeding up index configuration search, reducing the amount of query optimizer calls, and lowering the chances of performance regressions, and proposes innovative solutions."
}