{
    "title": "Deontic Paradoxes in ASP with Weak Constraints. (arXiv:2308.15870v1 [cs.LO])",
    "abstract": "The rise of powerful AI technology for a range of applications that are sensitive to legal, social, and ethical norms demands decision-making support in presence of norms and regulations. Normative reasoning is the realm of deontic logics, that are challenged by well-known benchmark problems (deontic paradoxes), and lack efficient computational tools. In this paper, we use Answer Set Programming (ASP) for addressing these shortcomings and showcase how to encode and resolve several well-known deontic paradoxes utilizing weak constraints. By abstracting and generalizing this encoding, we present a methodology for translating normative systems in ASP with weak constraints. This methodology is applied to \"ethical\" versions of Pac-man, where we obtain a comparable performance with related works, but ethically preferable results.",
    "link": "http://arxiv.org/abs/2308.15870",
    "context": "Title: Deontic Paradoxes in ASP with Weak Constraints. (arXiv:2308.15870v1 [cs.LO])\nAbstract: The rise of powerful AI technology for a range of applications that are sensitive to legal, social, and ethical norms demands decision-making support in presence of norms and regulations. Normative reasoning is the realm of deontic logics, that are challenged by well-known benchmark problems (deontic paradoxes), and lack efficient computational tools. In this paper, we use Answer Set Programming (ASP) for addressing these shortcomings and showcase how to encode and resolve several well-known deontic paradoxes utilizing weak constraints. By abstracting and generalizing this encoding, we present a methodology for translating normative systems in ASP with weak constraints. This methodology is applied to \"ethical\" versions of Pac-man, where we obtain a comparable performance with related works, but ethically preferable results.",
    "path": "papers/23/08/2308.15870.json",
    "total_tokens": 834,
    "translated_title": "ASP中的弱约束下的道义悖论",
    "translated_abstract": "强大的人工智能技术的崛起使得对遵守法律、社会和伦理准则敏感的各种应用需求决策支持。道义推理是道义逻辑的领域，它面临着众所周知的基准问题（道义悖论），并且缺乏有效的计算工具。本文使用Answer Set Programming（ASP）来解决这些问题，并展示了如何使用弱约束对几个众所周知的道义悖论进行编码和解决。通过对这种编码进行抽象和概括，我们提出了一种在带有弱约束的ASP中翻译道义系统的方法论。我们将这种方法应用于\"道德\"版本的Pac-man，结果表明我们获得了与相关工作相当的性能，并且获得了道德上更可取的结果。",
    "tldr": "本文通过使用Answer Set Programming（ASP）和弱约束，解决了道义逻辑面临的悖论问题，并提出了一种方法来翻译带有弱约束的ASP中的道义系统，应用于\"道德\"版本的Pac-man取得了较好的结果。",
    "en_tdlr": "This paper addresses the deontic paradoxes in deontic logics by using Answer Set Programming (ASP) with weak constraints. It presents a methodology for translating normative systems in ASP and applies it to \"ethical\" versions of Pac-man, achieving comparable performance but ethically preferable results."
}