{
    "title": "Muffin: A Framework Toward Multi-Dimension AI Fairness by Uniting Off-the-Shelf Models. (arXiv:2308.13730v1 [cs.LG])",
    "abstract": "Model fairness (a.k.a., bias) has become one of the most critical problems in a wide range of AI applications. An unfair model in autonomous driving may cause a traffic accident if corner cases (e.g., extreme weather) cannot be fairly regarded; or it will incur healthcare disparities if the AI model misdiagnoses a certain group of people (e.g., brown and black skin). In recent years, there have been emerging research works on addressing unfairness, and they mainly focus on a single unfair attribute, like skin tone; however, real-world data commonly have multiple attributes, among which unfairness can exist in more than one attribute, called 'multi-dimensional fairness'. In this paper, we first reveal a strong correlation between the different unfair attributes, i.e., optimizing fairness on one attribute will lead to the collapse of others. Then, we propose a novel Multi-Dimension Fairness framework, namely Muffin, which includes an automatic tool to unite off-the-shelf models to improv",
    "link": "http://arxiv.org/abs/2308.13730",
    "context": "Title: Muffin: A Framework Toward Multi-Dimension AI Fairness by Uniting Off-the-Shelf Models. (arXiv:2308.13730v1 [cs.LG])\nAbstract: Model fairness (a.k.a., bias) has become one of the most critical problems in a wide range of AI applications. An unfair model in autonomous driving may cause a traffic accident if corner cases (e.g., extreme weather) cannot be fairly regarded; or it will incur healthcare disparities if the AI model misdiagnoses a certain group of people (e.g., brown and black skin). In recent years, there have been emerging research works on addressing unfairness, and they mainly focus on a single unfair attribute, like skin tone; however, real-world data commonly have multiple attributes, among which unfairness can exist in more than one attribute, called 'multi-dimensional fairness'. In this paper, we first reveal a strong correlation between the different unfair attributes, i.e., optimizing fairness on one attribute will lead to the collapse of others. Then, we propose a novel Multi-Dimension Fairness framework, namely Muffin, which includes an automatic tool to unite off-the-shelf models to improv",
    "path": "papers/23/08/2308.13730.json",
    "total_tokens": 971,
    "translated_title": "Muffin:通过整合现成模型实现多维度人工智能公平性的框架",
    "translated_abstract": "模型公平性（即偏见）已成为各种人工智能应用中最重要的问题之一。一个不公平的模型在自动驾驶中可能会导致交通事故，如果对极端情况（如极端天气）不能公正对待；或者如果AI模型误诊某一群体（如棕色和黑色皮肤），将导致医疗差异。近年来，有许多关于解决不公平性的研究工作涌现出来，主要关注单一的不公平属性，如肤色；然而，现实世界的数据通常具有多个属性，其中不公平性可以存在于多个属性中，称为“多维度公平性”。本文首先揭示了不同不公平属性之间的强相关性，即在一个属性上优化公平性会导致其他属性的崩溃。然后，我们提出了一个新的多维度公平性框架Muffin，其中包括一个自动工具来整合现成模型来提高公平性。",
    "tldr": "本文提出了一个名为Muffin的框架，通过整合现成模型，实现多维度人工智能公平性。研究首先揭示了不同不公平属性之间的强相关性，随后提出了一个新的多维度公平性框架Muffin，其中包括一个自动工具来提高公平性。",
    "en_tdlr": "This paper proposes a framework called Muffin, which achieves multi-dimensional AI fairness by uniting off-the-shelf models. The study first reveals a strong correlation between different unfair attributes, and then presents a novel framework for multi-dimensional fairness, including an automatic tool for improving fairness."
}