{
    "title": "Company Similarity using Large Language Models. (arXiv:2308.08031v1 [q-fin.ST])",
    "abstract": "Identifying companies with similar profiles is a core task in finance with a wide range of applications in portfolio construction, asset pricing and risk attribution. When a rigorous definition of similarity is lacking, financial analysts usually resort to 'traditional' industry classifications such as Global Industry Classification System (GICS) which assign a unique category to each company at different levels of granularity. Due to their discrete nature, though, GICS classifications do not allow for ranking companies in terms of similarity. In this paper, we explore the ability of pre-trained and finetuned large language models (LLMs) to learn company embeddings based on the business descriptions reported in SEC filings. We show that we can reproduce GICS classifications using the embeddings as features. We also benchmark these embeddings on various machine learning and financial metrics and conclude that the companies that are similar according to the embeddings are also similar in",
    "link": "http://arxiv.org/abs/2308.08031",
    "context": "Title: Company Similarity using Large Language Models. (arXiv:2308.08031v1 [q-fin.ST])\nAbstract: Identifying companies with similar profiles is a core task in finance with a wide range of applications in portfolio construction, asset pricing and risk attribution. When a rigorous definition of similarity is lacking, financial analysts usually resort to 'traditional' industry classifications such as Global Industry Classification System (GICS) which assign a unique category to each company at different levels of granularity. Due to their discrete nature, though, GICS classifications do not allow for ranking companies in terms of similarity. In this paper, we explore the ability of pre-trained and finetuned large language models (LLMs) to learn company embeddings based on the business descriptions reported in SEC filings. We show that we can reproduce GICS classifications using the embeddings as features. We also benchmark these embeddings on various machine learning and financial metrics and conclude that the companies that are similar according to the embeddings are also similar in",
    "path": "papers/23/08/2308.08031.json",
    "total_tokens": 901,
    "translated_title": "使用大型语言模型进行公司相似性的研究",
    "translated_abstract": "在金融领域中，识别具有相似特点的公司是一项核心任务，广泛应用于投资组合构建、资产定价和风险归因。当缺乏对相似性的严格定义时，金融分析师通常采用“传统”的行业分类，如全球行业分类系统（GICS），它在不同粒度级别上为每家公司分配一个唯一的类别。然而，由于GICS分类是离散的，不能对公司进行相似性排名。在本文中，我们通过分析SEC文件中的业务描述，探索了预训练和微调的大型语言模型（LLMs）学习公司嵌入的能力。我们展示了我们可以使用这些嵌入作为特征来复现GICS分类。我们还对这些嵌入进行了各种机器学习和财务指标的基准测试，并得出结论，根据嵌入的相似性来判断的公司也在财务上相似。",
    "tldr": "本文研究了使用大型语言模型进行公司相似性分析的方法，并发现预训练和微调的模型可以学习公司的嵌入表示，用于复现行业分类并评估财务指标。根据嵌入的相似性判断公司在财务上也相似。",
    "en_tdlr": "This paper investigates the use of large language models for company similarity analysis and finds that pre-trained and fine-tuned models can learn embeddings of companies based on their business descriptions, which can be used to reproduce industry classifications and evaluate financial metrics. Companies that are similar according to the embeddings also exhibit similarity in their financial characteristics."
}