{
    "title": "Target specification bias, counterfactual prediction, and algorithmic fairness in healthcare. (arXiv:2308.02081v1 [cs.LG])",
    "abstract": "Bias in applications of machine learning (ML) to healthcare is usually attributed to unrepresentative or incomplete data, or to underlying health disparities. This article identifies a more pervasive source of bias that affects the clinical utility of ML-enabled prediction tools: target specification bias. Target specification bias arises when the operationalization of the target variable does not match its definition by decision makers. The mismatch is often subtle, and stems from the fact that decision makers are typically interested in predicting the outcomes of counterfactual, rather than actual, healthcare scenarios. Target specification bias persists independently of data limitations and health disparities. When left uncorrected, it gives rise to an overestimation of predictive accuracy, to inefficient utilization of medical resources, and to suboptimal decisions that can harm patients. Recent work in metrology - the science of measurement suggests ways of counteracting target ",
    "link": "http://arxiv.org/abs/2308.02081",
    "context": "Title: Target specification bias, counterfactual prediction, and algorithmic fairness in healthcare. (arXiv:2308.02081v1 [cs.LG])\nAbstract: Bias in applications of machine learning (ML) to healthcare is usually attributed to unrepresentative or incomplete data, or to underlying health disparities. This article identifies a more pervasive source of bias that affects the clinical utility of ML-enabled prediction tools: target specification bias. Target specification bias arises when the operationalization of the target variable does not match its definition by decision makers. The mismatch is often subtle, and stems from the fact that decision makers are typically interested in predicting the outcomes of counterfactual, rather than actual, healthcare scenarios. Target specification bias persists independently of data limitations and health disparities. When left uncorrected, it gives rise to an overestimation of predictive accuracy, to inefficient utilization of medical resources, and to suboptimal decisions that can harm patients. Recent work in metrology - the science of measurement suggests ways of counteracting target ",
    "path": "papers/23/08/2308.02081.json",
    "total_tokens": 949,
    "translated_title": "目标规范偏差、反事实预测和医疗算法公正性",
    "translated_abstract": "在将机器学习应用于医疗领域时，偏见通常归因于不具代表性或不完整的数据，或者潜在的健康差异。本文发现了一种更普遍的偏见来源，影响了机器学习预测工具的临床效用：目标规范偏差。当目标变量的实施与决策者的定义不一致时，就会发生目标规范偏差。这种不匹配通常是微妙的，源于决策者通常对反事实的医疗情景的结果进行预测，而不是实际情况。目标规范偏差与数据限制和健康差异无关。如果不进行纠正，它会导致对预测准确性的过高估计，对医疗资源的低效利用，以及可能对患者造成伤害的次优决策。最近在计量学——测量科学领域的工作提出了对抗目标规范偏差的方法。",
    "tldr": "目标规范偏差是影响机器学习预测工具临床效用的普遍偏见，它指的是目标变量的操作化与决策者定义的不一致，可能导致预测准确性的过高估计和次优决策，与数据限制和健康差异无关。",
    "en_tdlr": "Target specification bias is a pervasive source of bias in machine learning applications to healthcare, referring to the mismatch between the operationalization of the target variable and its definition by decision makers. It can lead to overestimation of predictive accuracy and suboptimal decisions, independent of data limitations and health disparities."
}