{
    "title": "ScatterUQ: Interactive Uncertainty Visualizations for Multiclass Deep Learning Problems. (arXiv:2308.04588v1 [cs.LG])",
    "abstract": "Recently, uncertainty-aware deep learning methods for multiclass labeling problems have been developed that provide calibrated class prediction probabilities and out-of-distribution (OOD) indicators, letting machine learning (ML) consumers and engineers gauge a model's confidence in its predictions. However, this extra neural network prediction information is challenging to scalably convey visually for arbitrary data sources under multiple uncertainty contexts. To address these challenges, we present ScatterUQ, an interactive system that provides targeted visualizations to allow users to better understand model performance in context-driven uncertainty settings. ScatterUQ leverages recent advances in distance-aware neural networks, together with dimensionality reduction techniques, to construct robust, 2-D scatter plots explaining why a model predicts a test example to be (1) in-distribution and of a particular class, (2) in-distribution but unsure of the class, and (3) out-of-distribu",
    "link": "http://arxiv.org/abs/2308.04588",
    "context": "Title: ScatterUQ: Interactive Uncertainty Visualizations for Multiclass Deep Learning Problems. (arXiv:2308.04588v1 [cs.LG])\nAbstract: Recently, uncertainty-aware deep learning methods for multiclass labeling problems have been developed that provide calibrated class prediction probabilities and out-of-distribution (OOD) indicators, letting machine learning (ML) consumers and engineers gauge a model's confidence in its predictions. However, this extra neural network prediction information is challenging to scalably convey visually for arbitrary data sources under multiple uncertainty contexts. To address these challenges, we present ScatterUQ, an interactive system that provides targeted visualizations to allow users to better understand model performance in context-driven uncertainty settings. ScatterUQ leverages recent advances in distance-aware neural networks, together with dimensionality reduction techniques, to construct robust, 2-D scatter plots explaining why a model predicts a test example to be (1) in-distribution and of a particular class, (2) in-distribution but unsure of the class, and (3) out-of-distribu",
    "path": "papers/23/08/2308.04588.json",
    "total_tokens": 755,
    "translated_title": "ScatterUQ: 用于多类别深度学习问题的交互式不确定性可视化",
    "translated_abstract": "最近，针对多类别标签问题开发了一种不确定性感知的深度学习方法，提供了校准的类别预测概率和超出分布指示器，使得机器学习的使用者和工程师可以评估模型对其预测的信心。然而，这种额外的神经网络预测信息在多个不确定性环境下对任意数据源进行可视化传达具有挑战性。为了解决这些挑战，我们提出了ScatterUQ，这是一个交互式系统，提供有针对性的可视化，让用户能够更好地理解模型在上下文驱动的不确定性设置下的性能。",
    "tldr": "ScatterUQ是一个交互式系统，通过可视化展示模型在上下文驱动的不确定性设置下的性能，为用户提供了更好的理解模型预测的能力。"
}