{
    "title": "Modeling Bends in Popular Music Guitar Tablatures. (arXiv:2308.12307v1 [cs.SD])",
    "abstract": "Tablature notation is widely used in popular music to transcribe and share guitar musical content. As a complement to standard score notation, tablatures transcribe performance gesture information including finger positions and a variety of guitar-specific playing techniques such as slides, hammer-on/pull-off or bends.This paper focuses on bends, which enable to progressively shift the pitch of a note, therefore circumventing physical limitations of the discrete fretted fingerboard. In this paper, we propose a set of 25 high-level features, computed for each note of the tablature, to study how bend occurrences can be predicted from their past and future short-term context. Experiments are performed on a corpus of 932 lead guitar tablatures of popular music and show that a decision tree successfully predicts bend occurrences with an F1 score of 0.71 anda limited amount of false positive predictions, demonstrating promising applications to assist the arrangement of non-guitar music into ",
    "link": "http://arxiv.org/abs/2308.12307",
    "context": "Title: Modeling Bends in Popular Music Guitar Tablatures. (arXiv:2308.12307v1 [cs.SD])\nAbstract: Tablature notation is widely used in popular music to transcribe and share guitar musical content. As a complement to standard score notation, tablatures transcribe performance gesture information including finger positions and a variety of guitar-specific playing techniques such as slides, hammer-on/pull-off or bends.This paper focuses on bends, which enable to progressively shift the pitch of a note, therefore circumventing physical limitations of the discrete fretted fingerboard. In this paper, we propose a set of 25 high-level features, computed for each note of the tablature, to study how bend occurrences can be predicted from their past and future short-term context. Experiments are performed on a corpus of 932 lead guitar tablatures of popular music and show that a decision tree successfully predicts bend occurrences with an F1 score of 0.71 anda limited amount of false positive predictions, demonstrating promising applications to assist the arrangement of non-guitar music into ",
    "path": "papers/23/08/2308.12307.json",
    "total_tokens": 888,
    "translated_title": "模拟流行音乐吉他谱中的弯音",
    "translated_abstract": "弹奏谱标记广泛应用于流行音乐中，用于转录和分享吉他的音乐内容。作为标准音符标记的补充，弹奏谱可以转录演奏动作信息，包括手指位置和各种吉他特定的演奏技巧，如滑音，拉弦和弯音。本文专注于弯音，在谱中逐渐改变音高从而避免离散的按弦限制。我们提出了一组高级特征，针对谱中的每个音符进行计算，研究如何通过过去和未来的短期上下文来预测弯音的发生。在932个流行音乐的主吉他谱样本上进行实验，结果显示决策树可以成功预测弯音的发生，F1分数为0.71，并且有可接受的误报率，展示了将非吉他音乐适应的有希望的应用。",
    "tldr": "本文研究了流行音乐吉他谱中的弯音现象，并提出了一种通过分析弯音的过去和未来短期上下文来预测弯音发生的方法。实验证明这种方法具有良好的预测性能和应用前景。"
}