{
    "title": "Classes are not Clusters: Improving Label-based Evaluation of Dimensionality Reduction. (arXiv:2308.00278v1 [cs.LG])",
    "abstract": "A common way to evaluate the reliability of dimensionality reduction (DR) embeddings is to quantify how well labeled classes form compact, mutually separated clusters in the embeddings. This approach is based on the assumption that the classes stay as clear clusters in the original high-dimensional space. However, in reality, this assumption can be violated; a single class can be fragmented into multiple separated clusters, and multiple classes can be merged into a single cluster. We thus cannot always assure the credibility of the evaluation using class labels. In this paper, we introduce two novel quality measures -- Label-Trustworthiness and Label-Continuity (Label-T&C) -- advancing the process of DR evaluation based on class labels. Instead of assuming that classes are well-clustered in the original space, Label-T&C work by (1) estimating the extent to which classes form clusters in the original and embedded spaces and (2) evaluating the difference between the two. A quantitative e",
    "link": "http://arxiv.org/abs/2308.00278",
    "context": "Title: Classes are not Clusters: Improving Label-based Evaluation of Dimensionality Reduction. (arXiv:2308.00278v1 [cs.LG])\nAbstract: A common way to evaluate the reliability of dimensionality reduction (DR) embeddings is to quantify how well labeled classes form compact, mutually separated clusters in the embeddings. This approach is based on the assumption that the classes stay as clear clusters in the original high-dimensional space. However, in reality, this assumption can be violated; a single class can be fragmented into multiple separated clusters, and multiple classes can be merged into a single cluster. We thus cannot always assure the credibility of the evaluation using class labels. In this paper, we introduce two novel quality measures -- Label-Trustworthiness and Label-Continuity (Label-T&C) -- advancing the process of DR evaluation based on class labels. Instead of assuming that classes are well-clustered in the original space, Label-T&C work by (1) estimating the extent to which classes form clusters in the original and embedded spaces and (2) evaluating the difference between the two. A quantitative e",
    "path": "papers/23/08/2308.00278.json",
    "total_tokens": 978,
    "translated_title": "类别不等于聚类：改进基于标签的降维评估",
    "translated_abstract": "评估降维嵌入的可靠性的一种常见方法是量化标记类别在嵌入中如何形成紧凑且相互分离的聚类。这种方法基于一个假设，即类别在原始的高维空间中仍然是清晰的聚类。然而，在现实中，这个假设可能不成立；一个类别可能被分解成多个分离的聚类，多个类别可能合并成一个聚类。因此，我们不能总是保证使用类别标签进行评估的可信度。在本文中，我们引入了两种新的质量度量方法--标签可信度和标签连续性（Label-T&C）--改进了基于类别标签的降维评估的过程。Label-T&C不再假设类别在原始空间中形成良好的聚类，而是通过（1）估计类别在原始空间和嵌入空间中形成聚类的程度和（2）评估两者之间的差异来工作。",
    "tldr": "本文提出了两种新的质量度量方法--标签可信度和标签连续性（Label-T&C）--改进了基于类别标签的降维评估的过程，不再假设类别在原始空间中形成良好的聚类，而是通过估计类别在原始空间和嵌入空间中形成聚类的程度和评估两者之间的差异来工作。"
}