{
    "title": "Uncertainty Quantification for Image-based Traffic Prediction across Cities. (arXiv:2308.06129v1 [cs.CV])",
    "abstract": "Despite the strong predictive performance of deep learning models for traffic prediction, their widespread deployment in real-world intelligent transportation systems has been restrained by a lack of interpretability. Uncertainty quantification (UQ) methods provide an approach to induce probabilistic reasoning, improve decision-making and enhance model deployment potential. To gain a comprehensive picture of the usefulness of existing UQ methods for traffic prediction and the relation between obtained uncertainties and city-wide traffic dynamics, we investigate their application to a large-scale image-based traffic dataset spanning multiple cities and time periods. We compare two epistemic and two aleatoric UQ methods on both temporal and spatio-temporal transfer tasks, and find that meaningful uncertainty estimates can be recovered. We further demonstrate how uncertainty estimates can be employed for unsupervised outlier detection on changes in city traffic dynamics. We find that our ",
    "link": "http://arxiv.org/abs/2308.06129",
    "context": "Title: Uncertainty Quantification for Image-based Traffic Prediction across Cities. (arXiv:2308.06129v1 [cs.CV])\nAbstract: Despite the strong predictive performance of deep learning models for traffic prediction, their widespread deployment in real-world intelligent transportation systems has been restrained by a lack of interpretability. Uncertainty quantification (UQ) methods provide an approach to induce probabilistic reasoning, improve decision-making and enhance model deployment potential. To gain a comprehensive picture of the usefulness of existing UQ methods for traffic prediction and the relation between obtained uncertainties and city-wide traffic dynamics, we investigate their application to a large-scale image-based traffic dataset spanning multiple cities and time periods. We compare two epistemic and two aleatoric UQ methods on both temporal and spatio-temporal transfer tasks, and find that meaningful uncertainty estimates can be recovered. We further demonstrate how uncertainty estimates can be employed for unsupervised outlier detection on changes in city traffic dynamics. We find that our ",
    "path": "papers/23/08/2308.06129.json",
    "total_tokens": 869,
    "translated_title": "基于图像的跨城市交通预测的不确定性量化",
    "translated_abstract": "尽管深度学习模型在交通预测方面具有较强的预测性能，但由于解释性的缺乏，它们在实际智能交通系统中的普遍部署受到了限制。不确定性量化（UQ）方法提供了一种引入概率推理、改进决策和提高模型部署潜力的方法。为了全面了解现有UQ方法在交通预测中的有用性以及获得的不确定性与城市范围内交通动态之间的关系，我们对跨越多个城市和时间段的大规模基于图像的交通数据集应用了这些方法。我们比较了两种认知不确定性和两种重要性不确定性UQ方法在时间和时空转换任务上的表现，并发现可以获得有意义的不确定性估计。我们进一步展示了如何利用不确定性估计来进行城市交通动态变化的无监督异常检测。我们发现我们的方法可以在城市交通动态变化方面发现异常。",
    "tldr": "本研究调查了不确定性量化方法在跨城市交通预测中的应用，发现存在的UQ方法可以提供有意义的不确定性估计，并可以用于无监督异常检测。",
    "en_tdlr": "This study investigates the application of uncertainty quantification methods for image-based traffic prediction across cities. The authors find that meaningful uncertainty estimates can be obtained and utilized for unsupervised outlier detection on changes in city traffic dynamics."
}