{
    "title": "Large Language Models in Introductory Programming Education: ChatGPT's Performance and Implications for Assessments. (arXiv:2308.08572v1 [cs.SE])",
    "abstract": "This paper investigates the performance of the Large Language Models (LLMs) ChatGPT-3.5 and GPT-4 in solving introductory programming tasks. Based on the performance, implications for didactic scenarios and assessment formats utilizing LLMs are derived. For the analysis, 72 Python tasks for novice programmers were selected from the free site CodingBat. Full task descriptions were used as input to the LLMs, while the generated replies were evaluated using CodingBat's unit tests. In addition, the general availability of textual explanations and program code was analyzed. The results show high scores of 94.4 to 95.8% correct responses and reliable availability of textual explanations and program code, which opens new ways to incorporate LLMs into programming education and assessment.",
    "link": "http://arxiv.org/abs/2308.08572",
    "context": "Title: Large Language Models in Introductory Programming Education: ChatGPT's Performance and Implications for Assessments. (arXiv:2308.08572v1 [cs.SE])\nAbstract: This paper investigates the performance of the Large Language Models (LLMs) ChatGPT-3.5 and GPT-4 in solving introductory programming tasks. Based on the performance, implications for didactic scenarios and assessment formats utilizing LLMs are derived. For the analysis, 72 Python tasks for novice programmers were selected from the free site CodingBat. Full task descriptions were used as input to the LLMs, while the generated replies were evaluated using CodingBat's unit tests. In addition, the general availability of textual explanations and program code was analyzed. The results show high scores of 94.4 to 95.8% correct responses and reliable availability of textual explanations and program code, which opens new ways to incorporate LLMs into programming education and assessment.",
    "path": "papers/23/08/2308.08572.json",
    "total_tokens": 759,
    "translated_title": "初级编程教育中的大型语言模型：ChatGPT在性能和对评估的影响上的表现",
    "translated_abstract": "本文研究了大型语言模型（LLMs）ChatGPT-3.5和GPT-4在解决初级编程任务中的性能。基于性能，得出了利用LLMs进行教学场景和评估格式的推论。为了分析，从免费网站CodingBat中选择了72个用于初学者的Python任务。完整的任务描述被用作LLMs的输入，生成的回复则使用CodingBat的单元测试进行评估。此外，还分析了文本解释和程序代码的普遍可用性。结果显示了94.4%至95.8%的正确回答高分数以及可靠的文本解释和程序代码可用性，这为将LLMs纳入编程教育和评估提供了新的途径。",
    "tldr": "本文研究了大型语言模型在解决初级编程任务中的性能，并得出了利用这些模型进行编程教育和评估的推论。",
    "en_tdlr": "This paper investigates the performance of large language models in solving introductory programming tasks and derives implications for incorporating these models into programming education and assessment."
}