{
    "title": "Semantic Channel Equalizer: Modelling Language Mismatch in Multi-User Semantic Communications. (arXiv:2308.03789v1 [cs.AI])",
    "abstract": "We consider a multi-user semantic communications system in which agents (transmitters and receivers) interact through the exchange of semantic messages to convey meanings. In this context, languages are instrumental in structuring the construction and consolidation of knowledge, influencing conceptual representation and semantic extraction and interpretation. Yet, the crucial role of languages in semantic communications is often overlooked. When this is not the case, agent languages are assumed compatible and unambiguously interoperable, ignoring practical limitations that may arise due to language mismatching. This is the focus of this work. When agents use distinct languages, message interpretation is prone to semantic noise resulting from critical distortion introduced by semantic channels. To address this problem, this paper proposes a new semantic channel equalizer to counteract and limit the critical ambiguity in message interpretation. Our proposed solution models the mismatch o",
    "link": "http://arxiv.org/abs/2308.03789",
    "context": "Title: Semantic Channel Equalizer: Modelling Language Mismatch in Multi-User Semantic Communications. (arXiv:2308.03789v1 [cs.AI])\nAbstract: We consider a multi-user semantic communications system in which agents (transmitters and receivers) interact through the exchange of semantic messages to convey meanings. In this context, languages are instrumental in structuring the construction and consolidation of knowledge, influencing conceptual representation and semantic extraction and interpretation. Yet, the crucial role of languages in semantic communications is often overlooked. When this is not the case, agent languages are assumed compatible and unambiguously interoperable, ignoring practical limitations that may arise due to language mismatching. This is the focus of this work. When agents use distinct languages, message interpretation is prone to semantic noise resulting from critical distortion introduced by semantic channels. To address this problem, this paper proposes a new semantic channel equalizer to counteract and limit the critical ambiguity in message interpretation. Our proposed solution models the mismatch o",
    "path": "papers/23/08/2308.03789.json",
    "total_tokens": 827,
    "translated_title": "语义信道均衡器: 在多用户语义通信中建模语言不匹配",
    "translated_abstract": "我们考虑一个多用户语义通信系统，在这个系统中，代理（发送者和接收者）通过交换语义消息进行交流并传达意义。在这种情况下，语言在构建和巩固知识方面起着关键的作用，影响概念表示和语义提取和解释。然而，在语义通信中，语言的关键作用经常被忽视。当不考虑这一点时，代理的语言被假设为兼容和一致的，忽视了由于语言不匹配可能引起的实际限制。这是本文的重点。当代理使用不同的语言时，消息解释容易受到语义噪声的影响，这是由于语义通道引入的严重失真而引起的。为了解决这个问题，本文提出了一种新的语义信道均衡器，以抵消并限制消息解释中的严重不确定性。我们提出的解决方案模拟了不匹配的情况。",
    "tldr": "本文提出了一个新的语义信道均衡器，用于解决多用户语义通信中由于不同语言导致的语义噪声问题。",
    "en_tdlr": "This paper proposes a new semantic channel equalizer to address the semantic noise issue caused by different languages in multi-user semantic communications."
}