{
    "title": "PDPK: A Framework to Synthesise Process Data and Corresponding Procedural Knowledge for Manufacturing. (arXiv:2308.08371v1 [cs.AI])",
    "abstract": "Procedural knowledge describes how to accomplish tasks and mitigate problems. Such knowledge is commonly held by domain experts, e.g. operators in manufacturing who adjust parameters to achieve quality targets. To the best of our knowledge, no real-world datasets containing process data and corresponding procedural knowledge are publicly available, possibly due to corporate apprehensions regarding the loss of knowledge advances. Therefore, we provide a framework to generate synthetic datasets that can be adapted to different domains. The design choices are inspired by two real-world datasets of procedural knowledge we have access to. Apart from containing representations of procedural knowledge in Resource Description Framework (RDF)-compliant knowledge graphs, the framework simulates parametrisation processes and provides consistent process data. We compare established embedding methods on the resulting knowledge graphs, detailing which out-of-the-box methods have the potential to rep",
    "link": "http://arxiv.org/abs/2308.08371",
    "context": "Title: PDPK: A Framework to Synthesise Process Data and Corresponding Procedural Knowledge for Manufacturing. (arXiv:2308.08371v1 [cs.AI])\nAbstract: Procedural knowledge describes how to accomplish tasks and mitigate problems. Such knowledge is commonly held by domain experts, e.g. operators in manufacturing who adjust parameters to achieve quality targets. To the best of our knowledge, no real-world datasets containing process data and corresponding procedural knowledge are publicly available, possibly due to corporate apprehensions regarding the loss of knowledge advances. Therefore, we provide a framework to generate synthetic datasets that can be adapted to different domains. The design choices are inspired by two real-world datasets of procedural knowledge we have access to. Apart from containing representations of procedural knowledge in Resource Description Framework (RDF)-compliant knowledge graphs, the framework simulates parametrisation processes and provides consistent process data. We compare established embedding methods on the resulting knowledge graphs, detailing which out-of-the-box methods have the potential to rep",
    "path": "papers/23/08/2308.08371.json",
    "total_tokens": 832,
    "translated_title": "PDPK: 用于制造业的合成过程数据和对应程序化知识的框架",
    "translated_abstract": "程序化知识描述了如何完成任务和解决问题。这样的知识通常由领域专家持有，例如制造业中调整参数以达到质量目标的操作员。据我们所知，目前公开可用的包含过程数据和对应程序化知识的真实世界数据集目前还不存在，可能是因为企业对知识进展的损失存在担心。因此，我们提供了一个可以适应不同领域的生成合成数据集的框架。该框架的设计选择受到我们可以访问的两个实际的程序化知识数据集的启发。除了包含符合资源描述框架（RDF）标准的知识图形中的程序化知识的表示外，该框架还模拟参数化过程并提供一致的过程数据。我们比较了在生成的知识图形上的已建立的嵌入方法，详细说明了哪些开箱即用的方法具有重新解释知识潜力。",
    "tldr": "该论文提出了一个框架，用于合成包含过程数据和对应程序化知识的数据集，并比较了不同嵌入方法的性能。",
    "en_tdlr": "This paper proposes a framework to synthesize datasets containing process data and corresponding procedural knowledge, and compares the performance of different embedding methods."
}