{
    "title": "Organizational Bulk Email Systems: Their Role and Performance in Remote Work. (arXiv:2308.05085v1 [cs.HC])",
    "abstract": "The COVID-19 pandemic has forced many employees to work from home. Organizational bulk emails now play a critical role to reach employees with central information in this work-from-home environment. However, we know from our own recent work that organizational bulk email has problems: recipients fail to retain the bulk messages they received from the organization; recipients and senders have different opinions on which bulk messages were important; and communicators lack technology support to better target and design messages. In this position paper, first we review the prior work on evaluating, designing, and prototyping organizational communication systems. Second we review our recent findings and some research techniques we found useful in studying organizational communication. Last we propose a research agenda to study organizational communications in remote work environment and suggest some key questions and potential study directions.",
    "link": "http://arxiv.org/abs/2308.05085",
    "context": "Title: Organizational Bulk Email Systems: Their Role and Performance in Remote Work. (arXiv:2308.05085v1 [cs.HC])\nAbstract: The COVID-19 pandemic has forced many employees to work from home. Organizational bulk emails now play a critical role to reach employees with central information in this work-from-home environment. However, we know from our own recent work that organizational bulk email has problems: recipients fail to retain the bulk messages they received from the organization; recipients and senders have different opinions on which bulk messages were important; and communicators lack technology support to better target and design messages. In this position paper, first we review the prior work on evaluating, designing, and prototyping organizational communication systems. Second we review our recent findings and some research techniques we found useful in studying organizational communication. Last we propose a research agenda to study organizational communications in remote work environment and suggest some key questions and potential study directions.",
    "path": "papers/23/08/2308.05085.json",
    "total_tokens": 936,
    "translated_title": "组织大规模邮件系统：在远程工作中的作用和性能",
    "translated_abstract": "COVID-19疫情迫使许多员工在家工作。组织大规模邮件现在在这种远程工作环境中起着关键的作用，以便向员工传达中央信息。然而，根据我们最近的研究，我们知道组织大规模邮件存在问题：接收者无法保留他们从组织接收到的大规模消息；接收者和发送者对哪些大规模消息重要有不同的意见；以及沟通者缺乏技术支持来更好地定位和设计消息。在这篇论文中，首先我们回顾了评估、设计和原型化组织沟通系统的先前工作。其次，我们回顾了我们最近的发现和一些我们发现对研究组织沟通有用的研究技术。最后，我们提出了一个研究议程，研究远程工作环境中的组织沟通，并提出了一些关键问题和潜在的研究方向。",
    "tldr": "这篇论文讨论了在远程工作环境中组织大规模邮件系统的作用和性能。研究发现，该系统存在问题，包括接收者无法保留消息、接收者和发送者对重要消息有不同看法以及沟通者缺乏技术支持。研究提出了进一步研究该系统的议程，并提出了一些关键问题和潜在的研究方向。",
    "en_tdlr": "This paper discusses the role and performance of organizational bulk email systems in remote work environments. The study highlights problems such as message retention, different perceptions of importance, and lack of technological support. It proposes a research agenda and key questions for further investigation."
}