{
    "title": "Lifted Algorithms for Symmetric Weighted First-Order Model Sampling. (arXiv:2308.08828v1 [cs.AI])",
    "abstract": "Weighted model counting (WMC) is the task of computing the weighted sum of all satisfying assignments (i.e., models) of a propositional formula. Similarly, weighted model sampling (WMS) aims to randomly generate models with probability proportional to their respective weights. Both WMC and WMS are hard to solve exactly, falling under the \\#P-hard complexity class. However, it is known that the counting problem may sometimes be tractable, if the propositional formula can be compactly represented and expressed in first-order logic. In such cases, model counting problems can be solved in time polynomial in the domain size, and are known as \\textit{domain-liftable}. The following question then arises: Is it also the case for weighted model sampling? This paper addresses this question and answers it affirmatively. Specifically, we prove the \\textit{domain-liftability under sampling} for the two-variables fragment of first-order logic with counting quantifiers in this paper, by devising an e",
    "link": "http://arxiv.org/abs/2308.08828",
    "context": "Title: Lifted Algorithms for Symmetric Weighted First-Order Model Sampling. (arXiv:2308.08828v1 [cs.AI])\nAbstract: Weighted model counting (WMC) is the task of computing the weighted sum of all satisfying assignments (i.e., models) of a propositional formula. Similarly, weighted model sampling (WMS) aims to randomly generate models with probability proportional to their respective weights. Both WMC and WMS are hard to solve exactly, falling under the \\#P-hard complexity class. However, it is known that the counting problem may sometimes be tractable, if the propositional formula can be compactly represented and expressed in first-order logic. In such cases, model counting problems can be solved in time polynomial in the domain size, and are known as \\textit{domain-liftable}. The following question then arises: Is it also the case for weighted model sampling? This paper addresses this question and answers it affirmatively. Specifically, we prove the \\textit{domain-liftability under sampling} for the two-variables fragment of first-order logic with counting quantifiers in this paper, by devising an e",
    "path": "papers/23/08/2308.08828.json",
    "total_tokens": 879,
    "translated_title": "对称加权一阶模型抽样的提升算法",
    "translated_abstract": "加权模型计数（WMC）是计算命题公式的所有满足解（模型）的权重之和的任务。类似地，加权模型抽样（WMS）旨在以概率与它们相应的权重成比例地随机生成模型。WMC和WMS都难以精确求解，属于\\#P-hard复杂度类别。然而，已知如果命题公式可以以紧凑的方式表示并用一阶逻辑表达，有时计数问题可能是可以处理的。在这种情况下，模型计数问题可以在域大小多项式时间内解决，并被称为“域可提升”。然后，就会出现以下问题：加权模型抽样是否也是如此？本文回答了这个问题，并肯定地回答了它。具体而言，我们在本文中通过设计一种扩展了计数量词的一阶逻辑的“域可提升抽样”的内容，证明了这个问题。",
    "tldr": "本文研究了对称加权一阶模型抽样的提升算法，通过设计一种扩展了计数量词的一阶逻辑的“域可提升抽样”的内容，证明了加权模型抽样问题也存在可处理的情况。",
    "en_tdlr": "This paper investigates lifted algorithms for symmetric weighted first-order model sampling and provides evidence that the weighted model sampling problem can be tractable under certain conditions."
}