{
    "title": "MACO: A Modality Adversarial and Contrastive Framework for Modality-missing Multi-modal Knowledge Graph Completion. (arXiv:2308.06696v1 [cs.CL])",
    "abstract": "Recent years have seen significant advancements in multi-modal knowledge graph completion (MMKGC). MMKGC enhances knowledge graph completion (KGC) by integrating multi-modal entity information, thereby facilitating the discovery of unobserved triples in the large-scale knowledge graphs (KGs). Nevertheless, existing methods emphasize the design of elegant KGC models to facilitate modality interaction, neglecting the real-life problem of missing modalities in KGs. The missing modality information impedes modal interaction, consequently undermining the model's performance. In this paper, we propose a modality adversarial and contrastive framework (MACO) to solve the modality-missing problem in MMKGC. MACO trains a generator and discriminator adversarially to generate missing modality features that can be incorporated into the MMKGC model. Meanwhile, we design a cross-modal contrastive loss to improve the performance of the generator. Experiments on public benchmarks with further explorati",
    "link": "http://arxiv.org/abs/2308.06696",
    "context": "Title: MACO: A Modality Adversarial and Contrastive Framework for Modality-missing Multi-modal Knowledge Graph Completion. (arXiv:2308.06696v1 [cs.CL])\nAbstract: Recent years have seen significant advancements in multi-modal knowledge graph completion (MMKGC). MMKGC enhances knowledge graph completion (KGC) by integrating multi-modal entity information, thereby facilitating the discovery of unobserved triples in the large-scale knowledge graphs (KGs). Nevertheless, existing methods emphasize the design of elegant KGC models to facilitate modality interaction, neglecting the real-life problem of missing modalities in KGs. The missing modality information impedes modal interaction, consequently undermining the model's performance. In this paper, we propose a modality adversarial and contrastive framework (MACO) to solve the modality-missing problem in MMKGC. MACO trains a generator and discriminator adversarially to generate missing modality features that can be incorporated into the MMKGC model. Meanwhile, we design a cross-modal contrastive loss to improve the performance of the generator. Experiments on public benchmarks with further explorati",
    "path": "papers/23/08/2308.06696.json",
    "total_tokens": 940,
    "translated_title": "MACO: 一种用于模态缺失多模态知识图完成的模态对抗和对比框架",
    "translated_abstract": "近年来，多模态知识图完成（MMKGC）取得了显著进展。MMKGC通过整合多模态实体信息来增强知识图完成（KGC），从而促进了在大规模知识图中发现未观察到的三元组。然而，现有方法强调设计优雅的KGC模型以促进模态交互，忽略了知识图中缺失模态的真实问题。缺失的模态信息阻碍了模态交互，从而削弱了模型的性能。在本文中，我们提出了一种模态对抗和对比框架（MACO）来解决MMKGC中的模态缺失问题。MACO通过对抗性地训练生成器和判别器来生成可以整合到MMKGC模型中的缺失模态特征。同时，我们设计了一个跨模态对比损失来提高生成器的性能。在公共基准上进行了实验和进一步的探索。",
    "tldr": "提出了一种名为MACO的模态对抗和对比框架，用于解决多模态知识图完成中的模态缺失问题，通过对抗训练生成器和判别器生成缺失模态特征，并使用跨模态对比损失改善生成器性能。"
}