{
    "title": "Perimeter Control with Heterogeneous Cordon Signal Behaviors: A Semi-Model Dependent Reinforcement Learning Approach. (arXiv:2308.12985v1 [cs.AI])",
    "abstract": "Perimeter Control (PC) strategies have been proposed to address urban road network control in oversaturated situations by monitoring transfer flows of the Protected Network (PN). The uniform metering rate for cordon signals in existing studies ignores the variety of local traffic states at the intersection level, which may cause severe local traffic congestion and ruin the network stability. This paper introduces a semi-model dependent Multi-Agent Reinforcement Learning (MARL) framework to conduct PC with heterogeneous cordon signal behaviors. The proposed strategy integrates the MARL-based signal control method with centralized feedback PC policy and is applied to cordon signals of the PN. It operates as a two-stage system, with the feedback PC strategy detecting the overall traffic state within the PN and then distributing local instructions to cordon signals controlled by agents in the MARL framework. Each cordon signal acts independently and differently, creating a slack and distri",
    "link": "http://arxiv.org/abs/2308.12985",
    "context": "Title: Perimeter Control with Heterogeneous Cordon Signal Behaviors: A Semi-Model Dependent Reinforcement Learning Approach. (arXiv:2308.12985v1 [cs.AI])\nAbstract: Perimeter Control (PC) strategies have been proposed to address urban road network control in oversaturated situations by monitoring transfer flows of the Protected Network (PN). The uniform metering rate for cordon signals in existing studies ignores the variety of local traffic states at the intersection level, which may cause severe local traffic congestion and ruin the network stability. This paper introduces a semi-model dependent Multi-Agent Reinforcement Learning (MARL) framework to conduct PC with heterogeneous cordon signal behaviors. The proposed strategy integrates the MARL-based signal control method with centralized feedback PC policy and is applied to cordon signals of the PN. It operates as a two-stage system, with the feedback PC strategy detecting the overall traffic state within the PN and then distributing local instructions to cordon signals controlled by agents in the MARL framework. Each cordon signal acts independently and differently, creating a slack and distri",
    "path": "papers/23/08/2308.12985.json",
    "total_tokens": 868,
    "translated_title": "异构警戒信号行为下的周界控制：基于半模型依赖的强化学习方法",
    "translated_abstract": "周界控制（PC）策略旨在通过监测受保护网络（PN）的转移流量来解决城市道路网络在过饱和情况下的控制问题。现有研究中对警戒信号的均匀测量率忽视了交叉口级别的交通状态的多样性，这可能导致严重的局部交通拥堵和破坏网络稳定性。本文引入了一个基于半模型依赖的多智能体强化学习（MARL）框架来实现具有异构警戒信号行为的周界控制。所提出的策略将基于MARL的信号控制方法与集中式反馈PC策略相结合，并应用于PN的警戒信号。它是一个两阶段的系统，反馈PC策略检测PN的整体交通状态，然后将本地指令分发给由MARL框架中的智能体控制的警戒信号。每个警戒信号都独立而不同，创建了弹性和分布",
    "tldr": "本文引入了一个基于半模型依赖的多智能体强化学习（MARL）框架来实现具有异构警戒信号行为的周界控制。"
}