{
    "title": "MaintainoMATE: A GitHub App for Intelligent Automation of Maintenance Activities. (arXiv:2308.16464v1 [cs.SE])",
    "abstract": "Software development projects rely on issue tracking systems at the core of tracking maintenance tasks such as bug reports, and enhancement requests. Incoming issue-reports on these issue tracking systems must be managed in an effective manner. First, they must be labelled and then assigned to a particular developer with relevant expertise. This handling of issue-reports is critical and requires thorough scanning of the text entered in an issue-report making it a labor-intensive task. In this paper, we present a unified framework called MaintainoMATE, which is capable of automatically categorizing the issue-reports in their respective category and further assigning the issue-reports to a developer with relevant expertise. We use the Bidirectional Encoder Representations from Transformers (BERT), as an underlying model for MaintainoMATE to learn the contextual information for automatic issue-report labeling and assignment tasks. We deploy the framework used in this work as a GitHub appl",
    "link": "http://arxiv.org/abs/2308.16464",
    "context": "Title: MaintainoMATE: A GitHub App for Intelligent Automation of Maintenance Activities. (arXiv:2308.16464v1 [cs.SE])\nAbstract: Software development projects rely on issue tracking systems at the core of tracking maintenance tasks such as bug reports, and enhancement requests. Incoming issue-reports on these issue tracking systems must be managed in an effective manner. First, they must be labelled and then assigned to a particular developer with relevant expertise. This handling of issue-reports is critical and requires thorough scanning of the text entered in an issue-report making it a labor-intensive task. In this paper, we present a unified framework called MaintainoMATE, which is capable of automatically categorizing the issue-reports in their respective category and further assigning the issue-reports to a developer with relevant expertise. We use the Bidirectional Encoder Representations from Transformers (BERT), as an underlying model for MaintainoMATE to learn the contextual information for automatic issue-report labeling and assignment tasks. We deploy the framework used in this work as a GitHub appl",
    "path": "papers/23/08/2308.16464.json",
    "total_tokens": 807,
    "translated_title": "MaintainoMATE: 一个用于智能自动化维护活动的GitHub应用程序",
    "translated_abstract": "软件开发项目依赖于问题跟踪系统来跟踪维护任务，如错误报告和增强请求。这些问题跟踪系统上的问题报告必须以有效的方式进行管理。首先，它们必须进行标记，然后分配给具有相关专业知识的特定开发人员。处理问题报告是关键的，并且需要对问题报告中输入的文本进行彻底的扫描，使其成为一项劳动密集型的任务。在本文中，我们提出了一个名为MaintainoMATE的统一框架，能够自动将问题报告分类到相应的类别，并进一步将问题报告分配给具有相关专业知识的开发人员。我们使用Transformer中的双向编码器表示（BERT）作为MaintainoMATE的底层模型，用于学习自动问题报告标记和分配任务的上下文信息。我们将该框架部署为GitHub应用程序。",
    "tldr": "MaintainoMATE是一个GitHub应用程序，使用BERT模型实现自动问题报告分类和分配给专业开发人员。",
    "en_tdlr": "MaintainoMATE is a GitHub app that uses the BERT model to automatically categorize and assign issue-reports to relevant developers."
}