{
    "title": "Cyberbullying Detection for Low-resource Languages and Dialects: Review of the State of the Art. (arXiv:2308.15745v1 [cs.CL])",
    "abstract": "The struggle of social media platforms to moderate content in a timely manner, encourages users to abuse such platforms to spread vulgar or abusive language, which, when performed repeatedly becomes cyberbullying a social problem taking place in virtual environments, yet with real-world consequences, such as depression, withdrawal, or even suicide attempts of its victims. Systems for the automatic detection and mitigation of cyberbullying have been developed but, unfortunately, the vast majority of them are for the English language, with only a handful available for low-resource languages. To estimate the present state of research and recognize the needs for further development, in this paper we present a comprehensive systematic survey of studies done so far for automatic cyberbullying detection in low-resource languages. We analyzed all studies on this topic that were available. We investigated more than seventy published studies on automatic detection of cyberbullying or related lan",
    "link": "http://arxiv.org/abs/2308.15745",
    "context": "Title: Cyberbullying Detection for Low-resource Languages and Dialects: Review of the State of the Art. (arXiv:2308.15745v1 [cs.CL])\nAbstract: The struggle of social media platforms to moderate content in a timely manner, encourages users to abuse such platforms to spread vulgar or abusive language, which, when performed repeatedly becomes cyberbullying a social problem taking place in virtual environments, yet with real-world consequences, such as depression, withdrawal, or even suicide attempts of its victims. Systems for the automatic detection and mitigation of cyberbullying have been developed but, unfortunately, the vast majority of them are for the English language, with only a handful available for low-resource languages. To estimate the present state of research and recognize the needs for further development, in this paper we present a comprehensive systematic survey of studies done so far for automatic cyberbullying detection in low-resource languages. We analyzed all studies on this topic that were available. We investigated more than seventy published studies on automatic detection of cyberbullying or related lan",
    "path": "papers/23/08/2308.15745.json",
    "total_tokens": 853,
    "translated_title": "针对低资源语言和方言的网络欺凌检测：现状综述",
    "translated_abstract": "社交媒体平台在及时处理内容方面的困难，鼓励用户滥用这些平台传播粗俗或辱骂性语言，这种重复性的行为会导致网络欺凌，它是一种在虚拟环境中发生的社会问题，但会带来真实世界中的后果，如抑郁、退缩，甚至受害者自杀企图。自动检测和缓解网络欺凌的系统已经开发出来了，但不幸的是，其中绝大多数是针对英语，仅有少数适用于低资源语言。为了评估目前的研究现状并确定进一步发展的需求，本文对低资源语言中自动网络欺凌检测方面的研究进行了全面系统的调研。我们分析了所有可用的关于这个主题的研究。我们调查了70多个关于自动检测网络欺凌或相关语言的已发表的研究。",
    "tldr": "本文总结了针对低资源语言中自动检测网络欺凌的研究现状，并发现了进一步发展的需求。",
    "en_tdlr": "This paper provides a comprehensive survey of research on automatic cyberbullying detection in low-resource languages, highlighting the need for further development in this area."
}