{
    "title": "Part-Aware Transformer for Generalizable Person Re-identification. (arXiv:2308.03322v2 [cs.CV] UPDATED)",
    "abstract": "Domain generalization person re-identification (DG-ReID) aims to train a model on source domains and generalize well on unseen domains. Vision Transformer usually yields better generalization ability than common CNN networks under distribution shifts. However, Transformer-based ReID models inevitably over-fit to domain-specific biases due to the supervised learning strategy on the source domain. We observe that while the global images of different IDs should have different features, their similar local parts (e.g., black backpack) are not bounded by this constraint. Motivated by this, we propose a pure Transformer model (termed Part-aware Transformer) for DG-ReID by designing a proxy task, named Cross-ID Similarity Learning (CSL), to mine local visual information shared by different IDs. This proxy task allows the model to learn generic features because it only cares about the visual similarity of the parts regardless of the ID labels, thus alleviating the side effect of domain-specifi",
    "link": "http://arxiv.org/abs/2308.03322",
    "context": "Title: Part-Aware Transformer for Generalizable Person Re-identification. (arXiv:2308.03322v2 [cs.CV] UPDATED)\nAbstract: Domain generalization person re-identification (DG-ReID) aims to train a model on source domains and generalize well on unseen domains. Vision Transformer usually yields better generalization ability than common CNN networks under distribution shifts. However, Transformer-based ReID models inevitably over-fit to domain-specific biases due to the supervised learning strategy on the source domain. We observe that while the global images of different IDs should have different features, their similar local parts (e.g., black backpack) are not bounded by this constraint. Motivated by this, we propose a pure Transformer model (termed Part-aware Transformer) for DG-ReID by designing a proxy task, named Cross-ID Similarity Learning (CSL), to mine local visual information shared by different IDs. This proxy task allows the model to learn generic features because it only cares about the visual similarity of the parts regardless of the ID labels, thus alleviating the side effect of domain-specifi",
    "path": "papers/23/08/2308.03322.json",
    "total_tokens": 983,
    "translated_title": "基于部件感知的变压器网络用于泛化的人物再识别",
    "translated_abstract": "域泛化的人物再识别（DG-ReID）旨在在源领域上训练模型，并在未知领域上具有很好的泛化能力。与传统的CNN网络相比，Vision Transformer通常在分布偏移下具有更好的泛化能力。然而，基于Transformer的ReID模型由于源领域上的有监督学习策略，不可避免地会对领域特定的偏见过拟合。我们观察到，虽然不同ID的全局图像应该具有不同的特征，但它们相似的局部部分（例如黑色背包）并不受此约束。基于这一观察，我们提出了一种纯Transformer模型（称为部件感知变压器），通过设计一个名为交叉ID相似度学习（CSL）的代理任务来挖掘不同ID共享的局部视觉信息。这个代理任务允许模型学习通用特征，因为它只关心部件的视觉相似性，而不考虑ID标签，从而减轻了领域特定效果的影响。",
    "tldr": "本论文提出了一种基于部件感知的变压器模型，用于泛化的人物再识别。通过设计一个名为交叉ID相似度学习（CSL）的代理任务，模型可以挖掘不同ID之间共享的局部视觉信息，从而学习到通用特征，减轻了领域特定效果的影响。"
}