{
    "title": "Adversarial Collaborative Filtering for Free. (arXiv:2308.13541v1 [cs.IR])",
    "abstract": "Collaborative Filtering (CF) has been successfully used to help users discover the items of interest. Nevertheless, existing CF methods suffer from noisy data issue, which negatively impacts the quality of recommendation. To tackle this problem, many prior studies leverage adversarial learning to regularize the representations of users/items, which improves both generalizability and robustness. Those methods often learn adversarial perturbations and model parameters under min-max optimization framework. However, there still have two major drawbacks: 1) Existing methods lack theoretical guarantees of why adding perturbations improve the model generalizability and robustness; 2) Solving min-max optimization is time-consuming. In addition to updating the model parameters, each iteration requires additional computations to update the perturbations, making them not scalable for industry-scale datasets.  In this paper, we present Sharpness-aware Collaborative Filtering (SharpCF), a simple ye",
    "link": "http://arxiv.org/abs/2308.13541",
    "context": "Title: Adversarial Collaborative Filtering for Free. (arXiv:2308.13541v1 [cs.IR])\nAbstract: Collaborative Filtering (CF) has been successfully used to help users discover the items of interest. Nevertheless, existing CF methods suffer from noisy data issue, which negatively impacts the quality of recommendation. To tackle this problem, many prior studies leverage adversarial learning to regularize the representations of users/items, which improves both generalizability and robustness. Those methods often learn adversarial perturbations and model parameters under min-max optimization framework. However, there still have two major drawbacks: 1) Existing methods lack theoretical guarantees of why adding perturbations improve the model generalizability and robustness; 2) Solving min-max optimization is time-consuming. In addition to updating the model parameters, each iteration requires additional computations to update the perturbations, making them not scalable for industry-scale datasets.  In this paper, we present Sharpness-aware Collaborative Filtering (SharpCF), a simple ye",
    "path": "papers/23/08/2308.13541.json",
    "total_tokens": 882,
    "translated_title": "面向免费的对抗性协同过滤",
    "translated_abstract": "协同过滤（CF）已成功用于帮助用户发现感兴趣的项目。然而，现有的CF方法存在噪声数据问题，这对推荐的质量产生负面影响。为了解决这个问题，许多先前的研究利用对抗性学习来规范用户/项目的表示，从而提高泛化能力和鲁棒性。这些方法通常在最小最大优化框架下学习对抗扰动和模型参数。然而，目前存在两个主要缺点：1）现有方法缺乏理论保证，无法解释为什么添加扰动可以提高模型的泛化能力和鲁棒性；2）解决最小最大优化问题需要耗时。除了更新模型参数，每次迭代还需要额外计算来更新扰动，使它们不适用于规模大的工业数据集。本文提出了一种新的Sharpness-aware Collaborative Filtering（SharpCF）方法，它简单而有效。",
    "tldr": "这篇论文介绍了一种面向免费的对抗性协同过滤方法，通过对抗性学习来规范用户/项目的表示，提高模型的泛化能力和鲁棒性，并提出了SharpCF方法来解决现有方法的缺点。",
    "en_tdlr": "This paper presents a adversarial collaborative filtering approach for free, which improves the generalizability and robustness of the model by regularizing the representations of users/items, and proposes SharpCF method to address the drawbacks of existing methods."
}