{
    "title": "Text Similarity from Image Contents using Statistical and Semantic Analysis Techniques. (arXiv:2308.12842v1 [cs.CL])",
    "abstract": "Plagiarism detection is one of the most researched areas among the Natural Language Processing(NLP) community. A good plagiarism detection covers all the NLP methods including semantics, named entities, paraphrases etc. and produces detailed plagiarism reports. Detection of Cross Lingual Plagiarism requires deep knowledge of various advanced methods and algorithms to perform effective text similarity checking. Nowadays the plagiarists are also advancing themselves from hiding the identity from being catch in such offense. The plagiarists are bypassed from being detected with techniques like paraphrasing, synonym replacement, mismatching citations, translating one language to another. Image Content Plagiarism Detection (ICPD) has gained importance, utilizing advanced image content processing to identify instances of plagiarism to ensure the integrity of image content. The issue of plagiarism extends beyond textual content, as images such as figures, graphs, and tables also have the pote",
    "link": "http://arxiv.org/abs/2308.12842",
    "context": "Title: Text Similarity from Image Contents using Statistical and Semantic Analysis Techniques. (arXiv:2308.12842v1 [cs.CL])\nAbstract: Plagiarism detection is one of the most researched areas among the Natural Language Processing(NLP) community. A good plagiarism detection covers all the NLP methods including semantics, named entities, paraphrases etc. and produces detailed plagiarism reports. Detection of Cross Lingual Plagiarism requires deep knowledge of various advanced methods and algorithms to perform effective text similarity checking. Nowadays the plagiarists are also advancing themselves from hiding the identity from being catch in such offense. The plagiarists are bypassed from being detected with techniques like paraphrasing, synonym replacement, mismatching citations, translating one language to another. Image Content Plagiarism Detection (ICPD) has gained importance, utilizing advanced image content processing to identify instances of plagiarism to ensure the integrity of image content. The issue of plagiarism extends beyond textual content, as images such as figures, graphs, and tables also have the pote",
    "path": "papers/23/08/2308.12842.json",
    "total_tokens": 924,
    "translated_title": "使用统计和语义分析技术从图像内容中进行文本相似性检测",
    "translated_abstract": "抄袭检测是自然语言处理（NLP）社区中最研究的领域之一。良好的抄袭检测涵盖了所有的NLP方法，包括语义、命名实体、释义等，并生成详细的抄袭报告。跨语言抄袭的检测需要深入了解各种高级方法和算法，以进行有效的文本相似性检查。现今的抄袭者也在提升自己，以避免被发现。他们使用改写、同义词替换、引文不匹配、不同语言的翻译等技术来规避检测。图像内容抄袭检测（ICPD）得到了重视，利用先进的图像内容处理技术来识别抄袭实例，以确保图像内容的完整性。抄袭问题不仅限于文本内容，图片如图表、图形等也具有潜在的抄袭风险。",
    "tldr": "该论文介绍了使用统计和语义分析技术从图像内容中进行文本相似性检测的方法，以解决抄袭问题。这种技术不仅覆盖了语义、命名实体、释义等NLP方法，还利用图像内容处理技术来识别图像内容的抄袭实例，确保图像内容的完整性。"
}