{
    "title": "The GENEA Challenge 2023: A large scale evaluation of gesture generation models in monadic and dyadic settings. (arXiv:2308.12646v1 [cs.HC])",
    "abstract": "This paper reports on the GENEA Challenge 2023, in which participating teams built speech-driven gesture-generation systems using the same speech and motion dataset, followed by a joint evaluation. This year's challenge provided data on both sides of a dyadic interaction, allowing teams to generate full-body motion for an agent given its speech (text and audio) and the speech and motion of the interlocutor. We evaluated 12 submissions and 2 baselines together with held-out motion-capture data in several large-scale user studies. The studies focused on three aspects: 1) the human-likeness of the motion, 2) the appropriateness of the motion for the agent's own speech whilst controlling for the human-likeness of the motion, and 3) the appropriateness of the motion for the behaviour of the interlocutor in the interaction, using a setup that controls for both the human-likeness of the motion and the agent's own speech. We found a large span in human-likeness between challenge submissions, w",
    "link": "http://arxiv.org/abs/2308.12646",
    "context": "Title: The GENEA Challenge 2023: A large scale evaluation of gesture generation models in monadic and dyadic settings. (arXiv:2308.12646v1 [cs.HC])\nAbstract: This paper reports on the GENEA Challenge 2023, in which participating teams built speech-driven gesture-generation systems using the same speech and motion dataset, followed by a joint evaluation. This year's challenge provided data on both sides of a dyadic interaction, allowing teams to generate full-body motion for an agent given its speech (text and audio) and the speech and motion of the interlocutor. We evaluated 12 submissions and 2 baselines together with held-out motion-capture data in several large-scale user studies. The studies focused on three aspects: 1) the human-likeness of the motion, 2) the appropriateness of the motion for the agent's own speech whilst controlling for the human-likeness of the motion, and 3) the appropriateness of the motion for the behaviour of the interlocutor in the interaction, using a setup that controls for both the human-likeness of the motion and the agent's own speech. We found a large span in human-likeness between challenge submissions, w",
    "path": "papers/23/08/2308.12646.json",
    "total_tokens": 980,
    "translated_title": "GENEA Challenge 2023：单声道和双声道环境中手势生成模型的大规模评估",
    "translated_abstract": "本论文报告了GENEA Challenge 2023的情况，参与团队使用相同的语音和运动数据集构建了基于语音驱动的手势生成系统，并进行了共同评估。今年的挑战提供了双人互动的数据，使团队可以根据发言者的语音（文本和音频）以及互动者的语音和动作生成完整的全身动作。我们对12个提交和2个基准模型进行了评估，同时使用了保留的运动捕捉数据进行了几项大规模用户研究。这些研究集中在三个方面：1）动作的人类相似度，2）动作对于发言者自身语音的适应性（同时控制动作的人类相似度），和3）动作对于互动中对话者行为的适应性，使用了一个控制了动作的人类相似度和发言者自身语音的设置。我们发现挑战的提交之间的人类相似度差异很大。",
    "tldr": "GENEA Challenge 2023是一项大规模评估手势生成模型的挑战。参与团队使用相同语音和运动数据集构建了基于语音驱动的手势生成系统，并通过几项用户研究评估了这些系统的人类相似度以及对于发言者和互动者行为的适应性。",
    "en_tdlr": "The GENEA Challenge 2023 is a large-scale evaluation of gesture generation models. Participating teams built speech-driven gesture generation systems using the same dataset, and their systems were evaluated in terms of human-likeness and appropriateness for the speaker and interlocutor behavior through user studies."
}