{
    "title": "Forecasting Emergency Department Crowding with Advanced Machine Learning Models and Multivariable Input. (arXiv:2308.16544v1 [cs.LG])",
    "abstract": "Emergency department (ED) crowding is a significant threat to patient safety and it has been repeatedly associated with increased mortality. Forecasting future service demand has the potential patient outcomes. Despite active research on the subject, several gaps remain: 1) proposed forecasting models have become outdated due to quick influx of advanced machine learning models (ML), 2) amount of multivariable input data has been limited and 3) discrete performance metrics have been rarely reported. In this study, we document the performance of a set of advanced ML models in forecasting ED occupancy 24 hours ahead. We use electronic health record data from a large, combined ED with an extensive set of explanatory variables, including the availability of beds in catchment area hospitals, traffic data from local observation stations, weather variables, etc. We show that N-BEATS and LightGBM outpeform benchmarks with 11 % and 9 % respective improvements and that DeepAR predicts next day cr",
    "link": "http://arxiv.org/abs/2308.16544",
    "context": "Title: Forecasting Emergency Department Crowding with Advanced Machine Learning Models and Multivariable Input. (arXiv:2308.16544v1 [cs.LG])\nAbstract: Emergency department (ED) crowding is a significant threat to patient safety and it has been repeatedly associated with increased mortality. Forecasting future service demand has the potential patient outcomes. Despite active research on the subject, several gaps remain: 1) proposed forecasting models have become outdated due to quick influx of advanced machine learning models (ML), 2) amount of multivariable input data has been limited and 3) discrete performance metrics have been rarely reported. In this study, we document the performance of a set of advanced ML models in forecasting ED occupancy 24 hours ahead. We use electronic health record data from a large, combined ED with an extensive set of explanatory variables, including the availability of beds in catchment area hospitals, traffic data from local observation stations, weather variables, etc. We show that N-BEATS and LightGBM outpeform benchmarks with 11 % and 9 % respective improvements and that DeepAR predicts next day cr",
    "path": "papers/23/08/2308.16544.json",
    "total_tokens": 929,
    "translated_title": "使用高级机器学习模型和多变量输入预测急诊室拥挤",
    "translated_abstract": "急诊室拥挤对患者的安全构成重大威胁，并且与增加的死亡率有关。预测未来的服务需求有潜在的患者结果。尽管对这个主题进行了积极的研究，但仍存在几个差距：1）由于快速增加的高级机器学习模型（ML），所提出的预测模型变得过时，2）多变量输入数据的量有限，3）很少报告具体的性能指标。在这项研究中，我们记录了一组先进的ML模型在预测24小时前的急诊室占用率方面的性能。我们使用一个大型综合急诊室的电子健康记录数据和一系列解释变量，包括救治区域医院的床位可用性，来自当地观测站的交通数据，天气变量等。我们展示了N-BEATS和LightGBM在11％和9％的改进中超越了基准，并且DeepAR可以预测第二天的人员状况。",
    "tldr": "本研究使用高级机器学习模型和多变量输入来预测急诊室拥挤，发现N-BEATS和LightGBM相较于基准模型分别提供了11%和9%的性能改进。",
    "en_tdlr": "This study utilizes advanced machine learning models and multivariable input to forecast emergency department crowding, showing that N-BEATS and LightGBM outperform benchmarks with respective improvements of 11% and 9%."
}