{
    "title": "Multiscale Contextual Learning for Speech Emotion Recognition in Emergency Call Center Conversations. (arXiv:2308.14894v1 [cs.CL])",
    "abstract": "Emotion recognition in conversations is essential for ensuring advanced human-machine interactions. However, creating robust and accurate emotion recognition systems in real life is challenging, mainly due to the scarcity of emotion datasets collected in the wild and the inability to take into account the dialogue context. The CEMO dataset, composed of conversations between agents and patients during emergency calls to a French call center, fills this gap. The nature of these interactions highlights the role of the emotional flow of the conversation in predicting patient emotions, as context can often make a difference in understanding actual feelings. This paper presents a multi-scale conversational context learning approach for speech emotion recognition, which takes advantage of this hypothesis. We investigated this approach on both speech transcriptions and acoustic segments. Experimentally, our method uses the previous or next information of the targeted segment. In the text domai",
    "link": "http://arxiv.org/abs/2308.14894",
    "context": "Title: Multiscale Contextual Learning for Speech Emotion Recognition in Emergency Call Center Conversations. (arXiv:2308.14894v1 [cs.CL])\nAbstract: Emotion recognition in conversations is essential for ensuring advanced human-machine interactions. However, creating robust and accurate emotion recognition systems in real life is challenging, mainly due to the scarcity of emotion datasets collected in the wild and the inability to take into account the dialogue context. The CEMO dataset, composed of conversations between agents and patients during emergency calls to a French call center, fills this gap. The nature of these interactions highlights the role of the emotional flow of the conversation in predicting patient emotions, as context can often make a difference in understanding actual feelings. This paper presents a multi-scale conversational context learning approach for speech emotion recognition, which takes advantage of this hypothesis. We investigated this approach on both speech transcriptions and acoustic segments. Experimentally, our method uses the previous or next information of the targeted segment. In the text domai",
    "path": "papers/23/08/2308.14894.json",
    "total_tokens": 892,
    "translated_title": "用于紧急呼叫中心对话中的语音情绪识别的多尺度上下文学习",
    "translated_abstract": "对话中的情绪识别对于确保先进的人机交互至关重要。然而，在现实生活中创建稳健准确的情绪识别系统是具有挑战性的，主要是由于野外情绪数据集的稀缺性以及无法考虑对话上下文。CEMO数据集填补了这一空白，该数据集由法国呼叫中心的代理人和患者之间的紧急呼叫对话组成。这些互动的性质突出了对话中情绪流的作用，可以在理解实际感受方面通常产生差异。本文提出了一种多尺度对话上下文学习方法进行语音情绪识别，利用了这个假设。我们在语音转录和声学片段上对这种方法进行了研究。实验方法使用了目标片段的前一段或后一段信息。",
    "tldr": "本文介绍了一种用于语音情绪识别的多尺度对话上下文学习方法，该方法在紧急呼叫中心对话中取得了较好的效果。通过分析对话中的情绪流动并利用上下文信息，提高了情绪识别的准确性和鲁棒性。",
    "en_tdlr": "This paper presents a multi-scale conversational context learning approach for speech emotion recognition, which has shown good performance in emergency call center conversations. By analyzing the emotional flow in the conversations and incorporating contextual information, it enhances the accuracy and robustness of emotion recognition."
}