{
    "title": "Adversarial Training of Denoising Diffusion Model Using Dual Discriminators for High-Fidelity Multi-Speaker TTS. (arXiv:2308.01573v1 [cs.SD])",
    "abstract": "The diffusion model is capable of generating high-quality data through a probabilistic approach. However, it suffers from the drawback of slow generation speed due to the requirement of a large number of time steps. To address this limitation, recent models such as denoising diffusion implicit models (DDIM) focus on generating samples without directly modeling the probability distribution, while models like denoising diffusion generative adversarial networks (GAN) combine diffusion processes with GANs. In the field of speech synthesis, a recent diffusion speech synthesis model called DiffGAN-TTS, utilizing the structure of GANs, has been introduced and demonstrates superior performance in both speech quality and generation speed. In this paper, to further enhance the performance of DiffGAN-TTS, we propose a speech synthesis model with two discriminators: a diffusion discriminator for learning the distribution of the reverse process and a spectrogram discriminator for learning the distr",
    "link": "http://arxiv.org/abs/2308.01573",
    "context": "Title: Adversarial Training of Denoising Diffusion Model Using Dual Discriminators for High-Fidelity Multi-Speaker TTS. (arXiv:2308.01573v1 [cs.SD])\nAbstract: The diffusion model is capable of generating high-quality data through a probabilistic approach. However, it suffers from the drawback of slow generation speed due to the requirement of a large number of time steps. To address this limitation, recent models such as denoising diffusion implicit models (DDIM) focus on generating samples without directly modeling the probability distribution, while models like denoising diffusion generative adversarial networks (GAN) combine diffusion processes with GANs. In the field of speech synthesis, a recent diffusion speech synthesis model called DiffGAN-TTS, utilizing the structure of GANs, has been introduced and demonstrates superior performance in both speech quality and generation speed. In this paper, to further enhance the performance of DiffGAN-TTS, we propose a speech synthesis model with two discriminators: a diffusion discriminator for learning the distribution of the reverse process and a spectrogram discriminator for learning the distr",
    "path": "papers/23/08/2308.01573.json",
    "total_tokens": 872,
    "translated_title": "使用双对抗器对去噪扩散模型进行对抗训练以实现高保真多人说话人 TTS",
    "translated_abstract": "扩散模型通过概率方法能够生成高质量的数据。然而，由于需要大量的时间步骤，其生成速度缓慢。为了解决这个限制，最近的模型，如去噪扩散隐式模型 (DDIM)，专注于在不直接建模概率分布的情况下生成样本，而像去噪扩散生成对抗网络 (GAN) 这样的模型将扩散过程与 GAN 结合。在语音合成领域，一种最近的扩散语音合成模型叫做 DiffGAN-TTS，利用了 GAN 的结构，展现了在语音质量和生成速度方面的卓越性能。在本文中，为了进一步提升 DiffGAN-TTS 的性能，我们提出了一个具有两个鉴别器的语音合成模型：一个负责学习逆过程分布的扩散鉴别器和一个负责学习声谱图分布的声谱图鉴别器。",
    "tldr": "本文提出了一种具有双鉴别器的语音合成模型，以进一步提升 DiffGAN-TTS 的性能。该模型利用扩散鉴别器学习逆过程分布，并利用声谱图鉴别器学习声谱图分布。"
}