{
    "title": "feather -- a Python SDK to share and deploy models. (arXiv:2308.02838v1 [cs.AI])",
    "abstract": "At its core, feather was a tool that allowed model developers to build shareable user interfaces for their models in under 20 lines of code. Using the Python SDK, developers specified visual components that users would interact with. (e.g. a FileUpload component to allow users to upload a file). Our service then provided 1) a URL that allowed others to access and use the model visually via a user interface; 2) an API endpoint to allow programmatic requests to a model. In this paper, we discuss feather's motivations and the value we intended to offer AI researchers and developers. For example, the SDK can support multi-step models and can be extended to run automatic evaluation against held out datasets. We additionally provide comprehensive technical and implementation details.  N.B. feather is presently a dormant project. We have open sourced our code for research purposes: https://github.com/feather-ai/",
    "link": "http://arxiv.org/abs/2308.02838",
    "context": "Title: feather -- a Python SDK to share and deploy models. (arXiv:2308.02838v1 [cs.AI])\nAbstract: At its core, feather was a tool that allowed model developers to build shareable user interfaces for their models in under 20 lines of code. Using the Python SDK, developers specified visual components that users would interact with. (e.g. a FileUpload component to allow users to upload a file). Our service then provided 1) a URL that allowed others to access and use the model visually via a user interface; 2) an API endpoint to allow programmatic requests to a model. In this paper, we discuss feather's motivations and the value we intended to offer AI researchers and developers. For example, the SDK can support multi-step models and can be extended to run automatic evaluation against held out datasets. We additionally provide comprehensive technical and implementation details.  N.B. feather is presently a dormant project. We have open sourced our code for research purposes: https://github.com/feather-ai/",
    "path": "papers/23/08/2308.02838.json",
    "total_tokens": 771,
    "translated_title": "feather -- 一个用于分享和部署模型的Python SDK",
    "translated_abstract": "在其核心，feather是一个工具，允许模型开发人员仅用不到20行代码构建可共享的用户界面。使用Python SDK，开发人员可以指定用户将与之交互的视觉组件（例如，FileUpload组件，允许用户上传文件）。我们的服务提供了以下功能：1）URL，允许其他人通过用户界面进行可视化访问和使用模型；2）API端点，允许对模型发出编程请求。在本文中，我们讨论了feather的动机和我们打算为AI研究人员和开发人员提供的价值。例如，该SDK支持多步骤模型，并可扩展以对保留数据集进行自动评估。我们还提供了详尽的技术和实现细节。注意，feather目前是一个休眠项目。我们已经将我们的代码开源用于研究目的：https://github.com/feather-ai/",
    "tldr": "feather是一个Python SDK，可以帮助模型开发人员用很少的代码构建可共享的用户界面，并提供URL和API端点供其他人访问和使用模型。"
}