{
    "title": "AATCT-IDS: A Benchmark Abdominal Adipose Tissue CT Image Dataset for Image Denoising, Semantic Segmentation, and Radiomics Evaluation. (arXiv:2308.08172v1 [eess.IV])",
    "abstract": "Methods: In this study, a benchmark \\emph{Abdominal Adipose Tissue CT Image Dataset} (AATTCT-IDS) containing 300 subjects is prepared and published. AATTCT-IDS publics 13,732 raw CT slices, and the researchers individually annotate the subcutaneous and visceral adipose tissue regions of 3,213 of those slices that have the same slice distance to validate denoising methods, train semantic segmentation models, and study radiomics. For different tasks, this paper compares and analyzes the performance of various methods on AATTCT-IDS by combining the visualization results and evaluation data. Thus, verify the research potential of this data set in the above three types of tasks.  Results: In the comparative study of image denoising, algorithms using a smoothing strategy suppress mixed noise at the expense of image details and obtain better evaluation data. Methods such as BM3D preserve the original image structure better, although the evaluation data are slightly lower. The results show sig",
    "link": "http://arxiv.org/abs/2308.08172",
    "context": "Title: AATCT-IDS: A Benchmark Abdominal Adipose Tissue CT Image Dataset for Image Denoising, Semantic Segmentation, and Radiomics Evaluation. (arXiv:2308.08172v1 [eess.IV])\nAbstract: Methods: In this study, a benchmark \\emph{Abdominal Adipose Tissue CT Image Dataset} (AATTCT-IDS) containing 300 subjects is prepared and published. AATTCT-IDS publics 13,732 raw CT slices, and the researchers individually annotate the subcutaneous and visceral adipose tissue regions of 3,213 of those slices that have the same slice distance to validate denoising methods, train semantic segmentation models, and study radiomics. For different tasks, this paper compares and analyzes the performance of various methods on AATTCT-IDS by combining the visualization results and evaluation data. Thus, verify the research potential of this data set in the above three types of tasks.  Results: In the comparative study of image denoising, algorithms using a smoothing strategy suppress mixed noise at the expense of image details and obtain better evaluation data. Methods such as BM3D preserve the original image structure better, although the evaluation data are slightly lower. The results show sig",
    "path": "papers/23/08/2308.08172.json",
    "total_tokens": 966,
    "translated_title": "AATCT-IDS: 一款用于图像去噪、语义分割和放射学评估的腹部脂肪CT图像数据集的基准",
    "translated_abstract": "本研究准备并发布了一款名为AATCT-IDS的基准腹部脂肪CT图像数据集，其中包含300个受试者。AATCT-IDS公开了13,732个原始CT切片，并且研究人员对其中3,213个具有相同切片距离的切片分别进行了皮下和腹腔内脂肪组织区域的注释，以验证去噪方法，训练语义分割模型，并进行放射学研究。本文通过结合可视化结果和评估数据，比较和分析了各种方法在AATCT-IDS上的性能，从而验证了该数据集在上述三种类型的任务中的研究潜力。",
    "tldr": "这项研究准备并发布了一款名为AATCT-IDS的基准腹部脂肪CT图像数据集，用于图像去噪、语义分割和放射学评估。通过对数据集中注释的脂肪组织区域进行研究，揭示了在不同任务中各种方法的性能差异，并验证了该数据集在这些任务中的研究潜力。",
    "en_tdlr": "This study prepares and publishes a benchmark abdominal adipose tissue CT image dataset called AATCT-IDS for image denoising, semantic segmentation, and radiomics evaluation. By studying the annotated adipose tissue regions in the dataset, it reveals the performance differences of various methods in different tasks and validates the research potential of this dataset in these tasks."
}