{
    "title": "End-to-End Open Vocabulary Keyword Search With Multilingual Neural Representations. (arXiv:2308.08027v1 [eess.AS])",
    "abstract": "Conventional keyword search systems operate on automatic speech recognition (ASR) outputs, which causes them to have a complex indexing and search pipeline. This has led to interest in ASR-free approaches to simplify the search procedure. We recently proposed a neural ASR-free keyword search model which achieves competitive performance while maintaining an efficient and simplified pipeline, where queries and documents are encoded with a pair of recurrent neural network encoders and the encodings are combined with a dot-product. In this article, we extend this work with multilingual pretraining and detailed analysis of the model. Our experiments show that the proposed multilingual training significantly improves the model performance and that despite not matching a strong ASR-based conventional keyword search system for short queries and queries comprising in-vocabulary words, the proposed model outperforms the ASR-based system for long queries and queries that do not appear in the trai",
    "link": "http://arxiv.org/abs/2308.08027",
    "context": "Title: End-to-End Open Vocabulary Keyword Search With Multilingual Neural Representations. (arXiv:2308.08027v1 [eess.AS])\nAbstract: Conventional keyword search systems operate on automatic speech recognition (ASR) outputs, which causes them to have a complex indexing and search pipeline. This has led to interest in ASR-free approaches to simplify the search procedure. We recently proposed a neural ASR-free keyword search model which achieves competitive performance while maintaining an efficient and simplified pipeline, where queries and documents are encoded with a pair of recurrent neural network encoders and the encodings are combined with a dot-product. In this article, we extend this work with multilingual pretraining and detailed analysis of the model. Our experiments show that the proposed multilingual training significantly improves the model performance and that despite not matching a strong ASR-based conventional keyword search system for short queries and queries comprising in-vocabulary words, the proposed model outperforms the ASR-based system for long queries and queries that do not appear in the trai",
    "path": "papers/23/08/2308.08027.json",
    "total_tokens": 880,
    "translated_title": "基于多语言神经表示的端到端开放词汇关键词搜索",
    "translated_abstract": "传统的关键词搜索系统在自动语音识别（ASR）输出上运行，导致它们具有复杂的索引和搜索流程。因此，人们开始对不需要ASR的方法感兴趣，以简化搜索流程。我们最近提出了一种神经网络ASR-free关键词搜索模型，它在保持高效和简化的同时，实现了竞争性的性能，其中查询和文档通过一对循环神经网络编码器进行编码，编码通过点积进行组合。在本文中，我们通过多语言预训练和对模型的详细分析对这项工作进行了扩展。我们的实验表明，所提出的多语言训练显著提高了模型性能，并且尽管在短查询和词汇内的查询方面未能与强基于ASR的传统关键词搜索系统匹配，但所提出的模型在长查询和未出现在训练集的查询方面表现出色。",
    "tldr": "本论文提出了一种基于多语言神经表示的端到端开放词汇关键词搜索模型，相比于传统的基于自动语音识别的关键词搜索系统，在长查询和不在训练集中的查询方面表现出色。"
}