{
    "title": "Gentopia: A Collaborative Platform for Tool-Augmented LLMs. (arXiv:2308.04030v1 [cs.AI])",
    "abstract": "Augmented Language Models (ALMs) empower large language models with the ability to use tools, transforming them into intelligent agents for real-world interactions. However, most existing frameworks for ALMs, to varying degrees, are deficient in the following critical features: flexible customization, collaborative democratization, and holistic evaluation. We present gentopia, an ALM framework enabling flexible customization of agents through simple configurations, seamlessly integrating various language models, task formats, prompting modules, and plugins into a unified paradigm. Furthermore, we establish gentpool, a public platform enabling the registration and sharing of user-customized agents. Agents registered in gentpool are composable such that they can be assembled together for agent collaboration, advancing the democratization of artificial intelligence. To ensure high-quality agents, gentbench, an integral component of gentpool, is designed to thoroughly evaluate user-customi",
    "link": "http://arxiv.org/abs/2308.04030",
    "context": "Title: Gentopia: A Collaborative Platform for Tool-Augmented LLMs. (arXiv:2308.04030v1 [cs.AI])\nAbstract: Augmented Language Models (ALMs) empower large language models with the ability to use tools, transforming them into intelligent agents for real-world interactions. However, most existing frameworks for ALMs, to varying degrees, are deficient in the following critical features: flexible customization, collaborative democratization, and holistic evaluation. We present gentopia, an ALM framework enabling flexible customization of agents through simple configurations, seamlessly integrating various language models, task formats, prompting modules, and plugins into a unified paradigm. Furthermore, we establish gentpool, a public platform enabling the registration and sharing of user-customized agents. Agents registered in gentpool are composable such that they can be assembled together for agent collaboration, advancing the democratization of artificial intelligence. To ensure high-quality agents, gentbench, an integral component of gentpool, is designed to thoroughly evaluate user-customi",
    "path": "papers/23/08/2308.04030.json",
    "total_tokens": 804,
    "translated_title": "Gentopia: 一个用于增强语言模型的协作平台",
    "translated_abstract": "增强语言模型（ALM）赋予了大型语言模型使用工具的能力，将其转化为能够进行真实世界交互的智能代理。然而，现有的大部分ALM框架在以下关键特性方面存在不足：灵活的定制化、协作民主化和整体评估。我们提出了Gentopia，一种ALM框架，通过简单的配置实现代理的灵活定制，将各种语言模型、任务格式、提示模块和插件无缝集成到一个统一的范式中。此外，我们建立了Gentpool，一个公共平台，用于注册和共享用户定制的代理。在Gentpool中注册的代理可组合在一起进行代理协作，推动人工智能的民主化。为了确保高质量的代理，Gentbench是Gentpool的一个重要组成部分，旨在全面评估用户定制的代理。",
    "tldr": "Gentopia是一个协作平台，用于增强语言模型，并具有灵活的定制、协作民主化和综合评估的特性。",
    "en_tdlr": "Gentopia is a collaborative platform for tool-augmented language models, offering flexible customization, collaborative democratization, and holistic evaluation."
}