{
    "title": "Synthetic data generation method for hybrid image-tabular data using two generative adversarial networks. (arXiv:2308.07573v1 [eess.IV])",
    "abstract": "The generation of synthetic medical records using generative adversarial networks (GANs) has become increasingly important for addressing privacy concerns and promoting data sharing in the medical field. In this paper, we propose a novel method for generating synthetic hybrid medical records consisting of chest X-ray images (CXRs) and structured tabular data (including anthropometric data and laboratory tests) using an auto-encoding GAN ({\\alpha}GAN) and a conditional tabular GAN (CTGAN). Our approach involves training a {\\alpha}GAN model on a large public database (pDB) to reduce the dimensionality of CXRs. We then applied the trained encoder of the GAN model to the images in original database (oDB) to obtain the latent vectors. These latent vectors were combined with tabular data in oDB, and these joint data were used to train the CTGAN model. We successfully generated diverse synthetic records of hybrid CXR and tabular data, maintaining correspondence between them. We evaluated this",
    "link": "http://arxiv.org/abs/2308.07573",
    "context": "Title: Synthetic data generation method for hybrid image-tabular data using two generative adversarial networks. (arXiv:2308.07573v1 [eess.IV])\nAbstract: The generation of synthetic medical records using generative adversarial networks (GANs) has become increasingly important for addressing privacy concerns and promoting data sharing in the medical field. In this paper, we propose a novel method for generating synthetic hybrid medical records consisting of chest X-ray images (CXRs) and structured tabular data (including anthropometric data and laboratory tests) using an auto-encoding GAN ({\\alpha}GAN) and a conditional tabular GAN (CTGAN). Our approach involves training a {\\alpha}GAN model on a large public database (pDB) to reduce the dimensionality of CXRs. We then applied the trained encoder of the GAN model to the images in original database (oDB) to obtain the latent vectors. These latent vectors were combined with tabular data in oDB, and these joint data were used to train the CTGAN model. We successfully generated diverse synthetic records of hybrid CXR and tabular data, maintaining correspondence between them. We evaluated this",
    "path": "papers/23/08/2308.07573.json",
    "total_tokens": 920,
    "translated_title": "使用两个生成对抗网络对混合图像-表格数据进行合成数据生成的方法",
    "translated_abstract": "使用生成对抗网络（GANs）生成合成医学记录已经变得越来越重要，以应对医学领域的隐私问题并促进数据共享。在本文中，我们提出了一种新的方法，使用自动编码GAN（αGAN）和条件表格GAN（CTGAN）生成合成的混合医学记录，其中包括胸部X射线图像（CXRs）和结构化表格数据（包括人体测量数据和实验室测试）。我们的方法涉及在一个大的公共数据库（pDB）上训练一个αGAN模型，以降低CXRs的维度。然后，我们将训练好的GAN模型的编码器应用于原始数据库（oDB）中的图像，以获得潜在向量。这些潜在向量与oDB中的表格数据相结合，并使用这些联合数据来训练CTGAN模型。我们成功地生成了多样化的混合CXRs和表格数据合成记录，并保持了它们之间的对应关系。我们对这个方法进行了评估。",
    "tldr": "本论文提出了一种使用两个生成对抗网络（GANs）生成合成医学记录的方法，可以生成包含胸部X射线图像和结构化表格数据的多样化合成记录，并保持了图像和数据之间的对应关系。",
    "en_tdlr": "This paper proposes a method to generate synthetic medical records consisting of chest X-ray images and structured tabular data using two generative adversarial networks (GANs), which successfully maintains the correspondence between the generated images and the tabular data."
}