{
    "title": "DIVERSIFY: A General Framework for Time Series Out-of-distribution Detection and Generalization. (arXiv:2308.02282v1 [cs.LG])",
    "abstract": "Time series remains one of the most challenging modalities in machine learning research. The out-of-distribution (OOD) detection and generalization on time series tend to suffer due to its non-stationary property, i.e., the distribution changes over time. The dynamic distributions inside time series pose great challenges to existing algorithms to identify invariant distributions since they mainly focus on the scenario where the domain information is given as prior knowledge. In this paper, we attempt to exploit subdomains within a whole dataset to counteract issues induced by non-stationary for generalized representation learning. We propose DIVERSIFY, a general framework, for OOD detection and generalization on dynamic distributions of time series. DIVERSIFY takes an iterative process: it first obtains the \"worst-case\" latent distribution scenario via adversarial training, then reduces the gap between these latent distributions. We implement DIVERSIFY via combining existing OOD detect",
    "link": "http://arxiv.org/abs/2308.02282",
    "context": "Title: DIVERSIFY: A General Framework for Time Series Out-of-distribution Detection and Generalization. (arXiv:2308.02282v1 [cs.LG])\nAbstract: Time series remains one of the most challenging modalities in machine learning research. The out-of-distribution (OOD) detection and generalization on time series tend to suffer due to its non-stationary property, i.e., the distribution changes over time. The dynamic distributions inside time series pose great challenges to existing algorithms to identify invariant distributions since they mainly focus on the scenario where the domain information is given as prior knowledge. In this paper, we attempt to exploit subdomains within a whole dataset to counteract issues induced by non-stationary for generalized representation learning. We propose DIVERSIFY, a general framework, for OOD detection and generalization on dynamic distributions of time series. DIVERSIFY takes an iterative process: it first obtains the \"worst-case\" latent distribution scenario via adversarial training, then reduces the gap between these latent distributions. We implement DIVERSIFY via combining existing OOD detect",
    "path": "papers/23/08/2308.02282.json",
    "total_tokens": 901,
    "translated_title": "DIVERSIFY: 一般化时间序列离群检测和推广的通用框架",
    "translated_abstract": "时间序列仍然是机器学习研究中最具挑战性的模态之一。由于其非平稳性质，时间序列的离群检测和推广往往受到困扰，即分布随时间变化。时间序列中的动态分布给现有算法带来了很大的挑战，因为它们主要关注领域信息已知的情况。本文尝试利用数据集中的子域来对抗非平稳性引发的问题，实现广义表示学习。我们提出了DIVERSIFY，一个针对动态时间序列分布的离群检测和推广的通用框架。DIVERSIFY采用迭代过程：首先通过对抗训练获得“最坏情况”潜在分布情景，然后减小这些潜在分布之间的差距。我们通过结合现有的离群检测方法实现了DIVERSIFY。",
    "tldr": "DIVERSIFY是一个通用框架，用于解决时间序列离群检测和推广的挑战，通过利用数据集中的子域来对抗时间序列的非平稳性，并通过迭代过程减小潜在分布之间的差距。",
    "en_tdlr": "DIVERSIFY is a general framework that addresses the challenges of time series out-of-distribution detection and generalization by leveraging subdomains within the dataset to counteract the non-stationary property of time series, and reducing the gap between latent distributions through an iterative process."
}