{
    "title": "Are Sex-based Physiological Differences the Cause of Gender Bias for Chest X-ray Diagnosis?. (arXiv:2308.05129v1 [eess.IV])",
    "abstract": "While many studies have assessed the fairness of AI algorithms in the medical field, the causes of differences in prediction performance are often unknown. This lack of knowledge about the causes of bias hampers the efficacy of bias mitigation, as evidenced by the fact that simple dataset balancing still often performs best in reducing performance gaps but is unable to resolve all performance differences. In this work, we investigate the causes of gender bias in machine learning-based chest X-ray diagnosis. In particular, we explore the hypothesis that breast tissue leads to underexposure of the lungs and causes lower model performance. Methodologically, we propose a new sampling method which addresses the highly skewed distribution of recordings per patient in two widely used public datasets, while at the same time reducing the impact of label errors. Our comprehensive analysis of gender differences across diseases, datasets, and gender representations in the training set shows that d",
    "link": "http://arxiv.org/abs/2308.05129",
    "context": "Title: Are Sex-based Physiological Differences the Cause of Gender Bias for Chest X-ray Diagnosis?. (arXiv:2308.05129v1 [eess.IV])\nAbstract: While many studies have assessed the fairness of AI algorithms in the medical field, the causes of differences in prediction performance are often unknown. This lack of knowledge about the causes of bias hampers the efficacy of bias mitigation, as evidenced by the fact that simple dataset balancing still often performs best in reducing performance gaps but is unable to resolve all performance differences. In this work, we investigate the causes of gender bias in machine learning-based chest X-ray diagnosis. In particular, we explore the hypothesis that breast tissue leads to underexposure of the lungs and causes lower model performance. Methodologically, we propose a new sampling method which addresses the highly skewed distribution of recordings per patient in two widely used public datasets, while at the same time reducing the impact of label errors. Our comprehensive analysis of gender differences across diseases, datasets, and gender representations in the training set shows that d",
    "path": "papers/23/08/2308.05129.json",
    "total_tokens": 936,
    "translated_title": "性别生理差异是导致胸部X射线诊断性别偏见的原因吗？",
    "translated_abstract": "虽然许多研究评估了医学领域AI算法的公平性，但是预测性能差异的原因往往是未知的。对偏见原因缺乏了解妨碍了偏见缓解的有效性，简单的数据集平衡通常是减小性能差距的最好方法，但无法解决所有性能差异。在这项工作中，我们研究了机器学习基于胸部X射线诊断中性别偏见的原因。特别地，我们探讨了乳腺组织导致肺部曝光不足并导致模型性能降低的假设。在方法上，我们提出了一种新的采样方法，解决了两个广泛使用的公共数据集中记录每个患者强烈偏斜的分布，并同时减少了标签错误的影响。我们在疾病、数据集和训练集中性别表示方面对性别差异进行了全面分析，发现...",
    "tldr": "本论文研究了机器学习基于胸部X射线诊断中性别偏见的原因，发现乳腺组织导致肺部曝光不足从而降低模型性能，并提出了一种新的采样方法来解决记录分布偏斜和标签错误问题。",
    "en_tdlr": "This paper investigates the causes of gender bias in machine learning-based chest X-ray diagnosis, finding that breast tissue leads to underexposure of the lungs and reduces model performance, and proposes a new sampling method to address the issues of skewed recording distribution and label errors."
}