{
    "title": "FrFT based estimation of linear and nonlinear impairments using Vision Transformer. (arXiv:2308.13575v1 [eess.SP])",
    "abstract": "To comprehensively assess optical fiber communication system conditions, it is essential to implement joint estimation of the following four critical impairments: nonlinear signal-to-noise ratio (SNRNL), optical signal-to-noise ratio (OSNR), chromatic dispersion (CD) and differential group delay (DGD). However, current studies only achieve identifying a limited number of impairments within a narrow range, due to limitations in network capabilities and lack of unified representation of impairments. To address these challenges, we adopt time-frequency signal processing based on fractional Fourier transform (FrFT) to achieve the unified representation of impairments, while employing a Transformer based neural networks (NN) to break through network performance limitations. To verify the effectiveness of the proposed estimation method, the numerical simulation is carried on a 5-channel polarization-division-multiplexed quadrature phase shift keying (PDM-QPSK) long haul optical transmission ",
    "link": "http://arxiv.org/abs/2308.13575",
    "context": "Title: FrFT based estimation of linear and nonlinear impairments using Vision Transformer. (arXiv:2308.13575v1 [eess.SP])\nAbstract: To comprehensively assess optical fiber communication system conditions, it is essential to implement joint estimation of the following four critical impairments: nonlinear signal-to-noise ratio (SNRNL), optical signal-to-noise ratio (OSNR), chromatic dispersion (CD) and differential group delay (DGD). However, current studies only achieve identifying a limited number of impairments within a narrow range, due to limitations in network capabilities and lack of unified representation of impairments. To address these challenges, we adopt time-frequency signal processing based on fractional Fourier transform (FrFT) to achieve the unified representation of impairments, while employing a Transformer based neural networks (NN) to break through network performance limitations. To verify the effectiveness of the proposed estimation method, the numerical simulation is carried on a 5-channel polarization-division-multiplexed quadrature phase shift keying (PDM-QPSK) long haul optical transmission ",
    "path": "papers/23/08/2308.13575.json",
    "total_tokens": 840,
    "translated_title": "基于视觉变换器的FrFT算法估计线性和非线性失真",
    "translated_abstract": "为了全面评估光纤通信系统的情况，必须实施以下四个关键失真的联合估计：非线性信噪比（SNRNL），光信噪比（OSNR），色散（CD）和差分组延迟（DGD）。然而，由于网络能力的限制和失真统一表示的缺乏，当前研究只能在有限的范围内识别少数失真。为了应对这些挑战，我们采用基于分数傅里叶变换（FrFT）的时频信号处理来实现失真的统一表示，同时采用基于Transformer的神经网络（NN）来突破网络性能的限制。为了验证所提出的估计方法的有效性，我们对5通道偏振分复用四相移键控（PDM-QPSK）长距离光传输进行了数值模拟。",
    "tldr": "本论文提出了基于FrFT和Transformer的联合估计方法，用于统一表示和识别光纤通信系统中的线性和非线性失真。在数值模拟中验证了该方法的有效性。"
}