{
    "title": "Unveiling Emotions from EEG: A GRU-Based Approach. (arXiv:2308.02778v1 [eess.SP])",
    "abstract": "One of the most important study areas in affective computing is emotion identification using EEG data. In this study, the Gated Recurrent Unit (GRU) algorithm, which is a type of Recurrent Neural Networks (RNNs), is tested to see if it can use EEG signals to predict emotional states. Our publicly accessible dataset consists of resting neutral data as well as EEG recordings from people who were exposed to stimuli evoking happy, neutral, and negative emotions. For the best feature extraction, we pre-process the EEG data using artifact removal, bandpass filters, and normalization methods. With 100% accuracy on the validation set, our model produced outstanding results by utilizing the GRU's capacity to capture temporal dependencies. When compared to other machine learning techniques, our GRU model's Extreme Gradient Boosting Classifier had the highest accuracy. Our investigation of the confusion matrix revealed insightful information about the performance of the model, enabling precise em",
    "link": "http://arxiv.org/abs/2308.02778",
    "context": "Title: Unveiling Emotions from EEG: A GRU-Based Approach. (arXiv:2308.02778v1 [eess.SP])\nAbstract: One of the most important study areas in affective computing is emotion identification using EEG data. In this study, the Gated Recurrent Unit (GRU) algorithm, which is a type of Recurrent Neural Networks (RNNs), is tested to see if it can use EEG signals to predict emotional states. Our publicly accessible dataset consists of resting neutral data as well as EEG recordings from people who were exposed to stimuli evoking happy, neutral, and negative emotions. For the best feature extraction, we pre-process the EEG data using artifact removal, bandpass filters, and normalization methods. With 100% accuracy on the validation set, our model produced outstanding results by utilizing the GRU's capacity to capture temporal dependencies. When compared to other machine learning techniques, our GRU model's Extreme Gradient Boosting Classifier had the highest accuracy. Our investigation of the confusion matrix revealed insightful information about the performance of the model, enabling precise em",
    "path": "papers/23/08/2308.02778.json",
    "total_tokens": 910,
    "translated_title": "从脑电图中揭示情绪：一种基于GRU的方法",
    "translated_abstract": "情感计算中最重要的研究领域之一是使用脑电图数据进行情绪识别。本研究测试了门控循环单元（GRU）算法，这是一种循环神经网络（RNNs）的类型，看它是否能够利用脑电图信号来预测情绪状态。我们的公开可访问数据集包括静息中性数据以及接受引发快乐、中性和消极情绪的刺激的人的脑电图记录。为了进行最佳特征提取，我们使用伪迹去除、带通滤波器和归一化方法对脑电图数据进行预处理。在验证集上达到100%的准确率后，我们的模型利用GRU捕捉时间依赖性的能力取得了出色的结果。与其他机器学习技术相比，我们的GRU模型的极端梯度提升分类器具有最高的准确率。我们对混淆矩阵进行的详细研究揭示了有关模型性能的有价值信息，从而使精准的情绪识别成为可能。",
    "tldr": "本研究通过使用GRU算法对脑电图数据进行情绪识别，取得了出色的结果，并且相对于其他机器学习技术具有最高的准确率。",
    "en_tdlr": "This study achieves outstanding results in emotion identification using EEG data by utilizing a GRU algorithm, with the highest accuracy compared to other machine learning techniques."
}