{
    "title": "Fountain -- an intelligent contextual assistant combining knowledge representation and language models for manufacturing risk identification. (arXiv:2308.00364v1 [cs.CL])",
    "abstract": "Deviations from the approved design or processes during mass production can lead to unforeseen risks. However, these changes are sometimes necessary due to changes in the product design characteristics or an adaptation in the manufacturing process. A major challenge is to identify these risks early in the workflow so that failures leading to warranty claims can be avoided. We developed Fountain as a contextual assistant integrated in the deviation management workflow that helps in identifying the risks based on the description of the existing design and process criteria and the proposed deviation. In the manufacturing context, it is important that the assistant provides recommendations that are explainable and consistent. We achieve this through a combination of the following two components 1) language models finetuned for domain specific semantic similarity and, 2) knowledge representation in the form of a property graph derived from the bill of materials, Failure Modes and Effect Ana",
    "link": "http://arxiv.org/abs/2308.00364",
    "context": "Title: Fountain -- an intelligent contextual assistant combining knowledge representation and language models for manufacturing risk identification. (arXiv:2308.00364v1 [cs.CL])\nAbstract: Deviations from the approved design or processes during mass production can lead to unforeseen risks. However, these changes are sometimes necessary due to changes in the product design characteristics or an adaptation in the manufacturing process. A major challenge is to identify these risks early in the workflow so that failures leading to warranty claims can be avoided. We developed Fountain as a contextual assistant integrated in the deviation management workflow that helps in identifying the risks based on the description of the existing design and process criteria and the proposed deviation. In the manufacturing context, it is important that the assistant provides recommendations that are explainable and consistent. We achieve this through a combination of the following two components 1) language models finetuned for domain specific semantic similarity and, 2) knowledge representation in the form of a property graph derived from the bill of materials, Failure Modes and Effect Ana",
    "path": "papers/23/08/2308.00364.json",
    "total_tokens": 889,
    "translated_title": "Fountain --一个智能上下文助手，结合知识表示和语言模型，用于制造风险识别",
    "translated_abstract": "在大规模生产过程中，与批准的设计或流程偏离会导致意想不到的风险。然而，这些变化有时是必要的，因为产品设计特征或制造过程的适应性发生了变化。一个主要挑战是在工作流程的早期阶段识别这些风险，以避免导致保修索赔的故障。我们开发了Fountain作为一个上下文助手，集成在偏差管理工作流程中，通过对现有设计和流程准则以及提出的偏差的描述来帮助识别风险。在制造环境中，该助手提供的建议必须是可解释和一致的。我们通过以下两个组件的结合实现了这一点：1）为特定领域语义相似性微调的语言模型，和2）以物料清单、失效模式和效应分析为基础的属性图的知识表示。",
    "tldr": "Fountain是一个智能上下文助手，将知识表示和语言模型结合，用于制造风险识别。它通过描述现有设计和流程准则以及提出的偏差来帮助识别风险，并提供可解释和一致的建议。",
    "en_tdlr": "Fountain is an intelligent contextual assistant that combines knowledge representation and language models for manufacturing risk identification. It helps in identifying risks by describing existing design and process criteria and proposed deviation, and provides explainable and consistent recommendations."
}