{
    "title": "On Exact Bayesian Credible Sets for Classification and Pattern Recognition. (arXiv:2308.11037v1 [math.ST])",
    "abstract": "The current definition of a Bayesian credible set cannot, in general, achieve an arbitrarily preassigned credible level. This drawback is particularly acute for classification problems, where there are only a finite number of achievable credible levels. As a result, there is as of today no general way to construct an exact credible set for classification. In this paper, we introduce a generalized credible set that can achieve any preassigned credible level. The key insight is a simple connection between the Bayesian highest posterior density credible set and the Neyman--Pearson lemma, which, as far as we know, hasn't been noticed before. Using this connection, we introduce a randomized decision rule to fill the gaps among the discrete credible levels. Accompanying this methodology, we also develop the Steering Wheel Plot to represent the credible set, which is useful in visualizing the uncertainty in classification. By developing the exact credible set for discrete parameters, we make ",
    "link": "http://arxiv.org/abs/2308.11037",
    "context": "Title: On Exact Bayesian Credible Sets for Classification and Pattern Recognition. (arXiv:2308.11037v1 [math.ST])\nAbstract: The current definition of a Bayesian credible set cannot, in general, achieve an arbitrarily preassigned credible level. This drawback is particularly acute for classification problems, where there are only a finite number of achievable credible levels. As a result, there is as of today no general way to construct an exact credible set for classification. In this paper, we introduce a generalized credible set that can achieve any preassigned credible level. The key insight is a simple connection between the Bayesian highest posterior density credible set and the Neyman--Pearson lemma, which, as far as we know, hasn't been noticed before. Using this connection, we introduce a randomized decision rule to fill the gaps among the discrete credible levels. Accompanying this methodology, we also develop the Steering Wheel Plot to represent the credible set, which is useful in visualizing the uncertainty in classification. By developing the exact credible set for discrete parameters, we make ",
    "path": "papers/23/08/2308.11037.json",
    "total_tokens": 959,
    "translated_title": "关于分类和模式识别的精确贝叶斯可信区间",
    "translated_abstract": "目前的贝叶斯可信区间定义通常无法达到任意预先指定的可信水平。对于分类问题，这个缺点尤为严重，因为只有有限个可实现的可信水平。因此，迄今为止没有一种通用的方法可以构建一个精确的分类可信区间。在本文中，我们引入了一个广义的可信区间，可以实现任何预先指定的可信水平。关键洞察是贝叶斯最高后验密度可信区间和Neyman-Pearson引理之间的简单联系，在我们所知道的范围内，这一点之前还未被注意到。利用这个联系，我们引入了一个随机决策规则来填补离散的可信水平之间的空隙。除了这个方法论，我们还开发了“方向盘图”来表示可信区间，这在可视化分类的不确定性方面非常有用。通过为离散参数开发 准确的可信区间，我们进行了一项创新",
    "tldr": "本文提出了一个通用的可信区间，能够实现任意预先指定的可信水平。通过建立贝叶斯最高后验密度可信区间与Neyman-Pearson引理之间的简单联系，我们引入了一个随机决策规则来解决离散可信水平之间的空隙，并且开发了“方向盘图”来可视化分类的不确定性。",
    "en_tdlr": "This paper introduces a generalized credible set that can achieve any preassigned credible level. By establishing a simple connection between the Bayesian highest posterior density credible set and the Neyman-Pearson lemma, a randomized decision rule is introduced to fill the gaps among discrete credible levels, and a \"Steering Wheel Plot\" is developed to visualize the uncertainty in classification."
}