{
    "title": "Bayes Risk Consistency of Nonparametric Classification Rules for Spike Trains Data. (arXiv:2308.04796v1 [cs.IT])",
    "abstract": "Spike trains data find a growing list of applications in computational neuroscience, imaging, streaming data and finance. Machine learning strategies for spike trains are based on various neural network and probabilistic models. The probabilistic approach is relying on parametric or nonparametric specifications of the underlying spike generation model. In this paper we consider the two-class statistical classification problem for a class of spike train data characterized by nonparametrically specified intensity functions. We derive the optimal Bayes rule and next form the plug-in nonparametric kernel classifier. Asymptotical properties of the rules are established including the limit with respect to the increasing recording time interval and the size of a training set. In particular the convergence of the kernel classifier to the Bayes rule is proved. The obtained results are supported by a finite sample simulation studies.",
    "link": "http://arxiv.org/abs/2308.04796",
    "context": "Title: Bayes Risk Consistency of Nonparametric Classification Rules for Spike Trains Data. (arXiv:2308.04796v1 [cs.IT])\nAbstract: Spike trains data find a growing list of applications in computational neuroscience, imaging, streaming data and finance. Machine learning strategies for spike trains are based on various neural network and probabilistic models. The probabilistic approach is relying on parametric or nonparametric specifications of the underlying spike generation model. In this paper we consider the two-class statistical classification problem for a class of spike train data characterized by nonparametrically specified intensity functions. We derive the optimal Bayes rule and next form the plug-in nonparametric kernel classifier. Asymptotical properties of the rules are established including the limit with respect to the increasing recording time interval and the size of a training set. In particular the convergence of the kernel classifier to the Bayes rule is proved. The obtained results are supported by a finite sample simulation studies.",
    "path": "papers/23/08/2308.04796.json",
    "total_tokens": 879,
    "translated_title": "非参数分类规则在脉冲序列数据中的贝叶斯风险一致性",
    "translated_abstract": "脉冲序列数据在计算神经科学、成像、流数据和金融等领域应用日益增多。脉冲序列的机器学习策略基于各种神经网络和概率模型。概率方法依赖于底层脉冲生成模型的参数化或非参数化规范。本文考虑了由非参数强度函数表征的一类脉冲序列数据的二类统计分类问题。我们推导出最优的贝叶斯规则，并构建了插值的非参数核分类器。我们建立了规则的渐近性质，包括随着记录时间间隔和训练样本量的增加而收敛。特别是，我们证明了核分类器收敛到贝叶斯规则。通过有限样本的模拟研究验证了所得到的结果。",
    "tldr": "本文研究了非参数分类规则在脉冲序列数据中的贝叶斯风险一致性，并导出了最优的贝叶斯规则和插值的非参数核分类器。通过渐近性质证明了核分类器收敛到贝叶斯规则，并通过有限样本模拟研究进行了验证。"
}