{
    "title": "Mapping Computer Science Research: Trends, Influences, and Predictions. (arXiv:2308.00733v1 [cs.HC])",
    "abstract": "This paper explores the current trending research areas in the field of Computer Science (CS) and investigates the factors contributing to their emergence. Leveraging a comprehensive dataset comprising papers, citations, and funding information, we employ advanced machine learning techniques, including Decision Tree and Logistic Regression models, to predict trending research areas. Our analysis reveals that the number of references cited in research papers (Reference Count) plays a pivotal role in determining trending research areas making reference counts the most relevant factor that drives trend in the CS field. Additionally, the influence of NSF grants and patents on trending topics has increased over time. The Logistic Regression model outperforms the Decision Tree model in predicting trends, exhibiting higher accuracy, precision, recall, and F1 score. By surpassing a random guess baseline, our data-driven approach demonstrates higher accuracy and efficacy in identifying trending",
    "link": "http://arxiv.org/abs/2308.00733",
    "context": "Title: Mapping Computer Science Research: Trends, Influences, and Predictions. (arXiv:2308.00733v1 [cs.HC])\nAbstract: This paper explores the current trending research areas in the field of Computer Science (CS) and investigates the factors contributing to their emergence. Leveraging a comprehensive dataset comprising papers, citations, and funding information, we employ advanced machine learning techniques, including Decision Tree and Logistic Regression models, to predict trending research areas. Our analysis reveals that the number of references cited in research papers (Reference Count) plays a pivotal role in determining trending research areas making reference counts the most relevant factor that drives trend in the CS field. Additionally, the influence of NSF grants and patents on trending topics has increased over time. The Logistic Regression model outperforms the Decision Tree model in predicting trends, exhibiting higher accuracy, precision, recall, and F1 score. By surpassing a random guess baseline, our data-driven approach demonstrates higher accuracy and efficacy in identifying trending",
    "path": "papers/23/08/2308.00733.json",
    "total_tokens": 988,
    "translated_title": "计算机科学研究的映射：趋势，影响和预测",
    "translated_abstract": "本文探讨了计算机科学领域当前热门的研究领域，并调查了导致这些领域出现的因素。利用包含论文、引用和资金信息的综合数据集，我们采用了包括决策树和逻辑回归模型在内的先进机器学习技术来预测研究领域的趋势。我们的分析表明，在确定计算机科学领域的研究趋势中，研究论文中引用的参考文献数量（引用计数）起着关键作用，使引用计数成为推动计算机科学领域趋势的最相关因素。此外，NSF资助和专利对热门话题的影响随着时间的推移逐渐增加。逻辑回归模型在预测趋势方面优于决策树模型，表现出更高的准确性，精确率，召回率和F1得分。通过超越随机猜测基线，我们的数据驱动方法在识别研究趋势方面表现出更高的准确性和效力。",
    "tldr": "本文研究了计算机科学领域当前热门的研究领域，通过分析引用计数等因素，提出了一个数据驱动的方法来预测研究趋势。研究发现引用计数是确定趋势的最相关因素，同时NSF资助和专利对热门话题的影响在逐渐增加。"
}