{
    "title": "Proof of Deep Learning: Approaches, Challenges, and Future Directions. (arXiv:2308.16730v1 [cs.CR])",
    "abstract": "The rise of computational power has led to unprecedented performance gains for deep learning models. As more data becomes available and model architectures become more complex, the need for more computational power increases. On the other hand, since the introduction of Bitcoin as the first cryptocurrency and the establishment of the concept of blockchain as a distributed ledger, many variants and approaches have been proposed. However, many of them have one thing in common, which is the Proof of Work (PoW) consensus mechanism. PoW is mainly used to support the process of new block generation. While PoW has proven its robustness, its main drawback is that it requires a significant amount of processing power to maintain the security and integrity of the blockchain. This is due to applying brute force to solve a hashing puzzle. To utilize the computational power available in useful and meaningful work while keeping the blockchain secure, many techniques have been proposed, one of which i",
    "link": "http://arxiv.org/abs/2308.16730",
    "context": "Title: Proof of Deep Learning: Approaches, Challenges, and Future Directions. (arXiv:2308.16730v1 [cs.CR])\nAbstract: The rise of computational power has led to unprecedented performance gains for deep learning models. As more data becomes available and model architectures become more complex, the need for more computational power increases. On the other hand, since the introduction of Bitcoin as the first cryptocurrency and the establishment of the concept of blockchain as a distributed ledger, many variants and approaches have been proposed. However, many of them have one thing in common, which is the Proof of Work (PoW) consensus mechanism. PoW is mainly used to support the process of new block generation. While PoW has proven its robustness, its main drawback is that it requires a significant amount of processing power to maintain the security and integrity of the blockchain. This is due to applying brute force to solve a hashing puzzle. To utilize the computational power available in useful and meaningful work while keeping the blockchain secure, many techniques have been proposed, one of which i",
    "path": "papers/23/08/2308.16730.json",
    "total_tokens": 860,
    "translated_title": "深度学习的证明：方法、挑战和未来方向",
    "translated_abstract": "计算能力的提升为深度学习模型带来了前所未有的性能提升。随着越来越多的数据可用以及模型架构变得更加复杂，对更多计算能力的需求也在增加。另一方面，自比特币作为第一种加密货币的问世以及区块链概念作为分布式账本的建立以来，已经提出了许多变种和方法。然而，其中许多方法有一个共同点，即工作量证明（Proof of Work，PoW）共识机制。PoW主要用于支持新区块的生成过程。虽然PoW已经证明了其鲁棒性，但其主要缺点是需要大量的计算能力来维护区块链的安全和完整性。这是由于应用暴力破解来解决哈希难题。为了利用可用的计算能力进行有用而有意义的工作，同时保持区块链的安全，已经提出了许多技术，其中之一就是...",
    "tldr": "深度学习模型的性能提升需要更多计算能力，而区块链中的工作量证明机制对计算能力提出了挑战。",
    "en_tdlr": "The rise of computational power has led to unprecedented performance gains for deep learning models, but the Proof of Work mechanism in blockchain poses challenges to computational power."
}