{
    "title": "WSAM: Visual Explanations from Style Augmentation as Adversarial Attacker and Their Influence in Image Classification. (arXiv:2308.14995v1 [cs.CV])",
    "abstract": "Currently, style augmentation is capturing attention due to convolutional neural networks (CNN) being strongly biased toward recognizing textures rather than shapes. Most existing styling methods either perform a low-fidelity style transfer or a weak style representation in the embedding vector. This paper outlines a style augmentation algorithm using stochastic-based sampling with noise addition to improving randomization on a general linear transformation for style transfer. With our augmentation strategy, all models not only present incredible robustness against image stylizing but also outperform all previous methods and surpass the state-of-the-art performance for the STL-10 dataset. In addition, we present an analysis of the model interpretations under different style variations. At the same time, we compare comprehensive experiments demonstrating the performance when applied to deep neural architectures in training settings.",
    "link": "http://arxiv.org/abs/2308.14995",
    "context": "Title: WSAM: Visual Explanations from Style Augmentation as Adversarial Attacker and Their Influence in Image Classification. (arXiv:2308.14995v1 [cs.CV])\nAbstract: Currently, style augmentation is capturing attention due to convolutional neural networks (CNN) being strongly biased toward recognizing textures rather than shapes. Most existing styling methods either perform a low-fidelity style transfer or a weak style representation in the embedding vector. This paper outlines a style augmentation algorithm using stochastic-based sampling with noise addition to improving randomization on a general linear transformation for style transfer. With our augmentation strategy, all models not only present incredible robustness against image stylizing but also outperform all previous methods and surpass the state-of-the-art performance for the STL-10 dataset. In addition, we present an analysis of the model interpretations under different style variations. At the same time, we compare comprehensive experiments demonstrating the performance when applied to deep neural architectures in training settings.",
    "path": "papers/23/08/2308.14995.json",
    "total_tokens": 871,
    "translated_title": "WSAM: 从风格增强的可解释性作为对抗攻击者及其对图像分类的影响",
    "translated_abstract": "当前，由于卷积神经网络（CNN）对纹理而不是形状的强烈偏好，风格增强引起了人们的关注。大多数现有的风格化方法要么执行低保真度的风格转移，要么在嵌入向量中进行弱风格表示。本文提出一种使用基于随机抽样和噪声添加的风格增强算法，以改善对风格转移的一般线性变换的随机化。通过我们的增强策略，所有模型不仅具有令人难以置信的对图像风格化的鲁棒性，而且在STL-10数据集上表现出色，超过了所有先前的方法和最先进的性能。此外，我们还对不同风格变化下的模型解释进行了分析。同时，我们比较了在训练环境中应用于深度神经架构时的性能的全面实验。",
    "tldr": "本文提出了一种使用基于随机抽样和噪声添加的风格增强算法，该算法在风格转移中表现出了非凡的鲁棒性，并且在STL-10数据集上超过了先前的方法和最先进的性能。",
    "en_tdlr": "This paper proposes a style augmentation algorithm using stochastic-based sampling with noise addition, which demonstrates incredible robustness in style transfer and outperforms previous methods and state-of-the-art performance on the STL-10 dataset."
}