{
    "title": "Exploring Linguistic Similarity and Zero-Shot Learning for Multilingual Translation of Dravidian Languages. (arXiv:2308.05574v1 [cs.CL])",
    "abstract": "Current research in zero-shot translation is plagued by several issues such as high compute requirements, increased training time and off target translations. Proposed remedies often come at the cost of additional data or compute requirements. Pivot based neural machine translation is preferred over a single-encoder model for most settings despite the increased training and evaluation time. In this work, we overcome the shortcomings of zero-shot translation by taking advantage of transliteration and linguistic similarity. We build a single encoder-decoder neural machine translation system for Dravidian-Dravidian multilingual translation and perform zero-shot translation. We compare the data vs zero-shot accuracy tradeoff and evaluate the performance of our vanilla method against the current state of the art pivot based method. We also test the theory that morphologically rich languages require large vocabularies by restricting the vocabulary using an optimal transport based technique. ",
    "link": "http://arxiv.org/abs/2308.05574",
    "context": "Title: Exploring Linguistic Similarity and Zero-Shot Learning for Multilingual Translation of Dravidian Languages. (arXiv:2308.05574v1 [cs.CL])\nAbstract: Current research in zero-shot translation is plagued by several issues such as high compute requirements, increased training time and off target translations. Proposed remedies often come at the cost of additional data or compute requirements. Pivot based neural machine translation is preferred over a single-encoder model for most settings despite the increased training and evaluation time. In this work, we overcome the shortcomings of zero-shot translation by taking advantage of transliteration and linguistic similarity. We build a single encoder-decoder neural machine translation system for Dravidian-Dravidian multilingual translation and perform zero-shot translation. We compare the data vs zero-shot accuracy tradeoff and evaluate the performance of our vanilla method against the current state of the art pivot based method. We also test the theory that morphologically rich languages require large vocabularies by restricting the vocabulary using an optimal transport based technique. ",
    "path": "papers/23/08/2308.05574.json",
    "total_tokens": 998,
    "translated_title": "探索语言相似性和零样本学习在德拉维德语系多语言翻译中的应用",
    "translated_abstract": "零样本翻译的当前研究存在诸多问题，如计算需求高、训练时间增加以及翻译偏离目标等。现有的解决方案往往需要额外的数据或计算资源。在大多数情况下，基于中间语言的神经机器翻译比单一编码器模型更受青睐，尽管训练和评估时间会增加。本文利用音译和语言相似性克服了零样本翻译的缺点。我们构建了一个单一编码器-解码器神经机器翻译系统，用于德拉维德语系之间的多语言翻译，并进行零样本翻译。我们比较了数据与零样本翻译的准确性之间的权衡，并评估我们的基本方法与现有基于中间语言的方法的性能。我们还通过使用一种基于最优传输的技术限制词汇表，验证了形态丰富的语言是否需要较大的词汇量。",
    "tldr": "本文探索了在德拉维德语系多语言翻译中，利用音译和语言相似性的方法解决零样本翻译的问题，通过构建单一编码器-解码器神经机器翻译系统，并评估其性能与基于中间语言的方法进行比较。同时，还验证了形态丰富的语言是否需要较大的词汇量。",
    "en_tdlr": "This paper explores the use of transliteration and linguistic similarity to address the challenges of zero-shot translation in multilingual translation of Dravidian languages. By building a single encoder-decoder neural machine translation system and comparing its performance to pivot based methods, the study investigates the impact of data vs zero-shot accuracy tradeoff and the vocabulary size required for morphologically rich languages."
}