{
    "title": "Variable importance for causal forests: breaking down the heterogeneity of treatment effects. (arXiv:2308.03369v1 [stat.ML])",
    "abstract": "Causal random forests provide efficient estimates of heterogeneous treatment effects. However, forest algorithms are also well-known for their black-box nature, and therefore, do not characterize how input variables are involved in treatment effect heterogeneity, which is a strong practical limitation. In this article, we develop a new importance variable algorithm for causal forests, to quantify the impact of each input on the heterogeneity of treatment effects. The proposed approach is inspired from the drop and relearn principle, widely used for regression problems. Importantly, we show how to handle the forest retrain without a confounding variable. If the confounder is not involved in the treatment effect heterogeneity, the local centering step enforces consistency of the importance measure. Otherwise, when a confounder also impacts heterogeneity, we introduce a corrective term in the retrained causal forest to recover consistency. Additionally, experiments on simulated, semi-synt",
    "link": "http://arxiv.org/abs/2308.03369",
    "context": "Title: Variable importance for causal forests: breaking down the heterogeneity of treatment effects. (arXiv:2308.03369v1 [stat.ML])\nAbstract: Causal random forests provide efficient estimates of heterogeneous treatment effects. However, forest algorithms are also well-known for their black-box nature, and therefore, do not characterize how input variables are involved in treatment effect heterogeneity, which is a strong practical limitation. In this article, we develop a new importance variable algorithm for causal forests, to quantify the impact of each input on the heterogeneity of treatment effects. The proposed approach is inspired from the drop and relearn principle, widely used for regression problems. Importantly, we show how to handle the forest retrain without a confounding variable. If the confounder is not involved in the treatment effect heterogeneity, the local centering step enforces consistency of the importance measure. Otherwise, when a confounder also impacts heterogeneity, we introduce a corrective term in the retrained causal forest to recover consistency. Additionally, experiments on simulated, semi-synt",
    "path": "papers/23/08/2308.03369.json",
    "total_tokens": 938,
    "translated_title": "变量重要性对因果森林的影响：解析处理效果的异质性",
    "translated_abstract": "因果随机森林提供了处理效果异质性的有效估计。然而，森林算法以其黑匣子性质而闻名，因此无法表征输入变量在处理效果异质性中的参与情况，这是一个很大的实际限制。在本文中，我们开发了一种新的因果森林变量重要性算法，用于量化每个输入对处理效果异质性的影响。所提出的方法受到了用于回归问题的丢弃和重新学习原则的启发。重要的是，我们展示了如何处理没有混杂变量的森林重训练。如果混杂因素不涉及处理效果的异质性，局部居中步骤可以保证重要性度量的一致性。否则，当混杂因素也影响异质性时，我们在重新训练的因果森林中引入一个校正项以恢复一致性。此外，我们进行了对模拟和半合成数据的实验。",
    "tldr": "本文提出了一种新的因果森林变量重要性算法，用于量化每个输入对处理效果异质性的影响，解决了因果随机森林的黑匣子性质带来的实际限制，同时解决了没有混杂变量和有混杂变量的情况。",
    "en_tdlr": "This paper introduces a new importance variable algorithm for causal forests, quantifying the impact of each input on the heterogeneity of treatment effects, addressing the practical limitation caused by the black-box nature of causal random forests, and handling both cases of no confounding variable and confounding variable."
}