{
    "title": "Exploring Model Transferability through the Lens of Potential Energy. (arXiv:2308.15074v1 [cs.CV])",
    "abstract": "Transfer learning has become crucial in computer vision tasks due to the vast availability of pre-trained deep learning models. However, selecting the optimal pre-trained model from a diverse pool for a specific downstream task remains a challenge. Existing methods for measuring the transferability of pre-trained models rely on statistical correlations between encoded static features and task labels, but they overlook the impact of underlying representation dynamics during fine-tuning, leading to unreliable results, especially for self-supervised models. In this paper, we present an insightful physics-inspired approach named PED to address these challenges. We reframe the challenge of model selection through the lens of potential energy and directly model the interaction forces that influence fine-tuning dynamics. By capturing the motion of dynamic representations to decline the potential energy within a force-driven physical model, we can acquire an enhanced and more stable observatio",
    "link": "http://arxiv.org/abs/2308.15074",
    "context": "Title: Exploring Model Transferability through the Lens of Potential Energy. (arXiv:2308.15074v1 [cs.CV])\nAbstract: Transfer learning has become crucial in computer vision tasks due to the vast availability of pre-trained deep learning models. However, selecting the optimal pre-trained model from a diverse pool for a specific downstream task remains a challenge. Existing methods for measuring the transferability of pre-trained models rely on statistical correlations between encoded static features and task labels, but they overlook the impact of underlying representation dynamics during fine-tuning, leading to unreliable results, especially for self-supervised models. In this paper, we present an insightful physics-inspired approach named PED to address these challenges. We reframe the challenge of model selection through the lens of potential energy and directly model the interaction forces that influence fine-tuning dynamics. By capturing the motion of dynamic representations to decline the potential energy within a force-driven physical model, we can acquire an enhanced and more stable observatio",
    "path": "papers/23/08/2308.15074.json",
    "total_tokens": 884,
    "translated_title": "通过潜在能量探索模型可迁移性",
    "translated_abstract": "由于预训练深度学习模型的大量可用性，迁移学习在计算机视觉任务中变得至关重要。然而，针对特定下游任务从多种预训练模型中选择最佳模型仍然面临挑战。现有的衡量预训练模型可迁移性的方法依赖于编码的静态特征和任务标签之间的统计相关性，但它们忽视了在微调过程中底层表示动态的影响，导致结果不可靠，尤其对于自监督模型而言。在本文中，我们提出了一种名为PED的物理启发式方法来解决这些挑战。我们通过潜在能量的视角重新构筑了模型选择的挑战，并直接建模影响微调动态的相互作用力。通过在受力驱动的物理模型中捕捉动态表示的运动来降低潜在能量，我们可以获得更强大和更稳定的观察结果。",
    "tldr": "本文提出了一种名为PED的物理启发式方法，通过在受力驱动的物理模型中捕捉动态表示的运动来降低潜在能量，以解决模型选择时的挑战，并获得更强大和更稳定的观察结果。"
}