{
    "title": "A Survey on Point-of-Interest Recommendations Leveraging Heterogeneous Data. (arXiv:2308.07426v1 [cs.IR])",
    "abstract": "Tourism is an important application domain for recommender systems. In this domain, recommender systems are for example tasked with providing personalized recommendations for transportation, accommodation, points-of-interest (POIs), or tourism services. Among these tasks, in particular the problem of recommending POIs that are of likely interest to individual tourists has gained growing attention in recent years. Providing POI recommendations to tourists \\emph{during their trip} can however be especially challenging due to the variability of the users' context. With the rapid development of the Web and today's multitude of online services, vast amounts of data from various sources have become available, and these heterogeneous data sources represent a huge potential to better address the challenges of in-trip POI recommendation problems. In this work, we provide a comprehensive survey of published research on POI recommendation between 2017 and 2022 from the perspective of heterogeneou",
    "link": "http://arxiv.org/abs/2308.07426",
    "context": "Title: A Survey on Point-of-Interest Recommendations Leveraging Heterogeneous Data. (arXiv:2308.07426v1 [cs.IR])\nAbstract: Tourism is an important application domain for recommender systems. In this domain, recommender systems are for example tasked with providing personalized recommendations for transportation, accommodation, points-of-interest (POIs), or tourism services. Among these tasks, in particular the problem of recommending POIs that are of likely interest to individual tourists has gained growing attention in recent years. Providing POI recommendations to tourists \\emph{during their trip} can however be especially challenging due to the variability of the users' context. With the rapid development of the Web and today's multitude of online services, vast amounts of data from various sources have become available, and these heterogeneous data sources represent a huge potential to better address the challenges of in-trip POI recommendation problems. In this work, we provide a comprehensive survey of published research on POI recommendation between 2017 and 2022 from the perspective of heterogeneou",
    "path": "papers/23/08/2308.07426.json",
    "total_tokens": 861,
    "translated_title": "利用异构数据进行兴趣点推荐的调查",
    "translated_abstract": "旅游是推荐系统的一个重要应用领域。在这个领域中，推荐系统主要负责为交通、住宿、兴趣点或旅游服务提供个性化推荐。在这些任务中，尤其是对个体游客可能感兴趣的兴趣点进行推荐的问题近年来引起了越来越多的关注。然而，在游客“旅途中”提供兴趣点推荐可能会面临特殊挑战，因为用户的上下文变化多样。随着互联网的快速发展和当今各种在线服务的大量数据，各种异构数据源的数据已经变得可用，这些异构数据源为解决旅途中兴趣点推荐问题的挑战提供了巨大潜力。在这项工作中，我们从异构数据的角度提供了2017年至2022年间已发表的兴趣点推荐研究的综述。",
    "tldr": "本文针对旅游领域的兴趣点推荐问题进行了调查研究，探讨了利用异构数据解决旅途中兴趣点推荐问题的潜力与挑战。",
    "en_tdlr": "This paper presents a survey on the problem of point-of-interest recommendation in the tourism domain, and discusses the potential and challenges of leveraging heterogeneous data to address in-trip recommendation problems."
}