{
    "title": "Safeguarding Learning-based Control for Smart Energy Systems with Sampling Specifications. (arXiv:2308.06069v1 [cs.SE])",
    "abstract": "We study challenges using reinforcement learning in controlling energy systems, where apart from performance requirements, one has additional safety requirements such as avoiding blackouts. We detail how these safety requirements in real-time temporal logic can be strengthened via discretization into linear temporal logic (LTL), such that the satisfaction of the LTL formulae implies the satisfaction of the original safety requirements. The discretization enables advanced engineering methods such as synthesizing shields for safe reinforcement learning as well as formal verification, where for statistical model checking, the probabilistic guarantee acquired by LTL model checking forms a lower bound for the satisfaction of the original real-time safety requirements.",
    "link": "http://arxiv.org/abs/2308.06069",
    "context": "Title: Safeguarding Learning-based Control for Smart Energy Systems with Sampling Specifications. (arXiv:2308.06069v1 [cs.SE])\nAbstract: We study challenges using reinforcement learning in controlling energy systems, where apart from performance requirements, one has additional safety requirements such as avoiding blackouts. We detail how these safety requirements in real-time temporal logic can be strengthened via discretization into linear temporal logic (LTL), such that the satisfaction of the LTL formulae implies the satisfaction of the original safety requirements. The discretization enables advanced engineering methods such as synthesizing shields for safe reinforcement learning as well as formal verification, where for statistical model checking, the probabilistic guarantee acquired by LTL model checking forms a lower bound for the satisfaction of the original real-time safety requirements.",
    "path": "papers/23/08/2308.06069.json",
    "total_tokens": 776,
    "translated_title": "用采样规范保护智能能源系统中基于学习的控制",
    "translated_abstract": "我们研究了在能源系统控制中使用强化学习所面临的挑战，除了性能要求外，还有额外的安全要求，如避免停电。我们详细介绍了如何通过将安全要求在实时时态逻辑中进行离散化加强，使得LTL公式的满足意味着满足原始的安全要求。离散化使得可以使用先进的工程方法，如为安全强化学习合成盾牌以及形式验证，其中对于统计模型检验，LTL模型检验得到的概率保证形成了满足原始实时安全要求的下界。",
    "tldr": "本研究研究了在能源系统控制中使用强化学习所面临的挑战，提出了一种通过离散化加强安全要求的方法。离散化使得可以使用先进的工程方法并进行形式验证，其中概率保证形成了满足原始安全要求的下界。",
    "en_tdlr": "This study examines challenges in using reinforcement learning in controlling energy systems and proposes a method to strengthen safety requirements through discretization. The discretization enables the use of advanced engineering methods and formal verification, where probabilistic guarantees form a lower bound for the satisfaction of the original safety requirements."
}