{
    "title": "CompTLL-UNet: Compressed Domain Text-Line Localization in Challenging Handwritten Documents using Deep Feature Learning from JPEG Coefficients. (arXiv:2308.06142v1 [cs.CV])",
    "abstract": "Automatic localization of text-lines in handwritten documents is still an open and challenging research problem. Various writing issues such as uneven spacing between the lines, oscillating and touching text, and the presence of skew become much more challenging when the case of complex handwritten document images are considered for segmentation directly in their respective compressed representation. This is because, the conventional way of processing compressed documents is through decompression, but here in this paper, we propose an idea that employs deep feature learning directly from the JPEG compressed coefficients without full decompression to accomplish text-line localization in the JPEG compressed domain. A modified U-Net architecture known as Compressed Text-Line Localization Network (CompTLL-UNet) is designed to accomplish it. The model is trained and tested with JPEG compressed version of benchmark datasets including ICDAR2017 (cBAD) and ICDAR2019 (cBAD), reporting the state",
    "link": "http://arxiv.org/abs/2308.06142",
    "context": "Title: CompTLL-UNet: Compressed Domain Text-Line Localization in Challenging Handwritten Documents using Deep Feature Learning from JPEG Coefficients. (arXiv:2308.06142v1 [cs.CV])\nAbstract: Automatic localization of text-lines in handwritten documents is still an open and challenging research problem. Various writing issues such as uneven spacing between the lines, oscillating and touching text, and the presence of skew become much more challenging when the case of complex handwritten document images are considered for segmentation directly in their respective compressed representation. This is because, the conventional way of processing compressed documents is through decompression, but here in this paper, we propose an idea that employs deep feature learning directly from the JPEG compressed coefficients without full decompression to accomplish text-line localization in the JPEG compressed domain. A modified U-Net architecture known as Compressed Text-Line Localization Network (CompTLL-UNet) is designed to accomplish it. The model is trained and tested with JPEG compressed version of benchmark datasets including ICDAR2017 (cBAD) and ICDAR2019 (cBAD), reporting the state",
    "path": "papers/23/08/2308.06142.json",
    "total_tokens": 955,
    "translated_title": "CompTLL-UNet: 使用JPEG系数深度特征学习在具挑战性手写文件中压缩领域文本行定位",
    "translated_abstract": "自动定位手写文件中的文本行仍然是一个开放且具有挑战性的研究问题。当考虑到复杂手写文件图像的情况下，各种书写问题如行间不均匀间距、振荡和接触文字以及倾斜的存在，将更加具有挑战性，因为传统的处理压缩文件的方法是通过解压缩，但在本文中，我们提出了一种直接从JPEG压缩系数中进行深度特征学习而无需完全解压缩来实现JPEG压缩域中的文本行定位。设计了一种改进的U-Net架构，称为Compressed Text-Line Localization Network（CompTLL-UNet）来实现这一目标。该模型经过训练和测试，使用包括ICDAR2017（cBAD）和ICDAR2019（cBAD）在内的基准数据集的JPEG压缩版本进行了报告。",
    "tldr": "本文提出了一种使用JPEG压缩系数进行深度特征学习的方法，实现在具有挑战性的手写文件中的文本行定位。通过设计改进的CompTLL-UNet架构，在JPEG压缩域中直接定位文本行，并在ICDAR2017和ICDAR2019基准数据集上进行了测试和验证。",
    "en_tdlr": "This paper proposes a method of using JPEG coefficients for deep feature learning to achieve text-line localization in challenging handwritten documents. By designing an improved architecture called CompTLL-UNet, the text lines can be directly localized in the JPEG compressed domain, and the model is tested and validated on benchmark datasets like ICDAR2017 and ICDAR2019."
}