{
    "title": "Packet Header Recognition Utilizing an All-Optical Reservoir Based on Reinforcement-Learning-Optimized Double-Ring Resonator. (arXiv:2308.13818v1 [eess.SP])",
    "abstract": "Optical packet header recognition is an important signal processing task of optical communication networks. In this work, we propose an all-optical reservoir, consisting of integrated double-ring resonators (DRRs) as nodes, for fast and accurate optical packet header recognition. As the delay-bandwidth product (DBP) of the node is a key figure-of-merit in the reservoir, we adopt a deep reinforcement learning algorithm to maximize the DBPs for various types of DRRs, which has the advantage of full parameter space optimization and fast convergence speed. Intriguingly, the optimized DBPs of the DRRs in cascaded, parallel, and embedded configurations reach the same maximum value, which is believed to be the global maximum. Finally, 3-bit and 6-bit packet header recognition tasks are performed with the all-optical reservoir consisting of the optimized cascaded rings, which have greatly reduced chip size and the desired \"flat-top\" delay spectra. Using this optical computing scheme, word-erro",
    "link": "http://arxiv.org/abs/2308.13818",
    "context": "Title: Packet Header Recognition Utilizing an All-Optical Reservoir Based on Reinforcement-Learning-Optimized Double-Ring Resonator. (arXiv:2308.13818v1 [eess.SP])\nAbstract: Optical packet header recognition is an important signal processing task of optical communication networks. In this work, we propose an all-optical reservoir, consisting of integrated double-ring resonators (DRRs) as nodes, for fast and accurate optical packet header recognition. As the delay-bandwidth product (DBP) of the node is a key figure-of-merit in the reservoir, we adopt a deep reinforcement learning algorithm to maximize the DBPs for various types of DRRs, which has the advantage of full parameter space optimization and fast convergence speed. Intriguingly, the optimized DBPs of the DRRs in cascaded, parallel, and embedded configurations reach the same maximum value, which is believed to be the global maximum. Finally, 3-bit and 6-bit packet header recognition tasks are performed with the all-optical reservoir consisting of the optimized cascaded rings, which have greatly reduced chip size and the desired \"flat-top\" delay spectra. Using this optical computing scheme, word-erro",
    "path": "papers/23/08/2308.13818.json",
    "total_tokens": 970,
    "translated_title": "基于强化学习优化的双环谐振器的全光储备的分组头识别",
    "translated_abstract": "光分组头识别是光通信网络中重要的信号处理任务。本文提出了一个全光储备系统，其中集成了双环谐振器作为节点，用于快速准确地识别光分组头。由于节点的延迟-带宽积（DBP）是储备系统中的重要参数，我们采用深度强化学习算法，对不同类型的双环谐振器进行DBP的最大化，该算法具有全参数空间优化和快速收敛速度的优势。有趣的是，级联、并联和嵌入式配置的优化DBP达到了相同的最大值，被认为是全局最大值。最后，使用优化的级联环组成的全光储备系统进行了3位和6位分组头识别任务，该系统具有大大减小的芯片尺寸和所需的“平顶”延迟谱。利用这种光计算方案，字错误率",
    "tldr": "本文提出了一种基于双环谐振器的全光储备系统，通过使用深度强化学习算法，最大化延迟-带宽积参数，实现了快速、准确的光分组头识别。优化后的级联环可用于实现小尺寸、平顶延迟谱的光计算。"
}