{
    "title": "DiVa: An Iterative Framework to Harvest More Diverse and Valid Labels from User Comments for Music. (arXiv:2308.04805v1 [cs.IR])",
    "abstract": "Towards sufficient music searching, it is vital to form a complete set of labels for each song. However, current solutions fail to resolve it as they cannot produce diverse enough mappings to make up for the information missed by the gold labels. Based on the observation that such missing information may already be presented in user comments, we propose to study the automated music labeling in an essential but under-explored setting, where the model is required to harvest more diverse and valid labels from the users' comments given limited gold labels. To this end, we design an iterative framework (DiVa) to harvest more $\\underline{\\text{Di}}$verse and $\\underline{\\text{Va}}$lid labels from user comments for music. The framework makes a classifier able to form complete sets of labels for songs via pseudo-labels inferred from pre-trained classifiers and a novel joint score function. The experiment on a densely annotated testing set reveals the superiority of the Diva over state-of-the-a",
    "link": "http://arxiv.org/abs/2308.04805",
    "context": "Title: DiVa: An Iterative Framework to Harvest More Diverse and Valid Labels from User Comments for Music. (arXiv:2308.04805v1 [cs.IR])\nAbstract: Towards sufficient music searching, it is vital to form a complete set of labels for each song. However, current solutions fail to resolve it as they cannot produce diverse enough mappings to make up for the information missed by the gold labels. Based on the observation that such missing information may already be presented in user comments, we propose to study the automated music labeling in an essential but under-explored setting, where the model is required to harvest more diverse and valid labels from the users' comments given limited gold labels. To this end, we design an iterative framework (DiVa) to harvest more $\\underline{\\text{Di}}$verse and $\\underline{\\text{Va}}$lid labels from user comments for music. The framework makes a classifier able to form complete sets of labels for songs via pseudo-labels inferred from pre-trained classifiers and a novel joint score function. The experiment on a densely annotated testing set reveals the superiority of the Diva over state-of-the-a",
    "path": "papers/23/08/2308.04805.json",
    "total_tokens": 893,
    "translated_title": "DiVa：一种从用户评论中收集更多多样且有效的音乐标签的迭代框架",
    "translated_abstract": "为了实现充分的音乐搜索，形成每首歌曲的完整标签集是至关重要的。然而，当前的解决方案无法解决这个问题，因为它们不能产生足够多样化的映射来弥补黄金标签所遗漏的信息。基于这样的观察，这些遗漏的信息可能已经在用户评论中提供，我们提出在一个重要但未被充分探索的场景中研究自动音乐标注，即在给定有限黄金标签的情况下，模型需要从用户评论中收集更多多样且有效的标签。为此，我们设计了一个迭代框架（DiVa），通过从预训练分类器中推断出的伪标签和一种新颖的联合得分函数，使分类器能够为歌曲形成完整的标签集。对一个密集注释的测试集上的实验证明了DiVa相对于最先进的技术的优越性。",
    "tldr": "DiVa是一个迭代框架，通过从用户评论中收集更多多样且有效的标签，使分类器能够为歌曲形成完整的标签集，并且在实验证明了其优越性。",
    "en_tdlr": "DiVa is an iterative framework that utilizes user comments to collect more diverse and valid labels, enabling the classifier to form complete label sets for songs. Experimental results demonstrate its superiority over state-of-the-art techniques."
}