{
    "title": "MultiPA: a multi-task speech pronunciation assessment system for a closed and open response scenario. (arXiv:2308.12490v1 [cs.CL])",
    "abstract": "The design of automatic speech pronunciation assessment can be categorized into closed and open response scenarios, each with strengths and limitations. A system with the ability to function in both scenarios can cater to diverse learning needs and provide a more precise and holistic assessment of pronunciation skills. In this study, we propose a Multi-task Pronunciation Assessment model called MultiPA. MultiPA provides an alternative to Kaldi-based systems in that it has simpler format requirements and better compatibility with other neural network models. Compared with previous open response systems, MultiPA provides a wider range of evaluations, encompassing assessments at both the sentence and word-level. Our experimental results show that MultiPA achieves comparable performance when working in closed response scenarios and maintains more robust performance when directly used for open responses.",
    "link": "http://arxiv.org/abs/2308.12490",
    "context": "Title: MultiPA: a multi-task speech pronunciation assessment system for a closed and open response scenario. (arXiv:2308.12490v1 [cs.CL])\nAbstract: The design of automatic speech pronunciation assessment can be categorized into closed and open response scenarios, each with strengths and limitations. A system with the ability to function in both scenarios can cater to diverse learning needs and provide a more precise and holistic assessment of pronunciation skills. In this study, we propose a Multi-task Pronunciation Assessment model called MultiPA. MultiPA provides an alternative to Kaldi-based systems in that it has simpler format requirements and better compatibility with other neural network models. Compared with previous open response systems, MultiPA provides a wider range of evaluations, encompassing assessments at both the sentence and word-level. Our experimental results show that MultiPA achieves comparable performance when working in closed response scenarios and maintains more robust performance when directly used for open responses.",
    "path": "papers/23/08/2308.12490.json",
    "total_tokens": 813,
    "translated_title": "MultiPA:一种适用于闭合和开放响应场景的多任务语音发音评估系统",
    "translated_abstract": "自动语音发音评估系统的设计可以分为闭合和开放响应场景，每种场景都有其优点和局限性。具备在两种场景下都能发挥作用的系统能够满足多样化的学习需求，并提供更精确、全面的发音技能评估。本研究提出了一种名为MultiPA的多任务发音评估模型。MultiPA与基于Kaldi的系统相比，具有更简单的格式要求，更好地兼容其他神经网络模型。与先前的开放响应系统相比，MultiPA提供了更广泛的评估范围，包括句子和单词级别的评估。我们的实验结果表明，MultiPA在闭合响应场景下的性能与先前系统相当，并在直接用于开放响应时保持更稳健的性能。",
    "tldr": "MultiPA是一种适用于闭合和开放响应场景的多任务语音发音评估系统，相比之前的系统，它具有更简单的格式要求和更好的兼容性，并且提供了更广泛的评估范围。",
    "en_tdlr": "MultiPA is a multi-task speech pronunciation assessment system for both closed and open response scenarios. It has simpler format requirements, better compatibility, and provides a wider range of evaluations compared to previous systems."
}