{
    "title": "Analyzing Complex Systems with Cascades Using Continuous-Time Bayesian Networks. (arXiv:2308.10606v1 [stat.ML])",
    "abstract": "Interacting systems of events may exhibit cascading behavior where events tend to be temporally clustered. While the cascades themselves may be obvious from the data, it is important to understand which states of the system trigger them. For this purpose, we propose a modeling framework based on continuous-time Bayesian networks (CTBNs) to analyze cascading behavior in complex systems. This framework allows us to describe how events propagate through the system and to identify likely sentry states, that is, system states that may lead to imminent cascading behavior. Moreover, CTBNs have a simple graphical representation and provide interpretable outputs, both of which are important when communicating with domain experts. We also develop new methods for knowledge extraction from CTBNs and we apply the proposed methodology to a data set of alarms in a large industrial system.",
    "link": "http://arxiv.org/abs/2308.10606",
    "context": "Title: Analyzing Complex Systems with Cascades Using Continuous-Time Bayesian Networks. (arXiv:2308.10606v1 [stat.ML])\nAbstract: Interacting systems of events may exhibit cascading behavior where events tend to be temporally clustered. While the cascades themselves may be obvious from the data, it is important to understand which states of the system trigger them. For this purpose, we propose a modeling framework based on continuous-time Bayesian networks (CTBNs) to analyze cascading behavior in complex systems. This framework allows us to describe how events propagate through the system and to identify likely sentry states, that is, system states that may lead to imminent cascading behavior. Moreover, CTBNs have a simple graphical representation and provide interpretable outputs, both of which are important when communicating with domain experts. We also develop new methods for knowledge extraction from CTBNs and we apply the proposed methodology to a data set of alarms in a large industrial system.",
    "path": "papers/23/08/2308.10606.json",
    "total_tokens": 823,
    "translated_title": "使用连续时间贝叶斯网络分析复杂系统中的级联行为",
    "translated_abstract": "事件相互作用的系统可能表现出事件在时间上聚集的级联行为。虽然级联本身可能从数据中显而易见，但理解触发它们的系统状态非常重要。为此，我们提出了一个基于连续时间贝叶斯网络（CTBNs）的建模框架，用于分析复杂系统中的级联行为。这个框架允许我们描述事件如何在系统中传播，并识别可能的守卫状态，即可能导致即将发生级联行为的系统状态。此外，CTBNs具有简单的图形表示和可解释的输出，这对于与领域专家的沟通非常重要。我们还开发了从CTBNs中提取知识的新方法，并将所提出的方法应用于一个大型工业系统中的警报数据集。",
    "tldr": "本论文提出了一种使用连续时间贝叶斯网络分析复杂系统级联行为的建模框架，能够描述事件在系统中传播并识别可能导致级联行为的系统状态。同时，该框架具有简单的图形表示和可解释的输出。"
}