{
    "title": "DealMVC: Dual Contrastive Calibration for Multi-view Clustering. (arXiv:2308.09000v1 [cs.CV])",
    "abstract": "Benefiting from the strong view-consistent information mining capacity, multi-view contrastive clustering has attracted plenty of attention in recent years. However, we observe the following drawback, which limits the clustering performance from further improvement. The existing multi-view models mainly focus on the consistency of the same samples in different views while ignoring the circumstance of similar but different samples in cross-view scenarios. To solve this problem, we propose a novel Dual contrastive calibration network for Multi-View Clustering (DealMVC). Specifically, we first design a fusion mechanism to obtain a global cross-view feature. Then, a global contrastive calibration loss is proposed by aligning the view feature similarity graph and the high-confidence pseudo-label graph. Moreover, to utilize the diversity of multi-view information, we propose a local contrastive calibration loss to constrain the consistency of pair-wise view features. The feature structure is",
    "link": "http://arxiv.org/abs/2308.09000",
    "context": "Title: DealMVC: Dual Contrastive Calibration for Multi-view Clustering. (arXiv:2308.09000v1 [cs.CV])\nAbstract: Benefiting from the strong view-consistent information mining capacity, multi-view contrastive clustering has attracted plenty of attention in recent years. However, we observe the following drawback, which limits the clustering performance from further improvement. The existing multi-view models mainly focus on the consistency of the same samples in different views while ignoring the circumstance of similar but different samples in cross-view scenarios. To solve this problem, we propose a novel Dual contrastive calibration network for Multi-View Clustering (DealMVC). Specifically, we first design a fusion mechanism to obtain a global cross-view feature. Then, a global contrastive calibration loss is proposed by aligning the view feature similarity graph and the high-confidence pseudo-label graph. Moreover, to utilize the diversity of multi-view information, we propose a local contrastive calibration loss to constrain the consistency of pair-wise view features. The feature structure is",
    "path": "papers/23/08/2308.09000.json",
    "total_tokens": 857,
    "translated_title": "DealMVC: 面向多视角聚类的双向对比校准",
    "translated_abstract": "多视角对比聚类由于其强大的视角一致性信息挖掘能力而受到了广泛关注。然而，我们观察到一个限制聚类性能进一步提升的问题。现有的多视图模型主要关注不同视图中相同样本的一致性，而忽视了交叉视图场景中类似但不同的样本情况。为了解决这个问题，我们提出了一种新颖的面向多视图聚类的双向对比校准网络（DealMVC）。具体而言，我们首先设计了一个融合机制，获得全局的跨视图特征。然后，通过对齐视图特征相似性图和高置信度伪标签图，提出了一个全局对比校准损失。此外，为了利用多视图信息的多样性，我们提出了一个局部对比校准损失，用于约束成对视图特征的一致性。特征结构是 ...",
    "tldr": "提出了一种名为DealMVC的双向对比校准网络，用于解决多视图聚类中的一致性问题，并利用全局和局部对比校准损失来提高聚类性能。",
    "en_tdlr": "A dual contrastive calibration network called DealMVC is proposed to address the consistency issue in multi-view clustering, using global and local contrastive calibration losses to enhance clustering performance."
}