{
    "title": "Ranking-aware Uncertainty for Text-guided Image Retrieval. (arXiv:2308.08131v1 [cs.CV])",
    "abstract": "Text-guided image retrieval is to incorporate conditional text to better capture users' intent. Traditionally, the existing methods focus on minimizing the embedding distances between the source inputs and the targeted image, using the provided triplets $\\langle$source image, source text, target image$\\rangle$. However, such triplet optimization may limit the learned retrieval model to capture more detailed ranking information, e.g., the triplets are one-to-one correspondences and they fail to account for many-to-many correspondences arising from semantic diversity in feedback languages and images. To capture more ranking information, we propose a novel ranking-aware uncertainty approach to model many-to-many correspondences by only using the provided triplets. We introduce uncertainty learning to learn the stochastic ranking list of features. Specifically, our approach mainly comprises three components: (1) In-sample uncertainty, which aims to capture semantic diversity using a Gaussi",
    "link": "http://arxiv.org/abs/2308.08131",
    "context": "Title: Ranking-aware Uncertainty for Text-guided Image Retrieval. (arXiv:2308.08131v1 [cs.CV])\nAbstract: Text-guided image retrieval is to incorporate conditional text to better capture users' intent. Traditionally, the existing methods focus on minimizing the embedding distances between the source inputs and the targeted image, using the provided triplets $\\langle$source image, source text, target image$\\rangle$. However, such triplet optimization may limit the learned retrieval model to capture more detailed ranking information, e.g., the triplets are one-to-one correspondences and they fail to account for many-to-many correspondences arising from semantic diversity in feedback languages and images. To capture more ranking information, we propose a novel ranking-aware uncertainty approach to model many-to-many correspondences by only using the provided triplets. We introduce uncertainty learning to learn the stochastic ranking list of features. Specifically, our approach mainly comprises three components: (1) In-sample uncertainty, which aims to capture semantic diversity using a Gaussi",
    "path": "papers/23/08/2308.08131.json",
    "total_tokens": 853,
    "translated_title": "文本引导的图像检索中的排名感知不确定性",
    "translated_abstract": "文本引导的图像检索是为了更好地捕捉用户的意图而将条件文本纳入其中。传统上，现有的方法着重于通过提供的三元组<源图像，源文本，目标图像>来最小化嵌入距离。然而，这种三元组优化可能会限制学习到更详细排名信息的检索模型，例如，这些三元组是一对一对应关系，并且它们未能考虑到在反馈语言和图像中出现的多对多对应关系造成的语义多样性。为了捕捉更多的排名信息，我们提出了一种新颖的排名感知不确定性方法，仅使用提供的三元组来建模多对多的对应关系。我们引入不确定性学习来学习特征的随机排名列表。具体而言，我们的方法主要包括三个组成部分：（1）嵌套不确定性，旨在使用高斯",
    "tldr": "本研究提出了一种用于文本引导的图像检索的排名感知不确定性方法，",
    "en_tdlr": "This paper proposes a ranking-aware uncertainty approach for text-guided image retrieval, aiming to model many-to-many correspondences by using provided triplets and learning stochastic ranking list of features through uncertainty learning."
}