{
    "title": "Likelihood-ratio-based confidence intervals for neural networks. (arXiv:2308.02221v1 [stat.ML])",
    "abstract": "This paper introduces a first implementation of a novel likelihood-ratio-based approach for constructing confidence intervals for neural networks. Our method, called DeepLR, offers several qualitative advantages: most notably, the ability to construct asymmetric intervals that expand in regions with a limited amount of data, and the inherent incorporation of factors such as the amount of training time, network architecture, and regularization techniques. While acknowledging that the current implementation of the method is prohibitively expensive for many deep-learning applications, the high cost may already be justified in specific fields like medical predictions or astrophysics, where a reliable uncertainty estimate for a single prediction is essential. This work highlights the significant potential of a likelihood-ratio-based uncertainty estimate and establishes a promising avenue for future research.",
    "link": "http://arxiv.org/abs/2308.02221",
    "context": "Title: Likelihood-ratio-based confidence intervals for neural networks. (arXiv:2308.02221v1 [stat.ML])\nAbstract: This paper introduces a first implementation of a novel likelihood-ratio-based approach for constructing confidence intervals for neural networks. Our method, called DeepLR, offers several qualitative advantages: most notably, the ability to construct asymmetric intervals that expand in regions with a limited amount of data, and the inherent incorporation of factors such as the amount of training time, network architecture, and regularization techniques. While acknowledging that the current implementation of the method is prohibitively expensive for many deep-learning applications, the high cost may already be justified in specific fields like medical predictions or astrophysics, where a reliable uncertainty estimate for a single prediction is essential. This work highlights the significant potential of a likelihood-ratio-based uncertainty estimate and establishes a promising avenue for future research.",
    "path": "papers/23/08/2308.02221.json",
    "total_tokens": 833,
    "translated_title": "基于似然比的置信区间在神经网络中的应用",
    "translated_abstract": "本文介绍了一种新颖的基于似然比的方法，用于构建神经网络的置信区间。我们的方法名为DeepLR，具有许多优点，其中最重要的是能够构建在数据有限的区域中扩展的不对称区间，并固有地考虑了训练时间、网络架构和正则化技术等因素。尽管承认目前的方法实现对于许多深度学习应用来说过于昂贵，但在诸如医学预测或天体物理学等特定领域中，可靠的单个预测的不确定性估计可能已经合理。这项工作突出了基于似然比的不确定性估计的重要潜力，并为未来的研究开辟了有希望的途径。",
    "tldr": "本文介绍了一种新颖的基于似然比的方法，用于构建神经网络的置信区间。该方法能够构建不对称区间，考虑了训练时间、网络架构和正则化技术等因素。尽管方法实现昂贵，但在特定领域中具有重要应用潜力。",
    "en_tdlr": "This paper introduces a novel likelihood-ratio-based approach for constructing confidence intervals for neural networks. The method can construct asymmetric intervals and incorporates factors such as training time, network architecture, and regularization techniques. Despite its high cost, it has significant potential for applications in specific fields."
}