{
    "title": "Federated Classification in Hyperbolic Spaces via Secure Aggregation of Convex Hulls. (arXiv:2308.06895v2 [cs.LG] UPDATED)",
    "abstract": "Hierarchical and tree-like data sets arise in many applications, including language processing, graph data mining, phylogeny and genomics. It is known that tree-like data cannot be embedded into Euclidean spaces of finite dimension with small distortion. This problem can be mitigated through the use of hyperbolic spaces. When such data also has to be processed in a distributed and privatized setting, it becomes necessary to work with new federated learning methods tailored to hyperbolic spaces. As an initial step towards the development of the field of federated learning in hyperbolic spaces, we propose the first known approach to federated classification in hyperbolic spaces. Our contributions are as follows. First, we develop distributed versions of convex SVM classifiers for Poincar\\'e discs. In this setting, the information conveyed from clients to the global classifier are convex hulls of clusters present in individual client data. Second, to avoid label switching issues, we intro",
    "link": "http://arxiv.org/abs/2308.06895",
    "context": "Title: Federated Classification in Hyperbolic Spaces via Secure Aggregation of Convex Hulls. (arXiv:2308.06895v2 [cs.LG] UPDATED)\nAbstract: Hierarchical and tree-like data sets arise in many applications, including language processing, graph data mining, phylogeny and genomics. It is known that tree-like data cannot be embedded into Euclidean spaces of finite dimension with small distortion. This problem can be mitigated through the use of hyperbolic spaces. When such data also has to be processed in a distributed and privatized setting, it becomes necessary to work with new federated learning methods tailored to hyperbolic spaces. As an initial step towards the development of the field of federated learning in hyperbolic spaces, we propose the first known approach to federated classification in hyperbolic spaces. Our contributions are as follows. First, we develop distributed versions of convex SVM classifiers for Poincar\\'e discs. In this setting, the information conveyed from clients to the global classifier are convex hulls of clusters present in individual client data. Second, to avoid label switching issues, we intro",
    "path": "papers/23/08/2308.06895.json",
    "total_tokens": 914,
    "translated_title": "超几何空间中的联邦分类通过凸包的安全聚合",
    "translated_abstract": "层级和树状数据集在许多应用中出现，包括语言处理、图数据挖掘、系统发育和基因组学。已知树状数据无法以小失真嵌入到有限维的欧几里得空间中。通过使用超几何空间可以缓解这个问题。当这样的数据还必须在分布式和私有化的环境中进行处理时，需要使用针对超几何空间量身定制的新的联邦学习方法。作为发展超几何空间中联邦学习领域的初始步骤，我们提出了已知的第一种在超几何空间中进行联邦分类的方法。我们的贡献如下。首先，我们为Poincar\\'e图中开发了凸SVM分类器的分布式版本。在这个设置中，从客户端向全局分类器传递的信息是各个客户端数据中存在的聚类的凸包。其次，为了避免标签切换问题，我们引入了一种新的机制以约束标签切换。",
    "tldr": "本研究是关于在超几何空间中进行联邦分类的首个方法，通过使用分布式凸SVM分类器和凸包的安全聚合来解决在隐私保护环境中处理树状数据的问题。",
    "en_tdlr": "This study proposes the first known approach to federated classification in hyperbolic spaces, addressing the challenge of processing tree-like data in a privacy-preserving environment by utilizing distributed convex SVM classifiers and secure aggregation of convex hulls."
}