{
    "title": "Lifelike Agility and Play on Quadrupedal Robots using Reinforcement Learning and Generative Pre-trained Models. (arXiv:2308.15143v1 [cs.RO])",
    "abstract": "Summarizing knowledge from animals and human beings inspires robotic innovations. In this work, we propose a framework for driving legged robots act like real animals with lifelike agility and strategy in complex environments. Inspired by large pre-trained models witnessed with impressive performance in language and image understanding, we introduce the power of advanced deep generative models to produce motor control signals stimulating legged robots to act like real animals. Unlike conventional controllers and end-to-end RL methods that are task-specific, we propose to pre-train generative models over animal motion datasets to preserve expressive knowledge of animal behavior. The pre-trained model holds sufficient primitive-level knowledge yet is environment-agnostic. It is then reused for a successive stage of learning to align with the environments by traversing a number of challenging obstacles that are rarely considered in previous approaches, including creeping through narrow sp",
    "link": "http://arxiv.org/abs/2308.15143",
    "context": "Title: Lifelike Agility and Play on Quadrupedal Robots using Reinforcement Learning and Generative Pre-trained Models. (arXiv:2308.15143v1 [cs.RO])\nAbstract: Summarizing knowledge from animals and human beings inspires robotic innovations. In this work, we propose a framework for driving legged robots act like real animals with lifelike agility and strategy in complex environments. Inspired by large pre-trained models witnessed with impressive performance in language and image understanding, we introduce the power of advanced deep generative models to produce motor control signals stimulating legged robots to act like real animals. Unlike conventional controllers and end-to-end RL methods that are task-specific, we propose to pre-train generative models over animal motion datasets to preserve expressive knowledge of animal behavior. The pre-trained model holds sufficient primitive-level knowledge yet is environment-agnostic. It is then reused for a successive stage of learning to align with the environments by traversing a number of challenging obstacles that are rarely considered in previous approaches, including creeping through narrow sp",
    "path": "papers/23/08/2308.15143.json",
    "total_tokens": 964,
    "translated_title": "使用强化学习和生成预训练模型在四足机器人上实现生动的灵活性和游戏性",
    "translated_abstract": "总结动物和人类的知识启发了机器人创新。在这项工作中，我们提出了一种框架，使四足机器人能够在复杂环境中像真实动物一样拥有生动的灵活性和策略。受到在语言和图像理解方面表现出色的大型预训练模型的启发，我们引入了先进的深度生成模型的能力，以生成模拟真实动物动作的运动控制信号。与传统控制器和端到端强化学习方法只针对特定任务不同，我们提出在动物运动数据集上预训练生成模型，以保留有表达力的动物行为知识。预训练模型拥有足够的原始级知识，但与环境无关。然后，在学习的后续阶段，通过穿越一些以前的方法很少考虑的具有挑战性的障碍，如穿过狭窄的空间等，使其适应环境。",
    "tldr": "该论文提出了一种使用生成模型和强化学习的框架，使四足机器人能够在复杂环境中像真实动物一样具有灵活性和策略。通过预训练生成模型，保留了动物行为的知识，并通过学习适应环境，克服挑战性的障碍。"
}