{
    "title": "Masked Momentum Contrastive Learning for Zero-shot Semantic Understanding. (arXiv:2308.11448v1 [cs.CV])",
    "abstract": "Self-supervised pretraining (SSP) has emerged as a popular technique in machine learning, enabling the extraction of meaningful feature representations without labelled data. In the realm of computer vision, pretrained vision transformers (ViTs) have played a pivotal role in advancing transfer learning. Nonetheless, the escalating cost of finetuning these large models has posed a challenge due to the explosion of model size. This study endeavours to evaluate the effectiveness of pure self-supervised learning (SSL) techniques in computer vision tasks, obviating the need for finetuning, with the intention of emulating human-like capabilities in generalisation and recognition of unseen objects. To this end, we propose an evaluation protocol for zero-shot segmentation based on a prompting patch. Given a point on the target object as a prompt, the algorithm calculates the similarity map between the selected patch and other patches, upon that, a simple thresholding is applied to segment the ",
    "link": "http://arxiv.org/abs/2308.11448",
    "context": "Title: Masked Momentum Contrastive Learning for Zero-shot Semantic Understanding. (arXiv:2308.11448v1 [cs.CV])\nAbstract: Self-supervised pretraining (SSP) has emerged as a popular technique in machine learning, enabling the extraction of meaningful feature representations without labelled data. In the realm of computer vision, pretrained vision transformers (ViTs) have played a pivotal role in advancing transfer learning. Nonetheless, the escalating cost of finetuning these large models has posed a challenge due to the explosion of model size. This study endeavours to evaluate the effectiveness of pure self-supervised learning (SSL) techniques in computer vision tasks, obviating the need for finetuning, with the intention of emulating human-like capabilities in generalisation and recognition of unseen objects. To this end, we propose an evaluation protocol for zero-shot segmentation based on a prompting patch. Given a point on the target object as a prompt, the algorithm calculates the similarity map between the selected patch and other patches, upon that, a simple thresholding is applied to segment the ",
    "path": "papers/23/08/2308.11448.json",
    "total_tokens": 928,
    "translated_title": "基于掩码动量对比学习的零样本语义理解",
    "translated_abstract": "自监督预训练（SSP）已经成为机器学习中一种流行的技术，能够在没有标注数据的情况下提取有意义的特征表示。在计算机视觉领域中，预训练的视觉变换器（ViTs）在推动迁移学习方面发挥了关键作用。然而，由于模型规模的爆炸性增长，微调这些大模型的成本不断增加，这给人工智能带来了挑战。本研究旨在评估纯自监督学习（SSL）技术在计算机视觉任务中的有效性，消除了微调的需要，以实现在一般化和识别未见对象方面模拟人类的能力。为此，我们提出了一种基于提示补丁的零样本分割评估协议。给定目标对象上的一个点作为提示，算法计算选定补丁与其他补丁之间的相似度图，然后应用简单的阈值分割算法。",
    "tldr": "本研究基于自监督学习技术，在计算机视觉任务中评估了零样本分割的有效性，提出了一种基于提示补丁的评估协议。这项研究旨在实现在一般化和识别未见对象方面模拟人类的能力。",
    "en_tdlr": "This study evaluates the effectiveness of zero-shot segmentation in computer vision tasks using self-supervised learning techniques, proposing an evaluation protocol based on prompting patches. The goal is to simulate human-like capabilities in generalization and recognition of unseen objects."
}