{
    "title": "Do We Price Happiness? Evidence from Korean Stock Market. (arXiv:2308.10039v1 [econ.GN])",
    "abstract": "This study explores the potential of internet search volume data, specifically Google Trends, as an indicator for cross-sectional stock returns. Unlike previous studies, our research specifically investigates the search volume of the topic 'happiness' and its impact on stock returns in the aspect of risk pricing rather than as sentiment measurement. Empirical results indicate that this 'happiness' search exposure (HSE) can explain future returns, particularly for big and value firms. This suggests that HSE might be a reflection of a firm's ability to produce goods or services that meet societal utility needs. Our findings have significant implications for institutional investors seeking to leverage HSE-based strategies for outperformance. Additionally, our research suggests that, when selected judiciously, some search topics on Google Trends can be related to risks that impact stock prices.",
    "link": "http://arxiv.org/abs/2308.10039",
    "context": "Title: Do We Price Happiness? Evidence from Korean Stock Market. (arXiv:2308.10039v1 [econ.GN])\nAbstract: This study explores the potential of internet search volume data, specifically Google Trends, as an indicator for cross-sectional stock returns. Unlike previous studies, our research specifically investigates the search volume of the topic 'happiness' and its impact on stock returns in the aspect of risk pricing rather than as sentiment measurement. Empirical results indicate that this 'happiness' search exposure (HSE) can explain future returns, particularly for big and value firms. This suggests that HSE might be a reflection of a firm's ability to produce goods or services that meet societal utility needs. Our findings have significant implications for institutional investors seeking to leverage HSE-based strategies for outperformance. Additionally, our research suggests that, when selected judiciously, some search topics on Google Trends can be related to risks that impact stock prices.",
    "path": "papers/23/08/2308.10039.json",
    "total_tokens": 940,
    "translated_title": "我们是否定价幸福？来自韩国股市的证据。",
    "translated_abstract": "本研究探讨了互联网搜索量数据，特别是谷歌趋势，作为跨部门股票回报的指标的潜力。与以往的研究不同，我们的研究特别研究了“幸福”这个主题的搜索量以及其对风险定价而不是情绪测量的影响。实证结果表明，“幸福”搜索曝光（HSE）可以解释未来的回报，尤其是对大型和价值型公司。这表明HSE可能是公司能够生产满足社会实用需求的商品或服务的反映。我们的研究结果对寻求利用基于HSE的策略实现超额回报的机构投资者具有重要意义。此外，我们的研究表明，一些谷歌趋势上的搜索主题在选取得当的情况下可以与影响股票价格的风险相关联。",
    "tldr": "本研究使用谷歌趋势数据探索了幸福搜索量对跨部门股票回报的影响。结果发现，幸福搜索曝光可以解释未来的回报，特别是对大型和价值型公司有影响，这表明幸福搜索量可能反映了公司生产满足社会实用需求的能力。该研究对寻求利用基于幸福搜索量的策略实现超额回报的机构投资者具有重要意义。",
    "en_tdlr": "This study explores the impact of happiness search volume on cross-sectional stock returns, finding that it can explain future returns, especially for big and value firms, suggesting it reflects a firm's ability to meet societal utility needs and has implications for institutional investors seeking outperformance."
}