{
    "title": "A machine-learning sleep-wake classification model using a reduced number of features derived from photoplethysmography and activity signals. (arXiv:2308.05759v1 [eess.SP])",
    "abstract": "Sleep is a crucial aspect of our overall health and well-being. It plays a vital role in regulating our mental and physical health, impacting our mood, memory, and cognitive function to our physical resilience and immune system. The classification of sleep stages is a mandatory step to assess sleep quality, providing the metrics to estimate the quality of sleep and how well our body is functioning during this essential period of rest. Photoplethysmography (PPG) has been demonstrated to be an effective signal for sleep stage inference, meaning it can be used on its own or in a combination with others signals to determine sleep stage. This information is valuable in identifying potential sleep issues and developing strategies to improve sleep quality and overall health. In this work, we present a machine learning sleep-wake classification model based on the eXtreme Gradient Boosting (XGBoost) algorithm and features extracted from PPG signal and activity counts. The performance of our met",
    "link": "http://arxiv.org/abs/2308.05759",
    "context": "Title: A machine-learning sleep-wake classification model using a reduced number of features derived from photoplethysmography and activity signals. (arXiv:2308.05759v1 [eess.SP])\nAbstract: Sleep is a crucial aspect of our overall health and well-being. It plays a vital role in regulating our mental and physical health, impacting our mood, memory, and cognitive function to our physical resilience and immune system. The classification of sleep stages is a mandatory step to assess sleep quality, providing the metrics to estimate the quality of sleep and how well our body is functioning during this essential period of rest. Photoplethysmography (PPG) has been demonstrated to be an effective signal for sleep stage inference, meaning it can be used on its own or in a combination with others signals to determine sleep stage. This information is valuable in identifying potential sleep issues and developing strategies to improve sleep quality and overall health. In this work, we present a machine learning sleep-wake classification model based on the eXtreme Gradient Boosting (XGBoost) algorithm and features extracted from PPG signal and activity counts. The performance of our met",
    "path": "papers/23/08/2308.05759.json",
    "total_tokens": 983,
    "translated_title": "一种利用从光电流血容积波形和活动信号中提取的少量特征的基于机器学习的睡眠-清醒分类模型",
    "translated_abstract": "睡眠对我们的整体健康和幸福感至关重要。它在调节我们的心理和身体健康方面起着至关重要的作用，对我们的情绪、记忆和认知功能以及身体的韧性和免疫系统都有影响。睡眠阶段的分类是评估睡眠质量的必要步骤，提供了估计睡眠质量和我们的身体在这个重要的休息时期内功能如何的指标。光电流血容积波形（PPG）已被证明是有效的睡眠阶段推断信号，意味着它可以单独使用或与其他信号结合使用来确定睡眠阶段。这些信息对于识别潜在的睡眠问题和制定改善睡眠质量和整体健康策略非常有价值。在这项工作中，我们提出了一种基于eXtreme Gradient Boosting（XGBoost）算法和从PPG信号和活动计数中提取的特征的机器学习睡眠-清醒分类模型。",
    "tldr": "这项研究提出了一种基于机器学习的睡眠-清醒分类模型，利用光电流血容积波形和活动信号提取的特征，可以评估睡眠质量，识别睡眠问题和改善整体健康。",
    "en_tdlr": "This research presents a machine-learning sleep-wake classification model that uses features extracted from photoplethysmography and activity signals to evaluate sleep quality, identify sleep issues, and improve overall health."
}