{
    "title": "Fast and Accurate Reduced-Order Modeling of a MOOSE-based Additive Manufacturing Model with Operator Learning. (arXiv:2308.02462v1 [cs.LG])",
    "abstract": "One predominant challenge in additive manufacturing (AM) is to achieve specific material properties by manipulating manufacturing process parameters during the runtime. Such manipulation tends to increase the computational load imposed on existing simulation tools employed in AM. The goal of the present work is to construct a fast and accurate reduced-order model (ROM) for an AM model developed within the Multiphysics Object-Oriented Simulation Environment (MOOSE) framework, ultimately reducing the time/cost of AM control and optimization processes. Our adoption of the operator learning (OL) approach enabled us to learn a family of differential equations produced by altering process variables in the laser's Gaussian point heat source. More specifically, we used the Fourier neural operator (FNO) and deep operator network (DeepONet) to develop ROMs for time-dependent responses. Furthermore, we benchmarked the performance of these OL methods against a conventional deep neural network (DNN",
    "link": "http://arxiv.org/abs/2308.02462",
    "context": "Title: Fast and Accurate Reduced-Order Modeling of a MOOSE-based Additive Manufacturing Model with Operator Learning. (arXiv:2308.02462v1 [cs.LG])\nAbstract: One predominant challenge in additive manufacturing (AM) is to achieve specific material properties by manipulating manufacturing process parameters during the runtime. Such manipulation tends to increase the computational load imposed on existing simulation tools employed in AM. The goal of the present work is to construct a fast and accurate reduced-order model (ROM) for an AM model developed within the Multiphysics Object-Oriented Simulation Environment (MOOSE) framework, ultimately reducing the time/cost of AM control and optimization processes. Our adoption of the operator learning (OL) approach enabled us to learn a family of differential equations produced by altering process variables in the laser's Gaussian point heat source. More specifically, we used the Fourier neural operator (FNO) and deep operator network (DeepONet) to develop ROMs for time-dependent responses. Furthermore, we benchmarked the performance of these OL methods against a conventional deep neural network (DNN",
    "path": "papers/23/08/2308.02462.json",
    "total_tokens": 953,
    "translated_title": "基于MOOSE框架的快速准确的减阶建模在增材制造中的运算学习",
    "translated_abstract": "增材制造中的一个主要挑战是在运行时通过调整制造过程参数来达到特定的材料属性。这种调整往往增加了用于增材制造中的现有模拟工具的计算负荷。本研究的目标是为在多物理面向对象模拟环境（MOOSE）框架中开发的增材制造模型构建一个快速准确的减阶模型（ROM），从而最终减少增材制造控制和优化过程的时间/成本。我们采用了运算学习（OL）方法，通过改变激光的高斯点热源中的过程变量，学习了一系列微分方程。具体而言，我们使用了Fourier神经运算器（FNO）和深度运算器网络（DeepONet）来开发时间相关响应的减阶模型。此外，我们将这些OL方法的性能与传统深度神经网络（DNN）进行了基准测试。",
    "tldr": "本研究利用运算学习方法，在MOOSE框架中开发了一个快速准确的减阶模型，用于增材制造中的控制和优化过程，通过改变过程变量来学习微分方程，使用Fourier神经运算器和深度运算器网络开发了时间相关响应的减阶模型。",
    "en_tdlr": "This research presents a fast and accurate reduced-order model developed within the MOOSE framework for control and optimization processes in additive manufacturing. By utilizing operator learning, a family of differential equations is learned by altering process variables, and Fourier neural operator and deep operator network are used to develop reduced-order models for time-dependent responses."
}