{
    "title": "Tweet Sentiment Extraction using Viterbi Algorithm with Transfer Learning. (arXiv:2308.05973v1 [cs.AI])",
    "abstract": "Tweet sentiment extraction extracts the most significant portion of the sentence, determining whether the sentiment is positive or negative. This research aims to identify the part of tweet sentences that strikes any emotion. To reach this objective, we continue improving the Viterbi algorithm previously modified by the author to make it able to receive pre-trained model parameters. We introduce the confidence score and vector as two indicators responsible for evaluating the model internally before assessing the final results. We then present a method to fine-tune this nonparametric model. We found that the model gets highly explainable as the confidence score vector reveals precisely where the least confidence predicted states are and if the modifications approved ameliorate the confidence score or if the tuning is going in the wrong direction.",
    "link": "http://arxiv.org/abs/2308.05973",
    "context": "Title: Tweet Sentiment Extraction using Viterbi Algorithm with Transfer Learning. (arXiv:2308.05973v1 [cs.AI])\nAbstract: Tweet sentiment extraction extracts the most significant portion of the sentence, determining whether the sentiment is positive or negative. This research aims to identify the part of tweet sentences that strikes any emotion. To reach this objective, we continue improving the Viterbi algorithm previously modified by the author to make it able to receive pre-trained model parameters. We introduce the confidence score and vector as two indicators responsible for evaluating the model internally before assessing the final results. We then present a method to fine-tune this nonparametric model. We found that the model gets highly explainable as the confidence score vector reveals precisely where the least confidence predicted states are and if the modifications approved ameliorate the confidence score or if the tuning is going in the wrong direction.",
    "path": "papers/23/08/2308.05973.json",
    "total_tokens": 776,
    "translated_title": "使用Viterbi算法和迁移学习进行推特情绪提取",
    "translated_abstract": "推特情绪提取是提取句子中最重要部分的过程，判断情绪是积极还是消极。本研究旨在识别推特句子中引起情感的部分。为了达到这个目标，我们继续改进作者之前修改的Viterbi算法，使其能够接收预训练的模型参数。我们引入置信度分数和向量作为两个指标，用于在评估最终结果之前对模型进行内部评估。然后，我们介绍了一种微调这个非参数模型的方法。我们发现，随着置信度分数向量准确地显示出最不自信的预测状态的位置，以及修改是否改善了置信度分数或微调是否朝着错误的方向进行，模型变得更易解释。",
    "tldr": "这篇论文使用Viterbi算法和迁移学习来提取推特情绪，引入置信度分数和向量作为评估模型的指标，进行模型的内部评估和微调。"
}