{
    "title": "Uncovering User Interest from Biased and Noised Watch Time in Video Recommendation. (arXiv:2308.08120v1 [cs.IR])",
    "abstract": "In the video recommendation, watch time is commonly adopted as an indicator of user interest. However, watch time is not only influenced by the matching of users' interests but also by other factors, such as duration bias and noisy watching. Duration bias refers to the tendency for users to spend more time on videos with longer durations, regardless of their actual interest level. Noisy watching, on the other hand, describes users taking time to determine whether they like a video or not, which can result in users spending time watching videos they do not like. Consequently, the existence of duration bias and noisy watching make watch time an inadequate label for indicating user interest. Furthermore, current methods primarily address duration bias and ignore the impact of noisy watching, which may limit their effectiveness in uncovering user interest from watch time. In this study, we first analyze the generation mechanism of users' watch time from a unified causal viewpoint. Specific",
    "link": "http://arxiv.org/abs/2308.08120",
    "context": "Title: Uncovering User Interest from Biased and Noised Watch Time in Video Recommendation. (arXiv:2308.08120v1 [cs.IR])\nAbstract: In the video recommendation, watch time is commonly adopted as an indicator of user interest. However, watch time is not only influenced by the matching of users' interests but also by other factors, such as duration bias and noisy watching. Duration bias refers to the tendency for users to spend more time on videos with longer durations, regardless of their actual interest level. Noisy watching, on the other hand, describes users taking time to determine whether they like a video or not, which can result in users spending time watching videos they do not like. Consequently, the existence of duration bias and noisy watching make watch time an inadequate label for indicating user interest. Furthermore, current methods primarily address duration bias and ignore the impact of noisy watching, which may limit their effectiveness in uncovering user interest from watch time. In this study, we first analyze the generation mechanism of users' watch time from a unified causal viewpoint. Specific",
    "path": "papers/23/08/2308.08120.json",
    "total_tokens": 1021,
    "translated_title": "从偏差和噪声的观看时长中揭示用户兴趣的视频推荐方法",
    "translated_abstract": "在视频推荐中，观看时长常被用作用户兴趣的指标。然而，观看时长不仅受到用户兴趣匹配的影响，还受到其他因素的影响，比如持续时间偏差和噪声观看。持续时间偏差指的是用户倾向于在视频持续时间较长时花费更多时间观看，而不考虑实际的兴趣水平。另一方面，噪声观看描述了用户花时间判断他们是否喜欢一个视频，这可能导致用户花时间观看他们不喜欢的视频。因此，持续时间偏差和噪声观看的存在使得观看时长成为一个不足以表示用户兴趣的标签。此外，当前的方法主要解决持续时间偏差而忽视了噪声观看的影响，这可能限制了它们在从观看时长中揭示用户兴趣方面的有效性。在本研究中，我们首先从统一的因果视角分析了用户观看时长的生成机制。具体来说，我们提出了一种基于因果推断的视频推荐方法，以减轻持续时间偏差和噪声观看带来的问题，并改善从观看时长中揭示用户兴趣的效果。",
    "tldr": "本研究分析了视频推荐中观看时长的生成机制，提出了一种基于因果推断的视频推荐方法，减轻了持续时间偏差和噪声观看带来的问题，并改善了从观看时长中揭示用户兴趣的效果。",
    "en_tdlr": "This study analyzes the generation mechanism of watch time in video recommendation and proposes a causal inference-based method to mitigate the issues caused by duration bias and noisy watching, improving the effectiveness of uncovering user interest from watch time."
}