{
    "title": "OpenProteinSet: Training data for structural biology at scale. (arXiv:2308.05326v1 [q-bio.BM])",
    "abstract": "Multiple sequence alignments (MSAs) of proteins encode rich biological information and have been workhorses in bioinformatic methods for tasks like protein design and protein structure prediction for decades. Recent breakthroughs like AlphaFold2 that use transformers to attend directly over large quantities of raw MSAs have reaffirmed their importance. Generation of MSAs is highly computationally intensive, however, and no datasets comparable to those used to train AlphaFold2 have been made available to the research community, hindering progress in machine learning for proteins. To remedy this problem, we introduce OpenProteinSet, an open-source corpus of more than 16 million MSAs, associated structural homologs from the Protein Data Bank, and AlphaFold2 protein structure predictions. We have previously demonstrated the utility of OpenProteinSet by successfully retraining AlphaFold2 on it. We expect OpenProteinSet to be broadly useful as training and validation data for 1) diverse task",
    "link": "http://arxiv.org/abs/2308.05326",
    "context": "Title: OpenProteinSet: Training data for structural biology at scale. (arXiv:2308.05326v1 [q-bio.BM])\nAbstract: Multiple sequence alignments (MSAs) of proteins encode rich biological information and have been workhorses in bioinformatic methods for tasks like protein design and protein structure prediction for decades. Recent breakthroughs like AlphaFold2 that use transformers to attend directly over large quantities of raw MSAs have reaffirmed their importance. Generation of MSAs is highly computationally intensive, however, and no datasets comparable to those used to train AlphaFold2 have been made available to the research community, hindering progress in machine learning for proteins. To remedy this problem, we introduce OpenProteinSet, an open-source corpus of more than 16 million MSAs, associated structural homologs from the Protein Data Bank, and AlphaFold2 protein structure predictions. We have previously demonstrated the utility of OpenProteinSet by successfully retraining AlphaFold2 on it. We expect OpenProteinSet to be broadly useful as training and validation data for 1) diverse task",
    "path": "papers/23/08/2308.05326.json",
    "total_tokens": 873,
    "translated_title": "OpenProteinSet：大规模结构生物学训练数据",
    "translated_abstract": "蛋白质的多序列比对（MSAs）编码了丰富的生物信息，并且在蛋白质设计和蛋白质结构预测等生物信息学方法中已经成为核心工具多年。最近的突破，如AlphaFold2直接使用transformers对大量原始MSAs进行关注，再次肯定了它们的重要性。然而，MSAs的生成非常计算密集，并且尚未向研究界提供与AlphaFold2训练所用数据相当的数据集，制约了蛋白质机器学习的进展。为了解决这个问题，我们推出了OpenProteinSet，这是一个开源的包含超过1600万个MSAs、蛋白数据银行中的结构同源物和AlphaFold2蛋白质结构预测的语料库。我们先前已经成功地使用OpenProteinSet重新训练了AlphaFold2，并证明了其实用性。我们期望OpenProteinSet能够作为训练和验证数据广泛用于不同的任务。",
    "tldr": "OpenProteinSet是一个包含超过1600万个MSAs和蛋白质结构预测的开源数据集，解决了蛋白质机器学习中数据不足的问题。",
    "en_tdlr": "OpenProteinSet is an open-source dataset containing over 16 million MSAs and protein structure predictions, addressing the issue of inadequate data for protein machine learning."
}