{
    "title": "Quantum-Inspired Machine Learning: a Survey. (arXiv:2308.11269v1 [cs.LG])",
    "abstract": "Quantum-inspired Machine Learning (QiML) is a burgeoning field, receiving global attention from researchers for its potential to leverage principles of quantum mechanics within classical computational frameworks. However, current review literature often presents a superficial exploration of QiML, focusing instead on the broader Quantum Machine Learning (QML) field. In response to this gap, this survey provides an integrated and comprehensive examination of QiML, exploring QiML's diverse research domains including tensor network simulations, dequantized algorithms, and others, showcasing recent advancements, practical applications, and illuminating potential future research avenues. Further, a concrete definition of QiML is established by analyzing various prior interpretations of the term and their inherent ambiguities. As QiML continues to evolve, we anticipate a wealth of future developments drawing from quantum mechanics, quantum computing, and classical machine learning, enriching ",
    "link": "http://arxiv.org/abs/2308.11269",
    "context": "Title: Quantum-Inspired Machine Learning: a Survey. (arXiv:2308.11269v1 [cs.LG])\nAbstract: Quantum-inspired Machine Learning (QiML) is a burgeoning field, receiving global attention from researchers for its potential to leverage principles of quantum mechanics within classical computational frameworks. However, current review literature often presents a superficial exploration of QiML, focusing instead on the broader Quantum Machine Learning (QML) field. In response to this gap, this survey provides an integrated and comprehensive examination of QiML, exploring QiML's diverse research domains including tensor network simulations, dequantized algorithms, and others, showcasing recent advancements, practical applications, and illuminating potential future research avenues. Further, a concrete definition of QiML is established by analyzing various prior interpretations of the term and their inherent ambiguities. As QiML continues to evolve, we anticipate a wealth of future developments drawing from quantum mechanics, quantum computing, and classical machine learning, enriching ",
    "path": "papers/23/08/2308.11269.json",
    "total_tokens": 1002,
    "translated_title": "量子启发式机器学习：一项调查",
    "translated_abstract": "量子启发式机器学习（QiML）是一个不断发展的领域，因其在经典计算框架中利用量子力学原理的潜力而受到全球研究人员的关注。然而，目前的综述文献经常只对QiML进行表面探索，而更多关注广义的量子机器学习（QML）领域。为了弥补这一空白，本调查提供了对QiML的综合和全面的研究，探讨了QiML的多样化研究领域，包括张量网络模拟、非量子化算法等，展示了最新的进展、实际应用，并揭示了潜在的未来研究方向。此外，通过分析先前对QiML的各种解释及其内在的模糊性，建立了一个具体的QiML定义。随着QiML的不断发展，我们预计将有大量的未来发展从量子力学、量子计算和经典机器学习中汲取经验，丰富QiML的领域。",
    "tldr": "量子启发式机器学习（QiML）是一个利用量子力学原理在经典计算框架中的新领域，在本调查中我们提供了对QiML的综合和全面的研究，展示了其多样化的研究领域、最新进展和实际应用，并为QiML建立了明确的定义。未来的研究将从量子力学、量子计算和经典机器学习中汲取经验，丰富QiML的领域。",
    "en_tdlr": "Quantum-inspired Machine Learning (QiML) is a new field that leverages principles of quantum mechanics within classical computational frameworks. This survey provides a comprehensive examination of QiML, showcasing its diverse research domains, recent advancements, and practical applications, while establishing a concrete definition. Future research will draw from quantum mechanics, quantum computing, and classical machine learning to enrich the field of QiML."
}