{
    "title": "Tweet Insights: A Visualization Platform to Extract Temporal Insights from Twitter. (arXiv:2308.02142v1 [cs.CL])",
    "abstract": "This paper introduces a large collection of time series data derived from Twitter, postprocessed using word embedding techniques, as well as specialized fine-tuned language models. This data comprises the past five years and captures changes in n-gram frequency, similarity, sentiment and topic distribution. The interface built on top of this data enables temporal analysis for detecting and characterizing shifts in meaning, including complementary information to trending metrics, such as sentiment and topic association over time. We release an online demo for easy experimentation, and we share code and the underlying aggregated data for future work. In this paper, we also discuss three case studies unlocked thanks to our platform, showcasing its potential for temporal linguistic analysis.",
    "link": "http://arxiv.org/abs/2308.02142",
    "context": "Title: Tweet Insights: A Visualization Platform to Extract Temporal Insights from Twitter. (arXiv:2308.02142v1 [cs.CL])\nAbstract: This paper introduces a large collection of time series data derived from Twitter, postprocessed using word embedding techniques, as well as specialized fine-tuned language models. This data comprises the past five years and captures changes in n-gram frequency, similarity, sentiment and topic distribution. The interface built on top of this data enables temporal analysis for detecting and characterizing shifts in meaning, including complementary information to trending metrics, such as sentiment and topic association over time. We release an online demo for easy experimentation, and we share code and the underlying aggregated data for future work. In this paper, we also discuss three case studies unlocked thanks to our platform, showcasing its potential for temporal linguistic analysis.",
    "path": "papers/23/08/2308.02142.json",
    "total_tokens": 828,
    "translated_title": "Tweet Insights: 从Twitter提取时间相关信息的可视化平台",
    "translated_abstract": "本文介绍了一种使用词嵌入技术和专门优化的语言模型对Twitter的大量时间序列数据进行后处理的方法。这些数据涵盖了过去五年的变化，包括n-gram频率、相似度、情感和主题分布的变化。通过在这些数据之上构建的界面，可以对时间进行分析，以便检测和描述意义转变的变化，包括与趋势度量相关的补充信息，如情感和主题的变化。我们发布了一个在线演示供轻松实验，并共享代码和基础汇总数据以供未来研究使用。在本文中，我们还讨论了基于我们平台的三个案例研究，展示了它在时间语言分析中的潜力。",
    "tldr": "该论文介绍了一个名为Tweet Insights的可视化平台，可以从Twitter中提取时间相关信息。它使用词嵌入技术和专门优化的语言模型对Twitter的大量时间序列数据进行后处理，并通过界面对时间进行分析，以检测和描述意义转变的变化，包括与趋势度量相关的补充信息，如情感和主题的变化。",
    "en_tdlr": "This paper introduces a visualization platform called Tweet Insights that extracts temporal insights from Twitter. It utilizes word embedding techniques and specialized language models to postprocess a large collection of time series data from Twitter, enabling temporal analysis for detecting and characterizing shifts in meaning, including complementary information to trending metrics such as sentiment and topic association over time."
}