{
    "title": "Robust Linear Regression: Phase-Transitions and Precise Tradeoffs for General Norms. (arXiv:2308.00556v1 [stat.ML])",
    "abstract": "In this paper, we investigate the impact of test-time adversarial attacks on linear regression models and determine the optimal level of robustness that any model can reach while maintaining a given level of standard predictive performance (accuracy). Through quantitative estimates, we uncover fundamental tradeoffs between adversarial robustness and accuracy in different regimes. We obtain a precise characterization which distinguishes between regimes where robustness is achievable without hurting standard accuracy and regimes where a tradeoff might be unavoidable. Our findings are empirically confirmed with simple experiments that represent a variety of settings. This work applies to feature covariance matrices and attack norms of any nature, and extends beyond previous works in this area.",
    "link": "http://arxiv.org/abs/2308.00556",
    "context": "Title: Robust Linear Regression: Phase-Transitions and Precise Tradeoffs for General Norms. (arXiv:2308.00556v1 [stat.ML])\nAbstract: In this paper, we investigate the impact of test-time adversarial attacks on linear regression models and determine the optimal level of robustness that any model can reach while maintaining a given level of standard predictive performance (accuracy). Through quantitative estimates, we uncover fundamental tradeoffs between adversarial robustness and accuracy in different regimes. We obtain a precise characterization which distinguishes between regimes where robustness is achievable without hurting standard accuracy and regimes where a tradeoff might be unavoidable. Our findings are empirically confirmed with simple experiments that represent a variety of settings. This work applies to feature covariance matrices and attack norms of any nature, and extends beyond previous works in this area.",
    "path": "papers/23/08/2308.00556.json",
    "total_tokens": 860,
    "translated_title": "坚强的线性回归：相变和对一般范数的精确权衡",
    "translated_abstract": "本文研究了测试时对线性回归模型的对抗攻击对其影响，并确定了任何模型在保持给定水平的预测性能（准确度）的同时可以达到的最佳鲁棒性水平。通过定量估计，我们揭示了在不同领域中鲁棒性和准确性之间的基本权衡。我们获得了一个明确的描述，区分了在不损害标准准确性的情况下可以实现鲁棒性的情况与不可避免地需要权衡的情况。我们的研究结果在多种设置下通过简单的实验得到了经验证实。这项工作适用于特征协方差矩阵和任何性质的攻击范数，并超越了之前在该领域的工作。",
    "tldr": "本文研究了测试时的对抗攻击对线性回归模型的影响，并确定了在保持预测性能的情况下可以达到的最佳鲁棒性水平。该研究揭示了鲁棒性和准确性之间的权衡，并在不损害准确性的情况下找到了鲁棒性的实现方法。"
}