{
    "title": "Linking microblogging sentiments to stock price movement: An application of GPT-4. (arXiv:2308.16771v1 [q-fin.ST])",
    "abstract": "This paper investigates the potential improvement of the GPT-4 Language Learning Model (LLM) in comparison to BERT for modeling same-day daily stock price movements of Apple and Tesla in 2017, based on sentiment analysis of microblogging messages. We recorded daily adjusted closing prices and translated them into up-down movements. Sentiment for each day was extracted from messages on the Stocktwits platform using both LLMs. We develop a novel method to engineer a comprehensive prompt for contextual sentiment analysis which unlocks the true capabilities of modern LLM. This enables us to carefully retrieve sentiments, perceived advantages or disadvantages, and the relevance towards the analyzed company. Logistic regression is used to evaluate whether the extracted message contents reflect stock price movements. As a result, GPT-4 exhibited substantial accuracy, outperforming BERT in five out of six months and substantially exceeding a naive buy-and-hold strategy, reaching a peak accurac",
    "link": "http://arxiv.org/abs/2308.16771",
    "context": "Title: Linking microblogging sentiments to stock price movement: An application of GPT-4. (arXiv:2308.16771v1 [q-fin.ST])\nAbstract: This paper investigates the potential improvement of the GPT-4 Language Learning Model (LLM) in comparison to BERT for modeling same-day daily stock price movements of Apple and Tesla in 2017, based on sentiment analysis of microblogging messages. We recorded daily adjusted closing prices and translated them into up-down movements. Sentiment for each day was extracted from messages on the Stocktwits platform using both LLMs. We develop a novel method to engineer a comprehensive prompt for contextual sentiment analysis which unlocks the true capabilities of modern LLM. This enables us to carefully retrieve sentiments, perceived advantages or disadvantages, and the relevance towards the analyzed company. Logistic regression is used to evaluate whether the extracted message contents reflect stock price movements. As a result, GPT-4 exhibited substantial accuracy, outperforming BERT in five out of six months and substantially exceeding a naive buy-and-hold strategy, reaching a peak accurac",
    "path": "papers/23/08/2308.16771.json",
    "total_tokens": 919,
    "translated_title": "将微博情绪与股票价格运动相关联：GPT-4的应用",
    "translated_abstract": "本文研究了GPT-4语言学习模型（LLM）在对比BERT模型中，通过对微博消息的情感分析来建模苹果和特斯拉2017年同日日常股价的潜在改进。我们记录了每日调整后的收盘价格，并将其转化为上涨或下跌的动态。利用两种LLM从Stocktwits平台上提取每日的情绪。我们开发了一种新颖的方法，通过综合提示来进行情境情感分析，以发掘现代LLM的真实能力。这使我们能够仔细提取情绪、感知优势或劣势，以及与分析公司相关性。采用逻辑回归评估提取的消息内容是否反映了股票价格的变动。结果表明，GPT-4在五个月中超过了BERT，显著提高了准确性，并且明显超过了天真的买入持有策略，达到了最高的准确性。",
    "tldr": "本文研究了GPT-4在通过微博情感分析预测股票价格运动方面的潜在改进，并开发了一种新的方法用于情境情感分析，结果显示GPT-4在准确性上超过了BERT和买入持有策略。",
    "en_tdlr": "This paper investigates the potential improvement of GPT-4 in predicting stock price movements through sentiment analysis of microblogging messages and develops a novel method for contextual sentiment analysis. The results show that GPT-4 outperforms BERT and a naive buy-and-hold strategy in terms of accuracy."
}