{
    "title": "PUG: Photorealistic and Semantically Controllable Synthetic Data for Representation Learning. (arXiv:2308.03977v1 [cs.CV])",
    "abstract": "Synthetic image datasets offer unmatched advantages for designing and evaluating deep neural networks: they make it possible to (i) render as many data samples as needed, (ii) precisely control each scene and yield granular ground truth labels (and captions), (iii) precisely control distribution shifts between training and testing to isolate variables of interest for sound experimentation. Despite such promise, the use of synthetic image data is still limited -- and often played down -- mainly due to their lack of realism. Most works therefore rely on datasets of real images, which have often been scraped from public images on the internet, and may have issues with regards to privacy, bias, and copyright, while offering little control over how objects precisely appear. In this work, we present a path to democratize the use of photorealistic synthetic data: we develop a new generation of interactive environments for representation learning research, that offer both controllability and r",
    "link": "http://arxiv.org/abs/2308.03977",
    "context": "Title: PUG: Photorealistic and Semantically Controllable Synthetic Data for Representation Learning. (arXiv:2308.03977v1 [cs.CV])\nAbstract: Synthetic image datasets offer unmatched advantages for designing and evaluating deep neural networks: they make it possible to (i) render as many data samples as needed, (ii) precisely control each scene and yield granular ground truth labels (and captions), (iii) precisely control distribution shifts between training and testing to isolate variables of interest for sound experimentation. Despite such promise, the use of synthetic image data is still limited -- and often played down -- mainly due to their lack of realism. Most works therefore rely on datasets of real images, which have often been scraped from public images on the internet, and may have issues with regards to privacy, bias, and copyright, while offering little control over how objects precisely appear. In this work, we present a path to democratize the use of photorealistic synthetic data: we develop a new generation of interactive environments for representation learning research, that offer both controllability and r",
    "path": "papers/23/08/2308.03977.json",
    "total_tokens": 907,
    "translated_title": "PUG:用于表示学习的逼真且语义可控的合成数据",
    "translated_abstract": "合成图像数据集在设计和评估深度神经网络方面具有独特的优势：它们可以渲染所需数量的数据样本，精确控制每个场景并提供精细的真实标签（和标题），并可以精确控制训练和测试之间的分布转变，以隔离感兴趣的变量进行可靠实验。尽管具有如此优势，但合成图像数据的使用仍受限制，并且通常由于其缺乏真实性而被忽视。因此，大多数工作仍依赖于来自互联网上公开图像的真实图像数据集，并且可能存在隐私、偏见和版权问题，且对于对象的精确呈现方式控制能力较小。在这项工作中，我们提出了利用逼真的合成数据解决该问题的途径：我们开发了一种用于表示学习研究的新一代交互环境，提供了可控性和逼真度。",
    "tldr": "我们提出了一种使用逼真且语义可控的合成数据的方法，用于表示学习研究，该方法具有渲染所需数量的数据样本、精确控制场景和分布转变以及精细的真实标签的优点。"
}