{
    "title": "Recent Advancements In The Field Of Deepfake Detection. (arXiv:2308.05563v1 [cs.AI])",
    "abstract": "A deepfake is a photo or video of a person whose image has been digitally altered or partially replaced with an image of someone else. Deepfakes have the potential to cause a variety of problems and are often used maliciously. A common usage is altering videos of prominent political figures and celebrities. These deepfakes can portray them making offensive, problematic, and/or untrue statements. Current deepfakes can be very realistic, and when used in this way, can spread panic and even influence elections and political opinions. There are many deepfake detection strategies currently in use but finding the most comprehensive and universal method is critical. So, in this survey we will address the problems of malicious deepfake creation and the lack of universal deepfake detection methods. Our objective is to survey and analyze a variety of current methods and advances in the field of deepfake detection.",
    "link": "http://arxiv.org/abs/2308.05563",
    "context": "Title: Recent Advancements In The Field Of Deepfake Detection. (arXiv:2308.05563v1 [cs.AI])\nAbstract: A deepfake is a photo or video of a person whose image has been digitally altered or partially replaced with an image of someone else. Deepfakes have the potential to cause a variety of problems and are often used maliciously. A common usage is altering videos of prominent political figures and celebrities. These deepfakes can portray them making offensive, problematic, and/or untrue statements. Current deepfakes can be very realistic, and when used in this way, can spread panic and even influence elections and political opinions. There are many deepfake detection strategies currently in use but finding the most comprehensive and universal method is critical. So, in this survey we will address the problems of malicious deepfake creation and the lack of universal deepfake detection methods. Our objective is to survey and analyze a variety of current methods and advances in the field of deepfake detection.",
    "path": "papers/23/08/2308.05563.json",
    "total_tokens": 873,
    "translated_title": "深度伪造检测领域的最新进展",
    "translated_abstract": "深度伪造是指一个人的照片或视频被数字化改变或部分替换为其他人的图像。深度伪造可能导致各种问题，常被恶意使用。一种常见的用法是修改著名政治人物和名人的视频。这些深度伪造可以展示他们发表冒犯、有问题和/或不真实的声明。当前的深度伪造非常逼真，当以这种方式使用时，可能引发恐慌，甚至影响选举和政治观点。目前有许多深度伪造检测策略，但找到最全面、普适的方法至关重要。因此，在这项调查中，我们将解决恶意深度伪造创建和缺乏普适深度伪造检测方法的问题。我们的目标是调查和分析当前深度伪造检测领域的各种方法和进展。",
    "tldr": "该论文调查了深度伪造的问题，包括恶意深度伪造的创建和缺乏普适深度伪造检测方法。通过对当前的深度伪造检测方法和进展进行调查和分析，旨在找到最全面、普适的检测方法。",
    "en_tdlr": "This paper investigates the issues of deepfake, including the creation of malicious deepfakes and the lack of universal deepfake detection methods. By surveying and analyzing current methods and advances in deepfake detection, the aim is to find the most comprehensive and universal detection method."
}