{
    "title": "An investigation into the impact of deep learning model choice on sex and race bias in cardiac MR segmentation. (arXiv:2308.13415v1 [eess.IV])",
    "abstract": "In medical imaging, artificial intelligence (AI) is increasingly being used to automate routine tasks. However, these algorithms can exhibit and exacerbate biases which lead to disparate performances between protected groups. We investigate the impact of model choice on how imbalances in subject sex and race in training datasets affect AI-based cine cardiac magnetic resonance image segmentation. We evaluate three convolutional neural network-based models and one vision transformer model. We find significant sex bias in three of the four models and racial bias in all of the models. However, the severity and nature of the bias varies between the models, highlighting the importance of model choice when attempting to train fair AI-based segmentation models for medical imaging tasks.",
    "link": "http://arxiv.org/abs/2308.13415",
    "context": "Title: An investigation into the impact of deep learning model choice on sex and race bias in cardiac MR segmentation. (arXiv:2308.13415v1 [eess.IV])\nAbstract: In medical imaging, artificial intelligence (AI) is increasingly being used to automate routine tasks. However, these algorithms can exhibit and exacerbate biases which lead to disparate performances between protected groups. We investigate the impact of model choice on how imbalances in subject sex and race in training datasets affect AI-based cine cardiac magnetic resonance image segmentation. We evaluate three convolutional neural network-based models and one vision transformer model. We find significant sex bias in three of the four models and racial bias in all of the models. However, the severity and nature of the bias varies between the models, highlighting the importance of model choice when attempting to train fair AI-based segmentation models for medical imaging tasks.",
    "path": "papers/23/08/2308.13415.json",
    "total_tokens": 874,
    "translated_title": "对深度学习模型选择对心脏磁共振分割中性别和种族偏差的影响的研究",
    "translated_abstract": "在医学成像中，人工智能（AI）越来越多地被用于自动化例行任务。然而，这些算法可能会出现并加剧偏差，导致受保护的群体之间的不平等表现。我们研究了模型选择对基于AI的心脏磁共振图像分割中训练数据集中主体性别和种族不平衡所产生的影响。我们评估了三个基于卷积神经网络的模型和一个视觉变换器模型。我们发现四个模型中有三个存在显著的性别偏差，而所有模型中都存在种族偏差。然而，偏差的严重程度和性质因模型而异，这凸显了模型选择在尝试训练公平的基于AI的医学成像分割模型时的重要性。",
    "tldr": "这项研究调查了深度学习模型选择对心脏磁共振分割中性别和种族偏差的影响，发现不同模型之间偏差的严重性和性质不同，强调了模型选择在训练公平的基于AI的医学成像分割模型时的重要性。",
    "en_tdlr": "This study investigates the impact of deep learning model choice on sex and race bias in cardiac MR segmentation, finding that the severity and nature of the bias vary between different models, highlighting the importance of model selection when training fair AI-based segmentation models for medical imaging tasks."
}