{
    "title": "RESTORE: Graph Embedding Assessment Through Reconstruction. (arXiv:2308.14659v2 [cs.LG] UPDATED)",
    "abstract": "Following the success of Word2Vec embeddings, graph embeddings (GEs) have gained substantial traction. GEs are commonly generated and evaluated extrinsically on downstream applications, but intrinsic evaluations of the original graph properties in terms of topological structure and semantic information have been lacking. Understanding these will help identify the deficiency of the various families of GE methods when vectorizing graphs in terms of preserving the relevant knowledge or learning incorrect knowledge. To address this, we propose RESTORE, a framework for intrinsic GEs assessment through graph reconstruction. We show that reconstructing the original graph from the underlying GEs yields insights into the relative amount of information preserved in a given vector form. We first introduce the graph reconstruction task. We generate GEs from three GE families based on factorization methods, random walks, and deep learning (with representative algorithms from each family) on the Com",
    "link": "http://arxiv.org/abs/2308.14659",
    "context": "Title: RESTORE: Graph Embedding Assessment Through Reconstruction. (arXiv:2308.14659v2 [cs.LG] UPDATED)\nAbstract: Following the success of Word2Vec embeddings, graph embeddings (GEs) have gained substantial traction. GEs are commonly generated and evaluated extrinsically on downstream applications, but intrinsic evaluations of the original graph properties in terms of topological structure and semantic information have been lacking. Understanding these will help identify the deficiency of the various families of GE methods when vectorizing graphs in terms of preserving the relevant knowledge or learning incorrect knowledge. To address this, we propose RESTORE, a framework for intrinsic GEs assessment through graph reconstruction. We show that reconstructing the original graph from the underlying GEs yields insights into the relative amount of information preserved in a given vector form. We first introduce the graph reconstruction task. We generate GEs from three GE families based on factorization methods, random walks, and deep learning (with representative algorithms from each family) on the Com",
    "path": "papers/23/08/2308.14659.json",
    "total_tokens": 769,
    "translated_title": "RESTORE: 通过重建进行图嵌入评估",
    "translated_abstract": "在Word2Vec嵌入取得成功之后，图嵌入（GEs）开始受到广泛关注。GEs常常在下游应用中生成和评估外显性，但关于原始图的拓扑结构和语义信息的内在评估一直缺乏。了解这些将有助于确定各种GE方法在向量化图时丧失相关知识或学习错误知识的不足之处。因此，我们提出了RESTORE，一个用于通过图重建进行内在GEs评估的框架。我们展示了从底层GEs中重建原始图可以揭示在给定向量形式中保留的信息量。我们首先介绍了图重建任务。我们根据分解方法、随机行走和深度学习从三个GE家族生成GEs（每个家族选择了代表性算法）。",
    "tldr": "RESTORE是一个用于通过图重建进行内在GEs评估的框架，可以揭示在给定向量形式中保留的信息量。",
    "en_tdlr": "RESTORE is a framework for intrinsic assessment of graph embeddings through graph reconstruction, which reveals the amount of information preserved in a given vector form."
}