{
    "title": "WellXplain: Wellness Concept Extraction and Classification in Reddit Posts for Mental Health Analysis. (arXiv:2308.13710v1 [cs.CL])",
    "abstract": "During the current mental health crisis, the importance of identifying potential indicators of mental issues from social media content has surged. Overlooking the multifaceted nature of mental and social well-being can have detrimental effects on one's mental state. In traditional therapy sessions, professionals manually pinpoint the origins and outcomes of underlying mental challenges, a process both detailed and time-intensive. We introduce an approach to this intricate mental health analysis by framing the identification of wellness dimensions in Reddit content as a wellness concept extraction and categorization challenge. We've curated a unique dataset named WELLXPLAIN, comprising 3,092 entries and totaling 72,813 words. Drawing from Halbert L. Dunn's well-regarded wellness theory, our team formulated an annotation framework along with guidelines. This dataset also includes human-marked textual segments, offering clear reasoning for decisions made in the wellness concept categoriza",
    "link": "http://arxiv.org/abs/2308.13710",
    "context": "Title: WellXplain: Wellness Concept Extraction and Classification in Reddit Posts for Mental Health Analysis. (arXiv:2308.13710v1 [cs.CL])\nAbstract: During the current mental health crisis, the importance of identifying potential indicators of mental issues from social media content has surged. Overlooking the multifaceted nature of mental and social well-being can have detrimental effects on one's mental state. In traditional therapy sessions, professionals manually pinpoint the origins and outcomes of underlying mental challenges, a process both detailed and time-intensive. We introduce an approach to this intricate mental health analysis by framing the identification of wellness dimensions in Reddit content as a wellness concept extraction and categorization challenge. We've curated a unique dataset named WELLXPLAIN, comprising 3,092 entries and totaling 72,813 words. Drawing from Halbert L. Dunn's well-regarded wellness theory, our team formulated an annotation framework along with guidelines. This dataset also includes human-marked textual segments, offering clear reasoning for decisions made in the wellness concept categoriza",
    "path": "papers/23/08/2308.13710.json",
    "total_tokens": 938,
    "translated_title": "WellXplain: Reddit帖子中的健康概念提取和分类，用于精神健康分析",
    "translated_abstract": "在当前的精神健康危机中，从社交媒体内容中识别潜在的精神问题指标的重要性有所增加。忽视精神和社会幸福的多面性可能对一个人的精神状态产生有害影响。在传统的治疗过程中，专业人员需要手动确定潜在精神挑战的起源和结果，这是一个详细而耗时的过程。我们通过将Reddit内容中的健康维度识别为健康概念提取和分类的挑战，引入了一种复杂的精神健康分析方法。我们创建了一个名为WELLXPLAIN的独特数据集，包括3,092个条目，总计72,813个单词。基于哈尔伯特·L·邓恩的著名健康理论，我们的团队制定了一个注释框架和指南。该数据集还包括人工标记的文本片段，清楚解释了健康概念分类决策的原因。",
    "tldr": "本研究提出了一种通过在Reddit内容中识别健康维度的方法来进行复杂的精神健康分析。他们创建了一个名为WELLXPLAIN的数据集，并制定了一个注释框架。这种方法有助于在社交媒体上识别潜在的精神问题指标。"
}