{
    "title": "Multimodal Indoor Localisation in Parkinson's Disease for Detecting Medication Use: Observational Pilot Study in a Free-Living Setting. (arXiv:2308.02419v1 [eess.SP])",
    "abstract": "Parkinson's disease (PD) is a slowly progressive, debilitating neurodegenerative disease which causes motor symptoms including gait dysfunction. Motor fluctuations are alterations between periods with a positive response to levodopa therapy (\"on\") and periods marked by re-emergency of PD symptoms (\"off\") as the response to medication wears off. These fluctuations often affect gait speed and they increase in their disabling impact as PD progresses. To improve the effectiveness of current indoor localisation methods, a transformer-based approach utilising dual modalities which provide complementary views of movement, Received Signal Strength Indicator (RSSI) and accelerometer data from wearable devices, is proposed. A sub-objective aims to evaluate whether indoor localisation, including its in-home gait speed features (i.e. the time taken to walk between rooms), could be used to evaluate motor fluctuations by detecting whether the person with PD is taking levodopa medications or withhold",
    "link": "http://arxiv.org/abs/2308.02419",
    "context": "Title: Multimodal Indoor Localisation in Parkinson's Disease for Detecting Medication Use: Observational Pilot Study in a Free-Living Setting. (arXiv:2308.02419v1 [eess.SP])\nAbstract: Parkinson's disease (PD) is a slowly progressive, debilitating neurodegenerative disease which causes motor symptoms including gait dysfunction. Motor fluctuations are alterations between periods with a positive response to levodopa therapy (\"on\") and periods marked by re-emergency of PD symptoms (\"off\") as the response to medication wears off. These fluctuations often affect gait speed and they increase in their disabling impact as PD progresses. To improve the effectiveness of current indoor localisation methods, a transformer-based approach utilising dual modalities which provide complementary views of movement, Received Signal Strength Indicator (RSSI) and accelerometer data from wearable devices, is proposed. A sub-objective aims to evaluate whether indoor localisation, including its in-home gait speed features (i.e. the time taken to walk between rooms), could be used to evaluate motor fluctuations by detecting whether the person with PD is taking levodopa medications or withhold",
    "path": "papers/23/08/2308.02419.json",
    "total_tokens": 977,
    "translated_title": "在帕金森病中用于检测药物使用的多模态室内定位：在自由生活环境中的观察性试验",
    "translated_abstract": "帕金森病（PD）是一种缓慢进展的神经退行性疾病，导致包括步态障碍在内的运动症状。运动波动是指在左多巴疗法（“开”）和PD症状再度出现（“关”）之间的变化，因药物效果减退而引起。这些波动经常影响步态速度，并随着PD进展而增加其致残影响。为了提高当前室内定位方法的有效性，提出了一种基于变压器的方法，利用可穿戴设备的接收信号强度指示器（RSSI）和加速度计数据提供互补的运动视角。一个次目标旨在评估室内定位，包括其家庭步态速度特征（即在房间之间行走所需的时间），是否可以用于通过检测帕金森病患者是否正在使用左多巴药物或患者是否停用药物来评估运动波动。",
    "tldr": "该研究提出了一种基于变压器的方法，使用穿戴设备的RSSI和加速度计数据进行室内定位，以改善当前方法的有效性。研究还探讨了室内定位是否可以通过检测帕金森病患者的药物使用情况来评估运动波动。"
}