{
    "title": "Discourse-Aware Text Simplification: From Complex Sentences to Linked Propositions. (arXiv:2308.00425v1 [cs.CL])",
    "abstract": "Sentences that present a complex syntax act as a major stumbling block for downstream Natural Language Processing applications whose predictive quality deteriorates with sentence length and complexity. The task of Text Simplification (TS) may remedy this situation. It aims to modify sentences in order to make them easier to process, using a set of rewriting operations, such as reordering, deletion, or splitting. State-of-the-art syntactic TS approaches suffer from two major drawbacks: first, they follow a very conservative approach in that they tend to retain the input rather than transforming it, and second, they ignore the cohesive nature of texts, where context spread across clauses or sentences is needed to infer the true meaning of a statement. To address these problems, we present a discourse-aware TS approach that splits and rephrases complex English sentences within the semantic context in which they occur. Based on a linguistically grounded transformation stage that uses claus",
    "link": "http://arxiv.org/abs/2308.00425",
    "context": "Title: Discourse-Aware Text Simplification: From Complex Sentences to Linked Propositions. (arXiv:2308.00425v1 [cs.CL])\nAbstract: Sentences that present a complex syntax act as a major stumbling block for downstream Natural Language Processing applications whose predictive quality deteriorates with sentence length and complexity. The task of Text Simplification (TS) may remedy this situation. It aims to modify sentences in order to make them easier to process, using a set of rewriting operations, such as reordering, deletion, or splitting. State-of-the-art syntactic TS approaches suffer from two major drawbacks: first, they follow a very conservative approach in that they tend to retain the input rather than transforming it, and second, they ignore the cohesive nature of texts, where context spread across clauses or sentences is needed to infer the true meaning of a statement. To address these problems, we present a discourse-aware TS approach that splits and rephrases complex English sentences within the semantic context in which they occur. Based on a linguistically grounded transformation stage that uses claus",
    "path": "papers/23/08/2308.00425.json",
    "total_tokens": 891,
    "translated_title": "从复杂句子到链接命题的话语感知文本简化",
    "translated_abstract": "对于下游自然语言处理应用来说，复杂句子是其中一个重要的障碍，句子的长度和复杂性会导致预测质量下降。文本简化的任务就是为了使句子更容易处理而对其进行修改，使用一系列的重写操作，比如重新排序、删除或拆分。现有的句法文本简化方法存在两个主要缺点：一方面，它们采取了非常保守的方法，倾向于保留输入而不进行转换；另一方面，它们忽略了文本的连贯性，需要跨越从句或句子的上下文来推断语句的真正含义。为了解决这些问题，我们提出了一种话语感知的文本简化方法，在句子所处的语义上下文中拆分和重新表达复杂的英语句子。基于一个基于语言学的转换阶段，该阶段利用从句和命题之间的关系来完成简化操作。",
    "tldr": "本研究提出了一种话语感知的文本简化方法，通过在句子的语义上下文中拆分和重新表达复杂的英语句子，解决了现有句法文本简化方法的保守性和忽略上下文连贯性的问题。",
    "en_tdlr": "This paper proposes a discourse-aware text simplification approach that addresses the conservativeness and lack of context coherence in existing syntactic text simplification methods by splitting and rephrasing complex English sentences within their semantic context."
}