{
    "title": "SSL-Auth: An Authentication Framework by Fragile Watermarking for Pre-trained Encoders in Self-supervised Learning. (arXiv:2308.04673v1 [cs.CR])",
    "abstract": "Self-supervised learning (SSL) which leverages unlabeled datasets for pre-training powerful encoders has achieved significant success in recent years. These encoders are commonly used as feature extractors for various downstream tasks, requiring substantial data and computing resources for their training process. With the deployment of pre-trained encoders in commercial use, protecting the intellectual property of model owners and ensuring the trustworthiness of the models becomes crucial. Recent research has shown that encoders are threatened by backdoor attacks, adversarial attacks, etc. Therefore, a scheme to verify the integrity of pre-trained encoders is needed to protect users. In this paper, we propose SSL-Auth, the first fragile watermarking scheme for verifying the integrity of encoders without compromising model performance. Our method utilizes selected key samples as watermark information and trains a verification network to reconstruct the watermark information, thereby ver",
    "link": "http://arxiv.org/abs/2308.04673",
    "context": "Title: SSL-Auth: An Authentication Framework by Fragile Watermarking for Pre-trained Encoders in Self-supervised Learning. (arXiv:2308.04673v1 [cs.CR])\nAbstract: Self-supervised learning (SSL) which leverages unlabeled datasets for pre-training powerful encoders has achieved significant success in recent years. These encoders are commonly used as feature extractors for various downstream tasks, requiring substantial data and computing resources for their training process. With the deployment of pre-trained encoders in commercial use, protecting the intellectual property of model owners and ensuring the trustworthiness of the models becomes crucial. Recent research has shown that encoders are threatened by backdoor attacks, adversarial attacks, etc. Therefore, a scheme to verify the integrity of pre-trained encoders is needed to protect users. In this paper, we propose SSL-Auth, the first fragile watermarking scheme for verifying the integrity of encoders without compromising model performance. Our method utilizes selected key samples as watermark information and trains a verification network to reconstruct the watermark information, thereby ver",
    "path": "papers/23/08/2308.04673.json",
    "total_tokens": 888,
    "translated_title": "SSL-Auth:一种用于自监督学习中预训练的编码器的易碎水印身份验证框架",
    "translated_abstract": "自监督学习（SSL）利用无标签数据集为预训练的强大编码器取得了显著的成功。这些编码器常被用作各种下游任务的特征提取器，其训练过程需要大量的数据和计算资源。随着预训练编码器在商业应用中的部署，保护模型所有者的知识产权并确保模型的可信性变得至关重要。最近的研究表明，编码器受到后门攻击、对抗攻击等威胁。因此，需要一种验证预训练编码器完整性的方案来保护用户。在本文中，我们提出了SSL-Auth，这是一种无损害模型性能的易碎水印身份验证方案。我们的方法利用选择的关键样本作为水印信息，并训练一个验证网络来重构水印信息，从而进行验证。",
    "tldr": "本文提出了SSL-Auth，这是一种用于自监督学习中预训练的编码器的易碎水印身份验证框架。该方法利用选择的关键样本作为水印信息，并训练一个验证网络来重构水印信息，从而进行验证。"
}