{
    "title": "QKSAN: A Quantum Kernel Self-Attention Network. (arXiv:2308.13422v1 [quant-ph])",
    "abstract": "Self-Attention Mechanism (SAM) is skilled at extracting important information from the interior of data to improve the computational efficiency of models. Nevertheless, many Quantum Machine Learning (QML) models lack the ability to distinguish the intrinsic connections of information like SAM, which limits their effectiveness on massive high-dimensional quantum data. To address this issue, a Quantum Kernel Self-Attention Mechanism (QKSAM) is introduced, which combines the data representation benefit of Quantum Kernel Methods (QKM) with the efficient information extraction capability of SAM. A Quantum Kernel Self-Attention Network (QKSAN) framework is built based on QKSAM, with Deferred Measurement Principle (DMP) and conditional measurement techniques, which releases half of the quantum resources with probabilistic measurements during computation. The Quantum Kernel Self-Attention Score (QKSAS) determines the measurement conditions and reflects the probabilistic nature of quantum syste",
    "link": "http://arxiv.org/abs/2308.13422",
    "context": "Title: QKSAN: A Quantum Kernel Self-Attention Network. (arXiv:2308.13422v1 [quant-ph])\nAbstract: Self-Attention Mechanism (SAM) is skilled at extracting important information from the interior of data to improve the computational efficiency of models. Nevertheless, many Quantum Machine Learning (QML) models lack the ability to distinguish the intrinsic connections of information like SAM, which limits their effectiveness on massive high-dimensional quantum data. To address this issue, a Quantum Kernel Self-Attention Mechanism (QKSAM) is introduced, which combines the data representation benefit of Quantum Kernel Methods (QKM) with the efficient information extraction capability of SAM. A Quantum Kernel Self-Attention Network (QKSAN) framework is built based on QKSAM, with Deferred Measurement Principle (DMP) and conditional measurement techniques, which releases half of the quantum resources with probabilistic measurements during computation. The Quantum Kernel Self-Attention Score (QKSAS) determines the measurement conditions and reflects the probabilistic nature of quantum syste",
    "path": "papers/23/08/2308.13422.json",
    "total_tokens": 800,
    "translated_title": "QKSAN: 量子核自注意力网络",
    "translated_abstract": "自注意力机制（SAM）擅长从数据内部提取重要信息，以提高模型的计算效率。然而，许多量子机器学习（QML）模型缺乏像SAM这样区分信息的固有连接的能力，这限制了它们在大规模高维量子数据上的有效性。为了解决这个问题，引入了量子核自注意力机制（QKSAM），它将量子核方法（QKM）的数据表示优势与SAM的有效信息提取能力相结合。基于QKSAM构建了一个量子核自注意力网络（QKSAN）框架，利用延迟测量原理（DMP）和条件测量技术，在计算过程中以概率测量的方式释放了一半的量子资源。量子核自注意力分数（QKSAS）确定测量条件并反映了量子系统的概率本质。",
    "tldr": "QKSAN是一个量子核自注意力网络，通过结合量子核方法和自注意力机制，提高了量子机器学习模型在大规模高维量子数据上的有效性。"
}