{
    "title": "MultiEM: Efficient and Effective Unsupervised Multi-Table Entity Matching. (arXiv:2308.01927v1 [cs.DB])",
    "abstract": "Entity Matching (EM), which aims to identify all entity pairs referring to the same real-world entity from relational tables, is one of the most important tasks in real-world data management systems. Due to the labeling process of EM being extremely labor-intensive, unsupervised EM is more applicable than supervised EM in practical scenarios. Traditional unsupervised EM assumes that all entities come from two tables; however, it is more common to match entities from multiple tables in practical applications, that is, multi-table entity matching (multi-table EM). Unfortunately, effective and efficient unsupervised multi-table EM remains under-explored. To fill this gap, this paper formally studies the problem of unsupervised multi-table entity matching and proposes an effective and efficient solution, termed as MultiEM. MultiEM is a parallelable pipeline of enhanced entity representation, table-wise hierarchical merging, and density-based pruning. Extensive experimental results on six r",
    "link": "http://arxiv.org/abs/2308.01927",
    "context": "Title: MultiEM: Efficient and Effective Unsupervised Multi-Table Entity Matching. (arXiv:2308.01927v1 [cs.DB])\nAbstract: Entity Matching (EM), which aims to identify all entity pairs referring to the same real-world entity from relational tables, is one of the most important tasks in real-world data management systems. Due to the labeling process of EM being extremely labor-intensive, unsupervised EM is more applicable than supervised EM in practical scenarios. Traditional unsupervised EM assumes that all entities come from two tables; however, it is more common to match entities from multiple tables in practical applications, that is, multi-table entity matching (multi-table EM). Unfortunately, effective and efficient unsupervised multi-table EM remains under-explored. To fill this gap, this paper formally studies the problem of unsupervised multi-table entity matching and proposes an effective and efficient solution, termed as MultiEM. MultiEM is a parallelable pipeline of enhanced entity representation, table-wise hierarchical merging, and density-based pruning. Extensive experimental results on six r",
    "path": "papers/23/08/2308.01927.json",
    "total_tokens": 902,
    "translated_title": "MultiEM: 高效有效的无监督多表实体匹配",
    "translated_abstract": "实体匹配（EM）旨在从关系表中识别出指向同一现实世界实体的所有实体对，它是实际数据管理系统中最重要的任务之一。由于EM的标记过程非常费时费力，相较于监督式EM，无监督式EM在实际场景中更具适用性。传统的无监督式EM假设所有实体来自两个表，然而在实际应用中，多个表之间的实体匹配（多表EM）更为常见。然而，关于高效有效的无监督多表EM的研究尚未充分探索。为填补这一空白，本论文对无监督多表实体匹配问题进行了正式研究，并提出了一种高效有效的解决方案，称为MultiEM。MultiEM是一个可并行的流水线，包括增强的实体表示、基于表的层次合并和基于密度的剪枝。在六个实际数据集上进行了大量实验证明了MultiEM的有效性和效率。",
    "tldr": "本论文提出了一种称为MultiEM的高效有效无监督多表实体匹配解决方案，包括增强实体表示、表级层次合并和基于密度的剪枝，并通过大量实验证明了其有效性和效率。",
    "en_tdlr": "This paper proposes an efficient and effective unsupervised multi-table entity matching solution, called MultiEM, which includes enhanced entity representation, table-wise hierarchical merging, and density-based pruning, and demonstrates its effectiveness and efficiency through extensive experiments on six real-world datasets."
}