{
    "title": "Extreme Multilabel Classification for Specialist Doctor Recommendation with Implicit Feedback and Limited Patient Metadata. (arXiv:2308.11022v1 [cs.LG])",
    "abstract": "Recommendation Systems (RS) are often used to address the issue of medical doctor referrals. However, these systems require access to patient feedback and medical records, which may not always be available in real-world scenarios. Our research focuses on medical referrals and aims to predict recommendations in different specialties of physicians for both new patients and those with a consultation history. We use Extreme Multilabel Classification (XML), commonly employed in text-based classification tasks, to encode available features and explore different scenarios. While its potential for recommendation tasks has often been suggested, this has not been thoroughly explored in the literature. Motivated by the doctor referral case, we show how to recast a traditional recommender setting into a multilabel classification problem that current XML methods can solve. Further, we propose a unified model leveraging patient history across different specialties. Compared to state-of-the-art RS us",
    "link": "http://arxiv.org/abs/2308.11022",
    "context": "Title: Extreme Multilabel Classification for Specialist Doctor Recommendation with Implicit Feedback and Limited Patient Metadata. (arXiv:2308.11022v1 [cs.LG])\nAbstract: Recommendation Systems (RS) are often used to address the issue of medical doctor referrals. However, these systems require access to patient feedback and medical records, which may not always be available in real-world scenarios. Our research focuses on medical referrals and aims to predict recommendations in different specialties of physicians for both new patients and those with a consultation history. We use Extreme Multilabel Classification (XML), commonly employed in text-based classification tasks, to encode available features and explore different scenarios. While its potential for recommendation tasks has often been suggested, this has not been thoroughly explored in the literature. Motivated by the doctor referral case, we show how to recast a traditional recommender setting into a multilabel classification problem that current XML methods can solve. Further, we propose a unified model leveraging patient history across different specialties. Compared to state-of-the-art RS us",
    "path": "papers/23/08/2308.11022.json",
    "total_tokens": 871,
    "translated_title": "基于隐式反馈和有限患者元数据的专科医生推荐的极限多标签分类",
    "translated_abstract": "推荐系统通常用于解决医生推荐的问题。然而，在现实场景中，患者反馈和医疗记录可能并不总是可用的。我们的研究聚焦于医生推荐并旨在预测新患者和有过咨询历史的患者在不同专科医生中的推荐。我们使用了常用于文本分类任务的极限多标签分类（XML）方法来编码可用的特征并探索不同的情景。虽然它在推荐任务中的潜力经常被提及，但在文献中并没有得到深入研究。受到医生推荐案例的启发，我们展示了如何将传统的推荐设置转化为当前XML方法可解决的多标签分类问题。此外，我们提出了一个统一模型，利用不同专科医生的患者历史。与现有最先进的推荐系统相比，我们的模型考虑了更多的因素，有更好的性能。",
    "tldr": "本论文研究了基于隐式反馈和有限患者元数据的专科医生推荐的极限多标签分类问题。通过将传统的推荐设置转换为多标签分类问题，我们提出了一个统一模型，利用患者历史来实现更好的推荐性能。"
}