{
    "title": "Controlling Character Motions without Observable Driving Source. (arXiv:2308.06025v1 [cs.AI])",
    "abstract": "How to generate diverse, life-like, and unlimited long head/body sequences without any driving source? We argue that this under-investigated research problem is non-trivial at all, and has unique technical challenges behind it. Without semantic constraints from the driving sources, using the standard autoregressive model to generate infinitely long sequences would easily result in 1) out-of-distribution (OOD) issue due to the accumulated error, 2) insufficient diversity to produce natural and life-like motion sequences and 3) undesired periodic patterns along the time. To tackle the above challenges, we propose a systematic framework that marries the benefits of VQ-VAE and a novel token-level control policy trained with reinforcement learning using carefully designed reward functions. A high-level prior model can be easily injected on top to generate unlimited long and diverse sequences. Although we focus on no driving sources now, our framework can be generalized for controlled synthe",
    "link": "http://arxiv.org/abs/2308.06025",
    "context": "Title: Controlling Character Motions without Observable Driving Source. (arXiv:2308.06025v1 [cs.AI])\nAbstract: How to generate diverse, life-like, and unlimited long head/body sequences without any driving source? We argue that this under-investigated research problem is non-trivial at all, and has unique technical challenges behind it. Without semantic constraints from the driving sources, using the standard autoregressive model to generate infinitely long sequences would easily result in 1) out-of-distribution (OOD) issue due to the accumulated error, 2) insufficient diversity to produce natural and life-like motion sequences and 3) undesired periodic patterns along the time. To tackle the above challenges, we propose a systematic framework that marries the benefits of VQ-VAE and a novel token-level control policy trained with reinforcement learning using carefully designed reward functions. A high-level prior model can be easily injected on top to generate unlimited long and diverse sequences. Although we focus on no driving sources now, our framework can be generalized for controlled synthe",
    "path": "papers/23/08/2308.06025.json",
    "total_tokens": 927,
    "translated_title": "不可观测的驱动源下控制角色动作的方法",
    "translated_abstract": "如何在没有任何驱动源的情况下生成多样化、逼真且无限长的头部/身体序列？我们认为这个未经充分探究的研究问题并不是一件轻松的事，并且存在着独特的技术挑战。在没有来自驱动源的语义约束的情况下，使用标准的自回归模型生成无限长序列很容易导致以下问题：1）由于累积误差产生了超出分布（OOD）问题；2）生成的运动序列缺乏多样性，无法产生逼真和生动的动作序列；3）时间上出现了不期望的周期性模式。为了解决上述挑战，我们提出了一个系统框架，将VQ-VAE的优点与使用经过精心设计的奖励函数训练的一种新型基于令牌级控制策略相结合，通过在顶部注入高级先验模型来生成无限长且多样化的序列。尽管我们现在关注于没有驱动源，但我们的框架可以推广到受控合成场景。",
    "tldr": "本文提出了一个系统框架，结合了VQ-VAE和使用强化学习训练的一种新型基于令牌级控制策略，通过在顶部注入高级先验模型来生成无限长且多样化的序列。",
    "en_tdlr": "This paper proposes a systematic framework that combines VQ-VAE and a novel token-level control policy trained with reinforcement learning to generate unlimited long and diverse sequences by injecting a high-level prior model on top."
}