{
    "title": "HarvestNet: A Dataset for Detecting Smallholder Farming Activity Using Harvest Piles and Remote Sensing. (arXiv:2308.12061v1 [cs.CV])",
    "abstract": "Small farms contribute to a large share of the productive land in developing countries. In regions such as sub-Saharan Africa, where 80% of farms are small (under 2 ha in size), the task of mapping smallholder cropland is an important part of tracking sustainability measures such as crop productivity. However, the visually diverse and nuanced appearance of small farms has limited the effectiveness of traditional approaches to cropland mapping. Here we introduce a new approach based on the detection of harvest piles characteristic of many smallholder systems throughout the world. We present HarvestNet, a dataset for mapping the presence of farms in the Ethiopian regions of Tigray and Amhara during 2020-2023, collected using expert knowledge and satellite images, totaling 7k hand-labeled images and 2k ground collected labels. We also benchmark a set of baselines including SOTA models in remote sensing with our best models having around 80% classification performance on hand labelled data",
    "link": "http://arxiv.org/abs/2308.12061",
    "context": "Title: HarvestNet: A Dataset for Detecting Smallholder Farming Activity Using Harvest Piles and Remote Sensing. (arXiv:2308.12061v1 [cs.CV])\nAbstract: Small farms contribute to a large share of the productive land in developing countries. In regions such as sub-Saharan Africa, where 80% of farms are small (under 2 ha in size), the task of mapping smallholder cropland is an important part of tracking sustainability measures such as crop productivity. However, the visually diverse and nuanced appearance of small farms has limited the effectiveness of traditional approaches to cropland mapping. Here we introduce a new approach based on the detection of harvest piles characteristic of many smallholder systems throughout the world. We present HarvestNet, a dataset for mapping the presence of farms in the Ethiopian regions of Tigray and Amhara during 2020-2023, collected using expert knowledge and satellite images, totaling 7k hand-labeled images and 2k ground collected labels. We also benchmark a set of baselines including SOTA models in remote sensing with our best models having around 80% classification performance on hand labelled data",
    "path": "papers/23/08/2308.12061.json",
    "total_tokens": 1028,
    "translated_title": "HarvestNet：利用收获堆和遥感技术检测小农户农业活动的数据集",
    "translated_abstract": "小型农场在发展中国家的生产土地中所占比例很大。在撒哈拉以南非洲等地区，80%的农场都很小（面积小于2公顷），映射小农户的农田是追踪作物生产力等可持续发展措施的重要组成部分。然而，小农场的外观多样且微妙，传统的农田映射方法的效果受到限制。在这里，我们引入了一个基于检测遍布全球许多小农户系统的收获堆的新方法。我们提供了HarvestNet数据集，用于在埃塞俄比亚的提格雷和阿姆哈拉地区的2020-2023年间映射农田的存在，该数据集利用专家知识和卫星图像收集，共有7k个手动标记的图像和2k个地面收集标签。我们还针对现有技术在遥感领域进行了基准测试，我们的最佳模型在手动标记数据上具有约80%的分类性能。",
    "tldr": "该论文介绍了一种新的方法，通过检测全球小农户系统中常见的收获堆来映射农田的存在。作者提供了HarvestNet数据集，该数据集由专家知识和卫星图像收集而来，可用于在埃塞俄比亚的特定地区进行农田映射。实验结果表明，作者的最佳模型在手动标记数据上具有约80%的分类性能。",
    "en_tdlr": "This paper introduces a new method for mapping the presence of farms by detecting harvest piles common in smallholder systems worldwide. The authors provide the HarvestNet dataset, collected using expert knowledge and satellite images, for mapping cropland in specific regions of Ethiopia. Experimental results show that their best models achieve around 80% classification performance on hand-labeled data."
}