{
    "title": "How to choose a Compatible Committee?. (arXiv:2308.03507v1 [econ.TH])",
    "abstract": "Electing a committee of size k from m alternatives (k < m) is an interesting problem under the multi-winner voting rules. However, very few committee selection rules found in the literature consider the coalitional possibilities among the alternatives that the voters believe that certain coalitions are more effective and can more efficiently deliver desired outputs. To include such possibilities, in this present study, we consider a committee selection problem (or multi-winner voting problem) where voters are able to express their opinion regarding interdependencies among alternatives. Using a dichotomous preference scale termed generalized approval evaluation we construct an $m$-person coalitional game which is more commonly called a cooperative game with transferable utilities. To identify each alternative's score we use the Shapley value (Shapley, 1953) of the cooperative game we construct for the purpose. Our approach to the committee selection problem emphasizes on an important is",
    "link": "http://arxiv.org/abs/2308.03507",
    "context": "Title: How to choose a Compatible Committee?. (arXiv:2308.03507v1 [econ.TH])\nAbstract: Electing a committee of size k from m alternatives (k < m) is an interesting problem under the multi-winner voting rules. However, very few committee selection rules found in the literature consider the coalitional possibilities among the alternatives that the voters believe that certain coalitions are more effective and can more efficiently deliver desired outputs. To include such possibilities, in this present study, we consider a committee selection problem (or multi-winner voting problem) where voters are able to express their opinion regarding interdependencies among alternatives. Using a dichotomous preference scale termed generalized approval evaluation we construct an $m$-person coalitional game which is more commonly called a cooperative game with transferable utilities. To identify each alternative's score we use the Shapley value (Shapley, 1953) of the cooperative game we construct for the purpose. Our approach to the committee selection problem emphasizes on an important is",
    "path": "papers/23/08/2308.03507.json",
    "total_tokens": 912,
    "translated_title": "如何选择一个合适的委员会？",
    "translated_abstract": "从m个备选项中选择一个大小为k的委员会（k < m）是多胜者投票规则下的一项有趣的问题。然而，在文献中找到的很少有委员会选择规则考虑选民们相信某些联盟更加有效并能更高效地提供所需结果的联盟可能性。为了包括这样的可能性，在本研究中，我们考虑了一个委员会选择问题（或多胜者投票问题），选民可以表达他们对备选项之间相互依赖的意见。我们利用一个称为广义赞同评估的二分偏好尺度构建了一个m人联盟博弈，更常被称为带有可转移效用的合作博弈。为了确定每个备选项的得分，我们使用了我们构建的合作博弈的谢普利值（Shapley, 1953）。我们对委员会选择问题的方法强调了一个重要的是...",
    "tldr": "该论文研究了如何在多胜者投票规则下选择委员会，并考虑了选民对备选项之间相互依赖关系的意见表达。通过构建一个可转移效用的合作博弈，利用谢普利值来确定每个备选项的得分。研究结果对于委员会选择问题具有重要意义。",
    "en_tdlr": "This paper examines how to select a committee under multi-winner voting rules, taking into account the opinions of voters regarding interdependencies among alternatives. By constructing a cooperative game with transferable utilities and using the Shapley value, the paper identifies the score for each alternative. The findings have important implications for the committee selection problem."
}