{
    "title": "DTF-Net: Category-Level Pose Estimation and Shape Reconstruction via Deformable Template Field. (arXiv:2308.02239v1 [cs.CV])",
    "abstract": "Estimating 6D poses and reconstructing 3D shapes of objects in open-world scenes from RGB-depth image pairs is challenging. Many existing methods rely on learning geometric features that correspond to specific templates while disregarding shape variations and pose differences among objects in the same category. As a result, these methods underperform when handling unseen object instances in complex environments. In contrast, other approaches aim to achieve category-level estimation and reconstruction by leveraging normalized geometric structure priors, but the static prior-based reconstruction struggles with substantial intra-class variations. To solve these problems, we propose the DTF-Net, a novel framework for pose estimation and shape reconstruction based on implicit neural fields of object categories. In DTF-Net, we design a deformable template field to represent the general category-wise shape latent features and intra-category geometric deformation features. The field establishe",
    "link": "http://arxiv.org/abs/2308.02239",
    "context": "Title: DTF-Net: Category-Level Pose Estimation and Shape Reconstruction via Deformable Template Field. (arXiv:2308.02239v1 [cs.CV])\nAbstract: Estimating 6D poses and reconstructing 3D shapes of objects in open-world scenes from RGB-depth image pairs is challenging. Many existing methods rely on learning geometric features that correspond to specific templates while disregarding shape variations and pose differences among objects in the same category. As a result, these methods underperform when handling unseen object instances in complex environments. In contrast, other approaches aim to achieve category-level estimation and reconstruction by leveraging normalized geometric structure priors, but the static prior-based reconstruction struggles with substantial intra-class variations. To solve these problems, we propose the DTF-Net, a novel framework for pose estimation and shape reconstruction based on implicit neural fields of object categories. In DTF-Net, we design a deformable template field to represent the general category-wise shape latent features and intra-category geometric deformation features. The field establishe",
    "path": "papers/23/08/2308.02239.json",
    "total_tokens": 870,
    "translated_title": "DTF-Net: 基于可变形模板场的物体类别级姿态估计和形状重建",
    "translated_abstract": "在RGB-深度图像对中估计物体的六维姿态和重建三维形状是具有挑战性的。许多现有方法依赖于学习与特定模板对应的几何特征，而忽视了同一类别中物体的形状变化和姿态差异。因此，这些方法在处理复杂环境中的未见过的物体实例时性能不佳。相反，其他方法通过利用归一化的几何结构先验来实现类别级估计和重建，但基于静态先验的重建在类内变化大的情况下面临困难。为解决这些问题，我们提出了DTF-Net，一种基于物体类别的隐式神经场的姿态估计和形状重建新框架。在DTF-Net中，我们设计了一个可变形模板场，用于表示通用的类别形状潜在特征和类内几何变形特征。",
    "tldr": "DTF-Net是一种基于隐式神经场的姿态估计和形状重建框架，通过设计可变形模板场来捕捉物体类别的形状特征和几何变形特征。",
    "en_tdlr": "DTF-Net is a framework for pose estimation and shape reconstruction based on implicit neural fields, which uses a deformable template field to capture shape features and geometric deformation features of object categories."
}