{
    "title": "Artificial Intelligence for Molecular Communication. (arXiv:2308.02812v1 [cs.ET])",
    "abstract": "Molecular communication is a novel approach for data transmission between miniaturized devices, especially in contexts where electrical signals are to be avoided. The communication is based on sending molecules (or other particles) at nano scale through channel instead sending electrons over a wire. Molecular communication devices have a large potential in medical applications as they offer an alternative to antenna-based transmission systems that may not be applicable due to size, temperature, or radiation constraints. The communication is achieved by transforming a digital signal into concentrations of molecules. These molecules are then detected at the other end of the communication channel and transformed back into a digital signal. Accurately modeling the transmission channel is often not possible which may be due to a lack of data or time-varying parameters of the channel (e. g., the movements of a person wearing a medical device). This makes demodulation of the signal very diffi",
    "link": "http://arxiv.org/abs/2308.02812",
    "context": "Title: Artificial Intelligence for Molecular Communication. (arXiv:2308.02812v1 [cs.ET])\nAbstract: Molecular communication is a novel approach for data transmission between miniaturized devices, especially in contexts where electrical signals are to be avoided. The communication is based on sending molecules (or other particles) at nano scale through channel instead sending electrons over a wire. Molecular communication devices have a large potential in medical applications as they offer an alternative to antenna-based transmission systems that may not be applicable due to size, temperature, or radiation constraints. The communication is achieved by transforming a digital signal into concentrations of molecules. These molecules are then detected at the other end of the communication channel and transformed back into a digital signal. Accurately modeling the transmission channel is often not possible which may be due to a lack of data or time-varying parameters of the channel (e. g., the movements of a person wearing a medical device). This makes demodulation of the signal very diffi",
    "path": "papers/23/08/2308.02812.json",
    "total_tokens": 857,
    "translated_title": "分子通信的人工智能技术",
    "translated_abstract": "分子通信是一种在微型设备之间进行数据传输的新方法，特别适用于需要避免电信号的情况。这种通信是通过在纳米级别上发送分子（或其他粒子）而不是通过电线发送电子来实现的。分子通信设备在医学应用中具有巨大的潜力，因为它们为尺寸、温度或辐射约束下可能不适用的天线传输系统提供了替代方案。通信通过将数字信号转化为分子浓度来实现。然后在通信信道的另一端检测到这些分子，并将其转化回数字信号。由于传输信道的精确建模通常是不可能的，这可能是由于缺乏数据或信道的时变参数（例如，佩戴医疗设备的人员的运动）所致。这使得信号的解调非常困难。",
    "tldr": "人工智能用于分子通信，这是一种在微型设备之间进行数据传输的新方法，具有广阔的医学应用潜力。分子通信通过转化数字信号为分子浓度来进行，解调信号时面临着精确建模困难的挑战。",
    "en_tdlr": "Artificial intelligence is utilized in molecular communication, a novel approach for data transmission between miniaturized devices, with vast potential in medical applications. Molecular communication involves converting digital signals into concentrations of molecules, but faces challenges in accurately modeling the transmission channel for signal demodulation."
}