{
    "title": "Enhancing Bloodstain Analysis Through AI-Based Segmentation: Leveraging Segment Anything Model for Crime Scene Investigation. (arXiv:2308.13979v1 [cs.CV])",
    "abstract": "Bloodstain pattern analysis plays a crucial role in crime scene investigations by providing valuable information through the study of unique blood patterns. Conventional image analysis methods, like Thresholding and Contrast, impose stringent requirements on the image background and is labor-intensive in the context of droplet image segmentation. The Segment Anything Model (SAM), a recently proposed method for extensive image recognition, is yet to be adequately assessed for its accuracy and efficiency on bloodstain image segmentation. This paper explores the application of pre-trained SAM and fine-tuned SAM on bloodstain image segmentation with diverse image backgrounds. Experiment results indicate that both pre-trained and fine-tuned SAM perform the bloodstain image segmentation task with satisfactory accuracy and efficiency, while fine-tuned SAM achieves an overall 2.2\\% accuracy improvement than pre-trained SAM and 4.70\\% acceleration in terms of speed for image recognition. Analys",
    "link": "http://arxiv.org/abs/2308.13979",
    "context": "Title: Enhancing Bloodstain Analysis Through AI-Based Segmentation: Leveraging Segment Anything Model for Crime Scene Investigation. (arXiv:2308.13979v1 [cs.CV])\nAbstract: Bloodstain pattern analysis plays a crucial role in crime scene investigations by providing valuable information through the study of unique blood patterns. Conventional image analysis methods, like Thresholding and Contrast, impose stringent requirements on the image background and is labor-intensive in the context of droplet image segmentation. The Segment Anything Model (SAM), a recently proposed method for extensive image recognition, is yet to be adequately assessed for its accuracy and efficiency on bloodstain image segmentation. This paper explores the application of pre-trained SAM and fine-tuned SAM on bloodstain image segmentation with diverse image backgrounds. Experiment results indicate that both pre-trained and fine-tuned SAM perform the bloodstain image segmentation task with satisfactory accuracy and efficiency, while fine-tuned SAM achieves an overall 2.2\\% accuracy improvement than pre-trained SAM and 4.70\\% acceleration in terms of speed for image recognition. Analys",
    "path": "papers/23/08/2308.13979.json",
    "total_tokens": 928,
    "translated_title": "通过基于AI的分割增强血迹分析：利用Segment Anything Model进行现场调查",
    "translated_abstract": "血迹模式分析通过研究独特的血迹模式为现场调查提供了有价值的信息。传统的图像分析方法对图像背景有严格要求，对于液滴图像分割来说工作量也很大。Segment Anything Model（SAM）是一种近期提出的广泛图像识别方法，尚未充分评估其在血迹图像分割上的准确性和效率。本文探讨了预训练的SAM和微调的SAM在具有不同图像背景的血迹图像分割中的应用。实验结果表明，预训练的SAM和微调的SAM都能够以令人满意的准确性和效率执行血迹图像分割任务，而微调的SAM相对于预训练的SAM在准确性上提升了2.2％，在图像识别速度方面加快了4.70％。",
    "tldr": "本文通过应用预训练的Segment Anything Model和微调的Segment Anything Model在各种图像背景下的血迹图像分割中，证明了其准确性和效率的满意度，微调的模型比预训练模型准确性提升了2.2％，在图像识别速度方面加快了4.70％。",
    "en_tdlr": "This paper demonstrates the satisfactory accuracy and efficiency of both pre-trained and fine-tuned Segment Anything Models in bloodstain image segmentation with diverse image backgrounds. The fine-tuned model achieves a 2.2% improvement in accuracy and 4.70% acceleration in image recognition speed compared to the pre-trained model."
}