{
    "title": "A Preliminary Investigation into Search and Matching for Tumour Discrimination in WHO Breast Taxonomy Using Deep Networks. (arXiv:2308.11162v1 [eess.IV])",
    "abstract": "Breast cancer is one of the most common cancers affecting women worldwide. They include a group of malignant neoplasms with a variety of biological, clinical, and histopathological characteristics. There are more than 35 different histological forms of breast lesions that can be classified and diagnosed histologically according to cell morphology, growth, and architecture patterns. Recently, deep learning, in the field of artificial intelligence, has drawn a lot of attention for the computerized representation of medical images. Searchable digital atlases can provide pathologists with patch matching tools allowing them to search among evidently diagnosed and treated archival cases, a technology that may be regarded as computational second opinion. In this study, we indexed and analyzed the WHO breast taxonomy (Classification of Tumours 5th Ed.) spanning 35 tumour types. We visualized all tumour types using deep features extracted from a state-of-the-art deep learning model, pre-trained",
    "link": "http://arxiv.org/abs/2308.11162",
    "context": "Title: A Preliminary Investigation into Search and Matching for Tumour Discrimination in WHO Breast Taxonomy Using Deep Networks. (arXiv:2308.11162v1 [eess.IV])\nAbstract: Breast cancer is one of the most common cancers affecting women worldwide. They include a group of malignant neoplasms with a variety of biological, clinical, and histopathological characteristics. There are more than 35 different histological forms of breast lesions that can be classified and diagnosed histologically according to cell morphology, growth, and architecture patterns. Recently, deep learning, in the field of artificial intelligence, has drawn a lot of attention for the computerized representation of medical images. Searchable digital atlases can provide pathologists with patch matching tools allowing them to search among evidently diagnosed and treated archival cases, a technology that may be regarded as computational second opinion. In this study, we indexed and analyzed the WHO breast taxonomy (Classification of Tumours 5th Ed.) spanning 35 tumour types. We visualized all tumour types using deep features extracted from a state-of-the-art deep learning model, pre-trained",
    "path": "papers/23/08/2308.11162.json",
    "total_tokens": 933,
    "translated_title": "对使用深度网络在WHO乳腺分类中进行肿瘤区分的搜索和匹配的初步研究",
    "translated_abstract": "乳腺癌是影响全球女性最常见的癌症之一。它们包括一组具有各种生物学、临床和组织病理学特征的恶性新生物。有35多种不同的乳腺病变的组织学形式可根据细胞形态学、生长和组织构架模式进行组织学分类和诊断。近年来，在人工智能领域，深度学习对医学图像的计算表示引起了很多关注。可搜索的数字图谱可以提供给病理学家可以搜索明确诊断和治疗的档案案例的补丁匹配工具，这项技术可以被视为计算机的第二意见。在本研究中，我们对包括35种肿瘤类型的WHO乳腺分类进行了索引和分析。我们使用先进的深度学习模型提取的深度特征可视化了所有肿瘤类型。",
    "tldr": "该研究初步探索了使用深度网络在WHO乳腺分类中进行肿瘤区分的搜索和匹配方法。研究采用了深度学习模型提取的深度特征对35种肿瘤类型在数字图谱中进行了可视化分析。",
    "en_tdlr": "This preliminary study investigates search and matching methods for breast tumor discrimination in WHO breast taxonomy using deep networks. The study visualizes and indexes 35 tumor types using deep features extracted from a state-of-the-art deep learning model."
}