{
    "title": "Depth analysis of battery performance based on a data-driven approach. (arXiv:2308.15833v1 [cs.AI])",
    "abstract": "Capacity attenuation is one of the most intractable issues in the current of application of the cells. The disintegration mechanism is well known to be very complex across the system. It is a great challenge to fully comprehend this process and predict the process accurately. Thus, the machine learning (ML) technology is employed to predict the specific capacity change of the cell throughout the cycle and grasp this intricate procedure. Different from the previous work, according to the WOA-ELM model proposed in this work (R2 = 0.9999871), the key factors affecting the specific capacity of the battery are determined, and the defects in the machine learning black box are overcome by the interpretable model. Their connection with the structural damage of electrode materials and battery failure during battery cycling is comprehensively explained, revealing their essentiality to battery performance, which is conducive to superior research on contemporary batteries and modification.",
    "link": "http://arxiv.org/abs/2308.15833",
    "context": "Title: Depth analysis of battery performance based on a data-driven approach. (arXiv:2308.15833v1 [cs.AI])\nAbstract: Capacity attenuation is one of the most intractable issues in the current of application of the cells. The disintegration mechanism is well known to be very complex across the system. It is a great challenge to fully comprehend this process and predict the process accurately. Thus, the machine learning (ML) technology is employed to predict the specific capacity change of the cell throughout the cycle and grasp this intricate procedure. Different from the previous work, according to the WOA-ELM model proposed in this work (R2 = 0.9999871), the key factors affecting the specific capacity of the battery are determined, and the defects in the machine learning black box are overcome by the interpretable model. Their connection with the structural damage of electrode materials and battery failure during battery cycling is comprehensively explained, revealing their essentiality to battery performance, which is conducive to superior research on contemporary batteries and modification.",
    "path": "papers/23/08/2308.15833.json",
    "total_tokens": 958,
    "translated_title": "基于数据驱动方法的电池性能深入分析",
    "translated_abstract": "容量衰减是当前电池应用中最棘手的问题之一。在整个系统中，电池的分解机制被认为非常复杂。充分理解这个过程并准确预测它是一个巨大的挑战。因此，本研究采用了机器学习技术来预测电池在循环过程中的特定容量变化，并了解这个复杂的过程。与之前的工作不同的是，根据本研究提出的WOA-ELM模型（R2 = 0.9999871），确定了影响电池特定容量的关键因素，并通过可解释的模型克服了机器学习黑盒的缺陷。它们与电极材料的结构损伤和电池在循环过程中的故障之间的联系得到了全面解释，揭示了它们对于电池性能的重要性，有利于对当代电池进行优秀的研究和改进。",
    "tldr": "本论文利用机器学习技术研究了电池容量衰减问题，提出了WOA-ELM模型来解析电池性能关键因素，并克服了机器学习黑盒的缺陷。研究结果揭示了电极材料的结构损伤与电池故障之间的联系，对于电池研究和改进具有重要意义。"
}