{
    "title": "Multi-Class Deep SVDD: Anomaly Detection Approach in Astronomy with Distinct Inlier Categories. (arXiv:2308.05011v1 [cs.LG])",
    "abstract": "With the increasing volume of astronomical data generated by modern survey telescopes, automated pipelines and machine learning techniques have become crucial for analyzing and extracting knowledge from these datasets. Anomaly detection, i.e. the task of identifying irregular or unexpected patterns in the data, is a complex challenge in astronomy. In this paper, we propose Multi-Class Deep Support Vector Data Description (MCDSVDD), an extension of the state-of-the-art anomaly detection algorithm One-Class Deep SVDD, specifically designed to handle different inlier categories with distinct data distributions. MCDSVDD uses a neural network to map the data into hyperspheres, where each hypersphere represents a specific inlier category. The distance of each sample from the centers of these hyperspheres determines the anomaly score. We evaluate the effectiveness of MCDSVDD by comparing its performance with several anomaly detection algorithms on a large dataset of astronomical light-curves ",
    "link": "http://arxiv.org/abs/2308.05011",
    "context": "Title: Multi-Class Deep SVDD: Anomaly Detection Approach in Astronomy with Distinct Inlier Categories. (arXiv:2308.05011v1 [cs.LG])\nAbstract: With the increasing volume of astronomical data generated by modern survey telescopes, automated pipelines and machine learning techniques have become crucial for analyzing and extracting knowledge from these datasets. Anomaly detection, i.e. the task of identifying irregular or unexpected patterns in the data, is a complex challenge in astronomy. In this paper, we propose Multi-Class Deep Support Vector Data Description (MCDSVDD), an extension of the state-of-the-art anomaly detection algorithm One-Class Deep SVDD, specifically designed to handle different inlier categories with distinct data distributions. MCDSVDD uses a neural network to map the data into hyperspheres, where each hypersphere represents a specific inlier category. The distance of each sample from the centers of these hyperspheres determines the anomaly score. We evaluate the effectiveness of MCDSVDD by comparing its performance with several anomaly detection algorithms on a large dataset of astronomical light-curves ",
    "path": "papers/23/08/2308.05011.json",
    "total_tokens": 955,
    "translated_title": "多类深度支持向量数据描述：一种用于天文学中具有不同内部类别的异常检测方法",
    "translated_abstract": "随着现代勘测望远镜产生的天文数据量不断增加，自动化流程和机器学习技术已成为对这些数据进行分析和提取知识的关键。异常检测，在数据中识别不规则或意外模式的任务，是天文学中的一个复杂挑战。本文中，我们提出了多类深度支持向量数据描述(MCDSVDD)方法，它是一种对现有异常检测算法One-Class Deep SVDD进行扩展的方法，专门用于处理具有不同数据分布的不同内部类别。MCDSVDD使用神经网络将数据映射到超球体中，其中每个超球体代表一个特定的内部类别。样本距离这些超球体中心的距离决定了异常分数。我们通过将MCDSVDD的性能与多个异常检测算法在大规模天文光变曲线数据集上进行比较，评估了MCDSVDD的有效性。",
    "tldr": "提出了一种专门用于处理具有不同内部类别的天文学异常检测方法，采用多类深度支持向量数据描述(MCDSVDD)方法，通过使用神经网络将数据映射到超球体中，每个超球体代表一个特定的内部类别，并计算样本与超球体中心的距离以确定异常分数。",
    "en_tdlr": "A multi-class deep support vector data description (MCDSVDD) approach is proposed for anomaly detection in astronomy, specifically designed to handle different inlier categories with distinct data distributions. MCDSVDD uses a neural network to map the data into hyperspheres, where each hypersphere represents a specific inlier category, and the distance of each sample from the centers of these hyperspheres determines the anomaly score."
}