{
    "title": "Robust Bayesian Tensor Factorization with Zero-Inflated Poisson Model and Consensus Aggregation. (arXiv:2308.08060v1 [stat.ML])",
    "abstract": "Tensor factorizations (TF) are powerful tools for the efficient representation and analysis of multidimensional data. However, classic TF methods based on maximum likelihood estimation underperform when applied to zero-inflated count data, such as single-cell RNA sequencing (scRNA-seq) data. Additionally, the stochasticity inherent in TFs results in factors that vary across repeated runs, making interpretation and reproducibility of the results challenging. In this paper, we introduce Zero Inflated Poisson Tensor Factorization (ZIPTF), a novel approach for the factorization of high-dimensional count data with excess zeros. To address the challenge of stochasticity, we introduce Consensus Zero Inflated Poisson Tensor Factorization (C-ZIPTF), which combines ZIPTF with a consensus-based meta-analysis. We evaluate our proposed ZIPTF and C-ZIPTF on synthetic zero-inflated count data and synthetic and real scRNA-seq data. ZIPTF consistently outperforms baseline matrix and tensor factorizatio",
    "link": "http://arxiv.org/abs/2308.08060",
    "context": "Title: Robust Bayesian Tensor Factorization with Zero-Inflated Poisson Model and Consensus Aggregation. (arXiv:2308.08060v1 [stat.ML])\nAbstract: Tensor factorizations (TF) are powerful tools for the efficient representation and analysis of multidimensional data. However, classic TF methods based on maximum likelihood estimation underperform when applied to zero-inflated count data, such as single-cell RNA sequencing (scRNA-seq) data. Additionally, the stochasticity inherent in TFs results in factors that vary across repeated runs, making interpretation and reproducibility of the results challenging. In this paper, we introduce Zero Inflated Poisson Tensor Factorization (ZIPTF), a novel approach for the factorization of high-dimensional count data with excess zeros. To address the challenge of stochasticity, we introduce Consensus Zero Inflated Poisson Tensor Factorization (C-ZIPTF), which combines ZIPTF with a consensus-based meta-analysis. We evaluate our proposed ZIPTF and C-ZIPTF on synthetic zero-inflated count data and synthetic and real scRNA-seq data. ZIPTF consistently outperforms baseline matrix and tensor factorizatio",
    "path": "papers/23/08/2308.08060.json",
    "total_tokens": 1014,
    "translated_title": "鲁棒贝叶斯张量分解与零膨胀泊松模型和一致聚合",
    "translated_abstract": "张量分解是一种用于高效表示和分析多维数据的强大工具。然而，传统的基于最大似然估计的张量分解方法在应用于包含过多零值的计数数据（如单细胞RNA测序数据）时表现不佳。此外，张量分解的随机性导致因子在多次运行中变化，使得结果的解释和重现具有挑战性。本文提出了一种新颖的方法，称为零膨胀泊松张量分解（ZIPTF），用于分解具有过多零值的高维计数数据。为了解决随机性挑战，我们引入了一种称为一致零膨胀泊松张量分解（C-ZIPTF）的方法，将ZIPTF与基于一致性的元分析相结合。我们在合成的零膨胀计数数据和合成的真实单细胞RNA测序数据上评估了我们提出的ZIPTF和C-ZIPTF方法。结果显示，ZIPTF方法在性能上始终优于基线矩阵和张量分解方法。",
    "tldr": "本文提出了一种鲁棒的贝叶斯张量分解方法，使用零膨胀泊松模型来处理包含过多零值的高维计数数据。为了解决随机性问题，引入了一致聚合的方法。在合成和真实数据集上的实验证明了该方法的优越性能。",
    "en_tdlr": "This paper introduces a robust Bayesian tensor factorization method, using a zero-inflated Poisson model to handle high-dimensional count data with excess zeros. To address the challenge of stochasticity, a consensus aggregation method is introduced. Experiments on synthetic and real datasets demonstrate the superior performance of the proposed method."
}