{
    "title": "Robust vertebra identification using simultaneous node and edge predicting Graph Neural Networks. (arXiv:2308.02509v1 [eess.IV])",
    "abstract": "Automatic vertebra localization and identification in CT scans is important for numerous clinical applications. Much progress has been made on this topic, but it mostly targets positional localization of vertebrae, ignoring their orientation. Additionally, most methods employ heuristics in their pipeline that can be sensitive in real clinical images which tend to contain abnormalities. We introduce a simple pipeline that employs a standard prediction with a U-Net, followed by a single graph neural network to associate and classify vertebrae with full orientation. To test our method, we introduce a new vertebra dataset that also contains pedicle detections that are associated with vertebra bodies, creating a more challenging landmark prediction, association and classification task. Our method is able to accurately associate the correct body and pedicle landmarks, ignore false positives and classify vertebrae in a simple, fully trainable pipeline avoiding application-specific heuristics.",
    "link": "http://arxiv.org/abs/2308.02509",
    "context": "Title: Robust vertebra identification using simultaneous node and edge predicting Graph Neural Networks. (arXiv:2308.02509v1 [eess.IV])\nAbstract: Automatic vertebra localization and identification in CT scans is important for numerous clinical applications. Much progress has been made on this topic, but it mostly targets positional localization of vertebrae, ignoring their orientation. Additionally, most methods employ heuristics in their pipeline that can be sensitive in real clinical images which tend to contain abnormalities. We introduce a simple pipeline that employs a standard prediction with a U-Net, followed by a single graph neural network to associate and classify vertebrae with full orientation. To test our method, we introduce a new vertebra dataset that also contains pedicle detections that are associated with vertebra bodies, creating a more challenging landmark prediction, association and classification task. Our method is able to accurately associate the correct body and pedicle landmarks, ignore false positives and classify vertebrae in a simple, fully trainable pipeline avoiding application-specific heuristics.",
    "path": "papers/23/08/2308.02509.json",
    "total_tokens": 958,
    "translated_title": "使用同时节点和边预测的图神经网络进行骨椎骨骼识别的鲁棒性研究",
    "translated_abstract": "在CT扫描中自动定位和识别椎骨对于许多临床应用非常重要。在这个领域已取得了很多进展，但大部分方法主要针对椎骨的位置定位，忽略了其方向。此外，大多数方法在其流程中使用启发式规则，可能在真实的临床图像中对异常情况敏感。我们提出了一个简单的流程，它使用标准的U-Net进行预测，然后使用一个单一的图神经网络来关联和分类具有完整方向的椎骨。为了测试我们的方法，我们引入了一个新的椎骨数据集，该数据集还包含了与椎骨体相关联的椎弓根检测，从而创建了一个更具挑战性的地标预测、关联和分类任务。我们的方法能够准确地关联正确的椎骨体和椎弓根地标，忽略误报，并在一个简单的、完全可训练的流程中对椎骨进行分类，避免了特定应用的启发式规则。",
    "tldr": "本研究提出了一个使用图神经网络进行骨椎骨骼识别的方法，该方法能够准确地关联椎骨的位置和方向，避免了启发式规则，并通过引入一个包含椎弓根检测的新数据集进行验证。"
}