{
    "title": "Polar Collision Grids: Effective Interaction Modelling for Pedestrian Trajectory Prediction in Shared Space Using Collision Checks. (arXiv:2308.06654v1 [cs.RO])",
    "abstract": "Predicting pedestrians' trajectories is a crucial capability for autonomous vehicles' safe navigation, especially in spaces shared with pedestrians. Pedestrian motion in shared spaces is influenced by both the presence of vehicles and other pedestrians. Therefore, effectively modelling both pedestrian-pedestrian and pedestrian-vehicle interactions can increase the accuracy of the pedestrian trajectory prediction models. Despite the huge literature on ways to encode the effect of interacting agents on a pedestrian's predicted trajectory using deep-learning models, limited effort has been put into the effective selection of interacting agents. In the majority of cases, the interaction features used are mainly based on relative distances while paying less attention to the effect of the velocity and approaching direction in the interaction formulation. In this paper, we propose a heuristic-based process of selecting the interacting agents based on collision risk calculation. Focusing on in",
    "link": "http://arxiv.org/abs/2308.06654",
    "context": "Title: Polar Collision Grids: Effective Interaction Modelling for Pedestrian Trajectory Prediction in Shared Space Using Collision Checks. (arXiv:2308.06654v1 [cs.RO])\nAbstract: Predicting pedestrians' trajectories is a crucial capability for autonomous vehicles' safe navigation, especially in spaces shared with pedestrians. Pedestrian motion in shared spaces is influenced by both the presence of vehicles and other pedestrians. Therefore, effectively modelling both pedestrian-pedestrian and pedestrian-vehicle interactions can increase the accuracy of the pedestrian trajectory prediction models. Despite the huge literature on ways to encode the effect of interacting agents on a pedestrian's predicted trajectory using deep-learning models, limited effort has been put into the effective selection of interacting agents. In the majority of cases, the interaction features used are mainly based on relative distances while paying less attention to the effect of the velocity and approaching direction in the interaction formulation. In this paper, we propose a heuristic-based process of selecting the interacting agents based on collision risk calculation. Focusing on in",
    "path": "papers/23/08/2308.06654.json",
    "total_tokens": 825,
    "translated_title": "极化碰撞网络: 在共享空间中使用碰撞检测有效建模行人轨迹预测",
    "translated_abstract": "预测行人轨迹是自动驾驶车辆安全导航的关键能力，尤其是在与行人共享空间中。在共享空间中，行人的运动受到车辆和其他行人的影响。因此，有效地建模行人与行人以及行人与车辆之间的相互作用可以提高行人轨迹预测模型的准确性。尽管有关使用深度学习模型对相互作用体现在行人的预测轨迹中的大量文献，但在选择相互作用体时，很少有人对此进行了有效努力。在大多数情况下，所使用的相互作用特征主要基于相对距离，较少关注速度和接近方向对相互作用的影响。在本文中，我们提出了一种基于碰撞风险计算的启发式选择相互作用体的过程。",
    "tldr": "在共享空间中，通过使用碰撞风险计算来选择相互作用体，可以有效建模行人轨迹预测，提高准确性。",
    "en_tdlr": "Effectively modeling pedestrian trajectory prediction in shared space can be achieved by selecting interacting agents based on collision risk calculation, improving accuracy."
}