{
    "title": "InfeRE: Step-by-Step Regex Generation via Chain of Inference. (arXiv:2308.04041v1 [cs.AI])",
    "abstract": "Automatically generating regular expressions (abbrev. regexes) from natural language description (NL2RE) has been an emerging research area. Prior studies treat regex as a linear sequence of tokens and generate the final expressions autoregressively in a single pass. They did not take into account the step-by-step internal text-matching processes behind the final results. This significantly hinders the efficacy and interpretability of regex generation by neural language models. In this paper, we propose a new paradigm called InfeRE, which decomposes the generation of regexes into chains of step-by-step inference. To enhance the robustness, we introduce a self-consistency decoding mechanism that ensembles multiple outputs sampled from different models. We evaluate InfeRE on two publicly available datasets, NL-RX-Turk and KB13, and compare the results with state-of-the-art approaches and the popular tree-based generation approach TRANX. Experimental results show that InfeRE substantially",
    "link": "http://arxiv.org/abs/2308.04041",
    "context": "Title: InfeRE: Step-by-Step Regex Generation via Chain of Inference. (arXiv:2308.04041v1 [cs.AI])\nAbstract: Automatically generating regular expressions (abbrev. regexes) from natural language description (NL2RE) has been an emerging research area. Prior studies treat regex as a linear sequence of tokens and generate the final expressions autoregressively in a single pass. They did not take into account the step-by-step internal text-matching processes behind the final results. This significantly hinders the efficacy and interpretability of regex generation by neural language models. In this paper, we propose a new paradigm called InfeRE, which decomposes the generation of regexes into chains of step-by-step inference. To enhance the robustness, we introduce a self-consistency decoding mechanism that ensembles multiple outputs sampled from different models. We evaluate InfeRE on two publicly available datasets, NL-RX-Turk and KB13, and compare the results with state-of-the-art approaches and the popular tree-based generation approach TRANX. Experimental results show that InfeRE substantially",
    "path": "papers/23/08/2308.04041.json",
    "total_tokens": 969,
    "translated_title": "InfeRE：通过推理链逐步生成正则表达式",
    "translated_abstract": "自然语言描述（NL2RE）生成正则表达式（regexes）的自动化已经成为一个新兴的研究领域。以往的研究将正则表达式视为一个线性的令牌序列，并通过单次自回归生成最终的表达式。然而，他们没有考虑到生成最终结果背后逐步的内部文本匹配过程。这严重影响了神经语言模型生成正则表达式的效能和可解释性。在本文中，我们提出了一种新的范式，称为InfeRE，它将正则表达式的生成分解成一系列逐步推理的过程。为了增强鲁棒性，我们引入了一个自一致性解码机制，它将从不同的模型中采样得到的多个输出进行集成。我们在两个公开可用的数据集NL-RX-Turk和KB13上对InfeRE进行了评估，并将结果与最先进的方法和流行的基于树的生成方法TRANX进行了比较。实验结果表明，InfeRE显著提高了生成正则表达式的性能。",
    "tldr": "InfeRE是一种通过推理链逐步生成正则表达式的新方法，它考虑了生成最终表达式背后的逐步内部文本匹配过程，并引入了自一致性解码机制来提高鲁棒性。实验结果表明，InfeRE在生成正则表达式方面取得了显著的改进。",
    "en_tdlr": "InfeRE is a new approach that generates regular expressions step-by-step via chains of inference, taking into account the step-by-step internal text-matching processes behind the final results and introducing a self-consistency decoding mechanism to enhance robustness. Experimental results show significant improvement in regex generation with InfeRE."
}