{
    "title": "GeoExplainer: A Visual Analytics Framework for Spatial Modeling Contextualization and Report Generation. (arXiv:2308.13588v1 [cs.HC])",
    "abstract": "Geographic regression models of various descriptions are often applied to identify patterns and anomalies in the determinants of spatially distributed observations. These types of analyses focus on answering why questions about underlying spatial phenomena, e.g., why is crime higher in this locale, why do children in one school district outperform those in another, etc.? Answers to these questions require explanations of the model structure, the choice of parameters, and contextualization of the findings with respect to their geographic context. This is particularly true for local forms of regression models which are focused on the role of locational context in determining human behavior. In this paper, we present GeoExplainer, a visual analytics framework designed to support analysts in creating explanative documentation that summarizes and contextualizes their spatial analyses. As analysts create their spatial models, our framework flags potential issues with model parameter selectio",
    "link": "http://arxiv.org/abs/2308.13588",
    "context": "Title: GeoExplainer: A Visual Analytics Framework for Spatial Modeling Contextualization and Report Generation. (arXiv:2308.13588v1 [cs.HC])\nAbstract: Geographic regression models of various descriptions are often applied to identify patterns and anomalies in the determinants of spatially distributed observations. These types of analyses focus on answering why questions about underlying spatial phenomena, e.g., why is crime higher in this locale, why do children in one school district outperform those in another, etc.? Answers to these questions require explanations of the model structure, the choice of parameters, and contextualization of the findings with respect to their geographic context. This is particularly true for local forms of regression models which are focused on the role of locational context in determining human behavior. In this paper, we present GeoExplainer, a visual analytics framework designed to support analysts in creating explanative documentation that summarizes and contextualizes their spatial analyses. As analysts create their spatial models, our framework flags potential issues with model parameter selectio",
    "path": "papers/23/08/2308.13588.json",
    "total_tokens": 767,
    "translated_title": "GeoExplainer: 一种用于空间建模情境化和报告生成的可视化分析框架",
    "translated_abstract": "地理回归模型通常用于识别空间分布观测结果中的模式和异常。这种类型的分析旨在回答关于底层空间现象的问题，例如为什么犯罪率在这个地区较高，为什么一个学区的学生表现优于另一个学区的学生等。这些问题的答案需要对模型结构、参数选择的解释，并且需要将研究结果与地理背景进行情境化。本文介绍了GeoExplainer，一种可视化分析框架，旨在帮助分析人员创建能够总结和情境化空间分析的解释性文档。在分析人员创建空间模型时，我们的框架会标记模型参数选择中的潜在问题。",
    "tldr": "GeoExplainer是一种可视化分析框架，旨在支持分析人员创建总结和情境化空间分析的解释性文档。",
    "en_tdlr": "GeoExplainer is a visual analytics framework designed to support analysts in creating explanative documentation that summarizes and contextualizes their spatial analyses."
}