{
    "title": "Incident-Specific Cyber Insurance. (arXiv:2308.00921v1 [q-fin.RM])",
    "abstract": "In the current market practice, many cyber insurance products offer a coverage bundle for losses arising from various types of incidents, such as data breaches and ransomware attacks, and the coverage for each incident type comes with a separate limit and deductible. Although this gives prospective cyber insurance buyers more flexibility in customizing the coverage and better manages the risk exposures of sellers, it complicates the decision-making process in determining the optimal amount of risks to retain and transfer for both parties. This paper aims to build an economic foundation for these incident-specific cyber insurance products with a focus on how incident-specific indemnities should be designed for achieving Pareto optimality for both the insurance seller and buyer. Real data on cyber incidents is used to illustrate the feasibility of this approach. Several implementation improvement methods for practicality are also discussed.",
    "link": "http://arxiv.org/abs/2308.00921",
    "context": "Title: Incident-Specific Cyber Insurance. (arXiv:2308.00921v1 [q-fin.RM])\nAbstract: In the current market practice, many cyber insurance products offer a coverage bundle for losses arising from various types of incidents, such as data breaches and ransomware attacks, and the coverage for each incident type comes with a separate limit and deductible. Although this gives prospective cyber insurance buyers more flexibility in customizing the coverage and better manages the risk exposures of sellers, it complicates the decision-making process in determining the optimal amount of risks to retain and transfer for both parties. This paper aims to build an economic foundation for these incident-specific cyber insurance products with a focus on how incident-specific indemnities should be designed for achieving Pareto optimality for both the insurance seller and buyer. Real data on cyber incidents is used to illustrate the feasibility of this approach. Several implementation improvement methods for practicality are also discussed.",
    "path": "papers/23/08/2308.00921.json",
    "total_tokens": 836,
    "translated_title": "事件特定的网络保险",
    "translated_abstract": "在目前的市场实践中，许多网络保险产品为各类事件导致的损失提供捆绑套餐，例如数据泄露和勒索软件攻击，而每种事件类型的保险覆盖都有单独的限额和免赔额。虽然这给予了潜在的网络保险购买者更多灵活性来定制保险覆盖，并更好地管理卖方的风险暴露，但这也使得决策过程复杂化，需要确定双方保留和转移风险的最佳数量。本文旨在建立事件特定的网络保险产品的经济基础，重点研究如何为实现保险卖方和购买方的帕累托最优性而设计事件特定的赔偿措施。通过使用真实的网络事件数据来说明这种方法的可行性，并讨论了几种实践中的实施改进方法。",
    "tldr": "本文旨在建立事件特定的网络保险产品的经济基础，通过使用真实的网络事件数据，研究如何设计事件特定的赔偿措施，实现保险卖方和购买方的帕累托最优性。",
    "en_tdlr": "This paper aims to build an economic foundation for incident-specific cyber insurance products and investigates how to design incident-specific indemnities to achieve Pareto optimality for both the insurance seller and buyer, using real data on cyber incidents."
}