{
    "title": "Uncovering local aggregated air quality index with smartphone captured images leveraging efficient deep convolutional neural network. (arXiv:2308.03200v2 [cs.CV] UPDATED)",
    "abstract": "The prevalence and mobility of smartphones make these a widely used tool for environmental health research. However, their potential for determining aggregated air quality index (AQI) based on PM2.5 concentration in specific locations remains largely unexplored in the existing literature. In this paper, we thoroughly examine the challenges associated with predicting location-specific PM2.5 concentration using images taken with smartphone cameras. The focus of our study is on Dhaka, the capital of Bangladesh, due to its significant air pollution levels and the large population exposed to it. Our research involves the development of a Deep Convolutional Neural Network (DCNN), which we train using over a thousand outdoor images taken and annotated. These photos are captured at various locations in Dhaka, and their labels are based on PM2.5 concentration data obtained from the local US consulate, calculated using the NowCast algorithm. Through supervised learning, our model establishes a c",
    "link": "http://arxiv.org/abs/2308.03200",
    "context": "Title: Uncovering local aggregated air quality index with smartphone captured images leveraging efficient deep convolutional neural network. (arXiv:2308.03200v2 [cs.CV] UPDATED)\nAbstract: The prevalence and mobility of smartphones make these a widely used tool for environmental health research. However, their potential for determining aggregated air quality index (AQI) based on PM2.5 concentration in specific locations remains largely unexplored in the existing literature. In this paper, we thoroughly examine the challenges associated with predicting location-specific PM2.5 concentration using images taken with smartphone cameras. The focus of our study is on Dhaka, the capital of Bangladesh, due to its significant air pollution levels and the large population exposed to it. Our research involves the development of a Deep Convolutional Neural Network (DCNN), which we train using over a thousand outdoor images taken and annotated. These photos are captured at various locations in Dhaka, and their labels are based on PM2.5 concentration data obtained from the local US consulate, calculated using the NowCast algorithm. Through supervised learning, our model establishes a c",
    "path": "papers/23/08/2308.03200.json",
    "total_tokens": 960,
    "translated_title": "利用高效的深度卷积神经网络从智能手机拍摄图像中揭示本地聚合的空气质量指数",
    "translated_abstract": "智能手机的普及和可移动性使其成为环境健康研究中广泛使用的工具。然而，现有文献中对基于特定位置PM2.5浓度确定聚合空气质量指数（AQI）的潜力的研究仍然较少。在本文中，我们深入研究了使用智能手机相机拍摄的图像来预测特定位置PM2.5浓度的挑战。我们的研究重点是孟加拉国首都达卡，因其严重的空气污染水平和大量暴露于其中的人口。我们的研究涉及开发一个深度卷积神经网络（DCNN），我们使用超过一千张在达卡不同地点拍摄和标注的室外图像进行训练。这些照片的标签基于从当地美国领事馆获取的PM2.5浓度数据，使用NowCast算法计算得到。通过监督学习，我们的模型建立了一个c",
    "tldr": "本文利用智能手机拍摄的图像，通过发展一个深度卷积神经网络，成功预测了特定位置的PM2.5浓度，揭示了本地聚合的空气质量指数的潜力。"
}