{
    "title": "Continuous Reinforcement Learning-based Dynamic Difficulty Adjustment in a Visual Working Memory Game. (arXiv:2308.12726v1 [cs.HC])",
    "abstract": "Dynamic Difficulty Adjustment (DDA) is a viable approach to enhance a player's experience in video games. Recently, Reinforcement Learning (RL) methods have been employed for DDA in non-competitive games; nevertheless, they rely solely on discrete state-action space with a small search space. In this paper, we propose a continuous RL-based DDA methodology for a visual working memory (VWM) game to handle the complex search space for the difficulty of memorization. The proposed RL-based DDA tailors game difficulty based on the player's score and game difficulty in the last trial. We defined a continuous metric for the difficulty of memorization. Then, we consider the task difficulty and the vector of difficulty-score as the RL's action and state, respectively. We evaluated the proposed method through a within-subject experiment involving 52 subjects. The proposed approach was compared with two rule-based difficulty adjustment methods in terms of player's score and game experience measure",
    "link": "http://arxiv.org/abs/2308.12726",
    "context": "Title: Continuous Reinforcement Learning-based Dynamic Difficulty Adjustment in a Visual Working Memory Game. (arXiv:2308.12726v1 [cs.HC])\nAbstract: Dynamic Difficulty Adjustment (DDA) is a viable approach to enhance a player's experience in video games. Recently, Reinforcement Learning (RL) methods have been employed for DDA in non-competitive games; nevertheless, they rely solely on discrete state-action space with a small search space. In this paper, we propose a continuous RL-based DDA methodology for a visual working memory (VWM) game to handle the complex search space for the difficulty of memorization. The proposed RL-based DDA tailors game difficulty based on the player's score and game difficulty in the last trial. We defined a continuous metric for the difficulty of memorization. Then, we consider the task difficulty and the vector of difficulty-score as the RL's action and state, respectively. We evaluated the proposed method through a within-subject experiment involving 52 subjects. The proposed approach was compared with two rule-based difficulty adjustment methods in terms of player's score and game experience measure",
    "path": "papers/23/08/2308.12726.json",
    "total_tokens": 995,
    "translated_title": "基于连续强化学习的视觉工作记忆游戏动态难度调整",
    "translated_abstract": "动态难度调整（DDA）是提升玩家在视频游戏中体验的一种有效方法。最近，强化学习（RL）方法已被应用于非竞争性游戏的DDA；尽管如此，它们仅依赖于具有小的搜索空间的离散状态-动作空间。在本文中，我们提出了一种基于连续强化学习的DDA方法，用于处理视觉工作记忆（VWM）游戏中难度记忆的复杂搜索空间。该提出的基于RL的DDA根据玩家的得分和上一轮游戏的难度量度来调整游戏难度。我们定义了一种连续的难度记忆度量。然后，我们将任务难度和难度-得分向量分别作为RL的动作和状态。我们通过一个涉及52位受试者的被试内实验来评估所提出的方法。在玩家的得分和游戏体验度量方面，将所提出的方法与两种基于规则的难度调整方法进行了比较。",
    "tldr": "本文提出了一种基于连续强化学习的动态难度调整方法，用于处理视觉工作记忆游戏中的复杂难度记忆问题。通过根据玩家的得分和上一轮游戏的难度量度来调整游戏难度，该方法在52位受试者的实验中得到了评估和比较。",
    "en_tdlr": "This paper proposes a continuous reinforcement learning-based method for dynamic difficulty adjustment in a visual working memory game, addressing the complex difficulty of memorization. By tailoring game difficulty based on the player's score and the difficulty in the last trial, the method was evaluated and compared with two rule-based difficulty adjustment methods using a within-subject experiment involving 52 subjects."
}