{
    "title": "Toward Improving Predictive Risk Modelling for New Zealand's Child Welfare System Using Clustering Methods. (arXiv:2308.04060v1 [stat.ML])",
    "abstract": "The combination of clinical judgement and predictive risk models crucially assist social workers to segregate children at risk of maltreatment and decide when authorities should intervene. Predictive risk modelling to address this matter has been initiated by several governmental welfare authorities worldwide involving administrative data and machine learning algorithms. While previous studies have investigated risk factors relating to child maltreatment, several gaps remain as to understanding how such risk factors interact and whether predictive risk models perform differently for children with different features. By integrating Principal Component Analysis and K-Means clustering, this paper presents initial findings of our work on the identification of such features as well as their potential effect on current risk modelling frameworks. This approach allows examining existent, unidentified yet, clusters of New Zealand (NZ) children reported with care and protection concerns, as well",
    "link": "http://arxiv.org/abs/2308.04060",
    "context": "Title: Toward Improving Predictive Risk Modelling for New Zealand's Child Welfare System Using Clustering Methods. (arXiv:2308.04060v1 [stat.ML])\nAbstract: The combination of clinical judgement and predictive risk models crucially assist social workers to segregate children at risk of maltreatment and decide when authorities should intervene. Predictive risk modelling to address this matter has been initiated by several governmental welfare authorities worldwide involving administrative data and machine learning algorithms. While previous studies have investigated risk factors relating to child maltreatment, several gaps remain as to understanding how such risk factors interact and whether predictive risk models perform differently for children with different features. By integrating Principal Component Analysis and K-Means clustering, this paper presents initial findings of our work on the identification of such features as well as their potential effect on current risk modelling frameworks. This approach allows examining existent, unidentified yet, clusters of New Zealand (NZ) children reported with care and protection concerns, as well",
    "path": "papers/23/08/2308.04060.json",
    "total_tokens": 902,
    "translated_title": "改进利用聚类方法进行新西兰儿童福利系统的预测风险建模",
    "translated_abstract": "临床判断和预测风险模型的结合对社工在划分处于虐待风险中的儿童并决定何时采取干预措施至关重要。政府福利机构利用行政数据和机器学习算法已经开始了解决这个问题的预测风险建模工作。虽然以往的研究已经调查了与儿童虐待有关的风险因素，但仍存在很多空白，尚不清楚这些风险因素如何相互作用以及预测风险模型在具有不同特征的儿童中是否表现不同。本文通过整合主成分分析和K-Means聚类，初步发现了我们在确定这些特征及其对当前风险建模框架的潜在影响的工作。这种方法可以对新西兰（NZ）被报告有护理和保护问题的儿童的现存、尚未确定的聚类进行研究。",
    "tldr": "本文利用主成分分析和K-Means聚类方法，初步研究了新西兰儿童福利系统的预测风险建模，发现了一些特征并了解了其对当前风险建模框架的潜在影响。"
}