{
    "title": "Massively Parallel Continuous Local Search for Hybrid SAT Solving on GPUs. (arXiv:2308.15020v1 [cs.AI])",
    "abstract": "Although state-of-the-art (SOTA) SAT solvers based on conflict-driven clause learning (CDCL) have achieved remarkable engineering success, their sequential nature limits the parallelism that may be extracted for acceleration on platforms such as the graphics processing unit (GPU). In this work, we propose FastFourierSAT, a highly parallel hybrid SAT solver based on gradient-driven continuous local search (CLS). This is realized by a novel parallel algorithm inspired by the Fast Fourier Transform (FFT)-based convolution for computing the elementary symmetric polynomials (ESPs), which is the major computational task in previous CLS methods. The complexity of our algorithm matches the best previous result. Furthermore, the substantial parallelism inherent in our algorithm can leverage the GPU for acceleration, demonstrating significant improvement over the previous CLS approaches. We also propose to incorporate the restart heuristics in CLS to improve search efficiency. We compare our app",
    "link": "http://arxiv.org/abs/2308.15020",
    "context": "Title: Massively Parallel Continuous Local Search for Hybrid SAT Solving on GPUs. (arXiv:2308.15020v1 [cs.AI])\nAbstract: Although state-of-the-art (SOTA) SAT solvers based on conflict-driven clause learning (CDCL) have achieved remarkable engineering success, their sequential nature limits the parallelism that may be extracted for acceleration on platforms such as the graphics processing unit (GPU). In this work, we propose FastFourierSAT, a highly parallel hybrid SAT solver based on gradient-driven continuous local search (CLS). This is realized by a novel parallel algorithm inspired by the Fast Fourier Transform (FFT)-based convolution for computing the elementary symmetric polynomials (ESPs), which is the major computational task in previous CLS methods. The complexity of our algorithm matches the best previous result. Furthermore, the substantial parallelism inherent in our algorithm can leverage the GPU for acceleration, demonstrating significant improvement over the previous CLS approaches. We also propose to incorporate the restart heuristics in CLS to improve search efficiency. We compare our app",
    "path": "papers/23/08/2308.15020.json",
    "total_tokens": 946,
    "translated_title": "基于GPU的混合可满足性问题求解器的大规模并行连续局部搜索",
    "translated_abstract": "针对基于冲突驱动子句学习（CDCL）的最先进可满足性问题（SAT）求解器在工程上取得了显著成功，但其顺序性质限制了在图形处理单元（GPU）等平台上进行加速的并行性。在本研究中，我们提出了FastFourierSAT，一种基于梯度驱动连续局部搜索（CLS）的高度并行混合SAT求解器。这是通过一种受快速傅里叶变换（FFT）卷积启发的新型并行算法来实现的，用于计算以前的CLS方法中的主要计算任务——基本对称多项式（ESP）。我们的算法复杂度与最佳的以前结果相匹配。此外，我们算法固有的大规模并行性能够利用GPU进行加速，相比以前的CLS方法展现出显著的改进。我们还提出了将重启启发式算法融入CLS以提高搜索效率。我们将我们的应用与其他SAT求解器进行了比较。",
    "tldr": "提出了一种基于GPU的大规模并行连续局部搜索方法来加速混合SAT求解器，该方法通过使用基于快速傅里叶变换的新型并行算法来计算基本对称多项式，并在搜索中使用重启启发式算法以提高效率。与以前的方法相比，实现了显著的改进。",
    "en_tdlr": "A massively parallel continuous local search method is proposed to accelerate hybrid SAT solvers on GPUs. It uses a novel parallel algorithm based on the Fast Fourier Transform to compute elementary symmetric polynomials and incorporates restart heuristics to improve search efficiency. Significant improvement is achieved compared to previous methods."
}