{
    "title": "Optical Script Identification for multi-lingual Indic-script. (arXiv:2308.05780v1 [cs.AI])",
    "abstract": "Script identification and text recognition are some of the major domains in the application of Artificial Intelligence. In this era of digitalization, the use of digital note-taking has become a common practice. Still, conventional methods of using pen and paper is a prominent way of writing. This leads to the classification of scripts based on the method they are obtained. A survey on the current methodologies and state-of-art methods used for processing and identification would prove beneficial for researchers. The aim of this article is to discuss the advancement in the techniques for script pre-processing and text recognition. In India there are twelve prominent Indic scripts, unlike the English language, these scripts have layers of characteristics. Complex characteristics such as similarity in text shape make them difficult to recognize and analyze, thus this requires advance preprocessing methods for their accurate recognition. A sincere attempt is made in this survey to provide",
    "link": "http://arxiv.org/abs/2308.05780",
    "context": "Title: Optical Script Identification for multi-lingual Indic-script. (arXiv:2308.05780v1 [cs.AI])\nAbstract: Script identification and text recognition are some of the major domains in the application of Artificial Intelligence. In this era of digitalization, the use of digital note-taking has become a common practice. Still, conventional methods of using pen and paper is a prominent way of writing. This leads to the classification of scripts based on the method they are obtained. A survey on the current methodologies and state-of-art methods used for processing and identification would prove beneficial for researchers. The aim of this article is to discuss the advancement in the techniques for script pre-processing and text recognition. In India there are twelve prominent Indic scripts, unlike the English language, these scripts have layers of characteristics. Complex characteristics such as similarity in text shape make them difficult to recognize and analyze, thus this requires advance preprocessing methods for their accurate recognition. A sincere attempt is made in this survey to provide",
    "path": "papers/23/08/2308.05780.json",
    "total_tokens": 862,
    "translated_title": "具有多语言印度字体的光学脚本识别",
    "translated_abstract": "脚本识别和文本识别是人工智能应用中的重要领域。在数字化时代，使用数字记笔记已经成为常见的做法。然而，传统的纸笔方法仍然是一种主要的书写方式。这导致脚本被基于获取方式进行分类。对当前处理和识别方法的调查将对研究人员有益。本文旨在讨论脚本预处理和文本识别技术的进展。在印度，有十二种杰出的印度字体，与英语不同，这些字体具有多层次的特征。诸如文本形状相似性等复杂特征使得它们难以识别和分析，因此需要先进的预处理方法来进行准确识别。本调查试图提供一份全面的概述，介绍了当前的研究和方法，并展望未来的挑战和可能的解决方案。",
    "tldr": "本论文调查了印度多语言字体的光学脚本识别技术的进展，重点讨论了脚本预处理和文本识别的方法，提出了对于印度字体特征的挑战和可能的解决方案。",
    "en_tdlr": "This paper surveys the advancement in optical script identification for multi-lingual Indic scripts, focusing on script pre-processing and text recognition methods, while highlighting the challenges and potential solutions for the characteristics of Indic scripts."
}