{
    "title": "Literal-Aware Knowledge Graph Embedding for Welding Quality Monitoring: A Bosch Case. (arXiv:2308.01105v1 [cs.AI])",
    "abstract": "Recently there has been a series of studies in knowledge graph embedding (KGE), which attempts to learn the embeddings of the entities and relations as numerical vectors and mathematical mappings via machine learning (ML). However, there has been limited research that applies KGE for industrial problems in manufacturing. This paper investigates whether and to what extent KGE can be used for an important problem: quality monitoring for welding in manufacturing industry, which is an impactful process accounting for production of millions of cars annually. The work is in line with Bosch research of data-driven solutions that intends to replace the traditional way of destroying cars, which is extremely costly and produces waste. The paper tackles two very challenging questions simultaneously: how large the welding spot diameter is; and to which car body the welded spot belongs to. The problem setting is difficult for traditional ML because there exist a high number of car bodies that shoul",
    "link": "http://arxiv.org/abs/2308.01105",
    "context": "Title: Literal-Aware Knowledge Graph Embedding for Welding Quality Monitoring: A Bosch Case. (arXiv:2308.01105v1 [cs.AI])\nAbstract: Recently there has been a series of studies in knowledge graph embedding (KGE), which attempts to learn the embeddings of the entities and relations as numerical vectors and mathematical mappings via machine learning (ML). However, there has been limited research that applies KGE for industrial problems in manufacturing. This paper investigates whether and to what extent KGE can be used for an important problem: quality monitoring for welding in manufacturing industry, which is an impactful process accounting for production of millions of cars annually. The work is in line with Bosch research of data-driven solutions that intends to replace the traditional way of destroying cars, which is extremely costly and produces waste. The paper tackles two very challenging questions simultaneously: how large the welding spot diameter is; and to which car body the welded spot belongs to. The problem setting is difficult for traditional ML because there exist a high number of car bodies that shoul",
    "path": "papers/23/08/2308.01105.json",
    "total_tokens": 895,
    "translated_title": "面向焊接质量监测的字面感知知识图嵌入：Bosch案例研究",
    "translated_abstract": "最近，关于知识图嵌入(KGE)的一系列研究已经出现，其试图通过机器学习(ML)学习实体和关系的嵌入作为数字向量和数学映射。然而，在制造业中，应用KGE解决工业问题的研究还很有限。本文研究了KGE在制造业焊接质量监测中的应用可能性和程度。焊接质量监测是制造业中一项重要问题，每年都会生产数百万辆汽车。本研究与宝马的数据驱动解决方案研究相符，旨在替代传统的拆解汽车的方式，该方式费用高昂且产生废物。本文同时解决了两个非常具有挑战性的问题：焊接斑点直径有多大以及焊接斑点属于哪个汽车车身。传统的机器学习方法难以解决这个问题，因为存在大量的汽车车身。",
    "tldr": "本文研究了在制造业焊接质量监测中应用知识图嵌入的可能性和程度，解决了两个非常具有挑战性的问题：焊接斑点直径和所属车身的问题。",
    "en_tdlr": "This paper investigates the possibility and extent of applying knowledge graph embedding for quality monitoring in welding within the manufacturing industry, addressing the challenging issues of welding spot diameter and car body classification."
}