{
    "title": "Demonstration of CORNET: A System For Learning Spreadsheet Formatting Rules By Example. (arXiv:2308.07357v1 [cs.SE])",
    "abstract": "Data management and analysis tasks are often carried out using spreadsheet software. A popular feature in most spreadsheet platforms is the ability to define data-dependent formatting rules. These rules can express actions such as \"color red all entries in a column that are negative\" or \"bold all rows not containing error or failure.\" Unfortunately, users who want to exercise this functionality need to manually write these conditional formatting (CF) rules. We introduce CORNET, a system that automatically learns such conditional formatting rules from user examples. CORNET takes inspiration from inductive program synthesis and combines symbolic rule enumeration, based on semi-supervised clustering and iterative decision tree learning, with a neural ranker to produce accurate conditional formatting rules. In this demonstration, we show CORNET in action as a simple add-in to Microsoft Excel. After the user provides one or two formatted cells as examples, CORNET generates formatting rule s",
    "link": "http://arxiv.org/abs/2308.07357",
    "context": "Title: Demonstration of CORNET: A System For Learning Spreadsheet Formatting Rules By Example. (arXiv:2308.07357v1 [cs.SE])\nAbstract: Data management and analysis tasks are often carried out using spreadsheet software. A popular feature in most spreadsheet platforms is the ability to define data-dependent formatting rules. These rules can express actions such as \"color red all entries in a column that are negative\" or \"bold all rows not containing error or failure.\" Unfortunately, users who want to exercise this functionality need to manually write these conditional formatting (CF) rules. We introduce CORNET, a system that automatically learns such conditional formatting rules from user examples. CORNET takes inspiration from inductive program synthesis and combines symbolic rule enumeration, based on semi-supervised clustering and iterative decision tree learning, with a neural ranker to produce accurate conditional formatting rules. In this demonstration, we show CORNET in action as a simple add-in to Microsoft Excel. After the user provides one or two formatted cells as examples, CORNET generates formatting rule s",
    "path": "papers/23/08/2308.07357.json",
    "total_tokens": 854,
    "translated_title": "CORNET演示: 一种通过示例学习电子表格格式规则的系统",
    "translated_abstract": "数据管理和分析任务通常使用电子表格软件来完成。大多数电子表格平台中一个受欢迎的功能是定义数据相关的格式规则。这些规则可以表达如“将某列中所有负数标记为红色”或“加粗所有不包含错误或故障的行”的操作。不幸的是，想要使用这个功能的用户需要手动编写这些条件格式化规则。我们介绍了CORNET，这是一个能够从用户示例中自动学习这些条件格式化规则的系统。CORNET借鉴了归纳程序合成的思想，结合了基于半监督聚类和迭代决策树学习的符号规则枚举方法，并使用神经网络评估器生成准确的条件格式化规则。在这个演示中，我们展示了CORNET作为Microsoft Excel的一个简单插件的使用情况。用户提供一个或两个格式化的单元格示例后，CORNET会生成格式化规则。",
    "tldr": "CORNET是一个可以通过示例自动学习电子表格条件格式化规则的系统，它结合了归纳程序合成和符号规则枚举方法，并使用神经网络评估器生成准确的规则。",
    "en_tdlr": "CORNET is a system that can automatically learn spreadsheet conditional formatting rules from user examples. It combines inductive program synthesis and symbolic rule enumeration, and utilizes a neural ranker to generate accurate rules."
}