{
    "title": "Vector Search with OpenAI Embeddings: Lucene Is All You Need. (arXiv:2308.14963v1 [cs.IR])",
    "abstract": "We provide a reproducible, end-to-end demonstration of vector search with OpenAI embeddings using Lucene on the popular MS MARCO passage ranking test collection. The main goal of our work is to challenge the prevailing narrative that a dedicated vector store is necessary to take advantage of recent advances in deep neural networks as applied to search. Quite the contrary, we show that hierarchical navigable small-world network (HNSW) indexes in Lucene are adequate to provide vector search capabilities in a standard bi-encoder architecture. This suggests that, from a simple cost-benefit analysis, there does not appear to be a compelling reason to introduce a dedicated vector store into a modern \"AI stack\" for search, since such applications have already received substantial investments in existing, widely deployed infrastructure.",
    "link": "http://arxiv.org/abs/2308.14963",
    "context": "Title: Vector Search with OpenAI Embeddings: Lucene Is All You Need. (arXiv:2308.14963v1 [cs.IR])\nAbstract: We provide a reproducible, end-to-end demonstration of vector search with OpenAI embeddings using Lucene on the popular MS MARCO passage ranking test collection. The main goal of our work is to challenge the prevailing narrative that a dedicated vector store is necessary to take advantage of recent advances in deep neural networks as applied to search. Quite the contrary, we show that hierarchical navigable small-world network (HNSW) indexes in Lucene are adequate to provide vector search capabilities in a standard bi-encoder architecture. This suggests that, from a simple cost-benefit analysis, there does not appear to be a compelling reason to introduce a dedicated vector store into a modern \"AI stack\" for search, since such applications have already received substantial investments in existing, widely deployed infrastructure.",
    "path": "papers/23/08/2308.14963.json",
    "total_tokens": 843,
    "translated_title": "使用OpenAI嵌入和Lucene的向量搜索：Lucene即为所需",
    "translated_abstract": "我们提供了一个可复现的、端到端的向量搜索演示，使用Lucene在流行的MS MARCO段落排名测试集上进行。我们的工作的主要目标是挑战一种普遍的观点，即利用最近在深度神经网络在搜索中的应用中取得的进展需要一个专用的向量存储。恰恰相反，我们展示了Lucene中的层次可导航小世界网络（HNSW）索引足以在标准的双编码器架构中提供向量搜索功能。这表明，从简单的成本效益分析来看，将一个专门的向量存储引入现代的“AI堆栈”中进行搜索似乎没有强有力的理由，因为这些应用已经在现有的广泛部署的基础设施中得到了大量的投资。",
    "tldr": "本论文提供了一个使用Lucene进行向量搜索的可复现演示，挑战了需要专用向量存储的观点，并展示了Lucene中的HNSW索引足以提供向量搜索功能。这表明在现代\"AI堆栈\"中进行搜索并不需要引入专用向量存储。",
    "en_tdlr": "This paper provides a reproducible demonstration of vector search using Lucene, challenging the need for a dedicated vector store, and showing that Lucene's HNSW index is sufficient for vector search capabilities. This suggests that introducing a dedicated vector store is not necessary for search in modern \"AI stack\"."
}