{
    "title": "Financial Inclusion and Monetary Policy: A Study on the Relationship between Financial Inclusion and Effectiveness of Monetary Policy in Developing Countries. (arXiv:2308.12542v1 [econ.GN])",
    "abstract": "The study analyzed the impact of financial inclusion on the effectiveness of monetary policy in developing countries. By using a panel data set of 10 developing countries during 2004-2020, the study revealed that the financial inclusion measured by the number of ATM per 100,000 adults had a significant negative effect on monetary policy, whereas the other measure of financial inclusion i.e. the number of bank accounts per 100,000 adults had a positive impact on monetary policy, which is not statistically significant. The study also revealed that foreign direct investment (FDI), lending rate and exchange rate had a positive impact on inflation, but only the effect of lending rate is statistically significant. Therefore, the governments of these countries should make necessary drives to increase the level of financial inclusion as it stabilizes the price level by reducing the inflation in the economy.",
    "link": "http://arxiv.org/abs/2308.12542",
    "context": "Title: Financial Inclusion and Monetary Policy: A Study on the Relationship between Financial Inclusion and Effectiveness of Monetary Policy in Developing Countries. (arXiv:2308.12542v1 [econ.GN])\nAbstract: The study analyzed the impact of financial inclusion on the effectiveness of monetary policy in developing countries. By using a panel data set of 10 developing countries during 2004-2020, the study revealed that the financial inclusion measured by the number of ATM per 100,000 adults had a significant negative effect on monetary policy, whereas the other measure of financial inclusion i.e. the number of bank accounts per 100,000 adults had a positive impact on monetary policy, which is not statistically significant. The study also revealed that foreign direct investment (FDI), lending rate and exchange rate had a positive impact on inflation, but only the effect of lending rate is statistically significant. Therefore, the governments of these countries should make necessary drives to increase the level of financial inclusion as it stabilizes the price level by reducing the inflation in the economy.",
    "path": "papers/23/08/2308.12542.json",
    "total_tokens": 1050,
    "translated_title": "金融包容性和货币政策：关于金融包容性与发展中国家货币政策效果关系的研究",
    "translated_abstract": "本研究分析了金融包容性对发展中国家货币政策效果的影响。通过使用2004年至2020年10个发展中国家的面板数据，研究发现衡量金融包容性的指标——每10万成年人的ATM数量对货币政策有显著负面影响，而另一个金融包容性指标——每10万成年人的银行账户数量对货币政策有积极影响，但统计上不显著。研究还发现外商直接投资、贷款利率和汇率对通胀有积极影响，但只有贷款利率的影响是统计上显著的。因此，这些国家的政府应采取必要措施提高金融包容性水平，以通过降低通胀来稳定价格水平。",
    "tldr": "本研究通过分析发展中国家的实证数据，发现金融包容性对货币政策效果有着复杂的影响，具体而言，ATM数量的增加对货币政策产生负面影响，而银行账户数量的增加对货币政策的影响不显著。此外，贷款利率对通胀有显著影响，而外商直接投资和汇率的影响对通胀不显著。因此，发展中国家的政府应采取措施提高金融包容性水平，以稳定经济中的价格水平。",
    "en_tdlr": "This study examines the relationship between financial inclusion and effectiveness of monetary policy in developing countries, finding that the increase in ATM per 100,000 adults has a negative impact on monetary policy, while the increase in bank accounts per 100,000 adults has no significant impact. Additionally, the lending rate has a significant effect on inflation, while foreign direct investment and exchange rate do not. Therefore, governments of developing countries should enhance financial inclusion to stabilize the price level in their economies."
}