{
    "title": "Shape-Margin Knowledge Augmented Network for Thyroid Nodule Segmentation and Diagnosis. (arXiv:2308.15386v1 [eess.IV])",
    "abstract": "Thyroid nodule segmentation is a crucial step in the diagnostic procedure of physicians and computer-aided diagnosis systems. Mostly, current studies treat segmentation and diagnosis as independent tasks without considering the correlation between these tasks. The sequence steps of these independent tasks in computer-aided diagnosis systems may lead to the accumulation of errors. Therefore, it is worth combining them as a whole through exploring the relationship between thyroid nodule segmentation and diagnosis. According to the thyroid imaging reporting and data system (TI-RADS), the assessment of shape and margin characteristics is the prerequisite for the discrimination of benign and malignant thyroid nodules. These characteristics can be observed in the thyroid nodule segmentation masks. Inspired by the diagnostic procedure of TI-RADS, this paper proposes a shape-margin knowledge augmented network (SkaNet) for simultaneously thyroid nodule segmentation and diagnosis. Due to the sim",
    "link": "http://arxiv.org/abs/2308.15386",
    "context": "Title: Shape-Margin Knowledge Augmented Network for Thyroid Nodule Segmentation and Diagnosis. (arXiv:2308.15386v1 [eess.IV])\nAbstract: Thyroid nodule segmentation is a crucial step in the diagnostic procedure of physicians and computer-aided diagnosis systems. Mostly, current studies treat segmentation and diagnosis as independent tasks without considering the correlation between these tasks. The sequence steps of these independent tasks in computer-aided diagnosis systems may lead to the accumulation of errors. Therefore, it is worth combining them as a whole through exploring the relationship between thyroid nodule segmentation and diagnosis. According to the thyroid imaging reporting and data system (TI-RADS), the assessment of shape and margin characteristics is the prerequisite for the discrimination of benign and malignant thyroid nodules. These characteristics can be observed in the thyroid nodule segmentation masks. Inspired by the diagnostic procedure of TI-RADS, this paper proposes a shape-margin knowledge augmented network (SkaNet) for simultaneously thyroid nodule segmentation and diagnosis. Due to the sim",
    "path": "papers/23/08/2308.15386.json",
    "total_tokens": 928,
    "translated_title": "基于形状边缘知识增强网络的甲状腺结节分割和诊断",
    "translated_abstract": "甲状腺结节分割是医生和计算机辅助诊断系统诊断过程中的关键步骤。目前的研究大多将分割和诊断作为独立的任务，没有考虑这些任务之间的相关性。计算机辅助诊断系统中独立任务的顺序步骤可能会导致误差的累积。因此，值得通过探索甲状腺结节分割和诊断之间的关系将它们作为一个整体进行组合。根据甲状腺影像报告和数据系统（TI-RADS），形状和边缘特征的评估是区分良性和恶性甲状腺结节的先决条件。这些特征可以在甲状腺结节分割掩模中观察到。受到TI-RADS诊断过程的启发，本文提出了一种用于同时进行甲状腺结节分割和诊断的形状边缘知识增强网络（SkaNet）。",
    "tldr": "本文提出了一种基于形状边缘知识增强网络（SkaNet）的甲状腺结节分割和诊断方法，通过探索甲状腺结节分割和诊断之间的关系，实现了两个任务的一体化。该方法基于甲状腺影像报告和数据系统（TI-RADS），利用形状和边缘特征来区分良性和恶性甲状腺结节。"
}