{
    "title": "Evaluation of Key Spatiotemporal Learners for Print Track Anomaly Classification Using Melt Pool Image Streams. (arXiv:2308.14861v1 [cs.LG])",
    "abstract": "Recent applications of machine learning in metal additive manufacturing (MAM) have demonstrated significant potential in addressing critical barriers to the widespread adoption of MAM technology. Recent research in this field emphasizes the importance of utilizing melt pool signatures for real-time defect prediction. While high-quality melt pool image data holds the promise of enabling precise predictions, there has been limited exploration into the utilization of cutting-edge spatiotemporal models that can harness the inherent transient and sequential characteristics of the additive manufacturing process. This research introduces and puts into practice some of the leading deep spatiotemporal learning models that can be adapted for the classification of melt pool image streams originating from various materials, systems, and applications. Specifically, it investigates two-stream networks comprising spatial and temporal streams, a recurrent spatial network, and a factorized 3D convoluti",
    "link": "http://arxiv.org/abs/2308.14861",
    "context": "Title: Evaluation of Key Spatiotemporal Learners for Print Track Anomaly Classification Using Melt Pool Image Streams. (arXiv:2308.14861v1 [cs.LG])\nAbstract: Recent applications of machine learning in metal additive manufacturing (MAM) have demonstrated significant potential in addressing critical barriers to the widespread adoption of MAM technology. Recent research in this field emphasizes the importance of utilizing melt pool signatures for real-time defect prediction. While high-quality melt pool image data holds the promise of enabling precise predictions, there has been limited exploration into the utilization of cutting-edge spatiotemporal models that can harness the inherent transient and sequential characteristics of the additive manufacturing process. This research introduces and puts into practice some of the leading deep spatiotemporal learning models that can be adapted for the classification of melt pool image streams originating from various materials, systems, and applications. Specifically, it investigates two-stream networks comprising spatial and temporal streams, a recurrent spatial network, and a factorized 3D convoluti",
    "path": "papers/23/08/2308.14861.json",
    "total_tokens": 852,
    "translated_title": "评估使用熔池图像流进行印刷轨迹异常分类的关键时空学习器",
    "translated_abstract": "最近在金属增材制造（MAM）中应用机器学习已经展现出了解决普遍采用MAM技术的关键障碍的巨大潜力。这个领域的最新研究强调了利用熔池特征进行实时缺陷预测的重要性。尽管高质量的熔池图像数据具有实现精确预测的潜力，但对于能够利用增材制造过程的瞬态和时序特征的尖端时空模型的利用仍然有限。本研究介绍并实践了一些领先的深度时空学习模型，可用于分类来自不同材料、系统和应用的熔池图像流。具体而言，它研究了由空间和时间流组成的两流网络、循环空间网络和因式分解3D卷积。",
    "tldr": "本研究评估了使用熔池图像流进行印刷轨迹异常分类的关键时空学习器，并介绍了一些领先的深度时空学习模型的实践应用。",
    "en_tdlr": "This study evaluates key spatiotemporal learners for print track anomaly classification using melt pool image streams and introduces practical applications of leading deep spatiotemporal learning models."
}