{
    "title": "LARCH: Large Language Model-based Automatic Readme Creation with Heuristics. (arXiv:2308.03099v2 [cs.CL] UPDATED)",
    "abstract": "Writing a readme is a crucial aspect of software development as it plays a vital role in managing and reusing program code. Though it is a pain point for many developers, automatically creating one remains a challenge even with the recent advancements in large language models (LLMs), because it requires generating an abstract description from thousands of lines of code. In this demo paper, we show that LLMs are capable of generating a coherent and factually correct readmes if we can identify a code fragment that is representative of the repository. Building upon this finding, we developed LARCH (LLM-based Automatic Readme Creation with Heuristics) which leverages representative code identification with heuristics and weak supervision. Through human and automated evaluations, we illustrate that LARCH can generate coherent and factually correct readmes in the majority of cases, outperforming a baseline that does not rely on representative code identification. We have made LARCH open-sour",
    "link": "http://arxiv.org/abs/2308.03099",
    "context": "Title: LARCH: Large Language Model-based Automatic Readme Creation with Heuristics. (arXiv:2308.03099v2 [cs.CL] UPDATED)\nAbstract: Writing a readme is a crucial aspect of software development as it plays a vital role in managing and reusing program code. Though it is a pain point for many developers, automatically creating one remains a challenge even with the recent advancements in large language models (LLMs), because it requires generating an abstract description from thousands of lines of code. In this demo paper, we show that LLMs are capable of generating a coherent and factually correct readmes if we can identify a code fragment that is representative of the repository. Building upon this finding, we developed LARCH (LLM-based Automatic Readme Creation with Heuristics) which leverages representative code identification with heuristics and weak supervision. Through human and automated evaluations, we illustrate that LARCH can generate coherent and factually correct readmes in the majority of cases, outperforming a baseline that does not rely on representative code identification. We have made LARCH open-sour",
    "path": "papers/23/08/2308.03099.json",
    "total_tokens": 868,
    "translated_title": "LARCH: 基于大型语言模型的自动readme创建与启发式方法",
    "translated_abstract": "编写readme是软件开发的关键，它在管理和重用程序代码中起着重要作用。尽管这是许多开发人员的痛点，但即使在最新的大型语言模型(LLMs)的进展下，自动创建readme仍然是一个挑战，因为需要从成千上万行代码中生成一个抽象描述。在这篇演示文章中，我们展示了如果我们能确定一个代表仓库的代码片段，LLMs有能力生成一份连贯和事实正确的readme。建立在这一发现的基础上，我们开发了LARCH（LLM-based Automatic Readme Creation with Heuristics），它利用启发式和弱监督的方式进行代表性代码的识别。通过人工和自动评估，我们证明LARCH在大多数情况下可以生成连贯和事实正确的readme，并且优于不依赖于代表性代码识别的基线算法。",
    "tldr": "LARCH是一种基于大型语言模型的自动readme创建方法，通过识别代表性代码和启发式方法，能够生成连贯和事实正确的readme，优于不依赖代表性代码识别的基线算法。",
    "en_tdlr": "LARCH is an automatic readme creation method based on large language models. By identifying representative code and leveraging heuristics, it is capable of generating coherent and factually correct readmes, outperforming baseline algorithms that do not rely on representative code identification."
}