{
    "title": "TrajPAC: Towards Robustness Verification of Pedestrian Trajectory Prediction Models. (arXiv:2308.05985v1 [cs.AI])",
    "abstract": "Robust pedestrian trajectory forecasting is crucial to developing safe autonomous vehicles. Although previous works have studied adversarial robustness in the context of trajectory forecasting, some significant issues remain unaddressed. In this work, we try to tackle these crucial problems. Firstly, the previous definitions of robustness in trajectory prediction are ambiguous. We thus provide formal definitions for two kinds of robustness, namely label robustness and pure robustness. Secondly, as previous works fail to consider robustness about all points in a disturbance interval, we utilise a probably approximately correct (PAC) framework for robustness verification. Additionally, this framework can not only identify potential counterexamples, but also provides interpretable analyses of the original methods. Our approach is applied using a prototype tool named TrajPAC. With TrajPAC, we evaluate the robustness of four state-of-the-art trajectory prediction models -Trajectron++, Mem",
    "link": "http://arxiv.org/abs/2308.05985",
    "context": "Title: TrajPAC: Towards Robustness Verification of Pedestrian Trajectory Prediction Models. (arXiv:2308.05985v1 [cs.AI])\nAbstract: Robust pedestrian trajectory forecasting is crucial to developing safe autonomous vehicles. Although previous works have studied adversarial robustness in the context of trajectory forecasting, some significant issues remain unaddressed. In this work, we try to tackle these crucial problems. Firstly, the previous definitions of robustness in trajectory prediction are ambiguous. We thus provide formal definitions for two kinds of robustness, namely label robustness and pure robustness. Secondly, as previous works fail to consider robustness about all points in a disturbance interval, we utilise a probably approximately correct (PAC) framework for robustness verification. Additionally, this framework can not only identify potential counterexamples, but also provides interpretable analyses of the original methods. Our approach is applied using a prototype tool named TrajPAC. With TrajPAC, we evaluate the robustness of four state-of-the-art trajectory prediction models -Trajectron++, Mem",
    "path": "papers/23/08/2308.05985.json",
    "total_tokens": 1019,
    "translated_title": "运动者轨迹预测模型的鲁棒性验证：TrajPAC",
    "translated_abstract": "鲁棒的行人轨迹预测对于开发安全的自动驾驶车辆至关重要。尽管先前的研究已经研究了轨迹预测中的对抗鲁棒性，但仍存在一些重要的问题尚未解决。本研究试图解决这些关键问题。首先，先前的轨迹预测鲁棒性定义模糊不清，因此我们提供了两种鲁棒性的形式定义，即标签鲁棒性和纯鲁棒性。其次，由于先前的研究未能考虑干扰区间中所有点的鲁棒性，我们采用了一个可能近似正确 (PAC) 的框架进行鲁棒性验证。此外，该框架不仅可以识别潜在的反例，还可以对原始方法进行可解释的分析。我们使用一个名为TrajPAC的原型工具来应用我们的方法。通过TrajPAC，我们评估了四种最先进的轨迹预测模型的鲁棒性- Trajectron++，Mem...",
    "tldr": "本研究提出了一个名为TrajPAC的原型工具，它采用可能近似正确 (PAC) 的框架来验证行人轨迹预测模型的鲁棒性。通过定义标签鲁棒性和纯鲁棒性，并考虑干扰区间中所有点的鲁棒性，TrajPAC不仅可以识别潜在的反例，还可以提供可解释的分析结果。",
    "en_tdlr": "This work proposes a prototype tool called TrajPAC, which utilizes a probably approximately correct (PAC) framework to verify the robustness of pedestrian trajectory prediction models. By defining label robustness and pure robustness, and considering the robustness of all points in a disturbance interval, TrajPAC can not only identify potential counterexamples but also provides interpretable analyses."
}