{
    "title": "Individually Rational Collaborative Vehicle Routing through Give-And-Take Exchanges. (arXiv:2308.16501v1 [cs.MA])",
    "abstract": "In this paper, we are concerned with the automated exchange of orders between logistics companies in a marketplace platform to optimize total revenues. We introduce a novel multi-agent approach to this problem, focusing on the Collaborative Vehicle Routing Problem (CVRP) through the lens of individual rationality. Our proposed algorithm applies the principles of Vehicle Routing Problem (VRP) to pairs of vehicles from different logistics companies, optimizing the overall routes while considering standard VRP constraints plus individual rationality constraints. By facilitating cooperation among competing logistics agents through a Give-and-Take approach, we show that it is possible to reduce travel distance and increase operational efficiency system-wide. More importantly, our approach ensures individual rationality and faster convergence, which are important properties of ensuring the long-term sustainability of the marketplace platform. We demonstrate the efficacy of our approach throu",
    "link": "http://arxiv.org/abs/2308.16501",
    "context": "Title: Individually Rational Collaborative Vehicle Routing through Give-And-Take Exchanges. (arXiv:2308.16501v1 [cs.MA])\nAbstract: In this paper, we are concerned with the automated exchange of orders between logistics companies in a marketplace platform to optimize total revenues. We introduce a novel multi-agent approach to this problem, focusing on the Collaborative Vehicle Routing Problem (CVRP) through the lens of individual rationality. Our proposed algorithm applies the principles of Vehicle Routing Problem (VRP) to pairs of vehicles from different logistics companies, optimizing the overall routes while considering standard VRP constraints plus individual rationality constraints. By facilitating cooperation among competing logistics agents through a Give-and-Take approach, we show that it is possible to reduce travel distance and increase operational efficiency system-wide. More importantly, our approach ensures individual rationality and faster convergence, which are important properties of ensuring the long-term sustainability of the marketplace platform. We demonstrate the efficacy of our approach throu",
    "path": "papers/23/08/2308.16501.json",
    "total_tokens": 884,
    "translated_title": "个体合理的协作车辆路径规划通过给予和接受交换",
    "translated_abstract": "本文关注物流公司之间在市场平台上自动交换订单以优化总收入的问题。我们提出了一种新颖的多智能体方法，着重解决合作车辆路径规划问题（CVRP）并考虑个体合理性。我们的算法将车辆路径规划问题（VRP）的原则应用于来自不同物流公司的车辆对，优化总体路线同时考虑了标准的VRP约束和个体合理性约束。通过促进竞争物流代理之间的合作，我们展示了可以系统性地减少行驶距离并提高运营效率。更重要的是，我们的方法确保了个体合理性和更快的收敛速度，这是确保市场平台的长期可持续性的重要特性。我们通过实验证明了我们方法的有效性。",
    "tldr": "本文关注物流公司间自动交易订单以优化总收入的问题，提出了一种新的多智能体方法来解决合作车辆路径规划问题（CVRP），通过促进竞争物流代理之间的合作，实现减少行驶距离、提高运营效率，并确保个体合理性和更快的收敛速度。"
}