{
    "title": "Balancing Accuracy and Training Time in Federated Learning for Violence Detection in Surveillance Videos: A Study of Neural Network Architectures. (arXiv:2308.05106v1 [cs.CV])",
    "abstract": "This paper presents an investigation into machine learning techniques for violence detection in videos and their adaptation to a federated learning context. The study includes experiments with spatio-temporal features extracted from benchmark video datasets, comparison of different methods, and proposal of a modified version of the \"Flow-Gated\" architecture called \"Diff-Gated.\" Additionally, various machine learning techniques, including super-convergence and transfer learning, are explored, and a method for adapting centralized datasets to a federated learning context is developed. The research achieves better accuracy results compared to state-of-the-art models by training the best violence detection model in a federated learning context.",
    "link": "http://arxiv.org/abs/2308.05106",
    "context": "Title: Balancing Accuracy and Training Time in Federated Learning for Violence Detection in Surveillance Videos: A Study of Neural Network Architectures. (arXiv:2308.05106v1 [cs.CV])\nAbstract: This paper presents an investigation into machine learning techniques for violence detection in videos and their adaptation to a federated learning context. The study includes experiments with spatio-temporal features extracted from benchmark video datasets, comparison of different methods, and proposal of a modified version of the \"Flow-Gated\" architecture called \"Diff-Gated.\" Additionally, various machine learning techniques, including super-convergence and transfer learning, are explored, and a method for adapting centralized datasets to a federated learning context is developed. The research achieves better accuracy results compared to state-of-the-art models by training the best violence detection model in a federated learning context.",
    "path": "papers/23/08/2308.05106.json",
    "total_tokens": 792,
    "translated_title": "在联邦学习中平衡准确性和训练时间：暴力检测在监控视频中的神经网络架构研究",
    "translated_abstract": "本文研究了联邦学习环境下视频暴力检测的机器学习技术以及它们的适应性。研究包括对基准视频数据集中提取的时空特征进行实验，比较不同方法，提出了一种修改版本的“Flow-Gated”架构，称为“Diff-Gated”。此外，探索了多种机器学习技术，包括超收敛和迁移学习，并开发了一种将集中式数据集适应到联邦学习环境的方法。通过在联邦学习环境中训练最佳暴力检测模型，研究实现了比现有模型更好的准确性结果。",
    "tldr": "本文研究了联邦学习环境下视频暴力检测的机器学习技术以及它们的适应性，通过在联邦学习环境中训练最佳暴力检测模型，实现了比现有模型更好的准确性结果。",
    "en_tdlr": "This paper investigates machine learning techniques for violence detection in videos in a federated learning context, achieving better accuracy results compared to existing models by training the best violence detection model in a federated learning environment."
}