{
    "title": "SABRE: Robust Bayesian Peer-to-Peer Federated Learning. (arXiv:2308.02747v1 [cs.LG])",
    "abstract": "We introduce SABRE, a novel framework for robust variational Bayesian peer-to-peer federated learning. We analyze the robustness of the known variational Bayesian peer-to-peer federated learning framework (BayP2PFL) against poisoning attacks and subsequently show that BayP2PFL is not robust against those attacks. The new SABRE aggregation methodology is then devised to overcome the limitations of the existing frameworks. SABRE works well in non-IID settings, does not require the majority of the benign nodes over the compromised ones, and even outperforms the baseline algorithm in benign settings. We theoretically prove the robustness of our algorithm against data / model poisoning attacks in a decentralized linear regression setting. Proof-of-Concept evaluations on benchmark data from image classification demonstrate the superiority of SABRE over the existing frameworks under various poisoning attacks.",
    "link": "http://arxiv.org/abs/2308.02747",
    "context": "Title: SABRE: Robust Bayesian Peer-to-Peer Federated Learning. (arXiv:2308.02747v1 [cs.LG])\nAbstract: We introduce SABRE, a novel framework for robust variational Bayesian peer-to-peer federated learning. We analyze the robustness of the known variational Bayesian peer-to-peer federated learning framework (BayP2PFL) against poisoning attacks and subsequently show that BayP2PFL is not robust against those attacks. The new SABRE aggregation methodology is then devised to overcome the limitations of the existing frameworks. SABRE works well in non-IID settings, does not require the majority of the benign nodes over the compromised ones, and even outperforms the baseline algorithm in benign settings. We theoretically prove the robustness of our algorithm against data / model poisoning attacks in a decentralized linear regression setting. Proof-of-Concept evaluations on benchmark data from image classification demonstrate the superiority of SABRE over the existing frameworks under various poisoning attacks.",
    "path": "papers/23/08/2308.02747.json",
    "total_tokens": 910,
    "translated_title": "SABRE:强鲁棒贝叶斯点对点联邦学习",
    "translated_abstract": "我们引入了SABRE，一种新颖的强鲁棒性变分贝叶斯点对点联邦学习框架。我们分析了已知的变分贝叶斯点对点联邦学习框架（BayP2PFL）的抗攻击性，随后证明了BayP2PFL在面对这些攻击时不具备鲁棒性。然后，我们提出了SABRE聚合方法来克服现有框架的局限性。SABRE在非IID环境中表现良好，不要求大多数良性节点多于受损节点，并且在良性环境下甚至优于基准算法。我们从去中心化线性回归设置中在理论上证明了我们算法对数据/模型攻击的鲁棒性。对基准图像分类数据进行的概念证明评估显示了SABRE在各种攻击下优于现有框架的卓越性能。",
    "tldr": "SABRE是一种强鲁棒性变分贝叶斯点对点联邦学习框架，通过新的聚合方法克服了现有框架的局限性，在非IID环境中表现良好，对数据/模型攻击具备鲁棒性，在图像分类数据上优于现有框架。"
}