{
    "title": "CARE: A Large Scale CT Image Dataset and Clinical Applicable Benchmark Model for Rectal Cancer Segmentation. (arXiv:2308.08283v1 [eess.IV])",
    "abstract": "Rectal cancer segmentation of CT image plays a crucial role in timely clinical diagnosis, radiotherapy treatment, and follow-up. Although current segmentation methods have shown promise in delineating cancerous tissues, they still encounter challenges in achieving high segmentation precision. These obstacles arise from the intricate anatomical structures of the rectum and the difficulties in performing differential diagnosis of rectal cancer. Additionally, a major obstacle is the lack of a large-scale, finely annotated CT image dataset for rectal cancer segmentation. To address these issues, this work introduces a novel large scale rectal cancer CT image dataset CARE with pixel-level annotations for both normal and cancerous rectum, which serves as a valuable resource for algorithm research and clinical application development. Moreover, we propose a novel medical cancer lesion segmentation benchmark model named U-SAM. The model is specifically designed to tackle the challenges posed b",
    "link": "http://arxiv.org/abs/2308.08283",
    "context": "Title: CARE: A Large Scale CT Image Dataset and Clinical Applicable Benchmark Model for Rectal Cancer Segmentation. (arXiv:2308.08283v1 [eess.IV])\nAbstract: Rectal cancer segmentation of CT image plays a crucial role in timely clinical diagnosis, radiotherapy treatment, and follow-up. Although current segmentation methods have shown promise in delineating cancerous tissues, they still encounter challenges in achieving high segmentation precision. These obstacles arise from the intricate anatomical structures of the rectum and the difficulties in performing differential diagnosis of rectal cancer. Additionally, a major obstacle is the lack of a large-scale, finely annotated CT image dataset for rectal cancer segmentation. To address these issues, this work introduces a novel large scale rectal cancer CT image dataset CARE with pixel-level annotations for both normal and cancerous rectum, which serves as a valuable resource for algorithm research and clinical application development. Moreover, we propose a novel medical cancer lesion segmentation benchmark model named U-SAM. The model is specifically designed to tackle the challenges posed b",
    "path": "papers/23/08/2308.08283.json",
    "total_tokens": 954,
    "translated_title": "CARE: 一种用于直肠癌分割的大规模CT图像数据集和临床适用的基准模型",
    "translated_abstract": "CT图像的直肠癌分割在及时临床诊断、放疗治疗和随访中起着至关重要的作用。尽管目前的分割方法在描绘癌组织方面显示出了一定的潜力，但仍然在达到高分割精度方面面临挑战。这些难题源于直肠复杂的解剖结构以及进行直肠癌鉴别诊断的困难。此外，一个主要障碍是缺乏用于直肠癌分割的大规模、精细标注的CT图像数据集。为了解决这些问题，本研究介绍了一种新型的大规模直肠癌CT图像数据集CARE，并提供了正常和癌性直肠的像素级注释，这为算法研究和临床应用开发提供了宝贵的资源。此外，我们提出了一种名为U-SAM的新型医学癌症病变分割基准模型。该模型专门设计用于应对所面临的挑战。",
    "tldr": "CARE是一种提供了大规模直肠癌CT图像数据集和临床适用的基准模型的研究。这个数据集提供了正常和癌性直肠的像素级注释，为算法研究和临床应用开发提供了宝贵的资源。",
    "en_tdlr": "The research introduces CARE, a large-scale rectal cancer CT image dataset and a benchmark model for clinical application. The dataset provides pixel-level annotations for both normal and cancerous rectum, serving as a valuable resource for algorithm research and clinical application development."
}