{
    "title": "Entire Space Cascade Delayed Feedback Modeling for Effective Conversion Rate Prediction. (arXiv:2308.04768v1 [cs.IR])",
    "abstract": "Conversion rate (CVR) prediction is an essential task for large-scale e-commerce platforms. However, refund behaviors frequently occur after conversion in online shopping systems, which drives us to pay attention to effective conversion for building healthier shopping services. This paper defines the probability of item purchasing without any subsequent refund as an effective conversion rate (ECVR). A simple paradigm for ECVR prediction is to decompose it into two sub-tasks: CVR prediction and post-conversion refund rate (RFR) prediction. However, RFR prediction suffers from data sparsity (DS) and sample selection bias (SSB) issues, as the refund behaviors are only available after user purchase. Furthermore, there is delayed feedback in both conversion and refund events and they are sequentially dependent, named cascade delayed feedback (CDF), which significantly harms data freshness for model training. Previous studies mainly focus on tackling DS and SSB or delayed feedback for a sing",
    "link": "http://arxiv.org/abs/2308.04768",
    "context": "Title: Entire Space Cascade Delayed Feedback Modeling for Effective Conversion Rate Prediction. (arXiv:2308.04768v1 [cs.IR])\nAbstract: Conversion rate (CVR) prediction is an essential task for large-scale e-commerce platforms. However, refund behaviors frequently occur after conversion in online shopping systems, which drives us to pay attention to effective conversion for building healthier shopping services. This paper defines the probability of item purchasing without any subsequent refund as an effective conversion rate (ECVR). A simple paradigm for ECVR prediction is to decompose it into two sub-tasks: CVR prediction and post-conversion refund rate (RFR) prediction. However, RFR prediction suffers from data sparsity (DS) and sample selection bias (SSB) issues, as the refund behaviors are only available after user purchase. Furthermore, there is delayed feedback in both conversion and refund events and they are sequentially dependent, named cascade delayed feedback (CDF), which significantly harms data freshness for model training. Previous studies mainly focus on tackling DS and SSB or delayed feedback for a sing",
    "path": "papers/23/08/2308.04768.json",
    "total_tokens": 926,
    "translated_title": "有效的转化率预测的整体空间级联延迟反馈建模",
    "translated_abstract": "转化率预测是大规模电子商务平台的重要任务。然而，在在线购物系统中，经常发生转化后的退款行为，这促使我们关注于构建更健康的购物服务的有效转化率。本文将没有任何后续退款的物品购买的概率定义为有效转化率。有效转化率预测的简单范式是将其分解为两个子任务：转化率预测和转化后退款率预测。然而，转化后退款率预测存在数据稀疏性和样本选择偏差问题，因为退款行为只有在用户购买后才可见。此外，转化和退款事件中存在延迟反馈，它们是顺序依赖的，被称为级联延迟反馈，这对模型训练的数据新鲜度造成了很大的伤害。先前的研究主要集中于解决数据稀疏性、样本选择偏差或延迟反馈的问题。",
    "tldr": "本文提出了一种整体空间级联延迟反馈建模方法来解决有效转化率预测问题，该方法能够处理转化后退款率预测中的数据稀疏性和样本选择偏差，并利用级联延迟反馈的信息提高模型训练的数据新鲜度。",
    "en_tdlr": "This paper proposes an entire space cascade delayed feedback modeling approach to address the issue of effective conversion rate prediction, which can handle data sparsity and sample selection bias in post-conversion refund rate prediction, and utilize cascade delayed feedback information to improve data freshness for model training."
}