{
    "title": "Large Language Models at Work in China's Labor Market. (arXiv:2308.08776v1 [econ.GN])",
    "abstract": "This paper explores the potential impacts of large language models (LLMs) on the Chinese labor market. We analyze occupational exposure to LLM capabilities by incorporating human expertise and LLM classifications, following Eloundou et al. (2023)'s methodology. We then aggregate occupation exposure to the industry level to obtain industry exposure scores. The results indicate a positive correlation between occupation exposure and wage levels/experience premiums, suggesting higher-paying and experience-intensive jobs may face greater displacement risks from LLM-powered software. The industry exposure scores align with expert assessments and economic intuitions. We also develop an economic growth model incorporating industry exposure to quantify the productivity-employment trade-off from AI adoption. Overall, this study provides an analytical basis for understanding the labor market impacts of increasingly capable AI systems in China. Key innovations include the occupation-level exposure",
    "link": "http://arxiv.org/abs/2308.08776",
    "context": "Title: Large Language Models at Work in China's Labor Market. (arXiv:2308.08776v1 [econ.GN])\nAbstract: This paper explores the potential impacts of large language models (LLMs) on the Chinese labor market. We analyze occupational exposure to LLM capabilities by incorporating human expertise and LLM classifications, following Eloundou et al. (2023)'s methodology. We then aggregate occupation exposure to the industry level to obtain industry exposure scores. The results indicate a positive correlation between occupation exposure and wage levels/experience premiums, suggesting higher-paying and experience-intensive jobs may face greater displacement risks from LLM-powered software. The industry exposure scores align with expert assessments and economic intuitions. We also develop an economic growth model incorporating industry exposure to quantify the productivity-employment trade-off from AI adoption. Overall, this study provides an analytical basis for understanding the labor market impacts of increasingly capable AI systems in China. Key innovations include the occupation-level exposure",
    "path": "papers/23/08/2308.08776.json",
    "total_tokens": 1066,
    "translated_title": "大型语言模型在中国劳动市场的应用",
    "translated_abstract": "本文探讨了大型语言模型（LLMs）对中国劳动市场的潜在影响。我们通过结合人类专业知识和LLM分类，按照Eloundou等人（2023）的方法分析了职业对LLM能力的暴露程度。然后将职业暴露程度聚合到行业水平上，得到行业暴露得分。结果表明，职业暴露和工资水平/经验溢价之间存在正相关关系，表明高薪和经验密集型的工作可能面临着LLM驱动软件的更大替代风险。行业暴露得分与专家评估和经济直觉相一致。我们还开发了一个考虑行业暴露的经济增长模型，以量化AI采用带来的生产力和就业之间的权衡。总体来说，本研究为理解中国越来越强大的AI系统对劳动市场的影响提供了分析基础。主要创新包括职业水平的暴露情况。",
    "tldr": "本文研究了大型语言模型（LLMs）对中国劳动市场的潜在影响，并分析了职业对LLM能力的暴露程度及其与工资水平和经验溢价之间的关系。研究结果表明，高薪和经验密集型工作可能面临更大的替代风险。此外，研究还开发了一个考虑行业暴露的经济增长模型，以量化AI采用对生产力和就业之间的权衡。这项研究为理解中国劳动市场中越来越强大的AI系统的影响提供了基础。",
    "en_tdlr": "This paper explores the potential impacts of large language models (LLMs) on the Chinese labor market and analyzes the occupational exposure to LLM capabilities as well as the relationship between exposure and wage levels and experience premiums. The study finds that higher-paying and experience-intensive jobs may face greater displacement risks. Additionally, an economic growth model is developed to quantify the productivity-employment trade-off from AI adoption. The study provides a foundation for understanding the effects of increasingly capable AI systems in China's labor market."
}