{
    "title": "Perceptions of the Fourth Industrial Revolution and Artificial Intelligence Impact on Society. (arXiv:2308.02030v1 [cs.CY])",
    "abstract": "The Fourth Industrial Revolution, particularly Artificial Intelligence (AI), has had a profound impact on society, raising concerns about its implications and ethical considerations. The emergence of text generative AI tools like ChatGPT has further intensified concerns regarding ethics, security, privacy, and copyright. This study aims to examine the perceptions of individuals in different information flow categorizations toward AI. The results reveal key themes in participant-supplied definitions of AI and the fourth industrial revolution, emphasizing the replication of human intelligence, machine learning, automation, and the integration of digital technologies. Participants expressed concerns about job replacement, privacy invasion, and inaccurate information provided by AI. However, they also recognized the benefits of AI, such as solving complex problems and increasing convenience. Views on government involvement in shaping the fourth industrial revolution varied, with some advoc",
    "link": "http://arxiv.org/abs/2308.02030",
    "context": "Title: Perceptions of the Fourth Industrial Revolution and Artificial Intelligence Impact on Society. (arXiv:2308.02030v1 [cs.CY])\nAbstract: The Fourth Industrial Revolution, particularly Artificial Intelligence (AI), has had a profound impact on society, raising concerns about its implications and ethical considerations. The emergence of text generative AI tools like ChatGPT has further intensified concerns regarding ethics, security, privacy, and copyright. This study aims to examine the perceptions of individuals in different information flow categorizations toward AI. The results reveal key themes in participant-supplied definitions of AI and the fourth industrial revolution, emphasizing the replication of human intelligence, machine learning, automation, and the integration of digital technologies. Participants expressed concerns about job replacement, privacy invasion, and inaccurate information provided by AI. However, they also recognized the benefits of AI, such as solving complex problems and increasing convenience. Views on government involvement in shaping the fourth industrial revolution varied, with some advoc",
    "path": "papers/23/08/2308.02030.json",
    "total_tokens": 898,
    "translated_title": "对第四次工业革命和人工智能对社会的影响的看法",
    "translated_abstract": "第四次工业革命，尤其是人工智能（AI），对社会产生了深远影响，引发了对其影响和伦理考虑的担忧。文本生成AI工具（如ChatGPT）的出现进一步加剧了人们对伦理、安全、隐私和版权的担忧。本研究旨在研究不同信息流分类的个体对AI的看法。结果揭示了参与者提供的AI和第四次工业革命的定义中的关键主题，强调了人工智能的复制、机器学习、自动化和数字技术的整合。参与者对AI替代工作岗位、侵犯隐私以及AI提供的不准确信息表示担忧。然而，他们也认识到AI的好处，如解决复杂问题和增加便利。关于政府在塑造第四次工业革命方面的参与，意见不一。",
    "tldr": "本研究调查了不同信息流分类下个体对AI的看法，结果显示参与者关注AI对就业、隐私和信息准确性的影响。然而，他们也认识到AI能够解决复杂问题和增加便利。对于政府在第四次工业革命中的角色，意见各异。"
}