{
    "title": "A data-centric deep learning approach to airway segmentation. (arXiv:2308.00008v1 [eess.IV])",
    "abstract": "The morphology and distribution of airway tree abnormalities enables diagnosis and disease characterisation across a variety of chronic respiratory conditions. In this regard, airway segmentation plays a critical role in the production of the outline of the entire airway tree to enable estimation of disease extent and severity. In this study, we propose a data-centric deep learning technique to segment the airway tree. The proposed technique utilises interpolation and image split to improve data usefulness and quality. Then, an ensemble learning strategy is implemented to aggregate the segmented airway trees at different scales. In terms of segmentation performance (dice similarity coefficient), our method outperforms the baseline model by 2.5% on average when a combined loss is used. Further, our proposed technique has a low GPU usage and high flexibility enabling it to be deployed on any 2D deep learning model.",
    "link": "http://arxiv.org/abs/2308.00008",
    "context": "Title: A data-centric deep learning approach to airway segmentation. (arXiv:2308.00008v1 [eess.IV])\nAbstract: The morphology and distribution of airway tree abnormalities enables diagnosis and disease characterisation across a variety of chronic respiratory conditions. In this regard, airway segmentation plays a critical role in the production of the outline of the entire airway tree to enable estimation of disease extent and severity. In this study, we propose a data-centric deep learning technique to segment the airway tree. The proposed technique utilises interpolation and image split to improve data usefulness and quality. Then, an ensemble learning strategy is implemented to aggregate the segmented airway trees at different scales. In terms of segmentation performance (dice similarity coefficient), our method outperforms the baseline model by 2.5% on average when a combined loss is used. Further, our proposed technique has a low GPU usage and high flexibility enabling it to be deployed on any 2D deep learning model.",
    "path": "papers/23/08/2308.00008.json",
    "total_tokens": 894,
    "translated_title": "基于数据的深度学习方法进行气道分割",
    "translated_abstract": "气道树异常的形态和分布可以用于诊断和疾病表征各种慢性呼吸状况。在这方面，气道分割在生成整个气道树轮廓以估计疾病范围和严重程度方面起着关键作用。在本研究中，我们提出了一种基于数据的深度学习技术来分割气道树。所提出的技术利用插值和图像分割来提高数据的有用性和质量。然后，我们实施了一个集成学习策略来聚合不同尺度下的分割的气道树。在分割性能方面（Dice相似系数），当使用组合损失时，我们的方法平均优于基线模型2.5%。此外，我们提出的技术使用GPU较少，灵活性高，可以部署在任何2D深度学习模型上。",
    "tldr": "我们提出了一种基于数据的深度学习技术来进行气道分割，通过插值和图像分割提高数据质量，采用集成学习策略在多个尺度上聚合气道树，性能优于基线模型，适用于任何2D深度学习模型。",
    "en_tdlr": "We propose a data-centric deep learning technique for airway segmentation that improves data quality through interpolation and image split, aggregates airway trees at different scales using an ensemble learning strategy, and outperforms the baseline model, suitable for any 2D deep learning model."
}