{
    "title": "Natural Quantum Monte Carlo Computation of Excited States. (arXiv:2308.16848v1 [physics.comp-ph])",
    "abstract": "We present a variational Monte Carlo algorithm for estimating the lowest excited states of a quantum system which is a natural generalization of the estimation of ground states. The method has no free parameters and requires no explicit orthogonalization of the different states, instead transforming the problem of finding excited states of a given system into that of finding the ground state of an expanded system. Expected values of arbitrary observables can be calculated, including off-diagonal expectations between different states such as the transition dipole moment. Although the method is entirely general, it works particularly well in conjunction with recent work on using neural networks as variational Ansatze for many-electron systems, and we show that by combining this method with the FermiNet and Psiformer Ansatze we can accurately recover vertical excitation energies and oscillator strengths on molecules as large as benzene. Beyond the examples on molecules presented here, we ",
    "link": "http://arxiv.org/abs/2308.16848",
    "context": "Title: Natural Quantum Monte Carlo Computation of Excited States. (arXiv:2308.16848v1 [physics.comp-ph])\nAbstract: We present a variational Monte Carlo algorithm for estimating the lowest excited states of a quantum system which is a natural generalization of the estimation of ground states. The method has no free parameters and requires no explicit orthogonalization of the different states, instead transforming the problem of finding excited states of a given system into that of finding the ground state of an expanded system. Expected values of arbitrary observables can be calculated, including off-diagonal expectations between different states such as the transition dipole moment. Although the method is entirely general, it works particularly well in conjunction with recent work on using neural networks as variational Ansatze for many-electron systems, and we show that by combining this method with the FermiNet and Psiformer Ansatze we can accurately recover vertical excitation energies and oscillator strengths on molecules as large as benzene. Beyond the examples on molecules presented here, we ",
    "path": "papers/23/08/2308.16848.json",
    "total_tokens": 946,
    "translated_title": "量子系统中激发态的自然量子蒙特卡洛计算",
    "translated_abstract": "我们提出了一种变分蒙特卡洛算法，用于估计量子系统的最低激发态，这是对寻找基态的估计的自然推广。该方法没有自由参数，并且不需要显式正交化不同的态，而是将寻找给定系统的激发态的问题转化为寻找扩展系统的基态的问题。可以计算任意可观测量的期望值，包括不同态之间的非对角线期望值，如跃迁偶极矩。尽管该方法完全通用，但与最近关于使用神经网络作为多电子系统变分参数的工作结合使用效果特别好，我们展示了通过将该方法与FermiNet和Psiformer变分参数结合使用，可以准确地恢复苯等大分子的垂直激发能和振子强度。除了在分子上的示例之外，我们还...",
    "tldr": "该论文提出了一种变分蒙特卡洛算法，用于估计量子系统中的激发态，通过转化问题使其成为寻找扩展系统的基态的问题。这种方法特别适用于多电子系统，并且可以准确地计算各种可观测量的期望值，包括非对角线期望值和跃迁偶极矩，并在苯等大分子上得到了良好的结果。",
    "en_tdlr": "This paper presents a variational Monte Carlo algorithm for estimating excited states in quantum systems, which transforms the problem into finding the ground state of an expanded system. It works well for many-electron systems and can accurately calculate expected values of different observables, including off-diagonal expectations and transition dipole moments, with successful results on large molecules like benzene."
}