{
    "title": "Data-Driven Identification of Quadratic Symplectic Representations of Nonlinear Hamiltonian Systems. (arXiv:2308.01084v1 [cs.LG])",
    "abstract": "We present a framework for learning Hamiltonian systems using data. This work is based on the lifting hypothesis, which posits that nonlinear Hamiltonian systems can be written as nonlinear systems with cubic Hamiltonians. By leveraging this, we obtain quadratic dynamics that are Hamiltonian in a transformed coordinate system. To that end, for given generalized position and momentum data, we propose a methodology to learn quadratic dynamical systems, enforcing the Hamiltonian structure in combination with a symplectic auto-encoder. The enforced Hamiltonian structure exhibits long-term stability of the system, while the cubic Hamiltonian function provides relatively low model complexity. For low-dimensional data, we determine a higher-order transformed coordinate system, whereas, for high-dimensional data, we find a lower-order coordinate system with the desired properties. We demonstrate the proposed methodology by means of both low-dimensional and high-dimensional nonlinear Hamiltonia",
    "link": "http://arxiv.org/abs/2308.01084",
    "context": "Title: Data-Driven Identification of Quadratic Symplectic Representations of Nonlinear Hamiltonian Systems. (arXiv:2308.01084v1 [cs.LG])\nAbstract: We present a framework for learning Hamiltonian systems using data. This work is based on the lifting hypothesis, which posits that nonlinear Hamiltonian systems can be written as nonlinear systems with cubic Hamiltonians. By leveraging this, we obtain quadratic dynamics that are Hamiltonian in a transformed coordinate system. To that end, for given generalized position and momentum data, we propose a methodology to learn quadratic dynamical systems, enforcing the Hamiltonian structure in combination with a symplectic auto-encoder. The enforced Hamiltonian structure exhibits long-term stability of the system, while the cubic Hamiltonian function provides relatively low model complexity. For low-dimensional data, we determine a higher-order transformed coordinate system, whereas, for high-dimensional data, we find a lower-order coordinate system with the desired properties. We demonstrate the proposed methodology by means of both low-dimensional and high-dimensional nonlinear Hamiltonia",
    "path": "papers/23/08/2308.01084.json",
    "total_tokens": 914,
    "translated_title": "基于数据的非线性哈密顿系统二次辛表示的数据驱动识别",
    "translated_abstract": "我们提出了一个利用数据学习哈密顿系统的框架。这项工作基于提升假设，即非线性哈密顿系统可以写成具有立方哈密顿量的非线性系统。通过利用这一点，我们得到在变换的坐标系下具有哈密顿结构的二次动力学。为了达到这个目标，对于给定的广义位置和动量数据，我们提出了一种学习二次动力学系统的方法，结合辛自编码器强制实施哈密顿结构。强制实施的哈密顿结构表现出系统的长期稳定性，而立方哈密顿函数提供了相对较低的模型复杂性。对于低维数据，我们确定了一个高阶变换的坐标系，而对于高维数据，我们找到了一个具有所需特性的低阶坐标系。我们通过低维和高维的非线性哈密顿系统示例展示了所提出的方法。",
    "tldr": "本论文提出了一种基于数据的方法来学习哈密顿系统，利用提升假设，通过强制实施哈密顿结构和使用辛自编码器，我们实现了在变换的坐标系下具有哈密顿结构的二次动力学，保持系统的长期稳定性和较低的模型复杂度。",
    "en_tdlr": "This paper presents a data-driven approach for learning Hamiltonian systems by enforcing Hamiltonian structure with the lifting hypothesis and utilizing a symplectic auto-encoder, resulting in quadratic dynamics with long-term stability and relatively low model complexity in a transformed coordinate system."
}