{
    "title": "A transport approach to sequential simulation-based inference. (arXiv:2308.13940v1 [stat.ME])",
    "abstract": "We present a new transport-based approach to efficiently perform sequential Bayesian inference of static model parameters. The strategy is based on the extraction of conditional distribution from the joint distribution of parameters and data, via the estimation of structured (e.g., block triangular) transport maps. This gives explicit surrogate models for the likelihood functions and their gradients. This allow gradient-based characterizations of posterior density via transport maps in a model-free, online phase. This framework is well suited for parameter estimation in case of complex noise models including nuisance parameters and when the forward model is only known as a black box. The numerical application of this method is performed in the context of characterization of ice thickness with conductivity measurements.",
    "link": "http://arxiv.org/abs/2308.13940",
    "context": "Title: A transport approach to sequential simulation-based inference. (arXiv:2308.13940v1 [stat.ME])\nAbstract: We present a new transport-based approach to efficiently perform sequential Bayesian inference of static model parameters. The strategy is based on the extraction of conditional distribution from the joint distribution of parameters and data, via the estimation of structured (e.g., block triangular) transport maps. This gives explicit surrogate models for the likelihood functions and their gradients. This allow gradient-based characterizations of posterior density via transport maps in a model-free, online phase. This framework is well suited for parameter estimation in case of complex noise models including nuisance parameters and when the forward model is only known as a black box. The numerical application of this method is performed in the context of characterization of ice thickness with conductivity measurements.",
    "path": "papers/23/08/2308.13940.json",
    "total_tokens": 814,
    "translated_title": "使用运输方法进行顺序基于模拟的推断",
    "translated_abstract": "我们提出了一种新的基于运输的方法，用于高效地进行静态模型参数的顺序贝叶斯推断。该策略基于从参数和数据的联合分布中提取条件分布，通过估计结构化（例如，块三角形）运输映射来实现。这为似然函数及其梯度提供了明确的代理模型。这允许在模型无关、在线阶段通过运输映射进行基于梯度的后验密度表征。这个框架非常适用于复杂噪声模型（包括干扰参数）和仅作为黑箱的正向模型的参数估计。我们在使用电导率测量来表征冰厚度的情况下对该方法进行了数值应用。",
    "tldr": "提出了一种新的基于运输的方法，用于高效地进行静态模型参数的顺序贝叶斯推断。该方法可以处理包括干扰参数的复杂噪声模型，并且适用于仅作为黑箱的正向模型。数值应用表明该方法在使用电导率测量来表征冰厚度的情况下是有效的。",
    "en_tdlr": "A new transport-based approach is proposed for efficient sequential Bayesian inference of static model parameters. The method can handle complex noise models including nuisance parameters and is suitable for forward models known only as black boxes. Numerical application demonstrates the effectiveness of the method in characterizing ice thickness using conductivity measurements."
}