{
    "title": "Persistent learning signals and working memory without continuous attractors. (arXiv:2308.12585v1 [q-bio.NC])",
    "abstract": "Neural dynamical systems with stable attractor structures, such as point attractors and continuous attractors, are hypothesized to underlie meaningful temporal behavior that requires working memory. However, working memory may not support useful learning signals necessary to adapt to changes in the temporal structure of the environment. We show that in addition to the continuous attractors that are widely implicated, periodic and quasi-periodic attractors can also support learning arbitrarily long temporal relationships. Unlike the continuous attractors that suffer from the fine-tuning problem, the less explored quasi-periodic attractors are uniquely qualified for learning to produce temporally structured behavior. Our theory has broad implications for the design of artificial learning systems and makes predictions about observable signatures of biological neural dynamics that can support temporal dependence learning and working memory. Based on our theory, we developed a new initializ",
    "link": "http://arxiv.org/abs/2308.12585",
    "context": "Title: Persistent learning signals and working memory without continuous attractors. (arXiv:2308.12585v1 [q-bio.NC])\nAbstract: Neural dynamical systems with stable attractor structures, such as point attractors and continuous attractors, are hypothesized to underlie meaningful temporal behavior that requires working memory. However, working memory may not support useful learning signals necessary to adapt to changes in the temporal structure of the environment. We show that in addition to the continuous attractors that are widely implicated, periodic and quasi-periodic attractors can also support learning arbitrarily long temporal relationships. Unlike the continuous attractors that suffer from the fine-tuning problem, the less explored quasi-periodic attractors are uniquely qualified for learning to produce temporally structured behavior. Our theory has broad implications for the design of artificial learning systems and makes predictions about observable signatures of biological neural dynamics that can support temporal dependence learning and working memory. Based on our theory, we developed a new initializ",
    "path": "papers/23/08/2308.12585.json",
    "total_tokens": 909,
    "translated_title": "没有连续吸引子的持久学习信号和工作记忆",
    "translated_abstract": "稳定吸引子结构的神经动力系统，如点吸引子和连续吸引子，被假设为支持需要工作记忆的有意义时间行为的基础。然而，工作记忆可能不支持适应环境时间结构变化所需的有用学习信号。我们展示了除了广泛涉及的连续吸引子外，周期性和准周期性吸引子也可以支持学习任意长的时间关系。与受到微调问题困扰的连续吸引子不同，较少被探索的准周期性吸引子有独特的学习产生时间结构化行为的能力。我们的理论对于人工学习系统的设计具有广泛的影响，并对能够支持时间关联学习和工作记忆的生物神经动力学的可观测特征提出预测。",
    "tldr": "本研究发现，在神经动力系统中，除了广泛研究的连续吸引子外，周期性和准周期性吸引子也可以支持学习时间关系。相比于连续吸引子，准周期性吸引子更适合学习产生时间结构化行为，并且对于人工学习系统的设计和生物神经动力学的可观测特征都有重要意义。",
    "en_tdlr": "This study finds that besides continuous attractors, periodic and quasi-periodic attractors can also support learning of temporal relationships. Quasi-periodic attractors are uniquely suited for learning temporally structured behavior and have implications for the design of artificial learning systems and observable features of biological neural dynamics."
}