{
    "title": "AI Hilbert: A New Paradigm for Scientific Discovery by Unifying Data and Background Knowledge. (arXiv:2308.09474v2 [cs.AI] UPDATED)",
    "abstract": "The discovery of scientific formulae that parsimoniously explain natural phenomena and align with existing background theory is a key goal in science. Historically, scientists have derived natural laws by manipulating equations based on existing knowledge, forming new equations, and verifying them experimentally. In recent years, data-driven scientific discovery has emerged as a viable competitor in settings with large amounts of experimental data. Unfortunately, data-driven methods often fail to discover valid laws when data is noisy or scarce. Accordingly, recent works combine regression and reasoning to eliminate formulae inconsistent with background theory. However, the problem of searching over the space of formulae consistent with background theory to find one that fits the data best is not well-solved. We propose a solution to this problem when all axioms and scientific laws are expressible via polynomial equalities and inequalities and argue that our approach is widely applicab",
    "link": "http://arxiv.org/abs/2308.09474",
    "context": "Title: AI Hilbert: A New Paradigm for Scientific Discovery by Unifying Data and Background Knowledge. (arXiv:2308.09474v2 [cs.AI] UPDATED)\nAbstract: The discovery of scientific formulae that parsimoniously explain natural phenomena and align with existing background theory is a key goal in science. Historically, scientists have derived natural laws by manipulating equations based on existing knowledge, forming new equations, and verifying them experimentally. In recent years, data-driven scientific discovery has emerged as a viable competitor in settings with large amounts of experimental data. Unfortunately, data-driven methods often fail to discover valid laws when data is noisy or scarce. Accordingly, recent works combine regression and reasoning to eliminate formulae inconsistent with background theory. However, the problem of searching over the space of formulae consistent with background theory to find one that fits the data best is not well-solved. We propose a solution to this problem when all axioms and scientific laws are expressible via polynomial equalities and inequalities and argue that our approach is widely applicab",
    "path": "papers/23/08/2308.09474.json",
    "total_tokens": 861,
    "translated_title": "AI Hilbert: 整合数据与背景知识的科学发现新范式",
    "translated_abstract": "在科学中，发现能简单解释自然现象并与现有背景理论一致的科学公式是一个关键目标。过去，科学家通过操作基于现有知识的方程式、形成新方程式并进行实验验证来推导自然规律。近年来，数据驱动的科学发现已成为在具有大量实验数据的情境中的一种可行竞争方式。然而，当数据嘈杂或稀缺时，数据驱动的方法通常无法发现有效的规律。因此，最近的研究将回归和推理结合起来以剔除与背景理论不一致的公式。然而，在与背景理论一致的方程空间中搜索出最符合数据的公式仍存在问题。我们提出了一种解决方案，当所有公理和科学定律都可以通过多项式等式和不等式来表达时，我们的方法被认为是广泛适用的。",
    "tldr": "AI Hilbert提出了一种整合数据与背景知识的科学发现新范式，通过将回归和推理相结合，解决了在搜索与背景理论一致的公式空间中找到最符合数据的公式的问题。",
    "en_tdlr": "AI Hilbert proposes a new paradigm for scientific discovery by unifying data and background knowledge, addressing the problem of searching for the best fitting formula in the space consistent with background theory through combining regression and reasoning."
}