{
    "title": "Dynamic landslide susceptibility mapping over recent three decades to uncover variations in landslide causes in subtropical urban mountainous areas. (arXiv:2308.11929v1 [cs.LG])",
    "abstract": "Landslide susceptibility assessment (LSA) is of paramount importance in mitigating landslide risks. Recently, there has been a surge in the utilization of data-driven methods for predicting landslide susceptibility due to the growing availability of aerial and satellite data. Nonetheless, the rapid oscillations within the landslide-inducing environment (LIE), primarily due to significant changes in external triggers such as rainfall, pose difficulties for contemporary data-driven LSA methodologies to accommodate LIEs over diverse timespans. This study presents dynamic landslide susceptibility mapping that simply employs multiple predictive models for annual LSA. In practice, this will inevitably encounter small sample problems due to the limited number of landslide samples in certain years. Another concern arises owing to the majority of the existing LSA approaches train black-box models to fit distinct datasets, yet often failing in generalization and providing comprehensive explanati",
    "link": "http://arxiv.org/abs/2308.11929",
    "context": "Title: Dynamic landslide susceptibility mapping over recent three decades to uncover variations in landslide causes in subtropical urban mountainous areas. (arXiv:2308.11929v1 [cs.LG])\nAbstract: Landslide susceptibility assessment (LSA) is of paramount importance in mitigating landslide risks. Recently, there has been a surge in the utilization of data-driven methods for predicting landslide susceptibility due to the growing availability of aerial and satellite data. Nonetheless, the rapid oscillations within the landslide-inducing environment (LIE), primarily due to significant changes in external triggers such as rainfall, pose difficulties for contemporary data-driven LSA methodologies to accommodate LIEs over diverse timespans. This study presents dynamic landslide susceptibility mapping that simply employs multiple predictive models for annual LSA. In practice, this will inevitably encounter small sample problems due to the limited number of landslide samples in certain years. Another concern arises owing to the majority of the existing LSA approaches train black-box models to fit distinct datasets, yet often failing in generalization and providing comprehensive explanati",
    "path": "papers/23/08/2308.11929.json",
    "total_tokens": 847,
    "translated_title": "近30年来动态山地城市地区滑坡易发性制图揭示滑坡成因的变化情况",
    "translated_abstract": "滑坡易发性评估对于减轻滑坡风险至关重要。随着空中和卫星数据的日益丰富，基于数据驱动方法预测滑坡易发性的应用不断增加。然而，滑坡诱发环境（LIE）内的快速波动，主要是由于降雨等外部触发因素的显著变化，给当前数据驱动的LSA方法在不同时间段内适应LIE带来困难。本研究提出了动态滑坡易发性制图，简单地利用多种预测模型进行年度LSA。实践中，由于某些年份滑坡样本数量有限，不可避免地会遇到小样本问题。另一个问题是，现有的LSA方法大多采用训练黑盒模型以适应不同数据集，但往往在泛化和提供全面解释方面存在问题。",
    "tldr": "该研究提出了一种动态滑坡易发性制图方法，通过多个预测模型进行年度评估，并解决了小样本和泛化问题。",
    "en_tdlr": "This study presents a dynamic landslide susceptibility mapping method that utilizes multiple predictive models for annual assessment, addressing the issues of small sample size and generalization."
}