{
    "title": "An Ensemble Approach to Personalized Real Time Predictive Writing for Experts. (arXiv:2308.13576v1 [cs.CL])",
    "abstract": "Completing a sentence, phrase or word after typing few words / characters is very helpful for Intuit financial experts, while taking notes or having a live chat with users, since they need to write complex financial concepts more efficiently and accurately many times in a day. In this paper, we tie together different approaches like large language models, traditional Markov Models and char level models to create an end-to-end system to provide personalised sentence/word auto-complete suggestions to experts, under strict latency constraints. Proposed system can auto-complete sentences, phrases or words while writing with personalisation and can be trained with very less data and resources with good efficiency. Our proposed system is not only efficient and personalized but also robust as it leverages multiple machine learning techniques along with transfer learning approach to fine tune large language model with Intuit specific data. This ensures that even in cases of rare or unusual phr",
    "link": "http://arxiv.org/abs/2308.13576",
    "context": "Title: An Ensemble Approach to Personalized Real Time Predictive Writing for Experts. (arXiv:2308.13576v1 [cs.CL])\nAbstract: Completing a sentence, phrase or word after typing few words / characters is very helpful for Intuit financial experts, while taking notes or having a live chat with users, since they need to write complex financial concepts more efficiently and accurately many times in a day. In this paper, we tie together different approaches like large language models, traditional Markov Models and char level models to create an end-to-end system to provide personalised sentence/word auto-complete suggestions to experts, under strict latency constraints. Proposed system can auto-complete sentences, phrases or words while writing with personalisation and can be trained with very less data and resources with good efficiency. Our proposed system is not only efficient and personalized but also robust as it leverages multiple machine learning techniques along with transfer learning approach to fine tune large language model with Intuit specific data. This ensures that even in cases of rare or unusual phr",
    "path": "papers/23/08/2308.13576.json",
    "total_tokens": 909,
    "translated_title": "个性化实时预测写作的集成方法对于专家",
    "translated_abstract": "在与用户进行笔记或实时聊天时，对于Intuit金融专家来说，在输入一些单词/字符后补全一个句子、短语或单词对于他们非常有帮助，因为他们需要在一天中多次高效准确地写入复杂的金融概念。在本文中，我们将大型语言模型、传统马尔可夫模型和字符级模型结合起来，创建了一个端到端系统，以在严格的延迟约束下为专家提供个性化的句子/单词自动补全建议。所提出的系统可以在书写时自动补全句子、短语或单词，并且可以通过很少的数据和资源进行训练，并具有良好的效率。我们提出的系统不仅高效和个性化，而且具有鲁棒性，因为它利用多种机器学习技术以及基于转移学习的方法通过Intuit特定数据微调大型语言模型。这确保即使在罕见或不寻常的短语情况下也能有效运行。",
    "tldr": "本文介绍了一种集成方法，通过结合大型语言模型、马尔可夫模型和字符级模型，提供个性化的句子/单词自动补全建议，并在严格的延迟约束下实现高效准确的写作体验。"
}