{
    "title": "Online Job Failure Prediction in an HPC System. (arXiv:2308.15481v1 [cs.DC])",
    "abstract": "Modern High Performance Computing (HPC) systems are complex machines, with major impacts on economy and society. Along with their computational capability, their energy consumption is also steadily raising, representing a critical issue given the ongoing environmental and energetic crisis. Therefore, developing strategies to optimize HPC system management has paramount importance, both to guarantee top-tier performance and to improve energy efficiency. One strategy is to act at the workload level and highlight the jobs that are most likely to fail, prior to their execution on the system. Jobs failing during their execution unnecessarily occupy resources which could delay other jobs, adversely affecting the system performance and energy consumption. In this paper, we study job failure prediction at submit-time using classical machine learning algorithms. Our novelty lies in (i) the combination of these algorithms with Natural Language Processing (NLP) tools to represent jobs and (ii) th",
    "link": "http://arxiv.org/abs/2308.15481",
    "context": "Title: Online Job Failure Prediction in an HPC System. (arXiv:2308.15481v1 [cs.DC])\nAbstract: Modern High Performance Computing (HPC) systems are complex machines, with major impacts on economy and society. Along with their computational capability, their energy consumption is also steadily raising, representing a critical issue given the ongoing environmental and energetic crisis. Therefore, developing strategies to optimize HPC system management has paramount importance, both to guarantee top-tier performance and to improve energy efficiency. One strategy is to act at the workload level and highlight the jobs that are most likely to fail, prior to their execution on the system. Jobs failing during their execution unnecessarily occupy resources which could delay other jobs, adversely affecting the system performance and energy consumption. In this paper, we study job failure prediction at submit-time using classical machine learning algorithms. Our novelty lies in (i) the combination of these algorithms with Natural Language Processing (NLP) tools to represent jobs and (ii) th",
    "path": "papers/23/08/2308.15481.json",
    "total_tokens": 841,
    "translated_title": "在HPC系统中的在线作业失败预测",
    "translated_abstract": "现代高性能计算（HPC）系统是复杂的机器，对经济和社会都有重大影响。除了计算能力外，能源消耗也在不断增长，这是一个关键问题，考虑到当前的环境和能源危机。因此，开发优化HPC系统管理的策略至关重要，既可以保证一流的性能，又可以提高能源效率。一种策略是通过在工作负载级别上进行操作，并在系统上执行之前突出显示最有可能失败的作业。作业在执行过程中失败会不必要地占用资源，可能会延迟其他作业，对系统性能和能源消耗产生不利影响。在本文中，我们使用经典的机器学习算法研究了提交时间上的作业失败预测。我们的创新在于（i）将这些算法与自然语言处理（NLP）工具结合起来，以表示作业和（ii）th",
    "tldr": "该论文研究了使用经典的机器学习算法在提交时间上进行作业失败预测，并结合自然语言处理工具来表示作业。该方法可用于优化高性能计算系统管理，提高性能和能源效率。",
    "en_tdlr": "This paper investigates job failure prediction at submit-time using classical machine learning algorithms, combined with Natural Language Processing (NLP) tools. The approach aims to optimize HPC system management and improve performance and energy efficiency."
}