{
    "title": "Automatically measuring speech fluency in people with aphasia: first achievements using read-speech data. (arXiv:2308.04763v1 [cs.CL])",
    "abstract": "Background: Speech and language pathologists (SLPs) often relyon judgements of speech fluency for diagnosing or monitoringpatients with aphasia. However, such subjective methods havebeen criticised for their lack of reliability and their clinical cost interms of time. Aims: This study aims at assessing the relevance of a signalprocessingalgorithm, initially developed in the field of language acquisition, for the automatic measurement of speech fluency in people with aphasia (PWA). Methods & Procedures: Twenty-nine PWA and five control participantswere recruited via non-profit organizations and SLP networks. All participants were recorded while reading out loud a set ofsentences taken from the French version of the Boston Diagnostic Aphasia Examination. Three trained SLPs assessed the fluency of each sentence on a five-point qualitative scale. A forward-backward divergence segmentation and a clustering algorithm were used to compute, for each sentence, four automatic predictors of speec",
    "link": "http://arxiv.org/abs/2308.04763",
    "context": "Title: Automatically measuring speech fluency in people with aphasia: first achievements using read-speech data. (arXiv:2308.04763v1 [cs.CL])\nAbstract: Background: Speech and language pathologists (SLPs) often relyon judgements of speech fluency for diagnosing or monitoringpatients with aphasia. However, such subjective methods havebeen criticised for their lack of reliability and their clinical cost interms of time. Aims: This study aims at assessing the relevance of a signalprocessingalgorithm, initially developed in the field of language acquisition, for the automatic measurement of speech fluency in people with aphasia (PWA). Methods & Procedures: Twenty-nine PWA and five control participantswere recruited via non-profit organizations and SLP networks. All participants were recorded while reading out loud a set ofsentences taken from the French version of the Boston Diagnostic Aphasia Examination. Three trained SLPs assessed the fluency of each sentence on a five-point qualitative scale. A forward-backward divergence segmentation and a clustering algorithm were used to compute, for each sentence, four automatic predictors of speec",
    "path": "papers/23/08/2308.04763.json",
    "total_tokens": 1042,
    "translated_title": "用于自动测量失语症患者讲话流利度的初步成果：基于朗读语音数据的实现",
    "translated_abstract": "背景：言语和语言病理学家常常依赖对于失语症患者的言语流利性的评判来诊断或监测患者。然而，这样的主观方法因其可靠性不足以及在临床上花费过多的时间而受到批评。目的：本研究旨在评估一种信号处理算法在自动测量失语症患者言语流利度方面的相关性，该算法最初是在语言习得领域开发的。方法与过程：通过非营利组织和言语治疗师网络招募了29名失语症患者和5名对照参与者。所有参与者在朗读法语版波士顿诊断性失语症测试中的一组句子时被录制下来。三名受过训练的言语治疗师根据一个五点临床性质评价尺度评估了每个句子的流利度。使用正反向分歧分割和聚类算法来计算每个句子的四个自动预测因子，即语音相关部分的长度、正反向分歧部分的长度、正反向分歧部分的数量和句子中共振离散程度的表示。",
    "tldr": "本研究首次使用朗读语音数据，评估了一种信号处理算法在自动测量失语症患者言语流利度方面的相关性。通过对比专业言语治疗师的评估结果，发现该算法可以有效地预测失语症患者的言语流利程度。",
    "en_tdlr": "This study presents the first achievements in the automatic measurement of speech fluency in people with aphasia using read-speech data. By comparing with the assessments of trained speech and language pathologists, it is found that the signal processing algorithm can accurately predict the fluency level of aphasia patients."
}