{
    "title": "MadSGM: Multivariate Anomaly Detection with Score-based Generative Models. (arXiv:2308.15069v1 [cs.LG])",
    "abstract": "The time-series anomaly detection is one of the most fundamental tasks for time-series. Unlike the time-series forecasting and classification, the time-series anomaly detection typically requires unsupervised (or self-supervised) training since collecting and labeling anomalous observations are difficult. In addition, most existing methods resort to limited forms of anomaly measurements and therefore, it is not clear whether they are optimal in all circumstances. To this end, we present a multivariate time-series anomaly detector based on score-based generative models, called MadSGM, which considers the broadest ever set of anomaly measurement factors: i) reconstruction-based, ii) density-based, and iii) gradient-based anomaly measurements. We also design a conditional score network and its denoising score matching loss for the time-series anomaly detection. Experiments on five real-world benchmark datasets illustrate that MadSGM achieves the most robust and accurate predictions.",
    "link": "http://arxiv.org/abs/2308.15069",
    "context": "Title: MadSGM: Multivariate Anomaly Detection with Score-based Generative Models. (arXiv:2308.15069v1 [cs.LG])\nAbstract: The time-series anomaly detection is one of the most fundamental tasks for time-series. Unlike the time-series forecasting and classification, the time-series anomaly detection typically requires unsupervised (or self-supervised) training since collecting and labeling anomalous observations are difficult. In addition, most existing methods resort to limited forms of anomaly measurements and therefore, it is not clear whether they are optimal in all circumstances. To this end, we present a multivariate time-series anomaly detector based on score-based generative models, called MadSGM, which considers the broadest ever set of anomaly measurement factors: i) reconstruction-based, ii) density-based, and iii) gradient-based anomaly measurements. We also design a conditional score network and its denoising score matching loss for the time-series anomaly detection. Experiments on five real-world benchmark datasets illustrate that MadSGM achieves the most robust and accurate predictions.",
    "path": "papers/23/08/2308.15069.json",
    "total_tokens": 868,
    "translated_title": "MadSGM：基于评分的生成模型的多变量异常检测",
    "translated_abstract": "时间序列异常检测是时间序列中最基本的任务之一。与时间序列预测和分类不同，时间序列异常检测通常需要无监督（或自监督）训练，因为收集和标记异常观测是困难的。此外，大多数现有方法采用有限形式的异常测量，因此不清楚它们是否在所有情况下都是最优的。为此，我们提出了一种基于评分的生成模型的多变量时间序列异常检测器，称为MadSGM，它考虑了迄今为止最广泛的异常测量因素：i）基于重构的、ii）基于密度的和iii）基于梯度的异常测量。我们还设计了一个条件评分网络及其去噪评分匹配损失，用于时间序列异常检测。对五个真实世界基准数据集的实验表明，MadSGM实现了最强大和准确的预测。",
    "tldr": "MadSGM是一种基于评分的生成模型的多变量时间序列异常检测器，考虑了重构、密度和梯度等全面的异常测量因素。实验证明MadSGM具有最强大和准确的预测能力。",
    "en_tdlr": "MadSGM is a multivariate time series anomaly detector based on score-based generative models, considering comprehensive anomaly measurement factors such as reconstruction, density, and gradient. Experiments demonstrate that MadSGM achieves the most robust and accurate predictions."
}