{
    "title": "Joint Calibration of Local Volatility Models with Stochastic Interest Rates using Semimartingale Optimal Transport. (arXiv:2308.14473v1 [q-fin.MF])",
    "abstract": "We develop and implement a non-parametric method for joint exact calibration of a local volatility model and a correlated stochastic short rate model using semimartingale optimal transport. The method relies on the duality results established in Joseph, Loeper, and Obloj, 2023 and jointly calibrates the whole equity-rate dynamics. It uses an iterative approach which starts with a parametric model and tries to stay close to it, until a perfect calibration is obtained. We demonstrate the performance of our approach on market data using European SPX options and European cap interest rate options. Finally, we compare the joint calibration approach with the sequential calibration, in which the short rate model is calibrated first and frozen.",
    "link": "http://arxiv.org/abs/2308.14473",
    "context": "Title: Joint Calibration of Local Volatility Models with Stochastic Interest Rates using Semimartingale Optimal Transport. (arXiv:2308.14473v1 [q-fin.MF])\nAbstract: We develop and implement a non-parametric method for joint exact calibration of a local volatility model and a correlated stochastic short rate model using semimartingale optimal transport. The method relies on the duality results established in Joseph, Loeper, and Obloj, 2023 and jointly calibrates the whole equity-rate dynamics. It uses an iterative approach which starts with a parametric model and tries to stay close to it, until a perfect calibration is obtained. We demonstrate the performance of our approach on market data using European SPX options and European cap interest rate options. Finally, we compare the joint calibration approach with the sequential calibration, in which the short rate model is calibrated first and frozen.",
    "path": "papers/23/08/2308.14473.json",
    "total_tokens": 799,
    "translated_title": "使用半鞅最优输运联合校准具有随机利率的本地波动模型",
    "translated_abstract": "我们利用半鞅最优输运开发和实现了一种非参数方法，用于联合准确校准本地波动模型和相关随机短期利率模型。该方法依赖于Joseph、Loeper和Obloj在2023年建立的对偶结果，并联合校准整个股票-利率动态。它采用迭代方法，从参数模型开始，并努力保持接近，直到获得完美的校准。我们使用欧洲SPX期权和欧洲名义利率期权的市场数据来演示我们方法的性能。最后，我们将联合校准方法与顺序校准进行了比较，顺序校准先对短期利率模型进行校准并冻结。",
    "tldr": "本文提出了一种使用半鞅最优输运的非参数方法，用于联合准确校准本地波动模型和相关随机短期利率模型。该方法通过迭代过程实现校准，并使用市场数据进行验证。",
    "en_tdlr": "This paper proposes a non-parametric method using semimartingale optimal transport for joint exact calibration of a local volatility model and a correlated stochastic short rate model. The method iteratively calibrates the models and is demonstrated using market data."
}