{
    "title": "Decoding Emotions: A comprehensive Multilingual Study of Speech Models for Speech Emotion Recognition. (arXiv:2308.08713v1 [cs.CL])",
    "abstract": "Recent advancements in transformer-based speech representation models have greatly transformed speech processing. However, there has been limited research conducted on evaluating these models for speech emotion recognition (SER) across multiple languages and examining their internal representations. This article addresses these gaps by presenting a comprehensive benchmark for SER with eight speech representation models and six different languages. We conducted probing experiments to gain insights into inner workings of these models for SER. We find that using features from a single optimal layer of a speech model reduces the error rate by 32\\% on average across seven datasets when compared to systems where features from all layers of speech models are used. We also achieve state-of-the-art results for German and Persian languages. Our probing results indicate that the middle layers of speech models capture the most important emotional information for speech emotion recognition.",
    "link": "http://arxiv.org/abs/2308.08713",
    "context": "Title: Decoding Emotions: A comprehensive Multilingual Study of Speech Models for Speech Emotion Recognition. (arXiv:2308.08713v1 [cs.CL])\nAbstract: Recent advancements in transformer-based speech representation models have greatly transformed speech processing. However, there has been limited research conducted on evaluating these models for speech emotion recognition (SER) across multiple languages and examining their internal representations. This article addresses these gaps by presenting a comprehensive benchmark for SER with eight speech representation models and six different languages. We conducted probing experiments to gain insights into inner workings of these models for SER. We find that using features from a single optimal layer of a speech model reduces the error rate by 32\\% on average across seven datasets when compared to systems where features from all layers of speech models are used. We also achieve state-of-the-art results for German and Persian languages. Our probing results indicate that the middle layers of speech models capture the most important emotional information for speech emotion recognition.",
    "path": "papers/23/08/2308.08713.json",
    "total_tokens": 897,
    "translated_title": "解码情绪：针对语音情感识别的多语言综合研究",
    "translated_abstract": "近年来，基于Transformer的语音表示模型在语音处理方面取得了巨大的进展。然而，对于这些模型在多种语言中进行语音情感识别（SER）的评估以及对其内部表示进行研究的研究仍然有限。本文通过提出一个全面的SER基准，使用八个语音表示模型和六种不同语言来评估这些模型，填补了这些差距。我们进行了探索性实验，以了解这些模型在SER中的内部工作原理。我们发现，在与使用来自语音模型所有层的特征的系统相比，使用来自语音模型单一优化层的特征可以平均降低32%的错误率。我们还在德语和波斯语方面取得了最新的成果。我们的探索性结果表明，语音模型的中间层捕获了最重要的情感信息。",
    "tldr": "本研究提出了一个全面的语音情感识别（SER）的基准，评估了八种语音表示模型和六种不同语言。通过探索性实验，发现使用来自语音模型单一优化层的特征可以平均降低32%的错误率，并且中间层捕获了最重要的情感信息。"
}