{
    "title": "Thinking Like an Expert:Multimodal Hypergraph-of-Thought (HoT) Reasoning to boost Foundation Modals. (arXiv:2308.06207v1 [cs.CL])",
    "abstract": "Reasoning ability is one of the most crucial capabilities of a foundation model, signifying its capacity to address complex reasoning tasks. Chain-of-Thought (CoT) technique is widely regarded as one of the effective methods for enhancing the reasoning ability of foundation models and has garnered significant attention. However, the reasoning process of CoT is linear, step-by-step, similar to personal logical reasoning, suitable for solving general and slightly complicated problems. On the contrary, the thinking pattern of an expert owns two prominent characteristics that cannot be handled appropriately in CoT, i.e., high-order multi-hop reasoning and multimodal comparative judgement. Therefore, the core motivation of this paper is transcending CoT to construct a reasoning paradigm that can think like an expert. The hyperedge of a hypergraph could connect various vertices, making it naturally suitable for modelling high-order relationships. Inspired by this, this paper innovatively pro",
    "link": "http://arxiv.org/abs/2308.06207",
    "context": "Title: Thinking Like an Expert:Multimodal Hypergraph-of-Thought (HoT) Reasoning to boost Foundation Modals. (arXiv:2308.06207v1 [cs.CL])\nAbstract: Reasoning ability is one of the most crucial capabilities of a foundation model, signifying its capacity to address complex reasoning tasks. Chain-of-Thought (CoT) technique is widely regarded as one of the effective methods for enhancing the reasoning ability of foundation models and has garnered significant attention. However, the reasoning process of CoT is linear, step-by-step, similar to personal logical reasoning, suitable for solving general and slightly complicated problems. On the contrary, the thinking pattern of an expert owns two prominent characteristics that cannot be handled appropriately in CoT, i.e., high-order multi-hop reasoning and multimodal comparative judgement. Therefore, the core motivation of this paper is transcending CoT to construct a reasoning paradigm that can think like an expert. The hyperedge of a hypergraph could connect various vertices, making it naturally suitable for modelling high-order relationships. Inspired by this, this paper innovatively pro",
    "path": "papers/23/08/2308.06207.json",
    "total_tokens": 815,
    "translated_title": "想像一位专家：多模态思维超图在提升基础模型中的推理能力",
    "translated_abstract": "推理能力是基础模型最关键的能力之一，表示其应对复杂推理任务的能力。思维链技术被广泛认为是增强基础模型推理能力的有效方法，并且受到了很大关注。然而，思维链的推理过程是线性的、一步一步的，类似于个人的逻辑推理，适用于解决一般和稍微复杂的问题。相反，专家的思维模式具有两个显著特点，在思维链中无法适当处理，即高阶多跳推理和多模态比较判断。因此，本文的核心动机是超越思维链，构建一个能思考像专家一样的推理范式。超图的超边可以连接不同的顶点，因此自然适用于建模高阶关系。在此启发下，本文创新地提出了一种方法",
    "tldr": "本文致力于构建一个思维范式，能够像专家一样思考，通过超图的超边连接不同顶点，实现高阶多跳推理和多模态比较判断。"
}