{
    "title": "Building Trust in Conversational AI: A Comprehensive Review and Solution Architecture for Explainable, Privacy-Aware Systems using LLMs and Knowledge Graph. (arXiv:2308.13534v1 [cs.CL])",
    "abstract": "Conversational AI systems have emerged as key enablers of human-like interactions across diverse sectors. Nevertheless, the balance between linguistic nuance and factual accuracy has proven elusive. In this paper, we first introduce LLMXplorer, a comprehensive tool that provides an in-depth review of over 150 Large Language Models (LLMs), elucidating their myriad implications ranging from social and ethical to regulatory, as well as their applicability across industries. Building on this foundation, we propose a novel functional architecture that seamlessly integrates the structured dynamics of Knowledge Graphs with the linguistic capabilities of LLMs. Validated using real-world AI news data, our architecture adeptly blends linguistic sophistication with factual rigour and further strengthens data security through Role-Based Access Control. This research provides insights into the evolving landscape of conversational AI, emphasizing the imperative for systems that are efficient, transp",
    "link": "http://arxiv.org/abs/2308.13534",
    "context": "Title: Building Trust in Conversational AI: A Comprehensive Review and Solution Architecture for Explainable, Privacy-Aware Systems using LLMs and Knowledge Graph. (arXiv:2308.13534v1 [cs.CL])\nAbstract: Conversational AI systems have emerged as key enablers of human-like interactions across diverse sectors. Nevertheless, the balance between linguistic nuance and factual accuracy has proven elusive. In this paper, we first introduce LLMXplorer, a comprehensive tool that provides an in-depth review of over 150 Large Language Models (LLMs), elucidating their myriad implications ranging from social and ethical to regulatory, as well as their applicability across industries. Building on this foundation, we propose a novel functional architecture that seamlessly integrates the structured dynamics of Knowledge Graphs with the linguistic capabilities of LLMs. Validated using real-world AI news data, our architecture adeptly blends linguistic sophistication with factual rigour and further strengthens data security through Role-Based Access Control. This research provides insights into the evolving landscape of conversational AI, emphasizing the imperative for systems that are efficient, transp",
    "path": "papers/23/08/2308.13534.json",
    "total_tokens": 1084,
    "translated_title": "建立对话型AI中的信任：使用LLMs和知识图谱构建可解释的、隐私感知的系统的综述和解决方案架构",
    "translated_abstract": "对话型AI系统已成为各个领域实现类似于人类交互的关键驱动因素。然而，语言细微差别和事实准确性之间的平衡一直难以把握。在本文中，我们首先介绍了LLMXplorer，这是一个全面的工具，详细审视了150多个大型语言模型（LLMs），阐明了它们从社会、伦理到监管的各种影响，以及它们在各行各业的适用性。在此基础上，我们提出了一种新颖的功能架构，将知识图谱的结构动态与LLMs的语言能力无缝集成。通过使用真实世界的AI新闻数据进行验证，我们的架构巧妙地融合了语言的复杂性与事实的严谨性，并通过基于角色的访问控制进一步加强了数据安全性。本研究为对话型AI发展的变化景观提供了深入见解，强调了高效、透明的系统的必要性。",
    "tldr": "本论文提出了一种综述和解决方案架构，用于构建可解释的、隐私感知的对话型AI系统。首先介绍了LLM模型的综合工具LLMXplorer，并阐明了其对社会、伦理和监管等方面的影响。然后提出了将知识图谱的结构动态与LLM的语言能力无缝集成的架构。通过使用真实世界的AI新闻数据进行验证，该架构成功地融合了语言的复杂性与事实的严谨性，并增强了数据安全性。",
    "en_tdlr": "This paper presents a comprehensive review and solution architecture for building explainable and privacy-aware conversational AI systems. It introduces LLMXplorer, a tool that reviews the implications of over 150 Large Language Models, and proposes an architecture that seamlessly integrates the dynamics of Knowledge Graphs with the linguistic capabilities of LLMs. Validated using real-world AI news data, the architecture effectively combines linguistic sophistication with factual rigour and strengthens data security."
}