{
    "title": "Feature Matching Data Synthesis for Non-IID Federated Learning. (arXiv:2308.04761v1 [cs.LG])",
    "abstract": "Federated learning (FL) has emerged as a privacy-preserving paradigm that trains neural networks on edge devices without collecting data at a central server. However, FL encounters an inherent challenge in dealing with non-independent and identically distributed (non-IID) data among devices. To address this challenge, this paper proposes a hard feature matching data synthesis (HFMDS) method to share auxiliary data besides local models. Specifically, synthetic data are generated by learning the essential class-relevant features of real samples and discarding the redundant features, which helps to effectively tackle the non-IID issue. For better privacy preservation, we propose a hard feature augmentation method to transfer real features towards the decision boundary, with which the synthetic data not only improve the model generalization but also erase the information of real features. By integrating the proposed HFMDS method with FL, we present a novel FL framework with data augmentati",
    "link": "http://arxiv.org/abs/2308.04761",
    "context": "Title: Feature Matching Data Synthesis for Non-IID Federated Learning. (arXiv:2308.04761v1 [cs.LG])\nAbstract: Federated learning (FL) has emerged as a privacy-preserving paradigm that trains neural networks on edge devices without collecting data at a central server. However, FL encounters an inherent challenge in dealing with non-independent and identically distributed (non-IID) data among devices. To address this challenge, this paper proposes a hard feature matching data synthesis (HFMDS) method to share auxiliary data besides local models. Specifically, synthetic data are generated by learning the essential class-relevant features of real samples and discarding the redundant features, which helps to effectively tackle the non-IID issue. For better privacy preservation, we propose a hard feature augmentation method to transfer real features towards the decision boundary, with which the synthetic data not only improve the model generalization but also erase the information of real features. By integrating the proposed HFMDS method with FL, we present a novel FL framework with data augmentati",
    "path": "papers/23/08/2308.04761.json",
    "total_tokens": 977,
    "translated_title": "非独立同分布联邦学习的特征匹配数据合成",
    "translated_abstract": "联邦学习是一种隐私保护的范式，它在边缘设备上训练神经网络而不在中央服务器上收集数据。然而，联邦学习在处理设备之间的非独立同分布（non-IID）数据方面面临着固有的挑战。为了解决这个挑战，本文提出了一种硬特征匹配数据合成（HFMDS）方法，除了本地模型外，还共享辅助数据。具体而言，通过学习真实样本的基本类相关特征并丢弃多余的特征，生成了合成数据，这有助于有效处理非独立同分布问题。为了更好地保护隐私，我们提出了一种硬特征增强方法，将真实特征转移到决策边界附近，从而合成数据不仅改善了模型的泛化能力，而且抹去了真实特征的信息。通过将提出的HFMDS方法与联邦学习相结合，我们提出了一种新的联邦学习框架，其中包含数据增强的方法。",
    "tldr": "本文提出了一种用于非独立同分布联邦学习的特征匹配数据合成方法，通过生成合成数据来解决联邦学习中的非独立同分布问题，并提出了一种隐私保护的特征增强方法。这种方法能够改善模型的泛化能力并抹去真实特征的信息。"
}