{
    "title": "A generative model for surrogates of spatial-temporal wildfire nowcasting. (arXiv:2308.02810v1 [cs.LG])",
    "abstract": "Recent increase in wildfires worldwide has led to the need for real-time fire nowcasting. Physics-driven models, such as cellular automata and computational fluid dynamics can provide high-fidelity fire spread simulations but they are computationally expensive and time-consuming. Much effort has been put into developing machine learning models for fire prediction. However, these models are often region-specific and require a substantial quantity of simulation data for training purpose. This results in a significant amount of computational effort for different ecoregions. In this work, a generative model is proposed using a three-dimensional Vector-Quantized Variational Autoencoders to generate spatial-temporal sequences of unseen wildfire burned areas in a given ecoregion. The model is tested in the ecoregion of a recent massive wildfire event in California, known as the Chimney fire. Numerical results show that the model succeed in generating coherent and structured fire scenarios, ta",
    "link": "http://arxiv.org/abs/2308.02810",
    "context": "Title: A generative model for surrogates of spatial-temporal wildfire nowcasting. (arXiv:2308.02810v1 [cs.LG])\nAbstract: Recent increase in wildfires worldwide has led to the need for real-time fire nowcasting. Physics-driven models, such as cellular automata and computational fluid dynamics can provide high-fidelity fire spread simulations but they are computationally expensive and time-consuming. Much effort has been put into developing machine learning models for fire prediction. However, these models are often region-specific and require a substantial quantity of simulation data for training purpose. This results in a significant amount of computational effort for different ecoregions. In this work, a generative model is proposed using a three-dimensional Vector-Quantized Variational Autoencoders to generate spatial-temporal sequences of unseen wildfire burned areas in a given ecoregion. The model is tested in the ecoregion of a recent massive wildfire event in California, known as the Chimney fire. Numerical results show that the model succeed in generating coherent and structured fire scenarios, ta",
    "path": "papers/23/08/2308.02810.json",
    "total_tokens": 941,
    "translated_title": "一种用于空间-时间野火预测的生成模型",
    "translated_abstract": "近年来全球野火数量的增加导致了对实时火势预测的需求。传统的物理模型，如元胞自动机和计算流体力学，可以提供高保真度的火势传播模拟，但耗时且计算复杂。目前已经有很多研究致力于开发机器学习模型进行火势预测，但这些模型往往特定于某个地区，并需要大量的模拟数据进行训练，这在不同生态区域中需要大量的计算工作。本文提出了一种生成模型，利用三维量化变分自编码器来生成给定生态区域内未见的空间-时间野火燃烧区域序列。该模型在加利福尼亚州最近的一次大规模野火事件 - Chimney火灾的生态区域中进行了测试。数值结果表明，该模型成功生成了连贯且有结构的火势情景。",
    "tldr": "本文提出了一种生成模型，利用三维量化变分自编码器来生成给定生态区域内未见的空间-时间野火燃烧区域序列。该模型在加利福尼亚州的Chimney火灾生态区域中进行了测试，结果表明该模型能够成功生成连贯且结构良好的火势情景。",
    "en_tdlr": "In this paper, a generative model is proposed using a three-dimensional Vector-Quantized Variational Autoencoders to generate spatial-temporal sequences of unseen wildfire burned areas. The model is tested in the ecoregion of the Chimney fire in California, and the results show that it successfully generates coherent and structured fire scenarios."
}