{
    "title": "Decarbonizing the European energy system in the absence of Russian gas: Hydrogen uptake and carbon capture developments in the power, heat and industry sectors. (arXiv:2308.08953v1 [econ.GN])",
    "abstract": "Hydrogen and carbon capture and storage are pivotal to decarbonize the European energy system in a broad range of pathway scenarios. Yet, their timely uptake in different sectors and distribution across countries are affected by supply options of renewable and fossil energy sources. Here, we analyze the decarbonization of the European energy system towards 2060, covering the power, heat, and industry sectors, and the change in use of hydrogen and carbon capture and storage in these sectors upon Europe's decoupling from Russian gas. The results indicate that the use of gas is significantly reduced in the power sector, instead being replaced by coal with carbon capture and storage, and with a further expansion of renewable generators. Coal coupled with carbon capture and storage is also used in the steel sector as an intermediary step when Russian gas is neglected, before being fully decarbonized with hydrogen. Hydrogen production mostly relies on natural gas with carbon capture and stor",
    "link": "http://arxiv.org/abs/2308.08953",
    "context": "Title: Decarbonizing the European energy system in the absence of Russian gas: Hydrogen uptake and carbon capture developments in the power, heat and industry sectors. (arXiv:2308.08953v1 [econ.GN])\nAbstract: Hydrogen and carbon capture and storage are pivotal to decarbonize the European energy system in a broad range of pathway scenarios. Yet, their timely uptake in different sectors and distribution across countries are affected by supply options of renewable and fossil energy sources. Here, we analyze the decarbonization of the European energy system towards 2060, covering the power, heat, and industry sectors, and the change in use of hydrogen and carbon capture and storage in these sectors upon Europe's decoupling from Russian gas. The results indicate that the use of gas is significantly reduced in the power sector, instead being replaced by coal with carbon capture and storage, and with a further expansion of renewable generators. Coal coupled with carbon capture and storage is also used in the steel sector as an intermediary step when Russian gas is neglected, before being fully decarbonized with hydrogen. Hydrogen production mostly relies on natural gas with carbon capture and stor",
    "path": "papers/23/08/2308.08953.json",
    "total_tokens": 1059,
    "translated_title": "在没有俄罗斯天然气的情况下减碳欧洲能源系统：电力、热能和工业领域的氢气利用和碳捕获发展",
    "translated_abstract": "氢气和碳捕获与储存对于在各种路径情景中减碳欧洲能源系统至关重要。然而，它们在不同领域和国家的及时采用受到可再生能源和化石能源供应选择的影响。本文分析了欧洲能源系统在2060年之前的减碳情况，涵盖了电力、热能和工业领域，以及在欧洲脱离俄罗斯天然气后这些领域中氢气和碳捕获与储存的使用变化。结果表明，在电力领域，天然气的使用显著减少，而代之以具有碳捕获与储存的煤炭，并进一步扩大可再生发电设备。在钢铁行业中，当忽略俄罗斯天然气时，煤炭与碳捕获与储存也被用作中间步骤，然后再完全使用氢气实现脱碳。氢气的生产大部分依赖具有碳捕获与储存技术的天然气。",
    "tldr": "该论文分析了欧洲能源系统在没有俄罗斯天然气的情况下的减碳策略，发现电力领域逐渐减少使用天然气并采用具有碳捕获与储存的煤炭和可再生能源发电，钢铁行业也采用了煤炭和氢气来实现脱碳。",
    "en_tdlr": "This paper analyzes the decarbonization strategy of the European energy system in the absence of Russian gas, finding that the power sector gradually reduces the use of natural gas and adopts coal with carbon capture and storage, as well as renewable energy generation. The steel industry also utilizes coal and hydrogen to achieve decarbonization."
}