{
    "title": "Flashpoints Signal Hidden Inherent Instabilities in Land-Use Planning. (arXiv:2308.07714v1 [cs.AI])",
    "abstract": "Land-use decision-making processes have a long history of producing globally pervasive systemic equity and sustainability concerns. Quantitative, optimization-based planning approaches, e.g. Multi-Objective Land Allocation (MOLA), seemingly open the possibility to improve objectivity and transparency by explicitly evaluating planning priorities by the type, amount, and location of land uses. Here, we show that optimization-based planning approaches with generic planning criteria generate a series of unstable \"flashpoints\" whereby tiny changes in planning priorities produce large-scale changes in the amount of land use by type. We give quantitative arguments that the flashpoints we uncover in MOLA models are examples of a more general family of instabilities that occur whenever planning accounts for factors that coordinate use on- and between-sites, regardless of whether these planning factors are formulated explicitly or implicitly. We show that instabilities lead to regions of ambigui",
    "link": "http://arxiv.org/abs/2308.07714",
    "context": "Title: Flashpoints Signal Hidden Inherent Instabilities in Land-Use Planning. (arXiv:2308.07714v1 [cs.AI])\nAbstract: Land-use decision-making processes have a long history of producing globally pervasive systemic equity and sustainability concerns. Quantitative, optimization-based planning approaches, e.g. Multi-Objective Land Allocation (MOLA), seemingly open the possibility to improve objectivity and transparency by explicitly evaluating planning priorities by the type, amount, and location of land uses. Here, we show that optimization-based planning approaches with generic planning criteria generate a series of unstable \"flashpoints\" whereby tiny changes in planning priorities produce large-scale changes in the amount of land use by type. We give quantitative arguments that the flashpoints we uncover in MOLA models are examples of a more general family of instabilities that occur whenever planning accounts for factors that coordinate use on- and between-sites, regardless of whether these planning factors are formulated explicitly or implicitly. We show that instabilities lead to regions of ambigui",
    "path": "papers/23/08/2308.07714.json",
    "total_tokens": 857,
    "translated_title": "《土地利用规划中隐藏的内在不稳定性的标志》",
    "translated_abstract": "土地利用决策进程长期以来产生了全球普遍的系统性公平性和可持续性问题。定量的、基于优化的规划方法，如多目标土地分配（MOLA），似乎可以通过明确评估土地利用类型、数量和位置来提高客观性和透明度。在这里，我们展示了基于优化的规划方法使用通用规划标准会产生一系列不稳定的“闪点”，微小的规划优先级变化会导致大规模的土地利用变化。我们提出定量的论证，证明我们在MOLA模型中发现的闪点是一种更普遍的不稳定性的例子，无论这些规划因素是明确还是隐含，只要规划考虑到协调地点之间和地点内的使用因素，都会出现这种不稳定性。我们展示了不稳定性会导致存在不确定性的地区。",
    "tldr": "这项研究发现了土地利用规划中的内在不稳定性，即微小的规划优先级变化会导致大规模的土地利用变化。这一发现对于改善土地利用决策具有重要意义。",
    "en_tdlr": "This research uncovers inherent instabilities in land-use planning, where tiny changes in planning priorities result in large-scale changes in land use. This finding is significant for improving land-use decision-making."
}