{
    "title": "Neural-network quantum state study of the long-range antiferromagnetic Ising chain. (arXiv:2308.09709v2 [cond-mat.stat-mech] UPDATED)",
    "abstract": "We investigate quantum phase transitions in the transverse field Ising chain with algebraically decaying long-range antiferromagnetic interactions by using the variational Monte Carlo method with the restricted Boltzmann machine being employed as a trial wave function ansatz. In the finite-size scaling analysis with the order parameter and the second R\\'enyi entropy, we find that the central charge deviates from 1/2 at a small decay exponent $\\alpha_\\mathrm{LR}$ in contrast to the critical exponents staying very close to the short-range (SR) Ising values regardless of $\\alpha_\\mathrm{LR}$ examined, supporting the previously proposed scenario of conformal invariance breakdown. To identify the threshold of the Ising universality and the conformal symmetry, we perform two additional tests for the universal Binder ratio and the conformal field theory (CFT) description of the correlation function. It turns out that both indicate a noticeable deviation from the SR Ising class at $\\alpha_\\mat",
    "link": "http://arxiv.org/abs/2308.09709",
    "context": "Title: Neural-network quantum state study of the long-range antiferromagnetic Ising chain. (arXiv:2308.09709v2 [cond-mat.stat-mech] UPDATED)\nAbstract: We investigate quantum phase transitions in the transverse field Ising chain with algebraically decaying long-range antiferromagnetic interactions by using the variational Monte Carlo method with the restricted Boltzmann machine being employed as a trial wave function ansatz. In the finite-size scaling analysis with the order parameter and the second R\\'enyi entropy, we find that the central charge deviates from 1/2 at a small decay exponent $\\alpha_\\mathrm{LR}$ in contrast to the critical exponents staying very close to the short-range (SR) Ising values regardless of $\\alpha_\\mathrm{LR}$ examined, supporting the previously proposed scenario of conformal invariance breakdown. To identify the threshold of the Ising universality and the conformal symmetry, we perform two additional tests for the universal Binder ratio and the conformal field theory (CFT) description of the correlation function. It turns out that both indicate a noticeable deviation from the SR Ising class at $\\alpha_\\mat",
    "path": "papers/23/08/2308.09709.json",
    "total_tokens": 1043,
    "translated_title": "神经网络量子态研究长程反铁磁伊辛链",
    "translated_abstract": "我们利用变分蒙特卡洛方法研究具有代数衰减长程反铁磁相互作用的横向场伊辛链中的量子相变，采用约束玻尔兹曼机作为试验波函数参数化。在有限大小缩放分析中，通过序参数和第二个Renyi熵，我们发现中心荷与小的衰变指数$\\alpha_\\mathrm{LR}$不同，偏离了1/2，而临界指数则无论受到$\\alpha_\\mathrm{LR}$的影响如何，都保持非常接近短程（SR）伊辛模型的值，支持先前提出的共形不变性破缺场景。为了确定伊辛宇宙性和共形对称性的临界点，我们对普适Binder比和相关函数的共形场论（CFT）描述进行了两项附加测试。结果发现，在$\\alpha_\\mat",
    "tldr": "在这项研究中，我们使用变分蒙特卡洛方法和约束玻尔兹曼机作为试验波函数参数化，研究了具有代数衰减长程反铁磁相互作用的横向场伊辛链中的量子相变。通过有限大小缩放分析，我们发现中心荷的值与衰变指数$\\alpha_\\mathrm{LR}$不同，而临界指数则保持接近短程伊辛模型的值，这支持了先前提出的共形不变性破缺场景。",
    "en_tdlr": "In this study, we investigated quantum phase transitions in the transverse field Ising chain with algebraically decaying long-range antiferromagnetic interactions using the variational Monte Carlo method with the restricted Boltzmann machine as a trial wave function ansatz. Our results show that the central charge deviates from 1/2 at small decay exponent $\\alpha_\\mathrm{LR}$, while the critical exponents remain close to the short-range Ising values, supporting the proposed scenario of conformal invariance breakdown."
}