{
    "title": "A General-Purpose Self-Supervised Model for Computational Pathology. (arXiv:2308.15474v1 [cs.CV])",
    "abstract": "Tissue phenotyping is a fundamental computational pathology (CPath) task in learning objective characterizations of histopathologic biomarkers in anatomic pathology. However, whole-slide imaging (WSI) poses a complex computer vision problem in which the large-scale image resolutions of WSIs and the enormous diversity of morphological phenotypes preclude large-scale data annotation. Current efforts have proposed using pretrained image encoders with either transfer learning from natural image datasets or self-supervised pretraining on publicly-available histopathology datasets, but have not been extensively developed and evaluated across diverse tissue types at scale. We introduce UNI, a general-purpose self-supervised model for pathology, pretrained using over 100 million tissue patches from over 100,000 diagnostic haematoxylin and eosin-stained WSIs across 20 major tissue types, and evaluated on 33 representative CPath clinical tasks in CPath of varying diagnostic difficulties. In addi",
    "link": "http://arxiv.org/abs/2308.15474",
    "context": "Title: A General-Purpose Self-Supervised Model for Computational Pathology. (arXiv:2308.15474v1 [cs.CV])\nAbstract: Tissue phenotyping is a fundamental computational pathology (CPath) task in learning objective characterizations of histopathologic biomarkers in anatomic pathology. However, whole-slide imaging (WSI) poses a complex computer vision problem in which the large-scale image resolutions of WSIs and the enormous diversity of morphological phenotypes preclude large-scale data annotation. Current efforts have proposed using pretrained image encoders with either transfer learning from natural image datasets or self-supervised pretraining on publicly-available histopathology datasets, but have not been extensively developed and evaluated across diverse tissue types at scale. We introduce UNI, a general-purpose self-supervised model for pathology, pretrained using over 100 million tissue patches from over 100,000 diagnostic haematoxylin and eosin-stained WSIs across 20 major tissue types, and evaluated on 33 representative CPath clinical tasks in CPath of varying diagnostic difficulties. In addi",
    "path": "papers/23/08/2308.15474.json",
    "total_tokens": 883,
    "translated_title": "通用的自监督计算病理学模型",
    "translated_abstract": "组织表型分型是学习解剖病理标志物客观特征的基本计算病理学任务。然而，整个切片显微镜图像(WSI)存在一个复杂的计算机视觉问题，即WSI的大规模图像分辨率和形态表型的巨大多样性使得大规模数据注释成为不可能。目前的研究工作提出使用预训练的图像编码器，其中包括从自然图像数据集进行的迁移学习或在公开可用的组织病理学数据集上进行自监督预训练，但尚未在各种组织类型上进行广泛开发和评估。我们引入了UNI，这是一个通用的自监督计算病理学模型，使用来自20种主要组织类型的100,000个诊断性血红蛋白和伊红固醇染色切片的一亿多个组织块进行预训练，并在33个代表性的计算病理学临床任务上进行了评估。",
    "tldr": "本论文介绍了一个通用的自监督计算病理学模型，通过在各种组织类型上进行广泛开发和评估，为组织表型分型提供了解决方案。",
    "en_tdlr": "This paper introduces a general-purpose self-supervised model for computational pathology, providing a solution for tissue phenotyping through extensive development and evaluation on diverse tissue types."
}