{
    "title": "Pedestrian Trajectory Prediction in Pedestrian-Vehicle Mixed Environments: A Systematic Review. (arXiv:2308.06419v1 [cs.RO])",
    "abstract": "Planning an autonomous vehicle's (AV) path in a space shared with pedestrians requires reasoning about pedestrians' future trajectories. A practical pedestrian trajectory prediction algorithm for the use of AVs needs to consider the effect of the vehicle's interactions with the pedestrians on pedestrians' future motion behaviours. In this regard, this paper systematically reviews different methods proposed in the literature for modelling pedestrian trajectory prediction in presence of vehicles that can be applied for unstructured environments. This paper also investigates specific considerations for pedestrian-vehicle interaction (compared with pedestrian-pedestrian interaction) and reviews how different variables such as prediction uncertainties and behavioural differences are accounted for in the previously proposed prediction models. PRISMA guidelines were followed. Articles that did not consider vehicle and pedestrian interactions or actual trajectories, and articles that only focu",
    "link": "http://arxiv.org/abs/2308.06419",
    "context": "Title: Pedestrian Trajectory Prediction in Pedestrian-Vehicle Mixed Environments: A Systematic Review. (arXiv:2308.06419v1 [cs.RO])\nAbstract: Planning an autonomous vehicle's (AV) path in a space shared with pedestrians requires reasoning about pedestrians' future trajectories. A practical pedestrian trajectory prediction algorithm for the use of AVs needs to consider the effect of the vehicle's interactions with the pedestrians on pedestrians' future motion behaviours. In this regard, this paper systematically reviews different methods proposed in the literature for modelling pedestrian trajectory prediction in presence of vehicles that can be applied for unstructured environments. This paper also investigates specific considerations for pedestrian-vehicle interaction (compared with pedestrian-pedestrian interaction) and reviews how different variables such as prediction uncertainties and behavioural differences are accounted for in the previously proposed prediction models. PRISMA guidelines were followed. Articles that did not consider vehicle and pedestrian interactions or actual trajectories, and articles that only focu",
    "path": "papers/23/08/2308.06419.json",
    "total_tokens": 871,
    "translated_title": "行人-车辆混合环境下的行人轨迹预测:一项系统综述",
    "translated_abstract": "在与行人共享空间的自动驾驶车辆（AV）路径规划中，需要推理出行人的未来轨迹。为了应用于AV的实际行人轨迹预测算法，需要考虑车辆与行人的相互作用对行人未来运动行为的影响。在这方面，本文系统综述了文献中针对在存在车辆的非结构化环境中对行人轨迹预测进行建模的不同方法。本文还探讨了与行人-行人交互相比，行人-车辆交互的特定考虑，并回顾了先前提出的预测模型中如何考虑预测不确定性和行为差异等不同变量。遵循PRISMA指南。本文还考察了如何在先前提出的预测模型中考虑预测不确定性和行为差异等不同变量。",
    "tldr": "本文系统综述了行人-车辆混合环境下的行人轨迹预测方法，探讨了车辆和行人的相互作用对行人未来行为的影响，并回顾了先前提出的预测模型中如何考虑不确定性和行为差异。",
    "en_tdlr": "This paper provides a systematic review of pedestrian trajectory prediction methods in pedestrian-vehicle mixed environments, exploring the impact of vehicle-pedestrian interactions on pedestrian future behavior, and reviews how uncertainty and behavioral differences are accounted for in the previously proposed prediction models."
}