{
    "title": "Reflective Artificial Intelligence. (arXiv:2301.10823v3 [cs.AI] UPDATED)",
    "abstract": "Artificial Intelligence (AI) is about making computers that do the sorts of things that minds can do, and as we progress towards this goal, we tend to increasingly delegate human tasks to machines. However, AI systems usually do these tasks with an unusual imbalance of insight and understanding: new, deeper insights are present, yet many important qualities that a human mind would have previously brought to the activity are utterly absent. Therefore, it is crucial to ask which features of minds have we replicated, which are missing, and if that matters. One core feature that humans bring to tasks, when dealing with the ambiguity, emergent knowledge, and social context presented by the world, is reflection. Yet this capability is utterly missing from current mainstream AI. In this paper we ask what reflective AI might look like. Then, drawing on notions of reflection in complex systems, cognitive science, and agents, we sketch an architecture for reflective AI agents, and highlight ways",
    "link": "http://arxiv.org/abs/2301.10823",
    "context": "Title: Reflective Artificial Intelligence. (arXiv:2301.10823v3 [cs.AI] UPDATED)\nAbstract: Artificial Intelligence (AI) is about making computers that do the sorts of things that minds can do, and as we progress towards this goal, we tend to increasingly delegate human tasks to machines. However, AI systems usually do these tasks with an unusual imbalance of insight and understanding: new, deeper insights are present, yet many important qualities that a human mind would have previously brought to the activity are utterly absent. Therefore, it is crucial to ask which features of minds have we replicated, which are missing, and if that matters. One core feature that humans bring to tasks, when dealing with the ambiguity, emergent knowledge, and social context presented by the world, is reflection. Yet this capability is utterly missing from current mainstream AI. In this paper we ask what reflective AI might look like. Then, drawing on notions of reflection in complex systems, cognitive science, and agents, we sketch an architecture for reflective AI agents, and highlight ways",
    "path": "papers/23/01/2301.10823.json",
    "total_tokens": 884,
    "translated_title": "反思人工智能",
    "translated_abstract": "人工智能的目标是让计算机做人类可以做的事情，随着我们向这个目标迈进，我们越来越多地将人类任务交给机器。然而，人工智能系统通常在洞察力和理解方面存在着一定程度的不平衡：新的深入洞察虽然存在，但许多人类思考时带来的重要品质却完全缺失。因此，事关何种心智特征已被复制，何种特征存在缺失以及其重要性十分关键。在处理世界带来的模糊性、新兴知识和社会背景时，人类将反思作为核心特征带入任务中，然而当前主流的人工智能却完全缺乏这种能力。本文探讨了什么是反思人工智能，通过使用复杂系统、认知科学和智能体中的反思概念，概述了一种反思人工智能代理的架构，并强调了其方法。",
    "tldr": "人类思考时带有反思特质，可以应对世界的模糊性、新兴知识和社会背景。当前主流人工智能缺乏这种能力，本文提出了一种反思人工智能代理的架构。",
    "en_tdlr": "Human thinking involves reflective traits which can handle the ambiguity, emergent knowledge, and social context of the world. The current mainstream AI lacks this ability. This paper proposes an architecture for reflective AI agents."
}