{
    "title": "Leveraging generative adversarial networks to create realistic scanning transmission electron microscopy images. (arXiv:2301.07743v2 [cond-mat.mtrl-sci] UPDATED)",
    "abstract": "The rise of automation and machine learning (ML) in electron microscopy has the potential to revolutionize materials research through autonomous data collection and processing. A significant challenge lies in developing ML models that rapidly generalize to large data sets under varying experimental conditions. We address this by employing a cycle generative adversarial network (CycleGAN) with a reciprocal space discriminator, which augments simulated data with realistic spatial frequency information. This allows the CycleGAN to generate images nearly indistinguishable from real data and provide labels for ML applications. We showcase our approach by training a fully convolutional network (FCN) to identify single atom defects in a 4.5 million atom data set, collected using automated acquisition in an aberration-corrected scanning transmission electron microscope (STEM). Our method produces adaptable FCNs that can adjust to dynamically changing experimental variables with minimal interve",
    "link": "http://arxiv.org/abs/2301.07743",
    "context": "Title: Leveraging generative adversarial networks to create realistic scanning transmission electron microscopy images. (arXiv:2301.07743v2 [cond-mat.mtrl-sci] UPDATED)\nAbstract: The rise of automation and machine learning (ML) in electron microscopy has the potential to revolutionize materials research through autonomous data collection and processing. A significant challenge lies in developing ML models that rapidly generalize to large data sets under varying experimental conditions. We address this by employing a cycle generative adversarial network (CycleGAN) with a reciprocal space discriminator, which augments simulated data with realistic spatial frequency information. This allows the CycleGAN to generate images nearly indistinguishable from real data and provide labels for ML applications. We showcase our approach by training a fully convolutional network (FCN) to identify single atom defects in a 4.5 million atom data set, collected using automated acquisition in an aberration-corrected scanning transmission electron microscope (STEM). Our method produces adaptable FCNs that can adjust to dynamically changing experimental variables with minimal interve",
    "path": "papers/23/01/2301.07743.json",
    "total_tokens": 982,
    "translated_title": "利用生成对抗网络创建逼真的扫描透射电子显微镜图像",
    "translated_abstract": "自动化和机器学习在电子显微学中的应用具有通过自动数据收集和处理来革命性转变材料研究的潜力。如何开发出快速推广到不同实验条件下的大型数据集的机器学习模型是一个重大挑战。本文采用循环生成对抗网络 (CycleGAN) 和一个互补空间判别器，通过增加真实的空间频率信息来扩充模拟数据。这使得CycleGAN能够生成几乎无法与真实数据区分的图像，并为机器学习应用提供标签。我们通过训练完全卷积网络 (FCN) 在一个由450万个原子组成的数据集中识别单个原子缺陷来展示我们的方法。我们的方法能够产生适应性强的FCN，并能够在最小的干预下适应动态变化的实验变量，展示了生成对抗网络在利用高通量电子显微学革命材料研究方面的潜力。",
    "tldr": "本文提出一种循环生成对抗网络 (CycleGAN) 的方法，利用真实的空间频率信息来扩充模拟数据，生成几乎无法与真实数据区分的电子显微镜图像，并为机器学习应用提供标签，这展示了生成对抗网络在革命性转变材料研究方面具有潜力。"
}