{
    "title": "E-commerce users' preferences for delivery options. (arXiv:2301.00666v2 [econ.GN] UPDATED)",
    "abstract": "Many e-commerce marketplaces offer their users fast delivery options for free to meet the increasing needs of users, imposing an excessive burden on city logistics. Therefore, understanding e-commerce users' preference for delivery options is a key to designing logistics policies. To this end, this study designs a stated choice survey in which respondents are faced with choice tasks among different delivery options and time slots, which was completed by 4,062 users from the three major metropolitan areas in Japan. To analyze the data, mixed logit models capturing taste heterogeneity as well as flexible substitution patterns have been estimated. The model estimation results indicate that delivery attributes including fee, time, and time slot size are significant determinants of the delivery option choices. Associations between users' preferences and socio-demographic characteristics, such as age, gender, teleworking frequency and the presence of a delivery box, were also suggested. More",
    "link": "http://arxiv.org/abs/2301.00666",
    "context": "Title: E-commerce users' preferences for delivery options. (arXiv:2301.00666v2 [econ.GN] UPDATED)\nAbstract: Many e-commerce marketplaces offer their users fast delivery options for free to meet the increasing needs of users, imposing an excessive burden on city logistics. Therefore, understanding e-commerce users' preference for delivery options is a key to designing logistics policies. To this end, this study designs a stated choice survey in which respondents are faced with choice tasks among different delivery options and time slots, which was completed by 4,062 users from the three major metropolitan areas in Japan. To analyze the data, mixed logit models capturing taste heterogeneity as well as flexible substitution patterns have been estimated. The model estimation results indicate that delivery attributes including fee, time, and time slot size are significant determinants of the delivery option choices. Associations between users' preferences and socio-demographic characteristics, such as age, gender, teleworking frequency and the presence of a delivery box, were also suggested. More",
    "path": "papers/23/01/2301.00666.json",
    "total_tokens": 883,
    "translated_title": "电子商务用户对交付选择的偏好",
    "translated_abstract": "许多电子商务市场为了满足用户日益增长的需求，提供免费的快速交付选项，这给城市物流带来了过重的负担。因此，了解电子商务用户对交付选择的偏好是设计物流政策的关键。为此，本研究设计了一项陈述选择调查，受访者面临不同交付选择和时间段之间的选择任务，在日本三个主要都市地区的4062名用户完成了调查。为了分析数据，我们估计了捕捉品味异质性以及灵活替代模式的混合逻辑模型。模型估计结果表明，包括费用、时间和时间段大小在内的交付属性是交付选择的重要决定因素。还提出了用户偏好与年龄、性别、远程办公频率和是否有快递柜等社会人口特征之间的关联。",
    "tldr": "研究通过设计陈述选择调查，调查了电子商务用户对交付选择的偏好，发现交付方式的费用、时间和时间段大小是用户选择的重要决定因素，同时也发现用户的偏好与年龄、性别、远程办公频率和是否有快递柜等社会人口特征有关。",
    "en_tdlr": "This study investigates e-commerce users' preferences for delivery options using a stated choice survey. The results show that delivery attributes such as fee, time, and time slot size significantly influence users' choices. Additionally, associations between users' preferences and socio-demographic characteristics were identified."
}