{
    "title": "WuYun: Exploring hierarchical skeleton-guided melody generation using knowledge-enhanced deep learning. (arXiv:2301.04488v2 [cs.SD] UPDATED)",
    "abstract": "Although deep learning has revolutionized music generation, existing methods for structured melody generation follow an end-to-end left-to-right note-by-note generative paradigm and treat each note equally. Here, we present WuYun, a knowledge-enhanced deep learning architecture for improving the structure of generated melodies, which first generates the most structurally important notes to construct a melodic skeleton and subsequently infills it with dynamically decorative notes into a full-fledged melody. Specifically, we use music domain knowledge to extract melodic skeletons and employ sequence learning to reconstruct them, which serve as additional knowledge to provide auxiliary guidance for the melody generation process. We demonstrate that WuYun can generate melodies with better long-term structure and musicality and outperforms other state-of-the-art methods by 0.51 on average on all subjective evaluation metrics. Our study provides a multidisciplinary lens to design melodic hie",
    "link": "http://arxiv.org/abs/2301.04488",
    "context": "Title: WuYun: Exploring hierarchical skeleton-guided melody generation using knowledge-enhanced deep learning. (arXiv:2301.04488v2 [cs.SD] UPDATED)\nAbstract: Although deep learning has revolutionized music generation, existing methods for structured melody generation follow an end-to-end left-to-right note-by-note generative paradigm and treat each note equally. Here, we present WuYun, a knowledge-enhanced deep learning architecture for improving the structure of generated melodies, which first generates the most structurally important notes to construct a melodic skeleton and subsequently infills it with dynamically decorative notes into a full-fledged melody. Specifically, we use music domain knowledge to extract melodic skeletons and employ sequence learning to reconstruct them, which serve as additional knowledge to provide auxiliary guidance for the melody generation process. We demonstrate that WuYun can generate melodies with better long-term structure and musicality and outperforms other state-of-the-art methods by 0.51 on average on all subjective evaluation metrics. Our study provides a multidisciplinary lens to design melodic hie",
    "path": "papers/23/01/2301.04488.json",
    "total_tokens": 1050,
    "translated_title": "WuYun: 基于知识增强深度学习探索层次结构骨架引导的旋律生成",
    "translated_abstract": "尽管深度学习革新了音乐生成领域，然而目前现有的结构化旋律生成方法仍然遵循端到端的一个音符接一个音符的生成模式，而且在对待每个音符时都一视同仁。这里我们提出 WuYun，一种基于知识增强的深度学习体系结构，用于改善生成旋律的结构。该方法首先生成最具结构重要性的音符以构造旋律骨架，然后在骨架的基础上填充动态装饰音符，生成完整的旋律。具体来说，我们使用音乐领域知识提取旋律骨架，并使用序列学习来重建旋律骨架，旋律骨架作为附加知识为旋律生成过程提供辅助指导。我们演示了 WuYun 能够生成具有更好长期结构和音乐性的旋律，并在所有主观评价度量标准上平均超过了其他最先进的方法0.51 。此研究提供一种多学科视角来设计深度学习框架中的旋律层次结构，该思路可扩展到更广泛的音乐生成任务中。",
    "tldr": "WuYun是一种基于知识增强的深度学习算法，它将旋律分解成骨架和动态装饰音符两部分，并通过音乐领域知识提取旋律骨架，提供辅助指导来生成具有更好长期结构和音乐性的旋律。",
    "en_tdlr": "WuYun is a knowledge-enhanced deep learning algorithm that decomposes melodies into skeletons and dynamically decorative notes, and extracts melody skeletons using music domain knowledge to provide auxiliary guidance in generating melodies with better long-term structure and musicality."
}