{
    "title": "Generating Novel, Designable, and Diverse Protein Structures by Equivariantly Diffusing Oriented Residue Clouds. (arXiv:2301.12485v3 [q-bio.BM] UPDATED)",
    "abstract": "Proteins power a vast array of functional processes in living cells. The capability to create new proteins with designed structures and functions would thus enable the engineering of cellular behavior and development of protein-based therapeutics and materials. Structure-based protein design aims to find structures that are designable (can be realized by a protein sequence), novel (have dissimilar geometry from natural proteins), and diverse (span a wide range of geometries). While advances in protein structure prediction have made it possible to predict structures of novel protein sequences, the combinatorially large space of sequences and structures limits the practicality of search-based methods. Generative models provide a compelling alternative, by implicitly learning the low-dimensional structure of complex data distributions. Here, we leverage recent advances in denoising diffusion probabilistic models and equivariant neural networks to develop Genie, a generative model of prote",
    "link": "http://arxiv.org/abs/2301.12485",
    "context": "Title: Generating Novel, Designable, and Diverse Protein Structures by Equivariantly Diffusing Oriented Residue Clouds. (arXiv:2301.12485v3 [q-bio.BM] UPDATED)\nAbstract: Proteins power a vast array of functional processes in living cells. The capability to create new proteins with designed structures and functions would thus enable the engineering of cellular behavior and development of protein-based therapeutics and materials. Structure-based protein design aims to find structures that are designable (can be realized by a protein sequence), novel (have dissimilar geometry from natural proteins), and diverse (span a wide range of geometries). While advances in protein structure prediction have made it possible to predict structures of novel protein sequences, the combinatorially large space of sequences and structures limits the practicality of search-based methods. Generative models provide a compelling alternative, by implicitly learning the low-dimensional structure of complex data distributions. Here, we leverage recent advances in denoising diffusion probabilistic models and equivariant neural networks to develop Genie, a generative model of prote",
    "path": "papers/23/01/2301.12485.json",
    "total_tokens": 957,
    "translated_title": "通过等变扩散定向氨基酸云生成新颖、可设计和多样化的蛋白质结构",
    "translated_abstract": "蛋白质在细胞中发挥着各种功能过程。创造具有设计结构和功能的新蛋白质将有助于工程化细胞行为和开发基于蛋白质的治疗和材料。基于结构的蛋白质设计旨在寻找可设计（可以由蛋白质序列实现的结构），新颖（与天然蛋白质有不同的几何形状）和多样化（涵盖广泛几何形状范围）的结构。尽管蛋白质结构预测的进展使得预测新蛋白质序列的结构成为可能，但序列和结构的组合空间限制了搜索方法的实用性。生成模型提供了一种有力的替代方法，通过隐含地学习复杂数据分布的低维结构。在这里，我们利用最近噪声扩散概率模型和等变神经网络的进展，开发了名为Genie的蛋白质生成模型。",
    "tldr": "本论文介绍了一种新型的蛋白质生成模型Genie，可以使用等变神经网络和扩散概率模型生成新颖、可设计、多样化的蛋白质结构。这将有助于开发新的蛋白质治疗和材料。"
}