{
    "title": "Toward Building General Foundation Models for Language, Vision, and Vision-Language Understanding Tasks. (arXiv:2301.05065v2 [cs.CV] UPDATED)",
    "abstract": "Foundation models or pre-trained models have substantially improved the performance of various language, vision, and vision-language understanding tasks. However, existing foundation models can only perform the best in one type of tasks, namely language, vision, or vision-language. It is still an open question whether it is possible to construct a foundation model performing the best for all the understanding tasks, which we call a general foundation model. In this paper, we propose a new general foundation model, X-FM (the X-Foundation Model). X-FM has one language encoder, one vision encoder, and one fusion encoder, as well as a new training method. The training method includes two new techniques for learning X-FM from text, image, and image-text pair data. One is to stop gradients from the vision-language training when learning the language encoder. The other is to leverage the vision-language training to guide the learning of the vision encoder. Extensive experiments on benchmark d",
    "link": "http://arxiv.org/abs/2301.05065",
    "context": "Title: Toward Building General Foundation Models for Language, Vision, and Vision-Language Understanding Tasks. (arXiv:2301.05065v2 [cs.CV] UPDATED)\nAbstract: Foundation models or pre-trained models have substantially improved the performance of various language, vision, and vision-language understanding tasks. However, existing foundation models can only perform the best in one type of tasks, namely language, vision, or vision-language. It is still an open question whether it is possible to construct a foundation model performing the best for all the understanding tasks, which we call a general foundation model. In this paper, we propose a new general foundation model, X-FM (the X-Foundation Model). X-FM has one language encoder, one vision encoder, and one fusion encoder, as well as a new training method. The training method includes two new techniques for learning X-FM from text, image, and image-text pair data. One is to stop gradients from the vision-language training when learning the language encoder. The other is to leverage the vision-language training to guide the learning of the vision encoder. Extensive experiments on benchmark d",
    "path": "papers/23/01/2301.05065.json",
    "total_tokens": 893,
    "translated_title": "构建语言、视觉和视觉-语言理解任务的通用基础模型的研究",
    "translated_abstract": "基础模型或预训练模型显著提高了各种语言、视觉和视觉-语言理解任务的性能。然而，现有基础模型只能在语言、视觉或视觉-语言中的一种任务中表现最佳。目前尚不清楚能否构建一种在所有理解任务中表现最佳的基础模型，我们称之为通用基础模型。本文提出了一种新的通用基础模型X-FM（X基础模型）。X-FM具有一个语言编码器、一个视觉编码器和一个融合编码器，以及一种新的训练方法。训练方法包括两种新技术，用于从文本、图像和图像-文本对数据中学习X-FM。一种是在学习语言编码器时停止视觉-语言训练的梯度。另一种是利用视觉-语言训练来指导视觉编码器的学习。在基准测试数据集上进行了大量实验。",
    "tldr": "本论文提出了一种新的通用基础模型，通过结合语言、视觉和视觉-语言的训练方法，使得该模型在各种理解任务中都能表现最佳。",
    "en_tdlr": "This paper proposes a new general foundation model that performs the best in various understanding tasks by combining language, vision, and vision-language training methods."
}