{
    "title": "Efficient data transport over multimode light-pipes with Megapixel images using differentiable ray tracing and Machine-learning. (arXiv:2301.06496v3 [physics.optics] UPDATED)",
    "abstract": "Retrieving images transmitted through multi-mode fibers is of growing interest, thanks to their ability to confine and transport light efficiently in a compact system. Here, we demonstrate machine-learning-based decoding of large-scale digital images (pages), maximizing page capacity for optical storage applications. Using a millimeter-sized square cross-section waveguide, we image an 8-bit spatial light modulator, presenting data as a matrix of symbols. Normally, decoders will incur a prohibitive O(n^2) computational scaling to decode n symbols in spatially scrambled data. However, by combining a digital twin of the setup with a U-Net, we can retrieve up to 66 kB using efficient convolutional operations only. We compare trainable ray-tracing-based with eigenmode-based twins and show the former to be superior thanks to its ability to overcome the simulation-to-experiment gap by adjusting to optical imperfections. We train the pipeline end-to-end using a differentiable mutual-informatio",
    "link": "http://arxiv.org/abs/2301.06496",
    "context": "Title: Efficient data transport over multimode light-pipes with Megapixel images using differentiable ray tracing and Machine-learning. (arXiv:2301.06496v3 [physics.optics] UPDATED)\nAbstract: Retrieving images transmitted through multi-mode fibers is of growing interest, thanks to their ability to confine and transport light efficiently in a compact system. Here, we demonstrate machine-learning-based decoding of large-scale digital images (pages), maximizing page capacity for optical storage applications. Using a millimeter-sized square cross-section waveguide, we image an 8-bit spatial light modulator, presenting data as a matrix of symbols. Normally, decoders will incur a prohibitive O(n^2) computational scaling to decode n symbols in spatially scrambled data. However, by combining a digital twin of the setup with a U-Net, we can retrieve up to 66 kB using efficient convolutional operations only. We compare trainable ray-tracing-based with eigenmode-based twins and show the former to be superior thanks to its ability to overcome the simulation-to-experiment gap by adjusting to optical imperfections. We train the pipeline end-to-end using a differentiable mutual-informatio",
    "path": "papers/23/01/2301.06496.json",
    "total_tokens": 1056,
    "translated_title": "使用可微分光线追踪和机器学习在多模光导管中高效传输Megapixel图像的研究",
    "translated_abstract": "由于多模光纤能够有效地约束和传输光线，在传输通过多模光纤的图像方面的研究越来越受到关注。在本研究中，我们使用基于机器学习的方法解码大规模数字图像，以最大化光学存储应用的页面容量。通过使用毫米级方形横截面波导，我们可以将8位空间光调制器成像，将数据表示为符号矩阵。通过将系统的数字孪生与U-Net相结合，我们可以仅使用高效的卷积操作来检索高达66 kB的数据，而通常的解码器在处理空间混乱的数据时会导致计算复杂度的O(n^2)。通过比较基于可训练光线追踪和基于本征模的数字孪生，我们发现前者具有优越性，因为它能够通过调整光学缺陷来弥补模拟与实验之间的差距。我们使用可微分互信息方法对整个流程进行端到端的训练。",
    "tldr": "本研究利用可微分光线追踪和机器学习的方法，在多模光导管中实现了对Megapixel图像的高效传输，通过使用数字孪生和U-Net结合，减少了解码的计算复杂度，并比较了不同模式的性能差异。最终实现了对大规模数字图像的解码和检索，为光学存储应用提供了重要的技术支持。",
    "en_tdlr": "This study presents an efficient method for transporting Megapixel images over multimode light-pipes using differentiable ray tracing and machine learning. By combining a digital twin and U-Net, the decoding process is simplified and the computational complexity is reduced. The comparison between trainable ray tracing and eigenmode-based approaches reveals the superior performance of the former in handling optical imperfections. This research provides important technological support for optical storage applications by enabling the decoding and retrieval of large-scale digital images."
}