{
    "title": "BiBench: Benchmarking and Analyzing Network Binarization. (arXiv:2301.11233v2 [cs.CV] UPDATED)",
    "abstract": "Network binarization emerges as one of the most promising compression approaches offering extraordinary computation and memory savings by minimizing the bit-width. However, recent research has shown that applying existing binarization algorithms to diverse tasks, architectures, and hardware in realistic scenarios is still not straightforward. Common challenges of binarization, such as accuracy degradation and efficiency limitation, suggest that its attributes are not fully understood. To close this gap, we present BiBench, a rigorously designed benchmark with in-depth analysis for network binarization. We first carefully scrutinize the requirements of binarization in the actual production and define evaluation tracks and metrics for a comprehensive and fair investigation. Then, we evaluate and analyze a series of milestone binarization algorithms that function at the operator level and with extensive influence. Our benchmark reveals that 1) the binarized operator has a crucial impact o",
    "link": "http://arxiv.org/abs/2301.11233",
    "context": "Title: BiBench: Benchmarking and Analyzing Network Binarization. (arXiv:2301.11233v2 [cs.CV] UPDATED)\nAbstract: Network binarization emerges as one of the most promising compression approaches offering extraordinary computation and memory savings by minimizing the bit-width. However, recent research has shown that applying existing binarization algorithms to diverse tasks, architectures, and hardware in realistic scenarios is still not straightforward. Common challenges of binarization, such as accuracy degradation and efficiency limitation, suggest that its attributes are not fully understood. To close this gap, we present BiBench, a rigorously designed benchmark with in-depth analysis for network binarization. We first carefully scrutinize the requirements of binarization in the actual production and define evaluation tracks and metrics for a comprehensive and fair investigation. Then, we evaluate and analyze a series of milestone binarization algorithms that function at the operator level and with extensive influence. Our benchmark reveals that 1) the binarized operator has a crucial impact o",
    "path": "papers/23/01/2301.11233.json",
    "total_tokens": 1029,
    "translated_title": "BiBench：网络二值化基准测试和分析",
    "translated_abstract": "网络二值化成为最有前途的压缩方法之一，通过最小化比特宽度，提供了非凡的计算和内存节省。然而，最近的研究表明，在现实场景下，将现有的二值化算法应用于不同的任务、架构和硬件仍然不是一件容易的事情。二值化的常见挑战，如精度降低和效率限制，表明其属性尚未完全理解。为了弥补这一空白，我们提出了BiBench，一个严谨设计的网络二值化基准测试，并进行了深入分析。我们首先仔细审查了实际生产中对二值化的要求，为全面公正地进行研究定义了评估轨道和度量标准。然后，我们评估和分析了一系列在操作员级别和影响广泛的里程碑二值化算法。我们的基准测试揭示了 1）二值化操作员对最终精度有关键影响；2）不应低估网络拓扑和超参数调整的重要性；以及3）不同算法在不同任务和架构下的性能差异显着。我们的研究为网络二值化的特性和挑战提供了深入见解，为从业者和研究人员提供了有价值的参考。",
    "tldr": "BiBench提供了一个严谨设计的基准测试和深入分析，揭示了网络二值化面临的挑战和特性，为从业者和研究人员提供了有价值的参考。",
    "en_tdlr": "BiBench provides a rigorously designed benchmark and in-depth analysis, revealing the challenges and characteristics of network binarization, and offering valuable reference for both practitioners and researchers."
}