{
    "title": "Model Parameter Identification via a Hyperparameter Optimization Scheme for Autonomous Racing Systems. (arXiv:2301.01470v3 [cs.RO] UPDATED)",
    "abstract": "In this letter, we propose a model parameter identification method via a hyperparameter optimization scheme (MIHO). Our method adopts an efficient explore-exploit strategy to identify the parameters of dynamic models in a data-driven optimization manner. We utilize MIHO for model parameter identification of the AV-21, a full-scaled autonomous race vehicle. We then incorporate the optimized parameters for the design of model-based planning and control systems of our platform. In experiments, MIHO exhibits more than 13 times faster convergence than traditional parameter identification methods. Furthermore, the parametric models learned via MIHO demonstrate good fitness to the given datasets and show generalization ability in unseen dynamic scenarios. We further conduct extensive field tests to validate our model-based system, demonstrating stable obstacle avoidance and high-speed driving up to 217 km/h at the Indianapolis Motor Speedway and Las Vegas Motor Speedway. The source code for M",
    "link": "http://arxiv.org/abs/2301.01470",
    "context": "Title: Model Parameter Identification via a Hyperparameter Optimization Scheme for Autonomous Racing Systems. (arXiv:2301.01470v3 [cs.RO] UPDATED)\nAbstract: In this letter, we propose a model parameter identification method via a hyperparameter optimization scheme (MIHO). Our method adopts an efficient explore-exploit strategy to identify the parameters of dynamic models in a data-driven optimization manner. We utilize MIHO for model parameter identification of the AV-21, a full-scaled autonomous race vehicle. We then incorporate the optimized parameters for the design of model-based planning and control systems of our platform. In experiments, MIHO exhibits more than 13 times faster convergence than traditional parameter identification methods. Furthermore, the parametric models learned via MIHO demonstrate good fitness to the given datasets and show generalization ability in unseen dynamic scenarios. We further conduct extensive field tests to validate our model-based system, demonstrating stable obstacle avoidance and high-speed driving up to 217 km/h at the Indianapolis Motor Speedway and Las Vegas Motor Speedway. The source code for M",
    "path": "papers/23/01/2301.01470.json",
    "total_tokens": 933,
    "translated_title": "通过超参优化方案实现自主赛车系统的模型参数识别",
    "translated_abstract": "本文提出了一种通过超参数优化方案（MIHO）实现模型参数识别的方法。我们采用高效的探索-利用策略来以数据驱动的方式识别动态模型的参数。我们利用MIHO进行AV-21全尺寸自主赛车的模型参数识别。我们将优化后的参数融入我们平台的基于模型的规划和控制系统的设计中。实验结果显示，MIHO的收敛速度比传统的参数识别方法快13倍以上。此外，通过MIHO学习到的参数模型表现出良好的适应性和泛化能力。我们还进行了广泛的场地测试，证明了我们基于模型的系统具有稳定的避障性能和高速行驶性能，在印第安纳波利斯车速公园和拉斯维加斯车速公园的测试中达到了217公里/小时的高速行驶。",
    "tldr": "本文提出了基于超参优化方案的模型参数识别方法（MIHO），并实现了AV-21全尺寸自主赛车的模型参数识别。MIHO收敛速度比传统方法快13倍以上，参数模型具有良好适应性和泛化能力，车辆在场地测试中达到了217公里/小时的高速行驶和稳定避障性能。",
    "en_tdlr": "This paper proposes a model parameter identification method (MIHO) based on a hyperparameter optimization scheme and implements it for the AV-21 autonomous race vehicle. MIHO converges over 13 times faster than traditional methods and learns parameter models with good fitness and generalization ability. Field tests demonstrate stable obstacle avoidance and high-speed driving up to 217 km/h."
}