{
    "title": "Curvilinear object segmentation in medical images based on ODoS filter and deep learning network. (arXiv:2301.07475v2 [eess.IV] UPDATED)",
    "abstract": "Automatic segmentation of curvilinear objects in medical images plays an important role in the diagnosis and evaluation of human diseases, yet it is a challenging uncertainty in the complex segmentation tasks due to different issues such as various image appearances, low contrast between curvilinear objects and their surrounding backgrounds, thin and uneven curvilinear structures, and improper background illumination conditions. To overcome these challenges, we present a unique curvilinear structure segmentation framework based on an oriented derivative of stick (ODoS) filter and a deep learning network for curvilinear object segmentation in medical images. Currently, a large number of deep learning models emphasize developing deep architectures and ignore capturing the structural features of curvilinear objects, which may lead to unsatisfactory results. Consequently, a new approach that incorporates an ODoS filter as part of a deep learning network is presented to improve the spatial ",
    "link": "http://arxiv.org/abs/2301.07475",
    "context": "Title: Curvilinear object segmentation in medical images based on ODoS filter and deep learning network. (arXiv:2301.07475v2 [eess.IV] UPDATED)\nAbstract: Automatic segmentation of curvilinear objects in medical images plays an important role in the diagnosis and evaluation of human diseases, yet it is a challenging uncertainty in the complex segmentation tasks due to different issues such as various image appearances, low contrast between curvilinear objects and their surrounding backgrounds, thin and uneven curvilinear structures, and improper background illumination conditions. To overcome these challenges, we present a unique curvilinear structure segmentation framework based on an oriented derivative of stick (ODoS) filter and a deep learning network for curvilinear object segmentation in medical images. Currently, a large number of deep learning models emphasize developing deep architectures and ignore capturing the structural features of curvilinear objects, which may lead to unsatisfactory results. Consequently, a new approach that incorporates an ODoS filter as part of a deep learning network is presented to improve the spatial ",
    "path": "papers/23/01/2301.07475.json",
    "total_tokens": 902,
    "translated_title": "基于 ODoS 滤波器和深度学习网络的医学图像曲线对象分割",
    "translated_abstract": "在医学图像中，曲线对象的自动分割对于人类疾病的诊断和评估起着重要作用。然而，由于不同的图像外观，曲线对象与其周围背景之间的低对比度，薄而不均匀的曲线结构以及不适当的背景光照条件等问题，这是一项具有挑战性的任务。为了克服这些挑战，我们提出了一个基于ODoS滤波器和深度学习网络的独特曲线结构分割框架，用于在医学图像中进行曲线对象分割。目前，许多深度学习模型强调开发深度体系结构，并忽略捕获曲线对象的结构特征，这可能导致不理想的结果。因此，我们提出了一种将ODoS滤波器作为深度学习网络一部分的新方法，以改进空间信息的提取。",
    "tldr": "该论文提出了一种基于 ODoS 滤波器和深度学习网络的曲线结构分割框架，用于解决医学图像中曲线对象的自动分割问题。"
}