{
    "title": "A critical look at deep neural network for dynamic system modeling. (arXiv:2301.11604v2 [cs.LG] UPDATED)",
    "abstract": "Neural network models become increasingly popular as dynamic modeling tools in the control community. They have many appealing features including nonlinear structures, being able to approximate any functions. While most researchers hold optimistic attitudes towards such models, this paper questions the capability of (deep) neural networks for the modeling of dynamic systems using input-output data. For the identification of linear time-invariant (LTI) dynamic systems, two representative neural network models, Long Short-Term Memory (LSTM) and Cascade Foward Neural Network (CFNN) are compared to the standard Prediction Error Method (PEM) of system identification. In the comparison, four essential aspects of system identification are considered, then several possible defects and neglected issues of neural network based modeling are pointed out. Detailed simulation studies are performed to verify these defects: for the LTI system, both LSTM and CFNN fail to deliver consistent models even ",
    "link": "http://arxiv.org/abs/2301.11604",
    "context": "Title: A critical look at deep neural network for dynamic system modeling. (arXiv:2301.11604v2 [cs.LG] UPDATED)\nAbstract: Neural network models become increasingly popular as dynamic modeling tools in the control community. They have many appealing features including nonlinear structures, being able to approximate any functions. While most researchers hold optimistic attitudes towards such models, this paper questions the capability of (deep) neural networks for the modeling of dynamic systems using input-output data. For the identification of linear time-invariant (LTI) dynamic systems, two representative neural network models, Long Short-Term Memory (LSTM) and Cascade Foward Neural Network (CFNN) are compared to the standard Prediction Error Method (PEM) of system identification. In the comparison, four essential aspects of system identification are considered, then several possible defects and neglected issues of neural network based modeling are pointed out. Detailed simulation studies are performed to verify these defects: for the LTI system, both LSTM and CFNN fail to deliver consistent models even ",
    "path": "papers/23/01/2301.11604.json",
    "total_tokens": 936,
    "translated_title": "深度神经网络用于动态系统建模的批判性观察",
    "translated_abstract": "神经网络模型作为控制领域中的动态建模工具越来越受欢迎。它们具有非线性结构，能够逼近任何函数等吸引人的特点。尽管大多数研究人员认为这些模型具有良好的前景，但本文对（深度）神经网络在使用输入输出数据进行动态系统建模方面的能力提出了质疑。对于线性时不变（LTI）动态系统的识别，将两个代表性的神经网络模型，即长短期记忆（LSTM）和级联前馈神经网络（CFNN），与系统辨识的标准预测误差法（PEM）进行了比较。在比较中，考虑了系统辨识的四个重要方面，然后指出了基于神经网络的建模可能存在的一些缺陷和被忽视的问题。进行了详细的仿真研究来验证这些缺陷：对于LTI系统，无论是LSTM还是CFNN都无法提供一致的模型。",
    "tldr": "这项研究对使用深度神经网络进行动态系统建模的能力进行了批判性分析，比较了两种神经网络模型（LSTM和CFNN）与标准系统辨识方法（PEM）的性能，并指出了神经网络建模可能存在的缺陷和被忽视的问题。"
}