{
    "title": "Mind the Gap: Modelling Difference Between Censored and Uncensored Electric Vehicle Charging Demand. (arXiv:2301.06418v4 [cs.AI] UPDATED)",
    "abstract": "Electric vehicle charging demand models, with charging records as input, will inherently be biased toward the supply of available chargers. These models often fail to account for demand lost from occupied charging stations and competitors. The lost demand suggests that the actual demand is likely higher than the charging records reflect, i.e., the true demand is latent (unobserved), and the observations are censored. As a result, machine learning models that rely on these observed records for forecasting charging demand may be limited in their application in future infrastructure expansion and supply management, as they do not estimate the true demand for charging. We propose using censorship-aware models to model charging demand to address this limitation. These models incorporate censorship in their loss functions and learn the true latent demand distribution from observed charging records. We study how occupied charging stations and competing services censor demand using GPS traject",
    "link": "http://arxiv.org/abs/2301.06418",
    "context": "Title: Mind the Gap: Modelling Difference Between Censored and Uncensored Electric Vehicle Charging Demand. (arXiv:2301.06418v4 [cs.AI] UPDATED)\nAbstract: Electric vehicle charging demand models, with charging records as input, will inherently be biased toward the supply of available chargers. These models often fail to account for demand lost from occupied charging stations and competitors. The lost demand suggests that the actual demand is likely higher than the charging records reflect, i.e., the true demand is latent (unobserved), and the observations are censored. As a result, machine learning models that rely on these observed records for forecasting charging demand may be limited in their application in future infrastructure expansion and supply management, as they do not estimate the true demand for charging. We propose using censorship-aware models to model charging demand to address this limitation. These models incorporate censorship in their loss functions and learn the true latent demand distribution from observed charging records. We study how occupied charging stations and competing services censor demand using GPS traject",
    "path": "papers/23/01/2301.06418.json",
    "total_tokens": 899,
    "translated_title": "注意差距：建模被审查和未被审查的电动汽车充电需求的差异。",
    "translated_abstract": "基于充电记录的电动汽车充电需求模型会天然地对可用充电器的供应产生偏见。这些模型通常无法考虑到被占用充电站和竞争对充电需求的损失。这些损失表明实际需求很可能比充电记录反映的需求更高，即真实需求是潜在的（未观察到的），而观察结果则是被审查的。因此，依赖这些观察结果进行预测充电需求的机器学习模型可能在未来基础设施扩展和供应管理方面受到限制，因为它们无法估计充电的真实需求。我们提出使用有关审查的模型来模拟充电需求以解决此限制。这些模型将审查纳入损失函数中，并从观察到的充电记录中学习真实的潜在需求分布。我们研究了被占用充电站和竞争服务如何使用GPS轨迹审查需求。",
    "tldr": "电动汽车充电需求模型的天然偏见导致了观测到的需求与实际需求有差异，使用有关审查的模型来模拟充电需求可以更好地估计真实需求。"
}