{
    "title": "On Heterogeneous Treatment Effects in Heterogeneous Causal Graphs. (arXiv:2301.12383v2 [stat.ME] UPDATED)",
    "abstract": "Heterogeneity and comorbidity are two interwoven challenges associated with various healthcare problems that greatly hampered research on developing effective treatment and understanding of the underlying neurobiological mechanism. Very few studies have been conducted to investigate heterogeneous causal effects (HCEs) in graphical contexts due to the lack of statistical methods. To characterize this heterogeneity, we first conceptualize heterogeneous causal graphs (HCGs) by generalizing the causal graphical model with confounder-based interactions and multiple mediators. Such confounders with an interaction with the treatment are known as moderators. This allows us to flexibly produce HCGs given different moderators and explicitly characterize HCEs from the treatment or potential mediators on the outcome. We establish the theoretical forms of HCEs and derive their properties at the individual level in both linear and nonlinear models. An interactive structural learning is developed to ",
    "link": "http://arxiv.org/abs/2301.12383",
    "context": "Title: On Heterogeneous Treatment Effects in Heterogeneous Causal Graphs. (arXiv:2301.12383v2 [stat.ME] UPDATED)\nAbstract: Heterogeneity and comorbidity are two interwoven challenges associated with various healthcare problems that greatly hampered research on developing effective treatment and understanding of the underlying neurobiological mechanism. Very few studies have been conducted to investigate heterogeneous causal effects (HCEs) in graphical contexts due to the lack of statistical methods. To characterize this heterogeneity, we first conceptualize heterogeneous causal graphs (HCGs) by generalizing the causal graphical model with confounder-based interactions and multiple mediators. Such confounders with an interaction with the treatment are known as moderators. This allows us to flexibly produce HCGs given different moderators and explicitly characterize HCEs from the treatment or potential mediators on the outcome. We establish the theoretical forms of HCEs and derive their properties at the individual level in both linear and nonlinear models. An interactive structural learning is developed to ",
    "path": "papers/23/01/2301.12383.json",
    "total_tokens": 1105,
    "translated_title": "关于异质性因果图中的异质性治疗效应",
    "translated_abstract": "异质性和共病是许多医疗困境的两大挑战，阻碍了针对有效治疗的研究以及对潜在神经生物机制的理解。本文首先通过推广因果图模型与混杂变量交互和多个中介变量的概念，把异质性因果图（HCGs）进行了概括描述，这些与治疗交互作用的混杂变量被称为调节因素，这使我们能够灵活地产生HCGs，给出不同的调节因素，明确描述治疗或潜在中介变量对结果的HCEs。我们在线性和非线性模型中建立了HCE的理论形式，并在个体层面上推导了其特性。为了处理高维度场景，我们开发了一种交互式结构学习，通过将双重机器学习策略纳入估计调节因素中，来解决问题。我们通过模拟和对HIV阳性患者戒烟干预的真实数据应用示例来演示我们提出的方法和发现出先前未记录的新的HCE。该方法在各个医疗领域中为理解异质性治疗效应和改善个性化医学提供了潜在应用。",
    "tldr": "本文通过推广因果图模型，描述了异质性因果图，提出了一种方法来研究不同调节因素对治疗效果和潜在中介变量的影响，解决了现实生活中高维度场景的挑战，并在真实数据应用中发现了新的异质性治疗效应。",
    "en_tdlr": "This paper proposes a method to study the effects of different moderators on treatment outcomes and potential mediator variables by generalizing the causal graphical model, which describes the heterogeneous causal graph. Our method solves the challenge in high-dimensional scenarios and discovers novel heterogeneous treatment effects in a real-world data application for smoking cessation intervention in HIV-positive patients."
}