{
    "title": "Task-Agnostic Graph Neural Network Evaluation via Adversarial Collaboration. (arXiv:2301.11517v3 [cs.LG] UPDATED)",
    "abstract": "It has been increasingly demanding to develop reliable methods to evaluate the progress of Graph Neural Network (GNN) research for molecular representation learning. Existing GNN benchmarking methods for molecular representation learning focus on comparing the GNNs' performances on some node/graph classification/regression tasks on certain datasets. However, there lacks a principled, task-agnostic method to directly compare two GNNs. Additionally, most of the existing self-supervised learning works incorporate handcrafted augmentations to the data, which has several severe difficulties to be applied on graphs due to their unique characteristics. To address the aforementioned issues, we propose GraphAC (Graph Adversarial Collaboration) -a conceptually novel, principled, task-agnostic, and stable framework for evaluating GNNs through contrastive self-supervision. We introduce a novel objective function: the Competitive Barlow Twins, that allow two GNNs to jointly update themselves from",
    "link": "http://arxiv.org/abs/2301.11517",
    "context": "Title: Task-Agnostic Graph Neural Network Evaluation via Adversarial Collaboration. (arXiv:2301.11517v3 [cs.LG] UPDATED)\nAbstract: It has been increasingly demanding to develop reliable methods to evaluate the progress of Graph Neural Network (GNN) research for molecular representation learning. Existing GNN benchmarking methods for molecular representation learning focus on comparing the GNNs' performances on some node/graph classification/regression tasks on certain datasets. However, there lacks a principled, task-agnostic method to directly compare two GNNs. Additionally, most of the existing self-supervised learning works incorporate handcrafted augmentations to the data, which has several severe difficulties to be applied on graphs due to their unique characteristics. To address the aforementioned issues, we propose GraphAC (Graph Adversarial Collaboration) -a conceptually novel, principled, task-agnostic, and stable framework for evaluating GNNs through contrastive self-supervision. We introduce a novel objective function: the Competitive Barlow Twins, that allow two GNNs to jointly update themselves from",
    "path": "papers/23/01/2301.11517.json",
    "total_tokens": 870,
    "translated_title": "通过对抗协作实现任务无关的图神经网络评估",
    "translated_abstract": "针对分子表示学习中图神经网络（GNN）研究进展的评估需要可靠的方法的需求不断增加。现有的用于分子表示学习的GNN基准测试方法主要关注于比较GNN在某些节点/图分类/回归任务和特定数据集上的表现。然而，缺乏一种原则性、任务无关的直接比较两个GNN的方法。此外，大多数现有的自监督学习方法都会将数据手工扩增，但由于图的特殊性，这种方法存在严重的困难。为解决上述问题，我们提出了GraphAC（Graph Adversarial Collaboration），这是一种具有概念性、原则性、任务无关性和稳定性的新框架，用于通过对比自我监督来评估GNN。我们引入了竞争性 Barlow Twins 目标函数，允许两个 GNN 共同更新。",
    "tldr": "为了评估图神经网络，提出了一种通过对抗自我监督的概念性新框架，并引入了竞争性Barlow Twins目标函数，使两个GNN可以一起更新。"
}