{
    "title": "A Latent Space Correlation-Aware Autoencoder for Anomaly Detection in Skewed Data",
    "abstract": "arXiv:2301.00462v3 Announce Type: replace  Abstract: Unsupervised learning-based anomaly detection in latent space has gained importance since discriminating anomalies from normal data becomes difficult in high-dimensional space. Both density estimation and distance-based methods to detect anomalies in latent space have been explored in the past. These methods prove that retaining valuable properties of input data in latent space helps in the better reconstruction of test data. Moreover, real-world sensor data is skewed and non-Gaussian in nature, making mean-based estimators unreliable for skewed data. Again, anomaly detection methods based on reconstruction error rely on Euclidean distance, which does not consider useful correlation information in the feature space and also fails to accurately reconstruct the data when it deviates from the training distribution. In this work, we address the limitations of reconstruction error-based autoencoders and propose a kernelized autoencoder th",
    "link": "https://arxiv.org/abs/2301.00462",
    "context": "Title: A Latent Space Correlation-Aware Autoencoder for Anomaly Detection in Skewed Data\nAbstract: arXiv:2301.00462v3 Announce Type: replace  Abstract: Unsupervised learning-based anomaly detection in latent space has gained importance since discriminating anomalies from normal data becomes difficult in high-dimensional space. Both density estimation and distance-based methods to detect anomalies in latent space have been explored in the past. These methods prove that retaining valuable properties of input data in latent space helps in the better reconstruction of test data. Moreover, real-world sensor data is skewed and non-Gaussian in nature, making mean-based estimators unreliable for skewed data. Again, anomaly detection methods based on reconstruction error rely on Euclidean distance, which does not consider useful correlation information in the feature space and also fails to accurately reconstruct the data when it deviates from the training distribution. In this work, we address the limitations of reconstruction error-based autoencoders and propose a kernelized autoencoder th",
    "path": "papers/23/01/2301.00462.json",
    "total_tokens": 849,
    "translated_title": "一种潜变量空间相关感知自编码器用于偏斜数据中的异常检测",
    "translated_abstract": "无监督学习的潜变量空间中的异常检测在高维空间中区分异常数据和正常数据变得困难，因此变得越来越重要。过去已经探索了在潜变量空间中检测异常的密度估计和基于距离的方法。这些方法证明在潜变量空间中保留输入数据的有价值属性有助于更好地重构测试数据。此外，现实世界的传感器数据是偏斜且非高斯性的，使得基于平均的估计器对于偏斜数据不可靠。再者，基于重构误差的异常检测方法依赖于欧氏距离，不考虑特征空间中的有用相关信息，并且在该数据偏离训练分布时无法准确地重构数据。在这项工作中，我们解决了基于重构误差的自编码器的局限性，并提出了一种基于核的自编码器来解决偏斜数据中的异常检测问题。",
    "tldr": "这项工作提出了一种潜变量空间相关感知自编码器，用于解决传感器数据偏斜且非高斯性的异常检测问题。",
    "en_tdlr": "This work proposes a latent space correlation-aware autoencoder to address the problem of anomaly detection in skewed and non-Gaussian sensor data."
}