{
    "title": "Graphical House Allocation. (arXiv:2301.01323v2 [cs.GT] UPDATED)",
    "abstract": "The classical house allocation problem involves assigning $n$ houses (or items) to $n$ agents according to their preferences. A key criterion in such problems is satisfying some fairness constraints such as envy-freeness. We consider a generalization of this problem wherein the agents are placed along the vertices of a graph (corresponding to a social network), and each agent can only experience envy towards its neighbors. Our goal is to minimize the aggregate envy among the agents as a natural fairness objective, i.e., the sum of all pairwise envy values over all edges in a social graph.  When agents have identical and evenly-spaced valuations, our problem reduces to the well-studied problem of linear arrangements. For identical valuations with possibly uneven spacing, we show a number of deep and surprising ways in which our setting is a departure from this classical problem. More broadly, we contribute several structural and computational results for various classes of graphs, inclu",
    "link": "http://arxiv.org/abs/2301.01323",
    "context": "Title: Graphical House Allocation. (arXiv:2301.01323v2 [cs.GT] UPDATED)\nAbstract: The classical house allocation problem involves assigning $n$ houses (or items) to $n$ agents according to their preferences. A key criterion in such problems is satisfying some fairness constraints such as envy-freeness. We consider a generalization of this problem wherein the agents are placed along the vertices of a graph (corresponding to a social network), and each agent can only experience envy towards its neighbors. Our goal is to minimize the aggregate envy among the agents as a natural fairness objective, i.e., the sum of all pairwise envy values over all edges in a social graph.  When agents have identical and evenly-spaced valuations, our problem reduces to the well-studied problem of linear arrangements. For identical valuations with possibly uneven spacing, we show a number of deep and surprising ways in which our setting is a departure from this classical problem. More broadly, we contribute several structural and computational results for various classes of graphs, inclu",
    "path": "papers/23/01/2301.01323.json",
    "total_tokens": 879,
    "translated_title": "图形房屋分配",
    "translated_abstract": "经典的房屋分配问题涉及根据个体的偏好分配n套房子（或物品）给n个个体。这类问题中的一个关键准则是满足一些公平性约束，如无嫉妒性。我们考虑这个问题的一个推广，即将个体放置在图的顶点上（对应社交网络），每个个体只能对其邻居感到嫉妒。我们的目标是将个体之间的总嫉妒最小化，作为一种自然的公平目标，即在社交图中所有边上的所有成对嫉妒值的总和。当个体具有相同且均匀分布的估价时，我们的问题归结为已研究的线性排列问题。对于可能不均匀分布的相同估价，我们展示了我们的设置与这一经典问题的几个深入和令人惊讶的不同之处。更广泛地说，我们为各类图的结构和计算结果做出了几项贡献",
    "tldr": "这篇论文探讨了图形房屋分配问题，将个体放置在图的顶点上，开发了几种结构和计算方法，以最小化个体之间的嫉妒程度作为公平目标。",
    "en_tdlr": "This paper explores the problem of graphical house allocation, where agents are placed on the vertices of a graph, and presents several structural and computational approaches to minimize envy among agents as a fairness objective."
}