{
    "title": "A Meta Path-based Approach for Rumor Detection on Social Media. (arXiv:2301.04341v2 [cs.SI] UPDATED)",
    "abstract": "The prominent role of social media in people's daily lives has made them more inclined to receive news through social networks than traditional sources. This shift in public behavior has opened doors for some to diffuse fake news on social media; and subsequently cause negative economic, political, and social consequences as well as distrust among the public.  There are many proposed methods to solve the rumor detection problem, most of which do not take full advantage of the heterogeneous nature of news propagation networks. With this intention, we considered a previously proposed architecture as our baseline and performed the idea of structural feature extraction from the heterogeneous rumor propagation over its architecture using the concept of meta path-based embeddings. We named our model Meta Path-based Global Local Attention Network (MGLAN). Extensive experimental analysis on three state-of-the-art datasets has demonstrated that MGLAN outperforms other models by capturing node-l",
    "link": "http://arxiv.org/abs/2301.04341",
    "context": "Title: A Meta Path-based Approach for Rumor Detection on Social Media. (arXiv:2301.04341v2 [cs.SI] UPDATED)\nAbstract: The prominent role of social media in people's daily lives has made them more inclined to receive news through social networks than traditional sources. This shift in public behavior has opened doors for some to diffuse fake news on social media; and subsequently cause negative economic, political, and social consequences as well as distrust among the public.  There are many proposed methods to solve the rumor detection problem, most of which do not take full advantage of the heterogeneous nature of news propagation networks. With this intention, we considered a previously proposed architecture as our baseline and performed the idea of structural feature extraction from the heterogeneous rumor propagation over its architecture using the concept of meta path-based embeddings. We named our model Meta Path-based Global Local Attention Network (MGLAN). Extensive experimental analysis on three state-of-the-art datasets has demonstrated that MGLAN outperforms other models by capturing node-l",
    "path": "papers/23/01/2301.04341.json",
    "total_tokens": 767,
    "translated_title": "基于元路径的社交媒体谣言检测方法研究",
    "translated_abstract": "社交媒体在人们的日常生活中起着重要作用，使得人们更倾向于通过社交网络而不是传统来源获取新闻。这种公众行为的转变为一些人传播假新闻在社交媒体上打开了大门，随之带来了负面的经济、政治和社会后果，也引起了公众的不信任。本文提出了一种基于元路径的全局局部注意网络（MGLAN）的模型，通过从异质谣言传播中抽取结构特征来解决谣言检测问题。实验结果表明，MGLAN超越其他模型，能够捕捉节点的重要性和网络的动态变化。",
    "tldr": "本文提出了一种基于元路径的全局局部注意网络（MGLAN）的模型，通过提取谣言传播的结构特征，有效解决谣言检测问题。"
}