{
    "title": "A theory of continuous generative flow networks. (arXiv:2301.12594v2 [cs.LG] UPDATED)",
    "abstract": "Generative flow networks (GFlowNets) are amortized variational inference algorithms that are trained to sample from unnormalized target distributions over compositional objects. A key limitation of GFlowNets until this time has been that they are restricted to discrete spaces. We present a theory for generalized GFlowNets, which encompasses both existing discrete GFlowNets and ones with continuous or hybrid state spaces, and perform experiments with two goals in mind. First, we illustrate critical points of the theory and the importance of various assumptions. Second, we empirically demonstrate how observations about discrete GFlowNets transfer to the continuous case and show strong results compared to non-GFlowNet baselines on several previously studied tasks. This work greatly widens the perspectives for the application of GFlowNets in probabilistic inference and various modeling settings.",
    "link": "http://arxiv.org/abs/2301.12594",
    "context": "Title: A theory of continuous generative flow networks. (arXiv:2301.12594v2 [cs.LG] UPDATED)\nAbstract: Generative flow networks (GFlowNets) are amortized variational inference algorithms that are trained to sample from unnormalized target distributions over compositional objects. A key limitation of GFlowNets until this time has been that they are restricted to discrete spaces. We present a theory for generalized GFlowNets, which encompasses both existing discrete GFlowNets and ones with continuous or hybrid state spaces, and perform experiments with two goals in mind. First, we illustrate critical points of the theory and the importance of various assumptions. Second, we empirically demonstrate how observations about discrete GFlowNets transfer to the continuous case and show strong results compared to non-GFlowNet baselines on several previously studied tasks. This work greatly widens the perspectives for the application of GFlowNets in probabilistic inference and various modeling settings.",
    "path": "papers/23/01/2301.12594.json",
    "total_tokens": 870,
    "translated_title": "连续生成流网络的理论",
    "translated_abstract": "生成流网络（GFlowNets）是一种常规化变分推理算法，被训练用于从组合对象的未归一化目标分布中进行采样。GFlowNets 的一个关键限制到目前为止一直是它们仅适用于离散空间。我们提出了一个通用 GFlowNets 的理论，它包括现有的离散 GFlowNets 和连续或混合状态空间中的 GFlowNets，并通过两个目标进行实验。首先，我们阐述了理论的关键点以及各种假设的重要性。其次，我们在几个之前研究的任务中，证明了关于离散 GFlowNets 的观察结果如何转化为连续情况，并与非 GFlowNet 基线相比表现出很强的结果。这项工作极大地扩展了将 GFlowNets 应用于概率推理和各种建模设置的视角。",
    "tldr": "本文提出了一种通用 GFlowNets 的理论，可以适用于连续或混合状态空间，通过实验证明其与非 GFlowNet 基线相比表现出很强的结果，极大地扩展了将 GFlowNets 应用于概率推理和各种建模设置的视角。",
    "en_tdlr": "This paper presents a theory for generalizd GFlowNets that can be applied to continuous or hybrid state spaces. The experiments demonstrate its strong results compared to non-GFlowNet baselines, which greatly extends the perspective of applying GFlowNets in probabilistic inference and various modeling settings."
}