{
    "title": "Concept Discovery for Fast Adapatation. (arXiv:2301.07850v2 [cs.LG] UPDATED)",
    "abstract": "The advances in deep learning have enabled machine learning methods to outperform human beings in various areas, but it remains a great challenge for a well-trained model to quickly adapt to a new task. One promising solution to realize this goal is through meta-learning, also known as learning to learn, which has achieved promising results in few-shot learning. However, current approaches are still enormously different from human beings' learning process, especially in the ability to extract structural and transferable knowledge. This drawback makes current meta-learning frameworks non-interpretable and hard to extend to more complex tasks. We tackle this problem by introducing concept discovery to the few-shot learning problem, where we achieve more effective adaptation by meta-learning the structure among the data features, leading to a composite representation of the data. Our proposed method Concept-Based Model-Agnostic Meta-Learning (COMAML) has been shown to achieve consistent i",
    "link": "http://arxiv.org/abs/2301.07850",
    "context": "Title: Concept Discovery for Fast Adapatation. (arXiv:2301.07850v2 [cs.LG] UPDATED)\nAbstract: The advances in deep learning have enabled machine learning methods to outperform human beings in various areas, but it remains a great challenge for a well-trained model to quickly adapt to a new task. One promising solution to realize this goal is through meta-learning, also known as learning to learn, which has achieved promising results in few-shot learning. However, current approaches are still enormously different from human beings' learning process, especially in the ability to extract structural and transferable knowledge. This drawback makes current meta-learning frameworks non-interpretable and hard to extend to more complex tasks. We tackle this problem by introducing concept discovery to the few-shot learning problem, where we achieve more effective adaptation by meta-learning the structure among the data features, leading to a composite representation of the data. Our proposed method Concept-Based Model-Agnostic Meta-Learning (COMAML) has been shown to achieve consistent i",
    "path": "papers/23/01/2301.07850.json",
    "total_tokens": 864,
    "translated_title": "快速适应的概念发现",
    "translated_abstract": "深度学习的进步使得机器学习方法在各个领域都能超越人类表现，但对于一个已经训练好的模型快速适应到一个新的任务仍然是一个巨大的挑战。为了实现这个目标，元学习（也称为学习如何学习）是一个很有前途的解决方案之一，在few-shot学习方面已经取得了很好的结果。然而，目前的方法在提取可结构化和可转移的知识方面仍与人类学习过程有很大不同。这一缺点使得当前的元学习框架难以解释，也难以扩展到更复杂的任务。我们通过将概念发现引入到few-shot学习问题中来解决这个问题，通过元学习数据特征之间的结构，实现更有效的适应，从而导出数据的复合表示形式。我们提出的基于概念的模型不可知元学习方法（COMAML）已经在各种任务中得到了一致的表现。",
    "tldr": "本论文提出了一个基于概念发现的模型不可知元学习方法（COMAML），通过元学习数据特征之间的结构，实现更有效的适应。",
    "en_tdlr": "This paper proposes a Concept-Based Model-Agnostic Meta-Learning (COMAML) approach that incorporates concept discovery to achieve effective adaptation by meta-learning the structure among data features."
}