{
    "title": "Asymptotic Theory for Two-Way Clustering",
    "abstract": "arXiv:2301.03805v2 Announce Type: replace  Abstract: This paper proves a new central limit theorem for a sample that exhibits two-way dependence and heterogeneity across clusters. Statistical inference for situations with both two-way dependence and cluster heterogeneity has thus far been an open issue. The existing theory for two-way clustering inference requires identical distributions across clusters (implied by the so-called separate exchangeability assumption). Yet no such homogeneity requirement is needed in the existing theory for one-way clustering. The new result therefore theoretically justifies the view that two-way clustering is a more robust version of one-way clustering, consistent with applied practice. The result is applied to linear regression, where it is shown that a standard plug-in variance estimator is valid for inference.",
    "link": "https://arxiv.org/abs/2301.03805",
    "context": "Title: Asymptotic Theory for Two-Way Clustering\nAbstract: arXiv:2301.03805v2 Announce Type: replace  Abstract: This paper proves a new central limit theorem for a sample that exhibits two-way dependence and heterogeneity across clusters. Statistical inference for situations with both two-way dependence and cluster heterogeneity has thus far been an open issue. The existing theory for two-way clustering inference requires identical distributions across clusters (implied by the so-called separate exchangeability assumption). Yet no such homogeneity requirement is needed in the existing theory for one-way clustering. The new result therefore theoretically justifies the view that two-way clustering is a more robust version of one-way clustering, consistent with applied practice. The result is applied to linear regression, where it is shown that a standard plug-in variance estimator is valid for inference.",
    "path": "papers/23/01/2301.03805.json",
    "total_tokens": 779,
    "translated_title": "两路聚类的渐近理论",
    "translated_abstract": "本文证明了对于表现出两路依赖性和集群异质性的样本，存在一种新的中心极限定理。至今，在具有两路依赖性和集群异质性情况下的统计推断一直是一个悬而未决的问题。现有的两路聚类推断理论要求集群间具有相同的分布（所谓的独立交换性假设所导出的），而在现有的一路聚类理论中并不需要这样的同质性要求。因此，新的结果从理论上证实了两路聚类是一路聚类的更稳健版本，并与应用实践一致。该结果应用于线性回归，显示了标准插补方差估计是有效的推断方法。",
    "tldr": "该论文证明了针对表现出两路依赖性和集群异质性样本的新中心极限定理，弥补了先前只适用于具有同质性要求的两路聚类推断理论，并在推断上对线性回归进行了验证。",
    "en_tdlr": "This paper establishes a new central limit theorem for a sample with two-way dependence and cluster heterogeneity, filling the gap in existing inference theories for two-way clustering that require homogeneity across clusters, while validating the standard plug-in variance estimator for linear regression inference."
}