{
    "title": "Neural Continuous-Discrete State Space Models for Irregularly-Sampled Time Series. (arXiv:2301.11308v3 [cs.LG] UPDATED)",
    "abstract": "Learning accurate predictive models of real-world dynamic phenomena (e.g., climate, biological) remains a challenging task. One key issue is that the data generated by both natural and artificial processes often comprise time series that are irregularly sampled and/or contain missing observations. In this work, we propose the Neural Continuous-Discrete State Space Model (NCDSSM) for continuous-time modeling of time series through discrete-time observations. NCDSSM employs auxiliary variables to disentangle recognition from dynamics, thus requiring amortized inference only for the auxiliary variables. Leveraging techniques from continuous-discrete filtering theory, we demonstrate how to perform accurate Bayesian inference for the dynamic states. We propose three flexible parameterizations of the latent dynamics and an efficient training objective that marginalizes the dynamic states during inference. Empirical results on multiple benchmark datasets across various domains show improved i",
    "link": "http://arxiv.org/abs/2301.11308",
    "context": "Title: Neural Continuous-Discrete State Space Models for Irregularly-Sampled Time Series. (arXiv:2301.11308v3 [cs.LG] UPDATED)\nAbstract: Learning accurate predictive models of real-world dynamic phenomena (e.g., climate, biological) remains a challenging task. One key issue is that the data generated by both natural and artificial processes often comprise time series that are irregularly sampled and/or contain missing observations. In this work, we propose the Neural Continuous-Discrete State Space Model (NCDSSM) for continuous-time modeling of time series through discrete-time observations. NCDSSM employs auxiliary variables to disentangle recognition from dynamics, thus requiring amortized inference only for the auxiliary variables. Leveraging techniques from continuous-discrete filtering theory, we demonstrate how to perform accurate Bayesian inference for the dynamic states. We propose three flexible parameterizations of the latent dynamics and an efficient training objective that marginalizes the dynamic states during inference. Empirical results on multiple benchmark datasets across various domains show improved i",
    "path": "papers/23/01/2301.11308.json",
    "total_tokens": 897,
    "translated_title": "针对不规则采样时间序列的神经连续离散状态空间模型",
    "translated_abstract": "学习真实世界动态现象（如气候、生物学等）的准确预测模型仍然是一个具有挑战性的任务。一项关键问题是，自然和人工过程生成的数据往往包含不规则采样和/或缺失的时间序列。本研究提出神经连续离散状态空间模型（NCDSSM），用于通过离散时间观测对时间序列进行连续时间建模。NCDSSM采用辅助变量来区分识别和动态，因此仅需要对辅助变量进行摊销推理。利用连续-离散滤波理论的技术，我们展示了如何对动态状态进行准确的贝叶斯推断。我们提出了三种灵活的潜在动态参数化方法和一种在推断期间对动态状态进行边缘化的高效培训目标。在各个领域的多个基准数据集上的实证结果表明了改进了的性能。",
    "tldr": "本研究提出了一个用于不规则采样时间序列的神经连续离散状态空间模型，其采用辅助变量来区分识别和动态，从而实现了准确的贝叶斯推理和改进的性能。"
}