{
    "title": "Is ChatGPT A Good Translator? Yes With GPT-4 As The Engine. (arXiv:2301.08745v3 [cs.CL] UPDATED)",
    "abstract": "This report provides a preliminary evaluation of ChatGPT for machine translation, including translation prompt, multilingual translation, and translation robustness. We adopt the prompts advised by ChatGPT to trigger its translation ability and find that the candidate prompts generally work well and show minor performance differences. By evaluating on a number of benchmark test sets, we find that ChatGPT performs competitively with commercial translation products (e.g., Google Translate) on high-resource European languages but lags behind significantly on low-resource or distant languages. For distant languages, we explore an interesting strategy named $\\mathbf{pivot~prompting}$ that asks ChatGPT to translate the source sentence into a high-resource pivot language before into the target language, which improves the translation performance significantly. As for the translation robustness, ChatGPT does not perform as well as the commercial systems on biomedical abstracts or Reddit commen",
    "link": "http://arxiv.org/abs/2301.08745",
    "context": "Title: Is ChatGPT A Good Translator? Yes With GPT-4 As The Engine. (arXiv:2301.08745v3 [cs.CL] UPDATED)\nAbstract: This report provides a preliminary evaluation of ChatGPT for machine translation, including translation prompt, multilingual translation, and translation robustness. We adopt the prompts advised by ChatGPT to trigger its translation ability and find that the candidate prompts generally work well and show minor performance differences. By evaluating on a number of benchmark test sets, we find that ChatGPT performs competitively with commercial translation products (e.g., Google Translate) on high-resource European languages but lags behind significantly on low-resource or distant languages. For distant languages, we explore an interesting strategy named $\\mathbf{pivot~prompting}$ that asks ChatGPT to translate the source sentence into a high-resource pivot language before into the target language, which improves the translation performance significantly. As for the translation robustness, ChatGPT does not perform as well as the commercial systems on biomedical abstracts or Reddit commen",
    "path": "papers/23/01/2301.08745.json",
    "total_tokens": 996,
    "translated_title": "ChatGPT作为翻译引擎，依赖于GPT-4，是一种好的翻译器吗？",
    "translated_abstract": "本报告对ChatGPT进行了机器翻译的初步评估，包括翻译提示、多语言翻译和翻译的鲁棒性。我们采用ChatGPT建议的提示来触发其翻译能力，发现候选提示通常运行良好，表现出轻微的性能差异。通过在多个基准测试集上进行评估，发现在高资源的欧洲语言上，ChatGPT的表现与商业翻译产品（例如Google翻译）相当，但在低资源或远程语言上表现显著滞后。对于远程语言，我们探索了一种有趣的策略，称为$\\mathbf{枢轴提示}$，即让ChatGPT先将源语言句子翻译成高资源的轴语言，再翻译目标语言，这显著提高了翻译性能。至于翻译的鲁棒性，在生物医学摘要或Reddit评论方面，ChatGPT的表现不如商业系统。",
    "tldr": "本论文评估了ChatGPT的机器翻译能力，发现它在高资源欧洲语言上表现良好，但在低资源或远程语言上表现滞后；采用枢轴提示可以显著提高远程语言翻译的性能；在生物医学摘要或Reddit评论方面，ChatGPT的表现不如商业系统。",
    "en_tdlr": "This paper evaluates the machine translation ability of ChatGPT using GPT-4 as the engine, and finds that it performs well on high-resource European languages but lags behind on low-resource or distant languages; using pivot prompting can significantly improve translation performance for distant languages; ChatGPT does not perform as well as commercial systems on biomedical abstracts or Reddit comments."
}