{
    "title": "Generative CVaR Portfolio Optimization with Attention-Powered Dynamic Factor Learning. (arXiv:2301.07318v3 [q-fin.PM] UPDATED)",
    "abstract": "The dynamic portfolio construction problem requires dynamic modeling of the joint distribution of multivariate stock returns. To achieve this, we propose a dynamic generative factor model which uses random variable transformation as an implicit way of distribution modeling and relies on the Attention-GRU network for dynamic learning and forecasting. The proposed model captures the dynamic dependence among multivariate stock returns, especially focusing on the tail-side properties. We also propose a two-step iterative algorithm to train the model and then predict the time-varying model parameters, including the time-invariant tail parameters. At each investment date, we can easily simulate new samples from the learned generative model, and we further perform CVaR portfolio optimization with the simulated samples to form a dynamic portfolio strategy. The numerical experiment on stock data shows that our model leads to wiser investments that promise higher reward-risk ratios and present l",
    "link": "http://arxiv.org/abs/2301.07318",
    "context": "Title: Generative CVaR Portfolio Optimization with Attention-Powered Dynamic Factor Learning. (arXiv:2301.07318v3 [q-fin.PM] UPDATED)\nAbstract: The dynamic portfolio construction problem requires dynamic modeling of the joint distribution of multivariate stock returns. To achieve this, we propose a dynamic generative factor model which uses random variable transformation as an implicit way of distribution modeling and relies on the Attention-GRU network for dynamic learning and forecasting. The proposed model captures the dynamic dependence among multivariate stock returns, especially focusing on the tail-side properties. We also propose a two-step iterative algorithm to train the model and then predict the time-varying model parameters, including the time-invariant tail parameters. At each investment date, we can easily simulate new samples from the learned generative model, and we further perform CVaR portfolio optimization with the simulated samples to form a dynamic portfolio strategy. The numerical experiment on stock data shows that our model leads to wiser investments that promise higher reward-risk ratios and present l",
    "path": "papers/23/01/2301.07318.json",
    "total_tokens": 1016,
    "translated_title": "使用注意力驱动的动态因子学习的生成CVaR组合优化算法",
    "translated_abstract": "动态组合构建问题需要动态建模多元股票收益的联合分布。为了实现这一目标，我们提出了一种动态生成因子模型，它使用随机变量转换作为分布建模的隐式方式，并依赖于使用注意力-GRU网络进行动态学习和预测。所提出的模型捕捉了多元股票收益之间的动态依赖关系，特别是关注尾部属性。我们还提出了一个两步迭代算法来训练模型，然后预测时变的模型参数，包括时不变的尾部参数。在每个投资日期，我们可以轻松地从学习到的生成模型中模拟新样本，并进一步使用模拟样本来进行CVaR组合优化，形成动态组合策略。对股票数据的数值实验表明，我们的模型可以带来更明智的投资，承诺更高的回报风险比，并呈现出...",
    "tldr": "本论文提出了一种使用注意力驱动的动态因子学习的生成CVaR组合优化算法，通过随机变量转换作为分布建模的隐式方式，以及使用注意力-GRU网络进行动态学习和预测，捕捉了多元股票收益之间的动态依赖关系，特别是关注尾部属性。通过在每个投资日期从学习到的生成模型中模拟新样本，并进一步应用CVaR组合优化策略，实现了更明智的投资决策。"
}