{
    "title": "Sequential Estimation of Gaussian Process-based Deep State-Space Models",
    "abstract": "arXiv:2301.12528v2 Announce Type: replace  Abstract: We consider the problem of sequential estimation of the unknowns of state-space and deep state-space models that include estimation of functions and latent processes of the models. The proposed approach relies on Gaussian and deep Gaussian processes that are implemented via random feature-based Gaussian processes. In these models, we have two sets of unknowns, highly nonlinear unknowns (the values of the latent processes) and conditionally linear unknowns (the constant parameters of the random feature-based Gaussian processes). We present a method based on particle filtering where the parameters of the random feature-based Gaussian processes are integrated out in obtaining the predictive density of the states and do not need particles. We also propose an ensemble version of the method, with each member of the ensemble having its own set of features. With several experiments, we show that the method can track the latent processes up t",
    "link": "https://arxiv.org/abs/2301.12528",
    "context": "Title: Sequential Estimation of Gaussian Process-based Deep State-Space Models\nAbstract: arXiv:2301.12528v2 Announce Type: replace  Abstract: We consider the problem of sequential estimation of the unknowns of state-space and deep state-space models that include estimation of functions and latent processes of the models. The proposed approach relies on Gaussian and deep Gaussian processes that are implemented via random feature-based Gaussian processes. In these models, we have two sets of unknowns, highly nonlinear unknowns (the values of the latent processes) and conditionally linear unknowns (the constant parameters of the random feature-based Gaussian processes). We present a method based on particle filtering where the parameters of the random feature-based Gaussian processes are integrated out in obtaining the predictive density of the states and do not need particles. We also propose an ensemble version of the method, with each member of the ensemble having its own set of features. With several experiments, we show that the method can track the latent processes up t",
    "path": "papers/23/01/2301.12528.json",
    "total_tokens": 822,
    "translated_title": "基于高斯过程的深度状态空间模型的顺序估计",
    "translated_abstract": "我们考虑了包括函数估计和模型的潜在过程在内的状态空间和深度状态空间模型的未知量的顺序估计问题。所提出的方法依赖于通过随机特征的高斯过程实现的高斯和深度高斯过程。在这些模型中，我们有两组未知量，高度非线性未知量（潜在过程的值）和条件线性未知量（基于随机特征的高斯过程的常数参数）。我们提出了一种基于粒子滤波的方法，其中基于随机特征的高斯过程的参数在获得状态的预测密度时被整合在外，不需要粒子。我们还提出了该方法的集合版本，其中集合的每个成员都有自己的特征集。通过多个实验，我们展示了该方法可以跟踪潜在过程直到...",
    "tldr": "该论文提出了一种基于高斯过程和深度高斯过程的方法，用于顺序估计包括潜在过程在内的状态空间和深度状态空间模型的未知量。",
    "en_tdlr": "This paper proposes a method based on Gaussian processes and deep Gaussian processes for sequentially estimating the unknowns of state-space and deep state-space models, including latent processes."
}