{
    "title": "Geometry of Set Functions in Game Theory: Combinatorial and Computational Aspects. (arXiv:2301.02950v2 [cs.GT] UPDATED)",
    "abstract": "The main ambition of this thesis is to contribute to the development of cooperative game theory towards combinatorics, algorithmics and discrete geometry. Therefore, the first chapter of this manuscript is devoted to highlighting the geometric nature of the coalition functions of transferable utility games and spotlights the existing connections with the theory of submodular set functions and polyhedral geometry.  To deepen the links with polyhedral geometry, we define a new family of polyhedra, called the basic polyhedra, on which we can apply a generalized version of the Bondareva-Shapley Theorem to check their nonemptiness. To allow a practical use of these computational tools, we present an algorithmic procedure generating the minimal balanced collections, based on Peleg's method. Subsequently, we apply the generalization of the Bondareva-Shapley Theorem to design a collection of algorithmic procedures able to check properties or generate specific sets of coalitions.  In the next c",
    "link": "http://arxiv.org/abs/2301.02950",
    "context": "Title: Geometry of Set Functions in Game Theory: Combinatorial and Computational Aspects. (arXiv:2301.02950v2 [cs.GT] UPDATED)\nAbstract: The main ambition of this thesis is to contribute to the development of cooperative game theory towards combinatorics, algorithmics and discrete geometry. Therefore, the first chapter of this manuscript is devoted to highlighting the geometric nature of the coalition functions of transferable utility games and spotlights the existing connections with the theory of submodular set functions and polyhedral geometry.  To deepen the links with polyhedral geometry, we define a new family of polyhedra, called the basic polyhedra, on which we can apply a generalized version of the Bondareva-Shapley Theorem to check their nonemptiness. To allow a practical use of these computational tools, we present an algorithmic procedure generating the minimal balanced collections, based on Peleg's method. Subsequently, we apply the generalization of the Bondareva-Shapley Theorem to design a collection of algorithmic procedures able to check properties or generate specific sets of coalitions.  In the next c",
    "path": "papers/23/01/2301.02950.json",
    "total_tokens": 943,
    "translated_title": "博弈论中集合函数的几何：组合和计算方面的研究",
    "translated_abstract": "本论文的主要目标是为合作博弈论在组合学、算法和离散几何方面的发展做出贡献。因此，本文的第一章致力于突出可转移效用博弈的联盟函数的几何性质，并关注其与子模集函数和多面几何的现有联系。为了加深与多面几何的联系，我们定义了一类新的多面体，称为基本多面体，并应用广义的Bondareva-Shapley定理来检验它们的非空性。为了允许这些计算工具的实际使用，我们提出了基于Peleg方法的生成最小平衡集合的算法过程。随后，我们应用广义的Bondareva-Shapley定理来设计一系列算法过程，能够检验性质或生成特定的联盟集合。",
    "tldr": "本论文通过研究合作博弈论中集合函数的几何性质，提出了一种新的多面体，通过应用广义的Bondareva-Shapley定理进行验证。同时，还提出了一系列算法过程来检验性质或生成特定的联盟集合。"
}