{
    "title": "MGeo: Multi-Modal Geographic Pre-Training Method. (arXiv:2301.04283v2 [cs.CL] UPDATED)",
    "abstract": "As a core task in location-based services (LBS) (e.g., navigation maps), query and point of interest (POI) matching connects users' intent with real-world geographic information. Recently, pre-trained models (PTMs) have made advancements in many natural language processing (NLP) tasks. Generic text-based PTMs do not have enough geographic knowledge for query-POI matching. To overcome this limitation, related literature attempts to employ domain-adaptive pre-training based on geo-related corpus. However, a query generally contains mentions of multiple geographic objects, such as nearby roads and regions of interest (ROIs). The geographic context (GC), i.e., these diverse geographic objects and their relationships, is therefore pivotal to retrieving the most relevant POI. Single-modal PTMs can barely make use of the important GC and therefore have limited performance. In this work, we propose a novel query-POI matching method Multi-modal Geographic language model (MGeo), which comprises ",
    "link": "http://arxiv.org/abs/2301.04283",
    "context": "Title: MGeo: Multi-Modal Geographic Pre-Training Method. (arXiv:2301.04283v2 [cs.CL] UPDATED)\nAbstract: As a core task in location-based services (LBS) (e.g., navigation maps), query and point of interest (POI) matching connects users' intent with real-world geographic information. Recently, pre-trained models (PTMs) have made advancements in many natural language processing (NLP) tasks. Generic text-based PTMs do not have enough geographic knowledge for query-POI matching. To overcome this limitation, related literature attempts to employ domain-adaptive pre-training based on geo-related corpus. However, a query generally contains mentions of multiple geographic objects, such as nearby roads and regions of interest (ROIs). The geographic context (GC), i.e., these diverse geographic objects and their relationships, is therefore pivotal to retrieving the most relevant POI. Single-modal PTMs can barely make use of the important GC and therefore have limited performance. In this work, we propose a novel query-POI matching method Multi-modal Geographic language model (MGeo), which comprises ",
    "path": "papers/23/01/2301.04283.json",
    "total_tokens": 879,
    "translated_title": "MGeo：多模态地理预训练方法",
    "translated_abstract": "查询与兴趣点 (POI) 匹配是基于位置的服务 (LBS) 中的核心任务（如导航地图），它将用户的意图与真实世界的地理信息相连接。最近，预训练模型 (PTM) 在许多自然语言处理 (NLP) 任务中都取得了进展。通用的基于文本的 PTM 并没有足够的地理知识用于查询-POI 匹配。为了克服这个局限性，相关文献尝试根据地理相关语料库采用领域自适应预训练。但是，查询通常包含多个地理对象的提及，比如附近的道路和利益区域（ROIs）。这些多样化的地理对象及其关系被称为地理上下文（GC）,对于检索最相关的 POI，是至关重要的。单模态 PTM 很难利用重要的地理上下文，因此性能受限。在这项工作中，我们提出了一种新的查询-POI 匹配方法“多模态地理语言模型”(MGeo)，它包括......",
    "tldr": "本文提出了一种新的查询-POI匹配方法MGeo，通过结合多模态数据，有效利用多样化的地理信息上下文提高了性能。",
    "en_tdlr": "This paper proposes a novel query-POI matching method, MGeo, which effectively utilizes diverse geographic contextual information by combining multi-modal data, to improve performance."
}