{
    "title": "Navigating Alignment for Non-identical Client Class Sets: A Label Name-Anchored Federated Learning Framework. (arXiv:2301.00489v2 [cs.LG] UPDATED)",
    "abstract": "Traditional federated classification methods, even those designed for non-IID clients, assume that each client annotates its local data with respect to the same universal class set. In this paper, we focus on a more general yet practical setting, non-identical client class sets, where clients focus on their own (different or even non-overlapping) class sets and seek a global model that works for the union of these classes. If one views classification as finding the best match between representations produced by data/label encoder, such heterogeneity in client class sets poses a new significant challenge -local encoders at different clients may operate in different and even independent latent spaces, making it hard to aggregate at the server. We propose a novel framework, FedAlign, to align the latent spaces across clients from both label and data perspectives. From a label perspective, we leverage the expressive natural language class names as a common ground for label encoders to an",
    "link": "http://arxiv.org/abs/2301.00489",
    "context": "Title: Navigating Alignment for Non-identical Client Class Sets: A Label Name-Anchored Federated Learning Framework. (arXiv:2301.00489v2 [cs.LG] UPDATED)\nAbstract: Traditional federated classification methods, even those designed for non-IID clients, assume that each client annotates its local data with respect to the same universal class set. In this paper, we focus on a more general yet practical setting, non-identical client class sets, where clients focus on their own (different or even non-overlapping) class sets and seek a global model that works for the union of these classes. If one views classification as finding the best match between representations produced by data/label encoder, such heterogeneity in client class sets poses a new significant challenge -local encoders at different clients may operate in different and even independent latent spaces, making it hard to aggregate at the server. We propose a novel framework, FedAlign, to align the latent spaces across clients from both label and data perspectives. From a label perspective, we leverage the expressive natural language class names as a common ground for label encoders to an",
    "path": "papers/23/01/2301.00489.json",
    "total_tokens": 951,
    "translated_title": "针对非相同客户类别集合的对齐导航：一种基于标签名称锚定的联邦学习框架",
    "translated_abstract": "传统的联邦分类方法即使是为非IID客户设计的，也假设每个客户端都根据相同的通用类集对其本地数据进行注释。本文关注于更一般但实用的场景——非相同客户类集，其中客户端关注于自己（不同甚至不重叠）的类集，并寻求适用于这些类的联合的全局模型。如果将分类视为在数据/标签编码器产生的表示之间找到最佳匹配，则客户类别集合的异质性会带来新的重大挑战-不同客户端的本地编码器可能在不同甚至独立的潜在空间中运行，使得在服务器上进行聚合变得困难。我们提出了一种新颖的框架，FedAlign，从标签和数据的角度来对齐客户端的潜在空间。从标签的角度，我们利用表达自然语言的类名作为标签编码器的共同基础来实现对齐。",
    "tldr": "本文提出了一种名为FedAlign的联邦学习框架，用于在标签和数据的层面上对于非相同客户类别集合进行潜在空间的对齐，从而解决了传统方法中不同客户端本地编码器的异质性问题。"
}