{
    "title": "Diffusion Models as Artists: Are we Closing the Gap between Humans and Machines?. (arXiv:2301.11722v2 [cs.AI] UPDATED)",
    "abstract": "An important milestone for AI is the development of algorithms that can produce drawings that are indistinguishable from those of humans. Here, we adapt the 'diversity vs. recognizability' scoring framework from Boutin et al, 2022 and find that one-shot diffusion models have indeed started to close the gap between humans and machines. However, using a finer-grained measure of the originality of individual samples, we show that strengthening the guidance of diffusion models helps improve the humanness of their drawings, but they still fall short of approximating the originality and recognizability of human drawings. Comparing human category diagnostic features, collected through an online psychophysics experiment, against those derived from diffusion models reveals that humans rely on fewer and more localized features. Overall, our study suggests that diffusion models have significantly helped improve the quality of machine-generated drawings; however, a gap between humans and machines ",
    "link": "http://arxiv.org/abs/2301.11722",
    "context": "Title: Diffusion Models as Artists: Are we Closing the Gap between Humans and Machines?. (arXiv:2301.11722v2 [cs.AI] UPDATED)\nAbstract: An important milestone for AI is the development of algorithms that can produce drawings that are indistinguishable from those of humans. Here, we adapt the 'diversity vs. recognizability' scoring framework from Boutin et al, 2022 and find that one-shot diffusion models have indeed started to close the gap between humans and machines. However, using a finer-grained measure of the originality of individual samples, we show that strengthening the guidance of diffusion models helps improve the humanness of their drawings, but they still fall short of approximating the originality and recognizability of human drawings. Comparing human category diagnostic features, collected through an online psychophysics experiment, against those derived from diffusion models reveals that humans rely on fewer and more localized features. Overall, our study suggests that diffusion models have significantly helped improve the quality of machine-generated drawings; however, a gap between humans and machines ",
    "path": "papers/23/01/2301.11722.json",
    "total_tokens": 942,
    "translated_title": "扩散模型作为艺术家：我们正在拉近人与机器之间的鸿沟吗？",
    "translated_abstract": "人工智能的一个重要里程碑是开发能够生成和人类无异的绘画作品的算法。在本文中，我们采用 Boutin 等人 2022 年提出的“多样性 vs. 可识别性”评分框架，发现一发即中的扩散模型确实已经开始拉近人类和机器之间的鸿沟。然而，用更细粒度的样本独创性度量，我们发现强化扩散模型的指导有助于提高它们的绘画人性化程度，但它们仍然无法接近人类绘画作品的原创性和可识别性。通过在线心理物理实验收集人类类别诊断特征并将其与从扩散模型中导出的特征进行比较，我们发现人类依赖于更少且更局部的特征。总体而言，我们的研究表明扩散模型在显著提高机器生成绘画作品的质量方面发挥着重要作用，但人与机器之间的差距仍然存在。",
    "tldr": "本文研究表明，扩散模型已经在拉近人与机器之间的鸿沟方面取得了进展，但机器生成作品的原创性和可识别性仍然存在差距。"
}