{
    "title": "GNN-based Passenger Request Prediction. (arXiv:2301.02515v2 [cs.LG] UPDATED)",
    "abstract": "Passenger request prediction is essential for operations planning, control, and management in ride-sharing platforms. While the demand prediction problem has been studied extensively, the Origin-Destination (OD) flow prediction of passengers has received less attention from the research community. This paper develops a Graph Neural Network framework along with the Attention Mechanism to predict the OD flow of passengers. The proposed framework exploits various linear and non-linear dependencies that arise among requests originating from different locations and captures the repetition pattern and the contextual data of that place. Moreover, the optimal size of the grid cell that covers the road network and preserves the complexity and accuracy of the model is determined. Extensive simulations are conducted to examine the characteristics of our proposed approach and its various components. The results show the superior performance of our proposed model compared to the existing baselines.",
    "link": "http://arxiv.org/abs/2301.02515",
    "context": "Title: GNN-based Passenger Request Prediction. (arXiv:2301.02515v2 [cs.LG] UPDATED)\nAbstract: Passenger request prediction is essential for operations planning, control, and management in ride-sharing platforms. While the demand prediction problem has been studied extensively, the Origin-Destination (OD) flow prediction of passengers has received less attention from the research community. This paper develops a Graph Neural Network framework along with the Attention Mechanism to predict the OD flow of passengers. The proposed framework exploits various linear and non-linear dependencies that arise among requests originating from different locations and captures the repetition pattern and the contextual data of that place. Moreover, the optimal size of the grid cell that covers the road network and preserves the complexity and accuracy of the model is determined. Extensive simulations are conducted to examine the characteristics of our proposed approach and its various components. The results show the superior performance of our proposed model compared to the existing baselines.",
    "path": "papers/23/01/2301.02515.json",
    "total_tokens": 868,
    "translated_title": "基于GNN的乘客请求预测",
    "translated_abstract": "乘客请求预测对于乘车共享平台的运营规划、控制和管理至关重要。虽然需求预测问题已得到广泛研究，但乘客的起点-终点（OD）流预测却在研究界中受到较少关注。本文开发了一个基于图神经网络框架和注意力机制的模型来预测乘客的OD流。该模型利用不同位置起始的请求之间产生的各种线性和非线性依赖关系，并捕捉了该地点的重复模式和上下文数据。此外，确定了覆盖道路网络并保持模型复杂性和准确性的网格单元的最佳大小。通过广泛的仿真来检查我们提出的方法及其各个组件的特征。结果显示我们提出的模型相比现有基线具有更优越的性能。",
    "tldr": "本文开发了一个基于图神经网络和注意力机制的模型来预测乘客的起点-终点（OD）流。该模型利用各种线性和非线性依赖关系，并捕捉重复模式和上下文数据。通过广泛的仿真实验，结果显示我们的模型性能优于现有基线模型。",
    "en_tdlr": "This paper develops a model based on Graph Neural Network and Attention Mechanism to predict the Origin-Destination (OD) flow of passengers. The model exploits various linear and non-linear dependencies, capturing repetition pattern and contextual data. Extensive simulations show the superior performance of our model compared to existing baselines."
}