{
    "title": "Endogenous Labour Flow Networks. (arXiv:2301.07979v2 [econ.GN] UPDATED)",
    "abstract": "In the last decade, the study of labour dynamics has led to the introduction of labour flow networks (LFNs) as a way to conceptualise job-to-job transitions, and to the development of mathematical models to explore the dynamics of these networked flows. To date, LFN models have relied upon an assumption of static network structure. However, as recent events (increasing automation in the workplace, the COVID-19 pandemic, a surge in the demand for programming skills, etc.) have shown, we are experiencing drastic shifts to the job landscape that are altering the ways individuals navigate the labour market. Here we develop a novel model that emerges LFNs from agent-level behaviour, removing the necessity of assuming that future job-to-job flows will be along the same paths where they have been historically observed. This model, informed by microdata for the United Kingdom, generates empirical LFNs with a high level of accuracy. We use the model to explore how shocks impacting the underlyin",
    "link": "http://arxiv.org/abs/2301.07979",
    "context": "Title: Endogenous Labour Flow Networks. (arXiv:2301.07979v2 [econ.GN] UPDATED)\nAbstract: In the last decade, the study of labour dynamics has led to the introduction of labour flow networks (LFNs) as a way to conceptualise job-to-job transitions, and to the development of mathematical models to explore the dynamics of these networked flows. To date, LFN models have relied upon an assumption of static network structure. However, as recent events (increasing automation in the workplace, the COVID-19 pandemic, a surge in the demand for programming skills, etc.) have shown, we are experiencing drastic shifts to the job landscape that are altering the ways individuals navigate the labour market. Here we develop a novel model that emerges LFNs from agent-level behaviour, removing the necessity of assuming that future job-to-job flows will be along the same paths where they have been historically observed. This model, informed by microdata for the United Kingdom, generates empirical LFNs with a high level of accuracy. We use the model to explore how shocks impacting the underlyin",
    "path": "papers/23/01/2301.07979.json",
    "total_tokens": 876,
    "translated_title": "内生化劳动力流动网络",
    "translated_abstract": "在过去十年中，劳动动力学的研究引入了劳动力流动网络（LFN）来概括工作转移，并开发了数学模型来探索这些网络流的动态性。到目前为止，LFN模型一直依赖于静态网络结构的假设。然而，正如最近的事件（工作场所的自动化增加，COVID-19大流行，对编程技能的需求激增等）所显示的，我们正在经历改变劳动力市场中个人导航方式的重大变革。在这里，我们开发了一种新型模型，从代理层面出发形成LFNs，消除了假定未来工作转移流将沿着它们历史观察到的相同轨迹流动的必要性。该模型以英国的微观数据为基础，生成了具有高精度的实证LFNs。我们使用该模型探索了影响基础的冲击。",
    "tldr": "本文提出一种新型模型，从代理层面出发形成劳动力流动网络(LFNs)，消除了历史路径假设。该模型使用英国的微观数据为基础，生成了具有高精度的实证LFNs。",
    "en_tdlr": "This paper proposes a novel model that generates labor flow networks (LFNs) from agent-level behavior, eliminating the assumption of historical path dependence. Utilizing microdata for the United Kingdom, This model generates empirical LFNs with a high accuracy level."
}