{
    "title": "Higher-order Refinements of Small Bandwidth Asymptotics for Density-Weighted Average Derivative Estimators",
    "abstract": "arXiv:2301.00277v2 Announce Type: replace  Abstract: The density weighted average derivative (DWAD) of a regression function is a canonical parameter of interest in economics. Classical first-order large sample distribution theory for kernel-based DWAD estimators relies on tuning parameter restrictions and model assumptions that imply an asymptotic linear representation of the point estimator. These conditions can be restrictive, and the resulting distributional approximation may not be representative of the actual sampling distribution of the statistic of interest. In particular, the approximation is not robust to bandwidth choice. Small bandwidth asymptotics offers an alternative, more general distributional approximation for kernel-based DWAD estimators that allows for, but does not require, asymptotic linearity. The resulting inference procedures based on small bandwidth asymptotics were found to exhibit superior finite sample performance in simulations, but no formal theory justif",
    "link": "https://arxiv.org/abs/2301.00277",
    "context": "Title: Higher-order Refinements of Small Bandwidth Asymptotics for Density-Weighted Average Derivative Estimators\nAbstract: arXiv:2301.00277v2 Announce Type: replace  Abstract: The density weighted average derivative (DWAD) of a regression function is a canonical parameter of interest in economics. Classical first-order large sample distribution theory for kernel-based DWAD estimators relies on tuning parameter restrictions and model assumptions that imply an asymptotic linear representation of the point estimator. These conditions can be restrictive, and the resulting distributional approximation may not be representative of the actual sampling distribution of the statistic of interest. In particular, the approximation is not robust to bandwidth choice. Small bandwidth asymptotics offers an alternative, more general distributional approximation for kernel-based DWAD estimators that allows for, but does not require, asymptotic linearity. The resulting inference procedures based on small bandwidth asymptotics were found to exhibit superior finite sample performance in simulations, but no formal theory justif",
    "path": "papers/23/01/2301.00277.json",
    "total_tokens": 886,
    "translated_title": "密度加权平均导数估计器的高阶细化小带宽渐近性质",
    "translated_abstract": "经济学中，回归函数的密度加权平均导数（DWAD）是一个重要的典型参数。基于核函数的DWAD估计器的经典一阶大样本分布理论依赖于调参参数的限制和模型假设，这些条件意味着点估计的渐近线性表示。这些条件可能比较苛刻，由此得到的分布近似可能无法代表所关注统计量的实际抽样分布。特别地，该近似对带宽选择不具有鲁棒性。小带宽渐近性质为基于核函数的DWAD估计器提供了另一种更一般的分布近似，它允许但不要求渐近线性性质。基于小带宽渐近性质的推断步骤在模拟中表现出良好的有限样本性能，但目前尚缺乏正式的理论证明。",
    "tldr": "这篇论文研究了密度加权平均导数估计器的高阶细化小带宽渐近性质，提供了一种更一般的分布近似方法，该方法在带宽选择方面更鲁棒，并在模拟中表现出优秀的有限样本性能。",
    "en_tdlr": "This paper investigates higher-order refinements of small bandwidth asymptotics for density-weighted average derivative estimators, providing a more general distributional approximation method that is more robust in bandwidth selection and exhibits superior finite sample performance in simulations."
}