{
    "title": "Automatic Intersection Management in Mixed Traffic Using Reinforcement Learning and Graph Neural Networks. (arXiv:2301.12717v2 [cs.RO] UPDATED)",
    "abstract": "Connected automated driving has the potential to significantly improve urban traffic efficiency, e.g., by alleviating issues due to occlusion. Cooperative behavior planning can be employed to jointly optimize the motion of multiple vehicles. Most existing approaches to automatic intersection management, however, only consider fully automated traffic. In practice, mixed traffic, i.e., the simultaneous road usage by automated and human-driven vehicles, will be prevalent. The present work proposes to leverage reinforcement learning and a graph-based scene representation for cooperative multi-agent planning. We build upon our previous works that showed the applicability of such machine learning methods to fully automated traffic. The scene representation is extended for mixed traffic and considers uncertainty in the human drivers' intentions. In the simulation-based evaluation, we model measurement uncertainties through noise processes that are tuned using real-world data. The paper evalua",
    "link": "http://arxiv.org/abs/2301.12717",
    "context": "Title: Automatic Intersection Management in Mixed Traffic Using Reinforcement Learning and Graph Neural Networks. (arXiv:2301.12717v2 [cs.RO] UPDATED)\nAbstract: Connected automated driving has the potential to significantly improve urban traffic efficiency, e.g., by alleviating issues due to occlusion. Cooperative behavior planning can be employed to jointly optimize the motion of multiple vehicles. Most existing approaches to automatic intersection management, however, only consider fully automated traffic. In practice, mixed traffic, i.e., the simultaneous road usage by automated and human-driven vehicles, will be prevalent. The present work proposes to leverage reinforcement learning and a graph-based scene representation for cooperative multi-agent planning. We build upon our previous works that showed the applicability of such machine learning methods to fully automated traffic. The scene representation is extended for mixed traffic and considers uncertainty in the human drivers' intentions. In the simulation-based evaluation, we model measurement uncertainties through noise processes that are tuned using real-world data. The paper evalua",
    "path": "papers/23/01/2301.12717.json",
    "total_tokens": 855,
    "translated_title": "混合交通中使用强化学习和图神经网络进行自动化交叉口管理",
    "translated_abstract": "连接的自动驾驶有潜力显著提高城市交通效率，例如通过减轻遮挡引起的问题。合作行为规划可以用于联合优化多辆车辆的运动。然而，大多数现有的自动交叉口管理方法只考虑完全自动化的交通。在实践中，混合交通，即自动驾驶和人驾驶车辆的同时道路使用，将普遍存在。本文提出利用强化学习和基于图的场景表示进行协同多智能体规划。我们建立在我们之前的研究基础上，这些研究表明这种机器学习方法适用于完全自动化的交通。场景表示扩展到混合交通，并考虑人驾驶员意图的不确定性。在基于仿真的评估中，我们通过使用实际数据调整的噪声过程模拟测量不确定性。",
    "tldr": "本研究提出了一种利用强化学习和图神经网络进行混合交通中的自动化交叉口管理的方法，该方法考虑到了人驾驶员的不确定性，并通过仿真评估进行了验证。"
}