{
    "title": "Automated extraction of capacitive coupling for quantum dot systems. (arXiv:2301.08654v2 [cond-mat.mes-hall] UPDATED)",
    "abstract": "Gate-defined quantum dots (QDs) have appealing attributes as a quantum computing platform. However, near-term devices possess a range of possible imperfections that need to be accounted for during the tuning and operation of QD devices. One such problem is the capacitive cross-talk between the metallic gates that define and control QD qubits. A way to compensate for the capacitive cross-talk and enable targeted control of specific QDs independent of coupling is by the use of virtual gates. Here, we demonstrate a reliable automated capacitive coupling identification method that combines machine learning with traditional fitting to take advantage of the desirable properties of each. We also show how the cross-capacitance measurement may be used for the identification of spurious QDs sometimes formed during tuning experimental devices. Our systems can autonomously flag devices with spurious dots near the operating regime, which is crucial information for reliable tuning to a regime suitab",
    "link": "http://arxiv.org/abs/2301.08654",
    "context": "Title: Automated extraction of capacitive coupling for quantum dot systems. (arXiv:2301.08654v2 [cond-mat.mes-hall] UPDATED)\nAbstract: Gate-defined quantum dots (QDs) have appealing attributes as a quantum computing platform. However, near-term devices possess a range of possible imperfections that need to be accounted for during the tuning and operation of QD devices. One such problem is the capacitive cross-talk between the metallic gates that define and control QD qubits. A way to compensate for the capacitive cross-talk and enable targeted control of specific QDs independent of coupling is by the use of virtual gates. Here, we demonstrate a reliable automated capacitive coupling identification method that combines machine learning with traditional fitting to take advantage of the desirable properties of each. We also show how the cross-capacitance measurement may be used for the identification of spurious QDs sometimes formed during tuning experimental devices. Our systems can autonomously flag devices with spurious dots near the operating regime, which is crucial information for reliable tuning to a regime suitab",
    "path": "papers/23/01/2301.08654.json",
    "total_tokens": 885,
    "translated_title": "量子点系统电容耦合的自动提取",
    "translated_abstract": "由电极定义的量子点作为量子计算平台有着吸引人的特性。然而，这种近期设备存在一系列潜在缺陷，在QD器件的调控和操作中需要加以解决。其中一个问题是定义和控制QD量子比特的金属栅之间的电容串扰。为了补偿电容耦合并实现特定QD独立控制，可以使用虚拟门。在这里，我们展示了一种可靠的自动电容耦合识别方法，将机器学习与传统拟合相结合，充分利用各自的优点。我们还展示了交叉电容测量如何用于识别在调整实验设备时有时形成的虚假QD。我们的系统可以自主标记处于操作范围附近的带有虚假点的设备，这对于可靠调整至合适区域至关重要。",
    "tldr": "该论文使用机器学习和传统拟合相结合的方法，展示了一种自动电容耦合识别方法，能够识别带有虚假点的设备，并实现特定QD独立控制。",
    "en_tdlr": "This paper presents a reliable automated capacitive coupling identification method, which combines machine learning with traditional fitting, to compensate for the capacitive cross-talk and enable targeted control of specific QDs independent of coupling. It also shows how the cross-capacitance measurement may be used for the identification of spurious QDs and how to autonomously flag such devices."
}