{
    "title": "Censorship Resistance in On-Chain Auctions. (arXiv:2301.13321v2 [econ.TH] UPDATED)",
    "abstract": "Modern blockchains guarantee that submitted transactions will be included eventually; a property formally known as liveness. But financial activity requires transactions to be included in a timely manner. Unfortunately, classical liveness is not strong enough to guarantee this, particularly in the presence of a motivated adversary who benefits from censoring transactions. We define censorship resistance as the amount it would cost the adversary to censor a transaction for a fixed interval of time as a function of the associated tip. This definition has two advantages, first it captures the fact that transactions with a higher miner tip can be more costly to censor, and therefore are more likely to swiftly make their way onto the chain. Second, it applies to a finite time window, so it can be used to assess whether a blockchain is capable of hosting financial activity that relies on timely inclusion.  We apply this definition in the context of auctions. Auctions are a building block for",
    "link": "http://arxiv.org/abs/2301.13321",
    "context": "Title: Censorship Resistance in On-Chain Auctions. (arXiv:2301.13321v2 [econ.TH] UPDATED)\nAbstract: Modern blockchains guarantee that submitted transactions will be included eventually; a property formally known as liveness. But financial activity requires transactions to be included in a timely manner. Unfortunately, classical liveness is not strong enough to guarantee this, particularly in the presence of a motivated adversary who benefits from censoring transactions. We define censorship resistance as the amount it would cost the adversary to censor a transaction for a fixed interval of time as a function of the associated tip. This definition has two advantages, first it captures the fact that transactions with a higher miner tip can be more costly to censor, and therefore are more likely to swiftly make their way onto the chain. Second, it applies to a finite time window, so it can be used to assess whether a blockchain is capable of hosting financial activity that relies on timely inclusion.  We apply this definition in the context of auctions. Auctions are a building block for",
    "path": "papers/23/01/2301.13321.json",
    "total_tokens": 971,
    "translated_title": "On-Chain Auctions中的审查抗拒",
    "translated_abstract": "现代区块链保证提交的交易最终会被包含在内，这是一种形式上称为活性的性质。但是，金融活动需要及时地将交易包含在内。不幸的是，经典的活性并不足以保证这一点，特别是在存在有动机的对手从审查交易中受益的情况下。我们将审查抗拒定义为对手为审查与固定时间间隔相关的小费花费的数量函数。这个定义有两个优点：首先，它捕捉到随着矿工小费的增加，审查代价可能更高的事实，因此更有可能迅速进入链中。其次，它适用于有限的时间窗口，因此可以用来评估区块链是否能够承载依赖及时包含的金融活动。我们将这个定义应用在竞拍的上下文中。竞拍是许多去中心化应用程序的基本构建块，但需要快速的交易时间才能实现。我们的方法为确保On-Chain Auction中的审查抗拒提供了一种新的机制，从而实现更健壮和安全的去中心化市场。",
    "tldr": "本研究提出了在On-Chain Auction中确保审查抗拒的新机制，通过定义审查抗拒的概念并将其应用于竞拍上下文中，是去中心化市场更为健壮和安全的基础。",
    "en_tdlr": "The research proposes a new mechanism to ensure censorship resistance in On-Chain Auctions, which defines the concept of censorship resistance and applies it to auctions to create a more robust and secure decentralized marketplace."
}