{
    "title": "Logic Mill -- A Knowledge Navigation System. (arXiv:2301.00200v2 [cs.CL] UPDATED)",
    "abstract": "Logic Mill is a scalable and openly accessible software system that identifies semantically similar documents within either one domain-specific corpus or multi-domain corpora. It uses advanced Natural Language Processing (NLP) techniques to generate numerical representations of documents. Currently it leverages a large pre-trained language model to generate these document representations. The system focuses on scientific publications and patent documents and contains more than 200 million documents. It is easily accessible via a simple Application Programming Interface (API) or via a web interface. Moreover, it is continuously being updated and can be extended to text corpora from other domains. We see this system as a general-purpose tool for future research applications in the social sciences and other domains.",
    "link": "http://arxiv.org/abs/2301.00200",
    "context": "Title: Logic Mill -- A Knowledge Navigation System. (arXiv:2301.00200v2 [cs.CL] UPDATED)\nAbstract: Logic Mill is a scalable and openly accessible software system that identifies semantically similar documents within either one domain-specific corpus or multi-domain corpora. It uses advanced Natural Language Processing (NLP) techniques to generate numerical representations of documents. Currently it leverages a large pre-trained language model to generate these document representations. The system focuses on scientific publications and patent documents and contains more than 200 million documents. It is easily accessible via a simple Application Programming Interface (API) or via a web interface. Moreover, it is continuously being updated and can be extended to text corpora from other domains. We see this system as a general-purpose tool for future research applications in the social sciences and other domains.",
    "path": "papers/23/01/2301.00200.json",
    "total_tokens": 770,
    "translated_title": "Logic Mill -- 一个知识导航系统",
    "translated_abstract": "Logic Mill是一个可扩展且开放访问的软件系统，可在一个特定领域的语料库或多领域语料库中识别语义相似的文档。它使用先进的自然语言处理（NLP）技术生成文档的数值表示。目前，它利用一个大型预训练语言模型生成这些文档表示。该系统专注于科学出版物和专利文件，包含超过2亿份文档。它可以通过简单的应用程序编程接口（API）或Web界面轻松访问。此外，它会持续更新，并可以扩展到来自其他领域的文本语料库。我们认为这个系统是社会科学和其他领域未来研究应用的通用工具。",
    "tldr": "Logic Mill是一个可扩展和开放访问的知识导航系统，它通过自然语言处理技术识别语义相似的文档，并可用于科学出版物和专利文件。这个系统具有通用性，可用于社会科学和其他研究领域。"
}