{
    "title": "Convergence of uncertainty estimates in Ensemble and Bayesian sparse model discovery. (arXiv:2301.12649v2 [cs.LG] UPDATED)",
    "abstract": "Sparse model identification enables nonlinear dynamical system discovery from data. However, the control of false discoveries for sparse model identification is challenging, especially in the low-data and high-noise limit. In this paper, we perform a theoretical study on ensemble sparse model discovery, which shows empirical success in terms of accuracy and robustness to noise. In particular, we analyse the bootstrapping-based sequential thresholding least-squares estimator. We show that this bootstrapping-based ensembling technique can perform a provably correct variable selection procedure with an exponential convergence rate of the error rate. In addition, we show that the ensemble sparse model discovery method can perform computationally efficient uncertainty estimation, compared to expensive Bayesian uncertainty quantification methods via MCMC. We demonstrate the convergence properties and connection to uncertainty quantification in various numerical studies on synthetic sparse li",
    "link": "http://arxiv.org/abs/2301.12649",
    "context": "Title: Convergence of uncertainty estimates in Ensemble and Bayesian sparse model discovery. (arXiv:2301.12649v2 [cs.LG] UPDATED)\nAbstract: Sparse model identification enables nonlinear dynamical system discovery from data. However, the control of false discoveries for sparse model identification is challenging, especially in the low-data and high-noise limit. In this paper, we perform a theoretical study on ensemble sparse model discovery, which shows empirical success in terms of accuracy and robustness to noise. In particular, we analyse the bootstrapping-based sequential thresholding least-squares estimator. We show that this bootstrapping-based ensembling technique can perform a provably correct variable selection procedure with an exponential convergence rate of the error rate. In addition, we show that the ensemble sparse model discovery method can perform computationally efficient uncertainty estimation, compared to expensive Bayesian uncertainty quantification methods via MCMC. We demonstrate the convergence properties and connection to uncertainty quantification in various numerical studies on synthetic sparse li",
    "path": "papers/23/01/2301.12649.json",
    "total_tokens": 910,
    "translated_title": "Ensemble和Bayesian稀疏模型发现的不确定性估计的收敛性研究",
    "translated_abstract": "稀疏模型识别能够从数据中发现非线性动力学系统。然而，在低数据和高噪声的限制下，控制稀疏模型识别中的错误发现具有挑战性。本文通过理论研究集合稀疏模型发现方法，展示了在准确性和鲁棒性方面的实证成功。具体而言，我们分析了基于自助法的顺序阈值最小二乘估计器。我们展示了这种基于自助法的集成技术可以执行可证明正确的变量选择过程，并具有指数收敛速率的误差率。此外，我们展示了集合稀疏模型发现方法可以比使用昂贵的基于MCMC贝叶斯不确定性量化方法更高效地执行不确定性估计。我们在各种合成稀疏线性回归问题的数值实验中展示了收敛性和与不确定性量化的关系。",
    "tldr": "本文探讨了集合稀疏模型发现方法中的自助法序列阈值最小二乘估计器，证明了其具有指数收敛速率的误差率和可证明正确的变量选择过程，在不确定性估计方面具有高效性。",
    "en_tdlr": "This paper studies the convergence of uncertainty estimates in ensemble and Bayesian sparse model discovery, focusing on bootstrapping-based sequential thresholding least-squares estimator. It shows that this ensemble technique can perform a provably correct variable selection procedure with an exponential convergence rate of the error rate and can efficiently estimate uncertainty compared to expensive Bayesian uncertainty quantification methods via MCMC."
}