{
    "title": "Learning Informative Representation for Fairness-aware Multivariate Time-series Forecasting: A Group-based Perspective. (arXiv:2301.11535v2 [cs.LG] UPDATED)",
    "abstract": "Performance unfairness among variables widely exists in multivariate time series (MTS) forecasting models since such models may attend/bias to certain (advantaged) variables. Addressing this unfairness problem is important for equally attending to all variables and avoiding vulnerable model biases/risks. However, fair MTS forecasting is challenging and has been less studied in the literature. To bridge such significant gap, we formulate the fairness modeling problem as learning informative representations attending to both advantaged and disadvantaged variables. Accordingly, we propose a novel framework, named FairFor, for fairness-aware MTS forecasting. FairFor is based on adversarial learning to generate both group-independent and group-relevant representations for the downstream forecasting. The framework first leverages a spectral relaxation of the K-means objective to infer variable correlations and thus to group variables. Then, it utilizes a filtering&fusion component to filter ",
    "link": "http://arxiv.org/abs/2301.11535",
    "context": "Title: Learning Informative Representation for Fairness-aware Multivariate Time-series Forecasting: A Group-based Perspective. (arXiv:2301.11535v2 [cs.LG] UPDATED)\nAbstract: Performance unfairness among variables widely exists in multivariate time series (MTS) forecasting models since such models may attend/bias to certain (advantaged) variables. Addressing this unfairness problem is important for equally attending to all variables and avoiding vulnerable model biases/risks. However, fair MTS forecasting is challenging and has been less studied in the literature. To bridge such significant gap, we formulate the fairness modeling problem as learning informative representations attending to both advantaged and disadvantaged variables. Accordingly, we propose a novel framework, named FairFor, for fairness-aware MTS forecasting. FairFor is based on adversarial learning to generate both group-independent and group-relevant representations for the downstream forecasting. The framework first leverages a spectral relaxation of the K-means objective to infer variable correlations and thus to group variables. Then, it utilizes a filtering&fusion component to filter ",
    "path": "papers/23/01/2301.11535.json",
    "total_tokens": 951,
    "translated_title": "学习信息化表示以实现面向公平性的多元时间序列预测：基于群组视角",
    "translated_abstract": "在多元时间序列（MTS）预测模型中，变量之间的不公平现象普遍存在，因为这些模型可能会关注/偏向某些（有利的）变量。解决这种不公平问题对于平等关注所有变量并避免模型的偏见和风险是很重要的。然而，公平的MTS预测具有挑战性，在文献中研究较少。为了解决这个重要问题，我们将公平建模问题转化为学习信息化表示，既关注有利的变量也关注不利的变量。因此，我们提出了一个新的框架，名为FairFor，用于面向公平性的MTS预测。FairFor基于对抗学习，生成独立于群组和与群组相关的表示，用于后续的预测。该框架首先利用K-means目标的谱松弛来推断变量之间的相关性，从而进行变量分组。然后，它利用过滤和融合组件来过滤变量并融合",
    "tldr": "本研究提出了一个名为FairFor的框架，用于公平的多元时间序列预测。该框架利用对抗学习生成了独立于群组和与群组相关的表示，并利用谱松弛和过滤融合组件来推断变量之间的相关性和进行变量分组。",
    "en_tdlr": "This paper proposes a framework called FairFor for fairness-aware multivariate time-series forecasting. FairFor utilizes adversarial learning to generate group-independent and group-relevant representations, and employs spectral relaxation and filtering&fusion components to infer variable correlations and group variables."
}