{
    "title": "Diffusion-based Conditional ECG Generation with Structured State Space Models. (arXiv:2301.08227v2 [eess.SP] UPDATED)",
    "abstract": "Synthetic data generation is a promising solution to address privacy issues with the distribution of sensitive health data. Recently, diffusion models have set new standards for generative models for different data modalities. Also very recently, structured state space models emerged as a powerful modeling paradigm to capture long-term dependencies in time series. We put forward SSSD-ECG, as the combination of these two technologies, for the generation of synthetic 12-lead electrocardiograms conditioned on more than 70 ECG statements. Due to a lack of reliable baselines, we also propose conditional variants of two state-of-the-art unconditional generative models. We thoroughly evaluate the quality of the generated samples, by evaluating pretrained classifiers on the generated data and by evaluating the performance of a classifier trained only on synthetic data, where SSSD-ECG clearly outperforms its GAN-based competitors. We demonstrate the soundness of our approach through further exp",
    "link": "http://arxiv.org/abs/2301.08227",
    "context": "Title: Diffusion-based Conditional ECG Generation with Structured State Space Models. (arXiv:2301.08227v2 [eess.SP] UPDATED)\nAbstract: Synthetic data generation is a promising solution to address privacy issues with the distribution of sensitive health data. Recently, diffusion models have set new standards for generative models for different data modalities. Also very recently, structured state space models emerged as a powerful modeling paradigm to capture long-term dependencies in time series. We put forward SSSD-ECG, as the combination of these two technologies, for the generation of synthetic 12-lead electrocardiograms conditioned on more than 70 ECG statements. Due to a lack of reliable baselines, we also propose conditional variants of two state-of-the-art unconditional generative models. We thoroughly evaluate the quality of the generated samples, by evaluating pretrained classifiers on the generated data and by evaluating the performance of a classifier trained only on synthetic data, where SSSD-ECG clearly outperforms its GAN-based competitors. We demonstrate the soundness of our approach through further exp",
    "path": "papers/23/01/2301.08227.json",
    "total_tokens": 891,
    "translated_title": "基于扩散的结构化状态空间模型的条件心电信号生成",
    "translated_abstract": "合成数据生成是解决敏感健康数据分布时的隐私问题的一种有前途的解决方案。最近，扩散模型为不同的数据模式设定了新的生成模型标准。最近，结构化状态空间模型出现，成为捕捉时间序列中长期依赖关系的强大建模范例。我们提出了SSSD-ECG，将这两种技术相结合，用于根据70多个心电图语句生成合成12导联心电图的条件生成。由于没有可靠的基准，我们还提出了两种最先进的无条件生成模型的条件变体。我们通过评估在生成数据上预训练的分类器的性能来彻底评估所生成样本的质量，并评估了仅在合成数据上训练的分类器的性能，在这方面，SSSD-ECG明显优于其基于GAN的竞争对手。我们通过进一步的实验证明了我们方法的合理性。",
    "tldr": "本研究提出了将扩散模型和结构化状态空间模型相结合的新技术SSSD-ECG，在根据70多个心电图语句生成合成12导联心电图方面表现出色。"
}