{
    "title": "Slice Transformer and Self-supervised Learning for 6DoF Localization in 3D Point Cloud Maps. (arXiv:2301.08957v2 [cs.CV] UPDATED)",
    "abstract": "Precise localization is critical for autonomous vehicles. We present a self-supervised learning method that employs Transformers for the first time for the task of outdoor localization using LiDAR data. We propose a pre-text task that reorganizes the slices of a $360^\\circ$ LiDAR scan to leverage its axial properties. Our model, called Slice Transformer, employs multi-head attention while systematically processing the slices. To the best of our knowledge, this is the first instance of leveraging multi-head attention for outdoor point clouds. We additionally introduce the Perth-WA dataset, which provides a large-scale LiDAR map of Perth city in Western Australia, covering $\\sim$4km$^2$ area. Localization annotations are provided for Perth-WA. The proposed localization method is thoroughly evaluated on Perth-WA and Appollo-SouthBay datasets. We also establish the efficacy of our self-supervised learning approach for the common downstream task of object classification using ModelNet40 and",
    "link": "http://arxiv.org/abs/2301.08957",
    "context": "Title: Slice Transformer and Self-supervised Learning for 6DoF Localization in 3D Point Cloud Maps. (arXiv:2301.08957v2 [cs.CV] UPDATED)\nAbstract: Precise localization is critical for autonomous vehicles. We present a self-supervised learning method that employs Transformers for the first time for the task of outdoor localization using LiDAR data. We propose a pre-text task that reorganizes the slices of a $360^\\circ$ LiDAR scan to leverage its axial properties. Our model, called Slice Transformer, employs multi-head attention while systematically processing the slices. To the best of our knowledge, this is the first instance of leveraging multi-head attention for outdoor point clouds. We additionally introduce the Perth-WA dataset, which provides a large-scale LiDAR map of Perth city in Western Australia, covering $\\sim$4km$^2$ area. Localization annotations are provided for Perth-WA. The proposed localization method is thoroughly evaluated on Perth-WA and Appollo-SouthBay datasets. We also establish the efficacy of our self-supervised learning approach for the common downstream task of object classification using ModelNet40 and",
    "path": "papers/23/01/2301.08957.json",
    "total_tokens": 963,
    "translated_title": "切片Transformer和自监督学习用于3D点云地图中的六自由度定位",
    "translated_abstract": "精确定位对于自动驾驶汽车至关重要。我们提出了一种自监督学习方法，首次采用了Transformer进行使用激光雷达数据进行室外定位的任务。我们提出了一个预训练任务，重新组织了$360^\\circ$激光雷达扫描的切片，利用其轴向特性。我们的模型称为切片Transformer，在处理切片时使用多头注意力。据我们所知，这是首次利用多头注意力进行室外点云处理。我们还引入了Perth-WA数据集，该数据集提供了西澳大利亚珀斯市的大规模激光雷达地图，涵盖了约4平方公里的区域。Perth-WA提供了定位标注。我们在Perth-WA和Appollo-SouthBay数据集上对所提出的定位方法进行了全面评估。我们还证明了我们的自监督学习方法在常见的下游任务，如ModelNet40和...方面的有效性。",
    "tldr": "这篇论文介绍了一种新的自监督学习方法，首次使用Transformer进行室外定位的任务。作者提出了切片Transformer模型，并利用轴向特性重新组织了激光雷达扫描的切片。此外，作者还引入了Perth-WA数据集，并在多个数据集上进行了实验评估，证明了方法的有效性。"
}