{
    "title": "Continual Learning for Predictive Maintenance: Overview and Challenges. (arXiv:2301.12467v2 [cs.LG] UPDATED)",
    "abstract": "Deep learning techniques have become one of the main propellers for solving engineering problems effectively and efficiently. For instance, Predictive Maintenance methods have been used to improve predictions of when maintenance is needed on different machines and operative contexts. However, deep learning methods are not without limitations, as these models are normally trained on a fixed distribution that only reflects the current state of the problem. Due to internal or external factors, the state of the problem can change, and the performance decreases due to the lack of generalization and adaptation. Contrary to this stationary training set, real-world applications change their environments constantly, creating the need to constantly adapt the model to evolving scenarios. To aid in this endeavor, Continual Learning methods propose ways to constantly adapt prediction models and incorporate new knowledge after deployment. Despite the advantages of these techniques, there are still c",
    "link": "http://arxiv.org/abs/2301.12467",
    "context": "Title: Continual Learning for Predictive Maintenance: Overview and Challenges. (arXiv:2301.12467v2 [cs.LG] UPDATED)\nAbstract: Deep learning techniques have become one of the main propellers for solving engineering problems effectively and efficiently. For instance, Predictive Maintenance methods have been used to improve predictions of when maintenance is needed on different machines and operative contexts. However, deep learning methods are not without limitations, as these models are normally trained on a fixed distribution that only reflects the current state of the problem. Due to internal or external factors, the state of the problem can change, and the performance decreases due to the lack of generalization and adaptation. Contrary to this stationary training set, real-world applications change their environments constantly, creating the need to constantly adapt the model to evolving scenarios. To aid in this endeavor, Continual Learning methods propose ways to constantly adapt prediction models and incorporate new knowledge after deployment. Despite the advantages of these techniques, there are still c",
    "path": "papers/23/01/2301.12467.json",
    "total_tokens": 945,
    "translated_title": "持续学习在预测性维护中的应用: 概述和挑战",
    "translated_abstract": "深度学习技术已成为有效解决工程问题的主要推动力之一。例如，预测性维护方法已被用于改进对不同机器和操作环境中维护需求的预测。然而，深度学习方法存在一些限制，因为这些模型通常是在反映当前问题状态的固定分布上进行训练的。由于内部或外部因素，问题状态可能会发生改变，并且由于缺乏泛化和适应性，性能会下降。与这种固定训练集相反，现实世界的应用程序不断变化其环境，这就需要在部署后不断调整模型以适应不断演变的场景。为了帮助解决这个问题，持续学习方法提出了在部署后不断调整预测模型并融入新知识的方式。尽管这些技术具有优势，但仍然存在一些挑战。",
    "tldr": "深度学习技术在解决工程问题中起到重要作用，预测性维护方法可以提升对维护需求的准确预测。然而，由于问题状态的变化，传统的固定训练模型存在适应性差的问题。持续学习方法提出了在部署后不断调整模型以适应演变场景的方案，但仍面临一些挑战。"
}