{
    "title": "Unsupervised Manifold Linearizing and Clustering. (arXiv:2301.01805v2 [cs.LG] UPDATED)",
    "abstract": "We consider the problem of simultaneously clustering and learning a linear representation of data lying close to a union of low-dimensional manifolds, a fundamental task in machine learning and computer vision. When the manifolds are assumed to be linear subspaces, this reduces to the classical problem of subspace clustering, which has been studied extensively over the past two decades. Unfortunately, many real-world datasets such as natural images can not be well approximated by linear subspaces. On the other hand, numerous works have attempted to learn an appropriate transformation of the data, such that data is mapped from a union of general non-linear manifolds to a union of linear subspaces (with points from the same manifold being mapped to the same subspace). However, many existing works have limitations such as assuming knowledge of the membership of samples to clusters, requiring high sampling density, or being shown theoretically to learn trivial representations. In this pape",
    "link": "http://arxiv.org/abs/2301.01805",
    "context": "Title: Unsupervised Manifold Linearizing and Clustering. (arXiv:2301.01805v2 [cs.LG] UPDATED)\nAbstract: We consider the problem of simultaneously clustering and learning a linear representation of data lying close to a union of low-dimensional manifolds, a fundamental task in machine learning and computer vision. When the manifolds are assumed to be linear subspaces, this reduces to the classical problem of subspace clustering, which has been studied extensively over the past two decades. Unfortunately, many real-world datasets such as natural images can not be well approximated by linear subspaces. On the other hand, numerous works have attempted to learn an appropriate transformation of the data, such that data is mapped from a union of general non-linear manifolds to a union of linear subspaces (with points from the same manifold being mapped to the same subspace). However, many existing works have limitations such as assuming knowledge of the membership of samples to clusters, requiring high sampling density, or being shown theoretically to learn trivial representations. In this pape",
    "path": "papers/23/01/2301.01805.json",
    "total_tokens": 872,
    "translated_title": "无监督的流形线性化和聚类",
    "translated_abstract": "我们考虑同时对接近低维流形并具有线性表示的数据进行聚类和学习的问题，这是机器学习和计算机视觉中的一个基本任务。当假设流形是线性子空间时，这归结为经典的子空间聚类问题，在过去的二十年中得到了广泛研究。然而，许多现实世界的数据集（如自然图像）不能很好地用线性子空间近似。另一方面，许多研究尝试学习数据的适当变换，使得数据从一组非线性流形映射到一组线性子空间（将同一流形上的点映射到同一子空间）。然而，许多现有方法存在诸如假设已知样本对聚类的成员资格、要求高采样密度或在理论上被证明学习的是平凡表示的局限性。",
    "tldr": "本文提出了一种无监督的方法，可以同时对接近低维流形并具有线性表示的数据进行聚类和学习。方法可以处理非线性流形，而不需要对样本的聚类成员资格做出假设或对采样密度要求过高。",
    "en_tdlr": "This paper proposes an unsupervised method for simultaneously clustering and learning a linear representation of data lying close to a union of low-dimensional manifolds. The method can handle non-linear manifolds without assuming the membership of samples to clusters or requiring high sampling density."
}