{
    "title": "Causal Triplet: An Open Challenge for Intervention-centric Causal Representation Learning. (arXiv:2301.05169v2 [cs.LG] UPDATED)",
    "abstract": "Recent years have seen a surge of interest in learning high-level causal representations from low-level image pairs under interventions. Yet, existing efforts are largely limited to simple synthetic settings that are far away from real-world problems. In this paper, we present Causal Triplet, a causal representation learning benchmark featuring not only visually more complex scenes, but also two crucial desiderata commonly overlooked in previous works: (i) an actionable counterfactual setting, where only certain object-level variables allow for counterfactual observations whereas others do not; (ii) an interventional downstream task with an emphasis on out-of-distribution robustness from the independent causal mechanisms principle. Through extensive experiments, we find that models built with the knowledge of disentangled or object-centric representations significantly outperform their distributed counterparts. However, recent causal representation learning methods still struggle to id",
    "link": "http://arxiv.org/abs/2301.05169",
    "context": "Title: Causal Triplet: An Open Challenge for Intervention-centric Causal Representation Learning. (arXiv:2301.05169v2 [cs.LG] UPDATED)\nAbstract: Recent years have seen a surge of interest in learning high-level causal representations from low-level image pairs under interventions. Yet, existing efforts are largely limited to simple synthetic settings that are far away from real-world problems. In this paper, we present Causal Triplet, a causal representation learning benchmark featuring not only visually more complex scenes, but also two crucial desiderata commonly overlooked in previous works: (i) an actionable counterfactual setting, where only certain object-level variables allow for counterfactual observations whereas others do not; (ii) an interventional downstream task with an emphasis on out-of-distribution robustness from the independent causal mechanisms principle. Through extensive experiments, we find that models built with the knowledge of disentangled or object-centric representations significantly outperform their distributed counterparts. However, recent causal representation learning methods still struggle to id",
    "path": "papers/23/01/2301.05169.json",
    "total_tokens": 976,
    "translated_title": "因果三元组：面向干预中心因果表示学习的开放挑战",
    "translated_abstract": "近年来，学者们对从干预下的低级图像对中学习高级因果表示产生了浓厚的兴趣。然而，现有的研究往往局限于简单的合成数据，这远离了真实世界中的问题。在本文中，我们提出了因果三元组，这是一个因果表示学习基准，不仅具有更为复杂的视觉场景，而且还具有两个常常被忽视的关键愿望：(i) 一个可操作的反事实设置，其中只有某些物体级变量允许反事实观察，而其他变量则不允许；(ii) 一个干预性的下游任务，强调独立因果机制原则下的分布鲁棒性。通过大量的实验，我们发现，具有分离的或物体中心表示的知识的模型显着优于其分布式对应物。然而，最近的因果表示学习方法仍然难以识别可操作的反事实设置中的因果关系，且在干预性下游任务上表现欠佳。",
    "tldr": "本文提出了一个因果表示学习基准——因果三元组，该基准具有可操作的反事实设置和干预性下游任务，对分离和物体中心表示学习取得了显著优化，然而在因果关系的识别和干预性下游任务上表现欠佳。",
    "en_tdlr": "This paper proposes a causal representation learning benchmark - Causal Triplet, which has an actionable counterfactual setting and an interventional downstream task, achieving significant improvement in disentangled and object-centric representation learning, but still struggles with identifying causal relationships and performing well on interventional downstream tasks."
}