{
    "title": "Fairness Guaranteed and Auction-based x-haul and Cloud Resource Allocation in Multi-tenant O-RANs. (arXiv:2301.00597v3 [cs.NI] UPDATED)",
    "abstract": "The open-radio access network (O-RAN) embraces cloudification and network function virtualization for base-band function processing by dis-aggregated radio units (RUs), distributed units (DUs), and centralized units (CUs). These enable the cloud-RAN vision in full, where multiple mobile network operators (MNOs) can install their proprietary or open RUs, but lease on-demand computational resources for DU-CU functions from commonly available open-clouds via open x-haul interfaces. In this paper, we propose and compare the performances of min-max fairness and Vickrey-Clarke-Groves (VCG) auction-based x-haul and DU-CU resource allocation mechanisms to create a multi-tenant O-RAN ecosystem that is sustainable for small, medium, and large MNOs. The min-max fair approach minimizes the maximum OPEX of RUs through cost-sharing proportional to their demands, whereas the VCG auction-based approach minimizes the total OPEX for all resources utilized while extracting truthful demands from RUs. We c",
    "link": "http://arxiv.org/abs/2301.00597",
    "context": "Title: Fairness Guaranteed and Auction-based x-haul and Cloud Resource Allocation in Multi-tenant O-RANs. (arXiv:2301.00597v3 [cs.NI] UPDATED)\nAbstract: The open-radio access network (O-RAN) embraces cloudification and network function virtualization for base-band function processing by dis-aggregated radio units (RUs), distributed units (DUs), and centralized units (CUs). These enable the cloud-RAN vision in full, where multiple mobile network operators (MNOs) can install their proprietary or open RUs, but lease on-demand computational resources for DU-CU functions from commonly available open-clouds via open x-haul interfaces. In this paper, we propose and compare the performances of min-max fairness and Vickrey-Clarke-Groves (VCG) auction-based x-haul and DU-CU resource allocation mechanisms to create a multi-tenant O-RAN ecosystem that is sustainable for small, medium, and large MNOs. The min-max fair approach minimizes the maximum OPEX of RUs through cost-sharing proportional to their demands, whereas the VCG auction-based approach minimizes the total OPEX for all resources utilized while extracting truthful demands from RUs. We c",
    "path": "papers/23/01/2301.00597.json",
    "total_tokens": 991,
    "translated_title": "保证公平的基于竞拍的x-haul和云资源分配方案在多租户O-RAN中的应用",
    "translated_abstract": "开放式无线接入网络（O-RAN）采用云化和网络功能虚拟化，通过分离的无线电单元（RUs）、分布式单元（DUs）和集中式单元（CUs）进行基带功能处理。这使得云RAN愿景成为现实，多个移动网络运营商（MNOs）可以安装专有或开放式的RUs，但是通过开放的x-haul接口从公共可用的开放云中租用按需的DU-CU计算资源。本文提出并比较了最小最大公平和Vickrey-Clarke-Groves（VCG）基于竞拍的x-haul和DU-CU资源分配机制的性能，以创建一个适用于小、中、大MNOs可持续发展的多租户O-RAN生态系统。最小最大公平方法通过按其需求比例进行成本分摊，最小化RUs的最大OPEX，而基于VCG拍卖的方法则可最小化利用的所有资源的总OPEX，并从RUs中提取真实需求。我们注释了评估结果的公平指数，以确保在不同的MNO租户类型之间实现公平。",
    "tldr": "本文提出基于竞拍的资源分配机制，在多租户O-RAN生态系统中最小化不同MNO租户类型的OPEX，同时保证公平。",
    "en_tdlr": "This paper proposes auction-based resource allocation mechanisms to minimize OPEX for different tenant types of MNOs in a multi-tenant O-RAN ecosystem, while ensuring fairness. The min-max fair approach shares costs proportional to demands, while the VCG auction-based approach extracts truthful demands from RUs."
}