{
    "title": "Adversarial Training of Self-supervised Monocular Depth Estimation against Physical-World Attacks. (arXiv:2301.13487v3 [cs.CV] UPDATED)",
    "abstract": "Monocular Depth Estimation (MDE) is a critical component in applications such as autonomous driving. There are various attacks against MDE networks. These attacks, especially the physical ones, pose a great threat to the security of such systems. Traditional adversarial training method requires ground-truth labels hence cannot be directly applied to self-supervised MDE that does not have ground-truth depth. Some self-supervised model hardening techniques (e.g., contrastive learning) ignore the domain knowledge of MDE and can hardly achieve optimal performance. In this work, we propose a novel adversarial training method for self-supervised MDE models based on view synthesis without using ground-truth depth. We improve adversarial robustness against physical-world attacks using L0-norm-bounded perturbation in training. We compare our method with supervised learning based and contrastive learning based methods that are tailored for MDE. Results on two representative MDE networks show tha",
    "link": "http://arxiv.org/abs/2301.13487",
    "context": "Title: Adversarial Training of Self-supervised Monocular Depth Estimation against Physical-World Attacks. (arXiv:2301.13487v3 [cs.CV] UPDATED)\nAbstract: Monocular Depth Estimation (MDE) is a critical component in applications such as autonomous driving. There are various attacks against MDE networks. These attacks, especially the physical ones, pose a great threat to the security of such systems. Traditional adversarial training method requires ground-truth labels hence cannot be directly applied to self-supervised MDE that does not have ground-truth depth. Some self-supervised model hardening techniques (e.g., contrastive learning) ignore the domain knowledge of MDE and can hardly achieve optimal performance. In this work, we propose a novel adversarial training method for self-supervised MDE models based on view synthesis without using ground-truth depth. We improve adversarial robustness against physical-world attacks using L0-norm-bounded perturbation in training. We compare our method with supervised learning based and contrastive learning based methods that are tailored for MDE. Results on two representative MDE networks show tha",
    "path": "papers/23/01/2301.13487.json",
    "total_tokens": 938,
    "translated_title": "自监督单目深度估计对抗性训练防御物理攻击",
    "translated_abstract": "单目深度估计（MDE）是自动驾驶等应用中的关键组件。MDE网络面临各种攻击，尤其是物理攻击，威胁这种系统的安全。传统的对抗性训练方法需要有标签数据，因此不能直接应用于没有真实深度的自监督MDE。一些自监督模型强化技术（例如对比学习）忽略了MDE的领域知识，很难达到最佳性能。本文提出了一种基于视角合成的自监督MDE模型的新颖的对抗性训练方法，无需使用真实深度。我们使用L0范数限制扰动来提高对物理攻击的对抗鲁棒性。我们将我们的方法与针对MDE量身定制的有监督学习和对比学习方法进行了比较。结果表明我们的方法在两个代表性MDE网络上表现出了优异的性能。",
    "tldr": "本论文提出了一种基于视角合成的自监督单目深度估计对抗性训练方法，无需使用真实深度，使用L0范数限制扰动来提高对物理攻击的对抗鲁棒性，优于传统方法和对比学习方法。",
    "en_tdlr": "This paper proposes a novel adversarial training method for self-supervised monocular depth estimation based on view synthesis without using ground-truth depth. The method improves adversarial robustness against physical-world attacks using L0-norm-bounded perturbation in training and outperforms traditional methods and contrastive learning methods."
}