{
    "title": "Deep Recurrent Learning Through Long Short Term Memory and TOPSIS",
    "abstract": "arXiv:2301.00693v2 Announce Type: replace-cross  Abstract: Enterprise resource planning (ERP) software brings resources, data together to keep software-flow within business processes in a company. However, cloud computing's cheap, easy and quick management promise pushes business-owners for a transition from monolithic to a data-center/cloud based ERP. Since cloud-ERP development involves a cyclic process, namely planning, implementing, testing and upgrading, its adoption is realized as a deep recurrent neural network problem. Eventually, a classification algorithm based on long short term memory (LSTM) and TOPSIS is proposed to identify and rank, respectively, adoption features. Our theoretical model is validated over a reference model by articulating key players, services, architecture, functionalities. Qualitative survey is conducted among users by considering technology, innovation and resistance issues, to formulate hypotheses on key adoption factors.",
    "link": "https://arxiv.org/abs/2301.00693",
    "context": "Title: Deep Recurrent Learning Through Long Short Term Memory and TOPSIS\nAbstract: arXiv:2301.00693v2 Announce Type: replace-cross  Abstract: Enterprise resource planning (ERP) software brings resources, data together to keep software-flow within business processes in a company. However, cloud computing's cheap, easy and quick management promise pushes business-owners for a transition from monolithic to a data-center/cloud based ERP. Since cloud-ERP development involves a cyclic process, namely planning, implementing, testing and upgrading, its adoption is realized as a deep recurrent neural network problem. Eventually, a classification algorithm based on long short term memory (LSTM) and TOPSIS is proposed to identify and rank, respectively, adoption features. Our theoretical model is validated over a reference model by articulating key players, services, architecture, functionalities. Qualitative survey is conducted among users by considering technology, innovation and resistance issues, to formulate hypotheses on key adoption factors.",
    "path": "papers/23/01/2301.00693.json",
    "total_tokens": 804,
    "translated_title": "通过长短期记忆和TOPSIS进行深度循环学习",
    "translated_abstract": "企业资源规划（ERP）软件将资源、数据汇聚在一起，以保持企业流程中的软件流畅。然而，云计算的廉价、简便和快速管理承诺促使企业所有者将单一体架构转变为基于数据中心/云的ERP。由于云ERP的开发涉及一个循环过程，即规划、实施、测试和升级，其采用被认为是一个深度递归神经网络问题。最终，提出了一个基于长短期记忆（LSTM）和TOPSIS的分类算法，用于识别和分别排名采用特征。我们的理论模型通过阐述关键参与者、服务、架构、功能，在参考模型上得到了验证。通过考虑技术、创新和抵抗问题，开展了一项定性调查，以就关键采用因素提出假设。",
    "tldr": "该论文提出了一种基于长短期记忆（LSTM）和TOPSIS的分类算法，用于识别和排名云ERP的采用特征。",
    "en_tdlr": "The paper introduces a classification algorithm based on Long Short Term Memory (LSTM) and TOPSIS to identify and rank adoption features in cloud ERP systems."
}