{
    "title": "Sparse neural networks with skip-connections for identification of aluminum electrolysis cell. (arXiv:2301.00582v2 [eess.SY] UPDATED)",
    "abstract": "Neural networks are rapidly gaining interest in nonlinear system identification due to the model's ability to capture complex input-output relations directly from data. However, despite the flexibility of the approach, there are still concerns about the safety of these models in this context, as well as the need for large amounts of potentially expensive data. Aluminum electrolysis is a highly nonlinear production process, and most of the data must be sampled manually, making the sampling process expensive and infrequent. In the case of infrequent measurements of state variables, the accuracy and open-loop stability of the long-term predictions become highly important. Standard neural networks struggle to provide stable long-term predictions with limited training data. In this work, we investigate the effect of combining concatenated skip-connections and the sparsity-promoting $\\ell_1$ regularization on the open-loop stability and accuracy of forecasts with short, medium, and long pred",
    "link": "http://arxiv.org/abs/2301.00582",
    "context": "Title: Sparse neural networks with skip-connections for identification of aluminum electrolysis cell. (arXiv:2301.00582v2 [eess.SY] UPDATED)\nAbstract: Neural networks are rapidly gaining interest in nonlinear system identification due to the model's ability to capture complex input-output relations directly from data. However, despite the flexibility of the approach, there are still concerns about the safety of these models in this context, as well as the need for large amounts of potentially expensive data. Aluminum electrolysis is a highly nonlinear production process, and most of the data must be sampled manually, making the sampling process expensive and infrequent. In the case of infrequent measurements of state variables, the accuracy and open-loop stability of the long-term predictions become highly important. Standard neural networks struggle to provide stable long-term predictions with limited training data. In this work, we investigate the effect of combining concatenated skip-connections and the sparsity-promoting $\\ell_1$ regularization on the open-loop stability and accuracy of forecasts with short, medium, and long pred",
    "path": "papers/23/01/2301.00582.json",
    "total_tokens": 949,
    "translated_title": "具有跳过连接的稀疏神经网络用于铝电解槽识别",
    "translated_abstract": "神经网络因其能够直接从数据中捕获复杂的输入-输出关系的模型能力而在非线性系统识别中迅速引起关注。然而，虽然该方法具有很大的灵活性，但在此背景下，仍然存在有关这些模型安全性的担忧，以及需要大量潜在昂贵的数据。铝电解是一种高度非线性的生产过程，大多数数据必须手动采样，使采样过程昂贵且频率低。在状态变量少量测量的情况下，长期预测的准确性和开环稳定性变得非常重要。标准神经网络在有限的训练数据下很难提供稳定的长期预测。在这项工作中，我们研究了将串联跳过连接和促进稀疏的$\\ell _{1}$正则化相结合对短期、中期和长期预测的开环稳定性和准确性的影响。",
    "tldr": "本文研究了将串联跳过连接和稀疏正则化相结合用于铝电解槽识别的稀疏神经网络，能够提高长期预测的开环稳定性和准确性，解决有限训练数据下标准神经网络难以提供稳定预测的问题。",
    "en_tdlr": "This paper investigates the use of sparse neural networks with concatenated skip-connections and sparsity-promoting $\\ell_1$ regularization for identification of aluminum electrolysis cell, which improves the open-loop stability and accuracy of long-term predictions, addressing the issue of standard neural networks struggling to provide stable predictions with limited training data."
}