{
    "title": "A Linear Reconstruction Approach for Attribute Inference Attacks against Synthetic Data. (arXiv:2301.10053v2 [cs.LG] UPDATED)",
    "abstract": "Recent advances in synthetic data generation (SDG) have been hailed as a solution to the difficult problem of sharing sensitive data while protecting privacy. SDG aims to learn statistical properties of real data in order to generate \"artificial\" data that are structurally and statistically similar to sensitive data. However, prior research suggests that inference attacks on synthetic data can undermine privacy, but only for specific outlier records. In this work, we introduce a new attribute inference attack against synthetic data. The attack is based on linear reconstruction methods for aggregate statistics, which target all records in the dataset, not only outliers. We evaluate our attack on state-of-the-art SDG algorithms, including Probabilistic Graphical Models, Generative Adversarial Networks, and recent differentially private SDG mechanisms. By defining a formal privacy game, we show that our attack can be highly accurate even on arbitrary records, and that this is the result o",
    "link": "http://arxiv.org/abs/2301.10053",
    "context": "Title: A Linear Reconstruction Approach for Attribute Inference Attacks against Synthetic Data. (arXiv:2301.10053v2 [cs.LG] UPDATED)\nAbstract: Recent advances in synthetic data generation (SDG) have been hailed as a solution to the difficult problem of sharing sensitive data while protecting privacy. SDG aims to learn statistical properties of real data in order to generate \"artificial\" data that are structurally and statistically similar to sensitive data. However, prior research suggests that inference attacks on synthetic data can undermine privacy, but only for specific outlier records. In this work, we introduce a new attribute inference attack against synthetic data. The attack is based on linear reconstruction methods for aggregate statistics, which target all records in the dataset, not only outliers. We evaluate our attack on state-of-the-art SDG algorithms, including Probabilistic Graphical Models, Generative Adversarial Networks, and recent differentially private SDG mechanisms. By defining a formal privacy game, we show that our attack can be highly accurate even on arbitrary records, and that this is the result o",
    "path": "papers/23/01/2301.10053.json",
    "total_tokens": 841,
    "translated_title": "一种针对合成数据的属性推断攻击的线性重构方法",
    "translated_abstract": "最近合成数据生成（SDG）的发展被誉为共享敏感数据和保护隐私的难题的解决方案。SDG旨在学习真实数据的统计属性，生成结构和统计学相似的“人造”数据。然而，先前的研究表明，对合成数据的推论攻击可能会破坏隐私，但仅适用于特定的异常记录。本研究引入了一种新的针对合成数据的属性推断攻击。该攻击基于线性重构方法用于聚合统计数据，攻击目标不仅仅是异常值，而是整个数据集中的所有记录。我们评估了我们的攻击对最先进的SDG算法的影响，包括概率图模型，生成式对抗网络和最近的差分隐私SDG机制。通过定义形式化的隐私博弈，我们展示了我们的攻击甚至对任意记录都可以高度精确，并且这是攻击的结果。",
    "tldr": "本研究提出一种新的属性推断攻击方法，针对合成数据中所有记录，具有高度的准确率和危害性。",
    "en_tdlr": "This paper proposes a new attribute inference attack method against synthetic data, which targets all records and has high accuracy and harm."
}