{
    "title": "Discovery of structure-property relations for molecules via hypothesis-driven active learning over the chemical space. (arXiv:2301.02665v2 [cs.LG] UPDATED)",
    "abstract": "Discovery of the molecular candidates for applications in drug targets, biomolecular systems, catalysts, photovoltaics, organic electronics, and batteries, necessitates development of machine learning algorithms capable of rapid exploration of the chemical spaces targeting the desired functionalities. Here we introduce a novel approach for the active learning over the chemical spaces based on hypothesis learning. We construct the hypotheses on the possible relationships between structures and functionalities of interest based on a small subset of data and introduce them as (probabilistic) mean functions for the Gaussian process. This approach combines the elements from the symbolic regression methods such as SISSO and active learning into a single framework. The primary focus of constructing this framework is to approximate physical laws in an active learning regime toward a more robust predictive performance, as traditional evaluation on hold-out sets in machine learning doesn't accou",
    "link": "http://arxiv.org/abs/2301.02665",
    "context": "Title: Discovery of structure-property relations for molecules via hypothesis-driven active learning over the chemical space. (arXiv:2301.02665v2 [cs.LG] UPDATED)\nAbstract: Discovery of the molecular candidates for applications in drug targets, biomolecular systems, catalysts, photovoltaics, organic electronics, and batteries, necessitates development of machine learning algorithms capable of rapid exploration of the chemical spaces targeting the desired functionalities. Here we introduce a novel approach for the active learning over the chemical spaces based on hypothesis learning. We construct the hypotheses on the possible relationships between structures and functionalities of interest based on a small subset of data and introduce them as (probabilistic) mean functions for the Gaussian process. This approach combines the elements from the symbolic regression methods such as SISSO and active learning into a single framework. The primary focus of constructing this framework is to approximate physical laws in an active learning regime toward a more robust predictive performance, as traditional evaluation on hold-out sets in machine learning doesn't accou",
    "path": "papers/23/01/2301.02665.json",
    "total_tokens": 869,
    "translated_title": "通过基于假设的主动学习，探索分子的结构-性质关系",
    "translated_abstract": "发现应用于药物靶点、生物分子系统、催化剂、光伏、有机电子和电池的分子候选者，需要开发能够快速探索化学空间的机器学习算法，以针对所需的功能进行目标化。本文介绍了一种基于假设学习的化学空间主动学习的新方法。我们构建了关于感兴趣的结构和功能之间可能关系的假设，基于少量的数据，并将它们引入高斯过程中作为（概率）均值函数。这种方法将符号回归方法（如SISSO）和主动学习的元素结合到一个框架中。构建这个框架的主要重点是在主动学习环境中逼近物理定律，以实现更稳健的预测性能，因为机器学习中传统的保留集评估并不能完全解决这个问题。",
    "tldr": "通过假设学习技术，将符号回归和主动学习元素结合起来，为机器学习算法在化学空间中快速探索和预测分子的结构-性质关系提供了一种新的框架。",
    "en_tdlr": "A novel approach is introduced for active learning over chemical spaces based on hypothesis learning, combining elements from symbolic regression methods and active learning into a single framework to explore and predict structure-property relations for molecules in a more robust and efficient way."
}