{
    "title": "Kernel Subspace and Feature Extraction. (arXiv:2301.01410v2 [cs.LG] UPDATED)",
    "abstract": "We study kernel methods in machine learning from the perspective of feature subspace. We establish a one-to-one correspondence between feature subspaces and kernels and propose an information-theoretic measure for kernels. In particular, we construct a kernel from Hirschfeld--Gebelein--R\\'{e}nyi maximal correlation functions, coined the maximal correlation kernel, and demonstrate its information-theoretic optimality. We use the support vector machine (SVM) as an example to illustrate a connection between kernel methods and feature extraction approaches. We show that the kernel SVM on maximal correlation kernel achieves minimum prediction error. Finally, we interpret the Fisher kernel as a special maximal correlation kernel and establish its optimality.",
    "link": "http://arxiv.org/abs/2301.01410",
    "context": "Title: Kernel Subspace and Feature Extraction. (arXiv:2301.01410v2 [cs.LG] UPDATED)\nAbstract: We study kernel methods in machine learning from the perspective of feature subspace. We establish a one-to-one correspondence between feature subspaces and kernels and propose an information-theoretic measure for kernels. In particular, we construct a kernel from Hirschfeld--Gebelein--R\\'{e}nyi maximal correlation functions, coined the maximal correlation kernel, and demonstrate its information-theoretic optimality. We use the support vector machine (SVM) as an example to illustrate a connection between kernel methods and feature extraction approaches. We show that the kernel SVM on maximal correlation kernel achieves minimum prediction error. Finally, we interpret the Fisher kernel as a special maximal correlation kernel and establish its optimality.",
    "path": "papers/23/01/2301.01410.json",
    "total_tokens": 833,
    "translated_title": "核子空间和特征提取",
    "translated_abstract": "本文从特征子空间的角度研究了机器学习中的核方法，建立了特征子空间和核之间的一一对应关系，并提出了一个信息熵度量方法用于核的比较。特别地，我们构建了一个由Hirschfeld-Gebelein-R\\'{e}nyi极大相关函数构成的核，称之为极大相关核，并展示了它在信息熵度量方面的最优性。我们以支持向量机(SVM)为例，将核方法与特征提取方法联系起来，并表明在极大相关核上的核SVM具有最小预测误差。最后，我们把Fisher核解释为一种特殊的极大相关核，并建立了它的最优性。",
    "tldr": "本文研究了机器学习中的核方法，建立了特征子空间和核之间的一一对应关系，并提出了一个信息熵度量方法用于核的比较。特别地，构建了一个极大相关核，并证明其在信息熵度量方面的最优性。最后，把Fisher核解释为一种特殊的极大相关核，并建立了它的最优性。",
    "en_tdlr": "This paper investigates kernel methods in machine learning, establishes a one-to-one correspondence between feature subspaces and kernels, proposes an information-theoretic measure for kernels, constructs a maximal correlation kernel, and demonstrates its optimality. The paper also shows the connection between kernel methods and feature extraction approaches using support vector machine (SVM) as an example, and interprets the Fisher kernel as a special maximal correlation kernel with optimality established."
}