{
    "title": "Affinity Uncertainty-based Hard Negative Mining in Graph Contrastive Learning. (arXiv:2301.13340v2 [cs.LG] UPDATED)",
    "abstract": "Hard negative mining has shown effective in enhancing self-supervised contrastive learning (CL) on diverse data types, including graph CL (GCL). The existing hardness-aware CL methods typically treat negative instances that are most similar to the anchor instance as hard negatives, which helps improve the CL performance, especially on image data. However, this approach often fails to identify the hard negatives but leads to many false negatives on graph data. This is mainly due to that the learned graph representations are not sufficiently discriminative due to oversmooth representations and/or non-independent and identically distributed (non-i.i.d.) issues in graph data. To tackle this problem, this article proposes a novel approach that builds a discriminative model on collective affinity information (i.e., two sets of pairwise affinities between the negative instances and the anchor instance) to mine hard negatives in GCL. In particular, the proposed approach evaluates how confident",
    "link": "http://arxiv.org/abs/2301.13340",
    "context": "Title: Affinity Uncertainty-based Hard Negative Mining in Graph Contrastive Learning. (arXiv:2301.13340v2 [cs.LG] UPDATED)\nAbstract: Hard negative mining has shown effective in enhancing self-supervised contrastive learning (CL) on diverse data types, including graph CL (GCL). The existing hardness-aware CL methods typically treat negative instances that are most similar to the anchor instance as hard negatives, which helps improve the CL performance, especially on image data. However, this approach often fails to identify the hard negatives but leads to many false negatives on graph data. This is mainly due to that the learned graph representations are not sufficiently discriminative due to oversmooth representations and/or non-independent and identically distributed (non-i.i.d.) issues in graph data. To tackle this problem, this article proposes a novel approach that builds a discriminative model on collective affinity information (i.e., two sets of pairwise affinities between the negative instances and the anchor instance) to mine hard negatives in GCL. In particular, the proposed approach evaluates how confident",
    "path": "papers/23/01/2301.13340.json",
    "total_tokens": 874,
    "translated_title": "图对比学习中基于亲和力不确定性的负样本挖掘",
    "translated_abstract": "在各种数据类型中，包括图对比学习（GCL）中，困难负样本挖掘已经显示出有效增强自监督对比学习（CL）的性能。现有的基于困难度的CL方法通常将与锚点实例最相似的负实例视为困难负例，这有助于改善CL性能，特别是在图像数据上。然而，在图数据上，这种方法经常无法识别出困难负例，反而会导致很多错误的负例。这主要是因为学到的图表示在图数据中由于过度平滑表示和/或非独立同分布（non-i.i.d.）问题而不够有区别性。为了解决这个问题，本文提出了一种新颖的方法，它在群体亲和力信息（即负实例与锚点实例之间的两组成对亲和力）上构建了一个有区别性的模型来挖掘GCL中的困难负例。",
    "tldr": "本文提出了一种新颖的方法，在图对比学习（GCL）中使用亲和力信息来挖掘困难负样本，以解决图数据中困难负样本识别困难的问题。"
}