{
    "title": "Convolutional autoencoder for the spatiotemporal latent representation of turbulence. (arXiv:2301.13728v2 [physics.flu-dyn] UPDATED)",
    "abstract": "Turbulence is characterised by chaotic dynamics and a high-dimensional state space, which make this phenomenon challenging to predict. However, turbulent flows are often characterised by coherent spatiotemporal structures, such as vortices or large-scale modes, which can help obtain a latent description of turbulent flows. However, current approaches are often limited by either the need to use some form of thresholding on quantities defining the isosurfaces to which the flow structures are associated or the linearity of traditional modal flow decomposition approaches, such as those based on proper orthogonal decomposition. This problem is exacerbated in flows that exhibit extreme events, which are rare and sudden changes in a turbulent state. The goal of this paper is to obtain an efficient and accurate reduced-order latent representation of a turbulent flow that exhibits extreme events. Specifically, we employ a three-dimensional multiscale convolutional autoencoder (CAE) to obtain su",
    "link": "http://arxiv.org/abs/2301.13728",
    "context": "Title: Convolutional autoencoder for the spatiotemporal latent representation of turbulence. (arXiv:2301.13728v2 [physics.flu-dyn] UPDATED)\nAbstract: Turbulence is characterised by chaotic dynamics and a high-dimensional state space, which make this phenomenon challenging to predict. However, turbulent flows are often characterised by coherent spatiotemporal structures, such as vortices or large-scale modes, which can help obtain a latent description of turbulent flows. However, current approaches are often limited by either the need to use some form of thresholding on quantities defining the isosurfaces to which the flow structures are associated or the linearity of traditional modal flow decomposition approaches, such as those based on proper orthogonal decomposition. This problem is exacerbated in flows that exhibit extreme events, which are rare and sudden changes in a turbulent state. The goal of this paper is to obtain an efficient and accurate reduced-order latent representation of a turbulent flow that exhibits extreme events. Specifically, we employ a three-dimensional multiscale convolutional autoencoder (CAE) to obtain su",
    "path": "papers/23/01/2301.13728.json",
    "total_tokens": 735,
    "translated_title": "用于湍流时空潜在描述的卷积自编码器",
    "translated_abstract": "湍流的混沌动力学和高维状态空间使得其难以预测。然而，湍流流动常常被一些连续的时空结构所描述，如漩涡或大尺度模式，这可以帮助获得湍流流动的潜在描述。然而，目前的方法通常受到阈值化和传统模态流分解方法的线性性的限制。本文旨在获得一种对于具有极端事件的湍流流动而言既高效又准确的降维潜在描述。具体来说，我们采用三维多尺度卷积自编码器(CAE)来获得湍流流动的潜在描述。",
    "tldr": "采用卷积自编码器获得高效准确的湍流流动潜在描述。",
    "en_tdlr": "Efficient and accurate latent representation of turbulent flows is obtained using convolutional autoencoder."
}