{
    "title": "tasksource: A Dataset Harmonization Framework for Streamlined NLP Multi-Task Learning and Evaluation. (arXiv:2301.05948v3 [cs.CL] UPDATED)",
    "abstract": "The HuggingFace Datasets Hub hosts thousands of datasets, offering exciting opportunities for language model training and evaluation. However, datasets for a specific task type often have different schemas, making harmonization challenging. Multi-task training or evaluation necessitates manual work to fit data into task templates. Several initiatives independently tackle this issue by releasing harmonized datasets or providing harmonization codes to preprocess datasets into a consistent format. We identify patterns across previous preprocessing efforts, such as column name mapping and extracting specific sub-fields from structured data in a column. We then propose a structured annotation framework that ensures our annotations are fully exposed and not hidden within unstructured code. We release a dataset annotation framework and dataset annotations for more than 500 English tasks\\footnote{\\url{https://github.com/sileod/tasksource}}. These annotations include metadata, such as the names",
    "link": "http://arxiv.org/abs/2301.05948",
    "context": "Title: tasksource: A Dataset Harmonization Framework for Streamlined NLP Multi-Task Learning and Evaluation. (arXiv:2301.05948v3 [cs.CL] UPDATED)\nAbstract: The HuggingFace Datasets Hub hosts thousands of datasets, offering exciting opportunities for language model training and evaluation. However, datasets for a specific task type often have different schemas, making harmonization challenging. Multi-task training or evaluation necessitates manual work to fit data into task templates. Several initiatives independently tackle this issue by releasing harmonized datasets or providing harmonization codes to preprocess datasets into a consistent format. We identify patterns across previous preprocessing efforts, such as column name mapping and extracting specific sub-fields from structured data in a column. We then propose a structured annotation framework that ensures our annotations are fully exposed and not hidden within unstructured code. We release a dataset annotation framework and dataset annotations for more than 500 English tasks\\footnote{\\url{https://github.com/sileod/tasksource}}. These annotations include metadata, such as the names",
    "path": "papers/23/01/2301.05948.json",
    "total_tokens": 819,
    "translated_title": "tasksource：流畅的NLP多任务学习和评估的数据集协调框架",
    "translated_abstract": "HuggingFace数据集中心提供数千个数据集，为语言模型的训练和评估提供了令人兴奋的机会。然而，特定任务类型的数据集往往具有不同的架构，使得协调变得具有挑战性。多任务训练或评估需要手动将数据适配到任务模板中。为了解决这个问题，一些倡议采取独立的方法，发布协调的数据集或提供协调代码以将数据集预处理为一致格式。我们确定了以前的预处理工作中的模式，例如列名称映射和从列中提取结构化数据的特定子字段。然后，我们提出了一个结构化注释框架，确保我们的注释完全暴露而不隐藏在非结构化代码中。我们发布了一个数据集注释框架和500多个英语任务的数据集注释。",
    "tldr": "tasksource是一个数据集协调框架，为多任务学习和评估提供流畅的体验。该框架提供了结构化注释，使得数据处理更加便捷。",
    "en_tdlr": "tasksource is a dataset harmonization framework aimed at providing seamless experiences for NLP multi-task learning and evaluation. The framework offers structured annotations to simplify data processing."
}