{
    "title": "Commitment Against Front Running Attacks. (arXiv:2301.13785v2 [econ.TH] UPDATED)",
    "abstract": "We provide a game-theoretic analysis of the problem of front-running attacks. We use it to distinguish attacks from legitimate competition among honest users for having their transactions included earlier in the block. We also use it to introduce an intuitive notion of the severity of front-running attacks. We then study a simple commit-reveal protocol and discuss its properties. This protocol has costs because it requires two messages and imposes a delay. However, we show that it prevents the most severe front-running attacks while preserving legitimate competition between users, guaranteeing that the earliest transaction in a block belongs to the honest user who values it the most. Furthermore, it reduces competition among attackers, which also benefits honest users.",
    "link": "http://arxiv.org/abs/2301.13785",
    "context": "Title: Commitment Against Front Running Attacks. (arXiv:2301.13785v2 [econ.TH] UPDATED)\nAbstract: We provide a game-theoretic analysis of the problem of front-running attacks. We use it to distinguish attacks from legitimate competition among honest users for having their transactions included earlier in the block. We also use it to introduce an intuitive notion of the severity of front-running attacks. We then study a simple commit-reveal protocol and discuss its properties. This protocol has costs because it requires two messages and imposes a delay. However, we show that it prevents the most severe front-running attacks while preserving legitimate competition between users, guaranteeing that the earliest transaction in a block belongs to the honest user who values it the most. Furthermore, it reduces competition among attackers, which also benefits honest users.",
    "path": "papers/23/01/2301.13785.json",
    "total_tokens": 801,
    "translated_title": "“反前向交易攻击”问题的解决方案",
    "translated_abstract": "我们提供了一个关于前向交易攻击问题的博弈论分析，并使用它来区分攻击与合法用户之间为争先区块而进行的竞争。我们还用它来引入一个直观的前向交易攻击严重性概念。随后，我们研究了一种简单的提交-揭示协议，并讨论了其特点。该协议有成本，因为它需要两条消息和引入了延迟。但是，我们表明它能够防止最严重的前向交易攻击，同时保护合法用户之间的谁能够最早获得放在区块里的交易的合法竞争。此外，它还减少了攻击者之间的竞争，这也有利于诚实的用户。",
    "tldr": "研究者提供了一个能够区分前向交易攻击与合法竞争的博弈论分析，并提出一种提交-揭示协议解决了最严重的前向交易攻击，同时保持了合法用户之间的交易竞争，也减少了攻击者之间的竞争。",
    "en_tdlr": "The researchers conducted a game-theoretic analysis that distinguishes front-running attacks from legitimate competition among honest users. They introduced a commit-reveal protocol that prevents severe front-running attacks while preserving legitimate competition and reducing competition among attackers."
}