{
    "title": "Investigating the Impact of Direct Punishment on the Emergence of Cooperation in Multi-Agent Reinforcement Learning Systems. (arXiv:2301.08278v2 [cs.MA] UPDATED)",
    "abstract": "Solving the problem of cooperation is of fundamental importance to the creation and maintenance of functional societies, with examples of cooperative dilemmas ranging from navigating busy road junctions to negotiating carbon reduction treaties. As the use of AI becomes more pervasive throughout society, the need for socially intelligent agents that are able to navigate these complex cooperative dilemmas is becoming increasingly evident. In the natural world, direct punishment is an ubiquitous social mechanism that has been shown to benefit the emergence of cooperation within populations. However no prior work has investigated its impact on the development of cooperation within populations of artificial learning agents experiencing social dilemmas. Additionally, within natural populations the use of any form of punishment is strongly coupled with the related social mechanisms of partner selection and reputation. However, no previous work has considered the impact of combining multiple s",
    "link": "http://arxiv.org/abs/2301.08278",
    "context": "Title: Investigating the Impact of Direct Punishment on the Emergence of Cooperation in Multi-Agent Reinforcement Learning Systems. (arXiv:2301.08278v2 [cs.MA] UPDATED)\nAbstract: Solving the problem of cooperation is of fundamental importance to the creation and maintenance of functional societies, with examples of cooperative dilemmas ranging from navigating busy road junctions to negotiating carbon reduction treaties. As the use of AI becomes more pervasive throughout society, the need for socially intelligent agents that are able to navigate these complex cooperative dilemmas is becoming increasingly evident. In the natural world, direct punishment is an ubiquitous social mechanism that has been shown to benefit the emergence of cooperation within populations. However no prior work has investigated its impact on the development of cooperation within populations of artificial learning agents experiencing social dilemmas. Additionally, within natural populations the use of any form of punishment is strongly coupled with the related social mechanisms of partner selection and reputation. However, no previous work has considered the impact of combining multiple s",
    "path": "papers/23/01/2301.08278.json",
    "total_tokens": 1159,
    "tldr": "本文研究了直接惩罚对于多智能体强化学习系统中合作机制的影响。通过实验发现，直接惩罚有助于增加机器人协作的频率和成功率。",
    "en_tdlr": "This paper investigates the impact of direct punishment on the development of cooperation within populations of artificial learning agents experiencing social dilemmas. Through experiments using multi-agent reinforcement learning techniques, the results show that direct punishment enhances the frequency and success rate of robot cooperation."
}