{
    "title": "Pre-Training Protein Encoder via Siamese Sequence-Structure Diffusion Trajectory Prediction. (arXiv:2301.12068v2 [cs.LG] UPDATED)",
    "abstract": "Self-supervised pre-training methods on proteins have recently gained attention, with most approaches focusing on either protein sequences or structures, neglecting the exploration of their joint distribution, which is crucial for a comprehensive understanding of protein functions by integrating co-evolutionary information and structural characteristics. In this work, inspired by the success of denoising diffusion models in generative tasks, we propose the DiffPreT approach to pre-train a protein encoder by sequence-structure joint diffusion modeling. DiffPreT guides the encoder to recover the native protein sequences and structures from the perturbed ones along the joint diffusion trajectory, which acquires the joint distribution of sequences and structures. Considering the essential protein conformational variations, we enhance DiffPreT by a method called Siamese Diffusion Trajectory Prediction (SiamDiff) to capture the correlation between different conformers of a protein. SiamDiff ",
    "link": "http://arxiv.org/abs/2301.12068",
    "context": "Title: Pre-Training Protein Encoder via Siamese Sequence-Structure Diffusion Trajectory Prediction. (arXiv:2301.12068v2 [cs.LG] UPDATED)\nAbstract: Self-supervised pre-training methods on proteins have recently gained attention, with most approaches focusing on either protein sequences or structures, neglecting the exploration of their joint distribution, which is crucial for a comprehensive understanding of protein functions by integrating co-evolutionary information and structural characteristics. In this work, inspired by the success of denoising diffusion models in generative tasks, we propose the DiffPreT approach to pre-train a protein encoder by sequence-structure joint diffusion modeling. DiffPreT guides the encoder to recover the native protein sequences and structures from the perturbed ones along the joint diffusion trajectory, which acquires the joint distribution of sequences and structures. Considering the essential protein conformational variations, we enhance DiffPreT by a method called Siamese Diffusion Trajectory Prediction (SiamDiff) to capture the correlation between different conformers of a protein. SiamDiff ",
    "path": "papers/23/01/2301.12068.json",
    "total_tokens": 954,
    "translated_title": "通过孪生序列-结构扩散轨迹预测进行蛋白质编码器的预训练",
    "translated_abstract": "最近，自监督预训练方法在蛋白质领域引起了关注，大多数方法要么集中于蛋白质序列，要么集中于蛋白质结构，忽视了它们的联合分布的探索，而联合分布对于全面了解蛋白质功能非常重要，因为它能够整合共同演化信息和结构特性。本研究受到去噪扩散模型在生成任务中的成功启发，提出了DiffPreT方法，通过序列-结构联合扩散建模来预训练蛋白质编码器。DiffPreT引导编码器从扰动的序列和结构中恢复出原始蛋白质序列和结构，从而获得了序列和结构的联合分布。考虑到蛋白质构象的重要变化，我们通过一种称为孪生扩散轨迹预测（SiamDiff）的方法增强了DiffPreT，以捕捉蛋白质的不同构象之间的相关性。",
    "tldr": "本研究提出了一种名为DiffPreT的方法，通过序列-结构联合扩散建模来预训练蛋白质编码器。同时，通过一种称为SiamDiff的方法增强了DiffPreT，以捕捉蛋白质的不同构象之间的相关性。"
}