{
    "title": "Randomized Block-Coordinate Optimistic Gradient Algorithms for Root-Finding Problems. (arXiv:2301.03113v3 [math.OC] UPDATED)",
    "abstract": "In this paper, we develop two new randomized block-coordinate optimistic gradient algorithms to approximate a solution of nonlinear equations in large-scale settings, which are called root-finding problems. Our first algorithm is non-accelerated with constant stepsizes, and achieves $\\mathcal{O}(1/k)$ best-iterate convergence rate on $\\mathbb{E}[ \\Vert Gx^k\\Vert^2]$ when the underlying operator $G$ is Lipschitz continuous and satisfies a weak Minty solution condition, where $\\mathbb{E}[\\cdot]$ is the expectation and $k$ is the iteration counter. Our second method is a new accelerated randomized block-coordinate optimistic gradient algorithm. We establish both $\\mathcal{O}(1/k^2)$ and $o(1/k^2)$ last-iterate convergence rates on both $\\mathbb{E}[ \\Vert Gx^k\\Vert^2]$ and $\\mathbb{E}[ \\Vert x^{k+1} x^{k}\\Vert^2]$ for this algorithm under the co-coerciveness of $G$. In addition, we prove that the iterate sequence $\\{x^k\\}$ converges to a solution almost surely, and $\\Vert Gx^k\\Vert^2$ at",
    "link": "http://arxiv.org/abs/2301.03113",
    "context": "Title: Randomized Block-Coordinate Optimistic Gradient Algorithms for Root-Finding Problems. (arXiv:2301.03113v3 [math.OC] UPDATED)\nAbstract: In this paper, we develop two new randomized block-coordinate optimistic gradient algorithms to approximate a solution of nonlinear equations in large-scale settings, which are called root-finding problems. Our first algorithm is non-accelerated with constant stepsizes, and achieves $\\mathcal{O}(1/k)$ best-iterate convergence rate on $\\mathbb{E}[ \\Vert Gx^k\\Vert^2]$ when the underlying operator $G$ is Lipschitz continuous and satisfies a weak Minty solution condition, where $\\mathbb{E}[\\cdot]$ is the expectation and $k$ is the iteration counter. Our second method is a new accelerated randomized block-coordinate optimistic gradient algorithm. We establish both $\\mathcal{O}(1/k^2)$ and $o(1/k^2)$ last-iterate convergence rates on both $\\mathbb{E}[ \\Vert Gx^k\\Vert^2]$ and $\\mathbb{E}[ \\Vert x^{k+1} x^{k}\\Vert^2]$ for this algorithm under the co-coerciveness of $G$. In addition, we prove that the iterate sequence $\\{x^k\\}$ converges to a solution almost surely, and $\\Vert Gx^k\\Vert^2$ at",
    "path": "papers/23/01/2301.03113.json",
    "total_tokens": 1034,
    "translated_title": "随机块坐标乐观梯度算法解决根查找问题",
    "translated_abstract": "本文提出了两种新的随机块坐标乐观梯度算法，用于在大规模情况下近似求解非线性方程，也称为根查找问题。第一种算法使用恒定的步长，非加速算法，在底层算子G满足Lipschitz连续性和弱Minty解条件时，它在数学期望E[||Gx^k||^2]上达到O(1/k)的最优迭代收敛速度，其中E[·]表示期望，k为迭代计数器。第二种方法是一种新的加速随机块坐标乐观梯度算法，在G的夹逼性条件下，该算法在E[||Gx^k||^2]和E[||x^{k+1} x^{k}||^2]上分别达到O(1/k^2)和o(1/k^2)的迭代收敛速度。此外，我们证明迭代序列{x^k}几乎必然收敛到一个解，以及在此解处Gx^k的模的平方在...",
    "tldr": "本文提出了两种新的随机乐观梯度算法来解决大规模情况下的根查找问题。第一种算法在底层算子满足一定条件时可以达到较好的收敛速度，第二种算法是一种加速算法，可以更快地收敛。算法的收敛性和解的存在性也得到了证明。",
    "en_tdlr": "This paper proposes two new randomized optimistic gradient algorithms to solve root-finding problems in large-scale settings. The first algorithm achieves good convergence rate under certain conditions, while the second algorithm is an accelerated version that converges faster. The convergence and existence of solutions are also proven."
}