{
    "title": "Coincident Learning for Unsupervised Anomaly Detection. (arXiv:2301.11368v2 [cs.LG] UPDATED)",
    "abstract": "Anomaly detection is an important task for complex systems (e.g., industrial facilities, manufacturing, large-scale science experiments), where failures in a sub-system can lead to low yield, faulty products, or even damage to components. While complex systems often have a wealth of data, labeled anomalies are typically rare (or even nonexistent) and expensive to acquire. Unsupervised approaches are therefore common and typically search for anomalies either by distance or density of examples in the input feature space (or some associated low-dimensional representation). This paper presents a novel approach called CoAD, which is specifically designed for multi-modal tasks and identifies anomalies based on \\textit{coincident} behavior across two different slices of the feature space. We define an \\textit{unsupervised} metric, $\\hat{F}_\\beta$, out of analogy to the supervised classification $F_\\beta$ statistic. CoAD uses $\\hat{F}_\\beta$ to train an anomaly detection algorithm on \\textit{u",
    "link": "http://arxiv.org/abs/2301.11368",
    "context": "Title: Coincident Learning for Unsupervised Anomaly Detection. (arXiv:2301.11368v2 [cs.LG] UPDATED)\nAbstract: Anomaly detection is an important task for complex systems (e.g., industrial facilities, manufacturing, large-scale science experiments), where failures in a sub-system can lead to low yield, faulty products, or even damage to components. While complex systems often have a wealth of data, labeled anomalies are typically rare (or even nonexistent) and expensive to acquire. Unsupervised approaches are therefore common and typically search for anomalies either by distance or density of examples in the input feature space (or some associated low-dimensional representation). This paper presents a novel approach called CoAD, which is specifically designed for multi-modal tasks and identifies anomalies based on \\textit{coincident} behavior across two different slices of the feature space. We define an \\textit{unsupervised} metric, $\\hat{F}_\\beta$, out of analogy to the supervised classification $F_\\beta$ statistic. CoAD uses $\\hat{F}_\\beta$ to train an anomaly detection algorithm on \\textit{u",
    "path": "papers/23/01/2301.11368.json",
    "total_tokens": 851,
    "translated_title": "无监督异常检测的巧合学习",
    "translated_abstract": "异常检测是复杂系统中的重要任务，比如工业设施、制造业、大型科学实验等，其中子系统的故障可能导致低产量、有缺陷的产品甚至损坏组件。虽然复杂系统通常有大量的数据，但标记的异常通常是稀有的（甚至不存在），并且获取起来很昂贵。因此，无监督方法很常见，通常通过距离或密度来搜索输入特征空间中的异常（或与之相关的低维表示）。本文提出了一种名为CoAD的新方法，专门设计用于多模态任务，并根据特征空间中两个不同部分的“巧合”行为来识别异常。我们定义了一个“无监督”度量$\\hat{F}_\\beta$，以类比有监督分类的$F_\\beta$统计量。CoAD使用$\\hat{F}_\\beta$来训练一个异常检测算法。",
    "tldr": "本文提出了一种名为CoAD的新方法，通过巧合学习来进行无监督异常检测，在多模态任务中通过特征空间的巧合行为来识别异常。",
    "en_tdlr": "This paper presents a novel approach called CoAD for unsupervised anomaly detection that identifies anomalies based on coincident behavior across different slices of the feature space in multi-modal tasks."
}