{
    "title": "A data science and machine learning approach to continuous analysis of Shakespeare's plays. (arXiv:2301.06024v3 [cs.CL] UPDATED)",
    "abstract": "The availability of quantitative text analysis methods has provided new ways of analyzing literature in a manner that was not available in the pre-information era. Here we apply comprehensive machine learning analysis to the work of William Shakespeare. The analysis shows clear changes in the style of writing over time, with the most significant changes in the sentence length, frequency of adjectives and adverbs, and the sentiments expressed in the text. Applying machine learning to make a stylometric prediction of the year of the play shows a Pearson correlation of 0.71 between the actual and predicted year, indicating that Shakespeare's writing style as reflected by the quantitative measurements changed over time. Additionally, it shows that the stylometrics of some of the plays is more similar to plays written either before or after the year they were written. For instance, Romeo and Juliet is dated 1596, but is more similar in stylometrics to plays written by Shakespeare after 1600",
    "link": "http://arxiv.org/abs/2301.06024",
    "context": "Title: A data science and machine learning approach to continuous analysis of Shakespeare's plays. (arXiv:2301.06024v3 [cs.CL] UPDATED)\nAbstract: The availability of quantitative text analysis methods has provided new ways of analyzing literature in a manner that was not available in the pre-information era. Here we apply comprehensive machine learning analysis to the work of William Shakespeare. The analysis shows clear changes in the style of writing over time, with the most significant changes in the sentence length, frequency of adjectives and adverbs, and the sentiments expressed in the text. Applying machine learning to make a stylometric prediction of the year of the play shows a Pearson correlation of 0.71 between the actual and predicted year, indicating that Shakespeare's writing style as reflected by the quantitative measurements changed over time. Additionally, it shows that the stylometrics of some of the plays is more similar to plays written either before or after the year they were written. For instance, Romeo and Juliet is dated 1596, but is more similar in stylometrics to plays written by Shakespeare after 1600",
    "path": "papers/23/01/2301.06024.json",
    "total_tokens": 1000,
    "translated_title": "对莎士比亚戏剧的连续分析的数据科学和机器学习方法",
    "translated_abstract": "数量化的文本分析方法的可行性为文学分析提供了新的途径。本文将综合机器学习分析应用于威廉·莎士比亚的作品。分析结果显示，莎士比亚的写作风格随着时间的推移发生了明显的变化，其中最显著的变化包括句子长度、形容词和副词的频率以及文本中表达的情感。将机器学习应用于对戏剧年份的风格预测表明，实际年份和预测年份之间的皮尔逊相关系数为0.71，表明莎士比亚的写作风格在数量化测量方面随时间变化。此外，研究还发现，某些戏剧的风格特征更类似于它们的写作年份之前或之后的作品。例如，\"罗密欧与朱丽叶\"的日期为1596年，但在风格特征上更类似于1600年之后莎士比亚的其他作品。",
    "tldr": "通过数据科学和机器学习的方法，对莎士比亚的作品进行了连续分析，发现他的写作风格随着时间的推移发生了变化，其中包括句子长度、形容词和副词的频率以及文本中表达的情感。此外，研究还发现，部分戏剧的风格特征更类似于其写作时间之前或之后的作品。",
    "en_tdlr": "A data science and machine learning analysis of Shakespeare's plays revealed changes in his writing style over time, including sentence length, frequency of adjectives and adverbs, and the sentiments expressed in the text. It also found that some plays had similar stylometric features to those written before or after their actual date of publication."
}