{
    "title": "Federated Recommendation with Additive Personalization. (arXiv:2301.09109v3 [cs.LG] UPDATED)",
    "abstract": "Building recommendation systems via federated learning (FL) is a new emerging challenge for advancing next-generation Internet service and privacy protection. Existing approaches train shared item embedding by FL while keeping the user embedding private on client side. However, item embedding identical for all clients cannot capture users' individual differences on perceiving the same item and thus leads to poor personalization. Moreover, dense item embedding in FL results in expensive communication cost and latency. To address these challenges, we propose Federated Recommendation with Additive Personalization (FedRAP), which learns a global view of items via FL and a personalized view locally on each user. FedRAP enforces sparsity of the global view to save FL's communication cost and encourages difference between the two views through regularization. We propose an effective curriculum to learn the local and global views progressively with increasing regularization weights. To produce",
    "link": "http://arxiv.org/abs/2301.09109",
    "context": "Title: Federated Recommendation with Additive Personalization. (arXiv:2301.09109v3 [cs.LG] UPDATED)\nAbstract: Building recommendation systems via federated learning (FL) is a new emerging challenge for advancing next-generation Internet service and privacy protection. Existing approaches train shared item embedding by FL while keeping the user embedding private on client side. However, item embedding identical for all clients cannot capture users' individual differences on perceiving the same item and thus leads to poor personalization. Moreover, dense item embedding in FL results in expensive communication cost and latency. To address these challenges, we propose Federated Recommendation with Additive Personalization (FedRAP), which learns a global view of items via FL and a personalized view locally on each user. FedRAP enforces sparsity of the global view to save FL's communication cost and encourages difference between the two views through regularization. We propose an effective curriculum to learn the local and global views progressively with increasing regularization weights. To produce",
    "path": "papers/23/01/2301.09109.json",
    "total_tokens": 881,
    "translated_title": "带增量个性化的联邦推荐",
    "translated_abstract": "基于联邦学习（FL）构建推荐系统是推动下一代互联网服务和隐私保护的新兴挑战。现有的方法通过FL训练共享项嵌入，同时在客户端保持用户嵌入私密性。然而，相同嵌入对所有客户端的项目不能捕捉到用户对同一项目感知的个体差异，因此导致个性化差。此外，FL中的密集项目嵌入导致通信成本和延迟昂贵。为解决这些挑战，我们提出了带增量个性化的联邦推荐（FedRAP），它通过FL学习项目的全局视图并在每个用户本地学习个性化视图。FedRAP通过正则化增加正则化权重来有效地学习局部和全局视图。我们提出了一种有效的课程表来逐渐学习本地和全局视图，并通过正则化促进两种视图之间的不同之处，使全局视图更稀疏以节省FL的通信成本。",
    "tldr": "FedRAP是一种新的推荐系统生成方法，它使用联邦学习训练共享项嵌入和本地个性化视图，以捕捉用户对推荐项目感知的个体差异并且降低通信成本和延迟。",
    "en_tdlr": "FedRAP is a new recommendation system generation method that uses federated learning to train shared item embeddings and local personalized views, to capture individual differences in users' perceptions of recommended items and reduce communication costs and latency."
}