{
    "title": "VaxxHesitancy: A Dataset for Studying Hesitancy Towards COVID-19 Vaccination on Twitter. (arXiv:2301.06660v3 [cs.CL] UPDATED)",
    "abstract": "Vaccine hesitancy has been a common concern, probably since vaccines were created and, with the popularisation of social media, people started to express their concerns about vaccines online alongside those posting pro- and anti-vaccine content. Predictably, since the first mentions of a COVID-19 vaccine, social media users posted about their fears and concerns or about their support and belief into the effectiveness of these rapidly developing vaccines. Identifying and understanding the reasons behind public hesitancy towards COVID-19 vaccines is important for policy markers that need to develop actions to better inform the population with the aim of increasing vaccine take-up. In the case of COVID-19, where the fast development of the vaccines was mirrored closely by growth in anti-vaxx disinformation, automatic means of detecting citizen attitudes towards vaccination became necessary. This is an important computational social sciences task that requires data analysis in order to gai",
    "link": "http://arxiv.org/abs/2301.06660",
    "context": "Title: VaxxHesitancy: A Dataset for Studying Hesitancy Towards COVID-19 Vaccination on Twitter. (arXiv:2301.06660v3 [cs.CL] UPDATED)\nAbstract: Vaccine hesitancy has been a common concern, probably since vaccines were created and, with the popularisation of social media, people started to express their concerns about vaccines online alongside those posting pro- and anti-vaccine content. Predictably, since the first mentions of a COVID-19 vaccine, social media users posted about their fears and concerns or about their support and belief into the effectiveness of these rapidly developing vaccines. Identifying and understanding the reasons behind public hesitancy towards COVID-19 vaccines is important for policy markers that need to develop actions to better inform the population with the aim of increasing vaccine take-up. In the case of COVID-19, where the fast development of the vaccines was mirrored closely by growth in anti-vaxx disinformation, automatic means of detecting citizen attitudes towards vaccination became necessary. This is an important computational social sciences task that requires data analysis in order to gai",
    "path": "papers/23/01/2301.06660.json",
    "total_tokens": 930,
    "translated_title": "VaxxHesitancy: 一份用于研究推特上对 COVID-19 疫苗犹豫的数据集。",
    "translated_abstract": "疫苗犹豫一直是一个普遍的问题，随着社交媒体的普及，人们开始在网上表达他们对疫苗的担忧，同时也与支持和反对疫苗的人发表内容。自从第一次提到 COVID-19 疫苗以来，社交媒体用户就在发布关于他们的担忧和支持疫苗有效性的内容。了解公众对 COVID-19 疫苗犹豫的原因非常重要，对于需要制定行动以更好地告知人群以增加疫苗接种率的政策制定者来说尤其如此。在 COVID-19 的情况下，疫苗快速开发与反疫苗虚假信息的增长相伴，自动检测公民对疫苗接种的态度成为必需。这是一个重要的计算社会科学任务，需要数据分析才能获得更多洞见。",
    "tldr": "该论文介绍了一份用于研究推特上 COVID-19 疫苗犹豫的数据集，疫苗犹豫一直是一个普遍的问题，了解公众对 COVID-19 疫苗犹豫的原因非常重要。",
    "en_tdlr": "This paper presents a dataset for studying vaccine hesitancy towards COVID-19 on Twitter. Understanding public hesitancy towards COVID-19 vaccines is important, and automatic means of detecting citizen attitudes towards vaccination became necessary due to the fast development of the vaccines and the growth of anti-vaxx disinformation."
}