{
    "title": "A prediction and behavioural analysis of machine learning methods for modelling travel mode choice. (arXiv:2301.04404v2 [cs.LG] UPDATED)",
    "abstract": "The emergence of a variety of Machine Learning (ML) approaches for travel mode choice prediction poses an interesting question to transport modellers: which models should be used for which applications? The answer to this question goes beyond simple predictive performance, and is instead a balance of many factors, including behavioural interpretability and explainability, computational complexity, and data efficiency. There is a growing body of research which attempts to compare the predictive performance of different ML classifiers with classical random utility models. However, existing studies typically analyse only the disaggregate predictive performance, ignoring other aspects affecting model choice. Furthermore, many studies are affected by technical limitations, such as the use of inappropriate validation schemes, incorrect sampling for hierarchical data, lack of external validation, and the exclusive use of discrete metrics. We address these limitations by conducting a systemati",
    "link": "http://arxiv.org/abs/2301.04404",
    "context": "Title: A prediction and behavioural analysis of machine learning methods for modelling travel mode choice. (arXiv:2301.04404v2 [cs.LG] UPDATED)\nAbstract: The emergence of a variety of Machine Learning (ML) approaches for travel mode choice prediction poses an interesting question to transport modellers: which models should be used for which applications? The answer to this question goes beyond simple predictive performance, and is instead a balance of many factors, including behavioural interpretability and explainability, computational complexity, and data efficiency. There is a growing body of research which attempts to compare the predictive performance of different ML classifiers with classical random utility models. However, existing studies typically analyse only the disaggregate predictive performance, ignoring other aspects affecting model choice. Furthermore, many studies are affected by technical limitations, such as the use of inappropriate validation schemes, incorrect sampling for hierarchical data, lack of external validation, and the exclusive use of discrete metrics. We address these limitations by conducting a systemati",
    "path": "papers/23/01/2301.04404.json",
    "total_tokens": 904,
    "translated_title": "对出行方式选择建模的机器学习方法进行预测和行为分析",
    "translated_abstract": "为了出行方式选择问题，各种机器学习方法的出现提出了一个有趣的问题：哪些模型适用于哪些应用？这个问题的答案不仅仅在于简单的预测性能，还涉及行为可解释性和解释性、计算复杂度和数据效率等多方面的平衡。许多研究试图比较不同机器学习分类器与传统随机效用模型的预测性能。然而，现有研究通常只分析离散预测性能，忽略其他影响模型选择的方面。此外，许多研究受技术限制的影响，例如使用不恰当的验证方案、分层数据的错误抽样、缺乏外部验证以及仅使用离散度量等。为了解决这些限制，我们进行了系统性的行为分析，旨在比较不同机器学习方法的表现和特点，以便确定最适合建模出行选择的模型类型。",
    "tldr": "本研究分析了各种机器学习方法和传统随机效用模型在建模出行方式选择方面的性能和特点，并确定哪些模型最适合于建模，出行行为可解释性和解释性、计算复杂度和数据效率等因素需要进行整体考虑。",
    "en_tdlr": "This study analyzes the performance and characteristics of various machine learning methods and traditional random utility models for modeling travel mode choice, and determines which models are best suited for modeling. Factors to be considered include interpretability, computational complexity, and data efficiency in addition to predictive performance."
}