{
    "title": "Inference for Two-stage Experiments under Covariate-Adaptive Randomization. (arXiv:2301.09016v2 [econ.EM] UPDATED)",
    "abstract": "This paper studies inference in two-stage randomized experiments under covariate-adaptive randomization. Here, by a two-stage randomized experiment, we mean one in which clusters (e.g., households, schools, or graph partitions) are first randomly assigned to different levels of treated fraction, followed by random assignment of units within each treated cluster to either treatment or control based on the selected treated fraction; by covariate-adaptive randomization, we mean randomization schemes that first stratify according to baseline covariates and then assign treatment status so as to achieve \"balance\" within each stratum. We examine estimation and inference of such designs under two different asymptotic regimes, namely, \"small strata\" (e.g., matched-pair designs) and \"large strata\" (e.g., stratified block randomization). Our analysis of these two regimes enables us to study a broad range of commonly used designs from the empirical literature. We establish conditions under which o",
    "link": "http://arxiv.org/abs/2301.09016",
    "context": "Title: Inference for Two-stage Experiments under Covariate-Adaptive Randomization. (arXiv:2301.09016v2 [econ.EM] UPDATED)\nAbstract: This paper studies inference in two-stage randomized experiments under covariate-adaptive randomization. Here, by a two-stage randomized experiment, we mean one in which clusters (e.g., households, schools, or graph partitions) are first randomly assigned to different levels of treated fraction, followed by random assignment of units within each treated cluster to either treatment or control based on the selected treated fraction; by covariate-adaptive randomization, we mean randomization schemes that first stratify according to baseline covariates and then assign treatment status so as to achieve \"balance\" within each stratum. We examine estimation and inference of such designs under two different asymptotic regimes, namely, \"small strata\" (e.g., matched-pair designs) and \"large strata\" (e.g., stratified block randomization). Our analysis of these two regimes enables us to study a broad range of commonly used designs from the empirical literature. We establish conditions under which o",
    "path": "papers/23/01/2301.09016.json",
    "total_tokens": 877,
    "tldr": "本文研究了自适应分组随机化下的两阶段实验推断问题，通过建立条件，考虑了小分层和大分层等方案。",
    "en_tdlr": "This paper studies the inference problem of two-stage experiments under covariate-adaptive randomization, by establishing conditions and considering various schemes such as small strata and large strata."
}