{
    "title": "Factor Model of Mixtures. (arXiv:2301.13843v2 [stat.ME] UPDATED)",
    "abstract": "This paper proposes a new approach to estimating the distribution of a response variable conditioned on observing some factors. The proposed approach possesses desirable properties of flexibility, interpretability, tractability and extendability. The conditional quantile function is modeled by a mixture (weighted sum) of basis quantile functions, with the weights depending on factors. The calibration problem is formulated as a convex optimization problem. It can be viewed as conducting quantile regressions for all confidence levels simultaneously while avoiding quantile crossing by definition. The calibration problem is equivalent to minimizing the continuous ranked probability score (CRPS). Based on the canonical polyadic (CP) decomposition of tensors, we propose a dimensionality reduction method that reduces the rank of the parameter tensor and propose an alternating algorithm for estimation. Additionally, based on Risk Quadrangle framework, we generalize the approach to conditional ",
    "link": "http://arxiv.org/abs/2301.13843",
    "context": "Title: Factor Model of Mixtures. (arXiv:2301.13843v2 [stat.ME] UPDATED)\nAbstract: This paper proposes a new approach to estimating the distribution of a response variable conditioned on observing some factors. The proposed approach possesses desirable properties of flexibility, interpretability, tractability and extendability. The conditional quantile function is modeled by a mixture (weighted sum) of basis quantile functions, with the weights depending on factors. The calibration problem is formulated as a convex optimization problem. It can be viewed as conducting quantile regressions for all confidence levels simultaneously while avoiding quantile crossing by definition. The calibration problem is equivalent to minimizing the continuous ranked probability score (CRPS). Based on the canonical polyadic (CP) decomposition of tensors, we propose a dimensionality reduction method that reduces the rank of the parameter tensor and propose an alternating algorithm for estimation. Additionally, based on Risk Quadrangle framework, we generalize the approach to conditional ",
    "path": "papers/23/01/2301.13843.json",
    "total_tokens": 862,
    "translated_title": "混合因子模型",
    "translated_abstract": "本论文提出了一种估计响应变量分布的新方法，该方法考虑了观测到的某些因素。该方法具有灵活性、可解释性、易处理性和可扩展性。条件分位函数由一组基分位函数的混合（加权和）建模，其中权重取决于因子。校准问题被制定为一个凸优化问题。它可以被视为同时对所有置信水平进行分位回归而避免分位交叉的定义。校准问题等价于最小化连续排名概率分数（CRPS）。基于张量的规范多项分解（CP），我们提出了一个降维方法来降低参数张量的秩，并提出了一个交替估计算法。此外，基于风险四边形框架，我们将该方法推广到条件混合因子模型。",
    "tldr": "本文提出了一种混合因子模型的方法，通过建模基分位函数的混合来估计响应变量分布，并通过凸优化问题进行校准，同时避免分位交叉。此外，作者还提出了一种降维方法和交替估计算法，并将该方法推广到条件混合因子模型。",
    "en_tdlr": "This paper proposes a method of mixture factor model for estimating the distribution of a response variable conditioned on observing some factors, which is calibrated by a convex optimization problem to avoid quantile crossing. The authors also propose a dimensionality reduction method and an alternating algorithm, and generalize the approach to conditional mixture factor model based on Risk Quadrangle framework."
}