{
    "title": "EPiC-GAN: Equivariant Point Cloud Generation for Particle Jets. (arXiv:2301.08128v3 [hep-ph] UPDATED)",
    "abstract": "With the vast data-collecting capabilities of current and future high-energy collider experiments, there is an increasing demand for computationally efficient simulations. Generative machine learning models enable fast event generation, yet so far these approaches are largely constrained to fixed data structures and rigid detector geometries. In this paper, we introduce EPiC-GAN - equivariant point cloud generative adversarial network - which can produce point clouds of variable multiplicity. This flexible framework is based on deep sets and is well suited for simulating sprays of particles called jets. The generator and discriminator utilize multiple EPiC layers with an interpretable global latent vector. Crucially, the EPiC layers do not rely on pairwise information sharing between particles, which leads to a significant speed-up over graph- and transformer-based approaches with more complex relation diagrams. We demonstrate that EPiC-GAN scales well to large particle multiplicities ",
    "link": "http://arxiv.org/abs/2301.08128",
    "context": "Title: EPiC-GAN: Equivariant Point Cloud Generation for Particle Jets. (arXiv:2301.08128v3 [hep-ph] UPDATED)\nAbstract: With the vast data-collecting capabilities of current and future high-energy collider experiments, there is an increasing demand for computationally efficient simulations. Generative machine learning models enable fast event generation, yet so far these approaches are largely constrained to fixed data structures and rigid detector geometries. In this paper, we introduce EPiC-GAN - equivariant point cloud generative adversarial network - which can produce point clouds of variable multiplicity. This flexible framework is based on deep sets and is well suited for simulating sprays of particles called jets. The generator and discriminator utilize multiple EPiC layers with an interpretable global latent vector. Crucially, the EPiC layers do not rely on pairwise information sharing between particles, which leads to a significant speed-up over graph- and transformer-based approaches with more complex relation diagrams. We demonstrate that EPiC-GAN scales well to large particle multiplicities ",
    "path": "papers/23/01/2301.08128.json",
    "total_tokens": 946,
    "translated_title": "EPiC-GAN: 等变点云生成用于粒子喷注",
    "translated_abstract": "随着当前和未来高能对撞机实验的巨大数据采集能力，对于计算效率高的模拟的需求越来越大。生成式机器学习模型能够实现快速事件生成，但迄今为止这些方法在固定数据结构和严格的探测器几何约束下有限。本文介绍了EPiC-GAN - 等变点云生成对抗网络，可以产生可变多重性的点云。这个灵活的框架基于深度集合，并适用于模拟称为喷注的粒子喷流。生成器和鉴别器利用多个EPiC层和一个可解释的全局潜在向量。至关重要的是，EPiC层不依赖于粒子之间的成对信息共享，这导致与基于图和变换器的方法以及更复杂的关系图表相比的显著加速。我们证明了EPiC-GAN在大粒子多重性的情况下具有良好的扩展性。",
    "tldr": "本文介绍了一种名为EPiC-GAN的等变点云生成对抗网络，可以灵活地生成不同多重性的点云，该网络基于深度集合，并能够快速模拟粒子喷流。与其他方法相比，EPiC-GAN具有更高的计算效率和良好的扩展性。",
    "en_tdlr": "This paper introduces EPiC-GAN, an equivariant point cloud generative adversarial network, which is capable of generating point clouds with variable multiplicities. The network utilizes deep sets and is well suited for simulating particle jets. EPiC-GAN offers higher computational efficiency and good scalability compared to other approaches."
}