{
    "title": "Cost-optimal Seeding Strategy During a Botanical Pandemic in Domesticated Fields. (arXiv:2301.02817v3 [cs.IR] UPDATED)",
    "abstract": "Context: Botanical pandemics cause enormous economic damage and food shortage around the globe. However, since botanical pandemics are here to stay in the short-medium term, domesticated field owners can strategically seed their fields to optimize each session's economic profit. Objective: Given the pathogen's epidemiological properties, we aim to find an economically optimal grid-based seeding strategy for field owners and policymakers. Methods: We propose a novel epidemiological-economic mathematical model that describes the economic profit from a field of plants during a botanical pandemic. We describe the epidemiological dynamics using a spatio-temporal extended Susceptible-Infected-Recovered epidemiological model with a non-linear output epidemiological model. Results and Conclusions: We provide an algorithm to obtain an optimal grid-formed seeding strategy to maximize economic profit, given field and pathogen properties. In addition, we implement the proposed model in realistic s",
    "link": "http://arxiv.org/abs/2301.02817",
    "context": "Title: Cost-optimal Seeding Strategy During a Botanical Pandemic in Domesticated Fields. (arXiv:2301.02817v3 [cs.IR] UPDATED)\nAbstract: Context: Botanical pandemics cause enormous economic damage and food shortage around the globe. However, since botanical pandemics are here to stay in the short-medium term, domesticated field owners can strategically seed their fields to optimize each session's economic profit. Objective: Given the pathogen's epidemiological properties, we aim to find an economically optimal grid-based seeding strategy for field owners and policymakers. Methods: We propose a novel epidemiological-economic mathematical model that describes the economic profit from a field of plants during a botanical pandemic. We describe the epidemiological dynamics using a spatio-temporal extended Susceptible-Infected-Recovered epidemiological model with a non-linear output epidemiological model. Results and Conclusions: We provide an algorithm to obtain an optimal grid-formed seeding strategy to maximize economic profit, given field and pathogen properties. In addition, we implement the proposed model in realistic s",
    "path": "papers/23/01/2301.02817.json",
    "total_tokens": 958,
    "translated_title": "植物流行病在农田中的成本最优播种策略",
    "translated_abstract": "背景：植物流行病在全球范围内造成了巨大的经济损失和粮食短缺。然而，由于植物流行病在短中期内将继续存在，农田主人可以根据策略性地在自己的农田中播种，以优化每一次作物生产的经济利润。目标：鉴于病原体的流行病学特性，我们旨在为农田主人和决策者寻找一种基于网格的经济最优播种策略。方法：我们提出了一种新颖的流行病学-经济数学模型，描述了在植物流行病期间农田作物的经济利润。我们使用时空扩展的易感-感染-康复流行病学模型以及非线性输出流行病学模型来描述流行病学动态。结果和结论：我们提供了一种算法，用于根据农田和病原体的特性获取最优的网格形成的播种策略，以最大化经济利润。此外，我们还在现实情况下实施了提出的模型。",
    "tldr": "这项研究提出了一种基于网格的经济最优播种策略，通过数学模型描述了在植物流行病期间农田作物的经济利润，可为农田主人和决策者提供指导。",
    "en_tdlr": "This study proposes a grid-based economically optimal seeding strategy and uses a mathematical model to describe the economic profit from field crops during a botanical pandemic, providing guidance for field owners and policymakers."
}