{
    "title": "Generalized Neural Closure Models with Interpretability. (arXiv:2301.06198v2 [cs.LG] UPDATED)",
    "abstract": "Improving the predictive capability and computational cost of dynamical models is often at the heart of augmenting computational physics with machine learning (ML). However, most learning results are limited in interpretability and generalization over different computational grid resolutions, initial and boundary conditions, domain geometries, and physical or problem-specific parameters. In the present study, we simultaneously address all these challenges by developing the novel and versatile methodology of unified neural partial delay differential equations. We augment existing/low-fidelity dynamical models directly in their partial differential equation (PDE) forms with both Markovian and non-Markovian neural network (NN) closure parameterizations. The melding of the existing models with NNs in the continuous spatiotemporal space followed by numerical discretization automatically allows for the desired generalizability. The Markovian term is designed to enable extraction of its analy",
    "link": "http://arxiv.org/abs/2301.06198",
    "context": "Title: Generalized Neural Closure Models with Interpretability. (arXiv:2301.06198v2 [cs.LG] UPDATED)\nAbstract: Improving the predictive capability and computational cost of dynamical models is often at the heart of augmenting computational physics with machine learning (ML). However, most learning results are limited in interpretability and generalization over different computational grid resolutions, initial and boundary conditions, domain geometries, and physical or problem-specific parameters. In the present study, we simultaneously address all these challenges by developing the novel and versatile methodology of unified neural partial delay differential equations. We augment existing/low-fidelity dynamical models directly in their partial differential equation (PDE) forms with both Markovian and non-Markovian neural network (NN) closure parameterizations. The melding of the existing models with NNs in the continuous spatiotemporal space followed by numerical discretization automatically allows for the desired generalizability. The Markovian term is designed to enable extraction of its analy",
    "path": "papers/23/01/2301.06198.json",
    "total_tokens": 795,
    "translated_title": "具有可解释性的广义神经封闭模型",
    "translated_abstract": "提高动力学模型的预测能力和计算成本通常是通过机器学习改进计算物理学的核心问题。然而，大多数学习结果在解释性和适用于不同的计算网格分辨率、初始和边界条件、领域几何和物理或问题特定参数方面存在局限性。在本研究中，我们通过开发统一的神经偏微分方程方法同时解决了所有这些挑战。我们直接在现有/低保真动力学模型的偏微分方程形式中加入了Markovian和非Markovian神经网络封闭参数化，从而实现了模型的拓展。Markovian项的设计旨在实现其分析能力。",
    "tldr": "本论文提出了一种新的方法，使用统一的神经偏微分方程来提高动力学模型的预测能力和计算成本，并解决了解释性和适用性方面的局限性。",
    "en_tdlr": "This paper proposes a new method of using unified neural partial delay differential equations to improve the predictive capability and computational cost of dynamical models, while addressing the limitations of interpretability and generalization over different computational grid resolutions, initial and boundary conditions, domain geometries, and physical or problem-specific parameters."
}