{
    "title": "Solo: Data Discovery Using Natural Language Questions Via A Self-Supervised Approach. (arXiv:2301.03560v2 [cs.IR] UPDATED)",
    "abstract": "Most deployed data discovery systems, such as Google Datasets, and open data portals only support keyword search. Keyword search is geared towards general audiences but limits the types of queries the systems can answer. We propose a new system that lets users write natural language questions directly. A major barrier to using this learned data discovery system is it needs expensive-to-collect training data, thus limiting its utility. In this paper, we introduce a self-supervised approach to assemble training datasets and train learned discovery systems without human intervention. It requires addressing several challenges, including the design of self-supervised strategies for data discovery, table representation strategies to feed to the models, and relevance models that work well with the synthetically generated questions. We combine all the above contributions into a system, Solo, that solves the problem end to end. The evaluation results demonstrate the new techniques outperform st",
    "link": "http://arxiv.org/abs/2301.03560",
    "context": "Title: Solo: Data Discovery Using Natural Language Questions Via A Self-Supervised Approach. (arXiv:2301.03560v2 [cs.IR] UPDATED)\nAbstract: Most deployed data discovery systems, such as Google Datasets, and open data portals only support keyword search. Keyword search is geared towards general audiences but limits the types of queries the systems can answer. We propose a new system that lets users write natural language questions directly. A major barrier to using this learned data discovery system is it needs expensive-to-collect training data, thus limiting its utility. In this paper, we introduce a self-supervised approach to assemble training datasets and train learned discovery systems without human intervention. It requires addressing several challenges, including the design of self-supervised strategies for data discovery, table representation strategies to feed to the models, and relevance models that work well with the synthetically generated questions. We combine all the above contributions into a system, Solo, that solves the problem end to end. The evaluation results demonstrate the new techniques outperform st",
    "path": "papers/23/01/2301.03560.json",
    "total_tokens": 865,
    "translated_title": "Solo: 使用自监督方法通过自然语言问题进行数据发现",
    "translated_abstract": "大多数已部署的数据发现系统，例如Google Datasets和开放数据门户，只支持关键词搜索。关键词搜索适用于普通用户，但限制了系统能够回答的查询类型。我们提出了一个新的系统，允许用户直接编写自然语言问题。使用这个学习的数据发现系统的一个主要障碍是需要昂贵的训练数据，从而限制了其实用性。在本文中，我们介绍了一种自监督方法来组装训练数据集并训练无需人为干预的学习发现系统。它需要解决几个挑战，包括自我监督策略的设计以进行数据发现、用于输入模型的表格表示策略和能与合成生成的问题很好工作的相关性模型。我们将所有上述贡献结合起来构建一个名为Solo的系统，以解决该问题。评估结果表明，新技术表现优于现有方法。",
    "tldr": "提出了一个使用自然语言问题进行数据发现的系统，使用自监督方法来训练系统，克服了昂贵的训练数据的限制，实现了根据自然语言问题进行数据发现的端到端解决方案。",
    "en_tdlr": "A system called Solo is proposed for data discovery using natural language questions. It uses a self-supervised approach to overcome the limitations of expensive training data and provides an end-to-end solution for data discovery based on natural language questions."
}