{
    "title": "Super-Resolution Analysis via Machine Learning: A Survey for Fluid Flows. (arXiv:2301.10937v2 [physics.flu-dyn] UPDATED)",
    "abstract": "This paper surveys machine-learning-based super-resolution reconstruction for vortical flows. Super resolution aims to find the high-resolution flow fields from low-resolution data and is generally an approach used in image reconstruction. In addition to surveying a variety of recent super-resolution applications, we provide case studies of super-resolution analysis for an example of two-dimensional decaying isotropic turbulence. We demonstrate that physics-inspired model designs enable successful reconstruction of vortical flows from spatially limited measurements. We also discuss the challenges and outlooks of machine-learning-based super-resolution analysis for fluid flow applications. The insights gained from this study can be leveraged for super-resolution analysis of numerical and experimental flow data.",
    "link": "http://arxiv.org/abs/2301.10937",
    "context": "Title: Super-Resolution Analysis via Machine Learning: A Survey for Fluid Flows. (arXiv:2301.10937v2 [physics.flu-dyn] UPDATED)\nAbstract: This paper surveys machine-learning-based super-resolution reconstruction for vortical flows. Super resolution aims to find the high-resolution flow fields from low-resolution data and is generally an approach used in image reconstruction. In addition to surveying a variety of recent super-resolution applications, we provide case studies of super-resolution analysis for an example of two-dimensional decaying isotropic turbulence. We demonstrate that physics-inspired model designs enable successful reconstruction of vortical flows from spatially limited measurements. We also discuss the challenges and outlooks of machine-learning-based super-resolution analysis for fluid flow applications. The insights gained from this study can be leveraged for super-resolution analysis of numerical and experimental flow data.",
    "path": "papers/23/01/2301.10937.json",
    "total_tokens": 794,
    "translated_title": "基于机器学习的超分辨率分析：流体流动研究综述",
    "translated_abstract": "本文概述了基于机器学习的超分辨率重构用于涡流流动的研究。超分辨率旨在从低分辨率数据中获取高分辨率的流场，通常用于图像重构。除了调研各种最新的超分辨应用外，我们还提供了两维衰减同性湍流的超分辨率分析案例研究。我们展示了基于物理启发的模型设计使得从空间受限测量中成功地重建了涡流流场。我们还讨论了基于机器学习的超分辨率分析在流体流动应用中的挑战和展望。本研究得出的见解可用于处理数值和实验流动数据的超分辨率分析。",
    "tldr": "本文调研了基于机器学习的超分辨率分析在涡流流动中的应用研究，并提供了物理启发的模型设计来成功重建流场。该研究可用于处理数值和实验流动数据的超分辨率分析。",
    "en_tdlr": "This paper surveys the application of machine-learning-based super-resolution reconstruction for vortical flows and provides physics-inspired model designs for successful reconstruction. It can be leveraged for super-resolution analysis of numerical and experimental flow data."
}