{
    "title": "Conditional Diffusion Based on Discrete Graph Structures for Molecular Graph Generation. (arXiv:2301.00427v2 [cs.LG] UPDATED)",
    "abstract": "Learning the underlying distribution of molecular graphs and generating high-fidelity samples is a fundamental research problem in drug discovery and material science. However, accurately modeling distribution and rapidly generating novel molecular graphs remain crucial and challenging goals. To accomplish these goals, we propose a novel Conditional Diffusion model based on discrete Graph Structures (CDGS) for molecular graph generation. Specifically, we construct a forward graph diffusion process on both graph structures and inherent features through stochastic differential equations (SDE) and derive discrete graph structures as the condition for reverse generative processes. We present a specialized hybrid graph noise prediction model that extracts the global context and the local node-edge dependency from intermediate graph states. We further utilize ordinary differential equation (ODE) solvers for efficient graph sampling, based on the semi-linear structure of the probability flow ",
    "link": "http://arxiv.org/abs/2301.00427",
    "context": "Title: Conditional Diffusion Based on Discrete Graph Structures for Molecular Graph Generation. (arXiv:2301.00427v2 [cs.LG] UPDATED)\nAbstract: Learning the underlying distribution of molecular graphs and generating high-fidelity samples is a fundamental research problem in drug discovery and material science. However, accurately modeling distribution and rapidly generating novel molecular graphs remain crucial and challenging goals. To accomplish these goals, we propose a novel Conditional Diffusion model based on discrete Graph Structures (CDGS) for molecular graph generation. Specifically, we construct a forward graph diffusion process on both graph structures and inherent features through stochastic differential equations (SDE) and derive discrete graph structures as the condition for reverse generative processes. We present a specialized hybrid graph noise prediction model that extracts the global context and the local node-edge dependency from intermediate graph states. We further utilize ordinary differential equation (ODE) solvers for efficient graph sampling, based on the semi-linear structure of the probability flow ",
    "path": "papers/23/01/2301.00427.json",
    "total_tokens": 824,
    "translated_title": "基于离散图结构的分子图生成的条件扩散",
    "translated_abstract": "学习分子图的潜在分布并生成高保真样本是药物发现和材料科学中的基本研究问题。为了实现这些目标，我们提出了一种基于离散图结构的条件扩散模型（CDGS）来生成分子图。具体来说，我们通过随机微分方程（SDE）在图结构和固有特征上构建正向图扩散过程，并导出离散图结构作为反向生成过程的条件。我们提出了一种专门的混合图噪声预测模型，从中间图状态中提取全局上下文和局部节点-边依赖关系。我们进一步利用常微分方程（ODE）求解器实现高效的图采样，基于流量的半线性结构。",
    "tldr": "本文提出了一种基于离散图结构的条件扩散模型（CDGS）来生成分子图，通过SDE构建正向图扩散过程和ODE求解器实现高效的图采样。",
    "en_tdlr": "This paper proposes a novel Conditional Diffusion model based on discrete Graph Structures (CDGS) for molecular graph generation. The model constructs a forward graph diffusion process on both graph structures and inherent features through stochastic differential equations (SDE) and derives discrete graph structures as the condition for reverse generative processes. Efficient graph sampling is achieved by utilizing ordinary differential equation (ODE) solvers."
}