{
    "title": "Functional Neural Networks: Shift invariant models for functional data with applications to EEG classification. (arXiv:2301.05869v2 [cs.LG] UPDATED)",
    "abstract": "It is desirable for statistical models to detect signals of interest independently of their position. If the data is generated by some smooth process, this additional structure should be taken into account. We introduce a new class of neural networks that are shift invariant and preserve smoothness of the data: functional neural networks (FNNs). For this, we use methods from functional data analysis (FDA) to extend multi-layer perceptrons and convolutional neural networks to functional data. We propose different model architectures, show that the models outperform a benchmark model from FDA in terms of accuracy and successfully use FNNs to classify electroencephalography (EEG) data.",
    "link": "http://arxiv.org/abs/2301.05869",
    "context": "Title: Functional Neural Networks: Shift invariant models for functional data with applications to EEG classification. (arXiv:2301.05869v2 [cs.LG] UPDATED)\nAbstract: It is desirable for statistical models to detect signals of interest independently of their position. If the data is generated by some smooth process, this additional structure should be taken into account. We introduce a new class of neural networks that are shift invariant and preserve smoothness of the data: functional neural networks (FNNs). For this, we use methods from functional data analysis (FDA) to extend multi-layer perceptrons and convolutional neural networks to functional data. We propose different model architectures, show that the models outperform a benchmark model from FDA in terms of accuracy and successfully use FNNs to classify electroencephalography (EEG) data.",
    "path": "papers/23/01/2301.05869.json",
    "total_tokens": 765,
    "translated_title": "功能性神经网络：用于功能数据的位移不变模型及其在脑电图分类中的应用",
    "translated_abstract": "对于统计模型来说，独立于位置地检测感兴趣的信号是很理想的。如果数据由某个平滑过程生成，那么这种附加结构应该被考虑进去。我们引入了一种新的神经网络类别，它们具有位移不变性并保持数据的平滑性：功能性神经网络（FNNs）。为此，我们使用功能数据分析（FDA）的方法来扩展多层感知器和卷积神经网络以适应功能数据。我们提出了不同的模型架构，证明这些模型在准确性上优于FDA的基准模型，并成功地使用FNNs对脑电图数据进行分类。",
    "tldr": "功能性神经网络（FNNs）是一种新的神经网络类别，具有位移不变性和保持数据平滑性的特点。在脑电图分类任务中，FNNs的模型表现优于基准模型并能成功进行分类。",
    "en_tdlr": "Functional neural networks (FNNs) are a new class of neural networks that are shift invariant and preserve the smoothness of the data. FNNs outperform a benchmark model from functional data analysis (FDA) in terms of accuracy and are successfully used for EEG classification."
}