{
    "title": "Compact Optimization Learning for AC Optimal Power Flow. (arXiv:2301.08840v2 [cs.LG] UPDATED)",
    "abstract": "This paper reconsiders end-to-end learning approaches to the Optimal Power Flow (OPF). Existing methods, which learn the input/output mapping of the OPF, suffer from scalability issues due to the high dimensionality of the output space. This paper first shows that the space of optimal solutions can be significantly compressed using principal component analysis (PCA). It then proposes Compact Learning, a new method that learns in a subspace of the principal components before translating the vectors into the original output space. This compression reduces the number of trainable parameters substantially, improving scalability and effectiveness. Compact Learning is evaluated on a variety of test cases from the PGLib with up to 30,000 buses. The paper also shows that the output of Compact Learning can be used to warm-start an exact AC solver to restore feasibility, while bringing significant speed-ups.",
    "link": "http://arxiv.org/abs/2301.08840",
    "context": "Title: Compact Optimization Learning for AC Optimal Power Flow. (arXiv:2301.08840v2 [cs.LG] UPDATED)\nAbstract: This paper reconsiders end-to-end learning approaches to the Optimal Power Flow (OPF). Existing methods, which learn the input/output mapping of the OPF, suffer from scalability issues due to the high dimensionality of the output space. This paper first shows that the space of optimal solutions can be significantly compressed using principal component analysis (PCA). It then proposes Compact Learning, a new method that learns in a subspace of the principal components before translating the vectors into the original output space. This compression reduces the number of trainable parameters substantially, improving scalability and effectiveness. Compact Learning is evaluated on a variety of test cases from the PGLib with up to 30,000 buses. The paper also shows that the output of Compact Learning can be used to warm-start an exact AC solver to restore feasibility, while bringing significant speed-ups.",
    "path": "papers/23/01/2301.08840.json",
    "total_tokens": 885,
    "translated_title": "压缩优化学习用于交流电最优潮流计算",
    "translated_abstract": "本文重新考虑了最优潮流计算（OPF）的端到端学习方法。现有的学习输入/输出映射的方法由于输出空间的高维度而存在可扩展性问题。本文首先展示了利用主成分分析（PCA）可以显著压缩最优解的空间。它提出了一种新方法——压缩学习，该方法在主要成分的子空间中进行学习，然后将向量转换为原始输出空间。这种压缩大大降低了可训练参数的数量，提高了可扩展性和有效性。压缩学习在PGLib的各种测试用例中进行了评估，最高可达30,000个总线。本文还表明，压缩学习的输出可以用于热启动精确的AC求解器以恢复可行性，并带来显着的加速。",
    "tldr": "本文提出了一种压缩学习方法，利用主成分分析可以显著降低交流电最优潮流计算的维度，降低了可训练参数的数量，提高了可扩展性和有效性。同时，该方法的输出可以用于热启动精确的AC求解器以恢复可行性。",
    "en_tdlr": "This paper proposes a compact learning method that significantly reduces the dimensionality of AC optimal power flow calculation using principal component analysis (PCA), reducing the number of trainable parameters and improving scalability and effectiveness. Additionally, the output of this method can be used to warm-start accurate AC solvers to restore feasibility."
}