{
    "title": "Can Peanuts Fall in Love with Distributional Semantics?. (arXiv:2301.08731v2 [cs.CL] UPDATED)",
    "abstract": "Context changes expectations about upcoming words - following a story involving an anthropomorphic peanut, comprehenders expect the sentence the peanut was in love more than the peanut was salted, as indexed by N400 amplitude (Nieuwland & van Berkum, 2006). This updating of expectations has been explained using Situation Models - mental representations of a described event. However, recent work showing that N400 amplitude is predictable from distributional information alone raises the question whether situation models are necessary for these contextual effects. We model the results of Nieuwland and van Berkum (2006) using six computational language models and three sets of word vectors, none of which have explicit situation models or semantic grounding. We find that a subset of these can fully model the effect found by Nieuwland and van Berkum (2006). Thus, at least some processing effects normally explained through situation models may not in fact require explicit situation models.",
    "link": "http://arxiv.org/abs/2301.08731",
    "context": "Title: Can Peanuts Fall in Love with Distributional Semantics?. (arXiv:2301.08731v2 [cs.CL] UPDATED)\nAbstract: Context changes expectations about upcoming words - following a story involving an anthropomorphic peanut, comprehenders expect the sentence the peanut was in love more than the peanut was salted, as indexed by N400 amplitude (Nieuwland & van Berkum, 2006). This updating of expectations has been explained using Situation Models - mental representations of a described event. However, recent work showing that N400 amplitude is predictable from distributional information alone raises the question whether situation models are necessary for these contextual effects. We model the results of Nieuwland and van Berkum (2006) using six computational language models and three sets of word vectors, none of which have explicit situation models or semantic grounding. We find that a subset of these can fully model the effect found by Nieuwland and van Berkum (2006). Thus, at least some processing effects normally explained through situation models may not in fact require explicit situation models.",
    "path": "papers/23/01/2301.08731.json",
    "total_tokens": 834,
    "translated_title": "花生能与分布语义有恋爱之情吗？",
    "translated_abstract": "背景对预期词有影响，通过涉及植物人的故事，理解者预期句子“花生恋爱了”，而不是“花生被盐腌了”，如Nieuwland和van Berkum（2006）所示。这种预期的更新是通过情景模型-所描述事件的心理表示来解释的。然而，最近的研究显示，仅通过分布信息就可以预测N400的振幅，这就引发了：这些情境效应是否需要情景模型的问题。我们使用六个计算语言模型和三套单词向量来模拟Nieuwland和van Berkum（2006）的结果，其中没有显式的情景模型或语义基础。我们发现其中的一部分可以完全模拟Nieuwland和van Berkum（2006）所发现的效果。因此，至少有些通过情景模型解释的处理效应实际上不需要显式的情景模型。",
    "tldr": "通过计算语言模型和单词向量模拟，研究发现某些处理效应可不需要情景模型。",
    "en_tdlr": "Some processing effects that are normally explained via a situation model may not in fact require explicit situation models, as shown by simulating the results of Nieuwland and van Berkum's study using computational language models and word vectors."
}