{
    "title": "Network Slicing via Transfer Learning aided Distributed Deep Reinforcement Learning. (arXiv:2301.03262v2 [cs.NI] UPDATED)",
    "abstract": "Deep reinforcement learning (DRL) has been increasingly employed to handle the dynamic and complex resource management in network slicing. The deployment of DRL policies in real networks, however, is complicated by heterogeneous cell conditions. In this paper, we propose a novel transfer learning (TL) aided multi-agent deep reinforcement learning (MADRL) approach with inter-agent similarity analysis for inter-cell inter-slice resource partitioning. First, we design a coordinated MADRL method with information sharing to intelligently partition resource to slices and manage inter-cell interference. Second, we propose an integrated TL method to transfer the learned DRL policies among different local agents for accelerating the policy deployment. The method is composed of a new domain and task similarity measurement approach and a new knowledge transfer approach, which resolves the problem of from whom to transfer and how to transfer. We evaluated the proposed solution with extensive simul",
    "link": "http://arxiv.org/abs/2301.03262",
    "context": "Title: Network Slicing via Transfer Learning aided Distributed Deep Reinforcement Learning. (arXiv:2301.03262v2 [cs.NI] UPDATED)\nAbstract: Deep reinforcement learning (DRL) has been increasingly employed to handle the dynamic and complex resource management in network slicing. The deployment of DRL policies in real networks, however, is complicated by heterogeneous cell conditions. In this paper, we propose a novel transfer learning (TL) aided multi-agent deep reinforcement learning (MADRL) approach with inter-agent similarity analysis for inter-cell inter-slice resource partitioning. First, we design a coordinated MADRL method with information sharing to intelligently partition resource to slices and manage inter-cell interference. Second, we propose an integrated TL method to transfer the learned DRL policies among different local agents for accelerating the policy deployment. The method is composed of a new domain and task similarity measurement approach and a new knowledge transfer approach, which resolves the problem of from whom to transfer and how to transfer. We evaluated the proposed solution with extensive simul",
    "path": "papers/23/01/2301.03262.json",
    "total_tokens": 954,
    "translated_title": "基于迁移学习辅助的分布式深度强化学习实现网络切片",
    "translated_abstract": "深度强化学习(DRL)越来越被用于处理网络切片的动态和复杂的资源管理。然而，在实际网络中部署DRL策略是复杂的，因为细胞条件是异构的。在本文中，我们提出了一种新颖的多智能体深度强化学习(MADRL)方法，通过智能地将资源分配给不同的网络切片，来协调不同的智能体之间的相似性分析来解决跨单元格跨切片的资源分配问题。我们首先设计了一种协调的MADRL方法，通过信息共享来智能地将资源分配给切片，并管理单元间干扰。其次，我们提出了一种集成的TL方法，以在不同的本地智能体之间传输学习到的DRL策略，加速策略部署。该方法包括一种新的领域和任务相似度测量方法和一种新的知识转移方法，解决了何时传输和如何传输的问题。我们使用大量的仿真评估了所提出的解决方案。",
    "tldr": "本文提出了一种新颖的基于迁移学习辅助的多智能体深度强化学习(MADRL)方法，通过信息共享解决跨单元格跨切片的资源分配问题，加速策略部署，并在大量的仿真评估中得到验证。"
}