{
    "title": "Author as Character and Narrator: Deconstructing Personal Narratives from the r/AmITheAsshole Reddit Community. (arXiv:2301.08104v2 [cs.CL] UPDATED)",
    "abstract": "In the r/AmITheAsshole subreddit, people anonymously share first person narratives that contain some moral dilemma or conflict and ask the community to judge who is at fault (i.e., who is \"the asshole\"). In general, first person narratives are a unique storytelling domain where the author is the narrator (the person telling the story) but can also be a character (the person living the story) and, thus, the author has two distinct voices presented in the story. In this study, we identify linguistic and narrative features associated with the author as the character or as a narrator. We use these features to answer the following questions: (1) what makes an asshole character and (2) what makes an asshole narrator? We extract both Author-as-Character features (e.g., demographics, narrative event chain, and emotional arc) and Author-as-Narrator features (i.e., the style and emotion of the story as a whole) in order to identify which aspects of the narrative are correlated with the final mor",
    "link": "http://arxiv.org/abs/2301.08104",
    "context": "Title: Author as Character and Narrator: Deconstructing Personal Narratives from the r/AmITheAsshole Reddit Community. (arXiv:2301.08104v2 [cs.CL] UPDATED)\nAbstract: In the r/AmITheAsshole subreddit, people anonymously share first person narratives that contain some moral dilemma or conflict and ask the community to judge who is at fault (i.e., who is \"the asshole\"). In general, first person narratives are a unique storytelling domain where the author is the narrator (the person telling the story) but can also be a character (the person living the story) and, thus, the author has two distinct voices presented in the story. In this study, we identify linguistic and narrative features associated with the author as the character or as a narrator. We use these features to answer the following questions: (1) what makes an asshole character and (2) what makes an asshole narrator? We extract both Author-as-Character features (e.g., demographics, narrative event chain, and emotional arc) and Author-as-Narrator features (i.e., the style and emotion of the story as a whole) in order to identify which aspects of the narrative are correlated with the final mor",
    "path": "papers/23/01/2301.08104.json",
    "total_tokens": 965,
    "translated_title": "作者即角色又叙述者：从r/AmITheAsshole Reddit社区解构个人叙述",
    "translated_abstract": "在r/AmITheAsshole子论坛中，人们匿名分享包含一些道德困境或冲突的第一人称叙述，并询问社区判断谁是错的（即“混蛋”）。一般来说，第一人称叙述是一个独特的讲故事领域，其中作者既是叙述者（讲述故事的人），又可以是角色（生活故事的人），因此作者在故事中有两种不同的声音。本研究识别了与作者作为角色或叙述者相关的语言和叙事特征。我们使用这些特征回答以下问题：（1）是什么让一个角色成为混蛋，（2）叙述者怎样才算是一个混蛋？我们提取了作者作为角色的特征（例如人口统计信息、叙事事件链和情感弧线）和作者作为叙述者的特征（即整体故事的风格和情感），以确定故事的哪些方面与最终的道德判断相关。",
    "tldr": "研究从r/AmITheAsshole Reddit社区中的个人叙述中鉴别了作者作为角色和叙述者的语言和叙事特征，以回答什么样的人物会成为“混蛋”，以及什么样的叙述方式会被视为“混蛋”。",
    "en_tdlr": "This study identifies linguistic and narrative features associated with authors as characters and narrators in first-person narratives from r/AmITheAsshole subreddit to understand what makes a character or narrator the \"asshole.\""
}