{
    "title": "A$^2$-UAV: Application-Aware Content and Network Optimization of Edge-Assisted UAV Systems. (arXiv:2301.06363v2 [cs.NI] UPDATED)",
    "abstract": "To perform advanced surveillance, Unmanned Aerial Vehicles (UAVs) require the execution of edge-assisted computer vision (CV) tasks. In multi-hop UAV networks, the successful transmission of these tasks to the edge is severely challenged due to severe bandwidth constraints. For this reason, we propose a novel A$^2$-UAV framework to optimize the number of correctly executed tasks at the edge. In stark contrast with existing art, we take an application-aware approach and formulate a novel pplication-Aware Task Planning Problem (A$^2$-TPP) that takes into account (i) the relationship between deep neural network (DNN) accuracy and image compression for the classes of interest based on the available dataset, (ii) the target positions, (iii) the current energy/position of the UAVs to optimize routing, data pre-processing and target assignment for each UAV. We demonstrate A$^2$-TPP is NP-Hard and propose a polynomial-time algorithm to solve it efficiently. We extensively evaluate A$^2$-UAV th",
    "link": "http://arxiv.org/abs/2301.06363",
    "context": "Title: A$^2$-UAV: Application-Aware Content and Network Optimization of Edge-Assisted UAV Systems. (arXiv:2301.06363v2 [cs.NI] UPDATED)\nAbstract: To perform advanced surveillance, Unmanned Aerial Vehicles (UAVs) require the execution of edge-assisted computer vision (CV) tasks. In multi-hop UAV networks, the successful transmission of these tasks to the edge is severely challenged due to severe bandwidth constraints. For this reason, we propose a novel A$^2$-UAV framework to optimize the number of correctly executed tasks at the edge. In stark contrast with existing art, we take an application-aware approach and formulate a novel pplication-Aware Task Planning Problem (A$^2$-TPP) that takes into account (i) the relationship between deep neural network (DNN) accuracy and image compression for the classes of interest based on the available dataset, (ii) the target positions, (iii) the current energy/position of the UAVs to optimize routing, data pre-processing and target assignment for each UAV. We demonstrate A$^2$-TPP is NP-Hard and propose a polynomial-time algorithm to solve it efficiently. We extensively evaluate A$^2$-UAV th",
    "path": "papers/23/01/2301.06363.json",
    "total_tokens": 1009,
    "translated_title": "A$^2$-UAV：边缘辅助无人机系统的应用感知内容和网络优化",
    "translated_abstract": "为了进行高级监视，无人机需要执行边缘辅助计算机视觉任务。在多跳无人机网络中，由于严重的带宽限制，将这些任务成功传输到边缘面临严峻的挑战。因此，我们提出了一种新颖的A$^2$-UAV框架，以优化边缘上正确执行的任务数量。与现有技术形成鲜明对比的是，我们采用应用感知的方法，并制定了一个新的应用感知任务规划问题（A$^2$-TPP），该问题考虑了（i）基于可用数据集的感兴趣类别的深度神经网络（DNN）准确性与图像压缩之间的关系，（ii）目标位置，（iii）无人机的当前能量/位置，以优化每个无人机的路由、数据预处理和目标分配。我们证明了A$^2$-TPP是NP-难问题，并提出了一个多项式时间算法来高效地解决它。我们对A$^2$-UAV进行了广泛评估。",
    "tldr": "A$^2$-UAV是一种边缘辅助无人机系统的优化框架，通过应用感知的方式解决了多跳无人机网络中带宽限制的问题，该框架考虑了深度神经网络准确性与图像压缩之间的关系，以及无人机的能量和位置等因素。",
    "en_tdlr": "A$^2$-UAV is an optimization framework for edge-assisted UAV systems that tackles bandwidth constraints in multi-hop UAV networks through application-awareness. This framework considers the relationship between deep neural network accuracy and image compression, as well as factors such as UAV energy and position."
}