{
    "title": "A Levy-driven Ornstein-Uhlenbeck process for the valuation of credit index swaptions. (arXiv:2301.05332v2 [q-fin.PR] UPDATED)",
    "abstract": "A Levy-driven Ornstein-Uhlenbeck process is proposed to model the evolution of the risk-free rate and default intensities for the purpose of evaluating option contracts on a credit index. Time evolution in credit markets is assumed to follow a gamma process in order to reflect the different pace at which credit products are exchanged with respect to that of risk-free debt. Formulas for the characteristic function, zero coupon bonds, moments of the process and its stationary distribution are derived. Numerical experiments showing convergence of standard numerical methods for the valuation PIDE to analytical and Montecarlo solutions are shown. Calibration to market prices of options on a credit index is performed, and model and market implied summary statistics for the underlying credit spreads are estimated and compared.",
    "link": "http://arxiv.org/abs/2301.05332",
    "context": "Title: A Levy-driven Ornstein-Uhlenbeck process for the valuation of credit index swaptions. (arXiv:2301.05332v2 [q-fin.PR] UPDATED)\nAbstract: A Levy-driven Ornstein-Uhlenbeck process is proposed to model the evolution of the risk-free rate and default intensities for the purpose of evaluating option contracts on a credit index. Time evolution in credit markets is assumed to follow a gamma process in order to reflect the different pace at which credit products are exchanged with respect to that of risk-free debt. Formulas for the characteristic function, zero coupon bonds, moments of the process and its stationary distribution are derived. Numerical experiments showing convergence of standard numerical methods for the valuation PIDE to analytical and Montecarlo solutions are shown. Calibration to market prices of options on a credit index is performed, and model and market implied summary statistics for the underlying credit spreads are estimated and compared.",
    "path": "papers/23/01/2301.05332.json",
    "total_tokens": 820,
    "translated_title": "用Levy驱动的Ornstein-Uhlenbeck过程对信用指数掉期权进行估值",
    "translated_abstract": "本文提出了用Levy驱动的Ornstein-Uhlenbeck过程来模拟无风险利率和违约强度的演化，以便评估信用指数上的期权合约。假设信用市场的时间演化遵循伽马过程，以反映与无风险债务相比，信用产品交易的不同速度。推导了特征函数、零息债券、过程的矩以及其稳态分布的公式。展示了对于估值PIDE的标准数值方法收敛于解析和蒙特卡洛解的数值实验。对信用指数上的期权市场价格进行了校准，并估计并比较了模型和市场暗示的底层信用利差的摘要统计数据。",
    "tldr": "本文提出了用Levy驱动的Ornstein-Uhlenbeck过程来模拟信用指数期权的估值，并通过数值实验证明了其收敛性。同时，对底层信用利差的模型和市场暗示的摘要统计数据进行校准和比较。",
    "en_tdlr": "This paper proposes a Levy-driven Ornstein-Uhlenbeck process for the valuation of credit index swaptions, and shows its convergence through numerical experiments. Additionally, it calibrates and compares model and market implied summary statistics for the underlying credit spreads."
}