{
    "title": "Optimization of body configuration and joint-driven attitude stabilization for transformable spacecrafts under solar radiation pressure. (arXiv:2301.08435v2 [cs.LG] UPDATED)",
    "abstract": "A solar sail is one of the most promising space exploration system because of its theoretically infinite specific impulse using solar radiation pressure (SRP). Recently, some researchers proposed \"transformable spacecrafts\" that can actively reconfigure their body configurations with actuatable joints. The transformable spacecrafts are expected to greatly enhance orbit and attitude control capability due to its high redundancy in control degree of freedom if they are used like solar sails. However, its large number of input poses difficulties in control, and therefore, previous researchers imposed strong constraints to limit its potential control capabilities. This paper addresses novel attitude control techniques for the transformable spacecrafts under SRP. The authors have constructed two proposed methods; one of those is a joint angle optimization to acquire arbitrary SRP force and torque, and the other is a momentum damping control driven by joint angle actuation. Our proposed meth",
    "link": "http://arxiv.org/abs/2301.08435",
    "context": "Title: Optimization of body configuration and joint-driven attitude stabilization for transformable spacecrafts under solar radiation pressure. (arXiv:2301.08435v2 [cs.LG] UPDATED)\nAbstract: A solar sail is one of the most promising space exploration system because of its theoretically infinite specific impulse using solar radiation pressure (SRP). Recently, some researchers proposed \"transformable spacecrafts\" that can actively reconfigure their body configurations with actuatable joints. The transformable spacecrafts are expected to greatly enhance orbit and attitude control capability due to its high redundancy in control degree of freedom if they are used like solar sails. However, its large number of input poses difficulties in control, and therefore, previous researchers imposed strong constraints to limit its potential control capabilities. This paper addresses novel attitude control techniques for the transformable spacecrafts under SRP. The authors have constructed two proposed methods; one of those is a joint angle optimization to acquire arbitrary SRP force and torque, and the other is a momentum damping control driven by joint angle actuation. Our proposed meth",
    "path": "papers/23/01/2301.08435.json",
    "total_tokens": 1035,
    "translated_title": "受太阳辐射力影响的变形航天器体态优化及其关节驱动姿态稳定",
    "translated_abstract": "太阳帆是最有前途的太空探索系统之一，因其可以利用太阳辐射压力（SRP）理论上具有无限的比冲。近年来，一些研究人员提出了“可变形航天器”，可以通过驱动关节主动重新配置其机身。如果像太阳帆一样利用变形航天器，其控制自由度高的冗余度将极大增强轨道和姿态控制能力。但是，其大量的输入姿态使控制困难。因此，以前的研究人员施加了强制性的限制以限制其潜在的控制能力。本文针对太阳辐射下变形航天器的姿态控制技术进行了研究。作者提出了两种方法：一种是关节角度优化方法以获得任意的SRP力和力矩；另一种方法是通过关节驱动的动量阻尼控制。我们提出的方法可使变形航天器比以前的方法在轨道和姿态控制方面获得更好的性能。仿真结果说明了在三种不同的变形航天器中，所提出的方法的有效性。",
    "tldr": "本文针对太阳辐射下变形航天器的姿态控制技术进行了研究，提出了关节角度优化方法和通过关节驱动的动量阻尼控制，使变形航天器比以前的方法在轨道和姿态控制方面获得更好的性能。",
    "en_tdlr": "This paper proposes attitude control techniques for transformable spacecrafts under solar radiation pressure, including joint angle optimization and momentum damping control driven by joint angle actuation, which enable better performance in orbit and attitude control than previous methods."
}