{
    "title": "Expectile hidden Markov regression models for analyzing cryptocurrency returns. (arXiv:2301.09722v2 [stat.AP] UPDATED)",
    "abstract": "In this paper we develop a linear expectile hidden Markov model for the analysis of cryptocurrency time series in a risk management framework. The methodology proposed allows to focus on extreme returns and describe their temporal evolution by introducing in the model time-dependent coefficients evolving according to a latent discrete homogeneous Markov chain. As it is often used in the expectile literature, estimation of the model parameters is based on the asymmetric normal distribution. Maximum likelihood estimates are obtained via an Expectation-Maximization algorithm using efficient M-step update formulas for all parameters. We evaluate the introduced method with both artificial data under several experimental settings and real data investigating the relationship between daily Bitcoin returns and major world market indices.",
    "link": "http://arxiv.org/abs/2301.09722",
    "context": "Title: Expectile hidden Markov regression models for analyzing cryptocurrency returns. (arXiv:2301.09722v2 [stat.AP] UPDATED)\nAbstract: In this paper we develop a linear expectile hidden Markov model for the analysis of cryptocurrency time series in a risk management framework. The methodology proposed allows to focus on extreme returns and describe their temporal evolution by introducing in the model time-dependent coefficients evolving according to a latent discrete homogeneous Markov chain. As it is often used in the expectile literature, estimation of the model parameters is based on the asymmetric normal distribution. Maximum likelihood estimates are obtained via an Expectation-Maximization algorithm using efficient M-step update formulas for all parameters. We evaluate the introduced method with both artificial data under several experimental settings and real data investigating the relationship between daily Bitcoin returns and major world market indices.",
    "path": "papers/23/01/2301.09722.json",
    "total_tokens": 829,
    "translated_title": "用于分析加密货币收益的期望隐马尔可夫回归模型",
    "translated_abstract": "本文提出了一种线性期望隐马尔可夫模型，用于在风险管理框架中分析加密货币时间序列。所提出的方法允许专注于极端收益，并通过引入模型中随时间变化的系数来描述它们的时间演变，这些系数根据潜变的离散齐次马尔可夫链演化。与期望分位数文献中经常使用的方法类似，模型参数的估计基于非对称正态分布。通过使用高效的M步更新公式对所有参数进行期望最大化算法获得最大似然估计。我们通过人工数据和实际数据评估了该方法，研究了每日比特币收益与主要世界市场指数之间的关系。",
    "tldr": "本文提出了一种用于分析加密货币收益的期望隐马尔可夫回归模型，该方法允许专注于极端收益，并通过引入时间演变的系数来描述其演变，通过对比每日比特币收益和主要世界市场指数之间的关系验证了该方法。",
    "en_tdlr": "This paper proposes an expectile hidden Markov regression model for analyzing cryptocurrency returns, which focuses on extreme returns and describes their temporal evolution by introducing time-dependent coefficients. The method is evaluated using both artificial and real data, investigating the relationship between daily Bitcoin returns and major world market indices."
}