{
    "title": "On Consistency and Asymptotic Normality of Least Absolute Deviation Estimators for 2-dimensional Sinusoidal Model. (arXiv:2301.03229v2 [math.ST] UPDATED)",
    "abstract": "Estimation of the parameters of a 2-dimensional sinusoidal model is a fundamental problem in digital signal processing and time series analysis. In this paper, we propose a robust least absolute deviation (LAD) estimators for parameter estimation. The proposed methodology provides a robust alternative to non-robust estimation techniques like the least squares estimators, in situations where outliers are present in the data or in the presence of heavy tailed noise. We study important asymptotic properties of the LAD estimators and establish the strong consistency and asymptotic normality of the LAD estimators of the signal parameters of a 2-dimensional sinusoidal model. We further illustrate the advantage of using LAD estimators over least squares estimators through extensive simulation studies. Data analysis of a 2-dimensional texture data indicates practical applicability of the proposed LAD approach.",
    "link": "http://arxiv.org/abs/2301.03229",
    "context": "Title: On Consistency and Asymptotic Normality of Least Absolute Deviation Estimators for 2-dimensional Sinusoidal Model. (arXiv:2301.03229v2 [math.ST] UPDATED)\nAbstract: Estimation of the parameters of a 2-dimensional sinusoidal model is a fundamental problem in digital signal processing and time series analysis. In this paper, we propose a robust least absolute deviation (LAD) estimators for parameter estimation. The proposed methodology provides a robust alternative to non-robust estimation techniques like the least squares estimators, in situations where outliers are present in the data or in the presence of heavy tailed noise. We study important asymptotic properties of the LAD estimators and establish the strong consistency and asymptotic normality of the LAD estimators of the signal parameters of a 2-dimensional sinusoidal model. We further illustrate the advantage of using LAD estimators over least squares estimators through extensive simulation studies. Data analysis of a 2-dimensional texture data indicates practical applicability of the proposed LAD approach.",
    "path": "papers/23/01/2301.03229.json",
    "total_tokens": 915,
    "translated_title": "关于两维正弦模型最小绝对偏差估计的一致性和渐近正态性",
    "translated_abstract": "在数字信号处理和时间序列分析中，2维正弦模型参数估计是一个基本问题。本文提出了一种鲁棒的最小绝对偏差 (LAD) 估计器，用于参数估计。该方法提供了一种抗干扰的替代方法，可以应对数据中存在异常值或重尾噪声等非鲁棒估计技术无法处理的情况。我们研究了LAD估计器的重要渐近性质，并证明了2维正弦模型信号参数的LAD估计器具有强一致性和渐近正态性。通过大量的模拟研究，我们进一步说明了使用LAD估计器优于最小二乘估计器的优势。对2维纹理数据的数据分析表明了所提出的LAD方法的实际应用性。",
    "tldr": "本文提出了一种鲁棒的最小绝对偏差估计器，用于2维正弦模型参数估计，在数据存在异常值或重尾噪声时具有优越性并得到强一致性和渐近正态性的保证。",
    "en_tdlr": "This paper proposes a robust Least Absolute Deviation (LAD) estimator for parameter estimation of a 2-dimensional sinusoidal model, which provides a robust alternative to non-robust techniques and has advantages in the presence of outliers or heavy-tailed noise. Theoretical results show strong consistency and asymptotic normality of the LAD estimator, and simulation studies illustrate its superiority over least squares estimators. Practical applicability is demonstrated through analysis of 2-dimensional texture data."
}