{
    "title": "Inference on quantile processes with a finite number of clusters. (arXiv:2301.04687v2 [econ.EM] UPDATED)",
    "abstract": "I introduce a generic method for inference on entire quantile and regression quantile processes in the presence of a finite number of large and arbitrarily heterogeneous clusters. The method asymptotically controls size by generating statistics that exhibit enough distributional symmetry such that randomization tests can be applied. The randomization test does not require ex-ante matching of clusters, is free of user-chosen parameters, and performs well at conventional significance levels with as few as five clusters. The method tests standard (non-sharp) hypotheses and can even be asymptotically similar in empirically relevant situations. The main focus of the paper is inference on quantile treatment effects but the method applies more broadly. Numerical and empirical examples are provided.",
    "link": "http://arxiv.org/abs/2301.04687",
    "context": "Title: Inference on quantile processes with a finite number of clusters. (arXiv:2301.04687v2 [econ.EM] UPDATED)\nAbstract: I introduce a generic method for inference on entire quantile and regression quantile processes in the presence of a finite number of large and arbitrarily heterogeneous clusters. The method asymptotically controls size by generating statistics that exhibit enough distributional symmetry such that randomization tests can be applied. The randomization test does not require ex-ante matching of clusters, is free of user-chosen parameters, and performs well at conventional significance levels with as few as five clusters. The method tests standard (non-sharp) hypotheses and can even be asymptotically similar in empirically relevant situations. The main focus of the paper is inference on quantile treatment effects but the method applies more broadly. Numerical and empirical examples are provided.",
    "path": "papers/23/01/2301.04687.json",
    "total_tokens": 806,
    "translated_title": "在有限数量的聚类中对分位数过程进行推断",
    "translated_abstract": "我介绍了一种通用方法，用于在存在有限数量的大型且任意异构的聚类的情况下对整个分位数和回归分位数过程进行推断。该方法通过生成具有足够分布对称性的统计量来渐近控制大小，从而可以应用随机化测试。随机化测试不需要聚类的先前匹配，没有用户选择的参数，并且在仅有五个聚类的情况下在传统的显著性水平上表现良好。该方法测试标准（非尖锐）假设，甚至可以在实证上相关的情况下渐近类似。本文的重点是对分位数处理效应的推断，但该方法适用于更广泛的情况。提供了数值和实证例子。",
    "tldr": "该论文介绍了一种在有限数量和异质性聚类的情况下推断整个分位数和回归分位数过程的通用方法，该方法可以通过随机化测试实现，而不需要先前匹配聚类或用户选择的参数。",
    "en_tdlr": "This paper presents a generic method for inference on entire quantile and regression quantile processes with a finite number of large and arbitrarily heterogeneous clusters, using randomization tests without pre-matching or user-chosen parameters. The method focuses on quantile treatment effects but applies more broadly, and performs well even with as few as five clusters."
}