{
    "title": "Case-Based Reasoning with Language Models for Classification of Logical Fallacies. (arXiv:2301.11879v2 [cs.AI] UPDATED)",
    "abstract": "The ease and speed of spreading misinformation and propaganda on the Web motivate the need to develop trustworthy technology for detecting fallacies in natural language arguments. However, state-of-the-art language modeling methods exhibit a lack of robustness on tasks like logical fallacy classification that require complex reasoning. In this paper, we propose a Case-Based Reasoning method that classifies new cases of logical fallacy by language-modeling-driven retrieval and adaptation of historical cases. We design four complementary strategies to enrich input representation for our model, based on external information about goals, explanations, counterarguments, and argument structure. Our experiments in in-domain and out-of-domain settings indicate that Case-Based Reasoning improves the accuracy and generalizability of language models. Our ablation studies suggest that representations of similar cases have a strong impact on the model performance, that models perform well with fewe",
    "link": "http://arxiv.org/abs/2301.11879",
    "context": "Title: Case-Based Reasoning with Language Models for Classification of Logical Fallacies. (arXiv:2301.11879v2 [cs.AI] UPDATED)\nAbstract: The ease and speed of spreading misinformation and propaganda on the Web motivate the need to develop trustworthy technology for detecting fallacies in natural language arguments. However, state-of-the-art language modeling methods exhibit a lack of robustness on tasks like logical fallacy classification that require complex reasoning. In this paper, we propose a Case-Based Reasoning method that classifies new cases of logical fallacy by language-modeling-driven retrieval and adaptation of historical cases. We design four complementary strategies to enrich input representation for our model, based on external information about goals, explanations, counterarguments, and argument structure. Our experiments in in-domain and out-of-domain settings indicate that Case-Based Reasoning improves the accuracy and generalizability of language models. Our ablation studies suggest that representations of similar cases have a strong impact on the model performance, that models perform well with fewe",
    "path": "papers/23/01/2301.11879.json",
    "total_tokens": 867,
    "translated_title": "基于语言模型的案例推理在逻辑谬误分类中的应用",
    "translated_abstract": "在网络上传播虚假信息和宣传的容易和快捷性促使我们需要开发可靠的技术来检测自然语言论证中的谬误。然而，现有的语言建模方法在需要复杂推理的逻辑谬误分类等任务上表现出缺乏鲁棒性的特点。本文提出了一种基于案例推理的方法，该方法通过基于语言建模的检索和历史案例的调整来分类逻辑谬误的新案例。我们设计了四种互补的策略，基于有关目标、解释、反驳和论证结构的外部信息来丰富我们模型的输入表示。我们在领域内和领域外的实验表明，基于案例推理可以提高语言模型的准确性和泛化能力。我们的消融研究表明，类似案例的表示对模型性能有很大的影响，较少的历史案例也能使模型有良好性能。",
    "tldr": "本文提出了一种基于案例推理的方法用于分类逻辑谬误的新案例，通过基于语言建模的检索和历史案例的调整来提高语言模型的准确性和泛化能力。",
    "en_tdlr": "This paper proposes a case-based reasoning method for classifying new cases of logical fallacies by language-modeling-driven retrieval and adaptation of historical cases to improve the accuracy and generalizability of language models."
}