{
    "title": "Continual Causal Effect Estimation: Challenges and Opportunities. (arXiv:2301.01026v4 [cs.LG] UPDATED)",
    "abstract": "A further understanding of cause and effect within observational data is critical across many domains, such as economics, health care, public policy, web mining, online advertising, and marketing campaigns. Although significant advances have been made to overcome the challenges in causal effect estimation with observational data, such as missing counterfactual outcomes and selection bias between treatment and control groups, the existing methods mainly focus on source-specific and stationary observational data. Such learning strategies assume that all observational data are already available during the training phase and from only one source. This practical concern of accessibility is ubiquitous in various academic and industrial applications. That's what it boiled down to: in the era of big data, we face new challenges in causal inference with observational data, i.e., the extensibility for incrementally available observational data, the adaptability for extra domain adaptation proble",
    "link": "http://arxiv.org/abs/2301.01026",
    "context": "Title: Continual Causal Effect Estimation: Challenges and Opportunities. (arXiv:2301.01026v4 [cs.LG] UPDATED)\nAbstract: A further understanding of cause and effect within observational data is critical across many domains, such as economics, health care, public policy, web mining, online advertising, and marketing campaigns. Although significant advances have been made to overcome the challenges in causal effect estimation with observational data, such as missing counterfactual outcomes and selection bias between treatment and control groups, the existing methods mainly focus on source-specific and stationary observational data. Such learning strategies assume that all observational data are already available during the training phase and from only one source. This practical concern of accessibility is ubiquitous in various academic and industrial applications. That's what it boiled down to: in the era of big data, we face new challenges in causal inference with observational data, i.e., the extensibility for incrementally available observational data, the adaptability for extra domain adaptation proble",
    "path": "papers/23/01/2301.01026.json",
    "total_tokens": 861,
    "translated_title": "连续因果效应估计：挑战与机会",
    "translated_abstract": "在许多领域，如经济学、医疗保健、公共政策、网络挖掘、在线广告和营销活动中，理解观察数据中的因果关系非常关键。尽管在因果效应估计方面已经取得了重大进展，如处理缺失的对照结果和治疗与控制组之间的选择偏差，但现有方法主要集中在源特定和静态观测数据上。这些学习策略假设所有观测数据已经在训练阶段可用且仅来自于一个来源。这种可访问性的实际问题在各种学术和工业应用中普遍存在。在大数据时代，我们面临着利用观测数据进行因果推断的新挑战，即针对逐步可用的观测数据的可扩展性和额外领域适应性问题。",
    "tldr": "本文介绍了因果效应估计中的挑战与机会，现有方法主要集中在源特定和静态观测数据上，实际问题在于观测数据只能逐步获得，本文提出了一种连续因果效应估计方法。",
    "en_tdlr": "This article introduces the challenges and opportunities in causal effect estimation, with existing methods mainly focusing on source-specific and stationary observational data. The practical concern is that observational data can only be incrementally available. This article proposes a method for continual causal effect estimation."
}