{
    "title": "Can we infer microscopic financial information from the long memory in market-order flow?: a quantitative test of the Lillo-Mike-Farmer model. (arXiv:2301.13505v2 [q-fin.TR] UPDATED)",
    "abstract": "In financial markets, the market order sign exhibits strong persistence, widely known as the long-range correlation (LRC) of order flow; specifically, the sign correlation function displays long memory with power-law exponent $\\gamma$, such that $C(\\tau) \\propto \\tau^{-\\gamma}$ for large time-lag $\\tau$. One of the most promising microscopic hypotheses is the order-splitting behaviour at the level of individual traders. Indeed, Lillo, Mike, and Farmer (LMF) introduced in 2005 a simple microscopic model of order-splitting behaviour, which predicts that the macroscopic sign correlation is quantitatively associated with the microscopic distribution of metaorders. While this hypothesis has been a central issue of debate in econophysics, its direct quantitative validation has been missing because it requires large microscopic datasets with high resolution to observe the order-splitting behaviour of all individual traders. Here we present the first quantitative validation of this LFM predict",
    "link": "http://arxiv.org/abs/2301.13505",
    "context": "Title: Can we infer microscopic financial information from the long memory in market-order flow?: a quantitative test of the Lillo-Mike-Farmer model. (arXiv:2301.13505v2 [q-fin.TR] UPDATED)\nAbstract: In financial markets, the market order sign exhibits strong persistence, widely known as the long-range correlation (LRC) of order flow; specifically, the sign correlation function displays long memory with power-law exponent $\\gamma$, such that $C(\\tau) \\propto \\tau^{-\\gamma}$ for large time-lag $\\tau$. One of the most promising microscopic hypotheses is the order-splitting behaviour at the level of individual traders. Indeed, Lillo, Mike, and Farmer (LMF) introduced in 2005 a simple microscopic model of order-splitting behaviour, which predicts that the macroscopic sign correlation is quantitatively associated with the microscopic distribution of metaorders. While this hypothesis has been a central issue of debate in econophysics, its direct quantitative validation has been missing because it requires large microscopic datasets with high resolution to observe the order-splitting behaviour of all individual traders. Here we present the first quantitative validation of this LFM predict",
    "path": "papers/23/01/2301.13505.json",
    "total_tokens": 945,
    "translated_title": "我们能否从市场订单流的长时记忆中推断微观金融信息？：对Lillo-Mike-Farmer模型的定量检验。",
    "translated_abstract": "在金融市场中，市场订单的方向表现出强烈的持续性，被广泛称为订单流的长时关联（LRC）; 具体而言，订单方向相关函数显示出具有幂律指数$\\gamma$的长时记忆，使得对于较大的时间延迟$\\tau$，$C(\\tau) \\propto \\tau^{-\\gamma}$。其中最有希望的微观假设之一是个体交易者水平上的订单拆分行为。事实上，Lillo、Mike和Farmer（LMF）在2005年提出了一个简单的微观订单拆分行为模型，该模型预测宏观订单方向相关与微观元订单分布定量相关。尽管这个假设一直是计量经济物理学中的一个核心争议问题，但直接定量验证一直缺乏，因为它需要具有高分辨率的大量微观数据集来观察所有个体交易者的订单拆分行为。在这里，我们首次对这种LMF模型的预测进行了定量验证。",
    "tldr": "该研究通过对市场订单流的长时记忆进行定量测试，验证了Lillo-Mike-Farmer模型中的微观假设关于订单拆分行为的预测与宏观订单方向相关性的定量关系。",
    "en_tdlr": "This study provides the first quantitative validation of the Lillo-Mike-Farmer model by testing the long memory in market-order flow, confirming the relationship between the microscopic hypothesis of order-splitting behavior and the macroscopic sign correlation."
}