{
    "title": "Heat and Worker Health. (arXiv:2301.11554v2 [econ.GN] UPDATED)",
    "abstract": "Extreme heat negatively impacts cognition, learning, and task performance. With increasing global temperatures, workers may therefore be at increased risk of work-related injuries and illness. This study estimates the effects of temperature on worker health using records spanning 1985-2020 from an Australian mandatory insurance scheme. High temperatures are found to cause significantly more claims, particularly among manual workers in outdoor-based industries. These adverse effects have not diminished across time, with the largest effect observed for the 2015-2020 period, indicating increasing vulnerability to heat. Within occupations, the workers most adversely affected by heat are female, older-aged and higher-earning. Finally, results from firm-level panel analyses show that the percentage increase in claims on hot days is largest at \"safer\" firms.",
    "link": "http://arxiv.org/abs/2301.11554",
    "context": "Title: Heat and Worker Health. (arXiv:2301.11554v2 [econ.GN] UPDATED)\nAbstract: Extreme heat negatively impacts cognition, learning, and task performance. With increasing global temperatures, workers may therefore be at increased risk of work-related injuries and illness. This study estimates the effects of temperature on worker health using records spanning 1985-2020 from an Australian mandatory insurance scheme. High temperatures are found to cause significantly more claims, particularly among manual workers in outdoor-based industries. These adverse effects have not diminished across time, with the largest effect observed for the 2015-2020 period, indicating increasing vulnerability to heat. Within occupations, the workers most adversely affected by heat are female, older-aged and higher-earning. Finally, results from firm-level panel analyses show that the percentage increase in claims on hot days is largest at \"safer\" firms.",
    "path": "papers/23/01/2301.11554.json",
    "total_tokens": 938,
    "translated_title": "热浪对工人健康的影响",
    "translated_abstract": "高温对工人的认知、学习和任务绩效均产生负面影响。随着全球气温的升高，工人可能会面临更高的职业伤害和疾病风险。该研究利用澳大利亚强制保险计划跨越1985-2020年的记录，估计了温度对工人健康的影响。发现高温导致更多的索赔，尤其是在户外基础行业从事体力劳动的工人。这些不利影响在时间上没有减少，尤其是在2015-2020年期间，表明对热的脆弱性正在增加。在职业方面，受热影响最严重的工人是女性、年龄较大且薪资较高的工人。最后，企业级面板分析结果表明，在炎热的天气中，索赔率增加的百分比最大的是“更安全”的公司。",
    "tldr": "研究估计了高温对工人健康的影响，发现高温导致更多的索赔，特别是在户外基础行业从事体力劳动的工人中影响最显著。职业中受热影响最严重的工人是女性、年龄较大且薪资较高的工人。热的脆弱性正在增加，尤其是在2015-2020年期间。"
}