{
    "title": "Time-Warping Invariant Quantum Recurrent Neural Networks via Quantum-Classical Adaptive Gating. (arXiv:2301.08173v3 [quant-ph] UPDATED)",
    "abstract": "Adaptive gating plays a key role in temporal data processing via classical recurrent neural networks (RNN), as it facilitates retention of past information necessary to predict the future, providing a mechanism that preserves invariance to time warping transformations. This paper builds on quantum recurrent neural networks (QRNNs), a dynamic model with quantum memory, to introduce a novel class of temporal data processing quantum models that preserve invariance to time-warping transformations of the (classical) input-output sequences. The model, referred to as time warping-invariant QRNN (TWI-QRNN), augments a QRNN with a quantum-classical adaptive gating mechanism that chooses whether to apply a parameterized unitary transformation at each time step as a function of the past samples of the input sequence via a classical recurrent model. The TWI-QRNN model class is derived from first principles, and its capacity to successfully implement time-warping transformations is experimentally d",
    "link": "http://arxiv.org/abs/2301.08173",
    "context": "Title: Time-Warping Invariant Quantum Recurrent Neural Networks via Quantum-Classical Adaptive Gating. (arXiv:2301.08173v3 [quant-ph] UPDATED)\nAbstract: Adaptive gating plays a key role in temporal data processing via classical recurrent neural networks (RNN), as it facilitates retention of past information necessary to predict the future, providing a mechanism that preserves invariance to time warping transformations. This paper builds on quantum recurrent neural networks (QRNNs), a dynamic model with quantum memory, to introduce a novel class of temporal data processing quantum models that preserve invariance to time-warping transformations of the (classical) input-output sequences. The model, referred to as time warping-invariant QRNN (TWI-QRNN), augments a QRNN with a quantum-classical adaptive gating mechanism that chooses whether to apply a parameterized unitary transformation at each time step as a function of the past samples of the input sequence via a classical recurrent model. The TWI-QRNN model class is derived from first principles, and its capacity to successfully implement time-warping transformations is experimentally d",
    "path": "papers/23/01/2301.08173.json",
    "total_tokens": 904,
    "translated_title": "通过量子-经典自适应门控实现时间扭曲不变量的量子递归神经网络。",
    "translated_abstract": "经典递归神经网络（RNN）通过自适应门控在时间数据处理中发挥关键作用，因为它促进了保留过去信息以预测未来的机制，提供了一个保持对时间扭曲转换不变的机制。本文基于量子递归神经网络（QRNNs），一种具有量子内存的动态模型，引入了一种新的时间数据处理量子模型，可以保持对输入-输出序列的时间扭曲转换不变性。这个模型被称为时间扭曲不变QRNN（TWI-QRNN），通过一个量子-经典自适应门控机制增强了QRNN，该机制可以根据输入序列的过去样本通过经典递归模型决定是否在每个时间步骤应用参数化的酉变换。 TWI-QRNN模型类从基本原理中推导出来，并且通过实验成功地实现了时间扭曲转换不变量。",
    "tldr": "这篇论文介绍了一种新的量子递归神经网络模型TWI-QRNN，它通过量子-经典自适应门控机制实现时间扭曲不变性，并在实验中证明了其有效性。",
    "en_tdlr": "This paper introduces a new quantum recurrent neural network model, TWI-QRNN, which achieves time warping invariance through a quantum-classical adaptive gating mechanism, and its effectiveness is experimentally demonstrated."
}