{
    "title": "Adaptive Computation with Elastic Input Sequence. (arXiv:2301.13195v2 [cs.LG] UPDATED)",
    "abstract": "Humans have the ability to adapt the type of information they use, the procedure they employ, and the amount of time they spend when solving problems. However, most standard neural networks have a fixed function type and computation budget regardless of the sample's nature or difficulty. Adaptivity is a powerful paradigm as it not only imbues practitioners with flexibility pertaining to the downstream usage of these models but can also serve as a powerful inductive bias for solving certain challenging classes of problems. In this work, we introduce a new approach called AdaTape, which allows for dynamic computation in neural networks through adaptive tape tokens. AdaTape utilizes an elastic input sequence by equipping an architecture with a dynamic read-and-write tape. Specifically, we adaptively generate input sequences using tape tokens obtained from a tape bank which can be either trainable or derived from input data. We examine the challenges and requirements to obtain dynamic sequ",
    "link": "http://arxiv.org/abs/2301.13195",
    "context": "Title: Adaptive Computation with Elastic Input Sequence. (arXiv:2301.13195v2 [cs.LG] UPDATED)\nAbstract: Humans have the ability to adapt the type of information they use, the procedure they employ, and the amount of time they spend when solving problems. However, most standard neural networks have a fixed function type and computation budget regardless of the sample's nature or difficulty. Adaptivity is a powerful paradigm as it not only imbues practitioners with flexibility pertaining to the downstream usage of these models but can also serve as a powerful inductive bias for solving certain challenging classes of problems. In this work, we introduce a new approach called AdaTape, which allows for dynamic computation in neural networks through adaptive tape tokens. AdaTape utilizes an elastic input sequence by equipping an architecture with a dynamic read-and-write tape. Specifically, we adaptively generate input sequences using tape tokens obtained from a tape bank which can be either trainable or derived from input data. We examine the challenges and requirements to obtain dynamic sequ",
    "path": "papers/23/01/2301.13195.json",
    "total_tokens": 1026,
    "translated_title": "弹性输入序列的自适应计算",
    "translated_abstract": "人类有能力在解决问题时适应不同类型的信息、不同的处理方法和不同的时间花费。然而，大部分标准神经网络无论样本的性质或难度都有固定的函数类型和计算预算。自适应计算是一种强大的范式，因为它不仅赋予从业者灵活性，而且还可以作为解决某些具有挑战性的问题的强大归纳偏差。在本文中，我们介绍了一种名为AdaTape的新方法，通过自适应磁带符号，允许神经网络进行动态计算。AdaTape利用弹性输入序列，通过装备带有动态读写磁带的架构来实现。具体来说，我们使用来自磁带库的磁带符号来自适应生成输入序列，这些符号可训练或从输入数据中派生。我们研究了获得动态序列计算所需的挑战和要求，以及AdaTape的性质。我们的实验表明，AdaTape能够学习自适应计算策略，从而在几个基准任务（包括图像分类、语言建模和程序综合）上实现更好的性能。",
    "tldr": "本文介绍了一种名为AdaTape的新方法，通过自适应磁带符号，允许神经网络进行动态计算，能够实现适应不同类型信息的自适应计算，在图像分类、语言建模和程序综合等多个任务中都表现出更好的性能。",
    "en_tdlr": "This paper introduces a new approach called AdaTape, which allows for dynamic computation in neural networks through adaptive tape tokens, enabling adaptive computation for different types of information and achieving better performance on multiple benchmark tasks, including image classification, language modeling, and program synthesis."
}