{
    "title": "Explainable Data-Driven Optimization: From Context to Decision and Back Again. (arXiv:2301.10074v2 [cs.LG] UPDATED)",
    "abstract": "Data-driven optimization uses contextual information and machine learning algorithms to find solutions to decision problems with uncertain parameters. While a vast body of work is dedicated to interpreting machine learning models in the classification setting, explaining decision pipelines involving learning algorithms remains unaddressed. This lack of interpretability can block the adoption of data-driven solutions as practitioners may not understand or trust the recommended decisions. We bridge this gap by introducing a counterfactual explanation methodology tailored to explain solutions to data-driven problems. We introduce two classes of explanations and develop methods to find nearest explanations of random forest and nearest-neighbor predictors. We demonstrate our approach by explaining key problems in operations management such as inventory management and routing.",
    "link": "http://arxiv.org/abs/2301.10074",
    "context": "Title: Explainable Data-Driven Optimization: From Context to Decision and Back Again. (arXiv:2301.10074v2 [cs.LG] UPDATED)\nAbstract: Data-driven optimization uses contextual information and machine learning algorithms to find solutions to decision problems with uncertain parameters. While a vast body of work is dedicated to interpreting machine learning models in the classification setting, explaining decision pipelines involving learning algorithms remains unaddressed. This lack of interpretability can block the adoption of data-driven solutions as practitioners may not understand or trust the recommended decisions. We bridge this gap by introducing a counterfactual explanation methodology tailored to explain solutions to data-driven problems. We introduce two classes of explanations and develop methods to find nearest explanations of random forest and nearest-neighbor predictors. We demonstrate our approach by explaining key problems in operations management such as inventory management and routing.",
    "path": "papers/23/01/2301.10074.json",
    "total_tokens": 846,
    "translated_title": "可解释的数据驱动优化：从背景到决策再到背景 (arXiv:2301.10074v2 [cs.LG] 更新版)",
    "translated_abstract": "数据驱动优化利用上下文信息和机器学习算法来解决存在不确定参数的决策问题。尽管在分类设置中有大量工作致力于解释机器学习模型，但对涉及学习算法的决策流程的解释仍未得到解决。这种缺乏可解释性可能阻碍数据驱动解决方案的采用，因为从业人员可能不理解或不信任推荐的决策。我们通过引入一种针对数据驱动问题解释解决方案的反事实解释方法填补了这一差距。我们介绍了两类解释，并开发了寻找随机森林和最近邻预测器的最近解释的方法。我们通过解释运营管理中的关键问题，如库存管理和路径规划，来演示我们的方法。",
    "tldr": "本论文介绍了一种解释数据驱动问题解决方案的方法，通过使用反事实解释方法和针对随机森林和最近邻预测器的最近解释方法来解释数据驱动优化过程中的决策流程，填补了目前在学习算法决策流程解释方面的空白。"
}