{
    "title": "Federated Transfer-Ordered-Personalized Learning for Driver Monitoring Application. (arXiv:2301.04829v2 [cs.LG] UPDATED)",
    "abstract": "Federated learning (FL) shines through in the internet of things (IoT) with its ability to realize collaborative learning and improve learning efficiency by sharing client model parameters trained on local data. Although FL has been successfully applied to various domains, including driver monitoring applications (DMAs) on the internet of vehicles (IoV), its usages still face some open issues, such as data and system heterogeneity, large-scale parallelism communication resources, malicious attacks, and data poisoning. This paper proposes a federated transfer-ordered-personalized learning (FedTOP) framework to address the above problems and test on two real-world datasets with and without system heterogeneity. The performance of the three extensions, transfer, ordered, and personalized, is compared by an ablation study and achieves 92.32% and 95.96% accuracy on the test clients of two datasets, respectively. Compared to the baseline, there is a 462% improvement in accuracy and a 37.46% ",
    "link": "http://arxiv.org/abs/2301.04829",
    "context": "Title: Federated Transfer-Ordered-Personalized Learning for Driver Monitoring Application. (arXiv:2301.04829v2 [cs.LG] UPDATED)\nAbstract: Federated learning (FL) shines through in the internet of things (IoT) with its ability to realize collaborative learning and improve learning efficiency by sharing client model parameters trained on local data. Although FL has been successfully applied to various domains, including driver monitoring applications (DMAs) on the internet of vehicles (IoV), its usages still face some open issues, such as data and system heterogeneity, large-scale parallelism communication resources, malicious attacks, and data poisoning. This paper proposes a federated transfer-ordered-personalized learning (FedTOP) framework to address the above problems and test on two real-world datasets with and without system heterogeneity. The performance of the three extensions, transfer, ordered, and personalized, is compared by an ablation study and achieves 92.32% and 95.96% accuracy on the test clients of two datasets, respectively. Compared to the baseline, there is a 462% improvement in accuracy and a 37.46% ",
    "path": "papers/23/01/2301.04829.json",
    "total_tokens": 983,
    "translated_title": "面向驾驶员监测应用的联邦迁移有序个性化学习",
    "translated_abstract": "联邦学习通过共享在本地数据上训练的客户端模型参数来实现协作学习，提高学习效率，在物联网中具有广泛应用前景。本文提出了一个名为FedTOP的联邦迁移有序个性化学习框架，用于解决数据和系统异构性、大规模并行通信资源、恶意攻击和数据污染等问题。论文在两个真实数据集上进行了测试，并比较了三种扩展的性能 - 迁移、有序和个性化。实验结果表明，该框架在两个数据集上的测试客户端分别达到92.32％和95.96％的准确率。与基线相比，在准确率方面提高了462％，并降低了37.46％的通信成本。",
    "tldr": "本文提出了一个名为FedTOP的联邦迁移有序个性化学习框架，用于解决数据和系统异构性、大规模并行通信资源、恶意攻击和数据污染等问题。实验结果显示，该框架在两个数据集上的测试客户端分别达到92.32％和95.96％的准确率。与基线相比，在准确率方面提高了462％，并降低了37.46％的通信成本。",
    "en_tdlr": "The paper proposes a FedTOP framework for federated transfer-ordered-personalized learning to solve issues such as data and system heterogeneity, large-scale parallelism communication resources, malicious attacks, and data poisoning in driver monitoring applications. The framework achieves 92.32% and 95.96% accuracy on the test clients of two datasets, showing a 462% improvement in accuracy and a 37.46% reduction in communication cost compared to the baseline."
}