{
    "title": "Silent Killer: A Stealthy, Clean-Label, Black-Box Backdoor Attack. (arXiv:2301.02615v2 [cs.CR] UPDATED)",
    "abstract": "Backdoor poisoning attacks pose a well-known risk to neural networks. However, most studies have focused on lenient threat models. We introduce Silent Killer, a novel attack that operates in clean-label, black-box settings, uses a stealthy poison and trigger and outperforms existing methods. We investigate the use of universal adversarial perturbations as triggers in clean-label attacks, following the success of such approaches under poison-label settings. We analyze the success of a naive adaptation and find that gradient alignment for crafting the poison is required to ensure high success rates. We conduct thorough experiments on MNIST, CIFAR10, and a reduced version of ImageNet and achieve state-of-the-art results.",
    "link": "http://arxiv.org/abs/2301.02615",
    "context": "Title: Silent Killer: A Stealthy, Clean-Label, Black-Box Backdoor Attack. (arXiv:2301.02615v2 [cs.CR] UPDATED)\nAbstract: Backdoor poisoning attacks pose a well-known risk to neural networks. However, most studies have focused on lenient threat models. We introduce Silent Killer, a novel attack that operates in clean-label, black-box settings, uses a stealthy poison and trigger and outperforms existing methods. We investigate the use of universal adversarial perturbations as triggers in clean-label attacks, following the success of such approaches under poison-label settings. We analyze the success of a naive adaptation and find that gradient alignment for crafting the poison is required to ensure high success rates. We conduct thorough experiments on MNIST, CIFAR10, and a reduced version of ImageNet and achieve state-of-the-art results.",
    "path": "papers/23/01/2301.02615.json",
    "total_tokens": 859,
    "translated_title": "默默杀手: 一种隐蔽的、无标签的、黑盒子后门攻击",
    "translated_abstract": "后门污染攻击对神经网络构成了众所周知的风险。然而，大多数研究都集中在宽松的威胁模型上。我们引入了一种名为默默杀手的新型攻击，在无标签的黑盒子环境中运行，使用隐蔽的毒物和触发器，并且胜过现有的方法。我们研究了在无标签攻击中使用通用对抗扰动作为触发器的方法，在毒标签设置下的成功案例之后。我们分析了一个天真的适应方法的成功情况，并发现需要渐变对齐以确保高成功率。我们对MNIST、CIFAR10和一个缩小版的ImageNet进行了彻底的实验，并取得了最新的成果。",
    "tldr": "默默杀手是一种隐蔽的、无标签的、黑盒子后门攻击，它使用了隐蔽的毒物和触发器，在无标签攻击中使用通用对抗扰动作为触发器，通过渐变对齐来提高成功率，并在MNIST、CIFAR10和ImageNet数据集上取得了最新的成果。",
    "en_tdlr": "Silent Killer is a stealthy, clean-label, black-box backdoor attack that outperforms existing methods. It uses a stealthy poison and trigger and investigates the use of universal adversarial perturbations as triggers in clean-label attacks, achieving state-of-the-art results on MNIST, CIFAR10, and a reduced version of ImageNet."
}