{
    "title": "Salient Conditional Diffusion for Defending Against Backdoor Attacks. (arXiv:2301.13862v2 [cs.LG] UPDATED)",
    "abstract": "We propose a novel algorithm, Salient Conditional Diffusion (Sancdifi), a state-of-the-art defense against backdoor attacks. Sancdifi uses a denoising diffusion probabilistic model (DDPM) to degrade an image with noise and then recover said image using the learned reverse diffusion. Critically, we compute saliency map-based masks to condition our diffusion, allowing for stronger diffusion on the most salient pixels by the DDPM. As a result, Sancdifi is highly effective at diffusing out triggers in data poisoned by backdoor attacks. At the same time, it reliably recovers salient features when applied to clean data. This performance is achieved without requiring access to the model parameters of the Trojan network, meaning Sancdifi operates as a black-box defense.",
    "link": "http://arxiv.org/abs/2301.13862",
    "context": "Title: Salient Conditional Diffusion for Defending Against Backdoor Attacks. (arXiv:2301.13862v2 [cs.LG] UPDATED)\nAbstract: We propose a novel algorithm, Salient Conditional Diffusion (Sancdifi), a state-of-the-art defense against backdoor attacks. Sancdifi uses a denoising diffusion probabilistic model (DDPM) to degrade an image with noise and then recover said image using the learned reverse diffusion. Critically, we compute saliency map-based masks to condition our diffusion, allowing for stronger diffusion on the most salient pixels by the DDPM. As a result, Sancdifi is highly effective at diffusing out triggers in data poisoned by backdoor attacks. At the same time, it reliably recovers salient features when applied to clean data. This performance is achieved without requiring access to the model parameters of the Trojan network, meaning Sancdifi operates as a black-box defense.",
    "path": "papers/23/01/2301.13862.json",
    "total_tokens": 947,
    "translated_title": "防御后门攻击的显著条件扩散算法",
    "translated_abstract": "本文提出了一种新颖的算法——显著条件扩散（Sancdifi），是目前针对后门攻击的最先进防御机制。Sancdifi利用去噪扩散概率模型（DDPM）对一张加入噪声的图像进行降质处理，然后再利用学习到的逆扩散重构该图像。重要的是，我们基于显著性图生成掩码来调节扩散，允许DDPM对最突出的像素进行更强的扩散。因此，Sancdifi在去除受到后门攻击污染的数据中的触发器时非常有效。与此同时，Sancdifi可以可靠地在干净数据上应用，并恢复突出特征。这种性能是在无需使用特洛伊网络模型参数的情况下实现的，这意味着Sancdifi作为一种黑盒防御机制发挥作用。",
    "tldr": "Sancdifi是一种有效防御后门攻击的新算法，通过生成基于salience map的masks调节去噪扩散概率模型，能够有效去除被后门攻击污染的数据中的触发器，同时在干净数据上也能恢复出突出特征，而且无需使用特洛伊网络模型参数，作为一种黑盒防御机制发挥作用。",
    "en_tdlr": "Sancdifi is an effective new algorithm to defend against backdoor attacks, which can remove triggers in data poisoned by backdoor attacks and recover salient features from clean data by generating masks based on saliency map to adjust the denoising diffusion probabilistic model, and it works as a black-box defense without needing access to the Trojan network model parameters."
}