{
    "title": "Improving Graph Generation by Restricting Graph Bandwidth. (arXiv:2301.10857v2 [cs.LG] UPDATED)",
    "abstract": "Deep graph generative modeling has proven capable of learning the distribution of complex, multi-scale structures characterizing real-world graphs. However, one of the main limitations of existing methods is their large output space, which limits generation scalability and hinders accurate modeling of the underlying distribution. To overcome these limitations, we propose a novel approach that significantly reduces the output space of existing graph generative models. Specifically, starting from the observation that many real-world graphs have low graph bandwidth, we restrict graph bandwidth during training and generation. Our strategy improves both generation scalability and quality without increasing architectural complexity or reducing expressiveness. Our approach is compatible with existing graph generative methods, and we describe its application to both autoregressive and one-shot models. We extensively validate our strategy on synthetic and real datasets, including molecular grap",
    "link": "http://arxiv.org/abs/2301.10857",
    "context": "Title: Improving Graph Generation by Restricting Graph Bandwidth. (arXiv:2301.10857v2 [cs.LG] UPDATED)\nAbstract: Deep graph generative modeling has proven capable of learning the distribution of complex, multi-scale structures characterizing real-world graphs. However, one of the main limitations of existing methods is their large output space, which limits generation scalability and hinders accurate modeling of the underlying distribution. To overcome these limitations, we propose a novel approach that significantly reduces the output space of existing graph generative models. Specifically, starting from the observation that many real-world graphs have low graph bandwidth, we restrict graph bandwidth during training and generation. Our strategy improves both generation scalability and quality without increasing architectural complexity or reducing expressiveness. Our approach is compatible with existing graph generative methods, and we describe its application to both autoregressive and one-shot models. We extensively validate our strategy on synthetic and real datasets, including molecular grap",
    "path": "papers/23/01/2301.10857.json",
    "total_tokens": 875,
    "translated_title": "限制图带宽来提高图生成技术",
    "translated_abstract": "深度图生成建模已被证明能够学习表征真实世界图形的复杂多尺度结构的分布。然而，现有方法的主要限制之一是它们的大输出空间，这限制了生成可扩展性并阻碍了基础分布的准确建模。为了克服这些限制，我们提出了一种新颖的方法，显着减少了现有图生成模型的输出空间。具体地，从许多真实世界图形具有低图带宽的观察出发，我们在训练和生成过程中限制图带宽。我们的策略提高了生成的可扩展性和质量，同时不增加架构复杂性或减小表达能力。我们的方法与现有的图生成方法兼容，并描述了它在自回归和单次模型上的应用。我们对合成和真实数据集进行了广泛的验证，包括分子结构生成数据集。",
    "tldr": "本论文提出一种通过限制图的带宽来提高现有图生成模型输出空间的方法，该方法可以提高生成可扩展性和质量，并在不增加复杂性或减少表达能力的情况下与现有图生成方法兼容。",
    "en_tdlr": "This paper proposes a novel approach to significantly reducing the output space of existing graph generative models by restricting graph bandwidth during training and generation based on the observation that many real-world graphs have low graph bandwidth. Our strategy can improve both generation scalability and quality without increasing architectural complexity or reducing expressiveness, and is compatible with existing graph generative methods."
}