{
    "title": "FPANet: Frequency-based Video Demoireing using Frame-level Post Alignment. (arXiv:2301.07330v2 [cs.CV] UPDATED)",
    "abstract": "Interference between overlapping gird patterns creates moire patterns, degrading the visual quality of an image that captures a screen of a digital display device by an ordinary digital camera. Removing such moire patterns is challenging due to their complex patterns of diverse sizes and color distortions. Existing approaches mainly focus on filtering out in the spatial domain, failing to remove a large-scale moire pattern. In this paper, we propose a novel model called FPANet that learns filters in both frequency and spatial domains, improving the restoration quality by removing various sizes of moire patterns. To further enhance, our model takes multiple consecutive frames, learning to extract frame-invariant content features and outputting better quality temporally consistent images. We demonstrate the effectiveness of our proposed method with a publicly available large-scale dataset, observing that ours outperforms the state-of-the-art approaches, including ESDNet, VDmoire, MBCNN, ",
    "link": "http://arxiv.org/abs/2301.07330",
    "context": "Title: FPANet: Frequency-based Video Demoireing using Frame-level Post Alignment. (arXiv:2301.07330v2 [cs.CV] UPDATED)\nAbstract: Interference between overlapping gird patterns creates moire patterns, degrading the visual quality of an image that captures a screen of a digital display device by an ordinary digital camera. Removing such moire patterns is challenging due to their complex patterns of diverse sizes and color distortions. Existing approaches mainly focus on filtering out in the spatial domain, failing to remove a large-scale moire pattern. In this paper, we propose a novel model called FPANet that learns filters in both frequency and spatial domains, improving the restoration quality by removing various sizes of moire patterns. To further enhance, our model takes multiple consecutive frames, learning to extract frame-invariant content features and outputting better quality temporally consistent images. We demonstrate the effectiveness of our proposed method with a publicly available large-scale dataset, observing that ours outperforms the state-of-the-art approaches, including ESDNet, VDmoire, MBCNN, ",
    "path": "papers/23/01/2301.07330.json",
    "total_tokens": 781,
    "translated_title": "FPANet: 基于频率的视频去莫尔纹技术，使用帧级后对齐",
    "translated_abstract": "重叠网格模式之间的干扰会导致莫尔纹，从而降低普通数码相机捕捉数字显示屏的图像的视觉质量。该论文提出了一种名为FPANet的新模型，它学习频率和空间域中的滤波器，通过去除各种大小的莫尔纹图案来改善恢复质量。此外，模型使用多个连续帧，学习提取帧不变内容特征，并输出更好质量的时间一致图像。",
    "tldr": "该论文提出了一种名为FPANet的新模型，它通过去除各种大小的莫尔纹图案来改善恢复质量，采用多个连续帧提取帧不变内容特征，输出时间一致图像。",
    "en_tdlr": "The paper proposes a novel model called FPANet that improves restoration quality by removing various sizes of moire patterns through learning filters in both frequency and spatial domains. The model uses multiple consecutive frames to extract frame-invariant content features and output better quality temporally consistent images."
}