{
    "title": "Haves and Have-Nots: A Theory of Economic Sufficientarianism. (arXiv:2301.08666v2 [econ.TH] UPDATED)",
    "abstract": "We introduce a generalization of the concept of sufficientarianism, intended to rank allocations involving multiple consumption goods. In ranking allocations of goods for a fixed society of agents, sufficientarianism posits that allocations are compared according to the number of individuals whose consumption is deemed sufficient. We base our analysis on a novel ethical concept, which we term sufficientarian judgment. Sufficientarian judgment asserts that if in starting from an allocation in which all agents have identical consumption, a change in one agent's consumption hurts society, then there is no change in any other agent's consumption which could subsequently benefit society. Sufficientarianism is shown to be equivalent to sufficientarian judgment, symmetry, and separability. We investigate our axioms in an abstract environment, and in specific economic environments. Finally, we argue formally that sufficientarian judgment is closely related to the leximin principle.",
    "link": "http://arxiv.org/abs/2301.08666",
    "context": "Title: Haves and Have-Nots: A Theory of Economic Sufficientarianism. (arXiv:2301.08666v2 [econ.TH] UPDATED)\nAbstract: We introduce a generalization of the concept of sufficientarianism, intended to rank allocations involving multiple consumption goods. In ranking allocations of goods for a fixed society of agents, sufficientarianism posits that allocations are compared according to the number of individuals whose consumption is deemed sufficient. We base our analysis on a novel ethical concept, which we term sufficientarian judgment. Sufficientarian judgment asserts that if in starting from an allocation in which all agents have identical consumption, a change in one agent's consumption hurts society, then there is no change in any other agent's consumption which could subsequently benefit society. Sufficientarianism is shown to be equivalent to sufficientarian judgment, symmetry, and separability. We investigate our axioms in an abstract environment, and in specific economic environments. Finally, we argue formally that sufficientarian judgment is closely related to the leximin principle.",
    "path": "papers/23/01/2301.08666.json",
    "total_tokens": 837,
    "translated_title": "有与无：经济充足主义理论",
    "translated_abstract": "我们介绍了充足主义概念的一种推广，旨在对涉及多种消费品的分配进行排名。在为固定的代理人社会比较物品分配时，充足主义假设根据被认为足够的消费的个体数量进行比较。我们的分析基于一个新的伦理概念，我们称之为充足主义判断。充足主义判断指出，如果从一个所有代理人消费相同的分配出发，一个代理人的消费变化会对社会造成伤害，那么其他代理人的消费变化不可能对社会造成利益。充足主义被证明等价于充足主义判断、对称性和可分离性。我们在抽象环境和具体经济环境中研究了我们的公理。最后，我们正式论证充足主义判断与leximin原则密切相关。",
    "tldr": "这篇论文介绍了一种对涉及多种消费品的分配进行排名的充足主义概念推广，研究了充足主义判断与leximin原则的关系。",
    "en_tdlr": "This paper introduces a generalization of the concept of sufficientarianism to rank allocations involving multiple consumption goods, and explores the relationship between sufficientarian judgment and the leximin principle."
}