{
    "title": "Ordered Reference Dependent Choice. (arXiv:2105.12915v3 [econ.TH] UPDATED)",
    "abstract": "This paper studies how violations of structural assumptions like expected utility and exponential discounting can be connected to rationality violations that arise from reference-dependent preferences, even if behavior is fully standard when the reference is fixed. A reference-dependent generalization of arbitrarily behavioral postulates captures changing preferences across choice domains. It gives rise to a linear order that endogenously determines reference alternatives, which in turn determines the preference parameters for a choice problem. With canonical models as backbones, preference changes are captured using known technologies like the concavity of utility functions and the levels of discount factors. The framework allows us to study risk, time, and social preferences collectively, where seemingly independent anomalies are interconnected through the lens of reference-dependent choice.",
    "link": "http://arxiv.org/abs/2105.12915",
    "context": "Title: Ordered Reference Dependent Choice. (arXiv:2105.12915v3 [econ.TH] UPDATED)\nAbstract: This paper studies how violations of structural assumptions like expected utility and exponential discounting can be connected to rationality violations that arise from reference-dependent preferences, even if behavior is fully standard when the reference is fixed. A reference-dependent generalization of arbitrarily behavioral postulates captures changing preferences across choice domains. It gives rise to a linear order that endogenously determines reference alternatives, which in turn determines the preference parameters for a choice problem. With canonical models as backbones, preference changes are captured using known technologies like the concavity of utility functions and the levels of discount factors. The framework allows us to study risk, time, and social preferences collectively, where seemingly independent anomalies are interconnected through the lens of reference-dependent choice.",
    "path": "papers/21/05/2105.12915.json",
    "total_tokens": 762,
    "translated_title": "有序的参考依赖性选择",
    "translated_abstract": "本文研究了结构假设（比如期望效用和指数折扣）的违反如何与源自参考依赖偏好的合理性违反相连接，即使行为在参考固定情况下完全标准。针对不同的选择领域，参考依赖的广义取代任意行为假设，并且产生内生地确定参考备选方案的线性顺序，进而确定选择问题的偏好参数。通过使用例如效用函数的凹性和折扣因子的级别等已知技术，可以捕捉偏好的变化。该框架允许我们集体研究风险、时间和社会偏好，其中看似独立的反常现象通过参考依赖选择的镜头相互连接。",
    "tldr": "本文研究了参考依赖性选择在捕捉风险、时间和社会偏好方面的应用，从而揭示了参考依赖性选择在标准行为假设中的内在依赖性。",
    "en_tdlr": "This paper investigates how reference-dependent choices can be used to capture preferences related to risk, time, and social factors, revealing the inherent dependence of reference-dependent choices in standard behavioral assumptions."
}