{
    "title": "Efficiently Solving High-Order and Nonlinear ODEs with Rational Fraction Polynomial: the Ratio Net",
    "abstract": "Recent advances in solving ordinary differential equations (ODEs) with neural networks have been remarkable. Neural networks excel at serving as trial functions and approximating solutions within functional spaces, aided by gradient backpropagation algorithms. However, challenges remain in solving complex ODEs, including high-order and nonlinear cases, emphasizing the need for improved efficiency and effectiveness. Traditional methods have typically relied on established knowledge integration to improve problem-solving efficiency. In contrast, this study takes a different approach by introducing a new neural network architecture for constructing trial functions, known as ratio net. This architecture draws inspiration from rational fraction polynomial approximation functions, specifically the Pade approximant. Through empirical trials, it demonstrated that the proposed method exhibits higher efficiency compared to existing approaches, including polynomial-based and multilayer perceptron",
    "link": "https://arxiv.org/abs/2105.11309",
    "context": "Title: Efficiently Solving High-Order and Nonlinear ODEs with Rational Fraction Polynomial: the Ratio Net\nAbstract: Recent advances in solving ordinary differential equations (ODEs) with neural networks have been remarkable. Neural networks excel at serving as trial functions and approximating solutions within functional spaces, aided by gradient backpropagation algorithms. However, challenges remain in solving complex ODEs, including high-order and nonlinear cases, emphasizing the need for improved efficiency and effectiveness. Traditional methods have typically relied on established knowledge integration to improve problem-solving efficiency. In contrast, this study takes a different approach by introducing a new neural network architecture for constructing trial functions, known as ratio net. This architecture draws inspiration from rational fraction polynomial approximation functions, specifically the Pade approximant. Through empirical trials, it demonstrated that the proposed method exhibits higher efficiency compared to existing approaches, including polynomial-based and multilayer perceptron",
    "path": "papers/21/05/2105.11309.json",
    "total_tokens": 829,
    "translated_title": "使用分式比多项式高效解决高阶和非线性常微分方程的研究: 分数神经网络",
    "translated_abstract": "最近使用神经网络解决常微分方程（ODE）的进展令人瞩目。神经网络在作为试探函数以及在函数空间内逼近解方面表现出色，并受梯度反向传播算法的帮助。然而，在解决复杂ODE的过程中仍然存在挑战，包括高阶和非线性情况，强调了提高效率和效果的需求。传统方法通常依赖于已有的知识集成来提高问题求解效率。相反，本研究采用了一种新的神经网络结构来构建试探函数，称为分数神经网络。该结构借鉴了分式比多项式逼近函数，特别是Pade逼近。通过实证试验，证明了该方法相比于现有方法，包括基于多项式和多层感知器的方法，具有更高的效率。",
    "tldr": "这项研究引入了一种新的神经网络结构——分数神经网络，用于解决高阶和非线性常微分方程。实证试验表明，该方法相比于现有方法，具有更高的效率。",
    "en_tdlr": "This study introduces a new neural network architecture, the \"ratio net\", for efficiently solving high-order and nonlinear ordinary differential equations. Empirical trials show that the proposed method outperforms existing approaches in terms of efficiency."
}