{
    "title": "Three Remarks On Asset Pricing. (arXiv:2105.13903v4 [econ.GN] UPDATED)",
    "abstract": "We consider the consumption-based asset pricing model, derive a new modified basic pricing equation, and present its successive approximations using the Taylor series expansions of the investor's utility during the averaging time interval. For linear and quadratic Taylor approximations, we derive new expressions for the mean price, mean payoff, volatility, skewness, and the asset's amount that define the maximum of the investor's utility. We discuss the market-based origin of price probability. We use volume weighted average price (VWAP) as a market-based average price and introduce market-based price volatility. The use of VWAP results in zero correlations between the price p and trade volume U. We derive a correlation between price p and squares of trade volume {U^2} and between squares of price {p^2} and volume {U^2}. To predict market-based price volatility, one should forecast the 2-d statistical moments of the market trade values and volumes at the same horizon T.",
    "link": "http://arxiv.org/abs/2105.13903",
    "context": "Title: Three Remarks On Asset Pricing. (arXiv:2105.13903v4 [econ.GN] UPDATED)\nAbstract: We consider the consumption-based asset pricing model, derive a new modified basic pricing equation, and present its successive approximations using the Taylor series expansions of the investor's utility during the averaging time interval. For linear and quadratic Taylor approximations, we derive new expressions for the mean price, mean payoff, volatility, skewness, and the asset's amount that define the maximum of the investor's utility. We discuss the market-based origin of price probability. We use volume weighted average price (VWAP) as a market-based average price and introduce market-based price volatility. The use of VWAP results in zero correlations between the price p and trade volume U. We derive a correlation between price p and squares of trade volume {U^2} and between squares of price {p^2} and volume {U^2}. To predict market-based price volatility, one should forecast the 2-d statistical moments of the market trade values and volumes at the same horizon T.",
    "path": "papers/21/05/2105.13903.json",
    "total_tokens": 1105,
    "translated_title": "《资产定价的三点备注》",
    "translated_abstract": "我们考虑了基于消费的资产定价模型，推导出一个新的修改基本定价方程，并使用投资者效用的泰勒级数展开来展示其逐次逼近过程。对于线性和二次泰勒逼近，我们推导出了均值价格、均值回报、波动率、偏度以及定义投资者效用最大值的资产数量的新表达式。我们讨论了价格概率的市场起源。我们使用加权平均价格(VWAP)作为基于市场的平均价格，并引入基于市场的价格波动率。使用VWAP导致价格p和交易量U之间的关联为零。我们推导出了价格p与交易量的平方{U^2}以及价格的平方{p^2}和交易量的平方{U^2}之间的相关性。要预测基于市场的价格波动率，需要在相同的预测时点预测市场交易值和交易量的二维统计矩。",
    "tldr": "该论文研究了基于消费的资产定价模型，在该模型中推导出了新的修改基本定价方程，利用泰勒级数展开逐次逼近投资者效用，并给出了线性和二次逼近的新表达式。此外，论文还讨论了价格概率的市场起源，并引入了基于市场的平均价格和价格波动率。研究发现使用加权平均价格导致价格和交易量之间的相关性为零，同时还发现了价格与交易量的平方以及价格的平方与交易量的平方之间存在相关性。最后，论文指出预测基于市场的价格波动率需要对市场交易值和交易量的二维统计矩进行预测。",
    "en_tdlr": "This paper explores the consumption-based asset pricing model and introduces a new modified pricing equation using Taylor series expansions. It derives expressions for mean price, mean payoff, volatility, skewness, and the asset's amount that define the investor's utility. The paper discusses the market-based origin of price probability and introduces market-based average price and price volatility. It shows that using volume weighted average price (VWAP) results in zero correlations between price and trade volume, but correlations exist between squared trade volume and price variables. To predict market-based price volatility, forecasting the 2-d statistical moments of market trade values and volumes is necessary."
}