{
    "title": "Neural network architectures using min-plus algebra for solving certain high dimensional optimal control problems and Hamilton-Jacobi PDEs. (arXiv:2105.03336v2 [math.OC] UPDATED)",
    "abstract": "Solving high dimensional optimal control problems and corresponding Hamilton-Jacobi PDEs are important but challenging problems in control engineering. In this paper, we propose two abstract neural network architectures which are respectively used to compute the value function and the optimal control for certain class of high dimensional optimal control problems. We provide the mathematical analysis for the two abstract architectures. We also show several numerical results computed using the deep neural network implementations of these abstract architectures. A preliminary implementation of our proposed neural network architecture on FPGAs shows promising speed up compared to CPUs. This work paves the way to leverage efficient dedicated hardware designed for neural networks to solve high dimensional optimal control problems and Hamilton-Jacobi PDEs.",
    "link": "http://arxiv.org/abs/2105.03336",
    "context": "Title: Neural network architectures using min-plus algebra for solving certain high dimensional optimal control problems and Hamilton-Jacobi PDEs. (arXiv:2105.03336v2 [math.OC] UPDATED)\nAbstract: Solving high dimensional optimal control problems and corresponding Hamilton-Jacobi PDEs are important but challenging problems in control engineering. In this paper, we propose two abstract neural network architectures which are respectively used to compute the value function and the optimal control for certain class of high dimensional optimal control problems. We provide the mathematical analysis for the two abstract architectures. We also show several numerical results computed using the deep neural network implementations of these abstract architectures. A preliminary implementation of our proposed neural network architecture on FPGAs shows promising speed up compared to CPUs. This work paves the way to leverage efficient dedicated hardware designed for neural networks to solve high dimensional optimal control problems and Hamilton-Jacobi PDEs.",
    "path": "papers/21/05/2105.03336.json",
    "total_tokens": 933,
    "translated_title": "使用min-plus代数的神经网络结构解决高维最优控制问题和哈密顿-雅可比偏微分方程",
    "translated_abstract": "解决高维最优控制问题及其对应的哈密顿-雅可比偏微分方程是控制工程中重要而具有挑战性的问题。本文提出了两种抽象的神经网络结构，分别用于计算某类高维最优控制问题的价值函数和最优控制。我们对这两种抽象结构进行了数学分析。我们还展示了使用这些抽象结构的深度神经网络实现计算的几个数值结果。我们在FPGA上对我们提出的神经网络结构进行了初步实现，证明其相对于CPU具有良好的加速效果。这项工作为利用专门为神经网络设计的高效专用硬件解决高维最优控制问题和哈密顿-雅可比偏微分方程铺平了道路。",
    "tldr": "本文提出了两种抽象的神经网络结构，用于计算某类高维最优控制问题的价值函数和最优控制。使用深度神经网络实现计算的几个数值结果也被展示了出来。同时，初步实现证明该神经网络结构相对于CPU具有良好的加速效果，为利用专门为神经网络设计的高效专用硬件解决高维最优控制问题和哈密顿-雅可比偏微分方程铺平了道路。",
    "en_tdlr": "This paper proposes two abstract neural network architectures for computing the value function and optimal control of high dimensional optimal control problems. Several numerical results computed using deep neural network implementations are presented, and a preliminary implementation on FPGAs demonstrates promising speed up. These findings pave the way for using efficient dedicated hardware to tackle high dimensional optimal control problems and Hamilton-Jacobi PDEs."
}