{
    "title": "A rigorous introduction to linear models",
    "abstract": "This book is meant to provide an introduction to linear models and the theories behind them. Our goal is to give a rigorous introduction to the readers with prior exposure to ordinary least squares. In machine learning, the output is usually a nonlinear function of the input. Deep learning even aims to find a nonlinear dependence with many layers, which require a large amount of computation. However, most of these algorithms build upon simple linear models. We then describe linear models from different perspectives and find the properties and theories behind the models. The linear model is the main technique in regression problems, and the primary tool for it is the least squares approximation, which minimizes a sum of squared errors. This is a natural choice when we're interested in finding the regression function which minimizes the corresponding expected squared error. This book is primarily a summary of purpose, significance of important theories behind linear models, e.g., distrib",
    "link": "https://arxiv.org/abs/2105.04240",
    "context": "Title: A rigorous introduction to linear models\nAbstract: This book is meant to provide an introduction to linear models and the theories behind them. Our goal is to give a rigorous introduction to the readers with prior exposure to ordinary least squares. In machine learning, the output is usually a nonlinear function of the input. Deep learning even aims to find a nonlinear dependence with many layers, which require a large amount of computation. However, most of these algorithms build upon simple linear models. We then describe linear models from different perspectives and find the properties and theories behind the models. The linear model is the main technique in regression problems, and the primary tool for it is the least squares approximation, which minimizes a sum of squared errors. This is a natural choice when we're interested in finding the regression function which minimizes the corresponding expected squared error. This book is primarily a summary of purpose, significance of important theories behind linear models, e.g., distrib",
    "path": "papers/21/05/2105.04240.json",
    "total_tokens": 815,
    "translated_title": "一个对线性模型进行严格介绍的书籍",
    "translated_abstract": "本书旨在向读者介绍线性模型及其背后的理论。我们的目标是为读者提供一个严谨的介绍，前提是读者具有普通最小二乘法的先前经验。在机器学习中，输出通常是输入的非线性函数。深度学习甚至旨在找到具有许多层的非线性依赖关系，这需要大量计算。然而，大多数算法都是基于简单的线性模型构建的。我们从不同的角度描述线性模型，找到模型背后的性质和理论。线性模型是回归问题中的主要技术，最主要的工具是最小二乘逼近，它最小化了平方误差的和。当我们有兴趣找到最小化相应的期望平方误差的回归函数时，这是一个自然的选择。本书主要总结了线性模型背后的目的和重要理论的意义，例如概率分布、推导和估计方法等等。",
    "tldr": "本书旨在向读者提供对线性模型及其理论的严格介绍，并总结了线性模型在回归问题中的重要性和应用。"
}