{
    "title": "Gait Characterization in Duchenne Muscular Dystrophy (DMD) Using a Single-Sensor Accelerometer: Classical Machine Learning and Deep Learning Approaches. (arXiv:2105.06295v3 [eess.SP] UPDATED)",
    "abstract": "Differences in gait patterns of children with Duchenne muscular dystrophy (DMD) and typically-developing (TD) peers are visible to the eye, but quantifications of those differences outside of the gait laboratory have been elusive. In this work, we measured vertical, mediolateral, and anteroposterior acceleration using a waist-worn iPhone accelerometer during ambulation across a typical range of velocities. Fifteen TD and fifteen DMD children from 3-16 years of age underwent eight walking/running activities, including five 25 meters walk/run speed-calibration tests at a slow walk to running speeds (SC-L1 to SC-L5), a 6-minute walk test (6MWT), a 100 meters fast-walk/jog/run (100MRW), and a free walk (FW). For clinical anchoring purposes, participants completed a Northstar Ambulatory Assessment (NSAA). We extracted temporospatial gait clinical features (CFs) and applied multiple machine learning (ML) approaches to differentiate between DMD and TD children using extracted temporospatial g",
    "link": "http://arxiv.org/abs/2105.06295",
    "context": "Title: Gait Characterization in Duchenne Muscular Dystrophy (DMD) Using a Single-Sensor Accelerometer: Classical Machine Learning and Deep Learning Approaches. (arXiv:2105.06295v3 [eess.SP] UPDATED)\nAbstract: Differences in gait patterns of children with Duchenne muscular dystrophy (DMD) and typically-developing (TD) peers are visible to the eye, but quantifications of those differences outside of the gait laboratory have been elusive. In this work, we measured vertical, mediolateral, and anteroposterior acceleration using a waist-worn iPhone accelerometer during ambulation across a typical range of velocities. Fifteen TD and fifteen DMD children from 3-16 years of age underwent eight walking/running activities, including five 25 meters walk/run speed-calibration tests at a slow walk to running speeds (SC-L1 to SC-L5), a 6-minute walk test (6MWT), a 100 meters fast-walk/jog/run (100MRW), and a free walk (FW). For clinical anchoring purposes, participants completed a Northstar Ambulatory Assessment (NSAA). We extracted temporospatial gait clinical features (CFs) and applied multiple machine learning (ML) approaches to differentiate between DMD and TD children using extracted temporospatial g",
    "path": "papers/21/05/2105.06295.json",
    "total_tokens": 1013,
    "translated_title": "使用单传感器加速度计对杜兴肌肉营养不良患者（DMD）的步态特征进行表征：传统机器学习和深度学习方法",
    "translated_abstract": "儿童杜兴肌肉营养不良患者（DMD）与正常发育的同龄人的步态模式存在明显差异，但在步态实验室之外对这些差异进行定量分析一直是困难的。本研究利用腰部佩戴的iPhone加速度计测量了垂直、左右和前后加速度，记录了DMD和正常儿童在典型速度范围内的行走情况。参与研究的三到十六岁的15名正常儿童和15名DMD患儿进行了八项步行/奔跑活动，包括五个25米走/跑速度校准测试（SC-L1到SC-L5）、6分钟步行试验（6MWT）、一百米快走/慢跑/跑步（100MRW）和自由行走（FW）。为了进行临床评估，参与者还完成了北方评估（NSAA）。我们提取了时空步态临床特征（CFs），并应用多种机器学习方法来区分DMD和正常儿童。",
    "tldr": "本研究使用单个加速度计对DMD患者和正常儿童的步态特征进行了比较，采取了传统机器学习和深度学习方法，从而实现了对两组之间的区分。"
}