{
    "title": "Learning Gaussian Graphical Models with Latent Confounders. (arXiv:2105.06600v2 [stat.ME] UPDATED)",
    "abstract": "Gaussian Graphical models (GGM) are widely used to estimate the network structures in many applications ranging from biology to finance. In practice, data is often corrupted by latent confounders which biases inference of the underlying true graphical structure. In this paper, we compare and contrast two strategies for inference in graphical models with latent confounders: Gaussian graphical models with latent variables (LVGGM) and PCA-based removal of confounding (PCA+GGM). While these two approaches have similar goals, they are motivated by different assumptions about confounding. In this paper, we explore the connection between these two approaches and propose a new method, which combines the strengths of these two approaches. We prove the consistency and convergence rate for the PCA-based method and use these results to provide guidance about when to use each method. We demonstrate the effectiveness of our methodology using both simulations and in two real-world applications.",
    "link": "http://arxiv.org/abs/2105.06600",
    "context": "Title: Learning Gaussian Graphical Models with Latent Confounders. (arXiv:2105.06600v2 [stat.ME] UPDATED)\nAbstract: Gaussian Graphical models (GGM) are widely used to estimate the network structures in many applications ranging from biology to finance. In practice, data is often corrupted by latent confounders which biases inference of the underlying true graphical structure. In this paper, we compare and contrast two strategies for inference in graphical models with latent confounders: Gaussian graphical models with latent variables (LVGGM) and PCA-based removal of confounding (PCA+GGM). While these two approaches have similar goals, they are motivated by different assumptions about confounding. In this paper, we explore the connection between these two approaches and propose a new method, which combines the strengths of these two approaches. We prove the consistency and convergence rate for the PCA-based method and use these results to provide guidance about when to use each method. We demonstrate the effectiveness of our methodology using both simulations and in two real-world applications.",
    "path": "papers/21/05/2105.06600.json",
    "total_tokens": 887,
    "translated_title": "学习具有潜在混淆因素的高斯图模型",
    "translated_abstract": "高斯图模型（GGM）被广泛应用于估计从生物学到金融等多个领域中的网络结构。在实践中，数据往往被潜在的混淆因素损坏，从而影响对真实图结构的推断。本文比较并对比了两种处理具有潜在混淆因素的图模型的策略：具有潜变量的高斯图模型（LVGGM）和基于主成分分析的混淆去除方法（PCA+GGM）。尽管这两种方法有着类似的目标，但它们是基于不同的混淆假设进行推导的。本文探讨了这两种方法之间的关系，并提出了一种结合了两种方法优势的新方法。我们证明了基于主成分分析的方法的一致性和收敛速度，并利用这些结果提供了何时使用每种方法的指导。通过模拟和两个真实世界应用，我们验证了我们方法的有效性。",
    "tldr": "本文比较了两种处理具有潜在混淆因素的图模型的方法，并提出了一种结合了这两种方法优势的新方法。作者通过理论和实证研究证明了这种方法的可行性和有效性。",
    "en_tdlr": "This paper compares and contrasts two strategies for inference in graphical models with latent confounders and proposes a new method that combines their strengths. The authors prove the feasibility and effectiveness of this method through theoretical and empirical studies."
}