{
    "title": "Criterion-based Heterogeneous Collaborative Filtering for Multi-behavior Implicit Recommendation. (arXiv:2105.11876v3 [cs.IR] UPDATED)",
    "abstract": "Recent years have witnessed the explosive growth of interaction behaviors in multimedia information systems, where multi-behavior recommender systems have received increasing attention by leveraging data from various auxiliary behaviors such as tip and collect. Among various multi-behavior recommendation methods, non-sampling methods have shown superiority over negative sampling methods. However, two observations are usually ignored in existing state-of-the-art non-sampling methods based on binary regression: (1) users have different preference strengths for different items, so they cannot be measured simply by binary implicit data; (2) the dependency across multiple behaviors varies for different users and items. To tackle the above issue, we propose a novel non-sampling learning framework named Criterion-guided Heterogeneous Collaborative Filtering (CHCF). CHCF introduces both upper and lower thresholds to indicate selection criteria, which will guide user preference learning. Beside",
    "link": "http://arxiv.org/abs/2105.11876",
    "context": "Title: Criterion-based Heterogeneous Collaborative Filtering for Multi-behavior Implicit Recommendation. (arXiv:2105.11876v3 [cs.IR] UPDATED)\nAbstract: Recent years have witnessed the explosive growth of interaction behaviors in multimedia information systems, where multi-behavior recommender systems have received increasing attention by leveraging data from various auxiliary behaviors such as tip and collect. Among various multi-behavior recommendation methods, non-sampling methods have shown superiority over negative sampling methods. However, two observations are usually ignored in existing state-of-the-art non-sampling methods based on binary regression: (1) users have different preference strengths for different items, so they cannot be measured simply by binary implicit data; (2) the dependency across multiple behaviors varies for different users and items. To tackle the above issue, we propose a novel non-sampling learning framework named Criterion-guided Heterogeneous Collaborative Filtering (CHCF). CHCF introduces both upper and lower thresholds to indicate selection criteria, which will guide user preference learning. Beside",
    "path": "papers/21/05/2105.11876.json",
    "total_tokens": 868,
    "translated_title": "基于准则的多行为隐式推荐的异构协同过滤",
    "translated_abstract": "近年来，多媒体信息系统中的互动行为呈爆炸式增长，利用来自各种辅助行为（如提示和收藏）的数据，多行为推荐系统受到越来越多的关注。在各种多行为推荐方法中，非采样方法表现优于负采样方法。然而，现有的基于二进制回归的非采样方法通常忽略了两点观察：（1）用户对不同项目具有不同的偏好强度，因此不能简单通过二进制隐式数据来衡量；（2）多个行为之间的依赖关系对不同的用户和项目是不同的。为了解决上述问题，我们提出了一种新的非采样学习框架，命名为基于准则的异构协同过滤（CHCF）。CHCF引入了上限和下限阈值来指示选择标准，并指导用户偏好学习。",
    "tldr": "提出了一种基于准则的非采样学习框架，命名为CHCF，用于多行为隐式推荐的异构协同过滤。该方法通过引入上限和下限阈值来指示选择标准，并指导用户偏好学习。"
}