{
    "title": "Adaptive Filters in Graph Convolutional Neural Networks. (arXiv:2105.10377v4 [cs.LG] UPDATED)",
    "abstract": "Over the last few years, we have witnessed the availability of an increasing data generated from non-Euclidean domains, which are usually represented as graphs with complex relationships, and Graph Neural Networks (GNN) have gained a high interest because of their potential in processing graph-structured data. In particular, there is a strong interest in exploring the possibilities in performing convolution on graphs using an extension of the GNN architecture, generally referred to as Graph Convolutional Neural Networks (ConvGNN). Convolution on graphs has been achieved mainly in two forms: spectral and spatial convolutions. Due to the higher flexibility in exploring and exploiting the graph structure of data, there is recently an increasing interest in investigating the possibilities that the spatial approach can offer. The idea of finding a way to adapt the network behaviour to the inputs they process to maximize the total performances has aroused much interest in the neural networks",
    "link": "http://arxiv.org/abs/2105.10377",
    "context": "Title: Adaptive Filters in Graph Convolutional Neural Networks. (arXiv:2105.10377v4 [cs.LG] UPDATED)\nAbstract: Over the last few years, we have witnessed the availability of an increasing data generated from non-Euclidean domains, which are usually represented as graphs with complex relationships, and Graph Neural Networks (GNN) have gained a high interest because of their potential in processing graph-structured data. In particular, there is a strong interest in exploring the possibilities in performing convolution on graphs using an extension of the GNN architecture, generally referred to as Graph Convolutional Neural Networks (ConvGNN). Convolution on graphs has been achieved mainly in two forms: spectral and spatial convolutions. Due to the higher flexibility in exploring and exploiting the graph structure of data, there is recently an increasing interest in investigating the possibilities that the spatial approach can offer. The idea of finding a way to adapt the network behaviour to the inputs they process to maximize the total performances has aroused much interest in the neural networks",
    "path": "papers/21/05/2105.10377.json",
    "total_tokens": 838,
    "translated_title": "图卷积神经网络中的自适应滤波器",
    "translated_abstract": "在过去的几年中，我们目睹了非欧几里得领域产生的越来越多的数据可用性，这些领域通常以复杂关系表示为图形，图神经网络 (GNN) 由于在处理图结构数据时的潜力而引起了高度关注。特别地，人们对使用 GNN 架构的扩展来在图上进行卷积的可能性非常感兴趣，这个架构通常被称为图卷积神经网络 (ConvGNN)。在图上的卷积主要分为频谱卷积和空间卷积两种形式。由于在探索和利用数据的图结构方面更加灵活，最近对于研究空间方法所能提供的可能性越来越感兴趣。找到一种适应处理输入的网络行为的方法，以最大化总体性能的想法，在神经网络中引起了广泛的兴趣。",
    "tldr": "该论文研究了自适应滤波器在图卷积神经网络中的应用，通过探索和利用图结构的灵活性，提高了网络处理图数据的性能。"
}