{
    "title": "Few-shot Partial Multi-view Learning. (arXiv:2105.02046v4 [cs.CV] UPDATED)",
    "abstract": "It is often the case that data are with multiple views in real-world applications. Fully exploring the information of each view is significant for making data more representative. However, due to various limitations and failures in data collection and pre-processing, it is inevitable for real data to suffer from view missing and data scarcity. The coexistence of these two issues makes it more challenging to achieve the pattern classification task. Currently, to our best knowledge, few appropriate methods can well-handle these two issues simultaneously. Aiming to draw more attention from the community to this challenge, we propose a new task in this paper, called few-shot partial multi-view learning, which focuses on overcoming the negative impact of the view-missing issue in the low-data regime. The challenges of this task are twofold: (i) it is difficult to overcome the impact of data scarcity under the interference of missing views; (ii) the limited number of data exacerbates informa",
    "link": "http://arxiv.org/abs/2105.02046",
    "context": "Title: Few-shot Partial Multi-view Learning. (arXiv:2105.02046v4 [cs.CV] UPDATED)\nAbstract: It is often the case that data are with multiple views in real-world applications. Fully exploring the information of each view is significant for making data more representative. However, due to various limitations and failures in data collection and pre-processing, it is inevitable for real data to suffer from view missing and data scarcity. The coexistence of these two issues makes it more challenging to achieve the pattern classification task. Currently, to our best knowledge, few appropriate methods can well-handle these two issues simultaneously. Aiming to draw more attention from the community to this challenge, we propose a new task in this paper, called few-shot partial multi-view learning, which focuses on overcoming the negative impact of the view-missing issue in the low-data regime. The challenges of this task are twofold: (i) it is difficult to overcome the impact of data scarcity under the interference of missing views; (ii) the limited number of data exacerbates informa",
    "path": "papers/21/05/2105.02046.json",
    "total_tokens": 814,
    "translated_title": "少样本部分多视角学习",
    "translated_abstract": "在现实世界中，数据往往具有多个视角，充分利用每个视角的信息对于使数据更具代表性很重要。然而，由于数据收集和预处理中的各种限制和失误，真实数据遭受视角缺失和数据稀缺是不可避免的。这两个问题的共存使得实现模式分类任务更具挑战性。目前，据我们所知，很少有适当的方法可以同时处理这两个问题。为了引起学术界对这一挑战的更多关注，本文提出了一个新的任务，称为少样本部分多视角学习，专注于克服低数据环境下视角缺失问题的负面影响。此任务的挑战有两个方面：（i）难以在缺失视角的干扰下克服数据稀缺的影响；（ii）有限的数据量加剧了信息的稀缺。",
    "tldr": "本文提出了一个新任务——少样本部分多视角学习，旨在克服低数据环境下视角缺失问题的影响。",
    "en_tdlr": "This paper proposes a new task - few-shot partial multi-view learning, aiming to overcome the negative impact of the view-missing issue in the low-data regime."
}