{
    "title": "Identifying Wisdom (of the Crowd): A Regression Approach. (arXiv:2105.07097v2 [econ.TH] UPDATED)",
    "abstract": "Experts in a population hold (a) beliefs over a state (call these state beliefs), as well as (b) beliefs over the distribution of beliefs in the population (call these hypothetical beliefs). If these are generated via updating a common prior using a fixed information structure, then the information structure can (generically) be derived by regressing hypothetical beliefs on state beliefs, provided there are at least as many signals as states. In addition, the prior solves an eigenvector equation derived from a matrix determined by the state beliefs and the hypothetical beliefs. Thus, the ex-ante informational environment (i.e., how signals are generated) can be determined using ex-post data (i.e., the beliefs in the population). I discuss implications of this finding, as well as what is identified when there are more states than signals.",
    "link": "http://arxiv.org/abs/2105.07097",
    "context": "Title: Identifying Wisdom (of the Crowd): A Regression Approach. (arXiv:2105.07097v2 [econ.TH] UPDATED)\nAbstract: Experts in a population hold (a) beliefs over a state (call these state beliefs), as well as (b) beliefs over the distribution of beliefs in the population (call these hypothetical beliefs). If these are generated via updating a common prior using a fixed information structure, then the information structure can (generically) be derived by regressing hypothetical beliefs on state beliefs, provided there are at least as many signals as states. In addition, the prior solves an eigenvector equation derived from a matrix determined by the state beliefs and the hypothetical beliefs. Thus, the ex-ante informational environment (i.e., how signals are generated) can be determined using ex-post data (i.e., the beliefs in the population). I discuss implications of this finding, as well as what is identified when there are more states than signals.",
    "path": "papers/21/05/2105.07097.json",
    "total_tokens": 796,
    "translated_title": "确定“众人的智慧”：一种回归方法",
    "translated_abstract": "人群中的专家有对一个状态的信仰（称之为空间信念），还有关于人群信仰分布的信念（称之为假设信念）。如果这些信念通过使用固定信息结构更新一个共同先验来生成，那么只要有至少与状态一样多的信号，就可以从对状态信念回归假设信念来推导出信息结构（通常）。此外，先验解决了由状态信念和假设信念确定的矩阵派生的特征向量方程。因此，可以使用人群的信仰（即，如何生成信号）的后验数据来确定先前的信息环境。讨论了当状态数量超过信号数量时的影响。",
    "tldr": "本文介绍了一种基于回归方法的“众人的智慧”确定方式，通过对状态信仰和假设信仰的回归关系进行分析，可以推导出信息结构，从而确定先前的信息环境。",
    "en_tdlr": "This paper proposes a regression approach for identifying the \"wisdom of the crowd\", which can derive the information structure by regressing hypothetical beliefs on state beliefs based on a fixed information structure. It can determine the ex-ante informational environment from ex-post data, and the implications of this finding are discussed."
}