{
    "title": "Trading-off Bias and Variance in Stratified Experiments and in Matching Studies, Under a Boundedness Condition on the Magnitude of the Treatment Effect. (arXiv:2105.08766v6 [econ.EM] UPDATED)",
    "abstract": "I consider estimation of the average treatment effect (ATE), in a population composed of $S$ groups or units, when one has unbiased estimators of each group's conditional average treatment effect (CATE). These conditions are met in stratified experiments and in matching studies. I assume that each CATE is bounded in absolute value by $B$ standard deviations of the outcome, for some known $B$. This restriction may be appealing: outcomes are often standardized in applied work, so researchers can use available literature to determine a plausible value for $B$. I derive, across all linear combinations of the CATEs' estimators, the minimax estimator of the ATE. In two stratified experiments, my estimator has twice lower worst-case mean-squared-error than the commonly-used strata-fixed effects estimator. In a matching study with limited overlap, my estimator achieves 56\\% of the precision gains of a commonly-used trimming estimator, and has an 11 times smaller worst-case mean-squared-error.",
    "link": "http://arxiv.org/abs/2105.08766",
    "context": "Title: Trading-off Bias and Variance in Stratified Experiments and in Matching Studies, Under a Boundedness Condition on the Magnitude of the Treatment Effect. (arXiv:2105.08766v6 [econ.EM] UPDATED)\nAbstract: I consider estimation of the average treatment effect (ATE), in a population composed of $S$ groups or units, when one has unbiased estimators of each group's conditional average treatment effect (CATE). These conditions are met in stratified experiments and in matching studies. I assume that each CATE is bounded in absolute value by $B$ standard deviations of the outcome, for some known $B$. This restriction may be appealing: outcomes are often standardized in applied work, so researchers can use available literature to determine a plausible value for $B$. I derive, across all linear combinations of the CATEs' estimators, the minimax estimator of the ATE. In two stratified experiments, my estimator has twice lower worst-case mean-squared-error than the commonly-used strata-fixed effects estimator. In a matching study with limited overlap, my estimator achieves 56\\% of the precision gains of a commonly-used trimming estimator, and has an 11 times smaller worst-case mean-squared-error.",
    "path": "papers/21/05/2105.08766.json",
    "total_tokens": 1052,
    "translated_title": "在具有效应大小有界条件下，权衡分层实验和配对研究中的偏差与方差",
    "translated_abstract": "本研究考虑在由S组或个体组成的总体中估计平均处理效应(ATE)，当我们对每个组的条件平均处理效应(CATE)有无偏估计时，这些条件在分层实验和配对研究中得到满足。我们假设每个CATE的绝对值都由某个已知的B倍标准差的结果来限制。这一限制可能具有吸引力：在应用研究中，结果通常是标准化的，因此研究人员可以利用现有文献来确定B的一个合理值。我们推导出在所有CATE的估计器的线性组合中的ATE的极小极大估计器。在两个分层实验中，我的估计器的最坏情况均方误差比常用的分层固定效应估计器降低了一半。在一个具有有限重叠的配对研究中，我的估计器达到了常用的修剪估计器精度增益的56%，并且具有11倍更小的最坏情况均方误差。",
    "tldr": "本研究提出了一种在分层实验和配对研究中，通过权衡偏差与方差的方法，在满足效应大小有界条件下估计平均处理效应。该方法在两个分层实验中具有更好的估计性能，并在具有有限重叠的配对研究中实现了较高的精确度和较小的均方误差。",
    "en_tdlr": "This study proposes a method to estimate the average treatment effect by balancing bias and variance in stratified experiments and matching studies, under a boundedness condition on the magnitude of the treatment effect. The method outperforms the commonly-used estimators in two stratified experiments and achieves higher precision and smaller mean-squared-error in a matching study with limited overlap."
}