{
    "title": "Machine Collaboration",
    "abstract": "We propose a new ensemble framework for supervised learning, called machine collaboration (MaC), using a collection of base machines for prediction tasks. Unlike bagging/stacking (a parallel & independent framework) and boosting (a sequential & top-down framework), MaC is a type of circular & interactive learning framework. The circular & interactive feature helps the base machines to transfer information circularly and update their structures and parameters accordingly. The theoretical result on the risk bound of the estimator from MaC reveals that the circular & interactive feature can help MaC reduce risk via a parsimonious ensemble. We conduct extensive experiments on MaC using both simulated data and 119 benchmark real datasets. The results demonstrate that in most cases, MaC performs significantly better than several other state-of-the-art methods, including classification and regression trees, neural networks, stacking, and boosting.",
    "link": "https://arxiv.org/abs/2105.02569",
    "context": "Title: Machine Collaboration\nAbstract: We propose a new ensemble framework for supervised learning, called machine collaboration (MaC), using a collection of base machines for prediction tasks. Unlike bagging/stacking (a parallel & independent framework) and boosting (a sequential & top-down framework), MaC is a type of circular & interactive learning framework. The circular & interactive feature helps the base machines to transfer information circularly and update their structures and parameters accordingly. The theoretical result on the risk bound of the estimator from MaC reveals that the circular & interactive feature can help MaC reduce risk via a parsimonious ensemble. We conduct extensive experiments on MaC using both simulated data and 119 benchmark real datasets. The results demonstrate that in most cases, MaC performs significantly better than several other state-of-the-art methods, including classification and regression trees, neural networks, stacking, and boosting.",
    "path": "papers/21/05/2105.02569.json",
    "total_tokens": 845,
    "translated_title": "机器协作",
    "translated_abstract": "我们提出了一种新的监督学习集成框架，称为机器协作（MaC），利用一组基础机器进行预测任务。与并行且独立的bagging/stacking框架和顺序且自上而下的boosting框架不同，MaC是一种循环和交互学习框架。循环和交互特性帮助基础机器循环传递信息并相应地更新其结构和参数。对于从MaC得出的估计器的风险界的理论结果表明，循环和交互特性可以帮助MaC通过简洁的集成减少风险。我们在模拟数据和119个基准真实数据集上进行了大量实验证明，在大多数情况下，MaC的性能显著优于包括分类回归树、神经网络、堆叠和提升在内的其他几种最先进的方法。",
    "tldr": "本文提出了一种新的监督学习集成框架——机器协作（MaC），通过循环和交互的学习方式，使基础机器能够循环传递信息并相应地更新结构和参数。实验证明，MaC在大多数情况下表现优于其他先进方法。",
    "en_tdlr": "This paper presents a new supervised learning ensemble framework called Machine Collaboration (MaC), which uses a circular and interactive learning approach to enable base machines to transfer information and update their structures and parameters. Experimental results show that MaC outperforms other state-of-the-art methods in most cases."
}