{
    "title": "Proximal Causal Learning with Kernels: Two-Stage Estimation and Moment Restriction. (arXiv:2105.04544v7 [cs.LG] UPDATED)",
    "abstract": "We address the problem of causal effect estimation in the presence of unobserved confounding, but where proxies for the latent confounder(s) are observed. We propose two kernel-based methods for nonlinear causal effect estimation in this setting: (a) a two-stage regression approach, and (b) a maximum moment restriction approach. We focus on the proximal causal learning setting, but our methods can be used to solve a wider class of inverse problems characterised by a Fredholm integral equation. In particular, we provide a unifying view of two-stage and moment restriction approaches for solving this problem in a nonlinear setting. We provide consistency guarantees for each algorithm, and we demonstrate these approaches achieve competitive results on synthetic data and data simulating a real-world task. In particular, our approach outperforms earlier methods that are not suited to leveraging proxy variables.",
    "link": "http://arxiv.org/abs/2105.04544",
    "context": "Title: Proximal Causal Learning with Kernels: Two-Stage Estimation and Moment Restriction. (arXiv:2105.04544v7 [cs.LG] UPDATED)\nAbstract: We address the problem of causal effect estimation in the presence of unobserved confounding, but where proxies for the latent confounder(s) are observed. We propose two kernel-based methods for nonlinear causal effect estimation in this setting: (a) a two-stage regression approach, and (b) a maximum moment restriction approach. We focus on the proximal causal learning setting, but our methods can be used to solve a wider class of inverse problems characterised by a Fredholm integral equation. In particular, we provide a unifying view of two-stage and moment restriction approaches for solving this problem in a nonlinear setting. We provide consistency guarantees for each algorithm, and we demonstrate these approaches achieve competitive results on synthetic data and data simulating a real-world task. In particular, our approach outperforms earlier methods that are not suited to leveraging proxy variables.",
    "path": "papers/21/05/2105.04544.json",
    "total_tokens": 860,
    "translated_title": "带有核函数的近因果学习：两阶段估计与矩限制",
    "translated_abstract": "我们解决了存在未观测混淆，但同时观测到潜在混淆代理的因果效应估计问题。我们提出了两种基于核函数的非线性因果效应估计方法：（a）两阶段回归方法和（b）最大矩限制方法。我们关注近因果学习设置，但我们的方法可以用于解决由Fredholm积分方程表征的更广泛类别的反问题。特别地，我们为解决非线性设置中的该问题提供了两阶段和矩限制方法的统一视角。每个算法都提供了一致性保证，并且我们证明这些方法在合成数据和模拟真实世界任务的数据上都可以获得有竞争力的结果。特别地，我们的方法胜过了早期不能利用代理变量的方法。",
    "tldr": "本论文提出了两种基于核函数的方法，用于解决存在未观测混淆，但同时观测到混淆代理的因果效应估计问题。这些方法在合成数据和模拟真实世界任务的数据上都可以获得有竞争力的结果。",
    "en_tdlr": "This paper proposes two kernel-based methods for estimating causal effects in the presence of unobserved confounding, but where proxies for the latent confounder(s) are observed. The methods achieve competitive results on synthetic data and data simulating a real-world task."
}