{
    "title": "Weak equilibria for time-inconsistent control: with applications to investment-withdrawal decisions. (arXiv:2105.06607v4 [math.OC] UPDATED)",
    "abstract": "This paper considers time-inconsistent problems when control and stopping strategies are required to be made simultaneously (called stopping control problems by us). We first formulate the timeinconsistent stopping control problems under general multi-dimensional controlled diffusion model and propose a formal definition of their equilibria. We show that an admissible pair $(\\hat{u},C)$ of controlstopping policy is equilibrium if and only if the auxiliary function associated with it solves the extended HJB system, providing a methodology to verify or exclude equilibrium solutions. We provide several examples to illustrate applications to mathematical finance and control theory. For a problem whose reward function endogenously depends on the current wealth, the equilibrium is explicitly obtained. For another model with a non-exponential discount, we prove that any constant proportion strategy can not be equilibrium. We further show that general non-constant equilibrium exists and is des",
    "link": "http://arxiv.org/abs/2105.06607",
    "context": "Title: Weak equilibria for time-inconsistent control: with applications to investment-withdrawal decisions. (arXiv:2105.06607v4 [math.OC] UPDATED)\nAbstract: This paper considers time-inconsistent problems when control and stopping strategies are required to be made simultaneously (called stopping control problems by us). We first formulate the timeinconsistent stopping control problems under general multi-dimensional controlled diffusion model and propose a formal definition of their equilibria. We show that an admissible pair $(\\hat{u},C)$ of controlstopping policy is equilibrium if and only if the auxiliary function associated with it solves the extended HJB system, providing a methodology to verify or exclude equilibrium solutions. We provide several examples to illustrate applications to mathematical finance and control theory. For a problem whose reward function endogenously depends on the current wealth, the equilibrium is explicitly obtained. For another model with a non-exponential discount, we prove that any constant proportion strategy can not be equilibrium. We further show that general non-constant equilibrium exists and is des",
    "path": "papers/21/05/2105.06607.json",
    "total_tokens": 873,
    "translated_title": "时间不一致控制的弱平衡：在投资撤回决策中的应用",
    "translated_abstract": "本文考虑了控制和停止策略需要同时制定（我们称之为停止控制问题）的时间不一致问题。我们首先在一般的多维控制扩散模型下制定了时间不一致的停止控制问题，并提出了其平衡的正式定义。我们证明了一个可接受的控制停止策略对是平衡的，当且仅当与其相关的辅助函数解决了扩展HJB系统，从而提供了一种验证或排除平衡解的方法。我们提供了几个示例来说明在数学金融和控制理论中的应用。对于一个奖励函数的问题，其内在依赖于当前财富，平衡是明确得到的。对于另一个具有非指数贴现率的模型，我们证明了任何恒定比例策略都不能成为平衡解。我们进一步证明了一般非常数平衡的存在性和性质。",
    "tldr": "该论文提出了一种解决时间不一致控制问题的方法，通过定义平衡条件以及相应的验证方法来验证平衡解，并在数学金融和控制理论中提供了实际应用的例子。",
    "en_tdlr": "This paper proposes a method to solve time-inconsistent control problems, verifying equilibrium solutions by defining equilibrium conditions and providing corresponding verification methods, and provides practical examples of applications in mathematical finance and control theory."
}