{
    "title": "Privacy-Preserving Constrained Domain Generalization for Medical Image Classification. (arXiv:2105.08511v2 [cs.LG] UPDATED)",
    "abstract": "Deep neural networks (DNN) have demonstrated unprecedented success for medical imaging applications. However, due to the issue of limited dataset availability and the strict legal and ethical requirements for patient privacy protection, the broad applications of medical imaging classification driven by DNN with large-scale training data have been largely hindered. For example, when training the DNN from one domain (e.g., with data only from one hospital), the generalization capability to another domain (e.g., data from another hospital) could be largely lacking. In this paper, we aim to tackle this problem by developing the privacy-preserving constrained domain generalization method, aiming to improve the generalization capability under the privacy-preserving condition. In particular, We propose to improve the information aggregation process on the centralized server-side with a novel gradient alignment loss, expecting that the trained model can be better generalized to the \"unseen\" bu",
    "link": "http://arxiv.org/abs/2105.08511",
    "context": "Title: Privacy-Preserving Constrained Domain Generalization for Medical Image Classification. (arXiv:2105.08511v2 [cs.LG] UPDATED)\nAbstract: Deep neural networks (DNN) have demonstrated unprecedented success for medical imaging applications. However, due to the issue of limited dataset availability and the strict legal and ethical requirements for patient privacy protection, the broad applications of medical imaging classification driven by DNN with large-scale training data have been largely hindered. For example, when training the DNN from one domain (e.g., with data only from one hospital), the generalization capability to another domain (e.g., data from another hospital) could be largely lacking. In this paper, we aim to tackle this problem by developing the privacy-preserving constrained domain generalization method, aiming to improve the generalization capability under the privacy-preserving condition. In particular, We propose to improve the information aggregation process on the centralized server-side with a novel gradient alignment loss, expecting that the trained model can be better generalized to the \"unseen\" bu",
    "path": "papers/21/05/2105.08511.json",
    "total_tokens": 809,
    "translated_title": "面向医学图像分类的隐私保护约束域泛化",
    "translated_abstract": "深度神经网络在医学影像应用中取得了前所未有的成功。然而，由于数据集有限和对患者隐私保护的严格法律和伦理要求，由大规模训练数据驱动的深度神经网络在医学影像分类的广泛应用受到了很大阻碍。在这篇论文中，我们旨在通过开发隐私保护约束域泛化方法来解决这个问题，以在隐私保护条件下提高泛化能力。具体而言，我们提出了一种新的梯度对齐损失，以改善集中式服务器端的信息聚合过程，期望训练的模型可以更好地泛化到“未见过”的数据。",
    "tldr": "该论文提出了一种隐私保护约束域泛化的方法，通过改进信息聚合过程来提高模型的泛化能力，并解决了由于数据隐私保护问题导致的医学影像分类的挑战。"
}