{
    "title": "Improving Semiconductor Device Modeling for Electronic Design Automation by Machine Learning Techniques. (arXiv:2105.11453v2 [cs.LG] UPDATED)",
    "abstract": "The semiconductors industry benefits greatly from the integration of Machine Learning (ML)-based techniques in Technology Computer-Aided Design (TCAD) methods. The performance of ML models however relies heavily on the quality and quantity of training datasets. They can be particularly difficult to obtain in the semiconductor industry due to the complexity and expense of the device fabrication. In this paper, we propose a self-augmentation strategy for improving ML-based device modeling using variational autoencoder-based techniques. These techniques require a small number of experimental data points and does not rely on TCAD tools. To demonstrate the effectiveness of our approach, we apply it to a deep neural network-based prediction task for the Ohmic resistance value in Gallium Nitride devices. A 70% reduction in mean absolute error when predicting experimental results is achieved. The inherent flexibility of our approach allows easy adaptation to various tasks, thus making it highl",
    "link": "http://arxiv.org/abs/2105.11453",
    "context": "Title: Improving Semiconductor Device Modeling for Electronic Design Automation by Machine Learning Techniques. (arXiv:2105.11453v2 [cs.LG] UPDATED)\nAbstract: The semiconductors industry benefits greatly from the integration of Machine Learning (ML)-based techniques in Technology Computer-Aided Design (TCAD) methods. The performance of ML models however relies heavily on the quality and quantity of training datasets. They can be particularly difficult to obtain in the semiconductor industry due to the complexity and expense of the device fabrication. In this paper, we propose a self-augmentation strategy for improving ML-based device modeling using variational autoencoder-based techniques. These techniques require a small number of experimental data points and does not rely on TCAD tools. To demonstrate the effectiveness of our approach, we apply it to a deep neural network-based prediction task for the Ohmic resistance value in Gallium Nitride devices. A 70% reduction in mean absolute error when predicting experimental results is achieved. The inherent flexibility of our approach allows easy adaptation to various tasks, thus making it highl",
    "path": "papers/21/05/2105.11453.json",
    "total_tokens": 934,
    "translated_title": "利用机器学习技术改进半导体器件建模的电子设计自动化",
    "translated_abstract": "机器学习（ML）技术在技术计算机辅助设计（TCAD）方法中的应用对半导体行业有很大的益处。然而，ML模型的性能在很大程度上依赖于训练数据集的质量和数量。由于器件制造的复杂性和成本，这些数据集在半导体行业中很难获得。本文提出一种自我增强策略，利用变分自编码器（VAE）技术改进基于ML的器件建模。这些技术只需要少量实验数据点，并且不依赖于TCAD工具。为了证明我们的方法的有效性，我们将其应用于镓氮器件中欧姆电阻值的深度神经网络预测任务。在预测实验结果时，平均绝对误差降低了70%。我们的方法具有固有的灵活性，可以轻松适应各种任务，因此具有广泛应用价值。",
    "tldr": "本文提出一种利用机器学习技术改进半导体器件建模的方法，通过自我增强策略和变分自编码器技术，只需少量实验数据点即可实现高精度预测，有效降低平均绝对误差，具有广泛应用价值。",
    "en_tdlr": "This paper proposes a method to improve semiconductor device modeling using machine learning techniques through self-augmentation strategy and variational autoencoder-based techniques with high accuracy prediction achieved by a small number of experimental data points, thus reducing the mean absolute error effectively. The inherent flexibility of this approach allows it to be highly applicable to various tasks."
}