{
    "title": "Generative Network-Based Reduced-Order Model for Prediction, Data Assimilation and Uncertainty Quantification. (arXiv:2105.13859v4 [cs.LG] UPDATED)",
    "abstract": "We propose a new method in which a generative network (GN) integrate into a reduced-order model (ROM) framework is used to solve inverse problems for partial differential equations (PDE). The aim is to match available measurements and estimate the corresponding uncertainties associated with the states and parameters of a numerical physical simulation. The GN is trained using only unconditional simulations of the discretized PDE model. We compare the proposed method with the golden standard Markov chain Monte Carlo. We apply the proposed approaches to a spatio-temporal compartmental model in epidemiology. The results show that the proposed GN-based ROM can efficiently quantify uncertainty and accurately match the measurements and the golden standard, using only a few unconditional simulations of the full-order numerical PDE model.",
    "link": "http://arxiv.org/abs/2105.13859",
    "context": "Title: Generative Network-Based Reduced-Order Model for Prediction, Data Assimilation and Uncertainty Quantification. (arXiv:2105.13859v4 [cs.LG] UPDATED)\nAbstract: We propose a new method in which a generative network (GN) integrate into a reduced-order model (ROM) framework is used to solve inverse problems for partial differential equations (PDE). The aim is to match available measurements and estimate the corresponding uncertainties associated with the states and parameters of a numerical physical simulation. The GN is trained using only unconditional simulations of the discretized PDE model. We compare the proposed method with the golden standard Markov chain Monte Carlo. We apply the proposed approaches to a spatio-temporal compartmental model in epidemiology. The results show that the proposed GN-based ROM can efficiently quantify uncertainty and accurately match the measurements and the golden standard, using only a few unconditional simulations of the full-order numerical PDE model.",
    "path": "papers/21/05/2105.13859.json",
    "total_tokens": 819,
    "translated_title": "基于生成网络的降阶模型用于预测、数据同化和不确定性量化",
    "translated_abstract": "我们提出了一种新的方法，该方法将生成网络（GN）整合到降阶模型（ROM）框架中，用于解决偏微分方程（PDE）的逆问题。目标是匹配可用的测量数据，并估计数值物理模拟的状态和参数的相应不确定性。GN仅使用离散化的PDE模型的无条件模拟进行训练。我们将所提出的方法与黄金标准马尔可夫链蒙特卡罗方法进行了比较。我们将所提出的方法应用于流行病学中的时空隔室模型。结果表明，基于GN的降阶模型能够有效量化不确定性，并且仅使用少量无条件模拟的全阶数值PDE模型即可准确匹配测量数据和黄金标准。",
    "tldr": "该论文提出了一种基于生成网络的降阶模型，用于解决偏微分方程的逆问题。通过使用无条件模拟进行训练，该模型可以有效量化不确定性，并准确匹配测量数据和黄金标准。",
    "en_tdlr": "This paper proposes a generative network-based reduced-order model for solving inverse problems of partial differential equations. By training the model using unconditional simulations, it can efficiently quantify uncertainty and accurately match measurement data and the golden standard."
}