{
    "title": "Representation Learning for Weakly Supervised Relation Extraction. (arXiv:2105.00815v2 [cs.CL] UPDATED)",
    "abstract": "Recent years have seen rapid development in Information Extraction, as well as its subtask, Relation Extraction. Relation Extraction is able to detect semantic relations between entities in sentences. Currently, many efficient approaches have been applied to relation extraction tasks. Supervised learning approaches especially have good performance. However, there are still many difficult challenges. One of the most serious problems is that manually labeled data is difficult to acquire. In most cases, limited data for supervised approaches equals lousy performance. Thus here, under the situation with only limited training data, we focus on how to improve the performance of our supervised baseline system with unsupervised pre-training. Feature is one of the key components in improving the supervised approaches. Traditional approaches usually apply hand-crafted features, which require expert knowledge and expensive human labor. However, this type of feature might suffer from data sparsity",
    "link": "http://arxiv.org/abs/2105.00815",
    "context": "Title: Representation Learning for Weakly Supervised Relation Extraction. (arXiv:2105.00815v2 [cs.CL] UPDATED)\nAbstract: Recent years have seen rapid development in Information Extraction, as well as its subtask, Relation Extraction. Relation Extraction is able to detect semantic relations between entities in sentences. Currently, many efficient approaches have been applied to relation extraction tasks. Supervised learning approaches especially have good performance. However, there are still many difficult challenges. One of the most serious problems is that manually labeled data is difficult to acquire. In most cases, limited data for supervised approaches equals lousy performance. Thus here, under the situation with only limited training data, we focus on how to improve the performance of our supervised baseline system with unsupervised pre-training. Feature is one of the key components in improving the supervised approaches. Traditional approaches usually apply hand-crafted features, which require expert knowledge and expensive human labor. However, this type of feature might suffer from data sparsity",
    "path": "papers/21/05/2105.00815.json",
    "total_tokens": 846,
    "translated_title": "弱监督关系抽取的表示学习",
    "translated_abstract": "近年来，信息抽取以及其中的子任务关系抽取取得了快速发展。关系抽取能够在句子中检测实体之间的语义关系。目前，许多高效的方法已被应用于关系抽取任务中。监督学习方法尤其具有良好的性能。然而，仍然存在许多难题。其中最严重的问题之一是手动标记数据难以获取。在大多数情况下，有限的训练数据等于较差的性能。因此，在只有有限训练数据的情况下，我们关注如何通过无监督预训练来改进我们的监督基线系统的性能。特征是改进监督方法的关键组成部分之一。传统方法通常使用手工特征，这些特征需要专业知识和昂贵的人力。然而，这种类型的特征可能会受到数据稀疏性的影响。",
    "tldr": "本研究关注如何通过无监督预训练来改进在有限训练数据情况下的监督基线系统性能，并分析了传统手工特征在关系抽取中可能存在的数据稀疏性问题。",
    "en_tdlr": "This study focuses on improving the performance of supervised baseline systems in the limited training data scenario through unsupervised pre-training and examines the issue of data sparsity with traditional hand-crafted features in relation extraction."
}