{
    "title": "U-Mamba: Enhancing Long-range Dependency for Biomedical Image Segmentation. (arXiv:2401.04722v1 [eess.IV])",
    "abstract": "Convolutional Neural Networks (CNNs) and Transformers have been the most popular architectures for biomedical image segmentation, but both of them have limited ability to handle long-range dependencies because of inherent locality or computational complexity. To address this challenge, we introduce U-Mamba, a general-purpose network for biomedical image segmentation. Inspired by the State Space Sequence Models (SSMs), a new family of deep sequence models known for their strong capability in handling long sequences, we design a hybrid CNN-SSM block that integrates the local feature extraction power of convolutional layers with the abilities of SSMs for capturing the long-range dependency. Moreover, U-Mamba enjoys a self-configuring mechanism, allowing it to automatically adapt to various datasets without manual intervention. We conduct extensive experiments on four diverse tasks, including the 3D abdominal organ segmentation in CT and MR images, instrument segmentation in endoscopy imag",
    "link": "http://arxiv.org/abs/2401.04722",
    "context": "Title: U-Mamba: Enhancing Long-range Dependency for Biomedical Image Segmentation. (arXiv:2401.04722v1 [eess.IV])\nAbstract: Convolutional Neural Networks (CNNs) and Transformers have been the most popular architectures for biomedical image segmentation, but both of them have limited ability to handle long-range dependencies because of inherent locality or computational complexity. To address this challenge, we introduce U-Mamba, a general-purpose network for biomedical image segmentation. Inspired by the State Space Sequence Models (SSMs), a new family of deep sequence models known for their strong capability in handling long sequences, we design a hybrid CNN-SSM block that integrates the local feature extraction power of convolutional layers with the abilities of SSMs for capturing the long-range dependency. Moreover, U-Mamba enjoys a self-configuring mechanism, allowing it to automatically adapt to various datasets without manual intervention. We conduct extensive experiments on four diverse tasks, including the 3D abdominal organ segmentation in CT and MR images, instrument segmentation in endoscopy imag",
    "path": "papers/24/01/2401.04722.json",
    "total_tokens": 846,
    "translated_title": "U-Mamba:增强生物医学图像分割的长程依赖性",
    "translated_abstract": "卷积神经网络（CNN）和Transformer是生物医学图像分割中最流行的架构，但由于固有的局部性或计算复杂性，它们的处理长程依赖性的能力有限。为了解决这个挑战，我们介绍了U-Mamba，一个用于生物医学图像分割的通用网络。受到状态空间序列模型（SSM）的启发，SSM是一类以处理长序列能力强大而闻名的深度序列模型，我们设计了一个混合的CNN-SSM块，将卷积层的局部特征提取能力与SSM的捕捉长程依赖性的能力结合起来。此外，U-Mamba具有自配置机制，可以自动适应各种数据集，无需手动干预。我们在包括CT和MR图像中的3D腹部器官分割、内窥镜图像中的器械分割等四个不同任务上进行了大量实验。",
    "tldr": "U-Mamba是一个通用网络，通过设计混合的CNN-SSM块，将卷积层的局部特征提取能力与SSM的捕捉长程依赖性的能力结合，从而增强了生物医学图像分割的长程依赖性。"
}