{
    "title": "Design and development of opto-neural processors for simulation of neural networks trained in image detection for potential implementation in hybrid robotics. (arXiv:2401.10289v1 [cs.ET])",
    "abstract": "Neural networks have been employed for a wide range of processing applications like image processing, motor control, object detection and many others. Living neural networks offer advantages of lower power consumption, faster processing, and biological realism. Optogenetics offers high spatial and temporal control over biological neurons and presents potential in training live neural networks. This work proposes a simulated living neural network trained indirectly by backpropagating STDP based algorithms using precision activation by optogenetics achieving accuracy comparable to traditional neural network training algorithms.",
    "link": "http://arxiv.org/abs/2401.10289",
    "context": "Title: Design and development of opto-neural processors for simulation of neural networks trained in image detection for potential implementation in hybrid robotics. (arXiv:2401.10289v1 [cs.ET])\nAbstract: Neural networks have been employed for a wide range of processing applications like image processing, motor control, object detection and many others. Living neural networks offer advantages of lower power consumption, faster processing, and biological realism. Optogenetics offers high spatial and temporal control over biological neurons and presents potential in training live neural networks. This work proposes a simulated living neural network trained indirectly by backpropagating STDP based algorithms using precision activation by optogenetics achieving accuracy comparable to traditional neural network training algorithms.",
    "path": "papers/24/01/2401.10289.json",
    "total_tokens": 775,
    "translated_title": "光电神经处理器的设计与开发，用于在混合机器人中实现经图像检测训练过的神经网络的模拟",
    "translated_abstract": "神经网络已广泛应用于图像处理、运动控制、物体检测等各种处理应用中。生物神经网络具有低功耗、更快的处理速度和生物现实性的优势。光遗传学为生物神经元提供高度的空间和时间控制，并在训练活生生的神经网络方面有潜力。本研究提出了一种通过光遗传学实现精确激活的反向传播STDP算法间接训练的模拟活生生的神经网络，其准确度可与传统神经网络训练算法相媲美。",
    "tldr": "本论文设计了一种光电神经处理器，用于模拟经图像检测训练过的生物神经网络在混合机器人中的应用。通过光遗传学实现精确激活的反向传播STDP算法，实现了与传统神经网络训练算法相媲美的准确度。",
    "en_tdlr": "This paper proposes the design of an opto-neural processor for simulating neural networks trained in image detection, with the potential for implementation in hybrid robots. The use of optogenetics enables precision activation and indirect training of living neural networks, achieving comparable accuracy to traditional training algorithms."
}