{
    "title": "Window Stacking Meta-Models for Clinical EEG Classification. (arXiv:2401.10283v1 [eess.SP])",
    "abstract": "Windowing is a common technique in EEG machine learning classification and other time series tasks. However, a challenge arises when employing this technique: computational expense inhibits learning global relationships across an entire recording or set of recordings. Furthermore, the labels inherited by windows from their parent recordings may not accurately reflect the content of that window in isolation. To resolve these issues, we introduce a multi-stage model architecture, incorporating meta-learning principles tailored to time-windowed data aggregation. We further tested two distinct strategies to alleviate these issues: lengthening the window and utilizing overlapping to augment data. Our methods, when tested on the Temple University Hospital Abnormal EEG Corpus (TUAB), dramatically boosted the benchmark accuracy from 89.8 percent to 99.0 percent. This breakthrough performance surpasses prior performance projections for this dataset and paves the way for clinical applications of",
    "link": "http://arxiv.org/abs/2401.10283",
    "context": "Title: Window Stacking Meta-Models for Clinical EEG Classification. (arXiv:2401.10283v1 [eess.SP])\nAbstract: Windowing is a common technique in EEG machine learning classification and other time series tasks. However, a challenge arises when employing this technique: computational expense inhibits learning global relationships across an entire recording or set of recordings. Furthermore, the labels inherited by windows from their parent recordings may not accurately reflect the content of that window in isolation. To resolve these issues, we introduce a multi-stage model architecture, incorporating meta-learning principles tailored to time-windowed data aggregation. We further tested two distinct strategies to alleviate these issues: lengthening the window and utilizing overlapping to augment data. Our methods, when tested on the Temple University Hospital Abnormal EEG Corpus (TUAB), dramatically boosted the benchmark accuracy from 89.8 percent to 99.0 percent. This breakthrough performance surpasses prior performance projections for this dataset and paves the way for clinical applications of",
    "path": "papers/24/01/2401.10283.json",
    "total_tokens": 901,
    "translated_title": "临床脑电图分类的窗口堆叠元模型",
    "translated_abstract": "窗口化是脑电图机器学习分类和其他时间序列任务中常用的技术。然而，当使用这种技术时会遇到一个挑战：计算开销限制了学习整个记录或一组记录的全局关系。此外，窗口从其父记录继承的标签可能无法准确反映该窗口在单独情况下的内容。为了解决这些问题，我们引入了多阶段模型架构，结合了针对时间窗口化数据聚合的元学习原理。我们进一步测试了两种不同的策略来缓解这些问题：延长窗口和利用重叠来增加数据。我们的方法在Temple University Hospital Abnormal EEG Corpus (TUAB)上的测试中，将基准准确率从89.8％提升到99.0％。这一突破性表现超过了此数据集的先前性能预测，并为临床应用铺平了道路。",
    "tldr": "本论文提出了一种窗口堆叠的元模型，解决了在临床脑电图分类中使用窗口化技术时的计算开销和标签不准确的问题。通过测试，我们的方法将基准准确率从89.8%提升到99.0%，为临床应用提供了突破性的性能。"
}