{
    "title": "FairGridSearch: A Framework to Compare Fairness-Enhancing Models. (arXiv:2401.02183v1 [cs.LG])",
    "abstract": "Machine learning models are increasingly used in critical decision-making applications. However, these models are susceptible to replicating or even amplifying bias present in real-world data. While there are various bias mitigation methods and base estimators in the literature, selecting the optimal model for a specific application remains challenging.  This paper focuses on binary classification and proposes FairGridSearch, a novel framework for comparing fairness-enhancing models. FairGridSearch enables experimentation with different model parameter combinations and recommends the best one. The study applies FairGridSearch to three popular datasets (Adult, COMPAS, and German Credit) and analyzes the impacts of metric selection, base estimator choice, and classification threshold on model fairness.  The results highlight the significance of selecting appropriate accuracy and fairness metrics for model evaluation. Additionally, different base estimators and classification threshold va",
    "link": "http://arxiv.org/abs/2401.02183",
    "context": "Title: FairGridSearch: A Framework to Compare Fairness-Enhancing Models. (arXiv:2401.02183v1 [cs.LG])\nAbstract: Machine learning models are increasingly used in critical decision-making applications. However, these models are susceptible to replicating or even amplifying bias present in real-world data. While there are various bias mitigation methods and base estimators in the literature, selecting the optimal model for a specific application remains challenging.  This paper focuses on binary classification and proposes FairGridSearch, a novel framework for comparing fairness-enhancing models. FairGridSearch enables experimentation with different model parameter combinations and recommends the best one. The study applies FairGridSearch to three popular datasets (Adult, COMPAS, and German Credit) and analyzes the impacts of metric selection, base estimator choice, and classification threshold on model fairness.  The results highlight the significance of selecting appropriate accuracy and fairness metrics for model evaluation. Additionally, different base estimators and classification threshold va",
    "path": "papers/24/01/2401.02183.json",
    "total_tokens": 869,
    "translated_title": "公平性增强模型比较的框架: FairGridSearch",
    "translated_abstract": "机器学习模型在关键决策应用中的使用越来越多。然而，这些模型容易复制或甚至放大现实世界数据中的偏见。尽管文献中存在各种偏见缓解方法和基本估计器，但选择特定应用的最佳模型仍然具有挑战性。本文针对二元分类，提出了一种新颖的比较公平性增强模型的框架FairGridSearch。FairGridSearch通过实验不同模型参数组合，并推荐最佳组合。本研究将FairGridSearch应用于三个流行数据集(成年人、COMPAS和德国信用)，并分析度量选择、基本估计器选择和分类阈值对模型公平性的影响。结果突出了选择合适的准确度和公平性度量对模型评估的重要性。此外，不同的基本估计器和分类阈值也会对模型的公平性产生影响。",
    "tldr": "本文提出了一种比较公平性增强模型的框架FairGridSearch，通过实验不同模型参数组合并推荐最佳组合。研究结果表明，选择适当的准确度和公平性度量对模型评估非常重要。"
}