{
    "title": "Interpreting Time Series Transformer Models and Sensitivity Analysis of Population Age Groups to COVID-19 Infections. (arXiv:2401.15119v1 [cs.LG])",
    "abstract": "Interpreting deep learning time series models is crucial in understanding the model's behavior and learning patterns from raw data for real-time decision-making. However, the complexity inherent in transformer-based time series models poses challenges in explaining the impact of individual features on predictions. In this study, we leverage recent local interpretation methods to interpret state-of-the-art time series models. To use real-world datasets, we collected three years of daily case data for 3,142 US counties. Firstly, we compare six transformer-based models and choose the best prediction model for COVID-19 infection. Using 13 input features from the last two weeks, we can predict the cases for the next two weeks. Secondly, we present an innovative way to evaluate the prediction sensitivity to 8 population age groups over highly dynamic multivariate infection data. Thirdly, we compare our proposed perturbation-based interpretation method with related work, including a total of ",
    "link": "http://arxiv.org/abs/2401.15119",
    "context": "Title: Interpreting Time Series Transformer Models and Sensitivity Analysis of Population Age Groups to COVID-19 Infections. (arXiv:2401.15119v1 [cs.LG])\nAbstract: Interpreting deep learning time series models is crucial in understanding the model's behavior and learning patterns from raw data for real-time decision-making. However, the complexity inherent in transformer-based time series models poses challenges in explaining the impact of individual features on predictions. In this study, we leverage recent local interpretation methods to interpret state-of-the-art time series models. To use real-world datasets, we collected three years of daily case data for 3,142 US counties. Firstly, we compare six transformer-based models and choose the best prediction model for COVID-19 infection. Using 13 input features from the last two weeks, we can predict the cases for the next two weeks. Secondly, we present an innovative way to evaluate the prediction sensitivity to 8 population age groups over highly dynamic multivariate infection data. Thirdly, we compare our proposed perturbation-based interpretation method with related work, including a total of ",
    "path": "papers/24/01/2401.15119.json",
    "total_tokens": 1038,
    "translated_title": "解释时间序列Transformer模型和COVID-19感染对人口年龄组的敏感性分析",
    "translated_abstract": "解释深度学习时间序列模型对于理解模型行为和从原始数据中学习模式以进行实时决策非常重要。然而，基于Transformer的时间序列模型的复杂性使解释个体特征对预测影响的挑战变得困难。在这项研究中，我们利用最近的局部解释方法来解释最先进的时间序列模型。为了使用真实世界的数据集，我们收集了3142个美国县的三年日案例数据。首先，我们比较了六种基于Transformer的模型，并选择了最佳的COVID-19感染预测模型。使用过去两周的13个输入特征，我们可以预测接下来两周的病例数量。其次，我们提出了一种创新的方法，评估了预测对8个人口年龄组的敏感性，以及高度动态的多变量感染数据。第三，我们将我们提出的基于扰动的解释方法与相关工作进行比较，总共包括...",
    "tldr": "该论文研究了解释深度学习时间序列模型的重要性，并通过局部解释方法解释了最先进的Transformer模型。通过将13个输入特征与3,142个美国县的三年日案例数据相结合，最佳预测模型能够在过去两周的基础上预测接下来两周的COVID-19感染情况。此外，该研究还提出了一种创新的评估方法，用于评估感染对8个人口年龄组的敏感性。",
    "en_tdlr": "This paper investigates the importance of interpreting deep learning time series models and interprets state-of-the-art Transformer models using local interpretation methods. By combining 13 input features with three years of daily case data from 3,142 US counties, the best prediction model is able to forecast COVID-19 infections for the next two weeks based on the previous two weeks. Additionally, the study introduces an innovative evaluation method to assess the sensitivity of infections to 8 population age groups."
}