{
    "title": "Selection of gamma events from IACT images with deep learning methods. (arXiv:2401.16981v1 [astro-ph.IM])",
    "abstract": "Imaging Atmospheric Cherenkov Telescopes (IACTs) of gamma ray observatory TAIGA detect the Extesnive Air Showers (EASs) originating from the cosmic or gamma rays interactions with the atmosphere. Thereby, telescopes obtain images of the EASs. The ability to segregate gamma rays images from the hadronic cosmic ray background is one of the main features of this type of detectors. However, in actual IACT observations simultaneous observation of the background and the source of gamma ray is needed. This observation mode (called wobbling) modifies images of events, which affects the quality of selection by neural networks.  Thus, in this work, the results of the application of neural networks (NN) for image classification task on Monte Carlo (MC) images of TAIGA-IACTs are presented. The wobbling mode is considered together with the image adaptation for adequate analysis by NNs. Simultaneously, we explore several neural network structures that classify events both directly from images or thr",
    "link": "http://arxiv.org/abs/2401.16981",
    "context": "Title: Selection of gamma events from IACT images with deep learning methods. (arXiv:2401.16981v1 [astro-ph.IM])\nAbstract: Imaging Atmospheric Cherenkov Telescopes (IACTs) of gamma ray observatory TAIGA detect the Extesnive Air Showers (EASs) originating from the cosmic or gamma rays interactions with the atmosphere. Thereby, telescopes obtain images of the EASs. The ability to segregate gamma rays images from the hadronic cosmic ray background is one of the main features of this type of detectors. However, in actual IACT observations simultaneous observation of the background and the source of gamma ray is needed. This observation mode (called wobbling) modifies images of events, which affects the quality of selection by neural networks.  Thus, in this work, the results of the application of neural networks (NN) for image classification task on Monte Carlo (MC) images of TAIGA-IACTs are presented. The wobbling mode is considered together with the image adaptation for adequate analysis by NNs. Simultaneously, we explore several neural network structures that classify events both directly from images or thr",
    "path": "papers/24/01/2401.16981.json",
    "total_tokens": 922,
    "translated_title": "使用深度学习方法从IACT图像中选择伽玛事件",
    "translated_abstract": "伽玛射线观测站TAIGA的成像大气切伦科夫望远镜（IACTs）探测源自宇宙射线或伽玛射线与大气相互作用的广大空气阵射（EASs）。因此，望远镜获取EASs的图像。将伽玛射线图像与宇宙射线背景进行分离是该类型探测器的主要特点之一。然而，在实际的IACT观测中，需要同时观测背景和伽玛射线源。这种观测模式（称为交错观测）会改变事件的图像，从而影响了神经网络的选择质量。因此，在本文中，我们提出了在TAIGA-IACT的Monte Carlo（MC）图像上应用神经网络（NN）进行图像分类任务的结果。同时考虑交错观测模式和适应NN分析的图像调整。我们还探索了几种神经网络结构，可以直接从图像或进过预处理的图像分类事件。",
    "tldr": "本研究展示了在TAIGA-IACT的Monte Carlo（MC）图像上通过神经网络进行图像分类任务的结果，同时考虑了交错观测模式和适应NN分析的图像调整。",
    "en_tdlr": "This study presents the results of using neural networks for image classification task on Monte Carlo (MC) images of TAIGA-IACTs, considering the wobbling mode and image adaptation for adequate analysis."
}