{
    "title": "Meta Reinforcement Learning for Strategic IoT Deployments Coverage in Disaster-Response UAV Swarms. (arXiv:2401.11118v1 [cs.LG])",
    "abstract": "In the past decade, Unmanned Aerial Vehicles (UAVs) have grabbed the attention of researchers in academia and industry for their potential use in critical emergency applications, such as providing wireless services to ground users and collecting data from areas affected by disasters, due to their advantages in terms of maneuverability and movement flexibility. The UAVs' limited resources, energy budget, and strict mission completion time have posed challenges in adopting UAVs for these applications. Our system model considers a UAV swarm that navigates an area collecting data from ground IoT devices focusing on providing better service for strategic locations and allowing UAVs to join and leave the swarm (e.g., for recharging) in a dynamic way. In this work, we introduce an optimization model with the aim of minimizing the total energy consumption and provide the optimal path planning of UAVs under the constraints of minimum completion time and transmit power. The formulated optimizati",
    "link": "http://arxiv.org/abs/2401.11118",
    "context": "Title: Meta Reinforcement Learning for Strategic IoT Deployments Coverage in Disaster-Response UAV Swarms. (arXiv:2401.11118v1 [cs.LG])\nAbstract: In the past decade, Unmanned Aerial Vehicles (UAVs) have grabbed the attention of researchers in academia and industry for their potential use in critical emergency applications, such as providing wireless services to ground users and collecting data from areas affected by disasters, due to their advantages in terms of maneuverability and movement flexibility. The UAVs' limited resources, energy budget, and strict mission completion time have posed challenges in adopting UAVs for these applications. Our system model considers a UAV swarm that navigates an area collecting data from ground IoT devices focusing on providing better service for strategic locations and allowing UAVs to join and leave the swarm (e.g., for recharging) in a dynamic way. In this work, we introduce an optimization model with the aim of minimizing the total energy consumption and provide the optimal path planning of UAVs under the constraints of minimum completion time and transmit power. The formulated optimizati",
    "path": "papers/24/01/2401.11118.json",
    "total_tokens": 878,
    "translated_title": "战略物联网部署覆盖灾难响应无人机群的元强化学习(arXiv:2401.11118v1 [cs.LG])",
    "translated_abstract": "在过去的十年中，无人机在学术界和工业界引起了研究人员的广泛关注，因为它们在提供无线服务和收集灾害区域数据等关键紧急应用中具有机动性和运动灵活性的优势。然而，无人机的资源有限、能源预算有限以及严格的任务完成时间对于这些应用的采用造成了挑战。本论文考虑一个无人机群体在一个区域中收集地面物联网设备的数据，其重点是为战略位置提供更好的服务，并允许无人机以动态方式加入和离开群体（例如充电）。我们引入了一个优化模型，旨在最小化总能源消耗，并在最短完成时间和最低传输功率约束下提供无人机的最佳路径规划。",
    "tldr": "本研究提出了一种战略物联网部署覆盖灾难响应无人机群的元强化学习方法，通过优化模型来最小化能源消耗，并提供满足时间和功率约束的最佳路径规划。",
    "en_tdlr": "This paper proposes a meta reinforcement learning approach for strategic IoT deployments coverage in disaster-response UAV swarms, aiming to minimize energy consumption and provide optimal path planning considering time and power constraints."
}