{
    "title": "Mobile ALOHA: Learning Bimanual Mobile Manipulation with Low-Cost Whole-Body Teleoperation. (arXiv:2401.02117v1 [cs.RO])",
    "abstract": "Imitation learning from human demonstrations has shown impressive performance in robotics. However, most results focus on table-top manipulation, lacking the mobility and dexterity necessary for generally useful tasks. In this work, we develop a system for imitating mobile manipulation tasks that are bimanual and require whole-body control. We first present Mobile ALOHA, a low-cost and whole-body teleoperation system for data collection. It augments the ALOHA system with a mobile base, and a whole-body teleoperation interface. Using data collected with Mobile ALOHA, we then perform supervised behavior cloning and find that co-training with existing static ALOHA datasets boosts performance on mobile manipulation tasks. With 50 demonstrations for each task, co-training can increase success rates by up to 90%, allowing Mobile ALOHA to autonomously complete complex mobile manipulation tasks such as sauteing and serving a piece of shrimp, opening a two-door wall cabinet to store heavy cooki",
    "link": "http://arxiv.org/abs/2401.02117",
    "context": "Title: Mobile ALOHA: Learning Bimanual Mobile Manipulation with Low-Cost Whole-Body Teleoperation. (arXiv:2401.02117v1 [cs.RO])\nAbstract: Imitation learning from human demonstrations has shown impressive performance in robotics. However, most results focus on table-top manipulation, lacking the mobility and dexterity necessary for generally useful tasks. In this work, we develop a system for imitating mobile manipulation tasks that are bimanual and require whole-body control. We first present Mobile ALOHA, a low-cost and whole-body teleoperation system for data collection. It augments the ALOHA system with a mobile base, and a whole-body teleoperation interface. Using data collected with Mobile ALOHA, we then perform supervised behavior cloning and find that co-training with existing static ALOHA datasets boosts performance on mobile manipulation tasks. With 50 demonstrations for each task, co-training can increase success rates by up to 90%, allowing Mobile ALOHA to autonomously complete complex mobile manipulation tasks such as sauteing and serving a piece of shrimp, opening a two-door wall cabinet to store heavy cooki",
    "path": "papers/24/01/2401.02117.json",
    "total_tokens": 944,
    "translated_title": "移动ALOHA：低成本全身远程操作学习双手移动操作",
    "translated_abstract": "仿真学习来自人类演示在机器人学中已经展现出令人印象深刻的性能。然而，大多数的结果集中在桌面操作上，缺乏对于通常有用任务所需要的移动性和灵活性。在这项工作中，我们开发了一个系统，用于模仿移动操作任务，该任务是双手操作且需要全身控制的。我们首先介绍了移动ALOHA，这是一个低成本和全身远程操作数据收集系统。它通过增加一个移动底盘和一个全身远程操作接口来增强ALOHA系统。然后，使用通过移动ALOHA收集的数据，我们进行监督式行为克隆，并发现与现有的静态ALOHA数据集进行联合训练可以提高移动操作任务的性能。对于每个任务进行50次演示，联合训练可以将成功率提高90%，使得移动ALOHA能够自主完成复杂的移动操作任务，如炒虾和上菜，并打开一个双门壁柜存放重型烹饪设备。",
    "tldr": "该论文介绍了一个移动ALOHA系统，用于学习双手移动操作。通过低成本的远程操作和整体身体控制，系统能够完成复杂的移动操作任务，并通过联合训练提高成功率达到90%。",
    "en_tdlr": "This paper presents a Mobile ALOHA system for learning bimanual mobile manipulation tasks. By using low-cost teleoperation and whole-body control, the system can autonomously complete complex mobile manipulation tasks and achieve success rates up to 90% through co-training."
}