{
    "title": "Predicting Hypoxia in Brain Tumors from Multiparametric MRI. (arXiv:2401.14171v1 [eess.IV])",
    "abstract": "This research paper presents a novel approach to the prediction of hypoxia in brain tumors, using multi-parametric Magnetic Resonance Imaging (MRI). Hypoxia, a condition characterized by low oxygen levels, is a common feature of malignant brain tumors associated with poor prognosis. Fluoromisonidazole Positron Emission Tomography (FMISO PET) is a well-established method for detecting hypoxia in vivo, but it is expensive and not widely available. Our study proposes the use of MRI, a more accessible and cost-effective imaging modality, to predict FMISO PET signals. We investigate deep learning models (DL) trained on the ACRIN 6684 dataset, a resource that contains paired MRI and FMISO PET images from patients with brain tumors. Our trained models effectively learn the complex relationships between the MRI features and the corresponding FMISO PET signals, thereby enabling the prediction of hypoxia from MRI scans alone. The results show a strong correlation between the predicted and actual",
    "link": "http://arxiv.org/abs/2401.14171",
    "context": "Title: Predicting Hypoxia in Brain Tumors from Multiparametric MRI. (arXiv:2401.14171v1 [eess.IV])\nAbstract: This research paper presents a novel approach to the prediction of hypoxia in brain tumors, using multi-parametric Magnetic Resonance Imaging (MRI). Hypoxia, a condition characterized by low oxygen levels, is a common feature of malignant brain tumors associated with poor prognosis. Fluoromisonidazole Positron Emission Tomography (FMISO PET) is a well-established method for detecting hypoxia in vivo, but it is expensive and not widely available. Our study proposes the use of MRI, a more accessible and cost-effective imaging modality, to predict FMISO PET signals. We investigate deep learning models (DL) trained on the ACRIN 6684 dataset, a resource that contains paired MRI and FMISO PET images from patients with brain tumors. Our trained models effectively learn the complex relationships between the MRI features and the corresponding FMISO PET signals, thereby enabling the prediction of hypoxia from MRI scans alone. The results show a strong correlation between the predicted and actual",
    "path": "papers/24/01/2401.14171.json",
    "total_tokens": 999,
    "translated_title": "从多参数MRI预测脑肿瘤缺氧",
    "translated_abstract": "本研究论文提出了一种利用多参数磁共振成像(MRI)预测脑肿瘤缺氧的新方法。缺氧是一种低氧水平的情况，是与预后不良相关的恶性脑肿瘤的常见特征。氟米索氟核素正电子发射断层扫描 (FMISO PET) 是一种用于体内检测缺氧的成熟方法，但其昂贵且普及率有限。本研究提出了使用MRI这种更容易获取和经济实惠的成像模式来预测FMISO PET信号。我们研究了在ACRIN 6684数据集上训练的深度学习模型(DL)，该数据集包含脑肿瘤患者的配对MRI和FMISO PET图像。我们训练的模型能够有效地学习MRI特征与相应的FMISO PET信号之间的复杂关系，从而可以仅通过MRI扫描预测缺氧。结果显示预测值与实际值之间有很强的相关性。",
    "tldr": "本研究利用多参数磁共振成像(MRI)预测脑肿瘤的缺氧情况，提出了一种替代昂贵且普及率有限的FMISO PET方法。研究结果表明，深度学习模型可以有效地从MRI扫描中预测缺氧情况，并与实际值有很强的相关性。",
    "en_tdlr": "This paper proposes a novel approach using multi-parametric MRI to predict hypoxia in brain tumors, as an alternative to the expensive and limitedly available FMISO PET method. The results show that deep learning models effectively predict hypoxia from MRI scans with a strong correlation to the actual values."
}