{
    "title": "Harnessing Smartwatch Microphone Sensors for Cough Detection and Classification",
    "abstract": "This study investigates the potential of using smartwatches with built-in microphone sensors for monitoring coughs and detecting various cough types. We conducted a study involving 32 participants and collected 9 hours of audio data in a controlled manner. Afterward, we processed this data using a structured approach, resulting in 223 positive cough samples. We further improved the dataset through augmentation techniques and employed a specialized 1D CNN model. This model achieved an impressive accuracy rate of 98.49% while non-walking and 98.2% while walking, showing smartwatches can detect cough. Moreover, our research successfully identified four distinct types of coughs using clustering techniques.",
    "link": "https://arxiv.org/abs/2401.17738",
    "context": "Title: Harnessing Smartwatch Microphone Sensors for Cough Detection and Classification\nAbstract: This study investigates the potential of using smartwatches with built-in microphone sensors for monitoring coughs and detecting various cough types. We conducted a study involving 32 participants and collected 9 hours of audio data in a controlled manner. Afterward, we processed this data using a structured approach, resulting in 223 positive cough samples. We further improved the dataset through augmentation techniques and employed a specialized 1D CNN model. This model achieved an impressive accuracy rate of 98.49% while non-walking and 98.2% while walking, showing smartwatches can detect cough. Moreover, our research successfully identified four distinct types of coughs using clustering techniques.",
    "path": "papers/24/01/2401.17738.json",
    "total_tokens": 855,
    "translated_title": "利用智能手表麦克风传感器进行咳嗽检测和分类的研究",
    "translated_abstract": "本研究探讨了利用内置麦克风传感器的智能手表监测咳嗽并检测各种咳嗽类型的潜力。我们进行了一项涉及32名参与者的研究，并以受控方式收集了9个小时的音频数据。之后，我们采用结构化方法对这些数据进行了处理，得到了223个阳性咳嗽样本。我们通过增强技术进一步改进了数据集，并采用了专门的1D卷积神经网络模型。该模型在非步行时具有令人印象深刻的准确率98.49%，在步行时为98.2%，表明智能手表可以检测到咳嗽。此外，我们的研究成功利用聚类技术识别出了四种不同的咳嗽类型。",
    "tldr": "本研究利用智能手表的麦克风传感器监测和分类了各种咳嗽，通过结构化处理和专门的1D卷积神经网络模型，成功实现了98.49%和98.2%的准确率，并成功识别出四种不同的咳嗽类型。",
    "en_tdlr": "This study explores the potential of smartwatches with built-in microphone sensors for monitoring and classifying various types of coughs. By utilizing a structured approach and a specialized 1D CNN model, the study achieved impressive accuracy rates of 98.49% and 98.2% for non-walking and walking scenarios, respectively, and successfully identified four distinct cough types."
}