{
    "title": "Machine learning based state observer for discrete time systems evolving on Lie groups. (arXiv:2401.11196v1 [eess.SY])",
    "abstract": "In this paper, a machine learning based observer for systems evolving on manifolds is designed such that the state of the observer is restricted to the Lie group on which the system evolves. Conventional techniques involving machine learning based observers on systems evolving on Lie groups involve designing charts for the Lie group, training a machine learning based observer for each chart, and switching between the trained models based on the state of the system. We propose a novel deep learning based technique whose predictions are restricted to a measure 0 subset of Euclidean space without using charts. Using this network, we design an observer ensuring that the state of the observer is restricted to the Lie group, and predicting the state using only one trained algorithm. The deep learning network predicts an ``error term'' on the Lie algebra of the Lie group, uses the map from the Lie algebra to the group, and uses the group action and the present state to estimate the state at t",
    "link": "http://arxiv.org/abs/2401.11196",
    "context": "Title: Machine learning based state observer for discrete time systems evolving on Lie groups. (arXiv:2401.11196v1 [eess.SY])\nAbstract: In this paper, a machine learning based observer for systems evolving on manifolds is designed such that the state of the observer is restricted to the Lie group on which the system evolves. Conventional techniques involving machine learning based observers on systems evolving on Lie groups involve designing charts for the Lie group, training a machine learning based observer for each chart, and switching between the trained models based on the state of the system. We propose a novel deep learning based technique whose predictions are restricted to a measure 0 subset of Euclidean space without using charts. Using this network, we design an observer ensuring that the state of the observer is restricted to the Lie group, and predicting the state using only one trained algorithm. The deep learning network predicts an ``error term'' on the Lie algebra of the Lie group, uses the map from the Lie algebra to the group, and uses the group action and the present state to estimate the state at t",
    "path": "papers/24/01/2401.11196.json",
    "total_tokens": 970,
    "translated_title": "基于机器学习的离散时间系统状态观测器在李群上的应用",
    "translated_abstract": "本文设计了一种基于机器学习的观测器，用于在流形上演化的系统，以使观测器的状态限制在系统演化的李群上。传统的在李群上演化的机器学习观测器技术涉及设计李群的图表，为每个图表训练一个基于机器学习的观测器，并根据系统状态切换训练好的模型。我们提出了一种新颖的基于深度学习的技术，其预测结果仅限于欧几里得空间上的0测度子集，而无需使用图表。利用这个网络，我们设计了一个观测器，确保观测器的状态限制在李群上，并且仅使用一个训练的算法来预测状态。深度学习网络在李群的李代数上预测了一个“误差项”，利用了从李代数到群的映射，并使用群作用和当前状态来估计时刻t的状态。",
    "tldr": "本文提出了一种基于深度学习的机器学习方法，用于在李群上演化的系统的状态观测。通过设计一个限制在李群上的观测器，仅使用一个训练的算法来预测状态，并利用从李代数到群的映射以及群作用和当前状态来估计时刻t的状态。",
    "en_tdlr": "This paper proposes a deep learning-based machine learning method for state observation in systems evolving on Lie groups. By designing an observer restricted to the Lie group and using only one trained algorithm for state prediction, the paper estimates the state at time t using the map from the Lie algebra to the group, group action, and the current state."
}