{
    "title": "Hierarchical Classification of Transversal Skills in Job Ads Based on Sentence Embeddings. (arXiv:2401.05073v1 [cs.LG])",
    "abstract": "This paper proposes a classification framework aimed at identifying correlations between job ad requirements and transversal skill sets, with a focus on predicting the necessary skills for individual job descriptions using a deep learning model. The approach involves data collection, preprocessing, and labeling using ESCO (European Skills, Competences, and Occupations) taxonomy. Hierarchical classification and multi-label strategies are used for skill identification, while augmentation techniques address data imbalance, enhancing model robustness. A comparison between results obtained with English-specific and multi-language sentence embedding models reveals close accuracy. The experimental case studies detail neural network configurations, hyperparameters, and cross-validation results, highlighting the efficacy of the hierarchical approach and the suitability of the multi-language model for the diverse European job market. Thus, a new approach is proposed for the hierarchical classifi",
    "link": "http://arxiv.org/abs/2401.05073",
    "context": "Title: Hierarchical Classification of Transversal Skills in Job Ads Based on Sentence Embeddings. (arXiv:2401.05073v1 [cs.LG])\nAbstract: This paper proposes a classification framework aimed at identifying correlations between job ad requirements and transversal skill sets, with a focus on predicting the necessary skills for individual job descriptions using a deep learning model. The approach involves data collection, preprocessing, and labeling using ESCO (European Skills, Competences, and Occupations) taxonomy. Hierarchical classification and multi-label strategies are used for skill identification, while augmentation techniques address data imbalance, enhancing model robustness. A comparison between results obtained with English-specific and multi-language sentence embedding models reveals close accuracy. The experimental case studies detail neural network configurations, hyperparameters, and cross-validation results, highlighting the efficacy of the hierarchical approach and the suitability of the multi-language model for the diverse European job market. Thus, a new approach is proposed for the hierarchical classifi",
    "path": "papers/24/01/2401.05073.json",
    "total_tokens": 910,
    "translated_title": "基于句子嵌入的职位广告中横向技能的层次分类",
    "translated_abstract": "本文提出了一个分类框架，旨在识别职位广告要求和横向技能集之间的相关性，重点是使用深度学习模型预测个别工作描述所需的技能。该方法涉及数据收集、预处理和使用ESCO（欧洲技能、能力和职业）分类系统进行标注。在技能识别方面，采用了层次分类和多标签策略，而增强技术则解决了数据不平衡问题，提高了模型的稳健性。通过比较使用英语特定和多语言句子嵌入模型得到的结果，发现其准确度相近。实验案例研究详细说明了神经网络配置、超参数和交叉验证结果，突显了层次化方法的功效以及多语言模型适用于多样化的欧洲就业市场。因此，提供了一种新的层次分类方法。",
    "tldr": "本论文提出了一个基于深度学习模型的分类框架，用于识别职位广告要求和横向技能集之间的相关性，并预测个别工作描述所需的技能。通过使用层次分类和多标签策略，并采用增强技术解决数据不平衡问题，该方法在欧洲就业市场具有良好的效果。",
    "en_tdlr": "This paper proposes a classification framework using deep learning to identify correlations between job ad requirements and transversal skill sets, and predict the necessary skills for individual job descriptions. The approach utilizes hierarchical classification, multi-label strategies, and augmentation techniques to address data imbalance, showing effectiveness in the diverse European job market."
}