{
    "title": "Alternative Speech: Complementary Method to Counter-Narrative for Better Discourse. (arXiv:2401.14616v1 [cs.CL])",
    "abstract": "We introduce the concept of \"Alternative Speech\" as a new way to directly combat hate speech and complement the limitations of counter-narrative. An alternative speech provides practical alternatives to hate speech in real-world scenarios by offering speech-level corrections to speakers while considering the surrounding context and promoting speakers to reform. Further, an alternative speech can combat hate speech alongside counter-narratives, offering a useful tool to address social issues such as racial discrimination and gender inequality. We propose the new concept and provide detailed guidelines for constructing the necessary dataset. Through discussion, we demonstrate that combining alternative speech and counter-narrative can be a more effective strategy for combating hate speech by complementing specificity and guiding capacity of counter-narrative. This paper presents another perspective for dealing with hate speech, offering viable remedies to complement the constraints of cu",
    "link": "http://arxiv.org/abs/2401.14616",
    "context": "Title: Alternative Speech: Complementary Method to Counter-Narrative for Better Discourse. (arXiv:2401.14616v1 [cs.CL])\nAbstract: We introduce the concept of \"Alternative Speech\" as a new way to directly combat hate speech and complement the limitations of counter-narrative. An alternative speech provides practical alternatives to hate speech in real-world scenarios by offering speech-level corrections to speakers while considering the surrounding context and promoting speakers to reform. Further, an alternative speech can combat hate speech alongside counter-narratives, offering a useful tool to address social issues such as racial discrimination and gender inequality. We propose the new concept and provide detailed guidelines for constructing the necessary dataset. Through discussion, we demonstrate that combining alternative speech and counter-narrative can be a more effective strategy for combating hate speech by complementing specificity and guiding capacity of counter-narrative. This paper presents another perspective for dealing with hate speech, offering viable remedies to complement the constraints of cu",
    "path": "papers/24/01/2401.14616.json",
    "total_tokens": 996,
    "translated_title": "替代性言论：补充对抗叙事的方法以改善讨论（arXiv:2401.14616v1 [cs.CL]）",
    "translated_abstract": "我们引入了“替代性言论”的概念，作为直接对抗仇恨言论和补充叙事限制的新方式。替代性言论通过在真实场景中提供言论级别的修正，考虑周围环境并促使演讲者改变，为仇恨言论提供实际可行的替代方案。此外，替代性言论可以与对抗叙事一起对抗仇恨言论，为解决种族歧视和性别不平等等社会问题提供有用工具。我们提出了这个新概念，并提供了构建所需数据集的详细指导。通过讨论，我们证明将替代性言论与对抗叙事相结合可以是对抗仇恨言论更有效的策略，补充了对抗叙事的具体性和引导能力。本文提出了处理仇恨言论的另一种视角，提供了可行的补救措施来补充当前的限制。",
    "tldr": "该论文引入了“替代性言论”作为直接对抗仇恨言论的新方法，并提供了构建所需数据集的指导。替代性言论通过提供实际可行的替代方案，考虑环境因素并促使演讲者改变，为解决社会问题提供有用工具。将替代性言论与对抗叙事结合使用可以更有效地对抗仇恨言论，补充了对抗叙事的能力。",
    "en_tdlr": "This paper introduces the concept of \"Alternative Speech\" as a new method to directly combat hate speech and complement the limitations of counter-narrative. It provides practical alternatives to hate speech, considers the context, and promotes speaker reform. The combination of alternative speech and counter-narrative offers a more effective strategy for addressing social issues, complementing the specificity and guiding capacity of counter-narrative."
}