{
    "title": "Sea ice detection using concurrent multispectral and synthetic aperture radar imagery. (arXiv:2401.06009v1 [cs.CV])",
    "abstract": "Synthetic Aperture Radar (SAR) imagery is the primary data type used for sea ice mapping due to its spatio-temporal coverage and the ability to detect sea ice independent of cloud and lighting conditions. Automatic sea ice detection using SAR imagery remains problematic due to the presence of ambiguous signal and noise within the image. Conversely, ice and water are easily distinguishable using multispectral imagery (MSI), but in the polar regions the ocean's surface is often occluded by cloud or the sun may not appear above the horizon for many months. To address some of these limitations, this paper proposes a new tool trained using concurrent multispectral Visible and SAR imagery for sea Ice Detection (ViSual\\_IceD). ViSual\\_IceD is a convolution neural network (CNN) that builds on the classic U-Net architecture by containing two parallel encoder stages, enabling the fusion and concatenation of MSI and SAR imagery containing different spatial resolutions. The performance of ViSual\\_",
    "link": "http://arxiv.org/abs/2401.06009",
    "context": "Title: Sea ice detection using concurrent multispectral and synthetic aperture radar imagery. (arXiv:2401.06009v1 [cs.CV])\nAbstract: Synthetic Aperture Radar (SAR) imagery is the primary data type used for sea ice mapping due to its spatio-temporal coverage and the ability to detect sea ice independent of cloud and lighting conditions. Automatic sea ice detection using SAR imagery remains problematic due to the presence of ambiguous signal and noise within the image. Conversely, ice and water are easily distinguishable using multispectral imagery (MSI), but in the polar regions the ocean's surface is often occluded by cloud or the sun may not appear above the horizon for many months. To address some of these limitations, this paper proposes a new tool trained using concurrent multispectral Visible and SAR imagery for sea Ice Detection (ViSual\\_IceD). ViSual\\_IceD is a convolution neural network (CNN) that builds on the classic U-Net architecture by containing two parallel encoder stages, enabling the fusion and concatenation of MSI and SAR imagery containing different spatial resolutions. The performance of ViSual\\_",
    "path": "papers/24/01/2401.06009.json",
    "total_tokens": 957,
    "translated_title": "使用并行多光谱和合成孔径雷达图像进行海冰检测",
    "translated_abstract": "合成孔径雷达（SAR）图像是海冰映射的主要数据类型，因为它具有时空覆盖能力，并且能够在云和光照条件不利时检测海冰。然而，由于图像中存在模糊的信号和噪声，使用SAR图像进行自动海冰检测仍然存在问题。相反，使用多光谱图像（MSI）可以轻松区分冰和水，但在极地地区，海洋表面经常被云层遮挡，阳光可能在数月内不出现在地平线上。为了解决这些限制，本文提出了一种使用并行多光谱可见光和SAR图像进行海冰检测的新工具（ViSual_IceD）。ViSual_IceD是一个卷积神经网络（CNN），它在经典的U-Net体系结构的基础上构建，包含两个并行的编码器阶段，能够融合和拼接具有不同空间分辨率的MSI和SAR图像。ViSual_IceD的性能经过了评估。",
    "tldr": "本文提出了一种使用并行多光谱和合成孔径雷达图像进行海冰检测的新工具（ViSual_IceD），该工具通过融合多光谱图像和SAR图像来解决海冰检测中存在的问题，具有良好的性能。"
}