{
    "title": "MeTA: Multi-source Test Time Adaptation. (arXiv:2401.02561v1 [cs.LG])",
    "abstract": "Test time adaptation is the process of adapting, in an unsupervised manner, a pre-trained source model to each incoming batch of the test data (i.e., without requiring a substantial portion of the test data to be available, as in traditional domain adaptation) and without access to the source data. Since it works with each batch of test data, it is well-suited for dynamic environments where decisions need to be made as the data is streaming in. Current test time adaptation methods are primarily focused on a single source model. We propose the first completely unsupervised Multi-source Test Time Adaptation (MeTA) framework that handles multiple source models and optimally combines them to adapt to the test data. MeTA has two distinguishing features. First, it efficiently obtains the optimal combination weights to combine the source models to adapt to the test data distribution. Second, it identifies which of the source model parameters to update so that only the model which is most corr",
    "link": "http://arxiv.org/abs/2401.02561",
    "context": "Title: MeTA: Multi-source Test Time Adaptation. (arXiv:2401.02561v1 [cs.LG])\nAbstract: Test time adaptation is the process of adapting, in an unsupervised manner, a pre-trained source model to each incoming batch of the test data (i.e., without requiring a substantial portion of the test data to be available, as in traditional domain adaptation) and without access to the source data. Since it works with each batch of test data, it is well-suited for dynamic environments where decisions need to be made as the data is streaming in. Current test time adaptation methods are primarily focused on a single source model. We propose the first completely unsupervised Multi-source Test Time Adaptation (MeTA) framework that handles multiple source models and optimally combines them to adapt to the test data. MeTA has two distinguishing features. First, it efficiently obtains the optimal combination weights to combine the source models to adapt to the test data distribution. Second, it identifies which of the source model parameters to update so that only the model which is most corr",
    "path": "papers/24/01/2401.02561.json",
    "total_tokens": 836,
    "translated_title": "MeTA: 多源测试时适应",
    "translated_abstract": "测试时适应是一个无监督的过程，它将预训练的源模型适应到每个进入的测试数据批次中（即，无需大量的测试数据可用，就像传统领域适应中那样），并且没有访问源数据的权限。由于它与每个测试数据批次一起工作，因此非常适合需要在数据流入时进行决策的动态环境。当前的测试时适应方法主要集中在单个源模型上。我们提出了第一个完全无监督的多源测试时适应（MeTA）框架，它处理多个源模型并将它们最佳组合以适应测试数据。MeTA具有两个独特的特点。首先，它有效地获得最佳组合权重，以将源模型组合以适应测试数据分布。其次，它确定要更新哪个源模型参数，以便只更新与测试数据最相关的模型。",
    "tldr": "MeTA是第一个完全无监督的多源测试时适应框架，它可以在没有访问源数据的情况下，以最佳组合权重适应多个源模型到测试数据分布。"
}