{
    "title": "Learning Backdoors for Mixed Integer Programs with Contrastive Learning. (arXiv:2401.10467v1 [cs.AI])",
    "abstract": "Many real-world problems can be efficiently modeled as Mixed Integer Programs (MIPs) and solved with the Branch-and-Bound method. Prior work has shown the existence of MIP backdoors, small sets of variables such that prioritizing branching on them when possible leads to faster running times. However, finding high-quality backdoors that improve running times remains an open question. Previous work learns to estimate the relative solver speed of randomly sampled backdoors through ranking and then decide whether to use it. In this paper, we utilize the Monte-Carlo tree search method to collect backdoors for training, rather than relying on random sampling, and adapt a contrastive learning framework to train a Graph Attention Network model to predict backdoors. Our method, evaluated on four common MIP problem domains, demonstrates performance improvements over both Gurobi and previous models.",
    "link": "http://arxiv.org/abs/2401.10467",
    "context": "Title: Learning Backdoors for Mixed Integer Programs with Contrastive Learning. (arXiv:2401.10467v1 [cs.AI])\nAbstract: Many real-world problems can be efficiently modeled as Mixed Integer Programs (MIPs) and solved with the Branch-and-Bound method. Prior work has shown the existence of MIP backdoors, small sets of variables such that prioritizing branching on them when possible leads to faster running times. However, finding high-quality backdoors that improve running times remains an open question. Previous work learns to estimate the relative solver speed of randomly sampled backdoors through ranking and then decide whether to use it. In this paper, we utilize the Monte-Carlo tree search method to collect backdoors for training, rather than relying on random sampling, and adapt a contrastive learning framework to train a Graph Attention Network model to predict backdoors. Our method, evaluated on four common MIP problem domains, demonstrates performance improvements over both Gurobi and previous models.",
    "path": "papers/24/01/2401.10467.json",
    "total_tokens": 849,
    "translated_title": "使用对比学习学习混合整数规划的后门",
    "translated_abstract": "许多现实世界中的问题可以有效地建模为混合整数规划（MIP）并使用分支定界方法进行求解。先前的研究表明存在MIP后门，即一小组变量，如果优先在可能的情况下在它们上进行分支，则可以加快运行时间。然而，寻找能提高运行时间的高质量后门仍是一个未解决的问题。先前的工作通过排名学习估计随机采样的后门相对求解器速度，然后决定是否使用。本文中，我们利用蒙特卡洛树搜索方法收集用于训练的后门，而不是依赖随机采样，并且采用对比学习框架训练图注意力网络模型来预测后门。我们的方法在四个常见的MIP问题领域上进行评估，表现出对比Gurobi和先前模型的性能改进。",
    "tldr": "本论文提出了使用对比学习方法来学习混合整数规划的后门，通过收集用于训练的后门并训练图注意力网络模型来预测后门，取得了比Gurobi和先前模型更好的性能改进。"
}