{
    "title": "CrisisViT: A Robust Vision Transformer for Crisis Image Classification. (arXiv:2401.02838v1 [cs.CV])",
    "abstract": "In times of emergency, crisis response agencies need to quickly and accurately assess the situation on the ground in order to deploy relevant services and resources. However, authorities often have to make decisions based on limited information, as data on affected regions can be scarce until local response services can provide first-hand reports. Fortunately, the widespread availability of smartphones with high-quality cameras has made citizen journalism through social media a valuable source of information for crisis responders. However, analyzing the large volume of images posted by citizens requires more time and effort than is typically available. To address this issue, this paper proposes the use of state-of-the-art deep neural models for automatic image classification/tagging, specifically by adapting transformer-based architectures for crisis image classification (CrisisViT). We leverage the new Incidents1M crisis image dataset to develop a range of new transformer-based image ",
    "link": "http://arxiv.org/abs/2401.02838",
    "context": "Title: CrisisViT: A Robust Vision Transformer for Crisis Image Classification. (arXiv:2401.02838v1 [cs.CV])\nAbstract: In times of emergency, crisis response agencies need to quickly and accurately assess the situation on the ground in order to deploy relevant services and resources. However, authorities often have to make decisions based on limited information, as data on affected regions can be scarce until local response services can provide first-hand reports. Fortunately, the widespread availability of smartphones with high-quality cameras has made citizen journalism through social media a valuable source of information for crisis responders. However, analyzing the large volume of images posted by citizens requires more time and effort than is typically available. To address this issue, this paper proposes the use of state-of-the-art deep neural models for automatic image classification/tagging, specifically by adapting transformer-based architectures for crisis image classification (CrisisViT). We leverage the new Incidents1M crisis image dataset to develop a range of new transformer-based image ",
    "path": "papers/24/01/2401.02838.json",
    "total_tokens": 856,
    "translated_title": "CrisisViT:一种用于危机图像分类的强大视觉Transformer",
    "translated_abstract": "在紧急情况下，危机应对机构需要快速准确地评估地面情况，以便部署相关服务和资源。然而，由于受影响地区的数据可能稀缺，直到当地的应急响应服务能够提供第一手报告，当局常常必须根据有限信息做出决策。幸运的是，智能手机普及和高质量相机的普遍可用性使得社交媒体上的公民记者成为危机响应者宝贵的信息来源。然而，分析公民发布的大量图片需要比通常可用的时间和努力更多。为了解决这个问题，本文提出了使用最先进的深度神经模型进行自动图像分类/标记的方法，具体来说是通过将Transformer架构应用于危机图像分类中（CrisisViT）。我们利用新的Incidents1M危机图像数据集开发了一系列基于Transformer的新方法。",
    "tldr": "CrisisViT是一种用于危机图像分类的强大视觉Transformer，通过使用深度神经模型自动分类和标记图像，应对了社交媒体上大量危机图片分析需要更多时间和努力的问题。",
    "en_tdlr": "CrisisViT is a robust vision transformer for crisis image classification that addresses the challenge of analyzing a large volume of crisis images posted on social media by leveraging deep neural models for automatic image classification and tagging."
}