{
    "title": "UnetTSF: A Better Performance Linear Complexity Time Series Prediction Model. (arXiv:2401.03001v1 [cs.LG])",
    "abstract": "Recently, Transformer-base models have made significant progress in the field of time series prediction which have achieved good results and become baseline models beyond Dlinear. The paper proposes an U-Net time series prediction model (UnetTSF) with linear complexity, which adopts the U-Net architecture. We are the first to use FPN technology to extract features from time series data, replacing the method of decomposing time series data into trend and seasonal terms, while designing a fusion structure suitable for time series data. After testing on 8 open-source datasets, compared to the best linear model DLiner. Out of 32 testing projects, 31 achieved the best results. The average decrease in mse is 10.1%, while the average decrease in mae is 9.1%. Compared with the complex transformer-base PatchTST, UnetTSF obtained 9 optimal results for mse and 15 optimal results for mae in 32 testing projects.",
    "link": "http://arxiv.org/abs/2401.03001",
    "context": "Title: UnetTSF: A Better Performance Linear Complexity Time Series Prediction Model. (arXiv:2401.03001v1 [cs.LG])\nAbstract: Recently, Transformer-base models have made significant progress in the field of time series prediction which have achieved good results and become baseline models beyond Dlinear. The paper proposes an U-Net time series prediction model (UnetTSF) with linear complexity, which adopts the U-Net architecture. We are the first to use FPN technology to extract features from time series data, replacing the method of decomposing time series data into trend and seasonal terms, while designing a fusion structure suitable for time series data. After testing on 8 open-source datasets, compared to the best linear model DLiner. Out of 32 testing projects, 31 achieved the best results. The average decrease in mse is 10.1%, while the average decrease in mae is 9.1%. Compared with the complex transformer-base PatchTST, UnetTSF obtained 9 optimal results for mse and 15 optimal results for mae in 32 testing projects.",
    "path": "papers/24/01/2401.03001.json",
    "total_tokens": 897,
    "translated_title": "UnetTSF:一个性能更好的线性复杂度时间序列预测模型",
    "translated_abstract": "最近，基于Transformer的模型在时间序列预测领域取得了显著进展，已经成为Dlinear基准模型之外的一种基线模型。本文提出了一种具有线性复杂度的U-Net时间序列预测模型(UnetTSF)，采用了U-Net架构。我们是首次使用FPN技术从时间序列数据中提取特征，取代了将时间序列数据分解为趋势和季节项的方法，同时设计了适用于时间序列数据的融合结构。在8个开源数据集上进行测试后，与最佳线性模型DLiner相比，31个测试项目中有32个取得了最佳结果。平均mse下降10.1％，平均mae下降9.1％。与复杂的基于Transformer的PatchTST相比，UnetTSF在32个测试项目中获得了9个mse的最佳结果和15个mae的最佳结果。",
    "tldr": "UnetTSF是一种具有线性复杂度的U-Net时间序列预测模型，通过使用FPN技术提取特征和设计适用于时间序列数据的融合结构，相比于DLiner和PatchTST模型，在多个测试项目中取得了更好的预测结果。",
    "en_tdlr": "UnetTSF is a U-Net time series prediction model with linear complexity. By using FPN technology to extract features and designing a fusion structure suitable for time series data, it achieves better prediction results compared to DLiner and PatchTST models in multiple testing projects."
}