{
    "title": "RefreshNet: Learning Multiscale Dynamics through Hierarchical Refreshing. (arXiv:2401.13282v1 [cs.LG])",
    "abstract": "Forecasting complex system dynamics, particularly for long-term predictions, is persistently hindered by error accumulation and computational burdens. This study presents RefreshNet, a multiscale framework developed to overcome these challenges, delivering an unprecedented balance between computational efficiency and predictive accuracy. RefreshNet incorporates convolutional autoencoders to identify a reduced order latent space capturing essential features of the dynamics, and strategically employs multiple recurrent neural network (RNN) blocks operating at varying temporal resolutions within the latent space, thus allowing the capture of latent dynamics at multiple temporal scales. The unique \"refreshing\" mechanism in RefreshNet allows coarser blocks to reset inputs of finer blocks, effectively controlling and alleviating error accumulation. This design demonstrates superiority over existing techniques regarding computational efficiency and predictive accuracy, especially in long-term",
    "link": "http://arxiv.org/abs/2401.13282",
    "context": "Title: RefreshNet: Learning Multiscale Dynamics through Hierarchical Refreshing. (arXiv:2401.13282v1 [cs.LG])\nAbstract: Forecasting complex system dynamics, particularly for long-term predictions, is persistently hindered by error accumulation and computational burdens. This study presents RefreshNet, a multiscale framework developed to overcome these challenges, delivering an unprecedented balance between computational efficiency and predictive accuracy. RefreshNet incorporates convolutional autoencoders to identify a reduced order latent space capturing essential features of the dynamics, and strategically employs multiple recurrent neural network (RNN) blocks operating at varying temporal resolutions within the latent space, thus allowing the capture of latent dynamics at multiple temporal scales. The unique \"refreshing\" mechanism in RefreshNet allows coarser blocks to reset inputs of finer blocks, effectively controlling and alleviating error accumulation. This design demonstrates superiority over existing techniques regarding computational efficiency and predictive accuracy, especially in long-term",
    "path": "papers/24/01/2401.13282.json",
    "total_tokens": 832,
    "translated_title": "RefreshNet: 通过分层刷新学习多尺度动态",
    "translated_abstract": "预测复杂系统动力学，特别是对于长期预测，始终受到误差累积和计算负担的限制。本研究提出了RefreshNet，这是一个多尺度框架，旨在克服这些挑战，提供了计算效率和预测准确性之间的前所未有的平衡。RefreshNet结合了卷积自动编码器，用于识别捕捉动态的基本特征的降阶潜在空间，并在潜在空间内策略性地使用多个时间分辨率不同的递归神经网络（RNN）块，从而允许多个时间尺度上捕捉潜在动态。RefreshNet中的独特的“刷新”机制允许较粗糙的块重新设置较细块的输入，有效控制和减轻误差累积。这种设计在计算效率和预测准确性方面表现出优越性，特别是在长期预测中。",
    "tldr": "RefreshNet是一个多尺度框架，通过分层刷新机制来学习复杂系统的动态，实现了计算效率和预测准确性的平衡。"
}