{
    "title": "Probabilistic Demand Forecasting with Graph Neural Networks. (arXiv:2401.13096v1 [cs.LG])",
    "abstract": "Demand forecasting is a prominent business use case that allows retailers to optimize inventory planning, logistics, and core business decisions. One of the key challenges in demand forecasting is accounting for relationships and interactions between articles. Most modern forecasting approaches provide independent article-level predictions that do not consider the impact of related articles. Recent research has attempted addressing this challenge using Graph Neural Networks (GNNs) and showed promising results. This paper builds on previous research on GNNs and makes two contributions. First, we integrate a GNN encoder into a state-of-the-art DeepAR model. The combined model produces probabilistic forecasts, which are crucial for decision-making under uncertainty. Second, we propose to build graphs using article attribute similarity, which avoids reliance on a pre-defined graph structure. Experiments on three real-world datasets show that the proposed approach consistently outperforms n",
    "link": "http://arxiv.org/abs/2401.13096",
    "context": "Title: Probabilistic Demand Forecasting with Graph Neural Networks. (arXiv:2401.13096v1 [cs.LG])\nAbstract: Demand forecasting is a prominent business use case that allows retailers to optimize inventory planning, logistics, and core business decisions. One of the key challenges in demand forecasting is accounting for relationships and interactions between articles. Most modern forecasting approaches provide independent article-level predictions that do not consider the impact of related articles. Recent research has attempted addressing this challenge using Graph Neural Networks (GNNs) and showed promising results. This paper builds on previous research on GNNs and makes two contributions. First, we integrate a GNN encoder into a state-of-the-art DeepAR model. The combined model produces probabilistic forecasts, which are crucial for decision-making under uncertainty. Second, we propose to build graphs using article attribute similarity, which avoids reliance on a pre-defined graph structure. Experiments on three real-world datasets show that the proposed approach consistently outperforms n",
    "path": "papers/24/01/2401.13096.json",
    "total_tokens": 879,
    "translated_title": "使用图神经网络进行概率需求预测",
    "translated_abstract": "需求预测是一种重要的商业应用案例，它可以帮助零售商优化库存规划、物流和核心业务决策。需求预测的一个关键挑战是考虑文章之间的关系和互动。大多数现代预测方法提供独立的文章级预测，不考虑相关文章的影响。最近的研究尝试使用图神经网络（GNNs）来解决这个挑战，并取得了有希望的结果。本文在之前的GNNs研究基础上做出了两个贡献。首先，我们将GNN编码器集成到最先进的DeepAR模型中。这个组合模型产生概率预测，这在不确定性下的决策制定中至关重要。其次，我们提出使用文章属性相似性构建图，避免依赖预定义的图结构。对三个实际数据集的实验表明，所提出的方法始终优于现有方法。",
    "tldr": "本文提出了一种使用图神经网络进行概率需求预测的方法。该方法在现有的DeepAR模型中集成了GNN编码器，并采用基于文章属性相似性构建图的策略，实验结果表明该方法优于传统方法。"
}