{
    "title": "Modelling and Predicting the Conditional Variance of Bitcoin Daily Returns: Comparsion of Markov Switching GARCH and SV Models. (arXiv:2401.03393v1 [q-fin.ST])",
    "abstract": "This paper introduces a unique and valuable research design aimed at analyzing Bitcoin price volatility. To achieve this, a range of models from the Markov Switching-GARCH and Stochastic Autoregressive Volatility (SARV) model classes are considered and their out-of-sample forecasting performance is thoroughly examined. The paper provides insights into the rationale behind the recommendation for a two-stage estimation approach, emphasizing the separate estimation of coefficients in the mean and variance equations. The results presented in this paper indicate that Stochastic Volatility models, particularly SARV models, outperform MS-GARCH models in forecasting Bitcoin price volatility. Moreover, the study suggests that in certain situations, persistent simple GARCH models may even outperform Markov-Switching GARCH models in predicting the variance of Bitcoin log returns. These findings offer valuable guidance for risk management experts, highlighting the potential advantages of SARV mode",
    "link": "http://arxiv.org/abs/2401.03393",
    "context": "Title: Modelling and Predicting the Conditional Variance of Bitcoin Daily Returns: Comparsion of Markov Switching GARCH and SV Models. (arXiv:2401.03393v1 [q-fin.ST])\nAbstract: This paper introduces a unique and valuable research design aimed at analyzing Bitcoin price volatility. To achieve this, a range of models from the Markov Switching-GARCH and Stochastic Autoregressive Volatility (SARV) model classes are considered and their out-of-sample forecasting performance is thoroughly examined. The paper provides insights into the rationale behind the recommendation for a two-stage estimation approach, emphasizing the separate estimation of coefficients in the mean and variance equations. The results presented in this paper indicate that Stochastic Volatility models, particularly SARV models, outperform MS-GARCH models in forecasting Bitcoin price volatility. Moreover, the study suggests that in certain situations, persistent simple GARCH models may even outperform Markov-Switching GARCH models in predicting the variance of Bitcoin log returns. These findings offer valuable guidance for risk management experts, highlighting the potential advantages of SARV mode",
    "path": "papers/24/01/2401.03393.json",
    "total_tokens": 1017,
    "translated_title": "对比Markov转换GARCH和SV模型对比的比特币每日收益条件方差的建模和预测",
    "translated_abstract": "本文介绍了一种独特而有价值的研究设计，旨在分析比特币价格的波动性。为了实现这一目标，考虑了一系列来自Markov转换-GARCH和随机自回归波动（SARV）模型类的模型，并对它们的样本外预测性能进行了彻底的考察。本文提供了关于采用两阶段估计方法的建议背后的理念，并强调了在均值方程和方差方程中分别估计系数的重要性。本文的结果表明，随机波动模型，特别是SARV模型，在预测比特币价格的波动性方面表现优于MS-GARCH模型。此外，研究表明，在某些情况下，持续的简单GARCH模型甚至在预测比特币对数收益的方差方面表现出色于Markov转换GARCH模型。这些发现为风险管理专家提供了宝贵的指导，突出了SARV模型的潜在优势。",
    "tldr": "本文通过比较Markov转换GARCH和SV模型，研究了比特币每日收益的条件方差建模和预测。结果显示，SARV模型在预测比特币价格的波动性方面优于MS-GARCH模型，并且在某些情况下，简单的GARCH模型甚至优于Markov转换GARCH模型。这为风险管理专家提供了有价值的指导。",
    "en_tdlr": "This paper compares Markov Switching GARCH and SV models for modeling and predicting the conditional variance of Bitcoin daily returns. The results show that SARV models outperform MS-GARCH models in forecasting Bitcoin price volatility, and in certain situations, simple GARCH models may even perform better than Markov-Switching GARCH models. These findings offer valuable guidance for risk management experts."
}