{
    "title": "An Invariant Information Geometric Method for High-Dimensional Online Optimization. (arXiv:2401.01579v1 [cs.LG])",
    "abstract": "Sample efficiency is crucial in optimization, particularly in black-box scenarios characterized by expensive evaluations and zeroth-order feedback. When computing resources are plentiful, Bayesian optimization is often favored over evolution strategies. In this paper, we introduce a full invariance oriented evolution strategies algorithm, derived from its corresponding framework, that effectively rivals the leading Bayesian optimization method in tasks with dimensions at the upper limit of Bayesian capability. Specifically, we first build the framework InvIGO that fully incorporates historical information while retaining the full invariant and computational complexity. We then exemplify InvIGO on multi-dimensional Gaussian, which gives an invariant and scalable optimizer SynCMA . The theoretical behavior and advantages of our algorithm over other Gaussian-based evolution strategies are further analyzed. Finally, We benchmark SynCMA against leading algorithms in Bayesian optimization an",
    "link": "http://arxiv.org/abs/2401.01579",
    "context": "Title: An Invariant Information Geometric Method for High-Dimensional Online Optimization. (arXiv:2401.01579v1 [cs.LG])\nAbstract: Sample efficiency is crucial in optimization, particularly in black-box scenarios characterized by expensive evaluations and zeroth-order feedback. When computing resources are plentiful, Bayesian optimization is often favored over evolution strategies. In this paper, we introduce a full invariance oriented evolution strategies algorithm, derived from its corresponding framework, that effectively rivals the leading Bayesian optimization method in tasks with dimensions at the upper limit of Bayesian capability. Specifically, we first build the framework InvIGO that fully incorporates historical information while retaining the full invariant and computational complexity. We then exemplify InvIGO on multi-dimensional Gaussian, which gives an invariant and scalable optimizer SynCMA . The theoretical behavior and advantages of our algorithm over other Gaussian-based evolution strategies are further analyzed. Finally, We benchmark SynCMA against leading algorithms in Bayesian optimization an",
    "path": "papers/24/01/2401.01579.json",
    "total_tokens": 927,
    "translated_title": "高维在线优化的不变信息几何方法",
    "translated_abstract": "在优化中，样本效率对于昂贵评估和零阶反馈的黑盒场景尤为重要。当计算资源充足时，贝叶斯优化通常优于演化策略。在本文中，我们介绍了一种完全基于不变性的演化策略算法，从其相应的框架中推导出来，在贝叶斯能力上限的任务中有效地与领先的贝叶斯优化方法竞争。具体而言，我们首先构建了一个完全包含历史信息的框架InvIGO，同时保持了完全不变和计算复杂性。然后，我们在多维高斯分布上示例化了InvIGO，得到了一种不变且可扩展的优化器SynCMA。进一步分析了我们的算法与其他基于高斯的演化策略的理论行为和优势。最后，我们将SynCMA与贝叶斯优化的主要算法进行了基准测试。",
    "tldr": "本文介绍了一种基于不变性的演化策略算法，在贝叶斯能力上限的任务中与领先的贝叶斯优化方法竞争。我们构建了一个完全包含历史信息的框架，并在多维高斯分布上示例化了一种不变且可扩展的优化器。该算法相较于其他基于高斯的演化策略具有理论上的优势。",
    "en_tdlr": "This paper introduces an invariant evolution strategies algorithm that competes effectively with leading Bayesian optimization methods in tasks at the upper limit of Bayesian capability. The algorithm is built using a framework that incorporates historical information and exemplifies a scalable optimizer on multi-dimensional Gaussian distributions, outperforming other Gaussian-based evolution strategies."
}