{
    "title": "Motif-aware Riemannian Graph Neural Network with Generative-Contrastive Learning. (arXiv:2401.01232v1 [cs.LG])",
    "abstract": "Graphs are typical non-Euclidean data of complex structures. In recent years, Riemannian graph representation learning has emerged as an exciting alternative to Euclidean ones. However, Riemannian methods are still in an early stage: most of them present a single curvature (radius) regardless of structural complexity, suffer from numerical instability due to the exponential/logarithmic map, and lack the ability to capture motif regularity. In light of the issues above, we propose the problem of \\emph{Motif-aware Riemannian Graph Representation Learning}, seeking a numerically stable encoder to capture motif regularity in a diverse-curvature manifold without labels. To this end, we present a novel Motif-aware Riemannian model with Generative-Contrastive learning (MotifRGC), which conducts a minmax game in Riemannian manifold in a self-supervised manner. First, we propose a new type of Riemannian GCN (D-GCN), in which we construct a diverse-curvature manifold by a product layer with the ",
    "link": "http://arxiv.org/abs/2401.01232",
    "context": "Title: Motif-aware Riemannian Graph Neural Network with Generative-Contrastive Learning. (arXiv:2401.01232v1 [cs.LG])\nAbstract: Graphs are typical non-Euclidean data of complex structures. In recent years, Riemannian graph representation learning has emerged as an exciting alternative to Euclidean ones. However, Riemannian methods are still in an early stage: most of them present a single curvature (radius) regardless of structural complexity, suffer from numerical instability due to the exponential/logarithmic map, and lack the ability to capture motif regularity. In light of the issues above, we propose the problem of \\emph{Motif-aware Riemannian Graph Representation Learning}, seeking a numerically stable encoder to capture motif regularity in a diverse-curvature manifold without labels. To this end, we present a novel Motif-aware Riemannian model with Generative-Contrastive learning (MotifRGC), which conducts a minmax game in Riemannian manifold in a self-supervised manner. First, we propose a new type of Riemannian GCN (D-GCN), in which we construct a diverse-curvature manifold by a product layer with the ",
    "path": "papers/24/01/2401.01232.json",
    "total_tokens": 935,
    "translated_title": "具有生成-对比学习的基于主题的黎曼图神经网络",
    "translated_abstract": "图是典型的复杂结构的非欧几里得数据。近年来，黎曼图表示学习作为欧几里得方法的一种激动人心的替代方案出现了。然而，黎曼方法仍处于早期阶段：大多数方法只提供了一个曲率（半径），无视结构复杂性，由于指数/对数映射而导致数值不稳定，并且缺乏捕捉主题规律的能力。鉴于上述问题，我们提出了“基于主题的黎曼图表示学习”的问题，寻求一种数值稳定的编码器，在没有标签的情况下捕捉多样曲率流形中的主题规律。为此，我们提出了一种新颖的具有生成-对比学习的MotifRGC模型，以自监督方式在黎曼流形中进行minmax博弈。首先，我们提出了一种新类型的黎曼GCN（D-GCN），通过使用产品层来构建多样曲率流形",
    "tldr": "本论文提出了一种基于主题的黎曼图神经网络模型，通过生成-对比学习在黎曼流形中进行自监督学习，以捕捉多样曲率流形中的主题规律。",
    "en_tdlr": "This paper proposes a motif-aware Riemannian graph neural network model, which utilizes generative-contrastive learning in a self-supervised manner to capture motif regularity in diverse-curvature manifolds."
}