{
    "title": "SNAP: Semantic Stories for Next Activity Prediction",
    "abstract": "arXiv:2401.15621v2 Announce Type: replace  Abstract: Predicting the next activity in an ongoing process is one of the most common classification tasks in the business process management (BPM) domain. It allows businesses to optimize resource allocation, enhance operational efficiency, and aids in risk mitigation and strategic decision-making. This provides a competitive edge in the rapidly evolving confluence of BPM and AI. Existing state-of-the-art AI models for business process prediction do not fully capitalize on available semantic information within process event logs. As current advanced AI-BPM systems provide semantically-richer textual data, the need for novel adequate models grows. To address this gap, we propose the novel SNAP method that leverages language foundation models by constructing semantic contextual stories from the process historical event logs and using them for the next activity prediction. We compared the SNAP algorithm with nine state-of-the-art models on six ",
    "link": "https://arxiv.org/abs/2401.15621",
    "context": "Title: SNAP: Semantic Stories for Next Activity Prediction\nAbstract: arXiv:2401.15621v2 Announce Type: replace  Abstract: Predicting the next activity in an ongoing process is one of the most common classification tasks in the business process management (BPM) domain. It allows businesses to optimize resource allocation, enhance operational efficiency, and aids in risk mitigation and strategic decision-making. This provides a competitive edge in the rapidly evolving confluence of BPM and AI. Existing state-of-the-art AI models for business process prediction do not fully capitalize on available semantic information within process event logs. As current advanced AI-BPM systems provide semantically-richer textual data, the need for novel adequate models grows. To address this gap, we propose the novel SNAP method that leverages language foundation models by constructing semantic contextual stories from the process historical event logs and using them for the next activity prediction. We compared the SNAP algorithm with nine state-of-the-art models on six ",
    "path": "papers/24/01/2401.15621.json",
    "total_tokens": 775,
    "translated_title": "SNAP: 用于下一步活动预测的语义故事",
    "translated_abstract": "预测正在进行过程中的下一个活动是业务流程管理（BPM）领域中最常见的分类任务之一。它使企业能够优化资源分配，提高运营效率，并有助于风险缓解和战略决策。这为BPM和AI快速演变的交汇提供了竞争优势。现有的业务流程预测AI模型未充分利用过程事件日志中可用的语义信息。鉴于当前先进的AI-BPM系统提供更丰富的文本数据，因此需要新颖的充分模型。为了填补这一差距，我们提出了一种新颖的SNAP方法，通过构建语义上下文故事从过程历史事件日志中获得，并将其用于下一步活动预测。我们将SNAP算法与九种最先进模型在六",
    "tldr": "SNAP方法利用语言基础模型构建语义上下文故事，从过程历史事件日志中提取信息，用于预测下一步活动。"
}