{
    "title": "Deep autoregressive modeling for land use land cover. (arXiv:2401.01395v1 [cs.CV])",
    "abstract": "Land use / land cover (LULC) modeling is a challenging task due to long-range dependencies between geographic features and distinct spatial patterns related to topography, ecology, and human development. We identify a close connection between modeling of spatial patterns of land use and the task of image inpainting from computer vision and conduct a study of a modified PixelCNN architecture with approximately 19 million parameters for modeling LULC. In comparison with a benchmark spatial statistical model, we find that the former is capable of capturing much richer spatial correlation patterns such as roads and water bodies but does not produce a calibrated predictive distribution, suggesting the need for additional tuning. We find evidence of predictive underdispersion with regard to important ecologically-relevant land use statistics such as patch count and adjacency which can be ameliorated to some extent by manipulating sampling variability.",
    "link": "http://arxiv.org/abs/2401.01395",
    "context": "Title: Deep autoregressive modeling for land use land cover. (arXiv:2401.01395v1 [cs.CV])\nAbstract: Land use / land cover (LULC) modeling is a challenging task due to long-range dependencies between geographic features and distinct spatial patterns related to topography, ecology, and human development. We identify a close connection between modeling of spatial patterns of land use and the task of image inpainting from computer vision and conduct a study of a modified PixelCNN architecture with approximately 19 million parameters for modeling LULC. In comparison with a benchmark spatial statistical model, we find that the former is capable of capturing much richer spatial correlation patterns such as roads and water bodies but does not produce a calibrated predictive distribution, suggesting the need for additional tuning. We find evidence of predictive underdispersion with regard to important ecologically-relevant land use statistics such as patch count and adjacency which can be ameliorated to some extent by manipulating sampling variability.",
    "path": "papers/24/01/2401.01395.json",
    "total_tokens": 838,
    "translated_title": "深度自回归建模用于土地利用和土地覆盖",
    "translated_abstract": "由于地理要素之间的长程依赖以及与地形、生态和人类发展相关的明显空间模式，土地利用和土地覆盖（LULC）建模是一项具有挑战性的任务。我们发现土地利用空间模式建模与计算机视觉中的图像修复任务存在密切联系，并对具有约1900万参数的修改PixelCNN架构进行了LULC建模的研究。与基准空间统计模型相比，我们发现前者能够捕捉到更丰富的空间相关模式，如道路和水体，但不能产生校准的预测分布，这表明需要进行额外的调整。我们发现在与重要的生态相关土地利用统计数据（如斑块数量和相邻性）相比中存在预测性低分散的证据，这可以通过操作抽样可变性在一定程度上得到改善。",
    "tldr": "本研究使用深度自回归模型对土地利用和土地覆盖进行建模，在捕捉丰富的空间相关模式方面超过了基准模型，但需要进一步调整以产生更准确的预测分布。",
    "en_tdlr": "This study uses deep autoregressive modeling to capture rich spatial correlation patterns in land use and land cover, outperforming benchmark models but requiring additional tuning for more accurate predictive distribution."
}