{
    "title": "Charting the Future of AI in Project-Based Learning: A Co-Design Exploration with Students. (arXiv:2401.14915v1 [cs.HC])",
    "abstract": "The increasing use of Artificial Intelligence (AI) by students in learning presents new challenges for assessing their learning outcomes in project-based learning (PBL). This paper introduces a co-design study to explore the potential of students' AI usage data as a novel material for PBL assessment. We conducted workshops with 18 college students, encouraging them to speculate an alternative world where they could freely employ AI in PBL while needing to report this process to assess their skills and contributions. Our workshops yielded various scenarios of students' use of AI in PBL and ways of analyzing these uses grounded by students' vision of education goal transformation. We also found students with different attitudes toward AI exhibited distinct preferences in how to analyze and understand the use of AI. Based on these findings, we discuss future research opportunities on student-AI interactions and understanding AI-enhanced learning.",
    "link": "http://arxiv.org/abs/2401.14915",
    "context": "Title: Charting the Future of AI in Project-Based Learning: A Co-Design Exploration with Students. (arXiv:2401.14915v1 [cs.HC])\nAbstract: The increasing use of Artificial Intelligence (AI) by students in learning presents new challenges for assessing their learning outcomes in project-based learning (PBL). This paper introduces a co-design study to explore the potential of students' AI usage data as a novel material for PBL assessment. We conducted workshops with 18 college students, encouraging them to speculate an alternative world where they could freely employ AI in PBL while needing to report this process to assess their skills and contributions. Our workshops yielded various scenarios of students' use of AI in PBL and ways of analyzing these uses grounded by students' vision of education goal transformation. We also found students with different attitudes toward AI exhibited distinct preferences in how to analyze and understand the use of AI. Based on these findings, we discuss future research opportunities on student-AI interactions and understanding AI-enhanced learning.",
    "path": "papers/24/01/2401.14915.json",
    "total_tokens": 957,
    "translated_title": "AI在基于项目的学习中的未来规划：与学生一起进行共同设计探索",
    "translated_abstract": "学生在学习中越来越多地使用人工智能（AI），这给基于项目的学习（PBL）的评估带来了新的挑战。本文介绍了一项共同设计研究，探索学生的AI使用数据作为PBL评估的新材料的潜力。我们与18名大学生进行了研讨会，鼓励他们设想一个可以自由使用AI进行PBL的另一个世界，同时需要报告这个过程以评估他们的技能和贡献。我们的研讨会产生了各种学生在PBL中使用AI的情景，以及基于学生对教育目标转变的视觉进行分析这些使用的方式。我们还发现对AI持有不同态度的学生在分析和理解AI使用方面有不同的偏好。基于这些发现，我们讨论了关于学生与AI交互和理解AI增强学习的未来研究机会。",
    "tldr": "本文介绍了一项与学生共同设计的研究，探索学生在项目化学习中使用人工智能的潜力，并基于学生的视觉对教育目标转变进行分析。研究发现，不同态度的学生对人工智能的使用有不同的偏好。这为未来研究学生与人工智能交互和理解增强学习提供了机会。",
    "en_tdlr": "This paper introduces a co-design study exploring the potential of students' AI usage in project-based learning and analyzing these uses based on students' vision of education goal transformation. The research found that students with different attitudes towards AI exhibit distinct preferences in AI usage, providing opportunities for future research on student-AI interactions and understanding AI-enhanced learning."
}