{
    "title": "Segment Boundary Detection via Class Entropy Measurements in Connectionist Phoneme Recognition. (arXiv:2401.05717v1 [eess.AS])",
    "abstract": "This article investigates the possibility to use the class entropy of the output of a connectionist phoneme recogniser to predict time boundaries between phonetic classes. The rationale is that the value of the entropy should increase in proximity of a transition between two segments that are well modelled (known) by the recognition network since it is a measure of uncertainty. The advantage of this measure is its simplicity as the posterior probabilities of each class are available in connectionist phoneme recognition. The entropy and a number of measures based on differentiation of the entropy are used in isolation and in combination. The decision methods for predicting the boundaries range from simple thresholds to neural network based procedure. The different methods are compared with respect to their precision, measured in terms of the ratio between the number C of predicted boundaries within 10 or 20 msec of the reference and the total number of predicted boundaries, and recall, ",
    "link": "http://arxiv.org/abs/2401.05717",
    "context": "Title: Segment Boundary Detection via Class Entropy Measurements in Connectionist Phoneme Recognition. (arXiv:2401.05717v1 [eess.AS])\nAbstract: This article investigates the possibility to use the class entropy of the output of a connectionist phoneme recogniser to predict time boundaries between phonetic classes. The rationale is that the value of the entropy should increase in proximity of a transition between two segments that are well modelled (known) by the recognition network since it is a measure of uncertainty. The advantage of this measure is its simplicity as the posterior probabilities of each class are available in connectionist phoneme recognition. The entropy and a number of measures based on differentiation of the entropy are used in isolation and in combination. The decision methods for predicting the boundaries range from simple thresholds to neural network based procedure. The different methods are compared with respect to their precision, measured in terms of the ratio between the number C of predicted boundaries within 10 or 20 msec of the reference and the total number of predicted boundaries, and recall, ",
    "path": "papers/24/01/2401.05717.json",
    "total_tokens": 824,
    "translated_title": "通过连接主义音素识别中的类熵测量进行分割边界检测",
    "translated_abstract": "本文研究了使用连接主义音素识别器的输出的类熵来预测音素类之间的时间边界的可能性。其原理是，熵的值应该在两个由识别网络很好建模（已知）的片段之间的过渡附近增加，因为它是不确定性的一个度量。类熵的优势在于它的简单性，因为每个类的后验概率在连接主义音素识别中是可用的。熵和一些基于熵差异的度量被单独和组合使用。用于预测边界的决策方法从简单的阈值到基于神经网络的过程不等。不同的方法在精确度方面进行比较，以C（在参考时间的10或20毫秒内预测的边界数量）与预测边界总数之间的比率和召回率为度量。",
    "tldr": "本文研究了使用连接主义音素识别器的类熵来预测音素类之间的时间边界，并比较了不同方法的精确度和召回率。"
}