{
    "title": "Evaluating the Fairness of the MIMIC-IV Dataset and a Baseline Algorithm: Application to the ICU Length of Stay Prediction. (arXiv:2401.00902v1 [cs.LG])",
    "abstract": "This paper uses the MIMIC-IV dataset to examine the fairness and bias in an XGBoost binary classification model predicting the Intensive Care Unit (ICU) length of stay (LOS). Highlighting the critical role of the ICU in managing critically ill patients, the study addresses the growing strain on ICU capacity. It emphasizes the significance of LOS prediction for resource allocation. The research reveals class imbalances in the dataset across demographic attributes and employs data preprocessing and feature extraction. While the XGBoost model performs well overall, disparities across race and insurance attributes reflect the need for tailored assessments and continuous monitoring. The paper concludes with recommendations for fairness-aware machine learning techniques for mitigating biases and the need for collaborative efforts among healthcare professionals and data scientists.",
    "link": "http://arxiv.org/abs/2401.00902",
    "context": "Title: Evaluating the Fairness of the MIMIC-IV Dataset and a Baseline Algorithm: Application to the ICU Length of Stay Prediction. (arXiv:2401.00902v1 [cs.LG])\nAbstract: This paper uses the MIMIC-IV dataset to examine the fairness and bias in an XGBoost binary classification model predicting the Intensive Care Unit (ICU) length of stay (LOS). Highlighting the critical role of the ICU in managing critically ill patients, the study addresses the growing strain on ICU capacity. It emphasizes the significance of LOS prediction for resource allocation. The research reveals class imbalances in the dataset across demographic attributes and employs data preprocessing and feature extraction. While the XGBoost model performs well overall, disparities across race and insurance attributes reflect the need for tailored assessments and continuous monitoring. The paper concludes with recommendations for fairness-aware machine learning techniques for mitigating biases and the need for collaborative efforts among healthcare professionals and data scientists.",
    "path": "papers/24/01/2401.00902.json",
    "total_tokens": 913,
    "translated_title": "对MIMIC-IV数据集和基准算法的公平性评估：应用于重症监护病房住院时间预测",
    "translated_abstract": "本文利用MIMIC-IV数据集，检查了一个XGBoost二分类模型在预测重症监护病房住院时间时的公平性和偏见。强调了重症监护病房在处理重症患者中的关键作用，研究解决了重症监护病房容量紧张的问题。它强调了住院时间预测对资源分配的重要性。研究揭示了数据集在人口统计属性上的类别不平衡，并采用数据预处理和特征提取。尽管XGBoost模型整体表现良好，但种族和保险属性方面的不平等反映出需要定制评估和持续监测。本文最后提出了关于减少偏见的注重公平性的机器学习技术建议，并强调了医疗专业人员和数据科学家之间的合作努力的必要性。",
    "tldr": "本文使用MIMIC-IV数据集来评估一个XGBoost二分类模型在预测重症监护病房住院时间时的公平性和偏见，结果发现了数据集在人口统计属性上存在类别不平衡，并提出了减少偏见的机器学习技术建议。"
}