{
    "title": "Binaural Angular Separation Network. (arXiv:2401.08864v1 [eess.AS])",
    "abstract": "We propose a neural network model that can separate target speech sources from interfering sources at different angular regions using two microphones. The model is trained with simulated room impulse responses (RIRs) using omni-directional microphones without needing to collect real RIRs. By relying on specific angular regions and multiple room simulations, the model utilizes consistent time difference of arrival (TDOA) cues, or what we call delay contrast, to separate target and interference sources while remaining robust in various reverberation environments. We demonstrate the model is not only generalizable to a commercially available device with a slightly different microphone geometry, but also outperforms our previous work which uses one additional microphone on the same device. The model runs in real-time on-device and is suitable for low-latency streaming applications such as telephony and video conferencing.",
    "link": "http://arxiv.org/abs/2401.08864",
    "context": "Title: Binaural Angular Separation Network. (arXiv:2401.08864v1 [eess.AS])\nAbstract: We propose a neural network model that can separate target speech sources from interfering sources at different angular regions using two microphones. The model is trained with simulated room impulse responses (RIRs) using omni-directional microphones without needing to collect real RIRs. By relying on specific angular regions and multiple room simulations, the model utilizes consistent time difference of arrival (TDOA) cues, or what we call delay contrast, to separate target and interference sources while remaining robust in various reverberation environments. We demonstrate the model is not only generalizable to a commercially available device with a slightly different microphone geometry, but also outperforms our previous work which uses one additional microphone on the same device. The model runs in real-time on-device and is suitable for low-latency streaming applications such as telephony and video conferencing.",
    "path": "papers/24/01/2401.08864.json",
    "total_tokens": 860,
    "translated_title": "双耳角分离网络",
    "translated_abstract": "我们提出了一个神经网络模型，可以使用两个麦克风在不同的角度区域分离目标语音源和干扰源。该模型使用模拟的房间脉冲响应（RIRs）进行训练，无需收集真实的RIRs。通过依赖特定的角度区域和多个房间模拟，该模型利用一致的到达时间差（TDOA）线索，或者我们称之为延迟对比，将目标和干扰源分离，同时在各种混响环境下保持稳健。我们证明了该模型不仅适用于具有略有不同麦克风几何形状的商用设备，而且胜过了我们之前在相同设备上使用的额外麦克风的工作。该模型可以在设备上实时运行，适用于低延迟的流媒体应用，如电话和视频会议。",
    "tldr": "我们提出了一个双耳角分离网络，能够使用两个麦克风在不同的角度区域分离目标语音源和干扰源，在各种混响环境下保持稳健，并在实时场景中表现出良好的性能。",
    "en_tdlr": "We propose a binaural angular separation network that can separate target speech sources from interfering sources at different angular regions using two microphones. The model is robust in various reverberation environments and demonstrates good performance in real-time scenarios."
}