{
    "title": "Machine Learning Classification of Alzheimer's Disease Stages Using Cerebrospinal Fluid Biomarkers Alone. (arXiv:2401.00981v1 [cs.LG])",
    "abstract": "Early diagnosis of Alzheimer's disease is a challenge because the existing methodologies do not identify the patients in their preclinical stage, which can last up to a decade prior to the onset of clinical symptoms. Several research studies demonstrate the potential of cerebrospinal fluid biomarkers, amyloid beta 1-42, T-tau, and P-tau, in early diagnosis of Alzheimer's disease stages. In this work, we used machine learning models to classify different stages of Alzheimer's disease based on the cerebrospinal fluid biomarker levels alone. An electronic health record of patients from the National Alzheimer's Coordinating Centre database was analyzed and the patients were subdivided based on mini-mental state scores and clinical dementia ratings. Statistical and correlation analyses were performed to identify significant differences between the Alzheimer's stages. Afterward, machine learning classifiers including K-Nearest Neighbors, Ensemble Boosted Tree, Ensemble Bagged Tree, Support V",
    "link": "http://arxiv.org/abs/2401.00981",
    "context": "Title: Machine Learning Classification of Alzheimer's Disease Stages Using Cerebrospinal Fluid Biomarkers Alone. (arXiv:2401.00981v1 [cs.LG])\nAbstract: Early diagnosis of Alzheimer's disease is a challenge because the existing methodologies do not identify the patients in their preclinical stage, which can last up to a decade prior to the onset of clinical symptoms. Several research studies demonstrate the potential of cerebrospinal fluid biomarkers, amyloid beta 1-42, T-tau, and P-tau, in early diagnosis of Alzheimer's disease stages. In this work, we used machine learning models to classify different stages of Alzheimer's disease based on the cerebrospinal fluid biomarker levels alone. An electronic health record of patients from the National Alzheimer's Coordinating Centre database was analyzed and the patients were subdivided based on mini-mental state scores and clinical dementia ratings. Statistical and correlation analyses were performed to identify significant differences between the Alzheimer's stages. Afterward, machine learning classifiers including K-Nearest Neighbors, Ensemble Boosted Tree, Ensemble Bagged Tree, Support V",
    "path": "papers/24/01/2401.00981.json",
    "total_tokens": 1014,
    "translated_title": "仅使用脑脊液生物标志物的机器学习分类阿尔茨海默病阶段",
    "translated_abstract": "由于现有的方法无法在临床症状发生之前的潜伏期识别患者，早期诊断阿尔茨海默病是一个挑战。几项研究表明脑脊液生物标志物，淀粉样蛋白β1-42、T-τ和P-τ，对于早期诊断阿尔茨海默病阶段具有潜力。在这项工作中，我们利用机器学习模型根据脑脊液生物标志物水平单独分类阿尔茨海默病的不同阶段。分析了国家阿尔茨海默病协调中心数据库中的患者的电子健康记录，并根据简明精神状态评分和临床痴呆评定将患者细分。进行了统计和相关性分析以确定阿尔茨海默病阶段之间的显著差异。随后，利用K最近邻、集成提升树、集成袋装树、支持向量机等机器学习分类器进行分类。",
    "tldr": "本论文利用脑脊液生物标志物水平，通过机器学习模型对阿尔茨海默病的不同阶段进行分类。研究发现，淀粉样蛋白β1-42、T-τ和P-τ等生物标志物对早期诊断阿尔茨海默病具有潜力。",
    "en_tdlr": "This paper uses machine learning models to classify different stages of Alzheimer's disease based on cerebrospinal fluid biomarker levels alone. The study found that biomarkers such as amyloid beta 1-42, T-tau, and P-tau have potential for early diagnosis of Alzheimer's disease."
}