{
    "title": "Analisis de la incidencia de la inversion extranjera directa y la inversion nacional, en el crecimiento economico de Chile. (arXiv:2401.13674v1 [econ.GN])",
    "abstract": "The research aims to assess the impact of foreign direct investment (FDI) and domestic investment on Chile's economic growth. By elucidating the relationship between FDI and domestic investment, the study contributes valuable insights for economic policy formulation and future investments. The findings hold significance in shaping Chile's international perception as an investment destination, potentially influencing its standing in the global economic landscape. Demonstrating that FDI is a significant driver of economic growth could enhance confidence among foreign investors. The project's importance lies in contributing to economic knowledge and guiding strategic decisions for sustainable economic growth in Chile. Understanding the interplay of FDI and domestic investment allows for a balanced approach, promoting stable economic development and mitigating issues like excessive reliance on foreign investment. The study highlights the theory of internationalization as a conceptual frame",
    "link": "http://arxiv.org/abs/2401.13674",
    "context": "Title: Analisis de la incidencia de la inversion extranjera directa y la inversion nacional, en el crecimiento economico de Chile. (arXiv:2401.13674v1 [econ.GN])\nAbstract: The research aims to assess the impact of foreign direct investment (FDI) and domestic investment on Chile's economic growth. By elucidating the relationship between FDI and domestic investment, the study contributes valuable insights for economic policy formulation and future investments. The findings hold significance in shaping Chile's international perception as an investment destination, potentially influencing its standing in the global economic landscape. Demonstrating that FDI is a significant driver of economic growth could enhance confidence among foreign investors. The project's importance lies in contributing to economic knowledge and guiding strategic decisions for sustainable economic growth in Chile. Understanding the interplay of FDI and domestic investment allows for a balanced approach, promoting stable economic development and mitigating issues like excessive reliance on foreign investment. The study highlights the theory of internationalization as a conceptual frame",
    "path": "papers/24/01/2401.13674.json",
    "total_tokens": 896,
    "translated_title": "分析外国直接投资和国内投资对智利经济增长的影响",
    "translated_abstract": "该研究旨在评估外国直接投资（FDI）和国内投资对智利经济增长的影响。通过阐明FDI和国内投资之间的关系，该研究为经济政策制定和未来投资提供了宝贵的见解。研究结果对塑造智利作为投资目的地的国际形象具有重要意义，可能影响其在全球经济格局中的地位。证明FDI是经济增长的重要推动因素，可以增强外国投资者的信心。该项目的重要性在于为智利的可持续经济增长做出经济知识贡献并指导战略决策。了解FDI和国内投资的相互作用可以采取平衡的方法，促进稳定的经济发展并缓解过度依赖外国投资等问题。该研究强调了国际化理论作为概念框架的重要性。",
    "tldr": "该研究评估了外国直接投资和国内投资对智利经济增长的影响，为经济政策制定和未来投资提供了宝贵的见解，对智利的国际形象和可持续经济增长具有重要意义。"
}