{
    "title": "Bootstrapping OTS-Funcimg Pre-training Model (Botfip) -- A Comprehensive Symbolic Regression Framework. (arXiv:2401.09748v1 [cs.SC])",
    "abstract": "In the field of scientific computing, many problem-solving approaches tend to focus only on the process and final outcome, even in AI for science, there is a lack of deep multimodal information mining behind the data, missing a multimodal framework akin to that in the image-text domain. In this paper, we take Symbolic Regression(SR) as our focal point and, drawing inspiration from the BLIP model in the image-text domain, propose a scientific computing multimodal framework based on Function Images (Funcimg) and Operation Tree Sequence (OTS), named Bootstrapping OTS-Funcimg Pre-training Model (Botfip). In SR experiments, we validate the advantages of Botfip in low-complexity SR problems, showcasing its potential. As a MED framework, Botfip holds promise for future applications in a broader range of scientific computing problems.",
    "link": "http://arxiv.org/abs/2401.09748",
    "context": "Title: Bootstrapping OTS-Funcimg Pre-training Model (Botfip) -- A Comprehensive Symbolic Regression Framework. (arXiv:2401.09748v1 [cs.SC])\nAbstract: In the field of scientific computing, many problem-solving approaches tend to focus only on the process and final outcome, even in AI for science, there is a lack of deep multimodal information mining behind the data, missing a multimodal framework akin to that in the image-text domain. In this paper, we take Symbolic Regression(SR) as our focal point and, drawing inspiration from the BLIP model in the image-text domain, propose a scientific computing multimodal framework based on Function Images (Funcimg) and Operation Tree Sequence (OTS), named Bootstrapping OTS-Funcimg Pre-training Model (Botfip). In SR experiments, we validate the advantages of Botfip in low-complexity SR problems, showcasing its potential. As a MED framework, Botfip holds promise for future applications in a broader range of scientific computing problems.",
    "path": "papers/24/01/2401.09748.json",
    "total_tokens": 884,
    "translated_title": "Bootstrapping OTS-Funcimg Pre-training Model (Botfip) -- 一个全面的符号回归框架",
    "translated_abstract": "在科学计算领域中，许多问题解决方法往往只注重过程和最终结果，即使在科学人工智能领域，也缺乏对数据背后的深度多模态信息挖掘，缺乏类似于图像文本领域的多模态框架。本文以符号回归（SR）为重点，在图像文本领域的BLIP模型的启发下，提出了一种基于函数图像（Funcimg）和操作树序列（OTS）的科学计算多模态框架——引导OTS-Funcimg预训练模型（Botfip）。在SR实验中，我们验证了Botfip在低复杂度的SR问题中的优势，展示了其潜力。作为一个MED框架，Botfip在更广泛的科学计算问题中具有潜力。",
    "tldr": "引入了一个基于函数图像和操作树序列的科学计算多模态框架（Botfip），应用于符号回归问题，并验证了其在低复杂度问题上的优势，展示了其潜力。这个多模态框架在科学计算问题中具有广泛的应用前景。"
}