{
    "title": "Classification and Treatment Learning with Constraints via Composite Heaviside Optimization: a Progressive MIP Method. (arXiv:2401.01565v1 [math.OC])",
    "abstract": "This paper proposes a Heaviside composite optimization approach and presents a progressive (mixed) integer programming (PIP) method for solving multi-class classification and multi-action treatment problems with constraints. A Heaviside composite function is a composite of a Heaviside function (i.e., the indicator function of either the open $( \\, 0,\\infty )$ or closed $[ \\, 0,\\infty \\, )$ interval) with a possibly nondifferentiable function. Modeling-wise, we show how Heaviside composite optimization provides a unified formulation for learning the optimal multi-class classification and multi-action treatment rules, subject to rule-dependent constraints stipulating a variety of domain restrictions. A Heaviside composite function has an equivalent discrete formulation %in terms of integer variables, and the resulting optimization problem can in principle be solved by integer programming (IP) methods. Nevertheless, for constrained learning problems with large data sets, %of modest or lar",
    "link": "http://arxiv.org/abs/2401.01565",
    "context": "Title: Classification and Treatment Learning with Constraints via Composite Heaviside Optimization: a Progressive MIP Method. (arXiv:2401.01565v1 [math.OC])\nAbstract: This paper proposes a Heaviside composite optimization approach and presents a progressive (mixed) integer programming (PIP) method for solving multi-class classification and multi-action treatment problems with constraints. A Heaviside composite function is a composite of a Heaviside function (i.e., the indicator function of either the open $( \\, 0,\\infty )$ or closed $[ \\, 0,\\infty \\, )$ interval) with a possibly nondifferentiable function. Modeling-wise, we show how Heaviside composite optimization provides a unified formulation for learning the optimal multi-class classification and multi-action treatment rules, subject to rule-dependent constraints stipulating a variety of domain restrictions. A Heaviside composite function has an equivalent discrete formulation %in terms of integer variables, and the resulting optimization problem can in principle be solved by integer programming (IP) methods. Nevertheless, for constrained learning problems with large data sets, %of modest or lar",
    "path": "papers/24/01/2401.01565.json",
    "total_tokens": 781,
    "translated_title": "通过复合Heaviside优化实现约束的分类和治疗学习：一种渐进MIP方法",
    "translated_abstract": "本文提出了一种Heaviside复合优化方法，并提出了一种渐进（混合）整数规划（PIP）方法，用于解决带有约束的多类别分类和多动作治疗问题。Heaviside复合函数是Heaviside函数（即开区间$(0, \\infty)$或闭区间$[0, \\infty)$的指示函数）与可能非可微函数的复合。在建模方面，我们展示了Heaviside复合优化如何为学习最优多类别分类和多动作治疗规则提供统一的表达，这些规则受到规则依赖约束的限制，规定了各种领域限制。Heaviside复合函数具有等效的离散表达形式，可以通过整数规划（IP）方法解决。然而，对于具有大数据集的约束学习问题，",
    "tldr": "本文提出了一种使用Heaviside复合优化的渐进MIP方法，用于解决带有约束的多类别分类和多动作治疗问题。"
}