{
    "title": "Metric Dynamic Equilibrium Logic. (arXiv:2401.10781v1 [cs.AI])",
    "abstract": "In temporal extensions of Answer Set Programming (ASP) based on linear-time, the behavior of dynamic systems is captured by sequences of states. While this representation reflects their relative order, it abstracts away the specific times associated with each state. In many applications, however, timing constraints are important like, for instance, when planning and scheduling go hand in hand. We address this by developing a metric extension of linear-time Dynamic Equilibrium Logic, in which dynamic operators are constrained by intervals over integers. The resulting Metric Dynamic Equilibrium Logic provides the foundation of an ASP-based approach for specifying qualitative and quantitative dynamic constraints. As such, it constitutes the most general among a whole spectrum of temporal extensions of Equilibrium Logic. In detail, we show that it encompasses Temporal, Dynamic, Metric, and regular Equilibrium Logic, as well as its classic counterparts once the law of the excluded middle is",
    "link": "http://arxiv.org/abs/2401.10781",
    "context": "Title: Metric Dynamic Equilibrium Logic. (arXiv:2401.10781v1 [cs.AI])\nAbstract: In temporal extensions of Answer Set Programming (ASP) based on linear-time, the behavior of dynamic systems is captured by sequences of states. While this representation reflects their relative order, it abstracts away the specific times associated with each state. In many applications, however, timing constraints are important like, for instance, when planning and scheduling go hand in hand. We address this by developing a metric extension of linear-time Dynamic Equilibrium Logic, in which dynamic operators are constrained by intervals over integers. The resulting Metric Dynamic Equilibrium Logic provides the foundation of an ASP-based approach for specifying qualitative and quantitative dynamic constraints. As such, it constitutes the most general among a whole spectrum of temporal extensions of Equilibrium Logic. In detail, we show that it encompasses Temporal, Dynamic, Metric, and regular Equilibrium Logic, as well as its classic counterparts once the law of the excluded middle is",
    "path": "papers/24/01/2401.10781.json",
    "total_tokens": 792,
    "translated_title": "度量动态平衡逻辑",
    "translated_abstract": "在基于线性时间的Answer Set Programming（ASP）的时间扩展中，动态系统的行为通过状态序列来捕捉。虽然这种表示反映了它们的相对顺序，但是它省略了与每个状态相关联的具体时间。然而，在许多应用中，时间约束很重要，例如，在规划和调度同时进行时。我们通过开发基于度量的线性时间动态平衡逻辑来解决这个问题，其中动态操作符受到整数区间的约束。由此产生的度量动态平衡逻辑为基于ASP的定性和定量动态约束规范提供了基础。因此，在Equilibrium Logic的一系列时间扩展中，它是最通用的。具体而言，我们展示它包括了Temporal、Dynamic、Metric和regular Equilibrium Logic，以及在排中律成立时的经典对应物。",
    "tldr": "该论文提出了度量动态平衡逻辑，它是一种基于ASP的方法，用于指定定性和定量的动态约束。它是Equilibrium Logic的最通用的时间扩展之一。"
}