{
    "title": "Tree Search-Based Evolutionary Bandits for Protein Sequence Optimization. (arXiv:2401.06173v1 [q-bio.BM])",
    "abstract": "While modern biotechnologies allow synthesizing new proteins and function measurements at scale, efficiently exploring a protein sequence space and engineering it remains a daunting task due to the vast sequence space of any given protein. Protein engineering is typically conducted through an iterative process of adding mutations to the wild-type or lead sequences, recombination of mutations, and running new rounds of screening. To enhance the efficiency of such a process, we propose a tree search-based bandit learning method, which expands a tree starting from the initial sequence with the guidance of a bandit machine learning model. Under simplified assumptions and a Gaussian Process prior, we provide theoretical analysis and a Bayesian regret bound, demonstrating that the combination of local search and bandit learning method can efficiently discover a near-optimal design. The full algorithm is compatible with a suite of randomized tree search heuristics, machine learning models, pr",
    "link": "http://arxiv.org/abs/2401.06173",
    "context": "Title: Tree Search-Based Evolutionary Bandits for Protein Sequence Optimization. (arXiv:2401.06173v1 [q-bio.BM])\nAbstract: While modern biotechnologies allow synthesizing new proteins and function measurements at scale, efficiently exploring a protein sequence space and engineering it remains a daunting task due to the vast sequence space of any given protein. Protein engineering is typically conducted through an iterative process of adding mutations to the wild-type or lead sequences, recombination of mutations, and running new rounds of screening. To enhance the efficiency of such a process, we propose a tree search-based bandit learning method, which expands a tree starting from the initial sequence with the guidance of a bandit machine learning model. Under simplified assumptions and a Gaussian Process prior, we provide theoretical analysis and a Bayesian regret bound, demonstrating that the combination of local search and bandit learning method can efficiently discover a near-optimal design. The full algorithm is compatible with a suite of randomized tree search heuristics, machine learning models, pr",
    "path": "papers/24/01/2401.06173.json",
    "total_tokens": 909,
    "translated_title": "基于树搜索的进化赌博机用于蛋白质序列优化的研究",
    "translated_abstract": "虽然现代生物技术允许合成新蛋白质并进行大规模的功能测量，但由于任何给定蛋白质的庞大序列空间，高效地探索和工程化仍然是一项艰巨的任务。蛋白工程通常通过将变异添加到野生型或领先序列，重新组合变异，并运行新一轮的筛选来进行。为了提高这个过程的效率，我们提出了一种基于树搜索的赌博机学习方法，该方法通过一个赌博机机器学习模型的指导从初始序列开始扩展树结构。在简化假设和高斯过程先验的情况下，我们提供了理论分析和贝叶斯遗憾界限，证明了局部搜索和赌博机学习方法的结合可以有效地发现接近最优的设计。该算法与一系列随机化的树搜索启发式方法，以及机器学习模型、+",
    "tldr": "本研究提出了一种基于树搜索的赌博机学习方法，用于高效探索和优化蛋白质序列。通过在初始序列上扩展树结构，并结合局部搜索和赌博机学习模型，可以有效地发现接近最优设计。",
    "en_tdlr": "This paper presents a tree search-based bandit learning method for efficient exploration and optimization of protein sequences. By expanding a tree starting from the initial sequence and combining local search with a bandit learning model, near-optimal designs can be efficiently discovered."
}