{
    "title": "Improving Kernel-Based Nonasymptotic Simultaneous Confidence Bands. (arXiv:2401.15791v1 [stat.ML])",
    "abstract": "The paper studies the problem of constructing nonparametric simultaneous confidence bands with nonasymptotic and distribition-free guarantees. The target function is assumed to be band-limited and the approach is based on the theory of Paley-Wiener reproducing kernel Hilbert spaces. The starting point of the paper is a recently developed algorithm to which we propose three types of improvements. First, we relax the assumptions on the noises by replacing the symmetricity assumption with a weaker distributional invariance principle. Then, we propose a more efficient way to estimate the norm of the target function, and finally we enhance the construction of the confidence bands by tightening the constraints of the underlying convex optimization problems. The refinements are also illustrated through numerical experiments.",
    "link": "http://arxiv.org/abs/2401.15791",
    "context": "Title: Improving Kernel-Based Nonasymptotic Simultaneous Confidence Bands. (arXiv:2401.15791v1 [stat.ML])\nAbstract: The paper studies the problem of constructing nonparametric simultaneous confidence bands with nonasymptotic and distribition-free guarantees. The target function is assumed to be band-limited and the approach is based on the theory of Paley-Wiener reproducing kernel Hilbert spaces. The starting point of the paper is a recently developed algorithm to which we propose three types of improvements. First, we relax the assumptions on the noises by replacing the symmetricity assumption with a weaker distributional invariance principle. Then, we propose a more efficient way to estimate the norm of the target function, and finally we enhance the construction of the confidence bands by tightening the constraints of the underlying convex optimization problems. The refinements are also illustrated through numerical experiments.",
    "path": "papers/24/01/2401.15791.json",
    "total_tokens": 750,
    "translated_title": "改进基于内核的非渐近同时置信带",
    "translated_abstract": "本文研究构建非参数的、具有非渐近和分布无关保证的同时置信带的问题。目标函数被假设为带限函数，方法基于Paley-Wiener再生核希尔伯特空间理论。论文起点是一个最近开发的算法，我们提出了三种改进方法。首先，通过用较弱的分布不变性原理取代对噪声的对称性假设来放宽对噪声的假设。其次，我们提出了一种更高效的估计目标函数范数的方法，最后通过加强隐含凸优化问题的约束来增强置信带的构建。通过数值实验也对这些改进进行了说明。",
    "tldr": "本文改进了基于内核的非渐近同时置信带的构建方法，通过放宽噪声假设、改进目标函数范数估计和加强隐含凸优化问题约束来提升了构建的效果。",
    "en_tdlr": "This paper improves the construction of kernel-based nonasymptotic simultaneous confidence bands by relaxing noise assumptions, improving target function norm estimation, and enhancing the constraints of underlying convex optimization problems."
}