{
    "title": "Assessing the impact of forced and voluntary behavioral changes on economic-epidemiological co-dynamics: A comparative case study between Belgium and Sweden during the 2020 COVID-19 pandemic. (arXiv:2401.08442v1 [econ.EM])",
    "abstract": "During the COVID-19 pandemic, governments faced the challenge of managing population behavior to prevent their healthcare systems from collapsing. Sweden adopted a strategy centered on voluntary sanitary recommendations while Belgium resorted to mandatory measures. Their consequences on pandemic progression and associated economic impacts remain insufficiently understood. This study leverages the divergent policies of Belgium and Sweden during the COVID-19 pandemic to relax the unrealistic -- but persistently used -- assumption that social contacts are not influenced by an epidemic's dynamics. We develop an epidemiological-economic co-simulation model where pandemic-induced behavioral changes are a superposition of voluntary actions driven by fear, prosocial behavior or social pressure, and compulsory compliance with government directives. Our findings emphasize the importance of early responses, which reduce the stringency of measures necessary to safeguard healthcare systems and mini",
    "link": "http://arxiv.org/abs/2401.08442",
    "context": "Title: Assessing the impact of forced and voluntary behavioral changes on economic-epidemiological co-dynamics: A comparative case study between Belgium and Sweden during the 2020 COVID-19 pandemic. (arXiv:2401.08442v1 [econ.EM])\nAbstract: During the COVID-19 pandemic, governments faced the challenge of managing population behavior to prevent their healthcare systems from collapsing. Sweden adopted a strategy centered on voluntary sanitary recommendations while Belgium resorted to mandatory measures. Their consequences on pandemic progression and associated economic impacts remain insufficiently understood. This study leverages the divergent policies of Belgium and Sweden during the COVID-19 pandemic to relax the unrealistic -- but persistently used -- assumption that social contacts are not influenced by an epidemic's dynamics. We develop an epidemiological-economic co-simulation model where pandemic-induced behavioral changes are a superposition of voluntary actions driven by fear, prosocial behavior or social pressure, and compulsory compliance with government directives. Our findings emphasize the importance of early responses, which reduce the stringency of measures necessary to safeguard healthcare systems and mini",
    "path": "papers/24/01/2401.08442.json",
    "total_tokens": 995,
    "translated_title": "评估强制和自愿行为变化对经济流行病共动力的影响：比较研究比利时和瑞典在2020年COVID-19大流行期间的情况",
    "translated_abstract": "在COVID-19大流行期间，政府面临管理人口行为以防止其医疗系统崩溃的挑战。瑞典采取了以自愿卫生建议为中心的策略，而比利时则采取了强制措施。对于这两种策略对大流行进展和相关经济影响的影响仍不够了解。本研究利用比利时和瑞典在COVID-19大流行期间的不同政策，放松了社交联系不受流行病动态影响的不切实际但经常使用的假设。我们开发了一种流行病经济共模拟模型，其中由恐惧、亲社会行为或社会压力驱动的自愿行为和对政府指令的强制遵守叠加产生了由大流行引起的行为变化。我们的研究结果强调了早期反应的重要性，这减少了必须采取的措施的严格性，以保护医疗系统并使其最小化。",
    "tldr": "本研究通过比利时和瑞典在COVID-19流行期间的不同政策，放松了流行病动态不影响社交联系的假设，发现早期反应对于减少必要措施的严格程度以保护医疗系统至关重要。",
    "en_tdlr": "This study leverages the divergent policies of Belgium and Sweden during the COVID-19 pandemic to relax the assumption that social contacts are not influenced by the epidemic's dynamics, and emphasizes the importance of early responses in reducing the stringency of measures necessary to protect healthcare systems."
}