{
    "title": "Validation, Robustness, and Accuracy of Perturbation-Based Sensitivity Analysis Methods for Time-Series Deep Learning Models. (arXiv:2401.16521v1 [cs.LG])",
    "abstract": "This work undertakes studies to evaluate Interpretability Methods for Time-Series Deep Learning. Sensitivity analysis assesses how input changes affect the output, constituting a key component of interpretation. Among the post-hoc interpretation methods such as back-propagation, perturbation, and approximation, my work will investigate perturbation-based sensitivity Analysis methods on modern Transformer models to benchmark their performances. Specifically, my work answers three research questions: 1) Do different sensitivity analysis (SA) methods yield comparable outputs and attribute importance rankings? 2) Using the same sensitivity analysis method, do different Deep Learning (DL) models impact the output of the sensitivity analysis? 3) How well do the results from sensitivity analysis methods align with the ground truth?",
    "link": "http://arxiv.org/abs/2401.16521",
    "context": "Title: Validation, Robustness, and Accuracy of Perturbation-Based Sensitivity Analysis Methods for Time-Series Deep Learning Models. (arXiv:2401.16521v1 [cs.LG])\nAbstract: This work undertakes studies to evaluate Interpretability Methods for Time-Series Deep Learning. Sensitivity analysis assesses how input changes affect the output, constituting a key component of interpretation. Among the post-hoc interpretation methods such as back-propagation, perturbation, and approximation, my work will investigate perturbation-based sensitivity Analysis methods on modern Transformer models to benchmark their performances. Specifically, my work answers three research questions: 1) Do different sensitivity analysis (SA) methods yield comparable outputs and attribute importance rankings? 2) Using the same sensitivity analysis method, do different Deep Learning (DL) models impact the output of the sensitivity analysis? 3) How well do the results from sensitivity analysis methods align with the ground truth?",
    "path": "papers/24/01/2401.16521.json",
    "total_tokens": 778,
    "translated_title": "时间序列深度学习模型的扰动敏感性分析方法的验证、健壮性和准确性",
    "translated_abstract": "本研究对时间序列深度学习的可解释性方法进行评估。敏感性分析评估输入变化对输出的影响，是解释的关键组成部分。在后期解释方法中，如反向传播、扰动和近似法中，本研究将调查现代Transformer模型上的基于扰动的敏感性分析方法，以评估其性能。具体而言，本研究回答了三个研究问题：1）不同的敏感性分析方法是否产生可比较的输出和属性重要性排序？2）使用相同的敏感性分析方法，不同的深度学习模型是否对敏感性分析的输出产生影响？3）敏感性分析方法的结果与基本事实的一致性如何？",
    "tldr": "本研究验证了时间序列深度学习模型的扰动敏感性分析方法的可靠性和准确性，并比较了不同方法和模型的影响。",
    "en_tdlr": "This study validates the reliability and accuracy of perturbation-based sensitivity analysis methods for time-series deep learning models, and compares the impacts of different methods and models."
}