{
    "title": "Exploring Boundary of GPT-4V on Marine Analysis: A Preliminary Case Study. (arXiv:2401.02147v1 [cs.CL])",
    "abstract": "Large language models (LLMs) have demonstrated a powerful ability to answer various queries as a general-purpose assistant. The continuous multi-modal large language models (MLLM) empower LLMs with the ability to perceive visual signals. The launch of GPT-4 (Generative Pre-trained Transformers) has generated significant interest in the research communities. GPT-4V(ison) has demonstrated significant power in both academia and industry fields, as a focal point in a new artificial intelligence generation. Though significant success was achieved by GPT-4V, exploring MLLMs in domain-specific analysis (e.g., marine analysis) that required domain-specific knowledge and expertise has gained less attention. In this study, we carry out the preliminary and comprehensive case study of utilizing GPT-4V for marine analysis. This report conducts a systematic evaluation of existing GPT-4V, assessing the performance of GPT-4V on marine research and also setting a new standard for future developments in",
    "link": "http://arxiv.org/abs/2401.02147",
    "context": "Title: Exploring Boundary of GPT-4V on Marine Analysis: A Preliminary Case Study. (arXiv:2401.02147v1 [cs.CL])\nAbstract: Large language models (LLMs) have demonstrated a powerful ability to answer various queries as a general-purpose assistant. The continuous multi-modal large language models (MLLM) empower LLMs with the ability to perceive visual signals. The launch of GPT-4 (Generative Pre-trained Transformers) has generated significant interest in the research communities. GPT-4V(ison) has demonstrated significant power in both academia and industry fields, as a focal point in a new artificial intelligence generation. Though significant success was achieved by GPT-4V, exploring MLLMs in domain-specific analysis (e.g., marine analysis) that required domain-specific knowledge and expertise has gained less attention. In this study, we carry out the preliminary and comprehensive case study of utilizing GPT-4V for marine analysis. This report conducts a systematic evaluation of existing GPT-4V, assessing the performance of GPT-4V on marine research and also setting a new standard for future developments in",
    "path": "papers/24/01/2401.02147.json",
    "total_tokens": 929,
    "translated_title": "探索GPT-4V在海洋分析领域的边界：一个初步的案例研究",
    "translated_abstract": "大型语言模型（LLMs）已经展示出作为通用助手回答各种查询的强大能力。连续多模式大型语言模型（MLLM）赋予LLMs感知视觉信号的能力。GPT-4（生成预训练的Transformer）的发布引起了研究界的极大兴趣。作为新一代人工智能的焦点之一，GPT-4V（ison）在学术界和工业领域展示了显著的实力。尽管GPT-4V取得了显著的成功，但探索在需要领域专门知识和专业技能的特定领域分析（如海洋分析）中的MLLMs却受到了较少关注。在本研究中，我们进行了关于利用GPT-4V进行海洋分析的初步和综合案例研究。本报告对现有的GPT-4V进行了系统评估，评估了GPT-4V在海洋研究中的性能，并为未来的发展设定了新的标准。",
    "tldr": "本研究从海洋分析的角度对GPT-4V进行了初步和全面的案例研究，评估了其在海洋研究中的性能，并为未来的发展设定了新的标准。"
}