{
    "title": "The Role of Deep Learning in Advancing Proactive Cybersecurity Measures for Smart Grid Networks: A Survey. (arXiv:2401.05896v1 [cs.CR])",
    "abstract": "As smart grids (SG) increasingly rely on advanced technologies like sensors and communication systems for efficient energy generation, distribution, and consumption, they become enticing targets for sophisticated cyberattacks. These evolving threats demand robust security measures to maintain the stability and resilience of modern energy systems. While extensive research has been conducted, a comprehensive exploration of proactive cyber defense strategies utilizing Deep Learning (DL) in {SG} remains scarce in the literature. This survey bridges this gap, studying the latest DL techniques for proactive cyber defense. The survey begins with an overview of related works and our distinct contributions, followed by an examination of SG infrastructure. Next, we classify various cyber defense techniques into reactive and proactive categories. A significant focus is placed on DL-enabled proactive defenses, where we provide a comprehensive taxonomy of DL approaches, highlighting their roles and",
    "link": "http://arxiv.org/abs/2401.05896",
    "context": "Title: The Role of Deep Learning in Advancing Proactive Cybersecurity Measures for Smart Grid Networks: A Survey. (arXiv:2401.05896v1 [cs.CR])\nAbstract: As smart grids (SG) increasingly rely on advanced technologies like sensors and communication systems for efficient energy generation, distribution, and consumption, they become enticing targets for sophisticated cyberattacks. These evolving threats demand robust security measures to maintain the stability and resilience of modern energy systems. While extensive research has been conducted, a comprehensive exploration of proactive cyber defense strategies utilizing Deep Learning (DL) in {SG} remains scarce in the literature. This survey bridges this gap, studying the latest DL techniques for proactive cyber defense. The survey begins with an overview of related works and our distinct contributions, followed by an examination of SG infrastructure. Next, we classify various cyber defense techniques into reactive and proactive categories. A significant focus is placed on DL-enabled proactive defenses, where we provide a comprehensive taxonomy of DL approaches, highlighting their roles and",
    "path": "papers/24/01/2401.05896.json",
    "total_tokens": 900,
    "translated_title": "深度学习在智能电网网络中推进主动式网络安全措施的作用：一项调查",
    "translated_abstract": "随着智能电网（SG）越来越依赖传感器和通信系统等先进技术来实现高效的能源发电、分配和消耗，它们成为了复杂网络攻击的有吸引力的目标。这些不断进化的威胁需要强大的安全措施来维持现代能源系统的稳定性和韧性。虽然进行了广泛的研究，但关于利用深度学习（DL）在SG中实施主动网络防御策略的综合性探索在文献中仍然很少见。本调查填补了这一空白，研究了用于主动网络防御的最新DL技术。调查首先概述了相关工作和我们独特的贡献，然后对SG基础设施进行了检查。接下来，我们将各种网络防御技术分为反应性和主动性两个类别。我们重点关注DL-enabled的主动防御，提供了DL方法的全面分类，突出了它们的角色和",
    "tldr": "深度学习在智能电网网络中起到推进主动网络安全措施的作用，本论文通过综合调查了最新的深度学习技术在主动网络防御中的应用。",
    "en_tdlr": "Deep Learning plays a crucial role in advancing proactive cybersecurity measures in smart grid networks. This survey explores the latest DL techniques in proactive cyber defense and provides a comprehensive classification and understanding of their applications."
}