{
    "title": "Communication-Efficient Federated Learning for LEO Satellite Networks Integrated with HAPs Using Hybrid NOMA-OFDM",
    "abstract": "arXiv:2401.00685v2 Announce Type: replace-cross  Abstract: Space AI has become increasingly important and sometimes even necessary for government, businesses, and society. An active research topic under this mission is integrating federated learning (FL) with satellite communications (SatCom) so that numerous low Earth orbit (LEO) satellites can collaboratively train a machine learning model. However, the special communication environment of SatCom leads to a very slow FL training process up to days and weeks. This paper proposes NomaFedHAP, a novel FL-SatCom approach tailored to LEO satellites, that (1) utilizes high-altitude platforms (HAPs) as distributed parameter servers (PS) to enhance satellite visibility, and (2) introduces non-orthogonal multiple access (NOMA) into LEO to enable fast and bandwidth-efficient model transmissions. In addition, NomaFedHAP includes (3) a new communication topology that exploits HAPs to bridge satellites among different orbits to mitigate the Dopple",
    "link": "https://arxiv.org/abs/2401.00685",
    "context": "Title: Communication-Efficient Federated Learning for LEO Satellite Networks Integrated with HAPs Using Hybrid NOMA-OFDM\nAbstract: arXiv:2401.00685v2 Announce Type: replace-cross  Abstract: Space AI has become increasingly important and sometimes even necessary for government, businesses, and society. An active research topic under this mission is integrating federated learning (FL) with satellite communications (SatCom) so that numerous low Earth orbit (LEO) satellites can collaboratively train a machine learning model. However, the special communication environment of SatCom leads to a very slow FL training process up to days and weeks. This paper proposes NomaFedHAP, a novel FL-SatCom approach tailored to LEO satellites, that (1) utilizes high-altitude platforms (HAPs) as distributed parameter servers (PS) to enhance satellite visibility, and (2) introduces non-orthogonal multiple access (NOMA) into LEO to enable fast and bandwidth-efficient model transmissions. In addition, NomaFedHAP includes (3) a new communication topology that exploits HAPs to bridge satellites among different orbits to mitigate the Dopple",
    "path": "papers/24/01/2401.00685.json",
    "total_tokens": 744,
    "translated_title": "集成混合NOMA-OFDM的HAP与LEO卫星网络的通信高效联合学习",
    "translated_abstract": "太空人工智能对政府、企业和社会变得日益重要，有时甚至成为必需。本文提出了一种针对LEO卫星量身定制的新型FL-SatCom方法NomaFedHAP，该方法利用高空平台(HAPs)作为分布式参数服务器(PS)来增强卫星的可见性，引入非正交多址接入(NOMA)到LEO，以实现快速和带宽高效的模型传输。",
    "tldr": "本文提出了NomaFedHAP这一新型FL-SatCom方法，利用HAPs作为PS来增强卫星可见性，并引入NOMA技术实现快速高效的模型传输。",
    "en_tdlr": "This paper proposes a novel FL-SatCom approach NomaFedHAP tailored to LEO satellites, utilizing HAPs as PS to enhance satellite visibility and introducing NOMA for fast and bandwidth-efficient model transmissions."
}