{
    "title": "Predicting the Future with Simple World Models",
    "abstract": "World models can represent potentially high-dimensional pixel observations in compact latent spaces, making it tractable to model the dynamics of the environment. However, the latent dynamics inferred by these models may still be highly complex. Abstracting the dynamics of the environment with simple models can have several benefits. If the latent dynamics are simple, the model may generalize better to novel transitions, and discover useful latent representations of environment states. We propose a regularization scheme that simplifies the world model's latent dynamics. Our model, the Parsimonious Latent Space Model (PLSM), minimizes the mutual information between latent states and the dynamics that arise between them. This makes the dynamics softly state-invariant, and the effects of the agent's actions more predictable. We combine the PLSM with three different model classes used for i) future latent state prediction, ii) video prediction, and iii) planning. We find that our regulariz",
    "link": "https://arxiv.org/abs/2401.17835",
    "context": "Title: Predicting the Future with Simple World Models\nAbstract: World models can represent potentially high-dimensional pixel observations in compact latent spaces, making it tractable to model the dynamics of the environment. However, the latent dynamics inferred by these models may still be highly complex. Abstracting the dynamics of the environment with simple models can have several benefits. If the latent dynamics are simple, the model may generalize better to novel transitions, and discover useful latent representations of environment states. We propose a regularization scheme that simplifies the world model's latent dynamics. Our model, the Parsimonious Latent Space Model (PLSM), minimizes the mutual information between latent states and the dynamics that arise between them. This makes the dynamics softly state-invariant, and the effects of the agent's actions more predictable. We combine the PLSM with three different model classes used for i) future latent state prediction, ii) video prediction, and iii) planning. We find that our regulariz",
    "path": "papers/24/01/2401.17835.json",
    "total_tokens": 876,
    "translated_title": "用简单的世界模型预测未来",
    "translated_abstract": "世界模型可以用紧凑的潜在空间表示潜在高维度像素观察，从而使得对环境动态建模成为可能。然而，这些模型推导出的潜在动态可能仍然非常复杂。通过简化模型来抽象环境的动态可以带来几个好处。如果潜在动态简单，模型可能更好地推广到新的转换，并发现有用的环境状态的潜在表示。我们提出了一种简化世界模型潜在动态的正则化方案。我们的模型，简约潜在空间模型（PLSM），最小化了潜在状态与其之间产生的动态之间的互信息。这使得动态在状态上具有软性不变性，并使得智能体行为的影响更加可预测。我们将PLSM与用于i)未来潜在状态预测、ii)视频预测和iii)规划的三种不同模型类结合。研究结果表明，我们的正则化模型可以提供更好的预测效果。",
    "tldr": "本研究提出了一种正则化方案，通过简化模型的潜在动态，使得世界模型更加可预测。该模型在未来潜在状态预测、视频预测和规划中展现出良好的性能。",
    "en_tdlr": "This study proposes a regularization scheme that simplifies the latent dynamics of world models, leading to improved predictability. The model demonstrates good performance in future latent state prediction, video prediction, and planning."
}