{
    "title": "Herding LLaMaS: Using LLMs as an OS Module. (arXiv:2401.08908v1 [cs.OS])",
    "abstract": "Computer systems are becoming increasingly heterogeneous with the emergence of new memory technologies and compute devices. GPUs alongside CPUs have become commonplace and CXL is poised to be a mainstay of cloud systems. The operating system is responsible for managing these hardware resources, requiring modification every time a new device is released. Years of research and development are sunk into tuning the OS for high performance with each new heterogeneous device. With the recent explosion in memory technologies and domain-specific accelerators, it would be beneficial to have an OS that could provide high performance for new devices without significant effort.  We propose LLaMaS which can adapt to new devices easily. LLaMaS uses Large Language Models (LLMs) to extract the useful features of new devices from their textual description and uses these features to make operating system decisions at runtime. Adding support to LLaMaS for a new device is as simple as describing the syste",
    "link": "http://arxiv.org/abs/2401.08908",
    "context": "Title: Herding LLaMaS: Using LLMs as an OS Module. (arXiv:2401.08908v1 [cs.OS])\nAbstract: Computer systems are becoming increasingly heterogeneous with the emergence of new memory technologies and compute devices. GPUs alongside CPUs have become commonplace and CXL is poised to be a mainstay of cloud systems. The operating system is responsible for managing these hardware resources, requiring modification every time a new device is released. Years of research and development are sunk into tuning the OS for high performance with each new heterogeneous device. With the recent explosion in memory technologies and domain-specific accelerators, it would be beneficial to have an OS that could provide high performance for new devices without significant effort.  We propose LLaMaS which can adapt to new devices easily. LLaMaS uses Large Language Models (LLMs) to extract the useful features of new devices from their textual description and uses these features to make operating system decisions at runtime. Adding support to LLaMaS for a new device is as simple as describing the syste",
    "path": "papers/24/01/2401.08908.json",
    "total_tokens": 854,
    "translated_title": "驯服LLaMaS：将LLMs用作操作系统模块",
    "translated_abstract": "随着新的存储技术和计算设备的出现，计算机系统变得越来越异构化。 GPU和CPU并用已经变得普遍，而CXL有望成为云系统的主要支柱。操作系统负责管理这些硬件资源，每次发布新设备时都需要进行修改。多年的研究和开发投入到调整操作系统以实现高性能与每个新的异构设备。随着近年来内存技术和领域特定加速器的爆发，有一个可以轻松为新设备提供高性能的操作系统将是有益的。我们提出了LLaMaS，它可以轻松适应新设备。LLaMaS使用大型语言模型（LLMs）从新设备的文本描述中提取有用的特征，并利用这些特征在运行时做出操作系统决策。为LLaMaS提供对新设备的支持就像描述系统一样简单。",
    "tldr": "LLaMaS使用大型语言模型（LLMs）从新设备的文本描述中提取有用的特征，并利用这些特征在运行时做出操作系统决策，为新设备提供高性能的操作系统。"
}