{
    "title": "Blackout Mitigation via Physics-guided RL. (arXiv:2401.09640v1 [eess.SY])",
    "abstract": "This paper considers the sequential design of remedial control actions in response to system anomalies for the ultimate objective of preventing blackouts. A physics-guided reinforcement learning (RL) framework is designed to identify effective sequences of real-time remedial look-ahead decisions accounting for the long-term impact on the system's stability. The paper considers a space of control actions that involve both discrete-valued transmission line-switching decisions (line reconnections and removals) and continuous-valued generator adjustments. To identify an effective blackout mitigation policy, a physics-guided approach is designed that uses power-flow sensitivity factors associated with the power transmission network to guide the RL exploration during agent training. Comprehensive empirical evaluations using the open-source Grid2Op platform demonstrate the notable advantages of incorporating physical signals into RL decisions, establishing the gains of the proposed physics-gu",
    "link": "http://arxiv.org/abs/2401.09640",
    "context": "Title: Blackout Mitigation via Physics-guided RL. (arXiv:2401.09640v1 [eess.SY])\nAbstract: This paper considers the sequential design of remedial control actions in response to system anomalies for the ultimate objective of preventing blackouts. A physics-guided reinforcement learning (RL) framework is designed to identify effective sequences of real-time remedial look-ahead decisions accounting for the long-term impact on the system's stability. The paper considers a space of control actions that involve both discrete-valued transmission line-switching decisions (line reconnections and removals) and continuous-valued generator adjustments. To identify an effective blackout mitigation policy, a physics-guided approach is designed that uses power-flow sensitivity factors associated with the power transmission network to guide the RL exploration during agent training. Comprehensive empirical evaluations using the open-source Grid2Op platform demonstrate the notable advantages of incorporating physical signals into RL decisions, establishing the gains of the proposed physics-gu",
    "path": "papers/24/01/2401.09640.json",
    "total_tokens": 852,
    "translated_title": "通过物理引导的强化学习进行停电减轻",
    "translated_abstract": "本文考虑了为了防止黑暗模式而在系统异常时进行序列设计的补救控制行动。设计了一种物理引导的强化学习框架，用于识别在考虑系统稳定性长期影响的情况下的实时补救前瞻决策序列。本文考虑了涉及离散值传输线开关决策（线路重新连接和移除）和连续值发电机调整的控制行动空间。为了确定有效的停电减轻策略，设计了一种物理引导方法，利用与电力传输网络相关的潮流灵敏度因子来引导强化学习训练期间的探索。使用开源Grid2Op平台进行了全面的实证评估，证明了将物理信号纳入强化学习决策的显著优势，证实了所提出的物理引导方法的收益。",
    "tldr": "本文设计了一种物理引导的强化学习框架，利用传输网络的潮流灵敏度因子来指导强化学习训练，实现了通过实时补救前瞻决策来减轻黑暗模式的目标。",
    "en_tdlr": "This paper proposes a physics-guided RL framework that incorporates power-flow sensitivity factors to guide reinforcement learning for the design of real-time remedial decisions, aiming to mitigate blackouts and enhance system stability."
}