{
    "title": "Projected Belief Networks With Discriminative Alignment for Acoustic Event Classification: Rivaling State of the Art CNNs. (arXiv:2401.11199v1 [cs.LG])",
    "abstract": "The projected belief network (PBN) is a generative stochastic network with tractable likelihood function based on a feed-forward neural network (FFNN). The generative function operates by \"backing up\" through the FFNN. The PBN is two networks in one, a FFNN that operates in the forward direction, and a generative network that operates in the backward direction. Both networks co-exist based on the same parameter set, have their own cost functions, and can be separately or jointly trained. The PBN therefore has the potential to possess the best qualities of both discriminative and generative classifiers. To realize this potential, a separate PBN is trained on each class, maximizing the generative likelihood function for the given class, while minimizing the discriminative cost for the FFNN against \"all other classes\". This technique, called discriminative alignment (PBN-DA), aligns the contours of the likelihood function to the decision boundaries and attains vastly improved classificati",
    "link": "http://arxiv.org/abs/2401.11199",
    "context": "Title: Projected Belief Networks With Discriminative Alignment for Acoustic Event Classification: Rivaling State of the Art CNNs. (arXiv:2401.11199v1 [cs.LG])\nAbstract: The projected belief network (PBN) is a generative stochastic network with tractable likelihood function based on a feed-forward neural network (FFNN). The generative function operates by \"backing up\" through the FFNN. The PBN is two networks in one, a FFNN that operates in the forward direction, and a generative network that operates in the backward direction. Both networks co-exist based on the same parameter set, have their own cost functions, and can be separately or jointly trained. The PBN therefore has the potential to possess the best qualities of both discriminative and generative classifiers. To realize this potential, a separate PBN is trained on each class, maximizing the generative likelihood function for the given class, while minimizing the discriminative cost for the FFNN against \"all other classes\". This technique, called discriminative alignment (PBN-DA), aligns the contours of the likelihood function to the decision boundaries and attains vastly improved classificati",
    "path": "papers/24/01/2401.11199.json",
    "total_tokens": 867,
    "translated_title": "基于鉴别对齐的投影信念网络在声学事件分类方面达到了与最先进CNN相媲美的效果",
    "translated_abstract": "投影信念网络（PBN）是一种具有可计算似然函数的生成性随机网络，它基于前向神经网络（FFNN）。生成函数通过在FFNN中进行“备份”操作来运作。 PBN是两个网络，一个在正向方向上运作的FFNN和一个在反向方向上运作的生成网络。两个网络共同存在于相同的参数集上，具有自己的成本函数，可以分别或联合训练。因此，PBN有可能拥有鉴别性和生成性分类器的最佳特点。为了实现这个潜力，对每个类别分别训练一个独立的PBN，对给定类别最大化生成似然函数，同时最小化FFNN相对于“所有其他类别”的鉴别成本。这个技术被称为鉴别对齐（PBN-DA），它将似然函数的轮廓与决策边界对齐，并实现了大大改善的分类效果。",
    "tldr": "基于鉴别对齐的投影信念网络在声学事件分类中达到了与最先进CNN相媲美的效果。"
}