{
    "title": "New approximate stochastic dominance approaches for Enhanced Indexation models. (arXiv:2401.12669v1 [q-fin.PM])",
    "abstract": "In this paper, we discuss portfolio selection strategies for Enhanced Indexation (EI), which are based on stochastic dominance relations. The goal is to select portfolios that stochastically dominate a given benchmark but that, at the same time, must generate some excess return with respect to a benchmark index. To achieve this goal, we propose a new methodology that selects portfolios using the ordered weighted average (OWA) operator, which generalizes previous approaches based on minimax selection rules and still leads to solving linear programming models. We also introduce a new type of approximate stochastic dominance rule and show that it implies the almost Second-order Stochastic Dominance (SSD) criterion proposed by Lizyayev and Ruszczynski (2012). We prove that our EI model based on OWA selects portfolios that dominate a given benchmark through this new form of stochastic dominance criterion. We test the performance of the obtained portfolios in an extensive empirical analysis ",
    "link": "http://arxiv.org/abs/2401.12669",
    "context": "Title: New approximate stochastic dominance approaches for Enhanced Indexation models. (arXiv:2401.12669v1 [q-fin.PM])\nAbstract: In this paper, we discuss portfolio selection strategies for Enhanced Indexation (EI), which are based on stochastic dominance relations. The goal is to select portfolios that stochastically dominate a given benchmark but that, at the same time, must generate some excess return with respect to a benchmark index. To achieve this goal, we propose a new methodology that selects portfolios using the ordered weighted average (OWA) operator, which generalizes previous approaches based on minimax selection rules and still leads to solving linear programming models. We also introduce a new type of approximate stochastic dominance rule and show that it implies the almost Second-order Stochastic Dominance (SSD) criterion proposed by Lizyayev and Ruszczynski (2012). We prove that our EI model based on OWA selects portfolios that dominate a given benchmark through this new form of stochastic dominance criterion. We test the performance of the obtained portfolios in an extensive empirical analysis ",
    "path": "papers/24/01/2401.12669.json",
    "total_tokens": 901,
    "translated_title": "新近似随机优势方法用于增强指数模型",
    "translated_abstract": "本文讨论了基于随机优势关系的增强指数（EI）的投资组合选择策略。目标是选择能够随机优于给定基准并且同时在基准指数上产生一定过额回报的投资组合。为了实现这个目标，我们提出了一种使用有序加权平均（OWA）算子的新方法，该方法推广了基于极小最大选择规则的先前方法，并且仍然导致线性规划模型的求解。我们还引入了一种新型的近似随机优势规则，并且证明了它推导出了Lizyayev和Ruszczynski（2012）提出的几乎二阶随机优势(SSD)准则。我们证明了基于OWA的EI模型通过这种新形式的随机优势准则选择了能够优于给定基准的投资组合。我们通过广泛的实证分析测试了所获得投资组合的性能。",
    "tldr": "本文提出了一种新的近似随机优势方法，基于有序加权平均算子选择增强指数模型的投资组合，该方法能在优于基准的同时产生过额回报。",
    "en_tdlr": "This paper proposes a new approximate stochastic dominance approach for Enhanced Indexation (EI) models, which selects portfolios using the ordered weighted average (OWA) operator. It aims to achieve both stochastic dominance over a given benchmark and generate excess returns. The approach is based on a new type of approximate stochastic dominance rule, and the portfolios selected are shown to dominate the benchmark while generating excess returns."
}