{
    "title": "Analysis of the Impact of Central bank Digital Currency on the Demand for Transactional Currency. (arXiv:2401.06457v1 [econ.GN])",
    "abstract": "This paper takes the development of Central bank digital currencies as a perspective, introduces it into the Baumol-Tobin money demand theoretical framework, establishes the transactional money demand model under Central bank Digital Currency, and qualitatively analyzes the influence mechanism of Central bank digital currencies on transactional money demand; meanwhile, quarterly data from 2010-2022 are selected to test the relationship between Central bank digital currencies and transactional money demand through the ARDL model. The long-run equilibrium and short-run dynamics between the demand for Central bank digital currencies and transactional currency are examined by ARDL model. The empirical results show that the issuance and circulation of Central bank digital currencies will reduce the demand for transactional money. Based on the theoretical analysis and empirical test, this paper proposes that China should explore a more effective Currency policy in the context of Central bank",
    "link": "http://arxiv.org/abs/2401.06457",
    "context": "Title: Analysis of the Impact of Central bank Digital Currency on the Demand for Transactional Currency. (arXiv:2401.06457v1 [econ.GN])\nAbstract: This paper takes the development of Central bank digital currencies as a perspective, introduces it into the Baumol-Tobin money demand theoretical framework, establishes the transactional money demand model under Central bank Digital Currency, and qualitatively analyzes the influence mechanism of Central bank digital currencies on transactional money demand; meanwhile, quarterly data from 2010-2022 are selected to test the relationship between Central bank digital currencies and transactional money demand through the ARDL model. The long-run equilibrium and short-run dynamics between the demand for Central bank digital currencies and transactional currency are examined by ARDL model. The empirical results show that the issuance and circulation of Central bank digital currencies will reduce the demand for transactional money. Based on the theoretical analysis and empirical test, this paper proposes that China should explore a more effective Currency policy in the context of Central bank",
    "path": "papers/24/01/2401.06457.json",
    "total_tokens": 914,
    "translated_title": "中央银行数字货币对交易货币需求的影响分析",
    "translated_abstract": "本文以中央银行数字货币的发展为视角，将其纳入鲍姆—托宾货币需求理论框架，建立了中央银行数字货币下的交易货币需求模型，并定性分析了中央银行数字货币对交易货币需求的影响机制；同时，选择2010年至2022年的季度数据，通过ARDL模型测试了中央银行数字货币与交易货币需求之间的关系。通过ARDL模型，检验了中央银行数字货币需求与交易货币之间的长期均衡和短期动态。实证结果表明，中央银行数字货币的发行和流通将会减少对交易货币的需求。在理论分析和实证检验的基础上，本文提出在中央银行数字货币背景下，中国应探索更有效的货币政策。",
    "tldr": "本文以中央银行数字货币的发展为视角，建立了中央银行数字货币下的交易货币需求模型，实证结果表明，中央银行数字货币的发行和流通将会减少对交易货币的需求。在中央银行数字货币背景下，中国应探索更有效的货币政策。"
}