{
    "title": "Exploration of Activation Fault Reliability in Quantized Systolic Array-Based DNN Accelerators. (arXiv:2401.09509v1 [cs.AR])",
    "abstract": "The stringent requirements for the Deep Neural Networks (DNNs) accelerator's reliability stand along with the need for reducing the computational burden on the hardware platforms, i.e. reducing the energy consumption and execution time as well as increasing the efficiency of DNN accelerators. Moreover, the growing demand for specialized DNN accelerators with tailored requirements, particularly for safety-critical applications, necessitates a comprehensive design space exploration to enable the development of efficient and robust accelerators that meet those requirements. Therefore, the trade-off between hardware performance, i.e. area and delay, and the reliability of the DNN accelerator implementation becomes critical and requires tools for analysis. This paper presents a comprehensive methodology for exploring and enabling a holistic assessment of the trilateral impact of quantization on model accuracy, activation fault reliability, and hardware efficiency. A fully automated framewor",
    "link": "http://arxiv.org/abs/2401.09509",
    "context": "Title: Exploration of Activation Fault Reliability in Quantized Systolic Array-Based DNN Accelerators. (arXiv:2401.09509v1 [cs.AR])\nAbstract: The stringent requirements for the Deep Neural Networks (DNNs) accelerator's reliability stand along with the need for reducing the computational burden on the hardware platforms, i.e. reducing the energy consumption and execution time as well as increasing the efficiency of DNN accelerators. Moreover, the growing demand for specialized DNN accelerators with tailored requirements, particularly for safety-critical applications, necessitates a comprehensive design space exploration to enable the development of efficient and robust accelerators that meet those requirements. Therefore, the trade-off between hardware performance, i.e. area and delay, and the reliability of the DNN accelerator implementation becomes critical and requires tools for analysis. This paper presents a comprehensive methodology for exploring and enabling a holistic assessment of the trilateral impact of quantization on model accuracy, activation fault reliability, and hardware efficiency. A fully automated framewor",
    "path": "papers/24/01/2401.09509.json",
    "total_tokens": 876,
    "translated_title": "基于量化的系统阵列DNN加速器中激活错误可靠性的探索",
    "translated_abstract": "在减少硬件平台的计算负担，即降低能耗和执行时间以及提高DNN加速器的效率的需求下，对于深度神经网络（DNN）加速器的可靠性要求变得越来越严格。此外，对于定制需求的专用DNN加速器的需求不断增长，特别是对于安全关键应用程序，需要进行全面的设计空间探索，以实现开发满足这些要求的高效和稳健的加速器。因此，硬件性能（面积和延迟）与DNN加速器实现的可靠性之间的权衡变得至关重要，并需要进行分析工具。本文提出了一种综合的方法论，用于探索和实现对模型精度、激活错误可靠性和硬件效率的三方面影响的全面评估。一种全自动化的框架被介绍用于进行这种方法论的实现。",
    "tldr": "本文提出了一种综合方法论，用于探索基于量化的系统阵列DNN加速器中激活错误的可靠性，从而全面评估模型精度、可靠性和硬件效率之间的相互影响。"
}