{
    "title": "Counterfactuals in factor models. (arXiv:2401.03293v1 [econ.EM])",
    "abstract": "We study a new model where the potential outcomes, corresponding to the values of a (possibly continuous) treatment, are linked through common factors. The factors can be estimated using a panel of regressors. We propose a procedure to estimate time-specific and unit-specific average marginal effects in this context. Our approach can be used either with high-dimensional time series or with large panels. It allows for treatment effects heterogenous across time and units and is straightforward to implement since it only relies on principal components analysis and elementary computations. We derive the asymptotic distribution of our estimator of the average marginal effect and highlight its solid finite sample performance through a simulation exercise. The approach can also be used to estimate average counterfactuals or adapted to an instrumental variables setting and we discuss these extensions. Finally, we illustrate our novel methodology through an empirical application on income inequ",
    "link": "http://arxiv.org/abs/2401.03293",
    "context": "Title: Counterfactuals in factor models. (arXiv:2401.03293v1 [econ.EM])\nAbstract: We study a new model where the potential outcomes, corresponding to the values of a (possibly continuous) treatment, are linked through common factors. The factors can be estimated using a panel of regressors. We propose a procedure to estimate time-specific and unit-specific average marginal effects in this context. Our approach can be used either with high-dimensional time series or with large panels. It allows for treatment effects heterogenous across time and units and is straightforward to implement since it only relies on principal components analysis and elementary computations. We derive the asymptotic distribution of our estimator of the average marginal effect and highlight its solid finite sample performance through a simulation exercise. The approach can also be used to estimate average counterfactuals or adapted to an instrumental variables setting and we discuss these extensions. Finally, we illustrate our novel methodology through an empirical application on income inequ",
    "path": "papers/24/01/2401.03293.json",
    "total_tokens": 904,
    "translated_title": "因子模型中的反事实模拟研究",
    "translated_abstract": "我们研究了一个新的模型，其中潜在结果与（可能连续的）处理值通过公共因子相关。可以使用回归面板来估计这些因子。我们提出了一种在这种情况下估计特定时间和特定单位平均边际效应的方法。我们的方法既可以在高维时间序列中使用，也可以在大型面板中使用。它允许处理效应在时间和单位之间异质，并且易于实现，因为它仅依赖于主成分分析和基本计算。我们推导了平均边际效应估计量的渐近分布，并通过模拟实证演示其良好的有限样本性能。这种方法也可以用于估计平均反事实模拟，或者适应仪器变量设置，我们对这些扩展进行了讨论。最后，我们通过一个关于收入不平等性的实证应用来说明我们的创新方法。",
    "tldr": "研究了因子模型中的反事实模拟，提出了一种用于估计特定时间和特定单位平均边际效应的方法。该方法适用于高维时间序列和大型面板，可以处理效应异质，并且易于实现。通过模拟实证演示了其良好性能，并探讨了其他应用和扩展。"
}