{
    "title": "A General-purpose AI Avatar in Healthcare. (arXiv:2401.12981v1 [cs.CL])",
    "abstract": "Recent advancements in machine learning and natural language processing have led to the rapid development of artificial intelligence (AI) as a valuable tool in the healthcare industry. Using large language models (LLMs) as conversational agents or chatbots has the potential to assist doctors in diagnosing patients, detecting early symptoms of diseases, and providing health advice to patients. This paper focuses on the role of chatbots in healthcare and explores the use of avatars to make AI interactions more appealing to patients. A framework of a general-purpose AI avatar application is demonstrated by using a three-category prompt dictionary and prompt improvement mechanism. A two-phase approach is suggested to fine-tune a general-purpose AI language model and create different AI avatars to discuss medical issues with users. Prompt engineering enhances the chatbot's conversational abilities and personality traits, fostering a more human-like interaction with patients. Ultimately, the",
    "link": "http://arxiv.org/abs/2401.12981",
    "context": "Title: A General-purpose AI Avatar in Healthcare. (arXiv:2401.12981v1 [cs.CL])\nAbstract: Recent advancements in machine learning and natural language processing have led to the rapid development of artificial intelligence (AI) as a valuable tool in the healthcare industry. Using large language models (LLMs) as conversational agents or chatbots has the potential to assist doctors in diagnosing patients, detecting early symptoms of diseases, and providing health advice to patients. This paper focuses on the role of chatbots in healthcare and explores the use of avatars to make AI interactions more appealing to patients. A framework of a general-purpose AI avatar application is demonstrated by using a three-category prompt dictionary and prompt improvement mechanism. A two-phase approach is suggested to fine-tune a general-purpose AI language model and create different AI avatars to discuss medical issues with users. Prompt engineering enhances the chatbot's conversational abilities and personality traits, fostering a more human-like interaction with patients. Ultimately, the",
    "path": "papers/24/01/2401.12981.json",
    "total_tokens": 1019,
    "translated_title": "一个通用的医疗人工智能化身",
    "translated_abstract": "最近机器学习和自然语言处理的进展推动了人工智能作为医疗行业中宝贵工具的快速发展。使用大型语言模型(LLM)作为对话代理或聊天机器人有潜力帮助医生诊断患者、检测疾病的早期症状以及向患者提供健康建议。本文关注聊天机器人在医疗领域的作用，探索使用化身来使人工智能的交互对患者更具吸引力。通过使用三类别提示词典和提示改进机制，演示了一个通用的医疗人工智能化身应用框架。建议采用两阶段方法对通用的医疗人工智能语言模型进行微调，并创建不同的医疗人工智能化身与用户讨论医学问题。提示工程增强了聊天机器人的对话能力和人格特点，培养了与患者更具人类交流方式的互动。归根结底，该论文提出了在医疗领域中实现更好人工智能与患者之间交流的方法。",
    "tldr": "这项研究探讨了在医疗领域中使用通用AI化身进行交互的潜力和方法。通过使用词典和改进机制，创建了一个通用的医疗AI化身应用框架，提供更具吸引力的人机交互，增强了聊天机器人的对话能力和个性特点，实现更好人工智能与患者之间交流的方式。"
}