{
    "title": "Machine learning for industrial sensing and control: A survey and practical perspective. (arXiv:2401.13836v1 [eess.SY])",
    "abstract": "With the rise of deep learning, there has been renewed interest within the process industries to utilize data on large-scale nonlinear sensing and control problems. We identify key statistical and machine learning techniques that have seen practical success in the process industries. To do so, we start with hybrid modeling to provide a methodological framework underlying core application areas: soft sensing, process optimization, and control. Soft sensing contains a wealth of industrial applications of statistical and machine learning methods. We quantitatively identify research trends, allowing insight into the most successful techniques in practice.  We consider two distinct flavors for data-driven optimization and control: hybrid modeling in conjunction with mathematical programming techniques and reinforcement learning. Throughout these application areas, we discuss their respective industrial requirements and challenges.  A common challenge is the interpretability and efficiency o",
    "link": "http://arxiv.org/abs/2401.13836",
    "context": "Title: Machine learning for industrial sensing and control: A survey and practical perspective. (arXiv:2401.13836v1 [eess.SY])\nAbstract: With the rise of deep learning, there has been renewed interest within the process industries to utilize data on large-scale nonlinear sensing and control problems. We identify key statistical and machine learning techniques that have seen practical success in the process industries. To do so, we start with hybrid modeling to provide a methodological framework underlying core application areas: soft sensing, process optimization, and control. Soft sensing contains a wealth of industrial applications of statistical and machine learning methods. We quantitatively identify research trends, allowing insight into the most successful techniques in practice.  We consider two distinct flavors for data-driven optimization and control: hybrid modeling in conjunction with mathematical programming techniques and reinforcement learning. Throughout these application areas, we discuss their respective industrial requirements and challenges.  A common challenge is the interpretability and efficiency o",
    "path": "papers/24/01/2401.13836.json",
    "total_tokens": 868,
    "translated_title": "机器学习在工业传感和控制中的应用：一项调查和实践视角",
    "translated_abstract": "随着深度学习的兴起，过程工业领域对于利用大规模非线性传感和控制问题的数据产生了新的兴趣。我们确定了在过程工业中取得实际成功的关键统计和机器学习技术。为此，我们以混合建模为起点，提供了支撑核心应用领域的方法论框架：软传感、过程优化和控制。软传感包含了统计和机器学习方法在工业应用的丰富案例。我们定量地识别了研究趋势，从而揭示了实践中最成功的技术。我们考虑了两种不同的数据驱动优化和控制方法：混合建模结合数学规划技术以及强化学习。在这些应用领域中，我们讨论了它们各自的工业需求和挑战。一个共同的挑战是解释性和效率问题。",
    "tldr": "本文调查了机器学习在工业传感和控制中的应用，确定了在过程工业中实际成功的关键技术，并讨论了软传感、过程优化和控制等核心应用领域的需求和挑战。",
    "en_tdlr": "This paper surveys the application of machine learning in industrial sensing and control, identifies key techniques that have been successful in the process industries, and discusses the requirements and challenges in core application areas such as soft sensing, process optimization, and control."
}