{
    "title": "Text2MDT: Extracting Medical Decision Trees from Medical Texts. (arXiv:2401.02034v1 [cs.CL])",
    "abstract": "Knowledge of the medical decision process, which can be modeled as medical decision trees (MDTs), is critical to build clinical decision support systems. However, the current MDT construction methods rely heavily on time-consuming and laborious manual annotation. In this work, we propose a novel task, Text2MDT, to explore the automatic extraction of MDTs from medical texts such as medical guidelines and textbooks. We normalize the form of the MDT and create an annotated Text-to-MDT dataset in Chinese with the participation of medical experts. We investigate two different methods for the Text2MDT tasks: (a) an end-to-end framework which only relies on a GPT style large language models (LLM) instruction tuning to generate all the node information and tree structures. (b) The pipeline framework which decomposes the Text2MDT task to three subtasks. Experiments on our Text2MDT dataset demonstrate that: (a) the end-to-end method basd on LLMs (7B parameters or larger) show promising results, ",
    "link": "http://arxiv.org/abs/2401.02034",
    "context": "Title: Text2MDT: Extracting Medical Decision Trees from Medical Texts. (arXiv:2401.02034v1 [cs.CL])\nAbstract: Knowledge of the medical decision process, which can be modeled as medical decision trees (MDTs), is critical to build clinical decision support systems. However, the current MDT construction methods rely heavily on time-consuming and laborious manual annotation. In this work, we propose a novel task, Text2MDT, to explore the automatic extraction of MDTs from medical texts such as medical guidelines and textbooks. We normalize the form of the MDT and create an annotated Text-to-MDT dataset in Chinese with the participation of medical experts. We investigate two different methods for the Text2MDT tasks: (a) an end-to-end framework which only relies on a GPT style large language models (LLM) instruction tuning to generate all the node information and tree structures. (b) The pipeline framework which decomposes the Text2MDT task to three subtasks. Experiments on our Text2MDT dataset demonstrate that: (a) the end-to-end method basd on LLMs (7B parameters or larger) show promising results, ",
    "path": "papers/24/01/2401.02034.json",
    "total_tokens": 903,
    "translated_title": "Text2MDT: 从医学文本中提取医学决策树",
    "translated_abstract": "对医疗决策过程的知识，可以建模为医学决策树（MDT），对于构建临床决策支持系统至关重要。然而，目前的MDT构建方法严重依赖耗时繁琐的手动注释。在本研究中，我们提出了一个新颖的任务，Text2MDT，旨在探索从医学文本（如医学指南和教材）中自动提取MDT。我们规范了MDT的形式，并与医学专家一起创建了一个中文的标注文本到MDT数据集。我们研究了Text2MDT任务的两种不同方法：（a）一种仅依赖于GPT风格的大型语言模型（LLM）指令调整来生成所有节点信息和树结构的端到端框架。 （b）将Text2MDT任务分解为三个子任务的流水线框架。在我们的Text2MDT数据集上的实验表明：（a）基于LLM（参数规模为7B或更大）的端到端方法展现了有希望的结果，",
    "tldr": "本研究提出了一个新颖的任务，Text2MDT，旨在从医学文本中自动提取医学决策树。通过两种不同的方法进行实验，结果表明基于大型语言模型的端到端方法显示出有希望的结果。"
}