{
    "title": "Learning with Chemical versus Electrical Synapses -- Does it Make a Difference?. (arXiv:2401.08602v1 [cs.NE])",
    "abstract": "Bio-inspired neural networks have the potential to advance our understanding of neural computation and improve the state-of-the-art of AI systems. Bio-electrical synapses directly transmit neural signals, by enabling fast current flow between neurons. In contrast, bio-chemical synapses transmit neural signals indirectly, through neurotransmitters. Prior work showed that interpretable dynamics for complex robotic control, can be achieved by using chemical synapses, within a sparse, bio-inspired architecture, called Neural Circuit Policies (NCPs). However, a comparison of these two synaptic models, within the same architecture, remains an unexplored area. In this work we aim to determine the impact of using chemical synapses compared to electrical synapses, in both sparse and all-to-all connected networks. We conduct experiments with autonomous lane-keeping through a photorealistic autonomous driving simulator to evaluate their performance under diverse conditions and in the presence of ",
    "link": "http://arxiv.org/abs/2401.08602",
    "context": "Title: Learning with Chemical versus Electrical Synapses -- Does it Make a Difference?. (arXiv:2401.08602v1 [cs.NE])\nAbstract: Bio-inspired neural networks have the potential to advance our understanding of neural computation and improve the state-of-the-art of AI systems. Bio-electrical synapses directly transmit neural signals, by enabling fast current flow between neurons. In contrast, bio-chemical synapses transmit neural signals indirectly, through neurotransmitters. Prior work showed that interpretable dynamics for complex robotic control, can be achieved by using chemical synapses, within a sparse, bio-inspired architecture, called Neural Circuit Policies (NCPs). However, a comparison of these two synaptic models, within the same architecture, remains an unexplored area. In this work we aim to determine the impact of using chemical synapses compared to electrical synapses, in both sparse and all-to-all connected networks. We conduct experiments with autonomous lane-keeping through a photorealistic autonomous driving simulator to evaluate their performance under diverse conditions and in the presence of ",
    "path": "papers/24/01/2401.08602.json",
    "total_tokens": 858,
    "translated_title": "学习化学合成与电合成——有区别吗?",
    "translated_abstract": "生物启发的神经网络有助于推动我们对神经计算的理解，并改进人工智能系统的现状。生物电化学合成直接通过使神经元之间的电流快速流动来传递神经信号。相反，生物化学合成通过神经递质间接传递神经信号。之前的研究表明，在稀疏的、生物启发的架构——神经回路策略(NCPs)中使用化学合成可以实现复杂机器人控制的可解释性动态。然而，在相同的架构中比较这两种突触模型的影响尚未被探索。在这项研究中，我们旨在确定在稀疏和全连接网络中使用化学合成与电合成的影响。我们通过逼真的自动驾驶模拟器进行自主车道保持的实验，在不同条件下以及存在噪声情况下评估它们的性能。",
    "tldr": "本文研究了在稀疏和全连接网络中使用化学合成与电合成的影响，并通过自动驾驶模拟器的实验来评估它们在不同条件下的性能。"
}