{
    "title": "Making Sense of Knowledge Intensive Processes: an Oil & Gas Industry Scenario",
    "abstract": "Sensemaking is a constant and ongoing process by which people associate meaning to experiences. It can be an individual process, known as abduction, or a group process by which people give meaning to collective experiences. The sensemaking of a group is influenced by the abduction process of each person about the experience. Every collaborative process needs some level of sensemaking to show results. For a knowledge intensive process, sensemaking is central and related to most of its tasks. We present findings from a fieldwork executed in knowledge intensive process from the Oil and Gas industry. Our findings indicated that different types of knowledge can be combined to compose the result of a sensemaking process (e.g. decision, the need for more discussion, etc.). This paper presents an initial set of knowledge types that can be combined to compose the result of the sensemaking of a collaborative decision making process. We also discuss ideas for using systems powered by Artificial I",
    "link": "https://arxiv.org/abs/2401.17866",
    "context": "Title: Making Sense of Knowledge Intensive Processes: an Oil & Gas Industry Scenario\nAbstract: Sensemaking is a constant and ongoing process by which people associate meaning to experiences. It can be an individual process, known as abduction, or a group process by which people give meaning to collective experiences. The sensemaking of a group is influenced by the abduction process of each person about the experience. Every collaborative process needs some level of sensemaking to show results. For a knowledge intensive process, sensemaking is central and related to most of its tasks. We present findings from a fieldwork executed in knowledge intensive process from the Oil and Gas industry. Our findings indicated that different types of knowledge can be combined to compose the result of a sensemaking process (e.g. decision, the need for more discussion, etc.). This paper presents an initial set of knowledge types that can be combined to compose the result of the sensemaking of a collaborative decision making process. We also discuss ideas for using systems powered by Artificial I",
    "path": "papers/24/01/2401.17866.json",
    "total_tokens": 883,
    "translated_title": "理解知识密集型过程：以油气工业为例",
    "translated_abstract": "理解是一种不断进行的过程，人们通过经验给事物赋予意义。它可以是个别的过程，被称为“猜测”，也可以是一种群体过程，人们通过它给集体经验赋予意义。群体的理解受到每个人对经验的猜测过程的影响。每个协作过程都需要一定程度的理解才能取得结果。对于知识密集型过程，理解是中心和与大多数任务相关的。我们通过在油气工业的知识密集型过程中进行的实地调查提出了研究结果。我们的研究结果表明，可以组合不同类型的知识来组成理解过程的结果（如决策、需要更多讨论等）。本文提出了一组初始的知识类型，可以组合起来形成协作决策过程的理解结果。同时，我们还讨论了利用人工智能驱动的系统来实现这些想法的可能性。",
    "tldr": "本研究在油气工业的知识密集型过程中找到了不同类型的知识可以组合来形成协作决策过程的理解结果。我们还讨论了利用人工智能驱动的系统来实现这些想法的可能性。",
    "en_tdlr": "This study identifies how different types of knowledge can be combined to form the result of collaborative decision making in knowledge intensive processes in the oil and gas industry. Additionally, the potential use of AI-powered systems in implementing these ideas is discussed."
}