{
    "title": "Sensor Placement for Learning in Flow Networks. (arXiv:2401.02438v1 [eess.SP])",
    "abstract": "Large infrastructure networks (e.g. for transportation and power distribution) require constant monitoring for failures, congestion, and other adversarial events. However, assigning a sensor to every link in the network is often infeasible due to placement and maintenance costs. Instead, sensors can be placed only on a few key links, and machine learning algorithms can be leveraged for the inference of missing measurements (e.g. traffic counts, power flows) across the network. This paper investigates the sensor placement problem for networks. We first formalize the problem under a flow conservation assumption and show that it is NP-hard to place a fixed set of sensors optimally. Next, we propose an efficient and adaptive greedy heuristic for sensor placement that scales to large networks. Our experiments, using datasets from real-world application domains, show that the proposed approach enables more accurate inference than existing alternatives from the literature. We demonstrate that",
    "link": "http://arxiv.org/abs/2401.02438",
    "context": "Title: Sensor Placement for Learning in Flow Networks. (arXiv:2401.02438v1 [eess.SP])\nAbstract: Large infrastructure networks (e.g. for transportation and power distribution) require constant monitoring for failures, congestion, and other adversarial events. However, assigning a sensor to every link in the network is often infeasible due to placement and maintenance costs. Instead, sensors can be placed only on a few key links, and machine learning algorithms can be leveraged for the inference of missing measurements (e.g. traffic counts, power flows) across the network. This paper investigates the sensor placement problem for networks. We first formalize the problem under a flow conservation assumption and show that it is NP-hard to place a fixed set of sensors optimally. Next, we propose an efficient and adaptive greedy heuristic for sensor placement that scales to large networks. Our experiments, using datasets from real-world application domains, show that the proposed approach enables more accurate inference than existing alternatives from the literature. We demonstrate that",
    "path": "papers/24/01/2401.02438.json",
    "total_tokens": 834,
    "translated_title": "流网络中的传感器布置问题",
    "translated_abstract": "大型基础设施网络（如交通和电力分布）需要持续监测故障、拥塞和其他不利事件。然而，由于布置和维护成本的原因，往往无法在网络的每个链路上设置传感器。相反，可以仅在几个关键链路上放置传感器，并利用机器学习算法在整个网络中推断缺失的测量（如交通量、功率流）。本文研究了网络传感器布置问题。首先，在流量守恒的假设下，我们形式化了该问题，并证明了在确定的传感器集合上进行最优布置是NP-hard的。接下来，我们提出了一种高效且自适应的贪心算法用于传感器布置，该算法能够适应大型网络。我们的实验证明，与现有文献中的替代方案相比，所提出的方法能够实现更准确的推断。",
    "tldr": "本论文研究了网络中的传感器布置问题，通过将传感器仅放置在关键链路上，利用机器学习算法推断整个网络中缺失的测量，从而实现了更准确的推断。",
    "en_tdlr": "This paper investigates the sensor placement problem for networks, by placing sensors only on key links and leveraging machine learning algorithms to infer missing measurements across the network, more accurate inference is achieved."
}