{
    "title": "D2K: Turning Historical Data into Retrievable Knowledge for Recommender Systems. (arXiv:2401.11478v2 [cs.IR] UPDATED)",
    "abstract": "A vast amount of user behavior data is constantly accumulating on today's large recommendation platforms, recording users' various interests and tastes. Preserving knowledge from the old data while new data continually arrives is a vital problem for recommender systems. Existing approaches generally seek to save the knowledge implicitly in the model parameters. However, such a parameter-centric approach lacks scalability and flexibility -- the capacity is hard to scale, and the knowledge is inflexible to utilize. Hence, in this work, we propose a framework that turns massive user behavior data to retrievable knowledge (D2K). It is a data-centric approach that is model-agnostic and easy to scale up. Different from only storing unary knowledge such as the user-side or item-side information, D2K propose to store ternary knowledge for recommendation, which is determined by the complete recommendation factors -user, item, and context. The knowledge retrieved by target samples can be direc",
    "link": "http://arxiv.org/abs/2401.11478",
    "context": "Title: D2K: Turning Historical Data into Retrievable Knowledge for Recommender Systems. (arXiv:2401.11478v2 [cs.IR] UPDATED)\nAbstract: A vast amount of user behavior data is constantly accumulating on today's large recommendation platforms, recording users' various interests and tastes. Preserving knowledge from the old data while new data continually arrives is a vital problem for recommender systems. Existing approaches generally seek to save the knowledge implicitly in the model parameters. However, such a parameter-centric approach lacks scalability and flexibility -- the capacity is hard to scale, and the knowledge is inflexible to utilize. Hence, in this work, we propose a framework that turns massive user behavior data to retrievable knowledge (D2K). It is a data-centric approach that is model-agnostic and easy to scale up. Different from only storing unary knowledge such as the user-side or item-side information, D2K propose to store ternary knowledge for recommendation, which is determined by the complete recommendation factors -user, item, and context. The knowledge retrieved by target samples can be direc",
    "path": "papers/24/01/2401.11478.json",
    "total_tokens": 931,
    "translated_title": "D2K: 将历史数据转化为可检索的知识，用于推荐系统",
    "translated_abstract": "如今，在大型推荐平台上不断积累的大量用户行为数据记录了用户的各种兴趣和品味。但是，如何在新数据不断到来时保留旧数据中的知识成为推荐系统中的一个重要问题。现有的方法通常试图将知识隐含在模型参数中。然而，这种以参数为中心的方法缺乏可扩展性和灵活性——容量难以扩展，知识难以利用。因此，本文提出了一个将大量用户行为数据转化为可检索知识的框架（D2K）。这是一种以数据为中心的方法，不依赖于特定模型并且易于扩展。不同于仅存储用户或物品的一元知识，D2K提出存储用于推荐的三元知识，该知识由完整的推荐因素——用户、物品和背景构成。目标样本可以直接检索到这些知识。",
    "tldr": "D2K提出了一个以数据为中心的框架，将大量用户行为数据转化为可检索的知识，用于推荐系统。与传统的将知识存储在模型参数中的方法不同，D2K存储的是由用户、物品和背景构成的完整的推荐因素，从而具有更好的可扩展性和灵活性。",
    "en_tdlr": "D2K proposes a data-centric framework that turns massive user behavior data into retrievable knowledge for recommender systems. Unlike existing parameter-centric approaches, D2K stores complete recommendation factors - user, item, and context, resulting in better scalability and flexibility."
}