{
    "title": "Large Language Models vs. Search Engines: Evaluating User Preferences Across Varied Information Retrieval Scenarios. (arXiv:2401.05761v1 [cs.IR])",
    "abstract": "This study embarked on a comprehensive exploration of user preferences between Search Engines and Large Language Models (LLMs) in the context of various information retrieval scenarios. Conducted with a sample size of 100 internet users (N=100) from across the United States, the research delved into 20 distinct use cases ranging from factual searches, such as looking up COVID-19 guidelines, to more subjective tasks, like seeking interpretations of complex concepts in layman's terms. Participants were asked to state their preference between using a traditional search engine or an LLM for each scenario. This approach allowed for a nuanced understanding of how users perceive and utilize these two predominant digital tools in differing contexts. The use cases were carefully selected to cover a broad spectrum of typical online queries, thus ensuring a comprehensive analysis of user preferences. The findings reveal intriguing patterns in user choices, highlighting a clear tendency for partic",
    "link": "http://arxiv.org/abs/2401.05761",
    "context": "Title: Large Language Models vs. Search Engines: Evaluating User Preferences Across Varied Information Retrieval Scenarios. (arXiv:2401.05761v1 [cs.IR])\nAbstract: This study embarked on a comprehensive exploration of user preferences between Search Engines and Large Language Models (LLMs) in the context of various information retrieval scenarios. Conducted with a sample size of 100 internet users (N=100) from across the United States, the research delved into 20 distinct use cases ranging from factual searches, such as looking up COVID-19 guidelines, to more subjective tasks, like seeking interpretations of complex concepts in layman's terms. Participants were asked to state their preference between using a traditional search engine or an LLM for each scenario. This approach allowed for a nuanced understanding of how users perceive and utilize these two predominant digital tools in differing contexts. The use cases were carefully selected to cover a broad spectrum of typical online queries, thus ensuring a comprehensive analysis of user preferences. The findings reveal intriguing patterns in user choices, highlighting a clear tendency for partic",
    "path": "papers/24/01/2401.05761.json",
    "total_tokens": 871,
    "translated_title": "大型语言模型与搜索引擎：在不同信息检索场景中评估用户偏好的对比研究",
    "translated_abstract": "本研究在不同信息检索场景中全面探讨了用户对搜索引擎和大型语言模型（LLM）的偏好。通过对来自美国各地的100名互联网用户（N=100）进行调查，研究涵盖了20个不同的用例，涵盖了从事实搜索（例如查找COVID-19指南）到更主观的任务（例如寻求以非专业术语解释复杂概念）的范围。参与者被要求在每种情况下选择使用传统搜索引擎还是LLM。这种方法使我们能够深入了解用户在不同背景下如何认知和使用这两种主要数字工具。用例的选择经过精心挑选，涵盖了广泛的在线查询，从而确保了对用户偏好的全面分析。研究结果揭示了用户选择中的有趣模式，并突出显示了用户对LLM的倾向性。",
    "tldr": "本研究对搜索引擎和大型语言模型（LLM）在不同信息检索场景中的用户偏好进行了全面对比研究，发现用户对LLM有明显的倾向性。",
    "en_tdlr": "This study conducted a comprehensive comparison between search engines and large language models (LLMs) in various information retrieval scenarios. The findings highlight a clear tendency of user preference towards LLMs."
}