{
    "title": "Positive unlabeled learning for building recommender systems in a parliamentary setting. (arXiv:2401.10961v1 [cs.IR])",
    "abstract": "Our goal is to learn about the political interests and preferences of the Members of Parliament by mining their parliamentary activity, in order to develop a recommendation/filtering system that, given a stream of documents to be distributed among them, is able to decide which documents should receive each Member of Parliament. We propose to use positive unlabeled learning to tackle this problem, because we only have information about relevant documents (the own interventions of each Member of Parliament in the debates) but not about irrelevant documents, so that we cannot use standard binary classifiers trained with positive and negative examples. We have also developed a new algorithm of this type, which compares favourably with: a) the baseline approach assuming that all the interventions of other Members of Parliament are irrelevant, b) another well-known positive unlabeled learning method and c) an approach based on information retrieval methods that matches documents and legislat",
    "link": "http://arxiv.org/abs/2401.10961",
    "context": "Title: Positive unlabeled learning for building recommender systems in a parliamentary setting. (arXiv:2401.10961v1 [cs.IR])\nAbstract: Our goal is to learn about the political interests and preferences of the Members of Parliament by mining their parliamentary activity, in order to develop a recommendation/filtering system that, given a stream of documents to be distributed among them, is able to decide which documents should receive each Member of Parliament. We propose to use positive unlabeled learning to tackle this problem, because we only have information about relevant documents (the own interventions of each Member of Parliament in the debates) but not about irrelevant documents, so that we cannot use standard binary classifiers trained with positive and negative examples. We have also developed a new algorithm of this type, which compares favourably with: a) the baseline approach assuming that all the interventions of other Members of Parliament are irrelevant, b) another well-known positive unlabeled learning method and c) an approach based on information retrieval methods that matches documents and legislat",
    "path": "papers/24/01/2401.10961.json",
    "total_tokens": 814,
    "translated_title": "在议会环境中构建推荐系统的正无标签学习",
    "translated_abstract": "我们的目标是通过挖掘议会活动来了解议员的政治兴趣和偏好，以开发一个推荐/过滤系统。给定要分配给他们的一系列文件，该系统可以决定每位议员应该收到哪些文件。我们提出使用正无标签学习来解决这个问题，因为我们只有有关相关文件（每位议员在辩论中自己的发言）的信息，但没有关于不相关文件的信息，因此我们无法使用通过正负样本训练的标准二元分类器。我们还开发了一种新的算法，与以下方法相比表现更好：a) 基于假设其他议员的干预都是不相关的基准方法，b) 另一种广为人知的正无标签学习方法，c) 基于信息检索方法将文件和立法进行匹配的方法。",
    "tldr": "通过正无标签学习，我们开发了一个推荐/过滤系统，通过挖掘议会活动来了解议员的政治兴趣和偏好，并决定哪些文件应该分发给每位议员。"
}