{
    "title": "A Deep Network for Explainable Prediction of Non-Imaging Phenotypes using Anatomical Multi-View Data. (arXiv:2401.04579v1 [q-bio.QM])",
    "abstract": "Large datasets often contain multiple distinct feature sets, or views, that offer complementary information that can be exploited by multi-view learning methods to improve results. We investigate anatomical multi-view data, where each brain anatomical structure is described with multiple feature sets. In particular, we focus on sets of white matter microstructure and connectivity features from diffusion MRI, as well as sets of gray matter area and thickness features from structural MRI. We investigate machine learning methodology that applies multi-view approaches to improve the prediction of non-imaging phenotypes, including demographics (age), motor (strength), and cognition (picture vocabulary). We present an explainable multi-view network (EMV-Net) that can use different anatomical views to improve prediction performance. In this network, each individual anatomical view is processed by a view-specific feature extractor and the extracted information from each view is fused using a l",
    "link": "http://arxiv.org/abs/2401.04579",
    "context": "Title: A Deep Network for Explainable Prediction of Non-Imaging Phenotypes using Anatomical Multi-View Data. (arXiv:2401.04579v1 [q-bio.QM])\nAbstract: Large datasets often contain multiple distinct feature sets, or views, that offer complementary information that can be exploited by multi-view learning methods to improve results. We investigate anatomical multi-view data, where each brain anatomical structure is described with multiple feature sets. In particular, we focus on sets of white matter microstructure and connectivity features from diffusion MRI, as well as sets of gray matter area and thickness features from structural MRI. We investigate machine learning methodology that applies multi-view approaches to improve the prediction of non-imaging phenotypes, including demographics (age), motor (strength), and cognition (picture vocabulary). We present an explainable multi-view network (EMV-Net) that can use different anatomical views to improve prediction performance. In this network, each individual anatomical view is processed by a view-specific feature extractor and the extracted information from each view is fused using a l",
    "path": "papers/24/01/2401.04579.json",
    "total_tokens": 894,
    "translated_title": "使用解释型多视图数据预测非成像表型的深度网络",
    "translated_abstract": "大型数据集通常包含多个不同的特征集或视图，这些视图提供了互补信息，可以通过多视图学习方法利用它们来提高结果。我们研究了解剖多视图数据，其中每个脑解剖结构用多个特征集描述。特别是，我们关注来自扩散MR（diffusion MRI）的白质微结构和连接特征集，以及来自结构MR（structural MRI）的灰质面积和厚度特征集。我们研究了应用多视图方法改进非成像表型（包括人口统计学特征（年龄）、运动（力量）和认知（词汇图像））预测的机器学习方法。我们提出了一个可解释的多视图网络（EMV-Net），可以利用不同的解剖视图来提高预测性能。在这个网络中，每个个体解剖视图都经过视图特定的特征提取器处理，然后将每个视图提取的信息融合在一起。",
    "tldr": "本论文研究了利用解剖多视图数据预测非成像表型的深度网络，提出了一个可解释的多视图网络（EMV-Net），通过融合不同解剖视图来提高预测性能。",
    "en_tdlr": "This paper investigates a deep network for predicting non-imaging phenotypes using anatomical multi-view data. It proposes an explainable multi-view network (EMV-Net) that improves prediction performance by fusing different anatomical views."
}