{
    "title": "On the selection and effectiveness of pseudo-absences for species distribution modeling with deep learning. (arXiv:2401.02989v1 [q-bio.QM])",
    "abstract": "Species distribution modeling is a highly versatile tool for understanding the intricate relationship between environmental conditions and species occurrences. However, the available data often lacks information on confirmed species absence and is limited to opportunistically sampled, presence-only observations. To overcome this limitation, a common approach is to employ pseudo-absences, which are specific geographic locations designated as negative samples. While pseudo-absences are well-established for single-species distribution models, their application in the context of multi-species neural networks remains underexplored. Notably, the significant class imbalance between species presences and pseudo-absences is often left unaddressed. Moreover, the existence of different types of pseudo-absences (e.g., random and target-group background points) adds complexity to the selection process. Determining the optimal combination of pseudo-absences types is difficult and depends on the char",
    "link": "http://arxiv.org/abs/2401.02989",
    "context": "Title: On the selection and effectiveness of pseudo-absences for species distribution modeling with deep learning. (arXiv:2401.02989v1 [q-bio.QM])\nAbstract: Species distribution modeling is a highly versatile tool for understanding the intricate relationship between environmental conditions and species occurrences. However, the available data often lacks information on confirmed species absence and is limited to opportunistically sampled, presence-only observations. To overcome this limitation, a common approach is to employ pseudo-absences, which are specific geographic locations designated as negative samples. While pseudo-absences are well-established for single-species distribution models, their application in the context of multi-species neural networks remains underexplored. Notably, the significant class imbalance between species presences and pseudo-absences is often left unaddressed. Moreover, the existence of different types of pseudo-absences (e.g., random and target-group background points) adds complexity to the selection process. Determining the optimal combination of pseudo-absences types is difficult and depends on the char",
    "path": "papers/24/01/2401.02989.json",
    "total_tokens": 893,
    "translated_title": "关于使用深度学习进行物种分布建模中伪缺失选择和效果的研究",
    "translated_abstract": "物种分布建模是一种非常多功能的工具，用于理解环境条件和物种出现之间的复杂关系。然而，现有数据通常缺乏关于确认的物种缺失的信息，并且仅限于机会性抽样的出现观察。为了克服这个限制，常见的方法是使用伪缺失，它们是指定为负样本的特定地理位置。虽然伪缺失在单物种分布模型中已经得到广泛应用，但在多物种神经网络的背景下，它们的应用仍未充分探索。值得注意的是，物种存在出现和伪缺失之间的类别不平衡往往被忽视。此外，不同类型的伪缺失（例如，随机和目标群体背景点）的存在使选择过程变得复杂。确定伪缺失类型的最佳组合是困难的，并且取决于特征。",
    "tldr": "该论文研究了在多物种神经网络中使用伪缺失的选择和效果。作者指出物种出现和伪缺失之间的类别不平衡问题经常被忽视，不同类型的伪缺失选择对结果产生了复杂影响。",
    "en_tdlr": "This paper investigates the selection and effectiveness of pseudo-absences in multi-species neural networks. The authors highlight the often overlooked issue of class imbalance between species presences and pseudo-absences, and the complicated impact of different types of pseudo-absences on the results."
}