{
    "title": "A Hybrid Approach of Transfer Learning and Physics-Informed Modeling: Improving Dissolved Oxygen Concentration Prediction in an Industrial Wastewater Treatment Plant. (arXiv:2401.11217v1 [cs.LG])",
    "abstract": "Constructing first principles models is a challenging task for nonlinear and complex systems such as a wastewater treatment unit. In recent years, data-driven models are widely used to overcome the complexity. However, they often suffer from issues such as missing, low quality or noisy data. Transfer learning is a solution for this issue where knowledge from another task is transferred to target one to increase the prediction performance. In this work, the objective is increasing the prediction performance of an industrial wastewater treatment plant by transferring the knowledge of (i) an open-source simulation model that captures the underlying physics of the process, albeit with dissimilarities to the target plant, (ii) another industrial plant characterized by noisy and limited data but located in the same refinery, and (iii) the model in (ii) and making the objective function of the training problem physics informed where the physics information derived from the open-source model i",
    "link": "http://arxiv.org/abs/2401.11217",
    "context": "Title: A Hybrid Approach of Transfer Learning and Physics-Informed Modeling: Improving Dissolved Oxygen Concentration Prediction in an Industrial Wastewater Treatment Plant. (arXiv:2401.11217v1 [cs.LG])\nAbstract: Constructing first principles models is a challenging task for nonlinear and complex systems such as a wastewater treatment unit. In recent years, data-driven models are widely used to overcome the complexity. However, they often suffer from issues such as missing, low quality or noisy data. Transfer learning is a solution for this issue where knowledge from another task is transferred to target one to increase the prediction performance. In this work, the objective is increasing the prediction performance of an industrial wastewater treatment plant by transferring the knowledge of (i) an open-source simulation model that captures the underlying physics of the process, albeit with dissimilarities to the target plant, (ii) another industrial plant characterized by noisy and limited data but located in the same refinery, and (iii) the model in (ii) and making the objective function of the training problem physics informed where the physics information derived from the open-source model i",
    "path": "papers/24/01/2401.11217.json",
    "total_tokens": 956,
    "translated_title": "一种传输学习和物理信息建模的混合方法：提高工业废水处理厂溶解氧浓度预测的准确性",
    "translated_abstract": "构建非线性和复杂系统（如废水处理单元）的第一原理模型是一项具有挑战性的任务。近年来，数据驱动模型被广泛用于解决复杂性问题。然而，它们常常面临着缺失、低质量或噪声数据等问题。传输学习是解决这个问题的一种方法，它将来自另一个任务的知识传输到目标任务中，以提高预测性能。本文旨在通过传输（i）捕获过程底层物理特性的开源仿真模型的知识，尽管与目标工厂有所不同，（ii）另一个特点是噪声和有限数据的同一炼油厂的工业厂的知识，以及（iii）来自（ii）模型，并将训练问题的目标函数建模为物理信息，从开源模型的导出物理信息。",
    "tldr": "本论文提出了一种传输学习和物理信息建模的混合方法，通过将其他任务中的知识转移到目标任务中，以提高工业废水处理厂溶解氧浓度预测的准确性。这种方法结合了开源模型的物理知识和另一个工业厂的数据，并使训练问题的目标函数具备物理信息建模的特点。",
    "en_tdlr": "This paper proposes a hybrid approach of transfer learning and physics-informed modeling to improve dissolved oxygen concentration prediction in an industrial wastewater treatment plant. By transferring knowledge from other tasks, such as an open-source simulation model and another industrial plant, and incorporating physics information into the training problem, this method enhances the prediction performance."
}