{
    "title": "Multitask methods for predicting molecular properties from heterogeneous data",
    "abstract": "Data generation remains a bottleneck in training surrogate models to predict molecular properties. We demonstrate that multitask Gaussian process regression overcomes this limitation by leveraging both expensive and cheap data sources. In particular, we consider training sets constructed from coupled-cluster (CC) and density function theory (DFT) data. We report that multitask surrogates can predict at CC level accuracy with a reduction to data generation cost by over an order of magnitude. Of note, our approach allows the training set to include DFT data generated by a heterogeneous mix of exchange-correlation functionals without imposing any artificial hierarchy on functional accuracy. More generally, the multitask framework can accommodate a wider range of training set structures -- including full disparity between the different levels of fidelity -- than existing kernel approaches based on $\\Delta$-learning, though we show that the accuracy of the two approaches can be similar. Con",
    "link": "https://arxiv.org/abs/2401.17898",
    "context": "Title: Multitask methods for predicting molecular properties from heterogeneous data\nAbstract: Data generation remains a bottleneck in training surrogate models to predict molecular properties. We demonstrate that multitask Gaussian process regression overcomes this limitation by leveraging both expensive and cheap data sources. In particular, we consider training sets constructed from coupled-cluster (CC) and density function theory (DFT) data. We report that multitask surrogates can predict at CC level accuracy with a reduction to data generation cost by over an order of magnitude. Of note, our approach allows the training set to include DFT data generated by a heterogeneous mix of exchange-correlation functionals without imposing any artificial hierarchy on functional accuracy. More generally, the multitask framework can accommodate a wider range of training set structures -- including full disparity between the different levels of fidelity -- than existing kernel approaches based on $\\Delta$-learning, though we show that the accuracy of the two approaches can be similar. Con",
    "path": "papers/24/01/2401.17898.json",
    "total_tokens": 813,
    "translated_title": "从异质数据预测分子属性的多任务方法",
    "translated_abstract": "数据生成仍然是训练代理模型预测分子属性的瓶颈。我们证明，多任务高斯过程回归通过利用昂贵和廉价的数据源，克服了这个限制。特别是，我们考虑从耦合簇（CC）和密度泛函理论（DFT）数据构建的训练集。我们报告说，多任务代理模型可以以CC级精度进行预测，并且数据生成成本减少了一个数量级。值得注意的是，我们的方法允许训练集包括由异质混合的交换相关泛函生成的DFT数据，而不对泛函精度施加任何人为的层次结构。更一般地，多任务框架可以适应更广泛范围的训练集结构，包括不同保真级别之间的完全差异，而不像现有的基于$\\Delta$学习的核方法那样，我们证明这两种方法的准确度可以相似。",
    "tldr": "多任务方法可以通过利用异质数据源来预测分子属性，大大降低数据生成成本，并且达到与耦合簇数据相当的准确度。"
}