{
    "title": "Dissecting users' needs for search result explanations. (arXiv:2401.16509v1 [cs.HC])",
    "abstract": "There is a growing demand for transparency in search engines to understand how search results are curated and to enhance users' trust. Prior research has introduced search result explanations with a focus on how to explain, assuming explanations are beneficial. Our study takes a step back to examine if search explanations are needed and when they are likely to provide benefits. Additionally, we summarize key characteristics of helpful explanations and share users' perspectives on explanation features provided by Google and Bing. Interviews with non-technical individuals reveal that users do not always seek or understand search explanations and mostly desire them for complex and critical tasks. They find Google's search explanations too obvious but appreciate the ability to contest search results. Based on our findings, we offer design recommendations for search engines and explanations to help users better evaluate search results and enhance their search experience.",
    "link": "http://arxiv.org/abs/2401.16509",
    "context": "Title: Dissecting users' needs for search result explanations. (arXiv:2401.16509v1 [cs.HC])\nAbstract: There is a growing demand for transparency in search engines to understand how search results are curated and to enhance users' trust. Prior research has introduced search result explanations with a focus on how to explain, assuming explanations are beneficial. Our study takes a step back to examine if search explanations are needed and when they are likely to provide benefits. Additionally, we summarize key characteristics of helpful explanations and share users' perspectives on explanation features provided by Google and Bing. Interviews with non-technical individuals reveal that users do not always seek or understand search explanations and mostly desire them for complex and critical tasks. They find Google's search explanations too obvious but appreciate the ability to contest search results. Based on our findings, we offer design recommendations for search engines and explanations to help users better evaluate search results and enhance their search experience.",
    "path": "papers/24/01/2401.16509.json",
    "total_tokens": 852,
    "translated_title": "揭示用户对搜索结果解释的需求",
    "translated_abstract": "对于搜索引擎如何解释搜索结果的问题，已有研究假设解释会有益处，并引入了搜索结果解释。然而，我们的研究从根本上考虑了搜索解释是否需要以及何时会有益处。此外，我们总结了有益的解释的关键特征，并分享了用户对Google和Bing提供的解释功能的看法。对非技术人员的访谈显示，用户并不总是寻求或理解搜索解释，但对于复杂和关键的任务，他们觉得解释有帮助。他们认为Google的搜索解释太明显，但赞赏能够质疑搜索结果的能力。根据我们的研究结果，我们提供了设计建议，以帮助用户更好地评估搜索结果并提升他们的搜索体验。",
    "tldr": "该论文研究了用户对搜索结果解释的需求，发现用户不总是寻求解释，但对于复杂和关键的任务，解释是有益处的。该研究还总结了有益的解释的关键特征，并提出了对搜索引擎和解释的设计建议，以帮助用户更好地评估搜索结果并提升他们的搜索体验。",
    "en_tdlr": "This paper investigates users' needs for search result explanations and reveals that users do not always seek explanations, but they are beneficial for complex and critical tasks. The study also summarizes key characteristics of helpful explanations and offers design recommendations for search engines and explanations to enhance users' search experience."
}