{
    "title": "Inferring Properties of Graph Neural Networks",
    "abstract": "arXiv:2401.03790v2 Announce Type: replace  Abstract: We propose GNNInfer, the first automatic property inference technique for GNNs. To tackle the challenge of varying input structures in GNNs, GNNInfer first identifies a set of representative influential structures that contribute significantly towards the prediction of a GNN. Using these structures, GNNInfer converts each pair of an influential structure and the GNN to their equivalent FNN and then leverages existing property inference techniques to effectively capture properties of the GNN that are specific to the influential structures. GNNINfer then generalizes the captured properties to any input graphs that contain the influential structures. Finally, GNNInfer improves the correctness of the inferred properties by building a model (either a decision tree or linear regression) that estimates the deviation of GNN output from the inferred properties given full input graphs. The learned model helps GNNInfer extend the inferred prope",
    "link": "https://arxiv.org/abs/2401.03790",
    "context": "Title: Inferring Properties of Graph Neural Networks\nAbstract: arXiv:2401.03790v2 Announce Type: replace  Abstract: We propose GNNInfer, the first automatic property inference technique for GNNs. To tackle the challenge of varying input structures in GNNs, GNNInfer first identifies a set of representative influential structures that contribute significantly towards the prediction of a GNN. Using these structures, GNNInfer converts each pair of an influential structure and the GNN to their equivalent FNN and then leverages existing property inference techniques to effectively capture properties of the GNN that are specific to the influential structures. GNNINfer then generalizes the captured properties to any input graphs that contain the influential structures. Finally, GNNInfer improves the correctness of the inferred properties by building a model (either a decision tree or linear regression) that estimates the deviation of GNN output from the inferred properties given full input graphs. The learned model helps GNNInfer extend the inferred prope",
    "path": "papers/24/01/2401.03790.json",
    "total_tokens": 836,
    "translated_title": "推断图神经网络的属性",
    "translated_abstract": "我们提出了GNNInfer，这是用于GNN的首个自动属性推断技术。为了解决GNN中可变输入结构的挑战，GNNInfer首先识别一组对GNN预测有显著贡献的代表性影响结构。利用这些结构，GNNInfer将每对影响结构和GNN转换为它们等效的FNN，然后利用现有的属性推断技术有效捕捉与这些影响结构特定的GNN属性。然后，GNNInfer将捕获的属性推广到包含这些影响结构的任何输入图中。最后，GNNInfer通过建立一个模型（决策树或线性回归）来提高推断属性的正确性，该模型估计给定完整输入图时GNN输出与推断属性的偏差。学习的模型有助于GNNInfer扩展推断的属性。",
    "tldr": "提出了GNNInfer，这是用于GNN的首个自动属性推断技术，通过识别和转换代表性影响结构，捕捉并推广GNN特定属性，最终通过建立模型提高推断属性的正确性。",
    "en_tdlr": "Proposed GNNInfer, the first automatic property inference technique for GNNs, which identifies and converts representative influential structures to capture and generalize specific properties of GNN, ultimately improving the correctness of inferred properties by building a model."
}