{
    "title": "Phase discovery with active learning: Application to structural phase transitions in equiatomic NiTi. (arXiv:2401.05568v1 [cond-mat.mtrl-sci])",
    "abstract": "Nickel titanium (NiTi) is a protypical shape-memory alloy used in a range of biomedical and engineering devices, but direct molecular dynamics simulations of the martensitic B19' -> B2 phase transition driving its shape-memory behavior are rare and have relied on classical force fields with limited accuracy. Here, we train four machine-learned force fields for equiatomic NiTi based on the LDA, PBE, PBEsol, and SCAN DFT functionals. The models are trained on the fly during NPT molecular dynamics, with DFT calculations and model updates performed automatically whenever the uncertainty of a local energy prediction exceeds a chosen threshold. The models achieve accuracies of 1-2 meV/atom during training and are shown to closely track DFT predictions of B2 and B19' elastic constants and phonon frequencies. Surprisingly, in large-scale molecular dynamics simulations, only the SCAN model predicts a reversible B19' -> B2 phase transition, with the LDA, PBE, and PBEsol models predicting a rever",
    "link": "http://arxiv.org/abs/2401.05568",
    "context": "Title: Phase discovery with active learning: Application to structural phase transitions in equiatomic NiTi. (arXiv:2401.05568v1 [cond-mat.mtrl-sci])\nAbstract: Nickel titanium (NiTi) is a protypical shape-memory alloy used in a range of biomedical and engineering devices, but direct molecular dynamics simulations of the martensitic B19' -> B2 phase transition driving its shape-memory behavior are rare and have relied on classical force fields with limited accuracy. Here, we train four machine-learned force fields for equiatomic NiTi based on the LDA, PBE, PBEsol, and SCAN DFT functionals. The models are trained on the fly during NPT molecular dynamics, with DFT calculations and model updates performed automatically whenever the uncertainty of a local energy prediction exceeds a chosen threshold. The models achieve accuracies of 1-2 meV/atom during training and are shown to closely track DFT predictions of B2 and B19' elastic constants and phonon frequencies. Surprisingly, in large-scale molecular dynamics simulations, only the SCAN model predicts a reversible B19' -> B2 phase transition, with the LDA, PBE, and PBEsol models predicting a rever",
    "path": "papers/24/01/2401.05568.json",
    "total_tokens": 957,
    "translated_title": "用主动学习进行相变发现：在等原子比的NiTi中的结构相变应用",
    "translated_abstract": "镍钛(NiTi)是一种典型的形状记忆合金，广泛应用于生物医学和工程设备，但其形状记忆行为驱动的马氏体B19' -> B2相变的分子动力学模拟很少，且仅依赖于具有有限准确性的经典力场。本文利用LDA，PBE，PBEsol和SCAN DFT泛函基于等原子比的NiTi训练了四个机器学习力场。这些模型通过NPT分子动力学的同时进行训练，并在局部能量预测的不确定性超过选定阈值时自动进行DFT计算和模型更新。这些模型在训练过程中的准确度为1-2 meV/原子，并被证明能够密切跟踪DFT预测的B2和B19'弹性常数和声子频率。令人惊讶的是，在大规模分子动力学模拟中，只有SCAN模型预测出可逆的B19' -> B2相变，而LDA、PBE和PBEsol模型预测出可逆的B19' -> B2相变。",
    "tldr": "本文通过应用主动学习方法，在等原子比的镍钛中发现了可逆的B19' -> B2相变，并利用机器学习力场与DFT计算进行了验证和跟踪。"
}