{
    "title": "Predicting and Interpreting Energy Barriers of Metallic Glasses with Graph Neural Networks. (arXiv:2401.08627v1 [cond-mat.dis-nn])",
    "abstract": "Metallic Glasses (MGs) are widely used disordered materials. Understanding the relationship between the local structure and physical properties of MGs is one of the greatest challenges for both material science and condensed matter physics. In this work, we utilize Graph Neural Networks (GNNs) to model the atomic graph structure and study the connection between the structure and the corresponding local energy barrier, which is believed to govern many critical physical properties in MGs. One of our key contributions is to propose a novel Symmetrized GNN (SymGNN) model for predicting the energy barriers, which is invariant under orthogonal transformations of the structure, e.g., rotations and reflections. Such invariance is a desired property that standard GNNs like Graph Convolutional Networks cannot capture. SymGNNs handle the invariance by aggregating over orthogonal transformations of the graph structure for representation learning, and an optimal distribution over all 3D orthogonal ",
    "link": "http://arxiv.org/abs/2401.08627",
    "context": "Title: Predicting and Interpreting Energy Barriers of Metallic Glasses with Graph Neural Networks. (arXiv:2401.08627v1 [cond-mat.dis-nn])\nAbstract: Metallic Glasses (MGs) are widely used disordered materials. Understanding the relationship between the local structure and physical properties of MGs is one of the greatest challenges for both material science and condensed matter physics. In this work, we utilize Graph Neural Networks (GNNs) to model the atomic graph structure and study the connection between the structure and the corresponding local energy barrier, which is believed to govern many critical physical properties in MGs. One of our key contributions is to propose a novel Symmetrized GNN (SymGNN) model for predicting the energy barriers, which is invariant under orthogonal transformations of the structure, e.g., rotations and reflections. Such invariance is a desired property that standard GNNs like Graph Convolutional Networks cannot capture. SymGNNs handle the invariance by aggregating over orthogonal transformations of the graph structure for representation learning, and an optimal distribution over all 3D orthogonal ",
    "path": "papers/24/01/2401.08627.json",
    "total_tokens": 926,
    "translated_title": "使用图神经网络预测和解释金属玻璃的能垒",
    "translated_abstract": "金属玻璃是广泛使用的无序材料。理解金属玻璃的局部结构与物理性质之间的关系是材料科学和凝聚态物理学的最大挑战之一。本研究利用图神经网络来建模原子图结构，并研究结构与相应的局部能垒之间的联系，据信能够控制金属玻璃的许多关键物理性质。我们的一个重要贡献是提出了一种用于预测能垒的新型对称图神经网络（SymGNN）模型，该模型在结构的正交变换下具有不变性，例如旋转和反射。这种不变性是标准图神经网络如图卷积网络无法捕捉的性质。SymGNN通过聚合图结构的正交变换来进行表示学习，并对所有三维正交变换进行最优分布处理。",
    "tldr": "本研究使用图神经网络建模原子图结构并预测金属玻璃的能垒，通过提出的对称图神经网络模型，实现了在结构正交变换下的不变性，为理解金属玻璃的局部结构与物理性质关系提供了新的方法。",
    "en_tdlr": "This study utilizes Graph Neural Networks to model the atomic graph structure and predict the energy barriers of metallic glasses. The proposed Symmetrized GNN model achieves invariance under orthogonal transformations of the structure, providing a new approach to understanding the relationship between the local structure and physical properties of metallic glasses."
}