{
    "title": "I came, I saw, I certified: some perspectives on the safety assurance of cyber-physical systems. (arXiv:2401.16633v1 [cs.SE])",
    "abstract": "The execution failure of cyber-physical systems (e.g., autonomous driving systems, unmanned aerial systems, and robotic systems) could result in the loss of life, severe injuries, large-scale environmental damage, property destruction, and major economic loss. Hence, such systems usually require a strong justification that they will effectively support critical requirements (e.g., safety, security, and reliability) for which they were designed. Thus, it is often mandatory to develop compelling assurance cases to support that justification and allow regulatory bodies to certify such systems. In such contexts, detecting assurance deficits, relying on patterns to improve the structure of assurance cases, improving existing assurance case notations, and (semi-)automating the generation of assurance cases are key to develop compelling assurance cases and foster consumer acceptance. We therefore explore challenges related to such assurance enablers and outline some potential directions that ",
    "link": "http://arxiv.org/abs/2401.16633",
    "context": "Title: I came, I saw, I certified: some perspectives on the safety assurance of cyber-physical systems. (arXiv:2401.16633v1 [cs.SE])\nAbstract: The execution failure of cyber-physical systems (e.g., autonomous driving systems, unmanned aerial systems, and robotic systems) could result in the loss of life, severe injuries, large-scale environmental damage, property destruction, and major economic loss. Hence, such systems usually require a strong justification that they will effectively support critical requirements (e.g., safety, security, and reliability) for which they were designed. Thus, it is often mandatory to develop compelling assurance cases to support that justification and allow regulatory bodies to certify such systems. In such contexts, detecting assurance deficits, relying on patterns to improve the structure of assurance cases, improving existing assurance case notations, and (semi-)automating the generation of assurance cases are key to develop compelling assurance cases and foster consumer acceptance. We therefore explore challenges related to such assurance enablers and outline some potential directions that ",
    "path": "papers/24/01/2401.16633.json",
    "total_tokens": 849,
    "translated_title": "我来了，我看到了，我认证了：对于网络物理系统安全保证的几个观点",
    "translated_abstract": "网络物理系统（例如自动驾驶系统、无人机系统和机器人系统）的执行失败可能导致生命丧失、严重伤害、大规模环境破坏、财产损毁和重大经济损失。因此，这些系统通常需要强有力的理由来支持它们能够有效地支撑其设计的关键要求（例如安全性、可靠性和可用性）。因此，通常需要开发令人信服的保证案例来支持这种理由，并允许监管机构对此类系统进行认证。在这种情况下，检测保证案例中的缺陷，依赖模式来改进保证案例的结构，改进现有的保证案例符号，并（半）自动化生成保证案例是发展令人信服的保证案例并促进消费者接受的关键。因此，我们探讨了与这些保证启用器相关的挑战，并概述了一些潜在的方向。",
    "tldr": "对于网络物理系统的安全保证，开发令人信服的保证案例是关键，包括检测缺陷、改进结构和自动生成案例。"
}