{
    "title": "Machine Learning Applications in Spine Biomechanics. (arXiv:2401.06174v1 [eess.IV])",
    "abstract": "Spine biomechanics is at a transformation with the advent and integration of machine learning and computer vision technologies. These novel techniques facilitate the estimation of 3D body shapes, anthropometrics, and kinematics from as simple as a single-camera image, making them more accessible and practical for a diverse range of applications. This study introduces a framework that merges these methodologies with traditional musculoskeletal modeling, enabling comprehensive analysis of spinal biomechanics during complex activities from a single camera. Additionally, we aim to evaluate their performance and limitations in spine biomechanics applications. The real-world applications explored in this study include assessment in workplace lifting, evaluation of whiplash injuries in car accidents, and biomechanical analysis in professional sports. Our results demonstrate potential and limitations of various algorithms in estimating body shape, kinematics, and conducting in-field biomechani",
    "link": "http://arxiv.org/abs/2401.06174",
    "context": "Title: Machine Learning Applications in Spine Biomechanics. (arXiv:2401.06174v1 [eess.IV])\nAbstract: Spine biomechanics is at a transformation with the advent and integration of machine learning and computer vision technologies. These novel techniques facilitate the estimation of 3D body shapes, anthropometrics, and kinematics from as simple as a single-camera image, making them more accessible and practical for a diverse range of applications. This study introduces a framework that merges these methodologies with traditional musculoskeletal modeling, enabling comprehensive analysis of spinal biomechanics during complex activities from a single camera. Additionally, we aim to evaluate their performance and limitations in spine biomechanics applications. The real-world applications explored in this study include assessment in workplace lifting, evaluation of whiplash injuries in car accidents, and biomechanical analysis in professional sports. Our results demonstrate potential and limitations of various algorithms in estimating body shape, kinematics, and conducting in-field biomechani",
    "path": "papers/24/01/2401.06174.json",
    "total_tokens": 963,
    "translated_title": "脊柱生物力学中的机器学习应用",
    "translated_abstract": "脊柱生物力学正在随着机器学习和计算机视觉技术的出现和整合而发生变革。这些新颖的技术可以从一个简单的单摄像头图像中估计3D身体形状、人体测量和运动学，使得它们更具可访问性和实用性，适用于各种应用。本研究介绍了一个框架，将这些方法与传统的肌肉骨骼建模相结合，从单个摄像头进行脊柱生物力学的综合分析。此外，我们旨在评估它们在脊柱生物力学应用中的性能和限制。本研究探索的真实世界应用包括工作场所提重物的评估、车祸中的翻颈伤评估和专业体育中的生物力学分析。我们的结果展示了各种算法在估计身体形状、运动学和进行现场生物力学分析方面的潜力和限制。",
    "tldr": "本研究介绍了脊柱生物力学中机器学习应用的框架，使得从单个摄像头图像中可以全面分析复杂活动中的脊柱生物力学。同时评估了其在不同应用中的性能和限制，包括工作场所提重物的评估、车祸中的翻颈伤评估和专业体育中的生物力学分析。",
    "en_tdlr": "This study introduces a framework for machine learning applications in spine biomechanics, enabling comprehensive analysis of spinal biomechanics during complex activities from a single camera. The performance and limitations of these applications, including workplace lifting assessment, evaluation of whiplash injuries in car accidents, and biomechanical analysis in professional sports, are evaluated."
}