{
    "title": "Diffusion Representation for Asymmetric Kernels. (arXiv:2401.12251v1 [cs.LG])",
    "abstract": "We extend the diffusion-map formalism to data sets that are induced by asymmetric kernels. Analytical convergence results of the resulting expansion are proved, and an algorithm is proposed to perform the dimensional reduction. In this work we study data sets in which its geometry structure is induced by an asymmetric kernel. We use a priori coordinate system to represent this geometry and, thus, be able to improve the computational complexity of reducing the dimensionality of data sets. A coordinate system connected to the tensor product of Fourier basis is used to represent the underlying geometric structure obtained by the diffusion-map, thus reducing the dimensionality of the data set and making use of the speedup provided by the two-dimensional Fast Fourier Transform algorithm (2-D FFT). We compare our results with those obtained by other eigenvalue expansions, and verify the efficiency of the algorithms with synthetic data, as well as with real data from applications including cl",
    "link": "http://arxiv.org/abs/2401.12251",
    "context": "Title: Diffusion Representation for Asymmetric Kernels. (arXiv:2401.12251v1 [cs.LG])\nAbstract: We extend the diffusion-map formalism to data sets that are induced by asymmetric kernels. Analytical convergence results of the resulting expansion are proved, and an algorithm is proposed to perform the dimensional reduction. In this work we study data sets in which its geometry structure is induced by an asymmetric kernel. We use a priori coordinate system to represent this geometry and, thus, be able to improve the computational complexity of reducing the dimensionality of data sets. A coordinate system connected to the tensor product of Fourier basis is used to represent the underlying geometric structure obtained by the diffusion-map, thus reducing the dimensionality of the data set and making use of the speedup provided by the two-dimensional Fast Fourier Transform algorithm (2-D FFT). We compare our results with those obtained by other eigenvalue expansions, and verify the efficiency of the algorithms with synthetic data, as well as with real data from applications including cl",
    "path": "papers/24/01/2401.12251.json",
    "total_tokens": 821,
    "translated_title": "非对称核的扩散表示",
    "translated_abstract": "我们将扩散映射形式扩展到由非对称核引导的数据集。证明了结果展开的分析收敛性，并提出了一种执行维数减少的算法。本文研究的数据集的几何结构是由非对称核引导的。我们使用先验坐标系来表示这个几何结构，从而能够提高数据集减少维数的计算复杂度。采用与Fourier基的张量积相关联的坐标系来表示扩散映射得到的底层几何结构，从而减少数据集的维数，并利用二维快速Fourier变换算法（2-D FFT）提供的加速。我们将我们的结果与其他特征值展开得到的结果进行比较，并通过合成数据和包括聚类等实际应用的真实数据验证了算法的效率。",
    "tldr": "本文扩展了扩散映射形式，用于处理由非对称核引导的数据集。通过使用先验坐标系和基于Fourier基的坐标系，可以减少数据集的维数，并提高计算效率。",
    "en_tdlr": "This paper extends the diffusion-map formalism to handle data sets induced by asymmetric kernels. By utilizing a priori coordinate system and a coordinate system based on Fourier basis, it reduces the dimensionality of the data set and improves computational efficiency."
}