{
    "title": "Developing an AI-based Integrated System for Bee Health Evaluation. (arXiv:2401.09988v1 [cs.LG])",
    "abstract": "Honey bees pollinate about one-third of the world's food supply, but bee colonies have alarmingly declined by nearly 40% over the past decade due to several factors, including pesticides and pests. Traditional methods for monitoring beehives, such as human inspection, are subjective, disruptive, and time-consuming. To overcome these limitations, artificial intelligence has been used to assess beehive health. However, previous studies have lacked an end-to-end solution and primarily relied on data from a single source, either bee images or sounds. This study introduces a comprehensive system consisting of bee object detection and health evaluation. Additionally, it utilized a combination of visual and audio signals to analyze bee behaviors. An Attention-based Multimodal Neural Network (AMNN) was developed to adaptively focus on key features from each type of signal for accurate bee health assessment. The AMNN achieved an overall accuracy of 92.61%, surpassing eight existing single-signa",
    "link": "http://arxiv.org/abs/2401.09988",
    "context": "Title: Developing an AI-based Integrated System for Bee Health Evaluation. (arXiv:2401.09988v1 [cs.LG])\nAbstract: Honey bees pollinate about one-third of the world's food supply, but bee colonies have alarmingly declined by nearly 40% over the past decade due to several factors, including pesticides and pests. Traditional methods for monitoring beehives, such as human inspection, are subjective, disruptive, and time-consuming. To overcome these limitations, artificial intelligence has been used to assess beehive health. However, previous studies have lacked an end-to-end solution and primarily relied on data from a single source, either bee images or sounds. This study introduces a comprehensive system consisting of bee object detection and health evaluation. Additionally, it utilized a combination of visual and audio signals to analyze bee behaviors. An Attention-based Multimodal Neural Network (AMNN) was developed to adaptively focus on key features from each type of signal for accurate bee health assessment. The AMNN achieved an overall accuracy of 92.61%, surpassing eight existing single-signa",
    "path": "papers/24/01/2401.09988.json",
    "total_tokens": 968,
    "translated_title": "发展基于人工智能的综合系统用于蜜蜂健康评估",
    "translated_abstract": "蜜蜂是全球约三分之一食物供应的传粉者，但是由于多种因素导致蜜蜂群体在过去十年中惊人地下降了近40%，包括杀虫剂和害虫等。传统的蜜蜂箱监测方法，如人工检查，主观性强，干扰性高，耗时长。为了克服这些限制，人工智能被用于评估蜜蜂箱的健康状况。然而，以往的研究缺乏一个端到端的解决方案，主要依赖于单一数据来源，如蜜蜂图像或声音。本研究引入了一个全面的系统，包括蜜蜂目标检测和健康评估。此外，该系统利用了视觉和音频信号的组合来分析蜜蜂行为。开发了一种基于注意力机制的多模态神经网络（AMNN），能够自适应地从每种信号类型中聚焦于关键特征，以进行准确的蜜蜂健康评估。AMNN实现了92.61%的整体准确率，超过了八种现有单一信号的方法。",
    "tldr": "本研究发展了一个基于人工智能的综合系统，利用视觉和音频信号来评估蜜蜂箱的健康状况，通过注意力机制的多模态神经网络实现了准确的评估。"
}