{
    "title": "Towards Net-Zero Carbon Emissions in Network AI for 6G and Beyond. (arXiv:2401.01007v1 [cs.NI])",
    "abstract": "A global effort has been initiated to reduce the worldwide greenhouse gas (GHG) emissions, primarily carbon emissions, by half by 2030 and reach net-zero by 2050. The development of 6G must also be compliant with this goal. Unfortunately, developing a sustainable and net-zero emission systems to meet the users' fast growing demands on mobile services, especially smart services and applications, may be much more challenging than expected. Particularly, despite the energy efficiency improvement in both hardware and software designs, the overall energy consumption and carbon emission of mobile networks are still increasing at a tremendous speed. The growing penetration of resource-demanding AI algorithms and solutions further exacerbate this challenge. In this article, we identify the major emission sources and introduce an evaluation framework for analyzing the lifecycle of network AI implementations. A novel joint dynamic energy trading and task allocation optimization framework, called",
    "link": "http://arxiv.org/abs/2401.01007",
    "context": "Title: Towards Net-Zero Carbon Emissions in Network AI for 6G and Beyond. (arXiv:2401.01007v1 [cs.NI])\nAbstract: A global effort has been initiated to reduce the worldwide greenhouse gas (GHG) emissions, primarily carbon emissions, by half by 2030 and reach net-zero by 2050. The development of 6G must also be compliant with this goal. Unfortunately, developing a sustainable and net-zero emission systems to meet the users' fast growing demands on mobile services, especially smart services and applications, may be much more challenging than expected. Particularly, despite the energy efficiency improvement in both hardware and software designs, the overall energy consumption and carbon emission of mobile networks are still increasing at a tremendous speed. The growing penetration of resource-demanding AI algorithms and solutions further exacerbate this challenge. In this article, we identify the major emission sources and introduce an evaluation framework for analyzing the lifecycle of network AI implementations. A novel joint dynamic energy trading and task allocation optimization framework, called",
    "path": "papers/24/01/2401.01007.json",
    "total_tokens": 826,
    "translated_title": "朝着实现6G及以后网络AI零排放碳目标迈进",
    "translated_abstract": "全球正在努力减少全球温室气体排放（主要是碳排放）到2030年减半，并在2050年实现零排放。发展6G技术也必须符合这一目标。然而，开发可持续且零排放系统以满足用户对移动服务（特别是智能服务和应用）不断增长的需求，可能比预期的要具有更大的挑战性。尤其是尽管硬件和软件设计的能效改进，移动网络的能源消耗和碳排放仍在以惊人的速度增长。资源需求严重的AI算法和解决方案的不断普及进一步加剧了这一挑战。在本文中，我们确定了主要的排放源，并介绍了一个用于分析网络AI实现生命周期的评估框架。提出了一种新颖的联合动态能源交易和任务分配优化框架",
    "tldr": "本论文旨在实现6G及以后网络AI的零排放碳目标。通过确定排放源并引入评估框架，提出了一种联合动态能源交易和任务分配优化框架，以解决移动网络能源消耗和碳排放的问题。"
}