{
    "title": "Harmonizing Covariance and Expressiveness for Deep Hamiltonian Regression in Crystalline Material Research: a Hybrid Cascaded Regression Framework. (arXiv:2401.00744v2 [physics.comp-ph] UPDATED)",
    "abstract": "Deep learning for Hamiltonian regression of quantum systems in material research necessitates satisfying the covariance laws, among which achieving SO(3)-equivariance without sacrificing the expressiveness of networks remains an elusive challenge due to the restriction to non-linear mappings on guaranteeing theoretical equivariance. To alleviate the covariance-expressiveness dilemma, we propose a hybrid framework with two cascaded regression stages. The first stage, with a theoretically-guaranteed covariant neural network modeling symmetry properties of 3D atom systems, yields theoretically covariant features and baseline Hamiltonian predictions, assisting the second stage in learning covariance. Meanwhile, the second stage, powered by a non-linear 3D graph Transformer network we propose for structural modeling of 3D atomic systems, refines the first stage's output as a fine-grained prediction of Hamiltonians with better expressiveness capability. The combination of a theoretically cov",
    "link": "http://arxiv.org/abs/2401.00744",
    "context": "Title: Harmonizing Covariance and Expressiveness for Deep Hamiltonian Regression in Crystalline Material Research: a Hybrid Cascaded Regression Framework. (arXiv:2401.00744v2 [physics.comp-ph] UPDATED)\nAbstract: Deep learning for Hamiltonian regression of quantum systems in material research necessitates satisfying the covariance laws, among which achieving SO(3)-equivariance without sacrificing the expressiveness of networks remains an elusive challenge due to the restriction to non-linear mappings on guaranteeing theoretical equivariance. To alleviate the covariance-expressiveness dilemma, we propose a hybrid framework with two cascaded regression stages. The first stage, with a theoretically-guaranteed covariant neural network modeling symmetry properties of 3D atom systems, yields theoretically covariant features and baseline Hamiltonian predictions, assisting the second stage in learning covariance. Meanwhile, the second stage, powered by a non-linear 3D graph Transformer network we propose for structural modeling of 3D atomic systems, refines the first stage's output as a fine-grained prediction of Hamiltonians with better expressiveness capability. The combination of a theoretically cov",
    "path": "papers/24/01/2401.00744.json",
    "total_tokens": 1055,
    "translated_title": "在晶体材料研究中，将协方差和表达能力融合为深度哈密顿回归：一种混合级联回归框架",
    "translated_abstract": "在材料研究中，深度学习用于哈密顿回归量子系统需要满足协方差定律，其中实现SO(3)等变性而不损失网络的表达能力是一个难以解决的挑战，因为非线性映射的理论等变性保证受限。为了解决协方差-表达能力困境，我们提出了一种混合框架，分为两个级联回归阶段。第一阶段使用一个理论上保证的协变神经网络来建模三维原子系统的对称性，产生理论上的协变特征和基线哈密顿预测，帮助第二阶段学习协变性。同时，第二阶段使用我们提出的非线性三维图形Transformer网络来进行三维原子系统的结构建模，将第一阶段的输出精细化为具有更好表达能力的哈密顿预测。通过理论上的协变性和更好的表达能力，实现了对哈密顿回归的改进。",
    "tldr": "在深度哈密顿回归中，实现协方差和网络表达能力之间的平衡一直是一个挑战。本文提出了一个混合级联回归框架，在第一阶段通过协变神经网络建模并产生协变特征和基线预测，辅助第二阶段学习协方差。同时，第二阶段使用非线性图形Transformer网络进行结构建模，提高了哈密顿预测的表达能力。",
    "en_tdlr": "Balancing covariance and network expressiveness is a challenging task in deep Hamiltonian regression. This paper proposes a hybrid cascaded regression framework, where the first stage employs a covariant neural network to model and generate covariant features and baseline predictions, assisting the second stage in learning covariance. Additionally, the second stage utilizes a non-linear graph Transformer network for structural modeling, enhancing the expressiveness of Hamiltonian predictions."
}