{
    "title": "Education Policy and Intergenerational Educational Persistence: Evidence from rural Benin",
    "abstract": "This paper employs a nonlinear difference-in-differences approach to empirically examine the Maximally Maintained Inequality (MMI) hypothesis in rural Benin. The findings of this study confirm the MMI hypothesis. In particular, it is observed that when 76% of educated parents choose to educate their daughters in the absence of educational programs, in contrast to only 37% among non-educated parents, the average impact of tuition fee subsidy on enrollment probability in primary schools stands at 3.8\\% for non-educated households and 0.27% for educated households. Conversely, in cases where only 27% of educated parents decide to educate their daughters without education programs, the average effect of tuition fee waivers on enrollment probability in primary schools increases to 19.64\\% for non-educated households and 24\\% for educated households. From the analysis of household education decisions influenced by a preference for education and budget constraints, three key conclusions emerg",
    "link": "https://arxiv.org/abs/2401.17391",
    "context": "Title: Education Policy and Intergenerational Educational Persistence: Evidence from rural Benin\nAbstract: This paper employs a nonlinear difference-in-differences approach to empirically examine the Maximally Maintained Inequality (MMI) hypothesis in rural Benin. The findings of this study confirm the MMI hypothesis. In particular, it is observed that when 76% of educated parents choose to educate their daughters in the absence of educational programs, in contrast to only 37% among non-educated parents, the average impact of tuition fee subsidy on enrollment probability in primary schools stands at 3.8\\% for non-educated households and 0.27% for educated households. Conversely, in cases where only 27% of educated parents decide to educate their daughters without education programs, the average effect of tuition fee waivers on enrollment probability in primary schools increases to 19.64\\% for non-educated households and 24\\% for educated households. From the analysis of household education decisions influenced by a preference for education and budget constraints, three key conclusions emerg",
    "path": "papers/24/01/2401.17391.json",
    "total_tokens": 944,
    "translated_title": "教育政策与代际教育持续性：来自贝宁农村的证据",
    "translated_abstract": "本文采用非线性差分法实证检验了贝宁农村的最大保持不平等（MMI）假设。研究发现了MMI假设的确认。特别是，观察到当76%的受过教育的父母在没有教育计划的情况下选择对女儿进行教育时，与非受过教育的父母相比，学费补贴对小学入学概率的平均影响为非受过教育家庭为3.8%、受过教育家庭为0.27%。相反，在只有27%受过教育的父母决定在没有教育计划的情况下对女儿进行教育的情况下，学费减免对小学入学概率的平均影响增加到非受过教育家庭为19.64%、受过教育家庭为24%。通过分析受教育偏好和预算约束对家庭教育决策的影响，得出了三个关键结论。",
    "tldr": "通过对贝宁农村的研究发现，教育政策对代际教育持续性的影响得到了证实，尤其是教育补贴和减免学费对受过教育和非受过教育家庭的影响不同。"
}