{
    "title": "Fast Semi-supervised Unmixing using Non-convex Optimization. (arXiv:2401.12609v1 [cs.CV])",
    "abstract": "In this paper, we introduce a novel linear model tailored for semisupervised/library-based unmixing. Our model incorporates considerations for library mismatch while enabling the enforcement of the abundance sum-to-one constraint (ASC). Unlike conventional sparse unmixing methods, this model involves nonconvex optimization, presenting significant computational challenges. We demonstrate the efficacy of Alternating Methods of Multipliers (ADMM) in cyclically solving these intricate problems. We propose two semisupervised unmixing approaches, each relying on distinct priors applied to the new model in addition to the ASC: sparsity prior and convexity constraint. Our experimental results validate that enforcing the convexity constraint outperforms the sparsity prior for the endmember library. These results are corroborated across three simulated datasets (accounting for spectral variability and varying pixel purity levels) and the Cuprite dataset. Additionally, our comparison with convent",
    "link": "http://arxiv.org/abs/2401.12609",
    "context": "Title: Fast Semi-supervised Unmixing using Non-convex Optimization. (arXiv:2401.12609v1 [cs.CV])\nAbstract: In this paper, we introduce a novel linear model tailored for semisupervised/library-based unmixing. Our model incorporates considerations for library mismatch while enabling the enforcement of the abundance sum-to-one constraint (ASC). Unlike conventional sparse unmixing methods, this model involves nonconvex optimization, presenting significant computational challenges. We demonstrate the efficacy of Alternating Methods of Multipliers (ADMM) in cyclically solving these intricate problems. We propose two semisupervised unmixing approaches, each relying on distinct priors applied to the new model in addition to the ASC: sparsity prior and convexity constraint. Our experimental results validate that enforcing the convexity constraint outperforms the sparsity prior for the endmember library. These results are corroborated across three simulated datasets (accounting for spectral variability and varying pixel purity levels) and the Cuprite dataset. Additionally, our comparison with convent",
    "path": "papers/24/01/2401.12609.json",
    "total_tokens": 919,
    "translated_title": "快速半监督非凸优化解混合",
    "translated_abstract": "本文介绍了一种针对半监督/基于库的解混合设计的新型线性模型。我们的模型考虑了库不匹配，并能够实施丰度和等于一的约束。与传统的稀疏解混合方法不同，该模型涉及到非凸优化，具有重要的计算挑战。我们展示了交替乘法器方法（ADMM）在循环求解这些复杂问题中的效果。我们提出了两种半监督解混合方法，每种方法都依赖于应用于新模型的不同先验以及丰度和等于一的约束：稀疏先验和凸性约束。我们的实验证明，实施凸性约束优于稀疏先验对于端元库的表现。这些结果在三个模拟数据集（考虑了光谱变化和不同像素纯度水平）和Cuprite数据集上得到了证实。此外，我们与传统方法进行了比较。",
    "tldr": "本文介绍了一种用于解混合的快速半监督非凸优化模型，该模型考虑了库不匹配和丰度约束，并提出了两种基于先验的半监督解混合方法。实验证明，实施凸性约束优于稀疏先验对于端元库的表现。"
}