{
    "title": "Music Auto-Tagging with Robust Music Representation Learned via Domain Adversarial Training. (arXiv:2401.15323v1 [cs.SD])",
    "abstract": "Music auto-tagging is crucial for enhancing music discovery and recommendation. Existing models in Music Information Retrieval (MIR) struggle with real-world noise such as environmental and speech sounds in multimedia content. This study proposes a method inspired by speech-related tasks to enhance music auto-tagging performance in noisy settings. The approach integrates Domain Adversarial Training (DAT) into the music domain, enabling robust music representations that withstand noise. Unlike previous research, this approach involves an additional pretraining phase for the domain classifier, to avoid performance degradation in the subsequent phase. Adding various synthesized noisy music data improves the model's generalization across different noise levels. The proposed architecture demonstrates enhanced performance in music auto-tagging by effectively utilizing unlabeled noisy music data. Additional experiments with supplementary unlabeled data further improves the model's performance",
    "link": "http://arxiv.org/abs/2401.15323",
    "context": "Title: Music Auto-Tagging with Robust Music Representation Learned via Domain Adversarial Training. (arXiv:2401.15323v1 [cs.SD])\nAbstract: Music auto-tagging is crucial for enhancing music discovery and recommendation. Existing models in Music Information Retrieval (MIR) struggle with real-world noise such as environmental and speech sounds in multimedia content. This study proposes a method inspired by speech-related tasks to enhance music auto-tagging performance in noisy settings. The approach integrates Domain Adversarial Training (DAT) into the music domain, enabling robust music representations that withstand noise. Unlike previous research, this approach involves an additional pretraining phase for the domain classifier, to avoid performance degradation in the subsequent phase. Adding various synthesized noisy music data improves the model's generalization across different noise levels. The proposed architecture demonstrates enhanced performance in music auto-tagging by effectively utilizing unlabeled noisy music data. Additional experiments with supplementary unlabeled data further improves the model's performance",
    "path": "papers/24/01/2401.15323.json",
    "total_tokens": 977,
    "translated_title": "音乐自动标记：通过领域对抗训练学习鲁棒的音乐表示",
    "translated_abstract": "音乐自动标记对于增强音乐发现和推荐至关重要。现有的音乐信息检索(MIR)模型在多媒体内容中存在的环境噪声和语音声音等现实世界噪声方面面临困难。本研究提出了一种受语音相关任务启发的方法，以增强嘈杂环境中的音乐自动标记性能。该方法将领域对抗训练(DAT)集成到音乐领域中，使得鲁棒的音乐表示能够抵抗噪声。与以前的研究不同，该方法还涉及领域分类器的额外预训练阶段，以避免后续阶段性能的下降。添加各种合成的嘈杂音乐数据改善了该模型在不同噪声水平下的泛化能力。所提出的架构通过有效利用无标签的嘈杂音乐数据，在音乐自动标记方面展现了增强的性能。在补充无标签数据的额外实验进一步提高了模型的性能。",
    "tldr": "该研究通过领域对抗训练(DAT)方法提出了一种改善嘈杂环境中音乐自动标记性能的方法。该方法通过额外的预训练阶段和添加合成的嘈杂音乐数据，获得了鲁棒的音乐表示，并在音乐自动标记方面展现了增强的性能。",
    "en_tdlr": "This study proposes a method to enhance music auto-tagging performance in noisy settings using Domain Adversarial Training (DAT). The method involves an additional pretraining phase and adding synthesized noisy music data to obtain robust music representations, resulting in enhanced performance in music auto-tagging."
}