{
    "title": "Analysis and Validation of Image Search Engines in Histopathology. (arXiv:2401.03271v1 [eess.IV])",
    "abstract": "Searching for similar images in archives of histology and histopathology images is a crucial task that may aid in patient matching for various purposes, ranging from triaging and diagnosis to prognosis and prediction. Whole slide images (WSIs) are highly detailed digital representations of tissue specimens mounted on glass slides. Matching WSI to WSI can serve as the critical method for patient matching. In this paper, we report extensive analysis and validation of four search methods bag of visual words (BoVW), Yottixel, SISH, RetCCL, and some of their potential variants. We analyze their algorithms and structures and assess their performance. For this evaluation, we utilized four internal datasets ($1269$ patients) and three public datasets ($1207$ patients), totaling more than $200,000$ patches from $38$ different classes/subtypes across five primary sites. Certain search engines, for example, BoVW, exhibit notable efficiency and speed but suffer from low accuracy. Conversely, searc",
    "link": "http://arxiv.org/abs/2401.03271",
    "context": "Title: Analysis and Validation of Image Search Engines in Histopathology. (arXiv:2401.03271v1 [eess.IV])\nAbstract: Searching for similar images in archives of histology and histopathology images is a crucial task that may aid in patient matching for various purposes, ranging from triaging and diagnosis to prognosis and prediction. Whole slide images (WSIs) are highly detailed digital representations of tissue specimens mounted on glass slides. Matching WSI to WSI can serve as the critical method for patient matching. In this paper, we report extensive analysis and validation of four search methods bag of visual words (BoVW), Yottixel, SISH, RetCCL, and some of their potential variants. We analyze their algorithms and structures and assess their performance. For this evaluation, we utilized four internal datasets ($1269$ patients) and three public datasets ($1207$ patients), totaling more than $200,000$ patches from $38$ different classes/subtypes across five primary sites. Certain search engines, for example, BoVW, exhibit notable efficiency and speed but suffer from low accuracy. Conversely, searc",
    "path": "papers/24/01/2401.03271.json",
    "total_tokens": 955,
    "translated_title": "组织病理学图像搜索引擎的分析与验证",
    "translated_abstract": "在组织学和病理学图像档案中搜索相似图像是一项关键任务，可以在各种目的中帮助患者匹配，从分类和诊断到预后和预测。全玻片图像是组织标本的高度详细数字表示，匹配全玻片图像可以作为患者匹配的关键方法。本文对四种搜索方法，视觉词袋（BoVW）、Yottixel、SISH、RetCCL及其一些潜在变种进行了广泛的分析和验证。我们分析了它们的算法和结构，并评估了它们的性能。为了进行评估，我们使用了四个内部数据集（1269位患者）和三个公共数据集（1207位患者），总计超过200,000个属于五个主要部位的38个不同类别/亚型的图像块。某些搜索引擎，例如BoVW，表现出显着的效率和速度，但精度较低。相反，其他搜索引擎例如SISH表现出较高的准确率，但运行效率较低。",
    "tldr": "本文对组织病理学图像搜索引擎进行了分析和验证，对其性能进行了评估。研究发现，某些搜索引擎在效率和速度上表现出色，但精度较低，而其他搜索引擎的准确率较高，但运行效率较低。",
    "en_tdlr": "This paper analyzes and validates image search engines in histopathology, evaluating their performance. It found that certain engines perform well in efficiency and speed but have low accuracy, while others have high accuracy but low efficiency."
}