{
    "title": "Moen Meets Rotemberg: An Earthly Model of the Divine Coincidence. (arXiv:2401.12475v1 [econ.TH])",
    "abstract": "This paper proposes a model of the divine coincidence, explaining its recent appearance in US data. The divine coincidence matters because it helps explain the behavior of inflation after the pandemic, and it guarantees that the full-employment and price-stability mandates of the Federal Reserve coincide. In the model, a Phillips curve relating unemployment to inflation arises from Moen's (1997) directed search. The Phillips curve is nonvertical thanks to Rotemberg's (1982) price-adjustment costs. The model's Phillips curve guarantees that the rate of inflation is on target whenever the rate of unemployment is efficient, generating the divine coincidence. If we assume that wage decreases -- which reduce workers' morale -- are more costly to producers than price increases -- which upset customers -- the Phillips curve also displays a kink at the point of divine coincidence.",
    "link": "http://arxiv.org/abs/2401.12475",
    "context": "Title: Moen Meets Rotemberg: An Earthly Model of the Divine Coincidence. (arXiv:2401.12475v1 [econ.TH])\nAbstract: This paper proposes a model of the divine coincidence, explaining its recent appearance in US data. The divine coincidence matters because it helps explain the behavior of inflation after the pandemic, and it guarantees that the full-employment and price-stability mandates of the Federal Reserve coincide. In the model, a Phillips curve relating unemployment to inflation arises from Moen's (1997) directed search. The Phillips curve is nonvertical thanks to Rotemberg's (1982) price-adjustment costs. The model's Phillips curve guarantees that the rate of inflation is on target whenever the rate of unemployment is efficient, generating the divine coincidence. If we assume that wage decreases -- which reduce workers' morale -- are more costly to producers than price increases -- which upset customers -- the Phillips curve also displays a kink at the point of divine coincidence.",
    "path": "papers/24/01/2401.12475.json",
    "total_tokens": 919,
    "translated_title": "Moen遇到Rotemberg: 一个关于神圣巧合的实际模型",
    "translated_abstract": "本文提出了一个关于神圣巧合的模型，解释了其在美国数据中的最近出现。神圣巧合的重要性在于，它有助于解释疫情后通胀的行为，并保证了美联储的充分就业和价格稳定任务的一致性。在该模型中，失业与通胀之间的菲利普斯曲线源自Moen（1997）的有向搜索。由于Rotemberg（1982）的价格调整成本，该菲利普斯曲线是非垂直的。该模型的菲利普斯曲线保证了在失业率有效时通胀率保持在目标水平上，从而产生了神圣巧合。如果我们假设工资的降低（降低了员工的士气）对生产者来说比价格的上涨（使顾客不满意）更加成本高昂，那么菲利普斯曲线在神圣巧合点也会显示出一个拐点。",
    "tldr": "本文提出了一个关于神圣巧合的模型，解释了其在美国数据中的最近出现。该模型通过Moen的有向搜索和Rotemberg的价格调整成本，建立了失业与通胀之间的菲利普斯曲线，并保证了充分就业和价格稳定任务的一致性。",
    "en_tdlr": "This paper proposes a model of the divine coincidence, explaining its recent appearance in US data. The model establishes a Phillips curve relating unemployment to inflation through Moen's directed search and Rotemberg's price-adjustment costs, guaranteeing the alignment of full-employment and price-stability mandates."
}