{
    "title": "From Requirements to Architecture: An AI-Based Journey to Semi-Automatically Generate Software Architectures. (arXiv:2401.14079v1 [cs.SE])",
    "abstract": "Designing domain models and software architectures represents a significant challenge in software development, as the resulting architectures play a vital role in fulfilling the system's quality of service. Due to time pressure, architects often model only one architecture based on their known limited domain understanding, patterns, and experience instead of thoroughly analyzing the domain and evaluating multiple candidates, selecting the best fitting. Existing approaches try to generate domain models based on requirements, but still require time-consuming manual effort to achieve good results. Therefore, in this vision paper, we propose a method to generate software architecture candidates semi-automatically based on requirements using artificial intelligence techniques. We further envision an automatic evaluation and trade-off analysis of the generated architecture candidates using, e.g., the architecture trade-off analysis method combined with large language models and quantitative ",
    "link": "http://arxiv.org/abs/2401.14079",
    "context": "Title: From Requirements to Architecture: An AI-Based Journey to Semi-Automatically Generate Software Architectures. (arXiv:2401.14079v1 [cs.SE])\nAbstract: Designing domain models and software architectures represents a significant challenge in software development, as the resulting architectures play a vital role in fulfilling the system's quality of service. Due to time pressure, architects often model only one architecture based on their known limited domain understanding, patterns, and experience instead of thoroughly analyzing the domain and evaluating multiple candidates, selecting the best fitting. Existing approaches try to generate domain models based on requirements, but still require time-consuming manual effort to achieve good results. Therefore, in this vision paper, we propose a method to generate software architecture candidates semi-automatically based on requirements using artificial intelligence techniques. We further envision an automatic evaluation and trade-off analysis of the generated architecture candidates using, e.g., the architecture trade-off analysis method combined with large language models and quantitative ",
    "path": "papers/24/01/2401.14079.json",
    "total_tokens": 855,
    "translated_title": "从需求到架构：基于人工智能的半自动生成软件架构的旅程",
    "translated_abstract": "在软件开发中，设计领域模型和软件架构是一个重要的挑战，因为得到的架构对系统的服务质量起着关键作用。由于时间压力，架构师通常只基于自己对领域的有限了解、模式和经验来建模一个架构，而不是对领域进行彻底分析和评估多个候选方案，选择最合适的方案。现有方法尝试根据需求来生成领域模型，但仍需要耗费大量时间手动努力才能获得良好的结果。因此，在这篇展望性论文中，我们提出了一种基于人工智能技术，半自动地根据需求生成软件架构候选方案的方法。我们进一步设想使用架构权衡分析方法与大型语言模型和定量方法自动评估和进行交叉分析生成的架构候选方案。",
    "tldr": "本文提出了一种基于人工智能技术的半自动软件架构生成方法，可以根据需求生成架构候选方案，并使用大型语言模型和定量方法进行自动评估和交叉分析。",
    "en_tdlr": "This paper proposes a semi-automatic method for generating software architecture candidates based on requirements using artificial intelligence techniques. It further envisions the automatic evaluation and trade-off analysis of the generated architecture candidates using large language models and quantitative methods."
}