{
    "title": "Cash and Card Acceptance in Retail Payments: Motivations and Factors. (arXiv:2401.07682v1 [cs.CY])",
    "abstract": "The landscape of payment methods in retail is a complex and evolving area. Vendors are motivated to conduct an appropriate analysis to decide what payment methods to accept out of a vast range of options. Many factors are included in this decision process, some qualitative and some quantitative. The following research project investigates vendors' acceptance of cards and cash from various viewpoints, all chosen to represent a novel perspective, including the barriers and preferences for each and correlations with external demographic factors. We observe that lower interchange fees, limited in this instance by the regulatory framework, play a crucial role in facilitating merchants' acceptance of card payments. The regulatory constraints on interchange fees create a favorable cost structure for merchants, making card payment adoption financially feasible. However, additional factors like technological readiness and consumer preferences might also play a significant role in their decision",
    "link": "http://arxiv.org/abs/2401.07682",
    "context": "Title: Cash and Card Acceptance in Retail Payments: Motivations and Factors. (arXiv:2401.07682v1 [cs.CY])\nAbstract: The landscape of payment methods in retail is a complex and evolving area. Vendors are motivated to conduct an appropriate analysis to decide what payment methods to accept out of a vast range of options. Many factors are included in this decision process, some qualitative and some quantitative. The following research project investigates vendors' acceptance of cards and cash from various viewpoints, all chosen to represent a novel perspective, including the barriers and preferences for each and correlations with external demographic factors. We observe that lower interchange fees, limited in this instance by the regulatory framework, play a crucial role in facilitating merchants' acceptance of card payments. The regulatory constraints on interchange fees create a favorable cost structure for merchants, making card payment adoption financially feasible. However, additional factors like technological readiness and consumer preferences might also play a significant role in their decision",
    "path": "papers/24/01/2401.07682.json",
    "total_tokens": 901,
    "translated_title": "零售支付中的现金和卡片接受：动机和因素",
    "translated_abstract": "零售支付方法的景观是一个复杂而不断发展的领域。供应商被激励进行适当的分析，以决定接受哪种支付方式，从众多的选择中选择。在这个决策过程中，包括一些定性因素和定量因素。这个研究项目从不同的视角调查了供应商对卡片和现金的接受情况，选择了一些独特的观点进行代表，包括每一种支付方式的障碍和偏好，并与外部人口因素相关联。我们观察到，低的互换费用在推动商家接受卡片支付方面起着至关重要的作用，这在监管框架下受到限制。互换费用的监管限制为商家创造了有利的成本结构，使得卡片支付的采用在财务上可行。然而，像技术准备和消费者偏好这样的其他因素也可能在他们的决策中起到重要的作用。",
    "tldr": "该研究探讨了零售支付中卡片和现金的接受情况，并发现低的互换费用和监管限制对商家接受卡片支付起到了重要作用，同时技术准备和消费者偏好也在决策中发挥了重要作用。"
}