{
    "title": "Wages and Capital returns in a generalized P\\'olya urn",
    "abstract": "It is a widely observed phenomenon that wealth is distributed significantly more unequal than wages. In this paper we study this phenomenon using a new extension of P\\'olyas urn, modelling wealth growth through wages and capital returns. We focus in particular on the role of increasing return rates on capital, which have been identified as a main driver of inequality, and labor share, the second main parameter of our model. We fit the parameters from real-world data in Germany, so that simulation results reproduce the empirical wealth distribution and recent dynamics in Germany quite accurately, and are essentially independent from initial conditions. Our model is simple enough to allow for a detailed mathematical analysis and provides interesting predictions for future developments and on the importance of wages and capital returns for wealth aggregation. We also provide an extensive discussion of the robustness of our results and the plausibility of the main assumptions used in our m",
    "link": "https://arxiv.org/abs/2401.17688",
    "context": "Title: Wages and Capital returns in a generalized P\\'olya urn\nAbstract: It is a widely observed phenomenon that wealth is distributed significantly more unequal than wages. In this paper we study this phenomenon using a new extension of P\\'olyas urn, modelling wealth growth through wages and capital returns. We focus in particular on the role of increasing return rates on capital, which have been identified as a main driver of inequality, and labor share, the second main parameter of our model. We fit the parameters from real-world data in Germany, so that simulation results reproduce the empirical wealth distribution and recent dynamics in Germany quite accurately, and are essentially independent from initial conditions. Our model is simple enough to allow for a detailed mathematical analysis and provides interesting predictions for future developments and on the importance of wages and capital returns for wealth aggregation. We also provide an extensive discussion of the robustness of our results and the plausibility of the main assumptions used in our m",
    "path": "papers/24/01/2401.17688.json",
    "total_tokens": 905,
    "translated_title": "薪资和资本回报在广义泊利亚瓮中的研究",
    "translated_abstract": "众所周知，财富的分配比工资更加不平等。本文使用一种新的广义泊利亚瓮扩展模型来研究这一现象，该模型通过薪资和资本回报来建模财富增长。我们特别关注资本回报率的增长对不平等的影响，这被认为是不平等的主要驱动因素，以及劳动份额，我们模型的第二个主要参数。我们通过德国的真实数据来拟合参数，使得模拟结果能够相当准确地重现德国的经验财富分布和最近的动态，并且与初始条件基本独立。我们的模型足够简单，可以进行详细的数学分析，并对未来发展以及薪资和资本回报对财富积累的重要性提供有趣的预测。我们还对我们的结果的健壮性和我们模型中使用的主要假设的合理性进行了广泛讨论。",
    "tldr": "本文使用广义泊利亚瓮模型研究财富不平等现象，通过薪资和资本回报建模财富增长，发现资本回报率的增长是不平等的主要驱动因素之一，并提供对财富积累重要性的有趣预测。",
    "en_tdlr": "This paper studies the phenomenon of wealth inequality using a generalized Pólya urn model, where wealth growth is modeled through wages and capital returns. The study finds that increasing return rates on capital play a significant role in driving inequality, and provides interesting predictions on the importance of wages and capital returns for wealth aggregation."
}