{
    "title": "Physics-Informed Calibration of Aeromagnetic Compensation in Magnetic Navigation Systems using Liquid Time-Constant Networks. (arXiv:2401.09631v1 [cs.LG])",
    "abstract": "Magnetic navigation (MagNav) is a rising alternative to the Global Positioning System (GPS) and has proven useful for aircraft navigation. Traditional aircraft navigation systems, while effective, face limitations in precision and reliability in certain environments and against attacks. Airborne MagNav leverages the Earth's magnetic field to provide accurate positional information. However, external magnetic fields induced by aircraft electronics and Earth's large-scale magnetic fields disrupt the weaker signal of interest. We introduce a physics-informed approach using Tolles-Lawson coefficients for compensation and Liquid Time-Constant Networks (LTCs) to remove complex, noisy signals derived from the aircraft's magnetic sources. Using real flight data with magnetometer measurements and aircraft measurements, we observe up to a 64% reduction in aeromagnetic compensation error (RMSE nT), outperforming conventional models. This significant improvement underscores the potential of a phys",
    "link": "http://arxiv.org/abs/2401.09631",
    "context": "Title: Physics-Informed Calibration of Aeromagnetic Compensation in Magnetic Navigation Systems using Liquid Time-Constant Networks. (arXiv:2401.09631v1 [cs.LG])\nAbstract: Magnetic navigation (MagNav) is a rising alternative to the Global Positioning System (GPS) and has proven useful for aircraft navigation. Traditional aircraft navigation systems, while effective, face limitations in precision and reliability in certain environments and against attacks. Airborne MagNav leverages the Earth's magnetic field to provide accurate positional information. However, external magnetic fields induced by aircraft electronics and Earth's large-scale magnetic fields disrupt the weaker signal of interest. We introduce a physics-informed approach using Tolles-Lawson coefficients for compensation and Liquid Time-Constant Networks (LTCs) to remove complex, noisy signals derived from the aircraft's magnetic sources. Using real flight data with magnetometer measurements and aircraft measurements, we observe up to a 64% reduction in aeromagnetic compensation error (RMSE nT), outperforming conventional models. This significant improvement underscores the potential of a phys",
    "path": "papers/24/01/2401.09631.json",
    "total_tokens": 1007,
    "translated_title": "使用液体时间常数网络对磁导航系统中的气磁补偿进行物理信息校准",
    "translated_abstract": "磁导航（MagNav）是全球定位系统（GPS）的一种新兴替代方案，已被证明在飞行器导航中非常有用。传统的飞行器导航系统在某些环境和受到攻击时存在精度和可靠性方面的限制。空中磁导航利用地球的磁场提供准确的位置信息。然而，飞行器电子设备引起的外部磁场和地球的大规模磁场会干扰到较弱的感兴趣信号。我们引入了一种基于物理信息的方法，使用Tolles-Lawson系数进行补偿，并使用液体时间常数网络（LTCs）去除飞行器磁源产生的复杂而嘈杂的信号。使用实际飞行数据和磁力计测量以及飞行器测量，我们观察到气磁补偿误差（RMSE nT）最多可以减少64％，优于传统模型。这一显著改进突出了物理信息校准在磁导航中的潜力。",
    "tldr": "本研究提出了一种基于物理信息的方法，在磁导航系统中使用Tolles-Lawson系数和液体时间常数网络（LTCs）进行气磁补偿校准。实验结果显示，在实际飞行数据中，我们观察到了高达64％的气磁补偿误差减少，优于传统模型。",
    "en_tdlr": "This study introduces a physics-informed approach using Tolles-Lawson coefficients and Liquid Time-Constant Networks (LTCs) for aeromagnetic compensation calibration in magnetic navigation systems. The experimental results demonstrate a significant reduction in aeromagnetic compensation error (RMSE nT), outperforming conventional models, highlighting the potential of physics-informed calibration in magnetic navigation."
}