{
    "title": "Deep Reinforcement Learning Empowered Activity-Aware Dynamic Health Monitoring Systems. (arXiv:2401.10794v1 [cs.LG])",
    "abstract": "In smart healthcare, health monitoring utilizes diverse tools and technologies to analyze patients' real-time biosignal data, enabling immediate actions and interventions. Existing monitoring approaches were designed on the premise that medical devices track several health metrics concurrently, tailored to their designated functional scope. This means that they report all relevant health values within that scope, which can result in excess resource use and the gathering of extraneous data due to monitoring irrelevant health metrics. In this context, we propose Dynamic Activity-Aware Health Monitoring strategy (DActAHM) for striking a balance between optimal monitoring performance and cost efficiency, a novel framework based on Deep Reinforcement Learning (DRL) and SlowFast Model to ensure precise monitoring based on users' activities. Specifically, with the SlowFast Model, DActAHM efficiently identifies individual activities and captures these results for enhanced processing. Subsequen",
    "link": "http://arxiv.org/abs/2401.10794",
    "context": "Title: Deep Reinforcement Learning Empowered Activity-Aware Dynamic Health Monitoring Systems. (arXiv:2401.10794v1 [cs.LG])\nAbstract: In smart healthcare, health monitoring utilizes diverse tools and technologies to analyze patients' real-time biosignal data, enabling immediate actions and interventions. Existing monitoring approaches were designed on the premise that medical devices track several health metrics concurrently, tailored to their designated functional scope. This means that they report all relevant health values within that scope, which can result in excess resource use and the gathering of extraneous data due to monitoring irrelevant health metrics. In this context, we propose Dynamic Activity-Aware Health Monitoring strategy (DActAHM) for striking a balance between optimal monitoring performance and cost efficiency, a novel framework based on Deep Reinforcement Learning (DRL) and SlowFast Model to ensure precise monitoring based on users' activities. Specifically, with the SlowFast Model, DActAHM efficiently identifies individual activities and captures these results for enhanced processing. Subsequen",
    "path": "papers/24/01/2401.10794.json",
    "total_tokens": 837,
    "translated_title": "深度强化学习增强的活动感知动态健康监测系统",
    "translated_abstract": "在智能医疗中，健康监测利用各种工具和技术分析患者的实时生物信号数据，实现即时的操作和干预。现有的监测方法是在医疗设备同时跟踪多个健康指标的前提下设计的，以适应其指定的功能范围。这意味着它们报告该范围内的所有相关健康数值，这可能导致过多的资源使用和收集不相关的健康数据。在这种情况下，我们提出了基于深度强化学习和SlowFast模型的动态活动感知健康监测策略（DActAHM），以在用户活动基础上确保精确监测，实现监测性能和成本效益之间的平衡。具体来说，DActAHM使用SlowFast模型高效地识别个体活动，并捕捉这些结果以进行增强处理。",
    "tldr": "这篇论文提出了一个深度强化学习增强的活动感知动态健康监测系统，通过使用SlowFast模型实现精确监测和成本效益的平衡。"
}