{
    "title": "Adaptive Boosting with Fairness-aware Reweighting Technique for Fair Classification. (arXiv:2401.03097v1 [cs.LG])",
    "abstract": "Machine learning methods based on AdaBoost have been widely applied to various classification problems across many mission-critical applications including healthcare, law and finance. However, there is a growing concern about the unfairness and discrimination of data-driven classification models, which is inevitable for classical algorithms including AdaBoost. In order to achieve fair classification, a novel fair AdaBoost (FAB) approach is proposed that is an interpretable fairness-improving variant of AdaBoost. We mainly investigate binary classification problems and focus on the fairness of three different indicators (i.e., accuracy, false positive rate and false negative rate). By utilizing a fairness-aware reweighting technique for base classifiers, the proposed FAB approach can achieve fair classification while maintaining the advantage of AdaBoost with negligible sacrifice of predictive performance. In addition, a hyperparameter is introduced in FAB to show preferences for the fa",
    "link": "http://arxiv.org/abs/2401.03097",
    "context": "Title: Adaptive Boosting with Fairness-aware Reweighting Technique for Fair Classification. (arXiv:2401.03097v1 [cs.LG])\nAbstract: Machine learning methods based on AdaBoost have been widely applied to various classification problems across many mission-critical applications including healthcare, law and finance. However, there is a growing concern about the unfairness and discrimination of data-driven classification models, which is inevitable for classical algorithms including AdaBoost. In order to achieve fair classification, a novel fair AdaBoost (FAB) approach is proposed that is an interpretable fairness-improving variant of AdaBoost. We mainly investigate binary classification problems and focus on the fairness of three different indicators (i.e., accuracy, false positive rate and false negative rate). By utilizing a fairness-aware reweighting technique for base classifiers, the proposed FAB approach can achieve fair classification while maintaining the advantage of AdaBoost with negligible sacrifice of predictive performance. In addition, a hyperparameter is introduced in FAB to show preferences for the fa",
    "path": "papers/24/01/2401.03097.json",
    "total_tokens": 845,
    "translated_title": "具有公平感知重加权技术的自适应Boosting用于公平分类",
    "translated_abstract": "基于AdaBoost的机器学习方法已广泛应用于包括医疗、法律和金融等多个关键应用领域的各种分类问题。然而，针对经典算法如AdaBoost，人们越来越关注数据驱动的分类模型的不公平和歧视问题。为了实现公平分类，提出了一种新的公平AdaBoost（FAB）方法，它是AdaBoost的可解释性改进变体。我们主要研究二元分类问题，并关注三种不同指标的公平性（即准确率、假阳性率和假阴性率）。通过利用一种公平感知的基分类器重加权技术，提出的FAB方法可以在保持AdaBoost优势的同时实现公平分类，而对预测性能几乎没有牺牲。另外，引入了FAB中的一个超参数，用于展示对公平性的偏好。",
    "tldr": "该论文提出了一种公平AdaBoost（FAB）方法，通过公平感知的基分类器重加权技术，实现了在保持AdaBoost优势的同时实现公平分类，而对预测性能几乎没有牺牲。",
    "en_tdlr": "This paper proposes a fair AdaBoost (FAB) approach, which achieves fair classification while maintaining the advantage of AdaBoost with negligible sacrifice of predictive performance by utilizing a fairness-aware reweighting technique for base classifiers."
}