{
    "title": "Partially Law-Invariant Risk Measures. (arXiv:2401.17265v1 [q-fin.RM])",
    "abstract": "We introduce the concept of partial law invariance, generalizing the concept of law-invariant risk measures widely used in statistical and financial applications. This new concept is motivated by practical considerations of decision-making under uncertainty, thus connecting the literature on decision theory and that on financial risk management. We fully characterize partially law-invariant coherent risk measures via a novel representation formula, which, surprisingly, has little resemblance to the classical formula for law-invariant coherent risk measures. A notion of strong partial law invariance is introduced, allowing for a representation formula akin to the classical one. We propose a few classes of new risk measures, including partially law-invariant versions of the Expected Shortfall and the entropic risk measures, and illustrate their applications in risk assessment under model uncertainty.",
    "link": "http://arxiv.org/abs/2401.17265",
    "context": "Title: Partially Law-Invariant Risk Measures. (arXiv:2401.17265v1 [q-fin.RM])\nAbstract: We introduce the concept of partial law invariance, generalizing the concept of law-invariant risk measures widely used in statistical and financial applications. This new concept is motivated by practical considerations of decision-making under uncertainty, thus connecting the literature on decision theory and that on financial risk management. We fully characterize partially law-invariant coherent risk measures via a novel representation formula, which, surprisingly, has little resemblance to the classical formula for law-invariant coherent risk measures. A notion of strong partial law invariance is introduced, allowing for a representation formula akin to the classical one. We propose a few classes of new risk measures, including partially law-invariant versions of the Expected Shortfall and the entropic risk measures, and illustrate their applications in risk assessment under model uncertainty.",
    "path": "papers/24/01/2401.17265.json",
    "total_tokens": 880,
    "translated_title": "部分律法不变风险度量",
    "translated_abstract": "我们引入了部分律法不变性的概念，推广了统计和金融应用中广泛使用的律法不变风险度量的概念。这个新概念是由决策理论和金融风险管理的实际考虑所激发的，从而连接了决策理论和金融风险管理的文献。我们通过一种新颖的表示公式充分地刻画了部分律法不变的一致风险度量，这个表示公式与律法不变的一致风险度量的经典公式几乎没有相似之处。我们引入了强部分律法不变性的概念，从而可以得到与经典公式类似的表示公式。我们提出了几类新的风险度量，包括预期损失和熵风险度量的部分律法不变版本，并且展示了它们在模型不确定性下的风险评估应用。",
    "tldr": "这篇论文介绍了部分律法不变性的概念，通过刻画部分律法不变的一致风险度量的表示公式，将决策理论和金融风险管理的文献联系起来，提出了新的风险度量，并在模型不确定性下的风险评估中展示了其应用。",
    "en_tdlr": "This paper introduces the concept of partial law invariance in risk measures, connects decision theory and financial risk management, proposes new risk measures, and demonstrates their applications in risk assessment under model uncertainty."
}