{
    "title": "SeeClick: Harnessing GUI Grounding for Advanced Visual GUI Agents. (arXiv:2401.10935v1 [cs.HC])",
    "abstract": "Graphical User Interface (GUI) agents are designed to automate complex tasks on digital devices, such as smartphones and desktops. Most existing GUI agents interact with the environment through extracted structured data, which can be notably lengthy (e.g., HTML) and occasionally inaccessible (e.g., on desktops). To alleviate this issue, we propose a visual GUI agent -- SeeClick, which only relies on screenshots for task automation. In our preliminary study, we have discovered a key challenge in developing visual GUI agents: GUI grounding -the capacity to accurately locate screen elements based on instructions. To tackle this challenge, we propose to enhance SeeClick with GUI grounding pre-training and devise a method to automate the curation of GUI grounding data. Along with the efforts above, we have also created ScreenSpot, the first realistic GUI grounding dataset that encompasses mobile, desktop, and web environments. After pre-training, SeeClick demonstrates significant improvem",
    "link": "http://arxiv.org/abs/2401.10935",
    "context": "Title: SeeClick: Harnessing GUI Grounding for Advanced Visual GUI Agents. (arXiv:2401.10935v1 [cs.HC])\nAbstract: Graphical User Interface (GUI) agents are designed to automate complex tasks on digital devices, such as smartphones and desktops. Most existing GUI agents interact with the environment through extracted structured data, which can be notably lengthy (e.g., HTML) and occasionally inaccessible (e.g., on desktops). To alleviate this issue, we propose a visual GUI agent -- SeeClick, which only relies on screenshots for task automation. In our preliminary study, we have discovered a key challenge in developing visual GUI agents: GUI grounding -the capacity to accurately locate screen elements based on instructions. To tackle this challenge, we propose to enhance SeeClick with GUI grounding pre-training and devise a method to automate the curation of GUI grounding data. Along with the efforts above, we have also created ScreenSpot, the first realistic GUI grounding dataset that encompasses mobile, desktop, and web environments. After pre-training, SeeClick demonstrates significant improvem",
    "path": "papers/24/01/2401.10935.json",
    "total_tokens": 901,
    "translated_title": "SeeClick：利用GUI Grounding实现高级可视化GUI代理",
    "translated_abstract": "图形用户界面(GUI)代理被设计用于自动化数字设备上的复杂任务，如智能手机和桌面电脑。大多数现有的GUI代理通过提取的结构化数据与环境进行交互，这些数据可能特别冗长（例如HTML）且有时无法访问（例如在桌面上）。为了解决这个问题，我们提出了一种基于屏幕截图进行任务自动化的视觉GUI代理--SeeClick。在我们的初步研究中，我们发现了开发视觉GUI代理的一个关键挑战：GUI grounding - 根据指令准确定位屏幕元素的能力。为了解决这个挑战，我们提出了用GUI grounding预训练来增强SeeClick，并设计了一种自动化GUI grounding数据的方法。除了以上工作，我们还创建了ScreenSpot，第一个涵盖移动、桌面和Web环境的真实GUI grounding数据集。经过预训练，SeeClick展示了显著的改进。",
    "tldr": "SeeClick是一种基于屏幕截图的视觉GUI代理，通过GUI grounding预训练和自动化数据生成，实现了在复杂任务自动化中准确定位屏幕元素，并创建了全面覆盖移动、桌面和Web环境的GUI grounding数据集ScreenSpot。",
    "en_tdlr": "SeeClick is a visual GUI agent based on screenshots, which tackles the challenge of accurately locating screen elements through GUI grounding pre-training and automated data generation. It also introduces ScreenSpot, a comprehensive GUI grounding dataset covering mobile, desktop, and web environments."
}