{
    "title": "Optimizing Medication Decisions for Patients with Atrial Fibrillation through Path Development Network. (arXiv:2401.10014v1 [cs.LG])",
    "abstract": "Atrial fibrillation (AF) is a common cardiac arrhythmia characterized by rapid and irregular contractions of the atria. It significantly elevates the risk of strokes due to slowed blood flow in the atria, especially in the left atrial appendage, which is prone to blood clot formation. Such clots can migrate into cerebral arteries, leading to ischemic stroke. To assess whether AF patients should be prescribed anticoagulants, doctors often use the CHA2DS2-VASc scoring system. However, anticoagulant use must be approached with caution as it can impact clotting functions. This study introduces a machine learning algorithm that predicts whether patients with AF should be recommended anticoagulant therapy using 12-lead ECG data. In this model, we use STOME to enhance time-series data and then process it through a Convolutional Neural Network (CNN). By incorporating a path development layer, the model achieves a specificity of 30.6% under the condition of an NPV of 1. In contrast, LSTM algori",
    "link": "http://arxiv.org/abs/2401.10014",
    "context": "Title: Optimizing Medication Decisions for Patients with Atrial Fibrillation through Path Development Network. (arXiv:2401.10014v1 [cs.LG])\nAbstract: Atrial fibrillation (AF) is a common cardiac arrhythmia characterized by rapid and irregular contractions of the atria. It significantly elevates the risk of strokes due to slowed blood flow in the atria, especially in the left atrial appendage, which is prone to blood clot formation. Such clots can migrate into cerebral arteries, leading to ischemic stroke. To assess whether AF patients should be prescribed anticoagulants, doctors often use the CHA2DS2-VASc scoring system. However, anticoagulant use must be approached with caution as it can impact clotting functions. This study introduces a machine learning algorithm that predicts whether patients with AF should be recommended anticoagulant therapy using 12-lead ECG data. In this model, we use STOME to enhance time-series data and then process it through a Convolutional Neural Network (CNN). By incorporating a path development layer, the model achieves a specificity of 30.6% under the condition of an NPV of 1. In contrast, LSTM algori",
    "path": "papers/24/01/2401.10014.json",
    "total_tokens": 965,
    "translated_title": "通过路径发展网络优化心房颤动患者的药物决策",
    "translated_abstract": "心房颤动（AF）是一种常见的心律失常，其特征是心房快速不规则收缩。它显著增加了中风的风险，因为心房中的血流减慢，尤其是在易形成血栓的左心房附属物中。这样的血栓可以迁移到脑动脉，引发缺血性中风。为了评估是否应该为心房颤动患者开用抗凝药物，医生通常使用CHA2DS2-VASc评分系统。然而，抗凝药物的使用必须谨慎，因为它可能影响凝血功能。本研究引入了一种使用12导联心电图数据预测心房颤动患者是否应该推荐抗凝治疗的机器学习算法。在该模型中，我们使用STOME来增强时间序列数据，然后通过卷积神经网络（CNN）进行处理。通过引入路径发展层，该模型在NPV为1的条件下实现了30.6%的特异性。",
    "tldr": "本研究通过使用机器学习算法和路径发展网络，利用心电图数据预测心房颤动患者是否应该推荐抗凝治疗，为医生在药物决策中提供决策支持。",
    "en_tdlr": "This study introduces a machine learning algorithm and path development network to predict whether patients with atrial fibrillation should be recommended anticoagulant therapy using electrocardiogram data, providing decision support for medication decisions."
}