{
    "title": "Massively Multilingual Text Translation For Low-Resource Languages. (arXiv:2401.16582v1 [cs.CL])",
    "abstract": "Translation into severely low-resource languages has both the cultural goal of saving and reviving those languages and the humanitarian goal of assisting the everyday needs of local communities that are accelerated by the recent COVID-19 pandemic. In many humanitarian efforts, translation into severely low-resource languages often does not require a universal translation engine, but a dedicated text-specific translation engine. For example, healthcare records, hygienic procedures, government communication, emergency procedures and religious texts are all limited texts. While generic translation engines for all languages do not exist, translation of multilingually known limited texts into new, low-resource languages may be possible and reduce human translation effort. We attempt to leverage translation resources from rich-resource languages to efficiently produce best possible translation quality for well known texts, which are available in multiple languages, in a new, low-resource lan",
    "link": "http://arxiv.org/abs/2401.16582",
    "context": "Title: Massively Multilingual Text Translation For Low-Resource Languages. (arXiv:2401.16582v1 [cs.CL])\nAbstract: Translation into severely low-resource languages has both the cultural goal of saving and reviving those languages and the humanitarian goal of assisting the everyday needs of local communities that are accelerated by the recent COVID-19 pandemic. In many humanitarian efforts, translation into severely low-resource languages often does not require a universal translation engine, but a dedicated text-specific translation engine. For example, healthcare records, hygienic procedures, government communication, emergency procedures and religious texts are all limited texts. While generic translation engines for all languages do not exist, translation of multilingually known limited texts into new, low-resource languages may be possible and reduce human translation effort. We attempt to leverage translation resources from rich-resource languages to efficiently produce best possible translation quality for well known texts, which are available in multiple languages, in a new, low-resource lan",
    "path": "papers/24/01/2401.16582.json",
    "total_tokens": 884,
    "translated_title": "大规模多语言文本翻译对于低资源语言",
    "translated_abstract": "将翻译应用于资源极为有限的语言，既有文化目的，也有人道主义目的，旨在拯救和复兴这些语言，并满足由COVID-19大流行加速的当地社区的日常需求。在许多人道主义工作中，对资源极其有限的语言进行翻译通常不需要一个通用的翻译引擎，而是需要一个专门的针对特定文本的翻译引擎。例如，医疗记录、卫生程序、政府通信、紧急程序和宗教文本都属于有限的文本。尽管还不存在适用于所有语言的通用翻译引擎，但是可能可以将多语言已知的有限文本翻译成新的、资源有限的语言，从而减少人工翻译的工作量。我们试图利用来自资源丰富的语言的翻译资源，高效地为多语言已知的常规文本提供最佳的翻译质量，在新的资源有限的语言环境中实现翻译。",
    "tldr": "该论文提出了一种将翻译资源从资源丰富的语言利用到资源有限的语言的方法，以满足低资源语言的翻译需求，并提高翻译质量和效率。"
}