{
    "title": "Importance-Aware Data Augmentation for Document-Level Neural Machine Translation. (arXiv:2401.15360v1 [cs.CL])",
    "abstract": "Document-level neural machine translation (DocNMT) aims to generate translations that are both coherent and cohesive, in contrast to its sentence-level counterpart. However, due to its longer input length and limited availability of training data, DocNMT often faces the challenge of data sparsity. To overcome this issue, we propose a novel Importance-Aware Data Augmentation (IADA) algorithm for DocNMT that augments the training data based on token importance information estimated by the norm of hidden states and training gradients. We conduct comprehensive experiments on three widely-used DocNMT benchmarks. Our empirical results show that our proposed IADA outperforms strong DocNMT baselines as well as several data augmentation approaches, with statistical significance on both sentence-level and document-level BLEU.",
    "link": "http://arxiv.org/abs/2401.15360",
    "context": "Title: Importance-Aware Data Augmentation for Document-Level Neural Machine Translation. (arXiv:2401.15360v1 [cs.CL])\nAbstract: Document-level neural machine translation (DocNMT) aims to generate translations that are both coherent and cohesive, in contrast to its sentence-level counterpart. However, due to its longer input length and limited availability of training data, DocNMT often faces the challenge of data sparsity. To overcome this issue, we propose a novel Importance-Aware Data Augmentation (IADA) algorithm for DocNMT that augments the training data based on token importance information estimated by the norm of hidden states and training gradients. We conduct comprehensive experiments on three widely-used DocNMT benchmarks. Our empirical results show that our proposed IADA outperforms strong DocNMT baselines as well as several data augmentation approaches, with statistical significance on both sentence-level and document-level BLEU.",
    "path": "papers/24/01/2401.15360.json",
    "total_tokens": 880,
    "translated_title": "重要性感知数据增强用于文档级神经机器翻译",
    "translated_abstract": "文档级神经机器翻译（DocNMT）旨在生成连贯且连贯的翻译，与其句级对应物相比。然而，由于其较长的输入长度和有限的训练数据可用性，DocNMT常常面临着数据稀疏性的挑战。为了克服这个问题，我们提出了一种新颖的基于标记重要性信息的文档级神经机器翻译数据增强（IADA）算法，该算法通过计算隐藏状态和训练梯度的范数来增强训练数据。我们在三个广泛使用的DocNMT基准测试集上进行了全面的实验证明。我们的实证结果表明，我们提出的IADA算法在句级和文档级BLEU上均优于强大的DocNMT基线和几种数据增强方法，具有统计学意义。",
    "tldr": "本论文提出了一种新颖的基于标记重要性信息的文档级神经机器翻译数据增强算法，通过计算隐藏状态和训练梯度的范数来增强训练数据。实验证明，该算法在句级和文档级BLEU上优于强大的基线和几种数据增强方法。",
    "en_tdlr": "This paper proposes a novel Importance-Aware Data Augmentation algorithm for document-level neural machine translation that enhances training data by calculating the norm of hidden states and training gradients. Experimental results show that the proposed algorithm outperforms strong baselines and other data augmentation methods in terms of BLEU scores at both sentence and document levels."
}