{
    "title": "Using i-vectors for subject-independent cross-session EEG transfer learning. (arXiv:2401.08851v1 [cs.LG])",
    "abstract": "Cognitive load classification is the task of automatically determining an individual's utilization of working memory resources during performance of a task based on physiologic measures such as electroencephalography (EEG). In this paper, we follow a cross-disciplinary approach, where tools and methodologies from speech processing are used to tackle this problem. The corpus we use was released publicly in 2021 as part of the first passive brain-computer interface competition on cross-session workload estimation. We present our approach which used i-vector-based neural network classifiers to accomplish inter-subject cross-session EEG transfer learning, achieving 18% relative improvement over equivalent subject-dependent models. We also report experiments showing how our subject-independent models perform competitively on held-out subjects and improve with additional subject data, suggesting that subject-dependent training is not required for effective cognitive load determination.",
    "link": "http://arxiv.org/abs/2401.08851",
    "context": "Title: Using i-vectors for subject-independent cross-session EEG transfer learning. (arXiv:2401.08851v1 [cs.LG])\nAbstract: Cognitive load classification is the task of automatically determining an individual's utilization of working memory resources during performance of a task based on physiologic measures such as electroencephalography (EEG). In this paper, we follow a cross-disciplinary approach, where tools and methodologies from speech processing are used to tackle this problem. The corpus we use was released publicly in 2021 as part of the first passive brain-computer interface competition on cross-session workload estimation. We present our approach which used i-vector-based neural network classifiers to accomplish inter-subject cross-session EEG transfer learning, achieving 18% relative improvement over equivalent subject-dependent models. We also report experiments showing how our subject-independent models perform competitively on held-out subjects and improve with additional subject data, suggesting that subject-dependent training is not required for effective cognitive load determination.",
    "path": "papers/24/01/2401.08851.json",
    "total_tokens": 888,
    "translated_title": "使用i向量进行主体无关的跨会话EEG迁移学习",
    "translated_abstract": "认知负荷分类是根据生理测量如脑电图（EEG）自动确定个体在执行任务时利用工作记忆资源的任务。本文采用了跨学科的方法，利用语音处理的工具和方法来解决这个问题。我们使用的语料库作为第一次被动脑机接口竞赛的一部分，在2021年公开发布。我们提出了使用基于i向量的神经网络分类器进行跨主体跨会话EEG迁移学习的方法，相较于等效的主体相关模型，取得了18%的相对改进。我们还报道了实验结果，显示我们的主体无关模型在新主体上具有竞争力，并且随着额外主体数据的增加而改善，表明有效的认知负荷确定不需要主体相关的训练。",
    "tldr": "本文提出了使用基于i向量的神经网络分类器进行跨主体跨会话EEG迁移学习的方法，相对于等效的主体相关模型取得了18%的相对改进。此外，我们还展示了我们的主体无关模型在新主体上的竞争力和额外主体数据的增加对模型性能的改善，表明有效的认知负荷确定不需要主体相关的训练。",
    "en_tdlr": "This paper proposes using i-vector based neural network classifiers for subject-independent cross-session EEG transfer learning, achieving 18% relative improvement over equivalent subject-dependent models. Additionally, the subject-independent models perform competitively on new subjects and improve with additional subject data, suggesting that effective cognitive load determination does not require subject-dependent training."
}