{
    "title": "Resolution Chromatography of Diffusion Models. (arXiv:2401.10247v1 [cs.CV])",
    "abstract": "Diffusion models generate high-resolution images through iterative stochastic processes. In particular, the denoising method is one of the most popular approaches that predicts the noise in samples and denoises it at each time step. It has been commonly observed that the resolution of generated samples changes over time, starting off blurry and coarse, and becoming sharper and finer. In this paper, we introduce \"resolution chromatography\" that indicates the signal generation rate of each resolution, which is very helpful concept to mathematically explain this coarse-to-fine behavior in generation process, to understand the role of noise schedule, and to design time-dependent modulation. Using resolution chromatography, we determine which resolution level becomes dominant at a specific time step, and experimentally verify our theory with text-to-image diffusion models. We also propose some direct applications utilizing the concept: upscaling pre-trained models to higher resolutions and ",
    "link": "http://arxiv.org/abs/2401.10247",
    "context": "Title: Resolution Chromatography of Diffusion Models. (arXiv:2401.10247v1 [cs.CV])\nAbstract: Diffusion models generate high-resolution images through iterative stochastic processes. In particular, the denoising method is one of the most popular approaches that predicts the noise in samples and denoises it at each time step. It has been commonly observed that the resolution of generated samples changes over time, starting off blurry and coarse, and becoming sharper and finer. In this paper, we introduce \"resolution chromatography\" that indicates the signal generation rate of each resolution, which is very helpful concept to mathematically explain this coarse-to-fine behavior in generation process, to understand the role of noise schedule, and to design time-dependent modulation. Using resolution chromatography, we determine which resolution level becomes dominant at a specific time step, and experimentally verify our theory with text-to-image diffusion models. We also propose some direct applications utilizing the concept: upscaling pre-trained models to higher resolutions and ",
    "path": "papers/24/01/2401.10247.json",
    "total_tokens": 869,
    "translated_title": "扩散模型的分辨率色谱层析",
    "translated_abstract": "扩散模型通过迭代随机过程生成高分辨率图像。特别地，去噪方法是最流行的方法之一，它在每个时间步骤中预测样本中的噪声并对其进行去噪。常常观察到生成样本的分辨率随时间而变化，开始模糊和粗糙，然后变得更加清晰和细致。本文引入了\"分辨率色谱层析\"的概念，指示了每个分辨率的信号生成速率，这对于数学上解释生成过程中粗粒到细粒行为、理解噪声时间表的作用以及设计时间依赖的调制非常有帮助。利用分辨率色谱层析，我们确定了在特定时间步骤中哪个分辨率水平变得主导，并通过文本到图像扩散模型实验证明了我们的理论。我们还提出了一些直接应用该概念的方法：将预训练模型升级到更高的分辨率等。",
    "tldr": "本文介绍了分辨率色谱层析，用于解释生成过程中的粗糙到细致行为和设计时间依赖的调制。通过实验证明了该理论，并提出了一些应用方法。",
    "en_tdlr": "This paper introduces resolution chromatography to explain the coarse-to-fine behavior in the generation process and design time-dependent modulation. Experimental verification is provided, and some applications are proposed."
}