{
    "title": "Learning Domain-Independent Green's Function For Elliptic Partial Differential Equations",
    "abstract": "Green's function characterizes a partial differential equation (PDE) and maps its solution in the entire domain as integrals. Finding the analytical form of Green's function is a non-trivial exercise, especially for a PDE defined on a complex domain or a PDE with variable coefficients. In this paper, we propose a novel boundary integral network to learn the domain-independent Green's function, referred to as BIN-G. We evaluate the Green's function in the BIN-G using a radial basis function (RBF) kernel-based neural network. We train the BIN-G by minimizing the residual of the PDE and the mean squared errors of the solutions to the boundary integral equations for prescribed test functions. By leveraging the symmetry of the Green's function and controlling refinements of the RBF kernel near the singularity of the Green function, we demonstrate that our numerical scheme enables fast training and accurate evaluation of the Green's function for PDEs with variable coefficients. The learned G",
    "link": "https://arxiv.org/abs/2401.17172",
    "context": "Title: Learning Domain-Independent Green's Function For Elliptic Partial Differential Equations\nAbstract: Green's function characterizes a partial differential equation (PDE) and maps its solution in the entire domain as integrals. Finding the analytical form of Green's function is a non-trivial exercise, especially for a PDE defined on a complex domain or a PDE with variable coefficients. In this paper, we propose a novel boundary integral network to learn the domain-independent Green's function, referred to as BIN-G. We evaluate the Green's function in the BIN-G using a radial basis function (RBF) kernel-based neural network. We train the BIN-G by minimizing the residual of the PDE and the mean squared errors of the solutions to the boundary integral equations for prescribed test functions. By leveraging the symmetry of the Green's function and controlling refinements of the RBF kernel near the singularity of the Green function, we demonstrate that our numerical scheme enables fast training and accurate evaluation of the Green's function for PDEs with variable coefficients. The learned G",
    "path": "papers/24/01/2401.17172.json",
    "total_tokens": 923,
    "translated_title": "学习独立于领域的椭圆偏微分方程的格林函数",
    "translated_abstract": "格林函数描述了一个偏微分方程，并将它的解在整个区域中映射为积分。找到格林函数的解析形式是一个非平凡的任务，特别是对于定义在复杂区域上或具有可变系数的偏微分方程而言。在本文中，我们提出了一个新颖的边界积分网络BIN-G，用于学习独立于领域的格林函数。我们使用基于径向基函数(RBF)核的神经网络在BIN-G中评估格林函数。我们通过最小化PDE的残差和预定义测试函数的边界积分方程的均方误差来训练BIN-G。通过利用格林函数的对称性并控制RBF核在格林函数奇异点附近的细化，我们证明了我们的数值方案能够快速训练和准确评估具有可变系数的PDE的格林函数。",
    "tldr": "本文提出了一个用于学习独立于领域的椭圆偏微分方程的格林函数的新方法。通过使用基于径向基函数核的神经网络，在边界积分网络BIN-G中评估格林函数。我们的数值方案能够快速训练和准确评估具有可变系数的PDE的格林函数。"
}