{
    "title": "Content-Aware Depth-Adaptive Image Restoration. (arXiv:2401.05049v1 [cs.CV])",
    "abstract": "This work prioritizes building a modular pipeline that utilizes existing models to systematically restore images, rather than creating new restoration models from scratch. Restoration is carried out at an object-specific level, with each object regenerated using its corresponding class label information. The approach stands out by providing complete user control over the entire restoration process. Users can select models for specialized restoration steps, customize the sequence of steps to meet their needs, and refine the resulting regenerated image with depth awareness. The research provides two distinct pathways for implementing image regeneration, allowing for a comparison of their respective strengths and limitations. The most compelling aspect of this versatile system is its adaptability. This adaptability enables users to target particular object categories, including medical images, by providing models that are trained on those object classes.",
    "link": "http://arxiv.org/abs/2401.05049",
    "context": "Title: Content-Aware Depth-Adaptive Image Restoration. (arXiv:2401.05049v1 [cs.CV])\nAbstract: This work prioritizes building a modular pipeline that utilizes existing models to systematically restore images, rather than creating new restoration models from scratch. Restoration is carried out at an object-specific level, with each object regenerated using its corresponding class label information. The approach stands out by providing complete user control over the entire restoration process. Users can select models for specialized restoration steps, customize the sequence of steps to meet their needs, and refine the resulting regenerated image with depth awareness. The research provides two distinct pathways for implementing image regeneration, allowing for a comparison of their respective strengths and limitations. The most compelling aspect of this versatile system is its adaptability. This adaptability enables users to target particular object categories, including medical images, by providing models that are trained on those object classes.",
    "path": "papers/24/01/2401.05049.json",
    "total_tokens": 852,
    "translated_title": "内容感知的深度自适应图像修复",
    "translated_abstract": "这项工作的重点是建立一个模块化的流程，利用现有模型来系统地修复图像，而不是从头开始创建新的修复模型。修复是在对象级别进行的，每个对象使用其对应的类别标签信息进行重新生成。该方法通过提供完全用户控制整个修复过程而脱颖而出。用户可以选择专门的修复步骤模型，自定义步骤的顺序以满足他们的需求，并利用深度感知对生成的图像进行进一步的优化。研究提供了两种不同的图像修复实施路径，以比较它们各自的优势和限制。这个多功能系统最吸引人的方面是它的适应性。这种适应性使用户能够针对特定的对象类别（包括医学图像）提供在这些对象类别上训练的模型。",
    "tldr": "这项工作提出了一种模块化的图像修复流程，通过利用现有模型、对象级别的修复和用户自定义的步骤顺序，以及深度感知优化生成的图像，从而实现了对整个修复过程的完全用户控制。这个系统具有很强的适应性，可以针对特定的对象类别实现图像修复。",
    "en_tdlr": "This work presents a modular image restoration pipeline that utilizes existing models, object-level regeneration, and user customization to provide complete control over the restoration process. The system's adaptability allows for targeted image restoration for specific object categories."
}