{
    "title": "BanglaNet: Bangla Handwritten Character Recognition using Ensembling of Convolutional Neural Network",
    "abstract": "Handwritten character recognition is a crucial task because of its abundant applications. The recognition task of Bangla handwritten characters is especially challenging because of the cursive nature of Bangla characters and the presence of compound characters with more than one way of writing. In this paper, a classification model based on the ensembling of several Convolutional Neural Networks (CNN), namely, BanglaNet is proposed to classify Bangla basic characters, compound characters, numerals, and modifiers. Three different models based on the idea of state-of-the-art CNN models like Inception, ResNet, and DenseNet have been trained with both augmented and non-augmented inputs. Finally, all these models are averaged or ensembled to get the finishing model. Rigorous experimentation on three benchmark Bangla handwritten characters datasets, namely, CMATERdb, BanglaLekha-Isolated, and Ekush has exhibited significant recognition accuracies compared to some recent CNN-based research. T",
    "link": "https://arxiv.org/abs/2401.08035",
    "context": "Title: BanglaNet: Bangla Handwritten Character Recognition using Ensembling of Convolutional Neural Network\nAbstract: Handwritten character recognition is a crucial task because of its abundant applications. The recognition task of Bangla handwritten characters is especially challenging because of the cursive nature of Bangla characters and the presence of compound characters with more than one way of writing. In this paper, a classification model based on the ensembling of several Convolutional Neural Networks (CNN), namely, BanglaNet is proposed to classify Bangla basic characters, compound characters, numerals, and modifiers. Three different models based on the idea of state-of-the-art CNN models like Inception, ResNet, and DenseNet have been trained with both augmented and non-augmented inputs. Finally, all these models are averaged or ensembled to get the finishing model. Rigorous experimentation on three benchmark Bangla handwritten characters datasets, namely, CMATERdb, BanglaLekha-Isolated, and Ekush has exhibited significant recognition accuracies compared to some recent CNN-based research. T",
    "path": "papers/24/01/2401.08035.json",
    "total_tokens": 887,
    "translated_title": "BanglaNet: 使用卷积神经网络集合的方法对孟加拉手写字符进行识别",
    "translated_abstract": "手写字符识别是一项重要任务，因为它有很多应用。孟加拉手写字符的识别任务尤其具有挑战性，因为孟加拉字符具有连写的特点，并且具有多种书写方式的复合字符。本文提出了一种基于多个卷积神经网络（CNN）集合的分类模型——BanglaNet，用于对孟加拉基本字符、复合字符、数字符号和修饰符进行分类。基于Inception、ResNet和DenseNet等最新CNN模型的三种不同模型根据增强和非增强输入进行训练。最后，将这些模型进行平均或集成，得到最终模型。针对三个基准孟加拉手写字符数据集（CMATERdb、BanglaLekha-Isolated和Ekush），进行了严格的实验，与一些最新的基于CNN的研究相比，取得了显著的识别准确率提升。",
    "tldr": "本文提出了BanglaNet，使用卷积神经网络集合的方法对孟加拉手写字符进行识别。实验结果表明，在三个基准数据集上，与最新的CNN研究相比，取得了显著的识别准确率提升。"
}