{
    "title": "CAREForMe: Contextual Multi-Armed Bandit Recommendation Framework for Mental Health. (arXiv:2401.15188v1 [cs.AI])",
    "abstract": "The COVID-19 pandemic has intensified the urgency for effective and accessible mental health interventions in people's daily lives. Mobile Health (mHealth) solutions, such as AI Chatbots and Mindfulness Apps, have gained traction as they expand beyond traditional clinical settings to support daily life. However, the effectiveness of current mHealth solutions is impeded by the lack of context-awareness, personalization, and modularity to foster their reusability. This paper introduces CAREForMe, a contextual multi-armed bandit (CMAB) recommendation framework for mental health. Designed with context-awareness, personalization, and modularity at its core, CAREForMe harnesses mobile sensing and integrates online learning algorithms with user clustering capability to deliver timely, personalized recommendations. With its modular design, CAREForMe serves as both a customizable recommendation framework to guide future research, and a collaborative platform to facilitate interdisciplinary cont",
    "link": "http://arxiv.org/abs/2401.15188",
    "context": "Title: CAREForMe: Contextual Multi-Armed Bandit Recommendation Framework for Mental Health. (arXiv:2401.15188v1 [cs.AI])\nAbstract: The COVID-19 pandemic has intensified the urgency for effective and accessible mental health interventions in people's daily lives. Mobile Health (mHealth) solutions, such as AI Chatbots and Mindfulness Apps, have gained traction as they expand beyond traditional clinical settings to support daily life. However, the effectiveness of current mHealth solutions is impeded by the lack of context-awareness, personalization, and modularity to foster their reusability. This paper introduces CAREForMe, a contextual multi-armed bandit (CMAB) recommendation framework for mental health. Designed with context-awareness, personalization, and modularity at its core, CAREForMe harnesses mobile sensing and integrates online learning algorithms with user clustering capability to deliver timely, personalized recommendations. With its modular design, CAREForMe serves as both a customizable recommendation framework to guide future research, and a collaborative platform to facilitate interdisciplinary cont",
    "path": "papers/24/01/2401.15188.json",
    "total_tokens": 964,
    "translated_title": "CAREForMe：心理健康的情境多臂赌博推荐框架",
    "translated_abstract": "新冠疫情加剧了人们日常生活中有效和可获得的心理健康干预的紧迫性。移动健康（mHealth）解决方案，如AI聊天机器人和正念应用程序，已经获得了推广，因为它们不再局限于传统的临床环境，而是支持日常生活。然而，当前mHealth解决方案的有效性受到了缺乏上下文感知、个性化和模块化的阻碍，以促进它们的可重复使用性。本文介绍了CAREForMe，一种针对心理健康的情境多臂赌博（CMAB）推荐框架。CAREForMe以上下文感知、个性化和模块化为核心进行设计，利用移动传感和集成在线学习算法以及用户聚类能力来提供及时、个性化的推荐。通过其模块化设计，CAREForMe既是一个可定制的推荐框架，以指导未来的研究，又是一个促进跨学科合作的平台。",
    "tldr": "CAREForMe是一种为心理健康设计的情境多臂赌博推荐框架，通过上下文感知、个性化和模块化的设计，结合移动传感和在线学习算法，提供及时、个性化的推荐。它的模块化设计既支持定制化的研究，也促进了跨学科的合作。",
    "en_tdlr": "CAREForMe is a contextual multi-armed bandit recommendation framework designed for mental health, providing timely and personalized recommendations through context-awareness, personalization, and modularity. Its modular design supports customized research and facilitates interdisciplinary collaboration."
}