{
    "title": "Combining Hierachical VAEs with LLMs for clinically meaningful timeline summarisation in social media",
    "abstract": "arXiv:2401.16240v2 Announce Type: replace-cross  Abstract: We introduce a hybrid abstractive summarisation approach combining hierarchical VAE with LLMs (LlaMA-2) to produce clinically meaningful summaries from social media user timelines, appropriate for mental health monitoring. The summaries combine two different narrative points of view: clinical insights in third person useful for a clinician are generated by feeding into an LLM specialised clinical prompts, and importantly, a temporally sensitive abstractive summary of the user's timeline in first person, generated by a novel hierarchical variational autoencoder, TH-VAE. We assess the generated summaries via automatic evaluation against expert summaries and via human evaluation with clinical experts, showing that timeline summarisation by TH-VAE results in more factual and logically coherent summaries rich in clinical utility and superior to LLM-only approaches in capturing changes over time.",
    "link": "https://arxiv.org/abs/2401.16240",
    "context": "Title: Combining Hierachical VAEs with LLMs for clinically meaningful timeline summarisation in social media\nAbstract: arXiv:2401.16240v2 Announce Type: replace-cross  Abstract: We introduce a hybrid abstractive summarisation approach combining hierarchical VAE with LLMs (LlaMA-2) to produce clinically meaningful summaries from social media user timelines, appropriate for mental health monitoring. The summaries combine two different narrative points of view: clinical insights in third person useful for a clinician are generated by feeding into an LLM specialised clinical prompts, and importantly, a temporally sensitive abstractive summary of the user's timeline in first person, generated by a novel hierarchical variational autoencoder, TH-VAE. We assess the generated summaries via automatic evaluation against expert summaries and via human evaluation with clinical experts, showing that timeline summarisation by TH-VAE results in more factual and logically coherent summaries rich in clinical utility and superior to LLM-only approaches in capturing changes over time.",
    "path": "papers/24/01/2401.16240.json",
    "total_tokens": 938,
    "translated_title": "将分层变分自动编码器与LLMs结合，实现在社交媒体中具有临床意义的时间线摘要",
    "translated_abstract": "我们引入了一种混合的抽象汇总方法，将分层变分自动编码器与LLMs结合（LlaMA-2），以从社交媒体用户时间轴生成具有临床意义的摘要，适用于心理健康监测。摘要结合了两种不同的叙述观点：通过向专门的临床提示馈送来生成专向临床医生有用的第三人称临床见解，以及重要的，通过新颖的分层变分自动编码器TH-VAE生成用户时间线的临时敏感的第一人称抽象摘要。我们通过与专家摘要的自动评估和与临床专家的人工评估来评估生成的摘要，结果表明通过TH-VAE进行的时间线摘要会产生更富有临床效用、更具事实和逻辑连贯性的摘要，优于仅使用LLM方法捕捉时间变化。",
    "tldr": "利用混合的分层变分自动编码器与LLMs结合的方法实现了从社交媒体用户时间轴生成具有临床意义的摘要，通过对时间轴的时间敏感性和举重有力的抽象摘要，TH-VAE生成的摘要在捕捉随时间变化方面优于仅使用LLM方法。"
}