{
    "title": "Identification of 4FGL uncertain sources at Higher Resolutions with Inverse Discrete Wavelet Transform. (arXiv:2401.02589v1 [astro-ph.HE])",
    "abstract": "In the forthcoming era of big astronomical data, it is a burden to find out target sources from ground-based and space-based telescopes. Although Machine Learning (ML) methods have been extensively utilized to address this issue, the incorporation of in-depth data analysis can significantly enhance the efficiency of identifying target sources when dealing with massive volumes of astronomical data. In this work, we focused on the task of finding AGN candidates and identifying BL Lac/FSRQ candidates from the 4FGL DR3 uncertain sources. We studied the correlations among the attributes of the 4FGL DR3 catalogue and proposed a novel method, named FDIDWT, to transform the original data. The transformed dataset is characterized as low-dimensional and feature-highlighted, with the estimation of correlation features by Fractal Dimension (FD) theory and the multi-resolution analysis by Inverse Discrete Wavelet Transform (IDWT). Combining the FDIDWT method with an improved lightweight MatchboxCon",
    "link": "http://arxiv.org/abs/2401.02589",
    "context": "Title: Identification of 4FGL uncertain sources at Higher Resolutions with Inverse Discrete Wavelet Transform. (arXiv:2401.02589v1 [astro-ph.HE])\nAbstract: In the forthcoming era of big astronomical data, it is a burden to find out target sources from ground-based and space-based telescopes. Although Machine Learning (ML) methods have been extensively utilized to address this issue, the incorporation of in-depth data analysis can significantly enhance the efficiency of identifying target sources when dealing with massive volumes of astronomical data. In this work, we focused on the task of finding AGN candidates and identifying BL Lac/FSRQ candidates from the 4FGL DR3 uncertain sources. We studied the correlations among the attributes of the 4FGL DR3 catalogue and proposed a novel method, named FDIDWT, to transform the original data. The transformed dataset is characterized as low-dimensional and feature-highlighted, with the estimation of correlation features by Fractal Dimension (FD) theory and the multi-resolution analysis by Inverse Discrete Wavelet Transform (IDWT). Combining the FDIDWT method with an improved lightweight MatchboxCon",
    "path": "papers/24/01/2401.02589.json",
    "total_tokens": 977,
    "translated_title": "利用逆离散小波变换在更高分辨率下识别4FGL不确定源",
    "translated_abstract": "在大型天文数据时代来临之际，从地基和空间望远镜中找到目标源是一项负担。虽然机器学习（ML）方法已被广泛用于解决这个问题，但深入数据分析的整合可以显著提高处理大量天文数据时识别目标源的效率。本研究重点关注从4FGL DR3不确定源中找到AGN候选源和识别BL Lac/FSRQ候选源的任务。我们研究了4FGL DR3目录属性之间的相关性，并提出了一种名为FDIDWT的新方法以转换原始数据。转换后的数据集具有低维度和突出特征，通过分形维数（FD）理论的相关特征估计和逆离散小波变换（IDWT）的多分辨率分析。将FDIDWT方法与改进的轻量级MatchboxCon方法相结合，",
    "tldr": "本文研究了从4FGL DR3不确定源中找到AGN候选源和识别BL Lac/FSRQ候选源的任务，提出了一种名为FDIDWT的新方法，通过逆离散小波变换（IDWT）的多分辨率分析和分形维数（FD）理论的相关特征估计，将原始数据转换成低维度和突出特征的数据集。"
}