{
    "title": "Learning from Emotions, Demographic Information and Implicit User Feedback in Task-Oriented Document-Grounded Dialogues. (arXiv:2401.09248v1 [cs.CL])",
    "abstract": "The success of task-oriented and document-grounded dialogue systems depends on users accepting and enjoying using them. To achieve this, recently published work in the field of Human-Computer Interaction suggests that the combination of considering demographic information, user emotions and learning from the implicit feedback in their utterances, is particularly important. However, these findings have not yet been transferred to the field of Natural Language Processing, where these data are primarily studied separately. Accordingly, no sufficiently annotated dataset is available. To address this gap, we introduce FEDI, the first English dialogue dataset for task-oriented document-grounded dialogues annotated with demographic information, user emotions and implicit feedback. Our experiments with FLAN-T5, GPT-2 and LLaMA-2 show that these data have the potential to improve task completion and the factual consistency of the generated responses and user acceptance.",
    "link": "http://arxiv.org/abs/2401.09248",
    "context": "Title: Learning from Emotions, Demographic Information and Implicit User Feedback in Task-Oriented Document-Grounded Dialogues. (arXiv:2401.09248v1 [cs.CL])\nAbstract: The success of task-oriented and document-grounded dialogue systems depends on users accepting and enjoying using them. To achieve this, recently published work in the field of Human-Computer Interaction suggests that the combination of considering demographic information, user emotions and learning from the implicit feedback in their utterances, is particularly important. However, these findings have not yet been transferred to the field of Natural Language Processing, where these data are primarily studied separately. Accordingly, no sufficiently annotated dataset is available. To address this gap, we introduce FEDI, the first English dialogue dataset for task-oriented document-grounded dialogues annotated with demographic information, user emotions and implicit feedback. Our experiments with FLAN-T5, GPT-2 and LLaMA-2 show that these data have the potential to improve task completion and the factual consistency of the generated responses and user acceptance.",
    "path": "papers/24/01/2401.09248.json",
    "total_tokens": 894,
    "translated_title": "从情绪、人口统计信息和隐含用户反馈中学习任务导向的文档对话",
    "translated_abstract": "任务导向和文档对话系统的成功取决于用户接受和享受使用它们。为了实现这一目标，人机交互领域的最新研究表明，考虑人口统计信息、用户情绪并从他们的话语中学习隐含反馈的组合尤为重要。然而，这些发现尚未转移到自然语言处理领域，这些数据主要是分别研究的。因此，目前没有足够注释的数据集可用。为了填补这一空白，我们引入了FEDI，这是第一个用人口统计信息、用户情绪和隐含反馈对任务导向的文档对话进行注释的英文对话数据集。我们使用FLAN-T5、GPT-2和LLaMA-2进行的实验证明，这些数据有潜力改善任务完成情况、生成响应的事实一致性和用户接受程度。",
    "tldr": "本论文介绍了FEDI，这是第一个用人口统计信息、用户情绪和隐含反馈对任务导向的文档对话进行注释的英文对话数据集，实验证明这些数据有潜力改善任务完成情况、生成响应的事实一致性和用户接受程度。",
    "en_tdlr": "This paper introduces FEDI, the first English dialogue dataset for task-oriented document-grounded dialogues annotated with demographic information, user emotions, and implicit feedback. The experiments show that these data have the potential to improve task completion, factual consistency of generated responses, and user acceptance."
}