{
    "title": "Forecasting and Backtesting Gradient Allocations of Expected Shortfall. (arXiv:2401.11701v1 [q-fin.RM])",
    "abstract": "Capital allocation is a procedure for quantifying the contribution of each source of risk to aggregated risk. The gradient allocation rule, also known as the Euler principle, is a prevalent rule of capital allocation under which the allocated capital captures the diversification benefit of the marginal risk as a component of overall risk. This research concentrates on Expected Shortfall (ES) as a regulatory standard and focuses on the gradient allocations of ES, also called ES contributions. We achieve the comprehensive treatment of backtesting the tuple of ES contributions in the framework of the traditional and comparative backtests based on the concepts of joint identifiability and multi-objective elicitability. For robust forecast evaluation against the choice of scoring function, we further develop Murphy diagrams for ES contributions as graphical tools to check whether one forecast dominates another under a class of scoring functions. Finally, leveraging the recent concept of mul",
    "link": "http://arxiv.org/abs/2401.11701",
    "context": "Title: Forecasting and Backtesting Gradient Allocations of Expected Shortfall. (arXiv:2401.11701v1 [q-fin.RM])\nAbstract: Capital allocation is a procedure for quantifying the contribution of each source of risk to aggregated risk. The gradient allocation rule, also known as the Euler principle, is a prevalent rule of capital allocation under which the allocated capital captures the diversification benefit of the marginal risk as a component of overall risk. This research concentrates on Expected Shortfall (ES) as a regulatory standard and focuses on the gradient allocations of ES, also called ES contributions. We achieve the comprehensive treatment of backtesting the tuple of ES contributions in the framework of the traditional and comparative backtests based on the concepts of joint identifiability and multi-objective elicitability. For robust forecast evaluation against the choice of scoring function, we further develop Murphy diagrams for ES contributions as graphical tools to check whether one forecast dominates another under a class of scoring functions. Finally, leveraging the recent concept of mul",
    "path": "papers/24/01/2401.11701.json",
    "total_tokens": 872,
    "translated_title": "预测和回测期望损失的梯度配置",
    "translated_abstract": "资本配置是一种量化各种风险源对总体风险的贡献的过程。梯度配置规则，也称为欧拉原则，是一种常见的资本配置规则，根据该规则分配的资本可以捕捉边际风险的多元化效益作为总体风险的组成部分。本研究以期望损失（ES）作为监管标准，重点关注ES的梯度配置，也称为ES贡献。我们在传统和比较回测的框架下对ES贡献元组进行全面处理，基于联合可识别性和多目标可引出性的概念。为了对抗衡函数选择进行稳健的预测评估，我们进一步开发了ES贡献的Murphy图表作为图形工具，以检查在一类抗衡函数下是否存在某个预测优于另一个预测。最后，利用最近的多元配置概念。",
    "tldr": "本研究探讨了期望损失的梯度配置，并提出了基于联合可识别性和多目标可引出性的回测方法、以及基于Murphy图表的稳健预测评估方法。",
    "en_tdlr": "This research investigates the gradient allocation of Expected Shortfall (ES) and proposes backtesting methods based on joint identifiability and multi-objective elicitability, as well as a robust forecast evaluation method using Murphy diagrams."
}