{
    "title": "InfoRank: Unbiased Learning-to-Rank via Conditional Mutual Information Minimization. (arXiv:2401.12553v1 [cs.IR])",
    "abstract": "Ranking items regarding individual user interests is a core technique of multiple downstream tasks such as recommender systems. Learning such a personalized ranker typically relies on the implicit feedback from users' past click-through behaviors. However, collected feedback is biased toward previously highly-ranked items and directly learning from it would result in a \"rich-get-richer\" phenomenon. In this paper, we propose a simple yet sufficient unbiased learning-to-rank paradigm named InfoRank that aims to simultaneously address both position and popularity biases. We begin by consolidating the impacts of those biases into a single observation factor, thereby providing a unified approach to addressing bias-related issues. Subsequently, we minimize the mutual information between the observation estimation and the relevance estimation conditioned on the input features. By doing so, our relevance estimation can be proved to be free of bias. To implement InfoRank, we first incorporate a",
    "link": "http://arxiv.org/abs/2401.12553",
    "context": "Title: InfoRank: Unbiased Learning-to-Rank via Conditional Mutual Information Minimization. (arXiv:2401.12553v1 [cs.IR])\nAbstract: Ranking items regarding individual user interests is a core technique of multiple downstream tasks such as recommender systems. Learning such a personalized ranker typically relies on the implicit feedback from users' past click-through behaviors. However, collected feedback is biased toward previously highly-ranked items and directly learning from it would result in a \"rich-get-richer\" phenomenon. In this paper, we propose a simple yet sufficient unbiased learning-to-rank paradigm named InfoRank that aims to simultaneously address both position and popularity biases. We begin by consolidating the impacts of those biases into a single observation factor, thereby providing a unified approach to addressing bias-related issues. Subsequently, we minimize the mutual information between the observation estimation and the relevance estimation conditioned on the input features. By doing so, our relevance estimation can be proved to be free of bias. To implement InfoRank, we first incorporate a",
    "path": "papers/24/01/2401.12553.json",
    "total_tokens": 830,
    "translated_title": "InfoRank：通过条件互信息最小化实现无偏的学习-排序",
    "translated_abstract": "对个别用户兴趣进行排序是多种下游任务（如推荐系统）的核心技术。学习这样的个性化排序器通常依赖于用户过去的点击行为的隐式反馈。然而，收集到的反馈对先前排名较高的项目存在偏见，直接从中学习会导致“富者愈富”的现象。在本文中，我们提出了一个简单但足够的无偏学习-排序范式，名为InfoRank，旨在同时解决位置和流行度偏见。我们首先将这些偏差的影响整合到一个单一的观察因子中，从而为解决与偏见相关的问题提供了统一的方法。随后，我们通过最小化以输入特征为条件的观测估计和相关估计之间的互信息来实现偏差-free 的相关估计。为了实现InfoRank，我们首先融入一个",
    "tldr": "InfoRank是一种无偏的学习-排序范式，通过最小化以输入特征为条件的观测估计和相关估计之间的互信息来实现偏差-free 的相关估计。",
    "en_tdlr": "InfoRank is an unbiased learning-to-rank paradigm that achieves bias-free relevance estimation by minimizing the mutual information between observation estimation and relevance estimation conditioned on input features."
}