{
    "title": "Consensus-Threshold Criterion for Offline Signature Verification using Convolutional Neural Network Learned Representations. (arXiv:2401.03085v1 [cs.CV])",
    "abstract": "A genuine signer's signature is naturally unstable even at short time-intervals whereas, expert forgers always try to perfectly mimic a genuine signer's signature. This presents a challenge which puts a genuine signer at risk of being denied access, while a forge signer is granted access. The implication is a high false acceptance rate (FAR) which is the percentage of forge signature classified as belonging to a genuine class. Existing work have only scratched the surface of signature verification because the misclassification error remains high. In this paper, a consensus-threshold distance-based classifier criterion is proposed for offline writer-dependent signature verification. Using features extracted from SigNet and SigNet-F deep convolutional neural network models, the proposed classifier minimizes FAR. This is demonstrated via experiments on four datasets: GPDS-300, MCYT, CEDAR and Brazilian PUC-PR datasets. On GPDS-300, the consensus threshold classifier improves the state-of-",
    "link": "http://arxiv.org/abs/2401.03085",
    "context": "Title: Consensus-Threshold Criterion for Offline Signature Verification using Convolutional Neural Network Learned Representations. (arXiv:2401.03085v1 [cs.CV])\nAbstract: A genuine signer's signature is naturally unstable even at short time-intervals whereas, expert forgers always try to perfectly mimic a genuine signer's signature. This presents a challenge which puts a genuine signer at risk of being denied access, while a forge signer is granted access. The implication is a high false acceptance rate (FAR) which is the percentage of forge signature classified as belonging to a genuine class. Existing work have only scratched the surface of signature verification because the misclassification error remains high. In this paper, a consensus-threshold distance-based classifier criterion is proposed for offline writer-dependent signature verification. Using features extracted from SigNet and SigNet-F deep convolutional neural network models, the proposed classifier minimizes FAR. This is demonstrated via experiments on four datasets: GPDS-300, MCYT, CEDAR and Brazilian PUC-PR datasets. On GPDS-300, the consensus threshold classifier improves the state-of-",
    "path": "papers/24/01/2401.03085.json",
    "total_tokens": 895,
    "translated_title": "离线签名验证中使用卷积神经网络学习表示的一致阈值准则",
    "translated_abstract": "真实签名即使在短时间间隔内也是自然不稳定的，而专家级伪造者总是试图完美模仿真实签名。这就提出了一个挑战，使得真实签名者面临被拒绝访问的风险，而伪造签名者则被授权访问。这意味着高误识率（FAR），即被错误分类为属于真实类别的伪造签名的百分比。现有工作只是浅尝辄止地进行了签名验证，因为误分类错误仍然很高。本文提出了一种离线写字者依赖的签名验证的一致阈值基于距离的分类器准则。通过使用从SigNet和SigNet-F深度卷积神经网络模型中提取的特征，所提出的分类器最小化了FAR。通过对四个数据集：GPDS-300、MCYT、CEDAR和巴西PUC-PR数据集进行实验来证明这一点。在GPDS-300上，一致阈值分类器改进了现有的状态。",
    "tldr": "本论文提出了一种离线签名验证的一致阈值准则，通过使用卷积神经网络模型提取的特征，可以减少伪造签名的误识率。",
    "en_tdlr": "This paper proposes a consensus-threshold criterion for offline signature verification, which uses features extracted from convolutional neural network models to reduce the false acceptance rate of forged signatures."
}