{
    "title": "Information Based Inference in Models with Set-Valued Predictions and Misspecification. (arXiv:2401.11046v1 [econ.EM])",
    "abstract": "This paper proposes an information-based inference method for partially identified parameters in incomplete models that is valid both when the model is correctly specified and when it is misspecified. Key features of the method are: (i) it is based on minimizing a suitably defined Kullback-Leibler information criterion that accounts for incompleteness of the model and delivers a non-empty pseudo-true set; (ii) it is computationally tractable; (iii) its implementation is the same for both correctly and incorrectly specified models; (iv) it exploits all information provided by variation in discrete and continuous covariates; (v) it relies on Rao's score statistic, which is shown to be asymptotically pivotal.",
    "link": "http://arxiv.org/abs/2401.11046",
    "context": "Title: Information Based Inference in Models with Set-Valued Predictions and Misspecification. (arXiv:2401.11046v1 [econ.EM])\nAbstract: This paper proposes an information-based inference method for partially identified parameters in incomplete models that is valid both when the model is correctly specified and when it is misspecified. Key features of the method are: (i) it is based on minimizing a suitably defined Kullback-Leibler information criterion that accounts for incompleteness of the model and delivers a non-empty pseudo-true set; (ii) it is computationally tractable; (iii) its implementation is the same for both correctly and incorrectly specified models; (iv) it exploits all information provided by variation in discrete and continuous covariates; (v) it relies on Rao's score statistic, which is shown to be asymptotically pivotal.",
    "path": "papers/24/01/2401.11046.json",
    "total_tokens": 732,
    "translated_title": "具有集合值预测和错误规范化的模型中的基于信息的推断方法",
    "translated_abstract": "本文提出了一种基于信息的推断方法，用于不完整模型中部分识别的参数，该方法在模型规范正确和错误时均有效。该方法的关键特点是：（i）基于最小化适当定义的Kullback-Leibler信息准则，考虑模型的不完整性，并提供非空伪真集；（ii）计算可行；（iii）无论模型规范正确与否，实现方法相同；（iv）利用离散和连续协变量的变异提供的所有信息；（v）依赖于Rao的评分统计量，该统计量被证明是渐近基本的。",
    "tldr": "本文介绍了一种基于信息的推断方法，用于处理具有集合值预测和错误规范化的模型中的部分识别参数，该方法可以在模型规范正确和错误时有效地进行推断。",
    "en_tdlr": "This paper presents an information-based inference method for partially identified parameters in models with set-valued predictions and misspecification, which is valid both when the model is correctly specified and when it is misspecified."
}