{
    "title": "Medical Dialogue Generation via Intuitive-then-Analytical Differential Diagnosis. (arXiv:2401.06541v1 [cs.CL])",
    "abstract": "Medical dialogue systems have attracted growing research attention as they have the potential to provide rapid diagnoses, treatment plans, and health consultations. In medical dialogues, a proper diagnosis is crucial as it establishes the foundation for future consultations. Clinicians typically employ both intuitive and analytic reasoning to formulate a differential diagnosis. This reasoning process hypothesizes and verifies a variety of possible diseases and strives to generate a comprehensive and rigorous diagnosis. However, recent studies on medical dialogue generation have overlooked the significance of modeling a differential diagnosis, which hinders the practical application of these systems. To address the above issue, we propose a medical dialogue generation framework with the Intuitive-then-Analytic Differential Diagnosis (IADDx). Our method starts with a differential diagnosis via retrieval-based intuitive association and subsequently refines it through a graph-enhanced anal",
    "link": "http://arxiv.org/abs/2401.06541",
    "context": "Title: Medical Dialogue Generation via Intuitive-then-Analytical Differential Diagnosis. (arXiv:2401.06541v1 [cs.CL])\nAbstract: Medical dialogue systems have attracted growing research attention as they have the potential to provide rapid diagnoses, treatment plans, and health consultations. In medical dialogues, a proper diagnosis is crucial as it establishes the foundation for future consultations. Clinicians typically employ both intuitive and analytic reasoning to formulate a differential diagnosis. This reasoning process hypothesizes and verifies a variety of possible diseases and strives to generate a comprehensive and rigorous diagnosis. However, recent studies on medical dialogue generation have overlooked the significance of modeling a differential diagnosis, which hinders the practical application of these systems. To address the above issue, we propose a medical dialogue generation framework with the Intuitive-then-Analytic Differential Diagnosis (IADDx). Our method starts with a differential diagnosis via retrieval-based intuitive association and subsequently refines it through a graph-enhanced anal",
    "path": "papers/24/01/2401.06541.json",
    "total_tokens": 932,
    "translated_title": "通过直觉-分析式鉴别诊断生成医疗对话",
    "translated_abstract": "医疗对话系统因其能够提供快速诊断、治疗方案和健康咨询的潜力而引起越来越多的研究关注。在医疗对话中，正确的诊断至关重要，因为它为未来的咨询建立了基础。临床医生通常使用直觉和分析推理来形成鉴别诊断。这个推理过程假设和验证了各种可能的疾病，并努力生成全面而严谨的诊断。然而，最近关于医疗对话生成的研究忽视了建模鉴别诊断的重要性，这阻碍了这些系统的实际应用。为了解决以上问题，我们提出了一种带有直觉-分析式鉴别诊断（IADDx）的医疗对话生成框架。我们的方法通过基于检索的直觉联想进行鉴别诊断，然后通过图增强的分析方法对其进行细化。",
    "tldr": "本研究提出了一种医疗对话生成框架，通过直觉-分析式鉴别诊断（IADDx）实现了对医疗对话的生成。该方法使用直觉和分析推理来建立鉴别诊断，并通过图增强的分析方法进行细化，提高了医疗对话系统的实际应用价值。",
    "en_tdlr": "This study proposes a medical dialogue generation framework, called Intuitive-then-Analytical Differential Diagnosis (IADDx), which utilizes intuitive and analytical reasoning to establish a differential diagnosis and refine it through graph-enhanced analysis, thereby improving the practical application of medical dialogue systems."
}