{
    "title": "A Fast Graph Search Algorithm with Dynamic Optimization and Reduced Histogram for Discrimination of Binary Classification Problem. (arXiv:2401.04282v1 [cs.LG])",
    "abstract": "This study develops a graph search algorithm to find the optimal discrimination path for the binary classification problem. The objective function is defined as the difference of variations between the true positive (TP) and false positive (FP). It uses the depth first search (DFS) algorithm to find the top-down paths for discrimination. It proposes a dynamic optimization procedure to optimize TP at the upper levels and then reduce FP at the lower levels. To accelerate computing speed with improving accuracy, it proposes a reduced histogram algorithm with variable bin size instead of looping over all data points, to find the feature threshold of discrimination. The algorithm is applied on top of a Support Vector Machine (SVM) model for a binary classification problem on whether a person is fit or unfit. It significantly improves TP and reduces FP of the SVM results (e.g., reduced FP by 90% with a loss of only\\ 5% TP). The graph search auto-generates 39 ranked discrimination paths withi",
    "link": "http://arxiv.org/abs/2401.04282",
    "context": "Title: A Fast Graph Search Algorithm with Dynamic Optimization and Reduced Histogram for Discrimination of Binary Classification Problem. (arXiv:2401.04282v1 [cs.LG])\nAbstract: This study develops a graph search algorithm to find the optimal discrimination path for the binary classification problem. The objective function is defined as the difference of variations between the true positive (TP) and false positive (FP). It uses the depth first search (DFS) algorithm to find the top-down paths for discrimination. It proposes a dynamic optimization procedure to optimize TP at the upper levels and then reduce FP at the lower levels. To accelerate computing speed with improving accuracy, it proposes a reduced histogram algorithm with variable bin size instead of looping over all data points, to find the feature threshold of discrimination. The algorithm is applied on top of a Support Vector Machine (SVM) model for a binary classification problem on whether a person is fit or unfit. It significantly improves TP and reduces FP of the SVM results (e.g., reduced FP by 90% with a loss of only\\ 5% TP). The graph search auto-generates 39 ranked discrimination paths withi",
    "path": "papers/24/01/2401.04282.json",
    "total_tokens": 914,
    "translated_title": "快速图搜索算法与动态优化和减少直方图用于二分类问题的区分 (arXiv:2401.04282v1 [cs.LG])",
    "translated_abstract": "本研究开发了一种图搜索算法，用于找到二分类问题的最优区分路径。目标函数被定义为真正例（TP）和假正例（FP）之间变异性的差异。它使用深度优先搜索（DFS）算法来寻找自顶向下的区分路径。它提出了一种动态优化过程，以在上层优化TP，然后在下层减少FP。为了加速计算速度并提高准确性，它提出了一种带有可变箱大小的减小直方图算法，而不是循环遍历所有数据点，以找到区分的特征阈值。该算法应用于支持向量机（SVM）模型上，用于预测一个人是否健康。它显著提高了SVM结果的TP并减少了FP （例如，FP减少了90%，而TP仅损失了5%）。图搜索自动生成了39个排序的区分路径。",
    "tldr": "本研究提出了一种用于二分类问题的快速图搜索算法，通过动态优化和减少直方图的方法来提高区分结果。该算法在支持向量机模型的基础上应用，显著提高了真正例并减少了假正例。"
}