{
    "title": "Expiring Assets in Automated Market Makers. (arXiv:2401.04289v1 [cs.GT])",
    "abstract": "An automated market maker (AMM) is a state machine that manages pools of assets, allowing parties to buy and sell those assets according to a fixed mathematical formula. AMMs are typically implemented as smart contracts on blockchains, and its prices are kept in line with the overall market price by arbitrage: if the AMM undervalues an asset with respect to the market, an \"arbitrageur\" can make a risk-free profit by buying just enough of that asset to bring the AMM's price back in line with the market.  AMMs, however, are not designed for assets that expire: that is, assets that cannot be produced or resold after a specified date. As assets approach expiration, arbitrage may not be able to reconcile supply and demand, and the liquidity providers that funded the AMM may have excessive exposure to risk due to rapid price variations.  This paper formally describes the design of a decentralized exchange (DEX) for assets that expire, combining aspects of AMMs and limit-order books. We ensur",
    "link": "http://arxiv.org/abs/2401.04289",
    "context": "Title: Expiring Assets in Automated Market Makers. (arXiv:2401.04289v1 [cs.GT])\nAbstract: An automated market maker (AMM) is a state machine that manages pools of assets, allowing parties to buy and sell those assets according to a fixed mathematical formula. AMMs are typically implemented as smart contracts on blockchains, and its prices are kept in line with the overall market price by arbitrage: if the AMM undervalues an asset with respect to the market, an \"arbitrageur\" can make a risk-free profit by buying just enough of that asset to bring the AMM's price back in line with the market.  AMMs, however, are not designed for assets that expire: that is, assets that cannot be produced or resold after a specified date. As assets approach expiration, arbitrage may not be able to reconcile supply and demand, and the liquidity providers that funded the AMM may have excessive exposure to risk due to rapid price variations.  This paper formally describes the design of a decentralized exchange (DEX) for assets that expire, combining aspects of AMMs and limit-order books. We ensur",
    "path": "papers/24/01/2401.04289.json",
    "total_tokens": 930,
    "translated_title": "自动化市场交易者中的到期资产",
    "translated_abstract": "自动化市场交易者(AMM)是一种管理资产池的状态机，根据固定的数学公式，允许各方购买和出售这些资产。AMM通常是在区块链上实现为智能合约，通过套利与整体市场价格保持一致：如果AMM对市场的资产估值不足，\"套利者\" 可以通过购买足够的资产来使AMM的价格与市场保持一致，以无风险的利润。然而，AMM不适用于到期的资产：即在指定日期之后无法生产或转售的资产。随着资产接近到期，套利可能无法协调供求关系，而为AMM提供资金的流动性供应商也可能因价格快速波动而面临过度风险暴露。本文正式描述了一种用于到期资产的去中心化交易所(DEX)的设计，结合了AMM和限价单簿的特点。我们确保...",
    "tldr": "这篇论文描述了一种针对到期资产的去中心化交易所的设计，结合了自动化市场交易者(AMM)和限价单簿的特点，并解决了到期资产在AMM中无法套利和流动性供应商面临过度风险暴露的问题。"
}