{
    "title": "Unveiling Comparative Sentiments in Vietnamese Product Reviews: A Sequential Classification Framework. (arXiv:2401.01108v1 [cs.CL])",
    "abstract": "Comparative opinion mining is a specialized field of sentiment analysis that aims to identify and extract sentiments expressed comparatively. To address this task, we propose an approach that consists of solving three sequential sub-tasks: (i) identifying comparative sentence, i.e., if a sentence has a comparative meaning, (ii) extracting comparative elements, i.e., what are comparison subjects, objects, aspects, predicates, and (iii) classifying comparison types which contribute to a deeper comprehension of user sentiments in Vietnamese product reviews. Our method is ranked fifth at the Vietnamese Language and Speech Processing (VLSP) 2023 challenge on Comparative Opinion Mining (ComOM) from Vietnamese Product Reviews.",
    "link": "http://arxiv.org/abs/2401.01108",
    "context": "Title: Unveiling Comparative Sentiments in Vietnamese Product Reviews: A Sequential Classification Framework. (arXiv:2401.01108v1 [cs.CL])\nAbstract: Comparative opinion mining is a specialized field of sentiment analysis that aims to identify and extract sentiments expressed comparatively. To address this task, we propose an approach that consists of solving three sequential sub-tasks: (i) identifying comparative sentence, i.e., if a sentence has a comparative meaning, (ii) extracting comparative elements, i.e., what are comparison subjects, objects, aspects, predicates, and (iii) classifying comparison types which contribute to a deeper comprehension of user sentiments in Vietnamese product reviews. Our method is ranked fifth at the Vietnamese Language and Speech Processing (VLSP) 2023 challenge on Comparative Opinion Mining (ComOM) from Vietnamese Product Reviews.",
    "path": "papers/24/01/2401.01108.json",
    "total_tokens": 800,
    "translated_title": "揭示越南产品评论中的比较情感：一种顺序分类框架",
    "translated_abstract": "比较意见挖掘是情感分析的一个专门领域，旨在识别和提取表达比较情感的内容。为了解决这个任务，我们提出了一种方法，包括解决三个顺序子任务：（一）识别比较句，即判断句子是否具有比较意义，（二）提取比较元素，即比较主体、对象、方面、谓词是什么，（三）分类比较类型，从而更深入地理解越南产品评论中用户的情感。我们的方法在越南语言和语音处理（VLSP）2023挑战赛的比较意见挖掘（ComOM）任务中排名第五。",
    "tldr": "该论文提出了一种串联分类框架，用于揭示越南产品评论中的比较情感。该方法包括解决三个顺序子任务，即识别比较句、提取比较元素和分类比较类型。研究结果在越南语言和语音处理挑战赛中取得了第五名的成绩。",
    "en_tdlr": "This paper proposes a sequential classification framework to unveil the comparative sentiments in Vietnamese product reviews. The method addresses three sequential sub-tasks: identifying comparative sentences, extracting comparative elements, and classifying comparison types. The research achieved the fifth rank in the Vietnamese Language and Speech Processing challenge on Comparative Opinion Mining."
}