{
    "title": "CaRiNG: Learning Temporal Causal Representation under Non-Invertible Generation Process. (arXiv:2401.14535v1 [cs.LG])",
    "abstract": "Identifying the underlying time-delayed latent causal processes in sequential data is vital for grasping temporal dynamics and making downstream reasoning. While some recent methods can robustly identify these latent causal variables, they rely on strict assumptions about the invertible generation process from latent variables to observed data. However, these assumptions are often hard to satisfy in real-world applications containing information loss. For instance, the visual perception process translates a 3D space into 2D images, or the phenomenon of persistence of vision incorporates historical data into current perceptions. To address this challenge, we establish an identifiability theory that allows for the recovery of independent latent components even when they come from a nonlinear and non-invertible mix. Using this theory as a foundation, we propose a principled approach, CaRiNG, to learn the CAusal RepresentatIon of Non-invertible Generative temporal data with identifiability",
    "link": "http://arxiv.org/abs/2401.14535",
    "context": "Title: CaRiNG: Learning Temporal Causal Representation under Non-Invertible Generation Process. (arXiv:2401.14535v1 [cs.LG])\nAbstract: Identifying the underlying time-delayed latent causal processes in sequential data is vital for grasping temporal dynamics and making downstream reasoning. While some recent methods can robustly identify these latent causal variables, they rely on strict assumptions about the invertible generation process from latent variables to observed data. However, these assumptions are often hard to satisfy in real-world applications containing information loss. For instance, the visual perception process translates a 3D space into 2D images, or the phenomenon of persistence of vision incorporates historical data into current perceptions. To address this challenge, we establish an identifiability theory that allows for the recovery of independent latent components even when they come from a nonlinear and non-invertible mix. Using this theory as a foundation, we propose a principled approach, CaRiNG, to learn the CAusal RepresentatIon of Non-invertible Generative temporal data with identifiability",
    "path": "papers/24/01/2401.14535.json",
    "total_tokens": 908,
    "translated_title": "CaRiNG: 在非可逆生成过程下学习时间因果表示",
    "translated_abstract": "鉴别顺序数据中潜在的延迟时间因果过程对于把握时间动力学和进行下游推理至关重要。尽管最近的一些方法可以稳健地识别这些潜在的因果变量，但它们依赖于从潜在变量到观测数据的可逆生成过程的严格假设。然而，这些假设通常在包含信息损失的现实应用中难以满足。例如，视觉感知过程将3D空间转化为2D图像，或者视觉坚持现象在当前感知中融入历史数据。为了解决这个挑战，我们建立了一个可辨识性理论，允许在非线性和非可逆混合情况下恢复独立的潜在组分。在此理论基础上，我们提出了一种基于原则的方法，CaRiNG，用于学习具有可辨识性的非可逆生成时间数据的因果表示。",
    "tldr": "CaRiNG提出了一种基于可辨识性理论的方法，用于学习具有非可逆生成过程的时间因果表示。这种方法能够恢复独立的潜在组分，即使它们来自于非线性且非可逆的混合过程。",
    "en_tdlr": "CaRiNG proposes a method based on identifiability theory to learn the causal representation of time under non-invertible generation processes. This approach can recover independent latent components even when they come from nonlinear and non-invertible mixtures."
}