{
    "title": "Morality is Non-Binary: Building a Pluralist Moral Sentence Embedding Space using Contrastive Learning",
    "abstract": "Recent advances in NLP show that language models retain a discernible level of knowledge in deontological ethics and moral norms. However, existing works often treat morality as binary, ranging from right to wrong. This simplistic view does not capture the nuances of moral judgment. Pluralist moral philosophers argue that human morality can be deconstructed into a finite number of elements, respecting individual differences in moral judgment. In line with this view, we build a pluralist moral sentence embedding space via a state-of-the-art contrastive learning approach. We systematically investigate the embedding space by studying the emergence of relationships among moral elements, both quantitatively and qualitatively. Our results show that a pluralist approach to morality can be captured in an embedding space. However, moral pluralism is challenging to deduce via self-supervision alone and requires a supervised approach with human labels.",
    "link": "https://arxiv.org/abs/2401.17228",
    "context": "Title: Morality is Non-Binary: Building a Pluralist Moral Sentence Embedding Space using Contrastive Learning\nAbstract: Recent advances in NLP show that language models retain a discernible level of knowledge in deontological ethics and moral norms. However, existing works often treat morality as binary, ranging from right to wrong. This simplistic view does not capture the nuances of moral judgment. Pluralist moral philosophers argue that human morality can be deconstructed into a finite number of elements, respecting individual differences in moral judgment. In line with this view, we build a pluralist moral sentence embedding space via a state-of-the-art contrastive learning approach. We systematically investigate the embedding space by studying the emergence of relationships among moral elements, both quantitatively and qualitatively. Our results show that a pluralist approach to morality can be captured in an embedding space. However, moral pluralism is challenging to deduce via self-supervision alone and requires a supervised approach with human labels.",
    "path": "papers/24/01/2401.17228.json",
    "total_tokens": 917,
    "translated_title": "道德不是二元的：利用对比学习构建一种多元道德句子嵌入空间",
    "translated_abstract": "最近自然语言处理的进展表明，语言模型在德性伦理学和道德规范方面保留了可辨识的知识水平。然而，现有研究常常将道德视为二元的，从对错两个极端进行划分。这种简化的观点没有捕捉到道德判断的微妙差别。多元道德哲学家认为，人类道德可以被分解为有限数量的要素，并尊重道德判断的个体差异。为了与这一观点保持一致，我们利用最先进的对比学习方法构建了一个多元道德句子嵌入空间。我们通过定量和定性的研究来系统地调查嵌入空间中道德要素之间的关系的出现。我们的研究结果表明，多元道德的方法可以在嵌入空间中捕捉到。然而，单凭自主学习很难推断出道德多元主义，需要有人工标签的监督方法。",
    "tldr": "通过对比学习，我们构建了一个多元道德句子嵌入空间，通过定量和定性的研究，证明了多元道德的方法可以在嵌入空间中捕捉到，但单凭自主学习很难推断出道德多元主义。",
    "en_tdlr": "We build a pluralist moral sentence embedding space using contrastive learning, and through quantitative and qualitative studies, demonstrate that this approach can capture moral pluralism in the embedding space, though it is difficult to deduce via self-supervision alone."
}