{
    "title": "Gain Scheduling with a Neural Operator for a Transport PDE with Nonlinear Recirculation. (arXiv:2401.02511v1 [eess.SY])",
    "abstract": "To stabilize PDE models, control laws require space-dependent functional gains mapped by nonlinear operators from the PDE functional coefficients. When a PDE is nonlinear and its \"pseudo-coefficient\" functions are state-dependent, a gain-scheduling (GS) nonlinear design is the simplest approach to the design of nonlinear feedback. The GS version of PDE backstepping employs gains obtained by solving a PDE at each value of the state. Performing such PDE computations in real time may be prohibitive. The recently introduced neural operators (NO) can be trained to produce the gain functions, rapidly in real time, for each state value, without requiring a PDE solution. In this paper we introduce NOs for GS-PDE backstepping. GS controllers act on the premise that the state change is slow and, as a result, guarantee only local stability, even for ODEs. We establish local stabilization of hyperbolic PDEs with nonlinear recirculation using both a \"full-kernel\" approach and the \"gain-only\" approa",
    "link": "http://arxiv.org/abs/2401.02511",
    "context": "Title: Gain Scheduling with a Neural Operator for a Transport PDE with Nonlinear Recirculation. (arXiv:2401.02511v1 [eess.SY])\nAbstract: To stabilize PDE models, control laws require space-dependent functional gains mapped by nonlinear operators from the PDE functional coefficients. When a PDE is nonlinear and its \"pseudo-coefficient\" functions are state-dependent, a gain-scheduling (GS) nonlinear design is the simplest approach to the design of nonlinear feedback. The GS version of PDE backstepping employs gains obtained by solving a PDE at each value of the state. Performing such PDE computations in real time may be prohibitive. The recently introduced neural operators (NO) can be trained to produce the gain functions, rapidly in real time, for each state value, without requiring a PDE solution. In this paper we introduce NOs for GS-PDE backstepping. GS controllers act on the premise that the state change is slow and, as a result, guarantee only local stability, even for ODEs. We establish local stabilization of hyperbolic PDEs with nonlinear recirculation using both a \"full-kernel\" approach and the \"gain-only\" approa",
    "path": "papers/24/01/2401.02511.json",
    "total_tokens": 878,
    "translated_title": "使用神经算子的增益调度方法处理具有非线性循环的输运PDE",
    "translated_abstract": "为了稳定PDE模型，控制律需要通过非线性算子将空间相关的增益映射到PDE函数系数上。当PDE是非线性的且\"伪系数\"函数依赖于状态时，增益调度非线性设计是处理非线性反馈设计的最简单方法。PDE回溯的增益调度版本利用在每个状态值处求解PDE得到的增益。但是在实时情况下进行这种PDE计算可能是困难的。最近引入的神经算子（NO）可以在每个状态值上快速且实时地训练，产生增益函数，而无需求解PDE。本文介绍了将NO用于GS-PDE回溯的方法。GS控制器假设状态变化缓慢，并且仅保证局部稳定性，即使对于ODE也是如此。我们通过\"全核\"方法和\"仅增益\"方法，确立了具有非线性循环的双曲型PDE的局部稳定性。",
    "tldr": "本文介绍了使用神经算子进行增益调度的方法来处理具有非线性循环的输运PDE，并在局部实现了稳定。",
    "en_tdlr": "This paper introduces the use of neural operators for gain scheduling to handle transport PDEs with nonlinear recirculation and achieves local stabilization."
}