{
    "title": "Near-Optimal Policy Optimization for Correlated Equilibrium in General-Sum Markov Games. (arXiv:2401.15240v1 [cs.LG])",
    "abstract": "We study policy optimization algorithms for computing correlated equilibria in multi-player general-sum Markov Games. Previous results achieve $O(T^{-1/2})$ convergence rate to a correlated equilibrium and an accelerated $O(T^{-3/4})$ convergence rate to the weaker notion of coarse correlated equilibrium. In this paper, we improve both results significantly by providing an uncoupled policy optimization algorithm that attains a near-optimal $\\tilde{O}(T^{-1})$ convergence rate for computing a correlated equilibrium. Our algorithm is constructed by combining two main elements (i) smooth value updates and (ii) the optimistic-follow-the-regularized-leader algorithm with the log barrier regularizer.",
    "link": "http://arxiv.org/abs/2401.15240",
    "context": "Title: Near-Optimal Policy Optimization for Correlated Equilibrium in General-Sum Markov Games. (arXiv:2401.15240v1 [cs.LG])\nAbstract: We study policy optimization algorithms for computing correlated equilibria in multi-player general-sum Markov Games. Previous results achieve $O(T^{-1/2})$ convergence rate to a correlated equilibrium and an accelerated $O(T^{-3/4})$ convergence rate to the weaker notion of coarse correlated equilibrium. In this paper, we improve both results significantly by providing an uncoupled policy optimization algorithm that attains a near-optimal $\\tilde{O}(T^{-1})$ convergence rate for computing a correlated equilibrium. Our algorithm is constructed by combining two main elements (i) smooth value updates and (ii) the optimistic-follow-the-regularized-leader algorithm with the log barrier regularizer.",
    "path": "papers/24/01/2401.15240.json",
    "total_tokens": 877,
    "translated_title": "协方差均衡的近最优策略优化在一般性和的马尔可夫博弈中的应用",
    "translated_abstract": "我们研究了用于计算多人一般性和的马尔可夫博弈中的协方差均衡的策略优化算法。之前的结果实现了$O(T^{-1/2})$收敛速度到协方差均衡和$O(T^{-3/4})$加速收敛速度到较弱的疏松协方差均衡。在本文中，我们通过提供一个非耦合策略优化算法，显著改进了这两个结果，使其达到计算协方差均衡的近最优$\\tilde{O}(T^{-1})$收敛速度。我们的算法通过结合两个主要因素（i）平滑的价值更新和（ii）具有对数障碍正则化器的乐观实行者算法构建而成。",
    "tldr": "本文提出了一个协方差均衡的近最优策略优化算法，通过结合平滑价值更新和乐观实行者算法，以及对数障碍正则化器，实现了在一般性和的马尔可夫博弈中计算协方差均衡的近最优收敛速度$\\tilde{O}(T^{-1})$。",
    "en_tdlr": "This paper presents a near-optimal policy optimization algorithm for computing correlated equilibria in general-sum Markov games, achieving a near-optimal convergence rate of $\\tilde{O}(T^{-1})$ by combining smooth value updates, the optimistic-follow-the-regularized-leader algorithm, and the log barrier regularizer."
}