{
    "title": "Efficiency in random allocation with ordinal rules. (arXiv:2401.11899v1 [econ.TH])",
    "abstract": "We study ordinal rules for allocating indivisible goods via lottery. Ordinality requires a rule to consider only how agents rank degenerate lotteries and may be necessitated by cognitive, informational, or as we show, incentive constraints. The limited responsiveness of ordinal rules to agents' preferences means that they can only satisfy welfare properties based on first order stochastic dominance, which is incomplete.  We define a new efficiency concept for ordinal rules. While ordinality and efficiency together are incompatible with the usual notions of fairness and somewhat limit randomization, they does leave room for a rich class of rules. We demonstrate this through a characterization of all ordinal, efficient, strategy-proof, non-bossy, boundedly invariant, and neutral rules.",
    "link": "http://arxiv.org/abs/2401.11899",
    "context": "Title: Efficiency in random allocation with ordinal rules. (arXiv:2401.11899v1 [econ.TH])\nAbstract: We study ordinal rules for allocating indivisible goods via lottery. Ordinality requires a rule to consider only how agents rank degenerate lotteries and may be necessitated by cognitive, informational, or as we show, incentive constraints. The limited responsiveness of ordinal rules to agents' preferences means that they can only satisfy welfare properties based on first order stochastic dominance, which is incomplete.  We define a new efficiency concept for ordinal rules. While ordinality and efficiency together are incompatible with the usual notions of fairness and somewhat limit randomization, they does leave room for a rich class of rules. We demonstrate this through a characterization of all ordinal, efficient, strategy-proof, non-bossy, boundedly invariant, and neutral rules.",
    "path": "papers/24/01/2401.11899.json",
    "total_tokens": 813,
    "translated_title": "随机分配中的顺序规则效率",
    "translated_abstract": "我们研究了通过抽签分配不可分割商品的顺序规则。顺序性要求规则仅考虑代理人对非凡抽签的排序方式，并且可能受认知、信息或者我们展示的激励约束的限制。顺序规则对代理人偏好的有限响应性意味着它们只能满足基于一阶随机优势的福利性质，这是不完整的。我们为顺序规则定义了一种新的效率概念。尽管顺序性和效率在一起与通常的公平概念不兼容，并且在一定程度上限制了随机化，它们仍为一类丰富的规则留下了空间。通过对所有顺序、效率、策略可证明、非霸占、有界不变和中立规则的刻画，我们证明了这一点。",
    "tldr": "该论文研究了通过抽签分配不可分割商品的顺序规则，并定义了一种新的效率概念。尽管顺序性和效率在一起与公平概念不兼容，但它们允许存在一类丰富的规则。"
}