{
    "title": "Object Attribute Matters in Visual Question Answering. (arXiv:2401.09442v1 [cs.CV])",
    "abstract": "Visual question answering is a multimodal task that requires the joint comprehension of visual and textual information. However, integrating visual and textual semantics solely through attention layers is insufficient to comprehensively understand and align information from both modalities. Intuitively, object attributes can naturally serve as a bridge to unify them, which has been overlooked in previous research. In this paper, we propose a novel VQA approach from the perspective of utilizing object attribute, aiming to achieve better object-level visual-language alignment and multimodal scene understanding. Specifically, we design an attribute fusion module and a contrastive knowledge distillation module. The attribute fusion module constructs a multimodal graph neural network to fuse attributes and visual features through message passing. The enhanced object-level visual features contribute to solving fine-grained problem like counting-question. The better object-level visual-langua",
    "link": "http://arxiv.org/abs/2401.09442",
    "context": "Title: Object Attribute Matters in Visual Question Answering. (arXiv:2401.09442v1 [cs.CV])\nAbstract: Visual question answering is a multimodal task that requires the joint comprehension of visual and textual information. However, integrating visual and textual semantics solely through attention layers is insufficient to comprehensively understand and align information from both modalities. Intuitively, object attributes can naturally serve as a bridge to unify them, which has been overlooked in previous research. In this paper, we propose a novel VQA approach from the perspective of utilizing object attribute, aiming to achieve better object-level visual-language alignment and multimodal scene understanding. Specifically, we design an attribute fusion module and a contrastive knowledge distillation module. The attribute fusion module constructs a multimodal graph neural network to fuse attributes and visual features through message passing. The enhanced object-level visual features contribute to solving fine-grained problem like counting-question. The better object-level visual-langua",
    "path": "papers/24/01/2401.09442.json",
    "total_tokens": 839,
    "translated_title": "物体属性在视觉问答中的重要性",
    "translated_abstract": "视觉问答是一种需要对视觉和文本信息进行联合理解的多模态任务。然而，仅通过注意力层来整合视觉和文本语义是不足以全面理解和对齐两种模态的信息的。直观地说，物体属性可以自然地作为一个桥梁来统一它们，这在以前的研究中被忽视了。在本文中，我们从利用物体属性的角度提出了一种新的VQA方法，旨在实现更好的物体级视觉语言对齐和多模态场景理解。具体地，我们设计了一个属性融合模块和一个对比知识蒸馏模块。属性融合模块通过信息传递构建了一个多模态图神经网络，用于融合属性和视觉特征。增强的物体级视觉特征有助于解决诸如计数问题等细粒度问题。",
    "tldr": "本论文提出了一种新的视觉问答方法，通过利用物体属性来实现更好的物体级视觉语言对齐和多模态场景理解。具体地，设计了属性融合模块和对比知识蒸馏模块，通过信息传递构建了一个多模态图神经网络，提高了物体级视觉特征，从而解决了细粒度问题。"
}