{
    "title": "HEQuant: Marrying Homomorphic Encryption and Quantization for Communication-Efficient Private Inference",
    "abstract": "Secure two-party computation with homomorphic encryption (HE) protects data privacy with a formal security guarantee but suffers from high communication overhead. While previous works, e.g., Cheetah, Iron, etc, have proposed efficient HE-based protocols for different neural network (NN) operations, they still assume high precision, e.g., fixed point 37 bit, for the NN operations and ignore NNs' native robustness against quantization error. In this paper, we propose HEQuant, which features low-precision-quantization-aware optimization for the HE-based protocols. We observe the benefit of a naive combination of quantization and HE quickly saturates as bit precision goes down. Hence, to further improve communication efficiency, we propose a series of optimizations, including an intra-coefficient packing algorithm and a quantization-aware tiling algorithm, to simultaneously reduce the number and precision of the transferred data. Compared with prior-art HE-based protocols, e.g., CrypTFlow2",
    "link": "https://arxiv.org/abs/2401.15970",
    "context": "Title: HEQuant: Marrying Homomorphic Encryption and Quantization for Communication-Efficient Private Inference\nAbstract: Secure two-party computation with homomorphic encryption (HE) protects data privacy with a formal security guarantee but suffers from high communication overhead. While previous works, e.g., Cheetah, Iron, etc, have proposed efficient HE-based protocols for different neural network (NN) operations, they still assume high precision, e.g., fixed point 37 bit, for the NN operations and ignore NNs' native robustness against quantization error. In this paper, we propose HEQuant, which features low-precision-quantization-aware optimization for the HE-based protocols. We observe the benefit of a naive combination of quantization and HE quickly saturates as bit precision goes down. Hence, to further improve communication efficiency, we propose a series of optimizations, including an intra-coefficient packing algorithm and a quantization-aware tiling algorithm, to simultaneously reduce the number and precision of the transferred data. Compared with prior-art HE-based protocols, e.g., CrypTFlow2",
    "path": "papers/24/01/2401.15970.json",
    "total_tokens": 909,
    "translated_title": "HEQuant: 结合同态加密和量化以实现通信高效的私有推断",
    "translated_abstract": "带有同态加密（HE）的安全双方计算使用形式化的安全保证保护数据隐私，但通信开销较高。虽然先前的研究，如Cheetah、Iron等，已经提出了用于不同神经网络（NN）操作的高效HE协议，但它们仍假设NN操作需要高精度，例如固定点37位，并忽视了NN对量化误差的固有鲁棒性。在本文中，我们提出了HEQuant，它具有针对HE协议的低精度量化感知优化。我们观察到，在位精度降低时，量化和HE的简单组合好处迅速饱和。因此，为了进一步提高通信效率，我们提出了一系列优化措施，包括一种内部系数打包算法和一种量化感知瓦片算法，以同时减少传输数据的数量和精度。与先前的HE协议（如CrypTFlow2）相比，",
    "tldr": "HEQuant提出了一种结合同态加密和量化的方法，以实现通信高效的私有推断。通过低精度量化感知优化和一系列其他优化措施，HEQuant相对于先前的HE协议有效地降低了数据传输的数量和精度。",
    "en_tdlr": "HEQuant proposes a method that combines homomorphic encryption and quantization for communication-efficient private inference. By introducing low-precision quantization-aware optimization and a series of other optimizations, HEQuant effectively reduces both the quantity and precision of the transferred data compared to prior HE protocols."
}