{
    "title": "HOSC: A Periodic Activation Function for Preserving Sharp Features in Implicit Neural Representations. (arXiv:2401.10967v1 [cs.NE])",
    "abstract": "Recently proposed methods for implicitly representing signals such as images, scenes, or geometries using coordinate-based neural network architectures often do not leverage the choice of activation functions, or do so only to a limited extent. In this paper, we introduce the Hyperbolic Oscillation function (HOSC), a novel activation function with a controllable sharpness parameter. Unlike any previous activations, HOSC has been specifically designed to better capture sudden changes in the input signal, and hence sharp or acute features of the underlying data, as well as smooth low-frequency transitions. Due to its simplicity and modularity, HOSC offers a plug-and-play functionality that can be easily incorporated into any existing method employing a neural network as a way of implicitly representing a signal. We benchmark HOSC against other popular activations in an array of general tasks, empirically showing an improvement in the quality of obtained representations, provide the mathe",
    "link": "http://arxiv.org/abs/2401.10967",
    "context": "Title: HOSC: A Periodic Activation Function for Preserving Sharp Features in Implicit Neural Representations. (arXiv:2401.10967v1 [cs.NE])\nAbstract: Recently proposed methods for implicitly representing signals such as images, scenes, or geometries using coordinate-based neural network architectures often do not leverage the choice of activation functions, or do so only to a limited extent. In this paper, we introduce the Hyperbolic Oscillation function (HOSC), a novel activation function with a controllable sharpness parameter. Unlike any previous activations, HOSC has been specifically designed to better capture sudden changes in the input signal, and hence sharp or acute features of the underlying data, as well as smooth low-frequency transitions. Due to its simplicity and modularity, HOSC offers a plug-and-play functionality that can be easily incorporated into any existing method employing a neural network as a way of implicitly representing a signal. We benchmark HOSC against other popular activations in an array of general tasks, empirically showing an improvement in the quality of obtained representations, provide the mathe",
    "path": "papers/24/01/2401.10967.json",
    "total_tokens": 879,
    "translated_title": "HOSC:一种用于保留隐式神经表示中锐利特征的周期性激活函数",
    "translated_abstract": "最近提出的用于用基于坐标的神经网络架构隐式表示信号（例如图像，场景或几何体）的方法通常不利用选择激活函数，或者仅在一定程度上利用。在本文中，我们引入了一种名为Hyperbolic Oscillation function (HOSC) 的新型激活函数，该函数具有可控的锐利度参数。与以往的激活函数不同，HOSC专门设计用于更好地捕捉输入信号中的突变，从而捕捉底层数据的锐利或急剧特征，以及平滑的低频过渡。由于其简单性和模块化性，HOSC提供了一种插入式功能，可以轻松地将其纳入任何使用神经网络作为隐式表示信号的方法中。我们在一系列通用任务中将HOSC与其他常用的激活函数进行了基准测试，实证显示了所得到表示的质量的改善，并提供了数学证明。",
    "tldr": "HOSC是一种新型的激活函数，专门设计用于捕捉输入信号中的锐利特征和低频过渡。它可以在隐式神经网络表示中提供改善质量的插入式功能。"
}