{
    "title": "Taming Mode Collapse in Score Distillation for Text-to-3D Generation. (arXiv:2401.00909v1 [cs.CV])",
    "abstract": "Despite the remarkable performance of score distillation in text-to-3D generation, such techniques notoriously suffer from view inconsistency issues, also known as \"Janus\" artifact, where the generated objects fake each view with multiple front faces. Although empirically effective methods have approached this problem via score debiasing or prompt engineering, a more rigorous perspective to explain and tackle this problem remains elusive. In this paper, we reveal that the existing score distillation-based text-to-3D generation frameworks degenerate to maximal likelihood seeking on each view independently and thus suffer from the mode collapse problem, manifesting as the Janus artifact in practice. To tame mode collapse, we improve score distillation by re-establishing in entropy term in the corresponding variational objective, which is applied to the distribution of rendered images. Maximizing the entropy encourages diversity among different views in generated 3D assets, thereby mitiga",
    "link": "http://arxiv.org/abs/2401.00909",
    "context": "Title: Taming Mode Collapse in Score Distillation for Text-to-3D Generation. (arXiv:2401.00909v1 [cs.CV])\nAbstract: Despite the remarkable performance of score distillation in text-to-3D generation, such techniques notoriously suffer from view inconsistency issues, also known as \"Janus\" artifact, where the generated objects fake each view with multiple front faces. Although empirically effective methods have approached this problem via score debiasing or prompt engineering, a more rigorous perspective to explain and tackle this problem remains elusive. In this paper, we reveal that the existing score distillation-based text-to-3D generation frameworks degenerate to maximal likelihood seeking on each view independently and thus suffer from the mode collapse problem, manifesting as the Janus artifact in practice. To tame mode collapse, we improve score distillation by re-establishing in entropy term in the corresponding variational objective, which is applied to the distribution of rendered images. Maximizing the entropy encourages diversity among different views in generated 3D assets, thereby mitiga",
    "path": "papers/24/01/2401.00909.json",
    "total_tokens": 884,
    "translated_title": "Score Distillation在文本到3D生成中解决模式崩溃的方法",
    "translated_abstract": "尽管Score Distillation在文本到3D生成中表现出色，但这些技术普遍存在视图一致性问题，也被称为“Janus”伪像，即生成的对象伪造了多个前视图。虽然已经有一些经验有效的方法通过去偏置或者引导工程来解决这个问题，但对于这个问题的更严格的解释和解决方法仍然很难找到。在本文中，我们揭示了现有的基于Score Distillation的文本到3D生成框架陷入了在每个视图上独立最大似然求解的最大似然模式崩溃问题，实践中表现为Janus伪像。为了避免模式崩溃，我们通过在相应变分目标中重新引入熵项，对渲染图像的分布进行改进。最大化熵鼓励生成的3D模型在不同视图之间具有多样性，从而缓解了模式崩溃问题。",
    "tldr": "本文揭示了现有的基于Score Distillation的文本到3D生成框架存在模式崩溃问题，通过在变分目标中加入熵项来改进生成的3D模型的多样性，解决了Janus伪像问题。",
    "en_tdlr": "This paper reveals the mode collapse problem in existing score distillation-based text-to-3D generation frameworks, and proposes an improvement by incorporating an entropy term in the variational objective to enhance the diversity of generated 3D assets and mitigate the Janus artifact."
}