{
    "title": "Collaborative Learning with Artificial Intelligence Speakers (CLAIS): Pre-Service Elementary Science Teachers' Responses to the Prototype. (arXiv:2401.05400v1 [cs.CY])",
    "abstract": "This research aims to demonstrate that AI can function not only as a tool for learning, but also as an intelligent agent with which humans can engage in collaborative learning (CL) to change epistemic practices in science classrooms. We adopted a design and development research approach, following the Analysis, Design, Development, Implementation and Evaluation (ADDIE) model, to prototype a tangible instructional system called Collaborative Learning with AI Speakers (CLAIS). The CLAIS system is designed to have 3-4 human learners join an AI speaker to form a small group, where humans and AI are considered as peers participating in the Jigsaw learning process. The development was carried out using the NUGU AI speaker platform. The CLAIS system was successfully implemented in a Science Education course session with 15 pre-service elementary science teachers. The participants evaluated the CLAIS system through mixed methods surveys as teachers, learners, peers, and users. Quantitative dat",
    "link": "http://arxiv.org/abs/2401.05400",
    "context": "Title: Collaborative Learning with Artificial Intelligence Speakers (CLAIS): Pre-Service Elementary Science Teachers' Responses to the Prototype. (arXiv:2401.05400v1 [cs.CY])\nAbstract: This research aims to demonstrate that AI can function not only as a tool for learning, but also as an intelligent agent with which humans can engage in collaborative learning (CL) to change epistemic practices in science classrooms. We adopted a design and development research approach, following the Analysis, Design, Development, Implementation and Evaluation (ADDIE) model, to prototype a tangible instructional system called Collaborative Learning with AI Speakers (CLAIS). The CLAIS system is designed to have 3-4 human learners join an AI speaker to form a small group, where humans and AI are considered as peers participating in the Jigsaw learning process. The development was carried out using the NUGU AI speaker platform. The CLAIS system was successfully implemented in a Science Education course session with 15 pre-service elementary science teachers. The participants evaluated the CLAIS system through mixed methods surveys as teachers, learners, peers, and users. Quantitative dat",
    "path": "papers/24/01/2401.05400.json",
    "total_tokens": 1021,
    "translated_title": "与人工智能说话者的协同学习（CLAIS）：预备小学科学教师对原型的反应",
    "translated_abstract": "该研究旨在证明人工智能不仅可以作为学习工具，还可以作为一个智能代理，与人类共同参与协同学习，以改变科学课堂中的认识实践。我们采用设计与开发研究方法，遵循分析、设计、开发、实施和评估（ADDIE）模型，原型一个名为协同学习与AI说话者（CLAIS）的实物教学系统。CLAIS系统旨在让3-4个人类学习者与一个人工智能说话者组成一个小组，在Jigsaw学习过程中将人类与AI视为同伴。开发使用了NUGU AI说话者平台。CLAIS系统在一个预备小学科学教师的科学教育课程中成功实施。参与者作为教师、学习者、同伴和用户通过混合方法调查评估了CLAIS系统。定量数据表明，参与者积极评价CLAIS系统的使用体验和学习成果。",
    "tldr": "该研究证明了人工智能不仅可以作为学习工具，还可以作为一个智能代理，与人类一起参与协同学习，改变科学课堂中的认识实践。通过开发一个名为CLAIS的实物教学系统，结合人类学习者和人工智能说话者的协同学习过程，该系统成功应用在预备小学科学教师的课程中，并得到积极评价。",
    "en_tdlr": "This research demonstrates that AI can function as both a learning tool and an intelligent agent in collaborative learning, leading to changes in epistemic practices in science classrooms. The study developed a tangible instructional system called CLAIS, which successfully implemented collaborative learning between human learners and AI speakers in a Science Education course for pre-service elementary science teachers. The system received positive evaluations from participants."
}