{
    "title": "TeLeS: Temporal Lexeme Similarity Score to Estimate Confidence in End-to-End ASR. (arXiv:2401.03251v1 [eess.AS])",
    "abstract": "Confidence estimation of predictions from an End-to-End (E2E) Automatic Speech Recognition (ASR) model benefits ASR's downstream and upstream tasks. Class-probability-based confidence scores do not accurately represent the quality of overconfident ASR predictions. An ancillary Confidence Estimation Model (CEM) calibrates the predictions. State-of-the-art (SOTA) solutions use binary target scores for CEM training. However, the binary labels do not reveal the granular information of predicted words, such as temporal alignment between reference and hypothesis and whether the predicted word is entirely incorrect or contains spelling errors. Addressing this issue, we propose a novel Temporal-Lexeme Similarity (TeLeS) confidence score to train CEM. To address the data imbalance of target scores while training CEM, we use shrinkage loss to focus on hard-to-learn data points and minimise the impact of easily learned data points. We conduct experiments with ASR models trained in three languages",
    "link": "http://arxiv.org/abs/2401.03251",
    "context": "Title: TeLeS: Temporal Lexeme Similarity Score to Estimate Confidence in End-to-End ASR. (arXiv:2401.03251v1 [eess.AS])\nAbstract: Confidence estimation of predictions from an End-to-End (E2E) Automatic Speech Recognition (ASR) model benefits ASR's downstream and upstream tasks. Class-probability-based confidence scores do not accurately represent the quality of overconfident ASR predictions. An ancillary Confidence Estimation Model (CEM) calibrates the predictions. State-of-the-art (SOTA) solutions use binary target scores for CEM training. However, the binary labels do not reveal the granular information of predicted words, such as temporal alignment between reference and hypothesis and whether the predicted word is entirely incorrect or contains spelling errors. Addressing this issue, we propose a novel Temporal-Lexeme Similarity (TeLeS) confidence score to train CEM. To address the data imbalance of target scores while training CEM, we use shrinkage loss to focus on hard-to-learn data points and minimise the impact of easily learned data points. We conduct experiments with ASR models trained in three languages",
    "path": "papers/24/01/2401.03251.json",
    "total_tokens": 953,
    "translated_title": "TeLeS：用于估计端到端ASR信任度的时态词元相似度分数",
    "translated_abstract": "从端到端（E2E）自动语音识别（ASR）模型的预测中得出信心估计有助于ASR的下游和上游任务。基于类别概率的置信度得分不能准确地表示过于自信的ASR预测的质量。辅助置信度估计模型（CEM）可校准这些预测。最先进的解决方案使用二进制目标得分进行CEM训练。然而，二进制标签不能揭示预测词的细粒度信息，如参考语音和假设语音之间的时态对齐以及预测词是否完全错误或包含拼写错误。为解决这个问题，我们提出了一种新的时态词元相似度（TeLeS）置信度分数来训练CEM。为了解决CEM训练中目标得分的数据不平衡问题，我们使用缩减损失来聚焦于难以学习的数据点并最小化轻易学习的数据点的影响。我们在三种语言训练的ASR模型上进行了实验。",
    "tldr": "本论文提出了一种用于估计端到端ASR信任度的时态词元相似度分数TeLeS，并用缩减损失来解决CEM训练中目标得分数据不平衡的问题。",
    "en_tdlr": "This paper proposes a novel Temporal-Lexeme Similarity (TeLeS) confidence score to estimate confidence in End-to-End ASR predictions, and uses shrinkage loss to address the data imbalance issue in Confidence Estimation Model (CEM) training."
}