{
    "title": "Interpretable Solutions for Breast Cancer Diagnosis with Grammatical Evolution and Data Augmentation. (arXiv:2401.14255v1 [cs.LG])",
    "abstract": "Medical imaging diagnosis increasingly relies on Machine Learning (ML) models. This is a task that is often hampered by severely imbalanced datasets, where positive cases can be quite rare. Their use is further compromised by their limited interpretability, which is becoming increasingly important. While post-hoc interpretability techniques such as SHAP and LIME have been used with some success on so-called black box models, the use of inherently understandable models makes such endeavors more fruitful. This paper addresses these issues by demonstrating how a relatively new synthetic data generation technique, STEM, can be used to produce data to train models produced by Grammatical Evolution (GE) that are inherently understandable. STEM is a recently introduced combination of the Synthetic Minority Oversampling Technique (SMOTE), Edited Nearest Neighbour (ENN), and Mixup; it has previously been successfully used to tackle both between class and within class imbalance issues. We test o",
    "link": "http://arxiv.org/abs/2401.14255",
    "context": "Title: Interpretable Solutions for Breast Cancer Diagnosis with Grammatical Evolution and Data Augmentation. (arXiv:2401.14255v1 [cs.LG])\nAbstract: Medical imaging diagnosis increasingly relies on Machine Learning (ML) models. This is a task that is often hampered by severely imbalanced datasets, where positive cases can be quite rare. Their use is further compromised by their limited interpretability, which is becoming increasingly important. While post-hoc interpretability techniques such as SHAP and LIME have been used with some success on so-called black box models, the use of inherently understandable models makes such endeavors more fruitful. This paper addresses these issues by demonstrating how a relatively new synthetic data generation technique, STEM, can be used to produce data to train models produced by Grammatical Evolution (GE) that are inherently understandable. STEM is a recently introduced combination of the Synthetic Minority Oversampling Technique (SMOTE), Edited Nearest Neighbour (ENN), and Mixup; it has previously been successfully used to tackle both between class and within class imbalance issues. We test o",
    "path": "papers/24/01/2401.14255.json",
    "total_tokens": 867,
    "translated_title": "使用语法演化和数据增强的可解释乳腺癌诊断方案",
    "translated_abstract": "医学影像诊断越来越依赖机器学习模型。然而，这个任务常常受到严重不平衡的数据集的困扰，其中阳性病例可能非常罕见。而它们的可解释性又非常有限，这一点越来越重要。尽管事后解释技术（如SHAP和LIME）在所谓的黑盒模型上已经有一定的成功，但使用内在可理解的模型会使这些努力更加有成效。本文通过展示如何利用一种相对较新的合成数据生成技术STEM，用于产生用语法演化产生的可解释模型所需的训练数据，来解决这些问题。STEM是一种最近引入的合成少数类过采样技术（SMOTE）、编辑最近邻（ENN）和混合的组合；它先前已成功用于解决类别间和类别内不平衡问题。",
    "tldr": "本文通过结合语法演化和数据增强方案，利用合成数据生成技术STEM来训练可解释的乳腺癌诊断模型，解决了数据不平衡和模型可解释性的问题。",
    "en_tdlr": "This paper addresses the problems of data imbalance and limited interpretability in medical imaging diagnosis by combining grammatical evolution and data augmentation methods, using the synthetic data generation technique STEM to train interpretable breast cancer diagnosis models."
}