{
    "title": "Graph-based Active Learning for Entity Cluster Repair. (arXiv:2401.14992v1 [cs.LG])",
    "abstract": "Cluster repair methods aim to determine errors in clusters and modify them so that each cluster consists of records representing the same entity. Current cluster repair methodologies primarily assume duplicate-free data sources, where each record from one source corresponds to a unique record from another. However, real-world data often deviates from this assumption due to quality issues. Recent approaches apply clustering methods in combination with link categorization methods so they can be applied to data sources with duplicates. Nevertheless, the results do not show a clear picture since the quality highly varies depending on the configuration and dataset. In this study, we introduce a novel approach for cluster repair that utilizes graph metrics derived from the underlying similarity graphs. These metrics are pivotal in constructing a classification model to distinguish between correct and incorrect edges. To address the challenge of limited training data, we integrate an active l",
    "link": "http://arxiv.org/abs/2401.14992",
    "context": "Title: Graph-based Active Learning for Entity Cluster Repair. (arXiv:2401.14992v1 [cs.LG])\nAbstract: Cluster repair methods aim to determine errors in clusters and modify them so that each cluster consists of records representing the same entity. Current cluster repair methodologies primarily assume duplicate-free data sources, where each record from one source corresponds to a unique record from another. However, real-world data often deviates from this assumption due to quality issues. Recent approaches apply clustering methods in combination with link categorization methods so they can be applied to data sources with duplicates. Nevertheless, the results do not show a clear picture since the quality highly varies depending on the configuration and dataset. In this study, we introduce a novel approach for cluster repair that utilizes graph metrics derived from the underlying similarity graphs. These metrics are pivotal in constructing a classification model to distinguish between correct and incorrect edges. To address the challenge of limited training data, we integrate an active l",
    "path": "papers/24/01/2401.14992.json",
    "total_tokens": 853,
    "translated_title": "基于图的实体聚类修复的主动学习方法",
    "translated_abstract": "聚类修复方法旨在确定聚类中的错误并修改它们，以使每个聚类包含代表同一实体的记录。当前的聚类修复方法主要假设数据源中没有重复记录，即每个来自一种数据源的记录对应于另一种数据源的唯一记录。然而，现实世界的数据往往不符合这一假设，由于质量问题。最近的方法将聚类方法与链接分类方法结合起来，以便可以应用于具有重复记录的数据源。然而，结果并没有展现出清晰的图片，因为质量在很大程度上取决于配置和数据集。在本研究中，我们介绍了一种利用基础相似性图推导的图度量的新方法进行聚类修复。这些度量在构建分类模型时起着关键作用，用于区分正确和错误的边。为了解决数据训练不足的挑战，我们还整合了一种主动学习方法。",
    "tldr": "本文介绍了一种基于图的主动学习方法，用于修复实体聚类中的错误，该方法利用了基础相似性图推导出的图度量，并结合了主动学习来解决数据训练不足的挑战。",
    "en_tdlr": "This paper introduces a graph-based active learning approach for repairing errors in entity clusters, which utilizes graph metrics derived from underlying similarity graphs and incorporates active learning to address the challenge of limited training data."
}