{
    "title": "Machine Learning to Promote Translational Research: Predicting Patent and Clinical Trial Inclusion in Dementia Research. (arXiv:2401.05145v1 [cs.LG])",
    "abstract": "Projected to impact 1.6 million people in the UK by 2040 and costing {\\pounds}25 billion annually, dementia presents a growing challenge to society. This study, a pioneering effort to predict the translational potential of dementia research using machine learning, hopes to address the slow translation of fundamental discoveries into practical applications despite dementia's significant societal and economic impact. We used the Dimensions database to extract data from 43,091 UK dementia research publications between the years 1990-2023, specifically metadata (authors, publication year etc.), concepts mentioned in the paper, and the paper abstract. To prepare the data for machine learning we applied methods such as one hot encoding and/or word embeddings. We trained a CatBoost Classifier to predict if a publication will be cited in a future patent or clinical trial. We trained several model variations. The model combining metadata, concept, and abstract embeddings yielded the highest per",
    "link": "http://arxiv.org/abs/2401.05145",
    "context": "Title: Machine Learning to Promote Translational Research: Predicting Patent and Clinical Trial Inclusion in Dementia Research. (arXiv:2401.05145v1 [cs.LG])\nAbstract: Projected to impact 1.6 million people in the UK by 2040 and costing {\\pounds}25 billion annually, dementia presents a growing challenge to society. This study, a pioneering effort to predict the translational potential of dementia research using machine learning, hopes to address the slow translation of fundamental discoveries into practical applications despite dementia's significant societal and economic impact. We used the Dimensions database to extract data from 43,091 UK dementia research publications between the years 1990-2023, specifically metadata (authors, publication year etc.), concepts mentioned in the paper, and the paper abstract. To prepare the data for machine learning we applied methods such as one hot encoding and/or word embeddings. We trained a CatBoost Classifier to predict if a publication will be cited in a future patent or clinical trial. We trained several model variations. The model combining metadata, concept, and abstract embeddings yielded the highest per",
    "path": "papers/24/01/2401.05145.json",
    "total_tokens": 952,
    "translated_title": "机器学习推动转化研究：预测痴呆研究中的专利和临床试验收录",
    "translated_abstract": "预计到2040年，痴呆症将影响英国160万人，并每年耗费250亿英镑，给社会带来日益增长的挑战。本研究是一项开创性的尝试，利用机器学习来预测痴呆研究的转化潜力，并希望解决尽管痴呆症对社会和经济具有重要影响，但基础发现转化为实际应用的速度较慢的问题。我们使用Dimensions数据库提取了1990-2023年之间43,091篇英国痴呆研究出版物的数据，包括元数据（作者、出版年等）、论文中提到的概念以及论文摘要。为了为机器学习准备数据，我们应用了诸如one hot编码和/或词嵌入等方法。我们训练了一个CatBoost分类器来预测一篇论文是否会被引用在未来的专利或临床试验中。我们训练了几种不同的模型变体。结合元数据、概念和摘要的嵌入模型产生了最高的per",
    "tldr": "通过利用机器学习预测痴呆研究的转化潜力，这项开创性研究有望解决痴呆研究从基础发现到实际应用转化速度较慢的问题。",
    "en_tdlr": "This pioneering study aims to address the slow translation of dementia research by using machine learning to predict translational potential."
}