{
    "title": "Multi-Source Collaborative Gradient Discrepancy Minimization for Federated Domain Generalization. (arXiv:2401.10272v1 [cs.CV])",
    "abstract": "Federated Domain Generalization aims to learn a domain-invariant model from multiple decentralized source domains for deployment on unseen target domain. Due to privacy concerns, the data from different source domains are kept isolated, which poses challenges in bridging the domain gap. To address this issue, we propose a Multi-source Collaborative Gradient Discrepancy Minimization (MCGDM) method for federated domain generalization. Specifically, we propose intra-domain gradient matching between the original images and augmented images to avoid overfitting the domain-specific information within isolated domains. Additionally, we propose inter-domain gradient matching with the collaboration of other domains, which can further reduce the domain shift across decentralized domains. Combining intra-domain and inter-domain gradient matching, our method enables the learned model to generalize well on unseen domains. Furthermore, our method can be extended to the federated domain adaptation ta",
    "link": "http://arxiv.org/abs/2401.10272",
    "context": "Title: Multi-Source Collaborative Gradient Discrepancy Minimization for Federated Domain Generalization. (arXiv:2401.10272v1 [cs.CV])\nAbstract: Federated Domain Generalization aims to learn a domain-invariant model from multiple decentralized source domains for deployment on unseen target domain. Due to privacy concerns, the data from different source domains are kept isolated, which poses challenges in bridging the domain gap. To address this issue, we propose a Multi-source Collaborative Gradient Discrepancy Minimization (MCGDM) method for federated domain generalization. Specifically, we propose intra-domain gradient matching between the original images and augmented images to avoid overfitting the domain-specific information within isolated domains. Additionally, we propose inter-domain gradient matching with the collaboration of other domains, which can further reduce the domain shift across decentralized domains. Combining intra-domain and inter-domain gradient matching, our method enables the learned model to generalize well on unseen domains. Furthermore, our method can be extended to the federated domain adaptation ta",
    "path": "papers/24/01/2401.10272.json",
    "total_tokens": 954,
    "translated_title": "联合多源梯度差异最小化用于联邦域泛化",
    "translated_abstract": "联邦域泛化旨在从多个分散的源域学习一个域不变的模型，以在未知的目标域上进行部署。由于隐私问题，来自不同源域的数据被保持隔离，这在弥合域差距方面带来了挑战。为解决这个问题，我们提出了一种联合多源梯度差异最小化（MCGDM）方法用于联邦域泛化。具体而言，我们提出了原始图像和增强图像之间的域内梯度匹配，以避免对隔离域内的域特定信息进行过拟合。此外，我们提出了在其他域的协作下进行域间梯度匹配，可以进一步减少分散域之间的域偏移。通过结合域内和域间梯度匹配，我们的方法使得学习的模型能够在未知域上具有良好的泛化能力。此外，我们的方法可以扩展到联邦域适应任务。",
    "tldr": "本文提出了一种名为联合多源梯度差异最小化的方法，用于联邦域泛化。该方法通过域内和域间梯度匹配的方式，减少了来自不同源域的数据隔离所带来的域差距，从而使得学习的模型能够在未知域上具有良好的泛化能力。",
    "en_tdlr": "This paper proposes a method called Multi-Source Collaborative Gradient Discrepancy Minimization for Federated Domain Generalization. The method reduces the domain shift by matching gradients within and across domains, enabling the learned model to generalize well on unseen domains."
}