{
    "title": "Performance Insights-based AI-driven Football Transfer Fee Prediction. (arXiv:2401.16795v1 [cs.LG])",
    "abstract": "We developed an artificial intelligence approach to predict the transfer fee of a football player. This model can help clubs make better decisions about which players to buy and sell, which can lead to improved performance and increased club budgets. Having collected data on player performance, transfer fees, and other factors that might affect a player's value, we then used this data to train a machine learning model that can accurately predict a player's impact on the game. We further passed the obtained results as one of the features to the predictor of transfer fees. The model can help clubs identify players who are undervalued and who could be sold for a profit. It can also help clubs avoid overpaying for players. We believe that our model can be a valuable tool for football clubs. It can help them make better decisions about player recruitment and transfers.",
    "link": "http://arxiv.org/abs/2401.16795",
    "context": "Title: Performance Insights-based AI-driven Football Transfer Fee Prediction. (arXiv:2401.16795v1 [cs.LG])\nAbstract: We developed an artificial intelligence approach to predict the transfer fee of a football player. This model can help clubs make better decisions about which players to buy and sell, which can lead to improved performance and increased club budgets. Having collected data on player performance, transfer fees, and other factors that might affect a player's value, we then used this data to train a machine learning model that can accurately predict a player's impact on the game. We further passed the obtained results as one of the features to the predictor of transfer fees. The model can help clubs identify players who are undervalued and who could be sold for a profit. It can also help clubs avoid overpaying for players. We believe that our model can be a valuable tool for football clubs. It can help them make better decisions about player recruitment and transfers.",
    "path": "papers/24/01/2401.16795.json",
    "total_tokens": 843,
    "translated_title": "基于性能洞察的人工智能驱动的足球转会费用预测",
    "translated_abstract": "我们开发了一种人工智能方法来预测足球球员的转会费用。该模型可以帮助俱乐部在购买和出售球员时做出更好的决策，从而提高表现和增加俱乐部预算。通过收集球员表现、转会费用和其他可能影响球员价值的因素的数据，我们训练了一个能够准确预测球员对比赛影响的机器学习模型。我们进一步将所得结果作为转会费用预测器的特征之一。该模型可以帮助俱乐部识别被低估的球员，并在出售时获得利润。它还可以帮助俱乐部避免为球员支付过高费用。我们相信我们的模型可以成为足球俱乐部的有价值工具，为他们在球员招募和转会方面做出更好的决策。",
    "tldr": "该研究开发了一种利用人工智能的方法，可以预测足球球员的转会费用。这可以帮助俱乐部做出更好的决策，提高表现并增加俱乐部的预算。"
}