{
    "title": "LangBridge: Multilingual Reasoning Without Multilingual Supervision. (arXiv:2401.10695v1 [cs.CL])",
    "abstract": "We introduce LangBridge, a zero-shot approach to adapt language models for multilingual reasoning tasks without multilingual supervision. LangBridge operates by bridging two models, each specialized in different aspects: (1) one specialized in understanding multiple languages (e.g., mT5 encoder) and (2) one specialized in reasoning (e.g., Orca 2). LangBridge connects the two models by introducing minimal trainable parameters between them. Despite utilizing only English data for training, LangBridge considerably enhances the performance of language models on low-resource languages across mathematical reasoning, coding, and logical reasoning. Our analysis suggests that the efficacy of LangBridge stems from the language-agnostic characteristics of multilingual representations. We publicly release our code and models.",
    "link": "http://arxiv.org/abs/2401.10695",
    "context": "Title: LangBridge: Multilingual Reasoning Without Multilingual Supervision. (arXiv:2401.10695v1 [cs.CL])\nAbstract: We introduce LangBridge, a zero-shot approach to adapt language models for multilingual reasoning tasks without multilingual supervision. LangBridge operates by bridging two models, each specialized in different aspects: (1) one specialized in understanding multiple languages (e.g., mT5 encoder) and (2) one specialized in reasoning (e.g., Orca 2). LangBridge connects the two models by introducing minimal trainable parameters between them. Despite utilizing only English data for training, LangBridge considerably enhances the performance of language models on low-resource languages across mathematical reasoning, coding, and logical reasoning. Our analysis suggests that the efficacy of LangBridge stems from the language-agnostic characteristics of multilingual representations. We publicly release our code and models.",
    "path": "papers/24/01/2401.10695.json",
    "total_tokens": 787,
    "translated_title": "LangBridge: 无多语言监督的多语言推理方法",
    "translated_abstract": "我们引入LangBridge，这是一种零监督方式，用于适应多语言推理任务，无需多语言监督。LangBridge通过连接两个模型来运作，每个模型专门处理不同方面：(1)一个专门处理多种语言的模型（例如mT5编码器），和(2)一个专门处理推理的模型（例如Orca 2）。LangBridge通过在两个模型之间引入最少的可训练参数来连接它们。尽管只利用英文数据进行训练，但LangBridge显著提升了语言模型在数学推理、编码和逻辑推理方面对低资源语言的性能。我们的分析表明，LangBridge的有效性源于多语言表示的不受语言限制的特性。我们公开发布了我们的代码和模型。",
    "tldr": "LangBridge是一种无需多语言监督的多语言推理方法，通过连接两个模型来适应多语言推理任务，尽管只使用英文数据进行训练，但它显著提高了语言模型对低资源语言的性能。",
    "en_tdlr": "LangBridge is a multilingual reasoning method that does not require multilingual supervision. It adapts to multilingual reasoning tasks by connecting two models, and despite being trained only on English data, it considerably enhances the performance of language models on low-resource languages."
}