{
    "title": "Decentralized Federated Learning: A Survey on Security and Privacy",
    "abstract": "Federated learning has been rapidly evolving and gaining popularity in recent years due to its privacy-preserving features, among other advantages. Nevertheless, the exchange of model updates and gradients in this architecture provides new attack surfaces for malicious users of the network which may jeopardize the model performance and user and data privacy. For this reason, one of the main motivations for decentralized federated learning is to eliminate server-related threats by removing the server from the network and compensating for it through technologies such as blockchain. However, this advantage comes at the cost of challenging the system with new privacy threats. Thus, performing a thorough security analysis in this new paradigm is necessary. This survey studies possible variations of threats and adversaries in decentralized federated learning and overviews the potential defense mechanisms. Trustability and verifiability of decentralized federated learning are also considered ",
    "link": "https://arxiv.org/abs/2401.17319",
    "context": "Title: Decentralized Federated Learning: A Survey on Security and Privacy\nAbstract: Federated learning has been rapidly evolving and gaining popularity in recent years due to its privacy-preserving features, among other advantages. Nevertheless, the exchange of model updates and gradients in this architecture provides new attack surfaces for malicious users of the network which may jeopardize the model performance and user and data privacy. For this reason, one of the main motivations for decentralized federated learning is to eliminate server-related threats by removing the server from the network and compensating for it through technologies such as blockchain. However, this advantage comes at the cost of challenging the system with new privacy threats. Thus, performing a thorough security analysis in this new paradigm is necessary. This survey studies possible variations of threats and adversaries in decentralized federated learning and overviews the potential defense mechanisms. Trustability and verifiability of decentralized federated learning are also considered ",
    "path": "papers/24/01/2401.17319.json",
    "total_tokens": 834,
    "translated_title": "去中心化联邦学习：安全与隐私综述",
    "translated_abstract": "联邦学习由于其保护隐私等优势，在近年来迅速发展并受到广泛关注。然而，在这种架构中，模型更新和梯度的交换为网络中的恶意用户提供了新的攻击面，可能危及模型性能以及用户和数据的隐私。因此，去中心化联邦学习的主要动机之一是通过去除服务器并通过区块链等技术进行补偿来消除与服务器相关的威胁。然而，这种优势却以挑战系统面临新的隐私威胁为代价。因此，对这种新范 paradigm，并进行全面的安全分析是必要的。这项调查研究了去中心化联邦学习中可能存在的威胁和对手变化，并概述了潜在的防御机制。还考虑了去中心化联邦学习的可信度和验证性。",
    "tldr": "去中心化联邦学习架构允许保护隐私，但也引入了新的安全和隐私威胁，该综述对去中心化联邦学习中的威胁、对手和防御机制进行了研究。",
    "en_tdlr": "Decentralized federated learning architecture enables privacy protection but introduces new security and privacy threats. This survey investigates threats, adversaries, and defense mechanisms in decentralized federated learning."
}