{
    "title": "UCorrect: An Unsupervised Framework for Automatic Speech Recognition Error Correction. (arXiv:2401.05689v1 [cs.CL])",
    "abstract": "Error correction techniques have been used to refine the output sentences from automatic speech recognition (ASR) models and achieve a lower word error rate (WER). Previous works usually adopt end-to-end models and has strong dependency on Pseudo Paired Data and Original Paired Data. But when only pre-training on Pseudo Paired Data, previous models have negative effect on correction. While fine-tuning on Original Paired Data, the source side data must be transcribed by a well-trained ASR model, which takes a lot of time and not universal. In this paper, we propose UCorrect, an unsupervised Detector-Generator-Selector framework for ASR Error Correction. UCorrect has no dependency on the training data mentioned before. The whole procedure is first to detect whether the character is erroneous, then to generate some candidate characters and finally to select the most confident one to replace the error character. Experiments on the public AISHELL-1 dataset and WenetSpeech dataset show the e",
    "link": "http://arxiv.org/abs/2401.05689",
    "context": "Title: UCorrect: An Unsupervised Framework for Automatic Speech Recognition Error Correction. (arXiv:2401.05689v1 [cs.CL])\nAbstract: Error correction techniques have been used to refine the output sentences from automatic speech recognition (ASR) models and achieve a lower word error rate (WER). Previous works usually adopt end-to-end models and has strong dependency on Pseudo Paired Data and Original Paired Data. But when only pre-training on Pseudo Paired Data, previous models have negative effect on correction. While fine-tuning on Original Paired Data, the source side data must be transcribed by a well-trained ASR model, which takes a lot of time and not universal. In this paper, we propose UCorrect, an unsupervised Detector-Generator-Selector framework for ASR Error Correction. UCorrect has no dependency on the training data mentioned before. The whole procedure is first to detect whether the character is erroneous, then to generate some candidate characters and finally to select the most confident one to replace the error character. Experiments on the public AISHELL-1 dataset and WenetSpeech dataset show the e",
    "path": "papers/24/01/2401.05689.json",
    "total_tokens": 899,
    "translated_title": "UCorrect: 一种用于自动语音识别错误校正的无监督框架",
    "translated_abstract": "错误校正技术已被用于改进自动语音识别（ASR）模型的输出句子，实现更低的词错误率（WER）。以往的工作通常采用端到端模型，并对伪配对数据和原始配对数据有强烈依赖。但仅在伪配对数据上进行预训练时，以往的模型会对校正产生负面影响。而在原始配对数据上进行微调时，源侧数据必须由一个经过良好训练的ASR模型转录，这需要很长时间且不通用。本文提出了UCorrect，一种用于ASR错误校正的无监督Detector-Generator-Selector框架。UCorrect对之前提到的训练数据没有依赖。整个过程首先检测字符是否有误，然后生成一些候选字符，最后选择最可信的一个来替换错误字符。在公共的AISHELL-1数据集和WenetSpeech数据集上的实验证明了这种方法的有效性。",
    "tldr": "UCorrect是一种用于自动语音识别错误校正的无监督框架，通过检测、生成和选择的过程来替换错误字符，无需依赖特定的训练数据，实验证明其有效性。"
}