{
    "title": "Predicting Viral Rumors and Vulnerable Users for Infodemic Surveillance. (arXiv:2401.09724v1 [cs.SI])",
    "abstract": "In the age of the infodemic, it is crucial to have tools for effectively monitoring the spread of rampant rumors that can quickly go viral, as well as identifying vulnerable users who may be more susceptible to spreading such misinformation. This proactive approach allows for timely preventive measures to be taken, mitigating the negative impact of false information on society. We propose a novel approach to predict viral rumors and vulnerable users using a unified graph neural network model. We pre-train network-based user embeddings and leverage a cross-attention mechanism between users and posts, together with a community-enhanced vulnerability propagation (CVP) method to improve user and propagation graph representations. Furthermore, we employ two multi-task training strategies to mitigate negative transfer effects among tasks in different settings, enhancing the overall performance of our approach. We also construct two datasets with ground-truth annotations on information virali",
    "link": "http://arxiv.org/abs/2401.09724",
    "context": "Title: Predicting Viral Rumors and Vulnerable Users for Infodemic Surveillance. (arXiv:2401.09724v1 [cs.SI])\nAbstract: In the age of the infodemic, it is crucial to have tools for effectively monitoring the spread of rampant rumors that can quickly go viral, as well as identifying vulnerable users who may be more susceptible to spreading such misinformation. This proactive approach allows for timely preventive measures to be taken, mitigating the negative impact of false information on society. We propose a novel approach to predict viral rumors and vulnerable users using a unified graph neural network model. We pre-train network-based user embeddings and leverage a cross-attention mechanism between users and posts, together with a community-enhanced vulnerability propagation (CVP) method to improve user and propagation graph representations. Furthermore, we employ two multi-task training strategies to mitigate negative transfer effects among tasks in different settings, enhancing the overall performance of our approach. We also construct two datasets with ground-truth annotations on information virali",
    "path": "papers/24/01/2401.09724.json",
    "total_tokens": 897,
    "translated_title": "预测病毒谣言和易受攻击用户的信息传播监测方法",
    "translated_abstract": "在信息疫情时代，有效监测迅速传播的疯狂谣言，并识别易受攻击的用户，对于及时采取预防措施，减轻虚假信息对社会的负面影响至关重要。我们提出了一种新颖的方法来预测病毒谣言和易受攻击的用户，使用统一的图神经网络模型。我们预先训练基于网络的用户嵌入，并利用用户和帖子之间的交叉注意机制，以及一个增强社区传播脆弱性的方法来改进用户和传播图的表示。此外，我们采用两种多任务训练策略来减轻不同设置中任务之间的负面转移效应，提高方法的整体性能。我们还构建了两个包含具体标注信息的数据集，用于验证信息传播的真实性。",
    "tldr": "该论文提出了一种预测病毒谣言和易受攻击用户的新方法，通过使用统一的图神经网络模型，并结合预训练的用户嵌入、交叉注意机制和增强社区传播脆弱性的方法来改进表示，以及采用多任务训练策略来提高性能。"
}