{
    "title": "Synthetic Dialogue Dataset Generation using LLM Agents",
    "abstract": "Linear programming (LP) problems are pervasive in real-life applications. However, despite their apparent simplicity, an untrained user may find it difficult to determine the linear model of their specific problem. We envisage the creation of a goal-oriented conversational agent that will engage in conversation with the user to elicit all information required so that a subsequent agent can generate the linear model. In this paper, we present an approach for the generation of sample dialogues that can be used to develop and train such a conversational agent. Using prompt engineering, we develop two agents that \"talk\" to each other, one acting as the conversational agent, and the other acting as the user. Using a set of text descriptions of linear problems from NL4Opt available to the user only, the agent and the user engage in conversation until the agent has retrieved all key information from the original problem description. We also propose an extrinsic evaluation of the dialogues by ",
    "link": "https://arxiv.org/abs/2401.17461",
    "context": "Title: Synthetic Dialogue Dataset Generation using LLM Agents\nAbstract: Linear programming (LP) problems are pervasive in real-life applications. However, despite their apparent simplicity, an untrained user may find it difficult to determine the linear model of their specific problem. We envisage the creation of a goal-oriented conversational agent that will engage in conversation with the user to elicit all information required so that a subsequent agent can generate the linear model. In this paper, we present an approach for the generation of sample dialogues that can be used to develop and train such a conversational agent. Using prompt engineering, we develop two agents that \"talk\" to each other, one acting as the conversational agent, and the other acting as the user. Using a set of text descriptions of linear problems from NL4Opt available to the user only, the agent and the user engage in conversation until the agent has retrieved all key information from the original problem description. We also propose an extrinsic evaluation of the dialogues by ",
    "path": "papers/24/01/2401.17461.json",
    "total_tokens": 808,
    "translated_title": "使用LLM智能体生成合成对话数据集",
    "translated_abstract": "线性规划问题在现实生活中应用广泛。然而，尽管表面上简单，但未经训练的用户可能难以确定其特定问题的线性模型。我们设想创建一个目标导向的对话智能体，与用户进行交流，以获取生成线性模型所需的所有信息，从而建立一个后续的智能体。在本文中，我们提出了一种用于生成可以用于开发和训练这样一个对话智能体的示例对话的方法。通过启发式设计，我们开发了两个相互“对话”的智能体，一个充当对话智能体，另一个充当用户。使用仅对用户可见的一组线性问题文本描述，智能体和用户进行对话，直到智能体从原始问题描述中获取到所有关键信息。我们还提出了对话的外部评估方法。",
    "tldr": "本文提出了使用LLM智能体生成合成对话数据集的方法，通过对话智能体和用户进行交流来获取生成线性模型所需的关键信息，并提出了对话的外部评估方法。",
    "en_tdlr": "This paper presents a method for generating synthetic dialogue dataset using LLM agents, where the conversational agent engages in dialogue with the user to retrieve key information for generating linear models. The paper also proposes an extrinsic evaluation method for the dialogues."
}