{
    "title": "MLCommons Cloud Masking Benchmark with Early Stopping. (arXiv:2401.08636v1 [cs.DC])",
    "abstract": "In this paper, we report on work performed for the MLCommons Science Working Group on the cloud masking benchmark. MLCommons is a consortium that develops and maintains several scientific benchmarks that aim to benefit developments in AI. The benchmarks are conducted on the High Performance Computing (HPC) Clusters of New York University and University of Virginia, as well as a commodity desktop. We provide a description of the cloud masking benchmark, as well as a summary of our submission to MLCommons on the benchmark experiment we conducted. It includes a modification to the reference implementation of the cloud masking benchmark enabling early stopping. This benchmark is executed on the NYU HPC through a custom batch script that runs the various experiments through the batch queuing system while allowing for variation on the number of epochs trained. Our submission includes the modified code, a custom batch script to modify epochs, documentation, and the benchmark results. We repor",
    "link": "http://arxiv.org/abs/2401.08636",
    "context": "Title: MLCommons Cloud Masking Benchmark with Early Stopping. (arXiv:2401.08636v1 [cs.DC])\nAbstract: In this paper, we report on work performed for the MLCommons Science Working Group on the cloud masking benchmark. MLCommons is a consortium that develops and maintains several scientific benchmarks that aim to benefit developments in AI. The benchmarks are conducted on the High Performance Computing (HPC) Clusters of New York University and University of Virginia, as well as a commodity desktop. We provide a description of the cloud masking benchmark, as well as a summary of our submission to MLCommons on the benchmark experiment we conducted. It includes a modification to the reference implementation of the cloud masking benchmark enabling early stopping. This benchmark is executed on the NYU HPC through a custom batch script that runs the various experiments through the batch queuing system while allowing for variation on the number of epochs trained. Our submission includes the modified code, a custom batch script to modify epochs, documentation, and the benchmark results. We repor",
    "path": "papers/24/01/2401.08636.json",
    "total_tokens": 842,
    "translated_title": "MLCommons云遮挡基准测试与提前停止",
    "translated_abstract": "本文报告了MLCommons科学工作组在云遮挡基准测试上的工作。 MLCommons是一个联盟，开发和维护几个科学基准测试，旨在促进人工智能的发展。这些基准测试在纽约大学和弗吉尼亚大学的高性能计算（HPC）集群以及普通桌面上进行。我们提供了云遮挡基准测试的描述，并对我们在MLCommons基准测试实验中的提交进行了总结。它包括对云遮挡基准测试的参考实现的修改，以实现提前停止。该基准测试通过自定义批处理脚本在纽约大学的HPC上执行，该批处理脚本通过批处理队列系统运行各种实验，并允许对训练轮数进行变化。我们的提交包括修改后的代码，自定义的批处理脚本来修改训练轮数，文档和基准测试结果。",
    "tldr": "本文报告了MLCommons科学工作组在云遮挡基准测试上的工作，包括对云遮挡基准测试的参考实现的修改，以实现提前停止。"
}