{
    "title": "The Key Artificial Intelligence Technologies in Early Childhood Education: A Review. (arXiv:2401.05403v1 [cs.CY])",
    "abstract": "Artificial Intelligence (AI) technologies have been applied in various domains, including early childhood education (ECE). Integration of AI educational technology is a recent significant trend in ECE. Currently, there are more and more studies of AI in ECE. To date, there is a lack of survey articles that discuss the studies of AI in ECE. In this paper, we provide an up-to-date and in-depth overview of the key AI technologies in ECE that provides a historical perspective, summarizes the representative works, outlines open questions, discusses the trends and challenges through a detailed bibliometric analysis, and provides insightful recommendations for future research. We mainly discuss the studies that apply AI-based robots and AI technologies to ECE, including improving the social interaction of children with an autism spectrum disorder. This paper significantly contributes to provide an up-to-date and in-depth survey that is suitable as introductory material for beginners to AI in ",
    "link": "http://arxiv.org/abs/2401.05403",
    "context": "Title: The Key Artificial Intelligence Technologies in Early Childhood Education: A Review. (arXiv:2401.05403v1 [cs.CY])\nAbstract: Artificial Intelligence (AI) technologies have been applied in various domains, including early childhood education (ECE). Integration of AI educational technology is a recent significant trend in ECE. Currently, there are more and more studies of AI in ECE. To date, there is a lack of survey articles that discuss the studies of AI in ECE. In this paper, we provide an up-to-date and in-depth overview of the key AI technologies in ECE that provides a historical perspective, summarizes the representative works, outlines open questions, discusses the trends and challenges through a detailed bibliometric analysis, and provides insightful recommendations for future research. We mainly discuss the studies that apply AI-based robots and AI technologies to ECE, including improving the social interaction of children with an autism spectrum disorder. This paper significantly contributes to provide an up-to-date and in-depth survey that is suitable as introductory material for beginners to AI in ",
    "path": "papers/24/01/2401.05403.json",
    "total_tokens": 949,
    "translated_title": "早期儿童教育中的关键人工智能技术：综述",
    "translated_abstract": "人工智能（AI）技术已被应用于各个领域，包括早期儿童教育（ECE）。AI教育技术的整合是ECE领域的一个重要趋势。目前，关于ECE中的AI研究越来越多。然而，目前还缺少讨论ECE中AI研究的综述文章。本文提供了早期儿童教育中关键AI技术的最新和深入的概述，从历史角度出发，总结了代表性的研究作品，概述了开放性问题，讨论了趋势和挑战，并通过详细的文献计量分析提供了深入的研究建议。本文主要讨论了将基于AI的机器人和AI技术应用于ECE的研究，包括改善自闭症谱系障碍儿童的社交互动。本文为初学者提供了一份适用的最新和深入的调研综述材料。",
    "tldr": "本研究对早期儿童教育中关键AI技术进行了最新和深入的综述，包括基于AI的机器人和AI技术改善自闭症儿童的社交互动等。这对初学者来说是一份适用的综述材料。",
    "en_tdlr": "This study provides an up-to-date and in-depth overview of the key AI technologies in early childhood education, including AI-based robots and AI technologies for improving social interaction in children with autism spectrum disorder. It serves as a suitable introductory material for beginners in AI."
}