{
    "title": "A Comparative Analysis on Metaheuristic Algorithms Based Vision Transformer Model for Early Detection of Alzheimer's Disease. (arXiv:2401.09795v1 [cs.NE])",
    "abstract": "A number of life threatening neuro-degenerative disorders had degraded the quality of life for the older generation in particular. Dementia is one such symptom which may lead to a severe condition called Alzheimer's disease if not detected at an early stage. It has been reported that the progression of such disease from a normal stage is due to the change in several parameters inside the human brain. In this paper, an innovative metaheuristic algorithms based ViT model has been proposed for the identification of dementia at different stage. A sizeable number of test data have been utilized for the validation of the proposed scheme. It has also been demonstrated that our model exhibits superior performance in terms of accuracy, precision, recall as well as F1-score.",
    "link": "http://arxiv.org/abs/2401.09795",
    "context": "Title: A Comparative Analysis on Metaheuristic Algorithms Based Vision Transformer Model for Early Detection of Alzheimer's Disease. (arXiv:2401.09795v1 [cs.NE])\nAbstract: A number of life threatening neuro-degenerative disorders had degraded the quality of life for the older generation in particular. Dementia is one such symptom which may lead to a severe condition called Alzheimer's disease if not detected at an early stage. It has been reported that the progression of such disease from a normal stage is due to the change in several parameters inside the human brain. In this paper, an innovative metaheuristic algorithms based ViT model has been proposed for the identification of dementia at different stage. A sizeable number of test data have been utilized for the validation of the proposed scheme. It has also been demonstrated that our model exhibits superior performance in terms of accuracy, precision, recall as well as F1-score.",
    "path": "papers/24/01/2401.09795.json",
    "total_tokens": 822,
    "translated_title": "基于元启发式算法的Vision Transformer模型在早期检测阿尔茨海默病上的比较分析",
    "translated_abstract": "一些致命的神经退行性疾病严重影响了老一代人的生活质量。痴呆是其中一种症状，如果不在早期阶段检测出来，可能会发展成严重的阿尔茨海默病。已经有报道称，从正常阶段到这种疾病的发展是由人脑内几个参数的改变导致的。本文提出了一种基于创新的元启发式算法的ViT模型，用于识别不同阶段的痴呆症。大量的测试数据被用来验证所提出的方案。还表明我们的模型在准确度、精确度、召回率以及F1分数等方面表现出优越的性能。",
    "tldr": "本文提出了一种基于元启发式算法的Vision Transformer模型，用于早期检测阿尔茨海默病。通过大量的测试数据验证，该模型在准确度、精确度、召回率以及F1分数等方面展现了卓越的性能。",
    "en_tdlr": "This paper proposes a metaheuristic algorithms based Vision Transformer model for early detection of Alzheimer's disease. Through extensive validation using test data, the model demonstrates superior performance in terms of accuracy, precision, recall, and F1-score."
}