{
    "title": "Training Single-Layer Morphological Perceptron Using Convex-Concave Programming. (arXiv:2401.02296v1 [cs.LG])",
    "abstract": "This paper concerns the training of a single-layer morphological perceptron using disciplined convex-concave programming (DCCP). We introduce an algorithm referred to as K-DDCCP, which combines the existing single-layer morphological perceptron (SLMP) model proposed by Ritter and Urcid with the weighted disciplined convex-concave programming (WDCCP) algorithm by Charisopoulos and Maragos. The proposed training algorithm leverages the disciplined convex-concave procedure (DCCP) and formulates a non-convex optimization problem for binary classification. To tackle this problem, the constraints are expressed as differences of convex functions, enabling the application of the DCCP package. The experimental results confirm the effectiveness of the K-DDCCP algorithm in solving binary classification problems. Overall, this work contributes to the field of morphological neural networks by proposing an algorithm that extends the capabilities of the SLMP model.",
    "link": "http://arxiv.org/abs/2401.02296",
    "context": "Title: Training Single-Layer Morphological Perceptron Using Convex-Concave Programming. (arXiv:2401.02296v1 [cs.LG])\nAbstract: This paper concerns the training of a single-layer morphological perceptron using disciplined convex-concave programming (DCCP). We introduce an algorithm referred to as K-DDCCP, which combines the existing single-layer morphological perceptron (SLMP) model proposed by Ritter and Urcid with the weighted disciplined convex-concave programming (WDCCP) algorithm by Charisopoulos and Maragos. The proposed training algorithm leverages the disciplined convex-concave procedure (DCCP) and formulates a non-convex optimization problem for binary classification. To tackle this problem, the constraints are expressed as differences of convex functions, enabling the application of the DCCP package. The experimental results confirm the effectiveness of the K-DDCCP algorithm in solving binary classification problems. Overall, this work contributes to the field of morphological neural networks by proposing an algorithm that extends the capabilities of the SLMP model.",
    "path": "papers/24/01/2401.02296.json",
    "total_tokens": 853,
    "translated_title": "使用凸凹规划训练单层形态感知器",
    "translated_abstract": "本文讨论了使用凸凹规划（DCCP）训练单层形态感知器的方法。我们提出了一种称为K-DDCCP的算法，该算法将Ritter和Urcid提出的现有单层形态感知器（SLMP）模型与Charisopoulos和Maragos提出的加权凸凹规划（WDCCP）算法相结合。所提出的训练算法利用凸凹规划过程（DCCP）并将二分类问题建模为非凸优化问题。为了解决这个问题，约束被表示为凸函数之差，从而可以应用DCCP软件包。实验结果证实了K-DDCCP算法在解决二分类问题方面的有效性。总体而言，这项工作通过提出一种扩展SLMP模型能力的算法，为形态学神经网络领域做出了贡献。",
    "tldr": "本文提出了一种使用凸凹规划训练单层形态感知器的方法，该方法通过K-DDCCP算法结合SLMP模型和WDCCP算法来解决二分类问题，并通过实验证实了其有效性。",
    "en_tdlr": "This paper proposes a method to train single-layer morphological perceptrons using convex-concave programming. The proposed K-DDCCP algorithm combines the SLMP model and the WDCCP algorithm to solve binary classification problems, and its effectiveness is confirmed through experiments."
}