{
    "title": "Demystifying Variational Diffusion Models. (arXiv:2401.06281v1 [cs.LG])",
    "abstract": "Despite the growing popularity of diffusion models, gaining a deep understanding of the model class remains somewhat elusive for the uninitiated in non-equilibrium statistical physics. With that in mind, we present what we believe is a more straightforward introduction to diffusion models using directed graphical modelling and variational Bayesian principles, which imposes relatively fewer prerequisites on the average reader. Our exposition constitutes a comprehensive technical review spanning from foundational concepts like deep latent variable models to recent advances in continuous-time diffusion-based modelling, highlighting theoretical connections between model classes along the way. We provide additional mathematical insights that were omitted in the seminal works whenever possible to aid in understanding, while avoiding the introduction of new notation. We envision this article serving as a useful educational supplement for both researchers and practitioners in the area, and we ",
    "link": "http://arxiv.org/abs/2401.06281",
    "context": "Title: Demystifying Variational Diffusion Models. (arXiv:2401.06281v1 [cs.LG])\nAbstract: Despite the growing popularity of diffusion models, gaining a deep understanding of the model class remains somewhat elusive for the uninitiated in non-equilibrium statistical physics. With that in mind, we present what we believe is a more straightforward introduction to diffusion models using directed graphical modelling and variational Bayesian principles, which imposes relatively fewer prerequisites on the average reader. Our exposition constitutes a comprehensive technical review spanning from foundational concepts like deep latent variable models to recent advances in continuous-time diffusion-based modelling, highlighting theoretical connections between model classes along the way. We provide additional mathematical insights that were omitted in the seminal works whenever possible to aid in understanding, while avoiding the introduction of new notation. We envision this article serving as a useful educational supplement for both researchers and practitioners in the area, and we ",
    "path": "papers/24/01/2401.06281.json",
    "total_tokens": 844,
    "translated_title": "揭秘变分扩散模型",
    "translated_abstract": "尽管扩散模型越来越受欢迎，但对于非平衡统计物理领域的初学者来说，对该模型类的深入理解仍然有些困难。考虑到这一点，我们通过使用有向图模型和变分贝叶斯原理，提供了一个我们认为更简单易懂的扩散模型介绍，这对于一般读者来说需要的先决条件相对较少。我们的阐述构成了一个全面的技术综述，从深度潜变量模型等基本概念到连续时间扩散模型的最新进展，突出了模型类之间的理论联系。我们尽可能地提供了在初始工作中被省略的额外数学洞察，以帮助理解，同时避免引入新的符号表示。我们希望这篇文章对于该领域的研究人员和实践者来说，能作为一个有用的教育补充材料。",
    "tldr": "该论文通过使用有向图模型和变分贝叶斯原理，揭示了变分扩散模型的原理和连接，为非专业统计物理领域的读者提供了更容易理解的介绍。",
    "en_tdlr": "This paper provides a more straightforward introduction to diffusion models using directed graphical modelling and variational Bayesian principles, highlighting theoretical connections between model classes, and aims to be a useful educational supplement for non-experts in statistical physics."
}