{
    "title": "Communication-Efficient Multimodal Federated Learning: Joint Modality and Client Selection. (arXiv:2401.16685v1 [cs.LG])",
    "abstract": "Multimodal federated learning (FL) aims to enrich model training in FL settings where clients are collecting measurements across multiple modalities. However, key challenges to multimodal FL remain unaddressed, particularly in heterogeneous network settings where: (i) the set of modalities collected by each client will be diverse, and (ii) communication limitations prevent clients from uploading all their locally trained modality models to the server. In this paper, we propose multimodal Federated learning with joint Modality and Client selection (mmFedMC), a new FL methodology that can tackle the above-mentioned challenges in multimodal settings. The joint selection algorithm incorporates two main components: (a) A modality selection methodology for each client, which weighs (i) the impact of the modality, gauged by Shapley value analysis, (ii) the modality model size as a gauge of communication overhead, against (iii) the frequency of modality model updates, denoted recency, to enhan",
    "link": "http://arxiv.org/abs/2401.16685",
    "context": "Title: Communication-Efficient Multimodal Federated Learning: Joint Modality and Client Selection. (arXiv:2401.16685v1 [cs.LG])\nAbstract: Multimodal federated learning (FL) aims to enrich model training in FL settings where clients are collecting measurements across multiple modalities. However, key challenges to multimodal FL remain unaddressed, particularly in heterogeneous network settings where: (i) the set of modalities collected by each client will be diverse, and (ii) communication limitations prevent clients from uploading all their locally trained modality models to the server. In this paper, we propose multimodal Federated learning with joint Modality and Client selection (mmFedMC), a new FL methodology that can tackle the above-mentioned challenges in multimodal settings. The joint selection algorithm incorporates two main components: (a) A modality selection methodology for each client, which weighs (i) the impact of the modality, gauged by Shapley value analysis, (ii) the modality model size as a gauge of communication overhead, against (iii) the frequency of modality model updates, denoted recency, to enhan",
    "path": "papers/24/01/2401.16685.json",
    "total_tokens": 880,
    "translated_title": "通信高效的多模态联邦学习：联合模态和客户选择",
    "translated_abstract": "多模态联邦学习旨在丰富在客户端收集多模态测量的联邦学习环境中的模型训练。然而，多模态联邦学习面临一些尚未解决的关键挑战，特别是在异构网络环境中：(i)每个客户端收集的模态集合将是多样的，(ii)通信限制阻止客户端将其所有本地训练的模态模型上传到服务器。在本文中，我们提出了多模态联邦学习与联合模态和客户选择(mmFedMC)，一种新的联邦学习方法，可以解决多模态环境中的上述挑战。联合选择算法包含两个主要组成部分：(a)为每个客户端设计的模态选择方法，根据Shapley值分析评估模态的影响，根据通信开销的模态模型大小，结合模态模型更新频率（称为最近更新）作为权重，以增强模态选择的效果。",
    "tldr": "本文提出了一种新的多模态联邦学习方法，通过联合模态和客户选择来解决多样的模态集合和通信限制的挑战。",
    "en_tdlr": "This paper proposes a new method for multimodal federated learning, which addresses the challenges of diverse modality sets and communication limitations through joint modality and client selection."
}