{
    "title": "Design & Implementation of Automatic Machine Condition Monitoring and Maintenance System in Limited Resource Situations. (arXiv:2401.15088v1 [eess.SY])",
    "abstract": "In the era of the fourth industrial revolution, it is essential to automate fault detection and diagnosis of machineries so that a warning system can be developed that will help to take an appropriate action before any catastrophic damage. Some machines health monitoring systems are used globally but they are expensive and need trained personnel to operate and analyse. Predictive maintenance and occupational health and safety culture are not available due to inadequate infrastructure, lack of skilled manpower, financial crisis, and others in developing countries. Starting from developing a cost-effective DAS for collecting fault data in this study, the effect of limited data and resources has been investigated while automating the process. To solve this problem, A feature engineering and data reduction method has been developed combining the concepts from wavelets, differential calculus, and signal processing. Finally, for automating the whole process, all the necessary theoretical and",
    "link": "http://arxiv.org/abs/2401.15088",
    "context": "Title: Design & Implementation of Automatic Machine Condition Monitoring and Maintenance System in Limited Resource Situations. (arXiv:2401.15088v1 [eess.SY])\nAbstract: In the era of the fourth industrial revolution, it is essential to automate fault detection and diagnosis of machineries so that a warning system can be developed that will help to take an appropriate action before any catastrophic damage. Some machines health monitoring systems are used globally but they are expensive and need trained personnel to operate and analyse. Predictive maintenance and occupational health and safety culture are not available due to inadequate infrastructure, lack of skilled manpower, financial crisis, and others in developing countries. Starting from developing a cost-effective DAS for collecting fault data in this study, the effect of limited data and resources has been investigated while automating the process. To solve this problem, A feature engineering and data reduction method has been developed combining the concepts from wavelets, differential calculus, and signal processing. Finally, for automating the whole process, all the necessary theoretical and",
    "path": "papers/24/01/2401.15088.json",
    "total_tokens": 921,
    "translated_title": "在资源有限的情况下设计和实施自动机器状态监测和维护系统",
    "translated_abstract": "在第四次工业革命时代，自动化故障检测和诊断机械设备是至关重要的，这样可以开发一个警告系统，在发生灾难性损坏之前采取适当的行动。全球使用了一些机器健康监测系统，但它们昂贵且需要经过培训的人员操作和分析。由于发展中国家基础设施不足、缺乏熟练人员、财务危机等原因，预测性维护和职业健康安全文化不可得。从开发一种成本效益的数据采集系统开始，在本研究中探讨了有限的数据和资源对自动化过程的影响。为了解决这个问题，结合小波、微积分和信号处理的概念，开发了一种特征工程和数据降维方法。最后，为了自动化整个过程，完成了所有必要的理论和实证研究。",
    "tldr": "本研究设计和实施了一种在资源有限情况下的自动机器状态监测和维护系统，通过开发成本效益的数据采集系统和特征工程和数据降维方法，解决了发展中国家缺乏预测性维护和职业健康安全文化的问题。"
}