{
    "title": "Adaptive Crowdsourcing Via Self-Supervised Learning. (arXiv:2401.13239v1 [cs.LG])",
    "abstract": "Common crowdsourcing systems average estimates of a latent quantity of interest provided by many crowdworkers to produce a group estimate. We develop a new approach -- just-predict-others -- that leverages self-supervised learning and a novel aggregation scheme. This approach adapts weights assigned to crowdworkers based on estimates they provided for previous quantities. When skills vary across crowdworkers or their estimates correlate, the weighted sum offers a more accurate group estimate than the average. Existing algorithms such as expectation maximization can, at least in principle, produce similarly accurate group estimates. However, their computational requirements become onerous when complex models, such as neural networks, are required to express relationships among crowdworkers. Just-predict-others accommodates such complexity as well as many other practical challenges. We analyze the efficacy of just-predict-others through theoretical and computational studies. Among other ",
    "link": "http://arxiv.org/abs/2401.13239",
    "context": "Title: Adaptive Crowdsourcing Via Self-Supervised Learning. (arXiv:2401.13239v1 [cs.LG])\nAbstract: Common crowdsourcing systems average estimates of a latent quantity of interest provided by many crowdworkers to produce a group estimate. We develop a new approach -- just-predict-others -- that leverages self-supervised learning and a novel aggregation scheme. This approach adapts weights assigned to crowdworkers based on estimates they provided for previous quantities. When skills vary across crowdworkers or their estimates correlate, the weighted sum offers a more accurate group estimate than the average. Existing algorithms such as expectation maximization can, at least in principle, produce similarly accurate group estimates. However, their computational requirements become onerous when complex models, such as neural networks, are required to express relationships among crowdworkers. Just-predict-others accommodates such complexity as well as many other practical challenges. We analyze the efficacy of just-predict-others through theoretical and computational studies. Among other ",
    "path": "papers/24/01/2401.13239.json",
    "total_tokens": 921,
    "translated_title": "自适应众包通过自监督学习",
    "translated_abstract": "通常的众包系统通过对众多众包工作者提供的潜在利益数量的估计进行平均得到集体估计。我们开发了一种新方法--只预测其他人--利用自监督学习和一种新颖的聚合方案。这种方法根据他们对先前数量的估计给予众包工作者分配的权重来调整。当众包工作者的技能变化或他们的估计相关时，加权求和比平均求和提供更准确的集体估计。现有的算法，如期望最大化，至少在原则上可以产生类似准确的集体估计。然而，当需要使用诸如神经网络之类的复杂模型来表示众包工作者之间的关系时，它们的计算需求变得繁重。只预测其他人适应了这种复杂性以及许多其他实际挑战。我们通过理论和计算研究分析了只预测其他人的功效。其中",
    "tldr": "本论文介绍了一种新的自适应众包方法，通过利用自监督学习和新颖的聚合方案，根据众包工作者对先前数量的估计调整权重，实现更准确的集体估计。该方法适应复杂模型和其他实际挑战，并通过理论和计算研究进行了验证。"
}