{
    "title": "Dataset Optimization for Chronic Disease Prediction with Bio-Inspired Feature Selection. (arXiv:2401.05380v1 [cs.NE])",
    "abstract": "In this study, we investigated the application of bio-inspired optimization algorithms, including Genetic Algorithm, Particle Swarm Optimization, and Whale Optimization Algorithm, for feature selection in chronic disease prediction. The primary goal was to enhance the predictive accuracy of models streamline data dimensionality, and make predictions more interpretable and actionable.  The research encompassed a comparative analysis of the three bio-inspired feature selection approaches across diverse chronic diseases, including diabetes, cancer, kidney, and cardiovascular diseases. Performance metrics such as accuracy, precision, recall, and f1 score are used to assess the effectiveness of the algorithms in reducing the number of features needed for accurate classification.  The results in general demonstrate that the bio-inspired optimization algorithms are effective in reducing the number of features required for accurate classification. However, there have been variations in the per",
    "link": "http://arxiv.org/abs/2401.05380",
    "context": "Title: Dataset Optimization for Chronic Disease Prediction with Bio-Inspired Feature Selection. (arXiv:2401.05380v1 [cs.NE])\nAbstract: In this study, we investigated the application of bio-inspired optimization algorithms, including Genetic Algorithm, Particle Swarm Optimization, and Whale Optimization Algorithm, for feature selection in chronic disease prediction. The primary goal was to enhance the predictive accuracy of models streamline data dimensionality, and make predictions more interpretable and actionable.  The research encompassed a comparative analysis of the three bio-inspired feature selection approaches across diverse chronic diseases, including diabetes, cancer, kidney, and cardiovascular diseases. Performance metrics such as accuracy, precision, recall, and f1 score are used to assess the effectiveness of the algorithms in reducing the number of features needed for accurate classification.  The results in general demonstrate that the bio-inspired optimization algorithms are effective in reducing the number of features required for accurate classification. However, there have been variations in the per",
    "path": "papers/24/01/2401.05380.json",
    "total_tokens": 922,
    "translated_title": "基于生物启发优化算法的慢性病预测数据集优化",
    "translated_abstract": "本研究探索了基因算法、粒子群优化和鲸鱼优化算法等生物启发优化算法在慢性病预测中的应用，主要目标是提高模型的预测准确性、优化数据维度，使得预测结果更易解释和行动化。研究涵盖了对糖尿病、癌症、肾脏疾病和心血管疾病等不同慢性病的三种生物启发特征选择方法进行比较分析。使用准确率、精确度、召回率和F1得分等性能指标评估算法在准确分类所需特征数量上的有效性。总体结果表明，生物启发优化算法在减少准确分类所需特征数量方面是有效的，但在不同慢性病上会有一定的差异。",
    "tldr": "本研究探索了在慢性病预测中应用基因算法、粒子群优化和鲸鱼优化算法等生物启发优化算法进行特征选择的方法，目标是提高预测准确性、优化数据维度，并使预测结果更易解释和行动化。实验结果表明，生物启发优化算法能够有效地减少准确分类所需的特征数量。",
    "en_tdlr": "This study investigated the application of bio-inspired optimization algorithms for feature selection in chronic disease prediction, aiming to enhance predictive accuracy, optimize data dimensionality, and improve interpretability and actionability of the predictions. Results demonstrated that the bio-inspired optimization algorithms were effective in reducing the number of features required for accurate classification."
}