{
    "title": "ADF & TransApp: A Transformer-Based Framework for Appliance Detection Using Smart Meter Consumption Series. (arXiv:2401.05381v1 [eess.SP])",
    "abstract": "Over the past decade, millions of smart meters have been installed by electricity suppliers worldwide, allowing them to collect a large amount of electricity consumption data, albeit sampled at a low frequency (one point every 30min). One of the important challenges these suppliers face is how to utilize these data to detect the presence/absence of different appliances in the customers' households. This valuable information can help them provide personalized offers and recommendations to help customers towards the energy transition. Appliance detection can be cast as a time series classification problem. However, the large amount of data combined with the long and variable length of the consumption series pose challenges when training a classifier. In this paper, we propose ADF, a framework that uses subsequences of a client consumption series to detect the presence/absence of appliances. We also introduce TransApp, a Transformer-based time series classifier that is first pretrained in",
    "link": "http://arxiv.org/abs/2401.05381",
    "context": "Title: ADF & TransApp: A Transformer-Based Framework for Appliance Detection Using Smart Meter Consumption Series. (arXiv:2401.05381v1 [eess.SP])\nAbstract: Over the past decade, millions of smart meters have been installed by electricity suppliers worldwide, allowing them to collect a large amount of electricity consumption data, albeit sampled at a low frequency (one point every 30min). One of the important challenges these suppliers face is how to utilize these data to detect the presence/absence of different appliances in the customers' households. This valuable information can help them provide personalized offers and recommendations to help customers towards the energy transition. Appliance detection can be cast as a time series classification problem. However, the large amount of data combined with the long and variable length of the consumption series pose challenges when training a classifier. In this paper, we propose ADF, a framework that uses subsequences of a client consumption series to detect the presence/absence of appliances. We also introduce TransApp, a Transformer-based time series classifier that is first pretrained in",
    "path": "papers/24/01/2401.05381.json",
    "total_tokens": 896,
    "translated_title": "ADF和TransApp：基于Transformer的智能电表用电序列中的电器检测框架",
    "translated_abstract": "在过去的十年中，全球电力供应商安装了数百万个智能电表，使他们能够收集大量的用电数据，尽管采样频率较低（每30分钟一个点）。这些供应商面临的一个重要挑战是如何利用这些数据来检测客户家庭中不同电器的存在/不存在。这些宝贵的信息可以帮助他们提供个性化的优惠和建议，以帮助客户实现能源转型。电器检测可以被看作是一个时间序列分类问题。然而，大量的数据结合消费序列的长度长且变化不定，在训练分类器时会带来挑战。在本文中，我们提出了一个框架ADF，它使用客户用电序列的子序列来检测电器的存在/不存在。我们还引入了TransApp，一种基于Transformer的时间序列分类器，该分类器首先在预训练中进行了训练。",
    "tldr": "本论文提出了ADF框架和TransApp分类器，用于基于智能电表用电序列的电器检测。这些方法能够有效处理大量数据和变化长度的序列，为电力供应商提供帮助客户实现能源转型的宝贵信息。",
    "en_tdlr": "This paper proposes the ADF framework and the TransApp classifier for appliance detection based on smart meter consumption series. These methods are able to effectively handle large amounts of data and variable length sequences, providing valuable information for electricity suppliers to assist customers in achieving energy transition."
}