{
    "title": "No-Clean-Reference Image Super-Resolution: Application to Electron Microscopy. (arXiv:2401.08115v2 [cs.CV] UPDATED)",
    "abstract": "The inability to acquire clean high-resolution (HR) electron microscopy (EM) images over a large brain tissue volume hampers many neuroscience studies. To address this challenge, we propose a deep-learning-based image super-resolution (SR) approach to computationally reconstruct clean HR 3D-EM with a large field of view (FoV) from noisy low-resolution (LR) acquisition. Our contributions are I) Investigating training with no-clean references for $\\ell_2$ and $\\ell_1$ loss functions; II) Introducing a novel network architecture, named EMSR, for enhancing the resolution of LR EM images while reducing inherent noise; and, III) Comparing different training strategies including using acquired LR and HR image pairs, i.e., real pairs with no-clean references contaminated with real corruptions, the pairs of synthetic LR and acquired HR, as well as acquired LR and denoised HR pairs. Experiments with nine brain datasets showed that training with real pairs can produce high-quality super-resolved ",
    "link": "http://arxiv.org/abs/2401.08115",
    "context": "Title: No-Clean-Reference Image Super-Resolution: Application to Electron Microscopy. (arXiv:2401.08115v2 [cs.CV] UPDATED)\nAbstract: The inability to acquire clean high-resolution (HR) electron microscopy (EM) images over a large brain tissue volume hampers many neuroscience studies. To address this challenge, we propose a deep-learning-based image super-resolution (SR) approach to computationally reconstruct clean HR 3D-EM with a large field of view (FoV) from noisy low-resolution (LR) acquisition. Our contributions are I) Investigating training with no-clean references for $\\ell_2$ and $\\ell_1$ loss functions; II) Introducing a novel network architecture, named EMSR, for enhancing the resolution of LR EM images while reducing inherent noise; and, III) Comparing different training strategies including using acquired LR and HR image pairs, i.e., real pairs with no-clean references contaminated with real corruptions, the pairs of synthetic LR and acquired HR, as well as acquired LR and denoised HR pairs. Experiments with nine brain datasets showed that training with real pairs can produce high-quality super-resolved ",
    "path": "papers/24/01/2401.08115.json",
    "total_tokens": 1025,
    "translated_title": "无需清洗参考图像的超分辨率：应用于电子显微镜",
    "translated_abstract": "无法获得清洁的高分辨率电子显微镜（EM）图像限制了许多神经科学研究。为了解决这个挑战，我们提出了一种基于深度学习的图像超分辨率（SR）方法，以从噪声低分辨率（LR）采集中计算重建具有大视场（FoV）的清洁的高分辨率3D-EM。我们的贡献是：I）研究使用无需清洗参考的$\\ell_2$和$\\ell_1$损失函数进行训练；II）引入一种名为EMSR的新型网络架构，用于增强LR EM图像的分辨率同时减少固有噪声；以及III）比较不同的训练策略，包括使用获取的LR和HR图像对，即具有真实污染的无需清洗参考的真实对，合成LR和获取的HR对以及获取的LR和去噪HR对。在九个脑数据集上的实验表明，使用真实对进行训练可以产生高质量的超分辨率重建图像。",
    "tldr": "这项研究提出了一种无需清洗参考图像的超分辨率方法，通过深度学习实现从噪声低分辨率的电子显微镜图像重建清洁的高分辨率图像。以及使用无需清洗参考的训练和引入新的网络架构。实验结果表明使用真实训练数据可以产生高质量的重建图像。",
    "en_tdlr": "This research proposes a no-clean-reference image super-resolution method using deep learning to reconstruct clean high-resolution electron microscopy images from noisy low-resolution input. The contributions include investigating training with no-clean references, introducing a novel network architecture, and comparing different training strategies. Experimental results demonstrate that training with real data leads to high-quality reconstructions."
}