{
    "title": "Controllable Decontextualization of Yes/No Question and Answers into Factual Statements. (arXiv:2401.09775v1 [cs.CL])",
    "abstract": "Yes/No or polar questions represent one of the main linguistic question categories. They consist of a main interrogative clause, for which the answer is binary (assertion or negation). Polar questions and answers (PQA) represent a valuable knowledge resource present in many community and other curated QA sources, such as forums or e-commerce applications. Using answers to polar questions alone in other contexts is not trivial. Answers are contextualized, and presume that the interrogative question clause and any shared knowledge between the asker and answerer are provided.  We address the problem of controllable rewriting of answers to polar questions into decontextualized and succinct factual statements. We propose a Transformer sequence to sequence model that utilizes soft-constraints to ensure controllable rewriting, such that the output statement is semantically equivalent to its PQA input. Evaluation on three separate PQA datasets as measured through automated and human evaluation",
    "link": "http://arxiv.org/abs/2401.09775",
    "context": "Title: Controllable Decontextualization of Yes/No Question and Answers into Factual Statements. (arXiv:2401.09775v1 [cs.CL])\nAbstract: Yes/No or polar questions represent one of the main linguistic question categories. They consist of a main interrogative clause, for which the answer is binary (assertion or negation). Polar questions and answers (PQA) represent a valuable knowledge resource present in many community and other curated QA sources, such as forums or e-commerce applications. Using answers to polar questions alone in other contexts is not trivial. Answers are contextualized, and presume that the interrogative question clause and any shared knowledge between the asker and answerer are provided.  We address the problem of controllable rewriting of answers to polar questions into decontextualized and succinct factual statements. We propose a Transformer sequence to sequence model that utilizes soft-constraints to ensure controllable rewriting, such that the output statement is semantically equivalent to its PQA input. Evaluation on three separate PQA datasets as measured through automated and human evaluation",
    "path": "papers/24/01/2401.09775.json",
    "total_tokens": 895,
    "translated_title": "可控制的对是/否问题和答案进行去情境化处理，转化为事实陈述",
    "translated_abstract": "是/否问题或极性问题是主要的语言问题类别之一。它们由一个主要的疑问子句组成，其答案是二进制的（肯定或否定）。极性问题和答案（PQA）是许多社区和其他经过筛选的问答资源中的有价值的知识资源，例如论坛或电子商务应用程序。单独使用极性问题的答案在其他语境中并不是很容易。答案是情境化的，并假设提问者和回答者之间的共享知识以及疑问子句都已提供。我们解决了将极性问题的答案重写为脱离情境且简洁的事实陈述的问题。我们提出了一个Transformer序列到序列模型，利用软约束确保可控制的重写，使得输出的陈述在语义上等同于其PQA输入。通过自动化和人工评估，在三个独立的PQA数据集上进行评估",
    "tldr": "本论文解决了将极性问题的答案重写为脱离情境且简洁的事实陈述的问题，提出了一个利用Transformer模型实现的可控制重写方法，并在三个独立的PQA数据集上进行了评估",
    "en_tdlr": "This paper addresses the problem of rewriting answers to polar questions into decontextualized and succinct factual statements. It proposes a controllable rewriting method using a Transformer model and evaluates it on three separate PQA datasets."
}