{
    "title": "Inferring Data Preconditions from Deep Learning Models for Trustworthy Prediction in Deployment. (arXiv:2401.14628v1 [cs.SE])",
    "abstract": "Deep learning models are trained with certain assumptions about the data during the development stage and then used for prediction in the deployment stage. It is important to reason about the trustworthiness of the model's predictions with unseen data during deployment. Existing methods for specifying and verifying traditional software are insufficient for this task, as they cannot handle the complexity of DNN model architecture and expected outcomes. In this work, we propose a novel technique that uses rules derived from neural network computations to infer data preconditions for a DNN model to determine the trustworthiness of its predictions. Our approach, DeepInfer involves introducing a novel abstraction for a trained DNN model that enables weakest precondition reasoning using Dijkstra's Predicate Transformer Semantics. By deriving rules over the inductive type of neural network abstract representation, we can overcome the matrix dimensionality issues that arise from the backward n",
    "link": "http://arxiv.org/abs/2401.14628",
    "context": "Title: Inferring Data Preconditions from Deep Learning Models for Trustworthy Prediction in Deployment. (arXiv:2401.14628v1 [cs.SE])\nAbstract: Deep learning models are trained with certain assumptions about the data during the development stage and then used for prediction in the deployment stage. It is important to reason about the trustworthiness of the model's predictions with unseen data during deployment. Existing methods for specifying and verifying traditional software are insufficient for this task, as they cannot handle the complexity of DNN model architecture and expected outcomes. In this work, we propose a novel technique that uses rules derived from neural network computations to infer data preconditions for a DNN model to determine the trustworthiness of its predictions. Our approach, DeepInfer involves introducing a novel abstraction for a trained DNN model that enables weakest precondition reasoning using Dijkstra's Predicate Transformer Semantics. By deriving rules over the inductive type of neural network abstract representation, we can overcome the matrix dimensionality issues that arise from the backward n",
    "path": "papers/24/01/2401.14628.json",
    "total_tokens": 877,
    "translated_title": "从深度学习模型中推断数据前提，以实现可靠的部署预测",
    "translated_abstract": "在开发阶段，深度学习模型是根据对数据的某些假设进行训练的，然后在部署阶段用于预测。在部署期间，推理模型对于未见数据的预测结果的可靠性非常重要。现有的用于指定和验证传统软件的方法对于处理DNN模型架构和预期结果的复杂性不足。在这项工作中，我们提出了一种新颖的技术，利用从神经网络计算中推导出的规则来推断一个DNN模型的数据前提，以确定其预测的可靠性。我们的方法DeepInfer涉及引入一种新颖的训练DNN模型抽象表示，以使用Dijkstra的谓词变换语义进行最弱前提推理。通过导出在归纳类型的神经网络抽象表示上的规则，我们可以克服由于反向传播算法引起的矩阵维度问题。",
    "tldr": "本文提出了一种从深度学习模型中推断数据前提的新技术，用于确定其预测的可靠性。该方法使用了从神经网络计算中推导出的规则，并引入了一种新颖的抽象表示，以进行最弱前提推理。",
    "en_tdlr": "This paper proposes a novel technique to infer data preconditions from deep learning models in order to determine the trustworthiness of their predictions. The method utilizes rules derived from neural network computations and introduces a novel abstraction for weakest precondition reasoning."
}