{
    "title": "Sample Complexity of the Sign-Perturbed Sums Identification Method: Scalar Case. (arXiv:2401.15792v1 [stat.ML])",
    "abstract": "Sign-Perturbed Sum (SPS) is a powerful finite-sample system identification algorithm which can construct confidence regions for the true data generating system with exact coverage probabilities, for any finite sample size. SPS was developed in a series of papers and it has a wide range of applications, from general linear systems, even in a closed-loop setup, to nonlinear and nonparametric approaches. Although several theoretical properties of SPS were proven in the literature, the sample complexity of the method was not analysed so far. This paper aims to fill this gap and provides the first results on the sample complexity of SPS. Here, we focus on scalar linear regression problems, that is we study the behaviour of SPS confidence intervals. We provide high probability upper bounds, under three different sets of assumptions, showing that the sizes of SPS confidence intervals shrink at a geometric rate around the true parameter, if the observation noises are subgaussian. We also show ",
    "link": "http://arxiv.org/abs/2401.15792",
    "context": "Title: Sample Complexity of the Sign-Perturbed Sums Identification Method: Scalar Case. (arXiv:2401.15792v1 [stat.ML])\nAbstract: Sign-Perturbed Sum (SPS) is a powerful finite-sample system identification algorithm which can construct confidence regions for the true data generating system with exact coverage probabilities, for any finite sample size. SPS was developed in a series of papers and it has a wide range of applications, from general linear systems, even in a closed-loop setup, to nonlinear and nonparametric approaches. Although several theoretical properties of SPS were proven in the literature, the sample complexity of the method was not analysed so far. This paper aims to fill this gap and provides the first results on the sample complexity of SPS. Here, we focus on scalar linear regression problems, that is we study the behaviour of SPS confidence intervals. We provide high probability upper bounds, under three different sets of assumptions, showing that the sizes of SPS confidence intervals shrink at a geometric rate around the true parameter, if the observation noises are subgaussian. We also show ",
    "path": "papers/24/01/2401.15792.json",
    "total_tokens": 946,
    "translated_title": "Sign-Perturbed Sums识别方法的样本复杂性：标量情况",
    "translated_abstract": "Sign-Perturbed Sum (SPS)是一种强大的有限样本系统识别算法，可以构建真实数据生成系统的置信区间，并具有精确的覆盖概率，适用于任何有限的样本大小。SPS在一系列论文中进行了发展，并具有广泛的应用，从一般线性系统，甚至闭环设置下，到非线性和非参数方法。虽然SPS的几个理论性质在文献中已被证明，但该方法的样本复杂性尚未进行分析。本文旨在填补这一空白，并首次提供了关于SPS样本复杂性的结果。在这里，我们专注于标量线性回归问题，即研究SPS置信区间的行为。我们在三个不同的假设集下提供了高概率的上界，表明如果观测噪声是次高斯的话，SPS置信区间的大小以几何速率缩小到真实参数的附近。",
    "tldr": "本文研究了Sign-Perturbed Sum (SPS)识别方法的样本复杂性，特别是在标量线性回归问题中，通过分析其置信区间的行为。研究结果表明，如果观测噪声是次高斯的话，SPS置信区间的大小以几何速率缩小到真实参数的附近。",
    "en_tdlr": "This paper investigates the sample complexity of the Sign-Perturbed Sums (SPS) identification method, specifically in the case of scalar linear regression problems, by analyzing the behavior of its confidence intervals. The study shows that the sizes of SPS confidence intervals shrink geometrically around the true parameter, if the observation noises are subgaussian."
}