{
    "title": "Improved Capacity Outer Bound for Private Quadratic Monomial Computation. (arXiv:2401.06125v1 [cs.IR])",
    "abstract": "In private computation, a user wishes to retrieve a function evaluation of messages stored on a set of databases without revealing the function's identity to the databases. Obead \\emph{et al.} introduced a capacity outer bound for private nonlinear computation, dependent on the order of the candidate functions. Focusing on private \\emph{quadratic monomial} computation, we propose three methods for ordering candidate functions: a graph edge-coloring method, a graph-distance method, and an entropy-based greedy method. We confirm, via an exhaustive search, that all three methods yield an optimal ordering for $f < 6$ messages. For $6 \\leq f \\leq 12$ messages, we numerically evaluate the performance of the proposed methods compared with a directed random search. For almost all scenarios considered, the entropy-based greedy method gives the smallest gap to the best-found ordering.",
    "link": "http://arxiv.org/abs/2401.06125",
    "context": "Title: Improved Capacity Outer Bound for Private Quadratic Monomial Computation. (arXiv:2401.06125v1 [cs.IR])\nAbstract: In private computation, a user wishes to retrieve a function evaluation of messages stored on a set of databases without revealing the function's identity to the databases. Obead \\emph{et al.} introduced a capacity outer bound for private nonlinear computation, dependent on the order of the candidate functions. Focusing on private \\emph{quadratic monomial} computation, we propose three methods for ordering candidate functions: a graph edge-coloring method, a graph-distance method, and an entropy-based greedy method. We confirm, via an exhaustive search, that all three methods yield an optimal ordering for $f < 6$ messages. For $6 \\leq f \\leq 12$ messages, we numerically evaluate the performance of the proposed methods compared with a directed random search. For almost all scenarios considered, the entropy-based greedy method gives the smallest gap to the best-found ordering.",
    "path": "papers/24/01/2401.06125.json",
    "total_tokens": 799,
    "translated_title": "改进的私有二次单项计算容量上限",
    "translated_abstract": "在私有计算中，用户希望在一组数据库上检索存储的消息的函数评估，而不向数据库透露函数的身份。Obead等人提出了一个私有非线性计算的容量上限，取决于候选函数的顺序。针对私有二次单项计算，我们提出了三种候选函数排序方法：图的边着色方法，图的距离方法和基于熵的贪婪方法。我们通过穷举搜索证实，这三种方法对于$f < 6$的消息都可以得到最优的排序。对于$6 \\leq f \\leq 12$的消息，我们对比了所提方法与定向随机搜索的性能进行了数值评估。几乎考虑的所有场景中，基于熵的贪婪方法给出了与最佳排序最小的差距。",
    "tldr": "提出了用于私有二次单项计算的改进容量上限，并通过三种候选函数排序方法进行了验证。基于熵的贪婪方法在大多数情况下表现最好。",
    "en_tdlr": "An improved capacity outer bound for private quadratic monomial computation is proposed, and three methods for ordering candidate functions are validated. The entropy-based greedy method performs the best in most scenarios."
}