{
    "title": "HiCAST: Highly Customized Arbitrary Style Transfer with Adapter Enhanced Diffusion Models. (arXiv:2401.05870v1 [cs.CV])",
    "abstract": "The goal of Arbitrary Style Transfer (AST) is injecting the artistic features of a style reference into a given image/video. Existing methods usually focus on pursuing the balance between style and content, whereas ignoring the significant demand for flexible and customized stylization results and thereby limiting their practical application. To address this critical issue, a novel AST approach namely HiCAST is proposed, which is capable of explicitly customizing the stylization results according to various source of semantic clues. In the specific, our model is constructed based on Latent Diffusion Model (LDM) and elaborately designed to absorb content and style instance as conditions of LDM. It is characterized by introducing of \\textit{Style Adapter}, which allows user to flexibly manipulate the output results by aligning multi-level style information and intrinsic knowledge in LDM. Lastly, we further extend our model to perform video AST. A novel learning objective is leveraged for",
    "link": "http://arxiv.org/abs/2401.05870",
    "context": "Title: HiCAST: Highly Customized Arbitrary Style Transfer with Adapter Enhanced Diffusion Models. (arXiv:2401.05870v1 [cs.CV])\nAbstract: The goal of Arbitrary Style Transfer (AST) is injecting the artistic features of a style reference into a given image/video. Existing methods usually focus on pursuing the balance between style and content, whereas ignoring the significant demand for flexible and customized stylization results and thereby limiting their practical application. To address this critical issue, a novel AST approach namely HiCAST is proposed, which is capable of explicitly customizing the stylization results according to various source of semantic clues. In the specific, our model is constructed based on Latent Diffusion Model (LDM) and elaborately designed to absorb content and style instance as conditions of LDM. It is characterized by introducing of \\textit{Style Adapter}, which allows user to flexibly manipulate the output results by aligning multi-level style information and intrinsic knowledge in LDM. Lastly, we further extend our model to perform video AST. A novel learning objective is leveraged for",
    "path": "papers/24/01/2401.05870.json",
    "total_tokens": 824,
    "translated_title": "HiCAST: 使用增强扩散模型的高度定制的任意风格转换",
    "translated_abstract": "任意风格转换（AST）的目标是将风格参考的艺术特征注入给定的图像/视频。现有方法通常关注风格和内容之间的平衡，忽视了对灵活和定制化风格化结果的重要需求，从而限制了它们的实际应用。为了解决这个关键问题，提出了一种新的AST方法，称为HiCAST，它能够根据各种语义线索显式定制风格化结果。具体而言，我们的模型基于潜在扩散模型（LDM）构建，并精心设计以吸收LDM的内容和风格实例条件。其特点是引入了\"风格适配器\"，允许用户通过对齐LDM中的多层风格信息和内在知识来灵活操作输出结果。最后，我们进一步扩展了我们的模型以执行视频AST。借助一种新颖的学习目标进行了提升。",
    "tldr": "HiCAST是一种高度定制的任意风格转换方法，通过引入\"风格适配器\"和利用潜在扩散模型，可以根据各种语义线索显式定制风格化结果。"
}