{
    "title": "StarCraftImage: A Dataset For Prototyping Spatial Reasoning Methods For Multi-Agent Environments. (arXiv:2401.04290v1 [cs.CV])",
    "abstract": "Spatial reasoning tasks in multi-agent environments such as event prediction, agent type identification, or missing data imputation are important for multiple applications (e.g., autonomous surveillance over sensor networks and subtasks for reinforcement learning (RL)). StarCraft II game replays encode intelligent (and adversarial) multi-agent behavior and could provide a testbed for these tasks; however, extracting simple and standardized representations for prototyping these tasks is laborious and hinders reproducibility. In contrast, MNIST and CIFAR10, despite their extreme simplicity, have enabled rapid prototyping and reproducibility of ML methods. Following the simplicity of these datasets, we construct a benchmark spatial reasoning dataset based on StarCraft II replays that exhibit complex multi-agent behaviors, while still being as easy to use as MNIST and CIFAR10. Specifically, we carefully summarize a window of 255 consecutive game states to create 3.6 million summary images ",
    "link": "http://arxiv.org/abs/2401.04290",
    "context": "Title: StarCraftImage: A Dataset For Prototyping Spatial Reasoning Methods For Multi-Agent Environments. (arXiv:2401.04290v1 [cs.CV])\nAbstract: Spatial reasoning tasks in multi-agent environments such as event prediction, agent type identification, or missing data imputation are important for multiple applications (e.g., autonomous surveillance over sensor networks and subtasks for reinforcement learning (RL)). StarCraft II game replays encode intelligent (and adversarial) multi-agent behavior and could provide a testbed for these tasks; however, extracting simple and standardized representations for prototyping these tasks is laborious and hinders reproducibility. In contrast, MNIST and CIFAR10, despite their extreme simplicity, have enabled rapid prototyping and reproducibility of ML methods. Following the simplicity of these datasets, we construct a benchmark spatial reasoning dataset based on StarCraft II replays that exhibit complex multi-agent behaviors, while still being as easy to use as MNIST and CIFAR10. Specifically, we carefully summarize a window of 255 consecutive game states to create 3.6 million summary images ",
    "path": "papers/24/01/2401.04290.json",
    "total_tokens": 911,
    "translated_title": "StarCraftImage: 一种用于多智能体环境空间推理方法原型设计的数据集",
    "translated_abstract": "多智能体环境中的空间推理任务对于多个应用很重要，如事件预测、智能体类型识别或缺失数据插补等（例如，在传感器网络上的自主监视和强化学习的子任务）。StarCraft II游戏回放记录了智能（和对抗性）的多智能体行为，可以用作这些任务的测试平台；然而，提取出简单和标准化的表示以用于原型设计这些任务非常繁琐并且难以复现。相比之下，尽管MNIST和CIFAR10极其简单，但它们已经实现了机器学习方法的快速原型设计和复现能力。为了遵循这些数据集的简单性，我们基于展示复杂的多智能体行为的StarCraft II游戏回放构建了一个用于空间推理的基准数据集，同时易于使用就像MNIST和CIFAR10一样。具体来说，我们仔细总结了255个连续游戏状态的窗口，创建了360万个摘要图像。",
    "tldr": "这个论文提出了一种使用StarCraft II游戏回放构建的基准数据集，该数据集可以用于原型设计多智能体环境中的空间推理方法，同时具有与MNIST和CIFAR10相似的易用性。"
}