{
    "title": "Automation of Smart Homes with Multiple Rule Sources. (arXiv:2401.02451v1 [cs.CR])",
    "abstract": "Using rules for home automation presents several challenges, especially when considering multiple stakeholders in addition to residents, such as homeowners, local authorities, energy suppliers, and system providers, who will wish to contribute rules to safeguard their interests. Managing rules from various sources requires a structured procedure, a relevant policy, and a designated authority to ensure authorized and correct contributions and address potential conflicts. In addition, the smart home rule language needs to express conditions and decisions at a high level of abstraction without specifying implementation details such as interfaces, access protocols, and room layout. Decoupling high-level decisions from these details supports the transferability and adaptability of rules to similar homes. This separation also has important implications for structuring the smart home system and the security architecture. Our proposed approach and system implementation introduce a rule managem",
    "link": "http://arxiv.org/abs/2401.02451",
    "context": "Title: Automation of Smart Homes with Multiple Rule Sources. (arXiv:2401.02451v1 [cs.CR])\nAbstract: Using rules for home automation presents several challenges, especially when considering multiple stakeholders in addition to residents, such as homeowners, local authorities, energy suppliers, and system providers, who will wish to contribute rules to safeguard their interests. Managing rules from various sources requires a structured procedure, a relevant policy, and a designated authority to ensure authorized and correct contributions and address potential conflicts. In addition, the smart home rule language needs to express conditions and decisions at a high level of abstraction without specifying implementation details such as interfaces, access protocols, and room layout. Decoupling high-level decisions from these details supports the transferability and adaptability of rules to similar homes. This separation also has important implications for structuring the smart home system and the security architecture. Our proposed approach and system implementation introduce a rule managem",
    "path": "papers/24/01/2401.02451.json",
    "total_tokens": 850,
    "translated_title": "多规则来源的智能家居自动化",
    "translated_abstract": "使用规则进行家居自动化面临一些挑战，特别是考虑到除了居民外还有多个利益相关者，如房主、当地政府、能源供应商和系统提供商，他们希望贡献规则以保护自己的利益。管理来自不同来源的规则需要一个有结构的过程、相关政策和指定的机构来确保授权和正确的贡献，并解决潜在的冲突。此外，智能家居规则语言需要以高度抽象的方式表达条件和决策，而不指定实现细节，如接口、访问协议和房间布局。将高级决策与这些细节分离支持规则对类似家居的可转移性和适应性。这种分离还对智能家居系统和安全架构的结构具有重要影响。我们提出的方法和系统实现引入了一个规则管理的方法。",
    "tldr": "这篇论文介绍了多规则来源的智能家居自动化的挑战和解决方案，包括管理规则的过程和机构、高级决策与实现细节的分离以及对系统结构和安全架构的影响。",
    "en_tdlr": "This paper discusses the challenges and solutions of automation of smart homes with multiple rule sources, including the process and authority for managing rules, the separation of high-level decisions from implementation details, and the implications for system structure and security architecture."
}