{
    "title": "Polynomial Chaos Expansions on Principal Geodesic Grassmannian Submanifolds for Surrogate Modeling and Uncertainty Quantification. (arXiv:2401.16683v1 [stat.ML])",
    "abstract": "In this work we introduce a manifold learning-based surrogate modeling framework for uncertainty quantification in high-dimensional stochastic systems. Our first goal is to perform data mining on the available simulation data to identify a set of low-dimensional (latent) descriptors that efficiently parameterize the response of the high-dimensional computational model. To this end, we employ Principal Geodesic Analysis on the Grassmann manifold of the response to identify a set of disjoint principal geodesic submanifolds, of possibly different dimension, that captures the variation in the data. Since operations on the Grassmann require the data to be concentrated, we propose an adaptive algorithm based on Riemanniann K-means and the minimization of the sample Frechet variance on the Grassmann manifold to identify \"local\" principal geodesic submanifolds that represent different system behavior across the parameter space. Polynomial chaos expansion is then used to construct a mapping bet",
    "link": "http://arxiv.org/abs/2401.16683",
    "context": "Title: Polynomial Chaos Expansions on Principal Geodesic Grassmannian Submanifolds for Surrogate Modeling and Uncertainty Quantification. (arXiv:2401.16683v1 [stat.ML])\nAbstract: In this work we introduce a manifold learning-based surrogate modeling framework for uncertainty quantification in high-dimensional stochastic systems. Our first goal is to perform data mining on the available simulation data to identify a set of low-dimensional (latent) descriptors that efficiently parameterize the response of the high-dimensional computational model. To this end, we employ Principal Geodesic Analysis on the Grassmann manifold of the response to identify a set of disjoint principal geodesic submanifolds, of possibly different dimension, that captures the variation in the data. Since operations on the Grassmann require the data to be concentrated, we propose an adaptive algorithm based on Riemanniann K-means and the minimization of the sample Frechet variance on the Grassmann manifold to identify \"local\" principal geodesic submanifolds that represent different system behavior across the parameter space. Polynomial chaos expansion is then used to construct a mapping bet",
    "path": "papers/24/01/2401.16683.json",
    "total_tokens": 908,
    "translated_title": "在主测地Grassmannian子流形上的多项式混沌展开用于代理建模和不确定性量化",
    "translated_abstract": "在这项工作中，我们介绍了一种基于流形学习的代理建模框架，用于高维随机系统中的不确定性量化。我们的首要目标是对可用的模拟数据进行数据挖掘，以确定能够高效参数化高维计算模型响应的一组低维（潜在）描述符。为此，我们采用Grassmann流形上的主测地分析，识别出一组可能具有不同维度的不相交主测地子流形，以捕捉数据的变化。由于Grassmann上的操作需要数据集中，我们提出了一种基于Riemanniann K-means和Grassmann流形上样本Frechet方差最小化的自适应算法，用于识别代表参数空间中不同系统行为的“本地”主测地子流形。然后使用多项式混沌展开构建映射",
    "tldr": "本论文提出了一种基于流形学习的代理建模框架，用于高维随机系统中的不确定性量化。通过在Grassmann流形上进行主测地分析，识别出一组潜在的低维描述符，然后利用多项式混沌展开构建映射。",
    "en_tdlr": "This paper proposes a manifold learning-based surrogate modeling framework for uncertainty quantification in high-dimensional stochastic systems. By conducting principal geodesic analysis on the Grassmann manifold, a set of low-dimensional descriptors is identified, which are then used to construct a mapping using polynomial chaos expansions."
}