{
    "title": "Investigate-Consolidate-Exploit: A General Strategy for Inter-Task Agent Self-Evolution. (arXiv:2401.13996v1 [cs.CL])",
    "abstract": "This paper introduces Investigate-Consolidate-Exploit (ICE), a novel strategy for enhancing the adaptability and flexibility of AI agents through inter-task self-evolution. Unlike existing methods focused on intra-task learning, ICE promotes the transfer of knowledge between tasks for genuine self-evolution, similar to human experience learning. The strategy dynamically investigates planning and execution trajectories, consolidates them into simplified workflows and pipelines, and exploits them for improved task execution. Our experiments on the XAgent framework demonstrate ICE's effectiveness, reducing API calls by as much as 80% and significantly decreasing the demand for the model's capability. Specifically, when combined with GPT-3.5, ICE's performance matches that of raw GPT-4 across various agent tasks. We argue that this self-evolution approach represents a paradigm shift in agent design, contributing to a more robust AI community and ecosystem, and moving a step closer to full ",
    "link": "http://arxiv.org/abs/2401.13996",
    "context": "Title: Investigate-Consolidate-Exploit: A General Strategy for Inter-Task Agent Self-Evolution. (arXiv:2401.13996v1 [cs.CL])\nAbstract: This paper introduces Investigate-Consolidate-Exploit (ICE), a novel strategy for enhancing the adaptability and flexibility of AI agents through inter-task self-evolution. Unlike existing methods focused on intra-task learning, ICE promotes the transfer of knowledge between tasks for genuine self-evolution, similar to human experience learning. The strategy dynamically investigates planning and execution trajectories, consolidates them into simplified workflows and pipelines, and exploits them for improved task execution. Our experiments on the XAgent framework demonstrate ICE's effectiveness, reducing API calls by as much as 80% and significantly decreasing the demand for the model's capability. Specifically, when combined with GPT-3.5, ICE's performance matches that of raw GPT-4 across various agent tasks. We argue that this self-evolution approach represents a paradigm shift in agent design, contributing to a more robust AI community and ecosystem, and moving a step closer to full ",
    "path": "papers/24/01/2401.13996.json",
    "total_tokens": 961,
    "translated_title": "调查-整合-开发：一种用于任务间代理自进化的通用策略",
    "translated_abstract": "本文介绍了一种名为调查-整合-开发（ICE）的新策略，通过任务间的自进化来提高AI代理的适应性和灵活性。与现有的注重任务内学习的方法不同，ICE促进了任务间知识的传递，实现了真正的自进化，类似于人类的经验学习。该策略动态地调查规划和执行轨迹，将其整合为简化的工作流和管道，并利用它们来改进任务执行。我们在XAgent框架上的实验证明了ICE的有效性，可以将API调用减少高达80％，并显著减少模型能力的需求。具体来说，当与GPT-3.5结合使用时，ICE的性能在各种代理任务上与原始GPT-4相匹配。我们认为这种自进化方法代表了代理设计的范式转变，为更强大的AI社区和生态系统做出了贡献，并向全面实现人工智能跨进了一步。",
    "tldr": "本文介绍了调查-整合-开发（ICE）策略，通过任务间的自进化来提高AI代理的适应性和灵活性。实验证明了ICE的有效性，可以显著减少API调用，同时与GPT-3.5结合使用可以在各种代理任务上达到与GPT-4相当的性能。",
    "en_tdlr": "This paper introduces Investigate-Consolidate-Exploit (ICE), a novel strategy for enhancing the adaptability and flexibility of AI agents through inter-task self-evolution. Experiments demonstrate ICE's effectiveness in reducing API calls and matching the performance of GPT-4 when combined with GPT-3.5 for various agent tasks."
}