{
    "title": "Hierarchical Federated Learning in Multi-hop Cluster-Based VANETs. (arXiv:2401.10361v1 [cs.LG])",
    "abstract": "The usage of federated learning (FL) in Vehicular Ad hoc Networks (VANET) has garnered significant interest in research due to the advantages of reducing transmission overhead and protecting user privacy by communicating local dataset gradients instead of raw data. However, implementing FL in VANETs faces challenges, including limited communication resources, high vehicle mobility, and the statistical diversity of data distributions. In order to tackle these issues, this paper introduces a novel framework for hierarchical federated learning (HFL) over multi-hop clustering-based VANET. The proposed method utilizes a weighted combination of the average relative speed and cosine similarity of FL model parameters as a clustering metric to consider both data diversity and high vehicle mobility. This metric ensures convergence with minimum changes in cluster heads while tackling the complexities associated with non-independent and identically distributed (non-IID) data scenarios. Additionall",
    "link": "http://arxiv.org/abs/2401.10361",
    "context": "Title: Hierarchical Federated Learning in Multi-hop Cluster-Based VANETs. (arXiv:2401.10361v1 [cs.LG])\nAbstract: The usage of federated learning (FL) in Vehicular Ad hoc Networks (VANET) has garnered significant interest in research due to the advantages of reducing transmission overhead and protecting user privacy by communicating local dataset gradients instead of raw data. However, implementing FL in VANETs faces challenges, including limited communication resources, high vehicle mobility, and the statistical diversity of data distributions. In order to tackle these issues, this paper introduces a novel framework for hierarchical federated learning (HFL) over multi-hop clustering-based VANET. The proposed method utilizes a weighted combination of the average relative speed and cosine similarity of FL model parameters as a clustering metric to consider both data diversity and high vehicle mobility. This metric ensures convergence with minimum changes in cluster heads while tackling the complexities associated with non-independent and identically distributed (non-IID) data scenarios. Additionall",
    "path": "papers/24/01/2401.10361.json",
    "total_tokens": 906,
    "translated_title": "在多跳基于集群的车联网中的分层联邦学习",
    "translated_abstract": "在车联网中使用分层联邦学习（FL）引起了研究界的极大兴趣，因为通过通信本地数据集梯度而不是原始数据，可以减少传输开销并保护用户隐私。然而，在车联网中实施FL面临着有限的通信资源、高车辆移动性和数据分布的统计多样性等挑战。为了解决这些问题，本文引入了一种新的分层联邦学习（HFL）框架，用于基于多跳聚类的车联网。所提出的方法利用FL模型参数的平均相对速度和余弦相似度的加权组合作为聚类度量，以考虑数据多样性和高车辆移动性。这个度量可以在非独立同分布（non-IID）数据场景中保证最小变化簇头的收敛性，并解决与该场景相关的复杂性问题。",
    "tldr": "本文介绍了一种在多跳基于集群的车联网中的分层联邦学习（HFL）框架，该框架利用平均相对速度和余弦相似度对FL模型参数进行加权组合以作为聚类度量，以解决数据多样性和高车辆移动性带来的挑战。",
    "en_tdlr": "This paper proposes a hierarchical federated learning (HFL) framework in multi-hop cluster-based VANETs, which introduces a clustering metric based on the weighted combination of average relative speed and cosine similarity of FL model parameters to consider data diversity and vehicle mobility challenges in non-IID data scenarios."
}