{
    "title": "Tensor-based process control and monitoring for semiconductor manufacturing with unstable disturbances",
    "abstract": "With the development and popularity of sensors installed in manufacturing systems, complex data are collected during manufacturing processes, which brings challenges for traditional process control methods. This paper proposes a novel process control and monitoring method for the complex structure of high-dimensional image-based overlay errors (modeled in tensor form), which are collected in semiconductor manufacturing processes. The proposed method aims to reduce overlay errors using limited control recipes. We first build a high-dimensional process model and propose different tensor-on-vector regression algorithms to estimate parameters in the model to alleviate the curse of dimensionality. Then, based on the estimate of tensor parameters, the exponentially weighted moving average (EWMA) controller for tensor data is designed whose stability is theoretically guaranteed. Considering the fact that low-dimensional control recipes cannot compensate for all high-dimensional disturbances o",
    "link": "https://arxiv.org/abs/2401.17573",
    "context": "Title: Tensor-based process control and monitoring for semiconductor manufacturing with unstable disturbances\nAbstract: With the development and popularity of sensors installed in manufacturing systems, complex data are collected during manufacturing processes, which brings challenges for traditional process control methods. This paper proposes a novel process control and monitoring method for the complex structure of high-dimensional image-based overlay errors (modeled in tensor form), which are collected in semiconductor manufacturing processes. The proposed method aims to reduce overlay errors using limited control recipes. We first build a high-dimensional process model and propose different tensor-on-vector regression algorithms to estimate parameters in the model to alleviate the curse of dimensionality. Then, based on the estimate of tensor parameters, the exponentially weighted moving average (EWMA) controller for tensor data is designed whose stability is theoretically guaranteed. Considering the fact that low-dimensional control recipes cannot compensate for all high-dimensional disturbances o",
    "path": "papers/24/01/2401.17573.json",
    "total_tokens": 875,
    "translated_title": "基于张量的半导体制造过程控制与监控研究",
    "translated_abstract": "随着制造系统中安装传感器的发展和普及，制造过程中收集到了复杂的数据，给传统的过程控制方法带来了挑战。本文提出了一种新颖的工艺控制和监控方法，用于半导体制造过程中高维度基于图像的叠加误差（以张量形式建模）的复杂结构。所提出的方法旨在使用有限的控制配方减小叠加误差。首先建立了一个高维度的过程模型，并提出了不同的张量-向量回归算法来估计模型中的参数，以减轻维度灾难。然后，基于张量参数的估计，设计了具有稳定性的指数加权移动平均（EWMA）张量数据控制器，其稳定性在理论上得到了保证。考虑到低维度的控制配方不能弥补所有高维度扰动的事实。",
    "tldr": "本文提出了一种基于张量的工艺控制和监控方法，用于半导体制造过程中高维度基于图像的叠加误差的复杂结构。该方法通过有限的控制配方减小叠加误差，并设计了稳定的张量数据控制器来处理高维度扰动。",
    "en_tdlr": "This paper proposes a tensor-based process control and monitoring method for the complex structure of high-dimensional image-based overlay errors in semiconductor manufacturing processes. The method aims to reduce overlay errors using limited control recipes, and a stable tensor data controller is designed to handle high-dimensional disturbances."
}