{
    "title": "Deep Reinforcement Multi-agent Learning framework for Information Gathering with Local Gaussian Processes for Water Monitoring. (arXiv:2401.04631v1 [cs.AI])",
    "abstract": "The conservation of hydrological resources involves continuously monitoring their contamination. A multi-agent system composed of autonomous surface vehicles is proposed in this paper to efficiently monitor the water quality. To achieve a safe control of the fleet, the fleet policy should be able to act based on measurements and to the the fleet state. It is proposed to use Local Gaussian Processes and Deep Reinforcement Learning to jointly obtain effective monitoring policies. Local Gaussian processes, unlike classical global Gaussian processes, can accurately model the information in a dissimilar spatial correlation which captures more accurately the water quality information. A Deep convolutional policy is proposed, that bases the decisions on the observation on the mean and variance of this model, by means of an information gain reward. Using a Double Deep Q-Learning algorithm, agents are trained to minimize the estimation error in a safe manner thanks to a Consensus-based heuristi",
    "link": "http://arxiv.org/abs/2401.04631",
    "context": "Title: Deep Reinforcement Multi-agent Learning framework for Information Gathering with Local Gaussian Processes for Water Monitoring. (arXiv:2401.04631v1 [cs.AI])\nAbstract: The conservation of hydrological resources involves continuously monitoring their contamination. A multi-agent system composed of autonomous surface vehicles is proposed in this paper to efficiently monitor the water quality. To achieve a safe control of the fleet, the fleet policy should be able to act based on measurements and to the the fleet state. It is proposed to use Local Gaussian Processes and Deep Reinforcement Learning to jointly obtain effective monitoring policies. Local Gaussian processes, unlike classical global Gaussian processes, can accurately model the information in a dissimilar spatial correlation which captures more accurately the water quality information. A Deep convolutional policy is proposed, that bases the decisions on the observation on the mean and variance of this model, by means of an information gain reward. Using a Double Deep Q-Learning algorithm, agents are trained to minimize the estimation error in a safe manner thanks to a Consensus-based heuristi",
    "path": "papers/24/01/2401.04631.json",
    "total_tokens": 868,
    "translated_title": "用于水污染监测的深度强化多智能体学习框架和局部高斯过程",
    "translated_abstract": "为了有效监测水质，本文提出了一个由自主水面车组成的多智能体系统。为了实现对船队的安全控制，船队策略应该能够基于测量结果和船队状态进行行动。本文提出使用局部高斯过程和深度强化学习来联合获得有效的监测策略。局部高斯过程可以准确地建模不同空间相关性中的信息，从而更准确地捕捉水质信息。文中还提出了一种基于深度卷积策略的决策方法，通过观察这个模型的均值和方差，使用信息增益奖励进行决策。通过双重深度 Q 学习算法，智能体被训练以在安全的情况下尽量减小估计误差。",
    "tldr": "本文提出了一个深度强化多智能体学习框架，结合局部高斯过程，用于水污染监测。使用局部高斯过程准确建模不同空间相关性中的信息，并采用深度卷积策略决策方法来获得有效的监测策略。通过双重深度 Q 学习算法训练智能体以减小估计误差。"
}