{
    "title": "Weakly Semi-supervised Tool Detection in Minimally Invasive Surgery Videos. (arXiv:2401.02791v1 [cs.CV])",
    "abstract": "Surgical tool detection is essential for analyzing and evaluating minimally invasive surgery videos. Current approaches are mostly based on supervised methods that require large, fully instance-level labels (i.e., bounding boxes). However, large image datasets with instance-level labels are often limited because of the burden of annotation. Thus, surgical tool detection is important when providing image-level labels instead of instance-level labels since image-level annotations are considerably more time-efficient than instance-level annotations. In this work, we propose to strike a balance between the extremely costly annotation burden and detection performance. We further propose a co-occurrence loss, which considers a characteristic that some tool pairs often co-occur together in an image to leverage image-level labels. Encapsulating the knowledge of co-occurrence using the co-occurrence loss helps to overcome the difficulty in classification that originates from the fact that some ",
    "link": "http://arxiv.org/abs/2401.02791",
    "context": "Title: Weakly Semi-supervised Tool Detection in Minimally Invasive Surgery Videos. (arXiv:2401.02791v1 [cs.CV])\nAbstract: Surgical tool detection is essential for analyzing and evaluating minimally invasive surgery videos. Current approaches are mostly based on supervised methods that require large, fully instance-level labels (i.e., bounding boxes). However, large image datasets with instance-level labels are often limited because of the burden of annotation. Thus, surgical tool detection is important when providing image-level labels instead of instance-level labels since image-level annotations are considerably more time-efficient than instance-level annotations. In this work, we propose to strike a balance between the extremely costly annotation burden and detection performance. We further propose a co-occurrence loss, which considers a characteristic that some tool pairs often co-occur together in an image to leverage image-level labels. Encapsulating the knowledge of co-occurrence using the co-occurrence loss helps to overcome the difficulty in classification that originates from the fact that some ",
    "path": "papers/24/01/2401.02791.json",
    "total_tokens": 911,
    "translated_title": "弱半监督下的微创手术视频工具检测",
    "translated_abstract": "手术工具检测对于分析和评估微创手术视频至关重要。目前的方法主要基于需要大量完整的实例级标签（即边界框）的监督方法。然而，由于注释的负担，具有实例级标签的大型图像数据集通常很有限。因此，在提供图像级标签而不是实例级标签时，手术工具检测变得重要，因为图像级注释比实例级注释更具时间效率。在这项工作中，我们提出在极高的注释负担和检测性能之间寻求平衡。我们进一步提出了一种共现损失，该损失考虑了某些工具对在图像中经常共同出现的特性，以利用图像级标签。用共现损失对共现关系的知识进行封装有助于克服分类困难，因为一些手术工具的分类困难源于这样一个事实：它们经常以成对出现。",
    "tldr": "本研究提出了一种在微创手术视频中弱半监督下检测手术工具的方法。通过使用共现损失来利用图像级标签中工具对之间的共现关系，平衡了注释负担和检测性能，克服了分类困难。",
    "en_tdlr": "This paper proposes a weakly semi-supervised approach for tool detection in minimally invasive surgery videos. By utilizing the co-occurrence relationship between tools in image-level labels with the co-occurrence loss, it strikes a balance between annotation burden and detection performance, overcoming classification difficulties."
}