{
    "title": "Translate-Distill: Learning Cross-Language Dense Retrieval by Translation and Distillation. (arXiv:2401.04810v1 [cs.IR])",
    "abstract": "Prior work on English monolingual retrieval has shown that a cross-encoder trained using a large number of relevance judgments for query-document pairs can be used as a teacher to train more efficient, but similarly effective, dual-encoder student models. Applying a similar knowledge distillation approach to training an efficient dual-encoder model for Cross-Language Information Retrieval (CLIR), where queries and documents are in different languages, is challenging due to the lack of a sufficiently large training collection when the query and document languages differ. The state of the art for CLIR thus relies on translating queries, documents, or both from the large English MS MARCO training set, an approach called Translate-Train. This paper proposes an alternative, Translate-Distill, in which knowledge distillation from either a monolingual cross-encoder or a CLIR cross-encoder is used to train a dual-encoder CLIR student model. This richer design space enables the teacher model to",
    "link": "http://arxiv.org/abs/2401.04810",
    "context": "Title: Translate-Distill: Learning Cross-Language Dense Retrieval by Translation and Distillation. (arXiv:2401.04810v1 [cs.IR])\nAbstract: Prior work on English monolingual retrieval has shown that a cross-encoder trained using a large number of relevance judgments for query-document pairs can be used as a teacher to train more efficient, but similarly effective, dual-encoder student models. Applying a similar knowledge distillation approach to training an efficient dual-encoder model for Cross-Language Information Retrieval (CLIR), where queries and documents are in different languages, is challenging due to the lack of a sufficiently large training collection when the query and document languages differ. The state of the art for CLIR thus relies on translating queries, documents, or both from the large English MS MARCO training set, an approach called Translate-Train. This paper proposes an alternative, Translate-Distill, in which knowledge distillation from either a monolingual cross-encoder or a CLIR cross-encoder is used to train a dual-encoder CLIR student model. This richer design space enables the teacher model to",
    "path": "papers/24/01/2401.04810.json",
    "total_tokens": 907,
    "translated_title": "Translate-Distill: 通过翻译和蒸馏学习跨语言稠密检索",
    "translated_abstract": "先前关于英语单语检索的研究表明，使用大量查询-文档相关性判断训练的交互编码器可以用作教师模型来训练更高效但同样有效的双编码器学生模型。然而，在不同语言的查询和文档之间进行跨语言信息检索 (CLIR) 时应用类似的知识蒸馏方法是具有挑战性的，因为查询和文档语言不同时缺乏足够大的训练集合。现有的 CLIR 技术依赖于从庞大的英语 MS MARCO 训练集中翻译查询、文档或两者的方法，称为 Translate-Train。本文提出了一种替代方案 Translate-Distill，其中从单语交互编码器或 CLIR 交互编码器进行知识蒸馏，训练双编码器 CLIR 学生模型。这种更丰富的设计空间使得教师模型能够...",
    "tldr": "Translate-Distill 提出了一种使用翻译和蒸馏的方法来训练跨语言稠密检索模型，克服了在不同语言的情况下训练数据不足的挑战，相比现有方法有更高的效率和效果。",
    "en_tdlr": "Translate-Distill proposes a method using translation and distillation to train cross-language dense retrieval models, overcoming the challenge of insufficient training data in different languages, with higher efficiency and effectiveness compared to existing methods."
}