{
    "title": "Towards Universal Unsupervised Anomaly Detection in Medical Imaging. (arXiv:2401.10637v1 [eess.IV])",
    "abstract": "The increasing complexity of medical imaging data underscores the need for advanced anomaly detection methods to automatically identify diverse pathologies. Current methods face challenges in capturing the broad spectrum of anomalies, often limiting their use to specific lesion types in brain scans. To address this challenge, we introduce a novel unsupervised approach, termed \\textit{Reversed Auto-Encoders (RA)}, designed to create realistic pseudo-healthy reconstructions that enable the detection of a wider range of pathologies. We evaluate the proposed method across various imaging modalities, including magnetic resonance imaging (MRI) of the brain, pediatric wrist X-ray, and chest X-ray, and demonstrate superior performance in detecting anomalies compared to existing state-of-the-art methods. Our unsupervised anomaly detection approach may enhance diagnostic accuracy in medical imaging by identifying a broader range of unknown pathologies. Our code is publicly available at: \\url{htt",
    "link": "http://arxiv.org/abs/2401.10637",
    "context": "Title: Towards Universal Unsupervised Anomaly Detection in Medical Imaging. (arXiv:2401.10637v1 [eess.IV])\nAbstract: The increasing complexity of medical imaging data underscores the need for advanced anomaly detection methods to automatically identify diverse pathologies. Current methods face challenges in capturing the broad spectrum of anomalies, often limiting their use to specific lesion types in brain scans. To address this challenge, we introduce a novel unsupervised approach, termed \\textit{Reversed Auto-Encoders (RA)}, designed to create realistic pseudo-healthy reconstructions that enable the detection of a wider range of pathologies. We evaluate the proposed method across various imaging modalities, including magnetic resonance imaging (MRI) of the brain, pediatric wrist X-ray, and chest X-ray, and demonstrate superior performance in detecting anomalies compared to existing state-of-the-art methods. Our unsupervised anomaly detection approach may enhance diagnostic accuracy in medical imaging by identifying a broader range of unknown pathologies. Our code is publicly available at: \\url{htt",
    "path": "papers/24/01/2401.10637.json",
    "total_tokens": 886,
    "translated_title": "在医学成像中实现普适的无监督异常检测",
    "translated_abstract": "医学成像数据的复杂性日益增加，强调了需要先进的异常检测方法来自动识别各种病理。目前的方法在捕捉广泛异常范围方面存在挑战，通常限制其在脑部扫描中特定病变类型的使用。为了解决这个挑战，我们引入了一种新颖的无监督方法，称为“反向自编码器（RA）”，旨在创建逼真的伪健康重建，从而实现对更广泛病变范围的检测。我们评估了这种方法在包括脑部磁共振成像（MRI）、儿童腕关节X射线和胸部X射线在内的各种成像模态中，并且证明相比现有最先进方法，具有优越的异常检测性能。我们的无监督异常检测方法可以通过识别更广泛范围的未知病理来提高医学成像的诊断准确性。我们的代码公开可用: \\url{htt",
    "tldr": "本文提出了一种无监督异常检测方法，通过创建伪健康重建实现对更广泛病变范围的检测，并在不同的成像模态中展示了卓越的性能。"
}