{
    "title": "Robust Performance Evaluation of Independent and Identical Agents. (arXiv:2401.16542v1 [econ.TH])",
    "abstract": "A principal provides nondiscriminatory incentives for independent and identical agents. The principal cannot observe the agents' actions, nor does she know the entire set of actions available to them. It is shown, very generally, that any worst-case optimal contract is nonaffine in performances. In addition, each agent's pay must depend on the performance of another. In the case of two agents and binary output, existence of a worst-case optimal contract is established and it is proven that any such contract exhibits joint performance evaluation -- each agent's pay is strictly increasing in the performance of the other. The analysis identifies a fundamentally new channel leading to the optimality of nonlinear team-based incentive pay.",
    "link": "http://arxiv.org/abs/2401.16542",
    "context": "Title: Robust Performance Evaluation of Independent and Identical Agents. (arXiv:2401.16542v1 [econ.TH])\nAbstract: A principal provides nondiscriminatory incentives for independent and identical agents. The principal cannot observe the agents' actions, nor does she know the entire set of actions available to them. It is shown, very generally, that any worst-case optimal contract is nonaffine in performances. In addition, each agent's pay must depend on the performance of another. In the case of two agents and binary output, existence of a worst-case optimal contract is established and it is proven that any such contract exhibits joint performance evaluation -- each agent's pay is strictly increasing in the performance of the other. The analysis identifies a fundamentally new channel leading to the optimality of nonlinear team-based incentive pay.",
    "path": "papers/24/01/2401.16542.json",
    "total_tokens": 963,
    "translated_title": "独立而相同代理人的鲁棒性能评估",
    "translated_abstract": "一个委托方为独立而相同的代理人提供了非歧视性的激励。委托方无法观察到代理人的行动，也不知道他们的所有行动选择。通过广义的证明，我们发现，任何最坏情况下的最优合同都不是性能的线性函数。此外，每个代理人的报酬都必须依赖于其他人的表现。在有两个代理人和二进制输出的情况下，我们证明了最坏情况下的最优合同的存在，并且证明了任何这样的合同都具有联合性能评估——每个代理人的报酬都严格随着其他人的表现增加而增加。分析还确定了导致非线性团队激励报酬优化的基本新途径。",
    "tldr": "该论文研究了一个委托方为独立而相同的代理人提供非歧视性激励的问题，发现最坏情况下的最优合同不是性能的线性函数，并且每个代理人的报酬都依赖于其他人的表现。在有两个代理人和二进制输出的情况下，证明了最坏情况下的最优合同的存在，并且发现每个代理人的报酬都随着其他人的表现增加而增加。该分析还揭示了导致非线性团队激励报酬优化的新途径。",
    "en_tdlr": "This paper investigates the problem of providing non-discriminatory incentives to independent and identical agents by a principal. It is found that the worst-case optimal contract is nonaffine in performances and each agent's pay depends on the performance of another. For two agents with binary output, the existence of a worst-case optimal contract is proven, and it is shown that each agent's pay is strictly increasing in the performance of the other. The analysis also reveals a fundamentally new channel leading to the optimality of nonlinear team-based incentive pay."
}