{
    "title": "GA-SmaAt-GNet: Generative Adversarial Small Attention GNet for Extreme Precipitation Nowcasting. (arXiv:2401.09881v1 [cs.LG])",
    "abstract": "In recent years, data-driven modeling approaches have gained considerable traction in various meteorological applications, particularly in the realm of weather forecasting. However, these approaches often encounter challenges when dealing with extreme weather conditions. In light of this, we propose GA-SmaAt-GNet, a novel generative adversarial architecture that makes use of two methodologies aimed at enhancing the performance of deep learning models for extreme precipitation nowcasting. Firstly, it uses a novel SmaAt-GNet built upon the successful SmaAt-UNet architecture as generator. This network incorporates precipitation masks (binarized precipitation maps) as an additional data source, leveraging valuable information for improved predictions. Additionally, GA-SmaAt-GNet utilizes an attention-augmented discriminator inspired by the well-established Pix2Pix architecture. Furthermore, we assess the performance of GA-SmaAt-GNet using real-life precipitation dataset from the Netherland",
    "link": "http://arxiv.org/abs/2401.09881",
    "context": "Title: GA-SmaAt-GNet: Generative Adversarial Small Attention GNet for Extreme Precipitation Nowcasting. (arXiv:2401.09881v1 [cs.LG])\nAbstract: In recent years, data-driven modeling approaches have gained considerable traction in various meteorological applications, particularly in the realm of weather forecasting. However, these approaches often encounter challenges when dealing with extreme weather conditions. In light of this, we propose GA-SmaAt-GNet, a novel generative adversarial architecture that makes use of two methodologies aimed at enhancing the performance of deep learning models for extreme precipitation nowcasting. Firstly, it uses a novel SmaAt-GNet built upon the successful SmaAt-UNet architecture as generator. This network incorporates precipitation masks (binarized precipitation maps) as an additional data source, leveraging valuable information for improved predictions. Additionally, GA-SmaAt-GNet utilizes an attention-augmented discriminator inspired by the well-established Pix2Pix architecture. Furthermore, we assess the performance of GA-SmaAt-GNet using real-life precipitation dataset from the Netherland",
    "path": "papers/24/01/2401.09881.json",
    "total_tokens": 924,
    "translated_title": "GA-SmaAt-GNet：用于极端降水暂时预测的生成对抗小型注意力GNet",
    "translated_abstract": "近年来，数据驱动的建模方法在各种气象应用中获得了相当的关注，尤其是在天气预报领域。然而，这些方法在处理极端天气条件时常常面临挑战。鉴于此，我们提出了GA-SmaAt-GNet，这是一种新颖的生成对抗结构，利用了两种方法来增强深度学习模型在极端降水暂时预测中的性能。首先，它使用了一种基于成功的SmaAt-UNet结构构建的新型SmaAt-GNet作为生成器。该网络将降水掩码（二值化降水图）作为附加数据源，利用有价值的信息进行改进的预测。此外，GA-SmaAt-GNet还使用了一个灵感来自于著名的Pix2Pix结构的注意力增强鉴别器。另外，我们使用荷兰的实际降水数据集对GA-SmaAt-GNet的性能进行了评估。",
    "tldr": "GA-SmaAt-GNet是一种生成对抗架构，用于改进极端降水暂时预测的深度学习模型性能。它通过创建一个新的生成器和使用注意力增强鉴别器来利用降水掩码提供的额外信息，提高了预测质量。"
}