{
    "title": "Part-of-Speech Tagger for Bodo Language using Deep Learning approach. (arXiv:2401.03175v1 [cs.CL])",
    "abstract": "Language Processing systems such as Part-of-speech tagging, Named entity recognition, Machine translation, Speech recognition, and Language modeling (LM) are well-studied in high-resource languages. Nevertheless, research on these systems for several low-resource languages, including Bodo, Mizo, Nagamese, and others, is either yet to commence or is in its nascent stages. Language model plays a vital role in the downstream tasks of modern NLP. Extensive studies are carried out on LMs for high-resource languages. Nevertheless, languages such as Bodo, Rabha, and Mising continue to lack coverage. In this study, we first present BodoBERT, a language model for the Bodo language. To the best of our knowledge, this work is the first such effort to develop a language model for Bodo. Secondly, we present an ensemble DL-based POS tagging model for Bodo. The POS tagging model is based on combinations of BiLSTM with CRF and stacked embedding of BodoBERT with BytePairEmbeddings. We cover several lan",
    "link": "http://arxiv.org/abs/2401.03175",
    "context": "Title: Part-of-Speech Tagger for Bodo Language using Deep Learning approach. (arXiv:2401.03175v1 [cs.CL])\nAbstract: Language Processing systems such as Part-of-speech tagging, Named entity recognition, Machine translation, Speech recognition, and Language modeling (LM) are well-studied in high-resource languages. Nevertheless, research on these systems for several low-resource languages, including Bodo, Mizo, Nagamese, and others, is either yet to commence or is in its nascent stages. Language model plays a vital role in the downstream tasks of modern NLP. Extensive studies are carried out on LMs for high-resource languages. Nevertheless, languages such as Bodo, Rabha, and Mising continue to lack coverage. In this study, we first present BodoBERT, a language model for the Bodo language. To the best of our knowledge, this work is the first such effort to develop a language model for Bodo. Secondly, we present an ensemble DL-based POS tagging model for Bodo. The POS tagging model is based on combinations of BiLSTM with CRF and stacked embedding of BodoBERT with BytePairEmbeddings. We cover several lan",
    "path": "papers/24/01/2401.03175.json",
    "total_tokens": 1120,
    "translated_title": "使用深度学习方法的Bodo语词性标注器",
    "translated_abstract": "语言处理系统如词性标注、命名实体识别、机器翻译、语音识别和语言建模在资源丰富的语言中已经得到了广泛研究。然而，对于一些低资源语言，如Bodo、Mizo、Nagamese等，这些系统的研究要么尚未开始，要么处于起步阶段。语言模型在现代自然语言处理的下游任务中起着重要作用。对于资源丰富的语言已经进行了大量的语言模型研究。然而，像Bodo、Rabha和Mising这样的语言仍然缺乏相关研究。本研究首先提出了BodoBERT，一个用于Bodo语的语言模型。据我们所知，这项工作是第一个为Bodo开发语言模型的努力。其次，我们提出了一个基于集成深度学习的Bodo词性标注模型。该词性标注模型基于BiLSTM和CRF的组合，以及BodoBERT与BytePairEmbeddings的堆叠嵌入。我们涵盖了多种语言...（摘要被截断）",
    "tldr": "本文介绍了使用深度学习方法的Bodo语词性标注器。首先，我们提出了Bodo语言模型BodoBERT，这项工作是第一个为Bodo开发的语言模型。其次，我们提出了基于深度学习的Bodo词性标注模型，该模型利用了BiLSTM、CRF和BodoBERT与BytePairEmbeddings的组合。尽管研究已经在资源丰富的语言中进行了大量的语言模型和词性标注模型的研究，但对于低资源语言如Bodo，仍然缺乏相关研究。",
    "en_tdlr": "This paper presents a deep learning-based Part-of-Speech tagger for the Bodo language. The authors first develop a language model called BodoBERT specifically for Bodo, which is the first of its kind. Then, they propose an ensemble model that combines BiLSTM, CRF, and BodoBERT with BytePairEmbeddings for POS tagging. Despite extensive research on language models and POS tagging models in high-resource languages, there is still a lack of study on low-resource languages like Bodo."
}