{
    "title": "Stable Marriage with One-Sided Preference. (arXiv:2401.03231v1 [cs.DM] CROSS LISTED)",
    "abstract": "Many countries around the world, including Korea, use the school choice lottery system. However, this method has a problem in that many students are assigned to less-preferred schools based on the lottery results. In addition, the task of finding a good assignment with ties often has a time complexity of NP, making it a very difficult problem to improve the quality of the assignment.  In this paper, we prove that the problem of finding a stable matching that maximizes the student-oriented preference utility in a two-sided market with one-sided preference can be solved in polynomial time, and we verify through experiments that the quality of assignment is improved. The main contributions of this paper are as follows. We found that stable student-oriented allocation in a two-sided market with one-sided preferences is the same as stable allocation in a two-sided market with symmetric preferences. In addition, we defined a method to quantify the quality of allocation from a preference util",
    "link": "http://arxiv.org/abs/2401.03231",
    "context": "Title: Stable Marriage with One-Sided Preference. (arXiv:2401.03231v1 [cs.DM] CROSS LISTED)\nAbstract: Many countries around the world, including Korea, use the school choice lottery system. However, this method has a problem in that many students are assigned to less-preferred schools based on the lottery results. In addition, the task of finding a good assignment with ties often has a time complexity of NP, making it a very difficult problem to improve the quality of the assignment.  In this paper, we prove that the problem of finding a stable matching that maximizes the student-oriented preference utility in a two-sided market with one-sided preference can be solved in polynomial time, and we verify through experiments that the quality of assignment is improved. The main contributions of this paper are as follows. We found that stable student-oriented allocation in a two-sided market with one-sided preferences is the same as stable allocation in a two-sided market with symmetric preferences. In addition, we defined a method to quantify the quality of allocation from a preference util",
    "path": "papers/24/01/2401.03231.json",
    "total_tokens": 878,
    "translated_title": "单向偏好的稳定婚姻匹配问题",
    "translated_abstract": "全球许多国家，包括韩国，使用学校选择抽签系统。然而，这种方法存在一个问题，即根据抽签结果将许多学生分配到次优选的学校。此外，寻找带有并列的好分配任务通常具有NP的时间复杂度，使其成为提高分配质量的非常困难的问题。在本文中，我们证明在具有单向偏好的双边市场中找到最大化学生导向偏好效用的稳定匹配问题可以在多项式时间内解决，并通过实验证实分配质量得到改善。本文的主要贡献如下。我们发现在具有单向偏好的双边市场中，稳定的学生导向分配与具有对称偏好的双边市场中的稳定分配是相同的。此外，我们定义了一种从偏好效用中量化分配质量的方法。",
    "tldr": "本文的主要贡献是证明了在具有单向偏好的双边市场中，可以在多项式时间内解决寻找最大化学生导向偏好效用的稳定匹配问题，并证明了通过这种方法可以改善分配质量。",
    "en_tdlr": "The main contribution of this paper is to prove that the problem of finding a stable matching that maximizes the student-oriented preference utility in a two-sided market with one-sided preference can be solved in polynomial time, and demonstrate that the quality of assignment is improved through experiments."
}