{
    "title": "Biases in Expected Goals Models Confound Finishing Ability. (arXiv:2401.09940v1 [cs.LG])",
    "abstract": "Expected Goals (xG) has emerged as a popular tool for evaluating finishing skill in soccer analytics. It involves comparing a player's cumulative xG with their actual goal output, where consistent overperformance indicates strong finishing ability. However, the assessment of finishing skill in soccer using xG remains contentious due to players' difficulty in consistently outperforming their cumulative xG. In this paper, we aim to address the limitations and nuances surrounding the evaluation of finishing skill using xG statistics. Specifically, we explore three hypotheses: (1) the deviation between actual and expected goals is an inadequate metric due to the high variance of shot outcomes and limited sample sizes, (2) the inclusion of all shots in cumulative xG calculation may be inappropriate, and (3) xG models contain biases arising from interdependencies in the data that affect skill measurement. We found that sustained overperformance of cumulative xG requires both high shot volume",
    "link": "http://arxiv.org/abs/2401.09940",
    "context": "Title: Biases in Expected Goals Models Confound Finishing Ability. (arXiv:2401.09940v1 [cs.LG])\nAbstract: Expected Goals (xG) has emerged as a popular tool for evaluating finishing skill in soccer analytics. It involves comparing a player's cumulative xG with their actual goal output, where consistent overperformance indicates strong finishing ability. However, the assessment of finishing skill in soccer using xG remains contentious due to players' difficulty in consistently outperforming their cumulative xG. In this paper, we aim to address the limitations and nuances surrounding the evaluation of finishing skill using xG statistics. Specifically, we explore three hypotheses: (1) the deviation between actual and expected goals is an inadequate metric due to the high variance of shot outcomes and limited sample sizes, (2) the inclusion of all shots in cumulative xG calculation may be inappropriate, and (3) xG models contain biases arising from interdependencies in the data that affect skill measurement. We found that sustained overperformance of cumulative xG requires both high shot volume",
    "path": "papers/24/01/2401.09940.json",
    "total_tokens": 883,
    "translated_title": "期望进球模型中的偏见影响了射门能力",
    "translated_abstract": "期望进球（xG）已成为评估足球分析中射门技能的一种常用工具。它涉及将球员的累积xG与实际进球数量进行比较，如果持续表现超出预期，则表明射门能力强。然而，使用xG统计评估足球射门技能仍存在争议，因为球员很难在持续表现中超出累积xG。本文旨在解决使用xG统计评估射门能力时的限制和细微差别。具体而言，我们探讨了三个假设：（1）实际进球和预期进球之间的偏差是一个不足的度量标准，因为射门结果的差异和样本量有限，（2）在累积xG计算中包含所有射门可能不合适，并且（3）xG模型中存在数据相关性引起的偏见，影响了技能测量。我们发现，持续超出累积xG需要高射门频率。",
    "tldr": "本研究旨在解决使用期望进球（xG）统计评估射门能力时的限制和偏见。研究发现，持续超出累积xG需要高射门频率。"
}