{
    "title": "Surgical-DINO: Adapter Learning of Foundation Model for Depth Estimation in Endoscopic Surgery. (arXiv:2401.06013v1 [cs.CV])",
    "abstract": "Purpose: Depth estimation in robotic surgery is vital in 3D reconstruction, surgical navigation and augmented reality visualization. Although the foundation model exhibits outstanding performance in many vision tasks, including depth estimation (e.g., DINOv2), recent works observed its limitations in medical and surgical domain-specific applications. This work presents a low-ranked adaptation (LoRA) of the foundation model for surgical depth estimation. Methods: We design a foundation model-based depth estimation method, referred to as Surgical-DINO, a low-rank adaptation of the DINOv2 for depth estimation in endoscopic surgery. We build LoRA layers and integrate them into DINO to adapt with surgery-specific domain knowledge instead of conventional fine-tuning. During training, we freeze the DINO image encoder, which shows excellent visual representation capacity, and only optimize the LoRA layers and depth decoder to integrate features from the surgical scene. Results: Our model is ex",
    "link": "http://arxiv.org/abs/2401.06013",
    "context": "Title: Surgical-DINO: Adapter Learning of Foundation Model for Depth Estimation in Endoscopic Surgery. (arXiv:2401.06013v1 [cs.CV])\nAbstract: Purpose: Depth estimation in robotic surgery is vital in 3D reconstruction, surgical navigation and augmented reality visualization. Although the foundation model exhibits outstanding performance in many vision tasks, including depth estimation (e.g., DINOv2), recent works observed its limitations in medical and surgical domain-specific applications. This work presents a low-ranked adaptation (LoRA) of the foundation model for surgical depth estimation. Methods: We design a foundation model-based depth estimation method, referred to as Surgical-DINO, a low-rank adaptation of the DINOv2 for depth estimation in endoscopic surgery. We build LoRA layers and integrate them into DINO to adapt with surgery-specific domain knowledge instead of conventional fine-tuning. During training, we freeze the DINO image encoder, which shows excellent visual representation capacity, and only optimize the LoRA layers and depth decoder to integrate features from the surgical scene. Results: Our model is ex",
    "path": "papers/24/01/2401.06013.json",
    "total_tokens": 1021,
    "translated_title": "在内窥镜手术中深度估计的手术DINO：基于基础模型的适配器学习",
    "translated_abstract": "目的：在机器人手术中进行深度估计对于三维重建、手术导航和增强现实可视化至关重要。尽管基础模型在许多视觉任务中表现出色，包括深度估计（如DINOv2），但最近的研究观察到其在医学和手术特定应用中的局限性。本研究提出了一种手术深度估计的低秩适配（LoRA）基础模型。方法：我们设计了一种基于基础模型的深度估计方法，称为Surgical-DINO，这是DINOv2在内窥镜手术中深度估计中的低秩适配。我们在DINO中构建了LoRA层，并将其整合到DINO中，以适应手术特定的领域知识，而不是传统的微调方法。在训练过程中，我们冻结了DINO的图像编码器，该编码器表现出优秀的视觉表示能力，只优化了LoRA层和深度解码器，以整合手术场景的特征。结果：我们的模型是ex...",
    "tldr": "本研究提出了一种基于基础模型的适配器学习方法，针对内窥镜手术中的深度估计问题进行了改进。通过在DINO模型中构建LoRA层，并将其与手术场景的特征结合起来，实现了手术特定的深度估计。实验结果表明，该方法在内窥镜手术中取得了良好的性能。"
}