{
    "title": "Vision-Assisted Digital Twin Creation for mmWave Beam Management",
    "abstract": "In the context of communication networks, digital twin technology provides a means to replicate the radio frequency (RF) propagation environment as well as the system behaviour, allowing for a way to optimize the performance of a deployed system based on simulations. One of the key challenges in the application of Digital Twin technology to mmWave systems is the prevalent channel simulators' stringent requirements on the accuracy of the 3D Digital Twin, reducing the feasibility of the technology in real applications. We propose a practical Digital Twin creation pipeline and a channel simulator, that relies only on a single mounted camera and position information. We demonstrate the performance benefits compared to methods that do not explicitly model the 3D environment, on downstream sub-tasks in beam acquisition, using the real-world dataset of the DeepSense6G challenge",
    "link": "https://arxiv.org/abs/2401.17781",
    "context": "Title: Vision-Assisted Digital Twin Creation for mmWave Beam Management\nAbstract: In the context of communication networks, digital twin technology provides a means to replicate the radio frequency (RF) propagation environment as well as the system behaviour, allowing for a way to optimize the performance of a deployed system based on simulations. One of the key challenges in the application of Digital Twin technology to mmWave systems is the prevalent channel simulators' stringent requirements on the accuracy of the 3D Digital Twin, reducing the feasibility of the technology in real applications. We propose a practical Digital Twin creation pipeline and a channel simulator, that relies only on a single mounted camera and position information. We demonstrate the performance benefits compared to methods that do not explicitly model the 3D environment, on downstream sub-tasks in beam acquisition, using the real-world dataset of the DeepSense6G challenge",
    "path": "papers/24/01/2401.17781.json",
    "total_tokens": 784,
    "translated_title": "基于视觉的毫米波波束管理数字孪生创建技术",
    "translated_abstract": "在通信网络的背景下，数字孪生技术提供了一种重复无线电频率（RF）传播环境以及系统行为的方式，允许基于模拟来优化部署系统的性能。数字孪生技术应用于毫米波系统的一个关键挑战是现有通道模拟器对3D数字孪生精度的严格要求，降低了技术在实际应用中的可行性。我们提出了一种实际的数字孪生创建流程和通道模拟器，仅依赖于单个安装的摄像头和位置信息。我们使用DeepSense6G挑战的真实数据集，在波束获取的下游子任务中，展示了与不明确建模3D环境的方法相比的性能优势。",
    "tldr": "这项研究提出了一种基于视觉的数字孪生创建技术，通过使用单个摄像头和位置信息，有效解决了在毫米波系统中3D数字孪生的精度要求，并展示了在波束获取任务中的性能优势。",
    "en_tdlr": "This research presents a vision-assisted digital twin creation technology that addresses the accuracy requirements of 3D digital twin in mmWave systems with a single camera and position information, and demonstrates performance advantages in beam acquisition tasks."
}