{
    "title": "CARE: Ensemble Adversarial Robustness Evaluation Against Adaptive Attackers for Security Applications. (arXiv:2401.11126v1 [cs.CR])",
    "abstract": "Ensemble defenses, are widely employed in various security-related applications to enhance model performance and robustness. The widespread adoption of these techniques also raises many questions: Are general ensembles defenses guaranteed to be more robust than individuals? Will stronger adaptive attacks defeat existing ensemble defense strategies as the cybersecurity arms race progresses? Can ensemble defenses achieve adversarial robustness to different types of attacks simultaneously and resist the continually adjusted adaptive attacks? Unfortunately, these critical questions remain unresolved as there are no platforms for comprehensive evaluation of ensemble adversarial attacks and defenses in the cybersecurity domain. In this paper, we propose a general Cybersecurity Adversarial Robustness Evaluation (CARE) platform aiming to bridge this gap.",
    "link": "http://arxiv.org/abs/2401.11126",
    "context": "Title: CARE: Ensemble Adversarial Robustness Evaluation Against Adaptive Attackers for Security Applications. (arXiv:2401.11126v1 [cs.CR])\nAbstract: Ensemble defenses, are widely employed in various security-related applications to enhance model performance and robustness. The widespread adoption of these techniques also raises many questions: Are general ensembles defenses guaranteed to be more robust than individuals? Will stronger adaptive attacks defeat existing ensemble defense strategies as the cybersecurity arms race progresses? Can ensemble defenses achieve adversarial robustness to different types of attacks simultaneously and resist the continually adjusted adaptive attacks? Unfortunately, these critical questions remain unresolved as there are no platforms for comprehensive evaluation of ensemble adversarial attacks and defenses in the cybersecurity domain. In this paper, we propose a general Cybersecurity Adversarial Robustness Evaluation (CARE) platform aiming to bridge this gap.",
    "path": "papers/24/01/2401.11126.json",
    "total_tokens": 839,
    "translated_title": "CARE: 针对安全应用的自适应攻击者的集成对抗鲁棒性评估",
    "translated_abstract": "集成防御在各种安全相关应用中被广泛采用，以提高模型的性能和鲁棒性。然而，这些技术的广泛应用也引发了许多问题：一般的集成防御是否确保比个体更具鲁棒性？当网络安全领域的攻击与防御不断升级时，更强大的自适应攻击是否会击败现有的集成防御策略？集成防御是否能够同时对不同类型的攻击达到对抗性鲁棒性并抵御不断调整的自适应攻击？不幸的是，由于网络安全领域没有全面评估集成对抗攻击和防御的平台，这些重要问题仍然没有得到解决。在本文中，我们提出了一个名为CARE的通用网络安全对抗鲁棒性评估平台，旨在填补这一空白。",
    "tldr": "本研究提出了一个名为CARE的通用网络安全对抗鲁棒性评估平台，旨在为解决集成对抗攻击和防御中的关键问题提供一个综合评估平台。"
}