{
    "title": "Income and emotional well-being: Evidence for well-being plateauing around $200,000 per year. (arXiv:2401.05347v1 [econ.GN])",
    "abstract": "In a notable instance of adversarial collaboration (Killingsworth et al., 2023), Matthew Killingsworth and Daniel Kahneman, together with facilitator Barbara Mellers, recently set out to resolve the apparent conflict between the contradictory findings that larger incomes make people happier up to a certain threshold, after which the gains to happiness from additional income plateaus (Kahneman and Deaton, 2010), and that happiness increases consistently with income without reaching a plateau (Killingsworth, 2021). The adversarial collaboration validates the former finding for the most unhappy individuals in the sample, but argues that the latter finding is true for the remaining parts of the sample. In this note, we show that this proposed \"resolution\" hinges on dubious assumptions, most notably that the plateau occurs at the threshold $\\$$100,000 per yer. Relaxing this assumption, and using well-established econometric methods to search for the optimal threshold in a data-driven way, w",
    "link": "http://arxiv.org/abs/2401.05347",
    "context": "Title: Income and emotional well-being: Evidence for well-being plateauing around $200,000 per year. (arXiv:2401.05347v1 [econ.GN])\nAbstract: In a notable instance of adversarial collaboration (Killingsworth et al., 2023), Matthew Killingsworth and Daniel Kahneman, together with facilitator Barbara Mellers, recently set out to resolve the apparent conflict between the contradictory findings that larger incomes make people happier up to a certain threshold, after which the gains to happiness from additional income plateaus (Kahneman and Deaton, 2010), and that happiness increases consistently with income without reaching a plateau (Killingsworth, 2021). The adversarial collaboration validates the former finding for the most unhappy individuals in the sample, but argues that the latter finding is true for the remaining parts of the sample. In this note, we show that this proposed \"resolution\" hinges on dubious assumptions, most notably that the plateau occurs at the threshold $\\$$100,000 per yer. Relaxing this assumption, and using well-established econometric methods to search for the optimal threshold in a data-driven way, w",
    "path": "papers/24/01/2401.05347.json",
    "total_tokens": 1022,
    "translated_title": "收入与情感幸福感：证据表明，年收入达到20万美元后幸福感趋于稳定",
    "translated_abstract": "在一次非常值得注意的对抗性合作中（Killingsworth等人，2023），Matthew Killingsworth和Daniel Kahneman与主持人Barbara Mellers最近着手解决一个矛盾发现的问题，即较高的收入在某个阈值之前会让人更加幸福，但之后收入增加对幸福感的提升逐渐趋于稳定（Kahneman和Deaton，2010），而幸福感则会随收入的增加而持续增加而不会达到稳定点（Killingsworth，2021）。这种对抗性合作验证了该样本中最不幸福者的幸福感受到收入的影响，但同时也表明剩余部分样本幸福感与收入呈现一致的关系。在本文中，我们展示了这种所谓的“解决方法”建立在可疑的假设上，其中最重要的是收入稳定点发生在每年10万美元的阈值上。通过放宽这个假设，并使用已确定的计量经济学方法以数据驱动的方式寻找最优阈值，我们的研究结果展示了大约20万美元为收入幸福感趋于稳定的阈值。",
    "tldr": "该研究通过对抗性合作验证了在样本中较不幸福的个体收入对幸福感的影响，并发现对于其他样本，幸福感与收入之间呈现一致的关系。研究结果显示，年收入约为20万美元时幸福感趋于稳定。",
    "en_tdlr": "This study validates the impact of income on happiness among individuals with lower well-being in the sample and finds a consistent relationship between income and happiness for the rest of the sample. The study shows that happiness tends to plateau at an annual income of around $200,000."
}