{
    "title": "Dynamic portfolio selection under generalized disappointment aversion. (arXiv:2401.08323v1 [q-fin.MF])",
    "abstract": "This paper addresses the continuous-time portfolio selection problem under generalized disappointment aversion (GDA). The implicit definition of the certainty equivalent within GDA preferences introduces time inconsistency to this problem. We provide the sufficient and necessary conditions for a strategy to be an equilibrium by a fully nonlinear ordinary differential equation (ODE). Through an exploration of the existence and uniqueness of solution to the ODE, we establish the existence and uniqueness of the equilibrium. Our findings indicate that under disappointment aversion (DA) preferences, non-participation in the stock market is the unique equilibrium. The numerical analysis reveals that, under GDA preferences, the investment proportion in the stock market consistently remains smaller than the investment proportion under the classical Expected Utility (EU) theory.",
    "link": "http://arxiv.org/abs/2401.08323",
    "context": "Title: Dynamic portfolio selection under generalized disappointment aversion. (arXiv:2401.08323v1 [q-fin.MF])\nAbstract: This paper addresses the continuous-time portfolio selection problem under generalized disappointment aversion (GDA). The implicit definition of the certainty equivalent within GDA preferences introduces time inconsistency to this problem. We provide the sufficient and necessary conditions for a strategy to be an equilibrium by a fully nonlinear ordinary differential equation (ODE). Through an exploration of the existence and uniqueness of solution to the ODE, we establish the existence and uniqueness of the equilibrium. Our findings indicate that under disappointment aversion (DA) preferences, non-participation in the stock market is the unique equilibrium. The numerical analysis reveals that, under GDA preferences, the investment proportion in the stock market consistently remains smaller than the investment proportion under the classical Expected Utility (EU) theory.",
    "path": "papers/24/01/2401.08323.json",
    "total_tokens": 771,
    "translated_title": "广义失望厌恶下的动态投资组合选择",
    "translated_abstract": "本文研究了广义失望厌恶（GDA）环境下的连续时间投资组合选择问题。GDA偏好中对确定等价值的隐式定义引入了时间不一致性。通过对一个非线性常微分方程（ODE）的解存在性和唯一性的探讨，我们建立了均衡的存在性和唯一性。研究结果表明，在失望厌恶（DA）偏好下，不参与股票市场是唯一的均衡策略。数值分析表明，在GDA偏好下，股票市场的投资比例始终小于经典预期效用理论（EU）下的投资比例。",
    "tldr": "本文研究了广义失望厌恶（GDA）环境下的动态投资组合选择问题，重点在于确定了均衡的存在性和唯一性，并发现在失望厌恶偏好下，不参与股票市场是唯一的均衡策略。"
}