{
    "title": "RAPTOR: Recursive Abstractive Processing for Tree-Organized Retrieval",
    "abstract": "Retrieval-augmented language models can better adapt to changes in world state and incorporate long-tail knowledge. However, most existing methods retrieve only short contiguous chunks from a retrieval corpus, limiting holistic understanding of the overall document context. We introduce the novel approach of recursively embedding, clustering, and summarizing chunks of text, constructing a tree with differing levels of summarization from the bottom up. At inference time, our RAPTOR model retrieves from this tree, integrating information across lengthy documents at different levels of abstraction. Controlled experiments show that retrieval with recursive summaries offers significant improvements over traditional retrieval-augmented LMs on several tasks. On question-answering tasks that involve complex, multi-step reasoning, we show state-of-the-art results; for example, by coupling RAPTOR retrieval with the use of GPT-4, we can improve the best performance on the QuALITY benchmark by 20%",
    "link": "https://arxiv.org/abs/2401.18059",
    "context": "Title: RAPTOR: Recursive Abstractive Processing for Tree-Organized Retrieval\nAbstract: Retrieval-augmented language models can better adapt to changes in world state and incorporate long-tail knowledge. However, most existing methods retrieve only short contiguous chunks from a retrieval corpus, limiting holistic understanding of the overall document context. We introduce the novel approach of recursively embedding, clustering, and summarizing chunks of text, constructing a tree with differing levels of summarization from the bottom up. At inference time, our RAPTOR model retrieves from this tree, integrating information across lengthy documents at different levels of abstraction. Controlled experiments show that retrieval with recursive summaries offers significant improvements over traditional retrieval-augmented LMs on several tasks. On question-answering tasks that involve complex, multi-step reasoning, we show state-of-the-art results; for example, by coupling RAPTOR retrieval with the use of GPT-4, we can improve the best performance on the QuALITY benchmark by 20%",
    "path": "papers/24/01/2401.18059.json",
    "total_tokens": 920,
    "translated_title": "RAPTOR: 递归抽象处理用于树状检索",
    "translated_abstract": "检索增强的语言模型可以更好地适应世界状态的变化，并结合长尾知识。然而，大多数现有的方法仅从检索语料库中检索短连续块，限制了对整体文档上下文的整体理解。我们引入了一种新颖的方法，即递归嵌入、聚类和摘要文本块，从下往上构建具有不同摘要级别的树。在推理时，我们的RAPTOR模型从这棵树中检索，将不同抽象级别的信息整合到长度较长的文档中。控制实验表明，使用递归摘要的检索在几个任务上比传统检索增强的语言模型有显著改进。在涉及复杂的多步推理的问答任务上，我们展示了最先进的结果；例如，通过将RAPTOR检索与GPT-4的使用相结合，我们可以将QuALITY基准测试的最佳性能提高20％。",
    "tldr": "本论文提出了一种递归嵌入、聚类和摘要的方法，通过构建不同摘要级别的树，从下往上整合并检索长度较长的文档，对传统检索增强的语言模型进行改进，实现了在复杂的多步推理问答任务上的最先进的结果提升。",
    "en_tdlr": "This paper introduces a novel approach of recursively embedding, clustering, and summarizing chunks of text, constructing a tree with differing levels of summarization from the bottom up. The approach significantly improves retrieval-augmented language models on complex, multi-step reasoning question-answering tasks, achieving state-of-the-art results."
}