{
    "title": "Costly Persuasion by a Partially Informed Sender. (arXiv:2401.14087v1 [econ.TH])",
    "abstract": "I study a model of costly Bayesian persuasion by a privately and partially informed sender who conducts a public experiment. The cost of running an experiment is the expected reduction of a weighted log-likelihood ratio function of the sender's belief. This is microfounded by a Wald's sequential sampling problem where good news and bad news cost differently. I focus on equilibria that satisfy the D1 criterion. The equilibrium outcome depends on the relative costs of drawing good and bad news in the experiment. If bad news is more costly, there exists a unique separating equilibrium, and the receiver unambiguously benefits from the sender's private information. If good news is more costly, the single-crossing property fails. There may exist pooling and partial pooling equilibria, and in some equilibria, the receiver strictly suffers from sender private information.",
    "link": "http://arxiv.org/abs/2401.14087",
    "context": "Title: Costly Persuasion by a Partially Informed Sender. (arXiv:2401.14087v1 [econ.TH])\nAbstract: I study a model of costly Bayesian persuasion by a privately and partially informed sender who conducts a public experiment. The cost of running an experiment is the expected reduction of a weighted log-likelihood ratio function of the sender's belief. This is microfounded by a Wald's sequential sampling problem where good news and bad news cost differently. I focus on equilibria that satisfy the D1 criterion. The equilibrium outcome depends on the relative costs of drawing good and bad news in the experiment. If bad news is more costly, there exists a unique separating equilibrium, and the receiver unambiguously benefits from the sender's private information. If good news is more costly, the single-crossing property fails. There may exist pooling and partial pooling equilibria, and in some equilibria, the receiver strictly suffers from sender private information.",
    "path": "papers/24/01/2401.14087.json",
    "total_tokens": 1003,
    "translated_title": "高昂的说服成本与部分信息的发送者",
    "translated_abstract": "本文研究了由一个拥有私有且部分信息的发送者进行的昂贵的贝叶斯说服模型，该发送者进行了一个公共实验。实验的成本是发送者信念的加权对数似然比函数的期望减少。这个模型通过一个沃尔德的顺序抽样问题得到微基础，其中好消息和坏消息的成本不同。我们关注满足D1准则的均衡。均衡结果取决于实验中获得好消息和坏消息的相对成本。如果坏消息的成本更高，则存在唯一的分离均衡，并且接收者明确受益于发送者的私有信息。如果好消息的成本更高，则单点交叉特性不成立。可能存在汇集和部分汇集均衡，在某些均衡中，接收者会明确受到发送者私有信息的伤害。",
    "tldr": "本研究探讨了具有高昂成本的贝叶斯说服模型，研究对象是一位私人且部分信息知情的发送者在进行公共实验。研究发现实验中好消息和坏消息的成本差异对均衡结果具有重要影响，坏消息成本高时，存在唯一的分离均衡，接收者受益于发送者的私有信息；而好消息成本高时，均衡情况可能出现汇集和部分汇集均衡，接收者可能会因为发送者私有信息而受到损害。",
    "en_tdlr": "This study explores a costly Bayesian persuasion model, focusing on a privately and partially informed sender conducting a public experiment. It finds that the cost difference between good and bad news in the experiment significantly affects the equilibrium outcome. When the cost of bad news is higher, a unique separating equilibrium exists, and the receiver benefits from the sender's private information. However, when the cost of good news is higher, pooling and partial pooling equilibria may occur, and the receiver may suffer from the sender's private information."
}