{
    "title": "Structure-Preserving Physics-Informed Neural Networks With Energy or Lyapunov Structure. (arXiv:2401.04986v1 [cs.LG])",
    "abstract": "Recently, there has been growing interest in using physics-informed neural networks (PINNs) to solve differential equations. However, the preservation of structure, such as energy and stability, in a suitable manner has yet to be established. This limitation could be a potential reason why the learning process for PINNs is not always efficient and the numerical results may suggest nonphysical behavior. Besides, there is little research on their applications on downstream tasks. To address these issues, we propose structure-preserving PINNs to improve their performance and broaden their applications for downstream tasks. Firstly, by leveraging prior knowledge about the physical system, a structure-preserving loss function is designed to assist the PINN in learning the underlying structure. Secondly, a framework that utilizes structure-preserving PINN for robust image recognition is proposed. Here, preserving the Lyapunov structure of the underlying system ensures the stability of the sy",
    "link": "http://arxiv.org/abs/2401.04986",
    "context": "Title: Structure-Preserving Physics-Informed Neural Networks With Energy or Lyapunov Structure. (arXiv:2401.04986v1 [cs.LG])\nAbstract: Recently, there has been growing interest in using physics-informed neural networks (PINNs) to solve differential equations. However, the preservation of structure, such as energy and stability, in a suitable manner has yet to be established. This limitation could be a potential reason why the learning process for PINNs is not always efficient and the numerical results may suggest nonphysical behavior. Besides, there is little research on their applications on downstream tasks. To address these issues, we propose structure-preserving PINNs to improve their performance and broaden their applications for downstream tasks. Firstly, by leveraging prior knowledge about the physical system, a structure-preserving loss function is designed to assist the PINN in learning the underlying structure. Secondly, a framework that utilizes structure-preserving PINN for robust image recognition is proposed. Here, preserving the Lyapunov structure of the underlying system ensures the stability of the sy",
    "path": "papers/24/01/2401.04986.json",
    "total_tokens": 871,
    "translated_title": "保持结构的物理信息神经网络：基于能量或李雅普诺夫结构",
    "translated_abstract": "最近，使用物理信息神经网络(PINNs)解决微分方程的兴趣不断增加。然而，如何以适当的方式保持能量和稳定性等结构，尚未得到确认。这种限制可能是PINNs学习过程效率不高和数值结果可能表现出非物理行为的潜在原因。此外，对于它们在下游任务上的应用，研究还很少。为了解决这些问题，我们提出了保持结构的PINNs，以提高它们的性能并扩展它们在下游任务中的应用。首先，通过利用对物理系统的先验知识，设计了一个保持结构的损失函数，帮助PINN学习潜在结构。其次，我们提出了一个利用保持结构的PINN进行鲁棒图像识别的框架。在这里，保持底层系统的李雅普诺夫结构确保系统的稳定性。",
    "tldr": "这项研究提出了一种保持结构的物理信息神经网络(PINNs)方法，通过设计保持结构的损失函数和应用于图像识别任务，提高了PINNs的性能和应用范围。",
    "en_tdlr": "This research proposes a structure-preserving approach for physics-informed neural networks (PINNs), improving their performance and expanding their applications by designing a structure-preserving loss function and utilizing them in image recognition tasks."
}