{
    "title": "QuantumSEA: In-Time Sparse Exploration for Noise Adaptive Quantum Circuits. (arXiv:2401.05571v1 [quant-ph])",
    "abstract": "Parameterized Quantum Circuits (PQC) have obtained increasing popularity thanks to their great potential for near-term Noisy Intermediate-Scale Quantum (NISQ) computers. Achieving quantum advantages usually requires a large number of qubits and quantum circuits with enough capacity. However, limited coherence time and massive quantum noises severely constrain the size of quantum circuits that can be executed reliably on real machines. To address these two pain points, we propose QuantumSEA, an in-time sparse exploration for noise-adaptive quantum circuits, aiming to achieve two key objectives: (1) implicit circuits capacity during training - by dynamically exploring the circuit's sparse connectivity and sticking a fixed small number of quantum gates throughout the training which satisfies the coherence time and enjoy light noises, enabling feasible executions on real quantum devices; (2) noise robustness - by jointly optimizing the topology and parameters of quantum circuits under real",
    "link": "http://arxiv.org/abs/2401.05571",
    "context": "Title: QuantumSEA: In-Time Sparse Exploration for Noise Adaptive Quantum Circuits. (arXiv:2401.05571v1 [quant-ph])\nAbstract: Parameterized Quantum Circuits (PQC) have obtained increasing popularity thanks to their great potential for near-term Noisy Intermediate-Scale Quantum (NISQ) computers. Achieving quantum advantages usually requires a large number of qubits and quantum circuits with enough capacity. However, limited coherence time and massive quantum noises severely constrain the size of quantum circuits that can be executed reliably on real machines. To address these two pain points, we propose QuantumSEA, an in-time sparse exploration for noise-adaptive quantum circuits, aiming to achieve two key objectives: (1) implicit circuits capacity during training - by dynamically exploring the circuit's sparse connectivity and sticking a fixed small number of quantum gates throughout the training which satisfies the coherence time and enjoy light noises, enabling feasible executions on real quantum devices; (2) noise robustness - by jointly optimizing the topology and parameters of quantum circuits under real",
    "path": "papers/24/01/2401.05571.json",
    "total_tokens": 985,
    "translated_title": "QuantumSEA: 基于噪声自适应的量子电路的实时稀疏探索",
    "translated_abstract": "参数化量子电路（PQC）由于其在近期中噪声中间规模量子（NISQ）计算机上具有巨大潜力而日益受到欢迎。实现量子优势通常需要大量的量子比特和具备足够容量的量子电路。然而，有限的相干时间和大量的量子噪声严重限制了可以在真实机器上可靠执行的量子电路的规模。为了解决这两个痛点，我们提出了QuantumSEA，一种基于噪声自适应的实时稀疏探索，旨在实现两个关键目标：（1）训练过程中的隐式电路容量 - 通过动态探索电路的稀疏连接，并在整个训练过程中固定数量的量子门，以满足相干时间和轻量级噪声，从而使在真实量子设备上可行的执行；（2）噪声鲁棒性 - 通过联合优化量子电路的拓扑结构和参数，实现对真实噪声环境下的适应性。",
    "tldr": "QuantumSEA是一种基于噪声自适应的量子电路的实时稀疏探索方法，旨在通过动态探索电路的稀疏连接和固定数量的量子门，在训练过程中隐式增加电路容量，以满足相干时间和轻量级噪声的要求，并实现对真实噪声环境的鲁棒性。",
    "en_tdlr": "QuantumSEA is a real-time sparse exploration approach for noise-adaptive quantum circuits, which dynamically explores the sparse connectivity of the circuit and fixes a small number of quantum gates during the training process to implicitly increase the circuit capacity, satisfying the coherence time and light noise requirements, and achieving robustness to real noise environments."
}