{
    "title": "De novo Drug Design using Reinforcement Learning with Multiple GPT Agents. (arXiv:2401.06155v1 [q-bio.BM])",
    "abstract": "De novo drug design is a pivotal issue in pharmacology and a new area of focus in AI for science research. A central challenge in this field is to generate molecules with specific properties while also producing a wide range of diverse candidates. Although advanced technologies such as transformer models and reinforcement learning have been applied in drug design, their potential has not been fully realized. Therefore, we propose MolRL-MGPT, a reinforcement learning algorithm with multiple GPT agents for drug molecular generation. To promote molecular diversity, we encourage the agents to collaborate in searching for desirable molecules in diverse directions. Our algorithm has shown promising results on the GuacaMol benchmark and exhibits efficacy in designing inhibitors against SARS-CoV-2 protein targets. The codes are available at: https://github.com/HXYfighter/MolRL-MGPT.",
    "link": "http://arxiv.org/abs/2401.06155",
    "context": "Title: De novo Drug Design using Reinforcement Learning with Multiple GPT Agents. (arXiv:2401.06155v1 [q-bio.BM])\nAbstract: De novo drug design is a pivotal issue in pharmacology and a new area of focus in AI for science research. A central challenge in this field is to generate molecules with specific properties while also producing a wide range of diverse candidates. Although advanced technologies such as transformer models and reinforcement learning have been applied in drug design, their potential has not been fully realized. Therefore, we propose MolRL-MGPT, a reinforcement learning algorithm with multiple GPT agents for drug molecular generation. To promote molecular diversity, we encourage the agents to collaborate in searching for desirable molecules in diverse directions. Our algorithm has shown promising results on the GuacaMol benchmark and exhibits efficacy in designing inhibitors against SARS-CoV-2 protein targets. The codes are available at: https://github.com/HXYfighter/MolRL-MGPT.",
    "path": "papers/24/01/2401.06155.json",
    "total_tokens": 885,
    "translated_title": "使用多个GPT代理的强化学习进行的de novo药物设计",
    "translated_abstract": "de novo药物设计是药理学中的一个关键问题，也是人工智能科学研究的一个新领域。该领域的一个主要挑战是在产生具有特定性质的分子的同时，产生多样化的候选分子。尽管转换模型和强化学习等先进技术已应用于药物设计，但其潜力尚未充分发挥。因此，我们提出了一种名为MolRL-MGPT的强化学习算法，其中使用了多个GPT代理来生成药物分子。为了促进分子的多样性，我们鼓励代理合作，在不同方向上寻找理想的分子。我们的算法在GuacaMol基准测试中展示了有希望的结果，并在设计抗SARS-CoV-2蛋白靶点的抑制剂方面展示了有效性。代码可在以下链接中找到：https://github.com/HXYfighter/MolRL-MGPT。",
    "tldr": "这项研究提出了一种使用多个GPT代理的强化学习算法MolRL-MGPT来进行de novo药物设计，在药物分子生成过程中促进了多样性，展现了在设计抗SARS-CoV-2蛋白靶点的抑制剂方面的有效性。",
    "en_tdlr": "This study proposes a reinforcement learning algorithm, MolRL-MGPT, which utilizes multiple GPT agents for de novo drug design, promoting diversity in the process of generating drug molecules and exhibiting efficacy in designing inhibitors against SARS-CoV-2 protein targets."
}