{
    "title": "Into the crossfire: evaluating the use of a language model to crowdsource gun violence reports. (arXiv:2401.12989v1 [cs.CL])",
    "abstract": "Gun violence is a pressing and growing human rights issue that affects nearly every dimension of the social fabric, from healthcare and education to psychology and the economy. Reliable data on firearm events is paramount to developing more effective public policy and emergency responses. However, the lack of comprehensive databases and the risks of in-person surveys prevent human rights organizations from collecting needed data in most countries. Here, we partner with a Brazilian human rights organization to conduct a systematic evaluation of language models to assist with monitoring real-world firearm events from social media data. We propose a fine-tuned BERT-based model trained on Twitter (now X) texts to distinguish gun violence reports from ordinary Portuguese texts. Our model achieves a high AUC score of 0.97. We then incorporate our model into a web application and test it in a live intervention. We study and interview Brazilian analysts who continuously fact-check social media",
    "link": "http://arxiv.org/abs/2401.12989",
    "context": "Title: Into the crossfire: evaluating the use of a language model to crowdsource gun violence reports. (arXiv:2401.12989v1 [cs.CL])\nAbstract: Gun violence is a pressing and growing human rights issue that affects nearly every dimension of the social fabric, from healthcare and education to psychology and the economy. Reliable data on firearm events is paramount to developing more effective public policy and emergency responses. However, the lack of comprehensive databases and the risks of in-person surveys prevent human rights organizations from collecting needed data in most countries. Here, we partner with a Brazilian human rights organization to conduct a systematic evaluation of language models to assist with monitoring real-world firearm events from social media data. We propose a fine-tuned BERT-based model trained on Twitter (now X) texts to distinguish gun violence reports from ordinary Portuguese texts. Our model achieves a high AUC score of 0.97. We then incorporate our model into a web application and test it in a live intervention. We study and interview Brazilian analysts who continuously fact-check social media",
    "path": "papers/24/01/2401.12989.json",
    "total_tokens": 966,
    "translated_title": "在交火中：评估使用语言模型众包枪支暴力报告的效果",
    "translated_abstract": "枪支暴力是一个紧迫且不断增长的人权问题，影响着社会的方方面面，从医疗保健和教育到心理学和经济学。可靠的枪支事件数据对于制定更有效的公共政策和应急响应至关重要。然而，缺乏全面的数据库和面对面调查的风险阻止了人权组织在大多数国家收集所需的数据。在这里，我们与一家巴西人权组织合作，对语言模型进行系统评估，以帮助监测来自社交媒体数据的现实世界枪支事件。我们提出了一个在Twitter上经过微调的基于BERT的模型，用于区分枪支暴力报告和普通葡萄牙语文本。我们的模型达到了高达0.97的AUC分数。然后，我们将我们的模型整合到一个Web应用程序中，并在实时干预中对其进行测试。我们研究并采访巴西分析师，他们在持续进行社交媒体事实核查。",
    "tldr": "本研究评估了使用语言模型从社交媒体数据中监测枪支暴力事件的可行性。研究团队使用经过微调的BERT模型识别巴西的枪支暴力报告并取得了高准确度。研究结果有助于人权组织收集包含所需数据的全面数据库。",
    "en_tdlr": "This study evaluates the feasibility of using a language model to monitor gun violence events from social media data. The research team achieved high accuracy in identifying firearm violence reports in Brazil using a fine-tuned BERT model. The findings contribute to the collection of comprehensive databases containing the required data by human rights organizations."
}