{
    "title": "Opinion formation in the world trade network. (arXiv:2401.02378v1 [q-fin.TR])",
    "abstract": "We extend the opinion formation approach to probe the world influence of economical organizations. Our opinion formation model mimics a battle between currencies within the international trade network. Based on the United Nations Comtrade database, we construct the world trade network for the years of the last decade from 2010 to 2020. We consider different core groups constituted by countries preferring to trade in a specific currency. We will consider principally two core groups, namely, 5 Anglo-Saxon countries which prefer to trade in US dollar and the 11 BRICS+ which prefer to trade in a hypothetical currency, hereafter called BRI, pegged to their economies. We determine the trade currency preference of the other countries via a Monte Carlo process depending on the direct transactions between the countries. The results obtained in the frame of this mathematical model show that starting from year 2014 the majority of the world countries would have preferred to trade in BRI than USD.",
    "link": "http://arxiv.org/abs/2401.02378",
    "context": "Title: Opinion formation in the world trade network. (arXiv:2401.02378v1 [q-fin.TR])\nAbstract: We extend the opinion formation approach to probe the world influence of economical organizations. Our opinion formation model mimics a battle between currencies within the international trade network. Based on the United Nations Comtrade database, we construct the world trade network for the years of the last decade from 2010 to 2020. We consider different core groups constituted by countries preferring to trade in a specific currency. We will consider principally two core groups, namely, 5 Anglo-Saxon countries which prefer to trade in US dollar and the 11 BRICS+ which prefer to trade in a hypothetical currency, hereafter called BRI, pegged to their economies. We determine the trade currency preference of the other countries via a Monte Carlo process depending on the direct transactions between the countries. The results obtained in the frame of this mathematical model show that starting from year 2014 the majority of the world countries would have preferred to trade in BRI than USD.",
    "path": "papers/24/01/2401.02378.json",
    "total_tokens": 876,
    "translated_title": "世界贸易网络中的意见形成",
    "translated_abstract": "我们扩展了意见形成方法，以探索经济组织的全球影响力。我们的意见形成模型模拟了国际贸易网络中货币之间的斗争。基于联合国Comtrade数据库，我们构建了2010年至2020年间的世界贸易网络。我们考虑了由偏好使用特定货币进行贸易的国家组成的不同核心集团。主要考虑了两个核心集团，即偏好使用美元进行贸易的5个盎格鲁撒克逊国家和偏好使用与其经济挂钩的假想货币BRI进行贸易的11个金砖国家。我们通过蒙特卡洛过程根据国家之间的直接交易确定其他国家的贸易货币偏好。该数学模型的结果显示，从2014年开始，大多数世界国家会优先选择BRI而不是美元进行贸易。",
    "tldr": "该论文通过意见形成模型探索了经济组织的全球影响力。基于世界贸易网络的数据，研究发现从2014年开始，大多数世界国家会选择使用假想货币BRI而不是美元进行贸易。",
    "en_tdlr": "This paper investigates the global influence of economic organizations using an opinion formation model. Based on world trade network data, the study finds that starting from 2014, most countries would prefer to trade using the hypothetical currency BRI instead of the US dollar."
}