{
    "title": "Computationally Efficient Optimisation of Elbow-Type Draft Tube Using Neural Network Surrogates. (arXiv:2401.08700v1 [math.OC])",
    "abstract": "This study aims to provide a comprehensive assessment of single-objective and multi-objective optimisation algorithms for the design of an elbow-type draft tube, as well as to introduce a computationally efficient optimisation workflow. The proposed workflow leverages deep neural network surrogates trained on data obtained from numerical simulations. The use of surrogates allows for a more flexible and faster evaluation of novel designs. The success history-based adaptive differential evolution with linear reduction and the multi-objective evolutionary algorithm based on decomposition were identified as the best-performing algorithms and used to determine the influence of different objectives in the single-objective optimisation and their combined impact on the draft tube design in the multi-objective optimisation. The results for the single-objective algorithm are consistent with those of the multi-objective algorithm when the objectives are considered separately. Multi-objective appr",
    "link": "http://arxiv.org/abs/2401.08700",
    "context": "Title: Computationally Efficient Optimisation of Elbow-Type Draft Tube Using Neural Network Surrogates. (arXiv:2401.08700v1 [math.OC])\nAbstract: This study aims to provide a comprehensive assessment of single-objective and multi-objective optimisation algorithms for the design of an elbow-type draft tube, as well as to introduce a computationally efficient optimisation workflow. The proposed workflow leverages deep neural network surrogates trained on data obtained from numerical simulations. The use of surrogates allows for a more flexible and faster evaluation of novel designs. The success history-based adaptive differential evolution with linear reduction and the multi-objective evolutionary algorithm based on decomposition were identified as the best-performing algorithms and used to determine the influence of different objectives in the single-objective optimisation and their combined impact on the draft tube design in the multi-objective optimisation. The results for the single-objective algorithm are consistent with those of the multi-objective algorithm when the objectives are considered separately. Multi-objective appr",
    "path": "papers/24/01/2401.08700.json",
    "total_tokens": 871,
    "translated_title": "使用神经网络替代品的计算效率高的弯头型泄压管优化",
    "translated_abstract": "本研究旨在综合评估单目标和多目标优化算法用于设计弯头型泄压管，并引入一种计算效率高的优化工作流。所提出的工作流利用从数值模拟获得的数据训练深度神经网络替代品。使用替代品能够更灵活、更快速地评估新颖设计。成功的基于历史记录的自适应差分进化与线性减少和基于分解的多目标进化算法被确定为表现最佳的算法，并用于确定单目标优化中不同目标的影响，以及多目标优化中这些目标的综合影响对于泄压管设计的影响。单目标算法的结果与多目标算法在分别考虑目标时一致。",
    "tldr": "本研究提出了一种计算效率高的弯头型泄压管的优化工作流，利用神经网络替代品进行评估和设计。从评估结果中找到了最佳算法，并确定了单目标优化和多目标优化中目标的影响和综合影响对于泄压管设计的影响。"
}