{
    "title": "TripleSurv: Triplet Time-adaptive Coordinate Loss for Survival Analysis. (arXiv:2401.02708v1 [cs.LG])",
    "abstract": "A core challenge in survival analysis is to model the distribution of censored time-to-event data, where the event of interest may be a death, failure, or occurrence of a specific event. Previous studies have showed that ranking and maximum likelihood estimation (MLE)loss functions are widely-used for survival analysis. However, ranking loss only focus on the ranking of survival time and does not consider potential effect of samples for exact survival time values. Furthermore, the MLE is unbounded and easily subject to outliers (e.g., censored data), which may cause poor performance of modeling. To handle the complexities of learning process and exploit valuable survival time values, we propose a time-adaptive coordinate loss function, TripleSurv, to achieve adaptive adjustments by introducing the differences in the survival time between sample pairs into the ranking, which can encourage the model to quantitatively rank relative risk of pairs, ultimately enhancing the accuracy of predi",
    "link": "http://arxiv.org/abs/2401.02708",
    "context": "Title: TripleSurv: Triplet Time-adaptive Coordinate Loss for Survival Analysis. (arXiv:2401.02708v1 [cs.LG])\nAbstract: A core challenge in survival analysis is to model the distribution of censored time-to-event data, where the event of interest may be a death, failure, or occurrence of a specific event. Previous studies have showed that ranking and maximum likelihood estimation (MLE)loss functions are widely-used for survival analysis. However, ranking loss only focus on the ranking of survival time and does not consider potential effect of samples for exact survival time values. Furthermore, the MLE is unbounded and easily subject to outliers (e.g., censored data), which may cause poor performance of modeling. To handle the complexities of learning process and exploit valuable survival time values, we propose a time-adaptive coordinate loss function, TripleSurv, to achieve adaptive adjustments by introducing the differences in the survival time between sample pairs into the ranking, which can encourage the model to quantitatively rank relative risk of pairs, ultimately enhancing the accuracy of predi",
    "path": "papers/24/01/2401.02708.json",
    "total_tokens": 875,
    "translated_title": "TripleSurv：适应时间三元组坐标损失用于生存分析",
    "translated_abstract": "生存分析中的一个核心挑战是对被截尾的事件时间数据进行建模，其中感兴趣的事件可能是死亡、失败或特定事件的发生。过去的研究表明，排序损失和最大似然估计（MLE）损失函数被广泛应用于生存分析。然而，排序损失仅关注生存时间排名，不考虑样本对于确切生存时间值的潜在影响。此外，MLE是无界的且容易受到异常值（例如，被截尾数据）的影响，这可能导致建模性能较差。为了处理学习过程的复杂性并利用有价值的生存时间值，我们提出了一种适应时间三元组坐标损失函数TripleSurv，通过将样本对之间的生存时间差异引入排序中，以鼓励模型量化排名相对风险，最终提高预测准确性。",
    "tldr": "本文提出了一种适应时间的三元组坐标损失函数TripleSurv，通过引入样本对之间的生存时间差异来鼓励模型量化排名相对风险，从而提高生存分析的准确性。"
}