{
    "title": "Antonym vs Synonym Distinction using InterlaCed Encoder NETworks (ICE-NET). (arXiv:2401.10045v1 [cs.CL])",
    "abstract": "Antonyms vs synonyms distinction is a core challenge in lexico-semantic analysis and automated lexical resource construction. These pairs share a similar distributional context which makes it harder to distinguish them. Leading research in this regard attempts to capture the properties of the relation pairs, i.e., symmetry, transitivity, and trans-transitivity. However, the inability of existing research to appropriately model the relation-specific properties limits their end performance. In this paper, we propose InterlaCed Encoder NETworks (i.e., ICE-NET) for antonym vs synonym distinction, that aim to capture and model the relation-specific properties of the antonyms and synonyms pairs in order to perform the classification task in a performance-enhanced manner. Experimental evaluation using the benchmark datasets shows that ICE-NET outperforms the existing research by a relative score of upto 1.8% in F1-measure. We release the codes for ICE-NET at https://github.com/asif6827/ICENET",
    "link": "http://arxiv.org/abs/2401.10045",
    "context": "Title: Antonym vs Synonym Distinction using InterlaCed Encoder NETworks (ICE-NET). (arXiv:2401.10045v1 [cs.CL])\nAbstract: Antonyms vs synonyms distinction is a core challenge in lexico-semantic analysis and automated lexical resource construction. These pairs share a similar distributional context which makes it harder to distinguish them. Leading research in this regard attempts to capture the properties of the relation pairs, i.e., symmetry, transitivity, and trans-transitivity. However, the inability of existing research to appropriately model the relation-specific properties limits their end performance. In this paper, we propose InterlaCed Encoder NETworks (i.e., ICE-NET) for antonym vs synonym distinction, that aim to capture and model the relation-specific properties of the antonyms and synonyms pairs in order to perform the classification task in a performance-enhanced manner. Experimental evaluation using the benchmark datasets shows that ICE-NET outperforms the existing research by a relative score of upto 1.8% in F1-measure. We release the codes for ICE-NET at https://github.com/asif6827/ICENET",
    "path": "papers/24/01/2401.10045.json",
    "total_tokens": 946,
    "translated_title": "使用交织编码器网络（ICE-NET）区分反义词和同义词的挑战",
    "translated_abstract": "反义词和同义词的区分是词汇-语义分析和自动词汇资源构建中的核心挑战。这些词对共享相似的分布上下文，这使得区分它们更加困难。有关这方面的主要研究试图捕捉关系对的性质，即对称性、传递性和传递-传递性。然而，现有研究无法适当地模拟关系特定属性，限制了它们的最终性能。在本文中，我们提出了用于反义词和同义词区分的交织编码器网络（即ICE-NET），旨在捕捉和模拟反义词和同义词对的关系特定属性，以便以性能增强的方式执行分类任务。对基准数据集的实验评估表明，ICE-NET在F1得分上相对于现有研究提高了最高1.8%。我们在https://github.com/asif6827/ICENET上发布了ICE-NET的代码。",
    "tldr": "本文提出了一种名为ICE-NET的交织编码器网络，用于区分反义词和同义词。通过捕捉和模拟它们的关系特定属性，ICE-NET在性能上优于现有研究，提高了1.8%的F1得分。",
    "en_tdlr": "This paper proposes an InterlaCed Encoder NETworks (ICE-NET) approach to distinguish antonyms and synonyms. By capturing and modeling the relation-specific properties of these word pairs, ICE-NET outperforms existing research with an improvement of up to 1.8% in F1-measure."
}