{
    "title": "Fake Google restaurant reviews and the implications for consumers and restaurants. (arXiv:2401.11345v1 [econ.GN])",
    "abstract": "The use of online reviews to aid with purchase decisions is popular among consumers as it is a simple heuristic tool based on the reported experiences of other consumers. However, not all online reviews are written by real consumers or reflect actual experiences, and present implications for consumers and businesses. This study examines the effects of fake online reviews written by artificial intelligence (AI) on consumer decision making. Respondents were surveyed about their attitudes and habits concerning online reviews using an online questionnaire (n=351), and participated in a restaurant choice experiment using varying proportions of fake and real reviews. While the findings confirm prior studies, new insights are gained about the confusion for consumers and consequences for businesses when reviews written by AI are believed rather than real reviews. The study presents a fake review detection model using logistic regression modeling to score and flag reviews as a solution.",
    "link": "http://arxiv.org/abs/2401.11345",
    "context": "Title: Fake Google restaurant reviews and the implications for consumers and restaurants. (arXiv:2401.11345v1 [econ.GN])\nAbstract: The use of online reviews to aid with purchase decisions is popular among consumers as it is a simple heuristic tool based on the reported experiences of other consumers. However, not all online reviews are written by real consumers or reflect actual experiences, and present implications for consumers and businesses. This study examines the effects of fake online reviews written by artificial intelligence (AI) on consumer decision making. Respondents were surveyed about their attitudes and habits concerning online reviews using an online questionnaire (n=351), and participated in a restaurant choice experiment using varying proportions of fake and real reviews. While the findings confirm prior studies, new insights are gained about the confusion for consumers and consequences for businesses when reviews written by AI are believed rather than real reviews. The study presents a fake review detection model using logistic regression modeling to score and flag reviews as a solution.",
    "path": "papers/24/01/2401.11345.json",
    "total_tokens": 869,
    "translated_title": "伪造的谷歌餐厅评论对消费者和餐厅的影响研究",
    "translated_abstract": "在消费者中，使用在线评论来辅助购买决策是流行的，因为它是一种简单的启发式工具，基于其他消费者的报告经验。然而，并不是所有的在线评论都是真实消费者写的或反映真实经历的，这对消费者和企业都带来了影响。本研究调查了人工智能（AI）编写的虚假在线评论对消费者决策的影响。调查对象通过在线问卷（n=351）回答了关于他们在在线评论方面的态度和习惯，并参与了一项餐厅选择实验，其中使用了不同比例的虚假和真实评论。研究结果证实了以前的研究，同时还获得了关于当人们相信AI编写的评论而不是真实评论时的消费者困惑和企业后果的新见解。该研究提出了一种虚假评论检测模型，使用逻辑回归建模来对评论进行评分和标记，作为解决方案。",
    "tldr": "该研究调查了人工智能（AI）编写的虚假在线评论对消费者决策的影响，并提出了一种虚假评论检测模型作为解决方案。",
    "en_tdlr": "This study examines the effects of fake online reviews written by artificial intelligence (AI) on consumer decision making and proposes a fake review detection model as a solution."
}