{
    "title": "Surface-Enhanced Raman Spectroscopy and Transfer Learning Toward Accurate Reconstruction of the Surgical Zone. (arXiv:2401.08821v1 [eess.IV])",
    "abstract": "Raman spectroscopy, a photonic modality based on the inelastic backscattering of coherent light, is a valuable asset to the intraoperative sensing space, offering non-ionizing potential and highly-specific molecular fingerprint-like spectroscopic signatures that can be used for diagnosis of pathological tissue in the dynamic surgical field. Though Raman suffers from weakness in intensity, Surface-Enhanced Raman Spectroscopy (SERS), which uses metal nanostructures to amplify Raman signals, can achieve detection sensitivities that rival traditional photonic modalities. In this study, we outline a robotic Raman system that can reliably pinpoint the location and boundaries of a tumor embedded in healthy tissue, modeled here as a tissue-mimicking phantom with selectively infused Gold Nanostar regions. Further, due to the relative dearth of collected biological SERS or Raman data, we implement transfer learning to achieve 100% validation classification accuracy for Gold Nanostars compared to",
    "link": "http://arxiv.org/abs/2401.08821",
    "context": "Title: Surface-Enhanced Raman Spectroscopy and Transfer Learning Toward Accurate Reconstruction of the Surgical Zone. (arXiv:2401.08821v1 [eess.IV])\nAbstract: Raman spectroscopy, a photonic modality based on the inelastic backscattering of coherent light, is a valuable asset to the intraoperative sensing space, offering non-ionizing potential and highly-specific molecular fingerprint-like spectroscopic signatures that can be used for diagnosis of pathological tissue in the dynamic surgical field. Though Raman suffers from weakness in intensity, Surface-Enhanced Raman Spectroscopy (SERS), which uses metal nanostructures to amplify Raman signals, can achieve detection sensitivities that rival traditional photonic modalities. In this study, we outline a robotic Raman system that can reliably pinpoint the location and boundaries of a tumor embedded in healthy tissue, modeled here as a tissue-mimicking phantom with selectively infused Gold Nanostar regions. Further, due to the relative dearth of collected biological SERS or Raman data, we implement transfer learning to achieve 100% validation classification accuracy for Gold Nanostars compared to",
    "path": "papers/24/01/2401.08821.json",
    "total_tokens": 961,
    "translated_title": "表面增强拉曼光谱和迁移学习在手术区域准确重建方面的应用",
    "translated_abstract": "拉曼光谱是一种基于相干光的非弹性背向散射的光子模态，对于术中感知空间来说是一种宝贵的资产，提供了非电离潜力和高度特异性的分子指纹样光谱特征，可用于动态手术场中病理组织的诊断。尽管拉曼光谱在强度上存在缺陷，但利用金属纳米结构来放大拉曼信号的表面增强拉曼光谱（SERS）可以达到与传统光子模态相媲美的检测灵敏度。本研究概述了一种能可靠地确定健康组织中嵌入肿瘤的位置和边界的机器人拉曼系统，该系统以组织模拟幻影为模型，其中有选择地注入了金纳米星区域。此外，由于收集的生物SERS或拉曼数据相对不足，我们实施迁移学习，实现了与金纳米星相比的100%验证分类准确性。",
    "tldr": "本研究提出了一种利用表面增强拉曼光谱和迁移学习的机器人拉曼系统，可以可靠地重建手术区域中肿瘤的位置和边界，并取得了较高的验证分类准确性。",
    "en_tdlr": "This study proposes a robotic Raman system that utilizes Surface-Enhanced Raman Spectroscopy (SERS) and transfer learning to accurately reconstruct the location and boundaries of tumors in the surgical zone, achieving high validation classification accuracy."
}