{
    "title": "Local Feature Matching Using Deep Learning: A Survey",
    "abstract": "Local feature matching enjoys wide-ranging applications in the realm of computer vision, encompassing domains such as image retrieval, 3D reconstruction, and object recognition. However, challenges persist in improving the accuracy and robustness of matching due to factors like viewpoint and lighting variations. In recent years, the introduction of deep learning models has sparked widespread exploration into local feature matching techniques. The objective of this endeavor is to furnish a comprehensive overview of local feature matching methods. These methods are categorized into two key segments based on the presence of detectors. The Detector-based category encompasses models inclusive of Detect-then-Describe, Joint Detection and Description, Describe-then-Detect, as well as Graph Based techniques. In contrast, the Detector-free category comprises CNN Based, Transformer Based, and Patch Based methods. Our study extends beyond methodological analysis, incorporating evaluations of prev",
    "link": "https://arxiv.org/abs/2401.17592",
    "context": "Title: Local Feature Matching Using Deep Learning: A Survey\nAbstract: Local feature matching enjoys wide-ranging applications in the realm of computer vision, encompassing domains such as image retrieval, 3D reconstruction, and object recognition. However, challenges persist in improving the accuracy and robustness of matching due to factors like viewpoint and lighting variations. In recent years, the introduction of deep learning models has sparked widespread exploration into local feature matching techniques. The objective of this endeavor is to furnish a comprehensive overview of local feature matching methods. These methods are categorized into two key segments based on the presence of detectors. The Detector-based category encompasses models inclusive of Detect-then-Describe, Joint Detection and Description, Describe-then-Detect, as well as Graph Based techniques. In contrast, the Detector-free category comprises CNN Based, Transformer Based, and Patch Based methods. Our study extends beyond methodological analysis, incorporating evaluations of prev",
    "path": "papers/24/01/2401.17592.json",
    "total_tokens": 963,
    "translated_title": "使用深度学习进行局部特征匹配：一项调查",
    "translated_abstract": "局部特征匹配在计算机视觉领域中具有广泛的应用，包括图像检索、三维重建和物体识别等领域。然而，由于视角和光照变化等因素，提高匹配的准确性和鲁棒性仍然面临挑战。近年来，深度学习模型的引入引发了局部特征匹配技术的广泛探索。本文旨在提供局部特征匹配方法的全面概述。这些方法基于是否存在检测器被分为两个主要类别。基于检测器的类别包括检测然后描述、联合检测和描述、描述然后检测以及基于图的技术。相反，不需要检测器的类别包括基于CNN的方法、基于Transformer的方法和基于块的方法。我们的研究超越了方法论分析，还包括对先前工作的评估。",
    "tldr": "本文调查了使用深度学习进行局部特征匹配的方法。局部特征匹配在计算机视觉中的各个领域具有广泛应用，但是由于视角和光照变化等因素，匹配的准确性和鲁棒性仍然存在挑战。近年来，深度学习模型的引入使得局部特征匹配技术得到了广泛研究。本文对局部特征匹配方法进行了全面概述，并对之前的工作进行了评估。",
    "en_tdlr": "This survey explores the use of deep learning for local feature matching. Local feature matching has wide-ranging applications in computer vision, but improving accuracy and robustness remains a challenge due to factors like viewpoint and lighting variations. Deep learning models have been extensively studied for local feature matching in recent years. The survey provides a comprehensive overview of methods and includes evaluations of previous work."
}