{
    "title": "Deterministic Computing Power Networking: Architecture, Technologies and Prospects",
    "abstract": "With the development of new Internet services such as computation-intensive and delay-sensitive tasks, the traditional \"Best Effort\" network transmission mode has been greatly challenged. The network system is urgently required to provide end-to-end transmission determinacy and computing determinacy for new applications to ensure the safe and efficient operation of services. Based on the research of the convergence of computing and networking, a new network paradigm named deterministic computing power networking (Det-CPN) is proposed. In this article, we firstly introduce the research advance of computing power networking. And then the motivations and scenarios of Det-CPN are analyzed. Following that, we present the system architecture, technological capabilities, workflow as well as key technologies for Det-CPN. Finally, the challenges and future trends of Det-CPN are analyzed and discussed.",
    "link": "https://arxiv.org/abs/2401.17812",
    "context": "Title: Deterministic Computing Power Networking: Architecture, Technologies and Prospects\nAbstract: With the development of new Internet services such as computation-intensive and delay-sensitive tasks, the traditional \"Best Effort\" network transmission mode has been greatly challenged. The network system is urgently required to provide end-to-end transmission determinacy and computing determinacy for new applications to ensure the safe and efficient operation of services. Based on the research of the convergence of computing and networking, a new network paradigm named deterministic computing power networking (Det-CPN) is proposed. In this article, we firstly introduce the research advance of computing power networking. And then the motivations and scenarios of Det-CPN are analyzed. Following that, we present the system architecture, technological capabilities, workflow as well as key technologies for Det-CPN. Finally, the challenges and future trends of Det-CPN are analyzed and discussed.",
    "path": "papers/24/01/2401.17812.json",
    "total_tokens": 825,
    "translated_title": "确定性计算能力网络：架构、技术与前景",
    "translated_abstract": "随着计算密集型和延迟敏感的任务等新型互联网服务的发展，传统的“尽力而为”网络传输方式受到了极大的挑战。网络系统迫切需要为新应用提供端到端传输确定性和计算确定性，以确保服务的安全高效运行。在计算和网络的融合研究基础上，提出了一种名为确定性计算能力网络（Det-CPN）的新网络范 paradigm。本文首先介绍了计算能力网络的研究进展。然后分析了Det-CPN的动机和应用场景。接着，我们给出了Det-CPN的系统架构、技术能力、工作流程以及关键技术。最后，分析和讨论了Det-CPN面临的挑战和未来趋势。",
    "tldr": "提出了一种名为确定性计算能力网络（Det-CPN）的新网络范式，旨在为计算密集型和延迟敏感的任务等新型互联网服务提供端到端传输确定性和计算确定性。该研究对于确保服务的安全高效运行具有重要意义。",
    "en_tdlr": "A new network paradigm called deterministic computing power networking (Det-CPN) is proposed to provide end-to-end transmission determinacy and computing determinacy for new Internet services such as computation-intensive and delay-sensitive tasks, with significant implications for ensuring safe and efficient service operation."
}