{
    "title": "Whole-examination AI estimation of fetal biometrics from 20-week ultrasound scans. (arXiv:2401.01201v1 [cs.CV])",
    "abstract": "The current approach to fetal anomaly screening is based on biometric measurements derived from individually selected ultrasound images. In this paper, we introduce a paradigm shift that attains human-level performance in biometric measurement by aggregating automatically extracted biometrics from every frame across an entire scan, with no need for operator intervention. We use a convolutional neural network to classify each frame of an ultrasound video recording. We then measure fetal biometrics in every frame where appropriate anatomy is visible. We use a Bayesian method to estimate the true value of each biometric from a large number of measurements and probabilistically reject outliers. We performed a retrospective experiment on 1457 recordings (comprising 48 million frames) of 20-week ultrasound scans, estimated fetal biometrics in those scans and compared our estimates to the measurements sonographers took during the scan. Our method achieves human-level performance in estimating",
    "link": "http://arxiv.org/abs/2401.01201",
    "context": "Title: Whole-examination AI estimation of fetal biometrics from 20-week ultrasound scans. (arXiv:2401.01201v1 [cs.CV])\nAbstract: The current approach to fetal anomaly screening is based on biometric measurements derived from individually selected ultrasound images. In this paper, we introduce a paradigm shift that attains human-level performance in biometric measurement by aggregating automatically extracted biometrics from every frame across an entire scan, with no need for operator intervention. We use a convolutional neural network to classify each frame of an ultrasound video recording. We then measure fetal biometrics in every frame where appropriate anatomy is visible. We use a Bayesian method to estimate the true value of each biometric from a large number of measurements and probabilistically reject outliers. We performed a retrospective experiment on 1457 recordings (comprising 48 million frames) of 20-week ultrasound scans, estimated fetal biometrics in those scans and compared our estimates to the measurements sonographers took during the scan. Our method achieves human-level performance in estimating",
    "path": "papers/24/01/2401.01201.json",
    "total_tokens": 898,
    "translated_title": "从20周超声扫描中全面估计胎儿生物测量的AI方法",
    "translated_abstract": "当前的胎儿畸形筛查方法是基于从单个选择的超声图像中获得的生物测量。在本文中，我们引入了一种范式转变，通过聚合整个扫描中自动提取的生物测量，实现了与人类水平相当的性能，且无需操作员干预。我们使用卷积神经网络对超声视频录像的每个帧进行分类。然后，在显示适当解剖结构的每个帧中测量胎儿生物测量。我们使用贝叶斯方法从大量测量值中估计每个生物测量的真实值，并以概率方式拒绝异常值。我们对1457个20周超声扫描的录像进行了回顾性实验，在这些扫描中估计了胎儿生物测量，并将我们的估计与超声医生在扫描过程中的测量进行了比较。我们的方法在估计胎儿生物测量方面达到了人类水平的性能。",
    "tldr": "本文提出了一种全新的方法来估计胎儿生物测量，通过从每个超声扫描帧中提取生物测量，并使用贝叶斯方法进行准确估计和异常值拒绝，该方法能够实现与人类相当的性能。",
    "en_tdlr": "This paper introduces a novel approach to estimating fetal biometrics, achieving human-level performance by extracting biometrics from each frame of ultrasound scans and accurately estimating values using Bayesian method while rejecting outliers."
}