{
    "title": "Meta-Learning for Neural Network-based Temporal Point Processes. (arXiv:2401.15846v1 [cs.LG])",
    "abstract": "Human activities generate various event sequences such as taxi trip records, bike-sharing pick-ups, crime occurrence, and infectious disease transmission. The point process is widely used in many applications to predict such events related to human activities. However, point processes present two problems in predicting events related to human activities. First, recent high-performance point process models require the input of sufficient numbers of events collected over a long period (i.e., long sequences) for training, which are often unavailable in realistic situations. Second, the long-term predictions required in real-world applications are difficult. To tackle these problems, we propose a novel meta-learning approach for periodicity-aware prediction of future events given short sequences. The proposed method first embeds short sequences into hidden representations (i.e., task representations) via recurrent neural networks for creating predictions from short sequences. It then model",
    "link": "http://arxiv.org/abs/2401.15846",
    "context": "Title: Meta-Learning for Neural Network-based Temporal Point Processes. (arXiv:2401.15846v1 [cs.LG])\nAbstract: Human activities generate various event sequences such as taxi trip records, bike-sharing pick-ups, crime occurrence, and infectious disease transmission. The point process is widely used in many applications to predict such events related to human activities. However, point processes present two problems in predicting events related to human activities. First, recent high-performance point process models require the input of sufficient numbers of events collected over a long period (i.e., long sequences) for training, which are often unavailable in realistic situations. Second, the long-term predictions required in real-world applications are difficult. To tackle these problems, we propose a novel meta-learning approach for periodicity-aware prediction of future events given short sequences. The proposed method first embeds short sequences into hidden representations (i.e., task representations) via recurrent neural networks for creating predictions from short sequences. It then model",
    "path": "papers/24/01/2401.15846.json",
    "total_tokens": 872,
    "translated_title": "基于神经网络的时间点过程的元学习",
    "translated_abstract": "人类活动产生各种事件序列，如出租车行程记录、共享单车取车、犯罪发生和传染病传播等。点过程被广泛应用于预测与人类活动相关的事件。然而，在预测与人类活动相关的事件方面，点过程存在两个问题。首先，最近的高性能点过程模型需要输入足够数量的长期收集的事件（即长序列）进行训练，但在现实情况下往往不可用。其次，在实际应用中需要进行长期预测比较困难。为了解决这些问题，我们提出了一种新颖的元学习方法，用于周期性感知预测未来事件给出短序列。所提出的方法首先通过循环神经网络将短序列嵌入到隐藏表示（即任务表示）中，从短序列创建预测。然后建立模型。",
    "tldr": "本论文提出了一种基于神经网络的元学习方法，用于预测人类活动相关事件的发生。该方法通过循环神经网络将短序列嵌入到隐藏表示中，并利用这些表示进行预测。这种方法解决了长序列不可用和长期预测困难的问题。"
}