{
    "title": "LDA-based Term Profiles for Expert Finding in a Political Setting. (arXiv:2401.10617v1 [cs.IR])",
    "abstract": "A common task in many political institutions (i.e. Parliament) is to find politicians who are experts in a particular field. In order to tackle this problem, the first step is to obtain politician profiles which include their interests, and these can be automatically learned from their speeches. As a politician may have various areas of expertise, one alternative is to use a set of subprofiles, each of which covers a different subject. In this study, we propose a novel approach for this task by using latent Dirichlet allocation (LDA) to determine the main underlying topics of each political speech, and to distribute the related terms among the different topic-based subprofiles. With this objective, we propose the use of fifteen distance and similarity measures to automatically determine the optimal number of topics discussed in a document, and to demonstrate that every measure converges into five strategies: Euclidean, Dice, Sorensen, Cosine and Overlap. Our experimental results showed",
    "link": "http://arxiv.org/abs/2401.10617",
    "context": "Title: LDA-based Term Profiles for Expert Finding in a Political Setting. (arXiv:2401.10617v1 [cs.IR])\nAbstract: A common task in many political institutions (i.e. Parliament) is to find politicians who are experts in a particular field. In order to tackle this problem, the first step is to obtain politician profiles which include their interests, and these can be automatically learned from their speeches. As a politician may have various areas of expertise, one alternative is to use a set of subprofiles, each of which covers a different subject. In this study, we propose a novel approach for this task by using latent Dirichlet allocation (LDA) to determine the main underlying topics of each political speech, and to distribute the related terms among the different topic-based subprofiles. With this objective, we propose the use of fifteen distance and similarity measures to automatically determine the optimal number of topics discussed in a document, and to demonstrate that every measure converges into five strategies: Euclidean, Dice, Sorensen, Cosine and Overlap. Our experimental results showed",
    "path": "papers/24/01/2401.10617.json",
    "total_tokens": 890,
    "translated_title": "基于LDA的政治环境下专家查找的术语配置",
    "translated_abstract": "许多政治机构（如议会）的常见任务是找到在特定领域内具有专业知识的政治家。为了解决这个问题，第一步是获取政治家的个人资料，其中包括他们的兴趣，这些兴趣可以通过他们的演讲自动学习。由于政治家可能在多个领域有专长，因此一种替代方法是使用一组子资料，每个子资料都涵盖不同的主题。在这项研究中，我们提出了一种新的方法，通过使用潜在狄利克雷分配（LDA）来确定每个政治演讲的主要主题，并将相关术语分配给不同的基于主题的子资料。为了实现这一目标，我们提出使用15种距离和相似性度量来自动确定文档中讨论的主题数，并证明每种度量都收敛为五种策略：欧氏距离、Dice系数、Sorensen系数、余弦相似度和重叠度。我们的实验结果表明",
    "tldr": "这项研究提出了一种基于LDA的方法，在政治环境下使用主题分配术语配置来帮助查找具有特定领域专业知识的政治家。"
}