{
    "title": "Convergence of the deep BSDE method for stochastic control problems formulated through the stochastic maximum principle",
    "abstract": "It is well-known that decision-making problems from stochastic control can be formulated by means of forward-backward stochastic differential equation (FBSDE). Recently, the authors of Ji et al. 2022 proposed an efficient deep learning-based algorithm which was based on the stochastic maximum principle (SMP). In this paper, we provide a convergence result for this deep SMP-BSDE algorithm and compare its performance with other existing methods. In particular, by adopting a similar strategy as in Han and Long 2020, we derive a posteriori error estimate, and show that the total approximation error can be bounded by the value of the loss functional and the discretization error. We present numerical examples for high-dimensional stochastic control problems, both in case of drift- and diffusion control, which showcase superior performance compared to existing algorithms.",
    "link": "https://arxiv.org/abs/2401.17472",
    "context": "Title: Convergence of the deep BSDE method for stochastic control problems formulated through the stochastic maximum principle\nAbstract: It is well-known that decision-making problems from stochastic control can be formulated by means of forward-backward stochastic differential equation (FBSDE). Recently, the authors of Ji et al. 2022 proposed an efficient deep learning-based algorithm which was based on the stochastic maximum principle (SMP). In this paper, we provide a convergence result for this deep SMP-BSDE algorithm and compare its performance with other existing methods. In particular, by adopting a similar strategy as in Han and Long 2020, we derive a posteriori error estimate, and show that the total approximation error can be bounded by the value of the loss functional and the discretization error. We present numerical examples for high-dimensional stochastic control problems, both in case of drift- and diffusion control, which showcase superior performance compared to existing algorithms.",
    "path": "papers/24/01/2401.17472.json",
    "total_tokens": 802,
    "translated_title": "通过随机最大原则，基于深度BSDE方法的随机控制问题的收敛性研究",
    "translated_abstract": "众所周知，随机控制的决策问题可以通过前向后向随机微分方程（FBSDE）来表述。最近，Ji等人（2022）提出了一种基于随机最大原则（SMP）的高效深度学习算法。本文提供了该深度SMP-BSDE算法的收敛结果，并将其性能与其他现有方法进行比较。通过采用类似于Han和Long（2020）的策略，我们推导出后验误差估计，并展示了总近似误差可以由损失函数值和离散化误差的值来限制。我们在高维随机控制问题的数值例子中展示了该算法在漂移控制和扩散控制的情况下，相比现有算法表现出的卓越性能。",
    "tldr": "本文研究了基于深度BSDE方法和随机最大原则的随机控制问题，提供了该方法的收敛结果，并展示了在高维问题中相比其他方法具有卓越性能。",
    "en_tdlr": "This paper investigates stochastic control problems formulated through the stochastic maximum principle and the deep BSDE method, provides convergence results for this method, and demonstrates superior performance compared to other methods in high-dimensional problems."
}