{
    "title": "Multi-task robot data for dual-arm fine manipulation. (arXiv:2401.07603v2 [cs.RO] UPDATED)",
    "abstract": "In the field of robotic manipulation, deep imitation learning is recognized as a promising approach for acquiring manipulation skills. Additionally, learning from diverse robot datasets is considered a viable method to achieve versatility and adaptability. In such research, by learning various tasks, robots achieved generality across multiple objects. However, such multi-task robot datasets have mainly focused on single-arm tasks that are relatively imprecise, not addressing the fine-grained object manipulation that robots are expected to perform in the real world. This paper introduces a dataset of diverse object manipulations that includes dual-arm tasks and/or tasks requiring fine manipulation. To this end, we have generated dataset with 224k episodes (150 hours, 1,104 language instructions) which includes dual-arm fine tasks such as bowl-moving, pencil-case opening or banana-peeling, and this data is publicly available. Additionally, this dataset includes visual attention signals a",
    "link": "http://arxiv.org/abs/2401.07603",
    "context": "Title: Multi-task robot data for dual-arm fine manipulation. (arXiv:2401.07603v2 [cs.RO] UPDATED)\nAbstract: In the field of robotic manipulation, deep imitation learning is recognized as a promising approach for acquiring manipulation skills. Additionally, learning from diverse robot datasets is considered a viable method to achieve versatility and adaptability. In such research, by learning various tasks, robots achieved generality across multiple objects. However, such multi-task robot datasets have mainly focused on single-arm tasks that are relatively imprecise, not addressing the fine-grained object manipulation that robots are expected to perform in the real world. This paper introduces a dataset of diverse object manipulations that includes dual-arm tasks and/or tasks requiring fine manipulation. To this end, we have generated dataset with 224k episodes (150 hours, 1,104 language instructions) which includes dual-arm fine tasks such as bowl-moving, pencil-case opening or banana-peeling, and this data is publicly available. Additionally, this dataset includes visual attention signals a",
    "path": "papers/24/01/2401.07603.json",
    "total_tokens": 838,
    "translated_title": "多任务机器人数据用于双臂精细操作",
    "translated_abstract": "在机器人操纵领域，深度模仿学习被认为是获取操作技能的一种有希望的方法。此外，从多样化的机器人数据集中学习被认为是实现多样性和适应性的可行方法。在这样的研究中，通过学习各种任务，机器人在多个物体上实现了普适性。然而，这样的多任务机器人数据集主要集中在相对不精确的单臂任务上，并没有解决机器人在现实世界中需要执行的细粒度物体操作。本文介绍了一个包括双臂任务和/或需要精细操作的多样化物体操纵数据集。为此，我们生成了包含224k个场景的数据集（150小时，1,104个语言指令），其中包括双臂精细任务，如移动碗、打开笔袋或剥香蕉，并且这些数据是公开可用的。此外，该数据集还包括视觉注意信号。",
    "tldr": "这篇论文介绍了一个多任务机器人数据集，其中包括双臂精细操作和需要精细操作的任务，并且公开可用。",
    "en_tdlr": "This paper introduces a multi-task robot dataset that includes dual-arm fine manipulation tasks and tasks requiring fine manipulation, and it is publicly available."
}