{
    "title": "Could AI change the scientific publishing market once and for all?. (arXiv:2401.14952v1 [econ.TH])",
    "abstract": "Artificial-intelligence tools in research like ChatGPT are playing an increasingly transformative role in revolutionizing scientific publishing and re-shaping its economic background. They can help academics to tackle such issues as limited space in academic journals, accessibility of knowledge, delayed dissemination, or the exponential growth of academic output. Moreover, AI tools could potentially change scientific communication and academic publishing market as we know them. They can help to promote Open Access (OA) in the form of preprints, dethrone the entrenched journals and publishers, as well as introduce novel approaches to the assessment of research output. It is also imperative that they should do just that, once and for all.",
    "link": "http://arxiv.org/abs/2401.14952",
    "context": "Title: Could AI change the scientific publishing market once and for all?. (arXiv:2401.14952v1 [econ.TH])\nAbstract: Artificial-intelligence tools in research like ChatGPT are playing an increasingly transformative role in revolutionizing scientific publishing and re-shaping its economic background. They can help academics to tackle such issues as limited space in academic journals, accessibility of knowledge, delayed dissemination, or the exponential growth of academic output. Moreover, AI tools could potentially change scientific communication and academic publishing market as we know them. They can help to promote Open Access (OA) in the form of preprints, dethrone the entrenched journals and publishers, as well as introduce novel approaches to the assessment of research output. It is also imperative that they should do just that, once and for all.",
    "path": "papers/24/01/2401.14952.json",
    "total_tokens": 794,
    "translated_title": "能否人工智能彻底改变科学出版市场？",
    "translated_abstract": "研究中的人工智能工具（如ChatGPT）在改革科学出版和重塑其经济背景方面发挥日益转型的作用。它们可以帮助学者解决学术期刊空间有限、知识可及性、发布滞后或学术成果指数的指数增长等问题。此外，人工智能工具还有可能改变我们所知的科学交流和学术出版市场。它们可以促进预印本形式的开放获取（OA），推翻根深蒂固的期刊和出版商，并引入对研究成果评估的新方法。它们非常有必要一次彻底地实现这一切。",
    "tldr": "人工智能工具在改革科学出版和经济背景方面发挥着越来越重要的作用，它们可以解决学术期刊限制空间、知识获取难度、发布滞后等问题，并有可能改变科学交流和学术出版市场，推动开放获取和引入新的研究评估方法。",
    "en_tdlr": "AI tools are increasingly transforming scientific publishing and its economic background, addressing issues such as limited space, accessibility of knowledge, and delayed dissemination. They have the potential to revolutionize scientific communication and the academic publishing market, promoting open access and introducing novel approaches to research assessment."
}