{
    "title": "From Good to Great: Improving Math Reasoning with Tool-Augmented Interleaf Prompting. (arXiv:2401.05384v1 [math.HO])",
    "abstract": "This paper investigates the performance of Large Language Models (LLMs) and Tool-augmented LLMs in tackling complex mathematical reasoning tasks. We introduce IMP-TIP: Improving Math Reasoning with Tool-augmented Interleaf Prompting, a framework that combines the strengths of both LLMs and Tool-augmented LLMs. IMP-TIP follows the ``From Good to Great\" concept, collecting multiple potential solutions from both LLMs and their Tool-Augmented counterparts for the same math problem, and then selecting or re-generating the most accurate answer after cross-checking these solutions via tool-augmented interleaf prompting. The framework incorporates two key aspects: self-prompt and tool-augmented interleaf prompting (TIP). The former allows LLMs to autonomously refine and improve an initial prompt related to tool usage, while the latter enables LLMs to derive the final answer by dynamically analyzing the problem, cross-checking potential solutions, and revising previous reasoning hints in an int",
    "link": "http://arxiv.org/abs/2401.05384",
    "context": "Title: From Good to Great: Improving Math Reasoning with Tool-Augmented Interleaf Prompting. (arXiv:2401.05384v1 [math.HO])\nAbstract: This paper investigates the performance of Large Language Models (LLMs) and Tool-augmented LLMs in tackling complex mathematical reasoning tasks. We introduce IMP-TIP: Improving Math Reasoning with Tool-augmented Interleaf Prompting, a framework that combines the strengths of both LLMs and Tool-augmented LLMs. IMP-TIP follows the ``From Good to Great\" concept, collecting multiple potential solutions from both LLMs and their Tool-Augmented counterparts for the same math problem, and then selecting or re-generating the most accurate answer after cross-checking these solutions via tool-augmented interleaf prompting. The framework incorporates two key aspects: self-prompt and tool-augmented interleaf prompting (TIP). The former allows LLMs to autonomously refine and improve an initial prompt related to tool usage, while the latter enables LLMs to derive the final answer by dynamically analyzing the problem, cross-checking potential solutions, and revising previous reasoning hints in an int",
    "path": "papers/24/01/2401.05384.json",
    "total_tokens": 931,
    "translated_title": "由好到优：通过工具辅助交错提示改进数学推理",
    "translated_abstract": "本文研究了大型语言模型（LLMs）和工具辅助LLMs在处理复杂数学推理任务中的表现。我们引入了IMP-TIP：通过工具辅助交错提示改进数学推理，这是一个综合了LLMs和工具辅助LLMs的优势的框架。IMP-TIP遵循“由好到优”的概念，从LLMs和其工具辅助对应物中收集多个可能的解决方案，并通过工具辅助交错提示在这些解决方案之间进行交叉检查，然后选择或重新生成最准确的答案。该框架包括两个关键方面：自我提示和工具辅助交错提示（TIP）。前者允许LLMs自主地改进和完善与工具使用相关的初始提示，而后者使LLMs能够通过动态分析问题、交叉检查潜在解决方案和修正先前的推理提示来得出最终答案。",
    "tldr": "本文研究了大型语言模型和工具辅助语言模型在数学推理任务中的表现，提出了IMP-TIP框架，该框架采用了“由好到优”的思想并通过工具辅助交错提示来选择最准确的答案。"
}