{
    "title": "Applications of machine learning and IoT for Outdoor Air Pollution Monitoring and Prediction: A Systematic Literature Review. (arXiv:2401.01788v1 [cs.LG])",
    "abstract": "According to the World Health Organization (WHO), air pollution kills seven million people every year. Outdoor air pollution is a major environmental health problem affecting low, middle, and high-income countries. In the past few years, the research community has explored IoT-enabled machine learning applications for outdoor air pollution prediction. The general objective of this paper is to systematically review applications of machine learning and Internet of Things (IoT) for outdoor air pollution prediction and the combination of monitoring sensors and input features used. Two research questions were formulated for this review. 1086 publications were collected in the initial PRISMA stage. After the screening and eligibility phases, 37 papers were selected for inclusion. A cost-based analysis was conducted on the findings to highlight high-cost monitoring, low-cost IoT and hybrid enabled prediction. Three methods of prediction were identified: time series, feature-based and spatio-t",
    "link": "http://arxiv.org/abs/2401.01788",
    "context": "Title: Applications of machine learning and IoT for Outdoor Air Pollution Monitoring and Prediction: A Systematic Literature Review. (arXiv:2401.01788v1 [cs.LG])\nAbstract: According to the World Health Organization (WHO), air pollution kills seven million people every year. Outdoor air pollution is a major environmental health problem affecting low, middle, and high-income countries. In the past few years, the research community has explored IoT-enabled machine learning applications for outdoor air pollution prediction. The general objective of this paper is to systematically review applications of machine learning and Internet of Things (IoT) for outdoor air pollution prediction and the combination of monitoring sensors and input features used. Two research questions were formulated for this review. 1086 publications were collected in the initial PRISMA stage. After the screening and eligibility phases, 37 papers were selected for inclusion. A cost-based analysis was conducted on the findings to highlight high-cost monitoring, low-cost IoT and hybrid enabled prediction. Three methods of prediction were identified: time series, feature-based and spatio-t",
    "path": "papers/24/01/2401.01788.json",
    "total_tokens": 947,
    "translated_title": "机器学习和物联网在室外空气污染监测和预测中的应用：一个系统文献综述",
    "translated_abstract": "根据世界卫生组织（WHO）的数据，空气污染每年致使七百万人死亡。室外空气污染是影响低收入、中收入和高收入国家的主要环境健康问题。在过去几年中，研究界已经探索了物联网和机器学习应用于室外空气污染预测的可能性。本文的总体目标是系统地综述机器学习和物联网在室外空气污染预测中的应用以及使用的监测传感器和输入特征的组合。本文为此综述制定了两个研究问题。在初始PRISMA阶段共收集了1086篇文献。通过筛选和确定资格的阶段，最终选择了37篇文章进行分析。对结果进行了基于成本的分析，突出了高成本监测、低成本物联网和混合预测。研究确定了三种预测方法：时间序列、基于特征和空间预测。",
    "tldr": "本文系统综述了机器学习和物联网在室外空气污染预测中的应用，以及使用的监测传感器和输入特征的组合。研究结果突出了高成本监测、低成本物联网和混合预测这三种方法。"
}