{
    "title": "AiGen-FoodReview: A Multimodal Dataset of Machine-Generated Restaurant Reviews and Images on Social Media. (arXiv:2401.08825v1 [cs.LG])",
    "abstract": "Online reviews in the form of user-generated content (UGC) significantly impact consumer decision-making. However, the pervasive issue of not only human fake content but also machine-generated content challenges UGC's reliability. Recent advances in Large Language Models (LLMs) may pave the way to fabricate indistinguishable fake generated content at a much lower cost. Leveraging OpenAI's GPT-4-Turbo and DALL-E-2 models, we craft AiGen-FoodReview, a multi-modal dataset of 20,144 restaurant review-image pairs divided into authentic and machine-generated. We explore unimodal and multimodal detection models, achieving 99.80% multimodal accuracy with FLAVA. We use attributes from readability and photographic theories to score reviews and images, respectively, demonstrating their utility as hand-crafted features in scalable and interpretable detection models, with comparable performance. The paper contributes by open-sourcing the dataset and releasing fake review detectors, recommending its",
    "link": "http://arxiv.org/abs/2401.08825",
    "context": "Title: AiGen-FoodReview: A Multimodal Dataset of Machine-Generated Restaurant Reviews and Images on Social Media. (arXiv:2401.08825v1 [cs.LG])\nAbstract: Online reviews in the form of user-generated content (UGC) significantly impact consumer decision-making. However, the pervasive issue of not only human fake content but also machine-generated content challenges UGC's reliability. Recent advances in Large Language Models (LLMs) may pave the way to fabricate indistinguishable fake generated content at a much lower cost. Leveraging OpenAI's GPT-4-Turbo and DALL-E-2 models, we craft AiGen-FoodReview, a multi-modal dataset of 20,144 restaurant review-image pairs divided into authentic and machine-generated. We explore unimodal and multimodal detection models, achieving 99.80% multimodal accuracy with FLAVA. We use attributes from readability and photographic theories to score reviews and images, respectively, demonstrating their utility as hand-crafted features in scalable and interpretable detection models, with comparable performance. The paper contributes by open-sourcing the dataset and releasing fake review detectors, recommending its",
    "path": "papers/24/01/2401.08825.json",
    "total_tokens": 967,
    "translated_title": "AiGen-FoodReview:一种多模态的机器生成的社交媒体餐厅评论和图像数据集",
    "translated_abstract": "在线评论作为用户生成内容（UGC）显著影响消费者决策。然而，不仅人为制造的虚假内容，还有机器生成的内容都挑战了UGC的可靠性。借助于OpenAI的GPT-4-Turbo和DALL-E-2模型，我们创建了AiGen-FoodReview，这是一个包含20,144个餐厅评论-图像对的多模态数据集，分为真实和机器生成的部分。我们探索了单模态和多模态的检测模型，在FLAVA上实现了99.80%的多模态准确度。我们使用可读性和摄影理论的属性分别对评论和图像进行评分，证明了它们作为手工特征在可伸缩和可解释的检测模型中的实用性，其性能与对比相当。本文通过开源数据集和发布虚假评论检测器做出了贡献，推荐使用该数据集以增强可靠的UGC。",
    "tldr": "本论文创建了一个多模态的机器生成的社交媒体餐厅评论和图像数据集AiGen-FoodReview，并开发了相应的检测模型，可用于鉴别真实和虚假的评论。通过使用可读性和摄影理论的属性评分，证明了这些属性作为手工特征在可伸缩和可解释的检测模型中的有效性。",
    "en_tdlr": "This paper creates a multimodal dataset of machine-generated restaurant reviews and images on social media, named AiGen-FoodReview, and develops corresponding detection models to distinguish real and fake reviews. By using attributes from readability and photographic theories, the effectiveness of these attributes as handcrafted features in scalable and interpretable detection models is demonstrated."
}