{
    "title": "Push- and Pull-based Effective Communication in Cyber-Physical Systems. (arXiv:2401.10921v1 [eess.SY])",
    "abstract": "In Cyber Physical Systems (CPSs), two groups of actors interact toward the maximization of system performance: the sensors, observing and disseminating the system state, and the actuators, performing physical decisions based on the received information. While it is generally assumed that sensors periodically transmit updates, returning the feedback signal only when necessary, and consequently adapting the physical decisions to the communication policy, can significantly improve the efficiency of the system. In particular, the choice between push-based communication, in which updates are initiated autonomously by the sensors, and pull-based communication, in which they are requested by the actuators, is a key design step. In this work, we propose an analytical model for optimizing push- and pull-based communication in CPSs, observing that the policy optimality coincides with Value of Information (VoI) maximization. Our results also highlight that, despite providing a better optimal solu",
    "link": "http://arxiv.org/abs/2401.10921",
    "context": "Title: Push- and Pull-based Effective Communication in Cyber-Physical Systems. (arXiv:2401.10921v1 [eess.SY])\nAbstract: In Cyber Physical Systems (CPSs), two groups of actors interact toward the maximization of system performance: the sensors, observing and disseminating the system state, and the actuators, performing physical decisions based on the received information. While it is generally assumed that sensors periodically transmit updates, returning the feedback signal only when necessary, and consequently adapting the physical decisions to the communication policy, can significantly improve the efficiency of the system. In particular, the choice between push-based communication, in which updates are initiated autonomously by the sensors, and pull-based communication, in which they are requested by the actuators, is a key design step. In this work, we propose an analytical model for optimizing push- and pull-based communication in CPSs, observing that the policy optimality coincides with Value of Information (VoI) maximization. Our results also highlight that, despite providing a better optimal solu",
    "path": "papers/24/01/2401.10921.json",
    "total_tokens": 875,
    "translated_title": "基于推和拉的有效通信在网络物理系统中的应用",
    "translated_abstract": "在网络物理系统（CPS）中，两组参与者通过互动来最大化系统性能：观测和传播系统状态的传感器和基于接收到的信息进行物理决策的执行器。虽然通常假设传感器定期传输更新，仅在必要时返回反馈信号，并因此根据通信策略调整物理决策，但实际上通过选择基于推的通信（传感器自主启动更新）和基于拉的通信（执行器请求更新）可以显著提高系统的效率。在这项工作中，我们提出了一个优化CPS中基于推和拉的通信的分析模型，观察到策略的最优性与信息价值（VoI）最大化相一致。我们的结果还表明，尽管提供了更好的最优解决方案，但在特定情况下，基于拉的通信可能会比基于推的通信更有效。",
    "tldr": "本论文研究了在网络物理系统中基于推和拉的通信的优化问题，发现最优策略与信息价值最大化相一致，结果表明在特定情况下，基于拉的通信可能比基于推的通信更有效。",
    "en_tdlr": "This paper investigates the optimization of push- and pull-based communication in Cyber Physical Systems (CPSs) and finds that the optimal strategy coincides with the maximization of Value of Information (VoI). The results also suggest that, in certain scenarios, pull-based communication may be more efficient than push-based communication."
}