{
    "title": "Partition-form Cooperative Games in Two-Echelon Supply Chains. (arXiv:2401.04939v1 [econ.TH])",
    "abstract": "Competition and cooperation are inherent features of any multi-echelon supply chain. The interactions among the agents across the same echelon and that across various echelons influence the percolation of market demand across echelons. The agents may want to collaborate with others in pursuit of attracting higher demand and thereby improving their own revenue. We consider one supplier (at a higher echelon) and two manufacturers (at a lower echelon and facing the customers) and study the collaborations that are `stable'; the main differentiator from the existing studies in supply chain literature is the consideration of the following crucial aspect -- the revenue of any collaborative unit also depends upon the way the opponents collaborate. Such competitive scenarios can be modeled using what is known as partition form games.  Our study reveals that the grand coalition is not stable when the product is essential and the customers buy it from any of the manufacturers without a preference",
    "link": "http://arxiv.org/abs/2401.04939",
    "context": "Title: Partition-form Cooperative Games in Two-Echelon Supply Chains. (arXiv:2401.04939v1 [econ.TH])\nAbstract: Competition and cooperation are inherent features of any multi-echelon supply chain. The interactions among the agents across the same echelon and that across various echelons influence the percolation of market demand across echelons. The agents may want to collaborate with others in pursuit of attracting higher demand and thereby improving their own revenue. We consider one supplier (at a higher echelon) and two manufacturers (at a lower echelon and facing the customers) and study the collaborations that are `stable'; the main differentiator from the existing studies in supply chain literature is the consideration of the following crucial aspect -- the revenue of any collaborative unit also depends upon the way the opponents collaborate. Such competitive scenarios can be modeled using what is known as partition form games.  Our study reveals that the grand coalition is not stable when the product is essential and the customers buy it from any of the manufacturers without a preference",
    "path": "papers/24/01/2401.04939.json",
    "total_tokens": 852,
    "translated_title": "两级供应链中的分割形式合作博弈",
    "translated_abstract": "竞争和合作是任何多级供应链的固有特征。同一级别的代理之间的互动以及不同级别之间的互动影响了市场需求在各级别之间的传导。代理可能希望与其他人合作，以吸引更高的需求并改善自己的收入。我们考虑一个供应商（在更高的级别上）和两个制造商（在更低的级别上，并面向客户），研究“稳定”的协作；与供应链文献中现有研究的主要区别是考虑以下关键方面 - 任何协作单位的收入也取决于对手的协作方式。这样的竞争场景可以使用所谓的分割博弈模型化。我们的研究发现，当产品是必需品且客户从任一制造商购买产品时，大联盟是不稳定的。",
    "tldr": "本论文研究了两级供应链中的分割形式合作博弈。研究发现，在产品是必需品且客户没有偏好地从任一制造商购买时，大联盟是不稳定的。"
}