{
    "title": "Classification of Radiologically Isolated Syndrome and Clinically Isolated Syndrome with Machine-Learning Techniques. (arXiv:2401.13301v1 [cs.LG])",
    "abstract": "Background and purpose: The unanticipated detection by magnetic resonance imaging (MRI) in the brain of asymptomatic subjects of white matter lesions suggestive of multiple sclerosis (MS) has been named radiologically isolated syndrome (RIS). As the difference between early MS [i.e. clinically isolated syndrome (CIS)] and RIS is the occurrence of a clinical event, it is logical to improve detection of the subclinical form without interfering with MRI as there are radiological diagnostic criteria for that. Our objective was to use machine-learning classification methods to identify morphometric measures that help to discriminate patients with RIS from those with CIS.  Methods: We used a multimodal 3-T MRI approach by combining MRI biomarkers (cortical thickness, cortical and subcortical grey matter volume, and white matter integrity) of a cohort of 17 patients with RIS and 17 patients with CIS for single-subject level classification.  Results: The best proposed models to predict the dia",
    "link": "http://arxiv.org/abs/2401.13301",
    "context": "Title: Classification of Radiologically Isolated Syndrome and Clinically Isolated Syndrome with Machine-Learning Techniques. (arXiv:2401.13301v1 [cs.LG])\nAbstract: Background and purpose: The unanticipated detection by magnetic resonance imaging (MRI) in the brain of asymptomatic subjects of white matter lesions suggestive of multiple sclerosis (MS) has been named radiologically isolated syndrome (RIS). As the difference between early MS [i.e. clinically isolated syndrome (CIS)] and RIS is the occurrence of a clinical event, it is logical to improve detection of the subclinical form without interfering with MRI as there are radiological diagnostic criteria for that. Our objective was to use machine-learning classification methods to identify morphometric measures that help to discriminate patients with RIS from those with CIS.  Methods: We used a multimodal 3-T MRI approach by combining MRI biomarkers (cortical thickness, cortical and subcortical grey matter volume, and white matter integrity) of a cohort of 17 patients with RIS and 17 patients with CIS for single-subject level classification.  Results: The best proposed models to predict the dia",
    "path": "papers/24/01/2401.13301.json",
    "total_tokens": 894,
    "translated_title": "通过机器学习技术对放射学孤立综合征和临床孤立综合征进行分类",
    "translated_abstract": "背景和目的：在磁共振成像中，无症状主题的大脑白质病变被称为放射学孤立综合征（RIS）。早期多发性硬化症（MS）[即临床孤立综合征（CIS）]与RIS之间的区别在于是否发生临床事件，因此，在不干扰MRI的情况下，提高对亚临床形式的检测是合理的，因为已有放射学诊断标准。我们的目标是使用机器学习分类方法识别形态测量指标，帮助区分RIS患者和CIS患者。方法：我们使用多模态3T MRI方法，结合MRI生物标志物（皮层厚度、皮层和皮质下灰质体积以及白质完整性），对17名RIS患者和17名CIS患者的单个患者进行分类。结果：预测dia",
    "tldr": "这项研究使用机器学习技术对放射学孤立综合征（RIS）和临床孤立综合征（CIS）进行分类，通过结合多模态3T MRI的生物标志物，提高了对亚临床形式的检测，有助于区分患者。"
}