{
    "title": "CauESC: A Causal Aware Model for Emotional Support Conversation",
    "abstract": "Emotional Support Conversation aims at reducing the seeker's emotional distress through supportive response. Existing approaches have two limitations: (1) They ignore the emotion causes of the distress, which is important for fine-grained emotion understanding; (2) They focus on the seeker's own mental state rather than the emotional dynamics during interaction between speakers. To address these issues, we propose a novel framework CauESC, which firstly recognizes the emotion causes of the distress, as well as the emotion effects triggered by the causes, and then understands each strategy of verbal grooming independently and integrates them skillfully. Experimental results on the benchmark dataset demonstrate the effectiveness of our approach and show the benefits of emotion understanding from cause to effect and independent-integrated strategy modeling.",
    "link": "https://arxiv.org/abs/2401.17755",
    "context": "Title: CauESC: A Causal Aware Model for Emotional Support Conversation\nAbstract: Emotional Support Conversation aims at reducing the seeker's emotional distress through supportive response. Existing approaches have two limitations: (1) They ignore the emotion causes of the distress, which is important for fine-grained emotion understanding; (2) They focus on the seeker's own mental state rather than the emotional dynamics during interaction between speakers. To address these issues, we propose a novel framework CauESC, which firstly recognizes the emotion causes of the distress, as well as the emotion effects triggered by the causes, and then understands each strategy of verbal grooming independently and integrates them skillfully. Experimental results on the benchmark dataset demonstrate the effectiveness of our approach and show the benefits of emotion understanding from cause to effect and independent-integrated strategy modeling.",
    "path": "papers/24/01/2401.17755.json",
    "total_tokens": 827,
    "translated_title": "CauESC: 一种关注因果关系的情感支持对话模型",
    "translated_abstract": "情感支持对话旨在通过支持性的回应减轻求助者的情感困扰。现有方法存在两个限制：(1) 它们忽略了困扰的情感原因，而这对于细致的情感理解是重要的；(2) 它们关注的是求助者自身的心理状态，而忽视了说话者之间互动过程中的情感动态。为了解决这些问题，我们提出了一个新颖的框架CauESC，它首先识别困扰的情感原因，以及这些原因触发的情感效果，然后独立地理解每种语言修饰策略，并巧妙地将它们整合起来。基准数据集上的实验结果证明了我们方法的有效性，并展示了从原因到效果的情感理解和独立-整合策略建模的好处。",
    "tldr": "CauESC是一种关注因果关系的情感支持对话模型，通过识别困扰的情感原因以及这些原因触发的情感效果，独立地理解每种语言修饰策略并巧妙地整合它们，有效地减轻求助者的情感困扰。",
    "en_tdlr": "CauESC is a causal aware model for emotional support conversation that addresses the limitations of existing approaches by recognizing the emotion causes and effects of distress, and integrating independent verbal grooming strategies effectively to reduce emotional distress in seekers."
}