{
    "title": "Reproducibility Analysis and Enhancements for Multi-Aspect Dense Retriever with Aspect Learning. (arXiv:2401.03648v2 [cs.IR] UPDATED)",
    "abstract": "Multi-aspect dense retrieval aims to incorporate aspect information (e.g., brand and category) into dual encoders to facilitate relevance matching. As an early and representative multi-aspect dense retriever, MADRAL learns several extra aspect embeddings and fuses the explicit aspects with an implicit aspect \"OTHER\" for final representation. MADRAL was evaluated on proprietary data and its code was not released, making it challenging to validate its effectiveness on other datasets. We failed to reproduce its effectiveness on the public MA-Amazon data, motivating us to probe the reasons and re-examine its components. We propose several component alternatives for comparisons, including replacing \"OTHER\" with \"CLS\" and representing aspects with the first several content tokens. Through extensive experiments, we confirm that learning \"OTHER\" from scratch in aspect fusion is harmful. In contrast, our proposed variants can greatly enhance the retrieval performance. Our research not only shed",
    "link": "http://arxiv.org/abs/2401.03648",
    "context": "Title: Reproducibility Analysis and Enhancements for Multi-Aspect Dense Retriever with Aspect Learning. (arXiv:2401.03648v2 [cs.IR] UPDATED)\nAbstract: Multi-aspect dense retrieval aims to incorporate aspect information (e.g., brand and category) into dual encoders to facilitate relevance matching. As an early and representative multi-aspect dense retriever, MADRAL learns several extra aspect embeddings and fuses the explicit aspects with an implicit aspect \"OTHER\" for final representation. MADRAL was evaluated on proprietary data and its code was not released, making it challenging to validate its effectiveness on other datasets. We failed to reproduce its effectiveness on the public MA-Amazon data, motivating us to probe the reasons and re-examine its components. We propose several component alternatives for comparisons, including replacing \"OTHER\" with \"CLS\" and representing aspects with the first several content tokens. Through extensive experiments, we confirm that learning \"OTHER\" from scratch in aspect fusion is harmful. In contrast, our proposed variants can greatly enhance the retrieval performance. Our research not only shed",
    "path": "papers/24/01/2401.03648.json",
    "total_tokens": 935,
    "translated_title": "《多方面密集检索器与方面学习的可重现性分析与增强》的翻译标题",
    "translated_abstract": "多方面密集检索旨在将方面信息（例如品牌和类别）与双编码器相结合，以促进相关性匹配。作为一个早期代表性的多方面密集检索器，MADRAL学习了几个额外的方面嵌入，并将显性方面与隐性方面“OTHER”融合以获取最终表示。MADRAL在专有数据上进行了评估，但其代码未发布，这使得难以验证其在其他数据集上的有效性。我们未能在公开的MA-Amazon数据上复现其有效性，因此我们希望探索原因并重新审视其组成部分。我们提出了几种组件替代方案进行比较，包括将“OTHER”替换为“CLS”并使用前几个内容标记表示方面。通过大量实验证实，从头开始学习“OTHER”在方面融合中是有害的。相反，我们提出的变体可以显著提高检索性能。我们的研究不仅揭示了原有模型的问题，还提出了解决方案。",
    "tldr": "这项研究提出了多方面密集检索器的可重现性分析与增强。通过对MADRAL模型的复现实验，我们发现从头学习“OTHER”在方面融合中是有害的，而我们提出的替代方案可以大大提高检索性能。",
    "en_tdlr": "This research presents a reproducibility analysis and enhancements for multi-aspect dense retriever. Through experiments, it is found that learning \"OTHER\" from scratch in aspect fusion is harmful, while the proposed alternatives greatly enhance retrieval performance."
}