{
    "title": "Teacher bias or measurement error?. (arXiv:2401.04200v1 [econ.EM])",
    "abstract": "In many countries, teachers' track recommendations are used to allocate students to secondary school tracks. Previous studies have shown that students from families with low socioeconomic status (SES) receive lower track recommendations than their peers from high SES families, conditional on standardized test scores. It is often argued this indicates teacher bias. However, this claim is invalid in the presence of measurement error in test scores. We discuss how measurement error in test scores generates a biased coefficient of the conditional SES gap, and consider three empirical strategies to address this bias. Using administrative data from the Netherlands, we find that measurement error explains 35 to 43% of the conditional SES gap in track recommendations.",
    "link": "http://arxiv.org/abs/2401.04200",
    "context": "Title: Teacher bias or measurement error?. (arXiv:2401.04200v1 [econ.EM])\nAbstract: In many countries, teachers' track recommendations are used to allocate students to secondary school tracks. Previous studies have shown that students from families with low socioeconomic status (SES) receive lower track recommendations than their peers from high SES families, conditional on standardized test scores. It is often argued this indicates teacher bias. However, this claim is invalid in the presence of measurement error in test scores. We discuss how measurement error in test scores generates a biased coefficient of the conditional SES gap, and consider three empirical strategies to address this bias. Using administrative data from the Netherlands, we find that measurement error explains 35 to 43% of the conditional SES gap in track recommendations.",
    "path": "papers/24/01/2401.04200.json",
    "total_tokens": 810,
    "translated_title": "教师偏见还是测量误差？",
    "translated_abstract": "在许多国家，教师的学术建议用于将学生分配到不同的中学阶段。先前的研究表明，低社会经济地位（SES）家庭的学生在标准化考试成绩相同的情况下，与高SES家庭的同龄人相比，他们得到的学术建议较低。通常认为这可能是教师的偏见。然而，如果存在测试成绩的测量误差，这个论断是无效的。本文讨论了测试成绩的测量误差如何导致条件SES差距的偏误，并考虑了三种实证策略来解决这种偏误。使用荷兰的行政数据，我们发现测量误差解释了学术建议中条件SES差距的35%到43%。",
    "tldr": "本研究发现，在分配学生到中学阶段时，教师的学术建议对低社会经济地位家庭的学生有偏见。但是，这个偏见可能是由测试成绩的测量误差导致的，测量误差解释了35%到43%的条件SES差距。",
    "en_tdlr": "This study found that teachers' track recommendations were biased against students from low socioeconomic status (SES) families in allocating students to secondary school tracks. However, this bias may be due to measurement error in test scores, which explains 35% to 43% of the conditional SES gap."
}