{
    "title": "Improve Fidelity and Utility of Synthetic Credit Card Transaction Time Series from Data-centric Perspective. (arXiv:2401.00965v1 [cs.LG])",
    "abstract": "Exploring generative model training for synthetic tabular data, specifically in sequential contexts such as credit card transaction data, presents significant challenges. This paper addresses these challenges, focusing on attaining both high fidelity to actual data and optimal utility for machine learning tasks. We introduce five pre-processing schemas to enhance the training of the Conditional Probabilistic Auto-Regressive Model (CPAR), demonstrating incremental improvements in the synthetic data's fidelity and utility. Upon achieving satisfactory fidelity levels, our attention shifts to training fraud detection models tailored for time-series data, evaluating the utility of the synthetic data. Our findings offer valuable insights and practical guidelines for synthetic data practitioners in the finance sector, transitioning from real to synthetic datasets for training purposes, and illuminating broader methodologies for synthesizing credit card transaction time series.",
    "link": "http://arxiv.org/abs/2401.00965",
    "context": "Title: Improve Fidelity and Utility of Synthetic Credit Card Transaction Time Series from Data-centric Perspective. (arXiv:2401.00965v1 [cs.LG])\nAbstract: Exploring generative model training for synthetic tabular data, specifically in sequential contexts such as credit card transaction data, presents significant challenges. This paper addresses these challenges, focusing on attaining both high fidelity to actual data and optimal utility for machine learning tasks. We introduce five pre-processing schemas to enhance the training of the Conditional Probabilistic Auto-Regressive Model (CPAR), demonstrating incremental improvements in the synthetic data's fidelity and utility. Upon achieving satisfactory fidelity levels, our attention shifts to training fraud detection models tailored for time-series data, evaluating the utility of the synthetic data. Our findings offer valuable insights and practical guidelines for synthetic data practitioners in the finance sector, transitioning from real to synthetic datasets for training purposes, and illuminating broader methodologies for synthesizing credit card transaction time series.",
    "path": "papers/24/01/2401.00965.json",
    "total_tokens": 935,
    "translated_title": "从数据中心的角度提高合成信用卡交易时间序列的保真度和实用性",
    "translated_abstract": "在探索合成表格数据的生成模型训练中，特别是在顺序上下文中，如信用卡交易数据，存在着重大挑战。本文解决了这些挑战，重点是实现对实际数据的高保真度和对机器学习任务的最佳实用性。我们介绍了五种预处理方案来增强条件概率自回归模型（CPAR）的训练，展示了合成数据保真度和实用性的渐进性改进。在达到满意的保真度水平后，我们转向针对时间序列数据定制的欺诈检测模型的训练，评估合成数据的实用性。我们的研究结果为金融领域的合成数据从实际数据过渡到合成数据集的训练提供了宝贵的见解和实践指导，并阐明了合成信用卡交易时间序列的更广泛的方法论。",
    "tldr": "本文从数据中心的角度提出了五种预处理方案，以增强条件概率自回归模型（CPAR）的训练，从而改善合成信用卡交易数据的保真度和实用性。进一步通过定制欺诈检测模型的训练验证了合成数据的实用性，并为金融领域的合成数据训练提供了宝贵的见解和实践指导。",
    "en_tdlr": "This paper proposes five pre-processing schemas to enhance the training of the Conditional Probabilistic Auto-Regressive Model (CPAR) and improve the fidelity and utility of synthetic credit card transaction data. It further demonstrates the practicality of the synthetic data through the training of fraud detection models and provides valuable insights and guidelines for synthetic data training in the finance sector."
}