{
    "title": "Pheme: Efficient and Conversational Speech Generation. (arXiv:2401.02839v1 [eess.AS])",
    "abstract": "In recent years, speech generation has seen remarkable progress, now achieving one-shot generation capability that is often virtually indistinguishable from real human voice. Integrating such advancements in speech generation with large language models might revolutionize a wide range of applications. However, certain applications, such as assistive conversational systems, require natural and conversational speech generation tools that also operate efficiently in real time. Current state-of-the-art models like VALL-E and SoundStorm, powered by hierarchical neural audio codecs, require large neural components and extensive training data to work well. In contrast, MQTTS aims to build more compact conversational TTS models while capitalizing on smaller-scale real-life conversational speech data. However, its autoregressive nature yields high inference latency and thus limits its real-time usage. In order to mitigate the current limitations of the state-of-the-art TTS models while capitali",
    "link": "http://arxiv.org/abs/2401.02839",
    "context": "Title: Pheme: Efficient and Conversational Speech Generation. (arXiv:2401.02839v1 [eess.AS])\nAbstract: In recent years, speech generation has seen remarkable progress, now achieving one-shot generation capability that is often virtually indistinguishable from real human voice. Integrating such advancements in speech generation with large language models might revolutionize a wide range of applications. However, certain applications, such as assistive conversational systems, require natural and conversational speech generation tools that also operate efficiently in real time. Current state-of-the-art models like VALL-E and SoundStorm, powered by hierarchical neural audio codecs, require large neural components and extensive training data to work well. In contrast, MQTTS aims to build more compact conversational TTS models while capitalizing on smaller-scale real-life conversational speech data. However, its autoregressive nature yields high inference latency and thus limits its real-time usage. In order to mitigate the current limitations of the state-of-the-art TTS models while capitali",
    "path": "papers/24/01/2401.02839.json",
    "total_tokens": 799,
    "translated_title": "Pheme: 高效和对话式语音生成",
    "translated_abstract": "最近几年，语音生成取得了显著进展，现在已经实现了一次生成能力，往往几乎无法区分是否为真实的人声。将这样的语音生成进展与大型语言模型结合起来，可能会彻底改变各种应用。然而，某些应用，如辅助对话系统，需要自然和对话式语音生成工具，也需要在实时情况下运行效率高。当前的最先进模型如VALL-E和SoundStorm，由分层神经音频编解码器驱动，需要大型神经组件和大量训练数据才能良好运作。相比之下，MQTTS旨在构建更紧凑的对话式TTS模型，同时利用小规模真实对话式语音数据。然而，其自回归性质导致推理延迟高，从而限制了实时应用。",
    "tldr": "Pheme是一个高效和对话式语音生成模型，能够在实时情况下工作，不仅具备自然的语音生成能力，还能与大型语言模型结合使用。",
    "en_tdlr": "Pheme is an efficient and conversational speech generation model that works in real time, combining natural speech generation capability with large language models."
}