{
    "title": "Mapping-to-Parameter Nonlinear Functional Regression with Novel B-spline Free Knot Placement Algorithm. (arXiv:2401.14989v1 [cs.LG])",
    "abstract": "We propose a novel approach to nonlinear functional regression, called the Mapping-to-Parameter function model, which addresses complex and nonlinear functional regression problems in parameter space by employing any supervised learning technique. Central to this model is the mapping of function data from an infinite-dimensional function space to a finite-dimensional parameter space. This is accomplished by concurrently approximating multiple functions with a common set of B-spline basis functions by any chosen order, with their knot distribution determined by the Iterative Local Placement Algorithm, a newly proposed free knot placement algorithm. In contrast to the conventional equidistant knot placement strategy that uniformly distributes knot locations based on a predefined number of knots, our proposed algorithms determine knot location according to the local complexity of the input or output functions. The performance of our knot placement algorithms is shown to be robust in both ",
    "link": "http://arxiv.org/abs/2401.14989",
    "context": "Title: Mapping-to-Parameter Nonlinear Functional Regression with Novel B-spline Free Knot Placement Algorithm. (arXiv:2401.14989v1 [cs.LG])\nAbstract: We propose a novel approach to nonlinear functional regression, called the Mapping-to-Parameter function model, which addresses complex and nonlinear functional regression problems in parameter space by employing any supervised learning technique. Central to this model is the mapping of function data from an infinite-dimensional function space to a finite-dimensional parameter space. This is accomplished by concurrently approximating multiple functions with a common set of B-spline basis functions by any chosen order, with their knot distribution determined by the Iterative Local Placement Algorithm, a newly proposed free knot placement algorithm. In contrast to the conventional equidistant knot placement strategy that uniformly distributes knot locations based on a predefined number of knots, our proposed algorithms determine knot location according to the local complexity of the input or output functions. The performance of our knot placement algorithms is shown to be robust in both ",
    "path": "papers/24/01/2401.14989.json",
    "total_tokens": 832,
    "translated_title": "使用新型B样条自由节点放置算法的映射到参数非线性函数回归",
    "translated_abstract": "我们提出了一种新颖的非线性函数回归方法，称为映射到参数函数模型，通过采用任何监督学习技术处理参数空间中的复杂和非线性函数回归问题。该模型的核心是将函数数据从无限维函数空间映射到有限维参数空间。这是通过使用一组公用的B样条基函数同时近似多个函数来实现的，其节点分布由迭代局部放置算法确定，这是一种新提出的自由节点放置算法。与传统的等距节点放置策略相比，后者根据输入或输出函数的局部复杂性来确定节点位置，而不是基于预定义的节点数均匀分布节点位置。我们的节点放置算法的性能在两个方面都表现出了稳健性。",
    "tldr": "提出了一种新的非线性函数回归方法，通过将函数数据映射到有限维参数空间，并使用新的自由节点放置算法来同时近似多个函数。该算法根据输入或输出函数的局部复杂性来决定节点位置，性能稳健。"
}