{
    "title": "Peridynamic Neural Operators: A Data-Driven Nonlocal Constitutive Model for Complex Material Responses. (arXiv:2401.06070v1 [cond-mat.mtrl-sci])",
    "abstract": "Neural operators, which can act as implicit solution operators of hidden governing equations, have recently become popular tools for learning the responses of complex real-world physical systems. Nevertheless, most neural operator applications have thus far been data-driven and neglect the intrinsic preservation of fundamental physical laws in data. In this work, we introduce a novel integral neural operator architecture called the Peridynamic Neural Operator (PNO) that learns a nonlocal constitutive law from data. This neural operator provides a forward model in the form of state-based peridynamics, with objectivity and momentum balance laws automatically guaranteed. As applications, we demonstrate the expressivity and efficacy of our model in learning complex material behaviors from both synthetic and experimental data sets. We show that, owing to its ability to capture complex responses, our learned neural operator achieves improved accuracy and efficiency compared to baseline model",
    "link": "http://arxiv.org/abs/2401.06070",
    "context": "Title: Peridynamic Neural Operators: A Data-Driven Nonlocal Constitutive Model for Complex Material Responses. (arXiv:2401.06070v1 [cond-mat.mtrl-sci])\nAbstract: Neural operators, which can act as implicit solution operators of hidden governing equations, have recently become popular tools for learning the responses of complex real-world physical systems. Nevertheless, most neural operator applications have thus far been data-driven and neglect the intrinsic preservation of fundamental physical laws in data. In this work, we introduce a novel integral neural operator architecture called the Peridynamic Neural Operator (PNO) that learns a nonlocal constitutive law from data. This neural operator provides a forward model in the form of state-based peridynamics, with objectivity and momentum balance laws automatically guaranteed. As applications, we demonstrate the expressivity and efficacy of our model in learning complex material behaviors from both synthetic and experimental data sets. We show that, owing to its ability to capture complex responses, our learned neural operator achieves improved accuracy and efficiency compared to baseline model",
    "path": "papers/24/01/2401.06070.json",
    "total_tokens": 892,
    "translated_title": "Peridynamic神经运算符：一种面向复杂材料响应的数据驱动非局部本构模型",
    "translated_abstract": "近年来，神经运算符作为隐藏的控制方程的隐式解算算子，已经成为学习复杂实际物理系统响应的流行工具。然而，大部分神经运算符应用迄今为止都是数据驱动的，忽略了数据中对基本物理规律的固有保存。在本研究中，我们引入了一种新颖的积分神经运算符架构，称为Peridynamic神经运算符（PNO），用于从数据中学习非局部本构定律。这个神经运算符提供了一种以状态为基础的Peridynamics正向模型，能够自动保证客观性和动量平衡定律。作为应用，我们展示了我们模型在从合成和实验数据集中学习复杂材料行为方面的表现和效果。我们显示，由于其能够捕捉复杂响应，我们学习得到的神经运算符与基线模型相比在准确性和效率上均有提高。",
    "tldr": "Peridynamic神经运算符是一种数据驱动的非局部本构模型，能够从数据中学习复杂材料行为，并提供了具有客观性和动量平衡定律的正向模型。"
}