{
    "title": "Equivariant Graph Neural Operator for Modeling 3D Dynamics. (arXiv:2401.11037v1 [cs.LG])",
    "abstract": "Modeling the complex three-dimensional (3D) dynamics of relational systems is an important problem in the natural sciences, with applications ranging from molecular simulations to particle mechanics. Machine learning methods have achieved good success by learning graph neural networks to model spatial interactions. However, these approaches do not faithfully capture temporal correlations since they only model next-step predictions. In this work, we propose Equivariant Graph Neural Operator (EGNO), a novel and principled method that directly models dynamics as trajectories instead of just next-step prediction. Different from existing methods, EGNO explicitly learns the temporal evolution of 3D dynamics where we formulate the dynamics as a function over time and learn neural operators to approximate it. To capture the temporal correlations while keeping the intrinsic SE(3)-equivariance, we develop equivariant temporal convolutions parameterized in the Fourier space and build EGNO by stac",
    "link": "http://arxiv.org/abs/2401.11037",
    "context": "Title: Equivariant Graph Neural Operator for Modeling 3D Dynamics. (arXiv:2401.11037v1 [cs.LG])\nAbstract: Modeling the complex three-dimensional (3D) dynamics of relational systems is an important problem in the natural sciences, with applications ranging from molecular simulations to particle mechanics. Machine learning methods have achieved good success by learning graph neural networks to model spatial interactions. However, these approaches do not faithfully capture temporal correlations since they only model next-step predictions. In this work, we propose Equivariant Graph Neural Operator (EGNO), a novel and principled method that directly models dynamics as trajectories instead of just next-step prediction. Different from existing methods, EGNO explicitly learns the temporal evolution of 3D dynamics where we formulate the dynamics as a function over time and learn neural operators to approximate it. To capture the temporal correlations while keeping the intrinsic SE(3)-equivariance, we develop equivariant temporal convolutions parameterized in the Fourier space and build EGNO by stac",
    "path": "papers/24/01/2401.11037.json",
    "total_tokens": 865,
    "translated_title": "建模三维动力学的等变图神经操作器",
    "translated_abstract": "在自然科学中，建模复杂的三维关系系统动力学是一个重要问题，涉及领域从分子模拟到粒子力学。机器学习方法通过学习图神经网络来建模空间相互作用已取得良好成功。然而，这些方法只能进行下一步预测，不能准确捕捉时间相关性。本文提出了一种新颖而有原则的方法，即等变图神经操作器（EGNO），直接将动力学建模为轨迹而不仅仅是下一步预测。与现有方法不同，EGNO显式地学习三维动力学的时间演化，通过时间函数来建模动力学并学习神经操作器来近似。为了捕捉时间相关性，同时保持内在的SE(3)等变性，我们在傅里叶空间中参数化等变时间卷积，并通过堆叠卷积层构建EGNO。",
    "tldr": "本文提出了一种新的等变图神经操作器（EGNO）方法，能够直接将动力学建模为轨迹而不仅仅是下一步预测，以准确捕捉时间相关性，并利用等变时间卷积来保持其内在的等变性。",
    "en_tdlr": "The paper proposes a novel Equivariant Graph Neural Operator (EGNO) method that models dynamics as trajectories instead of just next-step predictions, accurately capturing temporal correlations, and utilizes equivariant temporal convolutions to maintain its intrinsic equivariance."
}