{
    "title": "Epidemic Modeling using Hybrid of Time-varying SIRD, Particle Swarm Optimization, and Deep Learning",
    "abstract": "Epidemiological models are best suitable to model an epidemic if the spread pattern is stationary. To deal with non-stationary patterns and multiple waves of an epidemic, we develop a hybrid model encompassing epidemic modeling, particle swarm optimization, and deep learning. The model mainly caters to three objectives for better prediction: 1. Periodic estimation of the model parameters. 2. Incorporating impact of all the aspects using data fitting and parameter optimization 3. Deep learning based prediction of the model parameters. In our model, we use a system of ordinary differential equations (ODEs) for Susceptible-Infected-Recovered-Dead (SIRD) epidemic modeling, Particle Swarm Optimization (PSO) for model parameter optimization, and stacked-LSTM for forecasting the model parameters. Initial or one time estimation of model parameters is not able to model multiple waves of an epidemic. So, we estimate the model parameters periodically (weekly). We use PSO to identify the optimum v",
    "link": "https://arxiv.org/abs/2401.18047",
    "context": "Title: Epidemic Modeling using Hybrid of Time-varying SIRD, Particle Swarm Optimization, and Deep Learning\nAbstract: Epidemiological models are best suitable to model an epidemic if the spread pattern is stationary. To deal with non-stationary patterns and multiple waves of an epidemic, we develop a hybrid model encompassing epidemic modeling, particle swarm optimization, and deep learning. The model mainly caters to three objectives for better prediction: 1. Periodic estimation of the model parameters. 2. Incorporating impact of all the aspects using data fitting and parameter optimization 3. Deep learning based prediction of the model parameters. In our model, we use a system of ordinary differential equations (ODEs) for Susceptible-Infected-Recovered-Dead (SIRD) epidemic modeling, Particle Swarm Optimization (PSO) for model parameter optimization, and stacked-LSTM for forecasting the model parameters. Initial or one time estimation of model parameters is not able to model multiple waves of an epidemic. So, we estimate the model parameters periodically (weekly). We use PSO to identify the optimum v",
    "path": "papers/24/01/2401.18047.json",
    "total_tokens": 970,
    "translated_title": "使用时变SIRD，粒子群优化和深度学习的流行病建模",
    "translated_abstract": "如果传播模式是稳定的话，流行病学模型是最适合用于建模流行病的。为了处理非稳态模式和流行病的多个波动，我们开发了一个包括流行病建模、粒子群优化和深度学习的混合模型。该模型主要满足三个目标以实现更好的预测：1. 周期性估计模型参数。2. 利用数据拟合和参数优化来考虑所有方面的影响。3. 基于深度学习的模型参数预测。在我们的模型中，我们使用一组常微分方程（ODEs）来进行易感-感染-恢复-死亡（SIRD）流行病建模，使用粒子群优化（PSO）进行模型参数优化，使用堆叠LSTM预测模型参数。单次或首次估计模型参数无法建模流行病的多个波动。因此，我们定期（每周）估计模型参数。我们使用PSO来确定最佳的参数值。",
    "tldr": "该论文开发了一个集流行病建模、粒子群优化和深度学习于一体的混合模型，用于处理非稳态模式和流行病的多个波动。模型主要满足三个目标：周期性估计模型参数、考虑所有方面的影响以提高预测准确性、利用深度学习预测模型参数。"
}