{
    "title": "Deep Generative Modeling for Financial Time Series with Application in VaR: A Comparative Review. (arXiv:2401.10370v1 [q-fin.CP])",
    "abstract": "In the financial services industry, forecasting the risk factor distribution conditional on the history and the current market environment is the key to market risk modeling in general and value at risk (VaR) model in particular. As one of the most widely adopted VaR models in commercial banks, Historical simulation (HS) uses the empirical distribution of daily returns in a historical window as the forecast distribution of risk factor returns in the next day. The objectives for financial time series generation are to generate synthetic data paths with good variety, and similar distribution and dynamics to the original historical data. In this paper, we apply multiple existing deep generative methods (e.g., CGAN, CWGAN, Diffusion, and Signature WGAN) for conditional time series generation, and propose and test two new methods for conditional multi-step time series generation, namely Encoder-Decoder CGAN and Conditional TimeVAE. Furthermore, we introduce a comprehensive framework with a ",
    "link": "http://arxiv.org/abs/2401.10370",
    "context": "Title: Deep Generative Modeling for Financial Time Series with Application in VaR: A Comparative Review. (arXiv:2401.10370v1 [q-fin.CP])\nAbstract: In the financial services industry, forecasting the risk factor distribution conditional on the history and the current market environment is the key to market risk modeling in general and value at risk (VaR) model in particular. As one of the most widely adopted VaR models in commercial banks, Historical simulation (HS) uses the empirical distribution of daily returns in a historical window as the forecast distribution of risk factor returns in the next day. The objectives for financial time series generation are to generate synthetic data paths with good variety, and similar distribution and dynamics to the original historical data. In this paper, we apply multiple existing deep generative methods (e.g., CGAN, CWGAN, Diffusion, and Signature WGAN) for conditional time series generation, and propose and test two new methods for conditional multi-step time series generation, namely Encoder-Decoder CGAN and Conditional TimeVAE. Furthermore, we introduce a comprehensive framework with a ",
    "path": "papers/24/01/2401.10370.json",
    "total_tokens": 839,
    "translated_title": "深度生成建模用于金融时间序列：VaR的比较研究",
    "translated_abstract": "在金融服务业中，基于历史数据和当前市场环境来预测风险因素分布是市场风险建模和价值-at-risk (VaR) 模型的关键。作为商业银行中最广泛采用的VaR模型之一，历史模拟 (HS) 使用历史窗口内每日收益的经验分布作为下一天风险因素收益的预测分布。金融时间序列生成的目标是生成具有良好变化性、与原始历史数据类似分布和动态的合成数据路径。本文应用了多种现有的深度生成方法 (例如CGAN、CWGAN、Diffusion和Signature WGAN) 进行条件时间序列生成，并提出并测试了两种新的条件多步时间序列生成方法，即Encoder-Decoder CGAN和Conditional TimeVAE。此外，我们介绍了一个全面的框架及其在VaR预测中的应用。",
    "tldr": "本文比较了深度生成建模在金融时间序列中的应用，提出了新的条件时间序列生成方法，并介绍了在VaR预测中的使用。",
    "en_tdlr": "This paper presents a comparative review on the application of deep generative modeling for financial time series, proposing new conditional time series generation methods and introducing their use in VaR forecasting."
}