{
    "title": "Traffic estimation in unobserved network locations using data-driven macroscopic models. (arXiv:2401.17095v1 [cs.LG])",
    "abstract": "This paper leverages macroscopic models and multi-source spatiotemporal data collected from automatic traffic counters and probe vehicles to accurately estimate traffic flow and travel time in links where these measurements are unavailable. This problem is critical in transportation planning applications where the sensor coverage is low and the planned interventions have network-wide impacts. The proposed model, named the Macroscopic Traffic Estimator (MaTE), can perform network-wide estimations of traffic flow and travel time only using the set of observed measurements of these quantities. Because MaTE is grounded in macroscopic flow theory, all parameters and variables are interpretable. The estimated traffic flow satisfies fundamental flow conservation constraints and exhibits an increasing monotonic relationship with the estimated travel time. Using logit-based stochastic traffic assignment as the principle for routing flow behavior makes the model fully differentiable with respect",
    "link": "http://arxiv.org/abs/2401.17095",
    "context": "Title: Traffic estimation in unobserved network locations using data-driven macroscopic models. (arXiv:2401.17095v1 [cs.LG])\nAbstract: This paper leverages macroscopic models and multi-source spatiotemporal data collected from automatic traffic counters and probe vehicles to accurately estimate traffic flow and travel time in links where these measurements are unavailable. This problem is critical in transportation planning applications where the sensor coverage is low and the planned interventions have network-wide impacts. The proposed model, named the Macroscopic Traffic Estimator (MaTE), can perform network-wide estimations of traffic flow and travel time only using the set of observed measurements of these quantities. Because MaTE is grounded in macroscopic flow theory, all parameters and variables are interpretable. The estimated traffic flow satisfies fundamental flow conservation constraints and exhibits an increasing monotonic relationship with the estimated travel time. Using logit-based stochastic traffic assignment as the principle for routing flow behavior makes the model fully differentiable with respect",
    "path": "papers/24/01/2401.17095.json",
    "total_tokens": 898,
    "translated_title": "在未观测到的网络位置使用数据驱动的宏观模型进行交通估计",
    "translated_abstract": "本文利用宏观模型和自动交通计数器和探测车辆收集的多源时空数据，准确估计无法获得这些测量数据的路段的交通流量和行驶时间。这个问题在交通规划应用中是关键的，因为传感器覆盖范围有限，规划的干预措施会对整个网络产生影响。提出的模型命名为宏观交通估计器（MaTE），可以仅使用这些数量的观测测量来进行网络范围的交通流量和行驶时间估计。由于MaTE基于宏观流量理论，所有参数和变量都是可以解释的。估计的交通流量满足基本的流量守恒约束条件，并且与估计的行驶时间呈递增的单调关系。将基于logit的随机交通分配作为流量行为路由的原则使得模型在可微方面具有完全可区分性。",
    "tldr": "本文提出了一种利用宏观模型和多源时空数据的方法来估计无法观测到的网络位置的交通流量和行驶时间。该方法可以在传感器覆盖范围有限的情况下进行准确的估计，并满足基本的流量守恒约束条件。"
}