{
    "title": "Curriculum Design Helps Spiking Neural Networks to Classify Time Series. (arXiv:2401.10257v1 [cs.NE])",
    "abstract": "Spiking Neural Networks (SNNs) have a greater potential for modeling time series data than Artificial Neural Networks (ANNs), due to their inherent neuron dynamics and low energy consumption. However, it is difficult to demonstrate their superiority in classification accuracy, because current efforts mainly focus on designing better network structures. In this work, enlighten by brain-inspired science, we find that, not only the structure but also the learning process should be human-like. To achieve this, we investigate the power of Curriculum Learning (CL) on SNNs by designing a novel method named CSNN with two theoretically guaranteed mechanisms: The active-to-dormant training order makes the curriculum similar to that of human learning and suitable for spiking neurons; The value-based regional encoding makes the neuron activity to mimic the brain memory when learning sequential data. Experiments on multiple time series sources including simulated, sensor, motion, and healthcare dem",
    "link": "http://arxiv.org/abs/2401.10257",
    "context": "Title: Curriculum Design Helps Spiking Neural Networks to Classify Time Series. (arXiv:2401.10257v1 [cs.NE])\nAbstract: Spiking Neural Networks (SNNs) have a greater potential for modeling time series data than Artificial Neural Networks (ANNs), due to their inherent neuron dynamics and low energy consumption. However, it is difficult to demonstrate their superiority in classification accuracy, because current efforts mainly focus on designing better network structures. In this work, enlighten by brain-inspired science, we find that, not only the structure but also the learning process should be human-like. To achieve this, we investigate the power of Curriculum Learning (CL) on SNNs by designing a novel method named CSNN with two theoretically guaranteed mechanisms: The active-to-dormant training order makes the curriculum similar to that of human learning and suitable for spiking neurons; The value-based regional encoding makes the neuron activity to mimic the brain memory when learning sequential data. Experiments on multiple time series sources including simulated, sensor, motion, and healthcare dem",
    "path": "papers/24/01/2401.10257.json",
    "total_tokens": 975,
    "translated_title": "课程设计帮助脉冲神经网络对时间序列进行分类",
    "translated_abstract": "脉冲神经网络(SNNs)在建模时间序列数据方面比人工神经网络(ANNs)具有更大的潜力，这是由于其固有的神经元动力学和低能量消耗。然而，由于目前的努力主要集中在设计更好的网络结构上，很难证明它们在分类准确性上的优势。在这项工作中，我们借鉴了大脑启发式科学的思想，发现不仅结构，学习过程也应该像人类一样。为了实现这一点，我们通过设计一种名为CSNN的新方法，通过两个理论上保证的机制探索了课程学习(CL)在SNNs上的潜力：主动-休眠训练顺序使课程类似于人类的学习和适合脉冲神经元；基于值的区域编码使神经元的活动在学习连续数据时模拟大脑的记忆。我们在多个时间序列源上进行了实验，包括模拟、传感器、运动和医疗保健数据。",
    "tldr": "本文研究了脉冲神经网络（SNNs）上课程学习（Curriculum Learning）的作用，通过设计一种名为CSNN的新方法，在学习顺序和神经元活动编码方面模拟了人类学习的过程。实验证明，这种方法在多个时间序列数据上取得了优秀的分类结果。",
    "en_tdlr": "This paper investigates the role of Curriculum Learning (CL) on Spiking Neural Networks (SNNs) by designing a novel method named CSNN. The experiments demonstrate that this method, which simulates the human learning process in terms of learning order and neuron activity encoding, achieves excellent classification results on multiple time series data."
}