{
    "title": "On the Convergence of Semi Unsupervised Calibration through Prior Adaptation Algorithm. (arXiv:2401.03051v1 [cs.LG])",
    "abstract": "Calibration is an essential key in machine leaning. Semi Unsupervised Calibration through Prior Adaptation (SUCPA) is a calibration algorithm used in (but not limited to) large-scale language models defined by a {system of first-order difference equation. The map derived by this system} has the peculiarity of being non-hyperbolic {with a non-bounded set of non-isolated fixed points}. In this work, we prove several convergence properties of this algorithm from the perspective of dynamical systems. For a binary classification problem, it can be shown that the algorithm always converges, {more precisely, the map is globally asymptotically stable, and the orbits converge} to a single line of fixed points. Finally, we perform numerical experiments on real-world application to support the presented results. Experiment codes are available online.",
    "link": "http://arxiv.org/abs/2401.03051",
    "context": "Title: On the Convergence of Semi Unsupervised Calibration through Prior Adaptation Algorithm. (arXiv:2401.03051v1 [cs.LG])\nAbstract: Calibration is an essential key in machine leaning. Semi Unsupervised Calibration through Prior Adaptation (SUCPA) is a calibration algorithm used in (but not limited to) large-scale language models defined by a {system of first-order difference equation. The map derived by this system} has the peculiarity of being non-hyperbolic {with a non-bounded set of non-isolated fixed points}. In this work, we prove several convergence properties of this algorithm from the perspective of dynamical systems. For a binary classification problem, it can be shown that the algorithm always converges, {more precisely, the map is globally asymptotically stable, and the orbits converge} to a single line of fixed points. Finally, we perform numerical experiments on real-world application to support the presented results. Experiment codes are available online.",
    "path": "papers/24/01/2401.03051.json",
    "total_tokens": 778,
    "translated_title": "半无监督校准通过先验适应算法的收敛性研究",
    "translated_abstract": "校准是机器学习中的一个关键任务。Semi Unsupervised Calibration through Prior Adaptation (SUCPA)是一种校准算法，适用于大规模语言模型，其定义为一个一阶差分方程组。该方程组导出的映射具有非双曲性特征，并且存在一组非孤立不界定的固定点。本文从动力系统的视角证明了该算法的多个收敛性质。对于二类分类问题，可以证明该算法总是收敛，更具体地说，该映射是全局渐近稳定的，轨道收敛到一条固定点直线上。最后，我们对实际应用进行了数值实验，以支持所提出的结果。实验代码可在网上找到。",
    "tldr": "本文研究了一种半无监督校准算法，使用动力系统的观点证明了该算法的收敛性质，并通过实验验证了所提出的结果。",
    "en_tdlr": "This paper investigates a semi unsupervised calibration algorithm and proves its convergence properties from the perspective of dynamical systems. The presented results are supported by numerical experiments."
}