{
    "title": "Airport service quality perception and flight delays: examining the influence of psychosituational latent traits of respondents in passenger satisfaction surveys. (arXiv:2401.02139v1 [econ.GN])",
    "abstract": "The service quality of a passenger transport operator can be measured through face-to-face surveys at the terminals or on board. However, the resulting responses may suffer from the influence of the intrinsic aspects of the respondent's personality and emotional context at the time of the interview. This study proposes a methodology to generate and select control variables for these latent psychosituational traits, thus mitigating the risk of omitted variable bias. We developed an econometric model of the determinants of passenger satisfaction in a survey conducted at the largest airport in Latin America, S\\~ao Paulo GRU Airport. Our focus was on the role of flight delays in the perception of quality. The results of this study confirm the existence of a relationship between flight delays and the global satisfaction of passengers with airports. In addition, favorable evaluations regarding airports' food/beverage concessions and Wi-Fi services, but not their retail options, have a releva",
    "link": "http://arxiv.org/abs/2401.02139",
    "context": "Title: Airport service quality perception and flight delays: examining the influence of psychosituational latent traits of respondents in passenger satisfaction surveys. (arXiv:2401.02139v1 [econ.GN])\nAbstract: The service quality of a passenger transport operator can be measured through face-to-face surveys at the terminals or on board. However, the resulting responses may suffer from the influence of the intrinsic aspects of the respondent's personality and emotional context at the time of the interview. This study proposes a methodology to generate and select control variables for these latent psychosituational traits, thus mitigating the risk of omitted variable bias. We developed an econometric model of the determinants of passenger satisfaction in a survey conducted at the largest airport in Latin America, S\\~ao Paulo GRU Airport. Our focus was on the role of flight delays in the perception of quality. The results of this study confirm the existence of a relationship between flight delays and the global satisfaction of passengers with airports. In addition, favorable evaluations regarding airports' food/beverage concessions and Wi-Fi services, but not their retail options, have a releva",
    "path": "papers/24/01/2401.02139.json",
    "total_tokens": 935,
    "translated_title": "机场服务质量感知和航班延误：研究调查报告中受访者心理环境的潜在特征对乘客满意度的影响。",
    "translated_abstract": "乘客运输经营者的服务质量可以通过在候机楼或飞机上进行面对面调查来衡量。然而，由于受访者个性和情感背景在访谈时的影响，所得到的回答可能受到内在因素的影响。该研究提出了一种生成和选择控制变量以应对这些潜在心理环境特征的方法，从而减少遗漏变量偏误的风险。我们在拉丁美洲最大的机场——圣保罗格鲁机场进行了一项调查，开发了一个经济计量模型，用于确定乘客满意度的决定因素。我们重点研究了航班延误在服务质量感知中的作用。研究结果证实了航班延误与旅客对机场的整体满意度之间存在着关联。此外，对机场的餐饮和Wi-Fi服务给予了积极评价，但不包括机场的零售选择。",
    "tldr": "该研究通过调查乘客满意度，研究了航班延误对机场服务质量感知的影响，并提出了一种方法来应对受访者的潜在心理环境特征。研究结果证实了航班延误与乘客对机场的整体满意度之间的关联。"
}