{
    "title": "Community Detection in the Multi-View Stochastic Block Model. (arXiv:2401.09510v1 [cs.SI])",
    "abstract": "This paper considers the problem of community detection on multiple potentially correlated graphs from an information-theoretical perspective. We first put forth a random graph model, called the multi-view stochastic block model (MVSBM), designed to generate correlated graphs on the same set of nodes (with cardinality $n$). The $n$ nodes are partitioned into two disjoint communities of equal size. The presence or absence of edges in the graphs for each pair of nodes depends on whether the two nodes belong to the same community or not. The objective for the learner is to recover the hidden communities with observed graphs. Our technical contributions are two-fold: (i) We establish an information-theoretic upper bound (Theorem~1) showing that exact recovery of community is achievable when the model parameters of MVSBM exceed a certain threshold. (ii) Conversely, we derive an information-theoretic lower bound (Theorem~2) showing that when the model parameters of MVSBM fall below the afore",
    "link": "http://arxiv.org/abs/2401.09510",
    "context": "Title: Community Detection in the Multi-View Stochastic Block Model. (arXiv:2401.09510v1 [cs.SI])\nAbstract: This paper considers the problem of community detection on multiple potentially correlated graphs from an information-theoretical perspective. We first put forth a random graph model, called the multi-view stochastic block model (MVSBM), designed to generate correlated graphs on the same set of nodes (with cardinality $n$). The $n$ nodes are partitioned into two disjoint communities of equal size. The presence or absence of edges in the graphs for each pair of nodes depends on whether the two nodes belong to the same community or not. The objective for the learner is to recover the hidden communities with observed graphs. Our technical contributions are two-fold: (i) We establish an information-theoretic upper bound (Theorem~1) showing that exact recovery of community is achievable when the model parameters of MVSBM exceed a certain threshold. (ii) Conversely, we derive an information-theoretic lower bound (Theorem~2) showing that when the model parameters of MVSBM fall below the afore",
    "path": "papers/24/01/2401.09510.json",
    "total_tokens": 924,
    "translated_title": "多视图随机块模型中的社区检测",
    "translated_abstract": "本文从信息理论的角度考虑了基于多个可能相关的图的社区检测问题。我们首先提出了一个随机图模型，称为多视图随机块模型（MVSBM），用于在相同的节点集上生成相关的图（节点个数为n）。这n个节点被划分为两个相等大小的不相交社区。图中每对节点之间的边的存在与否取决于这两个节点是否属于同一个社区。学习器的目标是通过观察到的图来恢复隐藏的社区。我们的技术贡献有两个方面：（i）我们建立了一个信息理论上界（定理1），表明当MVSBM的模型参数超过一定阈值时，可以实现精确恢复社区。（ii）相反地，我们推导出一个信息理论下界（定理2），表明当MVSBM的模型参数低于前述阈值时，无法实现精确恢复社区。",
    "tldr": "本文介绍了一个多视图随机块模型（MVSBM），以信息理论的角度研究了在多个相关图上进行的社区检测问题。我们证明了当模型参数超过阈值时可以实现精确恢复社区，而当参数低于阈值时无法达到精确恢复社区的要求。",
    "en_tdlr": "This paper introduces a multi-view stochastic block model (MVSBM) and studies the problem of community detection on multiple correlated graphs from an information-theoretical perspective. It is shown that exact recovery of communities can be achieved when the model parameters exceed a certain threshold, while it is not possible to achieve exact recovery below that threshold."
}