{
    "title": "Wavelet-Inspired Multiscale Graph Convolutional Recurrent Network for Traffic Forecasting. (arXiv:2401.06040v1 [cs.LG])",
    "abstract": "Traffic forecasting is the foundation for intelligent transportation systems. Spatiotemporal graph neural networks have demonstrated state-of-the-art performance in traffic forecasting. However, these methods do not explicitly model some of the natural characteristics in traffic data, such as the multiscale structure that encompasses spatial and temporal variations at different levels of granularity or scale. To that end, we propose a Wavelet-Inspired Graph Convolutional Recurrent Network (WavGCRN) which combines multiscale analysis (MSA)-based method with Deep Learning (DL)-based method. In WavGCRN, the traffic data is decomposed into time-frequency components with Discrete Wavelet Transformation (DWT), constructing a multi-stream input structure; then Graph Convolutional Recurrent networks (GCRNs) are employed as encoders for each stream, extracting spatiotemporal features in different scales; and finally the learnable Inversed DWT and GCRN are combined as the decoder, fusing the inf",
    "link": "http://arxiv.org/abs/2401.06040",
    "context": "Title: Wavelet-Inspired Multiscale Graph Convolutional Recurrent Network for Traffic Forecasting. (arXiv:2401.06040v1 [cs.LG])\nAbstract: Traffic forecasting is the foundation for intelligent transportation systems. Spatiotemporal graph neural networks have demonstrated state-of-the-art performance in traffic forecasting. However, these methods do not explicitly model some of the natural characteristics in traffic data, such as the multiscale structure that encompasses spatial and temporal variations at different levels of granularity or scale. To that end, we propose a Wavelet-Inspired Graph Convolutional Recurrent Network (WavGCRN) which combines multiscale analysis (MSA)-based method with Deep Learning (DL)-based method. In WavGCRN, the traffic data is decomposed into time-frequency components with Discrete Wavelet Transformation (DWT), constructing a multi-stream input structure; then Graph Convolutional Recurrent networks (GCRNs) are employed as encoders for each stream, extracting spatiotemporal features in different scales; and finally the learnable Inversed DWT and GCRN are combined as the decoder, fusing the inf",
    "path": "papers/24/01/2401.06040.json",
    "total_tokens": 917,
    "translated_title": "基于小波启发的多尺度图卷积循环网络用于交通预测",
    "translated_abstract": "交通预测是智能交通系统的基础。时空图神经网络在交通预测中展现出了最先进的性能。然而，这些方法并没有明确地对交通数据中的某些自然特征进行建模，比如包含不同粒度或尺度上的空间和时间变化的多尺度结构。为此，我们提出了一种基于小波启发的图卷积循环网络（WavGCRN），将多尺度分析（MSA）方法和深度学习（DL）方法相结合。在WavGCRN中，交通数据通过离散小波变换（DWT）被分解为时频分量，构建了多流输入结构；然后使用图卷积循环网络（GCRNs）作为编码器对每个流进行特征提取，提取不同尺度的时空特征；最后，可学习的逆DWT和GCRN被结合为解码器，融合信息。",
    "tldr": "本论文提出了一种基于小波启发的多尺度图卷积循环网络，用于交通预测。该方法将多尺度分析方法和深度学习方法相结合，对交通数据中的多尺度结构进行建模，并展现了较好的性能。",
    "en_tdlr": "This paper proposes a wavelet-inspired multiscale graph convolutional recurrent network for traffic forecasting. The method combines multiscale analysis and deep learning, explicitly models the multiscale structure in traffic data, and achieves state-of-the-art performance."
}