{
    "title": "GLISP: A Scalable GNN Learning System by Exploiting Inherent Structural Properties of Graphs. (arXiv:2401.03114v1 [cs.LG])",
    "abstract": "As a powerful tool for modeling graph data, Graph Neural Networks (GNNs) have received increasing attention in both academia and industry. Nevertheless, it is notoriously difficult to deploy GNNs on industrial scale graphs, due to their huge data size and complex topological structures. In this paper, we propose GLISP, a sampling based GNN learning system for industrial scale graphs. By exploiting the inherent structural properties of graphs, such as power law distribution and data locality, GLISP addresses the scalability and performance issues that arise at different stages of the graph learning process. GLISP consists of three core components: graph partitioner, graph sampling service and graph inference engine. The graph partitioner adopts the proposed vertex-cut graph partitioning algorithm AdaDNE to produce balanced partitioning for power law graphs, which is essential for sampling based GNN systems. The graph sampling service employs a load balancing design that allows the one h",
    "link": "http://arxiv.org/abs/2401.03114",
    "context": "Title: GLISP: A Scalable GNN Learning System by Exploiting Inherent Structural Properties of Graphs. (arXiv:2401.03114v1 [cs.LG])\nAbstract: As a powerful tool for modeling graph data, Graph Neural Networks (GNNs) have received increasing attention in both academia and industry. Nevertheless, it is notoriously difficult to deploy GNNs on industrial scale graphs, due to their huge data size and complex topological structures. In this paper, we propose GLISP, a sampling based GNN learning system for industrial scale graphs. By exploiting the inherent structural properties of graphs, such as power law distribution and data locality, GLISP addresses the scalability and performance issues that arise at different stages of the graph learning process. GLISP consists of three core components: graph partitioner, graph sampling service and graph inference engine. The graph partitioner adopts the proposed vertex-cut graph partitioning algorithm AdaDNE to produce balanced partitioning for power law graphs, which is essential for sampling based GNN systems. The graph sampling service employs a load balancing design that allows the one h",
    "path": "papers/24/01/2401.03114.json",
    "total_tokens": 898,
    "translated_title": "GLISP：通过利用图的固有结构属性的可扩展GNN学习系统",
    "translated_abstract": "作为一种建模图数据的强大工具，图神经网络（GNN）在学术界和工业界都受到了越来越多的关注。然而，由于数据规模巨大和复杂的拓扑结构，将GNN应用于工业规模的图中仍然非常困难。在本文中，我们提出了GLISP，一种用于工业规模图的采样型GNN学习系统。通过利用图的固有结构属性，如幂律分布和数据局部性，GLISP解决了图学习过程中不同阶段产生的可扩展性和性能问题。GLISP由三个核心组件组成：图分区器、图采样服务和图推理引擎。图分区器采用了提出的顶点切割图分区算法AdaDNE，为基于采样的GNN系统产生了平衡的分区，这对于采样型GNN系统至关重要。图采样服务采用了负载均衡设计，允许一些服务进程处理计算和存储负载，从而提高了系统的效率和可扩展性。",
    "tldr": "GLISP是一种可扩展的GNN学习系统，通过利用图的结构属性来解决在工业规模图上应用GNN时遇到的可扩展性和性能问题。",
    "en_tdlr": "GLISP is a scalable GNN learning system that addresses the scalability and performance issues in using GNNs on industrial scale graphs by exploiting the structural properties of graphs."
}