{
    "title": "Adaptive Data Augmentation for Aspect Sentiment Quad Prediction. (arXiv:2401.06394v1 [cs.CL])",
    "abstract": "Aspect sentiment quad prediction (ASQP) aims to predict the quad sentiment elements for a given sentence, which is a critical task in the field of aspect-based sentiment analysis. However, the data imbalance issue has not received sufficient attention in ASQP task. In this paper, we divide the issue into two-folds, quad-pattern imbalance and aspect-category imbalance, and propose an Adaptive Data Augmentation (ADA) framework to tackle the imbalance issue. Specifically, a data augmentation process with a condition function adaptively enhances the tail quad patterns and aspect categories, alleviating the data imbalance in ASQP. Following previous studies, we also further explore the generative framework for extracting complete quads by introducing the category prior knowledge and syntax-guided decoding target. Experimental results demonstrate that data augmentation for imbalance in ASQP task can improve the performance, and the proposed ADA method is superior to naive data oversampling.",
    "link": "http://arxiv.org/abs/2401.06394",
    "context": "Title: Adaptive Data Augmentation for Aspect Sentiment Quad Prediction. (arXiv:2401.06394v1 [cs.CL])\nAbstract: Aspect sentiment quad prediction (ASQP) aims to predict the quad sentiment elements for a given sentence, which is a critical task in the field of aspect-based sentiment analysis. However, the data imbalance issue has not received sufficient attention in ASQP task. In this paper, we divide the issue into two-folds, quad-pattern imbalance and aspect-category imbalance, and propose an Adaptive Data Augmentation (ADA) framework to tackle the imbalance issue. Specifically, a data augmentation process with a condition function adaptively enhances the tail quad patterns and aspect categories, alleviating the data imbalance in ASQP. Following previous studies, we also further explore the generative framework for extracting complete quads by introducing the category prior knowledge and syntax-guided decoding target. Experimental results demonstrate that data augmentation for imbalance in ASQP task can improve the performance, and the proposed ADA method is superior to naive data oversampling.",
    "path": "papers/24/01/2401.06394.json",
    "total_tokens": 889,
    "translated_title": "自适应数据增强用于方面情感四元预测",
    "translated_abstract": "方面情感四元预测（ASQP）旨在预测给定句子的四元情感元素，这是方面情感分析领域中的关键任务。然而，在ASQP任务中，数据不平衡问题尚未得到足够的重视。在本文中，我们将问题分为两个方面：四元模式不平衡和方面类别不平衡，并提出了一种自适应数据增强（ADA）框架来解决不平衡问题。具体而言，通过具有条件函数的数据增强过程，自适应增强尾部四元模式和方面类别，缓解ASQP中的数据不平衡。在之前的研究基础上，我们还进一步探索了生成框架，通过引入类别先验知识和语法引导解码目标，提取完整的四元。实验证实，数据增强可以改善ASQP任务中的不平衡问题，并且所提出的ADA方法优于简单的数据过采样方法。",
    "tldr": "本文提出了一种自适应数据增强（ADA）框架来解决方面情感四元预测（ASQP）任务中的数据不平衡问题。实验证实，数据增强可以改善ASQP任务的性能，而ADA方法优于简单的数据过采样方法。",
    "en_tdlr": "This paper proposes an Adaptive Data Augmentation (ADA) framework to address the data imbalance issue in Aspect Sentiment Quad Prediction (ASQP) task. Experimental results demonstrate that data augmentation improves the performance of the ASQP task, and the proposed ADA method outperforms simple data oversampling."
}