{
    "title": "Optimized Ensemble Model Towards Secured Industrial IoT Devices. (arXiv:2401.05509v1 [cs.CR])",
    "abstract": "The continued growth in the deployment of Internet-of-Things (IoT) devices has been fueled by the increased connectivity demand, particularly in industrial environments. However, this has led to an increase in the number of network related attacks due to the increased number of potential attack surfaces. Industrial IoT (IIoT) devices are prone to various network related attacks that can have severe consequences on the manufacturing process as well as on the safety of the workers in the manufacturing plant. One promising solution that has emerged in recent years for attack detection is Machine learning (ML). More specifically, ensemble learning models have shown great promise in improving the performance of the underlying ML models. Accordingly, this paper proposes a framework based on the combined use of Bayesian Optimization-Gaussian Process (BO-GP) with an ensemble tree-based learning model to improve the performance of intrusion and attack detection in IIoT environments. The propose",
    "link": "http://arxiv.org/abs/2401.05509",
    "context": "Title: Optimized Ensemble Model Towards Secured Industrial IoT Devices. (arXiv:2401.05509v1 [cs.CR])\nAbstract: The continued growth in the deployment of Internet-of-Things (IoT) devices has been fueled by the increased connectivity demand, particularly in industrial environments. However, this has led to an increase in the number of network related attacks due to the increased number of potential attack surfaces. Industrial IoT (IIoT) devices are prone to various network related attacks that can have severe consequences on the manufacturing process as well as on the safety of the workers in the manufacturing plant. One promising solution that has emerged in recent years for attack detection is Machine learning (ML). More specifically, ensemble learning models have shown great promise in improving the performance of the underlying ML models. Accordingly, this paper proposes a framework based on the combined use of Bayesian Optimization-Gaussian Process (BO-GP) with an ensemble tree-based learning model to improve the performance of intrusion and attack detection in IIoT environments. The propose",
    "path": "papers/24/01/2401.05509.json",
    "total_tokens": 810,
    "translated_title": "面向安全工业物联网设备的优化集成模型",
    "translated_abstract": "由于对连接性需求的增加，特别是在工业环境中，物联网设备的部署持续增长。然而，这导致了与网络相关的攻击数量的增加，因为潜在攻击表面的增加。工业物联网（IIoT）设备易受各种网络相关攻击的影响，这可能对制造过程以及制造厂工人的安全造成严重后果。近年来，针对攻击检测的一种有希望的解决方案是机器学习（ML）。更具体而言，集成学习模型在改善底层ML模型的性能方面显示出巨大的潜力。因此，本文提出了一个基于贝叶斯优化-高斯过程（BO-GP）和集成基于树的学习模型的框架，以提高IIoT环境中入侵和攻击检测的性能。",
    "tldr": "本文提出了一种面向安全工业物联网设备的优化集成模型，将贝叶斯优化-高斯过程与集成树学习模型相结合，以提高工业物联网环境中入侵和攻击检测的性能。"
}