{
    "title": "SelfEEG: A Python library for Self-Supervised Learning in Electroencephalography. (arXiv:2401.05405v1 [eess.SP])",
    "abstract": "SelfEEG is an open-source Python library developed to assist researchers in conducting Self-Supervised Learning (SSL) experiments on electroencephalography (EEG) data. Its primary objective is to offer a user-friendly but highly customizable environment, enabling users to efficiently design and execute self-supervised learning tasks on EEG data.  SelfEEG covers all the stages of a typical SSL pipeline, ranging from data import to model design and training. It includes modules specifically designed to: split data at various granularity levels (e.g., session-, subject-, or dataset-based splits); effectively manage data stored with different configurations (e.g., file extensions, data types) during mini-batch construction; provide a wide range of standard deep learning models, data augmentations and SSL baseline methods applied to EEG data.  Most of the functionalities offered by selfEEG can be executed both on GPUs and CPUs, expanding its usability beyond the self-supervised learning are",
    "link": "http://arxiv.org/abs/2401.05405",
    "context": "Title: SelfEEG: A Python library for Self-Supervised Learning in Electroencephalography. (arXiv:2401.05405v1 [eess.SP])\nAbstract: SelfEEG is an open-source Python library developed to assist researchers in conducting Self-Supervised Learning (SSL) experiments on electroencephalography (EEG) data. Its primary objective is to offer a user-friendly but highly customizable environment, enabling users to efficiently design and execute self-supervised learning tasks on EEG data.  SelfEEG covers all the stages of a typical SSL pipeline, ranging from data import to model design and training. It includes modules specifically designed to: split data at various granularity levels (e.g., session-, subject-, or dataset-based splits); effectively manage data stored with different configurations (e.g., file extensions, data types) during mini-batch construction; provide a wide range of standard deep learning models, data augmentations and SSL baseline methods applied to EEG data.  Most of the functionalities offered by selfEEG can be executed both on GPUs and CPUs, expanding its usability beyond the self-supervised learning are",
    "path": "papers/24/01/2401.05405.json",
    "total_tokens": 977,
    "translated_title": "SelfEEG: 一种用于自监督学习的脑电图Python库",
    "translated_abstract": "SelfEEG是一个开源的Python库，旨在帮助研究人员在脑电图（EEG）数据上进行自监督学习（SSL）实验。它的主要目标是提供一个用户友好但高度可定制的环境，使用户能够高效地设计和执行脑电图数据上的自监督学习任务。SelfEEG涵盖了典型自监督学习流程的各个阶段，包括数据导入、模型设计和训练。它包括专门设计的模块，用于在不同粒度水平（例如基于会议、受试者或数据集的划分）上分割数据；在小批量构建期间高效管理存储有不同配置（例如文件扩展名、数据类型）的数据；提供广泛的标准深度学习模型、数据增强和应用于脑电图数据的自监督学习基准方法。SelfEEG的大多数功能既可以在GPU上执行，也可以在CPU上执行，扩展了其可用性超出自监督学习领域。",
    "tldr": "SelfEEG是一个为研究人员提供的开源Python库，旨在帮助他们在脑电图数据上进行自监督学习实验。它提供了用户友好且高度可定制的环境，涵盖了从数据导入到模型设计和训练的所有阶段，并提供了各种功能来有效地处理脑电图数据。",
    "en_tdlr": "SelfEEG is an open-source Python library that assists researchers in conducting self-supervised learning experiments on electroencephalography (EEG) data. It provides a user-friendly and highly customizable environment, covering all stages from data import to model design and training, and offering various functionalities for efficient handling of EEG data."
}