{
    "title": "Distribution-Free Conformal Joint Prediction Regions for Neural Marked Temporal Point Processes. (arXiv:2401.04612v1 [cs.LG])",
    "abstract": "Sequences of labeled events observed at irregular intervals in continuous time are ubiquitous across various fields. Temporal Point Processes (TPPs) provide a mathematical framework for modeling these sequences, enabling inferences such as predicting the arrival time of future events and their associated label, called mark. However, due to model misspecification or lack of training data, these probabilistic models may provide a poor approximation of the true, unknown underlying process, with prediction regions extracted from them being unreliable estimates of the underlying uncertainty. This paper develops more reliable methods for uncertainty quantification in neural TPP models via the framework of conformal prediction. A primary objective is to generate a distribution-free joint prediction region for the arrival time and mark, with a finite-sample marginal coverage guarantee. A key challenge is to handle both a strictly positive, continuous response and a categorical response, withou",
    "link": "http://arxiv.org/abs/2401.04612",
    "context": "Title: Distribution-Free Conformal Joint Prediction Regions for Neural Marked Temporal Point Processes. (arXiv:2401.04612v1 [cs.LG])\nAbstract: Sequences of labeled events observed at irregular intervals in continuous time are ubiquitous across various fields. Temporal Point Processes (TPPs) provide a mathematical framework for modeling these sequences, enabling inferences such as predicting the arrival time of future events and their associated label, called mark. However, due to model misspecification or lack of training data, these probabilistic models may provide a poor approximation of the true, unknown underlying process, with prediction regions extracted from them being unreliable estimates of the underlying uncertainty. This paper develops more reliable methods for uncertainty quantification in neural TPP models via the framework of conformal prediction. A primary objective is to generate a distribution-free joint prediction region for the arrival time and mark, with a finite-sample marginal coverage guarantee. A key challenge is to handle both a strictly positive, continuous response and a categorical response, withou",
    "path": "papers/24/01/2401.04612.json",
    "total_tokens": 861,
    "translated_title": "无分布假设的神经标记时序点过程的无偏预测区间",
    "translated_abstract": "在连续时间的不规则间隔观测到的标记事件序列在各个领域中普遍存在。时序点过程（Temporal Point Processes，TPPs）提供了建模这些序列的数学框架，可以进行诸如预测未来事件的到达时间和相关标记等推断。然而，由于模型规范错误或缺乏训练数据，这些概率模型可能对未知的真实基础过程提供较差的近似，从中提取的预测区域可能是对基础不确定性的不可靠估计。本文基于相容预测框架，为神经TPP模型提供更可靠的不确定性量化方法。其中的一个主要目标是生成到达时间和标记的无分布假设的联合预测区间，并提供有限样本边际覆盖保证。一个关键挑战是同时处理严格正的连续响应和分类响应，而不需要分布假设。",
    "tldr": "本文为神经标记时序点过程模型开发了可靠的不确定性量化方法，通过相容预测框架生成无分布假设的联合预测区间，并提供较好的边际覆盖保证。"
}