{
    "title": "HyperGANStrument: Instrument Sound Synthesis and Editing with Pitch-Invariant Hypernetworks. (arXiv:2401.04558v1 [cs.SD])",
    "abstract": "GANStrument, exploiting GANs with a pitch-invariant feature extractor and instance conditioning technique, has shown remarkable capabilities in synthesizing realistic instrument sounds. To further improve the reconstruction ability and pitch accuracy to enhance the editability of user-provided sound, we propose HyperGANStrument, which introduces a pitch-invariant hypernetwork to modulate the weights of a pre-trained GANStrument generator, given a one-shot sound as input. The hypernetwork modulation provides feedback for the generator in the reconstruction of the input sound. In addition, we take advantage of an adversarial fine-tuning scheme for the hypernetwork to improve the reconstruction fidelity and generation diversity of the generator. Experimental results show that the proposed model not only enhances the generation capability of GANStrument but also significantly improves the editability of synthesized sounds. Audio examples are available at the online demo page.",
    "link": "http://arxiv.org/abs/2401.04558",
    "context": "Title: HyperGANStrument: Instrument Sound Synthesis and Editing with Pitch-Invariant Hypernetworks. (arXiv:2401.04558v1 [cs.SD])\nAbstract: GANStrument, exploiting GANs with a pitch-invariant feature extractor and instance conditioning technique, has shown remarkable capabilities in synthesizing realistic instrument sounds. To further improve the reconstruction ability and pitch accuracy to enhance the editability of user-provided sound, we propose HyperGANStrument, which introduces a pitch-invariant hypernetwork to modulate the weights of a pre-trained GANStrument generator, given a one-shot sound as input. The hypernetwork modulation provides feedback for the generator in the reconstruction of the input sound. In addition, we take advantage of an adversarial fine-tuning scheme for the hypernetwork to improve the reconstruction fidelity and generation diversity of the generator. Experimental results show that the proposed model not only enhances the generation capability of GANStrument but also significantly improves the editability of synthesized sounds. Audio examples are available at the online demo page.",
    "path": "papers/24/01/2401.04558.json",
    "total_tokens": 830,
    "translated_title": "HyperGANStrument: 使用无关音高超网络的乐器音声合成和编辑",
    "translated_abstract": "GANStrument利用具有无关音高特征提取器和实例条件技术的GAN，在合成逼真的乐器声音方面显示出了显着的能力。为了进一步提高重构能力和音高准确性以增强用户提供声音的可编辑性，我们提出了HyperGANStrument，它引入了一个无关音高的超网络来调制预训练的GANStrument生成器的权重，给定一次性声音作为输入。超网络调制为生成器在重构输入声音方面提供了反馈。此外，我们利用对抗微调方案对超网络进行优化，以提高生成器的重构保真度和生成多样性。实验结果表明，所提出的模型不仅增强了GANStrument的生成能力，还显著提高了合成声音的可编辑性。在线演示页面提供音频示例。",
    "tldr": "本文介绍了HyperGANStrument方法，使用无关音高的超网络来调制预训练的GANStrument生成器，进一步提高了重构能力和音高准确性，增强了合成声音的可编辑性。",
    "en_tdlr": "This paper presents the HyperGANStrument method, using a pitch-invariant hypernetwork to modulate a pre-trained GANStrument generator, which improves the reconstruction ability and pitch accuracy, enhancing the editability of synthesized sounds."
}