{
    "title": "InstantID: Zero-shot Identity-Preserving Generation in Seconds",
    "abstract": "There has been significant progress in personalized image synthesis with methods such as Textual Inversion, DreamBooth, and LoRA. Yet, their real-world applicability is hindered by high storage demands, lengthy fine-tuning processes, and the need for multiple reference images. Conversely, existing ID embedding-based methods, while requiring only a single forward inference, face challenges: they either necessitate extensive fine-tuning across numerous model parameters, lack compatibility with community pre-trained models, or fail to maintain high face fidelity. Addressing these limitations, we introduce InstantID, a powerful diffusion model-based solution. Our plug-and-play module adeptly handles image personalization in various styles using just a single facial image, while ensuring high fidelity. To achieve this, we design a novel IdentityNet by imposing strong semantic and weak spatial conditions, integrating facial and landmark images with textual prompts to steer the image generati",
    "link": "https://rss.arxiv.org/abs/2401.07519",
    "context": "Title: InstantID: Zero-shot Identity-Preserving Generation in Seconds\nAbstract: There has been significant progress in personalized image synthesis with methods such as Textual Inversion, DreamBooth, and LoRA. Yet, their real-world applicability is hindered by high storage demands, lengthy fine-tuning processes, and the need for multiple reference images. Conversely, existing ID embedding-based methods, while requiring only a single forward inference, face challenges: they either necessitate extensive fine-tuning across numerous model parameters, lack compatibility with community pre-trained models, or fail to maintain high face fidelity. Addressing these limitations, we introduce InstantID, a powerful diffusion model-based solution. Our plug-and-play module adeptly handles image personalization in various styles using just a single facial image, while ensuring high fidelity. To achieve this, we design a novel IdentityNet by imposing strong semantic and weak spatial conditions, integrating facial and landmark images with textual prompts to steer the image generati",
    "path": "papers/24/01/2401.07519.json",
    "total_tokens": 823,
    "translated_title": "InstantID: 秒级零shot身份保留生成",
    "translated_abstract": "在个性化图像综合方面取得了重要进展，例如Textual Inversion，DreamBooth和LoRA等方法。然而，它们在实际应用中受到高存储需求、长时间的微调过程和需要多个参考图像的限制。相反，现有的基于身份嵌入的方法，虽然只需要单向前推论，但也面临一些挑战：它们要求进行大量的模型参数微调，与社区预训练模型不兼容，或者无法保持高面部保真度。为了解决这些限制，我们引入了InstantID，一种基于强散射模型的强大解决方案。我们的即插即用模块可以通过仅使用单张面部图像以多种风格来处理图像个性化，同时确保高保真度。为了实现这一目标，我们设计了一种新颖的IdentityNet，通过施加强语义和弱空间条件，将面部和地标图像与文本提示结合起来，以引导图像生成。",
    "tldr": "InstantID是一种基于强散射模型的即插即用模块，通过只使用一张面部图像实现图像的个性化处理，同时保持高保真度。",
    "en_tdlr": "InstantID is a plug-and-play module based on a powerful diffusion model, which achieves image personalization using just a single facial image while maintaining high fidelity."
}