{
    "title": "Local Diversity of Condorcet Domains. (arXiv:2401.11912v1 [econ.TH])",
    "abstract": "Several of the classical results in social choice theory demonstrate that in order for many voting systems to be well-behaved the set domain of individual preferences must satisfy some kind of restriction, such as being single-peaked on a political axis. As a consequence it becomes interesting to measure how diverse the preferences in a well-behaved domain can be.  In this paper we introduce an egalitarian approach to measuring preference diversity, focusing on the abundance of distinct suborders one subsets of the alternative. We provide a common generalisation of the frequently used concepts of ampleness and copiousness.  We give a detailed investigation of the abundance for Condorcet domains. Our theorems imply a ceiling for the local diversity in domains on large sets of alternatives, which show that in this measure Black's single-peaked domain is in fact optimal. We also demonstrate that for some numbers of alternatives, there are Condorcet domains which have largest local diversi",
    "link": "http://arxiv.org/abs/2401.11912",
    "context": "Title: Local Diversity of Condorcet Domains. (arXiv:2401.11912v1 [econ.TH])\nAbstract: Several of the classical results in social choice theory demonstrate that in order for many voting systems to be well-behaved the set domain of individual preferences must satisfy some kind of restriction, such as being single-peaked on a political axis. As a consequence it becomes interesting to measure how diverse the preferences in a well-behaved domain can be.  In this paper we introduce an egalitarian approach to measuring preference diversity, focusing on the abundance of distinct suborders one subsets of the alternative. We provide a common generalisation of the frequently used concepts of ampleness and copiousness.  We give a detailed investigation of the abundance for Condorcet domains. Our theorems imply a ceiling for the local diversity in domains on large sets of alternatives, which show that in this measure Black's single-peaked domain is in fact optimal. We also demonstrate that for some numbers of alternatives, there are Condorcet domains which have largest local diversi",
    "path": "papers/24/01/2401.11912.json",
    "total_tokens": 868,
    "translated_title": "Condorcet域的本地多样性",
    "translated_abstract": "社会选择理论中的一些经典结果表明，为了使许多投票系统具有良好的行为，个体偏好的域集必须满足某种限制，比如在政治轴上是单峰的。因此，衡量良好行为域中偏好的多样性变得有趣。在本文中，我们引入了一种平等的方法来衡量偏好的多样性，重点是候选项子集中不同子序列的丰富程度。我们提供了广泛使用的丰满性和充足性概念的常见概括。我们对Condorcet域的丰度进行了详细研究。我们的定理表明，在大型备选集域中的本地多样性有一个上限，这表明在这个度量中，Black的单峰域实际上是最优的。我们还证明了对于某些备选项数量，存在具有最大本地多样性的Condorcet域。",
    "tldr": "本文介绍了衡量偏好多样性的一种新方法，在Condorcet域上进行了详细研究，证明了在大型备选集域中的本地多样性有一个上限，并发现Black的单峰域是最优的。",
    "en_tdlr": "This paper introduces a new method for measuring preference diversity and provides a detailed investigation on Condorcet domains, demonstrating a ceiling for local diversity in large sets of alternatives and showing that Black's single-peaked domain is optimal."
}