{
    "title": "In the Aftermath of Oil Prices Fall of 2014/2015-Socioeconomic Facts and Changes in the Public Policies in the Sultanate of Oman. (arXiv:2401.13688v1 [econ.GN])",
    "abstract": "Since the start of its national renaissance in 1970, the Sultanate of Oman (Oman) has gone over a major development in several areas, such as education, infrastructure, and urbanization. This has been powered by the revenues from exporting crude oil and natural gas, which together form the skeleton of the country's economy. In the second half of 2014, the oil prices declined strongly to about 50% of its price. This was followed by another moderate decline in the second half of 2015 and the beginning of 2016, leaving the barrel price at a low level below 30 US$ in January 2016 (as compared to above 110 US$ in June 2014). This drop had direct impacts on the economy of Oman, manifested in a large budget deficit, reduced governmental expenditure, reduced or cancelled subsidy of fuels and electricity, increase in the water tariff, and decline in deposits in banks. The country is coping with this through its 9th five-year plan (2016-2020), which adopts a strategy of diversifying the income a",
    "link": "http://arxiv.org/abs/2401.13688",
    "context": "Title: In the Aftermath of Oil Prices Fall of 2014/2015-Socioeconomic Facts and Changes in the Public Policies in the Sultanate of Oman. (arXiv:2401.13688v1 [econ.GN])\nAbstract: Since the start of its national renaissance in 1970, the Sultanate of Oman (Oman) has gone over a major development in several areas, such as education, infrastructure, and urbanization. This has been powered by the revenues from exporting crude oil and natural gas, which together form the skeleton of the country's economy. In the second half of 2014, the oil prices declined strongly to about 50% of its price. This was followed by another moderate decline in the second half of 2015 and the beginning of 2016, leaving the barrel price at a low level below 30 US$ in January 2016 (as compared to above 110 US$ in June 2014). This drop had direct impacts on the economy of Oman, manifested in a large budget deficit, reduced governmental expenditure, reduced or cancelled subsidy of fuels and electricity, increase in the water tariff, and decline in deposits in banks. The country is coping with this through its 9th five-year plan (2016-2020), which adopts a strategy of diversifying the income a",
    "path": "papers/24/01/2401.13688.json",
    "total_tokens": 1055,
    "translated_title": "2014/2015年油价下跌对阿曼苏丹国的社会经济事实和公共政策变化的影响",
    "translated_abstract": "自1970年开始国家复兴以来，阿曼苏丹国在教育、基础设施和城市化等领域取得了重大发展，这得益于出口原油和天然气所带来的收入，这两者构成了该国经济的支柱。2014年下半年，油价大幅下跌至原价的50%左右。接着在2015年下半年和2016年初又出现了适度下降，使得桶价在2016年1月降至30美元以下（相比于2014年6月的110美元以上）。此次下跌对阿曼经济产生了直接影响，表现为巨额预算赤字、政府支出减少、燃料和电力补贴减少或取消、水费增加以及银行存款下降。阿曼通过其九个五年计划（2016年至2020年）来应对这一问题，该计划采取了多元化收入的战略。",
    "tldr": "2014/2015年油价下跌对阿曼苏丹国的经济产生了直接影响，表现为预算赤字、减少政府支出、取消或减少燃料和电力补贴、增加水费和降低银行存款。阿曼通过其九个五年计划（2016年至2020年）来实施多元化收入的战略。"
}