{
    "title": "AntEval: Quantitatively Evaluating Informativeness and Expressiveness of Agent Social Interactions. (arXiv:2401.06509v1 [cs.CL])",
    "abstract": "While Large Language Models (LLMs) based agents have successfully mimicked human behaviors in various scenarios, the realm of complex, multi-character social interactions within extended contexts remains underexplored. The challenge is compounded by privacy concerns, making it difficult to capture and utilize intricate real-life interactions. More importantly, the absence of quantitative evaluation methods hampers the pursuit of high-quality agent interactions, often leading to interactions that are limited in informativeness and expressiveness, characterized by superficial small talk without clear intentions. In this work, we leverage the rules of Tabletop Role-Playing Games (TRPG) to create an environment conducive to complex, context-rich interactions, emphasizing informativeness and expressiveness. This virtual setting alleviates privacy concerns and motivates agents to engage in meaningful, high-quality interactions as part of their in-game objectives. To assess these interactions",
    "link": "http://arxiv.org/abs/2401.06509",
    "context": "Title: AntEval: Quantitatively Evaluating Informativeness and Expressiveness of Agent Social Interactions. (arXiv:2401.06509v1 [cs.CL])\nAbstract: While Large Language Models (LLMs) based agents have successfully mimicked human behaviors in various scenarios, the realm of complex, multi-character social interactions within extended contexts remains underexplored. The challenge is compounded by privacy concerns, making it difficult to capture and utilize intricate real-life interactions. More importantly, the absence of quantitative evaluation methods hampers the pursuit of high-quality agent interactions, often leading to interactions that are limited in informativeness and expressiveness, characterized by superficial small talk without clear intentions. In this work, we leverage the rules of Tabletop Role-Playing Games (TRPG) to create an environment conducive to complex, context-rich interactions, emphasizing informativeness and expressiveness. This virtual setting alleviates privacy concerns and motivates agents to engage in meaningful, high-quality interactions as part of their in-game objectives. To assess these interactions",
    "path": "papers/24/01/2401.06509.json",
    "total_tokens": 903,
    "translated_title": "AntEval: 量化评估智能体社交互动的信息性和表达性",
    "translated_abstract": "尽管基于大型语言模型（LLM）的智能体已成功地模仿了各种情境中的人类行为，但复杂的、多角色社交互动在扩展环境中的领域仍未充分探索。隐私问题使捕捉和利用复杂的现实生活互动变得困难。更重要的是，缺乏定量评估方法阻碍了高质量智能体互动的追求，导致互动的信息性和表达性有限，表现为肤浅的闲聊而没有清晰的意图。在这项工作中，我们利用桌面角色扮演游戏（TRPG）的规则创建了一个有利于复杂、上下文丰富的互动的环境，强调信息性和表达性。这个虚拟环境减轻了隐私问题，并激励智能体作为游戏目标的一部分进行有意义的、高质量的互动。",
    "tldr": "本研究通过使用桌面角色扮演游戏规则创建了一个环境，量化评估智能体社交互动的信息性和表达性，旨在克服隐私问题并促使智能体进行有意义、高质量的互动。",
    "en_tdlr": "This paper presents AntEval, a method for quantitatively evaluating the informativeness and expressiveness of agent social interactions. By leveraging tabletop role-playing game rules, it creates an environment conducive to complex, context-rich interactions, addressing the challenges of privacy concerns and limited quality in agent interactions."
}