{
    "title": "Causal Machine Learning for Moderation Effects. (arXiv:2401.08290v1 [econ.EM])",
    "abstract": "It is valuable for any decision maker to know the impact of decisions (treatments) on average and for subgroups. The causal machine learning literature has recently provided tools for estimating group average treatment effects (GATE) to understand treatment heterogeneity better. This paper addresses the challenge of interpreting such differences in treatment effects between groups while accounting for variations in other covariates. We propose a new parameter, the balanced group average treatment effect (BGATE), which measures a GATE with a specific distribution of a priori-determined covariates. By taking the difference of two BGATEs, we can analyse heterogeneity more meaningfully than by comparing two GATEs. The estimation strategy for this parameter is based on double/debiased machine learning for discrete treatments in an unconfoundedness setting, and the estimator is shown to be $\\sqrt{N}$-consistent and asymptotically normal under standard conditions. Adding additional identifyin",
    "link": "http://arxiv.org/abs/2401.08290",
    "context": "Title: Causal Machine Learning for Moderation Effects. (arXiv:2401.08290v1 [econ.EM])\nAbstract: It is valuable for any decision maker to know the impact of decisions (treatments) on average and for subgroups. The causal machine learning literature has recently provided tools for estimating group average treatment effects (GATE) to understand treatment heterogeneity better. This paper addresses the challenge of interpreting such differences in treatment effects between groups while accounting for variations in other covariates. We propose a new parameter, the balanced group average treatment effect (BGATE), which measures a GATE with a specific distribution of a priori-determined covariates. By taking the difference of two BGATEs, we can analyse heterogeneity more meaningfully than by comparing two GATEs. The estimation strategy for this parameter is based on double/debiased machine learning for discrete treatments in an unconfoundedness setting, and the estimator is shown to be $\\sqrt{N}$-consistent and asymptotically normal under standard conditions. Adding additional identifyin",
    "path": "papers/24/01/2401.08290.json",
    "total_tokens": 921,
    "translated_title": "因果机器学习用于中介效应。 (arXiv:2401.08290v1 [econ.EM])",
    "translated_abstract": "对于任何决策者来说，了解决策（处理）对整体和子群的影响是非常有价值的。因果机器学习最近提供了用于估计群体平均处理效应（GATE）的工具，以更好地理解处理的异质性。本文解决了在考虑其他协变量变化的情况下解释群体间处理效应差异的难题。我们提出了一个新的参数，即平衡群体平均处理效应（BGATE），它衡量了具有特定分布的先验确定协变量的GATE。通过比较两个BGATE的差异，我们可以更有意义地分析异质性，而不仅仅比较两个GATE。这个参数的估计策略是基于无混淆设置中离散处理的双重/去偏机器学习，该估计量在标准条件下表现为$\\sqrt{N}$一致性和渐近正态性。添加额外的标识",
    "tldr": "本文提出了一种新的参数，平衡群体平均处理效应（BGATE），用于解释处理在群体间的效应差异，该参数基于因果机器学习方法，对离散处理进行估计。通过比较两个BGATE的差异，能更好地分析处理的异质性。",
    "en_tdlr": "This paper proposes a new parameter, the balanced group average treatment effect (BGATE), to explain differences in treatment effects between groups using causal machine learning. By comparing the differences of two BGATEs, heterogeneity in treatment effects can be analyzed more effectively."
}