{
    "title": "Economic Forces in Stock Returns. (arXiv:2401.04132v1 [econ.GN])",
    "abstract": "When analyzing the components influencing the stock prices, it is commonly believed that economic activities play an important role. More specifically, asset prices are more sensitive to the systematic economic news that impose a pervasive effect on the whole market. Moreover, the investors will not be rewarded for bearing idiosyncratic risks as such risks are diversifiable. In the paper Economic Forces and the Stock Market 1986, the authors introduced an attribution model to identify the specific systematic economic forces influencing the market. They first defined and examined five classic factors from previous research papers: Industrial Production, Unanticipated Inflation, Change in Expected Inflation, Risk Premia, and The Term Structure. By adding in new factors, the Market Indices, Consumptions and Oil Prices, one by one, they examined the significant contribution of each factor to the stock return. The paper concluded that the stock returns are exposed to the systematic economic",
    "link": "http://arxiv.org/abs/2401.04132",
    "context": "Title: Economic Forces in Stock Returns. (arXiv:2401.04132v1 [econ.GN])\nAbstract: When analyzing the components influencing the stock prices, it is commonly believed that economic activities play an important role. More specifically, asset prices are more sensitive to the systematic economic news that impose a pervasive effect on the whole market. Moreover, the investors will not be rewarded for bearing idiosyncratic risks as such risks are diversifiable. In the paper Economic Forces and the Stock Market 1986, the authors introduced an attribution model to identify the specific systematic economic forces influencing the market. They first defined and examined five classic factors from previous research papers: Industrial Production, Unanticipated Inflation, Change in Expected Inflation, Risk Premia, and The Term Structure. By adding in new factors, the Market Indices, Consumptions and Oil Prices, one by one, they examined the significant contribution of each factor to the stock return. The paper concluded that the stock returns are exposed to the systematic economic",
    "path": "papers/24/01/2401.04132.json",
    "total_tokens": 872,
    "translated_title": "股票回报中的经济因素",
    "translated_abstract": "在分析影响股票价格的因素时，普遍认为经济活动起着重要作用。具体而言，资产价格更敏感于对整个市场产生普遍影响的系统性经济新闻。此外，投资者在承担特异风险时不会得到回报，因为这些风险是可以通过分散投资来消除的。在论文《经济力量和股市1986》中，作者引入了一个归因模型来识别影响市场的具体系统性经济力量。他们首先从先前的研究论文中定义和检验了五个经典因素：工业生产、预期外因通胀、预期内因通胀变化、风险溢酬和期限结构。通过逐一添加新的因素，市场指数、消费和石油价格，他们研究了每个因素对股票回报的重要贡献。该论文得出结论：股票回报暴露于系统性经济力量。",
    "tldr": "该论文研究了股票回报中的系统性经济力量，并通过归因模型分析了工业生产、通胀变化、风险溢酬、期限结构等因素对股票回报的重要贡献。",
    "en_tdlr": "This paper examines the systematic economic forces in stock returns and analyzes the significant contributions of factors such as industrial production, inflation changes, risk premia, and the term structure using an attribution model."
}