{
    "title": "Empowering Machines to Think Like Chemists: Unveiling Molecular Structure-Polarity Relationships with Hierarchical Symbolic Regression. (arXiv:2401.13904v1 [cs.LG])",
    "abstract": "Thin-layer chromatography (TLC) is a crucial technique in molecular polarity analysis. Despite its importance, the interpretability of predictive models for TLC, especially those driven by artificial intelligence, remains a challenge. Current approaches, utilizing either high-dimensional molecular fingerprints or domain-knowledge-driven feature engineering, often face a dilemma between expressiveness and interpretability. To bridge this gap, we introduce Unsupervised Hierarchical Symbolic Regression (UHiSR), combining hierarchical neural networks and symbolic regression. UHiSR automatically distills chemical-intuitive polarity indices, and discovers interpretable equations that link molecular structure to chromatographic behavior.",
    "link": "http://arxiv.org/abs/2401.13904",
    "context": "Title: Empowering Machines to Think Like Chemists: Unveiling Molecular Structure-Polarity Relationships with Hierarchical Symbolic Regression. (arXiv:2401.13904v1 [cs.LG])\nAbstract: Thin-layer chromatography (TLC) is a crucial technique in molecular polarity analysis. Despite its importance, the interpretability of predictive models for TLC, especially those driven by artificial intelligence, remains a challenge. Current approaches, utilizing either high-dimensional molecular fingerprints or domain-knowledge-driven feature engineering, often face a dilemma between expressiveness and interpretability. To bridge this gap, we introduce Unsupervised Hierarchical Symbolic Regression (UHiSR), combining hierarchical neural networks and symbolic regression. UHiSR automatically distills chemical-intuitive polarity indices, and discovers interpretable equations that link molecular structure to chromatographic behavior.",
    "path": "papers/24/01/2401.13904.json",
    "total_tokens": 798,
    "translated_title": "赋予机器像化学家一样思考的能力：用层次符号回归揭示分子结构极性关系",
    "translated_abstract": "薄层色谱法(TLC)是分子极性分析中至关重要的技术。尽管其重要性，对于TLC的预测模型，尤其是那些由人工智能驱动的模型的可解释性仍然面临挑战。当前的方法要么利用高维分子指纹，要么利用基于领域知识的特征工程，经常面临表达能力和可解释性之间的两难选择。为了弥合这一差距，我们介绍了无监督的层次符号回归(UHiSR)方法，结合了层次神经网络和符号回归。UHiSR自动提取化学直观的极性指数，并发现将分子结构与色谱行为联系起来的可解释方程。",
    "tldr": "本论文介绍了一种无监督的层次符号回归方法(UHiSR)，通过结合层次神经网络和符号回归，实现了自动提取化学直观的极性指数，并发现了将分子结构与色谱行为联系起来的可解释方程。",
    "en_tdlr": "This paper introduces an unsupervised hierarchical symbolic regression method (UHiSR) that automatically extracts chemically intuitive polarity indices and discovers interpretable equations linking molecular structure to chromatographic behavior."
}