{
    "title": "Deconstructing Denoising Diffusion Models for Self-Supervised Learning. (arXiv:2401.14404v1 [cs.CV])",
    "abstract": "In this study, we examine the representation learning abilities of Denoising Diffusion Models (DDM) that were originally purposed for image generation. Our philosophy is to deconstruct a DDM, gradually transforming it into a classical Denoising Autoencoder (DAE). This deconstructive procedure allows us to explore how various components of modern DDMs influence self-supervised representation learning. We observe that only a very few modern components are critical for learning good representations, while many others are nonessential. Our study ultimately arrives at an approach that is highly simplified and to a large extent resembles a classical DAE. We hope our study will rekindle interest in a family of classical methods within the realm of modern self-supervised learning.",
    "link": "http://arxiv.org/abs/2401.14404",
    "context": "Title: Deconstructing Denoising Diffusion Models for Self-Supervised Learning. (arXiv:2401.14404v1 [cs.CV])\nAbstract: In this study, we examine the representation learning abilities of Denoising Diffusion Models (DDM) that were originally purposed for image generation. Our philosophy is to deconstruct a DDM, gradually transforming it into a classical Denoising Autoencoder (DAE). This deconstructive procedure allows us to explore how various components of modern DDMs influence self-supervised representation learning. We observe that only a very few modern components are critical for learning good representations, while many others are nonessential. Our study ultimately arrives at an approach that is highly simplified and to a large extent resembles a classical DAE. We hope our study will rekindle interest in a family of classical methods within the realm of modern self-supervised learning.",
    "path": "papers/24/01/2401.14404.json",
    "total_tokens": 930,
    "translated_title": "解构去噪扩散模型用于自监督学习",
    "translated_abstract": "在这项研究中，我们研究了最初用于图像生成的去噪扩散模型（DDM）的表示学习能力。我们的理念是逐步地解构DDM，将其转化为经典的去噪自编码器（DAE）。这种解构过程允许我们探索现代DDM的各个组件如何影响自监督表示学习。我们观察到，只有很少的现代组件对于学习良好的表示是至关重要的，而其他许多组件则是非必要的。我们的研究最终提出了一种高度简化且在很大程度上类似于经典DAE的方法。我们希望我们的研究能重新引起人们对现代自监督学习领域中一类经典方法的兴趣。",
    "tldr": "本研究对最初用于图像生成的去噪扩散模型（DDM）进行了解构，发现只有很少的现代组件对于学习良好的表示是至关重要的。通过将DDM逐步转化为经典的去噪自编码器（DAE），我们提出了一种高度简化且类似于经典DAE的方法。该研究希望重新引起人们对现代自监督学习领域中经典方法的兴趣。",
    "en_tdlr": "In this study, we deconstruct Denoising Diffusion Models (DDMs) originally designed for image generation and find that only a few modern components are critical to learning good representations. By gradually transforming DDMs into classical Denoising Autoencoders (DAEs), we propose a simplified approach that resembles classical DAEs. Our study aims to rekindle interest in classical methods in the field of modern self-supervised learning."
}