{
    "title": "Structured factor copulas for modeling the systemic risk of European and United States banks. (arXiv:2401.03443v1 [q-fin.ST])",
    "abstract": "In this paper, we employ Credit Default Swaps (CDS) to model the joint and conditional distress probabilities of banks in Europe and the U.S. using factor copulas. We propose multi-factor, structured factor, and factor-vine models where the banks in the sample are clustered according to their geographic location. We find that within each region, the co-dependence between banks is best described using both, systematic and idiosyncratic, financial contagion channels. However, if we consider the banking system as a whole, then the systematic contagion channel prevails, meaning that the distress probabilities are driven by a latent global factor and region-specific factors. In all cases, the co-dependence structure of bank CDS spreads is highly correlated in the tail. The out-of-sample forecasts of several measures of systematic risk allow us to identify the periods of distress in the banking sector over the recent years including the COVID-19 pandemic, the interest rate hikes in 2022, and",
    "link": "http://arxiv.org/abs/2401.03443",
    "context": "Title: Structured factor copulas for modeling the systemic risk of European and United States banks. (arXiv:2401.03443v1 [q-fin.ST])\nAbstract: In this paper, we employ Credit Default Swaps (CDS) to model the joint and conditional distress probabilities of banks in Europe and the U.S. using factor copulas. We propose multi-factor, structured factor, and factor-vine models where the banks in the sample are clustered according to their geographic location. We find that within each region, the co-dependence between banks is best described using both, systematic and idiosyncratic, financial contagion channels. However, if we consider the banking system as a whole, then the systematic contagion channel prevails, meaning that the distress probabilities are driven by a latent global factor and region-specific factors. In all cases, the co-dependence structure of bank CDS spreads is highly correlated in the tail. The out-of-sample forecasts of several measures of systematic risk allow us to identify the periods of distress in the banking sector over the recent years including the COVID-19 pandemic, the interest rate hikes in 2022, and",
    "path": "papers/24/01/2401.03443.json",
    "total_tokens": 1096,
    "translated_title": "结构化因子联合分布用于建模欧洲和美国银行系统性风险",
    "translated_abstract": "本文利用信用违约互换(CDS)来模拟欧洲和美国银行的联合和条件困境概率，并使用因子联合分布进行建模。我们提出了多因素，结构化因子和因子藤蔓模型，其中样本中的银行按地理位置进行了聚类。我们发现，在每个地区内，银行之间的相互依赖关系最好使用系统性和特异性的金融传染渠道来描述。然而，如果将银行系统作为一个整体考虑，那么系统性传染渠道占优势，这意味着困境概率是由潜在的全球因子和区域特定因子驱动的。在所有情况下，银行CDS差价的相互依赖结构在尾部高度相关。对一些系统性风险指标的样本外预测使我们能够确定近年来银行业中出现困境的时期，包括COVID-19大流行，2022年的利率上调等等。",
    "tldr": "本文使用结构化因子联合分布模拟了欧洲和美国银行的系统性风险，并发现在不同地区内部银行之间的相互依赖主要通过系统性与特异性的金融传染渠道来驱动，在整个银行系统中，系统性传染渠道占主导地位。此外，银行CDS差价的相互依赖结构在尾部也高度相关。通过样本外预测，可以识别出近年来银行业困境的时期，包括COVID-19大流行和2022年的利率上调等。",
    "en_tdlr": "This paper uses structured factor copulas to model the systemic risk of European and United States banks. It finds that within each region, the co-dependence between banks is driven by both systematic and idiosyncratic financial contagion channels, but at the global level, the systematic contagion channel prevails. The co-dependence structure of bank CDS spreads is highly correlated in the tail. Out-of-sample forecasts identify distress periods in the banking sector, including the COVID-19 pandemic and interest rate hikes in 2022."
}