{
    "title": "Air Quality Forecasting Using Machine Learning: A Global perspective with Relevance to Low-Resource Settings. (arXiv:2401.04369v1 [cs.LG])",
    "abstract": "Air pollution stands as the fourth leading cause of death globally. While extensive research has been conducted in this domain, most approaches rely on large datasets when it comes to prediction. This limits their applicability in low-resource settings though more vulnerable. This study addresses this gap by proposing a novel machine learning approach for accurate air quality prediction using two months of air quality data. By leveraging the World Weather Repository, the meteorological, air pollutant, and Air Quality Index features from 197 capital cities were considered to predict air quality for the next day. The evaluation of several machine learning models demonstrates the effectiveness of the Random Forest algorithm in generating reliable predictions, particularly when applied to classification rather than regression, approach which enhances the model's generalizability by 42%, achieving a cross-validation score of 0.38 for regression and 0.89 for classification. To instill confid",
    "link": "http://arxiv.org/abs/2401.04369",
    "context": "Title: Air Quality Forecasting Using Machine Learning: A Global perspective with Relevance to Low-Resource Settings. (arXiv:2401.04369v1 [cs.LG])\nAbstract: Air pollution stands as the fourth leading cause of death globally. While extensive research has been conducted in this domain, most approaches rely on large datasets when it comes to prediction. This limits their applicability in low-resource settings though more vulnerable. This study addresses this gap by proposing a novel machine learning approach for accurate air quality prediction using two months of air quality data. By leveraging the World Weather Repository, the meteorological, air pollutant, and Air Quality Index features from 197 capital cities were considered to predict air quality for the next day. The evaluation of several machine learning models demonstrates the effectiveness of the Random Forest algorithm in generating reliable predictions, particularly when applied to classification rather than regression, approach which enhances the model's generalizability by 42%, achieving a cross-validation score of 0.38 for regression and 0.89 for classification. To instill confid",
    "path": "papers/24/01/2401.04369.json",
    "total_tokens": 993,
    "translated_title": "使用机器学习的空气质量预报：具有针对低资源环境的全球视角",
    "translated_abstract": "空气污染是全球第四大死因。虽然在这个领域已经进行了大量的研究，但大多数方法在预测时依赖于大型数据集。这限制了它们在低资源环境中的适用性，而这样的环境更加脆弱。本研究通过提出一种新的机器学习方法来准确预测空气质量，解决了这个问题。通过利用世界天气存储库，考虑了来自197个首都城市的气象、空气污染物和空气质量指数数据，预测了未来一天的空气质量。多个机器学习模型的评估证明了随机森林算法在生成可靠预测方面的有效性，特别是在应用于分类而不是回归时，该方法提高了模型的泛化能力42%，实现了回归0.38和分类0.89的交叉验证分数。",
    "tldr": "本研究提出了一种新的机器学习方法，利用少量的空气质量数据来准确预测空气质量。通过使用世界天气存储库的数据，考虑了来自197个首都城市的气象、空气污染物和空气质量指数特征，实现了可靠的预测。随机森林算法在分类方面表现最好，提高了模型的泛化能力。极大地提升了低资源环境下空气质量预测的适用性。",
    "en_tdlr": "This study proposes a novel machine learning approach for accurate air quality prediction using limited air quality data. By leveraging data from the World Weather Repository, the study demonstrates the effectiveness of the Random Forest algorithm in generating reliable predictions, particularly in low-resource settings."
}