{
    "title": "DocFinQA: A Long-Context Financial Reasoning Dataset",
    "abstract": "arXiv:2401.06915v2 Announce Type: replace-cross  Abstract: For large language models (LLMs) to be effective in the financial domain -- where each decision can have a significant impact -- it is necessary to investigate realistic tasks and data. Financial professionals often interact with documents that are hundreds of pages long, but most financial research datasets only deal with short excerpts from these documents. To address this, we introduce a long-document financial QA task. We augment 7,437 questions from the existing FinQA dataset with the full-document context, extending the average context length from under 700 words in FinQA to 123k words in DocFinQA. We conduct extensive experiments over retrieval-based QA pipelines and long-context language models. DocFinQA proves a significant challenge for even state-of-the-art systems. We also provide a case-study on the longest documents in DocFinQA and find that models particularly struggle on these documents. Addressing these challen",
    "link": "https://arxiv.org/abs/2401.06915",
    "context": "Title: DocFinQA: A Long-Context Financial Reasoning Dataset\nAbstract: arXiv:2401.06915v2 Announce Type: replace-cross  Abstract: For large language models (LLMs) to be effective in the financial domain -- where each decision can have a significant impact -- it is necessary to investigate realistic tasks and data. Financial professionals often interact with documents that are hundreds of pages long, but most financial research datasets only deal with short excerpts from these documents. To address this, we introduce a long-document financial QA task. We augment 7,437 questions from the existing FinQA dataset with the full-document context, extending the average context length from under 700 words in FinQA to 123k words in DocFinQA. We conduct extensive experiments over retrieval-based QA pipelines and long-context language models. DocFinQA proves a significant challenge for even state-of-the-art systems. We also provide a case-study on the longest documents in DocFinQA and find that models particularly struggle on these documents. Addressing these challen",
    "path": "papers/24/01/2401.06915.json",
    "total_tokens": 841,
    "translated_title": "DocFinQA：一个长文本财务推理数据集",
    "translated_abstract": "对于大型语言模型（LLMs）在金融领域发挥作用，需要研究现实任务和数据。金融专业人士经常与长达数百页的文档进行交互，但大多数金融研究数据集仅处理这些文档的简短摘录。为了解决这个问题，我们引入了一个长文档财务问答任务。我们通过在现有FinQA数据集中的7,437个问题中增加完整文档上下文，将FinQA中平均上下文长度从不到700个词扩展到DocFinQA中的123k个词。我们在检索式QA管道和长文本语言模型上进行了大量实验。即使对于最先进的系统，DocFinQA也是一个巨大挑战。我们还对DocFinQA中最长文档进行了案例研究，并发现模型在这些文档上特别困难。解决这些挑战。",
    "tldr": "引入了一个长文档财务问答任务，将平均上下文长度从700个词扩展到123k个词，对于大型语言模型在金融领域具有重要挑战。",
    "en_tdlr": "Introduced a long-document financial QA task, extending the average context length from 700 words to 123k words, posing significant challenges for large language models in the financial domain."
}