{
    "title": "ICMC-ASR: The ICASSP 2024 In-Car Multi-Channel Automatic Speech Recognition Challenge. (arXiv:2401.03473v2 [cs.SD] UPDATED)",
    "abstract": "To promote speech processing and recognition research in driving scenarios, we build on the success of the Intelligent Cockpit Speech Recognition Challenge (ICSRC) held at ISCSLP 2022 and launch the ICASSP 2024 In-Car Multi-Channel Automatic Speech Recognition (ICMC-ASR) Challenge. This challenge collects over 100 hours of multi-channel speech data recorded inside a new energy vehicle and 40 hours of noise for data augmentation. Two tracks, including automatic speech recognition (ASR) and automatic speech diarization and recognition (ASDR) are set up, using character error rate (CER) and concatenated minimum permutation character error rate (cpCER) as evaluation metrics, respectively. Overall, the ICMC-ASR Challenge attracts 98 participating teams and receives 53 valid results in both tracks. In the end, first-place team USTCiflytek achieves a CER of 13.16% in the ASR track and a cpCER of 21.48% in the ASDR track, showing an absolute improvement of 13.08% and 51.4% compared to our chal",
    "link": "http://arxiv.org/abs/2401.03473",
    "context": "Title: ICMC-ASR: The ICASSP 2024 In-Car Multi-Channel Automatic Speech Recognition Challenge. (arXiv:2401.03473v2 [cs.SD] UPDATED)\nAbstract: To promote speech processing and recognition research in driving scenarios, we build on the success of the Intelligent Cockpit Speech Recognition Challenge (ICSRC) held at ISCSLP 2022 and launch the ICASSP 2024 In-Car Multi-Channel Automatic Speech Recognition (ICMC-ASR) Challenge. This challenge collects over 100 hours of multi-channel speech data recorded inside a new energy vehicle and 40 hours of noise for data augmentation. Two tracks, including automatic speech recognition (ASR) and automatic speech diarization and recognition (ASDR) are set up, using character error rate (CER) and concatenated minimum permutation character error rate (cpCER) as evaluation metrics, respectively. Overall, the ICMC-ASR Challenge attracts 98 participating teams and receives 53 valid results in both tracks. In the end, first-place team USTCiflytek achieves a CER of 13.16% in the ASR track and a cpCER of 21.48% in the ASDR track, showing an absolute improvement of 13.08% and 51.4% compared to our chal",
    "path": "papers/24/01/2401.03473.json",
    "total_tokens": 1114,
    "translated_title": "ICMC-ASR：ICASSP 2024年汽车多通道自动语音识别挑战赛",
    "translated_abstract": "为了促进驾驶场景下的语音处理和识别研究，我们基于ISCSLP 2022年度举办的智能座舱语音识别挑战赛（ICSRC）的成功经验，推出了ICASSP 2024年汽车多通道自动语音识别（ICMC-ASR）挑战赛。该挑战收集了100多小时的新能源汽车内部多通道语音数据以及40小时的噪声进行数据增强。设立了自动语音识别（ASR）和自动语音分离和识别（ASDR）两个赛道，并分别使用字符错误率（CER）和连接最小置换字符错误率（cpCER）作为评估指标。总体上，ICMC-ASR挑战赛吸引了98支参赛队伍，并在两个赛道上收到了53个有效结果。最终，USTCiflytek队在ASR赛道上实现了13.16%的CER，在ASDR赛道上实现了21.48%的cpCER，分别相对于我们挑战赛准则的绝对改善率为13.08%和51.4%。",
    "tldr": "ICMC-ASR挑战赛是为了促进驾驶场景下的语音处理和识别研究而举办的，包括自动语音识别（ASR）和自动语音分离和识别（ASDR）两个赛道，取得了显著的改善。最终，USTCiflytek队在ASR赛道上获得了13.16%的CER，ASDR赛道上获得了21.48%的cpCER。",
    "en_tdlr": "The ICMC-ASR Challenge, aimed at promoting speech processing and recognition research in driving scenarios, includes two tracks: automatic speech recognition (ASR) and automatic speech diarization and recognition (ASDR). It achieved significant improvements, with the first-place team USTCiflytek achieving a CER of 13.16% in the ASR track and a cpCER of 21.48% in the ASDR track."
}