{
    "title": "Detection and Recovery Against Deep Neural Network Fault Injection Attacks Based on Contrastive Learning. (arXiv:2401.16766v1 [cs.LG])",
    "abstract": "Deep Neural Network (DNN) models when implemented on executing devices as the inference engines are susceptible to Fault Injection Attacks (FIAs) that manipulate model parameters to disrupt inference execution with disastrous performance. This work introduces Contrastive Learning (CL) of visual representations i.e., a self-supervised learning approach into the deep learning training and inference pipeline to implement DNN inference engines with self-resilience under FIAs. Our proposed CL based FIA Detection and Recovery (CFDR) framework features (i) real-time detection with only a single batch of testing data and (ii) fast recovery effective even with only a small amount of unlabeled testing data. Evaluated with the CIFAR-10 dataset on multiple types of FIAs, our CFDR shows promising detection and recovery effectiveness.",
    "link": "http://arxiv.org/abs/2401.16766",
    "context": "Title: Detection and Recovery Against Deep Neural Network Fault Injection Attacks Based on Contrastive Learning. (arXiv:2401.16766v1 [cs.LG])\nAbstract: Deep Neural Network (DNN) models when implemented on executing devices as the inference engines are susceptible to Fault Injection Attacks (FIAs) that manipulate model parameters to disrupt inference execution with disastrous performance. This work introduces Contrastive Learning (CL) of visual representations i.e., a self-supervised learning approach into the deep learning training and inference pipeline to implement DNN inference engines with self-resilience under FIAs. Our proposed CL based FIA Detection and Recovery (CFDR) framework features (i) real-time detection with only a single batch of testing data and (ii) fast recovery effective even with only a small amount of unlabeled testing data. Evaluated with the CIFAR-10 dataset on multiple types of FIAs, our CFDR shows promising detection and recovery effectiveness.",
    "path": "papers/24/01/2401.16766.json",
    "total_tokens": 870,
    "translated_title": "基于对比学习的深度神经网络故障注入攻击检测和恢复",
    "translated_abstract": "深度神经网络在执行设备上作为推理引擎实施时容易受到故障注入攻击，这些攻击操纵模型参数以破坏推理执行的性能。本文将对比学习应用于深度学习的训练和推理流程中，以实现具有自适应能力的深度神经网络推理引擎，以应对故障注入攻击。我们提出的基于对比学习的故障注入攻击检测和恢复（CFDR）框架具有以下特点：（i）仅需一个批次的测试数据进行实时检测，（ii）即使仅有少量无标签测试数据，也能实现快速的恢复效果。在CIFAR-10数据集上对多种类型的故障注入攻击进行评估，我们的CFDR展现出了良好的检测和恢复效果。",
    "tldr": "本文提出了一个基于对比学习的深度神经网络故障注入攻击检测和恢复框架（CFDR），通过将对比学习应用于训练和推理流程中，实现了具有自适应能力的深度神经网络推理引擎，在只有一个批次的测试数据和少量无标签测试数据的情况下，能够实时检测并快速恢复多种类型的故障注入攻击。"
}