{
    "title": "Balanced Graph Structure Information for Brain Disease Detection. (arXiv:2401.00876v1 [cs.LG])",
    "abstract": "Analyzing connections between brain regions of interest (ROI) is vital to detect neurological disorders such as autism or schizophrenia. Recent advancements employ graph neural networks (GNNs) to utilize graph structures in brains, improving detection performances. Current methods use correlation measures between ROI's blood-oxygen-level-dependent (BOLD) signals to generate the graph structure. Other methods use the training samples to learn the optimal graph structure through end-to-end learning. However, implementing those methods independently leads to some issues with noisy data for the correlation graphs and overfitting problems for the optimal graph. In this work, we proposed Bargrain (balanced graph structure for brains), which models two graph structures: filtered correlation matrix and optimal sample graph using graph convolution networks (GCNs). This approach aims to get advantages from both graphs and address the limitations of only relying on a single type of structure. Bas",
    "link": "http://arxiv.org/abs/2401.00876",
    "context": "Title: Balanced Graph Structure Information for Brain Disease Detection. (arXiv:2401.00876v1 [cs.LG])\nAbstract: Analyzing connections between brain regions of interest (ROI) is vital to detect neurological disorders such as autism or schizophrenia. Recent advancements employ graph neural networks (GNNs) to utilize graph structures in brains, improving detection performances. Current methods use correlation measures between ROI's blood-oxygen-level-dependent (BOLD) signals to generate the graph structure. Other methods use the training samples to learn the optimal graph structure through end-to-end learning. However, implementing those methods independently leads to some issues with noisy data for the correlation graphs and overfitting problems for the optimal graph. In this work, we proposed Bargrain (balanced graph structure for brains), which models two graph structures: filtered correlation matrix and optimal sample graph using graph convolution networks (GCNs). This approach aims to get advantages from both graphs and address the limitations of only relying on a single type of structure. Bas",
    "path": "papers/24/01/2401.00876.json",
    "total_tokens": 876,
    "translated_title": "平衡的图结构信息用于脑疾病检测",
    "translated_abstract": "分析脑区间的连接对于检测自闭症或精神分裂等神经系统疾病至关重要。最近的研究采用图神经网络(GNNs)来利用脑中的图结构，提高检测性能。目前的方法使用ROI的血氧水平依赖性(BOLD)信号之间的相关性来生成图结构。其他方法通过端到端学习使用训练样本来学习最优的图结构。然而，独立实施这些方法会导致相关性图中的噪音数据问题以及最优图的过拟合问题。在这项工作中，我们提出了Bargrain(平衡的脑图结构)，它模拟了两种图结构：经过滤波的相关矩阵和使用图卷积网络(GCNs)生成的最优样本图。这种方法旨在充分利用两种图的优点，并解决仅依赖单一类型结构的局限性。",
    "tldr": "这项工作提出了一种名为Bargrain的平衡脑图结构方法，通过同时模拟经过滤波的相关矩阵和最优样本图来改进脑疾病检测性能，并解决了仅依赖单一类型结构的限制。",
    "en_tdlr": "This work proposes a balanced graph structure method called Bargrain, which improves brain disease detection performance by simultaneously modeling filtered correlation matrix and optimal sample graph, addressing the limitations of relying on a single type of structure."
}