{
    "title": "Dynamical System Identification, Model Selection and Model Uncertainty Quantification by Bayesian Inference. (arXiv:2401.16943v1 [stat.ME])",
    "abstract": "This study presents a Bayesian maximum \\textit{a~posteriori} (MAP) framework for dynamical system identification from time-series data. This is shown to be equivalent to a generalized zeroth-order Tikhonov regularization, providing a rational justification for the choice of the residual and regularization terms, respectively, from the negative logarithms of the likelihood and prior distributions. In addition to the estimation of model coefficients, the Bayesian interpretation gives access to the full apparatus for Bayesian inference, including the ranking of models, the quantification of model uncertainties and the estimation of unknown (nuisance) hyperparameters. Two Bayesian algorithms, joint maximum \\textit{a~posteriori} (JMAP) and variational Bayesian approximation (VBA), are compared to the popular SINDy algorithm for thresholded least-squares regression, by application to several dynamical systems with added noise. For multivariate Gaussian likelihood and prior distributions, the",
    "link": "http://arxiv.org/abs/2401.16943",
    "context": "Title: Dynamical System Identification, Model Selection and Model Uncertainty Quantification by Bayesian Inference. (arXiv:2401.16943v1 [stat.ME])\nAbstract: This study presents a Bayesian maximum \\textit{a~posteriori} (MAP) framework for dynamical system identification from time-series data. This is shown to be equivalent to a generalized zeroth-order Tikhonov regularization, providing a rational justification for the choice of the residual and regularization terms, respectively, from the negative logarithms of the likelihood and prior distributions. In addition to the estimation of model coefficients, the Bayesian interpretation gives access to the full apparatus for Bayesian inference, including the ranking of models, the quantification of model uncertainties and the estimation of unknown (nuisance) hyperparameters. Two Bayesian algorithms, joint maximum \\textit{a~posteriori} (JMAP) and variational Bayesian approximation (VBA), are compared to the popular SINDy algorithm for thresholded least-squares regression, by application to several dynamical systems with added noise. For multivariate Gaussian likelihood and prior distributions, the",
    "path": "papers/24/01/2401.16943.json",
    "total_tokens": 861,
    "translated_title": "动力系统识别、模型选择和贝叶斯推理中的模型不确定性量化",
    "translated_abstract": "本研究提出了一种基于贝叶斯最大后验概率 (MAP) 框架的动力系统识别方法，用于从时间序列数据中恢复系统模型。实验证明这等价于广义的零阶 Tikhonov 正则化，通过负对数似然和先验分布来合理选择残差和正则化项。除了估计模型系数外，贝叶斯解释还提供了完整的贝叶斯推理工具，包括模型排序、模型不确定性量化和未知超参数的估计。通过应用于带有噪声的几个动力系统，比较了两种贝叶斯算法，即联合最大后验概率 (JMAP) 和变分贝叶斯近似 (VBA)，与流行的阈值最小二乘回归算法SINDy。对于多元高斯似然和先验分布，",
    "tldr": "本研究提出了一种基于贝叶斯推理的动力系统识别方法，可以估计模型系数，进行模型排序和模型不确定性量化，并展示了与其他算法的比较结果。",
    "en_tdlr": "This study presents a Bayesian inference-based method for dynamical system identification, which can estimate model coefficients, perform model ranking, and quantify model uncertainty, and the results are compared with other algorithms."
}