{
    "title": "Recency Ranking by Diversification of Result Set. (arXiv:2401.14595v1 [cs.IR])",
    "abstract": "In this paper, we propose a web search retrieval approach which automatically detects recency sensitive queries and increases the freshness of the ordinary document ranking by a degree proportional to the probability of the need in recent content. We propose to solve the recency ranking problem by using result diversification principles and deal with the query's non-topical ambiguity appearing when the need in recent content can be detected only with uncertainty. Our offline and online experiments with millions of queries from real search engine users demonstrate the significant increase in satisfaction of users presented with a search result generated by our approach.",
    "link": "http://arxiv.org/abs/2401.14595",
    "context": "Title: Recency Ranking by Diversification of Result Set. (arXiv:2401.14595v1 [cs.IR])\nAbstract: In this paper, we propose a web search retrieval approach which automatically detects recency sensitive queries and increases the freshness of the ordinary document ranking by a degree proportional to the probability of the need in recent content. We propose to solve the recency ranking problem by using result diversification principles and deal with the query's non-topical ambiguity appearing when the need in recent content can be detected only with uncertainty. Our offline and online experiments with millions of queries from real search engine users demonstrate the significant increase in satisfaction of users presented with a search result generated by our approach.",
    "path": "papers/24/01/2401.14595.json",
    "total_tokens": 651,
    "translated_title": "通过多样性结果集实现最新性排名",
    "translated_abstract": "本文提出了一种网络搜索检索方法，它可以自动识别对最新内容敏感的查询，并通过与最近内容需求的概率成比例地增加普通文档排名的新鲜度。我们提出使用结果多样性原则来解决最新性排名问题，并处理查询的非主题歧义，这种歧义只能以不确定性的方式检测到最近内容的需求。我们的离线和在线实验使用了来自真实搜索引擎用户的数百万个查询，结果表明通过我们的方法生成的搜索结果可以显著提高用户的满意度。",
    "tldr": "本文提出了一种通过多样化结果集来增加普通文档排名新鲜度的网络搜索检索方法，通过实验验证了该方法可以显著提高用户的满意度。"
}