{
    "title": "eCIL-MU: Embedding based Class Incremental Learning and Machine Unlearning. (arXiv:2401.02457v1 [cs.LG])",
    "abstract": "New categories may be introduced over time, or existing categories may need to be reclassified. Class incremental learning (CIL) is employed for the gradual acquisition of knowledge about new categories while preserving information about previously learned ones in such dynamic environments. It might also be necessary to also eliminate the influence of related categories on the model to adapt to reclassification. We thus introduce class-level machine unlearning (MU) within CIL. Typically, MU methods tend to be time-consuming and can potentially harm the model's performance. A continuous stream of unlearning requests could lead to catastrophic forgetting. To address these issues, we propose a non-destructive eCIL-MU framework based on embedding techniques to map data into vectors and then be stored in vector databases. Our approach exploits the overlap between CIL and MU tasks for acceleration. Experiments demonstrate the capability of achieving unlearning effectiveness and orders of mag",
    "link": "http://arxiv.org/abs/2401.02457",
    "context": "Title: eCIL-MU: Embedding based Class Incremental Learning and Machine Unlearning. (arXiv:2401.02457v1 [cs.LG])\nAbstract: New categories may be introduced over time, or existing categories may need to be reclassified. Class incremental learning (CIL) is employed for the gradual acquisition of knowledge about new categories while preserving information about previously learned ones in such dynamic environments. It might also be necessary to also eliminate the influence of related categories on the model to adapt to reclassification. We thus introduce class-level machine unlearning (MU) within CIL. Typically, MU methods tend to be time-consuming and can potentially harm the model's performance. A continuous stream of unlearning requests could lead to catastrophic forgetting. To address these issues, we propose a non-destructive eCIL-MU framework based on embedding techniques to map data into vectors and then be stored in vector databases. Our approach exploits the overlap between CIL and MU tasks for acceleration. Experiments demonstrate the capability of achieving unlearning effectiveness and orders of mag",
    "path": "papers/24/01/2401.02457.json",
    "total_tokens": 878,
    "translated_title": "eCIL-MU: 基于嵌入的逐类增量学习和机器取消学习",
    "translated_abstract": "在动态环境中，可能会不断引入新的类别，或者需要对现有类别进行重新分类。逐类增量学习 (CIL) 用于在获取关于新类别的知识的同时，保留对先前学习类别的信息。为了适应重新分类，还可能需要消除相关类别对模型的影响。因此，我们在CIL中引入了基于类别的机器取消学习 (MU)。通常，MU方法倾向于耗时，并且可能会损害模型的性能。连续的取消学习请求可能导致灾难性遗忘。为解决这些问题，我们提出了一种非破坏性的基于嵌入技术的eCIL-MU框架，将数据映射到向量并存储在向量数据库中。我们的方法利用了CIL和MU任务之间的重叠来加速。实验证明了实现取消学习效果和数量级的能力。",
    "tldr": "eCIL-MU是一种基于嵌入技术的逐类增量学习和机器取消学习的非破坏性框架，可用于在动态环境中快速获取关于新类别的知识，并消除先前学习类别的影响。",
    "en_tdlr": "eCIL-MU is a non-destructive framework for embedding based class incremental learning and machine unlearning, which enables fast acquisition of knowledge about new categories in dynamic environments and eliminates the influence of previously learned categories."
}