{
    "title": "Advantage of Quantum Neural Networks as Quantum Information Decoders. (arXiv:2401.06300v1 [quant-ph])",
    "abstract": "A promising strategy to protect quantum information from noise-induced errors is to encode it into the low-energy states of a topological quantum memory device. However, readout errors from such memory under realistic settings is less understood. We study the problem of decoding quantum information encoded in the groundspaces of topological stabilizer Hamiltonians in the presence of generic perturbations, such as quenched disorder. We first prove that the standard stabilizer-based error correction and decoding schemes work adequately well in such perturbed quantum codes by showing that the decoding error diminishes exponentially in the distance of the underlying unperturbed code. We then prove that Quantum Neural Network (QNN) decoders provide an almost quadratic improvement on the readout error. Thus, we demonstrate provable advantage of using QNNs for decoding realistic quantum error-correcting codes, and our result enables the exploration of a wider range of non-stabilizer codes in ",
    "link": "http://arxiv.org/abs/2401.06300",
    "context": "Title: Advantage of Quantum Neural Networks as Quantum Information Decoders. (arXiv:2401.06300v1 [quant-ph])\nAbstract: A promising strategy to protect quantum information from noise-induced errors is to encode it into the low-energy states of a topological quantum memory device. However, readout errors from such memory under realistic settings is less understood. We study the problem of decoding quantum information encoded in the groundspaces of topological stabilizer Hamiltonians in the presence of generic perturbations, such as quenched disorder. We first prove that the standard stabilizer-based error correction and decoding schemes work adequately well in such perturbed quantum codes by showing that the decoding error diminishes exponentially in the distance of the underlying unperturbed code. We then prove that Quantum Neural Network (QNN) decoders provide an almost quadratic improvement on the readout error. Thus, we demonstrate provable advantage of using QNNs for decoding realistic quantum error-correcting codes, and our result enables the exploration of a wider range of non-stabilizer codes in ",
    "path": "papers/24/01/2401.06300.json",
    "total_tokens": 877,
    "translated_title": "量子神经网络作为量子信息译码器的优势",
    "translated_abstract": "一种保护量子信息免受噪声引起的错误的有希望策略是将其编码到拓扑量子存储设备的低能态中。然而，在实际情况下，来自这种存储器的读取错误的情况尚不清楚。我们研究了在存在泛函扰动（如瞬态失调）的情况下，解码编码在拓扑稳定器哈密顿量的基态中的量子信息的问题。首先，我们证明了标准的稳定器型错误校正和解码方案在这种扰动的量子码中工作得相当好，通过展示解码错误在底层无扰动码的距离上呈指数衰减。然后，我们证明了量子神经网络（QNN）译码器在读取错误方面提供了几乎二次的改进。因此，我们证明了在解码实际的量子纠错码方面使用QNN的明显优势，并且我们的结果使得探索更广泛的非稳定器码成为可能。",
    "tldr": "本论文研究了量子神经网络（QNN）作为解码器在解码量子信息时的优势。实验证明，QNN解码器在读取错误方面几乎具有二次改进。这使得在解码实际的量子纠错码时可以探索更广泛的非稳定器码。"
}