{
    "title": "Autosen: improving automatic wifi human sensing through cross-modal autoencoder. (arXiv:2401.05440v1 [eess.SP])",
    "abstract": "WiFi human sensing is highly regarded for its low-cost and privacy advantages in recognizing human activities. However, its effectiveness is largely confined to controlled, single-user, line-of-sight settings, limited by data collection complexities and the scarcity of labeled datasets. Traditional cross-modal methods, aimed at mitigating these limitations by enabling self-supervised learning without labeled data, struggle to extract meaningful features from amplitude-phase combinations. In response, we introduce AutoSen, an innovative automatic WiFi sensing solution that departs from conventional approaches. AutoSen establishes a direct link between amplitude and phase through automated cross-modal autoencoder learning. This autoencoder efficiently extracts valuable features from unlabeled CSI data, encompassing amplitude and phase information while eliminating their respective unique noises. These features are then leveraged for specific tasks using few-shot learning techniques. Auto",
    "link": "http://arxiv.org/abs/2401.05440",
    "context": "Title: Autosen: improving automatic wifi human sensing through cross-modal autoencoder. (arXiv:2401.05440v1 [eess.SP])\nAbstract: WiFi human sensing is highly regarded for its low-cost and privacy advantages in recognizing human activities. However, its effectiveness is largely confined to controlled, single-user, line-of-sight settings, limited by data collection complexities and the scarcity of labeled datasets. Traditional cross-modal methods, aimed at mitigating these limitations by enabling self-supervised learning without labeled data, struggle to extract meaningful features from amplitude-phase combinations. In response, we introduce AutoSen, an innovative automatic WiFi sensing solution that departs from conventional approaches. AutoSen establishes a direct link between amplitude and phase through automated cross-modal autoencoder learning. This autoencoder efficiently extracts valuable features from unlabeled CSI data, encompassing amplitude and phase information while eliminating their respective unique noises. These features are then leveraged for specific tasks using few-shot learning techniques. Auto",
    "path": "papers/24/01/2401.05440.json",
    "total_tokens": 884,
    "translated_title": "Autosen:通过跨模态自编码器改善自动Wi-Fi人体感知",
    "translated_abstract": "Wi-Fi人体感知因其低成本和隐私优势而备受推崇，在识别人类活动方面具有很大的效果。然而，其有效性在受控、单用户、直线视线的设置中受到限制，受数据收集复杂性和标记数据集稀缺性的制约。传统的跨模态方法旨在通过自监督学习而无需标记数据来减轻这些限制，但往往无法从幅度-相位组合中提取有意义的特征。为了解决这个问题，我们引入了AutoSen，一种创新的自动Wi-Fi感知解决方案，它不同于传统方法。AutoSen通过自动跨模态自编码器学习建立了幅度和相位之间的直接连接。该自编码器从未标记的CSI数据中高效提取有价值的特征，包括幅度和相位信息，同时消除它们各自独特的噪声。然后，利用这些特征使用少样本学习技术来完成特定任务。",
    "tldr": "Autosen是一种创新的自动Wi-Fi感知解决方案，通过自动跨模态自编码器学习建立了幅度和相位之间的直接连接，有效提取Wi-Fi信号中的有价值特征，并利用这些特征进行特定任务。",
    "en_tdlr": "Autosen is an innovative solution for automatic Wi-Fi sensing that establishes a direct link between amplitude and phase through automated cross-modal autoencoder learning to efficiently extract valuable features from Wi-Fi signals and leverage them for specific tasks."
}