{
    "title": "Self-supervised Pretraining for Decision Foundation Model: Formulation, Pipeline and Challenges. (arXiv:2401.00031v2 [cs.LG] UPDATED)",
    "abstract": "Decision-making is a dynamic process requiring perception, memory, and reasoning to make choices and find optimal policies. Traditional approaches to decision-making suffer from sample efficiency and generalization, while large-scale self-supervised pretraining has enabled fast adaptation with fine-tuning or few-shot learning in language and vision. We thus argue to integrate knowledge acquired from generic large-scale self-supervised pretraining into downstream decision-making problems. We propose Pretrain-Then-Adapt pipeline and survey recent work on data collection, pretraining objectives and adaptation strategies for decision-making pretraining and downstream inference. Finally, we identify critical challenges and future directions for developing decision foundation model with the help of generic and flexible self-supervised pretraining.",
    "link": "http://arxiv.org/abs/2401.00031",
    "context": "Title: Self-supervised Pretraining for Decision Foundation Model: Formulation, Pipeline and Challenges. (arXiv:2401.00031v2 [cs.LG] UPDATED)\nAbstract: Decision-making is a dynamic process requiring perception, memory, and reasoning to make choices and find optimal policies. Traditional approaches to decision-making suffer from sample efficiency and generalization, while large-scale self-supervised pretraining has enabled fast adaptation with fine-tuning or few-shot learning in language and vision. We thus argue to integrate knowledge acquired from generic large-scale self-supervised pretraining into downstream decision-making problems. We propose Pretrain-Then-Adapt pipeline and survey recent work on data collection, pretraining objectives and adaptation strategies for decision-making pretraining and downstream inference. Finally, we identify critical challenges and future directions for developing decision foundation model with the help of generic and flexible self-supervised pretraining.",
    "path": "papers/24/01/2401.00031.json",
    "total_tokens": 943,
    "translated_title": "自监督预训练用于决策基础模型：形式化、流程和挑战",
    "translated_abstract": "决策是一个动态过程，需要感知、记忆和推理来进行选择并找到最优策略。传统的决策方法在样本效率和泛化性上存在问题，而大规模的自监督预训练已经使得语言和视觉领域的快速适应成为可能，通过微调或少样本学习。因此，我们提出将从大规模自监督预训练中获取的知识与下游决策问题融合起来。我们提出了先预训练再自适应的流程，并调研了决策预训练和下游推理中的数据收集、预训练目标和自适应策略的最新研究。最后，我们确定了在通用灵活的自监督预训练的帮助下，发展决策基础模型面临的关键挑战和未来方向。",
    "tldr": "本文认为将大规模自监督预训练中的知识与决策问题相结合，可以解决决策中的样本效率和泛化性问题。通过提出先预训练再自适应的流程，并调研了决策预训练和下游推理中的数据收集、预训练目标和自适应策略的最新研究。最后，确定了发展决策基础模型的关键挑战和未来方向。",
    "en_tdlr": "This paper proposes integrating knowledge from large-scale self-supervised pretraining with decision-making problems to address the issues of sample efficiency and generalization. It introduces a Pretrain-Then-Adapt pipeline and surveys recent research on data collection, pretraining objectives, and adaptation strategies. The paper also identifies critical challenges and future directions for developing decision foundation models using generic and flexible self-supervised pretraining."
}