{
    "title": "Risk-Aware Accelerated Wireless Federated Learning with Heterogeneous Clients. (arXiv:2401.09267v1 [cs.LG])",
    "abstract": "Wireless Federated Learning (FL) is an emerging distributed machine learning paradigm, particularly gaining momentum in domains with confidential and private data on mobile clients. However, the location-dependent performance, in terms of transmission rates and susceptibility to transmission errors, poses major challenges for wireless FL's convergence speed and accuracy. The challenge is more acute for hostile environments without a metric that authenticates the data quality and security profile of the clients. In this context, this paper proposes a novel risk-aware accelerated FL framework that accounts for the clients heterogeneity in the amount of possessed data, transmission rates, transmission errors, and trustworthiness. Classifying clients according to their location-dependent performance and trustworthiness profiles, we propose a dynamic risk-aware global model aggregation scheme that allows clients to participate in descending order of their transmission rates and an ascending",
    "link": "http://arxiv.org/abs/2401.09267",
    "context": "Title: Risk-Aware Accelerated Wireless Federated Learning with Heterogeneous Clients. (arXiv:2401.09267v1 [cs.LG])\nAbstract: Wireless Federated Learning (FL) is an emerging distributed machine learning paradigm, particularly gaining momentum in domains with confidential and private data on mobile clients. However, the location-dependent performance, in terms of transmission rates and susceptibility to transmission errors, poses major challenges for wireless FL's convergence speed and accuracy. The challenge is more acute for hostile environments without a metric that authenticates the data quality and security profile of the clients. In this context, this paper proposes a novel risk-aware accelerated FL framework that accounts for the clients heterogeneity in the amount of possessed data, transmission rates, transmission errors, and trustworthiness. Classifying clients according to their location-dependent performance and trustworthiness profiles, we propose a dynamic risk-aware global model aggregation scheme that allows clients to participate in descending order of their transmission rates and an ascending",
    "path": "papers/24/01/2401.09267.json",
    "total_tokens": 891,
    "translated_title": "考虑风险的异构客户无线联邦学习的加速方法",
    "translated_abstract": "无线联邦学习是一种新兴的分布式机器学习范式，在移动客户端上存在机密和私密数据的领域中得到了广泛应用。然而，考虑到传输速率和传输错误的位置相关性，对于无线联邦学习的收敛速度和准确性提出了重大挑战。尤其是在没有一个能够验证客户端数据质量和安全性的度量指标的敌对环境中，这一挑战更为严峻。针对这一情况，本文提出了一种新颖的风险感知加速无线联邦学习框架，考虑了客户端在拥有数据量、传输速率、传输错误和可信度方面的异质性。根据客户端的位置相关性性能和可信度，我们提出了一种动态风险感知的全局模型聚合方案，允许客户端以传输速率降序和传输错误升序的方式参与。",
    "tldr": "本文提出了一种考虑风险的加速无线联邦学习框架，有效应对了无线联邦学习在传输速率和传输错误方面的挑战，通过动态风险感知的全局模型聚合方案，使得客户端能够以最佳顺序参与。"
}