{
    "title": "A Bracketing Relationship for Long-Term Policy Evaluation with Combined Experimental and Observational Data. (arXiv:2401.12050v1 [econ.EM])",
    "abstract": "Combining short-term experimental data with observational data enables credible long-term policy evaluation. The literature offers two key but non-nested assumptions, namely the latent unconfoundedness (LU; Athey et al., 2020) and equi-confounding bias (ECB; Ghassami et al., 2022) conditions, to correct observational selection. Committing to the wrong assumption leads to biased estimation. To mitigate such risks, we provide a novel bracketing relationship (cf. Angrist and Pischke, 2009) repurposed for the setting with data combination: the LU-based estimand and the ECB-based estimand serve as the lower and upper bounds, respectively, with the true causal effect lying in between if either assumption holds. For researchers further seeking point estimates, our Lalonde-style exercise suggests the conservatively more robust LU-based lower bounds align closely with the hold-out experimental estimates for educational policy evaluation. We investigate the economic substantives of these finding",
    "link": "http://arxiv.org/abs/2401.12050",
    "context": "Title: A Bracketing Relationship for Long-Term Policy Evaluation with Combined Experimental and Observational Data. (arXiv:2401.12050v1 [econ.EM])\nAbstract: Combining short-term experimental data with observational data enables credible long-term policy evaluation. The literature offers two key but non-nested assumptions, namely the latent unconfoundedness (LU; Athey et al., 2020) and equi-confounding bias (ECB; Ghassami et al., 2022) conditions, to correct observational selection. Committing to the wrong assumption leads to biased estimation. To mitigate such risks, we provide a novel bracketing relationship (cf. Angrist and Pischke, 2009) repurposed for the setting with data combination: the LU-based estimand and the ECB-based estimand serve as the lower and upper bounds, respectively, with the true causal effect lying in between if either assumption holds. For researchers further seeking point estimates, our Lalonde-style exercise suggests the conservatively more robust LU-based lower bounds align closely with the hold-out experimental estimates for educational policy evaluation. We investigate the economic substantives of these finding",
    "path": "papers/24/01/2401.12050.json",
    "total_tokens": 960,
    "translated_title": "结合实验和观测数据的长期政策评估的括号关系",
    "translated_abstract": "将短期实验数据与观测数据结合起来，可以进行可信的长期政策评估。文献提供了两个关键但非嵌套的假设，即潜在无偏性（LU）和均衡混淆偏差（ECB），用于修正观测选择。选择错误的假设会导致估计偏误。为了减轻这种风险，我们提供了一种新的括号关系，用于数据组合的情况：基于LU的估计指标和基于ECB的估计指标分别作为下界和上界，如果任一假设成立，则真实因果效应介于两者之间。对于进一步寻求点估计的研究人员，我们的Lalonde风格的实验表明，基于LU的保守更健壮的下界与教育政策评估中的实验外估计接近。我们研究了这些结果的经济实质性",
    "tldr": "本研究提出了一种括号关系方法，在结合实验和观测数据进行长期政策评估时，根据潜在无偏性和均衡混淆偏差两个假设的下界和上界进行估计，并发现基于潜在无偏性的保守下界与实验外估计接近。"
}