{
    "title": "Non-Intrusive Speech Intelligibility Prediction for Hearing-Impaired Users using Intermediate ASR Features and Human Memory Models. (arXiv:2401.13611v1 [cs.SD])",
    "abstract": "Neural networks have been successfully used for non-intrusive speech intelligibility prediction. Recently, the use of feature representations sourced from intermediate layers of pre-trained self-supervised and weakly-supervised models has been found to be particularly useful for this task. This work combines the use of Whisper ASR decoder layer representations as neural network input features with an exemplar-based, psychologically motivated model of human memory to predict human intelligibility ratings for hearing-aid users. Substantial performance improvement over an established intrusive HASPI baseline system is found, including on enhancement systems and listeners unseen in the training data, with a root mean squared error of 25.3 compared with the baseline of 28.7.",
    "link": "http://arxiv.org/abs/2401.13611",
    "context": "Title: Non-Intrusive Speech Intelligibility Prediction for Hearing-Impaired Users using Intermediate ASR Features and Human Memory Models. (arXiv:2401.13611v1 [cs.SD])\nAbstract: Neural networks have been successfully used for non-intrusive speech intelligibility prediction. Recently, the use of feature representations sourced from intermediate layers of pre-trained self-supervised and weakly-supervised models has been found to be particularly useful for this task. This work combines the use of Whisper ASR decoder layer representations as neural network input features with an exemplar-based, psychologically motivated model of human memory to predict human intelligibility ratings for hearing-aid users. Substantial performance improvement over an established intrusive HASPI baseline system is found, including on enhancement systems and listeners unseen in the training data, with a root mean squared error of 25.3 compared with the baseline of 28.7.",
    "path": "papers/24/01/2401.13611.json",
    "total_tokens": 774,
    "translated_title": "使用中间ASR特征和人类记忆模型对听障用户进行非侵入性语音可懂度预测",
    "translated_abstract": "神经网络已成功用于非侵入性语音可懂度预测。最近，使用来自预训练的自监督和弱监督模型的中间层特征表示在这个任务中被发现特别有用。本研究将Whisper ASR解码器层的表示作为神经网络的输入特征，结合了一种基于示范的、心理学模型的人类记忆，以预测助听器用户的人类可懂度评分。与已建立的侵入性HASPI基线系统相比，我们实验结果显示出了显著的性能提升，包括在训练数据中未见过的增强系统和听者，均方根误差从28.7降至25.3。",
    "tldr": "本研究使用中间ASR特征和人类记忆模型预测听障用户的语音可懂度，取得了显著的性能提升并降低了均方根误差。",
    "en_tdlr": "This research predicts speech intelligibility for hearing-impaired users by using intermediate ASR features and human memory models, achieving significant performance improvement and reducing root mean squared error."
}