{
    "title": "Building Contextual Knowledge Graphs for Personalized Learning Recommendations using Text Mining and Semantic Graph Completion. (arXiv:2401.13609v1 [cs.IR])",
    "abstract": "Modelling learning objects (LO) within their context enables the learner to advance from a basic, remembering-level, learning objective to a higher-order one, i.e., a level with an application- and analysis objective. While hierarchical data models are commonly used in digital learning platforms, using graph-based models enables representing the context of LOs in those platforms. This leads to a foundation for personalized recommendations of learning paths. In this paper, the transformation of hierarchical data models into knowledge graph (KG) models of LOs using text mining is introduced and evaluated. We utilize custom text mining pipelines to mine semantic relations between elements of an expert-curated hierarchical model. We evaluate the KG structure and relation extraction using graph quality-control metrics and the comparison of algorithmic semantic-similarities to expert-defined ones. The results show that the relations in the KG are semantically comparable to those defined by d",
    "link": "http://arxiv.org/abs/2401.13609",
    "context": "Title: Building Contextual Knowledge Graphs for Personalized Learning Recommendations using Text Mining and Semantic Graph Completion. (arXiv:2401.13609v1 [cs.IR])\nAbstract: Modelling learning objects (LO) within their context enables the learner to advance from a basic, remembering-level, learning objective to a higher-order one, i.e., a level with an application- and analysis objective. While hierarchical data models are commonly used in digital learning platforms, using graph-based models enables representing the context of LOs in those platforms. This leads to a foundation for personalized recommendations of learning paths. In this paper, the transformation of hierarchical data models into knowledge graph (KG) models of LOs using text mining is introduced and evaluated. We utilize custom text mining pipelines to mine semantic relations between elements of an expert-curated hierarchical model. We evaluate the KG structure and relation extraction using graph quality-control metrics and the comparison of algorithmic semantic-similarities to expert-defined ones. The results show that the relations in the KG are semantically comparable to those defined by d",
    "path": "papers/24/01/2401.13609.json",
    "total_tokens": 878,
    "translated_title": "使用文本挖掘和语义图完成构建个性化学习推荐的上下文知识图谱",
    "translated_abstract": "模拟学习对象（LO）在其上下文中可以使学习者从基础的记忆级学习目标发展到更高级别的应用和分析目标。尽管数字学习平台通常使用分层数据模型，但使用基于图的模型可以在这些平台上表示LO的上下文。这为个性化学习路径的推荐提供了基础。本文介绍和评估了使用文本挖掘将分层数据模型转换为LO的知识图（KG）模型的方法。我们利用自定义的文本挖掘流程来挖掘专家策划的分层模型元素之间的语义关系。我们使用图质量控制指标和算法语义相似性与专家定义的语义相似性的比较来评估KG结构和关系提取。结果表明，KG中的关系在语义上与专家定义的关系是可比较的。",
    "tldr": "本研究介绍了使用文本挖掘将分层数据模型转化为知识图模型的方法，并通过评估图质量指标和语义相似性来验证其有效性。结果显示，这种方法可以提供个性化学习路径推荐的基础。",
    "en_tdlr": "This study introduces a method to transform hierarchical data models into knowledge graph models using text mining, and validates its effectiveness by evaluating graph quality metrics and semantic similarities. The results demonstrate that this method provides a foundation for personalized learning path recommendations."
}