{
    "title": "On the Convergence of Hermitian Dynamic Mode Decomposition. (arXiv:2401.03192v1 [math.NA])",
    "abstract": "In this work, we study the convergence of Hermitian Dynamic Mode Decomposition (DMD) to the spectral properties of self-adjoint Koopman operators. Hermitian DMD is a data-driven method for approximating the Koopman operator associated with an unknown nonlinear dynamical system from discrete-time snapshots, while preserving the self-adjointness of the operator on its finite-dimensional approximations. We show that, under suitable conditions, the eigenvalues and eigenfunctions of HDMD converge to the spectral properties of the underlying Koopman operator. Along the way, we establish a general theorem on the convergence of spectral measures, and demonstrate our results numerically on the two-dimensional Schr\\\"odinger equation.",
    "link": "http://arxiv.org/abs/2401.03192",
    "context": "Title: On the Convergence of Hermitian Dynamic Mode Decomposition. (arXiv:2401.03192v1 [math.NA])\nAbstract: In this work, we study the convergence of Hermitian Dynamic Mode Decomposition (DMD) to the spectral properties of self-adjoint Koopman operators. Hermitian DMD is a data-driven method for approximating the Koopman operator associated with an unknown nonlinear dynamical system from discrete-time snapshots, while preserving the self-adjointness of the operator on its finite-dimensional approximations. We show that, under suitable conditions, the eigenvalues and eigenfunctions of HDMD converge to the spectral properties of the underlying Koopman operator. Along the way, we establish a general theorem on the convergence of spectral measures, and demonstrate our results numerically on the two-dimensional Schr\\\"odinger equation.",
    "path": "papers/24/01/2401.03192.json",
    "total_tokens": 806,
    "translated_title": "关于Hermitian动态模态分解的收敛性研究",
    "translated_abstract": "本文研究了Hermitian动态模态分解(DMD)对自伴随Koopman算子的谱性质的收敛性。Hermitian DMD是一种基于数据的方法，用于从离散时间快照近似表示与未知非线性动力系统相关的Koopman算子，同时在其有限维近似中保持算子的自伴性。我们证明，在适当的条件下，HDMD的特征值和特征函数收敛到基础Koopman算子的谱性质。在此过程中，我们建立了关于谱测度收敛性的一般定理，并在二维薛定谔方程上通过数值结果验证了我们的结论。",
    "tldr": "研究了Hermitian动态模态分解(DMD)对自伴随Koopman算子的谱性质的收敛性，通过建立了关于谱测度收敛性的一般定理，证明了HDMD的特征值和特征函数在适当条件下收敛到基础Koopman算子的谱性质。",
    "en_tdlr": "This work investigates the convergence of Hermitian Dynamic Mode Decomposition (DMD) to the spectral properties of self-adjoint Koopman operators and demonstrates through a general theorem on the convergence of spectral measures that the eigenvalues and eigenfunctions of HDMD converge to the corresponding properties of the underlying Koopman operator under suitable conditions."
}