{
    "title": "Anonymous and Strategy-Proof Voting under Subjective Expected Utility Preferences. (arXiv:2401.04060v1 [econ.TH])",
    "abstract": "We study three axioms in the model of constrained social choice under uncertainty where (i) agents have subjective expected utility preferences over acts and (ii) different states of nature have (possibly) different sets of available outcomes. Anonymity says that agents' names or labels should never play a role in the mechanism used to select the social act. Strategy-proofness requires that reporting one's true preferences be a (weakly) dominant strategy for each agent in the associated direct revelation game. Range unanimity essentially says that a feasible act must be selected by society whenever it is reported as every voter's favorite act within the range of the mechanism. We first show that every social choice function satisfying these three axioms can be factored as a product of voting rules that are either constant or binary (always yielding one of two pre-specified outcomes in each state). We describe four basic types of binary factors: three of these types are novel to this li",
    "link": "http://arxiv.org/abs/2401.04060",
    "context": "Title: Anonymous and Strategy-Proof Voting under Subjective Expected Utility Preferences. (arXiv:2401.04060v1 [econ.TH])\nAbstract: We study three axioms in the model of constrained social choice under uncertainty where (i) agents have subjective expected utility preferences over acts and (ii) different states of nature have (possibly) different sets of available outcomes. Anonymity says that agents' names or labels should never play a role in the mechanism used to select the social act. Strategy-proofness requires that reporting one's true preferences be a (weakly) dominant strategy for each agent in the associated direct revelation game. Range unanimity essentially says that a feasible act must be selected by society whenever it is reported as every voter's favorite act within the range of the mechanism. We first show that every social choice function satisfying these three axioms can be factored as a product of voting rules that are either constant or binary (always yielding one of two pre-specified outcomes in each state). We describe four basic types of binary factors: three of these types are novel to this li",
    "path": "papers/24/01/2401.04060.json",
    "total_tokens": 924,
    "translated_title": "基于主观期望效用偏好的匿名和策略无可证明投票",
    "translated_abstract": "我们研究了在不确定性下的受限社会选择模型中的三个公理，其中（i）代理人对行为具有主观期望效用偏好，（ii）不同的自然状态可能具有不同的可行结果集。匿名性表明代理人的姓名或标签在用来选择社会行为的机制中不应起作用。策略无可证明要求每个代理人在相关的直接启示博弈中报告自己真实的偏好是一个（弱）优势策略。范围一致性基本上表示当可行行为被报告为每个选民在机制范围内的最喜欢行为时，社会必须选择可行行为。我们首先证明满足这三个公理的每个社会选择函数可以分解为一组投票规则的乘积，这些规则要么是常数，要么是二元的（在每个状态下总是产生两个预先指定的结果之一）。我们描述了四种基本类型的二元因子：其中三种类型是新颖的。",
    "tldr": "本论文研究了在不确定性下受限社会选择模型中的匿名性、策略无可证明性和范围一致性，证明了满足这三个公理的社会选择函数可以分解为一组常数或二元规则的乘积。"
}