{
    "title": "A novel framework for generalization of deep hidden physics models. (arXiv:2401.04648v1 [cs.LG])",
    "abstract": "Modelling of systems where the full system information is unknown is an oft encountered problem for various engineering and industrial applications, as it's either impossible to consider all the complex physics involved or simpler models are considered to keep within the limits of the available resources. Recent advances in greybox modelling like the deep hidden physics models address this space by combining data and physics. However, for most real-life applications, model generalizability is a key issue, as retraining a model for every small change in system inputs and parameters or modification in domain configuration can render the model economically unviable. In this work we present a novel enhancement to the idea of hidden physics models which can generalize for changes in system inputs, parameters and domains. We also show that this approach holds promise in system discovery as well and helps learn the hidden physics for the changed system inputs, parameters and domain configurat",
    "link": "http://arxiv.org/abs/2401.04648",
    "context": "Title: A novel framework for generalization of deep hidden physics models. (arXiv:2401.04648v1 [cs.LG])\nAbstract: Modelling of systems where the full system information is unknown is an oft encountered problem for various engineering and industrial applications, as it's either impossible to consider all the complex physics involved or simpler models are considered to keep within the limits of the available resources. Recent advances in greybox modelling like the deep hidden physics models address this space by combining data and physics. However, for most real-life applications, model generalizability is a key issue, as retraining a model for every small change in system inputs and parameters or modification in domain configuration can render the model economically unviable. In this work we present a novel enhancement to the idea of hidden physics models which can generalize for changes in system inputs, parameters and domains. We also show that this approach holds promise in system discovery as well and helps learn the hidden physics for the changed system inputs, parameters and domain configurat",
    "path": "papers/24/01/2401.04648.json",
    "total_tokens": 832,
    "translated_title": "一种用于深度隐含物理模型泛化的新框架",
    "translated_abstract": "在各种工程和工业应用中，对于系统的建模是一个常见的问题，其中完整的系统信息是未知的，要么是因为考虑到所有涉及的复杂物理是不可能的，要么是为了在可用资源的限制内考虑更简单的模型。最近在灰盒建模领域的进展，如深度隐含物理模型，通过结合数据和物理来解决这个问题。然而，对于大多数实际应用，模型的泛化能力是一个关键问题，因为为每个系统输入和参数的微小变化或域配置的修改重新训练模型可能导致模型在经济上不可行。在这项工作中，我们提出了一个对隐含物理模型思想的新改进，可以适应系统输入、参数和域的变化。我们还展示了这种方法在系统发现中的潜力，并帮助学习到了变化后系统输入、参数和域的隐藏物理规律。",
    "tldr": "这项工作提出了一种改进的隐含物理模型框架，可以泛化适应系统输入、参数和域的变化，并在系统发现中展现了潜力。",
    "en_tdlr": "This work presents an enhanced framework for hidden physics models that can generalize for changes in system inputs, parameters, and domains, showing promise in system discovery."
}