{
    "title": "Functional Linear Non-Gaussian Acyclic Model for Causal Discovery. (arXiv:2401.09641v1 [cs.LG])",
    "abstract": "In causal discovery, non-Gaussianity has been used to characterize the complete configuration of a Linear Non-Gaussian Acyclic Model (LiNGAM), encompassing both the causal ordering of variables and their respective connection strengths. However, LiNGAM can only deal with the finite-dimensional case. To expand this concept, we extend the notion of variables to encompass vectors and even functions, leading to the Functional Linear Non-Gaussian Acyclic Model (Func-LiNGAM). Our motivation stems from the desire to identify causal relationships in brain-effective connectivity tasks involving, for example, fMRI and EEG datasets. We demonstrate why the original LiNGAM fails to handle these inherently infinite-dimensional datasets and explain the availability of functional data analysis from both empirical and theoretical perspectives. {We establish theoretical guarantees of the identifiability of the causal relationship among non-Gaussian random vectors and even random functions in infinite-di",
    "link": "http://arxiv.org/abs/2401.09641",
    "context": "Title: Functional Linear Non-Gaussian Acyclic Model for Causal Discovery. (arXiv:2401.09641v1 [cs.LG])\nAbstract: In causal discovery, non-Gaussianity has been used to characterize the complete configuration of a Linear Non-Gaussian Acyclic Model (LiNGAM), encompassing both the causal ordering of variables and their respective connection strengths. However, LiNGAM can only deal with the finite-dimensional case. To expand this concept, we extend the notion of variables to encompass vectors and even functions, leading to the Functional Linear Non-Gaussian Acyclic Model (Func-LiNGAM). Our motivation stems from the desire to identify causal relationships in brain-effective connectivity tasks involving, for example, fMRI and EEG datasets. We demonstrate why the original LiNGAM fails to handle these inherently infinite-dimensional datasets and explain the availability of functional data analysis from both empirical and theoretical perspectives. {We establish theoretical guarantees of the identifiability of the causal relationship among non-Gaussian random vectors and even random functions in infinite-di",
    "path": "papers/24/01/2401.09641.json",
    "total_tokens": 837,
    "translated_title": "功能性线性非高斯无循环模型用于因果发现",
    "translated_abstract": "在因果发现中，非高斯性已被用来描述线性非高斯无循环模型（LiNGAM）的完整配置，包括变量的因果顺序及它们之间的连接强度。然而，LiNGAM只能处理有限维情况。为了扩展这个概念，我们将变量的概念扩展到包括向量甚至函数，形成了功能性线性非高斯无循环模型（Func-LiNGAM）。我们的动机源于希望在涉及脑效应连接任务的情况下，比如fMRI和EEG数据集中识别因果关系。我们说明了为什么原始的LiNGAM无法处理这些本质上是无限维的数据集，并从实证和理论的角度解释了功能数据分析的可用性。",
    "tldr": "本研究提出了功能性线性非高斯无循环模型（Func-LiNGAM），将变量的概念扩展到了向量和函数，并解决了原始模型无法处理无限维数据集的问题，从而在因果发现中提供了更广泛的应用。",
    "en_tdlr": "This study introduces the Functional Linear Non-Gaussian Acyclic Model (Func-LiNGAM) by extending the concept of variables to include vectors and functions, addressing the limitation of the original model in handling infinite-dimensional datasets and providing wider applicability in causal discovery."
}