{
    "title": "Mobility Accelerates Learning: Convergence Analysis on Hierarchical Federated Learning in Vehicular Networks. (arXiv:2401.09656v1 [cs.LG])",
    "abstract": "Hierarchical federated learning (HFL) enables distributed training of models across multiple devices with the help of several edge servers and a cloud edge server in a privacy-preserving manner. In this paper, we consider HFL with highly mobile devices, mainly targeting at vehicular networks. Through convergence analysis, we show that mobility influences the convergence speed by both fusing the edge data and shuffling the edge models. While mobility is usually considered as a challenge from the perspective of communication, we prove that it increases the convergence speed of HFL with edge-level heterogeneous data, since more diverse data can be incorporated. Furthermore, we demonstrate that a higher speed leads to faster convergence, since it accelerates the fusion of data. Simulation results show that mobility increases the model accuracy of HFL by up to 15.1% when training a convolutional neural network on the CIFAR-10 dataset.",
    "link": "http://arxiv.org/abs/2401.09656",
    "context": "Title: Mobility Accelerates Learning: Convergence Analysis on Hierarchical Federated Learning in Vehicular Networks. (arXiv:2401.09656v1 [cs.LG])\nAbstract: Hierarchical federated learning (HFL) enables distributed training of models across multiple devices with the help of several edge servers and a cloud edge server in a privacy-preserving manner. In this paper, we consider HFL with highly mobile devices, mainly targeting at vehicular networks. Through convergence analysis, we show that mobility influences the convergence speed by both fusing the edge data and shuffling the edge models. While mobility is usually considered as a challenge from the perspective of communication, we prove that it increases the convergence speed of HFL with edge-level heterogeneous data, since more diverse data can be incorporated. Furthermore, we demonstrate that a higher speed leads to faster convergence, since it accelerates the fusion of data. Simulation results show that mobility increases the model accuracy of HFL by up to 15.1% when training a convolutional neural network on the CIFAR-10 dataset.",
    "path": "papers/24/01/2401.09656.json",
    "total_tokens": 900,
    "translated_title": "移动性加速学习：车联网中分层联邦学习的收敛分析",
    "translated_abstract": "分层联邦学习(HFL)以隐私保护的方式，在多个设备上通过几个边缘服务器和一个云边缘服务器进行模型的分布式训练。本文考虑高度移动的设备，主要针对车联网。通过收敛性分析，我们证明移动性通过融合边缘数据和洗牌边缘模型来影响收敛速度。尽管从通信的角度来看，移动性通常被视为一个挑战，但我们证明它增加了边缘层异构数据下HFL的收敛速度，因为更多多样化的数据可以被合并。此外，我们证明高速度导致更快的收敛，因为它加速了数据的融合。仿真结果表明，当在CIFAR-10数据集上训练卷积神经网络时，移动性可以使HFL的模型准确性提高高达15.1%。",
    "tldr": "在车联网中，通过收敛性分析，本文证明移动性对分层联邦学习的收敛速度有积极影响，它增加了边缘层异构数据的融合和更快的数据融合速度，从而提高模型准确性。",
    "en_tdlr": "This paper investigates hierarchical federated learning (HFL) in vehicular networks and shows through convergence analysis that mobility has a positive effect on the convergence speed. It increases the fusion of edge-level heterogeneous data and accelerates the fusion speed, resulting in improved model accuracy."
}