{
    "title": "Robust Bayesian Method for Refutable Models. (arXiv:2401.04512v1 [econ.EM])",
    "abstract": "We propose a robust Bayesian method for economic models that can be rejected under some data distributions. The econometrician starts with a structural assumption which can be written as the intersection of several assumptions, and the joint assumption is refutable. To avoid the model rejection, the econometrician first takes a stance on which assumption $j$ is likely to be violated and considers a measurement of the degree of violation of this assumption $j$. She then considers a (marginal) prior belief on the degree of violation $(\\pi_{m_j})$: She considers a class of prior distributions $\\pi_s$ on all economic structures such that all $\\pi_s$ have the same marginal distribution $\\pi_m$. Compared to the standard nonparametric Bayesian method that puts a single prior on all economic structures, the robust Bayesian method imposes a single marginal prior distribution on the degree of violation. As a result, the robust Bayesian method allows the econometrician to take a stance only on th",
    "link": "http://arxiv.org/abs/2401.04512",
    "context": "Title: Robust Bayesian Method for Refutable Models. (arXiv:2401.04512v1 [econ.EM])\nAbstract: We propose a robust Bayesian method for economic models that can be rejected under some data distributions. The econometrician starts with a structural assumption which can be written as the intersection of several assumptions, and the joint assumption is refutable. To avoid the model rejection, the econometrician first takes a stance on which assumption $j$ is likely to be violated and considers a measurement of the degree of violation of this assumption $j$. She then considers a (marginal) prior belief on the degree of violation $(\\pi_{m_j})$: She considers a class of prior distributions $\\pi_s$ on all economic structures such that all $\\pi_s$ have the same marginal distribution $\\pi_m$. Compared to the standard nonparametric Bayesian method that puts a single prior on all economic structures, the robust Bayesian method imposes a single marginal prior distribution on the degree of violation. As a result, the robust Bayesian method allows the econometrician to take a stance only on th",
    "path": "papers/24/01/2401.04512.json",
    "total_tokens": 908,
    "translated_title": "鲁棒的贝叶斯方法用于可证伪模型",
    "translated_abstract": "我们提出了一种鲁棒的贝叶斯方法，适用于在某些数据分布下可被拒绝的经济模型。计量经济学家首先基于某种结构性假设，该假设可以被写成几个假设的交集，这个联合假设是可证伪的。为了避免模型被拒绝，经济计量学家首先选择可能被违反的假设$j$，并考虑违反这个假设$j$的程度的度量。然后她考虑对违反程度$(\\pi_{m_j})$的（边际）先验偏好：她考虑了一类先验分布$\\pi_s$，这些分布对所有经济结构都有相同的边际分布$\\pi_m$。与将单一先验放在所有经济结构上的标准非参数贝叶斯方法相比，鲁棒的贝叶斯方法对违反程度施加了单一的边际先验分布。因此，鲁棒的贝叶斯方法允许经济计量学家仅对最不确定的假设采取立场。",
    "tldr": "鲁棒的贝叶斯方法适用于可被拒绝的经济模型，经济计量学家可以根据违反程度选择最不确定的假设。"
}