{
    "title": "Design Your Own Universe: A Physics-Informed Agnostic Method for Enhancing Graph Neural Networks. (arXiv:2401.14580v1 [cs.LG])",
    "abstract": "Physics-informed Graph Neural Networks have achieved remarkable performance in learning through graph-structured data by mitigating common GNN challenges such as over-smoothing, over-squashing, and heterophily adaption. Despite these advancements, the development of a simple yet effective paradigm that appropriately integrates previous methods for handling all these challenges is still underway. In this paper, we draw an analogy between the propagation of GNNs and particle systems in physics, proposing a model-agnostic enhancement framework. This framework enriches the graph structure by introducing additional nodes and rewiring connections with both positive and negative weights, guided by node labeling information. We theoretically verify that GNNs enhanced through our approach can effectively circumvent the over-smoothing issue and exhibit robustness against over-squashing. Moreover, we conduct a spectral analysis on the rewired graph to demonstrate that the corresponding GNNs can f",
    "link": "http://arxiv.org/abs/2401.14580",
    "context": "Title: Design Your Own Universe: A Physics-Informed Agnostic Method for Enhancing Graph Neural Networks. (arXiv:2401.14580v1 [cs.LG])\nAbstract: Physics-informed Graph Neural Networks have achieved remarkable performance in learning through graph-structured data by mitigating common GNN challenges such as over-smoothing, over-squashing, and heterophily adaption. Despite these advancements, the development of a simple yet effective paradigm that appropriately integrates previous methods for handling all these challenges is still underway. In this paper, we draw an analogy between the propagation of GNNs and particle systems in physics, proposing a model-agnostic enhancement framework. This framework enriches the graph structure by introducing additional nodes and rewiring connections with both positive and negative weights, guided by node labeling information. We theoretically verify that GNNs enhanced through our approach can effectively circumvent the over-smoothing issue and exhibit robustness against over-squashing. Moreover, we conduct a spectral analysis on the rewired graph to demonstrate that the corresponding GNNs can f",
    "path": "papers/24/01/2401.14580.json",
    "total_tokens": 860,
    "translated_title": "设计你自己的宇宙：一种物理信息引导的无偏方法来增强图神经网络",
    "translated_abstract": "物理信息引导的图神经网络通过缓解常见的GNN挑战（如过度平滑化、过度压缩和异质适应）在学习图结构数据方面取得了显著的性能。尽管取得了这些进展，仍然在开发一种简单而有效的范式来适当地整合处理所有这些挑战的先前方法。在本文中，我们将GNN的传播与物理粒子系统进行类比，提出了一种模型无关的增强框架。该框架通过引入附加节点和使用正负权重重连连接来丰富图结构，受节点标记信息的指导。我们理论上验证了通过我们的方法增强的GNN可以有效地避免过度平滑问题，并对过度压缩具有鲁棒性。此外，我们对重连图进行了谱分析，证明了相应的GNN可以...",
    "tldr": "本文提出了一种物理信息引导的无偏方法来增强图神经网络，通过引入附加节点和使用正负权重重连连接来丰富图结构，以解决过度平滑和过度压缩的问题。"
}