{
    "title": "Integration of physics-informed operator learning and finite element method for parametric learning of partial differential equations. (arXiv:2401.02363v1 [cs.LG])",
    "abstract": "We present a method that employs physics-informed deep learning techniques for parametrically solving partial differential equations. The focus is on the steady-state heat equations within heterogeneous solids exhibiting significant phase contrast. Similar equations manifest in diverse applications like chemical diffusion, electrostatics, and Darcy flow. The neural network aims to establish the link between the complex thermal conductivity profiles and temperature distributions, as well as heat flux components within the microstructure, under fixed boundary conditions. A distinctive aspect is our independence from classical solvers like finite element methods for data. A noteworthy contribution lies in our novel approach to defining the loss function, based on the discretized weak form of the governing equation. This not only reduces the required order of derivatives but also eliminates the need for automatic differentiation in the construction of loss terms, accepting potential numeri",
    "link": "http://arxiv.org/abs/2401.02363",
    "context": "Title: Integration of physics-informed operator learning and finite element method for parametric learning of partial differential equations. (arXiv:2401.02363v1 [cs.LG])\nAbstract: We present a method that employs physics-informed deep learning techniques for parametrically solving partial differential equations. The focus is on the steady-state heat equations within heterogeneous solids exhibiting significant phase contrast. Similar equations manifest in diverse applications like chemical diffusion, electrostatics, and Darcy flow. The neural network aims to establish the link between the complex thermal conductivity profiles and temperature distributions, as well as heat flux components within the microstructure, under fixed boundary conditions. A distinctive aspect is our independence from classical solvers like finite element methods for data. A noteworthy contribution lies in our novel approach to defining the loss function, based on the discretized weak form of the governing equation. This not only reduces the required order of derivatives but also eliminates the need for automatic differentiation in the construction of loss terms, accepting potential numeri",
    "path": "papers/24/01/2401.02363.json",
    "total_tokens": 919,
    "translated_title": "物理信息操作学习和有限元方法的融合，用于参数学习偏微分方程",
    "translated_abstract": "我们提出了一种使用物理信息深度学习技术来参数化求解偏微分方程的方法。重点是研究具有显著相位对比的异质固体中的稳态热方程。类似的方程在化学扩散、静电学和达西流等各种应用中都存在。神经网络的目标是建立复杂热导率分布与温度分布之间的关系，以及在固定边界条件下微结构中的热流分量。一个独特的方面是我们在数据上独立于有限元方法等经典求解器。一个值得注意的贡献在于我们对损失函数的新颖定义，基于离散化的弱形式控制方程。这不仅降低了所需导数的阶数，还消除了在构建损失项中的自动微分需求，接受了潜在的数值不稳定性。",
    "tldr": "本文提出了一种使用物理信息深度学习技术参数化求解偏微分方程的方法，在异质固体中研究了稳态热方程。该方法可以独立于有限元方法等经典求解器，并使用新颖的损失函数定义，降低了导数阶数和自动微分需求。",
    "en_tdlr": "This paper proposes a method that uses physics-informed deep learning techniques to parametrically solve partial differential equations, focusing on the steady-state heat equations within heterogeneous solids. The method is independent of classical solvers such as finite element methods and introduces a novel loss function definition, reducing the order of derivatives and the need for automatic differentiation."
}