{
    "title": "[Re] The Discriminative Kalman Filter for Bayesian Filtering with Nonlinear and Non-Gaussian Observation Models. (arXiv:2401.14429v1 [cs.LG])",
    "abstract": "Kalman filters provide a straightforward and interpretable means to estimate hidden or latent variables, and have found numerous applications in control, robotics, signal processing, and machine learning. One such application is neural decoding for neuroprostheses. In 2020, Burkhart et al. thoroughly evaluated their new version of the Kalman filter that leverages Bayes' theorem to improve filter performance for highly non-linear or non-Gaussian observation models. This work provides an open-source Python alternative to the authors' MATLAB algorithm. Specifically, we reproduce their most salient results for neuroscientific contexts and further examine the efficacy of their filter using multiple random seeds and previously unused trials from the authors' dataset. All experiments were performed offline on a single computer.",
    "link": "http://arxiv.org/abs/2401.14429",
    "context": "Title: [Re] The Discriminative Kalman Filter for Bayesian Filtering with Nonlinear and Non-Gaussian Observation Models. (arXiv:2401.14429v1 [cs.LG])\nAbstract: Kalman filters provide a straightforward and interpretable means to estimate hidden or latent variables, and have found numerous applications in control, robotics, signal processing, and machine learning. One such application is neural decoding for neuroprostheses. In 2020, Burkhart et al. thoroughly evaluated their new version of the Kalman filter that leverages Bayes' theorem to improve filter performance for highly non-linear or non-Gaussian observation models. This work provides an open-source Python alternative to the authors' MATLAB algorithm. Specifically, we reproduce their most salient results for neuroscientific contexts and further examine the efficacy of their filter using multiple random seeds and previously unused trials from the authors' dataset. All experiments were performed offline on a single computer.",
    "path": "papers/24/01/2401.14429.json",
    "total_tokens": 835,
    "translated_title": "[再论] 非线性和非高斯观测模型的贝叶斯滤波的判别式卡尔曼滤波器",
    "translated_abstract": "卡尔曼滤波器为估计隐藏或潜在变量提供了一种直观且易于理解的方法，并在控制、机器人、信号处理和机器学习等领域应用广泛。其中一种应用是神经脑机接口的神经解码。2020年，Burkhart等人对他们的新版本卡尔曼滤波器进行了深入评估，利用贝叶斯定理改善了对高度非线性或非高斯观测模型的滤波性能。本研究提供了作者MATLAB算法的Python开源替代方案。具体而言，我们重新复现了他们在神经科学背景下最显著的结果，并使用多个随机种子和作者数据集中未使用的试验进一步检验了滤波器的效果。所有实验在一台计算机上离线进行。",
    "tldr": "该论文提供了一种针对非线性和非高斯观测模型的贝叶斯滤波的判别式卡尔曼滤波器，并在神经科学背景下证明了其有效性。",
    "en_tdlr": "This paper presents a discriminative Kalman filter for Bayesian filtering with nonlinear and non-Gaussian observation models, and demonstrates its effectiveness in the context of neuroscience."
}