{
    "title": "Using Zero-shot Prompting in the Automatic Creation and Expansion of Topic Taxonomies for Tagging Retail Banking Transactions",
    "abstract": "This work presents an unsupervised method for automatically constructing and expanding topic taxonomies using instruction-based fine-tuned LLMs (Large Language Models). We apply topic modeling and keyword extraction techniques to create initial topic taxonomies and LLMs to post-process the resulting terms and create a hierarchy. To expand an existing taxonomy with new terms, we use zero-shot prompting to find out where to add new nodes, which, to our knowledge, is the first work to present such an approach to taxonomy tasks. We use the resulting taxonomies to assign tags that characterize merchants from a retail bank dataset. To evaluate our work, we asked 12 volunteers to answer a two-part form in which we first assessed the quality of the taxonomies created and then the tags assigned to merchants based on that taxonomy. The evaluation revealed a coherence rate exceeding 90% for the chosen taxonomies. The taxonomies' expansion with LLMs also showed exciting results for parent node pre",
    "link": "https://arxiv.org/abs/2401.06790",
    "context": "Title: Using Zero-shot Prompting in the Automatic Creation and Expansion of Topic Taxonomies for Tagging Retail Banking Transactions\nAbstract: This work presents an unsupervised method for automatically constructing and expanding topic taxonomies using instruction-based fine-tuned LLMs (Large Language Models). We apply topic modeling and keyword extraction techniques to create initial topic taxonomies and LLMs to post-process the resulting terms and create a hierarchy. To expand an existing taxonomy with new terms, we use zero-shot prompting to find out where to add new nodes, which, to our knowledge, is the first work to present such an approach to taxonomy tasks. We use the resulting taxonomies to assign tags that characterize merchants from a retail bank dataset. To evaluate our work, we asked 12 volunteers to answer a two-part form in which we first assessed the quality of the taxonomies created and then the tags assigned to merchants based on that taxonomy. The evaluation revealed a coherence rate exceeding 90% for the chosen taxonomies. The taxonomies' expansion with LLMs also showed exciting results for parent node pre",
    "path": "papers/24/01/2401.06790.json",
    "total_tokens": 959,
    "translated_title": "在标记零售银行交易中，使用零样本提示来自动创建和扩展主题分类法的研究",
    "translated_abstract": "本文提出了一种无监督的方法，利用基于指令的微调LLMs（大型语言模型）自动构建和扩展主题分类法。我们应用主题建模和关键词提取技术创建初始主题分类法，利用LLMs对结果术语进行后处理并创建层次结构。为了使用新术语扩展现有分类法，我们使用零样本提示来确定在何处添加新节点，据我们所知，这是首次将这种方法应用于分类法任务。我们使用得到的分类法为零售银行数据集中的商家分配标签。为了评估我们的工作，我们请12名志愿者回答了一个两部分的表格，我们首先评估了所创建分类法的质量，然后评估了基于该分类法分配给商家的标签。评估结果显示所选分类法的一致性率超过90%。使用LLMs扩展分类法也显示出令人兴奋的结果，父节点的优先级降低。",
    "tldr": "这项工作提出了使用无监督方法和零样本提示来自动构建和扩展主题分类法的研究。通过应用主题建模和关键词提取技术，结合基于指令的微调LLMs，在零售银行数据集中为商家分配标签，具有超过90%的一致性率和令人兴奋的结果。"
}