{
    "title": "Free public transport to the destination: A causal analysis of tourists' travel mode choice. (arXiv:2401.14945v1 [econ.GN])",
    "abstract": "In this paper, we assess the impact of a fare-free public transport policy for overnight guests on travel mode choice to a Swiss tourism destination. The policy directly targets domestic transport to and from a destination, the substantial contributor to the CO2 emissions of overnight trips. Based on a survey sample, we identify the effect with the help of the random element that the information on the offer from a hotelier to the guest varies in day-to-day business. We estimate a shift from private cars to public transport due to the policy of, on average, 16.9 and 11.6 percentage points, depending on the application of propensity score matching and causal forest. This knowledge is relevant for policy-makers to design future offers that include more sustainable travels to a destination. Overall, our paper exemplifies how such an effect of comparable natural experiments in the travel and tourism industry can be properly identified with a causal framework and underlying assumptions.",
    "link": "http://arxiv.org/abs/2401.14945",
    "context": "Title: Free public transport to the destination: A causal analysis of tourists' travel mode choice. (arXiv:2401.14945v1 [econ.GN])\nAbstract: In this paper, we assess the impact of a fare-free public transport policy for overnight guests on travel mode choice to a Swiss tourism destination. The policy directly targets domestic transport to and from a destination, the substantial contributor to the CO2 emissions of overnight trips. Based on a survey sample, we identify the effect with the help of the random element that the information on the offer from a hotelier to the guest varies in day-to-day business. We estimate a shift from private cars to public transport due to the policy of, on average, 16.9 and 11.6 percentage points, depending on the application of propensity score matching and causal forest. This knowledge is relevant for policy-makers to design future offers that include more sustainable travels to a destination. Overall, our paper exemplifies how such an effect of comparable natural experiments in the travel and tourism industry can be properly identified with a causal framework and underlying assumptions.",
    "path": "papers/24/01/2401.14945.json",
    "total_tokens": 932,
    "translated_title": "免费公共交通到达目的地：对游客出行方式选择的因果分析",
    "translated_abstract": "本文评估了对瑞士旅游目的地的过夜游客实施免费公共交通政策对出行方式选择的影响。该政策直接针对国内交通往返目的地，该交通方式是过夜旅行中二氧化碳排放的主要贡献者。基于一个调查样本，我们利用信息提供者（酒店业主）每天变化的随机元素来确定政策的影响。我们通过倾向性得分匹配和因果森林的应用估计，私家车向公共交通的转移平均为16.9和11.6个百分点。这些结果对于决策者设计未来的旅行方案，包括更可持续的旅行方式到达目的地非常重要。总体上，本文展示了如何通过因果框架和基本假设正确确定旅行和旅游行业中类似自然实验的效果。",
    "tldr": "研究评估了对瑞士旅游目的地的免费公共交通政策对游客出行方式选择的影响，发现政策平均导致私家车向公共交通的转移增加了16.9和11.6个百分点，为未来设计更可持续的旅行方案提供了重要参考。"
}