{
    "title": "Downstream Task-Oriented Generative Model Selections on Synthetic Data Training for Fraud Detection Models. (arXiv:2401.00974v1 [cs.LG])",
    "abstract": "Devising procedures for downstream task-oriented generative model selections is an unresolved problem of practical importance. Existing studies focused on the utility of a single family of generative models. They provided limited insights on how synthetic data practitioners select the best family generative models for synthetic training tasks given a specific combination of machine learning model class and performance metric. In this paper, we approach the downstream task-oriented generative model selections problem in the case of training fraud detection models and investigate the best practice given different combinations of model interpretability and model performance constraints. Our investigation supports that, while both Neural Network(NN)-based and Bayesian Network(BN)-based generative models are both good to complete synthetic training task under loose model interpretability constrain, the BN-based generative models is better than NN-based when synthetic training fraud detectio",
    "link": "http://arxiv.org/abs/2401.00974",
    "context": "Title: Downstream Task-Oriented Generative Model Selections on Synthetic Data Training for Fraud Detection Models. (arXiv:2401.00974v1 [cs.LG])\nAbstract: Devising procedures for downstream task-oriented generative model selections is an unresolved problem of practical importance. Existing studies focused on the utility of a single family of generative models. They provided limited insights on how synthetic data practitioners select the best family generative models for synthetic training tasks given a specific combination of machine learning model class and performance metric. In this paper, we approach the downstream task-oriented generative model selections problem in the case of training fraud detection models and investigate the best practice given different combinations of model interpretability and model performance constraints. Our investigation supports that, while both Neural Network(NN)-based and Bayesian Network(BN)-based generative models are both good to complete synthetic training task under loose model interpretability constrain, the BN-based generative models is better than NN-based when synthetic training fraud detectio",
    "path": "papers/24/01/2401.00974.json",
    "total_tokens": 910,
    "translated_title": "在合成数据训练中，针对下游任务的生成模型选择的欺诈检测模型研究",
    "translated_abstract": "设计用于下游任务的生成模型选择流程是一个尚未解决但具有重要实际意义的问题。现有研究主要关注单一类型生成模型的实用性，对于合成训练任务中如何选择最佳生成模型家族，给定特定的机器学习模型类别和性能度量，提供的见解有限。本文针对训练欺诈检测模型的下游任务导向生成模型选择问题进行研究，并调查在模型可解释性和模型性能约束不同时的最佳实践。我们的研究支持以下观点：在模型可解释性约束下，神经网络（NN）和贝叶斯网络（BN）的生成模型均能很好完成合成训练任务，但在合成训练欺诈检测模型时，BN-based生成模型比NN-based更好。",
    "tldr": "本论文研究了欺诈检测模型训练中针对下游任务的生成模型选择问题，并调查了在不同的可解释性和性能约束条件下的最佳实践。研究结果表明，在合成训练欺诈检测模型时，贝叶斯网络（BN）的生成模型优于神经网络（NN）的生成模型。",
    "en_tdlr": "This paper investigates the problem of downstream task-oriented generative model selection for fraud detection models and explores the best practices under different constraints of model interpretability and performance. The research supports that Bayesian Network (BN)-based generative models outperform Neural Network (NN)-based generative models for synthetic training of fraud detection models."
}