{
    "title": "Exploring Conversational Agents as an Effective Tool for Measuring Cognitive Biases in Decision-Making. (arXiv:2401.06686v1 [cs.HC])",
    "abstract": "Heuristics and cognitive biases are an integral part of human decision-making. Automatically detecting a particular cognitive bias could enable intelligent tools to provide better decision-support. Detecting the presence of a cognitive bias currently requires a hand-crafted experiment and human interpretation. Our research aims to explore conversational agents as an effective tool to measure various cognitive biases in different domains. Our proposed conversational agent incorporates a bias measurement mechanism that is informed by the existing experimental designs and various experimental tasks identified in the literature. Our initial experiments to measure framing and loss-aversion biases indicate that the conversational agents can be effectively used to measure the biases.",
    "link": "http://arxiv.org/abs/2401.06686",
    "context": "Title: Exploring Conversational Agents as an Effective Tool for Measuring Cognitive Biases in Decision-Making. (arXiv:2401.06686v1 [cs.HC])\nAbstract: Heuristics and cognitive biases are an integral part of human decision-making. Automatically detecting a particular cognitive bias could enable intelligent tools to provide better decision-support. Detecting the presence of a cognitive bias currently requires a hand-crafted experiment and human interpretation. Our research aims to explore conversational agents as an effective tool to measure various cognitive biases in different domains. Our proposed conversational agent incorporates a bias measurement mechanism that is informed by the existing experimental designs and various experimental tasks identified in the literature. Our initial experiments to measure framing and loss-aversion biases indicate that the conversational agents can be effectively used to measure the biases.",
    "path": "papers/24/01/2401.06686.json",
    "total_tokens": 774,
    "translated_title": "探索对话代理作为衡量决策中认知偏差的有效工具",
    "translated_abstract": "启发法和认知偏差是人类决策的重要组成部分。自动检测特定的认知偏差可以使智能工具提供更好的决策支持。目前，检测认知偏差的存在需要手工设计实验和人工解释。我们的研究旨在探索对话代理作为衡量不同领域中各种认知偏差的有效工具。我们提出的对话代理含有一个根据现有实验设计和文献中确定的各种实验任务的偏差测量机制。我们对衡量框架和损失厌恶偏差的初始实验表明，对话代理可以有效地用于测量这些偏差。",
    "tldr": "本研究探索了对话代理作为衡量决策中认知偏差的有效工具，通过对不同领域中的各种认知偏差进行测量。实验结果表明，对话代理可以有效地用于测量框架和损失厌恶偏差。",
    "en_tdlr": "This research explores conversational agents as an effective tool for measuring cognitive biases in decision-making, and the initial experiments show that conversational agents can effectively measure framing and loss-aversion biases."
}