{
    "title": "Do backrun auctions protect traders?. (arXiv:2401.08302v1 [q-fin.TR])",
    "abstract": "We study a new \"laminated\" queueing model for orders on batched trading venues such as decentralised exchanges. The model aims to capture and generalise transaction queueing infrastructure that has arisen to organise MEV activity on public blockchains such as Ethereum, providing convenient channels for sophisticated agents to extract value by acting on end-user order flow by performing arbitrage and related HFT activities. In our model, market orders are interspersed with orders created by arbitrageurs that under idealised conditions reset the marginal price to a global equilibrium between each trade, improving predictability of execution for liquidity traders.  If an arbitrageur has a chance to land multiple opportunities in a row, he may attempt to manipulate the execution price of the intervening market order by a probabilistic blind sandwiching strategy. To study how bad this manipulation can get, we introduce and bound a price manipulation coefficient that measures the deviation f",
    "link": "http://arxiv.org/abs/2401.08302",
    "context": "Title: Do backrun auctions protect traders?. (arXiv:2401.08302v1 [q-fin.TR])\nAbstract: We study a new \"laminated\" queueing model for orders on batched trading venues such as decentralised exchanges. The model aims to capture and generalise transaction queueing infrastructure that has arisen to organise MEV activity on public blockchains such as Ethereum, providing convenient channels for sophisticated agents to extract value by acting on end-user order flow by performing arbitrage and related HFT activities. In our model, market orders are interspersed with orders created by arbitrageurs that under idealised conditions reset the marginal price to a global equilibrium between each trade, improving predictability of execution for liquidity traders.  If an arbitrageur has a chance to land multiple opportunities in a row, he may attempt to manipulate the execution price of the intervening market order by a probabilistic blind sandwiching strategy. To study how bad this manipulation can get, we introduce and bound a price manipulation coefficient that measures the deviation f",
    "path": "papers/24/01/2401.08302.json",
    "total_tokens": 917,
    "translated_title": "执行回放拍卖会保护交易员吗？",
    "translated_abstract": "我们研究了一种新的“层叠”排队模型，用于批量交易场所（如去中心化交易所）上的订单。该模型旨在捕捉和推广已经出现在公共区块链（如以太坊）上以组织MEV活动的交易队列基础设施，为复杂代理提供方便的渠道，可以通过对最终用户订单流的操作来提取价值，执行套利和相关的高频交易活动。在我们的模型中，市场订单与由套利者创建的订单交错出现，在理想化条件下，这些订单将在每笔交易之间重置边际价格，提高流动性交易者的执行可预测性。如果一个套利者有机会连续获得多个机会，他可以通过概率盲目夹击策略来操纵中介市场订单的执行价格。为了研究这种操纵可能造成的后果，我们引入并界定了一个衡量偏离程度的价格操纵系数。",
    "tldr": "该研究通过一个新的排队模型，研究了在批量交易场所上的订单执行过程中的价格操纵问题。实验表明，在特定条件下，套利者可以通过概率盲目夹击策略操纵市场订单的执行价格，但存在一定的界限。"
}