{
    "title": "Transfer-Learning-Based Autotuning Using Gaussian Copula. (arXiv:2401.04669v1 [cs.LG])",
    "abstract": "As diverse high-performance computing (HPC) systems are built, many opportunities arise for applications to solve larger problems than ever before. Given the significantly increased complexity of these HPC systems and application tuning, empirical performance tuning, such as autotuning, has emerged as a promising approach in recent years. Despite its effectiveness, autotuning is often a computationally expensive approach. Transfer learning (TL)-based autotuning seeks to address this issue by leveraging the data from prior tuning. Current TL methods for autotuning spend significant time modeling the relationship between parameter configurations and performance, which is ineffective for few-shot (that is, few empirical evaluations) tuning on new tasks. We introduce the first generative TL-based autotuning approach based on the Gaussian copula (GC) to model the high-performing regions of the search space from prior data and then generate high-performing configurations for new tasks. This ",
    "link": "http://arxiv.org/abs/2401.04669",
    "context": "Title: Transfer-Learning-Based Autotuning Using Gaussian Copula. (arXiv:2401.04669v1 [cs.LG])\nAbstract: As diverse high-performance computing (HPC) systems are built, many opportunities arise for applications to solve larger problems than ever before. Given the significantly increased complexity of these HPC systems and application tuning, empirical performance tuning, such as autotuning, has emerged as a promising approach in recent years. Despite its effectiveness, autotuning is often a computationally expensive approach. Transfer learning (TL)-based autotuning seeks to address this issue by leveraging the data from prior tuning. Current TL methods for autotuning spend significant time modeling the relationship between parameter configurations and performance, which is ineffective for few-shot (that is, few empirical evaluations) tuning on new tasks. We introduce the first generative TL-based autotuning approach based on the Gaussian copula (GC) to model the high-performing regions of the search space from prior data and then generate high-performing configurations for new tasks. This ",
    "path": "papers/24/01/2401.04669.json",
    "total_tokens": 834,
    "translated_title": "基于高斯Copula的迁移学习自动调优",
    "translated_abstract": "随着多样化的高性能计算（HPC）系统的发展，应用程序有机会解决比以往更大的问题。鉴于这些HPC系统和应用程序调优的显著增加的复杂性，经验性能调优（如自动调优）近年来成为一种有前途的方法。尽管其有效性，自动调优往往是一种计算复杂度高的方法。基于传输学习（TL）的自动调优试图通过利用先前调优的数据来解决这个问题。目前TL方法为自动调优在建模参数配置和性能之间的关系上花费了大量时间，对于新任务的少样本（即，少数经验评估）调优是无效的。我们首次介绍了基于高斯Copula（GC）的生成式TL自动调优方法，通过对先前数据中搜索空间的高性能区域建模，为新任务生成高性能配置。",
    "tldr": "该论文提出了一种基于高斯Copula的迁移学习自动调优方法，通过利用先前调优数据中搜索空间的高性能区域建模，为新任务生成高性能配置。"
}