{
    "title": "How to Use Data Science in Economics -- a Classroom Game Based on Cartel Detection. (arXiv:2401.14757v1 [econ.GN])",
    "abstract": "We present a classroom game that integrates economics and data-science competencies. In the first two parts of the game, participants assume the roles of firms in a procurement market, where they must either adopt competitive behaviors or have the option to engage in collusion. Success in these parts hinges on their comprehension of market dynamics. In the third part of the game, participants transition to the role of competition-authority members. Drawing from recent literature on machine-learning-based cartel detection, they analyze the bids for patterns indicative of collusive (cartel) behavior. In this part of the game, success depends on data-science skills. We offer a detailed discussion on implementing the game, emphasizing considerations for accommodating diverging levels of preexisting knowledge in data science.",
    "link": "http://arxiv.org/abs/2401.14757",
    "context": "Title: How to Use Data Science in Economics -- a Classroom Game Based on Cartel Detection. (arXiv:2401.14757v1 [econ.GN])\nAbstract: We present a classroom game that integrates economics and data-science competencies. In the first two parts of the game, participants assume the roles of firms in a procurement market, where they must either adopt competitive behaviors or have the option to engage in collusion. Success in these parts hinges on their comprehension of market dynamics. In the third part of the game, participants transition to the role of competition-authority members. Drawing from recent literature on machine-learning-based cartel detection, they analyze the bids for patterns indicative of collusive (cartel) behavior. In this part of the game, success depends on data-science skills. We offer a detailed discussion on implementing the game, emphasizing considerations for accommodating diverging levels of preexisting knowledge in data science.",
    "path": "papers/24/01/2401.14757.json",
    "total_tokens": 829,
    "translated_title": "如何在经济学中使用数据科学 -- 基于卡特尔检测的课堂游戏",
    "translated_abstract": "我们提出了一个将经济学和数据科学能力整合在一起的课堂游戏。在游戏的前两个部分，参与者扮演采购市场上的公司角色，他们必须采取竞争行为或选择进行勾结。这两个部分的成功取决于他们对市场动态的理解。在游戏的第三部分，参与者转变为竞争管理机构的成员。根据基于机器学习的卡特尔检测的最新文献，他们分析投标行为，寻找表明勾结行为的模式。在这个部分，成功取决于数据科学技能。我们详细讨论了实施该游戏的方法，并强调了适应不同数据科学先前知识水平的考虑因素。",
    "tldr": "这个课堂游戏将经济学和数据科学结合起来，在采购市场中通过竞争或勾结的角色扮演和利用机器学习技术进行卡特尔检测的分析，帮助学生提高市场动态理解和数据科学技能。",
    "en_tdlr": "This classroom game integrates economics and data science, allowing participants to play the roles of competitive or collusive firms in a procurement market and analyze bidding patterns using machine learning techniques for cartel detection, helping students enhance their comprehension of market dynamics and data science skills."
}