{
    "title": "The Joint Effect of Task Similarity and Overparameterization on Catastrophic Forgetting -- An Analytical Model. (arXiv:2401.12617v1 [cs.LG])",
    "abstract": "In continual learning, catastrophic forgetting is affected by multiple aspects of the tasks. Previous works have analyzed separately how forgetting is affected by either task similarity or overparameterization. In contrast, our paper examines how task similarity and overparameterization jointly affect forgetting in an analyzable model. Specifically, we focus on two-task continual linear regression, where the second task is a random orthogonal transformation of an arbitrary first task (an abstraction of random permutation tasks). We derive an exact analytical expression for the expected forgetting - and uncover a nuanced pattern. In highly overparameterized models, intermediate task similarity causes the most forgetting. However, near the interpolation threshold, forgetting decreases monotonically with the expected task similarity. We validate our findings with linear regression on synthetic data, and with neural networks on established permutation task benchmarks.",
    "link": "http://arxiv.org/abs/2401.12617",
    "context": "Title: The Joint Effect of Task Similarity and Overparameterization on Catastrophic Forgetting -- An Analytical Model. (arXiv:2401.12617v1 [cs.LG])\nAbstract: In continual learning, catastrophic forgetting is affected by multiple aspects of the tasks. Previous works have analyzed separately how forgetting is affected by either task similarity or overparameterization. In contrast, our paper examines how task similarity and overparameterization jointly affect forgetting in an analyzable model. Specifically, we focus on two-task continual linear regression, where the second task is a random orthogonal transformation of an arbitrary first task (an abstraction of random permutation tasks). We derive an exact analytical expression for the expected forgetting - and uncover a nuanced pattern. In highly overparameterized models, intermediate task similarity causes the most forgetting. However, near the interpolation threshold, forgetting decreases monotonically with the expected task similarity. We validate our findings with linear regression on synthetic data, and with neural networks on established permutation task benchmarks.",
    "path": "papers/24/01/2401.12617.json",
    "total_tokens": 909,
    "translated_title": "任务相似性和过参数化对灾难性遗忘的联合影响 - 一种分析模型",
    "translated_abstract": "在连续学习中，灾难性遗忘受到多个任务方面的影响。以往的研究分别分析了遗忘受任务相似性或过参数化的影响。相反，我们的论文在可分析的模型中研究了任务相似性和过参数化如何共同影响遗忘。具体而言，我们关注双任务连续线性回归，其中第二个任务是任意第一个任务的随机正交变换（随机排列任务的抽象）。我们推导了期望遗忘的精确解析表达式，并揭示了一个微妙的模式。在过参数化模型中，中等任务相似性导致最多的遗忘。然而，在插值阈值附近，遗忘随期望任务相似性单调减少。我们用合成数据上的线性回归和已建立的排列任务基准上的神经网络验证了我们的发现。",
    "tldr": "本文研究了任务相似性和过参数化如何联合影响连续学习中的灾难性遗忘，并发现在过参数化模型中，中等任务相似性导致最多的遗忘，而在插值阈值附近，遗忘随期望任务相似性单调减少。",
    "en_tdlr": "This paper investigates how task similarity and overparameterization jointly affect catastrophic forgetting in continual learning. The study reveals that intermediate task similarity causes the most forgetting in highly overparameterized models, while near the interpolation threshold, forgetting decreases monotonically with the expected task similarity."
}