{
    "title": "Understanding the Detrimental Class-level Effects of Data Augmentation. (arXiv:2401.01764v1 [cs.CV])",
    "abstract": "Data augmentation (DA) encodes invariance and provides implicit regularization critical to a model's performance in image classification tasks. However, while DA improves average accuracy, recent studies have shown that its impact can be highly class dependent: achieving optimal average accuracy comes at the cost of significantly hurting individual class accuracy by as much as 20% on ImageNet. There has been little progress in resolving class-level accuracy drops due to a limited understanding of these effects. In this work, we present a framework for understanding how DA interacts with class-level learning dynamics. Using higher-quality multi-label annotations on ImageNet, we systematically categorize the affected classes and find that the majority are inherently ambiguous, co-occur, or involve fine-grained distinctions, while DA controls the model's bias towards one of the closely related classes. While many of the previously reported performance drops are explained by multi-label an",
    "link": "http://arxiv.org/abs/2401.01764",
    "context": "Title: Understanding the Detrimental Class-level Effects of Data Augmentation. (arXiv:2401.01764v1 [cs.CV])\nAbstract: Data augmentation (DA) encodes invariance and provides implicit regularization critical to a model's performance in image classification tasks. However, while DA improves average accuracy, recent studies have shown that its impact can be highly class dependent: achieving optimal average accuracy comes at the cost of significantly hurting individual class accuracy by as much as 20% on ImageNet. There has been little progress in resolving class-level accuracy drops due to a limited understanding of these effects. In this work, we present a framework for understanding how DA interacts with class-level learning dynamics. Using higher-quality multi-label annotations on ImageNet, we systematically categorize the affected classes and find that the majority are inherently ambiguous, co-occur, or involve fine-grained distinctions, while DA controls the model's bias towards one of the closely related classes. While many of the previously reported performance drops are explained by multi-label an",
    "path": "papers/24/01/2401.01764.json",
    "total_tokens": 961,
    "translated_title": "理解数据增强的不利类级影响",
    "translated_abstract": "数据增强（DA）对于图像分类任务中模型性能的提升至关重要，它编码了不变性并提供了隐式正则化。然而，尽管DA提高了平均准确性，最近的研究表明其影响可能高度依赖于类别：达到最佳平均准确度的同时，会导致ImageNet上单个类别准确度显著下降高达20％。由于对这些影响的理解有限，对解决类别级准确度下降的进展很少。在这项工作中，我们提出了一个框架，用于理解DA与类别级学习动态之间的相互作用。利用更高质量的ImageNet多标签注释，我们系统地对受影响的类别进行分类，并发现大多数类别本质上是模糊的、共现的或涉及细粒度的区别，而DA控制了模型对其中一个相关的类别的偏好。许多先前报告的性能下降通过多标签注释可以解释。",
    "tldr": "理解了数据增强对类别级学习的影响，发现在图像分类任务中，数据增强在提高平均准确性的同时，会显著降低个别类别的准确性。这些影响主要出现在模糊、共现或细粒度区别的类别上，数据增强受控于模型对其中一个相关类别的偏好。",
    "en_tdlr": "Understanding the detrimental effects of data augmentation on class-level learning, it is found that while improving average accuracy in image classification tasks, data augmentation significantly reduces the accuracy of individual classes. These effects are mainly observed in inherently ambiguous, co-occurring, or fine-grained distinction categories, and are controlled by the model's bias towards one of the related classes."
}