{
    "title": "A Brain-inspired Computational Model for Human-like Concept Learning. (arXiv:2401.06471v1 [cs.AI])",
    "abstract": "Concept learning is a fundamental aspect of human cognition and plays a critical role in mental processes such as categorization, reasoning, memory, and decision-making. Researchers across various disciplines have shown consistent interest in the process of concept acquisition in individuals. To elucidate the mechanisms involved in human concept learning, this study examines the findings from computational neuroscience and cognitive psychology. These findings indicate that the brain's representation of concepts relies on two essential components: multisensory representation and text-derived representation. These two types of representations are coordinated by a semantic control system, ultimately leading to the acquisition of concepts. Drawing inspiration from this mechanism, the study develops a human-like computational model for concept learning based on spiking neural networks. By effectively addressing the challenges posed by diverse sources and imbalanced dimensionality of the two",
    "link": "http://arxiv.org/abs/2401.06471",
    "context": "Title: A Brain-inspired Computational Model for Human-like Concept Learning. (arXiv:2401.06471v1 [cs.AI])\nAbstract: Concept learning is a fundamental aspect of human cognition and plays a critical role in mental processes such as categorization, reasoning, memory, and decision-making. Researchers across various disciplines have shown consistent interest in the process of concept acquisition in individuals. To elucidate the mechanisms involved in human concept learning, this study examines the findings from computational neuroscience and cognitive psychology. These findings indicate that the brain's representation of concepts relies on two essential components: multisensory representation and text-derived representation. These two types of representations are coordinated by a semantic control system, ultimately leading to the acquisition of concepts. Drawing inspiration from this mechanism, the study develops a human-like computational model for concept learning based on spiking neural networks. By effectively addressing the challenges posed by diverse sources and imbalanced dimensionality of the two",
    "path": "papers/24/01/2401.06471.json",
    "total_tokens": 857,
    "translated_title": "一种基于大脑启发的人类概念学习的计算模型",
    "translated_abstract": "概念学习是人类认知的基本方面，在分类、推理、记忆和决策等心理过程中起着关键作用。来自计算神经科学和认知心理学的研究人员着眼于揭示个体的概念习得机制。这些研究发现表明，大脑对概念的表示依赖于两个基本组成部分：多感官表示和文本导出的表示。这两种类型的表示由一个语义控制系统协调，最终导致概念的习得。借鉴这种机制，本研究基于脉冲神经网络开发了一种人类概念学习的计算模型。通过有效地解决多源数据和维度不平衡的挑战，该模型能够模拟人类概念习得的过程。",
    "tldr": "本研究开发了一种基于脉冲神经网络的人类概念学习计算模型，该模型借鉴了多感官表示和文本导出的机制，并通过语义控制系统协调两种类型的表示，从而模拟了人类概念习得的过程。",
    "en_tdlr": "This study develops a human-like computational model for concept learning based on spiking neural networks, which draws inspiration from the mechanisms of multisensory representation and text-derived representation and simulates the process of human concept acquisition by coordinating these two types of representations with a semantic control system."
}