{
    "title": "General duality and dual attainment for adapted transport. (arXiv:2401.11958v1 [math.PR])",
    "abstract": "We investigate duality and existence of dual optimizers for several adapted optimal transport problems under minimal assumptions. This includes the causal and bicausal transport, the barycenter problem, and a general multimarginal problem incorporating causality constraints. Moreover, we discuss applications of our results in robust finance. We consider a non-dominated model of several financial markets where stocks are traded dynamically, but the joint stock dynamics are unknown. We show that a no-arbitrage assumption in a quasi-sure sense naturally leads to sets of multicausal couplings. Consequently, computing the robust superhedging price is equivalent to solving an adapted transport problem, and finding a superhedging strategy means solving the corresponding dual.",
    "link": "http://arxiv.org/abs/2401.11958",
    "context": "Title: General duality and dual attainment for adapted transport. (arXiv:2401.11958v1 [math.PR])\nAbstract: We investigate duality and existence of dual optimizers for several adapted optimal transport problems under minimal assumptions. This includes the causal and bicausal transport, the barycenter problem, and a general multimarginal problem incorporating causality constraints. Moreover, we discuss applications of our results in robust finance. We consider a non-dominated model of several financial markets where stocks are traded dynamically, but the joint stock dynamics are unknown. We show that a no-arbitrage assumption in a quasi-sure sense naturally leads to sets of multicausal couplings. Consequently, computing the robust superhedging price is equivalent to solving an adapted transport problem, and finding a superhedging strategy means solving the corresponding dual.",
    "path": "papers/24/01/2401.11958.json",
    "total_tokens": 787,
    "translated_title": "符合适应性运输的普遍性对偶和对偶达成的研究",
    "translated_abstract": "我们在最小的假设下，研究了多个适应性最优运输问题的对偶性和对偶优化器的存在性。这包括因果和双因果运输、几何中心问题以及包含因果约束的一般多边缘问题。此外，我们还讨论了我们结果在强健金融中的应用。我们考虑了一个非支配模型的多个金融市场，在这些市场中，股票是动态交易的，但是联合股票动态是未知的。我们证明了在准确有利的意义下无套利假设自然地导致了多因果耦合的集合。因此，计算强健超对冲价格等同于解决一个适应性运输问题，而找到超对冲策略意味着解决相应的对偶问题。",
    "tldr": "本文研究了多个适应性最优运输问题的对偶性和对偶优化器的存在性，在强健金融中的应用是其中的一大关注点。",
    "en_tdlr": "This paper investigates the duality and existence of dual optimizers for various adapted optimal transport problems. It also discusses the application of these results in robust finance, particularly in the context of no-arbitrage assumption and superhedging strategy."
}