{
    "title": "LADDER: Revisiting the Cosmic Distance Ladder with Deep Learning Approaches and Exploring its Applications. (arXiv:2401.17029v1 [astro-ph.CO])",
    "abstract": "We investigate the prospect of reconstructing the ``cosmic distance ladder'' of the Universe using a novel deep learning framework called LADDER - Learning Algorithm for Deep Distance Estimation and Reconstruction. LADDER is trained on the apparent magnitude data from the Pantheon Type Ia supernovae compilation, incorporating the full covariance information among data points, to produce predictions along with corresponding errors. After employing several validation tests with a number of deep learning models, we pick LADDER as the best performing one. We then demonstrate applications of our method in the cosmological context, that include serving as a model-independent tool for consistency checks for other datasets like baryon acoustic oscillations, calibration of high-redshift datasets such as gamma ray bursts, use as a model-independent mock catalog generator for future probes, etc. Our analysis advocates for interesting yet cautious consideration of machine learning applications in ",
    "link": "http://arxiv.org/abs/2401.17029",
    "context": "Title: LADDER: Revisiting the Cosmic Distance Ladder with Deep Learning Approaches and Exploring its Applications. (arXiv:2401.17029v1 [astro-ph.CO])\nAbstract: We investigate the prospect of reconstructing the ``cosmic distance ladder'' of the Universe using a novel deep learning framework called LADDER - Learning Algorithm for Deep Distance Estimation and Reconstruction. LADDER is trained on the apparent magnitude data from the Pantheon Type Ia supernovae compilation, incorporating the full covariance information among data points, to produce predictions along with corresponding errors. After employing several validation tests with a number of deep learning models, we pick LADDER as the best performing one. We then demonstrate applications of our method in the cosmological context, that include serving as a model-independent tool for consistency checks for other datasets like baryon acoustic oscillations, calibration of high-redshift datasets such as gamma ray bursts, use as a model-independent mock catalog generator for future probes, etc. Our analysis advocates for interesting yet cautious consideration of machine learning applications in ",
    "path": "papers/24/01/2401.17029.json",
    "total_tokens": 962,
    "translated_title": "LADDER: 深度学习方法重新探索宇宙距离梯度并探索其应用",
    "translated_abstract": "我们通过一种名为LADDER（深度学习算法用于距离估计和重建）的新颖深度学习框架，研究了使用“宇宙距离梯度”重建宇宙的前景。LADDER使用了来自Pantheon Type Ia超新星编译的视星等数据，并将数据点之间的全部协方差信息进行了融合，以生成具有相应误差的预测结果。通过对多个深度学习模型进行了多个验证实验后，我们选择了表现最佳的LADDER模型。然后，我们演示了我们的方法在宇宙学上的应用，包括作为独立于模型的一致性检查工具，用于其他数据集（如重子声学振荡）的校准，用于高红移数据集（如伽玛射线暴）的校准，以及用作未来探测的独立于模型的模拟目录生成器等等。我们的分析给出了关于在机器学习应用中要进行有趣而谨慎的考虑的支持。",
    "tldr": "LADDER是一个新颖的深度学习框架，通过学习宇宙的“距离梯度”，实现了预测宇宙距离并探索了多个宇宙学应用。这项研究表明在机器学习应用中需要进行有趣但谨慎的考虑。",
    "en_tdlr": "LADDER is a novel deep learning framework that predicts cosmic distances and explores various cosmological applications by learning the \"distance ladder\" of the Universe. This study highlights the need for interesting yet cautious considerations in machine learning applications."
}