{
    "title": "Relationship between work-family balance, employee well-being and job performance. (arXiv:2401.13683v1 [econ.GN])",
    "abstract": "Purpose: To assess the impact of the existence of and access to different work-family policies on employee well-being and job performance.  Design-methodology-approach: Hypothesis testing was performed using a structural equation model based on a PLS-SEM approach applied to a sample of 1,511 employees of the Spanish banking sector.  Findings: The results obtained demonstrate that the existence and true access to different types of work-family policies such as flexible working hours (flexi-time), long leaves, and flexible work location (flexi-place) are not directly related to job performance, but indirectly so, when mediated by the well-being of employees generated by work-family policies. In a similar vein, true access to employee and family support services also has an indirect positive impact on job performance mediated by the well-being produced. In contrast, the mere existence of employee and family support services does not have any direct or indirect effect on job performance.  ",
    "link": "http://arxiv.org/abs/2401.13683",
    "context": "Title: Relationship between work-family balance, employee well-being and job performance. (arXiv:2401.13683v1 [econ.GN])\nAbstract: Purpose: To assess the impact of the existence of and access to different work-family policies on employee well-being and job performance.  Design-methodology-approach: Hypothesis testing was performed using a structural equation model based on a PLS-SEM approach applied to a sample of 1,511 employees of the Spanish banking sector.  Findings: The results obtained demonstrate that the existence and true access to different types of work-family policies such as flexible working hours (flexi-time), long leaves, and flexible work location (flexi-place) are not directly related to job performance, but indirectly so, when mediated by the well-being of employees generated by work-family policies. In a similar vein, true access to employee and family support services also has an indirect positive impact on job performance mediated by the well-being produced. In contrast, the mere existence of employee and family support services does not have any direct or indirect effect on job performance.  ",
    "path": "papers/24/01/2401.13683.json",
    "total_tokens": 841,
    "translated_title": "工作与家庭平衡、员工福祉和工作表现之间的关系",
    "translated_abstract": "目的：评估不同工作与家庭政策的存在和使用对员工福祉和工作表现的影响。 方法：采用基于PLS-SEM方法的结构方程模型进行假设检验，样本为西班牙银行业的1,511名员工。 结果：所得结果表明，弹性工作时间、长期休假和弹性工作地点等不同类型的工作与家庭政策的存在和真正使用与工作表现没有直接关联，但通过员工由工作与家庭政策产生的福祉来间接影响工作表现。同样，员工和家庭支持服务的真正使用也通过产生的福祉对工作表现产生间接积极影响。相反，仅有员工和家庭支持服务的存在对工作表现没有任何直接或间接影响。",
    "tldr": "本研究评估了不同工作与家庭政策的存在和使用对员工福祉和工作表现的影响，结果显示这些政策通过员工的福祉间接影响工作表现。"
}