{
    "title": "Prediction of multitasking performance post-longitudinal tDCS via EEG-based functional connectivity and machine learning methods",
    "abstract": "Predicting and understanding the changes in cognitive performance, especially after a longitudinal intervention, is a fundamental goal in neuroscience. Longitudinal brain stimulation-based interventions like transcranial direct current stimulation (tDCS) induce short-term changes in the resting membrane potential and influence cognitive processes. However, very little research has been conducted on predicting these changes in cognitive performance post-intervention. In this research, we intend to address this gap in the literature by employing different EEG-based functional connectivity analyses and machine learning algorithms to predict changes in cognitive performance in a complex multitasking task. Forty subjects were divided into experimental and active-control conditions. On Day 1, all subjects executed a multitasking task with simultaneous 32-channel EEG being acquired. From Day 2 to Day 7, subjects in the experimental condition undertook 15 minutes of 2mA anodal tDCS stimulation",
    "link": "https://arxiv.org/abs/2401.17711",
    "context": "Title: Prediction of multitasking performance post-longitudinal tDCS via EEG-based functional connectivity and machine learning methods\nAbstract: Predicting and understanding the changes in cognitive performance, especially after a longitudinal intervention, is a fundamental goal in neuroscience. Longitudinal brain stimulation-based interventions like transcranial direct current stimulation (tDCS) induce short-term changes in the resting membrane potential and influence cognitive processes. However, very little research has been conducted on predicting these changes in cognitive performance post-intervention. In this research, we intend to address this gap in the literature by employing different EEG-based functional connectivity analyses and machine learning algorithms to predict changes in cognitive performance in a complex multitasking task. Forty subjects were divided into experimental and active-control conditions. On Day 1, all subjects executed a multitasking task with simultaneous 32-channel EEG being acquired. From Day 2 to Day 7, subjects in the experimental condition undertook 15 minutes of 2mA anodal tDCS stimulation",
    "path": "papers/24/01/2401.17711.json",
    "total_tokens": 826,
    "translated_title": "使用基于脑电功能连接和机器学习方法预测经过长期tDCS干预的多任务表现",
    "translated_abstract": "预测和理解认知表现的变化，特别是在长期干预之后，是神经科学的一个基本目标。纵向基于脑刺激的干预方法，如经皮直流电刺激（tDCS），会引起静息膜电位的短期变化，并影响认知过程。然而，目前对于预测干预后认知表现变化的研究很少。本研究旨在通过采用不同的基于脑电功能连接分析和机器学习算法，预测复杂多任务任务中认知表现的变化，来填补文献中的这一空白。将40名受试者分为实验组和主动对照组。在第一天，所有受试者执行了一个多任务任务，并同时获取到32通道的脑电信号。从第二天到第七天，实验组受试者进行了15分钟的2mA阴极tDCS刺激。",
    "tldr": "本研究使用脑电功能连接和机器学习方法，预测经过长期tDCS干预后的多任务认知表现的变化。",
    "en_tdlr": "This study predicts changes in multitasking cognitive performance after long-term tDCS intervention using EEG-based functional connectivity and machine learning methods."
}