{
    "title": "PPBFL: A Privacy Protected Blockchain-based Federated Learning Model. (arXiv:2401.01204v1 [cs.CR])",
    "abstract": "With the rapid development of machine learning and growing concerns about data privacy, federated learning has become an increasingly prominent focus. However, challenges such as attacks on model parameters and the lack of incentive mechanisms hinder the effectiveness of federated learning. Therefore, we propose a Privacy Protected Blockchain-based Federated Learning Model (PPBFL) to enhance the security of federated learning and promote the active participation of nodes in model training. Blockchain ensures that model parameters stored in the InterPlanetary File System (IPFS) remain unaltered. A novel adaptive differential privacy addition algorithm is simultaneously applied to local and global models, preserving the privacy of local models and preventing a decrease in the security of the global model due to the presence of numerous local models in federated learning. Additionally, we introduce a new mix transactions mechanism to better protect the identity privacy of local training c",
    "link": "http://arxiv.org/abs/2401.01204",
    "context": "Title: PPBFL: A Privacy Protected Blockchain-based Federated Learning Model. (arXiv:2401.01204v1 [cs.CR])\nAbstract: With the rapid development of machine learning and growing concerns about data privacy, federated learning has become an increasingly prominent focus. However, challenges such as attacks on model parameters and the lack of incentive mechanisms hinder the effectiveness of federated learning. Therefore, we propose a Privacy Protected Blockchain-based Federated Learning Model (PPBFL) to enhance the security of federated learning and promote the active participation of nodes in model training. Blockchain ensures that model parameters stored in the InterPlanetary File System (IPFS) remain unaltered. A novel adaptive differential privacy addition algorithm is simultaneously applied to local and global models, preserving the privacy of local models and preventing a decrease in the security of the global model due to the presence of numerous local models in federated learning. Additionally, we introduce a new mix transactions mechanism to better protect the identity privacy of local training c",
    "path": "papers/24/01/2401.01204.json",
    "total_tokens": 940,
    "translated_title": "PPBFL: 一种隐私保护的基于区块链的联邦学习模型",
    "translated_abstract": "随着机器学习的快速发展和对数据隐私的日益关注，联邦学习成为一个越来越突出的焦点。然而，模型参数攻击和缺乏激励机制等挑战阻碍了联邦学习的有效性。因此，我们提出了一种隐私保护的基于区块链的联邦学习模型（PPBFL），以增强联邦学习的安全性并促进节点在模型训练中的积极参与。区块链确保了存储在星际文件系统（IPFS）中的模型参数不被篡改。同时，我们采用了一种新颖的自适应差分隐私添加算法，同时应用于本地模型和全局模型，保护本地模型的隐私同时防止因联邦学习中存在大量本地模型而降低全局模型的安全性。此外，我们引入了一个新的交易混合机制，以更好地保护本地训练的身份隐私。",
    "tldr": "PPBFL是一种隐私保护的基于区块链的联邦学习模型，通过应用区块链和自适应差分隐私添加算法，增强了联邦学习的安全性和节点的积极参与。同时引入了交易混合机制，更好地保护本地训练的身份隐私。",
    "en_tdlr": "PPBFL is a privacy protected blockchain-based federated learning model that enhances the security of federated learning and promotes active participation of nodes in model training. It incorporates blockchain and adaptive differential privacy addition algorithm to preserve privacy while introducing a mix transactions mechanism to protect identity privacy."
}