{
    "title": "End-To-End Planning of Autonomous Driving in Industry and Academia: 2022-2023. (arXiv:2401.08658v1 [cs.RO])",
    "abstract": "This paper aims to provide a quick review of the methods including the technologies in detail that are currently reported in industry and academia. Specifically, this paper reviews the end-to-end planning, including Tesla FSD V12, Momenta 2023, Horizon Robotics 2023, Motional RoboTaxi 2022, Woven Planet (Toyota): Urban Driver, and Nvidia. In addition, we review the state-of-the-art academic studies that investigate end-to-end planning of autonomous driving. This paper provides readers with a concise structure and fast learning of state-of-the-art end-to-end planning for 2022-2023. This article provides a meaningful overview as introductory material for beginners to follow the state-of-the-art end-to-end planning of autonomous driving in industry and academia, as well as supplementary material for advanced researchers.",
    "link": "http://arxiv.org/abs/2401.08658",
    "context": "Title: End-To-End Planning of Autonomous Driving in Industry and Academia: 2022-2023. (arXiv:2401.08658v1 [cs.RO])\nAbstract: This paper aims to provide a quick review of the methods including the technologies in detail that are currently reported in industry and academia. Specifically, this paper reviews the end-to-end planning, including Tesla FSD V12, Momenta 2023, Horizon Robotics 2023, Motional RoboTaxi 2022, Woven Planet (Toyota): Urban Driver, and Nvidia. In addition, we review the state-of-the-art academic studies that investigate end-to-end planning of autonomous driving. This paper provides readers with a concise structure and fast learning of state-of-the-art end-to-end planning for 2022-2023. This article provides a meaningful overview as introductory material for beginners to follow the state-of-the-art end-to-end planning of autonomous driving in industry and academia, as well as supplementary material for advanced researchers.",
    "path": "papers/24/01/2401.08658.json",
    "total_tokens": 985,
    "translated_title": "工业和学术界中的自动驾驶端到端规划：2022-2023年的综述",
    "translated_abstract": "本文旨在对目前在工业和学术界报告的包括详细技术在内的方法进行快速回顾。具体而言，本文回顾了包括特斯拉FSD V12、Momenta 2023、Horizon Robotics 2023、Motional RoboTaxi 2022、Woven Planet（丰田）：城市驾驶员和Nvidia在内的端到端规划。此外，我们还回顾了调查自动驾驶端到端规划的最新学术研究。本文提供了2022-2023年端到端规划的最新结构和快速学习，为初学者提供了入门材料，供其了解工业和学术界中的端到端自动驾驶规划的最新发展，同时也为高级研究人员提供了补充资料。",
    "tldr": "这篇论文总结了工业和学术界中的自动驾驶端到端规划方法，包括特斯拉FSD V12、Momenta 2023、Horizon Robotics 2023、Motional RoboTaxi 2022、Woven Planet（丰田）：城市驾驶员和Nvidia，并回顾了最新的学术研究。这篇文章提供了2022-2023年端到端规划的最新结构和快速学习，并适用于初学者和高级研究人员。",
    "en_tdlr": "This paper provides a comprehensive review of the methods and technologies in end-to-end planning of autonomous driving in industry and academia, including Tesla FSD V12, Momenta 2023, Horizon Robotics 2023, Motional RoboTaxi 2022, Woven Planet (Toyota): Urban Driver, and Nvidia. It also discusses the latest academic research in this area. The paper serves as a valuable resource for beginners and advanced researchers, offering a concise structure and fast learning of the state-of-the-art end-to-end planning for 2022-2023."
}