{
    "title": "DNA Sequence Classification with Compressors. (arXiv:2401.14025v1 [q-bio.GN])",
    "abstract": "Recent studies in DNA sequence classification have leveraged sophisticated machine learning techniques, achieving notable accuracy in categorizing complex genomic data. Among these, methods such as k-mer counting have proven effective in distinguishing sequences from varied species like chimpanzees, dogs, and humans, becoming a staple in contemporary genomic research. However, these approaches often demand extensive computational resources, posing a challenge in terms of scalability and efficiency. Addressing this issue, our study introduces a novel adaptation of Jiang et al.'s compressor-based, parameter-free classification method, specifically tailored for DNA sequence analysis. This innovative approach utilizes a variety of compression algorithms, such as Gzip, Brotli, and LZMA, to efficiently process and classify genomic sequences. Not only does this method align with the current state-of-the-art in terms of accuracy, but it also offers a more resource-efficient alternative to trad",
    "link": "http://arxiv.org/abs/2401.14025",
    "context": "Title: DNA Sequence Classification with Compressors. (arXiv:2401.14025v1 [q-bio.GN])\nAbstract: Recent studies in DNA sequence classification have leveraged sophisticated machine learning techniques, achieving notable accuracy in categorizing complex genomic data. Among these, methods such as k-mer counting have proven effective in distinguishing sequences from varied species like chimpanzees, dogs, and humans, becoming a staple in contemporary genomic research. However, these approaches often demand extensive computational resources, posing a challenge in terms of scalability and efficiency. Addressing this issue, our study introduces a novel adaptation of Jiang et al.'s compressor-based, parameter-free classification method, specifically tailored for DNA sequence analysis. This innovative approach utilizes a variety of compression algorithms, such as Gzip, Brotli, and LZMA, to efficiently process and classify genomic sequences. Not only does this method align with the current state-of-the-art in terms of accuracy, but it also offers a more resource-efficient alternative to trad",
    "path": "papers/24/01/2401.14025.json",
    "total_tokens": 851,
    "translated_title": "DNA序列压缩器分类",
    "translated_abstract": "最近的DNA序列分类研究借鉴了复杂的机器学习技术，在对复杂的基因组数据进行分类时取得了显著的准确性。其中，像k-mer计数这样的方法已被证明在区分类似黑猩猩、狗和人类等不同物种的序列方面非常有效，在当代基因组研究中已经成为常用方法。然而，这些方法通常需要大量的计算资源，在可扩展性和效率方面面临挑战。为了解决这个问题，我们的研究引入了江等人基于压缩器的无参数分类方法的新型改进，专门用于DNA序列分析。这种创新方法利用多种压缩算法（如Gzip、Brotli和LZMA）来高效处理和分类基因组序列。这种方法不仅在准确性方面与现有技术保持一致，而且还提供了一种更加资源高效的替代方案。",
    "tldr": "该论文介绍了一种专门用于DNA序列分析的新型分类方法，该方法利用压缩算法高效处理和分类基因组序列。这种方法不仅准确性高，而且比传统方法更节省计算资源。",
    "en_tdlr": "This paper presents a novel classification method specifically designed for DNA sequence analysis, which utilizes compression algorithms to efficiently process and classify genomic sequences. This method offers high accuracy and saves computational resources compared to traditional approaches."
}