{
    "title": "Null Space Properties of Neural Networks with Applications to Image Steganography. (arXiv:2401.10262v1 [cs.CV])",
    "abstract": "This paper explores the null space properties of neural networks. We extend the null space definition from linear to nonlinear maps and discuss the presence of a null space in neural networks. The null space of a given neural network can tell us the part of the input data that makes no contribution to the final prediction so that we can use it to trick the neural network. This reveals an inherent weakness in neural networks that can be exploited. One application described here leads to a method of image steganography. Through experiments on image datasets such as MNIST, we show that we can use null space components to force the neural network to choose a selected hidden image class, even though the overall image can be made to look like a completely different image. We conclude by showing comparisons between what a human viewer would see, and the part of the image that the neural network is actually using to make predictions and, hence, show that what the neural network ``sees'' is com",
    "link": "http://arxiv.org/abs/2401.10262",
    "context": "Title: Null Space Properties of Neural Networks with Applications to Image Steganography. (arXiv:2401.10262v1 [cs.CV])\nAbstract: This paper explores the null space properties of neural networks. We extend the null space definition from linear to nonlinear maps and discuss the presence of a null space in neural networks. The null space of a given neural network can tell us the part of the input data that makes no contribution to the final prediction so that we can use it to trick the neural network. This reveals an inherent weakness in neural networks that can be exploited. One application described here leads to a method of image steganography. Through experiments on image datasets such as MNIST, we show that we can use null space components to force the neural network to choose a selected hidden image class, even though the overall image can be made to look like a completely different image. We conclude by showing comparisons between what a human viewer would see, and the part of the image that the neural network is actually using to make predictions and, hence, show that what the neural network ``sees'' is com",
    "path": "papers/24/01/2401.10262.json",
    "total_tokens": 857,
    "translated_title": "神经网络的零空间特性及其在图像隐写术中的应用",
    "translated_abstract": "本文研究了神经网络的零空间特性。我们将零空间定义从线性映射扩展到非线性映射，并讨论了神经网络中零空间的存在。给定神经网络的零空间可以告诉我们哪些输入数据对最终预测没有任何贡献，从而可以利用它来欺骗神经网络。这揭示了神经网络中的固有弱点，可以被利用。本文描述了一个应用，即图像隐写术的方法。通过在诸如MNIST之类的图像数据集上进行实验证明，我们可以使用零空间成分来强制神经网络选择所选的隐藏图像类，即使整体图像看起来完全不同。最后，我们通过显示人类观察者能够看到的内容与神经网络用于进行预测的图像部分之间的比较，展示了神经网络的“观测”情况。",
    "tldr": "本文研究了神经网络的零空间特性，发现了神经网络的固有弱点，并针对此弱点提出了一种图像隐写术方法。"
}