{
    "title": "Offline Handwriting Signature Verification: A Transfer Learning and Feature Selection Approach. (arXiv:2401.09467v1 [cs.CV])",
    "abstract": "Handwritten signature verification poses a formidable challenge in biometrics and document authenticity. The objective is to ascertain the authenticity of a provided handwritten signature, distinguishing between genuine and forged ones. This issue has many applications in sectors such as finance, legal documentation, and security. Currently, the field of computer vision and machine learning has made significant progress in the domain of handwritten signature verification. The outcomes, however, may be enhanced depending on the acquired findings, the structure of the datasets, and the used models. Four stages make up our suggested strategy. First, we collected a large dataset of 12600 images from 420 distinct individuals, and each individual has 30 signatures of a certain kind (All authors signatures are genuine). In the subsequent stage, the best features from each image were extracted using a deep learning model named MobileNetV2. During the feature selection step, three selectors nei",
    "link": "http://arxiv.org/abs/2401.09467",
    "context": "Title: Offline Handwriting Signature Verification: A Transfer Learning and Feature Selection Approach. (arXiv:2401.09467v1 [cs.CV])\nAbstract: Handwritten signature verification poses a formidable challenge in biometrics and document authenticity. The objective is to ascertain the authenticity of a provided handwritten signature, distinguishing between genuine and forged ones. This issue has many applications in sectors such as finance, legal documentation, and security. Currently, the field of computer vision and machine learning has made significant progress in the domain of handwritten signature verification. The outcomes, however, may be enhanced depending on the acquired findings, the structure of the datasets, and the used models. Four stages make up our suggested strategy. First, we collected a large dataset of 12600 images from 420 distinct individuals, and each individual has 30 signatures of a certain kind (All authors signatures are genuine). In the subsequent stage, the best features from each image were extracted using a deep learning model named MobileNetV2. During the feature selection step, three selectors nei",
    "path": "papers/24/01/2401.09467.json",
    "total_tokens": 837,
    "translated_title": "离线手写签名验证：一种迁移学习和特征选择方法",
    "translated_abstract": "手写签名验证在生物识别和文件真实性方面具有一定挑战。目标是确定提供的手写签名的真实性，区分真实的和伪造的签名。这个问题在金融、法律文件和安全等领域有很多应用。目前，计算机视觉和机器学习在手写签名验证领域取得了显著进展。然而，根据获取的结果、数据集的结构和所使用的模型，结果可能会有所改善。我们提出的策略包括四个阶段。首先，我们从420个不同个体中收集了12600张图片的大型数据集，每个个体有30个特定类型的签名（所有作者的签名都是真实的）。在后续阶段，使用一个称为MobileNetV2的深度学习模型提取了每张图片中的最好特征。在特征选择步骤中，使用了三个选择器。",
    "tldr": "这篇论文介绍了一种离线手写签名验证的方法，通过迁移学习和特征选择来提高验证结果，在金融、法律文件和安全等领域有广泛应用。",
    "en_tdlr": "This paper presents an approach for offline handwriting signature verification using transfer learning and feature selection, aiming to improve the verification results with applications in finance, legal documentation, and security."
}