{
    "title": "Widely Linear Matched Filter: A Lynchpin towards the Interpretability of Complex-valued CNNs. (arXiv:2401.16729v1 [cs.LG])",
    "abstract": "A recent study on the interpretability of real-valued convolutional neural networks (CNNs) \\cite{Stankovic_Mandic_2023CNN} has revealed a direct and physically meaningful link with the task of finding features in data through matched filters. However, applying this paradigm to illuminate the interpretability of complex-valued CNNs meets a formidable obstacle: the extension of matched filtering to a general class of noncircular complex-valued data, referred to here as the widely linear matched filter (WLMF), has been only implicit in the literature. To this end, to establish the interpretability of the operation of complex-valued CNNs, we introduce a general WLMF paradigm, provide its solution and undertake analysis of its performance. For rigor, our WLMF solution is derived without imposing any assumption on the probability density of noise. The theoretical advantages of the WLMF over its standard strictly linear counterpart (SLMF) are provided in terms of their output signal-to-noise-",
    "link": "http://arxiv.org/abs/2401.16729",
    "context": "Title: Widely Linear Matched Filter: A Lynchpin towards the Interpretability of Complex-valued CNNs. (arXiv:2401.16729v1 [cs.LG])\nAbstract: A recent study on the interpretability of real-valued convolutional neural networks (CNNs) \\cite{Stankovic_Mandic_2023CNN} has revealed a direct and physically meaningful link with the task of finding features in data through matched filters. However, applying this paradigm to illuminate the interpretability of complex-valued CNNs meets a formidable obstacle: the extension of matched filtering to a general class of noncircular complex-valued data, referred to here as the widely linear matched filter (WLMF), has been only implicit in the literature. To this end, to establish the interpretability of the operation of complex-valued CNNs, we introduce a general WLMF paradigm, provide its solution and undertake analysis of its performance. For rigor, our WLMF solution is derived without imposing any assumption on the probability density of noise. The theoretical advantages of the WLMF over its standard strictly linear counterpart (SLMF) are provided in terms of their output signal-to-noise-",
    "path": "papers/24/01/2401.16729.json",
    "total_tokens": 978,
    "translated_title": "广义线性匹配滤波器：实现复杂值CNN可解释性之关键",
    "translated_abstract": "最近关于实值卷积神经网络（CNNs）可解释性的研究揭示了通过匹配滤波器在数据中找到特征的任务与其直接和有物理含义的联系。然而，将这一范式应用于揭示复杂值CNNs可解释性遇到了一个巨大的障碍：广义非循环复杂值数据的匹配滤波器扩展，即广义线性匹配滤波器（WLMF），在文献中仅仅是隐含的。为了实现复杂值CNNs操作的可解释性，我们引入了一种广义WLMF范例，提供了解决方案并对其性能进行了分析。为了保证严谨性，我们的WLMF解决方案不对噪声的概率密度做任何假设。WLMF在输出信噪比方面相对于其标准严格线性对应物（SLMF）的理论优势被提供。",
    "tldr": "本研究提出了广义线性匹配滤波器（WLMF）范例来实现复杂值CNN的可解释性，解决了在复杂值数据中匹配滤波的难题，并分析了其性能。与标准线性对应物（SLMF）相比，WLMF在输出信噪比方面具有理论上的优势。",
    "en_tdlr": "This study proposes a paradigm of widely linear matched filter (WLMF) to achieve interpretability of complex-valued convolutional neural networks (CNNs), addressing the challenge of matched filtering in complex-valued data and analyzing its performance. WLMF shows theoretical advantages over its standard linear counterpart (SLMF) in terms of output signal-to-noise ratio."
}