{
    "title": "Can A Cognitive Architecture Fundamentally Enhance LLMs? Or Vice Versa?. (arXiv:2401.10444v1 [cs.AI])",
    "abstract": "The paper discusses what is needed to address the limitations of current LLM-centered AI systems. The paper argues that incorporating insights from human cognition and psychology, as embodied by a computational cognitive architecture, can help develop systems that are more capable, more reliable, and more human-like. It emphasizes the importance of the dual-process architecture and the hybrid neuro-symbolic approach in addressing the limitations of current LLMs. In the opposite direction, the paper also highlights the need for an overhaul of computational cognitive architectures to better reflect advances in AI and computing technology. Overall, the paper advocates for a multidisciplinary, mutually beneficial approach towards developing better models both for AI and for understanding the human mind.",
    "link": "http://arxiv.org/abs/2401.10444",
    "context": "Title: Can A Cognitive Architecture Fundamentally Enhance LLMs? Or Vice Versa?. (arXiv:2401.10444v1 [cs.AI])\nAbstract: The paper discusses what is needed to address the limitations of current LLM-centered AI systems. The paper argues that incorporating insights from human cognition and psychology, as embodied by a computational cognitive architecture, can help develop systems that are more capable, more reliable, and more human-like. It emphasizes the importance of the dual-process architecture and the hybrid neuro-symbolic approach in addressing the limitations of current LLMs. In the opposite direction, the paper also highlights the need for an overhaul of computational cognitive architectures to better reflect advances in AI and computing technology. Overall, the paper advocates for a multidisciplinary, mutually beneficial approach towards developing better models both for AI and for understanding the human mind.",
    "path": "papers/24/01/2401.10444.json",
    "total_tokens": 854,
    "translated_title": "一个新的认知架构是否可以根本改进LLMs？反之亦然。",
    "translated_abstract": "本文讨论了解决当前以LLM为中心的人工智能系统的局限性所需的条件。文章认为，吸收人类认知和心理学方面的见解，并应用计算认知架构，可以开发出更加能力强、可靠性更高、更接近人类的系统。文中强调了双过程架构和混合神经符号方法在解决当前LLMs的局限性方面的重要性。同时，文章也强调了需要对计算认知架构进行改革，以更好地反映人工智能和计算技术的进步。总体而言，本文主张采用多学科、互惠互利的方法来开发更好的AI模型和理解人类心灵。",
    "tldr": "本文讨论了如何通过引入计算认知架构来改进现有的LLMs，并强调了双过程架构和混合神经符号方法的重要性。同时，文章也指出需要改革计算认知架构以适应人工智能和计算技术的进步。总体而言，本文主张采用多学科、互惠互利的方法来开发更好的AI模型和理解人类心灵。",
    "en_tdlr": "This paper discusses how to improve current LLMs by incorporating computational cognitive architectures and emphasizes the importance of the dual-process architecture and hybrid neuro-symbolic approach. It also highlights the need for reforming computational cognitive architectures to reflect advances in AI and computing technology. Overall, the paper advocates for a multidisciplinary, mutually beneficial approach to develop better AI models and understand the human mind."
}