{
    "title": "REE-HDSC: Recognizing Extracted Entities for the Historical Database Suriname Curacao. (arXiv:2401.02972v1 [cs.CL])",
    "abstract": "We describe the project REE-HDSC and outline our efforts to improve the quality of named entities extracted automatically from texts generated by hand-written text recognition (HTR) software. We describe a six-step processing pipeline and test it by processing 19th and 20th century death certificates from the civil registry of Curacao. We find that the pipeline extracts dates with high precision but that the precision of person name extraction is low. Next we show how name precision extraction can be improved by retraining HTR models with names, post-processing and by identifying and removing incorrect names.",
    "link": "http://arxiv.org/abs/2401.02972",
    "context": "Title: REE-HDSC: Recognizing Extracted Entities for the Historical Database Suriname Curacao. (arXiv:2401.02972v1 [cs.CL])\nAbstract: We describe the project REE-HDSC and outline our efforts to improve the quality of named entities extracted automatically from texts generated by hand-written text recognition (HTR) software. We describe a six-step processing pipeline and test it by processing 19th and 20th century death certificates from the civil registry of Curacao. We find that the pipeline extracts dates with high precision but that the precision of person name extraction is low. Next we show how name precision extraction can be improved by retraining HTR models with names, post-processing and by identifying and removing incorrect names.",
    "path": "papers/24/01/2401.02972.json",
    "total_tokens": 816,
    "translated_title": "REE-HDSC: 识别历史数据库Suriname Curacao中提取的实体",
    "translated_abstract": "我们描述了REE-HDSC项目，并概述了我们努力提高手写文本识别（HTR）软件生成的文本自动提取的命名实体质量的工作。我们描述了一个六步处理流程，并通过处理库拉索民事登记处的19世纪和20世纪死亡证书进行测试。我们发现该流水线提取的日期具有高精度，但人名提取的精度较低。接下来，我们展示了如何通过重新训练含有名字的HTR模型、后处理以及识别和删除不正确的名字来改善名字提取的精度。",
    "tldr": "本文介绍了REE-HDSC项目，旨在改进手写文本识别软件自动提取的命名实体的质量。通过六步处理流程，我们测试了该流程在处理库拉索民事登记处的19世纪和20世纪死亡证书时，日期提取具有高精度，人名提取的精度较低。我们提出了通过重新训练HTR模型、后处理和识别删除不正确的名字来提高人名提取精度的方法。",
    "en_tdlr": "This paper presents the REE-HDSC project, aiming to improve the quality of automatically extracted named entities from hand-written text recognition software. Through a six-step processing pipeline, the precision of date extraction is high while the precision of person name extraction is low. The authors propose methods to enhance person name extraction precision by retraining HTR models, post-processing, and identifying and removing incorrect names."
}