{
    "title": "Query Exposure Prediction for Groups of Documents in Rankings. (arXiv:2401.13434v1 [cs.IR])",
    "abstract": "The main objective of an Information Retrieval system is to provide a user with the most relevant documents to the user's query. To do this, modern IR systems typically deploy a re-ranking pipeline in which a set of documents is retrieved by a lightweight first-stage retrieval process and then re-ranked by a more effective but expensive model. However, the success of a re-ranking pipeline is heavily dependent on the performance of the first stage retrieval, since new documents are not usually identified during the re-ranking stage. Moreover, this can impact the amount of exposure that a particular group of documents, such as documents from a particular demographic group, can receive in the final ranking. For example, the fair allocation of exposure becomes more challenging or impossible if the first stage retrieval returns too few documents from certain groups, since the number of group documents in the ranking affects the exposure more than the documents' positions. With this in mind,",
    "link": "http://arxiv.org/abs/2401.13434",
    "context": "Title: Query Exposure Prediction for Groups of Documents in Rankings. (arXiv:2401.13434v1 [cs.IR])\nAbstract: The main objective of an Information Retrieval system is to provide a user with the most relevant documents to the user's query. To do this, modern IR systems typically deploy a re-ranking pipeline in which a set of documents is retrieved by a lightweight first-stage retrieval process and then re-ranked by a more effective but expensive model. However, the success of a re-ranking pipeline is heavily dependent on the performance of the first stage retrieval, since new documents are not usually identified during the re-ranking stage. Moreover, this can impact the amount of exposure that a particular group of documents, such as documents from a particular demographic group, can receive in the final ranking. For example, the fair allocation of exposure becomes more challenging or impossible if the first stage retrieval returns too few documents from certain groups, since the number of group documents in the ranking affects the exposure more than the documents' positions. With this in mind,",
    "path": "papers/24/01/2401.13434.json",
    "total_tokens": 869,
    "translated_title": "查询排名中的文档组的查询曝光预测",
    "translated_abstract": "信息检索系统的主要目标是向用户提供与用户查询最相关的文档。为了做到这一点，现代的信息检索系统通常会部署一个重新排名的流程，其中一组文档由一个轻量级的第一阶段检索过程检索出来，然后由一个更有效但代价更高的模型进行重新排名。然而，重新排名流程的成功在很大程度上取决于第一阶段检索的性能，因为在重新排名阶段通常不会识别出新的文档。此外，这可能会影响特定组文档在最终排名中接受到的曝光量。例如，如果第一阶段检索返回某些组别的文档太少，公平分配曝光变得更加具有挑战性或不可能，因为在排名中的组文档数量对曝光的影响比文档的位置更大。考虑到这一点，",
    "tldr": "本论文研究了查询排名中文档组的查询曝光预测问题，指出了重新排名流程的成功与第一阶段检索的性能密切相关，并讨论了特定组文档在最终排名中接受曝光量的影响。",
    "en_tdlr": "This paper investigates the problem of query exposure prediction for groups of documents in rankings, highlighting the importance of the performance of the first stage retrieval in the success of the re-ranking process and discussing the impact of the exposure received by specific group documents in the final ranking."
}