{
    "title": "Analyzing COVID-19 Vaccination Sentiments in Nigerian Cyberspace: Insights from a Manually Annotated Twitter Dataset. (arXiv:2401.13133v1 [cs.CL])",
    "abstract": "Numerous successes have been achieved in combating the COVID-19 pandemic, initially using various precautionary measures like lockdowns, social distancing, and the use of face masks. More recently, various vaccinations have been developed to aid in the prevention or reduction of the severity of the COVID-19 infection. Despite the effectiveness of the precautionary measures and the vaccines, there are several controversies that are massively shared on social media platforms like Twitter. In this paper, we explore the use of state-of-the-art transformer-based language models to study people's acceptance of vaccines in Nigeria. We developed a novel dataset by crawling multi-lingual tweets using relevant hashtags and keywords. Our analysis and visualizations revealed that most tweets expressed neutral sentiments about COVID-19 vaccines, with some individuals expressing positive views, and there was no strong preference for specific vaccine types, although Moderna received slightly more pos",
    "link": "http://arxiv.org/abs/2401.13133",
    "context": "Title: Analyzing COVID-19 Vaccination Sentiments in Nigerian Cyberspace: Insights from a Manually Annotated Twitter Dataset. (arXiv:2401.13133v1 [cs.CL])\nAbstract: Numerous successes have been achieved in combating the COVID-19 pandemic, initially using various precautionary measures like lockdowns, social distancing, and the use of face masks. More recently, various vaccinations have been developed to aid in the prevention or reduction of the severity of the COVID-19 infection. Despite the effectiveness of the precautionary measures and the vaccines, there are several controversies that are massively shared on social media platforms like Twitter. In this paper, we explore the use of state-of-the-art transformer-based language models to study people's acceptance of vaccines in Nigeria. We developed a novel dataset by crawling multi-lingual tweets using relevant hashtags and keywords. Our analysis and visualizations revealed that most tweets expressed neutral sentiments about COVID-19 vaccines, with some individuals expressing positive views, and there was no strong preference for specific vaccine types, although Moderna received slightly more pos",
    "path": "papers/24/01/2401.13133.json",
    "total_tokens": 936,
    "translated_title": "在尼日利亚网络空间分析COVID-19疫苗情感：来自手动注释的Twitter数据集的洞察。（arXiv:2401.13133v1[cs.CL]）",
    "translated_abstract": "在抗击COVID-19大流行方面取得了许多成功，最初采用了各种预防措施，如封锁、社交距离和使用口罩。最近，已经开发出了各种疫苗，以帮助预防或减轻COVID-19感染的严重程度。尽管这些预防措施和疫苗的有效性，但在社交媒体平台（如Twitter）上存在一些争议。在本文中，我们利用最先进的基于transformer的语言模型来研究尼日利亚人对疫苗的接受程度。我们通过抓取多语言推文使用相关的标签和关键字开发了一个新颖的数据集。我们的分析和可视化结果显示，大多数推文表达了关于COVID-19疫苗的中立情感，一些人表达了积极的观点，并且没有对特定疫苗类型的强烈偏好，尽管Moderna稍微得到了更多的正面评价。",
    "tldr": "本研究利用transformer-based语言模型研究尼日利亚人对COVID-19疫苗的接受程度，并通过分析和可视化发现大多数推文表达中立情感，没有对特定疫苗类型的强烈偏好。",
    "en_tdlr": "This study investigates the acceptance of COVID-19 vaccines among Nigerians using transformer-based language models, and reveals through analysis and visualization that most tweets express neutral sentiments, with no strong preference for specific vaccine types."
}