{
    "title": "Robust Functional Data Analysis for Stochastic Evolution Equations in Infinite Dimensions. (arXiv:2401.16286v1 [stat.ME])",
    "abstract": "This article addresses the robust measurement of covariations in the context of solutions to stochastic evolution equations in Hilbert spaces using functional data analysis. For such equations, standard techniques for functional data based on cross-sectional covariances are often inadequate for identifying statistically relevant random drivers and detecting outliers since they overlook the interplay between cross-sectional and temporal structures. Therefore, we develop an estimation theory for the continuous quadratic covariation of the latent random driver of the equation instead of a static covariance of the observable solution process. We derive identifiability results under weak conditions, establish rates of convergence and a central limit theorem based on infill asymptotics, and provide long-time asymptotics for estimation of a static covariation of the latent driver. Applied to term structure data, our approach uncovers a fundamental alignment with scaling limits of covariations",
    "link": "http://arxiv.org/abs/2401.16286",
    "context": "Title: Robust Functional Data Analysis for Stochastic Evolution Equations in Infinite Dimensions. (arXiv:2401.16286v1 [stat.ME])\nAbstract: This article addresses the robust measurement of covariations in the context of solutions to stochastic evolution equations in Hilbert spaces using functional data analysis. For such equations, standard techniques for functional data based on cross-sectional covariances are often inadequate for identifying statistically relevant random drivers and detecting outliers since they overlook the interplay between cross-sectional and temporal structures. Therefore, we develop an estimation theory for the continuous quadratic covariation of the latent random driver of the equation instead of a static covariance of the observable solution process. We derive identifiability results under weak conditions, establish rates of convergence and a central limit theorem based on infill asymptotics, and provide long-time asymptotics for estimation of a static covariation of the latent driver. Applied to term structure data, our approach uncovers a fundamental alignment with scaling limits of covariations",
    "path": "papers/24/01/2401.16286.json",
    "total_tokens": 875,
    "translated_title": "无限维度中随机演化方程的稳健函数数据分析",
    "translated_abstract": "本文针对Hilbert空间中的随机演化方程，使用函数数据分析技术来稳健地测量协变量的变化。对于这样的方程，基于横截面协方差的标准技术经常无法识别出统计上相关的随机驱动因素和检测异常值，因为它们忽略了横截面和时间结构之间的相互作用。因此，我们开发了一种估计理论，用于估计方程的潜在随机驱动因素的连续二次协变量，而不是可观察解过程的静态协方差。我们在弱条件下得到了可辨识性的结果，建立了基于装满渐近性的收敛速度和中心极限定理，并提供了长时间渐近性的估计结果，以估计潜在驱动因素的静态协变量。应用于利率结构数据，我们的方法揭示了与协变量的缩放极限的根本一致性。",
    "tldr": "本文提出了一种在无限维度中解决随机演化方程的稳健函数数据分析方法，通过考虑横截面和时间结构的相互作用，有效地测量了协变量的变化，具有可辨识性和收敛速度，并能揭示与协变量的缩放极限一致。"
}