{
    "title": "A PNP ion channel deep learning solver with local neural network and finite element input data",
    "abstract": "In this paper, a deep learning method for solving an improved one-dimensional Poisson-Nernst-Planck ion channel (PNPic) model, called the PNPic deep learning solver, is presented. In particular, it combines a novel local neural network scheme with an effective PNPic finite element solver. Since the input data of the neural network scheme only involves a small local patch of coarse grid solutions, which the finite element solver can quickly produce, the PNPic deep learning solver can be trained much faster than any corresponding conventional global neural network solvers. After properly trained, it can output a predicted PNPic solution in a much higher degree of accuracy than the low cost coarse grid solutions and can reflect different perturbation cases on the parameters, ion channel subregions, and interface and boundary values, etc. Consequently, the PNPic deep learning solver can generate a numerical solution with high accuracy for a family of PNPic models. As an initial study, two ",
    "link": "https://arxiv.org/abs/2401.17513",
    "context": "Title: A PNP ion channel deep learning solver with local neural network and finite element input data\nAbstract: In this paper, a deep learning method for solving an improved one-dimensional Poisson-Nernst-Planck ion channel (PNPic) model, called the PNPic deep learning solver, is presented. In particular, it combines a novel local neural network scheme with an effective PNPic finite element solver. Since the input data of the neural network scheme only involves a small local patch of coarse grid solutions, which the finite element solver can quickly produce, the PNPic deep learning solver can be trained much faster than any corresponding conventional global neural network solvers. After properly trained, it can output a predicted PNPic solution in a much higher degree of accuracy than the low cost coarse grid solutions and can reflect different perturbation cases on the parameters, ion channel subregions, and interface and boundary values, etc. Consequently, the PNPic deep learning solver can generate a numerical solution with high accuracy for a family of PNPic models. As an initial study, two ",
    "path": "papers/24/01/2401.17513.json",
    "total_tokens": 935,
    "translated_title": "一个具有本地神经网络和有限元输入数据的PNP离子通道深度学习求解器",
    "translated_abstract": "本文提出了一种用于解决改进的一维Poisson-Nernst-Planck离子通道（PNPic）模型的深度学习方法，称为PNPic深度学习求解器。特别是，它将一种新颖的本地神经网络方案与有效的PNPic有限元求解器相结合。由于神经网络方案的输入数据只涉及粗网格解的一小块局部区域，有限元求解器可以快速生成，因此PNPic深度学习求解器的训练速度比任何对应的传统全局神经网络求解器都要快。经过适当训练，它可以输出一个比低成本粗网格解更高准确度的预测PNPic解，并能反映不同参数扰动情况、离子通道子区域以及界面和边界值等。因此，PNPic深度学习求解器可以为一类PNPic模型生成高准确度的数值解。作为一个初步研究，两个......",
    "tldr": "该论文提出了一个使用本地神经网络和有限元求解器的PNP离子通道深度学习求解器。该求解器能够较快地训练并生成高准确度的数值解，在处理不同扰动情况和离子通道子区域时表现良好。",
    "en_tdlr": "This paper presents a PNP ion channel deep learning solver that combines a local neural network scheme with a finite element solver. It can be trained faster than conventional global neural network solvers and generates high accuracy numerical solutions, performing well in handling different perturbation cases and ion channel subregions."
}