{
    "title": "On the Correctness of the Generalized Isotonic Recursive Partitioning Algorithm. (arXiv:2401.04847v1 [stat.ML])",
    "abstract": "This paper presents an in-depth analysis of the generalized isotonic recursive partitioning (GIRP) algorithm for fitting isotonic models under separable convex losses, proposed by Luss and Rosset [J. Comput. Graph. Statist., 23 (2014), pp. 192--201] for differentiable losses and extended by Painsky and Rosset [IEEE Trans. Pattern Anal. Mach. Intell., 38 (2016), pp. 308-321] for nondifferentiable losses. The GIRP algorithm poseses an attractive feature that in each step of the algorithm, the intermediate solution satisfies the isotonicity constraint. The paper begins with an example showing that the GIRP algorithm as described in the literature may fail to produce an isotonic model, suggesting that the existence and uniqueness of the solution to the isotonic regression problem must be carefully addressed. It proceeds with showing that, among possibly many solutions, there indeed exists a solution that can be found by recursive binary partitioning of the set of observed data. A small mod",
    "link": "http://arxiv.org/abs/2401.04847",
    "context": "Title: On the Correctness of the Generalized Isotonic Recursive Partitioning Algorithm. (arXiv:2401.04847v1 [stat.ML])\nAbstract: This paper presents an in-depth analysis of the generalized isotonic recursive partitioning (GIRP) algorithm for fitting isotonic models under separable convex losses, proposed by Luss and Rosset [J. Comput. Graph. Statist., 23 (2014), pp. 192--201] for differentiable losses and extended by Painsky and Rosset [IEEE Trans. Pattern Anal. Mach. Intell., 38 (2016), pp. 308-321] for nondifferentiable losses. The GIRP algorithm poseses an attractive feature that in each step of the algorithm, the intermediate solution satisfies the isotonicity constraint. The paper begins with an example showing that the GIRP algorithm as described in the literature may fail to produce an isotonic model, suggesting that the existence and uniqueness of the solution to the isotonic regression problem must be carefully addressed. It proceeds with showing that, among possibly many solutions, there indeed exists a solution that can be found by recursive binary partitioning of the set of observed data. A small mod",
    "path": "papers/24/01/2401.04847.json",
    "total_tokens": 935,
    "translated_title": "关于广义等增递归分割算法的正确性研究",
    "translated_abstract": "本文深入分析了广义等增递归分割算法（GIRP），该算法用于拟合可分离凸损失下的等增模型，该算法由Luss和Rosset提出 [J. Comput. Graph. Statist., 23 (2014), pp. 192--201] 并由Painsky和Rosset [IEEE Trans. Pattern Anal. Mach. Intell., 38 (2016), pp. 308-321] 扩展适用于不可微损失。GIRP算法具有吸引人的特点，即在算法的每一步中，中间解满足等增约束。文章以一个例子开始，展示了文献中描述的GIRP算法可能无法产生等增模型的情况，表明必须仔细讨论等增回归问题的解的存在性和唯一性。文章接着展示，可能存在许多解之一，可以通过对观察数据集进行递归二分分割来找到解。一个小的修改",
    "tldr": "本文通过深入分析广义等增递归分割算法（GIRP），在可分离凸损失和不可微损失的情况下，解决了等增回归问题的存在性和唯一性，并提出了递归二分分割的方法来找到解。",
    "en_tdlr": "This paper presents an in-depth analysis of the generalized isotonic recursive partitioning (GIRP) algorithm for fitting isotonic models, addressing the existence and uniqueness of the solution to the isotonic regression problem under separable convex losses and nondifferentiable losses, and proposes a recursive binary partitioning method to find the solution."
}