{
    "title": "Multi-Modal Representation Learning for Molecular Property Prediction: Sequence, Graph, Geometry. (arXiv:2401.03369v2 [q-bio.MN] UPDATED)",
    "abstract": "Molecular property prediction refers to the task of labeling molecules with some biochemical properties, playing a pivotal role in the drug discovery and design process. Recently, with the advancement of machine learning, deep learning-based molecular property prediction has emerged as a solution to the resource-intensive nature of traditional methods, garnering significant attention. Among them, molecular representation learning is the key factor for molecular property prediction performance. And there are lots of sequence-based, graph-based, and geometry-based methods that have been proposed. However, the majority of existing studies focus solely on one modality for learning molecular representations, failing to comprehensively capture molecular characteristics and information. In this paper, a novel multi-modal representation learning model, which integrates the sequence, graph, and geometry characteristics, is proposed for molecular property prediction, called SGGRL. Specifically, ",
    "link": "http://arxiv.org/abs/2401.03369",
    "context": "Title: Multi-Modal Representation Learning for Molecular Property Prediction: Sequence, Graph, Geometry. (arXiv:2401.03369v2 [q-bio.MN] UPDATED)\nAbstract: Molecular property prediction refers to the task of labeling molecules with some biochemical properties, playing a pivotal role in the drug discovery and design process. Recently, with the advancement of machine learning, deep learning-based molecular property prediction has emerged as a solution to the resource-intensive nature of traditional methods, garnering significant attention. Among them, molecular representation learning is the key factor for molecular property prediction performance. And there are lots of sequence-based, graph-based, and geometry-based methods that have been proposed. However, the majority of existing studies focus solely on one modality for learning molecular representations, failing to comprehensively capture molecular characteristics and information. In this paper, a novel multi-modal representation learning model, which integrates the sequence, graph, and geometry characteristics, is proposed for molecular property prediction, called SGGRL. Specifically, ",
    "path": "papers/24/01/2401.03369.json",
    "total_tokens": 810,
    "translated_title": "多模态表示学习在分子性质预测中的应用：序列、图形、几何",
    "translated_abstract": "分子性质预测是将分子与某些生化性质进行标记的任务，对药物发现和设计过程起到重要作用。近年来，随着机器学习的进步，基于深度学习的分子性质预测已成为传统方法资源密集型性质的解决方案，引起了广泛关注。在这些方法中，分子表示学习是决定分子性质预测性能的关键因素。已经提出了许多基于序列、图形和几何的方法。然而，现有研究大多只关注一种模态用于学习分子表示，未能全面捕捉分子的特征和信息。本文提出了一种新颖的多模态表示学习模型SGGRL，将序列、图形和几何特征整合在一起，用于分子性质预测。",
    "tldr": "这篇论文提出了一种新颖的多模态表示学习模型SGGRL，将序列、图形和几何特征整合在一起，用于分子性质预测。",
    "en_tdlr": "This paper proposes a novel multi-modal representation learning model, SGGRL, which integrates sequence, graph, and geometry characteristics for molecular property prediction."
}