{
    "title": "Language Detection for Transliterated Content. (arXiv:2401.04619v1 [cs.CL])",
    "abstract": "In the contemporary digital era, the Internet functions as an unparalleled catalyst, dismantling geographical and linguistic barriers particularly evident in texting. This evolution facilitates global communication, transcending physical distances and fostering dynamic cultural exchange. A notable trend is the widespread use of transliteration, where the English alphabet is employed to convey messages in native languages, posing a unique challenge for language technology in accurately detecting the source language. This paper addresses this challenge through a dataset of phone text messages in Hindi and Russian transliterated into English utilizing BERT for language classification and Google Translate API for transliteration conversion. The research pioneers innovative approaches to identify and convert transliterated text, navigating challenges in the diverse linguistic landscape of digital communication. Emphasizing the pivotal role of comprehensive datasets for training Large Langua",
    "link": "http://arxiv.org/abs/2401.04619",
    "context": "Title: Language Detection for Transliterated Content. (arXiv:2401.04619v1 [cs.CL])\nAbstract: In the contemporary digital era, the Internet functions as an unparalleled catalyst, dismantling geographical and linguistic barriers particularly evident in texting. This evolution facilitates global communication, transcending physical distances and fostering dynamic cultural exchange. A notable trend is the widespread use of transliteration, where the English alphabet is employed to convey messages in native languages, posing a unique challenge for language technology in accurately detecting the source language. This paper addresses this challenge through a dataset of phone text messages in Hindi and Russian transliterated into English utilizing BERT for language classification and Google Translate API for transliteration conversion. The research pioneers innovative approaches to identify and convert transliterated text, navigating challenges in the diverse linguistic landscape of digital communication. Emphasizing the pivotal role of comprehensive datasets for training Large Langua",
    "path": "papers/24/01/2401.04619.json",
    "total_tokens": 873,
    "translated_title": "求识别音译内容的语言检测方法",
    "translated_abstract": "在当代数字化时代，互联网作为一个无与伦比的催化剂，打破了地理和语言的障碍，尤其在短信方面表现得尤为明显。这种发展促进了全球交流，超越了物理距离，促进了动态的文化交流。一个显著的趋势是广泛使用音译，即使用英文字母来传达母语的信息，这给语言技术准确识别源语言提出了独特的挑战。本文通过一个包含印地语和俄语音译成英文的手机短信数据集，利用BERT进行语言分类并使用Google Translate API进行音译转换，来解决这一挑战。该研究开创了识别和转换音译文本的创新方法，在数字交流的多样化语言环境中面临着各种挑战。强调全面数据集对大规模语言训练的关键作用。",
    "tldr": "该论文介绍了一种通过使用BERT进行语言分类和Google Translate API进行音译转换的方法，以解决音译文本语言检测的挑战。这项研究为在数字交流的多样化语言环境中识别和转换音译文本开辟了新的创新途径。",
    "en_tdlr": "This paper presents a method that uses BERT for language classification and Google Translate API for transliteration conversion to address the challenge of language detection in transliterated text. The research pioneers innovative approaches to identify and convert transliterated text in the diverse linguistic landscape of digital communication."
}