{
    "title": "Market Responses to Genuine Versus Strategic Generosity: An Empirical Examination of NFT Charity Fundraisers. (arXiv:2401.12064v1 [econ.GN])",
    "abstract": "Crypto donations now represent a significant fraction of charitable giving worldwide. Nonfungible token (NFT) charity fundraisers, which involve the sale of NFTs of artistic works with the proceeds donated to philanthropic causes, have emerged as a novel development in this space. A unique aspect of NFT charity fundraisers is the significant potential for donors to reap financial gains from the rising value of purchased NFTs. Questions may arise about the motivations of donors in these charity fundraisers, resulting in a negative social image. NFT charity fundraisers thus offer a unique opportunity to understand the economic consequences of a donor's social image. We investigate these effects in the context of a large NFT charity fundraiser. We identify the causal effect of purchasing an NFT within the charity fundraiser on a donor's later market outcomes by leveraging random variation in transaction processing times on the blockchain. Further, we demonstrate a clear pattern of heterog",
    "link": "http://arxiv.org/abs/2401.12064",
    "context": "Title: Market Responses to Genuine Versus Strategic Generosity: An Empirical Examination of NFT Charity Fundraisers. (arXiv:2401.12064v1 [econ.GN])\nAbstract: Crypto donations now represent a significant fraction of charitable giving worldwide. Nonfungible token (NFT) charity fundraisers, which involve the sale of NFTs of artistic works with the proceeds donated to philanthropic causes, have emerged as a novel development in this space. A unique aspect of NFT charity fundraisers is the significant potential for donors to reap financial gains from the rising value of purchased NFTs. Questions may arise about the motivations of donors in these charity fundraisers, resulting in a negative social image. NFT charity fundraisers thus offer a unique opportunity to understand the economic consequences of a donor's social image. We investigate these effects in the context of a large NFT charity fundraiser. We identify the causal effect of purchasing an NFT within the charity fundraiser on a donor's later market outcomes by leveraging random variation in transaction processing times on the blockchain. Further, we demonstrate a clear pattern of heterog",
    "path": "papers/24/01/2401.12064.json",
    "total_tokens": 896,
    "translated_title": "真诚与策略性慷慨行为对市场的回应：对NFT慈善筹款的实证研究",
    "translated_abstract": "加密货币捐赠现在占据全球慈善捐赠的重要份额。非同质化代币（NFT）慈善筹款作为一种新的发展方式，在这个领域中出现了。NFT慈善筹款的一个独特之处在于捐助人有可能从所购买的NFT上升值中获得经济利益。对于这些慈善筹款的捐助人动机可能会产生负面的社会形象。因此，NFT慈善筹款提供了一个了解捐助人社会形象经济后果的独特机会。我们通过利用区块链上交易处理时间的随机变动，研究了一个大型NFT慈善筹款活动中购买NFT对捐助人后续市场结果的因果效应。此外，我们展示了明确的异质模式。",
    "tldr": "本文通过观察NFT慈善筹款活动中捐助人购买NFT对其后续市场结果的影响，探讨了真诚与策略性慷慨行为对市场的回应，并发现了明确的异质模式。",
    "en_tdlr": "This paper examines the market responses to genuine versus strategic generosity in NFT charity fundraisers and identifies clear patterns of heterogeneity in the effects on donors' market outcomes."
}