{
    "title": "WildGEN: Long-horizon Trajectory Generation for Wildlife. (arXiv:2401.05421v1 [cs.LG])",
    "abstract": "Trajectory generation is an important concern in pedestrian, vehicle, and wildlife movement studies. Generated trajectories help enrich the training corpus in relation to deep learning applications, and may be used to facilitate simulation tasks. This is especially significant in the wildlife domain, where the cost of obtaining additional real data can be prohibitively expensive, time-consuming, and bear ethical considerations. In this paper, we introduce WildGEN: a conceptual framework that addresses this challenge by employing a Variational Auto-encoders (VAEs) based method for the acquisition of movement characteristics exhibited by wild geese over a long horizon using a sparse set of truth samples. A subsequent post-processing step of the generated trajectories is performed based on smoothing filters to reduce excessive wandering. Our evaluation is conducted through visual inspection and the computation of the Hausdorff distance between the generated and real trajectories. In addit",
    "link": "http://arxiv.org/abs/2401.05421",
    "context": "Title: WildGEN: Long-horizon Trajectory Generation for Wildlife. (arXiv:2401.05421v1 [cs.LG])\nAbstract: Trajectory generation is an important concern in pedestrian, vehicle, and wildlife movement studies. Generated trajectories help enrich the training corpus in relation to deep learning applications, and may be used to facilitate simulation tasks. This is especially significant in the wildlife domain, where the cost of obtaining additional real data can be prohibitively expensive, time-consuming, and bear ethical considerations. In this paper, we introduce WildGEN: a conceptual framework that addresses this challenge by employing a Variational Auto-encoders (VAEs) based method for the acquisition of movement characteristics exhibited by wild geese over a long horizon using a sparse set of truth samples. A subsequent post-processing step of the generated trajectories is performed based on smoothing filters to reduce excessive wandering. Our evaluation is conducted through visual inspection and the computation of the Hausdorff distance between the generated and real trajectories. In addit",
    "path": "papers/24/01/2401.05421.json",
    "total_tokens": 916,
    "translated_title": "WildGEN：用于野生动物的长时间轨迹生成",
    "translated_abstract": "轨迹生成是研究行人、车辆和野生动物移动的重要问题。生成的轨迹有助于深度学习应用的训练语料库丰富，并可用于促进模拟任务。这在野生动物领域尤为重要，因为获取额外的真实数据的成本可能非常昂贵、耗时且涉及伦理考虑。本文提出了WildGEN：一种概念框架，通过使用基于变分自编码器（VAEs）的方法，在稀疏的真实样本集上获得野鹅在长时间范围内展示的运动特征。随后，通过平滑滤波器对生成的轨迹进行后处理，以减少过度游荡。我们通过视觉检查和生成轨迹与真实轨迹之间的Hausdorff距离的计算来进行评估。",
    "tldr": "本文提出了一个名为WildGEN的概念框架，通过使用变分自编码器（VAEs）方法生成野生动物长时间范围内的运动轨迹。通过平滑滤波器对生成轨迹进行后处理，以提高生成轨迹的质量。评估结果通过视觉检查和计算生成轨迹与真实轨迹之间的Hausdorff距离。",
    "en_tdlr": "This paper introduces WildGEN, a conceptual framework that uses Variational Auto-encoders (VAEs) to generate long-term movement trajectories for wildlife. The generated trajectories are post-processed using smoothing filters to improve their quality. Evaluation is conducted through visual inspection and computing the Hausdorff distance between the generated and real trajectories."
}