{
    "title": "Multiobjective Optimization Analysis for Finding Infrastructure-as-Code Deployment Configurations. (arXiv:2401.09983v1 [cs.NE])",
    "abstract": "Multiobjective optimization is a hot topic in the artificial intelligence and operations research communities. The design and development of multiobjective methods is a frequent task for researchers and practitioners. As a result of this vibrant activity, a myriad of techniques have been proposed in the literature to date, demonstrating a significant effectiveness for dealing with situations coming from a wide range of real-world areas. This paper is focused on a multiobjective problem related to optimizing Infrastructure-as-Code deployment configurations. The system implemented for solving this problem has been coined as IaC Optimizer Platform (IOP). Despite the fact that a prototypical version of the IOP has been introduced in the literature before, a deeper analysis focused on the resolution of the problem is needed, in order to determine which is the most appropriate multiobjective method for embedding in the IOP. The main motivation behind the analysis conducted in this work is to",
    "link": "http://arxiv.org/abs/2401.09983",
    "context": "Title: Multiobjective Optimization Analysis for Finding Infrastructure-as-Code Deployment Configurations. (arXiv:2401.09983v1 [cs.NE])\nAbstract: Multiobjective optimization is a hot topic in the artificial intelligence and operations research communities. The design and development of multiobjective methods is a frequent task for researchers and practitioners. As a result of this vibrant activity, a myriad of techniques have been proposed in the literature to date, demonstrating a significant effectiveness for dealing with situations coming from a wide range of real-world areas. This paper is focused on a multiobjective problem related to optimizing Infrastructure-as-Code deployment configurations. The system implemented for solving this problem has been coined as IaC Optimizer Platform (IOP). Despite the fact that a prototypical version of the IOP has been introduced in the literature before, a deeper analysis focused on the resolution of the problem is needed, in order to determine which is the most appropriate multiobjective method for embedding in the IOP. The main motivation behind the analysis conducted in this work is to",
    "path": "papers/24/01/2401.09983.json",
    "total_tokens": 786,
    "translated_title": "用于寻找基础设施即代码部署配置的多目标优化分析",
    "translated_abstract": "多目标优化是人工智能和运筹学领域的热门话题。多目标方法的设计和开发是研究人员和实践者经常需要处理的任务。由于活跃的研究活动，已经提出了许多技术，对来自各种实际领域的情况具有显著的有效性。本文关注于优化基础设施即代码部署配置的多目标问题。解决此问题的系统被称为“IaC优化平台（IOP）”。尽管在文献中已经介绍了IOP的原型版本，但需要进行更深入的分析，以确定最适合嵌入IOP的多目标方法。本文中进行的分析的主要动机是确定最合适的多目标方法。",
    "tldr": "该论文针对优化基础设施即代码部署配置的多目标问题进行了深入分析，并提出了适用于IOP的最佳多目标方法。"
}