{
    "title": "Answer Retrieval in Legal Community Question Answering. (arXiv:2401.04852v1 [cs.IR])",
    "abstract": "The task of answer retrieval in the legal domain aims to help users to seek relevant legal advice from massive amounts of professional responses. Two main challenges hinder applying existing answer retrieval approaches in other domains to the legal domain: (1) a huge knowledge gap between lawyers and non-professionals; and (2) a mix of informal and formal content on legal QA websites. To tackle these challenges, we propose CE_FS, a novel cross-encoder (CE) re-ranker based on the fine-grained structured inputs. CE_FS uses additional structured information in the CQA data to improve the effectiveness of cross-encoder re-rankers. Furthermore, we propose LegalQA: a real-world benchmark dataset for evaluating answer retrieval in the legal domain. Experiments conducted on LegalQA show that our proposed method significantly outperforms strong cross-encoder re-rankers fine-tuned on MS MARCO. Our novel finding is that adding the question tags of each question besides the question description an",
    "link": "http://arxiv.org/abs/2401.04852",
    "context": "Title: Answer Retrieval in Legal Community Question Answering. (arXiv:2401.04852v1 [cs.IR])\nAbstract: The task of answer retrieval in the legal domain aims to help users to seek relevant legal advice from massive amounts of professional responses. Two main challenges hinder applying existing answer retrieval approaches in other domains to the legal domain: (1) a huge knowledge gap between lawyers and non-professionals; and (2) a mix of informal and formal content on legal QA websites. To tackle these challenges, we propose CE_FS, a novel cross-encoder (CE) re-ranker based on the fine-grained structured inputs. CE_FS uses additional structured information in the CQA data to improve the effectiveness of cross-encoder re-rankers. Furthermore, we propose LegalQA: a real-world benchmark dataset for evaluating answer retrieval in the legal domain. Experiments conducted on LegalQA show that our proposed method significantly outperforms strong cross-encoder re-rankers fine-tuned on MS MARCO. Our novel finding is that adding the question tags of each question besides the question description an",
    "path": "papers/24/01/2401.04852.json",
    "total_tokens": 983,
    "translated_title": "在法律社区问答中的答案检索",
    "translated_abstract": "在法律领域中，答案检索的任务旨在帮助用户从海量的专业回答中寻求相关的法律建议。两个主要挑战阻碍了将现有的答案检索方法应用于法律领域：（1）律师与非专业人士之间的巨大知识差距；（2）法律问答网站上非正式和正式内容的混合。为了解决这些挑战，我们提出了CE_FS，这是一种基于细粒度结构化输入的新型交叉编码器（CE）重排序器。CE_FS利用CQA数据中的额外结构化信息，提高了交叉编码器重排序器的效果。此外，我们提出了LegalQA：一个用于评估法律领域答案检索的真实世界基准数据集。在LegalQA上进行的实验证明，我们提出的方法明显优于在MS MARCO上微调的强交叉编码器重排序器。我们的新发现是，在问题描述之外，加入每个问题的标签能够进一步提升性能。",
    "tldr": "提出一种在法律领域中进行答案检索的方法，通过利用结构化的输入信息，解决律师与非专业人士之间的知识差距以及法律问答网站上非正式和正式内容的混合问题。实验结果表明，该方法在一个真实世界的法律领域数据集上显著优于现有方法。",
    "en_tdlr": "A method for answer retrieval in the legal domain is proposed, which addresses the knowledge gap between lawyers and non-professionals, as well as the mixture of informal and formal content on legal QA websites, by utilizing structured input information. Experimental results show that the proposed method outperforms existing approaches on a real-world benchmark dataset in the legal domain."
}