{
    "title": "Advancing ECG Diagnosis Using Reinforcement Learning on Global Waveform Variations Related to P Wave and PR Interval. (arXiv:2401.04938v1 [eess.SP])",
    "abstract": "The reliable diagnosis of cardiac conditions through electrocardiogram (ECG) analysis critically depends on accurately detecting P waves and measuring the PR interval. However, achieving consistent and generalizable diagnoses across diverse populations presents challenges due to the inherent global variations observed in ECG signals. This paper is focused on applying the Q learning reinforcement algorithm to the various ECG datasets available in the PhysioNet/Computing in Cardiology Challenge (CinC). Five ECG beats, including Normal Sinus Rhythm, Atrial Flutter, Atrial Fibrillation, 1st Degree Atrioventricular Block, and Left Atrial Enlargement, are included to study variations of P waves and PR Interval on Lead II and Lead V1. Q-Agent classified 71,672 beat samples in 8,867 patients with an average accuracy of 90.4% and only 9.6% average hamming loss over misclassification. The average classification time at the 100th episode containing around 40,000 samples is 0.04 seconds. An averag",
    "link": "http://arxiv.org/abs/2401.04938",
    "context": "Title: Advancing ECG Diagnosis Using Reinforcement Learning on Global Waveform Variations Related to P Wave and PR Interval. (arXiv:2401.04938v1 [eess.SP])\nAbstract: The reliable diagnosis of cardiac conditions through electrocardiogram (ECG) analysis critically depends on accurately detecting P waves and measuring the PR interval. However, achieving consistent and generalizable diagnoses across diverse populations presents challenges due to the inherent global variations observed in ECG signals. This paper is focused on applying the Q learning reinforcement algorithm to the various ECG datasets available in the PhysioNet/Computing in Cardiology Challenge (CinC). Five ECG beats, including Normal Sinus Rhythm, Atrial Flutter, Atrial Fibrillation, 1st Degree Atrioventricular Block, and Left Atrial Enlargement, are included to study variations of P waves and PR Interval on Lead II and Lead V1. Q-Agent classified 71,672 beat samples in 8,867 patients with an average accuracy of 90.4% and only 9.6% average hamming loss over misclassification. The average classification time at the 100th episode containing around 40,000 samples is 0.04 seconds. An averag",
    "path": "papers/24/01/2401.04938.json",
    "total_tokens": 1061,
    "translated_title": "利用强化学习提升ECG诊断：针对P波和PR间期的全局波形变异(arXiv：2401.04938v1 [eess.SP])",
    "translated_abstract": "通过心电图（ECG）分析可靠地诊断心脏病情，关键要准确检测P波和测量PR间期。然而，由于ECG信号中存在的全局变异，实现跨多样化人群的一致和可推广的诊断存在挑战。本文重点研究将Q学习强化算法应用于PhysioNet/Computing in Cardiology Challenge（CinC）中可用的各种ECG数据集。研究了Lead II和Lead V1上P波和PR间期的多样性，包含五个ECG心搏类型，包括正常窦性心律、心房扑动、心房纤颤、一度房室传导阻滞和左房扩大。Q-Agent对8,867名患者的71,672个心搏样本进行了分类，平均准确率为90.4％，通过错误分类的平均汉明损失率仅为9.6％。在处理约40,000个样本的第100个episode中，平均分类时间为0.04秒。",
    "tldr": "本研究利用Q学习强化算法在PhysioNet/Computing in Cardiology Challenge（CinC）提供的多种ECG数据集上应用，研究了P波和PR间期在Lead II和Lead V1上的不同变异。通过Q-Agent的分类能够在平均准确率为90.4％的情况下对患者的心搏样本进行分类，并且具有较低的平均汉明损失率和较快的分类时间。",
    "en_tdlr": "This study applies the Q learning reinforcement algorithm on diverse ECG datasets to analyze the variations of P waves and PR interval on Lead II and Lead V1. The Q-Agent achieves a high accuracy of 90.4% in classifying patient beat samples, with a low average hamming loss and fast classification time."
}