{
    "title": "A General Benchmark Framework is Dynamic Graph Neural Network Need. (arXiv:2401.06559v1 [cs.LG])",
    "abstract": "Dynamic graph learning is crucial for modeling real-world systems with evolving relationships and temporal dynamics. However, the lack of a unified benchmark framework in current research has led to inaccurate evaluations of dynamic graph models. This paper highlights the significance of dynamic graph learning and its applications in various domains. It emphasizes the need for a standardized benchmark framework that captures temporal dynamics, evolving graph structures, and downstream task requirements. Establishing a unified benchmark will help researchers understand the strengths and limitations of existing models, foster innovation, and advance dynamic graph learning. In conclusion, this paper identifies the lack of a standardized benchmark framework as a current limitation in dynamic graph learning research . Such a framework will facilitate accurate model evaluation, drive advancements in dynamic graph learning techniques, and enable the development of more effective models for re",
    "link": "http://arxiv.org/abs/2401.06559",
    "context": "Title: A General Benchmark Framework is Dynamic Graph Neural Network Need. (arXiv:2401.06559v1 [cs.LG])\nAbstract: Dynamic graph learning is crucial for modeling real-world systems with evolving relationships and temporal dynamics. However, the lack of a unified benchmark framework in current research has led to inaccurate evaluations of dynamic graph models. This paper highlights the significance of dynamic graph learning and its applications in various domains. It emphasizes the need for a standardized benchmark framework that captures temporal dynamics, evolving graph structures, and downstream task requirements. Establishing a unified benchmark will help researchers understand the strengths and limitations of existing models, foster innovation, and advance dynamic graph learning. In conclusion, this paper identifies the lack of a standardized benchmark framework as a current limitation in dynamic graph learning research . Such a framework will facilitate accurate model evaluation, drive advancements in dynamic graph learning techniques, and enable the development of more effective models for re",
    "path": "papers/24/01/2401.06559.json",
    "total_tokens": 862,
    "translated_title": "一个通用的基准框架对于动态图神经网络的需要",
    "translated_abstract": "动态图学习对于建模具有演化关系和时间动态的真实世界系统至关重要。然而，当前研究中缺乏统一的基准框架导致动态图模型的评估不准确。本文强调了动态图学习的重要性及其在各个领域中的应用。它强调了对捕捉时间动态、演化图结构和下游任务需求的标准化基准框架的需求。建立统一的基准框架将有助于研究人员了解现有模型的优势和局限性，促进创新，并推动动态图学习的进展。总之，本文确定缺乏统一的基准框架是当前动态图学习研究的局限之处。这样的框架将有助于准确评估模型，推动动态图学习技术的进步，并为生成更有效的模型打下基础。",
    "tldr": "本文强调了动态图学习的重要性及其在各个领域中的应用，并强调了对捕捉时间动态、演化图结构和下游任务需求的标准化基准框架的需求。缺乏统一的基准框架是当前动态图学习研究的局限之处，建立这样的框架将有助于推动动态图学习技术的进步。"
}