{
    "title": "Mastery Guided Non-parametric Clustering to Scale-up Strategy Prediction. (arXiv:2401.10210v1 [cs.CY])",
    "abstract": "Predicting the strategy (sequence of concepts) that a student is likely to use in problem-solving helps Adaptive Instructional Systems (AISs) better adapt themselves to different types of learners based on their learning abilities. This can lead to a more dynamic, engaging, and personalized experience for students. To scale up training a prediction model (such as LSTMs) over large-scale education datasets, we develop a non-parametric approach to cluster symmetric instances in the data. Specifically, we learn a representation based on Node2Vec that encodes symmetries over mastery or skill level since, to solve a problem, it is natural that a student's strategy is likely to involve concepts in which they have gained mastery. Using this representation, we use DP-Means to group symmetric instances through a coarse-to-fine refinement of the clusters. We apply our model to learn strategies for Math learning from large-scale datasets from MATHia, a leading AIS for middle-school math learning.",
    "link": "http://arxiv.org/abs/2401.10210",
    "context": "Title: Mastery Guided Non-parametric Clustering to Scale-up Strategy Prediction. (arXiv:2401.10210v1 [cs.CY])\nAbstract: Predicting the strategy (sequence of concepts) that a student is likely to use in problem-solving helps Adaptive Instructional Systems (AISs) better adapt themselves to different types of learners based on their learning abilities. This can lead to a more dynamic, engaging, and personalized experience for students. To scale up training a prediction model (such as LSTMs) over large-scale education datasets, we develop a non-parametric approach to cluster symmetric instances in the data. Specifically, we learn a representation based on Node2Vec that encodes symmetries over mastery or skill level since, to solve a problem, it is natural that a student's strategy is likely to involve concepts in which they have gained mastery. Using this representation, we use DP-Means to group symmetric instances through a coarse-to-fine refinement of the clusters. We apply our model to learn strategies for Math learning from large-scale datasets from MATHia, a leading AIS for middle-school math learning.",
    "path": "papers/24/01/2401.10210.json",
    "total_tokens": 880,
    "translated_title": "通过精通指导的非参数聚类来扩大策略预测规模",
    "translated_abstract": "预测学生在解决问题时可能使用的策略（概念序列）有助于自适应教学系统（AISs）根据他们的学习能力更好地适应不同类型的学习者。这可以为学生提供更动态、有趣和个性化的学习体验。为了扩大训练一个可以覆盖大规模教育数据集的预测模型（如LSTMs），我们开发了一种非参数方法来对数据中的对称实例进行聚类。具体来说，我们利用基于Node2Vec的表示学习将掌握或技能水平上的对称性编码为策略，因为解决问题时，学生的策略很可能涉及他们已经掌握的概念。利用这种表示，我们使用DP-Means通过对聚类的粗细调整来对对称实例进行分组。我们将我们的模型应用到从MATHia（一家中学数学学习领先的AIS）的大规模数据集中学习数学学习策略。",
    "tldr": "通过精通指导的非参数聚类方法，预测学生在问题解决中可能采用的策略，从而实现自适应教学系统的个性化体验。",
    "en_tdlr": "Predicting student strategies in problem-solving using non-parametric clustering guided by mastery, to enhance personalized experience in adaptive instructional systems."
}