{
    "title": "Optimizing Transition Strategies for Small to Medium Sized Portfolios. (arXiv:2401.13126v1 [q-fin.CP])",
    "abstract": "This work discusses the benefits of constrained portfolio turnover strategies for small to medium-sized portfolios. We propose a dynamic multi-period model that aims to minimize transaction costs and maximize terminal wealth levels whilst adhering to strict portfolio turnover constraints. Our results demonstrate that using our framework in combination with a reasonable forecast, can lead to higher portfolio values and lower transaction costs on average when compared to a naive, single-period model. Such results were maintained given different problem cases, such as, trading horizon, assets under management, wealth levels, etc. In addition, the proposed model lends itself to a reformulation that makes use of the column generation algorithm which can be strategically leveraged to reduce complexity and solving times.",
    "link": "http://arxiv.org/abs/2401.13126",
    "context": "Title: Optimizing Transition Strategies for Small to Medium Sized Portfolios. (arXiv:2401.13126v1 [q-fin.CP])\nAbstract: This work discusses the benefits of constrained portfolio turnover strategies for small to medium-sized portfolios. We propose a dynamic multi-period model that aims to minimize transaction costs and maximize terminal wealth levels whilst adhering to strict portfolio turnover constraints. Our results demonstrate that using our framework in combination with a reasonable forecast, can lead to higher portfolio values and lower transaction costs on average when compared to a naive, single-period model. Such results were maintained given different problem cases, such as, trading horizon, assets under management, wealth levels, etc. In addition, the proposed model lends itself to a reformulation that makes use of the column generation algorithm which can be strategically leveraged to reduce complexity and solving times.",
    "path": "papers/24/01/2401.13126.json",
    "total_tokens": 822,
    "translated_title": "优化小型到中型投资组合的转换策略",
    "translated_abstract": "本文讨论了对于小型到中型投资组合来说，采用约束的投资组合换手策略的好处。我们提出了一个多期动态模型，旨在在严格遵守投资组合换手约束的同时，最大限度地减少交易成本和最大化终端财富水平。我们的结果表明，与单期模型相比，使用我们的框架结合合理的预测，平均可以导致更高的投资组合价值和较低的交易成本。即使在不同的问题情况下，如交易时间、管理资产、财富水平等，这些结果也能得到保持。此外，所提出的模型可以重塑，利用列生成算法来降低复杂性和解决时间。",
    "tldr": "本文通过提出一个多期动态模型，讨论了对小型到中型投资组合进行约束的换手策略的好处。结果表明，使用该模型可以在严格遵守投资组合换手约束的前提下，最大限度地减少交易成本，并导致更高的投资组合价值。",
    "en_tdlr": "This work discusses the benefits of using constrained portfolio turnover strategies for small to medium-sized portfolios. The proposed dynamic multi-period model aims to minimize transaction costs and maximize terminal wealth levels while adhering to strict portfolio turnover constraints. The results demonstrate that using this model can lead to lower transaction costs and higher portfolio values, maintaining these outcomes across different trading horizons and asset management scenarios."
}