{
    "title": "NODI: Out-Of-Distribution Detection with Noise from Diffusion. (arXiv:2401.08689v1 [cs.CV])",
    "abstract": "Out-of-distribution (OOD) detection is a crucial part of deploying machine learning models safely. It has been extensively studied with a plethora of methods developed in the literature. This problem is tackled with an OOD score computation, however, previous methods compute the OOD scores with limited usage of the in-distribution dataset. For instance, the OOD scores are computed with information from a small portion of the in-distribution data. Furthermore, these methods encode images with a neural image encoder. The robustness of these methods is rarely checked with respect to image encoders of different training methods and architectures. In this work, we introduce the diffusion process into the OOD task. The diffusion model integrates information on the whole training set into the predicted noise vectors. What's more, we deduce a closed-form solution for the noise vector (stable point). Then the noise vector is converted into our OOD score, we test both the deep model predicted no",
    "link": "http://arxiv.org/abs/2401.08689",
    "context": "Title: NODI: Out-Of-Distribution Detection with Noise from Diffusion. (arXiv:2401.08689v1 [cs.CV])\nAbstract: Out-of-distribution (OOD) detection is a crucial part of deploying machine learning models safely. It has been extensively studied with a plethora of methods developed in the literature. This problem is tackled with an OOD score computation, however, previous methods compute the OOD scores with limited usage of the in-distribution dataset. For instance, the OOD scores are computed with information from a small portion of the in-distribution data. Furthermore, these methods encode images with a neural image encoder. The robustness of these methods is rarely checked with respect to image encoders of different training methods and architectures. In this work, we introduce the diffusion process into the OOD task. The diffusion model integrates information on the whole training set into the predicted noise vectors. What's more, we deduce a closed-form solution for the noise vector (stable point). Then the noise vector is converted into our OOD score, we test both the deep model predicted no",
    "path": "papers/24/01/2401.08689.json",
    "total_tokens": 873,
    "translated_title": "使用扩散噪声进行ODI（外分布检测）",
    "translated_abstract": "外分布（OOD）检测是安全部署机器学习模型的关键部分。在文献中已经广泛研究并开发了大量方法来解决这个问题。然而，以前的方法在计算OOD分数时对内分布数据集的使用有限。例如，OOD分数是根据内分布数据的一小部分信息计算的。此外，这些方法使用神经图像编码器对图像进行编码。然而，很少有人检查这些方法对不同训练方法和架构的图像编码器的鲁棒性。在这项工作中，我们将扩散过程引入到ODD任务中。扩散模型将整个训练集的信息集成到预测的噪声向量中。此外，我们推导出噪声向量（稳定点）的闭式解。然后，将噪声向量转化为我们的OOD分数，我们测试了深度模型预测的...",
    "tldr": "本研究将扩散过程应用于外分布检测任务中，通过将整个训练集的信息集成到预测的噪声向量中，获得稳定的噪声向量，并将其转化为OOD分数。"
}