{
    "title": "OntoMedRec: Logically-Pretrained Model-Agnostic Ontology Encoders for Medication Recommendation",
    "abstract": "arXiv:2401.15814v2 Announce Type: replace  Abstract: Most existing medication recommendation models learn representations for medical concepts based on electronic health records (EHRs) and make recommendations with learnt representations. However, most medications appear in the dataset for limited times, resulting in insufficient learning of their representations. Medical ontologies are the hierarchical classification systems for medical terms where similar terms are in the same class on a certain level. In this paper, we propose OntoMedRec, the logically-pretrained and model-agnostic medical Ontology Encoders for Medication Recommendation that addresses data sparsity problem with medical ontologies. We conduct comprehensive experiments on benchmark datasets to evaluate the effectiveness of OntoMedRec, and the result shows the integration of OntoMedRec improves the performance of various models in both the entire EHR datasets and the admissions with few-shot medications. We provide the",
    "link": "https://arxiv.org/abs/2401.15814",
    "context": "Title: OntoMedRec: Logically-Pretrained Model-Agnostic Ontology Encoders for Medication Recommendation\nAbstract: arXiv:2401.15814v2 Announce Type: replace  Abstract: Most existing medication recommendation models learn representations for medical concepts based on electronic health records (EHRs) and make recommendations with learnt representations. However, most medications appear in the dataset for limited times, resulting in insufficient learning of their representations. Medical ontologies are the hierarchical classification systems for medical terms where similar terms are in the same class on a certain level. In this paper, we propose OntoMedRec, the logically-pretrained and model-agnostic medical Ontology Encoders for Medication Recommendation that addresses data sparsity problem with medical ontologies. We conduct comprehensive experiments on benchmark datasets to evaluate the effectiveness of OntoMedRec, and the result shows the integration of OntoMedRec improves the performance of various models in both the entire EHR datasets and the admissions with few-shot medications. We provide the",
    "path": "papers/24/01/2401.15814.json",
    "total_tokens": 866,
    "translated_title": "OntoMedRec: 用于药物推荐的基于本体编码器的逻辑预训练模型无关性方法",
    "translated_abstract": "大多数现有的药物推荐模型通过基于电子健康记录（EHR）学习医学概念的表示，并使用学习到的表示进行推荐。然而，大多数药物在数据集中出现的时间有限，导致了其表示的学习不足。医学本体是医学术语的分层分类系统，相似的术语在某个层次上属于同一类别。本文提出了OntoMedRec，一种逻辑预训练和模型无关的医学本体编码器，用于解决医学本体数据稀缺问题。我们在基准数据集上进行了全面的实验，评估了OntoMedRec的有效性，结果表明OntoMedRec的集成改善了各种模型在整个EHR数据集和仅有少量药物的入院情况下的性能。",
    "tldr": "OntoMedRec是一种基于本体编码器的逻辑预训练、模型无关的医学推荐方法，通过解决医学本体数据稀缺问题，提高了各种模型在EHR数据集和少量药物的入院情况下的性能。",
    "en_tdlr": "OntoMedRec is a logically-pretrained, model-agnostic medical recommendation method based on ontology encoders. It improves the performance of various models in both EHR datasets and admissions with few-shot medications by addressing the issue of data sparsity in medical ontologies."
}