{
    "title": "LLMRS: Unlocking Potentials of LLM-Based Recommender Systems for Software Purchase. (arXiv:2401.06676v1 [cs.IR])",
    "abstract": "Recommendation systems are ubiquitous, from Spotify playlist suggestions to Amazon product suggestions. Nevertheless, depending on the methodology or the dataset, these systems typically fail to capture user preferences and generate general recommendations. Recent advancements in Large Language Models (LLM) offer promising results for analyzing user queries. However, employing these models to capture user preferences and efficiency remains an open question. In this paper, we propose LLMRS, an LLM-based zero-shot recommender system where we employ pre-trained LLM to encode user reviews into a review score and generate user-tailored recommendations. We experimented with LLMRS on a real-world dataset, the Amazon product reviews, for software purchase use cases. The results show that LLMRS outperforms the ranking-based baseline model while successfully capturing meaningful information from product reviews, thereby providing more reliable recommendations.",
    "link": "http://arxiv.org/abs/2401.06676",
    "context": "Title: LLMRS: Unlocking Potentials of LLM-Based Recommender Systems for Software Purchase. (arXiv:2401.06676v1 [cs.IR])\nAbstract: Recommendation systems are ubiquitous, from Spotify playlist suggestions to Amazon product suggestions. Nevertheless, depending on the methodology or the dataset, these systems typically fail to capture user preferences and generate general recommendations. Recent advancements in Large Language Models (LLM) offer promising results for analyzing user queries. However, employing these models to capture user preferences and efficiency remains an open question. In this paper, we propose LLMRS, an LLM-based zero-shot recommender system where we employ pre-trained LLM to encode user reviews into a review score and generate user-tailored recommendations. We experimented with LLMRS on a real-world dataset, the Amazon product reviews, for software purchase use cases. The results show that LLMRS outperforms the ranking-based baseline model while successfully capturing meaningful information from product reviews, thereby providing more reliable recommendations.",
    "path": "papers/24/01/2401.06676.json",
    "total_tokens": 897,
    "translated_title": "LLMRS: 解锁基于LLM的推荐系统对软件购买的潜力",
    "translated_abstract": "推荐系统无处不在，从Spotify的歌单推荐到亚马逊的产品推荐。然而，根据方法或数据集的不同，这些系统通常无法捕捉用户的偏好并生成普适的推荐。最近大型语言模型（LLM）的进展为分析用户查询提供了有希望的结果。然而，利用这些模型来捕捉用户的偏好和提高效率仍然是一个未解决的问题。在本文中，我们提出了LLMRS，一种基于LLM的零-shot推荐系统，我们利用预训练的LLM将用户评论编码为评论分数，并生成个性化的推荐。我们在亚马逊产品评论的真实数据集上对LLMRS进行了实验，用于软件购买的使用案例。结果表明，LLMRS优于基于排名的基准模型，同时成功从产品评论中捕捉到有意义的信息，从而提供更可靠的推荐。",
    "tldr": "LLMRS是一种基于LLM的零-shot推荐系统，可以将用户评论编码为评论分数并生成个性化推荐。实验证明，LLMRS在软件购买方面的推荐性能超过基准模型，并成功从产品评论中捕捉到有意义的信息，提供更可靠的推荐。"
}