{
    "title": "Using Large Language Models to Assess Tutors' Performance in Reacting to Students Making Math Errors. (arXiv:2401.03238v1 [cs.HC])",
    "abstract": "Research suggests that tutors should adopt a strategic approach when addressing math errors made by low-efficacy students. Rather than drawing direct attention to the error, tutors should guide the students to identify and correct their mistakes on their own. While tutor lessons have introduced this pedagogical skill, human evaluation of tutors applying this strategy is arduous and time-consuming. Large language models (LLMs) show promise in providing real-time assessment to tutors during their actual tutoring sessions, yet little is known regarding their accuracy in this context. In this study, we investigate the capacity of generative AI to evaluate real-life tutors' performance in responding to students making math errors. By analyzing 50 real-life tutoring dialogues, we find both GPT-3.5-Turbo and GPT-4 demonstrate proficiency in assessing the criteria related to reacting to students making errors. However, both models exhibit limitations in recognizing instances where the student ",
    "link": "http://arxiv.org/abs/2401.03238",
    "context": "Title: Using Large Language Models to Assess Tutors' Performance in Reacting to Students Making Math Errors. (arXiv:2401.03238v1 [cs.HC])\nAbstract: Research suggests that tutors should adopt a strategic approach when addressing math errors made by low-efficacy students. Rather than drawing direct attention to the error, tutors should guide the students to identify and correct their mistakes on their own. While tutor lessons have introduced this pedagogical skill, human evaluation of tutors applying this strategy is arduous and time-consuming. Large language models (LLMs) show promise in providing real-time assessment to tutors during their actual tutoring sessions, yet little is known regarding their accuracy in this context. In this study, we investigate the capacity of generative AI to evaluate real-life tutors' performance in responding to students making math errors. By analyzing 50 real-life tutoring dialogues, we find both GPT-3.5-Turbo and GPT-4 demonstrate proficiency in assessing the criteria related to reacting to students making errors. However, both models exhibit limitations in recognizing instances where the student ",
    "path": "papers/24/01/2401.03238.json",
    "total_tokens": 975,
    "translated_title": "使用大型语言模型评估教师对学生数学错误反应的表现",
    "translated_abstract": "研究表明，教师在应对低效学生的数学错误时应采取战略性的方法。教师不应直接指出错误，而应引导学生自己发现和纠正错误。虽然教师课程已经引入了这种教学技能，但人工评价教师在实际应用该策略时是困难且耗时的。大型语言模型（LLM）在实际辅导过程中向教师提供实时评估的潜力显示出来，但在这种情境下，对其准确性了解甚少。在这项研究中，我们调查了生成式人工智能在评估实际教师对学生数学错误反应表现中的能力。通过分析50个真实辅导对话，我们发现GPT-3.5-Turbo和GPT-4在评估与学生犯错反应相关的标准方面表现出了熟练度。然而，这两个模型在识别学生需要额外帮助的情况上存在局限性。",
    "tldr": "本研究探究了使用生成式人工智能评估教师在学生数学错误反应方面的表现。研究结果发现，GPT-3.5-Turbo和GPT-4在评估教师的表现方面显示出了熟练度，但在识别学生需要额外帮助的情况上仍存在局限性。",
    "en_tdlr": "This study investigates the use of generative AI to assess tutors' performance in reacting to students making math errors. The results show that GPT-3.5-Turbo and GPT-4 demonstrate proficiency in evaluating tutors' performance, but they have limitations in recognizing instances where students need additional help."
}