{
    "title": "A Lightweight Multi-Attack CAN Intrusion Detection System on Hybrid FPGAs. (arXiv:2401.10689v1 [cs.CR])",
    "abstract": "Rising connectivity in vehicles is enabling new capabilities like connected autonomous driving and advanced driver assistance systems (ADAS) for improving the safety and reliability of next-generation vehicles. This increased access to in-vehicle functions compromises critical capabilities that use legacy invehicle networks like Controller Area Network (CAN), which has no inherent security or authentication mechanism. Intrusion detection and mitigation approaches, particularly using machine learning models, have shown promising results in detecting multiple attack vectors in CAN through their ability to generalise to new vectors. However, most deployments require dedicated computing units like GPUs to perform line-rate detection, consuming much higher power. In this paper, we present a lightweight multi-attack quantised machine learning model that is deployed using Xilinx's Deep Learning Processing Unit IP on a Zynq Ultrascale+ (XCZU3EG) FPGA, which is trained and validated using the p",
    "link": "http://arxiv.org/abs/2401.10689",
    "context": "Title: A Lightweight Multi-Attack CAN Intrusion Detection System on Hybrid FPGAs. (arXiv:2401.10689v1 [cs.CR])\nAbstract: Rising connectivity in vehicles is enabling new capabilities like connected autonomous driving and advanced driver assistance systems (ADAS) for improving the safety and reliability of next-generation vehicles. This increased access to in-vehicle functions compromises critical capabilities that use legacy invehicle networks like Controller Area Network (CAN), which has no inherent security or authentication mechanism. Intrusion detection and mitigation approaches, particularly using machine learning models, have shown promising results in detecting multiple attack vectors in CAN through their ability to generalise to new vectors. However, most deployments require dedicated computing units like GPUs to perform line-rate detection, consuming much higher power. In this paper, we present a lightweight multi-attack quantised machine learning model that is deployed using Xilinx's Deep Learning Processing Unit IP on a Zynq Ultrascale+ (XCZU3EG) FPGA, which is trained and validated using the p",
    "path": "papers/24/01/2401.10689.json",
    "total_tokens": 936,
    "translated_title": "一个轻量级的多攻击CAN入侵检测系统在混合FPGAs上的研究",
    "translated_abstract": "车辆中的日益连接性使得新的能力成为可能，例如连接的自主驾驶和高级驾驶辅助系统（ADAS），以提高下一代车辆的安全性和可靠性。然而，这种对车内功能的增加让使用遗留车内网络（如CAN）的关键能力受到了威胁，因为CAN没有固有的安全性或认证机制。使用机器学习模型的入侵检测和缓解方法，在检测CAN中的多个攻击向量方面显示出了良好的结果，因为它们能够推广到新的向量。然而，大多数部署需要像GPU这样的专用计算单元执行线速检测，消耗更高的功耗。本文介绍了一种轻量级的多攻击量化机器学习模型，该模型使用赛灵思的深度学习处理单元IP在Zynq Ultrascale+（XCZU3EG）FPGA上部署，并使用p进行训练和验证。",
    "tldr": "本论文研究了一种在混合FPGAs上部署的轻量级多攻击CAN入侵检测系统，利用量化的机器学习模型，能够检测并缓解CAN中的多个攻击向量。该系统消耗较低的功耗，避免了对GPU等专用计算单元的依赖。",
    "en_tdlr": "This paper investigates a lightweight multi-attack CAN intrusion detection system deployed on hybrid FPGAs, utilizing a quantized machine learning model that can detect and mitigate multiple attack vectors in CAN. The system has low power consumption and avoids the need for dedicated computing units like GPUs."
}