{
    "title": "Impact of Green Marketing Strategy on Brand Awareness: Business, Management, and Human Resources Aspects. (arXiv:2401.02042v1 [econ.GN])",
    "abstract": "Given the move towards industrialization in societies, the increase in dynamism and competition among companies to capture market share, raising concerns about the environment, government, and international regulations and obligations, increased consumer awareness, pressure from nature-loving groups, etc., organizations have become more attentive to issues related to environmental management. Over time, concepts such as green marketing have permeated marketing literature, making environmental considerations one of the most important activities of companies. To this end, this research examines the impact of green marketing strategy on brand awareness (case study: food exporting companies). The population of this research consists of 345 employees and managers of companies like Kalleh, Solico, Pemina, Sorbon, Mac, Pol, and Castle, from which 182 individuals were randomly selected as the sample using Cochran's formula. This research is practical, and the required data have been collected ",
    "link": "http://arxiv.org/abs/2401.02042",
    "context": "Title: Impact of Green Marketing Strategy on Brand Awareness: Business, Management, and Human Resources Aspects. (arXiv:2401.02042v1 [econ.GN])\nAbstract: Given the move towards industrialization in societies, the increase in dynamism and competition among companies to capture market share, raising concerns about the environment, government, and international regulations and obligations, increased consumer awareness, pressure from nature-loving groups, etc., organizations have become more attentive to issues related to environmental management. Over time, concepts such as green marketing have permeated marketing literature, making environmental considerations one of the most important activities of companies. To this end, this research examines the impact of green marketing strategy on brand awareness (case study: food exporting companies). The population of this research consists of 345 employees and managers of companies like Kalleh, Solico, Pemina, Sorbon, Mac, Pol, and Castle, from which 182 individuals were randomly selected as the sample using Cochran's formula. This research is practical, and the required data have been collected ",
    "path": "papers/24/01/2401.02042.json",
    "total_tokens": 869,
    "translated_title": "绿色营销策略对品牌认知的影响：商业，管理和人力资源方面",
    "translated_abstract": "随着社会向工业化的转变，公司之间在捕捉市场份额方面的动态和竞争的增加，对环境的关注，政府和国际法规和义务的压力，消费者的意识提高，自然热爱团体的压力等等，组织对与环境管理有关的问题变得更加关注。随着时间的推移，绿色营销等概念渗透到营销文献中，使环境考虑成为公司最重要的活动之一。为此，本研究探讨了绿色营销策略对品牌认知的影响（案例研究：食品出口公司）。本研究的人口包括卡莱，Solico，Pemina，Sorbon，Mac，Pol和Castle等公司的345名员工和经理，通过科赫兰公式随机选择182个人作为样本。本研究是实践性的，所需数据已被收集",
    "tldr": "本研究通过案例研究，探讨了绿色营销策略对品牌认知的影响，并发现环境考虑对公司是一项重要活动。",
    "en_tdlr": "This study examines the impact of green marketing strategy on brand awareness through a case study, and finds that environmental considerations are an important activity for companies."
}