{
    "title": "Polytopic Autoencoders with Smooth Clustering for Reduced-order Modelling of Flows. (arXiv:2401.10620v1 [cs.LG])",
    "abstract": "With the advancement of neural networks, there has been a notable increase, both in terms of quantity and variety, in research publications concerning the application of autoencoders to reduced-order models. We propose a polytopic autoencoder architecture that includes a lightweight nonlinear encoder, a convex combination decoder, and a smooth clustering network. Supported by several proofs, the model architecture ensures that all reconstructed states lie within a polytope, accompanied by a metric indicating the quality of the constructed polytopes, referred to as polytope error. Additionally, it offers a minimal number of convex coordinates for polytopic linear-parameter varying systems while achieving acceptable reconstruction errors compared to proper orthogonal decomposition (POD). To validate our proposed model, we conduct simulations involving two flow scenarios with the incompressible Navier-Stokes equation. Numerical results demonstrate the guaranteed properties of the model, l",
    "link": "http://arxiv.org/abs/2401.10620",
    "context": "Title: Polytopic Autoencoders with Smooth Clustering for Reduced-order Modelling of Flows. (arXiv:2401.10620v1 [cs.LG])\nAbstract: With the advancement of neural networks, there has been a notable increase, both in terms of quantity and variety, in research publications concerning the application of autoencoders to reduced-order models. We propose a polytopic autoencoder architecture that includes a lightweight nonlinear encoder, a convex combination decoder, and a smooth clustering network. Supported by several proofs, the model architecture ensures that all reconstructed states lie within a polytope, accompanied by a metric indicating the quality of the constructed polytopes, referred to as polytope error. Additionally, it offers a minimal number of convex coordinates for polytopic linear-parameter varying systems while achieving acceptable reconstruction errors compared to proper orthogonal decomposition (POD). To validate our proposed model, we conduct simulations involving two flow scenarios with the incompressible Navier-Stokes equation. Numerical results demonstrate the guaranteed properties of the model, l",
    "path": "papers/24/01/2401.10620.json",
    "total_tokens": 977,
    "translated_title": "具有平滑聚类的多角形自编码器用于流体简化建模",
    "translated_abstract": "随着神经网络的进步，应用自编码器进行简化模型的研究出版物在数量和种类方面显著增加。我们提出了一种多角形自编码器架构，包括一个轻量级的非线性编码器、一个凸组合解码器和一个平滑聚类网络。通过多项证明支持的模型架构确保所有重建状态都位于多面体内，并附带一个指示构建的多面体质量的指标，称为多面体误差。此外，它为多面体线性参数变化系统提供了最小数量的凸坐标，同时实现了与POD相比可接受的重建误差。为了验证我们提出的模型，我们进行了涉及不可压缩Navier-Stokes方程的两种流动场景的仿真。数值结果证明了模型的保证性质。",
    "tldr": "我们提出了一种多角形自编码器架构，包括一个轻量级的非线性编码器、一个凸组合解码器和一个平滑聚类网络。该模型能够确保所有重建状态都位于一个多面体内，并提供了一个衡量多面体质量的指标。与传统的POD方法相比，我们的模型能够在保证重建误差可接受的情况下，使用最少的凸坐标进行多面体线性参数变化系统的建模。数值实验验证了我们模型的性能。",
    "en_tdlr": "We propose a polytopic autoencoder architecture with a lightweight nonlinear encoder, a convex combination decoder, and a smooth clustering network. The model ensures that all reconstructed states lie within a polytope and provides a metric for evaluating the quality of the constructed polytopes. Compared to traditional POD methods, our model achieves reduced-order modeling for polytopic linear-parameter varying systems with minimal convex coordinates while maintaining acceptable reconstruction errors. Numerical simulations validate the performance of our proposed model."
}