{
    "title": "Unveiling the Power of Self-supervision for Multi-view Multi-human Association and Tracking",
    "abstract": "Multi-view multi-human association and tracking (MvMHAT), is a new but important problem for multi-person scene video surveillance, aiming to track a group of people over time in each view, as well as to identify the same person across different views at the same time, which is different from previous MOT and multi-camera MOT tasks only considering the over-time human tracking. This way, the videos for MvMHAT require more complex annotations while containing more information for self learning. In this work, we tackle this problem with a self-supervised learning aware end-to-end network. Specifically, we propose to take advantage of the spatial-temporal self-consistency rationale by considering three properties of reflexivity, symmetry and transitivity. Besides the reflexivity property that naturally holds, we design the self-supervised learning losses based on the properties of symmetry and transitivity, for both appearance feature learning and assignment matrix optimization, to associ",
    "link": "https://arxiv.org/abs/2401.17617",
    "context": "Title: Unveiling the Power of Self-supervision for Multi-view Multi-human Association and Tracking\nAbstract: Multi-view multi-human association and tracking (MvMHAT), is a new but important problem for multi-person scene video surveillance, aiming to track a group of people over time in each view, as well as to identify the same person across different views at the same time, which is different from previous MOT and multi-camera MOT tasks only considering the over-time human tracking. This way, the videos for MvMHAT require more complex annotations while containing more information for self learning. In this work, we tackle this problem with a self-supervised learning aware end-to-end network. Specifically, we propose to take advantage of the spatial-temporal self-consistency rationale by considering three properties of reflexivity, symmetry and transitivity. Besides the reflexivity property that naturally holds, we design the self-supervised learning losses based on the properties of symmetry and transitivity, for both appearance feature learning and assignment matrix optimization, to associ",
    "path": "papers/24/01/2401.17617.json",
    "total_tokens": 850,
    "translated_title": "揭示自监督在多视角多人物关联与跟踪中的能力",
    "translated_abstract": "多视角多人物关联与跟踪(MvMHAT)是多人场景视频监控中的一个新而重要的问题，旨在在每个视角中跟踪一组人，并且同时在不同视角中识别相同的人，这与先前仅考虑跨时间人物跟踪的MOT和多摄像头MOT任务不同。因此，MvMHAT的视频需要更复杂的注释，并包含更多的信息供自学习使用。在这项工作中，我们采用了一种自监督学习感知的端到端网络来解决这个问题。具体而言，我们提出利用空间-时间自一致性推理来考虑反身性、对称性和传递性三个属性。除了自然满足的反身性属性外，我们还设计了基于对称性和传递性属性的自监督学习损失，用于外观特征学习和分配矩阵优化，以进行关联和跟踪的优化。",
    "tldr": "本研究提出了一种自监督学习感知的网络，通过考虑反身性、对称性和传递性属性，解决了多视角多人物关联与跟踪的问题。"
}