{
    "title": "Aligning Translation-Specific Understanding to General Understanding in Large Language Models. (arXiv:2401.05072v1 [cs.CL])",
    "abstract": "Although large language models (LLMs) have shown surprising language understanding and generation capabilities, they have yet to gain a revolutionary advancement in the field of machine translation. One potential cause of the limited performance is the misalignment between the translation-specific understanding and general understanding inside LLMs. To align the translation-specific understanding to the general one, we propose a novel translation process xIoD (Cross-Lingual Interpretation of Difficult words), explicitly incorporating the general understanding on the content incurring inconsistent understanding to guide the translation. Specifically, xIoD performs the cross-lingual interpretation for the difficult-to-translate words and enhances the translation with the generated interpretations. Furthermore, we reframe the external tools of QE to tackle the challenges of xIoD in the detection of difficult words and the generation of helpful interpretations. We conduct experiments on th",
    "link": "http://arxiv.org/abs/2401.05072",
    "context": "Title: Aligning Translation-Specific Understanding to General Understanding in Large Language Models. (arXiv:2401.05072v1 [cs.CL])\nAbstract: Although large language models (LLMs) have shown surprising language understanding and generation capabilities, they have yet to gain a revolutionary advancement in the field of machine translation. One potential cause of the limited performance is the misalignment between the translation-specific understanding and general understanding inside LLMs. To align the translation-specific understanding to the general one, we propose a novel translation process xIoD (Cross-Lingual Interpretation of Difficult words), explicitly incorporating the general understanding on the content incurring inconsistent understanding to guide the translation. Specifically, xIoD performs the cross-lingual interpretation for the difficult-to-translate words and enhances the translation with the generated interpretations. Furthermore, we reframe the external tools of QE to tackle the challenges of xIoD in the detection of difficult words and the generation of helpful interpretations. We conduct experiments on th",
    "path": "papers/24/01/2401.05072.json",
    "total_tokens": 864,
    "translated_title": "将大型语言模型中的翻译特定理解与一般理解对齐",
    "translated_abstract": "虽然大型语言模型（LLMs）展现出了令人惊讶的语言理解和生成能力，但在机器翻译领域尚未取得突破性进展。造成性能有限的一个潜在原因是LLMs中翻译特定理解与一般理解的不一致。为了将翻译特定理解与一般理解对齐，我们提出了一种新颖的翻译过程xIoD（跨语言解释困难词），明确地融入一般理解对产生不一致的理解以指导翻译。具体而言，xIoD对难以翻译的单词进行跨语言解释，并通过生成的解释增强翻译。此外，我们重新构建了外部工具QE，以解决xIoD在检测困难词和生成有帮助的解释方面的挑战。我们在实验中进行了测试。",
    "tldr": "这项研究旨在解决大型语言模型在机器翻译中的性能限制问题，通过提出一种跨语言解释困难词的新方法来对齐翻译特定理解和一般理解。",
    "en_tdlr": "This research aims to address the performance limitations of large language models in machine translation by proposing a novel approach to align translation-specific understanding and general understanding through cross-lingual interpretation of difficult words."
}