{
    "title": "Efficient estimation of parameters in marginals in semiparametric multivariate models",
    "abstract": "We consider a general multivariate model where univariate marginal distributions are known up to a parameter vector and we are interested in estimating that parameter vector without specifying the joint distribution, except for the marginals. If we assume independence between the marginals and maximize the resulting quasi-likelihood, we obtain a consistent but inefficient QMLE estimator. If we assume a parametric copula (other than independence) we obtain a full MLE, which is efficient but only under a correct copula specification and may be biased if the copula is misspecified. Instead we propose a sieve MLE estimator (SMLE) which improves over QMLE but does not have the drawbacks of full MLE. We model the unknown part of the joint distribution using the Bernstein-Kantorovich polynomial copula and assess the resulting improvement over QMLE and over misspecified FMLE in terms of relative efficiency and robustness. We derive the asymptotic distribution of the new estimator and show that",
    "link": "https://arxiv.org/abs/2401.17334",
    "context": "Title: Efficient estimation of parameters in marginals in semiparametric multivariate models\nAbstract: We consider a general multivariate model where univariate marginal distributions are known up to a parameter vector and we are interested in estimating that parameter vector without specifying the joint distribution, except for the marginals. If we assume independence between the marginals and maximize the resulting quasi-likelihood, we obtain a consistent but inefficient QMLE estimator. If we assume a parametric copula (other than independence) we obtain a full MLE, which is efficient but only under a correct copula specification and may be biased if the copula is misspecified. Instead we propose a sieve MLE estimator (SMLE) which improves over QMLE but does not have the drawbacks of full MLE. We model the unknown part of the joint distribution using the Bernstein-Kantorovich polynomial copula and assess the resulting improvement over QMLE and over misspecified FMLE in terms of relative efficiency and robustness. We derive the asymptotic distribution of the new estimator and show that",
    "path": "papers/24/01/2401.17334.json",
    "total_tokens": 934,
    "translated_title": "半参数多变量模型中边缘参数的高效估计",
    "translated_abstract": "我们考虑一个普适的多变量模型，其中单变量边缘分布已知至参数向量，并且我们的目标是在不指定联合分布的情况下估计该参数向量，除了边缘分布以外。如果我们假设边缘之间是独立的，并最大化由此得到的拟然似然，我们可以得到一致但低效的QMLE估计量。如果我们假设一个参数化的协差函数（而不是独立性），我们可以得到一个完全MLE，这是高效的，但仅在正确的协差函数规范下，如果协差函数规范错误可能会出现偏差。相反，我们提出了一种筛选MLE估计量（SMLE），它在QMLE上有所改进，并且不具备完全MLE的缺点。我们使用Bernstein-Kantorovich多项式协差函数对联合分布的未知部分进行建模，并通过相对效率和鲁棒性来评估相对于QMLE和错误规范的FMLE的改进。我们导出了新估计量的渐近分布并且表明...",
    "tldr": "我们提出了一种半参数多变量模型中边缘参数的高效估计方法，其中利用Bernstein-Kantorovich多项式协差函数对联合分布的未知部分进行建模，相对于QMLE和错误规范的FMLE有较高的相对效率和鲁棒性。",
    "en_tdlr": "We propose an efficient estimation method for parameters in the marginals of semiparametric multivariate models by modeling the unknown part of the joint distribution using the Bernstein-Kantorovich polynomial copula, which achieves higher relative efficiency and robustness compared to QMLE and misspecified FMLE."
}