{
    "title": "Incontestable Assignments. (arXiv:2401.03598v1 [econ.TH])",
    "abstract": "Mandatory clearinghouse participation is a standard setting in many school districts, and students can appeal (block) their assignments only with a valid reason. When students do not observe the assignments of other students, claims relying on justified envy are hard to establish. A student's appeal is said to be legitimate if there is no profile of preferences of the other students that can rationalize the student's assignment, and an assignment is incontestable if no student has a legitimate complaint. Incontestability is shown to be equivalent to individual rationality, non-wastefulness, and respect for top-priority sets. This latter property is a weakening of non-justified envy that relates to Hall's marriage theorem. We show that any stable mechanism is incontestable, as well as any mechanism that Pareto dominates a stable mechanism. The Top-Trading Cycle mechanism and some of its variants are incontestable (but Boston is not). Incontestable mechanisms are i-indinstiguishable (Li,",
    "link": "http://arxiv.org/abs/2401.03598",
    "context": "Title: Incontestable Assignments. (arXiv:2401.03598v1 [econ.TH])\nAbstract: Mandatory clearinghouse participation is a standard setting in many school districts, and students can appeal (block) their assignments only with a valid reason. When students do not observe the assignments of other students, claims relying on justified envy are hard to establish. A student's appeal is said to be legitimate if there is no profile of preferences of the other students that can rationalize the student's assignment, and an assignment is incontestable if no student has a legitimate complaint. Incontestability is shown to be equivalent to individual rationality, non-wastefulness, and respect for top-priority sets. This latter property is a weakening of non-justified envy that relates to Hall's marriage theorem. We show that any stable mechanism is incontestable, as well as any mechanism that Pareto dominates a stable mechanism. The Top-Trading Cycle mechanism and some of its variants are incontestable (but Boston is not). Incontestable mechanisms are i-indinstiguishable (Li,",
    "path": "papers/24/01/2401.03598.json",
    "total_tokens": 962,
    "translated_title": "无可争议的分配",
    "translated_abstract": "强制清算参与是许多学区的标准设定，学生只有在有有效理由的情况下才能申诉（阻止）他们的作业。当学生们不能观察到其他学生的分配时，基于合理嫉妒的主张很难建立起来。如果其他学生的偏好不能理性化学生的分配，那么学生的申诉被认为是合法的；如果没有学生有合法的投诉，那么分配是无可争议的。无可争议性被证明等同于个体合理性、非浪费性和对于优先级组的尊重。后者是对于Hall婚姻定理的非正当嫉妒的一种削弱。我们证明任何稳定机制都是无可争议的，以及任何优于稳定机制的机制都是无可争议的。Top-Trading Cycle机制及其一些变种是无可争议的（但波士顿机制不是）。无可争议的机制是i-indinstiguishable（Li，",
    "tldr": "论文研究了学生作业分配的问题，提出了无可争议的概念，并证明了稳定机制和优于稳定机制的机制都满足无可争议性。此外，引入了一种关于优先级组的性质来削弱正当嫉妒。Top-Trading Cycle机制及其变种是满足无可争议性的。",
    "en_tdlr": "This paper explores the issue of student assignment allocation and introduces the concept of incontestability, proving that stable mechanisms and mechanisms that dominate stable mechanisms are incontestable. Additionally, a property concerning top-priority sets is introduced to weaken justified envy. The Top-Trading Cycle mechanism and some of its variants are shown to be incontestable."
}