{
    "title": "Multi-Object Navigation in real environments using hybrid policies. (arXiv:2401.13800v1 [cs.RO])",
    "abstract": "Navigation has been classically solved in robotics through the combination of SLAM and planning. More recently, beyond waypoint planning, problems involving significant components of (visual) high-level reasoning have been explored in simulated environments, mostly addressed with large-scale machine learning, in particular RL, offline-RL or imitation learning. These methods require the agent to learn various skills like local planning, mapping objects and querying the learned spatial representations. In contrast to simpler tasks like waypoint planning (PointGoal), for these more complex tasks the current state-of-the-art models have been thoroughly evaluated in simulation but, to our best knowledge, not yet in real environments.  In this work we focus on sim2real transfer. We target the challenging Multi-Object Navigation (Multi-ON) task and port it to a physical environment containing real replicas of the originally virtual Multi-ON objects. We introduce a hybrid navigation method, wh",
    "link": "http://arxiv.org/abs/2401.13800",
    "context": "Title: Multi-Object Navigation in real environments using hybrid policies. (arXiv:2401.13800v1 [cs.RO])\nAbstract: Navigation has been classically solved in robotics through the combination of SLAM and planning. More recently, beyond waypoint planning, problems involving significant components of (visual) high-level reasoning have been explored in simulated environments, mostly addressed with large-scale machine learning, in particular RL, offline-RL or imitation learning. These methods require the agent to learn various skills like local planning, mapping objects and querying the learned spatial representations. In contrast to simpler tasks like waypoint planning (PointGoal), for these more complex tasks the current state-of-the-art models have been thoroughly evaluated in simulation but, to our best knowledge, not yet in real environments.  In this work we focus on sim2real transfer. We target the challenging Multi-Object Navigation (Multi-ON) task and port it to a physical environment containing real replicas of the originally virtual Multi-ON objects. We introduce a hybrid navigation method, wh",
    "path": "papers/24/01/2401.13800.json",
    "total_tokens": 916,
    "translated_title": "在真实环境中使用混合策略进行多目标导航",
    "translated_abstract": "导航问题在机器人领域一直以来都是通过SLAM和规划的结合来解决的。最近，除了航点规划，涉及到(视觉)高级推理的问题在模拟环境中得到了探索，并且主要通过大规模机器学习，特别是RL、离线RL或模仿学习来解决。这些方法要求智能体学习各种技能，比如局部规划、映射对象和查询学习得到的空间表示。与航点规划等简单任务不同，对于这些更复杂的任务，目前最先进的模型已经在模拟环境中进行了充分的评估，但据我们所知，尚未在真实环境中进行评估。本研究侧重于模拟到真实的迁移。我们以具有原始虚拟多目标导航对象实物复制品的物理环境为目标，针对具有挑战性的多目标导航任务引入了一种混合导航方法。",
    "tldr": "本论文研究了在真实环境中使用混合策略进行多目标导航的问题，主要解决了导航中涉及的高级推理、局部规划和空间表示等复杂任务，在模拟环境下已有先进的模型，但在真实环境中尚未评估。",
    "en_tdlr": "This paper investigates the problem of multi-object navigation using hybrid policies in real environments, addressing complex tasks involving high-level reasoning, local planning, and spatial representations, which have been evaluated in simulation but not in real environments."
}