{
    "title": "Automated Classification of Model Errors on ImageNet. (arXiv:2401.02430v1 [cs.CV])",
    "abstract": "While the ImageNet dataset has been driving computer vision research over the past decade, significant label noise and ambiguity have made top-1 accuracy an insufficient measure of further progress. To address this, new label-sets and evaluation protocols have been proposed for ImageNet showing that state-of-the-art models already achieve over 95% accuracy and shifting the focus on investigating why the remaining errors persist.  Recent work in this direction employed a panel of experts to manually categorize all remaining classification errors for two selected models. However, this process is time-consuming, prone to inconsistencies, and requires trained experts, making it unsuitable for regular model evaluation thus limiting its utility. To overcome these limitations, we propose the first automated error classification framework, a valuable tool to study how modeling choices affect error distributions. We use our framework to comprehensively evaluate the error distribution of over 90",
    "link": "http://arxiv.org/abs/2401.02430",
    "context": "Title: Automated Classification of Model Errors on ImageNet. (arXiv:2401.02430v1 [cs.CV])\nAbstract: While the ImageNet dataset has been driving computer vision research over the past decade, significant label noise and ambiguity have made top-1 accuracy an insufficient measure of further progress. To address this, new label-sets and evaluation protocols have been proposed for ImageNet showing that state-of-the-art models already achieve over 95% accuracy and shifting the focus on investigating why the remaining errors persist.  Recent work in this direction employed a panel of experts to manually categorize all remaining classification errors for two selected models. However, this process is time-consuming, prone to inconsistencies, and requires trained experts, making it unsuitable for regular model evaluation thus limiting its utility. To overcome these limitations, we propose the first automated error classification framework, a valuable tool to study how modeling choices affect error distributions. We use our framework to comprehensively evaluate the error distribution of over 90",
    "path": "papers/24/01/2401.02430.json",
    "total_tokens": 847,
    "translated_title": "自动分类ImageNet上的模型错误",
    "translated_abstract": "虽然ImageNet数据集在过去十年中推动了计算机视觉研究，但显著的标签噪声和歧义使得Top-1准确率成为进一步进展的不够充分的指标。为了解决这个问题，提出了新的标签集和评估协议，显示出最先进的模型已经实现了超过95%的准确率，并将重点转向为什么剩余的错误仍然存在的调查。最近的工作采用专家小组对两个选择的模型的所有剩余分类错误进行手动分类。然而，这个过程耗时，容易产生不一致性，并且需要受过训练的专家，使其不适用于常规模型评估，从而限制了其效用。为了克服这些局限性，我们提出了第一个自动错误分类框架，这是一个有价值的工具，用于研究建模选择如何影响错误分布。我们使用我们的框架全面评估了超过90个模型的错误分布。",
    "tldr": "该论文提出了自动错误分类框架来解决ImageNet数据集中的标签噪声和错误问题，为研究模型选择如何影响错误分布提供了有价值的工具。",
    "en_tdlr": "This paper proposes an automated error classification framework to address label noise and errors in the ImageNet dataset, providing a valuable tool for studying how modeling choices affect error distribution."
}