{
    "title": "GNN-LoFI: a Novel Graph Neural Network through Localized Feature-based Histogram Intersection. (arXiv:2401.09193v1 [cs.LG])",
    "abstract": "Graph neural networks are increasingly becoming the framework of choice for graph-based machine learning. In this paper, we propose a new graph neural network architecture that substitutes classical message passing with an analysis of the local distribution of node features. To this end, we extract the distribution of features in the egonet for each local neighbourhood and compare them against a set of learned label distributions by taking the histogram intersection kernel. The similarity information is then propagated to other nodes in the network, effectively creating a message passing-like mechanism where the message is determined by the ensemble of the features. We perform an ablation study to evaluate the network's performance under different choices of its hyper-parameters. Finally, we test our model on standard graph classification and regression benchmarks, and we find that it outperforms widely used alternative approaches, including both graph kernels and graph neural networks",
    "link": "http://arxiv.org/abs/2401.09193",
    "context": "Title: GNN-LoFI: a Novel Graph Neural Network through Localized Feature-based Histogram Intersection. (arXiv:2401.09193v1 [cs.LG])\nAbstract: Graph neural networks are increasingly becoming the framework of choice for graph-based machine learning. In this paper, we propose a new graph neural network architecture that substitutes classical message passing with an analysis of the local distribution of node features. To this end, we extract the distribution of features in the egonet for each local neighbourhood and compare them against a set of learned label distributions by taking the histogram intersection kernel. The similarity information is then propagated to other nodes in the network, effectively creating a message passing-like mechanism where the message is determined by the ensemble of the features. We perform an ablation study to evaluate the network's performance under different choices of its hyper-parameters. Finally, we test our model on standard graph classification and regression benchmarks, and we find that it outperforms widely used alternative approaches, including both graph kernels and graph neural networks",
    "path": "papers/24/01/2401.09193.json",
    "total_tokens": 905,
    "translated_title": "GNN-LoFI: 一种通过基于特征的局部直方图交集的新型图神经网络",
    "translated_abstract": "图神经网络越来越成为基于图的机器学习的首选框架。在本文中，我们提出了一种新的图神经网络架构，该架构用局部邻域节点特征的分布分析替代了传统的消息传递方法。为此，我们提取了每个局部邻域的egonet中特征的分布，并将其与一组学习到的标签分布进行直方图交集核函数的比较。然后，将相似性信息传播到网络中的其他节点，从而有效地创建了一种类似于消息传递的机制，其中消息由特征的集合确定。我们进行了消融研究，评估了网络在不同超参数选择下的性能。最后，我们在标准的图分类和回归基准测试中对模型进行了测试，并发现它的表现优于广泛使用的替代方法，包括图核和图神经网络。",
    "tldr": "GNN-LoFI是一种新的图神经网络架构，通过分析局部邻域节点特征的分布来替代传统的消息传递方法。通过直方图交集核函数将相似性信息传播到其他节点，实现了类似于消息传递的机制，并在图分类和回归基准测试中表现出明显优势。",
    "en_tdlr": "GNN-LoFI is a novel graph neural network architecture that replaces classical message passing with an analysis of the local distribution of node features. It propagates similarity information to other nodes using histogram intersection kernel, creating a message passing-like mechanism, and outperforms traditional approaches in graph classification and regression benchmarks."
}