{
    "title": "A Review of Findings from Neuroscience and Cognitive Psychology as Possible Inspiration for the Path to Artificial General Intelligence. (arXiv:2401.10904v1 [cs.AI])",
    "abstract": "This review aims to contribute to the quest for artificial general intelligence by examining neuroscience and cognitive psychology methods for potential inspiration. Despite the impressive advancements achieved by deep learning models in various domains, they still have shortcomings in abstract reasoning and causal understanding. Such capabilities should be ultimately integrated into artificial intelligence systems in order to surpass data-driven limitations and support decision making in a way more similar to human intelligence. This work is a vertical review that attempts a wide-ranging exploration of brain function, spanning from lower-level biological neurons, spiking neural networks, and neuronal ensembles to higher-level concepts such as brain anatomy, vector symbolic architectures, cognitive and categorization models, and cognitive architectures. The hope is that these concepts may offer insights for solutions in artificial general intelligence.",
    "link": "http://arxiv.org/abs/2401.10904",
    "context": "Title: A Review of Findings from Neuroscience and Cognitive Psychology as Possible Inspiration for the Path to Artificial General Intelligence. (arXiv:2401.10904v1 [cs.AI])\nAbstract: This review aims to contribute to the quest for artificial general intelligence by examining neuroscience and cognitive psychology methods for potential inspiration. Despite the impressive advancements achieved by deep learning models in various domains, they still have shortcomings in abstract reasoning and causal understanding. Such capabilities should be ultimately integrated into artificial intelligence systems in order to surpass data-driven limitations and support decision making in a way more similar to human intelligence. This work is a vertical review that attempts a wide-ranging exploration of brain function, spanning from lower-level biological neurons, spiking neural networks, and neuronal ensembles to higher-level concepts such as brain anatomy, vector symbolic architectures, cognitive and categorization models, and cognitive architectures. The hope is that these concepts may offer insights for solutions in artificial general intelligence.",
    "path": "papers/24/01/2401.10904.json",
    "total_tokens": 854,
    "translated_title": "通过探索神经科学和认知心理学的发现来寻求人工通用智能的启示的综述",
    "translated_abstract": "本综述旨在通过审视神经科学和认知心理学的方法，为人工通用智能的追求做出贡献。深度学习模型在各个领域取得了令人印象深刻的进展，但它们在抽象推理和因果理解方面仍然存在局限性。最终应将这些能力纳入人工智能系统中，以超越数据驱动的限制，并支持决策过程更类似于人类智能的方式。本研究是一项垂直综述，试图广泛探讨大脑功能，从低层生物神经元、脉冲神经网络和神经元集合到更高层面的概念，如脑解剖学、向量符号架构、认知和分类模型以及认知架构。希望这些概念能够为人工通用智能的解决方案提供启示。",
    "tldr": "这项综述通过探索神经科学和认知心理学的发现，旨在为人工通用智能的发展提供启示，以克服深度学习模型在抽象推理和因果理解方面的局限性。",
    "en_tdlr": "This review explores findings from neuroscience and cognitive psychology to provide inspiration for the development of artificial general intelligence, overcoming the limitations of deep learning models in abstract reasoning and causal understanding."
}