{
    "title": "Conformal Approach To Gaussian Process Surrogate Evaluation With Coverage Guarantees. (arXiv:2401.07733v1 [stat.ML])",
    "abstract": "Gaussian processes (GPs) are a Bayesian machine learning approach widely used to construct surrogate models for the uncertainty quantification of computer simulation codes in industrial applications. It provides both a mean predictor and an estimate of the posterior prediction variance, the latter being used to produce Bayesian credibility intervals. Interpreting these intervals relies on the Gaussianity of the simulation model as well as the well-specification of the priors which are not always appropriate. We propose to address this issue with the help of conformal prediction. In the present work, a method for building adaptive cross-conformal prediction intervals is proposed by weighting the non-conformity score with the posterior standard deviation of the GP. The resulting conformal prediction intervals exhibit a level of adaptivity akin to Bayesian credibility sets and display a significant correlation with the surrogate model local approximation error, while being free from the u",
    "link": "http://arxiv.org/abs/2401.07733",
    "context": "Title: Conformal Approach To Gaussian Process Surrogate Evaluation With Coverage Guarantees. (arXiv:2401.07733v1 [stat.ML])\nAbstract: Gaussian processes (GPs) are a Bayesian machine learning approach widely used to construct surrogate models for the uncertainty quantification of computer simulation codes in industrial applications. It provides both a mean predictor and an estimate of the posterior prediction variance, the latter being used to produce Bayesian credibility intervals. Interpreting these intervals relies on the Gaussianity of the simulation model as well as the well-specification of the priors which are not always appropriate. We propose to address this issue with the help of conformal prediction. In the present work, a method for building adaptive cross-conformal prediction intervals is proposed by weighting the non-conformity score with the posterior standard deviation of the GP. The resulting conformal prediction intervals exhibit a level of adaptivity akin to Bayesian credibility sets and display a significant correlation with the surrogate model local approximation error, while being free from the u",
    "path": "papers/24/01/2401.07733.json",
    "total_tokens": 792,
    "translated_title": "高斯过程替代评估的适应性均匀预测方法",
    "translated_abstract": "高斯过程广泛应用于构建工业应用中计算机模拟代码的不确定性量化的代理模型。本文提出了一种使用适应性交叉均匀预测区间构建的方法，通过将非一致性得分与高斯过程的后验标准差加权，解决了先验适合度不恰当的问题。得到的均匀预测区间表现出类似于贝叶斯可信度集的自适应水平，并且与代理模型的局部逼近误差具有显著相关性，同时不受优化问题的影响。",
    "tldr": "本文提出了一种使用高斯过程构建适应性交叉均匀预测区间的方法，解决了先验适合度不恰当的问题，并且所得到的预测区间具有贝叶斯可信度集的自适应性和与代理模型的局部逼近误差的相关性。",
    "en_tdlr": "This paper proposes a method for constructing adaptive cross-conformal prediction intervals using Gaussian processes, which addresses the issue of inappropriate prior specification and exhibits the adaptivity of Bayesian credibility sets and correlation with surrogate model's local approximation error."
}