{
    "title": "Framing Analysis of Health-Related Narratives: Conspiracy versus Mainstream Media. (arXiv:2401.10030v1 [cs.CL])",
    "abstract": "Understanding how online media frame issues is crucial due to their impact on public opinion. Research on framing using natural language processing techniques mainly focuses on specific content features in messages and neglects their narrative elements. Also, the distinction between framing in different sources remains an understudied problem. We address those issues and investigate how the framing of health-related topics, such as COVID-19 and other diseases, differs between conspiracy and mainstream websites. We incorporate narrative information into the framing analysis by introducing a novel frame extraction approach based on semantic graphs. We find that health-related narratives in conspiracy media are predominantly framed in terms of beliefs, while mainstream media tend to present them in terms of science. We hope our work offers new ways for a more nuanced frame analysis.",
    "link": "http://arxiv.org/abs/2401.10030",
    "context": "Title: Framing Analysis of Health-Related Narratives: Conspiracy versus Mainstream Media. (arXiv:2401.10030v1 [cs.CL])\nAbstract: Understanding how online media frame issues is crucial due to their impact on public opinion. Research on framing using natural language processing techniques mainly focuses on specific content features in messages and neglects their narrative elements. Also, the distinction between framing in different sources remains an understudied problem. We address those issues and investigate how the framing of health-related topics, such as COVID-19 and other diseases, differs between conspiracy and mainstream websites. We incorporate narrative information into the framing analysis by introducing a novel frame extraction approach based on semantic graphs. We find that health-related narratives in conspiracy media are predominantly framed in terms of beliefs, while mainstream media tend to present them in terms of science. We hope our work offers new ways for a more nuanced frame analysis.",
    "path": "papers/24/01/2401.10030.json",
    "total_tokens": 961,
    "translated_title": "基于健康相关叙事的框架分析：阴谋与主流媒体的比较",
    "translated_abstract": "了解在线媒体如何框定问题对于其对公众舆论的影响至关重要。利用自然语言处理技术进行的框架研究主要关注消息中的特定内容特征，而忽视了其叙事要素。此外，不同信息源中的框架差异是一个未被充分研究的问题。我们解决了这些问题，并研究了与健康相关的话题（如COVID-19和其他疾病）在阴谋和主流媒体之间的框架差异。我们通过引入基于语义图的新型框架提取方法将叙事信息纳入框架分析中。我们发现，在阴谋媒体中，与健康相关的叙事主要以信仰为框架，而主流媒体倾向于以科学为框架呈现。我们希望我们的工作能为更细致入微的框架分析提供新的方法。",
    "tldr": "本研究基于健康相关叙事的框架分析，比较了阴谋媒体与主流媒体之间在COVID-19等话题上的框架差异。研究发现，在阴谋媒体中，健康相关的叙事主要以信仰为框架，而主流媒体则以科学为框架。这项研究为更深入的框架分析提供了新的方法。",
    "en_tdlr": "This study conducts a framing analysis based on health-related narratives and compares the framing differences between conspiracy and mainstream media on topics such as COVID-19. The findings show that health-related narratives in conspiracy media are primarily framed in terms of beliefs, while mainstream media tend to frame them in terms of science. This research provides new approaches for a more nuanced frame analysis."
}