{
    "title": "TRACE: A Time-Relational Approximate Cubing Engine for Fast Data Insights. (arXiv:2401.06336v1 [cs.IR])",
    "abstract": "A large class of data questions can be modeled as identifying important slices of data driven by user defined metrics. This paper presents TRACE, a Time-Relational Approximate Cubing Engine that enables interactive analysis on such slices with a low upfront cost - both in space and computation. It does this by materializing the most important parts of the cube over time enabling interactive querying for a large class of analytical queries e.g. what part of my business has the highest revenue growth ([SubCategory=Sports Equipment, Gender=Female]), what slices are lagging in revenue per user ([State=CA, Age=20-30]). Many user defined metrics are supported including common aggregations such as SUM, COUNT, DISTINCT COUNT and more complex ones such as AVERAGE. We implemented and deployed TRACE for a variety of business use cases.",
    "link": "http://arxiv.org/abs/2401.06336",
    "context": "Title: TRACE: A Time-Relational Approximate Cubing Engine for Fast Data Insights. (arXiv:2401.06336v1 [cs.IR])\nAbstract: A large class of data questions can be modeled as identifying important slices of data driven by user defined metrics. This paper presents TRACE, a Time-Relational Approximate Cubing Engine that enables interactive analysis on such slices with a low upfront cost - both in space and computation. It does this by materializing the most important parts of the cube over time enabling interactive querying for a large class of analytical queries e.g. what part of my business has the highest revenue growth ([SubCategory=Sports Equipment, Gender=Female]), what slices are lagging in revenue per user ([State=CA, Age=20-30]). Many user defined metrics are supported including common aggregations such as SUM, COUNT, DISTINCT COUNT and more complex ones such as AVERAGE. We implemented and deployed TRACE for a variety of business use cases.",
    "path": "papers/24/01/2401.06336.json",
    "total_tokens": 765,
    "translated_title": "TRACE:一种用于快速数据洞察的时间关系近似立方引擎",
    "translated_abstract": "数据问题的大类可以被建模为通过用户定义的指标来确定重要的数据片段。本文介绍了TRACE，一种时间关系近似立方引擎，它可以以较低的前期成本（包括空间和计算）在这些片段上进行交互式分析。通过逐步实现立方体的最重要部分，TRACE支持对一大类分析查询的交互式查询，例如我的业务中哪个部分的收入增长最快（[SubCategory=Sports Equipment, Gender=Female]），哪些片段的每用户收入滞后（[State=CA, Age=20-30]）。TRACE支持许多用户定义的指标，包括常见的聚合（如SUM、COUNT、DISTINCT COUNT）和更复杂的指标（如AVERAGE）。我们针对各种商业用例实施和部署了TRACE。",
    "tldr": "TRACE是一个时间关系近似立方引擎，可以以较低成本进行交互式分析，并支持各种用户定义的指标。",
    "en_tdlr": "TRACE is a time-relational approximate cubing engine that enables interactive analysis with low cost and supports various user-defined metrics."
}