{
    "title": "SeizNet: An AI-enabled Implantable Sensor Network System for Seizure Prediction. (arXiv:2401.06644v1 [cs.LG])",
    "abstract": "In this paper, we introduce SeizNet, a closed-loop system for predicting epileptic seizures through the use of Deep Learning (DL) method and implantable sensor networks. While pharmacological treatment is effective for some epilepsy patients (with ~65M people affected worldwide), one out of three suffer from drug-resistant epilepsy. To alleviate the impact of seizure, predictive systems have been developed that can notify such patients of an impending seizure, allowing them to take precautionary measures. SeizNet leverages DL techniques and combines data from multiple recordings, specifically intracranial electroencephalogram (iEEG) and electrocardiogram (ECG) sensors, that can significantly improve the specificity of seizure prediction while preserving very high levels of sensitivity. SeizNet DL algorithms are designed for efficient real-time execution at the edge, minimizing data privacy concerns, data transmission overhead, and power inefficiencies associated with cloud-based soluti",
    "link": "http://arxiv.org/abs/2401.06644",
    "context": "Title: SeizNet: An AI-enabled Implantable Sensor Network System for Seizure Prediction. (arXiv:2401.06644v1 [cs.LG])\nAbstract: In this paper, we introduce SeizNet, a closed-loop system for predicting epileptic seizures through the use of Deep Learning (DL) method and implantable sensor networks. While pharmacological treatment is effective for some epilepsy patients (with ~65M people affected worldwide), one out of three suffer from drug-resistant epilepsy. To alleviate the impact of seizure, predictive systems have been developed that can notify such patients of an impending seizure, allowing them to take precautionary measures. SeizNet leverages DL techniques and combines data from multiple recordings, specifically intracranial electroencephalogram (iEEG) and electrocardiogram (ECG) sensors, that can significantly improve the specificity of seizure prediction while preserving very high levels of sensitivity. SeizNet DL algorithms are designed for efficient real-time execution at the edge, minimizing data privacy concerns, data transmission overhead, and power inefficiencies associated with cloud-based soluti",
    "path": "papers/24/01/2401.06644.json",
    "total_tokens": 859,
    "translated_title": "SeizNet：一种用于癫痫预测的AI辅助植入式传感器网络系统",
    "translated_abstract": "本文介绍了SeizNet，这是一个通过深度学习方法和植入式传感器网络预测癫痫发作的闭环系统。尽管药物治疗对一些癫痫患者有效（全球约有6500万人受到影响），但三分之一的患者患有耐药性癫痫。为了减轻癫痫的影响，已经开发出了可以通知这类患者即将发作的预测系统，使他们能够采取预防措施。SeizNet利用深度学习技术，并结合多个记录的数据，特别是颅内脑电图（iEEG）和心电图（ECG）传感器的数据，可以显著提高癫痫预测的特异性，同时保持非常高的敏感性水平。SeizNet的深度学习算法旨在边缘实时执行，从而减少与基于云的解决方案相关的数据隐私问题、数据传输开销和功耗效率问题。",
    "tldr": "SeizNet是一种通过使用深度学习和植入式传感器网络系统进行癫痫预测的闭环系统，可以提高预测的特异性并保持很高的敏感性。"
}