{
    "title": "What should I say? -- Interacting with AI and Natural Language Interfaces. (arXiv:2401.06382v1 [cs.HC])",
    "abstract": "As Artificial Intelligence (AI) technology becomes more and more prevalent, it becomes increasingly important to explore how we as humans interact with AI. The Human-AI Interaction (HAI) sub-field has emerged from the Human-Computer Interaction (HCI) field and aims to examine this very notion. Many interaction patterns have been implemented without fully understanding the changes in required cognition as well as the cognitive science implications of using these alternative interfaces that aim to be more human-like in nature. Prior research suggests that theory of mind representations are crucial to successful and effortless communication, however very little is understood when it comes to how theory of mind representations are established when interacting with AI.",
    "link": "http://arxiv.org/abs/2401.06382",
    "context": "Title: What should I say? -- Interacting with AI and Natural Language Interfaces. (arXiv:2401.06382v1 [cs.HC])\nAbstract: As Artificial Intelligence (AI) technology becomes more and more prevalent, it becomes increasingly important to explore how we as humans interact with AI. The Human-AI Interaction (HAI) sub-field has emerged from the Human-Computer Interaction (HCI) field and aims to examine this very notion. Many interaction patterns have been implemented without fully understanding the changes in required cognition as well as the cognitive science implications of using these alternative interfaces that aim to be more human-like in nature. Prior research suggests that theory of mind representations are crucial to successful and effortless communication, however very little is understood when it comes to how theory of mind representations are established when interacting with AI.",
    "path": "papers/24/01/2401.06382.json",
    "total_tokens": 771,
    "translated_title": "我应该说什么？-与AI和自然语言界面的交互",
    "translated_abstract": "随着人工智能（AI）技术越来越普遍，探索人类如何与AI交互变得越来越重要。人工智能交互（HAI）子领域从人机交互（HCI）领域中出现，旨在研究这个问题。许多交互模式已经实施，但对于使用这些更像人类本质的替代界面所需认知的变化以及使用这些界面的认知科学影响，了解还很有限。先前的研究表明，成功和轻松的沟通关键在于心智表征，然而，在与AI交互时，心智表征是如何建立的仍不甚了解。",
    "tldr": "随着人工智能技术的普及，研究人类与AI的交互变得越来越重要。本研究通过探索人类与AI交互过程中心智表征的建立，旨在帮助实现成功和轻松的沟通。",
    "en_tdlr": "As AI technology becomes more prevalent, it is important to understand how humans interact with AI. This research aims to explore the establishment of theory of mind representations during human-AI interaction to facilitate successful and effortless communication."
}