{
    "title": "Explainability-Driven Leaf Disease Classification using Adversarial Training and Knowledge Distillation. (arXiv:2401.00334v2 [cs.CV] UPDATED)",
    "abstract": "This work focuses on plant leaf disease classification and explores three crucial aspects: adversarial training, model explainability, and model compression. The models' robustness against adversarial attacks is enhanced through adversarial training, ensuring accurate classification even in the presence of threats. Leveraging explainability techniques, we gain insights into the model's decision-making process, improving trust and transparency. Additionally, we explore model compression techniques to optimize computational efficiency while maintaining classification performance. Through our experiments, we determine that on a benchmark dataset, the robustness can be the price of the classification accuracy with performance reductions of 3%-20% for regular tests and gains of 50%-70% for adversarial attack tests. We also demonstrate that a student model can be 15-25 times more computationally efficient for a slight performance reduction, distilling the knowledge of more complex models.",
    "link": "http://arxiv.org/abs/2401.00334",
    "context": "Title: Explainability-Driven Leaf Disease Classification using Adversarial Training and Knowledge Distillation. (arXiv:2401.00334v2 [cs.CV] UPDATED)\nAbstract: This work focuses on plant leaf disease classification and explores three crucial aspects: adversarial training, model explainability, and model compression. The models' robustness against adversarial attacks is enhanced through adversarial training, ensuring accurate classification even in the presence of threats. Leveraging explainability techniques, we gain insights into the model's decision-making process, improving trust and transparency. Additionally, we explore model compression techniques to optimize computational efficiency while maintaining classification performance. Through our experiments, we determine that on a benchmark dataset, the robustness can be the price of the classification accuracy with performance reductions of 3%-20% for regular tests and gains of 50%-70% for adversarial attack tests. We also demonstrate that a student model can be 15-25 times more computationally efficient for a slight performance reduction, distilling the knowledge of more complex models.",
    "path": "papers/24/01/2401.00334.json",
    "total_tokens": 914,
    "translated_title": "使用对抗训练和知识蒸馏的可解释性导向叶片疾病分类",
    "translated_abstract": "本研究关注植物叶片疾病分类，并探索了对抗训练、模型可解释性和模型压缩三个关键方面。通过对抗训练增强模型对对抗攻击的鲁棒性，在威胁存在的情况下确保准确分类。借助可解释性技术，我们深入了解模型的决策过程，提高了信任和透明度。此外，我们还探索了模型压缩技术，以优化计算效率同时保持分类性能。通过实验证明，在基准数据集上，鲁棒性可能以分类准确性为代价，对常规测试的性能损失为3%-20%，对对抗攻击测试的性能提高为50%-70%。我们还证明，一个学生模型在性能稍有降低的情况下可以比复杂模型高15-25倍的计算效率，蒸馏了更复杂模型的知识。",
    "tldr": "本研究通过对抗训练来提高植物叶片疾病分类模型对对抗攻击的鲁棒性，并通过可解释性技术获得模型的决策过程，同时通过模型压缩技术提高计算效率。实验证明，鲁棒性可能以分类准确性为代价，而学生模型可以以较低的性能损失蒸馏复杂模型的知识，从而提高计算效率。"
}