{
    "title": "Evaluating Driver Readiness in Conditionally Automated Vehicles from Eye-Tracking Data and Head Pose. (arXiv:2401.11284v1 [cs.CV])",
    "abstract": "As automated driving technology advances, the role of the driver to resume control of the vehicle in conditionally automated vehicles becomes increasingly critical. In the SAE Level 3 or partly automated vehicles, the driver needs to be available and ready to intervene when necessary. This makes it essential to evaluate their readiness accurately. This article presents a comprehensive analysis of driver readiness assessment by combining head pose features and eye-tracking data. The study explores the effectiveness of predictive models in evaluating driver readiness, addressing the challenges of dataset limitations and limited ground truth labels. Machine learning techniques, including LSTM architectures, are utilised to model driver readiness based on the Spatio-temporal status of the driver's head pose and eye gaze. The experiments in this article revealed that a Bidirectional LSTM architecture, combining both feature sets, achieves a mean absolute error of 0.363 on the DMD dataset, d",
    "link": "http://arxiv.org/abs/2401.11284",
    "context": "Title: Evaluating Driver Readiness in Conditionally Automated Vehicles from Eye-Tracking Data and Head Pose. (arXiv:2401.11284v1 [cs.CV])\nAbstract: As automated driving technology advances, the role of the driver to resume control of the vehicle in conditionally automated vehicles becomes increasingly critical. In the SAE Level 3 or partly automated vehicles, the driver needs to be available and ready to intervene when necessary. This makes it essential to evaluate their readiness accurately. This article presents a comprehensive analysis of driver readiness assessment by combining head pose features and eye-tracking data. The study explores the effectiveness of predictive models in evaluating driver readiness, addressing the challenges of dataset limitations and limited ground truth labels. Machine learning techniques, including LSTM architectures, are utilised to model driver readiness based on the Spatio-temporal status of the driver's head pose and eye gaze. The experiments in this article revealed that a Bidirectional LSTM architecture, combining both feature sets, achieves a mean absolute error of 0.363 on the DMD dataset, d",
    "path": "papers/24/01/2401.11284.json",
    "total_tokens": 929,
    "translated_title": "通过眼动数据和头部姿势评估有条件自动驾驶车辆中驾驶员的准备性",
    "translated_abstract": "随着自动驾驶技术的进步，驾驶员在有条件自动驾驶车辆中恢复对车辆控制的角色变得越来越关键。在SAE Level 3或部分自动化的车辆中，驾驶员需要在必要时保持可用和准备好介入。因此，准确评估他们的准备性至关重要。本文通过结合头部姿势特征和眼动数据对驾驶员准备性评估进行了全面分析。该研究探讨了预测模型在评估驾驶员准备性方面的有效性，解决了数据集限制和有限的真实标签的挑战。利用机器学习技术，包括LSTM体系结构，建模驾驶员准备性基于驾驶员头部姿势和注视的时空状态。本文的实验结果显示，结合两个特征集的双向LSTM体系结构在DMD数据集上达到了0.363的平均绝对误差。",
    "tldr": "本文通过结合头部姿势特征和眼动数据对驾驶员在有条件自动驾驶车辆中的准备性进行了全面分析，通过使用LSTM体系结构的机器学习技术进行建模，成功地评估了驾驶员的准备性。",
    "en_tdlr": "This article presents a comprehensive analysis of driver readiness in conditionally automated vehicles by combining head pose features and eye-tracking data. Machine learning techniques, including LSTM architectures, are used to model driver readiness, achieving successful evaluation."
}