{
    "title": "Interplay between Cryptocurrency Transactions and Online Financial Forums. (arXiv:2401.10238v1 [q-fin.GN])",
    "abstract": "Cryptocurrencies are a type of digital money meant to provide security and anonymity while using cryptography techniques. Although cryptocurrencies represent a breakthrough and provide some important benefits, their usage poses some risks that are a result of the lack of supervising institutions and transparency. Because disinformation and volatility is discouraging for personal investors, cryptocurrencies emerged hand-in-hand with the proliferation of online users' communities and forums as places to share information that can alleviate users' mistrust. This research focuses on the study of the interplay between these cryptocurrency forums and fluctuations in cryptocurrency values. In particular, the most popular cryptocurrency Bitcoin (BTC) and a related active discussion community, Bitcointalk, are analyzed. This study shows that the activity of Bitcointalk forum keeps a direct relationship with the trend in the values of BTC, therefore analysis of this interaction would be a perfec",
    "link": "http://arxiv.org/abs/2401.10238",
    "context": "Title: Interplay between Cryptocurrency Transactions and Online Financial Forums. (arXiv:2401.10238v1 [q-fin.GN])\nAbstract: Cryptocurrencies are a type of digital money meant to provide security and anonymity while using cryptography techniques. Although cryptocurrencies represent a breakthrough and provide some important benefits, their usage poses some risks that are a result of the lack of supervising institutions and transparency. Because disinformation and volatility is discouraging for personal investors, cryptocurrencies emerged hand-in-hand with the proliferation of online users' communities and forums as places to share information that can alleviate users' mistrust. This research focuses on the study of the interplay between these cryptocurrency forums and fluctuations in cryptocurrency values. In particular, the most popular cryptocurrency Bitcoin (BTC) and a related active discussion community, Bitcointalk, are analyzed. This study shows that the activity of Bitcointalk forum keeps a direct relationship with the trend in the values of BTC, therefore analysis of this interaction would be a perfec",
    "path": "papers/24/01/2401.10238.json",
    "total_tokens": 868,
    "translated_title": "加密货币交易和在线金融论坛的相互作用",
    "translated_abstract": "加密货币是一种使用密码技术提供安全性和匿名性的数字货币。尽管加密货币代表了一项突破并提供了一些重要的好处，但它们的使用也带来了一些风险，这是因为缺乏监管机构和透明度所导致的。由于虚假信息和价格波动会让个人投资者感到沮丧，因此加密货币的出现与在线用户社区和论坛的蓬勃发展同时进行，这些地方可以共享信息以减轻用户的不信任。本研究重点研究了加密货币论坛与加密货币价值波动之间的相互作用。具体来说，我们分析了最流行的加密货币比特币（BTC）和相关活跃的讨论社区Bitcointalk。研究表明，Bitcointalk论坛的活动与BTC的趋势保持直接关系，因此分析这种交互作用将是一个完美的方法。",
    "tldr": "本研究关注加密货币论坛与加密货币价值波动之间的相互作用，发现Bitcointalk论坛的活动与比特币的趋势有直接关系。",
    "en_tdlr": "This study focuses on the interplay between cryptocurrency forums and fluctuations in cryptocurrency values. It shows that the activity of Bitcointalk forum is directly related to the trend in the values of Bitcoin."
}