{
    "title": "When eBPF Meets Machine Learning: On-the-fly OS Kernel Compartmentalization. (arXiv:2401.05641v1 [cs.OS])",
    "abstract": "Compartmentalization effectively prevents initial corruption from turning into a successful attack. This paper presents O2C, a pioneering system designed to enforce OS kernel compartmentalization on the fly. It not only provides immediate remediation for sudden threats but also maintains consistent system availability through the enforcement process.  O2C is empowered by the newest advancements of the eBPF ecosystem which allows to instrument eBPF programs that perform enforcement actions into the kernel at runtime. O2C takes the lead in embedding a machine learning model into eBPF programs, addressing unique challenges in on-the-fly compartmentalization. Our comprehensive evaluation shows that O2C effectively confines damage within the compartment. Further, we validate that decision tree is optimally suited for O2C owing to its advantages in processing tabular data, its explainable nature, and its compliance with the eBPF ecosystem. Last but not least, O2C is lightweight, showing negl",
    "link": "http://arxiv.org/abs/2401.05641",
    "context": "Title: When eBPF Meets Machine Learning: On-the-fly OS Kernel Compartmentalization. (arXiv:2401.05641v1 [cs.OS])\nAbstract: Compartmentalization effectively prevents initial corruption from turning into a successful attack. This paper presents O2C, a pioneering system designed to enforce OS kernel compartmentalization on the fly. It not only provides immediate remediation for sudden threats but also maintains consistent system availability through the enforcement process.  O2C is empowered by the newest advancements of the eBPF ecosystem which allows to instrument eBPF programs that perform enforcement actions into the kernel at runtime. O2C takes the lead in embedding a machine learning model into eBPF programs, addressing unique challenges in on-the-fly compartmentalization. Our comprehensive evaluation shows that O2C effectively confines damage within the compartment. Further, we validate that decision tree is optimally suited for O2C owing to its advantages in processing tabular data, its explainable nature, and its compliance with the eBPF ecosystem. Last but not least, O2C is lightweight, showing negl",
    "path": "papers/24/01/2401.05641.json",
    "total_tokens": 908,
    "translated_title": "当eBPF遇见机器学习：即时操作系统内核隔离",
    "translated_abstract": "隔离有效地防止初始污染转化为成功的攻击。本文介绍了O2C，一个创新的系统，旨在实时强制执行操作系统内核的隔离。它不仅能够迅速应对突发威胁，还通过执行过程维持系统的稳定性。O2C利用了eBPF生态系统的最新进展，可以在运行时将执行操作的eBPF程序嵌入内核。O2C在eBPF程序中嵌入了机器学习模型，解决了即时隔离中的独特挑战。我们进行了全面评估，证明O2C能有效限制损害在隔离区内的扩散。此外，我们验证了决策树在O2C中具有优势，因为它能够处理表格数据、具有可解释性，并与eBPF生态系统相兼容。最后，O2C具有轻量级的特点，几乎不可感知系统的负担。",
    "tldr": "本文介绍了O2C系统，通过在运行时嵌入机器学习模型到eBPF程序中，将操作系统内核隔离的能力与即时应对威胁的功能相结合，在保障系统稳定性的同时有效限制损害扩散。",
    "en_tdlr": "This paper presents O2C, a system that combines OS kernel compartmentalization with on-the-fly threat mitigation by embedding machine learning models into eBPF programs at runtime, effectively confining damage while ensuring system availability."
}