{
    "title": "AIRI: Predicting Retention Indices and their Uncertainties using Artificial Intelligence. (arXiv:2401.01506v1 [cs.LG])",
    "abstract": "The Kov\\'ats Retention index (RI) is a quantity measured using gas chromatography and commonly used in the identification of chemical structures. Creating libraries of observed RI values is a laborious task, so we explore the use of a deep neural network for predicting RI values from structure for standard semipolar columns. This network generated predictions with a mean absolute error of 15.1 and, in a quantification of the tail of the error distribution, a 95th percentile absolute error of 46.5. Because of the Artificial Intelligence Retention Indices (AIRI) network's accuracy, it was used to predict RI values for the NIST EI-MS spectral libraries. These RI values are used to improve chemical identification methods and the quality of the library. Estimating uncertainty is an important practical need when using prediction models. To quantify the uncertainty of our network for each individual prediction, we used the outputs of an ensemble of 8 networks to calculate a predicted standard",
    "link": "http://arxiv.org/abs/2401.01506",
    "context": "Title: AIRI: Predicting Retention Indices and their Uncertainties using Artificial Intelligence. (arXiv:2401.01506v1 [cs.LG])\nAbstract: The Kov\\'ats Retention index (RI) is a quantity measured using gas chromatography and commonly used in the identification of chemical structures. Creating libraries of observed RI values is a laborious task, so we explore the use of a deep neural network for predicting RI values from structure for standard semipolar columns. This network generated predictions with a mean absolute error of 15.1 and, in a quantification of the tail of the error distribution, a 95th percentile absolute error of 46.5. Because of the Artificial Intelligence Retention Indices (AIRI) network's accuracy, it was used to predict RI values for the NIST EI-MS spectral libraries. These RI values are used to improve chemical identification methods and the quality of the library. Estimating uncertainty is an important practical need when using prediction models. To quantify the uncertainty of our network for each individual prediction, we used the outputs of an ensemble of 8 networks to calculate a predicted standard",
    "path": "papers/24/01/2401.01506.json",
    "total_tokens": 859,
    "translated_title": "AIRI: 使用人工智能预测保留指数及其不确定性",
    "translated_abstract": "Kovát's保留指数（RI）是使用气相色谱测量的化学结构鉴定中常用的指标。由于创建观察到的RI值的库是一项费时费力的任务，因此我们探索了使用深度神经网络从结构预测标准半极性柱的RI值。该网络生成的预测的平均绝对误差为15.1，在误差分布尾部的量化中，95%的绝对误差为46.5。由于人工智能保留指数（AIRI）网络的准确性，它被用于预测NIST EI-MS光谱库的RI值。这些RI值用于改进化学鉴定方法和提高库的质量。在使用预测模型时，估算不确定性是一项重要的实际需求。为了量化我们网络对每个单独预测的不确定性，我们使用了8个网络的输出来计算预测的标准",
    "tldr": "使用深度神经网络预测化合物保留指数，并量化其不确定性，以改善化学鉴定方法和库的质量。 (Predict the retention index of compounds using a deep neural network and quantify the uncertainty to enhance chemical identification methods and library quality.)",
    "en_tdlr": "Predict the retention index of compounds using a deep neural network and quantify the uncertainty to enhance chemical identification methods and library quality."
}