{
    "title": "Exploring the Reasoning Abilities of Multimodal Large Language Models (MLLMs): A Comprehensive Survey on Emerging Trends in Multimodal Reasoning. (arXiv:2401.06805v2 [cs.CL] UPDATED)",
    "abstract": "Strong Artificial Intelligence (Strong AI) or Artificial General Intelligence (AGI) with abstract reasoning ability is the goal of next-generation AI. Recent advancements in Large Language Models (LLMs), along with the emerging field of Multimodal Large Language Models (MLLMs), have demonstrated impressive capabilities across a wide range of multimodal tasks and applications. Particularly, various MLLMs, each with distinct model architectures, training data, and training stages, have been evaluated across a broad range of MLLM benchmarks. These studies have, to varying degrees, revealed different aspects of the current capabilities of MLLMs. However, the reasoning abilities of MLLMs have not been systematically investigated. In this survey, we comprehensively review the existing evaluation protocols of multimodal reasoning, categorize and illustrate the frontiers of MLLMs, introduce recent trends in applications of MLLMs on reasoning-intensive tasks, and finally discuss current practic",
    "link": "http://arxiv.org/abs/2401.06805",
    "context": "Title: Exploring the Reasoning Abilities of Multimodal Large Language Models (MLLMs): A Comprehensive Survey on Emerging Trends in Multimodal Reasoning. (arXiv:2401.06805v2 [cs.CL] UPDATED)\nAbstract: Strong Artificial Intelligence (Strong AI) or Artificial General Intelligence (AGI) with abstract reasoning ability is the goal of next-generation AI. Recent advancements in Large Language Models (LLMs), along with the emerging field of Multimodal Large Language Models (MLLMs), have demonstrated impressive capabilities across a wide range of multimodal tasks and applications. Particularly, various MLLMs, each with distinct model architectures, training data, and training stages, have been evaluated across a broad range of MLLM benchmarks. These studies have, to varying degrees, revealed different aspects of the current capabilities of MLLMs. However, the reasoning abilities of MLLMs have not been systematically investigated. In this survey, we comprehensively review the existing evaluation protocols of multimodal reasoning, categorize and illustrate the frontiers of MLLMs, introduce recent trends in applications of MLLMs on reasoning-intensive tasks, and finally discuss current practic",
    "path": "papers/24/01/2401.06805.json",
    "total_tokens": 937,
    "translated_title": "探索多模态大语言模型（MLLMs）的推理能力：关于多模态推理新趋势的综合调查",
    "translated_abstract": "强人工智能（Strong AI）或人工通用智能（AGI）具备抽象推理能力是下一代人工智能的目标。近年来，大型语言模型（LLMs）以及新兴的多模态大语言模型（MLLMs）领域展示出了令人印象深刻的跨界性能和应用潜力。特别是，不同的MLLMs通过不同的模型架构、训练数据和训练阶段进行了广泛的MLLM基准评估。这些研究在不同程度上揭示了MLLMs当前的能力。然而，MLLMs的推理能力还没有得到系统的调查。在本调查中，我们全面回顾了现有的多模态推理评估协议，对MLLMs的前沿进行分类和揭示，介绍了MLLMs在推理密集型任务上的最新趋势，并最终讨论了当前的实践",
    "tldr": "这篇综述调查了多模态大语言模型（MLLMs）的推理能力，包括评估协议、模型前沿和推理密集型任务的应用，旨在实现强人工智能（Strong AI）或人工通用智能（AGI）的抽象推理能力。",
    "en_tdlr": "This comprehensive survey explores the reasoning abilities of Multimodal Large Language Models (MLLMs), including evaluation protocols, model frontiers, and applications in reasoning-intensive tasks, aiming to achieve abstract reasoning ability in Strong Artificial Intelligence (Strong AI) or Artificial General Intelligence (AGI)."
}