{
    "title": "Deep OFDM Channel Estimation: Capturing Frequency Recurrence. (arXiv:2401.05436v1 [eess.SP])",
    "abstract": "In this paper, we propose a deep-learning-based channel estimation scheme in an orthogonal frequency division multiplexing (OFDM) system. Our proposed method, named Single Slot Recurrence Along Frequency Network (SisRafNet), is based on a novel study of recurrent models for exploiting sequential behavior of channels across frequencies. Utilizing the fact that wireless channels have a high degree of correlation across frequencies, we employ recurrent neural network techniques within a single OFDM slot, thus overcoming the latency and memory constraints typically associated with recurrence based methods. The proposed SisRafNet delivers superior estimation performance compared to existing deep-learning-based channel estimation techniques and the performance has been validated on a wide range of 3rd Generation Partnership Project (3GPP) compliant channel scenarios at multiple signal-to-noise ratios.",
    "link": "http://arxiv.org/abs/2401.05436",
    "context": "Title: Deep OFDM Channel Estimation: Capturing Frequency Recurrence. (arXiv:2401.05436v1 [eess.SP])\nAbstract: In this paper, we propose a deep-learning-based channel estimation scheme in an orthogonal frequency division multiplexing (OFDM) system. Our proposed method, named Single Slot Recurrence Along Frequency Network (SisRafNet), is based on a novel study of recurrent models for exploiting sequential behavior of channels across frequencies. Utilizing the fact that wireless channels have a high degree of correlation across frequencies, we employ recurrent neural network techniques within a single OFDM slot, thus overcoming the latency and memory constraints typically associated with recurrence based methods. The proposed SisRafNet delivers superior estimation performance compared to existing deep-learning-based channel estimation techniques and the performance has been validated on a wide range of 3rd Generation Partnership Project (3GPP) compliant channel scenarios at multiple signal-to-noise ratios.",
    "path": "papers/24/01/2401.05436.json",
    "total_tokens": 814,
    "translated_title": "深度OFDM信道估计: 捕获频率重复性",
    "translated_abstract": "本文提出了一种基于深度学习的正交频分复用(OFDM)系统中的信道估计方案。我们提出的方法，命名为Single Slot Recurrence Along Frequency Network (SisRafNet)，是基于对频率间通道序列行为的新颖研究。利用无线信道在频率上具有高度相关性这一事实，我们在单个OFDM时隙内采用了循环神经网络技术，从而克服了通常与循环相关方法相关的延迟和内存限制。与现有的基于深度学习的信道估计技术相比，所提出的SisRafNet具有更优越的估计性能，并且在多种信噪比下针对多个符合第三代合作伙伴计划(3GPP)标准的信道场景进行了验证。",
    "tldr": "本文提出了一种基于深度学习的OFDM信道估计方案，通过在单个OFDM时隙内利用无线信道频率间的相关性，使用循环神经网络技术实现了超越现有方法的信道估计性能。",
    "en_tdlr": "This paper proposes a deep-learning-based channel estimation scheme in an OFDM system, utilizing the correlation across frequencies and overcoming the limitations of latency and memory. The proposed method achieves superior estimation performance compared to existing techniques."
}