{
    "title": "PANDORA: A Parallel Dendrogram Construction Algorithm for Single Linkage Clustering on GPU. (arXiv:2401.06089v1 [cs.LG])",
    "abstract": "This paper presents \\pandora, a novel parallel algorithm for efficiently constructing dendrograms for single-linkage hierarchical clustering, including \\hdbscan. Traditional dendrogram construction methods from a minimum spanning tree (MST), such as agglomerative or divisive techniques, often fail to efficiently parallelize, especially with skewed dendrograms common in real-world data.  \\pandora addresses these challenges through a unique recursive tree contraction method, which simplifies the tree for initial dendrogram construction and then progressively reconstructs the complete dendrogram. This process makes \\pandora asymptotically work-optimal, independent of dendrogram skewness. All steps in \\pandora are fully parallel and suitable for massively threaded accelerators such as GPUs.  Our implementation is written in Kokkos, providing support for both CPUs and multi-vendor GPUs (e.g., Nvidia, AMD). The multithreaded version of \\pandora is 2.2$\\times$ faster than the current best-mul",
    "link": "http://arxiv.org/abs/2401.06089",
    "context": "Title: PANDORA: A Parallel Dendrogram Construction Algorithm for Single Linkage Clustering on GPU. (arXiv:2401.06089v1 [cs.LG])\nAbstract: This paper presents \\pandora, a novel parallel algorithm for efficiently constructing dendrograms for single-linkage hierarchical clustering, including \\hdbscan. Traditional dendrogram construction methods from a minimum spanning tree (MST), such as agglomerative or divisive techniques, often fail to efficiently parallelize, especially with skewed dendrograms common in real-world data.  \\pandora addresses these challenges through a unique recursive tree contraction method, which simplifies the tree for initial dendrogram construction and then progressively reconstructs the complete dendrogram. This process makes \\pandora asymptotically work-optimal, independent of dendrogram skewness. All steps in \\pandora are fully parallel and suitable for massively threaded accelerators such as GPUs.  Our implementation is written in Kokkos, providing support for both CPUs and multi-vendor GPUs (e.g., Nvidia, AMD). The multithreaded version of \\pandora is 2.2$\\times$ faster than the current best-mul",
    "path": "papers/24/01/2401.06089.json",
    "total_tokens": 943,
    "translated_title": "PANDORA：GPU上用于单链接聚类的并行树状图构建算法",
    "translated_abstract": "本文介绍了PANDORA，一种用于高效构建单链接层次聚类的树状图的并行算法，包括HDSCAN。传统的最小生成树基础的树状图构建方法，例如凝聚或分裂技术，通常难以进行有效的并行化，尤其是对于在现实世界数据中常见的倾斜树状图。PANDORA通过独特的递归树收缩方法解决了这些挑战，该方法简化了树状图的初始构建过程，然后逐步重建完整的树状图。该过程使得PANDORA在渐进意义下工作最优，与树状图的倾斜程度无关。PANDORA的所有步骤都是完全并行的，适用于大规模线程加速器，如GPU。我们的实现使用Kokkos编写，支持CPU和多供应商的GPU（例如Nvidia、AMD）。多线程版本的PANDORA比当前最佳的多线程版本快2.2倍。",
    "tldr": "PANDORA 是一种用于单链接聚类的并行树状图构建算法，通过独特的递归树收缩方法解决了传统方法并行化困难的问题，实现了渐进意义下的工作最优，并且适用于大规模线程加速器。",
    "en_tdlr": "PANDORA is a parallel algorithm for constructing dendrograms for single-linkage hierarchical clustering, addressing the challenge of parallelization in traditional methods. It achieves asymptotic work optimality through a unique recursive tree contraction method and is suitable for massively threaded accelerators."
}