{
    "title": "SpotV2Net: Multivariate Intraday Spot Volatility Forecasting via Vol-of-Vol-Informed Graph Attention Networks. (arXiv:2401.06249v1 [q-fin.ST])",
    "abstract": "This paper introduces SpotV2Net, a multivariate intraday spot volatility forecasting model based on a Graph Attention Network architecture. SpotV2Net represents financial assets as nodes within a graph and includes non-parametric high-frequency Fourier estimates of the spot volatility and co-volatility as node features. Further, it incorporates Fourier estimates of the spot volatility of volatility and co-volatility of volatility as features for node edges. We test the forecasting accuracy of SpotV2Net in an extensive empirical exercise, conducted with high-frequency prices of the components of the Dow Jones Industrial Average index. The results we obtain suggest that SpotV2Net shows improved accuracy, compared to alternative econometric and machine-learning-based models. Further, our results show that SpotV2Net maintains accuracy when performing intraday multi-step forecasts. To interpret the forecasts produced by SpotV2Net, we employ GNNExplainer, a model-agnostic interpretability to",
    "link": "http://arxiv.org/abs/2401.06249",
    "context": "Title: SpotV2Net: Multivariate Intraday Spot Volatility Forecasting via Vol-of-Vol-Informed Graph Attention Networks. (arXiv:2401.06249v1 [q-fin.ST])\nAbstract: This paper introduces SpotV2Net, a multivariate intraday spot volatility forecasting model based on a Graph Attention Network architecture. SpotV2Net represents financial assets as nodes within a graph and includes non-parametric high-frequency Fourier estimates of the spot volatility and co-volatility as node features. Further, it incorporates Fourier estimates of the spot volatility of volatility and co-volatility of volatility as features for node edges. We test the forecasting accuracy of SpotV2Net in an extensive empirical exercise, conducted with high-frequency prices of the components of the Dow Jones Industrial Average index. The results we obtain suggest that SpotV2Net shows improved accuracy, compared to alternative econometric and machine-learning-based models. Further, our results show that SpotV2Net maintains accuracy when performing intraday multi-step forecasts. To interpret the forecasts produced by SpotV2Net, we employ GNNExplainer, a model-agnostic interpretability to",
    "path": "papers/24/01/2401.06249.json",
    "total_tokens": 1027,
    "translated_title": "SpotV2Net：基于Vol-of-Vol-Informed Graph Attention Networks的多元日内现货波动率预测",
    "translated_abstract": "本文介绍了一种基于图注意力网络结构的多元日内现货波动率预测模型SpotV2Net。SpotV2Net将金融资产表示为图中的节点，并将现货波动率和共波动率的非参数高频傅里叶估计作为节点特征。此外，它还将波动率的傅里叶估计和波动率的共波动率作为节点边缘的特征。我们使用道琼斯工业指数成分股的高频价格进行了大量的实证实验来测试SpotV2Net的预测准确性。我们得到的结果表明，与其他计量经济学和机器学习模型相比，SpotV2Net显示出更高的准确性。此外，我们的结果还表明，SpotV2Net在进行日内多步预测时保持准确性。为了解释SpotV2Net产生的预测结果，我们采用了GNNExplainer，这是一个与模型无关的可解释性方法。",
    "tldr": "SpotV2Net是一种基于图注意力网络的多元日内现货波动率预测模型，通过将金融资产表示为图中的节点，并考虑非参数高频傅里叶估计的现货波动率和共波动率作为节点特征，以及波动率和共波动率的傅里叶估计作为节点边缘的特征，SpotV2Net显示出了改进的准确性，并且在日内多步预测时保持了准确性。",
    "en_tdlr": "SpotV2Net is a multivariate intraday spot volatility forecasting model based on Graph Attention Network. It represents financial assets as nodes in a graph and includes non-parametric high-frequency Fourier estimates of spot volatility and co-volatility as node features, as well as Fourier estimates of volatility of volatility and co-volatility of volatility as edge features. SpotV2Net shows improved accuracy compared to other econometric and machine-learning-based models and maintains accuracy in intraday multi-step forecasts."
}