{
    "title": "Deep Learning with Information Fusion and Model Interpretation for Health Monitoring of Fetus based on Long-term Prenatal Electronic Fetal Heart Rate Monitoring Data. (arXiv:2401.15337v1 [cs.LG])",
    "abstract": "Long-term fetal heart rate (FHR) monitoring during the antepartum period, increasingly popularized by electronic FHR monitoring, represents a growing approach in FHR monitoring. This kind of continuous monitoring, in contrast to the short-term one, collects an extended period of fetal heart data. This offers a more comprehensive understanding of fetus's conditions. However, the interpretation of long-term antenatal fetal heart monitoring is still in its early stages, lacking corresponding clinical standards. Furthermore, the substantial amount of data generated by continuous monitoring imposes a significant burden on clinical work when analyzed manually. To address above challenges, this study develops an automatic analysis system named LARA (Long-term Antepartum Risk Analysis system) for continuous FHR monitoring, combining deep learning and information fusion methods. LARA's core is a well-established convolutional neural network (CNN) model. It processes long-term FHR data as input ",
    "link": "http://arxiv.org/abs/2401.15337",
    "context": "Title: Deep Learning with Information Fusion and Model Interpretation for Health Monitoring of Fetus based on Long-term Prenatal Electronic Fetal Heart Rate Monitoring Data. (arXiv:2401.15337v1 [cs.LG])\nAbstract: Long-term fetal heart rate (FHR) monitoring during the antepartum period, increasingly popularized by electronic FHR monitoring, represents a growing approach in FHR monitoring. This kind of continuous monitoring, in contrast to the short-term one, collects an extended period of fetal heart data. This offers a more comprehensive understanding of fetus's conditions. However, the interpretation of long-term antenatal fetal heart monitoring is still in its early stages, lacking corresponding clinical standards. Furthermore, the substantial amount of data generated by continuous monitoring imposes a significant burden on clinical work when analyzed manually. To address above challenges, this study develops an automatic analysis system named LARA (Long-term Antepartum Risk Analysis system) for continuous FHR monitoring, combining deep learning and information fusion methods. LARA's core is a well-established convolutional neural network (CNN) model. It processes long-term FHR data as input ",
    "path": "papers/24/01/2401.15337.json",
    "total_tokens": 962,
    "translated_title": "基于深度学习和信息融合的长期产前电子胎儿心率监测健康监测技术研究",
    "translated_abstract": "胎儿心率（FHR）的长期监测在产前期间越来越受欢迎，其中电子FHR监测被广泛采用。与短期监测相比，这种连续监测可以收集更长时间的胎儿心率数据，从而更全面地了解胎儿的情况。然而，长期产前胎儿心率监测的解释仍处于早期阶段，缺乏相应的临床标准。此外，连续监测产生的大量数据在手动分析时对临床工作造成了重大负担。为了解决上述挑战，本研究开发了一个名为LARA（长期产前风险分析系统）的自动分析系统，结合了深度学习和信息融合方法。LARA的核心是一个成熟的卷积神经网络（CNN）模型，它将长期的FHR数据作为输入进行处理。",
    "tldr": "本研究通过结合深度学习和信息融合方法，开发了一个名为LARA的自动分析系统，用于长期产前电子胎儿心率监测。该系统通过卷积神经网络模型处理长期的FHR数据，提供了更全面的对胎儿状态的理解。",
    "en_tdlr": "This study develops an automatic analysis system named LARA for long-term prenatal electronic fetal heart rate monitoring, combining deep learning and information fusion methods. It uses a well-established convolutional neural network (CNN) model to process the long-term FHR data, providing a more comprehensive understanding of the fetus's condition."
}