{
    "title": "Redefining Recon: Bridging Gaps with UAVs, 360 degree Cameras, and Neural Radiance Fields. (arXiv:2401.06143v1 [cs.CV])",
    "abstract": "In the realm of digital situational awareness during disaster situations, accurate digital representations, like 3D models, play an indispensable role. To ensure the safety of rescue teams, robotic platforms are often deployed to generate these models. In this paper, we introduce an innovative approach that synergizes the capabilities of compact Unmaned Arial Vehicles (UAVs), smaller than 30 cm, equipped with 360 degree cameras and the advances of Neural Radiance Fields (NeRFs). A NeRF, a specialized neural network, can deduce a 3D representation of any scene using 2D images and then synthesize it from various angles upon request. This method is especially tailored for urban environments which have experienced significant destruction, where the structural integrity of buildings is compromised to the point of barring entry-commonly observed post-earthquakes and after severe fires. We have tested our approach through recent post-fire scenario, underlining the efficacy of NeRFs even in ch",
    "link": "http://arxiv.org/abs/2401.06143",
    "context": "Title: Redefining Recon: Bridging Gaps with UAVs, 360 degree Cameras, and Neural Radiance Fields. (arXiv:2401.06143v1 [cs.CV])\nAbstract: In the realm of digital situational awareness during disaster situations, accurate digital representations, like 3D models, play an indispensable role. To ensure the safety of rescue teams, robotic platforms are often deployed to generate these models. In this paper, we introduce an innovative approach that synergizes the capabilities of compact Unmaned Arial Vehicles (UAVs), smaller than 30 cm, equipped with 360 degree cameras and the advances of Neural Radiance Fields (NeRFs). A NeRF, a specialized neural network, can deduce a 3D representation of any scene using 2D images and then synthesize it from various angles upon request. This method is especially tailored for urban environments which have experienced significant destruction, where the structural integrity of buildings is compromised to the point of barring entry-commonly observed post-earthquakes and after severe fires. We have tested our approach through recent post-fire scenario, underlining the efficacy of NeRFs even in ch",
    "path": "papers/24/01/2401.06143.json",
    "total_tokens": 991,
    "translated_title": "重新定义侦察：利用无人机，360度摄像头和神经辐射场弥合差距",
    "translated_abstract": "在灾害情况下的数字态势感知领域中，准确的数字表示，如3D模型，发挥着不可或缺的作用。为了确保救援队的安全，通常会部署机器人平台来生成这些模型。在本文中，我们介绍了一种创新的方法，将小于30厘米的紧凑型无人机配备360度摄像头的能力与神经辐射场（NeRFs）的进展相结合。NeRF是一种专门的神经网络，可以利用2D图像推断任何场景的3D表示，然后根据需要从各个角度合成它。这种方法特别适用于经历了巨大破坏的城市环境，其中建筑物的结构完整性已经受损到无法进入的程度-通常在地震后和严重火灾后观察到。我们通过最近的火灾场景测试了我们的方法，强调了NeRFs的有效性，即使在严重破坏的环境下也是如此。",
    "tldr": "本文介绍了一种创新的方法，利用小型无人机配备360度摄像头和神经辐射场（NeRFs）技术，在城市环境中生成精确的3D模型，特别适用于经历严重破坏的场景。我们的方法在火灾场景下经过测试，证明了NeRFs的高效性。",
    "en_tdlr": "This paper introduces an innovative approach that utilizes small UAVs equipped with 360 degree cameras and Neural Radiance Fields (NeRFs) technology to generate accurate 3D models in urban environments, particularly in severely damaged scenarios. Our method has been tested in a post-fire scenario, demonstrating the effectiveness of NeRFs."
}