{
    "title": "Enhancing Surveillance Camera FOV Quality via Semantic Line Detection and Classification with Deep Hough Transform. (arXiv:2401.09515v1 [cs.CV])",
    "abstract": "The quality of recorded videos and images is significantly influenced by the camera's field of view (FOV). In critical applications like surveillance systems and self-driving cars, an inadequate FOV can give rise to severe safety and security concerns, including car accidents and thefts due to the failure to detect individuals and objects. The conventional methods for establishing the correct FOV heavily rely on human judgment and lack automated mechanisms to assess video and image quality based on FOV. In this paper, we introduce an innovative approach that harnesses semantic line detection and classification alongside deep Hough transform to identify semantic lines, thus ensuring a suitable FOV by understanding 3D view through parallel lines. Our approach yields an effective F1 score of 0.729 on the public EgoCart dataset, coupled with a notably high median score in the line placement metric. We illustrate that our method offers a straightforward means of assessing the quality of the",
    "link": "http://arxiv.org/abs/2401.09515",
    "context": "Title: Enhancing Surveillance Camera FOV Quality via Semantic Line Detection and Classification with Deep Hough Transform. (arXiv:2401.09515v1 [cs.CV])\nAbstract: The quality of recorded videos and images is significantly influenced by the camera's field of view (FOV). In critical applications like surveillance systems and self-driving cars, an inadequate FOV can give rise to severe safety and security concerns, including car accidents and thefts due to the failure to detect individuals and objects. The conventional methods for establishing the correct FOV heavily rely on human judgment and lack automated mechanisms to assess video and image quality based on FOV. In this paper, we introduce an innovative approach that harnesses semantic line detection and classification alongside deep Hough transform to identify semantic lines, thus ensuring a suitable FOV by understanding 3D view through parallel lines. Our approach yields an effective F1 score of 0.729 on the public EgoCart dataset, coupled with a notably high median score in the line placement metric. We illustrate that our method offers a straightforward means of assessing the quality of the",
    "path": "papers/24/01/2401.09515.json",
    "total_tokens": 925,
    "translated_title": "通过深度Hough变换和语义线检测与分类提高监控摄像机视野质量",
    "translated_abstract": "拍摄的视频和图像的质量受到摄像机的视野范围（FOV）的显著影响。在监控系统和自动驾驶汽车等关键应用中，不适当的FOV可能导致严重的安全问题，包括由于未能检测到个体和物体而造成的车辆事故和窃盗。传统的确定正确FOV的方法严重依赖于人类判断，缺乏基于FOV评估视频和图像质量的自动机制。本文介绍了一种创新方法，通过深度Hough变换和语义线检测与分类来识别语义线，从而通过理解平行线的三维视图来确保合适的FOV。我们的方法在公开的EgoCart数据集上获得了0.729的有效F1得分，并在线条放置度量中得到了显著高的中位数得分。我们证明了我们的方法提供了一种简单的评估视频和图像质量的手段。",
    "tldr": "本研究通过使用深度Hough变换和语义线检测与分类来提高监控摄像机的视野质量，从而确保适当的FOV。实验结果表明该方法在评估视频和图像质量方面具有较高的准确性和可靠性。"
}