{
    "title": "Representation Learning in a Decomposed Encoder Design for Bio-inspired Hebbian Learning. (arXiv:2401.08603v1 [cs.NE])",
    "abstract": "Modern data-driven machine learning system designs exploit inductive biases on architectural structure, invariance and equivariance requirements, task specific loss functions, and computational optimization tools. Previous works have illustrated that inductive bias in the early layers of the encoder in the form of human specified quasi-invariant filters can serve as a powerful inductive bias to attain better robustness and transparency in learned classifiers. This paper explores this further in the context of representation learning with local plasticity rules i.e. bio-inspired Hebbian learning . We propose a modular framework trained with a bio-inspired variant of contrastive predictive coding (Hinge CLAPP Loss). Our framework is composed of parallel encoders each leveraging a different invariant visual descriptor as an inductive bias. We evaluate the representation learning capacity of our system in a classification scenario on image data of various difficulties (GTSRB, STL10, CODEBR",
    "link": "http://arxiv.org/abs/2401.08603",
    "context": "Title: Representation Learning in a Decomposed Encoder Design for Bio-inspired Hebbian Learning. (arXiv:2401.08603v1 [cs.NE])\nAbstract: Modern data-driven machine learning system designs exploit inductive biases on architectural structure, invariance and equivariance requirements, task specific loss functions, and computational optimization tools. Previous works have illustrated that inductive bias in the early layers of the encoder in the form of human specified quasi-invariant filters can serve as a powerful inductive bias to attain better robustness and transparency in learned classifiers. This paper explores this further in the context of representation learning with local plasticity rules i.e. bio-inspired Hebbian learning . We propose a modular framework trained with a bio-inspired variant of contrastive predictive coding (Hinge CLAPP Loss). Our framework is composed of parallel encoders each leveraging a different invariant visual descriptor as an inductive bias. We evaluate the representation learning capacity of our system in a classification scenario on image data of various difficulties (GTSRB, STL10, CODEBR",
    "path": "papers/24/01/2401.08603.json",
    "total_tokens": 904,
    "translated_title": "基于分解编码器设计的生物启发式Hebbian学习中的表示学习",
    "translated_abstract": "现代数据驱动的机器学习系统设计利用了对架构结构的归纳偏见、不变性和等变性要求、任务特定的损失函数以及计算优化工具。先前的工作表明，编码器的早期层中的归纳偏见，以人为指定的准不变滤波器的形式，可以作为一种强大的归纳偏见，实现更好的鲁棒性和透明度。本文在生物启发式Hebbian学习的表示学习上进一步探索了这一点。我们提出了一个模块化框架，使用生物启发式的对比预测编码（Hinge CLAPP Loss）进行训练。我们的框架由多个并行编码器组成，每个编码器利用不同的不变视觉描述符作为归纳偏见。我们在不同难度的图像数据上的分类场景中评估了我们系统的表示学习能力（GTSRB, STL10, CODEBR）",
    "tldr": "这项研究探索了在生物启发式Hebbian学习中的表示学习，并提出了一个模块化框架，利用不同的不变视觉描述符作为归纳偏见。该框架在图像分类任务上展示了较好的鲁棒性和透明度。"
}