{
    "title": "MatSciRE: Leveraging Pointer Networks to Automate Entity and Relation Extraction for Material Science Knowledge-base Construction. (arXiv:2401.09839v1 [cs.CL])",
    "abstract": "Material science literature is a rich source of factual information about various categories of entities (like materials and compositions) and various relations between these entities, such as conductivity, voltage, etc. Automatically extracting this information to generate a material science knowledge base is a challenging task. In this paper, we propose MatSciRE (Material Science Relation Extractor), a Pointer Network-based encoder-decoder framework, to jointly extract entities and relations from material science articles as a triplet ($entity1, relation, entity2$). Specifically, we target the battery materials and identify five relations to work on - conductivity, coulombic efficiency, capacity, voltage, and energy. Our proposed approach achieved a much better F1-score (0.771) than a previous attempt using ChemDataExtractor (0.716). The overall graphical framework of MatSciRE is shown in Fig 1. The material information is extracted from material science literature in the form of ent",
    "link": "http://arxiv.org/abs/2401.09839",
    "context": "Title: MatSciRE: Leveraging Pointer Networks to Automate Entity and Relation Extraction for Material Science Knowledge-base Construction. (arXiv:2401.09839v1 [cs.CL])\nAbstract: Material science literature is a rich source of factual information about various categories of entities (like materials and compositions) and various relations between these entities, such as conductivity, voltage, etc. Automatically extracting this information to generate a material science knowledge base is a challenging task. In this paper, we propose MatSciRE (Material Science Relation Extractor), a Pointer Network-based encoder-decoder framework, to jointly extract entities and relations from material science articles as a triplet ($entity1, relation, entity2$). Specifically, we target the battery materials and identify five relations to work on - conductivity, coulombic efficiency, capacity, voltage, and energy. Our proposed approach achieved a much better F1-score (0.771) than a previous attempt using ChemDataExtractor (0.716). The overall graphical framework of MatSciRE is shown in Fig 1. The material information is extracted from material science literature in the form of ent",
    "path": "papers/24/01/2401.09839.json",
    "total_tokens": 955,
    "translated_title": "MatSciRE:利用指针网络自动化材料科学知识库构建中的实体和关系提取",
    "translated_abstract": "材料科学文献是关于各种实体（如材料和成分）和这些实体之间各种关系（如导电性、电压等）的丰富来源。自动提取这些信息以生成一个材料科学知识库是一项具有挑战性的任务。在本文中，我们提出了MatSciRE（材料科学关系提取器），一种基于指针网络的编码器-解码器框架，用于从材料科学文章中同时提取实体和关系作为三元组（$实体1，关系，实体2$）。具体而言，我们针对电池材料，并确定了五个要处理的关系 - 导电性、库伦效率、容量、电压和能量。我们提出的方法在F1分数上取得了比使用ChemDataExtractor（0.716）更好的结果（0.771）。MatSciRE的整体图形框架如图1所示。材料信息以实体和关系的形式从材料科学文献中提取出来。",
    "tldr": "本论文提出了MatSciRE，一种基于指针网络的编码器-解码器框架，用于从材料科学文章中自动提取实体和关系以构建一个材料科学知识库。通过针对电池材料的五个关系的提取任务，我们的方法在F1分数上取得了比之前使用ChemDataExtractor更好的结果。",
    "en_tdlr": "This paper introduces MatSciRE, a Pointer Network-based encoder-decoder framework for automating entity and relation extraction from material science articles to construct a material science knowledge base. By targeting five relations related to battery materials, our proposed approach achieved a better F1-score compared to using ChemDataExtractor."
}