{
    "title": "The Tactician's Web of Large-Scale Formal Knowledge. (arXiv:2401.02950v1 [cs.LO])",
    "abstract": "The Tactician's Web is a platform offering a large web of strongly interconnected, machine-checked, formal mathematical knowledge conveniently packaged for machine learning, analytics, and proof engineering. Built on top of the Coq proof assistant, the platform exports a dataset containing a wide variety of formal theories, presented as a web of definitions, theorems, proof terms, tactics, and proof states. Theories are encoded both as a semantic graph (rendered below) and as human-readable text, each with a unique set of advantages and disadvantages. Proving agents may interact with Coq through the same rich data representation and can be automatically benchmarked on a set of theorems. Tight integration with Coq provides the unique possibility to make agents available to proof engineers as practical tools.",
    "link": "http://arxiv.org/abs/2401.02950",
    "context": "Title: The Tactician's Web of Large-Scale Formal Knowledge. (arXiv:2401.02950v1 [cs.LO])\nAbstract: The Tactician's Web is a platform offering a large web of strongly interconnected, machine-checked, formal mathematical knowledge conveniently packaged for machine learning, analytics, and proof engineering. Built on top of the Coq proof assistant, the platform exports a dataset containing a wide variety of formal theories, presented as a web of definitions, theorems, proof terms, tactics, and proof states. Theories are encoded both as a semantic graph (rendered below) and as human-readable text, each with a unique set of advantages and disadvantages. Proving agents may interact with Coq through the same rich data representation and can be automatically benchmarked on a set of theorems. Tight integration with Coq provides the unique possibility to make agents available to proof engineers as practical tools.",
    "path": "papers/24/01/2401.02950.json",
    "total_tokens": 769,
    "translated_title": "The Tactician's Web的大规模形式知识网络",
    "translated_abstract": "The Tactician's Web是一个平台，提供了一个大规模的强关联的、机器验证的形式化数学知识网络，方便机器学习、分析和证明工程。基于Coq证明助手构建，该平台导出一个包含各种形式理论的数据集，呈现为定义、定理、证明项、策略和证明状态的网络。理论既可以编码为语义图（如下所示），也可以作为可读的文本，各有优缺点。证明代理可以通过相同的丰富数据表示与Coq进行交互，并可以在一组定理上自动进行基准测试。与Coq的紧密集成提供了将代理作为实用工具提供给证明工程师的独特可能性。",
    "tldr": "The Tactician's Web是一个大规模形式化数学知识网络，通过Coq证明助手和丰富的数据表示与证明工程师进行交互，并提供了机器学习、分析和证明工程的实用工具。",
    "en_tdlr": "The Tactician's Web is a large-scale formal mathematical knowledge network that interacts with proof engineers through Coq proof assistant and rich data representation, providing practical tools for machine learning, analytics, and proof engineering."
}