{
    "title": "Emissions Reporting Maturity Model: supporting cities to leverage emissions-related processes through performance indicators and artificial intelligence. (arXiv:2401.00857v1 [cs.CY])",
    "abstract": "Climate change and global warming have been trending topics worldwide since the Eco-92 conference. However, little progress has been made in reducing greenhouse gases (GHGs). The problems and challenges related to emissions are complex and require a concerted and comprehensive effort to address them. Emissions reporting is a critical component of GHG reduction policy and is therefore the focus of this work. The main goal of this work is two-fold: (i) to propose an emission reporting evaluation model to leverage emissions reporting overall quality and (ii) to use artificial intelligence (AI) to support the initiatives that improve emissions reporting. Thus, this work presents an Emissions Reporting Maturity Model (ERMM) for examining, clustering, and analysing data from emissions reporting initiatives to help the cities to deal with climate change and global warming challenges. The Performance Indicator Development Process (PIDP) proposed in this work provides ways to leverage the quali",
    "link": "http://arxiv.org/abs/2401.00857",
    "context": "Title: Emissions Reporting Maturity Model: supporting cities to leverage emissions-related processes through performance indicators and artificial intelligence. (arXiv:2401.00857v1 [cs.CY])\nAbstract: Climate change and global warming have been trending topics worldwide since the Eco-92 conference. However, little progress has been made in reducing greenhouse gases (GHGs). The problems and challenges related to emissions are complex and require a concerted and comprehensive effort to address them. Emissions reporting is a critical component of GHG reduction policy and is therefore the focus of this work. The main goal of this work is two-fold: (i) to propose an emission reporting evaluation model to leverage emissions reporting overall quality and (ii) to use artificial intelligence (AI) to support the initiatives that improve emissions reporting. Thus, this work presents an Emissions Reporting Maturity Model (ERMM) for examining, clustering, and analysing data from emissions reporting initiatives to help the cities to deal with climate change and global warming challenges. The Performance Indicator Development Process (PIDP) proposed in this work provides ways to leverage the quali",
    "path": "papers/24/01/2401.00857.json",
    "total_tokens": 867,
    "translated_title": "排放报告成熟度模型：通过性能指标和人工智能支持城市利用排放相关流程",
    "translated_abstract": "自从“环境与发展会议”(Eco-92)以来，气候变化和全球变暖一直是全球热门话题。然而，在减少温室气体方面进展甚微。排放问题和挑战复杂，需要集中而全面的努力来解决。排放报告是温室气体减排政策的关键组成部分，因此是本研究的重点。本研究的主要目标是两方面：(一)提出一个排放报告评估模型，以提高排放报告的整体质量；(二)利用人工智能支持改善排放报告的倡议。因此，本研究提出了一个排放报告成熟度模型(ERMM)，用于检查、聚类和分析排放报告倡议的数据，并帮助城市应对气候变化和全球变暖挑战。",
    "tldr": "该论文提出了一个排放报告成熟度模型(ERMM)，通过使用性能指标和人工智能技术，支持城市解决气候变化和全球变暖所带来的挑战。",
    "en_tdlr": "This paper proposes an Emissions Reporting Maturity Model (ERMM) to support cities in addressing the challenges of climate change and global warming through the use of performance indicators and artificial intelligence."
}