{
    "title": "Reference-dependent asset pricing with a stochastic consumption-dividend ratio. (arXiv:2401.12856v1 [q-fin.MF])",
    "abstract": "We study a discrete-time consumption-based capital asset pricing model under expectations-based reference-dependent preferences. More precisely, we consider an endowment economy populated by a representative agent who derives utility from current consumption and from gains and losses in consumption with respect to a forward-looking, stochastic reference point. First, we consider a general model in which the agent's preferences include both contemporaneous gain-loss utility, that is, utility from the difference between current consumption and previously held expectations about current consumption, and prospective gain-loss utility, that is, utility from the difference between intertemporal beliefs about future consumption. A semi-closed form solution for equilibrium asset prices is derived for this case. We then specialize to a model in which the agent derives contemporaneous gain-loss utility only, obtaining equilibrium asset prices in closed form. Extensive numerical experiments show ",
    "link": "http://arxiv.org/abs/2401.12856",
    "context": "Title: Reference-dependent asset pricing with a stochastic consumption-dividend ratio. (arXiv:2401.12856v1 [q-fin.MF])\nAbstract: We study a discrete-time consumption-based capital asset pricing model under expectations-based reference-dependent preferences. More precisely, we consider an endowment economy populated by a representative agent who derives utility from current consumption and from gains and losses in consumption with respect to a forward-looking, stochastic reference point. First, we consider a general model in which the agent's preferences include both contemporaneous gain-loss utility, that is, utility from the difference between current consumption and previously held expectations about current consumption, and prospective gain-loss utility, that is, utility from the difference between intertemporal beliefs about future consumption. A semi-closed form solution for equilibrium asset prices is derived for this case. We then specialize to a model in which the agent derives contemporaneous gain-loss utility only, obtaining equilibrium asset prices in closed form. Extensive numerical experiments show ",
    "path": "papers/24/01/2401.12856.json",
    "total_tokens": 902,
    "translated_title": "随机消费-股利比的参考依赖资产定价模型",
    "translated_abstract": "我们研究了基于消费的离散时间资本资产定价模型，在预期为基础的参考依赖偏好下。具体而言，我们考虑一个由一个代表性个体组成的资产配置经济体，该个体从当前消费以及相对于一个前瞻性、随机的参考点而言的消费的收益和损失中获得效用。首先，我们考虑一个包括同时收益-损失效用和预期收益-损失效用的一般模型，即从当前消费和之前对当前消费的预期之间的差异中获得效用，以及从未来消费的跨时期信念之间的差异中获得效用。针对这种情况，我们推导出了均衡资产价格的半闭合形式解。然后，我们进一步研究了一个只考虑同时收益-损失效用的模型，得到了均衡资产价格的闭式解。广泛的数值实验表明",
    "tldr": "本研究基于消费，考虑参考依赖偏好，研究了离散时间资本资产定价模型。研究发现了一般模型的均衡资产价格的半闭合形式解，并在只考虑同时收益-损失效用的模型中得到了闭式解。"
}