{
    "title": "GLIDE-RL: Grounded Language Instruction through DEmonstration in RL. (arXiv:2401.02991v1 [cs.CL])",
    "abstract": "One of the final frontiers in the development of complex human - AI collaborative systems is the ability of AI agents to comprehend the natural language and perform tasks accordingly. However, training efficient Reinforcement Learning (RL) agents grounded in natural language has been a long-standing challenge due to the complexity and ambiguity of the language and sparsity of the rewards, among other factors. Several advances in reinforcement learning, curriculum learning, continual learning, language models have independently contributed to effective training of grounded agents in various environments. Leveraging these developments, we present a novel algorithm, Grounded Language Instruction through DEmonstration in RL (GLIDE-RL) that introduces a teacher-instructor-student curriculum learning framework for training an RL agent capable of following natural language instructions that can generalize to previously unseen language instructions. In this multi-agent framework, the teacher a",
    "link": "http://arxiv.org/abs/2401.02991",
    "context": "Title: GLIDE-RL: Grounded Language Instruction through DEmonstration in RL. (arXiv:2401.02991v1 [cs.CL])\nAbstract: One of the final frontiers in the development of complex human - AI collaborative systems is the ability of AI agents to comprehend the natural language and perform tasks accordingly. However, training efficient Reinforcement Learning (RL) agents grounded in natural language has been a long-standing challenge due to the complexity and ambiguity of the language and sparsity of the rewards, among other factors. Several advances in reinforcement learning, curriculum learning, continual learning, language models have independently contributed to effective training of grounded agents in various environments. Leveraging these developments, we present a novel algorithm, Grounded Language Instruction through DEmonstration in RL (GLIDE-RL) that introduces a teacher-instructor-student curriculum learning framework for training an RL agent capable of following natural language instructions that can generalize to previously unseen language instructions. In this multi-agent framework, the teacher a",
    "path": "papers/24/01/2401.02991.json",
    "total_tokens": 859,
    "translated_title": "GLIDE-RL：基于演示的强化学习中的自然语言指导",
    "translated_abstract": "复杂的人工智能与人类协作系统的最后一项挑战是AI代理能够理解自然语言并相应地执行任务。然而，由于语言的复杂性和歧义性以及奖励的稀疏性等因素，训练有效的基于自然语言的强化学习（RL）代理一直是一个长期的挑战。强化学习、课程学习、持续学习和语言模型的几项进展分别为在不同环境中训练基于自然语言的代理做出了有效贡献。在这些发展的基础上，我们提出了一种新算法GLIDE-RL，通过引入教师-指导员-学生的课程学习框架来培训一个能够遵循自然语言指令，并且能够推广到之前未见的语言指令的RL代理。",
    "tldr": "GLIDE-RL是一种基于演示的强化学习算法，通过引入教师-指导员-学生的课程学习框架，训练出了一个能够遵循自然语言指令并且可以推广到未见指令的RL代理。"
}