{
    "title": "TranSentence: Speech-to-speech Translation via Language-agnostic Sentence-level Speech Encoding without Language-parallel Data. (arXiv:2401.12992v1 [cs.CL])",
    "abstract": "Although there has been significant advancement in the field of speech-to-speech translation, conventional models still require language-parallel speech data between the source and target languages for training. In this paper, we introduce TranSentence, a novel speech-to-speech translation without language-parallel speech data. To achieve this, we first adopt a language-agnostic sentence-level speech encoding that captures the semantic information of speech, irrespective of language. We then train our model to generate speech based on the encoded embedding obtained from a language-agnostic sentence-level speech encoder that is pre-trained with various languages. With this method, despite training exclusively on the target language's monolingual data, we can generate target language speech in the inference stage using language-agnostic speech embedding from the source language speech. Furthermore, we extend TranSentence to multilingual speech-to-speech translation. The experimental resu",
    "link": "http://arxiv.org/abs/2401.12992",
    "context": "Title: TranSentence: Speech-to-speech Translation via Language-agnostic Sentence-level Speech Encoding without Language-parallel Data. (arXiv:2401.12992v1 [cs.CL])\nAbstract: Although there has been significant advancement in the field of speech-to-speech translation, conventional models still require language-parallel speech data between the source and target languages for training. In this paper, we introduce TranSentence, a novel speech-to-speech translation without language-parallel speech data. To achieve this, we first adopt a language-agnostic sentence-level speech encoding that captures the semantic information of speech, irrespective of language. We then train our model to generate speech based on the encoded embedding obtained from a language-agnostic sentence-level speech encoder that is pre-trained with various languages. With this method, despite training exclusively on the target language's monolingual data, we can generate target language speech in the inference stage using language-agnostic speech embedding from the source language speech. Furthermore, we extend TranSentence to multilingual speech-to-speech translation. The experimental resu",
    "path": "papers/24/01/2401.12992.json",
    "total_tokens": 863,
    "translated_title": "通过语言无关的语句级语音编码实现的语音对语音翻译",
    "translated_abstract": "虽然语音到语音翻译领域有了显著的进展，但传统模型仍需要源语言和目标语言之间的语言平行语音数据进行训练。本文介绍了一种新颖的语音到语音翻译方法，该方法不需要语言平行语音数据。为了实现这一点，我们首先采用了一种语言无关的语句级语音编码，它可以捕捉到语音的语义信息，而不受语言的影响。然后我们通过训练模型，基于从语言无关的句子级语音编码器中获得的编码嵌入生成语音。我们可以使用来自源语言语音的语言无关语音嵌入在推理阶段生成目标语言语音，尽管我们仅在目标语言的单语数据上进行训练。此外，我们还将该方法扩展到多语言语音到语音翻译。实验结果证明这种方法的有效性。",
    "tldr": "本文介绍了一种使用语言无关的语句级语音编码实现的语音到语音翻译方法，该方法不需要语言平行语音数据，并且可用于多语言翻译。"
}