{
    "title": "SeqNAS: Neural Architecture Search for Event Sequence Classification. (arXiv:2401.03246v1 [cs.LG])",
    "abstract": "Neural Architecture Search (NAS) methods are widely used in various industries to obtain high quality taskspecific solutions with minimal human intervention. Event Sequences find widespread use in various industrial applications including churn prediction customer segmentation fraud detection and fault diagnosis among others. Such data consist of categorical and real-valued components with irregular timestamps. Despite the usefulness of NAS methods previous approaches only have been applied to other domains images texts or time series. Our work addresses this limitation by introducing a novel NAS algorithm SeqNAS specifically designed for event sequence classification. We develop a simple yet expressive search space that leverages commonly used building blocks for event sequence classification including multihead self attention convolutions and recurrent cells. To perform the search we adopt sequential Bayesian Optimization and utilize previously trained models as an ensemble of teache",
    "link": "http://arxiv.org/abs/2401.03246",
    "context": "Title: SeqNAS: Neural Architecture Search for Event Sequence Classification. (arXiv:2401.03246v1 [cs.LG])\nAbstract: Neural Architecture Search (NAS) methods are widely used in various industries to obtain high quality taskspecific solutions with minimal human intervention. Event Sequences find widespread use in various industrial applications including churn prediction customer segmentation fraud detection and fault diagnosis among others. Such data consist of categorical and real-valued components with irregular timestamps. Despite the usefulness of NAS methods previous approaches only have been applied to other domains images texts or time series. Our work addresses this limitation by introducing a novel NAS algorithm SeqNAS specifically designed for event sequence classification. We develop a simple yet expressive search space that leverages commonly used building blocks for event sequence classification including multihead self attention convolutions and recurrent cells. To perform the search we adopt sequential Bayesian Optimization and utilize previously trained models as an ensemble of teache",
    "path": "papers/24/01/2401.03246.json",
    "total_tokens": 844,
    "translated_title": "SeqNAS: 事件序列分类的神经架构搜索",
    "translated_abstract": "神经架构搜索(NAS)方法广泛应用于各个行业，以获得高质量的任务特定解决方案，最大限度地减少人为干预。事件序列在各种工业应用中得到广泛使用，包括流失预测、客户分割、欺诈检测和故障诊断等。这些数据包括具有不规则时间戳的分类和实数值组件。尽管NAS方法的有用性，但之前的方法仅应用于其他领域的图像、文本或时间序列。我们的工作通过引入一种新颖的NAS算法SeqNAS来解决这个限制，该算法专门用于事件序列分类。我们开发了一个简单但表达力强的搜索空间，利用常用的事件序列分类构建块，包括多头自注意力、卷积和循环单元。为了进行搜索，我们采用了顺序贝叶斯优化，并利用先前训练过的模型作为教师模型的集成。",
    "tldr": "SeqNAS是一种针对事件序列分类的神经架构搜索算法，通过引入一种简单而表达力强的搜索空间，利用常用的构建块进行搜索，提供高质量的任务特定解决方案。",
    "en_tdlr": "SeqNAS is a neural architecture search algorithm specifically designed for event sequence classification, which addresses the limitation of previous approaches and provides high-quality task-specific solutions by introducing a simple and expressive search space leveraging commonly used building blocks."
}