{
    "title": "Space and Time Continuous Physics Simulation From Partial Observations. (arXiv:2401.09198v1 [cs.LG])",
    "abstract": "Modern techniques for physical simulations rely on numerical schemes and mesh-refinement methods to address trade-offs between precision and complexity, but these handcrafted solutions are tedious and require high computational power. Data-driven methods based on large-scale machine learning promise high adaptivity by integrating long-range dependencies more directly and efficiently. In this work, we focus on fluid dynamics and address the shortcomings of a large part of the literature, which are based on fixed support for computations and predictions in the form of regular or irregular grids. We propose a novel setup to perform predictions in a continuous spatial and temporal domain while being trained on sparse observations. We formulate the task as a double observation problem and propose a solution with two interlinked dynamical systems defined on, respectively, the sparse positions and the continuous domain, which allows to forecast and interpolate a solution from the initial cond",
    "link": "http://arxiv.org/abs/2401.09198",
    "context": "Title: Space and Time Continuous Physics Simulation From Partial Observations. (arXiv:2401.09198v1 [cs.LG])\nAbstract: Modern techniques for physical simulations rely on numerical schemes and mesh-refinement methods to address trade-offs between precision and complexity, but these handcrafted solutions are tedious and require high computational power. Data-driven methods based on large-scale machine learning promise high adaptivity by integrating long-range dependencies more directly and efficiently. In this work, we focus on fluid dynamics and address the shortcomings of a large part of the literature, which are based on fixed support for computations and predictions in the form of regular or irregular grids. We propose a novel setup to perform predictions in a continuous spatial and temporal domain while being trained on sparse observations. We formulate the task as a double observation problem and propose a solution with two interlinked dynamical systems defined on, respectively, the sparse positions and the continuous domain, which allows to forecast and interpolate a solution from the initial cond",
    "path": "papers/24/01/2401.09198.json",
    "total_tokens": 923,
    "translated_title": "从部分观测中进行空间和时间连续的物理模拟",
    "translated_abstract": "现代物理模拟技术依赖于数值方案和网格细化方法来解决精度和复杂性之间的权衡，但这些手工解决方案繁琐且需要高计算能力。基于大规模机器学习的数据驱动方法通过更直接和高效地集成长距离依赖来实现高适应性。在这项工作中，我们主要关注流体动力学，并解决了大部分文献中存在的问题，即计算和预测形式为常规或非规则网格的固定支持。我们提出了一种新颖的设置，可以在连续的空间和时间域中进行预测，同时在稀疏观测上进行训练。我们将这个任务形式化为双观测问题，并提出了一个解决方案，其中在稀疏位置和连续域上定义了两个相互关联的动力系统，可以从初始条件进行预测和插值求解。",
    "tldr": "本研究提出了一种新颖的方法，可以从部分观测中进行连续的空间和时间物理模拟，并解决了基于固定支持网格的传统方法的缺点。这种方法通过在稀疏观测上进行训练，利用两个相互关联的动力系统在稀疏位置和连续域上进行预测和插值求解。"
}