{
    "title": "Evaluating GPT-3.5's Awareness and Summarization Abilities for European Constitutional Texts with Shared Topics. (arXiv:2401.14524v1 [cs.CL])",
    "abstract": "Constitutions are foundational legal documents that underpin the governmental and societal structures. As such, they are a reflection of a nation's cultural and social uniqueness, but also contribute to establish topics of universal importance, like citizens' rights and duties (RD). In this work, using the renowned GPT-3.5, we leverage generative large language models to understand constitutional passages that transcend national boundaries. A key contribution of our study is the introduction of a novel application of abstractive summarization on a multi-source collection of constitutional texts, with a focus on European countries' constitution passages related to RD topics. Our results show the meaningfulness of GPT-3.5 to produce informative, coherent and faithful summaries capturing RD topics across European countries.",
    "link": "http://arxiv.org/abs/2401.14524",
    "context": "Title: Evaluating GPT-3.5's Awareness and Summarization Abilities for European Constitutional Texts with Shared Topics. (arXiv:2401.14524v1 [cs.CL])\nAbstract: Constitutions are foundational legal documents that underpin the governmental and societal structures. As such, they are a reflection of a nation's cultural and social uniqueness, but also contribute to establish topics of universal importance, like citizens' rights and duties (RD). In this work, using the renowned GPT-3.5, we leverage generative large language models to understand constitutional passages that transcend national boundaries. A key contribution of our study is the introduction of a novel application of abstractive summarization on a multi-source collection of constitutional texts, with a focus on European countries' constitution passages related to RD topics. Our results show the meaningfulness of GPT-3.5 to produce informative, coherent and faithful summaries capturing RD topics across European countries.",
    "path": "papers/24/01/2401.14524.json",
    "total_tokens": 839,
    "translated_title": "评估GPT-3.5在共享主题的欧洲宪法文本中的意识和摘要能力",
    "translated_abstract": "宪法是支撑政府和社会结构的基础法律文件。因此，它们不仅是国家文化和社会独特性的反映，还有助于确定普遍重要的主题，如公民的权利和义务（RD）。在这项工作中，我们利用著名的GPT-3.5，利用生成式大型语言模型来理解超越国界的宪法段落。我们研究的一个重要贡献是抽象摘要在多源宪法文本集合上的新应用，重点关注与RD主题相关的欧洲国家宪法段落。我们的结果表明，GPT-3.5具有意义，能够产生涵盖欧洲国家RD主题的信息丰富、连贯和忠实的摘要。",
    "tldr": "本研究通过利用GPT-3.5模型，在多国宪法文本中进行宝贵的摘要总结，特别关注于与公民权利和义务相关的欧洲国家宪法段落，结果显示其能够准确、连贯且忠实地捕捉到RD主题。",
    "en_tdlr": "This study leverages the GPT-3.5 model to produce meaningful and faithful summaries of constitutional passages related to citizens' rights and duties across European countries, demonstrating its efficacy in transnational abstractive summarization."
}