{
    "title": "Neural auto-designer for enhanced quantum kernels. (arXiv:2401.11098v1 [quant-ph])",
    "abstract": "Quantum kernels hold great promise for offering computational advantages over classical learners, with the effectiveness of these kernels closely tied to the design of the quantum feature map. However, the challenge of designing effective quantum feature maps for real-world datasets, particularly in the absence of sufficient prior information, remains a significant obstacle. In this study, we present a data-driven approach that automates the design of problem-specific quantum feature maps. Our approach leverages feature-selection techniques to handle high-dimensional data on near-term quantum machines with limited qubits, and incorporates a deep neural predictor to efficiently evaluate the performance of various candidate quantum kernels. Through extensive numerical simulations on different datasets, we demonstrate the superiority of our proposal over prior methods, especially for the capability of eliminating the kernel concentration issue and identifying the feature map with predicti",
    "link": "http://arxiv.org/abs/2401.11098",
    "context": "Title: Neural auto-designer for enhanced quantum kernels. (arXiv:2401.11098v1 [quant-ph])\nAbstract: Quantum kernels hold great promise for offering computational advantages over classical learners, with the effectiveness of these kernels closely tied to the design of the quantum feature map. However, the challenge of designing effective quantum feature maps for real-world datasets, particularly in the absence of sufficient prior information, remains a significant obstacle. In this study, we present a data-driven approach that automates the design of problem-specific quantum feature maps. Our approach leverages feature-selection techniques to handle high-dimensional data on near-term quantum machines with limited qubits, and incorporates a deep neural predictor to efficiently evaluate the performance of various candidate quantum kernels. Through extensive numerical simulations on different datasets, we demonstrate the superiority of our proposal over prior methods, especially for the capability of eliminating the kernel concentration issue and identifying the feature map with predicti",
    "path": "papers/24/01/2401.11098.json",
    "total_tokens": 880,
    "translated_title": "提升量子核函数性能的神经自动设计者",
    "translated_abstract": "量子核函数在提供计算优势方面具有巨大潜力，而这些核函数的有效性与量子特征映射的设计密切相关。然而，在缺乏充分先验信息的情况下，针对现实世界数据集设计有效的量子特征映射仍然是一个重大障碍。在本研究中，我们提出了一种数据驱动方法，自动化地设计问题特定的量子特征映射。我们的方法利用特征选择技术来处理限制量子比特的近期量子机器上的高维数据，并结合深度神经预测器来高效评估各种候选量子核函数的性能。通过对不同数据集的广泛数值模拟，我们证明了我们的提议相对于先前方法的优越性，尤其是在消除核密度问题和确定具有预测能力的特征映射方面。",
    "tldr": "本研究提出了一种自动化设计问题特定量子特征映射的数据驱动方法，通过利用特征选择技术和深度神经预测器，解决了在限制量子比特的近期量子机器上处理高维数据的挑战，并证明了该方法相对于先前方法的优越性。"
}