{
    "title": "A Comparative Analysis of Noise Reduction Methods in Sentiment Analysis on Noisy Bengali Texts. (arXiv:2401.14360v1 [cs.CL])",
    "abstract": "While Bengali is considered a language with limited resources, sentiment analysis has been a subject of extensive research in the literature. Nevertheless, there is a scarcity of exploration into sentiment analysis specifically in the realm of noisy Bengali texts. In this paper, we introduce a dataset (NC-SentNoB) that we annotated manually to identify ten different types of noise found in a pre-existing sentiment analysis dataset comprising of around 15K noisy Bengali texts. At first, given an input noisy text, we identify the noise type, addressing this as a multi-label classification task. Then, we introduce baseline noise reduction methods to alleviate noise prior to conducting sentiment analysis. Finally, we assess the performance of fine-tuned sentiment analysis models with both noisy and noise-reduced texts to make comparisons. The experimental findings indicate that the noise reduction methods utilized are not satisfactory, highlighting the need for more suitable noise reductio",
    "link": "http://arxiv.org/abs/2401.14360",
    "context": "Title: A Comparative Analysis of Noise Reduction Methods in Sentiment Analysis on Noisy Bengali Texts. (arXiv:2401.14360v1 [cs.CL])\nAbstract: While Bengali is considered a language with limited resources, sentiment analysis has been a subject of extensive research in the literature. Nevertheless, there is a scarcity of exploration into sentiment analysis specifically in the realm of noisy Bengali texts. In this paper, we introduce a dataset (NC-SentNoB) that we annotated manually to identify ten different types of noise found in a pre-existing sentiment analysis dataset comprising of around 15K noisy Bengali texts. At first, given an input noisy text, we identify the noise type, addressing this as a multi-label classification task. Then, we introduce baseline noise reduction methods to alleviate noise prior to conducting sentiment analysis. Finally, we assess the performance of fine-tuned sentiment analysis models with both noisy and noise-reduced texts to make comparisons. The experimental findings indicate that the noise reduction methods utilized are not satisfactory, highlighting the need for more suitable noise reductio",
    "path": "papers/24/01/2401.14360.json",
    "total_tokens": 860,
    "translated_title": "噪声孟加拉语文本情感分析中噪声减少方法的比较分析",
    "translated_abstract": "尽管孟加拉语被认为是资源有限的语言，但情感分析已经成为文献研究的一个重要主题。然而，在噪声孟加拉文本领域，对情感分析的探索仍然不足。本文介绍了一个由人工标注的数据集（NC-SentNoB），用于识别预存在的情感分析数据集中大约15K个噪声孟加拉文本中的十种不同类型的噪声。我们首先通过将输入噪声文本划分为多个标签来识别噪声类型，然后引入基线噪声减少方法来减少噪声，以进行情感分析。最后，我们评估了针对噪声和减少噪声文本进行微调的情感分析模型的性能，并进行比较。实验结果表明，所使用的噪声减少方法不尽如人意，强调了需要更适用的噪声减少方法的需求。",
    "tldr": "本文通过比较分析了噪声减少方法在噪声孟加拉文本情感分析中的效果，并提出了更适用的噪声减少方法的需求。",
    "en_tdlr": "This paper presents a comparative analysis of noise reduction methods in sentiment analysis on noisy Bengali texts, highlighting the need for more suitable methods to address the noise."
}