{
    "title": "Local Identification in the Instrumental Variable Multivariate Quantile Regression Model. (arXiv:2401.11422v1 [econ.EM])",
    "abstract": "The instrumental variable (IV) quantile regression model introduced by Chernozhukov and Hansen (2005) is a useful tool for analyzing quantile treatment effects in the presence of endogeneity, but when outcome variables are multidimensional, it is silent on the joint distribution of different dimensions of each variable. To overcome this limitation, we propose an IV model built on the optimal-transport-based multivariate quantile that takes into account the correlation between the entries of the outcome variable. We then provide a local identification result for the model. Surprisingly, we find that the support size of the IV required for the identification is independent of the dimension of the outcome vector, as long as the IV is sufficiently informative. Our result follows from a general identification theorem that we establish, which has independent theoretical significance.",
    "link": "http://arxiv.org/abs/2401.11422",
    "context": "Title: Local Identification in the Instrumental Variable Multivariate Quantile Regression Model. (arXiv:2401.11422v1 [econ.EM])\nAbstract: The instrumental variable (IV) quantile regression model introduced by Chernozhukov and Hansen (2005) is a useful tool for analyzing quantile treatment effects in the presence of endogeneity, but when outcome variables are multidimensional, it is silent on the joint distribution of different dimensions of each variable. To overcome this limitation, we propose an IV model built on the optimal-transport-based multivariate quantile that takes into account the correlation between the entries of the outcome variable. We then provide a local identification result for the model. Surprisingly, we find that the support size of the IV required for the identification is independent of the dimension of the outcome vector, as long as the IV is sufficiently informative. Our result follows from a general identification theorem that we establish, which has independent theoretical significance.",
    "path": "papers/24/01/2401.11422.json",
    "total_tokens": 828,
    "translated_title": "仪器变量多元分位数回归模型中的局部识别",
    "translated_abstract": "Chernozhukov和Hansen（2005）引入的仪器变量（IV）分位数回归模型是分析内生性情况下分位数处理效应的有用工具，但当结果变量是多维的时，它对每个变量不同维度的联合分布保持沉默。为了克服这个限制，我们提出了一个基于最优输运的考虑结果变量中条目之间相关性的多元分位数回归模型。然后，我们为模型提供了一个局部识别结果。令人惊讶的是，我们发现，所需的用于识别的IV的支持大小与结果向量的维度无关，只要IV足够信息量。我们的结果来自我们建立的一个具有独立理论意义的一般识别定理。",
    "tldr": "提出了基于最优输运的多元分位数回归模型，考虑结果变量中条目之间的相关性，并提供了局部识别结果。结果表明，所需的仪器变量（IV）的支持大小与结果向量的维度无关，只需IV足够信息量。"
}