{
    "title": "Model Compression Techniques in Biometrics Applications: A Survey. (arXiv:2401.10139v1 [cs.CV])",
    "abstract": "The development of deep learning algorithms has extensively empowered humanity's task automatization capacity. However, the huge improvement in the performance of these models is highly correlated with their increasing level of complexity, limiting their usefulness in human-oriented applications, which are usually deployed in resource-constrained devices. This led to the development of compression techniques that drastically reduce the computational and memory costs of deep learning models without significant performance degradation. This paper aims to systematize the current literature on this topic by presenting a comprehensive survey of model compression techniques in biometrics applications, namely quantization, knowledge distillation and pruning. We conduct a critical analysis of the comparative value of these techniques, focusing on their advantages and disadvantages and presenting suggestions for future work directions that can potentially improve the current methods. Additional",
    "link": "http://arxiv.org/abs/2401.10139",
    "context": "Title: Model Compression Techniques in Biometrics Applications: A Survey. (arXiv:2401.10139v1 [cs.CV])\nAbstract: The development of deep learning algorithms has extensively empowered humanity's task automatization capacity. However, the huge improvement in the performance of these models is highly correlated with their increasing level of complexity, limiting their usefulness in human-oriented applications, which are usually deployed in resource-constrained devices. This led to the development of compression techniques that drastically reduce the computational and memory costs of deep learning models without significant performance degradation. This paper aims to systematize the current literature on this topic by presenting a comprehensive survey of model compression techniques in biometrics applications, namely quantization, knowledge distillation and pruning. We conduct a critical analysis of the comparative value of these techniques, focusing on their advantages and disadvantages and presenting suggestions for future work directions that can potentially improve the current methods. Additional",
    "path": "papers/24/01/2401.10139.json",
    "total_tokens": 825,
    "translated_title": "生物特征识别应用中的模型压缩技术综述",
    "translated_abstract": "深度学习算法的发展极大地提升了人类的任务自动化能力。然而，这些模型性能的巨大提升与其复杂性的增加密切相关，限制了它们在资源受限设备中的实用性，而这些设备通常用于人类导向的应用。因此，开发了压缩技术，可以大幅降低深度学习模型的计算和内存成本，而不会显著降低性能。本文旨在通过针对生物特征识别应用中的模型压缩技术进行全面综述，包括量化、知识蒸馏和修剪，系统化当前文献。我们对这些技术的相对价值进行了批判性分析，重点关注其优点和缺点，并提出了未来工作方向的建议，这些方向可能会改进当前的方法。",
    "tldr": "本综述系统化地调查了生物特征识别应用中的模型压缩技术，包括量化、知识蒸馏和修剪，并分析了它们的优缺点，提出了改进方法的建议。",
    "en_tdlr": "This survey provides a comprehensive overview of model compression techniques in biometrics applications, including quantization, knowledge distillation, and pruning. It analyzes the advantages and disadvantages of these techniques and presents suggestions for improving current methods."
}