{
    "title": "Rethinking Test-time Likelihood: The Likelihood Path Principle and Its Application to OOD Detection. (arXiv:2401.04933v1 [cs.LG])",
    "abstract": "While likelihood is attractive in theory, its estimates by deep generative models (DGMs) are often broken in practice, and perform poorly for out of distribution (OOD) Detection. Various recent works started to consider alternative scores and achieved better performances. However, such recipes do not come with provable guarantees, nor is it clear that their choices extract sufficient information.  We attempt to change this by conducting a case study on variational autoencoders (VAEs). First, we introduce the likelihood path (LPath) principle, generalizing the likelihood principle. This narrows the search for informative summary statistics down to the minimal sufficient statistics of VAEs' conditional likelihoods. Second, introducing new theoretic tools such as nearly essential support, essential distance and co-Lipschitzness, we obtain non-asymptotic provable OOD detection guarantees for certain distillation of the minimal sufficient statistics. The corresponding LPath algorithm demons",
    "link": "http://arxiv.org/abs/2401.04933",
    "context": "Title: Rethinking Test-time Likelihood: The Likelihood Path Principle and Its Application to OOD Detection. (arXiv:2401.04933v1 [cs.LG])\nAbstract: While likelihood is attractive in theory, its estimates by deep generative models (DGMs) are often broken in practice, and perform poorly for out of distribution (OOD) Detection. Various recent works started to consider alternative scores and achieved better performances. However, such recipes do not come with provable guarantees, nor is it clear that their choices extract sufficient information.  We attempt to change this by conducting a case study on variational autoencoders (VAEs). First, we introduce the likelihood path (LPath) principle, generalizing the likelihood principle. This narrows the search for informative summary statistics down to the minimal sufficient statistics of VAEs' conditional likelihoods. Second, introducing new theoretic tools such as nearly essential support, essential distance and co-Lipschitzness, we obtain non-asymptotic provable OOD detection guarantees for certain distillation of the minimal sufficient statistics. The corresponding LPath algorithm demons",
    "path": "papers/24/01/2401.04933.json",
    "total_tokens": 911,
    "translated_title": "重新思考测试时似然性：似然路径原理及其在OOD检测中的应用",
    "translated_abstract": "虽然似然性在理论上很有吸引力，但是通过深度生成模型（DGM）估计的似然性在实践中经常出现问题，对于超出分布（OOD）检测表现不佳。最近的一些工作开始考虑替代性评分，并取得了更好的性能。然而，这些方法并没有提供可证明的保证，也不清楚它们的选择是否提取了足够的信息。我们尝试改变这种情况，通过对变分自编码器（VAEs）进行案例研究。首先，我们引入了似然路径（LPath）原理，推广了似然性原理。这将搜索有用的摘要统计量缩小到VAEs条件似然性的最小充分统计量。其次，引入了新的理论工具，如几乎有效支持、基本距离和共-Lipschitz性，我们为某些最小充分统计量的摘要提供了非渐近可证明的OOD检测保证。相应的LPath算法证明了这一点。",
    "tldr": "通过引入似然路径原理和新的理论工具，本研究针对变分自编码器（VAEs）的条件似然性提供了非渐近可证明的超出分布（OOD）检测保证。",
    "en_tdlr": "This paper introduces the likelihood path principle and new theoretical tools to provide non-asymptotic provable out of distribution (OOD) detection guarantees for the conditional likelihoods of variational autoencoders (VAEs)."
}