{
    "title": "MTAC: Hierarchical Reinforcement Learning-based Multi-gait Terrain-adaptive Quadruped Controller. (arXiv:2401.03337v1 [cs.RO])",
    "abstract": "Urban search and rescue missions require rapid first response to minimize loss of life and damage. Often, such efforts are assisted by humanitarian robots which need to handle dynamic operational conditions such as uneven and rough terrains, especially during mass casualty incidents like an earthquake. Quadruped robots, owing to their versatile design, have the potential to assist in such scenarios. However, control of quadruped robots in dynamic and rough terrain environments is a challenging problem due to the many degrees of freedom of these robots. Current locomotion controllers for quadrupeds are limited in their ability to produce multiple adaptive gaits, solve tasks in a time and resource-efficient manner, and require tedious training and manual tuning procedures. To address these challenges, we propose MTAC: a multi-gait terrain-adaptive controller, which utilizes a Hierarchical reinforcement learning (HRL) approach while being time and memory-efficient. We show that our propos",
    "link": "http://arxiv.org/abs/2401.03337",
    "context": "Title: MTAC: Hierarchical Reinforcement Learning-based Multi-gait Terrain-adaptive Quadruped Controller. (arXiv:2401.03337v1 [cs.RO])\nAbstract: Urban search and rescue missions require rapid first response to minimize loss of life and damage. Often, such efforts are assisted by humanitarian robots which need to handle dynamic operational conditions such as uneven and rough terrains, especially during mass casualty incidents like an earthquake. Quadruped robots, owing to their versatile design, have the potential to assist in such scenarios. However, control of quadruped robots in dynamic and rough terrain environments is a challenging problem due to the many degrees of freedom of these robots. Current locomotion controllers for quadrupeds are limited in their ability to produce multiple adaptive gaits, solve tasks in a time and resource-efficient manner, and require tedious training and manual tuning procedures. To address these challenges, we propose MTAC: a multi-gait terrain-adaptive controller, which utilizes a Hierarchical reinforcement learning (HRL) approach while being time and memory-efficient. We show that our propos",
    "path": "papers/24/01/2401.03337.json",
    "total_tokens": 939,
    "translated_title": "MTAC: 基于层次化强化学习的多步态适应地形四足控制器",
    "translated_abstract": "城市搜救任务需要快速响应以最小化人员伤亡和损失。通常，这些努力会由人道主义机器人协助，这些机器人需要处理动态操作条件，如不平坦和粗糙的地形，尤其是在类似地震等大规模伤亡事件中。四足机器人由于其多功能设计，具备在这种情况下协助的潜力。然而，由于这些机器人具有多自由度，控制其在动态和粗糙的地形环境中的运动是一个具有挑战性的问题。当前针对四足机器人的运动控制器在产生多种自适应步态、在时间和资源上高效解决任务以及需要繁琐的训练和手动调试过程方面存在局限性。为解决这些挑战，我们提出了MTAC：一种多步态适应地形控制器，该控制器利用了层次化强化学习方法，在时间和内存效率上进行了优化。我们展示了我们的提议的成果。",
    "tldr": "本研究提出了一种基于层次化强化学习的多步态适应地形四足控制器（MTAC），能够在动态和粗糙的地形环境中实现多种自适应步态，并且具有高效解决任务的能力。"
}