{
    "title": "Unemployment Volatility: When Workers Pay Costs upon Accepting Jobs. (arXiv:2401.07423v1 [econ.TH])",
    "abstract": "When a firm hires a worker, adding the new hire to payroll is costly. These costs reduce the amount of resources that can go to recruiting workers and amplify how unemployment responds to changes in productivity. Workers also incur up-front costs upon accepting jobs. Examples include moving expenses and regulatory fees. I establish that workers' costs lessen the response of unemployment to productivity changes and do not subtract from resources available for recruitment. The influence of workers' costs is bounded by properties of a matching function, which describes how job openings and unemployment produce hires. Using data on job finding that are adjusted for workers' transitions between employment and unemployment and for how the Job Openings and Labor Turnover Survey records hires, I estimate a bound that ascribes limited influence to workers' costs. The results demonstrate that costs paid by workers upon accepting jobs affect outcomes in the labor market (firms threaten workers wi",
    "link": "http://arxiv.org/abs/2401.07423",
    "context": "Title: Unemployment Volatility: When Workers Pay Costs upon Accepting Jobs. (arXiv:2401.07423v1 [econ.TH])\nAbstract: When a firm hires a worker, adding the new hire to payroll is costly. These costs reduce the amount of resources that can go to recruiting workers and amplify how unemployment responds to changes in productivity. Workers also incur up-front costs upon accepting jobs. Examples include moving expenses and regulatory fees. I establish that workers' costs lessen the response of unemployment to productivity changes and do not subtract from resources available for recruitment. The influence of workers' costs is bounded by properties of a matching function, which describes how job openings and unemployment produce hires. Using data on job finding that are adjusted for workers' transitions between employment and unemployment and for how the Job Openings and Labor Turnover Survey records hires, I estimate a bound that ascribes limited influence to workers' costs. The results demonstrate that costs paid by workers upon accepting jobs affect outcomes in the labor market (firms threaten workers wi",
    "path": "papers/24/01/2401.07423.json",
    "total_tokens": 900,
    "translated_title": "失业波动：当工人在接受工作时承担成本",
    "translated_abstract": "当一家公司雇佣一名工人时，将新员工加入工资单是有成本的。这些成本减少了可用于招聘工人的资源数量，并放大了失业对生产力变化的反应。工人在接受工作时也会承担一些前期成本，例如搬迁费用和监管费用。我证明了工人成本减弱了失业对生产力变化的反应，并且不会减少可用于招聘的资源。工人成本的影响受到招聘函数的限制，招聘函数描述了工作空缺和失业产生的雇佣情况。利用根据工人在就业和失业之间转换情况以及根据岗位开放和劳动力调查记录雇佣情况进行调整的求职数据，我估计了一个边界，该边界将工人成本的影响限制在有限范围内。结果表明，工人在接受工作时支付的成本会影响劳动市场的结果（公司会威胁工人）",
    "tldr": "该论文研究了当工人接受工作时承担的成本对失业率和招聘资源的影响，证明了这些成本会减弱失业对生产力变化的反应，并且不会减少可用于招聘的资源。",
    "en_tdlr": "This paper examines the impact of costs incurred by workers upon accepting jobs on unemployment rates and recruitment resources, demonstrating that these costs weaken the response of unemployment to productivity changes and do not reduce the resources available for recruitment."
}