{
    "title": "VALD-MD: Visual Attribution via Latent Diffusion for Medical Diagnostics. (arXiv:2401.01414v1 [eess.IV])",
    "abstract": "Visual attribution in medical imaging seeks to make evident the diagnostically-relevant components of a medical image, in contrast to the more common detection of diseased tissue deployed in standard machine vision pipelines (which are less straightforwardly interpretable/explainable to clinicians). We here present a novel generative visual attribution technique, one that leverages latent diffusion models in combination with domain-specific large language models, in order to generate normal counterparts of abnormal images. The discrepancy between the two hence gives rise to a mapping indicating the diagnostically-relevant image components. To achieve this, we deploy image priors in conjunction with appropriate conditioning mechanisms in order to control the image generative process, including natural language text prompts acquired from medical science and applied radiology. We perform experiments and quantitatively evaluate our results on the COVID-19 Radiography Database containing la",
    "link": "http://arxiv.org/abs/2401.01414",
    "context": "Title: VALD-MD: Visual Attribution via Latent Diffusion for Medical Diagnostics. (arXiv:2401.01414v1 [eess.IV])\nAbstract: Visual attribution in medical imaging seeks to make evident the diagnostically-relevant components of a medical image, in contrast to the more common detection of diseased tissue deployed in standard machine vision pipelines (which are less straightforwardly interpretable/explainable to clinicians). We here present a novel generative visual attribution technique, one that leverages latent diffusion models in combination with domain-specific large language models, in order to generate normal counterparts of abnormal images. The discrepancy between the two hence gives rise to a mapping indicating the diagnostically-relevant image components. To achieve this, we deploy image priors in conjunction with appropriate conditioning mechanisms in order to control the image generative process, including natural language text prompts acquired from medical science and applied radiology. We perform experiments and quantitatively evaluate our results on the COVID-19 Radiography Database containing la",
    "path": "papers/24/01/2401.01414.json",
    "total_tokens": 855,
    "translated_title": "VALD-MD: 面向医疗诊断的基于潜在扩散的视觉归因",
    "translated_abstract": "医学影像中的视觉归因旨在清晰展示医学图像中与诊断相关的部分，与标准机器视觉流程中检测病变组织的方法相比（对临床医生来说不太直观可解释）。我们提出了一种新颖的生成式视觉归因技术，利用潜在扩散模型与领域特定的大型语言模型相结合，生成异常图像的正常对应图像。因此，两者之间的差异产生了指示诊断相关图像部分的映射。为了实现这一点，我们在图像生成过程中使用图像先验知识，并结合适当的条件机制，包括从医学科学和应用放射学中获取的自然语言文本提示。我们在包含COVID-19放射学数据库的实验中进行了定量评估。",
    "tldr": "VALD-MD是一种基于潜在扩散的视觉归因技术，通过结合潜在扩散模型和大型语言模型，在医学图像中生成正常对应的异常图像，从而揭示出与诊断相关的图像部分。"
}