{
    "title": "Transformer-based approach for Ethereum Price Prediction Using Crosscurrency correlation and Sentiment Analysis. (arXiv:2401.08077v1 [cs.LG])",
    "abstract": "The research delves into the capabilities of a transformer-based neural network for Ethereum cryptocurrency price forecasting. The experiment runs around the hypothesis that cryptocurrency prices are strongly correlated with other cryptocurrencies and the sentiments around the cryptocurrency. The model employs a transformer architecture for several setups from single-feature scenarios to complex configurations incorporating volume, sentiment, and correlated cryptocurrency prices. Despite a smaller dataset and less complex architecture, the transformer model surpasses ANN and MLP counterparts on some parameters. The conclusion presents a hypothesis on the illusion of causality in cryptocurrency price movements driven by sentiments.",
    "link": "http://arxiv.org/abs/2401.08077",
    "context": "Title: Transformer-based approach for Ethereum Price Prediction Using Crosscurrency correlation and Sentiment Analysis. (arXiv:2401.08077v1 [cs.LG])\nAbstract: The research delves into the capabilities of a transformer-based neural network for Ethereum cryptocurrency price forecasting. The experiment runs around the hypothesis that cryptocurrency prices are strongly correlated with other cryptocurrencies and the sentiments around the cryptocurrency. The model employs a transformer architecture for several setups from single-feature scenarios to complex configurations incorporating volume, sentiment, and correlated cryptocurrency prices. Despite a smaller dataset and less complex architecture, the transformer model surpasses ANN and MLP counterparts on some parameters. The conclusion presents a hypothesis on the illusion of causality in cryptocurrency price movements driven by sentiments.",
    "path": "papers/24/01/2401.08077.json",
    "total_tokens": 761,
    "translated_title": "基于Transformer的跨货币相关性和情感分析的以太坊价格预测方法研究",
    "translated_abstract": "该研究探讨了一种基于Transformer神经网络的以太坊加密货币价格预测方法。实验证明，加密货币价格与其他加密货币及其周围情感存在强相关性。该模型采用了Transformer架构，从单一特征情景到包含成交量、情感和相关加密货币价格的复杂配置进行了多种设置。尽管数据集较小且架构较简单，但这种Transformer模型在一些参数上超过了ANN和MLP模型。研究结论提出了情感驱动加密货币价格变动中因果关系的假设。",
    "tldr": "该研究使用基于Transformer的神经网络探索以太坊加密货币价格预测方法，发现加密货币价格与其他加密货币和情感呈现强相关性。Transformer模型在一些参数上超越ANN和MLP模型，研究结论提出了情感驱动加密货币价格变动中因果关系的假设。",
    "en_tdlr": "This research explores a transformer-based neural network approach for Ethereum price prediction, finding that cryptocurrency prices are strongly correlated with other cryptocurrencies and sentiment. The transformer model outperforms ANN and MLP models on some parameters, suggesting the hypothesis of sentiment-driven causality in cryptocurrency price movements."
}