{
    "title": "Robust Anomaly Detection for Particle Physics Using Multi-Background Representation Learning. (arXiv:2401.08777v1 [hep-ex])",
    "abstract": "Anomaly, or out-of-distribution, detection is a promising tool for aiding discoveries of new particles or processes in particle physics. In this work, we identify and address two overlooked opportunities to improve anomaly detection for high-energy physics. First, rather than train a generative model on the single most dominant background process, we build detection algorithms using representation learning from multiple background types, thus taking advantage of more information to improve estimation of what is relevant for detection. Second, we generalize decorrelation to the multi-background setting, thus directly enforcing a more complete definition of robustness for anomaly detection. We demonstrate the benefit of the proposed robust multi-background anomaly detection algorithms on a high-dimensional dataset of particle decays at the Large Hadron Collider.",
    "link": "http://arxiv.org/abs/2401.08777",
    "context": "Title: Robust Anomaly Detection for Particle Physics Using Multi-Background Representation Learning. (arXiv:2401.08777v1 [hep-ex])\nAbstract: Anomaly, or out-of-distribution, detection is a promising tool for aiding discoveries of new particles or processes in particle physics. In this work, we identify and address two overlooked opportunities to improve anomaly detection for high-energy physics. First, rather than train a generative model on the single most dominant background process, we build detection algorithms using representation learning from multiple background types, thus taking advantage of more information to improve estimation of what is relevant for detection. Second, we generalize decorrelation to the multi-background setting, thus directly enforcing a more complete definition of robustness for anomaly detection. We demonstrate the benefit of the proposed robust multi-background anomaly detection algorithms on a high-dimensional dataset of particle decays at the Large Hadron Collider.",
    "path": "papers/24/01/2401.08777.json",
    "total_tokens": 829,
    "translated_title": "使用多背景表示学习进行粒子物理的鲁棒异常检测",
    "translated_abstract": "异常或超出分布的检测是在粒子物理中发现新粒子或过程的有望工具。在这项工作中，我们确定并解决了改进高能物理异常检测的两个被忽视的机会。首先，我们不再对单一最主要的背景过程训练生成模型，而是使用多个背景类型的表示学习来构建检测算法，从而利用更多信息来提高检测相关性的估计。其次，我们将去相关性推广到多背景设置中，从而直接强化了异常检测的更完整定义的鲁棒性。我们在大型强子对撞机上的高维粒子衰变数据集上展示了提出的鲁棒多背景异常检测算法的好处。",
    "tldr": "这项工作提出了一种使用多背景表示学习进行鲁棒异常检测的方法，通过利用更多信息来提高检测相关性的估计，并推广了去相关性到多背景设置中。在大型强子对撞机的高维粒子衰变数据集上进行的实验证明了该方法的有效性。",
    "en_tdlr": "This work proposes a method for robust anomaly detection using multi-background representation learning, which improves estimation of detection relevance by utilizing more information and generalizes decorrelation to the multi-background setting. Experimental results on a high-dimensional dataset of particle decays at the Large Hadron Collider demonstrate the effectiveness of this approach."
}