{
    "title": "Enhancement of a Text-Independent Speaker Verification System by using Feature Combination and Parallel-Structure Classifiers. (arXiv:2401.15018v1 [eess.AS])",
    "abstract": "Speaker Verification (SV) systems involve mainly two individual stages: feature extraction and classification. In this paper, we explore these two modules with the aim of improving the performance of a speaker verification system under noisy conditions. On the one hand, the choice of the most appropriate acoustic features is a crucial factor for performing robust speaker verification. The acoustic parameters used in the proposed system are: Mel Frequency Cepstral Coefficients (MFCC), their first and second derivatives (Deltas and Delta- Deltas), Bark Frequency Cepstral Coefficients (BFCC), Perceptual Linear Predictive (PLP), and Relative Spectral Transform Perceptual Linear Predictive (RASTA-PLP). In this paper, a complete comparison of different combinations of the previous features is discussed. On the other hand, the major weakness of a conventional Support Vector Machine (SVM) classifier is the use of generic traditional kernel functions to compute the distances among data points",
    "link": "http://arxiv.org/abs/2401.15018",
    "context": "Title: Enhancement of a Text-Independent Speaker Verification System by using Feature Combination and Parallel-Structure Classifiers. (arXiv:2401.15018v1 [eess.AS])\nAbstract: Speaker Verification (SV) systems involve mainly two individual stages: feature extraction and classification. In this paper, we explore these two modules with the aim of improving the performance of a speaker verification system under noisy conditions. On the one hand, the choice of the most appropriate acoustic features is a crucial factor for performing robust speaker verification. The acoustic parameters used in the proposed system are: Mel Frequency Cepstral Coefficients (MFCC), their first and second derivatives (Deltas and Delta- Deltas), Bark Frequency Cepstral Coefficients (BFCC), Perceptual Linear Predictive (PLP), and Relative Spectral Transform Perceptual Linear Predictive (RASTA-PLP). In this paper, a complete comparison of different combinations of the previous features is discussed. On the other hand, the major weakness of a conventional Support Vector Machine (SVM) classifier is the use of generic traditional kernel functions to compute the distances among data points",
    "path": "papers/24/01/2401.15018.json",
    "total_tokens": 888,
    "translated_title": "通过使用特征组合和并行结构分类器增强无文本约束的说话人验证系统",
    "translated_abstract": "说话人验证系统主要包含两个独立的阶段：特征提取和分类。本文旨在探索这两个模块，提高在嘈杂环境下说话人验证系统的性能。首先，选择最适合的声学特征是进行鲁棒性说话人验证的关键因素。本文提出系统中使用的声学参数包括：梅尔频率倒谱系数（MFCC），它们的一阶和二阶导数（Deltas和Delta-Deltas），巴克频率倒谱系数（BFCC），感知线性预测（PLP）和相对谱变换感知线性预测（RASTA-PLP）。本文对不同特征组合进行了全面比较。其次，传统支持向量机（SVM）分类器的主要弱点是使用通用传统的核函数计算数据点之间的距离。",
    "tldr": "本文通过使用特征组合和并行结构分类器来增强无文本约束的说话人验证系统的性能，在特征提取和分类阶段进行了探索，提出了不同声学特征的组合比较，并针对传统支持向量机分类器的弱点进行了改进。",
    "en_tdlr": "This paper enhances the performance of a text-independent speaker verification system by using feature combination and parallel-structure classifiers. The study explores feature extraction and classification, compares different combinations of acoustic features, and improves upon the weakness of conventional Support Vector Machine classifiers."
}