{
    "title": "RIVCoin: an alternative, integrated, CeFi/DeFi-Vaulted Cryptocurrency. (arXiv:2401.05393v1 [q-fin.GN])",
    "abstract": "This whitepaper introduces RIVCoin, a cryptocurrency built on Cosmos, fully stabilized by a diversified portfolio of both CeFi and DeFi assets, available in a digital, non-custodial wallet called RIV Wallet, that aims to provide Users an easy way to access the cryptocurrency markets, compliant to the strictest AML laws and regulations up to date. The token is a cryptocurrency at any time stabilized by a basket of assets: reserves are invested in a portfolio composed long term by 50% of CeFi assets, comprised of Fixed Income, Equity, Mutual and Hedge Funds and 50% of diversified strategies focused on digital assets, mainly staking and LP farming on the major, battle tested DeFi protocols. The cryptocurrency, as well as the dollar before Bretton Woods, is always fully stabilized by vaulted proof of assets: it is born and managed as a decentralized token, minted by a Decentralized Autonomous Organization, and entirely stabilized by assets evaluated by professional independent third partie",
    "link": "http://arxiv.org/abs/2401.05393",
    "context": "Title: RIVCoin: an alternative, integrated, CeFi/DeFi-Vaulted Cryptocurrency. (arXiv:2401.05393v1 [q-fin.GN])\nAbstract: This whitepaper introduces RIVCoin, a cryptocurrency built on Cosmos, fully stabilized by a diversified portfolio of both CeFi and DeFi assets, available in a digital, non-custodial wallet called RIV Wallet, that aims to provide Users an easy way to access the cryptocurrency markets, compliant to the strictest AML laws and regulations up to date. The token is a cryptocurrency at any time stabilized by a basket of assets: reserves are invested in a portfolio composed long term by 50% of CeFi assets, comprised of Fixed Income, Equity, Mutual and Hedge Funds and 50% of diversified strategies focused on digital assets, mainly staking and LP farming on the major, battle tested DeFi protocols. The cryptocurrency, as well as the dollar before Bretton Woods, is always fully stabilized by vaulted proof of assets: it is born and managed as a decentralized token, minted by a Decentralized Autonomous Organization, and entirely stabilized by assets evaluated by professional independent third partie",
    "path": "papers/24/01/2401.05393.json",
    "total_tokens": 913,
    "translated_title": "RIVCoin:一种替代的综合CeFi/DeFi存储加密货币",
    "translated_abstract": "本白皮书介绍了RIVCoin，这是一种建立在Cosmos上的加密货币，通过多元化的CeFi和DeFi资产组合进行完全稳定，并在一个名为RIV Wallet的数字、非托管钱包中提供给用户便捷访问加密货币市场的方式，符合最严格的AML法律和法规要求。该代币始终由一篮子资产稳定，其中储备资金被长期投资于50%的CeFi资产（包括固定收益、股权、互惠基金和对冲基金）和50%的多元化策略，主要集中在数字资产上，主要是主要经过实战测试的DeFi协议上的质押和流动性挖矿。与布雷顿森林体系之前的美元一样，这种加密货币始终由保险库的资产完全稳定，它是由去中心化自治组织铸造和管理的，并完全由专业独立第三方评估的资产稳定。",
    "tldr": "RIVCoin是一种建立在Cosmos上的替代综合存储加密货币，通过多元化的CeFi和DeFi资产组合进行完全稳定，并且始终由保险库的资产完全支撑。",
    "en_tdlr": "RIVCoin is an alternative cryptocurrency built on Cosmos, fully stabilized by a diversified portfolio of both CeFi and DeFi assets, and always backed by vaulted proof of assets."
}