{
    "title": "EEG-GPT: Exploring Capabilities of Large Language Models for EEG Classification and Interpretation",
    "abstract": "In conventional machine learning (ML) approaches applied to electroencephalography (EEG), this is often a limited focus, isolating specific brain activities occurring across disparate temporal scales (from transient spikes in milliseconds to seizures lasting minutes) and spatial scales (from localized high-frequency oscillations to global sleep activity). This siloed approach limits the development EEG ML models that exhibit multi-scale electrophysiological understanding and classification capabilities. Moreover, typical ML EEG approaches utilize black-box approaches, limiting their interpretability and trustworthiness in clinical contexts. Thus, we propose EEG-GPT, a unifying approach to EEG classification that leverages advances in large language models (LLM). EEG-GPT achieves excellent performance comparable to current state-of-the-art deep learning methods in classifying normal from abnormal EEG in a few-shot learning paradigm utilizing only 2% of training data. Furthermore, it off",
    "link": "https://arxiv.org/abs/2401.18006",
    "context": "Title: EEG-GPT: Exploring Capabilities of Large Language Models for EEG Classification and Interpretation\nAbstract: In conventional machine learning (ML) approaches applied to electroencephalography (EEG), this is often a limited focus, isolating specific brain activities occurring across disparate temporal scales (from transient spikes in milliseconds to seizures lasting minutes) and spatial scales (from localized high-frequency oscillations to global sleep activity). This siloed approach limits the development EEG ML models that exhibit multi-scale electrophysiological understanding and classification capabilities. Moreover, typical ML EEG approaches utilize black-box approaches, limiting their interpretability and trustworthiness in clinical contexts. Thus, we propose EEG-GPT, a unifying approach to EEG classification that leverages advances in large language models (LLM). EEG-GPT achieves excellent performance comparable to current state-of-the-art deep learning methods in classifying normal from abnormal EEG in a few-shot learning paradigm utilizing only 2% of training data. Furthermore, it off",
    "path": "papers/24/01/2401.18006.json",
    "total_tokens": 861,
    "translated_title": "EEG-GPT: 探索大型语言模型在EEG分类和解读中的能力",
    "translated_abstract": "在应用于脑电图（EEG）的传统机器学习（ML）方法中，往往是有限的聚焦，仅仅孤立地关注跨越不同时间尺度（从毫秒的瞬时尖峰到持续几分钟的癫痫发作）和空间尺度（从局部高频振荡到全局睡眠活动）的特定脑活动。这种孤立的方法限制了发展出具有多尺度电生理理解和分类能力的EEG ML模型。此外，典型的ML EEG方法采用黑匣子方法，限制了其在临床环境中的可解释性和可信度。因此，我们提出了EEG-GPT，一种统一的EEG分类方法，利用大型语言模型（LLM）的进展。EEG-GPT在仅利用2％的训练数据的few-shot学习范式中，达到了与当前最先进的深度学习方法相当的优异性能，能够对正常和异常的EEG进行分类。此外，",
    "tldr": "EEG-GPT是一种利用大型语言模型来分类和解读EEG的方法，它能够实现多尺度电生理理解和分类，且在few-shot学习范式中表现出色。"
}