{
    "title": "EFO: the Emotion Frame Ontology. (arXiv:2401.10751v1 [cs.AI])",
    "abstract": "Emotions are a subject of intense debate in various disciplines. Despite the proliferation of theories and definitions, there is still no consensus on what emotions are, and how to model the different concepts involved when we talk about - or categorize - them. In this paper, we propose an OWL frame-based ontology of emotions: the Emotion Frames Ontology (EFO). EFO treats emotions as semantic frames, with a set of semantic roles that capture the different aspects of emotional experience. EFO follows pattern-based ontology design, and is aligned to the DOLCE foundational ontology. EFO is used to model multiple emotion theories, which can be cross-linked as modules in an Emotion Ontology Network. In this paper, we exemplify it by modeling Ekman's Basic Emotions (BE) Theory as an EFO-BE module, and demonstrate how to perform automated inferences on the representation of emotion situations. EFO-BE has been evaluated by lexicalizing the BE emotion frames from within the Framester knowledge ",
    "link": "http://arxiv.org/abs/2401.10751",
    "context": "Title: EFO: the Emotion Frame Ontology. (arXiv:2401.10751v1 [cs.AI])\nAbstract: Emotions are a subject of intense debate in various disciplines. Despite the proliferation of theories and definitions, there is still no consensus on what emotions are, and how to model the different concepts involved when we talk about - or categorize - them. In this paper, we propose an OWL frame-based ontology of emotions: the Emotion Frames Ontology (EFO). EFO treats emotions as semantic frames, with a set of semantic roles that capture the different aspects of emotional experience. EFO follows pattern-based ontology design, and is aligned to the DOLCE foundational ontology. EFO is used to model multiple emotion theories, which can be cross-linked as modules in an Emotion Ontology Network. In this paper, we exemplify it by modeling Ekman's Basic Emotions (BE) Theory as an EFO-BE module, and demonstrate how to perform automated inferences on the representation of emotion situations. EFO-BE has been evaluated by lexicalizing the BE emotion frames from within the Framester knowledge ",
    "path": "papers/24/01/2401.10751.json",
    "total_tokens": 1083,
    "translated_title": "EFO：情绪框架本体论",
    "translated_abstract": "情绪在各个学科中一直是激烈辩论的主题。尽管存在许多理论和定义，但关于什么是情绪以及如何对其进行建模和分类仍然没有共识。在本文中，我们提出了一种基于OWL框架的情绪本体论，即情绪框架本体(EFO) 。EFO将情绪视为语义框架，并具有一组捕捉情绪经验的不同方面的语义角色。EFO采用基于模式的本体论设计，并与DOLCE基本本体论对齐。EFO用于建模多种情绪理论，可以将其作为Emotion Ontology Network的模块进行交叉链接。在本文中，我们通过将Ekman的基本情绪(BE)理论建模为EFO-BE模块来进行示例，并演示如何对情绪情况的表示进行自动推理。通过从Framester知识库中提取BE情绪框架对EFO-BE进行了评估。",
    "tldr": "本文提出了一种情绪框架本体(EFO)，它将情绪视为语义框架，并使用一组语义角色来捕捉情绪经验的不同方面。EFO采用基于模式的本体论设计，并与DOLCE基本本体论对齐，可以用于建模多种情绪理论，并在Emotion Ontology Network中交叉链接。本文以Ekman的基本情绪(BE)理论作为EFO-BE模块进行示例，并演示了如何对表示情绪情况进行自动推理。通过从Framester知识库中提取BE情绪框架对EFO-BE进行了评估。",
    "en_tdlr": "This paper proposes a emotion frame ontology (EFO) that treats emotions as semantic frames and uses a set of semantic roles to capture different aspects of emotional experience. EFO, designed based on pattern-based ontology and aligned with the DOLCE foundational ontology, can be used to model multiple emotion theories and cross-linked within the Emotion Ontology Network. The paper demonstrates the modeling of Ekman's Basic Emotions theory as an EFO-BE module and showcases automated inferences on representation of emotion situations. EFO-BE is evaluated by lexicalizing the BE emotion frames from Framester knowledge."
}