{
    "title": "Resilient Practical Test-Time Adaptation: Soft Batch Normalization Alignment and Entropy-driven Memory Bank. (arXiv:2401.14619v1 [cs.LG])",
    "abstract": "Test-time domain adaptation effectively adjusts the source domain model to accommodate unseen domain shifts in a target domain during inference. However, the model performance can be significantly impaired by continuous distribution changes in the target domain and non-independent and identically distributed (non-i.i.d.) test samples often encountered in practical scenarios. While existing memory bank methodologies use memory to store samples and mitigate non-i.i.d. effects, they do not inherently prevent potential model degradation. To address this issue, we propose a resilient practical test-time adaptation (ResiTTA) method focused on parameter resilience and data quality. Specifically, we develop a resilient batch normalization with estimation on normalization statistics and soft alignments to mitigate overfitting and model degradation. We use an entropy-driven memory bank that accounts for timeliness, the persistence of over-confident samples, and sample uncertainty for high-qualit",
    "link": "http://arxiv.org/abs/2401.14619",
    "context": "Title: Resilient Practical Test-Time Adaptation: Soft Batch Normalization Alignment and Entropy-driven Memory Bank. (arXiv:2401.14619v1 [cs.LG])\nAbstract: Test-time domain adaptation effectively adjusts the source domain model to accommodate unseen domain shifts in a target domain during inference. However, the model performance can be significantly impaired by continuous distribution changes in the target domain and non-independent and identically distributed (non-i.i.d.) test samples often encountered in practical scenarios. While existing memory bank methodologies use memory to store samples and mitigate non-i.i.d. effects, they do not inherently prevent potential model degradation. To address this issue, we propose a resilient practical test-time adaptation (ResiTTA) method focused on parameter resilience and data quality. Specifically, we develop a resilient batch normalization with estimation on normalization statistics and soft alignments to mitigate overfitting and model degradation. We use an entropy-driven memory bank that accounts for timeliness, the persistence of over-confident samples, and sample uncertainty for high-qualit",
    "path": "papers/24/01/2401.14619.json",
    "total_tokens": 907,
    "translated_title": "弹性实用的测试时间适应：软批量归一化对齐和熵驱动的内存库",
    "translated_abstract": "测试时间域适应有效地调整源域模型以适应目标域中的未见领域转移，在推理过程中。然而，连续的目标领域分布变化以及在实际场景中经常遇到的非独立同分布（non-i.i.d.）测试样本，可能会显著影响模型性能。虽然现有的内存库方法使用内存存储样本并减轻non-i.i.d.效应，但它们并不能从根本上防止潜在的模型退化。为了解决这个问题，我们提出了一种弹性实用的测试时间适应（ResiTTA）方法，重点关注参数弹性和数据质量。具体而言，我们开发了一种弹性批量归一化方法，通过估计归一化统计量和软对齐来减轻过拟合和模型退化。我们使用了一个熵驱动的内存库，考虑了时效性、过分自信样本的持久性以及样本的不确定性，以获得高质量的结果。",
    "tldr": "本文提出了一种弹性实用的测试时间适应方法，通过软批量归一化对齐和熵驱动的内存库来减轻目标领域转移和非独立同分布问题，并提高数据质量。",
    "en_tdlr": "This paper proposes a resilient practical test-time adaptation method that uses soft batch normalization alignment and entropy-driven memory bank to mitigate target domain shift and non-i.i.d. issues, while improving data quality."
}