{
    "title": "On The Potential of The Fractal Geometry and The CNNs Ability to Encode it. (arXiv:2401.04141v1 [cs.LG])",
    "abstract": "The fractal dimension provides a statistical index of object complexity by studying how the pattern changes with the measuring scale. Although useful in several classification tasks, the fractal dimension is under-explored in deep learning applications. In this work, we investigate the features that are learned by deep models and we study whether these deep networks are able to encode features as complex and high-level as the fractal dimensions. Specifically, we conduct a correlation analysis experiment to show that deep networks are not able to extract such a feature in none of their layers. We combine our analytical study with a human evaluation to investigate the differences between deep learning networks and models that operate on the fractal feature solely. Moreover, we show the effectiveness of fractal features in applications where the object structure is crucial for the classification task. We empirically show that training a shallow network on fractal features achieves perform",
    "link": "http://arxiv.org/abs/2401.04141",
    "context": "Title: On The Potential of The Fractal Geometry and The CNNs Ability to Encode it. (arXiv:2401.04141v1 [cs.LG])\nAbstract: The fractal dimension provides a statistical index of object complexity by studying how the pattern changes with the measuring scale. Although useful in several classification tasks, the fractal dimension is under-explored in deep learning applications. In this work, we investigate the features that are learned by deep models and we study whether these deep networks are able to encode features as complex and high-level as the fractal dimensions. Specifically, we conduct a correlation analysis experiment to show that deep networks are not able to extract such a feature in none of their layers. We combine our analytical study with a human evaluation to investigate the differences between deep learning networks and models that operate on the fractal feature solely. Moreover, we show the effectiveness of fractal features in applications where the object structure is crucial for the classification task. We empirically show that training a shallow network on fractal features achieves perform",
    "path": "papers/24/01/2401.04141.json",
    "total_tokens": 886,
    "translated_title": "关于分形几何和卷积神经网络（CNN）对其编码能力的潜力研究",
    "translated_abstract": "分形维数通过研究模式在测量尺度下的变化来提供对象复杂性的统计指标。虽然在几种分类任务中有用，但在深度学习应用中对分形维数的研究还不够深入。本研究探讨了深度模型学习到的特征，并研究了这些深度网络是否能够像分形维数一样编码复杂且高层次的特征。具体而言，我们进行了相关性分析实验，结果表明深度网络在任何层次都不能提取出这样的特征。我们将分析研究与人类评估相结合，研究了深度学习网络和仅操作分形特征的模型之间的差异。此外，我们还展示了分形特征在需要对象结构对分类任务至关重要的应用中的有效性。我们实证表明，在分形特征上训练浅层网络能够取得良好的性能。",
    "tldr": "本研究探讨分形几何的潜力和深度学习网络对其编码能力的限制。通过相关性分析实验和人类评估，我们发现深度网络不能提取复杂且高层次的分形特征。然而，在需要对象结构对分类任务至关重要的应用中，分形特征表现出很好的有效性。"
}