{
    "title": "Reinforcement Learning with Hidden Markov Models for Discovering Decision-Making Dynamics. (arXiv:2401.13929v1 [cs.LG])",
    "abstract": "Major depressive disorder (MDD) presents challenges in diagnosis and treatment due to its complex and heterogeneous nature. Emerging evidence indicates that reward processing abnormalities may serve as a behavioral marker for MDD. To measure reward processing, patients perform computer-based behavioral tasks that involve making choices or responding to stimulants that are associated with different outcomes. Reinforcement learning (RL) models are fitted to extract parameters that measure various aspects of reward processing to characterize how patients make decisions in behavioral tasks. Recent findings suggest the inadequacy of characterizing reward learning solely based on a single RL model; instead, there may be a switching of decision-making processes between multiple strategies. An important scientific question is how the dynamics of learning strategies in decision-making affect the reward learning ability of individuals with MDD. Motivated by the probabilistic reward task (PRT) wi",
    "link": "http://arxiv.org/abs/2401.13929",
    "context": "Title: Reinforcement Learning with Hidden Markov Models for Discovering Decision-Making Dynamics. (arXiv:2401.13929v1 [cs.LG])\nAbstract: Major depressive disorder (MDD) presents challenges in diagnosis and treatment due to its complex and heterogeneous nature. Emerging evidence indicates that reward processing abnormalities may serve as a behavioral marker for MDD. To measure reward processing, patients perform computer-based behavioral tasks that involve making choices or responding to stimulants that are associated with different outcomes. Reinforcement learning (RL) models are fitted to extract parameters that measure various aspects of reward processing to characterize how patients make decisions in behavioral tasks. Recent findings suggest the inadequacy of characterizing reward learning solely based on a single RL model; instead, there may be a switching of decision-making processes between multiple strategies. An important scientific question is how the dynamics of learning strategies in decision-making affect the reward learning ability of individuals with MDD. Motivated by the probabilistic reward task (PRT) wi",
    "path": "papers/24/01/2401.13929.json",
    "total_tokens": 843,
    "translated_title": "使用隐马尔可夫模型的强化学习来发现决策动态",
    "translated_abstract": "由于其复杂和异质性，重性抑郁障碍(MDD)在诊断和治疗方面存在挑战。新的证据表明奖励处理异常可能作为MDD的行为标记。为了衡量奖励处理，患者执行涉及做出选择或对与不同结果相关联的刺激作出反应的基于计算机的行为任务。强化学习(RL)模型被拟合以提取衡量奖励处理各个方面的参数，以表征患者在行为任务中的决策方式。最近的研究发现，仅基于单个RL模型的奖励学习表征不足; 相反，决策过程中可能存在多种策略之间的切换。一个重要的科学问题是决策制定中学习策略的动态如何影响MDD患者的奖励学习能力。由概率奖励任务(PRT)所启发",
    "tldr": "本论文针对重性抑郁障碍(MDD)中的奖励处理异常，使用强化学习模型和隐马尔可夫模型结合，探索决策制定过程中的学习策略动态对个体奖励学习能力的影响。"
}