{
    "title": "Multi-Agent Reinforcement Learning for Maritime Operational Technology Cyber Security. (arXiv:2401.10149v1 [cs.LG])",
    "abstract": "This paper demonstrates the potential for autonomous cyber defence to be applied on industrial control systems and provides a baseline environment to further explore Multi-Agent Reinforcement Learning's (MARL) application to this problem domain. It introduces a simulation environment, IPMSRL, of a generic Integrated Platform Management System (IPMS) and explores the use of MARL for autonomous cyber defence decision-making on generic maritime based IPMS Operational Technology (OT). OT cyber defensive actions are less mature than they are for Enterprise IT. This is due to the relatively brittle nature of OT infrastructure originating from the use of legacy systems, design-time engineering assumptions, and lack of full-scale modern security controls. There are many obstacles to be tackled across the cyber landscape due to continually increasing cyber-attack sophistication and the limitations of traditional IT-centric cyber defence solutions. Traditional IT controls are rarely deployed on ",
    "link": "http://arxiv.org/abs/2401.10149",
    "context": "Title: Multi-Agent Reinforcement Learning for Maritime Operational Technology Cyber Security. (arXiv:2401.10149v1 [cs.LG])\nAbstract: This paper demonstrates the potential for autonomous cyber defence to be applied on industrial control systems and provides a baseline environment to further explore Multi-Agent Reinforcement Learning's (MARL) application to this problem domain. It introduces a simulation environment, IPMSRL, of a generic Integrated Platform Management System (IPMS) and explores the use of MARL for autonomous cyber defence decision-making on generic maritime based IPMS Operational Technology (OT). OT cyber defensive actions are less mature than they are for Enterprise IT. This is due to the relatively brittle nature of OT infrastructure originating from the use of legacy systems, design-time engineering assumptions, and lack of full-scale modern security controls. There are many obstacles to be tackled across the cyber landscape due to continually increasing cyber-attack sophistication and the limitations of traditional IT-centric cyber defence solutions. Traditional IT controls are rarely deployed on ",
    "path": "papers/24/01/2401.10149.json",
    "total_tokens": 845,
    "translated_title": "多智能体强化学习在海上操作技术网络安全中的应用",
    "translated_abstract": "本文展示了将自主网络防御应用于工业控制系统的潜力，并提供了一个基准环境，以进一步探索多智能体强化学习在这个问题领域中的应用。它引入了一个模拟环境IPMSRL，用于一个通用集成平台管理系统(IPMS)，并探索了在通用海上IPMS操作技术(OT)中使用多智能体强化学习进行自主网络防御决策的方法。OT网络防御措施相对于企业IT来说还不够成熟。这是由于OT基础设施相对脆弱，源自于使用传统系统、设计时的工程假设以及缺乏全面的现代安全控制措施。由于不断增长的网络攻击复杂性和传统IT中心网络防御解决方案的局限性，网络安全领域存在许多挑战。",
    "tldr": "本文通过引入一个模拟环境IPMSRL，展示了将自主网络防御应用于工业控制系统的潜力，并探索了多智能体强化学习在海上操作技术网络安全中的应用。",
    "en_tdlr": "This paper demonstrates the potential for autonomous cyber defence to be applied on industrial control systems and explores the application of multi-agent reinforcement learning for maritime operational technology cyber security."
}