{
    "title": "DepressionEmo: A novel dataset for multilabel classification of depression emotions. (arXiv:2401.04655v1 [cs.CL])",
    "abstract": "Emotions are integral to human social interactions, with diverse responses elicited by various situational contexts. Particularly, the prevalence of negative emotional states has been correlated with negative outcomes for mental health, necessitating a comprehensive analysis of their occurrence and impact on individuals. In this paper, we introduce a novel dataset named DepressionEmo designed to detect 8 emotions associated with depression by 6037 examples of long Reddit user posts. This dataset was created through a majority vote over inputs by zero-shot classifications from pre-trained models and validating the quality by annotators and ChatGPT, exhibiting an acceptable level of interrater reliability between annotators. The correlation between emotions, their distribution over time, and linguistic analysis are conducted on DepressionEmo. Besides, we provide several text classification methods classified into two groups: machine learning methods such as SVM, XGBoost, and Light GBM; a",
    "link": "http://arxiv.org/abs/2401.04655",
    "context": "Title: DepressionEmo: A novel dataset for multilabel classification of depression emotions. (arXiv:2401.04655v1 [cs.CL])\nAbstract: Emotions are integral to human social interactions, with diverse responses elicited by various situational contexts. Particularly, the prevalence of negative emotional states has been correlated with negative outcomes for mental health, necessitating a comprehensive analysis of their occurrence and impact on individuals. In this paper, we introduce a novel dataset named DepressionEmo designed to detect 8 emotions associated with depression by 6037 examples of long Reddit user posts. This dataset was created through a majority vote over inputs by zero-shot classifications from pre-trained models and validating the quality by annotators and ChatGPT, exhibiting an acceptable level of interrater reliability between annotators. The correlation between emotions, their distribution over time, and linguistic analysis are conducted on DepressionEmo. Besides, we provide several text classification methods classified into two groups: machine learning methods such as SVM, XGBoost, and Light GBM; a",
    "path": "papers/24/01/2401.04655.json",
    "total_tokens": 890,
    "translated_title": "DepressionEmo: 用于抑郁情绪的多标签分类的新型数据集",
    "translated_abstract": "情绪对于人类社交互动至关重要,不同的情境背景会引发多样化的回应。尤其是负面情绪状态的普遍存在与心理健康的负面结果相关，因此有必要全面分析它们的发生和对个体的影响。在本文中，我们介绍了一个名为DepressionEmo的新型数据集，旨在通过6037个长文本Reddit用户帖子来检测与抑郁相关的8种情绪。该数据集通过预训练模型的零样本分类输入进行多数表决，并通过注释者和ChatGPT验证其质量，显示了注释者之间可接受的一致性水平。对于DepressionEmo，对情绪之间的相关性、随时间的分布以及语言分析进行了研究。此外，我们提供了几种文本分类方法，分为两组：机器学习方法（如SVM、XGBoost和Light GBM）；一",
    "tldr": "本文介绍了一个名为DepressionEmo的新数据集，旨在通过分析Reddit用户帖子来检测与抑郁相关的8种情绪。研究在该数据集上进行了情绪之间的相关性、分布和语言分析，并提供了几种文本分类方法。",
    "en_tdlr": "This paper introduces a new dataset called DepressionEmo, which aims to detect 8 emotions associated with depression by analyzing Reddit user posts. The study conducts analysis on the correlation, distribution, and linguistic aspects of emotions in this dataset, and provides several text classification methods."
}