{
    "title": "Exploiting Duality in Open Information Extraction with Predicate Prompt. (arXiv:2401.11107v1 [cs.CL])",
    "abstract": "Open information extraction (OpenIE) aims to extract the schema-free triplets in the form of (\\emph{subject}, \\emph{predicate}, \\emph{object}) from a given sentence. Compared with general information extraction (IE), OpenIE poses more challenges for the IE models, {especially when multiple complicated triplets exist in a sentence. To extract these complicated triplets more effectively, in this paper we propose a novel generative OpenIE model, namely \\emph{DualOIE}, which achieves a dual task at the same time as extracting some triplets from the sentence, i.e., converting the triplets into the sentence.} Such dual task encourages the model to correctly recognize the structure of the given sentence and thus is helpful to extract all potential triplets from the sentence. Specifically, DualOIE extracts the triplets in two steps: 1) first extracting a sequence of all potential predicates, 2) then using the predicate sequence as a prompt to induce the generation of triplets. Our experiments ",
    "link": "http://arxiv.org/abs/2401.11107",
    "context": "Title: Exploiting Duality in Open Information Extraction with Predicate Prompt. (arXiv:2401.11107v1 [cs.CL])\nAbstract: Open information extraction (OpenIE) aims to extract the schema-free triplets in the form of (\\emph{subject}, \\emph{predicate}, \\emph{object}) from a given sentence. Compared with general information extraction (IE), OpenIE poses more challenges for the IE models, {especially when multiple complicated triplets exist in a sentence. To extract these complicated triplets more effectively, in this paper we propose a novel generative OpenIE model, namely \\emph{DualOIE}, which achieves a dual task at the same time as extracting some triplets from the sentence, i.e., converting the triplets into the sentence.} Such dual task encourages the model to correctly recognize the structure of the given sentence and thus is helpful to extract all potential triplets from the sentence. Specifically, DualOIE extracts the triplets in two steps: 1) first extracting a sequence of all potential predicates, 2) then using the predicate sequence as a prompt to induce the generation of triplets. Our experiments ",
    "path": "papers/24/01/2401.11107.json",
    "total_tokens": 921,
    "translated_title": "使用谓词提示在开放信息提取中利用对偶性",
    "translated_abstract": "开放信息提取（OpenIE）旨在从给定的句子中提取以（主体，谓词，宾语）形式呈现的无模式三元组。与一般的信息提取（IE）相比，OpenIE对IE模型提出了更多挑战，尤其是在句子中存在多个复杂的三元组时。为了更有效地提取这些复杂的三元组，我们提出了一种新颖的生成式OpenIE模型，名为DualOIE，它在提取句子中的一些三元组的同时实现了另一个任务，即将三元组转化为句子。这种双重任务鼓励模型正确识别给定句子的结构，从而有助于从句子中提取所有潜在的三元组。具体而言，DualOIE分为两个步骤提取三元组：首先提取所有潜在谓词的序列，然后使用谓词序列作为提示诱导三元组的生成。",
    "tldr": "本文提出了一种新的生成式OpenIE模型DualOIE，通过实现一个双重任务，即将句子中的三元组转化为句子，来更有效地提取复杂的三元组。此方法鼓励模型正确识别句子结构，从而有助于提取所有潜在的三元组。",
    "en_tdlr": "This paper proposes a novel generative OpenIE model, DualOIE, which extracts complicated triplets more effectively by converting the triplets into the sentence. This approach encourages the model to correctly recognize sentence structure and helps extract all potential triplets."
}