{
    "title": "Characteristics and prevalence of fake social media profiles with AI-generated faces. (arXiv:2401.02627v1 [cs.CY])",
    "abstract": "Recent advancements in generative artificial intelligence (AI) have raised concerns about their potential to create convincing fake social media accounts, but empirical evidence is lacking. In this paper, we present a systematic analysis of Twitter(X) accounts using human faces generated by Generative Adversarial Networks (GANs) for their profile pictures. We present a dataset of 1,353 such accounts and show that they are used to spread scams, spam, and amplify coordinated messages, among other inauthentic activities. Leveraging a feature of GAN-generated faces -- consistent eye placement -- and supplementing it with human annotation, we devise an effective method for identifying GAN-generated profiles in the wild. Applying this method to a random sample of active Twitter users, we estimate a lower bound for the prevalence of profiles using GAN-generated faces between 0.021% and 0.044% -- around 10K daily active accounts. These findings underscore the emerging threats posed by multimod",
    "link": "http://arxiv.org/abs/2401.02627",
    "context": "Title: Characteristics and prevalence of fake social media profiles with AI-generated faces. (arXiv:2401.02627v1 [cs.CY])\nAbstract: Recent advancements in generative artificial intelligence (AI) have raised concerns about their potential to create convincing fake social media accounts, but empirical evidence is lacking. In this paper, we present a systematic analysis of Twitter(X) accounts using human faces generated by Generative Adversarial Networks (GANs) for their profile pictures. We present a dataset of 1,353 such accounts and show that they are used to spread scams, spam, and amplify coordinated messages, among other inauthentic activities. Leveraging a feature of GAN-generated faces -- consistent eye placement -- and supplementing it with human annotation, we devise an effective method for identifying GAN-generated profiles in the wild. Applying this method to a random sample of active Twitter users, we estimate a lower bound for the prevalence of profiles using GAN-generated faces between 0.021% and 0.044% -- around 10K daily active accounts. These findings underscore the emerging threats posed by multimod",
    "path": "papers/24/01/2401.02627.json",
    "total_tokens": 977,
    "translated_title": "伪造社交媒体账户的特点和普遍性，使用的是AI生成的面孔",
    "translated_abstract": "最近人工智能生成模型的进步引发了对其可能创建出逼真伪造社交媒体账户的担忧，但缺乏实证证据。本文对使用生成对抗网络（GANs）生成的人脸作为头像的Twitter(X)账户进行了系统分析。我们提供了一个包含1,353个此类账户的数据集，并展示了它们用于传播诈骗、垃圾信息以及放大协同信息等不真实活动。通过利用GAN生成的面孔的一个特征——眼睛的一致位置，并与人工注释相结合，我们设计了一种有效的方法来识别野外中使用GAN生成的账户。将该方法应用于随机样本的活跃Twitter用户中，我们估计使用GAN生成的面孔的账户普遍性下限在0.021%到0.044%之间，约为每日活跃账户10K个。这些发现突显了多模式账户对于新兴威胁的重要性。",
    "tldr": "本文分析了使用AI生成的人脸作为头像的伪造社交媒体账户，发现它们用于传播诈骗、垃圾信息以及放大协同信息等不真实活动。通过开发一种有效的方法，作者估计使用GAN生成的面孔的账户普遍性下限在0.021%到0.044%之间，约为每日活跃账户10K个。",
    "en_tdlr": "This paper analyzes the characteristics of fake social media accounts using AI-generated faces as profile pictures, finding that such accounts are used for spreading scams, spam, and amplifying coordinated messages. The authors estimate the prevalence of accounts using GAN-generated faces to be between 0.021% and 0.044%, which translates to approximately 10K daily active accounts."
}