{
    "title": "\"You tell me\": A Dataset of GPT-4-Based Behaviour Change Support Conversations",
    "abstract": "arXiv:2401.16167v2 Announce Type: replace-cross  Abstract: Conversational agents are increasingly used to address emotional needs on top of information needs. One use case of increasing interest are counselling-style mental health and behaviour change interventions, with large language model (LLM)-based approaches becoming more popular. Research in this context so far has been largely system-focused, foregoing the aspect of user behaviour and the impact this can have on LLM-generated texts. To address this issue, we share a dataset containing text-based user interactions related to behaviour change with two GPT-4-based conversational agents collected in a preregistered user study. This dataset includes conversation data, user language analysis, perception measures, and user feedback for LLM-generated turns, and can offer valuable insights to inform the design of such systems based on real interactions.",
    "link": "https://arxiv.org/abs/2401.16167",
    "context": "Title: \"You tell me\": A Dataset of GPT-4-Based Behaviour Change Support Conversations\nAbstract: arXiv:2401.16167v2 Announce Type: replace-cross  Abstract: Conversational agents are increasingly used to address emotional needs on top of information needs. One use case of increasing interest are counselling-style mental health and behaviour change interventions, with large language model (LLM)-based approaches becoming more popular. Research in this context so far has been largely system-focused, foregoing the aspect of user behaviour and the impact this can have on LLM-generated texts. To address this issue, we share a dataset containing text-based user interactions related to behaviour change with two GPT-4-based conversational agents collected in a preregistered user study. This dataset includes conversation data, user language analysis, perception measures, and user feedback for LLM-generated turns, and can offer valuable insights to inform the design of such systems based on real interactions.",
    "path": "papers/24/01/2401.16167.json",
    "total_tokens": 819,
    "translated_title": "\"你告诉我\": 一份基于GPT-4的行为变革支持对话数据集",
    "translated_abstract": "对话代理越来越被用于满足情感需求，除了信息需求。一个越来越受关注的用例是辅导式心理健康和行为变革干预，大型语言模型(LLM)方法的应用越来越流行。到目前为止，在这个背景下的研究主要集中在系统方面，忽略了用户行为以及这种行为对LLM生成的文本可能产生的影响。为了解决这一问题，我们分享了一个数据集，其中包含与行为变革相关的两个基于GPT-4对话代理在事先注册的用户研究中收集的基于文本的用户互动。该数据集包括对话数据、用户语言分析、感知度量以及LLM生成的对话回复的用户反馈，并可以提供有价值的见解，以便根据真实互动来设计此类系统。",
    "tldr": "该研究分享了一份数据集，其中包含关于行为变革的基于文本的用户互动数据，为研究人员提供了宝贵的见解，以便设计基于真实互动的对话系统",
    "en_tdlr": "This study presents a dataset containing text-based user interactions related to behavior change, offering valuable insights for researchers to design conversational systems based on real interactions."
}