{
    "title": "CRISIS ALERT:Forecasting Stock Market Crisis Events Using Machine Learning Methods. (arXiv:2401.06172v1 [q-fin.ST])",
    "abstract": "Historically, the economic recession often came abruptly and disastrously. For instance, during the 2008 financial crisis, the SP 500 fell 46 percent from October 2007 to March 2009. If we could detect the signals of the crisis earlier, we could have taken preventive measures. Therefore, driven by such motivation, we use advanced machine learning techniques, including Random Forest and Extreme Gradient Boosting, to predict any potential market crashes mainly in the US market. Also, we would like to compare the performance of these methods and examine which model is better for forecasting US stock market crashes. We apply our models on the daily financial market data, which tend to be more responsive with higher reporting frequencies. We consider 75 explanatory variables, including general US stock market indexes, SP 500 sector indexes, as well as market indicators that can be used for the purpose of crisis prediction. Finally, we conclude, with selected classification metrics, that the",
    "link": "http://arxiv.org/abs/2401.06172",
    "context": "Title: CRISIS ALERT:Forecasting Stock Market Crisis Events Using Machine Learning Methods. (arXiv:2401.06172v1 [q-fin.ST])\nAbstract: Historically, the economic recession often came abruptly and disastrously. For instance, during the 2008 financial crisis, the SP 500 fell 46 percent from October 2007 to March 2009. If we could detect the signals of the crisis earlier, we could have taken preventive measures. Therefore, driven by such motivation, we use advanced machine learning techniques, including Random Forest and Extreme Gradient Boosting, to predict any potential market crashes mainly in the US market. Also, we would like to compare the performance of these methods and examine which model is better for forecasting US stock market crashes. We apply our models on the daily financial market data, which tend to be more responsive with higher reporting frequencies. We consider 75 explanatory variables, including general US stock market indexes, SP 500 sector indexes, as well as market indicators that can be used for the purpose of crisis prediction. Finally, we conclude, with selected classification metrics, that the",
    "path": "papers/24/01/2401.06172.json",
    "total_tokens": 966,
    "translated_title": "危机警报：使用机器学习方法预测股市危机事件",
    "translated_abstract": "历史上，经济衰退往往突然而灾难性。例如，在2008年金融危机期间，标普500指数从2007年10月下跌了46％，持续到2009年3月。如果我们能早些发现危机的信号，我们就能采取预防措施。因此，受到这样的动机驱使，我们使用先进的机器学习技术，包括随机森林和极限梯度提升，主要预测美国市场可能发生的任何潜在市场崩盘。此外，我们还想比较这些方法的性能，并检查哪种模型更适合预测美国股市暴跌。我们将这些模型应用于每日金融市场数据，这些数据对于更高的报告频率更具响应性。我们考虑了75个解释变量，包括总体美国股市指数，标普500部门指数，以及可用于危机预测目的的市场指标。最后，我们通过选择的分类指标得出结论，即使用随机森林和极限梯度提升模型可以有效预测股市危机事件。",
    "tldr": "该论文使用机器学习方法预测股市危机事件，主要针对美国市场。论文比较了随机森林和极限梯度提升模型的性能，发现这两种模型可以有效预测股市危机。",
    "en_tdlr": "This paper uses machine learning methods to predict stock market crisis events, mainly focusing on the US market. The paper compares the performance of random forest and extreme gradient boosting models and finds that both models can effectively predict stock market crises."
}