{
    "title": "Equivariant Manifold Neural ODEs and Differential Invariants. (arXiv:2401.14131v1 [cs.LG])",
    "abstract": "In this paper we develop a manifestly geometric framework for equivariant manifold neural ordinary differential equations (NODEs), and use it to analyse their modelling capabilities for symmetric data. First, we consider the action of a Lie group $G$ on a smooth manifold $M$ and establish the equivalence between equivariance of vector fields, symmetries of the corresponding Cauchy problems, and equivariance of the associated NODEs. We also propose a novel formulation of the equivariant NODEs in terms of the differential invariants of the action of $G$ on $M$, based on Lie theory for symmetries of differential equations, which provides an efficient parameterisation of the space of equivariant vector fields in a way that is agnostic to both the manifold $M$ and the symmetry group $G$. Second, we construct augmented manifold NODEs, through embeddings into equivariant flows, and show that they are universal approximators of equivariant diffeomorphisms on any path-connected $M$. Furthermore",
    "link": "http://arxiv.org/abs/2401.14131",
    "context": "Title: Equivariant Manifold Neural ODEs and Differential Invariants. (arXiv:2401.14131v1 [cs.LG])\nAbstract: In this paper we develop a manifestly geometric framework for equivariant manifold neural ordinary differential equations (NODEs), and use it to analyse their modelling capabilities for symmetric data. First, we consider the action of a Lie group $G$ on a smooth manifold $M$ and establish the equivalence between equivariance of vector fields, symmetries of the corresponding Cauchy problems, and equivariance of the associated NODEs. We also propose a novel formulation of the equivariant NODEs in terms of the differential invariants of the action of $G$ on $M$, based on Lie theory for symmetries of differential equations, which provides an efficient parameterisation of the space of equivariant vector fields in a way that is agnostic to both the manifold $M$ and the symmetry group $G$. Second, we construct augmented manifold NODEs, through embeddings into equivariant flows, and show that they are universal approximators of equivariant diffeomorphisms on any path-connected $M$. Furthermore",
    "path": "papers/24/01/2401.14131.json",
    "total_tokens": 814,
    "translated_title": "等变流形神经常微分方程与微分不变量",
    "translated_abstract": "在本文中，我们为等变流形神经常微分方程（NODE）开发了一种明显几何的框架，并使用它来分析它们在对称数据建模方面的能力。首先，我们考虑Lie群G在光滑流形M上的作用，并建立了向量场的等变性、相应柯西问题的对称性以及关联的NODE的等变性之间的等价关系。我们还提出了一种关于G在M上作用的微分不变量的等变NODE新形式，基于Lie理论来描述微分方程对称性的参数化方法，既对M也对G都是不可知的。其次，我们通过嵌入等变流中构造了增广流形NODE，并证明它们是任何路径连通M上等变微分同胚的通用逼近器。",
    "tldr": "本文提出了一种等变流形神经常微分方程的几何框架，利用微分不变量和嵌入等变流形中的增广形式进行建模和逼近。",
    "en_tdlr": "This paper introduces a geometric framework for equivariant manifold neural ordinary differential equations (NODEs), utilizing differential invariants and augmented forms embedded in equivariant flows for modeling and approximation."
}