{
    "title": "Contractive Diffusion Probabilistic Models. (arXiv:2401.13115v1 [cs.LG])",
    "abstract": "Diffusion probabilistic models (DPMs) have emerged as a promising technology in generative modeling. The success of DPMs relies on two ingredients: time reversal of Markov diffusion processes and score matching. Most existing work implicitly assumes that score matching is close to perfect, while this assumption is questionable. In view of possibly unguaranteed score matching, we propose a new criterion -- the contraction of backward sampling in the design of DPMs. This leads to a novel class of contractive DPMs (CDPMs), including contractive Ornstein-Uhlenbeck (OU) processes and contractive sub-variance preserving (sub-VP) stochastic differential equations (SDEs). The key insight is that the contraction in the backward process narrows score matching errors, as well as discretization error. Thus, the proposed CDPMs are robust to both sources of error. Our proposal is supported by theoretical results, and is corroborated by experiments. Notably, contractive sub-VP shows the best performa",
    "link": "http://arxiv.org/abs/2401.13115",
    "context": "Title: Contractive Diffusion Probabilistic Models. (arXiv:2401.13115v1 [cs.LG])\nAbstract: Diffusion probabilistic models (DPMs) have emerged as a promising technology in generative modeling. The success of DPMs relies on two ingredients: time reversal of Markov diffusion processes and score matching. Most existing work implicitly assumes that score matching is close to perfect, while this assumption is questionable. In view of possibly unguaranteed score matching, we propose a new criterion -- the contraction of backward sampling in the design of DPMs. This leads to a novel class of contractive DPMs (CDPMs), including contractive Ornstein-Uhlenbeck (OU) processes and contractive sub-variance preserving (sub-VP) stochastic differential equations (SDEs). The key insight is that the contraction in the backward process narrows score matching errors, as well as discretization error. Thus, the proposed CDPMs are robust to both sources of error. Our proposal is supported by theoretical results, and is corroborated by experiments. Notably, contractive sub-VP shows the best performa",
    "path": "papers/24/01/2401.13115.json",
    "total_tokens": 1000,
    "translated_title": "收缩扩散概率模型",
    "translated_abstract": "收缩扩散概率模型（DPMs）已经成为生成建模中一种有前途的技术。DPMs的成功依赖于两个要素：马尔科夫扩散过程的时间反演和分数匹配。大多数现有的工作隐含地假设分数匹配是接近完美的，而这个假设是值得怀疑的。鉴于可能无法保证的分数匹配，我们在DPMs的设计中提出了一个新的准则——收缩后向采样。这导致了一种新的收缩DPMs（CDPMs）类，包括收缩奥恩斯坦-乌伦贝克（OU）过程和收缩子方差保持（sub-VP）随机微分方程（SDEs）。关键洞察力是后向过程的收缩能够缩小分数匹配误差和离散化误差。因此，所提出的CDPMs对于这两种误差都具有鲁棒性。我们的提议得到了理论结果的支持，并且通过实验进行了验证。值得注意的是，收缩子方差保持在表现上最佳。",
    "tldr": "收缩扩散概率模型（CDPMs）是一种新颖的生成建模技术，通过收缩后向采样并克服分数匹配误差和离散化误差的问题，提高了模型的鲁棒性。实验证明收缩子方差保持（sub-VP）是表现最佳的一种CDPMs。"
}