{
    "title": "CNN architecture extraction on edge GPU. (arXiv:2401.13575v1 [cs.CR])",
    "abstract": "Neural networks have become popular due to their versatility and state-of-the-art results in many applications, such as image classification, natural language processing, speech recognition, forecasting, etc. These applications are also used in resource-constrained environments such as embedded devices. In this work, the susceptibility of neural network implementations to reverse engineering is explored on the NVIDIA Jetson Nano microcomputer via side-channel analysis. To this end, an architecture extraction attack is presented. In the attack, 15 popular convolutional neural network architectures (EfficientNets, MobileNets, NasNet, etc.) are implemented on the GPU of Jetson Nano and the electromagnetic radiation of the GPU is analyzed during the inference operation of the neural networks. The results of the analysis show that neural network architectures are easily distinguishable using deep learning-based side-channel analysis.",
    "link": "http://arxiv.org/abs/2401.13575",
    "context": "Title: CNN architecture extraction on edge GPU. (arXiv:2401.13575v1 [cs.CR])\nAbstract: Neural networks have become popular due to their versatility and state-of-the-art results in many applications, such as image classification, natural language processing, speech recognition, forecasting, etc. These applications are also used in resource-constrained environments such as embedded devices. In this work, the susceptibility of neural network implementations to reverse engineering is explored on the NVIDIA Jetson Nano microcomputer via side-channel analysis. To this end, an architecture extraction attack is presented. In the attack, 15 popular convolutional neural network architectures (EfficientNets, MobileNets, NasNet, etc.) are implemented on the GPU of Jetson Nano and the electromagnetic radiation of the GPU is analyzed during the inference operation of the neural networks. The results of the analysis show that neural network architectures are easily distinguishable using deep learning-based side-channel analysis.",
    "path": "papers/24/01/2401.13575.json",
    "total_tokens": 805,
    "translated_title": "边缘GPU上的CNN架构提取",
    "translated_abstract": "由于其多功能性和在许多应用中的最新结果（如图像分类、自然语言处理、语音识别、预测等），神经网络变得越来越受欢迎。这些应用也被用于资源受限的嵌入式设备。本研究通过侧信道分析，探讨了神经网络实现对逆向工程的敏感性，使用NVIDIA Jetson Nano微型计算机进行研究。为此，提出了一种架构提取攻击。在攻击中，将15种流行的卷积神经网络架构（EfficientNets、MobileNets、NasNet等）在Jetson Nano的GPU上实现，并在神经网络推理操作期间分析GPU的电磁辐射。分析结果表明，使用基于深度学习的侧信道分析可以轻松区分神经网络架构。",
    "tldr": "本文研究了在边缘GPU上进行CNN架构提取的攻击，通过分析GPU的电磁辐射，使用深度学习的侧信道分析可轻松区分不同的神经网络架构。"
}