{
    "title": "Learning under Label Noise through Few-Shot Human-in-the-Loop Refinement. (arXiv:2401.14107v1 [cs.LG])",
    "abstract": "Wearable technologies enable continuous monitoring of various health metrics, such as physical activity, heart rate, sleep, and stress levels. A key challenge with wearable data is obtaining quality labels. Unlike modalities like video where the videos themselves can be effectively used to label objects or events, wearable data do not contain obvious cues about the physical manifestation of the users and usually require rich metadata. As a result, label noise can become an increasingly thorny issue when labeling such data. In this paper, we propose a novel solution to address noisy label learning, entitled Few-Shot Human-in-the-Loop Refinement (FHLR). Our method initially learns a seed model using weak labels. Next, it fine-tunes the seed model using a handful of expert corrections. Finally, it achieves better generalizability and robustness by merging the seed and fine-tuned models via weighted parameter averaging. We evaluate our approach on four challenging tasks and datasets, and c",
    "link": "http://arxiv.org/abs/2401.14107",
    "context": "Title: Learning under Label Noise through Few-Shot Human-in-the-Loop Refinement. (arXiv:2401.14107v1 [cs.LG])\nAbstract: Wearable technologies enable continuous monitoring of various health metrics, such as physical activity, heart rate, sleep, and stress levels. A key challenge with wearable data is obtaining quality labels. Unlike modalities like video where the videos themselves can be effectively used to label objects or events, wearable data do not contain obvious cues about the physical manifestation of the users and usually require rich metadata. As a result, label noise can become an increasingly thorny issue when labeling such data. In this paper, we propose a novel solution to address noisy label learning, entitled Few-Shot Human-in-the-Loop Refinement (FHLR). Our method initially learns a seed model using weak labels. Next, it fine-tunes the seed model using a handful of expert corrections. Finally, it achieves better generalizability and robustness by merging the seed and fine-tuned models via weighted parameter averaging. We evaluate our approach on four challenging tasks and datasets, and c",
    "path": "papers/24/01/2401.14107.json",
    "total_tokens": 979,
    "translated_title": "通过少样本人机协作改进实现噪声标签下的学习",
    "translated_abstract": "可穿戴技术能够连续监测各种健康指标，如身体活动、心率、睡眠和压力水平。可穿戴数据的一个关键挑战是获取高质量的标签。与视频等模态不同，可穿戴数据不包含关于用户的物理表现的明显线索，通常需要丰富的元数据。因此，在为这样的数据标注时，标签噪声可能成为一个越来越棘手的问题。在本文中，我们提出了一种解决噪声标签学习的新方法，称为少样本人机协作改进（FHLR）。我们的方法首先使用弱标签学习一个种子模型。接下来，它使用少量的专家修正对种子模型进行微调。最后，通过加权参数平均将种子模型和微调模型合并，以实现更好的泛化能力和鲁棒性。我们在四个具有挑战性的任务和数据集上评估了我们的方法",
    "tldr": "本文提出了一种名为少样本人机协作改进（FHLR）的方法，用于解决可穿戴数据中的噪声标签学习问题。该方法通过使用弱标签学习种子模型，使用少量的专家修正对种子模型进行微调，并通过加权参数平均将种子模型和微调模型合并，以提高泛化能力和鲁棒性。",
    "en_tdlr": "In this paper, we propose a method called Few-Shot Human-in-the-Loop Refinement (FHLR) to address the problem of label noise learning in wearable data. The method learns a seed model using weak labels, fine-tunes it with expert corrections, and merges the seed and fine-tuned models via weighted parameter averaging, resulting in improved generalizability and robustness."
}