{
    "title": "Benchmarking with MIMIC-IV, an irregular, spare clinical time series dataset. (arXiv:2401.15290v1 [cs.LG])",
    "abstract": "Electronic health record (EHR) is more and more popular, and it comes with applying machine learning solutions to resolve various problems in the domain. This growing research area also raises the need for EHRs accessibility. Medical Information Mart for Intensive Care (MIMIC) dataset is a popular, public, and free EHR dataset in a raw format that has been used in numerous studies. However, despite of its popularity, it is lacking benchmarking work, especially with recent state of the art works in the field of deep learning with time-series tabular data. The aim of this work is to fill this lack by providing a benchmark for latest version of MIMIC dataset, MIMIC-IV. We also give a detailed literature survey about studies that has been already done for MIIMIC-III.",
    "link": "http://arxiv.org/abs/2401.15290",
    "context": "Title: Benchmarking with MIMIC-IV, an irregular, spare clinical time series dataset. (arXiv:2401.15290v1 [cs.LG])\nAbstract: Electronic health record (EHR) is more and more popular, and it comes with applying machine learning solutions to resolve various problems in the domain. This growing research area also raises the need for EHRs accessibility. Medical Information Mart for Intensive Care (MIMIC) dataset is a popular, public, and free EHR dataset in a raw format that has been used in numerous studies. However, despite of its popularity, it is lacking benchmarking work, especially with recent state of the art works in the field of deep learning with time-series tabular data. The aim of this work is to fill this lack by providing a benchmark for latest version of MIMIC dataset, MIMIC-IV. We also give a detailed literature survey about studies that has been already done for MIIMIC-III.",
    "path": "papers/24/01/2401.15290.json",
    "total_tokens": 811,
    "translated_title": "使用非规律且稀疏的临床时间序列数据集MIMIC-IV进行基准测试",
    "translated_abstract": "电子健康记录（EHR）越来越受欢迎，并且随之而来的是将机器学习解决方案应用于该领域的各种问题。这个不断增长的研究领域也引发了对EHR的可访问性的需求。MIMIC（医学信息市场）数据集是一个受欢迎的、公开的、免费的EHR数据集，以原始格式提供，并已在无数研究中使用。然而，尽管其受欢迎程度，却缺乏基准测试工作，特别是与最近在深度学习和时间序列标签数据领域的最新研究相结合。本研究的目的是通过提供最新版本的MIMIC数据集MIMIC-IV来填补这一空缺。我们还对已经完成的针对MIMIC-III的研究进行了详细的文献调查。",
    "tldr": "这项工作旨在为最新版本的MIMIC数据集（MIMIC-IV）提供基准测试，填补该领域在深度学习和时间序列标签数据方面的研究尚未解决的问题。"
}