{
    "title": "A Stochastic Approach to Classification Error Estimates in Convolutional Neural Networks. (arXiv:2401.06156v1 [cs.CV])",
    "abstract": "This technical report presents research results achieved in the field of verification of trained Convolutional Neural Network (CNN) used for image classification in safety-critical applications. As running example, we use the obstacle detection function needed in future autonomous freight trains with Grade of Automation (GoA) 4. It is shown that systems like GoA 4 freight trains are indeed certifiable today with new standards like ANSI/UL 4600 and ISO 21448 used in addition to the long-existing standards EN 50128 and EN 50129. Moreover, we present a quantitative analysis of the system-level hazard rate to be expected from an obstacle detection function. It is shown that using sensor/perceptor fusion, the fused detection system can meet the tolerable hazard rate deemed to be acceptable for the safety integrity level to be applied (SIL-3). A mathematical analysis of CNN models is performed which results in the identification of classification clusters and equivalence classes partitioning",
    "link": "http://arxiv.org/abs/2401.06156",
    "context": "Title: A Stochastic Approach to Classification Error Estimates in Convolutional Neural Networks. (arXiv:2401.06156v1 [cs.CV])\nAbstract: This technical report presents research results achieved in the field of verification of trained Convolutional Neural Network (CNN) used for image classification in safety-critical applications. As running example, we use the obstacle detection function needed in future autonomous freight trains with Grade of Automation (GoA) 4. It is shown that systems like GoA 4 freight trains are indeed certifiable today with new standards like ANSI/UL 4600 and ISO 21448 used in addition to the long-existing standards EN 50128 and EN 50129. Moreover, we present a quantitative analysis of the system-level hazard rate to be expected from an obstacle detection function. It is shown that using sensor/perceptor fusion, the fused detection system can meet the tolerable hazard rate deemed to be acceptable for the safety integrity level to be applied (SIL-3). A mathematical analysis of CNN models is performed which results in the identification of classification clusters and equivalence classes partitioning",
    "path": "papers/24/01/2401.06156.json",
    "total_tokens": 859,
    "translated_title": "卷积神经网络中分类误差估计的随机方法",
    "translated_abstract": "本技术报告介绍了在安全关键应用中用于图像分类的已训练卷积神经网络（CNN）的验证研究结果。以未来4级自动驾驶货运列车中的障碍物检测功能为例，通过使用ANSI/UL 4600和ISO 21448等新标准，证明了像GoA 4货运列车这样的系统确实可以达到认证要求，以及EN 50128和EN 50129等已有标准。此外，我们对预期的障碍物检测功能系统级危险率进行了定量分析。结果表明，使用传感器/感知器融合，融合检测系统可以满足安全完整性级别所需的可接受危险率（SIL-3）。对CNN模型进行了数学分析，确定了分类聚类和等价类划分。",
    "tldr": "本研究针对用于安全关键应用的图像分类的训练卷积神经网络进行了验证研究，证明了系统可以达到认证要求，并对障碍物检测功能的系统级危险率进行了定量分析。"
}