{
    "title": "LLM4EDA: Emerging Progress in Large Language Models for Electronic Design Automation. (arXiv:2401.12224v1 [cs.AR])",
    "abstract": "Driven by Moore's Law, the complexity and scale of modern chip design are increasing rapidly. Electronic Design Automation (EDA) has been widely applied to address the challenges encountered in the full chip design process. However, the evolution of very large-scale integrated circuits has made chip design time-consuming and resource-intensive, requiring substantial prior expert knowledge. Additionally, intermediate human control activities are crucial for seeking optimal solutions. In system design stage, circuits are usually represented with Hardware Description Language (HDL) as a textual format. Recently, Large Language Models (LLMs) have demonstrated their capability in context understanding, logic reasoning and answer generation. Since circuit can be represented with HDL in a textual format, it is reasonable to question whether LLMs can be leveraged in the EDA field to achieve fully automated chip design and generate circuits with improved power, performance, and area (PPA). In t",
    "link": "http://arxiv.org/abs/2401.12224",
    "context": "Title: LLM4EDA: Emerging Progress in Large Language Models for Electronic Design Automation. (arXiv:2401.12224v1 [cs.AR])\nAbstract: Driven by Moore's Law, the complexity and scale of modern chip design are increasing rapidly. Electronic Design Automation (EDA) has been widely applied to address the challenges encountered in the full chip design process. However, the evolution of very large-scale integrated circuits has made chip design time-consuming and resource-intensive, requiring substantial prior expert knowledge. Additionally, intermediate human control activities are crucial for seeking optimal solutions. In system design stage, circuits are usually represented with Hardware Description Language (HDL) as a textual format. Recently, Large Language Models (LLMs) have demonstrated their capability in context understanding, logic reasoning and answer generation. Since circuit can be represented with HDL in a textual format, it is reasonable to question whether LLMs can be leveraged in the EDA field to achieve fully automated chip design and generate circuits with improved power, performance, and area (PPA). In t",
    "path": "papers/24/01/2401.12224.json",
    "total_tokens": 901,
    "translated_title": "LLM4EDA：大型语言模型在电子设计自动化中的新进展",
    "translated_abstract": "驱动着摩尔定律，现代芯片设计的复杂性和规模正在迅速增加。电子设计自动化（EDA）已被广泛应用于解决完整芯片设计过程中遇到的挑战。然而，超大规模集成电路的演进使得芯片设计耗时且资源密集，需要大量的专业知识。此外，在寻求最佳解决方案时，中间的人工控制活动至关重要。在系统设计阶段，电路通常用硬件描述语言（HDL）作为文本格式表示。最近，大型语言模型（LLM）在上下文理解、逻辑推理和答案生成方面展现出了自己的能力。由于电路可以用HDL作为文本格式表示，合理地质疑LLM能否在EDA领域中发挥作用，实现完全自动化的芯片设计并生成具有改进的功耗、性能和面积（PPA）的电路。",
    "tldr": "LLMs have shown promising potential in achieving fully automated chip design and generating circuits with improved power, performance, and area (PPA) in the field of Electronic Design Automation (EDA). (翻译为：LLM在电子设计自动化（EDA）领域显示出了实现全自动化芯片设计和生成具有改进功耗、性能和面积（PPA）的电路的潜力)",
    "en_tdlr": "LLMs have shown promising potential in achieving fully automated chip design and generating circuits with improved power, performance, and area (PPA) in the field of Electronic Design Automation (EDA)."
}