{
    "title": "CIS-UNet: Multi-Class Segmentation of the Aorta in Computed Tomography Angiography via Context-Aware Shifted Window Self-Attention. (arXiv:2401.13049v1 [eess.IV])",
    "abstract": "Advancements in medical imaging and endovascular grafting have facilitated minimally invasive treatments for aortic diseases. Accurate 3D segmentation of the aorta and its branches is crucial for interventions, as inaccurate segmentation can lead to erroneous surgical planning and endograft construction. Previous methods simplified aortic segmentation as a binary image segmentation problem, overlooking the necessity of distinguishing between individual aortic branches. In this paper, we introduce Context Infused Swin-UNet (CIS-UNet), a deep learning model designed for multi-class segmentation of the aorta and thirteen aortic branches. Combining the strengths of Convolutional Neural Networks (CNNs) and Swin transformers, CIS-UNet adopts a hierarchical encoder-decoder structure comprising a CNN encoder, symmetric decoder, skip connections, and a novel Context-aware Shifted Window Self-Attention (CSW-SA) as the bottleneck block. Notably, CSW-SA introduces a unique utilization of the patch",
    "link": "http://arxiv.org/abs/2401.13049",
    "context": "Title: CIS-UNet: Multi-Class Segmentation of the Aorta in Computed Tomography Angiography via Context-Aware Shifted Window Self-Attention. (arXiv:2401.13049v1 [eess.IV])\nAbstract: Advancements in medical imaging and endovascular grafting have facilitated minimally invasive treatments for aortic diseases. Accurate 3D segmentation of the aorta and its branches is crucial for interventions, as inaccurate segmentation can lead to erroneous surgical planning and endograft construction. Previous methods simplified aortic segmentation as a binary image segmentation problem, overlooking the necessity of distinguishing between individual aortic branches. In this paper, we introduce Context Infused Swin-UNet (CIS-UNet), a deep learning model designed for multi-class segmentation of the aorta and thirteen aortic branches. Combining the strengths of Convolutional Neural Networks (CNNs) and Swin transformers, CIS-UNet adopts a hierarchical encoder-decoder structure comprising a CNN encoder, symmetric decoder, skip connections, and a novel Context-aware Shifted Window Self-Attention (CSW-SA) as the bottleneck block. Notably, CSW-SA introduces a unique utilization of the patch",
    "path": "papers/24/01/2401.13049.json",
    "total_tokens": 1031,
    "translated_title": "CIS-UNet: 基于上下文感知的平移窗口自注意力的CTA主动脉多类分割",
    "translated_abstract": "医学成像和内衬血管膜技术的进步促进了主动脉疾病的微创治疗。准确地对主动脉及其分支进行3D分割对于干预至关重要，因为不准确的分割可能导致错误的手术规划和内部支架构造。之前的方法将主动脉分割简化为二值图像分割问题，忽视了区分各个主动脉分支的必要性。在本文中，我们介绍了一种称为Context Infused Swin-UNet（CIS-UNet）的深度学习模型，用于主动脉和十三个主动脉分支的多类分割。CIS-UNet结合了卷积神经网络（CNNs）和Swin transformers的优势，采用了层次化的编码器-解码器结构，包括CNN编码器、对称解码器、跳跃连接，以及一种新颖的基于上下文感知的平移窗口自注意力（CSW-SA）作为瓶颈模块。值得注意的是，CSW-SA引入了一种独特的方法来利用图像中的补丁信息。",
    "tldr": "本研究提出了一种称为CIS-UNet的深度学习模型，用于主动脉和主动脉分支的多类分割。该模型结合了CNN和Swin transformers的优势，采用了上下文感知的平移窗口自注意力，能够准确地识别主动脉的各个分支。"
}