{
    "title": "MsDC-DEQ-Net: Deep Equilibrium Model (DEQ) with Multi-scale Dilated Convolution for Image Compressive Sensing (CS). (arXiv:2401.02884v1 [eess.IV])",
    "abstract": "Compressive sensing (CS) is a technique that enables the recovery of sparse signals using fewer measurements than traditional sampling methods. To address the computational challenges of CS reconstruction, our objective is to develop an interpretable and concise neural network model for reconstructing natural images using CS. We achieve this by mapping one step of the iterative shrinkage thresholding algorithm (ISTA) to a deep network block, representing one iteration of ISTA. To enhance learning ability and incorporate structural diversity, we integrate aggregated residual transformations (ResNeXt) and squeeze-and-excitation (SE) mechanisms into the ISTA block. This block serves as a deep equilibrium layer, connected to a semi-tensor product network (STP-Net) for convenient sampling and providing an initial reconstruction. The resulting model, called MsDC-DEQ-Net, exhibits competitive performance compared to state-of-the-art network-based methods. It significantly reduces storage requ",
    "link": "http://arxiv.org/abs/2401.02884",
    "context": "Title: MsDC-DEQ-Net: Deep Equilibrium Model (DEQ) with Multi-scale Dilated Convolution for Image Compressive Sensing (CS). (arXiv:2401.02884v1 [eess.IV])\nAbstract: Compressive sensing (CS) is a technique that enables the recovery of sparse signals using fewer measurements than traditional sampling methods. To address the computational challenges of CS reconstruction, our objective is to develop an interpretable and concise neural network model for reconstructing natural images using CS. We achieve this by mapping one step of the iterative shrinkage thresholding algorithm (ISTA) to a deep network block, representing one iteration of ISTA. To enhance learning ability and incorporate structural diversity, we integrate aggregated residual transformations (ResNeXt) and squeeze-and-excitation (SE) mechanisms into the ISTA block. This block serves as a deep equilibrium layer, connected to a semi-tensor product network (STP-Net) for convenient sampling and providing an initial reconstruction. The resulting model, called MsDC-DEQ-Net, exhibits competitive performance compared to state-of-the-art network-based methods. It significantly reduces storage requ",
    "path": "papers/24/01/2401.02884.json",
    "total_tokens": 970,
    "translated_title": "MsDC-DEQ-Net: 用于图像压缩感知的多尺度扩张卷积DEQ深度平衡模型",
    "translated_abstract": "压缩感知是一种利用较少测量量恢复稀疏信号的技术。为了解决压缩感知重建的计算挑战，我们的目标是开发一个可解释且简明的神经网络模型，用于使用压缩感知重建自然图像。我们通过将迭代缩减阈值算法（ISTA）的一个步骤映射到一个深度网络块中来实现这一目标，表示一个ISTA的一次迭代。为了增强学习能力和融入结构多样性，我们将聚合残差变换（ResNeXt）和挤压与激励机制（SE）集成到ISTA块中。该块作为深度平衡层连接到一个半张量积网络（STP-Net），用于方便采样并提供初始重建。得到的模型称为MsDC-DEQ-Net，与最先进的基于网络的方法相比具有竞争性能。它显著减少了存储需求。",
    "tldr": "这篇论文提出了一个名为MsDC-DEQ-Net的深度平衡模型，通过将压缩感知重建算法的步骤映射到深度网络块中，并结合了聚合残差变换和挤压与激励机制，在压缩感知重建中取得了竞争性能。",
    "en_tdlr": "This paper proposes a deep equilibrium model called MsDC-DEQ-Net, which maps the steps of compressive sensing reconstruction algorithm to deep network blocks and incorporates aggregated residual transformations and squeeze-and-excitation mechanisms, achieving competitive performance in compressive sensing reconstruction."
}