{
    "title": "Wealth dynamics in a multi-aggregate closed monetary system. (arXiv:2401.09871v1 [econ.TH])",
    "abstract": "We examine the statistical properties of a closed monetary economy with multi-aggregates interactions. Building upon Yakovenko's single-agent monetary model (Dragulescu and Yakovenko, 2000), we investigate the joint equilibrium distribution of aggregate size and wealth. By comparing theoretical and simulated data, we validate our findings and investigate the influence of both micro dynamics and macro characteristics of the system on the distribution. Additionally, we analyze the system's convergence towards equilibrium under various conditions. Our laboratory model may offer valuable insights into macroeconomic phenomena allowing to reproduce typical wealth distribution features observed in real economy.",
    "link": "http://arxiv.org/abs/2401.09871",
    "context": "Title: Wealth dynamics in a multi-aggregate closed monetary system. (arXiv:2401.09871v1 [econ.TH])\nAbstract: We examine the statistical properties of a closed monetary economy with multi-aggregates interactions. Building upon Yakovenko's single-agent monetary model (Dragulescu and Yakovenko, 2000), we investigate the joint equilibrium distribution of aggregate size and wealth. By comparing theoretical and simulated data, we validate our findings and investigate the influence of both micro dynamics and macro characteristics of the system on the distribution. Additionally, we analyze the system's convergence towards equilibrium under various conditions. Our laboratory model may offer valuable insights into macroeconomic phenomena allowing to reproduce typical wealth distribution features observed in real economy.",
    "path": "papers/24/01/2401.09871.json",
    "total_tokens": 860,
    "translated_title": "一个多聚合闭合货币系统中的财富动态",
    "translated_abstract": "我们研究了一个具有多聚合相互作用的闭合货币经济的统计特性。在延续Yakovenko的单一代理人货币模型的基础上（Dragulescu and Yakovenko, 2000），我们研究了聚合规模和财富的联合均衡分布。通过比较理论和模拟数据，我们验证了我们的发现，并研究了微观动力学和宏观特征对分布的影响。此外，我们还分析了系统在各种条件下向均衡收敛的情况。我们的实验室模型可能为复制真实经济中观察到的典型财富分布特征提供有价值的见解。",
    "tldr": "本研究通过研究多聚合闭合货币经济的统计特性，找到了聚合规模和财富的联合均衡分布，并验证了理论模拟数据的准确性。研究还分析了微观动力学和宏观特征对分布的影响，以及系统向均衡收敛的情况。这个实验室模型为复制真实经济中的典型财富分布特征提供了有价值的见解。",
    "en_tdlr": "This study explores the statistical properties of a closed monetary economy with multi-aggregate interactions and validates the joint equilibrium distribution of aggregate size and wealth through theoretical and simulated data. It also analyzes the impact of micro dynamics and macro characteristics on the distribution, as well as the convergence of the system towards equilibrium under different conditions. The laboratory model developed in this research provides valuable insights into reproducing typical wealth distribution features observed in the real economy."
}