{
    "title": "Synthetic Information towards Maximum Posterior Ratio for deep learning on Imbalanced Data. (arXiv:2401.02591v1 [cs.LG])",
    "abstract": "This study examines the impact of class-imbalanced data on deep learning models and proposes a technique for data balancing by generating synthetic data for the minority class. Unlike random-based oversampling, our method prioritizes balancing the informative regions by identifying high entropy samples. Generating well-placed synthetic data can enhance machine learning algorithms accuracy and efficiency, whereas poorly-placed ones may lead to higher misclassification rates. We introduce an algorithm that maximizes the probability of generating a synthetic sample in the correct region of its class by optimizing the class posterior ratio. Additionally, to maintain data topology, synthetic data are generated within each minority sample's neighborhood. Our experimental results on forty-one datasets demonstrate the superior performance of our technique in enhancing deep-learning models.",
    "link": "http://arxiv.org/abs/2401.02591",
    "context": "Title: Synthetic Information towards Maximum Posterior Ratio for deep learning on Imbalanced Data. (arXiv:2401.02591v1 [cs.LG])\nAbstract: This study examines the impact of class-imbalanced data on deep learning models and proposes a technique for data balancing by generating synthetic data for the minority class. Unlike random-based oversampling, our method prioritizes balancing the informative regions by identifying high entropy samples. Generating well-placed synthetic data can enhance machine learning algorithms accuracy and efficiency, whereas poorly-placed ones may lead to higher misclassification rates. We introduce an algorithm that maximizes the probability of generating a synthetic sample in the correct region of its class by optimizing the class posterior ratio. Additionally, to maintain data topology, synthetic data are generated within each minority sample's neighborhood. Our experimental results on forty-one datasets demonstrate the superior performance of our technique in enhancing deep-learning models.",
    "path": "papers/24/01/2401.02591.json",
    "total_tokens": 872,
    "translated_title": "通过生成合成数据来实现对不均衡数据上的深度学习的最大后验比率的研究",
    "translated_abstract": "本研究检验了类别不平衡数据对深度学习模型的影响，并提出了一种通过生成少数类别的合成数据来平衡数据的技术。与基于随机过采样的方法不同，我们的方法优先平衡信息丰富区域，通过识别高熵样本。生成适当位置的合成数据可以提高机器学习算法的准确性和效率，而生成位置不当的合成数据可能导致更高的误分类率。我们介绍了一种通过优化类别后验比率来最大化在正确的类别区域生成合成样本的概率的算法。此外，为了保持数据拓扑，合成数据在每个少数类别样本的邻域内生成。我们在41个数据集上的实验结果表明了我们的技术在提升深度学习模型方面的卓越性能。",
    "tldr": "本研究提出了一种通过生成合成数据来平衡类别不平衡数据的技术，优先平衡信息丰富区域，并通过优化类别后验比率来最大化在正确的类别区域生成合成样本的概率。实验结果表明该技术在提升深度学习模型方面具有卓越性能。",
    "en_tdlr": "This study proposes a technique to balance imbalanced data by generating synthetic data, prioritizing balancing informative regions, and maximizing the probability of generating synthetic samples in the correct class region through optimizing the class posterior ratio. Experimental results demonstrate the superior performance of this technique in enhancing deep learning models."
}