{
    "title": "Decentralizing Coordination in Open Vehicle Fleets for Scalable and Dynamic Task Allocation. (arXiv:2401.10965v1 [cs.MA])",
    "abstract": "One of the major challenges in the coordination of large, open, collaborative, and commercial vehicle fleets is dynamic task allocation. Self-concerned individually rational vehicle drivers have both local and global objectives, which require coordination using some fair and efficient task allocation method. In this paper, we review the literature on scalable and dynamic task allocation focusing on deterministic and dynamic two-dimensional linear assignment problems. We focus on multiagent system representation of open vehicle fleets where dynamically appearing vehicles are represented by software agents that should be allocated to a set of dynamically appearing tasks. We give a comparison and critical analysis of recent research results focusing on centralized, distributed, and decentralized solution approaches. Moreover, we propose mathematical models for dynamic versions of the following assignment problems well known in combinatorial optimization: the assignment problem, bottleneck",
    "link": "http://arxiv.org/abs/2401.10965",
    "context": "Title: Decentralizing Coordination in Open Vehicle Fleets for Scalable and Dynamic Task Allocation. (arXiv:2401.10965v1 [cs.MA])\nAbstract: One of the major challenges in the coordination of large, open, collaborative, and commercial vehicle fleets is dynamic task allocation. Self-concerned individually rational vehicle drivers have both local and global objectives, which require coordination using some fair and efficient task allocation method. In this paper, we review the literature on scalable and dynamic task allocation focusing on deterministic and dynamic two-dimensional linear assignment problems. We focus on multiagent system representation of open vehicle fleets where dynamically appearing vehicles are represented by software agents that should be allocated to a set of dynamically appearing tasks. We give a comparison and critical analysis of recent research results focusing on centralized, distributed, and decentralized solution approaches. Moreover, we propose mathematical models for dynamic versions of the following assignment problems well known in combinatorial optimization: the assignment problem, bottleneck",
    "path": "papers/24/01/2401.10965.json",
    "total_tokens": 845,
    "translated_title": "分散协调下开放车队的可扩展和动态任务分配",
    "translated_abstract": "大规模、开放、协作和商业车队的协调中一个主要的挑战是动态任务分配。具有自我关注的个体理性车辆驾驶员有着本地和全局的目标，需要通过公平和高效的任务分配方法进行协调。本文主要研究可扩展和动态任务分配的文献，重点关注确定性和动态二维线性分配问题。我们将重点放在开放车队的多代理系统表示上，其中动态出现的车辆由软件代理表示，应分配到一组动态出现的任务。我们对最近的研究结果进行比较和批判性分析，着重关注集中式、分布式和分散式解决方法。此外，我们提出了数学模型，用于组合优化中众所周知的以下动态版本的分配问题：分配问题、瓶颈问题",
    "tldr": "本文研究了在分散协调环境下开放车队的可扩展和动态任务分配，提出了多代理系统的表示方法，并对最近的研究结果进行了比较和批判性分析。同时，提出了数学模型来解决动态分配问题。"
}