{
    "title": "TreeMIL: A Multi-instance Learning Framework for Time Series Anomaly Detection with Inexact Supervision. (arXiv:2401.11235v1 [cs.LG])",
    "abstract": "Time series anomaly detection (TSAD) plays a vital role in various domains such as healthcare, networks, and industry. Considering labels are crucial for detection but difficult to obtain, we turn to TSAD with inexact supervision: only series-level labels are provided during the training phase, while point-level anomalies are predicted during the testing phase. Previous works follow a traditional multi-instance learning (MIL) approach, which focuses on encouraging high anomaly scores at individual time steps. However, time series anomalies are not only limited to individual point anomalies, they can also be collective anomalies, typically exhibiting abnormal patterns over subsequences. To address the challenge of collective anomalies, in this paper, we propose a tree-based MIL framework (TreeMIL). We first adopt an N-ary tree structure to divide the entire series into multiple nodes, where nodes at different levels represent subsequences with different lengths. Then, the subsequence fe",
    "link": "http://arxiv.org/abs/2401.11235",
    "context": "Title: TreeMIL: A Multi-instance Learning Framework for Time Series Anomaly Detection with Inexact Supervision. (arXiv:2401.11235v1 [cs.LG])\nAbstract: Time series anomaly detection (TSAD) plays a vital role in various domains such as healthcare, networks, and industry. Considering labels are crucial for detection but difficult to obtain, we turn to TSAD with inexact supervision: only series-level labels are provided during the training phase, while point-level anomalies are predicted during the testing phase. Previous works follow a traditional multi-instance learning (MIL) approach, which focuses on encouraging high anomaly scores at individual time steps. However, time series anomalies are not only limited to individual point anomalies, they can also be collective anomalies, typically exhibiting abnormal patterns over subsequences. To address the challenge of collective anomalies, in this paper, we propose a tree-based MIL framework (TreeMIL). We first adopt an N-ary tree structure to divide the entire series into multiple nodes, where nodes at different levels represent subsequences with different lengths. Then, the subsequence fe",
    "path": "papers/24/01/2401.11235.json",
    "total_tokens": 945,
    "translated_title": "TreeMIL：一个用于带有不精确监督的时间序列异常检测的多实例学习框架",
    "translated_abstract": "时间序列异常检测在医疗、网络和工业等各个领域扮演着重要的角色。考虑到标签对于检测来说是至关重要但很难获得，我们转而研究带有不精确监督的时间序列异常检测：在训练阶段只提供序列级别的标签，在测试阶段预测出点级别的异常。之前的研究采用传统的多实例学习(MIL)方法，重点是鼓励在各个时间步骤中得到高的异常分数。然而，时间序列的异常不仅限于个别点异常，它们还可以是集体异常，通常在子序列中展示出异常模式。为了应对集体异常的挑战，本文提出了一种基于树的MIL框架(TreeMIL)。我们首先采用一个N叉树结构将整个序列分成多个节点，不同层级的节点表示具有不同长度的子序列。然后，子序列特征被提取来预测节点的异常得分。",
    "tldr": "本文提出了一个基于树的多实例学习框架(TreeMIL)，用于带有不精确监督的时间序列异常检测。该框架通过将整个序列分解成多个节点，并提取子序列特征，旨在解决集体异常的挑战。"
}