{
    "title": "SpecSTG: A Fast Spectral Diffusion Framework for Probabilistic Spatio-Temporal Traffic Forecasting. (arXiv:2401.08119v2 [cs.LG] UPDATED)",
    "abstract": "Traffic forecasting, a crucial application of spatio-temporal graph (STG) learning, has traditionally relied on deterministic models for accurate point estimations. Yet, these models fall short of identifying latent risks of unexpected volatility in future observations. To address this gap, probabilistic methods, especially variants of diffusion models, have emerged as uncertainty-aware solutions. However, existing diffusion methods typically focus on generating separate future time series for individual sensors in the traffic network, resulting in insufficient involvement of spatial network characteristics in the probabilistic learning process. To better leverage spatial dependencies and systematic patterns inherent in traffic data, we propose SpecSTG, a novel spectral diffusion framework. Our method generates the Fourier representation of future time series, transforming the learning process into the spectral domain enriched with spatial information. Additionally, our approach incorp",
    "link": "http://arxiv.org/abs/2401.08119",
    "context": "Title: SpecSTG: A Fast Spectral Diffusion Framework for Probabilistic Spatio-Temporal Traffic Forecasting. (arXiv:2401.08119v2 [cs.LG] UPDATED)\nAbstract: Traffic forecasting, a crucial application of spatio-temporal graph (STG) learning, has traditionally relied on deterministic models for accurate point estimations. Yet, these models fall short of identifying latent risks of unexpected volatility in future observations. To address this gap, probabilistic methods, especially variants of diffusion models, have emerged as uncertainty-aware solutions. However, existing diffusion methods typically focus on generating separate future time series for individual sensors in the traffic network, resulting in insufficient involvement of spatial network characteristics in the probabilistic learning process. To better leverage spatial dependencies and systematic patterns inherent in traffic data, we propose SpecSTG, a novel spectral diffusion framework. Our method generates the Fourier representation of future time series, transforming the learning process into the spectral domain enriched with spatial information. Additionally, our approach incorp",
    "path": "papers/24/01/2401.08119.json",
    "total_tokens": 903,
    "translated_title": "SpecSTG:一种用于概率时空交通预测的快速谱扩散框架",
    "translated_abstract": "交通预测是时空图学习的一个重要应用，传统上依赖确定性模型进行准确的点估计。然而，这些模型无法识别未来观测中意外波动的潜在风险。为了解决这个问题，概率方法，特别是扩散模型的变种，已成为具有不确定性感知的解决方案。然而，现有的扩散方法通常只关注为交通网络中的每个传感器生成单独的未来时间序列，导致空间网络特征在概率学习过程中参与不足。为了更好地利用交通数据中固有的空间依赖性和系统模式，我们提出了一种新颖的谱扩散框架——SpecSTG。我们的方法生成未来时间序列的傅里叶表示，将学习过程转化为充满空间信息的谱域。此外，我们的方法还结合了空间网络特征的影响。",
    "tldr": "我们提出了一种快速谱扩散框架SpecSTG，用于概率时空交通预测。该方法在谱域中生成未来时间序列的傅里叶表示，利用空间信息来更好地利用交通数据中的空间依赖性和系统模式。",
    "en_tdlr": "We propose SpecSTG, a fast spectral diffusion framework, for probabilistic spatio-temporal traffic forecasting. Our method generates the Fourier representation of future time series in the spectral domain enriched with spatial information, leveraging spatial dependencies and systematic patterns in traffic data."
}