{
    "title": "The inherent goodness of well educated intelligence. (arXiv:2401.04846v1 [econ.TH])",
    "abstract": "This paper will examine what makes a being intelligent, whether that be a biological being or an artificial silicon being on a computer. Special attention will be paid to the being having the ability to characterize and control a collective system of many identical conservative sub-systems conservatively interacting. The essence of intelligence will be found to be the golden rule -- \"the collective acts as one\" or \"knowing the global consequences of local actions\". The flow of the collective is a small set of twinkling textures, that are governed by a puppeteer who is pulling a small number of strings according to a geodesic motion of least action, determined by the symmetries. Controlling collective conservative systems is difficult and has historically been done by adding significant viscosity to the system to stabilize the desirable meta stable equilibriums of maximum performance, but it degrades or destroys them in the process. There is an alternative. Once the optimum twinkling te",
    "link": "http://arxiv.org/abs/2401.04846",
    "context": "Title: The inherent goodness of well educated intelligence. (arXiv:2401.04846v1 [econ.TH])\nAbstract: This paper will examine what makes a being intelligent, whether that be a biological being or an artificial silicon being on a computer. Special attention will be paid to the being having the ability to characterize and control a collective system of many identical conservative sub-systems conservatively interacting. The essence of intelligence will be found to be the golden rule -- \"the collective acts as one\" or \"knowing the global consequences of local actions\". The flow of the collective is a small set of twinkling textures, that are governed by a puppeteer who is pulling a small number of strings according to a geodesic motion of least action, determined by the symmetries. Controlling collective conservative systems is difficult and has historically been done by adding significant viscosity to the system to stabilize the desirable meta stable equilibriums of maximum performance, but it degrades or destroys them in the process. There is an alternative. Once the optimum twinkling te",
    "path": "papers/24/01/2401.04846.json",
    "total_tokens": 878,
    "translated_title": "受过良好教育的智能的内在善良",
    "translated_abstract": "本文将探讨使一个智能体变得智能的因素，无论是生物体还是计算机上的人工智能。特别关注的是能够表征和控制多个保守相互作用的相同子系统的能力。智能的本质将被发现是黄金法则——“集体行动如一体”或“了解局部行动的整体结果”。集体的流动是由掌控着少量字符串的操纵者决定的，根据对称性确定的最小作用路径的测地线运动。控制集体保守系统是困难的，历史上一直通过为系统添加显著黏性来稳定期望的最大性能的亚稳平衡状态，但这会在过程中降低或破坏它们。有一种替代方案。",
    "tldr": "本文探讨了智能体变得智能的因素，强调了掌握特征和控制多个保守相互作用的子系统的能力。智能的核心是“集体如一体”和“了解局部行动的整体结果”。文章提出了一种对集体保守系统进行控制的替代方法。",
    "en_tdlr": "This paper examines the factors that make an intelligent being and emphasizes the ability to characterize and control multiple conservative interacting subsystems. The essence of intelligence lies in \"acting collectively as one\" and \"knowing the global consequences of local actions\". It proposes an alternative method for controlling collective conservative systems."
}