{
    "title": "POUR-Net: A Population-Prior-Aided Over-Under-Representation Network for Low-Count PET Attenuation Map Generation. (arXiv:2401.14285v1 [cs.CV])",
    "abstract": "Low-dose PET offers a valuable means of minimizing radiation exposure in PET imaging. However, the prevalent practice of employing additional CT scans for generating attenuation maps (u-map) for PET attenuation correction significantly elevates radiation doses. To address this concern and further mitigate radiation exposure in low-dose PET exams, we propose POUR-Net - an innovative population-prior-aided over-under-representation network that aims for high-quality attenuation map generation from low-dose PET. First, POUR-Net incorporates an over-under-representation network (OUR-Net) to facilitate efficient feature extraction, encompassing both low-resolution abstracted and fine-detail features, for assisting deep generation on the full-resolution level. Second, complementing OUR-Net, a population prior generation machine (PPGM) utilizing a comprehensive CT-derived u-map dataset, provides additional prior information to aid OUR-Net generation. The integration of OUR-Net and PPGM within",
    "link": "http://arxiv.org/abs/2401.14285",
    "context": "Title: POUR-Net: A Population-Prior-Aided Over-Under-Representation Network for Low-Count PET Attenuation Map Generation. (arXiv:2401.14285v1 [cs.CV])\nAbstract: Low-dose PET offers a valuable means of minimizing radiation exposure in PET imaging. However, the prevalent practice of employing additional CT scans for generating attenuation maps (u-map) for PET attenuation correction significantly elevates radiation doses. To address this concern and further mitigate radiation exposure in low-dose PET exams, we propose POUR-Net - an innovative population-prior-aided over-under-representation network that aims for high-quality attenuation map generation from low-dose PET. First, POUR-Net incorporates an over-under-representation network (OUR-Net) to facilitate efficient feature extraction, encompassing both low-resolution abstracted and fine-detail features, for assisting deep generation on the full-resolution level. Second, complementing OUR-Net, a population prior generation machine (PPGM) utilizing a comprehensive CT-derived u-map dataset, provides additional prior information to aid OUR-Net generation. The integration of OUR-Net and PPGM within",
    "path": "papers/24/01/2401.14285.json",
    "total_tokens": 953,
    "translated_title": "POUR-Net:一种基于人群先验的过偏差低计数PET衰减映射生成网络",
    "translated_abstract": "低剂量PET为PET成像中减少辐射暴露提供了一种宝贵的手段。然而，目前通行的使用额外的CT扫描来生成PET衰减映射（u-map）的做法显著提高了辐射剂量。为了解决这个问题并进一步减轻低剂量PET检查中的辐射暴露，我们提出了POUR-Net——一种创新的基于人群先验的过偏差低计数PET衰减映射生成网络。首先，POUR-Net集成了一种过偏差低计数网络（OUR-Net），以促进有效的特征提取，包括低分辨率的抽象特征和细节特征，以辅助全分辨率级别上的深度生成。其次，作为OUR-Net的补充，一个利用全面的CT衍生的u-map数据集的人群先验生成机（PPGM）提供额外的先验信息来辅助OUR-Net的生成。OUR-Net和PPGM的集成在低剂量PET衰减映射生成中提供了更高质量的结果。",
    "tldr": "POUR-Net是一个基于人群先验的过偏差低计数PET衰减映射生成网络，旨在通过有效的特征提取和全面的先验信息来提高低剂量PET的衰减映射质量。"
}