{
    "title": "Beyond the Frame: Single and mutilple video summarization method with user-defined length. (arXiv:2401.10254v1 [cs.CV])",
    "abstract": "Video smmarization is a crucial method to reduce the time of videos which reduces the spent time to watch/review a long video. This apporach has became more important as the amount of publisehed video is increasing everyday. A single or multiple videos can be summarized into a relatively short video using various of techniques from multimodal audio-visual techniques, to natural language processing approaches. Audiovisual techniques may be used to recognize significant visual events and pick the most important parts, while NLP techniques can be used to evaluate the audio transcript and extract the main sentences (timestamps) and corresponding video frames from the original video. Another approach is to use the best of both domain. Meaning that we can use audio-visual cues as well as video transcript to extract and summarize the video. In this paper, we combine a variety of NLP techniques (extractive and contect-based summarizers) with video processing techniques to convert a long video ",
    "link": "http://arxiv.org/abs/2401.10254",
    "context": "Title: Beyond the Frame: Single and mutilple video summarization method with user-defined length. (arXiv:2401.10254v1 [cs.CV])\nAbstract: Video smmarization is a crucial method to reduce the time of videos which reduces the spent time to watch/review a long video. This apporach has became more important as the amount of publisehed video is increasing everyday. A single or multiple videos can be summarized into a relatively short video using various of techniques from multimodal audio-visual techniques, to natural language processing approaches. Audiovisual techniques may be used to recognize significant visual events and pick the most important parts, while NLP techniques can be used to evaluate the audio transcript and extract the main sentences (timestamps) and corresponding video frames from the original video. Another approach is to use the best of both domain. Meaning that we can use audio-visual cues as well as video transcript to extract and summarize the video. In this paper, we combine a variety of NLP techniques (extractive and contect-based summarizers) with video processing techniques to convert a long video ",
    "path": "papers/24/01/2401.10254.json",
    "total_tokens": 832,
    "translated_title": "超越画面：使用用户定义的长度的单个和多个视频摘要方法",
    "translated_abstract": "视频摘要是一种减少视频观看/回顾时间的关键方法。随着发表的视频数量每天都在增加，这种方法变得越来越重要。可以使用多种技术，从多模态音视频技术到自然语言处理方法，将单个或多个视频总结为相对较短的视频。音视频技术可用于识别重要的视觉事件并选择最重要的部分，而NLP技术可用于评估音频转录并从原始视频中提取主要句子（时间戳）和相应的视频帧。另一种方法是同时使用领域中的最佳技术。这意味着我们可以同时使用音视频线索和视频转录来提取和总结视频。在本文中，我们将各种NLP技术（抽取和基于内容的摘要生成器）与视频处理技术相结合，将长视频转换为摘要视频。",
    "tldr": "本文研究了使用多种NLP技术和视频处理技术将长视频转换为摘要视频的方法，以减少观看/回顾视频所需的时间。"
}