{
    "title": "Divergent Characteristics of Biomedical Research across Publication Types: A Quantitative Analysis on the Aging-related Research. (arXiv:2401.04323v1 [cs.DL])",
    "abstract": "This paper investigates differences in characteristics across publication types for aging-related genetic research. We utilized bibliometric data for five model species retrieved from authoritative databases including PubMed. Publications are classified into types according to PubMed. Results indicate substantial divergence across publication types in attention paid to aging-related research, scopes of studied genes, and topical preferences. For instance, comparative studies and meta-analyses show a greater focus on aging than validation studies. Reviews concentrate more on cell biology while clinical studies emphasize translational topics. Publication types also manifest variations in highly studied genes, like APOE for reviews versus GH1 for clinical studies. Despite differences, top genes like insulin are universally emphasized. Publication types demonstrate similar levels of imbalance in research efforts to genes. Differences also exist in bibliometrics like authorship numbers, cit",
    "link": "http://arxiv.org/abs/2401.04323",
    "context": "Title: Divergent Characteristics of Biomedical Research across Publication Types: A Quantitative Analysis on the Aging-related Research. (arXiv:2401.04323v1 [cs.DL])\nAbstract: This paper investigates differences in characteristics across publication types for aging-related genetic research. We utilized bibliometric data for five model species retrieved from authoritative databases including PubMed. Publications are classified into types according to PubMed. Results indicate substantial divergence across publication types in attention paid to aging-related research, scopes of studied genes, and topical preferences. For instance, comparative studies and meta-analyses show a greater focus on aging than validation studies. Reviews concentrate more on cell biology while clinical studies emphasize translational topics. Publication types also manifest variations in highly studied genes, like APOE for reviews versus GH1 for clinical studies. Despite differences, top genes like insulin are universally emphasized. Publication types demonstrate similar levels of imbalance in research efforts to genes. Differences also exist in bibliometrics like authorship numbers, cit",
    "path": "papers/24/01/2401.04323.json",
    "total_tokens": 1048,
    "translated_title": "出版类型对生物医学研究的差异特征：以老龄相关研究为例的定量分析",
    "translated_abstract": "本文研究了老龄相关基因研究中不同出版类型的特征差异。我们利用来自PubMed等权威数据库的五个模型物种的文献计量数据进行了分析。根据PubMed的分类，将文章分为不同的类型。结果表明，不同出版类型在对老龄相关研究的关注度、研究基因的范围和主题偏好上存在显著的差异。例如，比较研究和元分析比验证研究更注重老龄化问题。综述更关注细胞生物学，而临床研究则强调转化性主题。出版类型在高度研究的基因上也表现出差异，例如综述更关注APOE基因，而临床研究更关注GH1基因。尽管存在差异，一些顶级基因如胰岛素普遍受到重视。出版类型在研究基因方面也体现出相似的不平衡水平。在作者数量、引用数量等文献计量方面也存在差异。",
    "tldr": "本研究分析了老龄相关基因研究中不同出版类型的特征差异，发现这些出版类型在对老龄化研究的关注度、研究基因的范围和主题偏好上存在显著差异。尽管存在差异，一些顶级基因如胰岛素普遍受到重视，而且出版类型在研究基因方面也呈现相似的不平衡水平。另外，出版类型还在作者数量、引用数量等方面存在差异。",
    "en_tdlr": "This study analyzes the differences in characteristics across publication types for aging-related genetic research and reveals substantial divergence in attention, gene scope, and topical preferences. Despite these differences, certain top genes like insulin receive universal emphasis, and publication types exhibit similar levels of imbalance in research efforts to genes. Additionally, variations also exist in bibliometrics such as authorship numbers and citation counts."
}