{
    "title": "Tumbug: A pictorial, universal knowledge representation method. (arXiv:2401.09448v1 [cs.AI])",
    "abstract": "Since the key to artificial general intelligence (AGI) is commonly believed to be commonsense reasoning (CSR) or, roughly equivalently, discovery of a knowledge representation method (KRM) that is particularly suitable for CSR, the author developed a custom KRM for CSR. This novel KRM called Tumbug was designed to be pictorial in nature because there exists increasing evidence that the human brain uses some pictorial type of KRM, and no well-known prior research in AGI has researched this KRM possibility. Tumbug is somewhat similar to Roger Schank's Conceptual Dependency (CD) theory, but Tumbug is pictorial and uses about 30 components based on fundamental concepts from the sciences and human life, in contrast to CD theory, which is textual and uses about 17 components (= 6 Primitive Conceptual Categories + 11 Primitive Acts) based mainly on human-oriented activities. All the Building Blocks of Tumbug were found to generalize to only five Basic Building Blocks that exactly correspond t",
    "link": "http://arxiv.org/abs/2401.09448",
    "context": "Title: Tumbug: A pictorial, universal knowledge representation method. (arXiv:2401.09448v1 [cs.AI])\nAbstract: Since the key to artificial general intelligence (AGI) is commonly believed to be commonsense reasoning (CSR) or, roughly equivalently, discovery of a knowledge representation method (KRM) that is particularly suitable for CSR, the author developed a custom KRM for CSR. This novel KRM called Tumbug was designed to be pictorial in nature because there exists increasing evidence that the human brain uses some pictorial type of KRM, and no well-known prior research in AGI has researched this KRM possibility. Tumbug is somewhat similar to Roger Schank's Conceptual Dependency (CD) theory, but Tumbug is pictorial and uses about 30 components based on fundamental concepts from the sciences and human life, in contrast to CD theory, which is textual and uses about 17 components (= 6 Primitive Conceptual Categories + 11 Primitive Acts) based mainly on human-oriented activities. All the Building Blocks of Tumbug were found to generalize to only five Basic Building Blocks that exactly correspond t",
    "path": "papers/24/01/2401.09448.json",
    "total_tokens": 926,
    "translated_title": "Tumbug:一种图像化的通用知识表达方法",
    "translated_abstract": "鉴于人工通用智能(AGI)的关键被普遍认为是常识推理(CSR)，或者粗略地说就是发现一种特别适用于CSR的知识表示方法(KRM)，作者开发了一种自定义的CSR KRM。这种新颖的KRM称为Tumbug，其设计为图像化，因为越来越多的证据表明人脑使用了某种图像化类型的KRM，而在AGI领域中没有知名的研究探索了这种KRM可能性。Tumbug与Roger Schank的概念依存理论(CD)有些相似，但Tumbug是图像化的，并使用了大约30个基于科学和人类生活的基本概念的组件，而CD理论是文本型的，并使用了大约17个基于人类导向活动的组件(= 6个原始概念类别+ 11个原始行为)。所有Tumbug的构建块都被发现能够推广到仅有的五个基本构建块，这些构建块与真实世界中对应的内容完全一致。",
    "tldr": "Tumbug是一种图像化的通用知识表达方法，专门用于常识推理，通过使用约30个基于科学和人类生活的基本概念组件，将其与以往的概念依存理论进行区分。"
}