{
    "title": "Multi-Agent Based Transfer Learning for Data-Driven Air Traffic Applications. (arXiv:2401.14421v1 [cs.LG])",
    "abstract": "Research in developing data-driven models for Air Traffic Management (ATM) has gained a tremendous interest in recent years. However, data-driven models are known to have long training time and require large datasets to achieve good performance. To address the two issues, this paper proposes a Multi-Agent Bidirectional Encoder Representations from Transformers (MA-BERT) model that fully considers the multi-agent characteristic of the ATM system and learns air traffic controllers' decisions, and a pre-training and fine-tuning transfer learning framework. By pre-training the MA-BERT on a large dataset from a major airport and then fine-tuning it to other airports and specific air traffic applications, a large amount of the total training time can be saved. In addition, for newly adopted procedures and constructed airports where no historical data is available, this paper shows that the pre-trained MA-BERT can achieve high performance by updating regularly with little data. The proposed t",
    "link": "http://arxiv.org/abs/2401.14421",
    "context": "Title: Multi-Agent Based Transfer Learning for Data-Driven Air Traffic Applications. (arXiv:2401.14421v1 [cs.LG])\nAbstract: Research in developing data-driven models for Air Traffic Management (ATM) has gained a tremendous interest in recent years. However, data-driven models are known to have long training time and require large datasets to achieve good performance. To address the two issues, this paper proposes a Multi-Agent Bidirectional Encoder Representations from Transformers (MA-BERT) model that fully considers the multi-agent characteristic of the ATM system and learns air traffic controllers' decisions, and a pre-training and fine-tuning transfer learning framework. By pre-training the MA-BERT on a large dataset from a major airport and then fine-tuning it to other airports and specific air traffic applications, a large amount of the total training time can be saved. In addition, for newly adopted procedures and constructed airports where no historical data is available, this paper shows that the pre-trained MA-BERT can achieve high performance by updating regularly with little data. The proposed t",
    "path": "papers/24/01/2401.14421.json",
    "total_tokens": 888,
    "translated_title": "多智能体基于迁移学习的数据驱动空中交通应用",
    "translated_abstract": "近年来，开发空中交通管理(ATM)的数据驱动模型的研究引起了巨大的兴趣。然而，众所周知，数据驱动模型具有较长的训练时间，并且需要大量的数据集才能达到良好的性能。为了解决这两个问题，本文提出了一种全面考虑ATM系统多智能体特性的Multi-Agent Bidirectional Encoder Representations from Transformers (MA-BERT)模型，并采用预训练和微调迁移学习框架。通过将MA-BERT在一个主要机场的大规模数据集上进行预训练，并在其他机场和特定空中交通应用上进行微调，可以节省大量的总训练时间。此外，对于新采用的程序和建立的机场，没有历史数据可用，本文展示了预训练的MA-BERT可以通过少量数据的定期更新实现高性能。",
    "tldr": "本文提出了一种基于多智能体的迁移学习方法，利用MA-BERT模型和预训练微调框架来解决空中交通管理中的长训练时间和大数据集需求的问题。该方法可以在具有少量数据或无历史数据的情况下实现高性能。"
}