{
    "title": "Uncertainty quantification for probabilistic machine learning in earth observation using conformal prediction. (arXiv:2401.06421v1 [cs.LG])",
    "abstract": "Unreliable predictions can occur when using artificial intelligence (AI) systems with negative consequences for downstream applications, particularly when employed for decision-making. Conformal prediction provides a model-agnostic framework for uncertainty quantification that can be applied to any dataset, irrespective of its distribution, post hoc. In contrast to other pixel-level uncertainty quantification methods, conformal prediction operates without requiring access to the underlying model and training dataset, concurrently offering statistically valid and informative prediction regions, all while maintaining computational efficiency. In response to the increased need to report uncertainty alongside point predictions, we bring attention to the promise of conformal prediction within the domain of Earth Observation (EO) applications. To accomplish this, we assess the current state of uncertainty quantification in the EO domain and found that only 20% of the reviewed Google Earth En",
    "link": "http://arxiv.org/abs/2401.06421",
    "context": "Title: Uncertainty quantification for probabilistic machine learning in earth observation using conformal prediction. (arXiv:2401.06421v1 [cs.LG])\nAbstract: Unreliable predictions can occur when using artificial intelligence (AI) systems with negative consequences for downstream applications, particularly when employed for decision-making. Conformal prediction provides a model-agnostic framework for uncertainty quantification that can be applied to any dataset, irrespective of its distribution, post hoc. In contrast to other pixel-level uncertainty quantification methods, conformal prediction operates without requiring access to the underlying model and training dataset, concurrently offering statistically valid and informative prediction regions, all while maintaining computational efficiency. In response to the increased need to report uncertainty alongside point predictions, we bring attention to the promise of conformal prediction within the domain of Earth Observation (EO) applications. To accomplish this, we assess the current state of uncertainty quantification in the EO domain and found that only 20% of the reviewed Google Earth En",
    "path": "papers/24/01/2401.06421.json",
    "total_tokens": 737,
    "translated_title": "使用符合预测的不确定性量化的地球观测概率机器学习",
    "translated_abstract": "当使用人工智能系统进行决策时，不可靠的预测可能会导致负面后果。符合预测提供了一个与模型无关的不确定性量化框架，可以应用于任何数据集，无论其分布如何。与其他像素级的不确定性量化方法不同，符合预测不需要访问底层模型和训练数据集，并同时提供统计上有效和有信息的预测区域，同时保持计算效率。",
    "tldr": "本论文介绍了地球观测领域中使用符合预测进行不确定性量化的方法。与其他方法不同，符合预测不需要访问底层模型和训练数据集，并同时提供统计上有效和有信息的预测区域，同时保持计算效率。",
    "en_tdlr": "This paper introduces a method for uncertainty quantification in earth observation using conformal prediction. Unlike other methods, conformal prediction does not require access to the underlying model and training dataset, while providing statistically valid and informative prediction regions, while maintaining computational efficiency."
}