{
    "title": "A Framework for Agricultural Food Supply Chain using Blockchain. (arXiv:2401.09476v1 [cs.CR])",
    "abstract": "The main aim of the paper is to create a trust and transparency in the food supply chain system, ensuring food safety for everyone with the help of Blockchain Technology. Food supply chain is the process of tracing a crop from the farmer or producer to the buyer. With the advent of blockchain, providing a safe and fraud-free environment for the provision of numerous agricultural necessities has become much easier. Because of the globalization of trade, the present supply chain market today includes various companies involving integration of data, complex transactions and distribution. Information tamper resistance, supply-demand relationships, and traceable oversight are all difficulties that arise as a result of this. Blockchain is a distributed ledger technology that can provide information that is resistant to tampering. This strategy can eliminate the need for a centralized trusted authority, intermediaries, and business histories, allowing for increased production and security whi",
    "link": "http://arxiv.org/abs/2401.09476",
    "context": "Title: A Framework for Agricultural Food Supply Chain using Blockchain. (arXiv:2401.09476v1 [cs.CR])\nAbstract: The main aim of the paper is to create a trust and transparency in the food supply chain system, ensuring food safety for everyone with the help of Blockchain Technology. Food supply chain is the process of tracing a crop from the farmer or producer to the buyer. With the advent of blockchain, providing a safe and fraud-free environment for the provision of numerous agricultural necessities has become much easier. Because of the globalization of trade, the present supply chain market today includes various companies involving integration of data, complex transactions and distribution. Information tamper resistance, supply-demand relationships, and traceable oversight are all difficulties that arise as a result of this. Blockchain is a distributed ledger technology that can provide information that is resistant to tampering. This strategy can eliminate the need for a centralized trusted authority, intermediaries, and business histories, allowing for increased production and security whi",
    "path": "papers/24/01/2401.09476.json",
    "total_tokens": 790,
    "translated_title": "使用区块链的农业食品供应链框架",
    "translated_abstract": "本文的主要目标是通过使用区块链技术在食品供应链系统中建立信任和透明度，确保每个人的食品安全。食品供应链是从农民或生产者到买家的农作物追踪过程。随着区块链的出现，为提供各种农业必需品的安全和无欺诈环境已变得更加容易。目前的供应链市场包括涉及数据集成、复杂交易和分销的各种企业，由于贸易全球化所带来。信息防篡改、供需关系和可追溯监督是由此产生的困难。区块链是一种分布式账本技术，可以提供抗篡改的信息。这种策略可以消除对集中的信任机构、中介和业务历史的需求，从而实现增加生产和安全性的目标。",
    "tldr": "本文提出了一个使用区块链的农业食品供应链框架，旨在通过建立信任和透明度确保食品供应链的安全性，并解决信息防篡改和供需关系等困难。"
}