{
    "title": "The Why, When, and How to Use Active Learning in Large-Data-Driven 3D Object Detection for Safe Autonomous Driving: An Empirical Exploration. (arXiv:2401.16634v1 [cs.CV])",
    "abstract": "Active learning strategies for 3D object detection in autonomous driving datasets may help to address challenges of data imbalance, redundancy, and high-dimensional data. We demonstrate the effectiveness of entropy querying to select informative samples, aiming to reduce annotation costs and improve model performance. We experiment using the BEVFusion model for 3D object detection on the nuScenes dataset, comparing active learning to random sampling and demonstrating that entropy querying outperforms in most cases. The method is particularly effective in reducing the performance gap between majority and minority classes. Class-specific analysis reveals efficient allocation of annotated resources for limited data budgets, emphasizing the importance of selecting diverse and informative data for model training. Our findings suggest that entropy querying is a promising strategy for selecting data that enhances model learning in resource-constrained environments.",
    "link": "http://arxiv.org/abs/2401.16634",
    "context": "Title: The Why, When, and How to Use Active Learning in Large-Data-Driven 3D Object Detection for Safe Autonomous Driving: An Empirical Exploration. (arXiv:2401.16634v1 [cs.CV])\nAbstract: Active learning strategies for 3D object detection in autonomous driving datasets may help to address challenges of data imbalance, redundancy, and high-dimensional data. We demonstrate the effectiveness of entropy querying to select informative samples, aiming to reduce annotation costs and improve model performance. We experiment using the BEVFusion model for 3D object detection on the nuScenes dataset, comparing active learning to random sampling and demonstrating that entropy querying outperforms in most cases. The method is particularly effective in reducing the performance gap between majority and minority classes. Class-specific analysis reveals efficient allocation of annotated resources for limited data budgets, emphasizing the importance of selecting diverse and informative data for model training. Our findings suggest that entropy querying is a promising strategy for selecting data that enhances model learning in resource-constrained environments.",
    "path": "papers/24/01/2401.16634.json",
    "total_tokens": 994,
    "translated_title": "在以大数据为驱动的自主驾驶中使用主动学习进行3D物体检测：一个实证探究",
    "translated_abstract": "在自主驾驶数据集中，使用主动学习策略进行3D物体检测可以解决数据不平衡、冗余和高维数据等挑战。我们通过使用熵查询来选择信息样本，旨在降低标注成本并提高模型性能。我们使用BEVFusion模型在nuScenes数据集上进行实验，将主动学习与随机采样进行比较，并证明熵查询在大多数情况下表现优异。该方法在减少多数类和少数类之间的性能差距方面特别有效。类别特定分析揭示了资源有限的情况下，为模型训练分配注释资源的高效方法，强调了选择多样且信息丰富的数据对模型训练的重要性。我们的研究结果表明，熵查询是在资源有限的环境中选择增强模型学习的数据的一种有前景的策略。",
    "tldr": "本研究探究了在自主驾驶数据集中使用主动学习进行3D物体检测的方法。通过使用熵查询选择信息样本，可以降低标注成本并提高模型性能，特别是在减少多数类和少数类之间的性能差距方面表现优异。研究结果表明，选择多样且信息丰富的数据对于模型训练至关重要，而熵查询是在资源有限的环境中选择增强模型学习的数据的一种有前景的策略。"
}