{
    "title": "Homophily-Related: Adaptive Hybrid Graph Filter for Multi-View Graph Clustering. (arXiv:2401.02682v1 [cs.LG])",
    "abstract": "Recently there is a growing focus on graph data, and multi-view graph clustering has become a popular area of research interest. Most of the existing methods are only applicable to homophilous graphs, yet the extensive real-world graph data can hardly fulfill the homophily assumption, where the connected nodes tend to belong to the same class. Several studies have pointed out that the poor performance on heterophilous graphs is actually due to the fact that conventional graph neural networks (GNNs), which are essentially low-pass filters, discard information other than the low-frequency information on the graph. Nevertheless, on certain graphs, particularly heterophilous ones, neglecting high-frequency information and focusing solely on low-frequency information impedes the learning of node representations. To break this limitation, our motivation is to perform graph filtering that is closely related to the homophily degree of the given graph, with the aim of fully leveraging both low-",
    "link": "http://arxiv.org/abs/2401.02682",
    "context": "Title: Homophily-Related: Adaptive Hybrid Graph Filter for Multi-View Graph Clustering. (arXiv:2401.02682v1 [cs.LG])\nAbstract: Recently there is a growing focus on graph data, and multi-view graph clustering has become a popular area of research interest. Most of the existing methods are only applicable to homophilous graphs, yet the extensive real-world graph data can hardly fulfill the homophily assumption, where the connected nodes tend to belong to the same class. Several studies have pointed out that the poor performance on heterophilous graphs is actually due to the fact that conventional graph neural networks (GNNs), which are essentially low-pass filters, discard information other than the low-frequency information on the graph. Nevertheless, on certain graphs, particularly heterophilous ones, neglecting high-frequency information and focusing solely on low-frequency information impedes the learning of node representations. To break this limitation, our motivation is to perform graph filtering that is closely related to the homophily degree of the given graph, with the aim of fully leveraging both low-",
    "path": "papers/24/01/2401.02682.json",
    "total_tokens": 950,
    "translated_title": "同质性相关：自适应混合图过滤器用于多视图图聚类",
    "translated_abstract": "最近对图数据的关注越来越多，多视图图聚类成为研究的热点领域。大部分现有方法仅适用于同质性图，然而广泛存在的现实世界图数据很难满足同质性假设，即连接的节点倾向于属于同一个类。一些研究指出，在异质性图上表现不佳实际上是因为传统的图神经网络（GNNs），本质上是低通滤波器，丢弃了除图上低频信息之外的其他信息。然而，在某些图上，特别是异质性图上，忽略高频信息，只关注低频信息阻碍了节点表示的学习。为了突破这一限制，我们的动机是进行与给定图的同质性程度密切相关的图过滤，旨在充分利用低频和高频信息来学习节点表示。",
    "tldr": "该论文提出了一个自适应混合图过滤器用于多视图图聚类。现有方法仅适用于同质性图，而该研究针对广泛存在的异质性图提出了一个解决方案。通过与图的同质性程度密切相关的图过滤，该方法可以充分利用低频和高频信息来学习节点表示。",
    "en_tdlr": "This paper proposes an adaptive hybrid graph filter for multi-view graph clustering. Existing methods are only applicable to homophilous graphs, while this research provides a solution for the widely existing heterophilous graphs. By performing graph filtering closely related to the homophily degree of the graph, this method can leverage both low-frequency and high-frequency information to learn the node representations."
}