{
    "title": "The Radiation Oncology NLP Database. (arXiv:2401.10995v1 [cs.CL])",
    "abstract": "We present the Radiation Oncology NLP Database (ROND), the first dedicated Natural Language Processing (NLP) dataset for radiation oncology, an important medical specialty that has received limited attention from the NLP community in the past. With the advent of Artificial General Intelligence (AGI), there is an increasing need for specialized datasets and benchmarks to facilitate research and development. ROND is specifically designed to address this gap in the domain of radiation oncology, a field that offers many opportunities for NLP exploration. It encompasses various NLP tasks including Logic Reasoning, Text Classification, Named Entity Recognition (NER), Question Answering (QA), Text Summarization, and Patient-Clinician Conversations, each with a distinct focus on radiation oncology concepts and application cases. In addition, we have developed an instruction-tuning dataset consisting of over 20k instruction pairs (based on ROND) and trained a large language model, CancerChat. T",
    "link": "http://arxiv.org/abs/2401.10995",
    "context": "Title: The Radiation Oncology NLP Database. (arXiv:2401.10995v1 [cs.CL])\nAbstract: We present the Radiation Oncology NLP Database (ROND), the first dedicated Natural Language Processing (NLP) dataset for radiation oncology, an important medical specialty that has received limited attention from the NLP community in the past. With the advent of Artificial General Intelligence (AGI), there is an increasing need for specialized datasets and benchmarks to facilitate research and development. ROND is specifically designed to address this gap in the domain of radiation oncology, a field that offers many opportunities for NLP exploration. It encompasses various NLP tasks including Logic Reasoning, Text Classification, Named Entity Recognition (NER), Question Answering (QA), Text Summarization, and Patient-Clinician Conversations, each with a distinct focus on radiation oncology concepts and application cases. In addition, we have developed an instruction-tuning dataset consisting of over 20k instruction pairs (based on ROND) and trained a large language model, CancerChat. T",
    "path": "papers/24/01/2401.10995.json",
    "total_tokens": 942,
    "translated_title": "放射肿瘤学自然语言处理数据库",
    "translated_abstract": "我们介绍了放射肿瘤学自然语言处理数据库（ROND），这是第一个专门针对放射肿瘤学的自然语言处理数据集。放射肿瘤学是一门重要的医学专业，但在过去受到自然语言处理社区的关注有限。随着人工通用智能（AGI）的出现，需要专门的数据集和基准来促进研究和发展。ROND专门针对放射肿瘤学领域中的空白进行设计，这个领域为自然语言处理的探索提供了许多机会。它涵盖了各种自然语言处理任务，包括逻辑推理、文本分类、命名实体识别（NER）、问题回答（QA）、文本摘要和患者-临床医生对话，每个任务都着重放射肿瘤学概念和应用案例。此外，我们还采用ROND开发了一个包含20k多个指令对的数据集，并训练了一个大型语言模型CancerChat。",
    "tldr": "放射肿瘤学自然语言处理数据库（ROND）是第一个专门针对放射肿瘤学的自然语言处理数据集，其中包含了逻辑推理、文本分类、命名实体识别等多个任务，并且还开发了一个指令对数据集和相应的语言模型CancerChat。"
}