{
    "title": "Multi-objective Feature Selection in Remote Health Monitoring Applications. (arXiv:2401.05538v1 [cs.LG])",
    "abstract": "Radio frequency (RF) signals have facilitated the development of non-contact human monitoring tasks, such as vital signs measurement, activity recognition, and user identification. In some specific scenarios, an RF signal analysis framework may prioritize the performance of one task over that of others. In response to this requirement, we employ a multi-objective optimization approach inspired by biological principles to select discriminative features that enhance the accuracy of breathing patterns recognition while simultaneously impeding the identification of individual users. This approach is validated using a novel vital signs dataset consisting of 50 subjects engaged in four distinct breathing patterns. Our findings indicate a remarkable result: a substantial divergence in accuracy between breathing recognition and user identification. As a complementary viewpoint, we present a contrariwise result to maximize user identification accuracy and minimize the system's capacity for brea",
    "link": "http://arxiv.org/abs/2401.05538",
    "context": "Title: Multi-objective Feature Selection in Remote Health Monitoring Applications. (arXiv:2401.05538v1 [cs.LG])\nAbstract: Radio frequency (RF) signals have facilitated the development of non-contact human monitoring tasks, such as vital signs measurement, activity recognition, and user identification. In some specific scenarios, an RF signal analysis framework may prioritize the performance of one task over that of others. In response to this requirement, we employ a multi-objective optimization approach inspired by biological principles to select discriminative features that enhance the accuracy of breathing patterns recognition while simultaneously impeding the identification of individual users. This approach is validated using a novel vital signs dataset consisting of 50 subjects engaged in four distinct breathing patterns. Our findings indicate a remarkable result: a substantial divergence in accuracy between breathing recognition and user identification. As a complementary viewpoint, we present a contrariwise result to maximize user identification accuracy and minimize the system's capacity for brea",
    "path": "papers/24/01/2401.05538.json",
    "total_tokens": 863,
    "translated_title": "远程健康监测应用中的多目标特征选择",
    "translated_abstract": "无线电频率（RF）信号促进了非接触式人体监测任务的发展，如生命体征测量、活动识别和用户识别。在某些特定场景中，RF信号分析框架可能会将一项任务的性能优先于其他任务。为了满足这一要求，我们采用了受生物学原理启发的多目标优化方法，选择增强呼吸模式识别准确性的有区别性特征，同时阻碍个体用户的识别。我们使用了一个包含50名参与四种不同呼吸模式的新颖生命体征数据集来验证我们的方法。我们的研究结果显示：呼吸识别准确性与用户识别之间存在显著差异。作为一个补充观点，我们还提出了一个相反的结果，即最大化用户识别准确性并最大限度地减少系统对呼吸模式的容忍。",
    "tldr": "本研究提出了一种基于多目标优化的特征选择方法，以增强呼吸模式识别准确性并阻碍个体用户的识别。研究结果表明呼吸识别和用户识别的准确性之间存在显著差异。",
    "en_tdlr": "This paper proposes a multi-objective feature selection method to enhance the accuracy of breathing pattern recognition and impede individual user identification. The research findings indicate a significant divergence in accuracy between breathing recognition and user identification."
}