{
    "title": "Novel Representation Learning Technique using Graphs for Performance Analytics. (arXiv:2401.10799v1 [cs.LG])",
    "abstract": "The performance analytics domain in High Performance Computing (HPC) uses tabular data to solve regression problems, such as predicting the execution time. Existing Machine Learning (ML) techniques leverage the correlations among features given tabular datasets, not leveraging the relationships between samples directly. Moreover, since high-quality embeddings from raw features improve the fidelity of the downstream predictive models, existing methods rely on extensive feature engineering and pre-processing steps, costing time and manual effort. To fill these two gaps, we propose a novel idea of transforming tabular performance data into graphs to leverage the advancement of Graph Neural Network-based (GNN) techniques in capturing complex relationships between features and samples. In contrast to other ML application domains, such as social networks, the graph is not given; instead, we need to build it. To address this gap, we propose graph-building methods where nodes represent samples",
    "link": "http://arxiv.org/abs/2401.10799",
    "context": "Title: Novel Representation Learning Technique using Graphs for Performance Analytics. (arXiv:2401.10799v1 [cs.LG])\nAbstract: The performance analytics domain in High Performance Computing (HPC) uses tabular data to solve regression problems, such as predicting the execution time. Existing Machine Learning (ML) techniques leverage the correlations among features given tabular datasets, not leveraging the relationships between samples directly. Moreover, since high-quality embeddings from raw features improve the fidelity of the downstream predictive models, existing methods rely on extensive feature engineering and pre-processing steps, costing time and manual effort. To fill these two gaps, we propose a novel idea of transforming tabular performance data into graphs to leverage the advancement of Graph Neural Network-based (GNN) techniques in capturing complex relationships between features and samples. In contrast to other ML application domains, such as social networks, the graph is not given; instead, we need to build it. To address this gap, we propose graph-building methods where nodes represent samples",
    "path": "papers/24/01/2401.10799.json",
    "total_tokens": 928,
    "translated_title": "使用图形的新型表示学习技术用于性能分析",
    "translated_abstract": "高性能计算（HPC）中的性能分析领域使用表格数据来解决回归问题，例如预测执行时间。现有的机器学习（ML）技术利用给定表格数据集中的特征之间的相关性，而不是直接利用样本之间的关系。此外，由于从原始特征中获得高质量的嵌入可以提高下游预测模型的准确性，现有方法依赖于广泛的特征工程和预处理步骤，耗费时间和人工努力。为了填补这两个差距，我们提出了一种新颖的想法，将表格性能数据转化为图形，以利用基于图神经网络（GNN）技术在捕捉特征和样本之间复杂关系方面的进展。与其他应用领域（例如社交网络）不同，图形是不存在的；相反，我们需要构建它。为了弥补这一差距，我们提出了构建图形的方法，其中节点代表样本。",
    "tldr": "该论文提出了一种使用图形来表示学习的新技术，该技术能够解决高性能计算中的性能分析问题。通过将表格性能数据转化为图形，并利用图神经网络技术来捕捉样本之间的复杂关系，实现了不依赖于特征工程和预处理步骤的迁移学习。",
    "en_tdlr": "This paper presents a novel technique for representation learning using graphs, specifically designed for performance analytics in high-performance computing. It transforms tabular performance data into graphs and leverages graph neural network techniques to capture complex relationships between samples, eliminating the need for extensive feature engineering and preprocessing steps."
}