{
    "title": "Expected Shapley-Like Scores of Boolean Functions: Complexity and Applications to Probabilistic Databases. (arXiv:2401.06493v1 [cs.DB])",
    "abstract": "Shapley values, originating in game theory and increasingly prominent in explainable AI, have been proposed to assess the contribution of facts in query answering over databases, along with other similar power indices such as Banzhaf values. In this work we adapt these Shapley-like scores to probabilistic settings, the objective being to compute their expected value. We show that the computations of expected Shapley values and of the expected values of Boolean functions are interreducible in polynomial time, thus obtaining the same tractability landscape. We investigate the specific tractable case where Boolean functions are represented as deterministic decomposable circuits, designing a polynomial-time algorithm for this setting. We present applications to probabilistic databases through database provenance, and an effective implementation of this algorithm within the ProvSQL system, which experimentally validates its feasibility over a standard benchmark.",
    "link": "http://arxiv.org/abs/2401.06493",
    "context": "Title: Expected Shapley-Like Scores of Boolean Functions: Complexity and Applications to Probabilistic Databases. (arXiv:2401.06493v1 [cs.DB])\nAbstract: Shapley values, originating in game theory and increasingly prominent in explainable AI, have been proposed to assess the contribution of facts in query answering over databases, along with other similar power indices such as Banzhaf values. In this work we adapt these Shapley-like scores to probabilistic settings, the objective being to compute their expected value. We show that the computations of expected Shapley values and of the expected values of Boolean functions are interreducible in polynomial time, thus obtaining the same tractability landscape. We investigate the specific tractable case where Boolean functions are represented as deterministic decomposable circuits, designing a polynomial-time algorithm for this setting. We present applications to probabilistic databases through database provenance, and an effective implementation of this algorithm within the ProvSQL system, which experimentally validates its feasibility over a standard benchmark.",
    "path": "papers/24/01/2401.06493.json",
    "total_tokens": 809,
    "translated_title": "预期的类Shapley分数: 复杂性与在概率数据库中的应用",
    "translated_abstract": "Shapley值是源自博弈论并在可解释的人工智能中越来越重要的方法，用于评估数据库中事实对查询回答的贡献，以及其他类似的权重指标，如Banzhaf值。在这项工作中，我们将这些类Shapley分数适应到概率环境中，目标是计算它们的期望值。我们证明了预期Shapley值和布尔函数的期望值的计算在多项式时间内相互可归约，从而获得相同的可处理性。我们探究了布尔函数被表示为确定性可分解电路的可处理情况，在该情况下设计了一个多项式时间的算法。我们通过数据库来源解释在概率数据库中应用这个算法，并在ProvSQL系统中实现了一个有效的实现，实验证明了它在标准基准测试中的可行性。",
    "tldr": "这篇论文提出了一种适应概率环境的类Shapley分数，用于评估数据库中事实对查询回答的贡献。通过研究布尔函数的可处理情况，设计了一个多项式时间的算法，并在概率数据库中应用该算法。"
}