{
    "title": "BioFinBERT: Finetuning Large Language Models (LLMs) to Analyze Sentiment of Press Releases and Financial Text Around Inflection Points of Biotech Stocks. (arXiv:2401.11011v1 [q-fin.GN])",
    "abstract": "Large language models (LLMs) are deep learning algorithms being used to perform natural language processing tasks in various fields, from social sciences to finance and biomedical sciences. Developing and training a new LLM can be very computationally expensive, so it is becoming a common practice to take existing LLMs and finetune them with carefully curated datasets for desired applications in different fields. Here, we present BioFinBERT, a finetuned LLM to perform financial sentiment analysis of public text associated with stocks of companies in the biotechnology sector. The stocks of biotech companies developing highly innovative and risky therapeutic drugs tend to respond very positively or negatively upon a successful or failed clinical readout or regulatory approval of their drug, respectively. These clinical or regulatory results are disclosed by the biotech companies via press releases, which are followed by a significant stock response in many cases. In our attempt to design",
    "link": "http://arxiv.org/abs/2401.11011",
    "context": "Title: BioFinBERT: Finetuning Large Language Models (LLMs) to Analyze Sentiment of Press Releases and Financial Text Around Inflection Points of Biotech Stocks. (arXiv:2401.11011v1 [q-fin.GN])\nAbstract: Large language models (LLMs) are deep learning algorithms being used to perform natural language processing tasks in various fields, from social sciences to finance and biomedical sciences. Developing and training a new LLM can be very computationally expensive, so it is becoming a common practice to take existing LLMs and finetune them with carefully curated datasets for desired applications in different fields. Here, we present BioFinBERT, a finetuned LLM to perform financial sentiment analysis of public text associated with stocks of companies in the biotechnology sector. The stocks of biotech companies developing highly innovative and risky therapeutic drugs tend to respond very positively or negatively upon a successful or failed clinical readout or regulatory approval of their drug, respectively. These clinical or regulatory results are disclosed by the biotech companies via press releases, which are followed by a significant stock response in many cases. In our attempt to design",
    "path": "papers/24/01/2401.11011.json",
    "total_tokens": 891,
    "translated_title": "BioFinBERT：对大型语言模型（LLM）进行微调以分析生物科技公司股票拐点期间的新闻稿和金融文本的情感(arXiv:2401.11011v1 [q-fin.GN])",
    "translated_abstract": "大型语言模型（LLMs）是深度学习算法，用于在各个领域中进行自然语言处理任务，从社会科学到金融和生物医学科学。开发和训练一个新的LLM可能非常耗费计算资源，因此，将现有的LLM与经过精心策划的数据集进行微调，以适用于不同领域的应用，正在成为一种常见做法。这里我们介绍了BioFinBERT，一个经过微调的LLM，用于对生物技术行业公司股票相关的公开文本进行金融情感分析。发展具有高度创新性和风险性的治疗药物的生物技术公司的股票往往在其药物的成功或失败临床结果或监管批准公布后产生非常积极或消极的反应。这些临床或监管结果是通过新闻稿披露的，往往在很多情况下引起了股票的大幅波动。",
    "tldr": "BioFinBERT是一个经过微调的大型语言模型，用于分析生物科技股票在临床结果和监管批准公布期间的公告和金融文本的情感。"
}