{
    "title": "Interactions between dynamic team composition and coordination: An agent-based modeling approach. (arXiv:2401.05832v1 [econ.GN])",
    "abstract": "This paper examines the interactions between selected coordination modes and dynamic team composition, and their joint effects on task performance under different task complexity and individual learning conditions. Prior research often treats dynamic team composition as a consequence of suboptimal organizational design choices. The emergence of new organizational forms that consciously employ teams that change their composition periodically challenges this perspective. In this paper, we follow the contingency theory and characterize dynamic team composition as a design choice that interacts with other choices such as the coordination mode, and with additional contextual factors such as individual learning and task complexity. We employ an agent-based modeling approach based on the NK framework, which includes a reinforcement learning mechanism, a recurring team formation mechanism based on signaling, and three different coordination modes. Our results suggest that by implementing later",
    "link": "http://arxiv.org/abs/2401.05832",
    "context": "Title: Interactions between dynamic team composition and coordination: An agent-based modeling approach. (arXiv:2401.05832v1 [econ.GN])\nAbstract: This paper examines the interactions between selected coordination modes and dynamic team composition, and their joint effects on task performance under different task complexity and individual learning conditions. Prior research often treats dynamic team composition as a consequence of suboptimal organizational design choices. The emergence of new organizational forms that consciously employ teams that change their composition periodically challenges this perspective. In this paper, we follow the contingency theory and characterize dynamic team composition as a design choice that interacts with other choices such as the coordination mode, and with additional contextual factors such as individual learning and task complexity. We employ an agent-based modeling approach based on the NK framework, which includes a reinforcement learning mechanism, a recurring team formation mechanism based on signaling, and three different coordination modes. Our results suggest that by implementing later",
    "path": "papers/24/01/2401.05832.json",
    "total_tokens": 821,
    "translated_title": "动态团队构成与协调之间的相互作用：基于Agent-Based建模方法的研究",
    "translated_abstract": "本文研究了协调模式和动态团队构成之间的相互作用，并探讨了它们在不同任务复杂性和个体学习条件下对任务绩效的联合影响。以往的研究通常将动态团队构成视为次优组织设计选择的结果。而现今意识到周期性更改团队构成的新型组织形式对此观点提出了挑战。在本文中，我们按照因果理论将动态团队构成视为一种设计选择，它与其他选择（如协调模式）以及个体学习和任务复杂性等上下文因素相互作用。我们采用基于NK框架的Agent-Based建模方法，包括强化学习机制、基于信号的循环团队形成机制以及三种不同的协调模式。我们的结果表明通过实施....",
    "tldr": "本文通过Agent-Based建模方法研究了协调模式和动态团队构成的相互作用，以及它们在不同任务复杂性和个体学习条件下对任务绩效的联合影响。"
}