{
    "title": "Parameter-Efficient Conversational Recommender System as a Language Processing Task. (arXiv:2401.14194v1 [cs.CL])",
    "abstract": "Conversational recommender systems (CRS) aim to recommend relevant items to users by eliciting user preference through natural language conversation. Prior work often utilizes external knowledge graphs for items' semantic information, a language model for dialogue generation, and a recommendation module for ranking relevant items. This combination of multiple components suffers from a cumbersome training process, and leads to semantic misalignment issues between dialogue generation and item recommendation. In this paper, we represent items in natural language and formulate CRS as a natural language processing task. Accordingly, we leverage the power of pre-trained language models to encode items, understand user intent via conversation, perform item recommendation through semantic matching, and generate dialogues. As a unified model, our PECRS (Parameter-Efficient CRS), can be optimized in a single stage, without relying on non-textual metadata such as a knowledge graph. Experiments on",
    "link": "http://arxiv.org/abs/2401.14194",
    "context": "Title: Parameter-Efficient Conversational Recommender System as a Language Processing Task. (arXiv:2401.14194v1 [cs.CL])\nAbstract: Conversational recommender systems (CRS) aim to recommend relevant items to users by eliciting user preference through natural language conversation. Prior work often utilizes external knowledge graphs for items' semantic information, a language model for dialogue generation, and a recommendation module for ranking relevant items. This combination of multiple components suffers from a cumbersome training process, and leads to semantic misalignment issues between dialogue generation and item recommendation. In this paper, we represent items in natural language and formulate CRS as a natural language processing task. Accordingly, we leverage the power of pre-trained language models to encode items, understand user intent via conversation, perform item recommendation through semantic matching, and generate dialogues. As a unified model, our PECRS (Parameter-Efficient CRS), can be optimized in a single stage, without relying on non-textual metadata such as a knowledge graph. Experiments on",
    "path": "papers/24/01/2401.14194.json",
    "total_tokens": 850,
    "translated_title": "作为一种语言处理任务的参数高效的对话推荐系统",
    "translated_abstract": "对话式推荐系统旨在通过自然语言对话来向用户推荐相关的项目。之前的工作通常利用外部知识图谱来提供项目的语义信息，利用语言模型进行对话生成，以及利用推荐模块进行相关项目的排序。这种多组件的组合导致训练过程繁琐，并且导致对话生成和项目推荐之间的语义不配对问题。在本文中，我们使用自然语言表示项目，并将对话式推荐系统作为一种自然语言处理任务进行建模。因此，我们利用预训练的语言模型来编码项目，在对话中理解用户意图，通过语义匹配进行项目推荐，并生成对话。作为一个统一的模型，我们的PECRS（参数高效的对话推荐系统）可以在单个阶段进行优化，而不依赖非文本元数据，如知识图谱。实验证明了我们方法的有效性。",
    "tldr": "本文将对话推荐系统作为一种语言处理任务进行建模，利用预训练的语言模型来编码项目、理解用户意图，通过语义匹配进行项目推荐，并生成对话。实验证明了该方法的有效性。"
}