{
    "title": "An Exploratory Assessment of LLM's Potential Toward Flight Trajectory Reconstruction Analysis. (arXiv:2401.06204v1 [cs.LG])",
    "abstract": "Large Language Models (LLMs) hold transformative potential in aviation, particularly in reconstructing flight trajectories. This paper investigates this potential, grounded in the notion that LLMs excel at processing sequential data and deciphering complex data structures. Utilizing the LLaMA 2 model, a pre-trained open-source LLM, the study focuses on reconstructing flight trajectories using Automatic Dependent Surveillance-Broadcast (ADS-B) data with irregularities inherent in real-world scenarios. The findings demonstrate the model's proficiency in filtering noise and estimating both linear and curved flight trajectories. However, the analysis also reveals challenges in managing longer data sequences, which may be attributed to the token length limitations of LLM models. The study's insights underscore the promise of LLMs in flight trajectory reconstruction and open new avenues for their broader application across the aviation and transportation sectors.",
    "link": "http://arxiv.org/abs/2401.06204",
    "context": "Title: An Exploratory Assessment of LLM's Potential Toward Flight Trajectory Reconstruction Analysis. (arXiv:2401.06204v1 [cs.LG])\nAbstract: Large Language Models (LLMs) hold transformative potential in aviation, particularly in reconstructing flight trajectories. This paper investigates this potential, grounded in the notion that LLMs excel at processing sequential data and deciphering complex data structures. Utilizing the LLaMA 2 model, a pre-trained open-source LLM, the study focuses on reconstructing flight trajectories using Automatic Dependent Surveillance-Broadcast (ADS-B) data with irregularities inherent in real-world scenarios. The findings demonstrate the model's proficiency in filtering noise and estimating both linear and curved flight trajectories. However, the analysis also reveals challenges in managing longer data sequences, which may be attributed to the token length limitations of LLM models. The study's insights underscore the promise of LLMs in flight trajectory reconstruction and open new avenues for their broader application across the aviation and transportation sectors.",
    "path": "papers/24/01/2401.06204.json",
    "total_tokens": 1022,
    "translated_title": "对LLM在飞行轨迹重建分析中潜力的探索性评估",
    "translated_abstract": "大型语言模型（LLMs）在航空领域，特别是在重建飞行轨迹方面具有革命性潜力。本文研究了这一潜力，基于LLMs在处理序列数据和解读复杂数据结构方面的优势。利用预先训练的开源LLM模型LLaMA 2，本研究着重于使用自动相关监视广播（ADS-B）数据重建飞行轨迹，该数据具有真实世界场景中的不规则性。研究结果表明该模型能够有效地过滤噪音，并估计出线性和曲线型飞行轨迹。然而，分析同时也揭示了在处理较长数据序列方面存在的挑战，这可能归因于LLM模型的标记长度限制。研究的发现突显了LLMs在飞行轨迹重建中的潜力，并为其在航空和交通领域的广泛应用开辟了新的途径。",
    "tldr": "本研究探索了大型语言模型（LLMs）在航空领域中重建飞行轨迹的潜力，并通过使用ADS-B数据对LLaMA 2模型进行实证研究，发现LLMs在过滤噪音和估计飞行轨迹方面表现出色。然而，研究也揭示了处理较长数据序列的挑战，该挑战可能源于LLM模型的标记长度限制。这些研究结果强调了LLMs在航空和交通领域广泛应用的潜力。",
    "en_tdlr": "This study explores the potential of Large Language Models (LLMs) in reconstructing flight trajectories in aviation. Utilizing the LLaMA 2 model, the study demonstrates the proficiency of LLMs in filtering noise and estimating flight trajectories, while also highlighting challenges in managing longer data sequences. The findings underscore the promise of LLMs in aviation and transportation sectors."
}