{
    "title": "Multi-Modal Cognitive Maps based on Neural Networks trained on Successor Representations. (arXiv:2401.01364v1 [q-bio.NC])",
    "abstract": "Cognitive maps are a proposed concept on how the brain efficiently organizes memories and retrieves context out of them. The entorhinal-hippocampal complex is heavily involved in episodic and relational memory processing, as well as spatial navigation and is thought to built cognitive maps via place and grid cells. To make use of the promising properties of cognitive maps, we set up a multi-modal neural network using successor representations which is able to model place cell dynamics and cognitive map representations. Here, we use multi-modal inputs consisting of images and word embeddings. The network learns the similarities between novel inputs and the training database and therefore the representation of the cognitive map successfully. Subsequently, the prediction of the network can be used to infer from one modality to another with over $90\\%$ accuracy. The proposed method could therefore be a building block to improve current AI systems for better understanding of the environment",
    "link": "http://arxiv.org/abs/2401.01364",
    "context": "Title: Multi-Modal Cognitive Maps based on Neural Networks trained on Successor Representations. (arXiv:2401.01364v1 [q-bio.NC])\nAbstract: Cognitive maps are a proposed concept on how the brain efficiently organizes memories and retrieves context out of them. The entorhinal-hippocampal complex is heavily involved in episodic and relational memory processing, as well as spatial navigation and is thought to built cognitive maps via place and grid cells. To make use of the promising properties of cognitive maps, we set up a multi-modal neural network using successor representations which is able to model place cell dynamics and cognitive map representations. Here, we use multi-modal inputs consisting of images and word embeddings. The network learns the similarities between novel inputs and the training database and therefore the representation of the cognitive map successfully. Subsequently, the prediction of the network can be used to infer from one modality to another with over $90\\%$ accuracy. The proposed method could therefore be a building block to improve current AI systems for better understanding of the environment",
    "path": "papers/24/01/2401.01364.json",
    "total_tokens": 927,
    "translated_title": "基于神经网络和后继表示训练的多模态认知地图",
    "translated_abstract": "认知地图是关于大脑如何有效地组织记忆和提取上下文的一个提议概念。内隐-海马复合体在情节和关系记忆处理以及空间导航中起着重要作用，并被认为通过位置细胞和网格细胞建立认知地图。为了利用认知地图的有希望的特性，我们使用后继表示建立了一个多模态神经网络，能够模拟位置细胞动态和认知地图表示。在这里，我们使用由图像和词嵌入组成的多模态输入。网络学习了新输入与训练数据库之间的相似性，从而成功建立了认知地图的表示。随后，网络的预测可以以超过90%的准确率从一种形式推断到另一种形式。所提出的方法可能成为改进当前人工智能系统以更好理解环境的基石。",
    "tldr": "该研究通过使用神经网络和后继表示训练，建立了一个能够模拟位置细胞动态和认知地图表示的多模态认知地图模型。该模型能够以超过90%的准确率从一种形式推断到另一种形式，对于改善当前人工智能系统对环境的理解具有潜在意义。",
    "en_tdlr": "This paper presents a multi-modal cognitive map model that utilizes neural networks trained on successor representations to simulate the dynamics of place cells and cognitive map representations. With over 90% accuracy, the model can infer from one modality to another, which has the potential to improve current AI systems' understanding of the environment."
}