{
    "title": "RawECGNet: Deep Learning Generalization for Atrial Fibrillation Detection from the Raw ECG. (arXiv:2401.05411v1 [eess.SP])",
    "abstract": "Introduction: Deep learning models for detecting episodes of atrial fibrillation (AF) using rhythm information in long-term, ambulatory ECG recordings have shown high performance. However, the rhythm-based approach does not take advantage of the morphological information conveyed by the different ECG waveforms, particularly the f-waves. As a result, the performance of such models may be inherently limited. Methods: To address this limitation, we have developed a deep learning model, named RawECGNet, to detect episodes of AF and atrial flutter (AFl) using the raw, single-lead ECG. We compare the generalization performance of RawECGNet on two external data sets that account for distribution shifts in geography, ethnicity, and lead position. RawECGNet is further benchmarked against a state-of-the-art deep learning model, named ArNet2, which utilizes rhythm information as input. Results: Using RawECGNet, the results for the different leads in the external test sets in terms of the F1 score",
    "link": "http://arxiv.org/abs/2401.05411",
    "context": "Title: RawECGNet: Deep Learning Generalization for Atrial Fibrillation Detection from the Raw ECG. (arXiv:2401.05411v1 [eess.SP])\nAbstract: Introduction: Deep learning models for detecting episodes of atrial fibrillation (AF) using rhythm information in long-term, ambulatory ECG recordings have shown high performance. However, the rhythm-based approach does not take advantage of the morphological information conveyed by the different ECG waveforms, particularly the f-waves. As a result, the performance of such models may be inherently limited. Methods: To address this limitation, we have developed a deep learning model, named RawECGNet, to detect episodes of AF and atrial flutter (AFl) using the raw, single-lead ECG. We compare the generalization performance of RawECGNet on two external data sets that account for distribution shifts in geography, ethnicity, and lead position. RawECGNet is further benchmarked against a state-of-the-art deep learning model, named ArNet2, which utilizes rhythm information as input. Results: Using RawECGNet, the results for the different leads in the external test sets in terms of the F1 score",
    "path": "papers/24/01/2401.05411.json",
    "total_tokens": 942,
    "translated_title": "RawECGNet: 从原始心电图中进行房颤检测的深度学习泛化",
    "translated_abstract": "引言：利用长期、无创的心电图记录进行房颤（AF）的检测的深度学习模型表现出很高的性能。然而，基于节律的方法没有充分利用不同心电波形所传递的形态学信息，特别是f波。因此，这种模型的性能可能受到固有限制。方法：为了解决这个限制，我们开发了一个名为RawECGNet的深度学习模型，使用原始、单导联的心电图来检测房颤和心房扑动（AFl）的发作。我们比较了RawECGNet在两个外部数据集上的泛化性能，这些数据集考虑了地理、种族和导联位置的分布变化。RawECGNet还与一种名为ArNet2的最先进的深度学习模型进行了基准测试，该模型利用节律信息作为输入。结果：使用RawECGNet，在外部测试集中各个导联的F1得分如下",
    "tldr": "我们开发了一个名为RawECGNet的深度学习模型，使用原始的单导联心电图来检测房颤和心房扑动的发作。与基于节律的方法相比，RawECGNet利用了更多的形态学信息，表现出更好的性能。",
    "en_tdlr": "We developed a deep learning model called RawECGNet to detect episodes of atrial fibrillation and atrial flutter using raw, single-lead ECG. Compared to rhythm-based approaches, RawECGNet utilizes more morphological information and achieves better performance."
}