{
    "title": "TypeDance: Creating Semantic Typographic Logos from Image through Personalized Generation. (arXiv:2401.11094v1 [cs.AI])",
    "abstract": "Semantic typographic logos harmoniously blend typeface and imagery to represent semantic concepts while maintaining legibility. Conventional methods using spatial composition and shape substitution are hindered by the conflicting requirement for achieving seamless spatial fusion between geometrically dissimilar typefaces and semantics. While recent advances made AI generation of semantic typography possible, the end-to-end approaches exclude designer involvement and disregard personalized design. This paper presents TypeDance, an AI-assisted tool incorporating design rationales with the generative model for personalized semantic typographic logo design. It leverages combinable design priors extracted from uploaded image exemplars and supports type-imagery mapping at various structural granularity, achieving diverse aesthetic designs with flexible control. Additionally, we instantiate a comprehensive design workflow in TypeDance, including ideation, selection, generation, evaluation, an",
    "link": "http://arxiv.org/abs/2401.11094",
    "context": "Title: TypeDance: Creating Semantic Typographic Logos from Image through Personalized Generation. (arXiv:2401.11094v1 [cs.AI])\nAbstract: Semantic typographic logos harmoniously blend typeface and imagery to represent semantic concepts while maintaining legibility. Conventional methods using spatial composition and shape substitution are hindered by the conflicting requirement for achieving seamless spatial fusion between geometrically dissimilar typefaces and semantics. While recent advances made AI generation of semantic typography possible, the end-to-end approaches exclude designer involvement and disregard personalized design. This paper presents TypeDance, an AI-assisted tool incorporating design rationales with the generative model for personalized semantic typographic logo design. It leverages combinable design priors extracted from uploaded image exemplars and supports type-imagery mapping at various structural granularity, achieving diverse aesthetic designs with flexible control. Additionally, we instantiate a comprehensive design workflow in TypeDance, including ideation, selection, generation, evaluation, an",
    "path": "papers/24/01/2401.11094.json",
    "total_tokens": 915,
    "translated_title": "TypeDance: 通过个性化生成从图像中创建语义排版的标志",
    "translated_abstract": "语义排版的标志将字体和图像融为一体，以代表语义概念，同时保持可读性。传统的方法使用空间组合和形状替换受到几何形状不同的字体和语义之间无缝融合需求的限制。虽然最近的进展使得人工智能生成语义排版成为可能，但端到端的方法排除了设计师的参与，并忽视了个性化设计。本文介绍了一种名为TypeDance的AI辅助工具，它将设计理念与生成模型相结合，用于个性化语义排版标志设计。它利用从上传的图像实例中提取的可组合的设计先验知识，并支持在不同的结构粒度上进行字体-图像映射，实现多样化的美学设计，并具有灵活的控制。此外，我们在TypeDance中实例化了一个全面的设计工作流程，包括构思、选择、生成、评估等。",
    "tldr": "本论文介绍了一种名为TypeDance的AI辅助工具，通过结合设计理念与生成模型，实现了个性化语义排版标志设计。它利用从上传的图像实例中提取的设计先验知识，支持不同结构粒度上的字体-图像映射，达到多样化的美学设计和灵活的控制。",
    "en_tdlr": "This paper presents TypeDance, an AI-assisted tool that combines design rationales with generative models to achieve personalized semantic typographic logo design. It leverages design priors extracted from uploaded image exemplars, supports type-imagery mapping at various structural granularity, and enables diverse aesthetic designs with flexible control."
}