{
    "title": "Locality enhanced dynamic biasing and sampling strategies for contextual ASR. (arXiv:2401.13146v1 [eess.AS])",
    "abstract": "Automatic Speech Recognition (ASR) still face challenges when recognizing time-variant rare-phrases. Contextual biasing (CB) modules bias ASR model towards such contextually-relevant phrases. During training, a list of biasing phrases are selected from a large pool of phrases following a sampling strategy. In this work we firstly analyse different sampling strategies to provide insights into the training of CB for ASR with correlation plots between the bias embeddings among various training stages. Secondly, we introduce a neighbourhood attention (NA) that localizes self attention (SA) to the nearest neighbouring frames to further refine the CB output. The results show that this proposed approach provides on average a 25.84% relative WER improvement on LibriSpeech sets and rare-word evaluation compared to the baseline.",
    "link": "http://arxiv.org/abs/2401.13146",
    "context": "Title: Locality enhanced dynamic biasing and sampling strategies for contextual ASR. (arXiv:2401.13146v1 [eess.AS])\nAbstract: Automatic Speech Recognition (ASR) still face challenges when recognizing time-variant rare-phrases. Contextual biasing (CB) modules bias ASR model towards such contextually-relevant phrases. During training, a list of biasing phrases are selected from a large pool of phrases following a sampling strategy. In this work we firstly analyse different sampling strategies to provide insights into the training of CB for ASR with correlation plots between the bias embeddings among various training stages. Secondly, we introduce a neighbourhood attention (NA) that localizes self attention (SA) to the nearest neighbouring frames to further refine the CB output. The results show that this proposed approach provides on average a 25.84% relative WER improvement on LibriSpeech sets and rare-word evaluation compared to the baseline.",
    "path": "papers/24/01/2401.13146.json",
    "total_tokens": 865,
    "translated_title": "在上下文ASR中增强的本地偏置和采样策略",
    "translated_abstract": "自动语音识别（ASR）在识别时间变化的稀有短语时仍然面临挑战。上下文偏置（CB）模块可以将ASR模型偏向于与上下文相关的短语。在训练过程中，根据一种采样策略从大量短语中选择一组偏置短语。本文首先分析了不同的采样策略，通过相关性图表揭示了CB在不同训练阶段之间的偏置嵌入关系。其次，我们引入了邻域注意力（NA），将自注意力（SA）局部化到最近的相邻帧，进一步改进CB的输出结果。结果显示，与基准相比，该方法在LibriSpeech数据集和稀有词评估上平均相对词错误率（WER）改善了25.84%。",
    "tldr": "本文研究了上下文ASR中增强的本地偏置和采样策略，通过分析不同的采样策略并引入邻域注意力（NA），相对于基准模型，在LibriSpeech数据集和稀有词评估上平均相对词错误率（WER）改善了25.84%。",
    "en_tdlr": "This paper investigates enhanced local biasing and sampling strategies in contextual ASR. By analyzing different sampling strategies and introducing neighborhood attention (NA), the proposed approach achieves an average 25.84% relative word error rate (WER) improvement on LibriSpeech sets and rare-word evaluation compared to the baseline."
}