{
    "title": "DOO-RE: A dataset of ambient sensors in a meeting room for activity recognition. (arXiv:2401.08962v1 [cs.HC])",
    "abstract": "With the advancement of IoT technology, recognizing user activities with machine learning methods is a promising way to provide various smart services to users. High-quality data with privacy protection is essential for deploying such services in the real world. Data streams from surrounding ambient sensors are well suited to the requirement. Existing ambient sensor datasets only support constrained private spaces and those for public spaces have yet to be explored despite growing interest in research on them. To meet this need, we build a dataset collected from a meeting room equipped with ambient sensors. The dataset, DOO-RE, includes data streams from various ambient sensor types such as Sound and Projector. Each sensor data stream is segmented into activity units and multiple annotators provide activity labels through a cross-validation annotation process to improve annotation quality. We finally obtain 9 types of activities. To our best knowledge, DOO-RE is the first dataset to su",
    "link": "http://arxiv.org/abs/2401.08962",
    "context": "Title: DOO-RE: A dataset of ambient sensors in a meeting room for activity recognition. (arXiv:2401.08962v1 [cs.HC])\nAbstract: With the advancement of IoT technology, recognizing user activities with machine learning methods is a promising way to provide various smart services to users. High-quality data with privacy protection is essential for deploying such services in the real world. Data streams from surrounding ambient sensors are well suited to the requirement. Existing ambient sensor datasets only support constrained private spaces and those for public spaces have yet to be explored despite growing interest in research on them. To meet this need, we build a dataset collected from a meeting room equipped with ambient sensors. The dataset, DOO-RE, includes data streams from various ambient sensor types such as Sound and Projector. Each sensor data stream is segmented into activity units and multiple annotators provide activity labels through a cross-validation annotation process to improve annotation quality. We finally obtain 9 types of activities. To our best knowledge, DOO-RE is the first dataset to su",
    "path": "papers/24/01/2401.08962.json",
    "total_tokens": 914,
    "translated_title": "DOO-RE: 一个会议室环境传感器数据集用于活动识别",
    "translated_abstract": "随着物联网技术的进步，利用机器学习方法识别用户活动是提供各种智能服务给用户的一种有前景的方式。在真实世界中部署这样的服务需要具备质量高且具有隐私保护的数据。周围环境传感器的数据流非常适合这个需求。目前存在的环境传感器数据集只支持受限的私人空间，对于公共空间的数据集尚未被探索，尽管对此类研究越来越感兴趣。为了满足这一需求，我们构建了一个从装有环境传感器的会议室中收集的数据集，名为DOO-RE。该数据集包括来自各种环境传感器类型(如声音和投影仪)的数据流。每个传感器数据流都被划分为活动单元，并通过交叉验证注释过程，多个注释者提供了活动标签以提高注释质量。最终我们得到了9种类型的活动。据我们所知，DOO-RE是第一个支持公共空间的数据集。",
    "tldr": "DOO-RE是一个来自会议室环境传感器的数据集，用于活动识别。该数据集包含了来自不同类型环境传感器的数据流，通过交叉验证注释过程获得了9种活动类型的标签。"
}