{
    "title": "Using Motion Forecasting for Behavior-Based Virtual Reality (VR) Authentication. (arXiv:2401.16649v1 [cs.LG])",
    "abstract": "Task-based behavioral biometric authentication of users interacting in virtual reality (VR) environments enables seamless continuous authentication by using only the motion trajectories of the person's body as a unique signature. Deep learning-based approaches for behavioral biometrics show high accuracy when using complete or near complete portions of the user trajectory, but show lower performance when using smaller segments from the start of the task. Thus, any systems designed with existing techniques are vulnerable while waiting for future segments of motion trajectories to become available. In this work, we present the first approach that predicts future user behavior using Transformer-based forecasting and using the forecasted trajectory to perform user authentication. Our work leverages the notion that given the current trajectory of a user in a task-based environment we can predict the future trajectory of the user as they are unlikely to dramatically shift their behavior sinc",
    "link": "http://arxiv.org/abs/2401.16649",
    "context": "Title: Using Motion Forecasting for Behavior-Based Virtual Reality (VR) Authentication. (arXiv:2401.16649v1 [cs.LG])\nAbstract: Task-based behavioral biometric authentication of users interacting in virtual reality (VR) environments enables seamless continuous authentication by using only the motion trajectories of the person's body as a unique signature. Deep learning-based approaches for behavioral biometrics show high accuracy when using complete or near complete portions of the user trajectory, but show lower performance when using smaller segments from the start of the task. Thus, any systems designed with existing techniques are vulnerable while waiting for future segments of motion trajectories to become available. In this work, we present the first approach that predicts future user behavior using Transformer-based forecasting and using the forecasted trajectory to perform user authentication. Our work leverages the notion that given the current trajectory of a user in a task-based environment we can predict the future trajectory of the user as they are unlikely to dramatically shift their behavior sinc",
    "path": "papers/24/01/2401.16649.json",
    "total_tokens": 853,
    "translated_title": "利用动作预测进行基于行为的虚拟现实（VR）认证",
    "translated_abstract": "在虚拟现实（VR）环境中，基于任务的行为生物特征认证可以通过仅使用人体的运动轨迹作为唯一签名实现无缝连续认证。基于深度学习的行为生物特征认证方法在使用完整或接近完整的用户轨迹时表现出较高的准确性，但在使用任务开始时的较小段落时表现较差。因此，使用现有技术设计的任何系统在等待未来的运动轨迹段可用时都存在漏洞。在这项工作中，我们提出了一种利用基于Transformer的预测方法来预测未来用户行为，并使用预测的轨迹进行用户认证。我们的工作利用了这样的观点：在任务环境中，根据用户当前的轨迹，我们可以预测用户的未来轨迹，因为他们不太可能在行为上发生剧变。",
    "tldr": "本研究提出了一种利用动作预测进行基于行为的虚拟现实认证的方法，通过预测用户的未来行为轨迹并进行认证，解决了现有技术在使用较小轨迹段时的性能下降问题。",
    "en_tdlr": "This study proposes a method for behavior-based virtual reality authentication using motion forecasting, which predicts future user behavior and performs authentication based on the predicted trajectory, addressing the performance degradation issue when using smaller trajectory segments in existing techniques."
}