{
    "title": "Inverting estimating equations for causal inference on quantiles. (arXiv:2401.00987v1 [stat.ME])",
    "abstract": "The causal inference literature frequently focuses on estimating the mean of the potential outcome, whereas the quantiles of the potential outcome may carry important additional information. We propose a universal approach, based on the inverse estimating equations, to generalize a wide class of causal inference solutions from estimating the mean of the potential outcome to its quantiles. We assume that an identifying moment function is available to identify the mean of the threshold-transformed potential outcome, based on which a convenient construction of the estimating equation of quantiles of potential outcome is proposed. In addition, we also give a general construction of the efficient influence functions of the mean and quantiles of potential outcomes, and identify their connection. We motivate estimators for the quantile estimands with the efficient influence function, and develop their asymptotic properties when either parametric models or data-adaptive machine learners are us",
    "link": "http://arxiv.org/abs/2401.00987",
    "context": "Title: Inverting estimating equations for causal inference on quantiles. (arXiv:2401.00987v1 [stat.ME])\nAbstract: The causal inference literature frequently focuses on estimating the mean of the potential outcome, whereas the quantiles of the potential outcome may carry important additional information. We propose a universal approach, based on the inverse estimating equations, to generalize a wide class of causal inference solutions from estimating the mean of the potential outcome to its quantiles. We assume that an identifying moment function is available to identify the mean of the threshold-transformed potential outcome, based on which a convenient construction of the estimating equation of quantiles of potential outcome is proposed. In addition, we also give a general construction of the efficient influence functions of the mean and quantiles of potential outcomes, and identify their connection. We motivate estimators for the quantile estimands with the efficient influence function, and develop their asymptotic properties when either parametric models or data-adaptive machine learners are us",
    "path": "papers/24/01/2401.00987.json",
    "total_tokens": 843,
    "translated_title": "反转估计方程对潜在结果分位数的因果推断",
    "translated_abstract": "因果推断文献经常关注潜在结果的均值估计，而潜在结果的分位数可能包含重要的额外信息。我们提出了一种基于反转估计方程的通用方法，将从估计潜在结果均值的广泛类别的因果推断解决方案推广到其分位数。我们假设存在一个可用来确定基于阈值变换的潜在结果均值的确定矩函数，并在此基础上提出了潜在结果分位数的估计方程的便利构造。此外，我们还给出了潜在结果均值和分位数的有效影响函数的一般构造，并确定了它们之间的联系。我们通过有效影响函数推导出分位数目标的估计器，并在使用参数模型或数据自适应机器学习方法时开发其渐近性质。",
    "tldr": "本文提出了一种基于反转估计方程的通用方法，将从估计潜在结果均值的因果推断解决方案推广到其分位数，同时给出了潜在结果均值和分位数的有效影响函数的一般构造和联系。",
    "en_tdlr": "This paper proposes a universal approach based on inverse estimating equations to generalize causal inference solutions from estimating the mean to quantiles of the potential outcome. It also provides a general construction of efficient influence functions and their connection for both mean and quantiles of potential outcomes."
}