{
    "title": "Location Aware Modular Biencoder for Tourism Question Answering. (arXiv:2401.02187v1 [cs.CL])",
    "abstract": "Answering real-world tourism questions that seek Point-of-Interest (POI) recommendations is challenging, as it requires both spatial and non-spatial reasoning, over a large candidate pool. The traditional method of encoding each pair of question and POI becomes inefficient when the number of candidates increases, making it infeasible for real-world applications. To overcome this, we propose treating the QA task as a dense vector retrieval problem, where we encode questions and POIs separately and retrieve the most relevant POIs for a question by utilizing embedding space similarity. We use pretrained language models (PLMs) to encode textual information, and train a location encoder to capture spatial information of POIs. Experiments on a real-world tourism QA dataset demonstrate that our approach is effective, efficient, and outperforms previous methods across all metrics. Enabled by the dense retrieval architecture, we further build a global evaluation baseline, expanding the search s",
    "link": "http://arxiv.org/abs/2401.02187",
    "context": "Title: Location Aware Modular Biencoder for Tourism Question Answering. (arXiv:2401.02187v1 [cs.CL])\nAbstract: Answering real-world tourism questions that seek Point-of-Interest (POI) recommendations is challenging, as it requires both spatial and non-spatial reasoning, over a large candidate pool. The traditional method of encoding each pair of question and POI becomes inefficient when the number of candidates increases, making it infeasible for real-world applications. To overcome this, we propose treating the QA task as a dense vector retrieval problem, where we encode questions and POIs separately and retrieve the most relevant POIs for a question by utilizing embedding space similarity. We use pretrained language models (PLMs) to encode textual information, and train a location encoder to capture spatial information of POIs. Experiments on a real-world tourism QA dataset demonstrate that our approach is effective, efficient, and outperforms previous methods across all metrics. Enabled by the dense retrieval architecture, we further build a global evaluation baseline, expanding the search s",
    "path": "papers/24/01/2401.02187.json",
    "total_tokens": 891,
    "translated_title": "旅游问答的位置感知模块化双编码器",
    "translated_abstract": "回答寻找兴趣点（POI）推荐的真实世界旅游问题是具有挑战性的，因为它需要对大量候选项进行空间和非空间推理。当候选项数量增加时，传统的对每对问题和POI进行编码的方法效率降低，使得在现实世界的应用中不可行。为了解决这个问题，我们将QA任务视为一个稠密向量检索问题，其中我们分别对问题和POI进行编码，并通过利用嵌入空间相似性为问题检索最相关的POI。我们使用预训练的语言模型（PLMs）来编码文本信息，并训练一个位置编码器来捕捉POI的空间信息。对真实世界的旅游QA数据集的实验表明，我们的方法在所有指标上都是有效、高效的，并且优于之前的方法。借助稠密检索架构的支持，我们进一步建立了一个全球评估基准，扩展了搜索",
    "tldr": "提出了一种位置感知模块化双编码器来回答真实世界旅游问题，通过利用嵌入空间相似性，将QA任务视为稠密向量检索问题。实验证明该方法在所有指标上都有效、高效，并且优于之前的方法。",
    "en_tdlr": "A location aware modular biencoder is proposed for answering real-world tourism questions, treating the QA task as a dense vector retrieval problem. The approach utilizes embedding space similarity and demonstrates effectiveness, efficiency, and outperforms previous methods across all metrics."
}