{
    "title": "Finite-Time Decoupled Convergence in Nonlinear Two-Time-Scale Stochastic Approximation. (arXiv:2401.03893v1 [math.OC])",
    "abstract": "In two-time-scale stochastic approximation (SA), two iterates are updated at varying speeds using different step sizes, with each update influencing the other. Previous studies in linear two-time-scale SA have found that the convergence rates of the mean-square errors for these updates are dependent solely on their respective step sizes, leading to what is referred to as decoupled convergence. However, the possibility of achieving this decoupled convergence in nonlinear SA remains less understood. Our research explores the potential for finite-time decoupled convergence in nonlinear two-time-scale SA. We find that under a weaker Lipschitz condition, traditional analyses are insufficient for achieving decoupled convergence. This finding is further numerically supported by a counterexample. But by introducing an additional condition of nested local linearity, we show that decoupled convergence is still feasible, contingent on the appropriate choice of step sizes associated with smoothnes",
    "link": "http://arxiv.org/abs/2401.03893",
    "context": "Title: Finite-Time Decoupled Convergence in Nonlinear Two-Time-Scale Stochastic Approximation. (arXiv:2401.03893v1 [math.OC])\nAbstract: In two-time-scale stochastic approximation (SA), two iterates are updated at varying speeds using different step sizes, with each update influencing the other. Previous studies in linear two-time-scale SA have found that the convergence rates of the mean-square errors for these updates are dependent solely on their respective step sizes, leading to what is referred to as decoupled convergence. However, the possibility of achieving this decoupled convergence in nonlinear SA remains less understood. Our research explores the potential for finite-time decoupled convergence in nonlinear two-time-scale SA. We find that under a weaker Lipschitz condition, traditional analyses are insufficient for achieving decoupled convergence. This finding is further numerically supported by a counterexample. But by introducing an additional condition of nested local linearity, we show that decoupled convergence is still feasible, contingent on the appropriate choice of step sizes associated with smoothnes",
    "path": "papers/24/01/2401.03893.json",
    "total_tokens": 871,
    "translated_title": "非线性双时间尺度随机逼近中的有限时间解耦收敛",
    "translated_abstract": "在双时间尺度随机逼近中，使用不同的步长以不同的速度更新两个迭代，每次更新都会影响另一个。先前的线性双时间尺度随机逼近研究发现，这些更新的均方误差的收敛速度仅仅取决于它们各自的步长，导致了所谓的解耦收敛。然而，在非线性随机逼近中实现这种解耦收敛的可能性仍不明确。我们的研究探讨了非线性双时间尺度随机逼近中有限时间解耦收敛的潜力。我们发现，在较弱的Lipschitz条件下，传统分析无法实现解耦收敛。这一发现在数值上得到了进一步的支持。但是通过引入一个嵌套局部线性条件，我们证明了在适当选择与平滑度相关的步长的情况下，解耦收敛仍然是可行的。",
    "tldr": "本研究探讨了非线性双时间尺度随机逼近中有限时间解耦收敛的潜力，并通过引入嵌套局部线性条件证明了其可行性。",
    "en_tdlr": "This research investigates the potential of achieving finite-time decoupled convergence in nonlinear two-time-scale stochastic approximation, and demonstrates its feasibility by introducing a nested local linearity condition."
}