{
    "title": "Using Natural Language Inference to Improve Persona Extraction from Dialogue in a New Domain. (arXiv:2401.06742v1 [cs.CL])",
    "abstract": "While valuable datasets such as PersonaChat provide a foundation for training persona-grounded dialogue agents, they lack diversity in conversational and narrative settings, primarily existing in the \"real\" world. To develop dialogue agents with unique personas, models are trained to converse given a specific persona, but hand-crafting these persona can be time-consuming, thus methods exist to automatically extract persona information from existing character-specific dialogue. However, these persona-extraction models are also trained on datasets derived from PersonaChat and struggle to provide high-quality persona information from conversational settings that do not take place in the real world, such as the fantasy-focused dataset, LIGHT. Creating new data to train models on a specific setting is human-intensive, thus prohibitively expensive. To address both these issues, we introduce a natural language inference method for post-hoc adapting a trained persona extraction model to a new ",
    "link": "http://arxiv.org/abs/2401.06742",
    "context": "Title: Using Natural Language Inference to Improve Persona Extraction from Dialogue in a New Domain. (arXiv:2401.06742v1 [cs.CL])\nAbstract: While valuable datasets such as PersonaChat provide a foundation for training persona-grounded dialogue agents, they lack diversity in conversational and narrative settings, primarily existing in the \"real\" world. To develop dialogue agents with unique personas, models are trained to converse given a specific persona, but hand-crafting these persona can be time-consuming, thus methods exist to automatically extract persona information from existing character-specific dialogue. However, these persona-extraction models are also trained on datasets derived from PersonaChat and struggle to provide high-quality persona information from conversational settings that do not take place in the real world, such as the fantasy-focused dataset, LIGHT. Creating new data to train models on a specific setting is human-intensive, thus prohibitively expensive. To address both these issues, we introduce a natural language inference method for post-hoc adapting a trained persona extraction model to a new ",
    "path": "papers/24/01/2401.06742.json",
    "total_tokens": 885,
    "translated_title": "使用自然语言推理来改进对话中的角色提取在新领域中的应用",
    "translated_abstract": "虽然宝贵的数据集如PersonaChat为训练有基于角色的对话代理提供了基础，但它们在对话和叙事环境的多样性方面缺乏，主要存在于“真实”世界中。为了开发具有独特角色的对话代理，模型被训练以在给定特定角色的情况下进行对话，但手工制作这些角色可能耗时，因此存在从现有特定角色对话中自动提取角色信息的方法。然而，这些角色提取模型也是在从PersonaChat衍生的数据集上进行训练，并且很难从非真实世界的对话设置中提供高质量的角色信息，例如以幻想为主题的数据集LIGHT。创建新数据以训练特定设置的模型是人力密集型的，因此代价过高。为了解决这两个问题，我们引入了一种自然语言推理方法，以后期调整已训练的角色提取模型适应新的设置",
    "tldr": "本研究通过使用自然语言推理方法，提出了一种后期适应已训练的角色提取模型到新领域中的方法，以解决对话中角色提取的多样性和非真实世界设置的问题。",
    "en_tdlr": "This study proposes a method for post-hoc adapting a trained persona extraction model to a new domain using natural language inference, addressing the issues of diversity in persona extraction from dialogue and non-real world settings."
}