{
    "title": "Stylometry Analysis of Multi-authored Documents for Authorship and Author Style Change Detection. (arXiv:2401.06752v1 [cs.CL])",
    "abstract": "In recent years, the increasing use of Artificial Intelligence based text generation tools has posed new challenges in document provenance, authentication, and authorship detection. However, advancements in stylometry have provided opportunities for automatic authorship and author change detection in multi-authored documents using style analysis techniques. Style analysis can serve as a primary step toward document provenance and authentication through authorship detection. This paper investigates three key tasks of style analysis: (i) classification of single and multi-authored documents, (ii) single change detection, which involves identifying the point where the author switches, and (iii) multiple author-switching detection in multi-authored documents. We formulate all three tasks as classification problems and propose a merit-based fusion framework that integrates several state-of-the-art natural language processing (NLP) algorithms and weight optimization techniques. We also explo",
    "link": "http://arxiv.org/abs/2401.06752",
    "context": "Title: Stylometry Analysis of Multi-authored Documents for Authorship and Author Style Change Detection. (arXiv:2401.06752v1 [cs.CL])\nAbstract: In recent years, the increasing use of Artificial Intelligence based text generation tools has posed new challenges in document provenance, authentication, and authorship detection. However, advancements in stylometry have provided opportunities for automatic authorship and author change detection in multi-authored documents using style analysis techniques. Style analysis can serve as a primary step toward document provenance and authentication through authorship detection. This paper investigates three key tasks of style analysis: (i) classification of single and multi-authored documents, (ii) single change detection, which involves identifying the point where the author switches, and (iii) multiple author-switching detection in multi-authored documents. We formulate all three tasks as classification problems and propose a merit-based fusion framework that integrates several state-of-the-art natural language processing (NLP) algorithms and weight optimization techniques. We also explo",
    "path": "papers/24/01/2401.06752.json",
    "total_tokens": 847,
    "translated_title": "多作者文献的文体分析用于作者和作者文体变化检测",
    "translated_abstract": "近年来，基于人工智能的文本生成工具的广泛应用给文献来源的考证、鉴别和作者检测带来了新的挑战。然而，文体分析的进展为使用文体分析技术在多作者文献中进行自动作者检测和作者变化检测提供了机会。文体分析可以作为文献来源和鉴别的首要步骤，通过作者检测进行验证。本文研究了文体分析的三个关键任务：（i）单作者和多作者文献的分类，（ii）单一变化检测，包括确定作者变换点，和（iii）多作者变换检测。我们将这三个任务都建立为分类问题，并提出了一个基于价值的融合框架，该框架整合了几种先进的自然语言处理（NLP）算法和权重优化技术。",
    "tldr": "本文研究了多作者文献的文体分析，包括文体分类、单作者变化检测和多作者变化检测。我们提出了一个基于价值的融合框架，并整合了多种自然语言处理算法和权重优化技术。"
}