{
    "title": "LeTO: Learning Constrained Visuomotor Policy with Differentiable Trajectory Optimization",
    "abstract": "This paper introduces LeTO, a method for learning constrained visuomotor policy via differentiable trajectory optimization. Our approach uniquely integrates a differentiable optimization layer into the neural network. By formulating the optimization layer as a trajectory optimization problem, we enable the model to end-to-end generate actions in a safe and controlled fashion without extra modules. Our method allows for the introduction of constraints information during the training process, thereby balancing the training objectives of satisfying constraints, smoothing the trajectories, and minimizing errors with demonstrations. This \"gray box\" method marries the optimization-based safety and interpretability with the powerful representational abilities of neural networks. We quantitatively evaluate LeTO in simulation and on the real robot. In simulation, LeTO achieves a success rate comparable to state-of-the-art imitation learning methods, but the generated trajectories are of less un",
    "link": "https://arxiv.org/abs/2401.17500",
    "context": "Title: LeTO: Learning Constrained Visuomotor Policy with Differentiable Trajectory Optimization\nAbstract: This paper introduces LeTO, a method for learning constrained visuomotor policy via differentiable trajectory optimization. Our approach uniquely integrates a differentiable optimization layer into the neural network. By formulating the optimization layer as a trajectory optimization problem, we enable the model to end-to-end generate actions in a safe and controlled fashion without extra modules. Our method allows for the introduction of constraints information during the training process, thereby balancing the training objectives of satisfying constraints, smoothing the trajectories, and minimizing errors with demonstrations. This \"gray box\" method marries the optimization-based safety and interpretability with the powerful representational abilities of neural networks. We quantitatively evaluate LeTO in simulation and on the real robot. In simulation, LeTO achieves a success rate comparable to state-of-the-art imitation learning methods, but the generated trajectories are of less un",
    "path": "papers/24/01/2401.17500.json",
    "total_tokens": 980,
    "translated_title": "LeTO：通过可微分轨迹优化学习受限视觉运动策略",
    "translated_abstract": "本文介绍了一种名为LeTO的方法，通过可微分轨迹优化实现受限视觉运动策略的学习。我们的方法独特地将一个可微分优化层整合到神经网络中。通过将优化层表示为一个轨迹优化问题，我们能够使模型以安全和可控的方式端到端生成动作，而无需额外的模块。我们的方法允许在训练过程中引入约束信息，从而平衡满足约束、平滑轨迹和最小化演示误差的训练目标。这种“灰盒”方法将基于优化的安全性和可解释性与神经网络的强大表达能力结合在一起。我们在仿真和实际机器人上对LeTO进行了定量评估。在仿真中，LeTO的成功率与最先进的模仿学习方法相当，但生成的轨迹的不一致性较小。",
    "tldr": "LeTO 是一种通过可微分轨迹优化实现受限视觉运动策略的学习方法，它将优化层表示为轨迹优化问题，使模型能以安全可控的方式端到端生成动作。通过引入约束信息，实现了平衡满足约束、平滑轨迹和最小化演示误差的训练目标。在仿真和实际机器人中进行了评估，表明LeTO方法在成功率上与最先进的模仿学习方法相当。",
    "en_tdlr": "LeTO is a method for learning constrained visuomotor policy via differentiable trajectory optimization. It integrates a differentiable optimization layer into the neural network, enabling the model to generate actions in a safe and controlled fashion. Constraints can be introduced during the training process, balancing the objectives of satisfying constraints, smoothing trajectories, and minimizing errors. LeTO achieves comparable success rate to state-of-the-art imitation learning methods in simulation and real robot experiments."
}