{
    "title": "RecDCL: Dual Contrastive Learning for Recommendation",
    "abstract": "arXiv:2401.15635v2 Announce Type: replace-cross  Abstract: Self-supervised learning (SSL) has recently achieved great success in mining the user-item interactions for collaborative filtering. As a major paradigm, contrastive learning (CL) based SSL helps address data sparsity in Web platforms by contrasting the embeddings between raw and augmented data. However, existing CL-based methods mostly focus on contrasting in a batch-wise way, failing to exploit potential regularity in the feature dimension. This leads to redundant solutions during the representation learning of users and items. In this work, we investigate how to employ both batch-wise CL (BCL) and feature-wise CL (FCL) for recommendation. We theoretically analyze the relation between BCL and FCL, and find that combining BCL and FCL helps eliminate redundant solutions but never misses an optimal solution. We propose a dual contrastive learning recommendation framework -- RecDCL. In RecDCL, the FCL objective is designed to eli",
    "link": "https://arxiv.org/abs/2401.15635",
    "context": "Title: RecDCL: Dual Contrastive Learning for Recommendation\nAbstract: arXiv:2401.15635v2 Announce Type: replace-cross  Abstract: Self-supervised learning (SSL) has recently achieved great success in mining the user-item interactions for collaborative filtering. As a major paradigm, contrastive learning (CL) based SSL helps address data sparsity in Web platforms by contrasting the embeddings between raw and augmented data. However, existing CL-based methods mostly focus on contrasting in a batch-wise way, failing to exploit potential regularity in the feature dimension. This leads to redundant solutions during the representation learning of users and items. In this work, we investigate how to employ both batch-wise CL (BCL) and feature-wise CL (FCL) for recommendation. We theoretically analyze the relation between BCL and FCL, and find that combining BCL and FCL helps eliminate redundant solutions but never misses an optimal solution. We propose a dual contrastive learning recommendation framework -- RecDCL. In RecDCL, the FCL objective is designed to eli",
    "path": "papers/24/01/2401.15635.json",
    "total_tokens": 899,
    "translated_title": "RecDCL: 用于推荐的双重对比学习",
    "translated_abstract": "自监督学习（SSL）最近在挖掘协同过滤中的用户-项目交互方面取得了巨大成功。对比学习（CL）是一个重要范式，可以通过对比原始数据和增强数据之间的嵌入来解决网络平台中的数据稀疏性。然而，现有的基于CL的方法主要集中在批次方式对比上，未能充分利用特征维度中的潜在规律，这导致在用户和项目的表示学习过程中出现了冗余的解决方案。在这项工作中，我们研究了如何同时利用批次对比学习（BCL）和特征对比学习（FCL）进行推荐。我们在理论上分析了BCL和FCL之间的关系，并发现结合BCL和FCL有助于消除冗余解决方案，但永远不会错过最优解。我们提出了一个双重对比学习推荐框架-- RecDCL。在RecDCL中，FCL目标旨在消除 ...",
    "tldr": "RecDCL提出了一个双重对比学习推荐框架，结合了批次对比学习（BCL）和特征对比学习（FCL），有助于消除冗余的解决方案，但又不会错过最优解。",
    "en_tdlr": "RecDCL proposes a dual contrastive learning recommendation framework that combines batch-wise contrastive learning (BCL) and feature-wise contrastive learning (FCL), helping eliminate redundant solutions without missing the optimal solution."
}