{
    "title": "What you know or who you know? The role of intellectual and social capital in opportunity recognition",
    "abstract": "The recognition of business opportunities is the first stage in the entrepreneurial process. The current work analyzes the effects of individuals' possession of and access to knowledge on the probability of recognizing good business opportunities in their area of residence. The authors use an eclectic theoretical framework consisting of intellectual and social capital concepts. In particular, they analyze the role of individuals' educational level, their perception that they have the right knowledge and skills to start a business, whether they own and manage a firm, their contacts with other entrepreneurs, and whether they have been business angels. The hypotheses proposed here are tested using data collected for the GEM project in Spain in 2007. The results show that individuals' access to external knowledge through the social networks in which they participate is fundamental for developing the capacity to recognize new business opportunities.",
    "link": "https://arxiv.org/abs/2401.17448",
    "context": "Title: What you know or who you know? The role of intellectual and social capital in opportunity recognition\nAbstract: The recognition of business opportunities is the first stage in the entrepreneurial process. The current work analyzes the effects of individuals' possession of and access to knowledge on the probability of recognizing good business opportunities in their area of residence. The authors use an eclectic theoretical framework consisting of intellectual and social capital concepts. In particular, they analyze the role of individuals' educational level, their perception that they have the right knowledge and skills to start a business, whether they own and manage a firm, their contacts with other entrepreneurs, and whether they have been business angels. The hypotheses proposed here are tested using data collected for the GEM project in Spain in 2007. The results show that individuals' access to external knowledge through the social networks in which they participate is fundamental for developing the capacity to recognize new business opportunities.",
    "path": "papers/24/01/2401.17448.json",
    "total_tokens": 797,
    "translated_title": "你知道什么还是你认识谁？知识资本和社会资本在发现机会中的作用",
    "translated_abstract": "商机的认知是创业过程的第一阶段。本研究分析了个体拥有和获取知识对他们在所在地发现好的商机的概率的影响。作者采用了知识资本和社会资本的综合理论框架。具体来说，他们分析了个体的教育水平，他们是否认为自己拥有开展业务所需的知识和技能，他们是否拥有和管理公司，他们与其他企业家的联系以及他们是否参与了投资天使的角色。本研究使用了2007年西班牙GEM项目收集的数据来验证提出的假设。结果表明，个体通过参与社交网络获得对外部知识的获取对于发展认知新商机的能力是至关重要的。",
    "tldr": "本研究分析了个体在发现商机时知识资本和社会资本的作用。结果显示，个体通过参与社交网络获得对外部知识的获取对于发展认知新商机的能力是至关重要的。"
}