{
    "title": "Contrastive Sequential Interaction Network Learning on Co-Evolving Riemannian Spaces. (arXiv:2401.01243v1 [cs.LG])",
    "abstract": "The sequential interaction network usually find itself in a variety of applications, e.g., recommender system. Herein, inferring future interaction is of fundamental importance, and previous efforts are mainly focused on the dynamics in the classic zero-curvature Euclidean space. Despite the promising results achieved by previous methods, a range of significant issues still largely remains open: On the bipartite nature, is it appropriate to place user and item nodes in one identical space regardless of their inherent difference? On the network dynamics, instead of a fixed curvature space, will the representation spaces evolve when new interactions arrive continuously? On the learning paradigm, can we get rid of the label information costly to acquire? To address the aforementioned issues, we propose a novel Contrastive model for Sequential Interaction Network learning on Co-Evolving RiEmannian spaces, CSINCERE. To the best of our knowledge, we are the first to introduce a couple of co-",
    "link": "http://arxiv.org/abs/2401.01243",
    "context": "Title: Contrastive Sequential Interaction Network Learning on Co-Evolving Riemannian Spaces. (arXiv:2401.01243v1 [cs.LG])\nAbstract: The sequential interaction network usually find itself in a variety of applications, e.g., recommender system. Herein, inferring future interaction is of fundamental importance, and previous efforts are mainly focused on the dynamics in the classic zero-curvature Euclidean space. Despite the promising results achieved by previous methods, a range of significant issues still largely remains open: On the bipartite nature, is it appropriate to place user and item nodes in one identical space regardless of their inherent difference? On the network dynamics, instead of a fixed curvature space, will the representation spaces evolve when new interactions arrive continuously? On the learning paradigm, can we get rid of the label information costly to acquire? To address the aforementioned issues, we propose a novel Contrastive model for Sequential Interaction Network learning on Co-Evolving RiEmannian spaces, CSINCERE. To the best of our knowledge, we are the first to introduce a couple of co-",
    "path": "papers/24/01/2401.01243.json",
    "total_tokens": 885,
    "translated_title": "基于共同进化流形空间的对比顺序交互网络学习",
    "translated_abstract": "顺序交互网络通常用于各种应用，如推荐系统。推测未来的交互行为是非常重要的，之前的研究主要集中在经典的零曲率欧几里得空间中的动态。尽管之前的方法取得了有希望的结果，但仍存在一系列重要的问题：在双分图性质中，将用户和项目节点放置在一个相同的空间中是否适当，无视它们之间的内在差异？在网络动态方面，与固定曲率空间不同，当新的交互不断到来时，表示空间是否会发生演化？在学习范式方面，我们是否可以摆脱昂贵的标签信息获取？为了解决上述问题，我们提出了一个新颖的基于共同进化黎曼空间的对比顺序交互网络学习模型CSINCERE。据我们所知，我们是第一个引入了一对共同进化的流形空间的模型。",
    "tldr": "这篇论文提出了一个基于共同进化黎曼空间的对比顺序交互网络学习模型，用于解决推荐系统中用户和项目节点的区分问题，以及动态表示空间的演化问题。"
}