{
    "title": "Real-Time 2D Temperature Field Prediction in Metal Additive Manufacturing Using Physics-Informed Neural Networks. (arXiv:2401.02403v1 [cs.LG])",
    "abstract": "Accurately predicting the temperature field in metal additive manufacturing (AM) processes is critical to preventing overheating, adjusting process parameters, and ensuring process stability. While physics-based computational models offer precision, they are often time-consuming and unsuitable for real-time predictions and online control in iterative design scenarios. Conversely, machine learning models rely heavily on high-quality datasets, which can be costly and challenging to obtain within the metal AM domain. Our work addresses this by introducing a physics-informed neural network framework specifically designed for temperature field prediction in metal AM. This framework incorporates a physics-informed input, physics-informed loss function, and a Convolutional Long Short-Term Memory (ConvLSTM) architecture. Utilizing real-time temperature data from the process, our model predicts 2D temperature fields for future timestamps across diverse geometries, deposition patterns, and proce",
    "link": "http://arxiv.org/abs/2401.02403",
    "context": "Title: Real-Time 2D Temperature Field Prediction in Metal Additive Manufacturing Using Physics-Informed Neural Networks. (arXiv:2401.02403v1 [cs.LG])\nAbstract: Accurately predicting the temperature field in metal additive manufacturing (AM) processes is critical to preventing overheating, adjusting process parameters, and ensuring process stability. While physics-based computational models offer precision, they are often time-consuming and unsuitable for real-time predictions and online control in iterative design scenarios. Conversely, machine learning models rely heavily on high-quality datasets, which can be costly and challenging to obtain within the metal AM domain. Our work addresses this by introducing a physics-informed neural network framework specifically designed for temperature field prediction in metal AM. This framework incorporates a physics-informed input, physics-informed loss function, and a Convolutional Long Short-Term Memory (ConvLSTM) architecture. Utilizing real-time temperature data from the process, our model predicts 2D temperature fields for future timestamps across diverse geometries, deposition patterns, and proce",
    "path": "papers/24/01/2401.02403.json",
    "total_tokens": 1006,
    "translated_title": "金属增材制造中基于物理信息的神经网络实时二维温度场预测",
    "translated_abstract": "准确预测金属增材制造过程中的温度场对于防止过热、调整工艺参数和确保工艺稳定性至关重要。虽然基于物理的计算模型提供了精确性，但往往耗时且不适用于迭代设计场景中的实时预测和在线控制。相反，机器学习模型严重依赖高质量数据集，而在金属增材制造领域内获得这样的数据集往往成本高且具有挑战性。我们的工作通过引入一种专门针对金属增材制造中温度场预测的基于物理信息的神经网络框架来解决这个问题。该框架包括基于物理信息的输入、基于物理信息的损失函数和卷积长短期记忆(ConvLSTM)架构。利用工艺过程中的实时温度数据，我们的模型预测未来时间戳下各种几何形状、沉积模式和工艺的二维温度场。",
    "tldr": "本论文介绍了一种基于物理信息的神经网络框架，用于实时预测金属增材制造中的二维温度场。该框架结合了基于物理信息的输入、损失函数和卷积长短期记忆架构，通过使用实时温度数据，可以预测未来时间戳下不同几何形状、沉积模式和工艺的温度场。",
    "en_tdlr": "This paper introduces a physics-informed neural network framework for real-time prediction of 2D temperature fields in metal additive manufacturing. The framework incorporates physics-informed input, loss function, and a Convolutional Long Short-Term Memory (ConvLSTM) architecture to predict temperature fields for different geometries, deposition patterns, and process parameters using real-time temperature data."
}