{
    "title": "Causal Discovery by Kernel Deviance Measures with Heterogeneous Transforms",
    "abstract": "The discovery of causal relationships in a set of random variables is a fundamental objective of science and has also recently been argued as being an essential component towards real machine intelligence. One class of causal discovery techniques are founded based on the argument that there are inherent structural asymmetries between the causal and anti-causal direction which could be leveraged in determining the direction of causation. To go about capturing these discrepancies between cause and effect remains to be a challenge and many current state-of-the-art algorithms propose to compare the norms of the kernel mean embeddings of the conditional distributions. In this work, we argue that such approaches based on RKHS embeddings are insufficient in capturing principal markers of cause-effect asymmetry involving higher-order structural variabilities of the conditional distributions. We propose Kernel Intrinsic Invariance Measure with Heterogeneous Transform (KIIM-HT) which introduces ",
    "link": "https://arxiv.org/abs/2401.18017",
    "context": "Title: Causal Discovery by Kernel Deviance Measures with Heterogeneous Transforms\nAbstract: The discovery of causal relationships in a set of random variables is a fundamental objective of science and has also recently been argued as being an essential component towards real machine intelligence. One class of causal discovery techniques are founded based on the argument that there are inherent structural asymmetries between the causal and anti-causal direction which could be leveraged in determining the direction of causation. To go about capturing these discrepancies between cause and effect remains to be a challenge and many current state-of-the-art algorithms propose to compare the norms of the kernel mean embeddings of the conditional distributions. In this work, we argue that such approaches based on RKHS embeddings are insufficient in capturing principal markers of cause-effect asymmetry involving higher-order structural variabilities of the conditional distributions. We propose Kernel Intrinsic Invariance Measure with Heterogeneous Transform (KIIM-HT) which introduces ",
    "path": "papers/24/01/2401.18017.json",
    "total_tokens": 812,
    "translated_title": "通过异构变换的核偏差测量来进行因果关系发现",
    "translated_abstract": "在一组随机变量中发现因果关系是科学的基本目标，并且最近也被认为是实现真正机器智能的必要组成部分。其中一类因果关系发现技术基于这样一种论点：因果方向和反因果方向之间存在固有的结构不对称性，可以利用这种不对称性来确定因果关系的方向。然而，如何捕捉因果关系和效应之间的差异仍然是一个挑战，许多当前最先进的算法提出了通过比较条件分布的核均值嵌入的范数来解决这个问题。本文认为，基于RKHS嵌入的这种方法不足以捕捉涉及条件分布的高阶结构变异的主要标记的因果效应不对称性。因此，我们提出了一种引入了异构变换的核内在不变性测量（KIIM-HT）方法。",
    "tldr": "本文提出了一种通过异构变换的核偏差测量来解决因果关系发现中的挑战，以捕捉因果关系和效应之间的高阶结构变异的主要标记。"
}