{
    "title": "Maximal-Capacity Discrete Memoryless Channel Identification. (arXiv:2401.10204v1 [cs.IT])",
    "abstract": "The problem of identifying the channel with the highest capacity among several discrete memoryless channels (DMCs) is considered. The problem is cast as a pure-exploration multi-armed bandit problem, which follows the practical use of training sequences to sense the communication channel statistics. A capacity estimator is proposed and tight confidence bounds on the estimator error are derived. Based on this capacity estimator, a gap-elimination algorithm termed BestChanID is proposed, which is oblivious to the capacity-achieving input distribution and is guaranteed to output the DMC with the largest capacity, with a desired confidence. Furthermore, two additional algorithms NaiveChanSel and MedianChanEl, that output with certain confidence a DMC with capacity close to the maximal, are introduced. Each of those algorithms is beneficial in a different regime and can be used as a subroutine in BestChanID. The sample complexity of all algorithms is analyzed as a function of the desired co",
    "link": "http://arxiv.org/abs/2401.10204",
    "context": "Title: Maximal-Capacity Discrete Memoryless Channel Identification. (arXiv:2401.10204v1 [cs.IT])\nAbstract: The problem of identifying the channel with the highest capacity among several discrete memoryless channels (DMCs) is considered. The problem is cast as a pure-exploration multi-armed bandit problem, which follows the practical use of training sequences to sense the communication channel statistics. A capacity estimator is proposed and tight confidence bounds on the estimator error are derived. Based on this capacity estimator, a gap-elimination algorithm termed BestChanID is proposed, which is oblivious to the capacity-achieving input distribution and is guaranteed to output the DMC with the largest capacity, with a desired confidence. Furthermore, two additional algorithms NaiveChanSel and MedianChanEl, that output with certain confidence a DMC with capacity close to the maximal, are introduced. Each of those algorithms is beneficial in a different regime and can be used as a subroutine in BestChanID. The sample complexity of all algorithms is analyzed as a function of the desired co",
    "path": "papers/24/01/2401.10204.json",
    "total_tokens": 973,
    "translated_title": "最大容量离散无记忆信道识别",
    "translated_abstract": "本文考虑了在多个离散无记忆信道中识别最高容量信道的问题。将该问题看作纯探索的多臂老虎机问题，根据训练序列来感知通信信道的统计特性。提出了一种容量估计器，并推导了估计误差的紧密置信区间。基于该容量估计器，提出了一种称为BestChanID的缩小差距算法，它对容量达到的输入分布无感知，并且保证以预期置信度输出容量最大的离散无记忆信道。此外，还引入了两种附加算法NaiveChanSel和MedianChanEl，它们能够以一定的置信度输出接近最大容量的离散无记忆信道。每个算法在不同的情况下都有益处，并可以作为BestChanID中的子例程使用。分析了所有算法的样本复杂度，以所需的置信度函数为变量。",
    "tldr": "本文研究了在多个离散无记忆信道中识别最高容量信道的问题，并提出了一种新颖的容量估计器和缩小差距算法。此外，还介绍了两种附加算法，它们能够输出接近最大容量的离散无记忆信道。这些算法能够在不同情况下使用，并且具有一定的置信度。算法的样本复杂度与所需的置信度有关。",
    "en_tdlr": "This paper addresses the problem of identifying the channel with the highest capacity among several discrete memoryless channels. It proposes a capacity estimator and a gap-elimination algorithm to accurately determine the channel with the largest capacity. Additionally, two other algorithms are introduced to provide approximate solutions. The sample complexity of these algorithms is analyzed in relation to the desired confidence level."
}