{
    "title": "UDEEP: Edge-based Computer Vision for In-Situ Underwater Crayfish and Plastic Detection. (arXiv:2401.06157v1 [cs.CV])",
    "abstract": "Invasive signal crayfish have a detrimental impact on ecosystems. They spread the fungal-type crayfish plague disease (Aphanomyces astaci) that is lethal to the native white clawed crayfish, the only native crayfish species in Britain. Invasive signal crayfish extensively burrow, causing habitat destruction, erosion of river banks and adverse changes in water quality, while also competing with native species for resources and leading to declines in native populations. Moreover, pollution exacerbates the vulnerability of White-clawed crayfish, with their populations declining by over 90% in certain English counties, making them highly susceptible to extinction. To safeguard aquatic ecosystems, it is imperative to address the challenges posed by invasive species and discarded plastics in the United Kingdom's river ecosystem's. The UDEEP platform can play a crucial role in environmental monitoring by performing on-the-fly classification of Signal crayfish and plastic debris while leveragi",
    "link": "http://arxiv.org/abs/2401.06157",
    "context": "Title: UDEEP: Edge-based Computer Vision for In-Situ Underwater Crayfish and Plastic Detection. (arXiv:2401.06157v1 [cs.CV])\nAbstract: Invasive signal crayfish have a detrimental impact on ecosystems. They spread the fungal-type crayfish plague disease (Aphanomyces astaci) that is lethal to the native white clawed crayfish, the only native crayfish species in Britain. Invasive signal crayfish extensively burrow, causing habitat destruction, erosion of river banks and adverse changes in water quality, while also competing with native species for resources and leading to declines in native populations. Moreover, pollution exacerbates the vulnerability of White-clawed crayfish, with their populations declining by over 90% in certain English counties, making them highly susceptible to extinction. To safeguard aquatic ecosystems, it is imperative to address the challenges posed by invasive species and discarded plastics in the United Kingdom's river ecosystem's. The UDEEP platform can play a crucial role in environmental monitoring by performing on-the-fly classification of Signal crayfish and plastic debris while leveragi",
    "path": "papers/24/01/2401.06157.json",
    "total_tokens": 876,
    "translated_title": "UDEEP: 基于边缘的水下信号龙虾和塑料检测的计算机视觉",
    "translated_abstract": "入侵的信号龙虾对生态系统造成了不利影响。它们传播了对英国唯一的本地白爪龙虾致命的真菌型龙虾瘟疫病(Aphanomyces astaci)。入侵的信号龙虾广泛挖掘洞穴，破坏栖息地，侵蚀河岸并对水质产生不利影响，同时竞争本地物种的资源并导致本地种群下降。此外，污染也使白爪龙虾更加容易受到损害，其种群在英国某些地区下降超过90％，使其极易濒临灭绝。为了保护水生生态系统，解决入侵物种和废弃塑料对英国河流生态系统的挑战至关重要。UDEEP平台可以通过实时分类信号龙虾和塑料碎片，充当环境监测的关键角色。",
    "tldr": "UDEEP是一个基于边缘计算机视觉的平台，可以帮助解决入侵信号龙虾和废弃塑料对水生生态系统的挑战。",
    "en_tdlr": "UDEEP is an edge-based computer vision platform that addresses the challenges posed by invasive signal crayfish and discarded plastics in aquatic ecosystems."
}