{
    "title": "Audio-Infused Automatic Image Colorization by Exploiting Audio Scene Semantics. (arXiv:2401.13270v1 [cs.CV])",
    "abstract": "Automatic image colorization is inherently an ill-posed problem with uncertainty, which requires an accurate semantic understanding of scenes to estimate reasonable colors for grayscale images. Although recent interaction-based methods have achieved impressive performance, it is still a very difficult task to infer realistic and accurate colors for automatic colorization. To reduce the difficulty of semantic understanding of grayscale scenes, this paper tries to utilize corresponding audio, which naturally contains extra semantic information about the same scene. Specifically, a novel audio-infused automatic image colorization (AIAIC) network is proposed, which consists of three stages. First, we take color image semantics as a bridge and pretrain a colorization network guided by color image semantics. Second, the natural co-occurrence of audio and video is utilized to learn the color semantic correlations between audio and visual scenes. Third, the implicit audio semantic representati",
    "link": "http://arxiv.org/abs/2401.13270",
    "context": "Title: Audio-Infused Automatic Image Colorization by Exploiting Audio Scene Semantics. (arXiv:2401.13270v1 [cs.CV])\nAbstract: Automatic image colorization is inherently an ill-posed problem with uncertainty, which requires an accurate semantic understanding of scenes to estimate reasonable colors for grayscale images. Although recent interaction-based methods have achieved impressive performance, it is still a very difficult task to infer realistic and accurate colors for automatic colorization. To reduce the difficulty of semantic understanding of grayscale scenes, this paper tries to utilize corresponding audio, which naturally contains extra semantic information about the same scene. Specifically, a novel audio-infused automatic image colorization (AIAIC) network is proposed, which consists of three stages. First, we take color image semantics as a bridge and pretrain a colorization network guided by color image semantics. Second, the natural co-occurrence of audio and video is utilized to learn the color semantic correlations between audio and visual scenes. Third, the implicit audio semantic representati",
    "path": "papers/24/01/2401.13270.json",
    "total_tokens": 874,
    "translated_title": "通过利用音频场景语义实现自动图像上色",
    "translated_abstract": "自动图像上色是一个具有不确定性的问题，需要对场景进行准确的语义理解，以估计灰度图像的合理颜色。虽然最近的基于交互的方法取得了令人印象深刻的性能，但对于自动上色来说，推断出逼真和准确的颜色仍然是一个非常困难的任务。为了降低对灰度场景的语义理解难度，本文尝试利用相应的音频，音频自然地包含了关于同一场景的额外语义信息。具体而言，提出了一种新颖的音频注入自动图像上色（AIAIC）网络，该网络分为三个阶段。首先，我们将彩色图像的语义作为桥梁，通过彩色图像的语义引导预训练上色网络。其次，利用音频与视频的自然共现来学习音频和视觉场景之间的颜色语义相关性。第三，隐式音频语义表示被利用以引导图像上色。",
    "tldr": "本论文提出了一种使用音频场景语义进行自动图像上色的方法，通过引入音频作为辅助信息，降低了对场景语义理解的难度，并通过三个阶段的网络进行了实现。"
}