{
    "title": "Learning effective good variables from physical data. (arXiv:2401.05226v1 [physics.data-an])",
    "abstract": "We assume that a sufficiently large database is available, where a physical property of interest and a number of associated ruling primitive variables or observables are stored. We introduce and test two machine learning approaches to discover possible groups or combinations of primitive variables: The first approach is based on regression models whereas the second on classification models. The variable group (here referred to as the new effective good variable) can be considered as successfully found, when the physical property of interest is characterized by the following effective invariant behaviour: In the first method, invariance of the group implies invariance of the property up to a given accuracy; in the other method, upon partition of the physical property values into two or more classes, invariance of the group implies invariance of the class. For the sake of illustration, the two methods are successfully applied to two popular empirical correlations describing the convectiv",
    "link": "http://arxiv.org/abs/2401.05226",
    "context": "Title: Learning effective good variables from physical data. (arXiv:2401.05226v1 [physics.data-an])\nAbstract: We assume that a sufficiently large database is available, where a physical property of interest and a number of associated ruling primitive variables or observables are stored. We introduce and test two machine learning approaches to discover possible groups or combinations of primitive variables: The first approach is based on regression models whereas the second on classification models. The variable group (here referred to as the new effective good variable) can be considered as successfully found, when the physical property of interest is characterized by the following effective invariant behaviour: In the first method, invariance of the group implies invariance of the property up to a given accuracy; in the other method, upon partition of the physical property values into two or more classes, invariance of the group implies invariance of the class. For the sake of illustration, the two methods are successfully applied to two popular empirical correlations describing the convectiv",
    "path": "papers/24/01/2401.05226.json",
    "total_tokens": 799,
    "translated_title": "学习有效的好变量从物理数据中",
    "tldr": "从物理数据中学习有效的好变量，通过回归和分类模型探索变量组或组合，以发现物理属性的不变行为。两种方法成功地应用于描述对流的经验相关性。",
    "en_tdlr": "Learning effective good variables from physical data by exploring variable groups or combinations through regression and classification models to discover invariant behavior of physical properties. The two methods were successfully applied to describe empirical correlations of convection."
}