{
    "title": "Picky Eaters Make For Better Raters. (arXiv:2401.03193v1 [cs.IR])",
    "abstract": "It has been established in the literature that the number of ratings and the scores restaurants obtain on online rating systems (ORS) significantly impact their revenue. However, when a restaurant has a limited number of ratings, it may be challenging to predict its future performance. It may well be that ratings reveal more about the user who did the rating than about the quality of the restaurant. This motivates us to segment users into \"inflating raters\", who tend to give unusually high ratings, and \"deflating raters\", who tend to give unusually low ratings, and compare the rankings generated by these two populations. Using a public dataset provided by Yelp, we find that deflating raters are better at predicting restaurants that will achieve a top rating (4.5 and above) in the future. As such, these deflating raters may have an important role in restaurant discovery.",
    "link": "http://arxiv.org/abs/2401.03193",
    "context": "Title: Picky Eaters Make For Better Raters. (arXiv:2401.03193v1 [cs.IR])\nAbstract: It has been established in the literature that the number of ratings and the scores restaurants obtain on online rating systems (ORS) significantly impact their revenue. However, when a restaurant has a limited number of ratings, it may be challenging to predict its future performance. It may well be that ratings reveal more about the user who did the rating than about the quality of the restaurant. This motivates us to segment users into \"inflating raters\", who tend to give unusually high ratings, and \"deflating raters\", who tend to give unusually low ratings, and compare the rankings generated by these two populations. Using a public dataset provided by Yelp, we find that deflating raters are better at predicting restaurants that will achieve a top rating (4.5 and above) in the future. As such, these deflating raters may have an important role in restaurant discovery.",
    "path": "papers/24/01/2401.03193.json",
    "total_tokens": 811,
    "translated_title": "挑剔的食客会成为更好的评分者",
    "translated_abstract": "文献已经证明，在在线评级系统（ORS）上的评级数量和餐厅获得的评分显著影响其收入。然而，当一个餐厅只有有限数量的评级时，预测其未来表现可能是具有挑战性的。评级可能更多地反映了进行评级的用户而不是餐厅的质量。这激励我们将用户分成“夸大评级者”，他们倾向于给出异常高的评级，“贬低评级者”，他们倾向于给出异常低的评级，并比较这两个群体生成的排名。使用Yelp提供的公共数据集，我们发现贬低评级者更擅长预测未来会获得高评分（4.5及以上）的餐厅。因此，这些贬低评级者在餐厅发现中可能发挥着重要的作用。",
    "tldr": "研究发现，贬低评级者更擅长预测未来会获得高评分的餐厅，并在餐厅发现中扮演重要角色。"
}