{
    "title": "Online Resource Allocation with Non-Stationary Customers. (arXiv:2401.16945v1 [cs.LG])",
    "abstract": "We propose a novel algorithm for online resource allocation with non-stationary customer arrivals and unknown click-through rates. We assume multiple types of customers arrive in a nonstationary stochastic fashion, with unknown arrival rates in each period, and that customers' click-through rates are unknown and can only be learned online. By leveraging results from the stochastic contextual bandit with knapsack and online matching with adversarial arrivals, we develop an online scheme to allocate the resources to nonstationary customers. We prove that under mild conditions, our scheme achieves a ``best-of-both-world'' result: the scheme has a sublinear regret when the customer arrivals are near-stationary, and enjoys an optimal competitive ratio under general (non-stationary) customer arrival distributions. Finally, we conduct extensive numerical experiments to show our approach generates near-optimal revenues for all different customer scenarios.",
    "link": "http://arxiv.org/abs/2401.16945",
    "context": "Title: Online Resource Allocation with Non-Stationary Customers. (arXiv:2401.16945v1 [cs.LG])\nAbstract: We propose a novel algorithm for online resource allocation with non-stationary customer arrivals and unknown click-through rates. We assume multiple types of customers arrive in a nonstationary stochastic fashion, with unknown arrival rates in each period, and that customers' click-through rates are unknown and can only be learned online. By leveraging results from the stochastic contextual bandit with knapsack and online matching with adversarial arrivals, we develop an online scheme to allocate the resources to nonstationary customers. We prove that under mild conditions, our scheme achieves a ``best-of-both-world'' result: the scheme has a sublinear regret when the customer arrivals are near-stationary, and enjoys an optimal competitive ratio under general (non-stationary) customer arrival distributions. Finally, we conduct extensive numerical experiments to show our approach generates near-optimal revenues for all different customer scenarios.",
    "path": "papers/24/01/2401.16945.json",
    "total_tokens": 971,
    "translated_title": "在线资源分配与非平稳顾客",
    "translated_abstract": "本文提出了一种用于在线资源分配的新算法，适用于非平稳顾客到达和未知的点击率。我们假设多种类型的顾客以非平稳随机方式到达，每个时期都有未知的到达率，并且顾客的点击率未知，只能在线学习。通过利用基于随机上下文摇臂和具有对抗性到达的在线匹配的结果，我们开发了一个在线方案，将资源分配给非平稳顾客。我们证明，在温和条件下，我们的方案实现了“两全其美”的效果：当顾客到达接近平稳时，方案具有次线性遗憾，并在一般（非平稳）顾客到达分布下享受最优的竞争比率。最后，我们进行了大量的数值实验，展示了我们的方法在所有不同顾客场景下生成接近最优的收益。",
    "tldr": "本文提出了一种用于在线资源分配的新算法，适用于非平稳顾客到达和未知的点击率。通过充分利用随机上下文摇臂和具有对抗性到达的在线匹配的结果，我们的方案实现了在顾客到达接近平稳时具有次线性遗憾，并在一般（非平稳）顾客到达分布下享受最优的竞争比率。我们通过大量的数值实验证明了我们的方法在各种不同的顾客场景下生成接近最优的收益。"
}