{
    "title": "LLpowershap: Logistic Loss-based Automated Shapley Values Feature Selection Method. (arXiv:2401.12683v1 [cs.LG])",
    "abstract": "Shapley values have been used extensively in machine learning, not only to explain black box machine learning models, but among other tasks, also to conduct model debugging, sensitivity and fairness analyses and to select important features for robust modelling and for further follow-up analyses. Shapley values satisfy certain axioms that promote fairness in distributing contributions of features toward prediction or reducing error, after accounting for non-linear relationships and interactions when complex machine learning models are employed. Recently, a number of feature selection methods utilising Shapley values have been introduced. Here, we present a novel feature selection method, LLpowershap, which makes use of loss-based Shapley values to identify informative features with minimal noise among the selected sets of features. Our simulation results show that LLpowershap not only identifies higher number of informative features but outputs fewer noise features compared to other st",
    "link": "http://arxiv.org/abs/2401.12683",
    "context": "Title: LLpowershap: Logistic Loss-based Automated Shapley Values Feature Selection Method. (arXiv:2401.12683v1 [cs.LG])\nAbstract: Shapley values have been used extensively in machine learning, not only to explain black box machine learning models, but among other tasks, also to conduct model debugging, sensitivity and fairness analyses and to select important features for robust modelling and for further follow-up analyses. Shapley values satisfy certain axioms that promote fairness in distributing contributions of features toward prediction or reducing error, after accounting for non-linear relationships and interactions when complex machine learning models are employed. Recently, a number of feature selection methods utilising Shapley values have been introduced. Here, we present a novel feature selection method, LLpowershap, which makes use of loss-based Shapley values to identify informative features with minimal noise among the selected sets of features. Our simulation results show that LLpowershap not only identifies higher number of informative features but outputs fewer noise features compared to other st",
    "path": "papers/24/01/2401.12683.json",
    "total_tokens": 760,
    "translated_title": "LLpowershap: 基于逻辑损失的自动Shapley值特征选择方法",
    "translated_abstract": "Shapley值在机器学习中被广泛应用，不仅可以解释黑盒机器学习模型，还可以用于模型调试、敏感性和公平性分析，以及选择重要特征进行稳健建模和进一步分析。最近，已经提出了许多利用Shapley值的特征选择方法。本文介绍了一种新的特征选择方法LLpowershap，该方法利用基于损失的Shapley值在选择的特征集合中识别出具有最小噪声的信息特征。我们的模拟结果表明，与其他方法相比，LLpowershap不仅识别出更多的信息特征，而且输出的噪声特征较少。",
    "tldr": "LLpowershap是一种基于逻辑损失的自动Shapley值特征选择方法，可以在选择的特征集合中识别出具有最小噪声的信息特征。",
    "en_tdlr": "LLpowershap is a logistic loss-based automated feature selection method that utilizes Shapley values to identify informative features with minimal noise among the selected sets of features."
}