{
    "title": "NNOSE: Nearest Neighbor Occupational Skill Extraction. (arXiv:2401.17092v1 [cs.CL])",
    "abstract": "The labor market is changing rapidly, prompting increased interest in the automatic extraction of occupational skills from text. With the advent of English benchmark job description datasets, there is a need for systems that handle their diversity well. We tackle the complexity in occupational skill datasets tasks -- combining and leveraging multiple datasets for skill extraction, to identify rarely observed skills within a dataset, and overcoming the scarcity of skills across datasets. In particular, we investigate the retrieval-augmentation of language models, employing an external datastore for retrieving similar skills in a dataset-unifying manner. Our proposed method, \\textbf{N}earest \\textbf{N}eighbor \\textbf{O}ccupational \\textbf{S}kill \\textbf{E}xtraction (NNOSE) effectively leverages multiple datasets by retrieving neighboring skills from other datasets in the datastore. This improves skill extraction \\emph{without} additional fine-tuning. Crucially, we observe a performance g",
    "link": "http://arxiv.org/abs/2401.17092",
    "context": "Title: NNOSE: Nearest Neighbor Occupational Skill Extraction. (arXiv:2401.17092v1 [cs.CL])\nAbstract: The labor market is changing rapidly, prompting increased interest in the automatic extraction of occupational skills from text. With the advent of English benchmark job description datasets, there is a need for systems that handle their diversity well. We tackle the complexity in occupational skill datasets tasks -- combining and leveraging multiple datasets for skill extraction, to identify rarely observed skills within a dataset, and overcoming the scarcity of skills across datasets. In particular, we investigate the retrieval-augmentation of language models, employing an external datastore for retrieving similar skills in a dataset-unifying manner. Our proposed method, \\textbf{N}earest \\textbf{N}eighbor \\textbf{O}ccupational \\textbf{S}kill \\textbf{E}xtraction (NNOSE) effectively leverages multiple datasets by retrieving neighboring skills from other datasets in the datastore. This improves skill extraction \\emph{without} additional fine-tuning. Crucially, we observe a performance g",
    "path": "papers/24/01/2401.17092.json",
    "total_tokens": 809,
    "translated_title": "NNOSE：最近邻职业技能提取",
    "translated_abstract": "劳动力市场正在快速变化，引发了对从文本中自动提取职业技能的增加兴趣。随着英语基准工作描述数据集的出现，需要处理它们的多样性的系统。我们解决了职业技能数据集任务中的复杂性，通过合并和利用多个数据集来提取技能，从而在数据集中识别少见的技能，并克服数据集间技能的稀缺性。特别地，我们研究了语言模型的检索增强，采用外部数据存储来以数据集统一的方式检索相似的技能。我们提出的方法NNOSE（Nearest Neighbor Occupational Skill Extraction）通过从数据存储中检索其他数据集中的邻近技能有效地利用多个数据集。这在不需要额外微调的情况下提高了技能提取的性能。",
    "tldr": "NNOSE是一种利用多个数据集有效提取职业技能的方法，通过检索其他数据集中的邻近技能来提高技能提取的性能，而无需进行额外的微调。"
}