{
    "title": "Decoupling Pixel Flipping and Occlusion Strategy for Consistent XAI Benchmarks. (arXiv:2401.06654v1 [cs.CV])",
    "abstract": "Feature removal is a central building block for eXplainable AI (XAI), both for occlusion-based explanations (Shapley values) as well as their evaluation (pixel flipping, PF). However, occlusion strategies can vary significantly from simple mean replacement up to inpainting with state-of-the-art diffusion models. This ambiguity limits the usefulness of occlusion-based approaches. For example, PF benchmarks lead to contradicting rankings. This is amplified by competing PF measures: Features are either removed starting with most influential first (MIF) or least influential first (LIF). This study proposes two complementary perspectives to resolve this disagreement problem. Firstly, we address the common criticism of occlusion-based XAI, that artificial samples lead to unreliable model evaluations. We propose to measure the reliability by the R(eference)-Out-of-Model-Scope (OMS) score. The R-OMS score enables a systematic comparison of occlusion strategies and resolves the disagreement pro",
    "link": "http://arxiv.org/abs/2401.06654",
    "context": "Title: Decoupling Pixel Flipping and Occlusion Strategy for Consistent XAI Benchmarks. (arXiv:2401.06654v1 [cs.CV])\nAbstract: Feature removal is a central building block for eXplainable AI (XAI), both for occlusion-based explanations (Shapley values) as well as their evaluation (pixel flipping, PF). However, occlusion strategies can vary significantly from simple mean replacement up to inpainting with state-of-the-art diffusion models. This ambiguity limits the usefulness of occlusion-based approaches. For example, PF benchmarks lead to contradicting rankings. This is amplified by competing PF measures: Features are either removed starting with most influential first (MIF) or least influential first (LIF). This study proposes two complementary perspectives to resolve this disagreement problem. Firstly, we address the common criticism of occlusion-based XAI, that artificial samples lead to unreliable model evaluations. We propose to measure the reliability by the R(eference)-Out-of-Model-Scope (OMS) score. The R-OMS score enables a systematic comparison of occlusion strategies and resolves the disagreement pro",
    "path": "papers/24/01/2401.06654.json",
    "total_tokens": 979,
    "translated_title": "解耦像素翻转与遮挡策略以实现一致的XAI基准",
    "translated_abstract": "特征移除是可解释人工智能（XAI）的核心构建模块，既适用于基于遮挡的解释（Shapley值），也适用于它们的评估（像素翻转，PF）。然而，遮挡策略可以从简单的均值替换到使用最先进的扩散模型进行修复之间差异很大。这种不确定性限制了遮挡方法的实用性。例如，PF基准会导致矛盾的排名。这一问题还因竞争的PF度量而变得复杂：特征要么从最有影响力的开始移除（MIF），要么从最无影响力的开始移除（LIF）。本研究提出了两个互补的视角来解决这个问题。首先，我们解决了针对基于遮挡的XAI的常见批评，即人工样本导致模型评估不可靠的问题。我们提出用R-OMS得分来衡量可靠性（参考模型范围之外的R-OMS得分）。R-OMS得分能够对遮挡策略进行系统比较，并解决了矛盾问题。",
    "tldr": "本研究提出了两个视角来解决基于遮挡的解释方法中的矛盾问题，首先通过使用R-OMS得分来衡量可靠性，然后通过解耦像素翻转和遮挡策略来提高结果的一致性。",
    "en_tdlr": "This study proposes two perspectives to address the contradiction problem in occlusion-based explanation methods, first by measuring reliability using R-OMS score, and then by decoupling pixel flipping and occlusion strategy to improve the consistency of results."
}