{
    "title": "Prompt Smells: An Omen for Undesirable Generative AI Outputs. (arXiv:2401.12611v1 [cs.LG])",
    "abstract": "Recent Generative Artificial Intelligence (GenAI) trends focus on various applications, including creating stories, illustrations, poems, articles, computer code, music compositions, and videos. Extrinsic hallucinations are a critical limitation of such GenAI, which can lead to significant challenges in achieving and maintaining the trustworthiness of GenAI. In this paper, we propose two new concepts that we believe will aid the research community in addressing limitations associated with the application of GenAI models. First, we propose a definition for the \"desirability\" of GenAI outputs and three factors which are observed to influence it. Second, drawing inspiration from Martin Fowler's code smells, we propose the concept of \"prompt smells\" and the adverse effects they are observed to have on the desirability of GenAI outputs. We expect our work will contribute to the ongoing conversation about the desirability of GenAI outputs and help advance the field in a meaningful way.",
    "link": "http://arxiv.org/abs/2401.12611",
    "context": "Title: Prompt Smells: An Omen for Undesirable Generative AI Outputs. (arXiv:2401.12611v1 [cs.LG])\nAbstract: Recent Generative Artificial Intelligence (GenAI) trends focus on various applications, including creating stories, illustrations, poems, articles, computer code, music compositions, and videos. Extrinsic hallucinations are a critical limitation of such GenAI, which can lead to significant challenges in achieving and maintaining the trustworthiness of GenAI. In this paper, we propose two new concepts that we believe will aid the research community in addressing limitations associated with the application of GenAI models. First, we propose a definition for the \"desirability\" of GenAI outputs and three factors which are observed to influence it. Second, drawing inspiration from Martin Fowler's code smells, we propose the concept of \"prompt smells\" and the adverse effects they are observed to have on the desirability of GenAI outputs. We expect our work will contribute to the ongoing conversation about the desirability of GenAI outputs and help advance the field in a meaningful way.",
    "path": "papers/24/01/2401.12611.json",
    "total_tokens": 892,
    "translated_title": "Prompt Smells: AI 生成结果的不受欢迎的征兆",
    "translated_abstract": "最近的生成人工智能（GenAI）趋势关注各种应用，包括创作故事、插图、诗歌、文章、计算机代码、音乐作品和视频。外在幻觉是这种GenAI的一个关键限制，可能导致在实现和维护GenAI的可信度方面面临重大挑战。在本文中，我们提出了两个新概念，我们认为这将有助于研究社区解决与GenAI模型应用相关的限制。首先，我们提出了对GenAI输出\"可取性\"的定义，以及观察到影响其的三个因素。其次，我们借鉴马丁·福勒（Martin Fowler）的\"代码气味\"，提出了\"提示气味\"的概念，以及它们对GenAI输出的可取性所产生的不良影响。我们期望我们的工作将为关于GenAI输出可取性的持续讨论做出贡献，并在有意义的方式上推动该领域的发展。",
    "tldr": "本文提出了两个新概念，分别是对GenAI输出可取性的定义和\"提示气味\"的概念，旨在解决GenAI模型应用中的限制和挑战。"
}