{
    "title": "Machine-learning-based particle identification with missing data. (arXiv:2401.01905v1 [physics.ins-det])",
    "abstract": "In this work, we introduce a novel method for Particle Identification (PID) within the scope of the ALICE experiment at the Large Hadron Collider at CERN. Identifying products of ultrarelativisitc collisions delivered by the LHC is one of the crucial objectives of ALICE. Typically employed PID methods rely on hand-crafted selections, which compare experimental data to theoretical simulations. To improve the performance of the baseline methods, novel approaches use machine learning models that learn the proper assignment in a classification task. However, because of the various detection techniques used by different subdetectors, as well as the limited detector efficiency and acceptance, produced particles do not always yield signals in all of the ALICE components. This results in data with missing values. Machine learning techniques cannot be trained with such examples, so a significant part of the data is skipped during training. In this work, we propose the first method for PID that ",
    "link": "http://arxiv.org/abs/2401.01905",
    "context": "Title: Machine-learning-based particle identification with missing data. (arXiv:2401.01905v1 [physics.ins-det])\nAbstract: In this work, we introduce a novel method for Particle Identification (PID) within the scope of the ALICE experiment at the Large Hadron Collider at CERN. Identifying products of ultrarelativisitc collisions delivered by the LHC is one of the crucial objectives of ALICE. Typically employed PID methods rely on hand-crafted selections, which compare experimental data to theoretical simulations. To improve the performance of the baseline methods, novel approaches use machine learning models that learn the proper assignment in a classification task. However, because of the various detection techniques used by different subdetectors, as well as the limited detector efficiency and acceptance, produced particles do not always yield signals in all of the ALICE components. This results in data with missing values. Machine learning techniques cannot be trained with such examples, so a significant part of the data is skipped during training. In this work, we propose the first method for PID that ",
    "path": "papers/24/01/2401.01905.json",
    "total_tokens": 888,
    "translated_title": "基于机器学习的带有缺失数据的粒子识别",
    "translated_abstract": "本研究介绍了一种新颖的方法，用于在CERN的Large Hadron Collider的ALICE实验范围内进行粒子鉴别（PID）。鉴定LHC提供的超相对论碰撞产物是ALICE的关键目标之一。通常使用的PID方法依赖于手工选择，将实验数据与理论模拟进行比较。为了提高基线方法的性能，新的方法使用机器学习模型，在分类任务中学习正确的分配。然而，由于不同子探测器使用不同的检测技术，以及有限的探测器效率和接受度，产生的粒子并不总是在ALICE的所有组件中产生信号。这导致数据中存在缺失值。机器学习技术无法训练这些示例，因此在训练过程中跳过了数据的重要部分。在本研究中，我们提出了一种第一种适用于PID的方法，该方法可以处理具有缺失数据的情况。",
    "tldr": "本文提出了一种处理带有缺失数据的粒子识别的方法，使用机器学习模型，首次解决了在ALICE实验中由于不同探测器使用不同技术而产生的数据缺失问题。"
}