{
    "title": "Decentralized Multi-Task Online Convex Optimization Under Random Link Failures. (arXiv:2401.02011v1 [cs.LG])",
    "abstract": "Decentralized optimization methods often entail information exchange between neighbors. Transmission failures can happen due to network congestion, hardware/software issues, communication outage, and other factors. In this paper, we investigate the random link failure problem in decentralized multi-task online convex optimization, where agents have individual decisions that are coupled with each other via pairwise constraints. Although widely used in constrained optimization, conventional saddle-point algorithms are not directly applicable here because of random packet dropping. To address this issue, we develop a robust decentralized saddle-point algorithm against random link failures with heterogeneous probabilities by replacing the missing decisions of neighbors with their latest received values. Then, by judiciously bounding the accumulated deviation stemming from this replacement, we first establish that our algorithm achieves $\\mathcal{O}(\\sqrt{T})$ regret and $\\mathcal{O}(T^\\fra",
    "link": "http://arxiv.org/abs/2401.02011",
    "context": "Title: Decentralized Multi-Task Online Convex Optimization Under Random Link Failures. (arXiv:2401.02011v1 [cs.LG])\nAbstract: Decentralized optimization methods often entail information exchange between neighbors. Transmission failures can happen due to network congestion, hardware/software issues, communication outage, and other factors. In this paper, we investigate the random link failure problem in decentralized multi-task online convex optimization, where agents have individual decisions that are coupled with each other via pairwise constraints. Although widely used in constrained optimization, conventional saddle-point algorithms are not directly applicable here because of random packet dropping. To address this issue, we develop a robust decentralized saddle-point algorithm against random link failures with heterogeneous probabilities by replacing the missing decisions of neighbors with their latest received values. Then, by judiciously bounding the accumulated deviation stemming from this replacement, we first establish that our algorithm achieves $\\mathcal{O}(\\sqrt{T})$ regret and $\\mathcal{O}(T^\\fra",
    "path": "papers/24/01/2401.02011.json",
    "total_tokens": 877,
    "translated_title": "分散多任务在线凸优化在随机链路失效下的应用",
    "translated_abstract": "分散的优化方法通常需要邻居之间的信息交换。由于网络拥塞、硬件/软件问题、通信中断和其他因素，传输故障可能发生。在本文中，我们研究了在分散多任务在线凸优化中的随机链路故障问题，其中代理通过成对约束相互耦合。虽然在约束优化中广泛使用，但传统的鞍点算法在这里并不直接适用，因为存在随机丢包。为了解决这个问题，我们开发了一种健壮的分散鞍点算法，以对抗具有异质概率的随机链路失效，通过用邻居的最新接收到的值替代缺失决策。然后，通过谨慎地限制由这种替代产生的累积偏差，我们首先证明了我们的算法达到了O(sqrt(T))的regret和O(T^fra)的复杂度。",
    "tldr": "本文研究了分散多任务在线凸优化中的随机链路故障问题，提出了替代缺失决策的健壮分散鞍点算法，并证明了算法达到了O(sqrt(T))的regret和O(T^fra)的复杂度。",
    "en_tdlr": "This paper investigates the problem of random link failures in decentralized multi-task online convex optimization, proposes a robust decentralized saddle-point algorithm to handle missing decisions, and proves that the algorithm achieves O(sqrt(T)) regret and O(T^fra) complexity."
}