{
    "title": "Assessment of Sports Concussion in Female Athletes: A Role for Neuroinformatics?. (arXiv:2401.13045v1 [stat.ML])",
    "abstract": "Over the past decade, the intricacies of sports-related concussions among female athletes have become readily apparent. Traditional clinical methods for diagnosing concussions suffer limitations when applied to female athletes, often failing to capture subtle changes in brain structure and function. Advanced neuroinformatics techniques and machine learning models have become invaluable assets in this endeavor. While these technologies have been extensively employed in understanding concussion in male athletes, there remains a significant gap in our comprehension of their effectiveness for female athletes. With its remarkable data analysis capacity, machine learning offers a promising avenue to bridge this deficit. By harnessing the power of machine learning, researchers can link observed phenotypic neuroimaging data to sex-specific biological mechanisms, unraveling the mysteries of concussions in female athletes. Furthermore, embedding methods within machine learning enable examining b",
    "link": "http://arxiv.org/abs/2401.13045",
    "context": "Title: Assessment of Sports Concussion in Female Athletes: A Role for Neuroinformatics?. (arXiv:2401.13045v1 [stat.ML])\nAbstract: Over the past decade, the intricacies of sports-related concussions among female athletes have become readily apparent. Traditional clinical methods for diagnosing concussions suffer limitations when applied to female athletes, often failing to capture subtle changes in brain structure and function. Advanced neuroinformatics techniques and machine learning models have become invaluable assets in this endeavor. While these technologies have been extensively employed in understanding concussion in male athletes, there remains a significant gap in our comprehension of their effectiveness for female athletes. With its remarkable data analysis capacity, machine learning offers a promising avenue to bridge this deficit. By harnessing the power of machine learning, researchers can link observed phenotypic neuroimaging data to sex-specific biological mechanisms, unraveling the mysteries of concussions in female athletes. Furthermore, embedding methods within machine learning enable examining b",
    "path": "papers/24/01/2401.13045.json",
    "total_tokens": 921,
    "translated_title": "评估女性运动员脑震荡：神经信息学的作用？",
    "translated_abstract": "在过去的十年中，女性运动员脑震荡的复杂性变得明显。传统的临床诊断脑震荡的方法在应用于女性运动员时存在局限性，往往无法捕捉到脑结构和功能的细微变化。先进的神经信息学技术和机器学习模型在这方面已经成为宝贵的资产。虽然这些技术在理解男性运动员的脑震荡方面已经被广泛应用，但在我们对于它们对女性运动员的有效性的理解上仍存在显著差距。通过利用机器学习的强大数据分析能力，研究人员可以将观察到的表型神经影像数据联系到特定于性别的生物机制，揭示女性运动员脑震荡的奥秘。此外，嵌入机器学习的方法还可以在研究中进行交叉验证，进一步检验性别差异。",
    "tldr": "该论文提出了通过神经信息学和机器学习来评估女性运动员脑震荡的方法。相比传统的临床方法，在女性运动员中诊断脑震荡存在一些局限性，而这些新技术可以通过数据分析找出与性别相关的生物机制，从而填补这一差距。"
}