{
    "title": "Combining Machine Learning and Ontology: A Systematic Literature Review",
    "abstract": "arXiv:2401.07744v2 Announce Type: replace  Abstract: Motivated by the desire to explore the process of combining inductive and deductive reasoning, we conducted a systematic literature review of articles that investigate the integration of machine learning and ontologies. The objective was to identify diverse techniques that incorporate both inductive reasoning (performed by machine learning) and deductive reasoning (performed by ontologies) into artificial intelligence systems. Our review, which included the analysis of 128 studies, allowed us to identify three main categories of hybridization between machine learning and ontologies: learning-enhanced ontologies, semantic data mining, and learning and reasoning systems. We provide a comprehensive examination of all these categories, emphasizing the various machine learning algorithms utilized in the studies. Furthermore, we compared our classification with similar recent work in the field of hybrid AI and neuro-symbolic approaches.",
    "link": "https://arxiv.org/abs/2401.07744",
    "context": "Title: Combining Machine Learning and Ontology: A Systematic Literature Review\nAbstract: arXiv:2401.07744v2 Announce Type: replace  Abstract: Motivated by the desire to explore the process of combining inductive and deductive reasoning, we conducted a systematic literature review of articles that investigate the integration of machine learning and ontologies. The objective was to identify diverse techniques that incorporate both inductive reasoning (performed by machine learning) and deductive reasoning (performed by ontologies) into artificial intelligence systems. Our review, which included the analysis of 128 studies, allowed us to identify three main categories of hybridization between machine learning and ontologies: learning-enhanced ontologies, semantic data mining, and learning and reasoning systems. We provide a comprehensive examination of all these categories, emphasizing the various machine learning algorithms utilized in the studies. Furthermore, we compared our classification with similar recent work in the field of hybrid AI and neuro-symbolic approaches.",
    "path": "papers/24/01/2401.07744.json",
    "total_tokens": 866,
    "translated_title": "结合机器学习和本体论：系统文献综述",
    "translated_abstract": "受对将归纳推理和演绎推理结合的探索过程的渴望驱使，我们对调查机器学习和本体一体化的文章进行了系统文献综述。其目标是识别涵盖归纳推理（由机器学习执行）和演绎推理（由本体执行）的多种技术以整合到人工智能系统中。我们的综述包括对128项研究的分析，使我们能够确定机器学习和本体之间的三个主要混合类别：增强型本体学习、语义数据挖掘以及学习与推理系统。我们对所有这些类别进行了全面检查，强调了研究中使用的各种机器学习算法。此外，我们将我们的分类与领域内类似的近期工作以及混合人工智能和神经符号方法进行了比较。",
    "tldr": "通过系统文献综述研究了将机器学习和本体整合的过程，发现了增强型本体学习、语义数据挖掘和学习与推理系统这三种主要的混合类别，比较了不同研究中使用的机器学习算法。",
    "en_tdlr": "Investigated the integration of machine learning and ontologies through a systematic literature review, identified three main categories of hybridization: learning-enhanced ontologies, semantic data mining, and learning and reasoning systems, and compared the various machine learning algorithms used in the studies."
}