{
    "title": "Harmonized Spatial and Spectral Learning for Robust and Generalized Medical Image Segmentation. (arXiv:2401.10373v1 [eess.IV])",
    "abstract": "Deep learning has demonstrated remarkable achievements in medical image segmentation. However, prevailing deep learning models struggle with poor generalization due to (i) intra-class variations, where the same class appears differently in different samples, and (ii) inter-class independence, resulting in difficulties capturing intricate relationships between distinct objects, leading to higher false negative cases. This paper presents a novel approach that synergies spatial and spectral representations to enhance domain-generalized medical image segmentation. We introduce the innovative Spectral Correlation Coefficient objective to improve the model's capacity to capture middle-order features and contextual long-range dependencies. This objective complements traditional spatial objectives by incorporating valuable spectral information. Extensive experiments reveal that optimizing this objective with existing architectures like UNet and TransUNet significantly enhances generalization, ",
    "link": "http://arxiv.org/abs/2401.10373",
    "context": "Title: Harmonized Spatial and Spectral Learning for Robust and Generalized Medical Image Segmentation. (arXiv:2401.10373v1 [eess.IV])\nAbstract: Deep learning has demonstrated remarkable achievements in medical image segmentation. However, prevailing deep learning models struggle with poor generalization due to (i) intra-class variations, where the same class appears differently in different samples, and (ii) inter-class independence, resulting in difficulties capturing intricate relationships between distinct objects, leading to higher false negative cases. This paper presents a novel approach that synergies spatial and spectral representations to enhance domain-generalized medical image segmentation. We introduce the innovative Spectral Correlation Coefficient objective to improve the model's capacity to capture middle-order features and contextual long-range dependencies. This objective complements traditional spatial objectives by incorporating valuable spectral information. Extensive experiments reveal that optimizing this objective with existing architectures like UNet and TransUNet significantly enhances generalization, ",
    "path": "papers/24/01/2401.10373.json",
    "total_tokens": 889,
    "translated_title": "鲁棒且具普适性的医学图像分割的空间和光谱学习的协调",
    "translated_abstract": "深度学习在医学图像分割方面取得了显著的成就。然而，由于类内变异性和类间独立性，现有的深度学习模型在泛化能力上存在困难，同一类在不同样本中表现不同，难以捕捉不同对象之间的复杂关系，从而导致更高的错误负例。本文提出了一种新的方法，通过协调空间和光谱表示来增强领域通用的医学图像分割。我们引入了创新的光谱相关系数目标，以提高模型捕捉中阶特征和上下文长程依赖的能力。这个目标通过融入有价值的光谱信息来补充传统的空间目标。大量实验证明，优化这个目标与现有的UNet和TransUNet架构显著提高了泛化能力。",
    "tldr": "本文提出了一种鲁棒且具普适性的医学图像分割方法，通过协调空间和光谱表示，引入光谱相关系数目标来提高对中阶特征和上下文长程依赖的捕捉能力，从而显著增强了泛化能力。",
    "en_tdlr": "This paper proposes a robust and generalized approach for medical image segmentation by harmonizing spatial and spectral representations and introducing a Spectral Correlation Coefficient objective to enhance the capture of middle-order features and contextual long-range dependencies, leading to significant improvement in generalization."
}