{
    "title": "Learning to Manipulate Artistic Images. (arXiv:2401.13976v1 [cs.CV])",
    "abstract": "Recent advancement in computer vision has significantly lowered the barriers to artistic creation. Exemplar-based image translation methods have attracted much attention due to flexibility and controllability. However, these methods hold assumptions regarding semantics or require semantic information as the input, while accurate semantics is not easy to obtain in artistic images. Besides, these methods suffer from cross-domain artifacts due to training data prior and generate imprecise structure due to feature compression in the spatial domain. In this paper, we propose an arbitrary Style Image Manipulation Network (SIM-Net), which leverages semantic-free information as guidance and a region transportation strategy in a self-supervised manner for image generation. Our method balances computational efficiency and high resolution to a certain extent. Moreover, our method facilitates zero-shot style image manipulation. Both qualitative and quantitative experiments demonstrate the superior",
    "link": "http://arxiv.org/abs/2401.13976",
    "context": "Title: Learning to Manipulate Artistic Images. (arXiv:2401.13976v1 [cs.CV])\nAbstract: Recent advancement in computer vision has significantly lowered the barriers to artistic creation. Exemplar-based image translation methods have attracted much attention due to flexibility and controllability. However, these methods hold assumptions regarding semantics or require semantic information as the input, while accurate semantics is not easy to obtain in artistic images. Besides, these methods suffer from cross-domain artifacts due to training data prior and generate imprecise structure due to feature compression in the spatial domain. In this paper, we propose an arbitrary Style Image Manipulation Network (SIM-Net), which leverages semantic-free information as guidance and a region transportation strategy in a self-supervised manner for image generation. Our method balances computational efficiency and high resolution to a certain extent. Moreover, our method facilitates zero-shot style image manipulation. Both qualitative and quantitative experiments demonstrate the superior",
    "path": "papers/24/01/2401.13976.json",
    "total_tokens": 882,
    "translated_title": "学习操纵艺术图像",
    "translated_abstract": "最近计算机视觉的进展显著降低了艺术创作的障碍。基于示例的图像转换方法因其灵活性和可控性而受到广泛关注。然而，这些方法对语义有所假设或需要语义信息作为输入，而在艺术图像中准确的语义信息并不容易获得。此外，由于训练数据先验和在空间域中的特征压缩，这些方法会产生跨域伪影和不精确的结构。本文提出了一种任意风格图像操纵网络（SIM-Net），利用无语义的信息作为引导，并通过自监督方式进行区域传输策略来生成图像。我们的方法在一定程度上平衡了计算效率和高分辨率。此外，我们的方法促进了零样式图像操作。定性和定量实验证明了我们方法的优越性。",
    "tldr": "本文提出了一种利用无语义信息，通过自监督方式进行图像生成的任意风格图像操纵网络。该方法解决了艺术图像中准确语义获取的困难，并避免了跨域伪影和精确结构问题。实验证明了该方法在计算效率和高分辨率方面的优势。",
    "en_tdlr": "This paper proposes an arbitrary Style Image Manipulation Network that utilizes semantic-free information and self-supervised learning for image generation. It addresses the challenges of obtaining accurate semantics in artistic images and avoids cross-domain artifacts and imprecise structure issues. Experimental results demonstrate the advantages of the proposed method in computational efficiency and high resolution."
}