{
    "title": "Attentive Fusion: A Transformer-based Approach to Multimodal Hate Speech Detection. (arXiv:2401.10653v1 [cs.CL])",
    "abstract": "With the recent surge and exponential growth of social media usage, scrutinizing social media content for the presence of any hateful content is of utmost importance. Researchers have been diligently working since the past decade on distinguishing between content that promotes hatred and content that does not. Traditionally, the main focus has been on analyzing textual content. However, recent research attempts have also commenced into the identification of audio-based content. Nevertheless, studies have shown that relying solely on audio or text-based content may be ineffective, as recent upsurge indicates that individuals often employ sarcasm in their speech and writing. To overcome these challenges, we present an approach to identify whether a speech promotes hate or not utilizing both audio and textual representations. Our methodology is based on the Transformer framework that incorporates both audio and text sampling, accompanied by our very own layer called \"Attentive Fusion\". Th",
    "link": "http://arxiv.org/abs/2401.10653",
    "context": "Title: Attentive Fusion: A Transformer-based Approach to Multimodal Hate Speech Detection. (arXiv:2401.10653v1 [cs.CL])\nAbstract: With the recent surge and exponential growth of social media usage, scrutinizing social media content for the presence of any hateful content is of utmost importance. Researchers have been diligently working since the past decade on distinguishing between content that promotes hatred and content that does not. Traditionally, the main focus has been on analyzing textual content. However, recent research attempts have also commenced into the identification of audio-based content. Nevertheless, studies have shown that relying solely on audio or text-based content may be ineffective, as recent upsurge indicates that individuals often employ sarcasm in their speech and writing. To overcome these challenges, we present an approach to identify whether a speech promotes hate or not utilizing both audio and textual representations. Our methodology is based on the Transformer framework that incorporates both audio and text sampling, accompanied by our very own layer called \"Attentive Fusion\". Th",
    "path": "papers/24/01/2401.10653.json",
    "total_tokens": 838,
    "translated_title": "基于Transformer的多模态仇恨言论检测方法：关注融合",
    "translated_abstract": "随着社交媒体使用量的激增和指数增长，审查社交媒体内容中是否存在任何仇恨内容变得非常重要。研究者们自过去十年以来一直致力于区分宣传仇恨和非宣传仇恨的内容。传统上，主要关注的是对文本内容的分析。然而，最近的研究也开始涉及对基于音频的内容的识别。然而，研究表明仅仅依赖音频或基于文本的内容可能是无效的，因为近期的激增表明个体在言辞和写作中经常使用讽刺。为了克服这些挑战，我们提出了一种基于Transformer框架的方法，利用音频和文本表示来判断一段言辞是否宣传了仇恨，同时引入了我们自己的层称为\"关注融合\"。",
    "tldr": "这项研究基于Transformer框架和\"关注融合\"层，采用多模态方法识别仇恨言论，突破了传统的文本分析限制。",
    "en_tdlr": "This research presents a multimodal approach to hate speech detection, utilizing both audio and textual representations with the Transformer framework and an innovative layer called \"Attentive Fusion,\" overcoming the limitations of traditional text analysis."
}