{
    "title": "FRED: Towards a Full Rotation-Equivariance in Aerial Image Object Detection. (arXiv:2401.06159v1 [cs.CV])",
    "abstract": "Rotation-equivariance is an essential yet challenging property in oriented object detection. While general object detectors naturally leverage robustness to spatial shifts due to the translation-equivariance of the conventional CNNs, achieving rotation-equivariance remains an elusive goal. Current detectors deploy various alignment techniques to derive rotation-invariant features, but still rely on high capacity models and heavy data augmentation with all possible rotations. In this paper, we introduce a Fully Rotation-Equivariant Oriented Object Detector (FRED), whose entire process from the image to the bounding box prediction is strictly equivariant. Specifically, we decouple the invariant task (object classification) and the equivariant task (object localization) to achieve end-to-end equivariance. We represent the bounding box as a set of rotation-equivariant vectors to implement rotation-equivariant localization. Moreover, we utilized these rotation-equivariant vectors as offsets",
    "link": "http://arxiv.org/abs/2401.06159",
    "context": "Title: FRED: Towards a Full Rotation-Equivariance in Aerial Image Object Detection. (arXiv:2401.06159v1 [cs.CV])\nAbstract: Rotation-equivariance is an essential yet challenging property in oriented object detection. While general object detectors naturally leverage robustness to spatial shifts due to the translation-equivariance of the conventional CNNs, achieving rotation-equivariance remains an elusive goal. Current detectors deploy various alignment techniques to derive rotation-invariant features, but still rely on high capacity models and heavy data augmentation with all possible rotations. In this paper, we introduce a Fully Rotation-Equivariant Oriented Object Detector (FRED), whose entire process from the image to the bounding box prediction is strictly equivariant. Specifically, we decouple the invariant task (object classification) and the equivariant task (object localization) to achieve end-to-end equivariance. We represent the bounding box as a set of rotation-equivariant vectors to implement rotation-equivariant localization. Moreover, we utilized these rotation-equivariant vectors as offsets",
    "path": "papers/24/01/2401.06159.json",
    "total_tokens": 867,
    "translated_title": "FRED: 实现航空图像目标检测中的完全旋转等变性",
    "translated_abstract": "旋转等变性是定向对象检测中一个重要且具有挑战性的特性。尽管通用对象检测器自然利用传统CNN的平移等变性来提高对空间平移的鲁棒性，但实现旋转等变性仍然是一个难以实现的目标。目前的检测器采用各种对齐技术来得到旋转不变特征，但仍依赖于高容量模型和大量数据增强来处理所有可能旋转。在本文中，我们引入了一个完全旋转等变的定向对象检测器（FRED），其从图像到边界框预测的整个过程都是严格等变的。具体来说，我们将不变的任务（对象分类）和等变的任务（对象定位）解耦，以实现端到端等变性。我们将边界框表示为一组旋转等变向量，以实现旋转等变的定位。此外，我们还利用这些旋转等变向量作为偏移量。",
    "tldr": "FRED是一个实现航空图像目标检测中完全旋转等变性的模型，通过解耦不变任务和等变任务实现端到端的等变性，将边界框表示为旋转等变向量。",
    "en_tdlr": "FRED is a model that achieves full rotation-equivariance in aerial image object detection by decoupling the invariant task and the equivariant task, representing bounding boxes as rotation-equivariant vectors."
}