{
    "title": "Document Set Expansion with Positive-Unlabeled Learning: A Density Estimation-based Approach. (arXiv:2401.11145v1 [cs.LG])",
    "abstract": "Document set expansion aims to identify relevant documents from a large collection based on a small set of documents that are on a fine-grained topic. Previous work shows that PU learning is a promising method for this task. However, some serious issues remain unresolved, i.e. typical challenges that PU methods suffer such as unknown class prior and imbalanced data, and the need for transductive experimental settings. In this paper, we propose a novel PU learning framework based on density estimation, called puDE, that can handle the above issues. The advantage of puDE is that it neither constrained to the SCAR assumption and nor require any class prior knowledge. We demonstrate the effectiveness of the proposed method using a series of real-world datasets and conclude that our method is a better alternative for the DSE task.",
    "link": "http://arxiv.org/abs/2401.11145",
    "context": "Title: Document Set Expansion with Positive-Unlabeled Learning: A Density Estimation-based Approach. (arXiv:2401.11145v1 [cs.LG])\nAbstract: Document set expansion aims to identify relevant documents from a large collection based on a small set of documents that are on a fine-grained topic. Previous work shows that PU learning is a promising method for this task. However, some serious issues remain unresolved, i.e. typical challenges that PU methods suffer such as unknown class prior and imbalanced data, and the need for transductive experimental settings. In this paper, we propose a novel PU learning framework based on density estimation, called puDE, that can handle the above issues. The advantage of puDE is that it neither constrained to the SCAR assumption and nor require any class prior knowledge. We demonstrate the effectiveness of the proposed method using a series of real-world datasets and conclude that our method is a better alternative for the DSE task.",
    "path": "papers/24/01/2401.11145.json",
    "total_tokens": 808,
    "translated_title": "使用基于密度估计的正-负学习方法的文档集扩展",
    "translated_abstract": "文档集扩展旨在基于一组精细主题的小型文档集合，从大型集合中识别相关文档。先前的研究表明，正-负学习是这一任务的一种有希望的方法。然而，一些严重问题仍未解决，例如正-负学习方法所面临的典型挑战，如未知类别先验和数据不平衡，以及需要转导型实验设置。在本文中，我们提出了一种基于密度估计的全新正-负学习框架，称为puDE，它可以处理上述问题。puDE的优势在于它既不受限于SCAR假设，也不需要任何类别先验知识。我们使用一系列真实数据集验证了所提出方法的有效性，并得出结论：我们的方法是DSE任务的一种更好的选择。",
    "tldr": "本文提出了一种基于密度估计的正-负学习框架，可以处理文档集扩展任务中存在的问题，并证明其在真实数据集上的有效性。",
    "en_tdlr": "This paper proposes a novel positive-unlabeled learning framework based on density estimation, called puDE, for document set expansion task. It addresses the unresolved challenges in PU learning methods and demonstrates its effectiveness on real-world datasets."
}