{
    "title": "Faster ISNet for Background Bias Mitigation on Deep Neural Networks",
    "abstract": "arXiv:2401.08409v2 Announce Type: replace-cross  Abstract: Bias or spurious correlations in image backgrounds can impact neural networks, causing shortcut learning (Clever Hans Effect) and hampering generalization to real-world data. ISNet, a recently introduced architecture, proposed the optimization of Layer-Wise Relevance Propagation (LRP, an explanation technique) heatmaps, to mitigate the influence of backgrounds on deep classifiers. However, ISNet's training time scales linearly with the number of classes in an application. Here, we propose reformulated architectures whose training time becomes independent from this number. Additionally, we introduce a concise and model-agnostic LRP implementation. We challenge the proposed architectures using synthetic background bias, and COVID-19 detection in chest X-rays, an application that commonly presents background bias. The networks hindered background attention and shortcut learning, surpassing multiple state-of-the-art models on out-o",
    "link": "https://arxiv.org/abs/2401.08409",
    "context": "Title: Faster ISNet for Background Bias Mitigation on Deep Neural Networks\nAbstract: arXiv:2401.08409v2 Announce Type: replace-cross  Abstract: Bias or spurious correlations in image backgrounds can impact neural networks, causing shortcut learning (Clever Hans Effect) and hampering generalization to real-world data. ISNet, a recently introduced architecture, proposed the optimization of Layer-Wise Relevance Propagation (LRP, an explanation technique) heatmaps, to mitigate the influence of backgrounds on deep classifiers. However, ISNet's training time scales linearly with the number of classes in an application. Here, we propose reformulated architectures whose training time becomes independent from this number. Additionally, we introduce a concise and model-agnostic LRP implementation. We challenge the proposed architectures using synthetic background bias, and COVID-19 detection in chest X-rays, an application that commonly presents background bias. The networks hindered background attention and shortcut learning, surpassing multiple state-of-the-art models on out-o",
    "path": "papers/24/01/2401.08409.json",
    "total_tokens": 894,
    "translated_title": "用于深度神经网络背景偏差缓解的更快ISNet",
    "translated_abstract": "图像背景中的偏见或伪相关性可能会影响神经网络，导致快捷学习（聪明的汉斯效应）并阻碍对真实世界数据的泛化。最近引入的ISNet架构提出了优化逐层相关传播（LRP，一种解释技术）热图，以减轻背景对深度分类器的影响。然而，ISNet的训练时间与应用程序中的类数量成线性关系。在这里，我们提出了经重新构建的架构，其训练时间不再依赖于这个数量。此外，我们引入了一种简明且与模型无关的LRP实现。我们利用合成背景偏见和胸部X光中的COVID-19检测挑战所提出的架构，该应用程序通常存在背景偏见。这些网络阻碍了背景注意力和快捷学习，超越了多个最新模型。",
    "tldr": "提出了一种用于缓解深度神经网络中背景偏见的更快ISNet，通过重新构建架构以减少训练时间并引入一种模型无关的LRP实现，成功阻止了背景注意力和快捷学习，优于多个最新模型。",
    "en_tdlr": "Introduced a faster ISNet for mitigating background biases in deep neural networks, which reduces training time by reformulating architectures and introduces a model-agnostic LRP implementation, successfully inhibiting background attentions and shortcut learning, outperforming multiple state-of-the-art models."
}