{
    "title": "ACP-ESM: A novel framework for classification of anticancer peptides using protein-oriented transformer approach. (arXiv:2401.02124v1 [q-bio.BM])",
    "abstract": "Anticancer peptides (ACPs) are a class of molecules that have gained significant attention in the field of cancer research and therapy. ACPs are short chains of amino acids, the building blocks of proteins, and they possess the ability to selectively target and kill cancer cells. One of the key advantages of ACPs is their ability to selectively target cancer cells while sparing healthy cells to a greater extent. This selectivity is often attributed to differences in the surface properties of cancer cells compared to normal cells. That is why ACPs are being investigated as potential candidates for cancer therapy. ACPs may be used alone or in combination with other treatment modalities like chemotherapy and radiation therapy. While ACPs hold promise as a novel approach to cancer treatment, there are challenges to overcome, including optimizing their stability, improving selectivity, and enhancing their delivery to cancer cells, continuous increasing in number of peptide sequences, develo",
    "link": "http://arxiv.org/abs/2401.02124",
    "context": "Title: ACP-ESM: A novel framework for classification of anticancer peptides using protein-oriented transformer approach. (arXiv:2401.02124v1 [q-bio.BM])\nAbstract: Anticancer peptides (ACPs) are a class of molecules that have gained significant attention in the field of cancer research and therapy. ACPs are short chains of amino acids, the building blocks of proteins, and they possess the ability to selectively target and kill cancer cells. One of the key advantages of ACPs is their ability to selectively target cancer cells while sparing healthy cells to a greater extent. This selectivity is often attributed to differences in the surface properties of cancer cells compared to normal cells. That is why ACPs are being investigated as potential candidates for cancer therapy. ACPs may be used alone or in combination with other treatment modalities like chemotherapy and radiation therapy. While ACPs hold promise as a novel approach to cancer treatment, there are challenges to overcome, including optimizing their stability, improving selectivity, and enhancing their delivery to cancer cells, continuous increasing in number of peptide sequences, develo",
    "path": "papers/24/01/2401.02124.json",
    "total_tokens": 912,
    "translated_title": "ACP-ESM:一种使用以蛋白质为导向的Transformer方法进行抗癌肽分类的新框架",
    "translated_abstract": "抗癌肽(ACPs)是一类在癌症研究和治疗领域引起重视的分子。 ACPs是由氨基酸构成的短链，是蛋白质的构建基块，并具有选择性靶向和杀死癌细胞的能力。 ACPs之所以具有针对癌细胞的选择性，往往归因于癌细胞表面特性与正常细胞的差异。因此，ACP被认为是癌症治疗的潜在候选药物。ACPs可以单独使用或与化疗和放疗等治疗方式联合使用。虽然ACP作为一种新型癌症治疗方法具有潜力，但仍需克服一些挑战，包括优化其稳定性，改善选择性，提高对癌细胞的传递性，并且应对肽序列数量的不断增加。",
    "tldr": "ACP-ESM是一个使用以蛋白质为导向的Transformer方法的新框架，用于分类抗癌肽。这种方法可以优化抗癌肽的稳定性，改善选择性，并提高对癌细胞的传递性。"
}