{
    "title": "Almost Perfect Shadow Prices. (arXiv:2401.00970v1 [q-fin.PM])",
    "abstract": "Shadow prices simplify the derivation of optimal trading strategies in markets with transaction costs by transferring optimization into a more tractable, frictionless market. This paper establishes that a na\\\"ive shadow price Ansatz for maximizing long term returns given average volatility yields a strategy that is, for small bid-ask-spreads, asymptotically optimal at third order. Considering the second-order impact of transaction costs, such a strategy is essentially optimal. However, for risk aversion different from one, we devise alternative strategies that outperform the shadow market at fourth order. Finally, it is shown that the risk-neutral objective rules out the existence of shadow prices.",
    "link": "http://arxiv.org/abs/2401.00970",
    "context": "Title: Almost Perfect Shadow Prices. (arXiv:2401.00970v1 [q-fin.PM])\nAbstract: Shadow prices simplify the derivation of optimal trading strategies in markets with transaction costs by transferring optimization into a more tractable, frictionless market. This paper establishes that a na\\\"ive shadow price Ansatz for maximizing long term returns given average volatility yields a strategy that is, for small bid-ask-spreads, asymptotically optimal at third order. Considering the second-order impact of transaction costs, such a strategy is essentially optimal. However, for risk aversion different from one, we devise alternative strategies that outperform the shadow market at fourth order. Finally, it is shown that the risk-neutral objective rules out the existence of shadow prices.",
    "path": "papers/24/01/2401.00970.json",
    "total_tokens": 829,
    "translated_title": "几乎完美的阴影价格",
    "translated_abstract": "阴影价格通过将优化转移到一个更易处理的无摩擦市场中，简化了在存在交易成本的市场中推导最优交易策略。本文证明了，在平均波动性给定下，使用一个朴素的阴影价格方法来最大化长期回报能够得到一个在小买卖价差情况下渐近地达到三阶最优的交易策略。考虑交易成本的二阶影响，这样的策略基本上是最优的。然而，对于不同风险厌恶程度的情况，我们设计了一些优于阴影市场的四阶交易策略。最后，我们证明了风险中性目标排除了阴影价格的存在。",
    "tldr": "本文研究了在存在交易成本的市场中阴影价格的应用，证明了在平均波动性给定下使用朴素的阴影价格方法可以得到渐近达到三阶最优的交易策略，并提出了在不同风险厌恶程度下优于阴影市场的四阶交易策略。此外，还证明了风险中性目标排除了阴影价格的存在。",
    "en_tdlr": "This paper investigates the application of shadow prices in markets with transaction costs and establishes that using a na\\\"ive shadow price approach can lead to asymptotically optimal trading strategies at third order under certain conditions, and alternative strategies outperform the shadow market at fourth order for different levels of risk aversion. Additionally, it is shown that the existence of shadow prices is ruled out under a risk-neutral objective."
}