{
    "title": "Seeing the roads through the trees: A benchmark for modeling spatial dependencies with aerial imagery. (arXiv:2401.06762v1 [cs.CV])",
    "abstract": "Fully understanding a complex high-resolution satellite or aerial imagery scene often requires spatial reasoning over a broad relevant context. The human object recognition system is able to understand object in a scene over a long-range relevant context. For example, if a human observes an aerial scene that shows sections of road broken up by tree canopy, then they will be unlikely to conclude that the road has actually been broken up into disjoint pieces by trees and instead think that the canopy of nearby trees is occluding the road. However, there is limited research being conducted to understand long-range context understanding of modern machine learning models. In this work we propose a road segmentation benchmark dataset, Chesapeake Roads Spatial Context (RSC), for evaluating the spatial long-range context understanding of geospatial machine learning models and show how commonly used semantic segmentation models can fail at this task. For example, we show that a U-Net trained to",
    "link": "http://arxiv.org/abs/2401.06762",
    "context": "Title: Seeing the roads through the trees: A benchmark for modeling spatial dependencies with aerial imagery. (arXiv:2401.06762v1 [cs.CV])\nAbstract: Fully understanding a complex high-resolution satellite or aerial imagery scene often requires spatial reasoning over a broad relevant context. The human object recognition system is able to understand object in a scene over a long-range relevant context. For example, if a human observes an aerial scene that shows sections of road broken up by tree canopy, then they will be unlikely to conclude that the road has actually been broken up into disjoint pieces by trees and instead think that the canopy of nearby trees is occluding the road. However, there is limited research being conducted to understand long-range context understanding of modern machine learning models. In this work we propose a road segmentation benchmark dataset, Chesapeake Roads Spatial Context (RSC), for evaluating the spatial long-range context understanding of geospatial machine learning models and show how commonly used semantic segmentation models can fail at this task. For example, we show that a U-Net trained to",
    "path": "papers/24/01/2401.06762.json",
    "total_tokens": 925,
    "translated_title": "通过树木看到道路：基于航空图像的空间依赖建模基准研究",
    "translated_abstract": "全面理解复杂的高分辨率卫星或航空图像场景通常需要对广泛相关的背景进行空间推理。人类物体识别系统能够在场景中理解长距离相关的背景。例如，如果人类观察到一个显示道路被树冠分割的航空场景，他们不太可能得出道路实际上被树木分割成了不连续的片段，而更可能认为附近树木的冠层遮挡了道路。然而，目前关于现代机器学习模型理解长距离背景的研究相对有限。在这项工作中，我们提出了一个道路分割基准数据集，切萨皮克道路空间背景（RSC），用于评估地理空间机器学习模型的空间长距离背景理解能力，并展示了常用的语义分割模型在这一任务上的失败。例如，我们展示了一个训练有素的U-Net模型在该任务上的表现失败。",
    "tldr": "本研究针对现代机器学习模型理解复杂高分辨率卫星或航空图像场景中的长距离背景问题，提出了一个道路分割基准数据集，展示了常用语义分割模型在该任务上的失败。"
}