{
    "title": "Parametric Matrix Models. (arXiv:2401.11694v2 [cs.LG] UPDATED)",
    "abstract": "We present a general class of machine learning algorithms called parametric matrix models. Parametric matrix models are based on matrix equations, and the design is motivated by the efficiency of reduced basis methods for approximating solutions of parametric equations. The dependent variables can be defined implicitly or explicitly, and the equations may use algebraic, differential, or integral relations. Parametric matrix models can be trained with empirical data only, and no high-fidelity model calculations are needed. While originally designed for scientific computing, parametric matrix models are universal function approximators that can be applied to general machine learning problems. After introducing the underlying theory, we apply parametric matrix models to a series of different challenges that show their performance for a wide range of problems. For all the challenges tested here, parametric matrix models produce accurate results within a computational framework that allows ",
    "link": "http://arxiv.org/abs/2401.11694",
    "context": "Title: Parametric Matrix Models. (arXiv:2401.11694v2 [cs.LG] UPDATED)\nAbstract: We present a general class of machine learning algorithms called parametric matrix models. Parametric matrix models are based on matrix equations, and the design is motivated by the efficiency of reduced basis methods for approximating solutions of parametric equations. The dependent variables can be defined implicitly or explicitly, and the equations may use algebraic, differential, or integral relations. Parametric matrix models can be trained with empirical data only, and no high-fidelity model calculations are needed. While originally designed for scientific computing, parametric matrix models are universal function approximators that can be applied to general machine learning problems. After introducing the underlying theory, we apply parametric matrix models to a series of different challenges that show their performance for a wide range of problems. For all the challenges tested here, parametric matrix models produce accurate results within a computational framework that allows ",
    "path": "papers/24/01/2401.11694.json",
    "total_tokens": 858,
    "translated_title": "参数矩阵模型",
    "translated_abstract": "我们提出了一种称为参数矩阵模型的通用机器学习算法。参数矩阵模型基于矩阵方程，并且其设计受到了用于近似解参数方程的简化基础方法的效率启发。依赖变量可以隐式或显式定义，并且方程可以使用代数、微分或积分关系。参数矩阵模型可以仅使用经验数据进行训练，不需要高保真度模型计算。虽然最初设计用于科学计算，但参数矩阵模型是一种可以应用于通用机器学习问题的通用函数逼近器。在介绍基础理论之后，我们将参数矩阵模型应用于一系列不同的挑战，展示了它们在各种问题上的性能。对于所有在这里测试的挑战，参数矩阵模型在允许计算的框架内产生准确的结果。",
    "tldr": "参数矩阵模型是一种通用机器学习算法，基于矩阵方程设计，通过简化基础方法进行近似解参数方程。它可以仅使用经验数据进行训练，适用于各种机器学习问题，并在计算框架内产生准确的结果。",
    "en_tdlr": "Parametric matrix models are a general class of machine learning algorithms that approximate solutions of parametric equations based on matrix equations. They can be trained with empirical data only, and are applicable to various machine learning problems, producing accurate results within a computational framework."
}