{
    "title": "Indexing Portuguese NLP Resources with PT-Pump-Up. (arXiv:2401.15400v1 [cs.CL])",
    "abstract": "The recent advances in natural language processing (NLP) are linked to training processes that require vast amounts of corpora. Access to this data is commonly not a trivial process due to resource dispersion and the need to maintain these infrastructures online and up-to-date. New developments in NLP are often compromised due to the scarcity of data or lack of a shared repository that works as an entry point to the community. This is especially true in low and mid-resource languages, such as Portuguese, which lack data and proper resource management infrastructures. In this work, we propose PT-Pump-Up, a set of tools that aim to reduce resource dispersion and improve the accessibility to Portuguese NLP resources. Our proposal is divided into four software components: a) a web platform to list the available resources; b) a client-side Python package to simplify the loading of Portuguese NLP resources; c) an administrative Python package to manage the platform and d) a public GitHub rep",
    "link": "http://arxiv.org/abs/2401.15400",
    "context": "Title: Indexing Portuguese NLP Resources with PT-Pump-Up. (arXiv:2401.15400v1 [cs.CL])\nAbstract: The recent advances in natural language processing (NLP) are linked to training processes that require vast amounts of corpora. Access to this data is commonly not a trivial process due to resource dispersion and the need to maintain these infrastructures online and up-to-date. New developments in NLP are often compromised due to the scarcity of data or lack of a shared repository that works as an entry point to the community. This is especially true in low and mid-resource languages, such as Portuguese, which lack data and proper resource management infrastructures. In this work, we propose PT-Pump-Up, a set of tools that aim to reduce resource dispersion and improve the accessibility to Portuguese NLP resources. Our proposal is divided into four software components: a) a web platform to list the available resources; b) a client-side Python package to simplify the loading of Portuguese NLP resources; c) an administrative Python package to manage the platform and d) a public GitHub rep",
    "path": "papers/24/01/2401.15400.json",
    "total_tokens": 860,
    "translated_title": "使用PT-Pump-Up索引葡萄牙自然语言处理资源",
    "translated_abstract": "自然语言处理(NLP)的最新进展与需要大量语料库的训练过程相关。由于资源分散和需要维护这些基础设施的在线和更新，访问这些数据通常不是一个简单的过程。由于缺乏数据和适当的资源管理基础设施，低资源和中资源语言（如葡萄牙语）在NLP方面的新发展往往受到限制。在这项工作中，我们提出了PT-Pump-Up，一套旨在减少资源分散并提高葡萄牙语自然语言处理资源可访问性的工具。我们的提议分为四个软件组件：a）一个列出可用资源的Web平台；b）一个客户端Python软件包，简化葡萄牙语NLP资源的加载；c）一个管理平台的管理Python软件包；d）一个公共GitHub存储库",
    "tldr": "本文介绍了PT-Pump-Up，一套旨在提高葡萄牙语自然语言处理资源可访问性的工具，并包括了一个Web平台、一个客户端Python软件包、一个管理平台的管理Python软件包和一个公共GitHub存储库。",
    "en_tdlr": "This paper presents PT-Pump-Up, a set of tools aimed at improving the accessibility of Portuguese NLP resources, including a web platform, a client-side Python package, an administrative Python package, and a public GitHub repository."
}