{
    "title": "Separable Physics-Informed Neural Networks for the solution of elasticity problems. (arXiv:2401.13486v1 [math.NA])",
    "abstract": "A method for solving elasticity problems based on separable physics-informed neural networks (SPINN) in conjunction with the deep energy method (DEM) is presented. Numerical experiments have been carried out for a number of problems showing that this method has a significantly higher convergence rate and accuracy than the vanilla physics-informed neural networks (PINN) and even SPINN based on a system of partial differential equations (PDEs). In addition, using the SPINN in the framework of DEM approach it is possible to solve problems of the linear theory of elasticity on complex geometries, which is unachievable with the help of PINNs in frames of partial differential equations. Considered problems are very close to the industrial problems in terms of geometry, loading, and material parameters.",
    "link": "http://arxiv.org/abs/2401.13486",
    "context": "Title: Separable Physics-Informed Neural Networks for the solution of elasticity problems. (arXiv:2401.13486v1 [math.NA])\nAbstract: A method for solving elasticity problems based on separable physics-informed neural networks (SPINN) in conjunction with the deep energy method (DEM) is presented. Numerical experiments have been carried out for a number of problems showing that this method has a significantly higher convergence rate and accuracy than the vanilla physics-informed neural networks (PINN) and even SPINN based on a system of partial differential equations (PDEs). In addition, using the SPINN in the framework of DEM approach it is possible to solve problems of the linear theory of elasticity on complex geometries, which is unachievable with the help of PINNs in frames of partial differential equations. Considered problems are very close to the industrial problems in terms of geometry, loading, and material parameters.",
    "path": "papers/24/01/2401.13486.json",
    "total_tokens": 814,
    "translated_title": "分离的物理信息神经网络用于弹性问题的求解",
    "translated_abstract": "本文提出了一种基于分离的物理信息神经网络（SPINN）和深度能量方法（DEM）的弹性问题求解方法。通过数值实验，证明该方法的收敛速度和精度显著高于传统的物理信息神经网络（PINN）以及基于偏微分方程（PDEs）的SPINN。此外，利用SPINN在DEM方法框架下，还可以解决复杂几何体上的线性弹性理论问题，而传统的PINN在偏微分方程框架下无法实现。所考虑的问题在几何形状、加载和材料参数方面非常接近工业问题。",
    "tldr": "本文提出了一种基于分离的物理信息神经网络（SPINN）和深度能量方法（DEM）的弹性问题求解方法，该方法在收敛速度和精度上显著优于传统的物理信息神经网络（PINN），并且在复杂几何体上的线性弹性理论问题方面具有应用潜力。"
}