{
    "title": "Personality Trait Inference Via Mobile Phone Sensors: A Machine Learning Approach. (arXiv:2401.10305v1 [eess.SP])",
    "abstract": "This study provides evidence that personality can be reliably predicted from activity data collected through mobile phone sensors. Employing a set of well informed indicators calculable from accelerometer records and movement patterns, we were able to predict users' personality up to a 0.78 F1 score on a two class problem. Given the fast growing number of data collected from mobile phones, our novel personality indicators open the door to exciting avenues for future research in social sciences. Our results reveal distinct behavioral patterns that proved to be differentially predictive of big five personality traits. They potentially enable cost effective, questionnaire free investigation of personality related questions at an unprecedented scale. Overall, this paper shows how a combination of rich behavioral data obtained with smartphone sensing and the use of machine learning techniques can help to advance personality research and can inform both practitioners and researchers about th",
    "link": "http://arxiv.org/abs/2401.10305",
    "context": "Title: Personality Trait Inference Via Mobile Phone Sensors: A Machine Learning Approach. (arXiv:2401.10305v1 [eess.SP])\nAbstract: This study provides evidence that personality can be reliably predicted from activity data collected through mobile phone sensors. Employing a set of well informed indicators calculable from accelerometer records and movement patterns, we were able to predict users' personality up to a 0.78 F1 score on a two class problem. Given the fast growing number of data collected from mobile phones, our novel personality indicators open the door to exciting avenues for future research in social sciences. Our results reveal distinct behavioral patterns that proved to be differentially predictive of big five personality traits. They potentially enable cost effective, questionnaire free investigation of personality related questions at an unprecedented scale. Overall, this paper shows how a combination of rich behavioral data obtained with smartphone sensing and the use of machine learning techniques can help to advance personality research and can inform both practitioners and researchers about th",
    "path": "papers/24/01/2401.10305.json",
    "total_tokens": 970,
    "translated_title": "通过手机传感器推断个性特征：一种机器学习方法",
    "translated_abstract": "该研究提供了证据表明，可以通过手机传感器收集的活动数据可靠地预测个性特征。通过加速度计记录和运动模式计算得出一组知情指标，我们能够在两类问题上预测用户的个性特征，达到了0.78的F1分数。鉴于手机收集数据的快速增长，我们的新颖个性特征指标为社会科学未来研究开辟了令人兴奋的途径。我们的研究结果揭示了不同行为模式，它们被证明有差异性地预测了五大人格特征。它们有潜力以成本效益高、无问卷调查的方式，在前所未有的规模上研究与个性相关的问题。总体而言，该论文展示了使用智能手机传感和机器学习技术获得丰富行为数据的组合如何帮助推动个性研究，并且可以向从业者和研究人员提供信息。",
    "tldr": "该研究通过手机传感器收集的活动数据可靠地预测了个性特征，这些研究成果为社会科学研究提供了新的途径。通过使用智能手机传感和机器学习技术，可以以成本效益高、无问卷调查的方式对个性相关问题进行研究。这些发现有助于推动个性研究，并且可以为从业者和研究人员提供信息。"
}