{
    "title": "Polynomial time auditing of statistical subgroup fairness for Gaussian data. (arXiv:2401.16439v1 [cs.LG])",
    "abstract": "We study the problem of auditing classifiers with the notion of statistical subgroup fairness. Kearns et al. (2018) has shown that the problem of auditing combinatorial subgroups fairness is as hard as agnostic learning. Essentially all work on remedying statistical measures of discrimination against subgroups assumes access to an oracle for this problem, despite the fact that no efficient algorithms are known for it. If we assume the data distribution is Gaussian, or even merely log-concave, then a recent line of work has discovered efficient agnostic learning algorithms for halfspaces. Unfortunately, the boosting-style reductions given by Kearns et al. required the agnostic learning algorithm to succeed on reweighted distributions that may not be log-concave, even if the original data distribution was. In this work, we give positive and negative results on auditing for the Gaussian distribution: On the positive side, we an alternative approach to leverage these advances in agnostic l",
    "link": "http://arxiv.org/abs/2401.16439",
    "context": "Title: Polynomial time auditing of statistical subgroup fairness for Gaussian data. (arXiv:2401.16439v1 [cs.LG])\nAbstract: We study the problem of auditing classifiers with the notion of statistical subgroup fairness. Kearns et al. (2018) has shown that the problem of auditing combinatorial subgroups fairness is as hard as agnostic learning. Essentially all work on remedying statistical measures of discrimination against subgroups assumes access to an oracle for this problem, despite the fact that no efficient algorithms are known for it. If we assume the data distribution is Gaussian, or even merely log-concave, then a recent line of work has discovered efficient agnostic learning algorithms for halfspaces. Unfortunately, the boosting-style reductions given by Kearns et al. required the agnostic learning algorithm to succeed on reweighted distributions that may not be log-concave, even if the original data distribution was. In this work, we give positive and negative results on auditing for the Gaussian distribution: On the positive side, we an alternative approach to leverage these advances in agnostic l",
    "path": "papers/24/01/2401.16439.json",
    "total_tokens": 915,
    "translated_title": "多项式时间下对高斯数据进行统计子组不公平性审计的研究",
    "translated_abstract": "我们研究了使用统计子组不公平性概念对分类器进行审计的问题。Kearns等人（2018）已经表明，审计组合子组公平性的问题与无偏学习一样困难。尽管对于这个问题没有已知的高效算法，但几乎所有解决对子组的统计歧视度量的工作都假设可以访问此问题的预言机。如果我们假设数据分布是高斯分布，甚至仅是寻常对数凹曲分布，那么最近的一系列工作已经发现了高效的无偏学习算法来学习半空间。不幸的是，Kearns等人给出的提升风格的规约要求无偏学习算法在可能不是寻常对数凹的重新加权分布上成功，即使原始数据分布是寻常对数凹的。在这项工作中，我们对高斯分布的审计结果给出了正面和负面的结果：在正面方面，我们提供了一个替代方法来利用这些无偏学习的进展。",
    "tldr": "这篇论文研究了使用统计子组不公平性概念对分类器进行审计的问题，并给出了对高斯分布的审计结果。他们提供了一种替代方法来利用无偏学习的进展。",
    "en_tdlr": "This paper studies the problem of auditing classifiers with the notion of statistical subgroup fairness and provides positive and negative results on auditing for the Gaussian distribution. They offer an alternative approach to leverage the advances in agnostic learning."
}