{
    "title": "Unitxt: Flexible, Shareable and Reusable Data Preparation and Evaluation for Generative AI. (arXiv:2401.14019v1 [cs.CL])",
    "abstract": "In the dynamic landscape of generative NLP, traditional text processing pipelines limit research flexibility and reproducibility, as they are tailored to specific dataset, task, and model combinations. The escalating complexity, involving system prompts, model-specific formats, instructions, and more, calls for a shift to a structured, modular, and customizable solution. Addressing this need, we present Unitxt, an innovative library for customizable textual data preparation and evaluation tailored to generative language models. Unitxt natively integrates with common libraries like HuggingFace and LM-eval-harness and deconstructs processing flows into modular components, enabling easy customization and sharing between practitioners. These components encompass model-specific formats, task prompts, and many other comprehensive dataset processing definitions. The Unitxt-Catalog centralizes these components, fostering collaboration and exploration in modern textual data workflows. Beyond be",
    "link": "http://arxiv.org/abs/2401.14019",
    "context": "Title: Unitxt: Flexible, Shareable and Reusable Data Preparation and Evaluation for Generative AI. (arXiv:2401.14019v1 [cs.CL])\nAbstract: In the dynamic landscape of generative NLP, traditional text processing pipelines limit research flexibility and reproducibility, as they are tailored to specific dataset, task, and model combinations. The escalating complexity, involving system prompts, model-specific formats, instructions, and more, calls for a shift to a structured, modular, and customizable solution. Addressing this need, we present Unitxt, an innovative library for customizable textual data preparation and evaluation tailored to generative language models. Unitxt natively integrates with common libraries like HuggingFace and LM-eval-harness and deconstructs processing flows into modular components, enabling easy customization and sharing between practitioners. These components encompass model-specific formats, task prompts, and many other comprehensive dataset processing definitions. The Unitxt-Catalog centralizes these components, fostering collaboration and exploration in modern textual data workflows. Beyond be",
    "path": "papers/24/01/2401.14019.json",
    "total_tokens": 896,
    "translated_title": "Unitxt：用于生成式人工智能的灵活、可共享和可复用数据准备与评估",
    "translated_abstract": "在生成式自然语言处理（NLP）的动态环境中，传统的文本处理流程限制了研究的灵活性和可重现性，因为它们针对特定的数据集、任务和模型组合进行了定制。随着系统提示、模型特定格式、指令等越来越复杂，需要转向一种结构化、模块化和可定制的解决方案。为满足这一需求，我们提出了Unitxt，这是一个创新的库，专为生成式语言模型定制的文本数据准备和评估而设计。Unitxt与HuggingFace和LM-eval-harness等常用库进行了本地集成，并将处理流程分解为模块化组件，实现了易于定制和共享的功能。这些组件包括模型特定格式、任务提示和许多其他全面的数据集处理定义。Unitxt-Catalog集中了这些组件，促进了现代文本数据流程中的协作和探索。",
    "tldr": "Unitxt是一个灵活、可共享和可复用的数据准备与评估库，针对生成式语言模型进行定制，实现了结构化、模块化和可定制的解决方案。该库集成了常用的库，将处理流程分解为模块化组件，促进了协作和共享。",
    "en_tdlr": "Unitxt is a flexible, shareable, and reusable library for customizable textual data preparation and evaluation tailored to generative language models. It integrates with common libraries, deconstructs processing flows into modular components, and fosters collaboration and sharing."
}