{
    "title": "Machine Learning-Based Analysis of Ebola Virus' Impact on Gene Expression in Nonhuman Primates. (arXiv:2401.08738v1 [q-bio.GN])",
    "abstract": "This study introduces the Supervised Magnitude-Altitude Scoring (SMAS) methodology, a machine learning-based approach, for analyzing gene expression data obtained from nonhuman primates (NHPs) infected with Ebola virus (EBOV). We utilize a comprehensive dataset of NanoString gene expression profiles from Ebola-infected NHPs, deploying the SMAS system for nuanced host-pathogen interaction analysis. SMAS effectively combines gene selection based on statistical significance and expression changes, employing linear classifiers such as logistic regression to accurately differentiate between RT-qPCR positive and negative NHP samples. A key finding of our research is the identification of IFI6 and IFI27 as critical biomarkers, demonstrating exceptional predictive performance with 100% accuracy and Area Under the Curve (AUC) metrics in classifying various stages of Ebola infection. Alongside IFI6 and IFI27, genes, including MX1, OAS1, and ISG15, were significantly upregulated, highlighting the",
    "link": "http://arxiv.org/abs/2401.08738",
    "context": "Title: Machine Learning-Based Analysis of Ebola Virus' Impact on Gene Expression in Nonhuman Primates. (arXiv:2401.08738v1 [q-bio.GN])\nAbstract: This study introduces the Supervised Magnitude-Altitude Scoring (SMAS) methodology, a machine learning-based approach, for analyzing gene expression data obtained from nonhuman primates (NHPs) infected with Ebola virus (EBOV). We utilize a comprehensive dataset of NanoString gene expression profiles from Ebola-infected NHPs, deploying the SMAS system for nuanced host-pathogen interaction analysis. SMAS effectively combines gene selection based on statistical significance and expression changes, employing linear classifiers such as logistic regression to accurately differentiate between RT-qPCR positive and negative NHP samples. A key finding of our research is the identification of IFI6 and IFI27 as critical biomarkers, demonstrating exceptional predictive performance with 100% accuracy and Area Under the Curve (AUC) metrics in classifying various stages of Ebola infection. Alongside IFI6 and IFI27, genes, including MX1, OAS1, and ISG15, were significantly upregulated, highlighting the",
    "path": "papers/24/01/2401.08738.json",
    "total_tokens": 969,
    "translated_title": "基于机器学习的非人类灵长类动物中伊波拉病毒对基因表达影响的分析",
    "translated_abstract": "本研究引入了一种基于机器学习的方法，即监督型幅度-高度评分 (SMAS) 方法，用于分析感染伊波拉病毒 (EBOV) 的非人类灵长类动物 (NHPs) 的基因表达数据。我们利用了来自感染伊波拉病毒的 NHPs 的NanoString基因表达数据集，采用SMAS系统进行微妙的宿主-病原体相互作用分析。SMAS有效地结合了基于统计学显著性和表达变化的基因选择，采用线性分类器如逻辑回归以准确区分RT-qPCR阳性和阴性NHP样本。我们研究的一项重要发现是鉴定了IFI6和IFI27作为关键生物标志物，表现出100%的准确性和曲线下面积 (AUC) 指标在分类不同阶段的伊波拉感染中。除IFI6和IFI27外，基因如MX1，OAS1和ISG15显著上调，突出显示了...",
    "tldr": "本研究引入了一种基于机器学习的方法用于分析感染伊波拉病毒的非人类灵长类动物的基因表达数据，发现IFI6和IFI27等基因作为关键生物标志物能有效分类不同阶段的伊波拉感染。",
    "en_tdlr": "This study introduces a machine learning-based approach to analyze gene expression data in nonhuman primates infected with Ebola virus. It identifies IFI6 and IFI27 as critical biomarkers for accurately classifying different stages of Ebola infection."
}