{
    "title": "Privacy-Preserving Sequential Recommendation with Collaborative Confusion. (arXiv:2401.04423v1 [cs.IR])",
    "abstract": "Sequential recommendation has attracted a lot of attention from both academia and industry, however the privacy risks associated to gathering and transferring users' personal interaction data are often underestimated or ignored. Existing privacy-preserving studies are mainly applied to traditional collaborative filtering or matrix factorization rather than sequential recommendation. Moreover, these studies are mostly based on differential privacy or federated learning, which often leads to significant performance degradation, or has high requirements for communication. In this work, we address privacy-preserving from a different perspective. Unlike existing research, we capture collaborative signals of neighbor interaction sequences and directly inject indistinguishable items into the target sequence before the recommendation process begins, thereby increasing the perplexity of the target sequence. Even if the target interaction sequence is obtained by attackers, it is difficult to dis",
    "link": "http://arxiv.org/abs/2401.04423",
    "context": "Title: Privacy-Preserving Sequential Recommendation with Collaborative Confusion. (arXiv:2401.04423v1 [cs.IR])\nAbstract: Sequential recommendation has attracted a lot of attention from both academia and industry, however the privacy risks associated to gathering and transferring users' personal interaction data are often underestimated or ignored. Existing privacy-preserving studies are mainly applied to traditional collaborative filtering or matrix factorization rather than sequential recommendation. Moreover, these studies are mostly based on differential privacy or federated learning, which often leads to significant performance degradation, or has high requirements for communication. In this work, we address privacy-preserving from a different perspective. Unlike existing research, we capture collaborative signals of neighbor interaction sequences and directly inject indistinguishable items into the target sequence before the recommendation process begins, thereby increasing the perplexity of the target sequence. Even if the target interaction sequence is obtained by attackers, it is difficult to dis",
    "path": "papers/24/01/2401.04423.json",
    "total_tokens": 849,
    "translated_title": "基于协同混淆的隐私保护顺序推荐",
    "translated_abstract": "隐私保护的顺序推荐受到学术界和行业的广泛关注，然而对于收集和传输用户个人交互数据所带来的隐私风险往往被低估或忽视。现有的隐私保护研究主要应用于传统的协同过滤或矩阵分解，而非顺序推荐。此外，这些研究大多基于差分隐私或联邦学习，往往导致性能明显下降，或对通信有很高的要求。在这项工作中，我们从不同的角度解决隐私保护问题。与现有研究不同，我们捕捉邻居交互序列的协同信号，并在推荐过程开始前直接将不可区分的项目注入目标序列，从而增加目标序列的困惑度。即使攻击者获得目标交互序列，也很难区分真实数据和注入的数据。",
    "tldr": "该论文提出了一种基于协同混淆的隐私保护顺序推荐方法，通过注入不可区分的项目来增加目标序列的困惑度，从而提高隐私保护性能。"
}