{
    "title": "A white box solution to the black box problem of AI. (arXiv:2401.03093v1 [cs.AI])",
    "abstract": "Artificial intelligence based on neural networks has made significant progress. However, there are concerns about the reliability and security of this approach due to its lack of transparency. This is the black box problem of AI. Here we show how this problem can be solved using symbolic AI, which has a transparent white box nature. The widespread use of symbolic AI is hindered by the opacity of mathematical models and natural language terms, the lack of a unified ontology, and the combinatorial explosion of search options. To solve the AI black box problem and to implement general-purpose symbolic AI, we propose to use deterministic logic cellular automata with rules based on first principles of the general theory of the relevant domain. In this case, the general theory of the relevant domain plays the role of a knowledge base for the cellular automaton inference. A cellular automaton implements automatic parallel logical inference at three levels of organization of a complex system. ",
    "link": "http://arxiv.org/abs/2401.03093",
    "context": "Title: A white box solution to the black box problem of AI. (arXiv:2401.03093v1 [cs.AI])\nAbstract: Artificial intelligence based on neural networks has made significant progress. However, there are concerns about the reliability and security of this approach due to its lack of transparency. This is the black box problem of AI. Here we show how this problem can be solved using symbolic AI, which has a transparent white box nature. The widespread use of symbolic AI is hindered by the opacity of mathematical models and natural language terms, the lack of a unified ontology, and the combinatorial explosion of search options. To solve the AI black box problem and to implement general-purpose symbolic AI, we propose to use deterministic logic cellular automata with rules based on first principles of the general theory of the relevant domain. In this case, the general theory of the relevant domain plays the role of a knowledge base for the cellular automaton inference. A cellular automaton implements automatic parallel logical inference at three levels of organization of a complex system. ",
    "path": "papers/24/01/2401.03093.json",
    "total_tokens": 875,
    "translated_title": "一种解决人工智能黑盒问题的白盒解决方案",
    "translated_abstract": "基于神经网络的人工智能取得了重大进展。然而，由于缺乏透明性，对其可靠性和安全性存在担忧。这就是人工智能的黑盒问题。在这里，我们展示了如何使用符号 AI 来解决这个问题，符号 AI 具有透明的白盒性质。符号 AI 的广泛应用受到数学模型和自然语言术语的不透明性、缺乏统一本体论以及搜索选项的组合爆炸的阻碍。为了解决人工智能的黑盒问题并实现通用的符号 AI，我们提议使用基于相关领域一般理论的确定性逻辑细胞自动机的规则。在这种情况下，相关领域的一般理论起到了细胞自动机推理的知识库的作用。细胞自动机在复杂系统的三个层次上实现自动并行逻辑推理。",
    "tldr": "一种解决人工智能黑盒问题的白盒解决方案是使用基于相关领域一般理论的确定性逻辑细胞自动机的规则，该细胞自动机实现自动并行逻辑推理。"
}