{
    "title": "An income-based approach to modeling commuting distance in the Toronto area. (arXiv:2401.11343v1 [econ.GN])",
    "abstract": "The purpose of this article is to propose a novel model of the effects of changes in shelter and driving costs on car commuting distances in the overheated Toronto housing market from 2011 to 2016. The model borrows from theoretical concepts of microeconomics and urban geography to examine the Toronto housing market. Using 2011 and 2016 Census data for census metropolitan areas (CMAs) and census agglomerations (CAs) in Southern Ontario and computed driving costs, the model of car commuting distance is based on variables of allocation of monthly household income to monthly shelter costs and driving costs as a function of the car driving distance to Toronto. Using this model, we can predict the effect on car commuting distance due to changes in any of the variables. The model also offers an explanation for communities of Toronto car commuters beyond a driving radius that we might expect for daily commuting. The model confirms that increases in shelter costs in the Toronto housing market ",
    "link": "http://arxiv.org/abs/2401.11343",
    "context": "Title: An income-based approach to modeling commuting distance in the Toronto area. (arXiv:2401.11343v1 [econ.GN])\nAbstract: The purpose of this article is to propose a novel model of the effects of changes in shelter and driving costs on car commuting distances in the overheated Toronto housing market from 2011 to 2016. The model borrows from theoretical concepts of microeconomics and urban geography to examine the Toronto housing market. Using 2011 and 2016 Census data for census metropolitan areas (CMAs) and census agglomerations (CAs) in Southern Ontario and computed driving costs, the model of car commuting distance is based on variables of allocation of monthly household income to monthly shelter costs and driving costs as a function of the car driving distance to Toronto. Using this model, we can predict the effect on car commuting distance due to changes in any of the variables. The model also offers an explanation for communities of Toronto car commuters beyond a driving radius that we might expect for daily commuting. The model confirms that increases in shelter costs in the Toronto housing market ",
    "path": "papers/24/01/2401.11343.json",
    "total_tokens": 1000,
    "translated_title": "一个基于收入的模型来观察多伦多地区通勤距离",
    "translated_abstract": "本文的目的是提出一个新颖的模型，用于研究2011年至2016年间多伦多房地产市场的住房和驾驶成本变化对汽车通勤距离的影响。该模型结合了微观经济学和城市地理学的理论概念来研究多伦多房地产市场。通过使用2011年和2016年人口普查数据以及计算的驾车成本，该模型基于月收入分配给月住房费用和驾车费用，并考虑到汽车驾驶距离多伦多的变量来预测汽车通勤距离的影响。该模型还解释了多伦多车辆通勤者超出日常通勤半径的社区情况。该模型证实，多伦多房地产市场的住房成本增加会导致汽车通勤距离的增加。",
    "tldr": "本文提出了一个基于收入的模型，研究了多伦多房地产市场的住房和驾驶成本变化对汽车通勤距离的影响。模型通过考虑收入分配和驾车距离等变量，可以预测不同因素对通勤距离的影响，并解释了超出日常通勤范围的情况。研究结果显示，多伦多房地产市场的住房成本增加会导致汽车通勤距离的增加。"
}