{
    "title": "Strategic Usage in a Multi-Learner Setting",
    "abstract": "arXiv:2401.16422v2 Announce Type: replace  Abstract: Real-world systems often involve some pool of users choosing between a set of services. With the increase in popularity of online learning algorithms, these services can now self-optimize, leveraging data collected on users to maximize some reward such as service quality. On the flipside, users may strategically choose which services to use in order to pursue their own reward functions, in the process wielding power over which services can see and use their data. Extensive prior research has been conducted on the effects of strategic users in single-service settings, with strategic behavior manifesting in the manipulation of observable features to achieve a desired classification; however, this can often be costly or unattainable for users and fails to capture the full behavior of multi-service dynamic systems. As such, we analyze a setting in which strategic users choose among several available services in order to pursue positive c",
    "link": "https://arxiv.org/abs/2401.16422",
    "context": "Title: Strategic Usage in a Multi-Learner Setting\nAbstract: arXiv:2401.16422v2 Announce Type: replace  Abstract: Real-world systems often involve some pool of users choosing between a set of services. With the increase in popularity of online learning algorithms, these services can now self-optimize, leveraging data collected on users to maximize some reward such as service quality. On the flipside, users may strategically choose which services to use in order to pursue their own reward functions, in the process wielding power over which services can see and use their data. Extensive prior research has been conducted on the effects of strategic users in single-service settings, with strategic behavior manifesting in the manipulation of observable features to achieve a desired classification; however, this can often be costly or unattainable for users and fails to capture the full behavior of multi-service dynamic systems. As such, we analyze a setting in which strategic users choose among several available services in order to pursue positive c",
    "path": "papers/24/01/2401.16422.json",
    "total_tokens": 800,
    "translated_title": "在多学习者环境中的战略应用",
    "translated_abstract": "现实世界中的系统通常涉及一些用户在一系列服务之间进行选择。随着在线学习算法的流行，这些服务现在可以自我优化，利用对用户收集的数据来最大化某种奖励，如服务质量。然而，用户可能会战略性地选择要使用的服务，以追求他们自己的奖励函数，从而对哪些服务能够看到并使用他们的数据拥有权力。先前已对单服务设置中战略用户的影响进行了广泛研究，战略行为体现在操纵可观察特征以实现期望的分类上；然而，这对用户来说往往会很昂贵或难以实现，并且未能捕捉到多服务动态系统的全部行为。因此，我们分析了一个设置，其中战略用户在几个可用服务中进行选择，以追求积极的收益。",
    "tldr": "在多学习者环境中，本研究分析了用户在多个可用服务中进行选择的战略行为对系统行为的影响。",
    "en_tdlr": "This study analyzes the impact of users' strategic behavior in choosing among multiple available services in a multi-learner setting on system behavior."
}