{
    "title": "Strategic formation of production networks. (arXiv:2401.08929v1 [econ.TH])",
    "abstract": "We provide a strategic model of the formation of production networks that subsumes the standard general equilibrium approach. The objective of firms in our setting is to choose their supply relationships so as to maximize their profit at the general equilibrium that unfolds. We show that this objective is equivalent to the maximization by the firms of their eigenvector centrality in the production network. As is common in network formation games based on centrality, there are multiple Nash equilibria in our setting. We have investigated the characteristics and the social efficiency of these equilibria in a stylized version of our model representing international trade networks. We show that the impact of network structure on social welfare is firstly determined by a trade-off between costs of increasing process complexity and positive spillovers on productivity induced by the diversification of the input mix. We further analyze a variant of our model that accounts for the risks of disr",
    "link": "http://arxiv.org/abs/2401.08929",
    "context": "Title: Strategic formation of production networks. (arXiv:2401.08929v1 [econ.TH])\nAbstract: We provide a strategic model of the formation of production networks that subsumes the standard general equilibrium approach. The objective of firms in our setting is to choose their supply relationships so as to maximize their profit at the general equilibrium that unfolds. We show that this objective is equivalent to the maximization by the firms of their eigenvector centrality in the production network. As is common in network formation games based on centrality, there are multiple Nash equilibria in our setting. We have investigated the characteristics and the social efficiency of these equilibria in a stylized version of our model representing international trade networks. We show that the impact of network structure on social welfare is firstly determined by a trade-off between costs of increasing process complexity and positive spillovers on productivity induced by the diversification of the input mix. We further analyze a variant of our model that accounts for the risks of disr",
    "path": "papers/24/01/2401.08929.json",
    "total_tokens": 815,
    "translated_title": "产业网络的战略形成",
    "translated_abstract": "我们提供了一个战略模型来解释产业网络的形成，该模型包含了标准的一般均衡方法。在我们的设置中，企业的目标是选择他们的供应关系以便在发展的一般均衡中最大化利润。我们展示了这个目标等价于企业在生产网络中最大化他们的特征向量中心度。与基于中心度的网络形成博弈中普遍存在的情况一样，我们的设置中存在多个纳什均衡。我们在我们的模型的简化版本中研究了这些均衡的特性和社会效率，这个简化版本代表国际贸易网络。我们展示了网络结构对社会福利的影响首先由增加过程复杂性的成本和通过输入组合多样化引起的生产率溢出之间的权衡来决定。我们进一步分析了我们模型的一个变体，考虑到中断风险。",
    "tldr": "我们提供了一个战略模型来解释产业网络的形成，该模型考虑了企业在生产网络中的中心度，并研究了多个纳什均衡的特性、社会效率以及网络结构对社会福利的影响。"
}