{
    "title": "Topology-Aware Exploration of Energy-Based Models Equilibrium: Toric QC-LDPC Codes and Hyperbolic MET QC-LDPC Codes. (arXiv:2401.14749v1 [cs.IT])",
    "abstract": "This paper presents a method for achieving equilibrium in the ISING Hamiltonian when confronted with unevenly distributed charges on an irregular grid. Employing (Multi-Edge) QC-LDPC codes and the Boltzmann machine, our approach involves dimensionally expanding the system, substituting charges with circulants, and representing distances through circulant shifts. This results in a systematic mapping of the charge system onto a space, transforming the irregular grid into a uniform configuration, applicable to Torical and Circular Hyperboloid Topologies. The paper covers fundamental definitions and notations related to QC-LDPC Codes, Multi-Edge QC-LDPC codes, and the Boltzmann machine. It explores the marginalization problem in code on the graph probabilistic models for evaluating the partition function, encompassing exact and approximate estimation techniques. Rigorous proof is provided for the attainability of equilibrium states for the Boltzmann machine under Torical and Circular Hyper",
    "link": "http://arxiv.org/abs/2401.14749",
    "context": "Title: Topology-Aware Exploration of Energy-Based Models Equilibrium: Toric QC-LDPC Codes and Hyperbolic MET QC-LDPC Codes. (arXiv:2401.14749v1 [cs.IT])\nAbstract: This paper presents a method for achieving equilibrium in the ISING Hamiltonian when confronted with unevenly distributed charges on an irregular grid. Employing (Multi-Edge) QC-LDPC codes and the Boltzmann machine, our approach involves dimensionally expanding the system, substituting charges with circulants, and representing distances through circulant shifts. This results in a systematic mapping of the charge system onto a space, transforming the irregular grid into a uniform configuration, applicable to Torical and Circular Hyperboloid Topologies. The paper covers fundamental definitions and notations related to QC-LDPC Codes, Multi-Edge QC-LDPC codes, and the Boltzmann machine. It explores the marginalization problem in code on the graph probabilistic models for evaluating the partition function, encompassing exact and approximate estimation techniques. Rigorous proof is provided for the attainability of equilibrium states for the Boltzmann machine under Torical and Circular Hyper",
    "path": "papers/24/01/2401.14749.json",
    "total_tokens": 1088,
    "translated_title": "基于拓扑感知的能量模型均衡探索：Toric QC-LDPC码和Hyperbolic MET QC-LDPC码",
    "translated_abstract": "本文提出了一种在不均匀分布的电荷和不规则网格上实现ISING哈密顿量均衡的方法。采用（多边缘）QC-LDPC码和玻尔兹曼机，我们的方法涉及对系统的维度扩展，用循环物质替代电荷，并通过循环移位表示距离。这导致电荷系统在空间上的系统映射，将不规则网格转化为均匀配置，适用于Torical和Circular Hyperboloid拓扑。本文涵盖了与QC-LDPC码、多边缘QC-LDPC码和玻尔兹曼机相关的基本定义和符号。它探讨了用于评估分区函数的代码在图形概率模型中的边际化问题，包括精确和近似估计技术。本文提供了严格的证明，证明了在Torical和Circular Hyper拓扑下，玻尔兹曼机可以达到均衡状态。",
    "tldr": "本文介绍了一种在不均匀分布的电荷和不规则网格上实现能量模型均衡的方法，通过使用QC-LDPC码和玻尔兹曼机，将系统的维度扩展，将电荷替换为循环物质，并通过循环移位表示距离。通过这种方法，可以将不规则网格转化为均匀配置，适用于不同的拓扑结构。该方法还解决了代码在图形概率模型中的评估问题，并提供了在不同拓扑下玻尔兹曼机达到均衡状态的严格证明。",
    "en_tdlr": "This paper presents a method for achieving equilibrium in energy-based models with unevenly distributed charges on an irregular grid. By using QC-LDPC codes and the Boltzmann machine, the system is dimensionally expanded, charges are substituted with circulants, and distances are represented through circulant shifts. This method transforms the irregular grid into a uniform configuration applicable to various topologies, and provides a rigorous proof of the attainability of equilibrium states for the Boltzmann machine under different topologies."
}