{
    "title": "Is there a size premium for nations?. (arXiv:2401.05116v1 [econ.GN])",
    "abstract": "This paper examines whether there is a premium in country size. We study whether there are significant gains from being a small or a large country in terms of certain socioeconomic indicators and how large this premium is. Using panel data for 200 countries over 50 years, we estimate premia for various sizes of nations across a variety of key economic and socioeconomic performance indicators. We find that smaller countries are richer, have larger governments, and are more prudent in terms of fiscal policies than larger ones. On the other hand, smaller countries seem to be subject to higher absolute and per capita costs for the provision of essential public goods, which may lower their socioeconomic performance in terms of health and education. In terms of economic performance, small countries seem to do better than large countries, compensating for smallness by relying on foreign trade and foreign direct investment. The latter comes at the cost of higher vulnerability to external shock",
    "link": "http://arxiv.org/abs/2401.05116",
    "context": "Title: Is there a size premium for nations?. (arXiv:2401.05116v1 [econ.GN])\nAbstract: This paper examines whether there is a premium in country size. We study whether there are significant gains from being a small or a large country in terms of certain socioeconomic indicators and how large this premium is. Using panel data for 200 countries over 50 years, we estimate premia for various sizes of nations across a variety of key economic and socioeconomic performance indicators. We find that smaller countries are richer, have larger governments, and are more prudent in terms of fiscal policies than larger ones. On the other hand, smaller countries seem to be subject to higher absolute and per capita costs for the provision of essential public goods, which may lower their socioeconomic performance in terms of health and education. In terms of economic performance, small countries seem to do better than large countries, compensating for smallness by relying on foreign trade and foreign direct investment. The latter comes at the cost of higher vulnerability to external shock",
    "path": "papers/24/01/2401.05116.json",
    "total_tokens": 1054,
    "translated_title": "国家规模是否存在溢价？",
    "translated_abstract": "本文研究了国家规模是否存在溢价。我们研究了在某些社会经济指标方面，小国和大国之间是否存在显著的收益差异，并且这种溢价有多大。利用50年来200个国家的面板数据，我们估计了各个国家规模对多种经济和社会经济绩效指标的溢价。我们发现，相对于大国，小国更富有，政府规模更大，并且在财政政策方面更加谨慎。但是，小国似乎需要承担更高的公共产品提供的绝对成本和人均成本，这可能降低它们在健康和教育等社会经济绩效方面的表现。在经济绩效方面，小国似乎比大国表现更好，通过依赖外贸和外直接投资来弥补规模小的不利。后者的代价是更高的对外冲击的脆弱性。",
    "tldr": "本文研究了国家规模是否存在溢价。通过对200个国家50年的面板数据进行分析，作者发现小国相对于大国更富有，政府规模更大，并且在财政政策方面更加谨慎。然而，小国对于提供基本公共产品需要承担更高的成本，这可能降低其在健康和教育等社会经济方面的表现。在经济方面，小国通过依赖外贸和外直接投资来弥补规模上的不利，但也增加了对外冲击的脆弱性。",
    "en_tdlr": "This paper examines whether there is a premium in country size. Based on analysis of panel data for 200 countries over 50 years, the author finds that smaller countries are richer, have larger governments, and are more prudent in terms of fiscal policies than larger ones. However, smaller countries also face higher costs for the provision of essential public goods, which may lower their socioeconomic performance in terms of health and education. In terms of economic performance, small countries compensate for their size by relying on foreign trade and foreign direct investment, but this comes at the cost of higher vulnerability to external shocks."
}