{
    "title": "Navigating Dataset Documentations in AI: A Large-Scale Analysis of Dataset Cards on Hugging Face. (arXiv:2401.13822v1 [cs.LG])",
    "abstract": "Advances in machine learning are closely tied to the creation of datasets. While data documentation is widely recognized as essential to the reliability, reproducibility, and transparency of ML, we lack a systematic empirical understanding of current dataset documentation practices. To shed light on this question, here we take Hugging Face -- one of the largest platforms for sharing and collaborating on ML models and datasets -- as a prominent case study. By analyzing all 7,433 dataset documentation on Hugging Face, our investigation provides an overview of the Hugging Face dataset ecosystem and insights into dataset documentation practices, yielding 5 main findings: (1) The dataset card completion rate shows marked heterogeneity correlated with dataset popularity. (2) A granular examination of each section within the dataset card reveals that the practitioners seem to prioritize Dataset Description and Dataset Structure sections, while the Considerations for Using the Data section rec",
    "link": "http://arxiv.org/abs/2401.13822",
    "context": "Title: Navigating Dataset Documentations in AI: A Large-Scale Analysis of Dataset Cards on Hugging Face. (arXiv:2401.13822v1 [cs.LG])\nAbstract: Advances in machine learning are closely tied to the creation of datasets. While data documentation is widely recognized as essential to the reliability, reproducibility, and transparency of ML, we lack a systematic empirical understanding of current dataset documentation practices. To shed light on this question, here we take Hugging Face -- one of the largest platforms for sharing and collaborating on ML models and datasets -- as a prominent case study. By analyzing all 7,433 dataset documentation on Hugging Face, our investigation provides an overview of the Hugging Face dataset ecosystem and insights into dataset documentation practices, yielding 5 main findings: (1) The dataset card completion rate shows marked heterogeneity correlated with dataset popularity. (2) A granular examination of each section within the dataset card reveals that the practitioners seem to prioritize Dataset Description and Dataset Structure sections, while the Considerations for Using the Data section rec",
    "path": "papers/24/01/2401.13822.json",
    "total_tokens": 939,
    "translated_title": "在AI中浏览数据集文档：Hugging Face数据集卡片的大规模分析",
    "translated_abstract": "机器学习的进展与数据集的创建密切相关。虽然数据文档被广泛认为对于ML的可靠性、可重复性和透明性至关重要，但我们缺乏对当前数据集文档实践的系统实证理解。为了揭示这个问题，我们以Hugging Face为例，这是一个用于共享和协作ML模型和数据集的最大平台。通过分析Hugging Face上的7433个数据集文档，我们的调查提供了Hugging Face数据集生态系统的概览和对数据集文档实践的洞察，得出了5个主要发现：（1）数据集卡片完成率显示出与数据集的受欢迎程度相关的显著异质性。（2）对数据集卡片中的每个部分进行细致的考察表明，从业者似乎更重视数据集描述和数据集结构部分，而对于使用数据的考虑部分更加忽视。",
    "tldr": "本研究通过分析Hugging Face上的数据集文档，提供了Hugging Face数据集生态系统的概览并洞察到数据集文档实践的关键问题。研究发现，数据集卡片完成率与数据集受欢迎程度存在显著异质性，从业者在数据集描述和数据集结构部分更为关注，而对于使用数据的考虑部分较为忽视。",
    "en_tdlr": "This study provides an overview of the Hugging Face dataset ecosystem and insights into dataset documentation practices by analyzing dataset cards. The findings reveal heterogeneity in dataset card completion rate based on dataset popularity, and a focus on dataset description and structure sections over considerations for using the data."
}