{
    "title": "U-Mixer: An Unet-Mixer Architecture with Stationarity Correction for Time Series Forecasting. (arXiv:2401.02236v1 [cs.LG])",
    "abstract": "Time series forecasting is a crucial task in various domains. Caused by factors such as trends, seasonality, or irregular fluctuations, time series often exhibits non-stationary. It obstructs stable feature propagation through deep layers, disrupts feature distributions, and complicates learning data distribution changes. As a result, many existing models struggle to capture the underlying patterns, leading to degraded forecasting performance. In this study, we tackle the challenge of non-stationarity in time series forecasting with our proposed framework called U-Mixer. By combining Unet and Mixer, U-Mixer effectively captures local temporal dependencies between different patches and channels separately to avoid the influence of distribution variations among channels, and merge low- and high-levels features to obtain comprehensive data representations. The key contribution is a novel stationarity correction method, explicitly restoring data distribution by constraining the difference ",
    "link": "http://arxiv.org/abs/2401.02236",
    "context": "Title: U-Mixer: An Unet-Mixer Architecture with Stationarity Correction for Time Series Forecasting. (arXiv:2401.02236v1 [cs.LG])\nAbstract: Time series forecasting is a crucial task in various domains. Caused by factors such as trends, seasonality, or irregular fluctuations, time series often exhibits non-stationary. It obstructs stable feature propagation through deep layers, disrupts feature distributions, and complicates learning data distribution changes. As a result, many existing models struggle to capture the underlying patterns, leading to degraded forecasting performance. In this study, we tackle the challenge of non-stationarity in time series forecasting with our proposed framework called U-Mixer. By combining Unet and Mixer, U-Mixer effectively captures local temporal dependencies between different patches and channels separately to avoid the influence of distribution variations among channels, and merge low- and high-levels features to obtain comprehensive data representations. The key contribution is a novel stationarity correction method, explicitly restoring data distribution by constraining the difference ",
    "path": "papers/24/01/2401.02236.json",
    "total_tokens": 920,
    "translated_title": "U-Mixer: 一种带有稳定性校正的Unet-Mixer时间序列预测架构",
    "translated_abstract": "时间序列预测是各个领域中的关键任务。由于趋势、季节性或不规则波动等因素的影响，时间序列通常呈现非稳态。这阻碍了通过深层次的稳定特征传播，破坏了特征分布，并使学习数据分布变化变得复杂。因此，许多现有模型在捕捉潜在模式方面存在困难，导致预测性能下降。在本研究中，我们通过提出的名为U-Mixer的框架来解决时间序列预测中的非稳态挑战。通过结合Unet和Mixer，U-Mixer有效地捕捉不同块和通道之间的局部时间依赖关系，避免通道之间分布变化的影响，并合并低层和高层特征以获取全面的数据表示。其主要贡献是一种新颖的稳定性校正方法，通过约束差异来明确恢复数据分布。",
    "tldr": "U-Mixer是一种结合Unet和Mixer的框架，通过稳定性校正方法解决时间序列预测中的非稳态挑战，捕捉局部时间依赖关系，并合并特征以获取全面的数据表示。",
    "en_tdlr": "U-Mixer is a framework that combines Unet and Mixer to address the challenge of non-stationarity in time series forecasting. It effectively captures local temporal dependencies, avoids the influence of distribution variations, and merges features to obtain comprehensive data representations. The key contribution is a novel stationarity correction method that restores data distribution."
}