{
    "title": "ViTree: Single-path Neural Tree for Step-wise Interpretable Fine-grained Visual Categorization. (arXiv:2401.17050v1 [cs.CV])",
    "abstract": "As computer vision continues to advance and finds widespread applications across various domains, the need for interpretability in deep learning models becomes paramount. Existing methods often resort to post-hoc techniques or prototypes to explain the decision-making process, which can be indirect and lack intrinsic illustration. In this research, we introduce ViTree, a novel approach for fine-grained visual categorization that combines the popular vision transformer as a feature extraction backbone with neural decision trees. By traversing the tree paths, ViTree effectively selects patches from transformer-processed features to highlight informative local regions, thereby refining representations in a step-wise manner. Unlike previous tree-based models that rely on soft distributions or ensembles of paths, ViTree selects a single tree path, offering a clearer and simpler decision-making process. This patch and path selectivity enhances model interpretability of ViTree, enabling bette",
    "link": "http://arxiv.org/abs/2401.17050",
    "context": "Title: ViTree: Single-path Neural Tree for Step-wise Interpretable Fine-grained Visual Categorization. (arXiv:2401.17050v1 [cs.CV])\nAbstract: As computer vision continues to advance and finds widespread applications across various domains, the need for interpretability in deep learning models becomes paramount. Existing methods often resort to post-hoc techniques or prototypes to explain the decision-making process, which can be indirect and lack intrinsic illustration. In this research, we introduce ViTree, a novel approach for fine-grained visual categorization that combines the popular vision transformer as a feature extraction backbone with neural decision trees. By traversing the tree paths, ViTree effectively selects patches from transformer-processed features to highlight informative local regions, thereby refining representations in a step-wise manner. Unlike previous tree-based models that rely on soft distributions or ensembles of paths, ViTree selects a single tree path, offering a clearer and simpler decision-making process. This patch and path selectivity enhances model interpretability of ViTree, enabling bette",
    "path": "papers/24/01/2401.17050.json",
    "total_tokens": 887,
    "translated_title": "ViTree: 单路径神经树用于逐步可解释的细粒度视觉分类",
    "translated_abstract": "随着计算机视觉的不断发展和广泛应用于各个领域，深度学习模型的可解释性变得至关重要。现有的方法常常采用事后技术或原型来解释决策过程，这种方法可能间接并且缺乏内在的说明。在这项研究中，我们引入了ViTree，一种用于细粒度视觉分类的新方法，它将流行的视觉变换器作为特征提取骨干，与神经决策树相结合。通过遍历树路径，ViTree有效地从变换器处理的特征中选择补丁来突出信息丰富的局部区域，从而逐步优化表示。与以前依赖软分布或路径集合的基于树的模型不同，ViTree选择单个树路径，提供更清晰、更简化的决策过程。这种补丁和路径的选择性提高了ViTree模型的可解释性，从而实现了更好的模型解释能力。",
    "tldr": "ViTree是一种用于细粒度视觉分类的新方法，通过结合视觉变换器和神经决策树，逐步突出信息丰富的局部区域，并选择单个树路径来提高模型的可解释性。",
    "en_tdlr": "ViTree is a novel approach for fine-grained visual categorization that combines vision transformer and neural decision trees to highlight informative local regions and improve model interpretability."
}