{
    "title": "Acoustic characterization of speech rhythm: going beyond metrics with recurrent neural networks. (arXiv:2401.14416v1 [eess.AS])",
    "abstract": "Languages have long been described according to their perceived rhythmic attributes. The associated typologies are of interest in psycholinguistics as they partly predict newborns' abilities to discriminate between languages and provide insights into how adult listeners process non-native languages. Despite the relative success of rhythm metrics in supporting the existence of linguistic rhythmic classes, quantitative studies have yet to capture the full complexity of temporal regularities associated with speech rhythm. We argue that deep learning offers a powerful pattern-recognition approach to advance the characterization of the acoustic bases of speech rhythm. To explore this hypothesis, we trained a medium-sized recurrent neural network on a language identification task over a large database of speech recordings in 21 languages. The network had access to the amplitude envelopes and a variable identifying the voiced segments, assuming that this signal would poorly convey phonetic in",
    "link": "http://arxiv.org/abs/2401.14416",
    "context": "Title: Acoustic characterization of speech rhythm: going beyond metrics with recurrent neural networks. (arXiv:2401.14416v1 [eess.AS])\nAbstract: Languages have long been described according to their perceived rhythmic attributes. The associated typologies are of interest in psycholinguistics as they partly predict newborns' abilities to discriminate between languages and provide insights into how adult listeners process non-native languages. Despite the relative success of rhythm metrics in supporting the existence of linguistic rhythmic classes, quantitative studies have yet to capture the full complexity of temporal regularities associated with speech rhythm. We argue that deep learning offers a powerful pattern-recognition approach to advance the characterization of the acoustic bases of speech rhythm. To explore this hypothesis, we trained a medium-sized recurrent neural network on a language identification task over a large database of speech recordings in 21 languages. The network had access to the amplitude envelopes and a variable identifying the voiced segments, assuming that this signal would poorly convey phonetic in",
    "path": "papers/24/01/2401.14416.json",
    "total_tokens": 853,
    "translated_title": "语音节奏的声学特征化：超越指标的递归神经网络研究",
    "translated_abstract": "长期以来，语言一直根据其感知的节奏属性进行描述。相关的分类对于心理语言学很有意义，因为它们在一定程度上预测了新生儿辨别语言的能力，并且揭示了成年听者如何处理非母语。尽管节奏度量在支持语言节奏类别存在方面取得了相对成功，但定量研究仍然没有捕捉到与语音节奏相关的时间规律的全部复杂性。我们认为，深度学习提供了一种强大的模式识别方法，可以推动对语音节奏声学基础的更深入的研究。为了探索这一假设，我们在21种语言的大型语音数据库上对中等大小的递归神经网络进行了语言识别任务的训练。该网络能够访问幅度包络和一个标识有声段的变量，假设这个信号无法很好地传达语音信息。",
    "tldr": "本研究通过训练递归神经网络进行语言识别任务，探索了深度学习在声学基础上进一步研究语音节奏的能力。",
    "en_tdlr": "This study explores the ability of deep learning to further investigate speech rhythm based on acoustic characteristics, by training a recurrent neural network on a language identification task."
}