{
    "title": "MagicVideo-V2: Multi-Stage High-Aesthetic Video Generation. (arXiv:2401.04468v1 [cs.CV])",
    "abstract": "The growing demand for high-fidelity video generation from textual descriptions has catalyzed significant research in this field. In this work, we introduce MagicVideo-V2 that integrates the text-to-image model, video motion generator, reference image embedding module and frame interpolation module into an end-to-end video generation pipeline. Benefiting from these architecture designs, MagicVideo-V2 can generate an aesthetically pleasing, high-resolution video with remarkable fidelity and smoothness. It demonstrates superior performance over leading Text-to-Video systems such as Runway, Pika 1.0, Morph, Moon Valley and Stable Video Diffusion model via user evaluation at large scale.",
    "link": "http://arxiv.org/abs/2401.04468",
    "context": "Title: MagicVideo-V2: Multi-Stage High-Aesthetic Video Generation. (arXiv:2401.04468v1 [cs.CV])\nAbstract: The growing demand for high-fidelity video generation from textual descriptions has catalyzed significant research in this field. In this work, we introduce MagicVideo-V2 that integrates the text-to-image model, video motion generator, reference image embedding module and frame interpolation module into an end-to-end video generation pipeline. Benefiting from these architecture designs, MagicVideo-V2 can generate an aesthetically pleasing, high-resolution video with remarkable fidelity and smoothness. It demonstrates superior performance over leading Text-to-Video systems such as Runway, Pika 1.0, Morph, Moon Valley and Stable Video Diffusion model via user evaluation at large scale.",
    "path": "papers/24/01/2401.04468.json",
    "total_tokens": 768,
    "translated_title": "MagicVideo-V2: 多阶段高审美视频生成",
    "translated_abstract": "高保真视频生成的不断需求推动了该领域的重大研究。在本工作中，我们介绍了MagicVideo-V2，它将文本到图像模型、视频运动生成器、参考图像嵌入模块和帧插值模块集成到一个端到端的视频生成流程中。凭借这些架构设计，MagicVideo-V2可以生成具有卓越保真度和流畅性的高分辨率美学视频。通过大规模用户评估，它展示了优于领先的Text-to-Video系统如Runway、Pika 1.0、Morph、Moon Valley和Stable Video Diffusion model的性能。",
    "tldr": "MagicVideo-V2是一个多阶段的高审美视频生成系统，通过集成文本到图像模型、视频运动生成器、参考图像嵌入模块和帧插值模块，实现了以高保真度和流畅性生成高分辨率美学视频的目标。在大规模用户评估中，表现优于其他Text-to-Video系统。",
    "en_tdlr": "MagicVideo-V2 is a multi-stage high-aesthetic video generation system that integrates text-to-image model, video motion generator, reference image embedding module, and frame interpolation module to achieve the goal of generating high-resolution aesthetically pleasing videos with remarkable fidelity and smoothness. It outperforms other Text-to-Video systems in large-scale user evaluation."
}