{
    "title": "Effective Controllable Bias Mitigation for Classification and Retrieval using Gate Adapters. (arXiv:2401.16457v1 [cs.LG])",
    "abstract": "Bias mitigation of Language Models has been the topic of many studies with a recent focus on learning separate modules like adapters for on-demand debiasing. Besides optimizing for a modularized debiased model, it is often critical in practice to control the degree of bias reduction at inference time, e.g., in order to tune for a desired performance-fairness trade-off in search results or to control the strength of debiasing in classification tasks. In this paper, we introduce Controllable Gate Adapter (ConGater), a novel modular gating mechanism with adjustable sensitivity parameters, which allows for a gradual transition from the biased state of the model to the fully debiased version at inference time. We demonstrate ConGater performance by (1) conducting adversarial debiasing experiments with three different models on three classification tasks with four protected attributes, and (2) reducing the bias of search results through fairness list-wise regularization to enable adjusting a",
    "link": "http://arxiv.org/abs/2401.16457",
    "context": "Title: Effective Controllable Bias Mitigation for Classification and Retrieval using Gate Adapters. (arXiv:2401.16457v1 [cs.LG])\nAbstract: Bias mitigation of Language Models has been the topic of many studies with a recent focus on learning separate modules like adapters for on-demand debiasing. Besides optimizing for a modularized debiased model, it is often critical in practice to control the degree of bias reduction at inference time, e.g., in order to tune for a desired performance-fairness trade-off in search results or to control the strength of debiasing in classification tasks. In this paper, we introduce Controllable Gate Adapter (ConGater), a novel modular gating mechanism with adjustable sensitivity parameters, which allows for a gradual transition from the biased state of the model to the fully debiased version at inference time. We demonstrate ConGater performance by (1) conducting adversarial debiasing experiments with three different models on three classification tasks with four protected attributes, and (2) reducing the bias of search results through fairness list-wise regularization to enable adjusting a",
    "path": "papers/24/01/2401.16457.json",
    "total_tokens": 929,
    "translated_title": "有效的可控偏差缓解方法，利用门适配器进行分类和检索。(arXiv:2401.16457v1 [cs.LG])",
    "translated_abstract": "语言模型的偏差缓解已经成为许多研究的主题，最近关注的焦点是学习独立的模块，例如适配器进行按需去偏。除了优化模块化去偏模型外，在实践中通常需要在推理时控制偏差减少的程度，例如，为了在搜索结果中调整期望的性能-公平性权衡或在分类任务中控制去偏的强度。在本文中，我们引入了可控门适配器（ConGater），一种具有可调节敏感性参数的新颖模块化门机制，允许在推理时从模型的偏向状态逐渐过渡到完全去偏的版本。通过在三个分类任务上对三个不同模型进行对抗性去偏实验，并通过公平性列表正则化来减少搜索结果的偏差，我们展示了ConGater的性能。",
    "tldr": "本文引入了可控门适配器（ConGater），一种具有可调节敏感性参数的新颖模块化门机制，可在推理时逐渐过渡从模型的偏向状态到完全去偏的版本，并通过实验证明了其在分类和检索任务中的性能。"
}