{
    "title": "Deep Learning-based Embedded Intrusion Detection System for Automotive CAN. (arXiv:2401.10674v1 [cs.CR])",
    "abstract": "Rising complexity of in-vehicle electronics is enabling new capabilities like autonomous driving and active safety. However, rising automation also increases risk of security threats which is compounded by lack of in-built security measures in legacy networks like CAN, allowing attackers to observe, tamper and modify information shared over such broadcast networks. Various intrusion detection approaches have been proposed to detect and tackle such threats, with machine learning models proving highly effective. However, deploying machine learning models will require high processing power through high-end processors or GPUs to perform them close to line rate. In this paper, we propose a hybrid FPGA-based ECU approach that can transparently integrate IDS functionality through a dedicated off-the-shelf hardware accelerator that implements a deep-CNN intrusion detection model. Our results show that the proposed approach provides an average accuracy of over 99% across multiple attack dataset",
    "link": "http://arxiv.org/abs/2401.10674",
    "context": "Title: Deep Learning-based Embedded Intrusion Detection System for Automotive CAN. (arXiv:2401.10674v1 [cs.CR])\nAbstract: Rising complexity of in-vehicle electronics is enabling new capabilities like autonomous driving and active safety. However, rising automation also increases risk of security threats which is compounded by lack of in-built security measures in legacy networks like CAN, allowing attackers to observe, tamper and modify information shared over such broadcast networks. Various intrusion detection approaches have been proposed to detect and tackle such threats, with machine learning models proving highly effective. However, deploying machine learning models will require high processing power through high-end processors or GPUs to perform them close to line rate. In this paper, we propose a hybrid FPGA-based ECU approach that can transparently integrate IDS functionality through a dedicated off-the-shelf hardware accelerator that implements a deep-CNN intrusion detection model. Our results show that the proposed approach provides an average accuracy of over 99% across multiple attack dataset",
    "path": "papers/24/01/2401.10674.json",
    "total_tokens": 898,
    "translated_title": "基于深度学习的嵌入式汽车CAN网络入侵检测系统",
    "translated_abstract": "车载电子设备的复杂性的增加使得像自动驾驶和主动安全这样的新能力得以实现。然而，不断增加的自动化也增加了安全威胁的风险，这在CAN等传统网络中缺乏内置的安全措施的情况下更加严重，允许攻击者观察、篡改和修改在这些广播网络上共享的信息。各种入侵检测方法已被提出来检测和解决这些威胁，其中机器学习模型被证明非常有效。然而，部署机器学习模型将需要通过高端处理器或GPU提供高处理能力以逼近线速率。本文提出了一种混合FPGA-based ECU方法，通过一个专用的现成硬件加速器来透明地集成IDS功能，并实现了深度卷积神经网络入侵检测模型。我们的结果表明，所提出的方法在多个攻击数据集上提供了平均精度超过99%。",
    "tldr": "本文提出了一种基于深度学习的嵌入式汽车CAN网络入侵检测系统，通过专用的硬件加速器实现了深度卷积神经网络入侵检测模型的透明集成，平均检测准确率超过99%。",
    "en_tdlr": "This paper proposes a deep learning-based embedded intrusion detection system for automotive CAN networks, which achieves transparent integration of a deep convolutional neural network intrusion detection model through a dedicated hardware accelerator, with an average detection accuracy of over 99%."
}