{
    "title": "MolPLA: A Molecular Pretraining Framework for Learning Cores, R-Groups and their Linker Joints. (arXiv:2401.16771v1 [cs.LG])",
    "abstract": "Molecular core structures and R-groups are essential concepts in drug development. Integration of these concepts with conventional graph pre-training approaches can promote deeper understanding in molecules. We propose MolPLA, a novel pre-training framework that employs masked graph contrastive learning in understanding the underlying decomposable parts inmolecules that implicate their core structure and peripheral R-groups. Furthermore, we formulate an additional framework that grants MolPLA the ability to help chemists find replaceable R-groups in lead optimization scenarios. Experimental results on molecular property prediction show that MolPLA exhibits predictability comparable to current state-of-the-art models. Qualitative analysis implicate that MolPLA is capable of distinguishing core and R-group sub-structures, identifying decomposable regions in molecules and contributing to lead optimization scenarios by rationally suggesting R-group replacements given various query core tem",
    "link": "http://arxiv.org/abs/2401.16771",
    "context": "Title: MolPLA: A Molecular Pretraining Framework for Learning Cores, R-Groups and their Linker Joints. (arXiv:2401.16771v1 [cs.LG])\nAbstract: Molecular core structures and R-groups are essential concepts in drug development. Integration of these concepts with conventional graph pre-training approaches can promote deeper understanding in molecules. We propose MolPLA, a novel pre-training framework that employs masked graph contrastive learning in understanding the underlying decomposable parts inmolecules that implicate their core structure and peripheral R-groups. Furthermore, we formulate an additional framework that grants MolPLA the ability to help chemists find replaceable R-groups in lead optimization scenarios. Experimental results on molecular property prediction show that MolPLA exhibits predictability comparable to current state-of-the-art models. Qualitative analysis implicate that MolPLA is capable of distinguishing core and R-group sub-structures, identifying decomposable regions in molecules and contributing to lead optimization scenarios by rationally suggesting R-group replacements given various query core tem",
    "path": "papers/24/01/2401.16771.json",
    "total_tokens": 988,
    "translated_title": "MolPLA: 一个用于学习核心、R-基和连接点的分子预训练框架",
    "translated_abstract": "分子核心结构和R-基是药物开发中的重要概念。将这些概念与传统的图预训练方法相结合，可以促进对分子的更深入理解。我们提出了MolPLA，一种新颖的预训练框架，它使用掩码图对比学习来理解分子中的可分解部分，以揭示其核心结构和外围R-基。此外，我们还制定了一个额外的框架，使MolPLA能够帮助化学家在先导优化场景中找到可替代的R-基。分子性质预测的实验结果表明，MolPLA展现出与当前最先进模型相当的可预测性。定性分析表明，MolPLA能够区分核心和R-基亚结构，识别分子中的可分解区域，并通过理性建议不同查询核心温度下的R-基替换，为先导优化场景做出贡献。",
    "tldr": "MolPLA是一个用于学习分子核心、R-基和连接点的分子预训练框架，通过掩码图对比学习可以深入理解分子的可分解部分，同时还可以帮助化学家在先导优化场景中找到可替代的R-基。",
    "en_tdlr": "MolPLA is a molecular pretraining framework for learning molecular cores, R-groups, and linker joints. It utilizes masked graph contrastive learning to gain a deeper understanding of the decomposable parts in molecules, including the core structure and peripheral R-groups. It also provides chemists with the ability to identify replaceable R-groups in lead optimization scenarios. Experimental results demonstrate MolPLA's predictability comparable to state-of-the-art models in molecular property prediction. Qualitative analysis shows that MolPLA can distinguish core and R-group sub-structures, identify decomposable regions in molecules, and contribute to lead optimization scenarios by suggesting rational R-group replacements for various query core templates."
}