{
    "title": "TIM: An Efficient Temporal Interaction Module for Spiking Transformer. (arXiv:2401.11687v2 [cs.NE] UPDATED)",
    "abstract": "Spiking Neural Networks (SNNs), as the third generation of neural networks, have gained prominence for their biological plausibility and computational efficiency, especially in processing diverse datasets. The integration of attention mechanisms, inspired by advancements in neural network architectures, has led to the development of Spiking Transformers. These have shown promise in enhancing SNNs' capabilities, particularly in the realms of both static and neuromorphic datasets. Despite their progress, a discernible gap exists in these systems, specifically in the Spiking Self Attention (SSA) mechanism's effectiveness in leveraging the temporal processing potential of SNNs. To address this, we introduce the Temporal Interaction Module (TIM), a novel, convolution-based enhancement designed to augment the temporal data processing abilities within SNN architectures. TIM's integration into existing SNN frameworks is seamless and efficient, requiring minimal additional parameters while sign",
    "link": "http://arxiv.org/abs/2401.11687",
    "context": "Title: TIM: An Efficient Temporal Interaction Module for Spiking Transformer. (arXiv:2401.11687v2 [cs.NE] UPDATED)\nAbstract: Spiking Neural Networks (SNNs), as the third generation of neural networks, have gained prominence for their biological plausibility and computational efficiency, especially in processing diverse datasets. The integration of attention mechanisms, inspired by advancements in neural network architectures, has led to the development of Spiking Transformers. These have shown promise in enhancing SNNs' capabilities, particularly in the realms of both static and neuromorphic datasets. Despite their progress, a discernible gap exists in these systems, specifically in the Spiking Self Attention (SSA) mechanism's effectiveness in leveraging the temporal processing potential of SNNs. To address this, we introduce the Temporal Interaction Module (TIM), a novel, convolution-based enhancement designed to augment the temporal data processing abilities within SNN architectures. TIM's integration into existing SNN frameworks is seamless and efficient, requiring minimal additional parameters while sign",
    "path": "papers/24/01/2401.11687.json",
    "total_tokens": 830,
    "translated_title": "TIM: 一种高效的时间交互模块用于脉冲变压器",
    "translated_abstract": "脉冲神经网络 (SNNs) 作为第三代神经网络，因其生物合理性和计算效率而备受关注，尤其是在处理多样化数据集方面。受神经网络架构进展的启发，注意力机制的整合导致了脉冲变压器的发展。这些变压器在增强 SNNs 的能力方面显示了潜力，尤其是在静态数据集和神经形态数据集的领域。尽管取得了进展，但这些系统中存在着明显的差距，特别是脉冲自注意 (SSA) 机制在利用 SNNs 的时间处理潜力方面的有效性。为了解决这个问题，我们引入了一种名为 Temporal Interaction Module (TIM) 的新型卷积增强技术，旨在增强 SNN 架构中的时间数据处理能力。TIM 的整合与现有的 SNN 框架无缝衔接，高效，只需要额外的最少参数。",
    "tldr": "TIM 是一种高效的时间交互模块，用于增强脉冲神经网络 (SNNs) 的时间数据处理能力。",
    "en_tdlr": "TIM is an efficient temporal interaction module designed to enhance the temporal data processing abilities of Spiking Neural Networks (SNNs)."
}