{
    "title": "Functional Limit Theorems for Hawkes Processes. (arXiv:2401.11495v1 [math.PR])",
    "abstract": "We prove that the long-run behavior of Hawkes processes is fully determined by the average number and the dispersion of child events. For subcritical processes we provide FLLNs and FCLTs under minimal conditions on the kernel of the process with the precise form of the limit theorems depending strongly on the dispersion of child events. For a critical Hawkes process with weakly dispersed child events, functional central limit theorems do not hold. Instead, we prove that the rescaled intensity processes and rescaled Hawkes processes behave like CIR-processes without mean-reversion, respectively integrated CIR-processes. We provide the rate of convergence by establishing an upper bound on the Wasserstein distance between the distributions of rescaled Hawkes process and the corresponding limit process. By contrast, critical Hawkes process with heavily dispersed child events share many properties of subcritical ones. In particular, functional limit theorems hold. However, unlike subcritica",
    "link": "http://arxiv.org/abs/2401.11495",
    "context": "Title: Functional Limit Theorems for Hawkes Processes. (arXiv:2401.11495v1 [math.PR])\nAbstract: We prove that the long-run behavior of Hawkes processes is fully determined by the average number and the dispersion of child events. For subcritical processes we provide FLLNs and FCLTs under minimal conditions on the kernel of the process with the precise form of the limit theorems depending strongly on the dispersion of child events. For a critical Hawkes process with weakly dispersed child events, functional central limit theorems do not hold. Instead, we prove that the rescaled intensity processes and rescaled Hawkes processes behave like CIR-processes without mean-reversion, respectively integrated CIR-processes. We provide the rate of convergence by establishing an upper bound on the Wasserstein distance between the distributions of rescaled Hawkes process and the corresponding limit process. By contrast, critical Hawkes process with heavily dispersed child events share many properties of subcritical ones. In particular, functional limit theorems hold. However, unlike subcritica",
    "path": "papers/24/01/2401.11495.json",
    "total_tokens": 994,
    "translated_title": "Hawkes过程的功能极限定理",
    "translated_abstract": "我们证明Hawkes过程的长期行为完全由子事件的平均数量和离散程度确定。对于亚临界过程，我们在过程的核函数的最小条件下提供了FLLNs和FCLTs，极限定理的具体形式严重取决于子事件的离散程度。对于具有弱离散子事件的临界Hawkes过程，功能中心极限定理不成立。相反，我们证明了经过缩放的强度过程和经过缩放的Hawkes过程分别行为类似于无均值回归的CIR过程和整合的CIR过程。通过建立缩放的Hawkes过程的分布与相应极限过程之间的Wasserstein距离的上界，我们给出了收敛速度。相反，具有高度离散子事件的临界Hawkes过程与亚临界过程共享许多属性。特别是，功能极限定理成立。然而，与亚临界过程不同的是，亚临界过程没有离散子事件，具有强离散子事件的临界Hawkes过程没有功能中心极限定理。",
    "tldr": "Hawkes过程的长期行为由子事件的平均数量和离散程度决定。对于亚临界过程，提供了FLLNs和FCLTs，具体形式取决于子事件的离散程度。对于具有弱离散子事件的临界Hawkes过程，不存在功能中心极限定理。通过缩放后的强度过程和缩放后的Hawkes过程的分布与极限过程之间的Wasserstein距离的上界，给出了收敛速度。具有高度离散子事件的临界Hawkes过程与亚临界过程共享许多属性，功能极限定理成立。"
}