{
    "title": "MT-Ranker: Reference-free machine translation evaluation by inter-system ranking. (arXiv:2401.17099v1 [cs.CL])",
    "abstract": "Traditionally, Machine Translation (MT) Evaluation has been treated as a regression problem -- producing an absolute translation-quality score. This approach has two limitations: i) the scores lack interpretability, and human annotators struggle with giving consistent scores; ii) most scoring methods are based on (reference, translation) pairs, limiting their applicability in real-world scenarios where references are absent. In practice, we often care about whether a new MT system is better or worse than some competitors. In addition, reference-free MT evaluation is increasingly practical and necessary. Unfortunately, these two practical considerations have yet to be jointly explored. In this work, we formulate the reference-free MT evaluation into a pairwise ranking problem. Given the source sentence and a pair of translations, our system predicts which translation is better. In addition to proposing this new formulation, we further show that this new paradigm can demonstrate superior",
    "link": "http://arxiv.org/abs/2401.17099",
    "context": "Title: MT-Ranker: Reference-free machine translation evaluation by inter-system ranking. (arXiv:2401.17099v1 [cs.CL])\nAbstract: Traditionally, Machine Translation (MT) Evaluation has been treated as a regression problem -- producing an absolute translation-quality score. This approach has two limitations: i) the scores lack interpretability, and human annotators struggle with giving consistent scores; ii) most scoring methods are based on (reference, translation) pairs, limiting their applicability in real-world scenarios where references are absent. In practice, we often care about whether a new MT system is better or worse than some competitors. In addition, reference-free MT evaluation is increasingly practical and necessary. Unfortunately, these two practical considerations have yet to be jointly explored. In this work, we formulate the reference-free MT evaluation into a pairwise ranking problem. Given the source sentence and a pair of translations, our system predicts which translation is better. In addition to proposing this new formulation, we further show that this new paradigm can demonstrate superior",
    "path": "papers/24/01/2401.17099.json",
    "total_tokens": 923,
    "translated_title": "MT-Ranker: 无参考机器翻译评估方法——通过系统间排名",
    "translated_abstract": "传统上，机器翻译（MT）评估被视为回归问题，即产生一个绝对的翻译质量分数。这种方法存在两个限制：一是分数缺乏可解释性，人类标注员很难给出一致的分数；二是大多数评分方法基于（参考，翻译）对，限制了它们在实际场景中没有参考的情况下的适用性。实际上，我们常常关心一个新的MT系统是否比某些竞争对手更好或更差。此外，无参考MT评估在实践中越来越实用和必要。不幸的是，这两个实践考虑因素尚未共同探索。在这项工作中，我们将无参考MT评估转化为一个成对排名问题。给定源句子和一对翻译，我们的系统预测哪个翻译更好。除了提出这种新的公式，我们进一步证明了这种新的范式可以表现出更好的性能。",
    "tldr": "MT-Ranker 提出了一种无参考机器翻译评估方法，通过系统间排名来解决了传统用回归方法产生绝对翻译质量分数的不足，提供了更具解释性和一致性的评分结果，并在没有参考的情况下应用于实际场景中。",
    "en_tdlr": "MT-Ranker proposes a reference-free machine translation evaluation method by inter-system ranking, addressing the limitations of traditional regression-based approaches in producing absolute translation-quality scores, providing more interpretability and consistency in scoring results, and being applicable in real-world scenarios without references."
}