{
    "title": "Using AI/ML to Find and Remediate Enterprise Secrets in Code & Document Sharing Platforms. (arXiv:2401.01754v1 [cs.SE])",
    "abstract": "We introduce a new challenge to the software development community: 1) leveraging AI to accurately detect and flag up secrets in code and on popular document sharing platforms that frequently used by developers, such as Confluence and 2) automatically remediating the detections (e.g. by suggesting password vault functionality). This is a challenging, and mostly unaddressed task. Existing methods leverage heuristics and regular expressions, that can be very noisy, and therefore increase toil on developers. The next step modifying code itself - to automatically remediate a detection, is a complex task. We introduce two baseline AI models that have good detection performance and propose an automatic mechanism for remediating secrets found in code, opening up the study of this task to the wider community.",
    "link": "http://arxiv.org/abs/2401.01754",
    "context": "Title: Using AI/ML to Find and Remediate Enterprise Secrets in Code & Document Sharing Platforms. (arXiv:2401.01754v1 [cs.SE])\nAbstract: We introduce a new challenge to the software development community: 1) leveraging AI to accurately detect and flag up secrets in code and on popular document sharing platforms that frequently used by developers, such as Confluence and 2) automatically remediating the detections (e.g. by suggesting password vault functionality). This is a challenging, and mostly unaddressed task. Existing methods leverage heuristics and regular expressions, that can be very noisy, and therefore increase toil on developers. The next step modifying code itself - to automatically remediate a detection, is a complex task. We introduce two baseline AI models that have good detection performance and propose an automatic mechanism for remediating secrets found in code, opening up the study of this task to the wider community.",
    "path": "papers/24/01/2401.01754.json",
    "total_tokens": 860,
    "translated_title": "使用AI/ML在代码和文档分享平台中查找和修复企业机密问题",
    "translated_abstract": "我们向软件开发社区提出一个新的挑战：1）利用人工智能准确地检测和标记代码和常用文档分享平台中的机密信息，如Confluence，并且2）自动修复这些检测到的问题（例如，建议使用密码保险库功能）。这是一个具有挑战性且大多数情况下未解决的任务。现有方法利用启发式和正则表达式，但噪声很大，从而增加开发人员的工作量。下一步是修改代码本身，以自动修复检测到的问题，这是一个复杂的任务。我们引入了两种性能良好的基准AI模型，并提出了一个自动机制来修复在代码中发现的机密信息问题，从而将这个任务的研究扩展到更广泛的社区。",
    "tldr": "该论文提出了一个新的挑战，即利用AI在代码和文档分享平台中准确检测和标记机密信息，并自动修复这些问题。研究人员引入了两种性能良好的基准AI模型，并提出了一种自动机制来修复发现的机密信息问题，为更广泛的社区打开了研究的可能性。",
    "en_tdlr": "This paper presents a new challenge of using AI to accurately detect and flag secrets in code and document sharing platforms, and proposes an automatic mechanism to remediate these issues. The researchers introduce two high-performing baseline AI models and open up the study of this task to a wider community."
}