{
    "title": "Error-Tolerant E-Discovery Protocols",
    "abstract": "We consider the multi-party classification problem introduced by Dong, Hartline, and Vijayaraghavan (2022) in the context of electronic discovery (e-discovery). Based on a request for production from the requesting party, the responding party is required to provide documents that are responsive to the request except for those that are legally privileged. Our goal is to find a protocol that verifies that the responding party sends almost all responsive documents while minimizing the disclosure of non-responsive documents. We provide protocols in the challenging non-realizable setting, where the instance may not be perfectly separated by a linear classifier. We demonstrate empirically that our protocol successfully manages to find almost all relevant documents, while incurring only a small disclosure of non-responsive documents. We complement this with a theoretical analysis of our protocol in the single-dimensional setting, and other experiments on simulated data which suggest that the ",
    "link": "https://arxiv.org/abs/2401.17952",
    "context": "Title: Error-Tolerant E-Discovery Protocols\nAbstract: We consider the multi-party classification problem introduced by Dong, Hartline, and Vijayaraghavan (2022) in the context of electronic discovery (e-discovery). Based on a request for production from the requesting party, the responding party is required to provide documents that are responsive to the request except for those that are legally privileged. Our goal is to find a protocol that verifies that the responding party sends almost all responsive documents while minimizing the disclosure of non-responsive documents. We provide protocols in the challenging non-realizable setting, where the instance may not be perfectly separated by a linear classifier. We demonstrate empirically that our protocol successfully manages to find almost all relevant documents, while incurring only a small disclosure of non-responsive documents. We complement this with a theoretical analysis of our protocol in the single-dimensional setting, and other experiments on simulated data which suggest that the ",
    "path": "papers/24/01/2401.17952.json",
    "total_tokens": 765,
    "translated_title": "容错型电子发现协议",
    "translated_abstract": "我们考虑了Dong、Hartline和Vijayaraghavan（2022）在电子发现（e-discovery）背景下引入的多方分类问题。根据来自请求方的生产要求，响应方需要提供与该要求相应的文件，但不包括法律特权文件。我们的目标是找到一个验证响应方发送几乎所有响应文件并最小化非响应文件披露的协议。我们在具有挑战性的非现实设置中提供了协议，在该设置中，实例可能无法通过线性分类器完全分离。我们通过实证研究证明，我们的协议成功地找到了几乎所有相关文件，同时只披露了少量非响应文件。我们还对单维度设置下的协议进行了理论分析，并进行了其他模拟数据实验，结果表明该协议的有效性。",
    "tldr": "本论文提出了一种容错型电子发现协议，能够几乎完全找到与请求相应的文件，并最小化非响应文件的披露。",
    "en_tdlr": "This paper presents an error-tolerant e-discovery protocol that can almost completely find responsive documents based on a request while minimizing the disclosure of non-responsive documents."
}