{
    "title": "Meta-Prompting: Enhancing Language Models with Task-Agnostic Scaffolding. (arXiv:2401.12954v1 [cs.CL])",
    "abstract": "We introduce meta-prompting, an effective scaffolding technique designed to enhance the functionality of language models (LMs). This approach transforms a single LM into a multi-faceted conductor, adept at managing and integrating multiple independent LM queries. By employing high-level instructions, meta-prompting guides the LM to break down complex tasks into smaller, more manageable subtasks. These subtasks are then handled by distinct \"expert\" instances of the same LM, each operating under specific, tailored instructions. Central to this process is the LM itself, in its role as the conductor, which ensures seamless communication and effective integration of the outputs from these expert models. It additionally employs its inherent critical thinking and robust verification processes to refine and authenticate the end result. This collaborative prompting approach empowers a single LM to simultaneously act as a comprehensive orchestrator and a panel of diverse experts, significantly e",
    "link": "http://arxiv.org/abs/2401.12954",
    "context": "Title: Meta-Prompting: Enhancing Language Models with Task-Agnostic Scaffolding. (arXiv:2401.12954v1 [cs.CL])\nAbstract: We introduce meta-prompting, an effective scaffolding technique designed to enhance the functionality of language models (LMs). This approach transforms a single LM into a multi-faceted conductor, adept at managing and integrating multiple independent LM queries. By employing high-level instructions, meta-prompting guides the LM to break down complex tasks into smaller, more manageable subtasks. These subtasks are then handled by distinct \"expert\" instances of the same LM, each operating under specific, tailored instructions. Central to this process is the LM itself, in its role as the conductor, which ensures seamless communication and effective integration of the outputs from these expert models. It additionally employs its inherent critical thinking and robust verification processes to refine and authenticate the end result. This collaborative prompting approach empowers a single LM to simultaneously act as a comprehensive orchestrator and a panel of diverse experts, significantly e",
    "path": "papers/24/01/2401.12954.json",
    "total_tokens": 837,
    "translated_title": "元提示：增强语言模型的任务无关支持",
    "translated_abstract": "我们引入了元提示，一种有效的支持技术，旨在增强语言模型（LM）的功能。这种方法将单个LM转化为多面手指挥者，善于管理和整合多个独立的LM查询。通过使用高级指令，元提示指导LM将复杂任务分解为更小、更可管理的子任务。然后，这些子任务由相同LM的不同“专家”实例处理，每个实例都在特定的、定制化的指导下操作。该过程的核心是LM本身，它作为指挥者确保这些专家模型的输出无缝沟通和有效集成。它还利用其固有的批判性思维和强大的验证过程来完善和验证最终结果。这种协作提示方法使单个LM能够同时充当全面的编排者和多样化的专家小组，极大地提高了效率。",
    "tldr": "元提示是一种支持技术，将单个语言模型转化为多面手指挥者，通过高级指令将复杂任务分解为子任务，并由不同的专家模型处理，最终提高效率。"
}