{
    "title": "Congestion Pricing for Efficiency and Equity: Theory and Applications to the San Francisco Bay Area. (arXiv:2401.16844v1 [cs.GT])",
    "abstract": "Congestion pricing, while adopted by many cities to alleviate traffic congestion, raises concerns about widening socioeconomic disparities due to its disproportionate impact on low-income travelers. In this study, we address this concern by proposing a new class of congestion pricing schemes that not only minimize congestion levels but also incorporate an equity objective to reduce cost disparities among travelers with different willingness-to-pay. Our analysis builds on a congestion game model with heterogeneous traveler populations. We present four pricing schemes that account for practical considerations, such as the ability to charge differentiated tolls to various traveler populations and the option to toll all or only a subset of edges in the network. We evaluate our pricing schemes in the calibrated freeway network of the San Francisco Bay Area. We demonstrate that the proposed congestion pricing schemes improve both efficiency (in terms of reduced average travel time) and equit",
    "link": "http://arxiv.org/abs/2401.16844",
    "context": "Title: Congestion Pricing for Efficiency and Equity: Theory and Applications to the San Francisco Bay Area. (arXiv:2401.16844v1 [cs.GT])\nAbstract: Congestion pricing, while adopted by many cities to alleviate traffic congestion, raises concerns about widening socioeconomic disparities due to its disproportionate impact on low-income travelers. In this study, we address this concern by proposing a new class of congestion pricing schemes that not only minimize congestion levels but also incorporate an equity objective to reduce cost disparities among travelers with different willingness-to-pay. Our analysis builds on a congestion game model with heterogeneous traveler populations. We present four pricing schemes that account for practical considerations, such as the ability to charge differentiated tolls to various traveler populations and the option to toll all or only a subset of edges in the network. We evaluate our pricing schemes in the calibrated freeway network of the San Francisco Bay Area. We demonstrate that the proposed congestion pricing schemes improve both efficiency (in terms of reduced average travel time) and equit",
    "path": "papers/24/01/2401.16844.json",
    "total_tokens": 876,
    "translated_title": "用于效率和公平性的拥堵定价：理论及其在旧金山湾区的应用",
    "translated_abstract": "拥堵定价被许多城市用于缓解交通拥堵，但由于对低收入旅行者影响较大，引发了关于社会经济差距扩大的担忧。在本研究中，我们提出了一种新的拥堵定价方案，不仅可以最大限度地减少交通拥堵，还可以将公平性目标纳入其中，以减少不同支付意愿的旅行者之间的成本差异。我们的分析基于一个具有异质旅行者群体的拥堵博弈模型。我们提出了四种考虑实际因素的定价方案，例如对不同旅行者群体收取差异化的通行费以及征收整个路网中的所有边或只征收其中一部分边的选择。我们在旧金山湾区的校准高速公路网络中评估了我们的定价方案。我们证明了拥堵定价方案可以提高效率（即减少平均旅行时间）和公平性。",
    "tldr": "本研究提出了一种新的拥堵定价方案，旨在同时减少交通拥堵水平和缩小不同旅行者之间的成本差异，从而提高效率和公平性。",
    "en_tdlr": "This study proposes a new congestion pricing scheme that aims to reduce traffic congestion levels while minimizing cost disparities among different travelers, thereby improving efficiency and equity."
}