{
    "title": "Within-basket Recommendation via Neural Pattern Associator. (arXiv:2401.16433v1 [cs.IR])",
    "abstract": "Within-basket recommendation (WBR) refers to the task of recommending items to the end of completing a non-empty shopping basket during a shopping session. While the latest innovations in this space demonstrate remarkable performance improvement on benchmark datasets, they often overlook the complexity of user behaviors in practice, such as 1) co-existence of multiple shopping intentions, 2) multi-granularity of such intentions, and 3) interleaving behavior (switching intentions) in a shopping session. This paper presents Neural Pattern Associator (NPA), a deep item-association-mining model that explicitly models the aforementioned factors. Specifically, inspired by vector quantization, the NPA model learns to encode common user intentions (or item-combination patterns) as quantized representations (a.k.a. codebook), which permits identification of users's shopping intentions via attention-driven lookup during the reasoning phase. This yields coherent and self-interpretable recommendat",
    "link": "http://arxiv.org/abs/2401.16433",
    "context": "Title: Within-basket Recommendation via Neural Pattern Associator. (arXiv:2401.16433v1 [cs.IR])\nAbstract: Within-basket recommendation (WBR) refers to the task of recommending items to the end of completing a non-empty shopping basket during a shopping session. While the latest innovations in this space demonstrate remarkable performance improvement on benchmark datasets, they often overlook the complexity of user behaviors in practice, such as 1) co-existence of multiple shopping intentions, 2) multi-granularity of such intentions, and 3) interleaving behavior (switching intentions) in a shopping session. This paper presents Neural Pattern Associator (NPA), a deep item-association-mining model that explicitly models the aforementioned factors. Specifically, inspired by vector quantization, the NPA model learns to encode common user intentions (or item-combination patterns) as quantized representations (a.k.a. codebook), which permits identification of users's shopping intentions via attention-driven lookup during the reasoning phase. This yields coherent and self-interpretable recommendat",
    "path": "papers/24/01/2401.16433.json",
    "total_tokens": 873,
    "translated_title": "通过神经模式关联器进行篮内推荐",
    "translated_abstract": "篮内推荐（WBR）是指在购物过程中为了完成一个非空购物篮而推荐商品的任务。尽管这个领域的最新创新在基准数据集上表现出了显著的性能提升，但它们常常忽视了实际用户行为的复杂性，比如1）多个购物意图的共存，2）这些意图的多粒度和3）购物过程中的交织行为（切换意图）。本文提出了一种名为神经模式关联器（NPA）的深度商品关联挖掘模型，明确地建模了上述因素。具体来说，受到向量量化的启发，NPA模型学习将常见的用户意图（或商品组合模式）编码为量化表示（也称为码本），这允许在推理阶段通过注意力驱动的查找来识别用户的购物意图。这样产生的推荐结果连贯且自解释。",
    "tldr": "本文介绍了一种称为神经模式关联器（NPA）的深度商品关联挖掘模型，该模型能够明确地建模购物过程中的复杂用户行为，并通过注意力驱动的查找来识别用户的购物意图。",
    "en_tdlr": "This paper presents Neural Pattern Associator (NPA), a deep item-association-mining model that explicitly models the complexity of user behaviors in shopping sessions and identifies users's shopping intentions via attention-driven lookup."
}