{
    "title": "A cost-sensitive constrained Lasso",
    "abstract": "The Lasso has become a benchmark data analysis procedure, and numerous variants have been proposed in the literature. Although the Lasso formulations are stated so that overall prediction error is optimized, no full control over the accuracy prediction on certain individuals of interest is allowed. In this work we propose a novel version of the Lasso in which quadratic performance constraints are added to Lasso-based objective functions, in such a way that threshold values are set to bound the prediction errors in the different groups of interest (not necessarily disjoint). As a result, a constrained sparse regression model is defined by a nonlinear optimization problem. This cost-sensitive constrained Lasso has a direct application in heterogeneous samples where data are collected from distinct sources, as it is standard in many biomedical contexts. Both theoretical properties and empirical studies concerning the new method are explored in this paper. In addition, two illustrations of",
    "link": "https://arxiv.org/abs/2401.18023",
    "context": "Title: A cost-sensitive constrained Lasso\nAbstract: The Lasso has become a benchmark data analysis procedure, and numerous variants have been proposed in the literature. Although the Lasso formulations are stated so that overall prediction error is optimized, no full control over the accuracy prediction on certain individuals of interest is allowed. In this work we propose a novel version of the Lasso in which quadratic performance constraints are added to Lasso-based objective functions, in such a way that threshold values are set to bound the prediction errors in the different groups of interest (not necessarily disjoint). As a result, a constrained sparse regression model is defined by a nonlinear optimization problem. This cost-sensitive constrained Lasso has a direct application in heterogeneous samples where data are collected from distinct sources, as it is standard in many biomedical contexts. Both theoretical properties and empirical studies concerning the new method are explored in this paper. In addition, two illustrations of",
    "path": "papers/24/01/2401.18023.json",
    "total_tokens": 858,
    "translated_title": "一种成本敏感的约束Lasso",
    "translated_abstract": "Lasso已经成为一个基准数据分析方法，并且在文献中提出了许多变体。虽然Lasso的公式是为了优化整体预测误差而设定的，但不能对感兴趣的特定个体的准确性预测进行完全控制。在这项工作中，我们提出了一种新颖的Lasso版本，其中通过向基于Lasso的目标函数添加二次性能约束的方式来设置阈值，以限制不同感兴趣组（不一定互斥）中的预测误差。因此，通过非线性优化问题定义了一种受成本限制的稀疏回归模型。这种成本敏感的约束Lasso在异质样本中具有直接应用，其中数据是从不同来源收集的，这在许多生物医学背景下是标准的。本文探讨了这种新方法的理论性质和经验证明研究。此外，本文还进行了两个应用示例的演示：",
    "tldr": "这种成本敏感的约束Lasso提出了一种新颖的Lasso版本，在Lasso基础上添加了二次性能约束，以限制不同感兴趣组中的预测误差。该方法适用于异质样本，具有许多生物医学背景下的直接应用。",
    "en_tdlr": "This cost-sensitive constrained Lasso proposes a novel version of Lasso by adding quadratic performance constraints on top of Lasso to limit prediction errors in different groups of interest. It has direct application in heterogeneous samples in many biomedical contexts."
}