{
    "title": "Testing the Exogeneity of Instrumental Variables and Regressors in Linear Regression Models Using Copulas. (arXiv:2401.15253v1 [stat.ME])",
    "abstract": "We provide a Copula-based approach to test the exogeneity of instrumental variables in linear regression models. We show that the exogeneity of instrumental variables is equivalent to the exogeneity of their standard normal transformations with the same CDF value. Then, we establish a Wald test for the exogeneity of the instrumental variables. We demonstrate the performance of our test using simulation studies. Our simulations show that if the instruments are actually endogenous, our test rejects the exogeneity hypothesis approximately 93% of the time at the 5% significance level. Conversely, when instruments are truly exogenous, it dismisses the exogeneity assumption less than 30% of the time on average for data with 200 observations and less than 2% of the time for data with 1,000 observations. Our results demonstrate our test's effectiveness, offering significant value to applied econometricians.",
    "link": "http://arxiv.org/abs/2401.15253",
    "context": "Title: Testing the Exogeneity of Instrumental Variables and Regressors in Linear Regression Models Using Copulas. (arXiv:2401.15253v1 [stat.ME])\nAbstract: We provide a Copula-based approach to test the exogeneity of instrumental variables in linear regression models. We show that the exogeneity of instrumental variables is equivalent to the exogeneity of their standard normal transformations with the same CDF value. Then, we establish a Wald test for the exogeneity of the instrumental variables. We demonstrate the performance of our test using simulation studies. Our simulations show that if the instruments are actually endogenous, our test rejects the exogeneity hypothesis approximately 93% of the time at the 5% significance level. Conversely, when instruments are truly exogenous, it dismisses the exogeneity assumption less than 30% of the time on average for data with 200 observations and less than 2% of the time for data with 1,000 observations. Our results demonstrate our test's effectiveness, offering significant value to applied econometricians.",
    "path": "papers/24/01/2401.15253.json",
    "total_tokens": 934,
    "translated_title": "使用Copula测试线性回归模型中工具变量和回归器的外生性",
    "translated_abstract": "我们提出了一种基于Copula的方法来测试线性回归模型中的工具变量的外生性。我们展示了工具变量的外生性等价于其标准正态变换的外生性，并具有相同的累积分布函数值。然后，我们建立了一种用于测试工具变量外生性的Wald检验。我们使用模拟研究展示了我们的检验的性能。我们的模拟结果表明，如果工具变量实际上是内生的，我们的检验在5%的显著水平下大约93%的时间拒绝外生性假设。相反，当工具变量真正是外生的时候，它在数据有200个观测值时平均只有不到30%的时间拒绝外生性假设，在数据有1,000个观测值时几乎没有不到2%的时间。我们的结果证明了我们的检验的有效性，并对应用计量经济学家提供了重要价值。",
    "tldr": "本研究提出了一种基于Copula的方法来测试线性回归模型中的工具变量外生性。结果表明我们的方法在实际内生情况下能够高效地拒绝外生性假设，在外生情况下对外生性假设的拒绝率较低。对应用计量经济学家而言，这一方法具有重要价值。",
    "en_tdlr": "This study proposes a Copula-based approach to test the exogeneity of instrumental variables in linear regression models. The results demonstrate the effectiveness of our method in rejecting the exogeneity hypothesis under actual endogenous conditions and its lower rejection rate under exogenous conditions. This method offers significant value to applied econometricians."
}