{
    "title": "Zero-shot Classification using Hyperdimensional Computing. (arXiv:2401.16876v1 [cs.CV])",
    "abstract": "Classification based on Zero-shot Learning (ZSL) is the ability of a model to classify inputs into novel classes on which the model has not previously seen any training examples. Providing an auxiliary descriptor in the form of a set of attributes describing the new classes involved in the ZSL-based classification is one of the favored approaches to solving this challenging task. In this work, inspired by Hyperdimensional Computing (HDC), we propose the use of stationary binary codebooks of symbol-like distributed representations inside an attribute encoder to compactly represent a computationally simple end-to-end trainable model, which we name Hyperdimensional Computing Zero-shot Classifier~(HDC-ZSC). It consists of a trainable image encoder, an attribute encoder based on HDC, and a similarity kernel. We show that HDC-ZSC can be used to first perform zero-shot attribute extraction tasks and, can later be repurposed for Zero-shot Classification tasks with minimal architectural changes",
    "link": "http://arxiv.org/abs/2401.16876",
    "context": "Title: Zero-shot Classification using Hyperdimensional Computing. (arXiv:2401.16876v1 [cs.CV])\nAbstract: Classification based on Zero-shot Learning (ZSL) is the ability of a model to classify inputs into novel classes on which the model has not previously seen any training examples. Providing an auxiliary descriptor in the form of a set of attributes describing the new classes involved in the ZSL-based classification is one of the favored approaches to solving this challenging task. In this work, inspired by Hyperdimensional Computing (HDC), we propose the use of stationary binary codebooks of symbol-like distributed representations inside an attribute encoder to compactly represent a computationally simple end-to-end trainable model, which we name Hyperdimensional Computing Zero-shot Classifier~(HDC-ZSC). It consists of a trainable image encoder, an attribute encoder based on HDC, and a similarity kernel. We show that HDC-ZSC can be used to first perform zero-shot attribute extraction tasks and, can later be repurposed for Zero-shot Classification tasks with minimal architectural changes",
    "path": "papers/24/01/2401.16876.json",
    "total_tokens": 846,
    "translated_title": "使用超维计算的零样本分类",
    "translated_abstract": "零样本学习（ZSL）基于模型能够将输入分类到模型之前没有见过的新类别的能力。在解决这一挑战性任务时，提供一个辅助描述符，以属性集的形式描述ZSL分类中涉及的新类别，是一种被青睐的方法。受超维计算（HDC）启发，本文提出了在属性编码器内使用符号-样分布表示的二进制编码表来紧凑地表示一个计算简单的端到端可训练模型，我们将其命名为超维计算零样本分类器（HDC-ZSC）。它包括一个可训练的图像编码器、一个基于HDC的属性编码器和一个相似性核。我们展示了HDC-ZSC可以用于首先执行零样本属性提取任务，并且可以在最小架构改变的情况下，被重新用于零样本分类任务。",
    "tldr": "本论文提出了一种使用超维计算的零样本分类方法，通过在属性编码器内使用符号-样分布表示的二进制编码表来紧凑地表示模型，可以实现零样本属性提取和零样本分类任务。",
    "en_tdlr": "This paper presents a zero-shot classification method using hyperdimensional computing, which utilizes binary codebooks of symbol-like distributed representations to compactly represent a trainable model. It demonstrates the ability to perform zero-shot attribute extraction and classification tasks with minimal architectural changes."
}