{
    "title": "EMG subspace alignment and visualization for cross-subject hand gesture classification. (arXiv:2401.05386v1 [eess.SP])",
    "abstract": "Electromyograms (EMG)-based hand gesture recognition systems are a promising technology for human/machine interfaces. However, one of their main limitations is the long calibration time that is typically required to handle new users. The paper discusses and analyses the challenge of cross-subject generalization thanks to an original dataset containing the EMG signals of 14 human subjects during hand gestures. The experimental results show that, though an accurate generalization based on pooling multiple subjects is hardly achievable, it is possible to improve the cross-subject estimation by identifying a robust low-dimensional subspace for multiple subjects and aligning it to a target subject. A visualization of the subspace enables us to provide insights for the improvement of cross-subject generalization with EMG signals.",
    "link": "http://arxiv.org/abs/2401.05386",
    "context": "Title: EMG subspace alignment and visualization for cross-subject hand gesture classification. (arXiv:2401.05386v1 [eess.SP])\nAbstract: Electromyograms (EMG)-based hand gesture recognition systems are a promising technology for human/machine interfaces. However, one of their main limitations is the long calibration time that is typically required to handle new users. The paper discusses and analyses the challenge of cross-subject generalization thanks to an original dataset containing the EMG signals of 14 human subjects during hand gestures. The experimental results show that, though an accurate generalization based on pooling multiple subjects is hardly achievable, it is possible to improve the cross-subject estimation by identifying a robust low-dimensional subspace for multiple subjects and aligning it to a target subject. A visualization of the subspace enables us to provide insights for the improvement of cross-subject generalization with EMG signals.",
    "path": "papers/24/01/2401.05386.json",
    "total_tokens": 844,
    "translated_title": "EMG子空间对齐与可视化用于跨个体手势分类",
    "translated_abstract": "基于肌电图（EMG）的手势识别系统是人机界面的有前途的技术。然而，它们主要的局限性之一是通常需要长时间进行校准以适应新用户。本文通过一个包含了14名人类主体在手势期间的EMG信号的原始数据集，讨论和分析了跨个体泛化的挑战。实验结果表明，虽然基于汇集多个个体的精确泛化几乎是不可能的，但是通过识别多个个体的稳健低维子空间，并将其对齐到目标个体，可以改善跨个体估计。通过子空间的可视化，我们能够提供有关使用EMG信号改善跨个体泛化的见解。",
    "tldr": "本文研究了基于肌电图的手势识别系统中的跨个体泛化问题，并通过识别稳健的低维子空间并将其与目标个体对齐，改善了跨个体估计。通过对子空间的可视化，为使用EMG信号改善跨个体泛化提供了有益的见解。",
    "en_tdlr": "This paper addresses the issue of cross-subject generalization in EMG-based hand gesture recognition systems and improves cross-subject estimation by identifying a robust low-dimensional subspace and aligning it with the target subject. Insights for improving cross-subject generalization with EMG signals are provided through subspace visualization."
}