{
    "title": "\"All of Me\": Mining Users' Attributes from their Public Spotify Playlists. (arXiv:2401.14296v1 [cs.CR])",
    "abstract": "In the age of digital music streaming, playlists on platforms like Spotify have become an integral part of individuals' musical experiences. People create and publicly share their own playlists to express their musical tastes, promote the discovery of their favorite artists, and foster social connections. These publicly accessible playlists transcend the boundaries of mere musical preferences: they serve as sources of rich insights into users' attributes and identities. For example, the musical preferences of elderly individuals may lean more towards Frank Sinatra, while Billie Eilish remains a favored choice among teenagers. These playlists thus become windows into the diverse and evolving facets of one's musical identity.  In this work, we investigate the relationship between Spotify users' attributes and their public playlists. In particular, we focus on identifying recurring musical characteristics associated with users' individual attributes, such as demographics, habits, or perso",
    "link": "http://arxiv.org/abs/2401.14296",
    "context": "Title: \"All of Me\": Mining Users' Attributes from their Public Spotify Playlists. (arXiv:2401.14296v1 [cs.CR])\nAbstract: In the age of digital music streaming, playlists on platforms like Spotify have become an integral part of individuals' musical experiences. People create and publicly share their own playlists to express their musical tastes, promote the discovery of their favorite artists, and foster social connections. These publicly accessible playlists transcend the boundaries of mere musical preferences: they serve as sources of rich insights into users' attributes and identities. For example, the musical preferences of elderly individuals may lean more towards Frank Sinatra, while Billie Eilish remains a favored choice among teenagers. These playlists thus become windows into the diverse and evolving facets of one's musical identity.  In this work, we investigate the relationship between Spotify users' attributes and their public playlists. In particular, we focus on identifying recurring musical characteristics associated with users' individual attributes, such as demographics, habits, or perso",
    "path": "papers/24/01/2401.14296.json",
    "total_tokens": 848,
    "translated_title": "\"All of Me\": 从公开的Spotify播放列表中挖掘用户属性",
    "translated_abstract": "在数字音乐流媒体时代，像Spotify这样的平台上的播放列表已经成为个人音乐体验的重要组成部分。人们创建并公开分享自己的播放列表，以表达他们的音乐品味，推广他们最喜爱的艺术家的发现，并促进社交联系。这些可以公开访问的播放列表超越了仅仅音乐偏好的界限：它们是丰富洞察用户属性和身份的来源。例如，老年人的音乐偏好可能更偏向于弗兰克·辛纳屈，而比莉·艾利什仍然是十几岁青少年的首选。因此，这些播放列表成为了一扇了解音乐身份多样而不断演变的窗口。在这项工作中，我们研究了Spotify用户属性和他们的公开播放列表之间的关系。我们特别关注识别与用户个人属性相关的经常出现的音乐特征，例如人口统计信息，习惯或个性等。",
    "tldr": "本研究调查了Spotify用户属性与他们公开播放列表之间的关系，特别关注识别与用户个人属性相关的音乐特征。",
    "en_tdlr": "This study investigates the relationship between Spotify users' attributes and their public playlists, focusing on identifying recurring musical characteristics associated with users' individual attributes."
}