{
    "title": "Class Relevance Learning For Out-of-distribution Detection. (arXiv:2401.01021v1 [cs.CV])",
    "abstract": "Image classification plays a pivotal role across diverse applications, yet challenges persist when models are deployed in real-world scenarios. Notably, these models falter in detecting unfamiliar classes that were not incorporated during classifier training, a formidable hurdle for safe and effective real-world model deployment, commonly known as out-of-distribution (OOD) detection. While existing techniques, like max logits, aim to leverage logits for OOD identification, they often disregard the intricate interclass relationships that underlie effective detection. This paper presents an innovative class relevance learning method tailored for OOD detection. Our method establishes a comprehensive class relevance learning framework, strategically harnessing interclass relationships within the OOD pipeline. This framework significantly augments OOD detection capabilities. Extensive experimentation on diverse datasets, encompassing generic image classification datasets (Near OOD and Far O",
    "link": "http://arxiv.org/abs/2401.01021",
    "context": "Title: Class Relevance Learning For Out-of-distribution Detection. (arXiv:2401.01021v1 [cs.CV])\nAbstract: Image classification plays a pivotal role across diverse applications, yet challenges persist when models are deployed in real-world scenarios. Notably, these models falter in detecting unfamiliar classes that were not incorporated during classifier training, a formidable hurdle for safe and effective real-world model deployment, commonly known as out-of-distribution (OOD) detection. While existing techniques, like max logits, aim to leverage logits for OOD identification, they often disregard the intricate interclass relationships that underlie effective detection. This paper presents an innovative class relevance learning method tailored for OOD detection. Our method establishes a comprehensive class relevance learning framework, strategically harnessing interclass relationships within the OOD pipeline. This framework significantly augments OOD detection capabilities. Extensive experimentation on diverse datasets, encompassing generic image classification datasets (Near OOD and Far O",
    "path": "papers/24/01/2401.01021.json",
    "total_tokens": 862,
    "translated_title": "超出分布检测的类别相关学习",
    "translated_abstract": "图像分类在各种应用中起着关键作用，然而，在实际场景中部署模型时仍面临挑战。特别是，这些模型在检测未在分类器训练中纳入的陌生类别时会出现问题，这是安全和有效的现实世界模型部署中的一大障碍，通常被称为超出分布（OOD）检测。虽然现有的技术，如max logits，旨在利用logits进行OOD识别，但它们通常忽视了有效检测的复杂类别间关系。本文提出了一种针对OOD检测量身定制的创新类别相关学习方法。我们的方法建立了一个全面的类别相关学习框架，在OOD管道内战略地利用类间关系。这个框架显著增强了OOD检测能力。在包括通用图像分类数据集（Near OOD和Far OOD）的各种数据集上进行了大量实验。",
    "tldr": "本研究提出了一种针对超出分布检测的创新类别相关学习方法，通过建立一个全面的类别相关学习框架， strategically harnessing interclass relationships within the OOD pipeline，从而显著增强了OOD检测能力。"
}