{
    "title": "Training program on sign language: social inclusion through Virtual Reality in ISENSE project. (arXiv:2401.08714v1 [cs.HC])",
    "abstract": "Structured hand gestures that incorporate visual motions and signs are used in sign language. Sign language is a valuable means of daily communication for individuals who are deaf or have speech impairments, but it is still rare among hearing people, and fewer are capable of understand it. Within the academic context, parents and teachers play a crucial role in supporting deaf students from childhood by facilitating their learning of sign language. In the last years, among all the teaching tools useful for learning sign language, the use of Virtual Reality (VR) has increased, as it has been demonstrated to improve retention, memory and attention during the learning process. The ISENSE project has been created to assist students with deafness during their academic life by proposing different technological tools for teaching sign language to the hearing community in the academic context. As part of the ISENSE project, this work aims to develop an application for Spanish and Italian sign ",
    "link": "http://arxiv.org/abs/2401.08714",
    "context": "Title: Training program on sign language: social inclusion through Virtual Reality in ISENSE project. (arXiv:2401.08714v1 [cs.HC])\nAbstract: Structured hand gestures that incorporate visual motions and signs are used in sign language. Sign language is a valuable means of daily communication for individuals who are deaf or have speech impairments, but it is still rare among hearing people, and fewer are capable of understand it. Within the academic context, parents and teachers play a crucial role in supporting deaf students from childhood by facilitating their learning of sign language. In the last years, among all the teaching tools useful for learning sign language, the use of Virtual Reality (VR) has increased, as it has been demonstrated to improve retention, memory and attention during the learning process. The ISENSE project has been created to assist students with deafness during their academic life by proposing different technological tools for teaching sign language to the hearing community in the academic context. As part of the ISENSE project, this work aims to develop an application for Spanish and Italian sign ",
    "path": "papers/24/01/2401.08714.json",
    "total_tokens": 883,
    "translated_title": "手语培训计划：ISENSE项目中的虚拟现实促进社会融合",
    "translated_abstract": "手语采用了结构化的手势和视觉动作，是对于听障或言语受损个体来说一种宝贵的日常交流手段。然而，对于听觉正常的人来说，掌握手语仍然较少见，能够理解手语的人更是稀缺。在学术背景下，父母和教师在支持聋哑学生从幼年时期开始学习手语方面起着至关重要的作用。近年来，在学习手语的教育工具中，虚拟现实（VR）的应用越来越多，因为已经证明它能够在学习过程中提高记忆、保持和注意力。ISENSE项目旨在为聋哑学生在学术生活中提供支持，通过在学术环境中向听觉正常的人群教授手语的不同技术工具。作为ISENSE项目的一部分，本研究旨在开发一个应用程序，用于教授西班牙手语和意大利手语。",
    "tldr": "ISENSE项目中的虚拟现实培训程序旨在通过提供技术工具培训听觉正常的人学习手语，从而促进社会融合。"
}