{
    "title": "A Novel Approach in Solving Stochastic Generalized Linear Regression via Nonconvex Programming. (arXiv:2401.08488v1 [stat.ML])",
    "abstract": "Generalized linear regressions, such as logistic regressions or Poisson regressions, are long-studied regression analysis approaches, and their applications are widely employed in various classification problems. Our study considers a stochastic generalized linear regression model as a stochastic problem with chance constraints and tackles it using nonconvex programming techniques. Clustering techniques and quantile estimation are also used to estimate random data's mean and variance-covariance matrix. Metrics for measuring the performance of logistic regression are used to assess the model's efficacy, including the F1 score, precision score, and recall score. The results of the proposed algorithm were over 1 to 2 percent better than the ordinary logistic regression model on the same dataset with the above assessment criteria.",
    "link": "http://arxiv.org/abs/2401.08488",
    "context": "Title: A Novel Approach in Solving Stochastic Generalized Linear Regression via Nonconvex Programming. (arXiv:2401.08488v1 [stat.ML])\nAbstract: Generalized linear regressions, such as logistic regressions or Poisson regressions, are long-studied regression analysis approaches, and their applications are widely employed in various classification problems. Our study considers a stochastic generalized linear regression model as a stochastic problem with chance constraints and tackles it using nonconvex programming techniques. Clustering techniques and quantile estimation are also used to estimate random data's mean and variance-covariance matrix. Metrics for measuring the performance of logistic regression are used to assess the model's efficacy, including the F1 score, precision score, and recall score. The results of the proposed algorithm were over 1 to 2 percent better than the ordinary logistic regression model on the same dataset with the above assessment criteria.",
    "path": "papers/24/01/2401.08488.json",
    "total_tokens": 767,
    "translated_title": "通过非凸规划解决随机广义线性回归的新方法",
    "translated_abstract": "广义线性回归(如逻辑回归或泊松回归)是长期研究的回归分析方法，在各种分类问题中广泛应用。我们的研究将随机广义线性回归模型视为带有机会约束的随机问题，并使用非凸规划技术解决它。同时运用聚类技术和分位数估计来估计随机数据的均值和方差-协方差矩阵。使用F1得分、精确度得分和召回率得分等指标来评估逻辑回归模型的效果。在相同数据集上，所提算法的结果比普通逻辑回归模型在以上评估标准上提高了1-2个百分点。",
    "tldr": "通过非凸规划技术，利用聚类和分位数估计的方法解决了随机广义线性回归模型，并在各种指标上表现优于传统模型。",
    "en_tdlr": "A novel approach using nonconvex programming, clustering, and quantile estimation has been proposed to solve the stochastic generalized linear regression model, outperforming the traditional model in various evaluation metrics."
}