{
    "title": "CAVIAR: Co-simulation of 6G Communications, 3D Scenarios and AI for Digital Twins. (arXiv:2401.03310v1 [cs.NI])",
    "abstract": "Digital twins are an important technology for advancing mobile communications, specially in use cases that require simultaneously simulating the wireless channel, 3D scenes and machine learning. Aiming at providing a solution to this demand, this work describes a modular co-simulation methodology called CAVIAR. Here, CAVIAR is upgraded to support a message passing library and enable the virtual counterpart of a digital twin system using different 6G-related simulators. The main contributions of this work are the detailed description of different CAVIAR architectures, the implementation of this methodology to assess a 6G use case of UAV-based search and rescue mission (SAR), and the generation of benchmarking data about the computational resource usage. For executing the SAR co-simulation we adopt five open-source solutions: the physical and link level network simulator Sionna, the simulator for autonomous vehicles AirSim, scikit-learn for training a decision tree for MIMO beam selectio",
    "link": "http://arxiv.org/abs/2401.03310",
    "context": "Title: CAVIAR: Co-simulation of 6G Communications, 3D Scenarios and AI for Digital Twins. (arXiv:2401.03310v1 [cs.NI])\nAbstract: Digital twins are an important technology for advancing mobile communications, specially in use cases that require simultaneously simulating the wireless channel, 3D scenes and machine learning. Aiming at providing a solution to this demand, this work describes a modular co-simulation methodology called CAVIAR. Here, CAVIAR is upgraded to support a message passing library and enable the virtual counterpart of a digital twin system using different 6G-related simulators. The main contributions of this work are the detailed description of different CAVIAR architectures, the implementation of this methodology to assess a 6G use case of UAV-based search and rescue mission (SAR), and the generation of benchmarking data about the computational resource usage. For executing the SAR co-simulation we adopt five open-source solutions: the physical and link level network simulator Sionna, the simulator for autonomous vehicles AirSim, scikit-learn for training a decision tree for MIMO beam selectio",
    "path": "papers/24/01/2401.03310.json",
    "total_tokens": 949,
    "translated_title": "CAVIAR: 用于数字孪生的6G通信，3D场景和人工智能的协同仿真",
    "translated_abstract": "数字孪生是推进移动通信技术的重要技术，特别是在需要同时模拟无线信道，3D场景和机器学习的应用场景中。为了解决这一需求，本文介绍了一种模块化协同仿真方法，称为CAVIAR。在这里，CAVIAR被升级以支持消息传递库，并利用不同的6G相关模拟器实现数字孪生系统的虚拟对应物。本文的主要贡献包括对不同CAVIAR架构的详细描述，将该方法应用于评估基于无人机的搜索和救援任务（SAR）的6G用例，并生成有关计算资源使用情况的基准数据。为了执行SAR协同仿真，我们采用了五个开源解决方案：物理和链路级网络模拟器Sionna，自主车辆模拟器AirSim，scikit-learn用于训练用于MIMO波束选择的决策树。",
    "tldr": "CAVIAR是一种用于数字孪生的6G通信，3D场景和AI的协同仿真方法，其主要贡献包括不同架构的详细描述，应用于6G中的无人机搜索和救援任务，并生成有关计算资源使用情况的基准数据。",
    "en_tdlr": "CAVIAR is a modular co-simulation methodology for digital twins in 6G communications, 3D scenarios, and AI. Its main contributions are detailed descriptions of different architectures, application in a 6G use case of UAV-based search and rescue mission, and benchmarking data on computational resource usage."
}