{
    "title": "Lightweight Fish Classification Model for Sustainable Marine Management: Indonesian Case. (arXiv:2401.02278v1 [cs.CV])",
    "abstract": "The enormous demand for seafood products has led to exploitation of marine resources and near-extinction of some species. In particular, overfishing is one the main issues in sustainable marine development. In alignment with the protection of marine resources and sustainable fishing, this study proposes to advance fish classification techniques that support identifying protected fish species using state-of-the-art machine learning. We use a custom modification of the MobileNet model to design a lightweight classifier called M-MobileNet that is capable of running on limited hardware. As part of the study, we compiled a labeled dataset of 37,462 images of fish found in the waters of the Indonesian archipelago. The proposed model is trained on the dataset to classify images of the captured fish into their species and give recommendations on whether they are consumable or not. Our modified MobileNet model uses only 50\\% of the top layer parameters with about 42% GTX 860M utility and achiev",
    "link": "http://arxiv.org/abs/2401.02278",
    "context": "Title: Lightweight Fish Classification Model for Sustainable Marine Management: Indonesian Case. (arXiv:2401.02278v1 [cs.CV])\nAbstract: The enormous demand for seafood products has led to exploitation of marine resources and near-extinction of some species. In particular, overfishing is one the main issues in sustainable marine development. In alignment with the protection of marine resources and sustainable fishing, this study proposes to advance fish classification techniques that support identifying protected fish species using state-of-the-art machine learning. We use a custom modification of the MobileNet model to design a lightweight classifier called M-MobileNet that is capable of running on limited hardware. As part of the study, we compiled a labeled dataset of 37,462 images of fish found in the waters of the Indonesian archipelago. The proposed model is trained on the dataset to classify images of the captured fish into their species and give recommendations on whether they are consumable or not. Our modified MobileNet model uses only 50\\% of the top layer parameters with about 42% GTX 860M utility and achiev",
    "path": "papers/24/01/2401.02278.json",
    "total_tokens": 949,
    "translated_title": "轻量级鱼类分类模型在可持续海洋管理中的应用: 印度尼西亚案例。",
    "translated_abstract": "对海产品的巨大需求导致了对海洋资源的过度开发和一些物种濒临灭绝。在可持续海洋发展中，过度捕捞是其中一个主要问题。为了保护海洋资源和可持续捕捞，本研究提出了一种先进的鱼类分类技术，利用最先进的机器学习方法来识别受保护的鱼类物种。我们使用改进的MobileNet模型设计了一个轻量级分类器M-MobileNet，可以在有限硬件上运行。作为研究的一部分，我们编制了一个包含37,462张印度尼西亚群岛水域鱼类图片的标注数据集。所提出的模型对数据集进行训练，将捕获的鱼类的图像分类为不同的物种，并给出是否可食用的建议。我们修改的MobileNet模型仅使用了50%的顶层参数，约42%的GTX 860M利用率，并实现了。",
    "tldr": "这项研究提出了一种轻量级的鱼类分类模型，利用机器学习技术识别保护鱼类物种，并在有限硬件上运行。该模型在印度尼西亚水域的鱼类图像数据集上进行训练，可以对捕获的鱼类进行分类，并给出是否可食用的建议。",
    "en_tdlr": "This study proposes a lightweight fish classification model that utilizes machine learning to identify protected fish species and runs on limited hardware. The model is trained on a fish image dataset from Indonesian waters, enabling it to classify captured fish and provide recommendations on their edibility."
}