{
    "title": "Coupled Variational Autoencoder. (arXiv:2306.02565v1 [stat.ML])",
    "abstract": "Variational auto-encoders are powerful probabilistic models in generative tasks but suffer from generating low-quality samples which are caused by the holes in the prior. We propose the Coupled Variational Auto-Encoder (C-VAE), which formulates the VAE problem as one of Optimal Transport (OT) between the prior and data distributions. The C-VAE allows greater flexibility in priors and natural resolution of the prior hole problem by enforcing coupling between the prior and the data distribution and enables flexible optimization through the primal, dual, and semi-dual formulations of entropic OT. Simulations on synthetic and real data show that the C-VAE outperforms alternatives including VAE, WAE, and InfoVAE in fidelity to the data, quality of the latent representation, and in quality of generated samples.",
    "link": "http://arxiv.org/abs/2306.02565",
    "context": "Title: Coupled Variational Autoencoder. (arXiv:2306.02565v1 [stat.ML])\nAbstract: Variational auto-encoders are powerful probabilistic models in generative tasks but suffer from generating low-quality samples which are caused by the holes in the prior. We propose the Coupled Variational Auto-Encoder (C-VAE), which formulates the VAE problem as one of Optimal Transport (OT) between the prior and data distributions. The C-VAE allows greater flexibility in priors and natural resolution of the prior hole problem by enforcing coupling between the prior and the data distribution and enables flexible optimization through the primal, dual, and semi-dual formulations of entropic OT. Simulations on synthetic and real data show that the C-VAE outperforms alternatives including VAE, WAE, and InfoVAE in fidelity to the data, quality of the latent representation, and in quality of generated samples.",
    "path": "papers/23/06/2306.02565.json",
    "total_tokens": 868,
    "translated_title": "联合变分自编码器",
    "translated_abstract": "变分自编码器在生成任务中是强大的概率模型，但会产生低质量的样本，这是由于先验中存在空洞所导致的。我们提出了联合变分自编码器(C-VAE)，将VAE问题制定为先验和数据分布之间的最优输运(OT)问题。C-VAE通过在先验和数据分布之间强制耦合，实现了对先验的更大灵活性和自然地解决了先验存在的空洞问题，并通过熵OT的原始、对偶和半对偶形式实现了灵活的优化。对合成和真实数据的模拟表明，C-VAE在数据的保真度、潜在表示的质量和生成样本的质量等方面优于其他替代方案，包括VAE、WAE和InfoVAE。",
    "tldr": "C-VAE通过将VAE问题制定为最优输运问题并在先验和数据分布之间强制耦合，实现了对先验的更大灵活性、解决了先验存在的空洞问题，并在保真度、潜在表示的质量和生成样本的质量等方面优于VAE、WAE和InfoVAE等替代方案。",
    "en_tdlr": "C-VAE formulates the VAE problem as an optimal transport (OT) problem between the prior and data distributions, and enforces coupling between them, which provides greater flexibility and naturally resolves the prior hole problem. C-VAE outperforms alternatives including VAE, WAE, and InfoVAE in fidelity to the data, quality of the latent representation, and in quality of generated samples on synthetic and real data."
}