{
    "title": "MPSTAN: Metapopulation-based Spatio-Temporal Attention Network for Epidemic Forecasting. (arXiv:2306.12436v1 [cs.LG])",
    "abstract": "Accurate epidemic forecasting plays a vital role for governments in developing effective prevention measures for suppressing epidemics. Most of the present spatio-temporal models cannot provide a general framework for stable, and accurate forecasting of epidemics with diverse evolution trends. Incorporating epidemiological domain knowledge ranging from single-patch to multi-patch into neural networks is expected to improve forecasting accuracy. However, relying solely on single-patch knowledge neglects inter-patch interactions, while constructing multi-patch knowledge is challenging without population mobility data. To address the aforementioned problems, we propose a novel hybrid model called Metapopulation-based Spatio-Temporal Attention Network (MPSTAN). This model aims to improve the accuracy of epidemic forecasting by incorporating multi-patch epidemiological knowledge into a spatio-temporal model and adaptively defining inter-patch interactions. Moreover, we incorporate inter-pat",
    "link": "http://arxiv.org/abs/2306.12436",
    "context": "Title: MPSTAN: Metapopulation-based Spatio-Temporal Attention Network for Epidemic Forecasting. (arXiv:2306.12436v1 [cs.LG])\nAbstract: Accurate epidemic forecasting plays a vital role for governments in developing effective prevention measures for suppressing epidemics. Most of the present spatio-temporal models cannot provide a general framework for stable, and accurate forecasting of epidemics with diverse evolution trends. Incorporating epidemiological domain knowledge ranging from single-patch to multi-patch into neural networks is expected to improve forecasting accuracy. However, relying solely on single-patch knowledge neglects inter-patch interactions, while constructing multi-patch knowledge is challenging without population mobility data. To address the aforementioned problems, we propose a novel hybrid model called Metapopulation-based Spatio-Temporal Attention Network (MPSTAN). This model aims to improve the accuracy of epidemic forecasting by incorporating multi-patch epidemiological knowledge into a spatio-temporal model and adaptively defining inter-patch interactions. Moreover, we incorporate inter-pat",
    "path": "papers/23/06/2306.12436.json",
    "total_tokens": 1098,
    "translated_title": "基于元群体和时空关注网络的流行病预测模型(MPSTAN)",
    "translated_abstract": "准确的流行病预测对政府制定有效的防控措施至关重要。当前大多数时空模型不能提供稳定、准确预测多样化流行趋势的常规框架。将传染病领域知识从单个斑点到多个斑点融入神经网络，有望提高预测准确性。然而，仅依赖单个斑点知识忽视了斑点间的相互作用，而构建多斑点知识在缺乏人口流动性数据的情况下具有挑战性。为解决上述问题，我们提出了一种名为基于元群体和时空关注网络(MPSTAN)的混合模型。该模型旨在通过将多斑点流行病学知识融入时空模型并自适应地定义斑点间相互作用，提高流行病预测的准确性。此外，我们利用元群体理论将斑点间相互作用纳入模型，为构建多斑点知识提供了可行的方法。对真实世界数据集的广泛实验表明，与现有方法相比，我们的模型具有最先进的性能。",
    "tldr": "提出了一种名为MPSTAN的混合模型，通过将多斑点流行病学知识融入时空模型并自适应地定义斑点间相互作用，提高流行病预测的准确性，并且使用元群体理论将斑点间相互作用纳入模型，为构建多斑点知识提供了可行的方法。该模型在真实世界数据集上表现最先进。",
    "en_tdlr": "A hybrid model, MPSTAN, is proposed to improve epidemic forecasting accuracy by incorporating multi-patch epidemiological knowledge into a spatio-temporal model and adaptively defining inter-patch interactions. The model also uses metapopulation theory to incorporate inter-patch interactions without mobility data, achieving state-of-the-art performance on real-world datasets."
}