{
    "title": "Active Data Acquisition in Autonomous Driving Simulation. (arXiv:2306.13923v1 [cs.LG])",
    "abstract": "Autonomous driving algorithms rely heavily on learning-based models, which require large datasets for training. However, there is often a large amount of redundant information in these datasets, while collecting and processing these datasets can be time-consuming and expensive. To address this issue, this paper proposes the concept of an active data-collecting strategy. For high-quality data, increasing the collection density can improve the overall quality of the dataset, ultimately achieving similar or even better results than the original dataset with lower labeling costs and smaller dataset sizes. In this paper, we design experiments to verify the quality of the collected dataset and to demonstrate this strategy can significantly reduce labeling costs and dataset size while improving the overall quality of the dataset, leading to better performance of autonomous driving systems. The source code implementing the proposed approach is publicly available on https://github.com/Th1nkMore",
    "link": "http://arxiv.org/abs/2306.13923",
    "context": "Title: Active Data Acquisition in Autonomous Driving Simulation. (arXiv:2306.13923v1 [cs.LG])\nAbstract: Autonomous driving algorithms rely heavily on learning-based models, which require large datasets for training. However, there is often a large amount of redundant information in these datasets, while collecting and processing these datasets can be time-consuming and expensive. To address this issue, this paper proposes the concept of an active data-collecting strategy. For high-quality data, increasing the collection density can improve the overall quality of the dataset, ultimately achieving similar or even better results than the original dataset with lower labeling costs and smaller dataset sizes. In this paper, we design experiments to verify the quality of the collected dataset and to demonstrate this strategy can significantly reduce labeling costs and dataset size while improving the overall quality of the dataset, leading to better performance of autonomous driving systems. The source code implementing the proposed approach is publicly available on https://github.com/Th1nkMore",
    "path": "papers/23/06/2306.13923.json",
    "total_tokens": 856,
    "translated_title": "自动驾驶模拟中的主动数据采集",
    "translated_abstract": "自动驾驶算法高度依赖基于学习的模型，这些模型需要大量的数据集进行训练。然而，这些数据集通常包含大量冗余信息，而且收集和处理这些数据集可能非常耗时和昂贵。为了解决这个问题，本文提出了主动数据采集策略的概念。对于高质量的数据，增加采集密度可以提高数据集的整体质量，最终实现与原始数据集类似甚至更好的结果，同时降低标注成本和数据集大小。本文设计了实验来验证收集的数据集的质量，并演示该策略可以显著降低标注成本和数据集大小，同时提高数据集的整体质量，从而提高自动驾驶系统的性能。实现所提出方法的源代码可在https://github.com/Th1nkMore公开获取。",
    "tldr": "本文提出了一种主动数据采集策略来解决自动驾驶模拟中大量冗余数据集的问题，并通过实验验证，该策略可以显著降低标注成本和数据集大小，同时提高数据集的整体质量，从而提高自动驾驶系统的性能。",
    "en_tdlr": "This paper proposes an active data-collecting strategy to address the issue of redundant datasets in autonomous driving simulations, demonstrating its effectiveness in reducing labeling costs and dataset size while improving overall dataset quality and autonomous driving system performance through experiments."
}