{
    "title": "Uncovering solutions from data corrupted by systematic errors: A physics-constrained convolutional neural network approach. (arXiv:2306.04600v1 [physics.flu-dyn])",
    "abstract": "Information on natural phenomena and engineering systems is typically contained in data. Data can be corrupted by systematic errors in models and experiments. In this paper, we propose a tool to uncover the spatiotemporal solution of the underlying physical system by removing the systematic errors from data. The tool is the physics-constrained convolutional neural network (PC-CNN), which combines information from both the systems governing equations and data. We focus on fundamental phenomena that are modelled by partial differential equations, such as linear convection, Burgers equation, and two-dimensional turbulence. First, we formulate the problem, describe the physics-constrained convolutional neural network, and parameterise the systematic error. Second, we uncover the solutions from data corrupted by large multimodal systematic errors. Third, we perform a parametric study for different systematic errors. We show that the method is robust. Fourth, we analyse the physical properti",
    "link": "http://arxiv.org/abs/2306.04600",
    "context": "Title: Uncovering solutions from data corrupted by systematic errors: A physics-constrained convolutional neural network approach. (arXiv:2306.04600v1 [physics.flu-dyn])\nAbstract: Information on natural phenomena and engineering systems is typically contained in data. Data can be corrupted by systematic errors in models and experiments. In this paper, we propose a tool to uncover the spatiotemporal solution of the underlying physical system by removing the systematic errors from data. The tool is the physics-constrained convolutional neural network (PC-CNN), which combines information from both the systems governing equations and data. We focus on fundamental phenomena that are modelled by partial differential equations, such as linear convection, Burgers equation, and two-dimensional turbulence. First, we formulate the problem, describe the physics-constrained convolutional neural network, and parameterise the systematic error. Second, we uncover the solutions from data corrupted by large multimodal systematic errors. Third, we perform a parametric study for different systematic errors. We show that the method is robust. Fourth, we analyse the physical properti",
    "path": "papers/23/06/2306.04600.json",
    "total_tokens": 742,
    "translated_title": "一种基于物理约束卷积神经网络方法的数据误差修正工具",
    "translated_abstract": "自然现象和工程系统的信息通常包含在数据中。 然而，数据可能会被模型和实验中的系统性误差所损坏。 本文提出了一种工具，即基于物理约束卷积神经网络（PC-CNN），通过从数据中删除系统误差来揭示潜在物理系统的时空解。 PC-CNN结合了系统控制方程和数据的信息。 我们重点关注由偏微分方程模拟的基础现象，例如线性对流，Burgers方程和二维湍流。",
    "tldr": "本文提出了一种基于物理约束卷积神经网络的方法，可以从受到系统误差影响的数据中还原出潜在物理系统的时空解。"
}