{
    "title": "Quantum Pufferfish Privacy: A Flexible Privacy Framework for Quantum Systems. (arXiv:2306.13054v1 [quant-ph])",
    "abstract": "We propose a versatile privacy framework for quantum systems, termed quantum pufferfish privacy (QPP). Inspired by classical pufferfish privacy, our formulation generalizes and addresses limitations of quantum differential privacy by offering flexibility in specifying private information, feasible measurements, and domain knowledge. We show that QPP can be equivalently formulated in terms of the Datta-Leditzky information spectrum divergence, thus providing the first operational interpretation thereof. We reformulate this divergence as a semi-definite program and derive several properties of it, which are then used to prove convexity, composability, and post-processing of QPP mechanisms. Parameters that guarantee QPP of the depolarization mechanism are also derived. We analyze the privacy-utility tradeoff of general QPP mechanisms and, again, study the depolarization mechanism as an explicit instance. The QPP framework is then applied to privacy auditing for identifying privacy violati",
    "link": "http://arxiv.org/abs/2306.13054",
    "context": "Title: Quantum Pufferfish Privacy: A Flexible Privacy Framework for Quantum Systems. (arXiv:2306.13054v1 [quant-ph])\nAbstract: We propose a versatile privacy framework for quantum systems, termed quantum pufferfish privacy (QPP). Inspired by classical pufferfish privacy, our formulation generalizes and addresses limitations of quantum differential privacy by offering flexibility in specifying private information, feasible measurements, and domain knowledge. We show that QPP can be equivalently formulated in terms of the Datta-Leditzky information spectrum divergence, thus providing the first operational interpretation thereof. We reformulate this divergence as a semi-definite program and derive several properties of it, which are then used to prove convexity, composability, and post-processing of QPP mechanisms. Parameters that guarantee QPP of the depolarization mechanism are also derived. We analyze the privacy-utility tradeoff of general QPP mechanisms and, again, study the depolarization mechanism as an explicit instance. The QPP framework is then applied to privacy auditing for identifying privacy violati",
    "path": "papers/23/06/2306.13054.json",
    "total_tokens": 1037,
    "translated_title": "量子河豚隐私：一种灵活的量子系统隐私框架",
    "translated_abstract": "我们提出了一种用于量子系统的通用隐私框架，称为量子河豚隐私（QPP）。受经典河豚隐私的启发，我们的公式概括并解决了量子差分隐私的局限性，通过在指定私有信息、可行的测量和域知识方面提供灵活性。我们展示了QPP可以等效地用Datta-Leditzky信息谱散度来表示，从而首次提供了它的操作解释。我们将这种差异重新表述为半定规划，并推导出它的几个属性，然后用这些属性证明了QPP机制的凸性、组合性和后处理。还推导了保证去极化机制QPP的参数。我们分析了普通QPP机制的隐私效用权衡，并再次以去极化机制为例研究其明确实例。然后将QPP框架应用于隐私审计，以识别隐私侵犯。",
    "tldr": "本文提出了一种称为量子河豚隐私(QPP)的通用隐私框架，通过在指定私有信息、可行的测量和域知识方面提供灵活性，实现了量子差分隐私的概括和克服限制。同时，首次提供了QPP的操作解释，并证明了QPP的凸性、组合性和后处理，推导了保证去极化机制QPP的参数，并将QPP框架应用于隐私审计，以识别隐私侵犯。",
    "en_tdlr": "The paper proposes a versatile privacy framework for quantum systems, called Quantum Pufferfish Privacy (QPP), which addresses limitations of quantum differential privacy and provides flexibility in specifying private information, measurements, and domain knowledge. QPP is equivalently formulated in terms of the Datta-Leditzky information spectrum divergence and has been proved for its convexity, composability, and post-processing of QPP mechanisms. It also explores the privacy-utility tradeoff of general QPP mechanisms and applies QPP framework to privacy auditing for identifying privacy violations."
}