{
    "title": "Multi-level Multiple Instance Learning with Transformer for Whole Slide Image Classification. (arXiv:2306.05029v1 [cs.CV])",
    "abstract": "Whole slide image (WSI) refers to a type of high-resolution scanned tissue image, which is extensively employed in computer-assisted diagnosis (CAD). The extremely high resolution and limited availability of region-level annotations make it challenging to employ deep learning methods for WSI-based digital diagnosis. Multiple instance learning (MIL) is a powerful tool to address the weak annotation problem, while Transformer has shown great success in the field of visual tasks. The combination of both should provide new insights for deep learning based image diagnosis. However, due to the limitations of single-level MIL and the attention mechanism's constraints on sequence length, directly applying Transformer to WSI-based MIL tasks is not practical. To tackle this issue, we propose a Multi-level MIL with Transformer (MMIL-Transformer) approach. By introducing a hierarchical structure to MIL, this approach enables efficient handling of MIL tasks that involve a large number of instances.",
    "link": "http://arxiv.org/abs/2306.05029",
    "context": "Title: Multi-level Multiple Instance Learning with Transformer for Whole Slide Image Classification. (arXiv:2306.05029v1 [cs.CV])\nAbstract: Whole slide image (WSI) refers to a type of high-resolution scanned tissue image, which is extensively employed in computer-assisted diagnosis (CAD). The extremely high resolution and limited availability of region-level annotations make it challenging to employ deep learning methods for WSI-based digital diagnosis. Multiple instance learning (MIL) is a powerful tool to address the weak annotation problem, while Transformer has shown great success in the field of visual tasks. The combination of both should provide new insights for deep learning based image diagnosis. However, due to the limitations of single-level MIL and the attention mechanism's constraints on sequence length, directly applying Transformer to WSI-based MIL tasks is not practical. To tackle this issue, we propose a Multi-level MIL with Transformer (MMIL-Transformer) approach. By introducing a hierarchical structure to MIL, this approach enables efficient handling of MIL tasks that involve a large number of instances.",
    "path": "papers/23/06/2306.05029.json",
    "total_tokens": 840,
    "translated_title": "基于Transformer的多级多示例学习用于全扫描图像分类",
    "translated_abstract": "全扫描图像（WSI）是一种高分辨率的组织扫描图像，被广泛用于计算机辅助诊断（CAD）。由于极高的分辨率和区域级别注释的有限性，对于基于WSI的数字诊断使用深度学习方法是具有挑战性的。多示例学习（MIL）是解决弱注释问题的强有力工具，而Transformer已在视觉任务领域表现出了巨大的成功。结合两者将为基于深度学习的图像诊断提供新的见解。然而，由于单级MIL的限制和注意机制对序列长度的限制，将Transformer直接应用于基于WSI的MIL任务并不实用。为了解决这个问题，我们提出了一种多级MIL与Transformer（MMIL-Transformer）方法。通过引入层次结构到MIL中，这种方法能够有效地处理涉及大量实例的MIL任务。",
    "tldr": "本文提出了一种基于Transformer的多级多示例学习（MMIL-Transformer）方法，该方法能够有效地处理涉及大量实例的MIL任务。",
    "en_tdlr": "This paper proposes a Multi-level Multiple Instance Learning with Transformer (MMIL-Transformer) approach to efficiently handle MIL tasks involving a large number of instances in whole slide image (WSI) classification."
}