{
    "title": "MP3: Movement Primitive-Based (Re-)Planning Policy. (arXiv:2306.12729v1 [cs.LG])",
    "abstract": "We introduce a novel deep reinforcement learning (RL) approach called Movement Prmitive-based Planning Policy (MP3). By integrating movement primitives (MPs) into the deep RL framework, MP3 enables the generation of smooth trajectories throughout the whole learning process while effectively learning from sparse and non-Markovian rewards. Additionally, MP3 maintains the capability to adapt to changes in the environment during execution. Although many early successes in robot RL have been achieved by combining RL with MPs, these approaches are often limited to learning single stroke-based motions, lacking the ability to adapt to task variations or adjust motions during execution. Building upon our previous work, which introduced an episode-based RL method for the non-linear adaptation of MP parameters to different task variations, this paper extends the approach to incorporating replanning strategies. This allows adaptation of the MP parameters throughout motion execution, addressing the",
    "link": "http://arxiv.org/abs/2306.12729",
    "context": "Title: MP3: Movement Primitive-Based (Re-)Planning Policy. (arXiv:2306.12729v1 [cs.LG])\nAbstract: We introduce a novel deep reinforcement learning (RL) approach called Movement Prmitive-based Planning Policy (MP3). By integrating movement primitives (MPs) into the deep RL framework, MP3 enables the generation of smooth trajectories throughout the whole learning process while effectively learning from sparse and non-Markovian rewards. Additionally, MP3 maintains the capability to adapt to changes in the environment during execution. Although many early successes in robot RL have been achieved by combining RL with MPs, these approaches are often limited to learning single stroke-based motions, lacking the ability to adapt to task variations or adjust motions during execution. Building upon our previous work, which introduced an episode-based RL method for the non-linear adaptation of MP parameters to different task variations, this paper extends the approach to incorporating replanning strategies. This allows adaptation of the MP parameters throughout motion execution, addressing the",
    "path": "papers/23/06/2306.12729.json",
    "total_tokens": 904,
    "tldr": "MP3是一种新的深度强化学习方法，能够学习稀疏和非马尔可夫奖励，并在执行期间适应环境变化。与其他RL和MPs组合的方法不同，MP3也具有适应任务变化和在执行期间调整运动的能力。"
}