{
    "title": "A Formal Perspective on Byte-Pair Encoding. (arXiv:2306.16837v1 [cs.CL])",
    "abstract": "Byte-Pair Encoding (BPE) is a popular algorithm used for tokenizing data in NLP, despite being devised initially as a compression method. BPE appears to be a greedy algorithm at face value, but the underlying optimization problem that BPE seeks to solve has not yet been laid down. We formalize BPE as a combinatorial optimization problem. Via submodular functions, we prove that the iterative greedy version is a $\\frac{1}{{\\sigma(\\boldsymbol{\\mu}^\\star)}}(1-e^{-{\\sigma(\\boldsymbol{\\mu}^\\star)}})$-approximation of an optimal merge sequence, where ${\\sigma(\\boldsymbol{\\mu}^\\star)}$ is the total backward curvature with respect to the optimal merge sequence $\\boldsymbol{\\mu}^\\star$. Empirically the lower bound of the approximation is $\\approx 0.37$.  We provide a faster implementation of BPE which improves the runtime complexity from $\\mathcal{O}\\left(N M\\right)$ to $\\mathcal{O}\\left(N \\log M\\right)$, where $N$ is the sequence length and $M$ is the merge count. Finally, we optimize the brute",
    "link": "http://arxiv.org/abs/2306.16837",
    "context": "Title: A Formal Perspective on Byte-Pair Encoding. (arXiv:2306.16837v1 [cs.CL])\nAbstract: Byte-Pair Encoding (BPE) is a popular algorithm used for tokenizing data in NLP, despite being devised initially as a compression method. BPE appears to be a greedy algorithm at face value, but the underlying optimization problem that BPE seeks to solve has not yet been laid down. We formalize BPE as a combinatorial optimization problem. Via submodular functions, we prove that the iterative greedy version is a $\\frac{1}{{\\sigma(\\boldsymbol{\\mu}^\\star)}}(1-e^{-{\\sigma(\\boldsymbol{\\mu}^\\star)}})$-approximation of an optimal merge sequence, where ${\\sigma(\\boldsymbol{\\mu}^\\star)}$ is the total backward curvature with respect to the optimal merge sequence $\\boldsymbol{\\mu}^\\star$. Empirically the lower bound of the approximation is $\\approx 0.37$.  We provide a faster implementation of BPE which improves the runtime complexity from $\\mathcal{O}\\left(N M\\right)$ to $\\mathcal{O}\\left(N \\log M\\right)$, where $N$ is the sequence length and $M$ is the merge count. Finally, we optimize the brute",
    "path": "papers/23/06/2306.16837.json",
    "total_tokens": 963,
    "translated_title": "Byte-Pair编码的形式化视角",
    "translated_abstract": "Byte-Pair编码（BPE）是一种用于自然语言处理中的数据标记算法，尽管最初是作为一种压缩方法而设计的。BPE表面上看起来是一种贪婪算法，但是BPE寻求解决的底层优化问题尚未明确。我们将BPE形式化为组合优化问题。通过子模函数，我们证明了迭代贪婪版本是一个对于最优合并序列的$\\frac{1}{{\\sigma(\\boldsymbol{\\mu}^\\star)}}(1-e^{-{\\sigma(\\boldsymbol{\\mu}^\\star)}})$-近似解，其中${\\sigma(\\boldsymbol{\\mu}^\\star)}$是相对于最优合并序列$\\boldsymbol{\\mu}^\\star$的总向后曲率。经验证近似解的下界约为$\\approx 0.37$。我们提供了一个更快的BPE实现，将运行时间复杂度从$\\mathcal{O}\\left(N M\\right)$优化为$\\mathcal{O}\\left(N \\log M\\right)$，其中$N$是序列长度，$M$是合并次数。最后，我们优化了暴力搜索法。",
    "tldr": "这篇论文从形式化的角度对Byte-Pair编码进行了研究，将其形式化为组合优化问题，证明了迭代贪婪版本是对最优合并序列的近似解，并优化了算法的运行时间复杂度。",
    "en_tdlr": "This paper provides a formal perspective on Byte-Pair Encoding (BPE), formulating it as a combinatorial optimization problem. It proves that the iterative greedy version is an approximation solution for the optimal merge sequence, and optimizes the runtime complexity of the algorithm."
}