{
    "title": "Generalized Time Warping Invariant Dictionary Learning for Time Series Classification and Clustering. (arXiv:2306.17690v1 [stat.ML])",
    "abstract": "Dictionary learning is an effective tool for pattern recognition and classification of time series data. Among various dictionary learning techniques, the dynamic time warping (DTW) is commonly used for dealing with temporal delays, scaling, transformation, and many other kinds of temporal misalignments issues. However, the DTW suffers overfitting or information loss due to its discrete nature in aligning time series data. To address this issue, we propose a generalized time warping invariant dictionary learning algorithm in this paper. Our approach features a generalized time warping operator, which consists of linear combinations of continuous basis functions for facilitating continuous temporal warping. The integration of the proposed operator and the dictionary learning is formulated as an optimization problem, where the block coordinate descent method is employed to jointly optimize warping paths, dictionaries, and sparseness coefficients. The optimized results are then used as hy",
    "link": "http://arxiv.org/abs/2306.17690",
    "context": "Title: Generalized Time Warping Invariant Dictionary Learning for Time Series Classification and Clustering. (arXiv:2306.17690v1 [stat.ML])\nAbstract: Dictionary learning is an effective tool for pattern recognition and classification of time series data. Among various dictionary learning techniques, the dynamic time warping (DTW) is commonly used for dealing with temporal delays, scaling, transformation, and many other kinds of temporal misalignments issues. However, the DTW suffers overfitting or information loss due to its discrete nature in aligning time series data. To address this issue, we propose a generalized time warping invariant dictionary learning algorithm in this paper. Our approach features a generalized time warping operator, which consists of linear combinations of continuous basis functions for facilitating continuous temporal warping. The integration of the proposed operator and the dictionary learning is formulated as an optimization problem, where the block coordinate descent method is employed to jointly optimize warping paths, dictionaries, and sparseness coefficients. The optimized results are then used as hy",
    "path": "papers/23/06/2306.17690.json",
    "total_tokens": 994,
    "translated_title": "泛化时间扭曲不变字典学习用于时间序列分类和聚类",
    "translated_abstract": "字典学习是时间序列数据模式识别和分类的有效工具。在各种字典学习技术中，动态时间扭曲（DTW）通常用于处理时间延迟、缩放、转换和其他各种时间不准确性问题。然而，由于DTW在对齐时间序列数据时是离散的性质，因此容易出现过拟合或信息损失的问题。为了解决这个问题，本文提出了一种泛化时间扭曲不变字典学习算法。我们的方法采用了泛化时间扭曲算子，该算子由连续基函数的线性组合构成，以便实现连续的时间扭曲。将所提出的算子与字典学习相结合，将其建模为一个优化问题，并采用块坐标下降法来联合优化扭曲路径、字典和稀疏系数。优化结果被用作特征提取和分类的提取。实验结果表明，我们的方法在时间序列分类和聚类任务中取得了优秀的性能。",
    "tldr": "本文提出了一种泛化时间扭曲不变字典学习算法，用于处理时间序列数据的模式识别和分类。该算法通过使用连续基函数的线性组合来构建泛化时间扭曲算子，以实现连续的时间扭曲。通过联合优化扭曲路径、字典和稀疏系数，我们的算法在时间序列分类和聚类任务中取得了优秀的性能。",
    "en_tdlr": "This paper proposes a generalized time warping invariant dictionary learning algorithm for pattern recognition and classification of time series data. The algorithm uses a generalized time warping operator, constructed by linear combinations of continuous basis functions, to achieve continuous temporal warping. By jointly optimizing warping paths, dictionaries, and sparseness coefficients, the algorithm achieves excellent performance in time series classification and clustering tasks."
}