{
    "title": "A Shift In Artistic Practices through Artificial Intelligence. (arXiv:2306.10054v1 [cs.CY])",
    "abstract": "The explosion of content generated by Artificial Intelligence models has initiated a cultural shift in arts, music, and media, where roles are changing, values are shifting, and conventions are challenged. The readily available, vast dataset of the internet has created an environment for AI models to be trained on any content on the web. With AI models shared openly, and used by many, globally, how does this new paradigm shift challenge the status quo in artistic practices? What kind of changes will AI technology bring into music, arts, and new media?",
    "link": "http://arxiv.org/abs/2306.10054",
    "context": "Title: A Shift In Artistic Practices through Artificial Intelligence. (arXiv:2306.10054v1 [cs.CY])\nAbstract: The explosion of content generated by Artificial Intelligence models has initiated a cultural shift in arts, music, and media, where roles are changing, values are shifting, and conventions are challenged. The readily available, vast dataset of the internet has created an environment for AI models to be trained on any content on the web. With AI models shared openly, and used by many, globally, how does this new paradigm shift challenge the status quo in artistic practices? What kind of changes will AI technology bring into music, arts, and new media?",
    "path": "papers/23/06/2306.10054.json",
    "total_tokens": 689,
    "translated_title": "通过人工智能引起的艺术实践的转变",
    "translated_abstract": "由人工智能模型生成的大量内容的爆炸引发了艺术、音乐和媒体领域的文化转变，角色变化、价值观转变和传统受到挑战。互联网上可获得的广阔数据集为人工智能模型的训练创造了一个环境。AI模型的公开共享和全球使用，如何挑战艺术实践中的现状？AI技术将给音乐、艺术和新媒体带来什么样的变革？",
    "tldr": "人工智能模型生成的内容突破了艺术、音乐和媒体领域，引发了文化转变。它通过改变人们的角色、转变价值观以及挑战传统实践方式，为艺术的未来打开了新的可能性。",
    "en_tdlr": "The explosion of content generated by AI models initiates a cultural shift in arts, music, and media. By changing roles, shifting values, and challenging conventions, AI technology opens up new possibilities in the future of art."
}