{
    "title": "Comparative Analysis of Widely use Object-Oriented Languages. (arXiv:2306.01819v1 [cs.PL])",
    "abstract": "Programming is an integral part of computer science discipline. Every day the programming environment is not only rapidly growing but also changing and languages are constantly evolving. Learning of object-oriented paradigm is compulsory in every computer science major so the choice of language to teach object-oriented principles is very important. Due to large pool of object-oriented languages, it is difficult to choose which should be the first programming language in order to teach object-oriented principles. Many studies shown which should be the first language to tech object-oriented concepts but there is no method to compare and evaluate these languages. In this article we proposed a comprehensive framework to evaluate the widely used object-oriented languages. The languages are evaluated basis of their technical and environmental features.",
    "link": "http://arxiv.org/abs/2306.01819",
    "context": "Title: Comparative Analysis of Widely use Object-Oriented Languages. (arXiv:2306.01819v1 [cs.PL])\nAbstract: Programming is an integral part of computer science discipline. Every day the programming environment is not only rapidly growing but also changing and languages are constantly evolving. Learning of object-oriented paradigm is compulsory in every computer science major so the choice of language to teach object-oriented principles is very important. Due to large pool of object-oriented languages, it is difficult to choose which should be the first programming language in order to teach object-oriented principles. Many studies shown which should be the first language to tech object-oriented concepts but there is no method to compare and evaluate these languages. In this article we proposed a comprehensive framework to evaluate the widely used object-oriented languages. The languages are evaluated basis of their technical and environmental features.",
    "path": "papers/23/06/2306.01819.json",
    "total_tokens": 766,
    "translated_title": "广泛使用的面向对象编程语言的比较分析",
    "translated_abstract": "编程是计算机科学学科的重要组成部分。编程环境不仅在迅速增长，而且也在不断变化，编程语言也在不断演进。在计算机科学专业中，学习面向对象编程范式是必修课程，因此选择用哪种语言来教授面向对象原理非常重要。由于大量面向对象编程语言，非常难以选择哪一种应该是教授面向对象原理的首选编程语言。许多研究已经显示出哪种语言应该是教授面向对象概念的首选语言，但是还没有一种方法来比较和评估这些语言。在本文中，我们提出了一个全面的框架来评估广泛使用的面向对象编程语言。这些语言是基于它们的技术和环境特征进行评估的。",
    "tldr": "本文提出了一个全面的框架来评估广泛使用的面向对象编程语言，以基于它们的技术和环境特征进行比较。",
    "en_tdlr": "This article proposes a comprehensive framework to evaluate widely used object-oriented programming languages, comparing them based on their technical and environmental features."
}