{
    "title": "Unraveling Projection Heads in Contrastive Learning: Insights from Expansion and Shrinkage. (arXiv:2306.03335v1 [stat.ML])",
    "abstract": "We investigate the role of projection heads, also known as projectors, within the encoder-projector framework (e.g., SimCLR) used in contrastive learning. We aim to demystify the observed phenomenon where representations learned before projectors outperform those learned after -- measured using the downstream linear classification accuracy, even when the projectors themselves are linear.  In this paper, we make two significant contributions towards this aim. Firstly, through empirical and theoretical analysis, we identify two crucial effects -- expansion and shrinkage -- induced by the contrastive loss on the projectors. In essence, contrastive loss either expands or shrinks the signal direction in the representations learned by an encoder, depending on factors such as the augmentation strength, the temperature used in contrastive loss, etc. Secondly, drawing inspiration from the expansion and shrinkage phenomenon, we propose a family of linear transformations to accurately model the p",
    "link": "http://arxiv.org/abs/2306.03335",
    "context": "Title: Unraveling Projection Heads in Contrastive Learning: Insights from Expansion and Shrinkage. (arXiv:2306.03335v1 [stat.ML])\nAbstract: We investigate the role of projection heads, also known as projectors, within the encoder-projector framework (e.g., SimCLR) used in contrastive learning. We aim to demystify the observed phenomenon where representations learned before projectors outperform those learned after -- measured using the downstream linear classification accuracy, even when the projectors themselves are linear.  In this paper, we make two significant contributions towards this aim. Firstly, through empirical and theoretical analysis, we identify two crucial effects -- expansion and shrinkage -- induced by the contrastive loss on the projectors. In essence, contrastive loss either expands or shrinks the signal direction in the representations learned by an encoder, depending on factors such as the augmentation strength, the temperature used in contrastive loss, etc. Secondly, drawing inspiration from the expansion and shrinkage phenomenon, we propose a family of linear transformations to accurately model the p",
    "path": "papers/23/06/2306.03335.json",
    "total_tokens": 910,
    "translated_title": "对比学习中的投影头：扩展和收缩的启示",
    "translated_abstract": "本文研究了对比学习中编码器-投影器框架（例如SimCLR）中的投影头，也称为投影仪，的作用。我们旨在揭示一个观察现象的真相：通过下游线性分类准确度的衡量，即使在投影头本身是线性的情况下，也可以学习出在投影器之前的表示优于之后。通过实证和理论分析，我们首先确定了两个由对比损失引起的关键效应。本质上，对比损失会扩展或收缩编码器学习的表示中的信号方向，具体取决于如增强强度，对比损失中使用的温度等因素。其次，受到扩展和收缩现象的启示，我们提出了一系列线性变换来准确建模投影头。我们提出的变换可以提高下游的分类准确度，而且计算成本低，易于实现。",
    "tldr": "本文研究了对比学习中的投影头，在理论和实践中找到了两个关键效应：信号方向的扩展和收缩，提出了一系列线性变换来改善下游分类准确性。",
    "en_tdlr": "This paper investigates the role of projection heads in contrastive learning and identifies two crucial effects induced by the contrastive loss: expansion and shrinkage. Inspired by this phenomenon, the authors propose a family of linear transformations to accurately model the projection heads, which improves downstream classification accuracy while being computationally efficient."
}