{
    "title": "ToolAlpaca: Generalized Tool Learning for Language Models with 3000 Simulated Cases. (arXiv:2306.05301v1 [cs.CL])",
    "abstract": "Enabling large language models to effectively utilize real-world tools is crucial for achieving embodied intelligence. Existing approaches to tool learning have primarily relied on either extremely large language models, such as GPT-4, to attain generalized tool-use abilities in a zero-shot manner, or have utilized supervised learning to train limited types of tools on compact models. However, it remains uncertain whether smaller language models can achieve generalized tool-use abilities without specific tool-specific training. To address this question, this paper introduces ToolAlpaca, a novel framework designed to automatically generate a tool-use corpus and learn generalized tool-use abilities on compact language models with minimal human intervention. Specifically, ToolAlpaca first collects a comprehensive dataset by building a multi-agent simulation environment, which contains 3938 tool-use instances from more than 400 real-world tool APIs spanning 50 distinct categories. Subseque",
    "link": "http://arxiv.org/abs/2306.05301",
    "context": "Title: ToolAlpaca: Generalized Tool Learning for Language Models with 3000 Simulated Cases. (arXiv:2306.05301v1 [cs.CL])\nAbstract: Enabling large language models to effectively utilize real-world tools is crucial for achieving embodied intelligence. Existing approaches to tool learning have primarily relied on either extremely large language models, such as GPT-4, to attain generalized tool-use abilities in a zero-shot manner, or have utilized supervised learning to train limited types of tools on compact models. However, it remains uncertain whether smaller language models can achieve generalized tool-use abilities without specific tool-specific training. To address this question, this paper introduces ToolAlpaca, a novel framework designed to automatically generate a tool-use corpus and learn generalized tool-use abilities on compact language models with minimal human intervention. Specifically, ToolAlpaca first collects a comprehensive dataset by building a multi-agent simulation environment, which contains 3938 tool-use instances from more than 400 real-world tool APIs spanning 50 distinct categories. Subseque",
    "path": "papers/23/06/2306.05301.json",
    "total_tokens": 813,
    "translated_title": "ToolAlpaca: 通过3000个模拟案例对语言模型进行通用工具学习",
    "translated_abstract": "实现大型语言模型有效利用现实工具对于实现具有感知能力的智能至关重要。现有的工具学习方法主要依靠非常大的语言模型，例如GPT-4，在零-shot方式下获得通用的工具使用能力，或利用监督学习在紧凑的模型上训练有限类型的工具。然而，较小的语言模型是否能够在没有特定工具训练的情况下实现通用的工具使用能力尚不确定。本文介绍了ToolAlpaca，这是一个新框架，旨在自动生成工具使用语料库，并在最小人为干预下，在紧凑的语言模型上学习通用的工具使用能力。",
    "tldr": "ToolAlpaca是一个自动生成工具使用语料库，实现紧凑的语言模型参加通用工具学习的框架。"
}