{
    "title": "U-PASS: an Uncertainty-guided deep learning Pipeline for Automated Sleep Staging. (arXiv:2306.04663v1 [eess.SP])",
    "abstract": "As machine learning becomes increasingly prevalent in critical fields such as healthcare, ensuring the safety and reliability of machine learning systems becomes paramount. A key component of reliability is the ability to estimate uncertainty, which enables the identification of areas of high and low confidence and helps to minimize the risk of error. In this study, we propose a machine learning pipeline called U-PASS tailored for clinical applications that incorporates uncertainty estimation at every stage of the process, including data acquisition, training, and model deployment. The training process is divided into a supervised pre-training step and a semi-supervised finetuning step. We apply our uncertainty-guided deep learning pipeline to the challenging problem of sleep staging and demonstrate that it systematically improves performance at every stage. By optimizing the training dataset, actively seeking informative samples, and deferring the most uncertain samples to an expert, ",
    "link": "http://arxiv.org/abs/2306.04663",
    "context": "Title: U-PASS: an Uncertainty-guided deep learning Pipeline for Automated Sleep Staging. (arXiv:2306.04663v1 [eess.SP])\nAbstract: As machine learning becomes increasingly prevalent in critical fields such as healthcare, ensuring the safety and reliability of machine learning systems becomes paramount. A key component of reliability is the ability to estimate uncertainty, which enables the identification of areas of high and low confidence and helps to minimize the risk of error. In this study, we propose a machine learning pipeline called U-PASS tailored for clinical applications that incorporates uncertainty estimation at every stage of the process, including data acquisition, training, and model deployment. The training process is divided into a supervised pre-training step and a semi-supervised finetuning step. We apply our uncertainty-guided deep learning pipeline to the challenging problem of sleep staging and demonstrate that it systematically improves performance at every stage. By optimizing the training dataset, actively seeking informative samples, and deferring the most uncertain samples to an expert, ",
    "path": "papers/23/06/2306.04663.json",
    "total_tokens": 990,
    "translated_title": "U-PASS：一种基于不确定性引导的自动睡眠分期深度学习管道",
    "translated_abstract": "随着机器学习在诸如医疗保健等关键领域中越来越普及，确保机器学习系统的安全性和可靠性变得至关重要。可靠性的关键组成部分是能够估计不确定性，这可以使识别自信度高和低的区域并帮助最小化错误的风险。在本研究中，我们提出了一种名为 U-PASS 的机器学习管道，该管道专为临床应用而设计，在整个过程中，包括数据采集、训练和模型部署，都结合了不确定性估计。训练过程分为监督的预训练步骤和半监督的微调步骤。我们将此不确定性引导的深度学习管道应用于具有挑战性的睡眠分期问题，并证明了它在每个阶段都系统地提高了性能。通过优化训练数据集、积极寻找信息样本并将最不确定的样本推迟给专家，我们在两个睡眠基准数据集上实现了最先进的性能，并超过了商业睡眠分期系统。",
    "tldr": "U-PASS是一种基于不确定性引导的深度学习管道，具有估计不确定性的能力，针对临床应用进行设计。在睡眠分期中表现出极高的性能，通过优化训练数据集和积极寻找信息样本实现最先进的性能。",
    "en_tdlr": "U-PASS is an uncertainty-guided deep learning pipeline designed for clinical applications with the ability to estimate uncertainty at every stage of the process. It achieves state-of-the-art performance in sleep staging by optimizing the training dataset and actively seeking informative samples."
}