{
    "title": "Brain tumor segmentation using synthetic MR images -- A comparison of GANs and diffusion models. (arXiv:2306.02986v2 [eess.IV] UPDATED)",
    "abstract": "Large annotated datasets are required for training deep learning models, but in medical imaging data sharing is often complicated due to ethics, anonymization and data protection legislation. Generative AI models, such as generative adversarial networks (GANs) and diffusion models, can today produce very realistic synthetic images, and can potentially facilitate data sharing. However, in order to share synthetic medical images it must first be demonstrated that they can be used for training different networks with acceptable performance. Here, we therefore comprehensively evaluate four GANs (progressive GAN, StyleGAN 1-3) and a diffusion model for the task of brain tumor segmentation (using two segmentation networks, U-Net and a Swin transformer). Our results show that segmentation networks trained on synthetic images reach Dice scores that are 80% - 90% of Dice scores when training with real images, but that memorization of the training images can be a problem for diffusion models if ",
    "link": "http://arxiv.org/abs/2306.02986",
    "context": "Title: Brain tumor segmentation using synthetic MR images -- A comparison of GANs and diffusion models. (arXiv:2306.02986v2 [eess.IV] UPDATED)\nAbstract: Large annotated datasets are required for training deep learning models, but in medical imaging data sharing is often complicated due to ethics, anonymization and data protection legislation. Generative AI models, such as generative adversarial networks (GANs) and diffusion models, can today produce very realistic synthetic images, and can potentially facilitate data sharing. However, in order to share synthetic medical images it must first be demonstrated that they can be used for training different networks with acceptable performance. Here, we therefore comprehensively evaluate four GANs (progressive GAN, StyleGAN 1-3) and a diffusion model for the task of brain tumor segmentation (using two segmentation networks, U-Net and a Swin transformer). Our results show that segmentation networks trained on synthetic images reach Dice scores that are 80% - 90% of Dice scores when training with real images, but that memorization of the training images can be a problem for diffusion models if ",
    "path": "papers/23/06/2306.02986.json",
    "total_tokens": 979,
    "translated_title": "使用合成MR图像进行脑肿瘤分割--GANs和扩散模型的比较",
    "translated_abstract": "在医学成像中，由于伦理、匿名化和数据保护法规的限制，数据共享常常很复杂。生成式人工智能模型，如生成对抗网络（GANs）和扩散模型，可以生成非常逼真的合成图像，有可能促进数据共享。然而，在共享合成医学图像之前，必须首先证明它们可以用于训练不同的网络，且具有可接受的性能。因此，本研究对四种GANs（渐进式GAN，StyleGAN 1-3）和一种扩散模型进行了全面评估，用于脑肿瘤分割任务（使用两种分割网络，U-Net和Swin transformer）。我们的结果表明，使用合成图像训练的分割网络的Dice分数达到了使用实际图像训练时Dice分数的80% - 90%，但对于扩散模型来说，训练图像的记忆化可能会成为一个问题。",
    "tldr": "本研究通过综合评估四种GANs和一种扩散模型，对使用合成MR图像进行脑肿瘤分割任务的性能进行了评估，结果显示使用合成图像训练的分割网络可以达到80% - 90%的实际图像训练性能。但对于扩散模型来说，训练图像的记忆化可能会成为一个问题。",
    "en_tdlr": "This study comprehensively evaluates the performance of using synthetic MR images for brain tumor segmentation by comparing four GANs and a diffusion model. The results show that segmentation networks trained on synthetic images achieve 80% - 90% of the performance of real image training. However, memorization of training images can be a problem for diffusion models."
}