{
    "title": "Introspective Action Advising for Interpretable Transfer Learning. (arXiv:2306.12314v1 [cs.LG])",
    "abstract": "Transfer learning can be applied in deep reinforcement learning to accelerate the training of a policy in a target task by transferring knowledge from a policy learned in a related source task. This is commonly achieved by copying pretrained weights from the source policy to the target policy prior to training, under the constraint that they use the same model architecture. However, not only does this require a robust representation learned over a wide distribution of states -- often failing to transfer between specialist models trained over single tasks -- but it is largely uninterpretable and provides little indication of what knowledge is transferred. In this work, we propose an alternative approach to transfer learning between tasks based on action advising, in which a teacher trained in a source task actively guides a student's exploration in a target task. Through introspection, the teacher is capable of identifying when advice is beneficial to the student and should be given, an",
    "link": "http://arxiv.org/abs/2306.12314",
    "context": "Title: Introspective Action Advising for Interpretable Transfer Learning. (arXiv:2306.12314v1 [cs.LG])\nAbstract: Transfer learning can be applied in deep reinforcement learning to accelerate the training of a policy in a target task by transferring knowledge from a policy learned in a related source task. This is commonly achieved by copying pretrained weights from the source policy to the target policy prior to training, under the constraint that they use the same model architecture. However, not only does this require a robust representation learned over a wide distribution of states -- often failing to transfer between specialist models trained over single tasks -- but it is largely uninterpretable and provides little indication of what knowledge is transferred. In this work, we propose an alternative approach to transfer learning between tasks based on action advising, in which a teacher trained in a source task actively guides a student's exploration in a target task. Through introspection, the teacher is capable of identifying when advice is beneficial to the student and should be given, an",
    "path": "papers/23/06/2306.12314.json",
    "total_tokens": 1012,
    "translated_title": "可解释的迁移学习中的内省行动建议",
    "translated_abstract": "迁移学习可以应用于深度强化学习中，通过将从相关源任务中学习到的策略的知识传输到目标任务中，加速目标任务策略的训练。通常，这是通过在训练之前将预训练权重从源策略复制到目标策略来实现的，并且要求它们使用相同的模型架构。然而，这不仅需要在广泛状态分布中学习到的强健表示——通常难以在针对单个任务训练的专业模型之间进行转移——而且很大程度上不可解释，提供很少有关迁移的知识。在本文中，我们提出了一种基于行动建议的任务之间的迁移学习的替代方法，在这种方法中，源任务中训练的教师积极指导目标任务中学生的探索。通过内省，教师能够确定何时有利于学生给予建议，在不确定时，为更可解释和细粒度的知识传输提供了可能性。我们在一组Atari游戏上评估了我们的方法，表明它在某些情况下可以胜过标准的权重复制方法，同时也提供了有关传输的知识。",
    "tldr": "本文提出了一种基于行动建议的迁移学习方法，可以更加解释性和细粒度地传输知识，并在一些情况下可以取得比标准权重复制方法更好的结果。",
    "en_tdlr": "This paper proposes an alternative transfer learning approach based on action advising, which allows for more interpretable and fine-grained knowledge transfer. The proposed method outperforms the standard weight-copying approach in some cases and provides insight into what knowledge is transferred."
}