{
    "title": "Localised Adaptive Spatial-Temporal Graph Neural Network. (arXiv:2306.06930v2 [cs.LG] UPDATED)",
    "abstract": "Spatial-temporal graph models are prevailing for abstracting and modelling spatial and temporal dependencies. In this work, we ask the following question: whether and to what extent can we localise spatial-temporal graph models? We limit our scope to adaptive spatial-temporal graph neural networks (ASTGNNs), the state-of-the-art model architecture. Our approach to localisation involves sparsifying the spatial graph adjacency matrices. To this end, we propose Adaptive Graph Sparsification (AGS), a graph sparsification algorithm which successfully enables the localisation of ASTGNNs to an extreme extent (fully localisation). We apply AGS to two distinct ASTGNN architectures and nine spatial-temporal datasets. Intriguingly, we observe that spatial graphs in ASTGNNs can be sparsified by over 99.5\\% without any decline in test accuracy. Furthermore, even when ASTGNNs are fully localised, becoming graph-less and purely temporal, we record no drop in accuracy for the majority of tested datase",
    "link": "http://arxiv.org/abs/2306.06930",
    "context": "Title: Localised Adaptive Spatial-Temporal Graph Neural Network. (arXiv:2306.06930v2 [cs.LG] UPDATED)\nAbstract: Spatial-temporal graph models are prevailing for abstracting and modelling spatial and temporal dependencies. In this work, we ask the following question: whether and to what extent can we localise spatial-temporal graph models? We limit our scope to adaptive spatial-temporal graph neural networks (ASTGNNs), the state-of-the-art model architecture. Our approach to localisation involves sparsifying the spatial graph adjacency matrices. To this end, we propose Adaptive Graph Sparsification (AGS), a graph sparsification algorithm which successfully enables the localisation of ASTGNNs to an extreme extent (fully localisation). We apply AGS to two distinct ASTGNN architectures and nine spatial-temporal datasets. Intriguingly, we observe that spatial graphs in ASTGNNs can be sparsified by over 99.5\\% without any decline in test accuracy. Furthermore, even when ASTGNNs are fully localised, becoming graph-less and purely temporal, we record no drop in accuracy for the majority of tested datase",
    "path": "papers/23/06/2306.06930.json",
    "total_tokens": 935,
    "translated_title": "局部自适应时空图神经网络",
    "translated_abstract": "空间-时间图模型广泛用于抽象和模拟空间和时间依赖性。本文探讨了以下问题：我们是否以及在何种程度上可以本地化空间-时间图模型？我们将范围限定在自适应空间-时间图神经网络（ASTGNN）上，这是最先进的模型架构。我们的本地化方法涉及将空间图邻接矩阵稀疏化。为此，我们提出了自适应图稀疏化（AGS），一种成功实现ASTGNN本地化的图稀疏化算法（完全本地化）。我们将AGS应用于两种不同的ASTGNN架构和9个空间-时间数据集。有趣的是，我们观察到ASTGNN中的空间图可以稀疏化超过99.5％，而没有任何测试准确性的下降。此外，即使ASTGNN完全本地化，变得无图且纯粹的时间，大多数测试数据集的准确性也没有下降。",
    "tldr": "本文提出了自适应图稀疏化算法，成功将自适应空间-时间图神经网络（ASTGNN）本地化至极致，无需空间图即可达到同样的测试准确性。"
}