{
    "title": "Visualizing Relation Between (De)Motivating Topics and Public Stance toward COVID-19 Vaccine. (arXiv:2306.12118v1 [cs.CY])",
    "abstract": "While social media plays a vital role in communication nowadays, misinformation and trolls can easily take over the conversation and steer public opinion on these platforms. We saw the effect of misinformation during the {COVID-19} pandemic when public health officials faced significant push-back while trying to motivate the public to vaccinate. To tackle the current and any future threats in emergencies and motivate the public towards a common goal, it is essential to understand how public motivation shifts and which topics resonate among the general population. In this study, we proposed an interactive visualization tool to inspect and analyze the topics that resonated among Twitter-sphere during the {COVID-19} pandemic and understand the key factors that shifted public stance for vaccination. This tool can easily be generalized for any scenario for visual analysis and to increase the transparency of social media data for researchers and the general population alike.",
    "link": "http://arxiv.org/abs/2306.12118",
    "context": "Title: Visualizing Relation Between (De)Motivating Topics and Public Stance toward COVID-19 Vaccine. (arXiv:2306.12118v1 [cs.CY])\nAbstract: While social media plays a vital role in communication nowadays, misinformation and trolls can easily take over the conversation and steer public opinion on these platforms. We saw the effect of misinformation during the {COVID-19} pandemic when public health officials faced significant push-back while trying to motivate the public to vaccinate. To tackle the current and any future threats in emergencies and motivate the public towards a common goal, it is essential to understand how public motivation shifts and which topics resonate among the general population. In this study, we proposed an interactive visualization tool to inspect and analyze the topics that resonated among Twitter-sphere during the {COVID-19} pandemic and understand the key factors that shifted public stance for vaccination. This tool can easily be generalized for any scenario for visual analysis and to increase the transparency of social media data for researchers and the general population alike.",
    "path": "papers/23/06/2306.12118.json",
    "total_tokens": 914,
    "translated_title": "可视化探究与COVID-19疫苗接种态度相关的讨论话题",
    "translated_abstract": "社交媒体在当今通讯中起到了至关重要的作用，但误导和恶意评论很容易占据话题，引导公众舆论。在COVID-19疫情期间，我们看到了不实信息的影响，公共卫生官员在试图激励公众接种疫苗时遭到了重大抵制。为了应对当前和任何未来的紧急威胁，并激励公众朝着一个共同的目标前进，我们需要了解公众动力的转移以及哪些话题在普通民众中有共鸣。在本研究中，我们提出了一个交互式可视化工具，以检查和分析COVID-19疫情期间Twitter-sphere中的话题，并了解关键因素是什么导致公众对接种疫苗的态度转变。该工具可以轻松推广为任何情景的视觉分析工具，并增加社交媒体数据对研究人员和普通民众的透明度。",
    "tldr": "研究了社交媒体上COVID-19话题对公众接种疫苗态度的影响，提出了交互式可视化工具，可以分析话题共鸣和动力转移，增加研究与公众的透明度。",
    "en_tdlr": "This research explored the impact of COVID-19 topics on public attitude towards vaccination on social media, proposed an interactive visualization tool to analyze the resonance of topics and the shift of public motivation, and increased transparency between research and the general population."
}