{
    "title": "Revealing the Blind Spot of Sentence Encoder Evaluation by HEROS. (arXiv:2306.05083v1 [cs.CL])",
    "abstract": "Existing sentence textual similarity benchmark datasets only use a single number to summarize how similar the sentence encoder's decision is to humans'. However, it is unclear what kind of sentence pairs a sentence encoder (SE) would consider similar. Moreover, existing SE benchmarks mainly consider sentence pairs with low lexical overlap, so it is unclear how the SEs behave when two sentences have high lexical overlap. We introduce a high-quality SE diagnostic dataset, HEROS. HEROS is constructed by transforming an original sentence into a new sentence based on certain rules to form a \\textit{minimal pair}, and the minimal pair has high lexical overlaps. The rules include replacing a word with a synonym, an antonym, a typo, a random word, and converting the original sentence into its negation. Different rules yield different subsets of HEROS. By systematically comparing the performance of over 60 supervised and unsupervised SEs on HEROS, we reveal that most unsupervised sentence encod",
    "link": "http://arxiv.org/abs/2306.05083",
    "context": "Title: Revealing the Blind Spot of Sentence Encoder Evaluation by HEROS. (arXiv:2306.05083v1 [cs.CL])\nAbstract: Existing sentence textual similarity benchmark datasets only use a single number to summarize how similar the sentence encoder's decision is to humans'. However, it is unclear what kind of sentence pairs a sentence encoder (SE) would consider similar. Moreover, existing SE benchmarks mainly consider sentence pairs with low lexical overlap, so it is unclear how the SEs behave when two sentences have high lexical overlap. We introduce a high-quality SE diagnostic dataset, HEROS. HEROS is constructed by transforming an original sentence into a new sentence based on certain rules to form a \\textit{minimal pair}, and the minimal pair has high lexical overlaps. The rules include replacing a word with a synonym, an antonym, a typo, a random word, and converting the original sentence into its negation. Different rules yield different subsets of HEROS. By systematically comparing the performance of over 60 supervised and unsupervised SEs on HEROS, we reveal that most unsupervised sentence encod",
    "path": "papers/23/06/2306.05083.json",
    "total_tokens": 940,
    "tldr": "该论文介绍了一个高质量的句子编码器诊断数据集HEROS，通过在词汇重叠高的条件下对不同规则下的最小对进行测试，揭示了大多数无监督句子编码器在字面意义的变化上表现不佳。"
}