{
    "title": "Wikibio: a Semantic Resource for the Intersectional Analysis of Biographical Events. (arXiv:2306.09505v1 [cs.CL])",
    "abstract": "Biographical event detection is a relevant task for the exploration and comparison of the ways in which people's lives are told and represented. In this sense, it may support several applications in digital humanities and in works aimed at exploring bias about minoritized groups. Despite that, there are no corpora and models specifically designed for this task. In this paper we fill this gap by presenting a new corpus annotated for biographical event detection. The corpus, which includes 20 Wikipedia biographies, was compared with five existing corpora to train a model for the biographical event detection task. The model was able to detect all mentions of the target-entity in a biography with an F-score of 0.808 and the entity-related events with an F-score of 0.859. Finally, the model was used for performing an analysis of biases about women and non-Western people in Wikipedia biographies.",
    "link": "http://arxiv.org/abs/2306.09505",
    "context": "Title: Wikibio: a Semantic Resource for the Intersectional Analysis of Biographical Events. (arXiv:2306.09505v1 [cs.CL])\nAbstract: Biographical event detection is a relevant task for the exploration and comparison of the ways in which people's lives are told and represented. In this sense, it may support several applications in digital humanities and in works aimed at exploring bias about minoritized groups. Despite that, there are no corpora and models specifically designed for this task. In this paper we fill this gap by presenting a new corpus annotated for biographical event detection. The corpus, which includes 20 Wikipedia biographies, was compared with five existing corpora to train a model for the biographical event detection task. The model was able to detect all mentions of the target-entity in a biography with an F-score of 0.808 and the entity-related events with an F-score of 0.859. Finally, the model was used for performing an analysis of biases about women and non-Western people in Wikipedia biographies.",
    "path": "papers/23/06/2306.09505.json",
    "total_tokens": 836,
    "translated_title": "Wikibio: 用于人物传记事件交叉分析的语义资源",
    "translated_abstract": "人物传记事件检测是探索和比较人们生活叙述和表达方式的相关任务。在这方面，它可以支持数字人文学和探索有关少数群体偏见的研究。尽管如此，目前没有专门针对此任务设计的语料库和模型。本文通过提供一个新的用于注释人物传记事件检测的语料库来填补这一空白。该语料库包括20篇维基百科传记，与五个现有的语料库进行比较以训练用于人物传记事件检测任务的模型。该模型能够以0.808的F-score检测传记中目标实体的所有提及，以及以0.859的F-score检测实体相关事件。最后，该模型被用于分析维基百科传记中有关女性和非西方人的偏见。",
    "tldr": "本文提供了一个新的用于注释人物传记事件检测的语料库，并训练出了一个模型以检测实体及其相关事件。该模型能够高效地分析维基百科传记中有关女性和非西方人的偏见。",
    "en_tdlr": "This paper presents a new corpus annotated for biographical event detection and trains a model that efficiently analyzes biases of women and non-Western people in Wikipedia biographies."
}