{
    "title": "Evaluation of machine learning architectures on the quantification of epistemic and aleatoric uncertainties in complex dynamical systems. (arXiv:2306.15159v1 [stat.ML])",
    "abstract": "Machine learning methods for the construction of data-driven reduced order model models are used in an increasing variety of engineering domains, especially as a supplement to expensive computational fluid dynamics for design problems. An important check on the reliability of surrogate models is Uncertainty Quantification (UQ), a self assessed estimate of the model error. Accurate UQ allows for cost savings by reducing both the required size of training data sets and the required safety factors, while poor UQ prevents users from confidently relying on model predictions. We examine several machine learning techniques, including both Gaussian processes and a family UQ-augmented neural networks: Ensemble neural networks (ENN), Bayesian neural networks (BNN), Dropout neural networks (D-NN), and Gaussian neural networks (G-NN). We evaluate UQ accuracy (distinct from model accuracy) using two metrics: the distribution of normalized residuals on validation data, and the distribution of estima",
    "link": "http://arxiv.org/abs/2306.15159",
    "context": "Title: Evaluation of machine learning architectures on the quantification of epistemic and aleatoric uncertainties in complex dynamical systems. (arXiv:2306.15159v1 [stat.ML])\nAbstract: Machine learning methods for the construction of data-driven reduced order model models are used in an increasing variety of engineering domains, especially as a supplement to expensive computational fluid dynamics for design problems. An important check on the reliability of surrogate models is Uncertainty Quantification (UQ), a self assessed estimate of the model error. Accurate UQ allows for cost savings by reducing both the required size of training data sets and the required safety factors, while poor UQ prevents users from confidently relying on model predictions. We examine several machine learning techniques, including both Gaussian processes and a family UQ-augmented neural networks: Ensemble neural networks (ENN), Bayesian neural networks (BNN), Dropout neural networks (D-NN), and Gaussian neural networks (G-NN). We evaluate UQ accuracy (distinct from model accuracy) using two metrics: the distribution of normalized residuals on validation data, and the distribution of estima",
    "path": "papers/23/06/2306.15159.json",
    "total_tokens": 894,
    "translated_title": "在复杂动态系统的UQ中评估机器学习架构对关于认知和测试误差的量化",
    "translated_abstract": "机器学习方法用于构建数据驱动的降阶模型，被广泛应用于工程领域，特别是作为昂贵计算流体力学的替代方法。对于模型可靠性的重要检验是不确定性量化（UQ），它是对模型误差的自我评估。准确的UQ可以通过减少训练数据集的规模和安全因子来实现成本节约，而较差的UQ则会阻碍用户对模型预测的信任。我们研究了几种机器学习技术，包括高斯过程和一系列增强UQ的神经网络：集成神经网络（ENN）、贝叶斯神经网络（BNN）、Dropout神经网络（D-NN）和高斯神经网络（G-NN）。我们使用两个指标来评估UQ准确性（与模型准确性不同）：验证数据上归一化残差的分布和估计分布。",
    "tldr": "这项研究评估了多种机器学习技术在复杂动态系统的UQ中的准确性，为降低训练数据集规模和安全因子提供了成本节约的机会。",
    "en_tdlr": "This study evaluates the accuracy of various machine learning techniques in Uncertainty Quantification (UQ) for complex dynamical systems, providing opportunities for cost savings in reducing the size of training data sets and safety factors."
}