{
    "title": "Norm-guided latent space exploration for text-to-image generation. (arXiv:2306.08687v2 [cs.CV] UPDATED)",
    "abstract": "Text-to-image diffusion models show great potential in synthesizing a large variety of concepts in new compositions and scenarios. However, the latent space of initial seeds is still not well understood and its structure was shown to impact the generation of various concepts. Specifically, simple operations like interpolation and finding the centroid of a set of seeds perform poorly when using standard Euclidean or spherical metrics in the latent space. This paper makes the observation that, in current training procedures, diffusion models observed inputs with a narrow range of norm values. This has strong implications for methods that rely on seed manipulation for image generation, with applications to few-shot and long-tail learning tasks. To address this issue, we propose a novel method for interpolating between two seeds and demonstrate that it defines a new non-Euclidean metric that takes into account a norm-based prior on seeds. We describe a simple yet efficient algorithm for ap",
    "link": "http://arxiv.org/abs/2306.08687",
    "context": "Title: Norm-guided latent space exploration for text-to-image generation. (arXiv:2306.08687v2 [cs.CV] UPDATED)\nAbstract: Text-to-image diffusion models show great potential in synthesizing a large variety of concepts in new compositions and scenarios. However, the latent space of initial seeds is still not well understood and its structure was shown to impact the generation of various concepts. Specifically, simple operations like interpolation and finding the centroid of a set of seeds perform poorly when using standard Euclidean or spherical metrics in the latent space. This paper makes the observation that, in current training procedures, diffusion models observed inputs with a narrow range of norm values. This has strong implications for methods that rely on seed manipulation for image generation, with applications to few-shot and long-tail learning tasks. To address this issue, we propose a novel method for interpolating between two seeds and demonstrate that it defines a new non-Euclidean metric that takes into account a norm-based prior on seeds. We describe a simple yet efficient algorithm for ap",
    "path": "papers/23/06/2306.08687.json",
    "total_tokens": 941,
    "translated_title": "基于范数引导的文本到图像生成的潜空间探索",
    "translated_abstract": "文本到图像扩散模型在合成各种概念的新构图和场景方面显示出巨大潜力。然而，初始种子的潜空间仍不被很好理解，并且其结构已被证明会影响各种概念的生成。具体来说，使用标准的欧几里得或球面度量在潜空间中进行插值和寻找种子集的质心等简单操作性能较差。本文观察到，在当前的训练过程中，扩散模型只观测到具有狭窄范值的输入。这对于依赖于种子操作进行图像生成的方法，以及在少样本和长尾学习任务中的应用，具有重要影响。为了解决这个问题，我们提出了一种新方法，在两个种子之间进行插值，并证明它定义了一种基于范数的先验的新的非欧几里得度量。我们描述了一种简单而高效的算法以解决这个问题。",
    "tldr": "本研究观察到当前训练过程中，扩散模型只观测到具有狭窄范值的输入，这对于图像生成方法和少样本学习任务具有重要影响。本文提出了一种新的插值方法，并定义了一种基于范数的非欧几里得度量，以解决这个问题。",
    "en_tdlr": "This research identifies that the diffusion models only observe inputs with a narrow range of norm values during training, which has implications for image generation methods and few-shot learning tasks. The paper proposes a novel interpolation method and defines a non-Euclidean metric based on norm values to address this issue."
}