{
    "title": "Artificial Intelligence for Emergency Response. (arXiv:2306.10068v1 [cs.CY])",
    "abstract": "Emergency response management (ERM) is a challenge faced by communities across the globe. First responders must respond to various incidents, such as fires, traffic accidents, and medical emergencies. They must respond quickly to incidents to minimize the risk to human life. Consequently, considerable attention has been devoted to studying emergency incidents and response in the last several decades. In particular, data-driven models help reduce human and financial loss and improve design codes, traffic regulations, and safety measures. This tutorial paper explores four sub-problems within emergency response: incident prediction, incident detection, resource allocation, and resource dispatch. We aim to present mathematical formulations for these problems and broad frameworks for each problem. We also share open-source (synthetic) data from a large metropolitan area in the USA for future work on data-driven emergency response.",
    "link": "http://arxiv.org/abs/2306.10068",
    "context": "Title: Artificial Intelligence for Emergency Response. (arXiv:2306.10068v1 [cs.CY])\nAbstract: Emergency response management (ERM) is a challenge faced by communities across the globe. First responders must respond to various incidents, such as fires, traffic accidents, and medical emergencies. They must respond quickly to incidents to minimize the risk to human life. Consequently, considerable attention has been devoted to studying emergency incidents and response in the last several decades. In particular, data-driven models help reduce human and financial loss and improve design codes, traffic regulations, and safety measures. This tutorial paper explores four sub-problems within emergency response: incident prediction, incident detection, resource allocation, and resource dispatch. We aim to present mathematical formulations for these problems and broad frameworks for each problem. We also share open-source (synthetic) data from a large metropolitan area in the USA for future work on data-driven emergency response.",
    "path": "papers/23/06/2306.10068.json",
    "total_tokens": 799,
    "translated_title": "应急响应人工智能",
    "translated_abstract": "应急响应管理是全球社区面临的挑战。应急响应人员必须迅速响应各种事件，例如火灾、交通事故和医疗紧急情况。遏制事件以最小化人员伤亡风险。因此，在过去几十年中，人们对应急事件和响应进行了大量研究。特别是，数据驱动模型有助于减少人员和财务损失，并改善设计规范、交通法规和安全措施。本教程论文探讨了应急响应中的四个子问题：事件预测、事件检测、资源分配和资源调度。我们旨在提出这些问题的数学公式和广泛框架。我们还分享了一份来自美国一个大都市区的开源（合成）数据，以便于未来基于数据驱动的应急响应工作。",
    "tldr": "本文介绍了数据驱动模型在应急响应中的应用，并探讨了其内在的四个子问题：事件预测，事件检测，资源分配和资源调度。",
    "en_tdlr": "This tutorial paper explores the application of data-driven models in emergency response, and discusses its underlying four sub-problems: incident prediction, incident detection, resource allocation, and resource dispatch."
}