{
    "title": "Deep Learning for Energy Time-Series Analysis and Forecasting. (arXiv:2306.09129v2 [cs.LG] UPDATED)",
    "abstract": "Energy time-series analysis describes the process of analyzing past energy observations and possibly external factors so as to predict the future. Different tasks are involved in the general field of energy time-series analysis and forecasting, with electric load demand forecasting, personalized energy consumption forecasting, as well as renewable energy generation forecasting being among the most common ones. Following the exceptional performance of Deep Learning (DL) in a broad area of vision tasks, DL models have successfully been utilized in time-series forecasting tasks. This paper aims to provide insight into various DL methods geared towards improving the performance in energy time-series forecasting tasks, with special emphasis in Greek Energy Market, and equip the reader with the necessary knowledge to apply these methods in practice.",
    "link": "http://arxiv.org/abs/2306.09129",
    "context": "Title: Deep Learning for Energy Time-Series Analysis and Forecasting. (arXiv:2306.09129v2 [cs.LG] UPDATED)\nAbstract: Energy time-series analysis describes the process of analyzing past energy observations and possibly external factors so as to predict the future. Different tasks are involved in the general field of energy time-series analysis and forecasting, with electric load demand forecasting, personalized energy consumption forecasting, as well as renewable energy generation forecasting being among the most common ones. Following the exceptional performance of Deep Learning (DL) in a broad area of vision tasks, DL models have successfully been utilized in time-series forecasting tasks. This paper aims to provide insight into various DL methods geared towards improving the performance in energy time-series forecasting tasks, with special emphasis in Greek Energy Market, and equip the reader with the necessary knowledge to apply these methods in practice.",
    "path": "papers/23/06/2306.09129.json",
    "total_tokens": 753,
    "translated_title": "深度学习在能源时间序列分析和预测中的应用",
    "translated_abstract": "能源时间序列分析描述了通过分析过去的能源观测和可能的外部因素来预测未来的过程。在能源时间序列分析和预测的一般领域中涉及到不同的任务，其中包括电力负荷需求预测、个性化能源消费预测，以及可再生能源发电预测等。鉴于深度学习在多个视觉任务中的卓越性能，深度学习模型已成功应用于时间序列预测任务。本文旨在深入探讨各种深度学习方法，针对能源时间序列预测任务的性能进行改进，特别关注希腊能源市场，并为读者提供应用这些方法的必要知识.",
    "tldr": "本文介绍了深度学习在能源时间序列分析和预测中的应用。重点关注希腊能源市场，通过改进深度学习方法来提高预测性能。",
    "en_tdlr": "This paper discusses the application of deep learning in energy time-series analysis and forecasting, with a focus on the Greek Energy Market. Various deep learning methods are explored to improve prediction performance."
}