{
    "title": "Improving Primate Sounds Classification using Binary Presorting for Deep Learning. (arXiv:2306.16054v1 [cs.SD])",
    "abstract": "In the field of wildlife observation and conservation, approaches involving machine learning on audio recordings are becoming increasingly popular. Unfortunately, available datasets from this field of research are often not optimal learning material; Samples can be weakly labeled, of different lengths or come with a poor signal-to-noise ratio. In this work, we introduce a generalized approach that first relabels subsegments of MEL spectrogram representations, to achieve higher performances on the actual multi-class classification tasks. For both the binary pre-sorting and the classification, we make use of convolutional neural networks (CNN) and various data-augmentation techniques. We showcase the results of this approach on the challenging \\textit{ComparE 2021} dataset, with the task of classifying between different primate species sounds, and report significantly higher Accuracy and UAR scores in contrast to comparatively equipped model baselines.",
    "link": "http://arxiv.org/abs/2306.16054",
    "context": "Title: Improving Primate Sounds Classification using Binary Presorting for Deep Learning. (arXiv:2306.16054v1 [cs.SD])\nAbstract: In the field of wildlife observation and conservation, approaches involving machine learning on audio recordings are becoming increasingly popular. Unfortunately, available datasets from this field of research are often not optimal learning material; Samples can be weakly labeled, of different lengths or come with a poor signal-to-noise ratio. In this work, we introduce a generalized approach that first relabels subsegments of MEL spectrogram representations, to achieve higher performances on the actual multi-class classification tasks. For both the binary pre-sorting and the classification, we make use of convolutional neural networks (CNN) and various data-augmentation techniques. We showcase the results of this approach on the challenging \\textit{ComparE 2021} dataset, with the task of classifying between different primate species sounds, and report significantly higher Accuracy and UAR scores in contrast to comparatively equipped model baselines.",
    "path": "papers/23/06/2306.16054.json",
    "total_tokens": 895,
    "translated_title": "通过使用二进制预排序来改进深度学习中的灵长类声音分类",
    "translated_abstract": "在野生动物观察和保护领域，使用音频记录的机器学习方法越来越受欢迎。不幸的是，来自这个研究领域的可用数据集通常不是最佳的学习材料；样本可能被弱标记，长度不同或信噪比较差。在本研究中，我们引入了一种广义方法，首先重新标记MEL谱图表示的子段，以在实际的多类分类任务中获得更高的性能。对于二进制预排序和分类，我们使用了卷积神经网络（CNN）和各种数据增强技术。我们展示了这种方法在具有挑战性的“ComparE 2021”数据集上的结果，在分类不同灵长类物种声音的任务中，报告了与相比较的基准模型相比显著更高的准确性和UAR分数。",
    "tldr": "本研究提出了一种改进的方法，通过使用二进制预排序和卷积神经网络对灵长类声音进行分类，以提高多类分类任务的性能。在“ComparE 2021”数据集上进行的实验结果显示，相比于基准模型，该方法的准确性和UAR分数显著提高。",
    "en_tdlr": "This paper introduces an improved approach for classifying primate sounds using binary presorting and convolutional neural networks, achieving higher performance in multi-class classification tasks. Experimental results on the \"ComparE 2021\" dataset demonstrate significantly improved accuracy and UAR scores compared to baseline models."
}