{
    "title": "HomoGCL: Rethinking Homophily in Graph Contrastive Learning. (arXiv:2306.09614v1 [cs.LG])",
    "abstract": "Contrastive learning (CL) has become the de-facto learning paradigm in self-supervised learning on graphs, which generally follows the \"augmenting-contrasting\" learning scheme. However, we observe that unlike CL in computer vision domain, CL in graph domain performs decently even without augmentation. We conduct a systematic analysis of this phenomenon and argue that homophily, i.e., the principle that \"like attracts like\", plays a key role in the success of graph CL. Inspired to leverage this property explicitly, we propose HomoGCL, a model-agnostic framework to expand the positive set using neighbor nodes with neighbor-specific significances. Theoretically, HomoGCL introduces a stricter lower bound of the mutual information between raw node features and node embeddings in augmented views. Furthermore, HomoGCL can be combined with existing graph CL models in a plug-and-play way with light extra computational overhead. Extensive experiments demonstrate that HomoGCL yields multiple stat",
    "link": "http://arxiv.org/abs/2306.09614",
    "context": "Title: HomoGCL: Rethinking Homophily in Graph Contrastive Learning. (arXiv:2306.09614v1 [cs.LG])\nAbstract: Contrastive learning (CL) has become the de-facto learning paradigm in self-supervised learning on graphs, which generally follows the \"augmenting-contrasting\" learning scheme. However, we observe that unlike CL in computer vision domain, CL in graph domain performs decently even without augmentation. We conduct a systematic analysis of this phenomenon and argue that homophily, i.e., the principle that \"like attracts like\", plays a key role in the success of graph CL. Inspired to leverage this property explicitly, we propose HomoGCL, a model-agnostic framework to expand the positive set using neighbor nodes with neighbor-specific significances. Theoretically, HomoGCL introduces a stricter lower bound of the mutual information between raw node features and node embeddings in augmented views. Furthermore, HomoGCL can be combined with existing graph CL models in a plug-and-play way with light extra computational overhead. Extensive experiments demonstrate that HomoGCL yields multiple stat",
    "path": "papers/23/06/2306.09614.json",
    "total_tokens": 902,
    "translated_title": "HomoGCL：重新思考图形对比学习中的同质性问题",
    "translated_abstract": "对比学习 (CL) 已成为自监督学习图形中的学习范式，通常遵循“增强-对比”学习方案。然而，我们观察到与计算机视觉领域中的对比学习不同，图形领域的对比学习即使没有数据增强也能表现良好。我们对这一现象进行了系统分析，并认为同质性即“物以类聚”的原则在图形对比学习的成功中起着关键作用。受到这一性质的启发，我们提出了HomoGCL，这是一个模型无关的框架，通过使用具有邻居特定重要性的邻居节点来扩展正集。理论上讲，HomoGCL引入了原始节点特征和节点嵌入在增强视图中的互信息的更严格的下限。此外，HomoGCL可以与现有的图形对比学习模型以插件方式组合起来，而只有轻微额外的计算开销。大量实验表明，HomoGCL产生了多种比现有方法更好的性能。",
    "tldr": "HomoGCL是一个模型无关的图形对比学习框架，利用同质性原则扩展正集，从而进一步提高图形对比学习的性能。",
    "en_tdlr": "HomoGCL is a model-agnostic graph contrastive learning framework that uses the principle of homophily to expand the positive set, thereby improving the performance of graph contrastive learning."
}