{
    "title": "On Learning Latent Models with Multi-Instance Weak Supervision. (arXiv:2306.13796v1 [cs.LG])",
    "abstract": "We consider a weakly supervised learning scenario where the supervision signal is generated by a transition function $\\sigma$ of labels associated with multiple input instances. We formulate this problem as \\emph{multi-instance Partial Label Learning (multi-instance PLL)}, which is an extension to the standard PLL problem. Our problem is met in different fields, including latent structural learning and neuro-symbolic integration. Despite the existence of many learning techniques, limited theoretical analysis has been dedicated to this problem. In this paper, we provide the first theoretical study of multi-instance PLL with possibly an unknown transition $\\sigma$. Our main contributions are as follows. Firstly, we propose a necessary and sufficient condition for the learnability of the problem. This condition non-trivially generalizes and relaxes the existing small ambiguity degree in the PLL literature, since we allow the transition to be deterministic. Secondly, we derive Rademacher-s",
    "link": "http://arxiv.org/abs/2306.13796",
    "context": "Title: On Learning Latent Models with Multi-Instance Weak Supervision. (arXiv:2306.13796v1 [cs.LG])\nAbstract: We consider a weakly supervised learning scenario where the supervision signal is generated by a transition function $\\sigma$ of labels associated with multiple input instances. We formulate this problem as \\emph{multi-instance Partial Label Learning (multi-instance PLL)}, which is an extension to the standard PLL problem. Our problem is met in different fields, including latent structural learning and neuro-symbolic integration. Despite the existence of many learning techniques, limited theoretical analysis has been dedicated to this problem. In this paper, we provide the first theoretical study of multi-instance PLL with possibly an unknown transition $\\sigma$. Our main contributions are as follows. Firstly, we propose a necessary and sufficient condition for the learnability of the problem. This condition non-trivially generalizes and relaxes the existing small ambiguity degree in the PLL literature, since we allow the transition to be deterministic. Secondly, we derive Rademacher-s",
    "path": "papers/23/06/2306.13796.json",
    "total_tokens": 950,
    "translated_abstract": "本文考虑了一种弱监督的学习情况，其中监督信号由与多个输入实例相关的标签的转换函数$ \\sigma $生成。我们将这个问题阐述为“多实例部分标签学习(multi-instance PLL)”，这是标准PLL问题的扩展。我们的问题在不同领域遇到，包括潜在的结构学习和神经符号一体化。尽管存在许多学习技术，但对这个问题的理论分析有限。本文提出了第一个理论研究可能具有未知转换 $\\sigma$ 的多实例PLL。我们的主要贡献如下。首先，我们提出了一个必要的和充分的条件，用于学习这个问题。该条件非常重要地推广和放宽了PLL文献中现有的小模糊度，因为我们允许转换是确定的。其次，我们推导了Rademacher-s",
    "tldr": "本文提出了一种多实例部分标记学习 (multi-instance PLL) 的方法，可以处理监督信号由与多个输入实例相关的标签的转换函数所生成的弱监督情况。此外，我们提出了一个必要且充分的学习条件，并做出贡献：这一条件推广且放松了现有部分标签学习文献中的小模糊度问题，因为我们允许转换是确定的。",
    "en_tdlr": "This paper proposes a method for multi-instance partial label learning (multi-instance PLL) to handle weakly supervised situations where the supervision signal is generated by a transition function of labels associated with multiple input instances. The paper provides a necessary and sufficient condition for learning the problem and contributes by generalizing and relaxing the existing ambiguity degree in the literature, allowing for the transition to be deterministic."
}