{
    "title": "Predicting Music Hierarchies with a Graph-Based Neural Decoder. (arXiv:2306.16955v1 [cs.SD])",
    "abstract": "This paper describes a data-driven framework to parse musical sequences into dependency trees, which are hierarchical structures used in music cognition research and music analysis. The parsing involves two steps. First, the input sequence is passed through a transformer encoder to enrich it with contextual information. Then, a classifier filters the graph of all possible dependency arcs to produce the dependency tree. One major benefit of this system is that it can be easily integrated into modern deep-learning pipelines. Moreover, since it does not rely on any particular symbolic grammar, it can consider multiple musical features simultaneously, make use of sequential context information, and produce partial results for noisy inputs. We test our approach on two datasets of musical trees -- time-span trees of monophonic note sequences and harmonic trees of jazz chord sequences -- and show that our approach outperforms previous methods.",
    "link": "http://arxiv.org/abs/2306.16955",
    "context": "Title: Predicting Music Hierarchies with a Graph-Based Neural Decoder. (arXiv:2306.16955v1 [cs.SD])\nAbstract: This paper describes a data-driven framework to parse musical sequences into dependency trees, which are hierarchical structures used in music cognition research and music analysis. The parsing involves two steps. First, the input sequence is passed through a transformer encoder to enrich it with contextual information. Then, a classifier filters the graph of all possible dependency arcs to produce the dependency tree. One major benefit of this system is that it can be easily integrated into modern deep-learning pipelines. Moreover, since it does not rely on any particular symbolic grammar, it can consider multiple musical features simultaneously, make use of sequential context information, and produce partial results for noisy inputs. We test our approach on two datasets of musical trees -- time-span trees of monophonic note sequences and harmonic trees of jazz chord sequences -- and show that our approach outperforms previous methods.",
    "path": "papers/23/06/2306.16955.json",
    "total_tokens": 886,
    "translated_title": "使用基于图的神经解码器预测音乐层次结构",
    "translated_abstract": "本文描述了一个数据驱动的框架，将音乐序列解析为依赖树，这是音乐认知研究和音乐分析中使用的分层结构。解析包括两个步骤。首先，将输入序列通过转换器编码器传递，以丰富上下文信息。然后，分类器筛选出所有可能的依赖弧的图，生成依赖树。该系统的一个主要优点是可以轻松集成到现代深度学习流水线中。此外，由于它不依赖于任何特定的符号语法，它可以同时考虑多个音乐特征，利用顺序上下文信息，并针对嘈杂的输入产生部分结果。我们将我们的方法测试在两个音乐树数据集上 - 单声部音符序列的时间跨度树和爵士和弦序列的和声树上，并展示了我们的方法优于先前的方法。",
    "tldr": "本文提出了一个基于图的神经解码器，用于预测音乐的层次结构。通过使用转换器编码器和分类器，该系统能够将音乐序列解析为依赖树，并在多个音乐特征和顺序上下文信息的基础上提供部分结果和更好的性能。",
    "en_tdlr": "This paper presents a graph-based neural decoder for predicting music hierarchies. By using a transformer encoder and a classifier, the system parses musical sequences into dependency trees, providing partial results and outperforming previous methods based on multiple music features and sequential context information."
}