{
    "title": "Detection of Late Blight Disease in Tomato Leaf Using Image Processing Techniques. (arXiv:2306.06080v1 [cs.CV])",
    "abstract": "=One of the most frequently farmed crops is the tomato crop. Late blight is the most prevalent tomato disease in the world, and often causes a significant reduction in the production of tomato crops. The importance of tomatoes as an agricultural product necessitates early detection of late blight. It is produced by the fungus Phytophthora. The earliest signs of late blight on tomatoes are unevenly formed, water-soaked lesions on the leaves located on the plant canopy's younger leave White cottony growth may appear in humid environments evident on the undersides of the leaves that have been impacted. Lesions increase as the disease proceeds, turning the leaves brown to shrivel up and die. Using picture segmentation and the Multi-class SVM technique, late blight disorder is discovered in this work. Image segmentation is employed for separating damaged areas on leaves, and the Multi-class SVM method is used for reliable disease categorization. 30 reputable studies were chosen from a total",
    "link": "http://arxiv.org/abs/2306.06080",
    "context": "Title: Detection of Late Blight Disease in Tomato Leaf Using Image Processing Techniques. (arXiv:2306.06080v1 [cs.CV])\nAbstract: =One of the most frequently farmed crops is the tomato crop. Late blight is the most prevalent tomato disease in the world, and often causes a significant reduction in the production of tomato crops. The importance of tomatoes as an agricultural product necessitates early detection of late blight. It is produced by the fungus Phytophthora. The earliest signs of late blight on tomatoes are unevenly formed, water-soaked lesions on the leaves located on the plant canopy's younger leave White cottony growth may appear in humid environments evident on the undersides of the leaves that have been impacted. Lesions increase as the disease proceeds, turning the leaves brown to shrivel up and die. Using picture segmentation and the Multi-class SVM technique, late blight disorder is discovered in this work. Image segmentation is employed for separating damaged areas on leaves, and the Multi-class SVM method is used for reliable disease categorization. 30 reputable studies were chosen from a total",
    "path": "papers/23/06/2306.06080.json",
    "total_tokens": 844,
    "translated_title": "基于图像处理技术的番茄晚疫病病叶检测",
    "translated_abstract": "番茄作为最常见的农作物之一，晚疫病是世界上最常见的番茄病害，经常导致番茄作物的产量显著降低。为了保证番茄作为农产品的重要角色，早期检测晚疫病十分必要。本研究利用图像分割和多类支持向量机技术来检测晚疫病。利用图像分割技术，将受损区域分离出来，通过多类支持向量机算法来对疾病进行可靠的分类。本研究从30项权威研究中选定了一项。",
    "tldr": "本研究利用图像分割和多类支持向量机技术，对受晚疫病影响的番茄叶进行检测。利用图像分割技术，将受损区域分离出来，通过多类支持向量机算法来对疾病进行可靠的分类。",
    "en_tdlr": "This study detects late blight disease in tomato leaves using image segmentation and multi-class SVM techniques. Damaged areas are separated using image segmentation, and reliable disease categorization is achieved through multi-class SVM algorithm."
}