{
    "title": "The Viability of Domain Constrained Coalition Formation for Robotic Collectives. (arXiv:2306.05590v1 [cs.MA])",
    "abstract": "Applications, such as military and disaster response, can benefit from robotic collectives' ability to perform multiple cooperative tasks (e.g., surveillance, damage assessments) efficiently across a large spatial area. Coalition formation algorithms can potentially facilitate collective robots' assignment to appropriate task teams; however, most coalition formation algorithms were designed for smaller multiple robot systems (i.e., 2-50 robots). Collectives' scale and domain-relevant constraints (i.e., distribution, near real-time, minimal communication) make coalition formation more challenging. This manuscript identifies the challenges inherent to designing coalition formation algorithms for very large collectives (e.g., 1000 robots). A survey of multiple robot coalition formation algorithms finds that most are unable to transfer directly to collectives, due to the identified system differences; however, auctions and hedonic games may be the most transferable. A simulation-based eval",
    "link": "http://arxiv.org/abs/2306.05590",
    "context": "Title: The Viability of Domain Constrained Coalition Formation for Robotic Collectives. (arXiv:2306.05590v1 [cs.MA])\nAbstract: Applications, such as military and disaster response, can benefit from robotic collectives' ability to perform multiple cooperative tasks (e.g., surveillance, damage assessments) efficiently across a large spatial area. Coalition formation algorithms can potentially facilitate collective robots' assignment to appropriate task teams; however, most coalition formation algorithms were designed for smaller multiple robot systems (i.e., 2-50 robots). Collectives' scale and domain-relevant constraints (i.e., distribution, near real-time, minimal communication) make coalition formation more challenging. This manuscript identifies the challenges inherent to designing coalition formation algorithms for very large collectives (e.g., 1000 robots). A survey of multiple robot coalition formation algorithms finds that most are unable to transfer directly to collectives, due to the identified system differences; however, auctions and hedonic games may be the most transferable. A simulation-based eval",
    "path": "papers/23/06/2306.05590.json",
    "total_tokens": 923,
    "translated_title": "有领域约束的联合编队在机器人集群中的应用前景探讨",
    "translated_abstract": "军事和灾难响应等领域中，机器人集群的协同能力可以在大范围内高效执行多种合作任务（如监视、损伤评估）。然而，联盟形成算法的大多数设计都是针对小型机器人系统（即2-50个机器人），而大规模集群和领域相关的约束条件（如高效分配、实时性、最小通信）使得联盟形成变得更加具有挑战性。本文发现，拍卖和愉悦博弈可能是最有可转移性的，提出了一种混合改进拍卖算法来解决机器人集群协作搜索和收集问题。通过模拟实验表明，分布式执行的拍卖算法可以提高任务分配效率，有领域约束的联合编队算法显示出适用于大规模机器人集群的前景。",
    "tldr": "该论文研究了如何在领域约束下，设计适用于大规模机器人集群的联盟形成算法，提出了一种基于拍卖算法的混合改进方法，可提高任务分配效率，并有应用前景。",
    "en_tdlr": "This paper investigates the design of domain-specific coalition formation algorithms for large robotic collectives and proposes a hybrid auction algorithm which improves task allocation efficiency, showing promise for practical applications."
}