{
    "title": "CIN++: Enhancing Topological Message Passing. (arXiv:2306.03561v1 [cs.LG])",
    "abstract": "Graph Neural Networks (GNNs) have demonstrated remarkable success in learning from graph-structured data. However, they face significant limitations in expressive power, struggling with long-range interactions and lacking a principled approach to modeling higher-order structures and group interactions. Cellular Isomorphism Networks (CINs) recently addressed most of these challenges with a message passing scheme based on cell complexes. Despite their advantages, CINs make use only of boundary and upper messages which do not consider a direct interaction between the rings present in the underlying complex. Accounting for these interactions might be crucial for learning representations of many real-world complex phenomena such as the dynamics of supramolecular assemblies, neural activity within the brain, and gene regulation processes. In this work, we propose CIN++, an enhancement of the topological message passing scheme introduced in CINs. Our message passing scheme accounts for the af",
    "link": "http://arxiv.org/abs/2306.03561",
    "context": "Title: CIN++: Enhancing Topological Message Passing. (arXiv:2306.03561v1 [cs.LG])\nAbstract: Graph Neural Networks (GNNs) have demonstrated remarkable success in learning from graph-structured data. However, they face significant limitations in expressive power, struggling with long-range interactions and lacking a principled approach to modeling higher-order structures and group interactions. Cellular Isomorphism Networks (CINs) recently addressed most of these challenges with a message passing scheme based on cell complexes. Despite their advantages, CINs make use only of boundary and upper messages which do not consider a direct interaction between the rings present in the underlying complex. Accounting for these interactions might be crucial for learning representations of many real-world complex phenomena such as the dynamics of supramolecular assemblies, neural activity within the brain, and gene regulation processes. In this work, we propose CIN++, an enhancement of the topological message passing scheme introduced in CINs. Our message passing scheme accounts for the af",
    "path": "papers/23/06/2306.03561.json",
    "total_tokens": 869,
    "translated_title": "CIN++：增强拓扑信息传递",
    "translated_abstract": "图神经网络已经在学习图结构化数据方面获得了显着的成功。然而，它们在表达能力上存在显著的局限性，难以处理长程交互，并缺乏对建模高阶结构和群体相互作用的基本方法。细胞同构网络最近通过基于细胞复合体的信息传递方案解决了大部分这些挑战。尽管具有优势，但CIN仅使用边界和上部信息，而没有考虑底层复合体中存在的环之间的直接相互作用。考虑到这些相互作用可能对学习许多真实复杂现象的表示非常重要，如超分子组装的动力学、脑内神经活动和基因调控过程。因此本文提出了CIN++，这是CIN引入的拓扑信息传递方案的一种增强版。我们的信息传递方案考虑了环之间的相互作用。",
    "tldr": "CIN++是一种拓扑信息传递方案，通过考虑底层复合体中环之间的相互作用来解决图神经网络在表达能力、处理长程交互和建模高阶结构等方面的局限性。",
    "en_tdlr": "CIN++ is an enhanced topological message passing scheme that addresses the limitations of graph neural networks in expressing complexity, handling long-range interactions, and modeling higher-order structures by considering interactions between rings present in underlying complex."
}