{
    "title": "Resume Information Extraction via Post-OCR Text Processing. (arXiv:2306.13775v1 [cs.CL])",
    "abstract": "Information extraction (IE), one of the main tasks of natural language processing (NLP), has recently increased importance in the use of resumes. In studies on the text to extract information from the CV, sentence classification was generally made using NLP models. In this study, it is aimed to extract information by classifying all of the text groups after pre-processing such as Optical Character Recognition (OCT) and object recognition with the YOLOv8 model of the resumes. The text dataset consists of 286 resumes collected for 5 different (education, experience, talent, personal and language) job descriptions in the IT industry. The dataset created for object recognition consists of 1198 resumes, which were collected from the open-source internet and labeled as sets of text. BERT, BERT-t, DistilBERT, RoBERTa and XLNet were used as models. F1 score variances were used to compare the model results. In addition, the YOLOv8 model has also been reported comparatively in itself. As a resul",
    "link": "http://arxiv.org/abs/2306.13775",
    "context": "Title: Resume Information Extraction via Post-OCR Text Processing. (arXiv:2306.13775v1 [cs.CL])\nAbstract: Information extraction (IE), one of the main tasks of natural language processing (NLP), has recently increased importance in the use of resumes. In studies on the text to extract information from the CV, sentence classification was generally made using NLP models. In this study, it is aimed to extract information by classifying all of the text groups after pre-processing such as Optical Character Recognition (OCT) and object recognition with the YOLOv8 model of the resumes. The text dataset consists of 286 resumes collected for 5 different (education, experience, talent, personal and language) job descriptions in the IT industry. The dataset created for object recognition consists of 1198 resumes, which were collected from the open-source internet and labeled as sets of text. BERT, BERT-t, DistilBERT, RoBERTa and XLNet were used as models. F1 score variances were used to compare the model results. In addition, the YOLOv8 model has also been reported comparatively in itself. As a resul",
    "path": "papers/23/06/2306.13775.json",
    "total_tokens": 953,
    "translated_title": "通过OCR后的文本处理进行简历信息提取",
    "translated_abstract": "自然语言处理领域中其中一项主要任务信息提取（IE）在简历中日益增加重要性。以往的研究中，通常是使用NLP模型对简历中的信息进行句子分类提取。本研究旨在通过预处理（如光学字符识别（OCR）和对象识别）来分类提取简历中的所有文本组。数据集包含286份简历，其中涵盖了IT行业5个不同职位（教育、经验、才能、个人和语言）的要求，并且使用BERT、BERT-t、DistilBERT、RoBERTa 和 XLNet等模型进行实验。与此同时，YOLOv8模型的结果也进行了比较。研究表明，通过使用OCR后的文本处理和YOLOv8对象识别，该方法比先前的基于NLP的模型在简历信息提取方面表现更好，特别是在教育信息和经验信息提取方面分别达到了0.94和0.91的F1分数。",
    "tldr": "本文提出了利用OCR后的文本处理和YOLOv8对象识别进行简历信息提取的方法，并成功优于以往基于NLP的模型对简历中教育和经验信息进行提取。",
    "en_tdlr": "This paper proposes a method for resume information extraction using post-OCR text processing and YOLOv8 object recognition, which outperforms previous NLP-based models in extracting education and experience information from resumes."
}