{
    "title": "AircraftVerse: A Large-Scale Multimodal Dataset of Aerial Vehicle Designs. (arXiv:2306.05562v1 [cs.RO])",
    "abstract": "We present AircraftVerse, a publicly available aerial vehicle design dataset. Aircraft design encompasses different physics domains and, hence, multiple modalities of representation. The evaluation of these cyber-physical system (CPS) designs requires the use of scientific analytical and simulation models ranging from computer-aided design tools for structural and manufacturing analysis, computational fluid dynamics tools for drag and lift computation, battery models for energy estimation, and simulation models for flight control and dynamics. AircraftVerse contains 27,714 diverse air vehicle designs - the largest corpus of engineering designs with this level of complexity. Each design comprises the following artifacts: a symbolic design tree describing topology, propulsion subsystem, battery subsystem, and other design details; a STandard for the Exchange of Product (STEP) model data; a 3D CAD design using a stereolithography (STL) file format; a 3D point cloud for the shape of the de",
    "link": "http://arxiv.org/abs/2306.05562",
    "context": "Title: AircraftVerse: A Large-Scale Multimodal Dataset of Aerial Vehicle Designs. (arXiv:2306.05562v1 [cs.RO])\nAbstract: We present AircraftVerse, a publicly available aerial vehicle design dataset. Aircraft design encompasses different physics domains and, hence, multiple modalities of representation. The evaluation of these cyber-physical system (CPS) designs requires the use of scientific analytical and simulation models ranging from computer-aided design tools for structural and manufacturing analysis, computational fluid dynamics tools for drag and lift computation, battery models for energy estimation, and simulation models for flight control and dynamics. AircraftVerse contains 27,714 diverse air vehicle designs - the largest corpus of engineering designs with this level of complexity. Each design comprises the following artifacts: a symbolic design tree describing topology, propulsion subsystem, battery subsystem, and other design details; a STandard for the Exchange of Product (STEP) model data; a 3D CAD design using a stereolithography (STL) file format; a 3D point cloud for the shape of the de",
    "path": "papers/23/06/2306.05562.json",
    "total_tokens": 879,
    "translated_title": "飞行器设计的大规模多模态数据集：AircraftVerse",
    "translated_abstract": "我们呈现了一个公开可用的飞行器设计数据集，即AircraftVerse。飞行器设计涵盖不同的物理领域和多种表示形式。评估这些智能物理系统设计需要使用科学分析和仿真模型，从结构和制造分析的计算机辅助设计工具，到计算流体力学工具的阻力和升力计算，再到能源估计的电池模型和飞行控制与动力学的仿真模型。AircraftVerse包含27,714种不同的飞行器设计，是具有此复杂程度的工程设计最大的语料库。每个设计包括以下构件：描述拓扑、推进子系统、电池子系统和其他设计细节的符号设计树；以STandard for the Exchange of Product (STEP) 模型数据为基础的 3D CAD设计；以立体光刻（STL）文件格式为基础的3D点云，用于描述设计的形状。",
    "tldr": "AircraftVerse是一个公开可用的飞行器设计数据集，包含27,714个不同的设计，是具有此复杂程度的工程设计最大的语料库。每个设计都涵盖了飞行器设计领域的多个物理领域和多种表示形式。",
    "en_tdlr": "AircraftVerse is a publicly available dataset for aerial vehicle design, containing 27,714 diverse designs and covering multiple physics domains and modalities of representation, making it the largest corpus of engineering designs with this level of complexity."
}