{
    "title": "ReadProbe: A Demo of Retrieval-Enhanced Large Language Models to Support Lateral Reading. (arXiv:2306.07875v1 [cs.IR])",
    "abstract": "With the rapid growth and spread of online misinformation, people need tools to help them evaluate the credibility and accuracy of online information. Lateral reading, a strategy that involves cross-referencing information with multiple sources, may be an effective approach to achieving this goal. In this paper, we present ReadProbe, a tool to support lateral reading, powered by generative large language models from OpenAI and the Bing search engine. Our tool is able to generate useful questions for lateral reading, scour the web for relevant documents, and generate well-attributed answers to help people better evaluate online information. We made a web-based application to demonstrate how ReadProbe can help reduce the risk of being misled by false information. The code is available at https://github.com/DakeZhang1998/ReadProbe. An earlier version of our tool won the first prize in a national AI misinformation hackathon.",
    "link": "http://arxiv.org/abs/2306.07875",
    "context": "Title: ReadProbe: A Demo of Retrieval-Enhanced Large Language Models to Support Lateral Reading. (arXiv:2306.07875v1 [cs.IR])\nAbstract: With the rapid growth and spread of online misinformation, people need tools to help them evaluate the credibility and accuracy of online information. Lateral reading, a strategy that involves cross-referencing information with multiple sources, may be an effective approach to achieving this goal. In this paper, we present ReadProbe, a tool to support lateral reading, powered by generative large language models from OpenAI and the Bing search engine. Our tool is able to generate useful questions for lateral reading, scour the web for relevant documents, and generate well-attributed answers to help people better evaluate online information. We made a web-based application to demonstrate how ReadProbe can help reduce the risk of being misled by false information. The code is available at https://github.com/DakeZhang1998/ReadProbe. An earlier version of our tool won the first prize in a national AI misinformation hackathon.",
    "path": "papers/23/06/2306.07875.json",
    "total_tokens": 861,
    "translated_title": "ReadProbe: 一种支持横向阅读的检索增强大语言模型演示",
    "translated_abstract": "随着网络不实信息的快速增长和传播，人们需要工具来帮助他们评估在线信息的可信度和准确性。横向阅读是一种跨参考多个信息源的策略，可能是实现这一目标的有效方法。在本文中，我们提出了一个工具，名为 ReadProbe，它支持横向阅读，由 OpenAI 的生成式大语言模型和必应搜索引擎驱动。我们的工具能够为横向阅读生成有用的问题，搜寻网络上相关的文档，并产生良好归因的答案，帮助人们更好地评估在线信息。我们制作了一个基于 Web 的应用程序，演示了 ReadProbe 如何帮助减少被虚假信息误导的风险。我们的代码可在 https://github.com/DakeZhang1998/ReadProbe 上获得，我们的早期版本赢得了全国人工智能虚假信息黑客马拉松的一等奖。",
    "tldr": "ReadProbe 是一种利用大型语言模型和搜索引擎支持横向阅读的工具，它能够生成有用问题和答案以帮助用户评估在线信息。",
    "en_tdlr": "ReadProbe is a tool that supports lateral reading using large language models and search engines to generate useful questions and answers to help users evaluate online information."
}