{
    "title": "The Role of Twitter in Cryptocurrency Pump-and-Dumps. (arXiv:2306.02148v1 [q-fin.TR])",
    "abstract": "We examine the influence of Twitter promotion on cryptocurrency pump-and-dump events. By analyzing abnormal returns, trading volume, and tweet activity, we uncover that Twitter effectively garners attention for pump-and-dump schemes, leading to notable effects on abnormal returns before the event. Our results indicate that investors relying on Twitter information exhibit delayed selling behavior during the post-dump phase, resulting in significant losses compared to other participants. These findings shed light on the pivotal role of Twitter promotion in cryptocurrency manipulation, offering valuable insights into participant behavior and market dynamics.",
    "link": "http://arxiv.org/abs/2306.02148",
    "context": "Title: The Role of Twitter in Cryptocurrency Pump-and-Dumps. (arXiv:2306.02148v1 [q-fin.TR])\nAbstract: We examine the influence of Twitter promotion on cryptocurrency pump-and-dump events. By analyzing abnormal returns, trading volume, and tweet activity, we uncover that Twitter effectively garners attention for pump-and-dump schemes, leading to notable effects on abnormal returns before the event. Our results indicate that investors relying on Twitter information exhibit delayed selling behavior during the post-dump phase, resulting in significant losses compared to other participants. These findings shed light on the pivotal role of Twitter promotion in cryptocurrency manipulation, offering valuable insights into participant behavior and market dynamics.",
    "path": "papers/23/06/2306.02148.json",
    "total_tokens": 752,
    "translated_title": "探究Twitter在加密货币“Pump-and-Dump”中的作用",
    "translated_abstract": "本文研究了Twitter在加密货币“Pump-and-Dump”事件中的影响。通过分析异常收益、交易量和推文活动，我们发现Twitter能有效地吸引人们关注“Pump-and-Dump”计划，在事件之前对异常收益产生显著影响。我们的结果表明，依赖Twitter信息的投资者在后期出现了延迟出售行为，导致与其他参与者相比出现了显著的损失。这些研究结果揭示了Twitter在加密货币操纵中的关键作用，为参与者行为和市场动态提供了有价值的见解。",
    "tldr": "本研究探讨了Twitter在加密货币“Pump-and-Dump”事件中的作用，发现Twitter能吸引人们的关注，对事件之前的异常收益产生显著影响，而依赖Twitter信息的投资者在后期出现了延迟出售行为，导致损失。",
    "en_tdlr": "This study examines the role of Twitter in cryptocurrency pump-and-dump events. It found that Twitter effectively attracts attention for pump-and-dump schemes and has notable effects on abnormal returns before the event. Investors relying on Twitter information exhibit delayed selling behavior during the post-dump phase, resulting in significant losses compared to other participants."
}