{
    "title": "Criteria for NUPBR, NFLVR and the existence of EMMs in integrated diffusion markets. (arXiv:2306.11470v1 [q-fin.MF])",
    "abstract": "Consider a single asset financial market whose discounted asset price process is a stochastic integral with respect to a continuous regular strong Markov semimartingale (a so-called general diffusion semimartingale) that is parameterized by a scale function and a speed measure. In a previous paper, we established a characterization of the no free lunch with vanishing risk (NFLVR) condition for a canonical framework of such a financial market in terms of the scale function and the speed measure. Ioannis Karatzas (personal communication) asked us whether it is also possible to prove a characterization for the weaker no unbounded profit with bounded risk (NUPBR) condition, which is the main question we treat in this paper. Here, we do not restrict our attention to canonical frameworks but we allow a general setup with a general filtration that preserves the strong Markov property. Our main results are precise characterizations of NUPBR and NFLVR which only depend on the scale function and",
    "link": "http://arxiv.org/abs/2306.11470",
    "context": "Title: Criteria for NUPBR, NFLVR and the existence of EMMs in integrated diffusion markets. (arXiv:2306.11470v1 [q-fin.MF])\nAbstract: Consider a single asset financial market whose discounted asset price process is a stochastic integral with respect to a continuous regular strong Markov semimartingale (a so-called general diffusion semimartingale) that is parameterized by a scale function and a speed measure. In a previous paper, we established a characterization of the no free lunch with vanishing risk (NFLVR) condition for a canonical framework of such a financial market in terms of the scale function and the speed measure. Ioannis Karatzas (personal communication) asked us whether it is also possible to prove a characterization for the weaker no unbounded profit with bounded risk (NUPBR) condition, which is the main question we treat in this paper. Here, we do not restrict our attention to canonical frameworks but we allow a general setup with a general filtration that preserves the strong Markov property. Our main results are precise characterizations of NUPBR and NFLVR which only depend on the scale function and",
    "path": "papers/23/06/2306.11470.json",
    "total_tokens": 947,
    "translated_title": "集成扩散市场中 NUPBR、NFLVR 准则与 EMM 存在的判据",
    "translated_abstract": "本文考虑一个单一资产金融市场，其折现资产价格过程是相对于连续正则强 Markov 半鞅（即所谓的一般扩散半鞅）的随机积分，其被一个比例函数和一个速率测度参数化。在我们之前的一篇论文中，我们建立了对于这样一个金融市场的一个典型框架的无风险无限制利润 (NFLVR) 条件的表征，表征是基于比例函数和速度测度的。 Ioannis Karatzas 在我们个人的交流中问我们是否也能够为较弱的有限制风险有界利润 (NUPBR) 条件证明一个表征，这是我们在本文中处理的主要问题。在这里，我们不限于标准框架，而是允许一个保留强 Markov 性质的一般过滤器的一般设置。我们的主要结果是 NUPBR 和 NFLVR 的精确表征，这些表征仅取决于比例函数和速度测度。",
    "tldr": "本文提供了集成扩散市场中关于有限制风险有界利润（NUPBR）与无风险无限制利润（NFLVR）条件的精确表征，这些表征只取决于比例函数和速度测度。",
    "en_tdlr": "This paper provides precise characterizations of the no unbounded profit with bounded risk (NUPBR) and no free lunch with vanishing risk (NFLVR) conditions in integrated diffusion markets, which only depend on the scale function and speed measure."
}