{
    "title": "Planning Landmark Based Goal Recognition Revisited: Does Using Initial State Landmarks Make Sense?. (arXiv:2306.15362v1 [cs.AI])",
    "abstract": "Goal recognition is an important problem in many application domains (e.g., pervasive computing, intrusion detection, computer games, etc.). In many application scenarios, it is important that goal recognition algorithms can recognize goals of an observed agent as fast as possible. However, many early approaches in the area of Plan Recognition As Planning, require quite large amounts of computation time to calculate a solution. Mainly to address this issue, recently, Pereira et al. developed an approach that is based on planning landmarks and is much more computationally efficient than previous approaches. However, the approach, as proposed by Pereira et al., also uses trivial landmarks (i.e., facts that are part of the initial state and goal description are landmarks by definition). In this paper, we show that it does not provide any benefit to use landmarks that are part of the initial state in a planning landmark based goal recognition approach. The empirical results show that omitt",
    "link": "http://arxiv.org/abs/2306.15362",
    "context": "Title: Planning Landmark Based Goal Recognition Revisited: Does Using Initial State Landmarks Make Sense?. (arXiv:2306.15362v1 [cs.AI])\nAbstract: Goal recognition is an important problem in many application domains (e.g., pervasive computing, intrusion detection, computer games, etc.). In many application scenarios, it is important that goal recognition algorithms can recognize goals of an observed agent as fast as possible. However, many early approaches in the area of Plan Recognition As Planning, require quite large amounts of computation time to calculate a solution. Mainly to address this issue, recently, Pereira et al. developed an approach that is based on planning landmarks and is much more computationally efficient than previous approaches. However, the approach, as proposed by Pereira et al., also uses trivial landmarks (i.e., facts that are part of the initial state and goal description are landmarks by definition). In this paper, we show that it does not provide any benefit to use landmarks that are part of the initial state in a planning landmark based goal recognition approach. The empirical results show that omitt",
    "path": "papers/23/06/2306.15362.json",
    "total_tokens": 840,
    "translated_title": "以地标为基础的目标识别再讨论：使用初始状态的地标是否有意义？",
    "translated_abstract": "目标识别是许多应用领域（如普适计算、入侵检测、电脑游戏等）中的重要问题。在许多应用场景中，目标识别算法需要能够尽快地识别观察到的主体的目标。然而，在计划识别即计划中，许多早期方法需要相当大量的计算时间来计算解决方案。为了解决这个问题，Pereira等人最近开发了一种基于规划地标的方法，它比之前的方法在计算效率上要高得多。然而，正如Pereira等人提出的方法一样，它也使用了琐碎的地标（即，初始状态和目标描述中的事实在定义上就是地标）。在本文中，我们展示了在基于规划地标的目标识别方法中使用初始状态的地标没有提供任何好处。实证结果表明，省略掉初始状态的地标的方法更为有效。",
    "tldr": "本文提出了对以地标为基础的目标识别方法进行再讨论，结果表明在该方法中使用初始状态的地标没有优势。"
}