{
    "title": "Symmetry-Aware Robot Design with Structured Subgroups. (arXiv:2306.00036v1 [cs.AI])",
    "abstract": "Robot design aims at learning to create robots that can be easily controlled and perform tasks efficiently. Previous works on robot design have proven its ability to generate robots for various tasks. However, these works searched the robots directly from the vast design space and ignored common structures, resulting in abnormal robots and poor performance. To tackle this problem, we propose a Symmetry-Aware Robot Design (SARD) framework that exploits the structure of the design space by incorporating symmetry searching into the robot design process. Specifically, we represent symmetries with the subgroups of the dihedral group and search for the optimal symmetry in structured subgroups. Then robots are designed under the searched symmetry. In this way, SARD can design efficient symmetric robots while covering the original design space, which is theoretically analyzed. We further empirically evaluate SARD on various tasks, and the results show its superior efficiency and generalizabili",
    "link": "http://arxiv.org/abs/2306.00036",
    "context": "Title: Symmetry-Aware Robot Design with Structured Subgroups. (arXiv:2306.00036v1 [cs.AI])\nAbstract: Robot design aims at learning to create robots that can be easily controlled and perform tasks efficiently. Previous works on robot design have proven its ability to generate robots for various tasks. However, these works searched the robots directly from the vast design space and ignored common structures, resulting in abnormal robots and poor performance. To tackle this problem, we propose a Symmetry-Aware Robot Design (SARD) framework that exploits the structure of the design space by incorporating symmetry searching into the robot design process. Specifically, we represent symmetries with the subgroups of the dihedral group and search for the optimal symmetry in structured subgroups. Then robots are designed under the searched symmetry. In this way, SARD can design efficient symmetric robots while covering the original design space, which is theoretically analyzed. We further empirically evaluate SARD on various tasks, and the results show its superior efficiency and generalizabili",
    "path": "papers/23/06/2306.00036.json",
    "total_tokens": 957,
    "translated_title": "基于对称结构子群的机器人设计方法",
    "translated_abstract": "机器人的设计旨在学习如何创建易于控制且高效完成任务的机器人。以往的机器人设计研究已证明其能生成适用于各种任务的机器人。然而，这些研究直接从庞大的设计空间中搜索机器人，而忽略了共同的结构，导致机器人异常且性能不佳。为解决这个问题，我们提出了一种称为“基于对称结构子群的机器人设计”（SARD）框架，通过把对称性搜索引入机器人设计过程中，利用设计空间的结构信息。具体说，我们用二面体群的子群代表对称性，并在结构化子群中搜索最优对称性。然后，在搜索到的对称性下完成机器人设计。这样，SARD能够设计出高效的对称机器人，同时覆盖原始设计空间，理论上是可行的。我们进一步在各种任务中进行了实证评估，结果表明SARD具有卓越的效率和通用性。",
    "tldr": "提出了一种利用对称性搜索的机器人设计方法，使用二面体群的子群表示对称性，并在结构化子群中搜索最优对称性，并在此对称性下完成机器人设计。理论证明了该方法能在保持设计空间的同时，设计出高效的对称机器人，实证评估也表明其具有卓越的效率和通用性。",
    "en_tdlr": "A symmetry-aware robot design method is proposed, which uses subgroups of the dihedral group to represent symmetries and searches for the optimal symmetry in structured subgroups. Robots are then designed under the searched symmetry. The theoretical analysis shows that this method can design efficient symmetric robots while covering the original design space. Empirical evaluation further demonstrates its superior efficiency and generalizability."
}