{
    "title": "Physics-informed UNets for Discovering Hidden Elasticity in Heterogeneous Materials. (arXiv:2306.01204v1 [cs.LG])",
    "abstract": "Soft biological tissues often have complex mechanical properties due to variation in structural components. In this paper, we develop a novel UNet-based neural network model for inversion in elasticity (El-UNet) to infer the spatial distributions of mechanical parameters from strain maps as input images, normal stress boundary conditions, and domain physics information. We show superior performance, both in terms of accuracy and computational cost, by El-UNet compared to fully-connected physics-informed neural networks in estimating unknown parameters and stress distributions for isotropic linear elasticity. We characterize different variations of El-UNet and propose a self-adaptive spatial loss weighting approach. To validate our inversion models, we performed various finite-element simulations of isotropic domains with heterogenous distributions of material parameters to generate synthetic data. El-UNet is faster and more accurate than the fully-connected physics-informed implementat",
    "link": "http://arxiv.org/abs/2306.01204",
    "context": "Title: Physics-informed UNets for Discovering Hidden Elasticity in Heterogeneous Materials. (arXiv:2306.01204v1 [cs.LG])\nAbstract: Soft biological tissues often have complex mechanical properties due to variation in structural components. In this paper, we develop a novel UNet-based neural network model for inversion in elasticity (El-UNet) to infer the spatial distributions of mechanical parameters from strain maps as input images, normal stress boundary conditions, and domain physics information. We show superior performance, both in terms of accuracy and computational cost, by El-UNet compared to fully-connected physics-informed neural networks in estimating unknown parameters and stress distributions for isotropic linear elasticity. We characterize different variations of El-UNet and propose a self-adaptive spatial loss weighting approach. To validate our inversion models, we performed various finite-element simulations of isotropic domains with heterogenous distributions of material parameters to generate synthetic data. El-UNet is faster and more accurate than the fully-connected physics-informed implementat",
    "path": "papers/23/06/2306.01204.json",
    "total_tokens": 882,
    "translated_title": "物理学知识增强的 UNet 用于发现异质材料中隐藏的弹性",
    "translated_abstract": "生物软组织常常由于结构成分的变化而具有复杂的机械特性。本文提出了一种新颖的基于 UNet 的反演弹性神经网络模型 (El-UNet)，将应变图作为输入图像、正常应力边界条件和区域物理信息，以推断力学参数的空间分布。我们展示了 El-UNet 在估计等向性线性弹性的未知参数和应力分布方面，与全连接的物理学知识增强神经网络相比，具有更高的性能，无论是在精度还是计算成本方面。我们对 El-UNet 的不同变体进行了分类，并提出了一种自适应空间损失加权方法。为了验证我们的反演模型，我们进行了各种等向异质材料有限元模拟产生的合成数据。El-UNet 比全连接物理学知识增强的实现更快、更准确。",
    "tldr": "本文提出了一种新型的 UNet 神经网络模型 (El-UNet)，能够通过物理学知识增强和应变图像的分析，精确地推断生物软组织中材料参数的空间分布，具有高性能的优劣和计算效率。"
}