{
    "title": "Sea Change in Software Development: Economic and Productivity Analysis of the AI-Powered Developer Lifecycle. (arXiv:2306.15033v1 [econ.GN])",
    "abstract": "This study examines the impact of GitHub Copilot on a large sample of Copilot users (n=934,533). The analysis shows that users on average accept nearly 30% of the suggested code, leading to increased productivity. Furthermore, our research demonstrates that the acceptance rate rises over time and is particularly high among less experienced developers, providing them with substantial benefits. Additionally, our estimations indicate that the adoption of generative AI productivity tools could potentially contribute to a $1.5 trillion increase in global GDP by 2030. Moreover, our investigation sheds light on the diverse contributors in the generative AI landscape, including major technology companies, startups, academia, and individual developers. The findings suggest that the driving force behind generative AI software innovation lies within the open-source ecosystem, particularly in the United States. Remarkably, a majority of repositories on GitHub are led by individual developers. As m",
    "link": "http://arxiv.org/abs/2306.15033",
    "context": "Title: Sea Change in Software Development: Economic and Productivity Analysis of the AI-Powered Developer Lifecycle. (arXiv:2306.15033v1 [econ.GN])\nAbstract: This study examines the impact of GitHub Copilot on a large sample of Copilot users (n=934,533). The analysis shows that users on average accept nearly 30% of the suggested code, leading to increased productivity. Furthermore, our research demonstrates that the acceptance rate rises over time and is particularly high among less experienced developers, providing them with substantial benefits. Additionally, our estimations indicate that the adoption of generative AI productivity tools could potentially contribute to a $1.5 trillion increase in global GDP by 2030. Moreover, our investigation sheds light on the diverse contributors in the generative AI landscape, including major technology companies, startups, academia, and individual developers. The findings suggest that the driving force behind generative AI software innovation lies within the open-source ecosystem, particularly in the United States. Remarkably, a majority of repositories on GitHub are led by individual developers. As m",
    "path": "papers/23/06/2306.15033.json",
    "total_tokens": 980,
    "translated_title": "软件开发的巨变: 基于人工智能开发者生命周期的经济和生产力分析",
    "translated_abstract": "本研究考察了GitHub Copilot在大样本Copilot用户（n=934,533）中的影响。分析结果表明，用户平均接受了近30%的建议代码，从而提高了生产力。此外，我们的研究表明，接受率随时间增长，并且在经验较少的开发者中尤其高，为他们带来了实质性的好处。此外，我们的估计表明，采用生成式AI生产力工具可能在2030年前为全球GDP增加1.5万亿美元。此外，我们的调查揭示了生成式AI领域的多元贡献者，包括主要技术公司、初创公司、学术界和个人开发者。研究结果表明，生成式AI软件创新的推动力量在于开源生态系统，尤其是在美国。值得注意的是，GitHub上的大多数仓库由个人开发者领导。",
    "tldr": "本研究通过分析大样本Copilot用户的数据，发现GitHub Copilot工具的使用可提高开发者的生产力，特别是对经验较少的开发者有很大帮助。同时，采用生成式AI生产力工具有望在2030年前为全球GDP增加1.5万亿美元。开源生态系统是生成式AI软件创新的重要推动力量，其中个人开发者在GitHub上发挥了重要作用。",
    "en_tdlr": "This study explores the impact of GitHub Copilot on developers, showing that its usage increases productivity, especially for less experienced developers. Additionally, the adoption of generative AI productivity tools could potentially contribute to a $1.5 trillion increase in global GDP by 2030. The open-source ecosystem, led by individual developers on GitHub, plays a crucial role in driving generative AI software innovation."
}