{
    "title": "Learned Mappings for Targeted Free Energy Perturbation between Peptide Conformations. (arXiv:2306.14010v1 [cond-mat.stat-mech])",
    "abstract": "Targeted free energy perturbation uses an invertible mapping to promote configuration space overlap and the convergence of free energy estimates. However, developing suitable mappings can be challenging. Wirnsberger et al. (2020) demonstrated the use of machine learning to train deep neural networks that map between Boltzmann distributions for different thermodynamic states. Here, we adapt their approach to free energy differences of a flexible bonded molecule, deca-alanine, with harmonic biases with different spring centers. When the neural network is trained until ``early stopping'' - when the loss value of the test set increases - we calculate accurate free energy differences between thermodynamic states with spring centers separated by 1 \\r{A} and sometimes 2 \\r{A}. For more distant thermodynamic states, the mapping does not produce structures representative of the target state and the method does not reproduce reference calculations.",
    "link": "http://arxiv.org/abs/2306.14010",
    "context": "Title: Learned Mappings for Targeted Free Energy Perturbation between Peptide Conformations. (arXiv:2306.14010v1 [cond-mat.stat-mech])\nAbstract: Targeted free energy perturbation uses an invertible mapping to promote configuration space overlap and the convergence of free energy estimates. However, developing suitable mappings can be challenging. Wirnsberger et al. (2020) demonstrated the use of machine learning to train deep neural networks that map between Boltzmann distributions for different thermodynamic states. Here, we adapt their approach to free energy differences of a flexible bonded molecule, deca-alanine, with harmonic biases with different spring centers. When the neural network is trained until ``early stopping'' - when the loss value of the test set increases - we calculate accurate free energy differences between thermodynamic states with spring centers separated by 1 \\r{A} and sometimes 2 \\r{A}. For more distant thermodynamic states, the mapping does not produce structures representative of the target state and the method does not reproduce reference calculations.",
    "path": "papers/23/06/2306.14010.json",
    "total_tokens": 932,
    "translated_title": "学习映射用于肽构象间的有针对性自由能扰动",
    "translated_abstract": "有针对性自由能扰动利用可逆映射来促进构象空间的重叠和自由能估计的收敛。然而，开发合适的映射可能具有挑战性。Wirnsberger等人（2020）展示了使用机器学习来训练深度神经网络，将不同热力学状态的Boltzmann分布之间进行映射。在本文中，我们将他们的方法应用到具有不同弹簧中心的弹性键合分子Deca-Alanine的自由能差异上。当神经网络训练到“提前停止”-即测试集的损失值增加时-我们可以计算出弹簧中心相隔1Å和有时2Å的热力学状态之间的准确自由能差异。对于更远的热力学状态，该映射不会产生代表目标状态的结构，该方法也无法复现参考计算。",
    "tldr": "本文研究了将机器学习用于映射自由能扰动中的Boltzmann分布，以求得Deca-Alanine分子的自由能差异。当弹簧中心相隔较近时，该方法可以得到准确的结果，但当弹簧中心相隔较远时，该方法无法得到代表目标状态的结构和正确的结果。",
    "en_tdlr": "This paper investigates the use of machine learning for mapping between Boltzmann distributions in free energy perturbation and applies it to compute free energy differences of Deca-Alanine with different spring centers. Accurate results can be obtained when the centers are close, but not when they are distant."
}