{
    "title": "Homological Neural Networks: A Sparse Architecture for Multivariate Complexity. (arXiv:2306.15337v1 [cs.LG])",
    "abstract": "The rapid progress of Artificial Intelligence research came with the development of increasingly complex deep learning models, leading to growing challenges in terms of computational complexity, energy efficiency and interpretability. In this study, we apply advanced network-based information filtering techniques to design a novel deep neural network unit characterized by a sparse higher-order graphical architecture built over the homological structure of underlying data. We demonstrate its effectiveness in two application domains which are traditionally challenging for deep learning: tabular data and time series regression problems. Results demonstrate the advantages of this novel design which can tie or overcome the results of state-of-the-art machine learning and deep learning models using only a fraction of parameters.",
    "link": "http://arxiv.org/abs/2306.15337",
    "context": "Title: Homological Neural Networks: A Sparse Architecture for Multivariate Complexity. (arXiv:2306.15337v1 [cs.LG])\nAbstract: The rapid progress of Artificial Intelligence research came with the development of increasingly complex deep learning models, leading to growing challenges in terms of computational complexity, energy efficiency and interpretability. In this study, we apply advanced network-based information filtering techniques to design a novel deep neural network unit characterized by a sparse higher-order graphical architecture built over the homological structure of underlying data. We demonstrate its effectiveness in two application domains which are traditionally challenging for deep learning: tabular data and time series regression problems. Results demonstrate the advantages of this novel design which can tie or overcome the results of state-of-the-art machine learning and deep learning models using only a fraction of parameters.",
    "path": "papers/23/06/2306.15337.json",
    "total_tokens": 837,
    "translated_title": "同调神经网络：多元复杂性的稀疏架构",
    "translated_abstract": "随着人工智能研究的快速发展，越来越复杂的深度学习模型的开发带来了计算复杂性、能源效率和可解释性方面日益增长的挑战。在本研究中，我们应用先进的基于网络的信息过滤技术，设计了一种新颖的深度神经网络单元，该单元以基础数据的同调结构为基础构建了一个稀疏的高阶图结构。我们在两个传统上对深度学习具有挑战性的应用领域中展示了其有效性：表格数据和时间序列回归问题。结果表明，这种新颖设计的优势在于能够仅使用部分参数与最先进的机器学习和深度学习模型并列或超越其结果。",
    "tldr": "本研究提出了一种新颖的深度神经网络架构，同调神经网络，通过应用网络过滤技术构建稀疏的高阶图结构，解决了深度学习中的计算复杂性和能源效率挑战，并在表格数据和时间序列回归问题上展示了优越的性能。",
    "en_tdlr": "This study presents a novel deep neural network architecture, Homological Neural Networks, which addresses the challenges of computational complexity and energy efficiency in deep learning by constructing a sparse higher-order graphical structure using network-based information filtering techniques. It demonstrates superior performance in tabular data and time series regression problems."
}