{
    "title": "Heart Diseases Prediction Using Block-chain and Machine Learning. (arXiv:2306.01817v1 [cs.LG])",
    "abstract": "Most people around the globe are dying due to heart disease. The main reason behind the rapid increase in the death rate due to heart disease is that there is no infrastructure developed for the healthcare department that can provide a secure way of data storage and transmission. Due to redundancy in the patient data, it is difficult for cardiac Professionals to predict the disease early on. This rapid increase in the death rate due to heart disease can be controlled by monitoring and eliminating some of the key attributes in the early stages such as blood pressure, cholesterol level, body weight, and addiction to smoking. Patient data can be monitored by cardiac Professionals (Cp) by using the advanced framework in the healthcare departments. Blockchain is the world's most reliable provider. The use of advanced systems in the healthcare departments providing new ways of dealing with diseases has been developed as well. In this article Machine Learning (ML) algorithm known as a sine-co",
    "link": "http://arxiv.org/abs/2306.01817",
    "context": "Title: Heart Diseases Prediction Using Block-chain and Machine Learning. (arXiv:2306.01817v1 [cs.LG])\nAbstract: Most people around the globe are dying due to heart disease. The main reason behind the rapid increase in the death rate due to heart disease is that there is no infrastructure developed for the healthcare department that can provide a secure way of data storage and transmission. Due to redundancy in the patient data, it is difficult for cardiac Professionals to predict the disease early on. This rapid increase in the death rate due to heart disease can be controlled by monitoring and eliminating some of the key attributes in the early stages such as blood pressure, cholesterol level, body weight, and addiction to smoking. Patient data can be monitored by cardiac Professionals (Cp) by using the advanced framework in the healthcare departments. Blockchain is the world's most reliable provider. The use of advanced systems in the healthcare departments providing new ways of dealing with diseases has been developed as well. In this article Machine Learning (ML) algorithm known as a sine-co",
    "path": "papers/23/06/2306.01817.json",
    "total_tokens": 879,
    "translated_title": "使用区块链和机器学习预测心脏疾病",
    "translated_abstract": "全球大部分人死于心脏疾病。其主要原因是医疗部门尚未建立安全的数据存储和传输基础设施。由于患者数据中的冗余性，心脏专业人士很难早期预测疾病。这种快速增加的死亡率可以通过监测和消除早期出现的一些关键因素（例如血压、胆固醇水平、体重和吸烟成瘾）来控制。在医疗部门中，心脏专业人士（Cp）可以使用先进的系统来监控患者数据，其中区块链是最可靠的提供者之一，提供了新的处理疾病的方法。本文使用了一种机器学习（ML）算法，称为正弦余弦支持向量机（Sine-Cosine SVM）。",
    "tldr": "本文研究了使用区块链和机器学习算法预测心脏疾病，并解决了现有架构下数据存储和传输的不安全性问题，有望优化心脏专业人士对于心脏病早期诊断的能力。"
}