{
    "title": "X-RiSAWOZ: High-Quality End-to-End Multilingual Dialogue Datasets and Few-shot Agents. (arXiv:2306.17674v1 [cs.CL])",
    "abstract": "Task-oriented dialogue research has mainly focused on a few popular languages like English and Chinese, due to the high dataset creation cost for a new language. To reduce the cost, we apply manual editing to automatically translated data. We create a new multilingual benchmark, X-RiSAWOZ, by translating the Chinese RiSAWOZ to 4 languages: English, French, Hindi, Korean; and a code-mixed English-Hindi language. X-RiSAWOZ has more than 18,000 human-verified dialogue utterances for each language, and unlike most multilingual prior work, is an end-to-end dataset for building fully-functioning agents.  The many difficulties we encountered in creating X-RiSAWOZ led us to develop a toolset to accelerate the post-editing of a new language dataset after translation. This toolset improves machine translation with a hybrid entity alignment technique that combines neural with dictionary-based methods, along with many automated and semi-automated validation checks.  We establish strong baselines f",
    "link": "http://arxiv.org/abs/2306.17674",
    "context": "Title: X-RiSAWOZ: High-Quality End-to-End Multilingual Dialogue Datasets and Few-shot Agents. (arXiv:2306.17674v1 [cs.CL])\nAbstract: Task-oriented dialogue research has mainly focused on a few popular languages like English and Chinese, due to the high dataset creation cost for a new language. To reduce the cost, we apply manual editing to automatically translated data. We create a new multilingual benchmark, X-RiSAWOZ, by translating the Chinese RiSAWOZ to 4 languages: English, French, Hindi, Korean; and a code-mixed English-Hindi language. X-RiSAWOZ has more than 18,000 human-verified dialogue utterances for each language, and unlike most multilingual prior work, is an end-to-end dataset for building fully-functioning agents.  The many difficulties we encountered in creating X-RiSAWOZ led us to develop a toolset to accelerate the post-editing of a new language dataset after translation. This toolset improves machine translation with a hybrid entity alignment technique that combines neural with dictionary-based methods, along with many automated and semi-automated validation checks.  We establish strong baselines f",
    "path": "papers/23/06/2306.17674.json",
    "total_tokens": 971,
    "translated_title": "X-RiSAWOZ: 高质量的多语言对话数据集和少样本代理人",
    "translated_abstract": "任务导向的对话研究主要集中在英语和中文等几种流行语言上，这是因为为新语言创建数据集的成本较高。为了降低成本，我们对自动翻译的数据进行手动编辑。我们通过将中文RiSAWOZ翻译为英语、法语、印地语、韩语以及混合英印地语的语言，创建了一个新的多语言基准数据集X-RiSAWOZ。X-RiSAWOZ每种语言都有超过18,000个经人工验证的对话语句，并且与大多数多语言之前的工作不同，它是一个用于构建完全功能代理人的端到端数据集。在创建X-RiSAWOZ时，我们遇到了许多困难，因此开发了一套工具来加快翻译后的新语言数据集的后期编辑。这套工具使用混合实体对齐技术，结合了神经网络和基于字典的方法，以及许多自动化和半自动化的验证检查，从而改进了机器翻译的性能。",
    "tldr": "X-RiSAWOZ是一个高质量的多语言对话数据集，提供了 给构建完全功能代理人的端到端数据集。开发了一套工具来加快翻译后的新语言数据集的后期编辑，提高了机器翻译的性能。",
    "en_tdlr": "X-RiSAWOZ is a high-quality multilingual dialogue dataset that provides an end-to-end dataset for building fully-functioning agents. A toolset was developed to accelerate the post-editing of translated data in order to improve machine translation performance."
}