{
    "title": "Learning to Quantize Vulnerability Patterns and Match to Locate Statement-Level Vulnerabilities. (arXiv:2306.06109v1 [cs.CR])",
    "abstract": "Deep learning (DL) models have become increasingly popular in identifying software vulnerabilities. Prior studies found that vulnerabilities across different vulnerable programs may exhibit similar vulnerable scopes, implicitly forming discernible vulnerability patterns that can be learned by DL models through supervised training. However, vulnerable scopes still manifest in various spatial locations and formats within a program, posing challenges for models to accurately identify vulnerable statements. Despite this challenge, state-of-the-art vulnerability detection approaches fail to exploit the vulnerability patterns that arise in vulnerable programs. To take full advantage of vulnerability patterns and unleash the ability of DL models, we propose a novel vulnerability-matching approach in this paper, drawing inspiration from program analysis tools that locate vulnerabilities based on pre-defined patterns. Specifically, a vulnerability codebook is learned, which consists of quantize",
    "link": "http://arxiv.org/abs/2306.06109",
    "context": "Title: Learning to Quantize Vulnerability Patterns and Match to Locate Statement-Level Vulnerabilities. (arXiv:2306.06109v1 [cs.CR])\nAbstract: Deep learning (DL) models have become increasingly popular in identifying software vulnerabilities. Prior studies found that vulnerabilities across different vulnerable programs may exhibit similar vulnerable scopes, implicitly forming discernible vulnerability patterns that can be learned by DL models through supervised training. However, vulnerable scopes still manifest in various spatial locations and formats within a program, posing challenges for models to accurately identify vulnerable statements. Despite this challenge, state-of-the-art vulnerability detection approaches fail to exploit the vulnerability patterns that arise in vulnerable programs. To take full advantage of vulnerability patterns and unleash the ability of DL models, we propose a novel vulnerability-matching approach in this paper, drawing inspiration from program analysis tools that locate vulnerabilities based on pre-defined patterns. Specifically, a vulnerability codebook is learned, which consists of quantize",
    "path": "papers/23/06/2306.06109.json",
    "total_tokens": 898,
    "translated_title": "学习量化漏洞模式并匹配以定位语句级漏洞",
    "translated_abstract": "深度学习模型在识别软件漏洞中越来越流行。先前的研究发现，不同易受攻击的程序中的漏洞可能表现出类似的易受攻击范围，这些范围形成可通过监督训练为DL模型所学的可辨认的漏洞模式。然而，漏洞的易攻击范围仍以不同的空间位置和格式在程序中表现，这导致模型准确识别易受攻击语句面临挑战。尽管如此，最先进的漏洞检测方法仍未利用易受攻击程序中出现的漏洞模式。为充分利用易受攻击模式并释放DL模型的能力，在本文中，我们提出了一种新颖的漏洞匹配方法，受程序分析工具的启发，根据预定义的模式来定位漏洞。具体而言，我们学习了一份漏洞代码库，其中包括量化漏洞模式。",
    "tldr": "该论文提出了一种新颖的漏洞匹配方法，利用学习的漏洞代码库中的漏洞模式定位易受攻击语句，以解决传统漏洞检测方法中存在的识别漏洞范围不准确的问题。",
    "en_tdlr": "This paper proposes a novel vulnerability-matching approach that exploits vulnerability patterns learned from a vulnerability codebook to locate vulnerable statements, addressing the issue of inaccurate vulnerability scope identification in traditional vulnerability detection approaches."
}