{
    "title": "Deep learning based Meta-modeling for Multi-objective Technology Optimization of Electrical Machines. (arXiv:2306.09087v2 [cs.LG] UPDATED)",
    "abstract": "Optimization of rotating electrical machines is both time- and computationally expensive. Because of the different parametrization, design optimization is commonly executed separately for each machine technology. In this paper, we present the application of a variational auto-encoder (VAE) to optimize two different machine technologies simultaneously, namely an asynchronous machine and a permanent magnet synchronous machine. After training, we employ a deep neural network and a decoder as meta-models to predict global key performance indicators (KPIs) and generate associated new designs, respectively, through unified latent space in the optimization loop. Numerical results demonstrate concurrent parametric multi-objective technology optimization in the high-dimensional design space. The VAE-based approach is quantitatively compared to a classical deep learning-based direct approach for KPIs prediction.",
    "link": "http://arxiv.org/abs/2306.09087",
    "context": "Title: Deep learning based Meta-modeling for Multi-objective Technology Optimization of Electrical Machines. (arXiv:2306.09087v2 [cs.LG] UPDATED)\nAbstract: Optimization of rotating electrical machines is both time- and computationally expensive. Because of the different parametrization, design optimization is commonly executed separately for each machine technology. In this paper, we present the application of a variational auto-encoder (VAE) to optimize two different machine technologies simultaneously, namely an asynchronous machine and a permanent magnet synchronous machine. After training, we employ a deep neural network and a decoder as meta-models to predict global key performance indicators (KPIs) and generate associated new designs, respectively, through unified latent space in the optimization loop. Numerical results demonstrate concurrent parametric multi-objective technology optimization in the high-dimensional design space. The VAE-based approach is quantitatively compared to a classical deep learning-based direct approach for KPIs prediction.",
    "path": "papers/23/06/2306.09087.json",
    "total_tokens": 878,
    "translated_title": "基于深度学习的多目标电机技术优化的元模型建模",
    "translated_abstract": "旋转电机的优化既耗时又需要计算资源。由于参数化不同，设计优化通常对每种电机技术分别执行。本文介绍了利用变分自编码器（VAE）同时优化两种不同的电机技术，即异步电机和永磁同步电机。在训练之后，我们利用深度神经网络和解码器作为元模型，通过统一的潜在空间在优化循环中预测全局关键性能指标（KPI）并生成相关新设计。数值结果表明了在高维设计空间中的并行参数化多目标技术优化。VAE方法在KPI预测上与经典的基于深度学习的直接方法进行了定量比较。",
    "tldr": "本文利用变分自编码器（VAE）在高维设计空间中同时优化了异步电机和永磁同步电机两种不同的电机技术，通过深度神经网络和解码器作为元模型，预测关键性能指标并生成新的设计。与经典的基于深度学习的直接方法相比，VAE方法表现出更好的性能。",
    "en_tdlr": "This paper utilizes a variational auto-encoder (VAE) to simultaneously optimize two different machine technologies, asynchronous machine and permanent magnet synchronous machine, in a high-dimensional design space. The VAE-based approach, using deep neural networks and decoders as meta-models, predicts key performance indicators (KPIs) and generates new designs. The VAE method outperforms the classical deep learning-based direct approach in terms of performance."
}