{
    "title": "Neuro-Symbolic Approaches for Context-Aware Human Activity Recognition. (arXiv:2306.05058v1 [cs.LG])",
    "abstract": "Deep Learning models are a standard solution for sensor-based Human Activity Recognition (HAR), but their deployment is often limited by labeled data scarcity and models' opacity. Neuro-Symbolic AI (NeSy) provides an interesting research direction to mitigate these issues by infusing knowledge about context information into HAR deep learning classifiers. However, existing NeSy methods for context-aware HAR require computationally expensive symbolic reasoners during classification, making them less suitable for deployment on resource-constrained devices (e.g., mobile devices). Additionally, NeSy approaches for context-aware HAR have never been evaluated on in-the-wild datasets, and their generalization capabilities in real-world scenarios are questionable. In this work, we propose a novel approach based on a semantic loss function that infuses knowledge constraints in the HAR model during the training phase, avoiding symbolic reasoning during classification. Our results on scripted and ",
    "link": "http://arxiv.org/abs/2306.05058",
    "context": "Title: Neuro-Symbolic Approaches for Context-Aware Human Activity Recognition. (arXiv:2306.05058v1 [cs.LG])\nAbstract: Deep Learning models are a standard solution for sensor-based Human Activity Recognition (HAR), but their deployment is often limited by labeled data scarcity and models' opacity. Neuro-Symbolic AI (NeSy) provides an interesting research direction to mitigate these issues by infusing knowledge about context information into HAR deep learning classifiers. However, existing NeSy methods for context-aware HAR require computationally expensive symbolic reasoners during classification, making them less suitable for deployment on resource-constrained devices (e.g., mobile devices). Additionally, NeSy approaches for context-aware HAR have never been evaluated on in-the-wild datasets, and their generalization capabilities in real-world scenarios are questionable. In this work, we propose a novel approach based on a semantic loss function that infuses knowledge constraints in the HAR model during the training phase, avoiding symbolic reasoning during classification. Our results on scripted and ",
    "path": "papers/23/06/2306.05058.json",
    "total_tokens": 878,
    "translated_title": "上下文感知的人类活动识别的神经符号方法",
    "translated_abstract": "深度学习模型是传感器人类活动识别的标准解决方案，但是它们的部署常常受到标记数据不足和模型的不透明性的限制。神经符号人工智能（NeSy）为缓解这些问题提供了一个有趣的研究方向，即将关于上下文信息的知识注入到HAR深度学习分类器中。然而，现有的上下文感知HAR的NeSy方法需要在分类过程中使用计算复杂的符号推理器，使它们不太适合在资源受限的设备（例如移动设备）上部署。此外，用于上下文感知的HAR的NeSy方法从未在野外数据集上进行评估，它们在现实世界场景中的泛化能力也是有问题的。在本文中，我们提出了一种基于语义损失函数的新方法，通过在训练阶段注入知识约束来避免在分类过程中进行符号推理。我们在手稿和",
    "tldr": "本文提出了一种采用语义损失函数的新方法，避免在分类过程中使用符号推理，可以解决现有上下文感知HAR的NeSy方法在部署和泛化能力方面的局限性。"
}