{
    "title": "Tensor Dirichlet Process Multinomial Mixture Model for Passenger Trajectory Clustering. (arXiv:2306.13794v1 [stat.ML])",
    "abstract": "Passenger clustering based on travel records is essential for transportation operators. However, existing methods cannot easily cluster the passengers due to the hierarchical structure of the passenger trip information, namely: each passenger has multiple trips, and each trip contains multi-dimensional multi-mode information. Furthermore, existing approaches rely on an accurate specification of the clustering number to start, which is difficult when millions of commuters are using the transport systems on a daily basis. In this paper, we propose a novel Tensor Dirichlet Process Multinomial Mixture model (Tensor-DPMM), which is designed to preserve the multi-mode and hierarchical structure of the multi-dimensional trip information via tensor, and cluster them in a unified one-step manner. The model also has the ability to determine the number of clusters automatically by using the Dirichlet Process to decide the probabilities for a passenger to be either assigned in an existing cluster ",
    "link": "http://arxiv.org/abs/2306.13794",
    "context": "Title: Tensor Dirichlet Process Multinomial Mixture Model for Passenger Trajectory Clustering. (arXiv:2306.13794v1 [stat.ML])\nAbstract: Passenger clustering based on travel records is essential for transportation operators. However, existing methods cannot easily cluster the passengers due to the hierarchical structure of the passenger trip information, namely: each passenger has multiple trips, and each trip contains multi-dimensional multi-mode information. Furthermore, existing approaches rely on an accurate specification of the clustering number to start, which is difficult when millions of commuters are using the transport systems on a daily basis. In this paper, we propose a novel Tensor Dirichlet Process Multinomial Mixture model (Tensor-DPMM), which is designed to preserve the multi-mode and hierarchical structure of the multi-dimensional trip information via tensor, and cluster them in a unified one-step manner. The model also has the ability to determine the number of clusters automatically by using the Dirichlet Process to decide the probabilities for a passenger to be either assigned in an existing cluster ",
    "path": "papers/23/06/2306.13794.json",
    "total_tokens": 972,
    "translated_title": "乘客轨迹聚类的张量狄利克雷过程多项式混合模型",
    "translated_abstract": "基于出行记录的乘客聚类对于运输运营商至关重要。然而，现有方法由于乘客行程信息的分层结构而难以轻松进行乘客聚类，即：每个乘客有多次出行，每次出行包含多维多模式信息。此外，现有方法依赖于精确指定聚类数量开始，而每天有数百万通勤者使用交通系统时这是困难的。本文提出了一种新颖的基于张量的狄利克雷过程多项式混合模型（Tensor-DPMM），通过张量保留了多维行程信息的多模式和分层结构，并以统一的一步方式对它们进行聚类。该模型还通过使用狄利克雷过程决定乘客分配至现有聚类还是形成新聚类的概率，自动确定聚类数的能力。在真实的交通运输数据集上的实验表明，我们提出的Tensor-DPMM模型在乘客轨迹聚类方面具有优越性。",
    "tldr": "提出了一种基于张量的狄利克雷过程多项式混合模型（Tensor-DPMM），通过张量保留了多维行程信息的多模式和分层结构，并以统一的一步方式进行乘客轨迹聚类，在自动确定聚类数方面具有优越性。"
}