{
    "title": "Partitioning-Guided K-Means: Extreme Empty Cluster Resolution for Extreme Model Compression. (arXiv:2306.14031v1 [cs.LG])",
    "abstract": "Compactness in deep learning can be critical to a model's viability in low-resource applications, and a common approach to extreme model compression is quantization. We consider Iterative Product Quantization (iPQ) with Quant-Noise to be state-of-the-art in this area, but this quantization framework suffers from preventable inference quality degradation due to prevalent empty clusters. In this paper, we propose several novel enhancements aiming to improve the accuracy of iPQ with Quant-Noise by focusing on resolving empty clusters. Our contribution, which we call Partitioning-Guided k-means (PG k-means), is a heavily augmented k-means implementation composed of three main components. First, we propose a partitioning-based pre-assignment strategy that ensures no initial empty clusters and encourages an even weight-to-cluster distribution. Second, we propose an empirically superior empty cluster resolution heuristic executed via cautious partitioning of large clusters. Finally, we constr",
    "link": "http://arxiv.org/abs/2306.14031",
    "context": "Title: Partitioning-Guided K-Means: Extreme Empty Cluster Resolution for Extreme Model Compression. (arXiv:2306.14031v1 [cs.LG])\nAbstract: Compactness in deep learning can be critical to a model's viability in low-resource applications, and a common approach to extreme model compression is quantization. We consider Iterative Product Quantization (iPQ) with Quant-Noise to be state-of-the-art in this area, but this quantization framework suffers from preventable inference quality degradation due to prevalent empty clusters. In this paper, we propose several novel enhancements aiming to improve the accuracy of iPQ with Quant-Noise by focusing on resolving empty clusters. Our contribution, which we call Partitioning-Guided k-means (PG k-means), is a heavily augmented k-means implementation composed of three main components. First, we propose a partitioning-based pre-assignment strategy that ensures no initial empty clusters and encourages an even weight-to-cluster distribution. Second, we propose an empirically superior empty cluster resolution heuristic executed via cautious partitioning of large clusters. Finally, we constr",
    "path": "papers/23/06/2306.14031.json",
    "total_tokens": 947,
    "translated_title": "基于划分指导的k-means算法：极端模型压缩下的极端空簇解决方法",
    "translated_abstract": "在深度学习中，紧凑性对于模型在低资源应用中的可用性至关重要，极端模型压缩的常见方法是量化。本文考虑迭代乘积量化（iPQ）与量化噪声是这一领域中的最新技术，但是这种量化框架由于存在空簇而导致推理质量下降，我们提出了几种新的增强方法，旨在通过解决空簇来提高iPQ与量化噪声的精确性。我们的贡献被称为基于划分指导的k-means算法（PG k-means），是由三个主要组成部分组成的高度增强的k-means实现。首先，我们提出了一种基于划分的预分配策略，确保没有初始空簇并鼓励均匀的权重分布。其次，我们提出了一种经验优越的空簇解决启发式算法，通过谨慎地分割大簇来执行。最后，我们限制了PG k-means的迭代总次数。",
    "tldr": "本研究提出了一种名为PG k-means的算法，基于划分来解决空簇，提高了iPQ与量化噪声的精确性。",
    "en_tdlr": "This paper proposes a Partitioning-Guided k-means (PG k-means) algorithm to improve the accuracy of Iterative Product Quantization (iPQ) with Quant-Noise in extreme model compression, by resolving empty clusters through partitioning-based pre-assignment and empirical empty cluster resolution heuristics."
}