{
    "title": "Decentralized Technologies for AI Hubs. (arXiv:2306.04274v1 [cs.AI])",
    "abstract": "AI requires heavy amounts of storage and compute with assets that are commonly stored in AI Hubs. AI Hubs have contributed significantly to the democratization of AI. However, existing implementations are associated with certain benefits and limitations that stem from the underlying infrastructure and governance systems with which they are built. These limitations include high costs, lack of monetization and reward, lack of control and difficulty of reproducibility. In the current work, we explore the potential of decentralized technologies - such as Web3 wallets, peer-to-peer marketplaces, storage and compute, and DAOs - to address some of these issues. We suggest that these infrastructural components can be used in combination in the design and construction of decentralized AI Hubs.",
    "link": "http://arxiv.org/abs/2306.04274",
    "context": "Title: Decentralized Technologies for AI Hubs. (arXiv:2306.04274v1 [cs.AI])\nAbstract: AI requires heavy amounts of storage and compute with assets that are commonly stored in AI Hubs. AI Hubs have contributed significantly to the democratization of AI. However, existing implementations are associated with certain benefits and limitations that stem from the underlying infrastructure and governance systems with which they are built. These limitations include high costs, lack of monetization and reward, lack of control and difficulty of reproducibility. In the current work, we explore the potential of decentralized technologies - such as Web3 wallets, peer-to-peer marketplaces, storage and compute, and DAOs - to address some of these issues. We suggest that these infrastructural components can be used in combination in the design and construction of decentralized AI Hubs.",
    "path": "papers/23/06/2306.04274.json",
    "total_tokens": 810,
    "translated_title": "基于去中心化技术的人工智能枢纽",
    "translated_abstract": "人工智能需要大量的存储和计算，这些资源通常存储在人工智能枢纽中。人工智能枢纽在普及人工智能方面做出了重大贡献，然而，现有的实现与基础设施和治理系统相关的某些优点和局限性有关。这些局限性包括高成本、缺乏货币化和奖励、缺乏控制和重现的困难。在本研究中，我们探讨了去中心化技术（如Web3钱包、点对点市场、存储和计算以及DAO）的潜力，以解决这些问题。我们建议这些基础设施组件可以结合使用在去中心化人工智能枢纽的设计和构建中。",
    "tldr": "本论文探讨了基于去中心化技术的人工智能枢纽的潜力，以解决传统枢纽的一些问题，如高成本、缺乏货币化和奖励、缺乏控制和重现的困难。",
    "en_tdlr": "This paper explores the potential of decentralized technologies to address some of the issues with traditional AI hubs, such as high costs, lack of monetization and reward, lack of control and difficulty of reproducibility. It suggests using a combination of decentralized infrastructure components in the design and construction of decentralized AI hubs."
}